[{"category": "", "categoryclass": "", "imagename": "91156a72166fb056977258ede7c72f7e.jpg", "infoid": 1001370, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了向客户证明他们的复数索引集合从结构数组(包括实数部分和虚数部分)更改为数组结构，我创建了他们的热点代码的简化版本，用于计算差的平方和。(=。在其最基本的情况下，这是一个for循环，它采用两个大小相等的复数值向量，计算相应实值的差值和相应虚值的差值，将两个计算的差值平方，将两个差值相加，然后将和加到运行总和中。\n为了说明我试图阐明的观点，我使用客户端原始的复杂结构数组实现了for循环计算，然后添加了另一个版本的计算循环，但是使用的结构包含实数组和虚数组。在这两种情况下，我都在C++代码中使用双精度浮点值。正如预期的那样，由于更好的数据布局，我的数组方法的结构明显好于原始的数据结构。为了更进一步，我编译了我的示例以使用AVX矢量化。这些结果为数据结构的改变提供了更好的论据。\n为了激励自己，我决定在源代码中使用AVX向量内部函数编写这两个测试的另一个版本。我意识到计算的核心相当简单：将数据复制到向量寄存器，复制和置换向量寄存器内容，进行几次乘法和一些加法。我知道所有这些操作都是受支持的，所以我转到在线Intel Intrinsics Guide页面，找出到底需要哪些内部功能。选择我的目标系统支持的技术并选择操作类别，我很快就确定了我需要的所有内部语句的作用域。也就是说，直到我意识到我需要一个减法操作才能在最终的向量寄存器中进行单独的求和的最终相加。\n还有什么比这更简单的呢？我的意思是，归约是并行计算中的基本操作，对吗？OpenMP和英特尔线程构建块都有内置的约简操作，“并发艺术”第6章的一半介绍了如何实现并行求和(约简)。听从了后者的建议(我是一个懒惰的程序员)，我去搜索了一个在线示例代码。我猜想某个地方的某个人一定已经编写了向量归约的内在版本，但在用谷歌搜索了20分钟后，我还没有找到任何接近的东西。因此，我又翻阅了“英特尔内部指南”，自己动手写了一本。\n为了防止由于长时间的期待而给读者带来压力，下面是我设计的算法的独立实现，该算法在AVX向量寄存器内减少4个双精度值，并打印出最终答案(只是为了检查结果并显示它是正确的)。在该算法中有四个步骤，将获取ymm0向量变量中的值，将四个双精度值相加，然后将该和保留在最终向量变量(Ymm4)的四个元素中的每一个元素中。在完整的代码之后，我将更详细地描述使用的四个算法步骤和内部结构中的每一个。\n#include&lt；iostream&gt；//获取AVX内部函数#include&lt；immintrin.h&gt；double outinData[4]={2.0，3.0f，2.0f，5.0f}；Double outdata[4]={0.0，0.0，0.0，0.0}；__m256d ymm0，ymm1，ymm2，ymm3，ymm4；int main(){*ymm0=_mm256。*ymm2=_mm256_add_pd(ymm0，ymm1)；*ymm3=__mm256_permute2f128_pd(ymm2，ymm2，0x01)；*ymm4=__mm256_add_pd(ymm2，ymm3)；*_mm256_storeu_pd(outdata，ymm4)；*STD。&lt；&#34；&lt；&lt；outdata[1]&lt；&lt；&#34；&lt；&lt；&outdata[2]&lt；&lt；&#34；&#34；&lt；&lt；outdata[3]&lt；&lt；std：：Endl；}。\n为了帮助描述，因为我自己是一个视觉学习者，所以我在归约算法的每个阶段对矢量变量的内容进行了说明，这将有助于显示每个AVX内在函数的操作。只是为了做一些不同和有趣的事情，我将使用排骨多米诺骨牌来表示AVX向量寄存器中的四个值。出于我的目的，我将忽略点的配置，点的颜色，瓷砖的名称，我希望您也可以。只需计算每个瓷砖上的斑点数量，即可确定矢量的每个部分内的值。(我的代码使用双精度浮点值，而说明性多米诺骨牌具有整数个点。)。\n在示例代码中，我已经将要执行约简的数据加载到ymm0变量中。(虽然我已经根据处理器中的向量寄存器命名了这些变量，但没有隐含的o\n简化的第一条指令是复制ymm0寄存器内的数据，置换向量元素的顺序，并将该置换存储在ymm1寄存器中。\n第一个参数是数据源ymm0，第二个参数是一个整数位掩码，用于控制源中元素的排列方式。最低有效位(索引[0])指定向量中最低有效元素的源(位63：0)，掩码中的第二个最低有效位(索引[1])指定向量中的下一个64位元素(位127：64)，依此类推，用于上面两个向量元素。最低有效位中的‘0’仅将最低有效64位的当前值复制到目的地；该位置中的‘1’将第二最低有效元素(位127：64)复制到最低有效目的地向量元素。对于掩码中的第二个最低有效位，相反的值将对第二个目的向量元素执行相同的操作。也就是说，‘1’将复制相同的值，而‘0’将复制最低有效向量元素。此指令与128位通道一起工作，因此矢量寄存器元素的上半部分将以相同的方式进行排列(只需将128加到所有位索引上)。\n(现在，如果您理解了我对这个内在机制操作的略微曲折的解释，那么您就比我更善于阅读。对于我们其余的人来说，下面有一张图片说明了ymm1中将存储的内容，它将至少比复杂的单词少1000个。无论采用哪种方式，我都建议您参考Intel Intrinsics Guide，以获得我正在使用的所有Intrinsics的官方说明、参数和操作。)。\n对于我的约简操作，我使用的位掩码是‘0101’(或十六进制的0x05)。这将交换值在较低的向量元素对中的位置，并交换值在较高的向量元素对中的位置。将下面的图片与上图中的图片进行比较，以确切地了解这些元素是如何在ymm1寄存器中结束的。\n这是一条非常基本的指令，采用两个源寄存器(ymm0、ymm1)，添加相应的元素，并将和存储到目标寄存器的相应元素中。下面我用两个示例源寄存器以及将存储在ymm2目标中的内容来说明这一点。\n在第二次操作之后，还原已经完成了一半。从图中我们可以看到，原始向量寄存器的两个上半部分和两个下半部分的总和已经相加，并分别复制到两个上半部分和两个下半部分中。\n要完成缩减，我只需要执行两个类似的操作：置换和添加。然而，排列将需要复制128位的矢量数据。这是通过以下内在机制实现的：\n如果您在《英特尔内部指南》中查找此说明，您会注意到前两个参数(可能)是两个不同的矢量源寄存器。我在这里使用了相同的寄存器，因为我实际上只需要置换(或复制)来自单个源的数据。与我之前使用的置换指令一样，最后一个参数是一个位掩码，用于控制复制到目标寄存器的内容。\n在我使用的文档中，位掩码使用8位，低位半字节表示复制到目标的低位128位的内容，高位半字节控制复制到256位寄存器的高位128位的值。对于两个输入源，从何处复制128位寄存器内容有4种可能：第一源(‘0’)的下半部分(位127：0)、第一源(‘1’)的上半部分(位255：128)、第二源的下半部分(‘2’)和第二源的上半部分(‘3’)。\n在研究Intrinsics Guide中的这一内在特性时，我发现一件令人困惑的事情是，虽然位掩码一次使用4位，但只有2位用于确定要复制四个数据源中的哪一个。指定位掩码时，二进制值“0001”将被视为与“1101”相同，因为最高的两个位似乎被抛出。网站上显示的操作码暗示情况就是这样。(事实并非如此。如果您很好奇，我建议您尝试一下上面的程序和第二个内在排列中的位掩码。)。就我的目的而言，我不需要担心这一点，因为我只是将同一源寄存器ymm2的高128位和低128位部分交换到目标寄存器。\n下面的示例说明了在执行此置换内在属性之后，源寄存器ymm2和目标寄存器ymm3的内容。(您看到上面指令中的位掩码‘0x21’会产生相同的结果吗？)。\n最后，现在一切就绪，简单的向量相加YMM2和YMM3寄存器将完成原始向量寄存器中的值的减去。\n这就是对AVX 256位矢量寄存器中的四个双精度元素进行求和缩减的全部内容。完整代码示例中的最后几条指令从最终向量寄存器复制四个结果值，然后将它们打印出来以确认正确答案。\n这个算法可以在不同的数据类型和不同的矢量技术下实现吗？我没有太详细地研究一般问题，但是如果有一组合适的置换内部函数可用，应该可以为不同大小和类型的数据构建类似的约简算法。\n现在您可能想知道，我在研究内部函数、解码操作细节以及尝试参数和位掩码的不同组合上所付出的努力是否值得，直到我找到了正确的公式。遗憾的是，并不是这样。将我的手工编码的差值平方和的矢量化(包括四步缩减)与编译器生成的简单for循环代码版本的矢量化进行比较，我的手工编码的矢量化只有很小的提高性能的余地。这告诉我，某个从事编译器工作的人可能已经弄清楚了与我上面描述的内容类似的东西。这里的课程只是加强了让编译器找到源代码并将其转换为矢量化代码的格言，程序员可以根据需要给出提示或进行少量重写。\n总而言之，整个演习确实有一线希望。我在想，有了这份出版物，它可能是网络上第一个(也是唯一一个)在谷歌上搜索“矢量化缩减”就会得到一个切实的算法的地方。不过，我怀疑没有人会敲开我的门来拿这个。也许我应该继续安装微波炉，定制厨房快递，移动那些冰箱和彩色电视。", "note_en": "In order to prove to a client that a change of their indexed collection of complex numbers from an array of structures (with a real part and an imaginary part) to a structure of arrays, I created a simplified version of their hotspot code for computing the sum of squared differences. At its most basic, this was a for-loop that takes two equal-sized vectors of complex values, computes the difference of corresponding real values and the difference of corresponding imaginary values, squares the two computed differences, adds the two differences together and then adds that sum to a running total.\n To illustrate the point I was trying to make, I implemented the for-loop computation with the client’s original array of complex  structs and then added another version of the computational loop, but with a structure that held an array of real and an array of imaginary values. In both cases I was using double-precision floating point values in my C++ code. As expected, due to the better layout of data, my structure of arrays method did measurably better than the original data structure. Wanting to go a bit further, I compiled my example to use the AVX vectorization. Those results were an even better argument for the change of data structure.\n Thinking to push myself, I decided to write another version of the two tests using AVX vector intrinsics in my source code. I realized that the heart of the computation was pretty simple: copy data to vector registers, duplicate and permute vector register contents, do a couple multiplications and some additions. I knew all these operations were supported, so I went to the online  Intel Intrinsics Guide page to figure out exactly what intrinsics would be needed. Choosing the technology supported by my target system and selecting categories of operations, I quickly scoped out all the intrinsic statements I needed. That is, until I came up against the realization that I would need a reduction operation to make the final addition of the separate summations within the final vector register.\n What could be easier? I mean, reduction is a basic operation in parallel computation, right? OpenMP and Intel Threading Building Blocks both have built-in reduction operations and half of Chapter 6 in The Art of Concurrency describes how to implement parallel sum (reduction). Heeding the advice in the latter (and being the lazy programmer that I am), I went in search of an online example code. I presumed someone somewhere must have already coded up a vector intrinsic version of reduction.  After 20 minutes with Google, I hadn’t found anything even close. Thus, I turned back to the Intel Intrinsics Guide and knuckled down to write one myself.\n In order to prevent any stress to my reader due to prolonged anticipation, here is my stand-alone implementation of the algorithm I devised to do a reduction of 4 double-precision values within an AVX vector register and print out the final answer (just to check results and show it was done correctly). There are four steps in the algorithm that will take the values in the  ymm0 vector variable, sum up the four double-precision values, and leave that sum in each of the four elements of the final vector variable ( ymm4). After the full code I will describe each of the four algorithmic steps and intrinsics used in more detail.\n #include &lt;iostream&gt;// get AVX intrinsics#include &lt;immintrin.h&gt;double  indata[4] = {2.0, 3.0f, 2.0f, 5.0f};double outdata[4] = {0.0, 0.0, 0.0, 0.0};__m256d ymm0, ymm1, ymm2, ymm3, ymm4;int main(){        ymm0 = _mm256_loadu_pd(indata);        ymm1 = _mm256_permute_pd(ymm0, 0x05);        ymm2 = _mm256_add_pd(ymm0, ymm1);        ymm3 = _mm256_permute2f128_pd(ymm2, ymm2, 0x01);        ymm4 = _mm256_add_pd(ymm2, ymm3);        _mm256_storeu_pd(outdata, ymm4);        std::cout &lt;&lt; &#34;Out vector: &#34; &lt;&lt; outdata[0] &lt;&lt; &#34; &#34; &lt;&lt; outdata[1] &lt;&lt; &#34; &#34; &lt;&lt; outdata[2] &lt;&lt; &#34; &#34; &lt;&lt; outdata[3] &lt;&lt; std::endl;}\n To help in the description, since I myself am a visual learner, I have put together an illustration of the contents of the vector variables at each phase of the reduction algorithm that will assist in showing the operation of each of the AVX intrinsics. Just for the sake of doing something different and interesting I will be using Pai Gow dominoes to represent the four values within the AVX vector registers. For my purposes I will ignore the configuration of dots, the color of the dots, the name of the tiles, and I hope you can, too. Simply count the number of spots on each of the tiles to determine the value within each part of the vector. (My code is using double-precision floating point values while the illustrative dominoes have an integral number of dots.)\n In the example code, I have loaded the data on which to perform the reduction into the  ymm0 variable. (Though I’ve named these variables after the vector registers within the processor, there is no implied or explicit mapping of my names to the actual registers used within the compiled code. Also, rather than saying “vector variable” for these, I will call them “registers” just to be less verbose.) To get started, the program simply loads the values of  indata into  ymm0. If this algorithm were incorporated in the sum of squared differences code that was driving this whole thing, this initial data would be the results of those vectorized computations. In any event, the data to be reduced starts in the  ymm0 register. Here’s my illustration of initial data of 4 values:\n  The first instruction for the reduction is to copy the data within the  ymm0 register, permute the order of the vector elements and store this permutation in the  ymm1 register.\n  The first parameter is the source of the data,  ymm0, and the second is an integer bitmask to control how the elements from the source are permuted. The least significant bit (index [0]) specifies the source of the least significant element in the vector (bits 63:0), the second least significant bit in the mask (index [1]) specifies the next 64-bit element in the vector (bits 127:64), and so on for the upper two vector elements. A ‘0’ in the least significant bit merely copies the current value of the least significant 64 bits into the destination; a ‘1’ in this position will copy the second least significant element (bits 127:64) into the least significant destination vector element. For the second least significant bit in the mask, the opposite values will perform the same operations into the second destination vector element. That is, a ‘1’ will copy the same value while a ‘0’ will copy the least significant vector element. This instruction works with 128-bit lanes, so the upper half of the vector register elements will be permuted the same way (just add 128 to all the bit indices).\n (Now, if you followed my marginally tortuous explanation of the operation of this intrinsic, then you’re a better reader than I am. For the rest of us, there is a picture below illustrating what will be stored in  ymm1, which will be worth at least 1000 less convoluted words. Either way, I suggest that you consult the Intel Intrinsics Guide for the official explanation of the instructions, the parameters, and the operation of all the intrinsics I’m using.)\n For my reduction operation, the bit mask I used is ‘0101’ (or 0x05 in hexadecimal). This will exchange the position of the values in the lower pair of vector elements and exchange the position of the values in the upper pair of vector elements. Compare the picture below with the picture in the figure above to see exactly how the elements end up in the  ymm1 register.\n    This is a pretty basic instruction taking two source registers ( ymm0,  ymm1), adding the corresponding elements, and storing the sums into the corresponding elements of the destination register. I’ve illustrated this below with the two example source registers and what would be stored in the  ymm2 destination.\n  After the second operation, the reduction is halfway complete. From the illustration we can see that the sum of the two upper and the two lower halves of the original vector register have been summed and are duplicated in the two upper elements and two lower elements, respectively.\n To finish the reduction, I simply need to execute two similar operations: permute and add. The permutation, however, will need to copy 128-bits of vector data. This is done with the following intrinsic:\n  If you look up this instruction in the Intel Intrinsics Guide, you will notice that the first two parameters are (potentially) two different vector source registers. I’ve used the same register here since I really only need to permute (or copy) data from a single source. As with the previous permutation instruction I’ve used, the last parameter is a bitmask to control what gets copied to the destination register.\n From the documentation I was using, the bitmask uses eight bits with the lower nibble dictating what is copied to the lower 128 bits of the destination and the upper nibble controlling the value copied into the upper 128 bits of the 256-bit register. With two input sources, there are 4 possibilities from where to copy 128-bit register contents: lower half (bits 127:0) of first source (‘0’), upper half (bits 255:128) of first source (‘1’), lower half of second source (‘2’), and upper half of second source (‘3’).\n One thing I found confusing when researching this intrinsic in the Intrinsics Guide is that while the bitmasks are used 4-bits at a time, only 2 bits are used to determine which of the four sources of data are to be copied. When specifying the bitmask, it would appear that a binary value of ‘0001’ will be treated the same as ‘1101’ since the two uppermost bits appear to be thrown out. The operation code shown on the site would imply that this is the case. (It isn’t. If you’re curious, I urge you to play around with the program above and the bitmask in the second permutation intrinsic.) For my purposes, I didn’t need to worry about this since I was simply swapping the upper and lower 128-bit sections of the same source register,  ymm2, into the destination register.\n The example illustration below shows the source register,  ymm2, and the contents of the destination register,  ymm3, after this permutation instrinsic is executed. (Can you see that a bitmask of ‘0x21’ in the above instruction would yield the same results?)\n  Finally, now that everything is lined up, a simple vector addition of the  ymm2 and  ymm3 registers will complete the reduction of the values from the original vector register.\n    And that’s all there is for doing a sum reduction on the four double-precision elements from an AVX 256-bit vector register. The last couple of instructions from the full code example copy the four results values from the final vector register and then print them out for confirmation of the correct answer.\n Can this algorithm be done with different data types and under different vector technologies? I haven’t looked at the general problem in too much detail, but if there are a set of appropriate permutation intrinsics available, it should be possible to construct a similar reduction algorithm for different sizes and types of data.\n Now you might be wondering whether or not the effort I put into researching intrinsics, decoding the operation details, and trying different combinations of parameters and bit masks until I figured out the right formula was worth it all. Sadly, not really. Comparing my hand-coded vectorization of the sum of squared differences, including the four-step reduction, to the compiler generated vectorization of the simple for-loop code version, there was a very slim margin of better performance from my hand-coded vectorization. This tells me that someone working on the compiler has probably already figured out something similar to what I have described above. The lesson here just reinforces the adage about  letting the compiler find and transform your source code into vectorized code with the programmer giving hints or small rewrites as needed.\n All in all, the whole exercise does have a silver lining. I’m thinking that, with this publication, it might be the first (and only) place on the web where a Google search for “vectorized reduction” will yield a tangible algorithm. I doubt anyone will be beating down my door to get this, though. Perhaps I should have kept installing microwave ovens custom kitchen deliveries and moving those refrigerators and color TVs.", "posttime": "2020-05-09 16:57:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "归约,vectorized", "title": "你能写一个矢量化的归约运算吗？(2016)", "title_en": "Can You Write a Vectorized Reduction Operation? (2016)", "transed": 1, "url": "https://software.intel.com/content/www/us/en/develop/blogs/can-you-write-a-vectorized-reduction-operation.html", "via": "", "real_tags": ["归约"]}, {"category": "", "categoryclass": "", "imagename": "4b7d9ecba1881eda1176c27aaa7da297.png", "infoid": 1001369, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "==*解释器：**Python：3.5.4|蟒蛇自定义(64位)|(默认，2017年10月13日，**11：22：58)**[GCC 7.2.0]*color-Science ence.org：**color：v0.3.15-124-ge226e02*运行时：**ImageIO：2.6.1**matplotlib：2.1.1**networkx：2.4**numpy：1.17.3**熊猫：0.19.2**scipy：1.1.0**Six：1.11.0*==", "note_en": "===============================================================================* ** Interpreter : ** python : 3.5.4 |Anaconda custom (64-bit)| (default, Oct 13 2017, ** 11:22:58) ** [GCC 7.2.0] ** ** colour-science.org : ** colour : v0.3.15-124-ge226e02 ** ** Runtime : ** imageio : 2.6.1 ** matplotlib : 2.1.1 ** networkx : 2.4 ** numpy : 1.17.3 ** pandas : 0.19.2 ** scipy : 1.1.0 ** six : 1.11.0 ** *===============================================================================", "posttime": "2020-05-09 16:42:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,free,color", "title": "Google Colab Free Tier比Azure笔记本Free Tier快x41", "title_en": "Google Colab Free Tier Was X41 Faster Than Azure Notebooks Free Tier", "transed": 1, "url": "https://github.com/microsoft/AzureNotebooks/issues/816", "via": "", "real_tags": ["google", "free", "color"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001368, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载PDF摘要：编年史美国是国家数字报纸计划的一个产品，该计划是国会图书馆和国家人文基金会的合作伙伴关系，旨在将历史报纸数字化。到目前为止，超过1600万页的美国历史报纸已经数字化，以记录美国，并配有高分辨率图像和机器可读的METS/ALTO OCR。记录美国用户相当感兴趣的是一个语义化的语料库，其中包括提取的视觉内容和标题。为了实现这一点，我们引入了一个视觉内容识别模型，该模型针对照片、插图、地图、漫画和社论漫画的包围框注释进行了培训，这些注释是作为国会图书馆的Beyond Words众包计划的一部分收集的，并增加了其他注释，包括标题和广告的注释。我们描述了我们的管道，它利用这个深入的模型来提取7类视觉内容：标题、照片、插图、地图、漫画、社论漫画和广告，其中包括来自METS/ALTO OCR的字幕等文本内容，以及用于快速图像相似性查询的图像嵌入。我们报告了从编年史上的美国语料库中运行管道的1630万页的结果，并描述了由此产生的报纸导航器数据集，这是有史以来从历史报纸中提取的视觉内容的最大数据集。新的报纸导航器数据集、优化的可视内容识别模型和所有源代码都放在公共领域中，以便不受限制地重复使用。", "note_en": "Download PDF  Abstract: Chronicling America is a product of the National Digital Newspaper Program, apartnership between the Library of Congress and the National Endowment for theHumanities to digitize historic newspapers. Over 16 million pages of historicAmerican newspapers have been digitized for Chronicling America to date,complete with high-resolution images and machine-readable METS/ALTO OCR. Ofconsiderable interest to Chronicling America users is a semantified corpus,complete with extracted visual content and headlines. To accomplish this, weintroduce a visual content recognition model trained on bounding boxannotations of photographs, illustrations, maps, comics, and editorial cartoonscollected as part of the Library of Congress&#39;s Beyond Words crowdsourcinginitiative and augmented with additional annotations including those ofheadlines and advertisements. We describe our pipeline that utilizes this deeplearning model to extract 7 classes of visual content: headlines, photographs,illustrations, maps, comics, editorial cartoons, and advertisements, completewith textual content such as captions derived from the METS/ALTO OCR, as wellas image embeddings for fast image similarity querying. We report the resultsof running the pipeline on 16.3 million pages from the Chronicling Americacorpus and describe the resulting Newspaper Navigator dataset, the largestdataset of extracted visual content from historic newspapers ever produced. TheNewspaper Navigator dataset, finetuned visual content recognition model, andall source code are placed in the public domain for unrestricted re-use.", "posttime": "2020-05-09 16:40:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "报纸,newspaper,美国", "title": "报纸导航器数据集：1600万页历史报纸", "title_en": "The Newspaper Navigator Dataset: 16M Historic Newspaper Pages", "transed": 1, "url": "https://arxiv.org/abs/2005.01583", "via": "", "real_tags": ["报纸", "newspaper", "美国"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001367, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "C和C++预处理器类似于Windows命令提示符批处理语言：它们实现了一种非常简单的语言，人们出于某种原因仍在使用该语言，通常是通过将其推到超出其原始设计边界的方式。\n预处理器并不真正理解C或C++语言。幸运的是，它使用的算术运算符与C和C++语言使用的算术运算符相同，但它对它们的理解仅限于整数。\n预处理程序参数中逗号的处理非常简单：用逗号分隔宏参数。保护逗号的唯一方法是将其括在匹配的括号中。\n请注意，小于号和大于号不保护逗号。如果要将模板实例化作为宏参数传递，这可能会造成混淆。\n预处理器不够聪明，无法意识到您传递的是模板实例化。毕竟，也许你想要这个：\n在本例中，小号和大于号用作比较运算符。但从预处理程序的角度来看，尖括号。\n基本上是一回事。它无法知道第一种匹配的尖括号是模板实例化，而第二种情况只是一对比较运算符。甚至连编译器都不知道，因为我们还在进行预处理。编译尚未进行。", "note_en": "The C and C++ preprocessors are like the Windows command prompt batch language: They implement a very simple language that people still use for some reason, usually by pushing it way beyond its original design boundaries.\n The preprocessors don’t really understand the C or C++ language. It does, fortunately, use the same arithmetic operators that the C and C++ language uses, but its understanding of them is limited to integers.\n The treatment of commas in preprocessor arguments is very simple: Commas separate macro arguments. The only way to protect a comma is to enclose it in matched parentheses.\n  Note that the less-than and greater-than signs do not protect commas. This can create confusion if you want to pass a template instantiation as a macro parameter.\n  The preprocessor isn’t smart enough to realize that what you passed was intended to be a template instantiation. After all, maybe you wanted this:\n  In this case, the less-than and greater-than signs are intended to be the comparison operators. But from the preprocessor’s point of view, the angle brackets in\n    are basically the same thing. It has no way of knowing that the first case of matched angle brackets is a template instantiation, whereas the second is just a pair of comparison operators. Not even the compiler knows, because we are still preprocessing. Compilation hasn’t happened yet.", "posttime": "2020-05-09 15:04:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "c++,语言", "title": "C++预处理器不理解任何关于C++的内容，包括模板", "title_en": "The C++ preprocessor doesn’t understand anything about C++, including templates", "transed": 1, "url": "https://devblogs.microsoft.com/oldnewthing/20200508-52/?p=103735", "via": "", "real_tags": ["c++", "语言"]}, {"category": "", "categoryclass": "", "imagename": "6ebac5ae71396c91b2e471e3a6ee3871.jpg", "infoid": 1001366, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“程序员能逃脱调用/返回的温和暴政吗？”马塞尔·韦赫(Marcel Weiher)提交，斯蒂芬·凯尔(Stephen Kell)回应。", "note_en": "\"Can Programmers Escape the Gentle Tyranny of call/return?\" presented by Marcel Weiher, response by Stephen Kell.", "posttime": "2020-05-09 14:23:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,程序员,computing,kell", "title": "快乐计算：程序员能逃脱调用/返回的温和暴政吗？", "title_en": "Convivial Computing: Can Programmers Escape the Gentle Tyranny of Call/Return?", "transed": 1, "url": "https://www.youtube.com/watch?v=Gel8ffr4pqw&list=PL0t4cuggBuVbHVgGgals3R4bYzj9OXd4R&index=3&t=0s", "via": "", "real_tags": ["程序", "程序员", "computing", "kell"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001365, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新加坡-从周五(5月8日)开始，一个四条腿的机器人将在璧山恒茂桥公园巡逻，提醒人们安全距离措施。\n这款名为Spot的机器人将在国家公园委员会(NParks)管理的公园、花园和自然保护区以及镇议会管理的公园协助安全疏散工作。\n试点试验由NParks以及智能国家和数字政府集团(SNDGG)联合进行。\nSpot机器人将播放录音信息，提醒公园游客遵守安全距离措施。\n它配备了摄像头，由Govtech开发的视频分析技术实现，以帮助它估计公园里的游客数量。\n然而，这些摄像头将无法跟踪或识别特定的个人，也不会收集任何个人数据。\n作为为期两周的试验的一部分，Spot将在非高峰时间部署在公园河谷平原段3公里的范围内，并将由至少一名NParks官员陪同。\n如果试验证明成功，NParks将考虑在上午和晚上高峰时间在璧山-昂毛桥公园部署Spot进行安全距离测量。\nNParks还在考虑在裕廊湖花园等其他公园部署该机器人。\n这种四条腿的机器人最初由美国波士顿动力公司开发，与轮式机器人相比，它能够更有效地穿越障碍物，使其适用于不同的地形。\n它还配备了安全传感器，可以检测1米范围内的物体和人，以避免碰撞。\nGovtech增强了SPOT的各种功能，如远程控制、3D地图和半自动操作，以方便试验。\n该公司目前正在寻求开发分析方法，使Spot能够检查公园游客是否遵守了安全距离措施。\n由于它是远程控制的，公园巡逻所需的人力较少，有助于将工作人员、安全疏远大使和公园游客之间的身体接触降至最低。这有助于降低他们接触冠状病毒的风险。\nNParks还部署了30架无人机，以检测选定公园和自然区的游客情况。\n此外，公园入口处的安全距离让公众可以找到附近的公园，并在前往公园之前检查公园的人群情况。\nSpot机器人目前还在樟宜展览中心社区隔离设施进行试验，该设施收容有轻微症状的患者，以帮助向患者运送药品等基本物品。\nSNDGG还将探索使用该机器人来支持跨机构的其他冠状病毒相关操作。\n这个四轮机器人最初是用来监控的，但现在它在公园里广播安全距离信息，因为它在早上和晚上人流量最高的时候巡逻。", "note_en": "SINGAPORE - A four-legged robot will be patrolling Bishan-Ang Mo Kio Park to remind people of safe distancing measures starting from Friday (May 8).\n Called Spot, the robot will assist with safe distancing efforts at parks, gardens and nature reserves managed by National Parks Board (NParks) and at parks managed by town councils.\n The pilot trial is jointly conducted by NParks, and the Smart Nation and Digital Government Group (SNDGG).\n  The Spot robot will broadcast a recorded message reminding park visitors to observe safe distancing measures.\n It is fitted with cameras, enabled by GovTech-developed video analytics, to help it estimate the number of visitors in the parks.\n The cameras, however, will not be able to track or recognise specific individuals, neither will it collect any personal data.\n   As part of the two-week trial, Spot will be deployed over a 3km stretch in the River Plains section of the park during off-peak hours, and it will be accompanied by at least one NParks officer.\n If the trial proves successful, NParks will consider deploying Spot for safe distancing efforts at Bishan-Ang Mo Kio Park in the morning and during evening peak-hours.\n NParks is also looking into deploying the robot at other parks such as Jurong Lake Gardens.\n Originally developed by American company Boston Dynamics, the four-legged robot is able to navigate obstacles more effectively compared to wheeled robots, making it suitable for different terrains.\n  It is also fitted with safety sensors to detect objects and people within 1m to avoid collision.\n   GovTech has enhanced Spot with various functions such as remote control, 3D-mapping and semi-autonomous operations to facilitate the trial.\n It is currently looking to develop analytics allowing Spot to check if park visitors are observing safe distancing measures.\n  As it is controlled remotely, less manpower is needed for park patrols, helping to minimise physical contact among staff, safe distancing ambassadors and park visitors. This helps to lower their risk of exposure to the Covid-19 virus.\n   NParks is also deploying 30 drones to detect visitorship at selected parks and nature areas.\n In addition, the Safe Distance At Parks portal lets the public find parks near them, as well as check the crowd situation at the parks before making their way there.\n The Spot robot is also currently on trial at the Changi Exhibition Centre community isolation facility, which houses patients with mild symptoms, to help deliver essential items such as medicine to patients.\n  The SNDGG will also be exploring the use of the robot in supporting other Covid-19-related operations across agencies.\n    The four-wheeled robot was originally used for surveillance, but it now broadcasts safe distancing messages at the park as it patrols the area in the mornings and the evenings when human traffic is at its highest.", "posttime": "2020-05-09 13:48:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "动力,dynamics,公园", "title": "波士顿动力机器狗提醒游客公园安全距离规则", "title_en": "Boston Dynamics RoboDogs Remind Visitors of Safe Distancing Rules at Public Park", "transed": 1, "url": "https://www.straitstimes.com/singapore/robot-reminds-visitors-about-safe-distancing-measures-in-bishan-ang-mo-kio-park", "via": "", "real_tags": ["动力", "dynamics", "公园"]}, {"category": "", "categoryclass": "", "imagename": "6f1cff3aa8931e1e06ddf82482f6972a.jpg", "infoid": 1001359, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "冠状病毒危机提供了迄今为止最明显的证据，表明减少洛杉矶的汽车使用量将极大地改善该地区的空气质量。\n从长远来看，加州必须减少车辆出行，以减少温室气体排放，延缓气候变化。\n与人们可能预期的相反，南加州最大的挑战不一定是基础设施(尽管美国高昂的地铁建设成本阻碍了发展)，而是土地利用。\n有限的住房开发，特别是在像西区这样的就业机会丰富的地区，已经导致房价上涨，将低收入和中等收入家庭转移到郊区外围。这迫使那些可能曾经依赖于活跃的或公共交通的人购买汽车，并长途通勤上班。\n洛杉矶目前的发展动力集中在市中心和周边的东区社区。这一战略在一定程度上是近郊房主坚决反对开发的结果。但这也反映了商界和政界领导层想要复制东海岸(即曼哈顿)的愿望，即以多中心的大都市为中心，以高层“核心”为中心。\n正如我之前写过的，这种对市中心“重新开发”的关注鼓励了向上分区应该与之抗衡的士绅化。它也没有发展到足以压低房价的地步。\n与其试图重建19世纪的东海岸或欧洲城市，洛杉矶应该像东亚的20和21个特大城市一样建设起来。\n首尔和东京的中高密度、无定形的蔓延更符合洛杉矶的城市发展模式，而不是芝加哥、纽约或伦敦有序的核心和外围模式。\n沿着东亚线路发展住房和交通将带来更高的交通使用率、更低的排放和更具活力的经济。它还将抵消在政策讨论中将东亚边缘化的长期传统。\n我对城市政策的了解比对公共卫生的了解要多得多，所以关于口罩，我要说的一件事是，美国官员长期以来似乎一直狂热地反对从亚洲发达地区学习任何有关住房政策或交通运输的知识。\n-Matthew Yglesias(@mattyglesias)2020年3月28日。\n首尔和洛杉矶的城市化地区都覆盖了大片领土。大洛杉矶从文图拉延伸到特梅库拉，绵延130多英里。首尔首都地区包括京吉道以及首尔和仁川两个独立城市，占韩国陆地面积的12%以上。\n首尔人口稠密。在首尔中央商务区以西18英里的地方旅行，来到仁川的城南洞附近，你会发现自己仍然处于紧凑的城市环境中。\n该社区狭窄的街道，中等高度的建筑(相对于街道)和多样化的临街土地用途，使得该地区很容易步行到达。\n洛杉矶经常被嘲笑为“一个巨大的郊区”。但它广阔的郊区已经建成了相当多的建筑。\n前往洛杉矶市中心以南18英里，来到中北部的长滩，你仍然处在一个小地块和紧凑的街道网格的社区里。开发强度低于首尔，但高于刻板印象的郊区。在居民区街道上，两三层的公寓楼和独栋住宅交替出现。太平洋海岸公路的汽车商店和脱衣舞商场有很多不尽如人意的地方，但一些南北走向的街道，如太平洋大道，有更多的临街零售店。\n相比之下，在曼哈顿中城以东18英里的地方旅行，会把你带到长岛的花园城(Garden City)，这是一个几乎完全是住宅区，以宽敞的地块上的独栋住宅为主。\n欧洲-大西洋核心-外围发展模式包含了洛杉矶和首尔都大大超过的密度。\n和洛杉矶一样，近年来首尔的就业机会和人口都分散了。早在1997年，仁川和水原等郊区的就业率就与首尔市中心不相上下。\n除了首尔的郊区密度比洛杉矶更密集，更适合步行。\n我将在以后的文章中更详细地介绍LA可以做什么。一些一般提示：\n街道变窄了，使得开车变得更加困难(因为街道无法容纳“高峰时期”的车辆拥堵)，也更容易过马路。\n这些建筑更高，间隔更紧密，本质上更具混合用途，缩短了不同活动点之间的步行距离。注：洛杉矶的分区法禁止这样做！\n快速交通系统(地铁+通勤轨道)范围更广，辐射焦点更小。城南岛有一条贯穿仁川南北轴线的地铁线。这条线路通过仁川港(向南)和东西线(向北)连接就业中心和首尔市中心。相比之下，洛杉矶遵循芝加哥/纽约的模式，安排铁路(和许多公共汽车)线路在市中心汇合。\n私家车在首尔只有23.5%的模式份额，而洛杉矶的模式份额为70%。近40%的首尔人乘坐地铁出行，另有28%的人乘坐公交车出行。\n另一方面，首尔“普通”社区的工作室平均价格只有537美元。", "note_en": "The COVID-19 crisis provides the most visible evidence yet that reducing automobile use in Los Angeles would drastically improve the region’s  air quality.\n  Longer term,  C alifornia must cut down on vehicle travel in order to reduce Greenhouse Gas Emissions and stave off climate change.\n Contrary to what one might expect, the biggest challenge in Southern California is not necessarily infrastructure (although America’s high  subway construction costs impede development) but land use.\n Limited housing development, particularly in jobs-rich areas like the Westside, has led to rising home prices, displacing low- and mid-income households to the suburban periphery. This forces populations that might have once relied on active or public transportation to buy automobiles and commute long distances to work.\n The current development  dynamics in Los Angeles concentrate density in Downtown and surrounding Eastside neighborhoods. This strategy is partly the result of staunch opposition to development from inner suburban homeowners. But it also reflects a business and political leadership’s desire to  copy the East Coast (i.e. Manhattan) by centering the poly-centric metropolis around a high-rise “core.”\n  As I have  written previously, this focus on “re-developing” the inner city encourages the very gentrification that up-zoning should combat. It also fails to develop enough to make a dent in housing prices.\n Rather than try to recreate the 19th-century cities of East Coast or Europe, Los Angeles should build out like the twentieth- and twenty-first mega-cities of East Asia.\n  The mid- to high-dense, amorphous sprawl of Seoul and Tokyo more closely matches the urban development pattern of Los Angeles than the ordered core-and-periphery pattern of Chicago, New York or London.\n Developing housing and transit along East Asian lines would result in higher transit use, lower emissions and a more vibrant economy. It would also counteract a longstanding tradition of marginalizing East Asia in policy discussions.\n I know a lot more about urban policy than I do about public health, so one thing I’ll say about the masks is American officials have long seemed fanatically opposed to the idea of learning anything about housing policy or transit from developed Asia.\n— Matthew Yglesias (@mattyglesias)  March 28, 2020\n   Both Seoul and LA’s urbanized areas cover a broad swath of territory. Greater Los Angeles extends for more than 130 miles–from Ventura to Temecula. The  Seoul Capital Area, which incorporates Gyeonggi Province and the independent cities of Seoul and Incheon, encompasses more than 12 percent of South Korea’s landmass.\n  Seoul sprawls densely. Travel 18 miles west of Seoul’s Central Business District, to Incheon’s Seongnam-Dong neighborhood, and you’ll still find yourself in a compact urban setting.\n  The neighborhood’s narrow streets, moderately-tall buildings (relative to the street) and diverse street-fronting land uses, make the area easily accessible by foot.\n Los Angeles is frequently derided as “one giant suburb.” But its expansive suburbs are quite built up.\n  Travel 18 miles south of Downtown Los Angeles, to north-central Long Beach and you’re still in a neighborhood of small parcels and tight street grids. Development intensities are lower than in Seoul but higher than in the stereotypical suburb. On the residential streets, two to three story apartment buildings alternate with single-family homes. Pacific Coast Highway’s auto shops and strip malls leave a lot to be desired but some of the north-south streets like Pacific Avenue have more street-fronting retail.\n  By contrast, traveling 18 miles east of Midtown Manhattan brings you to Long Island’s Garden City, an almost exclusively residential area, dominated by single-family homes on spacious lots.\n    The Euro-Atlantic core-periphery development model contains density within an envelope that both LA and Seoul greatly exceed.\n As in LA, both jobs and population have dispersed in Seoul in recent years. As early as 1997, suburbs like Incheon and Suwon rivaled the central area of Seoul in employment.\n  Except Seoul’s suburban density is denser and more walkable than LA’s.\n  I will get more into the specifics of what LA can do in a future article. Some general pointers:\n The streets are narrower, making it more difficult to drive (since the streets can’t accommodate “peak period” vehicle congestion) and easier to cross the street.\n The buildings are taller, more tightly spaced and more mixed-use in nature, reducing walking distances between different activity points.  Note: LA’s zoning laws prohibit this!\n The rapid transit system (subway+commuter rail) is more extensive, with a less radial focus. Seongnam-do is served by a subway line running on a north-south axis through Incheon. This connects with both the employment centers by the port of Incheon (to the south) and an east/west line (to the north) connecting to Downtown Seoul. LA, by contrast, follows the Chicago/New York model of routing rail (and many bus) lines to converge on Downtown.\n    Private cars only have a  23.5 percent mode share in Seoul, compared to a  70 percent mode share in LA. Almost 40 percent of Seoul-ites travel by subway and another 28 percent travel by bus.\n  On the other hand, the average cost for a studio in a “normal” neighborhood in Seoul is only  537 dollars.", "posttime": "2020-05-09 11:11:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "应该,la,洛杉矶", "title": "洛杉矶应该如何城市化？把目光投向首尔", "title_en": "How should LA urbanize? Look to Seoul", "transed": 1, "url": "https://entrepot.blog/2020/05/08/how-should-la-urbanize-look-to-south-korea", "via": "", "real_tags": ["应该", "la", "洛杉矶"]}, {"category": "", "categoryclass": "", "imagename": "26c5adbc25662dde22bcd005511987ee.jpg", "infoid": 1001358, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "冠状病毒大流行最令人恼火的问题之一是，实际上有多少人被感染。我们知道检测不充分，而且许多病例都是轻微的，甚至是没有症状的，这使得他们不太可能被发现。那么有多少案件没有被注意到呢？\n找出这种疾病真实流行情况的一种方法是随机抽取人群样本，使用血液测试来检测免疫系统产生的针对病毒的抗体。这与在整个大流行期间在全球范围内使用的拭子检测不同，后者检测病毒本身的遗传物质。\n血液测试只需要针刺一下，可以在护理点进行，因此比拭子测试更快、更容易处理，在棉签测试中，样本需要运往实验室。血液检测也很有帮助，因为可以从更大的人群中评估疾病的流行率，其中可能包括已经从疾病中康复的人，因为它检测到的抗体即使在康复后也会留在血液中。然而，由于感染后需要几天才能产生抗体，这些测试不能取代拭子测试，因为这是在疾病传播给其他人之前发现新病例的非常重要的目的。\n抗体测试的大部分注意力集中在如何通过让我们更好地了解感染人数，从而更好地了解感染人数的真实死亡率，来帮助我们估计冠状病毒到底有多致命。如果因为有许多未诊断的感染，感染人数比预期要多得多，那就意味着死于感染的概率比我们只看确诊病例的概率要低得多。一些人曾希望抗体测试可以告诉我们，病毒“并不像我们想象的那样致命”，因此可能会为有关限制性社会疏远政策的“更好的政策决策”提供信息。\n圣克拉拉的研究最近有几次尝试使用这些血液测试来确定疾病的流行率，以及随之而来的真实死亡率。其中一项备受关注的研究是斯坦福大学研究人员在硅谷周围的大都市圣克拉拉县进行的一项研究。通过对从Facebook调查中招募的受试者进行血液测试，研究人员估计，该社区的感染流行率比确认的诊断显示的要高得多，死亡率也要低得多。\n在4月17日这篇论文的最初预印版中，他们估计，该县2.5%到4.1%的人受到了感染，是当时诊断出的大约1000例病例的50到85倍。根据这些数字，他们估计这种疾病的感染死亡率在0.12%到0.2%之间，远远低于美国确诊病例约5%的死亡率，也不会比季节性流感0.1%的死亡率高出多少。\n这项研究当时受到了广泛批评，尽管研究人员在4月30日发表了针对其中一些批评的论文修订版，但他们的背线结果并没有太大变化：他们对圣克拉拉县疾病流行率的估计现在在1.3%到4.7%之间(扩大了他们早先的范围)，而他们对感染死亡率的估计现在是0.17%(在他们早先的范围内)。\n对这篇论文的批评集中在两个主要弱点上。首先，作者报告了相对较高的假阳性率，这在圣克拉拉这样没有发生重大疫情的地方尤其成问题。其次，批评人士表示担心，那些怀疑自己可能患有未诊断的冠状病毒感染的人可能更有可能参与调查，从而扭曲了结果。让我们依次来看看这些问题，以及研究人员在修订后的论文中是如何回应这些担忧的。\n研究人员最初报告说，他们在使用前进行的实验室测试试图验证他们的检测试剂盒，假阳性率为0.5%。这可能看起来不算多。但在他们的实际调查中，只有1.5%的测试结果呈阳性。(他们更高的最终患病率估计是通过调整样本中的人口因素得出的。)。这将表明，他们的积极结果中有三分之一可能是错误的。但0.5%只是对他们的假阳性率的“点估计”，这是基于他们在有限的验证测试中观察到的错误数量，实际的假阳性率可能更高或更低。\n批评人士认为，从统计学上讲，假阳性率可能比研究人员发现的阳性结果的数量还要高，这在统计学上是可信的。这将意味着他们发现的阳性结果将与没有真正的阳性病例一致。当然，没有人相信圣克拉拉县确实没有真正的冠状病毒阳性病例。但是，当假阳性率与检测到的阳性结果的数量在统计上一致时，这就让人对测试提供的证据的质量产生了怀疑。\n然而，在他们最新的论文中，作者运行了更多的测试来验证他们的试剂盒的性能，以提供更准确的假阳性率估计；他们对假阳性率的点估计仍然是0.5%，但上限只有0.8%，下限只有0.3%，这可以让我们对他们结果的准确性有更大的信心。\n第二个令人担忧的领域是参与研究的志愿者中的样本偏见。这些受试者是通过Facebook调查招募的，然后驱车前往考点。很有可能，许多决定自愿接受免费冠状病毒检测的人都有一些怀疑，认为自己在没有接受检测的情况下就已经感染了这种疾病。在论文的最新草稿中，作者报告称，他们的受试者中有3%在过去两周内出现咳嗽和发烧，20%的人在过去两个月内出现症状，报告症状的人比没有症状的人更有可能接受阳性抗体检测。\n作者推测，“咳嗽+发烧的参与者比例实际上可能低于加州的典型比例，如果是这样的话，估计患病率的偏差甚至可能是相反的方向。”但他们没有给出加州人口报告发烧和咳嗽症状的典型比例。他们声称的来源是疾控中心的全国流感样疾病历史水平地图，但该地图只报告了从“最低”到“非常高”的相对水平，而不是疾病的数字流行率。加州卫生部地图的基础数据是基于流感住院率，而不是有流感样症状的总人数。话虽如此，目前尚不清楚这种样本偏差可能对他们的估计产生了多大影响。\n在他们最新的论文中，斯坦福大学的研究人员解决了他们对圣克拉拉冠状病毒流行率的初步估计提出的一些更重要的批评。然而，他们关于总感染死亡率的发现仍然很难与纽约的观察死亡率相一致。\n纽约健康检查根据纽约市卫生局的数据，截至两天前，已有13938例确诊的冠状病毒死亡病例，另外还有5359例可能的死亡病例。这座城市的人口约为860万，这意味着如果我们只包括确诊的死亡人数，那么整个城市已经有0.16%的人死于病毒(如果包括可能的死亡人数，则为0.22%)。如果病毒的感染死亡率真的像圣克拉拉的研究估计的那样只有0.17%，那就意味着几乎整个城市都已经被感染了。这很难令人信服，这既是因为群体免疫力可能会在一个地区的每个人都被感染之前停止传播，也因为该市的抗体测试实际上显示的比率要低得多(下面有更多信息)。\n如果我们包括可能的死亡人数，并假设每一个纽约市居民确实都被感染了，那么死亡率不可能低到0.17%。(更不用说冠状病毒死亡人数很可能被低估了。仅在纽约市，在3月11日至5月2日期间，又有4300人死亡，高于预期水平。)\n斯坦福大学的研究人员在他们的更新版论文中承认了这一发现，他们指出，死亡率可能“在医院不堪重负的地方”或“感染集中在脆弱的个人中”可能会高得多。这表明从该疾病低流行地区确定感染死亡率是有限的。它还表明，关于放松努力以减缓病毒传播的决定不应该只基于没有出现大爆发的地区的血清学测试，因为放松缓解努力可能导致更大的疫情，不仅总死亡人数更高，而且感染者的死亡率也更高。\n如果我们想更好地了解病毒的致死率，我们应该转而关注像纽约这样的重灾区。该州一直在进行自己的大型血清调查。调查正在进行中，细节尚未公布。但根据州长科莫4月27日的一份声明，当时已经对7500人进行了检测，纽约市近25%的人和全州近15%的人被发现有针对病毒的抗体。\n为了选择样本，州政府在超市等公共区域设立了测试点，这可能会缓解斯坦福大学研究人员使用的Facebook调查方法中的自我选择偏见。另一方面，在公共场合四处走动的人可能比那些严格自我孤立的人风险更高。\n关于检测准确性的细节也是有限的：一份文件表明，检测的特异性在93%到100%之间，这意味着多达7%的阳性结果可能是错误的。但由于纽约的实际患病率比圣克拉拉高得多，这种假阳性对结果的有效性没有太大影响。因为圣克拉拉的抗体携带者非常少(大约在1%到5%之间)，在假阳性率相对较低的测试中，大多数阳性结果很可能是错误的。但在纽约，显然有更多的感染，我们可以预计，假阳性的数量不会超过准确的阳性结果。\n纽约这项调查的流行率估计表明，感染人数大约是常规诊断测试发现的10倍。考虑到该州检测的短缺，这并不是非常不切实际，其中三分之一的检测结果呈阳性。这些估计将使该州的感染死亡率为0.69%，纽约市为0.66%。这将远远好于确诊病例的死亡率(该州约为6%)，但仍高得足以令人非常担忧：如果我们允许，比如说，一半的国家被感染，那么这个死亡率将导致100多万人死亡。\n超越致死率虽然冠状病毒感染致死率的估计显然令人着迷，但这并不是我们从抗体研究中能得到的最重要的东西。正如圣克拉拉和纽约研究中估计的死亡率之间的差异所显示的那样，不同地区在疫情爆发的不同阶段进行的调查可能会导致非常不同的结果。更重要的是，我们对感染死亡率的信息无能为力。\n这一比率的零点几个百分点对我们今天需要采取的控制大流行的行动有什么不同？我们是不是以0.5%的死亡率开商场，等到一项研究显示死亡率为0.3%时，我们才开美发沙龙？这些估计并没有告诉我们如何让商场和美发沙龙安全地再次光顾，它们只是告诉我们，我们可能不必担心这样做。它们是用来管理人们看法的工具，而不是用来管理危机本身的工具。\n抗体测试的一个潜在有用的应用可能是识别那些接触过病毒并现在具有免疫力的人，这些人可以在更高风险的环境中工作。这样的“免疫护照”是有争议的，特别是因为我们仍然不能确定针对病毒的特定抗体的存在是否会赋予免疫力，或者在多长时间内会赋予免疫力。当然，签发豁免护照的想法引发了一系列伦理和社会问题-从对缺乏免疫力的人的歧视，到他们可能给人们带来的寻求感染以获得免疫力的不正当激励。但随着抗体检测的进步，我们将需要决定，作为一个社会，我们是否想要使用这些测试来签发免疫护照，以及我们如何才能以一种利大于弊的方式这样做。\n抗体检测的另一个更直接的用途是寻找康复的患者作为富含抗体的血清的捐赠者，即所谓的“恢复期血浆”或“恢复期血清”，一些科学家认为，这些血清可以用来治疗这种疾病，或者为高危工人提供对病毒的短期免疫力。这种疗法的临床试验数据很快就会出来，但它在重症患者中使用的早期报告很有希望，而且这个想法在治疗传染病的安全性和有效性方面已经有一个世纪的记录了。然而，寻找符合条件和可供捐献的康复患者可能是一项后勤挑战，每个捐赠者只能提供足够治疗2到3名患者的血清，因此其用途受到我们可以确定的潜在捐赠者数量的限制。\n截至撰写本文时，我们知道美国只有大约19.5万名康复患者-大约每六名目前的患者中就有一名-因此，通过抗体检测发现大量康复患者，可以让这种治疗更广泛地适用于那些最需要的人。这些调查中使用的简单测试可能不足以确定人们的血液中是否有足够的抗体水平作为捐赠者，但它至少可以帮助识别可以接受后续测试的潜在捐赠者，以确定他们的资格。只要还有数百万身份不明的人已经从冠状病毒中康复，我们就不应该允许捐赠者短缺阻碍恢复期血浆疗法的提供。\n抗体研究的结果仍然不确定，我们需要更多的抗体研究结果，以及更多和更好的常规测试，才能更清楚地了解冠状病毒在美国流行的真实情况。在我们等待这样的研究的同时，我们应该准备好利用我们可能从中获得的知识，同时继续建立我们控制疾病传播的能力。因为无论我们从这些研究中了解到什么，任由疾病肆意传播的代价将高得令人无法接受。", "note_en": "One of the most vexing questions of the coronavirus pandemic has been how many people have actually been infected. We know that testing has been inadequate, and that many cases of the disease are mild or even asymptomatic, making them less likely to be detected. So how many cases have slipped under the radar?\n  One way to find out the true prevalence of the disease is to test random samples of the population using a blood test that detects antibodies produced by the immune system against the virus. This is different from the swab tests that have been used worldwide throughout the pandemic, which detect the genetic material of the virus itself.\n  Blood tests, which require just a pinprick, can be done at the point of care, and so are faster and easier to process than the swab tests, where samples need to be shipped to a lab. Blood tests are also helpful because the prevalence of the disease can be assessed from a larger population, which can include people who have recovered from the disease, as the antibodies it detects remain in the blood even after recovery. However, because antibodies take several days after infection to be produced, these tests cannot replace swab tests for the very important purpose of detecting new cases of the illness before it can be spread to others.\n  Much of the attention on antibody tests has focused on how they can help us estimate just how deadly Covid-19 really is by giving us a better sense of the total number of infected people, and thus of the true rate of infected people who died. If the number of infected people is much larger than expected because there are many undiagnosed infections, that means the probability of dying from an infection is much lower than it would be if we looked only at the number of diagnosed cases. Some  have hoped that antibody tests could show us that the virus “isn’t as deadly as we thought,” and may therefore inform “better policy decisions” about restrictive social distancing policies.\n  The Santa Clara Study  There have been several recent attempts to use these blood tests to determine the prevalence of the disease, and with it its true fatality rate. One that has garnered a great deal of attention has been a  study conducted by Stanford researchers in Santa Clara County, the metropolitan region around Silicon Valley. By taking blood tests on subjects recruited from a Facebook survey, researchers estimated the prevalence of infection in the community to be much higher — and the fatality rate to be much lower — than confirmed diagnoses would indicate.\n  In the initial preprint version of the paper from April 17, they estimated that between 2.5 and 4.1 percent of the county had been infected, 50 to 85 times the roughly 1,000 cases that had been diagnosed at the time. Based on those numbers, they estimated the infection fatality rate of the disease to be between 0.12 and 0.2 percent, far lower than the roughly 5 percent fatality rate for diagnosed cases in the United States, and not much higher than the 0.1 percent fatality rate  for seasonal influenza.\n  The study was  widely  criticized  at the time, and although the researchers published a revised version of the paper addressing some of these criticisms on April 30, their topline results have not changed much: Their estimate for the prevalence of the disease in Santa Clara County is now between 1.3 and 4.7 percent (extending their earlier range), while their estimate for the infection fatality rate is now 0.17 percent (within their earlier range).\n  Criticisms of the paper centered on two major weaknesses. First, the authors reported a relatively high false positive rate, which is particularly problematic in a place like Santa Clara that has not seen a major outbreak. Second, critics voiced concerns that people who suspected they may have had undiagnosed coronavirus infections may have been more likely to participate in the survey, biasing the results. Let’s look at each of these in turn, and at how the researchers responded to these concerns in their revised paper.\n  The researchers originally reported that the lab tests they ran to try to validate their test kits prior to use had a 0.5 percent false positive rate. This may not seem like much. But in their actual survey, just 1.5 percent of tests came back positive. (Their higher final prevalence estimate was made by adjusting for demographic factors in their sample.) This would suggest that a third of their positive results may have been erroneous. But 0.5 percent is just a “point estimate” of their false positive rate, based on how many errors they observed in the limited number of validation tests they performed, and the actual false positive rate could be higher or lower.\n  Critics  argued that it’s statistically plausible that the false positive rate could have been even higher than the number of positive results the researchers found. This would mean that the positive results they found would be consistent with there being zero true positive cases. Of course, no one believed that there were literally no true positive cases of coronavirus in Santa Clara County. But when the false positive rate is statistically compatible with the number of positive results detected, this casts doubt on the quality of the evidence provided by the test.\n  In their updated paper, however, the authors ran a larger number of tests to validate the performance of their kits to provide a more precise estimate of the false positive rate; their point estimate for the false positive rate is still 0.5 percent, but with an upper bound of just 0.8 percent and a lower bound of 0.3 percent, which can give us greater confidence of the accuracy of their results.\n  The second area of concern is about sample bias in the volunteers that participated in the study. The subjects were recruited through a Facebook survey, and then drove to testing sites. It is plausible that many of those who decided to volunteer for a free coronavirus test were people who had some suspicion that they had already had the illness without being tested. In the updated draft of the paper, the authors report that 3 percent of their subjects had experienced cough and fever within the past two weeks, while 20 percent had symptoms within the past two months, and that those who reported symptoms were more likely to receive positive antibody tests than those who did not.\n  The authors speculate that “the proportion of participants with cough + fever may actually be lower than what is typical in California, and, if so, the bias in the estimation of prevalence may be even in the opposite direction.” But they give no indication of what is the typical proportion of the Californian population who report symptoms of fever and cough. Their source for the claim is the  CDC’s map of the historical levels of influenza-like illness across the country, but that map only reports relative levels, from “minimal” to “very high,” rather than the numeric prevalence of the illness. And the underlying data for that map from the  California Department of Health is based on flu hospitalization rates rather than the total number of people with flu-like symptoms. That being said, it is not clear how much of an effect this sample bias may have had on their estimates.\n  In their updated paper, the Stanford researchers have addressed some of the more important criticisms of their initial estimates of the prevalence of Covid-19 in Santa Clara. However, their finding about the total infection fatality rate remains difficult to square with the observed death rates in New York.\n  New York Sanity Check  According to the  New York City Department of Health, as of two days ago, there have been 13,938 confirmed Covid-19 deaths, with an additional 5,359 probable deaths. The city’s population is about  8.6 million, meaning that if we only include confirmed deaths then 0.16 percent of the entire city has already died from the virus (or 0.22 percent if we include probable deaths). If the infection fatality rate for the virus were really just 0.17 percent, as the Santa Clara study estimated, that would imply that  virtually the entire city has already been infected. This is hardly plausible, both because herd immunity would likely stop transmission before everyone in a region is infected, and because antibody tests in the city in fact show much lower rates (on which more below).\n  If we include probable deaths, and assumed that every single New York City resident has indeed been infected, then the fatality rate could not be as low as 0.17 percent. (This is not to mention that Covid-19 deaths are most likely undercounted. In New York City alone, between March 11 and May 2,  an additional 4,300 people have died over and above expected levels.)\n  The Stanford researchers acknowledge this wrinkle in their finding in the updated version of their paper by noting that the fatality rate may be “substantially higher in places where the hospitals are overwhelmed” or “where infections are concentrated among vulnerable individuals.” This points to the limits of ascertaining infection fatality rates from regions with a low prevalence of the disease. It also suggests that decisions about relaxing efforts to mitigate the spread of the virus should not be based on serological tests only from areas that did not see a large outbreak, since relaxation of mitigation efforts could lead to larger outbreaks with not only higher total numbers of deaths, but also higher death rates for those infected.\n  If we want to get a better sense of the fatality rate for the virus, we should look instead to hard hit regions like New York. The state has been conducting a large serosurvey of its own. The survey is ongoing and details have not yet been published. But according to an  announcement from Governor Cuomo on April 27, at which point 7,500 people had been tested, nearly 25 percent of New York City, and nearly 15 percent statewide were found to have antibodies against the virus.\n  To select samples, the state set up testing sites in public areas like supermarkets, which might mitigate the self-selection bias in the Facebook-survey method used by the Stanford researchers. On the other hand, people who are walking around in public may be a higher risk group than those who are scrupulously self-isolating.\n  Details about the accuracy of the test are also limited: one  document indicates that the specificity of the test ranges between 93 and 100 percent, which means that as many as 7 percent of the positive results could be errors.  But because the actual prevalence of the disease is so much higher in New York than in Santa Clara, such false positives don’t make as much of a difference to the validity of the results. Because there are so few people with antibodies in Santa Clara (roughly between 1 and 5 percent), most of the positive findings in a test with a relatively low false positive rate might well be errors. But in New York, which clearly has had many more infections, we can expect that false positives won’t come close to outnumbering accurate positive findings.\n  The prevalence estimates from the survey in New York suggest that there have been about 10 times as many infections as regular diagnostic testing has found. This wouldn’t be terribly unrealistic, given the shortages of tests in the state, a third of which  have come back positive. These estimates would put the infection fatality rate at 0.69 percent for the state or 0.66 percent for New York City. This would be far better than the fatality rate for confirmed cases (roughly 6 percent for the state), but would still be high enough to be very worrying: If we were to allow, say, half the country to be infected, then that fatality rate would result in over a million deaths.\n  Beyond Fatality Rates  While estimates of the infection fatality rate of Covid-19 obviously hold a grim fascination, they are not the most important thing we can garner from antibody studies. As the discrepancies between the fatality rate estimates in the Santa Clara and New York studies show, surveys in different regions at different stages of their outbreaks may lead to very different results. More importantly, there is not much we can do with information about the infection fatality rate.\n  What difference does a fraction of a percentage point in the rate make to the actions we need to take to control the pandemic today? Do we open up malls at a 0.5 percent fatality rate, and wait until a study comes along that shows a 0.3 percent rate before we open hair salons? These estimates don’t tell us anything about how to make malls and hair salons safe to visit again, they merely tell us that we might not have to worry about doing so. They are tools for managing perceptions, not for managing the crisis itself.\n  One potentially useful application of antibody tests could be in identifying people who have been exposed to the virus and are now immune, who can then work in higher-risk settings. Such “ immunity passports” are controversial, not least because we still do not know with certainty whether, or for how long, the presence of particular antibodies against the virus will confer immunity. And of course the idea of issuing immunity passports raises a host of ethical and social issues — from discrimination against those lacking immunity to the perverse incentive they may create for people to seek out infection to acquire immunity. But as antibody testing improves we will need to decide whether as a society we want to use the tests to issue immunity passports, and how we might do so in a way that does more good than harm.\n  Another more immediate use of antibody testing could be finding recovered patients to serve as donors of antibody-rich blood serum, so-called “convalescent plasma” or “convalescent serum,” which some  scientists have argued could be used to treat the disease or to confer short-term immunity to the virus for high-risk workers. Data from clinical trials of the treatment  will be available soon, but  early  reports from its use in severely ill patients are promising, and the idea has a century-old track record of safety and efficacy for treating infectious diseases. However, finding recovered patients who are eligible and available to donate can be a logistical challenge, and each donor can provide only enough serum for  treating 2 or 3 patients, so its usefulness is limited by the number of prospective donors we can identify.\n  As of this writing, we know of only about  195,000 recovered patients in the United States — about one for every six currently ill patients — so finding large numbers of recovered patients through antibody testing could allow for this treatment to become more widely available for those who need it the most. The simple tests used in these surveys may not be enough to determine if people have sufficient levels of antibody in their blood to serve as donors, but it could at least help identify prospective donors who could receive follow-up tests to determine their eligibility. As long as there are millions of unidentified people who have recovered from Covid-19, we should not allow a shortage of donors to hold back the availability of convalescent plasma therapy.\n  The findings from antibody studies remain uncertain and we will need more of them and more and better conventional testing to get a clearer sense of the true prevalence of the coronavirus epidemic in the United States. While we wait for such research, we should prepare to take advantage of the knowledge we might gain from it while continuing to build up our capacity to control the disease’s spread. Because whatever we learn from these studies, the cost of letting the disease spread unchecked would be unacceptably high.", "posttime": "2020-05-09 11:10:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,病毒,rate,可能", "title": "为什么争论冠状病毒的致死率是毫无意义的？", "title_en": "Why fighting about Covid-19’s fatality rate is pointless", "transed": 1, "url": "https://www.thenewatlantis.com/publications/not-as-deadly-as-we-thought", "via": "", "real_tags": ["冠状病毒", "病毒", "rate", "可能"]}, {"category": "", "categoryclass": "", "imagename": "2ce8b4addced5751824a8f700fe75114.jpeg", "infoid": 1001354, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伊朗新的军用卫星Nour 01最有趣的事实可能不是它类似于大学工程实验，而是它可能与去年从新西兰悄悄发射的墨西哥军事有效载荷有关。\n我也非常高兴能分享斯科特·查普曼，K4KDR的故事，他是如何发现伊朗的努尔01[45529，2020-024A]无线电辐射，并确认它在轨道上活得很好，并在我们接受的一次简短采访中指出了故事的一个转折。\n2020年4月21日，伊朗伊斯兰革命卫队(IRGC)从沙赫鲁德附近的一个新发射场发射了一枚火箭。这最初听起来不是什么好兆头，因为IRGC在许多西方国家被宣布为恐怖组织，这次任务成功进入轨道。然而，在几天内，业余观察努力和美国航天部队最高将领的一份声明清楚地表明，Nour 01远没有什么值得担心的。相反，它提出了一个问题，即鉴于目前对伊朗的进口限制，西方教育卫星巴士怎么可能结束。\n受人尊敬的太空活动观察家乔纳森·麦克道尔(Jonathan McDowell)在发射后不久报告说，他对QASED火箭助推器侧面的贴花进行了分析，分析结果清楚地显示了一颗6U立方体卫星，上面有甚高频(VHF)或超高频(UHF)天线。\n2020年4月24日，K4KDR斯科特·查普曼(Scott Chapman，K4KDR)在推特上报告称，他探测到一个物体发射了9600波特的FSK分组无线电信号，该物体似乎与努尔01的轨道相匹配。有趣的是，斯科特注意到，该卫星很容易使用业余协议解码(稍后会有更多信息)。\n从那里传来的一些报告表明，在卫星的整个轨道上，信号显然是一致的。一名意大利观察员能够注意到，当卫星在伊朗上空时，它进入了快速数据传输模式。对于一颗卫星…来说，所有完全正常的活动。如果这里没有什么可看的，沿着…走。\n随后，美国太空部队司令杰伊·雷蒙德将军在推特上表示，努尔01是一颗3U立方体卫星，而不是助推器侧面贴纸上注明的6U立方体卫星。\n到目前为止，业余爱好者已经形成了一个非常有力的证据，即401.5 MHz的发射实际上是Nour 01。在使用时，我进行了一些单程多普勒分析和计时。然后，我进行了为期一天的数据收集运行，并将Scott Chapman的数据与我的数据结合起来，毫无疑问地得出结论，Nour 01是使用Ces Bassa博士的‘Sat Tools RF’的信号源。\n最后，已知的第一次目视观察努尔01的尝试结果是否定的。努尔01太暗了，荷兰的资深观察员马尔科·朗布洛克(Marco Langbroek)无法探测到。这意味着这颗卫星非常小，提供了一些有限的支持，表明这颗卫星不是火箭贴花上成像的6U立方体卫星。\n根据所有新出现的证据，伊朗首次宣布的军事任务似乎并不太可怕，甚至可能有一些虚假广告。但最有趣的观察结果显示，卫星对自己的引用出现了微妙的扭曲。\n在斯科特·查普曼(Scott Chapman)对Nour 01下行链路的解码数据进行初步观察和随后的观察期间，他注意到了他认为可能是正在发送的数据中的通用配置。\n数据包都以特定的格式开始，分别标识呼号“SPACE”和“Earth”，如下图所示。在业余无线电中，一个电台以相同的顺序呼叫另一个电台。因此，Nour 01是呼号空间，正在呼叫呼号地球。这些都是电台AX 25 UI帧的一部分。*在AX 25协议中，需要来往呼号，并且在新的无线电调制解调器中通常被设置为某个默认值。\n嗯，事实证明，这个呼号序列以前也曾在墨西哥国家防务秘书(SEDENA)最近的一次军事发射中看到过，这次发射是在2019年6月29日，由来自新西兰的火箭实验室电子火箭PAINANI1[44365，2019年-037A]发射的。\nPainani 1号在其通信系统的配置中使用了相同的源地址和目的地地址(呼号)。这可能意味着这是卫星运营商没有更改的默认或原始设置。\n2020年03月14日18：00：31.770协调世界时：从太空到地球(UI，有效载荷：56字节)000&gt；C0 00 8A 82 A4 A8 90 40 E0 A6 A0 82 86 8A 40 61 03 F0 3C C3020&gt；35 00 00 00 2D 7F 00 00 00 D5 FF E1 040&gt；FF F2 01 00 73 00 02 07 02 01 15 10 3A 00 00 00 33 00 00 060。\n？.Š，？..-…。‘IangááInc.s……。：…。3个…。.1/2.«.&gt;.O.D.X？\n深入研究Painani 1在互联网上的有限参考资料，可以找到一些关于硬件来自一家名为CubeSat Kit的公司的线索。\n快速浏览一下CubeSat Kit的网站，就会发现他们出售的是3U的CubeSat套件。\n因此，我们可以从中得出一些有趣但似乎可以否认的推论。\n为什么他们的立方体卫星的配置与最近发射的墨西哥军用立方体卫星的配置和大小非常相似？\n如果伊朗从加州的一家立方体卫星套件供应商那里购买了一颗3U立方体卫星，那么根据ITR的规定，他们是如何获得的呢？\n这是否意味着可能有一架备用飞机不知何故迷路了，却找到了前往伊朗的路？\n我问了斯科特·查普曼几个问题，关于他是如何恢复Nour 01的，我认为业余跟踪社区可以从这次讨论中受益。\nScott Tilley-“是什么让您考虑在400 MHz频段搜索Nour 01？你的灵感是什么？“\n斯科特·查普曼-“在这次发射的两个物体的TLE发布后，人们的第一反应当然是”我们能收到下行链路吗？“。但是去哪里找呢？出于某种原因，脑海中浮现出这样的想法：“如果他们遵守规则，使用批准的频率怎么办？”所以我在谷歌上搜索了短语“伊朗卫星频率”，得到了下面的五颜六色的图表。“。\n斯科特·查普曼--“…”传说中有一个“下行链接”的名称。\n斯科特·查普曼--“…”所以我扫描了频率图，寻找有这个名称的频率块。排除了我没有准备好接收的部分频谱，最有可能的位置是400 MHz频段底部的小贴片。4月23日深夜，当第一个轨道在美国东部上空出现时，想象一下我在10秒的间隔内看到强烈信号时的惊讶！然而，当这些看起来很熟悉的数据包被解码为标准的9600波特FSK数据包时，人们开始怀疑，我对这是一颗军用卫星有了重新的想法。我保持沉默，并在4月24日凌晨设置了警报，届时将有一个海拔更高的山口。一切都按计划进行，我有幸捕获了更多的数据包-再次以10秒的间隔进行解码，并按照标准的9600FSK解码。奇怪的是，每个包裹上的源/目的地址都是“从太空到地球”，这在其他教育立方体卫星上也能看到。在STRF应用程序中绘制多普勒轨迹并找到与#45529号物体(在TLE列表中的ID为“Noor”，即“Nour 01”)的重要匹配后，我在推特上发布了一条带有我的发现的推文，希望其他人能监测到这个频率，或者确认我的发现，或者报告更可能的来源。\n斯科特·查普曼-“这些信号是通过AZ/EL控制的Wimo X-Quad，70 cm版本，SP-70 LNA，LMR-400，到使用GQRX记录的AirSpy R2和Amp；接收到的。”\n斯科特·蒂利：“当你解码遥测时，为什么你觉得它只是卫星上的一个标准无线电引擎？你能介绍一下你解码卫星遥测的经历吗？“。\nScott Chapman说：“由于业余卫星社区愿意分享知识和操作信息，我非常喜欢学习如何接收和解码卫星遥测，现在已经有几年了。在这个社区里有一个令人难以置信的知识池，所以你可以在多大程度上发展你最感兴趣的爱好方面是没有限制的。因此，我已经能够学习如何跟踪和解码轨道上使用许多不同调制技术的各种各样的物体。因此，在看到来自这么多其他立方体卫星的9600波特FSK包的一般外观后，尝试用我已经安装的软件工具来解码这些信号并不是一件遥不可及的事情。“。\n斯科特·蒂利：“根据你作为一名非常活跃的无线电卫星跟踪者的经验，你对基于你自己和其他共享观测的人的观测的Nour 01卫星的能力有什么看法？”\n斯科特·查普曼-“我们目前只能推测。小卫星通常下行遥测，包括航天器的健康参数，如电池电压、太阳能电池板电流、各种部件的温度等。许多卫星现在都包括相机，所以看到定期的遥测数据包被可以解码为图片的稳定数据流取代并不少见。值得注意的是，欧洲和其他地方的业余爱好者实际上已经看到，在中东的范围内，来自Nour 01的10秒数据包被更强烈的数据流所取代，但我看到的一个解码样本并不包括今天立方体卫星上常见的标准JPG图像文件格式。因此，目前所有来自Nour 01的各种下行数据包的实际意义仍然是个谜。“\n斯科特·蒂利：“告诉我更多关于你对业余卫星通信和跟踪的兴趣。你是怎么进入这个圈子的？为什么你觉得它这么有趣？“。\nScott Chapman-“我对此一无所知，但基本RTL-SDR的低成本太诱人了，让人无法抗拒。像其他许多人一样，我从我发现的是一个令人惊叹的社区，这些人拥有令人难以置信的知识，他们总体上喜欢卫星和宇宙飞船的各个方面。我学会了如何解码NOAA气象卫星APT下行链路，后来发现国际空间站上有一个分组数字化仪，它就是从那里起飞的。我真诚地希望像Jan(PE0SAT)、Mike(DK3WN)、Dani(EA4GPZ)和其他许多人没有任何我突如其来通过电子邮件发给他们的问题，因为他们会像8年级的班级照片一样尴尬！但我非常感谢这些先生和其他许多人，他们分享了他们对这项爱好的了解，让我们所有人都受益。“。\nNour 01的复苏绝对是一件令人愉快的事情。当业余卫星跟踪社区团结起来，利用创造力、有限的齿轮和一些肘部油脂揭开了轨道上另一个潜在谜团的层层，并让世界看到了这条新闻的前景。对于那些坐在一旁看着我们几个人享受所有乐趣的人，我邀请你参与进来，加入我们的行列，为我们所有人寻找和报告你看到的东西。", "note_en": "Iran’s new military satellite, NOUR 01, most interesting fact may not be that it resembles a college engineering experiment but rather that it may have a connection to a Mexican military payload launched quietly from New Zealand last year.\n It’s also with great pleasure that I can share Scott Chapman, K4KDR’s story of how he found Iran’s NOUR 01 [45529, 2020-024A] radio emissions and confirmed it was alive and well in orbit and noted a twist to the story in a brief interview we had.\n   On April 21, 2020, Iran’s Islamic Revolutionary Guard Corps (IRGC) launched a rocket from a new launch site near Shahroud.  This sounded initially ominous as the IRGC is a declared terrorist organization in many western countries and this mission successfully entered orbit.  However, within a few days amateur observing efforts and a statement from the top US Space Force general made it clear NOUR 01 was far from something to worry about.  Rather it raises questions that given the present state of import restrictions to Iran how did a western educational satellite bus possibly end up in Iran?\n Jonathan McDowell a respected space activity observer  reported shortly after launch of his analysis of a decal on the side of the QASED rocket booster that clearly showed a 6U cubesat with antennas for VHF and perhaps UHF.\n On April 24th, 2020, Scott Chapman, K4KDR reported on Twitter that he had detected an object emitting 9600 baud FSK packet radio signals from an object that appeared to match the orbit of NOUR 01.  Interestingly, Scott noted that the satellite was easily decoded using amateur protocols (more on that shortly).\n    From there a number of reports came in from around the world indicating the signal was apparently consistent during the entire orbit of the satellite.   An Italian observer was able to note the satellite entering a rapid data transmission mode while it was over Iran.  All completely normal activities for a satellite…  Nothing to see here, move along…\n  Then the commander of the US Space Force,  general Jay Raymond tweeted that NOUR 01 was a 3U cubesat not the 6U as noted on the decal on the side of the booster.\n  Up until this point amateurs had developed a very strong case that the emission of 401.5MHz was in fact NOUR 01.  Some single pass Doppler analysis and timing where used.   I then performed a day long data collection run and combined Scott Chapman’s data with mine and concluded beyond a doubt that NOUR 01 is the source of the signals using Dr. Cees Bassa’s ‘Sat Tools RF’.\n  Finally the  first known attempt to visually see NOUR 01 came up negative.  NOUR 01 was too dim to detect for experienced observer Marco Langbroek in the Netherlands.  This implies that the satellite is very small and provides some limited support that the satellite is not the 6U cubesat imaged on the rocket’s decal.\n  Based on all the emerging evidence Iran’s first stated military mission doesn’t appear to be too terrifying and perhaps there was even a little false advertising.  But the most interesting observation was revealed in a subtle twist in how the satellite referred to itself.\n  During Scott Chapman’s initial observation and subsequent observations of decoded data from the NOUR 01 downlink he noted what he thought could be a generic configuration in the data that was being sent.\n The packets all began with the specific format to identify the call-signs respectively ‘SPACE’ and ‘EARTH’ as can be noted in the image below.  In amateur radio, a station calls another station in the same order.  So NOUR 01 is call-sign SPACE and is calling call-sign EARTH.  These are part of the stations AX 25 UI Frame.  In the AX 25 protocol a to and from call-sign is required and is often set to some default value in a new radio modem.\n  Well it turns out this same call sign sequence has been seen before on a relatively recent military launch by Mexico’s Secretaría de la Defensa Nacional (SEDENA) on a Rocket Labs Electron from New Zealand called PAINANI 1 [44365, 2019-037A] on June 29, 2019.\n Painani 1 used an identical source and destination addresses (call-signs) in the configuration of its communication system.  Perhaps implying this was a default or original setting that wasn’t changed by the satellite operators.\n  2020-03-14 18:00:31.770 UTC: from SPACE to EARTH (UI, payload: 56 byte) 000 &gt;   C0 00 8A 82 A4 A8 90 40 E0 A6 A0 82 86 8A 40 61 03 F0 3C C3 020 &gt; 35 00 00 00 00 00 00 00 00 00 00 00 2D 7F 00 00 00 D5 FF E1 040 &gt; FF F2 01 00 73 00 02 07 02 01 15 10 3A 00 00 00 33 00 00 00 060 &gt; 0C BD 0F AB 00 9B 13 4F 04 A6 0F 44 04 58 C0\n À.Š‚¤¨\u0090@à¦ ‚†Š@a.ð&lt;Ã5………..-\u007f…Õÿáÿò..s…….:…3….½.«.›.O.¦.D.XÀ\n Digging into the Painani 1’s limited  references on the Internet gives some clues as to were the hardware came from, a company called  CubeSat Kit\n  A quick browse of CubeSat Kit’s website reveals they sell a  3U cubesat kit.\n  So we could be left to draw some interesting yet plausibly deniable inferences from this.\n Why is their cubesat configured very similar to a recently launched Mexican military cubesat of similar configuration and size?\n If Iran has acquired a 3U cubesat from a Californian cubesat kit vendor how did they get it given ITR regulations?\n Could this mean that perhaps a flight spare somehow got lost and found it’s way to Iran?\n   I asked Scott Chapman a few questions about how he recovered NOUR 01 and thought the amateur tracking community could benefit from the discussion.\n Scott Tilley – “What made you consider searching the 400MHz band for NOUR 01? What was your inspiration?”\n Scott Chapman – “ After TLEs were published for two objects from this launch, of course the immediate thought was “can we receive a downlink?” But where to look? For some reason, the thought came to mind, “What if they follow the rules &amp; use an approved frequency”? So I did a Google Search for the phrase “Iran Satellite Frequencies” which led to the following  colorful chart“\n  Scott Chapman – ” … the legend had a designation for “Downlink” “\n  Scott Chapman – “… so I scanned the frequency chart for frequency blocks with that designation. Ruling out parts of the spectrum that I am not equipped to receive, the most likely spot was small patch at the bottom of the 400 MHz band. When the first orbit came over the Eastern U.S. in the late-night hours of 23-April, imagine my surprise to see strong signals on a 10-second interval! However, when the familiar-looking packets decoded as standard 9600 baud FSK packets, doubt crept in and I had second thoughts about this being a military satellite. I kept silent and set an alarm for the early morning hours of 24-April when there would be a MUCH higher elevation pass. Everything went as planned and I had the good fortune of capturing many more packets – again on a 10-second interval and decoding as standard 9600 FSK. Strangely, the source/destination addresses on each packet were “from SPACE to EARTH”, which has been seen on other educational cubesats. After plotting the doppler track in the STRF application and finding a significant match to Object # 45529 (ID’d in the TLE listing as “NOOR”, i.e., “NOUR 01”), I  posted a tweet with my findings with the hope that others would monitor the frequency and either confirm my finding or report on a more likely source.”\n  Scott Chapman –  “ These signals were received with an AZ/EL controlled Wimo X-Quad, 70-cm version, with an SP-70 LNA, LMR-400, to an Airspy R2 &amp; recorded using GQRX”\n Scott Tilley –  “When you decoded the telemetry why did you feel it was just a standard radio engine on the satellite? Can you provide some context about your experiences with decoding telemetry from satellites?”\n Scott Chapman – “Because of the willingness of the Amateur Satellite community to share knowledge &amp; how-to information, I have greatly enjoyed learning how to receive &amp; decode satellite telemetry for a few years now. There is an incredible pool of knowledge in this community, so there is no limit to how far you can develop whatever aspect of the hobby interests you the most. Consequently, I have been able to learn how to track &amp; decode a wide variety of objects in orbit that use many of the various modulation techniques. So, having seen the general appearance of 9600 baud FSK packets from so many other cubesats, it wasn’t a far reach to try to decode these signals with software tools that I already had installed.”\n Scott Tilley – “Based on your experience as a VERY active radio satellite tracker what is your opinion of the NOUR 01 satellite’s capabilities based on your own observations and that of others that have shared observations?”\n Scott Chapman –  “We can only speculate at this point. Small satellites typically downlink telemetry that includes spacecraft health parameters such as battery voltage, solar panel current, the temperature of various components, etc. Many now include a camera, so it’s not uncommon to see the periodic telemetry packets replaced by a steady stream of data that can be decoded as a picture. It’s significant that Amateurs in Europe &amp; elsewhere have in fact seen the 10-second packets from NOUR 01 replaced with a more intense stream of data when in-range of the Middle East, but the one sample of those decodes that I have seen did not include the standard JPG image file format that is common on today’s cubesats. So, for the moment the actual meaning of all the various downlink packets from NOUR 01 remains a mystery.”\n Scott Tilley  – “Tell me more about your interest into amateur satellite communications and tracking. How did you get into this and why do you find it so fun?”\n Scott Chapman –  “I knew zero about any of this but the low cost of the basic RTL-SDRs was too tempting to resist. Like so many others, I learned from what I came to find out was an amazing community of incredibly knowledgeable people who enjoy the various aspects of satellites and spacecraft in general. I learned how to decode NOAA Weather satellite APT downlinks, later discovered that there was a packet digipeater on the ISS, and it took off from there. I sincerely hope that people like Jan (PE0SAT), Mike (DK3WN), Dani (EA4GPZ) and many others don’t still have any of the early questions I emailed them out of the blue because they would be as embarrassing as 8th grade class pictures! But I am so grateful to those gentlemen and so many others for sharing what they knew about this hobby to the benefit of all of us.”\n  NOUR 01’s recovery was a absolute pleasure to watch unfold.  The amateur satellite tracking community rallied and using creativity, limited gear and some elbow grease peeled back the layers of yet another potential mystery in orbit and gave the world perspective on this news.  For those that sit on the sidelines watching a few of us have all the fun, I invite you to get involved and join us in looking up and reporting what you see for the benefit of us all.", "posttime": "2020-05-09 10:03:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "回收,iran,卫星", "title": "回收伊朗的努尔01“军事卫星”", "title_en": "Recovering Iran’s NOUR 01 ‘Military Satellite’", "transed": 1, "url": "https://skyriddles.wordpress.com/2020/04/28/recovering-irans-nour-01-military-satellite/", "via": "", "real_tags": ["回收", "iran", "卫星"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001353, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "啊，是的，所以昨天关于我愚蠢的小RPC负载测试的帖子炸了。有很多关于它的反馈和其他几个相关的帖子。我将尝试回答或以其他方式解决一些问题。\n我不会告诉你，至少现在不会。这实际上无关紧要。我认为您可以用任何语言编写糟糕的服务，也可以用任何语言编写相当不错的服务。然而，当你开始从你的硬件中挤出最后66%的时候，橡胶就会遇到麻烦。\n如果您没有在一个认为主机上CPU利用率达到33%的情况下正常工作的地方工作，那么这可能没有任何意义。我曾经这样做过。这太可怕了。\n通过不告诉你它用的是哪种语言，我设法饿死了一整场关于对话的次要表演，在这场对话中，人们进行了一场全面的语言战争，忘记了他们仍然没有用自己选择的语言完成同样的事情。\n我打赌它可以用这种语言来做。那些整天吠个不停、干得很少的人，能不能做到呢？那完全是另一回事了。\n我要指出的是，在这个过程的早期，一位朋友决定用一种完全不同的语言编写一个类似的服务器，并设法完全销毁了其他地方认为理所当然的数字。这位朋友使用的语言在这里也无关紧要。\n哦，我相信他们会的。有些人可能想要它，因为它能传递信息。我不会就这么把它送人的。鉴于目前这类事情在世界上似乎不合理地罕见，我想这里可能会赚到很多钱。\n好好想想。这是一个不受限制的代码库，其中唯一的外部依赖项是protocol buf，上次我检查过它基本上是一个包含3个条款的BSD，所以只要您遵循文档/版权要求，您基本上可以做任何您想做的事情。\n另外，协议部分并不是非常关键的。您可以将其替换为二进制兼容的实现，没有人会知道其中的区别。Wire协议有很好的文档记录，如果您只是想测试一些东西，那么可以很容易地*手工*修改它。\n有没有人尝试过为GRPC制作第二个资源？你知道，说相同的语言，但不使用相同的实现？那会是什么样子？\n想象一下，当你签出某个东西时，它不会从互联网上的随机位置克隆出50个不同的子模块。多好的概念啊，对吧？\n此外，正如我已经说过的，出于多种原因，我不是整个社区的一部分。我肯定不会带着这样的东西跳进去的。\n它不是单线的，对不起。它将每个连接使用一个线程作为精心设计的选择。我不想为线程池而烦恼。我可以吗？好的。我有吗？没有，或者至少现在还没有。如果我需要，我会加进去的。现在，简单是值得的。\n我是专用服务器市场的老手，因为很久以前我曾为世界的那一边提供技术支持。当他们是每月5美元的员工特惠时，拿回一台机器是很自然的事情，之后很容易把它留在身边。\n在那段时间里，我已经使用过几台专用服务器。他们只是坐在那里，有点像是在做他们自己的事情。他们很无聊，这正是我想要的。这些年来，我拥有的这些盒子中的任何一个都可以充分体现几个商业概念，以确定是否值得在上面投入更多资金。他们的月费通常在100美元到200美元之间。\n对我来说，人们在Prem&34；上说的话现在意味着他们办公室里的某个壁橱。如今的办公室经常有非常好的连接，比如千兆或更好的连接，可以体面地前往任何重要的地方。我是在有一条专用于互联网的T1线路(~1.5 Mbps)进入您的企业是件大事的时候想到这一点的。我在这些连接上托管了一些东西。它们也工作得很好。\n我会再做一次吗？也许吧。这取决于我需要以多快的速度让事情发生，以及我是否能将某些东西粘在现有服务器的一侧。\n任何事情都有风险。你的办公室连接将会有糟糕的一天。你的服务器会死的。一只松鼠会在你的变压器上烧烤，而你一天都会断电。一个专心致志的提供者也会时不时地发生一些愚蠢的事情。那些机器也会时不时地死掉。\n不同的问题需要不同的解决方案。时间是一个因素，金钱是一个因素，你已经拥有的资源是一个因素，所需的灵活性是一个因素。\n壁橱里的那个备用盒也许正好够插上你的旗帜。只是别忘了稍后重新评估情况。\n我认为这意味着丢弃EPOLL内容，只需坐在read()或类似的地方。除了这是我在设计中刻意避免的问题外，还有其他问题。\n我的serviceworker线程需要时不时地做一些内务工作。他们可能需要做一次空闲的检查，才能将一位已经有一段时间没有说话的客户平底船。可能还有其他事情要做。此外，我还希望能够清理和关闭它们，而不必做可怕的事情来使它们解脱。\n会发出信号让它松开吗？呃.。正在取消线程吗？呃，不。与我最终所做的相比，这些都是令人讨厌的。\n我喜欢这样一个事实，即调度我的工人的唯一事情就是内核本身。你不能把它卡住了。如果你呼喊着阻止工人的东西，你就不会得到一大堆其他的东西，这些东西也马上就会受到影响。(这句话的意思是：“如果你大声呼喊，阻止了工人，你就不会得到一大堆其他东西，这些东西也会马上受苦。)”\n把整台机器弄坏才能让一切都停下来。在你到达那里之前，一切都只是跳来跳去，安排其他地方。这也是一个很好的缓慢下降，而不是简单地开下悬崖。\n同样的道理也适用于我，并且拥有我自己的线程池实现。也会有同样的担忧，另外，如果我不得不自己滚的话，还会增加正确操作的担忧。\n这个真的很让人迷惑。这就像是，是的，2013年我确实停止了每天写作，因为我被拖进了门洛帕克的蓝色大沼泽。\n但即便如此，我还是时不时地在有些东西需要脱口而出的时候重新露面：不要扼杀苹果公司(Apple)推出的糟糕透顶的Git版本，你甚至都不能关掉这类东西。\n不过，老实说，随着工作的增多，原本会用来在这里写作的精力会越来越多地从泳池中消失。这就是事情的发展方式。我签约了，我把我所有的一切都给了它。说它不健康，但这是我唯一可以操作的方法。不做半途而废的事。\n我可能永远不会知道，这个人是如何成功地阅读了2013年的一篇帖子，但在那之后很长一段时间都没有看到其他的帖子。\n有些人..。都在使用Python..。很糟糕。比如，训练有素的猴子坐在一堆连接到Unix shell账户的愚蠢终端前，循环运行NC-l(Port)&34；可以更好地运行服务器……。那是很糟糕的。\n大多数人？你不会听说他们的。对他们来说已经足够好了，他们用得不是很好。\n有些人还在使用PHP、C、C++、Perl、Ruby、Rust、Haskell、OCaml、Java、Clojure、Basic、shell脚本、D、Nim、Kotlin、Julia、JavaScript、Scala和Crystal。\n不同公司的相对高层已经告诉过我好几次了。这真是太可怕了！你真的以为你和什么都学不到的笨蛋一起工作吗？如果那是真的，你为什么要把它们留在身边呢？\n我还断定：这不是真的。事实上，他们是人，这意味着他们是聪明的、会挥舞工具的灵长类动物。人们，当你对他们有信心的时候，通常会想出有趣的解决方案来解决你摆在他们面前的问题。看看在过去的几个月里，这场“暮光之城”的封锁狂潮发生了什么。\n餐馆有大量的清洁用品，没有坐下来的交通工具可以使用。被困在家里的人需要清洁用品。餐馆把两件事放在一起，开始直接向公众销售。非常出色!。\n我假设大多数人的能力比这些诋毁者想的要多。\n你知道我喜欢和谁一起工作吗？在这方面是新手的人还没有见过太多东西，但对任何事情都持开放态度。想象一下一个典型的实习生。他们还在上学。他们在课堂上做了一些事情，也许在另外一两个实习中也做过。他们知道他们还有很长的路要走。\n我向他们提出了一个问题。他们走了，我不知道。我说，嗯，你知道吗，我也不知道。然后我们坐下来一起想办法。我爱死它了！这些都是我能想到的最有成就感的故事。我去年夏天做了这件事，感觉很棒。\n你知道我不喜欢和谁一起工作吗？那些不愿意为了更好的结果而尝试的人。甚至是任何结果。他们会固执己见，不会尝试我提出的东西，但他们也不会实现他们所谓的解决方案。你两败俱伤。\n对任何事情说不都很容易。这需要付出实际的努力才能给出一个替代方案。不要总是默认走最懒惰、最便宜、最糟糕、阻力最小的道路。\n相信你的员工，相信他们有能力成为有思想、以成长为导向、愿意成长和开拓眼界的人。如果你不这么做，别人也会这么做。\n哦，别告诉我，我不知道。这条线的问题是，它可以用得好，也可以用得不好，我看到它经常被用得不好。\n但你知道吗，我已经看到了那些大地方和一些小地方的内部情况--有些是直接看到的，有些是通过可信的内幕报道看到的。你猜怎么着？小得多的地方因为认为自己可以继续逍遥法外而苦不堪言。毕竟，他们是F、A、其他A、N或G。\n记住，科技的肮脏秘诀是，你必须把任何粘在墙上的屎都运出去，然后尽快发挥作用，否则别人会先发制人，抢先一步。然后，如果你在企业里呆的时间足够长，能够挺过那些可怕的事情-无论是哪几年，你就会赢得清理东西的机会。\n问题在于，这些地方从来没有完全意识到，是时候改变策略，停止像那家扔屎的小公司那样行事了。他们认为以前管用的东西现在会继续管用，我很抱歉，情况往往并非如此。\n要点：在一个进程中拥有所有这些连接是很糟糕的，因为如果它死了怎么办？\n你说得对，如果它死了，那我们就有麻烦了。所以，让我们确保它不会死得越多越好。我们将检查所有返回代码，并且不假定一切正常。我们将处理我们的语言提供的任何异常类型的东西。我们将构建一个系统，该系统将中止单个请求或连接，并且不会使整个过程崩溃。\n不过，当然，好的，如果你想的话可以查几个。如果你对此如此偏执，你甚至可以在同一个箱子上运行它们。我不想，但是，嘿，你是老板。\n要点：如果它重新启动怎么办？天哪，TIME_WAIT，无法再次绑定到端口！\n我现在不打算在这里演示它(这篇文章更像是一个选集设备，我们会一直呆在火车上)，但相信我，我可以在一个正确的；做事情；完成；循环，^C循环中运行服务器的时候，它会立即恢复--即使有客户在积极地使用它。它也不一定要干净利落地关门。不管你想要什么，你都可以签上它，它仍然会工作得很好。\n为什么？因为我做了功课，摆弄了所有的旋钮。它不一定是如此重用*.。还有更多。真的。去看看吧。\n为什么？因为在我开发它的时候，我只是使用Netcat作为我的客户端，只是为了生成TCP连接活动，而且在杀死服务器之后必须等待一两分钟才能清理干净，这真是太糟糕了！\n如果你真的边走边测试，你很快就会发现这类东西，不要只满足于喝咖啡，我猜我会去喝杯咖啡，然后决定好好地挖掘和清理你的烂摊子。\n此外，如果您有一个合理的系统来发现您的服务的实例，您不应该需要出现在同一端口。不管你在哪里，只要有足够的人在任何地方都能满足你的延迟要求，就不应该有问题。\n你会对黑客新闻上的其他一切说同样的话吗？因为，老实说，天底下几乎没有什么新东西。您读到的大部分内容与五年前的内容相同，但上面加了另一个名称(也许还增加了另一层间接/抽象层)。\n我看了最新的帖子，寻找了一些统计上不太可能的术语，只是想看看它可能有多糟糕。让我们拭目以待吧。\n我想我可以发布关于烘焙巧克力曲奇的帖子，然后从某些人那里得到同样的抱怨。小苏打！无盐黄油！杯子尺寸！金棕色！开球了！\n基本上，我没有办法把它做好，因为它是我做的。话题无关紧要，陈述无关紧要，措辞也无关紧要。我应该坐下来，闭嘴，给他们提供技术输出，就像一个好的小勺子。\n要点：(类似的关于可怕系统沸腾的悲剧故事，当你看起来很滑稽的时候)。\n如果不是因为这件检疫的事，我很可能会请你喝一杯，因为你是“让垃圾随意运转”俱乐部的一员。坚持住，记住，有些地方不是一直都是这样的。等待时机，保留你的选择余地。\n从我的角度来看，我没有做过任何事情。代码中(目前)没有任何内容说，哦，我正受到攻击，所以也许我应该为此做点什么。例如，我可以在某些操作达到一定的延迟后关闭连接，或者限制每个源地址、每个用户或任何其他可能有用的维度的连接。\n现在有一个限制：一旦我达到32000个serviceworker线程，我就会主动拒绝新的连接。事实证明，超越这一点开始让生活变得非常有趣，因为你的VSZ，嗯，是巨大的。\n为什么我要做线程限制器？嗯，早些时候，我一直在用连接来敲打这个东西，并注意到当它达到这个大小时，它就不能像通常那样启动一个新的线程了。现在，需要明确的是，这个计划并没有死亡。当线程创建由于缺乏资源而失败时，它只会出现一个有趣的错误，比如幕后的mmap调用无法分配更多的内存。\n正如你所预期的那样，计划的其余部分继续进行。毕竟，内存分配问题不是导致整个系统崩溃的理由。\n就网络问题而言，这主要是客户关心的问题。无可否认，这位客户现在确实很愚蠢。你给它一台主机和一个端口，它就会建立一个连接，然后它就可以开始比赛了。它不做服务发现、通道、负载平衡或任何其他类似的事情。为什么？因为我想先解决服务器端的问题。\n客户完全可以达到这样的地步：去给我找个LavaLamp；，带上一份(有限的)名单，找出谁在附近，谁不在，然后开始尝试联系，并进行健康检查，看看谁实际上是有空的。这句话的意思是：“你可以去找一只LavaLamp；给我找一只LavaLamp；，拿出一份(有限的)名单，找出谁在附近，谁不在。”然后，它将只平衡从用户到这些实例的那些通道上的请求。如果一个人死了，没什么大不了的，它会另找地方去的。用户甚至不应该注意到这一点。\n这是你在谷歌和Stubby一起工作，或者在Facebook和Service Router一起工作时免费得到的。当你在一个还没有解决这个问题的地方工作时，这也是你得不到的。\n旁白：所以，是的，如果我想要超过32K的并发连接，我将不得不在每个线程上处理多个客户端，或者产生另一个进程，或者诸如此类的事情。每个8MB+4096字节的32000个线程相当于大量的地址空间，因此我达到如此高的限制并不令人惊讶。\n我想使用超过1024个FDS，而不需要太长时间。我还想学习如何正确使用EPOLL，这样下一次我看到什么东西用得不好时，它就会变得相当明显。\n我知道这会自动隔离非Linux解决方案。就目前而言，我对此没有意见。如果它在某个时刻开始变得重要，那么我会拉出一个libeventent，并以多种方式实现它。\n但是后来我开始把实际的用例挂在上面，嘿，这真是一段美好的时光。我们还没有谈到这些，但是哦，是的，我拿了这个代码，把一些旧的东西移到上面。这些东西实际上做的是真正的工作，比如来自磁盘的I/O-喘气！-以及创建互斥锁后面的数据结构。天哪，由于并发访问而导致的实际锁争用！\n要点：这相当于开着更大的卡车过桥，直到它们断裂。\n嗯，是的，这就是问题的关键。我想展示一下，你最终是如何无法获得更多的吞吐量，而它只是开始减速。您想要在图表中找到那个膝盖，然后保持在它的下方。\n另外，我已经用卡尔文和霍布斯的漫画告诉负载测试人员停止杀死我的系统已经很长一段时间了。其中一个团体把它作为他们团体的非官方旗帜。", "note_en": "Ah yes, so yesterday&#39;s postabout my stupid little RPC load tests blew up. There&#39;s been a lot of feedback to it and a couple of other related posts. I will attempt to answer or otherwise address some of the points.\n   I&#39;m not going to tell you, at least, not yet. It actually doesn&#39;t matter. I submit that you can write terrible services in any language, and you can probably write halfway decent services in any language. Where the rubber meets the road, however, is when you start squeezing that last 66% out of your hardware.\n  If you haven&#39;t had to work at a place that thinks that scaling up at 33% CPU utilization on a host is normal, then this might not make any sense.I have. It&#39;s terrible.\n By not telling you what language it&#39;s in, I manage to starve out a whole side-shitshow of the &#34;conversation&#34; in which people have a full-on language war and forget about the fact that they still haven&#39;t managed to accomplish the same thing in their language of choice.\n I bet it can be done in the language. Whether it can be done by the people who just bark all day and accomplish very little? That&#39;s another story entirely.\n I will point out that much earlier in this process, a friend decided to write a similar server in a totally different language and also managed to totally destroy the numbers that other places take for granted. The language that friend used is also irrelevant here.\n   Oh, I&#39;m sure they do. Some people probably want it because it delivers. I&#39;m not going to just give it away. Given that this kind of thing seems to be unreasonably rare in the world right now, I figure maybe there&#39;s money to be made here.\n Just think of it. An unencumbered code base in which the only external dependency is protobuf, and last time I checked that&#39;s basically a 3-clause BSD so you can basically do whatever you want as long as you heed the documentation/copyright requirements.\n Also, the protobuf part isn&#39;t exactly critical. You could replace it with a binary-compatible implementation and nobody would know the difference. The wire protocol is well-documented and is easy enough to hack up *by hand* if you just want to test things.\n Has anyone tried making a second-source for gRPC? You know, speak the same language but not use that same implementation? What would that be like?\n Imagine something that won&#39;t clone 50 different &#34;sub modules&#34; from random places on the Internet when you check it out. What a concept, right?\n Also, as I already said, I&#39;m not a partof that whole community thing for multiple reasons. I&#39;m sure not going to hop into it with something like this.\n   It&#39;s not single-threaded, sorry. It uses one thread per connection as a deliberate design choice. I didn&#39;t feel like bothering with thread pools. Could I? Sure. Have I? No, or at least, not yet. If I need them, I&#39;ll add them. Right now, the simplicity is worth it.\n   I&#39;m a veteran of the &#34;dedicated server&#34; market since I used to do tech support for that side of the world a long time ago. It was a natural thing to get a machine back when they were a $5/month employee special, and it was very easy to keep it around afterward.\n I&#39;ve been through several dedicated servers in that time. They just sit there and kind of do their thing. They&#39;re boring, just the way I want it. Any one of these boxes I&#39;ve had over the years could run several business concepts far enough to find out if it&#39;s worth investing more in it. They usually run between $100 and $200/month.\n To me, people saying &#34;on prem&#34; now means some closet in their office. Offices these days frequently have very nice connections, like gigabit or better, with decent transit to anywhere that matters. I came up in the days when having a dedicated T1 line (~1.5 Mbps) for Internet into your business was a big deal. I hosted stuff on those connections. They also worked fine.\n Would I do that again? Maybe. It depends on how quickly I needed to get things happening, and whether I couldn&#39;t just glue something to the side of my existing server.\n Everything comes with risks. Your office connection will have a bad day. Your servers will die. A squirrel will barbeque itself on your transformer and you&#39;ll lose power for the day. A dedicated provider will also have stupid things happen from time to time. Those machines also die now and then.\n Different problems call for different solutions. Time is a factor, money is a factor, what resources you already possess is a factor, and the needed flexibility is a factor.\n That spare box in the closet might just be enough to plant your flag. Just don&#39;t forget to re-assess the situation later on.\n    I assume this means ditching the epoll stuff and just sitting there in read() or something like that. Besides the fact this is what I deliberately avoided in my design, there are other problems.\n My &#34;serviceworker&#34; threads need to do some housekeeping from time to time. They might need to do an idle check in order to punt a client who hasn&#39;t spoken in a while. There might be other things to do. Also, I wanted the ability to clean up and shut down without having to do terrible things to get them &#34;unstuck&#34;.\n Generating a signal to knock it loose? Ugh. Cancelling a thread? Eww, no. Those are nasty compared to what I ended up doing.\n    I like the fact that the only thing scheduling my workers is the kernel itself. You can&#39;t get it jammed up. If you call out to something that &#34;blocks the worker&#34;, you aren&#39;t going to end up with a whole bunch of other stuff which also suffers right away.\n It takes screwing up the whole machine in order to make everything stop.Until you get there, things just hop around, scheduling other places.It&#39;s also a nice slow descent rather than just driving off a cliff.\n The same goes for me and having my own thread pool implementation. There would be the same concerns, plus the added worry of doing it correctly if I had to roll my own.\n   This one is really confusing. It&#39;s like, yeah, I did stop writing every single day in 2013, because I got pulled into the big blue swamp in Menlo Park.\n But even then, I still resurfaced from time to time when there was something I needed to get out: &#34;don&#39;t kill -9 -1&#34;, &#34;Apple&#39;s shipping a terrible git build you can&#39;t even turn off&#34;, that kind of thing.\n Honestly, though, as a job ramps up, it takes more and more energy away from the pool that would otherwise be used to spend time writing here.That&#39;s how it goes. I sign up and I give it everything I have. Call it unhealthy, but it&#39;s the only way I can operate. No half-assing things.\n How this person managed to read one post from 2013 and not see the rest of them from well past that point, I may never know.\n    Some people... are using Python... BADLY. Like, trained monkeys sitting in front of a bunch of dumb terminals wired up to Unix shell accounts running &#34;nc -l (port)&#34; in a loop could run the server better... that kind of badly.\n Most people? You don&#39;t hear about them. It works well enough for them.They aren&#39;t using it badly.\n Some people are also using PHP, C, C++, Perl, Ruby, Rust, Haskell, OCaml, Java, Clojure, BASIC, shell scripts, D, Nim, Kotlin, Julia, JavaScript, Scala and Crystal badly.\n    I&#39;ve been told this a few times by relatively high-up people at different companies. This is really terrible! You honestly think you work with complete nincompoops who can&#39;t learn anything? If that&#39;s true, why do you keep them around?\n I also posit: it&#39;s not true. The fact that they are people means they are clever tool-wielding primates. People, when you have faith in them, will generally come up with interesting solutions to the problems you put in front of them. Just look at what&#39;s been happening with this Twilight Zone lockdown craziness of the past couple of months.\n Restaurants had tons of cleaning stuff and no sit-down traffic to use it on. People stuck at home needed cleaning stuff. Restaurants put two and two together and started selling directly to the public. Brilliant!\n I posit that most people are capable of more than some of these detractors would think.\n You know who I love working with? People who are new at this stuff, haven&#39;t seen too much yet, but are open to anything. Imagine a typical intern. They&#39;re still in school. They&#39;ve done a few things in classes and maybe at one or two other internships. They know they have a long way to go.\n I present a problem to them. They go &#34;I don&#39;t know&#34;. I say &#34;well, you know what, I don&#39;t either&#34;. Then we sit down and figure it out together. I love that! Those are some of the most fulfilling stories I can think of. I got to do this last summer and it was great.\n You know who I don&#39;t like working with? The people who aren&#39;t willing to try something for a better outcome... or even ANY outcome. They&#39;ll dig in their heels and not try the thing I pitched, but they won&#39;t deliver on their so-called solution, either. You get the worst of both worlds.\n It&#39;s easy to say &#34;no&#34; to everything. It takes actual effort to give an alternative. Don&#39;t be the one who always defaults to the laziest, cheapest, crappiest path of least resistance.\n Trust in your employees and their ability to be thoughtful, growth-oriented human beings who are willing to grow and expand their horizons. If you don&#39;t, someone else will.\n   Oh, don&#39;t I know it. The problem with this line is that it can be used well, and it can be used poorly, and I see it being used poorly more often than not.\n But you know what, I&#39;ve seen the innards of those big places and some smaller places - some directly, some via trusted insider reports. Guess what? Far, far smaller places are having miserable times with their &#34;infra&#34; because they thought they could keep getting away with it.After all, they aren&#39;t F, A, the other A, N, or G.\n  Remember, the dirty &#34;secret&#34; of tech is that you have to ship whatever shit will stick to the wall and kinda-sorta work as soon as you can, or someone else will do it first and beat you to the punch. Then, if you stay in business long enough to survive those terrible do-whatever years, you then  earn the opportunity to clean things up.\n The problem is those places which never quite realize that it&#39;s time to shift gears and stop behaving like that tiny little shit-flinging company. They think what worked before will keep working now, and I&#39;m sorry, that&#39;s frequently not the case.\n  Point: having all of those connections in one process is terrible, because what if it dies?\n You&#39;re right, if it dies, then we have a problem. So let&#39;s make sure it doesn&#39;t die as much as possible. We&#39;ll check all of our return codes and not assume things work. We&#39;ll deal with whatever exception type stuff our language provides. We&#39;ll build a system that aborts individual requests or connections and doesn&#39;t crash the whole process.\n  But still, sure, okay, run a couple of them if you want. You could even run them on the same box if you&#39;re that paranoid about it. I wouldn&#39;t, but hey, you&#39;re the boss.\n  Point: what if it restarts? OMG TIME_WAIT and not being able to bind to the port again!\n I&#39;m not going to demonstrate it here right now (this post is more of an anthology device, and we&#39;re staying on the train), but trust me when I say I can run the server in a &#34;while true; do thing; done&#34; loop, ^C it, and it&#39;ll come right back up -- even if there are clients actively whacking away at it. It doesn&#39;t have to be a clean shutdown either. SIGKILL it or whatever you want, and it&#39;ll still work out fine.\n Why? Because I did my homework and twiddled all of those knobs. It&#39;s not necessarily SO_REUSE* ... there are more. Really. Go look.\n Why? Because while I was developing it, I was just using netcat as my &#34;client&#34; just to generate TCP connection activity, and having to wait for a minute or two for things to clear out after killing the server really sucked!\n This is the kind of stuff that you discover pretty quickly if you&#39;re actually testing as you go, and don&#39;t just settle for &#34;well, guess I&#39;ll go get a coffee&#34;, and decide to dig in and clean up your messes properly.\n Also, if you have a reasonable system for discovering instances of your service, you shouldn&#39;t need to come up on the same port. It shouldn&#39;t matter where you are, as long as there are enough of you available within whatever locality is needed to meet your latency requirements.\n   Do you say the same thing to everything else on Hacker News? Because, honestly, there&#39;s very little new under the sun. Most of what you read about is the same thing from five years ago with another name slapped on it (and perhaps another layer of indirection/abstraction added).\n    I looked at the most recent post for some statistically improbable terms just to see how bad it might be. Let&#39;s just see.\n  I suspect I could post about baking chocolate chip cookies and get the same complaint from certain individuals. Baking soda! Unsalted butter! Cup measures! Golden brown! Kicking off!\n Basically, there&#39;s no way for me to do it right, because it&#39;s done by me. The topic doesn&#39;t matter, the presentation doesn&#39;t matter, and the wording doesn&#39;t matter. I should sit down, shut up, and provide them technical output like a good little peon.\n    Point: (similar tales of woe about terrible systems boiling when you so much as look at them funny)\n If not for this quarantine thing, I&#39;d probably buy you a drink of choice for being a fellow member of the &#34;keeps random crap running&#34; club. Hang in there, and remember, there are places where it&#39;s not like that all the time. Bide your time and keep your options open.\n   I haven&#39;t gone to any lengths from my perspective. There&#39;s nothing in the code (yet) which says &#34;oh, I&#39;m under attack, so maybe I should do something about it&#34;. I could, for example, wave off connections after certain operations reach a certain amount of latency, or limit connections per source address, or per user, or any other dimension that might be useful.\n There is ONE limiter in there right now: I actively reject new connections once I hit 32000 serviceworker threads. It turns out that going much beyond that starts making life very interesting since your VSZ is, well, massive.\n Why did I do the thread limiter? Well, early on, I was hammering the thing with connections, and noticed that it would fail to do the usual stuff to start a new thread when up around that size. Now, to be clear, the program did not die. It would just have a funny error when thread creation failed due to a lack of resources, like a mmap call behind the scenes failing to allocate more memory.\n The rest of the program kept going, as you would expect. A memory allocation problem is no reason to crash the whole thing, after all.\n In terms of &#34;network issues&#34;, those would mostly be the concern of the client. The client is admittedly stupid right now. You give it a host and a port, it nails up a connection, and it&#39;s off to the races. It&#39;s not doing service discovery, channels, load balancing, or anything else of the sort. Why? Because I wanted to solve for the server side first.\n The client could totally get to the point where it is told &#34;go find me a LavaLamp&#34;, brings in a (limited) list of them, figures out who&#39;s close by and who isn&#39;t, then starts attempting connections and doing health checks to see who&#39;s actually available. Then it&#39;ll just balance the requests from the user onto those channels to those instances. If one dies, no big deal, it&#39;ll find another place to go. The user shouldn&#39;t even notice.\n This is what you get for free when you work at Google with Stubby, or at Facebook with Service Router. It&#39;s also what you don&#39;t get when you work at a place that hasn&#39;t solved this problem yet.\n Aside: so, yeah, if I want to go past 32K simultaneous connections, I&#39;m going to have to do multiple clients per thread, or spawn another process, or something like that. 32000 threads at 8 MB + 4096 bytes each equals a LOT of address space, and it&#39;s not surprising that I&#39;m hitting limits up that high.\n    I wanted to use more than 1024 fds without going to lengths. I also wanted to learn how to use epoll correctly so that it&#39;ll be quite obvious the next time I see something using it poorly.\n I know this automatically walls off non-Linux solutions. I&#39;m okay with that for the moment. If it starts to matter at some point, then I&#39;ll pull a libevent and implement it multiple ways.\n    But then I started hanging actual use cases off of it, and hey, good times. We haven&#39;t talked about those yet, but oh yes, I took this code and moved some older stuff onto it. These things actually do real work, like I/O from the disk - gasp! - and frobbing data structures which are behind mutexes. OMG, actual lock contention because of concurrent accesses!\n   Point: this is the equivalent of driving bigger trucks across the bridge until they break.\n Well, yeah, that&#39;s the whole point. I wanted to demonstrate how you eventually can&#39;t get any more throughput and it just starts slowing down. You want to find that knee in the graph and then stay below it.\n  Also, I&#39;ve been using that Calvin and Hobbes comic to tell load testing people to stop killing my systems for a very long time now. One group made it the unofficial banner of their group.", "posttime": "2020-05-09 10:03:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "反馈,reader", "title": "对读者反馈的回应", "title_en": "Responses to Reader Feedback", "transed": 1, "url": "https://rachelbythebay.com/w/2020/05/08/feedback/", "via": "", "real_tags": ["反馈", "reader"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001352, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英国《卫报》透露，政府科学顾问对此感到愤怒，因为他们认为，在冠状病毒封锁期间，政府科学顾问试图通过在一份官方报告向公众发布之前对其进行大量编辑，来审查他们对政府提案的建议。\n这份报告是紧急情况科学咨询小组(Sage)本周发布的一系列文件之一，目的是平息越来越多的批评，即向应对冠状病毒的部长们提供的建议缺乏透明度。\n然而，这份由SPI-B编制的报告中的大段文本被完全删掉了。SPI-B是Sage小组委员会，提供行为科学家关于公众可能如何应对封锁措施的建议。\nSPI-B的几名成员告诉卫报，文件的编辑部分包含了他们对潜在政府政策的批评，这些政策是他们在3月底和4月初被正式要求考虑的。\nSPI-B的一位顾问说：“这太愚蠢了，而且完全适得其反。”另一名委员会成员说：“我得到的印象是，本届政府不想要任何批评。”\n周五下午，在“卫报”披露了对编辑后的报告感到失望之后，政府顾问委员会的另一名成员在Twitter上抱怨他所说的“斯大林主义”审查制度。\n圣安德鲁斯大学(University Of St Andrews)社会心理学教授斯蒂芬·赖彻(Stephen Reicher)说：“就我个人而言，与其说是愤怒，不如说是困惑。”“在这场危机中，我们拥有的最大资产是公众的信任和坚守。你想要信任吗？你需要对人敞开心扉。这个不是开着的。这让人想起斯大林主义的俄罗斯。看上去不怎么样。“。\n委员会成员之间一直在讨论如何最好地对编辑做出回应，他们认为这是一项危及他们独立性的高压举措。\n据悉，至少有一名科学顾问正在考虑辞职，原因是政府围绕冠状病毒爆发对科学采取了保密的做法，他们认为这正在破坏公众的信任。\n4月1日的这份报告总结了SPI-B关于如何处理刚刚为减缓冠状病毒传播而引入的社会疏远措施可能发生的变化的讨论。\n在Sage的政府网站上发布的版本中，几乎有一页半的文本被大量编辑。卫报理解与SPI-B大约在那个时候批评可能的政府提案有关的被屏蔽的文本。\n这些措施包括减少英国人可以花在锻炼或购物上的时间，以及对那些被发现违反封锁的人进行更严厉的经济处罚。第三项提案涉及要求人们自我验证他们的行动，就像法国所发生的那样，那里的公民被要求在离开家之前完成许可证。\nSPI-B的专家(包括心理学、流行病学和人类学教授)表示，他们认为这些提议过于惩罚性，更有可能导致贫困经济状况下的人受到不公平待遇。\n政府科学办公室的一位发言人表示，之所以进行编辑，是因为文件中讨论的政策仍在考虑中。\n这位发言人说：“唯一的编辑内容涉及一个Sage小组的评论，其中具体提到了仍在考虑中的政策或取消联系。”\n“编辑工作是由Sage秘书处的官员与制定政策的部门协商后进行的。所有小组均获通知，并有机会在发表前就任何文件的特定内容所作的修订发表意见。“\n然而，接受卫报采访的SPI-B顾问驳斥了他们被征询过意见的说法。第二个SPI-B成员说：“我们没有得到事先通知，我们仍然没有得到一个令人满意的解释。”他补充说，他们觉得编辑是为了压制批评。\n“这届政府没有表现出任何自我批评，因为每个人都很明显地看到，他们犯了大错。如果你想得到民众的信任，你就举手说‘我们犯了这些错误，这就是为什么会发生这些错误，我们后悔，我们正在从中吸取教训’。而不是一直说‘我们做得最棒了’，而不是以任何方式接受批评。“。\nSPI-B的第三名成员表示，他们认为这些修订破坏了专家组对政客的独立性。“这份经过编辑的文件中记录的是我们对这些建议的批评。他们只是没有特别深思熟虑。在这里，我们是独立的，你看不到这一点(因为编辑)。“。\nSPI-B的第四名成员质疑大量的编辑工作是否可能是一个错误，因为这些文件是公务员编制的委员会讨论的摘要。\n“这是一个错误还是故意并不重要；这不应该发生，这是非常有问题的，”这位顾问说。“公众需要对科学建议有信任和信心，政府声称这是它所依赖的，而看到出版的文件中的章节被编辑会削弱信任和信心。”\n据悉，该委员会对政府提案的审议是在3月23日开始的封锁的第一周进行的。\n行为科学家在他们长达4页的报告中表示，人们一致认为，对政府指导方针的高度遵守“很可能在中短期内保持不变，只要冠状病毒构成无法通过任何其他方式管理的严重风险”就是如此。这两位行为科学家在他们长达4页的报告中表示，人们一致认为，只要冠状病毒构成无法用任何其他方式管理的严重风险，“在中短期内很可能会保持高度遵守政府指导方针的水平”。\n然而，他们担心，引入更多强制性措施，如对行动实施更严格的限制，可能会破坏高度遵守的情况，他们表示，这“很可能是基于社区合作的感觉”。", "note_en": "Government scientific advisers are furious at what they see as an attempt to censor their advice on government proposals during the Covid-19 lockdown by heavily redacting an official report before it was released to the public, the Guardian can reveal.\n The report was one of a series of documents published by the Scientific Advisory Group on Emergencies (Sage) this week to mollify growing criticism about the lack of transparency over the advice given to ministers responding to the coronavirus.\n However, large blocks of text in the report, produced by SPI-B, the Sage subcommittee providing advice from behavioural scientists on how the public might respond to lockdown measures, were entirely blanked out.\n Several SPI–B members told the Guardian that the redacted portions of the document contained criticisms they had made of potential government policies they had been formally asked to consider in late March and early April.\n One SPI-B adviser said: “It is bloody silly, and completely counterproductive.” A second committee member said: “The impression I’m getting is this government doesn’t want any criticism.”\n On Friday afternoon, after the Guardian revealed frustrations over the redacted report, another member of the government’s advisory committee took to Twitter to complain of what he said was “Stalinist” censorship.\n “Personally, I am more bemused than furious,” said Stephen Reicher, a professor of social psychology at the University of St Andrews. “The greatest asset we have in this crisis is the trust and adherence of the public. You want trust? You need to be open with people. This isn’t open. It is reminiscent of Stalinist Russia. Not a good look.”\n Members of the committee have been discussing among themselves how best to respond to the redaction, which they believe was a heavy-handed move that jeopardises their independence.\n  At least one scientific adviser is understood to be considering resigning over the government’s secretive approach to science around the Covid-19 outbreak, which they believe is undermining public trust.\n The report, from 1 April, summarised SPI-B’s discussions about how to handle possible changes to the social distancing measures that had just been introduced to slow the spread of Covid-19.\n In the version published on  Sage’s government website, almost a page and a half of text was heavily redacted. The Guardian understands the blocked text related to SPI–B’s criticism about possible government proposals around that time.\n These included the idea of reducing the amount of time Britons could spend exercising or shopping, and stricter financial penalties for those found to be breaking the lockdown. A third proposal involved requiring people to self-validate their movements, as was occurring in France, where citizens were required to complete permits before leaving home.\n Experts on SPI-B, which includes professors in psychology, epidemiology and anthropology, said they felt the proposals were too punitive and more likely to result in unfair treatment among people in deprived economic circumstances.\n A spokesperson for the Government Office for Science said the redactions took place because the policies discussed in the document were still under consideration.\n “The only redactions relate to comments made by a Sage subgroup where specific reference is made to policy still under consideration or to remove contact,” the spokesperson said.\n “Redactions were carried out by officials working for the Sage secretariat in consultation with the department developing the policy. All the subgroups were notified and given the opportunity to comment in advance of publication on the redactions being made to specific elements of any papers.”\n However, SPI–B advisers who spoke to the Guardian disputed that they had been consulted.  “We weren’t given advance notice and we still haven’t been given a satisfactory explanation,” the second SPI–B member said, adding they felt the redaction had been intended to stifle criticism.\n “This government has failed to show any self-criticism whatsoever, when it is glaringly obvious to everybody that big mistakes have been made. If you want the trust of the population you hold up your hand and you say ‘we’ve made these mistakes, this is why they happened, we regret it, we’re learning from it’. Rather than just keep saying ‘we’ve done the most fantastic job’ and not being open to criticism in any way.”\n  A third member of SPI–B said they felt the redactions undermined the expert group’s independence from politicians. “What is recorded in the redacted document is us criticising those proposals. They were just not particularly well thought out. Here we were being independent, and you can’t see it [because of the redactions].”\n A fourth member of SPI-B questions whether the heavy redaction might even have been a mistake, as the documents were summaries of the committee’s discussions produced by civil servants.\n  “Whether it was a mistake or deliberate doesn’t matter; it should not have happened, it’s deeply problematic,” the adviser said. “The public needs to have trust and confidence in the scientific advice, which the government claims it is relying on, and to see sections redacted in published documents diminishes trust and confidence.”\n The committee’s consideration of the government proposals is understood to have occurred during the first week of the lockdown, which began on 23 March.\n The behavioural scientists said in their four-page report that there was a consensus that the high-levels of adherence to government guidelines “are likely to be maintained in the short-to-medium term, for as long as it is evident that Covid-19 poses a serious risk that cannot be managed in any other way”.\n However they were concerned that introducing more coercive measures, such as more draconian restrictions on movements, risked undermining the high levels of adherence, which they said was “likely based on a sense of community cooperation”.", "posttime": "2020-05-09 09:33:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,冠状病毒,病毒,censor,政府", "title": "英国科学家谴责“斯大林主义”企图审查冠状病毒建议", "title_en": "UK scientists condemn 'Stalinist' attempt to censor Covid-19 advice", "transed": 1, "url": "https://www.theguardian.com/world/2020/may/08/revealed-uk-scientists-fury-over-attempt-to-censor-covid-19-advice", "via": "", "real_tags": ["科学家", "冠状病毒", "病毒", "censor", "政府"]}, {"category": "", "categoryclass": "", "imagename": "453380464056990f0f0190b93a81e2df.jpg", "infoid": 1001351, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "IT服务提供商Cognizant在本周的财报电话会议上表示，上个月发生在2020年4月的勒索软件事件将对其第二季度收入产生负面影响。\n虽然我们预计与这个问题相关的收入影响将在本季度中期基本得到解决，但我们确实预计本季度的收入和相应的利润率影响将在5000万至7000万美元之间，Cognizant首席财务官卡伦·麦克洛夫林(Karen McLoughlin)在昨天的财报电话会议上表示。\nMcLoughlin还预计，该事件将招致与调查、恢复服务和补救违规相关的额外和不可预见的法律、咨询和其他成本。\nCognizant首席财务官表示，公司现在已经完全从勒索软件感染中恢复过来，并恢复了大部分服务。\n在谈到勒索软件攻击时，Cognizant首席执行官布莱恩·汉弗莱斯(Brian Humphries)表示，这起事件只影响了其内部网络，但不影响客户系统。\n更确切地说，汉弗莱斯表示，勒索软件事件影响了(1)Cognizant支持员工在家工作的精选系统，以及(2)在冠状病毒流行期间Cognizant用来支持在家工作能力的笔记本电脑的供应。\n汉弗莱斯说，工作人员迅速采取行动，关闭了所有受影响的系统，这在一段时间内影响了Cognizant的计费系统。作为预防措施，一些客户服务部门被关闭了。\nCogizant与客户举行了会议，然而，由于Cognizant避免透露所发生事情的任何实际细节，会议进行得并不顺利。\nZDNet了解到这一事件的时间是在4月17日，当时几名心怀不满的客户联系了本报记者，称该公司试图以技术问题为幌子掩盖一个重大的安全漏洞，并切断了一系列服务的接入。\n起初，客户担心黑客从服务器窃取了用户数据，或者发生了勒索软件事件，勒索软件传播到客户服务器，加密了他们的数据，服务器变得无法访问。\n在Cognizant向所有客户发送内部警报，敦促客户阻止IP地址列表的流量后，客户被推入完全偏执的模式。\n客户很快将IP地址链接到过去由迷宫勒索软件团伙运营的网络服务器。\n作为美国最大的服务器托管和IT服务提供商之一，Cogizant最终在4月18日公开承认，其网络在一天后感染了迷宫勒索软件。\n这起事件的认知损失与铝生产商挪威海德鲁(Norsk Hydro)去年报告的范围相同，该公司报告称，2019年3月的勒索软件事件将导致总收入损失超过4000万美元，该公司后来将这一数字调整为年内近7000万美元。\n汉弗莱斯表示，Cognizant目前正在努力解决客户的担忧，这些客户在勒索软件攻击后选择暂停Cognizant服务，这也影响了Cognizant目前的利润。\n近年来，美国证交会(SEC)将勒索软件列为公司利润主要前瞻性风险因素的申请数量从2014年的3份飙升至2019年的1139份，2020年已经达到743份。企业今天将勒索软件攻击视为其利润的真正风险，因为勒索软件事件往往会对股价造成声誉损害，并因收入损失而造成财务损失，因为大多数受害者需要数周至数月的时间才能完全恢复。", "note_en": "IT services provider Cognizant said in an earnings call this week that a ransomware incident that took place last month in April 2020 will negatively impact its Q2 revenue.\n &#34;While we anticipate that the revenue impact related to this issue will be largely resolved by the middle of the quarter, we do anticipate the revenue and corresponding margin impact to be in the range of $50 million to $70 million for the quarter,&#34; said Karen McLoughlin, Cognizant Chief Financial Officer in an earnings call yesterday.\n McLoughlin also expects the incident to incur additional and unforeseen legal, consulting, and other costs associated with the investigation, service restoration, and remediation of the breach.\n The Cognizant CFO says the company has now fully recovered from the ransomware infection and restored the majority of its services.\n  Speaking on the ransomware attack, Cognizant CEO Brian Humphries said the incident only impacted its internal network, but not customer systems.\n   More precisely, Humphries said the ransomware incident impacted (1) Cognizant&#39;s select system supporting employees&#39; work from home setups and (2) the provisioning of laptops that Cognizant was using to support its work from home capabilities during the COVID-19 pandemic.\n Humphries said staff moved quickly to take down all impacted systems, which impacted Cognizant&#39;s billing system for a period of time. Some customer services were taken down as a precaution.\n   Cognizant held meetings with customers, however, the meetings did not go smoothly as Cognizant avoided sharing any actual details of what had happened.\n ZDNet learned of the incident as it was going on, at the time, on April 17, when several disgruntled customers had reached out to this reporter about the company attempting to hide a major security breach under the guise of &#34;technical issues&#34; and cutting off access to a series of services.\n Initially, customers feared that a hacker had either stole user data from servers, or a ransomware incident had taken place, and the ransomware spread to customer servers, encrypting their data and the servers becoming inaccessible.\n Customers were thrown in full paranoia mode after Cognizant sent an internal alert to all customers, urging clients to block traffic for a list of IP addresses.\n Customers were quick to link the IP addresses to web servers operated in the past by the Maze ransomware gang.\n Cognizant, one of the largest providers of server hosting and IT services in the US, eventually publicly admitted that its network was infected with the Maze ransomware a day later  on April 18.\n  Cognizant losses from the incident are in the same range reported last year by aluminum producer Norsk Hydro, which reported that a March 2019 ransomware incident would cause total revenue losses of  more than $40 million, a number it later adjusted to nearly $70 million during the year.\n Humphries said that Cognizant is now working to address the concerns of customers who opted to suspend Cognizant services in the wake of the ransomware attack, which also impacted Cognizant&#39;s current bottom line.\n  The number of SEC filings listing ransomware as a major forward-looking risk factor to companies&#39; profits  has skyrocketed in recent years from 3 filings in 2014 to 1,139 in 2019, and already 743 in 2020. Companies are seeing today ransomware attacks as a real risk for their bottom lines as ransomware incidents tend to cause reputational damage to stock prices and financial losses due to lost revenue as most victims take weeks and months to fully recover.", "posttime": "2020-05-09 09:17:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,cogizant,expects,客户", "title": "Cogizant预计在勒索软件攻击后损失在5000万至7000万美元之间", "title_en": "Cognizant Expects To Lose Between $50 Million and $70 Million Following Ransomware Attack", "transed": 1, "url": "https://www.zdnet.com/article/cognizant-expects-to-lose-between-50m-and-70m-following-ransomware-attack/?ftag=TREc64629f&bhid=24300273679863920476885701297324&mid=12825712&cid=717442900", "via": "", "real_tags": ["软件", "cogizant", "expects", "客户"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001350, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "通常，当我在这里写东西时，我会花时间充分思考一个观点，提出一个理由，解决我能想到的问题的所有主要方面，等等。\n但是这周我已经因为使用代码库而筋疲力尽了，所以这篇文章不会出现在那些帖子中。我打算尝试一下意识流博客。\n当程序员对自己说，我这里有一些代码或想法，我认为这些代码会让其他人的生活变得更轻松时，代码通常有两种大致的形式：库或框架。\n库是一组构建块，它们可以共享一个共同的主题或很好地协同工作，但在很大程度上是独立的。\n框架是一个上下文，用户可以在其中编写自己的代码。这可以采取控制反转、特定于领域的语言，或者仅仅是一个非常固执己见的内部耦合库的形式。这是一种谱系；两者之间没有硬性界限。判断某物是否为框架的一种方法是问问自己，我可以将其与其他类似的东西结合使用吗？或者它已经建立了与其他可能做这些事情的方式相互排斥的做事方式？&#34；\n框架的主要特点是它们对程序员施加了限制。它们没有提供一组程序员可以做的新事情，而是对程序员可以做的事情建立了一个边界。作为灵活性的交换，它们通常消除样板，为在其上构建新的库建立试金石，并允许程序员的技能在项目之间变得更具可移植性。事实上，有时限制本身是可取的！毕竟，类型系统只不过是对代码施加限制的一种方式。限制本身并不是坏事。\n但是。当你编写一个框架，希望别人用它来构建真正的项目时(也就是说，它不只是一个玩具)，你承担的责任比你使用库要大得多。\n通常，框架必须提前预测其用户在其围墙内可能需要做的每一种事情。对于它吸收到自己的词汇表中的每一块拼图，它必须承担起这组任务的责任。它不仅必须注意需要在其中完成的每项任务都能完成，而且理想情况下，它还需要提供一种比正常方式更好的方式来完成这些任务。否则，为什么要用它呢？\n这也转化为开发人员的体验。您的框架是否引入了超越基本语言的基于约定的行为？您最好彻底记录这些内容，否则用户将无可救药地迷失方向。您是否引入了一种特定于领域的语言？您现在负责构建链的一部分，并负责编辑器集成。\n现在，如果有一个主要的组织支持这个框架，也许这个演算就会奏效。谷歌可以背角度，枢轴可以背弹簧，史诗可以背虚幻引擎。在这些情况下，框架方法是可行的，因为存在真正涵盖所有需要覆盖的基础的资源和意愿。\n但是，如果没有大的组织；如果项目是由个人、初创公司或不是公司核心的小团队编写和维护的，那么它几乎肯定会在库中出错。有了库，核心概念的编辑器集成和文档更有可能掌握在语言初学者自己手中。对于库，任何缺陷--如错误、文档缺失、功能缺失、缺乏持续维护、与其他库的争议性等--都更有可能被自定义代码或其他库中的片段所掩盖。有了库，好的部分可以零碎地使用，而不必因为一个没有人会在后备箱里解决的问题而扔掉整个东西。\n所以我的观点是：框架并不总是糟糕的，但它们比库更大的风险--无论是对创建者还是用户。如果您的框架能够在不损失太多的情况下成为一个库，那么它很可能就应该是一个库。如果你没有在一家大型科技公司工作，你可能没有时间或精力去给予一个框架它所需要的所有关注。图书馆不是万能的，但它们应该是首选。", "note_en": "Normally when I write about something on here I take the time to fully think-out a point, make a case, address all the major sides of the issue that I can think of, etc.\n  But I am exhausted from fighting with a codebase this week, so this is not going to be one of those posts. I&#39;m going to try a little stream-of-consciousness blogging.\n  When a programmer thinks to herself &#34;I&#39;ve got some code or an idea for some code here that I think will make others&#39; lives easier&#34;, there are generally two broad-strokes forms that code can take: a library, or a framework.\n  A library is a set of building blocks that may share a common theme or work well together, but are largely independent.\n  A framework is a  context in which someone writes their own code. This could take the form of inversion-of-control, a domain-specific language, or just a very opinionated and internally-coupled library. It&#39;s a spectrum; there&#39;s no hard line between the two. One way to tell if something is a framework is to ask yourself, &#34;Could I use this in combination with something else like it? Or has it established ways of doing things that are mutually-exclusive with other ways those things might be done?&#34;\n  Frameworks&#39; key trait is that they impose  limitations on the programmer. Rather than  providing a set of new things the programmer can do, they establish a  boundary on the things the programmer can do. In exchange for flexibility they often eliminate boilerplate, establish a touchstone for new libraries to be built on top of them, and allow a programmer&#39;s skills to become more transferrable beteen projects. In fact, sometimes the limitations themselves are desirable! After all, type systems are nothing but a way of imposing limitations on code. Limitations are not intrinsically  bad.\n  However. When you write a framework that you expect others to build real projects with (i.e. it isn&#39;t just a toy), you are taking on a much greater responsibility than you would with a library.\n  A framework, usually, must predict ahead of time every kind of thing a user of it might need to do within its walls. For each piece of the puzzle that it assimilates into its own vocabulary, it must take over responsibility for that set of tasks. It must not only take care that every task that needs to be done in it  can be done, it ideally needs to offer a  better way of doing those things than the way they would be done normally. Otherwise, why use it?\n  This translates to the developer experience as well. Does your framework introduce convention-based behaviors that go beyond the base langauge? You&#39;d better thoroughly document those, or users will become hopelessly lost. Do you introduce a domain-specific language? You&#39;re now responsible for part of the build chain, and for editor integration.\n  Now, if there&#39;s a major organization backing the framework, maybe the calculus works out. Google can back Angular, Pivotal can back Spring, Epic can back Unreal Engine. These are the cases where the framework approach can work out, because there exist the resources and the will to really cover all of the bases that need covering.\n  But if there is not a major organization; if the project is written and maintained by an individual, or a startup, or a small team who isn&#39;t central to their company, it almost certainly should err on the &#34;library&#34; side of things. With a library, editor integration and documentation of core concepts are more likely to remain in the hands of the language matinainers themselves. With a library, any shortcomings - in the form of bugs, missing documentation, missing functionality, lack of continued maintenance, combatibility with other libraries, etc. - are much more likely to be able to be papered-over with custom code or with pieces from other libraries. With a library, the good bits can be used piecemeal without having to throw the whole thing away because of one problem that nobody&#39;s ever going to fix in the trunk.\n  So here&#39;s my point: frameworks aren&#39;t always bad, but they are a much bigger risk - for both the creators and the users - than libraries are. If your framework can be a library without losing much, it probably should be. If you don&#39;t work at a major tech company, you probably don&#39;t have the time or energy to give a framework all of the attention it requires. Libraries aren&#39;t everything, but they should be preferred.", "posttime": "2020-05-09 09:16:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编写,libraries,框架", "title": "编写库，而不是框架", "title_en": "Write Libraries, Not Frameworks", "transed": 1, "url": "https://www.brandonsmith.ninja/blog/libraries-not-frameworks", "via": "", "real_tags": ["编写", "libraries", "框架"]}, {"category": "", "categoryclass": "", "imagename": "9baff3f416b4c1e84b045167f2cc4048.png", "infoid": 1001349, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人工智能不应该作弊。也就是说，使用人类玩家不可用任何资源和/或信息。\n对AI的调整必须在每个核心模块中进行测试。一个方面的改善不应该对其他多器官功能障碍有负面影响。\n我不应该照看球员。将Micro从RTS流派中移除并不是OpenRA的目标。\n管道和一般逻辑是由C#代码处理的，也应该由C#代码处理。变量，如建筑比率、班组组成、队列和单位名称存储在MiniYAML文件中。这使得开发人员可以相对轻松地对AI进行细微的调整。\n然而，大多数特定于MOD的行为，以及所有更复杂的行为，都不能以这种方式合理实现，这是因为人工智能需要在不同的MOD中支持许多特定的功能，这些功能大多是独占的，甚至是相互冲突的。\n这种瘫痪的人工智能在许多关键领域产生了问题，包括但不限于：战术决策、资源使用优化和基地建设。\n因此，未来的OpenRA AI应该使用Lua脚本来制定所有特定于MOD的决策，以及所有复杂的行为。这样的AI实现将允许建模者和开发人员根据自己的需要轻松地调整AI，同时还可以防止C#代码和MiniYAML文件不必要的膨胀。已经有几次尝试实现这样的人工智能，到目前为止都没有完全成功。最值得注意的包括：#12949。\n团队协调：人工智能应该能够与队友分享信息，并对他们的环境做出反应。这包括人类和人工智能球员。\n精准经济管理。因此，人工智能意识到它的资源，并能够根据需要重新分配它们。", "note_en": "AI shouldn&#39;t cheat. That is, use any resources and or information not available to human player.\n   Adjustments to the AI must be tested in each of the core mods. Improvement in one shouldn&#39;t negatively impact other mods.\n   AI shouldn&#39;t babysit the player. Removing micro from RTS genre  is not the goal of OpenRA.\n  The plumbing and general logic is handled, and should be handled, by C# code.The variables, such as building ratios, squad composition, queues and unit names are stored in miniYAML file.This allows developers to perform minor tweaks on the AI, with relative ease.\n However, most mod specific behavior, and all more complex behavior, can not be reasonably implemented in this fashion.This is because of many specific features the AI has to support in different mods, most of which are exclusive and even conflicting with each other.\n Issues arising from this cripple AI in many key areas, including but not limited to: tactical decisions, resource use optimization and base construction.\n  Therefore the future OpenRA AI should use LUA scripts for all mod specific decision making, as well all complex behavior.Such AI implementation would allow modders and developers to easily adjust AI to their needs, while also preventing unnecessary bloat of C# code and miniYAML files. There have been several attempts to implement such AI, so far none of them completely successful.The most notable ones include: #12949\n  Team coordination: The AI should be able to share information with its teammates, and react to their circumstances.This includes both human and AI players.\n  Precise economic management. So that AI is aware of it&#39;s resources and is able to reallocate them as needed.", "posttime": "2020-05-09 09:01:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,ai,人工智能", "title": "OpenRA AI开发指南", "title_en": "OpenRA AI Development Guidelines", "transed": 1, "url": "https://github.com/OpenRA/OpenRA/wiki/AI-Development-Guidelines", "via": "", "real_tags": ["开发", "ai", "人工智能"]}, {"category": "", "categoryclass": "", "imagename": "4b22f0769d5d63b239b2fff37264705d.png", "infoid": 1001346, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我真的很想成为一名大公司的人，但我是一个容易感到无聊的多面手，而现实是我喜欢创业。诚然，在大多数初创公司中，大多数事情都是永无止境的，但如果你能接受这一点，那就有很多值得喜欢的地方。有一个众所周知的例子：在一家快速发展的初创公司，一个勤奋、有才华的人，如果得到公司领导层的一些支持，通常可以很快获得一个令人印象深刻的头衔(或者至少是很多事实上的权力)。\n我遇到过很多以这种方式上台的人，他们几乎没有或根本没有管理经验，有时甚至对自己角色的核心职责没有太多经验。一切都是新的，而拥有权力本身又是一件新的事情。我在我的编程生涯中只有几年的时间就第一次遇到了这种情况，我发现它让我迷失了方向。我有时可以感觉到，就像质量扭曲时空结构一样，权力正在重塑我周围的一切，但我看不到确切的方式。以下是我希望自己当时就知道的一些事情：\n权力会扭曲品味。这个世界上我最喜欢的一件事是，有人说了一些非常有趣的话，却没有人笑--可能是因为承认你听懂了这个笑话太小众和怪异了，也许是因为你在电话会议上假装在听，一位同事给你发了一张有趣的截图，也许是因为你在偷听，试图表现得好像你在关心自己的事情。不管是什么原因，我喜欢看着人们尽量不笑。我过去常常讲很多笑话，这些笑话要么很愚蠢，要么晦涩难懂，以至于人们很少笑，我对此很高兴。但是，当我在我管理的第一支球队签下第一个新员工后，我注意到了一些事情-人们开始嘲笑我所有的笑话。我被搞糊涂了。我并没有变得更有趣。我的同事们并没有变得更加坚忍。几周后，我突然意识到：这是因为我变得更强大了。我仍然不确定这到底有什么关系--我猜人们比以往任何时候都更关心与我保持良好的关系，所以如果这个笑话既聪明又无害，为什么不加入到笑声中来呢？起初，我很反感--这似乎是一种卑躬屈膝的粗暴表现--尽管我知道这些人谁也不会承认(甚至可能不相信)他们已经改变了自己的行为。后来我意识到，这并不是真的(或者，至少，只是)拍马屁。权力定义了什么是正常的-突然之间，我的幽默感向主流跌跌撞撞地走了一步，刚刚接近到可以让我们在午餐时都笑的东西。\n权力扭曲了责任。我经常去的部门有两个人会做出同样的问题行为，但只有一个人会经常因此而被叫出来。有时这是显而易见的事情，比如合并没有审查者的公关，有时是更微妙的事情，比如在会议上以高人一等的姿态与其他人交谈。一个人会当场面对，而另一个人可能会一言不发地逃脱。总是有理由的：“嗯，那个人是一名高级软件工程师”，或者，“我认为他的行为还不够糟糕，不足以挑起争执。”但更多时候，我开始注意到，与他们的待遇最相关的是他们在团队中的权力。当然，效果只能和那个人的力量一样持久；通常情况下，当那个人绊倒并失去一些感知到的力量时，一群手持干草叉的暴徒突然出现在他们周围。他们总是大吃一惊。我永远无法解释这一点--他们可能没有意识到别人对他们行为的感受，他们的批评者突然都选择了同一时间提出他们的抱怨。但权力扭曲了责任。这里有多个因素：很少有人想给有权势的人带来令人不快的反馈，有权势的人有时觉得不可战胜，可以忽略更多的批评而逍遥法外，最阴险的是，人们有时会微妙地调整他们对因果和责任的理解，将积极的结果归因于有权势的人，将消极的结果归因于不那么有权势的人。相比之下，我们似乎愿意给那些因自己的错误选择而跌跌撞撞的富人和有权势的人提供如此多的新机会，但我们喜欢憎恨穷人的问题，尽管所有明显的结构性因素都对他们不利。同样的事情也发生在公司里。\n权力扭曲了意义。对新获得的权力最大的迷失方向之一是，它可以改变你所做和所说的一切的意义。曾经你没有回复偶尔发来的“松弛”信息，是因为你头脑不集中，很忙，现在是因为你觉得自己太重要了，不会被打扰。**你的行为一点也没有改变，但是突然之间，人们认为你有了新的个性。“。一个例子是：一位同事曾经从一个特定小组的成员晋升为该小组的领导人。转换几周后，我要求她停止回复“+1”以松弛消息", "note_en": "I truly  want to be a big company person, but I am a generalist who gets bored easily, and the reality is that I love startups. It’s true that most things at most startups are perpetually on fire, but if you can accept that, there is a lot to like. One well-known one: at a fast-growing startup, a hard-working, talented person who has some support from company leadership* can often acquire an impressive title (or at least a lot of de facto power) very quickly.\n I’ve met a lot of people who have come to power this way with little or no management experience and sometimes not even much experience with the core responsibilities of their role. Everything is new, and having power itself is one more new thing. I first landed in that situation only a few years into my programming career, and I found it so disorienting. I could sometimes feel that, just as mass distorts the fabric of space time, power was reshaping everything around me, but I couldn’t see exactly how. Here are some things I wish I’d known at the time:\n Power bends taste. One of my favorite things in the world is when someone says something very funny and nobody laughs — maybe because it’s too niche and weird to admit that you got the joke, maybe because you’re on a conference call pretending to be listening and a coworker sent you a funny screenshot, maybe because you’re eavesdropping and trying to act like you’re minding your own business. Whatever the reason, I love watching people try not to laugh. I used to make a lot of jokes that were either so goofy or obscure that people rarely laughed, and I was happy with that. But after I signed my first new hire on the first team I managed, I noticed something — people started laughing at all my jokes. I was flummoxed. I hadn’t gotten funnier. My coworkers hadn’t become less stoic. A few weeks later, it hit me: it was because I had become more powerful. I’m still not sure exactly  why that mattered — I guess people cared more than ever about having a good relationship with me, so why not join in on the laughter if the joke was clever and harmless? At first, I was repelled — it seemed like a gross display of obsequiousness — even though I knew none of these people would admit (or probably even believe) they had changed their behavior. I realized later it wasn’t really (or, at least,  only) about sucking up. Power defines what’s normal — and suddenly my sense of humor had stumbled one tick toward the mainstream, just close enough to be something we could all laugh about at lunch.\n Power bends accountability. I’ve often been in departments where two people would perform the same problematic behavior, but only one person would regularly get called out for it. Sometimes it would be something obvious like merging PRs with no reviewer, and sometimes something more subtle like talking down to someone else in a meeting. One person would be confronted on the spot, while someone else might get away without a word. There are always justifications: “well, that person is a  senior software engineer,” or, “I didn’t think the behavior was bad enough to pick a fight about it.” But more often than not, I started to notice that the thing most strongly correlated to their treatment was their power on the team.     Of course, the effect is only as durable as that person’s power is; often, when that person stumbles and loses some perceived power, a mob with pitchforks suddenly appears around them. Invariably they are surprised. I could never explain it — both that they could be unaware of how others felt about their behavior, and that their critics suddenly all picked the same time to bring up their gripes. But power bends accountability. There are multiple factors here: few people want to give a powerful person unpleasant feedback, powerful people sometimes feel invincible and can get away with ignoring more criticism, and, most insidious of all, people sometimes make subtle adjustments to their understanding of cause, effect, and accountability to attribute positive outcomes to powerful people, and negative outcomes to less-powerful ones. Compare how we seem to be willing to give so many fresh chances to wealthy and powerful people who stumble due to their own bad choices, but we love to  hate on poor people for their problems despite all the obvious structural factors working against them. The same thing happens in companies.\n Power bends meaning. One of the greatest disorientations of newly acquired power is that it can change the meaning of everything you do and say. Where once you didn’t reply to the occasional Slack message because you were scatterbrained and busy, now it’s because you think you’re too important to be bothered.** Your behavior hasn’t changed at all, but all of a sudden people think you have a new personality. One example: a colleague was once promoted from being a member of a particular group to being its leader. A few weeks after the switch, I asked her to stop replying with “+1” to Slack messages in the group. In the past, this behavior had been a benign way to help the group build consensus. Now it had become a way to stifle debate and create new hierarchies within the group. She didn’t need to help build consensus anymore; as the leader of the group, her stated opinion was nearly enough to  be consensus. Tossing a +1 after someone else’s opinion went from putting a thumb on the scale to  standing on the scale, even though we were all typing the exact same things we had been a week before.\n Once I started watching for how newly-acquired power distorts the meanings of everything, I started seeing examples everywhere: it sometimes felt like my startup surroundings had the wavy hallucinatory quality of a mirage in the desert. To help organize my thoughts, I started abbreviating this phenomenon with a phrase:  power bends light.\n I thought I would need it mostly to deal fairly with the leaders on my team, and it helps there sometimes, but again and again, the person I continue to need it most for is myself. You often gain power from doing a good job, but power also makes you  feel like you are doing a good job — and it makes people around you less likely to tell you differently. When people tell me everything is great even though their faces say something else, when I apologize for something and they insist it was no big deal, when I suddenly get a raised eyebrow for doing something I’ve done 100 times before, I try to remember to ask myself, what’s my relationship to this person? Do I have power over them somehow? Is power bending light?", "posttime": "2020-05-09 08:31:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "折弯,bends", "title": "权力折弯灯光(2019)", "title_en": "Power Bends Light (2019)", "transed": 1, "url": "https://honkathon.com/2019-08-18-power-bends-light/", "via": "", "real_tags": ["折弯", "bends"]}]