[{"category": "", "categoryclass": "", "imagename": "1a19830f6e036521ead5ddbd6f25b2b6.png", "infoid": 1003259, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尼莱·帕特尔(Nilay Patel)在他的Apple Watch上问Siri这个问题。经过太长时间的等待，他得到了加拿大伦敦的正确答案 - 。我试了试我的iPhone，得到了同样的结果。愚蠢和迟钝是非常好的组合。\n你可以争辩说，把时间花在安大略省的伦敦市本身并没有错，但那是无稽之谈。如果你有一个人类助手，问他们“伦敦时间是几点？”他们真诚地认为，回答这个问题的最好方法是给你时间，让你有时间去最近的伦敦，恰好在安大略省或肯塔基州，你会解雇那个助理。你不会因为一个错误的答案而解雇他们，你会解雇他们，因为那个错误的答案象征着严重的认知缺陷，渗透到他们试图做的每一件事中。你从一开始就不会雇佣他们，真的，因为这么愚蠢的人是不可能通过工作面试的。你不必特别聪明或知识渊博就能假设“伦敦”的意思是“伦敦英格兰”，你只要不傻就行了。\n更糟糕的是，我试穿了我的HomePod，Siri给了我正确的答案：英国伦敦的时间。我说这更糟糕，是因为它说明了Siri是多么的不一致。为什么仅仅基于哪台设备回答了您的问题，您就会得到完全不同的答案呢？至少当大多数计算机系统出错时，它们总是出错的。\n我在我知道应该在哪里工作的所有其他系统上尝试了同样的问题：“伦敦现在几点？”", "note_en": "Nilay Patel asked this of Siri on his Apple Watch. After  too long of a wait, he got the correct answer — for London Canada. I tried on my iPhone and got the same result. Stupid  and slow is heck of a combination.\n You can argue that giving the time in London Ontario isn’t  wrong per se, but that’s nonsense. If you had a human assistant and asked them “What’s the time in London?” and they honestly thought the best way to answer that question was to give you the time for the  nearest London, which happened to be in Ontario or Kentucky, you’d fire that assistant. You wouldn’t fire them for getting that one answer wrong, you’d fire them because that one wrong answer is emblematic of a serious cognitive deficiency that permeates everything they try to do. You’d never have hired them in the first place, really, because there’s no way a person this stupid would get through a job interview. You don’t have to be particularly smart or knowledgeable to assume that “London” means “London England”, you just have to not be stupid.\n Worse, I tried on my HomePod and  Siri gave me the correct answer: the time in London England. I say this is worse because it exemplifies how inconsistent Siri is. Why in the world would you get a completely different answer to a very simple question based solely on which device answers your question? At least when most computer systems are wrong they’re consistently wrong.\n I tried the same question on every other system I know where it should work: “What time is it in London?”", "posttime": "2020-05-22 18:09:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "伦敦", "title": "Siri，伦敦现在几点了？", "title_en": "Siri, What Time Is It in London?", "transed": 1, "url": "https://daringfireball.net/linked/2020/05/22/what-time-is-it-in-london", "via": "", "real_tags": ["伦敦"]}, {"category": "", "categoryclass": "", "imagename": "1495aab360c50df60a96bfb42ef4aaca.jpg", "infoid": 1003258, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了扭转野生动物和栖息地的损失，欧盟委员会(EC)提出了一项大胆的新计划，包括额外种植30亿棵树，大幅扩大有机农业，并对未能达到恢复自然目标的人处以罚款。\n今天公布的生物多样性战略要求，到2030年，欧洲30%的陆地和海洋将成为保护区，而目前只有26%的陆地和11%的海洋，特别是严格保护古代森林。十年后，有机耕种的农地数量必须从现在的8%增长到四分之一。到2030年，杀虫剂的使用量应该减半，到那时，近三分之一的物种必须恢复有利的保护状态或正在改善。\n欧共体负责欧洲绿色协议的副主席弗朗斯·蒂默曼斯(Frans Timmermann)明确表示，该计划与避免未来的大流行(如冠状病毒危机)有关-这是保护栖息地和限制人类与某些物种互动的潜在好处。\n他说：“生物多样性策略对增强我们的适应力，以及防止人畜共患病等未来疾病的出现和传播至关重要。因为我们以前所未有的速度破坏自然，现在仅在几十年内就有大约100万个物种面临灭绝的危险，我们实际上威胁到了我们自己的生命、我们的健康和我们的福祉。“他在新闻发布会上表示。\n环保人士对这项计划表示欢迎，认为这是积极和强有力的，世界自然基金会欧洲分会的Sabien Leemans表示，这一雄心不同于过去五年在该委员会下看到的任何雄心。有些目标甚至比以前更雄心勃勃，比如到2030年将树木数量从去年的20亿棵升级到30亿棵。\n问题是：这个战略会奏效吗？欧洲过去在生物多样性计划上失败过，比如没有达到今年恢复至少15%退化生态系统的自愿目标。\n观察人士表示，虽然新战略在一些地方有一些含糊的措辞，比如欧盟如何避免将环境破坏外包给世界其他地区，但其支持者在很大程度上顶住了农业的游说，试图削弱这一战略。\n其力量的关键是雄心壮志的水平，加上新法律的承诺。最重要的想法之一是明年为恢复生态系统(如湿地)设定具有法律约束力的目标。“这可能会改变游戏规则，”比利时国际鸟类保护协会的阿里尔·布伦纳(Ariel Brunner)说。\n利曼斯说，立法的前景将给这些目标带来牙齿，但她指出，这些目标雄心勃勃和具体至关重要，比如定义必须恢复多少平方公里。\n布伦纳说，将杀虫剂使用量减半的目标虽然有些牵强，但却是必要的：“这是巨大的，但这是我们所需要的。”\n由100多个保护组织组成的自然运动(Campaign For Nature)的格奥尔格·施韦德(Georg Schwede)表示，有机农业的戏剧性扩张可能会发生，但前提是欧盟的农业补贴必须进行改革，为有机农业创造激励机制，并将化石燃料化肥等产品对环境的影响考虑在内。\n归根结底，该战略的成败将取决于委员会和各国如何实施这些计划。尽管该战略有几页关于治理框架，以确保进展受到严格检查，但目前对于成员国如果达不到目标将面临哪些可能的措施-如罚款-含糊其辞。“这完全取决于实施情况，”施韦德说。\n订阅我们的免费“修复地球”时事通讯，每月一期的气候乐观观点将直接发送到您的收件箱", "note_en": "To reverse the loss of wildlife and habitats, a bold new plan by the European Commission (EC) includes  planting 3 billion extra trees, dramatically expanding organic farming and fines for missing targets to restore nature.\n The  biodiversity strategy published today calls for 30 per cent of Europe’s land and seas to become a protected area by 2030, up from 26 per cent of land and 11 per cent of seas today, with strict protections for ancient forests in particular. The amount of agricultural land farmed organically must grow from 8 per cent today to a quarter in a decade’s time. Pesticide use should halve by 2030, by which point nearly a third of species must return to a favourable conservation status or be improving.\n Frans Timmermans, the EC’s vice-president for the European Green Deal, explicitly tied the plan to avoiding future pandemics like the covid-19 crisis – a potential benefit of protecting habitats and limiting human interaction with certain species.\n   “The biodiversity strategy is essential for boosting our resilience and preventing the emergence and spread of future diseases such as zoonoses. Because by destroying nature at an unprecedented rate, and now with around 1 million species at risk of extinction within only decades, we literally threaten our own life, our health and our well-being,” he told a press conference.\n Conservationists welcomed the plan as positive and strong, with Sabien Leemans at WWF Europe saying the ambition was unlike anything seen under the commission in the past five years. Some of the goals are even more ambitious than before, such as the number of trees being upgraded from talk last year of 2 billion, to 3 billion by 2030.\n  The question is: will the strategy work? Europe has failed in the past on biodiversity plans, such as falling short of a  voluntary target to restore at least 15 per cent of degraded ecosystems by this year.\n Observers say while the new strategy has some woolly phrasing in places, such as on how the European Union can avoid outsourcing environmental destruction to other parts of the world, its backers have largely withstood lobbying from the farming industry to weaken it.\n Key to its strength are the levels of ambition, coupled with the promise of new laws. One of the most significant ideas is to set legally binding targets next year for  restoring ecosystems, such as wetlands. “That’s potentially a game changer,” says Ariel Brunner at Birdlife International in Belgium.\n  Leemans says the prospect of legislation would give the targets teeth, but she notes it is vital they are ambitious and concrete, such as defining how many square kilometres must be restored.\n The goal of halving pesticide use will be a stretch, but is necessary, says Brunner:  “It’s huge, but it’s what is needed.”\n Georg Schwede at the Campaign for Nature, a coalition of more than 100 conservation groups, says the dramatic expansion in organic farming could happen, but only if EU agricultural subsidies are reformed to create incentives for it, and to factor in the environmental impacts of products such as fossil-fuel-based fertilisers.\n Ultimately, the success or failure of the strategy will depend on how the commission and countries implement the plans. While the strategy has several pages on a governance framework to make sure progress is closely checked, it is currently vague on what possible measures – such as fines – member states face if they miss goals. “It all hinges on implementation,” says Schwede.\n Sign up to our free  Fix the Planet newsletter to get a monthly dose of climate optimism delivered straight to your inbox", "posttime": "2020-05-22 18:08:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "计划,plans,目标", "title": "欧盟计划种植3B树并扩大有机农业", "title_en": "EU plans to plant 3B trees and expand organic farming", "transed": 1, "url": "https://www.newscientist.com/article/2244115-eu-plans-to-plant-3-billion-trees-and-massively-expand-organic-farming/", "via": "", "real_tags": ["计划", "plans", "目标"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003257, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "定于下个月在Linux5.8内核周期中合并的补丁只需删除10行代码(好吧，6行代码和4行注释)就可以为某些系统带来显著的节能效果，这是因为内核代码中的一个疏忽已经持续了大约12年。作为PCI-Next更改的一部分，为Linux5.8构建的队列允许在PCI Express到PCI/PCI-X网桥的链路上进行活动状态电源管理(ASPM)。正如我们多年来在调查Linux ASPM问题时所看到的(从2011年开始的大功率倒退等)，在正确工作的情况下可以节省相当多的电量。但是到目前为止，事实证明PCIe到PCI(和PCI-X)桥还没有让Linux内核在这些链路上启用ASPM，从而可以使CPU保持在比其他情况下可能实现的更高的功率状态。同时，Windows确实为PCIe到PCI/PCI-X网桥启用了PCIe ASPM。在启用ASPM的补丁中，由于一些未记录的原因，ASPM代码在2008年合并回Linux内核，禁用了PCI网桥的ASPM。现在到了2020年，这个代码只是被删除了。此补丁只需删除检查下游组件是否为PCI网桥的几行代码，进而禁用ASPM。该补丁指出，在指向该补丁的链接上启用ASPM允许英特尔SoC进入更深的封装C状态，这是一项显著的节能措施。在本月早些时候一位Canonical内核工程师的错误报告之后，最初的补丁还引用了大量不必要的功耗。删除内核中12年来一直被忽视的几行代码的影响。因此，如果您的系统具有PCI Express到PCI桥，就像在许多服务器/工作站主板上可以找到的那样，请在Linux5.8中查找此补丁，并且很可能会被重新移植到稳定分支。", "note_en": "A patch slated to be merged for the  Linux 5.8 kernel cycle next month that simply deletes ten lines of code (well, six lines of code and four lines of comments) will for some systems yield &#34;significant power savings&#34; due to an oversight in the kernel code that has lasted for about twelve years.\r   Queued as part of the PCI-next changes building up for Linux 5.8 is allowing Active State Power Management (ASPM) on links for PCI Express to PCI/PCI-X bridges. As we&#39;ve seen when investigating Linux  ASPM issues over the years ( that big power regression from 2011, et al), the power savings can be quite dramatic when correctly working. But up to now it turns out PCIe-to-PCI (and PCI-X) bridges have not had the Linux kernel enable ASPM on those links and could in turn keep the CPU in higher power states than otherwise could have been achievable.\r    Windows meanwhile does enable PCIe ASPM for PCIe-to-PCI/PCI-X bridges. In the patch enabling it, for &#34;some undocumented reason&#34;, the ASPM code merged back into the Linux kernel in 2008 disabled ASPM for PCI bridges. Now in 2020, that code is simply being deleted.\r     This patch simply deletes the few lines of code checking to see if the downstream component is a PCI bridge and in turn disables ASPM. The patch noted, &#34; Enabling ASPM on the link leading to it allows the Intel SoC to enter deeper Package C-states, which is a significant power savings.&#34; The  original patch also cited &#34;lots of unnecessary power&#34; following  a bug report from earlier this month by a Canonical kernel engineer... The impact of deleting a few lines of code that have been overlooked in the kernel for 12 years.\r   So should your system(s) have a PCI Express to PCI bridge like can be found on many server/workstation motherboards and more, look for this patch in Linux 5.8 and quite likely to be back-ported to the stable branches.", "posttime": "2020-05-22 17:35:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,代码,lines,aspm", "title": "删除几行代码可以在Linux上实现“显著”节能", "title_en": "Deleting a Few Lines of Code Can Yield “Significant” Power Savings on Linux", "transed": 1, "url": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.8-ASPM-PCIe-PCI-PCI-X", "via": "", "real_tags": ["linux", "代码", "lines", "aspm"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003256, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为一名FreeBSD开发人员，我总是尽可能地使用FreeBSD--包括在桌面上。自2004年以来，我一直在笔记本电脑上运行FreeBSD；这并不总是那么容易，但这些年来，我发现情况总体上在改善。然而，我们仍然缺乏足够的文档-所以我写这篇文章是为了给用户提供一个例子，也是为了给Google诱饵提供一个例子，以防有人遇到我必须解决的一些问题。几个月前，在我的System76 Galago Pro经历了二次体验，出现了一个死气沉沉的/肿胀的小酒馆后，我决定是时候更换它了。2月15日，我订购了一台Dell Latitude 7390。这是一款较老的笔记本电脑--最初于2018年推出--但我一直发现戴尔Latitude的质量很好，而且这款笔记本的价格非常诱人：戴尔加拿大公司将其售价定为1049加元(750美元)，而不是3599加元(2600美元)的原价。我只能假设这是他们最后的存货，他们想清空那条生产线。笔记本电脑随附：笔记本电脑在3月6日到货，我做了几项升级：我用英特尔660p 512 GB NVMe硬盘(94加元)取代了256 GB的固态硬盘。\n除了给我双倍的磁盘空间，升级磁盘还允许我保持Windows安装的完好无损，以防我想让这台笔记本电脑在运行Windows时重新投入使用。在这些升级之后，我并没有我理想的笔记本电脑--我会更喜欢32 GB的RAM(戴尔的规格说明这款笔记本电脑最多支持16 GB)、第二块磁盘(理论上WWAN插槽可以容纳一个M.2 2242 NVMe磁盘，但网上的评论显示戴尔BIOS不允许在该插槽中安装固态硬盘)和TrackStick-但我支付的价格实际上可以&。我用我的旧笔记本电脑从最新的FreeBSD 12.1-STABL周快照下载了&#34；Memtick&34；图像，并将其写入U盘。通常情况下，我会使用版本映像(这也会让后面的一些步骤变得更容易)，但我最近做的一些更改和支持I2C触摸板所需的一些代码都不在上一个版本中。(如果您几个月后再阅读本文，请使用12.2或更高版本，而不是12-稳定分支。)。要从Dell Latitude 7390上的U盘启动，我需要在开机时按F12键才能进入启动盘选择菜单。安装FreeBSD对我来说很容易，因为我过去已经做过很多次了；但我确实更改了几个默认值：在选择要安装FreeBSD的哪些部分时，我包括了发行版。通常我不会这么做，但是我需要FreeBSD源代码来构建一些内核模块。\n在配置ZFS时，我打开了全磁盘加密(就像我最近在所有笔记本电脑上所做的那样)。\n我将交换空间从2 GB(默认)增加到16 GB。我希望这个系统永远不需要使用交换空间--但是如果它的16G的RAM还不够，那么2 GB的交换空间也不太可能有足够的帮助。\n我关闭了sshd-我不打算远程连接到这台台式机-并打开了ntpd和powerd-我希望时钟保持准确，我想通过在CPU没有负载时放慢运行速度来节省电能。(稍后可以通过/etc/rc.conf启用或禁用它们，但是安装程序提供了它们，所以我想我也可以在这里这样做。)。\n在系统强化屏幕中，我启用了clear_tmp、Disable_syslogd和DISABLE_Sendmail选项-前两个选项只是原则上的，而Sendmail是我不想要和不想要的(我改用qmail)。我没有启用任何其他的强化选项，因为它们没有任何显著的好处，但是我发现它们的移动功能很有用。\n在创建我的用户帐户时，我将该帐户添加到了轮盘和视频组。前者是必需的，这样我才能通过su变成root用户；后者是应用程序访问加速视频功能所必需的。(如果您忘记了这些，您可以以root身份登录，稍后再添加它们，但这很麻烦-我在这里提到它们是因为我在很多情况下都需要这样做。)。\n安装完成后，我要求安装程序重新启动系统并取出U盘。我做的第一件事是关闭恼人的大声控制台哔声：然后我告诉FreeBSD使用&#34；链路聚合&34；网络，故障自动从有线以太网(如果连接)切换到WiFinetwork#sysrc WLANS_iwm0=&#34；wlan0&#34；#sysrc ifconfig_wlan0=&#34；#sysrc ifconfig_em0=&。滞后proto故障转移滞后端口em0滞后端口wlan0 DHCP&#34；\n通过/etc/wpa_Supplicant.conf提供了我的WiFi网络凭据，并启动了网络(服务netif重新启动)。我想要一个防火墙，所以我用一个非常简单的配置启用了FreeBSD的PF：#echo&#34；&gt；/etc/pf.conf#echo&#34；在lo0&#34；&gt；&gt；/etc/pf.conf#echo&34；/etc/pf.conf；/etc/pf.conf#sysrc PF_enable=&上设置跳过#34；&gt；&gt；/etc/pf.conf#sysrc PF_enable=&。\n现在最烦人的部分是：因为我运行的是12.1-稳定版，而不是12.1-Release版(由于前面提到的补丁和最近添加的对I2C触摸板的支持)，我不能完全依赖FreeBSDProject构建的软件包。相反，我需要通过端口树构建两个内核模块包-drm-kmod和iichid。这意味着：并锁定这些软件包，以确保它们不会自动升级到FreeBSD 12.1-Release：\n如果我能够安装12.2-Release(在我撰写本文时它还不存在)，那么这些步骤只需pkg install iichid DRM-KMOD即可。现在我已经准备好了这些软件包，我可以下载运行基本GUI所需的其他Onesi：然后进行一些基本配置来打开GUI：此时，我可以重新引导并观看我的笔记本电脑引导到GUI，在GUI中我以cpercia身份登录，打开一个控制台(Ctrl-Alt-T)，然后使用su变成root，这样我就可以进行更多的配置。Dell Latitude 7390上的BIOS将扬声器和耳机插孔配置为独立的音频输出。这不是我想要的-我想让声音在默认情况下转到扬声器，但如果我插入耳机，就会切换到耳机插孔并自动将扬声器静音。为此，我告诉FreeBSD，耳机(这台笔记本电脑上的NID33)与扬声器属于同一音频设备(AS=1)，但应该使用静音和切换到耳机的行为(顺序=15)：说到音频，HDMI中有一个错误。地址2&34；上的命令超时)被记录到内核控制台。EdMaste一直致力于修复潜在的问题，但他提供了一个解决方法，让我可以让警告保持沉默：我喜欢的(KDE)环境不是#39；我不太需要D-BUS，但它需要的一个地方是允许GUI工具看到电池状态并与电源管理交互：CPU错误通常通过微码补丁得到修复，所以我想拥有这些：我希望我的笔记本电脑引导更快-这意味着如果我想要更改引导方式，不需要让引导加载器等待10秒，也不需要FreeBSD内核在挂载根文件系统之前等待USB设备(我知道我的根文件系统在NVMe磁盘上)：如上所述，在挂载根文件系统(我知道我的根文件系统在NVMe磁盘上)之前，FreeBSD内核不需要等待USB设备(我知道我的根文件系统在NVMe磁盘上)：我还使用spiped通过隧道将电子邮件发送到邮件服务器和从邮件服务器发送：#pkg install netqmail ucspi-tcp spiped#echo`hostname`&gt；/var/qmail/control/me#echo&#34；：127.0.0.1：8025&#34；&gt；/var/qmail/control/smtprouts#rm/var/qmail/alias/.qmail-*#echo cpercia&gt；/var/qmail。yes&#34；#sysrc qmailsmtpd_enable=&#34；yes&#34；#sysrc qmailsmtpd_host=&#34；127.0.0.1&#34；#echo&#34；127.0.0.1：允许&#34；&gt；/etc/tcp.smtp#sysrc spiped_enable=&#34；yes&#34；#sysrc spiped_Pipes=&#34；smtp。[127.0.0.1]：8025and#34；#sysrc spiped_pipe_SMTP_target=&#34；mail.tarsnap.com:8025&#34；#sysrc spiped_pipe_SMTP_key=&#34；/etc/spiped/smtp.key&#34；#sysrc spiped_PIPE_POP3_MODE=&#34；CLIENT&#34；#sysrc spiped_pipe_POP3_source=&#34；[127.0.0.1]：110&#34；#sysrc spiped_PIPE_POP3_TARGET=&#34；mail.tarsnap.com：#sysrc spiped_pipe_POP3_key=&#34；/etc/spiped/pop3.key&#34；\n最后，虽然已经安装了网络摄像头守护进程(kde5软件包将其作为依赖项引入)，但我希望启用它，并希望cpercia用户能够访问它：此时，我已经有了一个功能齐全的桌面环境，但它并没有按照我想要的方式进行设置。我不喜欢默认的KDE墙纸，所以我安装了新的墙纸并告诉KDE使用它(右键单击桌面；#34；配置桌面向下滚动并选择正确的墙纸)。我希望能够从kde中打印，所以我启用了CUPS(它已经作为kde依赖项安装)并启动了它(因为我想在不重启的情况下使用它，所以是必要的)：然后告诉kde我的打印机(&#34；系统设置&#34；-&gt；&34；打印机&#34；-&gt；&#34；AddPrinter&#34；AddPrinter&#34；http://192.168.1.60:631/ipp的手动URI和GenericPostScript打印机驱动程序)。我希望能够控制屏幕的亮度(又名。连接到英特尔视频芯片组的背光)：尤其是能够通过戴尔通过ACPI展示的功能键(Fn+Up、Fn+Down)进行控制\n一旦我确定我需要12.1稳定版(并确认通过适当编译的软件包，视频和触摸板都可以工作)，我决定从12.1稳定版的ISO重新安装。我下载了Memtick的ISO，然后.。它已经腐烂了。或者更确切地说，被截断了；我猜那一周的快照镜像出了什么问题。\n我想，不要紧，我可以使用迷你备忘录ISO来代替；这会在安装时下载您想要的FreeBSD部分，而不是将它们全部包含在ISO中。这个没有损坏--但是当安装程序下载我想要安装的部分时，它无法识别我的WiFi网络。幸运的是，这只是一件小事：我把笔记本电脑插入有线网络，一切都很正常。\n有一次(我记不清是哪一次)我试图安装铬包，结果发现没有可用的包：那一周FreeBSD包构建集群中的构建失败了，因为不断增长的构建刚刚超过24小时限制，包构建者认为它一定是卡住了。我向FreeBSD端口经理团队报告了这一情况，他们提高了Chrome的时间限制，以便它可以成功构建-但与此同时，它的构建失败了，因为不断增长的构建刚刚超过了24小时的限制，而包构建者认为它肯定是卡住了。我向FreeBSD端口经理团队报告了这一情况，他们提高了Chrome的时间限制，以便它可以成功构建-但在平均时间内。\n在我开始使用这台笔记本电脑之前，背光控制键会调整ACPI_VIDEO对亮度的概念，而英特尔背光工具可以调整实际亮度，但两者之间没有任何联系；我必须向FreeBSD内核添加代码以通过devd显示亮度变化，并编写必要的配置文件(acpi-video-intel-backlight.conf)来调用英特尔背光进行必要的更改。在此之前，我必须通过devd向FreeBSD内核添加代码以显示亮度变化，并编写必要的配置文件(acpi-video-intel-backlight.conf)来调用英特尔背光进行必要的更改。\n当我第一次将LAGG接口设置为在有线和无线网络之间自动切换FreeBSD时，我发现我需要通过加载器加载WiFi驱动程序(和固件)内核模块。与通过最近添加的devMatch工具自动加载它们不同：如果我依赖devMatch，则FreeBSD的启动脚本将在加载wifi驱动程序之前尝试创建链路聚合接口，并且(毫不奇怪)无法聚合网络。t存在。对devmatch rc.d脚本的一行修复在引导过程中较早地移动了它，并使两个loader.conf行变得不必要。\n最后，也是最令人困惑的是，我一度发现插上或拔下交流电源会导致笔记本电脑进入睡眠状态(S3挂起)。事实证明，这是由于ACPI、upowerd和KDE的电源管理选项之间的交互作用：如果在系统处于睡眠状态时打开笔记本电脑盖，则ACPI不会发送通知，导致upowerd认为笔记本电脑盖仍处于关闭状态。当KDE收到交流电源状态改变的消息时，它检查了所有与电源管理相关的状态，发现盖子是关闭的，并决定它应该进入睡眠状态。最后，我只需要对FreeBSD的ACPI代码进行一行修复，但是花了三天时间才找到这一行！\nFreeBSD为桌面做好准备了吗？是也不是。是的，因为我有一台Verynice FreeBSD笔记本电脑，一切都可以按照我想要的方式工作。但事实并非如此，我在业余时间花了两个月的时间摆弄这些东西，才修复了一些出现的小故障；虽然没有什么特别具有挑战性的问题，但我预计，大多数人在解决我遇到的所有问题之前，早就会放弃了。另一方面，FreeBSD能为桌面做好准备吗？绝对可以。我已经修复了我遇到的问题-一旦我们有了FreeBSD 12.2版本，以及为该版本构建的包，启动GUI的过程也会容易得多。FreeBSD最需要的是让开发人员购买笔记本电脑，并仔细解决出现的问题；FreeBSD基金会已经开始这样做了，我希望在接下来的几个月里，他们-以及其他FreeBSD用户-将发布报告，告诉我们哪些笔记本电脑可以工作，他们需要什么配置。", "note_en": "As a FreeBSD developer, I make a point of using FreeBSD whenever I can— including on the desktop. I&#39;ve been running FreeBSD on laptopssince 2004; this hasn&#39;t always been easy, but over the years I&#39;ve foundthat the situation has generally been improving. One of the thingswe still lack is adequate documentation, however — so I&#39;m writingthis to provide an example for users and also Google bait in caseanyone runs into some of the problems I had to address. A few months ago, after my System76 Galago Pro had its  secondexperience with a dead/swelling batery, I decided that it was time toreplace it. On February 15th, I ordered a Dell Latitude 7390. This is an older model of laptop — it originally launched in2018 — but I&#39;ve always found that Dell Latitudes are well built,and this one came with a very attractive price tag: Rather than theoriginal price of $3599 CAD ($2600 USD), Dell Canada was selling itfor $1049 CAD ($750 USD). I can only assume that it was the last oftheir stock and they wanted to clear out that production line. The laptop came with:  The laptop arrived on March 6th, and I made a couple upgrades: I replaced the 256 GB SSD with an Intel 660p 512 GB NVMe disk ($94 CAD).\nIn addition to giving me double the disk space, upgrading the disk allowedme to keep the Windows installation intact in case I ever want to put thislaptop back into use running Windows. After these upgrades, I didn&#39;t quite have my ideal laptop — I wouldhave preferred 32 GB of RAM (Dell&#39;s specifications state that this laptopsupports a maximum of 16 GB), a second disk (theoretically the &#34;WWAN&#34;PCIe slot can hold an M.2 2242 NVMe disk, but comments online suggest thatthe Dell BIOS doesn&#39;t allow SSDs in that slot) and a TrackStick —but for what I paid I really can&#39;t complain. I downloaded the &#34;memstick&#34; image from the latest FreeBSD 12.1-STABLEweekly snapshot using my old laptop and wrote it to a USB Disk. NormallyI would use a RELEASE image (which would make some later steps easier too)but a few recent changes I had made and some of the code needed to supportthe I2C touchpad weren&#39;t in the last release. (If you&#39;re reading this afew months into the future, use 12.2 or a later release instead of the12-STABLE branch.) To boot from a USB stick on the Dell Latitude 7390, I needed to press F12when I turned the system on to enter the boot disk selection menu. Installing FreeBSD was easy for me, as I&#39;ve done it many times in thepast; but I did change several defaults: When selecting which parts of FreeBSD to install, I included the&#34;src&#34; distribution. Normally I wouldn&#39;t do this; but I needed theFreeBSD source code for building some kernel modules later.\n When configuring ZFS, I turned on full disk encryption (as I have done onall of my laptops recently).\n I increased the swap space from 2 GB (the default) to 16 GB. I hopethat this system never needs to use swap space — but if its 16 GBof RAM isn&#39;t enough, it&#39;s unlikely that 2 GB of swap space would beenough to help either.\n I turned off  sshd — I don&#39;t intend to connect to thislaptop remotely — and turned on  ntpd and  powerd— I want the clock kept accurate, and I want to save power byrunning the CPU slower when it&#39;s not under load. (These can be enabledor disabled via  /etc/rc.conf later, but the installer offersthem so I figured I might as well do it here.)\n From the &#34;system hardening&#34; screen, I enabled the  clear_tmp, disable_syslogd, and  disable_sendmail options —the first two are just on principle, while Sendmail is something I don&#39;tuse and don&#39;t want (I use qmail instead). I don&#39;t enable any of the other&#34;hardening&#34; options since they don&#39;t have any significant benefit butremove functionality which I find useful.\n When creating my &#34;cperciva&#34; user account, I added the account to the wheel and  video groups. The former is necessary so thatI can  su to root; the latter is necessary for applications toaccess accelerated video functionality. (If you forget these, you can login as root and add them later, but it&#39;s a nuisance — and I mentionthem here because I have on numerous occasions needed to do exactly that.)\nAfter the installation completes, I asked the installer to reboot the systemand removed the USB disk. The first thing I did was to turn off the annoyingly loud console beep: and then I told FreeBSD to use &#34;link aggregation&#34; networking, failingover automatically from the wired ethernet (if connected) to the WiFinetwork # sysrc wlans_iwm0=&#34;wlan0&#34;# sysrc ifconfig_wlan0=&#34;WPA&#34;# sysrc ifconfig_em0=&#34;ether MY:WI:FI:MAC:ADD:RESS&#34;# sysrc cloned_interfaces=&#34;lagg0&#34;# sysrc ifconfig_lagg0=&#34;laggproto failover laggport em0 laggport wlan0 DHCP&#34;\nprovided my WiFi network credentials via  /etc/wpa_supplicant.conf and started the network ( service netif restart). I want a firewall,so I enabled FreeBSD&#39;s  pf with a very simple configuration: # echo &#34;block in all&#34; &gt; /etc/pf.conf# echo &#34;set skip on lo0&#34; &gt;&gt; /etc/pf.conf# echo &#34;pass out all keep state&#34; &gt;&gt; /etc/pf.conf# sysrc pf_enable=&#34;YES&#34;# service pf start\n Now for the most annoying part: Because I&#39;m running 12.1-STABLE rather than12.1-RELEASE (due to the aforementioned patches and recently added support fothe I2C touchpad) I couldn&#39;t rely completely on packages built by the FreeBSDProject. Instead, I needed to build two packages of kernel modules — drm-kmod and  iichid — via the ports tree. This meant: And locking those packages to ensure that they won&#39;t be &#34;upgraded&#34;automatically to versions compiled on FreeBSD 12.1-RELEASE:\nIf I had been able to install 12.2-RELEASE (which does not exist yet atthe time I am writing this), those steps would simply have been pkg install iichid drm-kmod. Now that I had those packages in place, I could download the other onesI needed to get a basic GUI running:  And then do some basic configuration to turn on the GUI: At this point I could reboot and watch my laptop boot into a GUI where Ilogged in as  cperciva, opened a console (Ctrl-Alt-T), and used su to become root so I could do more configuration. The BIOS on the Dell Latitude 7390 configures the speakers and headphonejack as being independent audio outputs. This isn&#39;t what I want —I want to have sound go to the speakers by default but switch to theheadphone jack and mute the speakers automatically if I plug in headphones.To do this, I told FreeBSD that the headphones (which are  nid33on this laptop) are part of the same audio set ( as=1) as thespeakers but should use mute-and-switch-to-headphones behaviour( seq=15): Speaking of audio, there&#39;s a bug in the HDMI codec which results inannoying warnings (&#34;Unexpected unsolicited response with tag 63&#34; and&#34;Command timeout on address 2&#34;) being logged to the kernel console. EdMaste has been working on fixing the underlying issues, but he provided aworkaround which let me silence the warnings: My preferred (KDE) environment doesn&#39;t need D-Bus for much, but one place itis needed is to allow the GUI tools to see the battery state and interact withpower management: CPU bugs often get fixed via microcode patches, so I want to have those: I want my laptop to boot faster — which means not having the bootloader wait 10 seconds in case I want to change how I boot, and nothaving the FreeBSD kernel wait for USB devices before mounting the rootfilesystem (I know that my root filesystem is on the NVMe disk): As mentioned above, I like to use qmail rather than sendmail; I also use spiped to tunnel emailto and from my mail server: # pkg install netqmail ucspi-tcp spiped# echo `hostname` &gt; /var/qmail/control/me# echo &#34;:127.0.0.1:8025&#34; &gt; /var/qmail/control/smtproutes# rm /var/qmail/alias/.qmail-*# echo cperciva &gt; /var/qmail/alias/.qmail-default# cp /var/qmail/doc/mailer.conf.sample /etc/mail/mailer.conf# sysrc qmailsend_enable=&#34;YES&#34;# sysrc qmailsmtpd_enable=&#34;YES&#34;# sysrc qmailsmtpd_host=&#34;127.0.0.1&#34;# echo &#34;127.0.0.1:allow&#34; &gt; /etc/tcp.smtp# sysrc spiped_enable=&#34;YES&#34;# sysrc spiped_pipes=&#34;SMTP POP3&#34;# sysrc spiped_pipe_SMTP_mode=&#34;client&#34;# sysrc spiped_pipe_SMTP_source=&#34;[127.0.0.1]:8025&#34;# sysrc spiped_pipe_SMTP_target=&#34;mail.tarsnap.com:8025&#34;# sysrc spiped_pipe_SMTP_key=&#34;/etc/spiped/smtp.key&#34;# sysrc spiped_pipe_POP3_mode=&#34;client&#34;# sysrc spiped_pipe_POP3_source=&#34;[127.0.0.1]:110&#34;# sysrc spiped_pipe_POP3_target=&#34;mail.tarsnap.com:8110&#34;# sysrc spiped_pipe_POP3_key=&#34;/etc/spiped/pop3.key&#34;\nAnd finally while the webcam daemon is installed already (the  kde5package pulls it in as a dependency) I want it to be enabled and I want the cperciva user to be able to access it:  At this point I had a fully functional desktop environment, but it wasn&#39;tset up exactly how I wanted. I don&#39;t like the default KDE wallpaper, so Iinstalled new wallpaper and told KDE to use it (right click on desktop; &#34;Configure Desktop&#34;; scrolldown and select the right wallpaper). I want to be able to print from within KDE, so I enabled CUPS (which wasalready installed as a KDE dependency) and started it (necessary since Iwanted to use it without rebooting): and then told KDE about my printer (&#34;System Settings&#34; -&gt; &#34;Printers&#34; -&gt; &#34;AddPrinter&#34;; manual URI of  http://192.168.1.60:631/ipp and the GenericPostScript Printer driver). I want to be able to control the brightness of the screen (aka. thebacklight connected to the Intel video chipset): and in particular to be able to control it via the function keys (Fn+Up,Fn+Down) which Dell exposes via ACPI:  There&#39;s a long list of software I want to be able to use (or insome cases, would prefer to avoid, but need nonetheless): # pkg install firefox libreoffice thunderbird chromium# pkg install nano konversation# pkg install xournal ImageMagick7 pdftk# pkg install texlive-full# pkg install git subversion diffstat portlint sloccount# pkg install autoconf autoconf-archive automake libtool# pkg install base64 wkhtmltopdf# pkg install tarsnap\n And finally I want to perform hourly backups to Tarsnap — but in the background,and not spinning up the CPU to perform them: # echo &#39;47 * * * * root nice /usr/local/bin/tarsnap -c --keyfile /root/tarsnap.key -f `date +\\%Y-\\%m-\\%d:\\%H` /root /etc /usr/local/etc /usr/home&#39; &gt; /etc/cron.d/tarsnap# sysrc powerd_flags=&#34;-N&#34;\n Like most desktop environments, KDE has a myriad settings which can beadjusted, and I change many to match my personal taste, ranging fromthe Application Launcher (I prefer the &#34;menu&#34; version) to the keyboardshortcuts for changing desktops (I use Meta+Tab for this, since I don&#39;tmake use of KDE &#34;Activities&#34;). The one particularly noteworthy option I set is to tell KDE to &#34;Sleep&#34;when the laptop lid is closed; in combination with the (default) settingto lock the screen when sleeping, this gives me a convenient way to&#34;put the laptop away&#34; when I don&#39;t want to shut it down completely.(Note however that it is unable to &#34;Hibernate&#34; since FreeBSD does nothave the necessary support for Suspend-to-Disk.) So where are we at now? Here&#39;s a short summary: Battery: 8-12 hours under typical use depending on backlight brightness; 2 hours of  buidworld -j8.\n After the above installation and configuration — which took 75minutes, mostly spent downloading 4 GB worth of packages — there&#39;sjust one things left to do: Copy all my data across from my old laptop. While the above installation and configuration process all worked inthe end, it wasn&#39;t nearly as smooth the first time — or the secondtime, or the third time. Some of the issues I ran into: The first time I installed FreeBSD, I installed FreeBSD 12.1-RELEASE. Thiscaused problems for the touchpad — it was very unresponsive and thepointer often &#34;lagged&#34; up to half a second behind — because therelease didn&#39;t have some I2C code which was later added in 12.1-STABLE.\n After upgrading the system to 12.1-STABLE, I found that the video driverdidn&#39;t work. While FreeBSD aims to maintain compatibility in &#34;stable&#34;branches, occasionally issues slip in — and one such issue arosein the 12-STABLE branch making the  drm-kmod package built on12.1-RELEASE incompatible with the 12.1-STABLE kernel.\n Once I determined that I needed 12.1-STABLE (and confirmed that withappropriately compiled packages, both video and touchpad worked) Idecided to reinstall from a 12.1-STABLE ISO. I downloaded the &#34;memstick&#34;ISO, and... it was corrupted. Or rather, truncated; I guess somethingbroke with the mirroring of that week&#39;s snapshots.\n No matter, I thought; I can use the &#34;mini-memstick&#34; ISO instead; thisdownloads the parts of FreeBSD you want at install time rather thanincluding them all on the ISO. This one wasn&#39;t corrupted — butwhen the installer got to downloading the bits I wanted to install, itcouldn&#39;t recognize my WiFi network. Fortunately this was only a minorannoyance: I plugged my laptop into my wired network and everythingwas fine.\n One of the times (I can&#39;t remember which) I tried to install the chromium package, it turned out that there wasn&#39;t a packageavailable: That week&#39;s build in the FreeBSD package-building clusterfailed because the ever-growing build had just crossed the 24 hourlimit and the package builder decided that it must have gotten stuck.I reported this to the FreeBSD ports manager team and they increasedchromium&#39;s time limit so that it could build successfully — butin the mean time I had to build the port myself (which took about sixhours on my laptop).\n Before I started working on this laptop, the backlight control keyswould adjust  acpi_video&#39;s notion of what the brightness shouldbe, and the  intel-backlight tool was able to adjust the actualbrightness, but there was no connection between the two; I had to add codeto the FreeBSD kernel to expose brightness changes via devd and wrote thenecessary configuration file ( acpi-video-intel-backlight.conf)to invoke  intel-backlight to make the necessary changes.\n When I first set up the  lagg interface to have FreeBSD switchautomatically between wired and wireless networks, I found that I neededto load the WiFi driver (and firmware) kernel modules via  loader.confrather than having them loaded automatically by the recently-added &#34;devmatch&#34;tool: If I relied on devmatch, then FreeBSD&#39;s startup scripts would try tocreate the link aggregation interface before the wifi driver was loaded, and(unsurprisingly) fail to aggregate a network interface which didn&#39;t exist.A one-line fix to the devmatch rc.d script moved it earlier in the bootprocess and made two  loader.conf lines unnecessary.\n Finally — and most confusingly — I found at one point thatplugging or unplugging AC power would result in the laptop going to sleep(S3 Suspend). This turned out to be due to an interaction between ACPI,upowerd, and KDE&#39;s power management options: ACPI was not sending anotification if the laptop lid was opened while the system was asleep,resulting in upowerd thinking that the lid was still closed... and whenKDE got a message about the AC power status changing, it checked all ofthe statuses related to power management, found that the lid was &#34;closed&#34;,and decided that it should go to sleep. In the end, all I needed was aone-line fix to FreeBSD&#39;s ACPI code, but it took three days to find thatone line!\n Is FreeBSD ready for the desktop? Yes and no. Yes, in that I have a verynice FreeBSD laptop where everything works the way I want. But no, in thatit took me two months worth of fiddling with this in my spare time to fixsome of the &#34;glitches&#34; which arose; while there wasn&#39;t anything particularlychallenging, I expect that most people would give up long before they fixedall of the issues I ran into. On the other hand,  can FreeBSD be ready for the desktop?Absolutely. I&#39;ve fixed the issues I ran into — and once we haveFreeBSD 12.2-RELEASE with packages built for that release the process ofbringing up a GUI will be much easier, as well. The biggest thing FreeBSDneeds is to have developers acquiring laptops and carefully working theirway through the issues which arise; the FreeBSD Foundation hasalready started doing this, and I hope in the months to come they —and other FreeBSD users — will publish reports telling us whichlaptops work and what configuration they need.", "posttime": "2020-05-22 17:34:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电脑,freebsd,laptop", "title": "我的新FreeBSD笔记本电脑：Dell Latitude 7390", "title_en": "My New FreeBSD Laptop: Dell Latitude 7390", "transed": 1, "url": "http://www.daemonology.net/blog/2020-05-22-my-new-FreeBSD-laptop-Dell-7390.html", "via": "", "real_tags": ["电脑", "freebsd", "laptop"]}, {"category": "", "categoryclass": "", "imagename": "620a0ad270fca4cad8ca8772f9d7e6bd.jpg", "infoid": 1003255, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "波尔·拉斐尔！今年，也就是他逝世五百周年，本应是他光荣的一年。在2018年米开朗基罗和2019年莱昂纳多·达芬奇的大型展览之后，博物馆界正在庆祝这位光荣的文艺复兴时期艺术三位一体的第三位成员。然后，对新冠状病毒的恐惧迫使各地的博物馆取下横幅，驱赶游客，关闭大门。讲座和会议，取消了！华盛顿国家美术馆的“拉斐尔和他的圈子”闭幕了！巴黎郊外孔戴博物馆的“拉斐尔：老师和他的学生”闭馆了！一旦恐慌过去，他们会重新开张吗？没人知道。至少，罗马奎里纳莱美术馆(Scuderie Del Quirinale)目前关闭的“拉斐尔”(Raffaello)已经宣布计划于6月2日重新开放。最后一个被标榜为有史以来规模最大的拉斐尔展览，展出了200多件杰作，其中包括拉斐尔本人的100幅油画和素描，由乌菲齐、卢浮宫、普拉多和伦敦国家美术馆等出借。人们希望理性能及时重返王位，让伦敦国家美术馆(National Gallery)在10月份开门，这将是今年第二大展览。\n拉斐尔成就的庆祝活动被一种致命的病毒打断，这是一种悲剧性的巧合，或者可能是诗意的不公正。1520年4月6日，一场席卷教皇宫廷的病毒性肺炎夺去了拉斐尔本人的生命，享年37岁。传记作者告诉我们，这位劳累过度、筋疲力尽的艺术家被一场壮观的壮举带走了。他最大的赞助人，美第奇教皇利奥十世，一年半后突然死于肺炎，享年46岁。在文艺复兴时期的罗马，艺术家和赞助人之间最富有成效的合作伙伴关系持续了七年多一点。其中的受害者包括拉斐尔的建筑师生涯，就在它开始蓬勃发展的时候被切断了。\n在他艺术生涯的早期，拉斐尔主要是作为一位非常有成就的画家而闻名，他是一位用石油创作柔和的宗教场景的制造者，以及古代哲学、神学和艺术的令人叹为观止的愿景，这些愿景都壁画在梵蒂冈宫殿教皇的公寓斯坦兹(Stanze)的墙上。然而，在1514年，教皇利奥在新圣彼得大教堂的第一位建筑师布拉曼特去世后，选择他担任新圣彼得大教堂的首席建筑师，将这位年轻艺术家的职业生涯推向了一个新的方向。拉斐尔长期以来一直对建筑感兴趣，在1514年之前曾涉足过几个项目，但新的任命使他实际上成为基督教世界的领先建筑师。\n没有比新圣彼得教堂更能体现文艺复兴时期罗马文化自信的了。教皇朱利叶斯二世决定在基督教首都建造一座巨大的新古典设计教堂，这简直是大胆之举。它的建造要求教皇拆除基督教世界最古老的教堂-老圣彼得大教堂，这座教堂是由君士坦丁皇帝于4世纪在尼禄马戏团的废墟上建造的。根据一个传统，这座大教堂不仅纪念圣彼得的墓地，也纪念他殉难的地方。老教堂里挤满了圣徒的遗迹，教皇和烈士的坟墓，以及著名的艺术作品，包括美丽的古代马赛克和乔托的14世纪壁画。所有这些都必须为新教堂拆除，这是(许多人说的)教皇朱利叶斯虚荣心的纪念碑。当然，没有人能指责教皇过于谦虚。朱利叶斯的首席建筑师布拉曼特(Bramante)计划在新大教堂的中央十字路口和圣彼得墓(现在矗立着巴达基诺和高坛)上方竖立一座三层楼高的雕塑装置，上面有40多座雕塑，全部由米开朗基罗创作，作为教皇朱利叶斯本人的坟墓。\n尽管谢天谢地，该项目的这一部分最终被搁置了，但利奥十世和随后的教皇们继续投入大量资源建造大教堂。150年来，它一直是教皇赞助艺术的核心。那么，为什么当时最聪明的赞助人教皇利奥(Pope Leo)任命年轻的拉斐尔(Raphael)为建筑师，而他在建筑设计方面几乎没有经验？拉斐尔的主要传记作家乔治·瓦萨里(Giorgio Vasari)的读者提出这个问题是情有可原的。瓦萨里对拉斐尔的画作赞不绝口，但几乎没有提到他与建筑的关系。许多现代学者对建筑师拉斐尔不屑一顾，认为他只是布拉曼特的追随者，而布拉曼特是一位建筑大师曼凯，他没有完成任何重大的纪念碑。大多数艺术鉴赏家，如果他们想到拉斐尔的建筑，就会想到雅典学校(1509-11年)等绘画中的建筑背景，在那里，古代哲学家在一座令人叹为观止的中央规划的大教堂外的台阶上授课和辩论，这让人强烈地想起布拉曼特为新圣彼得大教堂设计的作品。\n拉斐尔的同代人，\n在他所有的作品中，只有他为圣玛丽亚·德尔·波波罗的奇吉家族建造的礼拜堂让我们真正感受到了可能发生的事情。在万神殿的启发下，这个空间被设计成一个和谐的古典电枢，在上面展示绘画、雕塑、硬皮埃特拉和(最初)马赛克的艺术。因此，它将纪念阿戈斯蒂诺·奇吉作为艺术赞助人的无与伦比的职业生涯。它巧妙地使用了彩色大理石和从古董中创造性地改编而来的优雅装饰品。它的工艺很精湛。但即使是这座礼拜堂也得由其他人来完成。它直到17世纪中叶才完工。\n拉斐尔作为建筑师的主要职责--新圣彼得大教堂怎么样？拉斐尔对这座建筑的最终状态的影响远远比不上米开朗基罗在他担任首席建筑师的18年中所产生的影响。拉斐尔只留下了几幅画，陵墓设计和一个新的平面图。但事实证明，这个平面图对这座建筑的未来具有巨大的意义。布拉曼特曾构思一座中央规划的教堂，最终灵感来自万神殿--这是文艺复兴时期罗马保存最完好的古典寺庙。圆形或中央规划的教堂反映了柏拉图原则，从布鲁内莱斯基和阿尔贝蒂在四重奏时期到莱昂纳多·达·芬奇和布拉曼特在文艺复兴时期一直是基督教古典建筑的理想选择。相比之下，拉斐尔的设计要求将教堂四个翅膀中的一个延伸到正厅，从而形成一个罗马十字架，通过一个不朽的柱廊进入。换句话说，他迈出了关键的一步，开始了教会向我们今天看到的巴西里卡形式的演变。\n拉斐尔大胆地修改布拉曼特的设计并不是出于外行的幻想，而是像他所有成熟的作品一样，是对古董进行仔细、有纪律的研究的结果。自彼得拉克以来，人文主义者一直在哀悼罗马古老面料的破坏，并梦想恢复这座城市的壮丽物理。早期的教皇，如人文主义教皇尼古拉斯五世，已经开始以更古典的风格重建罗马。但正是拉斐尔在教皇利奥和他的人文主义顾问，特别是巴尔德萨·卡斯蒂格里奥(Baldesar Castiglione)和安杰洛·科洛奇(Angelo Colocci)的支持下，承担了勘测罗马废墟的严肃工作，并试图逐区重建古城的面貌。正是这个准哲学项目激发了文艺复兴时期文人的想象力，并导致他们称赞拉斐尔是那个时代最伟大的建筑师。\n然而，拉斐尔的罗马计划，以及它对主要纪念碑-寺庙、浴室、剧院、宫殿、论坛和公共建筑的重建-不仅仅是对古物学研究的学术贡献。这是一个实用的项目，旨在服务于对现代古典风格，文艺复兴风格感兴趣的建筑师和赞助人。在他作为画家的工作中，拉斐尔以收集意大利各地其他艺术家的设计，并将他们的发明和技术作为自己的发明和技术而闻名。米开朗基罗和他的小圈子们极不公正地嘲笑他，认为他不过是一只喜鹊，从其他艺术家那里窃取了他最好的想法。作为一名建筑师，拉斐尔实践了同样的重组古典主义，从无数的古董结构中选择元素，但又以和谐、有创意的方式重新组装。他明白，与现代教育理论不同的是，创造力是知识之子。\n在他的罗马计划中，拉斐尔的目标是超越他从维特鲁威重建的古典秩序的基本语法，并用古典形式和装饰品填充一座巨大的记忆宫殿。这样，就像苏格拉底一样，他将成为各种建筑师天才的助产士。如果它建成了，它将成为有史以来最伟大的古典风格宝库。但是，当拉斐尔的生命被缩短时，这个富有远见的项目也还处于早期阶段。后来，它也将由技能较低的手工完成-由皮罗·利戈里奥(Pirro Ligorio)这样的学者建筑师和让-雅克·博萨尔(Jean-Jacques Boissard)这样的古董学家完成。正如约翰·谢尔曼在一项经典研究中总结的那样，拉斐尔是“文艺复兴时期所有伟大建筑师中最不幸的一位。”", "note_en": "P oor Raphael! This year, the five-hundredth anniversary of his death, was to have been his year of glory. After major exhibitions of Michelangelo in 2018 and Leonardo da Vinci in 2019, the museum world was in the midst of celebrating the third member of the glorious trinity of High Renaissance art. Then fear of a new coronavirus forced museums everywhere to take down their banners, chase away visitors, and close their doors. Lectures and conferences, canceled! “Raphael and His Circle” at the National Gallery in Washington, closed! “Raphael: The Teacher and His Pupils” at the Musée Condé outside of Paris, closed! Will they reopen once the panic has passed? Nobody knows. At least the currently shuttered “Raffaello” at the Scuderie del Quirinale in Rome has now announced plans to reopen on June 2. The last has been billed as the largest show ever dedicated to Raphael, with over two hundred masterpieces, including one hundred paintings and drawings by Raphael himself, lent by the Uffizi, the Louvre, the Prado, and London’s National Gallery, among others. And there is hope that reason will return to its throne in time for London’s National Gallery to open its doors in October for what will be the second-largest exhibition of the year.\n It’s a kind of tragic coincidence, or perhaps poetic injustice, that celebrations of Raphael’s achievement were interrupted by a deadly virus. It was a viral pneumonia ripping through the papal court that killed Raphael himself, aged thirty-seven, on April 6, 1520. The overworked and exhausted artist was carried off, biographers tell us, by a  grandissima febbre. His greatest patron, the Medici pope Leo  X, died suddenly of pneumonia a year and a half later, aged forty-six. The most fruitful partnership between artist and patron in High Renaissance Rome had lasted just over seven years. Among the casualties was Raphael’s career as an architect, cut off just as it was beginning to blossom.\n  Earlier in his artistic life, Raphael was chiefly known as a highly accomplished painter, a maker of tender religious scenes in oil as well as the breathtaking visions of ancient philosophy, theology, and the arts frescoed onto the walls of the  Stanze, the pope’s apartments in the Vatican palace. In 1514, however, Pope Leo pushed the young artist’s career in a new direction when he chose him to be chief architect of New St. Peter’s Basilica, following the death of its first architect, Bramante. Raphael had long had an interest in architecture and had dabbled in a few projects before 1514, but the new appointment made him, in effect, the leading architect in Christendom.\n There was no greater symbol of the cultural confidence of High Renaissance Rome than New St. Peter’s. Pope Julius  II’s decision to build an enormous new church of classical design in the capital of Christianity had been nothing short of audacious. Its construction required the pontiff to tear down the most venerable church in Christendom, Old St. Peter’s Basilica, built by the emperor Constantine in the fourth century on the ruins of Nero’s circus. According to one tradition, the basilica commemorated not only St. Peter’s place of burial but also the place where he had been martyred. The old church was filled with relics of the saints, tombs of popes and martyrs, and famous works of art, including beautiful ancient mosaics and fourteenth-century frescoes by Giotto. All this had to be torn down for the new church, a monument (said many) to the vanity of Pope Julius. Certainly no one could accuse that pope of an excess of humility. Under the central crossing of the new basilica and over the tomb of St. Peter, where the  baldacchino and high altar now stand, Julius’s chief architect, Bramante, planned to erect a three-story sculptural installation with over forty sculptures, all created by Michelangelo, as a tomb for—who else?—Pope Julius himself.\n Although that part of the project, thankfully, was in the end set aside, Leo  X and subsequent popes continued to pour vast resources into building the basilica. It remained the centerpiece of papal patronage of the arts for 150 years. So why did Pope Leo, the age’s most intelligent patron, appoint young Raphael as its architect, a man with little experience in building design? Readers of Giorgio Vasari, Raphael’s principal biographer, could be excused for asking that question. Vasari praises Raphael’s painting to the skies but barely mentions his involvement with architecture. Many modern scholars have dismissed Raphael the architect as a mere epigone of Bramante, a master builder  manqué who completed no major monuments. Most connoisseurs of art, if they think of Raphael’s buildings at all, think of the architectural backgrounds in paintings like the  School of Athens (1509–11), where ancient philosophers teach and debate on the steps outside a breathtakingly large, centrally planned church, strongly reminiscent of Bramante’s designs for New St. Peter’s.\n Raphael’s contemporaries, though, did not think of him as a failed or derivative architect. For them he was a man just hitting his stride in a new art when death brought an end to his many projects. Only a few petty detractors thought Leo had made a mistake. A line in the inscription on Raphael’s tomb in the Pantheon extols him for “enhancing the glory of Popes Julius and Leo with his works in painting  and architecture” [italics mine]. The humanist literati who composed dozens of poetic epitaphs for him after his death mourned the interruption of his great project to reconstruct the built environment of ancient Rome. The humanist Celio Calcagnini, writing to a friend just before Raphael’s death, described him not only as the “prince of all painters” but also as “such an assiduous architect that he discovers and perfects those things that the cleverest talents considered impossible.” Raphael, he noted, even comments on the text of Vitruvius—the great Roman authority on architecture—with a charm that excuses his shrewd criticisms of that author’s limitations.\n  T he greatest modern authority on Raphael, John Shearman, believed that the eclipse of Raphael’s fame as an architect was more than undeserved: it was a tragic injustice that architectural historians should do their best to rectify. The task is by no means easy, since so many of Raphael’s architectural projects were destroyed or left unfinished, to be completed by other hands. Reconstructing his ideas from drawings, early engravings, documents, literary testimony, and the surviving physical evidence is a delicate and daunting scholarly task which few today are qualified to undertake.\n Nevertheless, when one considers that Raphael only began to erect buildings to his own designs in 1512, aged twenty-seven, it is remarkable how many projects he did undertake, all the while maintaining his extraordinary productivity as a painter. He built two large palaces in the Borgo, both of which were torn down, one to make room for Bernini’s colonnade in the seventeenth century, the other when the Via della Conciliazione was laid out in 1937. He left plans for at least two more palaces that were modified and built by other architects. He began construction on two villas, the grand Villa Madama in a park north of the Vatican, now the resort of Italian diplomats, and an exquisite  gioello, the Villa Lante, on the Gianicolo. The Villa Madama project was carried forward after Raphael’s death by his most accomplished disciple, Giulio Romano, who also finished the Villa Lante in 1523–24. In both cases he made major alterations to Raphael’s original design. The huge, elegant stables Raphael built for the banker Agostino Chigi at his  villa suburbana were torn down in 1808. The small church of San Eligio degli Orefici, his earliest church design, was radically altered and finished by his collaborators Baldassare Peruzzi and Bastiano da San Gallo. He left competition designs for San Giovanni de’Fiorentini in Rome and for the façade of San Lorenzo, the Medici church in Florence; neither were built.\n Of all his work, only the chapel he built for the Chigi family in Santa Maria del Popolo gives us a real sense of what might have been. Inspired in its main lines by the Pantheon, the space was designed as a harmonious classical armature on which to display the arts of painting, sculpture,  pietra dura, and (originally) mosaic. It would thus commemorate Agostino Chigi’s unmatched career as a patron of the arts. It makes brilliant use of colored marbles and elegant ornamentation creatively adapted from the antique. Its craftsmanship is exquisite. But even this chapel had to be completed by other hands. It was not finished before the middle of the seventeenth century.\n What of New St. Peter’s, Raphael’s chief responsibility as an architect? Raphael had nowhere near the impact on the final state of the building that Michelangelo was to have in his eighteen years as chief architect. Raphael left just a few drawings, tomb designs, and a new floor plan. But that floor plan turned out to be of immense significance for the building’s future. Bramante had conceived of a centrally planned church inspired ultimately by the Pantheon—the most fully preserved classical temple in Renaissance Rome. Circular or centrally planned churches, reflecting Platonic principles, had been the ideal for Christian classical architecture from the time of Brunelleschi and Alberti in the quattrocento down to Leonardo da Vinci and Bramante in the High Renaissance. Raphael’s design, by contrast, called for extending one of the four wings of the church into a nave, thus forming a Roman cross, to be entered through a monumental colonnaded porch. In other words, he took the key step that began the church’s evolution into the basilican form we see today.\n  R aphael’s boldness in modifying Bramante’s designs was not some dilettantish flight of fancy but, like all his mature work, the result of careful, disciplined study of the antique. Humanists since Petrarch had mourned the destruction of Rome’s ancient fabric and dreamt of restoring the city’s physical grandeur. Earlier pontiffs such as the humanist pope Nicholas  V had begun to rebuild Rome in a more classical style. But it was Raphael, supported by Pope Leo and his humanist advisers, especially Baldesar Castiglione and Angelo Colocci, who undertook the serious work of surveying the ruins of Rome and attempting to reconstruct the appearance of the ancient city district by district, building by building. It was this quasi-philological project that fired the imaginations of Renaissance literati and led them to praise Raphael as the greatest architect of the age.\n Yet Raphael’s  Plan of Rome, with its reconstructions of major monuments—temples, baths, theaters, palaces, fora, and public buildings—was not simply a learned contribution to antiquarian studies. It was a practical project, designed to serve architects and patrons interested in building in the modern classical style, the Renaissance style. In his work as a painter Raphael was famous for collecting the designs of other artists throughout Italy and making their inventions and techniques his own. Michelangelo and his coterie sneered at him, with appalling injustice, as a mere magpie, stealing his best ideas from other artists. As an architect Raphael practiced the same kind of recombinant classicism, choosing elements from innumerable antique structures but reassembling them in harmonious, creative ways. He understood, as modern educational theory does not, that creativity is the child of knowledge.\n In his  Plan of Rome, Raphael’s goal was to go beyond the basic grammar of the classical orders he had reconstructed from Vitruvius, and to populate a vast memory palace with classical forms and ornaments. In this way, like Socrates, he would stand as midwife to the genius of architects and  disegnatori of every kind. Had it been completed, it would have become the greatest treasure-trove of classical style ever assembled. But this visionary project, too, was still in its early stages when Raphael’s life was cut short. It, too, would be carried out later by less skilled hands—by scholar-architects like Pirro Ligorio and antiquarians like Jean-Jacques Boissard. Raphael was, as John Shearman concluded in a classic study, “the unluckiest of all the great Renaissance architects.”", "posttime": "2020-05-22 17:01:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "拉斐尔,raphael", "title": "拉斐尔，被打断了", "title_en": "Raphael, Interrupted", "transed": 1, "url": "https://newcriterion.com/issues/2020/6/raphael-interrupted", "via": "", "real_tags": ["拉斐尔", "raphael"]}, {"category": "", "categoryclass": "", "imagename": "70830beeb6dae95fcd672adefc84ce96.png", "infoid": 1003254, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转到搜索诺顿指挥官(NC)是由John Socha编写并由Peter Norton Computing(后来于1990年被赛门铁克公司收购)发布的已停产的原型正统文件管理器(OFM)。NC提供基于文本的用户界面，用于管理MS-DOS上的文件。它是1986年至1998年间正式制作的。诺顿指挥官的最后一个MS-DOS版本5.51于1998年7月1日发布。\n一个相关的产品，诺顿桌面，MS-DOS和Windows的图形外壳，接替了诺顿指挥官。它有两个变种，DOS版Norton Desktop和Windows版Norton Desktop。\n约翰·索查于1984年开始制作“诺顿指挥官”，当时他称之为“Visual DOS”或“VDOS”。[1]。\n诺顿指挥官很容易使用，因为它可以同时查看两个文件操作对象。启动程序后，用户会看到两个带有文件列表的面板。每个面板都可以很容易地配置为显示有关另一个面板、目录树或许多其他选项的信息。在屏幕底部，诺顿指挥官显示按CTRL和ALT键按需扩展的命令列表。因此，无需大量使用鼠标(尽管在版本3.0左右集成了鼠标功能)，用户能够快速高效地执行许多文件操作操作。此外，它还包括一个内置的文本文件查看器(用F3键调用)和文本文件编辑器(用F4键调用)。\n诺顿司令官在DOS时代非常受欢迎，它已经被广泛克隆。例如，IntelliJ IDE过去包含一个使用与Norton Commander[2]相同的快捷键执行文件操作的&#34；Commander&34；插件，但该插件现在已过时。[3]。\nWindows 95包含一个名为Windows资源管理器的新图形外壳程序，并支持长文件名(LFN)。赛门铁克发布了Norton Commander 5.51，以支持使用标准Windows API的长文件名。为了在实模式下工作时保留LFN，诺顿指挥官5.51要求使用终止并停留驻留(TSR)实用程序。诺顿指挥官在实模式下没有对LFN的本地支持，因此会截断它们。\n据彼得·诺顿集团(Peter Norton Group)前开发人员马克·洛利尔(Mark Low Lier)称，在赛门铁克收购彼得·诺顿计算公司(Peter Norton Computing)后，赛门铁克曾猜测微软Windows会成功，因此关键的PNC资源被挪用，同时聘请了Windows平台的新程序员。Enrique Salem(他最终成为赛门铁克的首席执行官)领导开发了一个文件管理器和程序管理器，其名称为Norton Desktop for Windows。\nNorton Commander for Windows是经典DOS文件管理器的Windows 95变体。\n1.0版于1996年首次发布。它同时支持Windows 95和Windows NT。\n此版本与Windows功能(如回收站和快速查看)完全集成。通过随附的Basic Quick View Plus支持快速查看功能。\n2.0版于2000年发布。它支持Windows 2000以及在Windows XP、Windows Vista和Windows 7下的功能。安装程序包括网络实用程序、诺顿指挥官调度程序和诺顿指挥官。\n网络实用程序允许查看网络上的设备和系统、连接到远程系统、映射网络驱动器、网络监控等。\n诺顿指挥官与以前的版本相比变化不大，包括各种格式的文件压缩/解压缩，网络实用程序访问，磁盘清理，文件和文件夹比较，FTP连接管理，等等。\n版本1.0于1992年12月发布。它支持带HPFS或FAT文件系统的OS/2 2.0。\n1993年6月，赛门铁克将诺顿指挥官OS/2的价格降至49美元，并很快停止销售。\n字节在1989年将诺顿指挥官2.0 for DOS列为字节奖的杰出获奖者之一，他说在拥挤的硬盘上导航是轻而易举的事。[4]", "note_en": "Jump to navigation  Jump to search  Norton Commander ( NC) is a discontinued prototypical  orthodox file manager (OFM), written by  John Socha and released by  Peter Norton Computing (later acquired in 1990 by the  Symantec corporation). NC provides a  text-based user interface for managing files on top of  MS-DOS. It was officially produced between 1986 and 1998. The last MS-DOS version of Norton Commander, 5.51, was released on July 1, 1998.\n A related product,  Norton Desktop, a graphical shell for MS-DOS and Windows, succeeded Norton Commander. It came in two variants,  Norton Desktop for DOS and  Norton Desktop for Windows.\n    John Socha started work on Norton Commander in 1984; at the time, he called it &#34;Visual DOS&#34; or &#34;VDOS&#34;.  [1]\n Norton Commander was easy to use because it had a constant view of two file manipulation objects at once. After starting the program the user sees two panels with file lists. Each panel can be easily configured to show information about the other panel, a directory tree, or a number of other options. At the bottom of the screen, Norton Commander displays a list of commands that are extended on demand by the  CTRL and  ALT keys. Thus, without heavy use of the mouse (although mouse functionality was integrated around version 3.0), the user is able to perform many file manipulation actions quickly and efficiently. Additionally, it also includes a built-in text file viewer (invoked with F3 key) and text file editor (invoked with F4 key).\n Norton Commander was very popular during the DOS era and it has been extensively cloned. For example, the  IntelliJ IDE used to include a &#34;Commander&#34; plugin that performed file manipulation using the same shortcut keys as Norton Commander  [2] but the plugin is now obsolete.  [3]\n  Windows 95 included a new graphical shell called  Windows Explorer and supported  long filenames (LFN). Symantec released Norton Commander 5.51 to support long filenames using the standard Windows  APIs. In order to preserve LFNs while working in  real mode, Norton Commander 5.51 required the use of a  Terminate and Stay Resident (TSR) utility. Norton Commander did not have native support for LFNs in real mode and would truncate them.\n  According to former Peter Norton Group developer Mark Lowlier, after Symantec had acquired Peter Norton Computing, Symantec had speculated Microsoft Windows would be a success, so the key PNC resources had been diverted, while new programmers for Windows platform were hired.  Enrique Salem (who eventually became Symantec&#39;s CEO) led the development of a File Manager and Program Manager released as Norton Desktop for Windows.\n  Norton Commander for Windows was a Windows 95 variant of the classical DOS file manager.\n  Version 1.0 was first released in 1996. It supported both Windows 95 and Windows NT.\n This version fully integrated with Windows features such as the  Recycle Bin and  Quick View. Quick View feature was supported via the included basic Quick View Plus.\n    Version 2.0 was released in 2000. It supports Windows 2000 and functions under Windows XP, Windows Vista, and Windows 7. Installer included Network Utilities, Norton Commander Scheduler, and the Norton Commander.\n Network Utilities allows for viewing devices and systems on network, connecting to remote systems, mapping network drives, network monitoring, and more.\n Norton Commander is little changed from previous versions, and includes file compression/de-compression of various formats, network utilities access, disk cleanup, files and folder compare, FTP connection management, and more.\n   Version 1.0 was released in December 1992. It supports  OS/2 2.0 with  HPFS or FAT file system.\n  In June 1993, Symantec lowered the price of Norton Commander for OS/2 to $49, and soon ceased sales.\n  BYTE in 1989 listed Norton Commander 2.0 for DOS as among the &#34;Distinction&#34; winners of the BYTE Awards, stating that &#34;navigating through a crowded hard disk is a breeze&#34;.  [4]\n    PowerDesk by Avanquest, of which an evaluation version of Version 4 is included in Microsoft&#39;s Windows NT 4.0  Resource Kits\n RAR archive manager used to have Norton Commander-like interface, the last version with that interactive file manager interface look-alike was DOS version 2.50\n    ^   Bezroukov, Nikolai (2005).  &#34;The History of Development of Norton Commander&#34;.  Softpanorama.  As John Socha recollected the events (personal communication): &#39;I started work on what became known as the Norton Commander in the fall of 1984 ... At the time I called it Visual DOS, with the abbreviation of VDOS instead of the usual two-letter abbreviations used at the time.&#39;", "posttime": "2020-05-22 17:00:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "指挥官,norton,windows", "title": "诺顿指挥官", "title_en": "Norton Commander", "transed": 1, "url": "https://en.wikipedia.org/wiki/Norton_Commander", "via": "", "real_tags": ["指挥官", "norton", "windows"]}, {"category": "", "categoryclass": "", "imagename": "2f04d649ff258bc91254769363ac3046.jpeg", "infoid": 1003253, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "检查项目中是否存在PostCSS config：postcss.config.jin项目根目录中的postcss；postcss&34；部分，或包配置中的postcss。\n如果您没有使用PostCSS，请根据官方文档添加，并在设置中设置此插件。\npostcss[input.css]--正确使用CSS[-o|--output output.css][--watch|-w]postcss&lt；input.css&gt；.--正确使用CSS--dir&lt；output-directory&gt；[--watch|-w]postcss&lt；input-directory&gt；--use css-right--dir&lt；output-directory&gt；[--watch|-w]postcss&lt；输入目录&gt；[--watch|-w]postcss&lt；--正确使用css--dir&lt；output-directory&gt；[--watch|-w]postcss&lt；input.css&lt；.--正确使用css--替换", "note_en": "Check your project for existing PostCSS config:  postcss.config.jsin the project root,  &#34;postcss&#34; section in  package.jsonor  postcss in bundle config.\n   If you do not use PostCSS, add it according to  official docsand set this plugin in settings.\n     postcss [input.css] --use css-properly [-o |--output output.css] [--watch |-w] postcss  &lt;input.css &gt;... --use css-properly --dir  &lt;output-directory &gt; [--watch |-w] postcss  &lt;input-directory &gt; --use css-properly --dir  &lt;output-directory &gt; [--watch |-w] postcss  &lt;input-glob-pattern &gt; --use css-properly --dir  &lt;output-directory &gt; [--watch |-w] postcss  &lt;input.css &gt;... --use css-properly --replace", "posttime": "2020-05-22 17:00:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "英语,plugin,postcss", "title": "为喜欢正确书写英语的人提供的PostCSS插件", "title_en": "A PostCSS plugin for people who prefer to write English properly", "transed": 1, "url": "https://github.com/jevakallio/css-properly", "via": "", "real_tags": ["英语", "plugin", "postcss"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003252, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有两个著名的FM城镇仿真器。卡萨诺瓦的Unz可能是最好的FM城镇仿真器，我听说Mame正在变得更好。但是，在我看来，有三四个程序做同样的事情是好的。如果我们只有一个，如果它被终止，或者突然不可用，我们将被蒙在鼓里。*这样的风险比以往任何时候都要高，因为操作系统开发人员不负责任、不必要和过于频繁地放弃了向后兼容性。*我很幸运。我也有我自己的动机。我的目标是让真正的FM Townes PC尽可能长时间地运行，为此我开发了YSSCSICD.SYS。但是，一些游戏游戏直接访问CD-ROM I/O，在这种情况下我需要写补丁。其他仿真器完全没有理由模拟SCSI连接的CD-ROM驱动器，但我确实有理由。所以，我的目标之一就是模拟SCSI连接的CD-ROM驱动器，这样我就可以更容易地编写补丁。源代码已经在Github上了。我也想让二进制文件可用。我正在探索如何使用Github来做到这一点。", "note_en": "There are two known FM Towns emulators.  Kasanova&#39;s UNZ probably is the best emulates FM Towns, and I hear that  MAME is getting better.  But, in my opinion, it is good to have three or four programs that do the same thing.  If we have only one, and if it is terminated, or suddenly unavailable, we will be left in the dark.  Such a risk is higher than ever because OS developers irresponsibly and unnecessarily and too frequently drops backward compatibility.  I am lucky enough to be a programmer, I am trying to write what I need by my own whenever possible. Also I have my own motivation.  My goal is to keep actual FM Towns PCs alive as long as possible, and for that purpose I developed YSSCSICD.SYS.  But, some game titles are directly accessing CD-ROM I/O, in such cases I need to write a patch.  Other emulators have absolutely no reason to emulate SCSI-connected CD-ROM drive, but I do have a reason.  So, one of my goals is to emulate SCSI-connected CD-ROM drive, so that I can write patches easier. The source code has been on Github.  I&#39;d like to make binary available as well.  I am exploring how to do it using Github.", "posttime": "2020-05-22 17:00:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "fm,cd", "title": "“津格鲁”-FM城镇模拟器项目", "title_en": "“Tsugaru” – FM Towns Emulator Project", "transed": 1, "url": "http://ysflight.in.coocan.jp/FM/towns/Tsugaru/e.html", "via": "", "real_tags": ["fm", "cd"]}, {"category": "", "categoryclass": "", "imagename": "f8451dd3f2584ddd3e363f0511637b64.jpeg", "infoid": 1003251, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "发布我自己的应用程序或与团队合作，帮助他们发布他们的应用程序。我意识到投入生产通常是一片混乱。你的应用程序有多大并不重要：这个应用程序是由不同的35个团队开发的，还是只由一个成熟的团队开发的。这只是一个熵的问题：-)。\n有很多书籍描述了实现后续生产支持的最佳实践。但你不会在去生产和活动之前读完所有这些书，如果你读了它们，在推出的过程中，你可能会忘记你读到的一些东西。当然，我读过很多书，也有自己的经历。在上线之前，我通常会开始回忆我所知道的一切，并试图将其应用于当前的案件。我在想如何更好地组织信息，并想出一个众所周知的旧核对表的想法。\n[很高兴有]应用部署到至少2个不同的位置(可以在不同位置之间配置vPC对等)。\n至少为基本指标配置警报，以便CPU、内存、IOPS、磁盘空间。\n部署数据库时，应至少具有所需的最低节点数量，并具有可帮助您尽快恢复的复制因子。\n我需要一份烟雾测试列表(如果它们是自动化的就好了)，它可以显示生产已经启动并在运行。\n第三方服务运行状况检查应该由应用程序服务本身进行检查，或者让他的运行状况检查端点进行检查，或者需要制作一些脚本来检查第三方服务的运行状况。\n根据您使用的GIT-FLOW需要分配标签来准备快速修复的分支，等等。\n确保了解系统中每个组件所需的资源数量。\n请确保为服务配置所有限制。为了避免因为一个服务中的内存泄漏而杀死周围的所有服务的情况。\n需要有负责生产部署的人员，并签字确认生产已准备就绪。\n需要有不同级别细节和ETA的灾难恢复计划，例如：如何恢复一项服务、如何恢复数据库、如何恢复整个群集、如何恢复整个区域。\n请不要犹豫，请在上线前把你通常检查的东西发给我，我会更新这个清单的。当然，如果您在应用程序体系结构/DevOps进程/BigData处理方面需要帮助，请联系我。", "note_en": "Releasing my own apps or working with teams to help them to release their application. I realized that rolling out to production is usually chaos. It doesn’t matter how big is your app: the app that was made by different 35 teams or just one mature team. It just a matter of entropy :-).\n There are a lot of books that describe  best practices to go to live with subsequent production support. But you are not going to read all those books right before going to production and event if you read them, during the rollout you may forget something that you read about. Of cause I’ve read many of them and have my own experience. Before go-live I usually starting to recollect everything that I know and try to apply to the current case. I was thinking about how to organize information better and come up with an idea of well known old checklists.\n    [Nice to have] Application is deployed to at least 2 different locations(VPC peering could be configured between location)\n      Alerts are configured at least for basic metrics so that CPU, memory, IOPS, disk space\n      Databases should be deployed at least with a minimum required number of a node with a replication factor that helps you to recover as soon as possible\n      Need to have a list of smoke tests (it’s good if they are automated) that could show that production is up and running\n  3rd party services health check should be either checked by application service itself or has his health check endpoints or needs to make some scripts that check the health of 3rd party service.\n    According to git-flow that you use need to assign tags to prepare branches for quick fixes, etc.\n  Make sure that you understand the number of necessary resources for each component in a system\n Make sure that you configure all limits for the services. To avoid situations when because of the memory leak in one service you kill everything around.\n      Need to have a person who is responsible for production deployment and sign off that production is ready to go\n    Need to have a disaster recovery plan with different levels of details and ETAs for example: how to recover one service, how to recover a database, how to recover the whole cluster, how to recover the whole region\n  Please don’t hesitate to send me the things that you usually check before go live and I will update this list. And of cause, if you need help with your Application Architecture/DevOps Processes/BigData processing reach me out.", "posttime": "2020-05-22 16:59:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,app,应用程序,readiness,生产", "title": "后端应用程序的生产就绪检查表", "title_en": "Production readiness checklist for back end applications", "transed": 1, "url": "https://medium.com/@aleksei.kornev/production-readiness-checklist-for-backend-applications-8d2b0c57ccec", "via": "", "real_tags": ["程序", "app", "应用程序", "readiness", "生产"]}, {"category": "", "categoryclass": "", "imagename": "e48cf30d192f006425282b0e3318521e.jpg", "infoid": 1003250, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周四发布的一项研究显示，北达科他州的Care19应用程序是首批在美国上市的数字冠状病毒接触者追踪解决方案之一，它违反了自己与Foursquare和谷歌等第三方公司共享用户信息的隐私政策。\n据Fast Company报道，隐私软件专家Jumbo Privacy对Care19进行了审查，发现该应用程序会向外部发送位置数据和其他个人信息。\n由ProudCrowd开发，该公司为北达科他州州立大学体育迷营销一款基于位置的社交网络应用，Care19通过分配和跟踪随机用户ID承诺参与者匿名。该系统记录用户花费10分钟或更长时间的位置，这些信息可以与自愿提供给北达科他州卫生部的接触者追踪数据相关联。\n报告称，该应用程序的隐私政策说明位置数据是您的隐私，并安全存储在ProudCrowd有限责任公司的服务器上，除非您同意或ProudCrowd根据联邦法规强制要求，否则不会与第三方共享。\n然而，Jumbo发现了传输到Foursquare的用户ID号、电话ID和似乎是位置数据的东西。手机广告标识符被发送到与谷歌Firebase服务相关联的服务器，而分配的随机ID和手机名称(默认情况下通常包括用户的名字)被发送到软件诊断公司Bugfender。\nProudCrowd在一份声明中说，根据我们Foursquare协议的条款，Care19应用程序的用户界面清楚地显示了我们附近地方屏幕上Foursquare的使用情况。但是，我们的隐私政策目前没有明确提到这种用法。我们将与我们的州合作伙伴合作，在我们的隐私政策中更加明确。值得注意的是，我们与Foursquare达成的协议不允许他们收集或以任何形式使用Care19数据，只是简单地确定附近的企业并将其返回给我们。\n在给Fast Company的一封电子邮件中，ProudCrowd创始人蒂姆·布鲁金斯(Tim Brookins)表示，Care19&19&Foursquare的整合是一个错误，很快就会得到纠正。布鲁金斯将该错误描述为相当温和，因为Foursquare实际上并不收集我们发送的数据。\n据“华盛顿邮报”报道，虽然Care19并不依赖于最近发布的苹果-谷歌曝光通知API，但苹果参与了该应用的审查。苹果目前正在调查Jumbo的指控，并将与ProudCrowd合作，使这款应用符合其规则。\n具有讽刺意味的是，北达科他州公共卫生局的一名官员是上周批评苹果(Apple)和谷歌(Google)跨平台暴露通知系统过于严格而无法普遍采用的少数专家之一。在华盛顿邮报发表的一篇文章中，包括联系人追踪应用程序开发者在内的苹果-谷歌解决方案的批评者表示，曝光通知API纳入了对联系人追踪操作不利的数据共享限制。\n北达科他州的接触者追踪联络人弗恩·多施(Vern Dosch)表示，每过一分钟，可能就会有其他人被感染，所以我们希望能够尽我们所能。我明白了。他们有一个品牌需要保护。我只希望他们能用下巴领路。\n苹果和谷歌的系统拒绝访问地理位置数据，匿名用户设备，限制应用程序将数据存储在中央服务器上，以及其他保障措施。如果PHA的应用程序不符合Apple-Google标准，它不会被授予访问API的权限，因此被禁止在后台处理任务。\n北达科他州最初构建应用程序的目的是希望整合曝光通知技术，但隐私限制促使团队重新开始并创建了两个独立的应用程序：一个是为联系人追踪团队创建的，另一个是集成了曝光通知API的应用程序。\n目前尚不清楚北达科他州是否会推出新版Care19应用程序，内置曝光通知API，但该州是宣布支持苹果-谷歌倡议的三个州之一。据AL.com报道，周四，阿拉巴马州和南卡罗来纳州也签约成为这项技术的早期采用者。\n阿拉巴马州州长凯·艾维说，(我们)与这两家全球巨头联手，希望帮助我们的人们了解他们可能在何时何地接触到这种病毒。希望这将成为工具箱中的一个重要工具，通过使用几乎每个阿拉巴马州人口袋里的东西来减缓冠状病毒的传播。一部手机。&#34；\n在短暂的测试期之后，苹果和谷歌的曝光通知API于周三发布了iOS13.5。利用该框架的联系人跟踪应用程序应该会在未来几天或几周内发布。\nAppleInsider与会员有合作关系，通过会员链接购买的产品可能会赚取佣金。这些合作关系不会影响我们的编辑内容。", "note_en": "North Dakota&#39;s Care19 app, one of the first digital coronavirus contact tracing solutions to hit market in the U.S., contradicts its own privacy policy to share user information with third party companies like Foursquare and Google, according to a study released on Thursday.\n  A  review of Care19 by privacy software specialist Jumbo Privacy found the app  sends location data and other personal information to outside parties, reports  Fast Company.\n Developed by ProudCrowd, which markets a location-based social networking app for North Dakota State University sports fans, Care19 promises  participant anonymity by assigning and tracking random user IDs. The system logs locations where a user spent 10 minutes or more, information that can be correlated with contact tracing data provided on a voluntary basis to the North Dakota Department of Health.\n The app&#39;s privacy policy notes &#34;location data is private to you and is stored securely on ProudCrowd, LLC servers,&#34; and will not be shared with third-parties &#34;unless you consent or ProudCrowd is compelled under federal regulations,&#34; the report said.\n However, Jumbo found user ID numbers, phone IDs and what appears to be location data transmitted to Foursquare. Phone advertising identifiers are sent to servers associated with Google&#39;s Firebase service, while the assigned random ID and phone name — which by default typically includes a user&#39;s first name — is sent to software diagnostics firm Bugfender.\n &#34;The Care19 application user interface clearly calls out the usage of Foursquare on our Nearby Places&#39; screen, per the terms of our Foursquare agreement,&#34; ProudCrowd said in a statement. &#34;However, our privacy policy does not currently explicitly mention this usage. We will be working with our state partners to be more explicit in our privacy policy. It is important to note that our agreement with Foursquare does not allow them to collect Care19 data or use it in any form, beyond simply determining nearby businesses and returning that to us.&#34;\n In an email to  Fast Company, ProudCrowd founder Tim Brookins said Care19&#39;s Foursquare integration was a mistake that will soon be rectified. Brookins characterized the error as &#34;fairly benign, as Foursquare doesn&#39;t actually collect our sent data.&#34;\n While Care19 does not rely on the recently released Apple-Google  Exposure Notification API, Apple  was involved in the vetting of the app, reports  The Washington Post. Apple is currently investigating Jumbo&#39;s claims and will work with ProudCrowd to bring the app in compliance with its rules.\n  Ironically, a North Dakota public health authority official was among a handful of experts who last week criticized Apple and Google&#39;s cross-platform Exposure Notification system as being  too restrictive for general adoption. In an article published by  The Post, critics of the Apple-Google solution, including developers of contact tracing apps, said the Exposure Notification API incorporates data sharing restrictions that are detrimental to contact tracing operations.\n &#34;Every minute that ticks by, maybe someone else is getting infected, so we want to be able to use everything we can,&#34; said Vern Dosch, contact tracing liaison for North Dakota. &#34;I get it. They have a brand to protect. I just wish they would have led with their jaw.&#34;\n Apple and Google&#39;s systems deny access to geolocation data, anonymize user equipment and restrict apps from storing data on a centralized server, among other safeguards. If a PHA&#39;s app does not meet Apple-Google standards, it is not granted access to the API and is thus prohibited from processing tasks in the background.\n North Dakota initially built its app with hopes of integrating Exposure Notification technology, but the privacy restrictions prompted the team to start over and create two separate apps: one for contact tracing teams and another that integrates the Exposure Notification API.\n It is unclear if North Dakota will roll out a new version of the Care19 app with the Exposure Notification API baked in, but the state is one of three to announce support of the Apple-Google initiative. On Thursday,  Alabama and South Carolina also signed on as early adopters of the technology, reports  AL.com.\n &#34;(We&#39;ve) joined hands with these two global giants in hopes of helping our people learn when and where they may have gotten exposed to this virus,&#34; Alabama Gov. Kay Ivey said. &#34;Hopefully, this will become an important tool in the tool kit to slow the spread of coronavirus by using what almost every Alabamians has in their pocket ... a cell phone.&#34;\n After a brief beta testing period, Apple and Google&#39;s Exposure Notification API went live  on Wednesday with the release of iOS 13.5. Contact tracing apps that take advantage of the framework should see release in the coming days or weeks.\n    AppleInsider has affiliate partnerships and may earn commission on products purchased through affiliate links. These partnerships do not influence our editorial content.", "posttime": "2020-05-22 16:25:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,苹果,google,app,apple", "title": "经苹果审查的联系人跟踪应用程序发现与Foursquare/Google共享数据", "title_en": "Contact tracing app vetted by Apple found to share data with Foursquare/Google", "transed": 1, "url": "https://appleinsider.com/articles/20/05/22/contact-tracing-app-vetted-by-apple-found-to-share-data-with-foursquare-and-google", "via": "", "real_tags": ["程序", "苹果", "google", "app", "apple"]}, {"category": "", "categoryclass": "", "imagename": "bff2a714cd7081340512131d66996508.png", "infoid": 1003249, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "80486处理器可以在单个周期内执行许多指令，例如寄存器到寄存器相加指令(例如，ADDEAX、EBX)，人们通常认为这是相当复杂的，需要读取两个寄存器、完整的32位算术逻辑单元操作以及寄存器和标志写入。\n然而，人们自然会认为相对简单的其他指令需要多个周期，包括各种标志操作指令，如STC和CLC，它们是加法指令所需操作的严格子集(仅将预先计算的值加载到标志中，而不必实际基于输入确定要加载的值，并且根本不需要寄存器更新)，但需要2个周期。\n80486包含用于解码、操作数提取、执行和回写的并行操作级。因此，虽然加法确实需要3个时钟才能执行，但与第一个8086一样，它的执行与上一次/下一次操作重叠，因此CPU可以在每个时钟上执行一个加法。\n(请注意，在这一阶段还有很多事情要做，所以我可能不记得所有的细节了)。\n两个时钟是自8088以来任何指令的最小执行时间。由于寄存器/寄存器确实需要3个周期，因此添加(或类似)。使用286，由于优化了微码和路由(*1)，它们的运行速度加快到两个周期。虽然386确实由于更好的地址生成而加快了执行速度，但基本执行方案与3级指令预取保持不变。\n486确实进一步调整了地址生成，但更重要的是重做了指令提取体系结构。这是通过一条5级管道完成的。\n解码1-主指令解码-这里只检查了前1..3个字节。\n这些级的操作是有条件的，但将始终采取(通过)操作以保持恒定的时钟速率。\nFETCH总是一次将一个16字节的高速缓存(内存)行放入它的两个缓冲区之一。因此，平均每4-5条指令它只需要这样做。该时间可用于预填满第二缓冲器。因此，只要代码是线性的，即使没有高速缓存，486也可以保持快速执行。\n译码1查看操作码和寻址字段以确定要采取的动作，将实际指令长度反馈到提取级(以便它可以前进)，它设置D2执行的操作。这里值得注意的是，每个前缀字节被作为其自己的指令来处理，占用另一个时钟周期(*2，3)。类似于双字节操作码的第一个字节(例如0Fh)。\n解码2解码操作数访问，从提取级的缓冲区获取偏移量或立即值。它也可以进行地址计算。简单的需要两个周期，复杂的需要两个周期。\n行刑。如果所有数据都以即时方式存在，或存在于高速缓存中，或来自寄存器堆，则执行将在单个周期内执行。\n写回将读取值(内存、高速缓存或提取缓冲区)或锁存的执行结果存储到寄存器和/或内存写入缓冲区中。\n因此，单个ADD REG，REG仍然需要3个周期，但是由于流水线的原因，CPU每个时钟可以完成一个周期。\n但是等等，如果有两个add，第二个需要前一个的结果，会发生什么呢？比如ADD AX，BX；ADD CX，AX。这不是意味着第二个必须等到第一个的回写完成才能执行吗？\n嗯，是的，除了工程师在回写和执行之间增加了一个快捷方式/反馈。WB输入，即前一次执行的结果，不仅写入寄存器组，而且还提供作为备用输入(用目标是什么标记)返回执行。因此，如果一条指令需要读取前一条指令的结果寄存器，则甚至在写入实数寄存器之前就可以读取该寄存器。\n很酷，不是吗？但这会变得更加棘手。在EXECUTE中完成的任何操作的标志也从写回中提供回来，以便在下一条指令中使用。这样做是为了在诸如比较或减法之类的标志修改操作之后启用一个周期未采取的跳转。\n尽管有这样的优化，状态寄存器操作指令并没有从这个避免暗示的快捷方式中受益。直接状态寄存器操作不通过WB，而是直接处理状态寄存器的两步微指令。这一点很重要，因为状态寄存器设置不仅会改变所有操作行为，还会产生各种异常。\n记住，80486不是RISC CPU，也不会在内部转换为RISC(类似)指令，但继续像它们的前身一样运行，这是有益的。只需要非常巧妙地设计流水线，在各级之间进行反馈，并并行操作地址计算单元。虽然奔腾(P5)引入了超卡操作(应该是并行流水线)，但直到P6(奔腾Pro)才将代码翻译成(有点)类似RISC的内核--但即使在那时，也使用了许多非RISCy侧通道。\n随后的设计真的超越了他们自己，一条管道在奔腾III中增长到10级，第一台奔腾4级增长到20级，IIRC管道增长到40级(！)。在返回到更简单但大规模的并行设计(如P6)之前，上一次网络突发的各个阶段已经.。但这也是另一回事了。\n*1-80286速度的主要收益是专用地址计算单元，但这是另一回事。\n*2-这就是为什么一个锁在286/386上需要零个周期，而在486上只需要一个周期。\n*3-在某个地方，我确实读到了英特尔(IIRC)关于前缀和管道的一项很好的研究。一个真正值得注意的部分是Unix程序平均只使用DOS程序的一半前缀。这证明了用段值计算地址是多么愚蠢。\n感谢您抽出时间来写这份信息量很大的答案。我确实从中学到了很多。--盖尔奎斯特\n首先，486在单个周期内执行指令是不正确的。80486是流水线架构，因此更准确地说，大多数指令可以在前一条指令开始后一个周期开始。AFAIK，80486的管道长度为5级(如果ID1ID2ex WB)。这意味着进入该流水线的指令具有5个周期的等待时间。\n这些1周期指令属于所谓的RISC子集：生产软件中通常存在的指令子集，因为生成该软件的编译器使用它们最多。\n其他指令，尽管和第一条指令一样简单，但不属于RISC子集，必须通过微码执行，就像它在以前的体系结构中是如何执行的一样。\n我明白了，所以处理器有两个完全独立的执行路径，那些更常见的指令通过更优化的路径，但是其他指令(即使它们由于是简单的指令可以很容易地在优化的路径上实现)使用较不优化的机制，因此花费更长的时间？-occipita。\n除了围绕微码和快速路径指令的各种优化之外，x86上的标志也很特殊，因为所有指令都不会以相同的方式更新标志(INC/DEC不会像ADD/SUB那样更新CF)。也许英特尔更喜欢使用一种复杂的方法来仅更改CF(例如将标志寄存器读取到临时存储器，应用掩码.)。不是添加信号来仅更新CF并跟踪相关性：如果CF更新是特定的，则CPU可能需要停止流水线以避免危险。--TEMLIB。\n点击“发布您的答案”，即表示您同意我们的服务条款、隐私政策和Cookie政策。\n不是你想要的答案吗？浏览标记的其他问题或提出您自己的问题。", "note_en": "The 80486 processor can execute many instructions in a single cycle, such as a register-to-register add instruction ( ADD EAX, EBX, for example), which one would generally assume is fairly complex, requiring two registers to be read, a full 32 bit ALU operation, and both a register and flag writes.\n However, other instructions that one would naturally assume to be relatively simple take multiple cycles, including the various flag manipulation instructions like  STC and  CLC, which are a strict subset of the operations required for an  ADD instruction (only loading a precalculated value into the flags, rather than having to actually determine what the value to load should be based on inputs, and not needing a register update at all), yet take 2 cycles.\n  The 80486 contains parallel operating stages for decoding, operand fetch, execution and write back. So while an  ADD does take 3 clocks to perform, still like with the first 8086, it&#39;s execution overlaps with the previous/next operation, so the CPU can crank out one  ADD per clock.\n  (Caveat, there&#39; a whole lot more going on in this stages, so I might not remember all details)\n Two clocks was the minimum execution time for any instruction since the 8088.  ADD (or similar) as register/register did take 3 cycles. With the 286 they were sped up to two cycle operation due optimized microcode and routing (*1). While the 386 did speed up execution even more due better address generation, the basic execution scheme stayed the same with a 3 stage instruction prefetch.\n The 486 did straighten address generation to further, but more important redid the instructions fetch architecture. This was done by a 5 stage pipeline.\n Decode 1 - Primary instruction decode - here only the first 1..3 bytes were examined\n Operation of these stages are conditional, but will always be taken (passed thru) to keep a constant clock rate.\n Fetch always gets a cache (memory) line of 16 byte at once into one of its two buffers. Thus in average it only needs to do so every 4-5 instructions. This time is available to prefill the second buffer. Thus the 486 can keep up fast execution even without cache as long as the code is linear.\n Decode 1 looks at opcode and addressing field to determinate the action to be taken, feed back real instruction length to the fetch stage (so it can advance) it sets up the operation D2 performs. Notable here, each prefix byte is handled as an instruction of its own, taking another clock cycle (*2,3). Similar the first byte (e.g.0Fh) of a two byte opcode.\n Decode 2 decodes operand access, fetches offsets or immediate values from the fetch stage&#39;s buffer. It des as well do address calculations. Simple ones within a single cycle, complex need two.\n Execution. If all data is present as immediate, or in cache, or from the register file, the execution performs in a single cycle.\n Write Back stores either the read value (memory, cache or Fetch buffer) or the latched results from Execution into the registers and or memory write buffers.\n So a single  ADD reg,reg still needs 3 cycles but due the pipeline the CPU can finish one every clock.\n But wait, what happens if there are two  ADD, the second needing the result of the previous? Like  ADD AX,BX; ADD CX,AX. Wouldn&#39;t that mean the second has to wait in execution until write back of the first is finished?\n Well, yes, except the engineers added a shortcut/feedback between Write Back and Execution. The WB input, the result of the previous Execute, is not only written to the register set, but as well offered to back to Execution as alternate input (tagged with what the target was). So if one instruction needs to read a register that was the result of the prior instruction it&#39;s available even before written into the &#39;real&#39; register.\n Cool, isn&#39;t it? But it gets even more tricky. The flags of any operation done in Execute are as well provided back from Write Back to be used in the next instruction. This is done to enable a one cycle not taken jump after flag modifying operations like compare or subtract.\n Despite that optimization status register manipulating instructions do not benefit from this shortcut to avoid implications. Direct status register manipulation don&#39;t go thru WB but are two step microinstructions handling the Status Register directly. This is important as status register settings do not only change over all operation behaviour but also can generate various exceptions.\n  It&#39;s beneficial to remember that  the 80486 is not a RISC CPU and does  not translate internally to RISC(-like) instructions, but continues to operate like their predecessors. Just with a very clever designed pipeline with feedback between various stages and parallel operation of address calculation units. While The Pentium (P5) introduced superskalar operation (due parallel pipelines), it wasn&#39;t until the P6 (Pentium Pro) that a code translation to a (somewhat) RISC like core happened - but even then lots of un-RISCy side channels were used.\n Following designs really outdid themself with a pipeline growing to 10 stages in Pentium III, 20 for the first Pentium 4 and IIRC 40 (!) stages for the last netburst, before going back to a more simple but massive parallel design like teh P6 already had... But that&#39;s as well another story.\n  *1 - The main gain of the 80286 in speed was a dedicated address calculation unit, but that&#39;s a different story.\n *2 - That&#39;s why a  LOCK takes zero cycles on a 286/386 but one cycle on a 486.\n *3 - Somewhere I did read a nice study made by Intel (IIRC) about prefixes and the pipeline. One really remarkable part was that Unix programs in average use only half as much prefixes as DOS programs. Proves my pot how stupid it is to do address calculation with segment values.\n  Thank you for taking the time to write this very informative answer. I did learn a lot from this.\r \r–  ghellquist\n      First, it is not true that the 486 executes instructions in a single cycle. The 80486 is a pipelined architecture, so it&#39;s more accurate to say that most instructions can start one cycle after the preceding instruction has started. AFAIK, the pipeline length of a 80486 is 5 stages (IF ID1 ID2 EX WB). This means that a instruction that enter this pipeline has a latency of 5 cycles.\n These &#34;1-cycle&#34; instructions are the ones that belong to the so called RISC subset: a subset of instructions that are commonly present in production software because compilers that produced that software use them the most.\n Other instructions, despite being as simple as the first ones, doesn&#39;t belong to the RISC subset and must be executed by means of microcode, as how it were executed in previous architectures.\n  I see, so the processor has two entirely separate execution paths, and those more common instructions go via a more optimized path, but other instructions (even if they could easily have been implemented on that optimized path due to being simple instructions) use the less optimized mechanism and therefore take longer?\r \r–  occipita\n  Besides various optimisations around microcode and fast path instructions, flags on x86 are special as all instructions don&#39;t update the flags in the same way (INC/DEC don&#39;t update CF unlike ADD/SUB). Maybe Intel preferred to use a convoluted method to change only CF (such as reading the flag register to a temporary storage, apply a mask...) instead of adding signals to only update CF and track dependencies : if CF updates are particular, the CPU may need to stall the pipeline to avoid hazards.\r \r–  TEMLIB\n    By clicking “Post Your Answer”, you agree to our  terms of service,  privacy policy and  cookie policy\n  Not the answer you&#39;re looking for? Browse other questions tagged       or  ask your own question.", "posttime": "2020-05-22 16:25:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "时间,execute,指令", "title": "为什么80486执行简单指令的时间比执行复杂指令的时间长？", "title_en": "Why does the 80486 take longer to execute simple instructions than complex ones?", "transed": 1, "url": "https://retrocomputing.stackexchange.com/questions/14876/why-does-the-80486-take-longer-to-execute-simple-instructions-than-complex-ones", "via": "", "real_tags": ["时间", "execute", "指令"]}, {"category": "", "categoryclass": "", "imagename": "652b8c15cf13f335f997e69b33487a61.jpg", "infoid": 1003248, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳到主要内容Spotify本周宣布，乔·罗根(Joe Rogan)极为成功的节目“乔·罗根体验”(The Joe Rogan Experience)将成为Spotify独家节目。这可能是有史以来最大的一笔播客交易。再加上过去一年半里其他播客收购的轰动一时的狂潮，该公司现在已经成立，成为播客领域的最大品牌-并可能以前所未有的方式控制播客。\n从来没有一家播客公司销售广告，制作节目，拥有已经很受欢迎的播客播放器，并提供制作新系列的工具。Spotify现在拥有了所有这些，而与罗根的交易意味着它还提供了一个热门节目，保证数百万人经常使用其平台收听播客。\n然而，这笔交易也可能预示着更广泛的播客行业的未来，在这个行业中，将发展两个派别：一个重视隐私和开放的生态系统，另一个是封闭的，围绕被锁定的节目和定向广告建立起来，比如Spotify。\n去他妈的Spotify，去他妈的任何只能在一款应用中播放的“播客”。\n-Marco Arment(@marcoarment)2020年5月19日。\nSpotify去年通过三笔关键收购表达了其播客雄心。它收购了两个播客网络-Gimlet Media(以回复All而闻名)和Parcast(一个真实犯罪和神秘的网络)-加上一家名为Anchor的公司，提供易于使用的播客创建工具。据报道，Spotify总共为这三家公司花费了约4亿美元。\n今年，Spotify继续斥巨资收购人才。今年2月，Spotify收购了林格和比尔·西蒙斯(The Ringer And Bill Simmons)的旗舰节目，据报道，价格约为1.96亿美元。现在有了罗根的交易，据报道，这笔交易可能会让Spotify损失超过1亿美元。该团队花费了大量资金，所有这些都是为了锁定一些业内顶级内容，并将他们的系列-以及广告-提交给Spotify。\nSpotify在播客领域看到了巨大的商机。首先，没有一个单一的竞争对手可以单独与公司竞争。到目前为止，苹果是播客领域最大的名字，它基本上不管苹果播客，让听众自由来去，允许创作者上传他们的RSS订阅源，而不是苹果试图入股。苹果现在不做节目，也不卖广告，这无论如何都会与其以隐私为导向的地位背道而驰。Spotify可以拥有这个空间。即使苹果想要竞争，它现在也必须寻找其他大型节目来收购，而Spotify拥有巨大的领先优势。\n然而，更重要的是，这些播客前期花费了Spotify一大笔钱，但在未来可能会有所回报。每当有人在其平台上播放一首歌曲时，它必须向唱片公司支付收听费用。但有了播客，该公司就不需要向第三方付费了。通过独家交易和自己的节目，它实际上是从每个收听节目中赚钱的，因为它投放了广告。即使是高级用户也会在Spotify播客中听到广告，所以Spotify在这种情况下会有收入的双底衰退。\n播客可能是有利可图的，这就是为什么即使它花了数亿美元为其平台购买人才和工具，它很可能会收回这笔钱。另一家播客广告网络Midroll表示，广告商可以为每1000名节目听众支付18至50美元不等的费用。乔·罗根(Joe Rogan)表示，他的节目每月下载量达到1.9亿次，这意味着他在低端市场每月可以带来300万美元的广告收入。福布斯说，罗根去年赚了3000万美元。\n罗根的节目仍然可以在Spotify上免费收听；人们不需要为Spotify Premium付费收听或观看它，尽管他们会用自己的数据付费，这有助于Spotify销售更有利可图的广告。Spotify将联合销售罗根节目的广告，因此免费用户将听到这些广告，以及在使用Spotify平台过程中播放的任何额外广告。Spotify不需要每个人都订阅，因为不管是哪种方式，Spotify都能从他们身上赚钱。\n像罗根这样的大牌人物可能会把人们带到Spotify，但让他们留在那里的是一个巨大的展览馆。这也是Spotify战略的一部分：提供播客创作工具，以便制作更多节目，并填充其目录。Spotify表示，它现在列出了100多万个播客，在2020年第一季度，70%的节目是用Anchor制作的。\n除了所有这些收购和交易之外，Spotify还创造了用于生成播放列表和插入广告的新技术。它通过算法生成播客播放列表，并推出了自己的广告工具-流广告插入(Streaming Ad Insertion)，该工具允许在人们流式播放时将有针对性的广告放入节目中，这再次依赖于关键的用户数据。它在应用内推出了视频播客，这可能会影响YouTube的一些受欢迎的播客转向其平台-如果不是独家的，至少是交叉发布，以进一步完善Spotify的服务。\n所有这些举措都可以让Spotify从头到尾控制整个播客过程。播客可以使用Spotify工具制作节目，并轻松发布到Spotify的平台上。Spotify最终可能会出售这些节目的广告，那些可能已经以订阅的形式向公司支付费用的听众也会提供他们的数据，这些数据为Spotify的广告定向和购买决策提供了依据。\n它还准备成为播客风尚的引领者，由世界各地的策展人组织推荐播放列表；这可以帮助它向数百万用户推广自己的节目。对于绝大多数没有罗根的节目那么大的节目，Spotify提供了一个仪表盘来查看它们的分析，并了解更多关于观众的人口统计信息，这有助于它们销售自己的广告。创作者可能会受到激励，鼓励他们的听众在Spotify上消费，因为他们会更多地了解他们的观众。\n没有其他公司的运营规模和创新速度如此之快。苹果拥有这个平台，是iOS产品的默认玩家，但它还没有获得节目或销售广告。NPR制作了令人难以置信的节目，但它没有广受欢迎的播放器。就Spotify而言，仅经过一年半的努力，该行业现在就必须与迄今最具威胁性的竞争对手抗衡。\n这一切都引出了一个更大的问题，即Spotify的所有决定将如何影响更广泛的播客行业。Spotify对数据的完全控制和对广告定向的推动可能会导致一个世界，在这个世界里，播客广告更类似于网络广告，因为它们针对的是个人听众。这对一些人来说可能没有问题，但另一些人已经表达了对隐私影响的担忧。例如，收听播客的数据比音乐更敏感，因为人们收听关于潜在说明问题的利基节目。此外，人们可能最终不得不使用多个应用程序来收听他们最喜欢的节目，其中之一，必然是Spotify。\n就像我们在更广泛的网络上看到的人们根据他们的隐私来决定他们在哪里浏览或使用什么电子邮件或消息服务一样，播客也可能会发生同样的事情。播客曾经在所有平台上都是平等的，但现在似乎将会有两个播客世界：Spotify和其他所有人。", "note_en": "Skip to main content                                                                                                                In what’s likely the biggest deal ever for a single podcast, Spotify  announced this week that Joe Rogan’s enormously successful show,  The Joe Rogan Experience, will become a Spotify-exclusive. Combined with a blockbuster spree of other podcast acquisitions over the last year and a half, the company is now set up to become the biggest name in podcasting — and to possibly control podcasting in an unprecedented way.\n There’s never been a single podcasting company that sells ads, makes shows, has an already-popular podcast player, and offers the tools to make new series. Spotify now has all of that, and the Rogan deal means it also offers a hit show that guarantees millions of people will regularly use its platform for podcast listening.\n The deal also, however, might foreshadow a future for the broader podcasting industry in which two sects develop: one that values privacy and an open ecosystem and another that’s closed-off and built around locked-down shows and targeted ads, like Spotify.\n Fuck Spotify, and fuck any “podcast” that’s only playable in one app.\n— Marco Arment (@marcoarment)  May 19, 2020\n Spotify made its podcasting ambitions known last year with three key acquisitions. It  bought two podcast networks — Gimlet Media (known for  Reply All) and  Parcast (a true-crime and mystery network) — plus a company called Anchor that offers easy-to-use podcast creation tools. All together, Spotify reportedly spent around $400 million for the three companies combined.\n This year, Spotify continued to spend big on talent acquisitions. In February, Spotify  acquired  The Ringer and Bill Simmons’ flagship show, reportedly for around $196 million. And now there’s Rogan’s deal, which could reportedly cost Spotify more than $100 million. The team spent a lot of money all in an effort to lock down some of the industry’s top content and commit their series — and ads — to Spotify.\n Spotify sees a massive business opportunity around podcasts. For one, no single competitor can take the company on by itself. Apple, the biggest name in podcasting up until now, has mostly left Apple Podcasts alone, letting listeners freely come and go and allowing creators to upload their RSS feeds, without Apple trying to take a stake in them. Apple doesn’t make shows  right now, and it also doesn’t sell ads, which would go against its privacy-oriented position anyway. Spotify can own this space. Even if Apple wanted to compete, it now would have to find other big shows to acquire, and Spotify has a huge head start.\n  Even more importantly, though, these podcasts cost Spotify a lot of money up front but could pay off in the future. Whenever someone streams a song on its platform, it has to pay the record label for that listen. But with podcasts, the company doesn’t have to pay a third party. With exclusive deals and its own programming, it’s actually  making money off each listen because of the ads it places. Even premium users hear ads in Spotify podcasts, so Spotify double-dips with revenue in those cases.\n Podcasts could be lucrative, which is why even though it spent hundreds of millions of dollars on acquiring talent and tools for its platform, it’ll likely recoup that money. Midroll, another podcast ad network,  says advertisers can pay anywhere from $18 to $50 per 1,000 listeners that a show reaches. Joe Rogan says his show reaches 190 million downloads per month, meaning he could, on the low end, bring in $3 million in ads per month.  Forbes  says Rogan made $30 million last year.\n Rogan’s show will still be free to listen to on Spotify; people won’t need to pay for Spotify Premium to hear or watch it, although they will pay with their data, which helps Spotify sell more lucrative ads. Spotify will jointly sell the ads for Rogan’s show, so free users will hear those ads, plus any additional ads that run in the course of using Spotify’s platform. Spotify doesn’t need everyone to subscribe because it makes money off them either way.\n  Big names, like Rogan, might bring people to Spotify, but it’s a large show library that keeps them there. That’s also been part of Spotify’s strategy: offering podcast creation tools so more shows are made, and they pad its catalog. Spotify  says it now lists more than a million podcasts, and during the first quarter of 2020, 70 percent of shows were created with Anchor.\n On top of all these acquisitions and deals, Spotify has also created new tech for generating playlists and inserting ads. It  algorithmically generates podcast playlists and has launched its own advertising tool called  Streaming Ad Insertion that lets targeted ads be placed into shows as people stream them, which, again, relies on that critical user data. It  launched video podcasts in-app, which might sway some of YouTube’s popular podcasters over to its platform — if not exclusively, at least to cross-publish, to further round out Spotify’s offerings.\n All of these moves allow Spotify to control the entire podcasting process from start to finish. Podcasters can make shows with Spotify tools and publish easily to Spotify’s platform. Spotify could eventually sell ads for those shows, and listeners who might already give the company money in the form of a subscription also offer up their data, which informs Spotify’s ad-targeting and purchase decisions.\n   It’s also setting itself up to become a podcast tastemaker with curators around the world  organizing recommendation playlists; this could help it promote its own shows to its millions of users. For the vast majority of shows that aren’t as big as Rogan’s, Spotify  offers a dashboard to view their analytics and learn more about their audience’s demographics, which helps them sell their own ads. Creators might be incentivized to encourage their listeners to consume on Spotify because they’ll learn more about their audience.\n No other company is operating at this scale and with innovation this quick in the space. Apple has the platform and is the default player for iOS products, but it hasn’t acquired shows or sold ads. NPR makes incredible shows, but it doesn’t have a massively popular player. After only a year and a half of effort on Spotify’s part, the industry now has to contend with its most threatening competitor yet.\n This all leads to the bigger question of how all of Spotify’s decisions will affect the broader podcasting industry. Spotify’s complete control over data and its push for ad targeting might lead to a world in which podcast ads more closely resemble web ads in that they’re targeted to individual listeners. That might be okay with some people, but others have already expressed concerns over the privacy implications. Listening data for podcasts is more sensitive than music, for example, because people listen to niche shows about potentially telling topics. Plus, people might end up having to use multiple apps to hear their favorite shows, and one of those, by necessity, might be Spotify.\n Just as we’ve seen people on the broader web make decisions about where they browse or what email or messaging service they use based on their privacy, the same thing might happen with podcasting. Podcasting was once equal across all platforms, but it now seems like there will be two podcast worlds: Spotify versus everybody else.", "posttime": "2020-05-22 16:24:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "播客,世界,world,spotify", "title": "播客世界现在是Spotify而不是其他任何人", "title_en": "The Podcasting World Is Now Spotify versus Everybody Else", "transed": 1, "url": "https://www.theverge.com/21265005/spotify-joe-rogan-experience-podcast-deal-apple-gimlet-media-ringer", "via": "", "real_tags": ["播客", "世界", "world", "spotify"]}, {"category": "", "categoryclass": "", "imagename": "4eece4cf7f10be4be571a43e8c8340c4.jpg", "infoid": 1003247, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加利福尼亚州核桃溪。(KGO)--核桃溪约翰·缪尔医疗中心的医生说，在这段隔离期内，他们看到的自杀死亡人数超过了死于冠状病毒的人数。观看：你的心理健康：旧金山湾区的对话，虚拟市政厅谈论冠状病毒对精神健康的影响创伤部门的负责人认为精神健康正遭受如此严重的折磨，是时候结束原地避难令了。迈克·德博伊斯布兰克博士说：“就我个人而言，我认为现在是时候了。”他说：我认为，最初设立这个(就地避难所命令)是为了拉平曲线，确保医院有资源照顾COVID患者。我们目前有资源做到这一点，而我们的其他社区卫生正受到影响。他说，这个数字是史无前例的。他说：在这么短的时间内，我们从未见过这样的数字。我的意思是，在过去的四周里，我们已经目睹了相当于一年的自杀未遂事件。凯西·汉森已经在核桃溪的约翰·缪尔医疗中心当了将近33年的创伤护士。她很担心，因为他们不仅看到了更多的自杀企图，她说他们无法像往常一样拯救那么多的病人。相关：在心理健康问题上寻求帮助，汉森说，我最近看到的是我以前从未见过的。我从来没有见过如此多的故意伤害。创伤团队之所以站出来，是因为他们希望社区能够意识到，让人们伸出援手，相互支持，让那些遭受痛苦的人知道他们可以得到帮助。John Muir Health周四晚些时候向ABC7发表了一份声明，称该组织作为一个整体支持旧金山湾区的就地避难所秩序。John Muir Health一直并将继续支持Contra Costa县卫生服务部门为防止冠状病毒传播而实施的“就地避难所令”。我们意识到在这个问题上有许多意见，包括在我们的医务人员内部，John Muir Health鼓励我们的医生和工作人员建设性地参与这些讨论。无论是冠状病毒、精神健康、蓄意暴力或其他问题，我们都同样关注我们社会的健康。我们继续与我们的行为健康中心、县健康和社区组织积极合作，提高人们对精神健康问题的认识，并为任何有需要的人提供资源。如果您身处危机，需要立即帮助，请立即拨打电话或发短信至20121。我们都是同舟共济的人，请社会各界在这个充满挑战的时刻，向任何你认为可能需要帮助的人伸出援手。谢谢。康特拉·科斯塔县危机中心有辅导员可以一周七天、每天24小时接听他们的热线电话。这次通话是免费的，而且是保密的。这位执行董事表示，拨打1-800-273-Talk可以产生巨大的不同。执行董事汤姆·田村(Tom Tamura)说，一般来说，绝大多数人表示，在打电话并获得所需的资源后，他们感觉好多了。有了帮助，就有了希望。我认为你可以联系到一些人和组织，他们可以为你提供你需要的信息和资源，帮助你度过这段艰难的时期。他说，打到他们热线的电话有所增加，但不是很明显。他认为这可能是因为人们没有看到他们通常的支持网络。这就是打电话的鼓励之处。独家报道：罗宾·威廉姆斯(Robin Williams)之子扎克(Zak)敞开心扉，讲述了在冠状病毒大流行期间的宣传工作。我认为人们发现自己与他们拥有的正常支持网络脱节，教堂、学校和读书会，随便你能说出什么，田村说。再加上一些咨询服务的关闭，人们可能受到了些许冲击。他们试图安然度过这场风暴，但随着这种孤立的加剧，人们开始意识到这不是一场短跑，而是一场马拉松。他说，对我们所有人来说，向人们伸出援手、建立联系是很重要的。汉森说，如果面对面的会议有助于心理健康，那就更好了。她说，六英尺外，戴上口罩，洗手进去，不要触摸，你可以看到人们安全地保持社交距离。汉森说，关注精神健康是非常重要的，对吧，他们打算死去，汉森说。有时，人们会做出我们所说的手势。这是一种呼救。我们现在看到的情况与此略有不同。这令人心烦意乱。汉森和德博伊斯布兰克说，他们看到大部分年轻人死于自杀。他们担心隔离和失业会带来的压力，因为隔离还在继续。如果您或您认识的人需要帮助，请拨打1", "note_en": "WALNUT CREEK, Calif. (KGO) -- Doctors at John Muir Medical Center in Walnut Creek say they have seen more deaths by suicide during this quarantine period than deaths from the  COVID-19 virus.   WATCH:  &#39;Your Mental Health: A Bay Area Conversation,&#39; virtual town hall addressing COVID-19 impact on mental health  The head of the trauma in the department believes mental health is suffering so much, it is time to end the shelter-in-place order.   &#34;Personally I think it&#39;s time,&#34; said Dr. Mike deBoisblanc. &#34;I think, originally, this (the shelter-in-place order) was put in place to flatten the curve and to make sure hospitals have the resources to take care of COVID patients.We have the current resources to do that and our other community health is suffering.&#34;  The numbers are unprecedented, he said.  &#34;We&#39;ve never seen numbers like this, in such a short period of time,&#34; he said. &#34;I mean we&#39;ve seen a year&#39;s worth of suicide attempts in the last four weeks.&#34;  Kacey Hansen has worked as a trauma nurse at John Muir Medical Center in Walnut Creek for almost 33 years. She is worried because not only are they seeing more suicide attempts, she says they are not able to save as many patients as usual.   RELATED:  Get help with mental health issues  &#34;What I have seen recently, I have never seen before,&#34; Hansen said. &#34;I have never seen so much intentional injury.&#34;  The trauma team is speaking out because they want the community to be aware, for people to reach out and support each other and for those who are suffering to know they can get help.  John Muir Health provided a statement to ABC7 late Thursday, saying the organization as a whole is supportive of the shelter-in-place order in the Bay Area.   &#34;John Muir Health has been, and continues to be, supportive of the Shelter-in-Place order put in place by Contra Costa County Health Services to prevent the spread of COVID-19. We realize there are a number of opinions on this topic, including within our medical staff, and John Muir Health encourages our physicians and staff to participate constructively in these discussions. We all share a concern for the health of our community whether that is COVID-19, mental health, intentional violence or other issues. We continue to actively work with our Behavioral Health Center, County Health and community organizations to increase awareness of mental health issues and provide resources to anyone in need. If you are in a crisis and need help immediately, please call 211 or 800-833-2900 or text &#39;HOPE&#39; to 20121 now. We are all in this together, and ask the community to please reach out to anyone who you think might be in need during this challenging time. Thank you.&#34;  The Contra Costa County Crisis Center has counselors available to answer their hotline 24 hours a day, seven days a week. The call is free and confidential.  The executive director says a call to the 1-800-273-TALK can make a huge difference.   &#34;Generally speaking the vast majority of people say they feel better after they call and get the resources they need,&#34; said Executive Director Tom Tamura. &#34;With help comes hope. I think that there are people and organizations out there that you can contact that can get you the information you need and resources you need to get you through this tough time.&#34;  He said calls to their hotline are up, but not dramatically.  He thinks that could be because people aren&#39;t seeing their usual network of support. That is where the encouragement to make a phone call can come from.   EXCLUSIVE:  Robin Williams&#39; son, Zak, opens up about mental health struggles, advocacy work amid COVID-19 pandemic  &#34;I think people have found themselves disconnected from the normal supportive networks that they have, churches and schools and book clubs, you name it,&#34; Tamura said. &#34;And that, coupled with the closure of some counseling services, people were maybe in a little bit of shock.They were trying to weather the storm a bit but as that isolation has grown people have come to realize this isn&#39;t a sprint it is marathon.&#34;  He says it&#39;s important for all of us to be reaching out to people and making connections.  Hansen says in-person meetings are even OK if it will help mental health.  &#34;Six feet away, wear a mask, wash your hands going in, don&#39;t touch, you can see people socially distancing safely,&#34; she said.   Hansen says a focus on mental health is very important right &#34;They intend to die,&#34; Hansen said. &#34;Sometimes, people will make what we call a &#39;gesture&#39;. It&#39;s a cry for help.We&#39;re just seeing something a little different than that right now. It&#39;s upsetting.&#34;  Hansen and deBoisblanc say they are seeing mostly young adults die by suicide.They are worried about the stress that isolation and job loss can bring as this quarantine continues.  If you or someone you know needs help, call 1-800-273-TALK. Or if you can&#39;t remember that number, 211 can get you to the resource you need.   RELATED:  Coronavirus Doctor&#39;s Note: Shining a light on mental illness  The shelter-in-place order is currently set to expire at 11:59 p.m. on May 31.  Contra Costa Health Services released a statement in response to the trauma team at John Muir Medical Center.   &#34;We strongly encourage everyone in distress to seek help from mental health professionals and local resources such as 211 (the Crisis Center),&#34; the statement read. &#34;We understand that this is a very difficult time for many people and it can feel very isolating to practice social distancing. We want to stress that the shelter-in-place order is saving lives at the same time. It&#39;s not uncommon for medical professionals can have differing opinions on courses of treatment for many health issues. The Shelter-in-Place order is no different. We will continue to look to the science of our identified indicators as we determine how best to move forward.&#34;    RELATED STORIES &amp; VIDEOS:", "posttime": "2020-05-22 15:56:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "旧金山,湾区,专业人士,rise,人们", "title": "旧金山湾区医疗专业人士表示，在在家工作的订单中，自杀人数不断上升", "title_en": "Suicides on the rise amid stay-at-home order, Bay Area medical professionals say", "transed": 1, "url": "https://abc7news.com/suicide-covid-19-coronavirus-rates-during-pandemic-death-by/6201962/", "via": "", "real_tags": ["旧金山", "湾区", "专业人士", "rise", "人们"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003246, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "例如：樱桃谷城际牵引公司总裁罗纳德·贝尔(A)和爱贝尔女儿的年轻人罗伯特·霍利(B)就后者的西装发生了激烈的争执，并怒气冲冲地分手了(28)。贝尔找到在公司办公室工作的女儿娜塔莉(C)，命令把她的豪华轿车从她身边带走，命令她(29)每天下班步行回家，这辆车将载她沿着牵引线，穿过红岩隧道。霍莉出去鼓动罢工，在30岁时开始罢工。(罢工，作为一种可终止的、可创造的、可偏离的和偏离的东西，可以起到情节主线的作用。女孩(C)步行回家，穿过一条又短又黑的隧道，就在一辆重型城际汽车向她逼近的时候，她的脚被隧道里的一只青蛙卡住了；由于罢工(发电厂突然停电)，她从死亡中幸免于难。[(a.)。故事、新闻故事、大气短篇小说或“朝圣者的进步”情节。]。大多数故事、新闻故事以及大气短篇小说都是这种结构，它们仅仅讲述了两个重大事件之间发生的各种事件；因此，也可以说是“朝圣者的进步”，在这部小说中，主角克里斯蒂安(A)解决了一个又一个问题，但除了按时间顺序外，它们与其他任何问题都没有任何特殊的关系。在不影响整体的连贯性的情况下，可以省略一个或几个。例如，克里斯蒂安与“巨人绝望”(B)的遭遇丝毫不影响他与“绝望沼泽”的斗争。或者，每一个的顺序甚至可以颠倒。[(b.)。冒险故事等]。案例十三-b出现在许多宝岛系列和寻宝故事，以及各种冒险故事中。寻宝双方(A和B)之间的各种遭遇(28，29，30，31，32)，先是尖锐地将天平抛给了一个人，然后又让另一个人保持了阅读能力。我特别记得A·E·丁格尔船长的“海盗女人”，这本书第一次出现在“奥戈斯”中，我买了它的第二个版权。对于我编辑的一本杂志来说，大体上是这样构建的：在某个岛屿上的许多相遇可以被省略，或者希望浓缩故事的编辑可以省略一条线索的几个片段，而另一条线索的相应抽搐(见图)，将破碎的部分连接在一起，本可以是一部中篇小说，而不是一本小说。(砖排情节，经常出现在短篇小说中。)。前面的第二个图(图19)将显示此模式，但示例必须不同，例如：例如：流浪汉电气线工David Lauriston(A)在一个名为Tippingdale的钢铁小镇遇到了女孩Myene Cary(B)，并受到激励，在工头弗格森(C)的带领下申请了一份钢铁厂的工作，弗格森派他去做一项危险的高压工作，涉及22000伏电压，还有一个恶棍助手Red McMcCary(B)，他被派往钢铁厂申请一份工作，领班弗格森(C)派他去做一项危险的高压工作，涉及22000伏电压，还有一个恶棍帮手Red McMc.。(D)需要他首先指示电力操作员老山姆·韦伯(E)保持某一高压电路打开。由于不确定韦伯的可靠性，他去找人寿保险代理人胡克(F)，胡克扫描了他的人寿保险申请，然后给了劳里斯顿一笔小费，这笔小费会把小费发给他失散已久的父亲蔡斯·劳里斯顿(Chase Lauriston，G)(图中没有显示)。你会注意到，这些事件就像一排倒置的砖块，一块砖向前倾倒时，另一块砖也会向前倾倒，从而一直倒到尽头。许许多多的短篇小说--甚至0。亨利都属于这种结构，虽然是0。亨利也使用了四边形。(Scheherzade情节，或伪网。)。案例十五的主要例子是“天方夜谭”，在“天方夜谭”中，Scheherzade(A)夜以继日地旋转着一个新的关系集合体，无论它们看起来多么像一张网，实际上只是一种树状的队形，有树干、树枝和树枝。它是这样做的，以至于提供了数百个简单的故事-真正的故事-尽管真正的故事一直都是谢赫扎德(A)自己的故事。现在我们已经完成了这些基本的情节组合。毫无疑问，就像在生物学领域一样，存在着这些运动和突变，以及新的元素组合本身，这些组合还没有诞生。然而，我现在想要做的是向你们展示大量的这些基本的组合混合在一起形成一个单一的网络剧情，讲述谁的故事和完整地呈现谁的关系需要104,000字。也许，最令人感兴趣的是，这个网络是如何开始的，以及其他同样大大小小的网络是如何以类似的方式开始的。在本系列的下一期中，基勒先生将触及主题的核心。他的一位公众人物", "note_en": "Example: Ronald Baer (A), president of the Cherry Valley Interurban Traction Company and Robert Holly (B), a young man who loves Baer&#39;s daughter, have a stormy argument about the latter&#39;s suit and break up in a rage (28). Baer goes to his daughter, Natalie (C), who works in the office of the company, and ordering her limousine taken away from her, commands her (29) to walk home each day from work, which will carry her along the traction line and through the Red Rock Tunnel. Holly goes out and agitates for a strike, bringing it under way at 30. (A strike, being a terminable, creatable, deviatable and deviating thing, can function as a plot thread. The girl (C) walking home, and going through the short dark tunnel, gets her foot caught in a frog inside of the tunnel just as a heavy interurban car is bearing down on her; and is saved from death (31) by the strike (sudden cessation of electricity from powerhouse).    [ (a.) The tale, news story, atmospheric short-story, or &#34;Pilgrim’s Progress&#34; plot.]      Most tales, also news stories, as well as atmospheric short-stories, which merely narrate the various incidents occurring between two vital incidents, are of this structure; so, also, may be said to be &#34;Pilgrim&#39;s Progress,&#34; in which Christian (A), the central character, solves one problem after another, but none has any particular relation toward any other except chronological. One or several could be omitted without detracting from the coherence of the whole. For instance, Christian&#39;s encounter (28) with the Giant Despair (B) does not in the least bear upon his struggle (29) with the Slough of Despond. Or, also, the order of each could even be reversed.    [ (b.) Adventure stories, etc.]      Case XIII-b is found in many treasure island serials and treasure-hunting stories, and adventure stories of all sorts. The various encounters (28, 29, 30, 31, 32) between the two parties (A and B) hunting the treasure throw the balance acutely first to one, and then to the other, keeping the reader &#34;set up.&#34; I particularly remember that &#34;The Pirate Woman,&#34; by Captain A. E. Dingle, which appeared first in  The Argosy, and of which I bought &#34;second rights&#34; for a magazine I edited, was thus constructed in the main: many of the encounters on a certain island could have been left out, or an editor wishing to condense the story could have dropped out several segments of the one thread and corresponding convulutions of the other thread (see diagram) and, joining together the broken parts, could have had a novelette instead of a novel.  (The Row-of-Bricks plot, frequently found in short-stories.)     The second previous figure, Figure 19, will show this pattern, but the example must be different, for instance:  Example: A tramp electrical lineman, David Lauriston (A), meets a girl, Myrene Cary (B), in a small steel town called Tippingdale, and is actuated to apply for a job in the steel mills, under a foreman Ferguson (C), who dispatches him out on a dangerous high-tension job involving 22,000 volts, with a villain helper, Red McAfee. (D), necessitating his first instructing a power operator, old Sam Webb (E), to keep a certain high-tension circuit open. Because of not being sure of Webb&#39;s reliability, he goes to a life insurance agent, Hooker (F), who, scanning his application for life insurance, is enabled to drop Lauriston a tip that sends the latter to his long-lost father, Chase Lauriston (G) (not shown in diagram).  You will note that the incidents are like a row of up-ended bricks, where one brick, in toppling forward, topples the next one forward, and thus through to the end. Many, many short-stories—even 0. Henry&#39;s—are of this structure; although 0. Henry also used the quadrangular polygon as well.    (The Scheherezade plot, or pseudo-web.)      The chief example of Case XV is &#34;The Arabian Nights&#34; where Scheherezade (A) spins, night after night, a new conglomeration of relationships which, however much they seem to resemble a web, are merely a sort of tree-like formation, with trunks, branches, and twigs.  It is so done as to provide hundreds of simple stories—really tales—although the real story all the time is that of Scheherezade (A) herself.  NOW we are done with these elemental plot combinations. No doubt, as in the field of biology, there are sports and mutations of these, as well as new elemental combinations themselves which have never yet been born. What I want to do now, however, is to show you a huge number of these elemental combinations blended together into a single web-work plot, the telling of whose story and the full presentation of whose relationships demanded 104,000 words. And what will be of most interest, perhaps, is how this web was started and how other webs, likewise, both small and large, may be started in a similar manner.  In the next installment of this series, Mr. Keeler reaches the heart of his subject. One of his popular mystery novels, published both in America and abroad, &#34;The Voice of the Seven Sparrows,&#34; will be diagrammed and analyzed. The method by which it was built up will be shown step by step.\n    A TRUE web-work plot consists of a plot structure in which many or all of the 15, Elemental Plot Combinations described in part III appear combined and recombined one with the other and all, of course, in the same narrative.  On pages 18 and 19 of this issue of THE AUTHOR &amp; JOURNALIST appears  a complete diagram or graph of the mystery novel &#34;The Voice of the Seven Sparrows&#34; (by Harry Stephen Keeler) which appeared serially on both sides of the Atlantic and likewise as a book on both sides, being issued by Hutchinson and Company of London and E. P. Dutton and Co., of New York.  Our diagram, as seen in the black numbered spots (the unnumbered crossings of threads do not count; they are merely due to our having to use a sheet of paper to represent characters moving three-dimensionally) emphasizes that the novel contains 80 markedly deviative incidents which change the destiny or course of one or all of the participants therein, either immediately or subsequently.  We also find that the novel contains 34 plot threads—some active, some passive—of which 18 figure in the plot both antecendent to the opening of the actual narrative, as published, and the course of the narrative itself 7 appear only in the antecendent conditions; and 9 appear only in that portion of the plot which develops after the story has opened.  It will be seen (by the typewritten scale at the top of the graph) that the plot structure lying back (to the left) of the opening of the story (39) covers 500 years from the incident (1) which serves as an opening gun for the creation of the plot. It will likewise be noted that once the story opens (39) it requires from then to the close (80) exactly 4 days 15 1/2 hours.  It might be of interest also to note that one plot thread consisting of two steel garden spades (entering 17 from 14, and thence into 18) is carried from 18 to 35 as an idea only, which at 35 is transmogrified by one of the villains into a symbol or deuce of spades; indeed, into a great number of such!  It may be noted from the graph alone that several incidents—notably No. 17, a wreck on the Pacific—deviates 5 vital characters into 5 channels, different from those they were already in. presenting thus a quintuple variation of Elemental Plot Combination No. X.  Just as one plot thread was, for part of its course, an idea, so does another plot thread consist of a purely abstract conception, namely the Chinese game of Yeng-San, which, changing the destiny of humans and itself being changed and affected by outside factors (i. e. being banned by the Chinese government) constitutes a thoroughly conventional plot thread.  It will also be noted that the heavy black line represents not only the &#34;viewpoint character,&#34; Absalom Smith, the hero, but the story itself. The events are viewed through his eyes, and the reader as a rule has no cognizance of what has taken place elsewhere until Absalom Smith, in some certain incident, learns of it.  In the key to the graph (in small type below) the opening incident of the narrative, number 39, is given the bold-face letter A to indicate that it is the first to be brought under the reader&#39;s scrutiny. The incidents thereafter, as they actually take place before the eyes of the reader, are in turn lettered B, C, D, etc. The unlettered incidents lie outside of the viewpoint character&#39;s progress, and are brought to his (and the reader&#39;s) attention only indirectly, through the mouths of others, or by direct abortive lapses from viewpoint.  The chart does not show at what exact point in the story a character becomes aware of an old incident in the plot; that is, while I can show how in actual time Beatrice Mannerby&#39;s creation of the spurious Ng Yat newspaper story (30) occurs two months prior to the opening of the narrative, I cannot show how Absalom Smith, the hero, learns of her little bit of feminine ingenuity only almost at the end of the narrative, i. e. in incident 75, where Beatrice, now technically under arrest, tells what she did. But I will endeavor later to give a principle or two covering this ever-present problem of story presentation.    BEFORE going briefly into the specific matter of how all web-works are started, including this one, it might be well to preface such a question with a few remarks as to the philosophy and general methods of such composition.  In the first place, why a web-work anyway?  Is not the following explanation of it wholly acceptable? Aside from normal interest in dramatic happenings, is it not true that in every human being is a longing—an instinctive hunger—to believe that life, in its great complexity and utter meaningless involvements,  does move in a regulated manner; that it is not all incoherent, all mixed up and utterly without pattern, but that the whole thing is mathematically accurate in its causes and effects? We see it proved frequently in small limited relationships and we often call such proof &#34;poetic justice.&#34;  But on the large stage represented by years, oceans, continents, and infinite numbers of reactions between people, the thing is not so susceptible of proof.  Life, on the larger scale, though full of effects which are the direct results of causes, is apparently plotless. It is too complex. There has never yet appeared in life a causal relationship involving even 80 incidents and 34 strands that can be as unified as one artificially created. And it is this artificial relationship, this purely fictional web-work plot, this bit of fife twisted into a pattern mathematically and geometrically true, that fills the gaps in one&#39;s spirit which rebels at the looseness of life as it apparently is.  &#34; Should one aim for plot or for story?&#34; I give you this answer: The author should imagine himself as possessing, so to speak, a near-sighted eye and a far-sighted eye. The near-sighted eye should watch the developments being built into the story and concentrate on its job, for this is the story which the reader is going to follow before the curtain begins to lift and show him the web-work plot back of it all. But all the time the far-sighted eye must be watching two things: First, will the developments in the story help to weave a more structurally satisfying plot? Second, will the plot as thus far built help to provide interesting developments (in the story) for the nearsighted eye to concentrate upon?  Naturally a change in story may necessitate a change in plot, or vice versa; with every change, some distortion of the whole structure may take place. The web-work at times literally seems to quiver like a sea of jelly. Every tap of the hammer makes a dozen changes necessary. But gradually as both the story and plot develop together, it becomes more and more stable, till finally it is  as near perfect as it can be made.  The story intrigues the editor, but the plot sells it to him.    THERE is, sticking forth in every webwork plot, the crumbling relic of a preliminary structure that to the technician marks the initial simple structure—or move—from which the entire plot was created. And sometimes, too, this structure is so admirably preserved that the terrible seesawings and agonies of the plot-maker have not destroyed its pristine beauty and classic lines !  This brings us to a statement of a mental process which eleven years ago was first enunciated by this writer and was named by the publisher of THE AUTHOR &amp; JOURNALIST &#34;The Keeler Law.&#34; It was then stated in a form calculated by this writer to give it mathematical definiteness (and a headache to the non-mathematical) and because I am still hoping for some royalties from Mr. Emerson, owner of Bromo-Selzer, I will re-state it as it was stated in 1916. It ran, as I phrased it:    Because already I am beginning to feel shaky about the possibility of receiving those Bromo-Selzer royalties, or even a free bottle, I will re-state this &#34;law&#34; today, after eleven years, as the following simple rule:    In 1922 Arthur Sullivant Hoffman, in his &#34;Fundamentals of Fiction Writing,&#34; attacked the above stated law as &#34;the last word in formula.&#34; It is more than possible, of course, that Mr. Hoffman misconstrued the statement of the law as supposedly declaring that a plot must definitely be built in that way, rather than  that the mind must follow that formula only in initiating the plot. If he did not thus misconstrue it, my chief defense to his allegation that &#34;this is the last word in formula&#34; is that it has brought many thousands of dollars into my till; many books and magazine serials out under my name; and many hundreds of newspaper reviews in papers in America, the British Isles, New, Zealand, Australia, British India and South Africa. As editor for many years of a magazine devoted to adventure stories—and  Adventure was one of the most successful and profitable magazines ever issued, as well as one showing that a popular magazine may attain a real dignity—Mr. Hoffman has been confronted with plots that are prolongations of Elemental Cases II, III, XIIIa and XIIIb, and XIV, varied by entanglements here and there with one or another combination. Whereas the law I have stated refers to web-works. And if he will tell me how one may create a set of complicated yet correllated dramatic relationships without deriving them from an initial set already created, I will be glad to learn of it. If he can make of me furthermore sufficiently a gambler in a literary sense that I will work out a number of initial incidents in the optimistic hope that the rest of my plot will provide the entire compulsion for these incidents, he can invest me with a great deal of courage which I do not have: for when it comes to time and energy, I want—and so do you, I believe—in case invention fails and balks, as it so frequently does, to have the structure on which all else hangs sound in itself, able to stand on its own feet, depending on nothing and nobody for its compulsion.  But let us get down to examples. You may, as time goes on, watch all stories. For the present, the closest story at hand is the one that has been graphed and to which there is a printed key on page 18.    IF you will note carefully, Absalom Smith. the hero, is brought successively and quite early in the narration, into an encounter with six or seven other characters of some importance in the structure. Each of the first incidents brings him into relation with a new (to the reader) character. In No. 39 he receives a $1000 offer, subject to certain provisions, from  Snell, City Editor of the Argus; in No. 40, he visits  Monte van Tine, a young clubman; in No. 41 he has an encounter with  &#34;Sam Barker,&#34; his enemy, on the steps of the Argus, in which he foolishly drops a hint that he has an inside tip to things. In No. 42, he calls on  Ambrose Smith, his brother, to try to get a loan to reach New Orleans and follow his tip; in No. 43,  his father gives him everything he has in the world to reach New Orleans; in 44 he calls on  Albert Wick, an acquaintance, to make certain arrangements about his mail. In No. 45 he receives a (supposed)  photograph of Beatrice Mannerby whom he is trying to locate. Thus, one after another, his path has been made (by the author) to cross the paths of a number of very actively functioning factors in the plot, and also a few which proved (for the author) to be nearly &#34;duds.&#34; Yet had the author not made these crossings, he would not have had even the nucleus of this web. And the philosophy of these early crossings is—or should be—obvious. It is necessary (in initiating the plot) that the viewpoint character make a number of rapid crossings with other characters or threads, so that they may be gotten into the network—so that the author may begin to weave! Just so sure as the strands are kept down by not sufficient crossings in the beginning, there is nothing to weave with—or else the web-work will be no more complex than the pigtail down a little Dutch girl&#39;s back. In this story (the serial form) the narration opens in the first paragraph establishing Absalom Smith&#39;s point of view. In the next six hours, seven incidents involving him take place, each introducing a different character or object. Thus and thus only is thrown into existence a set of strands by which the weaving of that which is to lie ahead of the story is to take place, and also that which is to follow. I was many years discovering this fact, but only a few days in discovering the philosophy of it. I have found that unless one deliberately projects a number of characters in quick succession into a story, one will flounder helplessly in trying to build up a web-work.  It should be emphasized here, however, and before we proceed a step further, that in the final manuscript, as completed by the author, the narrative may not necessarily open at the point where this preliminary invention or row-of-bricks &#34;trial plot&#34; was begun, even if this original row-of-bricks structure has remained unchanged, as so frequently happens. The opening curtain may ultimately be placed back of all this, or it may be placed midway in it, in which case some of the incidents in this row-of-bricks plot will lie in the &#34;conditions precedent.&#34;  But we will later clarify all these points of a highly important principle, by actual demonstration.    Why, someone asks, must each incident in this preliminary half dozen be a direct resultant of the previous incident? That is because at this point there is no fully developed set of incidents back of the &#34;weaving board&#34; (the opening of the story) from which any of these early incidents may be derived by the process of invention; nor is there any later plot either. It is, in fact, from this early &#34;invention&#34; that all else is woven, to the left, to the right. Therefore it must stand on its own feet, since it supports the webwork, not the webwork it; and since it may prove impossible to derive any of its incidents from the portion of the plot that covers &#34;conditions precedent.&#34;  In &#34;The Voice of the Seven Sparrows,&#34; tracing up this causation and comparing it with certain crude notes and diagrams on pieces of manilla paper still in the author&#39;s possession, it appears that only two incidents were re-derived: that is, the original plot notes show that the young newspaperman gets the offer (39) ; to try and make a loan, he goes to his friend, the young clubman who gives him the tip and the story of how he was doublecrossed in lieu of a loan (40) ; therefore he goes to the villain to have it out (41) ; having in his anger dropped a tip to the villain he goes reluctantly to his successful and sarcastic brother to make the lo\n......", "posttime": "2020-05-22 15:56:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "情节,kinematics", "title": "网络情节构建的力学(和运动学)(1927年)", "title_en": "The Mechanics (and Kinematics) of Web-Work Plot Construction (1927)", "transed": 1, "url": "http://spinelessbooks.com/keeler/mechanics/index.html", "via": "", "real_tags": ["情节"]}, {"category": "", "categoryclass": "", "imagename": "3ab961c60726e4c087cf73b74e878830.jpg", "infoid": 1003245, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "JAMStack(Javascript，API and Markup Stack)是一个围绕制作Web项目的新方式的术语，在这种方式下，您不必托管自己的后端来构建站点，而是在构建时呈现一组静态页面，并将它们部署到内容交付网络(CDN)。这意味着更好的安全性、更高的可扩展性和更好的网站性能。\n在本教程中，您将学习如何使用Nuxt.js构建一个JAMStack多语言博客，Nuxt.js是一个强大的Vue框架，支持SPA、SSR和静态生成的渲染，与Strapi Headless CMS一起存储数据并公开它们以生成静态博客。要在本地设置STRIPI，您可以遵循本指南，否则您可以使用在我们的服务器https://strapi.lotrek.net/.上运行的只读实例。\n使用Strapi，我构建了一个朴素的结构来支持翻译，其中的Post表包含链接到一个或多个包含翻译的TransPost元素的元素。\n_|POST||TRANS_POST|=||已发布||语言||Created_At|&lt；--(1)-(N)--&gt；&gt；|标题|内容|slug|=。\n你可以使用GraphQL游乐场来玩它，并探索后端。请记住，本教程的重点是Nuxt.js，您可以使用任何想要生成最终静态站点的后端。\n记住选择axios选项(您稍后会用到它)并添加一个UI框架，比如Buefy。\n并在services文件夹下创建index.js文件来包装所有查询。此客户端应实现3种方法：\ngetAllPosts：获取特定语言的所有帖子，显示其他语言的slug、标题、内容和其他帖子的slug，以获取备用URL。\ngetSinglePost：获取具有特定插件和语言的单个帖子，以其他语言显示所有属性和帖子。\n从Apollo-Fetch导入{createApolloFetch}导出默认类BlogClient{structor(){this。apolloFetch=createApolloFetch({uri：`${process.。环境。NUXT_ENV_BACKEND_URL}/raphql`})}getAllPostsHead(Lang){const allPostsQuery=`query AllPosts($lang：string！){transPosts(where：{lang：$lang}){slug title}}`返回此参数。apolloFetch({query：allPostsQuery，Variables：{lang}})}getAllPosts(Lang){const allPostsQuery=`query AllPosts($lang：string！){transPosts(where：{lang：$lang}){slug title content post{Publisher transPosts(where：{lang_ne：$lang}){slug lang}`返回此参数。apolloFetch({query：allPostsQuery，Variables：{lang}})}getSinglePost(slug，lang){const simplePostQuery=`查询发布($slug：string！，$lang：string！){transPosts(where：{slug：$slug，lang：$lang}){slug标题内容POST{发布的transPosts(其中：{lang_ne：$lang}){slug。apolloFetch({query：simplePostQuery，变量：{slug，lang}})}}。\n要使BlogClient在您有权访问上下文时可用(例如，在asyncData函数中)，请创建plugins/ctx-inject.js文件。\n从&#39；~/services&#39；导入BlogClient导出默认值({app}，Inject)=&gt；{app.。$blogClient=new BlogClient()}。\n这个博客的结构将非常简单，在主页(/)中会有一个帖子列表和一个阅读文章的链接(/blog/&lt；postslug&gt；)。现在您可以从上下文访问BlogClient实例了，现在开始重写主页组件(Pages/index.vue)，以使用名为asyncData的特殊方法获取博客帖子，并为每个帖子呈现标题和链接。asyncData接收上下文作为第一个参数，并且可以通过context.app.$blogClient访问您的BlogClient实例。\n&lt；template&gt；&lt；Section class=&#34；&gt；&lt；div class=&#34；is-mobile&#34；&gt；&lt；div v-for=&#34；帖子&#34；：key=&#34；post.slug&#34；&gt；&lt；h2&gt；{{post.title}}&lt；/H2&gt；&。博客-slug&#39；，params：{slug：post.slug}}&#34；&gt；阅读更多.。&lt；/nuxt-link&gt；&lt；/div&gt；&lt；/div&gt；&lt；/Section&gt；&lt；/template&gt；&lt；脚本&gt；导出默认值{name：&#39；主页&#39；，异步异步数据({app}){const postsData=等待APP。$blogClient。getAllPostsHead(&#39；EN&#39；)返回{Posts：postsData。数据。transPosts}}，data(){return{post：[]}&lt；/script&gt；\n添加/blog/&lt；postslug&gt；route，创建组件blogpost(page/blog/_slug.vue)。安装Vue Markdown组件以正确呈现文章(纱线添加Vue-markdown)。\n&lt；模板&gt；&lt；Section class=&#34；&gt；&lt；div class=&#34；is-mobile&34；&gt；&lt；h2&gt；{{post.title}}&lt；/h2&gt；&lt；vue-markdown&gt；{{post.content}}&lt；/vue-markdown&gt；&lt；/div&。脚本&&gt;导出默认值{name：&#39；blogpost&#39；，组件：{&#39；vue-markdown&#39；：VueMarkdown}，异步异步数据({app，route}){const postsData=等待APP。$blogClient。getSinglePost(路由。参数。slug，&#39；en&#39；)返回{POST：postsData。数据。transPosts[0]}}，data(){return{post：null}&lt；/script&gt；\n常量区域设置=[{code：&#39；en&#39；，iso：&#39；en-US&39；}，{code：&#39；es&#39；，iso：&#39；es-es&#39；}，{code：&#39；it&#39；it-IT&#39；}]const default_locale=&#39；en&#39；导出默认值{//.。I18N：{locales：locales，defaultLocale：default_locale，encodePath：false，vueI18n：{fall backLocale：default_locale，Messages：{en：{readmore：&#39；read more&#39；}，es：{readmore：&#39；Lee mass&#39；}，it：{readmore：&#39；leggi di pi？？&#39；}//.}。\n现在您可以修改主页组件了：在nuxt-link中，您应该使用localePath，并使用$t呈现翻译后的标签readmore。\n在asyncData中，您可以使用上下文的store.$i18n属性获取帖子列表，以获取当前语言。\n//.。异步异步数据({app，store}){const postsData=等待应用。$blogClient。getAllPostsHead(存储。1.18亿美元。区域设置)返回{POSTS：postsData。数据。TransPosts}}，//.。\n//.。异步异步数据({app，route，store}){const postsData=等待APP。$blogClient。getSinglePost(路由。参数。鼻涕虫，商店。1.18亿美元。区域设置)返回{POST：postsData。数据。TransPosts[0]}}，//.。\n&lt；template&gt；&lt；b-navbar-dropdown：label=&#34；$i18n.locale&#34；&gt；&lt；nuxt-link v-for=&#34；locale&#34；：key=&#34；locale.code&#34；class=&#34；navbar-item&#34；：to=&#34；switchLocalePath(locale.code)。/b-navbar-dropdown&gt；&lt；/template&gt；&lt；script&gt；export default{Computed：{availableLocales(){return this。1.18亿美元。地点。筛选器(区域设置=&gt；区域设置。代码！==这个。1.18亿美元。区域设置)}&lt；/script&gt；\n并将其包含在布局/default.vue中，以使其在导航栏中可用。此组件调用switchLocalePath以获取指向另一种语言的当前页面的链接。要使语言切换器使用动态路由，您需要使用store.dispatch设置blogpost组件中的slug参数。\n//.。异步异步数据({app，route，store}){const postsData=等待APP。$blogClient。getSinglePost(路由。参数。鼻涕虫，商店。1.18亿美元。地点)等待商店。派单(&#39；i18n/setRouteParams&#39；，对象。FromEntries(postsData.。数据。TransPosts[0]。发帖。转弯。map(el=&gt；[el.。朗，{鼻涕虫：EL。slug}])返回{POST：postsData。数据。TransPosts[0]}}，//.\n记住使用.env或直接(导出NUXT_ENV_BACKEND_URL=https://strapi.lotrek.net)并启动开发服务器)设置博客客户端使用的NUXT_ENV_BACKEND_URL环境变量。\nℹ生成页面✔生成/它/✔生成/ES/✔生成/✨在43.49秒内完成。\n正如您所看到的，不会生成动态路由，因为Nuxt.js不知道如何生成它们。要添加动态路由支持，您必须在nuxt.config.js中的Generate settings下实现routes函数，并返回一个包含您想要生成的路由和包含POST的有效负载的对象列表。\n从&#39；导入BlogClient。/services&#39；//.。导出默认值{//.。生成：{routes：async()=&gt；{const client=new BlogClient()let routes=[]let postsData=[]for(区域设置的常量区域设置){postsData=等待客户端。getAllPosts(区域设置。代码)ROUES=ROUTS。Concat(postsData.。数据。转弯。map((Post)=&gt；{return{route：`${locale.。code=DEFAULT_LOCALE？&#39；&#39；：&#39；/&#39；+区域设置。code}/blog/${post.。slug}`，有效负载：POST}}))}返回路由}}//.}。\n由于有效负载在上下文中可用，您可以重构blogpost组件中的asyncData函数，以从context.payload获得特定的帖子。\nconst getSinglePostFromContext=async({app，route，store，payload})=&gt；{if(Payload){return payload}const postsData=等待APP。$blogClient。getSinglePost(路由。参数。鼻涕虫，商店。1.18亿美元。区域设置)返回postsData。数据。transPosts[0]}导出默认值{name：&#39；blogpost&#39；，async asyncData(Context){const singlePost=await getSinglePostFromContext(Context)等待上下文。商店。派单(&#39；i18n/setRouteParams&#39；，对象。FromEntries(singlePost.。发帖。转弯。map(el=&gt；[el.。朗，{鼻涕虫：EL。slug}])return{post：singlePost}}，//.}。\nℹGenerating Pages✔Generated/it/✔Generated/ES/✔Generated/✔Generated/Blog/Hello-World✔Generated/it/Blog/Cao-mondo✨在33.82秒内完成。\n静态生成后您可以注意到的一个问题是，在客户端导航期间仍然会进行asyncData调用，这意味着外部API服务器应该在您的静态网站联机时运行(如果Strapi服务器关闭，您将无法获取&#34；消息)。这是一个已知的问题，Nuxt.js团队正在努力在下一个版本中支持nuxt生成的完全静态生成，目前您可以使用nuxt-payload-提取器插件。随一起安装\nconst getSinglePostFromContext=async({$axios，$payloadURL，app，route，store，payload})=&gt；{if(Payload){return payload}let postsData=null if(Process.。静态&amp；&amp；进程。客户端&amp；&amp；$payloadURL){postsData=等待$axios。$get($payloadURL(Route))返回postsData。post}postsData=等待应用程序。$blogClient。getSinglePost(路由。参数。鼻涕虫，商店。1.18亿美元。区域设置)返回postsData。数据。传输发布[0]}。\n异步异步数据({$axios，$payloadURL，app，route，store}){if(进程。静态&amp；&amp；进程。客户端&amp；&amp；$payloadURL){返回等待$axios。$get($payloadURL(Route))}const postsData=等待APP。$blogClient。getAllPostsHead(存储。1.18亿美元。区域设置)返回{POSTS：postsData。数据。传输发布}}。\n有时，您可能需要为动态路由配置一个自定义路径，例如，您可能希望为英语保留/blog/：slug path，为西班牙语保留/artículos/：slug route，为意大利语保留/titioli/：slug route。遵循nuxt-i18n文档，您必须在nuxt.config.js的i18n部分中指定这些路由。\nI18N{//.。parsePages：false，Pages：{&#39；blog/_slug&#39；：{it：&#39；/jotioli/：slug&#39；，es：&#39；/artículos/：slug&#39；，en：&#39；/blog/：slug&#39；}}，//.}。\n要使这些设置在I18N配置和生成函数中都可重用，请在单独的文件i18n.config.js中移动自定义路由。\n导出默认{Pages：{&#39；blog/_slug&#39；：{it：&#39；/jotioli/：slug&#39；，es：&#39；/artículos/：slug&#39；，en：&#39；/blog/：slug&#39；}。\n从&#39；导入i18nConfig。/i18n.config&#39；//.。导出默认值{//.。I18n：{locales：locales，defaultLocale：default_locale，parsePages：false，Pages：I18nConfig。页面，编码路径：FALSE，vueI18n：{fall backLocale：DEFAULT_LOCALE，//.}}，//.。\n路由：async()=&gt；{const client=new BlogClient()let routes=[]let postsData=[]for(区域设置的常量区域设置){postsData=等待客户端。getAllPosts(区域设置。代码)ROUES=ROUTS。Concat(postsData.。数据。转弯。map((Post)=&gt；{return{route：`${locale.。code=DEFAULT_LOCALE？&#39；&#39；：&#39；/&#39；+区域设置。代码}${i18nConfig。Pages[&#39；blog/_slug&39；][区域设置。代码]。更换(&#39；：slug&#39；，POST。slug)}`，有效负载：POST}})}}返回路线}\nℹGenerating Pages✔Generated/Blog/Hello-World✔Generated/it/Artioli/Cao-mondo✔Generated/ES/ARTículos/Hola-Mundo✔Generated/ES/✔Generated/it/✔Generated/✨在33.82秒内完成。\n在此存储库中，您可以看到本教程的完整代码，结果部署在Netlify CDN上，网址为https://eager-shockley-a415b7.netlify.app/.。Netlify是我最喜欢的服务之一，它为静态网站提供云托管，提供持续部署、免费SSL、无服务器功能等……。最后的代码向网站添加了一些缺失的功能，例如，它添加了作者支持，为了简单起见使用了这里省略的一些外部组件，并启用了项目的SEO选项来向页面添加元数据(参见nuxt-18n文档中的SEO部分)。\n最终代码中包含的另一个有用的东西是由Nuxt.js站点地图模块提供的站点地图。Sitemap很容易设置，因为它在默认情况下采用Generate.routes值，因此会自动包含动态路由。配置非常简单，只需在nuxt.config.js文件的模块数组部分的末尾添加@nuxtjs/sitemap。\n导出默认值{//.。站点地图：{hostname：base_url，gzip：true，i18n：default_locale}//.}", "note_en": "JAMStack (Javascript, APIs and Markup Stack) is a terminology around the new way of making web projects where you don’t have to host your own backend that builds the site every time you serve it, instead it renders out a set of static pages at build time and deploys them to a content delivery network (CDN). This means better security, increased scalability and improved website performance.\n In this tutorial you&#39;ll learn how to build a JAMStack multilanguage blog using  Nuxt.js, a powerful Vue framework that supports SPA, SSR and statically generated renderings in conjunction with  Strapi Headless CMS to store data and expose them to generate a static blog. To setup Strapi locally you can follow  this guide otherwise you can use a read only instance running on our server at  https://strapi.lotrek.net/.\n   With Strapi I built a naive structure to support translations with a  Post table containing elements linked with one or more  TransPost elements that contain translations\n ____________ ____________ | POST | | TRANS_POST | ============ ============ | published | | language | | created_at | &lt;--(1)-------(N)--&gt;&gt; | title | | | | content | | | | slug | ============ ============\n You can play with it using  GraphQL playground and explore the backend. Remember that the main focus of this tutorial is  Nuxt.js, you can use any backend you want to generate the final static site.\n    Remember to select  axios option (you&#39;ll need it later) and add a UI framework such as  Buefy.\n    and create  index.js file under  services folder to wrap all the queries. This client should implement 3 methods:\n getAllPosts: fetches all the posts in a specific language, showing  slug,  title,  content and the other posts slugs in other languages to get alternate urls.\n getSinglePost: fetch a single post with a specific slug and language, showing all the attributes and posts in other languages.\n import  {  createApolloFetch  }  from  &#39; apollo-fetch &#39; export  default  class  BlogClient  {  constructor  ()  {  this . apolloFetch  =  createApolloFetch ({  uri :  ` ${ process . env . NUXT_ENV_BACKEND_URL } /graphql`  })  }  getAllPostsHead  ( lang )  {  const  allPostsQuery  =  ` query AllPosts($lang: String!) { transPosts(where: {lang: $lang}) { slug title } } `  return  this . apolloFetch ({  query :  allPostsQuery ,  variables :  {  lang  }  })  }  getAllPosts  ( lang )  {  const  allPostsQuery  =  ` query AllPosts($lang: String!) { transPosts(where: {lang: $lang}) { slug title content post { published transPosts(where: {lang_ne: $lang}) { slug lang } } } } `  return  this . apolloFetch ({  query :  allPostsQuery ,  variables :  {  lang  }  })  }  getSinglePost  ( slug ,  lang )  {  const  simplePostQuery  =  ` query Post($slug: String!, $lang: String!) { transPosts(where: {slug : $slug, lang: $lang}) { slug title content post { published transPosts(where: {lang_ne: $lang}) { slug lang } } } } `  return  this . apolloFetch ({  query :  simplePostQuery ,  variables :  {  slug ,  lang  }  })  } }\n To make  BlogClient available whenever you have access to the context (e.g. in  asyncData function) create  plugins/ctx-inject.js file\n import  BlogClient  from  &#39; ~/services &#39; export  default  ({  app  },  inject )  =&gt;  {  app . $blogClient  =  new  BlogClient () }\n    The structure of this blog will be really simple, in the homepage ( /) there&#39;ll be a list of posts with a link to read the article ( /blog/&lt;postslug&gt;). Now that you can access the  BlogClient instance from the context, start rewriting the  HomePage component ( pages/index.vue) to fetch blog posts in a special method called  asyncData and render title and link for each post.  asyncData receives the  context as the first argument and your  BlogClient instance is accessible at  context.app.$blogClient\n &lt;template&gt;  &lt;section  class= &#34;section&#34; &gt;  &lt;div  class= &#34;is-mobile&#34; &gt;  &lt;div  v-for= &#34;post in posts&#34;  :key= &#34;post.slug&#34; &gt;  &lt;h2&gt;{{ post.title }} &lt;/h2&gt;  &lt;nuxt-link  :to= &#34;{name: &#39;blog-slug&#39;, params:{slug: post.slug}}&#34; &gt;Read more... &lt;/nuxt-link&gt;  &lt;/div&gt;  &lt;/div&gt;  &lt;/section&gt; &lt;/template&gt; &lt;script&gt; export  default  {  name :  &#39; HomePage &#39; ,  async  asyncData  ({  app  })  {  const  postsData  =  await  app . $blogClient . getAllPostsHead ( &#39; en &#39; )  return  {  posts :  postsData . data . transPosts  }  },  data  ()  {  return  {  posts :  []  }  } } &lt;/script&gt;\n Add  /blog/&lt;postslug&gt; route creating the component  BlogPost ( pages/blog/_slug.vue). Install  Vue Markdown component to render the article correctly ( yarn add vue-markdown)\n &lt;template&gt;  &lt;section  class= &#34;section&#34; &gt;  &lt;div  class= &#34;is-mobile&#34; &gt;  &lt;h2&gt;{{ post.title }} &lt;/h2&gt;  &lt;vue-markdown&gt;{{ post.content }} &lt;/vue-markdown&gt;  &lt;/div&gt;  &lt;/section&gt; &lt;/template&gt; &lt;script&gt; export  default  {  name :  &#39; BlogPost &#39; ,  components :  {  &#39; vue-markdown &#39; :  VueMarkdown  },  async  asyncData  ({  app ,  route  })  {  const  postsData  =  await  app . $blogClient . getSinglePost ( route . params . slug ,  &#39; en &#39; )  return  {  post :  postsData . data . transPosts [ 0 ]  }  },  data  ()  {  return  {  post :  null  }  } } &lt;/script&gt;\n       const  LOCALES  =  [  {  code :  &#39; en &#39; ,  iso :  &#39; en-US &#39;  },  {  code :  &#39; es &#39; ,  iso :  &#39; es-ES &#39;  },  {  code :  &#39; it &#39; ,  iso :  &#39; it-IT &#39;  } ] const  DEFAULT_LOCALE  =  &#39; en &#39; export  default  {  // ...  i18n :  {  locales :  LOCALES ,  defaultLocale :  DEFAULT_LOCALE ,  encodePaths :  false ,  vueI18n :  {  fallbackLocale :  DEFAULT_LOCALE ,  messages :  {  en :  {  readmore :  &#39; Read more &#39;  },  es :  {  readmore :  &#39; Lee mas &#39;  },  it :  {  readmore :  &#39; Leggi di più &#39;  }  }  }  }  // ... }\n Now you can modify the  HomePage component: in  nuxt-link you should use  localePath and render the translated label  readmore using  $t\n  In  asyncData you can fetch the posts list using the  store.$i18n attribute of  context to get the current language.\n // .... async  asyncData  ({  app ,  store  })  {  const  postsData  =  await  app . $blogClient . getAllPostsHead (  store . $i18n . locale  )  return  {  posts :  postsData . data . transPosts  } }, // ....\n  // .... async  asyncData  ({  app ,  route ,  store  })  {  const  postsData  =  await  app . $blogClient . getSinglePost (  route . params . slug ,  store . $i18n . locale  )  return  {  post :  postsData . data . transPosts [ 0 ]  } }, // ....\n  &lt;template&gt;  &lt;b-navbar-dropdown  :label= &#34;$i18n.locale&#34; &gt;  &lt;nuxt-link  v-for= &#34;locale in availableLocales&#34;  :key= &#34;locale.code&#34;  class= &#34;navbar-item&#34;  :to= &#34;switchLocalePath(locale.code)&#34; &gt; {{ locale.code }}  &lt;/nuxt-link&gt;  &lt;/b-navbar-dropdown&gt; &lt;/template&gt; &lt;script&gt; export  default  {  computed :  {  availableLocales  ()  {  return  this . $i18n . locales . filter ( locale  =&gt;  locale . code  !==  this . $i18n . locale )  }  } } &lt;/script&gt;\n and include it in  layouts/default.vue to make it available in the navbar. This component calls  switchLocalePath to get a link to the current page in another language. To make the language switcher working with dynamic routes you need to set the  slug parameter in  BlogPost component using  store.dispatch\n //... async  asyncData  ({  app ,  route ,  store  })  {  const  postsData  =  await  app . $blogClient . getSinglePost (  route . params . slug ,  store . $i18n . locale  )  await  store . dispatch (  &#39; i18n/setRouteParams &#39; ,  Object . fromEntries ( postsData . data . transPosts [ 0 ]. post . transPosts . map (  el  =&gt;  [ el . lang ,  {  slug :  el . slug  }])  )  )  return  {  post :  postsData . data . transPosts [ 0 ]  } }, //...\n  Remember to set  NUXT_ENV_BACKEND_URL environment variabile used by  BlogClient with .env or directly ( export NUXT_ENV_BACKEND_URL=https://strapi.lotrek.net) and launch the development server\n      ℹ Generating pages✔ Generated /it/✔ Generated /es/✔ Generated /✨ Done in 43.49s.\n as you can see dynamic routes are not generated, because Nuxt.js doesn&#39;t know how to generate them. To add dynamic routes support you have to implement  routes function under  generate settings in  nuxt.config.js and return a list of objects containing the  route you want to generate and the  payload containing the post.\n import  BlogClient  from  &#39; ./services &#39; // ... export  default  {  // ...  generate :  {  routes :  async  ()  =&gt;  {  const  client  =  new  BlogClient ()  let  routes  =  []  let  postsData  =  []  for  ( const  locale  of  LOCALES )  {  postsData  =  await  client . getAllPosts ( locale . code )  routes  =  routes . concat ( postsData . data . transPosts . map (( post )  =&gt;  {  return  {  route :  ` ${ locale . code  ===  DEFAULT_LOCALE  ?  &#39;&#39;  :  &#39; / &#39;  +  locale . code } /blog/ ${ post . slug } ` ,  payload :  post  }  }))  }  return  routes  }  }  //... }\n Since  payload is available in the  context, you can refactor asyncData function in  BlogPost component to get the specific post from  context.payload\n const  getSinglePostFromContext  =  async  ({  app ,  route ,  store ,  payload  })  =&gt;  {  if  ( payload )  {  return  payload  }  const  postsData  =  await  app . $blogClient . getSinglePost (  route . params . slug ,  store . $i18n . locale  )  return  postsData . data . transPosts [ 0 ] } export  default  {  name :  &#39; BlogPost &#39; ,  async  asyncData  ( context )  {  const  singlePost  =  await  getSinglePostFromContext ( context )  await  context . store . dispatch (  &#39; i18n/setRouteParams &#39; ,  Object . fromEntries ( singlePost . post . transPosts . map (  el  =&gt;  [ el . lang ,  {  slug :  el . slug  }])  )  )  return  {  post :  singlePost  }  },  // ... }\n  ℹ Generating pages✔ Generated /it/✔ Generated /es/✔ Generated /✔ Generated /blog/hello-world✔ Generated /it/blog/ciao-mondo✨ Done in 33.82s.\n    A problem you can notice after static generation is that  asyncData calls are still made during client-side navigation, which means that an external API server should run while your static website is online (if Strapi server is down you&#39;ll get &#34;Failed to fetch&#34; message). This is a known problem and Nuxt.js team is working to  support full static generation for nuxt generate in the next version, for now you can use  nuxt-payload-extractor plugin. Install it with\n     const  getSinglePostFromContext  =  async  ({  $axios ,  $payloadURL ,  app ,  route ,  store ,  payload  })  =&gt;  {  if  ( payload )  {  return  payload  }  let  postsData  =  null  if  ( process . static  &amp;&amp;  process . client  &amp;&amp;  $payloadURL )  {  postsData  =  await  $axios . $get ( $payloadURL ( route ))  return  postsData . post  }  postsData  =  await  app . $blogClient . getSinglePost (  route . params . slug ,  store . $i18n . locale  )  return  postsData . data . transPosts [ 0 ] }\n  async  asyncData  ({  $axios ,  $payloadURL ,  app ,  route ,  store  })  {  if  ( process . static  &amp;&amp;  process . client  &amp;&amp;  $payloadURL )  {  return  await  $axios . $get ( $payloadURL ( route ))  }  const  postsData  =  await  app . $blogClient . getAllPostsHead (  store . $i18n . locale  )  return  {  posts :  postsData . data . transPosts  } }\n  Sometimes you may need to configure a custom path for a dynamic route, for example you may want to keep  /blog/:slug path for english,  /artículos/:slug route for spanish and  /articoli/:slug route for italian. Following nuxt-i18n documentation you have to specify these routes in  i18n section of  nuxt.config.js\n i18n  {  // ...  parsePages :  false ,  pages :  {  &#39; blog/_slug &#39; :  {  it :  &#39; /articoli/:slug &#39; ,  es :  &#39; /artículos/:slug &#39; ,  en :  &#39; /blog/:slug &#39;  }  },  // ... }\n To make these settings reusable both in  i18n configuration and  generate function, move custom routes in a separated file  i18n.config.js\n export  default  {  pages :  {  &#39; blog/_slug &#39; :  {  it :  &#39; /articoli/:slug &#39; ,  es :  &#39; /artículos/:slug &#39; ,  en :  &#39; /blog/:slug &#39;  }  } }\n  import  i18nConfig  from  &#39; ./i18n.config &#39; // ... export  default  {  // ...  i18n :  {  locales :  LOCALES ,  defaultLocale :  DEFAULT_LOCALE ,  parsePages :  false ,  pages :  i18nConfig . pages ,  encodePaths :  false ,  vueI18n :  {  fallbackLocale :  DEFAULT_LOCALE ,  // ...  }  },  // ...\n  routes :  async  ()  =&gt;  {  const  client  =  new  BlogClient ()  let  routes  =  []  let  postsData  =  []  for  ( const  locale  of  LOCALES )  {  postsData  =  await  client . getAllPosts ( locale . code )  routes  =  routes . concat ( postsData . data . transPosts . map (( post )  =&gt;  {  return  {  route :  ` ${ locale . code  ===  DEFAULT_LOCALE  ?  &#39;&#39;  :  &#39; / &#39;  +  locale . code }${ i18nConfig . pages [ &#39; blog/_slug &#39; ][ locale . code ]. replace ( &#39; :slug &#39; ,  post . slug )} ` ,  payload :  post  }  }))  }  return  routes }\n  ℹ Generating pages✔ Generated /blog/hello-world✔ Generated /it/articoli/ciao-mondo✔ Generated /es/artículos/hola-mundo✔ Generated /es/✔ Generated /it/✔ Generated /✨ Done in 33.82s.\n   In  this repository you can see the complete code of this tutorial, the result is deployed on  Netlify CDN at  https://eager-shockley-a415b7.netlify.app/. Netlify is one of my favourite services that provides cloud hosting for static websites, offering continuous deployment, free SSL, serverless functions, and more... The final code adds some missing features to the website, for example it adds authors support, uses some external components omitted here for simplicity and enables SEO option to the project to add metadata to pages (see  SEO section in nuxt-18n documentation).\n Another useful thing included in the final code is the sitemap, provided by the  Nuxt.js Sitemap module. Sitemap is easy to setup because it takes the  generate.routes value by default, so dynamic routes will be automagically included. The configurations is really straightforward, just add  @nuxtjs/sitemap at the end of  modules array section of your  nuxt.config.js file\n   export  default  {  // ...  sitemap :  {  hostname :  BASE_URL ,  gzip :  true ,  i18n :  DEFAULT_LOCALE  }  // ... }", "posttime": "2020-05-22 15:49:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "博客,构建,jamstack,slug", "title": "如何用Nuxt.js构建JAMStack多语言博客", "title_en": "How to build a JAMStack multi language blog with Nuxt.js", "transed": 1, "url": "https://dev.to/astagi/how-to-build-a-jamstack-multi-language-blog-with-nuxt-js-3gah", "via": "", "real_tags": ["博客", "构建", "jamstack", "slug"]}]