[{"category": "", "categoryclass": "", "imagename": "9e575fde178c0ab7c1c3c31c910f8f7e.jpeg", "infoid": 1001111, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "激光雷达是目前正在改变世界的传感器。它集成在自动驾驶汽车、自动无人机、机器人、卫星、火箭等中。\n这个传感器使用激光束，并测量激光返回所需的时间，以3D方式了解世界。输出是点云。\n这是一项比相机更难理解的技术，因为能接触到它的人更少。我曾经接触过它，今天将帮助你了解激光雷达对自动驾驶汽车的检测是如何工作的。\n激光雷达的底层技术可以为广泛的用例提供动力，但目前，自动驾驶汽车为我们提供了探索这项技术的最佳方法。\n今天，我将提供LiDAR的介绍，并从自动驾驶汽车的角度解释它是如何工作的。然后，我将探讨如何处理点云、使用3D边界框检测障碍物以及实时分割可驾驶区域。\n在做任何事情之前，要知道我每天都在用自动机器人等尖端技术创建内容。\n加入正在崛起的社区，订阅私人邮件列表，每天都能收到有用的提示和相关内容！\n激光雷达传感器与光一起工作。激光雷达是光探测和测距的缩写。他们可以探测到300米内的障碍物，并准确估计自己的位置。在自动驾驶汽车中，这是最准确的位置估计传感器。\n激光雷达传感器由激光发射(上)和激光接收(下)两部分组成。发射系统通过利用多层激光束来工作。层越多，激光雷达的精度就越高。在上面的图像中，你可以看到层越多，传感器就越大。\n当这些激光击中障碍物时，它们会产生一组点云。该传感器与飞行时间(TOF)一起工作。从本质上说，它测量的是每束激光束反射和返回所需的时间。\n当以非常高的质量(和价格)，激光雷达可以创建丰富的3D场景的环境。它们每秒可以发射高达200万个点。\n点云在三维中表示世界。LiDAR传感器可获得每个撞击点的精确(X，Y，Z)位置。\n在第一种情况下，它将检测重点放在一个位置上，并提供覆盖范围(例如90°)。在后一种情况下，它将围绕自身旋转，并提供360°视图。在这种情况下，我们希望将其放置在屋顶上，以获得更好的可见性。\n激光雷达很少用作独立传感器。它们通常与摄像机或雷达结合在一起，这一过程被称为传感器融合(Sensor Fusion)。请在这里找到我的传感器融合文章以了解更多信息。\n融合过程可以有两种类型：早期融合或晚期融合。在第一种情况下，点云与图像像素融合。在第二种情况下，各个检测被融合在一起。\n激光雷达不能直接估计速度。他们需要计算两个连续测量之间的差值才能做到这一点。另一方面，由于多普勒效应，雷达可以估计速度。\n激光雷达在恶劣天气条件下不能很好地工作。在有雾的情况下，激光可以击中它，使场景变得混乱。与雨滴或泥土相似。\n就尺寸而言，激光雷达很笨重--它们不能像相机或雷达那样隐藏起来。\n激光雷达可以准确估计障碍物的位置。到目前为止，我们还没有更准确的方法来做到这一点。\n激光雷达使用点云。如果我们看到车辆前面的点云，即使障碍物探测系统没有检测到任何东西，我们也可以停车。对于任何客户来说，知道车辆不会只依赖神经网络和概率是一个巨大的安全性。\n在本文中，我将介绍通常分4个步骤进行的障碍检测过程(后期融合)：\n要处理点云，我们可以使用最流行的库，称为PCL(点云库)。它在Python中可用，但在C++中使用更有意义，因为该语言更适合于机器人。它还符合ROS(机器人操作系统)。\nPCL库可以完成检测障碍物所需的大部分计算，从加载点到执行算法。该库是相当于OpenCV的计算机视觉。\n由于LiDAR的输出可以轻松地达到每秒100，000点，因此我们需要使用一种称为体素网格的东西来对结果进行下采样。\n体素栅格是一个3D立方体，它将通过在每个立方体中只保留一个点来过滤点云。\n最后，我们可以对云进行下采样，从100，000个点降到只有几千个点。\n我们可以执行的第二个操作是ROI(感兴趣区域)，我们只需删除不属于特定区域的每个点-例如，侧面10米，前方100米。\n第一个任务是加载点云并对其进行下采样。现在我们有了点云，我们可以继续进行分割、聚类和边界框实现。\n手头的分割任务是将场景与其中的障碍物分开。\n一种非常流行的分割方法称为RANSAC(随机样本一致性)。该算法的目标是识别一组点中的离群值。\n点云的输出通常表示一些形状。有些形状代表障碍物，有些简单地代表地面上的反射。RANSAC的目标是识别这些点，并通过拟合平面或直线将它们与其他点分开。\n为了拟合一条直线，我们可以考虑线性回归。但由于有如此多的异常值，回归会试图对结果进行平均，从而错过了这条线。与线性回归不同的是，这里的算法将识别这些异常值，而不会对它们进行拟合。\n我们可以认为这条线是场景的目标路径(即道路)，离群值是障碍物。\n计算每隔一点到拟合直线的距离。如果距离在定义的距离公差内，我们会将该点添加到内嵌点列表中。\n最后，选择内点最多的迭代作为模型，其余的都是离群点。这样，我们可以认为每个Inlier都是道路的一部分，而每个离群值都是障碍的一部分。\nRANSAC也可以在3D模式下工作。在这种情况下，3个点之间的平面是算法的基础。然后计算一点到平面的距离。\n以下是对点云执行RANSAC算法的结果。紫色区域表示车辆。\nRANSAC是一种功能非常强大且简单的点云分割算法。它试图找到属于相同形状的点，以及不属于相同形状的点。然后，它可以分离云。\nRANSAC的输出是障碍点列表和路点列表。由此，我们可以为每个障碍定义独立的群集。\n聚类是一种根据点的距离将一组点分开的技术。考虑上图，我们有一些可见的障碍物-我们需要算法自己理解实际上有多辆车，并为每个障碍物设置一种颜色。\n聚类是一系列机器学习算法，包括：K-Means(最流行)、DBScan、HDBScan等。\n如果目标和当前点之间的距离在距离公差范围内，请将当前点添加到簇。\n群集算法将距离容限、最小群集大小和最大群集大小作为输入。这样，我们就可以过滤“幽灵障碍物”(无缘无故地在空间某一点上的一个单点云)，并为封闭的障碍物定义一个距离。\n上述技术的问题是，一个LiDAR传感器可以输出100，000个点云。这意味着100，000个欧几里得距离计算。为了避免计算每个点的距离，我们可以使用KD树。\nKD树是一种搜索算法，它将根据点在树中的XY位置对点进行排序。一般的想法是-如果一个点不在定义的距离公差内，那么x或y更大的点肯定不会在这个距离内。这样，我们就不必担心每一个点的计算。\n以上面的场景为例，其中底部的橙色点不低于距离容差阈值。我们可以移除这个橙色点右侧的每一个点，因为我们确定它们也不会在容差阈值之内。然后我们可以取另一个点，计算距离，然后重复。\nKD树非常适合计算--欧几里得计算的次数大大减少了。再加上聚类算法，它们是高效获取独立障碍物的强大工具。\n最终目标是在每个簇周围创建3D边界框。这一部分并不特别难，但它对障碍物的大小做出了假设。因为我们没有做任何分类，所以我们必须将边界框与点相匹配。\n使用PCA，我们可以绘制与点云完全对应的边界框。这将对停放的汽车有所帮助，例如，在仅检测到部分的情况下。\n通过结合上面讨论的三种技术，我们得到了一个从LiDAR点云构建的障碍物检测算法！\n这是我的传感器融合纳米度项目的结果。您可以在此处访问代码。\n激光雷达是一种非常强大和可靠的传感器，广泛应用于机器人领域。今天，我们可以走得更远，将点云拟合到3D工作的神经网络中，直接输出边界框。\n一段时间以来，LiDAR技术因其笨重的尺寸和价格而受到批评，使其成为一种精英传感器。\n最近，苹果在其新款iPad Pro上发布了LiDAR传感器，大大降低了价格门槛，降至1000美元以下。\n随着LiDAR的问世，获得使用此传感器的技能将成为工程师的真正加分！传感器融合也是一个引人入胜的话题，只有掌握了LiDAR+相机或LiDAR+雷达检测才有意义。\n最后，我想邀请您加入私人邮件列表！自2019年末以来，我每天都在发布这份榜单，我唯一的目标就是帮助有抱负的AI&Amp；自主系统工程师找到梦寐以求的工作。在榜单中，我每天都会分享小贴士，以及技术内容。我也在分享我开发的关于这个主题的在线课程！在竞争中领先一步是真正的优势。加入这里吧。\n编者按：心跳是一个贡献者驱动的在线出版物和社区，致力于探索移动应用开发和机器学习的新兴交集。我们致力于支持和激励各行各业的开发人员和工程师。\n编辑独立，心跳是由Fritz AI赞助和出版的，Fritz AI是一个帮助开发人员教设备看、听、感和思考的机器学习平台。我们付钱给投稿人，我们不卖广告。\n如果您想投稿，请前往我们的征集投稿人。您还可以注册接收我们的每周时事通讯(深度学习周刊和Fritz AI时事通讯)，在Slake上加入我们，并在Twitter上关注Fritz AI以了解所有最新的移动机器学习。", "note_en": "LiDAR is a sensor currently changing the world. It is integrated in self-driving vehicles, autonomous drones, robots, satellites, rockets, and many more.\n This sensor understands the world in 3D using laser beams and measuring the time it takes for the laser to come back. The output is a point cloud.\n It’s a technology harder to understand than the camera because less people have access to it. I had access to it and today will help you understand how LiDAR detection works for self-driving cars.\n LiDAR’s underlying technology could power a wide array of use cases, but currently, self-driving vehicles offer us the best method of exploring this technology.\n Today, I’ll provide an introduction to LiDAR and explain  how it works from the self-driving car perspective. I will then explore  how to process the point cloud, detect obstacles using 3D bounding boxes, and  segment the drivable area in real-time.\n  Before anything, know that I am creating content daily on cutting-edge technology such as autonomous robots.\n To join the rising community, subscribe to the private mailing list and receive useful tips and relevant content every day!\n  A LiDAR sensor works with light. LiDAR stands for Light Detection And Ranging. They can detect obstacles up to 300 meters and accurately estimate their positions. In Self-Driving Cars, this is the most accurate sensor for position estimation.\n  A LiDAR sensor is composed of two parts:  laser emission (top) and  laser reception (bottom). The emission system works by leveraging layers of laser beams. The more layers, the more accurate the LiDAR will be. On the image above, you can see that the more layers, the bigger the sensor.\n  When these lasers hit an obstacle, they create a set of point clouds. The sensor works with Time of Flight (TOF). Essentially, it measures the time it takes for every laser beam to reflect and come back.\n  When at very high quality (and price), LiDARs can create rich 3D scenes of an environment. They can emit up to 2 million points every second.\n  Point clouds represent the world in 3D. The LiDAR sensor gets the exact (X,Y,Z) position of every impact point.\n  In the first case, it will focus its detection on a position and offer a coverage range (90° for example). In the latter case, it will rotate around itself and offer a 360° view. In this case, we want to place it on the roof for better visibility.\n LiDARs are rarely used as standalone sensors. They’re often coupled with a camera or a RADAR, in a process called Sensor Fusion. Please find my  Sensor Fusion article here to learn more.\n The fusion process can be of two types:  Early Fusion or  Late Fusion. In the first case, the point cloud is fused with the image pixels. In the second case, the individual detections are fused together.\n  LiDARs cannot directly estimate velocities. They need to compute the difference between two consecutive measurements to do so. RADARs, on the other hand, can estimate the velocity thanks to  the Doppler effect.\n LiDARs don’t work well in bad weather conditions. In cases of fog, the lasers can hit it and muddle the scene. Similar with rain drops or dirt.\n LiDARs are cumbersome in terms of size—they can’t be hidden like a camera or a RADAR.\n  LiDARs can accurately estimate the position of obstacles. So far, we don’t have more accurate means to do this.\n LiDARs work with point clouds. If we see point clouds in front of a vehicle, we can stop even if the obstacle detection system didn’t detect anything. It is a huge security for any customer to know that the vehicle won’t only rely on neural networks and probabilities.\n In this article, I will cover the obstacle detection process (late fusion) that generally happens in 4 steps:\n    To process point clouds, we can use the most popular library, called  PCL (Point Cloud Library). It’s available in Python, but it makes more sense to use it in C++, as the language is more suited to robotics. It’s also compliant with  ROS (Robotic OS).\n The PCL library can do most of the computations necessary to detect obstacles, from loading the points to executing algorithms. This library is the computer vision equivalent to OpenCV.\n Since the output of LiDAR can easily be 100,000 points per second, we need to use something called a voxel grid to downsample the results.\n  A voxel grid is a 3D cube that will filter the point cloud by only leaving one point per cube.\n   In the end, we can downsample our cloud from 100,000 points to only a few thousand.\n  The second operation we can perform is ROI (region of interest).We’ll simply remove every point that isn’t part of a specific region—for example 10 meters on the side, and 100 meters ahead.\n The first task is to load the point cloud and downsample it. Now that we have our point cloud, we can proceed to segmentation, clustering, and bounding box implementation.\n  The segmentation task at hand is to separate the scene from the obstacles in it.\n  A very popular method used for segmentation is called  RANSAC (RANdom Sample Consensus). The goal of the algorithm is to identify outliers in a set of points.\n The output of the point cloud is generally representing some shapes. Some shapes represent obstacles, and some simply represent the reflection on the ground. RANSAC’s goal is to identify these points and separate them from the others by fitting a plane or a line.\n  To fit a line, we could think of a linear regression. But with so many outliers, the regression would try to average the results and miss the line. As opposed to a linear regression, here the algorithm will identify these outliers and won’t fit them.\n  We can consider this line to be the scene’s target path (i.e. a road), and the outliers to be the obstacles.\n   Calculate the distance from every other point to the fitted line. If the distance is within a defined distance tolerance, we add the point to the list of inliers.\n  In the end, the iteration with the most inliers is selected as the model; the rest are outliers. This way, we can consider every inlier to be part of the road, and every outlier to be part of an obstacle.\n RANSAC also works in 3D. In this case, a plane between 3 points is at the base of the algorithm. The distance from a point to the plane is then calculated.\n Here is the result of a RANSAC algorithm on the point cloud. The purple region is representing the vehicle.\n  RANSAC is a very powerful and simple algorithm for point cloud segmentation. It tries to find the points that belong to the same shape, and the points that don’t. Then, it can separate the cloud.\n  The output of RANSAC is  a list of obstacle points, and a list of road points. From that, we can define independent clusters for each obstacle.\n Clustering is a technique where we separate group of points by their distances. Consider the previous image above, where we have a few visible obstacles— we need the algorithm to understand by itself that there are in fact multiple cars and set one color per obstacle.\n   Clustering is a family of machine learning algorithms, including: k-means (the most popular), DBScan, HDBScan, and more\n   If the distance between the target and the current point is within a distance tolerance, add the current point to the cluster.\n A clustering algorithm takes as input a  distance tolerance, a  minimum cluster size, and a  maximum cluster size. This way, we can filter “ghost obstacles” (one single point cloud at a point in space for no reason) and define a distance for closed obstacles.\n  The problem with the above technique is that a LiDAR sensor can output 100,000 point clouds. It would mean 100,000 Euclidean distance calculations. To avoid calculating distances for every single point, we can use a KD tree.\n A KD tree is a search algorithm that will sort points by their XY positions in a tree. The general idea — if a point is not within a defined distance tolerance, then the points whose x or y are even bigger surely won’t be within this distance. This way, we don’t have to worry about computations for every single point.\n  Take this scenario above, where the orange point at the bottom isn’t below the distance tolerance threshold. We can remove every point on the right side of this orange point, because we’re sure they won’t be within the tolerance threshold either. Then we can take another point, calculate the distance, and repeat.\n KD trees are great for computations—the number of euclidean calculations are drastically reduced. Coupled with a clustering algorithm, they’re powerful tools to obtain independent obstacles efficiently.\n  The final objective is to create a 3D bounding box around each cluster.  This part is not particularly difficult, but it makes assumptions about the obstacles’s sizes. Since we did not make any classification, we must fit the bounding boxes to the points.\n   Using PCA, we can draw a bounding box that corresponds exactly to the point clouds. This will help with parked cars, for example, where the detection is only partial.\n By combining all 3 techniques discussed above, we have an obstacle detection algorithm built from LiDAR point clouds!\n   Here’s the result of my project from the  Sensor Fusion Nanodegree Program. You can access  the code here.\n  LiDAR is a very powerful and reliable sensor that’s used a lot in robotics. Today, we can go even further and fit point clouds to neural networks working in 3D that output the bounding boxes directly.\n For a while, LiDAR technology has been criticised for its cumbersome size and its price, making it an elite sensor.\n Recently, Apple announced  a LiDAR sensor on its new iPad Pro, which significantly reduces the price barrier to under $1,000.\n  With LiDAR availability, obtaining the skills to work with this sensor will become a real plus for an engineer! Sensor fusion is also a fascinating topic that only makes sense if you master LiDAR + camera or LiDAR + RADAR detection.\n To conclude,  I would like to invite you to the private mailing list! I run this list every day since late 2019 and my sole goal is to help aspiring AI &amp; autonomous systems engineers get their dream jobs. In the list, I share tips every day, as well as technical content. I am also sharing  online courses I develop on this topic! It is a real advantage to get one step ahead of the competition.  Join here.\n  Editor’s Note:     Heartbeat    is a contributor-driven online publication and community dedicated to exploring the emerging intersection of mobile app development and machine learning. We’re committed to supporting and inspiring developers and engineers from all walks of life.\n Editorially independent, Heartbeat is sponsored and published by     Fritz AI , the machine learning platform that helps developers teach devices to see, hear, sense, and think. We pay our contributors, and we don’t sell ads.\n If you’d like to contribute, head on over to our     call for contributors . You can also sign up to receive our weekly newsletters (   Deep Learning Weekly  and the    Fritz AI Newsletter ), join us on      Slack , and follow Fritz AI on     Twitter  for all the latest in mobile machine learning.", "posttime": "2020-05-08 00:22:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "探测,detection,障碍物", "title": "激光雷达探测原理", "title_en": "How Lidar Detection Works", "transed": 1, "url": "https://heartbeat.fritz.ai/how-lidar-detection-works-8db24556a8d9", "via": "", "real_tags": ["探测", "detection", "障碍物"]}, {"category": "", "categoryclass": "", "imagename": "729305147c6e5d522d720d53d2836bd2.jpg", "infoid": 1001110, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌的基于代码的身份验证应用程序Google Authenticator收到了三年来的首次更新，更新了应用程序的界面，使其屏幕更大，宽高比更现代，并提供了该平台最需要的功能之一(通过安卓警察)。Android版本最后一次更新是在2017年8月22日，而iOS One大约在一年前进行了更新，以适应iPhone X的屏幕。\n现在，验证器用户将首次能够轻松地将其帐户从一台设备转移到另一台设备，而无需手动转移每个代码或在每个帐户上禁用和重新启用双因素身份验证(2FA)。更新通过一个导入/导出工具引入了这一功能，该工具允许您使用单个二维码扫描来选择要包括和转移的账户。这是竞争对手Authy已经提供了很长一段时间的功能，所以看到Authenticator提供它是一件令人耳目一新的事情，即使它晚了几年。\n此次更新还调整了应用程序的布局，以考虑到16：9宽高比的较新屏幕，为那些有或没有OLED屏幕的人增加了可调暗模式，并根据谷歌的Material Design 2标准对用户界面进行了改造。这一更新目前似乎只对Android用户可用，但我们正在研究它是否会很快适用于iOS。谷歌没有立即回复记者的置评请求。", "note_en": "Google Authenticator, the company’s code-based authentication app, has received its first update in three years, updating the app’s interface for larger screens with more modern aspect ratios and delivering one of the platform’s most-needed features ( via  Android Police ). The Android version was last updated on August 22nd, 2017, while the iOS one was updated around a year ago to adjust it for iPhone X screens.\n Now, for the first time, Authenticator users will be able to easily transfer their account from one device to another without needing to manually transfer each code or disable and reenable two-factor authentication (2FA) on each account. The update introduces this feature through an import / export tool that lets you choose which accounts to include and transfer using a single QR code scan. It’s a feature that competitor Authy has provided for quite some time, so it’s refreshing to see it come to Authenticator, even if it’s years late.\n The update also adjusts the layout of the app to take into account newer screens with 16:9 aspect ratios, adds an adjustable dark mode for those with and without OLED screens, and includes a revamp of the user interface in accordance with  Google’s Material Design 2 standards. This update appears only available for Android users right now, but we’re looking into whether it’s coming to iOS soon as well. Google did not immediately respond to a request for comment.", "posttime": "2020-05-07 23:35:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,android,authenticator,功能", "title": "Google Authenticator多年来的第一个Android更新可以让你在设备之间移动账户", "title_en": "Google Authenticator's First Android Update in Years Lets You Move Your Account Between Devices", "transed": 1, "url": "https://www.theverge.com/2020/5/6/21249621/google-authenticator-update-transfer-account-between-devices-2fa", "via": "", "real_tags": ["google", "android", "功能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001108, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从我写上一篇文章以来，已经有很长一段时间了。现在我们生活在这个所谓的新常态中，我把更多的时间花在其他活动上，而不是看电视或玩游戏。于是，我开始回忆起过去美好的事情，其中有一件事把我带到了80年代：我以前的斯佩西。当我对游戏开发的热情正式开始的时候。\n好的，所以当我在阅读关于视频游戏黄金时代的书籍，看相关的视频，阅读关于下一个月ZX Spectrum(以及Z80架构)的帖子，并为Speccy播放新的创作时，我想到了嗯…。现在为特种部队开发一款游戏有多难？有没有什么很酷的开发工具可以帮助我避免感觉自己回到了石器时代？在这一点上，你可能会说什么？但让我们面对现实吧，游戏开发已经发生了很大的变化，因为在那个时代，工具对于凡人来说根本不方便，调试真的是一件令人头疼的事情。在那些日子里，游戏开发已经发生了很大的变化，仅仅对于普通人来说，工具根本不方便，调试真的是一件令人头疼的事情。此外，我敢打赌，我们中的许多人已经习惯了舒适。有时可能太多了，但嘿，事情就是这样。\n现在，当我在做我的发现过程，以建立一个符合我需求的堆栈时，我碰巧找到了几个非常吸引我注意的工具，以至于我觉得有动力写一篇关于它们的文章，试图也与现代平台的游戏开发保持短暂的距离，并给这些页面带来一些新的复古氛围。在这些页面上，我碰巧找到了一些非常吸引我的工具，我觉得有动力写一篇关于它们的文章，试图与现代平台的游戏开发保持短暂的距离，给这些页面带来一些新的复古氛围。\n在安装任何编译器和相关工具之前，我搜索了除这两种语言之外的其他语言，即原始Basic和汇编语言。我的目标有两个：(A)用这种语言编写游戏的一般部分，以及(B)为汇编留下关键代码。\n这就是我遇到像Elena这样有趣的项目的时候，Elena是一种基于C#的语言，它看起来很有前途，但已经一年多没有作者的帖子了。当然，还有C，但正如我将在下一节中提到的那样，我希望与VS完全集成。\n然后进入BORIEL ZX BASIC！这是一个用Python编写的编译器，可用于主要平台(Windows、Linux和MacOSX)，将扩展的BASIC版本翻译成Z80汇编代码。为什么要延期？因为他的作者JoséRodriguez(@boriel)以FreeBasic的语法为基础，在其中引入了结构化语言的功能，比如函数、子例程和标签。此外，他还提供了一组函数和子例程以及新的数据类型，当然还有教程。\n但这完全不是它。有一个关键功能我仍然必须提一下：JZX Basic允许内联汇编指令！这对我来说是一个杀手锏的特写，这里有一个链接来展示它的一个例子。\n这是一种非常流行的语言，因为近年来许多游戏都是用它为Speccy创建的，每周都会有新的添加。恩霍拉布埃纳，何塞！\n这一次对我来说成了一个挑战。原因呢？我使用Visual Studio(用来玩虚幻游戏，用Unity玩游戏，用真的什么都玩)。我知道对许多人来说，使用VS可能是一种过度杀伤力和障碍，但习惯于长时间的编译不会带来任何问题，所以这对我来说是相当自然的一步。\n一开始，我是从z88dk开始的，然后我寻找了更直观的工具，甚至找到了VS Code的解决方案，但都没有真正集成到VS中。幸运的是，我在GitHub找到了SPECTNETIDE，这个项目是由István Novák(@istvannovak)创建的。这是一个从一开始就集成到VS中的高级框架，具有许多方便的功能。它支持所有传统平台。它允许在单个解决方案上处理多个项目。是的，调试器.。那个令人惊叹的调试器，它允许在指令上设置断点，同时您可以直观地检查其集成仿真器上呈现的内容！\n除此之外，该框架还附带了其他工具，允许您检查CPU、ULA、内存、调用堆栈，甚至磁带文件。\n作者确实乐于接受建议。事实上，他实现了我的很多要求，包括Boriel ZX Spectrum的支持！如果你问我，这是一个双赢的局面。\n这里有点不利的是，目前没有对ZX Spectrum Next的支持，但好消息是，这样的支持是路线图的一部分。所以我迫不及待地想让它发生。\n最近，IDE的速度越来越快，因为许多新用户都活跃在该项目的页面上，有新的请求和错误报告。(太棒了，István！)。\n尽管SpecNetIDE附带了内置仿真器，但在工具集中拥有外部仿真器总是很有用的。而我更喜欢的是规格。这是免费的。它使用起来很简单。这项工作做得很好。所以，这对我来说已经足够了。\n现在，还有其他选择。其中几个是：ZESARUX仿真器和CSpect仿真器。前者最初是为基于Unix的操作系统发布的，现在可用于Windows等其他操作系统。而后者，另一款知名且非常流行的多平台仿真器。两者都是，imvho，很好的选择。\n但是，令我惊讶的是，还有第三个仿真器：Spec256。它允许使用256种颜色，没有冲突。暂时来说，它是假想的Speccy的仿真器，而不是真正的Speccy，因为它模拟的是Z80架构，带有64位寄存器和64位内存映射(而不是8位)。这是一个非常有趣的选择，但不幸的是，它需要修改原来的游戏才能获得这些出色的结果，所以只有几个游戏被改编了。\n现实世界中的另一种选择是用ULAplus取代Speccy的ULA，例如，它允许使用64色模式，组织成16种颜色的4个调色板的查找表，这是相当令人印象深刻的。但是再一次，ZX Spectrum Next已经发布了，对吗？出于怀旧的目的，许多人宁愿保持他们的Speccy机器完好无损。但是，选择是有的。你说了算..。\n现在，关于图片，有很多工具可以创建像素图片(免费的和商业的)，但问题是它们都不支持以Speccy期望的格式导出生成的图形-至少是AFAIK，我也没有找到提供这种功能的插件或插件。幸运的是，我们可以找到一些选项来满足这一需求。\n其中之一是SevenuP，这是一个简单的编辑器，因为它支持调色板并按预期导出数据，所以它可以完成这项工作。\n另一个选择是MultiPaint，这是一个比SevenuP功能更多的编辑器，它也包括对ULAplus的支持。\n两者都是非常方便的编辑器，尽管GUI有所不同，但如果您熟练使用像素艺术，结果可能会非常接近，所以最终，无论您选择哪一个图形编辑器，都可能会将原因归结为品味问题。\n我首先想到的是Archive.org，也被称为互联网档案馆。这个网站一直在以数字形式备份数据，网站和其他文物，是的，…。包括电子游戏。我为什么要在这里提呢？因为它有一个专门介绍辛克莱·斯派姆的游戏的部分，而且尽管目前并不是所有的游戏都包括在内(在哪里)，对于可用的游戏，你可以在网上播放，因为它们嵌入了M.A.M.E！\n最后，还有一些博客可以帮助你迈出第一步，也可以进入更高级的领域，例如ZX Spectrum Dev中的冒险，这是一个致力于最初的Speccy(而不是致力于下一个)的线程，有很多有趣的信息和YouTube中有用视频的链接。(五)总结\n总而言之，我目前为ZX Spectrum开发游戏的堆栈是：\n1.Boriel ZX Basic+Z80汇编语言2.SpectNetIDE(Visual Studio版)3.Speccy Emulator 4.Windows SevenuP。\n我希望你喜欢这个帖子。和往常一样，欢迎您的评论，如果有人正在为Speccy(或任何其他基于Z80的平台，如Amstrad，MSX等)编写游戏，您的开发堆栈是什么？", "note_en": "It&#39;s been really long since I wrote my last article. And now that we are living this so-called &#34;new normal&#34;, I&#39;m dedicating more time for other activities than watching tv or playing games. So, I started to remember good things from my past, and one of them drove me to the 80&#39;s: my old Speccy. When my passion for game development officially started.\n  Ok, so I was reading books about the golden era of videogames, watching related videos, reading posts regarding the  ZX Spectrum Next (and the Z80 architecture, in general), and playing new creations for the Speccy when I thought &#34;hummm ... how hard would it nowadays be to develop a game for the Speccy? Is there any cool dev stack that help me avoid feeling that I&#39;m going back to the stone age?&#34;  \rAt this point you may be saying &#34;what?!&#34;, but let&#39;s face it, game development has evolved a lot since those days where tools weren&#39;t handy at all for mere mortals and debugging was a real pain in the back. Plus, I would bet that many of us got accustomed to comfort. Maybe too much sometimes, but hey, it is what it is.\n  Now, by the time I was doing my discovery process to build a stack that suits my needs I happened to find a few tools that caught my attention so much that I felt motivated to write an article about them, in an attempt to also get distanced for a brief moment from game development for modern platforms and bring some &#34;retro&#34; vibe to these pages.\n      Before installing any compiler and related tools I searched for languages other than both, the original basic and assembly. My goal was twofold: (a) to write the general parts of the game with such language, and (b) left critical code for assembly.\n  And this is when I came across interesting projects like  ELENA, a language based on C#, which looks promising but there have been no posts about from the author for more than a year. And of course, there is C, but as I will mention in the next section I wanted full integration with VS.\n  And then enters  BORIEL ZX BASIC! This is a compiler written in python, available for major platforms (Windows, Linux and MacOSX), that translates an extended version of Basic into Z80 assembly code. Why extended? Because his author, José Rodriguez ( @boriel), has based on the syntax of FreeBasic to introduce features of structured languages into it, like functions, subroutines and labels. And also, he has provided a set of  functions and subroutines as well as new  data types and of course,  tutorials.\n  But this is not it, at all. There is one key feature that I still have to mention:  ZX Basic allows to inline assembly instructions!!! This is a killing feature for me and here&#39;s a link to  an example of it.\n  This is a really popular language since  many games were created for the Speccy with it in recent years, and  new additions are coming weekly. Enhorabuena José!\n    This one became a challenge for me. The reason? I use Visual Studio (for games with Unreal, for games with Unity, for games with everything really). I know that for many using VS could be an overkill and a blocker, but being accustomed to long sessions of compilation this would present no issues, so it&#39;s quite a natural step for me.\n  At first, I started with  z88dk, and then I looked for more intuitive tools, and even found solutions for VS Code, but nothing really integrated into VS. Luckily, I found  SPECTNETIDE a project in  github created by István Novák ( @istvannovak). This is an advanced framework that integrates into VS from the get go, with many handy features. It supports all traditional platforms. It allows to work with multiple projects on a single solution. And yes, the debugger ... that amazing debugger that allows to set breakpoints on the instructions while you visually inspect what is being rendered on its integrated emulator!\n    In addition to that, the framework comes with other tools that allows you to inspect the CPU, the ULA, the memory, the call stack, and even tape files.\n  The author is really open to suggestions. As a matter of fact, he implemented many of  my requests, including the support of Boriel ZX Spectrum! A win-win scenario, if you ask me.\n  A bit of a downside here is that currently there is no support for the ZX Spectrum Next, but the good news is that such support is part of the roadmap. So I cannot wait for it to happen ...\n  Lately, the IDE was gaining speed since many new users were active in the project&#39;s page with new requests and bug reports. Bravo, István!\n    Although SpecNetIDE comes with a build-in emulator, it is always useful to have an external emulator in the toolset. And the one I prefer is  SPECCY. It&#39;s free. It&#39;s simple to use. It does the job ok. So, it&#39;s enough for me.\n    Now, there are alternatives. A couple of them are:  ZESARUX and  CSpect emulator. The former, originally released for Unix-based OS, and now available for other operating systems like Windows. And the later, another well-known and very popular multi-platform emulator. Both, imvho, fine alternatives.\n  But, to my surprise, there is a third emulator:  Spec256. It allows to use 256 colors with no  clash. Being picky here for a moment, it&#39;s an emulator for a hypothetical Speccy, not a real one, since it emulates a Z80 architecture with 64-bit registers along with a 64-bit memory map (instead of 8). A very interesting alternative but unfortunately it requires modifying the original games  to get these outstanding results, so  only a few have been adapted.\n  A real-world alternative would be to replace Speccy&#39;s ULA with  ULAplus, which allows for example, using 64-colour mode, organized as a lookup table of 4 palettes of 16 colors, which is quite impressive. But again, the ZX Spectrum Next has been released, right? An many would prefer to keep their Speccy machines intact, for nostalgic purposes. But, the option is there. Your call ...\n    Now, regarding artwork, there are many tools out there that allows to create pixel art (free and commercial), but the problem is that none of them support exporting produced graphics in the format expected by the Speccy -at least, afaik, and I found no plugins or addons that provide such feature. Fortunately, we can find some options to cover this need.\n  One of them is  SevenuP, a simple editor that does the job since it supports the palette of colors and exports data as expected.\n    Another option is  Multipaint, an editor with more features than SevenuP, which also includes support for ULAplus.\n    Both are really handy editors, and despite differences in the GUI, results can get really close if you are skilled with pixel art, so at the end, whether you pick one graphic editor or the other may reduce reasons to a matter of taste.\n      The first one that comes to my mind is  archive.org, also known as &#34;The Internet Archive&#34;. This site has been backing up in digital form, sites and other artifacts, and yes, ... including videogames. Why do I mention it here? Because it has a section devoted to Sinclair Spectrum&#39;s titles, and despite the fact that not all of them are currently included (where&#39;s  Narco Police?!), for the ones available, you can play them online since they have embedded M.A.M.E!!!\n  Finally, there are blogs that may can help you to take your first steps and also move into more advanced areas, for example  Adventures in ZX Spectrum Dev, a thread which is devoted to the original Speccy (as opposed to  the one dedicated to the Next) with lots of interesting information and also links to  useful videos in Youtube.   (V)  SUMMING UP\n  To wrap it up, my current stack to develop games for the ZX Spectrum is:\n  1. Boriel ZX Basic + Z80 Assembly  \r2. SpectNetIDE (for Visual Studio) \r3. Speccy Emulator \r4. SevenuP\n  I hope you enjoy this post. As usual your comments are welcome and, if anyone is currently writing games for the Speccy (or for any other Z80-based platform like Amstrad, MSX, etc.),  what&#39;s your dev stack?", "posttime": "2020-05-07 23:33:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,开发,情感,games", "title": "80年代的情感之旅：为特殊人群开发游戏", "title_en": "An emotional trip to the 80s: Developing Games for the Speccy", "transed": 1, "url": "https://www.gamasutra.com/blogs/PedroGuida/20200504/362225/An_emotional_trip_to_the_80s_Developing_Games_for_the_Speccy.php", "via": "", "real_tags": ["游戏", "开发", "情感", "games"]}, {"category": "", "categoryclass": "", "imagename": "36565615b532bee4783f418d725b25ab.png", "infoid": 1001107, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Zerodha现在是印度最大的股票经纪人，自力更生并盈利，今年就满十岁了。泽罗达科技团队就满7岁了。在我们存在的过程中，技术团队在很大程度上仍然难以捉摸。虽然我们已经考虑创建一个科技博客超过五年了，但我们经常发现自己太忙于建立股票经纪公司的基础设施。我们也因为没有准备好与世界谈论我们非常非常规的设置而停滞不前。\n但现在，装备了久经沙场的后见之明的力量，博客终于来到了这里，我们希望分享我们建造了什么，我们是如何建造的，以及我们这些年来学到了什么。\nTLDR：七年来形成的30名成员的技术团队打造了印度最大的股票经纪公司。非常规的设置。期待已久的科技博客终于来了。一些背景故事和背景。\nZerodha于2010年由两兄弟和终身交易员NiThin和Nikhil Kamath在班加罗尔成立，当时是一家小型折扣经纪公司。2012年，我在学校的一位老朋友的劝说下开发了一款投资应用程序，完全是偶然的，我们发现了Zerodha，就因为他们的办公室恰好就在我们出没的同一附近。\n到2013年初，我们已经停止了对这款应用的开发，在未能获得监管部门的批准后，我们分道扬镳。如果是今天，我们就会获得必要的批准，因为今天的监管机构比2013年成倍地精通技术。我决定坚持下去，主要是因为当时资本市场上所有科技产品的状况(也就是说没有)令人惊讶，在一个未被触及的领域开发软件令人兴奋，而且真的是因为尼辛和我相处得真的很好。在那个时候，我已经做了十多年的业余开发人员/黑客，我觉得我可以继续这样做，尽管我一直在“公司”的环境中开发软件，这是我一直持怀疑态度的。\n然后建造，我们做到了。我们在2013年年中成立了技术团队。当时，Zerodha大约有75名员工。今天，技术团队有30名成员，公司其他部门的人员已增长到约1200人，分布在销售、运营、支持和合规等不同部门。股票经纪，特别是在印度，是一份复杂而艰难的工作。\n技术团队有两名移动开发人员、两名设计师、两名前端开发人员、一名测试工程师、一名devops工程师和一名联络员，帮助我们跟踪与其他杂乱无章的部门的沟通。我们其余的人，包括前面提到的专注于特定领域的成员，都是全栈开发人员，他们几乎什么都做。没有专门的项目或产品经理，开发人员担任这些角色，自然就会出现领导者。产品和技术由两到四个开发人员组成的小团队构建、维护和拥有，这些微团队之间有几个重叠。\n团队中没有人有任何金融背景，除了少数开发人员外，大多数人也没有以前的工作经验。每个人都是刚走出大学校门的黑客或业余爱好者。什么大学，我们既不问，也不跟踪。\n一个由30名成员组成的技术团队从头开始构建并扩展了一个复杂的金融+股票经纪堆栈，为最终用户构建了一整套金融软件，人们在一个极其复杂、约束和快速变化的监管环境中真正欣赏这些软件，而事先对行业一无所知，这是一个相当大的壮举。与其说是壮举，不如说是反常。然而，我发现，一群黑客在正确的环境中，在正确的哲学指导下，即使在印度股票经纪行业这样一个不时髦、不酷的地方，也能具有令人难以置信的创造力和生产力，这是很自然和令人心酸的。过去的规范-一小群黑客开发优秀的软件-现在已经变成了例外。\nZerodha在2019年1月成为印度最大的股票经纪公司，超过了大型银行运营的股票经纪公司。我们缓慢而有机地实现了这一点。我们从来没有筹集过外部资金，没有负债，而且一直是盈利的。我们没有营销团队，没有在任何地方做广告，多年来让我们的服务和产品不言而喻，建立了我们的用户基础、品牌和信任。\n所有印度证券交易所每日零售交易量和投资额的15-20%都通过我们的应用程序进行。\n我们每天有大约100万活跃用户在印度各交易所实时进行数百万笔交易，总交易额超过30亿美元。3月初，当美国嘉信理财(Charles Schwab)报告称，一天内交易达到270万笔的新纪录时，我们进行了700多万笔交易。当然，比较是基于活动的规模，而不是交易量(美元对印度卢比)。在刚刚结束的上一财年，我们执行了超过10亿笔交易。\n我们的系统在市场高峰期每秒处理数十万个请求。我们每秒向数十万并发用户广播约1600万个市场交易记录。由于仔细的逐字节优化，带宽费用可以忽略不计。\n我们从存储数千亿行投资记录的Postgres节点即时构建和提供详细的投资组合报告、细分和可视化。\n在我们不久的将来开始深入研究之前，这里是对我们堆栈的一个快速、广泛的概述。\n我们所有的性能关键型、高吞吐量服务都是用Go编写的。我们还没有收到任何主动提出的建议，要求我们重写Rust或Nim的所有内容(目前还没有)。\n实时性能不是瓶颈的数据密集型后台系统是用Python编写的。Django和Flask提供特定的Web应用程序。\n无数复杂的业务、财务、帐户、人员流程和后台应用程序都构建在ERPNext之上。感谢宇宙的ERPNext。\n适用于iOS和Android移动应用程序的Ffltter。放弃了原生的Android/Java、Swift，而改写了原生的一切。诚然，仍然有一款“反应原生”(Reaction Native)应用程序。\n具有数千亿行的自我管理Postgres实例。由于某些依赖关系，MySQL实例有数十亿行。\n高吞吐量热路径中的自管型Redis实例。很少有软件具有如此令人难以置信的自动化程度。\nELK堆栈用于日志，其中存储数年数TB的可搜索日志是法规要求。\n混合基础设施。许多交换机租用线路终止的物理机架+AWS。有时，当孟买的市政机构挖掘道路时，这些租用的线路就会倒塌。\n这些是碰巧对我们起作用的一些广泛的指导原则。\n无论是为了“成长”的大型团队，还是10倍的忍者开发者，都没有意义。重要的是，一群优秀的开发人员，无论多小，都能够很好地合作。\n僵化的方法往往会失败。人员、团队、需求和环境是无限不同和动态的。一个环境和团队独有的方法论必须以同样的方式建模，就像“为正确的工作使用正确的工具”一样。\n技术堆栈应该遵循“为正确的工作使用正确的工具”，并且应该有机地发展。您可能不需要K8群集(或K8或Docker)群集，或者在第一天或永远不需要端到端CI/CD平台支持的AI和区块链。在采用一项技术时做出的每一个选择都会产生严重的长期后果。\n尽量保持代码和堆栈的非花哨和简单。重常识，轻冷静。例如，用正确的权衡来避免微型服务地狱和巨石怪兽。\n福斯-第一。只有自由/开源软件，真的。我们使用和生产自由/开源软件(今年，我们将启动一个自由/开源软件基金)。\n不要害怕自己主持。我们自行托管公司的员工内部网和人力资源系统，支持票务和CRM、内部论坛和聊天系统、财务后台和会计应用程序、监控和记录基础设施、邮件服务器、数据库、代理，几乎无所不包。OAuth+2FA背后的一切都具有基于角色的访问控制和精细权限。对于开发人员，基于无密码证书的SSH登录。全是福斯。\n技术团队应该以开发人员为中心来运行，而不是以业务或管理为中心。\n技术决策，即使是那些具有业务影响的决策，也应该由技术人员做出。否则，功能就会出现爬行、臃肿、技术债务和倦怠。\n绝对每个决策--人员、技术、运营、产品--都是一种权衡。每种权衡都应该在正确的技术和业务方面、开发人员和管理团队以及产品和最终用户之间取得平衡。做出正确的权衡是一门艺术。\n对技术性债务要格外警惕。知道何时报废和重写系统。我们已经多次报废和重写了我们堆栈的大部分，包括我们的关键交易平台，每一次迭代都会显著改进它们。这些都是艰难的决定；极其重要的权衡。当然，不受非技术管理层的干预是不可思议的幸运。\n构建组织和组织流程，如架构良好的软件系统中独立的、可互操作的单元。在2020年3月12日，由于冠状病毒紧急情况，我们能够让所有部门的大约1200名员工通宵完全远程访问。由于我们将整个组织的工作流程、系统和交互构建成一个设计良好的模块化软件系统，因此麻烦最少，这要归功于我们的结构和架构。\n这种方法还帮助我们将组织开放为一套API，创建了一个“经纪即平台”系统，使几家初创企业能够通过接入我们进入投资技术领域，进而帮助我们启动金融科技基金，该基金现在已经投资了十几家初创企业。\n与组织内的非技术团队建立有机的、有意义的关系。我们与组织内的小型非技术团队(支持和财务的子集)合作，从财务的角度对产品进行评审和验证，收集反馈和数据，并进行质量保证。\n非常讲究质量和一致性。额外50KB的Javascript，或者Web应用程序上100KB的PNG，或者平均延迟突然达到10ms的峰值，都是不可接受的。无论成本如何微不足道，都是好工程的原则问题。稍作停顿，以更好的方式做事是可以的。\n好的设计是最重要的。在不考虑人与人之间的互动和情感的情况下为人类构建软件是犯罪的。保持简单的UI和交互、清晰的排版、最小的杂乱和平稳的间距。为了在“美观的”和“易于使用的”之间取得适当的平衡，我们尽可能长时间地重复。\n将技术成本视为工程挑战。总是在可能的情况下进行优化，不要把不是绝对必要的东西花掉。节俭和节制应该是黑客的第二天性。\n并不是编写的每一行代码都是巧妙的或创新的，而且很多工作往往是乏味的。这就是现实世界的运作方式，也是每个开发人员都应该接受和内化的事实。\n开发人员应该涉足所有领域(前端、后端、测试和QA/QC、基础设施、devops)，并逐步自然地构建重点。\n不要害怕冻结功能，以更好的方式构建技术。放慢速度来干净地建造是可以的，因为现在建造的东西将在未来产生严重的影响。“上市时间”的热情往往被夸大了，而且目光短浅。这对我们来说从来都不是障碍。事实上，遵循这种方法使我们能够以令人难以置信的速度制造大量产品并将其推向市场。\n信任开发人员，容忍(甚至是可怕的)错误。关键是要在试错中学习，不要重蹈覆辙。不是每个人都是10倍的神枪手忍者，这没什么。每个人都有自己的关键角色要扮演。要有耐心，让人才成长。如果有人不尊重这一点，并且不断重复同样的错误，那么他们很可能不会放弃这一点。幸运的是，我们很少有这样的例子。\n对于开发人员来说，找到有意义的工作以保持创造性和生产力是很重要的。团队中的每个人都有自己构建并拥有、维护、控制和负责的各种系统。此外，我们还有一项员工持股计划，当团队成员成熟并在其角色中成长时，该计划会增加他们对公司的所有权-员工持股计划的价值来自于实际利润。这还不包括金融科技创业投资的一部分。这显然在第一天就不可能实现(我们从未接受过外部资金)。多亏了团队和业务的发展，我们逐渐做到了这一点。\n玩得开心是极其重要的。如果有机会让事情变得有趣，不管一个环境的现状有多“严重”，都应该让事情变得有趣。归根结底，重要的是工作质量。“一天不停的迷因和燃烧，可以帮助你远离压力和乏味。”到目前为止，我们已经连续五年多每天晚上在Steam上进行反罢工条件零(1.6)LAN比赛，从未失败过。永远不会变老，除了被n00bs无情地击中头部。\n我们的工作，我们的产品，我们的失败，甚至我们的成功，都是可笑的。没有什么是伪善的。每件事都有一种模因。这帮助我们应对了过去面临的停机带来的愤怒，这些愤怒源于堆栈和控制之外的因素。\n认识到没有什么是绝对的，一切都是荒谬的(参见冠状病毒世界)。打造一支健康、成功的团队是没有规则的。常识+努力+乐趣+运气。\n接受并欣赏运气。无数微小的决定和权衡导致了一个成功的结果，这既是运气，也是代码。当然，几率与投入的工作量和激情成正比。我们最终处于正确的环境中(没有技术和管理分歧。感谢我。)，我们的产品成功了，我们有能力做我们喜欢的事情，赚钱谋生，玩得开心，这是运气。\n老实说，作为一名业余开发人员，我之前没有在公司结构中工作或管理团队的经验，除了黑客优先的方法之外，我没有任何可以借鉴的东西，而且我非常幸运地找到了志同道合的黑客，他们可以整天燃烧表情包，同时不断学习和制作高质量的作品。\n我对这个博客的前景感到兴奋。它早就该来了。我们急于使用Zerodha作为案例研究，以说明不仅可以构建好的软件，而且可以构建大型企业(“独角兽”)，使用小型黑客团队，即使在最不可能的行业也是如此。希望技术团队的成员能开始抽出时间半定期地出现在这个博客上，带着他们自己的经验和技术洞察力。", "note_en": "Zerodha, now India’s largest stock broker, bootstrapped and profitable, turns ten years old this year. The Zerodha tech team turns seven years old. The tech team has remained largely elusive over the course of our existence. While we have pondered starting a tech blog for more than half a decade, we have often found ourselves too busy building the fundamental blocks underlying a stock brokerage. We have also been stalled by a sense of unpreparedness to talk to the world about our very unconventional setup.\n But now, equipped with the power of battle-tested hindsight, the blog is finally here, and we hope to share what we have built, how we have built, and what we have learnt over the years.\n TLDR: 30 member tech team formed over seven years built India’s largest stock broker. Unconventional setup. The long pending tech blog is finally here. Some backstory and context.\n   Zerodha was founded in 2010 as a small discount broking firm in Bangalore by two brothers and life-long traders,  Nithin and Nikhil Kamath. In 2012, I was roped into building an investment app by an old friend from school, and by complete happenstance, we discovered Zerodha just because their office happened to be in the same vicinity where we would hangout.\n By early 2013, we had stopped working on the app and had gone our separate ways after failing to get regulatory approvals. If it were today, we would have obtained the necessary approvals as the regulators are exponentially more tech savvy today than they were in 2013. I decided to stick on, primarily due to the sheer astonishment at the state of all things tech in capital markets then (none, that is), the excitement of building software in an  untouched area, and really though, because Nithin and I got along really well. I had been a hobbyist developer / hacker for over a decade at that point, and it felt like I could continue being that, building software, despite being in a “corporate” setting, something I had always been skeptical about.\n And build, we did. We founded the tech team in mid-2013. At that point, Zerodha had around 75 employees. Today, the tech team is 30 members strong, and the rest of the company has grown to ~1200 people across various departments like sales, operations, support, and compliance. Stock broking, especially in India, is a complex and hard gig.\n  The tech team has two mobile developers, two designers, two frontend developers, one test engineer, one devops engineer, and one liaison who helps us keep track of communication with other sprawling departments. The rest of us, including the aforementioned members who focus on specific areas, are fullstack developers who do pretty much everything. There are no dedicated project or product managers, and developers step up to these roles and natural leaders emerge. Products and technologies are built, maintained, and owned by small teams of two to four developers, and there are several overlaps between these micro teams.\n Nobody in the team has any background in finance, and apart from a handful of developers, most have no prior work experience either. Everyone has been a hacker or a hobbyist straight out of college. What colleges, neither do we ask, nor do we keep a track of.\n That a 30 member tech team has built and scaled a complex financial + stock broking stack from the ground up, built a whole suite of financial software for end users that people actually appreciate in an extremely complex, constraining, and rapidly changing regulatory environment, with zero prior industry knowledge, is quite a feat. More of an anomaly than a feat. I, however, find it natural and poignant that a group of hackers in the right environment guided by the right philosophies can be incredibly creative and productive, even in a place as unfashionable and uncool as the Indian stock broking industry. What used to be the norm—small groups of hackers building good software—has now transmogrified into being the exception.\n  Zerodha became the largest stock broker in India in January 2019, trumping stock brokerages operated by mega-banks. We achieved this slowly and organically. We have never raised external funding, have zero debt, and have been profitable YoY. We do not have a marketing team, have not advertised anywhere, and have let our services and products speak for themselves, building our userbase, brand, and trust over the years.\n  15-20% of all daily retail trade and investment volumes across all Indian stock exchanges pass through our apps.\n We have ~1 million daily active users placing millions of trades in realtime across various Indian exchanges, totalling to over $3 billion in volumes. In early March when Charles Schwab (US)  reported a new record of 2.7 million trades in a day, we did 7+ million trades. Of course, the comparison is on the scale of activity, and not on the quantum (USD vs. INR) of trades. In the last financial year that just ended, we executed more than 1 billion trades.\n Our systems process hundreds of thousands of requests per second during peak market hours. We broadcast ~16 million market ticks per second to hundreds of thousands of concurrent users. Thanks to careful byte-by-byte optimisations, the bandwidth bills are negligible.\n We construct and serve detailed portfolio reports, breakdowns, and visualisations instantly from our Postgres nodes that store hundreds of billions of rows of investment records.\n  Here is a quick, broad, overview of our stack, before we start getting into deep-dive posts in the near future.\n All of our performance-critical, high throughput services are written in Go. We have not received any unsolicited advice asking us to rewrite everything in Rust or Nim (yet).\n Data-heavy backoffice systems where realtime performance is not a bottleneck, are written in Python. Django and Flask for certain web apps.\n  Countless complex business, financial, account, people processes and backoffice applications are built atop  ERPNext. Thank universe for ERPNext.\n  Flutter for iOS and Android mobile applications. Gave up on native Android/Java, Swift, and React Native and rewrote everything in Flutter. Granted, there is still one React Native app.\n Self-managed Postgres instances with hundreds of billions of rows. MySQL instances with billions of rows as owing to certain dependencies.\n Self-managed Redis instances in high throughput hotpaths. There are few pieces of software that are so unbelievably automagical.\n       ELK stack for logs, where storing terabytes of searchable logs for several years is a regulatory requirement.\n Hybrid infra. Physical racks where numerous exchange leased lines terminate + AWS. Sometimes, these leased lines go down when the civic body in Mumbai digs up roads.\n  These are some of the broad guiding principles that have happened to work for us.\n Neither large teams for the sake of “growth”, nor  10x ninja developers, are meaningful. What matters is that a group of good developers, no matter how small, are able to work well together.\n Rigid methodologies tend to fail. People, teams, requirements, and environments are infinitely different and dynamic. A methodology unique to an environment and a team has to be modeled, in the same vein as “ right tool for the right job&#34;.\n Tech stacks should follow “ right tool for the right job” and should evolve organically. One probably does not need a cluster of K8s clusters (or K8s or Docker at all), or an end-to-end CI/CD platform powered AI and Blockchain on day one, or ever. Every choice made in adopting a technology has serious long term ramifications.\n Keep the code and stack as non-fancy and simple as possible. Heavy on common sense and light on coolness. For example, avoid microservice hells and monolith monsters with the right trade-off.\n FOSS-first. FOSS-only, really. We use and produce FOSS (and this year, we’re starting a FOSS fund).\n Don’t be afraid to self-host. We self-host the company’s employee intranet and HR systems, support ticketing and CRM, internal forum and chat systems, financial backoffice and accounting applications, monitoring and logging infrastructure, mail servers, databases, proxies; pretty much everything. Everything with role-based access controls and granular permissions behind OAuth + 2FA. For developers, password-less certificate based SSH logins. All FOSS.\n A tech team should be run with a developer-centric approach, and not a business or management-centric one.\n Technical decisions, even the ones with business implications, should be made by technical people. Otherwise, in comes the feature-creep, bloat, technical debt, and burnouts.\n Absolutely every decision—people, technology, operational, product—is a trade-off. Every trade-off should strike a balance between the right technical and business facets, developer and management teams, and products and end users. Making the right trade-off is an art.\n Be extremely wary of technical debt. Know when to scrap and rewrite systems. We have scrapped and rewritten the majority of our stack, including our critical trading platforms, multiple times, improving them significantly with each iteration. These are tough decisions; extremely important trade-offs. Of course, non-interference from non-technical management is incredible luck.\n  Structure the organisation and organisational processes like standalone, inter-operable units of a well architected software system. On the 12th of March 2020, owing to the COVID-19 emergency, we were able to go fully remote overnight for all ~1200 employees across all departments. There was minimum hassle, thanks to how we had structured and architected the whole organisation’s workflows, systems, and interactions like a well designed, modular, software system.\n This approach also helped us open up the organisation as a set of APIs creating a  “Broking as a Platform” system, enabling several startups to enter the investment-tech space by plugging into us, in turn, helping us kick start a  fintech fund that has now invested in over a dozen startups.\n Build organic, meaningful relationships with non-tech teams within the organisation. We work with small non-tech teams within the organisation (subsets of support and finance) to critique and validate products, gather feedback and data, and to do QA from a finance perspective.\n Be extremely particular about quality and consistency. That extra 50 KB of Javascript, or that 100 KB PNG on a web app, or that sudden 10ms spike in mean latency, are not acceptable. No matter how negligible the cost may be, it is a matter of principle of good engineering. It is okay to pause for a bit to do things the better way.\n Good design is paramount. Building software for humans with no consideration for human interactions and sensibilities is criminal. Keep UIs and interactions simple, typography crisp, clutter minimal, and spacing calm. We keep iterating for as long as it takes to strike the right balance between “aesthetically pleasing” and “easily usable”.\n Consider technology costs as engineering challenges. Always optimise where possible and don’t spend what is not absolutely necessary. Frugality and moderation should be second nature to hackers.\n Not every line of code that is written is going to be ingenious or innovative, and much of the work can be often tedious. That is how the real world works and is a fact that every developer should accept and internalise.\n A developer should dabble in everything (frontend, backend, testing and QA/QC, infrastructure, devops), and build focus gradually and naturally.\n Don’t be afraid to do feature-freezes to build tech the better way. It is okay to slow down to build cleanly, as what is built now will have serious implications in the future. The “time-to-market” fervour is often overhyped and short-sighted. This has never been an impediment to us. In fact, following this approach has allowed us to build and take a large number of things to market at an incredible pace.\n Trust developers and tolerate (even terrible) mistakes. The key is in learning by trial and error and not repeating the same mistakes. Not everyone is a  10x hotshot ninja, and that is okay. Everybody has their own critical role to play. Be patient and let talent grow. If someone fails to respect this and keeps repeating the same mistakes, then they probably won’t cut it. Fortunately, we have had very few instances of this.\n It is important for developers to find work meaningful to remain creative and productive. Everybody in the team has various systems that they have built and own, maintain, control, and are responsible for. In addition, we have an ESOPs program that increments a team members’ ownership of the company as they mature and grow in their roles—ESOPs whose value is derived from actual profits. This is in addition to a share of the fintech startup investments. This obviously did not become possible on day one (we never took external funding). We have gotten here gradually, thanks to how the team and the business have evolved.\n  Having fun is extremely important. If there is an opportunity to make things fun, irrespective of how “serious” the status quo of an environment is, things should just be made fun. What matters at the end of the day is the quality of work. “Non-stop memes and burns a day, help keep the stress and tedium away”. We have been playing Counter Strike Condition Zero (1.6) LAN matches on Steam every evening without fail for over five years now. Never gets old, except for getting shot in the head mercilessly by n00bs.\n Our work, products, failures, and even successes, are to be made fun of. Nothing is sanctimonious. There’s a meme in everything. This has helped us cope with the ire from downtimes we have faced in the past, stemming from elements outside of our stack and control.\n Realise that nothing is absolute and everything is absurd (see the COVID-19 world). There are no rules to building a healthy and successful team. Common sense + effort + fun + luck.\n Accept and appreciate luck. The countless tiny decisions and trade-offs that have resulted in a successful outcome, is luck as much as it is code. Of course, the odds are proportional to the amount of work and passion invested. That we ended up in the right environment (no tech vs. management divide. Thanks  Nithin.), that our products worked, that we are in a position to do what we love, earn a living, and have fun, is luck.\n In all honesty, as a hobbyist developer with no prior experience working in a corporate structure or managing a team, I did not have anything to go by except for the hacker-first approach, and great luck in finding like-minded hackers who can meme-burn all day long, while continuously learning and producing quality work.\n  I am excited by the prospects of this blog. It has been long overdue. We are eager to use Zerodha as a case study to illustrate that it is possible to build not just good software, but large enterprises (“Unicorns”), with small teams of hackers, even in the unlikeliest of industries. Hopefully, members of the tech team will start finding time to make semi-regular appearances on this blog with their own experiences and technical insights.", "posttime": "2020-05-07 23:33:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "世界,zerodha,团队", "title": "你好，世界-Zerodha，印度最大的股票经纪人", "title_en": "Hello, World – Zerodha, India's largest stock broker", "transed": 1, "url": "https://zerodha.tech/blog/hello-world/", "via": "", "real_tags": ["世界", "zerodha", "团队"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001105, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是“反应钩子的评论”的后续，它超出了预期，引发了大量的讨论，我很喜欢读这些讨论。如果你还没有读过，请在破坏测验之前绕道而行！我不是一个重复谈论一个主题的人，但在看到所有的测验结果出来后，我认为在讨论中分享这些结果以及一些关于共同主题的想法是有价值的。\n在写这篇文章的时候，有2600多人回答，这是我所做过的最大的不科学测验的样本大小！即使忽略了最后一个主要是为了搞笑的问题，结果仍然非常有趣。尽管有四分之三的问题获得了正确的普选，但中位数是1分(满分4分)。对我来说，这表明人们熟悉一些钩子，但还没有用过测验中包括的所有钩子。\n第一个也是最简单的问题有最高的正确率，这并不令人惊讶。然而，超过40%的人感到惊讶的是，在呈现两个组件之后，子组件的useEffect在父组件之前触发。\n当我第一次运行它时，这让我很惊讶，但当您花一分钟时间考虑它时，它就有意义了。这两个useLayoutEffect都在useEffect之前运行，并且它们从组件树的底部向上运行。希望你永远不会遇到这种特殊顺序很重要的情况，因为只有30%的人第一眼就能预测到顺序。\n这个问题有一个故意的缺陷，就是创建一个新的对象，不断地重现，并将它作为道具传递给孩子，这会导致备忘录运行你们三分之一的人捕捉到的每一个重现。将这些结果与围绕类似错误的问题进行比较会很有趣，该问题是在渲染器内创建函数并将其传递给子对象，每次父对象执行此操作时都会导致子对象重新呈现：\n函数父(属性){函数doSomething(){//…。道具…。}return&lt；Child on Something={DoSomething}/&gt；}。\n这是通过useCallback钩子修复的，测验问题是通过useRef更新对象或重构子对象的道具以不将对象作为道具修复的。这两种情况都可以来自重构类组件，在这种情况下，您的类方法或属性不会在每次呈现时都重新创建。在转换时，您必须牢记这一点，并采取模糊处理惩罚，用钩子将它们包裹起来。\n这与需要重新呈现子组件但不需要重新呈现的错误类型相反。当需要useRef来维护对重新呈现的稳定引用，但随后添加了需要该值的子组件时，就会发生这种错误。如果整个引用作为道具传递，而不是当前值，子组件将不会被重新呈现，因为引用没有更改。与世隔绝，这应该不会太难发现，但当有许多道具被从不同的地方传递到一个组件时，可能会很棘手。\n有一些关于钩子是多么容易学的评论。虽然我同意阅读文档并了解钩子的工作原理不会花费太长时间，但充分理解它们的后果，以及您将遇到的错误，将是一个持续的过程。测验结果显示，即使你做对了每件事，你也很可能会和没有做对的人一起工作。\n增加更多的知识只会提高进入的门槛。每个开发者都应该努力消除尽可能多的进入壁垒，因为这样做最符合我们的利益。\n编程语言非常强大，因为它们为您提供了可以用多种不同方式组合在一起的构建块。如果您有块循环和函数，所有可能的组合都是有效的，包括嵌套。循环中的循环、函数中的循环、循环中的函数等。挂钩没有此属性。您不能在钩子内使用钩子(不包括仅是本机钩子的包装函数的自定义钩子)。你不能在循环中使用钩子。因此，当您从使用useRef处理一件事情到需要使用useRef处理多件事情时，您不能像处理任何其他语言构建块那样，将其简单地放在循环或数组中。你必须重新设计它才能和钩子一起工作。\n当你不可避免地进入调试阶段时，你应该从你期望发生的事情的心理模型开始，包括所有关于你在整个过程中将处于什么状态的假设。每当你一步一步或记录下来，当你的一个假设被打破时，你就知道你已经找到了这个错误的一部分。现在你只需要弄清楚为什么你的假设是错误的。\n在钩子执行顺序和弄清楚组件重新呈现的原因之间，可能很难创建应该发生什么的心理模型。\n不管你喜欢不喜欢钩子，我希望你通过这些帖子学到了一些东西，即使它不像我喜欢的那样普遍：)。\n回家更多博客帖子", "note_en": "This is a follow up to  A Critique of React Hooks which blew up beyond expectations and generated a ton of discussion that I enjoyed reading. If you haven&#39;t read it yet please take the detour before spoiling the quiz for yourself! I&#39;m not one to harp on a subject repeatedly but after seeing all the quiz results come in I thought it would be valuable to share them as well as a couple of thoughts across common themes in the discussion.\n  With over 2,600 responses at the time of writing this is the biggest sample size of an unscientific quiz I&#39;ve ever given! Even ignoring the last question which was mostly there for laughs, the results were still very interesting. The median score is 1 out of 4 questions despite 3/4 ths of the questions having a correct popular vote. To me this indicates that people are familiar with a few of the hooks but haven&#39;t used all the ones included in the quiz.\n    The first and simplest question had the highest percentage of correct answers to no surprise. However, over 40% of you were surprised that the  Child&#39;s  useEffect fires before the  Parent&#39;s after rendering both components.\n   This one surprised me when I first ran it but makes sense when you take a minute to think about it. Both  useLayoutEffect&#39;s run before the  useEffect&#39;s and they run from the bottom of the component tree upwards. Hopefully you&#39;ll never get into a situation where this particular ordering matters though since only 30% were able to predict the order at first glance.\n   This question has the intentional bug of creating a new object ever rerender and passing it to the child as a prop which causes the memo to run every rerender which a third of you caught. It would be interesting to compare these results with a question around a similar bug of creating a function inside the render and passing it to the child which causes the Child to rerender every time the Parent does:\n function Parent(props) { function doSomething() { // … props … } return &lt;Child onSomething={doSomething} /&gt;}\n This is fixed with a  useCallback hook, and the quiz problem is fixed by either updating the object via  useRef or refactoring the props of the child to not take an object as a prop. Both of these scenarios can come from refactoring a class component where you either have a class method or property that don&#39;t get recreated every render. When converting you have to keep this in mind and take the obfuscation penalty wrapping them with hooks.\n   This is the opposite sort of bug where a  Child component needs to be rerendered but isn&#39;t. It happens when  useRef is needed to maintain a stable reference over rerenders but then a child component is added that needs the value. If the whole ref is passed as a prop instead of the  .current value the  Child component won&#39;t be rerendered because the ref hasn&#39;t changed. In isolation this shouldn&#39;t be too hard to spot but can be tricky when there are many props being passed from different places to a component.\n   There were a few comments about how easy hooks are to learn. While I would agree that reading the docs and getting the gist of how hooks work doesn&#39;t take too long, fully understanding their ramifications, and the bugs you&#39;ll run into, will be an ongoing process. The quiz results show that even if you got everything right, you&#39;ll likely be working with someone that didn&#39;t.\n Adding more to learn just raises the barrier to entry. And every developer should be trying to remove as many barriers to entry  because it&#39;s in our best interest to do so.\n  Programming languages are powerful because they give you building blocks that you can compose together in many different ways. If you have the blocks  loop and  function, all the possible combinations are valid including nesting.  loop in  loop,  loop in  function,  function in  loop, etc. Hooks don&#39;t have this property. You can&#39;t use a hook inside a hook (excluding custom hooks that are just wrapper functions for the native hooks). You can&#39;t use a hook in a loop. So when you go from having one thing handled with  useRef to needing multiple things handled by  useRef you can&#39;t just stick it in a loop or array like you would with any other language building block. You  have to redesign it to work with hooks.\n  When you inevitably get to debugging, you should start with a mental model of what you expect to happen including all the assumptions about what state you&#39;ll be in throughout the process. Whenever you step or log your way through and one of your assumptions is broken, you know you&#39;ve found a piece of the bug. Now you just have to figure out why your assumption was wrong.\n Between the hook execution order and figuring out why a component rerendered it can be very difficult to create that mental model of what&#39;s supposed to happen.\n  Whether you like hooks or not, I hope through these posts you&#39;ve learned something even if it isn&#39;t as general as I&#39;d like :)\n   Back to home  More blog posts", "posttime": "2020-05-07 23:32:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "胡克,react,钩子", "title": "“反作用胡克斯附录”评析", "title_en": "A Critique of React Hooks Addendum", "transed": 1, "url": "https://dillonshook.com/a-critique-of-react-hooks-addendum/", "via": "", "real_tags": ["胡克", "react", "钩子"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001104, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2017年10月，人行道实验室和多伦多海滨开始规划码头的共同愿景，码头是一个通过技术和城市设计创新从根本上更可持续、更负担得起的社区。自从这个项目开始以来，我已经遇到了成千上万来自全市各地的多伦多人，他们对让每个人的城市生活变得更美好的可能性感到兴奋。\n因此，带着巨大的个人悲伤和失望，我分享了人行道实验室将不再从事码头项目的消息。\n在过去的两年半里，我们一直热衷于让码头成为现实-事实上，我们已经在多伦多投入了时间、人力和资源，包括在海滨开设了一个30人的办事处。但随着世界各地和多伦多房地产市场出现前所未有的经济不确定性，在不牺牲我们与多伦多海滨地区共同制定的计划的核心部分的情况下，让这个12英亩的项目在财务上可行变得太难了，该计划旨在建立一个真正包容、可持续的社区。因此，经过深思熟虑后，我们的结论是，继续进行码头工程，并在昨天让多伦多海滨知道是没有意义的。\n虽然我们不会继续这个特定的项目，但当前的卫生紧急情况让我们更加强烈地感受到重新想象未来城市的重要性。我相信，我们在过去两年半所发展的构思，将对解决城市大问题的工作，特别是在负担能力和可持续发展方面，作出有意义的贡献。这是一项重要的社会努力，人行道实验室将继续我们的工作，为之做出贡献。\n在这些方面，我们已经成立了创新的公司，解决城市移动性、下一代基础设施和基于社区的医疗保健问题，并投资了从机器人家具到数字电力等方方面面的初创公司。我们在内部继续致力于工厂制造的大规模木材建筑，它可以提高住房负担能力和可持续性，一种数字总体规划工具，可以改善生活质量和项目经济性，以及一种全电动社区的新方法。\n码头项目对我们来说很重要，这个决定是一个艰难的决定。我们感谢无数为该项目做出贡献的多伦多人，以及我们从社区团体、公民领袖和当地居民那里得到的支持。人行道实验室被多伦多提供的多样性、成长性和机会所吸引，这一观点在沿途的每一步都得到了肯定和加强。多伦多是世界上最伟大的技术创新中心之一，这一决定不会以任何方式削弱这一点。\n我们要特别感谢多伦多滨水区的每一个人所做的努力。他们与我们一起不知疲倦地工作，为了城市的最佳利益塑造码头。我们也要衷心感谢参与这项计划的三级政府公务员，他们愿意追求远大理想，同时又时刻为公众着想。我们谨此向参与这项计划的三级政府公务员致以诚挚的谢意，感谢他们愿意追求远大理想，并时刻为公众谋福利。\n最后，语言无法表达我对整个人行道实验室团队的工作的感激之情，他们为实现我们对码头的共同愿景付出了如此多的努力。", "note_en": "In October 2017, Sidewalk Labs and Waterfront Toronto set out to plan a shared vision for Quayside, a fundamentally more sustainable and affordable community resulting from innovations in technology and urban design. Since the project began, I’ve met thousands of Torontonians from all over the city, excited by the possibility of making urban life better for everyone.\n So it is with great personal sadness and disappointment that I share that Sidewalk Labs will no longer pursue the  Quayside project.\n For the last two-and-a-half years, we have been passionate about making Quayside happen — indeed, we have invested time, people, and resources in Toronto, including opening a 30-person office on the waterfront. But as unprecedented economic uncertainty has set in around the world and in the Toronto real estate market, it has become too difficult to make the 12-acre project financially viable without sacrificing core parts of the plan we had developed together with Waterfront Toronto to build a truly inclusive, sustainable community. And so, after a great deal of deliberation, we concluded that it no longer made sense to proceed with the Quayside project, and let Waterfront Toronto know yesterday.\n While we won’t be pursuing this particular project, the current health emergency makes us feel even more strongly about the importance of reimagining cities for the future. I believe that the ideas we have developed over the last two-and-a-half years will represent a meaningful contribution to the work of tackling big urban problems, particularly in the areas of affordability and sustainability. This is a vital societal endeavor, and Sidewalk Labs will continue our work to contribute to it.\n On these fronts, we’ve already started innovative companies addressing  urban mobility,  next-generation infrastructure, and  community-based healthcare, and invested in startups working on everything from  robotic furniture to  digital electricity. We continue to work internally on  factory-made mass timber construction that can improve housing affordability and sustainability, a  digital master-planning tool that can improve quality of life outcomes and project economics, and a new approach to  all-electric neighborhoods.\n The Quayside project was important to us, and this decision was a difficult one. We are grateful to the countless Torontonians who contributed to the project, and for the support we received from community groups, civic leaders, and local residents. Sidewalk Labs was attracted to Toronto by the diversity, growth, and opportunity the city has to offer, and that view has been affirmed and strengthened at every step along the way. Toronto is one of the world’s great centers of technological innovation, and nothing about this decision will in any way diminish that.\n We owe particular thanks to everyone at Waterfront Toronto for their efforts. They have worked tirelessly alongside us to shape Quayside in the best interests of the city. We would also like to extend our sincere appreciation to the devoted public servants at all three levels of government who were involved in this project for their willingness to pursue big ideas while always looking out for the public good.\n Finally, words cannot capture my appreciation for the work of the entire Sidewalk Labs team, who have given so much to bring our shared vision for Quayside to life.", "posttime": "2020-05-07 23:32:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人行道,labs,码头", "title": "人行道实验室不再研究多伦多码头项目", "title_en": "Sidewalk Labs no longer pursuing the Toronto Quayside project", "transed": 1, "url": "https://medium.com/sidewalk-talk/why-were-no-longer-pursuing-the-quayside-project-and-what-s-next-for-sidewalk-labs-9a61de3fee3a", "via": "", "real_tags": ["人行道", "labs", "码头"]}, {"category": "", "categoryclass": "", "imagename": "87fe618ee086d3ccf1bcd384c152bcd4.png", "infoid": 1001103, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你开发软件，在你的生活中，它在我的机器上运行的单词至少从你的嘴里溜走过一次。如果你在谷歌上搜索，你可能会找到开玩笑的表情包、贴纸和T恤。几十年来，开发人员在不同的机器上运行代码时一直受到意外错误的困扰。在容器时代，您可能认为这不再是问题，但仍然存在需要解决的缺陷和挑战。\n当我编写代码时，我只专注于一件事：尽可能快地向我的用户交付价值。在从事多年的开发工作后，我可以总结出实现该目标所需要的是：\n在这篇博客中，我分析了当前开发云原生应用的替代方案，以及它们在可复制性、开发/生产平价和快速内循环开发周期方面的表现。然后，我将介绍我们如何在Okteto使用我们所称的云-本地开发方法来解决这些挑战。\n去年，我们就如何构建软件采访了200多家不同的公司和软件团队。根据这些对话，我们发现当今最常见的开发工作流程是：\n让我们更详细地解释这些解决方案中的每一个，以及它们在开发/生产平价、可复制性和快速内循环开发周期方面的表现。\n作为开发人员，我们倾向于像我们的服务是在本地机器上运行的独立实体一样工作。我只需在热重载程序上运行编译器或中继，即可在我编写代码并立即在浏览器或本地命令行中测试结果时自动为我构建。\n这个迭代过程可能是最快的，您可以从增量构建和调试器中获益。但这种方法在设计上被打破了：\n您的应用程序及其依赖项在生产中运行的方式与此本地开发设置没有什么共同之处。您无处不在地嘲弄您的运行时依赖项。\n此开发工作流与DevOps区域性不符。事情通常会在生产前环境中破裂。操作员认为开发人员不知道如何编码，而开发人员认为操作员不知道如何运行他们的代码。\n使用容器使我离在本地环境中复制应用程序的复杂架构又近了一步。Docker极大地缓解了某些痛点：\n流行的工具，如Docker Compose或Minikube，允许我通过一个命令启动并运行我的应用程序的本地版本。但它也有不利的一面：\n丑陋的事实是，试图在本地运行整个堆栈，因为它将在生产中运行，这是很困难的。运行单一服务可能很容易，但大型基于微服务的应用程序、服务网格、网络配置、API网关、无服务器、遗留服务、繁重的数据库或CPU/内存密集型工作负载又如何呢？太疯狂了。\n那么，我通常如何处理不能在本地运行的依赖项呢？您必须在不同的环境中测试您的更改。您合并您的更改，您的应用程序可能会在几分钟内通过持续集成作业在某种阶段性环境中进行更新。\n但是，您有没有遇到过在本地设置中无法重现的CI、试运行甚至生产中出现的错误？由于我无法重现错误，我需要再次依靠持续集成来验证我的更改。起作用了吗？没有吗？再次启动此缓慢的进程…。😩.。\n下表总结了这些解决方案相对于开发/生产平价、可复制性和快速内环开发周期的行为：\n如您所见，对于我们正在寻找的开发环境，这些解决方案都不能令人满意。Devs Happy去👈，Ops Happy去👉。\n这些解决方案要么减慢我的内部循环周期，要么将真正的端到端测试推迟到稍后的阶段。试图解决这个问题让我们开始了Okteto。我们在Okteto的使命是将开发人员的生产力提升到一个新的水平。我们的前三个产品，Okteto CLI、Okteto Cloud和Okteto Enterprise(Okteto Cloud的内部版本)是迈向现代开发工作流程愿景的第一步。让我解释一下Okteto是如何解决开发/生产奇偶校验、可复制性和快速内循环周期的问题的：\n基于沙盒Kubernetes命名空间Okteto Cloud的生产型开发环境，开发者可以自助访问共享开发集群中的Kubernetes命名空间。每个命名空间都自动配置为与在同一集群上工作的其他开发人员隔离。虽然Ops希望开发人员在真实环境中进行开发，但开发人员不应该在本地安装Kubernetes，因为这需要硬件资源和对该技术更深入的了解。在四五个人以上和不同操作系统的团队中，这将成为一项非常繁琐的任务。\n一键部署应用程序以实现纯粹的可复制性，Okteto Cloud使启动您的应用程序和开发环境变得像点击一个按钮一样简单。开发人员可以立即从运维团队(由Helm 3支持)方便地配置的应用程序目录中部署或升级他们的应用程序。由于应用程序在共享集群中运行，开发人员可以利用集群中运行的平台服务，如无服务器框架、日志和指标聚合器、运行时安全检查器(如Falco)等。\n快速内循环：只需编码、构建和测试一旦应用程序启动并运行，Okteto CLI允许您在应用程序的一个或多个组件上启用开发模式，只需专注于开发。您可以使用您熟悉和喜爱的工具(包括调试器)在本地编写代码，Okteto会同步更改以即时更新您的应用程序。不需要提交、构建或推送。\nContainers和Kubernetes将我们的部署技术带到了一个新的水平，但是开发实践并没有以同样的速度发展。作为开发周期的一部分，开发人员需要访问可复制的、类似生产的环境，但不必放弃对开发人员生产力至关重要的快速内部循环。\n如果这个问题对您来说很熟悉，您应该检查一下我们在Okteto建造了什么。看看我们的入门指南，以云的速度开始开发。\n您有什么想法、评论或反馈吗？加入我们在Kubernetes社区的#okteto频道Slake，并与社区分享您的想法！", "note_en": "If you build software, the words  it works on my machine have slipped out of your mouth at least once in your life. If you Google it you’ll probably find memes, stickers, and t-shirts joking about it. Developers have been haunted for decades by unexpected errors when running code on different machines. In the era of containers, you might think this is no longer an issue, but there are still drawbacks and challenges that need to be solved.\n  When I am coding I’m focused on just one thing:  delivering value to my users as fast as possible. After many years working as a developer I can summarize that what I need to achieve that goal is to:\n  In this blog post, I analyze the current alternatives for developing cloud-native applications and how they behave on replicability, developer/production parity, and fast inner loop development cycle. I will then introduce how we solve these challenges in Okteto using what we call the  Cloud-Native Development methodology.\n  Last year we interviewed more than 200 different companies and software teams on how they build software. Based on these conversations we found out that the most common development workflows nowadays are:\n  Let explain in more detail each of these solutions and how they behave concerning development/production parity, replicability, and fast inner loop development cycle.\n  As developers, we tend to work like our service is an isolated entity running in our local machine. I simply run my compiler or relay on a  hot-reloader to automatically  build for me as I  code and  test the results immediately in my browser or local command line.\n  This iterative process is probably the fastest it can be and you benefit from incremental builds and debuggers. But this approach is broken by design:\n The way your application and its dependencies run in production has little in common with this local development setup. You are mocking your runtime dependencies everywhere.\n  This development workflow does not align well with the DevOps culture. Things will usually break in pre-production environments. Ops think Devs don’t know how to code and Devs think Ops don’t know how to run their code.\n  Working with containers gets me a step closer to replicating the complex architecture of an application in my local environment. Docker greatly alleviates certain pain points:\n  Popular tools like Docker Compose or Minikube allow me to get a local version of my application up and running with a single command. But it also comes with downsides:\n     The ugly truth is that trying to run an entire stack locally as it will run in production is hard. Running a single service might be easy, but how about large microservice-based applications, service mesh, network configuration, API gateways, serverless, legacy services, heavy databases or CPU/memory intensive workloads? Madness.\n So, how do I usually deal with dependencies I can’t run locally? You are forced to test your changes in a different environment. You merge your changes and somehow your application is updated in some sort of staging environment by a continuous integration job in hopefully a few minutes.\n  But have you ever struggled with bugs coming from CI, staging or even production that you cannot repro in your local setup? Since I’m unable to repro the bug, I need to rely on continuous integration again to validate my changes. Did it work? It didn’t? Start this slow process again… 😩.\n   The following table summarizes the behavior of these solutions versus development/production parity, replicability, and fast inner loop development cycle:\n  As you can see, none of these solutions is satisfactory for the properties we are looking for development environments. Devs happiness goes 👈👈👈 and Ops happiness goes 👉👉👉.\n  These solutions either slow my inner loop cycle down or postpone the real end-to-end test to a later phase. Trying to solve this problem led us to start  Okteto. Our mission at Okteto is to take developers’ productivity to the next level. Our first three products,  Okteto CLI,  Okteto Cloud and  Okteto Enterprise (the on-premise version of Okteto Cloud) are the first steps towards our vision of modern development workflows. Let me explain how Okteto solves the problems of dev/production parity, replicability, and a fast inner loop cycle:\n Production-like development environments based on sandboxed Kubernetes namespaces Okteto Cloud gives developers self-service access to Kubernetes namespaces in a shared development cluster. Each namespace is configured automatically to be isolated from other developers working on the same cluster. While Ops want developers to develop on a real environment, developers shouldn’t install Kubernetes locally as this requires hardware resources and deeper knowledge about this technology. In teams with more than 4 or 5 people and different operating systems, this would become a very cumbersome task.\n  One-click deployment of applications for pure replicability Okteto Cloud makes launching your applications and development environments as easy as clicking a button. Developers can instantly deploy or upgrade their applications from an Application Catalog conveniently configured by the Ops Team (backed by Helm 3). Since apps are running in a shared cluster, developers take advantage of platform services running in the cluster such as Serverless Frameworks, Logs and Metrics Aggregators, Runtime Security Checkers like Falco, etc.\n  Fast inner loop: just code, build and test Once your application is up and running, the  Okteto CLI allows you to enable  development mode on one or more components of your application and just focus on development. You code locally with the tools you know and love ( including debuggers) and Okteto synchronizes the changes to update your application instantaneously. No commit, build or push required.\n   Containers and Kubernetes have taken our deployment techniques to the next level, but the development practices have not evolved at the same speed. Developers need access to replicable, production-like environments as part of the development cycle, but without having to give up a fast inner loop that is crucial for developer productivity.\n If this problem sounds familiar to you, you should check out what we have built at Okteto. Take a look at our  getting started guide and start developing at the speed of the cloud.\n Do you have ideas, comments or feedback? Join us at the  #okteto channel in the Kubernetes community Slack and share your thoughts with the community!", "posttime": "2020-05-07 23:32:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,程序,开发,dev", "title": "针对云本地应用程序的即时开发环境", "title_en": "Instant dev environments for cloud-native apps", "transed": 1, "url": "https://okteto.com/blog/step-out-from-the-dark-ages-develop-the-cloud-native-way/", "via": "", "real_tags": ["app", "程序", "开发", "dev"]}, {"category": "", "categoryclass": "", "imagename": "dca77b523b602b1439c5f9daed02fe40.jpg", "infoid": 1001102, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当AMD宣布新的基于Zen 2的Ryzen 3处理器时，我的印象是这些处理器基本上是AMD成功的Ryzen 3000系列的废品。内部是一个单芯片，8个内核中只有4个活跃，最高可达4.3 GHz；但最令人兴奋的是高频版的低价120美元，或低速版的99美元。AMD以99美元的价格出售四核CPU已经有一段时间了，但这是新的内核和新的制造工艺，那么这会有什么不同呢？我们让他们和三年前的350美元四核对决。这在当时看起来是一个疯狂的想法。\n在成功推出Ryzen 9、Ryzen 7和Ryzen 5系列的Zen 2硬件之后，AMD一直坐在200美元以上的位置上。正如我们在对3950X、3900X和3700X等硬件的评论中指出的那样，在每个价位，该公司都提供了一个对抗竞争对手的令人信服的选择。其他的，比如Ryzen 53600，在亚马逊的畅销书排行榜上名列前茅。正如我们在最近的CPU购买者指南中指出的那样，在亚马逊CPU畅销榜的前10名中，AMD有8个，前5个。\n这对高端市场来说都是好事，但在200美元以下的类别中，这是成交量经常出现的地方。英特尔最近一直忽略了这一市场，因为对至强硅的异常高需求迫使制造业在28核硬件上花费了比四核硬件更多的时间。这为AMD敞开了大门，所以该公司在这里所做的事情总是很有趣的。在很长一段时间里，AMD什么都没做，把用户推到了Ryzen 2000硬件或Ryzen 3000 APU，这是因为它们卖得真的很好(Ryzen 2600/1600AF提供6个内核，价格低至85美元)。\n最近AMD推出了基于Zen 2和Vega的最新一代Ryzen Mobile APU，我们不确定AMD是否会用这些APU的台式机版本来填补这一不足200美元的缺口，还是提供更低装订的Ryzen 53000部件。在Ryzen Mobile4000非常成功地发布后，引发了一些精彩的评论，很明显，移动硅在市场上占据了很高的溢价，因此我们得到了基于马蒂斯的CPU，而不是200美元以下的细分市场。于是，在4月21日，AMD发布了新的Ryzen 3300X和Ryzen 33100处理器.。\n在99美元和120美元的价位填平底部是非常激进的。这里是AMD的最新一代Zen 2硬件，安装在7 nm TSMC高性能制造节点上，与GlobalFoundries的14 nm IO芯片捆绑在一起，封装频率高达4.3 GHz。在宣布的时候，我们注意到AMD在性能和价格上将与自己竞争很多。突然之间，85美元的Ryzen 5 1600AF只有在你想要6个Zen 1内核-4个频率更高的Zen 2内核和更高的IPC-纸面上99美元的价格时才看起来更诱人。\n这两款处理器都正式支持DDR4-3200，AMD重申DDR4-3600/3733对于那些购买更快内存的人来说是个不错的选择。两款芯片都有24条来自芯片组的PCIe 4.0通道：16条用于PCIe，4条用于M.2驱动器，4条用于芯片组。对于X570芯片组，这些芯片组应在PCIe 4.0模式下运行-对于B550芯片组和其他芯片组，这些芯片组通道将在PCIe 3.0模式下运行(见下文)。\nAMD对Ryzen 3300X和Ryzen 33100都进行了抽样检查。这些都是最近才到的，所以我们仍在根据几个基准对芯片进行基准测试。\n更便宜的构建的关键点之一往往是更便宜的主板。AMD和英特尔都向市场提供中低端芯片组，然后主板制造商用这些芯片组来制造更令人满意的产品，价格在60美元到120美元之间。从技术上讲，AMD今天也将推出B550芯片组，提供来自CPU的PCIe 4.0和来自芯片组的PCIe 3.0，然而关于这些主板的消息一直很少。我们还没有收到使用这些处理器进行测试的版本，这使得X570+Ryzen3的评测有点不真实。\nAMD已经向我们提供了与所有AM4主板一致的所有AM4处理器的主板兼容性图表的完整列表。由于BIOS大小的技术限制(即主板供应商使用的BIOS芯片太小)，在不同的主板上仅验证各种系列的硬件。大多数主板可能会接受这些指定之外的处理器，特别是如果供应商使用了更大的BIOS芯片，但是AMD正在加入这些指导方针，以使其更容易遵循。因此，虽然AM4被誉为可以支持“A系列到16核”的平台，而且它确实支持，但只支持几个主板-很少有主板(如果有的话)将支持全部硬件。\n至于B550，芯片组看起来与B450非常相似，但有一些升级。我们使用的是PCIe 3.0，而不是芯片组对PCIe 2.0的支持，它具有到处理器的PCIe 3.0上行链路。B550主板还将设计为支持来自CPU的PCIe 4.0，这意味着至少第一个(可能还有第二个)PCIe插槽将启用PCIe 4.0，并且还应该有一个M.2插槽。\n这些是更便宜的主板，所以我们不指望这里会有什么奇迹。B550的设计只支持3000系列马蒂斯CPU，因此AMD建议市场上目前的APU(3200G/3400G)如果真的能工作的话也不是真的适合这个主板。\nAMD声称有60多块B550主板正在开发中。其中一些看起来非常时髦，这让我想知道货架上会不会没有300美元的B550机型。这是个可怕的想法。\n随着英特尔在Comet Lake的另一代Skylake微体系结构上停留，以及到目前为止Ryzen 3000的竞争力，我热切地想看看AMD是否能够在四核级别上超过英特尔。在Kaby Lake(第七代酷睿)之后，英特尔最终停止了在顶层酷睿i7提供四核，酷睿i7-7700的功率为65 W，i7-7700K的功率为91 W。这些部件在2017年售价350美元，为7700K提供4.2 GHz的基频和4.5 GHz的涡轮增压。与3300X相比，这是一个频率优势，但3300X的IPC更好。\nAMD Ryzen 3 3300X：Zen 2，4C/8T，3.9-4.3 GHz，65 W，DDR4-3200，24x PCIe 4.0，120美元。\n英特尔酷睿i7-7700K：Kaby Lake，4C/8T，4.2-4.5 GHz，91 W，DDR4-2400，16x PCIe 3.0，350美元。\nAMD在2020年售价120美元的CPU能以仅三分之一的成本提供与英特尔2017年旗舰CPU相同的性能吗？\n不做更深入的探讨，人们可能会认为除了几百兆赫的频率和一些成本之外，Ryzen 3300X和Ryzen 33100几乎没有什么可区分的。令我们惊讶的是，它比这更深一层。由于存在任何装箱，AMD对这些芯片使用了两种不同的内核配置，尽管它们都是四核的。\n两款Ryzen 3处理器都有一个8核小芯片，其中只有4个内核处于活动状态。\n在Ryzen 3 3300X上，所有这四个内核都来自相同的四核CCX，为内核提供了一个统一的延迟平台供其使用。它采用‘4+0’配置，一个CCX完全激活，另一个禁用。\n在Ryzen 33100上，四个内核来自两个不同的CCX，这增加了延迟结构的额外复杂性。如果一个CCX中的核心想要与另一个CCX通信，它必须通过Infinity交换矩阵向外发送请求，这会增加延迟。这称为‘2+2’配置。\n这两种设计均采用16 MB的L3高速缓存构建，3300X全部位于一个CCX上，但3100拆分。\n这带来的性能损失很难预测。由于Ryzen 3 3100的内核数量比其他Ryzen硬件要少，所以这种拆分对Ryzen 3 3100的影响将会比其他硬件更明显。在我们方面，我们运行了核心到核心延迟测试。\n如您所见，对于Ryzen 3 3300X，我们采用统一延迟拓扑。\n而对于Ryzen 3 3100，由于速度较慢且采用双CCX布局，这意味着在CCX内部增加5+纳秒，但在CCX之间增加50+纳秒。撇开频率差异不谈，这将是我们评估的一个驱动因素。(注：Ryzen 3 3100速度较慢且采用双CCX布局，这意味着CCX内部增加了5+纳秒，但CCX之间增加了50+纳秒。)\n为了完整性，这里是酷睿i7-7700K，与CCX内的核心到核心相比，它在核心到核心的传输上几乎快了33%。\n发表评论他们付给他十几个第一代推土机CPU的新旧库存。只要在他们身上有AMD的标志就会让他非常高兴。不需要在他身上浪费好的产品；-)回复。\n我真心想知道你为什么这么想？你真的相信这篇文章能很好地展示英特尔的芯片吗？我更愿意看到一组不同的/最新的处理器进行比较，但您的评论令人困惑，呵呵。回覆。\n为什么？并不是所有人都是盲人的伊恩支持者。只是说得好像我们看到了一样。回覆。\nAMD的新处理器比英特尔(Intel)最新的旗舰处理器好，价格只有英特尔的三分之一，而英特尔的i3芯片几乎买不到，所以对于预算较低的游戏来说，这将是很棒的。英特尔付给你多少钱，他应该操纵基准测试吗？或者，他应该不专业地谈论英特尔，因为他的身份围绕着食客科技公司之间的头韵对立的绝对主义教条二分法？回覆。\n伙计！一大早就没那么多屁话了！我的第四杯咖啡还没开始喝。回覆", "note_en": "When AMD announced the new Ryzen 3 processors built on Zen 2, I was under the impression that these were essentially the reject parts from AMD’s successful Ryzen 3000 line. Inside is a single chiplet with only four cores active out of eight, pushing up to 4.3 GHz; but the kicker was the low price of $120 for the high frequency version, or $99 for a bit slower. AMD has sold quad-core CPUs at $99 for a while, but this is the new core and the new manufacturing process, so would this be any different? We put them up against a $350 quad core from three years ago. It seemed like a crazy idea at the time.\n  After successful launches of the Ryzen 9, Ryzen 7, and Ryzen 5 families of Zen 2 hardware, AMD has been sitting pretty at north of $200. At each price point, the company offered a compelling option against the competition, as we’ve noted in our reviews of hardware like the  3950X,  3900X, and  3700X. Others, like the Ryzen 5 3600, are some of the best sellers in Amazon’s top list. As we noted  in our recent CPU buyers’ guide, out of the top 10 spots on Amazon’s best seller list for CPUs, AMD has 8 of them, and the first 5.\n That’s all well and good for the higher end of the market, however in the sub-$200 category, this is where the volume often is. Intel has been neglecting this market of late, due to the  abnormally high demand for Xeon silicon forcing manufacturing to spend more time on 28-core hardware than quad-core hardware. This leaves the door open for AMD, so it was always going to be interesting what the company did here. For a long time, AMD did nothing, pushing users to its Ryzen 2000 hardware or Ryzen 3000 APUs, namely because they were selling really well (the Ryzen 2600 / 1600 AF offers 6 cores for as low as $85).\n With the recent launch of AMD’s  latest Ryzen Mobile generation APUs, based on Zen 2 and Vega, we were unsure whether AMD would fill this sub-$200 gap with desktop versions of those APUs, or offer lower binned Ryzen 5 3000 parts. After a very successful launch of Ryzen Mobile 4000, leading  to some stellar reviews, it was clear that the mobile silicon was commanding a strong premium in the market, and so we get Matisse based CPUs coming to the sub-$200 segment instead. With that, on April 21 st,  AMD announced its new Ryzen 3 3300X and Ryzen 3 3100 processors.\n  Filling the bottom at price points of $99 and $120 is very aggressive. Here is AMD’s latest generation Zen 2 hardware, on a 7nm TSMC high performance manufacturing node, bundled with a 14nm IO die from GlobalFoundries, packaged together with frequencies up to 4.3 GHz. At the time of the announcement, we noted that AMD is going to be competing with itself a lot here, for performance and price. Suddenly that $85 Ryzen 5 1600AF only looks appetizing if you want six Zen 1 cores – four Zen 2 cores at higher frequencies and higher IPCs for $99 on paper is probably the better deal.\n Both processors officially support DDR4-3200, and AMD is reiterating that DDR4-3600/3733 is a nice sweet spot for those purchasing faster memory. Both chips also have 24 PCIe 4.0 lanes from the chipset: 16 for PCIe, 4 for an M.2 drive, and 4 for the chipset. For X570 chipsets, these should be running in PCIe 4.0 mode – for B550 chipsets and others, these chipset lanes will run in PCIe 3.0 mode (see below).\n AMD sampled us both the Ryzen 3 3300X and the Ryzen 3 3100 for review. These only arrived recently, so we are still in the process of benchmarking the chips on a few benchmarks.\n  One of the key points for a cheaper build is often a cheaper motherboard. AMD and Intel both supply the market with mid-range and low-end chipsets, which motherboard manufacturers then use to build something more palatable in the $60 to $120 range. Technically AMD is also launching the B550 chipset today too, offering PCIe 4.0 from the CPU and PCIe 3.0 from the chipset, however news on these motherboards has been quite thin. We haven’t received one to test with these processors, which makes an X570 + Ryzen 3 review somewhat non-real world.\n  AMD has provided us will a full list of motherboard compatibility charts for all of the AM4 processors aligned with all of the AM4 motherboards. Due to technical limitations around BIOS size (i.e. motherboard vendors using too small of BIOS chips), only various families of hardware are verified in different motherboards. Most motherboards will likely accept processors outside these designations, especially if the vendor has used a larger BIOS chip, however AMD is putting these guidelines in to make it easier to follow. So while AM4 is heralded as a platform that can support ‘A-Series to 16-cores’, and it does, but only across several boards - very few boards (if any) will support the full gamut of hardware.\n As for B550, the chipset looks very similar to B450 but with some upgrades. Rather than PCIe 2.0 support from the chipset, we get PCIe 3.0, with a PCIe 3.0 uplink to the processor. B550 motherboards will also be engineered to support PCIe 4.0 from the CPU, which means at least the first (and perhaps the second) PCIe slot will be PCIe 4.0 enabled, and there should also be an M.2 slot.\n  These are the cheaper motherboards, so we’re not expecting any miracles here. B550 is designed to support 3000-series Matisse CPUs only, so AMD is suggesting that current APUs in the market (3200G/3400G) aren’t really suited for this board if they work at all.\n  AMD claims there are over 60 B550 motherboards in development. Some of them look very flash, which makes me wonder if there won’t be $300 B550 models on the shelves. That’s a scary thought.\n   With Intel staying on the Skylake microarchitecture for another generation in Comet Lake, and the competitiveness of Ryzen 3000 so far, I was keen to see if AMD is able to surpass Intel at the quad core level. Intel finally stopped giving us quad cores at the top Core i7 after Kaby Lake (7th gen Core), with the Core i7-7700 at 65 W and i7-7700K at 91 W. These were $350 parts in 2017, offering 4.2 GHz base frequency and 4.5 GHz turbo for the 7700K. That’s a frequency advantage over the 3300X, but the 3300X has a better IPC.\n AMD Ryzen 3 3300X: Zen 2, 4C/8T, 3.9-4.3 GHz, 65 W, DDR4-3200, 24x PCIe 4.0, $120\n  Intel Core i7-7700K: Kaby Lake, 4C/8T, 4.2-4.5 GHz, 91 W, DDR4-2400, 16x PCIe 3.0, $350\n Can AMD’s $120 CPU in 2020 give the same performance as Intel’s 2017 flagship CPU at only a third of the cost???\n   Without probing any deeper, one might assume there’s little to separate the Ryzen 3 3300X and the Ryzen 3 3100 aside from a few hundred MHz and some cost. To our surprise, it goes deeper than that. Due to whatever binning is in place, AMD is using two different core configurations for these chips, despite both being quad core.\n Both Ryzen 3 processors have a single eight core chiplet, from which only four cores are active.\n  On the Ryzen 3 3300X, all of those four cores come from the same quad-core CCX, providing a unified latency platform for the cores to use. It comes in a ‘4+0’ configuration, with one CCX fully active, and the other one disabled.\n  On the Ryzen 3 3100, the four cores come from two different CCXes, which adds extra complexity to the latency structure. If a core in one CCX wants to communicate with the other CCX, it has to send a request out through the Infinity Fabric, which adds latency. This is called the ‘2+2’ configuration.\n Both designs are built with 16 MB of L3 cache, and with the 3300X that is all on one CCX, but split for the 3100.\n  The performance penalty this incurs is difficult to predict. Because of the lower core count than the other Ryzen hardware, the effect of this split on the Ryzen 3 3100 is going to be more pronounced than others. On our part, we ran our core-to-core latency tests.\n  For the Ryzen 3 3300X, as you can see, we have a unified latency topology.\n  Whereas for the Ryzen 3 3100, as it is slower and has the dual CCX layout, this translates to a 5+ nanosecond addition to go within a CCX, but a 50+ nanosecond additional between CCXes.  Aside from the frequency difference, this will be a driving factor in our review.\n For completeness, here&#39;s the Core i7-7700K, which is almost 33% faster on core-to-core transfers against core-to-core within a CCX.\n  POST A COMMENT      They paid him with old new stock of a dozen 1st gen Bulldozer CPUs. Just having the AMD logo on them will make him blissfully happy. No need to waste good products on him ;-)  Reply\n  I genuinely want to understand why you think so? You really believe this article puts Intel&#39;s chips in a good light? Would&#39;ve preferred to see a set of different/recent processors in comparison but your comment is confusing lol.  Reply\n      Why? not all of them are blind Ian supporters. Just saying it like we seeing it.  Reply\n    &#34;AMD&#39;s new processor is better than Intel&#39;s recent flagship at a third of the price, and Intel&#39;s i3 chips are barely available so it will be great for budget gaming&#34; &#34;HOW MUCH IS INTEL PAYING YOU&#34;  What, should he have manipulated the benchmarks?  Or should he have unprofessionally craptalked Intel because his identity revolves around an alliterative antagonistic absolutist dogmatic dichotomy between fooking TECH companies?  Reply\n  DUDE! Not so many big ass words this early in the morning! My 4th cup of coffee hasn&#39;t kicked in yet.  Reply", "posttime": "2020-05-07 23:32:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,回顾,review,amd", "title": "AMD Ryzen 3 3300X和3100 CPU回顾：预算内的游戏财源", "title_en": "The AMD Ryzen 3 3300X and 3100 CPU Review: A Budget Gaming Bonanza", "transed": 1, "url": "https://www.anandtech.com/show/15774/the-amd-ryzen-3-3300x-and-3100-cpu-review", "via": "", "real_tags": ["游戏", "回顾", "review", "amd"]}, {"category": "", "categoryclass": "", "imagename": "f93981a440c78bd5977b13281184d8b7.jpg", "infoid": 1001101, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "五角大楼官员周三批评了美国联邦通信委员会(FCC)最近的决定，即允许总部位于弗吉尼亚州的卫星通信公司Ligado在全国范围内部署移动通信网络，称这可能对军方行动不可或缺的GPS定位信号产生不利影响。\n长期以来，GPS也一直是支持国家公共安全、执法医疗和医疗响应人员的一项关键技术。美国太空部队上将约翰·雷蒙德(John Raymond)在一次由他和其他五角大楼官员参加的听证会上告诉参议院军事委员会，它确实拯救了生命。虽然在家中的美国人通常不会受到有目的的电子攻击的威胁，但如果不保护GPS信号及其环境不受干扰，他们日常生活和生计所依赖的GPS服务也会受到威胁。\n国防部首席信息官Dana Deasy告诉委员会，Ligado提议的频谱将产生不可接受的作战影响，并对GPS的军事潜力产生不利影响。\n他补充说，在整个诉讼过程中，该部门明确表示，批准里加多的计划将对全国数百万民用和军用GPS接收器造成有害干扰。\n这是一个复杂的问题，但最终归结为风险。他在开场白中表示：我认为，为了一家公司及其投资者的利益，让使我们的国家和经济安全处于危险境地的GPS信号处于危险之中，并不是一个好主意。经过广泛的测试和分析，几乎每个联邦机构的专家都告诉我们，里加多的计划将干扰GPS系统。\n在一封关于周三听证会的信中，Ligado写道：考虑到GPS的重要性和国防部的担忧，FCC建立了一个全面的协调制度，要求Ligado在部署之前提供六个月的提前通知；拥有全天候监控能力、热线、停止蜂鸣器或关闭开关；与任何担心可能受到干扰的联邦机构直接合作；并自费维修或更换任何被证明容易受到有害干扰的政府设备。\n自2015年以来，这家卫星公司一直在研究一项利用L波段频谱的网络提案。L波段频谱被用来传输更多的GPS信号，因为它可以穿透云层、雾、雨、风暴和植被等障碍，这就是为什么国防部一直对该公司的计划持谨慎态度。Ligado表示，基于频谱的网络将允许电信公司部署5G网络。", "note_en": "Pentagon officials on Wednesday criticized the Federal Communications Commission (FCC) recent decision to allow Virginia-based satellite communications company Ligado to deploy a nationwide mobile network, saying that it could have adverse effects on GPS signals that are integral to the military&#39;s operations.\n &#34;GPS has also long been a critical technology that has supported the Nation’s public safety, law enforcement medical and medical responders. It literally saves lives,&#34; U.S. Space Force Gen.  John Raymond  told the Senate Armed Service Committee in a hearing that featured him and other Pentagon officials. &#34;While Americans at home are typically not under threat of purposeful electronic attack, the GPS services they depend on every day for life and livelihood are also threatened if the GPS signal and its environment are not protected from disruption.&#34;\n The Defense Department&#39;s chief information officer Dana Deasy told the committee that Ligado&#39;s proposed spectrum will have &#34;unacceptable operational impacts and adversely affect the military potential of GPS.&#34;\n  &#34;Throughout this proceeding, the Department made it clear that approving Ligado’s plans would cause harmful interference to millions of GPS receivers across the country, both civilian and military,&#34;  he added.\n  &#34;This is a complex issue, but it ultimately boils down to risk. And I do not think it is a good idea to place at risk the GPS signals that enable our national and economic security for the benefit of one company and its investors,&#34; he  said in his opening remarks. &#34;After extensive testing and analysis, experts at almost every federal agency tell us that Ligado’s plan will interfere with GPS systems.&#34;\n  In a letter to the committee in regards to its hearing Wednesday, Ligado wrote: &#34;In recognition of the importance of GPS and the concerns of the DoD, the FCC established a comprehensive coordination regime that requires Ligado to provide six-months advance notice before deploying; to have a 24/7 monitoring capability, a hotline, a stop buzzer or kill switch; to work directly with any federal agency with concerns about the potential for interference; and to repair or replace at Ligado’s cost any government device shown to be susceptible to harmful interference.&#34;\n Since 2015, the satellite company has been working on a proposal for a network that would utilize the L-band spectrum. The L-band spectrum is used to transmit GPS signals as it can cut through obstacles such as clouds, fog, rain, storms, and vegetation, which is why the DoD has been wary of the company&#39;s plan. Ligado has said that a network based on the spectrum would allow telecom companies to deploy 5G networks.", "posttime": "2020-05-07 23:32:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "5g,官员,official,gps", "title": "五角大楼官员：FCC关于5G的决定威胁GPS，国家安全", "title_en": "Pentagon official: FCC decision on 5G threatens GPS, national security", "transed": 1, "url": "https://thehill.com/policy/defense/operations/496555-pentagon-official-fcc-decision-on-5g-threatens-gps-national", "via": "", "real_tags": ["5g", "官员", "official", "gps"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001100, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "jakub jelinek jakub@redhat.com清华5月7日12：59：59格林尼治标准时间2020距离上一个主要的GCC版本发布已经过去了一年时间，距离GCC的第一个公开版本和GCC开发人员今年早些时候从svn到git的存储库转换已经过去了33年。今天，我们很高兴地宣布另一个重要的GCC版本10.1。这个版本在编译器和库方面对C++20语言的支持方面取得了很大的进展[1]，一些C2X。甚至还有一个新的实验性静态分析通道[2]。一些用较早的GCC版本编译成功的代码可能会要求更改资源，有关详细信息，请参阅http://gcc.gnu.org/gcc-10/porting_to.html。有关GCC 10.1的更改的更多信息，请参见https://gcc.gnu.org/gcc-10/changes.htmlfor。此版本可从此处列出的http://www.gnu.org/order/ftp.htmlThe服务器获得：http://www.gnu.org/order/ftp.htmlThe版本位于GCC/GCC-10.1.0/子目录中。如果您在使用GCC 10.1时遇到困难，请不要直接联系我。相反，请访问http://gcc.gnu.org获取有关获得帮助的信息。如果没有许多贡献者的支持，驱动一个领先的自由软件项目(如GNU编译器集合)是不可能的。更不用说它的开发人员，特别是它的定期测试人员和用户，他们对它的高质量做出了贡献。个人名单太长，无法单独感谢！请考虑向GNU工具链基金捐款，以支持GCC的持续发展！[3]-[1]请参阅https://gcc.gnu.org/projects/cxx-status.html，和https://gcc.gnu.org/onlinedocs/libstdc++/manual/status.html#status.iso.2020[2]请参阅https://developers.redhat.com/blog/2020/03/26/static-analysis-in-gcc-10[3]请参阅https://my.fsf.org/civicrm/contribute/transact?reset=1&amp；ID=57", "note_en": "Jakub Jelinek  jakub@redhat.com    Thu May 7 12:59:59 GMT 2020  A year has lapsed away since the release of last majorGCC release, more than 33 years passed since the firstpublic GCC release and the GCC developers survivedrepository conversion from SVN to GIT earlier this year.Today, we are glad to announce another major GCC release, 10.1.This release makes great progress in the C++20 language support,both on the compiler and library sides [1], some C2X enhancements,various optimization enhancements and bug fixes, several newhardware enablement changes and enhancements to the compiler back-endsand many other changes. There is even a new experimental staticanalysis pass [2].Some code that compiled successfully with older GCC versions might requiresource changes, see  http://gcc.gnu.org/gcc-10/porting_to.html fordetails.See  https://gcc.gnu.org/gcc-10/changes.htmlfor more information about changes in GCC 10.1.This release is available from the FTP servers listed here:  http://www.gnu.org/order/ftp.htmlThe release is in gcc/gcc-10.1.0/ subdirectory.If you encounter difficulties using GCC 10.1, please do not contact medirectly. Instead, please visit  http://gcc.gnu.org for information aboutgetting help.Driving a leading free software project such as GNU Compiler Collectionwould not be possible without support from its many contributors.Not to only mention its developers but especially its regular testersand users which contribute to its high quality. The list of individualsis too large to thank individually!Please consider a donation to the GNU Toolchain Fund to support thecontinued development of GCC! [3]----[1] See  https://gcc.gnu.org/projects/cxx-status.html, and  https://gcc.gnu.org/onlinedocs/libstdc++/manual/status.html#status.iso.2020[2] See  https://developers.redhat.com/blog/2020/03/26/static-analysis-in-gcc-10[3] See  https://my.fsf.org/civicrm/contribute/transact?reset=1&amp;id=57", "posttime": "2020-05-07 23:32:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,gcc", "title": "GCC 10.1发布", "title_en": "GCC 10.1 Released", "transed": 1, "url": "https://gcc.gnu.org/pipermail/gcc-announce/2020/000163.html", "via": "", "real_tags": ["发布", "gcc"]}, {"category": "", "categoryclass": "", "imagename": "4d6ebfd7fa31dc5f88fadd07a75f5f5f.png", "infoid": 1001098, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "关于NPM收购的一些思考-总体来说，这是一个令人悲伤的故事。除了极少数例外，每个人都输了。它可能以一笔交易结束，但这对任何人来说都不是胜利(除了一个人)。完全披露-我投资了钱，但输了。", "note_en": "Some thoughts on the npm acquisition - Overall, it is a sad story. With very few exceptions, everyone lost. It might have ended with a deal, but it wasn't a win for anyone (except one person). Full disclosure - I invested money and lost.", "posttime": "2020-05-07 23:31:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "hammer,投资", "title": "Eran Hammer谈NPM", "title_en": "Eran Hammer on NPM", "transed": 1, "url": "https://threader.app/thread/1258080677464956929", "via": "", "real_tags": ["hammer", "投资"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001097, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欧洲首个国家、政府支持的基本收入实验在鼓励受助者就业方面没有起到太大作用，但确实改善了他们的心理健康、信心和生活满意度，这是对芬兰一项计划的首项大型研究，该计划吸引了人们对冠状病毒爆发的新兴趣。\n赫尔辛基大学的研究人员总结道：“与对照组相比，领取基本收入的人对自己的生活更满意，精神压力更小。”“他们对自己的经济福利也有更积极的看法。”\n这项研究发布之际，冠状病毒危机带来的毁灭性经济后果-包括全球失业率飙升-引发了人们对基本收入计划的新兴趣。教皇在复活节讲话中建议，“现在可能是考虑普遍基本工资的时候了”。\n西班牙政府上月表示，其目标是“尽快”向该国约100万户最贫困的家庭提供基本收入，经济部长纳迪亚·卡尔维诺(Nadia Calviño)表示，社会党领导的政府希望普遍的基本收入能成为“一种永久性的工具”。\n苏格兰首席部长尼古拉·斯特金(Nicola Sturjo)本周表示，病毒及其经济后果“让我更加强烈地认为，(全民基本收入)是一个时机已经到来的想法”。\n芬兰在2017年和2018年实施了这项为期两年的计划，吸引了国际社会的广泛兴趣，该计划向全国随机选择的2000名失业人员支付了560欧元(GB 490)的固定月收入，没有义务寻找工作，如果他们接受了工作，也不会减少他们的工资。\n该计划的主要目的是看看有保障的收入是否会鼓励人们从事往往是低薪或临时工作，而不担心失去福利，严格来说，该计划并不是一个普遍的基本收入试验，因为受助人来自一个受限制的群体，而且这些款项不足以维持生活。\n但它受到了其他政府的密切关注，他们认为基本收入不仅是让更多人从事某种形式工作的一种方式，也是减少对国家的依赖和削减福利成本的一种途径。有预测称，自动化可能会威胁到目前高达三分之一的工作岗位，这一想法已经获得了支持。\n研究人员对该计划的参与者进行了81次深入采访，得出的结论是，虽然他们的经历存在显著的多样性，但他们通常对自己的生活更满意，经历的精神压力、抑郁、悲伤和孤独比对照组要少。\n研究人员还注意到，这对就业有轻微的积极影响，特别是在某些类别，比如有孩子的家庭，并补充说，参与者在其他幸福感指标上也往往得分更高，包括更大的自主感、经济安全感和对未来的信心。\n领导这项研究的海伦娜·布隆伯格-克罗尔教授说：“一些人说，基本收入对他们的生产力没有任何影响，因为在他们接受培训的地区仍然没有工作岗位。”“但其他人说，有了基本收入，他们准备接受低薪工作，否则他们就会避免。\n“一些人说，基本收入让他们可以回到失业前的生活，而另一些人则说，这让他们有能力对低薪、没有保障的工作说不，从而增加了他们的自主感。”\n布隆伯格-克罗尔说，该计划还给了一些参与者“尝试实现梦想的可能性”。“自由职业者、艺术家和企业家对基本收入的影响有更积极的看法，一些人认为这为他们创造了创业的机会。”\n它还鼓励一些参与者更多地参与社会，例如通过从事志愿工作。研究人员之一克里斯蒂安·克罗尔(Christian Kroll)说：“一些人发现，有保障的收入增加了他们做一些事情的可能性，比如为家人或邻居提供非正式护理。”\n“基本收入的保障让他们可以做更有意义的事情，因为他们觉得这使这种护理工作合法化。”在这两年的时间里，许多从事这种无偿活动的人将其称为工作。\nKroll说，研究结果可以支持支持和反对基本收入的论点。“但正如我们都在2020年初认识到的那样，没有安全感并不是一种好的生活方式，”他说。\n“虽然基本收入不能解决我们所有的健康和社会问题，但人们肯定会讨论，在经济困难时期，它可能是解决方案的一部分。”", "note_en": "Europe’s first national, government-backed basic income experiment did not do much to encourage recipients into work but did improve their mental wellbeing, confidence and life satisfaction, according to the first big study of a Finnish scheme that has attracted fresh interest in the coronavirus outbreak.\n “The basic income recipients were more satisfied with their lives and experienced less mental strain than the control group,”  the study, by researchers at Helsinki University, concluded. “They also had a more positive perception of their economic welfare.”\n The study comes as the devastating economic fallout from the coronavirus crisis - including soaring unemployment worldwide - sparks renewed interest in basic income schemes. The pope suggested in his Easter address that “this may be the time to consider a universal basic wage”.\n The  Spanish government said last month it aimed to roll out a basic income “as soon as possible” to about a million of the country’s poorest households, with the economic affairs minister, Nadia Calviño, saying the Socialist-led government hoped a universal basic income would become “a permanent instrument”.\n Scotland’s first minister, Nicola Sturgeon, said this week the virus and its economic consequences had “made me much, much more strongly of the view that [universal basic income] is an idea that’s time has come”.\n Finland’s two-year scheme, which ran in 2017 and 2018 and attracted widespread international interest, paid 2,000 randomly selected unemployed people across the country a regular monthly income of €560 (£490), with no obligation to seek a job and no reduction in their payment if they accepted one.\n Aimed primarily at seeing whether a guaranteed income might encourage people to take up often low-paid or temporary work without fear of losing benefits, the scheme was not strictly speaking a universal basic income trial because the recipients came from a restricted group and the payments were not enough to live on.\n But it was watched closely by other governments who see a basic income not only as a way to get more people into some form of work, but also as a route to reducing dependence on the state and cutting welfare costs. The idea has gained traction amid predictions that  automation could threaten up to a third of current jobs.\n The researchers, who conducted 81 in-depth interviews with participants in the scheme, concluded that while there was significant diversity in their experiences, they were generally more satisfied with their lives and experienced less mental strain, depression, sadness and loneliness than the control group.\n The researchers also noted a mild positive effect on employment, particularly in certain categories, such as families with children, adding that participants also tended to score better on other measures of wellbeing, including greater feelings of autonomy, financial security, and confidence in the future.\n “Some people said the basic income had zero effect on their productivity, as there were still no jobs in the area they were trained for,” said Prof Helena Blomberg-Kroll, who led the study. “But others said that with the basic income they were prepared to take low-paying jobs they would otherwise have avoided.\n “Some said the basic income allowed them to go back to the life they had before they became unemployed, while others said it gave them the power to say no to low-paid insecure jobs, and thus increased their sense of autonomy.”\n The scheme also gave some participants “the possibility to try and live their dreams”, Blomberg-Kroll said. “Freelancers and artists and entrepreneurs had more positive views on the effects of the basic income, which some felt had created opportunities for them to start businesses.”\n It also encouraged some participants to get more involved in society, by undertaking voluntary work, for example. “Some found the guaranteed income increased the possibility for them to do things like providing informal care for their family or their neighbours,” said one of the researchers, Christian Kroll.\n “The security of the basic income allowed them to do more meaningful things, as they felt it legitimised this kind of care work. Many of the people who performed such unpaid activities during the two-year period referred to it as work.”\n Kroll said the results of the study could support arguments both for and against basic income. “But as we’ve all learned in the early part of 2020, insecurity is not a good way to live,” he said.\n “While basic income can’t solve all our health and societal problems, there is certainly a discussion to be had that it could be part of the solution in times of economic hardship.”", "posttime": "2020-05-07 22:49:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发现,basic,收入", "title": "研究发现，芬兰基本收入试点改善了福祉", "title_en": "Finnish basic income pilot improved wellbeing, study finds", "transed": 1, "url": "https://www.theguardian.com/society/2020/may/07/finnish-basic-income-pilot-improved-wellbeing-study-finds-coronavirus", "via": "", "real_tags": ["发现", "basic", "收入"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001096, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "视频游戏行业一直在努力为非玩家角色(NPC)找到可访问和实用的方法，以便快速有效地做出智能决策。这导致了一系列创新，从帮助角色在3D环境中移动的导航网格，到游戏中的有限状态机，比如角色行为的半条命(Half Life For Character Behavior)。自2000年中期以来，由Halo2推广的行为树可以说是AAA视频游戏行业中最常用的技术。但在这篇文章中，我们将看看同时获得流行的另一种技术。让我们来看看目标导向的行动计划和推广它的游戏：第一次遭遇攻击侦察。\n要理解以目标为导向的行动计划--以及它在F.E.A.R和其他许多游戏中是如何使用的--我们需要看看它的理论来源：一种被称为自动计划的现有人工智能技术。自动化或人工智能规划是一个过程，通过这个过程，系统试图找出一系列行动，以实现设计者设定的遥远目标：这被称为计划。要做到这一点，我们用某种语言或编码对问题进行建模，这些语言或编码告诉我们关于当时世界的所有信息都是真实的。这些称为事实或谓词。一个简单的事实告诉我们一些我们以后可能需要知道的事情。我们存储了我们拥有的所有谓词，这些谓词都是关于世界在所谓的状态内的任何时间点的样子。\n例如，考虑一扇关闭的门，我们将其标记为“Door1”。我可能希望非玩家角色打开Door1，所以我需要在谓词中知道它是打开的还是关闭的。因此，我们当前的世界状态是一扇关闭的大门。现在，有了这些信息，我可以构建一个允许我打开它的操作。\n现在，每个动作通常分为三个部分：动作中涉及的对象(在本例中是一扇门)，动作前提条件-意味着在我可以应用动作之前，世界上的哪些事实必须为真-以及效果-它们表示由于完成动作、向世界状态添加新信息或删除不再为真的现有事实，世界将如何变化。比方说，我想让我的非玩家角色打开Door1，一些有效的开门动作的前提条件是门是关着的，并且NPC与门站在同一个房间里。一旦操作完成，效果就是门现在打开了。现在假设我们想从A房间走到B房间，但是他们之间的门是关着的。我们需要确保在我们的规划模型中解释门将房间A和B彼此连接，并且如果有一扇紧闭的门，您不能在房间之间走动。在这一点上，系统将创建一个计划，即打开门，然后从A房间走到B房间。将世界状态更改为全国人大现在在B房间的位置。\n简而言之，这就是计划的全部内容：弄清楚要做什么，按什么顺序做。这种编码问题并允许计划系统解决问题的过程就是为什么几十年来它一直是一个活跃和发展中的研究领域。虽然F.E.A.R在2005年帮助将规划带到了游戏中，但早在20世纪70年代，规划就已经被用于各种现实世界的物流问题。这包括机器人技术-从较小的家用设备到月球和火星漫游者之类的设备，对风力涡轮机、发电站和制造等大型机械系统的控制，以及搜救行动、军事规划和救灾等复杂空间问题。\n但这隐藏了一些更令人讨厌的细节。这些规划编码依赖于我们能够将我们正在解决的问题抽象为简单的东西，供规划者解决。回到开门的问题，我说全国人大需要在A房间，Door1连接这两个房间。这在计划模型中工作得很好，但是模型和现实生活中的工作方式之间有很多不同之处。例如，A房间通向B房间的门在哪里？人大需要朝着什么方向走向大门？事实上，在规划模型中，如果全国人大是在门相连的房间里，他们就可以打开门。这意味着这个小家伙现在显然是心灵感应的，可以从很远的地方用他们的思想打开大门？而不是更现实的解释，那就是NPC不仅需要在RoomA里，而且需要站在Door1旁边才能打开它。因此，虽然计划对于解决在给定情况下要做什么这一更大的问题很重要，但在世界上执行行动计划-无论是在现实世界中还是在视频游戏之类的模拟中-要困难得多。\n现在我们已经了解了什么是计划以及它是如何工作的，让我们来看看面向目标的行动P\n正如Orkin 2006年在麻省理工学院媒体实验室攻读博士学位时在游戏开发者大会上发表的文章中详细描述的那样，GOAP系统是由有限状态机驱动的。有限状态机是这样一个系统，在这个系统中，人工智能存在于一种行为状态中，然后根据发生的事件转换到另一种状态。然而，在Half Life中采用的FSM，在代码库中存在80多个独特的状态。尽管该状态是否可用由状态机控制的字符类型来确定。然而，在GOAP中，有限状态机只有三种状态：\n与所谓的智能对象互动：世界上人工智能角色可以与之互动的物品。\n现在你可能会有点困惑，但这一切都是基于对非玩家角色AI是如何工作的一个非常聪明的观察。如果你认为游戏中的敌人是敌人，他们所做的一切就是在某些情况下播放动画。当动画在正确的时间在正确的位置播放时，它就显得聪明，而当几个聪明的动画在一个序列中播放时，它就显得聪明。因此，这三个状态中的每一个最终都在播放动画。\n后藤：正在播放运动动画(无论是行走、跑步、跳跃、跳水还是攀登)，但它也在朝一个特定的位置前进。\n动画：就是简单地播放一个动画，这可以是承认玩家的存在，来射击他们的武器或者任何简单的闲置动画，这让NPC更有特色。\n最后使用智能对象：这是一种情况，比如让NPC按下开关，或者打开门，或者坐在椅子上，或者打翻桌子。在每种情况下，动画都直接与对象捆绑在一起，而且经常在游戏中-比如我在关于BioShock Infinition的AI的一集中找到的-对象会告诉角色的动画系统它需要做什么。\n因此，不是将每个可能的行为都枚举为单独的状态，而是在一个小得多、高度数据驱动的实现中执行整个事情，而不是更加扎实的状态机。它将执行传递到系统中的特定移动动作和动画，如果以正确的顺序执行几个移动、动画和使用智能对象状态，我们将获得一些智能外观行为。\n但是它如何知道处于什么状态，以什么顺序，以及向每个状态传递什么信息呢？这就是GOAP的计划部分发挥作用的地方。使用我们前面讨论过的计划编码，系统创建解决计划编码中的特定问题的计划，并使用A*搜索来查找解决问题时要采取的最佳行动。然后，生成的计划中的动作被转换为特定的FSM状态，其中传递的数据包括要移动的位置、要播放的动画和要与之交互的智能对象。\n为了更好地理解这在实践中是如何工作的，让我们揭开恐惧的面罩，探索GOAP是如何在游戏中被采用的。\n因此，让我们更深入地看看GOAP是如何应用于恐惧的。游戏C++代码库的部分内容已经公开发布了好几年。首先是Monolith发布了最初的恐惧SDK，然后是恐惧公共工具，因为建模人员一直在支持它。只需很少的努力，您就可以在Visual Studio中将其打开并通读AI源代码。因此，让我们来看看GOAP是如何在代码库中应用的，对于那些想亲自尝试的人，我在描述中留下了链接，供您查看。\n每个恐惧中的人工智能角色如果拥有任何类型的人工智能，都需要有指定的目标。这些目标是规划者将在动作空间中运行搜索，以便为该角色找到要执行的动作计划的目标。这适用于游戏中所有活跃的非玩家角色，从士兵和刺客到游戏结束时的噩梦幽灵，甚至是在地面上四处奔跑的老鼠，这是一个非常重要的问题，我会马上回来讨论。这意味着其他角色，如金善权和扬科夫斯基，甚至阿尔玛本人都是由设计师编写的。\n没有目标，AI角色实际上什么也做不了。他们需要被赋予要实现的目标，然后规划系统将致力于解决这些目标。游戏文件中仅编码了不到70个进球。在每种情况下，这些目标都可以被初始化、更新和终止，更关键的是，这些目标具有允许它们在游戏中的该时间点计算其总体优先级的功能。例如，如果一个士兵被分配了巡逻和杀死敌人的目标，但它不知道玩家在附近，那么杀死敌人的优先级将为0，而巡逻的优先级要高得多，因为有一个巡逻节点已经分配给了该角色。然而，如果它知道附近有一名球员，巡逻队的球门优先级要低得多，因为它认识到该球员现在对它构成了威胁。\n现在，为了让策划者解决这个目标，角色将拥有一个可供其搜索的动作集合。游戏中有120个动作，从简单的动画到不同的攻击变体，移动到不同的位置，使用智能对象节点，重新装填武器或只是闲置。它们都有自己对应的C++类。这些操作是在代码中设置的，但并非所有NPC都有权访问所有操作。设计者使用单独的数据库编辑器为每种敌人类型分配特定的动作，允许他们定制每个角色在解决他们的目标时的多才多艺。\n有了分配给给定角色的目标，它将等待机会访问规划器，并找到解决其当前情况的方法。这就是我早些时候暗示的更大的问题浮出水面的地方。系统需要找到这个特定角色可以执行的动作，在状态空间中搜索可能的动作，找到达到目标的计划，但所有这些都需要在执行期间根据游戏重新验证。这是因为在计划期间或在执行计划时可能会发生一些事情，而这些事情可能会破坏计划。回到前面的My Door示例，如果您正在生成打开门并在房间之间移动的计划，但在计划过程中或在执行该计划时，门被其他人或某事打开，则计划将无效。\n这是绝大多数计划系统面临的问题，因为它们本质上是相当存在主义的，并假设只有规划者才能改变世界。所以它不能容纳其他角色作为计划的一部分在世界上做事情。恐惧中的敌人人工智能都不知道彼此的存在，而合作行为只是两个人工智能角色被赋予的目标，它们很好地排列在一起，在执行时创造出看起来像是协调一致的行为。他们不仅不能走到世界上其他角色所站的导航点，而且对那个角色的存在一无所知。因此，如果另一个角色做了会破坏提议的计划的事情，那么每个角色都需要能够认识到这一点，这样它就会停止正在做的事情，并要求另一个计划。或者在必要时改变目标。\n这可以通过三种不同的方式来处理：首先，一旦制定了计划，系统将运行快速验证检查，该检查将获取世界状态的副本，在该副本上执行计划，并确保它将按预期实现目标，并且每个行动的前提条件和效果都按预期工作。其次，每个目标都可以覆盖ReplanRequired函数，该函数不断检查是否应该放弃当前计划并从计划器检索替换计划。一次很好的考试\n但是，如果该操作将按预期工作，则该操作在代码库中被“激活”。当发生这种情况时，它会告诉有限状态机要转换到这三个状态中的哪一个状态。并传递完成状态执行所需的所有数据。例如，假设一名士兵需要重新装弹，然后它转换到动画状态，并传递所需的特定动画参数，以便角色重新装弹。\n一旦人工智能角色成功地完成了他们设计的计划。然后，它将被分配一个新的，并可以重新计划。通过管理计划成功和失败的时间，这有助于保持游戏的节奏，确保人工智能总是知道该做什么，而不是无所事事地站在那里等着被慢动作击中脸部。事实上，恐惧中的计划长度通常相当短，通常是1-2个动作，只有少数几个达到3或4个动作的长度。考虑到游戏的整体节奏，这在很大程度上是有意义的。\n这就是说，这个目标管理和计划过程确实产生了一个问题，即使是Monolith的开发人员也多年来都不知道这个问题。正如Eric[Jacopin，2014]教授在2014年的一篇研究论文中详细描述的那样，他在论文中分析了GOAP策划者在恐惧中的表现，结果发现，由于老鼠的存在，这种持续的重新规划过程在游戏的某些层面上产生了很小的性能开销。正如我提到的，恐惧中的老鼠使用与士兵和其他战斗人工智能相同的系统。通常情况下，他们的计划非常简单，搬到世界上的另一个地方，如果他们在附近，最好远离玩家。老鼠重新计划的需要没有考虑玩家是否在附近。因此，你可以在关卡的开始几秒钟内遇到几只老鼠，20分钟后，当你在地图的另一边时，它们仍然在四处奔跑，计划新的行动。\n这远远不是对代码库的详尽概述，我确实鼓励任何能够使用C++的人通读一下代码，这对于游戏开发人员来说是非常有洞察力和价值的。\n恐惧对目标导向行动计划的使用至今仍被认为是现代视频游戏中一些最令人兴奋和有趣的敌人对手。虽然现在距离游戏发布已经将近15年了，但GOAP仍然在视频游戏行业产生着持久的影响。虽然远不是一个详尽的清单，但也有许多非常受欢迎的或邪教经典采用了这种方法或类似的方法。\n其中包括“被谴责的犯罪起源”、“S.T.A.L.K.E.R.：切尔诺贝利的影子”、“正义的原因2”、“Deus Ex Human Revine 2”、“古墓丽影”2013年的重启，以及Monolith最近推出的“中土：魔多的影子”和“战争的影子”。还有其他几集“人工智能与游戏”探索了它的应用，例如第14集的“变形金刚：为塞伯坦而战”，以及第22集的“帝国与拿破仑：全面战争”中的大幅修改的混合方法。在电子游戏中，规划仍然是一种流行的技术--尽管可以说并不像行为树那样普遍。但随着时间的推移，GOAP及其条带式方法现在不那么频繁地被采用，更多的当代游戏采用了另一种被称为分层任务网络(Hierarchical Task Network)或HTN计划的计划技术，这种技术已经在Killzone 2、Max Payne 3和Dying Light等游戏中使用。我将在未来的片段中专门介绍HTN的规划，但我已经在第14集的“变形金刚：塞贝特龙的倒下”和第37集的“地平线零点黎明”的视频中介绍了这种规划方法的实施。\n但就目前而言，我希望这能帮助每个人更好地理解为什么人们继续称赞恐惧的人工智能，以及正在采用的底层技术。我在下面列出了一些关于GOAP的其他有用资源，供您查看。", "note_en": "The video game industry has strived to find accessible and pragmatic approaches for non-player characters (NPCs) to make intelligent decisions quickly and effectively. This has led to innovations ranging from navigation meshes for helping a character move around a 3D environment to Finite State Machines in games such as  Half Life for character behaviour. Since the mid-2000’s Behaviour Trees, which were popularised by Halo 2, are arguably the most commonly applied technique in the AAA video game industry. But in this piece we’re going to take a look at the  other technique that achieved popularity at the same time. Let’s take a look at  Goal Oriented Action Planning and the game that popularised it: First Encounter Assault Recon.\n    To understand Goal Oriented Action Planning – and in-turn how it is used in F.E.A.R. and many other games – we need to take a look at the theory from which it derives from: an existing AI technology known as automated planning. Automated or AI Planning is a process whereby a system attempts to figure out a sequence of actions that will achieve a distant goal set upon it by a designer: this is called a plan. To do this, we model the problem in some sort of language or encoding that tells us all the information that can be true about the world at that time. These are known as facts or  predicates. Where a simple fact tells us something we might need to know at a later point in time. We store all of the predicates we have about how the world looks like at any point in time within what’s known as a  state.\n For example, consider a closed Door we label as  ‘Door1’. I might want a non-player character to open Door1, so I need to know in a predicate whether it’s open or closed. So the current state of our world is one closed door. Now given I have this information I can build an  action that allows me to open it.\n  Now each action is usually broken into three parts:  the objects that are involved in the action (in this case a door),  the actions preconditions – meaning what facts of the world must be true before I can apply the action – and  the effects – which represent how the world changes as a result of completing the action, adding new information to the world state or deleting existing facts that are no longer true. So say I want my non-player character to open Door1, some valid preconditions for an open-door action would be that the door is closed and that the NPC is standing in the same room as the door. Once the action is completed, the effect would be that the door is now open. Now say we wanted to walk from room A to room B, but the door between them is closed. We’d need to make sure in our planning model that we explain that the door connects room A and B to each other and that you cannot walk between rooms if there is a closed door. At which point the system will create a plan, which is to open the door, and then walk from room A to B. Changing the state of the world to where the NPC is now in Room B.\n In a nutshell this is what planning is all about: figuring out what to do and in what order to do it. This process of encoding problems and allowing for planning systems to solve them is why it has been an active and developing research field for several decades. While F.E.A.R. helped bring planning to games in 2005, planning has previously been used in a variety of real-world logistics problems since as far back as the 1970s. This includes problems such as robotics – ranging from smaller home-based devices to the likes of the Lunar and Mars Rovers, control of largescale mechanical systems such as wind turbines, power stations and manufacturing and in complex spatial problems such as search and rescue operations, military planning and disaster relief.\n But this hides some of the nastier details underneath. These planning encodings rely on us being able to abstract the problem we’re solving into something simple for a planner to solve. Returning to that door opening problem, I said that the NPC needs to be in room A and that Door1 connects the two rooms. This works fine in a planning model, but there’s a bunch of discrepancies between the model and how it works in real life. For example, where in room A is the door to room B? What direction does the NPC need to move towards the door? In fact, in the planning model the NPC can open the door if they’re in a room that the door connects. Meaning this wee fella is now apparently telekinetic and can open doors with their mind from very far away? Rather than the more realistic interpretation which is that not only does the NPC need to be in RoomA, but also needs to be standing right next to Door1 in order to open it. Hence while planning is great for solving the larger problem of what to do in a given situation, executing the plan of action in the world – be it in the real world or in a simulation like a video game – is a lot harder.\n So now that we know what planning is and how it works, let’s take a look at Goal Oriented Action Planning and how it brings AI planning to video games.\n  Goal Oriented Action Planning – or GOAP for short – adapts STRIPS planning – the Stanford Research Institute Problem Solver planning system from 1971 – for use in games. Leading development on this project was Dr Jeff Orkin, the AI lead for Monolith Productions on both 2002’s  No One Lives Forever 2 and  F.E.A.R., where GOAP was first implemented.\n As detailed in Orkin’s 2006 publication at the Game Developers Conference whilst studying his PhD at MIT Media Lab, the GOAP system is driven by a Finite State Machine. A Finite State Machine is a system whereby an AI exists within one state of behaviour and then based on an event occurring will transition into another one. However, the FSMs adopted in Half Life, have over 80 unique states exist in the codebase. Although whether that state was available was determined by the type of character that the state machine was controlling. However here in GOAP, the Finite State Machine has only three states:\n  Interacting with what is known as a smart object: an item in the world that AI characters can interact with.\n Now you might be a little confused how this works, but it’s all based on a really clever observation of how non-player character AI works. If you consider an enemy in a game, all they do is play animations in certain circumstances. It’s when that animation is played in the right place at the right time it appears clever and when several clever animations are played in a sequence, it appears intelligent. Hence each of these three states is ultimately playing an animation.\n GoTo: is playing a movement animation (be it walking, running, jumping, diving or climbing) but it’s also heading to a specific location.\n Animate: is simply playing an animation, this could be acknowledging the players presence, to shooting their weapon or any simple idle animation which this NPC a bit more character.\n And lastly  Use Smart Object: which is a situation such as having a NPC hit a switch, or open a door, or sit in a chair, or knock a table over. In each case, the animation is tied directly to the object and quite often in games – such as that found in my episode on the AI of BioShock Infinite – the object will tell the character’s animation system what it needs to do.\n So, instead of a more grounded state machine where each possible behaviour is enumerated as a separate state, the whole thing is executed in a much smaller and highly data-driven implementation. It will execute specific movement actions and animations that are passed into the system and if several movement, animation and use smart object states are executed in the correct sequence, we’ll get some smart looking behaviour.\n But how does it know what states to be in, in what order and what information to pass into each state? Well, that’s where the planning part of GOAP kicks in. Using a planning encoding like we talked about before, the system creates plans that solves specific problems in the planning encoding and uses A* search to find the best actions to take in solving the problem. The actions within the resulting plan are then translated into specific FSM states, with data being passed of locations to move towards, animations to play and smart objects to ineract with.\n To better understand how this is works in practice, let’s go crack open the hood of FEAR and explore how GOAP is adopted within the game.\n   So let’s take a deeper look at how GOAP is applied in FEAR. Portions of the games C++ codebase have been publically available for some years now. First with the original FEAR SDK being released by Monolith, followed by the FEAR public tools as modders have continued support for it. And with very little effort you can crack it open in Visual Studio and read through the AI source code. So let’s walk through how GOAP is applied within the codebase and for those wanting to try their hand themselves I’ve left links in the description for you to check it out.\n Each AI character in FEAR that has any sort of AI, needs to have goals assigned to it. These goals are ones that the planner will run a search through the action space in order to find a plan of action for that character to execute. This applies to all active non-player characters in the game, from the soldiers and assassins to the nightmare spectres at the end of the games and even the rats that are running around on the ground, which is a super important point I’ll come back to in a minute. This means that the other characters, such as Jin Sun-Kwon and Jankowski, and even Alma herself are all scripted by designers.\n Without a goal, the AI characters will do literally nothing. They need to be given goals to accomplish, which the planning system will then aim to resolve. There are just shy of 70 goals encoded within the game files. In each case, these goals can be initialised, updated and terminated and more critically, have functions that allow for them to calculate their overall priority at that point of time in the game. So for example, if a soldier has been assigned the Patrol and KillEnemy goals, but it has no knowledge of the player being nearby, then KillEnemy will have a priority of 0, while Patrol has a much higher priority given there is a patrol node that’s been assigned to that character. However, in the event that it has knowledge of a player being nearby, the Patrol goal has a much lower priority, given it recognises that the player is now a threat to it.\n Now in order for the planner to solve that goal, the character will have a collection of actions available to it that it can search through. There are 120 actions in the game, ranging from simple animations to different attack variants, moving to locations, using smart object nodes, reloading weapons or just standing idle. All of which have their own corresponding C++ classes. The actions are setup in code, but not all NPCs have access to all actions. Designers use a separate database editor to assign specific actions to each enemy type, allowing them to customise just how versatile each character is when solving their goals.\n With a goal assigned to a given character, it will await a chance to access the planner and find a solution to its current situation. This is where the larger issues I hinted at earlier come to light. The system needs to find actions that this particular character can execute, search through the possible actions within the state space, find a plan that reaches the goal, but all of this needs to be revalidated against the game during execution. This is because something can happen either during planning time or when executing the plan that can break it. Returning to my door example from earlier, if you’re generating a plan to open the door and move between rooms, but during the planning process or as you’re executing it, the door is opened by someone or something else, it invalidates the plan.\n This is an issue that the vast majority of planning systems face, in that they’re rather existential in nature, and assume that only the planner can change the world. So it can’t accomodate for other characters doing stuff in the world as part of the plan. None of the enemy AI in FEAR know that each other exists and co-operative behaviours are simply two AI characters being given goals that line up nicely to create what look like coordinated behaviours when executed. Not only are they unable to walk towards navigation points in the world where other characters are standing, but have zero knowledge of that characters existence. Hence if another character does something that would break the proposed plan, then each character needs to be able to recognise that so it stops what it’s doing and asks for another plan. Or change the goal if necessary.\n This is handled in three different ways: firstly once a plan is devised, the system will then run a quick validation check, that takes a copy of the world state, executes the plan on that copy and ensures it will satisfy the goals as intended, with each actions preconditions and effects working as intended. Secondly, each goal can override the ReplanRequired function, which continually checks whether the current plan should be abandoned and a replacement one be retrieved from the planner. A good example of this is when an enemy character is shot, while executing a plan to satisfy the KillEnemy goal. However, this is only allowed in the event the character is not executing an animation that cannot be interrupted. Lastly, each action in the plan needs to be validated again during execution, with preconditions and effects being checked. In the event they’re not satisfied as intended, the system will bail out of the plan and force a re-plan to occur.\n  However, if that action is going to work as intended, the action is ‘Activated’ in the code base. When that happens, it tells the Finite State Machine which of the three states to transition into. And passes over all of the data it needs to complete the states execution. So say for example a soldier needs to reload, then it transitions into the Animate state and passes in the specific animation parameters that are needed to so that the character will reload their gun.\n Once an AI character completes their devised plan successfully. It will then be assigned a new one and can plan again. By managing both when plans succeed as well as when they fail, this helps maintain the pace of the game, ensures the AI always knows what to do and don’t stand around idle waiting to be slow-mo shot in the face. In truth the length of plans in FEAR are often rather short, typically 1-2 actions long, with only a handful ever reaching 3 or 4 actions in length. This largely makes sense given the overall pacing of the game.\n That said, this goal management and planning process does create a problem, one that even the developers at Monolith didn’t know about for many years. As detailed in a 2014 research paper by Professor Eric [Jacopin, 2014] in which he analyses the performance of the GOAP planner in FEAR, it’s discovered that this process of continually replanning creates a small performance overhead in some levels of the game, thanks to the rats. The rats in FEAR are – as I mentioned – using the same system as the soldiers and other combat AI. Typically their plans are pretty simple, move to another location in the world and preferably away from the player if they’re nearby. The need for the rats to replan doesn’t take into consideration whether the player is nearby. Hence you can meet a couple rats in the opening seconds of the level and they’ll still be running around planing for new actions 20 minutes later while you’re on the other side of the map.\n This far from an exhaustive overview of the codebase and I do encourage anyone who can work their way around C++ to have a read through the code, it’s really insightful and rewarding for game developers to read through.\n  FEAR’s use of Goal Oriented Action Planning is still held to this day as some of the most exciting and fun enemy opponents to come across in modern video games. And while it’s now been almost 15 years since the games release, GOAP has continued to have a lasting impact within the video games industry. While far from an exhaustive list, there are many highly popular or cult classics that have adopted the methodology or something similar to it.\n This includes the likes of  Condemned Criminal Origins,  S.T.A.L.K.E.R.: Shadow of Chernobyl,  Just Cause 2,  Deus Ex Human Revolution, the 2013 reboot of  Tomb Raider and more recent titles by Monolith such as  Middle-Earth: Shadow of Mordor and  Shadow of War. There are other episodes of AI and Games that explore its applications, such as  Transformer: War for Cybertron in episode 14 as well as a heavily modified hybrid approach in  Empire and  Napoleon: Total War back in episode 22. Planning is still a popular technique in video games – though arguably not as common as say behaviour trees. But over time GOAP and its STRIPs-style approach is now being adopted less frequently, with more contemporary titles adopting another planning technology known as Hierarchical Task Network or HTN planning, which has been used in titles such as  Killzone 2,  Max Payne 3 and  Dying Light. I’ll be dedicating a future segment of to HTN planning, but I’ve already covered the implementation of this planning method in videos for  Transformers: Fall of Cybetron in episode 14 and  Horizon Zero Dawn in episode 37.\n But for now I hope this help everyone better understand not only why people continue to laud the AI of FEAR, but also the underlying technology being adopted. I’ve listed some other useful resources on GOAP in the below for you to check out.", "posttime": "2020-05-07 22:48:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,导向,oriented,计划", "title": "以目标为导向的行动计划构建F.E.A.R.的人工智能", "title_en": "Building the AI of F.E.A.R. With Goal Oriented Action Planning", "transed": 1, "url": "https://www.aiandgames.com/2020/05/06/ai-101-goap-fear/", "via": "", "real_tags": ["人工智能", "导向", "oriented", "计划"]}, {"category": "", "categoryclass": "", "imagename": "657eb2ed72ceb99edb70e8cee131343e.jpg", "infoid": 1001095, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在2020年3月至4月期间，Windows7的用户市场份额从26.23%下降到25.59%。当人们最终升级到Windows10时，对于一个有10年历史、不受支持的操作系统来说，这并不令人惊讶。对吗？尽管有这种传统的想法，微软的Windows10实际上经历了罕见的市场份额下降(从2020年3月的57.34%下降到4月份的56.08%)。与此同时，流行的Linux发行版Ubuntu享受着爆炸性的增长。\n有多爆炸性？Ubuntu在操作系统使用中的总份额从3月份的0.27%激增到4月份的1.89%。客观地说，这是599%的增长。\nCanonical的Ubuntu的提升导致Linux使用率从1.36%攀升至2.87%。为了对抗苹果一个有趣的数据点，NetMarketShare衡量MacOS Catalina-它在4月份也获得了4.15%的用户份额。\n需要注意的一点是：Ubuntu的新增用户并没有增加599%。这一跃升表明其操作系统的整体市场份额逐月增加。但这仍然是一个惊人的数字。\nNetMarketShare只衡量其受监控网站网络中的活跃用户会话，但这些网站的数量在上千个，因此这是一个相当可观的样本规模。你可以在这里阅读更多关于它的数据收集方法的信息。\n那么，为什么在Ubuntu快速增长的同时，微软的整体市场份额却在流失呢？正如WindowsLatest指出的那样，其中一个原因可能是冠状病毒的流行和公司拥有的个人电脑在办公室使用的显著减少。\n我更愿意相信另一个因素是Ubuntu--进而是Linux--正稳步获得主流和专业技术媒体的更多报道。在过去的两年里，桌面Linux在游戏、易用性以及无缝系统更新和尊重隐私功能的结合方面得到了复兴。", "note_en": "Between the months of March and April 2020, Windows 7 saw a drop in user market share from 26.23 percent to 25.59 percent. That’s hardly surprising for a 10-year-old, unsupported OS as people finally upgrade to Windows 10. Right? Despite that conventional thinking, Microsoft’s Windows 10 actually experienced a rare  drop in market share (down to 56.08 percent in April from its March 2020 share of 57.34 percent). Meanwhile, popular  Linux distribution Ubuntu enjoyed an explosive  increase.\n    How explosive? Ubuntu’s overall share of operating system usage ballooned from 0.27% in March to 1.89% in April. To put that in perspective, that’s an increase of  599 percent.\n  The lift for Canonical’s Ubuntu resulted in Linux usage climbing from 1.36 percent to 2.87 percent. And to frame that up against an interesting Apple data point,  NetMarketShare measures macOS Catalina — which also gained user share in April — at 4.15 percent.\n  One key thing to note: Ubuntu isn’t seeing a 599 percent increase in  additional users. That jump represents its increase in overall operating system market share from month to month. But it’s still an astonishing number.\n       NetMarketShare only measures active user sessions within its network of monitored websites, but those websites number in the 1000s so it’s a respectable sample size. You can read more about its data collection methodology  here.\n    So why is Microsoft bleeding overall market share while Ubuntu is gaining so rapidly? One reason, as  WindowsLatest points out, could be the COVID-19 pandemic and a significant decrease in company-owned PCs being used at the office.\n    I like to believe another contributing factor is that Ubuntu — and by extension Linux — is steadily gaining more coverage from mainstream and specialty tech press. Over the past two years desktop Linux has enjoyed a renaissance when it comes to gaming, ease-of-use and its combination of seamless system updates and privacy-respecting features.", "posttime": "2020-05-07 22:48:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows-10,linux,ubuntu,windows,windows10", "title": "Windows10用户流失，而Ubuntu Linux用户增长惊人", "title_en": "Windows 10 Bleeds Users While Ubuntu Linux Enjoys an Astonishing Increase", "transed": 1, "url": "https://www.forbes.com/sites/jasonevangelho/2020/05/06/windows-10-is-bleeding-users-while-ubuntu-linux-enjoys-an-astonishing-increase/", "via": "", "real_tags": ["linux", "ubuntu", "windows", "windows10"]}, {"category": "", "categoryclass": "", "imagename": "1e51293629dee9850a5d6d5358aed98f.jpg", "infoid": 1001092, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几年来，Keybase一直在开发加密产品，包括安全的文件共享和协作工具，在经历大流行需求增长的痛苦时，Keybase应该会给Zoom带来一些安全可信度。\n在过去的几个月里，随着需求的飙升，该公司面临着一系列安全问题，并暴露了该平台的一些安全漏洞。随着公司采取行动解决这些问题，拥有一支加密专家团队应该会帮助公司打造更安全的产品。\n在宣布这笔交易的一篇博客文章中，首席执行官埃里克·袁表示，他们收购KeyBase是为了给客户提供更高级别的安全，这对企业客户来说越来越重要，因为越来越多的业务依赖于该平台，在疫情爆发期间在家工作。\n袁写道：“这次收购标志着Zoom迈出了关键的一步，因为我们试图完成一个真正私人的视频通信平台的创建，这个平台可以扩展到数亿参与者，同时也可以灵活地支持Zoom的各种用途。”\n他补充说，一旦将这些工具整合到产品中，所有付费客户都可以使用这些工具。“Zoom将为所有付费账户提供端到端加密会议模式。登录的用户将生成公共加密身份，这些身份存储在Zoom网络的存储库中，可用于在与会者之间建立信任关系，“他写道。\n根据交易条款，密钥库将成为Zoom的子公司，联合创始人兼Max Krohn将领导Zoom安全工程团队，直接向袁汇报，帮助构建安全产品。其他近24名员工将成为Zoom的员工。绝大多数是安全工程师。\n目前还不清楚Keybase的产品会发生什么，但该公司确实表示，Zoom正在与Keybase合作解决这一问题。\n根据Crunchbase的数据，Keybase成立于2014年，已经筹集了近1100万美元。", "note_en": "Keybase, which has been  building encryption products for several years including secure file sharing and collaboration tools, should give Zoom some security credibility as it goes through pandemic  demand growing pains.\n The company has faced a number of security issues in the last couple of months as demand as soared and exposed some security weaknesses in the platform. As the company has moved to address these issues, having a team of encryption experts on staff should help the company build a more secure product.\n  In a blog post announcing the deal, CEO  Eric Yuan   said they acquired Keybase to give customers a higher level of security, something that’s increasingly important to enterprise customers as more operations are relying on the platform, working from home during the pandemic.\n “This acquisition marks a key step for  Zoom   as we attempt to accomplish the creation of a truly private video communications platform that can scale to hundreds of millions of participants, while also having the flexibility to support Zoom’s wide variety of uses,” Yuan wrote.\n He added that that tools will be available for all paying customers as soon as it is incorporated into the product. “Zoom will offer an end-to-end encrypted meeting mode to all paid accounts. Logged-in users will generate public cryptographic identities that are stored in a repository on Zoom’s network and can be used to establish trust relationships between meeting attendees,” he wrote.\n Under the terms of the deal, the  Keybase   will become a subsidiary of Zoom and co-founder and Max Krohn will lead the Zoom security engineering team, reporting directly to Yuan to help build the security product. The other almost two dozen employees will become Zoom employees. The vast majority are security engineers.\n It’s not clear what will happen to Keybase’s products, but the company did say Zoom is working with Keybase to figure that out.\n Keybase was founded in 2014 and has raised almost $11 million according to Crunchbase data.", "posttime": "2020-05-07 22:19:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "收购,acquires,zoom", "title": "ZOOM收购密钥库以获得端到端加密专业知识", "title_en": "Zoom Acquires Keybase To Get End-to-End Encryption Expertise", "transed": 1, "url": "https://techcrunch.com/2020/05/07/zoom-acquires-keybase-to-get-end-to-end-encryption-expertise/", "via": "", "real_tags": ["收购", "acquires", "zoom"]}]