[{"category": "", "categoryclass": "", "imagename": "c7962bbdb431504ad9abda1a61eba411.jpg", "infoid": 1067668, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与网络安全空间的其他公司不同，MITIGA并不希望防止网络图案，无论在哪个保护程度上都是不可避免的。相反，它希望帮助组织管理他们的事件响应，特别是在他们到混合动力和多云环境中的转换。\n 早期启动，该启动，去年7月筹集了700万美元的种子资金，称其事件准备和响应技术堆栈加速了事件后的反弹从下半年到几小时。其基于订阅的产品会自动检测网络违反并快速调查，收集案例数据，并将其转化为组织内所有相关分区的修复步骤，以便它们可以快速和有效地响应。 MITIGA还记录了每个活动，允许组织解决原因，以防止未来的攻击。\n  Mitiga的系列A由Clearsky Security，Atlantic Bridge和DNX领导，并且启动告诉TechCrunch，它将使用资金“继续破坏事件准备和响应，”以及“显着”增加其网络安全，工程，销售和营销人员。\n 该公司补充说，在事件准备和回应方面，在企业组织的“变化的心态”中，资金来了。大流行已经加速了云采用，预测，今年云服务的支出将超越3320亿美元。根据McAfee的说法，这种加速度为黑客为黑客提供了利润丰厚的黑客目标，在云服务中增加了630％的云服务。\n “云代表了对事件准备和反应的新挑战，我们将行业的第一个事件响应解决方案带到云中，为云层，”梅吉纳的联合创始人和首席执行官Tal Mozes说。\n “这种资金将使我们进一步与正在实时事件中恢复的企业安全部门的参与，吸引了该行业中最具创新性的网络安全的思想，并扩大了我们的合作伙伴网络。对于理解网络安全准备和反应重要性的云第一组织，我无法对MITIGA为重要组织做些什么来说。“\n Mitiga于2019年由Mozes，Ariel Parnes和Maor成立，18队目前在特拉维夫的工作与伦敦和纽约的办事处。它拥有多个部门的客户，包括金融服务机构，银行，电子商务，执法和政府机构，MITIGA还向非订阅客户的赎金软件和数据泄露等主动网络安全事件提供应急响应。 ", "note_en": "Mitiga, unlike other companies in the  cybersecurity space, isn’t looking to prevent cyberattacks, which the startup claims are inevitable no matter how much protection is in place. Rather, it’s looking to help organizations manage their  incident response, particularly as they transition to hybrid and multi-cloud environments.\n The early-stage startup, which raised $7 million in seed funding in July last year, says its incident readiness and response tech stack accelerates post-incident bounce back from days down to hours.  Its subscription-based offering automatically detects when a network is breached and quickly investigates, collects case data, and translates it into remediation steps for all relevant divisions within an organization so they can quickly and efficiently respond. Mitiga also documents each event, allowing organizations to fix the cause in order to prevent future attacks.\n  Mitiga’s Series A was led by ClearSky Security, Atlantic Bridge, and DNX, and the startup tells TechCrunch  that it will use the funds to “continue to disrupt how incident readiness and response is delivered,” as well as “significantly” increasing its cybersecurity, engineering, sales, and marketing staff.\n The company added that the funding comes amid a “changing mindset” for enterprise organizations when it comes to incident readiness and response. The pandemic has accelerated cloud adoption, and it’s predicted that spending on cloud services will surpass $332 billion this year alone.  This acceleration, naturally, has provided a lucrative target for hackers, with cyberattacks on cloud services increasing 630% in the first four months of 2020, according to McAfee.\n “The cloud represents new challenges for incident readiness and response and we’re bringing the industry’s first incident response solution in the cloud, for the cloud,” said Tal Mozes, co-founder and CEO of Mitiga.\n “This funding will allow us to further our engagements with heads of enterprise security who are looking to recover from an incident in real-time, attract even more of the most innovative cybersecurity minds in the industry, and expand our partner network. I couldn’t be more excited about what Mitiga is going to do for cloud-first organizations who understand the importance of cybersecurity readiness and response.”\n Mitiga was founded in 2019 by Mozes, Ariel Parnes and Ofer Maor, and the team of 18 currently works in Tel Aviv with offices in London and New York. It has customers in multiple sectors, including financial service institutions, banks,  e-commerce, law enforcement and government agencies, and Mitiga also provides emergency response to active network security incidents such as ransomware and data breaches for non-subscription customers.", "posttime": "2021-06-23 19:03:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "组织,organizations", "title": "MITIGA提高了2500万美元的A级A帮助组织回应网络攻击 ", "title_en": "\n\t\t\t\tMitiga raises $25M Series A to help organizations respond to cyberattacks\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/23/mitiga-raises-25m-series-a-to-help-organizations-respond-to-cyberattacks/", "via": "", "real_tags": ["组织"]}, {"category": "", "categoryclass": "", "imagename": "d9840231246f4a404c7a717076962b19.jpg", "infoid": 1067666, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去，当霍华德法利的SR.会去螃蟹钓鱼时，他将船的弓指向诺顿声音的粗糙和冰冷的水域。国家任务要求他和其他NOME，阿拉斯加，爪子距离他们镇上的岸边至少15英里，以抛弃他们的锅，但随着近年来的成功甲壳类动物捕获的数量，他们经常走得更远，远处走得更远。\n 法利可以从GPS追踪他的距离，但在海上漫长的一天，他不觉得他真的很回来，直到他可以看到坦沃山的四个幽灵结构。 “在一个晴朗的一天，你可以看到至少五到六英里外，”Farley说。 “他们总是在那里，部分诺姆。”\n 俗气，他们被称为“nomehenge”或简单地“广告牌”，但是，鉴于他们的凹形形状，可以轻松误认为是未完成的滑冰坡道。坐在镇后面的底座底座的山顶上，它们是飞机飞行员，船船长，徒步旅行者和雪地摩托车的有用的Wearfinding艾滋病 - 特别是在冬天，当它在一天中的暗淡时雪是足够深的，无法掩盖大多数其他地标。\n 然而，在冷战期间，结构是天线，构思为苏联袭击的重要预警系统。然后，阵列及其现在灭绝的同行称为白色Alice通信系统。\n  在冷战开始时，北极的发展是美国空军的主要目标之一。当时，阿拉斯加的基础设施不充分，以支持这些任务，道路，港口和铁路不足，位于地区的大部分军事基地，意味着达到南方竞争对手，而不是一个北极。尽管如此，最大的挑战是沟通。如果居民希望进行长途电话，他们需要预订镇上唯一的电路。在阿拉斯加或外部的新闻不是一个简单的过程，并且天文学上昂贵。白色的Alice通信系统改变了这一点。它使当地人更容易保持联系，并允许空军警告任何传入俄罗斯轰炸机的内地。\n 当NORE中的四座塔接受了1958年1月的第一次传输时，对流层天线（通过在大气中击落它们在大气中的层次上击打它们的一种技术而发送和接收信号）。 NOME网站是一个更大系统的71个站点的一部分，通过从200英里远离200英里远的无线电波和将消息沿着该线路播放到下一个站点来操作。单个网站需要几十个或数百人的工作，并要求近持续修补。大多数网站都补充了宿舍，自助餐厅，卫兵岗位和其他设施。许多人坐在海岸上，尽可能接近国家试图观看的对手。他们的球队的战略价值有助于1959年的Bolster Alaska的出价。\n 但在20世纪70年代卫星通信的进步之后，白人爱丽丝很快就会变得过时。在遵循的几年里，所有但诺姆天线都被撕毁了。许多网站已成为故意破坏的目标，并被石油，铅和石棉污染（所有这些都用于建造和维护地点）。单独的诺姆网站看到了超过800万磅的污染土壤，从山顶到俄勒冈州阿灵顿，俄勒冈州阿灵顿，以进行治疗。 “一般来说，如果有潜在责任，无论是拥有它的潜在责任，都会想要限制，”Bill O'Connell说，他们作为一个环境顾问，他们在2000年代初的白色Alice遗址进行了清理。 “诺姆不得不大厅很难得到保留的结构。” \n虽然塔楼，白色爱丽丝系统的最识别元素，但在阿拉斯加的其他地方消失了，有一些支持设施 - 主要是原来的控制室 - 静静地站在广阔的景观中。虽然这些不再使用无线电波，但它们仍然是保持阿拉斯加连接的目的。现在，他们持有构成互联网，电话系统，蜂窝和更多的网络，允许无需村庄（至少）到世界其他地区连接。现场的大部分网站现在由＆amp; t的电信公司拥有，该公司是运行下一代系统的任务。\n 虽然白色爱丽斯系统需要工人的团队，但今天一个人可以独自完成这项工作。 “我们的遥控器[前白色Alice]网站可以在一整年内营运，未经考察，”核心网络运营核心网络运营的外围领域技术人员说，凯西安德森说。 “多次我所做的一切：年度检查。检查一切都很好，关灯，锁门，飞到下一个。“\n 在白艾丽斯后几年中，支持建筑物中的大部分原始设备被其现代等效物所取代，其中一些建筑物被掩盖，但仍然是“有点幽灵”，而且是有点幽灵般的，“安德森说。 “因为它们是为了承受核爆炸，建筑物的美学并不是特别重要的，”安德森补充道。 “他们在很大程度上是不道德的建筑，在不知名的地方，没有窗户。”\n  因为白色的爱丽丝网站是祖先的现代通信，弥补了他的工作大部分的祖先，安德森期待着访问他们 - 他甚至在他家中有一张阿拉斯加地图，他在他去过他去过的网站。 2016年，NORE认识到其他人可能对通信天线同样感兴趣，而且不仅拯救他们而且也使他们成为旅游景点。\n 2012年，Anvil山白Alice网站的土地应该符合SitNasuak本机构，这是一个投票的利润公司，该公司被删除，以便拆除这些结构，所以他们不会担任任何责任的钩子。为了保持天线，NOME市议会提供了在镇上提供了更有价值的土地的贸易SINTNASUAK。 Sitnasuak接受并留下了天线。\n “我认为人们喜欢它背后的历史 - 它让他们感到像诺姆对外界的事情一样，”长期诺姆居民罗素·罗德说，并在当地T恤上添加了诺梅恩，就像一个非官方的吉祥物一样。 “当它被带走时，它可能会消失，有很多人反对它。”\n 目前，该市似乎满足于离开该网站，允许当地人使用周边地区进行娱乐。 Rowe将他的年轻儿子带到了十几个左右的峰会，每年往一年到Geocache，坐蓝莓，沿着120英尺天线的阴影的小径划船。在那里有其他当地人，徒步旅行，他们的狗，野餐，或收集由麝香牛的超柔软，令人难以置信的温暖纤维，这使得很棒的纱线。偶尔，游客的友册将尝试遍历颠簸的道路越来越靠近该网站。 \n“从白人Alice网站上有360度的景观 - 所有滚动的苔原山，北方的巨大峰，然后到海洋，”罗德说。 “它可能听起来很奇怪，但这是一个很好的地方。” ", "note_en": "In the past, when Howard Farley Sr. would go fishing for king crab, he’d point the bow of his vessel towards the rough and icy waters of the Norton Sound. State mandates require that he and other Nome,  Alaska, crabbers travel at least 15 miles from their town’s shore to drop their pots, but as the number of successful crustacean catches dwindled in recent years, they’d often go farther and farther afield.\n Farley could track his distance from home from GPS, but after a long day at sea, it didn’t feel like he was really back until he could see the four ghostly structures atop Anvil Mountain. “On a clear day you can see them at least five or six miles out,” Farley says. “They were always there, part of Nome.”\n Colloquially, they’re known as “Nomehenge” or simply “the billboards,” though, given their concave shape, one could easily mistake them for unfinished skate ramps. Sitting on the summit of the otherwise-bald 1,200-foot mountain that looms behind the town, they’re useful wayfinding aids for aircraft pilots, boat captains, hikers, and snowmobilers—particularly in the winter, when it’s dark much of the day and the snow is deep enough to obscure most other landmarks.\n However, during the Cold War, the structures were antennas, conceived to serve as an important early warning system for Soviet attack. Then, the array and its now-extinct peers were known as the White Alice Communications System.\n  At the beginning of the Cold War, development of the Arctic was one of the primary objectives of the U.S. Air Force. At the time, Alaska had inadequate infrastructure to support those missions, with insufficient roads, ports, and railroads and the bulk of military bases located in areas meant to meet a southern rival, not one coming over the  North Pole. Still, the biggest challenge was communication. If residents wanted to make a long-distance call, they needed to make a reservation to use the only circuit in town. Getting news across or outside of Alaska wasn’t an easy process, and was astronomically expensive. The White Alice Communications System changed that. It made it easier for locals to stay connected, and allowed the Air Force to warn the mainland of any incoming Russian bombers.\n When the four towers in Nome accepted their first transmission in January 1958, the tropospheric antennas (a type of technology that sends and receives signals by bouncing them off layers in the atmosphere) were ahead of their time. The Nome site was a part of a larger system of 71 sites that operated by receiving radio waves from 200 miles away and hot-potatoing the message down the line to the next site. A single site required the work of dozens or hundreds of people, and called for near-constant tinkering. Most sites were supplemented with dorms, cafeterias, guard posts, and other amenities. Many sit on the coast, as close as possible to the adversary that the country was trying to watch. The strategic value of their presence  helped bolster Alaska’s bid for statehood in 1959.\n But following the advancements made in satellite communications in the 1970s, White Alice quickly became obsolete. In the years that have followed, all but the Nome antennas were torn down. Many of the sites had become targets for vandalism and were contaminated with petroleum, lead, and asbestos (all of which were used in the construction and maintenance of the sites). The Nome site alone saw more than 8 million pounds of contaminated soil shipped from the mountaintop to Arlington,  Oregon, for treatment. “Generally if there’s a potential liability, whoever owns it is going to want to limit that,” says Bill O’Connell, who worked as an environmental consultant doing clean-up for the White Alice sites in the early 2000s. “Nome had to lobby pretty hard to get the structures retained.”\n  While the towers, the most recognizable element of the White Alice system, have vanished elsewhere in Alaska, there are some support facilities—largely the original control rooms—quietly standing in the vast landscape. Though these no longer use radio waves, they still serve the purpose of keeping Alaska connected. Now, they hold the networks that make up the internet, phone systems, cellular, and more, allowing roadless villages to connect (digitally, at least) to the rest of the world. The bulk of the sites are now owned by the telecommunications company AT&amp;T, which is tasked with running the next-generation systems.\n While the White Alice system needed teams of workers monitoring it around the clock, today one person can do the job alone. “Our remote [former White Alice] sites can run for an entire year without a visit,” says Casey Anderson, an Outlying Area Technician for Core Network Operations with the telecommunications company. “Many times that’s all I do: an annual check-up. Check that everything is fine, turn off the lights, lock the door, fly to the next one.”\n In the years post-White Alice, much of the original equipment in the support buildings was replaced by its modern equivalent and some of the buildings have been spruced up, but still, they’re “a little spooky,” Anderson says. “Because they were built to withstand a nuclear blast, the aesthetics of the buildings weren’t particularly important,” Anderson adds. “They’re largely nondescript buildings, in the middle of nowhere, with no windows.”\n  Because the White Alice sites are the ancestors to the modern communications that make up the bulk of his job, Anderson looks forward to visiting them—he even has a map of Alaska in his home where he’s circled the sites he’s been to. In 2016, Nome recognized that others might be similarly interested in the communications antennae and fought to not only save them but also make them  a tourism spot.\n In 2012, the land the Anvil Mountain White Alice site sits on was supposed to be given to the Sitnasuak Native Corp, a for-profit company that voted to have the structure dismantled so they  wouldn’t be on the hook for any liability. To keep the antennas, the Nome City Council offered to trade Sitnasuak for a significantly more valuable plot of land in town. Sitnasuak accepted and the antennas stayed.\n “I think people like the history behind it—it makes them feel like Nome matters to the outside world,” says longtime Nome resident Russell Rowe, adding that often Nomehenge appears on local T-shirts, like an unofficial mascot. “When it was brought up that it might go away, there were a lot of people that were opposed to it.”\n For now, the city seems content to leave the site as is, allowing locals to use the surrounding area for recreation. Rowe brings his young sons up to the summit a dozen or so times a year to geocache, pick blueberries, and bike along the trails in the shadow of the 120-foot antennas. There are often other locals up there, hiking with their dogs, picnicking, or gathering the ultra-soft, incredibly warm fibers shed by musk oxen, which make great yarn. Occasionally, busloads of tourists will attempt to traverse the bumpy road to get closer to the site.\n “There are 360-degree views of the landscape around Nome from the White Alice site—all the rolling tundra hills, the bigger peaks to the north, and then out to the ocean,” Rowe says. “It might sound strange, but it’s a nice place to be.”", "posttime": "2021-06-23 18:55:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苏联,来到,home,网站", "title": "欢迎来到Alaska的苏联时代天线的家园 ", "title_en": "Welcome to Nomehenge, Home to Alaska’s Soviet-Era Antennas", "transed": 1, "url": "https://www.atlasobscura.com/articles/alaska-soviet-history-nomehenge", "via": "", "real_tags": ["苏联", "来到", "home", "网站"]}, {"category": "", "categoryclass": "", "imagename": "570e8a4bae70206c5b20fff9a1633b5a.jpg", "infoid": 1067665, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我与Golden Ventures创始人和管理合作伙伴Matt Golden，兼普莱德·帕金····阿拉··阿拉··苏拉有关这一基金的计划，以及加拿大启动和投资景观一般。\n “随着时间的推移，我们肯定看到越来越多地对机构LPS的兴趣，越来越多地对加拿大生态系统的兴趣，我认为是一个净积极的，”Golden表示。 “在此之前，加拿大生态系统主要由加拿大机构资助，所以我认为这真的是积极的，因为你必须在世界舞台上判断。我们开始将该栏与生态系统和基金相结合。“\n  Golden表示，与此基金的游戏计划IV没有真正改变他们的投资目标;虽然金色最初列出了主要投资，主要用于了解移动设备的软件产品的公司，但它最终转移到支持北美种子阶段的策略，使命驱动的创始人在一系列垂直和类别中致力于风险规模的机会。\n “我会说随着时间的推移，我们的交易比例，加拿大向我们增加了比率的交易数量，我们在加拿大与美国的比例，只是因为加拿大生态系统正在进行中一个完美的高速轨迹。“金说。 “你已经看到了这一点，但我认为它现在真的开始袭击它的步幅，有很多创始人，具有”大摇摆“的愿景，以及在生态系统中的资本竞争日益增长的兴趣。”\n Shah补充说，他也认为我们正在培训更多的初创公司，这些初创公司起源于加拿大在不同地区中的节点中的方式，这是对他们的人才需求的最有意义，反之亦然。\n “后科迪德，很多公司可能会在这里开始，但随着地理界限只是模糊，真的没有理由在不同的重力中建立位置，利用其他生态系统的竞争优势，”他说。 “我们有一个最近在洛杉矶和多伦多设立了一个地点，捕捉了La的一些价值，也可以利用多伦多的所有人才。我想你会开始看到越来越多的事情，事情就会向网络移动，而不仅仅是城市。“\n 至于这一基金筹集，它是最近三个加拿大早期风险投资池之一，也包括“机会基金”，其中在每种情况下都被描述为公司参加其明星投资组合的后期交易的方式他们不会被设置为投资于早期投资组织的公司。然而，Golden Ventures还向其名单与基金IV的名册引入了另一种新的投资。 \n“有这个概念，我们称之为'天使分配，'[...]我们可以投资更小的支票，排名为400到500万人，进入可能的机会结构或交易的结构可能不是符合我们的核心检查是什么，“Golden解释道。 “这可能是，例如，在圆形中没有足够的房间，或者估值在我们的核心范围之外，或者我们可以学习一个高度实验的全新空间 - 但我们仍然有一个在这个机会背后的人们的机会中有高度的定罪，并将其产生的回报。“\n 这些投资的资金将来自主基金IV池，但大多数人仍将针对那些20-25核心的核心。然而，整体而言，金色和沙拉都强调，在这个阶段的基金的主要目标是利用他们在加拿大生态系统中出现更多机会的日益增长的趋势，以及在北美初创公司方面的影响。\n “当你谈到加拿大前五到十家公司的谁是谁，很长一段时间，它真的是同一个团体，”莎娜说。 “现在，你已经有了这一新的人，这已经进来了，觉得他们仍然在向上的轨迹上，我认为这也非常令人兴奋。” ", "note_en": "I spoke to Golden Ventures Founder and Managing Partner Matt Golden, and General Partner Ameet Shah about its plans for this fund, and about the Canadian startup and investment landscape in general.\n “Over time, we’re certainly seeing more and more interest in institutional LPs, more and more interest in the Canadian ecosystem, which I think is a net positive,” Golden said. “Whereas before, the Canadian ecosystem was largely funded by Canadian institutions, so I think that’s really positive, because you have to sort of be judged on the on the world stage. And we’re starting to meet that bar as both an ecosystem and as a fund.”\n  Golden said that the game plan with this Fund IV doesn’t really change in terms of their investment targets; while Golden initially set out to invest primarily in companies working on software products for mobile devices, it eventually shifted to a strategy of backing North American seed stage, mission-driven founders working on venture-scale opportunities across a range of verticals and categories.\n “I would say that over time, our ratio of deals, Canada to U.S., we’ve increased the number of deals on a ratio basis that we do in Canada versus the U.S., just by virtue of the fact that the Canadian ecosystem is on a terrific, high-velocity trajectory.” Golden said. “You’ve seen it coming, but I think it’s really starting to hit its stride now, with lots of founders with ‘big swing’ vision, and an increasing interest in capital playing in the ecosystem.”\n Shah added that he also thinks we’re trending towards more startups that originate in Canada setting up nodes in different geographies in ways that make most sense for their talent needs, and vice versa.\n “Post-COVID, a lot of companies may start here, but with the geographical boundaries just blurring, there’s really no reason they can’t set up locations in different centers of gravity and take advantage of other ecosystems’ competitive advantages,” he said. “We had one that recently set up a location in LA, as well as Toronto, capturing some the value of LA but also leveraging all the talent in Toronto as well. I think you’re gonna start seeing more and more of that, where things are moving more towards networks, and not just cities in general.”\n As for this fund raise, it’s one of three recent Canadian early stage pools of venture capital to also include an ‘Opportunities Fund,’ which in each case has been described as a way for the firms to participate in later stage deals in their star portfolio companies that they wouldn’t otherwise be set up to invest in as an early stage investment organization. Golden Ventures is also introducing another new type of investment to its roster with Fund IV, however.\n “There’s this concept, we call it ‘Angel allocation,’ […] it’s the idea that we can invest smaller checks, sort of 400-to-500 thousand, into companies where maybe the structure of the opportunity or of the deal may not fit what our core checks would be,” Golden explains. “That could be, for example, a case where there’s not enough room left in the round, or the valuation is outside of our core range, or maybe we’re learning about a completely new space that’s highly experimental — but we still have a high degree of conviction in the opportunity, in the people behind that opportunity, and the returns that it could generate.”\n Funds for those investments will come out of the main Fund IV pool, but the majority will still be targeting those core 20-25 larger checks. Overall, though, both Golden and Shah emphasize that the primary goal of the fund at this stage is capitalizing on the growing trend they see of more opportunity emerging in the Canadian ecosystem, and the impact that’s having in terms of startups across North America.\n “When you talk about who are the the top five to ten companies in Canada, for a long time, it was really the same group,” Shah said. “Now, you’ve got this new crop of people that have come in and feel like they’re still on an upward trajectory, and I think that’s just really exciting as well.”", "posttime": "2021-06-23 18:18:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ventures,加拿大", "title": "Golden Ventures提高了1000万美元的第四基金和20米机会基金 ", "title_en": "\n\t\t\t\tGolden Ventures raises $100M fourth fund and $20M opportunities fund\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/23/golden-ventures-raises-100m-fourth-fund-and-20m-opportunities-fund/", "via": "", "real_tags": ["ventures", "加拿大"]}, {"category": "", "categoryclass": "", "imagename": "f5504d773d0ef473842f30e094550684.jpg", "infoid": 1067664, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "反对意见是一种数字广告形式，依赖于大量的背景数据处理，它在浏览和使用服务时擅长有关个人的信息，以创建用于确定要服务的广告的配置文件（通过多参与者像高速拍卖一样的过程称为实时竞标）。\n 欧盟的铅数据保护监督员以前呼吁禁止有针对性的广告，依赖于普遍的追踪 - 在众多相关权利风险上警告。\n   3月份，美国隐私，消费者，竞争和民权团体的联盟也在Microtargeting中占据了集体目标。因此，在大西洋两侧的立法者上，将剥削剥削的透析者越来越大，因为共识构建了与基于大规模监视的操纵相关的损害。\n 与此同时，势头明确建立了亲密的消费技术和服务 - 展示了用户和创新者对尊重人们数据的商业模式的上升商店。\n 越来越多的这种服务的摄取强调了如何替代，尊重的数字商业模式不仅可能（并且可以访问许多百分之一的产品），而且越来越受欢迎。\n  在一个公开的函件中，解决欧盟和美国政策制定者，国际联盟 - 由55个组织组成，包括20多个专家，包括隐私国际，公开权利集团，数字民主的开放权利集团，新的经济学基础，埃格里和Fairplay  - 敦促立法行动，呼吁禁止依赖互联网用户的“系统商业监测”的广告，以便为Facebook创始人Mark Zuckerberg喜欢，委婉地，称为“相关广告”。\n Zuckerberg（自助）框架的问题是，随着联盟所指出的，绝大多数消费者实际上并不希望被这些令人毛骨悚然的广告服务。 \n任何声称保护的“相关性”与经历令人毛骨悚然和令人不快的人的消费者无关。 （并想象一下，如果他们可以在亚特克窗帘后面偷看普通的互联网用户会如何觉得 - 看到人们在规模上划分的庞大数据库，因此他们的注意力可以为商业兴趣和销售给最高的投标人）。\n 该联盟指出，一份报告将消费者对监督的广告态度审议，由一封信的签字人（挪威消费者委员会; NCC）编写，发现十分之一的人在线收集有关他们的商业行为者是积极的 - 并且只有一个基于个人信息的广告中的一个是可以的。\n 1/4🙅🏾♀️80-90％的人在线Don＆＃39; t想要被击败＆＃39;更相关的广告，＆＃39;查找@ forbrukerradet＆＃39; s的报告。\n 我们都不在@edri，这就是为什么我们加入超过50个Orgs＆amp; 20学者＆amp;跨大西洋调用的专家#bansurveillanceaddistisient。 https://t.co/btcdzissup pic.twitter.com/3rtdjamixa.\n 对调查的一大三分之一的受访者对Micrargeted广告的“非常消极” - 虽然几乎一半的想法广告商不应该基于任何形式的个人信息来定位广告。\n 该报告还突出了在网上上网时突出了消费者的阳痿感，其中六个受访者中的六个感觉他们别无选择，只能放弃有关自己的信息。\n 该发现应特别关注欧盟政策制定者，因为Bloc的数据保护框架应该提供公民，其中包含与他们的个人数据有关的权利，这些资权应该保护他们免受强大的武装交给信息 - 包括规定如果数据规定控制人打算依靠用户同意处理数据，然后必须了解，具体和自由地通知;通过使用黑色图案，它无法被盗，强烈的武装或潜行。 （尽管仍然仍然如此。） \n强迫同意在欧盟法律下没有合法 - 然而，根据NCC的欧洲调查，大多数受访者都觉得他们别无选择，只能在他们使用互联网时蠕动。\n 反过来指出欧盟有关的欧盟执法失败，其在近年来在一般数据保护条例（GDPR）下已经提交的成绩 - 其中一些人现在超过三岁（仍然是HAVEN' T导致任何对规则破坏者的行动）。\n 在过去的几年里，欧盟立法者承认了斑驳的GDPR执法问题 - 有趣的是，委员会在其最近的数字监管建议中提出了一些替代执法结构，例如对数字服务法案的非常大的在线平台监督（DSA）。\n 在这封信中，联盟建议DSA作为包含禁止监测的广告的理想立法车辆。\n 谈判塑造欧盟机构需要投票的最终提案仍然是持续投票的 - 但欧盟议会可能会拿起巴吞来推动监督广告的禁令。它有权修改委员会的立法提案，并且需要通过其批准所采用的法律草案。所以有很多仍在玩。\n “在美国，我们敦促立法者颁布全面的隐私立法，”联盟补充道。\n  联盟正在努力呼吁禁止禁止基于监视的广告，另一份报告（也由NCC）展示了针对Micrargeting的案件 - 总结了令人担忧的担忧，以便操纵广告作为认识Adtech Industry的浩瀚，背景人类 - 分析和数据交易增长。 \n列出的担忧不仅关注隐私剥离实践对于个别消费者的恐怖性方式（使个人和弱势群体的操纵，歧视和剥削），而且由于Adtech平台和数据经纪人中间体和钙化而标志着数字竞争的损害出版商的收入 - 侵蚀，例如，职业新闻能力维持自己，创造广告欺诈能够蓬勃发展的条件。\n 另一个争论是，民主社会的整体健康受到监测的广告的风险 - 作为设备和激励措施燃料的放大误导和创造安全风险，甚至是国家安全风险。 （当然，强大和独立的新闻也是健康民主的核心木板。）\n “这损害了消费者和企业，可以破坏民主的基石，”联盟警告。\n “虽然我们认识到广告是内容创作者和出版商在线的重要收入来源，但这并不是为了”向合适的人们向合适的人们展示正确的广告“而建立的大规模商业监控系统。 “其他形式的广告技术存在，不依赖于间谍消费者，并且表明这种替代模型可以实施，而不会显着影响收入。\n “目前基于监视的广告系统中没有公平权衡。我们鼓励您参加立场，并考虑作为欧盟的数字服务行为的一部分禁止基于监视的广告，以及为美国而颁布的逾期联邦隐私法。“\n  这封信只是最新的萨尔沃反对“有毒的Adtech”。和Facebook和谷歌这样的广告巨头 - 现在几年 - 看到了墙上的亲密文字。\n 因此，Facebook声称“枢转自私”;它的计划在其第一方数据优势锁定（通过合并不同消息产品的基础设施）;它对加密的浓厚。 \n它也是为什么谷歌一直在堆叠一堆替代的Adtech，它希望取代第三方跟踪饼干。虽然其提出的替代 - 所谓的“隐私沙箱” - 仍然可以使一组互联网用户组织在“兴趣”桶中的算法群体，以进行广告目标目的，这些目的仍然没有看起来不太适合互联网用户权利。 （也有担忧也在竞争前提出。）\n 在它的“沙箱”提案所关注的地方，谷歌可能会在法立法的可能性中进行理解 - 或者至少更加紧密控制 - 微量凝固。因此，它试图与开发替代的Adtech进行比赛，这些替代地区会有太大的目标效力（维持其市场力量），而是通过交换网络用户队列的个人，可能是禁止“微观凝固”的技术。\n 因此，涉及此问题的立法者将需要聪明，他们将如何起草旨在解决由监测造成的广告造成的损害的任何法律。\n 当然，如果他们想要防止相同的旧的小规模和大规模操纵滥用行为。\n NCC的报告指出它作为数字广告模型的“良好替代品”的报告指出，这不依赖于消费者的系统监测。其中 - 它还认为 - 为广告商和出版商提供“更多的监督和控制，并显示广告以及正在显示的广告”。\n 广告欺诈问题肯定会大规模遭受报酬。但是，嗯，回顾一下Facebook多久达到自我报告的广告指标的问题，这是一个有效的人们才能回顾一下。\n “在没有基于关于消费者的私密细节，可以出售广告空间。解决方案已经存在，以显示相关背景下的广告，或者消费者自我报告他们想要看到的广告，“NCC的Digitalpolicy，Finnmyrstad，在一份声明中指出。 \n“禁止监控的广告也将为更透明的广告市场铺平道路，减少了利用数据经纪人等第三方分享广告收入的大部分所需的必要性。 一个级别的比赛领域将有助于向广告商和内容提供商进行更多控制，并保持收入的更大份额。“ ", "note_en": "The objection is to a form of digital advertising that relies upon a massive apparatus of background data processing which sucks in information about individuals, as they browse and use services, to create profiles which are used to determine which ads to serve (via multi-participant processes like the high speed auctions known as real-time bidding).\n The EU’s lead data protection supervisor  previously called for a ban on targeted advertising which relies upon pervasive tracking — warning over a multitude of associated rights risks.\n   Back in March, a US coalition of privacy, consumer, competition and civil rights groups also took collective aim at microtargeting. So pressure is growing on lawmakers on both sides of the Atlantic to tackle exploitative adtech as consensus builds over the damage associated with mass surveillance-based manipulation.\n At the same time,  momentum is clearly building for  pro-privacy  consumer tech and  services — showing the rising store being placed by users and innovators on business models that respect people’s data.\n The growing uptake of such services underlines how alternative, rights-respecting digital business models are not only possible (and accessible, with many freemium offerings) but increasingly popular.\n  In an  open letter addressing EU and US policymakers, the international coalition — which is comprised of 55 organizations and more than 20 experts including groups like Privacy International, the Open Rights Group, the Center for Digital Democracy, the New Economics Foundation, Beuc, Edri and Fairplay — urges legislative action, calling for a ban on ads that rely on “systematic commercial surveillance” of Internet users in order to serve what Facebook founder Mark Zuckerberg likes, euphemistically, to refer to as ‘relevant ads’.\n The problem with Zuckerberg’s (self-serving) framing is that, as the coalition points out, the vast majority of consumers don’t actually want to be spied upon to be served with these creepy ads.\n Any claimed ‘relevance’ is irrelevant to consumers who experience ad-stalking as creepy and unpleasant. (And just imagine how the average Internet user would feel if they could peek behind the adtech curtain — and see the vast databases where people are profiled at scale so their attention can be sliced and diced for commercial interests and sold to the highest bidder).\n The coalition points to a  report examining consumer attitudes to surveillance-based advertising, prepared by one of the letter’s signatories (the Norwegian Consumer Council; NCC), which found that only one in ten people are positive about commercial actors collecting information about them online — and only one in five think ads based on personal information are okay.\n 1/4 🙅🏾‍♀️80-90% of people online don&#39;t want to be spied on for &#39;more relevant ads,&#39; finds  @Forbrukerradet&#39;s report.🙅🏾‍♀️\n Neither do we at  @edri, which is why we join over 50 orgs &amp; 20 academics &amp; experts for a transatlantic call to  #BanSurveillanceAdvertising. https://t.co/bTCdZIsSuP  pic.twitter.com/3rtDjAMIxA\n A full third of respondents to the survey were “very negative” about microtargeted ads — while almost half think advertisers should not be able to target ads based on any form of personal information.\n The report also highlights a sense of impotence among consumers when they go online, with six out of ten respondents feeling that they have no choice but to give up information about themselves.\n That finding should be particularly concerning for EU policymakers as the bloc’s data protection framework is supposed to provide citizens with a suite of rights related to their personal data that should protect them against being strong-armed to hand over info — including stipulating that if a data controller intends to rely on user consent to process data then consent must be informed, specific and freely given; it can’t be stolen, strong-armed or sneaked through using dark patterns. (Although that remains  all too often the case.)\n  Forced consent is not legal under EU law — yet, per the NCC’s European survey, a majority of respondents feel they have no choice but to be creeped on when they use the Internet.\n That in turn points to an ongoing EU enforcement failure over major adtech-related complaints, scores of which have been filed in recent years under the General Data Protection Regulation (GDPR) —  some of which are now over three years old (yet still haven’t resulted in any action against rule-breakers).\n Over the past couple of years  EU lawmakers have acknowledged problems with patchy GDPR enforcement — and it’s interesting to note that the Commission suggested some alternative enforcement structures in its  recent digital regulation proposals, such as for oversight of very large online platforms in the  Digital Services Act (DSA).\n In the letter, the coalition suggests the DSA as the ideal legislative vehicle to contain a ban on surveillance-based ads.\n Negotiations to shape a final proposal which EU institutions will need to vote on remain ongoing — but it’s possible the EU parliament could pick up the baton to push for a ban on surveillance ads. It has the power to amend the Commission’s legislative proposals and its approval is needed for draft laws to be adopted. So there’s plenty still to play for.\n “In the US, we urge legislators to enact comprehensive privacy legislation,” the coalition adds.\n  The coalition is backing up its call for a ban on surveillance-based advertising with another  report (also by the NCC) which lays out the case against microtargeting — summarizing the raft of concerns that have come to be  attached to manipulative ads as awareness of the adtech industry’s vast, background people-profiling and data trading has grown.\n Listed concerns not only focus on how privacy-stripping practices are horrible for individual consumers (enabling the manipulation, discrimination and exploitation of individuals and vulnerable groups) but also flag the damage to digital competition as a result of adtech platforms and data brokers intermediating and cannibalizing publishers’ revenues — eroding, for example, the ability of professional journalism to sustain itself and creating the conditions where ad fraud has been able to flourish.\n Another contention is that the overall health of democratic societies is put at risk by surveillance-based advertising — as the apparatus and incentives fuel the amplification of misinformation and create security risks, and even national security risks. (Strong and independent journalism is also, of course, a core plank of a healthy democracy.)\n “This harms consumers and businesses, and can undermine the cornerstones of democracy,” the coalition warns.\n “Although we recognize that advertising is an important source of revenue for content creators and publishers online, this does not justify the massive commercial surveillance systems set up in attempts to ‘show the right ad to the right people’,” the letter goes on. “Other forms of advertising technologies exist, which do not depend on spying on consumers, and cases have shown that such alternative models can be implemented without significantly affecting revenue.\n “There is no fair trade-off in the current surveillance-based advertising system. We encourage you to take a stand and consider a ban of surveillance-based advertising as part of the Digital Services Act in the EU, and the for U.S. to enact a long overdue federal privacy law.”\n  The letter is just the latest salvo against ‘toxic adtech’. And advertising giants like Facebook and Google have — for several years now — seen the pro-privacy writing on the wall.\n Hence Facebook’s claimed ‘ pivot to privacy‘; its plan to lock in its first party data advantage (by  merging the infrastructure of different messaging products); and its  keen interest in crypto.\n It’s also why Google has been working on a stack of alternative adtech that it wants to replace third party tracking cookies. Although its proposed replacement — the so-called ‘ Privacy Sandbox‘ — would still enable groups of Internet users to be opaquely clustered by its algorithms in ‘interest’ buckets for ad targeting purposes which still  doesn’t look great for Internet users’ rights either. (And  concerns have been raised on the competition front too.)\n Where its ‘Sandbox’ proposal is concerned, Google may well be factoring in the possibility of legislation that outlaws — or, at least, more tightly controls — microtargeting. And it’s therefore trying to race ahead with developing alternative adtech that would have much the same targeting potency (maintaining its market power) but, by swapping out individuals for cohorts of web users, could potentially sidestep a ban on ‘microtargeting’ technicalities.\n Legislators addressing this issue will therefore need to be smart in how they draft any laws intended to tackle the damage caused by surveillance-based advertising.\n Certainly they will if they want to prevent the same old small- and large-scale manipulation abuses from being perpetuated.\n The NCC’s report points to what it dubs as “good alternatives” for digital advertising models which don’t depend on the systematic surveillance of consumers to function. And which — it also argues — provide advertisers and publishers with “more oversight and control over where ads are displayed and which ads are being shown”.\n The problem of ad fraud is certainly massively underreported. But, well, it’s instructive to recall how often Facebook has had to  ‘fess up to problems with self reported ad metrics…\n “It is possible to sell advertising space without basing it on intimate details about consumers. Solutions already exist to show ads in relevant contexts, or where consumers self-report what ads they want to see,” the NCC’s director of digital policy, Finn Myrstad, noted in a statement.\n “A ban on surveillance-based advertising would also pave the way for a more transparent advertising marketplace, diminishing the need to share large parts of ad revenue with third parties such as data brokers. A level playing field would contribute to giving advertisers and content providers more control, and keep a larger share of the revenue.”", "posttime": "2021-06-23 18:18:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,加入,coalition", "title": "国际联盟加入了禁止“监视广告”的呼吁 ", "title_en": "\n\t\t\t\tInternational coalition joins the call to ban ‘surveillance advertising’\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/23/international-coalition-joins-the-call-to-ban-surveillance-advertising/", "via": "", "real_tags": ["广告", "加入", "coalition"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067661, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们已经长时间一直自托管Grafana和涌入数据库，使用它来监视我们的自定义应用指标。但是，我们开始通过维护和5美元/莫数号液滴的性能限制推动我们的耐心性。\n 努力简化我们开始探索托管解决方案的东西。真的，我们只需要简单又便宜。我们考虑的两种主要选择是涌入云和格拉新云，都提供相当宽阔的自由层。\n     我们从涌入云开始，主要是因为我们已经使用涌入作为我们的数据存储。因此，我们不必重写我们推动指标的任何代码。总的来说，我们的第一次印象是好的，船上很简单，UI看起来很好。我们也很快就可以将数据纳入涌入云，并且可以开始设置我们的面板和警报。这是我们开始遇到问题的地方。\n    来自Grafana，我们被习惯了一定程度的定制。然而，涌入云提供了非常有限的定制。例如，Y轴单位只有3个选项，而传奇选项非常有限。\n  目测最令人沮丧的事情之一是，每次刷新数据时，图表系列颜色都会保持更改，使得追踪您正在查看的内容非常困难。\n  另一个非常令人沮丧的功能（或缺乏）是，悬停工具提示没有给出您鼠标光标目前悬停的特定系列的任何指示。这里的简单解决方案是使积极徘徊的系列保持或不均匀。\n     虽然我们可以与可视化和定制问题一起生活，但警报是我们完全放弃了涌入的云。无论我们尝试了多少，我们都无法获得一个简单的基本警报来工作。 \n设置警报的过程不是非常直观的。例如，“检查”UI让您设置所需的阈值。该图包含切换阈值标记的选项。然而，这些实际上并不是做任何事情，并且在UI中没有显示输入的阈值。这是我先卡住的地方，认为我的门槛没有设置，而且事实上它们是。\n  在门槛水平中，它也很容易意外地引入“空白”。首先，您可能会想到这样一个警报（如下），低于10并以上警告）。嗯，那么你缺少10的值（它成为一个“未知的”状态）。\n  因此，在这种情况下，您应该根据这样设置（Warn以上9且OK低于10），这是正确的，但感觉错误。我相信他们可能会提出更好的解决方案。\n  但是，在添加“检查”并设置“通知端点”后，我仍然没有得到任何警报。经过一段时间，我意识到另一个我错过了ui，即“通知规则”。\n  我此时很兴奋，因为似乎有很多灵活性。我开始通过测试设置警报，如果警报仍然至关重要，每24小时提醒我们。虽然这实际上是工作的，但它也会导致我们的松弛完全用100多个通知垃圾邮件。我不确定为什么......但我们很快就删除了这个警报。\n  在此之后，我尝试为状态从OK到CRIT设置一个简单的警报。然而，这只是不起作用。没有警报被发送。在这一点上，我们放弃了，在花费超过1周后试图让事情上班。\n 要记住的一件事是，涌入云的免费层只包括2个警报（所以我们肯定需要升级到有偿层，如果我们决定留在涌入云端）。 \n我们遇到的另一个错误是，在一个点，一个团队成员尝试重置他们的密码，这改为创建了一个全新的组织，并且不再能够使用新的电子邮件地址创建新帐户而无法重新加入原始组织...\n     即使我们以前使用的Grafana用于可视化，我们也有点犹豫了尝试Grafana云。主要原因是我们需要从涌入的涌入，为我们的存储器进行存储到Graphite或Prometheus，这些云在Grafana云上提供。\n 由于我们主要监视基本应用指标，我们理想地想要一个简单的端点，我们可以将数据推送到（无需花哨的缓冲，冗余或错误检查）。此外，由于我们的应用程序在PaaS中运行，我们不希望必须安装任何额外的本地依赖项，以便将数据推向Grafana。最初，我认为这是一个需要运行的本地代理，但我们最终弄清楚如何使用石墨HTTP API将指标推向Grafana。\n    找到有点棘手，但可以使用石墨HTTP API将数据直接推送到Grafana云。可以在此处找到文档。如果链接不起作用，因此尝试谷歌作用，因为他们的文档链接似乎更改和打破了。\n 它们还提供了一个小示例GitHub Repo，我用作起点。\n  const api_key =＆＃39; ＆lt; orgid＆gt;：＆lt;令牌＆gt; ＆＃39; ; const端点=＆＃39; https://graphite-us-central1.grafana.net/metrics＆＃39; ; //获取当前UNIX时间戳const time = math。地板（日期。现在（）/ 1000）; //WE＆＃39;每10秒报告值Const间隔= 10; const data = {时间：数学。地板（时间/间隔）*间隔，//将时间戳对齐到间隔名称：＆＃39; app.some_metric.some_field＆＃39; ，间隔：间隔，值：1.234，标签：[＆＃39;类型= foo＆＃39; ，＆＃39;亲切=酒吧＆＃39; ]，}; const标题= {授权：`持票人$ {api_key}`};得到了 。 post（端点，{标题，​​responseType：＆＃39; json＆＃39;，解决obdyonly：true，json：data，}）;\n 用石墨记住的一个重要事情是指标必须与给定的间隔对齐。例如，10的间隔意味着给定系列每10秒将有一个值。最好频繁地确保将度量稍微稍微推动您的度量，然后若要确保不会错过任何时隙，这将导致数据中的空隙（空值）。 \n由于我们之前只使用涌入作为Grafana的数据源以前，因此有一点具有石墨的学习曲线。特别是，我很难弄清楚如何使用标签。但是，一旦您了解语法，它就会很容易使用。\n   但是，对于与标签的系列，您首先要选择标记：名称才能选择您的度量标准（我没有自动创建石墨，因此我首先对此感到困惑）。\n    之后，您可以添加其他标记以通过标记值过滤数据，并且您还可以添加诸如AliasbyTags的函数以通过标签值命名每个系列（导致更好的观看图例）。\n     我们发现的另一个奖金功能是合成监控功能，也可用在免费层。它提供了一些基本的应用程序监控，具有停机时间监控和全局延迟检查。很高兴有！\n     整体两个选项都有非常慷慨的自由层，非常适合任何希望开始基本监控的人。涌入云的最大缺点是他们只在自由层上提供2个警报，这在我看来感觉非常低。\n            两者之间的最大区别显然是格拉纳纳提供的成熟和丰富的功能集，而解决方案涌入云提供缺乏和越野车。我们现在将坚持Gradan云！ ", "note_en": "We’ve been self-hosting Grafana and an InfluxDB database for a long time, using it for monitoring our custom application metrics. However, we started to push our patience with maintenance and the limits of performance on a $5/mo DigitalOcean droplet.\n In an effort to simplify things we started exploring what hosted solutions are available. Really, we just want something simple and cheap. The two main options we considered were InfluxDB Cloud and Grafana Cloud, both offering fairly generous free-tiers.\n     We started with InfluxDB Cloud, mainly because we were already using InfluxDB as our data store. Thus, we didn’t have to rewrite any of our code that pushes metrics. Overall our first impressions were good, onboarding was simple and the UI looked nice. We were quickly able to get our data into InfluxDB Cloud as well, and could start setting up our panels and alerts. This is where we started to run into issues.\n    Coming from Grafana, we were used to a certain degree of customization. InfluxDB Cloud however offers very limited customization. For example, there are only 3 options available for Y-axis units and legend options are very limited.\n  Visually one of the most frustrating things was that the graph series colors kept changing  every time you refresh the data, making it very difficult to keep track of what you’re looking at.\n  Another very frustrating feature (or lack thereof) is that the hover tooltip does not give any indication of the specific series your mouse cursor is currently hovering over. A simple solution here would be to make the actively hovered series hold or emphazied.\n     While we  could live with the visualization and customization issues, alerts was were we completely gave up on InfluxDB Cloud. No matter how much we tried, we just weren’t able to get a simple basic alert to work.\n The process of setting up alerts was not very intuitive. For example, the “Checks” UI let’s you setup your desired thresholds. The graph includes options to toggle the threshold markers. Yet these don’t actually do anything at all, and the inputted thresholds aren’t shown in the UI. This is where I got stuck first, thinking my thresholds weren’t set, when in fact they were.\n  It’s also easy to accidentally introduce “gaps” in your threshold levels. At first you may think to setup an alert like this (OK below 10 and WARN above 10). Well, then you’re missing the value of 10 (which becomes an “unknown” state).\n  So in this case you should setup something like this instead (WARN above 9 and OK below 10), which is  correct but just feels wrong. I’m sure they could have come up with a better solution for this.\n  However, after adding a “Check” and setting up my “Notification Endpoint” I still wasn’t getting any alerts. After some time I realized there was another UI I had missed, namely “Notification Rules”.\n  I got quite excited at this point, since there seemed to be a lot of flexibility. I started by testing setting up an alert that would remind us every 24 hours if an alert was still critical. While this did in fact  work, it also resulted in our Slack getting completely spammed with 100+ notifications. I’m not sure why… but we quickly removed this alert.\n  After this I tried setting up a simple alert for when the status changes from OK to CRIT. This however, just didn’t work. No alerts were sent. At this point we gave up, after having spent more than 1 week trying to get things to work.\n One thing to keep in mind is that InfluxDB Cloud’s free tier only includes 2 alerts (so we would have definitely needed to upgrade to the paid tier if we had decided to stay with InfluxDB Cloud).\n Another bug we ran into was that at one point a team member tried resetting their password, which instead created a brand new organization and was no longer able to re-join the original organization without creating a new account using a new email address…\n     Even though we were previously using Grafana for visualizations we were a little hesitant to try Grafana Cloud. The main reason was that we would need to switch from InfluxDB for our storage to either Graphite or Prometheus, which are offered on Grafana Cloud.\n Since we are primarily monitoring basic application metrics we ideally just wanted a simple endpoint that we could push our data to (no need for fancy buffering, redundancy or error checking). Also, since our application is running in a PaaS we didn’t want to have to install any extra local dependencies in order to push data to Grafana. Initially I thought it was a requirement to have a local agent running, but we did eventually figure out how to push metrics to Grafana using the Graphite HTTP API.\n    It was a little tricky to find, but it is possible to push data directly to Grafana Cloud using the Graphite HTTP API. The documentation can be found  here. If the link doesn’t work, try Googling for it since their docs links seem to change and break quite often.\n They also provide a small example  GitHub repo, which I used as a starting point.\n  const  API_KEY  =  &#39; &lt;orgId&gt;:&lt;token&gt; &#39; ; const  ENDPOINT  =  &#39; https://graphite-us-central1.grafana.net/metrics &#39; ; // get current unix timestamp const  time  =  Math . floor ( Date . now ()  /  1000 ); // we&#39;re reporting values every 10 seconds const  interval  =  10 ; const  data  =  {  time :  Math . floor ( time  /  interval )  *  interval ,  // align timestamp to interval  name :  &#39; app.some_metric.some_field &#39; ,  interval :  interval ,  value :  1.234 ,  tags :  [ &#39; type=foo &#39; ,  &#39; kind=bar &#39; ], }; const  headers  =  {  Authorization :  `Bearer  ${ API_KEY } `  }; got . post ( ENDPOINT ,  {  headers ,  responseType :  &#39; json &#39; ,  resolveBodyOnly :  true ,  json :  data , });\n One important thing to remember with Graphite is that metrics have to be aligned to the given interval. For example, an interval of 10 means that there will be one value for the given series every 10 seconds. It is best to make sure you push your metrics slightly more frequently then the interval to make sure you don’t miss any time slots, which would result in gaps (null values) in your data.\n    Since we’ve only been using InfluxDB as a data source in Grafana previously, there was a bit of a learning curve with Graphite. In particular, I was having a hard time figuring out how to use tags. However, once you understand the syntax it’s fairly easy to use.\n   However, for series with tags, you first to have select  Tag: name in order to choose your metric (I didn’t realize graphite automatically created the “name” tag, so I was confused about this at first).\n    After that, you can add additional tags to filter the data by tag value, and you can also add functions such as  aliasByTags to name each series by their tag value (resulting in better looking legends).\n     Another bonus feature we discovered is the Synthethic Monitoring feature, also available in the free tier. It provides some basic application monitoring, with downtime monitoring and global latency checks. Nice to have!\n     Overall both options have very generous free tiers, great for anyone looking to get started with basic monitoring. The biggest drawback with InfluxDB Cloud is that they only offer 2 alerts on the free-tier, which feels very low in my opinion.\n            The biggest difference between the two is clearly the maturity and rich feature-set offered by Grafana, whereas the solution InfluxDB Cloud offers feels lacking and buggy. We’ll stick with Grafana Cloud for now!", "posttime": "2021-06-23 18:10:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "监控,monitoring,涌入", "title": "托管监控：评估涌入云和Grafana云 ", "title_en": "Hosted Monitoring: Evaluating InfluxDB Cloud and Grafana Cloud", "transed": 1, "url": "https://pqvst.com/2021/06/22/hosted-monitoring-evaluating-influx-and-grafana/", "via": "", "real_tags": ["监控", "涌入"]}]