[{"category": "", "categoryclass": "", "imagename": "3e7d3dcddf12c7215c845d537e72dd20.jpg", "infoid": 1070674, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在周四晚上在线发布的预印本中，谷歌的研究人员与斯坦福大学、普林斯顿大学和其他大学的物理学家合作表示，他们首次使用谷歌的量子计算机展示了真正的“时间晶体”。物理学家多年来一直努力实现的一个新的物质阶段，时间晶体是一种物体，它的部分以有规律的、重复的循环运动，在不燃烧任何能量的情况下维持这种不断变化。 “结果是惊人的：你逃避了热力学第二定律，”合著者、德国德累斯顿马克斯普朗克复杂系统物理研究所所长 Roderich Moessner 说。这就是说无序总是会增加的定律。时间晶体也是第一个自发打破“时间平移对称性”的物体，这是一个稳定的物体在整个时间里保持不变的通常规则。时间水晶既稳定又不断变化，特殊时刻以周期性的时间间隔出现。时间晶体是物质相的新类别，扩展了相的定义。所有其他已知相，如水或冰，都处于热平衡状态：它们的组成原子已经进入环境温度允许的最低能量状态，并且它们的特性不随时间变化。时间晶体是第一个“失衡”相：尽管处于激发和演化状态，但它具有有序和完美的稳定性。 “这就是我们现在正在研究的一个全新且令人兴奋的空间，”现任职斯坦福大学的凝聚态物理学家 Vedika Khemani 说，她在研究生期间共同发现了新相，并与他人合着了这篇新论文。 .普林斯顿大学的 Khemani、Moessner、Shivaji Sondhi 和英国拉夫堡大学的 Achilleas Lazarides 于 2015 年发现了该相的可能性并描述了其关键特性；不久之后，由微软 Q 站的 Chetan Nayak 和加州大学圣巴巴拉分校领导的一组竞争物理学家将其确定为时间晶体。\n在过去的五年里，研究人员竞相创造时间水晶，但之前的演示虽然按他们自己的条件取得了成功，但未能满足确定时间水晶存在所需的所有标准。 “有充分的理由认为，这些实验都没有完全成功，像 [Google 的] 这样的量子计算机将特别适合比那些早期的实验做得更好，”美国大学凝聚态物理学家约翰查尔克说。没有参与这项新工作的牛津。谷歌的量子计算团队在 2019 年首次进行了普通计算机在实际时间内无法完成的计算，从而成为头条新闻。然而，该任务是为了显示加速而设计的，并没有内在的兴趣。新的时间晶体演示标志着量子计算机第一次找到了有报酬的工作。 “这是对 [Google] 处理器的绝妙使用，”Nayak 说。凭借今天已提交出版的预印本和其他近期成果，研究人员实现了对量子计算机的最初希望。物理学家理查德·费曼 (Richard Feynman) 在 1982 年提出这些设备的论文中认为，它们可以用来模拟任何可以想象的量子系统的粒子。时间水晶体现了这一愿景。鉴于其微妙成分的复杂组合，它是一种自然本身可能永远不会创造的量子物体。大自然最令人费解的法则激发了想象力，创造了配方。诺贝尔奖获得者物理学家弗兰克·维尔切克 (Frank Wilczek) 于 2012 年构思了这个想法，当时他正在教授一门关于普通（空间）晶体的课程。 “如果你考虑太空中的晶体，那么考虑晶体行为的时间分类也是很自然的，”不久之后他告诉本杂志。考虑钻石，一团碳原子的结晶相。团块在空间中的任何地方都由相同的方程控制，但它采用具有周期性空间变化的形式，原子位于晶格点。物理学家说它“自发地打破了空间平移对称性”。只有最小能量平衡状态才会以这种方式自发地打破空间对称性。\nWilczek 设想了一个平衡的多部分物体，很像钻石。但是这个物体打破了时间平移对称性：它经历了周期性运动，以规则的间隔返回到它的初始配置。 Wilczek 提出的时间晶体与挂钟等也有很大的不同——挂钟是一个也经历周期性运动的物体。时钟指针消耗能量并在电池耗尽时停止。 Wilczekian 时间晶体不需要输入并无限期地继续，因为系统处于超稳定平衡状态。如果这听起来难以置信，那就是：在经历了很多激动和争议之后，2014 年的一项证明表明，威尔切克的处方失败了，就像历史上设想的所有其他永动机一样。那一年，普林斯顿的研究人员正在考虑其他事情。 Khemani 和她的博士导师 Sondhi 正在研究多体定位，这是安德森定位的延伸，这是 1958 年诺贝尔奖获得者发现电子可以卡在原地，就像在崎岖景观的缝隙中一样。一个电子最好被描绘成一个波，它在不同地方的高度给出了在那里检测到粒子的可能性。随着时间的推移，波浪自然地扩散开来。但是菲利普·安德森发现随机性——例如晶格中随机缺陷的存在——会导致电子波分裂，破坏性地干扰自身，并在除小区域之外的任何地方抵消。粒子定位。几十年来，人们一直认为多个粒子之间的相互作用会破坏干扰效应。但在 2005 年，普林斯顿大学和哥伦比亚大学的三位物理学家表明，一维量子粒子链可以经历多体局域化；也就是说，他们都陷入了一个固定的状态。这种现象将成为时间晶体的第一个成分。想象一排粒子，每个粒子都有一个向上、向下或两个方向都有可能指向的磁性方向（或“自旋”）。想象一下，最初的四次旋转最初指向上、下、下和上。如果可以的话，自旋将在量子力学上波动并快速对齐。但是它们之间的随机干扰会导致这排粒子卡在它们的特定配置中，无法重新排列或进入热平衡。他们会无限期地向上、向下、向下和向上。\nSondhi 和一位合作者发现多体局域化系统可以表现出一种特殊的秩序，这将成为时间晶体的第二个关键要素：如果你翻转系统中的所有自旋（向下、向上、向上和向下）在我们的示例中），您将获得另一个稳定的多体本地化状态。 2014 年秋季，Khemani 在德累斯顿马克斯普朗克研究所休假加入 Sondhi。在那里，Moessner 和 Lazarides 专门研究所谓的 Floquet 系统：周期性驱动的系统，例如用特定频率的激光刺激晶体。激光的强度以及其对系统的影响强度会周期性地变化。 Moessner、Lazarides、Sondhi 和 Khemani 研究了以这种方式周期性驱动多体局部系统时会发生什么。他们在计算和模拟中发现，当你用激光以特定方式刺激局部自旋链时，它们会来回翻转，在两个不同的多体局部状态之间永远重复循环，而不会吸收任何净能量从激光。他们将他们的发现称为 pi 自旋玻璃相（其中角度 pi 表示 180 度翻转）。该小组在 2015 年的预印本中报告了这一新物质相的概念——有史以来发现的第一个多体、非平衡相，但“时间晶体”一词并未出现在其中。作者在 2016 年 6 月发表在《物理评论快报》上的更新版本中添加了该术语，感谢审稿人在致谢中建立了他们的 pi 自旋玻璃相和时间晶体之间的联系。在预印本的出现和出版之间还发生了其他事情：Nayak 是 Wilczek 的前研究生，他的合作者 Dominic Else 和 Bela Bauer 在 2016 年 3 月发布了一份预印本，提议存在称为 Floquet 时间晶体的物体。他们以 Khemani 和公司的 pi 自旋玻璃相为例。 Floquet 时间晶体表现出 Wilczek 设想的那种行为，但仅限于由外部能源定期驱动。这种时间晶体从不声称处于热平衡状态，从而避免了 Wilczek 最初想法的失败。因为它是一个多体局域系统，它的自旋或其他部分无法达到平衡；他们被困在原地。但该系统也不会升温，尽管被激光或其他驱动器泵浦。相反，它在局部状态之间无限期地来回循环。激光已经打破了自旋行所有时刻之间的对称性，取而代之的是“离散时间平移对称性”——也就是说，只有在激光的每个周期循环之后才有相同​​的条件。但是，通过它的来回翻转，自旋行进一步打破了激光强加的离散时间平移对称性，因为它自己的周期是激光的倍数。\nKhemani 和合著者详细描述了这个阶段，但 Nayak 的团队用时间、对称性和自发对称性破坏的语言来描述它——所有物理学中的基本概念。除了提供更性感的术语外，他们还提供了新的理解方面，并且他们稍微概括了 pi 自旋玻璃相之外的 Floquet 时间晶体的概念（注意它不需要一定的对称性）。他们的论文于 2016 年 8 月发表在《物理评论快报》上，两个月后 Khemani 和公司发表了该阶段第一个例子的理论发现。两个团体都声称已经发现了这个想法。从那时起，竞争对手的研究人员和其他人开始竞相创造现实中的时间水晶。 Nayak 的团队与马里兰大学的 Chris Monroe 合作，后者使用电磁场来捕获和控制离子。上个月，该小组在《科学》杂志上报道说，他们将被捕获的离子变成了近似的或“预热”时间晶体。它的周期性变化（在这种情况下，离子在两种状态之间跳跃）实际上与真正的时间晶体无法区分。但与钻石不同的是，这种预热时间晶体不是永远的。如果实验运行的时间足够长，系统会逐渐平衡，循环行为就会崩溃。 Khemani、Sondhi、Moessner 和合作者在别处搭上了他们的马车。 2019 年，谷歌宣布其 Sycamore 量子计算机在 200 秒内完成了一项任务，而传统计算机需要 10,000 年。 （其他研究人员后来描述了一种大大加快普通计算机计算速度的方法。）在阅读公告文件时，Moessner 说，他和他的同事们意识到“Sycamore 处理器包含我们需要实现的基本构建块作为其基本构建块。 Floquet时间水晶。”偶然地，Sycamore 的开发人员也在寻找与他们的机器有关的东西，这台机器太容易出错，无法运行专为成熟的量子计算机设计的密码学和搜索算法。当 Khemani 和同事联系到 Google 的理论家 Kostya Kechedzhi 时，他和他的团队很快同意在时间水晶项目上进行合作。 “我的工作，不仅是离散时间晶体，还有其他项目，是尝试将我们的处理器用作研究新物理或化学的科学工具，”Kechedzhi 说。", "note_en": "In  a preprint posted online Thursday night, researchers at Google in collaboration with physicists at Stanford, Princeton and other universities say that they have used Google’s quantum computer to demonstrate a genuine “time crystal” for the first time.\n A novel phase of matter that physicists have strived to realize for many years, a time crystal is an object whose parts move in a regular, repeating cycle, sustaining this constant change without burning any energy.\n “The consequence is amazing: You evade the second law of thermodynamics,” said co-author  Roderich Moessner, director of the Max Planck Institute for the Physics of Complex Systems in Dresden, Germany. That’s the law that says disorder always increases.\n Time crystals are also the first objects to spontaneously break “time-translation symmetry,” the usual rule that a stable object will remain the same throughout time. A time crystal is both stable and ever-changing, with special moments that come at periodic intervals in time.\n The time crystal is a new category of phases of matter, expanding the definition of what a phase is. All other known phases, like water or ice, are in thermal equilibrium: Their constituent atoms have settled into the state with the lowest energy permitted by the ambient temperature, and their properties don’t change with time. The time crystal is the first “out-of-equilibrium” phase: It has order and perfect stability despite being in an excited and evolving state.\n “This is just this completely new and exciting space that we’re working in now,” said  Vedika Khemani, a condensed matter physicist now at Stanford who co-discovered the novel phase while she was a graduate student and co-authored the new paper.\n Khemani, Moessner,  Shivaji Sondhi of Princeton and  Achilleas Lazarides of Loughborough University in the United Kingdom discovered the possibility of the phase and described its key properties in 2015; a rival group of physicists led by  Chetan Nayak of Microsoft Station Q and the University of California, Santa Barbara identified it as a time crystal soon after.\n Researchers have raced to create a time crystal over the past five years, but previous demos, though successful on their own terms,  have failed to satisfy all the criteria needed to establish the time crystal’s existence. “There are good reasons to think that none of those experiments completely succeeded, and a quantum computer like [Google’s] would be particularly well placed to do much better than those earlier experiments,” said  John Chalker, a condensed matter physicist at the University of Oxford who wasn’t involved in the new work.\n  Google’s quantum computing team  made headlines in 2019 when they  performed the first-ever computation that ordinary computers weren’t thought to be able to do in a practical amount of time. Yet that task was contrived to show a speedup and was of no inherent interest. The new time crystal demo marks one of the first times a quantum computer has found gainful employment.\n “It’s a fantastic use of [Google’s] processor,” Nayak said.\n With today’s preprint, which has been submitted for publication, and other  recent results, researchers have fulfilled the original hope for quantum computers. In his  1982 paper proposing the devices, the physicist Richard Feynman argued that they could be used to simulate the particles of any imaginable quantum system.\n A time crystal exemplifies that vision. It’s a quantum object that nature itself probably never creates, given its complex combination of delicate ingredients. Imaginations conjured the recipe, stirred by nature’s most baffling laws.\n   The Nobel Prize­-winning physicist Frank Wilczek conceived the idea in 2012, while teaching a class about ordinary (spatial) crystals. “If you think about crystals in space, it’s very natural also to think about the classification of crystalline behavior in time,” he  told this magazine not long after.\n Consider a diamond, a crystalline phase of a clump of carbon atoms. The clump is governed by the same equations everywhere in space, yet it takes a form that has periodic spatial variations, with atoms positioned at lattice points. Physicists say that it “spontaneously breaks space-translation symmetry.” Only minimum-energy equilibrium states spontaneously break spatial symmetries in this way.\n Wilczek envisioned a multi-part object in equilibrium, much like a diamond. But this object breaks time-translation symmetry: It undergoes periodic motion, returning to its initial configuration at regular intervals.\n  Wilczek’s proposed time crystal was profoundly different from, say, a wall clock — an object that also undergoes periodic motion. Clock hands burn energy and stop when the battery runs out. A Wilczekian time crystal requires no input and continues indefinitely, since the system is in its ultra-stable equilibrium state.\n If it sounds implausible, it is: After much thrill and controversy,  a 2014 proof showed that Wilczek’s prescription fails, like all other perpetual-motion machines conceived throughout history.\n That year, researchers at Princeton were thinking about something else. Khemani and her doctoral adviser, Sondhi, were studying many-body localization, an extension of Anderson localization, the Nobel Prize-winning 1958 discovery that an electron can get stuck in place, as if in a crevice in a rugged landscape.\n An electron is best pictured as a wave, whose height in different places gives the probability of detecting the particle there. The wave naturally spreads out over time. But Philip Anderson discovered that randomness — such as the presence of random defects in a crystal lattice — can cause the electron’s wave to break up, destructively interfere with itself, and cancel out everywhere except in a small region. The particle localizes.\n People thought for decades that interactions between multiple particles would destroy the interference effect. But in 2005, three physicists at Princeton and Columbia universities  showed that a one-dimensional chain of quantum particles can experience many-body localization; that is, they all get stuck in a fixed state. This phenomenon would become the first ingredient of the time crystal.\n Imagine a row of particles, each with a magnetic orientation (or “spin”) that points up, down, or some probability of both directions. Imagine that the first four spins initially point up, down, down and up. The spins will quantum mechanically fluctuate and quickly align, if they can. But random interference between them can cause the row of particles to get stuck in their particular configuration, unable to rearrange or settle into thermal equilibrium. They’ll point up, down, down and up indefinitely.\n Sondhi and a collaborator had discovered that many-body localized systems can exhibit a special kind of order, which would become the second key ingredient of a time crystal: If you flip all the spins in the system (yielding down, up, up and down in our example), you get another stable, many-body localized state.\n  In the fall of 2014, Khemani joined Sondhi on sabbatical at the Max Planck Institute in Dresden. There, Moessner and Lazarides specialized in so-called Floquet systems: periodically driven systems, such as a crystal that’s being stimulated with a laser of a certain frequency. The laser’s intensity, and thus the strength of its effect on the system, periodically varies.\n Moessner, Lazarides, Sondhi and Khemani studied what happens when a many-body localized system is periodically driven in this way. They found in calculations and simulations that when you tickle a localized chain of spins with a laser in a particular way, they’ll flip back and forth, moving between two different many-body localized states in a repeating cycle forever without absorbing any net energy from the laser.\n They called their discovery a pi spin-glass phase (where the angle pi signifies a 180-degree flip). The group reported the concept of this new phase of matter — the first many-body, out-of-equilibrium phase ever identified — in  a 2015 preprint, but the words “time crystal” didn’t appear anywhere in it. The authors added the term in  an updated version, published in  Physical Review Letters in June 2016, thanking a reviewer in the acknowledgments for making the connection between their pi spin-glass phase and time crystals.\n Something else happened between the preprint’s appearance and its publication: Nayak, who is a former graduate student of Wilczek’s, and collaborators Dominic Else and Bela Bauer put out  a preprint in March 2016 proposing the existence of objects called Floquet time crystals. They pointed to Khemani and company’s pi spin-glass phase as an example.\n A Floquet time crystal exhibits the kind of behavior envisioned by Wilczek, but only while being periodically driven by an external energy source. This kind of time crystal circumvents the failure of Wilczek’s original idea by never professing to be in thermal equilibrium. Because it’s a many-body localized system, its spins or other parts are unable to settle into equilibrium; they’re stuck where they are. But the system doesn’t heat up either, despite being pumped by a laser or other driver. Instead, it cycles back and forth indefinitely between localized states.\n  Already, the laser will have broken the symmetry between all moments in time for the row of spins, imposing instead “discrete time-translation symmetry” — that is, identical conditions only after each periodic cycle of the laser. But then, through its back-and-forth flips, the row of spins further breaks the discrete time-translation symmetry imposed by the laser, since its own periodic cycles are multiples of the laser’s.\n Khemani and co-authors had characterized this phase in detail, but Nayak’s group couched it in the language of time, symmetry and spontaneous symmetry-breaking — all fundamental concepts in physics. As well as offering sexier terminology, they provided new facets of understanding, and they slightly generalized the notion of a Floquet time crystal beyond the pi spin-glass phase (noting that a certain symmetry it has isn’t needed). Their paper was  published in  Physical Review Letters in August 2016, two months after Khemani and company published the theoretical discovery of the first example of the phase.\n Both groups claim to have discovered the idea. Since then, the rival researchers and others have raced to create a time crystal in reality.\n  Nayak’s crew teamed up with  Chris Monroe at the University of Maryland, who uses electromagnetic fields to trap and control ions. Last month, the group  reported in  Science that they’d turned the trapped ions into an approximate, or “prethermal,” time crystal. Its cyclical variations (in this case, ions jumping between two states) are practically indistinguishable from those of a genuine time crystal. But unlike a diamond, this prethermal time crystal is not forever; if the experiment ran for long enough, the system would gradually equilibrate and the cyclical behavior would break down.\n Khemani, Sondhi, Moessner and collaborators hitched their wagon elsewhere. In 2019, Google  announced that its Sycamore quantum computer had completed a task in 200 seconds that would take a conventional computer 10,000 years. (Other researchers would later  describe a way to greatly speed up the ordinary computer’s calculation.) In reading the announcement paper, Moessner said, he and his colleagues realized that “the Sycamore processor contains as its fundamental building blocks exactly the things we need to realize the Floquet time crystal.”\n Serendipitously, Sycamore’s developers were also looking for something to do with their machine, which is too error-prone to run the cryptography and search algorithms designed for full-fledged quantum computers. When Khemani and colleagues reached out to  Kostya Kechedzhi, a theorist at Google, he and his team quickly agreed to collaborate on the time crystal project. “My work, not only with discrete time crystals but other projects, is to try and use our processor as a scientific tool to study new physics or chemistry,” Kechedzhi said.", "posttime": "2021-07-31 00:32:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,晶体,时间", "title": "物理学家说，他们第一次使用谷歌的量子计算机演示了一种时间晶体，它可以在状态之间永远循环而不消耗能量", "title_en": "Physicists say they used Google's quantum computer to demo a time crystal, which forever cycles between states without consuming energy, for the first time", "transed": 1, "url": "https://www.quantamagazine.org/first-time-crystal-built-using-googles-quantum-computer-20210730/", "via": "", "real_tags": ["谷歌", "google", "晶体", "时间"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070673, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2021 年 7 月 28 日 RabbitMQ Streams 概述介绍了流，这是 RabbitMQ 3.9 中的一项新功能，RabbitMQ Streams First Application 提供了流 Java 客户端的编程模型的概述。这篇文章介绍了如何在 RabbitMQ Streams 中对已发布的消息进行重复数据删除。由于重复数据删除是一个关键且复杂的概念，本文将逐步引导您了解此机制，从一个幼稚且有些损坏的发布应用程序到优化且可靠的实现。应用程序很容易多次发布相同的消息：应用程序以错误的方式重新启动并从头开始重新发布所有数据，网络故障使应用程序重新连接并重新发送几条消息，等等。尽管消费应用程序应该使它们的处理具有幂等性，但应尽可能避免重复发布的消息，因为它们会减慢处理速度并占用额外的空间。这篇文章将从一个简单的应用程序开始，该应用程序会生成大量重复的消息（以帮助掌握问题），并将一点一点地改进它，最终得到一个强大的解决方案。发布程序模拟一个从数据源读取记录并为这些记录中的每一个发布消息的应用程序：Producer producer = environment。生产者建造者 () 。流（“重复数据删除流”）。建造 （）; int messageCount = 10 ;记录（ 0 ， messageCount ）。 forEach(record-&gt;{Message message=producer.messageBuilder().addData(record.content().getBytes(StandardCharsets.UTF_8)).build();producer.send(message,confirmationStatus-&gt;latch.countDown()) ; });\n我们假设应用程序读取了所有可用的记录，并且第一次运行时该数字是 10。如果您想要有关流 Java 客户端 API 的提醒，您可以阅读 RabbitMQ Streams First Application。如果你想在阅读时运行代码，你可以继续下一节。注意你可以按照帖子的其余部分不运行任何东西，所以如果你不想尝试，你可以跳过下一节代码。运行示例需要安装 Docker、Git 和 Java 8 或更高版本。您可以使用以下命令启动代理： docker run -it --rm --name rabbitmq -p 5552:5552 \\ -e RABBITMQ_SERVER_ADDITIONAL_ERL_ARGS = &#39;-rabbitmq_stream Adverted_host localhost&#39; \\ rabbitmq:3.9 代码托管在 GitHub 上。以下是如何克隆存储库并创建示例中使用的流： 在第一次运行时，应用程序从数据源读取所有记录（总共 10 条记录）对于这次运行）并为每个人发送一条消息。我们可以使用以下命令检查流的内容：./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$Consume &#39; 正在连接...已连接。开始消费，按回车退出...message 0message 1message 2message 3message 4message 5message 6message 7message 8message 9\n到目前为止，一切都很好，我们发布了 10 条消息，我们可以在流中看到 10 条消息。现在让我们看看我们的应用程序是否可行并在第二次运行时保持正常工作。现在我们可以想象，我们在第二天运行应用程序，数据源包含 10 条额外记录，所以总共有 20 条记录。我们的发布应用程序是愚蠢的：它会从数据源读取所有内容并发布消息。让我们尝试：./ mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$Consume&#39;Connecting...Connected.Starting消耗，按回车退出...message 0message 1message 2...message 9message 0message 1message 2...message 9message 10message 11...message 19 我们看到 30 条消息：第一次运行的 10 条消息和第二次运行的 20 条消息。前 10 条出现两次，所以我们的流包含重复。按照我们实现的方式应用程序这是预期的，但我们必须解决这个问题，因为我们只想在第二次运行时发布新记录。流 Java 客户端文档提供了有关生产者名称和发布 ID 的更多详细信息。注意消息重复数据删除并非特定于流 Java 客户端，只要符合语义，任何客户端都可以实现。我们只需要为我们的发布应用程序选择一个名称，并在不同的运行中保留这个名称。对于发布 ID，我们可以使用记录的 ID：它恰好是唯一的，并且记录按 ID 排序返回（例如只是像数据库中带有数字主键和适当查询的记录）。生产者生产者 = 环境。生产者建造者 () 。流（“重复数据删除流”）。 name (&quot;app-1&quot;) // 为生产者提供一个名字。 ConfirmTimeout ( Duration . ZERO ) // 永不停止重试。建造 （）; int messageCount = 10 ;记录（ 0 ， messageCount ）。 forEach ( record -&gt; { Message message = producer .messageBuilder ().publishId ( record . id ()) // 设置发布ID . addData ( record . content ( ). getBytes ( StandardCharsets . UTF_8 )) .build();生产者.发送(消息,confirmationStatus-&gt;闩锁.countDown());});\n代理将跟踪此生产者的最后一个发布 ID。我们将看到这如何允许对消息进行重复数据删除。 ./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$CreateEmptyStream&#39;Connection...连接。尝试删除流（如果存在）。已删除流。创建“重复数据删除流”流。已创建流。现在我们在第二天运行我们的应用程序，有额外的 10 条记录。我们的应用程序没有第一次那么愚蠢：它使用生产者名称和发布 ID 进行重复数据删除。但它仍然从数据源读取所有记录： ./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$Consume&#39;Connecting...Connected.Starting 正在消费，按回车退出...message 0message 1message 2...message 9message 10message 11message 12...message 19 这次没有重复，很好！即使我们重新发布了前 10 条消息，broker 还是设法过滤掉了它们。它知道它应该忽略发布 ID 小于 9（第一次运行中的最后一个值）的所有消息。注意，即使它过滤掉了这些重复项，它仍然向客户端确认了它们。这比我们第一个最终出现重复的应用程序要好得多，但仍然存在一个问题：应用程序每次都重新发送所有消息。如果数据不断增长，应用程序每次运行将花费越来越多的时间。幸运的是，可以找出应用程序在上次运行中停止的位置。在本节中，我们将看到如何通过不仅使用重复数据删除，而且还查询代理以获取它发送的最后一个发布 ID，从而使发布应用程序更加智能。\n./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$CreateEmptyStream&#39;Connection...连接。尝试删除流（如果存在）。已删除流。创建“重复数据删除流”流。已创建流。这个版本的应用程序不是最聪明的，但对于“第一天”来说已经足够了。发布应用程序需要在第二天做得更好，其中数据源现在包含 20 条消息。它可以使用 Producer#getLastPublishingId 方法向代理查询此生产者的最后一个发布 ID 为该流。应用程序可以添加 1到这个值，它会得到它的起点。然后它只需要从这一点选择记录，直到最后一条可用记录。这样它就不会从头开始重新发布。以下代码显示了如何做到这一点：生产者生产者 = 环境。生产者建造者 () 。流（“重复数据删除流”）。 name (&quot;app-1&quot;) // 为生产者提供一个名字。 ConfirmTimeout ( Duration . ZERO ) // 永不停止重试。建造 （）;长开始=生产者。 getLastPublishingId () + 1 ; // 获取最后的发布 ID 并添加 1 int messageCount = 20 ;记录（ start ， messageCount ）。 forEach ( record -&gt; { Message message = producer .messageBuilder ().publishId ( record . id ()) // 设置发布ID . addData ( record . content ( ). getBytes ( StandardCharsets . UTF_8 )) .build();生产者.发送(消息,confirmationStatus-&gt;闩锁.countDown());}); ./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$PublishSmartDedupSecondDay&#39;Connecting...Connected.Starting at 10Publishing Publishing 10 message with deduplication enabled.Messages确认？是 所以发布者从 10（9，第一次运行的最后一个发布 ID，+1）开始，发布 10（20，总共，- 10 个已经发布）新消息。我们可以检查流的内容：./ mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$Consume&#39;Connecting...Connected.Starting消耗，按回车退出...message 0message 1message 2...message 9message 10message 11message 12...消息 19\n我们在流中获得了预期的消息数量，但这次使用了优化的发布应用程序。需要生成应用程序的名称和发布 ID 才能启用重复数据删除 发布 ID 是一个严格递增的序列，它通常是给定消息的标识符（例如数据库记录的主键、文件中的行）应用程序应该查询他们用来从中断处重新启动的最后一个发布 ID 的代理", "note_en": "July 28, 2021 RabbitMQ Streams Overview introduced streams, a new feature in RabbitMQ 3.9 and  RabbitMQ Streams First Application provided an overview of the programming model with the stream Java client. This post covers how to deduplicate published messages in RabbitMQ Streams.\n As deduplication is a critical and intricate concept, the post will walk you through this mechanism step by step, from a naive and somewhat broken publishing application to an optimized and reliable implementation.\n  It is quite easy for an application to publish the same message several times: the application is restarted in the wrong way and re-publishes all the data from the beginning, a network glitch makes the application reconnect and re-send a couple of messages, etc.\n Even though consuming applications should make their processing idempotent, duplicated published messages should be avoided as much as possible, as they can slow down processing and use extra space.\n This post will start from a simple application that generates lots of duplicate messages (to help grasp the problem) and will improve it little by little to get a robust solution at the end.\n  The publishing program mimics an application that reads records from a data source and publish a message for each a of these records:\n Producer  producer  =  environment . producerBuilder ()  . stream ( &#34;deduplication-stream&#34; )  . build (); int  messageCount  =  10 ; records ( 0 ,  messageCount ). forEach ( record  -&gt;  {  Message  message  =  producer . messageBuilder ()  . addData ( record . content (). getBytes ( StandardCharsets . UTF_8 ))  . build ();  producer . send ( message ,  confirmationStatus  -&gt;  latch . countDown ()); });\n We suppose the application reads  all the records available, and that number is 10 for the first run.In case you want a reminder on the stream Java client API, you can read  RabbitMQ Streams First Application.\n If you want to run the code as you are reading, you can move on to the next section.Note you can follow the remaining of the post without running anything, so you can skip the next section if you don’t want to try out the code.\n  Running the samples requires Docker, Git, and Java 8 or higher installed.You can start the broker with the following command:\n docker run -it --rm --name rabbitmq -p 5552:5552  \\  -e  RABBITMQ_SERVER_ADDITIONAL_ERL_ARGS = &#39;-rabbitmq_stream advertised_host localhost&#39;  \\  rabbitmq:3.9\n   The  code is hosted on GitHub.Here is how to clone the repository and create the stream used in the samples:\n      With this first run, the application read all the records from the data source (that is 10 records overall for this run) and send a message for each of them.We can check the content of the stream with the following command:\n ./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$Consume&#39; Connecting...Connected.Starting consuming, press Enter to exit...message  0message  1message  2message  3message  4message  5message  6message  7message  8message  9\n So far, so good, we published 10 messages and we can see 10 messages in the stream.Let’s now if our application is viable and keeps working correctly for a second run.\n  We can imagine now that we run the application on the next day and the data source contains 10 additional records, so 20 records overall.Our publishing application is dumb: it will read everything from the data source and publishing messages.Let’s try:\n   ./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$Consume&#39;Connecting...Connected.Starting consuming, press Enter to exit...message  0message  1message  2...message  9message  0message  1message  2...message  9message  10message  11...message  19\n We see 30 messages: the 10 from the first run and the 20 from the second run.The first 10 appears twice, so our stream contains duplicate.With the way we implemented the application this is expected, but we have to fix this, because we just want to the new records to be published on the second run.\n     The  stream Java client documentation provides more details about the producer name and the publishing ID.Note message deduplication is not specific to the stream Java client, it can be implemented by any client as long as it complies to the semantics.\n We just have to pick a name for our publishing application and keep this name along the different runs.For the publishing ID, we can use the ID of a record: it happens to be unique and the records are returned sorted by ID (e.g. just like records from a database with a numeric primary key and the appropriate query).\n  Producer  producer  =  environment . producerBuilder ()  . stream ( &#34;deduplication-stream&#34; )  . name ( &#34;app-1&#34; )  // provide a name for the producer   . confirmTimeout ( Duration . ZERO )  // to never stop retrying   . build (); int  messageCount  =  10 ; records ( 0 ,  messageCount ). forEach ( record  -&gt;  {  Message  message  =  producer . messageBuilder ()  . publishingId ( record . id ())  // set the publishing ID   . addData ( record . content (). getBytes ( StandardCharsets . UTF_8 ))  . build ();  producer . send ( message ,  confirmationStatus  -&gt;  latch . countDown ()); });\n The broker will keep track of the last publishing ID for this producer.We’ll see how this allows to deduplicate messages.\n   ./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$CreateEmptyStream&#39;Connection...Connected. Trying to delete stream  if it exists.Stream deleted.Creating  &#39;deduplication-stream&#39; stream.Stream created.\n     We run now our application on the second day, with the extra 10 records.Our application is less dumb that the first time: it uses the producer name and the publishing ID for deduplication. But it still reads  all the records from the data source:\n   ./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$Consume&#39;Connecting...Connected.Starting consuming, press Enter to exit...message  0message  1message  2...message  9message  10message  11message  12...message  19\n No duplicates this time, nice!Even though we re-published the first 10 messages, the broker managed to filter them out.It knew that it should ignore all the messages with a publishing ID lesser than 9 (the last value in the first run).Note even though it filtered out these duplicates, it nevertheless confirmed them to the client.\n This is much better that our first application where we ended up with duplicates, but there’s still a problem: the application re-sends  all the messages every time.If the data keeps growing, the application will take more and more time for each run.Fortunately it is possible to find out where the application left off in the last run.\n  We’ll see in this section how to make the publishing application even smarter by using not only deduplication but also querying the broker to for the last publishing ID it sent.\n   ./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$CreateEmptyStream&#39;Connection...Connected. Trying to delete stream  if it exists.Stream deleted.Creating  &#39;deduplication-stream&#39; stream.Stream created.\n   This version of the application is not the smartest, but it is enough for “the first day”.\n  The publishing application needs to do better for the second day, where the data source contains now 20 messages.It can use the  Producer#getLastPublishingId method which queries the broker for the last publishing ID of this producer for this stream.The application can add 1 to this value and it will get its starting point.Then it just has to select the records from this point until the last record available.This way it does not re-publish from the beginning.The following code shows how to do this:\n Producer  producer  =  environment . producerBuilder ()  . stream ( &#34;deduplication-stream&#34; )  . name ( &#34;app-1&#34; )  // provide a name for the producer   . confirmTimeout ( Duration . ZERO )  // to never stop retrying   . build (); long  start  =  producer . getLastPublishingId ()  +  1 ;  // get last publishing ID and add 1  int  messageCount  =  20 ; records ( start ,  messageCount ). forEach ( record  -&gt;  {  Message  message  =  producer . messageBuilder ()  . publishingId ( record . id ())  // set the publishing ID   . addData ( record . content (). getBytes ( StandardCharsets . UTF_8 ))  . build ();  producer . send ( message ,  confirmationStatus  -&gt;  latch . countDown ()); });\n  ./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$PublishSmartDedupSecondDay&#39;Connecting...Connected.Starting publishing at  10Publishing  10 message with deduplication enabled.Messages confirmed? yes\n So the publisher starts at 10 (9, the last publishing ID of the first run, + 1) and publishes the 10 (20, total, - 10 already published) new messages.We can check the content of the stream:\n ./mvnw -q compile exec:java -Dexec.mainClass = &#39;com.rabbitmq.stream.Deduplication$Consume&#39;Connecting...Connected.Starting consuming, press Enter to exit...message  0message  1message  2...message  9message  10message  11message  12...message  19\n We get the expected number of messages in the stream, but this time with an optimized publishing application.\n   a name for the producing application and a publishing ID are required to enable deduplication\n  the publishing ID is a strictly increasing sequence, it is usually the identifier of a given message (e.g. primary key for a database record, line in a file)\n applications should query the broker for the last publishing ID they used to restart where they left off", "posttime": "2021-07-31 00:32:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rabbitmq,deduplication,应用程序", "title": "使用 RabbitMQ Streams 进行消息重复数据删除", "title_en": "Message Deduplication with RabbitMQ Streams", "transed": 1, "url": "https://blog.rabbitmq.com/posts/2021/07/rabbitmq-streams-message-deduplication", "via": "", "real_tags": ["rabbitmq", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "9b8b58e0b917c91f742b130acf7be14c.jpg", "infoid": 1070672, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航 跳转到搜索 Paige Compositor 是 James W. Paige (1842–1917) 于 1872 年至 1888 年间开发的一项发明。它旨在用机械臂代替铅字组合印刷表格的人工排字机。 [1] [2] 在 1890 年代初期，一群发明家与芝加哥的 Towner K. Webster 签订了生产 3000 台合成器的合同。 [3] 然而，这台机器并不像它应有的那样精确，并且由于其复杂性和基于反复试验的不断调整需要而从未盈利。 [4] [5] 结果，以热金属排版工艺组成的Linotype排版机成为新流行的排版机。 [6] Paige 排版机以著名作家马克吐温为失败的努力所做的大量投资而著称：300,000 美元（今天为 6,000,000 美元）。吐温是一名前印刷商，他不仅投资了他的大部分书籍利润，而且还投资了他妻子奥利维亚·克莱门斯 (Olivia Clemens) 的大部分遗产。 [5] 许多人指出，他对佩奇排字机和其他发明的过度投资不仅是他家庭经济衰退的原因，也是他机智和幽默感下降的原因。 [7] 韦伯斯特制造公司生产的机器不到六台，每台成本为 15,000 美元，是最初估计产量的三倍多。一个是康奈尔大学在二战期间捐赠的废金属驱动器。唯一幸存的机器在康涅狄格州哈特福德的马克吐温故居展出。 [8] ^ Lienhard, 约翰 (2000)。 “佩奇合成器”。我们的独创性引擎。休斯顿：休斯顿大学（1372）。 ISBN 978-0-19-516731-3。 2000 年 4 月 21 日原始存档。替代 URL ^ Lienhard, John (1988)。 “佩奇合成器”。我们的独创性引擎。休斯顿：休斯顿大学（0050）。 ISBN 978-0-19-513583-1。 ^ ab 柯克，康妮·安。马克吐温，传记。康涅狄格：格林伍德印刷，2004 年。PS1331.K57。 ^ “我们的收藏”。马克吐温故居和博物馆。 2013 年 7 月 27 日从原件存档。", "note_en": "Jump to navigation  Jump to search  The  Paige Compositor was an invention developed by  James W. Paige (1842–1917) between 1872 and 1888. It was designed to replace the human  typesetter of a lead type-composed printing  form with a  mechanical arm.  [1]  [2] In the early 1890s, a group of inventors signed a contract with  Towner K. Webster in Chicago to produce 3000 compositors.  [3] However, the machine was not nearly as precise as it should have been and never turned a profit because of its complexity and continual need for adjustment based upon trial and error.  [4]  [5] As a result, it was the  Linotype typesetting machine, which composed in a  hot metal typesetting process, that became the new popular typesetting machine.  [6]\n The Paige typesetting machine is notable for substantial investment that the prominent writer  Mark Twain made into the failed endeavor: $300,000 ($6,000,000 today). Twain, a former printer, invested not only the bulk of his book profits but also a large portion of the inheritance of  Olivia Clemens, his wife.  [5] Many point to his over-investment in the Paige typesetting machine and other inventions as the cause of not only his family&#39;s financial decline but also the decline of his wit and humor.  [7]\n Webster Manufacturing made fewer than six machines costing $15,000 apiece, over three times as much as the initial production estimates. One was donated by  Cornell University for a  scrap metal drive during  World War II. The only surviving machine is displayed at the  Mark Twain House in  Hartford, Connecticut.  [8]\n  ^    Lienhard, John (2000).  &#34;The Paige Compositor&#34;.  Engines of Our Ingenuity. Houston:  University of Houston (1372).  ISBN   978-0-19-516731-3. Archived from  the original on April 21, 2000.   Alt URL\n  ^    Lienhard, John (1988).   &#34;The Paige Compositor&#34;.  Engines of Our Ingenuity. Houston:  University of Houston (0050).  ISBN   978-0-19-513583-1.\n ^     a     b   Kirk, Connie Ann. Mark Twain, a Biography. Connecticut: Greenwood Printing, 2004. PS1331.K57.\n   ^     &#34;Our Collection&#34;. Mark Twain House and Museum. Archived from  the original on 27 July 2013 .", "posttime": "2021-07-31 00:31:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "作曲家,paige,排版", "title": "佩奇作曲家", "title_en": "Paige Compositor", "transed": 1, "url": "https://en.wikipedia.org/wiki/Paige_Compositor", "via": "", "real_tags": ["作曲家", "paige", "排版"]}, {"category": "", "categoryclass": "", "imagename": "91487c4273ea68427e762b5021cf6a25.jpeg", "infoid": 1070671, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2015 年，Apple 引入了一个新概念——面向协议的编程。我鼓励您观看整个 50 分钟的 WWDC 视频。会议的一位演讲者阐述了所有令人敬畏的 Swift 新功能以及协议如何帮助编写更好、更健壮的代码。我敢肯定，您正在使用这些技巧中的大部分，甚至全部。是不是很棒？当然是，但 Swift 引入了一些限制。例如，你不能 swizzle Swift 方法。你可以用@objc 方法来做到这一点。测试框架，如 OCMock，使用此功能动态更改方法实现（当然，简单来说）。但是 Swift 类和它们的方法呢？嗯...您可以“生成”模拟作为 Xcode 中的构建步骤，我认为这不是一个完美的解决方案。行。您正在使用 UserDefaults 编写一些功能。也许是一个简单的保存用户关于黑暗主题偏好的决定。 class PreferenceSaver { var useDarkTheme: Bool { get { UserDefaults.standard.bool(forKey: &quot;useDarkTheme&quot;) } set { UserDefaults.standard.set(newValue, forKey: &quot;useDarkTheme&quot;) } }} 到目前为止，这将在生产，但是...如果需求发生变化怎么办？也许标准用户默认设置不够好？对于一个属性，更改没有问题，但是如果有 20 个首选项... 伙计，这是一个巨大的拉取请求。我将重构它以使其更有用:) class PreferenceSaver { private let defaults: UserDefaults init(defaults: UserDefaults = .standard) { self.defaults = defaults } var useDarkTheme: Bool { get { defaults.bool(forKey: &quot; useDarkTheme&quot;) } set { defaults.set(newValue, forKey: &quot;useDarkTheme&quot;) } }} 没有太大变化，但一切都改变了。现在 PreferenceSaver 有一个新的依赖项，可以在 init 中注入。此外，我添加了一个默认值 - 因此代码库中没有任何更改以适应新的初始化。\n我们已经完成了一半。现在进行单元测试。要注入 UserDefaults 模拟，您必须继承并推动整个 Apple 类！这是压倒性的和麻烦的。 Defaults 类很简单，那么定位服务、Store Kit 类呢？它们庞大而复杂。 protocol UserDefaultsProtocol { func bool(forKey: String) -&gt; Bool func set(_ value: Bool, forKey: String)}extension UserDefaults: UserDefaultsProtocol { }class PreferenceSaver { private let defaults: UserDefaultsProtocol init(defaults: UserDefaultsProtocol = UserDefaults.standard) { self.defaults = defaults } var useDarkTheme: Bool { get { defaults.bool(forKey: &quot;useDarkTheme&quot;) } set { defaults.set(newValue, forKey: &quot;useDarkTheme&quot;) } }} 再一次，我的改变没有完全影响当前代码库，因此使用 PreferenceSaver 不会更改文件。通过添加协议和扩展 UserDefaults，我们拥有原始实现的所有功能，并增加了可测试性！ class PreferenceSaverMock: UserDefaultsProtocol { var dictionary = [String: Any]() func bool(forKey: String) -&gt; Bool { return dictionary[forKey] as! Bool } func set(_ value: Bool, forKey: String) { dictionary[forKey] = value }} 现在断言一切，如果键存在，如果值正确。我们完全摆脱了 Apple 及其实施的束缚。使用 UserDefaultsProtocol 时，没有任何需求变化是可怕的。核心数据？没问题，保存到 plist？简单易行，最后，代码可以 100% 覆盖，没有任何麻烦。快乐编码和测试！", "note_en": "In 2015, Apple introduced a new concept -  Protocol Oriented Programming. I encourage you to watch the whole 50 minutes of the WWDC video. One of the conference&#39;s speekers laid down all new awesome Swift features and how protocols can help write a better, robust code.\n I&#39;m sure, you are using most of these tricks, maybe all. Isn&#39;t it great? Of course it is, but Swift introduced some restrictions. For instance, you can&#39;t  swizzle Swift method. You can do it with  @objc methods. Test frameworks, like  OCMock, use this feature to dynamically change method implementation (in simple words, of course). But what about Swift classes and their methods? Well... You can &#34;generate&#34; mocks as a build step in Xcode, I don&#39;t think this is a perfect solution.\n  OK. You are writing some feature utilising  UserDefaults. Maybe a simple saving user decision regarding dark theme preference.\n class PreferenceSaver { var useDarkTheme: Bool { get { UserDefaults.standard.bool(forKey: &#34;useDarkTheme&#34;) } set { UserDefaults.standard.set(newValue, forKey: &#34;useDarkTheme&#34;) } }}\n So far, this would work perfectly in production, but... What if requirements change? Maybe standard user defaults are not good enough? For one property, change is not problematic, but if there is 20 preferences... Man, that is a huge pull request. I&#39;ll refactor this to make it more usable:)\n class PreferenceSaver { private let defaults: UserDefaults init(defaults: UserDefaults = .standard) { self.defaults = defaults } var useDarkTheme: Bool { get { defaults.bool(forKey: &#34;useDarkTheme&#34;) } set { defaults.set(newValue, forKey: &#34;useDarkTheme&#34;) } }}\n Not much has changed, but everything&#39;s changed. Now  PreferenceSaver has a new dependency, injectable in  init. Furthermore, I added a default value - so no changes in codebase to accomodate new initialisation.\n We are half way done. Now unit tests. To inject  UserDefaults mock, you have to inherit and impelent a whole Apple class! It&#39;s overwhelming and cumbersome. Defaults class is quite simple, what about location services, Store Kit classes? They are huge and complicated.\n  protocol UserDefaultsProtocol { func bool(forKey: String) -&gt; Bool func set(_ value: Bool, forKey: String)}extension UserDefaults: UserDefaultsProtocol { }class PreferenceSaver { private let defaults: UserDefaultsProtocol init(defaults: UserDefaultsProtocol = UserDefaults.standard) { self.defaults = defaults } var useDarkTheme: Bool { get { defaults.bool(forKey: &#34;useDarkTheme&#34;) } set { defaults.set(newValue, forKey: &#34;useDarkTheme&#34;) } }}\n Once again, my change doesn&#39;t affect current codebase at all, so no changes in files using  PreferenceSaver. By adding protocol and extending  UserDefaults, we have all functionalities of the original implementation with a HUGE addition, testability!\n  class PreferenceSaverMock: UserDefaultsProtocol { var dictionary = [String: Any]() func bool(forKey: String) -&gt; Bool { return dictionary[forKey] as! Bool } func set(_ value: Bool, forKey: String) { dictionary[forKey] = value }}\n Now assert everything, if the key is present, if the value is proper. We are completly untangled from Apple and their implementation. When using  UserDefaultsProtocol, no requirements changes are scary. Core Data? No problem, saving to  plist? Easy peasy, and at the end, code can be covered in 100% without any hassle. Happy coding and testing!", "posttime": "2021-07-31 00:31:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "programming,编程,面向,protocol,userdefaults", "title": "Swift 面向协议的编程和测试", "title_en": "Swift Protocol Oriented Programming and Testing", "transed": 1, "url": "https://arturgruchala.com/protocol-oriented-programming-unit-testing/", "via": "", "real_tags": ["编程", "面向", "protocol"]}, {"category": "", "categoryclass": "", "imagename": "8760d8064c62475943885eaf6a3273f1.png", "infoid": 1070670, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Inter 是一种为电脑屏幕精心制作和设计的字体。 Inter 具有高 x 高度以帮助提高大小写混合文本的可读性。还提供了几个 OpenType 功能，例如根据周围字形的形状调整标点符号的上下文替代，当您需要从“o”中消除“0”、表格数字等时的斜线零。 使用 Inter 就像下载一样简单&amp; 安装字体文件。如果您正在制作 Web 内容，则可以使用以下 CSS 或从 Google Fonts 获取。 @import url(&#39;https://rsms.me/inter/inter.css&#39;);html { font-family: &#39;Inter&#39;, sans-serif; }@supports (font-variation-settings: normal) { html { font-family: &#39;Inter var&#39;, sans-serif;用排版表达自己当然没有绝对的对或错，但 Inter Dynamic Metrics 提供了良好排版的指南。您只需提供光学字体大小，就会为您计算跟踪和行距，以产生最佳结果。 Inter 是一个免费的开源字体系列。您几乎可以以任何可以想象的方式自由使用这种字体。有关条件和限制的详细信息，请参阅 SIL Open Font License 1.1。 Inter 提供传统的恒定字体文件（每个样式一个，例如粗斜体、中号等）以及包含所有样式的可变字体，文件大小要小得多。此外，可变字体是……可变的！您可以随意混合和匹配粗细和斜体角度，形成理论上的无限变化。可变字体是一种新兴技术。此测试可用于发现 Web 浏览器的功能。\nInter 具有许多 OpenType 功能，可用于根据您的特定需求定制功能和美感。这些特征中的一些可以组合以形成大量替代变体。此功能通常默认启用，并导致某些字符根据周围环境自行调整或替换。禁用 启用 3 x9 3x9 12 :34, FE —X 12:34, FE—X 4 .2 4.2 (SEMI)PERMANENT (SEMI)PERMANENT (SEMI)PERMANENT SFO → STO SFO → STO IIA ⟶ OGG IIA ⟶ OGG ARN ⟺ OGG OGG ARN @N [电子邮件保护] [电子邮件保护] [电子邮件保护]微笑微笑:-) :-)禁用启用1234567890 1234567890 1131711 1131711 0040900 0040900 11：31711 11：31711 00：40.900 00：40.900 0.45，0.91，0.08 0.45， 0.91, +0.08 1.00, 9.44, -0.13 1.00, 9.44, -0.13 0.00, 1.13, ~7.12 0.00, 1.13, ~7.12 此功能是上下文敏感的，会将“单词”的正斜杠转换为正确的数字分隔符此功能是动态的，并允许任何分数。请注意，用于分数的数字是为其小尺寸定制的，甚至与稍大的上标和下标数字分开制作。禁用 启用 1/3 3/4 1/5 1/3 3/4 1/5 18/29 16/5 18/29 16/5 1337/591038 1337/591038 禁用 启用 (Hello ) [World ] {9000 } (你好）[世界] {9000} SCHOOL @ RUN SCHOOL @ RUN 3 + 9 = 12 * 1 3 + 9 = 12 * 1 *+÷±×=≠≈•~&lt;&gt;≤≥ *+÷±×=≠≈ •~&lt;&gt;≤≥ → ← ⟶ ⟵ − - – — : → ← ⟶ ⟵ − - – — : Disabled Enabled Figure A ⃝ Figure A⃝ Figure # ⃞ Figure #⃞ Figure 3 ⃝ Figure 3⃝ Figure 3 ⃞ Figure 3⃞ 这意味着例如封闭的字形无处不在，而不仅仅是在具有正确组合字符逻辑的应用程序中。禁用启用¡¿什么？！什么？！什么 ！？什么！？ Disabled Enabled Hello 0123 Hello 0123 Disabled Enabled Hello 0123 Hello 0123 Disabled Enabled X 0123 (+)-[=] X0123 (+)-[=] X abcdefghijklmnopqrstuvwxyz Xabcdefghijklmnopqrstuvwxyz Xabcdefghijklmnopqrstuvwxyz Xabcdefghijklmnopqrstuvwxyz Xabcdefghijklmnopqrstuvwxyz Xabcdefghijklmnopqrstuvwxyz (H) 0123 Hello 0123 Disabled Enabled X 0123 (+)-[=] [=] X abcdefghijklmnopqrstuvwxyz Xabcdefghijklmnopqrstuvwxyz 另一种数字样式。请注意，可以使用 cvXX 功能精心挑选单个数字样式。禁用启用12 345 678 90 1234567890 3469 3469禁用启用WP 0ACO9XS I1 012O9 WP0ACO9XSI1012O9 Illega升非法βetaßeta商海ßβetaßeta业务禁用启用萨RA萨拉我RD IRD周一鱼子门罗禁用启用ö0123 O0123功能禁用启用CV01 1 1 CV02 4 4 CV03 6 6 CV04 9 9 CV05 L LƚɫɬL L L L L L L L L LƚɫɬL L L L L L L L cv06řɽɍɼR R RȑȓR R R R Rɽ ɍɼR R RȑȓR R R R cv07 SS SS CV08 I I IƗI I I I I I I I IǏȈȊI IΙΊΪἸἹἺI I IƗI I I I I I I I IǏȈȊI IΙΊΪἸἹἺcv09 3 3 CV10ģǤƓG G G GǧǵG GǤƓG G G GǧǵģCV11 A A A A A A A AǎA A A A A Aȁäǟ大约的ǡA AȃA A A AǺA A A A A A A A A AǎA A A A A Aȁäǟ大约的ǡA AȃA A A AǺA A其他功能，上面没有突出显示：locl、salt、aalt、cpsp 和 ordn。您可以在交互式实验室中探索功能。 Inter 于 2016 年底开始作为一项实验，以构建特定小尺寸 (11px) 的完美像素匹配字体。其想法是通过以特定方式制作字体，使用特定坐标系（每 EM 单位），对于特定的目标光栅化大小 (11)，有可能获得最佳的清晰度和可读性。\n然而，在使用早期版本的 Inter 几个月后，每个接受测试的人都意识到这种方法在现实世界中存在一些严重的问题。最值得注意的是，阅读更长的文本真的很困难。由于这种方法的像素对齐特性，字体采用了几乎等宽的外观，这使得阅读数字、标点符号和非常短的单词非常容易，但阅读更长的内容会让人眼睛疲劳。该项目以不同的方法重新启动，坚持使用特定的 UPM，但制作字形和字距的方式使节奏的更多变化和更平滑的垂直和水平词干。随着 Inter 的开发，它在 Figma 的内部版本上进行了测试——Inter 的作者是设计师——并根据经验和反馈慢慢改进。在 Web 浏览器中，您需要使用 font-feature-settings。在 Figma 中，您可以通过高级类型面板访问功能。在 Illustrator、Photoshop 和朋友中，您可以通过 Characters 和 OpenType 面板访问功能。 Sketch 不提供用于配置字体功能的 UI，但有一种使用 macOS 的原生字体 UI 的解决方法。 “提示”文件夹中的字体文件中包含辅助 ClearType、Microsoft Windows（和某些 Linux 发行版）使用的文本光栅化器的附加数据。这些“暗示”字体的不同外观。此外，提示数据会使字体文件更大，因此如果您在网站上使用 Inter，这些文件的额外大小是另一个需要考虑的因素。这篇文章更详细地解释了暗示。 rsms.me/inter 在 CloudFlare 的 CDN 上全球分布，由 GitHub 的服务器支持，使得 https://rsms.me/inter/inter.css 和相关字体文件在全球范围内的使用非常可靠和快速。是的你可以！ Inter 是一个开源项目，这意味着用于构建字体文件的源代码（或“源设计”，如果您愿意的话）可以免费使用以进行改进。字体制作需要相当多的技术工作，并且取决于您想要做什么，根据您的技术技能，有些事情可能会更有趣。 “贡献”文档是一个很好的起点。该文档概述了您可以在哪些方面产生最大影响、如何设置以及如何开始。看看 pyftsubset 和 glyphhanger。看看 pyftfeatfreeze 这是一个工具，它允许您构建具有“默认”打开的某些 OpenType 功能的字体文件。 Inter 是在 2016 年 11 月开始在私有内部 git 存储库中开发的，之后于 2017 年 8 月 22 日发布。在 2016 年 11 月至 2017 年 8 月期间，对 247 个版本进行了 2 990 150 行编辑。通过 Twitter (@rsms) 或通过电子邮件联系", "note_en": "Inter is a typeface carefully crafted &amp; designed for computer screens.      Inter features a tall x-height to aid in readability of mixed-case and lower-case text. Several OpenType features are provided as well, like contextual alternates that adjusts punctuation depending on the shape of surrounding glyphs, slashed zero for when you need to disambiguate &#34;0&#34; from &#34;o&#34;, tabular numbers, etc.\n                                                 Using Inter is as easy as  downloading &amp; installing the font files. If you&#39;re making a web thing, you can use the following CSS or get it from  Google Fonts.\n  @import url(&#39;https://rsms.me/inter/inter.css&#39;);html { font-family: &#39;Inter&#39;, sans-serif; }@supports (font-variation-settings: normal) { html { font-family: &#39;Inter var&#39;, sans-serif; }}\n              There&#39;s of course no absolute right or wrong when it comes to expressing yourself with typography, but Inter  Dynamic Metrics provides guidelines for good typography. You simply provide the optical font size, and the tracking and leading is calculated for you to produce the best results.\n              Inter is a  free and open source font family.  You are free to use this font in almost any way imaginable.  Refer to the  SIL Open Font License 1.1 for exact details on what the conditions and restrictions are.\n  Inter is offered as both traditional constant font files (one per style, e.g. Bold Italic, Medium, etc.) as well as a  Variable Font which contains all styles in a much smaller file size. Additionally, a variable font is ...variable! You can mix and match weight and italic angle as you please, forming theoretically infinite variations.\n  Variable fonts is a new and emerging technology.   This test can be used to discover what a web browser is capable of.\n Inter comes with many OpenType features that can be used to tailor functionality and aesthetics to your specific needs. Some of these features can be combined to form a great number of alternative variations.\n        This feature is usually enabled by default and causes certain characters to adjust themselves or be replaced depending on the surrounding context.\n    Disabled  Enabled  3 x9  3x9  12 :34, FE —X  12:34, FE—X  4 .2  4.2   (SEMI )PERMANENT  (SEMI)PERMANENT  SFO  → STO  SFO → STO  IIA  ⟶ OGG  IIA ⟶ OGG  ARN  ⟺ OGG  ARN ⟺ OGG  M @N  [email protected]   [email protected]  [email protected]  Smile  :-)  Smile :-)               Disabled  Enabled  1234567890  1234567890  1131711    1131711   0040900    0040900   11:31,711    11:31,711   00:40.900    00:40.900   0.45, 0.91, +0.08    0.45, 0.91, +0.08   1.00, 9.44, −0.13    1.00, 9.44, −0.13   0.00, 1.13, ~7.12    0.00, 1.13, ~7.12            This feature is contextually sensitive and will convert &#34;words&#34; of numbers separated by forward slash into proper fractions. This feature is dynamic and allows for any fractions. Note that the digits used for fractions are custom-made for their small size, and are even made separately from the slightly larger Superscript and Subscript numbers.\n    Disabled  Enabled  1/3  3/4  1/5  1/3  3/4  1/5  18/29  16/5  18/29  16/5  1337/591038  1337/591038               Disabled  Enabled   (Hello )  [World ]  {9000 }  (Hello) [World] {9000}  SCHOOL  @ RUN  SCHOOL @ RUN  3  + 9  = 12  * 1  3 + 9 = 12 * 1   *+÷±×=≠≈•~&lt;&gt;≤≥  *+÷±×=≠≈•~&lt;&gt;≤≥   →  ←  ⟶  ⟵  −  -  –  —  :  → ← ⟶ ⟵ − - – — :               Disabled  Enabled  Figure A ⃝  Figure A⃝  Figure # ⃞  Figure #⃞  Figure 3 ⃝  Figure 3⃝  Figure 3 ⃞  Figure 3⃞      This means that for instance enclosed glyphs works everywhere, not just in apps with correct combining character logic.\n           Disabled  Enabled   ¡¿What ?!  ¡¿What?!   ¿¡What !?  ¿¡What!?             Disabled  Enabled  Hello  0123  Hello 0123             Disabled  Enabled  Hello  0123  Hello 0123             Disabled  Enabled  X 0123 (+)-[=]  X0123 (+)-[=]  X abcdefghijklmnopqrstuvwxyz  Xabcdefghijklmnopqrstuvwxyz             Disabled  Enabled  H 0123 (+)-[=]  H0123 (+)-[=]  X abcdefghijklmnopqrstuvwxyz  Xabcdefghijklmnopqrstuvwxyz           An alternate style of digits. Note that individual digit styles can be cherry-picked using the cvXX features.\n    Disabled  Enabled  12 345 678 90  1234567890   3469  3469               Disabled  Enabled  WP 0ACO9XS I1 012O9  WP0ACO9XSI1012O9   Illega l  Illegal  βeta  ßeta Busine ß  βeta ßeta Busineß               Disabled  Enabled  Sa ra  Sara  i rd  ird  Mon roe  Monroe             Disabled  Enabled  O 0123  O0123               Feature  Disabled  Enabled  cv01  1  1  cv02  4  4  cv03  6  6  cv04  9  9  cv05  l ł ƚ ɫ ɬ ŀ ĺ ļ ľ ḷ ḹ ḻ ḽ  l ł ƚ ɫ ɬ ŀ ĺ ļ ľ ḷ ḹ ḻ ḽ  cv06  r ɽ ɍ ɼ ŕ ŗ ř ȑ ȓ ṙ ṛ ṝ ṟ  r ɽ ɍ ɼ ŕ ŗ ř ȑ ȓ ṙ ṛ ṝ ṟ  cv07  ß  ß  cv08  I Ï Ḯ Ɨ Ḭ Ì Í Î Ĩ Ī Ĭ Į İ Ǐ Ȉ Ȋ Ỉ Ị Ι Ί Ϊ Ἰ Ἱ Ἲ  I Ï Ḯ Ɨ Ḭ Ì Í Î Ĩ Ī Ĭ Į İ Ǐ Ȉ Ȋ Ỉ Ị Ι Ί Ϊ Ἰ Ἱ Ἲ  cv09  3  3  cv10  G Ǥ Ɠ Ĝ Ğ Ġ Ģ Ǧ Ǵ Ḡ  G Ǥ Ɠ Ĝ Ğ Ġ Ģ Ǧ Ǵ Ḡ  cv11  a á ă ắ ặ ằ ẳ ẵ ǎ â ấ ậ ầ ẩ ẫ ȁ ä ǟ ȧ ạ ǡ à ả ȃ ā ą ẚ å ǻ ḁ ã  a á ă ắ ặ ằ ẳ ẵ ǎ â ấ ậ ầ ẩ ẫ ȁ ä ǟ ȧ ạ ǡ à ả ȃ ā ą ẚ å ǻ ḁ ã        Additional features, not highlighted above:  locl,  salt,  aalt,  cpsp and  ordn.   You can explore features in the  interactive lab.\n    Inter started out in late 2016 as an experiment to build a perfectly pixel-fitting font at a specific small size (11px.) The idea was that by crafting a font in a particular way, with a particular coordinate system (Units Per EM), and for a particular target rasterization size (11), it would be possible to get the best of both sharpness and readability.\n  However after a few months of using an early version of Inter, it dawned on everyone exposed to the test that this approach had some serious real-world problems. Most notably that it was really hard to read longer text. Because of the pixel-aligning nature of that approach, the font took an almost  mono-spaced appearance, making it really easy to read numbers, punctuation and very short words, but eye-straining to read anything longer.\n  The project was rebooted with a different approach, sticking with the specific UPM, but crafting glyphs and kerning in a way that made for more variation in the rhythm and smoother vertical and horizontal stems. As Inter was being developed, it was tested on an internal version of  Figma—where the author of Inter works as a designer—and slowly improved upon based on experience and feedback.\n           In web browsers you&#39;ll want to use   font-feature-settings. In Figma you can access features via the  Advanced Type panel. In Illustrator, Photoshop and friends, you can access features via the  Characters and OpenType panels. Sketch doesn&#39;t provide a UI for configuring font features, but there&#39;s  a workaround using macOS&#39;s native font UI.      The font files in the &#34;hinted&#34; folders have additional data in them for assisting  ClearType, the text rasterizer used by Microsoft Windows (and some Linux distributions.) You want to use the &#34;hinted&#34; fonts only if you are targeting Windows users  and prefer the different look of these &#34;hinted&#34; fonts. Additionally, hinting data makes the font files larger, so if you are using Inter on websites, the extra size of these files is another consideration to make.   This article explains hinting at a greater length.       rsms.me/inter is distributed globally over CloudFlare&#39;s CDN, backed by GitHub&#39;s servers, making usage of  https://rsms.me/inter/inter.css and associated font files very reliable and fast throughout the world.      Yes you can! Inter is an open-source project, meaning the source code—or &#34;source design&#34; if you will—that is used to build the font files  are freely available to improve upon. Font making requires a fair bit of technical work and depending on what you&#39;d like to do, some things might be more fun depending on your technical skills. The  &#34;Contributing&#34; document is a great place to start. The document outlines where you can have the biggest impact, how things are setup and how to get started.       Have a look at   pyftsubset and   glyphhanger.      Have a look at   pyftfeatfreeze which is a tool that allows you to build font files with certain OpenType features turned on &#34;by default&#34;.      Inter was developed in a private, internal git repository starting in November 2016, prior to being published on August 22, 2017. Between November 2016 and August 2017, there were  2 990 150 line edits made across 247 versions.      Reach out on  Twitter (@rsms) or over  email", "posttime": "2021-07-31 00:31:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,字体,界面设计,beautiful", "title": "Inter – 一个漂亮的界面设计字体系列", "title_en": "Inter – a beautiful font-family for Interface Designs", "transed": 1, "url": "https://rsms.me/inter/", "via": "", "real_tags": ["设计", "字体", "界面设计", "beautiful"]}, {"category": "", "categoryclass": "", "imagename": "8880e729bb90c6975bd2c574c6f02a93.jpg", "infoid": 1070669, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Google 正在向 Android 用户发送电子邮件，告知他们从 9 月下旬开始，他们将无法再在运行 Android 2.3.7 (Gingerbread) 及更低版本的设备上登录其 Google 帐户。 “作为我们为确保用户安全而不断努力的一部分，从 2021 年 9 月 27 日起，谷歌将不再允许在运行 Android 2.3.7 或更低版本的 Android 设备上登录，”Android 帮助社区经理 Zak Pollack 解释说。 “如果您在 9 月 27 日之后登录您的设备，当您尝试使用 Gmail、YouTube 和地图等 Google 产品和服务时，您可能会收到用户名或密码错误。”一旦 Google 不再支持登录运行 2010 年 12 月之前发布的 Android 版本的设备的帐户，您将开始收到用户名或密码错误，并且将无法再进行以下操作：重新登录 建议用户尽快将其设备更新到更新的 Android 版本（3.0 或更高版本），以免他们无法访问 Google 的应用程序和服务。无法更新到较新 Android 版本的用户可以尝试使用网络浏览器登录他们的 Google 帐户，这将为他们提供在不受支持的 Android 设备上使用 Google 服务的替代方法。\n如果您有一台 Android 设备并且不知道它运行的是哪个版本，您可以通过以下步骤找到： 如果您已经收到系统更新可用于 Android 2.3.7 或更低版本的设备的通知，需要点击通知开始系统升级过程。在您已经关闭更新警报或在没有互联网连接的情况下运行的设备上，您必须按照以下程序更新到 Android 3.0 或更高版本：正如今年 Google I/ 的 Google 产品管理副总裁 Sameer Samat 所详述在一年一度的开发者大会上，Android 操作系统现在为全球超过 30 亿台设备提供支持。当前稳定的Android版本是Android 11，去年发布，2020年9月8日。", "note_en": "Google is emailing Android users to let them know that, starting late September, they will no longer be able to log in to their Google accounts on devices running Android 2.3.7 (Gingerbread) and lower.\n &#34;As part of our ongoing efforts to keep our users safe, Google will no longer allow sign-in on Android devices that run Android 2.3.7 or lower starting September 27, 2021,&#34; Android Help Community Manager Zak Pollack  explained.\n &#34;If you sign into your device after September 27, you may get username or password errors when you try to use Google products and services like Gmail, YouTube, and Maps.&#34;\n Once Google drops support for logging into accounts devices running Android versions released before December 2010, you will start receiving username or password errors and will no longer be able to:\n Change your Google Account password, which signs you out on all devices, and try to sign in again\n Users are advised to update their devices to newer Android versions (3.0 or later) as soon as possible so that they won&#39;t lose access to Google&#39;s apps and services.\n Those who cannot update to newer Android versions can try logging into their Google accounts using a web browser which will provide them with an alternative way to use Google services on unsupported Android devices.\n   If you have an Android device and you don&#39;t know what version it&#39;s running, you can find out by going through the following steps:\n  If you were already notified that a system update is available on Android 2.3.7 or lower devices, you only need to tap the notification the begin the system upgrade process.\n On devices where you&#39;ve already dismissed the update alert or that ran without an Internet connection, you will have to follow this procedure to update to Android 3.0 or later:\n  As detailed by Google&#39;s VP of product management Sameer Samat at this year&#39;s  Google I/O annual developer conference, the Android OS now powers more than 3 billion devices worldwide.\n The current stable Android version is  Android 11, released last year, on September 8, 2020.", "posttime": "2021-07-31 00:30:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,android,google,设备,block", "title": "谷歌将从 9 月开始阻止旧 Android 设备的登录", "title_en": "Google to block logins on old Android devices starting September", "transed": 1, "url": "https://www.bleepingcomputer.com/news/google/google-to-block-logins-on-old-android-devices-starting-september/", "via": "", "real_tags": ["谷歌", "android", "google", "设备", "block"]}, {"category": "", "categoryclass": "", "imagename": "e7eb0f46c66d43b825522bf68b3f83d3.jpg", "infoid": 1070668, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "科技公司曾经玩过的最大把戏之一就是让他们的人类豚鼠用户相信他们是一个被称为 beta 测试人员的特权群体。从新颖的电子邮件软件到 Twitter 的替代版本，再到支持语音的收听设备，此类试用既便宜又易于提供给成千上万的客户。这是查看新版本与旧版本对比的好方法。除了一些烦人的故障或不熟悉的图标外，软件 beta 测试通常是无害的。大多数应用程序的赌注远低于生死。但特斯拉亿万富翁 CEO 埃隆·马斯克 (Elon Musk) 进行的 Beta 测试并非无伤大雅。他将美国的街道变成了该公司所谓的自动驾驶汽车技术的公共实验室。特斯拉表示，其命名不准确的完全自动驾驶和自动驾驶模式旨在帮助驾驶员并使特斯拉更安全——但自动驾驶一直是一系列不稳定驾驶事件的中心。在公开场合，马斯克有时会在社交媒体和其他声明中夸大这些技术。然而，特斯拉工程师私下向加州监管机构承认，他们还没有为黄金时段做好准备。特斯拉的自动驾驶模式使用软件、传感器和摄像头来检测道路上的车道、物体和其他车辆，并且可以在驾驶员输入最少的情况下转向、制动、加速甚至改变车道。完全自动驾驶测试版第 9 版——今天只有几千特斯拉车主可以使用——应该有助于在当地街道上进行更复杂的驾驶。\n马斯克先生向他的电动汽车的买家保证，他们将拥有“完全自动驾驶、软件和一切”，但这些汽车并不是完全自动驾驶，也没有像真正的自动驾驶仪那样的东西。这种实验技术，在普通司机的手中，已经造成了多起火爆的撞车事故，并且可能还有其他致命的缺陷，比如无法区分月亮和黄色交通灯。自 2016 年以来，所有新特斯拉都安装了自动驾驶仪，其功能必须由驾驶员激活。该技术是多项诉讼的主题，包括虚假广告指控。马斯克本月在推特上写道：“Beta 9 解决了大多数已知问题，但也会有未知问题，所以请多疑。在特斯拉，安全始终是重中之重。”安全可能是工厂的重中之重，但在公共道路上，不仅特斯拉司机对车辆安全有既得利益。在特斯拉本周的季度财报电话会议上，马斯克似乎承认全自动驾驶仍处于半生不熟的状态。当被问及特斯拉向更广泛的司机发布这项技术时需要支付 199 美元的月费时，他谈到这项技术时说：“我们需要让全自动驾驶工作成为一项引人注目的价值主张。特斯拉司机可能会成为临床药物试验中一种被称为治疗性误解的受害者，在这种误解中，试验参与者（在本例中为 Beta 测试人员）往往会忽视参与实验的潜在风险，错误地将自己视为某种药物的消费者。成品而不是豚鼠。对于自动驾驶汽车，特斯拉车主并不是唯一的试验参与者。 《消费者报告》对使用自动化系统的特斯拉汽车的安全性提出了严重警告。 《消费者报告》的一位官员说，完全自动驾驶的视频“没有显示出一种使驾驶更安全甚至压力更小的系统”。 “消费者只是花钱请测试工程师来开发没有足够安全保护的技术。”这很简单：汽车对行人、骑自行车的人和其他司机构成危险。更令人震惊的是，互联网上充斥着特斯拉司机阅读书籍、查看电子邮件、离开驾驶座或在方向盘后面打盹的视频。换句话说，当电脑在方向盘后面时，特斯拉似乎对司机和路上的其他人构成了风险。美国国家运输安全委员会批评自动驾驶仪缺乏防止驾驶员误用的适当方法和有效的驾驶员监控系统。这应该让所有美国人都担心他们的公共街道是一个试验场。\n通用汽车公司的 Cruise 和 Alphabet 的 Waymo 等竞争对手采取了更加谨慎的方法，在汽车在现实世界环境中进行测试时，让带薪员工开车作为安全检查。至少他们对正在发生的事情没有误解。与特斯拉不同的是，这些车辆在路上很容易被识别为原型，让其他汽车的司机有机会避开。当工程师说自主系统还没有准备好时，监管机构应该倾听。直到今年，美国国家公路交通安全管理局才开始要求跟踪和每月定期报告涉及自动驾驶汽车的碰撞事故，这可能是朝着更多监管迈出的一步。该机构还在对大约三打涉及使用驾驶员辅助系统的车辆的车祸进行调查。其中绝大多数涉及特斯拉，包括 10 人死亡。自动驾驶汽车在改善交通安全方面有着巨大的潜力。人类在驾驶方面出奇地糟糕。自动驾驶汽车不会酒后驾车，总有一天它们可能比人眼看得更清楚，对路上其他汽车的突然移动做出更快的反应，并降低长途卡车运输的成本等好处。但目前还没有这项技术。在它准备好之前将其投入使用不仅会危及生命，而且会在技术准备好后迅速让公众接受该技术。如果特斯拉想用人类豚鼠进行 beta 测试，它应该在封闭的轨道上进行。我们都会感到更安全。 《泰晤士报》致力于向编辑发表各种信函。我们想听听您对此或我们任何文章的看法。这里有一些提示。这是我们的电子邮件：letters@nytimes.com。", "note_en": "One of the greatest tricks technology companies ever played was convincing their human guinea pig users that they were a privileged group called beta testers.\n From novel email software to alternative versions of Twitter to voice-enabled listening devices, such trials are cheap and easy to make available to thousands or millions of customers. It’s a great way to see how a new version stacks up against the old.\n Other than some annoying glitches or unfamiliar icons, software beta testing is generally innocuous. The stakes for most apps are far below life and death.\n But there’s nothing innocuous about the beta tests being run by Elon Musk, the billionaire C.E.O. of Tesla. He has turned American streets into a public laboratory for the company’s supposed self-driving car technology.\n Tesla says that its inaccurately named full self-driving and autopilot modes are meant to assist drivers and make Teslas safer — but autopilot has been at the center of a series of erratic driving incidents.\n In public, Mr. Musk sometimes overhypes these technologies on social media and in other statements. Yet Tesla engineers have privately admitted to California regulators that they are  not quite ready for prime time.\n Tesla’s autopilot mode uses software, sensors and cameras to detect lanes, objects and other vehicles on the road and can steer, brake, accelerate and even change lanes with minimal input from the driver. Full self-driving beta version 9 — available today to just a few thousand Tesla owners — is supposed to assist with more complicated driving on local streets.\n Mr. Musk has assured buyers of his electric vehicles that they would have “full self-driving, software, everything,” yet the autos are not fully self-driving, nor do they have anything like a real autopilot.\n This kind of experimental technology, in the hands of regular drivers, has  caused multiple fiery crashes and may have other fatal flaws, like an  inability to distinguish the moon from a yellow traffic light. Autopilot, features of which must be activated by the driver, has come installed in all new Teslas since 2016. The technology is the subject of multiple lawsuits, including allegations of  false advertising.\n Mr. Musk tweeted this month, “Beta 9 addresses most known issues, but there will be unknown issues, so please be paranoid. Safety is always top priority at Tesla.” Safety may be a top priority at the factory, but out on the public roads, it’s not only Tesla drivers who have a vested interest in the safety of the vehicles.\n On Tesla’s quarterly earnings call this week, Mr. Musk appeared to  acknowledge that full self-driving is still half-baked. “We need to make full self-driving work in order for it to be a compelling value proposition,” he said of the technology, when asked about the $199 monthly fee to access it when Tesla releases it to a wider swath of drivers.\n Tesla drivers may fall victim to a version of what’s known in clinical drug trials as therapeutic misconception, in which trial participants (beta testers, in this case) tend to overlook the potential risks of participating in an experiment, mistakenly regarding themselves as consumers of a finished product rather than as guinea pigs. And with self-driving cars, Tesla owners aren’t the only trial participants.\n Consumer Reports has  raised serious alarms about the safety of Tesla vehicles using the automated systems. Videos of full self-driving in action “don’t show a system that makes driving safer or even less stressful,” said a Consumer Reports official. “Consumers are simply paying to be test engineers for developing technology without adequate safety protection.” This is simple: The cars are a hazard to pedestrians, cyclists and other drivers. Which makes it all the more alarming that the internet is full of videos of  Tesla drivers reading books, checking email, leaving the driver’s seat or  snoozing behind the wheel.\n In other words, Teslas appear to be a risk to drivers and others on the road when a computer is behind the wheel. The National Transportation Safety Board has  criticized autopilot for lacking proper means to prevent driver misuse and effective driver monitoring systems. That should have all Americans concerned that their public streets are  a testing ground.\n Competitors like General Motors Co.’s Cruise and Alphabet’s Waymo have taken a more measured approach, putting  paid employees behind the wheel as a safety check while the cars are tested in real-world environments. At least they have no misconceptions about what’s going on. Unlike Teslas, those vehicles are easily identifiable as prototypes on the road, giving drivers of other cars a chance to steer clear.\n When engineers say the autonomous systems aren’t yet ready, regulators should listen. Only this year did the National Highway Traffic Safety Administration begin requiring  tracking and regular monthly reporting of crashes involving autonomous vehicles, perhaps a step toward more regulation. The agency has also ongoing investigations into about three dozen crashes involving vehicles using driver-assistance systems. The vast majority of those involved Teslas, including 10 fatalities.\n Self-driving vehicles hold tremendous promise to improve traffic safety. Humans are surprisingly bad at driving. Autonomous vehicles don’t drink and drive, and one day they may be able to see better than the human eye, to respond more quickly to sudden movements from other cars on the road and to lower costs for long-haul trucking operations, among other benefits. But the technology isn’t there yet.\n Putting it on the road before it is ready risks not only lives now but also swift public acceptance of the technology down the road when it is ready. If Tesla wants to run beta tests with human guinea pigs, it should do so on a closed track. We’d all feel safer.\n  The Times is committed to publishing   a diversity of letters  to the editor. We’d like to hear what you think about this or any of our articles. Here are some   tips . And here’s our email:   letters@nytimes.com .", "posttime": "2021-07-31 00:27:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,变成,turned,驾驶", "title": "特斯拉把街道变成了实验室。猜猜接下来发生了什么", "title_en": "Tesla Turned the Streets into a Lab. Guess What Happened Next", "transed": 1, "url": "https://www.nytimes.com/2021/07/30/opinion/self-driving-cars-tesla-elon-musk.html", "via": "", "real_tags": ["特斯拉", "变成", "turned", "驾驶"]}, {"category": "", "categoryclass": "", "imagename": "a7554c8c34861439fa3fe871fffa7656.jpg", "infoid": 1070667, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "福特的 F 系列皮卡一直是美国最畅销的汽车，似乎永远是最畅销的汽车，所以可能有一种强大的诱惑力，不要把已经运行良好的东西搞砸了。但时代在变，皮卡车也必须如此。福特在去年春天以全电动 2022 F-150 Lightning 的形式展示了它的新想法，但对于那些想要绿色（呃）但不愿意放弃燃烧碳氢化合物的人来说，还有另一个新选择：F-150 PowerBoost 混合动力车。虽然混合动力车不是游戏规则的改变者，但它提供了更好的行驶里程，并且能够将其用作 7.2 kW 发电机——即使在车辆行驶时也是如此。让我们从我们测试过的 F-150 4x4 SuperCrew Lariat 的引擎盖下开始。在那里，您会发现福特 3.5 升双涡轮增压 EcoBoost V6 发动机，这是 F-150 阵容中的六个选项之一。它是卡车可用的最强大和扭矩最大的动力系统，可提供 430 马力（320 千瓦）和 530 磅-英尺（718 牛米）的扭矩。福特将 V6 发动机与位于发动机和 10 速自动变速箱之间的 47 马力（35 千瓦）电动机相结合，并由 1.5 千瓦时锂离子电池供电。虽然这对于一辆大型皮卡来说似乎很小，但它表明了福特在这里的战略：将电子与碳氢化合物配对，以适度增加里程和更大的性能提升。随着电动机与发动机协同工作——福特称之为“3.5 升 PowerBoost 全混合动力 V6”的组合——最大马力和扭矩都跃升了 17% 左右，达到 430 马力（321 千瓦）和 570 磅英尺（773 牛米） ， 分别。这些数字使 F-150 混合动力车在纯动力和扭矩方面处于福特皮卡系列的顶端。 F-150 混合动力车是关于动力的。除了马力和扭矩之外，这辆卡车真的想成为您的个人发电站。虽然混合动力车不是唯一可以充当发电机的 F-150，但它是唯一一款在床上提供 240 V、30 A 插座的机型。 （床上还有四个 120 V、20 A 的插座，驾驶室还有几个。）这是一个完整的 7.2 kW 发电机，可以在装满一罐汽油的情况下运行长达 32 小时。由于能够在运动时以发电机模式运行，您可以在前往作业现场的途中为工具充电。你也会从油泵的混合动力中看到一些好处，但不会那么多。 EPA 对混合动力车的评级为 25 英里/加仑（9.41 升/100 公里），在城市和高速公路上行驶。这比 F-150 系列的其他车型要好，后者大部分在城市中的 19-22 mpg 范围内（3.0 L V6 的额定值为 20 mpg [11.76 L/100 km]），27 mpg（8.71 L/ 100 公里）在高速公路上，23 英里/加仑（10.23 升/100 公里），但它是 F-150 阵容中最弱的发电厂。我们无法接近这些数字。我们在一周的驾驶中平均每加仑 21.4 英里（10.99 升/100 公里），其中包括前往伊利诺伊州中部的公路旅行。无论我们是在 57 号州际公路上行驶还是在芝加哥郊区跑腿，里程数都非常一致。配备 30.6 加仑（115.8 升）的油箱，预计每次加油之间可行驶 600 多英里（965 公里）。 F-150 混合动力车的最大有效载荷为 7,350 磅（3,340 公斤），比福特 F-150 系列的最大有效载荷少 500 磅（227 公斤）。牵引能力从 16,700 磅（7,575 千克）到 18,400 磅（8,346 千克）不等，具体取决于轴比和是否启用四轮驱动。带有 5.5 英尺（1,676 毫米）床的混合动力车的货箱容积为 52.8 立方英尺；还提供 6.5 英尺（1,981 毫米）的床。 F-150 在路上几乎没有什么惊喜。在一天结束的时候，你会在一个框架上的盒子里开车，所以你会得到典型的皮卡车之旅。我唯一真正的烦恼是 10 速模块化混合动力变速器。自适应 10 速驱动循环有时会在升档和降档时跳过档位，当 F-150 直接从一档转到三档时，偶尔会导致轻微的晃动。踩油门越轻，跳跃越明显。在较低的速度下，发动机将关闭，您可以在电动马达上巡航一两英里。在燃气和电力推进之间移动几乎是察觉不到的，当您将卡车停放在停车场时，发动机会关闭。另一项观察结果是：我们的测试车辆配备了 Co-Pilot360，福特的全套驾驶员辅助技术。在过去的几年里，我越来越欣赏这项技术，因为它可以让长时间的高速公路驾驶不那么疲劳。然而，正如在 F-150 中实施的那样，该技术可以使用更多的修饰。虽然走走停停的自适应巡航控制在交通繁忙的情况下工作得很好，但车道保持辅助系统比我驾驶的其他类似装备的汽车更频繁地失去对道路标记的跟踪。福特的车道居中功能有时让我觉得它仍在学习学习许可证。\n说到花里胡哨，福特知道客户想要什么，而且不会让人失望。尾门上印有一把尺子（英制和公制），尾门上有两个夹孔。尾门侧面的系紧夹板兼作开瓶器，可满足您的所有尾随需求。如果你要爬进爬出床，你可以滑出一个台阶和把手。电源插座位于左侧尾门内。宽敞舒适的驾驶室设计精美，标准的 10 向可调和完全可倾斜电动座椅让您轻松找到完美的驾驶（或小睡）位置。福特在仪表板中间提供了一个可选的 12 英寸横向显示屏（8 英寸是标准配置）。它运行 Sync 4，这是对 Sync 3 的重大改进，并且支持 CarPlay 和 Android Auto。当您在狭窄的空间中导航时，显示屏真的很亮：左侧三分之二显示备用摄像头，而右侧则有一个 380° 的头顶视图，带有显示车轮方向和行驶方向的指南。气候控制旋钮和开关位于显示屏下方。按下变速杆旁边的按钮，它会向下折叠到控制台中，这样您就可以展开一个足够大的内部工作台面，可以放置笔记本电脑、剪贴板，甚至是两人的烛光晚餐。仪表板已全数字化，可定制的 12 英寸显示屏可提供有关您驾驶风格的反馈，以最大限度地提高油耗。年度销售数据清楚地表明美国人对大型车辆的持续痴迷，在性能、舒适性和功能方面，福特通过重新设计的 F-150 为人们提供了他们想要的东西。人们需要的是更多的电气化和更少的化石燃料消耗。 F-150 PowerBoost 混合动力车是朝着正确方向迈出的一步，福特将这款车定位为追求性能的最佳选择。虽然 EPA 的 25 mpg 评级本身可能看起来并不那么令人印象深刻，但它比其他阵容高出 25%。 F-150 4X4 SuperCrew Lariat 起价为 50,980 美元，我们测试的卡车的建议零售价为 70,960 美元。这比您为纯​​汽油动力支付的费用要多，但对于那些迫不及待地等待 F-150 Lightning 或尚未准备好体验完整 BEV 的新卡车的人来说，这是一个现实的选择。", "note_en": "Ford’s F-series pickup trucks have been the best-selling vehicles in the United States for what seems like forever, so there&#39;s probably a powerful temptation not to mess with something that has worked so well. But the times, they are a-changin’, and so must pickup trucks.\n  Ford revealed its new ideas in the form of the  all-electric 2022 F-150 Lightning this past spring, but there’s another new option for those who want to go green(er) but aren’t willing to give up burning hydrocarbons to get around: the F-150 PowerBoost hybrid. While the hybrid is not a game-changer, it offers better mileage and the ability to use it as a 7.2 kW generator—even while the vehicle is in motion. Let&#39;s start under the hood of the F-150 4x4 SuperCrew Lariat we tested. There, you&#39;ll find a Ford 3.5 L, twin-turbo EcoBoost V6 engine, one of the six options in the F-150 lineup. It&#39;s the most powerful and torquey powertrain available for the truck, with 430 hp (320 kW) and 530 lb-ft (718 Nm) on tap. Ford has combined the V6 with a 47 hp (35kW) electric motor that lives between the engine and the 10-speed automatic transmission, and it is powered by a 1.5 kWh li-ion battery. While that may seem small for a massive pickup truck, it&#39;s indicative of Ford&#39;s strategy here: pairing electrons with hydrocarbons for a modest increase in mileage and a bigger increase in performance. With the electric motor working in tandem with the engine—a combo Ford dubs the &#34;3.5 L PowerBoost Fully Hybrid V6&#34;—max horsepower and torque both jump around 17 percent to 430 hp (321 kW) and 570 lb-ft (773 Nm), respectively. Those numbers put the F-150 hybrid at the top of Ford&#39;s pickup range when it comes to pure power and torque.\n The F-150 hybrid is all about power. Beyond horsepower and torque, this truck really wants to be your personal power station. While the hybrid is not the only F-150 that can act as a generator, it&#39;s the only one that offers a 240 V, 30 A outlet in the bed. (There are four more 120 V, 20 A outlets in the bed and a couple more in the cab.) It&#39;s a full 7.2 kW generator that can run for up to 32 hours on a full tank of gas. And with the ability to run in generator mode while in motion, you can charge your tools on the way to the job site.\n    You&#39;ll see some benefit from the hybrid at the gas pump, too, but not as much. The EPA rates the hybrid at 25 mpg (9.41 L/100 km) combined across city and highway driving. That&#39;s better than the rest of the F-150 lineup, which is mostly in the 19-22 mpg range in the city (the 3.0 L V6 is rated for 20 mpg [11.76 L/100 km]), 27 mpg (8.71 L/100 km) on the highway, and 23 mpg (10.23 L/100 km) overall, but it&#39;s the wimpiest power plant in the F-150 lineup. We weren&#39;t able to get close to those numbers. We averaged 21.4 mpg (10.99 L/100 km) in a week of driving that included a road trip to central Illinois. Whether we were tooling down Interstate 57 or running errands in suburban Chicago, mileage was remarkably consistent. With its 30.6-gallon (115.8 L) gas tank, expect to travel well over 600 miles (965 km) between refueling.\n Maximum payload for the F-150 hybrid is 7,350 lb (3,340 kg), which is 500 lb (227 kg) shy of the max in Ford&#39;s F-150 lineup. Towing capacity ranges from 16,700 lb (7,575 kg) up to 18,400 lb (8,346 kg), depending on axle ratio and whether four-wheel drive is engaged. Cargo box volume in the hybrid with its 5.5-foot (1,676 mm) bed comes in at 52.8 cubic feet; a 6.5-foot (1,981 mm) bed is also available.\n There are few surprises on the road with the F-150. At the end of the day, you&#39;re driving around in a box on a frame, so you&#39;re going to get the typical pickup truck ride. My only real niggle is with the 10-speed modular hybrid transmission. The adaptive 10-speed drive cycle sometimes skips gears when upshifting and downshifting, occasionally resulting in a slight lurching when the F-150 went directly from first gear to third. The lighter the touch on the accelerator, the more pronounced the jump. At lower speeds, the engine will shut off, and you can cruise a mile or two on the electric motor. Moving between gas and electric propulsion is all but imperceptible, and the engine shuts off when you put the truck in park.\n One other observation from behind the wheel: our test vehicle was equipped with Co-Pilot360, Ford&#39;s full suite of driver-assist tech. I&#39;ve grown to appreciate this tech over the past couple of years, as it makes long stretches of highway driving less fatiguing. As implemented in the F-150, though, the tech could use more polish. While the stop-and-go adaptive cruise control worked like a charm in heavy traffic, the lane-keep assist lost track of the road markings much more frequently than other, similarly equipped cars I&#39;ve driven. And Ford&#39;s Lane Centering feature sometimes made me feel like it was still working on its learner&#39;s permit.\n      When it comes to bells and whistles, Ford knows what its customers want, and it doesn&#39;t disappoint. The tailgate has a ruler (imperial and metric) imprinted on it, and there are two clamp holes along the tailgate. The tie-down cleats on the side of the tailgate double as bottle openers for all of your tailgating needs. And if you&#39;re going to be climbing in and out of the bed, you can slide out a step and handhold. Power outlets are located just inside the tailgate on the left side.\n The spacious and comfortable cab is fantastically designed, and the standard, 10-way adjustable and fully reclinable power seats make finding the perfect driving (or napping) position a snap.\n Ford offers an optional 12-inch landscape display in the middle of the dash (8 inches is standard). It runs Sync 4, a major improvement over Sync 3, and it supports CarPlay and Android Auto. The display really shines when you&#39;re navigating tight spaces: the left two-thirds shows the backup camera, while the right has an overhead, 380° view with guidelines showing wheel orientation and direction of travel. Climate control knobs and switches live below the display. Press the button next to the shift lever and it will fold down into the console so you can unfold an interior work surface big enough for a laptop, clipboard, or even a candlelit dinner for two.\n The instrument panel has gone all-digital, with the customizable 12-inch display providing feedback on your driving style to maximize gas mileage.\n Annual sales figures clearly show the ongoing American obsession with large vehicles, and when it comes to performance, comfort, and features, Ford has given the people what they want with the redesigned F-150. What the people  need is more electrification and less fossil fuel consumption. The F-150 PowerBoost hybrid is a step in the right direction, and Ford has positioned the vehicle as the best choice for the performance-obsessed.\n While the EPA&#39;s 25 mpg rating may not look that impressive by itself, it&#39;s up to 25 percent better than the rest of the lineup. The F-150 4X4 SuperCrew Lariat starts at $50,980, and the MSRP of the truck we tested is $70,960. That&#39;s more than you&#39;ll pay for pure petrol power, but it&#39;s a realistic option for those in need of a new truck who either can&#39;t wait for the F-150 Lightning or aren&#39;t ready for the full BEV experience.", "posttime": "2021-07-30 23:48:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "福特,美国,卡车,favorite", "title": "美国最受欢迎的卡车混合动力：福特 F-150，评论", "title_en": "America’s favorite truck goes hybrid: The Ford F-150, reviewed", "transed": 1, "url": "https://arstechnica.com/cars/2021/07/americas-favorite-truck-goes-hybrid-the-ford-f-150-reviewed/", "via": "", "real_tags": ["福特", "美国", "卡车", "favorite"]}, {"category": "", "categoryclass": "", "imagename": "56275b02ad1370c8e2e9d7b347a4d058.jpeg", "infoid": 1070666, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对马萨诸塞州大约 900 人的 COVID-19 集群（其中 74% 接种了疫苗）的分析是促使疾病控制与预防中心在本周改变口罩方向的惊人数据之一。根据华盛顿邮报首次获得的 CDC 内部文件，马萨诸塞州普罗温斯敦集群的数据显示，接种疫苗的人的鼻子和喉咙中携带的 delta 冠状病毒含量高得惊人。更重要的是，发现接种疫苗的人正在将危险的病毒变种传播给其他接种疫苗的人。在全国范围内，疾病预防控制中心估计，在 1.62 亿完全接种疫苗的美国人中，每周有 35,000 例有症状的突破性感染。 CDC 文件总体上强调，delta 具有极强的传染性——比以前版本的病毒、普通感冒甚至季节性流感的传染性都要强。 CDC文件称，Delta更符合水痘的传染性。文件写道，美国官员应该承认，随着三角洲统治该国，“战争已经改变”。与《华盛顿邮报》交谈的官员说，文件所包含的分析和紧迫性促使 CDC 在本周早些时候撤销其掩蔽指南。 CDC 现在建议无论疫苗接种情况如何，在学校、在 COVID-19 传播“高”或“大量”传播的地区，或者在与弱势人群（例如未接种疫苗的儿童或免疫功能低下的人）接触时，都建议进行室内掩蔽。但该文件与他人共享CDC 口罩更新两天后的邮报更进一步说：“鉴于更高的传播率和当前的疫苗覆盖率，通用口罩对于减少 delta 变体的传播至关重要。”该文件还重点介绍了 CDC 现在必须使用的针头其不受欢迎的健康信息——强调每个人都需要接种疫苗，同时也承认突破性感染的风险可能并不那么罕见，并且即使在接种疫苗后也需要继续采取缓解措施。尽管有关 delta 的数据令人担忧，但疫苗已经仍然被证明对严重疾病、住院和死亡非常有效。它们仍然是结束健康危机的最有力工具并恢复某些版本的常态。但显然有一些警告，CDC 尚未公开发布它必须支持的关于 delta 的新警报的数据。今年 5 月，CDC 官员突然告诉人们，一旦他们完全接种了疫苗，他们就可以在大多数环境中撕掉口罩，即使是在拥挤的室内环境中也是如此。围绕这一变化的言论强调了疫苗的有效性，并暗示该指南是作为疫苗接种的激励措施而制定的——免于戴口罩作为获得疫苗的奖励。许多健康专家批评此举的突然性，以及它不是分阶段或分阶段进行的，例如与传播水平或疫苗接种率有关。一些人还指出，如果没有发布和收回健康措施的明确指标，如果出现改变游戏规则的因素（例如 delta），就很难重新使用掩码。", "note_en": "An analysis of a COVID-19 cluster of around 900 people in Massachusetts— 74 percent of whom are vaccinated—is among the alarming data that spurred the Centers for Disease Control and Prevention to  reverse course on masks this week.\n According to an internal CDC document  first obtained by the Washington Post, data on the Provincetown, Massachusetts, cluster showed that vaccinated people carried surprisingly high levels of the delta coronavirus in their noses and throats. More importantly, vaccinated people were found to be spreading the dangerous virus variant to other vaccinated people. Nationwide, the CDC estimated that there are 35,000 symptomatic breakthrough infections per week among 162 million fully vaccinated Americans.\n The CDC document overall highlights that delta is extremely contagious—much more so than previous versions of the virus, as well as the common cold or even the seasonal flu. Delta is more in line with the contagiousness of chickenpox, the CDC document said.\n US officials should acknowledge that with delta dominating the country, &#34;the war has changed,&#34; the document read. Officials who spoke with the Post say that the analyses and the urgency the document contains are what prompted the CDC to reverse its masking guidance earlier this week. The CDC now recommends indoor masking, regardless of vaccination status, in schools, in areas with &#34;high&#34; or substantial&#34; COVID-19 transmission, or when there&#39;s contact with vulnerable people, such as unvaccinated children or immunocompromised people.\n    But the document shared with the Post two days after the CDC mask update goes further, saying, &#34;Given higher transmissibility and current vaccine coverage, universal masking is essential to reduce transmission of the delta variant.&#34;\n The document also focused on the needle that the CDC must now thread with its unpopular health messaging—emphasizing the critical need for everyone to be vaccinated, while also acknowledging the perhaps not-so-rare risk of breakthrough infections and the need to keep up mitigation efforts even after vaccination. Despite the concerning data on delta, vaccines have still proven to be highly effective against severe disease, hospitalization, and death. They remain the most powerful tool to end the health crisis and reclaim some version of normality. But there are clearly caveats, and the CDC has yet to publicly release the data it has to back up its new alarm over delta.\n In May, CDC officials abruptly told people that once they were fully vaccinated, they could rip off their masks in most settings, even in crowded, indoor ones. The rhetoric around the change highlighted the effectiveness of vaccines and suggested the guidance was crafted as  an incentive for vaccination—dangling freedom from masks as a reward for getting your shots. Many health experts were  critical of the abruptness of the move and the fact that it wasn&#39;t carried out in stages or phases, linked to transmission levels or vaccination rates, for instance. Some also noted that, without clear metrics for issuing and retracting health measures, it would be difficult to go back on masking if a game changer—such as delta—arose.", "posttime": "2021-07-30 23:48:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "cdc,delta,疫苗", "title": "马萨诸塞州这个 900 人的三角洲集群让 CDC 吓坏了——74% 的人接种了疫苗", "title_en": "This 900-person delta cluster in Mass. has CDC freaked out—74% are vaccinated", "transed": 1, "url": "https://arstechnica.com/science/2021/07/this-900-person-delta-cluster-in-mass-has-cdc-freaked-out-74-are-vaccinated/", "via": "", "real_tags": ["cdc", "delta", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "7042f5ee00e26016348c312f0801b5a3.jpg", "infoid": 1070665, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "路透社 7 月 30 日 - 亚马逊 (AMZN.O) 因违反欧盟 GDPR 规则处理个人数据而被欧盟处以创纪录的 8.866 亿美元（7.46 亿欧元）罚款，因为隐私监管机构采取了更加激进的措施执法立场。该公司周五在一份监管​​文件中披露，卢森堡国家数据保护委员会 (CNPD) 在 7 月 16 日的决定中对亚马逊处以罚款。 ( https://bit.ly/2TLIZQ8 ) 据公司发言人称，亚马逊将对罚款提出上诉。这家电子商务巨头在文件中表示，它认为 CNPD 的决定毫无根据。欧盟的通用数据保护条例或 GDPR 要求公司在使用其个人数据之前征得人们的同意，否则将面临巨额罚款。在全球范围内，在一系列关于隐私和错误信息的丑闻以及一些企业抱怨他们滥用市场力量之后，对科技巨头的监管审查一直在加强。 Alphabet 旗下的谷歌 (GOOGL.O)、Facebook Inc (FB.O)、苹果公司 (AAPL.O) 和微软公司 (MSFT.O) 在欧洲受到了更严格的审查。阅读更多 12 月，法国的数据隐私监管机构向 Google 开出了有史以来最大的一笔 1 亿欧元（1.1882 亿美元）的罚款，因为 Google 违反了该国关于在线广告跟踪器的规定。\n班加罗尔的 Chavi Mehta 和布鲁塞尔的 Foo Yun Chee 报道；由 Aditya Soni、Shailesh Kuber 和 Shounak Dasgupta 编辑", "note_en": "July 30 (Reuters) - Amazon.com Inc  (AMZN.O) has been hit with a record $886.6 million (746 million euros) European Union fine for processing personal data in violation of the bloc&#39;s GDPR rules, as privacy regulators take a more aggressive position on enforcement.\n The Luxembourg National Commission for Data Protection (CNPD) imposed the fine on Amazon in a July 16 decision, the company disclosed in a regulatory filing on Friday. ( https://bit.ly/2TLIZQ8)\n Amazon will appeal the fine, according to a company spokesperson. The e-commerce giant said in the filing it believed CNPD&#39;s decision was without merit.\n   EU&#39;s General Data Protection Regulation, or GDPR, requires companies to seek people&#39;s consent before using their personal data or face steep fines.\n Globally, regulatory scrutiny of tech giants has been increasing following a string of scandals over privacy and misinformation, as well as complaints from some businesses that they abuse their market power.\n Alphabet&#39;s Google  (GOOGL.O), Facebook Inc  (FB.O), Apple Inc  (AAPL.O) and Microsoft Corp  (MSFT.O) have drawn heightened scrutiny in Europe.   read more\n In December, France&#39;s data privacy watchdog handed out its biggest ever fine of 100 million euros ($118.82 million) to Google for breaching the nation&#39;s rules on online advertising trackers.\n  Reporting by Chavi Mehta in Bengaluru and Foo Yun Chee in Brussels; Editing by Aditya Soni, Shailesh Kuber and Shounak Dasgupta", "posttime": "2021-07-30 23:48:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,欧盟,eu", "title": "亚马逊被欧盟罚款 8.86 亿美元", "title_en": "Amazon hit with $886 million EU data privacy fine", "transed": 1, "url": "https://www.reuters.com/business/retail-consumer/amazon-hit-with-886-million-eu-data-privacy-fine-2021-07-30/", "via": "", "real_tags": ["amazon", "亚马逊", "欧盟", "eu"]}, {"category": "", "categoryclass": "", "imagename": "1f77fc92bf48e97b62e91a14a05c55db.png", "infoid": 1070662, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在线零售商通常必须使用多种不同的工具或聘请昂贵的开发人员来创建内部运输解决方案。 Outvio 为任何规模的在线商店提供购买后运输体验，旨在复制亚马逊风格的体验，客户也可以退货。其中，它与 ShippyPro 竞争，后者在意大利运行，迄今已筹集了 500 万美元。 Outvio 的联合创始人兼首席执行官 Juan Borras 表示：“我们可以为任何在线商店提供提供卓越售后客户体验所需的所有工具。我们可以在他们的履行过程中的不同点进行集成，对于大型商家来说，仅他们就可以节省数十万的开发成本。”他补充说：“购买后发生的事情比大多数商店意识到的更重要。超过 88% 的消费者表示，零售商主动沟通每个履行和交付阶段对他们来说非常重要。不这样做，尤其是在出现问题时，通常会导致失去该客户。我们的使命是帮助在线商店简化售后流程，借助出色的售后体验来推动回头客和品牌忠诚客户。”主要投资者 Change Ventures 的投资合伙人 Rait Ojasaar 评论道：“虽然在线零售还有很长的路要走，但消费者对交货时间和标准的期望正在增加。对于越来越多地寻找具有类似消费者用户体验的更高级解决方案的在线商店运营商来说，情况也是如此。 Outvio 团队确切地了解市场差距是什么，并在找到适合其现代履行 SaaS 平台的产品市场方面做了大量工作。”", "note_en": "Online retailers usually have to use a number of different tools or hire expensive developers to create in-house shipping solutions. Outvio offers online stores of any size a post-purchase shipping experience, which seeks to replicate an Amazon-style experience where customers can also return packages. Among others, itcompetes with  ShippyPro, which runs out of Italy and has raised $5 million to date.\n Juan Borras, co-founder and CEO of Outvio said: “We can give any online store all the tools needed to offer a superior post-sale customer experience. We can integrate at different points in their fulfilment process, and for large merchants, save them hundreds of thousands in development costs alone.”\n  He added: “What happens after the purchase is more important than most shops realize. More than 88% of consumers say it is very important for them that retailers proactively communicate every fulfilment and delivery stage. Not doing so, especially if there are problems, often results in losing that client. Our mission is to help online stores streamline everything that happens after the sale, fueling repeat business and brand-loyal customers with the help of a fantastic post-purchase experience.”\n Rait Ojasaar, Investment Partner at lead investor Change Ventures commented: “While online retailing has a long way to go, the expectations of consumers are increasing when it comes to delivery time and standards. The same can be said about the online shop operators who increasingly look for more advanced solutions with consumer-like user experience. The Outvio team has understood exactly what the gap in the market is and has done a tremendous job of finding product-market fit with their modern fulfilment SaaS platform.”", "posttime": "2021-07-30 23:47:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "saas,change,体验", "title": "白标 SaaS 航运初创公司 Outvio 完成了由 Change Ventures 领投的 300 万美元融资", "title_en": "\n\t\t\t\tWhite-label SaaS shipping startup Outvio closes $3M round led by Change Ventures\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/30/white-label-saas-shipping-startup-outvio-closes-3m-round-led-by-change-ventures/", "via": "", "real_tags": ["saas", "change", "体验"]}, {"category": "", "categoryclass": "", "imagename": "6968d18dfc8bf867af9b28a1170f3e7f.jpg", "infoid": 1070661, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "中断发生在 9 月 21 日至 23 日，但早鸟交易将于今天 7 月 30 日晚上 11:59（太平洋时间）到期。立即购买您的 Disrupt 2021 通行证并保存。让我们谈谈您将在 Disrupt 体验什么。在 Disrupt Stage 上，您将找到来自技术、投资和政策领域的图标和互动式、专家主导的演讲的一对一访谈。像 Coinbase 首席执行官 Brian Armstrong、美国交通部长 Pete Buttigieg、Duolingo 首席执行官 Luis von Ahn 和 Mirror 首席执行官 Brynn Putnam 这样的人。而这只是技术冰山一角。您可以在此处查看所有扬声器。您会在 Extra Crunch 阶段找到大量可行的建议以及操作技巧和策略。看看我们在那里安排的两个主题，并在此处探索完整的 Disrupt 议程。打造不容忽视的宣传平台：投资者可能会追逐最热门的交易，但对于出售初创公司愿景的创始人来说，以最清晰的方式传达它从未如此重要。音高专家 Mercedes Bent（合伙人，Lightspeed Venture Partners）、Mar Hershenson（联合创始人兼管理合伙人，Pear VC）和 Saba Karim（Techstars 的加速器管道负责人）深入研究什么是必不可少的，什么是不必要的，什么可以让一切你下一副牌的差异。您如何选择正确的技术堆栈：从零开始，当涉及到当今工程师可用的无限多种技术堆栈时，初创公司必须进行数十次权衡。选择错误的组合或方向，初创公司可能需要经过多年的重构才能修复遗留问题。评估潜在堆栈的最佳实践是什么，您如何最大程度地减少痛苦错误的风险？ Preeti Somal（HashiCorp 工程执行副总裁）和 Jill Wetzler（Pilot 工程主管）将讨论从初创公司旅程的开始和每个阶段改进工程的策略。 Disrupt 的虚拟格式提供了大量提问的机会，所以请准备好向专家询问让您夜不能寐的问题。一篇文章不可能包含 Disrupt 的所有事件和机会。不要错过史诗般的 Startup Battlefield 竞赛、在 Startup Alley 展览区展出的数百家早期初创公司、特别分组会议（如 Pitch Deck Teardown）等等。\nTechCrunch Disrupt 2021 提供了大量机会。不要错过第一个 — 7 月 30 日今天晚上 11:59 (PT) 以不到 100 美元的价格购买您的 Disrupt 通行证。这是一个甜蜜的交易！贵公司是否有兴趣赞助或参展 Disrupt 2021？通过填写此表格联系我们的赞助销售团队。", "note_en": "Disrupt takes place on September 21-23, but the early-bird deal expires today,  July 30 at 11:59 pm (PT).  Buy your Disrupt 2021 pass now and save.\n Let’s talk about what you’ll experience at Disrupt. Over on the  Disrupt Stage you’ll find one-on-one interviews with icons and interactive, expert-led, presentations from across the tech, investing and policy sectors. Folks like  Coinbase CEO Brian Armstrong,  U.S. Secretary of Transportation Pete Buttigieg,  Duolingo CEO Luis von Ahn and  Mirror CEO Brynn Putnam. And that’s just the tip of the tech iceberg. You can  check out all the speakers here.\n  You’ll find plenty of actionable advice and how-to tips and strategies on the  Extra Crunch Stage. Take a gander at just two of the topics we have scheduled there and  explore the full Disrupt agenda here.\n Crafting a Pitch Deck that Can’t Be Ignored: Investors may be chasing after the hottest deals, but for founders selling their startup’s vision, it’s never been more important to communicate it in the clearest way possible. Pitch deck experts Mercedes Bent (partner, Lightspeed Venture Partners), Mar Hershenson (co-founder &amp; managing partner, Pear VC) and Saba Karim (Techstars’ head of accelerator pipeline) dig into what’s essential, what’s unnecessary and what could just make all the difference in your next deck.\n How Do You Select the Right Tech Stack: From day zero, startups have to make dozens of trade-offs when it comes to the infinite variety of tech stacks available to today’s engineers. Choose the wrong combination or direction, and a startup could be left with years of refactoring to fix the legacy damage. What are the best practices for assessing potential stacks, and how can you minimize the risk of a painful mistake? Preeti Somal (executive vice president of engineering, HashiCorp) and Jill Wetzler (head of engineering, Pilot) will discuss strategies for improving engineering right from the beginning and at every stage of a startup’s journey.\n Disrupt’s virtual format provides plenty of opportunity for questions, so come prepared to ask the experts about the issues that keep you up at night.\n One post can’t possibly contain all the events and opportunities of Disrupt. Don’t miss the epic Startup Battlefield competition, hundreds of early-stage startups exhibiting in the Startup Alley expo area, special breakout sessions — like the Pitch Deck Teardown — and so much more.\n TechCrunch Disrupt 2021 offers tons of opportunity. Don’t miss out on the first one —  buy your Disrupt pass today,  July 30, by 11:59 pm (PT) for less than $100. It’s a sweet deal!\n Is your company interested in sponsoring or exhibiting at Disrupt 2021? Contact our sponsorship sales team by   filling out this form.", "posttime": "2021-07-30 23:46:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "techcrunch,snag,disrupt", "title": "在 TechCrunch Disrupt 2021 上抢购早鸟通行证的最后一天", "title_en": "\n\t\t\t\tLast day to snag early bird passes to TechCrunch Disrupt 2021\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/30/last-day-to-snag-early-bird-passes-to-techcrunch-disrupt-2021/", "via": "", "real_tags": ["snag", "disrupt"]}, {"category": "", "categoryclass": "", "imagename": "d07663f33e5404e3e81fe9d217cc4fbd.jpg", "infoid": 1070659, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿邮报免费提供有关冠状病毒的重要信息。有关冠状病毒大流行的更多免费报道，请注册我们的冠状病毒更新时事通讯，所有故事均可免费阅读。根据一份内部联邦卫生文件，冠状病毒的 delta 变体似乎比早期变体引起更严重的疾病，并且像水痘一样容易传播，该文件认为官员们必须“承认战争已经改变”。该文件是疾病控制和预防中心的内部幻灯片演示，在 CDC 内共享并由华盛顿邮报获得。它反映了美国最高公共卫生机构在说服公众接受疫苗接种和预防措施（包括戴口罩）方面的斗争，因为美国各地的病例激增，新研究表明接种疫苗的人可以传播病毒。该文件发出紧急通知，表明该机构知道它必须修改其公共信息，以强调疫苗接种是针对具有传染性的变种的最佳防御，它几乎像一种不同的新型病毒，比埃博拉或其他病毒更迅速地从一个目标跳到另一个目标。普通感冒。它引用了最近从暴发调查和外部研究中获得但尚未发表的数据的组合，这些数据表明，感染了 delta 的接种疫苗的人可能与未接种疫苗的人一样容易传播病毒。感染了 delta 的接种疫苗的人具有可测量的病毒载量，类似于未接种疫苗并感染了变异体的人。加州大学旧金山分校医学系主任罗伯特·沃赫特 (Robert Wachter) 在一封电子邮件中写道：“我读完后比开始时更加担心。” CDC 科学家对这项新研究感到非常震惊，以至于该机构本周早些时候甚至在公开新数据之前就对接种疫苗的人的指导进行了重大更改。\n一名联邦卫生官员说，文件中引用的数据和研究在修订建议中发挥了关键作用，这些建议呼吁所有人——无论是否接种疫苗——在某些情况下在公共场合在室内戴口罩。该官员告诉《华盛顿邮报》，该数据将于周五完整发布。 CDC 主任罗谢尔·瓦伦斯基 (Rochelle Walensky) 周四私下向国会议员简要介绍了该文件中的大部分材料。其中一张幻灯片指出，无论疫苗接种情况如何，与年轻人相比，老年人住院和死亡的风险更高。另一项估计，在 1.62 亿接种疫苗的美国人中，每周有 35,000 例有症状的感染。该文件概述了接种疫苗者病例引发的“沟通挑战”，包括当地卫生部门对冠状病毒疫苗是否仍然有效以及“公众确信疫苗不再有效/需要加强剂量”的担忧。演讲强调了 CDC 面临的艰巨任务。它必须继续强调疫苗在预防严重疾病和死亡方面已被证实的功效，同时承认轻微的突破性感染毕竟可能并不罕见，而且接种疫苗的个人正在传播病毒。该机构必须在全公众视野中移动成功的目标。这位不愿透露姓名的联邦卫生官员说：“虽然这种情况很少见，但我们认为在个人层面上，接种疫苗的人可能会传播病毒，这就是我们更新建议的原因。”公开。 “甚至要等几天才能发布数据可能会导致不必要的痛苦，作为公共卫生专业人员，我们不能接受这一点。”演示文稿是在瓦伦斯基宣布对接种疫苗的人戴口罩的指导进行逆转两天后进行的。 5 月 13 日，人们被告知，如果他们接种了疫苗，他们在室内或室外不再需要戴口罩。新指南反映了面对 delta 变体的战略撤退。疾病预防控制中心说，即使是接种了疫苗的人也应该在病毒大量传播的社区内或在有特别容易感染和生病的人在场的室内戴口罩。该文件提出了新的科学，但也表明需要一种新的沟通策略，并指出当人们经历或听说突破性病例时，尤其是在公共卫生官员将其描述为罕见之后，公众对疫苗的信任可能会受到损害。\n底特律韦恩州立大学的风险沟通专家马修·西格说，缺乏关于突破性感染的沟通已被证明是有问题的。由于公共卫生官员强调了疫苗的巨大功效，意识到它们并不完美可能会让人觉得是一种背叛。 “我们在告诉公众这些是奇迹疫苗方面做得很好，”西格说。 “我们可能有点陷入过度自信的陷阱，这是任何危机沟通环境的挑战之一。” CDC 修订后的口罩指南并未达到内部文件的要求。 “鉴于更高的传播率和当前的疫苗覆盖率，通用掩蔽对于减少 Delta 变体的传播至关重要，”它指出。该文件明确指出，疫苗接种可提供针对病毒的实质性保护。但它还指出，疾病预防控制中心必须“改善[接种者]之间关于个人风险的沟通”，因为这种风险取决于许多因素，包括年龄以及某人的免疫系统是否受损。该文件包括 CDC 的研究数据，这些数据表明疫苗对免疫功能低下的患者和疗养院居民的效果不佳，这增加了一些高危人群需要额外接种疫苗的可能性。演示文稿包括一个说明，即调查结果和结论是作者的，不一定代表 CDC 的官方立场。内部文件包含一些影响 CDC 更改其口罩指南的科学信息。宾夕法尼亚大学安嫩伯格公共政策中心主任凯瑟琳·霍尔·贾米森 (Kathleen Hall Jamieson) 表示，该机构在未公布数据的情况下更改了口罩指南，本周遭到了外部专家的批评，此举违反了科学规范。\n“当你是一名公共卫生官员时，你不会想说，&#39;相信我们，我们知道，我们不能告诉你怎么做，&#39;”杰米森说。 “科学规范表明，当你根据科学做出陈述时，你就是在展示科学。 ......第二个错误是，他们似乎对突破导致住院治疗的程度不坦诚。” CDC 简报指出，突破性病例是意料之中的，并且可能会上升为所有病例的比例，因为现在接种疫苗的人太多了。这与其他国家的研究数据相呼应，包括高度接种疫苗的新加坡，据报道，新加坡 75% 的新感染发生在部分和完全接种疫苗的人群中。 CDC 文件将公众对疫苗的怀疑列为挑战之一：“公众确信疫苗不再有效”，演示文稿中的第一张幻灯片指出。埃默里疫苗中心副主任沃尔特·A·奥伦斯坦 (Walter A. Orenstein) 说，数据显示接种了 delta 疫苗的人与未接种疫苗的人一样，排出的病毒数量让他感到震惊。幻灯片引用了马萨诸塞州巴恩斯特布尔县的一次疫情，在那里接种疫苗和未接种疫苗的人传播的病毒量几乎相同。一位与 CDC 合作调查 delta 变体的人士说，该数据来自 7 月 4 日在马萨诸塞州普罗温斯敦爆发的暴发。暴发的基因分析显示接种疫苗的人会将病毒传染给其他接种疫苗的人。该人士表示，对于看过这些数据的科学家来说，这些数据“令人深感不安”，是“煤矿中的金丝雀”。如果战争发生了变化，正如疾病预防控制中心所说，成功和失败的计算也会发生变化。传染病专家说，delta 的极端传染性使群体免疫成为更具挑战性的目标。 “我认为核心问题是接种疫苗的人可能在很大程度上参与了 delta 的传播，”哥伦比亚大学流行病学家杰弗里沙曼在查看了 CDC 幻灯片后在一封电子邮件中写道。 “从某种意义上说，疫苗接种现在是关于个人保护——保护自己免受严重疾病的侵害。群体免疫并不重要，因为我们看到了大量重复和突破性感染的证据。”\n该文件强调了科学家和专家几个月来一直在说的话：是时候改变人们对大流行的看法了。马里兰大学医学院的疫苗专家 Kathleen Neuzil 表示，让更多人接种疫苗仍然是当务之急，但在可预见的未来，公众可能还必须改变与一种几乎肯定会与人类有关的病毒的关系。 “我们真的需要转向预防严重疾病、残疾和医疗后果的目标，而不是担心在某人鼻子中检测到的每一种病毒，”Neuzil 说。 “这很难做到，但我认为我们必须对冠状病毒不会消失感到满意。”当天最重要的新闻报道，由邮政编辑策划，每天早上发布。", "note_en": "The Washington Post is providing this important information about the coronavirus for free.  For more free coverage of the coronavirus pandemic,  sign up for our Coronavirus Updates newsletter where all stories are free to read.\n The delta variant of the  coronavirus appears to cause more severe illness than earlier variants and spreads as easily as chickenpox, according to an internal federal health document that argues officials must “acknowledge the war has changed.”\n  The document is an internal Centers for Disease Control and Prevention slide presentation, shared within the CDC and obtained by The Washington Post. It captures the struggle of the nation’s top public health agency to persuade the public to embrace vaccination and prevention measures, including mask-wearing, as  cases surge across the United States and new research suggests vaccinated people can spread the virus.\n The document strikes an urgent note, revealing the agency knows it must revamp its public messaging to emphasize vaccination as the best defense against a variant so contagious that it acts almost like a different novel virus, leaping from target to target more swiftly than Ebola or the  common cold.\n   It cites a combination of recently obtained,  still-unpublished data from outbreak investigations and outside studies showing that vaccinated individuals infected with delta may be able to transmit the virus as easily as those who are unvaccinated. Vaccinated people infected with delta have measurable viral loads similar to those who are unvaccinated and infected with the variant.\n   “I finished reading it significantly more concerned than when I began,” Robert Wachter, chairman of the Department of Medicine at the University of California at San Francisco, wrote in an email.\n CDC scientists were so alarmed by the new research that the agency earlier this week  significantly changed guidance for vaccinated people even before making new data public.\n The data and studies cited in the document played a key role in revamped recommendations that call for everyone — vaccinated or not — to wear masks indoors in public settings in certain circumstances, a federal health official said. That official told The Post that the data will be published in full on Friday. CDC Director Rochelle Walensky privately briefed members of Congress on Thursday, drawing on much of the material in the document.\n   One of the slides states that there is a higher risk among older age groups for hospitalization and death relative to younger people, regardless of vaccination status. Another estimates that there are 35,000 symptomatic infections per week among 162 million vaccinated Americans.\n The document outlines “communication challenges” fueled by cases in vaccinated people, including concerns from local health departments about whether coronavirus vaccines remain effective and a “public convinced vaccines no longer work/booster doses needed.”\n The presentation highlights the daunting task the CDC faces. It must continue to emphasize the proven efficacy of the vaccines at preventing severe illness and death while acknowledging  milder breakthrough infections may not be so rare after all, and that vaccinated individuals are transmitting the virus. The agency must move the goal posts of success in full public view.\n    “Although it’s rare, we believe that at an individual level, vaccinated people may spread the virus, which is why we updated our recommendation,” according to the federal health official, who spoke on the condition of anonymity because they were not authorized to speak publicly. “Waiting even days to publish the data could result in needless suffering and as public health professionals we cannot accept that.”\n The presentation came two days after Walensky announced the reversal in guidance on masking among people who are vaccinated. On May 13, people were told they  no longer needed to wear masks indoors or outdoors if they had been vaccinated. The new guidance reflects a strategic retreat in the face of the delta variant. Even people who are vaccinated should wear masks indoors in communities with substantial viral spread or when in the presence of people who are particularly vulnerable to infection and illness, the CDC said.\n   The document presents new science but also suggests a new strategy is needed on communication, noting that public trust in vaccines may be undermined when people experience or hear about breakthrough cases, especially after public health officials have described them as rare.\n Matthew Seeger, a risk communication expert at Wayne State University in Detroit, said a lack of communication about breakthrough infections has proved problematic. Because public health officials had emphasized the great efficacy of the vaccines, the realization that they aren’t perfect may feel like a betrayal.\n “We’ve done a great job of telling the public these are miracle vaccines,” Seeger said. “We have probably fallen a little into the trap of over-reassurance, which is one of the challenges of any crisis communication circumstance.”\n   The CDC’s revised mask guidance stops short of what the internal document calls for. “Given higher transmissibility and current vaccine coverage, universal masking is essential to reduce transmission of the Delta variant,” it states.\n The document makes clear that vaccination provides substantial protection against the virus. But it also states that the CDC must “improve communications around individual risk among [the] vaccinated” because that risk depends on a host of factors, including age and whether someone has a compromised immune system.\n The document includes CDC data from studies showing that the vaccines are not as effective in immunocompromised patients and nursing home residents, raising the possibility that some at-risk individuals will need an additional vaccine dose.\n  The presentation includes a note that the findings and conclusions are those of the authors and do not necessarily represent the CDC’s official position.\n  The internal document contains some of the scientific information that influenced the CDC to change its mask guidance. The agency faced criticism from outside experts this week when it changed the mask guidance without releasing the data, a move that violated scientific norms, said Kathleen Hall Jamieson, director of the Annenberg Public Policy Center at the University of Pennsylvania.\n “You don’t, when you’re a public health official, want to be saying, ‘Trust us, we know, we can’t tell you how,’” Jamieson said. “The scientific norm suggests that when you make a statement based on science, you show the science. … And the second mistake is they do not appear to be candid about the extent to which breakthroughs are yielding hospitalizations.”\n  The breakthrough cases are to be expected, the CDC briefing states, and will probably rise as a proportion of all cases because there are so many more people vaccinated now. This echoes data seen from studies in other countries, including highly vaccinated Singapore, where 75 percent of new infections reportedly occur in people who are partially and fully vaccinated.\n  The CDC document cites public skepticism about vaccines as one of the challenges: “Public convinced vaccines no longer work,” one of the first slides in the presentation states.\n Walter A. Orenstein, associate director of the Emory Vaccine Center, said he was struck by data showing that vaccinated people who became infected with delta shed just as much virus as those who were not vaccinated. The slide references an outbreak in Barnstable County, Mass., where vaccinated and unvaccinated people shed nearly identical amounts of virus.\n   A person working in partnership with the CDC on investigations of the delta variant, who spoke on the condition of anonymity because they were not authorized to speak, said the data came from a July 4 outbreak in Provincetown, Mass. Genetic analysis of the outbreak showed that people who were vaccinated were transmitting the virus to other vaccinated people. The person said the data was “deeply disconcerting” and a “canary in the coal mine” for scientists who had seen the data.\n  If the war has changed, as the CDC states, so has the calculus of success and failure. The extreme contagiousness of delta makes herd immunity a more challenging target, infectious-disease experts said.\n “I think the central issue is that vaccinated people are probably involved to a substantial extent in the transmission of delta,” Jeffrey Shaman, a Columbia University epidemiologist, wrote in an email after reviewing the CDC slides. “In some sense, vaccination is now about personal protection — protecting oneself against severe disease. Herd immunity is not relevant as we are seeing plenty of evidence of repeat and breakthrough infections.”\n The document underscores what scientists and experts have been saying for months: It is time to shift how people think about the pandemic.\n Kathleen Neuzil, a vaccine expert at the University of Maryland School of Medicine, said getting more people vaccinated remains the priority, but the public may also have to change its relationship to a virus almost certain to be with humanity for the foreseeable future.\n “We really need to shift toward a goal of preventing serious disease and disability and medical consequences, and not worry about every virus detected in somebody’s nose,” Neuzil said. “It’s hard to do, but I think we have to become comfortable with coronavirus not going away.”\n      The most important news stories of the day, curated by Post editors and delivered every morning.", "posttime": "2021-07-30 23:36:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,敦促,infections,疫苗", "title": "“战争已经改变”：CDC 内部文件敦促发布新消息，警告三角洲感染可能更加严重", "title_en": "'The War Has Changed': Internal CDC Document Urges New Messaging, Warns Delta Infections Likely More Severe", "transed": 1, "url": "https://www.washingtonpost.com/health/2021/07/29/cdc-mask-guidance/", "via": "", "real_tags": ["发布", "敦促", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "57b5d1c540cb5935e2d3d036638e8e48.jpg", "infoid": 1070658, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "总部位于加利福尼亚州旧金山的人工智能客户互动平台 MoEngage 今天宣布，它筹集了 3250 万美元，由 Multiples Private Equity 领投，8 RoadsVentures、F-Prime Capital 和 Matrix Partners 跟投。该公司表示，新资本使 MoEngage 的总融资额超过 7200 万美元，将用于支持其全球增长战略并加强其人工智能和预测能力。一般来说，积极的客户体验转化为高客户支出。一位消息人士称，86% 的买家愿意为出色的客户体验支付更多费用。事实上，Temkin Group 发现，年收入 10 亿美元的公司在投资于客户体验的 3 年内平均有望额外获得 7 亿美元的收益。尤其是软件即服务提供商，其收入有望增长约 10 亿美元。 MoEngage 由 Raviteja Dodda 和 Yashwanth Kumar 于 2014 年创立，是一个“洞察主导”的客户参与平台，可实现跨渠道的个性化，包括移动推送、电子邮件、短信、网络推送、现场消息传递、应用内消息传递、卡片和连接到其他技术。利用人工智能驱动的自动化和优化，该平台旨在帮助品牌分析受众行为并在多个接触点与消费者进行交流。 MoEngage 可以映射客户旅程中的步骤，并根据人口统计、位置、设备类型和获取渠道级别确定他们可能会下车的地方。人工智能驱动的细分引擎根据客户的偏好、行为、人口统计、兴趣、交易等，自动将客户划分为微组，识别最有可能对促销做出反应的客户。使用 MoEngage，公司可以自动化、创建和可视化使用电子邮件、文本、推送通知、WhatsApp 和重定向渠道的客户生命周期活动和工作流程。除此之外，他们还可以让平台的 AI 引擎自动识别正确的信息——以及发送信息的正确时间。 MoEngage 与许多希望通过人工智能和机器学习注入客户互动的公司竞争。例如，6Sense 从已知和匿名来源（包括网络）捕获意图信号，按帐户、行为意图或这两个因素的组合创建客户细分。同时，Punchh 与现有的销售点和电子商务系统集成，利用人工智能生成有针对性的营销活动和优惠，以提高忠诚度为目标。现在，营销人员认为自动化对于加强活动的推广至关重要，部分原因是它能够更好地定位客户沟通。根据最近的 HubSpot 调查，电子邮件自动化活动是营销人员用来提高绩效的三大策略之一。 2017 年，Salesforce 报告称，67% 的销售领导者使用营销自动化平台。 MoEngage 拥有超过 250 名员工，表示其平台目前每月处理超过 1 万亿个数据点、500 亿条消息和 10 亿封电子邮件。著名的客户包括迈克菲、雀巢、多米诺、德国电信、Travelodge 和 Ally Financial。该公司声称其客户群和经常性收入在过去 12 个月内翻了一番，2021 年上半年美国和欧洲的业务增长是 2020 年下半年的两倍。在过去一年增加了 250 多个新客户之后， MoEngage 计划在今年某个时候在纽约市和波士顿开设办事处。\nVentureBeat 的使命是成为技术决策者的数字城镇广场，以获取有关变革性技术和交易的知识。我们的网站提供有关数据技术和策略的重要信息，以指导您领导您的组织。我们邀请您成为我们社区的一员，访问：封闭的思想领袖内容和我们珍贵活动的折扣访问权限，例如 Transform 2021：了解更多 成为成员", "note_en": "MoEngage, an AI customer engagement platform based in San Francisco, California, today announced that it raised $32.5 million led by Multiples Private Equity with participation from Eight RoadsVentures, F-Prime Capital, and Matrix Partners. The company says that the new capital, which brings MoEngage’s total raised to over $72 million, will be used to support its global growth strategy and strengthen its AI and predictive capabilities.\n Generally speaking, a positive customer experience translates to high customer spend. Eighty-six percent of buyers are willing to pay more for a great customer experience,  according to one source. In fact, the Temkin Group  found that companies that earn $1 billion annually can expect to yield, on average, an additional $700 million within 3 years of investing in customer experience. Software-as-a-service providers in particular can anticipate a revenue uptick of around $1 billion.\n   Founded in 2014 by Raviteja Dodda and Yashwanth Kumar, MoEngage is an “insights-led” customer engagement platform that enables personalization across channels including mobile push, email, SMS, web push, on-site messaging, in-app messaging, cards, and connectors to other technologies. Leveraging AI-powered automation and optimization, the platform aims to help brands analyze audience behavior and engage consumers with communication at multiple touchpoints.\n  MoEngage can map the steps in a customer’s journey and identify where they might be dropping off down to the demographic, location, device type, and acquisition channels level. An AI-driven segmentation engine automatically splits customers into micro-groups based on their preferences, behavior, demographics, interests, transactions, and more, identifying customers most likely respond to promotions. Using MoEngage, companies can automate, create, and visualize customer lifecycle campaigns and workflows that use email, text, push notifications, WhatsApp, and retargeting channels. Beyond this, they can let the platform’s AI engine automatically identify the right message — as well as the right time to send it.\n MoEngage competes with a number of companies looking to inject customer engagement with AI and machine learning.  6Sense, for example, captures intent signals from known and anonymous sources including the web, creating customer segments by account, behavioral intent, or a combination of those two factors. Meanwhile,  Punchh integrates with existing point-of-sale and ecommerce systems, employing AI to generate targeted marketing campaigns and offers with the goal of promoting loyalty.\n  Automation is now seen as essential among marketers to bolster the outreach of campaigns, in part because of its ability to better target customer communications. According to a recent HubSpot  survey, email automation campaigns are among the top three tactics used by marketers to improve performance. And in 2017, Salesforce  reported that 67% of sales leaders used a marketing automation platform.\n MoEngage, which has a workforce of more than 250 people, says its platform is currently processing over 1 trillion data points, 50 billion messages, and 1 billion emails per month. Notable clients include McAfee, Nestle, Domino’s, Deutsche Telekom, Travelodge, and Ally Financial. The company claims its customer base and recurring revenue doubled in the last 12 months and that business growth in the U.S. and Europe tripled in the first half of 2021 compared with the second half of 2020. After adding over 250 new customers in the past year, MoEngage plans to open offices in New York City and Boston sometime this year.\n VentureBeat&#39;s mission is to be a digital town square for technical decision-makers to gain knowledge about transformative technology and transact.Our site delivers essential information on data technologies and strategies to guide you as you lead your organizations. We invite you to become a member of our community, to access: gated thought-leader content and discounted access to our prized events, such as   Transform 2021: Learn More\n Become a member", "posttime": "2021-07-30 23:35:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "参与,total,客户", "title": "MoEngage 是一项客户参与服务，可在电子邮件、短信等方面实现个性化，融资 3250 万美元，使其总融资额达到 7200 万美元以上", "title_en": "MoEngage, a customer engagement service that enables personalization across email, SMS, and more, raises $32.5M, bringing its total raised to $72M+", "transed": 1, "url": "https://venturebeat.com/2021/07/30/moengage-raises-32-5m-to-inject-customer-engagement-with-ai/", "via": "", "real_tags": ["参与", "total", "客户"]}, {"category": "", "categoryclass": "", "imagename": "48748a7fd5c1451de848e0a9cbe5c812.png", "infoid": 1070656, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "TL，DR：Uno 平台是我希望 Xamarin.Forms 的一切。鉴于此，请告诉我为什么要为 .NET Maui 烦恼。 2012 年，我听说了这个名为 Xamarin 的新平台。当时，它被宣传为 Mono（大众的 C#）的品牌重塑，重点是 iOS 和 Android。作为一名小型开发人员，维护多个冗余代码库是（现在仍然是）我最大的痛点——所以我很感兴趣。 2013年，我花钱请了我的一个好朋友来深入了解一下。他为应用程序创建了一些基准（启动时间、渲染时间等），这些应用程序比 Xamarin 营销中的任何东西都更加真实。 iOS 的表现很棒。 Android - 不是很多，但可以忍受。有希望使 Android 变得更好，所以我们决定采取飞跃并构建一些应用程序。然后，在 2015 年，Xamarin.Forms 制造了足够多的噪音，我想我会尝试一下。尽管 Xamarin 允许我们编写一次业务逻辑，但这只是构建应用程序工作的一小部分。 Xamarin.Forms 电梯宣传是“适用于所有设备的一个代码库”。首先，Xamarin.Forms 当时的理念是“让 iOS 应用看起来像 iOS 应用，让 Android 应用看起来像 Android 应用”。换句话说，他们知道需要大量的工作来规范 UI，所以他们不会打扰。如果您想要平台之间的一致性，您将不得不为此付出汗水。接下来，我在 Android 和 iOS 中习惯的很多东西都没有出现在 Xamarin.Forms 的抽象 UI 中。一些例子。上面的清单消耗了我三年的大部分时间。与此同时，Xamarin 的 UWP 支持和 Tizen 也上线了（仍然没有客户询问 Tizen）。完成上述列表并移植我的 UI 代码后，我就有了一些很棒的 iOS 和 UWP 应用程序。但是，Xamirin.Forms Android 应用程序很糟糕（现在仍然如此）。启动时间很糟糕，更重要的是，视图渲染比没有表单的 Xamarin 慢一个数量级。\nAOT 编译和启动分析缓解了这个问题，但即使到今天，Android 性能仍然很糟糕。即使在高端设备上，Android 操作系统也会经常终止这些应用程序，因为它们的响应速度不够快。除了上述内容之外，我和我的客户还想要我们应用程序的 WASM 版本。从一开始就有将 Xamarin.Forms 移植到 WASM 的传言，但从来没有官方声明。然后，在 2017 年 6 月，Frank Krueger 发布了 Ooui — Xamarin.Forms for WASM！弗兰克打造了一件杰作——优雅而高效。让我说清楚。 Frank 给了我对 Xamarin.Forms 的希望。如果不是 Ooui，我会放弃 Xamarin.Forms 并放弃跨平台开发。但是，缺点从未消失，Xamarin 的重点始终放在别处。 Android 更新继续发生，但性能并没有变得更好。 Frank 退出了 Ooui 的工作（这只是一个概念证明，对吧？）。我花了三个月的时间试图提高 Android 性能，但徒劳无功。 Xamarin 似乎对 Blazor 比 Ooui 更感兴趣，因为它是一种网络方法。同时，在 2018 年 10 月，Uno 平台宣布他们拥有 WASM。很快，他们就有了复杂的、真实世界的演示应用程序来证明这一点。因此，在 2020 年春季，我（实际上）参加了 Uno Conf。我的第一要务是：Uno 的 Android 性能如何。在花了几个小时听了关于构建工具和工具包的讨论后，会议结束了。我没有答案，越来越怀疑。然而，有一个虚拟的会后社交活动，我可以在那里会见其他与会者。一旦经过供应商，我遇到了卡尔德比利。我与 Carl 分享了我使用 Xamarin.Forms Android 的经验，并询问 Uno 是否会有所不同。卡尔非常专业，但他也给了我足够的信息，让我知道该戳哪里。在接下来的一周中，我进行了许多实验，并且对我所学到的东西感到非常震惊——如果不进行重大重写，Xamarin.Forms 将永远无法构建高性能的 Android 应用程序。为什么？因为 Android 中托管 (C#) 和本机代码 (Java) 之间的切换比其他平台差约 10 倍。 Xamarin.Android 应用不是问题，因为它们使用 Android 布局引擎。但是，Android 版 Xamarin.Forms 是为使用 Xamarin.Forms 的托管代码进行视图实例化和布局而构建的（就像 Xamarin.Forms 在其他平台上所做的那样）——这会导致托管和本机之间的切换时间增加 10 秒、100 秒、1000 秒、10,000 秒.这在 Xamarin 的演示应用程序中并不是什么大问题，但是，在更真实的列表视图应用程序中，这个纸牌屋会在其自身的重量下倒塌。这就是为什么我的 Android 应用程序很烂的原因。八月份开始迁移我的工程分析代码库，其中78k行是UI代码。我不是 UWP 开发人员，所以有一个上升曲线。 12 周后，一个完成的应用程序，在 beta 测试中——在 WASM 中运行！当它超出测试版时，我会在这里放一个链接。一路上我学到的东西：\nUWP 调试是可耻的。如果 UWP 采用失败的原因只有一个，那就是它。但是，Uno 允许您针对许多其他平台，这不是问题，从而为您提供了机会。 Windows。不支持绘图。然而，Uno 的 SkiaSharp 支持足以弥补这一差距。拥有非常清晰和有形的规范是 Uno 最大的资产。 “正确的方式”是毋庸置疑的。不幸的是，出于务实的原因，Uno 有时确实不得不偏离 UWP。一旦您了解这些偏差的位置，您很快就会意识到 Uno 的架构与 UWP 一样好（或者可能更好）。性能：毫无疑问，Uno 更好。我的 Android 应用程序的 Uno 版本没有卡顿！需要做更多的工作来允许资产一次性放置在共享项目中，并且可供所有平台项目访问。例如，设置自定义字体会导致许多特定于平台的工作可以自动化。我对 Xamarin 对这个问题的解决方案并不疯狂，我希望 Uno 可以想出一种方法，从开发人员的 POV 来看，感觉就像他们在构建 UWP 应用程序一样。与 Xamarin.Forms / Xamarin.Essentials 相比，仍在开发中的 Uno 框架本质上具有更多的功能。 Uno 的 Web 解决方案很大程度上受到 Ooui 的启发——这意味着非常精简和精简的实现。\n还有一个意外发现：我的 UI 代码从 78k 行 Xamarin.Forms 代码变成了 19k 行 Uno 代码！引用 Todd Wiley 的话：“我最喜欢的键是 [delete] 键”。总结：我从 2015 年年中开始开发 Xamarin.Forms 应用程序，这几乎是 Xamarin.Forms 的开始。从根本上说，它有两个对除最简单的应用程序之外的所有应用程序来说都过于严重和根本的问题： WASM 过于复杂的方法：使用 BlazorMobile 或 Uno.Wasm，而不是像 Ooui 这样更直接的方法。 .NET Maui 是 Xamarin.Forms 的未来。除非我遗漏了什么（如果有请告诉我），.NET Maui 没有解决这些基本问题。如果没有修复它们，我就无法看到 Xamarin.Forms / .NET Maui 在 Uno 平台上的任何价值。", "note_en": "TL,DR:  Uno platform is everything I hoped Xamarin.Forms would be. In light of this, please tell me why one should bother with .NET Maui.\n  In 2012, I heard of this new platform called Xamarin. At the time, it was pitched as a rebranding of Mono (C# for the masses) with an emphasis on iOS and Android. As a small developer, maintaining multiple, redundant code bases was (and still is) my biggest pain point — so I was interested.\n In 2013, I paid a good friend of mine to take a deeper look. He created some benchmarks (launch time, rendering time, etc.) for apps that were a lot more real world than anything found in the Xamarin marketing. The iOS performance was great. Android — not so much, but tolerable. There were promises to make Android better so, we decided to take the leap and build a few apps.\n Then, in 2015, Xamarin.Forms was making enough noise that I thought I would give it a try. Even though Xamarin allowed us write the business logic once, that was only only a fraction of the effort to build our apps. The Xamarin.Forms elevator pitch was “one code base for all devices”.\n  First, Xamarin.Forms’ philosophy at the time was “make iOS apps look like iOS apps and Android apps look like Android apps”. In other words, they knew it was going to take a lot of work to normalize the UI so they were not going to bother. If you wanted consistency between platforms, you were going to have to pay for it in sweat.\n Next, a lot of what I was used to in Android and iOS just wasn’t in Xamarin.Forms’ abstracted UI. Some examples.\n  The above list consumed a good part of three years of my life. In the mean time, Xamarin’s UWP support came on line as well as Tizen (still haven’t had a client ask about Tizen). Once the above list was completed and my UI code was ported, I had some great iOS and UWP apps. However, Xamirin.Forms Android apps were terrible (and still are). Launch times were / are awful and, more importantly, view rendering was/is an order of magnitude slower than Xamarin without the Forms.\n AOT compiling and launch profiling mitigated the problem but, even to this day, Android performance is still terrible. Even on high end devices, Android OS would often terminate these apps because they were not responsive enough.\n In addition to the above, I and my clients wanted WASM versions of our apps. There were whispers of porting Xamarin.Forms to WASM since the beginning but never and official statement. Then, in June of 2017, Frank Krueger published  Ooui — Xamarin.Forms for WASM! And Frank built a masterpiece — elegant and performant. Let me be clear. Frank gave me hope for Xamarin.Forms. If it were not for Ooui, I would have dropped Xamarin.Forms and given up on cross platform development.\n But, the shortcomings never went away and Xamarin’s focus was always elsewhere. Android updates continued to happen but performance just didn’t get any better. Frank quit working on Ooui (it was only a proof of concept, right?). I spent three solid months in vain trying to improve Android performance. Xamarin appeared to be  more interested in Blazor than Ooui as an approach to web.\n Meanwhile, in October 2018,  Uno Platform announced they had WASM. And pretty soon, they had  complicated, real world demo apps to prove it.\n So, in the spring of 2020, I attended (virtually) Uno Conf. My number one priority: What was Uno’s Android performance. After spending hours listening to talks about build tools and toolkits, the conference was over. I had no answers and was becoming more skeptical. However, there was a virtual after-conference-social where I could meet other attendees. Once getting past the vendors, I met  Carl de Billy. I shared with Carl my experience with Xamarin.Forms Android and asked if Uno would be different.\n Carl was very professional but he also gave me just enough information to know where to poke. For the next week, I ran a number of experiments and was completely blown away with what I learned —  without a major rewrite, Xamarin.Forms will never be capable of building performant Android apps. Why? Because the handoff between managed (C#) and native code (Java) in Android is ~10x worse than other platforms. Not a problem for Xamarin.Android apps because they use Android layout engine. However, Xamarin.Forms for Android was build to use Xamarin.Forms’ managed code for view instantiation and layout (as Xamarin.Forms does on other platforms) — which then causes 10s, 100s, 1000s, 10,000s more handoffs between managed and native. This is not so much a problem in Xamarin’s demo apps but, in more real-world listview apps, this house of cards collapses under its own weight. This is why my Android apps sucked.\n In August, I started migrating my engineering analysis code base, of which 78k lines are UI code. I’m not a UWP developer, so there was a ramp up curve. 12 weeks later, a finished app, in beta test — running in WASM! When it’s out of beta, I’ll put a link here. Things I learned along the way:\n UWP debugging is disgraceful. If there had to be only one reason why UWP adoption has failed, this is it. However, Uno gives you an out by allowing you to target a number of other platforms where this isn’t an issue.\n  Windows.Drawing is not supported. However, Uno’s SkiaSharp support is more than sufficient to bridge this gap.\n Having very clear and tangible spec is Uno’s greatest asset. There is little doubt as to the “right way”. Unfortunately, for pragmatic reasons, Uno does have to deviate from UWP on occasion. Once you get a feeling for where those deviations are, you quickly realize that Uno is just as well architected as UWP (or probably better).\n Performance: Hands down, Uno is better. The Uno version of my Android app is jank-free!\n More work needs to be done to allow Assets to be placed once, in a shared project, and be accessible to all platform projects. For example, setting up custom fonts results in a lot of platform specific work that could be automated. I am not crazy about Xamarin’s solution to this problem and I am hoping Uno can come up with a way that, from a developer’s POV, feels just like it would if they were building a UWP app.\n There is intrinsically a lot more functionality in the still-a-work-in-progress Uno framework than in Xamarin.Forms / Xamarin.Essentials.\n Uno’s web solution is largely inspired by Ooui — which means a very lean and thin implementation.\n And an unexpected finding: My UI code went from 78k lines of Xamarin.Forms code to 19k lines of Uno code! To quote Todd Wiley: “my favorite key is the [delete] key”.\n To conclude: I’ve been developing Xamarin.Forms apps since mid-2015, which is almost Xamarin.Forms’s inception. Fundamentally it has two issues that are too serious and fundamental for all but the simplest apps:\n Overly complex approaches to WASM: glomming either  BlazorMobile or Uno.Wasm, rather than something more direct, like Ooui.\n .NET Maui is the future of Xamarin.Forms. Unless I’ve missed something (please tell me if I have), .NET Maui does not address these fundamental issues. Without them fixed, I just can’t see where Xamarin.Forms / .NET Maui has any value over the Uno platform.", "posttime": "2021-07-30 23:34:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "xamarin,uno", "title": "再见 Xamarin 表单", "title_en": "Goodbye Xamarin Forms", "transed": 1, "url": "https://itnext.io/goodbye-xamarin-forms-f41723fb9fe1", "via": "", "real_tags": ["xamarin", "uno"]}]