[{"category": "", "categoryclass": "", "imagename": "99d2b9556a8fbc6537f59d740387c2e6.png", "infoid": 1028259, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "⚕SYMPTOMA®️是一款数字健康助手，但不能替代医疗专业人员的意见和判断。通过使用本网站，您完全理解并接受本网站不应用作决策的诊断系统。它绝对不能用来获得、取代或否决医疗保健专业人员的临床诊断。最后的诊断总是由医学专业人员来做。本网站提供的医疗信息是一般性的，不能代替医疗专业人士(例如合格的医生或内科医生)的建议！来自互联网的信息可以也不应该仅仅被用来提供或提供医学意见，或者以其他方式从事医学实践。", "note_en": "⚕ Symptoma®️ is a digital health assistant but no replacement for the opinion and judgement of medical professionals. By using this website you fully understand and accept that it shall not be used as a diagnostic system for decision-making. It absolutely must not be used to obtain, replace or overrule a clinical diagnosis by a healthcare professional. It is always for the medical professional to make the final diagnosis. The medical information provided on this website is of a general nature and can not substitute for the advice of a medical professional (for example, a qualified doctor or physician)! Information from the internet could and should NOT be solely used to offer or render a medical opinion or otherwise engage in the practice of medicine.", "posttime": "2020-10-12 21:32:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "症状,digital,医疗", "title": "Symptoma-数字健康助手和症状检查器", "title_en": "Symptoma – Digital health assistant and symptom checker", "transed": 1, "url": "https://www.symptoma.com/", "via": "", "real_tags": ["症状", "digital", "医疗"]}, {"category": "", "categoryclass": "", "imagename": "b5650e074f985d7e8ef627c170421f21.png", "infoid": 1028258, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几年前，我做了很多关于浮点数学的思考和写作。这很有趣，我在这个过程中学到了很多，但有时我很长一段时间都没有真正使用那些来之不易的知识。因此，当我最终处理一个需要一些专业知识的bug时，我总是非常高兴。下面是我在Chromium中调查过的(至少)三个浮点错误故事中的第二个。这一次，我实际上修复了这个错误，既有Chromium版本，也有googletest版本，这样后代就不会感到困惑了。\n这个bug是一个突然开始发生的不可靠的测试失败。我们讨厌不及格的测试。当它们开始发生在一项多年没有改变的测试中时，它们尤其令人困惑。几周后我被拉去调查。错误消息(对行长度进行了一些编辑)开始如下所示：\n井。听起来很糟糕。这是一条googletest错误消息，指出本应在1.0范围内的两个浮点值实际上被512分隔。\n浮点数之间的差异是一条直接的线索。这两个数字正好相差2^9，这似乎非常可疑。巧合吗？不是的。消息的其余部分列出了被比较的两个值，这让我更确定了根本原因：\n如果你在IEEE754战壕里花了足够的时间，你会立即意识到正在发生什么。\n如果你读了上周的那一集，你可能会觉得这些数字的大小是一样的，这可能是似曾相识的感觉。这纯属巧合--我只是在用我收到的号码。这一次它们是用科学记数法印刷的，这样就有了一些多样性。阅读上一集了解更多背景信息。\n基本问题是上周问题的变体：计算机中的浮点数与数学家使用的实数不同。它们越大，精度就越低，在测试失败的数字范围内，处理的所有双精度值必然是512的倍数。双精度数的精度为53位，而这些数字远远大于2^53，因此精度大大降低是不可避免的。现在我们可以理解这个问题了。\n测试使用两种不同的方法计算相同的值。然后，它正在验证结果是否接近，其中“接近”的定义是在1.0以内。计算方法产生非常相似的答案，因此大多数情况下结果会舍入为相同的双精度值。但是，正确的答案时不时地会出现在一个尖点附近，一个计算会向一个方向取整，另一个计算会向另一个方向取整。\n剔除指数后，我们可以更容易地看到它们之间的距离是512。测试函数生成的两个无限精确的结果始终相差小于1.0%，因此当它们的值为429时，如429…。10653.5和429…。10654.3，它们都会四舍五入到429…。10688。当无限精确的结果接近4293431141623410944这样的值时，麻烦就来了。该值正好是两个双精度之间的一半。如果一个函数生成429个…。10943.9，另一个函数生成429…。10944.1，然后这些结果--它们之间只有0.2%的距离--在不同的方向四舍五入，最终得到512%的距离！\n这是尖点或阶跃函数的本质。你可以有两个结果，这两个结果是任意接近的，但是它们在一个尖点的两边-恰好是两个双精度之间的一个点-因此它们在相反的方向上舍入。经常建议更改舍入模式，但没有什么帮助-它只会移动尖端。\n这就像是在午夜时分出生--最微小的变化都可能永远改变你出生的日期(也许是年份、世纪或千年)。\n我的提交消息可能过于戏剧化，但它没有错。我觉得自己是唯一有资格处理这种情况的人：\n我的意思是，我多久才能通过提交消息(相当合理地包含指向两(2！)个链接的提交消息来实现对Chromium的更改！)。我的博客帖子。\n这种情况下的修复方法是按照计算值的大小计算相邻双精度之间的差值。这是使用很少使用的nextafter函数完成的，如下所示：\nNextafter函数查找下一个双精度值(在本例中为无穷大)，然后减法(这是准确的，非常方便)找出该量级的双精度值之间的差值。正在测试的算法可能会固有地给出1.0的误差，因此ε必须至少有那么大。这种epsilon计算使得检查这些值要么在1.0范围内，要么是相邻的双精度数变得很琐碎。\n我从来没有调查过为什么测试突然开始失败，但我怀疑计时器频率或计时器起始点已经改变，从而使数字变得更大。\n它困扰着我，因为它需要深奥的浮点知识才能理解这个问题，所以我想修复googletest。我的第一次尝试失败了。\n我最初试图修复googletest，以便每当通过一个毫无意义的小epsilon时都会使Expect_Near失败，但显然Google内部有很多测试-想必还有更多Google外部的测试-滥用Expect_Near on Double。它们传递的epsilon值太小而没有用，但是它们比较的数字是相同的，因此测试通过。我修复了12个Expect_Near的用法，但没有对问题产生任何影响，然后就放弃了。\n直到我开始写这篇博客文章(几乎在错误发生三年后！)。我意识到如何安全、轻松地修复谷歌测试。如果代码使用带有太小epsilon值的EXPENCE_NEAR，并且测试通过(意味着这些值实际上是相等的)，那么这不是真正的问题。只有在测试失败时才会出现问题，所以我需要做的就是在失败的情况下查找过小的epsilon值，然后显示一条信息性消息。\n我进行了更改，现在2017年失败的错误消息如下所示：\nExpect_Microsec和Converted_MicroSecond之间的差值为512，其中Expect_MicroSecond的计算结果为4.2934311416234112e+18，Converted_Microsec的计算结果为4.2934311416234107e+18。abs_error参数1.0的计算结果为1，该值小于此量级数字的双精度之间的最小距离512，从而使此EXPEART_NEAR检查等同于EXPERT_EQUAL。请考虑改用EXPECT_DOUBLE_EQ。\n请注意，EXPECT_DOUBLE_EQ实际上并不检查是否相等-它检查双精度数是否在最后一个位置(ULP)的四个单位内相等。有关此概念的详细信息，请参阅我的比较浮点数帖子。\n我希望大多数软件开发人员都能看到新的错误消息，并被送上正确的道路，我认为googletest修复最终比修复Chromium测试更重要。\n这篇文章发表在Chromium，Computers and Internet，Floating Point和标记为Googletest，Precision的网站上。为固定链接添加书签。", "note_en": "A few years ago I did a lot of  thinking and writing about floating-point math. It was good fun, and I learned a lot in the process, but sometimes I go a long time without actually  using that hard-earned knowledge. So, I am always inordinately pleased when I end up working on a bug which requires some of that specialized knowledge. Here then is the second of (at least) three tales of floating-point bugs that I have investigated in Chromium. And this time I actually fixed the bug, both in Chromium, and then in googletest so that future generations will be spared some confusion.\n  This bug was a flaky test failure that suddenly started happening. We hates flaky test failures. They are particularly perplexing when they start happening in a test which has not changed for years. I got pulled in after a few weeks to investigate. The error messages (with some edits for line length) started something like this:\n   Well. That sounds bad. This is a  googletest error message saying that two floating-point values that were supposed to be within 1.0 of each other were, in fact, separated by 512.\n The difference between the floating-point numbers was an immediate clue. It seemed very suspicious that the two numbers were separated by exactly 2^9. Coincidence? Nope. The rest of the message which listed the two values being compared just made me more certain of the underlying cause:\n  If you’ve done enough time in the  IEEE 754 trenches you will immediately recognize what is going on.\n If you read  last week’s episode then it may feel like déjà vu that the magnitude of the numbers is identical. This is pure coincidence – I’m just using the numbers I was dealt. This time they’re printed in scientific notation, so that gives some variety. Read the previous episode for more background.\n The basic problem is a variation on last week’s problem: floating-point numbers in computers are not the same as the real numbers used by mathematicians. As they get bigger they get less precise, and in the range of the numbers in the test failure all of the double-precision values being dealt with were, necessarily, multiples of 512. A double has 53 bits of precision and these numbers were far bigger than 2^53, so greatly reduced precision was inevitable. And now we can understand the problem.\n The test was calculating the same value using two different methods. It was then verifying that the results were close, where “close” was defined as being within 1.0. The calculation methods produced very similar answers so most of the time the results would round to the same double-precision value. But  every now and then the correct answer would be near a  cusp, and one calculation would round one way, and one calculation would round the other way.\n   With the exponents stripped away we can more easily see that they are 512 apart. The two infinitely precise results generated by the test functions were always less than 1.0 apart so when they were values like 429…10653.5 and 429…10654.3 they would both round to 429…10688. The trouble comes when the infinitely precise results are near a value like 4293431141623410944. This value is exactly half way between two doubles. If one function generates 429…10943.9 and the other function generates 429…10944.1 then these results – which are just 0.2 apart – get rounded in different directions and end up 512 apart!\n This is the nature of a cusp, or a step function. You can have two results which are arbitrarily close but which are on opposite sides of a cusp – a point exactly between two doubles – and therefore they round in opposite directions. Changing the rounding mode is often suggested, but doesn’t help – it just moves the cusp.\n It’s like being born near midnight – the tiniest variation can forever change the date (and maybe the year, century, or millennium) recorded for your birth.\n My commit message might have been overly dramatic, but it was not wrong. I felt uniquely qualified to handle this situation:\n  I mean, how often do I get to land a change to Chromium with  a commit message that quite reasonably contains links to two (2!) of my blog posts.\n The fix in this case was to calculate the difference between adjacent doubles at the magnitude of the calculated values. This was done with the rarely used  nextafter function, like this:\n  The  nextafter function finds the next double (towards infinity in this case), and the subtraction (which is exact, how convenient) then finds the difference between doubles at that magnitude. The algorithm being tested could inherently give an error of 1.0 so epsilon had to be at least that large. This epsilon calculation made it trivial to check that the values were either within 1.0 or were adjacent doubles.\n I never investigated why the test had suddenly started failing but I suspect that the timer frequency or the timer start point had changed, thus making the numbers bigger.\n  It bothered me that it required esoteric floating-point knowledge to understand this problem so  I wanted to fix googletest. My first attempt went badly.\n I initially tried to fix googletest to make EXPECT_NEAR fail whenever a meaninglessly-small epsilon was passed, but apparently a lot of tests within Google – and presumably many more outside of Google – abuse EXPECT_NEAR on doubles. They pass an epsilon value that is too small to be useful, but the numbers they are comparing are identical so the test passes. I fixed a dozen uses of EXPECT_NEAR without making a dent in the problem and then gave up.\n It wasn’t until I started writing this blog post (almost three years after the bug!) that I realized how to safely and easily fix googletest. If code is using EXPECT_NEAR with a too-small epsilon value and the test is passing (meaning that the values actually are equal) then it’s not really a problem. It only becomes a problem when the test fails, so all I needed to do was to look for too-small epsilon values in the  failure case and display an informative message then.\n I  landed that change and now the error message for the 2017 failure looks like this:\n The difference between expected_microseconds and converted_microseconds is 512, where expected_microseconds evaluates to 4.2934311416234112e+18, converted_microseconds evaluates to 4.2934311416234107e+18. The abs_error parameter 1.0 evaluates to 1 which is smaller than the minimum distance between doubles for numbers of this magnitude which is 512, thus making this EXPECT_NEAR check equivalent to EXPECT_EQUAL. Consider using EXPECT_DOUBLE_EQ instead.\n Note that EXPECT_DOUBLE_EQ doesn’t actually check for equality – it checks that the doubles are equal within four units in the last place (ULPs). See my  Comparing Floating Point Numbers post for details on this concept.\n My hope is that most software developers will see the new error message and be sent down the correct path, and I think that the googletest fix is ultimately more important than fixing the Chromium test.\n    This entry was posted in  Chromium,  Computers and Internet,  Floating Point and tagged  googletest,  precision. Bookmark the  permalink.", "posttime": "2020-10-12 20:51:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "错误,point,测试", "title": "浏览器中的浮点，第2部分：错误的Epsilon", "title_en": "Floating Point in the Browser, Part 2: Bad Epsilon", "transed": 1, "url": "https://randomascii.wordpress.com/2020/10/11/floating-point-in-the-browser-part-2-bad-epsilon/", "via": "", "real_tags": ["错误", "point", "测试"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1028257, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一些版本号系统只想给界面中的更改贴上标签，但在人类体验中，有很多东西都在这之外。有时一个版本只是一个数字，但有时我们真正想要的是一首诗。\nSemver有一个规范，但情感版本控制没有规范，而是一个指南；只是一些异想天开的建议。如果你使用情感版本控制，你不应该复制另一个情感版本控制系统。你应该做一些有创意和原创性的事情。你可以解释你创建的系统，如果通过理解它可以增强它的美感。你可以在那天即兴创作新的数字。唯一重要的是，版本号必须对您(作者)有意义。\n根据RFC2119中定义的“应该”、“不应该”、“可以”和“必须”的具体含义解释上一款是完全可选的。\n以下是一些使用感伤版本的项目。从他们的版本号表达项目无形方面的方式中汲取灵感，本身就是一件艺术品。\nJs就像一个叛逆的少年。它逃课，在朋克摇滚乐队演奏，但仍然得全A。它的版本系统很好地表达了它的双重性。版本号在偶数和奇数之间交替，在稳定和不稳定之间交替。在不稳定的版本中，snode制定自己的规则，并将其强加于人。在Stablversions中，Node在纹身上穿着长袖衬衫，在财富500强公司工作(从内部对抗体系？)。一些评论家说，Node现在是当权派的一部分，他们引用说，自从它的上一张专辑发布以来，已经有很长一段时间了，0.12版已经筹备了一年多。虽然这一指责可能有些分量，但你不能给创造力设定一个时间框架，而且你必须承认，Node对情感版本控制的使用是其内部冲突的一种美好表达。\nJeremy称他的版本控制系统是浪漫的(这是他非常多愁善感的)，它看起来像Semver(Major.minor.patch)，但具有个人意义。对他来说，补丁是你可能不会注意到的变化，而微小的变化是当你稍微改变它的时候。一个主要的变化是当你发布一个主要版本的时候(注意循环定义！)，一个主要的变化可以是任何事情，也可以是什么都不做。他说每一次改变都应该是向后兼容的。但是“向后兼容”对杰里米意味着什么呢？那由你来决定。杰里米对感伤版本的使用表达了“脊梁”是他的杰作，也表达了他是这部作品的主人。\n在他开创性的文本布局系统Tex和同样出色的字体设计系统METAFONT中，唐纳德使用了渐近完美的版本号系统。TeX Approachπ的版本号(当前版本是3.14159265)和METAFONT Approach的版本号e。有人预言，最后的改变要到唐老鸭乘着闪亮的云彩升入天堂的那一天之后才能做出。在这一点上，唐纳德将从天堂建立最后一次ssh连接到他在斯坦福大学的服务器，并将版本号精确地设置为π。在这一点上，所有剩余的bug都将被声明为Feature，并且TeX的输出将永远保持不变。\n无论发生什么，不是每个人都会理解你的意图，也许你的天才不会在你的有生之年得到认可。但我们选择这位艺术家的一生并不是为了名气，也肯定不是为了财富，而是为了追求美和自我表达的奉献。", "note_en": "Some version number systems aspire to merely label changesin an interface, but there is much in the human experiencethat lies outside of this. Sometimes a version is just a number,but sometimes what we really want is a  poem.\n Semver has a spec, but Sentimental Versioning has not a spec,but a guide; just some whimsical suggestions.If you use sentimental versioning you  should not copy anothersentimental versioning system. You  should do something creative and original.You  may explain the system you create, if the beauty is enhanced by understanding it.You  may just improvise new numbers from your moodon that day. The only important thing, is that the versionnumber  must be meaningful to you, the author.\n Interpreting the previous paragraph according to the specific meaningsdefined in  RFC2119 for  “should”,  “should not”,  “may”, and  “must” is entirely  optional.\n  Following are some projects that use sentimental versioning.Draw inspiration from the way their version numbersexpress intangible aspects of the project, and are a work of art on their own.\n   node.js is like a rebellious teenager. It skips classand plays in a punk rock band - yet still gets straight A’s.Its versioning system expresses its dual naturebeautifully. Version numbers alternate between even and odd,and between stable and unstable. In unstable versionsnode makes its own rules and sticks it to the man. In stableversions node wears a long sleeve shirt over its tattoosand works at fortune 500 companies (fighting the system fromthe inside?). Some critics say that node is part of theestablishment now, citing that it’s been a very long timesince its last album was released, version  0.12 havingbeen in the works for over a year. While this accusationmay carry some weight, you cannot put a time frame oncreativity, and you must admit that node’s use of sentimentalversioning is a beautiful expression of its own internal conflicts.\n   Jeremy calls his versioning system romantic(which is  very sentimental of him)It looks like semver ( major.minor.patch), but witha personal meaning. For him, a patch is a change youprobably won’t notice, and a minor change is when youchange it a little bit. A major change is when you makea major release (notice the circular definition!).A major change can be anything or nothing. He saysevery change  should be backwards compatible. But whatdoes “backwards compatible” mean to Jeremy? That isup to you to decide. Jeremy’s use of sentimental versioningexpresses how backbone is his masterpiece, and he, its master.\n   In his seminal text layout system, TeX, and his equallybrilliant typeface design system, METAFONT, Donald usesa versioning number system that asymptotically approachesperfection. The version numbers of TeX approach π (the current version is  3.14159265) and the version numbers ofMETAFONT approach  e. It has been prophesied that thelast change not be made until after the day Donald ascendsto heaven on a shining cloud. At that point, Donald willmake one last ssh connection down from heaven to his server atStanford University and set the version number unto π  exactly. At that point all remaining bugs will be declaredfeatures, and the output from TeX will remain the samefor all eternity.\n  What ever happens, not everyone will understand your intentions,possibly your genius will not be recognized within your lifetime.But we did not choose the life of the artist for fame and certainlynot for fortune - But rather, a dedication to aesthetic beauty andself expression.", "posttime": "2020-10-12 20:09:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "版本,sentimental", "title": "多愁善感的版本化", "title_en": "Sentimental Versioning", "transed": 1, "url": "http://sentimentalversioning.org", "via": "", "real_tags": ["版本"]}, {"category": "", "categoryclass": "", "imagename": "b81c746ab62b69da8ecd62ded888c067.jpeg", "infoid": 1028256, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "BIT是一个实验性的现代化GIT CLI，它构建在GIT之上，提供了令人愉快的缺省和其他细节：\n命令和标志建议，帮助您浏览git提供的过多选项。\nCURL-SF https://gobinaries.com/chriswalz/bit|sh；cURL-SF https://gobinaries.com/chriswalz/bit/bitcomplete|sh&amp；&amp；ECHO y|组件_安装=1位完成。\n注意事项：需要设置GOPATH和GOBIN。使用Go env验证。如果未设置，请将其添加到您的.bashrc或.bash_profile等文件中，然后打开新终端。\n您还可以访问所有git命令。以上命令可以覆盖90%的时间。\n自动提取快进功能，使您的分支保持最新状态并防止合并冲突(&A。\nBIT与GIT完全兼容。如果需要，GIT的所有功能都可用。\n感谢Gitless、Git-Extras、该领域的研究人员，当然还有Git本身的开发者！另外，多亏了Go-Prompt提供的交互式提示库", "note_en": "bit is an experimental modernized git CLI built on top of git that provides happy defaults and other niceties:\n command and  flag suggestions to help you navigate the plethora of options git provides you\n   curl -sf https://gobinaries.com/chriswalz/bit  | sh ;curl -sf https://gobinaries.com/chriswalz/bit/bitcomplete  | sh  &amp;&amp;  echo y  | COMP_INSTALL=1 bitcomplete\n  Caveats: GOPATH and GOBIN need to be set. Verify with  go env. If they are not set, add this to your .bashrc or .bash_profile etc. AND open new terminal\n                  You have access to ALL git commands as well. 90% of the time the above commands will have you covered.\n               Automatic fetching &amp; fast forwarding to keep your branches up to date and prevent merge conflicts\n   bit is  fully compatible with  git. All features of git are available if need be.\n          Thanks to  Gitless,  git-extras, researchers in the field and of course the developers of  git itself! Also, thanks to  go-prompt for the interactive prompt library", "posttime": "2020-10-12 19:43:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编写,modernized,git", "title": "BIT-用GO编写的现代化Git CLI", "title_en": "Bit – A modernized Git CLI written in Go", "transed": 1, "url": "https://github.com/chriswalz/bit", "via": "", "real_tags": ["编写", "git"]}, {"category": "", "categoryclass": "", "imagename": "3cd67f8c773c5df13d60d9d2e7f8918c.png", "infoid": 1028255, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们都熟悉传统的办公套件--文字处理器、电子表格、演示文稿程序，可能还有图表或笔记应用程序。我们已经在Microsoft Office和Google Docs中看到了这一切。它们真的很强大而且很大。但是，构建办公套件所需的最少代码量是多少呢？\n显然，我们的办公套件不会是桌面GUI应用程序--它们需要大量的代码和精力来构建。同样的情况也适用于本地移动应用程序。我们可能会考虑构建一个控制台(基于终端的)应用程序，实际上已经有了小得离谱的文本编辑器或电子表格，但是如果我们以浏览器为目标，事情会容易得多。\n浏览器已经提供了一个不错的富文本编辑器(可内容编辑)，并且对于数学表达式来说是非常好的(虽然不安全)求值器。\n是的，就是这样。此外，你可以把它变成一个独立的URL，当我需要一个便签簿来做快速笔记时，我就是这样用它的：\n尝试将其粘贴到您的地址栏中。如果您的浏览器很适合您，您应该能够使用Ctrl+B或Ctrl+I来使文本显示为粗体或斜体。\n我们可以通过添加一些样式来进一步增强它(是的，我相信一些小的排版改进很重要)：\n我已经将其添加到书签中，现在我的零权重文本编辑器离我只有一个按键的距离。您还可以将其用作粘贴文本甚至图片的临时剪贴板。\n当然，这可以进一步扩展以支持各种标题样式、列表或缩进。\n稍微压缩上面的代码并将其转换为数据URL将产生以下大约600字节长的富幻灯片编辑器：\n通过将幻灯片打印到文件中，可以将幻灯片导出为PDF，然后可以在任何计算机上显示幻灯片。\n不久前，我构建了https://onthesamepage.online，以便与其他人协作快速草拟想法，但尽管它很简单，但它仍然比我们这里所做的要大。\n至少，我们只能在画布上画线条。我们需要一个&lt；canvas&gt；元素、几个鼠标/触摸处理程序和一个标志，以指示在按下鼠标时鼠标移动实际上正在绘制。\n这里值得一提的是，具有id的元素可以作为window[id]或window.id进行访问。很长一段时间没有标准化的东西，一直是IE的黑客，现在已经成为标准了。\n另外，我将光标位置处理移动到单独的短函数，以便在MouseDown和Mousemove处理程序中重用它们。最后，我重置了Body元素的边距以使画布全屏显示。\n精简后的代码大约为400字节，允许您用鼠标绘图，不多也不少：\n&lt；Canvas id=&#34；v&#34；&gt；&lt；脚本&gt；d=文档，//文档d的快捷方式。身体。风格。边距=0，//重置样式f=0，//鼠标按下标志c=v。GetContext(&#34；2d&#34；)，//canvas context v.。Width=innerWidth，//使画布元素全屏v。Height=innerHeight，c.。Line Width=2，//将线条加宽x=e=&gt；e。客户端X||e。触及[0]。ClientX，//从鼠标获取X位置/触摸y=e=&gt；e。客户端Y||e。触及[0]。ClientY，//从鼠标获取Y位置/触摸d。Onousedown=d。Ontouch start=e=&gt；{f=1，e.。Prevention entDefault()，c.。Moveto(x(E)，y(E))，c.。EginPath()}，d。Onouse semove=d.。Ontouch chmobile=e=&gt；{f&amp；&amp；(c.。Line to(x(E)，y(E))，c.。笔划())}，d。OnMouseUp=d。Ontouch chend=e=&gt；f=0&lt；/script&gt；\n这可能是最复杂也是最大的一个，但我们将尽量保持在每个应用程序1KB的限制以下。\n布局会很简单。HTML附带表格，我们为什么不使用它们呢？由于电子表格单元格通常可以通过“字母”+“数字”寻址，因此让我们将表格限制为26x100个单元格。在循环中动态创建行和单元格是有意义的。一些基本的样式会让我们的电子表格看起来更漂亮：\n&lt；表ID=&#34；t&#34；&gt；t。风格。BorderColrapse=&#34；折叠&#34；；//删除(设i=0；i&lt；101；i++){const row=t.。Insert tRow(-1)；for(let j=0；j&lt；27；j++){//将列索引j转换为字母(&#34；A&#34；的字符代码为65)常量Letter=String。FromCharCode(65+j-1)；//1=A，2=B，3=C等常量单元格=ROW。插入单元格(-1)；单元格。风格。BORDER=&#34；1px纯银&#34；；//制作薄灰色边框单元格。风格。TextAlign=&#34；right&#34；；//右对齐，如excel if(i&gt；0&amp；&amp；j&gt；0){//添加可识别的输入字段，这里是公式输入常量字段=文档。CreateElement(&#39；input&#39；)；字段。ID=Letter+i；//即，&#34；B3&#34；单元格。AppendChild(Field)；}Else If(i&gt；0){//行号单元格。InnerHTML=i；}Else if(j&gt；0){//列字母单元格。InnerHTML=Letter；}。\n现在我们有一个由行和列组成的大型单元格网格。添加表达式计算器的时间到了。我们可以使用3个数组来实现一个复杂但主要有效的求值器-所有输入字段的数组(以获取其实际输入的值、数字或公式)，具有智能getter的数组，如果请求变量并且它链接到带有公式的输入字段，则调用eval()，以及每个字段最后输入的值的缓存：\nInput=[]；//假设我们为上述循环中的每个字段输入了puts.ush(Field)data={}；//智能数据访问objectcache={}；//cache//重新计算所有fieldsconst calc=()=&gt；{inputs.map(field=&gt；{try{field.value=D[field.id]；}catch(E){/*Ignore*/}})；}；//我们还需要自定义字段初始化代码：field.onocus=()=&gt；{//当元素被聚焦时-将其计算值替换为其公式字段。value=cache[field.id]||&#34；&#34；；}；field.onblur=()=&gt；{//当元素失去焦点时-将公式放入缓存中，并重新计算所有内容cache[field.id]=field.value；calc()；}；//字段的Smart getter如果需要dconst get=()=&gt；{letvalue=cache[field.id]||&#34；&#34；；If(value.chat At(0)==&#34；=&#34；){//使用&#34；with&#34；hack：with(Data)return eval(value.substring(1))；}Else{//原样返回值，如果可能，转换为数字：return isNaN(parseFloat(Value))？Value：parseFloat(Value)；}}；//将智能getter添加到大小写变量的数据数组中：Object.fineProperty(data，field.id，{get})，Object.fineProperty(data，field.id.toLowerCase()，{get})。\n现在电子表格应该可以工作了，例如，如果您将“42”放入A1，将“=A1+3”放入A2-当您将焦点从A2移开时，您应该会看到“45”。\n嗯，它绝对不能取代真正的办公套间。但它很好地展示了极简主义和微小的代码。所有这些应用程序都是昙花一现的，如果你刷新页面，它们就会失去它们的状态，而且看起来数据URL没有办法保持它们的状态。但是，如果你不需要打开繁重的“真正的”办公应用程序来计算几个比特或起草一些快速便条，它们作为快速书签可能会很有帮助。作为额外的好处，所有这些小应用最终都尊重你的隐私，不会分享你的数据(也不要存储数据)。\n因此，是的，与其说这是一个严肃的应用程序，不如说是一个玩笑，但我还是为这些小应用程序创建了一个repo，以防任何人想要使用它们或根据自己的需求进一步定制：http://github.com/zserge/awfice.。欢迎使用PRS和进一步改进！", "note_en": "We are all familiar with a traditional office suite - a word processor, a spreadsheet, a presentation program, maybe a diagramming or note-taking app. We have seen it all in Microsoft Office and Google Docs. Those are really powerful and large. But what would be the most minimal amount of code required to build an office suite?\n  Obviously, our office suite won’t be a desktop GUI app - those require plenty of code and efforts to build one. Same applies to native mobile apps. We might consider building a console (terminal-based) app, and in fact there are already absurdly small  text editors or  spreadsheets, but it would be much easier if we targeted a browser.\n Browsers already come with a decent rich-text editor (contenteditable) and are really good (although, unsafe)  evaluator for math expressions.\n     Yes, that’s it. Moreover, one can turn it into a self-contained URL and that’s how I use it when I need a scratchpad for quick notes:\n  Try pasting this into your URL bar. If your browser is nice with you, you should be able to use  Ctrl+B or  Ctrl+I to make text look bold or italic.\n We can enhance it a bit more by adding some style (yes, I believe that  some small typographic improvements matter):\n  I have added this to bookmarks and now my zero-weight text editor is one keypress away from me. You might also use it as a temporary clipboard to paste text or even pictures.\n Of course, this can be further extended to support various heading styles, lists or indentation.\n You can save your text by saving the whole HTML as a file, or by printing it on paper.\n  Some time ago I already made a  simple presentation tool, which is a self-contained HTML file that one can edit (like markdown text) and it will render in a colorful  Takahashi-style presentation.\n This time, as we continue talking about  contenteditable, we will make a WYSYWIG slide editor instead. First of all, let’s create several empty slides that are editable:\n &lt; body &gt;&lt; script &gt; for  ( let  i = 0 ;  i &lt; 50 ;  i ++ )  {  document . body . innerHTML  +=  `  &lt;div style=&#34;position:relative;width:90%;padding-top:60%;margin:5%;border:1px solid silver;page-break-after:always;&#34;&gt;  &lt;div contenteditable style=&#34;outline:none;position:absolute;right:10%;bottom:10%;left:10%;top:10%;font-size:5vmin;&#34;&gt;  &lt;/div&gt;  &lt;/div&gt;` ; } &lt;/ script &gt;\n The number of 50 is arbitrary, but I don’t remember ever using more slides than this. Each outer div is a slide with a thin outline. The trick with width and padding-top is to keep the slide aspect ratio. Try changing the values to see how that affects the layout. Each inner div is a basic rich text editor, with a fairly large font to be readable from the projector screen.\n Good enough. But we want to have headers and lists on our slides, don’t we?\n  document . querySelectorAll ( &#34;div&gt;div&#34; ). forEach ( el  =&gt;  {  el . onkeydown  =  e =&gt;  {  // `code` will be false if Ctrl or Alt are not pressed   // `code` will be 0..8 for numeric keys 1..9   // `code` will be some other numeric value if another key is pressed   // with Ctrl+Alt hold.   const  code  =  e . ctrlKey  &amp;&amp;  e . altKey  &amp;&amp;  e . keyCode - 49 ;  // Find the suitable rich text command, or undefined if the key   // is out of range   x  =  [ &#34;formatBlock&#34; ,  &#34;formatBlock&#34; ,  &#34;justifyLeft&#34; ,  &#34;justifyCenter&#34; ,  &#34;justifyRight&#34; ,  &#34;outdent&#34; ,  &#34;indent&#34; ,  &#34;insertUnorderedList&#34; ][ n ];  // Find command parameter (only for 1 and 2)   y  =  [ &#34;&lt;h1&gt;&#34; ,  &#34;&lt;div&gt;&#34; ][ n ];  // Send the command and the parameter (if any) to the editor   if  ( x )  {  document . execCommand ( x ,  false ,  y );  }  }; });\n Now if we press  Ctrl+Alt+1 inside the slide - we make the selected text a header. Or if we press  Ctrl+Alt+2 we turn it back to normal.  Ctrl+Alt+3.. Ctrl+Alt+5 change the alignment, and  6 and  7 change the indentation.  8 starts a list.  9 is left for your own needs, feel free to customize. The full list of  contenteditable operations can be found on  MDN.\n Squeezing the code above a little bit and turning it into a data URL would result in the following ~600 bytes long rich slide editor:\n  The slides can be exported to PDF by printing into the file, and from there could be shown on any computer.\n  A while ago I’ve built  https://onthesamepage.online to quickly sketch ideas in collaboration with other people, but despite its simplicity it’s still larger than what we do here.\n As a bare minimum, we can only draw lines on canvas. We need a  &lt;canvas&gt; elements, a few mouse/touch handlers and a flag to indicate that mouse movement is actually drawing when the mouse is pressed.\n Here worth mentioning that elements with an id can be accessed as window[id] or window.id. The thing that wasn’t standardized for a long time and has been a hack from IE, now has become a  standard.\n Also, I moved cursor position handling to separate short functions to reuse them in mousedown and mousemove handlers. Finally, I reset the margins of the body elements to make our canvas full screen.\n The minified code is roughly 400 bytes and allows you to draw with your mouse, nothing more, nothing less:\n &lt; canvas  id = &#34;v&#34; &gt; &lt; script &gt; d = document ,  // shortcut for document  d . body . style . margin = 0 ,  // reset style  f = 0 ,  // mouse-down flag  c = v . getContext ( &#34;2d&#34; ),  // canvas context  v . width = innerWidth ,  // make canvas element fullscreen  v . height = innerHeight , c . lineWidth = 2 ,  // make lines a bit wider  x = e =&gt; e . clientX || e . touches [ 0 ]. clientX ,  // get X position from mouse/touch  y = e =&gt; e . clientY || e . touches [ 0 ]. clientY ,  // get Y position from mouse/touch  d . onmousedown = d . ontouchstart = e =&gt;{ f = 1 , e . preventDefault (), c . moveTo ( x ( e ), y ( e )), c . beginPath ()}, d . onmousemove = d . ontouchmove = e =&gt;{ f &amp;&amp; ( c . lineTo ( x ( e ), y ( e )), c . stroke ())}, d . onmouseup = d . ontouchend = e =&gt; f = 0 &lt; /script&gt;\n    This would probably be the most complex one and the largest one, but we will try to stay below the limit of 1KB per app.\n The layout would be simple. HTML comes with tables, so why don’t we use them. As the spreadsheet cells are normally addressable by “letter” + “number”, let’s restrict our table to 26x100 cells. It makes sense to create rows and cells dynamically in a loop. Some basic styling would make our spreadsheet look nicer:\n &lt; table  id = &#34;t&#34; &gt; t . style . borderCollapse = &#34;collapse&#34; ;  // remove gaps between cells  for  ( let  i  =  0 ;  i  &lt;  101 ;  i ++ )  {  const  row  =  t . insertRow ( - 1 );  for  ( let  j  =  0 ;  j  &lt;  27 ;  j ++ )  {  // convert column index j to a letter (char code of &#34;A&#34; is 65)   const  letter  =  String . fromCharCode ( 65 + j - 1 );  // 1=A, 2=B, 3=C etc   const  cell  =  row . insertCell ( - 1 );  cell . style . border  =  &#34;1px solid silver&#34; ;  // make thin grey border   cell . style . textAlign  =  &#34;right&#34; ;  // right-align, like excel   if  ( i  &gt;  0  &amp;&amp;  j  &gt;  0 )  {  // add identifiable input field, this is where formula is entered   const  field  =  document . createElement ( &#39;input&#39; );  field . id  =  letter  +  i ;  // i.e, &#34;B3&#34;   cell . appendChild ( field );  }  else  if  ( i  &gt;  0 )  {  // Row numbers   cell . innerHTML  =  i ;  }  else  if  ( j  &gt;  0 )  {  // Column letters   cell . innerHTML  =  letter ;  }  } }\n Now we have a large grid of cells, with rows and columns. Time to add an expression evaluator. We can achieve a hacky, but mostly working evaluator with 3 arrays - an array of all input fields (to get their actual entered values, number or formulas), an array that has a smart getter, calling eval() if a variable is requested and it is linked to an input field with the formula, and a cache of the last entered values for each field:\n inputs = []; // assume that we did inputs.push(field) for each field in the loop abovedata = {}; // smart data accessing objectcache = {}; // cache// Re-calculate all fieldsconst calc = () =&gt; { inputs.map(field =&gt; { try { field.value = D[field.id]; } catch (e) { /* ignore */} });};// We also need to customize our field initialization code:field.onfocus = () =&gt; { // When element is focused - replace its calculated value with its formula field.value = cache[field.id] || &#34;&#34;;};field.onblur = () =&gt; { // When element loses focus - put formula in cache, and re-calculate everything cache[field.id] = field.value; calc();};// Smart getter for a field, evaluates formula if neededconst get = () =&gt; { let value = cache[field.id] || &#34;&#34;; if(value.chatAt(0) == &#34;=&#34;) { // evaluate the formula using &#34;with&#34; hack: with(data) return eval(value.substring(1)); } else { // return value as it is, convert to number if possible: return isNaN(parseFloat(value)) ? value : parseFloat(value); }};// Add smart getter to the data array for both upper and lower case variants:Object.defineProperty(data, field.id, {get}),Object.defineProperty(data, field.id.toLowerCase(), {get})\n Now the spreadsheet should work, if you put, for example, “42” into A1 and “=A1+3” into A2 - you should see “45” when you move the focus away from A2.\n    Well, in no way it’s a replacement for a proper office suite. But it’s a good demonstration of minimalism and tiny code. All these apps are ephemeral, they lose their state if you refresh the page and it looks like there is no way for data URLs to keep their state. But they might be helpful as quick bookmarks if you need to calculate a few bits or draft some quick note without opening heavy “real” office apps. As a bonus, all these tiny apps are ultimately respectful to your privacy and do no share your data (do not store it either).\n So, yes, it is more of a joke than a serious application, but still, I created a repo for these tiny apps in case anyone would like to use them or customize further for their own needs:  http://github.com/zserge/awfice. PRs and further improvements are welcome!\n I hope you’ve enjoyed this article. You can follow – and contribute to – on  Github,  Twitter or subscribe via  rss.", "posttime": "2020-10-12 19:31:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,套件,collection,gt", "title": "Awfice-小型办公套件应用程序的集合", "title_en": "Awfice – A collection of tiny office suite apps", "transed": 1, "url": "https://zserge.com/posts/awfice/", "via": "", "real_tags": ["程序", "套件", "gt"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1028253, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "USB-C时代已经到来。前几天，我把其他所有的线缆都扔进一个盒子里，买了一套USB-C转USB-C、Lightning和microUSB线缆。房子里的USB-C充电器，USB-C PD电源库，甚至还有一个漂亮的小USB-C基座，如果充电器能提供合适的电压，它就可以与任天堂开关配合使用。它光彩夺目。\n只有一样东西不会用USB-C充电，那是我的三星Chromebook 3，价格非常便宜(4 GB内存190美元)，当我想要Chrome OS平台的额外安全性时，我会用这台机器。取而代之的是，这款笔记本电脑使用老式的12V桶接头充电，迫使我随身携带一块额外的砖块。😢。\nUSB传统上提供5V的功率，但随着USB电源传输标准的引入，设备可以使用功能强大的电源块协商更高的电压。事实上，12V是一种选择，至少有几个我的充电器支持它。\n我们需要的是一个叫做USB-C PD触发器的小电路板，它可以与充电器协商特定的PD电压。有几个变种，包括有一个按钮来选择电压，但最常见的是一个微型电路板，带有一个名为ZYPDS的母式USB-C连接器。\n它们如此便宜，以至于我怀疑笔记本电脑不随附的原因是：1)它需要一个能够提供特定电压的充电器，而人们已经对USB-C感到困惑；2)USB-C充电器可能更贵。\n它们通常支持15V/20V(通过焊接电桥来选择)，虽然我怀疑15V也可以工作，但我在eBay上找到了一个声称9V/12V。它具有相同的型号名称，但PCB颜色不同。太棒了！\n这个东西足够小，可以装进电缆(甚至笔记本电脑，但我想尽量保持它的非侵入性)，所以我还买了一根带桶连接器的短电缆，还有一些热收缩管。\n当它到达时，它已经配置为12V，并或多或少地当场交付。\n唯一棘手的事情是弄清楚电缆和连接器的极性。我了解到连接器的极性是充电器上的标记，看起来有点像⊖--C--⊕，通常桶的外表面是负极。我用万用表连续模式找出了连接到外表面的是哪根线。\n一次平庸的焊接工作之后，我有了一个从USB-C到桶式连接器的短适配器。\n唯一的问题是，我拿到的枪管接头并不完全适合笔记本电脑，所以如果不向下拉，它就会失去连接。知道设置正常后，我就切断了股票充电器，改用它的连接器。这是更烦人的焊接，因为它是同心电缆，但它工作得很好。\n有了热收缩管，它看起来甚至不会那么糟糕，而且肯定比随身携带一个额外的充电器要好！(顺便说一句，热收缩管非常棒。)", "note_en": "The era of USB-C has come. The other day I threw all other cables into a box, and bought a set of USB-C to USB-C, Lightning, and microUSB cables. USB-C chargers around the house, USB-C PD power bank, even a nice small USB-C dock that works with the Nintendo Switch if the charger can do the right voltage. It&#39;s glorious.\n Only one thing won&#39;t charge with USB-C, my awfully cheap ($190 for 4GB of RAM) Samsung Chromebook 3, a machine I use when I want the extra security of the Chrome OS platform. Instead, this laptop charges from an old-school 12V barrel connector, forcing me to carry around an extra brick. 😢\n  USB traditionally delivers 5V of power, but with the introduction of the USB Power Delivery standard, devices can negotiate higher voltages with capable power bricks. Indeed, 12V is an option, and at least a couple of my chargers support it.\n   What we need is called a &#34;USB-C PD trigger&#34;, a little board that negotiates a specific PD voltage with a charger. There are a few variants, including ones with a button to select the voltage, but the most common one is a tiny board with a female USB-C connector called ZYPDS.\n They are so cheap that I suspect the reason the laptops don&#39;t come with them is that 1) it requires a charger that can deliver that specific voltage, and people are already confused enough by USB-C and 2) the USB-C charger side is probably more expensive.\n They usually support 15V/20V (selected by soldering a bridge), and while I suspect 15V would have worked too, I found one on eBay claiming 9V/12V. It has the same model name, but a different PCB color. Perfect!\n  This thing is small enough to fit in a cable (or even in the laptop, but I wanted to keep this as uninvasive as possible) so I also got a short cable with a barrel connector, and some heat shrink tubing.\n When it arrived it was already configured for 12V, and delivered more or less on the spot.\n  The only tricky thing was figuring out the polarity of the cable and the connector. I learned that the polarity of the connector is the marking on the charger that looks a little like  ⊖--Ｃ●--⊕, and commonly the outer surface of the barrel is the negative. I figured out which wire connected to the outer surface with the multimeter continuity mode.\n  A mediocre soldering job later I had a short adaptor from USB-C to a barrel connector.\n    The only snag was that the barrel connector I got wasn&#39;t a perfect fit for the laptop, so it would lose connection if not pulled downwards. Knowing the setup worked, I just cut the stock charger and used its connector instead. It was more annoying to solder because it&#39;s a concentric cable, but it works perfectly.\n With the heat shrink tubing on it doesn&#39;t even look that bad, and definitely beats carrying an extra charger around! (By the way, heat shrink tubing is amazing.)", "posttime": "2020-10-12 19:20:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "chrome,破解,usb", "title": "破解USB-C充电器打造廉价Chromebook", "title_en": "Hacking together a USB-C charger for a cheap Chromebook", "transed": 1, "url": "https://blog.filippo.io/usb-c-charger-for-a-cheap-chromebook/", "via": "", "real_tags": ["chrome", "破解", "usb"]}, {"category": "", "categoryclass": "", "imagename": "7e20952679bcbbfd0a0b55865dc36c90.png", "infoid": 1028252, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "豪尔赫·路易斯·博尔赫斯(Jorge Luis Borges)曾写道，一个帝国的“制图艺术达到了如此完美的程度，以至于单个省份的地图占据了整个城市，而帝国的地图占据了整个省份。”但仍不满意，“制图员行会绘制了一幅帝国地图，其大小与帝国的大小不谋而合。”但当后人失去了祖先对地图绘制的痴迷时，他们判断道：“浩瀚的地图毫无用处，不无怜悯之心，他们把它送到了孙中山和温特斯的陡峭之处。”凭借这张巨大的地图，尽管其精确度出奇地高，但被抛弃的、较小的、不完美的地图大概再次赢得了这一天的胜利。\n博尔赫斯用那个广为人知的故事“论科学的精确度”，通过想象一幅真正正确的地图的荒谬之处，阐明了所有地图都是错误的这一观点。Vox的视频“为什么所有的世界地图都是错的”涵盖了一些相同的领域，可以说，它首先通过剖开一个充气地球仪来说明这一想法，并试图让由此产生的塑料烂摊子平躺起来，但徒劳无功。\n“这就是制图者永恒的两难境地，”主持人在画外音中说，屏幕上的斗争仍在继续。“如果没有某种形式的扭曲，球体的表面就不能表示为平面。”因此，人类所有的纸质世界地图-在将球体表面变成平面的任务中，需要使用一种名为“投影”的技术-从定义上扭曲了地理现实。\n自16世纪佛兰芒制图师Gerardus Mercator发明以来，墨卡托投影系统已经制作了最广为人知的世界地图。(如果你在美国长大，几乎可以肯定的是，你会在教室里花很多时间盯着墨卡托地图。)但我们很难生活在他那个时代的限制下，也不是20世纪40年代博尔赫斯想象他的陆地大小的地图时的限制。在我们进入21世纪后，基于卫星的全球定位系统(Global Positioning System)已经“消除了将纸质地图作为海上和天空导航手段的需要”，但即便如此，“大多数网络地图工具，如谷歌地图(Google Maps)，都使用墨卡托(Mercator)”，因为它“能够保持形状和角度”，“使城市的特写视图更准确”。\n在城市的规模上，用更博尔吉斯的话说--可能是在一个省甚至帝国的规模上-墨卡托投影仍然运作得很好。“但事实仍然是，没有正确的预测。地图学家和数学家已经创建了一个巨大的可用投影库，每个投影库都对地球有一个新的视角，每个投影库都对不同的任务有用。你可以在这里自己比较和对比其中的几个，或者在这里仔细看看墨卡托投影的一些大小扭曲(例如，使格陵兰看起来和整个非洲一样大)。与博尔赫斯的世界不同，这些挑战和其他挑战一直在地理学科中保持着忙碌的状态，即使在今天也是如此。\n科林·马歇尔(Colin Marshall)常驻首尔，撰写并广播关于城市和文化的文章。他正在撰写一本关于洛杉矶的书，他正在撰写一本关于洛杉矶的书，这是一部关于电影院中的城市的视频系列，还包括美国众筹的新闻项目“未来的城市在哪里？”，以及“洛杉矶书评”(The Los Angeles Review Of Books)的韩国博客。我们可以在推特上关注他，电子邮件地址是：@colinmarshire，或者是在脸谱网上关注他。", "note_en": "Jorge Luis Borges once wrote of an empire wherein “the Art of Cartography attained such Perfection that the map of a single Province occupied the entirety of a City, and the map of the Empire, the entirety of a Province.” Still unsatisfied, “the Cartographers Guilds struck a Map of the Empire whose size was that of the Empire, and which coincided point for point with it.” But posterity, when they lost their ancestors’ obsession for cartography, judged “that vast Map was Useless, and not without some Pitilessness was it, that they delivered it up to the Inclemencies of Sun and Winters.” With that enormous map, in all its singular accuracy, cast out, smaller, imperfect ones presumably won the day again.\n With that well-known story  “On Exactitude in Science,” Borges illustrated the idea that all maps are wrong by imagining the preposterousness of a truly correct one. The Vox video  “Why All World Maps Are Wrong” covers some of the same territory, as it were, first illustrating that idea by slitting open an inflatable globe and trying, futilely, to get the resulting plastic mess to lie flat.\n  “That right there is the eternal dilemma of mapmakers,” says the host in voiceover as the struggle continues onscreen. “The surface of a sphere cannot be represented as a plane without some form of distortion.” As a result, all of humanity’s paper maps of the world–which in the task of turning the surface of a sphere into a flat plane need to use a technique called “projection”–distort geographical reality by definition.\n The  Mercator projection has, since its invention by sixteenth-century Flemish cartographer  Gerardus Mercator, produced the most widely-seen world maps. (If you grew up in America, you almost certainly spent a lot of time staring at Mercator maps in the classroom.) But we hardly live under the limitations of his day, nor those of the 1940s when Borges imagined his land-sized map. In our 21st century, the satellite-based Global Positioning System has “wiped out the need for paper maps as a means of navigating both the sea and the sky,” but even so, “most web mapping tools, like Google Maps, use the Mercator” due to its “ability to preserve shape and angles,” which “makes close-up views of cities more accurate.”\n On the scale of a City, in more Borgesian words — and probably on the scale of a Province and even the Empire — Mercator projection still works just fine. “But the fact remains that there’s no right projection. Cartographers and mathematicians have created a huge library of available projections, each with a new perspective on the planet, and each useful for a different task.” You can compare and contrast a few of them for yourself  here, or take a closer look of some of the Mercator projection’s size distortions (making Greenland, for example, look as big as the whole of Africa)  here. These challenges and others have kept the Disciplines of Geography, unlike in Borges’ world, busy even today.\n       Based in Seoul,   Colin Marshall  writes and broadcasts on cities and culture. He’s at work on a book about Los Angeles,  A Los Angeles Primer , the video series  The City in Cinema,   the crowdfunded journalism project  Where Is the City of the Future? , and the Los Angeles Review of Books’   Korea Blog.   Follow him on Twitter at   @colinmarshall  or on   Faceboo k .", "posttime": "2020-10-12 19:15:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "世界地图,accurate,地图", "title": "为什么制作精确的世界地图在数学上是不可能的", "title_en": "Why Making Accurate World Maps Is Mathematically Impossible", "transed": 1, "url": "https://www.openculture.com/2016/12/why-making-accurate-world-maps-is-mathematically-impossible.html", "via": "", "real_tags": ["世界地图", "accurate", "地图"]}, {"category": "", "categoryclass": "", "imagename": "1a19830f6e036521ead5ddbd6f25b2b6.png", "infoid": 1028250, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软副总裁兼副总法律顾问Rima Alaely宣布了该公司针对Windows上的Microsoft Store的10条原则：\n我们和其他人提出了问题，有时还表达了对其他数字平台上的应用程序商店的担忧。然而，我们认识到我们应该言行一致。因此，今天，我们在应用程序公平联盟(CAF) - 的想法和工作的基础上采用了10条原则 - ，以促进选择、确保公平和促进Windows10的创新，Windows10是我们最受欢迎的平台，我们自己的微软商店也在Windows10上。\n1.开发者可以自由选择是否通过我们的应用商店发布他们的Windows版应用。我们不会阻止Windows上的竞争应用商店。\n2.我们不会根据开发者的商业模式或如何交付内容和服务(包括内容是安装在设备上还是从云端流媒体)来屏蔽Windows应用。\n我们当然希望将我们的Xbox Game Pass流媒体游戏集成到iOS上的单一应用程序中。\n我们不会根据开发者选择使用哪种支付系统来处理在其应用程序中进行的购买，来阻止来自Windows的应用程序。\n我们肯定想取消苹果在iOS版Office应用中的应用内支付。你他妈的能相信我们要把他们分到这些订阅费里吗？\n我们还在Xbox控制台上经营一家商店。我们有理由问，为什么我们今天不把这些原则也应用于Xboxstore。\n虽然他们深受粉丝喜爱，但在市场上PC和手机的数量远远超过他们。\n游戏机的商业模式与围绕PC或手机的生态系统非常不同。微软(Microsoft)等游戏机制造商在开发专用游戏机硬件方面投入了大量资金，但以低于成本或非常低的利润率出售，以创造一个游戏开发商和发行商都能从中受益的市场。\n考虑到平台和商业模式在意义上的这些根本差异，我们有更多的工作要做，才能为游戏机建立一套正确的原则。\n我们认为，就如何公平平衡软件开发人员和平台所有者的利益，以及在我们最受欢迎的平台上应用程序商店的最佳前进道路进行公开讨论是很重要的。\n我们知道可能性很小，但我们希望凝聚公众舆论，要求苹果像PC平台一样运行iOS。\n应用程序在数十亿消费者的日常生活中发挥着重要作用，并帮助数十亿企业实现现代数字经济。\n这里有很多钱处于危险之中，我们在电话平台上的尝试真的把它搞砸了。\n我们知道，监管机构和政策制定者正在审查这些问题，并考虑进行法律改革，以促进数字市场的竞争和创新。我们认为CAF原则及其实施可以作为富有成效的例子。将这些原则应用到Windows 10上的Microsoft应用商店是第一步，我们期待着来自开发人员和更广泛社区的反馈。\nWindows没有任何变化，它仍然保持着一如既往的开放。Xbox没有什么变化，它仍然像以前一样封闭(实际上它甚至比iOS还要封闭得多)。但我们肯定希望政府监管机构会迫使苹果开放iOS，并将其更像一个PC平台，让第三方开发者可以自由地做他们想做的事情，因为我们知道苹果不会自愿这么做，因为如果我们是他们，我们也不会这样做。", "note_en": "Rima Alaily, Microsoft vice president and deputy general counsel,  announcing the company’s 10 principles for the Microsoft Store on Windows:\n We and others have raised questions and, at times, expressedconcerns about app stores on other digital platforms. However, werecognize that we should practice what we preach. So, today, weare adopting 10 principles — building on the ideas and work ofthe  Coalition for App Fairness (CAF) — to promote choice,ensure fairness and promote innovation on Windows 10, our mostpopular platform, and our own Microsoft Store on Windows 10.\n  1. Developers will have the freedom to choose whether to distribute their apps for Windows through our app store. We will not block competing app stores on Windows.\n  2. We will not block an app from Windows based on a developer’s business model or how it delivers content and services, including whether content is installed on a device or streamed from the cloud.\n We would sure like to get our Xbox Game Pass streaming games into a single app on iOS.\n We will not block an app from Windows based on a developer’schoice of which payment system to use for processing purchasesmade in its app.\n We would sure like to drop Apple’s in-app payments from our Office apps for iOS. Can you even fucking believe we have to cut them in on these subscriptions?\n   We also operate a store on the Xbox console. It’s reasonable toask why we are not also applying these principles to that Xboxstore today.\n    Though well-loved by their fans, they are vastlyoutnumbered in the marketplace by PCs and phones.\n  And the business model for game consoles is very different to theecosystem around PCs or phones. Console makers such as Microsoftinvest significantly in developing dedicated console hardware butsell them below cost or at very low margins to create a marketthat game developers and publishers can benefit from.\n  Given these fundamental differences in the significance of theplatform and the business model, we have more work to do toestablish the right set of principles for game consoles.\n  We think it is important to have a public discussion about how tofairly balance the interests of software developers and platformowners and the best path forward for app stores on our mostpopular platforms.\n We know it’s a long shot but we’re hoping to rally public opinion to demand that Apple run iOS like a PC platform.\n Apps play an important role in the daily lives of billions ofconsumers and help to enable the modern digital economy formillions of businesses.\n There’s a lot of money at stake here and we really blew it with our attempts at a phone platform.\n We know that regulators and policymakers are reviewing theseissues and considering legal reforms to promote competition andinnovation in digital markets. We think the CAF principles, andour implementation of them, can serve as productive examples.Applying these principles to the Microsoft Store on Windows 10 isa first step and we look forward to feedback from developers andthe broader community.\n Nothing is changing on Windows, which remains every bit as open as it always has been. Nothing is changing on Xbox, which remains every bit as closed as it always has been (which is actually quite a bit more closed than even iOS). But we’re sure hoping government regulators will force Apple to open up iOS and treat it more like a PC platform where third-party developers are free to do what they want, because we know Apple won’t do it of their own volition because we wouldn’t either if we were them.", "posttime": "2020-10-12 17:51:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,微软,windows,应用", "title": "格鲁伯谈“Windows上微软商店的10条原则”", "title_en": "Gruber on ‘10 Principles for the Microsoft Store on Windows’", "transed": 1, "url": "https://daringfireball.net/2020/10/microsoft_principles_translation", "via": "", "real_tags": ["microsoft", "微软", "windows", "应用"]}, {"category": "", "categoryclass": "", "imagename": "09f10a44ded3dbdaeadf0b37d8943e94.jpeg", "infoid": 1028249, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个男人写了一本书。他觉得，这是一种“一种倾吐”，是出于“让他唱歌或试图与所有美丽的女士上床”的同一种冲动写的。但随后评论家指责这本书不是很棒。\n你不想变得伟大。你只是想写一本书，让人们读一读……。我不认为我会对不利的批评发脾气。但是，你知道吗，你永远无法克服故意残忍和破坏性的攻击伤害你的感情的能力。即使你知道为什么要发动袭击，它仍然很痛。\n这些话出自1953年的一封感谢信，51岁的约翰·斯坦贝克(John Steinbeck)给一名本科生寄去了一封感谢信，这名大学生写了一篇关于“愤怒的葡萄”(Grapes Of Wrath)的热情论文，这本书在1939年让斯坦贝克成为国际名人；然而，事情的真相要复杂得多。就在写这封信的那一刻，不利的批评仍然可能使斯坦贝克陷入沮丧的愤怒之中；同时，积极的批评对他几乎没有作用。\n在漫长的写作生涯中，斯坦贝克赢得了许多奖项，其中包括普利策奖，然后值得注意的是，诺贝尔奖，但无论有多少评论家和数百万读者宣布他为国宝，他不仅对那些拒绝向他授予他渴望的荣誉的人大发雷霆，而且当这些荣誉来到他面前时，他也对这些荣誉嗤之以鼻。正如他最新的传记作家威廉·苏德(William Souder)在“疯狂的世界”(Mad At The World)中告诉我们的那样，他讨厌自己的名声，讨厌公开露面，但最主要的是，他讨厌那些粉丝，他们和他的批评者一样，“称赞他的作品，但不理解它。”\n斯坦贝克的灵魂非常不自在：多年来，他无法从容不迫地接受赞扬和指责。焦虑是他的中间名。苏德传记中最痛苦的两句话告诉我们，“当他读完一本书，知道这本书不好的时候，这并不是让他烦恼的事情。让他苦恼的是，他知道自己不可能把事情做得更好。“。“折磨”可能比“烦恼”更合适。斯坦贝克几乎是一种典型的抑郁症，他经历了“随着年龄的增长，在满足和绝望之间无休止的斗争，这种斗争变得更加明显”，迫使他一再屈从于一种黑色的需要，即“从人际联系中撤退，这将接近于痴迷”。简而言之：斯坦贝克本人与书中的斯坦贝克截然相反，在书中，叙述者的潜在请求几乎都是所有人类都能在彼此身上认识到自己。\n艺术家和艺术之间的这种自我划分是否令人惊讶？有多少成千上万的人见过他们钦佩的一本书的作者，但离开时都会想，“他和他的作品一点也不像。”作家几乎从来都不是这样的。很简单，在大多数情况下，最好的作家-也就是控制材料的人-进入写作，而他的其余部分-也就是普通的日常自我-表现出困扰我们所有人的未解决冲突中固有的卑鄙和困惑。在约翰·斯坦贝克身上，差异比现实更大。\n约翰·斯坦贝克(John Steinbeck)于1902年出生在加利福尼亚州萨利纳斯镇(Salinas)的一个世界上农业最肥沃的山谷的入海口，距离太平洋海岸城市蒙特利约19英里。他家境贫寒(他的父亲是当地的一名公务员)，人们期望他能在中产阶级的阶梯上爬上两三个档次。但是，当他高中毕业后进入斯坦福大学时，很快就变得很清楚，他永远不会继续学习学术课程。他腋下夹着50个故事来到学校，他想做的就是写作。多年来，他在学校进进出出，1925年回到南加州，在那里他开始打零工-导游、体力劳动者、房产管理员，任何能让食物和书写纸摆在桌面上的工作-而他写的故事大多没有什么名气，也没有发表，但还是写了下来。1930年，他嫁给了卡罗尔·亨宁(Carol Henning)，一个20多岁的伙伴，从他们相遇的那一刻起就对他充满了热情。他们一起开始了一种半波西米亚式的生活，主要是在蒙特利及其周边地区，相互奉献-卡罗尔被证明是一个有天赋的编辑-让约翰的才华大放异彩。\n从一开始，斯坦贝克就知道在哪里可以找到他的原材料，以及他应该如何应对。小时候，他住在萨利纳斯山谷，夏天在移民身边工作，这些移民从事繁重的劳动，当季采摘水果和蔬菜。他亲眼目睹了他们生活所遭受的社会和经济剥削，他们的严酷状况似乎深深地刺痛了他。“作为一个成年人，”苏德告诉我们，“约翰会说，他不能忍受的一件事是另一个人被任何更有权势的人压迫、虐待或利用，特别是如果动机是贪婪的话。”曾经的油脂\n不可否认，斯坦贝克的许多书都用奥基-阿基方言演讲，长达数百页，其间穿插着那种让特里·蒂奇奥特(Terry Tachout)曾经宣称他的作品是“带训练轮的文学”的说教。尽管如此，斯坦贝克的小说每年仍有数十万册的销量，而且他所有的书都在印刷中。特别是高中生，他们仍然觉得他是一位讲故事的大师，可以让他们感受到生活的奇妙之处。\n洒在斯坦贝克身上的印刷品数量足以填满一片海洋：回忆录、社会史、学位论文、院子里的传记。当然，到目前为止，支持和反对他作为一位重要的美国作家的理由已经足够充分了。所以摆在我们面前的问题是：我们还需要另一本斯坦贝克的传记吗？如果需要，那么苏德的传记就是我们需要的吗？对于这位评论家来说，答案是否定的，至少在第二种情况下是这样。\n在他的作品中，斯坦贝克是那些没有能力要求根本尊重的人的同情心编年史，而他本人的行为往往是对他宣称的价值观的嘲弄。几十年来，他表现出暴力、忧郁、酗酒的行为，其他人为此付出了沉重的代价。作为一名丈夫，他的不忠让人上瘾，他犯下了一连串的不忠行为，从未满足过，也从未减弱过。他的第二任妻子写了一本回忆录，指责他有低级虐待狂；她说，他有一只宠物老鼠，他会把它放到一屋子的访客中，高兴地看着房间里的歇斯底里情绪加剧。至于为人父，这里有一个斯坦贝克为人父母的例子：\n约翰四世三岁左右的时候，有一次，他让斯坦贝克训练有素的牧羊犬进入公寓。狗在地板上拉屎。当斯坦贝克发现乱七八糟的东西时，他抓住那个男孩，用它揉了揉脸。…。约翰四世后来会说，他童年最大的顿悟是意识到他的父亲是个混蛋。\n读者-更好的是，让我说这位读者-想在斯坦贝克的新传记中看到的是在那份骨架报告上的肉体：对自我毁灭的探索，将斯坦贝克的内心混乱从仅仅是偶然的情况中拯救出来，让它如此不可磨灭地印在读者的感觉记忆中，以至于从这一刻起，他的书读起来就不同了。这并不是说苏德需要对斯坦贝克的行为极端进行精神分析；相反，他只需要用为散文增添质感的那种积累的深度来说明它们。然而，他并没有这样做。\n奇怪的是，我认为苏德没有深入挖掘的原因之一是，他自己对斯坦贝克的感觉似乎是矛盾的。例如，即使当他详述一段对斯坦贝克显然很重要的关系时，他也不能全心全意地接受一种将被证明具有启发性的解释。相反，我们得到了一些停顿的东西，甚至是含沙射影的东西，这让苏德和读者都感到道德上的困惑，如果不是彻底的怀疑的话。例如，在斯坦福大学期间，斯坦贝克与一位名叫凯特·贝斯威克(Kate Beswick)的女子交了一位写作朋友，他们有过一段短暂的、灾难性的恋情。这段友谊之所以延续了下来，是因为凯特是他作品的无价读者，多年来--当然是在他二十几岁的时候--他把手稿寄给了她。在他写给她的信中，他还(“耸人听闻地，”苏德告诉我们)包括了他现在的性冒险经历，对苏德来说，这清楚地表明了“斯坦贝克自然而然地变得”粗俗“。”究竟是她鼓励了他，还是他对曾经的大学恋人缺乏正义感，很难说。“。苏德接着说：\n斯坦贝克迫切需要将他的生活细节与凯特·贝斯威克联系起来，这一点值得注意。他告诉她...。不知何故，他获得了一种新的性能力……。他说，他现在可以在他“想要”的任何时候达到高潮，无论是30秒还是30分钟。他提醒贝斯威克，当他们还是情侣时，他在这方面的控制力很差……。为什么斯坦贝克一直告诉贝斯威克这样的事情，无法用任何方式来解释，让它看起来没什么问题。这简直是他的天性。\n这只是他的天性…。…自然产生的粗糙。无论是她鼓励他还是他只是缺乏正派的感觉…。他为什么一直跟贝斯威克说这样的事，这看起来没什么大不了的。这些都是苏德用来代替对斯坦贝克终生的性焦虑的分析(没有一个花花公子是没有的)。相反，我们得到的是知识的空白，加上一大堆荒谬的说教(确实是任何正派的感觉！)。而且--这本书既不是第一次，也不是最后一次--一些非常糟糕的写作。\n在一篇长篇文章中，苏德详细描述了斯坦贝克对形而上学理论的兴趣与日俱增，他确信这些理论是深刻的-他认为“生活世界是有机体之间的合作努力”，“很难决定这一切是胡说八道，还是会为20世纪几本最受尊敬的书注入生命的感性思想核心。”我知道我能做出什么决定：斯坦贝克的理论既不精彩，也不值钱，但一个试图用“胡说八道”来评估其知识内容价值的传记作家是疲惫的。\n几年前，苏德为雷切尔·卡森写了一本不同凡响的传记，展示了对他的主题的富有想象力的把握，因为他是如此充满感情，这就是为什么她值得写出来的原因。他对卡森的钦佩--明确、简单、应得的--直接源于他与她存在的特征正直的牢固联系。和卡森在一起，生活、工作、女人都是一体的，每一个元素都很容易对其他元素负责。约翰·斯坦贝克是一个完全不同的动物：一个被焦虑弄得四分五裂的人，这些焦虑不仅一再将他与他的密友和物理环境分开，而且与他经常遗弃的某种必要的自信感分开。他可以足够成功地对抗他的恶魔，写出30年代的伟大小说，当时，我怀疑，世界给了他充分的反思，他自己的失落感和被遗弃的感觉；后来，他们带着复仇回来了。这就是斯坦贝克，不知何故避开了苏德的深度接触能力。如果能更好地了解他会很有趣的。", "note_en": "A man writes a book. It is, he feels, “a kind of outpouring,” written from the same impulse “that makes him sing or try to go to bed with all beautiful ladies.” But then the critics blame the book for not being great.\n You didn’t want to be great. You just wanted to write a book and have people read it.... I don’t think I am ill tempered about adverse criticism.... But, do you know, you never get over the ability to have your feelings hurt by deliberately cruel and destructive attacks. Even if you know why the attack was made, it still hurts.\n  These words come from a  1953 letter of gratitude that John Steinbeck, aged 51, sent an undergraduate who’d written an enthusiastic paper on   The Grapes of Wrath, the book that in 1939 made Steinbeck an international celebrity; the truth of the matter, however, was a bit more complicated. At the very moment the letter was written, adverse criticism could still send Steinbeck into paroxysms of frustrated anger; at the same time, positive criticism did little or nothing for him.\n Over the course of a long writing life, Steinbeck had won many prizes, among them the Pulitzer and then, remarkably enough, the Nobel, but no matter how many hundreds of critics and millions of readers declared him a national treasure, he not only raged at those who refused to extend him the accolades he hungered for, he scorned those very accolades when they came his way. As his newest biographer, William Souder, tells us in   Mad at the World , he hated his fame, he hated public appearances, but mostly he hated the fans who, like his critics, “praised his work but didn’t understand it.”\n Steinbeck’s was a soul profoundly ill at ease with itself: The ability to take praise as well as blame in his stride eluded him throughout the years. Angst was his middle name. Two of the most painful sentences in Souder’s biography tell us that “when he finished a book and knew it wasn’t good that wasn’t what bothered him. What bothered him was knowing that he couldn’t have made it better.” “Tormented” may be a better word than “bothered.” Very nearly a classic depressive, Steinbeck endured “a ceaseless struggle between contentment and despair that grew more pronounced as he got older,” driving him repeatedly to succumb to a black need to retreat from human connection “that would come to border on obsession.” In short: Steinbeck, in the flesh, was very much the opposite of Steinbeck on the page, where the narrator’s underlying plea, almost invariably, is that all human beings recognize themselves in one another.\n Do such self-divisions between the artist and the art come as a surprise? How many thousands of people have met the writer of a book they’ve admired, only to come away thinking, “He’s nothing like his writing.” A writer hardly ever is. It’s simply that in most cases the best of the writer—that is, the person in control of the material—goes into the writing, while the rest of him—that is, the ordinary everyday self—acts out all the meanness and confusion inherent in the unresolved conflicts that dog us all. With John Steinbeck, the discrepancies were larger than life.\n  John Steinbeck was born in 1902, at the mouth of one of the most agriculturally fertile valleys in the world, in the town of Salinas, California, some 19 miles inland from the Pacific Coast city of Monterey. He grew up in modest circumstances (his father was a local civil servant), and was expected to achieve a life two or three notches up the middle-class ladder. But, when he enrolled after high school at Stanford University, it soon became clear that he would never stay the academic course. He’d arrived at school with 50 stories under his arm, and all he wanted to do was write. For years, he bounced in and out of school, returning in 1925 to Southern California, where he began working at odd jobs—tour guide, manual laborer, estate caretaker, anything that would put food and writing paper on the table—while he wrote stories that for the most part went undistinguished and unpublished, but nonetheless got written. In 1930, he married Carol Henning, a twentysomething fellow spirit who believed passionately in him from the moment they met, and together they embarked on a semi-bohemian existence, mainly in and around Monterey, mutually devoted—Carol proved a gifted editor—to the flowering of John’s talent.\n From the start, Steinbeck knew where his raw material was to be found and how he was to respond to it. As a boy, living in the Salinas Valley and working summers beside the migrants who performed the backbreaking labor of picking fruit and vegetables in season, he had seen firsthand the social and economic exploitation to which their lives were yoked, and the starkness of their condition seemed to penetrate him. “As an adult,” Souder tells us, “John would say that the one thing he could not bear was another human being oppressed, abused, or taken advantage of by anyone more powerful, especially if the motive was greed.” Once the Great Depression overwhelmed the country, people of almost every stripe and condition began to feel haunted by the astonishing multiplication of the human sacrifice that Steinbeck had observed at home in ordinary times, and were drawn to the bitter realities of the migrants’ lives. Then came the Dust Bowl disaster, and the spectacle of thousands of dispossessed sharecroppers on the road, streaming west across Route 66 like refugees fleeing a foreign invasion. Steinbeck’s moment had come.\n He was a regional writer with a bent toward social realism, but at the height of his literary powers in the mid-’30s, the work Steinbeck produced—and this is what has saved him from literary oblivion—was so thoroughly encased in a kind of narrative tenderness for its subject that it often seemed to rise above the limitations of the genre writing with which he was associated. There’s a scene in  The Grapes of Wrath that is pure Steinbeck. The Joads and their friends are being expelled from one of the migrant camps by the local police, but one of their number is a dying woman whose husband refuses to go on without her. The woman asks the Preacher to say a prayer over her, and when he hesitates (because he is excommunicated), she reassures him:\n When I was a little girl I use’ ta sing. Folks roun’ about use’ ta say I sang as good as Jenny Lind. Folks use’ ta come an’ listen when I sung. An’—when they stood—an’ me a-singin’, why, me an’ them was together more’n you could ever know. I was thankful. There ain’t so many folks can feel so full up, so close, an’ them folks standin’ there an’ me a-singin’.... They wasn’t nothin’ got in between me an’ them. An’—that’s why I wanted you to pray. I wanted to feel that clostness, oncet more.\n He had arrived at a tone of voice, an angle of vision, a narrative structure that served the story of the “common man” so well it achieved metaphor.\n  Ultimately, Steinbeck’s entire career would turn on the books he produced during this crucial decade:  The Pastures of Heaven (1932),  To a God Unknown (1933),  Tortilla Flat (1935),  In Dubious Battle (1936),  Of Mice and Men (1937),  The Red Pony (1937), and  The Grapes of Wrath (1939)—especially  The Grapes of Wrath. Hundreds of people—journalists, photographers, federal workers—were documenting the wretchedness of the migrants, but it was  The Grapes of Wrath that nailed the visceral experience, endowing it, very nearly, with allegorical meaning. The first few pages are an astonishing description of the Oklahoma earth slowly turning to dust under a relentless gathering of forces that begins to seem a judgment from some Higher Authority, telling the humble of the earth they haven’t been humble enough. In the foreground of this tableau of doom stands a sharecropper’s wife, staring into space in the doorway of the hovel she calls home, murmuring to her husband, “What’ll we do?” The husband, also staring, replies with shocking humility, “I don’t know.” The sense of tragedy—large and looming—is inescapable.\n In its time,  The Grapes of Wrath was to the rapaciousness of American capitalism at its most dramatic what   Uncle Tom’s Cabin was to the anti-slavery movement: a novel that had, during an era of cultural despair, penetrated so deeply into the heart of the matter that it became emblematic of humanity’s vast capacity for inflicting pain and misery on itself.\n  The life of the migrant workers in the Salinas Valley was only one-half of the California that supplied Steinbeck with the material upon which his writing imagination fed; the other half was to be found among the population of anti-social free spirits who thrived on the Monterey waterfront in the 1930s and ’40s. It was here that Steinbeck and his first wife (there were two more after Carol) most often lived and worked, returning repeatedly to those waterfront friends among whom they felt most at home; women and men who, in time, became the characters in  Tortilla Flat  and  Cannery Row , people who drank, whored, and philosophized, relishing life off the books from one end of the day to the next.\n It was here that Steinbeck’s talent for social comedy blossomed, and at the same time he grew ever more devoted to the literary bête noire—an obsessive need to sermonize on Man the Individual in relation to Man the Group Unit—that brought him his most devastating criticism. The same year that Steinbeck married Carol, he also met Ed Ricketts. A philosophizing marine biologist who doubled as a prototypical California guru (half Jesus, half sexual predator), Ricketts commanded inordinate respect on the waterfront. For Steinbeck, he proved spellbinding. Ricketts had developed a theory that sought to account for the life on the planet; a kind of ecological thinking that explained all human experience in terms of the individual’s encounter with the environment. Out of this theory, Ricketts philosophized that humans were in thrall to a biologism they could never grasp, much less control. All depended therefore on understanding the relation between an individual specimen and the species as a whole. Hence, Man the Individual in relation to Man the Group Unit became holy writ for Steinbeck.\n  For the popular reader, this kind of writing made him seem a great man of American letters; for the serious reader, it reduced him to a reputation for middlebrow writing—the sentimental and the intellectually low grade—from which he has never recovered. When Steinbeck  received the Nobel Prize in 1962, the literary biographer Arthur Mizener declared flat out that he possessed “a real but limited talent that is, in his best books, watered down by tenth-rate philosophizing, and in his worst overwhelmed by it.”\n There is no denying that many of Steinbeck’s books go on for hundreds of pages in Okie-Arkie dialect speech, interspersed with the kind of sermonizing that made Terry Teachout once  declare his work “literature with training-wheels.” Nonetheless, to this day hundreds of thousands of copies of Steinbeck’s novels sell annually, and all his books are in print. High school students, especially, still experience him as a master storyteller who can deliver them up to a sense of life’s wonder.\n  The amount of print that has been spilled on Steinbeck would fill an ocean: memoirs, social histories, dissertations, biographies by the yard. Surely by now the cases for and against him as a significant American writer have been sufficiently made. So the question before us is: Do we need another Steinbeck biography—and if so, is Souder’s the one we need? For this reviewer the answer, at least in the second instance, is no.\n In his work, Steinbeck is famously the sympathetic chronicler of those without the power to demand fundamental respect, while his behavior in person often made a mockery of his declared values. For decades he exhibited behavior—violent, morose, alcoholic—for which others paid heavily. As a husband, he was addictively unfaithful, committing serial infidelities that never satisfied and never abated. His second wife wrote a memoir  accusing him of low-level sadism; he had, she said, a pet rat that he’d release into a roomful of visitors and watch gleefully, as the hysteria in the room mounted. As for fatherhood, here is an example of Steinbeck’s parenting:\n  Once, when John IV was around three, he let Steinbeck’s poorly trained sheep dog into the apartment. The dog shat on the floor. When Steinbeck discovered the mess, he grabbed the boy and rubbed his face in it.… John IV would later say that the great epiphany of his childhood was realizing that his father was an asshole.\n What the reader—better yet, let me say  this reader—would like to see in a new Steinbeck biography is flesh put on that skeletal report: an exploration of the self-destructiveness that rescues Steinbeck’s inner chaos from the merely incidental, leaving it so indelibly imprinted on the reader’s felt memory that from this moment on his books read differently. It’s not that Souder needs to psychoanalyze Steinbeck’s behavioral extremities; to the contrary, he merely has to illustrate them with the kind of accumulating depth that lends texture to the prose. This, however, he does not do.\n One of the reasons, oddly enough, that I think Souder does not dig deep is that his own feelings about Steinbeck seem to be conflicted. For instance, even when he is detailing a relationship obviously important to Steinbeck, he cannot lend himself wholeheartedly to an interpretation that would prove revelatory. Instead, we get something halting, even insinuating that leaves both Souder and the reader feeling morally puzzled, if not downright suspicious. During his time at Stanford, for instance, Steinbeck made a writing friend of a woman named Kate Beswick with whom he had a brief, disastrous love affair. The friendship survived the affair because Kate was an invaluable reader of his work, and for years—certainly throughout his twenties—he sent her his manuscripts. In his letters to her, he also (“luridly,” Souder tells us) included accounts of his current sexual adventures, which, for Souder, made plain the “coarseness” that “came naturally to Steinbeck.... Whether she encouraged him or he simply lacked any sense of decency toward his onetime college lover is impossible to say.” Souder goes on:\n The urgency of Steinbeck’s need to relate details of his life to Kate Beswick was remarkable. He told her that ... he had somehow acquired a new sexual prowess.... He said he could now have an orgasm whenever he “wanted” one, whether it took thirty seconds or thirty minutes. He reminded Beswick of his poor control in this regard when they were a couple.... Why Steinbeck kept telling Beswick things like this can’t be explained in any way that makes it seem okay. It was simply in his nature.\n It was simply in his nature … the coarseness that came naturally … whether she encouraged him or he simply lacked any sense of decency … why he kept telling Beswick things like this can’t be explained in any way that makes it seem okay. These are phrases that Souder supplies in lieu of an analysis of Steinbeck’s lifelong sexual anxieties (no womanizer is without them). What we get instead is intellectual vacancy coupled with a deal of absurd moralizing ( any sense of decency, indeed!) and—neither for the first nor the last time in this book—some really bad writing.\n In a long passage detailing Steinbeck’s developing interest in metaphysical theories that he had convinced himself were profound—his view of “the living world as a cooperative endeavor among organisms”—Souder observes, “It’s difficult to decide whether all of this is baloney—or a perceptive kernel of thought that would breathe life into several of the most-revered books of the twentieth century.” I know what I can decide: Steinbeck’s theory is neither brilliant nor worthless, but a biographer who resorts to “baloney” in trying to assess the value of its intellectual content is tired.\n  Some years ago, Souder wrote a remarkable  biography of Rachel Carson that displayed an imaginative grasp of his subject, so full of feeling was he for the reason she was worth writing about. The admiration—clear, simple, deserved—that he lavished on Carson stemmed directly from his solid connection with the integrity that characterized her existence. With Carson, the life, the work, the woman were all one, each element in turn easily accountable to the others. John Steinbeck was an entirely different animal: a man riven with anxieties that separated him repeatedly not only from his intimates and his physical environment but from some necessary sense of self-belief that regularly deserted him. He could fight his demons successfully enough to write the great novels of the ’30s, when, I suspect, the world gave him back a sufficient reflection of his own sense of loss and abandonment; later, they returned with a vengeance. This is the Steinbeck that has somehow eluded Souder’s capacity for deep-down engagement. It would have been interesting to know him better.", "posttime": "2020-10-12 17:40:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "社会,social,苏德", "title": "反社会小说家", "title_en": "The Anti-Social Novelist", "transed": 1, "url": "https://newrepublic.com/article/159669/anti-social-novelist", "via": "", "real_tags": ["社会", "social", "苏德"]}, {"category": "", "categoryclass": "", "imagename": "e4647e6f0474175bd12eade6809a03fd.jpg", "infoid": 1028248, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "莫维尔洞穴已经被隔绝了数百万年。它的空气中充满了有害气体，但它却是一系列奇怪动物的家园。\n在罗马尼亚东南部靠近黑海和保加利亚边境的constanț县，有一片贫瘠而平凡的平原。这片荒凉的田野完全不起眼，除了一件事。\n它下面是一个550万年来一直与世隔绝的洞穴。当我们类人猿的祖先从树上下来进化成现代人时，这个洞穴的居民与地球上的其他地方隔绝了。\n尽管完全没有光线，也没有有毒的气氛，但洞穴里到处都是生命。这里有独特的蜘蛛、蝎子、林虱和蜈蚣，其中许多是人类以前从未见过的，它们的生命都要归功于一块奇怪的细菌漂浮垫。\n1986年，共产主义罗马尼亚的工人们在测试地面是否适合建发电厂时，偶然发现了莫维尔洞穴。罗马尼亚科学家克里斯蒂安·拉斯库(Cristian Lascu)是第一个进行危险降落的人。\n要进入，你必须先用绳子沿着挖入地下的狭窄竖井下降20米。\n从那时起，这个洞穴一直被罗马尼亚当局封锁。允许进入莫维尔的人不到100人，这个数字与那些去过月球的人相当。\n要进入，你必须先用绳子把自己放低20米，沿着挖在地面上的狭窄竖井下去。唯一的光来自你的头盔，它在你下降时在墙上反弹。\n然后，你必须爬下狭窄的石灰岩隧道，在漆黑的黑暗和25摄氏度的温度下，覆盖着赭石粘土。这些路径最终开放到一个包含湖泊的中心洞穴。\n2010年，当时在英国考文垂华威大学的微生物学家里奇·博登(Rich Boden)成为大约第29个看到这个洞穴的人。\n现在在英国普利茅斯大学工作的博登说，天气相当温暖，非常潮湿，所以感觉比现在更暖和，当然，穿着紧身衣，戴着头盔也无济于事。\n一池温暖的硫化物水，当你扰乱它时，会散发出硫化氢的臭味，散发出腐烂的鸡蛋或烧焦的橡胶的臭味。\n在湖房里，大气中充满了有害气体，主要是二氧化碳和水中的硫化氢。\n据说这种经历很可怕--即使你对令人毛骨悚然的爬行动物没有问题，那也是如此。\n更重要的是，空气的含氧量很低：它只含有10%的氧气，而不是通常的20%。没有呼吸器，你很快就会头疼。参观者只能在地下停留5到6个小时，然后他们的肾脏才会填满。\n要探索洞穴的其余部分，你必须潜入湖中，在狭窄的水下通道中航行，穿过岩石上的微小缝隙，然后才能进入称为气铃的空间。\n在完全黑暗的情况下做这件事是探索洞穴最危险的部分。你离地面很远，所以在迷宫般的隧道中被困或迷路将是致命的。据说这种经历非常可怕--即使你对爬行没有什么问题，也是如此。\n尽管有黑暗和危险的气体，莫维尔洞穴里还是充满了生命。到目前为止，已经确认了48个物种，其中包括33个在世界其他地方找不到的物种。\n有各种各样的沉船和滑行的东西。蜗牛和虾尽量避开蜘蛛和水蝎。在风铃里，水蛭游过水面，捕食蚯蚓。\n奇怪的是，空气越差，动物就越多。为什么会这样，或者这些动物是如何生存的，这一点都不明显。\n在地表，植物利用阳光从空气中提取二氧化碳，并将其转化为有机化合物。然后，它们可以使用这些化学物质来生长叶子、根和球茎。然后，动物以这些植物组织为食。\n没有阳光，莫维尔洞穴里的动物似乎没有食物来源。\n在大多数洞穴里，动物从地表滴下来的水中获取食物。这种水经常以钟乳石和石笋的形式出现。\n然而，移动洞穴上面有一层厚厚的粘土层，是不透水的。当拉斯库第一次来的时候，他找不到任何钟乳石或石笋，或者任何其他从表面流出来的水的迹象。\n当科学家分析洞穴中的水中是否有放射性铯和锶时，这个谜团变得更加神秘。1986年切尔诺贝利核事故释放了大量这些金属，它们进入了莫维尔洞穴周围的土壤和湖泊。然而，1996年的一项研究在洞穴内没有发现它们的踪迹。\n这意味着水不是从上面来的，所以它一定是从下面来的。现在看来，莫维尔洞穴中的水似乎来自海绵砂岩，它已经在那里存放了25,000年。\n然而，这仍然不能解释洞穴中的动物是如何生存的。检测表明，流入的水中不含任何食物颗粒。\n相反，食物来自水面上奇怪的泡沫泡沫。\n这种漂浮的薄膜看起来像湿纸巾，甚至可以像纸一样撕裂，它含有数百万种被称为自养细菌的细菌。\n博登说，这些细菌和植物一样，从二氧化碳中获取碳。洞穴中的二氧化碳水平大约是正常空气的100倍。但与植物不同的是，它们显然不能利用光合作用，因为没有光。\n移动细菌使用的不是光作为能源，而是一种称为化学合成的过程。\n他们得到了所需的能量…。来自化学反应：关键的是硫化物和类似的硫离子氧化成硫酸，或者地下水中发现的铵氧化成硝酸盐，#34；博登说。\nMovile细菌也与其他地方发现的细菌非常相似，尽管它们被困在洞穴里超过500万年。\n博登说，到处都是甲烷营养菌：罗马巴斯的浴池、海水表面、牛的嘴巴，可能还有人类的嘴和肠道。在几乎所有的土壤和皮肤表面都发现了与我们在Movile发现的相同类型的自养细菌。\n但对于洞穴里的动物来说，情况就不一样了。数百万年的与世隔绝改变了他们。\n许多人生来就没有眼睛，这在黑暗中是毫无用处的。几乎所有的皮肤都是半透明的，因为它们失去了皮肤中的色素。许多动物还有超长的附属物，如天线，以帮助它们在黑暗中摸索方向。\n其中一只蜘蛛与在加那利群岛发现的一只蜘蛛有密切的亲缘关系，加那利群岛位于加那利群岛以西4000多公里处。\n莫维尔洞穴里没有苍蝇，但蜘蛛仍在结网。一种叫做弹尾虫的小昆虫跳到空中，然后被网抓住。\n1996年，研究人员对洞穴中的动物进行了分类。其中包括三种蜘蛛，一种蜈蚣，四种等足类动物(包括林虱)，一种在世界其他地方从未见过的水蛭，以及一种长相不同寻常的昆虫，称为水蝎。\n奇怪的是，其中一只蜘蛛与在加那利群岛发现的一只蜘蛛有密切的亲缘关系，加那利群岛位于非洲西北海岸以西4000公里处。\n一种理论认为，在大约550万年前的中新世末期，北半球的气候发生了变化。当非洲向北移动时，它阻止了大西洋流入地中海，使其干涸。\n这种细菌很可能在那里已经存在了五百万年以上。\n这可能会迫使这些动物在莫维尔洞穴的硫磺地下世界寻求庇护。它将是一个避风港，热水提供持续的温暖，没有竞争对手或捕食者，并且有丰富的食物来源。\n默雷尔说，细菌很可能在那里存在的时间比500万年长得多，但大约在那个时候昆虫就被困在了那里。它们可能只是在石灰石脱落时掉进洞里被困住了，把洞穴封住了，直到1986年再次被发现。\n可能是不同的动物到达的时间不同。2008年对莫维尔唯一的蜗牛进行的一项研究表明，它在那里生活了刚刚超过200万年。当它进入洞穴时，冰河时代才刚刚开始，蜗牛可能是通过转入地下来躲避寒冷的。\n无论他们如何到达那里，似乎莫维尔的居民现在都被永远地困住了。我们可以从他们身上学到很多东西。\n可能第一批活细胞与在莫维尔洞穴中发现的细胞相似。\n细菌氧化甲烷和二氧化碳的能力特别令人感兴趣。这两种温室气体是全球变暖的最大罪魁祸首，因此研究人员迫切希望找到有效的方法将它们从大气中消除。", "note_en": "Movile Cave has been cut off for millions of years. Its air is thick with harmful gases, yet it is home to an array of strange animals\n        In the south-east of Romania, in Constanța county close to the Black Sea and the Bulgarian border, there lies a barren featureless plain. The desolate field is completely unremarkable, except for one thing.\n Below it lies a cave that has remained isolated for 5.5 million years. While our ape-like ancestors were coming down from the trees and evolving into modern humans, the inhabitants of this cave were cut off from the rest of the planet.\n Despite a complete absence of light and a poisonous atmosphere, the cave is crawling with life. There are unique spiders, scorpions, woodlice and centipedes, many never before seen by humans, and all of them owe their lives to a strange floating mat of bacteria.\n  In 1986, workers in communist Romania were testing the ground to see if it was suitable for a power plant, when they stumbled across the Movile Cave. Romanian scientist  Cristian Lascu was the first to make the dangerous descent.\n To enter, you must first be lowered by rope 20m down a narrow shaft dug into the ground\n Since then the cave has remained sealed by the Romanian authorities. Fewer than 100 people have been allowed inside Movile, a number comparable to those who have been to the Moon.\n  To enter, you must first lower yourself by rope 20m down a narrow shaft dug into the ground. The only light is from your helmet, which bounces around the walls as you descend.\n You must then climb down through narrow limestone tunnels coated in an ochre clay, in pitch darkness and temperatures of 25 °C.  These paths eventually open out into a central cavern containing a lake.\n  In 2010, microbiologist  Rich Boden, who was then at the University of Warwick in Coventry, UK, became roughly the 29th person to see the cave.\n  &#34;It&#39;s pretty warm, and very humid so it feels warmer than it is, and of course with a boiler suit and helmet on that doesn&#39;t help,&#34; says Boden, who is now at the University of Plymouth in the UK.\n &#34;The pool of warm, sulphidic water stinks of rotting eggs or burnt rubber when you disturb it as hydrogen sulphide is given off.&#34;\n  In the lake room, the atmosphere is heavy with harmful gases, principally carbon dioxide as well as the hydrogen sulphide from the water.\n The experience is said to be terrifying – and that&#39;s even if you don&#39;t have a problem with creepy-crawlies\n What&#39;s more, the air is low in oxygen: it contains just 10% oxygen rather than the usual 20%. Without breathing apparatus, you would soon develop a headache. Visitors can only stay down for 5 or 6 hours before their kidneys pack in.\n To explore the rest of the cave, you must dive into the lake and navigate narrow underwater passageways, squeezing through tiny gaps in the rock before emerging into airspaces called air bells.\n Doing this in complete darkness is the most dangerous part of exploring the cave. You are far from the surface, so getting stuck or losing your way in the maze of tunnels would be lethal. The experience is said to be terrifying – and that&#39;s even if you don&#39;t have a problem with creepy-crawlies.\n  Despite the dark and the dangerous gases, Movile Cave is crawling with life. So far 48 species have been identified, including 33 found nowhere else in the world.\n  There are all sorts of scuttling and slithering things. Snails and shrimps try to avoid the spiders and waterscorpions. In the air bells, leeches swim across the water and prey on earthworms.\n Strangely, the worse the air gets the more animals there are. It&#39;s not at all obvious why that should be, or how the animals survive at all.\n On the surface, plants use sunlight to extract carbon dioxide from the air and turn it into organic compounds. They can then use these chemicals to grow leaves, roots and bulbs. Animals then feed on these plant tissues.\n Without sunlight, the animals in Movile Cave seem to be without a source of food.\n  In most caves, animals get their food from the water dripping down from the surface. This water can often be seen in the form of stalactites and stalagmites.\n However, Movile Cave has a thick layer of clay above it, which is impermeable to water. When Lascu first visited, he could not find any stalactites or stalagmites, or any other sign of water coming from the surface.\n  The mystery deepened when scientists analysed the water in the cave for radioactive caesium and strontium. The 1986 nuclear accident at Chernobyl had released lots of these metals, which had found their way into the soils and lakes surrounding Movile Cave. However,  a 1996 study found no traces of them inside the cave.\n That means the water isn&#39;t coming from above, so it must be coming from below. It now seems that the water in Movile Cave comes from spongy sandstones where it has lain for 25,000 years.\n However, this still doesn&#39;t explain how the animals in the cave survive. Tests have shown that the water flowing in does not contain any food particles.\n Instead, the food comes from the strange frothy foam sitting on top of the water.\n  This floating film, which looks like wet tissue paper and can even be torn like paper, contains millions upon millions of bacteria known as &#34;autotrophs&#34;.\n  &#34;These bacteria get their carbon from carbon dioxide just like plants do,&#34; says Boden. &#34;The carbon dioxide level in the cave is about 100 times higher than normal air. But unlike plants, they obviously can&#39;t use photosynthesis as there is no light.&#34;\n Rather than using light as an energy source, the Movile bacteria use a process known as chemosynthesis.\n &#34;They get the energy needed… from chemical reactions: the key ones being the oxidation of sulphide and similar sulphur ions into sulphuric acid, or the oxidation of ammonium found in the groundwaters to nitrate,&#34; says Boden.\n  These chemosynthetic bacteria help explain why the cave is so large and the air is so thick with carbon dioxide.\n Movile is the only cave whose ecosystem is known to be supported in this way\n &#34;Sulphuric acid actually erodes the limestone, which is gradually making the cave bigger,&#34; says Boden. &#34;The process releases carbon dioxide, which is why levels are so high.&#34;\n Another major group of bacteria get their energy and carbon from the methane gas that bubbles up through the waters of the cave. They are called methanotrophs.\n Boden describes methanotrophs as &#34;messy eaters&#34; that &#34;constantly leak metabolic intermediates like methanol and formate&#34; into the surrounding water. In turn, these chemicals are food for other species of bacteria.\n  This may all sound very peculiar, and in some ways it is. Movile is the only cave whose ecosystem is known to be supported in this way, and the only such ecosystem on land.\n  But according to microbiologist  J. Colin Murrell of the University of East Anglia in Norwich, UK, the bacteria in Movile Cave are remarkably simple and not at all unusual.\n &#34;The bacteria get all of their carbon from just one source, be it methane or carbon dioxide,&#34; says Murrell. &#34;That means that all of the components of their cells, be it the DNA in their nucleus, the lipids in their cell membrane and the proteins in their enzymes, are made from the same simple ingredient.&#34;\n The Movile bacteria are also very similar to bacteria found elsewhere, despite having being trapped in the cave for over 5 million years.\n &#34;Methanotrophs are everywhere: the Roman Baths at Bath, the surface of seawater, the mouths of cattle and probably the human mouth and gut,&#34; says Boden. &#34;Autotrophic bacteria of the same types we found at Movile are found in almost all soils and on the surface of the skin.&#34;\n The same cannot be said for the animals of the cave. Millions of years of isolation has transformed them.\n  Many are born without eyes, which would be useless in the dark. Almost all are translucent as they have lost pigment in their skin. Many also have extra-long appendages such as antennae to help them feel their way around in the darkness.\n One of the spiders was closely related to a spider found in the Canary Islands – which lie over 4000km to the west\n There are no flies in Movile Cave, but the spiders still spin webs. Small insects called springtails bounce into the air and get caught in the webs.\n In 1996,  researchers categorised the animals in the cave. They included 3 species of spider, a centipede, 4 species of isopod (the group that includes woodlice), a leech never seen anywhere else in the world, and an unusual-looking insect called a  waterscorpion.\n Strangely, one of the spiders was closely related to a spider found in the Canary Islands – which lie over 4000km to the west, off the north-west coast of Africa.\n   One theory is that back at the end of the Miocene Epoch, about 5.5 million years ago, the climate of the northern hemisphere changed. As Africa moved north it stopped the Atlantic from flowing into the Mediterranean Sea, drying it out.\n It&#39;s very likely that the bacteria have been there a lot longer than five million years\n This could have forced the animals to seek refuge in the sulphurous underworld of Movile Cave. It would have been a haven, with thermal waters providing constant warmth, no competitors or predators, and a rich source of food.\n  &#34;It&#39;s very likely that the bacteria have been there a lot longer than five million years, but that the insects became trapped there around that time,&#34; says Murrell. &#34;They could have simply fallen in and become trapped when the limestone cast dropped, sealing the cave until it was discovered again in 1986.&#34;\n It may be that different animals arrived at different times. A 2008 study of Movile&#39;s only snail suggested that  it has been down there for just over 2 million years. When it entered the cave, the ice age was just beginning, and the snail may have escaped the cold by going underground.\n  However they got there, it seems that Movile&#39;s inhabitants are now trapped for good. We could learn a lot from them.\n It could be that the first living cells were similar to those found in Movile Cave\n The bacteria&#39;s ability to oxidise methane and carbon dioxide is of particular interest. These two greenhouse gases are the biggest culprits for global warming, so researchers are desperate to find efficient ways to remove them from the atmosphere.\n The Movile Cave microbes could also offer hints about how the first life formed on Earth. They are genetically similar to those found in geothermal vents, which are also rich in carbon dioxide, sulphides and ammonia.\n The conditions in both places may well be similar to the primordial Earth. In our world&#39;s early years, the Sun&#39;s light was obscured by an atmosphere thick with carbon dioxide, methane and ammonia. It could be that the first living cells were similar to those found in Movile Cave.\n Almost 30 years after its discovery, Movile Cave remains perhaps the most isolated ecosystem on the planet. It surely has many more secrets to give up. There are plenty more organisms buried in the cave&#39;s sediments, waiting to be identified, and they could help us understand some of our deepest questions about the nature of life.", "posttime": "2020-10-12 17:23:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "奇怪,beasts,洞穴", "title": "罗马尼亚毒洞里生活着奇怪的野兽", "title_en": "Bizarre Beasts Living in Romania's Poison Cave", "transed": 1, "url": "http://www.bbc.com/earth/story/20150904-the-bizarre-beasts-living-in-romanias-poison-cave", "via": "", "real_tags": ["奇怪", "beasts", "洞穴"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1028246, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "MomentJs最近宣布，该库现已弃用。对于每周活跃下载Moment近1500万次的javascript社区来说，这是一件大事。说到这里，我开始了一次黑客马拉松之旅，去替换我公司核心图书馆里的Moment。\n任何替换过时的库的旅程都必须从找到替代库开始。在Moment的情况下，这不是一件微不足道的任务。Moment提供了很多功能，当与Moment-TimeZone结合使用时，挑战就更大了。\n让我们谈谈我的特定用例。我的团队选择遵循不变的Web Apps理念部署我们的Web应用。这里的TL；DR是我们交付完全合格的依赖项和已构建资产的版本。这有助于确保试运行和生产之间的唯一更改是基本配置值。在这里阅读更多关于它的信息。\n另一个主要考虑因素是，我在一家国际公司工作，客户来自13种不同的语言，分布在无数个时区。本地化、时区和偏移支持都很关键。\n我们从“时刻不赞成”指南中的建议开始，并加入了一些粉丝最喜欢的东西，以确保我们做出了最好的选择。请记住，当时有时间限制，所以我们不能检查所有选项。以下是我们整理的名单：\n一旦我们编译了选项列表，我们就得到了每个包的捆绑包大小，包括支持时区和区域设置所需的所有插件/插件。下面是它们的堆叠方式：\n由于缺少预建捆绑包而被淘汰。我们需要IWA的单一真理来源，并且不想维护构建过程。\nDay.js-2KB，但还需要UTC和时区插件(4KB)以及所有区域设置(26KB)\nLuxon-71KB，包含所有内容，并且它依赖于用于区域设置的INTLAPI。\n下一步是检查剩下的两个库是否具有我们需要的功能。要做到这一点，我们能想到的最好方法是编写一个测试套件来测试Moment的特性，然后运行每个库来完成挑战。\n我们首先编写针对Moment的测试套件，以获得我们信任的值的“静态”真实源。这产生了一组函数名称，然后我们需要使用day.js和Luxon来完成这些名称。\n这个测试套件被证明是无价的。我们能够了解到这两个库在我们的用例中是如何工作的，并在day.js中找到了一个严重故障。\n事实证明，day.js不能很好地支持夏令时，并且在回购中围绕它有许多未解决的问题。最严重的问题是在进入或离开DST时没有正确计算偏移量。\n老实说，到达这里并不是一段很长的旅程。一天多一点的努力让我们对选择鲁克逊有了充分的信心，因为我们的图书馆正在向前发展。它拥有我们需要的所有实用程序、时区支持和区域设置支持。它的捆绑包大小不是最小的，但与513KB的Moment+Moment-Timzone相比，还是有了很大的改进。", "note_en": "MomentJs recently announced that  the library is now deprecated. This is a big deal for the javascript community who actively downloads moment almost 15 million times a week. With that I began a journey during a Hackathon to replace moment in a core library at my company.\n  The start of any journey to replace a deprecated library has to begin with finding a replacement. In the case of moment, this is no trivial task. Moment offers a lot of functionality, and when combined with moment-timezone, the challenge is even greater.\n Let’s talk about my particular use case. My team chooses to deploy our web apps following the  Immutable Web Apps philosophy. The TL;DR here is that we deliver fully qualified versions of dependencies and built assets. This helps ensure the only changes between staging and production are basic configuration values. Read more about it  here.\n The other major consideration is that I work for an international company with clients in 13 different languages, and countless timezones. Localization, timezone, and offset support are all critical.\n   We started with recommendations from the moment deprecation guide and tossed in some fan favorites to make sure we made the best choice we could. Keep in mind that there was a time constraint, so we couldn’t examine every option. Here’s the list we compiled:\n   Once we compiled our list of options, we got the bundle size for each of the packages including all required plugins/addons to support timezones and locales. Here’s how they stacked up:\n Eliminated due to lack of pre-built bundle. We need a single source of truth for IWA, and did not want to have to maintain a build process.\n day.js - 2KB, but also needs the utc and timezone plugins (4KB), and all locales (26 KB)\n  luxon - 71KB, Everything is included, and it relies on the INTL api for locales.\n The next step is to vet the remaining two libraries for the functionality we need. The best way we could come up with to accomplish this is to write a test suite to exercise moment’s features, then run each library through that gauntlet.\n     We first started by writing the test suite against moment to have a “static” source of truth for values we trusted. This yielded a set of function names that we then needed to fulfill with day.js and luxon.\n  This test suite proved invaluable. We were able to learn how both libraries worked for our use cases as well as finding a critical failure in day.js.\n It turns out the day.js does not support daylight savings time very well, and there are  numerous open issues around it on the repo. The most critical of which does not calculate offset properly when entering or leaving DST.\n   It was not a very long journey to arrive here honestly. A little more than a day of effort allowed us to have full confidence in our choice of  luxon as our library moving forward. It has all of the utilities, timezone support and locale support that we need. It’s bundle size is not the smallest, but compared to the 513KB of moment + moment-timezone, it’s still a huge improvement.", "posttime": "2020-10-12 15:54:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "包含,successor,moment", "title": "MomentJs已弃用。下面是我是如何选择包含的后续OSS测试套件的", "title_en": "MomentJs is deprecated. Here's how I chose a successor OSS Test suite included", "transed": 1, "url": "https://terodox.tech/migrating-away-from-momentjs-part1/", "via": "", "real_tags": ["包含", "successor", "moment"]}, {"category": "", "categoryclass": "", "imagename": "e5200213d1995446a35fef75cb4b2291.jpg", "infoid": 1028241, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这笔资金将在未来三年投资于30家印尼初创企业，首批高达300万美元的支票将用于为A系列公司提供种子。\nACV总部设在雅加达，拥有一个12人的团队，是AC风险投资公司和印度资本公司的战略联盟。ACV的创始合伙人是AC Ventures的创始人和管理合伙人Adrian Li和Michael Soerijadji，以及印度资本公司的管理合伙人Pandu Sjahrir。Sjahrir也是两家印尼独角兽公司Gojek和Sea的董事会成员。\n该联盟已经对9家初创公司进行了投资：Shipper，Kargo，Stockbit，Bukuwarung，ESB，Co-Learning，KitaBeli，Aruna和Soul Parking。它将专注于电子商务、金融科技、服务于中小企业(或微型、中小企业)的初创企业和数字媒体服务，李告诉TechCrunch，除了娱乐，这些服务还可能包括教育和医疗等行业。\nACV还计划与其投资的公司密切合作，指导它们完成业务发展、关键高管招聘和后来的几轮融资。它还推出了AC Academy等项目，为创始人提供成长、黑客和筹款等技能方面的培训。\n互联网普及率和在线支付在过去五年中增长了很多，但电子商务在印尼整体零售市场中仍然只占很小的一部分。这给了初创企业很大的创新空间。例如，印尼的物流非常分散，因为它有600个有人居住的岛屿。发货人是ACV的另一项投资，它提供了一个平台，帮助卖家通过不同的供应商同时管理多批货物。\nACV Capital III的筹款活动在新冠肺炎大流行之前就开始了，尽管危机造成了经济损失，但李表示，在印尼这样的国家，可能会加快采用多种技术。例如，专注于社区商店和其他小企业数字化运营的BukuWarung最近推出了数字支付，以应对在线订单和非接触式支付的需求。另一家ACV投资组合公司ESB也在为餐厅做同样的事情，李说，随着食品和饮料企业在社交距离措施期间转向在线订单和送货，人们对其服务的兴趣增加了。\n“我们真的在印尼看到了一些很好的机会，我们看到全球对印尼初创企业的兴趣越来越大，”李说。“这是世界上人口第四多的国家，有如此之多的产品和服务可以通过技术更好、更高效地提供。”", "note_en": "The capital will be invested into 30 Indonesian startups over the next three years, with first checks of up to $3 million going to seed to Series A-stage companies.\n Based in Jakarta with a team of twelve people,  ACV   is a strategic alliance between  AC Ventures   and Indies Capital. ACV’s founding partners are Adrian Li and Michael Soerijadji, both founders and managing partners at AC Ventures, and Indies Capital managing partner Pandu Sjahrir. Sjahrir is also on the board of two Indonesian unicorns, Gojek and Sea.\n  The alliance has already made investments in nine startups: Shipper, Kargo, Stockbit, Bukuwarung, ESB, Co-Learn, KitaBeli, Aruna and Soul Parking. It will focus on e-commerce, financial tech, startups that serve MSMEs (or micro, small and medium-sized enterprises) and digital media-enabled services, which Li told TechCrunch could encompass sectors like education and healthcare, in addition to entertainment.\n ACV also plans to work closely with the companies it invests in, guiding them through business development, key executive hires and later rounds of funding. Its also launched programs like AC Academy to coach founders on skills like growth hacking and fundraising.\n Internet penetration and online payments have grown a lot over the past five years, but e-commerce still accounts for a tiny fraction of  Indonesia’s overall retail market. This gives startups plenty of room to innovate. For example, logistics is very fragmented in Indonesia, because it has 600 inhabited islands. Shipper, another ACV investment,  offers a platform to help sellers manage multiple shipments through different providers at once.\n Fundraising for ACV Capital III began before the COVID-19 pandemic and despite the crisis’ economic toll, Li said that in countries like Indonesia, it may speed up the adoption of many kinds of technology. For example, BukuWarung, which  focuses on digitizing operations for neighborhood shops and other small businesses, recently launched digital payments in response to demand for online orders and contactless payments. Another ACV portfolio company, ESB, is  doing the same thing for restaurants, and Li said interest in its services increased as food and beverage businesses turned to online orders and deliveries during social distancing measures.\n “We’re really seeing some great opportunities in Indonesia, and we’re seeing more interest globally going into startups in Indonesia,” said Li. “This is the world’s fourth most populous country and there are so many products and services which can be delivered better and more efficiently through technology.”", "posttime": "2020-10-12 08:27:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,ventures", "title": "\nAC Ventures宣布其为印尼初创企业设立的8000万美元基金首次完成交易", "title_en": "\n\t\t\t\tAC Ventures announces the first close of its $80 million fund for Indonesian startups\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/11/ac-ventures-announces-the-first-close-of-its-80-million-fund-for-indonesian-startups/", "via": "", "real_tags": ["交易", "ventures"]}, {"category": "", "categoryclass": "", "imagename": "baa957eb1af92f5e0aee083e756f9c3f.jpg", "infoid": 1028240, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Epic Games没有赢得针对苹果的反垄断初步禁令，这将迫使苹果允许堡垒之夜重返iphone、ipad和mac。\n堡垒之夜仍然无法在苹果设备上使用，因为主审此案的法官以该公司的欺骗性行为、故意违约和不愿解决自己制造的问题为由，做出了不利于该公司的裁决。\n法官确实阻止了苹果公司屏蔽虚幻引擎，所以这场磨难对游戏开发商来说并不是完全的失败。\nEpic Games已经收到了我们几周前警告过你的决定。主审苹果案件的法官驳回了Etic的临时禁令，该禁令将迫使苹果允许堡垒之夜重返应用商店。这意味着苹果手机、苹果平板电脑和苹果电脑的用户将不得不寻找其他地方来修复堡垒之夜的游戏，因为这款游戏短期内不会回到苹果设备上。EPIC和苹果的法庭之争才刚刚开始，反垄断案很可能会在陪审团面前审理，但这不会很快发生。法官伊冯·冈萨雷斯·罗杰斯(Yvonne Gonzalez Rogers)至少挽救了Etic的其他主要财产，使其免于被苹果的App Store禁止使用，这是许多其他游戏开发商为自己的创作授权的虚幻引擎。\n冈萨雷斯·罗杰斯在几周前的禁令解除听证会上暗示，当谈到堡垒之夜时，她并不倾向于站在史诗一边。她当时指出，Etic在与苹果的商业关系中撒了谎。“你做了一些事，你通过疏忽和不坦诚来撒谎。这就是安全问题。这就是安全问题！“。冈萨雷斯·罗杰斯告诉Epic.。“公众中有很多人认为你们是英雄，因为你们的所作所为，但这仍然是不诚实的。”\n在法庭上，苹果辩称，Etic违反的App Store做法是为了保护用户免受安全风险和恶意软件的影响。EPIC在8月下旬激活了其堡垒之夜游戏中的一个隐藏功能，该功能为用户打开了二次支付选项。苹果永远不会批准这一功能，这就是EpicePic背着苹果做这件事的原因。在此之前，苹果拒绝允许Etic使用自己的支付平台来支付堡垒之夜的应用内购买。\nEPIC策划了一个巨大的公关噱头，让游戏玩家因预期中的堡垒之夜禁令而反对苹果，然后在同一时间以反竞争行为起诉苹果。即使反垄断案本身可能有可取之处，这也改变不了Etic违反合同的事实。随后的公关活动包括“史诗”中更多的谎言，因为它试图说服游戏玩家，因为苹果的缘故，堡垒之夜无法在苹果手机或ipad上使用。\n周五，冈萨雷斯·罗杰斯正式对此案做出裁决，拒绝了埃皮克对堡垒之夜的初步禁令请求。EPIC赢得了该案的虚幻引擎部分，这部分模仿了两人之前法庭斗争的判决。EPIC通过临时限制令未能在苹果手机上救出堡垒之夜，但在虚幻引擎方面获胜。\n法官澄清说，Etic单方面违反了合同，不能声称它这样做是出于垄断方面的担忧。罗杰斯法官还表示，Etic未能表明它愿意与苹果和法院合作恢复这款游戏，这证明Etic并不一定关心iOS用户的福祉：\nEpic Games(Sequoia Capital‌)不能简单地宣称“垄断”，以改写让自己单方面受益的协议。其其他确定的基础：对其声誉和堡垒之夜游戏社区的损害不会构成不可弥补的损害，如果这种损害来自Epic Games全球(‌Weibo‌)自己的行为及其违反与苹果协议的战略决定。虽然消费者正在感受到这场诉讼的影响，但事实仍然是：这些都是商业纠纷。当Epic Games违反协议时，可能代表所有开发商就这些完全相同的问题提起的集体诉讼已经在进行中。[…]。然而，Epic Games除了对这种情况不屑一顾外，从未充分解释过自己的匆忙行为。目前的困境是它自己造成的。[…]。\n为了提供帮助，法院甚至提出要求将30%的资金交由第三方托管，等待审判的解决，但被‌Epic Games(Sequoia Capital‌)断然拒绝。拒绝这样做表明，新浪Epic Games(‌Weibo‌)主要并不关心ios消费者，而是有其他战术举措。新浪Epic Games(‌Weibo‌)承认，这项技术的存在是为了通过轻松停用“热修复”来“修复”这个问题。\n法官冈萨雷斯·罗杰斯(Gonzalez Rogers)在听证会上表示，审判应该在陪审团面前进行，这在明年7月之前的任何时候都不会发生。日期尚未确定，审判将持续多长时间尚不清楚。换句话说，在苹果删除了Epici的开发者账户后，堡垒之夜将在至少一年内继续被禁止使用iphone、ipad和mac。", "note_en": "Epic Games did not win its preliminary injunction  in its antitrust against Apple, which would have forced Apple to allow Fortnite back onto the iPhone, iPad, and Mac.\n Fortnite remains unavailable on Apple devices, as the judge presiding over the case ruled against Epic, citing the company’s deceitful practices, intentional breach of contract, and unwillingness to fix a problem of its own creation.\n The judge did stop Apple from blocking Unreal Engine, so the ordeal hasn’t been a complete loss for the game developer.\n  Epic Games has received the decision  we warned you about a few weeks ago. The judge presiding over its case against Apple denied Epic a temporary injunction that would have forced Apple to allow Fortnite back into the App Store. That means iPhone, iPad, and Mac owners will have to look elsewhere to get their Fortnite fix, as the game will not make a return to Apple devices anytime soon. Epic and Apple’s court battle is just getting started, and the antitrust case will likely be tried in front of a jury, but that can’t happen anytime soon. Judge Yvonne Gonzalez Rogers has at least saved Epic’s other major property from getting banned from Apple’s App Store, the Unreal Engine that many other game developers license for their own creations.\n    Gonzalez Rogers hinted during the injunction relief hearing a few weeks ago that she wasn’t inclined to side with Epic when it comes to Fortnite. She pointed out at the time that Epic lied in its business relationship with Apple. “You did something, you lied about it by omission, by not being forthcoming. That’s the security issue. That’s the security issue!” Gonzalez Rogers told Epic. “There are a lot of people in the public who consider you guys heroes for what you guys did, but it’s still not honest.”\n In court, Apple argued that its App Store practices that Epic had violated are meant to protect users from security risks and malicious software. Epic in late August, activated a hidden feature inside its Fortnite game that turned on a secondary payment option for users. Apple would have never approved the feature, and that’s why Epic did it behind Apple’s back. The move followed Apple’s refusal to allow Epic to use its own payment platform for Fortnite’s in-app purchases.\n Epic  engineered a huge PR stunt to turn gamers against Apple over the expected Fortnite ban and then sued Apple for anti-competitive practices at the same time. Even if the antitrust case might have merit on its own, this doesn’t change the fact that Epic breached its contract. The PR campaign that followed included  more lying from Epic as it tried to convince gamers that  Fortnite isn’t available on the iPhone or iPad because of Apple.\n  On Friday, Gonzalez Rogers made  her ruling in the case official, denying Epic’s preliminary injunction request for Fortnite. Epic won the Unreal Engine part of the case, which mimics the verdict from the previous court battle between the two. Epic failed to save Fortnite on iPhone  via a temporary restraining order but won in regards to Unreal Engine.\n The judge clarified that Epic has breached a contract unilaterally and cannot claim that it did it because of monopoly concerns. Judge Rogers also said that Epic’s failure to show it’s willing to work with Apple and the court to have the game reinstated proves that Epic isn’t necessarily concerned with the well-being of iOS users:\n Epic Games‌ cannot simply exclaim “monopoly” to rewrite agreements giving itself unilateral benefit. Its other identified bases: damage to its reputation and the Fortnite gaming community cannot constitute irreparable harm where such harm flows from ‌Epic Games‌’ own actions and its strategic decision to breach its agreements with Apple. While consumers are feeling the impact of this litigation, the fact remains: these are business disputes. A putative class action on behalf of all developers on these exact same issues was already in progress when Epic Games breached the agreements. […] Yet, Epic Games has never adequately explained its rush, other than its disdain for the situation. The current predicament is of its own making. […]\n To assist, the Court even offered to require the 30% to be placed in escrow pending resolution of the trial which ‌Epic Games‌ flatly rejected. The refusal to do so suggests ‌Epic Games‌ is not principally concerned with iOS consumers, but rather, harbors other tactical moves. ‌Epic Games‌ admits that the technology exists to “fix” the problem by easily deactivating the “hotfix.”\n Judge Gonzalez Rogers said during the hearing that the trial should be tried in front of a jury, which won’t happen anytime before next July. A date has not been set and it’s unclear how long a trial would last. In other words, Fortnite will continue to be banned on iPhone, iPad, and Mac for at least a year after Apple removed Epic’s developer account that governs it.", "posttime": "2020-10-12 08:22:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,拒绝,remains", "title": "法官拒绝Epici的请求后，堡垒之夜仍被禁止进入苹果应用商店", "title_en": "Fortnite Remains Banned From Apple's App Store After Judge Refuses Epic's Request", "transed": 1, "url": "https://bgr.com/2020/10/10/fortnite-download-iphone-ipad-verdict-epic-loses-injuction/", "via": "", "real_tags": ["apple", "苹果", "拒绝", "remains"]}, {"category": "", "categoryclass": "", "imagename": "45c76941bc18ab197687721c9c4137b5.jpg", "infoid": 1028238, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "第一次在Android手机上启动Xbox One游戏时跳到主要内容可能是超现实的。本月早些时候，我在Pixel3A手机上打开了游戏通行证(Game Pass)应用程序，在设备设置中通过蓝牙连接了Xbox One控制器，并在“光晕5：守护者”(Halo 5：Gudians)页面上点击了“播放”按钮。在有点长的加载时间之后，我出现在菜单屏幕上，准备玩我在2016年留下的一模一样的光环5战役。\n令我惊讶的是，我的保存文件完好无损，并且可以在云中访问，这让我可以从停止的地方重新开始。最棒的是：我甚至不需要打开我最初玩游戏的Xbox One的包装。它被放在一个盒子里，没有插上插头，这正是我在夏末搬回东海岸后放在那里的地方。\n我进入光晕5，再次开始玩，滞后有点明显，但没有打破游戏规则，图像足够清晰，可以在小像素屏幕上玩。通过每月15美元的游戏通行证订阅和15美元的PowerA Moga控制器夹子，我现在有了一个舒适的手机游戏机，我可以在公寓的任何地方玩-比如Halo 5和其他几十款游戏，包括我从未拥有过的，还有一些我甚至不知道的。感觉就像在我的手机上播放着一个正在进行中的未来版本。\n微软新的云游戏测试版很容易嵌入其现有的游戏通行证服务和更广阔的Xbox愿景，这掩盖了一个事实，即XCloud是一个非常粗略的草案。这是该公司未来打造更强大、更具弹性的游戏业务所需的那种最先进平台的非常早期版本。在目前的状态下，XCloud运行得足够好，带来了足够多独特的好处，足以让我们相信微软在追赶索尼七年后有了一个连贯的卷土重来的计划。\n然而，如果XCloud想要在每月15美元的订阅服务中赢得一席之地，并与谷歌体育场(Google Stadia)和英伟达GeForce Now等更成熟的服务竞争，这两项服务都已经可以在多个平台上使用，那么还有很多地方需要改进。\nXCloud在当前形式下是一个看似简单的产品。你不需要太多就可以使用它-一部运行6.0或更高版本的Android手机就足够了，外加最低10 Mbps的互联网连接，希望还有5 GHz的Wi-Fi网络，而且你可能会需要一个蓝牙控制器。触摸输入目前仅限于一款游戏“我的世界地下城”，并计划在未来某个时候支持游戏通行库的一小部分。(此外，在云游戏服务上玩触摸屏通常是一种痛苦的体验。)。\n你还需要每月支付15美元才能订阅Game Pass旗舰版，但XCloud并不是唯一的好处：除了将游戏流式传输到你的手机上，它还可以让你在Xbox和PC上访问100多款游戏。Game Pass应用程序本身简单易用，响应迅速，设计精良。\n有一个连贯的列表排列，很容易用蓝牙控制器操作，所以你不需要搜索特定的游戏。在顶端有一个专门的旗舰游戏列表，比如最近添加的“毁灭永恒”，你以前玩过的游戏的“跳回”部分，最近添加的游戏列表，“在手机上玩得很棒”集合，以及最受欢迎的排行榜。\n当微软升级其运行的硬件时，XCloud未来可能会变得更快。\n点击任何一款游戏都会让你知道它是可以通过流媒体播放，还是只能下载到配对的PC或Xbox上。(我们在这里有Game Pass的定价和各种订阅级别的细目，以及此处的XCloud How-to指南。)。\n微软正在使用Xbox one S硬件的定制刀片式服务器上运行这项服务，但该公司计划将该平台过渡到Xbox系列S/X级硬件，以提高未来的性能。我们不一定知道这到底是什么意思，但一位熟悉微软计划的消息人士告诉The Verge，它将在Xbox系列S/X中加入快速固态硬盘，这可能会缩短加载时间，并提供其他性能增强。\n然而，现在XCloud的加载时间和滞后相当明显，落后于Stadia和GeForce。即使纽约州北部的Spectrum下载速度约为110 Mbps，并通过5 GHz的Wi-Fi网络，像Gears 5和Halo：The Master首席收藏这样的游戏对它们来说也有一些明显的迟缓，当游戏在高强度交火中需要精确度和快速反应时，需要考虑到这一点。但我要说的是，游戏的图形密集度越低，流媒体的感觉就越好。与我在PC上的体验相比，奥里和幽灵的意志几乎玩得无懈可击。\n至于加载时间，对于现代的Xbox One和电脑游戏，如Gears 5和The External Worlds，你需要大约一到一分钟半的加载时间才能通过XCloud加载屏幕(游戏自己的加载屏幕)，直到游戏中的菜单记录输入。这在移动设备上有点尴尬，因为你只能盯着屏幕等待游戏加载-切换到另一个应用程序或退出主屏幕会暂停加载过程。\nStadia在移动设备上的加载速度要快得多，它的好处是可以在更多的平台上工作。\n在谷歌体育场上，我们已经看到游戏的加载速度提高了两到三倍，像“命运2”或“古墓丽影”这样的成熟游戏机游戏在体育场的Android移动应用上通常只需要20到30秒。Mortal Kombat 11是这两种服务上为数不多的几款游戏之一，它在Stadia上只需30到35秒左右就会加载到菜单中，而在XCloud上启动需要一分钟多的时间。虽然命运2在两个平台上的加载时间几乎相同(并将你的PC保存文件保存在Stadia上)，但我发现在XCloud上玩游戏要频繁得多。\n我用15个最流行的Xbox one游戏通行证用户可能想要流传输的游戏来测试XCloud加载时间，并将结果汇总到下面的图表中。请记住，这些是基于我的经验的估计-您的结果可能会有所不同。\n这就是我们开始看到XCloud真正承诺的地方。你可以开始在你的Xbox上本地玩最热门的微软新游戏，继续玩通过Game Pass旗舰版下载到你电脑上的同一款游戏，然后在Android上通过XCloud进行流媒体播放。有了交叉购买和交叉进阶，一切都在云中同步。\nXCloud的真正功能是让您的游戏和保存文件，所有这些都在云中同步。\n这是一个你不能在任何其他服务中复制的场景-这也是微软目前XCloud的一大卖点，即使任何Game Pass订户真正利用所有这些福利的可能性仍然很小。未来这可能意味着什么的承诺仍然存在，这是令人兴奋的。\n微软无疑将在升级其网络基础设施并引入硬件和软件效率以顺利完成这一过程时改善体验。毫无疑问，当XCloud平台支持智能电视/流媒体机顶设备、浏览器和专用桌面应用程序时，XCloud上的游戏在有线连接上的感觉和游戏效果会好得多。\n但它需要做这些事情才能具有竞争力，微软还没有详细说明它将在何时以及如何实现这些事情-尽管我们现在知道，它计划通过移动浏览器将XCloud引入iOS，同时它也可以在合适的PC版本上运行。目前，仅限Android的测试版只是一种小规模的方式来享受可以说是我们迄今为止最具前瞻性的云游戏服务的好处。但现在要每月花15美元购买微软的Game Pass旗舰版还不够令人信服。\n但目前XCloud真正需要的只是测试版。距离下一代游戏机的到来还有一个月的时间，游戏硬件和软件分销将迎来一个新的、不确定的时代。谷歌、亚马逊和其他公司都在打赌，他们可以通过让你在任何屏幕上使用云游戏在任何地方玩游戏，来吸引你远离只有几款新游戏的闪亮新盒子的前景-但露娜还没有推出，体育场在推出近一年后仍在努力建立消费者的信任。\n与此同时，微软以每月15美元的价格提供了可以在其新款Xbox上玩的一整套游戏库，并免费推出了大量的云游戏。该公司仍在努力重新赢得由于一系列公司失误、营销嗅觉以及未能跟上独家驱动的游戏机战略的步伐而失去的一代游戏玩家的信任。索尼的主要竞争对手索尼(Sony)只是处于更有利的地位，能够实现这一战略。\n微软仍在努力赢回在Xbox One时代失去的一代游戏玩家的信任\n许多失败的Xbox游戏玩家，包括我在内，离开了Xbox品牌，在PlayStation平台上建立了核心的朋友网络和游戏库，微软很难赢回这些消费者。\n不过，XCloud和Game Pass可以帮助微软实现这一目标。这些工具意味着微软不必像过去七年那样尝试着与索尼竞争，即使收购Bethesda让它有更多的资源来玩索尼的游戏，如果它愿意的话。在Xbox360问世的那些年里，我是一个忠实的Xbox粉丝，我一直在寻找回归的理由。\n多亏了XCloud，我相信微软将开辟出一条前进的道路，我可以在其中迁移我的库，并将文件保存到我喜欢的任何屏幕上。这可能足以让我买一台新的Xbox，如果这意味着无论我走到哪里，我的游戏都会随身携带。\n断路器在闻了两次之后，Razer最新的Tomahawk PC外壳看起来足够实用，足以真正存在。\nGaming Razer的第一把游戏椅是一把曲线更曲线型的SECRETLab Omega/Titan，带有奇特的腰部支撑。\n游戏亚马逊已经取消了它的免费多人射击游戏Crucble，这款游戏已经恢复到封闭测试版。\n查看游戏中的所有故事", "note_en": "Skip to main content                                                                                                                The first time you boot up an Xbox One game on an Android phone can be surreal. Earlier this month, I opened the Game Pass app on a Pixel 3A phone, connected an Xbox One controller via Bluetooth in the device settings, and tapped the “play” button on the page for  Halo 5: Guardians. After a somewhat lengthy loading time, there I was on the menu screen, ready to play the exact same  Halo 5 campaign that I left unfinished back in 2016.\n It surprised me that my save file was intact and accessible in the cloud, letting me pick up right where I left off. The best part: I didn’t even have to unpack the Xbox One where I originally played the game. It’s sitting unplugged in a box, exactly where I left it since moving back to the East Coast at the end of the summer.\n  I dropped into  Halo 5 and began playing once again, the lag a bit noticeable but not game-breaking and the graphics sharp enough for playing on a small Pixel screen. With a $15-a-month Game Pass subscription and a $15 PowerA MOGA controller clip, I now have a comfortable mobile game console I can play anywhere in my apartment — with  Halo 5 and dozens of other games, including ones I never owned and some I wasn’t even aware of. It feels like having a work-in-progress version of the future playing out on my phone.\n The ease with which Microsoft’s new cloud gaming beta slots into its existing Game Pass service and broader Xbox vision obscures the fact that xCloud is very much a rough draft. It’s a very early version of the kind of state-of-the-art platform the company will need to forge a stronger, more resilient gaming business going forward. In its current state, xCloud works well enough and brings enough unique benefits to convince us Microsoft has a coherent comeback plan after seven years playing catch-up with Sony.\n Yet there is much that needs improving if xCloud is going to earn its place in the company’s $15-a-month subscription service and compete with more fully-formed services, like Google Stadia and Nvidia GeForce Now, both of which are already available on multiple platforms.\n   xCloud is a deceptively simple product in its current form. You don’t need much to use it — an Android phone running version 6.0 or later is enough, plus a minimum 10Mbps internet connection and hopefully a 5GHz Wi-Fi network, and you’ll probably want a Bluetooth controller. Touch inputs are currently limited to a single game,   Minecraft Dungeons, with plans to support a small slice of the Game Pass library some time in the future. (Also, playing with a touchscreen on a cloud gaming service has generally been a miserable experience.)\n You’ll also need to pay $15 a month for a Game Pass Ultimate subscription, but xCloud isn’t the only benefit: it gives you access to over 100 games on Xbox and PC in addition to streaming games to your phone. The Game Pass app itself is easy to use, responsive, and well-designed.\n There’s a coherent arrangement of lists that are easily maneuverable with a Bluetooth controller, so you don’t need to search for a specific game. There is a dedicated list of flagship games up top like the recently added  Doom Eternal, a “jump back in” section for games you’ve played before, a list of recently added games, a “plays great on mobile” collection, and a most popular leaderboard.\n xCloud may get faster in the future when Microsoft upgrades the hardware it runs on\n Tapping any one game will let you know if it’s able to be played via streaming, or if it can only be downloaded to a paired PC or Xbox. (We have a breakdown of the pricing and various subscription tiers for Game Pass  here, as well as an xCloud how-to guide  here.)\n Microsoft is running the service on custom server blades using Xbox One S hardware, but the company plans to transition the platform to Xbox Series S/X grade hardware to improve performance down the line. We don’t necessarily know exactly what that means, but a source familiar with Microsoft’s plans tell  The Verge it’ll include the speedy solid-state drive in the Xbox Series S/X, which could improve load times and provide other performance enhancements.\n Right now, however, xCloud load times and lag are quite noticeable, and fall behind those of Stadia and GeForce Now. Even with an upstate New York-based Spectrum download speed of roughly 110Mbps and over a 5GHz Wi-Fi network, games like  Gears 5 and  Halo: The Master Chief Collection had some noticeable sluggishness to them that needed accounting for when the games required precision and fast reflexes during high-intensity firefights. But I will say that the less graphically intensive a game was, the better it felt to stream.  Ori and the Will of the Wisps played almost flawlessly compared to the experience on my PC.\n As for load times, with modern Xbox One and PC games like  Gears 5 and  The Outer Worlds, you’re looking at load times of around one to one and a half minutes to get past the xCloud loading screen, the game’s own loading screen, and to the point when the in-game menu registers an input. That’s a bit awkward on mobile given you can’t do anything else but stare at the screen and wait for the game to load — switching to another app or exiting to the home screen suspends the loading process.\n Stadia loads much faster on mobile, and it has the benefit of working on more platforms\n On Google Stadia, we’ve seen games load two to three times faster, with full-fledged console titles like  Destiny 2 or  Shadow of the Tomb Raider often taking just 20 to 30 seconds on Stadia’s Android mobile app.  Mortal Kombat 11, one of the few games available on both services, loads into its menu on Stadia after just 30 to 35 seconds or so, compared with the more than a minute of time it takes to boot up on xCloud. And while  Destiny 2 takes about almost the same amount of time to load on both platforms (and retains your PC save file on Stadia), I found playing on xCloud to be much choppier.\n I tested xCloud load times with 15 of the most popular Xbox One titles Game Pass subscribers might want to stream, and compiled the results in the chart you’ll find below. Keep in mind these are estimates based on my experiences — your results might vary.\n  These aren’t  awful loading times, but they are a definite delay: I often found myself resting my controller with the Pixel attached to my couch and just browsing on my iPad or laptop while I waited for a game to load. And because different games load at different times, you never quite know what to expect. The inconsistency and inconvenience sounds minor on paper, but it does noticeably detract from the overall experience in a way a full-fledged, non-beta product won’t be able to afford.\n   Microsoft has ways to potentially reduce load times and lag, including the servers it’s already promised to upgrade. But arguably a bigger differentiating factor between xCloud, Google Stadia, GeForce Now, and the  upcoming Amazon Luna is the business model — how they intend to make money and sustain themselves, what they have to offer game manufacturers to convince them to hop aboard, and which games each can actually offer to players like you.\n Google charges Stadia players for individual games, regardless of whether the user is on its free tier or paying for a $10-a-month Stadia Pro subscription, which grants you 4K streaming and access to a library of free titles similar to PlayStation Plus or Xbox Live Gold. GeForce Now only costs $5 a month (it does have a very limited free tier), but only allows you to stream games you already own and purchased via Steam, and  only if a publisher has agreed to allow Nvidia to redistribute them over its cloud platform.\n The popularity of cloud gaming will depend on which business models catch on with consumers\n PlayStation Now, Sony’s streaming service that has quietly operated since 2014, is the closest to xCloud in theory, providing more than 800 games for a $10 a month subscription. But it doesn’t typically include very recent Sony games, doesn’t let you download every one of its games for offline play like Xbox Game Pass (although it did add the feature for select titles in 2018), and doesn’t have a mobile app, though it is on Mac and Windows PC. PS Now is best designed as a service running on a Sony console you already own, as a way to experience games you’d rather not buy and wait to download.\n Those various business models, as well as the fact that neither Google nor Nvidia are publishers with access to their own game catalogs ( yet), mean cloud gamers are getting different software libraries with different levels of access. Some game makers, like  Destiny developer Bungie, will make their games available via Stadia Pro, while others like Larian Studios (creator of  Baldur’s Gate 3) will only sell their titles at full price on Google’s platform. Some game makers like Epic will opt to be a part of GeForce Now, while others like Activision Blizzard won’t let Nvidia stream their titles no matter what.\n Depending on who owns what, your access to a cloud game could be revoked at any time, just as movies and TV shows come and go on Netflix, Hulu, and other video streaming services. The same is true for Sony’s PlayStation Now, which has plenty of the company’s first-party titles, but only offers access to whatever third-party games Sony can license.\n Microsoft, like Sony, does have the added benefit of owning a large swath of the game industry’s biggest developers, and it most recently  added the massive library of Bethesda Softworks to its roster. That gives xCloud a big boost, but the architecture of Game Pass happens to give xCloud a distinct edge over PlayStation Now because Game Pass games can be downloaded and played on an Xbox or PC with the added benefit of carrying your save progress across devices. And unlike Sony, Microsoft has committed to bringing its very latest games to Game Pass instead of limiting the cloud platform to mostly older titles.\n That’s where we start to see the true promise of xCloud. You can start playing the hottest new Microsoft game locally on your Xbox, resume playing that same title downloaded to your PC via Game Pass Ultimate, and then stream on-the-go via xCloud on Android. With cross-buy and cross-progression, everything is synced in the cloud.\n The true power of xCloud is taking your games and save files, all of it synced in the cloud\n That’s a scenario you can’t replicate with any other service — and it’s Microsoft’s big selling point for xCloud right now, even if the likelihood of any Game Pass subscriber actually taking advantage of all of those perks remains slim. The promise of what this could mean in the future is still there, and it’s exciting.\n Microsoft will no doubt improve the experience as it upgrades its network infrastructure and introduces hardware and software efficiencies to smooth out the process. And no doubt games over xCloud will feel and play much better on a wired connection when the platform does support smart TVs / streaming set-top devices, browsers, and dedicated desktop apps.\n But it needs to do those things to be competitive, and Microsoft hasn’t yet detailed when and how it’ll make these things happen — though we now know it has plans  to bring xCloud to iOS via mobile browsers while it works on a proper PC version, too. For now, the Android-only beta is just a small-scale way to enjoy the benefits of arguably the most forward-thinking cloud gaming service we have to date. But it’s not a compelling enough reason right now to spend $15 a month on Microsoft’s Game Pass Ultimate all by itself.\n But a beta is all xCloud really needs to be at the moment. We’re a month out from the next-gen consoles arriving and ushering in a new, uncertain era for gaming hardware and software distribution. Google, Amazon and others are betting they can entice you away from the prospect of a shiny new box with only a few new games, by letting you play anywhere on any screen using the cloud — but Luna hasn’t launched yet and Stadia is still struggling to build consumer trust nearly a year after launch.\n Meanwhile, Microsoft is offering an entire library of games you can play on its new Xbox for $15 a month, and it’s throwing a substantial taste of cloud gaming for free. The company is still trying to earn back the trust of a generation of gamers it lost through a series of corporate misfires, marketing whiffs, and a failure to keep pace with an exclusive-driven console strategy its primary competitor Sony was simply better positioned to pull off.\n Microsoft is still trying to earn back the trust of a generation of gamers it lost during the Xbox One era\n A lot of lapsed Xbox gamers, myself included, left the Xbox brand and built core networks of friends and a library of games on the PlayStation platform, and it’ll be difficult for Microsoft to win those consumers back.\n xCloud and Game Pass could help Microsoft get there, though. These tools mean Microsoft doesn’t have to compete with Sony the way it tried for the last seven years, even if a Bethesda acquisition gives it more resources to play Sony’s game if it likes. I was a devout Xbox fan during the years of the Xbox 360, and I’ve been looking for a reason to return.\n Thanks to xCloud, I’m confident Microsoft will forge a path forward in which I can migrate my library and save files to whatever screen I like. That might be reason enough for me to get a new Xbox, if it means my games come with me wherever I go.\n Circuit Breaker   After two whiffs, Razer’s latest Tomahawk PC cases look practical enough to actually exist\n  Gaming   Razer’s first gaming chair is a curvier Secretlab Omega / Titan with fancy lumbar support\n  Gaming   Amazon has canceled Crucible, its free-to-play multiplayer shooter that had already been returned to closed beta\n  View all stories in Gaming", "posttime": "2020-10-12 08:05:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,微软,商业,游戏,移动", "title": "微软的测试版云游戏服务XCloud无法与Stadia竞争，但它凭借Game Pass的商业模式、移动体验和庞大的目录脱颖而出", "title_en": "Microsoft's beta cloud gaming service xCloud can't compete with Stadia, but it stands out with its Game Pass business model, mobile experience, and big catalog", "transed": 1, "url": "https://www.theverge.com/2020/10/11/21498822/microsoft-xcloud-hands-on-review-xbox-game-pass-ultimate-lag-load-times?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["microsoft", "微软", "商业", "游戏", "移动"]}, {"category": "", "categoryclass": "", "imagename": "8628cb04d2d091f257caf791e768922b.jpg", "infoid": 1028237, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "9月14日，GitLab支持团队升级了我们的一位客户遇到的一个严重问题：GitLab可以正常运行一段时间，但一段时间后用户遇到错误。当试图通过Git克隆某些存储库时，用户会看到一条不透明的Stalefile错误消息。错误消息持续了很长一段时间，阻止员工工作，除非系统管理员通过在目录本身中运行ls进行手动干预。\n因此，对Git和网络文件系统(NFS)的内部工作方式展开了调查。调查发现了LinuxV4.0NFS客户端的一个缺陷，并以Trond Myklebustand编写的内核补丁达到顶峰，该补丁于10月26日合并到最新的主流Linux内核中。\n这篇文章描述了调查这一问题的过程，并详细介绍了我们追踪漏洞的思路、过程和工具。它的灵感来自于我如何花两周时间在Ruby Oleg Dashevskii中寻找内存泄漏的出色侦探工作。\n更重要的是，这一经历证明了开源软件调试已经成为一项团队运动，涉及多个人、多个公司和多个地点的专业知识。GitLab的座右铭每个人都可以贡献，这不仅适用于GitLab本身，也适用于其他开源项目，如Linux内核。\n虽然我们在GitLab.com上运行NFS已经有很多年了，但我们已经停止使用它来跨我们的应用程序机器访问存储库数据。相反，我们已将所有Git调用抽象到Gitaly.尽管如此，NFS仍然是我们的客户支持的配置，这些客户管理他们自己的GitLab安装，但我们以前从未见过客户描述的确切问题。\n这个错误似乎是从他们通过GitGC开始手动运行Git垃圾收集时开始的。\n前两项似乎明显相关。当您推送到分支Git时，Git会为文件创建一个松散引用，一个花哨的名称，它将您的分支名称指向提交。例如，推送到master将在存储库中创建一个名为refs/head/master的文件：\nGitGC有几个工作，但其中之一是收集这些松散引用(Ref)，并将它们捆绑到一个称为Pack-Refs的文件中。这样就不需要读取大量的小文件，而只需要读取一个大文件，因此速度更快。例如，在运行git gc之后，一个打包的引用示例可能如下所示：\n这个压缩引用文件究竟是如何创建的？为了回答这个问题，我们用一个松散的裁判礼物运行了strace git GC。以下是与此相关的几句话：\n28705 open(&#34；/tmp/libgit2/.git/packed-refs.lock&#34；，O_RDWR|O_CREAT|O_EXCL|O_CLOEXEC，0666)=328705 OPEN(&#34；.GIT/PACKED-REFS&#34；，O_RDONLY)=328705 open(&#34；/tmp/libgit2/.git/packed-refs.new&#34；，O_RDWR|O_CREAT|O_EXCL|O_CLOEXEC，0666)=428705 rename(&#34；/tmp/libgit2/.git/packed-refs.new&#34；，&#34；/tmp/libgit2/.git/packed-refs&#34；)=028705 unlink(&#34；/tmp/libgit2/.git/packed-refs.lock&#34；)=0。\n第四步是这里的关键：Git将打包引用放入行动的重命名。除了收集松散的引用之外，gitGC还执行一项代价更高的任务，即扫描未使用的对象并将其删除。对于较大的存储库，此任务可能需要一个多小时。\n这让我们不禁要问：对于大型存储库，GitGC在运行扫描时是否保持文件打开？查看strace日志并使用lsof探测该进程，我们发现它执行以下操作：\n请注意，只有在可能很长的垃圾收集对象步骤发生后，Package-Ref才会在末尾关闭。\n这就提出了下一个问题：当一个节点已打包引用打开，而另一个节点重命名该文件时，NFS的行为如何？\n为了进行实验，我们要求客户在两台不同的机器(Alice和Bob)上运行以下实验：\n在共享NFS卷上，创建两个内容不同的文件test1.txt和test2.txt以便于区分：\nAlice$echo&#34；1-旧文件&#34；&gt；/path/to/nfs/test1.txt alice$echo&#34；2-新文件&#34；&gt；/path/to/nfs/test2.txt。\n对啰!。我们似乎以一种可控的方式重现了这个问题。然而，使用Linux NFS服务器的相同实验没有这个问题。结果与您预期的一样：在重命名之后添加了新内容：\n1-旧文件1-旧文件1-旧文件2-新文件&lt；-重命名HAPPENED2-新文件2-新文件。\n为什么会有行为上的差异呢？事实证明，该客户使用的是仅支持NFS V4.0的Isilon NFS应用装置。通过/etc/fstab中的vers=4.0参数将挂载参数切换到V4.0，测试显示了Linux NFS服务器的不同结果：\n1-旧文件1-旧文件&lt；-重命名HAPPENED1-旧文件1-旧文件。\nLinuxNFS V4.0服务器显示的不是陈旧的文件句柄，而是陈旧的内容。事实证明，这种行为差异可以用NFS规范来解释。来自RFC3010：\n文件句柄可能会变得陈旧，也可能不会因重命名而过期。但是，强烈建议服务器实现者尝试避免文件句柄变得陈旧或以这种方式过期。\n换句话说，NFS服务器可以选择文件重命名时的行为方式；当文件重命名时，任何NFS服务器返回陈旧的文件错误都是完全有效的。我们推测，尽管结果不同，但问题很可能与同一问题有关。我们预计会出现一些缓存验证问题，因为在目录中运行ls会清除该错误。现在我们有了一个可重现的测试用例，我们询问了专家：Linux NFS维护者。\n通过一套清晰的复制步骤，我向LinuxNFS邮件列表发送了一封电子邮件，描述了我们发现的内容。在过去的一周里，我与Linux NFS服务器维护人员Bruce Fields来回走动，他认为这是一个NFS错误，查看网络流量会很有用。他认为NFS服务器委派可能存在问题。\n简而言之，NFS v4引入了服务器委托作为加速文件访问的一种方式。服务器允许对客户端进行读或写访问，因此客户端不必不断询问服务器该文件是否已被其他客户端更改。简而言之，写作委派类似于有人借给你一本笔记本，然后说：“那就在这里写吧，等我准备好了，我就把它拿回来。你不必每次想写新段落时都要借笔记本，你可以自由支配，直到主人收回笔记本为止。”(这句话的意思是：“你可以随意借笔记本，直到主人拿回笔记本为止。)”(这句话的意思是：“写委派”就像是有人借给你一本笔记本，然后说，你可以在这里写字，等我准备好了，我就把它拿回来。)。在NFS术语中，这个回收过程称为委托召回。\n实际上，NFS委派召回中的错误可能解释了陈旧的文件句柄问题。请记住，在较早的实验中，Alice在后来被test2.txt替换时将文件打开到test1.txt。可能是服务器无法重新调用test1.txt上的委派，从而导致状态不正确。为了检查这是否是一个问题，我们转向tcpdump来捕获NFS流量，并使用Wireshark将其可视化。\nWireshark是一个很棒的分析网络流量的开源工具，特别适合查看NFSin操作。我们在NFS服务器上使用以下命令捕获跟踪：\n此命令捕获所有NFS流量，通常在TCP端口2049上。由于我们的实验在NFS v4.1上运行正常，但在NFS v4.0上运行正常，因此我们可以比较和对比NFS在非工作和正常工作情况下的行为。使用Wireshark时，我们看到以下行为：\n在此图中，我们可以看到在步骤1中，Alice打开test1.txt并获取NFS文件句柄和stateid 0x3000。当Bob尝试重命名文件时，NFS服务器告诉Bob通过NFS4ERR_DELAY消息重试，同时从Alicevia调回CB_RECALL消息的委派(步骤3)。然后，Alice通过DELEGRETURN返回她的委托(步骤4)，然后Bob尝试发送另一个重命名消息(步骤5)。重命名在这两种情况下都完成了，但是Alice继续使用相同的文件句柄进行读取。\n主要区别在步骤6的底部。请注意，在NFSV4.0(陈旧的文件情况)中，Alice尝试重用相同的stateid。在NFS V4.1(工作情况)中，Alice执行额外的查找和打开，这会导致服务器返回不同的stateid。在V4.0中，这些额外的消息永远不会发送。这就解释了为什么Alice继续查看过时的内容，因为她使用的是旧的文件句柄。\n是什么让爱丽丝决定做额外的查找呢？代表团召回似乎运作良好，但可能仍然存在一个问题，例如取消无效步骤。要排除这种情况，我们通过在NFS服务器本身上发出以下命令来禁用NFS委派：\n我们重复了实验，但问题仍然存在。所有这些都让我们相信，这不是NFS服务器问题，也不是NFS委派的问题；这是一个导致我们研究内核中的NFS客户端的问题。\n该问题出现在CentOS 7.2和Ubuntu 16.04内核上，这两个内核分别使用版本3.10.0-862.11.6和4.4.0-130。然而，这两个内核都落后于最新的内核，后者当时是4.19-rc2。\n我们在Google Cloud Platform(GCP)上部署了一个新的Ubuntu16.04虚拟机，克隆了最新的Linux内核，并搭建了内核开发环境。通过make menuconfig生成.config文件后，我们检查了两项：\n正如遗传学家会使用果蝇实时研究进化一样，第一个项目允许我们在NFS客户端进行快速更改，而不必重启内核。第二项是为了确保内核在安装后能够真正引导。幸运的是，默认内核设置有所有开箱即用的设置。\n使用我们的自定义内核，我们验证了在最新版本中仍然存在过时文件问题。这引发了一些问题：\n为了回答这些问题，我们开始研究NFS源代码。因为我们没有可用的内核调试器，所以我们在源代码中使用了两种主要类型的调用：\n例如，我们首先做的一件事是挂接fs/nfs/nfs4file.c中的nfs4_file_open()函数：\n诚然，我们可以使用Linux动态调试器或使用rpcdebug来激活dprintk消息，但是能够添加我们自己的消息来验证正在进行的更改是件好事。\n每次进行更改时，我们都会通过以下命令重新编译模块并将其重新安装到内核中：\n安装了NFS模块后，重复实验将打印消息，这将帮助我们更好地理解NFS代码。例如，您可以看到应用程序调用open()时到底发生了什么：\n9月24 20：20：38测试内核：[1145.233460]调用跟踪：9月24 20：20：38测试内核：[1145.233462]转储_堆栈+0x8e/0xd5 9月24 20：20：38测试内核：[1145.233480]nfs4_FILE_OPEN+0x56/0x2a0[nfsv4]9月24 20：20：38测试内核：[1145.233488]？Nfs42_CLONE_FILE_RANGE+0x1c0/0x1c0[nfsv4]9月24 20：20：38测试内核：[1145.233490]do_dentry_open+0x1f6/0x360 9月24 20：20：38测试内核：[1145.233492]vfs_open+0x2f/0x409月24 20：20：38测试内核：[1145.233493]path_openat+0x2e8/0x16909月24 20：20：38测试内核：[1145.233496]？MEM_CGROUP_TRY_CHAGE+0x8b/0x190 9月24 20：20：38测试内核：[1145.233497]DO_FILP_OPEN+0x9b/0x110 9月24 20：20：38测试内核：[1145.233499]？__CHECK_OBJECT_SIZE+0xb8/0x1b0 9月24 20：20：38测试内核：[1145.233501]？_ALLOC_FD+0x46/0x170 9月24 20：20：38测试内核：[1145.233503]DO_SYS_OPEN+0x1ba/0x250 9月24：20：38测试内核：[1145.233505]？Do_sys_open+0x1ba/0x250 9月24 20：20：38测试内核：[1145.233507]__x64_sys_openat+0x20/0x30 9月24 20：20：38测试内核：[1145.233508]do_syscall_64+0x65/0x130。\n上面的do_dentry_open和vfs_open调用是什么？Linux有一个虚拟文件系统(VFS)，这是一个为所有文件系统提供公共接口的抽象层。VFS文档说明：\nVFS实现open(2)、stat(2)、chmod(2)和类似的系统调用。VFS使用传递给它们的路径名参数搜索目录条目缓存(也称为dentrycache或dcache)。这提供了一种非常快速的查找机制，可以将路径名(文件名)转换为特定的dentry。Dentry保存在RAM中，永远不会保存到磁盘：它们的存在只是为了性能。\n这给了我们一个线索：如果这是dentry缓存的问题怎么办？\n我们注意到很多dentry缓存验证是在fs/nfs/dir.c中完成的。特别值得一提的是，nfs4_lookup_revalid()听起来很有希望。作为一项实验，我们破解了该功能，以便及早纾困：\nDiff--git a/fs/nfs/dir.c b/fs/nfs/dir.cindex 8bfaa658b2c1..ad479bfeb669 100644-a/fs/nfs/dir.c+b/fs/nfs/dir.c@@-1159，6+1159，7@@static int nfs_lookup_revalify(struct dentry*dentry，unsign int flag)trace_nfs_lookup_revalify_enter(dir，dentry，flag)；error=NFS_label(Dir)-&gt；lookup(目录，&amp；dentry-&gt；d_name，fHandle，fattr，fattr)；Trace_nfs_lookup_revalid_exit(目录，dentry，标志，错误)；+转到OUT_BAD；IF(ERROR==-ESTALE||ERROR==-ENOENT)转到OUT_BAD；IF(ERROR)\n这使得我们实验中的陈旧文件问题消失了！现在我们说到点子上了。\n为了回答，为什么这个问题在NFS v4.1中没有发生？&#34；，我们在该函数中的每个if块中添加了pr_info()调用。在使用NFSv4.0和v4.1运行oureeximents之后，我们发现在v4.1情况下运行此特殊条件：\n什么是NFS_CAP_ATOM_OPEN_V1？我们看到这个内核补丁提到这是NFS V4.1特有的特性，fs/nfs/nfs4proc.c中的代码确认该标志是V4.1中存在的功能，但在V4.0中没有：\n静态常量结构nfs4_Minor_Version_ops nfs_v4_1_Minor_ops={。Minor_Version=1，。Init_caps=NFS_CAP_READDIRPLUS|NFS_CAP_ATOM_OPEN|NFS_CAP_POSIX_LOCK|NFS_CAP_STATEID_NFSV41|NFS_CAP_ATOM_OPEN_V1。\n这就解释了行为上的差异：在V4.1中，gotono_open会导致nfs_lookup_revalid()中发生更多验证，但在V4.0中，nfs4_lookup_revalify()会更早返回。现在，我们如何真正解决这个问题呢？\n我将发现报告给了NFS邮件列表，并提出了一个简单的补丁。报告发布一周后，Trond Myklebust向List发送了修复此错误的补丁系列，并发现了NFSv4.1的另一个相关问题。\n事实证明，对NFS V4.0错误的修复在代码库中比我们看到的更深。Trond在补丁中很好地总结了这一点：\n我们需要确保在重新打开已打开的文件时正确进行inode和dentry重新验证。目前，由于&#39；缓存的打开路径，在NFSv4.0的情况下，我们可能最终不会验证这两种方法中的任何一种。让我们通过确保只为开放恢复和委派返回的特殊情况打开缓存来解决这个问题。\n我们确认这个修复解决了过时的文件问题，并使用Ubuntu和RedHat归档错误报告。\n我们深知内核更改可能需要一段时间才能稳定发布，因此我们还在Gitaly中添加了一个解决方法来处理此问题。我们进行了实验，以测试对压缩引用文件调用stat()似乎会导致内核重新验证重命名文件的dentrycache。为简单起见，这是在Gitaly中实现的，而不管文件系统是否为NFS；我们只在Gitaly&#34；打开存储库之前执行一次，并且已经有其他stat()调用来检查其他文件。\n错误可能在您的软件堆栈中的任何位置，有时您必须在应用程序之外寻找才能找到它。在开放源码世界中拥有乐于助人的合作伙伴使这项工作变得容易得多。\n我们非常感谢Trond Myklebust解决了这个问题，Bruce Fields回答了问题并帮助我们了解了NFS。他们的响应性和专业性真实地反映了开放源码社区的优秀之处。\n注册GitLab每月两次的时事通讯，探索即将到来的网络广播、操作博客，并随时了解每月发布的令人兴奋的新功能：\nGitLab不仅仅是源代码管理或CI/CD。它是一个完整的软件开发生命周期&在单个应用程序中的DevOps工具。\n免费试用GitLab。\nGit是软件自由保护协会的商标，我们对GitLab的使用正在获得许可", "note_en": "On Sep. 14, the GitLab support team escalated a criticalproblem encountered by one of our customers: GitLab would run fine for awhile, but after some time users encountered errors. When attempting toclone certain repositories via Git, users would see an opaque  Stalefile error message. The error message persisted for a long time,blocking employees from being able to work, unless a systemadministrator intervened manually by running  ls in the directoryitself.\n Thus launched an investigation into the inner workings of Git and theNetwork File System (NFS). The investigation uncovered a bug with theLinux v4.0 NFS client and culiminated with a  kernel patch that was written byTrond Myklebustand  merged in the latest mainline Linux kernelon Oct. 26.\n This post describes the journey of investigating the issue anddetails the thought process and tools by which we tracked down thebug. It was inspired by the fine detective work in  How I spent twoweeks hunting a memory leak in Rubyby Oleg Dashevskii.\n More importantly, this experience exemplifies how open source softwaredebugging has become a team sport that involves expertise acrossmultiple people, companies, and locations. The GitLab motto &#34; everyone cancontribute&#34; applies not only to GitLab itself, but also to other opensource projects, such as the Linux kernel.\n  While we have run NFS on GitLab.com for many years, we have stoppedusing it to access repository data across our applicationmachines. Instead, we have  abstracted all Git calls toGitaly.Still, NFS remains a supported configuration for our customers whomanage their own installation of GitLab, but we had never seen the exactproblem described by the customer before.\n  The error seemed to start when they started a manual Git garbagecollection run via  git gc.\n The first two items seemed obviously related. When you push to a branchin Git, Git creates a loose reference, a fancy name for a file thatpoints your branch name to the commit. For example, a push to  masterwill create a file called  refs/heads/master in the repository:\n  git gc has several jobs, but one of them is to collect these loosereferences (refs) and bundle them up into a single file called packed-refs. This makes things a bit faster by eliminating the need toread lots of little files in favor of reading one large one. Forexample, after running  git gc, an example  packed-refs might looklike:\n  How exactly is this  packed-refs file created? To answer that, we ran strace git gc with a loose ref present. Here are the pertinent linesfrom that:\n 28705 open(&#34;/tmp/libgit2/.git/packed-refs.lock&#34;, O_RDWR|O_CREAT|O_EXCL|O_CLOEXEC, 0666) = 328705 open(&#34;.git/packed-refs&#34;, O_RDONLY) = 328705 open(&#34;/tmp/libgit2/.git/packed-refs.new&#34;, O_RDWR|O_CREAT|O_EXCL|O_CLOEXEC, 0666) = 428705 rename(&#34;/tmp/libgit2/.git/packed-refs.new&#34;, &#34;/tmp/libgit2/.git/packed-refs&#34;) = 028705 unlink(&#34;/tmp/libgit2/.git/packed-refs.lock&#34;) = 0\n   The fourth step is the key here: the rename where Git puts  packed-refsinto action. In addition to collecting loose refs,  git gc alsoperforms a more expensive task of scanning for unused objects andremoving them. This task can take over an hour for largerepositories.\n That made us wonder: for a large repository, does  git gc keep the fileopen while it&#39;s running this sweep? Looking at the  strace logs andprobing the process with  lsof, we found that it did the following:\n  Notice that  packed-refs is closed only at the end, after the potentiallylong  Garbage collect objects step takes place.\n That begged the next question: how does NFS behave when one node has packed-refs open while another renames over that file?\n To experiment, we asked the customer to run the following experiment ontwo different machines (Alice and Bob):\n On the shared NFS volume, create two files:  test1.txt and test2.txt with different contents to make it easy to distinguish them:\n alice  $  echo  &#34;1 - Old file&#34;  &gt; /path/to/nfs/test1.txt alice  $  echo  &#34;2 - New file&#34;  &gt; /path/to/nfs/test2.txt\n    Bingo! We seemed to reproduce the problem in a controlled way. However,the same experiment using a Linux NFS server did not have thisproblem. The result was what you would expect: the new contents werepicked up after the rename:\n 1 - Old file1 - Old file1 - Old file2 - New file &lt;--- RENAME HAPPENED2 - New file2 - New file\n Why the difference in behavior? It turns out that the customer was usingan  Isilon NFSappliance thatonly supported NFS v4.0. By switching the mount parameters to v4.0 viathe  vers=4.0 parameter in  /etc/fstab, the test revealed a differentresult with the Linux NFS server:\n 1 - Old file1 - Old file1 - Old file1 - Old file &lt;--- RENAME HAPPENED1 - Old file1 - Old file\n Instead of a  Stale file handle, the Linux NFS v4.0 server showed stale contents. It turns out this difference in behavior can be explained bythe NFS spec. From  RFC3010:\n A filehandle may or may not become stale or expire on a rename.However, server implementors are strongly encouraged to attempt to keepfile handles from becoming stale or expiring in this fashion.\n In other words, NFS servers can choose how to behave if a file isrenamed; it&#39;s perfectly valid for any NFS server to return a  Stale fileerror when that happens. We surmised that even though the results weredifferent, the problem was likely related to the same issue. Wesuspected some cache validation issue because running  ls in thedirectory would &#34;clear&#34; the error. Now that we had a reproducible testcase, we asked the experts: the Linux NFS maintainers.\n  With a clear set of reproduction steps, I  sent an email to the LinuxNFS mailing listdescribing what we had found. Over the week, I went back and forth withBruce Fields, the Linux NFS server maintainer, who suggested this was aNFS bug and that it would be useful to look at the network traffic. Hethought there might be an issue with NFS server delegations.\n  In a nutshell, NFS v4 introduced server delegations as a way to speed up file access. A server candelegate read or write access to a client so that the client doesn&#39;thave to keep asking the server whether that file has changed by anotherclient. In simpler terms, a write delegation is akin to someone lendingyou a notebook and saying, &#34;Go ahead and write in here, and I&#39;ll take itback when I&#39;m ready.&#34; Instead of having to ask to borrow the notebookevery time you want to write a new paragraph, you have free rein untilthe owner reclaims the notebook. In NFS terms, this reclamation processis called a delegation recall.\n Indeed, a bug in the NFS delegation recall might explain the  Stale filehandle problem. Remember that in the earlier experiment, Alice hadan open file to  test1.txt when it was replaced by  test2.txt later.It&#39;s possible that the server failed to recall the delegation on test1.txt, resulting in an incorrect state. To check whether this wasan issue, we turned to  tcpdump to capture NFS traffic and usedWireshark to visualize it.\n Wireshark is a wonderful open source toolfor analyzing network traffic, and it&#39;s especially good for viewing NFSin action. We captured a trace using the following command on the NFS server:\n  This command captures all NFS traffic, which typically is on TCP port 2049.Because our experiment worked properly with NFS v4.1 but did notwith NFS v4.0, we could compare and contrast how NFS behavedin a non-working and a working case. With Wireshark, we saw thefollowing behavior:\n   In this diagram, we can see in step 1 Alice opens  test1.txt and getsback an NFS file handle along with a  stateid of 0x3000. When Bobattempts to rename the file, the NFS server tells to Bob to retry viathe  NFS4ERR_DELAY message while it recalls the delegation from Alicevia the  CB_RECALL message (step 3). Alice then returns her delegationvia  DELEGRETURN (step 4), and then Bob attempts to send another RENAME message (step 5). The  RENAME completes in both cases, butAlice continues to read using the same file handle.\n   The main difference happens at the bottom at step 6. Notice in NFS v4.0(the stale file case), Alice attempts to reuse the same  stateid. InNFS v4.1 (working case), Alice performs an additional  LOOKUP and OPEN, which causes the server to return a different  stateid. In v4.0,these extra messages are never sent. This explains why Alice continuesto see stale content because she uses the old file handle.\n What makes Alice decide to do the extra  LOOKUP? The delegation recallseemed to work fine, but perhaps there was still an issue, such as amissing invalidation step. To rule that out, we disabled NFS delegationsby issuing this command on the NFS server itself:\n  We repeated the experiment, but the problem persisted. All thisconvinced us this wasn&#39;t a NFS server issue or a problem with NFSdelegations; it was a problem that led us to look into the NFS clientwithin the kernel.\n    The issue occurred with both CentOS 7.2 and Ubuntu 16.04 kernels, whichused versions 3.10.0-862.11.6 and 4.4.0-130, respectively. However, boththose kernels lagged the most recent kernel, which was 4.19-rc2 at thetime.\n We deployed a new Ubuntu 16.04 virtual machine on Google Cloud Platform(GCP), cloned the latest Linux kernel, and set up a kernel developmentenvironment. After generating a  .config file via  make menuconfig, wechecked two items:\n  Just as a geneticist would use fruit flies to study evolution inreal time, the first item allowed us to make quick changes in the NFSclient without having to reboot the kernel. The second item was requiredto ensure that the kernel would actually boot after it wasinstalled. Fortunately, the default kernel settings had all the settingsright out of the box.\n With our custom kernel, we verified that the stale file problem stillexisted in the latest version. That begged a number of questions:\n  To answer these questions, we began to investigate the NFS sourcecode. Since we didn&#39;t have a kernel debugger available, we sprinkled thesource code with two main types of calls:\n  For example, one of the first things we did was hook into the nfs4_file_open() function in  fs/nfs/nfs4file.c:\n  Admittedly, we could have  activated the  dprintk messages with theLinux dynamicdebugor used  rpcdebug,but it was nice to be able to add our own messages to verify changeswere being made.\n Every time we made changes, we recompiled the module and reinstalled itinto the kernel via the commands:\n  With our NFS module installed, repeating the experiments would printmessages that would help us understand the NFS code a bit more. Forexample, you can see exactly what happens when an application calls  open():\n Sep 24 20:20:38 test-kernel kernel: [ 1145.233460] Call Trace:Sep 24 20:20:38 test-kernel kernel: [ 1145.233462] dump_stack+0x8e/0xd5Sep 24 20:20:38 test-kernel kernel: [ 1145.233480] nfs4_file_open+0x56/0x2a0 [nfsv4]Sep 24 20:20:38 test-kernel kernel: [ 1145.233488] ? nfs42_clone_file_range+0x1c0/0x1c0 [nfsv4]Sep 24 20:20:38 test-kernel kernel: [ 1145.233490] do_dentry_open+0x1f6/0x360Sep 24 20:20:38 test-kernel kernel: [ 1145.233492] vfs_open+0x2f/0x40Sep 24 20:20:38 test-kernel kernel: [ 1145.233493] path_openat+0x2e8/0x1690Sep 24 20:20:38 test-kernel kernel: [ 1145.233496] ? mem_cgroup_try_charge+0x8b/0x190Sep 24 20:20:38 test-kernel kernel: [ 1145.233497] do_filp_open+0x9b/0x110Sep 24 20:20:38 test-kernel kernel: [ 1145.233499] ? __check_object_size+0xb8/0x1b0Sep 24 20:20:38 test-kernel kernel: [ 1145.233501] ? __alloc_fd+0x46/0x170Sep 24 20:20:38 test-kernel kernel: [ 1145.233503] do_sys_open+0x1ba/0x250Sep 24 20:20:38 test-kernel kernel: [ 1145.233505] ? do_sys_open+0x1ba/0x250Sep 24 20:20:38 test-kernel kernel: [ 1145.233507] __x64_sys_openat+0x20/0x30Sep 24 20:20:38 test-kernel kernel: [ 1145.233508] do_syscall_64+0x65/0x130\n What are the  do_dentry_open and  vfs_open calls above? Linux has a virtual filesystem(VFS), anabstraction layer which provides a common interface for allfilesystems. The VFS documentation explains:\n The VFS implements the open(2), stat(2), chmod(2), and similar systemcalls. The pathname argument that is passed to them is used by the VFSto search through the directory entry cache (also known as the dentrycache or dcache). This provides a very fast look-up mechanism totranslate a pathname (filename) into a specific dentry. Dentries livein RAM and are never saved to disc: they exist only for performance.\n This gave us a clue: what if this was a problem with the dentry cache?\n We noticed a lot of dentry cache validation was done in fs/nfs/dir.c. In particular,  nfs4_lookup_revalidate() soundedpromising. As an experiment, we hacked that function to bailout early:\n diff --git a/fs/nfs/dir.c b/fs/nfs/dir.cindex 8bfaa658b2c1..ad479bfeb669 100644 --- a/fs/nfs/dir.c +++ b/fs/nfs/dir.c @@ -1159,6 +1159,7 @@ static int nfs_lookup_revalidate(struct dentry *dentry, unsigned int flags) trace_nfs_lookup_revalidate_enter(dir, dentry, flags); error = NFS_PROTO(dir)-&gt;lookup(dir, &amp;dentry-&gt;d_name, fhandle, fattr, label); trace_nfs_lookup_revalidate_exit(dir, dentry, flags, error); + goto out_bad; if (error == -ESTALE || error == -ENOENT) goto out_bad; if (error)\n That made the stale file problem in our experiment go away! Now we were onto something.\n To answer, &#34;Why does this problem not happen in NFS v4.1?&#34;, we added pr_info() calls to every  if block in that function. After running ourexperiments with NFS v4.0 and v4.1, we found this special condition being runin the v4.1 case:\n  What is  NFS_CAP_ATOMIC_OPEN_V1? We saw  this kernelpatch mentioned this wasan NFS v4.1-specific feature, and the code in  fs/nfs/nfs4proc.cconfirmed that this flag was a capability present in v4.1 but not in v4.0:\n static  const  struct  nfs4_minor_version_ops  nfs_v4_1_minor_ops  =  {  . minor_version  =  1 ,  . init_caps  =  NFS_CAP_READDIRPLUS  |  NFS_CAP_ATOMIC_OPEN  |  NFS_CAP_POSIX_LOCK  |  NFS_CAP_STATEID_NFSV41  |  NFS_CAP_ATOMIC_OPEN_V1\n That explained the difference in behavior: in the v4.1 case, the  gotono_open would cause more validation to happen in nfs_lookup_revalidate(), but in v4.0, the  nfs4_lookup_revalidate()would return earlier. Now, how do we actually solve the problem?\n  I reported the  findings to the NFS mailinglist and proposed a naive patch. Aweek after the report, Trond Myklebust sent a  patch series to the listfixing this bug and found another related issue for NFSv4.1.\n It turns out the fix for the NFS v4.0 bug was deeper in the code basethan we had looked. Trond summarized it well in the patch:\n We need to ensure that inode and dentry revalidation occurs correctlyon reopen of a file that is already open. Currently, we can end up notrevalidating either in the case of NFSv4.0, due to the &#39;cached open&#39;path. Let&#39;s fix that by ensuring that we only do cached open for thespecial cases of open recovery and delegation return.\n We confirmed that this fix made the stale file problem go away and filedbug reports with Ubuntuand  RedHat.\n Knowing full well that kernel changes may take a while to make it tostable releases, we also added a  workaround inGitaly to dealwith this issue. We did experiments to test that calling  stat() on the packed-refs file appears to cause the kernel to revalidate the dentrycache for the renamed file. For simplicity, this is implemented inGitaly regardless of whether the filesystem is NFS; we only do this oncebefore Gitaly &#34;opens&#34; a repository, and there are already other  stat()calls that check for other files.\n  A bug can be anywhere in your software stack, and sometimes you have tolook beyond your application to find it. Having helpful partners in theopen source world makes that job much easier.\n We are extremely grateful to Trond Myklebust for fixing the problem, andBruce Fields for responding to questions and helping us understandNFS. Their responsiveness and professionalism truly reflects the best ofthe open source community.\n  Sign up for GitLab’s twice-monthly newsletter to explore upcoming webcasts, how-to blogs, and stay up-to-date on exciting new features released every month:\n GitLab is more than just source code management or CI/CD. It is a full software development lifecycle &amp; DevOps tool in a single application.\n Try GitLab for Free\n   Git is a trademark of Software Freedom Conservancy and our use of &#39;GitLab&#39; is under license", "posttime": "2020-10-12 07:51:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,漏洞,寻找,spent,nfs", "title": "GitLab：我们花了两周时间寻找Linux内核中的NFS漏洞(2018)", "title_en": "Gitlab: We spent two weeks hunting an NFS bug in the Linux kernel (2018)", "transed": 1, "url": "https://about.gitlab.com/blog/2018/11/14/how-we-spent-two-weeks-hunting-an-nfs-bug/", "via": "", "real_tags": ["linux", "漏洞", "寻找", "spent", "nfs"]}]