[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1070237, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "很长一段时间以来，编写小型鼓合成器的想法一直是“如果……也许会很酷”的任务之一，这些任务漂浮在我的 Creative Intent 插件原型的外围或我的生成音乐小实验中。通常我会推迟这个想法，认为这会花费更多的时间而不是值得。但是，现在我可以使用 Elementary，我发现像这样的小实验或目标可以是半天的项目，有些甚至比这更短。因此，我最近着手为 Elementary 构建一个小型免费鼓合成器库，以最终解决这个问题，在本文中，我想分享一个简短的教程，介绍我如何进行电子鼓、拍手和嗨帽声音的合成.如果您想听听示例，只需克隆存储库、npm install 和 npm start。最后，在我们深入探讨之前，我想说明一下，我在这里为每种声音采取的方法非常简单。我确信有更复杂、也许更准确的方法来合成这些声音，但我采用的方法使我得到了一组我对自己的音乐实验感到满意的声音。电子底鼓由一些非常简单的元素组成。首先，我们将低音调调谐到所需频率，并赋予底鼓真正的“肉感”。然后我们在声音的开头有咔嗒声，它松散地模拟了当木槌敲击原声底鼓膜时产生的接触声音。这通常是在底鼓合成中使用非常快的音高包络将亚音从较高频率扫到较低频率来实现的。这些组件单独构成了许多电子底鼓的完整构建块，但在我的中，我也想要一点垃圾，考虑扭曲的 808 风格底鼓敲击声。为了将这些组件具体转化为我们的合成方法，我们从超低音开始，为此我使用了用户指定频率音高的简单正弦音，通常在 30-120hz 范围内调谐。然后我们可以使用幅度包络应用轮廓，该幅度包络非常快速地上升到最大值（例如，5ms – 400ms），然后在此后不久（5ms – 4s）衰减回 0。函数踢（音高，攻击，衰减，门）{让 env = el.adsr（攻击，衰减，0.0，0.1，门）； return el.mul(env, el.cycle(pitch));} 在这里，我们的底鼓函数将被使用，这样传入的门参数是一个脉冲串，它在某个用户定义的值 0 和 1 之间交替速度。在上升沿（从 0 到 1 的过渡），我们的包络将接合，触发底鼓声音。现在为了给我们的底鼓一个很好的类似咔嗒声的瞬态，我们应用另一个包络，这次是在亚音的音高上，将亚音的频率从更高的值扫下来。这里的调整是为了品味，我在短时间内从用户给定值的 5 倍运行音调到自身的音调。\nfunction kick(pitch, click,attack,decay,gate) { // 首先我们有我们的放大器包络 let env = el.adsr(attack,decay, 0.0, 0.1, gate); // 然后我们有一个音高包络，在 [5ms, 4s] 中具有 0 起音和衰减​​。 // `el.adsr` 节点使用指数段，这对我们的目的非常有用 // 在这里，但您也可以通过平方 // 或取 pitchenv 信号的平方根来或多或少地对曲线进行加权。让 pitchenv = el.adsr(0.005, click, 0.0, 0.1, gate); // 然后我们的合成：在我们的基本音高处的正弦音，其频率很快 // 由 pitchenv 调制以在 `click` 秒内从 5*pitch 扫到 1*pitch。 // 产生的声音直接通过我们的放大器包络相乘。 return el.mul( env, el.cycle( el.mul( el.add(1, el.mul(4, pitchenv)), pitch, ) ) );到目前为止，我们的底鼓声音已经基本完成，但我想为亚音添加一些额外的泛音，并使用波形整形器将底鼓驱动到更粗糙的区域。为此，我们只需将之前的声音通过用户指定的驱动器通过 el.tanh 饱和器。完整的踢腿合成器如下所示。 function kick(pitch, click,attack,decay,drive,gate) { // 首先我们有我们的放大器包络 let env = el.adsr(attack,decay, 0.0, 0.1, gate); // 然后我们有一个音高包络，在 [5ms, 4s] 中具有 0 起音和衰减​​。 // `el.adsr` 节点使用指数段，这对我们的目的非常有用 // 在这里，但您也可以通过平方 // 或取 pitchenv 信号的平方根来或多或少地对曲线进行加权。 let pitchenv = el.adsr(0.005, click, 0.0, 0.1, gate); // 然后我们的合成：在我们的基本音高处的正弦音，其频率很快 // 由 pitchenv 调制以在 `click` 秒内从 5*pitch 扫到 1*pitch。 // 产生的声音直接通过我们的放大器包络相乘。 let clean = el.mul( env, el.cycle( el.mul( // 音高包络从 5 的乘数到 // 原始音高的 1 的乘数 el.add(1, el.mul(4) , pitchenv)), 音高, ) ) ); // 然后你可以把它驱动到一个带有 [1, 10] 增益乘法器的软限幅器中 return el.tanh(el.mul(clean, drive));} 我相信合成拍手声音可以非常详细如果你想挖得足够深，就努力吧。但我采取的方法可能是我能想到的最简单的方法，我对结果非常满意。首先，我们会注意到单个拍手声实际上只是一个瞬态，其大部分共振衰减在 400Hz – 3500Hz 频率范围内。我们可以简单地使用过滤的白噪声和轮廓的幅度包络来处理这样的事情。函数拍手（音调，攻击，衰减，门）{ let no = el.noise();让 e1 = el.adsr（攻击，衰减，0.0，0.1，门）； return el.bandpass(tone, 1.214, el.mul(no, e1), );} 就像上面的底鼓一样，我们的拍手功能将在脉冲串信号的上升沿触发。现在，到目前为止一切都很好，但是鼓掌的有趣特征来自于几个这样的瞬态的分层，就好像几个人试图同时鼓掌一样。真正产生差异的是时间上的细微变化。所以，这里我们简单地采用上述方法，将其复制四次，并稍微抵消攻击和衰减。最后，为了最后一点额外的字符，我已经通过另一个 el.tanh 饱和器运行了结果。\nfunction clap(tone,attack,decay,gate) { // 分层白噪声合成 let no = el.noise();让 e1 = el.adsr(el.add(0.035, 攻击), el.add(0.06, 衰减), 0.0, 0.1, 门);让 e2 = el.adsr(el.add(0.025, 攻击), el.add(0.05, 衰减), 0.0, 0.1, 门);让 e3 = el.adsr(el.add(0.015, 攻击), el.add(0.04, 衰减), 0.0, 0.1, 门);让 e4 = el.adsr(el.add(0.005, 攻击), el.add(0.02, 衰减), 0.0, 0.1, 门); // 然后我们通过根据音调设置的带通滤波器运行结果 // 在 400Hz 和 3500Hz 之间，并且稍微饱和。返回 el.tanh( el.bandpass(tone, 1.214, el.add( el.mul(no, e1), el.mul(no, e2), el.mul(no, e3), el.mul(no, e4), ), ) );} 合成 hi hat 声音最终成为我在这个小项目上花费大部分时间的地方。就像鼓掌一样，一开始的想法似乎很明显，即踩镲，尤其是封闭的踩镲，只不过是一种瞬态，通常位于频谱的较高部分。但只是使用过滤的噪音来达到我觉得缺乏帽子的金属特征。在研究了其他一些著名的鼓合成器（例如经典的 TR-808 或 DR110）之后，我发现高音方波可以成为我正在寻找的角色的良好构建块。然后，通过一些额外的探索，我得出了一种方法，该方法使用带有单个正弦调制器和单个正弦载波的 FM 合成（通过相位调制）。调制器以恰好两倍于载波的速率运行，以生成方波的奇次谐波。然后，为了引入一些非谐波噪声特性，我使用了第二个调制器，这次是白噪声信号调制第一个调制器的频率。 FM 合成如下所示。 /** 具有相位偏移的正弦波振荡器的快速助手。 */function cycle(freq, phaseOffset) { let t = el.add(el.phasor(freq), phaseOffset);让 p = el.sub(t, el.floor(t)); return el.sin(el.mul(2 * Math.PI, p));}/** 我们的帽子合成器 */function hat(pitch) { // 合成器 let m2 = el.noise();让 m1 = cycle(el.mul(2, pitch), el.mul(2, m2));让 m0 = cycle(pitch, el.mul(2, m1)); return m0;} 这里，给帽子函数的音高决定了载波正弦音的基频，用户可以调整它来调整帽子的金属特性。现在，正如所写，我们缺少幅度包络，因此无法触发我们帽子的离散实例。让我们将其添加到：function hat(pitch,attack,decay,gate) { // Synthesis let m2 = el.noise();让 m1 = cycle(el.mul(2, pitch), el.mul(2, m2));让 m0 = cycle(pitch, el.mul(2, m1)); // 带有 [5ms, 200ms] 起音和 [5ms, 4000ms] 衰减的放大器包络 let env = el.adsr(attack,decay, 0.0, 0.1, gate); return el.mul(m0, env);} 最后，特别是由于白噪声调制器，我们在中低频范围内得到了很多我们不需要的频率内容，而且我们的帽子声音也不想要，所以我们可以像拍手合成器一样通过带通滤波器运行上面的合成器。这里我们引入了tone参数来设置滤波器的截止频率，由用户调整。\nfunction hat(pitch,tone,attack,decay,gate) { // 合成 let m2 = el.noise();让 m1 = cycle(el.mul(2, pitch), el.mul(2, m2));让 m0 = cycle(pitch, el.mul(2, m1)); // 然后我们通过根据音调设置的带通滤波器运行结果 // 在 800Hz 和 18kHz 之间。让 f = el.bandpass(tone, 1.214, m0); // 最后，我们得到了在 [5ms, 200ms] 内具有起音和在 [5ms, 4000ms] 内衰减的放大器包络 let env = el.adsr(attack,decay, 0.0, 0.1, gate); return el.mul(f, env);} 我们有！当然，您也可以在 GitHub 上找到帽子合成器。最后，我很高兴地与大家分享，上面介绍的所有声音都可以在您自己的项目中免费使用，并且现在可以在 npm 上使用。首先，您可以简单地将 @nick-thompson/drumsynth 添加到您的项目中： 最后，一个简短的使用示例，其中包含在脉冲串的每一步上播放的踢腿、拍手和帽子： const core = require(&#39;elementary -core&#39;);const el = require(&#39;@nick-thompson/elementary&#39;);const ds = require(&#39;@nick-thompson/drumsynth&#39;);// 最简单的例子：踢腿、帽子和拍手// 以 4Hz.core.on(&#39;load&#39;, function() { let gate = el.train(4); core.render( el.add( ds.kick(40, 0.104, 0.005, 0.4, 4, 门), ds.clap(800, 0.005, 0.204, 门), ds.hat(317, 12000, 0.005, 0.1, 门), ), ););", "note_en": "For a long time now, the idea of writing a small drum synth has been one of those &#34;maybe it would be cool if...&#34; tasks floating in the periphery of my  Creative Intent plugin prototypes or in my small experiments with generative music. Typically I&#39;ve put off the idea thinking that it would take more time than it would be worth. But, now that I have  Elementary at my disposal, I&#39;ve found that small experiments or goals like these can be half-day projects, some even shorter than that. So I recently set out to build a small,  free drum synth library for Elementary to finally scratch that itch, and in this article I want to share a brief tutorial on how I approached the synthesis of an electronic drum, clap, and hi hat sound.\n If you want to hear the examples as you follow along, you can simply clone the  repository,  npm install, and  npm start. Lastly, before we dive in, I want to caveat that the approaches I&#39;ve taken here for each sound are quite simple. I&#39;m sure that there are more complicated, perhaps more accurate, approaches to synthesizing these sounds, but the approaches I took led me to a set of sounds that I&#39;m happy with for my own musical experiments.\n  An electronic kick drum is composed of a few really simple elements. First, we have the sub bass which is tuned to a desired frequency and lends the real “meat” of the kick. Then we have the click at beginning of the sound which loosely simulates the sound of the contact made when the mallet hits the membrane of an acoustic kick drum. Often this is achieved in kick drum synthesis using a very fast pitch envelope sweeping the sub tone from higher frequencies to lower. These components alone form the complete building blocks for many electronic kicks, but in mine I wanted a little grunge as well, thinking about distorted 808 style kick drum hits.\n To translate these components concretely into our synthesis approach, we start with the sub bass, for which I’ve used a simple sine tone at a user-specified frequency  pitch, typically tuned in the 30-120hz range. Then we can apply a contour using an amplitude envelope which ramps up to its maximum very quickly (say, 5ms – 400ms), and decays back down to  0 shortly thereafter (5ms – 4s).\n function kick(pitch, attack, decay, gate) { let env = el.adsr(attack, decay, 0.0, 0.1, gate); return el.mul(env, el.cycle(pitch));}\n Here, our kick drum function will be used such that the  gate argument passed in is a pulse train which alternates between a value of  0 and  1 at some user-defined rate. On the rising edge (a transition from  0 to  1), our envelope will engage, triggering the kick drum sound.\n  Now to give our kick a nice click-like transient we apply another envelope, this time to the pitch of the sub tone to sweep the frequency of the sub down from a higher value. The tuning here is done to taste, where I run  pitch from 5 times the user given value down to  pitch itself over a short period of time.\n function kick(pitch, click, attack, decay, gate) { // First up we have our amp envelope let env = el.adsr(attack, decay, 0.0, 0.1, gate); // Then we have a pitch envelope with 0 attack and decay in [5ms, 4s]. // The `el.adsr` node uses exponential segments which is great for our purposes // here, but you could also weight the curve more or less aggressively by squaring // or taking the square root of the pitchenv signal. let pitchenv = el.adsr(0.005, click, 0.0, 0.1, gate); // Then our synthesis: a sine tone at our base pitch, whose frequency is quickly // modulated by the pitchenv to sweep from 5*pitch to 1*pitch over `click` seconds. // The resulting sound is multiplied straight through our amp envelope. return el.mul( env, el.cycle( el.mul( el.add(1, el.mul(4, pitchenv)), pitch, ) ) );\n By now, our kick sound is largely complete, but I wanted to add some extra harmonics to the sub tone and drive the kick into more grungy territory with a waveshaper. For that, we simply take our previous sound and push it through an  el.tanh saturator with a user specified drive. The complete kick synth, then, looks as follows.\n function kick(pitch, click, attack, decay, drive, gate) { // First up we have our amp envelope let env = el.adsr(attack, decay, 0.0, 0.1, gate); // Then we have a pitch envelope with 0 attack and decay in [5ms, 4s]. // The `el.adsr` node uses exponential segments which is great for our purposes // here, but you could also weight the curve more or less aggressively by squaring // or taking the square root of the pitchenv signal. let pitchenv = el.adsr(0.005, click, 0.0, 0.1, gate); // Then our synthesis: a sine tone at our base pitch, whose frequency is quickly // modulated by the pitchenv to sweep from 5*pitch to 1*pitch over `click` seconds. // The resulting sound is multiplied straight through our amp envelope. let clean = el.mul( env, el.cycle( el.mul( // The pitch envelope runs from a multiplier of 5 to // a multiplier of 1 on the original pitch el.add(1, el.mul(4, pitchenv)), pitch, ) ) ); // Then you can drive it into a soft clipper with a gain multiplier in [1, 10] return el.tanh(el.mul(clean, drive));}\n   I&#39;m sure that synthesizing clap sounds can be an extremely detailed endeavor if you want to dig in far enough. But the approach that I took is perhaps the simplest thing I could think of, and I&#39;m quite happy with the result. First, we&#39;ll note that an individual clap sound is really little more than a transient with the bulk of its resonating decay within, say, the 400Hz – 3500Hz frequency range. We can approach something like this simply using filtered white noise and an amplitude envelope for contour.\n function clap(tone, attack, decay, gate) { let no = el.noise(); let e1 = el.adsr(attack, decay, 0.0, 0.1, gate); return el.bandpass( tone, 1.214, el.mul(no, e1), );}\n Like the kick drum above, our  clap function will be triggered on the rising edge of a pulse train signal.\n  Now, this is all fine so far, but the interesting character of a clap comes from the layering of several such transients, as if several people try to clap once at the same time. It&#39;s the slight variations in timing that really make the difference. So, here we simply take the above approach, duplicate it four times, and offset the attacks and decays just slightly. Finally, for one last touch of additional character, I&#39;ve run the result through another  el.tanh saturator.\n function clap(tone, attack, decay, gate) { // Layered white noise synthesis let no = el.noise(); let e1 = el.adsr(el.add(0.035, attack), el.add(0.06, decay), 0.0, 0.1, gate); let e2 = el.adsr(el.add(0.025, attack), el.add(0.05, decay), 0.0, 0.1, gate); let e3 = el.adsr(el.add(0.015, attack), el.add(0.04, decay), 0.0, 0.1, gate); let e4 = el.adsr(el.add(0.005, attack), el.add(0.02, decay), 0.0, 0.1, gate); // Then we run the result through a bandpass filter set according to tone // between 400Hz and 3500Hz, and slightly saturate. return el.tanh( el.bandpass( tone, 1.214, el.add( el.mul(no, e1), el.mul(no, e2), el.mul(no, e3), el.mul(no, e4), ), ) );}\n   Synthesizing the hi hat sound ended up being where I spent most of my time with this little project. Like the clap, it seemed obvious to start with the idea that a hi hat, especially a closed hi hat, is little more than a transient which generally resides in the higher part of the frequency spectrum. But just using filtered noise to get there felt to me lacking in the metallic character of a hat. After studying a few other well known drum synths such as the classic TR-808 or the DR110, I gathered that high pitched square waves can be a good building block for the character that I was seeking.\n Then, with some additional exploration, I arrived at an approach which uses FM synthesis (via phase modulation) with a single sine modulator and a single sine carrier. The modulator runs at exactly twice the rate of the carrier to generate the odd harmonics of a square wave. Then, to pull in some of the non-harmonic noise character, I used a second modulator, this time a white noise signal modulating the frequency of the first modulator. The FM synthesis looks as follows.\n /** A quick helper for a sine wave oscillator with a phase offset. */function cycle(freq, phaseOffset) { let t = el.add(el.phasor(freq), phaseOffset); let p = el.sub(t, el.floor(t)); return el.sin(el.mul(2 * Math.PI, p));}/** Our hat synth */function hat(pitch) { // Synthesis let m2 = el.noise(); let m1 = cycle(el.mul(2, pitch), el.mul(2, m2)); let m0 = cycle(pitch, el.mul(2, m1)); return m0;}\n Here, the pitch given to the  hat function determines the base frequency of the carrier sine tone, which can be adjusted by the user to tune the metallic character of the hat. Now, as written, we&#39;re missing the amplitude envelope and therefore don&#39;t have a way of triggering discrete instances of our hat. Let&#39;s add that in:\n function hat(pitch, attack, decay, gate) { // Synthesis let m2 = el.noise(); let m1 = cycle(el.mul(2, pitch), el.mul(2, m2)); let m0 = cycle(pitch, el.mul(2, m1)); // Amp envelope with an attack in [5ms, 200ms] and a // decay in [5ms, 4000ms] let env = el.adsr(attack, decay, 0.0, 0.1, gate); return el.mul(m0, env);}\n   Lastly, especially because of the white noise modulator, we get a lot of frequency content in the mid and low range that we don&#39;t need and really don&#39;t want with our hat sound, so we can run the above synth through a bandpass filter like with the clap synth. Here we introduce the tone parameter to set the cutoff frequency of the filter, tuned by the user.\n function hat(pitch, tone, attack, decay, gate) { // Synthesis let m2 = el.noise(); let m1 = cycle(el.mul(2, pitch), el.mul(2, m2)); let m0 = cycle(pitch, el.mul(2, m1)); // Then we run the result through a bandpass filter set according to tone // between 800Hz and 18kHz. let f = el.bandpass(tone, 1.214, m0); // Finally we have the amp envelope with an attack in [5ms, 200ms] and a // decay in [5ms, 4000ms] let env = el.adsr(attack, decay, 0.0, 0.1, gate); return el.mul(f, env);}\n There we have it! And of course, you can find the  hat synth on GitHub as well.\n  To wrap up, I&#39;m happy to share that all of the sounds presented above are free to use in your own projects and available on  npm right now. To get started, you can simply add  @nick-thompson/drumsynth to your project:\n  Finally, a brief usage example with each of the kick, clap, and hat playing on every step of the pulse train:\n const core = require(&#39;elementary-core&#39;);const el = require(&#39;@nick-thompson/elementary&#39;);const ds = require(&#39;@nick-thompson/drumsynth&#39;);// The simplest example: a kick, hat, and clap playing on every step of a// pulse train running at 4Hz.core.on(&#39;load&#39;, function() { let gate = el.train(4); core.render( el.add( ds.kick(40, 0.104, 0.005, 0.4, 4, gate), ds.clap(800, 0.005, 0.204, gate), ds.hat(317, 12000, 0.005, 0.1, gate), ), ););", "posttime": "2021-07-29 21:47:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,javascript,合成,synthesis,el", "title": "JavaScript 中的鼓合成", "title_en": "Drum Synthesis in JavaScript", "transed": 1, "url": "https://www.nickwritesablog.com/drum-synthesis-in-javascript/", "via": "", "real_tags": ["java", "合成", "synthesis", "el"]}, {"category": "", "categoryclass": "", "imagename": "1da095cd7948da57242000a45a1f51da.jpeg", "infoid": 1070236, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "五十年前，即 1963 年 11 月 22 日，英国作家、迷幻药先驱和远见卓识的思想家奥尔德斯·赫胥黎 (Aldous Huxley) 在他位于穆赫兰高速公路顶部好莱坞标志的第一个“O”下方的家中，与癌症进行了三年的斗争。根据他的书面请求，赫胥黎的第二任妻子劳拉在快要结束时给他注射了一剂液体 LSD。她后来将他的去世描述为“最平静、最美丽的死亡”。当天下午早些时候，约翰·肯尼迪总统在达拉斯一家医院的急诊室因枪伤去世，而他的遗孀几乎无法说出同样的话。肯尼迪的可怕公开暗杀是如此具有纪念意义——就连劳拉·赫胥黎也回忆起护士们在她丈夫奄奄一息时观看有关这件事的新闻报道——以至于它的 50 周年纪念在国家记忆中几乎完全超过了赫胥黎。在最近一期的《名利场》和《纽约时报书评》中，专题文章讨论了成堆的纪念肯尼迪周年的新书。然而，赫胥黎收到的只是 1932 年《美丽新世界》的可爱装饰未来主义插图版，以及两位时代作家对这部反乌托邦经典作品的评价，其中包括对名为“feelies”的 4D 互动电影的预测和习惯性处方药 soma（“周末一克，去美丽的东方旅行两克，月球上的黑暗永恒三克......”），无论如何，今天出现了。赫胥黎坦率地承认，小说作为一种形式可能不是他惊人的思想流动的最佳容器——这是一位作家，在他的巅峰时期，他每年生产三本书。但是，《美丽新世界》的未来背景是通过监控无意识的人工快感供应来施加控制，这听起来与我们目前的现实非常接近。就在 2010 年，它在美国人最想从公共图书馆禁止的书籍名单中排名第三。我认为，直到赫胥黎搬到美国——尤其是洛杉矶——他对技术、药理学、媒体、神秘主义和精神启蒙的终生迷恋的种子才完全开花并结出果实。人们常说，“六十年代”正式开始于肯尼迪去世和美国“失去纯真”。但是，如果没有奥尔德斯·赫胥黎和他的同伙的专注和有据可查的宇宙探索，这十年看起来会大不相同。可以毫不夸张地说，如果没有赫胥黎，蒂莫西·利里可能永远不会调准并打开，吉姆·莫里森可能永远不会突破。赫胥黎在成为散文家和小说家之前是一位诗人，在 1921 年之前出版了四本书，当时他的第一部小说《克罗姆·黄》使他成为文学轰动者。一战后对波西米亚英国上流社会的讽刺，使这位 27 岁的作家成为无所畏惧的社会评论家和直言不讳的和平主义者，这一立场将导致他离开英国，并最终离开欧洲。从 1930 年起，赫胥黎和他的妻子玛丽亚以及他们的儿子马修大部分时间都在法国南部的滨海萨纳里度过，在那里他写了《美丽新世界》和《加沙的无眼》（1936 年）。 1937 年，一家人与密友杰拉尔德·赫德 (Gerald Heard) 乘坐诺曼底号 (Normandie) 前往纽约，驾驶福特轿车穿越美国。他们在新墨西哥州陶斯附近的一个牧场度过了一个夏天，这个牧场由艺术赞助人梅布尔·道奇·卢汉 (Mabel Dodge Luhan) 赠予 DH 和弗里达·劳伦斯 (Frieda Lawrence)。尽管劳伦斯于 1930 年在法国赫胥黎的家中去世——在玛丽亚的怀抱中，同样如此——弗里达一直住在陶斯，直到她去世，家人仍然很亲密。 DH 和 Aldous 在布卢姆斯伯里田园诗般的日子里建立了他们的友谊。两人甚至计划在佛罗里达州一起建立一个乌托邦式的殖民地。这一愿景从未实现，但据说丹尼斯·霍珀想要购买梅布尔·道奇·鹿晗在 1970 年购买的陶氏私人住宅的原因之一是因为它与劳伦斯的关系。在霍珀看来，劳伦斯是“第一个怪胎”。\n赫胥黎是一个与众不同的怪胎。他身高 6 英尺 4.5 英寸，身材瘦长，头很大，几乎完全穿着学院派的宽松西装制服，经常拿着放大镜来帮助他阅读（他从十几岁起视力就出现严重问题）。这位稳重的英国人是马修·阿诺德和著名的维多利亚时代动物学家托马斯·亨利·赫胥黎的后代，当赫胥黎一家来到他们位于北新月高地的第一个好莱坞住宅时，他似乎并不是反主流文化的典型代表。然而，多年来，他非常公开表达的哲学和生活方式选择促成了全球将洛杉矶视为异教徒和享乐主义者、神秘主义者和电影明星之地。赫胥黎作为南加州生活事实上的大使的角色并没有让他在饱受战争蹂躏的欧洲很受欢迎——批评者用“瑜伽”之类的词进行模糊的侮辱——但他似乎从一开始就接受了他新生活的矛盾。赫胥黎 1939 年的小说《一个夏天后天鹅死去》的开篇章节是在全家抵达洛杉矶后不久写成的，书中发现英国学者杰里米·波达奇第一次在车上观察洛杉矶。这座城市冲突的建筑风格及其人民和承诺向他扑面而来，正如他们可能通过奥尔德斯自己的眼睛所做的那样：麦芽小屋在火奴鲁鲁城堡用餐和跳舞精神治疗和结肠灌溉块长热狗现在购买您梦想中的家！有人声称这本书是奥森·威尔斯的《公民凯恩》的灵感来源，主要是因为波达奇的雇主乔·斯托伊特（Jo Stoyte，一位与情妇和艺术收藏品住在城堡里的古怪百万富翁）和查尔斯·福斯特·凯恩（Charles Foster Kane）之间的共同特征。相似之处在于基本的传记：斯托伊特的痴迷是不朽，而不是权力，赫胥黎的小说随着一位 200 岁老人的发现而转向科幻。然而，并不是说赫胥黎反对为这些照片写作。事实上，这是洛杉矶对他的吸引力的一部分。当他给作家和小镇女孩 Anita Loos 寄了一封狂热的粉丝信，对她 1925 年的小说《绅士喜欢金发女郎》（Gentlemen Prefer Blondes）赞不绝口时，他与她变得友好，她帮助他在米高梅找到了一份轻松的工作。但与自无声电影时代以来就一直在磨练自己的能力的路斯不同，赫胥黎的正式风格并不适合编剧。他唯一制作并获得认可的剧本之一是 1943 年阴郁的简爱版本，由威尔斯主演，饰演饱受折磨的罗切斯特。对话奇怪而僵硬：“命运把我撞倒了，用她的指关节揉捏我，直到我自夸我都像印度橡皮球一样坚硬，”威尔斯吟诵道，这句话唯一能救人的是他强大的男中音.赫胥黎还撰写了本应是他的银幕杰作迪士尼的爱丽丝梦游仙境的初稿。不幸的是，沃尔特本人拒绝了，声称他只能理解每三个单词。他最好的电影作品之一，改编自赫胥黎 1952 年调查 17 世纪驱魔的非虚构小说劳登的魔鬼，肯·拉塞尔的《魔鬼》是死后。除了在工作室系统中没有“成功”的失望之外，天使之城的生活对赫胥黎一家很好。他们的亲密社交圈包括赫德（一位著名的哲学家和神秘主义者）和路斯，以及查理卓别林和宝莱特戈达德、天文学家埃德温哈勃和他的妻子格蕾丝、英国外籍作家克里斯托弗伊舍伍德以及梅赛德斯德阿科斯塔和格蕾塔嘉宝。有传言说嘉宝和德阿科斯塔是双性恋者玛丽亚赫胥黎在洛杉矶地下女同性恋的玩伴之一，而玛丽亚还为她的丈夫带来了年轻女性，这表明了赫胥黎私生活中非常狂野的一面。正是在这个时候，赫胥黎开始与吉德·克里希那穆提（Jiddhu Krishnamurti）建立友谊，后者被选为神智学的“世界教师”，他于 1929 年放弃了他在神秘宗教中的角色，但终生留在加利福尼亚州的奥海。尽管他觉得古鲁的概念令人反感，认为人必须自由地找到自己的道路，但克里希那穆提仍然经常讲课，被包括赫胥黎在内的许多人尊为老师。他向赫胥黎夫妇介绍了瑜伽的练习，并让奥尔德斯认识到自知和自由探究与有组织的宗教及其教条和符号的重要性。\n与赫德和伊舍伍德一样，赫胥黎抵达洛杉矶后，也认真学习了吠檀多（Vedanta），即以印度教为基础的哲学和灵性体系。这三位英国作家曾在好莱坞的韦丹塔学会与斯瓦米·帕巴瓦南达 (Swami Prabhavananda) 一起学习，这座迷人的白色圆顶寺庙藏在 101 号高速公路上方。当时，赫德还在拉古纳海滩创建和建造特拉布科祈祷学院，这是一个神秘研究中心，由他的家族遗产资助。另一方面，伊舍伍德对吠檀多全身心投入，以至于他住在学会的修道院里，努力翻译《薄伽梵歌》。赫胥黎对伊舍伍德翻译的介绍表达了他自己与神秘主义日益增长的联系，尤其是与被称为常年主义的古代宗教哲学的联系。 “人具有双重本性，”他写道，“一个现象的自我和一个永恒的自我，即内在的人、精神、灵魂中神性的火花。如果一个人愿意，他可以将自己与精神认同，从而与神圣之地认同。”赫胥黎发现，从印度教到道教再到佛教，对内在神性的追求和实现是世界上所有主要宗教的神秘经文的主题。很大程度上要归功于特拉布科学院的图书馆，他能够从主要宗教文本以及从圣特蕾莎到鲁米再到艾克哈特大师的先知、哲学家和先知的文字和著作中汇编选集。 1945 年，他发表了关于该主题的开创性学术著作《常年哲学》。在“世界上的上帝”一章中，赫胥黎研究了希腊的傲慢概念及其不可避免的反应，克星，因为它与自然有关，以及基督教的观念，即一个人必须回到一个未腐化的童心状态才能进入天国. “现代人不再将自然视为任何意义上的神圣，”他写道，“并且完全可以自由地对待她作为一个傲慢的征服者和暴君。”几年前，奥尔德斯和玛丽亚做了许多洛杉矶人觉得不得不做的事情：他们搬到了沙漠，寻求与自然世界更深入的交流。这对夫妇在 Llano 买了一间小屋，靠近一个古老的社会主义殖民地 Llano del Rio 的废墟，赫胥黎照料他的花园，并在他认为对眼睛有帮助的沙漠光线下工作。在这里，被广袤的大地和无边的天空所包围，他体验到了无限不可否认的东西。 “寂静是另一种感觉所感知的无云天堂。就像空间和空虚一样，它是神圣的自然象征，”赫胥黎在一篇关于沙漠的文章中写道。尽管他自称是一个不可知论者（他的祖父托马斯实际上在 1869 年发明了这个词），但还是点燃了火花：他发现自己越来越接近神性。赫胥黎尊敬威廉·布莱克（William Blake），并理想化了这位自学成才的诗人和艺术家在天使与人类一样可见的幻想状态中生存的能力，这对于一位具有神秘倾向的英国作家来说是恰当的。在《永恒哲学》中，赫胥黎首先引用了布莱克的《天堂与地狱的联姻》中现在具有标志性意义的短语，警告读者“‘清理知觉之门’的过程，无论如何，往往是在早期阶段。精神生活，像外科手术一样痛苦。”不管痛苦与否，这正是赫胥黎如此热切地寻求的。当他听说加拿大的精神病医生 Humphry Osmond 博士正在研究精神分裂症和 mescaline（一种仙人掌衍生物）的生化相似性时，赫胥黎联系了这位医生，并建议或许这种药物也可以提供对有远见的体验的见解。然后，他邀请奥斯蒙德在 1953 年的精神病学会议上与他和玛丽亚一起留在他们位于国王路的家中，医生称之为“荣誉和机会”。主持人只提了一个小小的要求：“你手头有东西吗？如果是这样，我希望你能带一点……”在一个现在传奇的五月早晨，赫胥黎第一次摄入了麦斯卡林，奥斯蒙德和玛丽亚是他的向导。他承认他“事先确信这种药物会让我至少在几个小时内进入布莱克描述的那种内心世界。”他在一个意想不到的地方找到了“门”：厨房桌子上随意排列着一朵粉红色的玫瑰、一朵洋红色和奶油色的康乃馨和一朵淡紫色的鸢尾花。正如他在 1954 年出版的《知觉之门：偶然和临时》一书中回忆起的那一刻，这个小花瓶打破了传统的好品味的所有规则。那天早上吃早餐时，我被它生动的不和谐色彩所震惊。但这已经不是重点了。我现在看的不是不寻常的插花。我看到了亚当在他被创造的那天早上所看到的——赤裸裸的存在的奇迹，每时每刻 […]\n毫无疑问，赫胥黎会称这些花为“迷幻的”，如果这个词当时流行的话，但直到 1957 年，奥斯蒙德在与作家的通信中才有了他的尤里卡时刻。尽管两人对致幻剂采取了科学的、临床的方法，但他们远非对此毫无幽默感。赫胥黎试图为包括美斯卡林、LSD 和赛洛西宾在内的药物类别提出一个术语，提出了“phanerothyme”，来自希腊语中的“展示”和“精神”。在给奥斯蒙德的一封信中，他写下了这副对联：“为了让这个平凡的世界变得崇高，服用半克百里香。”奥斯蒙德 (Osmond) 的歌曲回应是：“要了解地狱或翱翔天使，只需吸一口迷幻药”（希腊语中的“心智表现”）。很容易想象他们咯咯笑着弹出另一个标签，但这也是不准确的。赫胥黎强烈反对随意、娱乐性地使用迷幻药，在他 10 年的实验中只经历了十几次“会话”。在赫胥黎第一次迷幻之旅之后的几年里，生活也因其他原因而改变。 1955 年，陪伴他 36 年的照顾者和伴侣玛丽亚死于乳腺癌，这让奥尔德斯几乎完全惊讶。很难对一个直到最后一周才知道妻子病入膏肓的男人完全同情，但后来，他在法律上是失明的，她决定不让他知道这个消息。直到一月底，他还在给马修和奥斯蒙德的信中写到她的“关节炎状况”。玛丽亚于 2 月 8 日去世。然而，尽管在玛丽亚生病期间他作为支持来源的所有失败，奥尔德斯令人钦佩地带领他的妻子进入来世，向她背诵西藏死者之书的教训，敦促她放下身体，面对明光据说要经历生死之间的那一刻。 “光是她的精神赖以生存的元素，因此，我所有的话都指的是光，”赫胥黎在她去世的美好回忆中写道。赫胥黎在对幻觉体验的沉思中，一次又一次地回到光的形象。在 1956 年《知觉之门》的后续作品《天堂与地狱》中，他研究了浪漫时期的“流行幻想艺术”，如烟花、幻术和幻灯表演。他还指出，如但丁所描绘的天堂，“仿佛被两个太阳照亮”。毫无疑问，著名的洛杉矶之光在让他留在这里这么多年方面发挥了作用。 1956 年，让包括他的新娘在内的所有人都感到惊讶的是，奥尔德斯在亚利桑那州尤马的汽车婚礼教堂再婚。劳拉·阿切拉 (Laura Archera) 是一位古典小提琴家和心理学家，她是玛丽亚 (Maria) 和奥尔多斯 (Aldous) 的朋友。正如她在赫胥黎的回忆录《永恒的时刻》（This Timeless Moment，1968 年）中回忆的那样，“我内心有一种反仪式主义的倾向，而‘驾车结婚’最具有非仪式性的吸引力。考虑到 Aldous 非常英国和维多利亚时代的成长经历，这个建议是他内心自由的另一个显着迹象。”教堂的女服务员被招募为证人，戒指来自五和十，但不知何故媒体仍然听到了婚礼的风声，记者在门外等着。赫胥黎意识到消息会很快传开，便给他唯一的儿子马修发了一封信。虽然赫胥黎的家人和老朋友因私奔而疏远，但新朋友也加入了进来，包括伊戈尔·斯特拉文斯基和金妮·菲佛，劳拉在婚前一直和她住在一起，很多人说她是她的情人（如果属实，将使劳拉成为作者的第二个双性恋妻子）。这对新婚夫妇搬进了比奇伍德峡谷德隆达大道上的一所房子，赫胥黎在那里开始创作他的最后一部小说《岛屿》（1962 年），这是对《美丽新世界》的一种乌托邦式的回应。这本书的背景是太平洋偏远的帕拉岛，这是一片热爱和平的土地，拥有未开发的石油储备，训练有素的八哥鸟提醒居民留在“此时此地！此时此地！”孩子们可以在不同的家庭之间自由移动，一种叫做 moksha 的蘑菇衍生物被仪式化地食用，以帮助人们保持与他们的“一体”的联系。这样的福境自然不能长久；一名冲上岸的闯入记者将一切置于危险之中。 1960 年，赫胥黎在接受《巴黎评论》采访时透露，“我还没有想出结局，但恐怕它必须以《失乐园》结尾——如果要现实一点的话。 ”一直以来，《知觉之门》的后遗症继续在高低文化中回荡。尽管赫胥黎拒绝了人们普遍认为自己是“先生”的看法。 LSD，”他对这个主题的热情和对迷幻药变革特性的信念使他与理查德·阿尔珀特和蒂莫西·利里建立了友谊，当时他是麻省理工学院的客座教授，他们在哈佛进行迷幻药研究。 Gerald Heard 的密友宗教学者 Huston Smith 也将他介绍给了剑桥的禅宗大师 Alan Watts。赫胥黎送给利瑞一本西藏亡灵之书，利瑞、阿尔珀特和理查德·梅茨纳后来将其改编成手册《迷幻体验》，该书于 1964 年出版，专门献给赫胥黎。\n在他回到洛杉矶后不久，一场毁灭性的野火将他在比奇伍德峡谷的家烧成灰烬，摧毁了赫胥黎的图书馆和他所有的手稿、笔记本、家庭照片和信件。作者最近被诊断出患有喉癌，他对他的朋友奥斯蒙德讽刺地说，死神把他看在眼里。正如劳拉所描述的那样，两人被大火“惊呆了”，几乎瘫痪了。 “一切多么美好！”她写了。 “外面的火焰给白墙带来了柔和的玫瑰色光芒。”几段之后，她承认，如果他们有“朋友”帮忙，就有时间将一些东西转移到安全的地方，而赫胥黎一家，不是她最初的忠实粉丝，无法原谅她。 .幸运的是，赫胥黎确实拯救了代表五年工作的岛屿手稿。它于 1962 年出版，广受好评； 《纽约时报》称这是他“关于人类状况和良好社会的可能性的最后一句话”。赫胥黎死后反思这本书，瓦茨称其为“形式为……的社会学蓝图”。", "note_en": "FIFTY YEARS AGO, on November 22, 1963, in his home at the top of Mulholland Highway beneath the first “O” in the Hollywood sign, the British author, psychedelic pioneer and visionary thinker Aldous Huxley lost his three-year battle with cancer. Per his written request, Huxley’s second wife, Laura, injected him with a dose of liquid LSD as the end drew near. She later described his passing as “the most serene, the most beautiful death.”\n   Earlier that same afternoon, President John F. Kennedy died of gunshot wounds in the emergency room of a Dallas hospital, and his widow could hardly say the same. So monumental was Kennedy’s grisly public assassination — even Laura Huxley recalled the nurses watching news reports about it as her husband lay dying — that its 50th anniversary has almost completely eclipsed Huxley’s in the national memory. In recent issues of  Vanity Fair and  The New York Times Book Review, feature articles have discussed the stacks of new books commemorating the Kennedy anniversary.\n   Huxley, however, hasn’t received much more than a lovely, deco-futurist illustrated edition of 1932’s  Brave New World, and an assessment from two  Times writers  that that dystopian classic, with its predictions of 4-D interactive films called “feelies” and the habitually prescribed drug soma (“a gram for a weekend, two grams for a trip to the gorgeous East, three for a dark eternity on the moon...”), comes across today as dated, anyway.\n   Huxley freely admitted that the novel as a form may not have been the best container for his prodigious flow of ideas – this is an author who was contracted, during his peak years, to produce three books a year. But  Brave New  World’s setting in a future where control is exerted through the monitored supply of mindless, artificial pleasure sounds uncomfortably close to our present reality. As recently as 2010, it was number three on a list of books Americans most want banned from public libraries.\n   I would argue that it wasn’t until Huxley moved to America — specifically, to Los Angeles — that the seeds of his lifelong fascinations with technology, pharmacology, the media, mysticism and spiritual enlightenment fully blossomed and bore fruit. It’s often said “The Sixties” officially began with the death of JFK and America’s “loss of innocence.” But without the dedicated and well-documented cosmic explorations of Aldous Huxley and his cohorts, the decade would have looked very different. It’s not an exaggeration to say that, without Huxley, Timothy Leary might never have tuned in and turned on, and Jim Morrison might never have broken on through.\n      Huxley was a poet before he became an essayist and novelist, publishing four books before 1921, when his first novel,  Crome Yellow, made him a literary sensation. A satire of Bohemian British high society after WWI, it established the 27-year-old writer as a fearless social critic and an outspoken pacifist, a stance that would lead him to leave England, and eventually, Europe. From 1930 on, Huxley and his wife, Maria, and their son Matthew spent much of their time in Sanary-sur-Mer in the South of France, where he wrote both  Brave New World and  Eyeless in Gaza (1936) .\n   In 1937, the family sailed to New York on the Normandie with their close friend Gerald Heard, to drive across America in a Ford sedan. They spent the summer near Taos, New Mexico, on a ranch given to D.H. and Frieda Lawrence by the art patroness Mabel Dodge Luhan. Although Lawrence had died in 1930 at the Huxley home in France — in Maria’s arms, no less — Frieda lived in Taos until her death, and the families remained close. D.H. and Aldous had forged their friendship during the idyllic Bloomsbury days; the two even made plans to start a utopian colony in Florida together. That vision never materialized, but it’s said that one of the reasons Dennis Hopper wanted to purchase Mabel Dodge Luhan’s personal Taos residence, which he did in 1970, was because of its association with Lawrence. In Hopper’s estimation, Lawrence was “the first freak.”\n   Huxley was a freak of a different stripe. Standing a gangly 6’4½” with an enormous head, he dressed almost exclusively in an academic’s uniform of baggy suits and often clutched a magnifying glass to help him read (he had had serious problems with his eyesight since his teenage years). The sedate Englishman, a descendant of both Matthew Arnold and the renowned Victorian zoologist Thomas Henry Huxley, didn’t exactly appear to be a poster boy for the counterculture when the Huxley family pulled up to their first Hollywood home on North Crescent Heights. However, his very publicly expressed philosophies and lifestyle choices contributed over the years to the global perception of Los Angeles as a land of heretics and hedonists, mystics and movie stars. Huxley’s role as a de facto ambassador for SoCal living did not make him very popular back in war-torn Europe — critics hurled vague insults, using words like “yoga” — but he seemed to embrace the contradictions of his new life from the outset.\n   The opening chapter of Huxley’s 1939 novel  After Many a Summer Dies the Swan, written shortly after the family’s arrival in LA, finds British scholar Jeremy Pordage observing Los Angeles for the first time, from a car. The city’s clashing architectural styles and its people and promises come rushing at him, as they probably did through Aldous’ own eyes:\n   MALTS CABINS DINE AND DANCE AT THE CHATEAU HONOLULU SPIRITUAL HEALING AND COLONIC IRRIGATION BLOCK LONG HOTDOGS BUY YOUR DREAM HOME  NOW!\n   Some claim the book was an inspiration for Orson Welles’s  Citizen Kane, largely  because of the shared characteristics between Pordage’s employer, Jo Stoyte, an eccentric millionaire who lives in a castle with his mistress and art collection, and Charles Foster Kane. The similarities end at the basic biography: Stoyte’s obsession is immortality, not power, and Huxley’s novel takes a sci-fi turn with the discovery of a 200-year-old man.\n   Not that Huxley was opposed to writing for the pictures, however; in fact, that was part of LA’s appeal for him. He’d become friendly with the writer and girl-about-town Anita Loos when he sent her a fan letter raving about her 1925 novel,  Gentlemen Prefer Blondes, and she helped get him a cushy job at MGM. But unlike Loos, who’d been honing her chops since the days of silent film, Huxley’s formal style didn’t lend itself to screenwriting. One of his only produced and credited scripts was a gloomy 1943 version of  Jane Eyre, starring Welles as the tortured Rochester. The dialogue is strange and stiff: “Fortune’s knocked me about, kneaded me with her knuckles, ‘til I flatter myself I’m as hard and as tough as an India rubber ball,” Welles intones, the line’s only saving grace his formidable baritone. Huxley also wrote the first draft of what ought to have been his onscreen masterpiece, Disney’s  Alice in Wonderland. Unfortunately Walt personally rejected it, claiming he could only understand every third word. One of his best film credits, Ken Russell’s  The Devils, adapted from  The Devils of Loudon, Huxley’s 1952 nonfiction novel investigating 17th century exorcism , was posthumous.\n   Aside from the disappointment of not “making it” in the studio system, life in the City of Angels was treating the Huxleys well. Their intimate social circle included Heard (a renowned philosopher and mystic in his own right) and Loos, as well as Charlie Chaplin and Paulette Goddard, astronomer Edwin Hubble and his wife Grace, fellow Brit expat writer Christopher Isherwood, and Mercedes de Acosta and Greta Garbo. It’s whispered that Garbo and de Acosta were among the bisexual Maria Huxley’s playmates in LA’s lesbian underground, and that Maria also procured young women for her husband’s enjoyment, pointing to a very wild side of the Huxleys’ private life.\n   It was at this time that Huxley began his friendship with Jiddhu Krishnamurti, the chosen “World Teacher” of Theosophy who’d renounced his role in the esoteric religion in 1929 but remained in Ojai, California all his life. Although he found the concept of the guru distasteful, believing that man had to be free to find his own path, Krishnamurti still lectured frequently and was revered as a teacher by many, including Huxley. He introduced the Huxleys to the practice of yoga, and impressed upon Aldous the importance of self-knowledge and free inquiry versus organized religion, with its dogma and symbols.\n   Along with Heard and Isherwood, Huxley also, upon his arrival in LA, became a serious student of Vedanta, the Hindu-based system of philosophy and spirituality. The three British writers studied with Swami Prabhavananda at the Vedanta Society in Hollywood, with its charming white-domed temple tucked above the 101 freeway. At the time, Heard was also creating and constructing the Trabuco College of Prayer in Laguna Beach, a center for mystical study that he funded with his family inheritance. Isherwood, on the other hand, committed himself to Vedanta so fully that he lived in the Society’s monastery and labored over a translation of the Bhagavad Gita. Huxley’s introduction to Isherwood’s translation expressed his own growing connection to mysticism, and particularly to the ancient philosophy of religion known as Perennialism. “Man possesses a double nature,” he wrote, “a phenomenal ego and an eternal Self, which is the inner man, the spirit, the spark of divinity within the soul. It is possible for a man, if he so desires, to identify himself with the spirit and therefore with the Divine Ground.” Huxley discovered that the quest for and the realization of the divinity within are themes in the mystical scriptures of all the major religions of the world, from Hinduism to Taoism to Buddhism. Thanks in large part to the library at Trabuco College, he was able to compile selections from primary religious texts and the words and writings of seers, philosophers and prophets from St. Theresa to Rumi to Meister Eckhart.\n   In 1945 he published his groundbreaking scholarly work on the subject,  The Perennial Philosophy. In the chapter “God in the World,” Huxley looked at the Greek concept of hubris and its inevitable response, nemesis, as it relates to nature, and the Christian idea that one must return to an uncorrupted childlike state to enter the Kingdom of Heaven. “Modern man no longer regards nature as being in any sense divine,” he wrote, “and feels perfectly free to behave towards her as an overweening conqueror and tyrant.”\n   A few years earlier Aldous and Maria had done what so many Angelenos feel compelled to do: they moved to the desert, seeking a deeper communion with the natural world. The couple bought a cabin in Llano, next to the ruins of an old socialist colony, Llano del Rio, where Huxley tended to his garden and worked in the desert light that he believed was helpful to his eyes. Here, surrounded by vast expanses of earth and boundless sky, he experienced something infinite and undeniable. “Silence is the cloudless heaven perceived by another sense. Like space and emptiness, it is a natural symbol of the divine,” Huxley wrote in an essay about the desert. Although he was a professed agnostic (his grandfather Thomas actually invented the term, in 1869), a spark had been lit: he found himself moving ever closer to divinity.\n   Appropriately for a British writer with mystical inclinations descended from a line of famous intellectuals and botanists, Huxley revered William Blake, and idealized the self-taught poet and artist’s ability to exist in a visionary state where angels were as visible as humans. In  The Perennial Philosophy,  Huxley first quoted the now-iconic phrase from Blake’s  The Marriage of Heaven and Hell, warning the reader that, “the process of ‘cleansing the doors of perception’ is often, at any rate in the earlier stages of the spiritual life, painfully like a surgical operation.”\n   Painful or not, this was exactly what Huxley was so ardently seeking. When he heard that a psychiatrist in Canada, Dr. Humphry Osmond, was researching the biochemical similarities of schizophrenia and mescaline, a peyote derivative, Huxley contacted the doctor and suggested that perhaps the drug could also offer insights into the visionary experience. He then invited Osmond to stay with him and Maria at their home on Kings Road during a 1953 psychiatric conference, an invitation that the doctor called “an honor and an opportunity.” There was just one small request from the host: “Do you have any of the stuff on hand? If so I hope you can bring a little…”\n   On a now-legendary May morning, Huxley ingested mescaline for the first time, with Osmond and Maria as his guides. He admitted that he was “convinced in advance that the drug would admit me, at least for a few hours, into the kind of inner world described by Blake.” He found the “door” in an unexpected place: the casual arrangement of a pink rose, a magenta-and-cream carnation and a pale purple iris on the kitchen table. As he recalled the moment in his 1954 book  The Doors of Perception:\n   Fortuitous and provisional, the little nosegay broke all the rules of traditional good taste. At breakfast that morning I had been struck by the lively dissonance of its colors. But that was no longer the point. I was not looking now at an unusual flower arrangement. I was seeing what Adam had seen on the morning of his creation — the miracle, moment by moment, of naked existence […]\n   No doubt Huxley would have called the flowers “psychedelic,” had the term then been in circulation, but it wasn’t until 1957 that Osmond had his Eureka moment during a correspondence with the writer. Although the two took a scientific, clinical approach to hallucinogens, they were far from humorless about it. In trying to come up with a term for the category of drugs that includes mescaline, LSD, and psilocybin, Huxley proposed “phanerothyme,” from the Greek words for “to show” and “spirit.” In a letter to Osmond, he wrote this couplet: “To make this mundane world sublime, take half a gram of phanerothyme.” Osmond’s sing-songy response was: “To fathom Hell or soar angelic, just take a pinch of psychedelic” (Greek for “mind-manifesting”). It’s tempting to imagine them giggling and popping another tab, but that, too, would be inaccurate. Huxley was vehemently opposed to the casual, recreational use of psychedelics and only experienced around a dozen “sessions” during his 10 years of experimentation.\n   The years following Huxley’s first psychedelic trip were life changing for other reasons, too. In 1955, Maria, his caretaker and companion of 36 years, died of breast cancer, to Aldous’ almost complete surprise. It’s hard to feel entirely sympathetic toward a man who didn’t know his wife was terminally ill until her final week, but then, he was legally blind and she’d been determined to keep the news from him. As late as the end of January, he was writing about her “arthritic condition” in letters to Matthew and Osmond. Maria died on February 8th.\n   Yet for all his failings as a source of support during Maria’s illness, Aldous admirably led his wife into the afterlife, reciting to her the lessons of the Tibetan Book of the Dead, urging her to let the body go and face the Clear Light that one is said to experience at the moment between life and death. “Light had been the element in which her spirit had lived, and it was therefore to light that all my words referred,” Huxley wrote in a beautiful remembrance of her passing.\n   In his musings on the visionary experience, Huxley returned again and again to the image of light. In  Heaven and Hell, his 1956 follow-up to  The Doors of Perception, he investigated “popular visionary art” of the Romantic period such as fireworks, phantasmagorias, and magic lantern shows. He also noted that Paradise, as depicted by Dante, was “illumined as though by two suns.” No doubt the famed LA light played a part in keeping him here for so many years.\n   In 1956, surprising everyone including his bride, Aldous remarried at a drive-in wedding chapel in Yuma, Arizona. Laura Archera was a classical violinist and psychologist who had been a friend to both Maria and Aldous; as she recalled in her memoir of Huxley,  This Timeless Moment (1968), “I have an anti-ritualistic streak in me, and a ‘drive-in marriage’ was most unritualistically attractive. Considering Aldous’s very British and Victorian upbringing, this suggestion was another revealing indication of his inner freedom.” The chapel’s ladies room attendant was recruited as a witness and the ring came from a five-and-ten, but somehow the press had still gotten wind of the wedding, and reporters were waiting outside the door. Realizing that news would spread fast, Huxley sent a letter alerting his only son, Matthew.\n   While Huxley’s family and old friends were alienated by the elopement, new friends had come into the fold, including Igor Stravinsky and Ginny Pfeiffer, the woman Laura had been living with before their marriage, and who many say was her lover (which, if true, would make Laura the author’s second bisexual wife). The newlyweds moved into a house on Deronda Drive in Beachwood Canyon, where Huxley began working on his final novel,  Island (1962) , a utopian response of sorts to  Brave New World. The book is set on the remote Pacific island of Pala, a peace-loving land with untapped oil reserves where trained mynah birds remind inhabitants to stay in the “Here and now! Here and now!” Children can move freely between different families and a mushroom derivative called moksha is ritualistically consumed to help people stay connected to their “oneness.” Naturally, such a blessed state can’t last; an interloping journalist who washes ashore puts everything at risk. In a 1960 interview with the  Paris Review, while he was still working on the book, Huxley revealed, “I haven’t worked out the ending yet but I’m afraid it must end with Paradise Lost — if one is to be realistic.”\n   All the while, the aftereffects of  The Doors of Perception continued to reverberate through high and low culture. Although Huxley rejected the popular view of himself as “Mr. LSD,” his enthusiasm for the subject and belief in the transformative properties of psychedelics led him to form friendships with Richard Alpert and Timothy Leary while he was a visiting professor at MIT and they were conducting their psychedelic research at Harvard. Religious scholar Huston Smith, a close friend of Gerald Heard’s, introduced him to Zen guru Alan Watts in Cambridge as well. Huxley gave Leary a copy of the Tibetan Book of the Dead that Leary, Alpert and Richard Metzner later adapted into the manual  The Psychedelic Experience, published in 1964 and dedicated to Huxley.\n   Shortly after his return to LA, a devastating wildfire burned his Beachwood Canyon home to the ground, destroying Huxley’s library and all his manuscripts, notebooks, family photos and letters. The author, who had recently been diagnosed with cancer of the larynx, wryly remarked to his friend Osmond that the grim reaper had him in his sights. As Laura described it, the two had been so “stunned” by the fire that they were rendered almost paralyzed. “How beautiful everything was!” she wrote. “The flames from the outside were giving to the white walls a soft, rosy glow.” A few paragraphs later she admitted that there would have been time to move some things to safety if they’d had a “friend” to help, and the Huxley family, not her biggest fans to begin with, couldn’t forgive her for this.\n   Luckily, Huxley did rescue the manuscript of  Island, which represented five years of work. It was published in 1962 to great acclaim;  The New York Times proclaimed it his “final word about the human condition and the possibility of the good society.” Reflecting on the book after Huxley’s death, Watts called it “a sociological blueprint in the form\n......", "posttime": "2021-07-29 21:47:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "洛杉矶,la,赫胥黎", "title": "勇敢的新洛杉矶：洛杉矶的奥尔德斯·赫胥黎 (2013)", "title_en": "Brave New LA: Aldous Huxley in Los Angeles (2013)", "transed": 1, "url": "https://lareviewofbooks.org/article/aldous-huxley-in-los-angeles/", "via": "", "real_tags": ["洛杉矶", "la", "赫胥黎"]}, {"category": "", "categoryclass": "", "imagename": "5815a0d0fd35eb91e85212293e6f90cf.jpg", "infoid": 1070234, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，谷歌发布了一些对其 Play 政策的更改，并在精确的法律改进和一些广告 ID 调整之间进行了调整，这对某些类型的约会人群来说是一个重磅炸弹。谷歌更新了其不当内容政策，以禁止“有偿性关系”——即糖爹或甜蜜约会应用程序。我不得不承认，我并不积极地知道傍大款应用程序是一回事，但显然，它们绝对是。事实上，我提出的符合该类别的应用程序的下载量远远超过一百万。尽管大多数人的评分出奇地高，但在某些情况下，评论的质量可能意味着正在发生一些操纵。尽管如此，很多人显然都在使用这些应用程序。除非您通过应用程序进行性交易，否则 Google 不会禁止这样做。那么它可能会禁止该应用程序。如果不知何故你不熟悉这个词，“糖爹”不仅仅是一根棒子上的焦糖糖果。在更常见的白话中，傍大款是一个人——通常是一个年长的男人，但你可以有一个“糖妈”或者一个性别中立的“糖父母”？ - 在通常的交易关系中花钱或给钱，通常是为了性方面的好处。我不评判，不同的人享受不同的东西，如果各方都完全知情同意，我看不出这样的安排对任何人有什么真正的伤害。但是，谷歌似乎确实在乎，尽管该公司明确表示并不反对这种关系的性质，只是他们经常是性关系，而且公司全面禁止色情内容——似乎忽略了这种关系的主要冲动Tinder 和 Hinge 等更通用的约会应用程序背后的许多客户，以及甚至主流约会应用程序用户交换的许多消息。我们已与 Google 联系以获取更多信息，了解禁令背后的更多信息，以及针对甜蜜约会应用程序而忽略其他潜在色情约会应用程序的确切逻辑。但是，与此同时，从 9 月 1 日开始，所有类型的爱吃糖的人都必须要么坚持访问网站，要么旁加载他们的甜蜜约会应用程序——这是 Android，与 iPhone 不同，您仍然可以从任何地方获取应用程序。", "note_en": "Today, Google published a handful of changes to its Play policies, and nestled among precise legalese refinements and some advertising ID tweaks is a bombshell for a  certain type of dating crowd. Google&#39;s updated its inappropriate content policy to ban &#34;compensated sexual relationships&#34; — i.e., sugar daddy or sugar dating apps.\n  I have to admit, I didn&#39;t actively know that sugar daddy apps were a thing,  but  apparently,  they  absolutely  are. In fact, the apps I&#39;ve pulled up that would qualify under that category have well over a million downloads. While most have a surprisingly high rating, the quality of reviews in some cases might imply a little manipulation is occurring. Still, a lot of people are clearly using these apps.\n  Google&#39;s not banning this unless you&#39;re trading one for sex via an app. Then it&#39;s probably banning that app.\n If somehow you aren&#39;t familiar with the term, a &#34;sugar daddy&#34; is more than a  caramel candy on a stick. In the more common vernacular, a sugar daddy is a person — usually an older man, but you could have a &#34;sugar mommy&#34; or maybe a gender-neutral &#34;sugar parent?&#34; — that spends or gives money in what is typically a transactional relationship, often for sexual favors.\n    I don&#39;t judge, different people enjoy different things, and if all parties are consenting with full knowledge, I don&#39;t see how an arrangement like that really harms anyone. But, it seems Google  does care, though the company is clear it&#39;s not objecting to the nature of the relationship, merely the fact that they&#39;re often  sexual relationships and the company has a blanket ban on sexual content — seemingly ignoring the primary impulse for many customers behind more generalized dating apps like Tinder and Hinge, as well as many of the messages that even mainstream dating app users swap.\n We&#39;ve reached out to Google for more information behind the ban and the precise logic that targets sugar-dating apps while ignoring other potentially sexualized dating apps. But, in the meantime,  starting on September 1st, sugar people of all types will have to either stick to websites or sideload their sugar-dating apps — this is Android, you can still get your apps from wherever, unlike iPhones.", "posttime": "2021-07-29 21:46:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,禁止,bans,应用程序", "title": "谷歌禁止 Play 商店中的“糖爹”应用", "title_en": "Google bans 'sugar daddy' apps from Play Store", "transed": 1, "url": "https://www.androidpolice.com/2021/07/28/google-bans-sugar-daddy-apps-from-play-store/", "via": "", "real_tags": ["谷歌", "google", "禁止", "bans", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "70d9d5ad1e72fbb53f6719dcb7de20ad.jpeg", "infoid": 1070233, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "联邦调查局 2019 年 4 月的本月神器是哈维赌场炸弹的试用模型。 （点击图片查看高分辨率。）联邦调查局 2019 年 4 月的本月神器是哈维赌场炸弹的试用模型。 39 年后，它仍然是该局遇到的最独特的简易爆炸装置 (IED) 之一。该装置包含近 1,000 磅的炸药和八个触发装置，这使它几乎不可战胜。 1980 年 8 月 26 日凌晨，穿着白色连身衣并假装交付 IBM 复印机的男子将炸弹扔进了位于太浩湖附近内华达州斯德特莱恩的 Harvey&#39;s Resort Hotel and Casino。炸弹留下的一张纸条——题为对管理层和炸弹小队的严厉警告——开头不祥：“不要移动或倾斜这颗炸弹，因为控制其中的雷管的机构将在小于 0.01开放式 Ricter [原文如此] 量表。” “不要试图把它拆开，”纸条继续说道。 “平头螺丝也固定在扳机上，转 1/4 到 3/4 圈就会引起爆炸……这种炸弹非常敏感，无论是内部还是外部，最轻微的移动都会导致它爆炸。这种炸弹永远不能在不引起爆炸的情况下拆除或解除武装。甚至不是创造者。”\n联邦调查局后来发现，“制造者”是 59 岁的老约翰·伯吉斯——他想要 300 万美元的现金作为回报，他提供指示以断开炸弹的三个自动计时器中的两个，以便将其移至远程爆炸前的区域。被发现后，炸弹被拍照、除尘指纹、X光检查和研究。最后，30 多个小时后，商定了一个计划：如果可以使用 C4 炸药的聚能装药切断两个盒子，它可能会断开雷管接线与炸药的连接。 Harvey&#39;s 和附近的太浩湖赌场被疏散，8 月 27 日下午，聚能装药被远程引爆。该计划是当时最好的计划，但没有奏效。炸弹爆炸了，在酒店内造成了一个五层楼高的火山口。邻近赌场的游客打赌炸弹何时会爆炸，或者是否会爆炸。炸弹引爆后，人群在安全距离外欢呼雀跃。由于联邦调查局和我们合作伙伴的计划，没有人员伤亡。 “今天的简易爆炸装置使用更先进的电子设备，”退休的特工 Thomas Mohnal 说，他是我们位于弗吉尼亚州匡蒂科的 FBI 实验室的爆炸物部门的前审查员。 “我们处理这些设备的技术和工具也更先进，”莫纳尔补充说，“但你可能仍然无法制造比哈维更难打败的炸弹。” Birges, Sr.，据说是一个赌徒，在 Harvey&#39;s 输了一大笔钱，他被抓住了（在附近一家旅馆的警员的帮助下，他写下了炸弹运货车的车牌）和被定罪。他的两个儿子被指控为共犯，因与当局合作而被判处缓刑。 Birges 于 1996 年在监狱中去世。\n今天，联邦调查局实验室在其爆炸物参考集中展示了该试验模型作为“值得注意的简易爆炸装置”示例。联邦调查局在调查中的合作伙伴包括内华达州公共安全部、加利福尼亚州警察局、美国陆军爆炸物条例处置部和核应急支持小组。", "note_en": "The FBI’s April 2019 Artifact of the Month is the trial model of Harvey’s Casino Bomb. (Click image to view high-res.)\n The FBI’s April 2019 Artifact of the Month is the trial model of Harvey’s Casino Bomb.\n After 39 years, it remains one of the most unique improvised explosives devices (IEDs) the Bureau has ever come across.\n The device contained nearly 1,000 pounds of dynamite and eight triggering mechanisms, which made it virtually undefeatable.\n In the early morning hours of August 26, 1980, men wearing white jumpsuits and pretending to deliver an IBM copy machine rolled a bomb into Harvey’s Resort Hotel and Casino in Stateline, Nevada, near Lake Tahoe.\n A note left with the bomb—titled STERN WARNING TO THE MANAGEMENT AND BOMB SQUAD—began ominously: “Do not move or tilt this bomb, because the mechanism controlling the detonators in it will set it off at a movement of less than .01 of the open end Ricter [sic] scale.”\n “Do not try to take it apart,” the note went on. “The flathead screws are also attached to triggers and as much as ¼ to ¾ of a turn will cause an explosion....This bomb is so sensitive that the slightest movement either inside or outside will cause it to explode. This bomb can never be dismantled or disarmed without causing an explosion. Not even by the creator.”\n The “creator,” the FBI later discovered, was 59-year-old John Birges, Sr.—who wanted $3 million in cash in return for supplying directions to disconnect two of the bomb’s three automatic timers so it could be moved to a remote area before exploding.\n After being discovered, the bomb was photographed, dusted for fingerprints, X-rayed, and studied. Finally, more than 30 hours later, a plan was agreed upon: if the two boxes could be severed using a shaped charge of C4 explosive, it might disconnect the detonator wiring from the dynamite.\n Harvey’s and other nearby casinos in Lake Tahoe were evacuated, and on the afternoon of August 27, the shaped charge was remotely detonated.\n The plan was the best one available at the time, but it didn’t work. The bomb exploded, creating a five-story crater in the hotel.\n Tourists at neighboring casinos bet on when the bomb would go off, or if it would go off. After the bomb detonated, crowds cheered and reveled from a safe distance. Due to the planning of the FBI and our partners, there were no deaths or injuries.\n “Today’s IEDs use more advanced electronics,” said retired Special Agent Thomas Mohnal, a former examiner in our Explosives Unit, based at the FBI Laboratory in Quantico, Virginia. “Our techniques and tools for dealing with these devices are also more advanced,” Mohnal added, “but you still probably couldn’t build a bomb much tougher to defeat than Harvey’s.”\n Birges, Sr., said to be an inveterate gambler who had lost a substantial amount of money at Harvey’s, was caught (with the help of an alert clerk at a nearby hotel who had written down the license plate of the bomb delivery van) and convicted. His two sons, charged as accomplices, were given suspended sentences because they cooperated with authorities. Birges died in jail in 1996.\n Today, the FBI Laboratory displays the trial model as a “notable IED” example in its explosives reference collection.\n The FBI’s partners in the investigation included the Nevada Department of Public Safety, the California State Police, the U.S. Army Explosive Ordinance Disposal, and the Nuclear Emergency Support Team.", "posttime": "2021-07-29 21:45:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "赌场,casino,炸弹", "title": "哈维赌场炸弹", "title_en": "Harvey’s Casino Bomb", "transed": 1, "url": "https://www.fbi.gov/history/artifact-of-the-month/april-2019-harveys-casino-bomb", "via": "", "real_tags": ["赌场", "casino", "炸弹"]}, {"category": "", "categoryclass": "", "imagename": "c193befae2b22183db2de37e2c6b61a9.png", "infoid": 1070232, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您可以在 Google Cloud 页面上查看所有 Google Cloud 的最新产品更新，或在 Google Cloud Console 中浏览和过滤所有发行说明。要向您发送最新的产品更新，请将此页面的 URL 添加到您的提要阅读器，或直接添加提要 URL：https://cloud.google.com/feeds/vpc-release-notes.xml 发布服务和使用 Private Service Connect 访问已发布的服务现在在 General Availability 中可用。如果您使用 Private Service Connect 发布或使用服务，Cloud Logging 中不会记录以下项目：端点状态更改和服务附件删除。删除端点时，不会调整连接到服务附件的 Private Service Connect 端点的数量。请参阅解决方法信息。 VM 实例的外部 IPv6 地址现已在支持区域的正式发布中提供。 Private Service Connect 服务附件详细信息现在可以正确显示消费者端点的状态。消费者端点可以具有除 Accepted 之外的状态。\n如果您在共享 VPC 网络中创建 Private Service Connect 终端节点，则终端节点不再需要位于包含向终端节点发送请求的虚拟机 (VM) 的同一项目中。如果 Google 是服务提供者（例如 Cloud SQL），则删除私有服务访问连接现在也会删除服务提供者创建的配置。如果您删除专用服务访问连接，但稍后又想重新创建它，则改进的删除过程可简化管理。此功能现已在正式发布中提供。用于访问 Google API 和服务的 Private Service Connect 端点的非 RFC 1918 地址的计费问题已得到修复。对于自动模式 VPC 网络，为德里 asia-south2 区域添加了一个新的子网 10.190.0.0/20。有关详细信息，请参阅自动模式 IP 范围。如果您使用 Private Service Connect 终端节点访问另一个 VPC 网络中的服务，并且您在短时间内删除了多个终端节点，一个或多个删除操作可能会失败。为避免此问题，请在两次删除之间等待 20 秒。如果您使用 Private Service Connect 端点访问另一个 VPC 网络中的服务，并且您创建的端点多于服务生产者设置的限制所允许的数量，那么在达到限制后创建的任何端点都将处于 Pending 状态，正如预期的那样。但是，如果您删除端点以使其低于限制，则这些端点的状态不会更改为已接受。对于自动模式 VPC 网络，为 Melbourne australia-southeast2 区域添加了一个新的子网 10.192.0.0/20。有关详细信息，请参阅自动模式 IP 范围。\n如果消费者网络中的私有服务连接端点连接到引用负载均衡器的服务附件，而没有后端 VM，它们现在不会变得无响应。在创建 Private Service Connect 服务附件后启用或禁用 PROXY 协议不会更改配置。但是，服务附件详细信息中显示的状态错误地显示状态已更改。要启用或禁用 PROXY 协议，请删除服务附件并使用正确的 PROXY 协议配置重新创建它。如果您为 Private Service Connect 服务附件启用 PROXY 协议，则 PROXY 协议标头值以前是 0xEA 或 0xE0。从今天开始，该值将始终为 0xE0。 Google Cloud Console 中的 Private Service Connect Published Services 选项卡现在可以正确显示服务附件。您现在可以使用控制台、gcloud 命令行工具或 API 查看和管理服务附件 当 Private Service Connect 消费者端点被删除时，服务附件详细信息现在可以正确反映此更改。 Private Service Connect 服务附件详细信息始终显示消费者端点的 Accepted 状态，即使它们具有不同的状态。状态正确显示在使用者端点详细信息中。删除 Private Service Connect 使用者端点后，服务附件详细信息不会反映此更改。\n使用 PATCH API 方法更新 Private Service Connect 服务附件要求您在请求正文中提供所有值，而不仅仅是您要更新的值。这会影响管理服务的访问请求和更改服务的连接首选项。如果为 Private Service Connect 服务附件启用 PROXY 协议，则 PROXY 协议标头值可能是 0xEA 或 0xE0。在正式发布之后，该值将始终为 0xE0。如果您使用 Private Service Connect 发布服务，并且引用的负载均衡器没有任何后端 VM，则使用者网络中的所有 Private Service Connect 端点可能会变得无响应。确保服务附件引用的所有负载平衡器都具有后端 VM。如果要在共享 VPC 网络中创建 Private Service Connect 终端节点，则必须在包含向终端节点发送请求的虚拟机 (VM) 的同一项目中创建该终端节点。 Google Cloud Console 中的 Private Service Connect Published Services 选项卡不显示服务附件。使用 gcloud 命令行工具或 API 查看和管理服务附件。使用 Private Service Connect 访问 Google API 和服务现在可以在 General Availability 中使用。由于计费问题，将非 RFC 1918 地址用于专用服务连接端点会导致意外成本。为防止出现此问题，请避免使用非 RFC 1918 IP 地址，而是将 RFC 1918 IP 地址用于专用服务连接端点。如果您受到此问题的影响，请联系您的客户团队进行补救。\n对于自动模式 VPC 网络，为 Warsaw europe-central2 区域添加了一个新的子网 10.186.0.0/20。有关详细信息，请参阅自动模式 IP 范围。将 nic0 以外的 VM 接口连接到共享 VPC 的功能现在可用于实例模板和托管实例组的一般可用性。此功能在 gcloud 命令行工具和 API 中可用。将 nic0 以外的 VM 接口连接到共享 VPC 的功能现在在 General Availability 中可用。此功能目前仅适用于单个 VM 实例。对实例模板和托管实例组的支持仍然是预览版。现在可以在预览版中使用 Private Service Connect 访问 Google API 和服务。将 nic0 以外的 VM 接口连接到共享 VPC 的功能现在在预览版中可用。此功能目前仅适用于单个 VM 实例，不适用于实例模板或托管实例组。对于自动模式 VPC 网络，为 Jakarta asia-southeast2 区域添加了一个新的子网 10.184.0.0/20。有关详细信息，请参阅自动模式 IP 范围。面向 VPC 流日志的 GKE 注释和高级控件现已在 General Availability 中可用。\nVPC 网络中的子网现在支持 RFC 1918 地址以外的 IP 地址。有关详细信息，请参阅子网范围。 Google Cloud 现在对 asia-east2 数据中心边界内的 VPC 流量进行加密。我们将逐步向其他地区推出此功能。 GCP 已经对所有数据中心之间的 VPC 流量进行加密，如 GCP 中的传输中加密中所述。本地主机的专用 Google Access 允许本地主机从任何内部 IP 地址发送流量，而不仅仅是 RFC 1918 地址。此功能现已普遍可用。对于自动模式 VPC 网络，为拉斯维加斯 us-west4 区域添加了一个新的子网 10.182.0.0/20。有关详细信息，请参阅自动模式 IP 范围。数据包镜像定价将于 2020 年 6 月 20 日生效。在此之前，数据包镜像不收取任何费用。对于自动模式 VPC 网络，为盐湖城 us-west3 区域添加了一个新的子网 10.180.0.0/20。有关详细信息，请参阅自动模式 IP 范围。对于自动模式 VPC 网络，为首尔 asia-northeast3 区域添加了一个新的子网 10.178.0.0/20。有关详细信息，请参阅自动模式 IP 范围。\nGoogle 现在对正在使用的静态外部 IPv4 地址收费，转发规则使用的地址除外。有关更多信息，请参阅网络定价。本地主机的专用 Google Access 现在允许本地主机从任何内部 IP 地址发送流量，而不仅仅是 RFC 1918 地址。此功能现在在 Beta 版中可用。具有 2 或 4 个 vCPU 的虚拟机现在的最大出口速率为 10 Gbps。此功能是普遍可用的。如需了解详情，请参阅 Compute Engine 文档中的机器类型。本地主机的 Private Google Access 的 private.googleapis.com 虚拟 IP 地址范围已普遍可用。本地主机的 Private Google Access 的 private.googleapis.com 虚拟 IP 地址范围处于测试阶段。使用 Skylake CPU 平台或 Ultramem 机器类型的虚拟机的 32Gbps 网络 I/O 出口速率增加，现已在一般可用性中提供。对于使用 Skylake CPU 平台或 Ultramem 机器类型的虚拟机，您可以获得高达 32Gbps 的网络 I/O。这种提高的出口率现在在 Beta 版中可用。\n您可以禁用新项目的默认网络创建。您必须创建组织策略并添加 compute.skipDefaultNetworkCreation 约束。本地主机的私有访问选项现在普遍可用。只有私有 IP 地址的本地主机可以通过 Cloud VPN 或 Cloud Interconnect 连接（混合连接方案）访问 Google API。用于创建旧网络的 IPv4Range 字段现已弃用，并将于 2021 年 6 月 1 日关闭。适用于本地主机的私有 Google 访问现在在 Beta 版中可用。只有私有 IP 地址的本地主机现在可以通过 Cloud VPN 或 Cloud Interconnect 连接（混合连接方案）访问 Google API。私有服务访问在您的 VPC 网络与 Google 或第三方拥有的网络之间提供私有连接。私有服务访问处于测试阶段。在共享 VPC 服务项目中，现在可以在 General Availability 中列出宿主项目中的可用子网。别名 IP 范围允许您为 VM 实例分配额外的 IP 地址。这些地址可供在 VM 上运行的容器使用。 Alias IP Ranges 现已在 General Availability 中提供。\n防火墙规则出口和拒绝规则允许您创建管理出口和入口流量的防火墙规则。您现在还可以创建拒绝规则，并且可以确定评估规则的优先顺序。防火墙规则出口和拒绝规则现在在一般可用性中可用。多个网络接口允许一个虚拟机实例拥有多个虚拟网络接口。每个接口必须指向不同的 VPC 网络。多网络接口现已在一般可用性中可用。添加对为 Beta 指定静态内部 IP 的支持。有关详细信息，请参阅保留静态内部 IP 地址。 VPC 网络对等允许您对等 VPC 网络，甚至是不同组织中的网络，以便网络可以使用内部 IP 地址相互通信。 VPC 网络对等互连现已公开发布。多个网络接口允许一个虚拟机实例拥有多个虚拟网络接口。每个接口必须指向不同的 VPC 网络。多个网络接口现在在 Beta 版中可用。别名 IP 范围允许您为 VM 实例分配额外的 IP 地址。这些地址可供在 VM 上运行的容器使用。别名 IP 范围现在在 Beta 版中可用。 VPC 网络对等允许您对等 VPC 网络，甚至是不同组织中的网络，以便网络可以使用内部 IP 地址相互通信。 VPC 网络对等互连现已推出 Beta 版。\nPrivate Google Access 允许 Compute Engine VM 实例仅使用内部 IP 地址访问 Google API。专用 Google 访问通道现已公开发布。解耦标签和标签，以便创建标签或标签不会创建相反的资源。例如，创建标签将不再创建标签，反之亦然。有关更多信息，请阅读实例标签和网络标签之间的关系。防火墙规则出口和拒绝规则允许您创建管理出口和入口流量的防火墙规则。您现在还可以创建拒绝规则，并且可以确定评估规则的优先顺序。防火墙规则出口和拒绝规则现在在 Beta 版中可用。共享 VPC 允许您与其他 GCP 项目共享 VPC 网络。共享 VPC 现已推出 Beta 版。 Private Google Access 允许 Compute Engine VM 实例仅使用内部 IP 地址访问 Google API。专用 Google 访问通道现已推出 Beta 版。更新了默认防火墙规则名称。每个项目都会自动创建默认防火墙规则。这些规则以前被命名为 default-internal 和 default-ssh。新项目将具有相同的默认防火墙，但具有以下新名称： default-allow-ssh - 允许通过端口 22 从任何源到网络上任何实例的 TCP 连接。\n发布了新的协议转发功能。转发规则允许您使用 target.instance 将流量转发到单个虚拟机实例。协议转发为这些附加功能提供支持： 添加了对新目标实例资源的支持，允许将未 NAT 的流量转发到单个虚拟机实例。有关更多信息，请参阅转发规则。", "note_en": "You can see the latest product updates for all of Google Cloud on the   Google Cloud page, or browse and filter all release notes in the  Google Cloud Console.\n  To get the latest product updates delivered to you, add the URL of this page to your  feed reader, or add the feed URL directly:  https://cloud.google.com/feeds/vpc-release-notes.xml\n  Publishing services and  accessing published services using  Private Service Connect is now available in  General Availability.\n If you are using  Private Service Connect to publish or consume services, the following items are not logged in Cloud Logging: changes in endpoint status, and service attachment deletions.\n The number of  Private Service Connect endpoints that are connected to a  service attachment is not adjusted when an endpoint is deleted. See  workaround information.\n  External IPv6 addresses for VM instances is now available in  General Availability in  supported regions.\n  Private Service Connect  service attachment details now correctly shows the status for consumer endpoints. Consumer endpoints can have a status other than Accepted.\n If you&#39;re creating a  Private Service Connect endpoint in a Shared VPC network, the endpoint no longer needs to be in the same project that contains the virtual machines (VMs) that send requests to the endpoint.\n  Deleting a private services access connection now also removes configurations created by the service producer, if Google is the service producer (for example, Cloud SQL). The improved deletion process simplifies administration if you delete a private services access connection, but later want to recreate it. This feature is now available in  General Availability.\n The billing issue for  non-RFC 1918 addresses for Private Service Connect endpoints that you use to access Google APIs and services has been fixed.\n  For auto mode VPC networks, added a new subnet  10.190.0.0/20 for the Delhi  asia-south2 region. For more information, see  Auto mode IP ranges.\n  If you are using  Private Service Connect endpoints to access services in another VPC network, and you  delete multiple endpoints ina short period of time, one or more of the deletions might fail. To avoid thisissue, wait 20 seconds between deletions.\n If you are using  Private Service Connect endpoints to access services in another VPC network, and you create more endpoints than areallowed by the limit set by the service producer, any endpoints created afterthe limit is reached have a status of  Pending, as expected. However, if youremove endpoints to get below the limit,the status of those endpoints does not change to  Accepted.\n  For auto mode VPC networks, added a new subnet  10.192.0.0/20 for the Melbourne  australia-southeast2 region. For more information, see  Auto mode IP ranges.\n  Private Service Connect endpoints in consumer networks now won&#39;t become unresponsive if they are connected to a service attachment that references a load balancer without backend VMs.\n    Enabling or disabling  PROXY protocol after a Private Service Connect service attachment is created does not change the configuration. However, the status shown in the service attachment details incorrectly shows that the status has changed. To enable or disable PROXY protocol, delete the service attachment and recreate it with the correct PROXY protocol configuration.\n  If you enable PROXY protocol for a Private Service Connect service attachment, the  PROXY protocol header value was previously either  0xEA or  0xE0. Starting today, the value will always be  0xE0.\n  The Private Service Connect Published Services tab in the Google Cloud Console now correctly displays service attachments. You can now  view and  manage service attachments using the Console, the gcloud command-line tool, or the API\n When a Private Service Connect  consumer endpoint is deleted, the  service attachment details now correctly reflects this change.\n   Private Service Connect  service attachment details always show a status of  Accepted for consumer endpoints, even if they have a different status. The status is correctly displayed in the  consumer endpoint details.\n When a Private Service Connect  consumer endpoint is deleted, the  service attachment details do not reflect this change.\n Updating a Private Service Connect service attachment using the  PATCH API method requires that you provide all values in the request body, not just the values that you are updating. This affects  Managing access requests for a service and  Changing the connection preference for a service.\n If you enable PROXY protocol for a Private Service Connect service attachment, the  PROXY protocol header value might be  0xEA or  0xE0. After General Availability, the value will always be  0xE0.\n If you publish a service using Private Service Connect, and the referenced load balancer does not have any backend VMs, all Private Service Connect endpoints in the consumer network might become unresponsive. Make sure that that all load balancers that are referenced by a service attachment have backend VMs.\n If you want to create a  Private Service Connect endpoint in a Shared VPC network, the endpoint must be created in the same project that contains the virtual machines (VMs) that send requests to the endpoint.\n The Private Service Connect Published Services tab in the Google Cloud Console does not display service attachments. Use the gcloud command-line tool or the API to  view and  manage service attachments.\n    Access to Google APIs and services using  Private Service Connect is now available in  General Availability.\n Using non-RFC 1918 addresses for  Private Service Connectendpoints results in unexpected costs due to a billing issue. To prevent thisissue, avoid using non-RFC 1918 IP addresses and instead use RFC 1918 IPaddresses for Private Service Connect endpoints. If you areaffected by this issue, contact your account team for remediation.\n  For auto mode VPC networks, added a new subnet  10.186.0.0/20 for the Warsaw  europe-central2 region. For more information, see  Auto mode IP ranges.\n The ability to connect  VM interfaces other than nic0 to a  Shared VPC is now available in  General Availability for instance templates and managed instance groups. This feature is available in the  gcloud command-line tool and the API.\n      The ability to connect  VM interfaces other than nic0 to a  Shared VPC is now available in  General Availability. This feature presently only GA for individual VM instances. Support for instance templates and managed instance groups is still  Preview.\n    Access to Google APIs and services using  Private Service Connect is now available in  Preview.\n   The ability to connect  VM interfaces other than nic0 to a  Shared VPC is now available in  Preview. This feature presently only works with individual VM instances, not with instance templates or managed instance groups.\n               For auto mode VPC networks, added a new subnet  10.184.0.0/20 for the Jakarta  asia-southeast2 region. For more information, see  Auto mode IP ranges.\n    GKE annotations and advanced controls for  VPC Flow Logs is now available in  General Availability.\n  Subnets in VPC networks now support IP addresses other than RFC 1918 addresses. For more information, see  Subnet ranges.\n  Google Cloud now encrypts VPC traffic within the boundaries of the data centers in  asia-east2. We will roll out this feature gradually to other regions. Google Cloud already encrypts VPC traffic  between all data centers as described in  Encryption in Transit in Google Cloud.\n  Private Google Access for on-premises hosts permits on-premises hosts to send traffic from any internal IP addresses, not just RFC 1918 addresses. This feature is now  Generally Available.\n  For auto mode VPC networks, added a new subnet  10.182.0.0/20 for the Las Vegas  us-west4 region. For more information, see  Auto mode IP ranges.\n Packet Mirroring pricing will come into effect from June 20, 2020. There is no charge for Packet Mirroring until that time.\n    For auto mode VPC networks, added a new subnet  10.180.0.0/20 for the Salt Lake City  us-west3 region. For more information, see  Auto mode IP ranges.\n  For auto mode VPC networks, added a new subnet  10.178.0.0/20 for the Seoul  asia-northeast3 region. For more information, see  Auto mode IP ranges.\n  Google now charges for static external IPv4 addresses that are in use, except for ones that are used by forwarding rules. For more information, see the  Network pricing.\n  Private Google Access for on-premises hosts now permits on-premises hosts to send traffic from any internal IP addresses, not just RFC 1918 addresses. This feature is now available in  Beta.\n    Virtual machines with 2 or 4 vCPUs now have a maximum egress rate of 10 Gbps. This feature is Generally Available. For more information, see  Machine types in the Compute Engine documentation.\n  The  private.googleapis.com virtual IP address range for  Private Google Access for on-premises hosts is  Generally Available.\n         The  private.googleapis.com virtual IP address range for  Private Google Access for on-premises hosts is in  Beta.\n  The increased egress rate of  32Gbps of network I/O for virtual machines that use either the Skylake CPU platform or ultramem machine types, is now available in  General Availability.\n    You can get up to  32Gbps of network I/O for virtual machines that use either the Skylake CPU platform or ultramem machine types. This increased egress rate is now available in  Beta.\n        You can disable the  default network creation for new projects. You must  create an organization policy and add the  compute.skipDefaultNetworkCreation constraint.\n  The  private access option for on-premises hosts is now  Generally Available. On-premises hosts with only private IP addresses can access Google APIs through a Cloud VPN or Cloud Interconnect connections (hybrid connectivity scenarios).\n  The  IPv4Range field for creating  legacy networks is now deprecated and will shut down on  June 1, 2021.\n      Private Google Access for on-premises hosts is now available in  Beta. On-premises hosts with only private IP addresses can now access Google APIs through Cloud VPN or Cloud Interconnect connections (hybrid connectivity scenarios).\n  Private services access provides a private connection between your VPC network and a network owned by Google or a third party. Private services access is in  Beta.\n      In Shared VPC service projects,  listing usable subnets in the host project is now available in  General Availability.\n              Alias IP Ranges allows you to assign additional IP addresses to a VM instance. These addresses can be used by containers running on the VM. Alias IP Ranges is now available in  General Availability.\n Firewall Rules egress and deny rules allows you to create firewall rules that govern egress as well as ingress traffic. You can now also create deny rules and you can prioritize the order in which rules are evaluated. Firewall Rules egress and deny rules is now available in  General Availability.\n  Multiple Network Interfaces allows a VM instance to have more than one virtual network interfaces. Each interface must point to a different VPC network. Multiple Network Interfaces is now available in  General Availability.\n  Add support for specifying a static internal IP to  Beta. See  Reserving a Static Internal IP Address for more information.\n  VPC Network Peering allows you to peer VPC networks, even networks in different organizations, so that the networks can communicate with each other using internal IP addresses. VPC Network Peering is now available in  General Availability.\n  Multiple Network Interfaces allows a VM instance to have more than one virtual network interface. Each interface must point to a different VPC network. Multiple Network Interfaces is now available in  Beta.\n    Alias IP Ranges allows you to assign additional IP addresses to a VM instance. These addresses can be used by containers running on the VM. Alias IP Ranges is now available in  Beta.\n  VPC Network Peering allows you to peer VPC networks, even networks in different organizations, so that the networks can communicate with each other using internal IP addresses. VPC Network Peering is now available in  Beta.\n  Private Google Access allows Compute Engine VM instances to access Google APIs using an internal IP address only. Private Google Access is now available in  General Availability.\n  Decoupled labels and tags so that creating either a label or a tag will not create the opposing resource. For example, creating a label will no longer create a tag and vice-versa. For more information, read  Relationship between instance labels and network tags.\n   Firewall Rules egress and deny rules allows you to create firewall rules that govern egress as well as ingress traffic. You can now also create deny rules and you can prioritize the order in which rules are evaluated. Firewall Rules egress and deny rules is now available in  Beta.\n  Shared VPC allows you to share a VPC network with other GCP projects. Shared VPC is now available in  Beta.\n  Private Google Access allows Compute Engine VM instances to access Google APIs using an internal IP address only. Private Google Access is now available in  Beta.\n        Updated default firewall rule names. Default firewall rules are automatically created with every project. These rules were previously named  default-internal and  default-ssh. New projects will have the same default firewalls but with the following new names:\n default-allow-ssh - Allows TCP connections from any source to any instance on the network, over port 22.\n   Released new Protocol Forwarding feature.  Forwarding rules allows you to forward traffic to a single virtual machine instance, using a target.instance. Protocol forwarding provides support for these additional features:\n Added support for new  Target Instance resources, which allows for non-NAT&#39;ed traffic to be forwarded to a single virtual machine instance. See  Forwarding rules for more information.", "posttime": "2021-07-29 21:45:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,vm,ipv6,现在", "title": "VM 实例的外部 IPv6 地址现已全面发布", "title_en": "External IPv6 addresses for VM instances is now in General Availability", "transed": 1, "url": "https://cloud.google.com/vpc/docs/release-notes#July_20_2021", "via": "", "real_tags": ["发布", "vm", "ipv6", "现在"]}, {"category": "", "categoryclass": "", "imagename": "06ca95a8958862266ebf976ab6f7f34a.jpg", "infoid": 1070231, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有一些短语应该会阻止你的脚步。对未来充满“无尽痛苦”的警告就是其中之一。这正是来自世界各地的科学家所警告的，如果我们不认真对待气候变化的威胁，将会发生什么。在周三发表在《生物科学》杂志上的一篇论文中，来自 153 个国家的 14,000 多名科学家签署了他们的名字进行研究，警告即将到来的气候紧急情况。这篇由俄勒冈州立大学的研究人员领导的论文使用了 31 个不同的行星变量，这些变量告诉我们地球在面对人类坚持消耗自然资源并将温室气体排放到大气中时是如何承受的。检查清单包括地表温度水平、雨林健康状况和冰川水平，以及直接由人为控制的因素，如全球经济的健康状况和化石燃料补贴的可用性。如果您将这些指标中的每一个都视为地球身体中的一个重要器官，那么听到这些器官中的大多数都快要衰竭了，您将不会感到兴奋。根据该论文，31 项指标中有 18 项达到了创纪录的水平——而这些不是我们应该试图打破的记录。报告称，冰川冰的密度处于 70 多年来的最低点。与此同时，尽管温室气体排放量似乎在 2019 年趋于平稳，甚至在 2020 年 COVID-19 大流行的早期阶段急剧（尽管短暂）下降，但温室气体排放量已达到历史最高水平。那不是可能会改变，即使越来越多的国家承诺减少排放。专家警告说，即使有到 2050 年实现净零碳排放的目标，温室气体排放量至少会在 2040 年继续上升。在等式的社会方面，我们也没有给自己任何好处——尽管至少有一些希望的迹象。科学家们发现，正如全球国内生产总值所表明的那样，世界比以往任何时候都更加富裕。再说一次，它也像以往一样受到污染，大气中二氧化碳、甲烷和一氧化二氮的浓度达到了有史以来最高水平。如果说我们的未来有一个充满希望的指标，那就是化石燃料补贴下降到创纪录的低水平这一事实。虽然石油和天然气公司和资源开发者仍有大约 1,810 亿美元的可用资金，但比 2019 年的可用金额下降了 42%。还值得注意的是，风能和太阳能等可再生能源现在更便宜选择全球而不是煤炭。即使在痴迷煤炭和否认气候变化的特朗普政府的领导下，美国在 2020 年历史上首次看到可再生能源超过了肮脏燃烧的燃料来源。 本周发表的论文是对 2019 年进行的类似研究的更新，收集了超过 11,000 名科学家的签名。自那篇论文最初发表以来，世界已经遭受了由气候变化引起或恶化的极端天气事件的严重影响。 2020 年，自然灾害造成的损失估计为 630 亿美元，经济损失为 2680 亿美元。这些事件以及地球上一些最重要指标的健康状况不断下降，促使 3,000 多名科学家加入了最新的警告信。现在由政府、行业和我们其他人来真正注意这些警告——或者忍受接下来发生的事情。", "note_en": "There are some phrases that should stop you in your tracks. The warning of a future that holds &#34;untold suffering&#34; is one of them. That is exactly what scientists from around the world are cautioning will happen if we don&#39;t take the threat of climate change seriously. In a paper published Wednesday in the journal  BioScience, more than 14,000 scientists from 153 countries signed their name to research that  warns of an incoming climate emergency.\n The paper, led by researchers from Oregon State University, uses 31 different planetary variables that tell us how Earth is holding up in the face of humanity&#39;s insistence on draining natural resources and pumping greenhouse gases into the atmosphere. The list of checks includes surface temperature levels, rainforest health, and glacial ice levels, along with directly human-controlled factors like the health of the global economy and the availability of fossil fuel subsidies.\n If you think of each of those indicators as a vital organ in the Earth&#39;s body, you won&#39;t be thrilled to hear that a majority of those organs are careening toward failure. According to the paper, 18 of the 31 indicators have reached record levels — and these are not records that we should be trying to break. The density of glacial ice is at its lowest in more than 70 years, according to the report. Meanwhile, greenhouse gas emissions have peaked to an all-time high, despite  appearing to have leveled off in 2019 and even  experiencing a drastic (albeit  short-lived) drop off during the early stages of the COVID-19 pandemic in 2020. That&#39;s not likely to change, even as increasingly more countries pledge to decrease emissions. Experts have warned that, even with goals of reaching net-zero carbon emissions by 2050, greenhouse gas  emissions will likely continue to rise through at least 2040.\n Over on the social side of the equation, we aren&#39;t doing ourselves any favors, either — though there are at least some signs of hope. The scientists found that the world is richer than it has ever been, as indicated by global gross domestic product. Then again, it&#39;s also as polluted as it has ever been, with some of the highest levels of carbon dioxide, methane, and nitrous oxide concentrations ever recorded in the atmosphere.\n If there is one hopeful indicator for our future, it&#39;s the fact that fossil fuel subsidies are dropping to record low levels. While there is still an estimated $181 billion available to oil and gas firms and resource exploiters, that&#39;s a 42% decline from the amount that was available in 2019. It&#39;s also worth noting that renewable energy sources, like wind and solar, are now  a cheaper option globally than coal. Even under the coal-obsessed and climate change-denying Trump administration, the United States saw  renewables surpass the dirty-burning fuel source for the first time in history in 2020.\n The paper published this week is an update on similar  research conducted in 2019, which amassed signatures from more than 11,000 scientists. In the time since that paper was initially published, the world has suffered significantly from extreme weather events caused or made worse by climate change. In 2020, an estimated  $63 billion in damage and $268 billion in economic loss was caused by natural disasters. Those events, along with the declining state of health for some of the planet&#39;s most important indicators, encouraged more than 3,000 scientists to join onto the latest iteration of warning letter. Now it&#39;s up to governments, industry, and the rest of us to actually heed these warnings — or suffer through what comes next.", "posttime": "2021-07-29 21:44:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,警告,warn", "title": "14,000 名科学家警告说，如果我们不对气候变化采取行动，将会遭受“难以言喻的痛苦”", "title_en": "14,000 scientists warn of “untold suffering” if we fail to act on climate change", "transed": 1, "url": "https://www.mic.com/p/14000-scientists-warn-of-untold-suffering-if-we-fail-to-act-on-climate-change-82642062", "via": "", "real_tags": ["科学家", "警告", "warn"]}, {"category": "", "categoryclass": "", "imagename": "a959749b5e8762f3bc62d1c614e1efca.jpg", "infoid": 1070230, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航 跳转到搜索 Potooooooooo 或 Pot-8-Os 的变种（1773 年 - 1800 年 11 月）是一匹 18 世纪的纯种赛马，他赢得了 30 多场比赛并击败了当时一些最伟大的赛马。他后来成为了一名爵士。他现在最出名的是他名字的不寻常拼写，发音为“Potatoes”。 Potoooooooo（各种来源也拼写为 Pot-8-Os、Pot8Os、Pot8O&#39;s 或 Pot 8 Os）是 1773 年由第四代阿宾登伯爵威洛比·伯蒂（Willoughby Bertie）饲养的栗色小马。他的后代是不败的 Eclipse。他是 Sportsmistress 的第一匹小马驹，它由 Warren 的 Sportsman 作育，可追溯到 Thwaites 的 Dun Mare，来自她母马一侧的 38 号家族。 [1] [2] 他名字的由来有几个不同的版本。根据最常见的说法，伯蒂打算叫小马驹“土豆”，并指示马厩男孩在饲料箱上写下这个名字。马厩男孩将这个名字拼写为“Potooooooooo”（Pot 后跟 8 个“o”；也就是说，拼写失败的尝试），这让 Bertie 很开心，他采用了这个拼写。 [3] 随后的作者使用了各种拼写来反映预期的修订发音“Potatoes”。 [1] 在赛马会的在线数据库 equineline.com 中，名称拼写为 Pot8O&#39;s。 [4] General Stud Book 使用 Potoooooooo。 [5] Potoooooooo 从 1776 年到 1783 年参加比赛，从 28 [2] 次累积到 34 [1] 次，估计有 40 场比赛，主要是在 Newmarket 的 Beacon 赛道上进行的 4 英里比赛。 1776 年，他在纽马克特的第一次春季会议上赢得了 100 几内亚抽奖。 [7] 1777 年，四岁的他在两场纽马克特的 4 岁小马比赛中获得第二名，在诺丁汉获得第三名，在约克的 Great Subscription Purse 比赛中获得第五名。 1778 年，五岁的 Potooooooo 在纽马克特的第一次春季会议上参加了 1200 几内亚锦标赛。在比赛期间，伯蒂以 1,500 几内亚的价格将这匹马卖给了第一代格罗夫纳伯爵理查德格罗夫纳。 Potooooooooo 赢得了比赛，随后在 Grosvenor 的黄色和黑色丝绸下参加比赛。那年他随后赢得的胜利包括第二次春季会议上的 140 基尼订阅钱包、伊普斯维奇的订阅、斯瓦夫汉姆的 50 英镑钱包以及纽马克特 10 月第二次会议上的另一场订阅竞赛。 [7] 1779 年，六岁的他在纽马克特赢得了多场比赛，包括金杯赛、克莱蒙杯和十月杯。 [7] 1780 年，他再次在纽马克特赢得了几场比赛，包括在 140 几内亚的订阅钱包中他击败了弗格斯国王、赛马俱乐部板块和克莱蒙杯的另一场比赛。他还两次与查尔斯·戴弗斯爵士的啄木鸟比赛，这是希律多年来最好的儿子，赢得了一次。 1781 年，他通过步行和 400 几内亚的横扫赢得了赛马会板和鞭。 10 月，他“通过共同同意”收到了 85 基尼，作为没有从 140 基尼订阅钱包开始的奖励。 1782 年，他第三次在克莱蒙赛马过马，第三次赢得赛马俱乐部名牌，并在克雷文锦标赛中获胜，击败了 13 匹年轻的马。 1783 年，10 岁的他赢得了纽马克特的鞭子，但在 300 基尼的比赛中输给了刺客，后者赢得了前一年的德比和 200 基尼的抽奖。\n1784 年，Potooooooooo 退休，在剑桥郡巴尔舍姆附近的 Oxcroft 农场种马，在那里他主要饲养格罗夫纳拥有的母马。对于其他母马，他的种马费最初是 5 基尼，逐渐增加到 21 基尼。 1796 年，他搬到纽马克特附近的上野兔公园。在他的职业生涯中，Potooooooo 一共获得了 172 羽冠军，总奖金为 61,971 英镑。 [7] 他的主要后代包括： [1] [2] [7] 芦笋 (1787)，一个优秀的赛跑者和罗达 (1816 年 1000 几内亚冠军) 的父亲 Waxy (1790)，他在 1793 年赢得了德比锦标赛和其他十个种族。 Waxy 是 1810 年的主要种公，负责将 Eclipse 种系延续至今。 [8] Edwin 的姐妹 (1794)，Family 3-i [9] 的直根母马和随后的 Family 3-l 冠军 (1797)，第一匹赢得德比和 St. Leger Stakes 的马（1800 年） ) Parasol (1800)，他赢得了许多比赛，是经典冠军 Pindarrie (2000 几内亚) 和 Pastille (橡树和 2000 几内亚) Mandane (1800) 的母亲，他是 11-g 家族的主根母马。 [10] 曼努埃拉大坝 (1812 Oaks Stakes)、Altisidora (St Leger)、彩票 (Doncaster Cup) 和 Brutandorf (切斯特杯)\nPotooooooooo 于 1800 年 11 月去世，享年 27 岁，葬于野兔公园。大约 200 年后，当一棵树被吹倒时，他的骨架被发现了。 [3] 骨架在纽马克特国家赛马博物馆的国王场画廊展出。 [11] Potoooooooo 是不败的 Eclipse 的父亲，尽管他从未在父亲名单中名列前茅，但他也是一匹非常成功的种马。他的母亲是 Sportsmistress，她的母亲 Golden Locks 与 Crab 2 × 2 近交——他既是她的外祖父，也是她的外祖父。 Sportsmistress 将生产总共 11 匹小马驹，包括托马斯爵士，[5] 1788 年德比的冠军。 Pot-8-Os 与 Godolphin Arabian 和 Crab 是 4 × 4 近交，这意味着这些种马在 Potooooooooo 的第四代谱系中都出现了两次。 ^ abcde Ahnert, Rainer L.（主编），《世界纯种育种》，波兹登出版社，德国，1970 年 ^ ab Byles, Tony（2015 年 1 月 14 日）。关于赛马历史的 101 个有趣事实（Kindle 版）。顶峰出版。 ISBN 9781910295328。^ ab 普通种马书（来自第二伦敦版的第一个美国人）。韦瑟比斯。 1834. 页。 267 . ^ abcde 怀特，詹姆斯·克里斯蒂 (1840)。英国草皮的历史，从最早时期到现在，第一卷。伦敦：H. Colburn。第 567-569 页。 OL 6544990M。", "note_en": "Jump to navigation  Jump to search  Potoooooooo or variations of  Pot-8-Os (1773 – November 1800) was an 18th-century  thoroughbred racehorse who won over 30 races and defeated some of the greatest racehorses of the time. He went on to be a  sire. He is now best known for the unusual spelling of his name, pronounced &#39;Potatoes&#39;.\n   Potoooooooo (also spelled Pot-8-Os, Pot8Os, Pot8O&#39;s or Pot 8 Os from various sources) was a chestnut colt bred by  Willoughby Bertie, 4th Earl of Abingdon, in 1773. He was sired by the undefeated  Eclipse. He was the first foal out of Sportsmistress, who was sired by Warren&#39;s Sportsman and traced to Thwaites&#39; Dun Mare from  family number 38 on her dam&#39;s side.  [1]  [2]\n The origin of his name has several different versions. According to the most common, Bertie intended to call the young colt &#34;Potato&#34; and instructed the stable boy to write the name on a feed bin. The stable boy spelled the name as &#34;Potoooooooo&#34; (Pot followed by 8 &#34;o&#34;s; that is, a failed attempt at spelling phonetically), which so amused Bertie that he adopted the spelling.  [3] Subsequent writers have used a variety of spellings that reflect the intended revised pronunciation, &#34;Potatoes&#34;.  [1] In  The Jockey Club&#39;s online database equineline.com, the name is spelled as Pot8O&#39;s.  [4] The   General Stud Book uses Potoooooooo.  [5]\n  Potoooooooo raced from 1776 to 1783, accumulating from 28  [2] to 34 wins  [1]  from an estimated 40 starts, mostly in 4 mile races on Newmarket&#39;s Beacon course. In 1776, he won a 100 guinea sweepstakes at Newmarket&#39;s first spring meeting.  [7] In 1777 at age four, he finished second in two  Newmarket races for 4 year old colts, third at  Nottingham, and fifth in the  Great Subscription Purse at  York.\n In 1778 at age five, Potoooooooo was entered in the  1200 Guineas Stakes at Newmarket&#39;s first spring meeting. During the race, Bertie sold the horse to  Richard Grosvenor, 1st Earl Grosvenor for 1,500 guineas. Potoooooooo won the race and subsequently raced under Grosvenor&#39;s yellow and black  silks.  His subsequent wins that year included the 140 guineas subscription purse at the second spring meeting, a subscription at Ipswich, a £50 purse at Swaffham and another subscription race at Newmarket&#39;s second October meeting.  [7]\n In 1779 at age six, he won a number of races at Newmarket, including the Gold Cup, a  walkover for the Clermont Cup  and the October Cup.  [7] In 1780, he again won several races at Newmarket, including the 140 guineas subscription purse where he beat  King Fergus, the Jockey Club Plate and another walkover in the Clermont Cup. He also raced twice against Sir Charles Davers&#39;  Woodpecker,  Herod&#39;s best son from these years, winning once.\n In 1781, he won the Jockey Club Plate and the Whip, both by walkover, plus a 400 guineas sweep. In October, he received 85 guineas &#34;by common consent&#34; as a reward for  not starting in the 140 guineas subscription purse. In 1782, he had a third walkover in the Clermont, won the Jockey Club Plate for a third time, and was victorious in the  Craven Stakes, beating thirteen mostly younger horses. In 1783 at age ten, he won the Whip at Newmarket, but lost a 300 guineas  match race to  Assassin, who had won the previous year&#39;s Derby, and a 200 guineas sweepstakes.\n  In 1784, Potoooooooo was retired to stud at Oxcroft Farm near  Balsham, Cambridgeshire, where he mostly covered mares owned by Grosvenor. For other mares, his stud fee was initially 5 guineas, gradually increasing to 21 guineas. In 1796, he was relocated to Upper Hare Park near  Newmarket. During his career, Potoooooooo sired 172 winners of £61,971.  [7] His leading offspring include:  [1]  [2]   [7]\n Asparagus (1787), a good runner and sire of  Rhoda (winner of the  1000 Guineas in 1816)\n Waxy (1790), who won the  Derby Stakes in 1793 and ten other races. Waxy was the  leading sire in 1810 and is responsible for the continuation of the Eclipse sire line to the present day.  [8]\n Sister to Edwin (1794), taproot mare of Family 3-i  [9] and the subsequent branch Family 3-l\n Champion (1797), the first horse to win both the Derby and the  St. Leger Stakes (in 1800)\n  Parasol (1800), who won many races and was a dam of Classic winners  Pindarrie (2000 Guineas) and  Pastille (Oaks and 2000 Guineas)\n Mandane (1800), taproot mare of Family 11-g.  [10] Dam of  Manuella (1812  Oaks Stakes),  Altisidora (St Leger), Lottery ( Doncaster Cup) and Brutandorf ( Chester Cup)\n Potoooooooo died in November 1800 at the age of 27 and was buried at Hare Park. Some 200 years later, his skeleton was uncovered when a tree blew over.  [3] The skeleton is on display at the Kings Yard Galleries of the  National Horseracing Museum in Newmarket.  [11]\n  Potoooooooo was sired by the undefeated Eclipse, who was also a very successful stallion even though he never led the sire list. His dam was Sportsmistress, whose dam Golden Locks was inbred 2 × 2 to  Crab – he was both her maternal and paternal grandsire. Sportsmistress would produce a total of 11 foals including Sir Thomas,  [5] winner of the 1788 Derby.\n  Pot-8-Os is inbred 4 × 4 to the Godolphin Arabian and Crab, meaning these stallions both appears twice in the fourth generation of Potoooooooo&#39;s pedigree.\n  ^     a     b     c     d     e  Ahnert, Rainer L. (editor in chief),  Thoroughbred Breeding of the World, Pozdun Publishing, Germany, 1970\n  ^     a     b    Byles, Tony (14 January 2015).   101 Interesting Facts on the History of Horse Racing (Kindle ed.). Apex Publishing.  ISBN   9781910295328.\n  ^     a     b      The General stud book (First American from the Second London ed.). Weatherbys. 1834. p. 267 .\n  ^     a     b     c     d     e    Whyte, James Christie (1840).  History of the British turf, from the earliest period to the present day, Volume I.  London: H. Colburn. pp. 567–569.  OL  6544990M.", "posttime": "2021-07-29 21:44:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "呜呜,potoooooooo,拼写", "title": "呜呜呜呜", "title_en": "Potoooooooo", "transed": 1, "url": "https://en.wikipedia.org/wiki/Potoooooooo", "via": "", "real_tags": ["呜呜", "拼写"]}, {"category": "", "categoryclass": "", "imagename": "9f4607ab57abfa3ee304a8c6ece30581.jpg", "infoid": 1070229, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "IBM PC 催生了基本架构，后来发展成为我们今天所知的占主导地位的 Wintel 平台。它曾经是一种笨重、笨重且耗电的机器，现在您可以使用廉价的商品微控制器在单板上进行仿真。这要归功于 [Fabrizio Di Vittorio] 的工作，他在 Youtube 上分享了操作方法。完整的播放列表非常值得一看，展示了在平台上运行的大量老式 PC 应用程序和游戏。有 QBASIC、FreeDOS、Windows 3.0，当然还有飞行模拟器。后一款游戏在 1980 年代实际上被认为是 PC 兼容性的事实上的标准，因此 ESP32 可以使用 [Fabrizio 的] 代码运行它的事实表明他做得很好。它非常完整，ESP32 可以处理从音频和视频到声音输出以及键盘和鼠标输入的所有内容。这证明了现代微控制器的能力，这在 2021 年是一个如此简单的壮举。我们之前也见过 ESP32 模拟 8 位游戏系统。如果你记得 [Fabrizio 的] 名字，它可能来自他出色的 FabGL 库。休息后的视频。", "note_en": "The IBM PC spawned the basic architecture that grew into the dominant Wintel platform we know today. Once heavy, cumbersome and power thirsty, it’s a machine that you can now emulate on a single board with a cheap commodity microcontroller. That’s thanks to work from [Fabrizio Di Vittorio],  who has shared a how-to on Youtube.\n The full playlist is quite something to watch, showing off a huge number of old-school PC applications and games running on the platform. There’s QBASIC, FreeDOS, Windows 3.0, and yes, of course, Flight Simulator. The latter game was actually considered somewhat of a de facto standard for PC compatibility in the 1980s, so the fact that the ESP32 can run it with [Fabrizio’s] code suggests he’s done well.\n It’s amazingly complete, with the ESP32 handling everything from audio and video to sound output and keyboard and mouse inputs. It’s a testament to the capability of modern microcontrollers that this is such a simple feat in 2021.\n We’ve seen the ESP32 emulate 8-bit gaming systems before, too. If you remember [Fabrizio’s] name, it’s probably from  his excellent FabGL library. Videos after the break.", "posttime": "2021-07-29 21:44:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ibm,pc", "title": "在 ESP32 上模拟 IBM PC", "title_en": "Emulating the IBM PC on an ESP32", "transed": 1, "url": "https://hackaday.com/2021/07/28/emulating-the-ibm-pc-on-an-esp32/", "via": "", "real_tags": ["ibm", "pc"]}, {"category": "", "categoryclass": "", "imagename": "cd8cf6bae34896db358b59c99ec2e5c4.jpg", "infoid": 1070228, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "被描述为世界上最强大的潮汐涡轮机设备已连接到奥克尼的电网。 Orbital Marine Power 的 O2 潮汐涡轮机锚定在 Warness 的秋天，海底电缆将 2 兆瓦的海上装置连接到当地的陆上电网。正值行业领袖呼吁政府支持潮汐行业商业化发展之际。", "note_en": "What&#39;s being described as the most powerful tidal turbine device in the world  has connected to the grid in Orkney.\n Orbital Marine Power&#39;s O2 tidal turbine is anchored in the Fall of Warness where a subsea cable connects the two-megawatt offshore unit to the local onshore electricity network.\n It comes as industry leaders call for government support to help the tidal industry develop commercially.", "posttime": "2021-07-29 21:44:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "潮汐,turbine,行业", "title": "奥克尼的潮汐涡轮机开始发电", "title_en": "Tidal turbine in Orkney starts generating power", "transed": 1, "url": "https://www.bbc.com/news/av/uk-scotland-57991442", "via": "", "real_tags": ["潮汐", "turbine", "行业"]}, {"category": "", "categoryclass": "", "imagename": "c67abd27701aca752cb76f7cb6f4855b.jpg", "infoid": 1070227, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在他的自传 Timebends 中，阿瑟·米勒 (Arthur Miller) 回忆了一个随时间流逝的职业——那个冰人，他穿着“皮背心，右肩上挂着一块湿麻布，一旦他们把冰块滑进盒子里，他们总是脱下被解雇的衣服，站在那里，滴着水，等待他们的钱。”从 19 世纪末到 20 世纪中叶，在家用电冰箱变得司空见惯之前，冰男（和战时的冰女）在城镇中随处可见，他每天都在那里为冰箱运送冰块。今天，我们只需要进入我们的冰箱来获取我们个人供应的自制冰块，但根据您一个世纪前居住的地方，您的冰可能已经穿越海洋和大陆，在不融化的情况下存活一百多天，只是为了冷却在炎热的夏天喝你的饮料。冰块贸易在 19 世纪彻底改变了肉类、蔬菜和水果行业，促进了渔业的显着增长，并鼓励了一系列新饮料和食品的引入。在贸易高峰期，冰块碰巧曾经是美国仅次于棉花的最大出口产品。将弗雷德里克·都铎（Frederic Tudor）视为冰品贸易的亨利·福特或洛克菲勒。他被称为“冰王”，成为世界上最富有的人之一，基本上垄断了马萨诸塞州冰冷的池塘。在他出现之前，只有富裕的精英才能买得起冰这种奢侈品，这些冰是从他们自己的庄园收获的，储存在私人冰库中，通常建在他们的花园地下。都铎第一次在加勒比地区碰碰运气，希望将他家池塘里的冰块卖给欧洲殖民精英的富裕成员。当他的第一批货物启航前往马提尼克岛时，他只有 23 岁，但由于到达时缺乏存储设施，他的库存迅速融化，因此失去了大部分销售额。在早期的贸易中，熔化绝对是一个问题。在 1820 年代和 1830 年代，由于运输途中的浪费，最终收获的冰块中只有 10% 出售给了最终用户。在他第一批运往澳大利亚悉尼的 400 吨货物中——从新英格兰出发的 114 天旅程——有 150 吨在途中融化。但是，如果您曾经在酷热的天气里努力防止冰块在野餐冷却器中融化，那么您一定想知道，当时它是如何工作的？所以让我们分解它。冰是从池塘和湖泊中收获的，最珍贵的是坚硬、清澈的水晶冰，通常在餐桌上食用；而更多孔的白色冰主要用于工业。它需要至少 18 英寸厚才能收获，块的大小因目的地而异，最大的用于最远的地方，最小的用于国内分销。在通过轮船、火车或驳船运往世界各地的城市之前，这些冰块被储存在冰库中。航运是冰块贸易最常见的运输方式，为了防止冰块融化，人们会快速装载冰块，但平均装载货物可能需要两天时间。通常情况下，冰块用木屑紧紧包裹，船舱密封以防止暖空气进入。 19 世纪，为冰层隔热所需的大量锯末也帮助了新英格兰的木材工业。锯末可以防止冰焊接在一起，捕获热空气并将其冷却到相同的温度以防止融化。谁知道刨花会成为野餐必备品？ （别客气）。在 Tudor 向马提尼克岛和后来的古巴发货的早期试验和错误运输中，冰块几乎没有价值。它通常被视为一种免费商品，或者至少，只是富人会轻而易举地支付的东西。但 Frederic Tudor 实际上寄希望于它，他几乎发明了在饮料中加入冰块的概念，而不仅仅是将冰块用于食品保存，从而花费了大量精力为他的产品创造更多需求。冰饮料非常新颖，最初受到顾客的关注，他们担心健康风险。他指示他的销售代理向西印度群岛和美国南部各州的社交俱乐部和酒店的调酒师提供一年的免费冰块。当商界嘲笑他是一个愚蠢的怪人时，都铎正忙着亲自教调酒师储存冰块和制作鸡尾酒。 “一个以同样的价格喝了一个星期的冷饮料的人永远不会再得到温暖的饮料，”他预测道。很快，只能用碎冰制成的雪利酒馅饼和薄荷酒等饮料被创造出来，到 19 世纪中叶，如果可能的话，美国总是将水冷却。纽约的需求随着经济的快速增长和漫长炎热的夏季而增长，一波意大利南部移民开始经营这座城市的冰路。欧洲市场更难进入，并且不像北美那样采用冷冻饮料，但在丹麦，弗雷德里克确实设法向蒂沃利花园的管理员展示了如何使用他的产品制作冰淇淋。没错，我们也可以感谢弗雷德里克大规模生产冰淇淋，这也是冰贸易的结果。\n在 19 世纪末达到顶峰时，美国的冰块贸易估计雇用了 90,000 人。此时，挪威已成为主要竞争对手，每年出口 100 万吨（9.1 亿公斤）冰。在加利福尼亚淘金热期间，开始从当时由俄罗斯控制的阿拉斯加订购冰块以满足需求。一旦都铎一手启动了冰贸易，突然间，切割冰的权利变得非常重要，拥有湖泊、池塘和河流的权利有可能引发严重的争端。当谈到冰的可用性时，它并不总是一帆风顺。温暖的冬天可能会削弱冰的收获，这被称为“冰饥荒”。一个冬天，都铎非常绝望，据说他派他的船长砍掉了冰山的一部分。与此同时，冰贸易甚至在开始之前就已经结束。早在 1748 年就已经知道可以使用机械设备人工冷却水。诚然，早期的技术并不可靠。早期的冰厂经常面临爆炸的风险，基于氨的方法可能会在冰中留下有害的氨，而且在 19 世纪的大部分时间里，人造冰不如天然冰清澈，也不适合人类消费。但随着工业化，天然池塘和河流的污染也成为天然冰贸易的严重问题。到 1914 年，美国每年生产 2600 万吨植物冰，而自然收获的冰则为 2400 万吨。制冷冷却系统改变一切只是时间问题，而在两次世界大战之间，世界各地的冰贸易完全崩溃。廉价电动机的引入导致了家用现代冰箱的出现，使人们可以在家中制冰。 19 世纪工业网络的遗迹很少；收成缩水，冰库被废弃或改作他用，冰人从城市街道上消失了。冰运送的职业在一些阿米什社区继续存在，这些社区通常用卡车运送冰，用于冷却食物和其他易腐烂的物品。当然，Frederick Tudor 早在大众市场可以负担得起冷藏之前就已经死了，但是下次您在今年夏天用冰镇饮料提神时，请为给世界带来冰块的顽固而古怪的商人干杯。并在您工作时为冰男和女冰失去的职业倒出一份。", "note_en": "In his autobiography  Timebends, Arthur Miller recalls an occupation lost in time – that of the ice man, who wore “leather vests and a wet piece of sackcloth slung over the right shoulder, and once they had slid the ice into the box, they invariably slipped the sacking off and stood there waiting, dripping, for their money.” From the late 19th century to mid-20th century, the ice man (and ice woman during wartime) was a common sight in cities and towns where he would make daily rounds delivering ice for iceboxes before the electric domestic refrigerator became commonplace. Today we need only reach into our refrigerator for our personal supply of homemade ice cubes, but depending on where you lived a century or so ago, your ice might have travelled across oceans and continents, surviving over a hundred days without melting, just to chill your drink on a hot summer’s day. The ice trade revolutionised the meat, vegetable and fruit industries in the 19th century, enabled significant growth in the fishing industry, and encouraged the introduction of a range of new drinks and foods. At the height of its trade, ice, as it happens, was once America’s largest export after cotton.\n   Think of Frederic Tudor as the Henry Ford or the Rockefeller of the ice trade. He became known as “The Ice King” and became one of the wealthiest people in the world, essentially running a monopoly from the icy ponds of Massachusetts. Before he came along, only the wealthy elite could afford such a luxury as ice, harvested from their own estates and stored in personal ice houses, usually built underground in their gardens. Tudor first tried his luck in the Caribbean, hoping to sell ice cut from his family pond to wealthy members of the European colonial elite.\n  He was just 23 years old when his first shipment set sail for the island of Martinique, but lost most of his sales when his stocks quickly melted due to lack of storage facilities on arrival. Melting was definitely a problem in those early years of the trade. In the 1820s and 1830s, only 10 percent of ice harvested was eventually sold to the end user due to wastage en route. Of his first 400-ton shipment to Sydney Australia – a 114 day journey from New England – 150 tons of it melted en route. But if you’ve ever struggled to keep your ice from melting away in your picnic cooler on a sweltering hot day, you must be wondering, how did it even work back then? So let’s break it down.\n  Ice was harvested from ponds and lakes, and most prized was hard, clear crystal ice, typically consumed at the table; while more porous, white-coloured ice was mostly used by industry. It needed to be at least 18 inches thick to be harvested and the size of blocks varied according to the destination, the largest being for the furthest locations, the smallest destined for domestic distribution. The blocks were stored in ice houses before being sent by ship, train or barge to cities around the world.\n   Shipping was the most common form of transport for the ice trade and blocks were loaded quickly to prevent the ice from melting, but an average cargo could take two days to load. Typically, the ice was packed up tightly with sawdust and the ship’s hold sealed up to prevent warm air from entering. The large quantities of sawdust required to insulate the ice also helped out the New England lumber industry in the 19th century. Sawdust keeps ice from welding together, traps warm air and cools it to the same temperature to prevent melting. Who knew wood shavings would be a picnic essential? (you’re welcome).\n During those early years of Tudor’s trial &amp; error shipments to Martinique and later Cuba, ice held little value. It was generally seen as a free good, or at least, only something the wealthy would be frivolous enough to pay for. But Frederic Tudor was in fact banking on it, and spent much of his energy creating more demand for his product by pretty much inventing the concept of putting ice in drinks instead of only using it for food preservation. Iced drinks were very much a novelty and initially viewed with concern by customers, who were worried about the health risks. He instructed his sales agents to give a year’s supply of free ice to bartenders at social clubs and hotels across the West Indies and the southern US states. While the business community mocked him as a foolish eccentric, Tudor was busy personally teaching bartenders to store ice and make cocktails.\n   “A man who has drank his drinks cold at the same expense for one week can never be presented with them warm again,” he predicted. Soon enough, drinks such as sherry cobblers and mint juleps that could only be made using crushed ice were created and by the mid-19th century, water was always chilled in America if possible. Demand grew in New York with its rapidly growing economy and long hot summers, and a wave of Southern Italian immigrants took to running the city’s ice routes. The European market was tougher to crack and didn’t adopt chilled drinks in the same way as North Americans, but in Denmark, Frederic did manage to show the keeper of Tivoli Gardens how to make ice cream using his product. That’s right, we can thank Frederic too for the large-scale production of ice cream, which also resulted from the ice trade.\n  At its peak at the end of the 19th century, the U.S. ice trade employed an estimated 90,000 people. By this time, Norway had become a major competitor, exporting a million tons (910 million kg) of ice a year. And during the California gold rush, ice began to be ordered from the then Russian-controlled Alaska to keep up with demand. Once Tudor had single handedly kickstarted the ice trade, suddenly, the right to cut ice became very important and claim to lakes, ponds and rivers had the potential to spark serious disputes. And when it came to the availability of ice, it wasn’t always smooth sailing. Warm winters could cripple an ice harvest, which became known as “ice famines”. Tudor was so desperate one winter, he allegedly sent his ship’s captain to hack off part of an iceberg.\n Meanwhile, the end of the ice trade was in sight before it even began. It had been known as early as 1748 that it was possible to artificially chill water using mechanical equipment. Granted, the early technology was unreliable; early ice plants were constantly at risk of exploding, the ammonia-based approaches potentially left hazardous ammonia in the ice and for most of the 19th century, artificial ice was not as clear as natural ice and less suitable for human consumption. But with industrialisation, the contamination of natural ponds and rivers also became a serious problem for the natural ice trade. By 1914, 26 million tons of plant ice was being produced in the U.S. each year compared to the 24 million tons of naturally harvested ice.\n It was only a matter of time before refrigeration cooling systems would change everything and the inter-war years saw the total collapse of the ice trade around the world. The introduction of cheap electric motors resulted in domestic, modern refrigerators allowing ice to be made in the home. Little remains of the 19th-century industrial network; the harvests shrunk to insignificance, ice warehouses were abandoned or converted for other uses and the ice man disappeared from the city streets. The occupation of ice delivery lives on through some Amish communities, where ice is commonly delivered by truck and used to cool food and other perishables.\n  Of course, Frederick Tudor was dead long before refrigeration became affordable to a mass market, but the next time you’re refreshing yourself with an iced drink this summer, make a toast to the stubborn and eccentric merchant who brought ice to the world. And pour one out for the lost profession of the ice men and women while you’re at it.", "posttime": "2021-07-29 21:43:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冰人,ice,冰块", "title": "冰人颂", "title_en": "Ode to the Ice Man", "transed": 1, "url": "https://www.messynessychic.com/2021/07/23/ode-to-the-ice-man/", "via": "", "real_tags": ["冰人", "ice", "冰块"]}, {"category": "", "categoryclass": "", "imagename": "9ff1008f08393c1aae0798744ced74e6.jpg", "infoid": 1070226, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它到达了大流行的高峰期，装在一个棕色信封里，没有回信地址，邮票太多，邮局都没有标记。它是在我父母在纽约市的公寓里写给我的，我已经十多年没有住在那里了。我妈妈用这个信封当了几个星期的记事本，然后在 7 月把它交给了我；这是我隔离数月后第一次见到她。信封里面是一本装订好的小册子——真的是一本小册子——由一位名叫斯托克斯·普里克特 (Stokes Prickett) 的作家题为“美食家或密西西比的资本主义季风”。封面上有一张墨西哥卷饼卡车的照片和一条写着“提前宣传文案：请勿阅读”的告示。这本书以谢伯特·泰勒教授的 Cide Hamete Benengeli 风格的介绍开头。然后是五十五页的成长小说，用粗体标题写成简短的部分。这篇散文让我想起了理查德·布劳提根。因为我写书评，每个月都会有几十本不请自来的书送到我家。我承认，他们中的许多人在被添加到地板上的一堆之前几乎没有引起我的注意。但我坐下来，把这本书通读了一遍。 “美食家”的叙述者是 Rusty，他回想起自己在高中的日子，当时他是图钉制造商的学徒，然后是一家地垫工厂。 Rusty 在学校遇到了另一个孩子，一个名叫美食家的理想主义者，他的真名是 Gourmand，Rusty 将他描述为“系绳冠军，炸玉米饼之王”，在一个“8 轨道郊区边缘”的小镇。拉斯蒂说，美食家“是战争前线最善良的狼人，而我是他的理发师。”他们开始与一个身材魁梧、冷酷无情的同学戴尔在一起，他“右撇子，像羊皮纸一样不道德”，注定会英年早逝，因为他有一份白领工作，这使他比朋友更快地度过了时光做。戴尔死后，美食家和拉斯蒂分道扬镳。这本书很好。但是斯托克斯·普里克特是谁，这个人是如何得到我父母的地址的？起初，我怀疑一个喜欢恶作剧的朋友或一个知道我容易掉入兔子洞的敌人。我在 Twitter 上发布了有关“Foodie”的详细信息，希望能提供一些信息。有几个人告诉我，他们也收到了——他们大多是作家、编辑和评论家——但没有人知道发生了什么。作家瑞恩·里奇指出，普里克特似乎是他编辑的杂志 Juked 的粉丝。几位 Juked 撰稿人收到了这本书。我给拍摄墨西哥卷饼卡车照片的人发了电子邮件，这张照片属于公共领域。 “我很想告诉你，”摄影师回答说，“但我不知道你在说什么:)”在《美食家》的介绍中，谢尔伯特·泰勒写道，“我更愿意劝阻他那些痴迷的传记作者，并接受他的身份最好不要被寻求。”也许教授是对的。几周后，“美食家，第二部分”再次来到我父母的公寓，邮票更多，邮局没有标记。它比第 1 部分更长，并以加拿大霹雳舞比赛为特色。戴尔作为鬼魂回来了； Rusty 有一个爱人，名叫 Fontanelle。 （“她像着火的艺术品一样闷烧，”Rusty 说，“但她的男朋友有码头的魅力。”）我还找到了 Sherbert Taylor 的 Twitter 帐户，该帐户发布了指向 SoundCloud 帐户的链接，其中记录了某人阅读“美食家。”我关注了关注该 Twitter 帐户的每个人以及所有报告收到“美食家”的人。当有人给我发了一条线索时，我跟随了那个人跟随的每个人。我寻找相互联系的人，并草拟了一份嫌疑人名单。时间很长。我把我的名单发给了所有感兴趣的人。他们中的一些人对 Prickett 使用不易获得的邮寄地址感到不安。我认为 Prickett 使用的是在线数据库；只需几美元，您就可以找到数量惊人的私人信息。多年来，我一直从父母的地址报税。八月，我搬到那里帮助我的父母在大流行期间。在此期间，我的生活是循环往复的：Zoom 上的相同面孔，每天相同的蒙面步行，相同的警笛声。我发现阅读很难，写作是不可能的。 “美食家”为在线生活提供了完美的追求。每次我考虑退出时，都会有新的提示出现，我钦佩的新作家会ping我的收件箱。普里克特帮助我度过了难关。但普里克特到底在追求什么？匿名邮件是一种传播病毒的策略吗？我在帮忙吗？有时，当有人称赞我在 Twitter 上分享的书中的一段话时，该人随后会在邮件中收到一份副本。我了解到一些相当不起眼的费城音乐家也获得了“美食家”奖，并决定将我的调查重点放在区域上。其中一位音乐家 Ricky Lorenzo 曾是一支名为 YJY 的乐队的歌手和吉他手，现已解散，他将自己描述为“幽灵”，并向我发送了一部他制作的食人喜剧电影。我仔细看了看，怀疑他是普里克特，但我最终得出结论，他只是发现了一个机会来宣传他的食人喜剧。作家乔·塞缪尔·斯塔恩斯 (Joe Samuel Starnes) 给我发了一封电子邮件，假设 Prickett 是一个名叫“Walter T. Hazelgood”的人，他多年前曾旁听过他的一堂课，但后来走了出去，揉皱了一份关于 Freytag 金字塔的讲义——结构分析的一些灰尘由一位德国剧作家在 19 世纪制定，偶尔在介绍性创意写作课程中教授——永远不会回来。我找不到一个名叫 Walter T. Hazelgood 的在世作家，并注意到这位假定的作者将他的姓名首字母缩写为“到底是什么”。我很长时间怀疑 Starnes 就是 Prickett。 （我错了。）\n由 Sherbert Taylor 主持并打印在几张松散纸上的对 Prickett 的采访传到了我父母的公寓。泰勒形容自己是一个“孤独的文学学者，衰老并失去了他的英俊”，他是“六个月前在对我的露台喷砂时接受采访的这个马特宏峰”。我似乎是唯一收到这份文件的人；读起来有点像被嘲讽。秋天，一些人收到了“美食家，第 3 部分”和“美食家，第 4 部分”，其中美食家创办了一家名为“Responsible Tony&#39;s”的餐厅，而 Rusty 继续追求 Fontanelle。我没有收到任何一期。我做错了什么吗？使用这些收件人信封的照片，我终于能够通过取消邮票来追踪邮件。在大流行的早期，也许是因为预算削减，邮政服务没有标记任何“美食家”邮件。现在，包裹上印有与新泽西州邮局相关联的数字代码。我最初的嫌疑人之一是一位名叫埃里克·巴德 (Erik Bader) 的作家，在“美食家”传奇之前，他曾给我寄过一本他的书，并附在一封电子邮件中，邮件开头写道：“我会缩短这个时间，让您感觉像我”浪费了你的时间。”他在推特上给我发了一张新泽西州一座桥上牌匾的照片，他说他每周要穿过几次。牌匾上列出了桥牌委员会，上面的第二个名字是斯托克斯·普里克特。 （巴德告诉我，他从邮件中收到了一份“美食家”的副本。）我离得越来越近了。 《美食家 5》于 1 月份邮寄到我父母的公寓。戴尔被鬼魂绑架，负责任的托尼被烧毁。我将我的嫌疑人名单发送给了数十个新收件人。作家里昂·阿米尔卡·斯科特 (Rion Amilcar Scott) 在一年前收到了第一个“美食家”，但直到最近才打开它，他在 Twitter 上给我发消息说他和我的一个嫌疑人谈过费城音乐界的事。嫌疑人与相关邮局住在同一地区，之前曾被一个神秘的推特账户命名为可能的普里克特，但没有回应我随后的问题。我当时给嫌疑人发了电子邮件，他否认知道整件事，但这似乎是一个突破。我再次写信给他，暗示我知道他是普里克特。几个小时后，他同意谈话。他要求我不要公布他的真名，但说我可以概括地描述他的职业生涯，并且他会与事实核查员确认所有细节。笔名斯托克斯·普里克特 (Stokes Prickett) 的作者已在多家出版社出版了多本书。 （“我不擅长与人合作，”他告诉我。）这些出版商包括小型独立出版社和一家五巨头；这些书包括小说和非小说。 “在我做过的所有不同类型的出版中，”Prickett 在一封电子邮件中写道，“我最欣赏和享受学术期刊的双盲同行评审过程，这是世界上最接近的发布到通过邮件将你的狗屎发送给陌生人。”普里克特告诉我，“几年前我写了第一部分的第一段和最后一段，但我没有回去对它们做任何更多的事情。”然后，在完成另一本书后，普里克特第一次“从写作中休息了很长时间。我一年没有写一个字，”他告诉我。 “我不确定我是否还想再写下去。但那两段让我心服口服。我会梦见他们。现在我醒来很兴奋能在 Foodie 上工作。”为什么不发表呢？为什么将其发送给看似随机且相对较小的一组收件人？ （普里克特已经给五六百人寄了一份。）“写作最糟糕的事情，”他告诉我，“是你花了多长时间做某事，然后才能向人们展示。这是一种非常孤独的工作方式。你花了三四年的时间写一本书，然后需要几个月的时间才能找到代理，几个月的时间才能找到出版商，然后又需要一年或更长时间才能出版这本书。 . .文学产业就是没有多少乐趣。”最后，我问：为什么要发给我？ “这就像你喂了一只流浪猫，却在门廊上留下一只死鸟，”普里克特回答说。 “我把它作为礼物送给了你。我将美食家邮寄给我敬佩的作家和一些音乐家。我想是一位电影导演。少数点燃的教授和奇怪的阿尔扬科维奇。如果你有，那是因为我喜欢你写的东西。它可以是从评论到推文的任何内容。就你而言，我喜欢你的短篇小说，”他说。 “很抱歉，但我将不得不继续把你的寄给你妈妈。这不是一个完美的系统，但它是我们拥有的系统。”\n“美食家六号”包括一部大胆的中篇小说，以戴尔在牛仔阴间的不幸遭遇为中心，现已上映。普里克特告诉我，第七和第八批即将推出。如果您公开索要一份副本，则有可能有人会在您自己的未标记信封中到达某个地方的门口。我通过询问 Prickett 被发现是什么感觉来结束我的采访。 “即使是我的一些非常亲密的朋友也没有弄清楚，”他回答道。 “我花了整整一年的时间希望没有人会这样做，但这意味着您做出了足够的反应，全力以赴追查作者。一个作家还能要求什么，而不是一个读者给陌生人发电子邮件，询问是否有人知道斯托克斯·普里克特到底是谁？”注册我们的每日时事通讯，接收来自《纽约客》的最佳故事。", "note_en": "It arrived at the height of the  pandemic, in a brown envelope with no return address and too many stamps, none of which had been marked by the post office. It was addressed to me at my parents’ New York City apartment, where I haven’t lived in more than a decade. My mother used the envelope as a notepad for a few weeks, then handed it off to me in July; it was the first time I’d seen her after months of quarantine. Inside the envelope was a small, stapled book—a pamphlet, really—titled “Foodie or The Capitalist Monsoon that is Mississippi,” by a writer named Stokes Prickett. On the cover, there was a photograph of a burrito truck and a notice that read “Advance Promotional Copy: Do Not Read.” The book began with a  Cide Hamete Benengeli-style introduction attributed to a Professor Sherbert Taylor. Then a fifty-five-page bildungsroman written in short sections with boldface titles. The prose reminded me a bit of  Richard Brautigan.\n Because I write book reviews, dozens of unsolicited books are sent to my house every month. Many of them, I confess, barely catch my attention before they’re added to a stack on the floor. But I sat down and read this one all the way through. The narrator of “Foodie” is Rusty, who thinks back on his days in high school, when he worked as a thumbtack-maker’s apprentice, then in a floor-mat factory. Rusty meets another kid from school, an idealist called Foodie whose real name is Gourmand, and whom Rusty describes as “a tetherball champ, a king of the taco stands,” in a town “at the edge of the 8-track suburbs.” Foodie, Rusty says, “was the kindest werewolf on the warfront, and I was his hairdresser.” They start spending time with a hulking, ruthless classmate named Dale, who is “right-handed and immoral as parchment,” and fated to die young because he has a white-collar job that causes him to move through time more quickly than his friends do. After Dale’s death, Foodie and Rusty part ways.\n The book was good. But who was Stokes Prickett, and how did this person get my parents’ address? Initially, I suspected a friend who was fond of pranks or an enemy who knew that I was prone to go down rabbit holes. I  posted details about “Foodie” on Twitter, hoping to drum up some information. A few people told me that they had also received it—they were mostly writers, editors, and critics—but no one had a clue about what was going on. The writer Ryan Ridge pointed out that Prickett seemed to be a fan of the magazine that he edits,   Juked. Several  Juked contributors had received the book. I e-mailed the person who took the picture of the burrito truck, which is in the public domain. “I’d love to tell you about it,” the photographer replied, “but I have no idea what you’re talking about :).” In the introduction to “Foodie,” Sherbert Taylor writes, “I prefer to dissuade his obsessive biographers and accept that his identity is best unsought.” Perhaps the professor was right.\n A couple weeks later, “Foodie, Part Two” arrived, again at my parents’ apartment, with even more stamps, none marked by the post office. It was longer than Part 1, and featured a Canadian break-dancing competition. Dale returned as a ghost; Rusty had a love interest named Fontanelle. (“She smoldered like art on fire,” Rusty says, “but her boyfriend had the charisma of a wharf.”) I also found a Sherbert Taylor  Twitter account, which had posted links to a SoundCloud account with  recordings of someone reading snippets of “Foodie.” I followed everyone who followed that Twitter account and everyone who had reported receiving “Foodie.” When someone sent me a lead, I followed everyone that person followed. I looked for mutual contacts, and drew up a list of suspects. It was quite long. I sent my list to all the interested parties. A number of them were disturbed by Prickett’s use of mailing addresses that weren’t readily available. I figured that Prickett was using an online database; for a few dollars, you can find out a shocking amount of private information. I’d filed taxes from my parents’ address for years.\n In August, I relocated there to help my parents during the pandemic. My life during this period was recursive: the same faces on Zoom, the same masked walk each day, the same sirens rushing by. I found reading hard and writing impossible. “Foodie” provided the perfect quest for a life being led online. Every time I considered quitting, a new hint would arrive, a new writer I admired would ping my in-box. Prickett helped get me through.\n But what was Prickett after, exactly? Were the anonymous mailings a ploy to go viral? Was I helping? Sometimes, when someone praised a passage from the book that I’d shared on Twitter, that person would subsequently receive a copy in the mail. I learned that a handful of fairly obscure Philadelphia musicians had also received “Foodie,” and decided to give my investigation a regional focus. One of these musicians, Ricky Lorenzo, formerly a singer and guitarist for a band called YJY, now defunct, described himself as a “ghost,” and sent me a cannibal-comedy movie that he’d made. I watched it carefully, suspecting that he was Prickett, but I ultimately concluded that he had simply spotted an opportunity to promote his cannibal comedy.\n  The writer Joe Samuel Starnes e-mailed me a hypothesis that Prickett was someone named “Walter T. Hazelgood,” who had audited a class of his years ago but had walked out, crumpling a handout on Freytag’s Pyramid—a dusty bit of structural analysis formulated by a German playwright in the nineteenth century and occasionally taught in introductory creative-writing classes—never to return. I could find no living writer named Walter T. Hazelgood, and noted that this supposed author shared his initials with the phrase “what the hell.” I suspected for a long time that Starnes was Prickett. (I was wrong.)\n  An interview of Prickett, conducted by Sherbert Taylor and printed on several loose sheets of paper, arrived at my parents’ apartment. Taylor described himself as a “lonely literary scholar, aging and losing his handsomeness,” who had landed “this Matterhorn of an interview six months ago while sandblasting my patio.” I seem to be the only person who received this document; reading it felt a bit like being taunted. In the fall, some people received “Foodie, Part 3” and “Foodie, Part 4,” in which Foodie founds a restaurant called Responsible Tony’s and Rusty continues to pursue Fontanelle. I did not receive either installment. Had I done something wrong?\n  Using photos of these recipients’ envelopes, I was finally able to trace the mailings through stamp cancellation. Earlier in the pandemic, perhaps because of budget cuts, the Postal Service hadn’t marked any of the “Foodie” mailings. Now the packages were stamped with a numeric code that linked to a post office in New Jersey. One of my initial suspects was a writer named Erik Bader, who, prior to the “Foodie” saga, had sent me a book of his attached to an e-mail that began “I’ll make this short so you feel like I’ve wasted your time.” He  tweeted me a photo of a plaque on a bridge in New Jersey that he said he crosses several times a week. The plaque lists the bridge committee, and the second name on it is Stokes Prickett. (Bader told me that he has since received a copy of “Foodie” in the mail.) I was getting closer.\n “Foodie 5” was mailed to my parents’ apartment in January. Dale is abducted by ghosts, and Responsible Tony’s burns down. I sent my list of suspects to dozens of new recipients. The writer  Rion Amilcar Scott, who had received the first “Foodie” a year ago but had not opened it until recently, messaged me on Twitter to say that he had spoken with one of my suspects about the Philadelphia music scene. The suspect lived in the same region as the post office in question, and had previously been named as a possible Prickett by a mysterious Twitter account that didn’t respond to my subsequent questions. I had e-mailed the suspect at the time, and he had denied knowledge of the whole thing, but this seemed like a breakthrough. I wrote to him again, suggesting that I knew he was Prickett. Hours later, he agreed to talk. He asked that I not publish his real name, but said that I could describe his career in general terms, and that he would confirm all the details with a fact-checker.\n The author with the pseudonym Stokes Prickett has published several books with several publishers. (“I’m not great at working with people,” he told me.) Those publishers include tiny independent presses and one Big Five imprint; the books include both fiction and nonfiction. “Out of all the different kinds of publishing I’ve done,” Prickett wrote, in an e-mail, “I’ve most appreciated and enjoyed academic journals with their double-blind peer-review process, which comes closest in the world of publishing to sending your shit out to strangers in the mail.”\n Prickett told me, “I wrote the first and last paragraphs of Part One a few years ago but I hadn’t gone back to do anything more with them.” Then, after finishing another book, Prickett, for the first time, took a “long break from writing. I didn’t write a single word for a year,” he told me. “I wasn’t sure if I wanted to write any more. But those two paragraphs won me over. I would dream about them. Now I wake up excited to work on  Foodie.”\n Why not get it published? Why send it to a seemingly random and relatively small group of recipients? (Prickett has sent copies to five or six hundred people.) “The worst thing about writing,” he told me, “is how long you spend working on something before you get to show it to people. It’s a very lonely way to work. You spend three or four years on a book and then it takes months to find an agent, months for the agent to find a publisher, and then it’s another year or more before the book comes out . . . The literary industry is just not much fun.”\n  At last, I asked: Why send it to me? “It’s like when you feed a stray cat and it leaves you a dead bird on your porch,” Prickett replied. “I sent it to you as a gift. I mailed  Foodies to writers I admire and a few musicians. One film director, I think. A handful of lit professors and Weird Al Yankovic. If you got one, it’s because I liked something you wrote. It could be anything from a critical tome to a tweet. In your case, I liked a short story of yours,” he said. “And sorry, but I’m going to have to keep sending yours to your mom. It isn’t a perfect system but it’s the one we have.”\n “Foodie Six,” which includes a bold interpolated novella centered on Dale’s misadventures in the cowboy netherworld, is out now. Prickett informed me that the seventh and eighth installments will be on the way soon. If you ask for a copy publicly, it’s possible that one will arrive on a doorstep somewhere, in an unmarked envelope of your very own.\n I closed my interview by asking Prickett what it was like to be found. “Even some very close friends of mine haven’t figured it out,” he replied. “I spent a whole year hoping no one would, but it means a lot that you responded enough to put in all this effort to track down the author. What more could a writer ask for than a reader emailing strangers to ask if anyone knows who the hell is Stokes Prickett?”\n    Sign up for our daily  newsletter to receive the best stories from  The New Yorker.", "posttime": "2021-07-29 21:43:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "作者,mysterious,美食家", "title": "一位神秘的化名作者的踪迹", "title_en": "On the Trail of a Mysterious, Pseudonymous Author", "transed": 1, "url": "https://www.newyorker.com/books/page-turner/on-the-trail-of-a-mysterious-pseudonymous-author", "via": "", "real_tags": ["作者", "美食家"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070225, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“所以下次你看到航天飞机发射时，你可以告诉你的朋友哪台个人电脑被评为美国太空计划中的关键任务用途。” Amiga 所有者知道他们的机器可以用很少的方法做很多事情。由于其灵活且集成的视频友好型硬件以及紧凑、高效的多任务操作系统，Amigas 可用于驱动诸如体育场记分牌、交互式信息亭、农业灌溉系统和亚特兰大哈茨菲尔德国际机场的航班时刻表显示等设备。之所以选择 Amiga 用于这些应用，是因为其可靠的硬件和低开销的软件对于那些关键工作来说毫无意义的停机时间。但是，大多数 Amiga 所有者会惊讶地发现，他们的机器在执行世界上或世界上最艰巨的工作之一方面的可靠性有多大。十几年来，Amiga 计算机一直在卡纳维拉尔角的 Hanger AE 努力工作，支持包括航天飞机在内的所有美国航天器的发射。毕竟，这是火箭科学，NASA 必须从每个航天器下行传输大量数据；在地面测试期间，通过倒计时和升空进入太空。在获取和处理这些数据时不允许出现错误。它必须被准确计算并从机库可靠地发送到世界各地参与任务的遥远太空中心。一切都是实时的，不会中断。由于 Hanger AE 还支持一些来自航天飞机的遥测，因此这一重要性甚至更高，因为人类的生命危在旦夕。在太空海岸 Amiga 成员 Hal Greenlee 和退役空军中校 JohnnyJohnson 的努力下，Amiga Atlanta 在航天飞机奋进号飞往俄罗斯 MIR 空间站期间获得了 Hanger AE 的独家电视之旅。美国宇航局卡纳维拉尔角软件系统首席系统工程师加里·琼斯告诉我们，Amigas 从航天器获取所有遥测数据，通过应用高达五阶多项式的系数对其进行缩放，并将数据转换回工程单位，以显示给工作的工程师发射，市场投入。 Gary 继续告诉我们，他们的首选是 Macintosh，但由于它是一个封闭系统，Apple 不会向 NASA 提供足够的信息以使其达到所需的水平。谈吹一个营销机会！他继续说道：“然后我们查看了 PC，但当时的硬件架构真的和现在一样糟糕。所以 Hal 是第一个推出 Amiga 1000 的人，我们也玩过它。”哈尔·格林利补充说； “我把它拿出来给戴夫·布朗看，不到一两个月后，戴夫有了自己的一个，我们都对斯基普说，“我们需要得到一些这些婴儿，然后找到如果我们能让他们为这份工作工作”。加里·琼斯回答说； “当时 Commodore 很容易使用。当我们要求提供文档时，他们向我们发送了一叠大约四英尺高的文档。他们愿意告诉我们有关他们机器的所有信息。因为我们必须设计一些定制硬件才能进入内部，了解一切如何运作真的很有帮助。” “结果证明它是一台好机器。使机器适合玩游戏的东西也往往使它适合处理和显示数据，因为你有一些同样的问题。你需要非常高效，非常快速的操作系统，而 Amiga 也有这个，而且开销也很小。这就是它的好处；我们不会降低运行开销的系统；我们可以只处理数据。” “我们的大部分定制都是硬件定制。Amiga 操作系统足够灵活，我们只需要偶尔进行组装以初始化我们使用的一些特殊板，但除此之外操作系统很好；我们什么都不做“它很不寻常。我们就这样使用它，并为我们的接口要求构建硬件，因为我们必须从这座建筑物的数据总线中取出数据，处理它，然后将数据放回去。”七个 Amigas 在线分配用于运营支持，六个专门用于将数据路由到远程空间中心，另外六个保留用于硬件和软件开发。 Amigas 支持的航天器包括所有的 Atlas-Centaurs、Delta II 和 Delta III、轨道科学飞马、洛克希德-马丁雅典娜和几个不同型号的泰坦。 GOES 和 GPS 航天器数据被处理，一些用户数据从航天飞机上下来。由于 Amiga 的布局方式以及软件全部捆绑在一起，如果比特率不太高，每台机器实际上一次可以支持多个航天器。多任务、多航天器的个人电脑！尽管 Amigas 在处理遥测方面发挥着重要作用，但它们的通用性足以与其他 NASA 计算机连接。波音航空航天公司的奥吉·弗里西亚告诉我们：“我想出了一种将 Amiga 上的文件传输到 Sun 的方法，将我在 Amiga 上的源文件转换为存档，然后将它们传输到 Sun 机器上。只需稍作调整即可程序的顶部和声明语句，我可以在 Sun 上编译和运行它。我在 Amiga 上完成了所有调试，然后将它带到了 Sun。”加里琼斯：“如果它不是个人电脑，当我们试图购买任何与 Amigas 一起使用的东西时，NASA 会给我们带来很多痛苦。他们希望我们购买个人电脑并运行 Windows 95 和 NT。我们一直试图告诉他们它并不快“够了，所以他们告诉我们购买 DEC Alphas。我们告诉他们它太贵了。他们不喜欢 Amiga；它的成本不够。”在我们 1998 年 1 月访问 Hanger AE 期间，奋进号航天飞机刚刚完成从俄罗斯和平号空间站取回大卫沃尔夫的任务。加里·琼斯：“这是从航天飞机上下来的数据——直到昨天与 MIR 对接的 STS-89 航班。这些是生命科学人员使用的一些环境参数。他们获取这些数据，我们用它来处理它Amiga，我们在另一个 Amiga 上将它远程给他们，然后它提取数据并将其发送到他们的 PC 控制一个环境室，这样他们就可以复制航天飞机上除了重力之外的环境条件。所以这是他们的控制组。他们可以有一群动物或昆虫在零重力的穿梭机上，在相同的环境条件下有相同的动物和正常的重力从这里的路上大约有五个衣架。而 Amiga 数据是他们用来控制它们的生长室以保持环境相同的。”在 NASA Amigas 中，内部构建并使用了自定义接口硬件。但是他们的 Amigas 和我们的 Amigas 之间最重要的区别在于外部。一个装甲电源按钮是由 23 针视频连接器制成的，因为工程师担心关键的开关在 Amiga 机箱的正面有点太暴露了！为了证明即使是普通的 Amigas 也有多大用处，我们发现虽然 4000 有 Workbench 3.1，但 2000s 仍在运行 2.1，因为新操作系统的优势并不是真正需要的。即使在遥测实验室看到 Amigas 努力工作之后，电视中心还是发现了另一个惊喜。 “我们有一个烤面包机系统。我们在发布时添加标题。我们可能会做一两个效果，只是为了让磁带看起来更有趣。但主要是烤面包机用来叠加时间、摄像机角度或某种文本数据。想添加到图片中。”三百个视频监视器由一个足以运行商业电视网络的路由系统供电。除了视频，它还可以在整个空间中心传输数据。 NASA Amigas 的未来计划包括支持另一种泰坦火箭模型。他们还在为名为 Delta III 的下一代 Delta 火箭编写软件。美国阿特拉斯-半人马火箭计划在船上安装俄罗斯发动机，这也需要新的 Amiga 遥测软件。加里的团队还将为由 Amiga 驱动的用户构建新的显示能力。 “我们将通过以太网系统向他们发送数据，他们将使用 PC 进行显示。”尽管不像其他微型计算机那样容易购买和支持，但 Gary 对 Gateway 购买 Amiga 平台仍持谨慎态度。 “我们从 Hal 那里得到了一些关于 Gateway 购买 Amiga 的反馈。如果我们开始看到他们正在运送一些硬件，我们就会感兴趣。但试图说服 NASA 他们想要使用其他东西是一场艰苦的战斗不是标准的、公认的平台之一。”因此，下次您看到航天飞机发射时，您可以告诉您的朋友哪台个人计算机被评为美国太空计划中的关键任务用途。注意：本文基于 Amiga Atlanta 访问 Hanger AE 期间拍摄的 10 分钟录像带。有关详细信息，请联系 Bob Castro ( bcastro AT mindspring POINT com)。还要特别感谢 Amiga Atlanta 成员 Mike Ellenberg，他从您在本文中看到的视频中抓取了静止帧。", "note_en": "&#34;So the next time you see a space shuttle launch, you can tell your friends which personal computeris rated for mission-critical use in the United States space program.&#34;   Amiga owners know their machines can do a lot with a little. Because of its flexible and integrated video-friendlyhardware as well as its tight, efficient multi-tasking operating system, Amigas can be found driving things such as stadiumscoreboards, interactive kiosks, agricultural irrigation systems and the flight schedule displaysat Atlanta&#39;s Hartsfield International Airport.  The Amiga was chosen for those applications because its reliable hardware and low-overhead software meansless down-time for those crucial jobs. But most Amiga owners would be suprised to learn just how much theirmachines&#39; reliability is trusted to carry out one of the toughest jobs in the world - or outside of it.  For more than a dozen years, Amiga computers have been hard at work at Cape Canaveral&#39;s Hanger AE supporting thelaunches of every American spacecraft including the space shuttle.  Since after all, this IS rocket science, NASA must downlink a tremendous amount of data from each spacecraft;during ground tests, through the countdown and lift-off and out into space. There is no room for error inthe acquisition and processing of this data. It must be accurately calculated and reliably sent from the hangerto distant space centers around the world participating in the mission. All in real time and without interruption.Since Hanger AE also supports some telemetry from the space shuttle, that importance is even greater since humanlives are on the line.   Thanks to the efforts of Space Coast Amiga member, Hal Greenlee and retired Air Force Lieutenant Colonel JohnnyJohnson, Amiga Atlanta was allowed an exclusive television tour of Hanger AE during the flight of the spaceshuttle Endeavour to the Russian MIR space station.  Gary Jones, principal systems engineer for NASA&#39;s software systems at Cape Canaveral told us the Amigas takein all the telemetry data from the spacecraft, scale it by applying coefficients of up to fifth order polynomialsand convert the data back to engineering units for display to the engineers working the launch.  Gary went on to tell us that their first choice was the Macintosh, but as it was a closed system, Apple wouldn&#39;tgive NASA enough information to get into it at the level that was needed. Talk about blowing a marketing opportunity!   He continued &#34;We then looked at the PC, but the hardware architecture was really as bad then as it is now. So Halwas the first one who brought out one of the Amiga 1000s and we played with it.&#34;  Hal Greenlee added; &#34;I brought it out and showed it to Dave Brown, and not more than about a month or two later,Dave had one of his own, and we were both saying to Skip, &#34;We need to get some of these babies, and find out if wecan make them work for this job&#34;.&#34;  Gary Jones replied; &#34;And Commodore was easy to work with back then. When we asked for documentation, they sent usa stack of documentation about four feet high. They were willing to tell us everything about their machine.Since we had to design some custom hardware to go inside, it really helped to know exactly how everything worked.&#34;  &#34;It just turned out that it was a good machine. The things that make a machine good for playing games also tend tomake it good for processing and displaying data, because you&#39;ve got some of the same problems. You need avery efficient, very fast operating system, and the Amiga has that and very little overhead too.That&#39;s what makes it nice; we don&#39;t load down the system running the overhead; we can just process the data.&#34;  &#34;Most of our customizing is hardware customizing. The Amiga operating system is flexible enough that we have to dropinto assembly only once in a while to initialize some of the special boards we use, but otherwise the operatingsystem is fine; we don&#39;t do anything unusual with it. We use it just like it is and build hardware for our interfacingrequirements because we have to pull the data out of the data bus in this building, process it, and put the data back in.&#34;  Seven Amigas are online assigned to operational support, six are dedicated to routing data to remote space centersand another six are reserved for hardware and software development.   The spacecraft supported by the Amigas include all of the Atlas-Centaurs, Delta II and Delta III, the Orbital Sciences Pegasus,Lockheed-Martin Athena and a couple different models of the Titan. GOES and GPS spacecraft data are processed, and some userdata off the space shuttle.  Because of way the Amiga is laid out and because the software is all tied together, each machine can actually support more thanone spacecraft at a time, if the bit rate isn&#39;t too high. A multi-tasking, multi-spacecraft personal computer!  Even though the Amigas play an important role in handling telemetry, they are versatile enough to interface with other NASAcomputers. Augie Friscia of Boeing Aerospace told us, &#34;I figured out a way of transferring files from the Amiga to a Sun byconverting the source files I had on the Amiga to an archive and then transferring them to a Sun machine. With just a few minoradjustments to the top of the program and the declare statements, I could compile and run it on the Sun. I did all the debuggingon the Amiga and then took it to the Sun.&#34;  Gary Jones: &#34;If its not a PC, NASA gives us a lot of grief when we try to buy anything to go with the Amigas. They want us tobuy PCs and run Windows 95 and NT. We keep trying to tell them its not fast enough so they tell us to buy DEC Alphas. We tellthem its too expensive. They don&#39;t like the Amiga; it doesn&#39;t cost enough.&#34;  During our January 1998 visit to Hanger AE, the space shuttle Endeavour had just finished retrieving David Wolff from the RussianMir space station.  Gary Jones: &#34;This is data coming down from the shuttle - the STS-89 flight that was docked with the MIR up until yesterday. Theseare some of the environmental parameters that the life sciences people use. They take this data, we process it with the Amiga,we remote it to them on another Amiga which then pulls up data and sends it to their PC which controls an environmental chamberso that they can duplicate the environmental conditions on the shuttle down here except for gravity. So that&#39;s their controlgroup. They can have a group of animals or insects on the shuttle in zero G and the same animals in the same environmentalconditions with normal G about five hangers down the road from here. And the Amiga data is what they use to control their growthchamber to keep the environment the same.&#34;   In the NASA Amigas, custom interface hardware is built and used inside. But the most important difference betweentheir Amigas and ours is on the outside. An armor-plated power button was built out of a 23-pin video connectorbecause the engineers were concerned that the crucial switch was just a little too exposed on the front of the Amiga case!  To prove how useful even stock Amigas can be, we found out that although the 4000s have Workbench 3.1, the 2000sare still running 2.1 because the advantages of the newer operating system were not really needed.  Even after seeing Amigas hard at work in the telemetry lab, another surprise was found in the television center.Hal Greenlee; &#34;We have a toaster system. We add titles during the launch. We might do an effect or two just by wayof making the tape look more interesting. But mainly the Toaster is used to overlay time, camera angle or some kindof text data that they want to add to the picture.&#34;  Three hundred video monitors are fed by a routing system large enough to run a ommercial TV network. In additionto video, it can also route data over the entire space center.  Future plans for the NASA Amigas include supporting another model of the Titan rocket. They are also in theprocess of writing software for the next generation Delta rocket called the Delta III. The American Atlas-Centaurrocket is scheduled to have Russian engines installed onboard that will also need new Amiga telemetry software.Gary&#39;s team will also build a new display capability for the users that will be driven by the Amiga. &#34;We&#39;ll sendthem the data over an Ethernet system, and they&#39;ll use PCs just to do displays.&#34;  Although not as easy to purchase and support as other microcomputers, Gary remained cautious about Gateway&#39;spurchase of the Amiga platform.  &#34;We&#39;ve gotten a little feedback from Hal on Gateway&#39;s purchase of the Amiga. If we start seeing that they&#39;reshipping some hardware we&#39;ll get interested then. But it&#39;s an uphill battle trying to convince NASA thatthey want to go with something other than one of the standard, accepted platforms.&#34;  So the next time you see a space shuttle launch, you can tell your friends which personal computer is ratedfor mission-critical use in the United States space program.   Note: this article was based on a ten minute videotape taken during Amiga Atlanta&#39;s visit to Hanger AE.Contact Bob Castro ( bcastro AT mindspring POINT com)for details.  Special thanks go also to Amiga Atlanta member Mike Ellenberg who grabbed the still frames from the video you seein this article.", "posttime": "2021-07-29 21:43:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nasa,amiga", "title": "Amiga 和 NASA (1999)", "title_en": "Amiga at NASA (1999)", "transed": 1, "url": "http://obligement.free.fr/articles_traduction/amiganasa_en.php", "via": "", "real_tags": ["nasa", "amiga"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070224, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有强有力的证据表明 COVID-19 存在与大脑相关的病理，其中一些可能是病毒嗜神经的结果。迄今为止，绝大多数脑成像研究都集中在中度至重度病例的定性、大体病理学上，通常对住院患者进行。然而，尚不清楚是否可以在较轻的病例中以定量和自动化的方式检测到 COVID-19 的影响，以及这是否可以揭示疾病传播的可能机制。在 COVID-19 大流行开始之前，英国生物银行扫描了 40,000 多名参与者，从而有可能在 2021 年邀请数百名先前成像的参与者进行第二次成像访问。在这里，我们使用来自英国生物银行 COVID-19 再成像研究的 782 名参与者的多模态数据研究了该疾病对大脑的影响，其中 394 名参与者在两次扫描之间检测出 SARS-CoV-2 感染呈阳性。我们使用感染前后的结构性和功能性脑部扫描，比较这 394 名 COVID-19 患者和 388 名年龄、性别、种族和扫描间隔匹配的对照组之间的纵向脑部变化。我们发现了 COVID-19 在大脑中的显着影响，即左侧海马旁回、左侧眶额皮质和左侧脑岛的灰质丢失。当观察整个皮质表面时，这些结果扩展到前扣带回皮质、缘上回和颞极。我们进一步比较了住院的 COVID-19 患者（n=15）和未住院的患者（n=379），虽然结果不显着，但我们发现与 COVID-19 与对照组比较的结果比较相似，其中，此外，扣带回皮层、杏仁核中央核和海马角部的灰质损失更大（所有|Z|&gt;3）。因此，我们的研究结果始终与与初级嗅觉和味觉系统直接相关的边缘皮质区域的灰质损失有关。与事后疾病研究不同，感染前成像数据的可用性有助于避免预先存在的风险因素或临床状况被误解为疾病影响的危险。由于病毒进入中枢神经系统的可能入口点可能是通过嗅粘膜和嗅球，这些脑成像结果可能是疾病（或病毒本身）通过嗅觉和味觉传播的体内标志途径。这项工作主要得到了 Wellcome Trust Collaborative Award 215573/Z/19/Z 的支持。荷航由 Wellcome Trust 高级研究奖学金 202788/Z/16/Z 提供支持。 Wellcome 综合神经影像中心 (WIN FMRIB) 得到 Wellcome Trust (203139/Z/16/Z) 的中心资助。本研究部分使用英国生物库资源进行，申请号为 8107。我确认已遵循所有相关的道德准则，并已获得任何必要的 IRB 和/或伦理委员会批准。为所述研究提供批准或豁免的 IRB/监督机构的详细信息如下： 人类受试者：英国生物银行已获得西北多中心研究伦理委员会 (MREC) 的批准，可从参与者 (http://www.ukbiobank.ac.uk/ethics/)，这些道德规范涵盖了本研究中的工作。从所有参与者那里获得了书面知情同意书。已获得所有必要的患者/参与者同意，并已存档适当的机构表格。我了解所有临床试验和任何其他前瞻性干预研究必须在 ICMJE 批准的注册中心注册，例如 ClinicalTrials.gov。我确认手稿中报告的任何此类研究已注册并提供试验注册 ID（注意：如果发布回顾性注册的前瞻性研究，请在试验 ID 字段中提供声明，解释为什么未提前注册该研究） .\n我已遵循所有适当的研究报告指南，并上传了相关的 EQUATOR Network 研究报告清单和其他相关材料作为补充文件（如果适用）。", "note_en": "There is strong evidence for brain-related pathologies in COVID-19, some of which could be a consequence of viral neurotropism. The vast majority of brain imaging studies so far have focused on qualitative, gross pathology of moderate to severe cases, often carried out on hospitalised patients. It remains unknown however whether the impact of COVID-19 can be detected in milder cases, in a quantitative and automated manner, and whether this can reveal a possible mechanism for the spread of the disease. UK Biobank scanned over 40,000 participants before the start of the COVID-19 pandemic, making it possible to invite back in 2021 hundreds of previously-imaged participants for a second imaging visit. Here, we studied the effects of the disease in the brain using multimodal data from 782 participants from the UK Biobank COVID-19 re-imaging study, with 394 participants having tested positive for SARS-CoV-2 infection between their two scans. We used structural and functional brain scans from before and after infection, to compare longitudinal brain changes between these 394 COVID-19 patients and 388 controls who were matched for age, sex, ethnicity and interval between scans. We identified significant effects of COVID-19 in the brain with a loss of grey matter in the left parahippocampal gyrus, the left lateral orbitofrontal cortex and the left insula. When looking over the entire cortical surface, these results extended to the anterior cingulate cortex, supramarginal gyrus and temporal pole. We further compared COVID-19 patients who had been hospitalised (n=15) with those who had not (n=379), and while results were not significant, we found comparatively similar findings to the COVID-19 vs control group comparison, with, in addition, a greater loss of grey matter in the cingulate cortex, central nucleus of the amygdala and hippocampal cornu ammonis (all |Z|&gt;3). Our findings thus consistently relate to loss of grey matter in limbic cortical areas directly linked to the primary olfactory and gustatory system. Unlike in  post hoc disease studies, the availability of pre-infection imaging data helps avoid the danger of pre-existing risk factors or clinical conditions being mis-interpreted as disease effects. Since a possible entry point of the virus to the central nervous system might be via the olfactory mucosa and the olfactory bulb, these brain imaging results might be the  in vivo hallmark of the spread of the disease (or the virus itself) via olfactory and gustatory pathways.\n    This work was primarily supported by a Wellcome Trust Collaborative Award 215573/Z/19/Z. KLM is supported by a Wellcome Trust Senior Research Fellowship 202788/Z/16/Z. The Wellcome Centre for Integrative Neuroimaging (WIN FMRIB) is supported by centre funding from the Wellcome Trust (203139/Z/16/Z). This research has been conducted in part using the UK Biobank Resource under Application Number 8107.\n  I confirm all relevant ethical guidelines have been followed, and any necessary IRB and/or ethics committee approvals have been obtained.\n  The details of the IRB/oversight body that provided approval or exemption for the research described are given below:\n Human subjects: UK Biobank has approval from the North West Multi-centre Research Ethics Committee (MREC) to obtain and disseminate data and samples from the participants (http://www. ukbiobank.ac.uk/ethics/), and these ethical regulations cover the work in this study. Written informed consent was obtained from all participants.\n All necessary patient/participant consent has been obtained and the appropriate institutional forms have been archived.\n  I understand that all clinical trials and any other prospective interventional studies must be registered with an ICMJE-approved registry, such as ClinicalTrials.gov. I confirm that any such study reported in the manuscript has been registered and the trial registration ID is provided (note: if posting a prospective study registered retrospectively, please provide a statement in the trial ID field explaining why the study was not registered in advance).\n  I have followed all appropriate research reporting guidelines and uploaded the relevant EQUATOR Network research reporting checklist(s) and other pertinent material as supplementary files, if applicable.", "posttime": "2021-07-29 21:42:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "生物,imaging,研究", "title": "英国生物银行Covid-19前后的脑成像", "title_en": "Brain imaging before and after Covid-19 in UK Biobank", "transed": 1, "url": "https://www.medrxiv.org/content/10.1101/2021.06.11.21258690v2", "via": "", "real_tags": ["生物", "imaging", "研究"]}, {"category": "", "categoryclass": "", "imagename": "cdf2bfa7f362a3c3dbc56de57cd9fd6d.jpg", "infoid": 1070222, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "精神分裂症通常在成年后才被诊断出来，通常是从十几岁到四十岁出头。是否有早期指标可以帮助预测哪些人会继续患上这种严重的精神疾病？临床心理学和精神病学的研究人员长期以来一直试图回答这个问题。宾厄姆顿大学（纽约州立大学宾厄姆顿分校）和威尔康奈尔医学院的杰出教授 Mark F. Lenzenweger 的新研究可以指明方向。在最近发表在《异常心理学杂志》上的“17 年后的精神分裂症：中年的精神病症状”中，Lenzenweger 探索了 191 名没有精神病史的人的精神病症状的发展情况；第一次评估是在他们年轻的成年期（17-18 岁），研究参与者在 30 多岁时接受了第二次评估。 Lenzenweger 发现，他们在青少年后期感知的细微差异预示着幻觉、妄想的发展，在某些情况下，他们会在以后的生活中出现精神病。这些早期的知觉扭曲包括对声音或颜色的高度认识、对身体界限的不确定性、感觉周围的世界正在倾斜，以及类似的经历。 “我们发现，那些在 18 岁时没有精神病的人，如果在早期表现出许多非常微妙的感知障碍，他们会在中年出现幻觉和妄想症状，”他说。他补充说，焦虑和抑郁在中年精神病症状的发展中没有任何作用。精神分裂症等疾病的确切原因在很大程度上是未知的，尽管已知遗传学和基于大脑的因素起着至关重要的作用。在美国，大约有 350 万人患有这种疾病，估计每年的医疗保健费用超过 1550 亿美元。\nLenzenweger 说：“这些新发现指出了未来研究的一个具体重点，以更深入地研究导致精神疾病的生物学因素和感知障碍形式的现实世界体验。 “了解这种知觉失常的性质可能会提供更多线索，了解精神分裂症和其他类似疾病的发展过程。”", "note_en": "Schizophrenia is often diagnosed well into adulthood, typically from the late teens to early 40s. Are there early indicators that could help predict which individuals will go on to develop this serious mental illness?\n Researchers in clinical  psychology and psychiatry have long sought to answer this question. New research by Distinguished Professor Mark F. Lenzenweger at  Binghamton University (State University of New York at Binghamton)  and Weill Cornell Medical College could point the way.\n In “Schizotypy 17 years on: Psychotic symptoms in midlife,” recently published in the  Journal of Abnormal Psychology, Lenzenweger explored the development of psychotic symptoms in 191 individuals with no prior history of psychosis; first assessed in their young adulthood (age 17-18), study participants were assessed a second time in their mid-30s.\n Lenzenweger found that subtle differences in perception during their late-teen years predicted the development of hallucinations, delusions, and, in some instances, psychosis later in life. These early perceptual distortions included a heightened awareness of sound or color, uncertainty about the boundaries of one’s body, feeling that the world around them is tilting, and similar experiences.\n “We discovered that people, who were free of psychotic illness at age 18, would show hallucination and delusion symptoms in mid-life if they showed many very subtle disturbances in their perception early on,” he said.\n Anxiety and depression played no role in the development of psychotic symptoms in mid-life, he added.\n The precise causes of illnesses such as schizophrenia are largely unknown, although genetics and brain-based factors are known to play an essential role. Approximately 3.5 million people have the illness in the United States, with an estimated annual healthcare cost of more than $155 billion.\n “These new findings point to a specific focus for future research to drill more deeply into the biological factors driving psychotic illness and real-world experiences in the form of perceptual disturbances,” Lenzenweger said. “Understanding the nature of such perceptual aberrations might provide more clues as to what is going on in the development of schizophrenia and other similar conditions.”", "posttime": "2021-07-29 21:42:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "晚期,distortions,研究", "title": "青少年晚期的知觉扭曲预示着中年的精神病症状", "title_en": "Perceptual distortions in late-teens predict psychotic symptoms in mid-life", "transed": 1, "url": "https://www.binghamton.edu/news/story/3179/early-signs-perceptual-distortions-in-late-teens-predict-psychotic-symptoms-in-mid-life", "via": "", "real_tags": ["晚期", "研究"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070221, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的二十年里，英国历史上最像卡夫卡式的丑闻之一以慢动作上演：邮局的地平线 IT 系统。这个故事太戏剧化了，无法公正地描述这里，但事件的基本轮廓很简单：在 2000 年代初期，新近私有化的皇家邮政引入了一个名为 Horizo​​n 的新 IT 系统，旨在调和每个邮局中的每笔交易和在英国，消除了错误和欺诈的可能性。与所有大型企业 IT 项目一样，该系统存在大量严重错误，其中包括导致记录重复交易的一些错误——这意味着现金似乎正在从某些分支机构消失。皇家邮政的高层并没有相信他们的旗舰新 IT 系统存在严重缺陷，而是选择相信他们以前忠诚的数百名副邮政局长贪污了现金。皇家邮政随后花了将近 20 年的时间通过法院追捕这些员工，使许多员工破产，甚至将一些人送进监狱，完全是基于 IT 证据，没有任何不当行为的证据。本月，上诉法院最终撤销了此案中剩余的刑事定罪，但皇家邮政花费了近 20 年时间——超过 1 亿英镑——通过法庭追捕忠诚且完全无辜的员工，并毁掉他们的生活和生计。这可能是近年来最令人震惊和可怕的误判，如果仔细检查，它会暴露出皇家邮政在组织和文化上的一系列失败。不过，也许最根本的问题是皇家邮递员如何无法看到问题的真正根源。他们如何几乎到最后都说服自己，他们自己的系统不可能是错误的根源？高层如何看待如此扭曲的现实？\n在海洋中，温度随着深度的增加而降低：你走得越深，它就会变得越冷。但有时，所谓的跃层会形成：一个温度屏障，一个温度迅速变化的点。在跃层上方，水是温暖的；从它下面经过，它突然变冷了。这会对海洋中的生命产生巨大的影响，阻止氧气和营养物质通过屏障。在 2008 年的一篇博文中，传奇 IT 顾问 Bruce F.Webster 将温跃层的想法应用于大型 IT 项目。Webster 问道，为什么这么多项目似乎在启动日期之前都在进行中，突然明白他们比计划落后了几英里？韦伯斯特观察到，一般来说，组织底层的人对正在发生的事情有相当准确的看法。他们非常接近细节；他们知道他们所在的项目区域是否在正轨上，并且可以从中推断出更广泛的项目的状态。然而，那些处于顶端的人没有这样的第一手知识。他们依赖于从下方以仪表板和状态报告的形式冒泡的信息。但是，韦伯斯特注意到，这些状态报告倾向于对项目状态产生一种可笑的乐观看法。个别贡献者向他们的直线经理展示了他们正在从事的工作；中层管理人员给他们的老板带来了好消息；高级管理人员热衷于保持晋升轨道，并且可能希望项目的其他部分在他们之前失败，他们再次强调真相。结果是组织内部有一个跃层：不是温度，而是真相。组织结构图中有一条清晰的线，在这条线下可以知道项目灾难状态的真相，但在这条线之上一切看起来都很美好。然而，随着项目接近其预期的完成日期，越来越难以隐藏项目是如何搞砸的现实，因此真相的温跃层在组织中向上移动。最终，真相到达了最高层组织——在截止日期前几天、几周或几个月。需要明确的是，跃层不是下属的错。它们的出现是因为一个组织的领导层所设定的文化。它们是一个重声誉而不是真理的组织的必然结果；奖励好消息，惩罚坏消息；领导团队与实际工作的交付脱节；这会向其员工灌输恐惧和遵守流程，而不是渴望做正确的事情。\n随着邮局丑闻在 2010 年代变得一团糟，从外部可以看到皇家邮政内部真相的温跃层的移动。保拉·文内尔斯 (Paula Vennells) 于 2012 年以最好的意图接任首席执行官，她发现自己周围环绕着一个迫切希望保护自己和皇家邮政声誉的高级管理团队。他们告诉她，按照建议的规模，IT 系统根本不会出现问题；更有可能的是，副邮政局长串通一气，在 IT 漏洞上撒谎，以逃避对最好的无能和最坏的盗窃行为的责任。无法为自己确定真相——她几乎无法深入研究地平线的源代码并对其进行调试——她被迫接受呈现给她的现实，坐在真相的温跃层之上。不愿意或无法为真相浮出水面创造条件，她一直蒙在鼓里。因此，文内尔斯带领皇家邮政陷入了一场旷日持久的法律斗争，以对抗那些生活被地平线毁了的人的主张，这一立场没有事实、法律或道德基础。 “实际上，邮局的这种做法相当于无视实际发生的事情的赤裸裸的断言和否认……相当于 21 世纪坚持地球是平的。”但是向上移动真相的温跃层并最终完全破坏它并不容易。像艾伦·贝茨（Alan Bates）这样的人用了二十年的坚韧。北威尔士 Craig-y-Don 邮局的副邮政局长，Bates 被指控因 IT 系统故障导致现金赤字。但他拒绝接受呈现在他面前的现实：他努力核对自己的账目，发现系统出了问题；他的合同因为他的麻烦而被终止，但无论如何都坚持了下来。他成立了一个竞选小组，向《计算机周刊》杂志报告了他的调查结果，并最终通过法庭与皇家邮政抗争。到 2019 年，否认真相已变得不可能。邮局向贝茨和其他受丑闻影响的副邮政局长支付了 5800 万英镑。 2020 年，他们同意不反对被定罪者的刑事上诉，2021 年 4 月，上诉法院最终撤销了其余定罪。事实温跃层的危险在于，如果你在它之上，就很难知道它。你从下属那里听到的关于现实的美好画面是真实的吗？或者你正走向一座除了你之外每个人都能看到的冰山？但是，这种动态并非在每个企业中都出现。这不是组织的必然性。这是一件文化艺术品；你的组织是否遭受真相的温跃层的问题是你的组织如何更广泛地对待真相的问题。\n您的组织是否最重视真相，即使是来自组织结构图底部的真相？你是否创造了一种环境，让人们在挑战上司时感到安全？你会公开表扬那些提供坏消息的人，而不是告诫他们让团队士气低落吗？你是使用客观指标来衡量进展，还是依赖可以被玩弄的指标？如果不努力创造一个培养真理并让它向上过滤的环境，你现在可能会发现自己在温暖的水中游泳——但这只是时间问题。尼克·沃利斯。 “伟大的邮局审判”。 BBC Radio 4，2020 年 5 月至 6 月，凯文·皮奇。 “邮局丑闻：地平线传奇的全部内容”。 BBC 新闻，2021 年 4 月 23 日布鲁斯 F.韦伯斯特。 “湿件危机：真相的温跃层”。 2008 年 4 月 15 日", "note_en": "Over the last twenty years, one of the most Kafka-esque scandals inBritish history has played out in slow motion: that of the Post Office’sHorizon IT system. The story is far too dramatic to do justice to here,but the basic outline of events is straightforward:\n In the early 2000s, the newly privatised Royal Mail introduced a newIT system, called Horizon, aimed at reconciling every transactionmade in every Post Office up and down the UK, removing thepossibility for errors and fraud.\n  Like all large-scale corporate IT projects, the system hada significant number of severe bugs, including some that resulted induplicate transactions being logged – which meant that it appearedthat cash was disappearing from some branches.\n  Rather than believe that their flagship new IT system had cripplingflaws, the top brass at the Royal Mail instead chose to believe thathundreds of their previously loyal sub-postmasters were embezzlingcash.\n  Royal Mail then spent nearly two decades pursuing those employeesthrough the courts, bankrupting many and even sending some to prison,entirely on the basis of IT evidence and without any proof ofwrongdoing.\n This month, the Court of Appeal finally quashed the remaining criminalconvictions in the case, but Royal Mail spent nearly two decades – andover £100 million – hounding loyal, and entirely innocent, employeesthrough the courts and ruining their lives and livelihoods. It’s perhapsthe most shocking and terrifying miscarriage of justice in recent years,and it exposes – if examined closely – a laundry list of organisationaland cultural failures on the part of Royal Mail.\n Perhaps the most fundamental, though, is the question of how Royal Mailleaders weren’t able to see the true source of the problems. How werethey able to convince themselves almost to the last that their ownsystems couldn’t have been the source of the errors? How were those atthe top seeing such a warped version of reality?\n  In the ocean, temperature decreases with depth: the deeper you go, thecolder it gets. But sometimes, what’s called a  thermocline forms:a temperature barrier, a point at which the temperature changes rapidly.Go above the thermocline and the water is warm; pass beneath it, andit’s suddenly cold. This can have huge ramifications for life in theocean, preventing the passage of oxygen and nutrients past the barrier.\n In  a 2008 blogpost, legendary IT consultant Bruce F.Webster applied the idea of the thermocline to large-scale IT projects.Why was it, Webster asked, that so many projects seemed to be on-trackuntil  just before their launch date, at which point it became suddenlyclear that they were miles behind schedule?\n Webster observed that, generally speaking, those at the bottom of anorganisation have a fairly accurate view of what’s going on. They’reclose to the detail; they know whether their area of the project ison-track, and can infer from that the state of the wider project.\n Those at the top, though, have no such first-hand knowledge. They relyon the bubbling-up of information from below, in the form of dashboardsand status reports. But, Webster noticed, those status reports tend toproduce a comically optimistic view of the state of the project.Individual contributors presented a rosy picture of what they wereworking on to their line managers; middle managers gave good news totheir bosses; and senior managers, keen to stay on the promotion trackand perhaps hopeful that other parts of the project would fail beforetheirs, massage the truth yet again.\n The result is that there is a thermocline within the organisation: notof temperature, but of  truth. There is a clear line in the org chart,below which the truth of the project’s disastrous state is known, butabove which everything looks rosy.\n As the project nears its supposed date of completion, though, it becomesharder and harder to hide the reality of just how screwed up the projectis, and so the thermocline of truth moves upwards in the organisation.Eventually, the truth reaches the highest echelons of the organisation– be that days, weeks, or months before the deadline.\n Thermoclines, to be clear, are not the fault of subordinates. Theyemerge because of the culture set by the leadership of an organisation.They are the inevitable consequence of an organisation that puts moreemphasis on reputation than truth; that rewards good news and punishesbad; that has a leadership team disconnected from the delivery of theactual work; that instils fear and compliance with process into itsemployees, rather than a desire to do the right thing.\n  As the Post Office scandal became messily public in the 2010s, it becamepossible to see from the outside the moving of the thermocline of truthwithin Royal Mail. Paula Vennells, who took over as Chief Executive in2012 with, by all accounts, the best of intentions, found herselfsurrounded by a senior management team desperate to protect their ownreputations and that of the Royal Mail. They told her that there simplycouldn’t be problems with the IT system on the scale that was beingsuggested; it was much more likely that the sub-postmasters werecolluding, lying about IT bugs in order to escape responsibility forwhat was at best incompetence and at worst theft.\n Unable to determine the truth for herself – she could hardly delve intothe source code of Horizon and debug it – she was forced to acceptreality as it was presented to her, sitting as she did above thethermocline of truth. Unwilling or unable to create the conditions wherethe truth would emerge, she remained in the dark. And so Vennells ledRoyal Mail into a protracted legal battle to fight the claims of thosewhose lives had been ruined by Horizon, a position that had no factual,legal, or moral basis.\n  “This approach by the Post Office has amounted, in reality, to bareassertions and denials that ignore what has actually occurred… Itamounts to the 21st century equivalent of maintaining that the earthis flat.”\n But moving the thermocline of truth upwards, and eventually disruptingit entirely, was not easy. It took the twenty-year tenacity of peoplelike Alan Bates. Sub-postmaster at the Post Office in Craig-y-Don, inNorth Wales, Bates was accused of running up a cash deficit by thefaulty IT system. But he refused to accept reality as it was presentedto him: he diligently reconciled his accounts, discovering that thesystem was at fault; he had his contract terminated for his troubles,but persisted regardless. He set up a campaign group, he reported hisfindings to the magazine  Computer Weekly, and he eventuallyfought Royal Mail through the courts.\n By 2019, it had become impossible to deny the truth. The Post Officepaid out £58 million to Bates and the other sub-postmasters who had beenaffected by the scandal. In 2020, they agreed not to oppose the criminalappeals of those who had been convicted, and in April 2021 the Court ofAppeal finally quashed the remaining convictions.\n  The danger of the thermocline of truth is that, if you’re above it, it’sdifficult to know it. Is the rosy picture of reality you’re hearing fromsubordinates genuine? Or are you heading for an iceberg that everyonecan see but you?\n This dynamic doesn’t emerge in every business, though. It’s not anorganisational inevitability. It’s a cultural artefact; the question ofwhether your organisation suffers from a thermocline of truth isa question of how your organisation treats the truth more broadly.\n Does your organisation value truth above all, even from those at thebottom of the org chart? Do you create an environment in which peoplefeel safe challenging their superiors? Do you publicly praise those whogive bad news, rather than admonishing them for demoralising the team?Do you use objective metrics to measure progress, or do you rely onmeasures that are capable of being gamed?\n Without working hard to create an environment that nurtures the truthand allows it to filter upwards, you might find yourself swimming inlovely warm water now – but it’s only a matter of time before realitybites.\n  Nick Wallis.   “The Great Post Office Trial”. BBC Radio 4, May–June 2020\n Kevin Peachey.   “Post Office scandal: What the Horizon saga is all about”. BBC News, 23 April 2021\n  Bruce F. Webster.   “The Wetware Crisis: the Thermocline of Truth”. 15 April 2008", "posttime": "2021-07-29 21:41:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "真理,thermocline,组织", "title": "真理的温跃层", "title_en": "The Thermocline of Truth", "transed": 1, "url": "https://robm.me.uk/2021/04/thermocline-of-truth/", "via": "", "real_tags": ["真理", "组织"]}]