[{"category": "", "categoryclass": "", "imagename": "c715060a0ff6e05b10a77d08b53063be.jpg", "infoid": 1068873, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您从 Verge 链接购买东西，Vox Media 可能会获得佣金。请参阅我们的道德声明。从今天开始，Oculus 将推出针对 Quest 和 Quest 2 头显的 v31 软件更新，其中充满了一些不错的生活质量改进。最重要的是邀请朋友和最近不是朋友的队友一起玩游戏或体验应用程序会更容易。当您在游戏或应用中时，按 Oculus 按钮会像往常一样拉出通用菜单，但很快，更多应用将在“继续”和“退出”按钮旁边显示一个新的“邀请使用应用”按钮。如果朋友接受您的邀请，您就可以在菜单中看到他们。此功能将很快在 Beat Saber、Blaston、Demeo、Echo VR、ForeVR Bowl、Hyper Dash、PokerStars VR 和 Topgolf with Pro Putt 等游戏中推出。如果您不想在 VR 中聚集团队，iOS 和 Android 上即将发布的 Oculus 应用更新将让您可以随时随地创建多人游戏会话。对于受支持的游戏和应用程序，您将能够创建一个链接，该链接可以与其他人共享以加入该群组。您还可以选择链接的活动时间。任何具有社交组件的主要平台都应该有像这样直观的邀请工具，我很高兴看到 Oculus 在这方面取得了一些进展。 v31 中的其他功能可能会也可能不会得到足够的使用，具体取决于您使用 Quest 耳机的方式，但仍然很重要。通过更新，浏览器应用程序还将获得保存和自动填充密码的能力，并通过解锁图案进行保护。 Oculus 在其新闻稿中表示，解锁图案和密码都存储在设备上。 Oculus 还在 Messenger 应用程序中添加了发送和阅读回执以及直接来自 Facebook 的反应表情符号。诚然，这应该可以更容易地回应人们，而不是摸索虚拟键盘。如果您正在等待 v31 使用您的耳机，请记住，它可能需要几周时间才能到达您的耳机。", "note_en": "If you buy something from a Verge link, Vox Media may earn a commission. See our  ethics statement.\n Oculus is rolling out its  v31 software update to Quest and  Quest 2 headsets starting today, and it’s filled with some nice quality-of-life improvements. The big one is it’ll be easier to invite friends and recent teammates who aren’t friends to play a game or experience an app together. When you’re in game or in app, pressing the Oculus button will pull up the universal menu as usual, but soon, more apps will show a new “Invite to App” button next to the “Resume” and “Quit” buttons. If friends accept your invite, you’ll be able to see them in the menu. This feature will roll out soon in games like  Beat Saber,  Blaston,  Demeo,  Echo VR,  ForeVR Bowl,  Hyper Dash,  PokerStars VR, and  Topgolf with Pro Putt.\n If you don’t want to corral the group within VR, an upcoming update to the Oculus app on iOS and Android will let you create a multiplayer session then and there. For supported games and apps, you’ll be able to whip up a link that can be shared with others to join the group. You can also choose how long the link will be active. Any major platform with a social component should have intuitive invite tools like these, and I’m glad to see that Oculus is making some progress here.\n   Other features coming in v31 may or may not get as much use, depending on how you use your Quest headset, but are nevertheless important. With the update, the Browser app will also gain the ability to save and autofill passwords, secured with an unlock pattern. Both the unlock pattern and passwords are stored on device, Oculus says in  its press release.\n Oculus is also adding send and read receipts to the Messenger app as well as reaction emoji — straight from Facebook. Admittedly, this should make it easier to respond to people instead of fumbling with the virtual keyboard.\n If you’re waiting for v31 to hit your headset, keep in mind that it may take a few weeks to arrive on yours.", "posttime": "2021-07-22 22:18:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,设置,invite,oculus", "title": "Oculus 推出 v31，添加了 Messenger Reactions、一个新的安全设置面板和一个新的“邀请到应用程序”按钮，可以更轻松地邀请朋友玩", "title_en": "Oculus rolls out v31, adding Messenger Reactions, a new Security Settings panel, and a new “Invite to App” button that makes it easier to invite friends to play", "transed": 1, "url": "https://www.theverge.com/2021/7/21/22587352/oculus-quest-2-virtual-reality-headset-v31-software-invite-update-reactions-browser-password?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["程序", "设置", "invite", "oculus"]}, {"category": "", "categoryclass": "", "imagename": "ba9da15448816fd76f80aa1bfc91dfcb.jpeg", "infoid": 1068870, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌今天开始推出“Google One 备份”，作为对现有 Android 备份服务的更新，这意味着最终用户只需要知道与云的同步。 Android 备份目前涵盖应用数据、短信、通话记录、联系人和设备首选项——包括 Wi-Fi 网络和密码、壁纸、显示设置（亮度和睡眠）、语言和输入设置以及日期/时间。 Backup by Google One 被宣传为更精细、更广泛以及统一。也就是说，除了现有的 Google One 应用程序或网站之外，它还可以直接在 Android 设置中备份照片、视频和彩信，并进行管理和控制。通过此更改，彩信现在默认成为 Android 备份体验的一部分。去年，该公司开始允许任何人备份彩信，但这需要安装和使用 Google One 应用程序。这种统一的方法旨在消除备份中的任何区别。今天，人们主要知道 Google One（它最等同于 Google 相册媒体备份），并且可能不熟悉后台自动完成的操作。这通常会发挥作用，直到他们获得新设备并进行设置。用户现在需要管理的内容更少，并且可以主动了解正在存储的内容。在上面的图库中，前两个屏幕截图来自系统设置应用程序，而第三个屏幕截图来自 Google One 应用程序内部。在后者中，您会看到启用/禁用“多媒体消息”和“照片和视频”的附加选项。所有这些首选项很快就会在 Android 设置中的新 Google 备份页面中提供。尽管打着“Google One”的烙印，但所有 Google 帐户都可以使用此备份系统。谷歌去年 7 月将 Google One 应用程序中的存储管理器工具提供给所有人，无论订阅状态如何。用户仍然被限制在 15GB 的免费存储空间中，更多的东西需要付费升级。\nBackup by Google One 今天开始向运行 Android 8.0 的设备推出，并将在“未来几周内”完全可用。该公司将在广泛推出时提供更多细节。您正在阅读 9to5Google — 日复一日地发布有关 Google 及其周边生态系统新闻的专家。请务必查看我们的主页以获取所有最新消息，并在 Twitter、Facebook 和 LinkedIn 上关注 9to5Google 以了解最新消息。不知道从哪里开始？查看我们的独家故事、评论、操作方法，并订阅我们的 YouTube 频道", "note_en": "Google today started rolling out “Backup by Google One” as an update over the existing Android backup service that now means end users only have to be aware of one sync to the cloud.\n  Android backups currently cover app data, SMS messages, call history, contacts, and device preferences — including Wi-Fi networks and passwords, wallpapers, display settings (brightness and sleep), language and input settings, and date/time.\n Backup by Google One is billed as being more granular and expansive, as well as unified. Namely, it can also back up photos, videos, and MMS messages with management and control now directly in Android settings, in addition to the existing Google One app or website.\n With this change, MMS is now part of the Android backup experience by default. Last year, the company started allowing anyone to back up MMS, but that required installing and using the  Google One app.\n This unified approach is meant to remove any distinction in backups. Today, people are primarily aware of Google One (which most equate with Google Photos media backup) and might not be familiar with what’s automatically done in the background. This usually does come into play until they get a new device and are setting it up. Users will now have less to manage and be actively aware of what is being stored.\n   In the gallery above, the first two screenshots are from the system Settings app, while the third is inside the Google One app. In the latter you see the additional option to enable/disable “Multimedia messages” and “Photos &amp; videos.” All those preferences will soon be available in the new Backup by Google One page in Android settings.\n Despite the “Google One” branding, this backup system will be available to all Google Accounts. It comes as Google  last July made the storage manager tool inside Google One app available to all, regardless of subscription status. Users are still limited to 15GB of free storage with anything more requiring a paid upgrade.\n  Backup by Google One is beginning to roll out to devices running Android 8.0 today and will be fully available “over the coming weeks.” The company will provide more details as it widely launches.\n  You’re reading 9to5Google — experts who break news about Google and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Google on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2021-07-22 22:17:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,android,数据,backup", "title": "Google 推出 Backup by Google One，这是一种统一的 Android 云备份，可同步应用数据、消息、照片等；备份取代了播放服务工具", "title_en": "Google rolls out Backup by Google One, a unified Android cloud backup that syncs app data, messages, photos, and more; Backup replaces the Play Services tool", "transed": 1, "url": "https://9to5google.com/2021/07/21/backup-by-google-one-android/", "via": "", "real_tags": ["google", "android", "数据", "backup"]}, {"category": "", "categoryclass": "", "imagename": "5e221c6e6f344e744fe518ae993679a6.jpg", "infoid": 1068869, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "会所正在扩大。联合创始人 Paul Davison 和 Rohan Seth 今天宣布该应用程序不再仅限邀请。一位发言人证实，目前约有 1000 万人在候补名单上，随着时间的推移，他们将慢慢添加到应用程序中。 （从本质上讲，今天不会添加数百万用户，但看起来，如果您尝试重新注册，您将能够这样做。）随着消息的发布，Clubhouse 展示了一个新徽标，以及一个新应用图标：Justin “Meezy” Williams，说唱歌手 21 Savage 的经理。 “邀请系统一直是我们早期历史的重要组成部分，”一篇关于这些变化的博客文章说。 “通过增加人潮，每周在我们的周三迎新活动中欢迎新面孔，以及每周日在市政厅与社区交谈，我们已经能够以一种有节制的方式发展会所，并防止事情像我们一样破裂缩放。”这一变化是在 Clubhouse 推出其 DM 产品 Backchannel 一周后发生的，该团队现在表示，该产品在推出的第一天就发送了 1000 万条消息，在第一周内发送了超过 9000 万条。当然，应用程序的开放是在竞争日益激烈的情况下进行的。随着 Clubhouse 构建其产品并获得候补名单，其他社交音频产品，如 Twitter Spaces，向所有人开放。如果 Clubhouse 想要竞争并不断获得新用户，就必须确保每个人都能真正访问它。该旅程的一部分是将应用程序引入 Android 以及 iOS，现在它完成了第二个主要步骤，即取消任何围绕新用户注册的限制。", "note_en": "Clubhouse is going wide. Co-founders Paul Davison and Rohan Seth announced today that the app is no longer invite-only. Around 10 million people are currently on the waitlist, a spokesperson confirms, and they’ll slowly be added to the app over time. (Essentially, millions of users won’t be added today, but seemingly, if you attempt to sign up anew, you’ll be able to do so.) Along with the news, Clubhouse showed off a new logo, as well as a new app icon: Justin “Meezy” Williams, rapper 21 Savage’s manager.\n “The invite system has been an important part of our early history,” a blog post about the changes says. “By adding people in waves, welcoming new faces each week in our Wednesday Orientations, and talking with the community each Sunday in Town Hall, we’ve been able to grow Clubhouse in a measured way, and keep things from breaking as we’ve scaled.”\n This change comes only a week after Clubhouse  launched its DM product, Backchannel, which the team now says saw 10 million messages sent within the first day of launch, and more than 90 million over the first week.\n Of course, the app opening up comes amid increasing competition. As Clubhouse built out its product and acquired a waitlist, other social audio products, like Twitter Spaces, opened to everyone. If Clubhouse wants to compete, and keep acquiring new users, it’ll have to make sure everyone can actually access it. Part of that journey was bringing the app to Android, in addition to iOS, and now it’s completed the second major step, which is removing any gating around new user signup.", "posttime": "2021-07-22 22:17:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,添加,exits,产品", "title": "Clubhouse 不再接受邀请，因为它退出了测试版，并表示随着时间的推移，其候补名单上的 1000 万人将被添加到应用程序中", "title_en": "Clubhouse is no longer invite-only as it exits beta and says the 10M people on its waitlist will be added to the app over time", "transed": 1, "url": "https://www.theverge.com/2021/7/21/22586845/clubhouse-open-beta-invite-access-android-ios?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["程序", "添加", "exits", "产品"]}, {"category": "", "categoryclass": "", "imagename": "bf3d1ce99f5148cb2267822b88db6045.jpg", "infoid": 1068867, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周，白宫向反疫苗错误信息和 Facebook 的审核系统宣战。总统乔拜登表示，Facebook 和其他社交网络通过提供有关疫苗的虚假信息来“杀人”，尽管他后来软化了攻击。 Facebook 对这一指控提出了尖锐的反驳，促进了其疫苗工作。昨天，拜登政府以令人不安且不必要的承诺进行回击，即它正在“审查”互联网法律以应对错误信息。我想明确一点：白宫推动疫苗是一件好事。随着病毒的 Delta 菌株的传播，美国 COVID-19 病例突然增加，不到一半的美国人完全接种了疫苗，而且美国最近几乎所有 COVID-19 死亡病例都发生在未接种疫苗的人群中。相当多的美国人报告相信诸如“美国政府正在使用 COVID-19 疫苗对人口进行微芯片化”之类的理论，这种想法实际上是虚构的，甚至行不通。像 Facebook 这样的公司帮助传播这些理论，即使它们也在宣传值得信赖的内容。民选官员可以敦促公司停止做一些有害的事情，即使它是合法的。但白宫还没有详细说明这个等式的最后一部分。相反，它通过宽恕 Facebook 应该对虚假声明在法律上“负责”的想法，在合理的指导和不合理的政府镇压之间提供了模糊的界限。在就反疫苗错误信息接受 MSNBC 采访时，白宫通讯主任凯特·贝丁菲尔德 (Kate Bedingfield) 回答了一个问题，询问拜登是否会更改第 230 条，使公司“有责任发布该信息，然后面临诉讼”。贝丁菲尔德回应说：“我们正在审查这一点，当然他们应该承担责任。”第 230 条阻止打击错误信息的想法是......好吧，错误信息。 （这也不是拜登第一次提出这个建议。）第 230 条保护免受涉及非法内容的诉讼。除了有限的例外，第一修正案允许人们在网上撒谎和犯错。拜登政府没有什么可以“审查”的，除非他们相信以下三件事之一：疫苗错误信息属于现有的第一修正案例外，如诽谤或欺诈，第 230 条不应再保护托管它的公司。 （诸如销售非疫苗 COVID-19“治愈”之类的帖子可能符合该法案，但可能不符合有关疫苗的一般虚假信息。）疫苗错误信息非常有害，应将其定为非法，然后 Facebook 应承担责任用户传播它。 （国会理论上可以定义和禁止“错误信息”，但这将是与第一修正案保护的一场艰苦战斗。）\n应该鼓励人们惩罚 Facebook 托管不良但合法的内容，使其与几乎肯定会赢的琐碎诉讼作斗争。白宫可以鼓励删除虚假医疗信息，但不支持将 Facebook 告上法庭的想法。正如律师兼作家肯·怀特（也被称为教皇哈特）在 Twitter 上指出的那样，拜登本可以从一开始就强调 Facebook 拥有第一修正案的权利，允许大量虚假信息，即使他认为该网站有道德责任将其删除.贝丁菲尔德很容易在她的采访中提出类似的观点，甚至为以其他方式改变第 230 条敞开大门——比如“我们相信让大型科技公司承担责任并正在审查包括第 230 条在内的法律，但我们也尊重平台的权利调整他们认为合适的合法内容，并希望他们负责任地使用这种权力。”对于大多数在线虚假信息——尤其是涉及冠状病毒大流行的信息，即使是善意的医疗建议和科学共识也在不断变化——美国政府应该继续尊重托管这些内容的权利。正如贝丁菲尔德后来在采访中指出的那样，Facebook 并不是从头开始创建反疫苗接种的帖子。福克斯新闻等主要媒体都反对疫苗接种工作。让人们起诉 Facebook 为他们提供平台将是对媒体和个人的间接打击，而不仅仅是“大科技”监管。至少有一个团体直接起诉福克斯新闻的冠状病毒报道，此案被驳回。虽然第一修正案的保护不是无限的，但试图禁止科学错误信息几乎肯定会适得其反。鼓励对其提起诉讼将使公司向 Facebook 施加压力，要求其撤下有关涉嫌污染、危险产品或其他不讨人喜欢但有争议的事件的故事。其他国家的“假新闻”法律已成为压制合法抗议的工具。拜登政府明确表示不会让所有认为所有社交媒体节制都是审查制度的批评者保持沉默。 （毕竟，前总统唐纳德特朗普起诉 Facebook 自愿从他自己的政府那里寻求政策指导。）但这是处理复杂问题的正确方法 - 保留白宫保护第一修正案和美国人健康的承诺。", "note_en": "Last week, the White House declared war on anti-vaccine misinformation and Facebook’s moderation system. President Joe Biden  said that Facebook and other social networks were “killing people” by hosting false information about vaccines, although he later  softened the attack. Facebook  disputed the accusation sharply, promoting its vaccine efforts. And yesterday, the Biden administration  hit back with a troubling — and unnecessary — promise that it was “reviewing” internet law in response to misinformation.\n I want to be clear: the White House’s vaccine push is a good thing. American COVID-19 cases are  abruptly rising as the virus’s Delta strain spreads, fewer than half of all Americans are fully vaccinated, and  nearly all recent US COVID-19 deaths have been among unvaccinated people. A significant number of Americans  report believing theories like “the US government is using the COVID-19 vaccine to microchip the population,” an idea that’s  literally made up and  wouldn’t even work. Companies like Facebook help  spread these theories even if they’re also promoting trustworthy content. And elected officials can urge companies to stop doing something that’s harmful even if it’s legal.\n  But the White House hasn’t spelled out the last part of that equation. Instead, it’s offering blurred lines between reasonable guidance and an unreasonable government crackdown by condoning the idea that Facebook should be legally “accountable” for false claims.\n In an interview  with MSNBC about anti-vaccine misinformation, White House communications director Kate Bedingfield responded to a question asking if Biden would change Section 230 to make companies “liable for publishing that information, and then open to lawsuits.” Bedingfield responded that “we’re reviewing that, and certainly they should be held accountable.”\n The idea that Section 230 is holding back a crackdown on misinformation is... well, misinformation. (And it’s  not the first time Biden’s suggested it, either.) Section 230 protects against lawsuits involving illegal content. With limited exceptions, the First Amendment allows people to lie and be wrong online. There’s nothing for the Biden administration to “review” unless they believe one of three things:\n Vaccine misinformation falls under existing First Amendment exceptions like defamation or fraud, and Section 230 should no longer shield companies that host it. (Posts doing things like selling non-vaccine COVID-19 “cures” might fit that bill, but probably not  general false messaging about vaccines.)\n Vaccine misinformation is so harmful that it should be made illegal and Facebook should then be held liable for letting users spread it. (Congress could theoretically define and ban “misinformation,” but it would be an uphill battle against the First Amendment’s protections.)\n People should be encouraged to punish Facebook for hosting bad but legal content by making it fight frivolous lawsuits that it will almost certainly win.\n The White House can encourage removing false medical information without supporting the idea of taking Facebook to court over it. As attorney and writer Ken White (also known as Popehat)  pointed out on Twitter, Biden could have emphasized from the start that Facebook has a First Amendment right to allow much false information, even if he thinks the site has a moral duty to remove it.\n Bedingfield could easily have made a similar point in her interview, even leaving the door open to changing Section 230 in other ways — something like “we believe in holding Big Tech accountable and are reviewing laws including Section 230, but we also respect platforms’ right to moderate legal content as they see fit and hope they’ll use that power responsibly.”\n  And when it comes to most false information online — especially information involving the coronavirus pandemic, where even good-faith medical advice and scientific consensus changes continuously — the US government should continue to respect the right to host that content. As Bedingfield later pointed out in the interview, it’s not like Facebook is creating anti-vaccination posts from scratch; major outlets like Fox News have  pushed against vaccination efforts. Letting people sue Facebook for platforming them would be an indirect crackdown on the press and individuals, not simply “Big Tech” regulation. At least one group has directly sued Fox News for its coronavirus coverage, and the case  was thrown out.\n While the First Amendment’s protections aren’t limitless, trying to ban scientific misinformation would almost certainly backfire. Encouraging lawsuits over it would let companies pressure Facebook to take down stories about alleged pollution, dangerous products, or other unflattering but contested incidents. And “fake news” laws in other countries have  become tools to silence legitimate protest.\n The Biden administration making this clear wouldn’t silence every critic who believes all social media moderation is censorship. (After all,  former president Donald Trump sued Facebook for voluntarily seeking policy guidance from  his own administration.) But it’s the right way to handle a complicated problem — one that preserves the White House’s commitment to protecting the First Amendment along with Americans’ health.", "posttime": "2021-07-22 22:15:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,承诺,administration", "title": "拜登政府承诺“审查”第 230 条以回应 Facebook 上的反vax 帖子将失败，因为在线错误是受保护的言论", "title_en": "The Biden administration's promise to “review” Section 230 in response to anti-vax posts on Facebook will fail since being wrong online is protected speech", "transed": 1, "url": "https://www.theverge.com/22585152/biden-white-house-facebook-vaccine-misinformation-section-230-first-amendment?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["facebook", "承诺"]}, {"category": "", "categoryclass": "", "imagename": "56380152f94fec753834741890ca4a96.jpg", "infoid": 1068866, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近震惊天主教会的丑闻既令人难以置信地令人不安，又完全可以预防。为什么没有人对此采取任何措施？本周，我们在互联网上看到了最可怕的技术隐私故事之一：对从属于天主教会高级官员之一杰弗里·伯里尔 (Jeffrey Burrill) 的移动设备中窃取的大量位置数据进行调查。就像许多关于潜伏在普通人位置数据中的故事一样，关于 Burrill 生活的一些非常敏感的细节最终在这些数据集中被发现：访问同性恋酒吧和夜总会，其中包括。不久后，伯里尔辞职了。对独家新闻的回应 - 由 Pillar 提供，这是一个以天主教堂故事为中心的两人数字媒体 - 褒贬不一。一些明显的偏执者为将“罪人”从他们的基督教机构中清除掉的努力而欢呼。其他人则谴责这篇文章公然侵犯了男人的隐私权。双方都在问的一个问题——但似乎没有人回答——是这些数据最初来自哪里。全国天主教记者首先报道了伯里尔的意外辞职，并引用了当天早上早些时候在美国天主教主教会议（或简称 USCCB）成员中散发的内部备忘录。周二的备忘录称，在担任大会秘书长一年后，该组织宣布伯里尔即将卸任“令人悲伤”。该备忘录除了含糊地指出 USCCB 的工作人员被告知“即将发生的媒体报道声称可能存在不当行为”之外，并没有提供突然改组背后的太多理由，如果不加以解决，可能会“分散注意力”。大约一个小时后，我们看到了有问题的“媒体报道”。 “在 2018 年、2019 年和 2020 年的部分时间里，与 Burrill 相关的移动设备几乎每天都从基于位置的连接应用程序 Grindr 发出应用程序数据信号——在他的 USCCB 办公室和他在 USCCB 拥有的住所，以及在其他城市的 USCCB 会议和活动期间，”支柱写道，并指出这些数据信号“来自数据供应商，并由独立数据咨询公司验证”，该出口已亲自签约。在这家神秘公司的帮助下，Pillar 解释说，它能够匹配构成许多可公开购买的数据集大部分的有点匿名的信号，以便找出匿名信号中的哪一个。信号属于 Burrill 的设备。\n“商用应用信号数据不会识别应用用户的姓名，而是将唯一的数字标识符与使用特定应用的每个移动设备相关联，”该出口在其博客中解释道。 “在用户同意数据收集后由应用程序收集的信号数据由数据供应商汇总和出售。可以对其进行分析，以为每个编号的设备提供带时间戳的位置数据和使用信息。”在推断出在 Burrill 出席的会议期间，一个特定的设备似乎一直经常出现在 Burrill 的住所、属于 Burrill 家族的湖边别墅和 USCCB 总部，之后记者们认为这确实是... Burrill 的电话。当他们绘制出该设备在过去三年中的其他位置时，他们发现了一个到处都是同性恋俱乐部和酒吧的路线图，每次 Burrill 在他的设备上打开 Grindr 时，都会发出“近乎日常”的信号。换句话说，要么是一个非常同性恋的小偷每周多次偷窃这个人的电话，要么伯里尔正在悄悄地忍受与天主教会对酷儿神职人员的严厉态度所带来的同一个秘密地狱。想想有点超现实——但在其存在的十年中，Grindr 已经从同性恋联播文化中的大牌之一变成了一个与严重伤害这些社区同义的应用程序。例如，去年春天，该平台成为摩洛哥人的首选武器，他们希望将平台上的同性恋用户强行驱逐，作为社交媒体恶作剧的一部分，该恶作剧导致至少一名 Grindr 用户自杀。最近，我们看到同性恋者使用该平台跟踪并有时谋杀希望在爱尔兰、比利时和路易斯安那州勾搭的男同性恋者。该公司尚未回应 Gizmodo 就 Burrill 案发表评论的请求——值得指出的是，这是与该公司有关的一系列隐私滥用行为中的最新一起。天主教通讯社发布的另一篇博客是另一家专注于信仰信仰的媒体，该媒体以前雇用了 The Pillar 故事背后的两名记者，更深入地介绍了这些虐待行为的情况。该博客在他们调查出来的前一天发布，主要关注“私人团体使用国家安全式监视技术”的迫在眉睫的威胁，特别是“跟踪教会人员的动向和活动”。该机构知道这项技术的存在，因为它早在 2018 年就已经报道了这个确切的故事：这个问题于 2018 年首次提出，当时一位关心改革天主教神职人员的人接触了一些教会个人和组织，包括天主教通讯社。\n该党声称拥有能够识别神职人员和其他下载流行的“连接”应用程序（例如 Grindr 和 Tinder）的人的技术，并使用他们的计算机或移动设备的互联网地址来确定他们的位置。该提议是私下向教会官员提供这些信息，希望他们能够惩戒或驱逐那些被发现使用这些技术违反其教士誓言并可能给教会带来丑闻的人。这个无名角色出现在源源不断的报告之后出现，这可能并非巧合，这些报告详细说明了与许多数据经纪人和广告技术平台共享的荒谬数据，Grindr 用来补贴其免费应用程序。当被问及为什么这些公司不仅要了解他们的精确位置，还要了解他们的 HIV 状态、种族背景或……真的其他任何事情时，该公司经常重复的辩护是与这些中间人共享的数据是加密的，并且无法识别。在最近的一篇题为“创纪录的 Str8”的博客中，该公司自豪地宣称其系统旨在仅共享基本的散列标识符——正是用于查明 Burrill 所谓设备的类型。显然，只有 Grindr 知道 Grindr 是否在说实话。但是，该平台所依赖的这些广告技术中间商有长达数年的欺骗记录，如果这意味着它可以以每位用户多收几美分的价格挤压平台和发布商。与此同时，Grindr 多年来一直乐于接受这些谎言，即使它们意味着来自监管机构的多次诉讼和大量愤怒的用户。根据 AppsFigures 的最新报告，目前，Grindr 在 Android 和 iOS 上的应用程序都列出了 25 个独立的技术片段，从应用程序的幕后某处提取数据。所有这些合作伙伴都以某种方式试图从利润惊人的 LGBT 消费者阶层中分一杯羹，无数利用这些公司数据的公司也是如此。多亏了当今广告公司的庞大规模——更不用说缺乏实质性的监管，我们无法确定这些公司是谁，或者他们在用这些二手数据做什么。他们是否针对支持 LGBT 事业的人？他们是在悄悄地分析有色人种的酷儿吗？他们是否在拼凑更多关于更多天主教人物的数据？待定。唯一几乎可以肯定的是，这些噩梦般的场景正在让某人在某个地方赚到一大笔现金。支线故事：我高中的一个朋友来自一个非常保守的天主教家庭，大部分时间都在壁橱里。当他终于出来时——这肯定需要极大的勇气或绝望或两者兼而有之（在我发现的这些故事中经常相互关联）——他的父母告诉他——没有问他，他们告诉他——如果他不能解决他的问题，他将成为一名牧师，因为这是防止他犯罪的解决方案。这让我想知道有多少神父出于同样的原因在神职人员中，而这篇文章确实强调了天主教官方对同性恋的态度是多么残酷。", "note_en": "The latest scandal to rock the Catholic Church was both incredibly unnerving and entirely preventable. Why isn&#39;t anyone doing anything about it?\n This week we got one of the most nightmarish tech privacy stories to rear its ugly head on the internet:   an investigation into a trove of location data siphoned from a mobile device belonging to one of the Catholic Church’s   top officials, Jeffrey Burrill. Like many stories about   whatever’s lurking in the average person’s location data, some pretty sensitive details about Burrill’s life ended up unearthed in these datasets: visits to gay bars and nightclubs, among them. Burrill resigned not long after.\n  Responses to the scoop—which came courtesy of the Pillar, a two-person digital outlet centered around stories on the Catholic church—were mixed. Some obvious bigots cheered on the effort to expunge “sinners” from their Christian institutions. Others decried the piece as a blatant invasion of a dude’s right to privacy. The one question both sides were asking—but nobody seemed to have an answer for—was where this data even came from in the first place.\n The   National Catholic Reporter was first to report Burrill’s surprise resignation, citing an internal memo being circulated among members of the United States Conference of Catholic Bishops (or USCCB for short) earlier that morning. The Tuesday memo   said it was “with sadness” that the org was announcing Burrill was stepping down, after barely serving a year as the Conference’s general secretary. The memo didn’t offer much reasoning behind the sudden shakeup besides cryptically noting that USCCB staffers were tipped off on “impending media reports alleging possible improper behavior” on the Monsignor’s behalf that carried the risk of “becoming a distraction” if left unaddressed.\n    About an hour later, we got a look at the “media report” in question.\n  “A mobile device correlated to Burrill emitted app data signals from the location-based hookup app Grindr on a near-daily basis during parts of 2018, 2019, and 2020—at both his USCCB office and his USCCB-owned residence, as well as during USCCB meetings and events in other cities,” the Pillar wrote, noting that these data signals were “from a data vendor and authenticated by an independent data consulting firm,” that the outlet had personally contracted.\n   With the help of this mysterious firm, the Pillar explained it was able to match the sea of kinda-sorta-not-really-anonymous   signals that make up the bulk of many publicly purchasable data sets in order to figure out which one of those anonymous signals belonged to Burrill’s device.\n “Commercially available app signal data does not identify the names of app users, but instead correlates a unique numerical identifier to each mobile device using particular apps,” the outlet explained in its blog. “Signal data, collected by apps after users consent to data collection, is aggregated and sold by data vendors. It can be analyzed to provide timestamped location data and usage information for each numbered device.”\n  After deducing that one particular device seemed to consistently frequent Burrill’s residence, a lake house belonging to Burrill’s family, and the USCCB HQ during meetings where Burrill was in attendance, the reporters figured that this was indeed... Burrill’s phone. When they mapped out where else this device wound up over the past three years, they found a roadmap littered with gay clubs and bars, all pinged by the “near-daily” signals beamed out every time Burrill opened Grindr on his device.\n In other words, either an extremely gay thief was pilfering this guy’s phone multiple times per week, or Burrill was quietly suffering through the same   closeted hell that comes with the Catholic Church’s   draconian attitudes toward queer clergy.\n  It’s somewhat surreal to think about—but over its decade of existence, Grindr’s gone from being one of the biggest names in   gay hookup culture to being an app that’s synonymous with egregiously harming those same communities. Last spring, for example, the platform became the   weapon of choice for Moroccan personalities looking to forcibly out gay users on the platform as part of a tone-deaf social media prank that’s resulted in at least one Grindr user’s   suicide. More recently, we’ve seen homophobes use the platform to   stalk and sometimes murder gay men looking to hook up in Ireland, Belgium, and   Louisiana.\n The company hasn’t yet responded to Gizmodo’s request for comment about the Burrill case—which it’s worth pointing out here is the latest in a string of privacy abuses connected to the company.\n  Another blog published by The Catholic News Agency, another Faith-focused outlet that formerly employed the two reporters behind The Pillar’s story, goes a bit deeper on what these abuses look like. The blog, which was published the day before their investigation came out, was centered on the impending threat of “private parties using national security-style surveillance technology,” specifically to “track the movements and activities” of Church personnel. And the Agency knew that this tech existed because it had been pitched this exact story back in 2018:\n The issue was first raised in 2018, when a person concerned with reforming the Catholic clergy approached some Church individuals and organizations, including Catholic News Agency.\n This party claimed to have access to technology capable of identifying clergy and others who download popular “hook-up” apps, such as Grindr and Tinder, and to pinpoint their locations using the internet addresses of their computers or mobile devices.\n The proposal was to provide this information privately to Church officials in the hopes that they would discipline or remove those found to be using these technologies to violate their clerical vows and possibly bring scandal to the Church.\n  It’s probably not a coincidence that this nameless character appeared in the wake of a steady stream of reports detailing the absurd amounts of data being shared with the many data brokers and adtech platforms Grindr was using to subsidize its free app. When confronted with questions about why these companies weren’t only tapping into their precise location, but their   HIV status, ethnic background, or... really anything else, the company’s oft-repeated defense was that data shared with these middlemen were   encrypted, and unidentifiable. In a more recent blog titled “Setting The Record Str8,” the company   proudly declared that its systems were designed to only share basic, hashed identifiers—the exact kind that were used to pinpoint Burrill’s alleged device.\n Obviously, only Grindr knows if Grindr is telling the truth. But these sorts of adtech middlemen the platform’s relying on have a years-long track record of   lying through their teeth if it means it can squeeze platforms and publishers for a few more cents per user. Grindr, meanwhile, has a years-long track record of blithely accepting these lies, even when they mean   multiple lawsuits from regulators and slews of irate users.\n  Right now, Grindr’s apps on Android and iOS both list 25 separate pieces of tech pulling data from the app somewhere behind the scenes, according to the most recent reports from   AppsFigures. All of these partners, in some way or another, are trying to get a slice of the   surprisingly lucrative LGBT consumer class, as are the countless companies that piggyback off of these company’s data. Thanks to the   sheer scale of advertising companies today—not to mention the staggering lack of substantial regulation, there’s no way to know for sure who these companies are, or what they’re doing with those secondhand figures. Are they   microtargeting people who support LGBT causes? Are they quietly profiling queer   people of color? Are they cobbling together more data about more Catholic figures? TBD. The only thing that’s almost assured is that these nightmare scenarios are making someone, somewhere, a whole lot of cash.\n        Side story: a friend of mine in high school was from a very conservative Catholic family and was in the closet for most of that time. When he finally came out—which must have taken an incredible amount of courage or desperation or both (often interlinked in these stories I find)—his parents told him—the did not ask him, they  told him—that if he couldn’t fix his problem, he would be becoming a priest because that was the solution that would keep him from sinning. It makes me wonder how many priests are in the priesthood for the same reason, and this article really emphasizes how doubly cruel the official Catholic attitude toward homosexuality is.", "posttime": "2021-07-22 22:13:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "数据,data", "title": "Grindr 曾表示，与经纪人共享的数据是加密且无法识别的，尽管使用此类数据泄露了天主教神父和其他人的身份", "title_en": "Grindr has a track record of saying that data shared with brokers is encrypted and unidentifiable, despite the use of such data to out a Catholic priest, others", "transed": 1, "url": "https://gizmodo.com/a-priest-was-outed-by-his-phones-location-data-anyone-1847334277?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["数据", "data"]}, {"category": "", "categoryclass": "", "imagename": "401740974e874f82dd6109f8e40e49e4.jpg", "infoid": 1068865, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "联邦贸易委员会在周三发布的新政策声明中正式承诺对非法的“维修权”采取限制措施。新政策可能会给苹果等智能手机制造商带来麻烦，这些制造商严格禁止用户维修自己的设备。根据主席 Lina Khan 的说法，周三新的维修权政策声明要求 FTC 以“活力”鼓励产品维修市场的竞争。该声明获得一致通过，成为 FTC 的官方政策，该机构利用其现有权力支持独立维修店并降低消费者的维修成本。 “虽然占主导地位的公司限制维修市场的努力并不新鲜，但技术的变化和软件的更普遍使用为公司创造了限制独立维修的新机会，”汗周三表示。 “这些类型的限制会显着增加消费者的成本，扼杀创新，关闭独立维修店的商机，造成不必要的电子垃圾，延迟及时维修，并削弱弹性。”该声明是在白宫在一项关于经济竞争的行政命令中批准类似规则的几天后发表的。在总统乔拜登于 7 月 9 日签署的命令中，白宫明确呼吁智能手机制造商“对自行和第三方维修施加限制，使维修更加昂贵和耗时，例如通过限制零件的分发、诊断和维修工具。”在周三的会议上，美国联邦贸易委员会没有列出未来调查可能针对的任何具体公司或行业。此举受到了 iFixit 等拥护者的称赞。在周三的一份声明中，iFixit 的美国政策负责人 Kerry Sheehan 表示：“FTC 在解决维修限制方面取得的进展表明，维修权取得了多大的动力，以及当我们共同努力时，我们的社区可以变得多么强大。” “今天的政策声明的通过明确表明，委员会将调查非法维修限制，利用马格努森 - 莫斯保修法和其他消费者保护法以及反垄断法促进公平和开放的维修市场，”民主党专员罗希特乔普拉说在周三的一份声明中。周三的公开会议是自汗被确认为一家传统上闭门工作的机构主席以来的第二次公开会议。在本月早些时候的第一次诉讼中，Khan 的 FTC 通过了两项竞争措施，使该机构能够对违反反垄断法的行为采取更积极的行动。", "note_en": "The Federal Trade Commission formally pledged to take on unlawful “right to repair” restrictions in a new policy statement issued Wednesday. The new policy could spell trouble for smartphone manufacturers like Apple that strictly inhibit users’ abilities to repair their own devices.\n Wednesday’s new right to repair policy statement commits the FTC to encouraging competition in product repair markets with “vigor,” according to Chair Lina Khan. The statement, which was approved unanimously, makes it official FTC policy for the agency to use its existing authorities to support independent repair shops and lower repair costs for consumers.\n “While efforts by dominant firms to restrict repair markets are not new, changes in technology and more prevalent use of software has created fresh opportunities for companies to limit independent repair,” Khan said Wednesday. “These types of restrictions can significantly raise costs for consumers, stifle innovation, close off business opportunities for independent repair shops, create unnecessary electronic waste, delay timely repairs, and undermine resiliency.”\n The statement comes just days after the White House endorsed similar rules in an  executive order on economic competition. In the order, signed by President Joe Biden on July 9th, the White House explicitly calls out smartphone makers that “impose restrictions on self and third-party repairs, making repairs more costly and time-consuming, such as by restricting the distribution of parts, diagnostics, and repair tools.” At Wednesday’s meeting, the FTC did not name any specific companies or industries that it could target in future investigations.\n The move was lauded by right to repair advocates like iFixit. In a statement Wednesday, iFixit’s US policy lead Kerry Sheehan said, “The FTC’s progress addressing repair restrictions shows how much momentum Right to Repair has achieved, and how powerful our community can be when we work together.”\n “The adoption of today’s policy statement makes clear that the Commission will investigate unlawful repair restrictions, using the Magnuson-Moss Warranty Act and other consumer protection laws, as well as antitrust law to promote fair and open repair markets,” Democratic Commissioner Rohit Chopra said in a statement Wednesday.\n Wednesday’s open session was just the second since Khan was confirmed as chair at an agency that traditionally works behind closed doors. In the first proceeding earlier this month, Khan’s FTC  passed a pair of competition measures, setting the agency up to take more aggressive action on antitrust violations.", "posttime": "2021-07-22 22:13:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "维修,repair", "title": "FTC 正式承诺打击非法的维修权限制，表示将利用其权力降低维修成本并支持独立维修店", "title_en": "The FTC formally pledges to fight unlawful right-to-repair restrictions, says it will use its power to lower repair costs and support independent repair shops", "transed": 1, "url": "https://www.theverge.com/2021/7/21/22587331/right-to-repair-apple-iphone-ftc-lina-khan-open-meeting?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["维修", "repair"]}, {"category": "", "categoryclass": "", "imagename": "e56877f4988bc23987ab2b5d28856ca9.jpeg", "infoid": 1068864, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "去年，Twitter 的首席产品官 Kayvon Beykpour 证实，该社交网络正在“探索”在应用程序中添加不喜欢按钮的想法。现在，似乎 Twitter 正处于为 iOS 上的某些用户测试不喜欢/反对按钮的早期阶段。 Twitter 在 Twitter 支持帐户上发布的一条推文中证实了这项新测试。该公司表示，iOS 上的一些用户将在推文上看到新的赞成和反对选项。该公司表示，downvotes 不会公开显示，而 upvotes 将显示为喜欢，这意味着该功能仅适用于内部指标。据 Twitter 称，这项新测试的目标是“了解你认为相关的回复类型”。 iOS 版 Twitter 应用程序中向用户显示的提示如下： 不喜欢不公开或作者不可见，而喜欢是公开的。它们都帮助我们了解人们认为对对话有价值的内容。 Twitter 正在为此新功能测试多种不同的设计，包括赞成和反对按钮、喜欢和不喜欢，以及将经典心脏与反对票配对，如上图所示。同样，这里要记住的重要一点是，这是一项测试，没有公开显示任何信息。这项测试的最终范围还有待观察，目前尚不清楚 Twitter 是否会将这些功能扩展到目前的一小部分用户之外。您正在阅读 9to5Mac — 日复一日地发布有关 Apple 及其周边生态系统新闻的专家。请务必查看我们的主页以获取所有最新消息，并在 Twitter、Facebook 和 LinkedIn 上关注 9to5Mac 以了解最新消息。不知道从哪里开始？查看我们的独家故事、评论、操作方法，并订阅我们的 YouTube 频道", "note_en": "Last year, Twitter’s chief product officer Kayvon Beykpour confirmed that the social network was “ exploring” the idea of adding a dislike button to the app. Now, it appears that Twitter is in the early stages of testing a dislike/downvote button for some users on iOS.\n  Twitter confirmed this new test in a tweet posted to the  Twitter Support account. The company says that some users on iOS will see new upvote and downvote options on tweets. Downvotes will not be shown publicly, while upvotes will be shown as likes, the company says, implying that the feature is only intended for internal metrics.\n According to Twitter, the goal of this new test is to “understand the types of replies you find relevant” in a conversation. The prompt that appears to users in the Twitter for iOS app reads as follows:\n Dislikes aren’t public or visible to the author, while Likes are. They both help us understand what people think is valuable to the conversation.\n Twitter is testing multiple different designs for this new feature, including upvote and downvote buttons, likes and dislikes, and pairing the classic heart with a downvote, as seen in the image above. Again, the important thing to remember here is that this is a test and none of the information is publicly shown.\n The ultimate scope of this test remains to be seen, and it’s unclear whether Twitter will expand these features beyond the current small subset of users.\n  You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Mac on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2021-07-22 22:13:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ios,回复,replies,twitter", "title": "Twitter 正在测试一种在 iOS 上拒绝回复的方法，以了解用户认为与对话相关的回复类型；否决票不会公开", "title_en": "Twitter is testing a way to downvote replies on iOS to understand the types of replies users find relevant to a conversation; downvotes won't be public", "transed": 1, "url": "https://9to5mac.com/2021/07/21/twitter-downvote-button-testing/", "via": "", "real_tags": ["ios", "回复", "replies", "twitter"]}, {"category": "", "categoryclass": "", "imagename": "460117b2cd6699cd46d6390fe77b2d7e.png", "infoid": 1068863, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "近 50 年前，英特尔创造了世界上第一个商业生产的微处理器 - 4004（参考文献 1），这是一种适度的 4 位 CPU（中央处理单元），具有 2,300 个晶体管，使用 10 μm 硅工艺技术制造，只能进行简单的算术运算计算。自从取得这一突破性成就以来，技术不断发展，越来越复杂，目前最先进的硅 64 位微处理器现在拥有 300 亿个晶体管（例如 AWS Graviton2（参考文献 2）微处理器） ，使用 7 纳米工艺技术制造）。微处理器现在如此嵌入我们的文化中，以至于它已成为一项元发明——也就是说，它是一种允许其他发明得以实现的工具，最近能够进行开发 COVID-19 疫苗所需的大数据分析在创纪录的时间内。在这里，我们报告了一个 32 位 Arm（一种精简指令集计算 (RISC) 架构）微处理器，该微处理器在柔性基板（我们称为 PlasticARM）上采用金属氧化物薄膜晶体管技术开发。与主流半导体行业不同，柔性电子产品在一个通过超薄外形、一致性、极低成本和大规模生产潜力与日常物品无缝集成的领域内运行。 PlasticARM 率先将数十亿个低成本的超薄微处理器嵌入到日常用品中。与传统半导体器件不同，柔性电子器件构建在纸张、塑料或金属箔等基板上，并使用有机物或金属氧化物或非晶硅等有源薄膜半导体材料。与晶体硅相比，它们具有许多优势，包括薄度、一致性和低制造成本。薄膜晶体管 (TFT) 可以在柔性基板上制造，其加工成本比在晶体硅晶片上制造的金属氧化物半导体场效应晶体管 (MOSFET) 低得多。 TFT 技术的目标不是取代硅。随着这两种技术的不断发展，硅很可能会在性能、密度和功率效率方面保持优势。然而，TFT 使电子产品具有新颖的外形和硅无法实现的成本点，从而极大地扩展了潜在应用的范围。微处理器是每个电子设备的核心，包括智能手机、平板电脑、笔记本电脑、路由器、服务器、汽车，以及最近构成物联网的智能对象。尽管传统的硅技术已将至少一个微处理器嵌入到地球上的每一个“智能”设备中，但它面临着使日常物品变得更智能的关键挑战，例如瓶子（牛奶、果汁、酒精或香水）、食品包装、服装、可穿戴贴片、绷带等等。成本是阻碍传统硅技术在这些日常用品中可行的最重要因素。尽管硅制造的规模经济有助于显着降低单位成本，但微处理器的单位成本仍然高得令人望而却步。此外，硅芯片本身并不薄、柔韧和贴合，所有这些都是这些日常用品中嵌入式电子产品非常理想的特性。另一方面，柔性电子产品确实提供了这些理想的特性。在过去的 20 年中，柔性电子产品已经发展到提供成熟的低成本、薄型、柔性和适应性强的设备，包括传感器、存储器、电池、发光二极管、能量收集器、近场通信/射频识别和印刷电路比如天线。这些是构建任何智能集成电子设备的基本电子元件。缺少的部分是灵活的微处理器。尚无可行的柔性微处理器存在的主要原因是，需要在柔性基板上集成相对大量的 TFT 以执行任何有意义的计算。这在新兴的柔性 TFT 技术之前是不可能的，其中需要一定程度的技术成熟度才能进行大规模集成。一种中间方法是将基于硅的微处理器芯片集成到柔性基板上——也称为混合集成 3、4、5——其中硅晶圆被减薄，并将来自晶圆的芯片集成到柔性基板上。尽管薄硅芯片集成提供了一种短期解决方案，但该方法仍然依赖于传统的高成本制造工艺。因此，对于预计在未来 10 年和 6 年之后生产数十亿个日常智能对象来说，它不是可行的长期解决方案。我们的方法是使用灵活的电子制造技术在本机开发微处理器，也称为本机灵活的处理引擎 7. 我们用来构建此处描述的本机灵活的微处理器的灵活电子技术由聚酰亚胺基板上的金属氧化物 TFT 组成。金属氧化物 TFT 成本低，还可以缩小到大规模集成所需的更小的几何尺寸 8. 早期原生灵活的处理器工作基于开发 8 位 CPU（参考文献 9、10、11、12），使用低温多晶硅 TFT 技术，制造成本高，横向可扩展性差 8. 最近，基于二维材料的晶体管已被用于开发处理器，例如使用二硫化钼 (MoS 2) 的 1 位 CPU晶体管 13 和由互补碳纳米管晶体管构建的 16 位 RISC-V CPU 14。然而，这两项工作都是在传统的硅晶片上而不是在柔性基板上进行演示的。\n构建基于金属氧化物 TFT 的处理元件的第一次尝试是一个 8 位算术逻辑单元，它是 CPU 的一部分，与在聚酰亚胺 15、16 上制造的印刷可编程 ROM 相结合。 最近，Ozer 等阿尔。 7、17、18 展示了金属氧化物 TFT 中本机灵活的专用机器学习硬件。尽管机器学习硬件 18 具有最复杂的柔性集成电路 (FlexIC)，该集成电路由金属氧化物 TFT 构建，大约有 1,400 个门，但 FlexIC 不是微处理器。可编程处理器方法比机器学习硬件更通用，并支持丰富的指令集，可用于对从控制代码到数据密集型应用程序（包括机器学习算法）的各种应用程序进行编程。原生灵活的微处理器包含三个主要组件——(1) 32 位 CPU，(2) 包含 CPU 和 CPU 外围设备的 32 位处理器，以及 (3) 片上系统 (SoC)包含处理器、存储器和总线接口——所有这些都是在柔性基板上用金属氧化物 TFT 制造的。原生灵活的 32 位处理器源自支持 Armv6-M 架构 19（一组丰富的 80 多条指令）的 Arm Cortex-M0+ 处理器和用于软件开发的现有工具链（例如，编译器、调试器、链接器、集成开发环境等）。整个原生灵活的 SoC 称为 PlasticARM，能够从其内部存储器运行程序。 PlasticARM 包含 18,334 个 NAND2 等效门，这使其成为在柔性基板上使用金属氧化物 TFT 构建的最复杂的 FlexIC（至少比以前的集成电路复杂 12 倍）。 PlasticARM 的芯片架构如图 1a 所示。它是一个 SoC，包括一个源自 32 位 Arm Cortex-M0+ 处理器产品 20 的 32 位处理器、存储器、系统互连结构和接口块，以及一个外部总线接口。 a, SoC 架构，显示了内部结构、处理器和系统外设。该处理器包含一个 32 位 Arm Cortex-M CPU 和一个嵌套向量中断控制器 (NVIC)，并通过互连结构 (AHB-LITE) 连接到其内存。最后，外部总线接口提供通用输入输出 (GPIO) 接口以与测试框架进行片外通信。 b、PlasticARM 中使用的 CPU 与 Arm Cortex-M0+ CPU 的特性相比。两款 CPU 都完全支持 Armv6-M 架构，具有 32 位地址和数据能力，以及来自整个 16 位 Thumb 和 32 位 Thumb 指令集架构子集的总共 86 条指令。 CPU 微体系结构具有两级流水线。寄存器在 Cortex-M0+ 的 CPU 中，但在 PlasticARM 中，寄存器被移动到 SoC 中基于锁存器的 RAM 中，以节省 Cortex-M 的 CPU 面积。最后，两个 CPU 彼此二进制兼容，并且与同一架构系列中的其他 CPU 兼容。 c，PlasticARM 的die layout，表示Cortex-M 处理器、ROM 和RAM 等白框中的关键块。 d，PlasticARM 的模具显微照片，显示模具和核心区域的尺寸。该处理器完全支持 Armv6-M 指令集架构，这意味着为 Cortex-M0+ 处理器生成的代码也将在派生自它的处理器上运行。处理器由 CPU 和与 CPU 紧密耦合的嵌套向量中断控制器 (NVIC) 组成，用于处理来自外部设备的中断。 SoC 的其余部分由存储器（ROM/RAM）、AHB-LITE 互连结构（高级高性能总线 (AHB) 规范的一个子集）和将存储器连接到处理器的接口逻辑以及最后一个外部用于控制两个通用输入输出 (GPIO) 引脚以进行片外通信的总线接口。 ROM 包含 456 字节的系统代码和测试程序，并已实现为组合逻辑。 128 字节的 RAM 已实现为基于锁存器的寄存器文件，主要用作堆栈。图 1b 显示了 PlasticARM 中使用的 Cortex-M 和 Arm Cortex-M0+ 的比较。尽管PlasticARM中的Cortex-M处理器不是标准产品，但它实现了支持16位Thumb和32位Thumb指令集架构子集的Armv6-M架构，因此它与所有Cortex- M 类处理器，包括 Cortex-M0+，属于同一架构系列。 PlasticARM 中的 Cortex-M 和 Cortex-M0+ 之间的主要区别在于，我们将 SoC 中 RAM 的特定部分分配给 CPU 寄存器（大约 64 字节），并将它们从 CPU 移动到 Cortex-M 中的 RAM在 PlasticARM 中，而在 Cortex-M0+ 中，寄存器保留在其 CPU 中。通过从 CPU 中消除寄存器并使用现有 RAM 作为寄存器空间，CPU 面积大幅减少（约 3 倍），代价是寄存器访问速度变慢。\nPlasticARM 是使用行业标准芯片实现工具通过 PragmatIC 的 0.8-μm 工艺实现的。我们已经为此技术开发了一个工艺设计套件、一个标准单元库和设备/电路模拟，以实现 PlasticARM FlexIC。图 1c 显示了 FlexIC 布局，其中划分了 Cortex-M 处理器、RAM 和 ROM。实施方法的详细信息可以在方法中找到。 PlasticARM 是使用商业“盒装工厂”生产线 FlexLogIC 21 制造的，其芯片显微照片如图 1d 所示。该工艺使用基于氧化铟镓锌 (IGZO) 的 n 型金属氧化物 TFT 技术，并在 200 毫米直径的聚酰亚胺晶片上生成 FlexIC 设计。 IGZO TFT 电路是使用传统的半导体加工设备制成的，这些设备适用于和配置为在厚度小于 30 μm 的柔性（聚酰亚胺）基板上生产器件。它们的沟道长度为 0.8 μm，最小电源电压为 3 V。 n 型金属氧化物薄膜技术的设计面临着许多相同的挑战，这些挑战影响了第一个硅（负沟道）的复杂性和良率1970 年代和 1980 年代初期的金属氧化物半导体 (NMOS) 技术，尤其是噪声容限差、功耗高和工艺变化大（例如 V t）。制造方法的细节可以在方法中找到。我们报告了一个功能齐全的 PlasticARM FlexIC。这已经通过在制造之前运行预编程（硬连线）到 ROM 中的三个测试程序来证明。虽然测试程序是从 ROM 执行的，但这不是系统的要求；它只是简化了 PlasticARM 的测试设置。当前的 ROM 实现不允许在制造后更改或更新程序代码，尽管这在未来的实现中是可能的（例如，通过可编程 ROM）。测试程序的编写方式使得指令执行 CPU 内部的所有功能单元，例如算术逻辑单元、加载/存储单元和分支单元，并使用 armcc 编译器使用设置为“cortex-m0plus”的 CPU 标志进行编译&#39;。测试程序的流程图和详细描述如图 2 所示。当每个测试程序完成其执行时，测试程序的结果通过片外输出 GPIO 引脚传输到测试框架。 a, 一个简单的累加程序从 ROM 中读取值并将它们相加。如果总和与预期值匹配，则会向测试仪读取的 GPIO 输出引脚发送确认信号。该测试使用加载、添加、比较和分支指令。 b，一组 32 位整数值被即时写入 RAM 并在检查读取值与预期值的同时将它们读回。如果所有写入的值都被正确读取，则会向 GPIO 输出引脚发送确认信号。该测试使用加载、存储、添加、移位、逻辑、比较和分支指令。 c、从测试仪通过GPIO输入引脚连续读取一个值。该值被一个常量值屏蔽。如果屏蔽结果为 1，则计数器递增。如果为 0，则计数器复位。如果计数器值等于预期值，则会向 GPIO 输出引脚发送确认信号。该测试使用加载、存储、添加、逻辑、比较和分支指令。斜体字表示测试程序中的变量；粗体和大写的术语是引脚和记忆。众所周知，IGZO TFT 可以弯曲到 3 毫米的曲率半径而不会损坏 22，PragmatIC 还通过将其自己的电路反复弯曲到这个曲率半径来验证这一点。然而，所有 PlasticARM 测量都是在柔性晶圆保留在其玻璃载体上的情况下进行的，使用位于 Arm Ltd 的标准晶圆测试设备，在室温下进行。 PlasticARM 的测量结果与其模拟结果进行了验证。测量设置、结果及其对模拟的验证的详细信息可以在方法中找到。 PlasticARM 的实现和测量电路特性如表 1 所示，并与使用金属氧化物 TFT 7、16、18 构建的以前最好的原生柔性集成电路进行了比较。PlasticARM 的面积为 59.2 mm 2（无焊盘），并包含 56,340 个器件（n 型 TFT 加电阻器）或 18,334 个 NAND2 等效门，至少比之前最好的集成电路（即二进制神经网络 (BNN) FlexIC）高出 12 倍。微处理器的时钟频率最高可达 29 kHz，功耗仅为 21 mW，主要是 (&gt;99%) 静态功耗，其中处理器占 45%，存储器占 33%，外设占 22%。 SoC 使用 28 个引脚，包括时钟、复位、GPIO、电源和其他调试引脚。此设计中没有使用专门的静电放电缓解技术。相反，所有输入都包含 140pF 电容器，而所有输出都由带有有源上拉晶体管的输出驱动器驱动。\n任何电阻负载技术的一个关键挑战是功耗。我们预计我们正在开发的低功耗单元库将支持更高的复杂性，高达约 100,000 个门。迁移到超过 1,000,000 个门可能需要互补金属氧化物半导体 (CMOS) 技术。我们已经报道了一种原生灵活的 32 位微处理器 PlasticARM，它采用 0.8 微米金属氧化物 TFT 技术制造。我们已经演示了 SoC 的功能，该 SoC 具有在柔性基板上制造的 32 位 Arm 处理器。由于它与 Armv6-M 架构中的 Arm Cortex-M 类处理器兼容，因此它可以搭载现有的软件/工具支持（例如编译器），因此无需开发软件工具链。最后，据我们所知，它是迄今为止使用金属氧化物 TFT 构建的最复杂的柔性集成电路，包括超过 18,000 个门，至少比以前最好的集成电路高 12 倍。我们设想，PlasticARM 将率先开发低成本、完全灵活的智能集成系统，以实现“万物互联”，包括在未来十年内将超过一万亿个无生命物体集成到数字世界中。拥有用于日常物品的超薄、可整合、低成本、本机灵活的微处理器将揭示创新，从而带来各种研究和商业机会。为了充分利用现代硅集成电路设计流程提供的高度自动化、快速周转的实现和验证，我们开发了一个小型标准单元库。标准单元库是预先验证的小型构建块的集合，可以使用复杂的电子设计自动化工具（如综合、布局和布线）快速轻松地构建更大、更复杂的设计。在开始实施标准单元库之前，先进行了一些初步调查，以便在目标技术的限制下确定最适合该库的标准单元架构。单元架构是库中每个单元共有的一组特征，例如单元高度、电源带尺寸、布线网格等，它们允许单元以标准方式咬合在一起以形成更大的结构。这些共同特征主要受制造过程的设计规则支配，但也受最终设计的性能和面积要求的影响。一旦建立了单元架构，下一步就是确定单元库的内容，不仅要考虑各种逻辑功能，还要确定每个逻辑功能的驱动强度变体的数量。由于设计、实施和表征每个标准单元所涉及的工作量很大，因此决定使用小型原型库进行一些试验，然后根据需要扩展库。为了评估这个小型原型标准单元库的性能，实施、制造和测试了一些简单的代表性电路（例如环形振荡器、计数器和移位阵列）。我们从 1.0-μm 设计规则迁移到新的 FlexIC 0.8-μm 设计规则以减少面积，从而提高产量。由于这意味着用更小的晶体管重新绘制库中的每个单元，我们也借此机会更改了标准单元架构，以包括 MT1（金属跟踪 1）引脚，以便路由器更容易连接单元。电阻材料的改进（更高的薄层电阻，R s）也使电阻器的尺寸减小了 3 倍。\n晶体管和电阻器尺寸的显着减小使大多数单元的面积减少了约 50%（参见扩展数据图 1），这反过来又通过减小设计的整体尺寸提高了制造良率。然而，由于仍然存在制造良率问题，我们可以通过改变标准来进一步缓解......", "note_en": "Nearly 50 years ago, Intel created the world’s first commercially produced microprocessor—the 4004 (ref.   1), a modest 4-bit CPU (central processing unit) with 2,300 transistors fabricated using 10 μm process technology in silicon and capable only of simple arithmetic calculations. Since this ground-breaking achievement, there has been continuous technological development with increasing sophistication to the stage where state-of-the-art silicon 64-bit microprocessors now have 30 billion transistors (for example, the AWS Graviton2 (ref.   2) microprocessor, fabricated using 7 nm process technology). The microprocessor is now so embedded within our culture that it has become a meta-invention—that is, it is a tool that allows other inventions to be realized, most recently enabling the big data analysis needed for a COVID-19 vaccine to be developed in record time. Here we report a 32-bit Arm (a reduced instruction set computing (RISC) architecture) microprocessor developed with metal-oxide thin-film transistor technology on a flexible substrate (which we call the PlasticARM). Separate from the mainstream semiconductor industry, flexible electronics operate within a domain that seamlessly integrates with everyday objects through a combination of ultrathin form factor, conformability, extreme low cost and potential for mass-scale production. PlasticARM pioneers the embedding of billions of low-cost, ultrathin microprocessors into everyday objects.\n     Unlike conventional semiconductor devices, flexible electronic devices are built on substrates such as paper, plastic or metal foil, and use active thin-film semiconductor materials such as organics or metal oxides or amorphous silicon. They offer a number of advantages over crystalline silicon, including thinness, conformability and low manufacturing costs. Thin-film transistors (TFTs) can be fabricated on flexible substrates at a much lower processing cost than metal–oxide–semiconductor field-effect transistors (MOSFETs) fabricated on crystalline silicon wafers. The aim of the TFT technology is not to replace silicon. As both technologies continue to evolve, it is likely that silicon will maintain advantages in terms of performance, density and power efficiency. However, TFTs enable electronic products with novel form factors and at cost points unachievable with silicon, thereby vastly expanding the range of potential applications.\n Microprocessors are at the heart of every electronic device, including smartphones, tablets, laptops, routers, servers, cars and, more recently, smart objects that make up the Internet of Things. Although conventional silicon technology has embedded at least one microprocessor into every ‘smart’ device on Earth, it faces key challenges to make everyday objects smarter, such as bottles (milk, juice, alcohol or perfume), food packages, garments, wearable patches, bandages, and so on. Cost is the most important factor preventing conventional silicon technology from being viable in these everyday objects. Although economies of scale in silicon fabrication have helped to reduce unit costs dramatically, the unit cost of a microprocessor is still prohibitively high. In addition, silicon chips are not naturally thin, flexible and conformable, all of which are highly desirable characteristics for embedded electronics in these everyday objects.\n Flexible electronics, on the other hand, does offer these desirable characteristics. Over the past two decades, flexible electronics have progressed to offer mature low-cost, thin, flexible and conformable devices, including sensors, memories, batteries, light-emitting diodes, energy harvesters, near-field communication/radio frequency identification and printed circuitry such as antennas. These are the essential electronic components to build any smart integrated electronic device. The missing piece is the flexible microprocessor. The main reason why no viable flexible microprocessor yet exists is that a relatively large number of TFTs need to be integrated on a flexible substrate in order to perform any meaningful computation. This has not previously been possible with the emerging flexible TFT technology, in which a certain level of technology maturity is required before a large-scale integration can be done.\n A midway approach has been to integrate silicon-based microprocessor dies onto flexible substrates—also called hybrid integration  3, 4, 5—where the silicon wafer is thinned and dies from the wafer are integrated onto a flexible substrate. Although thin silicon die integration offers a short-term solution, the approach still relies on conventional high-cost manufacturing processes. It is, therefore, not a viable long-term solution for enabling the production of the billions of everyday smart objects expected over the next decade and beyond  6.\n Our approach is to develop the microprocessor natively using flexible electronic fabrication techniques, also termed a natively flexible processing engine  7. The flexible electronics technology we used to build the natively flexible microprocessor described here consists of metal-oxide TFTs on polyimide substrates. Metal-oxide TFTs are low cost and can also be scaled down to the smaller geometries required for large-scale integration  8.\n Early natively flexible processor works were based on developing 8-bit CPUs (refs.   9, 10, 11, 12) using low-temperature poly-silicon TFT technology, which has a high manufacturing cost and poor lateral scalability  8. Recently, two-dimensional material-based transistors have been used to develop processors such as a 1-bit CPU using molybdenum disulfide (MoS 2) transistors  13, and a 16-bit RISC-V CPU  14 built from complementary carbon nanotube transistors. However, both works were demonstrated on a conventional silicon wafer rather than on a flexible substrate.\n The first attempt to build a metal-oxide TFT-based processing element is an 8-bit arithmetic logic unit, which is a part of the CPU, coupled with a print-programmable ROM fabricated on polyimide  15, 16. Very recently, Ozer et al.  7, 17, 18 presented natively flexible dedicated machine learning hardware in metal-oxide TFTs. Although the machine learning hardware  18 had the most complex flexible integrated circuit (the FlexIC) built with metal-oxide TFTs at around 1,400 gates, the FlexIC was not a microprocessor. A programmable processor approach is more generic than machine learning hardware, and supports a rich set of instructions that can be used to program a wide variety of applications from control codes to data-intensive applications including machine learning algorithms.\n There are three major components of the natively flexible microprocessor—(1) a 32-bit CPU, (2) a 32-bit processor containing a CPU and CPU peripherals, and (3) a system-on-a-chip (SoC) containing the processor, memories and bus interfaces—all fabricated with metal-oxide TFTs on a flexible substrate. The natively flexible 32-bit processor is derived from the Arm Cortex-M0+ processor supporting the Armv6-M architecture  19 (a rich set of 80+ instructions) and existing toolchain for software development (for example, compilers, debuggers, linkers, integrated development environments and so on). The entire natively flexible SoC, called PlasticARM, is capable of running programs from its internal memory. PlasticARM contains 18,334 NAND2 equivalent gates, which makes it the most complex FlexIC (at least 12× more complex than previous integrated circuits) that has been ever built with metal-oxide TFTs on a flexible substrate.\n The chip architecture of PlasticARM is shown in Fig.  1a. It is a SoC comprising a 32-bit processor derived from the 32-bit Arm Cortex-M0+ processor product  20, memories, system interconnect fabric and interface blocks, and an external bus interface.\n a, The SoC architecture, showing the internal structure, the processor and system peripherals. The processor contains a 32-bit Arm Cortex-M CPU and a Nested Vector Interrupt Controller (NVIC), and is connected to its memory through the interconnect fabric (AHB-LITE). Finally, the external bus interface provides a General-Purpose Input-Output (GPIO) interface to communicate off-chip with the test framework.  b, Features of the CPU used in PlasticARM compared to those of the Arm Cortex-M0+ CPU. Both CPUs fully support Armv6-M architecture with 32-bit address and data capabilities and a total of 86 instructions from the entire 16-bit Thumb and a subset of 32-bit Thumb instruction set architecture. The CPU microarchitecture has a two-stage pipeline. The registers are in the CPU of the Cortex-M0+, but in the PlasticARM the registers are moved to the latch-based RAM in the SoC to save the CPU area of the Cortex-M. Finally, both CPUs are binary compatible with each other and to other CPUs in the same architecture family.  c, The die layout of PlasticARM, denoting the key blocks in white boxes such as the Cortex-M processor, ROM and RAM.  d, The die micrograph of PlasticARM, showing the dimensions of the die and core areas.\n This processor fully supports the Armv6-M instruction set architecture, which means that the code generated for a Cortex-M0+ processor will also run on the processor derived from it. The processor comprises the CPU and a Nested Vector Interrupt Controller (NVIC) tightly coupled to the CPU, handling interrupts from external devices.\n The rest of the SoC consists of memories (ROM/RAM), the AHB-LITE interconnect fabric (a subset of the advanced high-performance bus (AHB) specification) and interface logic to connect the memories to the processor, and finally an external bus interface that is used to control two General-Purpose Input-Output (GPIO) pins to communicate off-chip. The ROM contains 456 bytes of system code and test programs, and has been implemented as combinational logic. The 128 bytes of RAM has been implemented as a latch-based register file and is mainly used as a stack.\n Figure  1b shows the comparison of the Cortex-M used in PlasticARM and the Arm Cortex-M0+. Although the Cortex-M processor in PlasticARM is not a standard product, it implements the Armv6-M architecture supporting the 16-bit Thumb and a subset of the 32-bit Thumb instruction set architectures, and so it is binary compatible with all Cortex-M class processors, including Cortex-M0+, in the same architecture family. The key difference between the Cortex-M in PlasticARM and Cortex-M0+ is that we allocated a specific portion of the RAM in the SoC to the CPU registers (about 64 bytes), and moved them from the CPU to the RAM in Cortex-M in PlasticARM, whereas in Cortex-M0+ the registers remain within its CPU. A large reduction (about 3×) in CPU area is achieved by eliminating the registers from the CPU and using the existing RAM for register space, at the cost of slower register access.\n PlasticARM is implemented with PragmatIC’s 0.8-μm process using industry-standard chip implementation tools. We have developed a process design kit, a standard cell library and device/circuit simulations for this technology in order to implement the PlasticARM FlexIC. Figure  1c shows the FlexIC layout, where the Cortex-M processor, RAM and ROM are demarcated. The details of the implementation methodology can be found in the Methods.\n PlasticARM is fabricated using a commercial ‘fab-in-a-box’ manufacturing line, FlexLogIC  21, and its die micrograph is shown in Fig.  1d. The process uses an n-type metal-oxide TFT technology based on indium−gallium−zinc oxide (IGZO) and generates the FlexIC design on a 200-mm-diameter polyimide wafer. The IGZO TFT circuits are made using conventional semiconductor processing equipment adapted and configured to produce devices on a flexible (polyimide) substrate with a thickness of less than 30 μm. They have a channel length of 0.8 μm, and a minimum supply voltage of 3 V.\n Design in n-type metal-oxide thin-film technology is facing many of the same challenges that affected the complexity and yield of the first silicon (negative channel metal–oxide–semiconductor, NMOS) technology during the 1970s and early 1980s, in particular poor noise margin, high power consumption, and large process variation (for example,  V t). The details of the fabrication methodology can be found in the Methods.\n We report a fully functional PlasticARM FlexIC. This has been demonstrated by running the three test programs pre-programmed (hardwired) into the ROM before fabrication. Although the test programs are executed from the ROM, this is not a requirement for the system; it simply facilitates the test setup of PlasticARM. The current ROM implementation does not allow changing or updating of the program code after fabrication, although this would be possible in future implementations (for example, via programmable ROM). The test programs are written in such a way that the instructions exercise all functional units inside the CPU such as arithmetic logic units, load/store units and branch units, and are compiled with the  armcc compiler using the CPU flag set to ‘cortex-m0plus’. The flow chart and detailed description of the test programs are shown in Fig.  2. When each test program completes its execution, the result of the test program is transmitted over the output GPIO pin off-chip to the test framework.\n a, A simple accumulation program reads values from the ROM and sums them up. If the sum matches the expected value, a confirmation signal is sent to the GPIO output pin that will be read by the tester. The test uses load, add, compare and branch instructions.  b, A set of 32-bit integer values are written into the RAM on the fly and reads them back while checking the read values against expected values. If all written values are read correctly, a confirmation signal is sent to the GPIO output pin. The test uses load, store, add, shift, logic, compare and branch instructions.  c, A value is read continuously through the GPIO input pin from the tester. The value is masked with a constant value. If the masked result is 1, then a counter is incremented. If it is 0, then the counter is reset. If the counter value is equal to an expected value, then a confirmation signal is sent to the GPIO output pin. The test uses load, store, add, logic, compare and branch instructions. Terms in italics represent variables in the test programs; terms in bold and uppercase are pins and memories.\n IGZO TFTs are known to be bent to a radius of curvature of 3 mm without damage  22, which PragmatIC has also verified through repeated bending of its own circuitry to this radius of curvature. However, all PlasticARM measurements are performed while the flexible wafer remains on its glass carrier, using standard wafer test equipment located at Arm Ltd, at room temperature. The measured results of PlasticARM are validated against its simulated results. The details of the measurement setup, results and its validation against simulation can be found in the Methods.\n The implementation and measured circuit characteristics of PlasticARM are shown in Table  1, and are compared to the best previous natively flexible integrated circuits built with metal-oxide TFTs  7, 16, 18. PlasticARM has an area of 59.2 mm 2 (without pads), and contains 56,340 devices (n-type TFTs plus resistors) or 18,334 NAND2-equivalent gates, which is at least 12 times higher than the best previous integrated circuit (that is, binary neural network (BNN) FlexIC). The microprocessor can be clocked at up to 29 kHz and consumes only 21 mW, which is predominantly (&gt;99%) static power, with the processor accounting for 45%, memories 33% and peripherals 22%. The SoC uses 28 pins, which include clock, reset, GPIO, power and other debug pins. There are no dedicated electrostatic discharge mitigation techniques used in this design. Instead, all inputs contain 140-pF capacitors, whereas all outputs are driven by output drivers with active pull-up transistors.\n  A key challenge of any resistive load technology is the power consumption. We anticipate that the lower-power cell libraries we are developing will support increased complexity, up to about 100,000 gates. Moving to more than 1,000,000 gates will probably require complementary metal–oxide–semiconductor (CMOS) technology.\n We have reported a natively flexible 32-bit microprocessor, PlasticARM, fabricated with 0.8-μm metal-oxide TFT technology. We have demonstrated the functionality of a SoC that has a 32-bit Arm processor fabricated on a flexible substrate. It can piggyback on existing software/tool support (such as compilers) because of its compatibility with the Arm Cortex-M class processors in the Armv6-M architecture, so there is no need to develop a software toolchain. Finally, to our knowledge, so far it is the most complex flexible integrated circuit built with metal-oxide TFTs, comprising over 18,000 gates, which is at least 12× higher than the best previous integrated circuit.\n We envisage that PlasticARM will pioneer the development of low-cost, fully flexible smart integrated systems to enable an ‘internet of everything’ consisting of the integration of more than a trillion inanimate objects over the next decade into the digital world. Having an ultrathin, conformable, low-cost, natively flexible microprocessor for everyday objects will unravel innovations leading to a variety of research and business opportunities.\n To take full advantage of the highly automated, fast turn-around implementation and verification offered by modern silicon integrated circuit design flows, we developed a small standard cell library. A standard cell library is a collection of small pre-verified building blocks from which much larger and more complex designs can be quickly and easily built using sophisticated electronic design automation tools such as synthesis, place and route.\n Before the implementation of the standard cell library could begin, some preliminary investigations were done to determine the most suitable standard cell architecture for the library given the constraints of the target technology. The cell architecture is the set of features that are common to every cell in the library, such as cell height, power strap sizing, routeing grid and so on, which allow the cells to be snapped together in a standard way to form larger structures. These common features are largely governed by the design rules of the manufacturing process but are also influenced by the performance and area requirements of the final design.\n Once the cell architecture was established, the next step was to determine the content of the cell library not only in terms of variety of logic functions but also the number of drive strength variants of each logic function. Because the effort involved to design, implement and characterize each standard cell is substantial, it was decided to run some trials with a small prototype library and then to expand the library as required. To evaluate the performance of this small prototype standard cell library some simple representative circuits (such as ring oscillators, counters and shift arrays) were implemented, manufactured and tested.\n We migrated from 1.0-μm design rules to the new FlexIC 0.8-μm design rules to reduce area and, hence, increase yield. As this meant redrawing each cell in the library with smaller transistors, we took the opportunity also to change the standard cell architecture to include MT1 (metal-tracking 1) pins to make it easier for the router to hook up the cells. Improvements to the resistive material (higher sheet resistance,  R s) also enabled a 3× reduction in the size of the resistors.\n This dramatic reduction in both transistor and resistor size reduced the area of most cells by about 50% (see Extended Data Fig.  1), which in turn improved the manufacturing yield by bringing down the overall size of the design. However, as there were still manufacturing yield issues that we could further mitigate by changes to the standa\n......", "posttime": "2021-07-22 22:11:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "arm", "title": "原生灵活的 32 位 Arm 微处理器", "title_en": "A natively flexible 32-bit Arm microprocessor", "transed": 1, "url": "https://www.nature.com/articles/s41586-021-03625-w", "via": "", "real_tags": ["arm"]}, {"category": "", "categoryclass": "", "imagename": "51fb00d71a7c11e36c2c834ff666b301.png", "infoid": 1068862, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2021 年 7 月 20 日下午 7 点 42 分，Windows Defender 定义每日更新将著名的 DeCSS DVD 加密软件的副本作为木马进行了立即隔离，然后在 60 秒后删除。这似乎是一个误报，值得注意的只是因为它错误定位的软件非常有名。根据下面的屏幕截图，它将软件识别为 Glupteba!ml 木马，将其标记为严重威胁； Windows Defender 还将 2000 年代中期的 XFX Keygen 程序误诊为高威胁。是的，他们破解了软件，但除非问题更大，否则这是一个中到低的威胁。如果你觉得勇敢，这里是有问题的文件：DeCSS.exe &lt;— 警告！这里是龙。下载此内容的风险自负。了解风险。我保证此文件的来源如下： 它是通过 DirectConnect 从 2004 年由 2600 名附属贡献者运行的文件中心获得的。它的代码签名与乔恩·莱赫·约翰森用来签署可执行文件的大卫·福库斯（David Fawcus）在 1999 年错误使用的代码签名相匹配.另外，这里是 XFX Force Keygen 被标记为误报 高威胁 这是文件：KEYGENXFORCE.exe &lt;— 警告！这里是龙。下载此内容需您自担风险。了解风险。\n卡巴斯基没有发现任何威胁。在 VirusTotal 上，72 个引擎中有 32 个将其误认为是恶意的。 -------------------------------------------------- ----------------------------------- MpCmdRun: 命令行: mpcmdrun -restore -all 开始时间: 星期二Jul 20 2021 20:10:48MpEnsureProcessMitigationPolicy: hr = 0x1ERROR: MpQuarantineRequest failed: 名称: HackTool:Win32/Keygen!MSR, GUID: {8003F52C-0000-0000-35F804000-33500000000000000000000000000000000004000000000000000同业 失败80508014）错误：MpQuarantineRequest 失败：名称：HackTool:Win32/Keygen!MSR，GUID：{8003F52C-0000-0000-B7CE-870973926357}（80508014）错误：QuarantineRestore 失败：MpQuarantineRestore 名称：Win32P3004 /Glupteba!ml，GUID：{80040956-0000-0000-D48C-06A3EB93B95A} (80508014)ERROR：QuarantineRestore 失败 (80508014)MpCmdRun.exe：hr = 0x8056-0000-0000 20080 0x805080 2008080 :10:48---------------------------------------------- --------------------------------------- 您通过打开一个提升的 CMD 窗口来转储日志文件夹 C:\\Program Files\\Windows Defender 文件夹。然后执行 mpcmdrun -restore -listall 以列出所有被隔离的项目。使用 mpcmdrun -restore -all 来恢复所有（危险！）您会注意到我上面的日志列出了每个文件的失败代码 80508014。因此，我执行 mpcmdrun -restore -all --Path D:\\temp 将其恢复到与删除它的 NAS 不同的位置。然后数据将在 D:\\temp 中处于静止状态，直到我尝试将其复制回 Defender 在 NAS 上删除它的位置。此时它会再次删除它。 NAS 上的静态数据存在于 DS920+ Synology 上，该 Synology 具有 BRTFS 格式的 4tb Raid 1 卷。这个 NAS 卷通过 SMB 作为 Z: 驱动器在房子里的所有机器上共享。 NAS 包含其他单独的卷，为面向 Internet 的 Pi 提供服务，该 Pi 运行 Traefikv2，在单独的 VLAN 上提供多服务。\n截至今天早上 7 点 42 分，MS 推出了一项更新，似乎修复了 DeCSS 的误报。截至 21 年 7 月 21 日晚上 8 点 10 分，它仍然错误地将 XFX Keygens 识别为威胁。", "note_en": "On 7/20/2021 at 7:42pm, Windows Defender definitions daily update picked up a  copy of the famous  DeCSS DVD encryption software as a Trojan and performed an immediate quarantine, followed by deletion 60 seconds later. This appears to be a false positive, notable only because the software it is incorrectly targeting is so famous.\n It picks up the software as the    Glupteba!ml Trojan per the screenshot below, marking it as a  Severe threat;\n   Windows Defender is also misdiagnosing XFX Keygen programs from the mid-2000’s as  high threats. Yes they crack software, but that’s a medium to low threat unless the concern is something bigger.\n   If you are feeling brave, here is the file in question:   DeCSS.exe &lt;—  Warning! Here be dragons. Download this at your own risk. Know the risks.\n I vouch for the provence of this file as follows: It was acquired via  DirectConnect from a file hub run by 2600 affiliated contributors in 2004. It’s code signature matches the incorrectly used 1999 code signature of David Fawcus that  Jon Lech Johansen used to sign the executable.\n     Separately, here is the XFX Force Keygen being tagged as a false positive  High threat\n Here is the file:  KEYGENXFORCE.exe &lt;—  Warning! Here be dragons. Download this at your own risk. Know the risks.\n    Kapersky finds no threat. On  VirusTotal, 32 out of 72 engines misidentify this as malicious.\n   -------------------------------------------------------------------------------------MpCmdRun: Command Line: mpcmdrun -restore -all Start Time: ‎Tue ‎Jul ‎20 ‎2021 20:10:48MpEnsureProcessMitigationPolicy: hr = 0x1ERROR: MpQuarantineRequest failed: name: HackTool:Win32/Keygen!MSR, GUID: {8003F52C-0000-0000-33A7-F7F5B974DFEF} (80508014)ERROR: QuarantineRestore failed (80508014)ERROR: MpQuarantineRequest failed: name: HackTool:Win32/Keygen!MSR, GUID: {8003F52C-0000-0000-B7CE-870973926357} (80508014)ERROR: QuarantineRestore failed (80508014)ERROR: MpQuarantineRequest failed: name: Trojan:Win32/Glupteba!ml, GUID: {80040956-0000-0000-D48C-06A3EB93B95A} (80508014)ERROR: QuarantineRestore failed (80508014)MpCmdRun.exe: hr = 0x80508014.MpCmdRun: End Time: ‎Tue ‎Jul ‎20 ‎2021 20:10:48-------------------------------------------------------------------------------------\n You dump the log by opening an elevated CMD window in the folder  C:\\Program Files\\Windows Defender folder.\n You then execute  mpcmdrun -restore -listall to list all quarantined items. Follow that with  mpcmdrun -restore -all to restore all ( Danger!)\n You’ll notice my log above lists a failed code of  80508014 for each file. So instead I execute  mpcmdrun -restore -all --Path D:\\temp to restore it to a different location than the NAS it was deleted from.\n The data will then be fine at rest in D:\\temp until I try to copy it back to where Defender Deleted it on the NAS.  At which point it deletes it again.\n    The data at rest on the NAS lives on a DS920+ Synology with a 4tb Raid 1 volume in BRTFS format. This NAS volume is shared via SMB as the Z: drive on all machines in the house. The NAS contains other separate volumes servicing an Internet facing Pi running Traefikv2 with multipule services on a separate VLAN.\n MS Has pushed out an update that appears to fix the false positive on DeCSS as of 7:42am this morning. As of 8:10pm on 7/21/21 it is still misidentifying XFX Keygens as a threat.", "posttime": "2021-07-22 22:10:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,文件", "title": "MS Windows Defender 和 DeCSS", "title_en": "MS Windows Defender and DeCSS", "transed": 1, "url": "https://www.arch13.com/ms-windows-defender-decss/", "via": "", "real_tags": ["windows", "文件"]}, {"category": "", "categoryclass": "", "imagename": "d3bf2c6c0b91b34b569e99be6d1f73fd.jpeg", "infoid": 1068861, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一组测试人员中，用户可能会继续看到“喜欢”按钮（红心），但现在会在旁边找到一个不赞成的按钮。 Twitter 表示，在这个组中，点赞将被视为“喜欢”。 Twitter 向 TechCrunch 澄清说，只有少数测试人员会看到这些选项出现在他们的 Twitter iOS 应用程序中，并且用户的投票不会公开。该公司还表示，目前尚未使用此投票信息对回复进行排名。 （但是，如果这样的系统成为公共功能，那肯定会发生变化。）测试的目标是帮助 Twitter 了解用户在对话过程中最相关的回复类型，这是 Twitter 研究过的一段时间。根据 Twitter 用户研究员 Cody Elam 的说法，过去的研究表明，用户认为信息丰富、支持性、积极和有趣的回复是“最佳”类型的回复。然而，一些最好的回复不会很快浮出水面——Twitter 希望能够通过投票和投票功能解决这个问题。今天，我们启动了在回复中投票的实验——一种向我们反馈您认为最相关的回复的方式。 Elam 表示，该功能将允许用户私下对回复质量发表意见，而不必公开羞辱其他用户。随着时间的推移，这些数据可以帮助 Twitter 改进其对话排名系统。如果 Twitter 能够根据这些信息对回复进行实际排名，那么阅读更长的 Twitter 帖子会变得更容易、更有趣——例如那些关注病毒式推文的帖子。但它也可以帮助更好地展示回复，这些回复为对话添加了一些信息或有趣的东西，甚至只是有趣的东西，同时将任何拖钓评论推到了线程中。\n今天，Twitter 允许用户通过将它们放在额外​​的点击后面来手动隐藏有损对话的回复。也许，随着时间的推移，它也可以对收到太多反对票的回复做类似的事情——就像 Reddit 一样。但需要明确的是，这些类型的功能目前都没有经过测试。这并不是 Twitter 第一次对 Like 和 Retweet 之外的其他类型的参与按钮表现出兴趣。例如，今年早些时候，有人发现 Twitter 正在调查用户对更广泛的表情符号式反应的兴趣，类似于您在 Facebook 上发现的内容。该功能似乎已被投入开发。除了表情符号反应外，同一项调查还询问了用户对“赞成”和“反对”按钮的感受。 Twitter 表示，该测试现在仅面向 iOS 上的一小部分用户推出。", "note_en": "And in one group of testers, users may continue to see the “Like” button (the red heart) but will now find a downvote button alongside it. In this group, the upvote would count as a “Like,” Twitter said.\n Twitter clarified to TechCrunch that only a small number of testers will see these options appear in their Twitter iOS app, and users’ votes will not become public.\n   The company also said it’s not currently using this vote information to rank the replies at this time. (If, however, such a system ever become a public feature, that could certainly change.)\n The goal with the test is to help Twitter to learn what sort of replies users find most relevant during their conversations, which is something Twitter has studied for some time. According to  Twitter user researcher Cody Elam, past studies determined that users believed replies that were informative, supportive, positive and funny were the “best” types of replies. However, some of the best replies wouldn’t surface quickly enough — an issue Twitter hopes to be able to address with an upvoting and downvoting feature.\n Today, we’re launching an experiment for voting within replies — a way to give us feedback on what replies you find most relevant.\n Elam says the feature would allow users to privately voice their opinion on the replies’ quality without having to publicly shame other users. Over time, this data could help Twitter to improve its conversation ranking systems.\n If Twitter were to act on this information to actually rank the replies, it could make it easier and more enjoyable to read longer Twitter threads — like those that follow viral tweets, for example. But it could also help to better showcase the replies that add something informative or interesting or even just funny to a conversation, while pushing any trolling remarks down the thread.\n Today, Twitter allows users to manually  hide the replies that detract from a conversation by placing them behind an extra click. Perhaps, in time, it could do something similar for replies that received too many downvotes, too — like Reddit does. But none of these types of features are being tested right now, to be clear.\n This isn’t the first time Twitter has shown interest in other types of engagement buttons beyond the Like and Retweet. Earlier this year, for example, Twitter was spotted surveying users about their interest in  a broader set of emoji-style reactions, similar to what you’d find on Facebook. That feature has  since been put into development, it seems.\n The same survey had also asked users how they felt about upvote and downvote buttons, in addition to emoji reactions.\n Twitter says the test is rolling out now to a small group on iOS only.", "posttime": "2021-07-22 22:07:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "测试,tests,twitter", "title": "Twitter 测试 Reddit 风格的 upvote 和 downvote 按钮", "title_en": "Twitter tests Reddit-style upvote and downvote buttons", "transed": 1, "url": "https://techcrunch.com/2021/07/21/twitter-tests-reddit-style-upvote-and-downvote-buttons/", "via": "", "real_tags": ["测试", "tests", "twitter"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068860, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "（西部土狼的踪迹，在美国犹他州珊瑚粉沙丘的早晨沙滩上）单击此处或下图获取三个参考比例的图像，发送给照相洗印机以生成常规 4&quot; x 6&quot; 照片打印，如下图所示（或在您自己的照片打印机上打印）。在相纸上进行冲印是一个不错的选择，因为它具有高对比度、抗黄变和褪色、具有出色的分辨率（没有可见的半色调网点）、相当耐用且具有一定的防水性。它也很容易和便宜。纸张或压敏纸上的激光打印效果较差；灰色补丁通常以半色调印刷“纹理”结束，纸张会随着时间的推移和阳光照射而变黄。通过将其安装在旧尺子或类似物上，使您的参考秤更耐用。我使用从铝尺上切下的 10 厘米长的尺子，并且还在五金店的一段木制油漆搅拌棒上安装了秤。我使用薄薄的 5 分钟环氧树脂来安装秤。 （避免接触水泥，我发现甲苯溶剂会导致打印染料渗色。）一个紧凑的 10 厘米参考标尺，带有用于 2D 标尺的棋盘格、用于透视测量的圆形基准标记和用于颜色校正的灰色块，可打印在照片上- 打印机或作为常规 4&quot;x6&quot; 照片打印。 1 厘米方格的棋盘图案提供有关照片二维比例的信息。高对比度的黑白图案高度可见，很容易被观众识别为参考比例。参考刻度右侧的 2 cm 中性灰色方块用于进行颜色校正。如果照亮场景的光（包括参考比例）有偏色，则中性灰色将拾取该色偏；例如，来自蓝天的光线会使不在阳光直射下的场景呈现蓝色。 Photoshop 等照片编辑工具可以通过将已知中性对象的色彩平衡调整回中性色来消除此类色偏。在 Photoshop 中，使用曲线工具的中间吸管（有关详细信息，请参阅 Photoshop 曲线帮助）。\n警告：当参考比例是照片的一小部分时，相机镜头和内部图像处理的缺陷会导致紫边、色差和其他渗入灰色块的缺陷。在这种情况下，基于灰色补丁的色彩校正可能会非常明显地关闭。当图像被高度放大时（例如，使用 Photoshop），渗色通常是可见的。在这些情况下，有时最好使用参考比例的白色部分（使用 Photoshop 曲线工具的最右侧吸管）进行颜色校正。使用吸管时，您可以通过右键单击来控制 Photoshop 在颜色采样时使用的像素数。参考标尺的黑白部分可以用来设置照片的高低点，但通常黑色方块不会像照片的其他部分那么暗（相纸的黑色不是绝对的黑色） .带有方向和中心点标记的圆形目标可用作基准并确定相机注视它的角度。如果在场景中参考比例与水平对齐，并且如果相机保持水平（尽管可能向下或向上看），就好像通常是自然的情况一样，可以推导出参考比例的旋转角度（水平和垂直）在现实世界中，以及相机指向下方或上方的角度——所有这些都来自图像中圆形目标的形状。使用这个基于浏览器的旋转角度工具来分析图像。为了尽量减少失真，通常应该努力垂直、正面地拍摄平面场景。但是，对于倾斜拍摄的平面场景，可以使用这种基于浏览器的校正工具来转换包含参考比例的图像。图1. 使用矫正工具前后的图像（广角镜头特写） 直尺形状便于携带和存放，有助于减少磨损。\n尝试将比例尺放在与感兴趣的对象相同的平面上（这样比例尺和对象将被相机以类似的方式查看），并且在相同的光线下。从远处放大以减少相机视角在照片跨度上的变化。垂直（直接）拍摄场景以最大程度地减少透视失真。如果您无法从垂直方向拍摄场景并希望能够在以后使用基准恢复真实世界的视角信息，请将比例尺定位成与地平线齐平（与感兴趣的表面齐平）并将相机水平拍摄到地平线（尽管可能指向下方或上方）。将参考刻度存放在一个小的塑料自封袋中可以减少磨损，例如，在背包中携带时。 ABFO 2 号咬痕量表。法医工作的参考量表。售价约 7 美元。印刷相当硬的 PVC。 L 形使其更容易在背包等中损坏。 IFRAO 标准比例岩画的颜色参考比例。应澳大利亚要求分发。在中等重量的纸张上打印。防止光延迟衰减。", "note_en": "(track of a Western Coyote, on morning sand at Coral Pink Sand Dunes, Utah, USA)\n Click  here or on the image below to obtain an image of three reference scales to send to a photofinisher to produce a regular 4&#34; x 6&#34; photographic print, as pictured below (or print on your own photo-printer).\n  Photofinishing on photographic paper is a good choice because it has high contrast, resistsyellowing and fading, has excellent resolution (no visible half-tone dots), and is fairly durable andsomewhat water-resistant. It&#39;s also easy and inexpensive. Laser printing on paper orpressure-sensitive paper works less well; the grey patch often ends up with a half-tone printing &#39;grain&#39;and paper can yellow with age and sun exposure.\n Make your reference scale more durable by mounting it on a piece of old ruler or similar.I use a 10cm piece cut from an aluminum ruler, and have also mounted scales on a section of awooden paint stirring stick from hardware stores. I use a thin spread of 5-minute epoxy to mount the scale. (Avoid contact cement, I found the toluene solvent caused print dye to bleed.)\n A compact 10cm reference scale with a checkerboard for 2D scale, a circular fiducial mark for perspective measurement, and a grey patch for colour correction that is printable on a photo-printer or as a regular 4&#34;x6&#34; photographic print.\n  The checkerboard pattern of 1 cm squares provides informationabout a photograph&#39;s scale in two dimensions. The high contrast black-and-whitepattern is highly visible and is easily identified by viewers as a reference scale.\n  The 2 cm neutral grey square at the right of the reference scale is intended formaking colour corrections. If light illuminating the scene (including the reference scale)has a colour cast, the neutral grey will pick up that cast; for example, light from a blue skygives a blue cast to scenes not in direct sunlight. Photo editing tools such as Photoshopcan eliminate such colour casts by adjusting the colour balance of known-neutral objectsback to neutral colour. In Photoshop, use the middle eyedropper of theCurves tool (see Photoshop Help on Curves for more information).\n Caveats: When the reference scale is a small part of a photo, shortcomings of acamera&#39;s lens and internal image processing can cause purple fringing, chromatic aberration,and other defects that bleed into the grey patch. In such cases,colour-correction based on the grey patch may be wildly and obviously off. The bleedingis usually visible when the image is highly magnified (eg., using Photoshop). In thesesituations it is sometimes better to colour-correct using the white sections of thereference scale (with the right-most eyedropper of the Photoshop Curves tool).\n You can control how many pixels Photoshop uses when colour sampling by right-clickingwhen using the eyedropper.\n The black and white sections of the reference scale can be used to set the highand low points of a photograph, but often the black squares will not be as dark asother parts of the photo (the black of the photographic paper is not an absolute black).\n  The circular target with orientation and centerpoint markings can be used as a fiducial andto determine the angle of the camera&#39;s gaze upon it. If in a scene the reference scale was aligned tohorizontal, and if the camera was held horizontal (though possibly looking down or up), as if often naturallythe case, it&#39;s possible to deduce the angles of rotation (horizontal and vertical)of the reference scale in the real world, and the angle by which the camera was pointing down or up --all that from just the shape of the circular target in your image. Use this browser-based  angles of rotation tool to analyse an image.\n To minimize distortion, normally one should strive to photograph planar scenes perpendicularly, face-on. However,for planar scenes photographed obliquely, this browser-based   rectification tool can be usedto transform an image containing the reference scale.\n Fig 1. Image (close-up with wide angle lens) before and after use of rectification tool\n  The straight-rule shape makes it easy to carry and stow, and helps reduce wear and tear.\n  Try to put the scale into the same plane as the object(s) of interest (so that thescale and the objects will be viewed similarly by the camera), and in the same light. Zoom in from a distance to reduce variations in the camera&#39;s angle of view across the span of the photograph. Photograph perpendicularly (straight on) to a scene to minimize perspective distortion. If you can&#39;t photograph the scene from the perpendicular and want to be able to laterrecover real-world angle-of-gaze information using the fudicial, position the scale so that it is levelwith the horizon (flush with the surface of interest) and shootwith the camera level to the horizon (though possibly pointing down or up). Storing the reference scale in a small plastic ziplock bag reduces abrasion, eg., when carryingit in a backpack.\n     ABFO No 2 Bite Mark Scale. A reference scale for forensic work. Sold for about US$7. Printed onfairly stiff PVC. L-shape makes it more susceptible to damage in backpacks, etc.\n IFRAO Standard ScaleA colour reference scale for rock art. Distributed upon request from Australia. Printed onmedium-weight paper. Protection from light delays fading.", "posttime": "2021-07-22 22:07:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "摄影,参考,reference", "title": "摄影参考量表（2019）", "title_en": "Photographic Reference Scale (2019)", "transed": 1, "url": "https://smallpond.ca/jim/scale/", "via": "", "real_tags": ["摄影", "参考", "reference"]}, {"category": "", "categoryclass": "", "imagename": "4f3c84b1cbb5f8081dcc0cf3aa43629b.png", "infoid": 1068859, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "用法：更聪明的 [OPTION...] --image path-to-kernel-imagewiser - 非常小的 2 型 Linux 管理程序。总有一天会启动你的unikernel/linux。 -c, --vcpu 虚拟机的 CPU 数量 -i, --image=IMAGE linux 内核 bzImage -r, --memory 虚拟机的内存大小 -v, --verbose 生成详细输出 - ?, --help Give此帮助列表 --usage 给出简短的使用消息 -V, --version 打印程序版本的强制或可选参数对于任何相应的短选项，长选项的强制或可选参数也是强制性的或可选的。更明智的/问题。 linux 内核 bzImage 的路径。 bzImage 文件采用特定格式。它包含连接的 bootsect.o + setup.o + misc.o + piggy.o。", "note_en": "Usage: wiser [OPTION...] --image path-to-kernel-imagewiser - Extremely tiny type-2 hypervisor  for linux. Will boot yourunikernel/linux someday. -c, --vcpu Number of cpu  for your vm -i, --image=IMAGE linux kernel bzImage -r, --memory Ram size  for your vm -v, --verbose Produce verbose output - ?, --help Give this  help list --usage Give a short usage message -V, --version Print program versionMandatory or optional arguments to long options are also mandatory or optional for any corresponding short options.Report bugs to https://github.com/flouthoc/wiser/issues.\n  Path to linux kernel bzImage. The bzImage file is in a specific format. It contains concatenated  bootsect.o + setup.o + misc.o + piggy.o.", "posttime": "2021-07-22 22:07:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,程序,虚拟机,启动,minimal", "title": "Wiser – 最小的虚拟机管理程序启动 Linux VM。用 C 写的", "title_en": "Wiser – minimal hypervisor boots Linux VM. Written in C", "transed": 1, "url": "https://github.com/flouthoc/wiser", "via": "", "real_tags": ["linux", "程序", "虚拟机", "启动", "minimal"]}, {"category": "", "categoryclass": "", "imagename": "09688fc1b52ff447707452bb5b0217ef.jpg", "infoid": 1068857, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航 跳转到搜索 术语 Pfeilstorch（德语中的“箭鹳”）指的是在非洲越冬时被箭伤的鹳，然后返回欧洲时箭插在身体上。迄今为止，已记录了大约 25 个 Pfeilstörche。第一个也是最著名的 Pfeilstorch 是 1822 年在德国梅克伦堡-前波美拉尼亚州克吕茨村附近发现的白鹳。它的脖子上挂着一根来自中非的 30 英寸（76 厘米）长矛。 [1] 标本被塞满，今天可以在罗斯托克大学的动物收藏中看到。因此，它被称为 Rostocker Pfeilstorch。 [2] [3] [4] 这种 Pfeilstorch 对了解欧洲鸟类的迁徙至关重要。在了解迁徙之前，人们一直在努力解释白鹳和家燕等鸟类每年突然消失的原因。除了迁徙，当时的一些理论认为，它们在冬天会变成其他种类的鸟、老鼠或在水下冬眠，这种理论甚至被当时的动物学家所传播。 [5] [6] [7] Rostocker Pfeilstorch 特别证明了鸟类长距离迁徙到越冬地。 [8] ^ Fone, Martin（2020 年 1 月 11 日）。 “好奇的问题：一只脖子上插着长矛的鹳是如何解开鸟类迁徙之谜的？”。 countrylife.co.uk. ^ “Zoologische Sammlung der Universität Rostock”（德语）。原始档案于 2011 年 10 月 2 日存档。^“罗斯托克大学动物收藏传单”(PDF)。 2012 年 3 月 22 日从原始文件 (PDF) 存档。^ &quot;Der Sproessling 3&quot; (PDF)（德语）。 2014 年 11 月 25 日从原件 (PDF) 存档。\n^ 考克，马克；梅比，理查德（2005 年）。鸟大不列颠。查托和温达斯。页。 315. ISBN 0-7011-6907-9。哈根，H. (1975)。 “Beobachtung eines Pfeilstorches in Ost-Afrika” [白鹳 (Ciconia ciconia)，在东非看到它的身体伸出箭头]。 Ornithologische Mitteilungen（德语）。 27 (5): 111–112。", "note_en": "Jump to navigation  Jump to search  The term    Pfeilstorch (German for &#34;arrow stork&#34;) is given to  storks injured by an  arrow while wintering in  Africa, before returning to  Europe with the arrow stuck in their bodies. To date, around 25   Pfeilstörche have been documented.\n The first and most famous   Pfeilstorch was a  white stork found in 1822 near the  German village of  Klütz, in the state of  Mecklenburg-Vorpommern. It was carrying a 30-inch (76 cm) spear from  central Africa in its neck.  [1] The specimen was stuffed and can be seen today in the  zoological collection of the  University of Rostock. It is therefore referred to as the   Rostocker Pfeilstorch.  [2]  [3]  [4]\n This   Pfeilstorch was crucial in understanding the  migration of European birds. Before migration was understood, people struggled to explain the sudden annual disappearance of birds like the white stork and  barn swallow. Besides migration, some theories of the time held that they turned into other kinds of birds, mice, or hibernated underwater during the winter, and such theories were even propagated by  zoologists of the time.  [5]  [6]  [7] The   Rostocker Pfeilstorch in particular proved that birds migrate long distances to wintering grounds.  [8]\n  ^   Fone, Martin (11 January 2020).  &#34;Curious Questions: How did a stork with a spear through its neck solve the mystery of the migration of birds?&#34;.  countrylife.co.uk .\n ^     &#34;Zoologische Sammlung der Universität Rostock&#34; (in German). Archived from  the original on 2 October 2011.\n ^     &#34;Flyer for the Rostock University Zoological Collection&#34;  (PDF). Archived from  the original  (PDF) on 22 March 2012.\n ^     &#34;Der Sproessling 3&#34;  (PDF) (in German). Archived from  the original  (PDF) on 25 November 2014.\n ^    Cocker, Mark;  Mabey, Richard (2005).  Birds Britannica. Chatto &amp; Windus. p. 315.  ISBN   0-7011-6907-9.\n  Hagen, H. (1975). &#34;Beobachtung eines Pfeilstorches in Ost-Afrika&#34; [White Stork (Ciconia ciconia) with arrow protruding from its body seen in East Africa].  Ornithologische Mitteilungen (in German).  27 (5): 111–112.", "posttime": "2021-07-22 22:06:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "pfeilstorch,迁徙", "title": "箭鹳", "title_en": "Pfeilstorch", "transed": 1, "url": "https://en.wikipedia.org/wiki/Pfeilstorch", "via": "", "real_tags": ["迁徙"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068856, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每年左右，有些事情迫使我重新开始一个新的操作系统映像。最近，那是一起不幸的水瓶事件。再一次，我需要从互联网上撤下我的数字生活。该博客的代码和资产目前位于一个 500 MB 的 Git 存储库中，该存储库托管在 Bitbucket 上直到今天早些时候。让我们尝试克隆它！ evantodd@HW-0063 ~ % git clone git@bitbucket.org:etodd/etodd.io.gitCloning 到 &#39;etodd.io&#39;...remote: 枚举对象: 2237, done.remote: 计数对象: 100% (2237/ 2237 ), done.remote: Compressing objects: 99% (1885/1903 ) # hang git clone https://etodd@bitbucket.org/etodd/etodd.io.gitCloning into &#39;etodd.io&#39;... &#39;的密码https://etodd@bitbucket.org&#39;：远程：枚举对象：2237，done.remote：计数对象：100%（2237/2237），done.remote：压缩对象：100%（1903/1903），完成。接收对象：22% (507/2237), 20.75 MiB | 278.00 KiB/s # hang evantodd@HW-0063 ~ % git clone --depth 1 git@bitbucket.org:etodd/etodd.io.gitCloning into &#39;etodd.io&#39;...remote：枚举对象：928，完成。 remote：计数对象：100% (928/928)，done.remote：压缩对象：100% (895/895)，完成。 # hang evantodd@HW-0063 ~ % git clone --depth 1 https://etodd@bitbucket.org/etodd/etodd.io.gitCloning into &#39;etodd.io&#39;...remote：枚举对象：928，完成。远程：计数对象：100％（928/928），done.remote：压缩对象：100％（895/895），done.error：RPC失败； curl 56 LibreSSL SSL_read: SSL_ERROR_SYSCALL, errno 54fetch-pack: 读取边带数据包时意外断开连接fatal: early EOFfatal: index-pack failed 好吧，Bitbucket，我明白是怎么回事了。是时候点击“提供反馈”按钮了。但这是什么？\n50 分钟免费构建时间？？我敢打赌，那段时间我可以搞点恶作剧。我想知道他们有哪些可用的模板... Jackpot。至关重要的是，用于设置我的第一个管道的小型 Web 安装程序让我可以直接在浏览器中编辑管道 YAML 文件并直接提交。好东西，因为我无法克隆它存储库能够提交给它。删除一堆 npm 废话后，我留下了这个管道 YAML: image: node:10.15.3 pipelines: default: - step: name: Exfiltrate!!脚本：-管道：atlassian/aws-s3-deploy：0.4.4 变量：S3_BUCKET：&#39;etodd.io&#39; LOCAL_PATH：&#39;.&#39; 5 分钟后，我有了一个 S3 存储桶和一个新的 AWS IAM 用户。将该宝贝插入存储库设置。 evantodd@HW-0063 ~ % mkdir etodd.ioevantodd@HW-0063 ~ % AWS_ACCESS_KEY_ID =xxx AWS_REGION =us-west-1 AWS_SECRET_ACCESS_KEY =xxx aws s3 cp s3://etodd.io/ ./etodd@HW-0063 HW-0063 ~ % cd etodd.ioevantodd@HW-0063 etodd.io % git statusRefresh index: 100% (899/899 ), done.On 分支 master 你的分支是最新的，&#39;origin/master&#39;。没有什么可提交的，工作树清洁 evantodd@HW-0063 etodd.io % git remote rm originevantodd@HW-0063 etodd.io % git remote add origin git@github.com:etodd/etodd.io.gitevantodd@HW-0063 etodd.io % git push --set-upstream origin mainEnumering objects: 1353, done.Counting objects: 100% (1353/1353 ), done.Delta 压缩使用最多 12 个线程压缩对象: 100% (976/976 ), done.Writing objects: 100 % (1353/1353), 324.57 MiB | 1.17 MiB/s, done.Total 1353 (delta 340 ), reused 1353 (delta 340 ), pack-reused 0remote: Resolving deltas: 100% (340/340 ), done.To github.com:etodd/etodd.io。混蛋！ [远程拒绝] main -&gt; main（不允许浅更新）错误：无法将一些引用推送到“github.com:etodd/etodd.io.git” 当然！ Bitbucket 构建代理使用 --depth 50 克隆了 repo，因此它没有完整的 Git 历史记录。但也许现在我已经下载了大部分 repo，我可以从 Bitbucket 获取其余部分？\nevantodd@HW-0063 etodd.io % git fetch --unshallow https://etodd@bitbucket.org/etodd/etodd.io.gitPassword for &#39;https://etodd@bitbucket.org&#39;：远程：枚举对象：1035 , done.remote: Counting objects: 100% (1035/1035 ), done.remote: Compressing objects: 100% (642/642), done.error: RPC failed; curl 56 LibreSSL SSL_read：SSL_ERROR_SYSCALL，errno 54fetch-pack：读取边带数据包时意外断开连接致命：早期EOFFatal：索引包失败如此接近！事实证明，您还可以加深浅层克隆，而无需一直使用 git fetch --depth N。通过反复试验，我不断增加深度，一点一点地下载 repo。最后，最后一次 git fetch --unshallow 就完成了。我写了这篇文章，提交，推送到 Github，将 Netlify 指向新的 repo，现在你已经了解了一些事情。如果您需要从 Bitbucket 中获取代码，我希望这会有所帮助。", "note_en": "Every year or so, something compels me to start over with a fresh OS image.Most recently, that something was an unfortunate water bottle incident.Once again, I need to pull down my digital life from the internet.\n The code and assets for this blog currently live in a 500 MB Git repository, which was hosted on Bitbucket until earlier today.Let&#39;s try cloning it!\n evantodd@HW-0063 ~ % git clone git@bitbucket.org:etodd/etodd.io.gitCloning into  &#39;etodd.io&#39;...remote: Enumerating objects: 2237,  done.remote: Counting objects: 100%  (2237/2237 ),  done.remote: Compressing objects: 99%  (1885/1903 ) # hang\n  git clone https://etodd@bitbucket.org/etodd/etodd.io.gitCloning into  &#39;etodd.io&#39;...Password  for  &#39;https://etodd@bitbucket.org&#39;: remote: Enumerating objects: 2237,  done.remote: Counting objects: 100%  (2237/2237 ),  done.remote: Compressing objects: 100%  (1903/1903 ),  done.Receiving objects: 22%  (507/2237 ), 20.75 MiB | 278.00 KiB/s  # hang\n  evantodd@HW-0063 ~ % git clone --depth  1 git@bitbucket.org:etodd/etodd.io.gitCloning into  &#39;etodd.io&#39;...remote: Enumerating objects: 928,  done.remote: Counting objects: 100%  (928/928 ),  done.remote: Compressing objects: 100%  (895/895 ),  done. # hang\n  evantodd@HW-0063 ~ % git clone --depth  1 https://etodd@bitbucket.org/etodd/etodd.io.gitCloning into  &#39;etodd.io&#39;...remote: Enumerating objects: 928,  done.remote: Counting objects: 100%  (928/928 ),  done.remote: Compressing objects: 100%  (895/895 ),  done.error: RPC failed; curl  56 LibreSSL SSL_read: SSL_ERROR_SYSCALL, errno  54fetch-pack: unexpected disconnect  while reading sideband packetfatal: early EOFfatal: index-pack failed\n   Alright, Bitbucket, I see how it is. Time for me to hit the &#34;Give feedback&#34; button. But what&#39;s this?\n  50 free build minutes?? I bet I could get up to some mischief in that time. I wonder what templates they have available...\n  Jackpot.Crucially, the little web installer for setting up my first pipeline lets me edit the pipeline YAML file right in the browser and commit it directly.Good thing, since I can&#39;t clone this repository to be able to commit to it.After deleting a bunch of npm nonsense, I&#39;m left with this pipeline YAML:\n image:  node:10.15.3 pipelines:  default: -  step:  name:  Exfiltrate!!  script: -  pipe:  atlassian/aws-s3-deploy:0.4.4  variables:  S3_BUCKET:  &#39;etodd.io&#39;  LOCAL_PATH:  &#39;.&#39;\n 5 minutes later I&#39;ve got an S3 bucket and a fresh AWS IAM user. Plug that baby into the repository settings.\n        evantodd@HW-0063 ~ % mkdir etodd.ioevantodd@HW-0063 ~ % AWS_ACCESS_KEY_ID =xxx AWS_REGION =us-west-1 AWS_SECRET_ACCESS_KEY =xxx aws s3 cp s3://etodd.io/ ./etodd.io --recursiveevantodd@HW-0063 ~ % cd etodd.ioevantodd@HW-0063 etodd.io % git statusRefresh index: 100%  (899/899 ),  done.On branch masterYour branch is up to date with  &#39;origin/master&#39;.nothing to commit, working tree clean\n  evantodd@HW-0063 etodd.io % git remote rm originevantodd@HW-0063 etodd.io % git remote add origin git@github.com:etodd/etodd.io.gitevantodd@HW-0063 etodd.io % git push --set-upstream origin mainEnumerating objects: 1353,  done.Counting objects: 100%  (1353/1353 ),  done.Delta compression using up to  12 threadsCompressing objects: 100%  (976/976 ),  done.Writing objects: 100%  (1353/1353 ), 324.57 MiB | 1.17 MiB/s,  done.Total  1353  (delta 340 ), reused  1353  (delta 340 ), pack-reused  0remote: Resolving deltas: 100%  (340/340 ),  done.To github.com:etodd/etodd.io.git !  [remote rejected ] main -&gt; main  (shallow update not allowed )error: failed to push some refs to  &#39;github.com:etodd/etodd.io.git&#39;\n Of course! The Bitbucket build agent cloned the repo using  --depth 50, so it doesn&#39;t have the full Git history.But maybe now that I have most of the repo downloaded, I can fetch the rest from Bitbucket?\n evantodd@HW-0063 etodd.io % git fetch --unshallow https://etodd@bitbucket.org/etodd/etodd.io.gitPassword  for  &#39;https://etodd@bitbucket.org&#39;: remote: Enumerating objects: 1035,  done.remote: Counting objects: 100%  (1035/1035 ),  done.remote: Compressing objects: 100%  (642/642 ),  done.error: RPC failed; curl  56 LibreSSL SSL_read: SSL_ERROR_SYSCALL, errno  54fetch-pack: unexpected disconnect  while reading sideband packetfatal: early EOFfatal: index-pack failed\n So close! Turns out you can also deepen a shallow clone without going all the way with  git fetch --depth N.Through trial and error I keep increasing the depth, downloading the repo bit by bit. Finally, one last  git fetch --unshallow and it&#39;s done. I write this post, commit, push to Github, point Netlify at the new repo, and now you are caught up on things.\n I hope this is helpful if you ever need to get code out of Bitbucket.", "posttime": "2021-07-22 22:06:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,提取,code,git", "title": "如何从 Bitbucket 中提取代码", "title_en": "How to Exfiltrate Code from Bitbucket", "transed": 1, "url": "https://etodd.io/2021/07/21/how-to-exfiltrate-code-from-bitbucket/", "via": "", "real_tags": ["代码", "提取", "code", "git"]}, {"category": "", "categoryclass": "", "imagename": "3673cef2e9fc088558f268243bb04abc.png", "infoid": 1068855, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "目前使用 GNU Make 构建并在 Linux、Windows 和 MacOS 系统上进行测试。将支持更多构建目标。要交叉编译，如果目标操作系统与您的主机不同，则传递 CC=target-gcc 和 OS=target-os。您可以使用使用标志配置构建 bootrom.bin 文件是用户提供的原始二进制文件，加载在它开始执行的 0x80000000 地址处，并且 device.dtb 是包含机器描述的 DTB 文件。您可以通过 -image= rootfs.img 将原始分区映像挂载为闪存驱动器。 LekKit：指令解码、RAM/MMU/TLB 实现、RV32/64ICMA ISA、中断和定时器、特权 ISA、JIT、大量修复 cerg2010cerg2010：ELF 加载、重要修复、初始 RV64 工作、PLIC、PS2、ATA、以太网、XCB窗口后端", "note_en": "Currently builds using GNU Make and tested on Linux, Windows and MacOS systems. More build targets are going to be supported.\n  To cross-compile, pass CC=target-gcc and OS=target-os if the target OS differs from your host to make. You can configure the build with use flags\n     The bootrom.bin file is a user-provided raw binary, loaded at 0x80000000 address where it starts execution, and device.dtb is a DTB file containing description of the machine.You can pass -image=rootfs.img to mount a raw partition image as a flash drive.\n  LekKit: Instruction decoding, RAM/MMU/TLB implementation, RV32/64ICMA ISA, interrupts &amp; timer, privileged ISA, JIT, lots of fixes\n  cerg2010cerg2010: ELF loading, important fixes, initial RV64 work, PLIC, PS2, ATA, Ethernet, XCB window backend", "posttime": "2021-07-22 22:06:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "虚拟机,rvvm,risc,构建", "title": "RVVM——RISC-V 虚拟机", "title_en": "RVVM – The RISC-V Virtual Machine", "transed": 1, "url": "https://github.com/lekkit/rvvm", "via": "", "real_tags": ["虚拟机", "rvvm", "risc", "构建"]}]