[{"category": "", "categoryclass": "", "imagename": "5522040a4eb59b1e54a95c0ded58c127.jpg", "infoid": 1066606, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "逮捕标志第一次执法机构宣布大规模逮捕一个多产黑客集团，通过加密组织和威胁要将其泄露给公众的组织而嵌入美国人。\n   该团伙称为CL0P，已黑了许多美国目标，包括迈阿密大学，佛罗里达州佛罗里达州斯坦福大学，马里兰大学，以及科罗拉多大学，要求支付他们的系统功能或不公布物质能够偷窃。\n 由于一系列威胁到危及美国供应链的高调攻击，萧条从一个悄然普遍的网络安全问题出发了一个悄然普遍的网络安全问题。\n  乌克兰＆＃39; S宣布与Joe Biden总统恰逢日内瓦的俄罗斯总统弗拉基米尔·普京的会晤。预计拜登预计将介绍普京对俄罗斯内部的有罪不罚的赎金制品黑客采取行动。\n Ransomware已成为美国的重大问题。最近的赎金软件攻击短暂呼吸殖民地管道，关闭该国的最大燃料管道五天，而且杰布，最大的肉类供应商之一。\n  大多数多产的帆船仓团伙被认为在东欧和俄罗斯尤其是俄罗斯的运作。\n 乌克兰＆＃39; Cyber​​警察宣布他们逮捕了六人参与CL0P，并扣押了一些计算机，汽车和约500万乌克兰Hryvnia（185,000美元）的现金。 \n乌克兰当局发布的视频展示了严重的武装人员，这些军官下降了似乎是居住的东西，并将所有东西扣除从堆的现金和计算机到豪华车。  虽然CL0P WASN＆＃39; T最丰富的赎金瓶帮派，它仍然被许多目标，大多是在美国和韩国，自2020年夏天在2020年夏天进行运作，艾伦·斯科斯在网络安全公司记录了未来 。  ＆＃34;虽然它们不被视为顶级赎金软件演员，但它们的方法是相当复杂的，而＃34; 他说。  国际警察组织常常有助于网络犯罪调查的国际警察组织表示，这是一位发言人在一封电子邮件中表示协助。 ", "note_en": "The arrests mark the first time a law enforcement agency has announced a mass arrest of a prolific hacker group that had extorted Americans by either encrypting an organization&#39;s files or threatening to leak them to the public.\n   The gang, known as Cl0p, has hacked a number of American targets, including the University of Miami, Florida, Stanford University, University of Maryland, and University of Colorado, demanding a payment to either keep their systems functional or to not publish material they were able to steal.\n The bust comes as ransomware has gone from a quietly pervasive cybersecurity problem to a broadly discussed national security issue, thanks to a series of high-profile attacks that have threatened to cripple some U.S. supply chains.\n  Ukraine&#39;s announcement coincided with President Joe Biden&#39;s meeting with Russian President Vladimir Putin in Geneva. Biden  is expected to press Putin to take action against ransomware hackers who operate with impunity within Russia&#39;s borders.\n Ransomware has become a significant problem in the United States. Recent ransomware attacks briefly hobbled the Colonial Pipeline, shutting down the country&#39;s largest fuel pipeline for five days, and JBS, one of the country&#39;s largest meat suppliers.\n  The majority of the most prolific ransomware gangs are believed to operate in Eastern Europe, and Russia in particular.\n Ukraine&#39;s cyber police announced they had arrested six people involved with Cl0p, and seized a number of computers, cars and about 5 million Ukrainian hryvnia ($185,000) in cash.\n   A video released by Ukrainian authorities showed heavily armed officers descending on what appeared to be residences and seizing everything from stacks of cash and computers to luxury cars.\n Though Cl0p wasn&#39;t the most prolific ransomware gang, it still hacked dozens of targets, mostly in the U.S. and South Korea, since becoming operational in the summer of 2020, said Allan Liska, a ransomware analyst at the cybersecurity company Recorded Future.\n  &#34;While they weren’t considered a top-tier ransomware actor, their methods were fairly sophisticated,&#34; he said.\n Interpol, the international police organization, which often helps with cybercrime investigations, said it assisted with the case, a spokesperson said in an email.", "posttime": "2021-06-18 06:40:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "帮帮,bust,美国", "title": "警察胸围勒克斯摩厂帮帮派在乌克兰 ", "title_en": "Police Bust Ransomware Gang in Ukraine", "transed": 1, "url": "https://www.nbcnews.com/tech/security/ransomware-gang-busted-authorities-ukraine-rcna1199", "via": "", "real_tags": ["帮帮", "bust", "美国"]}, {"category": "", "categoryclass": "", "imagename": "14e176396df77bcd0a3f8a26ff10e8ce.jpg", "infoid": 1066605, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在竞标将其索赔作为犯罪斗争的工具中，戒指部署了在商业世界中的一个策略：影响者营销。它选择了一个品牌大使的干部，用免费的小工具和折扣代码奖励它们，并敦促他们使用他们的连接来推广Santa Monica安全摄像机启动，通过口口。\n  “顺便说一句，你正在杀死它。您的代码有14个用途，11个更多，我将向您发送我们销售的每个设备，“一名戒指员工在2016年电子邮件中写信给一名官员。 “你有任何社区会议或预防犯罪展览会吗？”\n 戒指提供了至少100名有100个有免费设备或折扣代码的人员，并鼓励他们推荐该公司的网页铃属和安全摄像头，通过时代透露的电子邮件。在15个以上的案例中，电子邮件显示，获得免费小工具或折扣的官员向同事提供给公众的戒指产品。\n  对于戒指来说，将警察转向品牌大使帮助刺激着戒指门铃的采用，同时贷款是公司声称这是一个有效的减少犯罪解决方案的可信度。\n 作为回报，参与的官员获得了数万美元的免费和折扣电子产品，并帮助建立了一个个人监控摄像机网络，即LAPD可以比获得视频镜头的典型方法更少。\n 实践，隐私和刑事司法专家警告，提出了LAPD官员是否在与戒指互动中向公众服务的问题，或者如果他们为私营企业和自己服务。\n LAPD规则限制了可以被视为影响人员行为的礼物的接受。在对电子邮件初步审查后，该部门表示，官员似乎没有违反机构规则。 \n一位机构发言人表示，虽然接受免费设备并亲自向社区成员推荐这些产品没有违反伦布的伦理守则，但有偿认可将对机构规则进行原因。\n “当然，每种情况都是按案例的方式查找”Det“。 LAPD的发言人Meghan Aguilar在一份声明中表示。 “如果出现了部门的注意力似乎不当行为，它将被提交专业标准局进行调查。”\n 目前尚不清楚LAPD官员是否披露其与公共或同胞官员的戒指的安排。\n 戒指2019年，戒指举行的龙头，澳大利亚州亚欧马·丹尼尔斯（Emma Daniel）是2018年的发言人，埃米马·丹尼斯\n  “戒指停止捐赠给执法，鼓励警方多年前推广我们的产品，”丹尼尔斯在一份声明中表示。 “随着戒指已经成长，我们的实践已经发展，我们一直在寻找更好地为客户及其社区提供更好的方式。”\n 次数直接或通过联盟和警察部门向每个名称命名的人员达成，并没有收到出版时的任何回应。\n UC Irvine的犯罪学，法律和社会部的助理教授Tony Cheng警告说，公众可能无法在收到免费或折扣环产品的官员和有偿认可的官员之间进行个人推荐。 “这似乎是分裂的毛发，”程说。 \n他说，实践是一个私人公司的实质性和象征性的担忧的原因，私营公司可以给予公共服务以外的官员动机，他们可以向公众提供人员无法信任的建议的印象。\n  “我们不想被置于职位，以便有问题或对他们在会议中发出的公共安全建议的质量持怀疑态度，例如，这些私人伙伴关系可能受到损害，”程说。\n  品牌大使模型很简单。提供有影响力的单独的免费商品，并将它们转化为低成本的营销团队。\n 一些品牌法院名人，具有巨大的追随者;其他人看起来不一定着名的人在自己的社区中受到影响。具有社交媒体存在的化妆师可能会接受赃物，用于发布新的眼影调色板。跑步者可能会在Facebook上谈论鞋类的免费鞋子。如果他们的饲料有正确的外观，则时尚的Instagram用户可能会降低免费赠品。\n 然而，公共仆人参加品牌大使模型的公务员不那么常见。\n  在一段时间内，戒指开始向LAPD开始。 2012年，杰米西门区的太平洋地球车库成立，戒指证明了错误的批评者在电视节目“鲨鱼坦克”的外观中怀疑初创公司。随着电子商务起飞并担心与它的盗窃玫瑰玫瑰，消费者拥抱环和其他视频门铃。到2016年，该公司估计销售额为1.55亿美元，占全球视频门铃市场的80％。它的价值为4.6亿美元，当时有2090万美元的风险投资资金和Siminoff，正在关注潜在的股票股票。\n  但戒指并不盈利。该公司的目的还难以证明其产品在邻里减少犯罪 - 营销希望通过与其他警察部门合作，旨在通过与LAPD合作进行验证。 \n2016年从2016年审查的电子邮件并通过公共记录释放请求显示该戒指部署了标准剧本，因为它在LAPD站接近官员。\n  通常，戒指会与一项活动的官员或通过同事的介绍联系。然后是一个随访，请求拨打电话，讨论在其邻里中“减少犯罪”的方法。最后，戒指感谢官员打电话，并表示免费产品正在进行中。\n 在至少24个案件中，戒指通过电子邮件发送了折扣码，并鼓励一名官员与同事分享，突出的当地个人，如邻居协会和他们警方社区的居民。\n 戒指的目标在向官员发送免费设备时，让他们体验它，以便他们能够“传播关于这种门铃如何证明在邻里减少犯罪的话，将这个词传播到Hoa的，会议组，在Nextdoor上以及公共安全会议上。 ，“来自公司的一封电子邮件阅读。\n LAPD的道德规范禁止官员接受“任何可能合理地解释任何人的礼物，小费或有利于，以便试图影响他们对城市企业的行为”或使用“他们的立场直接或间接无根据的特权或者豁免自己或他人。“\n  LAPD表示使用折扣代码“通常与我们的道德准则不冲突”。 Aguilar还表示，建议为社区成员保护自己的方式是社区关系职位的高级领导官员或官员的责任之一 - 一些在本故事中的一些人员持有的标题，该职员接受了免费或折扣设备。\n  虽然社区成员常见的是，UC Irvine教授要求官员提出建议，但据称这取决于官员向官员遵守“伦理准则”。官员可以广泛推荐安全系统，他审查了一些电子邮件并指出，官员不仅仅回答有关建议的问题，而且主动地向公众转向戒指。 \n戒指在该部门迅速制作，与2016年至少有125名军官进行沟通。\n  在那年4月，听到了与LAPD的其他成员制作的安排戒指后，来自奥林匹克师的埃里克Mollinedo，电子邮件戒指的运营戒指总监，八月淘汰，要求促销代码以及有关收到他家庭的信息的信息。 Mollinedo说他将在即将到来的公共安全展览会上举办展位。 Cziment说戒指会让他“与传单一起去，以及一个单位。”戒指还提供了Mollinedo优惠券代码，并鼓励他向他的同事分发。\n 博览会后，Mollinedo通过电子邮件响起，让公司了解该活动是成功。 “今天是公共安全的美好的一天......谈到了戒指，曾（5）名官员/储备官员购买！”\n 在至少10起案件中，官员邀请戒指到社区活动，或者提议在他们的车站安排会议，主要是为了允许公司代表谈论产品并交出折扣代码。\n 同月，SGT。 Justin Scott通过Chziment交换了一系列电子邮件，了解免费折叠相机的报价。戒指让他与整个西部的乐队分享报价。站。斯科特商定了，说他会继续打开一个月内打开的免费摄像机，并在同一条消息中询问他是否可以为朋友的戒指设备替换有缺陷而替换。\n  那个月晚些时候，斯科特在向同事发送给同事之前，斯科特举行促销语言，通过电子邮件发送了关于他批准的贴纸剧本的文本块。 Cziment回答说，“看起来很棒！让我更新一切如何。“\n 在60名官员中，回应斯科特电子邮件的询问免费贴纸相机，四个询问他们还可以收到公司在此前几个月免费提供的戒指门铃，因为他们在那时错过了机会。至少有三个其他人为其他官员提供免费的贴纸摄像头。一个人要求为家庭成员折扣。 \n当时，该设备零售于199美元，达到保守估计，在仅需一站，达到至少12,000美元的免费硬件。\n 免费赠品的请求继续到来。在一个案例中，玛丽亚·雷德官员，他是West L.A.警方，警方收到一个免费的贴纸，通过电子邮件，通过电子邮件，邀请他进入即将到来的站家庭野餐。\n  “我们有一个忙于问......每年都有西拉司海滩派对......我们使用我们的MEDLY站基金并购买一些奖品作为奖品抽奖。没有我问，你看到我在哪里使用这封电子邮件吗？更重要的是，我们希望您来参加您。带一些朋友，我们的款待。“\n Cziment写道：“如果感兴趣，我们很乐意捐赠一个戒指门铃，也许是一个新的太阳能安全标志吗？ :)“\n 警方邀请函还延伸到本公司顶端：戒指首席执行官Siminoff Off，参加了2016年警察学院毕业，作为当时的嘉宾·贝克的客人。\n  戒指还鼓励官员向他们策划社区的居民推广其产品。目标是“传播关于这种门铃的消息被证明是如何在社区减少犯罪的情况下，”从戒指中阅读了一封电子邮件，为一名官员提供免费设备来尝试在他的家中。\n  戒指要求官员帮助其帮助其“邻居支柱”计划，通过向所谓的支柱递交促销代码和飞行员，将其LAPD联系人“教育社区的福利”，以所谓的支柱 - “社区的影响力人民关心预防犯罪安全。“对于代码的每10个用途，柱将获得一个自由的环形设备。 \n一封电子邮件显示，社区成员戒指被认为是“有影响力”的邻里观看船长或总统。如果官员不知道任何适合账单的人，戒指邀请了军官承担了柱子的作用。\n  在2016年4月的电子邮件中，官员晚上怀特说，她的车站中的警长曾给出了她的允许分享一个环促销代码，但是“她警告我来封信电子邮件，以便我们不会似乎我们是批准产品，只是提供它作为家庭安全的选项。“\n  在2016年5月，杰维尔塞维亚官员官员表示，他的军士和船长荣誉代表Phillip Dienstag在即将到来的社区会议上谈论戒指。但塞戈维亚 - 根据电子邮件的谁在收到并安装了一个免费的戒指门铃上 - 建议，因为会议将在洛杉矶市举行，公司将无法讨论会议期间的价格。 “相反，他在电子邮件中写道，DienStag将能够“与社区谈谈定价。”\n 其他人进一步以社区成员认可的戒指进一步。官员Alejandro Galvan说，他一直在对他的老邻居一目了眼，谁是“理性”的技术，看看他们的成年儿童会访问，所以他可以谈论他们的父母使用戒指。\n ＆＃34;（PSSS，怪人有翻盖手机），“Galvan写道。 “我认为他们的孩子可能能够”干预“。”\n 在一封电子邮件连接Cziment与南留下南留下居民ESSN的负责人。在戒指的要求下，灰色 - 邀请戒指的官员享受车站家庭野餐 - 询问邻里集团是否可以找到与公司合作的方法。 “我们的侦探使用和支持这一产品，”她说。 “而且欢迎来参加并帮助促进任何会议。我完全相信并支持这个产品！“\n    到2019年，品牌大使模型已经发展起来。戒指不再鼓励官员推广其产品，并承诺免费或折扣商品。相反，官员举办了一个新的激励：越来越多的监控装置，它们可以比典型的安全摄像机更容易进入。 \n当时戒指正试图发展其应用程序，称为邻居。对于消费者来说，服务就像社区留言板一样，甚至更加关注犯罪。居民可以分享和评论他们的社区中可疑或疑似活动，也可以从自己的相机播放。\n 对于执法组织，该应用程序是一个调查工具。 RING网站的说法，该应用程序提供给执法和公共安全机构免费。官员将犯罪警报发送到他们的收件箱，他们可以直接通过应用程序批量下载或向用户发送群众请求。它具有该地区所有环形设备的交互式地图;戒指表示，它在2019年停止了这项服务。根据具体的警察数据请求，消费者可以同意与调查人员分享他们的镜头。\n   Aguilar表示，LAPD和Ring没有正式合同。条款中的国秀其他地区，由于使用执法门户协议的一部分类似的伙伴关系，人员已在他们的社区需要“鼓励通过该平台/应用的，”主板的报道。\n 电子邮件至LAPD官员展示戒指倾向于品牌大使模型以发展其应用程序。在安装执法门户后，Ring指示人员要求社区成员加入该平台，因为它会随下载应用程序的每个居民的价值。“\n  获得监视镜头可能是一个繁琐的过程。它可能需要敲门，并要求从各个相机的所有者申请许可，或者有时寻求逮捕令 - 这带来了透明度和司法监督水平。使用Ring的庞大网络，官员可以使用几次点击来请求和获取镜头。电子邮件响秀展示LAPD官员请求尽快访问公司的调查工具，称赞它并迅速将其使用使用。\n  “不要再打电话来寻找相机并要求镜头，”戒指的教学视频与警察部门州共享。\n 6月2020年6月，一些戒指用户收到了一封通知他们LAPD DET的电子邮件。 Gerry Chamberlain正在寻求来自黑人生活抗议的录像，通过电子前沿基金会展示提交的公共记录请求披露的电子邮件。在抗议活动期间，通知读，个人受伤，财产受损，警方试图找出谁负责。 \n它没有立即清除有多少用户收到该通知，其中LAPD正在寻求录像，以及代理机构最终获得的材料。通过请求用户直接从用户请求视频录制，LAPD避免了保护逮捕令或传票的多步过程，以获得来自庞大网络的个人拥有相机的识别。\n  LAPD表示，它不会记录何时以及官员的次数以及常常持续戒指用户请求。\n 经过兴奋的时间达到评论，该公司宣布它改变了其政策，现在要求警方向公共论坛中的用户提出视频的要求。 “这样，有兴趣了解更多关于他们的警察机构如何使用援助职位的更多信息的人可以简单地访问该机构的个人资料并查看帖子历史记录”博客帖子阅读。\n 为了回应时代的公共记录请求，LAPD表示，试图确定其官员要求或接收来自环形摄像机的视频的频率是“过度繁琐的”。\n 消费者拥有门铃摄像机作为家庭安全和便利性的有用工具。但是，律师和前任律师公会的律师和前任执行主任，警告了本私人监测设备所带来的危险，包括对宪法保护自由的潜在寒冷影响。\n   她表示，专家和活动家对监测技术对彩色人民的不成比例的影响，以及进一步减少透明度的透明度，可能导致拖累风格的方法和大众隐私违规行为。\n “当你有人民对财产或暴力犯罪的恐惧升级时，它会改变他们解释沿着街道上的人的普通行为或响起他们的门铃，”她说，“这可以[导致]彩色社区[作为犯罪是错误的。“ \n电子前沿基金会政策分析师Matthew Guariglia缺乏透明度是对关注的进一步引起的，因为戒指和警察部门可以使用恐惧来销售更多的设备并扩大他们的监督权。 在上周寄给加州律师将军的一封信中，电子前沿基金会要求国家司法部调查戒指与加利福尼亚州的145个警察部门的关系。  “这些伙伴关系和这些关系模糊了界限，以便人们不再知道他们是否有真正的理由在他们的邻居中害怕或者是那个来到他们的门口并建议他们采用戒指或补贴戒指的成本只是好处 从那段关系中，“瓜雷利娅说。  11:45 AM，Jun。17,2021：这个故事是更新的，请注意，戒指表示，它停止了2019年与环形设备的互动地图提供执法客户。 ", "note_en": "In a bid to bolster its claims as a crime-fighting tool, Ring deployed a tactic popular in the business world: influencer marketing. It selected a cadre of brand ambassadors, rewarded them with free gadgets and discount codes, and urged them to use their connections to promote the Santa Monica security camera startup via word of mouth.\n  “You are killing it, by the way. Your code has 14 uses, eleven more and I will be sending you every device that we sell,” a Ring employee wrote to one officer in a 2016 email. “Do you have any community meetings or crime prevention fairs coming up?”\n Ring provided at least 100 LAPD officers with one or more free devices or discount codes and encouraged them to recommend the company’s web-connected doorbells and security cameras, emails reviewed by The Times reveal. In more than 15 cases, emails show that officers who received free gadgets or discounts promoted Ring products to fellow police officers or members of the public.\n  For Ring, turning police into brand ambassadors helped spur the adoption of Ring doorbells while lending credibility to the company’s claims that it was an effective crime-reduction solution.\n In return, participating officers got tens of thousands of dollars worth of free and discounted electronics and helped establish a network of personal surveillance cameras that the LAPD could tap into with much less red tape than the typical means of obtaining video footage.\n The practice, privacy and criminal justice experts warn, raises the question of whether LAPD officers were serving the public in their interactions with Ring, or if they were serving a private business and themselves.\n LAPD rules restrict the acceptance of gifts that could be seen as an attempt to influence the actions of officers. After a preliminary review of the emails, the department said officers did not appear to have violated agency rules.\n  An agency spokesperson said that although accepting free devices and personally recommending those products to community members did not violate the LAPD code of ethics, a paid endorsement would run afoul of agency rules.\n “Of course, each situation is looked at on a case by case basis,” Det. Meghan Aguilar, a spokesperson for the LAPD, said in a statement. “If there is something brought to the department’s attention which appears to be misconduct, it will be referred to Professional Standards Bureau for investigation.”\n It’s unclear whether LAPD officers disclosed their arrangements with Ring to the public or fellow officers.\n Ring ended its law enforcement ambassador program, called Pillar, in 2019 and now works directly with community organizations, said Emma Daniels, a spokesperson for Ring, which Amazon acquired in 2018.\n  “Ring stopped donating to law enforcement and encouraging police to promote our products years ago,” Daniels said in a statement. “As Ring has grown, our practices have evolved, and we are always looking for ways to better serve our customers and their communities.”\n The Times reached out to each officer named in this story directly or through the union and the Police Department and did not receive any response by the time of publication.\n Tony Cheng, an assistant professor at UC Irvine’s Department of Criminology, Law and Society, warned that the public probably would be unable to make a distinction between a personal recommendation from an officer who received a free or discounted Ring product and a paid endorsement. “That seems to be splitting hairs,” Cheng said.\n The practice, he said, is a cause for concern both substantively and symbolically — freebies from private companies could give officers motives other than public service, and they could give the public the impression that recommendations from officers can’t be trusted.\n  “We don’t want to be put in the position to have to question or be skeptical about the quality of public safety advice that they’re giving out in meetings, for example, which could be compromised by these private partnerships,” Cheng said.\n  The brand ambassador model is simple. Give free merchandise to influential individuals, and turn them into a low-cost marketing team.\n Some brands court celebrities with huge followings; others look to people who aren’t necessarily famous yet have influence in their own communities. A makeup artist with a social media presence might receive swag for posting about new eyeshadow palettes. A runner might get free shoes for talking about footwear on Facebook. And stylish Instagram users might land freebies if their feed has the right look.\n It’s less common, however, for public servants to participate in the brand ambassador model.\n  Ring began its outreach to the LAPD during a period of growth. Founded in the Pacific Palisades garage of Jamie Siminoff in 2012, Ring was proving wrong critics who had doubted the startup during an appearance on the TV show “Shark Tank.” As e-commerce took off and concerns about porch theft rose with it, consumers embraced Ring and other video doorbells. By 2016, the company had an estimated $155 million in sales, commanding 80% of the global video doorbell market. It was valued at $460 million, had amassed $209 million in venture capital funding and Siminoff, at the time, was eyeing a potential initial public offering of stock.\n  But Ring wasn’t profitable. The company was also having  trouble proving definitively that its products helped reduce crime in neighborhoods — a marketing promise it sought to validate by working with the LAPD, among other police departments.\n Emails from 2016 reviewed by The Times and released via a public records request show that Ring deployed a standard playbook as it approached officers across LAPD stations.\n  Often, Ring would make contact with an officer at an event or through introductions from fellow police. Then came a follow-up, with a request for a phone call to discuss ways to “reduce crime” in their neighborhoods. Finally, Ring thanked the officer for the call and said a free product was on its way.\n In at least 24 cases, Ring emailed a discount code and encouraged an officer to share it with colleagues, prominent local individuals such as heads of neighborhood associations and residents of the communities they police.\n Ring’s goal when sending free devices to officers was to let them experience it so they could “spread the word about how this doorbell is proven to reduce crime in neighborhoods, spreading the word to HOA’s, meeting groups, on Nextdoor, and at public safety meetings,” one email from the company read.\n The LAPD’s  code of ethics prohibits officers from accepting “any gifts, gratuities or favors of any kind which might reasonably be interpreted as an attempt to influence their actions with respect to City business” or using “their position to secure directly or indirectly unwarranted privileges or exemptions for themselves or others.”\n  The LAPD said using discount codes is “generally not in conflict with our Code of Ethics.” Aguilar also said recommending ways for community members to protect themselves is among the responsibilities of senior lead officers or officers in community relations positions — titles held by some of the officers named in this story who accepted free or discounted devices.\n  Although it’s common for community members to ask officers for recommendations, Cheng, the UC Irvine professor, argues it’s up to the officer to “exercise restraint, according to the code of ethics.” Officers could recommend security systems broadly, said Cheng, who reviewed some of the emails and pointed out that officers didn’t just answer questions about recommendations, but proactively steered the public toward Ring.\n Ring quickly made inroads in the department, communicating with at least 125 officers in 2016.\n  In April of that year, after hearing about arrangements Ring made with other members of the LAPD, Officer Eric Mollinedo from the Olympic division emailed Ring’s director of operations, August Cziment, asking for promo codes as well as information about receiving a unit for his home. Mollinedo said he’d be manning a booth at an upcoming public safety fair. Cziment said Ring would get him “going with flyers, as well as a unit.” Ring also provided Mollinedo a coupon code and encouraged him to distribute it to his colleagues.\n After the fair, Mollinedo emailed Ring to let the company know the event was a success. “Was a good day today at the Public Safety fair ... talked up Ring and had (5) officers/reserve officers purchase them!”\n In at least 10 cases, officers invited Ring to community events or offered to schedule meetings at their stations primarily for the purpose of allowing company representatives to talk up products and hand out discount codes.\n That same month, Sgt. Justin Scott exchanged a series of emails with Cziment about an offer for a free stick-up camera. Ring asked him to share the offer with his entire West L.A. station. Scott agreed, saying he’d keep the option to sign up for the free camera open for a month, and in that same message asked if he could get a replacement for a friend’s Ring device “that appears defective.”\n  Later that month, Scott ran promotional language by the company before sending it to fellow officers, emailing Cziment a block of text about the stick-up camera offer for his approval. Cziment replied, “Looks great! Keep me updated on how it all goes.”\n Of the 60 officers who responded to Scott’s email asking for a free stick-up camera, four asked if they could also receive the Ring doorbell that the company gave out for free months prior because they had missed the opportunity at that time. At least three others asked for free stick-up cameras for other officers who didn’t sign up in time. One asked for discounts for family members.\n At the time, the device retailed for $199, amounting to a conservative estimate of at least $12,000 in free hardware doled out at just one station.\n Requests for freebies kept coming. In one case, Officer Maria Gray, who was among the West L.A. police to receive a free stick-up camera, emailed Cziment to invite him to an upcoming station family picnic.\n  “We have a favor to ask... Every year, we have a West LA Division Beach party.... We use our measly station fund and buy some gifts to raffle off as prizes. Without me asking, do you see where I’m going with this email? More importantly, we’d love for you to come and attend. Bring some friends, our treat.”\n Cziment wrote: “We’d be happy to donate a Ring Doorbell and perhaps a new Solar Powered Security sign if that’s of interest? :)”\n Police invitations also extended to the top of the company: Siminoff, Ring’s chief executive, attended a 2016 police academy graduation as a guest of then-LAPD Chief Charlie Beck.\n  Ring also encouraged officers to promote its products to residents of the communities they policed. The goal was to “spread the word about how this doorbell is proven to reduce crime in neighborhoods,” read one email from Ring offering a free device for an officer to try in his home.\n  Ring asked officers to help with its “Neighborhood Pillar” program, enlisting its LAPD contacts to “educate members of the community on the benefits of Ring” by handing out promo codes and fliers to so-called pillars — “influential people in the community that care about crime prevention safety.” For every 10 uses of the code, the pillar would get a free Ring device.\n Community members Ring considered “influential” included neighborhood watch captains or presidents, one email showed. If the officers didn’t know anyone who fit the bill, Ring invited the officers to take on the role of the pillar.\n  In an April 2016 email, Officer Evening Wight said a sergeant in her station had given her permission to share a Ring promo code, but “she cautioned me to word the email so that it won’t appear that we are endorsing the product, merely offering it as an option among others for home security.”\n  In a May 2016 email, Officer Javier Segovia said his sergeant and captain wanted Ring representative Phillip Dienstag to talk about Ring at an upcoming community meeting. But Segovia — who according to the emails had days prior received and installed a free Ring doorbell — advised that because the meeting was going to be held on city of Los Angeles property, the company would not be able to discuss “pricing during the meeting.” Instead, he wrote in the email, Dienstag would be able to “talk to the community on the side regarding pricing.”\n Others went further in endorsing Ring to community members. Officer Alejandro Galvan said he was keeping an eye on his older neighbors, who were “leery” of technology, to see when their adult children would visit so he could talk them into persuading their parents to use a Ring device.\n &#34;(Psss, the weirdos have flip phones),” Galvan wrote. “I’m thinking their kids might be able to ‘intervene.’”\n In an email connecting Cziment with the head of the South Brentwood Residents Assn. at Ring’s request, Gray — the officer who had invited Ring to the station family picnic — asked if the neighborhood group could find a way to work with the company. “Our detectives use and support this product,” she said. “And I’d be more than welcome to attend and help facilitate any meetings. I completely believe in and support this product!”\n    By 2019, the brand ambassador model had evolved. Ring no longer encouraged officers to promote its products with the promise of free or discounted merchandise. Instead, there was a new incentive for officers: growing the network of surveillance devices that they could access more easily than typical security cameras.\n Ring at the time was trying to grow its app, called Neighbors. For consumers, the service works much like the community message board NextDoor but with an even greater focus on crime. Residents can share and comment on suspicious or suspected activity in their communities and also post footage from their own cameras.\n For law enforcement organizations, the app is an investigative tool. The app is given to law enforcement and public safety agencies free of charge, according to Ring’s website. Officers get crime alerts sent to their inbox, and they can batch download or send mass requests to users for footage directly through the app. It featured an interactive map of all Ring devices in the area; Ring says it discontinued that service in 2019. In response to specific police data requests, consumers can consent to sharing their footage with investigators.\n   Aguilar said the LAPD and Ring do not have a formal contract. Terms for similar partnerships in other parts of the country show that as part of the agreement to use the law enforcement portal, officers have been required to “encourage adoption of the platform/app,” in their communities,  Motherboard reported.\n Emails to LAPD officers show Ring leaned on the brand ambassador model to grow its app. After installing the law enforcement portal, Ring instructed officers to ask community members to join the platform because it “grows in value with each resident that downloads the app.”\n  Obtaining surveillance footage can be a cumbersome process. It can require knocking on doors and asking for permission from the owners of individual cameras, or at times seeking a warrant — which brings a level of transparency and judicial oversight. Using Ring’s vast network, officers could instead request and obtain footage with a few clicks. Emails to Ring show LAPD officers requested access to the company’s investigative tool as soon as it was available to them, praised it and quickly put it to use.\n  “No more going door to  door to look for cameras and asking for footage,”  Ring’s instructional video shared with police departments states.\n In June 2020, some Ring users received an email notifying them that LAPD Det. Gerry Chamberlain was seeking video recordings from the Black Lives Matter protests, emails disclosed via a  public records request filed by the Electronic Frontier Foundation show. During the protests, the notification read, individuals were injured and property was damaged and police were trying to find out who was responsible.\n  It was not immediately clear how many users received that notification, where exactly the LAPD was seeking video recordings, and how much material the agency ultimately obtained. By requesting video recordings directly from users, the LAPD avoided the multi-step process of securing a warrant or a subpoena to obtain footage from the vast network of personally owned cameras.\n  The LAPD said it keeps no record of when and how often officers make requests of Ring users.\n After The Times reached out to Ring for comment on this story, the company  announced that it changed its policies and now requires police to make requests for video from users in a public forum. “This way, anyone interested in knowing more about how their police agency is using Request for Assistance posts can simply visit the agency’s profile and see the post history,” the blog post read.\n In response to The Times’ public records request, the LAPD said that it would be “unduly burdensome” to try to determine how often its officers requested or received video from Ring cameras.\n Consumers have embraced doorbell cameras as a useful tool for both home security and convenience. But Heidi Boghosian, a lawyer and former executive director of the National Lawyers Guild, warns of the dangers posed by this private surveillance apparatus, including a potential chilling effect on constitutionally protected freedoms.\n   Experts and activists have for years expressed concerns about the disproportionate effects of surveillance technology on people of color, and further reductions in transparency, she said, could lead to dragnet-style approaches and mass privacy violations.\n “When you have the escalation of people’s fears of property or violent crime, it changes the way they interpret ordinary actions of someone walking down the street or ringing their doorbell,” she said, “And that can [lead to] communities of color [being] falsely accused of crimes.”\n The lack of transparency is further cause for concern, Electronic Frontier Foundation policy analyst Matthew Guariglia said, because Ring and police departments could be using fear to sell more devices and expand their surveillance powers. In a  letter sent to the California attorney general last week, the Electronic Frontier Foundation asked the state Department of Justice to investigate Ring’s relationship with the 145 police departments across California with which it has partnered.\n  “These partnerships and these relationships blur the boundaries so that people no longer know if they have a real reason to be afraid in their neighborhood or if the police who come to their door and recommend they adopt the Ring or subsidize the cost of Ring just benefit from that relationship,” Guariglia said.\n  11:45 AM, Jun. 17, 2021: This story was updated to note that Ring said it stopped providing law enforcement clients with an interactive map of Ring devices in 2019.", "posttime": "2021-06-18 06:39:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "免费,代码,lapd,戒指", "title": "报告：戒指提供至少100名LAPD官员，其中包含免费设备或折扣代码，并鼓励他们推荐其产品到普遍的LAPD和公众 ", "title_en": "Report: Ring provided at least 100 LAPD officers with free devices or discount codes and encouraged them to recommend its products to fellow LAPD and the public", "transed": 1, "url": "https://www.latimes.com/business/technology/story/2021-06-17/ring-influencer-marketing-los-angeles-police-department", "via": "", "real_tags": ["免费", "代码", "lapd", "戒指"]}, {"category": "", "categoryclass": "", "imagename": "99ba9901052a95f7e5fdadfbf21d9754.jpeg", "infoid": 1066604, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook首席执行官Mark Zuckerberg谈到了他在健身和远程会议等地区的虚拟现实中所看到的巨大潜力。\n Zuckerberg周四与Publicis Groupe主席Maurice Levy在法国科技会议Vivatech谈到了该公司＆＃39;在法国科技会议vivatech。\n Facebook首席执行官Mark Zuckerberg在虚拟现实的未来看到了像普罗顿的健身订阅。\n Zuckerberg周四与Publicis Groupe主席Maurice Levy谈到法国科技会议Vivatech的虚拟和增强现实努力。他说游戏是今天VR的主要用例，但是在社会经历或健身等地区的潜力日益增长。\n  ＆＃34;想一想像peloton，你有一个订阅，而是设备是vr，你把你的耳机，你＆＃39;在这个惊人的环境中，你＆＃39;重新做一个拳击课讲师，或舞蹈课，＆＃34;他说。 ＆＃34;它＆＃39;迅速扩展超越游戏，进入一堆其他用例，我们认为这最终将成为电话和PC之后的下一个主要计算平台的重要组成部分。＆＃34;\n 扎克伯格说，他不相信手机或电脑正在消失，但总有一天，VR将竞争对手的重要性。\n 会议在VR世界也可能看起来不同，人们可能有虚拟办公室，他们可以在那里主办员工会议。 \n＆＃34;与视频会议相比，我实际上认为即使在今天的虚拟现实状态下，也有很多原因它实际上可能更好地在虚拟现实中会议，而＃34; 扎克伯格说。 他补充说，新的软件将使会议将能够在VR＆＃34中发生;很好＆＃34; 在近期。  本周，该公司宣布将开始测试广告，这些广告将出现在其Oculus虚拟现实耳机中。 Facebook＆＃39; oculus Quest在冠状病毒大流行期间被证明是流行的，因为人们在家里寻求更多的娱乐选择。 ", "note_en": "Facebook CEO Mark Zuckerberg spoke about what he sees as big potential in virtual reality for areas like fitness and remote meetings.\n Zuckerberg spoke about the company&#39;s virtual and augmented reality efforts at French tech conference VivaTech on Thursday with Publicis Groupe Chairman Maurice Levy.\n Facebook CEO Mark Zuckerberg sees potential for  Peloton-like fitness subscriptions in the future of virtual reality.\n Zuckerberg spoke about virtual and augmented reality efforts at French tech conference VivaTech on Thursday with  Publicis Groupe Chairman Maurice Levy. He said gaming is the major use case for VR today, but that there&#39;s growing potential in areas like social experiences or fitness.\n  &#34;Think about it like Peloton, where you have a subscription, but instead the device is VR and you put on your headset, and you&#39;re in this amazing environment and you&#39;re doing a boxing class with an instructor, or a dance class,&#34; he said. &#34;It&#39;s quickly expanding beyond games into a bunch of other use cases, and we think that this is eventually going to be a big part of the next major computing platform after phones and after PCs.&#34;\n Zuckerberg said he does not believe phones or computers are going away, but that VR will someday rival that scale of importance.\n Meetings could also look different in the world of VR, where people might have virtual offices where they could host staff meetings, for instance.\n &#34;Compared to video conferences, I actually think that even with the state of virtual reality today, there are a lot of reasons it actually feels better to have meetings in virtual reality,&#34; Zuckerberg said. He added that new software will make it so that meetings will be able to happen in VR &#34;quite well&#34; in the near term.\n This week, the company  announced that it will begin testing advertisements that will appear within its Oculus virtual reality headsets. Facebook&#39;s Oculus Quest  proved popular during the coronavirus pandemic, as people sought more entertainment options at home.", "posttime": "2021-06-18 06:39:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "cnbc,会议", "title": "CNBC. ", "title_en": "CNBC", "transed": 1, "url": "https://www.cnbc.com/2021/06/17/zuckerberg-envisions-peloton-like-fitness-subscriptions-for-vr.html", "via": "", "real_tags": ["cnbc", "会议"]}, {"category": "", "categoryclass": "", "imagename": "e52d06878848be8a42d99dafd725d052.jpg", "infoid": 1066602, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "日期：7月11日至11日。场地：阿姆斯特丹，巴库，布加勒斯特，布达佩斯，哥本哈根，格拉斯哥，伦敦，慕尼黑，罗马，塞维利亚，圣彼得堡。覆盖范围：Live在BBC电视台，BBC Radio 5 Live，IPlayer和BBC Sport网站和应用程序。点击这里查看更多详情\n 2020年欧元的团队可以面对罚款如果他们的球员在新闻会议上移动饮料，就像最近几天的ristiano罗纳尔多和保罗Pogba一样。\n 周一，葡萄牙队长罗纳尔多删除了两瓶可口可乐，并鼓励人们喝水。\n 第二天，法国中场地区Pogba，一个练习穆斯林，谨慎地拆除了一瓶海涅肯啤酒。\n  ＆＃34;欧足联提醒了参与的团队，伙伴关系是交付锦标赛的交付中的一体，并确保在欧洲的足球发展，包括青年和女性，＆＃34;锦标赛组织者周四说。\n UEFA＆＃39; S欧元2020年锦标赛主任马丁卡伦表示，球员在合同义务＆＃34;通过他们的锦标赛法规联合会跟随＆＃34;\n 然而，他说，他了解像Pogba这样的球员的行为，为宗教原因做了这样的事情。 \n队伍已被提醒他们的合同法规，Kallen表示纪律处分是＆＃34;一种可能性＆＃34;  欧足联不打算直接罚款，任何制裁都由全国联合会自行决定。  ＆＃34;我们永远不会直接从UEFA方面融入玩家，我们将永远通过参与的国家协会来完成这一点，然后他们可以看出他们将进一步向玩家进一步，但我们不会直接进入这一刻 球员，＆＃34; 卡伦说。 ", "note_en": "Dates:  11 June-11 July.  Venues:  Amsterdam, Baku, Bucharest, Budapest, Copenhagen, Glasgow, London, Munich, Rome, Seville, St Petersburg.  Coverage:  Live on BBC TV, BBC Radio 5 Live, iPlayer and the BBC Sport website and app.   Click here for more details\n Teams at Euro 2020 could face fines if their players move drinks provided by sponsors at news conferences, as Cristiano Ronaldo and Paul Pogba have done in recent days.\n On Monday, Portugal captain Ronaldo removed two bottles of Coca-Cola and encouraged people to drink water.\n The next day, France midfielder Pogba, a practising Muslim, discreetly   removed a bottle  of Heineken beer.\n  &#34;Uefa has reminded participating teams that partnerships are integral to the delivery of the tournament and to ensuring the development of football across Europe, including for youth and women,&#34; tournament organisers said on Thursday.\n Uefa&#39;s Euro 2020 tournament director Martin Kallen said players were contractually obliged &#34;through their federation of the tournament regulations to follow&#34;.\n However, he said he understood the actions of players who, like Pogba, did such things for religious reasons.\n Teams have been reminded of their contractual regulations and Kallen said disciplinary action was &#34;a possibility&#34;.\n Uefa does not intend to directly fine players and any sanctions are at the discretion of the national federations.\n &#34;We are never fining players directly from the Uefa side, we will do this always through the participating national association and then they could look if they will go further to the player, but we are not going directly for the moment to the player,&#34; Kallen said.", "posttime": "2021-06-18 06:38:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "饮料,warns,球员", "title": "如果他们在新闻会议上移动饮料，欧足联警告队可以被罚款 ", "title_en": "Uefa warns teams could be fined if they move drinks at news conferences", "transed": 1, "url": "https://www.bbc.com/sport/football/57517337", "via": "", "real_tags": ["饮料", "warns", "球员"]}, {"category": "", "categoryclass": "", "imagename": "8b40bc4ed9992e3afc17a9b425c56b9e.jpeg", "infoid": 1066601, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "iPados 15是iPad的巨大飞跃。 iOS 14像主屏幕小部件和App库的最佳功能即将到来。这意味着您可以像iPhone上一样直接将天气小部件直接放在您的主屏幕上。小部件使用温度和预测等新信息更新，并点击窗口小部件推出应用程序，就像点击图标......\n  Apple的天气应用程序在iOS 15上拥有一个全新的设计，可以将湿度和紫外线指数等数据点组织成块。这对iPhone非常伟大，在没有压倒性的情况下展示了很多信息。\n 出于某种原因，Apple在iPados 15上的天气应用程序没有完全相同的设计。信息仍然组织成块，但很多街区奇怪地是天气条件的奇怪。\n iPad天气应用程序的顶部包括一个巨大的订阅版本，具有更多功能和更少的广告。我错过了关于天气应用程序的付费版本的宣布，但苹果真的在这些天中进入了服务，所以这并不奇怪。\n  Weird天气+公告抛开，iPad的天气应用程序与iPhone的新天气应用一样有用。在某种程度上，它实际上更好。\n iPad的天气应用程序包括湿度，可见性和UV索引的所有大数据点就像在iPhone上一样。甚至有一个很酷的部分，可以告诉你月球的当前阶段。挺酷的！\n  关于iPad天气应用程序的其他东西是一个关于UPS的整洁的TIDBIT。根据iPad的天气应用程序，您可以在全球运输中节省50％，从现在到19月19日，我找不到这一好奇但有用的iPhone天气应用程序的好奇但有用的数据点。现在，我担心的是检查他们的iPhone天气的人是过度付出的。 \niPad Apple天气应用程序的特权不会结束那里。您可以确认您的怀疑，即覆盖您的汽车的黄色东西实际上是花粉。我距离海滩几分钟几分钟，所以看看潮水也很好。这是iPad的力量，人们。\n  iPad的天气应用程序还包括世界各地天气状况的一些非常酷的照片画廊。这些与天气有关的新闻故事有点像股票有关的业务相关的新闻故事，但iPad天气应用程序的故事不会出于某种原因使用Apple News。\n 您还可以了解使用iPad上的天气应用程序切割草的创新方法。顶部，iphone天气应用程序。这一部对于iPad的天气应用程序还将停止从设备中播放的任何音频 - 可能是新焦点功能的一部分。\n  天气新闻不是您可以在iPad的天气应用程序中了解的唯一故事。有一个可爱的小狗故事，一个建议将弹出帐篷连接到您的车上，以及将房间变成冰箱的东西。迷人！\n Apple的iPad的一些天气应用程序尤其不是Apple-y，但这绝对是iPad的Apple的天气应用程序。每次点击天气窗口小部件时都会推出它，这只是小部件的工作原理。它还提到了数据供应商并控制您的数据。 Apple是关于授权您拥有您的数据和预防公司从您的信息中获取的数据。\n  我试图了解有关对iPad的Apple天气应用程序的订阅，但我无法在Apple网站上找到有关它的任何信息。它包含在苹果一包中吗？\n 我不确定，但你可以使用促销代码夏天在价格跳至5美元/月之前获得90天的价格1美元/月！订阅的精细印刷错误地提到了一个关于网站的东西，但这绝对是iPad的天气应用程序。 \n在你试图告诉我之前不是iPad的天气应用程序，听到我的声音。 天气窗口小部件在iPhone上推出天气应用程序，我确定天气窗口小部件在iPad上推出天气应用程序。 这只是小部件如何工作！  iPhone的天气应用程序今年有一些很酷的新功能，如降水警报，但Apple可能会将那些在明年提供iPad应用程序的天气。 这就是小部件的工作原因，毕竟是对吧？  您正在阅读9To5MAC  - 在日复一日的日复一日地打破苹果及其周围生态系统的新闻的专家。 请务必查看我们的主页，以了解所有最新消息，然后在Twitter，Facebook和LinkedIn上关注9to5Mac以留在循环中。 不知道从哪里开始？ 查看我们的独家故事，评论，How-TO，以及订阅我们的YouTube频道 ", "note_en": "iPadOS 15 is a huge leap forward for the iPad. The best features of iOS 14 like Home Screen widgets and App Library are coming to iPads. That means you can put the Weather widget directly on your Home Screen just like on the iPhone. Widgets update with new information like temperature and forecast, and tapping a widget launches the app just like tapping an icon…\n  Apple’s Weather app has a brand new design on iOS 15 that organizes data points like humidity and UV index into blocks. It’s really great on the iPhone at presenting a lot of information without being overwhelming.\n For some reason, Apple’s Weather app on iPadOS 15 doesn’t have exactly the same design. Information is still organized into blocks, but a lot of the blocks are weirdly not about weather conditions.\n The top of the Weather app for iPad includes a giant banner for a subscription version with more features and fewer ads. I missed the announcement about a paid version of the Weather app, but Apple is really into services these days so it’s no surprise.\n  Weird Weather+ announcement aside, the Weather app for iPad is just as useful as the new Weather app for iPhone. It’s actually even better in some ways.\n The Weather app for iPad includes all the great data points like humidity, visibility, and UV index just like on the iPhone. There’s even a cool section for telling you the current phase of the Moon. How cool!\n  Something else unique about the Weather app for iPad is a neat tidbit about UPS. According to the Weather app for iPad, you can save 50% on global shipping with code REACH from now through July 19. I couldn’t find this curious but helpful data point on the Weather app for iPhone. Now I’m worried folks who check the weather on their iPhone are overpaying for shipping.\n  The perks of Apple’s Weather app for iPad don’t end there. You can confirm your suspicion that the yellow stuff covering your car is actually pollen. I live a few minutes from the beach so it’s also good to see tide levels. That’s the power of iPad, people.\n  The Weather app for iPad also features some really cool photo galleries of weather conditions around the world. These are attached to weather-related news stories sort of like how Stocks has business-related news stories, but stories in the iPad Weather app don’t use Apple News for some reason.\n You can also learn about innovative ways to cut your grass with the Weather app on iPad. Top that, iPhone Weather app. This section of the Weather app for iPad will also stop any audio playing from your device — presumably part of the new Focus feature.\n  Weather news isn’t the only kind of stories you can learn about in the Weather app for iPad. There’s an adorable puppy story, a suggestion for attaching a pop-up tent to your car, and something about turning your room into a fridge. Fascinating!\n Some of Apple’s Weather app for iPad is particularly not very Apple-y, but this is definitely Apple’s Weather app for iPad. It launches every time you tap the Weather widget, and that’s just how widgets work. It also mentions data vendors and controlling your data. Apple is all about empowering you to own your data and preventing companies from profiting from your information.\n  I tried to learn more about the subscription to Apple’s Weather app for iPad, but I couldn’t find any information about it on Apple’s website. Is it included in the Apple One bundle?\n I’m not sure, but you can use promo code SUMMER to get access for $1/month for 90 days before the price jumps to $5/month! The fine print for the subscription mistakenly mentions something about a website, but this is definitely the Weather app for iPad.\n And before you try to tell me this isn’t the Weather app for iPad, hear me out. The Weather widget launches the Weather app on iPhone, and I’m certain the Weather widget launches the Weather app on iPad. That’s just how widgets work!\n The Weather app for iPhone has some cool new features this year like precipitation alerts, but Apple will probably add those to the Weather for iPad app next year. That’s how widgets worked, after all, right?\n  You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Mac on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2021-06-18 06:37:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,程序,应用程序", "title": "iPados 15：与iPad的Apple的天气应用程序一起使用 ", "title_en": "iPadOS 15: Hands-on with Apple’s Weather app for iPad", "transed": 1, "url": "https://9to5mac.com/2021/06/16/ipados-15-hands-on-with-apples-weather-app-for-ipad/", "via": "", "real_tags": ["apple", "程序", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "8aece3fbdbf17bc063830e2f988d9945.png", "infoid": 1066600, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自1935年以来，柏林工程师Konrad Zuse已经花了他的整个职业发展一系列自动计算器，这是世界上第一个：Z1，Z2，Z3，S1，S2和Z4。他用一群商机，技术人员和数学家完成了这一点，他们正在反对所有赔率。随着战争的所有艰辛和缺乏对同行的漠不关心，他们取得成功的事实是他们奉献和努力的遗憾。随着战争的结束，艰难的艰辛已经打破了。\n 两年前，在柏林战役中，轰炸机完全摧毁了综合家族家园和邻近的甲基脲的研讨会，在那里他们进行了研究和制造。所有计算器，工程图纸和笔记都在瓦砾中丢失，为新的Z4储蓄，即在Oranienstraße的另一个研讨会上完成整个运河的完成。在这一切中，Zuse在今年1月结婚，但是当最大的盟军在2月摧毁了奥拉尼亚斯·斯堡车间时，立即陷入了另一个危机。他们设法从地下室拯救Z4，并且奇迹般地安排将其摆脱柏林。 Zuse，他的家人和同事随后很快跟着。在这里和那里沿着逃生路线，他们设法完成了Z4的最终装配和测试 - 甚至发出哥廷根的空气动力学研究所的示范。\n 在抵达巴伐利亚阿尔卑斯山的抵达时，Zuse发现了一系列难民收藏，包括Werner Von Braun博士和来自Peenemünde的100个火箭科学家团队。虽然这里的每个人都在挣扎只是为了保持活力并找到食物和庇护所，但Zuse进一步担心让他的发明免受窥探的眼睛。紧张局势进一步上升，在谣言中循环一个谣言，在三瓶干邑白兰地之后，让他的军队不在这里保护科学家，而是如果美国人或法国的方法杀死他们所有人。\n 在所有这个疯狂的中，唯一和他的妻子Gisela欢迎一个男婴，并在一个Hinterstein农舍居住。 Zuse花了他的时间在称为普利克兰普拉尔的东西上工作，解释它是一种数学语言，让人们可以与这些新机器进行交流。他的其他业余爱好正在制作当地风景的伍德布洛克，他计划一旦经济恢复，他就会开始一家销售他的设备。毫无疑问，Konrad Zuse很快将在世界各地作为自动计算机的父亲着名和众所周知。\n  这是80年前，Konrad Zuse展示了他的模特Z3，一个适当的场合，以期待他的生命和成就。但尽管我们想象中上面的想象者的讲座，但大多数人以外的人在计算机历史遗迹之外从未听说过Konrad Zuse。如何创建和建立世界上第一个可编程计算机的人，但尚只是历史上的脚注？\n Konrad Zuse在生活中发现了他的利基。作为一个年轻的青少年，他似乎注定要根据他的兴趣和技能成为一名工程师，总是用ercor lead和发明小工具来修补。但他也是一个有才华横溢的素描艺术家，摄影师，并享受在Skits和Play上的行为。在柏林技术大学的时间，他改变了两次。最初通过机械工程的刚性符合性推迟，他转换为架构，只能发现它同样无聊。他终于解决了土木工程，这在工程师和艺术家之间遇到了适当的平衡。\n  在1935年完成学业后，他的第一份工作是在柏林境外的亨舍尔飞机厂。但是他戒掉了几个月后，把注意力转向他一直在思考的东西 - 他可以建立一台机器来自动化那些无聊和重复的工程计算吗？ \nZUES在新鲜的计算领域中几乎完全隔离。最初，至少，当我们今天想到它时，他并不是那么多于一般的电脑。他的目标是制作一个自动的机械加入机，以处理繁琐的计算，例如静态应力分析所需的繁琐计算。早期，他提出了使用二进制而不是十进制的关键决定。他正确地看到这将极大地简化了这样的机器的建筑，无论什么都是什么。\n 您可能会认为二进制数的选择将立即使继电器成为最明显的选择。虽然他用继电器进行了实验，但它们被统治得太不可靠。今天，我们认为理所当然的继电器和质量，但Zuse生活在20世纪30年代德国，并在他的家人和朋友支持的鞋带预算上运营。继电器是昂贵的，它们设计为不经常切换，而不是在许多赫兹不断运行。他可以获得的继电器比在当地电话交换机上丢弃他的朋友撤消他的朋友。除了他的朋友Helmut Schreyer一起，他们还通过使用真空管进行实验，但意识到由于战时短缺，技术将被显着延迟。\n  那么他是如何在没有继电器或真空管的情况下实施计算机的？这是机械的。 ZUES设计了巧妙的板式布置，平板杆和钢引脚，以制作数字存储器商店和浮点二进制算术逻辑单元（ALU）。\n  该视频解释了机械加法器的基本操作（不要让德国令人沮丧地观看它）。\n 如果您想挖掘如何机械地实现内存和ALU，请查看[FJKraan]的项目解释基础和OpenSCAD 3D打印机示例，您可以自己制作：\n   内存包括64个每22位字（14位尾数和8位指数和标志）。 ALU可以添加，减去，乘以和分开。程序指令在冲压胶带上提供，并由八项操作组成：\n  计算机的时钟相当于现代的四相CPU时钟。但它是机械而不是电气，并且可以由手曲柄或电动机驱动。每个时钟阶段都是四个平面运动之一 - 想象一下北方几厘米的平方板，然后西，然后南，然后向东回到起点。每个阶段执行了基本操作，幸运的是，没有基本操作占这些周期的三个以上。 \n暗示指令集的暗示，Zuse还建立了转换器以允许使用用于输入和输出的人友好的十进制数。当时纸带太罕见了商品，所以需要另一种解决方案。他们发现空白的35毫米电影电影工作得很好，并使用手持孔打孔写入他们的程序。\n  Z1于1938年结束，但从来都不是非常可靠的。但这并不意味着是一个成品，只有一个概念验证原型。下一步开始在Z2上开始，计划测试继电器是否适合。 ZUES保持Z2的机械存储器，但用继电器版本替换了ALU，但仅在固定点号上运行。它在1938年完成并成功展示，随后Zuse接受了部分资金来构建继任模型。\n Z3完全与继电器设计。它基本上对Z1的改进，更快，更可靠。它于1941年5月12日交付并展示，然后ZUES开始构建另一台计算机，Z4在引言中提到的Z4。 Z4在Z3上扩展，添加了平方根，打孔输出，多胶带输入单元等新功能和条件分支指令。 ZUES继续在ALU中使用继电器，但由于其密度更大，因此返回机械记忆。 Z4最终投入全职服务，并从1950年到1959年运营。\n  随着Z3项目进行，请求来自Henschel，有助于生产导弹翅膀。 Zuse构建了什么是第一个过程控制计算机，S1和S2，并发明了一个模数转换器。这些单一用途计算机遵循新制造的翅膀的轮廓，因为一百个模数配备的滚轮测量了它们的曲线。\n 然后，机器将自动计算来自此数据的尾表面和jilerons的所需装饰，这是一个先前由十几台计算机（人，而不是机器）完成的任务。在围绕时钟进行两年后，工厂于1944年爆炸摧毁，S1和S2被摧毁或被苏联捕获。\n 如果您想了解有关每个型号的更多信息，请查看此广泛的网站，描述所有计算机等等。它是由Konrad Zuse的儿子制作的，他出生在上面的介绍，霍斯特·Zuse，他们成为电气工程师，软件工程师和计算机历史专家。\n  Zuse和他的团队能够在机械，继电器和甚至是计算机组件的机械，继电器和甚至真空管的过程之间来回转换，因为ZUSE在工作中的底层方程上掌握。他制定了自己的规则和符号系统，直到他的前数学老师告诉他他已经重新发明了命题微积分，或者今天更常用的布尔代数。通过将计算机操作降低到方程式中，设计概念与物理结构分开，使得更容易在实现之间来回跳。 \nZUES意识到，通过框架，我们今天会称之为计算机语言，计算机可以不仅仅是解决方程的方式。自1939年以来一直在思考这种语言，并在战争的直接之后，他花了很多时间正式地形成了他所谓的Plankalkül，这是一个计算机的第一级高级编程语言 - 用英语翻译为一个正式规划系统。尽管Zuse的高希望，Plankalkül从未起飞，尽管有些人说它的元素可以在Algol 58中找到，尽管未经认可。\n   Zuse为他的许多发明制作了专利申请，并发出了许多专利。他为计算机本身的专利，会沮丧。他于1941年6月16日提出了专利申请。直到1952年战争后，德国专利局发表了索赔。在整个行业中没有公司反对，除了一个 - 凯旋计算器公司向该专利提出反对，后来透露将被IBM支持。法院案件多年来一直徘徊，仅在1967年最终被拒绝，理由是本发明不值得专利。\n 没有怀疑主要申请中有关物体的创新和进展。然而，由于发明优点不足，无法授予专利。\n 与此同时，Zuse已经开始将自己的计算机线商业化。 IBM有一个错误的开始，谁想要专利，但不会让Zuse继续发展。雷明顿兰德成为一个重要的早期客户，紧随其后的是苏黎世瑞士联邦理工学院（Eth），在苏黎世在1950年携带Z4的交付。业务在未来15年内增长，其中一系列电脑甚至绘图仪GraphyMat 64.但到20世纪60年代中期，该公司具有财务问题，并于1967年由西门子收购。\n  与已销毁或销售废料的许多历史计算机一样，多年来已经有几个Zuse的计算机娱乐。\n  通过Siemens的支持，Zuse于1984年开始了一个项目，以重建Z1。它于1989年完成，目前正在展示柏林德国技术博物馆。柏林自由大学的RaúlGojas教授已经写了一个优秀的深入的论文，就Z1及其重建工作。关于这个项目，Zuse曾经评论过：\n 然后，它没有很好地运行，并且在这方面，这个副本非常可靠 - 它也不好起来。 \n基于继电器的Z3已重建三次。首先，在1961年，Zuse本人建立了一份仍在慕尼黑德意志博物馆展出的复制品。 1997年再次，RaúlGojas和Horst Zuse教授建立了一项娱乐，现在在德国Hünfeld的展示Konrad Zuse Museum。最近，Horst Zuse教授建造了一个原始的大小重建，该重建于2010年在Konrad Zuse Museum安装。\n  并谈到复制品，这是konrad zuse本人的复制品，以乐高砖头的形式，从z3计算机上拿着一个继电器存储单元。\n   Zuse在战争时期犯了他最重要的发明。否则，今天可能知道实用，创业ZUES，不仅是技术先驱，而且作为贝尔盖茨的全球技术公司的创始人。\n 它确实让你想知道为什么Konrad Zuse尚未众所周知，为什么他的突破性发明和计算机经常被忽略。无论他是否制作了第一个可编程计算机，他的贡献都是无可否认的，超越他们的时间，并应得更好的认可。 Konrad Zuse的成就是由Eric Weiss的最重要的综述，他在1996年写下Zuse Zuse ofeee的oeee：\n Zuse是一个有很多人才的人。他是一个持久的，创新，非常具有创新的工程设计师和建设者，一个数学逻辑师，一个成功的计算制造商家的创始人，以及令人印象深刻的艺术家。他的同胞和计算世界都将记住他，主要是针对第一个Z机器的概念，也是他的企业家公司，成功创造和运营，几乎没有外部帮助，在最艰难的条件下。\n 低于休息是1958年电视广播，Zuse（英文字幕可用）和关于KONRAD ZUSE的一些额外资源。 ", "note_en": "Since 1935, Berlin engineer Konrad Zuse has spent his entire career developing a series of automatic calculators, the first of their kind in the world: the Z1, Z2, Z3, S1, S2, and Z4. He accomplished this with a motley group of engineers, technicians, and mathematicians who were operating against all odds. With all the hardships and shortages of war and the indifference of their peers, the fact that they succeeded at all is a testament to their dedication and resourcefulness. And with the end of the war, more hardships have been piling on.\n Two years ago, during the Battle of Berlin, bombers completely destroyed the Zuse family home and adjacent workshops on the Methfesselstraße, where they performed research and fabrication. All of the calculators, engineering drawings, and notes were lost in the rubble, save for the new Z4 nearing completion across the canal in another workshop on Oranienstraße. In the midst of all this, Zuse married in January of this year, but was immediately plunged into another crisis when the largest Allied air raid of the war destroyed the Oranienstraße workshop in February. They managed to rescue the Z4 from the basement, and miraculously arranged for it to be shipped out of the Berlin. Zuse, his family, and colleagues followed soon thereafter. Here and there along the escape route, they managed to complete the final assembly and testing of the Z4 — even giving a demonstration to the Aerodynamics Research Institute in Göttingen.\n On arrival here in the Bavarian Alps, Zuse found a ragtag collection of refugees, including Dr Werner Von Braun and a team of 100 rocket scientists from Peenemünde. While everyone here is struggling just to stay alive and find food and shelter, Zuse is further worried with keeping his invention safe from prying eyes. Tensions have risen further upon circulation of a rumor that an SS leader, after three bottles of Cognac, let slip that his troops aren’t here to protect the scientists but to kill them all if the Americans or French approach.\n In the midst of all this madness, Zuse and his wife Gisela welcomed a baby boy, and have taken up residence in a Hinterstein farmhouse. Zuse spends his time working on something called a  Plankalkül, explaining that it is a mathematical language to allow people to communicate with these new machines. His other hobby is making woodblocks of the local scenery, and he plans to start a company to sell his devices once the economy recovers. There is no doubt that Konrad Zuse will soon be famous and known around the world as the father of automatic computers.\n  It was 80 years ago that  Konrad Zuse demonstrated his model Z3, an appropriate occasion to look back at his life and accomplishments. But despite the musings of our imaginary correspondent above, most people outside of computer history buffs have never heard of Konrad Zuse. How is it that someone created and built the world’s first programmable computer and yet is only a footnote in history?\n Konrad Zuse had trouble finding his niche in life. As a young teen he seemed destined to become an engineer based on his interests and skills, always tinkering with erector sets and inventing gadgets. But he was also a talented sketch artist, photographer, and enjoyed acting in skits and plays. During his time at the  Technical University of Berlin, he changed majors twice. Initially put off by the rigid conformity of mechanical engineering, he switched to architecture, only to find it equally boring. He finally settled on civil engineering, which struck the right balance between engineer and artist.\n  After completing his studies in 1935, his first job was at the Henschel Airplane Works just outside of Berlin. But he quit after only a few months, turning his attention to something he had been pondering for some time — could he build a machine to automate those boring and repetitious engineering calculations?\n  Zuse was working in almost complete isolation from others in the nascent field of computing. And initially, at least, he wasn’t so much focused on a general purpose computer as we think of it today. His goal was to make an automated mechanical adding machine of sorts, to handle the tedious calculations such as those required in static stress analyses. Early on, he made a key decision to use binary rather than decimal. He rightly saw that this would greatly simplify the building of such a machine, no matter what the implementation.\n You might think that the choice of binary numbers would immediately make relays the most obvious choice. And while he did experiments with relays, they were ruled too unreliable. Today we take for granted the reliability and quality of relays, but Zuse was living in 1930s Germany and operating on a shoestring budget supported by his family and friends. Relays were expensive, and they were designed to switch infrequently, not run continuously at many Hertz. The relays that he could obtain were more often than not discards his friends rescued from the trash at the local telephone exchange. Along with his friend Helmut Schreyer, they also experimented with using of vacuum tubes, but realized that technology would be significantly delayed due to wartime shortages.\n  So how did he implement a computer without relays or vacuum tubes? It was all mechanical. Zuse devised a clever arrangement of plates, flat bars, and steel pins to make a digital memory store and a floating point binary arithmetic logic unit (ALU).\n  This  video explains the basic operation of the mechanical adder (don’t let the fact that it’s in German discourage you from watching it).\n If you want to dig into how Zuse implemented memory and an ALU mechanically, check out [fjkraan]’s project explaining  the basics and OpenSCAD 3D printer examples you can make yourself:\n   The memory consisted of 64 each 22-bit words ( 14-bits of mantissa and 8-bits of exponent and sign). The ALU could add, subtract, multiply, and divide. The program instructions were provided on punched tapes, and consisted of only eight operations:\n  The computer’s clock was equivalent to a four-phase CPU clock of modern times. But it was mechanical rather than electrical, and could be driven by either a hand crank or an electric motor. Each clock phase was one of four planar motions — imagine pushing a square plate a few centimeters North, then West, then South, then East back to the starting point. Each phase performed a basic operation, and fortunately no basic operation took more than three of these cycles.\n As hinted to by the instruction set, Zuse also built converters to permit the use of human-friendly decimal numbers for input and output. Paper tape was too rare a commodity at the time, so another solution was needed. They found that blank 35 mm movie film worked just fine, and wrote their programs using a hand-held hole punch.\n  The Z1 was finished in 1938, but was never very reliable. But it wasn’t meant to be a finished product, only a proof-of-concept prototype. Work next began on the Z2, which was planned to test whether relays could would be suitable. Zuse kept the mechanical memory for the Z2, but replaced the ALU with a relay version, but only operating on fixed-point numbers. It was completed and successfully demonstrated in 1938, whereupon Zuse received partial funding to build a successor model.\n The Z3 was designed entirely with relays. It was basically an improvement on the Z1, was faster and more reliable. It was delivered and demonstrated on 12 May 1941, and then Zuse began construction of yet another computer, the Z4 mentioned in the introduction. The Z4 expanded on the Z3, adding new features like square root, punch tape output, multiple tape input units, and a conditional branch instruction. Zuse continued to use relays in the ALU, but returned to the mechanical memory because of its greater density. The Z4 was eventually put into full time service and operated from 1950 until 1959.\n  As the Z3 project was underway, a request came from Henschel for help in the production of guided missile wings. Zuse built what are probably the first process control computers, the S1 and S2, and invented an analog to digital converter. These single-purpose computers followed the contour of newly-manufactured wings as a hundred analog-to-digital-equipped rollers measured their curvatures.\n The machines would then automatically calculate the required trim for the tail surfaces and ailerons from this data, a task that previously been done by a dozen computers (people, not machines). After performing their jobs around the clock for two years, the factory was destroyed by bombing in 1944, and the S1 and S2 were either destroyed or possibly captured by the Soviets.\n If you want to learn more about each model, check out this  extensive website describing all the computers and much more. It was made by Konrad Zuse’s son who was born in the introduction above,  Prof Horst Zuse, who became an electrical engineer, a software engineer, and an expert on computer history.\n  Zuse and his team were able to switch back and forth between mechanical, relay, and even vacuum tube realizations of the computer components because of Zuse’s grasp on the underlying equations at work. He developed his own system of rules and notation, until his former math teacher told him he had reinvented propositional calculus, or Boolean algebra as is more commonly used today. By reducing the computer operations into equations, the design concepts were separated from the physical construction, making it easier to jump back and forth between implementations.\n Zuse realized that with the framework, what we would call a computer language today, the computer could do so much more than just solve equations. He had been thinking of such a language since 1939, and in the immediate aftermath of the war, he spent much of his time formalizing what he called  Plankalkül, the first high-level programming language for a computer — in English, it translates as  a formal system for planning. Despite Zuse’s high hopes, Plankalkül never took off, although some say that elements of it can be found in Algol 58, albeit uncredited.\n   Zuse made patent applications for many of his inventions, and a number of patents were issued. His patent for the computer itself, would be frustrated. He filed a patent application on 16 Jun 1941. It wasn’t until after the war in 1952 that the German Patent Office  published his claims. No company in the whole industry objected, except for one — the  Triumph calculator company filed opposition to the patent, later revealed to be backed by IBM. The court case lingered for years, only to ultimately be rejected in 1967 on the grounds that the invention was not worthy of a patent.\n The innovation and progressiveness of the object concerned in the main application are not doubted. Yet a patent cannot be granted due to insufficient inventive merit.\n In the meantime, Zuse had begun commercializing his own line of computers. There was a false start with IBM, who wanted the patents but wouldn’t let Zuse continue development.  Remington Rand became an important early client, followed closely by the  Swiss Federal Institute of Technology (ETH) in Zürich who took delivery of the Z4 in 1950. Business grew over the next 15 years, with a series of computers and even a plotter,  the Graphomat 64. But by the mid 1960s the company was having financial troubles, and it was acquired by Siemens in 1967.\n  As with many historical computers that have been destroyed or sold for scrap, there have been several recreations of Zuse’s computers built over the years.\n  With support from Siemens, Zuse began a project in 1984 to reconstruct the Z1. It was completed in 1989 and is  now on display at the  German Museum of Technology in Berlin. Prof Raúl Rojas of the Free University of Berlin has written an  excellent, in-depth paper on how the Z1 and its reconstruction work. Regarding this project, Zuse once remarked:\n Back then, it didn’t function very well, and in that regard, this replica is very reliable — it also doesn’t work well.\n  The relay-based Z3 has been reconstructed three times. First, in 1961, Zuse himself built a replica that is still on display in the  Deutsches Museum in Munich. Again in 1997, Profs Raúl Rojas and Horst Zuse built a recreation that is now on display  Konrad Zuse Museum in Hünfeld, Germany. And most recently, Prof Horst Zuse built an original size reconstruction which was installed at the Konrad Zuse museum in 2010.\n  And speaking of replicas, this is a replica of Konrad Zuse himself, in the form of a LEGO brick man, holding a relay storage unit from the Z3 computer.\n   Zuse had the misfortune to have made his most important invention in times of war. Otherwise, the practical, entrepreneurial Zuse might be known today not only as a technology pioneer, but also as the founder of a global technology corporation of the stature of Bill Gates.\n It does make you wonder why Konrad Zuse isn’t well known and why his groundbreaking inventions and computers are often ignored. Whether or not he made the first programmable computer, his contributions were undeniably significant, well ahead of their time, and deserve better recognition. Konrad Zuse’s accomplishments are best summarized by Eric Weiss, who wrote  Zuse’s obituary for the IEEE in 1996 :\n Zuse was a man of many talents. He was a persistent, innovative, and extraordinarily creative engineering designer and builder, a mathematical logician, the founder of several successful computing manufacturing businesses, and an impressive artist. His countrymen and the computing world will remember him chiefly for the concepts of the first Z machines but also for his entrepreneurial companies, successfully created and operated, almost without outside help under the most trying conditions.\n Below the break is a 1958 television broadcast with Zuse (English subtitles are available) and some additional resources about Konrad Zuse.", "posttime": "2021-06-18 06:37:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电脑,conrad,zuse", "title": "另一台电脑：Konrad Zuse和Z3 ", "title_en": "The other first computer: Conrad Zuse and the Z3", "transed": 1, "url": "https://hackaday.com/2021/06/16/the-other-first-computer-konrad-zuse-and-the-z3/", "via": "", "real_tags": ["电脑", "conrad", "zuse"]}, {"category": "", "categoryclass": "", "imagename": "3eb049ee9bf687ca7000c0a2c16817cf.jpg", "infoid": 1066599, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在Ars，我们＆＃39;重大粉丝的仿真创造了经典的游戏体验，它实际上比你可以以某种方式与原始硬件的原始硬件更好。在过去，这意味着在SNES＆＃39中升起旋转精灵; ＆＃34;模式7＆＃34;游戏或添加＆＃34;宽屏＆＃34;支持NES游戏或减轻内置于某些旧控制台的控制器滞后，或超频模拟的SNE，以除去显影而不会破坏游戏时间。最新的仿真功率复古游戏升级越过我们的路径大大简化了夸大的忽视功能，内置于许多游戏男孩前进标题。即，它增加了在单个显示屏上播放拆分屏幕中的多人标题的能力。\n 此升级是Robert Peip的工作，该开发商是在现场可编程门阵列（FPGA）上工作的开发者。这些天，PEIP主要用于FPGA先生的开源项目，通过仿真和＃34非常准确地重现经典游戏硬件;核心＆＃34;这复制了原始系统的原理图中涉及的每个单个逻辑门（大多数模拟和＃39; S高端复古硬件由FPGA核心相似）。此类核心目前可用于从奥德赛2通过Neo Geo Era等等的游戏机。\n PEIP＆＃39;新的＆＃34;特殊版本＆＃34;在游戏男孩的推进FPGA核心工作相对简单，在单一的先生中运行两个GBA核心。作为PEIP解释，＆＃34;您获得2个原始GBA核心，一个连接到SDRAM，一个连接到DDR3，直接在FPGA内进行通信。声音仅从核心1使用。＆＃34;\n     因此，目前可以在单个先生的单一主体上播放最初设计用于通过链路电缆连接的两个控制台上的游戏，其中单个连接显示器，如本演示视频中所示。 PEIP说明＆＃34;应该支持大多数多人游戏，＆＃34;一份声明，可能包括原始游戏男孩游戏（通过支持的次级模式在GBA链路电缆上工作）。在原始硬件上播放这些多人GBA游戏需要两个单独的游戏，两个副本，以及GBA链接电缆，确保大多数休闲玩家可能从未烦恼（一些GBA游戏提供的Multplay，只有一个盒式盒提供有限的多人游戏）。虽然以前的GBA仿真器提供了链路电缆支持，但即使在两个独立的机器之间需要LAN或Internet连接，甚至需要两个单独的显示器。虽然一些Rethopie用户已经完成了一些亵渎游戏，以获得通过分裂屏幕工作的原始游戏男孩的多人游戏，我们从未见过类似的单机，一体化的游戏男孩推进多人游戏在此之前。\n PEIP＆＃39;对于多人GBA仿真的Curnkey Test核心目前仅通过支持他的Patreon可用，目前缺少其他GBA核心的可见功能等功能。仍然，我们＆＃39;重新激发有一个新的，更容易使用的方法，可以在某些经典便携式标题中尝试忽略的多人游戏模式。现在，如果我们只能获得对这四名球员GBA标题的拆分支持...... ", "note_en": "Here at Ars, we&#39;re big fans of situations where emulation creates a classic gaming experience that&#39;s actually  better than what you could get with original hardware in some way or another. In the past, that has meant  upsampling rotated sprites in SNES&#39; &#34;Mode 7&#34; games or  adding &#34;widescreen&#34; support to NES games or  mitigating the controller lag that was built into certain older consoles or  overclocking an emulated SNES to remove slowdown without ruining gameplay timing. The latest emulation-powered retro-gaming upgrade to cross our paths greatly simplifies an oft-overlooked capability built in to many Game Boy Advance titles. Namely, it adds the ability to play multiplayer titles in split screen on a single display.\n This upgrade is the work of  Robert Peip, a developer who&#39;s spent years working on  field-programmable gate arrays (FPGAs). These days, Peip works primarily on  the MiSTer FPGA an open source project that recreates classic gaming hardware extremely accurately through emulation &#34;cores&#34; that replicate every single logic gate involved in the schematics of the original system (most of  Analogue&#39;s high-end retro hardware is similarly powered by FPGA cores). Such cores are  currently available for consoles ranging from the Odyssey 2 through the  Neo Geo era and more.\n Peip&#39;s new &#34;special version&#34; of  the Game Boy Advance FPGA core works relatively simply, running two GBA cores in a single MiSTer. As Peip explains, &#34;you get 2 raw GBA cores, one connected to SDRAM, one connected to DDR3, communicating directly inside the FPGA. Sound is used from Core 1 only.&#34;\n     Thus, games originally designed to be played on two consoles connected via link cable can now be played in split screen on a single MiSTer with a single connected display, as shown  in this demonstration video. Peip says that &#34;most multiplayer games should be supported,&#34; a statement that presumably includes original Game Boy games (which work on a GBA link-cable through a supported secondary mode). Playing these multiplayer GBA games on original hardware required two separate consoles, two copies of the game, and a GBA link cable, ensuring most casual players probably never even bothered (some GBA games offered limited multiplayer with just one cartridge). And while previous GBA emulators  have offered link-cable support, even that required a LAN or Internet connection between two separate machines with two separate displays. While some RetroPie users have  done a bit of finagling to get multiplayer games for the original Game Boy working via split screen, we&#39;ve never seen a similar one-machine, one-display solution for Game Boy Advance multiplayer games before this.\n Peip&#39;s turnkey test core for multiplayer GBA emulation is currently only available by  supporting his Patreon, and it is currently missing features like savestates, fast forward, and visual filters available on other GBA cores. Still, we&#39;re excited to have a new, easier-to-use method to try the oft-ignored multiplayer modes in some classic portable titles. Now if we could only get split-screen support for those four-player GBA titles...", "posttime": "2021-06-18 06:00:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,game", "title": "游戏男孩推进游戏通过新的FPGA核心获得分屏多人游戏 ", "title_en": "Game Boy Advance game gets split-screen multiplayer through new FPGA core", "transed": 1, "url": "https://arstechnica.com/gaming/2021/06/game-boy-advance-game-gets-split-screen-multiplayer-through-new-fpga-core/", "via": "", "real_tags": ["游戏", "game"]}, {"category": "", "categoryclass": "", "imagename": "6c70ec4e71843fb72b6ed1d334a2f998.jpg", "infoid": 1066598, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这三只绵羊是由纽约的初创型Qidni Labs的水牛，追求无水和移动血液净化系统的持续动物研究的一部分。 Qidni Labs成立于2014年，已筹集了150万美元，目前处于尽职调查过程，导致另一轮资金。 Qidni Labs还是2019年Kinneyx峰会的奖获奖者，用于开发可穿戴肾脏治疗装置的空气清除系统。\n 夹克是Qidni的移动血液透析机的原型，称为Qidni / d。 Qidni / D背后的想法是它将明显小于传统的血液透析设置，并使用较少的流体，让患者更加移动。\n  “我们看到这款设备，以及这项技术，成为血液净化技术的桥梁，允许患者成为移动，虽然我们预计是第一个产品，”Qidni的创始人和首席执行官Morteza Ahmadi说实验室。\n 根据CDC，美国七分之一的人有一些慢性肾病。随着时间的推移，可以进展肾功能衰竭，此时建议患者开始透析或接受移植。该阈值通常是基于症状的;人们可能会遇到体重减轻，呼吸急促或不规则脉搏，以命名几种症状。\n 有两种主要类型的透析：血液透析或腹膜透析。血液透析通过过滤器和液体称为透析液的液体，而腹膜透析将流体插入到吸收毒素的身体中，然后将其排出。 Qidni / D是一种血液透析机，可以适合绵羊尺寸的夹克，并使用自己的盒和基于凝胶的系统来减少进行透析所需的液体量。 （TechCrunch的设备的图像）。\n 在早期的动物试验中，结果尚未在同行评审杂志中发表的结果 - 该装置能够在足够剂量的传统透析的阈值下减少绵羊血液中的尿素水平。 TechCrunch通过缩放的研究审查了数据。\n  这些绵羊没有正常的肾脏，并将机器连接到4八个半小时之间。 Morteza补充说，到目前为止的数据表明，4小时的治疗应该足以清洁羊的血液。 \n这只是一个小动物研究，因此很难从中吸取大规模的结论。例如，它不包括活性控制臂，而是将从绵羊血液中除去的尿素和电解质的量与透析的其他研究中出现的标准进行比较。\n 单独的研究远远不够，表明该技术已准备好进行市场，但公司内部的技术正在将其作为一个好兆头，即Qidni的移动透析机的设计进一步测试。\n “我们可以说，在这项研究中，我们可以根据数据取代日常透析，”他说。\n 该团队将继续在今年更多的羊的研究中调整技术，并旨在在2022年开始人类试验。总体目标是提出FDA批准，只要临床研究可以表现出安全性和效率，就在第二个2023年的一半。\n 肾脏处理景观是透析的主导，透析是一种繁重的治疗方法 - 尽管肾脏移植在许多情况下，可以缓解这种负担。\n 目前，患有末期肾病的较多人在透析比接受肾移植术后。 CDC估计，美国786,000人患有最终阶段肾功能衰竭，其中71％在透析和29％接受移植物。\n 透析行业，特别是Fresenius和Davita，这两个巨人控制了大约70％的行业，也具有争议性和复杂性的表现史。 \n肾脏治疗景观也是值得注意的，因为它被医疗保险所覆盖，但是，它保持昂贵。透析和移植占Medicare预算的百分之七。由于这种复杂的景观，初创公司一直在追求植入肾脏等替代品。\n Qidni目前的产品不是人工肾脏，因为它可以永远活在参与者身体中并替换非功能性器官。相反，它对透析更加手机。血液净化装置Qidni / D是公司的主要重点。\n  也就是说，Qidni / D确实有一些独特的元素，可以使其成为“破坏性”，因为Morteza希望它将成为。即，其体积小，水需求量低。\n 在透析治疗的平均一周，普通人通过CDC暴露于约300至600升的水。其中一些水用于透析液溶液中，有助于浸出血液中的毒素。每次Morteza，每次治疗会议只使用一杯水，其中大部分包含透析液溶液。\n 他说：“在我们的理解中，这可能是世界上第一个在大型动物模型中很长一段时间内有用的血液净化的世界之一，”他说。\n 除去透析的液体成分可以简化已经繁重的过程。对于一个人来说，Morteza希望这将使家庭透析更可达（减少严格的水安全要求）和限制感染风险（有关在透析期间有时发生的水有关的感染）。\n 它也是一种旨在产生植入肾的一小步，理想情况下，不需要大量的外部流体 - 尽管移动透析仍然是Qidni的目前的焦点。该公司即将到来的一轮将集中在小型人体试验中测试他们的墨盒技术。 \n“在这一轮资金中，我们将筹集250万美元，这应该需要我们在一小组患者中测试这项技术，并使用我们自己的墨盒而不是现有的透析液，而不是现有的透析液，而不是现有的透析液。 他说。  它最终迈出了一步的一步，迈出了一种功能更像它应该模仿的器官，尽管患者的圣杯是最终首先结束透析的溶液。 ", "note_en": "These three sheep are part of an ongoing animal study run by the Buffalo, New York-based startup Qidni Labs, a company pursuing waterless and mobile blood purification systems. Qidni Labs was founded in 2014, has raised $1.5 million and is currently in the due diligence process leading up to another round of funding. Qidni Labs was also an   award winner  at the 2019 KidneyX Summit for developing an air removal system for a wearable renal therapy device.\n The jackets are a prototype of Qidni’s mobile hemodialysis machine called Qidni/D. The idea behind Qidni/D is that it will be significantly smaller than a traditional hemodialysis setup and use fewer fluids, allowing patients to be more mobile.\n  “We see this device, and this technology, to be a bridge to a blood purification technology that allows the patients to be mobile, although we do not anticipate that to be the first product,” says Morteza Ahmadi, the founder and CEO of Qidni Labs.\n Per the CDC , about one in seven people in the US have some type of chronic kidney disease. Over time, that could progress kidney failure, at which point it’s recommended that patients start dialysis or receive a transplant. That threshold is typically   symptom based ; people might experience weight loss, shortness of breath or an irregular pulse to name a few symptoms.\n There are two major types of dialysis: hemodialysis or peritoneal dialysis. Hemodialysis passes blood through a filter and a liquid called dialysate, whereas peritoneal dialysis inserts fluid into the body, which absorbs toxins, then drains it out. Qidni/D is a hemodialysis machine that can fit into a sheep sized jacket, and uses its own cartridges and gel-based system to cut down on the amount of liquid needed to perform dialysis. (TechCrunch reviewed images of the device).\n In an early animal trial – the results of which have not yet been published in a peer-reviewed journal – the device was able to reduce levels of urea in sheep’s blood at the threshold of an   adequate dose of traditional dialysis . TechCrunch reviewed data from the study over Zoom.\n  These sheep had no functioning kidneys, and were hooked up to the machine for between four and eight and a half hours. Morteza adds that the data so far suggests that four hours of treatment should be sufficient to cleanse the sheep’s blood.\n This is just one small animal study, so it’s hard to draw massive conclusions from it. It didn’t include an active control arm, for instance, and instead compared the amount of urea and electrolytes removed from the sheep’s blood to published standards from other studies on dialysis.\n The study alone is far from enough to suggest that the technology is ready for market, but those within the company are taking it as a good sign that the design of Qidni’s mobile dialysis machine bears further testing.\n “We can say that in this study, we could replace daily dialysis based on the data,” he says.\n The team will continue to tweak the technology in more sheep-based studies this year, and is aiming to begin human trials in 2022. The overall goal is to file for FDA approval, provided that clinical studies can demonstrate safety and efficacy, by the second half of 2023.\n The kidney treatment landscape is dominated by dialysis, which is an onerous treatment – despite the fact that a kidney transplant, in many cases, could relieve that burden.\n At the moment, far more people with end stage renal disease are on dialysis than receive kidney transplants.   The CDC estimates  that 786,000 people in the US live with end stage renal failure, of which 71 percent are on dialysis and 29 percent have received transplants.\n The dialysis industry, and in particular Fresenius and DaVita, the two giants that control about   70 percent  of the industry, also has a   controversial and complicated history  of poor performance.\n The kidney treatment landscape is also notable because it’s covered by Medicare, however, it remains expensive. Dialysis and transplants make up about   seven percent  of Medicare’s budget. Because of this complex landscape, startups have been pursuing alternatives like   implantable kidneys .\n Qidni’s current product is not an artificial kidney in that it could live forever in the body of a participant and replace a non-functional organ. Rather, it’s a more mobile take on dialysis. Qidni/D, the blood purification device, is the company’s main focus for the time being.\n  That said, Qidni/D  does have some unique elements that may make it as “disruptive” as Morteza hopes it will be. Namely, its small size, and low water requirements.\n During an average week of dialysis treatment, the average person is exposed to about   300 to 600 liters of water , per the CDC. Some of that water is used in the dialysate solution that helps to leach toxins out of the blood. Per Morteza, Qidni/D uses just one  cup of water per treatment session, most of which is contained with the dialysate solution.\n “In our understanding, this is probably one of the first times in the world that waterless technology is useful for blood purification over a long period of time in a large animal model,” he says.\n Removing the liquid components of dialysis may streamline an already onerous process. Morteza, for one, hopes that this would make at-home dialysis more attainable (fewer stringent water safety requirements) and limit risks of infection (  water-related infections  sometimes occur during dialysis).\n It’s also a small step towards creating an implantable kidney, which would, ideally, not require massive amounts of external fluid – though mobile dialysis remains Qidni’s current focus. The company’s upcoming round will be focused on testing their cartridge technology in small human trials.\n “In this round of funding we would be raising $2.5 million, and that should take us to a point that we can test this technology in a small group of patients, connected to an existing dialysis machine using our own cartridges instead of existing dialysate,” he says.\n It’s ultimately a step towards a machine that functions more like the organ it’s supposed to mimic, though the holy grail for patients is a solution that ends the need for dialysis in the first place.", "posttime": "2021-06-18 05:59:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "透析,animal", "title": "移动透析启动眼睛在鼓励动物研究后2022年的人类试验 ", "title_en": "\n\t\t\t\tMobile dialysis startup eyes human trials in 2022 following encouraging animal study\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/17/mobile-dialysis-startup-eyes-human-trials-in-2022-following-encouraging-animal-study/", "via": "", "real_tags": ["透析", "animal"]}, {"category": "", "categoryclass": "", "imagename": "7fb42ae88c58e2f2b4381818592ae423.png", "infoid": 1066597, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这种不寻常的方式对其品牌的车辆应用程序可能会在用户数据和收入通过轮胎替换和保险等服务的销售方面对CANOO的大次偿还。如果普通的Canoo驱动程序拥有另外两辆车，这可能意味着50,000件销售的Canoos可以产生高达15万辆的数据，Canoo的全球客户旅程和亚太山基督徒Treiber的高级VP。\n “让我们考虑整体机会，”他说。 “Canoo Ecosystem，但为整个客户车库。”\n  对于所有车辆 -  CANOO或没有 - 将其挂钩到应用程序中，驱动程序将能够看到其EV的范围和电池寿命的详细信息，以及内燃机的内燃机的总范围，以及其内燃机的总范围车辆。 Treiber表示，这可以简单地使用ODB连接器来实​​现。\n “我们知道如何在汽车中翻译数据，我们知道如何拍摄那个元数据并投入服务维护，维修和资产信息，因为这就是我们所做的，我们建立了一亿美元的业务，”Canoo首席执行官Tony Aquila告诉TechCrunch。 “所以我们可以为您提供该数据并为您做这一点。在我们的平台上没关系。这只是一个obd加密狗。 OEMs在愚蠢的东西上花钱，我们宁愿为你的第二辆车给你一个加密狗。如果您想连接它，您可以在同一应用程序中运行它。“\n 阿奎拉在4月份在4月20日和4月25日的联合创始人斯特凡·克劳德和Ulrich Kranz分别离开了赫洛掌舵。 （Kranz被Apple聘用，帮助开发其第一辆车。）Aquila成立了2005年的Solera Holdings，是一个风险管理和资产保护软件公司。\n CanoO希望使用它的应用程序以及其他方式推动收入。对于Canoo汽车，驱动程序可以访问维护和升级部分，以便立即升级其车辆的马力，安排服务预约或检查软件更新。高达94％的电子控制单元将具有无线更新能力。该应用程序还将提出预测磨损和撕裂提醒，因为您可能需要新的轮胎 - 它将提前推出这些服务的特殊优惠。\n  司机还将能够订购Canoo的其他车辆升级，如屋顶架或地板或座椅保护。 \n这些功能中的大部分 - 尤其是非Canoo车辆的服务 - 可能会通过与服务提供商，保险公司和车辆细节的伙伴关系来团结。 Trieber暗示其他潜在的伙伴关系，例如使用Canoo应用程序作为数字钱包，以便在餐厅支付一餐，例如  “汽车行业的最大机会正在货币化数据，我们希望成为其中的一部分，我们将成为其中的一部分，”他说。  该消息在本公司的投资者日演讲中宣布，阿奎拉还透露了俄克拉荷马州作为首款工厂的遗址。 该地点预计将于2023年开放。Canoo的首次亮相生活方式车辆预计将于2022年第四季度交付，将由荷兰的合同制造商VDL Nedcar制造，而工厂正在建造。 ", "note_en": "This unusual approach to its branded vehicle app could potentially pay off big-time for Canoo in terms of user data and revenue via sales on services like tire replacements and insurance. If the average Canoo driver owns two other vehicles, that could mean that 50,000 sold Canoos could yield data on up to 150,000 vehicles total, Canoo’s senior VP of global customer journey and aftersales Christian Treiber said.\n “Let’s think about the opportunity overall,” he said. “The Canoo ecosystem, but for the entire customer garage.”\n  For all vehicles – Canoo or not – that are hooked into the app, the driver will be able to see details on range and battery life for their EVs, as well as the odometer, miles per gallon, and total range for their internal combustion engine vehicles. Treiber said this could be accomplished simply using an ODB connector.\n “We know how to translate data in cars, we know how to take that metadata and put in service maintenance, repair and asset information, because that’s what we’ve done, we’ve built a multi billion dollar business doing this,” Canoo CEO Tony Aquila told TechCrunch. “So we can take that data and do that for you. It’s nothing for us on our platform. It’s just an OBD dongle. OEMs spend money on stupid stuff, we’d rather give you a dongle for your second car. If you want to connect it, you can run it all off the same app.”\n Aquila took the helm at Canoo in April, after co-founders Stefan Krause and Ulrich Kranz departed in June 2020 and April, respectively. ( Kranz was hired by Apple to help with the development of its first car.) Aquila founded Solera Holdings in 2005, a risk management and asset protection software company.\n Canoo’s hoping to use its app to drive revenue in other ways as well. For Canoo cars, drivers can access the Maintenance and Upgrades section to instantly upgrade the horsepower of their vehicle, schedule a service appointment or check for software updates. Up to 94% of the electronic control units will have wireless updating capability. The app will also make predictive wear and tear reminders for when you’ll likely need new tires – and it will push special offers for these services in advance.\n  Drivers will also be able to order other vehicle upgrades for the Canoo, like a roof rack or floor or seat protection.\n Much of these features – especially the services for non-Canoo vehicles – will likely come together through partnerships with service providers, insurance companies and vehicle detailers. Trieber hinted at other potential partnerships as well, such as using the Canoo app as a digital wallet to pay for a meal at a restaurant, for example\n “The single greatest opportunity for the automotive industry is monetizing data, and we want to be part of it, and we will be part of it,” he said.\n The news was announced during the company’s investor day presentation Thursday, where Aquila also revealed  Oklahoma as the site for its first factory. That location is expected to open in 2023. Canoo’s debut lifestyle vehicle, which is expected to  be delivered in the fourth quarter of 2022, will being manufactured by Netherlands-based contract manufacturer VDL Nedcar while the factory is being built.", "posttime": "2021-06-18 05:59:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "canoo", "title": "Canoo想将所有者连接到他们所有的车辆 - 不仅仅是Canoo的 ", "title_en": "\n\t\t\t\tCanoo wants to connect owners to all of their vehicles — not just Canoo’s\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/17/canoo-wants-to-connect-owners-to-all-of-their-vehicles-not-just-canoos/", "via": "", "real_tags": ["canoo"]}, {"category": "", "categoryclass": "", "imagename": "274a1ee80ae6222dd8924a1969d02fc5.jpg", "infoid": 1066595, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Warning: Can only detect less than 5000 characters\n框表示，新工具使班车能够满足组织的更广泛的迁移方案脸上移除旧版技术和集中内容时。 ...... ", "note_en": "Business-side\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdevelopers\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t&#39;often\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsee\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmore\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tinnovative,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsometimes\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsimplistic,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsolutions\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twhat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmight\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcome\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfrom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIT\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tperspective.&#39;\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBut\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIT\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tstill\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tneeds\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tstand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tby.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Google emphasizes being able to speed Web applications without having to port code to the ARM instruction set.\n  We\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcan&#39;t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trecommend\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twhich\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\texchanges\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tare\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbest\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsafest\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t(our\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlawyers\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twon&#39;t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlet\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tus)\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbut\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thave\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\texplored\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsome\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tleading\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\texchanges\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thelp\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyou\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlearn\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tabout\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpros\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcons\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\teach.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  The\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlatest\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\titeration\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tplatform\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tputs\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSalesforce\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmore\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdirectly\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tin\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcompetition\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twith\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tother\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSaaS\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tvendors\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twith\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tHCM\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tproducts,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlike\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWorkday\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOracle,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tas\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthey\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tall\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\taim\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thelp\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\torganizations\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  A\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsurvey\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIT\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tleaders\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\treveals\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tinnovation\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trisk\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tas\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIT\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdemands\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trise.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tHowever,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIT\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tleaders\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tview\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbusiness-led\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlow-code/no-code\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tapplication\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdevelopment\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tas\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tprudent\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tinevitable\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Oracle posted better-than-expected top and bottom-line results, thanks partly to the strong revenue growth rates of its ERP and HCM applications.\n  The\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tluxury\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgoods\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tconglomerate\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twill\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tleverage\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGoogle\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttechnologies\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trange\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpurposes,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfrom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tupdating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tits\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIT\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tinfrastructure\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcreating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpersonalized\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcustomer\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\texperiences\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthrough\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Box\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsaid\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnew\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttools\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tenable\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tShuttle\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmeet\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twider\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trange\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmigration\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tscenarios\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\torganizations\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tface\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twhen\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmoving\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\toff\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlegacy\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttechnology\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcentralizing\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcontent\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ton\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBox.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...", "posttime": "2021-06-18 05:51:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "adobe,q2,满足", "title": "Q2的Adobe Beats营收为3.84亿美元，同比增长23％，VS EST。3.73亿美元，数码媒体的收入同比增长25％，创造性增长24％，并记录云30％ ", "title_en": "Adobe beats in Q2 with revenue of $3.84B, up 23% YoY, vs est. of $3.73B, with YoY revenues of Digital Media up 25%, Creative up 24%, and Document Cloud up 30%", "transed": 1, "url": "https://www.zdnet.com/article/adobe-beats-q2-expectations-with-growth-across-core-clouds/", "via": "", "real_tags": ["adobe", "q2", "满足"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066594, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在与两名团队成员谈论2018年夏季学校的工作人员会议之后，我想我可以把自己放进你的鞋子。\n 那一天，演示文稿并没有走路，我认为他们应该有。我们共同参加评估会议。我认为房间里的每个人都在这样的环境中，我希望他们以这种方式看到自己。我清楚地，我是最古老，最经验的 - 我应该以这种方式行事，在验尸的谈话中。但我没有。我有情感和过于连续的会议。我一定是针对你的愤怒言语，谁清楚地用这一天的日子。这伤害了你，它将所有的互动偏离从那时起。为此，我道歉。\n  让我补充说，我很感激你以“我仍然使用的是，我不希望任何人思考另有思考。”它必须有倾向于将这两个想法一起编织。所以谢谢。\n  最后，当你肯定回忆时，我鼓励你在2019年，亲自电子邮件，加入球拍领导;我甚至提出你可以取代我。我一直认为你的经历和你的外观会使我们的工作变得。我仍然这么认为。 ", "note_en": "After talking to two team members who recalled our staff meeting at the 2018Racket Summer School better than I did, I think I can put myself into your shoesnow.\n That day, the presentations hadn’t gone the way I thought they should have. Wegot together for our assessment meeting. I think of everyone in the room as anequal in such settings, and I expect them to see themselves this way. I clearlyforget that I am the oldest and most experienced— and I should act this way ina post-mortem conversation. But I didn’t. I got emotional and overly intenseduring the meeting. I must have directed angry words at you, who clearly hadnothing to do with how the day had gone. And this hurt you and it definitelyjaded all of our interactions from then on. For this, I apologize.\n  Let me add that I am grateful that you wrote in the spirit of “I am still usingRacket, and I don’t want anyone to think otherwise.” It must have beendifficult to weave these two thoughts together. So, thank you.\n  Finally, as you surely recall, I encouraged you throughout 2019, in person andin email, to join the Racket leadership; I even proposed you could replace me.I always thought that your experience and your outside view would seriouslyimprove our work. I still think so.", "posttime": "2021-06-18 05:51:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "道歉,apology,认为", "title": "道歉 ", "title_en": "Apology", "transed": 1, "url": "https://felleisen.org/matthias/Thoughts/Apology.html", "via": "", "real_tags": ["道歉", "apology", "认为"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066593, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个过程是自动的。 您的浏览器将很快重定向到所要求的内容。 ", "note_en": "This process is automatic. Your browser will redirect to your requested content shortly.", "posttime": "2021-06-18 05:51:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,宽带,broadband", "title": "FCC为ISP $ 8k提供宽带宽带距苹果5B校园5英尺 ", "title_en": "FCC Gives ISP $8k to Deliver Broadband Five Feet from Apple's $5B Campus", "transed": 1, "url": "https://www.techdirt.com/articles/20210615/09130146993/fcc-gives-isp-8000-to-deliver-broadband-five-feet-apples-5-billion-campus.shtml", "via": "", "real_tags": ["苹果", "apple", "宽带", "broadband"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066592, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Artsey是一种单手键盘系统，使用2x4布局中的8个键。该系统旨在易于学习，使用舒适，并且足够快，以进行实际使用。\n   艺术是一个适用于各种能力的系统。标准系统可以通过四个手指完全操作，在一小范围的运动范围内。左右和右手使用有布局。几乎任何可以用正常键盘完成的计算机活动也可以通过艺术来实现。事实上，这个网站是完全与艺术委员会写的。\n 为了实现完整功能，组合用于许多字母，符号，修饰符和正常键盘上可用的其他命令。虽然这些组合起初可能是令人生畏的，但是艺术品的基础知识可以在一个小时内学习。许多新的艺术用户能够操作他们的计算机，而无需在使用的前几天内引用布局图。可以使用专用实践超过50WP的速度。\n     由于仅使用四个手指，因此拇指可以自由稳定并保持板。这简化了用于艺术品的便携式手持式键盘的硬件设计。这些板可以使用标准机械键盘开关作为信用卡等。\n  QMK（QMK固件存储库）和ZMK（ZMK固件存储库）的GitHub页面上提供了artsey的实现。 ", "note_en": "ARTSEY is a one-handed keyboard system using 8 keys in a 2x4 layout. The system is designed to be easy to learn, comfortable to use, and fast enough for practical use.\n   ARTSEY is a system for people of all abilities. The standard system can be fully operated by four fingers over a small range of motion. There are layouts for both left- and right-handed use. Almost any computer activity that can be done with a normal keyboard can also be achieved with ARTSEY. In fact, this website was written entirely with an ARTSEY board.\n To achieve full functionality, combos are used for many of the letters, symbols, modifiers, and other commands available on a normal keyboard. While these combos might be intimidating at first, the basics of ARTSEY can be learned in under an hour. Many new ARTSEY users are able to operate their computers without referencing the layout diagram within the first few days of use. Typing speeds over 50wpm are possible with dedicated practice.\n     Since only four fingers are used, the thumb is free to stabilize and hold the board. This simplifies the hardware design for portable hand-held keyboards made for ARTSEY. These boards can be made as small as a credit card using standard mechanical keyboard switches.\n  Implementations of ARTSEY are available on our github page for QMK ( QMK Firmware Repository) and ZMK ( ZMK Firmware Repository).", "posttime": "2021-06-18 05:51:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "艺术,键盘,单手,handed", "title": "艺术 - 单手键盘 ", "title_en": "Artsey – One-Handed Keyboard", "transed": 1, "url": "https://artsey.io/", "via": "", "real_tags": ["艺术", "键盘", "单手", "handed"]}, {"category": "", "categoryclass": "", "imagename": "a5e2ea014edbab0460a656dcaafbe14a.png", "infoid": 1066591, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你走向墙壁，光线将合同。你越靠近墙壁，越来越浓缩的光束变成了。当手电筒从墙壁上英寸时，你会看到一个紧张，明亮的光线，被阴影和黑暗包围。\n 你的注意力很像是那个手电筒的光束。您可以紧密地专注于某些东西，或者您可以放松它 - 让它变得柔软和漫射。\n 死亡不是一件事，但事情：情绪的过程，州的州，突然变化的关系，需要的嗡嗡行为，空椅，一个没有连接的拨打号码。在悲伤的离合器中，死亡可能看起来像一个事件，窗帘的跑步越来越多，我们都不能看到 - 但它也是一条路，旅程，一个过程。\n  在我的书死亡的夏天外套中，我谈论人类需要分类和区分。我们想说：肯定死亡......\n 我在呃看到一个Covid病人已经很久了，我不能更快乐\n  我是纽约市的急诊室医生，在几周内我还没有看到Covid-19患者。让我的旧工作感觉很棒。\n 在2020年3月，Covid淹没了我们的分校。起初，它只是一个手机 - 每天一个或两个科迪德患者。但在一周之内，病毒在每张床上都接管了每个床。急诊室的每一个班次都带来了一个无休止的患者，一个接一个地努力呼吸和绝望地需要氧气。 \nCovid抵达我们急诊室的迅速令我们惊讶地带来了......\n 在Covid-19之后，我们都悲伤。我们怎样才能死亡来术语 - 以及它教我们关于生活的方式是什么？\n    我们正在前往西弗吉尼亚州的一路，到一个不起眼的两层殖民地，我的祖父遗骸被冲洗并奠定了观察。它一直在下雨，但显然没有人在这个雄厚的葬礼厅里一直在睡觉。他们一直坐在身体上。坐起来 - 和身体 - 整晚。\n 没有良好的形容词来描述我对此的感受。我十七岁，悲伤，但我并不恐惧。震惊......\n 几种策略可以帮助防止向下的螺旋 - 他们都开始伸出援手\n  这是一个四部分系列的第二部分，防止抑郁症，一种可以在任何年龄袭击的严重和生长的精神障碍，如果未经治疗，持续和恶化。\n 雨天经常让我失望。即使有点阴云密布也可以让我进入一个恐惧。有时候我只是因为没有好理由而变得喜怒无常。这一切都正常。但是，当悲伤的感情仍然存在日复一日的时候，我们中的任何一个 - 我，你，一个家庭成员或朋友 - 冒着陷入衰弱的抑郁症的风险。没有免疫力。然而，有效的预防策略。 \n更广泛的世界仍然没有被解雇的时间越长，毁灭性新变种的风险就越大\n  在最近由监护人报纸获得的一封信中，超过100名前总统和国家元首敦促世界上最富有的国家的领导者更多 - 筹备更多的资金，特别是更多的援助和资源 - 致力于制作和资源在全球分布疫苗。\n 据守护者表示，“直到每个人都有安全的，就没有人安全，直到每个人都是安全的。\n 这不仅仅是崇高的谈话，而且它不仅仅是为了未被移开的辩护。那是冷的现实。\n 我正在阅读我的UMPTENTH新闻故事关于Covid-19科学，一个关于如何使室内空间免受感染的最新研究的故事，关于清洁表面还是改变空气更为重要。这令我困扰着我。不是因为它是沉闷的（当然，这是：有珍贵的少数方法可以使空气过滤和空气泵的边缘的东西）。但由于它对科学的方式。\n 您认为，它报告的大部分研究是以互联网上互联网上的研究人员分享的预先印刷品的形式......\n 这是一系列预防抑郁症的四部分系列中的第一个，这是可以在任何年龄袭击的严重和生长的精神障碍，如果未经治疗，持续和恶化。 \nNaomi Osaka从法国开放的退出 - 沉淀着“巨大的焦虑”，这位23岁的感觉超过了强制性的新闻事件，“漫长的萧条萧条”她说她自2018年以来一直处理 - 突出了阴影的现实抑郁症世界，在任何年龄的任何年龄，我们中的任何一个都可以潜入我们任何年龄的常见条件，原因是明显或神秘的。\n 对于2012年的PLOS学习，研究人员邀请了一个年轻女性进入了俄亥俄大学的实验室。\n 这位女士了解到，她将参与“审美判断”实验。研究人员拍了一张她的脸，然后让她坐在持有两个物体的桌子上：计算机监视器和镜子。\n 在监视器上，这位女士浏览了一系列研究所谓的“有吸引力的专业模式” - 所有这些都是女性。在这个漂亮的面孔的栏杆之后，女人的自己的照片出现在屏幕上。但这不仅仅是......\n 尽管肠道健康意识升高，但IBS的治疗几十年来几乎没有变化\n  你可能知道钻头：你看到一位新医生，必须回答一下你的病情很长的清单。对我来说，它是一种新的胃肠学家，漫长的历史钻头筋疲力尽。是的，我有火炬升起 - 是的，他们是痛苦的。我患有IBS-C，这比说“具有便秘的肠易激综合征”稍微有礼貌。尴尬，对吗？\n 基本上，我的消化系统瘫痪了。它只是......停止。但当然，细菌不会停止;他们继续做消化事物的工作，并创造占用空间的副产品。很多空间。 ...... ", "note_en": "If you walk toward the wall, the light will contract. The closer you get to the wall, the smaller and more concentrated the beam of light becomes. By the time the flashlight is an inch from the wall, you’ll see a tight, bright circle of light surrounded by shadow and darkness.\n Your attention is a lot like the beam of that flashlight. You can focus it closely and intensely on something, or you can relax it — allowing it to grow soft and diffuse.\n Death is not a  thing , but  things: a process of emotions, states of being, suddenly shifting relationships, the buzz of needful activity, an empty chair, a dialed number that doesn’t connect. In the clutches of  grief, death may seem like a single event, the running down of a curtain beyond which none of us can see — but it is also a path, a journey, a process.\n  In my book  Death’s Summer Coat, I talk a lot about the human need to categorize and differentiate. We want to say: surely death …\n It’s been a long time since I saw a Covid patient in the ER, and I couldn’t be happier\n  I’m an emergency room doctor in New York City, and I haven’t seen a Covid-19 patient in weeks. It feels great having my old job back.\n In March 2020, Covid flooded our ERs. At first, it was just a dribble — one or two Covid patients per day. But within a week, the virus had taken over every body in every bed. Every shift in the emergency room brought an endless stream of patients, one after another, all struggling to breathe and in desperate need of oxygen.\n The swiftness of Covid’s arrival in our emergency rooms took us by surprise…\n In the wake of Covid-19, we are all grieving. How can we come to terms with death — and what does it teach us about living?\n    We were on our way to West Virginia, to an unremarkable two-story colonial where my grandfather’s remains had been washed and laid out for viewing. It had been raining all night, but apparently no one in this homey funeral parlor had been sleeping. They’d been sitting up with the body. Sitting up — with the body — all night.\n There are no good adjectives to describe my feelings about this. I was seventeen and grieving, but I wasn’t horrified. Shocked…\n Several strategies can help prevent a downward spiral — they all start with reaching out\n  This is the second in a four-part series on preventing depression, a serious and growing mental disorder that can strike at any age and, if untreated, persist and worsen.\n Rainy days often get me down. Even a little overcast can put me into a funk. Sometimes I just get moody for no good reason. That’s all normal. But when feelings of sadness persist day after day, any of us — me, you, a family member, or a friend — runs the risk of plunging into debilitating depression. There is no immunity. There are, however, effective prevention strategies.\n The longer the wider world remains unvaccinated, the greater the risk that a devastating new variant will emerge\n  In  a letter recently obtained by  The  Guardian newspaper, more than 100 former presidents and heads of state urged the leaders of the world’s wealthiest countries to do much more — to commit more money, in particular, but also more aid and resources — toward making and distributing vaccines across the globe.\n “No one anywhere is safe from Covid-19 until everyone is safe everywhere,” the letter’s signatories wrote, according to  The Guardian.\n That’s not just lofty talk, and it’s not just a plea for the sake of the unvaccinated. That is cold reality.\n I was reading my umpteenth news story about Covid-19 science, a story about  the latest research into how to make indoor spaces safe from infection, about whether cleaning surfaces or changing the air was more important. And it was bothering me. Not because it was dull (which, of course, it was: there are precious few ways to make air filtration and air pumps edge-of-the-seat stuff). But because of the way it treated the science.\n You see, much of the research it reported was in the form of pre-prints, papers shared by researchers on the internet before they are submitted to…\n This is the first in a four-part series on preventing depression, a serious and growing mental disorder that can strike at any age and, if untreated, persist and worsen.\n Naomi Osaka’s withdrawal from the French Open — precipitated by “huge waves of anxiety” the 23-year-old feels over obligatory press events and the “long bouts of depression” she says she has dealt with since 2018 — highlights the reality of the shadowy world of depression, an increasingly common condition that can sneak up on any of us, at any age, for reasons obvious or mysterious.\n For  a 2012 study in  PLOS One, researchers invited a young woman into a laboratory at Ohio University.\n The woman learned that she would be taking part in an “aesthetic judgment” experiment. The researchers took a photograph of her face and then asked her to sit at a table that held two objects: a computer monitor and a mirror.\n On the monitor, the woman viewed a series of headshots of what the study termed “attractive professional models” — all of them women. Following this barrage of beautiful faces, the woman’s own photograph appeared on the screen. But it wasn’t just…\n Despite the rise in gut health awareness, treatments for IBS have barely changed in decades\n  You probably know the drill: you see a new doctor and have to answer a long checklist about your condition. For me, it’s a new gastroenterologist, and the long history bit is exhausting. Yes, I have flare ups — yes, they are painful. I suffer from IBS-C, which is slightly more polite than saying “irritable bowel syndrome with constipation.” Embarrassing, right?\n Essentially, my digestive system goes paralytic. It just…stops. But of course, bacteria  don’t stop; they continue doing the work of digesting things and creating byproducts that take up space. A lot of space. …", "posttime": "2021-06-18 05:51:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "同行,peer", "title": "同行评审的荒谬 ", "title_en": "The Absurdity of Peer Review", "transed": 1, "url": "https://elemental.medium.com/p/1d58e5d9e661", "via": "", "real_tags": ["同行", "peer"]}, {"category": "", "categoryclass": "", "imagename": "2b44aa9e36ba13e730d8a132cc779a44.png", "infoid": 1066590, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "AWS步骤功能允许您使用状态机构建可扩展的分布式应用程序。直到今天，建立一步函数的工作流程需要您学习和理解亚马逊状态语言（ASL）。今天，我们正在启动工作流工作室，一个低码视觉工具，可帮助您通过导向的交互式界面学习步骤功能，并允许您更快地构建和构建工作流程。\n  2016年12月，当推出阶段函数时，我正在迁移到无要的迁移。我的团队从为一个无服务器架构为一个传统环境构建的应用程序移动了所有业务逻辑。虽然我们尝试拥有一件事和一件事的功能，但是当我们将所有国家管理从我们的应用程序放入函数时，它们变得非常复杂。当我看到推出阶段函数时，我意识到他们会降低我们建造的无服务应用程序的复杂性。缺点是我花了大量的时间学习和写作状态机使用ASL，学习如何调用不同的AWS服务，并执行所需状态机的流操作。花了数周的工作和大量的测试来实现它。\n  步骤功能对于可视化分布式应用程序内的进程，但是开发这些状态机不是视觉过程。 Workflow Studio使开发人员可以轻松构建无服务器工作流程。它使开发人员能够专注于他们的高价值业务逻辑，同时减少了工作流定义和构建数据转换的时间花费编写配置代码。\n  工作流程工作室非常适合新的开发人员，他们是逐步函数的新开发人员，因为它减少了建立他们的第一个工作流程的时间，并提供了开发人员通过执行学习的加速学习路径。工作流工作室对在构建工作流程中经验丰富的开发人员也很有用，因为他们现在可以使用可视化工具更快地开发它们。例如，您可以使用Workflow Studio进行工作流的原型，并快速与您的利益相关方分享。或者您可以使用Workflow Studio设计状态机的样板。使用Workflow Studio时，您无需在AWS帐户中部署所有资源。您可以构建状态机并开始以其他操作完成操作，按准备就绪。\n  Workflow Studio简化了企业应用程序的建设，如电子商务平台，金融交易处理系统或电子保健服务。它摘要通过将AWS服务组装到工作流程中，摘要构建容错，可扩展应用程序的复杂性。由于Workflow Studio在可视化工作流程中公开了AWS服务的许多功能，因此可以易于序列和配置对AWS服务和API的呼叫，并将流过工作流程的数据进行转换。\n  使用Workflow Studio构建工作流程，以便在创建帐户时构建验证数据的系统。如果输入数据是正确的，系统将在持久存储中保存记录，并将电子邮件发送到管理员以确认该帐户已成功创建。如果由于验证错误而无法创建帐户，则不会存储数据，并将其发送电子邮件以通知管理员创建帐户存在问题。\n  有很多方法可以解决这个问题，但如果你想用最少的代码制作应用程序，并利用AWS提供的所有托管服务，你应该使用Workflow Studio设计状态机并构建集成所有托管服务。 \n让我向您展示使用工作流工作室创建状态机的易于易用。要开始，请转到步骤函数控制台并创建状态机。您将看到一个选项，可以使用Workflow Studio在视觉上设计新的状态机。\n    您可以在Workflow Studio中开始创建状态机。在左窗格，状态浏览器中，您可以查看和搜索可用的操作和流状态。操作是操作您可以使用AWS服务执行的操作，例如调用AWS Lambda函数，并使用Amazon API网关提出请求，并将消息发送到Amazon简单通知服务（SNS）主题。流量是您可以使用的状态类型，以便为您的用例提供适合的工作流程。\n      在页面的中心，您可以看到您目前正在处理的状态机。\n      调用Lambda函数的一个任务，验证提供的数据以创建帐户。\n      一个选择流状态，根据λ函数的结果决定要采取的操作。\n  创建工作流时，您不需要提前拥有所有AWS资源以开始在状态机上工作。您可以构建状态机，然后您可以稍后将定义添加到资源中。或者，正如我们在此博客文章中所做的那样，在开始在您的状态机上工作之前，您可以在AWS帐户中部署所有AWS资源。您可以将所需资源部署到您的AWS帐户中，从此无服务器应用程序模型模板。创建和部署这些资源后，可以继续此帖子中的其他步骤。\n  配置Lambda函数工作流程中的第一步是Lambda函数。要将其添加到状态计算机，请从操作列表中拖动调用操作，进入工作流工作室的中心，如步骤1所示。您可以在右窗格中编辑函数的配置。例如，您可以更改名称（如步骤2所示）。您还可以编辑从部署在此帐户中的功能列表中调用哪个Lambda函数，如步骤3所示。当您完成后，您可以编辑此任务的输出，如步骤4所示。 \n配置任务的输出非常重要，因为这些值将作为输入传递到下一个状态。我们将使用我们需要的信息（如果帐户有效），我们将构建结果对象（在这种情况下，如果帐户有效）。首先，使用输出路径清除过滤器输出，如步骤1所示。然后，可以使用结果选择器选择“转换结果”，然后在步骤2中添加JSON。然后，将此当前状态的输入与输出组合，然后发送到下一个状态为输入，选择组合输入并使用结果路径结果，如步骤3所示。我们需要输入这个状态，因为输入是帐户信息。如果验证成功，我们需要将该数据存储在DynamoDB表中。\n  如果需要帮助了解每个转换的情况，请在每个转换中选择信息链接。\n    配置Lambda函数后配置选择状态，您需要添加选择状态。选择将使用选择规则验证输入。根据应用这些规则的结果，状态机将执行执行到不同的路径。\n  下图显示了添加选择状态的工作流程。在步骤1中，将其从流菜单拖动。在步骤2中，您输入了一个名称。在步骤3中，您可以定义规则。对于此用例，您将拥有一个具有特定条件的规则。\n    此规则的条件将先前状态输出的结果与布尔常数进行比较。如果先前的状态操作返回一个true的值，则执行规则。这是你快乐的道路。在此示例中，您要验证Lambda函数的结果。如果函数验证输入数据，则验证的返回返回等于true，如此所示。\n    如果规则不适用，则选择状态会使默认分支运行。这是您的错误路径。\n  配置错误路径时出现错误时，要发送电子邮件，让管理员知道无法创建帐户。您应该在帖子中早些时候创建了一个SNS主题。确保在SNS主题中配置的电子邮件地址接受此主题的电子邮件订阅。 \n要添加发布消息的SNS任务，请首先搜索SNS：发布任务，如步骤1所示，然后将其拖动到状态机，如步骤2所示。将失败状态流拖到状态机，如图所示在步骤3中，使得当该执行分支完成时，状态机处于故障状态。\n  Workflow Studio的一个很好的功能是您可以在状态机中拖动不同的状态，并将其放在工作流的不同部分。\n  现在，您可以为发布消息配置SNS任务。首先，更改状态名称，如步骤4中所示。从AWS帐户中的部署中选择主题，如步骤5所示。最后，更改将在电子邮件中发送给适合您用例的消息，如步骤6所示。\n    配置快乐路径的快乐路径，您希望将帐户信息存储在DynamoDB表中，然后使用先前部署的SNS主题发送电子邮件。为此，请添加DynamoDB：PutItem任务，如步骤1所示，SNS：发布任务，如步骤2所示，进入状态机。您配置SNS：以与错误路径类似的方式发布任务。你只是发送一个不同的消息。为此，您可以从错误路径复制状态，将其拖到正确的位置，并使用新消息修改它。\n  DynamoDB：PutItem Trues将项目放入DynamoDB表中。这是一个非常方便的任务，因为我们不需要在Lambda函数内执行此操作。要配置此任务，请先更改其名称，如步骤3所示。然后，您需要配置API参数，如步骤4所示，将正确的数据放入DynamoDB表中。\n      {\r ＆＃34; tablename＆＃34 ;:＆＃34;＆lt;＆gt;＆＃34 ;,\r ＆＃34;项目＆＃34 ;: {\r ＆＃34; id＆＃34 ;: {\r ＆＃34; s。$＆＃34 ;:＆＃34; $。姓名＆＃34;\r }，\r ＆＃34; mail＆＃34 ;: {\r ＆＃34; s。$＆＃34 ;:＆＃34; $。邮件＆＃34;\r }，\r ＆＃34;工作＆＃34 ;: {\r ＆＃34; s。$＆＃34 ;:＆＃34; $。工作＆＃34;\r }\r }\r}\n  保存并执行状态机Workflow Studio为您创建了状态机的ASL定义，但您可以随时编辑ASL定义并在要编辑状态机时返回Visual Editor。 \n现在您的状态机已准备就绪，您可以运行第一个执行。 保存并开始新的执行。 启动新执行时，将显示一条消息，要求输入事件到状态机。 确保此事件的属性名为名称，邮件和工作，因为状态机的执行取决于那些。  运行状态机后，您会看到执行的可视化。 它显示了执行运行的所有步骤。 在每个步骤中，您都会看到步进输入和步进输出。 这对于调试和微调状态机非常有用。  我们的Workflow Studio路线图上有很多很大的功能。 虽然细节可能会发生变化，但我们目前正在努力为您提供视觉创建，运行甚至调试工作流执行的权力。 保持调整以获取更多信息，请随时向我们发送反馈。  Workflow Studio现在可以在所有AWS区域中使用，其中阶段功能可用。 ", "note_en": "AWS Step Functions allow you to build scalable, distributed applications using state machines. Until today, building workflows on  Step Functions required you to learn and understand  Amazon State Language (ASL). Today, we are launching  Workflow Studio, a low-code visual tool that helps you learn  Step Functions through a guided interactive interface and allows you to prototype and build workflows faster.\n  In December 2016, when  Step Functions was launched, I was in the middle of a migration to serverless. My team moved all the business logic from applications that were built for a traditional environment to a serverless architecture. Although we tried to have functions that did one thing and one thing only, when we put all the state management from our applications into the functions, they became very complex. When I saw that  Step Functions was launched, I realized they would reduce the complexity of the serverless application we were building. The downside was that I spent a lot of time learning and writing state machines using ASL, learning how to invoke different AWS services, and performing the flow operations the state machine required. It took weeks of work and lots of testing to get it right.\n  Step Functions is amazing for visualizing the processes inside your distributed applications, but developing those state machines is not a visual process.  Workflow Studio makes it easy for developers to build serverless workflows. It empowers developers to focus on their high-value business logic while reducing the time spent writing configuration code for workflow definitions and building data transformations.\n  Workflow Studio is great for developers who are new to  Step Functions, because it reduces the time to build their first workflow and provides an accelerated learning path where developers learn by doing.  Workflow Studio is also useful for developers who are experienced in building workflows, because they can now develop them faster using a visual tool. For example, you can use  Workflow Studio to do prototypes of the workflows and share them with your stakeholders quickly. Or you can use  Workflow Studio to design the boilerplate of your state machine. When you use  Workflow Studio, you don’t need to have all the resources deployed in your AWS account. You can build the state machines and start completing them with the different actions as they get ready.\n  Workflow Studio simplifies the building of enterprise applications such as ecommerce platforms, financial transaction processing systems, or e-health services. It abstracts away the complexities of building fault-tolerant, scalable applications by assembling AWS services into workflows. Because  Workflow Studio exposes many of the capabilities of AWS services in a visual workflow, it’s easy to sequence and configure calls to AWS services and APIs and transform the data flowing through a workflow.\n  Build a workflow using  Workflow Studio  Imagine that you need to build a system that validates data when an account is created. If the input data is correct, the system saves the record in persistent storage and an email is sent to the administrator to confirm the account was created successfully. If the account cannot be created due to a validation error, the data is not stored and an email is sent to notify the administrator that there was a problem with the creation of the account.\n  There are many ways to solve this problem, but if you want to make the application with the least amount of code, and take advantage of all the managed services that AWS provides, you should use  Workflow Studio to design the state machine and build the integrations with all the managed services.\n    Let me show you how easy is to create a state machine using  Workflow Studio. To get started, go to the  Step Functions console and create a state machine. You will see an option to start designing the new state machine visually with  Workflow Studio.\n    You can start creating state machines in  Workflow Studio. In the left pane, the States Browser, you can view and search the available actions and flow states. Actions are operations you can perform using AWS services, like invoking an  AWS Lambda function, making a request with  Amazon API Gateway, and sending a message to an  Amazon Simple Notification Service (SNS) topic. Flows are the state types you can use to make a workflow appropriate for your use case.\n      In the center of the page, you can see the state machine you are currently working on.\n      One task that invokes a  Lambda function that validates the data provided to create the account.\n      One choice flow state, to decide which action to take, depending on the results of a  Lambda function.\n  When creating the workflow, you don’t need to have all the AWS resources in advance to start working on the state machine. You can build the state machine and then you can add the definitions to the resources later. Or, as we are going to do in this blog post, you can have all your AWS resources deployed in your AWS account before you start working on your state machine. You can deploy the required resources into your AWS account from  this  Serverless Application Model template. After you create and deploy those resources, you can continue with the other steps in this post.\n  Configure the  Lambda function  The first step in your workflow is the  Lambda function. To add it to your state machine, just drag an Invoke action from the Actions list into the center of  Workflow Studio, as shown in step 1. You can edit the configuration of your function in the right pane. For example, you can change the name (as shown in step 2). You can also edit which  Lambda function should be invoked from the list of functions deployed in this account, as shown in step 3. When you’re done, you can edit the output for this task, as shown in step 4.\n    Configuring the output of the task is very important, because these values will be passed to the next state as input. We will construct a result object with just the information we need (in this case, if the account is valid). First, clear  Filter output with OutputPath, as shown in step 1. Then you can select  Transform result with Result Selector, and add the JSON shown in step 2. Then, to combine the input of this current state with the output, and send it to the next state as input, select  Combine input and result with ResultPath, as shown in step 3. We need the input of this state, because the input is the account information. If the validation is successful, we need to store that data in a  DynamoDB table.\n  If need help understanding what each of the transformations does, choose the  Info links in each of the transformations.\n    Configure the choice state  After you configure the  Lambda function, you need to add a choice state. A choice will validate the input using choice rules. Based on the result of applying those rules, the state machine will direct the execution to a different path.\n  The following figure shows the workflow for adding a choice state. In step 1, you drag it from the flow menu. In step 2, you enter a name for it. In step 3, you can define the rules. For this use case, you will have one rule with a specific condition.\n    The condition for this rule compares the results of the output of the previous state against a boolean constant. If the previous state operation returns a value of  true, the rule is executed. This is your happy path. In this example, you want to validate the result of the  Lambda function. If the function validates the input data, it returns validated is equals to true, as shown here.\n    If the rule doesn’t apply, the choice state makes the default branch run. This is your error path.\n  Configure the error path  When there is an error, you want to send an email to let the administrator know that the account couldn’t be created. You should have created an  SNS topic earlier in the post. Make sure that the email address you configured in the  SNS topic accepts the email subscription for this topic.\n  To add the  SNS task of publishing a message, first search for SNS:Publish task  as shown in step 1, and then drag it to the state machine, as shown in step 2. Drag a Fail state flow to the state machine, as shown in step 3, so that when this branch of execution is complete, the state machine is in a fail state.\n  One nice feature of  Workflow Studio is that you can drag the different states around in the state machine and place them in different parts of the worklow.\n  Now you can configure the  SNS task for publishing a message. First, change the state name, as shown in step 4. Choose the topic from the ones deployed in your AWS account, as shown in step 5. Finally, change the message that will be sent in the email to something appropriate for your use case, as shown in step 6.\n    Configure the happy path  For the happy path, you want to store the account information in a  DynamoDB table and then send an email using the  SNS topic you deployed earlier. To do that, add the DynamoDB:PutItem task, as shown in step 1, and the SNS:Publish task, as shown in step 2, into the state machine. You configure the SNS:Publish task in a similar way to the error path. You just send a different message. For that, you can duplicate the state from the error path, drag it to the right place, and just modify it with the new message.\n  The DynamoDB:PutItem task puts an item into a  DynamoDB table. This is a very handy task because we don’t need to execute this operation inside a  Lambda function. To configure this task, you first change its name, as shown in step 3. Then, you need to configure the API parameters, as shown in step 4, to put the right data into the  DynamoDB table.\n      {\r &#34;TableName&#34;: &#34;&lt;THE NAME OF YOUR TABLE&gt;&#34;,\r &#34;Item&#34;: {\r &#34;id&#34;: {\r &#34;S.$&#34;: &#34;$.Name&#34;\r },\r &#34;mail&#34;: {\r &#34;S.$&#34;: &#34;$.Mail&#34;\r },\r &#34;work&#34;: {\r &#34;S.$&#34;: &#34;$.Work&#34;\r }\r }\r}\n  Save and execute the state machine   Workflow Studio created the ASL definition of the state machine for you, but you can always edit the ASL definition and return to the visual editor whenever you want to edit the state machine.\n  Now that your state machine is ready, you can run the first execution. Save it and start a new execution. When you start a new execution, a message will be displayed, asking for the input event to the state machine. Make sure that the attributes for this event are named  Name, Mail and Work, because the execution of the state machine depends on those.\n  After you run your state machine, you see a visualization for the execution. It shows you all the steps that the execution ran. In each step, you see the step input and step output. This is very useful for debugging and fine-tuning the state machine.\n      There are a lot of great features on our roadmap for  Workflow Studio. Although the details may change, we are currently working to give you the power to visually create, run, and even debug workflow executions. Stay tuned for more information, and please feel free to send us feedback.\n  Workflow Studio is available now in all the AWS Regions where  Step Functions is available.", "posttime": "2021-06-18 05:50:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可视化,步骤,step,状态机", "title": "AWS步骤功能Workflow Studio  - 构建状态机的可视化工具 ", "title_en": "AWS Step Functions Workflow Studio – A Visual Tool for Building State Machines", "transed": 1, "url": "https://aws.amazon.com/blogs/aws/new-aws-step-functions-workflow-studio-a-low-code-visual-tool-for-building-state-machines/", "via": "", "real_tags": ["可视化", "步骤", "step", "状态机"]}]