[{"category": "", "categoryclass": "", "imagename": "ab138ae13c4515bed7904ce2eb1c54e8.jpg", "infoid": 1014085, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "昨天，微软在欧洲发布了一份竞争投诉，“跳到主要内容松弛”让微软大吃一惊。经过几个月的争辩，认为微软团队不是Slake的真正竞争对手，更类似于Zoom，Slake终于承认了一直以来都很清楚的一件事：微软团队是竞争对手，而Slake发现很难与微软竞争。这并不令人惊讶，但如果Slake发现很难与微软竞争，那么一旦谷歌最终采取行动，它将面临更令人头疼的问题。在摸索了多年的通信应用程序之后，有初步迹象表明，谷歌现在已经准备好与Slake、微软团队和Zoom展开竞争。\n谷歌的企业行动对Slake的欧盟反垄断竞标有着巨大的影响--以及该公司在这之后的未来。Sack似乎将面临两家巨头科技公司的挑战，它们利用自己的主导产品在工作场所通信业务中分一大杯羹。如果Slake设法说服欧盟对微软的捆绑行为采取行动，它仍然面临着谷歌以类似方式捆绑自己的应用和服务的迫在眉睫的威胁。对于反垄断斗士来说，G Suite表明捆绑问题比微软大得多。\nSack昨天发布的竞争投诉完全是针对微软的，重点是该公司的Office365订阅捆绑了多个团队。“我们要求的是将团队从Office套件中分离出来，并以公平的商业价格单独出售，这样它就可以在优点上与我们的产品竞争，”Slake的法务主管大卫·谢尔哈斯(David Schellhase)昨日在接受记者电话采访时解释道。“事情真的就这么简单明了。”\n几十年来，微软一直在其Office套件中捆绑了各种生产力应用，早在2016年推出时，它就选择了向Office 365客户免费捆绑团队。这种捆绑，加上紧密的Office集成，使得Slake很难说服那些已经在为Office付费的企业支付额外的费用来获得Slake。\n但谷歌似乎准备复制这一策略。包括Gmail老用户在内的G Suite在今年早些时候已超过20亿活跃用户，G Suite的新老板Javier Soltero当时表示，“改变人们的工作方式是我们独一无二的定位.”\n索尔特罗在微软工作了四年后，最近来到谷歌，他最初是在软件巨头收购ACompli时加入这家公司的，ACompli后来成为iOS Outlook。他已经展示了自己在发现趋势和填补空白方面的专长，这些应用和服务足够好，足以让微软收购。如果他能在谷歌重复这一点，那么Slake就有另一个巨大的竞争对手准备捆绑和利用其广受欢迎的通信和生产力应用程序。\n谷歌已经显示出正在追赶Zoom、微软团队和Slake的迹象。谷歌在今年早些时候免费提供Meet，试图与Zoom的突然流行竞争，并已开始将这款视频会议应用深度集成到Gmail和Google Calendar中。迈向真正的松弛和团队竞争的下一步是谷歌将谷歌聊天、聊天室和会议整合到Gmail中的早期工作。这要到今年晚些时候才能实现，但这显然是谷歌的一大优先事项。\n如果谷歌真的能在这里执行，并提供一个更连贯的沟通平台，将电子邮件、聊天和视频通话整合到一个单一的体验中，那么这对Slake和微软团队来说都是一个巨大的威胁。\nSack没有很好地应对谷歌迫在眉睫的威胁，以及为什么谷歌的捆绑方式没有微软的威胁那么大。“谷歌和微软是不同的，”谢尔哈斯在回答有关为什么微软与团队的合作与谷歌最近的做法不同的问题时说。“微软在Office生产力套件和所有辅助软件方面占据主导地位。没有法律禁止占据主导地位，但有关于拥有主导市场份额的公司必须如何行为的法律。有一件事他们不能做，那就是把一款新的独立产品与他们已有的主导产品捆绑在一起。“。\n如果你看看谷歌和微软的影响力或统治地位之间的原始数据，Office的用户约为12亿，而谷歌称G Suite的用户为20亿。这两个数字之间的关键区别在于，绝大多数使用Office的人将其作为工作许可或订阅的一部分，而谷歌所称的G Suite用户中的绝大多数是大约15亿Gmail用户，他们可能并不都在使用这项服务进行工作。到目前为止，谷歌还没有专注于利用这些免费用户成为企业客户-但一旦启动，它可能会在一夜之间成为主要参与者。\n微软凭借Office在职场占据主导地位，但谷歌显然主导着消费者对电子邮件、搜索以及YouTube等服务的使用。谷歌的免费服务也用于工作。在教育领域尤其如此，G Suite和Chromebook继续占据着全美的教室。谷歌将Meet免费与Gmail捆绑和集成的能力仍然应该引起Slake的担忧，即使该公司还不愿意承认这一点，也不愿打这场仗。\n目前还不清楚欧盟委员会是否会正式调查斯拉克的申诉。在做出决定之前，我们可能会有几个月的不确定性，对于微软、谷歌、Slake、Zoom和其他许多为企业和学生沟通方式而战的公司来说，这是几个月前的关键。\n微软首席执行官萨蒂亚·纳德拉(Satya Nadella)在4月份表示：“我们在两个月内就看到了两年的数字化转型。”在大流行期间，企业一直蜂拥至微软团队(Microsoft Teams)和Zoom等服务。虽然微软团队在一年前以1300万日用户超过了Slake的使用量，但这还不足以引发欧盟的投诉。很明显，在这场流行病中，企业被迫加速的数字化转型将更多的人推向了微软团队，而不是Slake。\n在大流行开始时，微软团队的使用率在一周内飙升了近40%，从3200万增加到4400万。这一转变也没有放缓，微软早在4月份就透露，团队现在的日活跃用户为7500万。Sack表示，由于对远程工作的需求增加，它已经打破了用户记录，但该公司表示，到目前为止，只有1250万并发Slack用户。这一数字也不同于Slake此前在10月份披露的1200万日活跃用户。\n微软已经对Slake的欧盟投诉做出了回应，该公司利用这个机会强调了它认为Slake错过的一个领域：视频会议。微软表示，虽然Slake确实支持视频会议，但“有了新冠肺炎，市场接纳的团队数量达到了创纪录的水平，而Slake则因为没有视频会议而蒙受了损失。”Sack的视频会议远远逊于团队，这也是Slake与亚马逊合作转向Chime进行语音和视频通话的主要原因。\nSack错过了可靠的视频通话和视频会议，突显了微软团队和Slake之间的主要区别之一。微软利用了对Lync和Skype的投资，并将它们组合成团队和聊天工具，而Slake则出色地将IRC应用于工作场所，并雄心勃勃地希望真正消除商业电子邮件。\nSlake和团队之间的差异使两者都可以争夺不同的客户，特别是在微软迎合Office人群和Slake为G Suite、Zoom和其他工具的组合提供服务的情况下。不过，谷歌正在隐约可见。Google Meet与Gmail Hits的更紧密集成是Slake的弱点，如果Google能够产生一个令人信服的Slake竞争对手，那么Slake将面临比单独微软大得多的问题。\n科技一项新的Oculus Quest似乎已经从各个角度泄露出去，可能很快就会推出。\n苹果Mac可能会获得面部ID，MacOS Big Sur中的代码可能会揭示这一点。\n谷歌一些Nest恒温器不能再连接到互联网，所以谷歌正在更换它们。\n查看技术领域的所有故事", "note_en": "Skip to main content                                                                                                                Slack surprised Microsoft with a  competition complaint in Europe yesterday. After arguing for months that Microsoft Teams  isn’t a true competitor to Slack and is more akin to Zoom, Slack finally admitted what was clear all along: Microsoft Teams is a competitor, and Slack is finding it hard to compete with Microsoft. It’s not a surprising admission, but if Slack is finding it hard to compete with Microsoft, then it’s going to face even greater headaches once Google finally gets its act together. After fumbling with communications apps for years, there are  early signs that Google is now ready to take on Slack, Microsoft Teams, and Zoom.\n Google’s enterprise play has huge implications for Slack’s EU antitrust bid — and the company’s future beyond it. Slack looks set to face two giant tech companies leveraging their dominant products to take a big slices of the workplace communications business. If Slack manages to convince the EU to take action against Microsoft’s bundling, it still faces the looming threat of Google bundling its own apps and services in a similar way. And for antitrust crusaders, G Suite shows that the bundling problem is much bigger than Microsoft.\n Slack’s competition complaint, published yesterday, is targeted solely at Microsoft and focused on the company’s bundling of Teams with its Office 365 subscription. “What we’re asking for is that Teams be separated from the Office suite and be sold separately with a fair commercial price tag associated with it so it competes on the merit with our product,” explained David Schellhase, Slack’s legal chief, in a call with reporters yesterday. “It really is as simple and straightforward as that.”\n  Microsoft has bundled a variety of productivity apps with its Office suite for decades, and it chose to bundle Teams free to Office 365 customers when it launched back in 2016. This bundling, alongside tight Office integration, has made it hard for Slack to convince businesses that are already paying for Office to pay extra to get Slack.\n But Google looks set to replicate that tactic. G Suite, which includes regular Gmail users, passed 2 billion active users earlier this year, and G Suite’s new boss, Javier Soltero,  said at the time that “changing the way people work is something we are uniquely positioned to do.”\n Soltero arrived at Google recently after a four-year career at Microsoft, a company he joined originally when the software giant acquired Acompli, which later became Outlook for iOS. He’s already demonstrated his expertise for spotting trends and filling the gaps with apps and services that were good enough for Microsoft to acquire. If he can repeat this at Google, then Slack has another giant competitor ready to bundle and leverage its popular communications and productivity apps.\n Google has already shown signs it’s moving toward catching up with Zoom, Microsoft Teams, and Slack.  Google made Meet free earlier this year to try to compete with Zoom’s sudden popularity, and it has started integrating the videoconferencing app deeply into Gmail and Google Calendar. The next step toward true Slack and Teams competition is Google’s early work toward  integrating Google Chat, Rooms, and Meet into Gmail. This won’t arrive until later this year, but it’s clearly a big priority at Google.\n  If Google can truly execute here and provide a more coherent communications platform that merges email, chat, and video calls into a single experience, then that’s as big a threat to Slack as well as Microsoft Teams.\n Slack didn’t have a good answer to the looming threat of Google, and why Google’s bundling approach is less of a threat than Microsoft’s. “Google and Microsoft are different,” says Schellhase, responding to a question about why Microsoft’s work with Teams is different from Google’s recent approach. “Microsoft has a dominant position with the Office productivity suite and all of the ancillary software. There’s no law against having a dominant position, but there are laws about how companies that have dominant market share have to behave. One thing they cannot do is tie a new independent product to the dominant product that they’ve got.”\n If you look at the raw numbers between Google and Microsoft’s reach or dominance, Office is used by around 1.2 billion people, and Google says G Suite is used by 2 billion. The key difference between these numbers is that the vast majority of people who are using Office are using it as part of a work license or subscription, whereas the overwhelming majority of what Google calls G Suite users are the approximately 1.5 billion Gmail users who probably aren’t all using the service for work. So far, Google hasn’t focused on leveraging those free users into enterprise clients — but when it starts, it could become a major player overnight.\n Microsoft dominates the workplace with Office, but Google clearly dominates consumer usage of email, search, and with services like YouTube. Google’s free services are used for work, too. This is especially true in education, where G Suite and Chromebooks continue to take over classrooms across the US. Google’s ability to bundle and integrate Meet free with Gmail should still be a cause for concern for Slack, even if the company isn’t willing to admit that or fight that battle just yet.\n  It’s still not clear whether the European Commission will even formally investigate Slack’s complaint. We likely have months of uncertainty until a decision is made, and these are keys months ahead for Microsoft, Google, Slack, Zoom, and many others fighting for how businesses and students communicate.\n “We’ve seen two years’ worth of digital transformation in two months,” said Microsoft CEO Satya Nadella  back in April. Businesses have been flocking to services like Microsoft Teams and Zoom during the pandemic. While  Microsoft Teams overtook Slack usage with 13 million daily users a year ago, that wasn’t enough to prompt an EU complaint. It’s clear that the digital transformation that businesses are being forced to accelerate during this pandemic has pushed many more to Microsoft Teams instead of Slack.\n Microsoft Teams usage skyrocketed nearly 40 percent in a single week at the beginning of the pandemic, moving from 32 million to 44 million. That shift hasn’t slowed down either, with Microsoft revealing back in April that  Teams is now at 75 million daily active users. Slack has said it has broken user records due to increased demand for remote working, but the company has only said  12.5 million concurrent Slack users so far. That number is also different from the 12 million daily active users Slack previously disclosed back in October.\n Microsoft has responded to Slack’s EU complaint, and the company used the opportunity to highlight an area it feels Slack missed out on: videoconferencing. While Slack does actually support videoconferencing, Microsoft says, “With COVID-19, the market has embraced Teams in record numbers while Slack suffered from its absence of video-conferencing.” Slack’s videoconferencing is far inferior to Teams, and it’s the big reason behind  Slack partnering up with Amazon to transition to Chime for voice and video calling.\n Slack’s miss on reliable video calling and videoconferencing highlights one of the main differences between Microsoft Teams and Slack. Microsoft has leveraged its investments in Lync and Skype and rolled them into Teams and chat, while Slack has brilliantly adapted IRC for the workplace and has ambitions to truly eliminate business email.\n The differences between Slack and Teams have allowed both to compete for different customers, especially as Microsoft caters to the Office crowd and Slack for a combination of G Suite, Zoom, and other tools. Google is looming large, though. The tighter integration of Google Meet into Gmail hits at a Slack weakness, and if Google is able to produce a compelling Slack competitor, then Slack will face far bigger problems than Microsoft alone.\n Tech   A new Oculus Quest has seemingly leaked from every angle, and it might launch soon\n  Apple   Apple’s Macs might get Face ID, as potentially revealed by code in macOS Big Sur\n  Google   Some Nest thermostats can no longer connect to the internet, so Google is replacing them\n  View all stories in Tech", "posttime": "2020-07-25 14:19:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,microsoft,谷歌,rust,微软", "title": "虽然斯拉克对微软团队捆绑的行为提出了反垄断申诉，但谷歌凭借其G Suite捆绑包处于独一无二的地位，将成为更大的威胁", "title_en": "While Slack files an antitrust complaint against Microsoft's Teams bundling, Google, with its G Suite bundle, is uniquely positioned to be an even bigger threat", "transed": 1, "url": "https://www.theverge.com/2020/7/23/21335406/slack-microsoft-teams-competition-eu-complaint-google-comparison?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["google", "microsoft", "谷歌", "rust", "微软"]}, {"category": "", "categoryclass": "", "imagename": "78ff962a57c884226ec64abb60bc436f.jpeg", "infoid": 1014084, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "艺术界很少有人亲眼看过这些令人愉快的小风景，它们整个夏天都待在彭蒂顿。\n当鲍勃·罗斯公司寄来的一批画。到达彭蒂顿美术馆时，保罗·克劳福德意识到他看到的是山脉、草地和快乐的小树，这是几十年来很少见过的。\nPAG的策展人克劳福德说，把它们打开真是太疯狂了。我不认为他们自从被放进箱子里就已经见不到曙光了。它们仍然有松节油的味道。\n到9月13日，位于奥卡纳根山谷(Okanagan Valley)、拥有3.3万人口的彭蒂顿市将成为世界上仅有的几个可以找到真正的鲍勃·罗斯(Bob Ross)的地方之一。这次名为“快乐的小意外”的个展是迄今为止同类展览中规模最大的一次。尽管如此，由于展出了30多件鲍勃·罗斯的原作，当你考虑到罗斯仅就《绘画的喜悦》制作的卷时，选择就算不了什么-只是小溪里的一滴水。\n1983-94年间，这部电视剧在印第安纳州芒西的一家当地PBS电视台录制了403集。除了偶尔客串--鲍勃的儿子史蒂夫或松鼠豆荚--这个节目令人心旷神怡的、低预算的模式从未真正动摇过。\n在半个小时内，罗斯会变出一幅原作，他实际上为每一集创作了三份照片。一幅画是参考图像；另一幅画是为了出版(教学书是最初的鲍勃·罗斯帝国的支柱，据报道，到1991年，这项业务价值1500万美元)。随着摄像机的滚动，第三件作品出现了。\n这就是那些油画--无处不在的熟悉风景--无数观众从家里欣赏到的。但在屏幕之外，这些原创作品很少(如果有的话)出现过。虽然众所周知，罗斯偶尔会将他的作品捐赠给PBS电视台，但他并没有出售节目中制作的画作，鲍勃·罗斯公司(Bob Ross，Inc.)也是如此。-管理他知识产权的公司-从来没有从事过艺术品交易。原件不通过一带一路出售。取而代之的是，你可以买到鲍勃·罗斯的拼图、新奇的袜子，甚至是有趣的浸泡式粉末糖果(鲍勃·罗斯的调色板)。在极少数情况下，市场上会出现一幅真实的风景。(这家位于明尼阿波利斯的画廊为收购这些画廊进行了一个充满激情的项目。)。\n如果你想看一幅真正的画，传统上只有一个可靠的选择。我们可以在佛罗里达州的新士麦那海滩(New Smyrna Beach)找到一些藏品，自1992年以来，这里就是鲍勃·罗斯艺术工作室和画廊(Bob Ross Art Shop And Gallery)的所在地。但母矿存放在“一带一路”总部。去年，“纽约时报”前往他们在弗吉尼亚州赫恩登的办公室，制作了一部迷人的、一口大小的纪录片，解开了遗失风景的谜团。(大约1165件鲍勃·罗斯的原作被藏在他们的大楼里。)\n克劳福德去年夏天见过那个医生。然后他给BRI发了一封电子邮件。他想在彭蒂顿买下那些画。\n我真的很想庆祝鲍勃·罗斯留下的遗产，并认真研究鲍勃提出的一些更大的问题：谁的作品值得在博物馆里收藏，谁的作品需要被记住？克劳福德说。\n几年前，一个专门介绍萨斯喀彻温省旧货店大师莱文·弗莱克勒格(Levine Flexug)风景的展览出现在全国各地的画廊里。(一个关于加拿大速成画家的配套展览，包括Flexug在内，将在PAG开幕至9月1日。13.)。克劳福德说，他在策划“快乐的小意外”时注意到了那次巡回展览的内容，如果对博物馆有严格的定义，那么这场展览的目的就是把魔鬼赶出来，就像什么旧的肮脏的画笔一样。这场展览的目的是把魔鬼赶出来，就像什么旧的肮脏的画笔一样。(编者注：如果对此有严格的定义，那么这个展览的目的就是把魔鬼赶走，就像什么旧的肮脏的画笔一样。)。\n罗斯于1995年死于淋巴瘤，但如果在他那个时代没有参加博物馆回顾展，他并不是特别在意这件事。1991年，“纽约时报”(New York Times)向罗斯询问了这个问题。他已经是一个低调的偶像，他说他并不热衷于这个概念。大多数画家都希望得到认可，尤其是同龄人的认可。我很久以前就通过电视做到了这一点。我不再需要了。而且根据“一带一路”的说法，主要艺术机构并不热衷于拿到鲍勃·罗斯(Bob Ross)的画作--至少在去年之前是这样。\nBRI表示，芝加哥德保罗美术馆是第一家进行接触的画廊；2019年4月，四幅画作出现在那里的展览上，主题为《新时代，新时代：生存战略》。同年晚些时候，富兰克林公园艺术中心(弗吉尼亚州珀塞尔维尔)。开设了“快乐意外”，这是一个专门展示罗斯电视绘画的节目。当PAG打来电话时，BRI表示，他们正在回应世界各地画廊的类似请求。三幅画现在在瑞典的ArkDes展出(它们是向ASMR致敬的一部分，这是一种令人奇怪的令人满意的流派，罗斯被誉为永久的守护神)。另一场个展定于今年11月在荷兰莫尔博物馆(Museum More)开幕。今年10月，一个全新的景点将在印第安纳州芒西(Muncie)开放，这是一个全新的景点，是这个人自己的圣殿，长期以来，这里一直是绘画之乐的故乡。\nBRI行政助理萨拉·斯特罗尔(Sarah Strohl)写道：随着最近几年人们对鲍勃·罗斯(Bob Ross)的兴趣和喜爱重新抬头，我们在展品中展出了画作，并向史密森博物馆捐赠了4幅画作。(哦，是的，这也发生在2019年。)。除了这些艺术品，史密森美国国家历史博物馆还从展览中获得了一个旧画架和一些制作笔记本。)然而，斯特罗尔说，我们的关注点一直和鲍勃在展览上的重点是一样的：如何让其他人有兴趣创作他们自己的画。\n从表面上看，是的，绘画的乐趣是为了让人们可以从家里涉足。但它是罕见的球迷谁挤出一管普鲁士蓝。罗斯知道这一点。正如他在1990年告诉“奥兰多哨兵报”(Orlando Sentinel)的那样：我们的大多数观众不画画，不想画，永远也不会画。相反，这部剧的吸引力更抽象。它与其说是艺术课，不如说是一种心情：舒适、温馨--一种视听的拍拍，诱使观众尝试新的东西。至少在22分钟内，没有失败的恐惧。正如罗斯过去常说的那样，我们不会犯错，我们只会有愉快的意外。\n但鲍勃·罗斯(Bob Ross)的粉丝在考虑当代艺术时，并不一定会有同样的拥抱氛围。克劳福德说，在策划“快乐小意外”时，他考虑的是罗斯接触大众的天赋。这么多人觉得他们没有从事艺术的知识，对我来说，这是令人震惊的。我们需要改变这一点。\n即使在大流行的情况下，“快乐小意外”也可能已经吸引了一些PAG的首次顾客。画廊延长开放时间以满足需求，并在夏季一周七天开放。据克劳福德说，自7月4日演出开始以来，人们每天早上都在排队。(因为新冠肺炎，一次只允许13位嘉宾参展)。额外的课程包括与鲍勃·罗斯认证的老师一起上绘画课。第一轮的票已经卖完了，而且还增加了更多的。(原来，世界各地有数千名这样的官方教练。克劳福德说：在彭蒂顿，一定有十几个人住在离我们三小时车程的范围内。)。\n入选此次展览的画作代表了“绘画之乐”11年来的每一季，一直到罗斯为该节目创作的最后一幅作品。(克劳福德说，这是一幅非常庄严的画，画中有一棵枯树，有点像是坐落在一种非常空灵的风景中。)。他亲自表示，这里的风景比他想象的更令人印象深刻。你知道，对他们来说，这是一种光芒，因为他们简单得令人迷惑。\n克劳福德说，在为展览做研究时，他发现了一种令人惊讶的公元前时代的联系-这是博物馆里只提到的一种联系。在罗斯首次在电视上亮相之前，他曾师从威廉·亚历山大(William Alexander)，后者是另一位在PBS上以画风景画闻名的人。亚历山大曾是一名德国战俘，二战后移居北美，一生生活在加拿大各地，包括不列颠哥伦比亚省的鲍威尔河。不过，他的艾美奖获奖系列“油画的魔力”于1974年至1982年在洛杉矶一家公共广播电台录制，它与罗斯的风格有很多美学上的DNA，一直到全黑布景。克劳福德说，他们的相似之处令人惊讶。但他是个粗鲁、说话粗鲁的家伙，而且没有鲍勃那样流畅的表达方式。不过，亚历山大对罗斯的名气并不冷淡。(正如他在1991年告诉“纽约时报”的那样：我训练了他，他在模仿我。)尽管有怨恨，他的影响力在PAG的节目中被简短地提到了。\n然而，罗斯的画作是这次展览的焦点--一片熟悉的湖泊、云朵和树木的模糊。从表面上看，它们可以说不值博物馆，但对克劳福德来说，它们值得大老远带到不列颠哥伦比亚省，特别是在罗斯的遗产近年来不断增长的情况下。他说：我想这就是艺术史上属于什么的整个问题。对我来说，艺术史实际上是社会史。自80年代以来，罗斯就没有离开过公众意识。任何时候，你都可以在屏幕上看到他的画，在他们原本打算看到的地方。(在Twitch、Tubi和YouTube上寻找绘画的乐趣。)。\n克劳福德说，对于现实世界中的人们来说，他的名字肯定比任何一位最著名的加拿大画家都更出名。", "note_en": "Arts    Few have seen these happy little landscapes in person, and they&#39;re in Penticton all summer\n  When a shipment of paintings from Bob Ross, Inc. arrived at the  Penticton Art Gallery, Paul Crawford realized he was looking at mountains and meadows and &#34;happy little trees&#34; that few, if any, had seen in decades.\n  &#34;It was crazy opening them up,&#34; says Crawford, the curator at the PAG. &#34;I don&#39;t think they&#39;d seen the light of day since they were put in the boxes. They still smelled of turpentine.&#34;\n   To September 13, Penticton — a city of 33,000 in the Okanagan Valley — will be one of the only places in the world where you can find an authentic Bob Ross. And the solo exhibition,  Happy Little Accidents, is the largest of its kind to happen anywhere to date. Still, with more than 30 Bob Ross originals on view, the selection is nothing — a mere drop in the babbling brook — when you consider the volume Ross produced on  The Joy of Painting alone.\n    Between 1983-94, the series taped 403 episodes out of a local PBS station in Muncie, Ind. And beyond the occasional guest appearance — from  Bob&#39;s son Steve or  Peapod the Squirrel — the program&#39;s lulling, low-budget formula never really wavered.\n  In half an hour, Ross would conjure an original painting, pictures he actually created in triplicate for each episode. One painting was a reference image; another was for publication (instructional books were a pillar of the original Bob Ross empire, a business that was reportedly worth  $15 million US by 1991). And the third piece materialized as the cameras rolled.\n  It&#39;s those canvases — familiar landscapes of nowhere in particular — that countless viewers have admired from home. But beyond the screen, these original works have rarely, if ever, been on view. Though Ross was known to occasionally donate his work to PBS stations, he didn&#39;t sell the paintings made on the program, and Bob Ross, Inc. — the company that manages his intellectual property — has never been in the business of dealing art. Originals are not for sale through BRI. Instead, you can buy Bob Ross jigsaw puzzles, novelty socks, even Fun Dip-style powdered candy (the Bob Ross &#34; Flavor Palette&#34;). On rare occasions,  an authentic landscape will appear on the market. ( This gallery, based in Minneapolis, has made a passion project of acquiring them.)\n    If you want to see an actual painting, traditionally there&#39;s only been one reliable option. A collection can be found in New Smyrna Beach, Fla., home to the  Bob Ross Art Workshop and Gallery since 1992. But the motherlode&#39;s stored at BRI headquarters. Last year, the   New York Times journeyed to their office in Herndon, Va., and made a charming, bite-sized documentary that solved the mystery of the missing landscapes. (Some 1,165 Bob Ross originals are stashed away in their building.)\n  Crawford saw that doc last summer. And then he sent BRI an email. He wanted those paintings in Penticton.\n    &#34;I was really wanting to celebrate the legacy of Bob Ross, and really look at some of the larger questions that Bob presented himself: whose work deserves to be in a museum, and whose work needs to be remembered?&#34; says Crawford.\n  A few years back, an exhibition devoted to the landscapes of  Levine Flexhaug — Saskatchewan&#39;s master of the thrift-store sublime — appeared at galleries around the country. (A companion exhibition about Canadian &#34; speed painters,&#34; Flexhaug included, is open at the PAG to Sept. 13.) Crawford says he&#39;s taken a note from that travelling Flexhaug show in curating  Happy Little Accidents, and if there&#39;s a strict definition of &#34;museum-worthy,&#34; the show aims to &#34; beat the devil out of it,&#34; like some old dirty paintbrush.\n  Ross died of lymphoma in 1995, but if a museum retrospective eluded him in his time, he wasn&#39;t especially fussed about it. In 1991, the   New York Times asked Ross about the subject. Already a low-key icon, he said he wasn&#39;t keen on the notion. &#34;Most painters want recognition, especially by their peers. I achieved that a long time ago with TV. I don&#39;t need any more.&#34; And according to BRI, major arts institutions weren&#39;t exactly clamouring to get their white gloves on a Bob Ross painting — at least until last year.\n    The DePaul Art Museum in Chicago was the first gallery to make contact, says BRI; in April 2019, four paintings appeared there in the exhibition   New Age, New Age: Strategies for Survival. Later that year, the  Franklin Park Arts Centre (Purcellville, Va.) opened  Happy Accidents, a show devoted to Ross&#39;s TV paintings. When the PAG came calling, BRI says they were fielding similar requests from galleries around the world. Three paintings are now on view at  ArkDes in Sweden (they&#39;re part of a salute to ASMR, the oddly satisfying genre of which Ross is hailed as the permed patron saint). Another solo exhibition is scheduled to open at the  Museum MORE in the Netherlands this November. And a  brand new attraction, a shrine to the man himself, will open this October in Muncie, Ind., long-time home of  The Joy of Painting.\n  Writes Sarah Strohl, an executive assistant at BRI: &#34;With the recent resurgence of interest and love for Bob Ross in the past few years, we have displayed paintings in exhibits as well as donated four paintings to the Smithsonian.&#34; (Oh, yeah — that happened in 2019, too. In addition to the artwork, Smithsonian National Museum of American History acquired an old easel from the show and some production notebooks.) &#34;However,&#34; says Strohl, &#34;our focus has always been the same as Bob&#39;s on the show: to interest others in creating paintings of their own.&#34;\n  On the surface, yes,  The Joy of Painting is designed so folks can dabble along from home. But it&#39;s a rare fan who&#39;s squeezed out a tube of Prussian Blue. Ross knew it. As he told the   Orlando Sentinel in 1990: &#34;The majority of our audience does not paint, has no desire to paint, will never paint.&#34; Instead, the show&#39;s appeal is more abstract. It&#39;s less about the art lesson, and more about the mood: cozy, nurturing — an audio-visual pat on the back, coaxing the audience to try something new. For 22 minutes, at least, there&#39;s no fear of failure. As Ross used to say, &#34;We don&#39;t make mistakes, we just have happy accidents.&#34;\n    But a Bob Ross fan doesn&#39;t necessarily get the same huggy vibes when they think about contemporary art. In curating  Happy Little Accidents, Crawford says he was thinking about Ross&#39;s gift for reaching the masses. &#34;So many people feel they don&#39;t have the knowledge that they can engage in art, and that, to me, is appalling. We need to change that.&#34;\n  Even in a pandemic,  Happy Little Accidents has likely attracted some first-time patrons to the PAG already. The gallery is keeping extended hours to match demand, and is open seven days a week through the summer. According to Crawford, people have been lining up every morning since the show opened July 4. (Because of COVID-19, only 13 guests are allowed in the exhibition at a time.) Additional programming includes painting classes with a &#34;Bob Ross-Certified&#34; teacher. The first round sold out, and more have been added. (There are  thousands of these official instructors around the world, it turns out. Says Crawford: &#34;There must be a dozen that are living within a three-hour drive of us here in Penticton.&#34;)\n    The paintings selected for the show represent every season of  The Joy of Painting&#39;s 11-year run, right up to Ross&#39;s final piece for the program. (&#34;It&#39;s a very solemn painting with a sort of dead tree that sort of sits in a very ethereal sort of landscape,&#34; says Crawford.) In person, he says the landscapes are more impressive than he&#39;d imagined. &#34;There&#39;s a luminosity to them, you know, for as beguilingly simple as they are.&#34;\n  And in researching the exhibition, Crawford says he came across a surprising B.C. connection — one that&#39;s only touched on at the museum. Before Ross made his TV debut, he studied with William Alexander, another guy known for painting landscapes on PBS. A former German POW, Alexander moved to North America after the Second World War, and lived all over Canada during his lifetime, including Powell River, B.C. His Emmy-winning series, though,  The Magic of Oil Painting, taped at a Los Angeles public-broadcasting station from 1974-82, and it shares plenty of aesthetic DNA with Ross&#39;s format, right down to the  all-black set. &#34;It&#39;s remarkable how similar they are,&#34; says Crawford. &#34;But he was a rough, gruff-spoken fellow and didn&#39;t quite have Bob&#39;s smooth way of delivery.&#34; Alexander wasn&#39;t cool with Ross&#39;s fame, though. (As he told the   New York Times in 1991: &#34;I trained him and he is copying me.&#34;) Despite the bad blood, his influence is briefly mentioned in the PAG show.\n    Ross&#39;s paintings, though, are the focus of the exhibition — a blur of familiar lakes and clouds and trees. At face value, they&#39;re arguably not &#34;museum-worthy,&#34; but to Crawford, they&#39;re worth bringing all the way to B.C., especially as Ross&#39;s legacy has grown in recent years. &#34;I guess it&#39;s the whole question of what belongs in art history,&#34; he says. &#34;To me, art history is really social history.&#34; And since the &#39;80s, Ross hasn&#39;t left the public consciousness. At any time, you can see his paintings on screen, the place they were originally intended to be seen. (Find  The Joy of Painting on on  Twitch and  Tubi and  YouTube.)\n  &#34;To people out there in the real world,&#34; says Crawford, &#34;certainly his name is better known than any of the most famous of Canadian painters.&#34;", "posttime": "2020-07-25 14:18:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "鲍勃,biggest,罗斯", "title": "世界上最大的博物馆鲍勃·罗斯画展。它是怎么在公元前结束的？", "title_en": "World's biggest museum exhibition of Bob Ross paintings. How'd it wind up in BC?", "transed": 1, "url": "https://www.cbc.ca/arts/it-s-the-world-s-biggest-museum-exhibition-of-bob-ross-paintings-so-how-d-it-wind-up-in-b-c-1.5659949", "via": "", "real_tags": ["鲍勃", "biggest", "罗斯"]}, {"category": "", "categoryclass": "", "imagename": "3065c16e01b8e4325aa206a48aa4b534.jpg", "infoid": 1014083, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "马丘比丘是由印加文明在安第斯山脉的山顶上建造的城市堡垒，吸引了游客和学者。但对他们中的大多数人来说，最大的问题是，为什么印加人要在这么偏远的地方建造这座城市-特别是在印加小径上徒步几天，才能到达高山中俯瞰陡峭河谷的地点。现在，一项新的研究表明，这一切都与地质有关；马丘比丘和其他印加城市都是故意建在断层线上的。\n本周早些时候，巴西南里奥格兰德联邦大学的地质学家Rualdo Menegat在美国地质学会年会上公布了这一发现。利用卫星图像和现场数据，梅内加特能够记录下马丘下面的裂缝网络，从穿过个别巨石的小裂缝到决定河谷岩石方向的107英里长的断层。断裂有的呈西北-东南向，有的呈西北-西南向。中间是马丘比丘，断层呈“X”字形相交。\n这不太可能是印加人出于任何宗教或象征原因选择断层线。相反，断层产生了大块的花岗岩，这些花岗岩已经被撕裂成碎片，这使得用最小的努力就可以建造由合适的岩石组成的精致的石头前哨成为可能。这座城市的城墙也朝向断层的方向。“马丘比丘的位置不是巧合，”梅内加特在一份新闻稿中辩称。“那里强烈的破裂使岩石容易沿着这些相同的软弱平面破裂，这大大减少了雕刻它们所需的能量。如果衬底没有破裂，就不可能在高山上建造这样的场地。“。\n除了允许印加人更容易地找到石头并将其拼装在一起而不需要砂浆之外，这些缺陷还提供了其他优势。穿过现场的断层线可能将融化的积雪和雨水引导到提供水的高海拔前哨。而遗址下方的裂缝网络可能会让它排干，这也是这座城市持续如此之久的原因之一。\n梅内加特在接受“新闻周刊”采访时告诉阿里斯托斯·格奥尔乔，在那个地点建造马丘比丘很可能不是意外。“在我看来，如果不了解安第斯山脉的岩石和山脉，任何文明都不可能在该地区建立起来。马丘比丘并不是安第斯山脉印加生存战略的孤立案例，“他说。\n梅内加特发现，包括奥兰泰坦博、皮萨克和库斯科在内的其他印加城市也建立在类似的断层交叉口上。这并不一定意味着印加人对板块构造有很深的了解。相反，他们可能已经找到了这些地区，那里充斥着乱七八糟的岩石，这些岩石被粉碎成三角形和菱形的形状，这些岩石可以组合在一起构成墙壁。\n“印加人知道如何识别强烈破碎的地带，也知道它们延伸了很长一段时间。这只有一个简单的原因：断层可能导致水，“梅内加特告诉乔治欧。“因此，考虑一条断层，它从一座多雪的山顶开始，向下延伸到3000米(约9450英尺)，一直延伸到深谷。春季和夏季的融化为这一断层提供了燃料，并改变了流经该断层的水量。断层和含水层是安第斯山脉地区水循环的一部分。“。\n在印加人的语言盖丘亚语中，有一个词表示大裂缝或断层，这是印加人意识到贯穿他们山区的断层的另一个迹象。\n马丘比丘被认为是在1450年左右在印加皇帝帕查库蒂·印加·尤潘基的指导下建造的，有点像皇家山区庄园。印加精英的住宅和据信是皇帝的私人住宅，包括一个私人花园和他自己的厕所，都建在那里。当西班牙人开始入侵南美洲时，战争和疾病结束了印加帝国，山上的这座城市和许多其他城市一起被遗弃。它是在1911年被西方科学发现的，当时耶鲁大学教授海拉姆·宾汉姆三世(Hiram Bingham III)被当地人告知它的存在，并将其带到了当时植被茂盛的遗址。现在，马丘比丘是世界遗产，也是一个巨大的全球旅游景点。今天，它面临着非常现代的威胁，包括过度旅游，这个问题只会因为在该地区建设新机场的计划而变得更加恼火。", "note_en": "Machu Picchu, the urban citadel built high in the peaks of the Andes by the Inca civilization, has fascinated visitors and scholars alike. But the biggest question for most of them—especially after hiking for several days on the Inca Trail to reach the spot perched high in the mountains on a ridge overlooking a precipitous river valley—is why the Incas built the city in such a remote place. Now, a new study suggests it all has to do with geology; Machu Picchu, as well as other Inca cities, were deliberately built on fault lines.\n    Earlier this week, Rualdo Menegat, a geologist at Brazil’s Federal University of Rio Grande do Sul, presented the findings at the annual meeting of the  Geological Society of America. Using satellite images and field data, Menegat was able to document a web of fractures underneath Machu, from small fissures running across individual boulders to a 107-mile-long fault responsible for the orientation of the rock in the river valley. Some of the faults have a northwest-southeast orientation while others have a northwest-southwest orientation. In the middle, where the faults intersect in the shape of an “X” is Machu Picchu.\n  It&#39;s not likely that the Inca selected the fault lines for any religious or symbolic reason. Rather, the faults produce chunks of granite that have already been cracked into pieces, making it possible to build the elaborate stone outpost of fitted rocks with minimal effort. The walls of the city are also oriented in the direction of the faults. “Machu Picchu’s location is not a coincidence,” Menegat argues in a  press release. “The intense fracturing there predisposed the rocks to breaking along these same planes of weakness, which greatly reduced the energy needed to carve them. It would be impossible to build such a site in the high mountains if the substrate was not fractured.”\n  Besides allowing the Inca to more easily find and fit stones together without mortar, the faults provided other advantages. The fault lines running through the site probably directed melting snow and rainwater to the high-altitude outpost providing water. And the network of fissures below the site likely allowed it to drain, one of the reasons the city has lasted so long.\n  Menegat tells Aristos Georgiou at   Newsweek that building Machu Picchu at that site was probably not an accident. “It seemed to me that no civilization could be established in the Andes without knowing the rocks and mountains of the region. Machu Picchu is not an isolated case of Inca survival strategy in the Andes,” he says.\n  Other Inca cities, including Ollantaytambo, Pisac and Cusco, are also built on similar fault intersections, as Menegat has found. This doesn’t necessarily suggest the Inca had a deep knowledge of plate tectonics. Rather, they may have sought out these areas, filled with a jumble of rocks fractured into shapes like triangles and rhombuses, which could be fit together to make walls.\n  “The Incas knew how to recognize intensely fractured zones and knew that they extended over long stretches. This is for one simple reason: faults can lead to water,” Menegat tells Georgiou. “So consider a fault that starts from the top of a snowy mountain and extends down to 3,000 meters [around 9,450 feet] to reach the deep valleys. The melting of spring and summer fuels this fault and changes the amount of water that flows through it. Faults and aquifers are part of the water cycle in the Andean realm.”\n  In Quechua, the language of the Inca, there is a word for large fractures, or faults, which is another indication that the Inca were aware of the faults running through their mountain domain.\n  Machu Picchu is believed to have been constructed around  1450 under the direction of Inca emperor Pachacuti Inca Yupanqui as something of a royal mountain estate. Residences for Inca elite and what’s believed to be a private residence for the emperor, including a private garden and his own toilet site, were built there. When the Spanish began invading South America, war and disease brought the Inca empire to an end, and the city on the mountains along with many others were abandoned. It was discovered by western science in 1911, when Yale professor Hiram Bingham III was tipped off to its existence by locals and led to the site, then overgrown with vegetation. Now Machu Picchu is a World Heritage site and a massive global tourist attraction. Today, it faces very modern  threats including overtourism, a problem that will only be exasperated by plans for a new airport in the region.", "posttime": "2020-07-25 14:18:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "表明,suggests,断层", "title": "研究表明马丘比丘故意建在相交的断层线上", "title_en": "Research Suggests Machu Picchu Was Purposely Built on Intersecting Fault Lines", "transed": 1, "url": "https://www.smithsonianmag.com/smart-news/machu-picchu-was-purposely-built-top-intersecting-fault-lines-180973216/", "via": "", "real_tags": ["表明", "suggests", "断层"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014082, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每年有数以千计的人从学院和大学毕业，获得网络安全或计算机科学学位，结果发现雇主对他们的动手基础技能不太感兴趣。以下是最近的一项调查，该调查发现了一些更大的技能差距，并就如何让那些在这些领域寻求职业生涯的人更好地脱颖而出发表了一些看法。\nKrebsOnSecurity几乎每周都会收到至少一封来自某人的电子邮件，寻求关于如何打入网络安全领域的建议，并将其作为职业。在大多数情况下，求职者会问他们应该寻求哪些认证，或者计算机安全方面的什么专业可能拥有最光明的未来。\n我很少被问到，他们应该寻求哪些实用技能，以使自己成为未来工作的更具吸引力的应聘者。虽然我在回答任何问题时都会警告说，我自己没有任何与计算机相关的证书或学位，但我确实会定期与网络安全领域的C级高管和招聘人员交谈，并经常询问他们对当今网络安全工作候选人的印象。\n在这些高层管理人员的回应中，一个共同的主题是，许多应聘者在运营、维护和维护推动其业务的信息系统等更实际的问题上缺乏实践经验。\n诚然，大多数刚毕业的人缺乏实践经验。但令人高兴的是，网络安全的一个有点独特的方面是，人们可以通过自我指导的学习和老式的反复试验，在相当程度上掌握动手技能和基础知识。\n在回复读者时，我几乎总是会给出一个关键的建议，那就是了解计算机和其他设备如何相互通信的核心组件。我这么说是因为掌握网络是一项基本技能，许多其他领域的学习都建立在这一技能的基础上。试图在没有深入了解数据包工作原理的情况下获得一份安全工作，有点像在没有首先掌握元素周期表的情况下试图成为一名化学工程师。\n但请不要相信我的话。马里兰州贝塞斯达的萨斯研究所(SANS Institute)。这家安全研究和培训公司最近对284家不同公司的500多名网络安全从业人员进行了一项调查，试图找出他们认为哪些技能对求职者最有用，哪些技能最缺乏。\n调查要求受访者对各种技能进行排名，从“关键”到“不需要”。85%的受访者认为网络是一项关键或“非常重要”的技能，紧随其后的是掌握Linux操作系统(77%)、Windows(73%)、常用开发技术(73%)、计算机体系结构和虚拟化(67%)以及数据和密码学(58%)。也许令人惊讶的是，只有39%的人将编程列为一项关键或非常重要的技能(我稍后会再谈到这一点)。\n接受调查的网络安全从业人员如何根据这些关键且非常重要的技能对他们的潜在求职者进行评分？其结果可能会让人大开眼界：\nSANS研究所研究主管艾伦·帕勒(Alan Paller)表示：“雇主们报告说，学生网络安全准备工作很大程度上是不够的，他们不得不花几个月的时间寻找合格的入门级员工，如果能找到的话，他们对此感到沮丧。”“我们假设，解决这些挑战并帮助缩小网络安全技能差距的途径的开始，将是隔离雇主期望但在网络安全毕业生身上找不到的能力。”\n事实是，我今天认识的一些最聪明、最有洞察力、最有才华的计算机安全专业人员并没有任何与计算机相关的认证。事实上，他们中的许多人甚至从未上过大学，也没有完成大学水平的学位课程。\n相反，他们进入安全专业是因为他们对这门学科充满热情和强烈的好奇心，这种好奇心引导他们尽可能多地学习-主要是通过阅读、做和犯错误(很多错误)。\n我提到这一点并不是为了劝阻读者攻读该领域的学位或证书(这可能是许多公司人力资源部门的基本要求)，而是要强调，这些不应该被视为通向有回报、稳定和相对高薪职业的某种黄金门票。\n更重要的是，如果没有掌握上述一项或多项技能，当时机成熟时，你根本不会成为一名非常有吸引力或出色的求职者。\n那么，你应该关注什么，开始的最佳方式是什么？首先，要明白，虽然获取知识的方法几乎是无限的，而且你可以探索的深度几乎没有限制，但动手是最快的学习方式。\n不，我不是在说闯入某人的网络，或者侵入一些糟糕的网站。请不要在未经允许的情况下做那件事。如果您必须以第三方服务和站点为目标，请坚持使用那些通过漏洞赏金计划提供认可和/或奖励的服务和站点，然后确保您尊重这些计划的边界。\n此外，几乎任何你想通过实践学习的东西都可以在本地复制。希望掌握常见的漏洞和利用技术？可用的免费资源不计其数；专门构建的开发工具包(如Metasploit、WebGoat)和定制的Linux发行版(如Kali Linux)都得到了在线教程和视频的良好支持。此外，还有一些免费的侦察和漏洞发现工具，如Nmap、Nessus、OpenVAS和nikto。这绝不是一份完整的清单。\n建立你自己的黑客实验室。你可以用一台备用的计算机或服务器，或者用eBay或Craigslist等网站上供应充足、价格便宜的旧硬件来做到这一点。像VirtualBox这样的免费虚拟化工具可以简化与不同操作系统的友好关系，而不需要额外的硬件。\n或者考虑付钱给其他人，让他们安装一台你可以试试看的虚拟服务器。亚马逊的EC2服务在这里是一个很好的低成本选择。如果你想学习网络应用测试，你可以在你自己局域网内的电脑上安装任意数量的网络服务，比如旧版本的WordPress、Joomla或Magento这样的购物车系统。\n想学习网络吗？从阅读一本关于TCP/IP的好书开始，真正了解网络堆栈以及每一层如何与另一层交互。\n在你吸收这些信息的同时，学会使用一些工具来帮助你将新学到的知识应用到实际应用中。例如，熟悉Wireshark和tcpdump，这是网络管理员用来排除网络和安全问题并了解网络应用程序如何工作(或不工作)的便捷工具。首先检查您自己的网络流量、网页浏览和日常计算机使用情况。通过查看应用程序正在发送和接收什么数据、如何发送数据以及在哪里发送数据，尝试了解计算机上的应用程序在做什么。\n虽然能够用Go、Java、Perl、Python、C或Ruby等语言编程可能在雇主要求的技能清单上名列前茅，但拥有一种或多种语言的技能不仅会让你成为更有吸引力的员工，还会让你更容易增长知识，并更容易掌握更深层次的技能。\n根据您最终追求的安全专门化，您还可能会发现，在不了解如何编码的情况下，扩展知识的能力在某种程度上是有限的。\n对于那些被学习编程语言的想法吓倒的人，可以从熟悉Linux上的基本命令行工具开始。仅仅是学习编写自动化特定手动任务的基本脚本就可以成为一个很好的垫脚石。更重要的是，掌握创建shell脚本将在您的职业生涯中为几乎任何与计算机相关的技术角色带来可观的红利(无论您是否学习特定的编码语言)。\n毫无疑问：就像学习一件乐器或一门新语言一样，掌握网络安全技能需要大多数人花费大量的时间和精力。但是，如果一个特定的学习主题一开始似乎不堪重负，不要灰心丧气，慢慢来，继续前进。\n这就是为什么有支持小组是有帮助的。我是认真的。在网络安全行业，网络的人性化方面采取会议和本地会议的形式。我再怎么强调，半定期地与志同道合的人交往对你的理智和事业都是多么重要。\n其中许多聚会都是免费的，包括Security BSides活动、DEFCON小组和OWASP分会。由于科技行业的男性人数仍然不成比例，也有一些面向女性的网络安全会议和会员团体，比如网络柔术妇女协会(Women‘s Society of Cyberjutsu)和这里列出的其他组织。\n除非你住在一个偏僻的地方，否则很可能在你的一般区域会有很多安全会议和安全会议。但是，即使你真的住在偏远地区，好消息是，许多这样的聚会正在走向虚拟，以避免正在进行的瘟疫，即新冠肺炎疫情。\n总而言之，不要指望学位或证书能让你为雇主期望你拥有的技能做好准备，这是可以理解的。这可能是不公平的，也可能是不应该的，但你很可能需要发展和培养为你未来的雇主和这一领域的就业能力服务的技能。\n我相信这里的读者有他们自己的想法，关于新手、学生和那些正在考虑转行到网络安全领域的人如何最好地集中他们的时间和精力。请在评论中畅所欲言。我甚至可能会更新这篇帖子，以包括一些更好的建议。", "note_en": "Thousands of people graduate from colleges and universities each year with cybersecurity or computer science degrees only to find employers are less than thrilled about their hands-on, foundational skills. Here’s a look at a recent survey that identified some of the bigger skills gaps, and some thoughts about how those seeking a career in these fields can better stand out from the crowd.\n  Virtually every week KrebsOnSecurity receives at least one email from someone seeking advice on  how to break into cybersecurity as a career. In most cases, the aspirants ask which certifications they should seek, or what specialization in computer security might hold the brightest future.\n Rarely am I asked which practical skills they should seek to make themselves more appealing candidates for a future job. And while I always preface any response with the caveat that I don’t hold any computer-related certifications or degrees myself, I do speak with C-level executives in cybersecurity and recruiters on a regular basis and frequently ask them for their impressions of today’s cybersecurity job candidates.\n A common theme in these C-level executive responses is that a great many candidates simply lack hands-on experience with the more practical concerns of operating, maintaining and defending the information systems which drive their businesses.\n Granted, most people who have just graduated with a degree lack practical experience. But happily, a somewhat unique aspect of cybersecurity is that one can gain a fair degree of mastery of hands-on skills and foundational knowledge through self-directed study and old fashioned trial-and-error.\n One key piece of advice I nearly always include in my response to readers involves learning the core components of how computers and other devices communicate with one another. I say this because a mastery of networking is a fundamental skill that so many other areas of learning build upon. Trying to get a job in security without a deep understanding of how data packets work is a bit like trying to become a chemical engineer without first mastering the periodic table of elements.\n But please don’t take my word for it.  The SANS Institute, a Bethesda, Md. based security research and training firm, recently conducted a survey of more than 500 cybersecurity practitioners at 284 different companies in an effort to suss out which skills they find most useful in job candidates, and which are most frequently lacking.\n The survey asked respondents to rank various skills from “critical” to “not needed.” Fully 85 percent ranked networking as a critical or “very important” skill, followed by a mastery of the Linux operating system (77 percent), Windows (73 percent), common exploitation techniques (73 percent), computer architectures and virtualization (67 percent) and data and cryptography (58 percent). Perhaps surprisingly, only 39 percent ranked programming as a critical or very important skill (I’ll come back to this in a moment).\n How did the cybersecurity practitioners surveyed grade their pool of potential job candidates on these critical and very important skills? The results may be eye-opening:\n  “Employers report that student cybersecurity preparation is largely inadequate and are frustrated that they have to spend months searching before they find qualified entry-level employees if any can be found,” said  Alan Paller, director of research at the SANS Institute. “We hypothesized that the beginning of a pathway toward resolving those challenges and helping close the cybersecurity skills gap would be to isolate the capabilities that employers expected but did not find in cybersecurity graduates.”\n The truth is, some of the smartest, most insightful and talented computer security professionals I know today don’t have any computer-related certifications under their belts. In fact, many of them never even went to college or completed a university-level degree program.\n Rather, they got into security because they were passionately and intensely curious about the subject, and that curiosity led them to learn as much as they could — mainly by reading, doing, and making mistakes (lots of them).\n I mention this not to dissuade readers from pursuing degrees or certifications in the field (which may be a basic requirement for many corporate HR departments) but to emphasize that these should not be viewed as some kind of golden ticket to a rewarding, stable and relatively high-paying career.\n More to the point, without a mastery of one or more of the above-mentioned skills, you simply will not be a terribly appealing or outstanding job candidate when the time comes.\n  So what should you focus on, and what’s the best way to get started? First, understand that while there are a near infinite number of ways to acquire knowledge and virtually no limit to the depths you can explore, getting your hands dirty is the fastest way to learning.\n No, I’m not talking about breaking into someone’s network, or hacking some poor website. Please don’t do that without permission. If you must target third-party services and sites, stick to those that offer recognition and/or incentives for doing so  through bug bounty programs, and then make sure you respect the boundaries of those programs.\n Besides, almost anything you want to learn by doing can be replicated locally. Hoping to master common vulnerability and exploitation techniques? There are  innumerable  free  resources available; purpose-built exploitation toolkits like  Metasploit,  WebGoat, and custom Linux distributions like  Kali Linux that are well supported by tutorials and videos online. Then there are a number of free reconnaissance and vulnerability discovery tools like  Nmap,  Nessus,  OpenVAS and  Nikto. This is by no means a complete list.\n Set up your own hacking labs. You can do this with a spare computer or server, or with older hardware that is plentiful and cheap on places like eBay or Craigslist. Free virtualization tools like  VirtualBox can make it simple to get friendly with different operating systems without the need of additional hardware.\n Or look into paying someone else to set up a virtual server that you can poke at. Amazon’s  EC2 services are a good low-cost option here. If it’s web application testing you wish to learn, you can install any number of web services on computers within your own local network, such as older versions of WordPress, Joomla or shopping cart systems like Magento.\n Want to learn networking? Start by getting  a decent book on TCP/IP and really learning the network stack and  how each layer interacts with the other.\n And while you’re absorbing this information, learn to use some tools that can help put your newfound knowledge into practical application. For example, familiarize yourself with  Wireshark and  Tcpdump, handy tools relied upon by network administrators to troubleshoot network and security problems and to understand how network applications work (or don’t). Begin by inspecting your own network traffic, web browsing and everyday computer usage. Try to understand what applications on your computer are doing by looking at what data they are sending and receiving, how, and where.\n  While being able to program in languages like  Go,  Java,  Perl,  Python,  C or  Ruby may or may not be at the top of the list of skills demanded by employers, having one or more languages in your skillset is not only going to make you a more attractive hire, it will also make it easier to grow your knowledge and venture into deeper levels of mastery.\n It is also likely that depending on which specialization of security you end up pursuing, at some point you will find your ability to expand that knowledge is somewhat limited without understanding how to code.\n For those intimidated by the idea of learning a programming language, start by getting familiar with basic command line tools on Linux. Just learning to write basic scripts that automate specific manual tasks can be a wonderful stepping stone. What’s more, a mastery of  creating shell scripts will pay handsome dividends for the duration of your career in almost any technical role involving computers (regardless of whether you learn a specific coding language).\n  Make no mistake: Much like learning a musical instrument or a new language, gaining cybersecurity skills takes most people a good deal of time and effort. But don’t get discouraged if a given topic of study seems overwhelming at first; just take your time and keep going.\n That’s why it helps to have support groups. Seriously. In the cybersecurity industry, the human side of networking takes the form of conferences and local meetups. I cannot stress enough how important it is for both your sanity and career to get involved with like-minded people on a semi-regular basis.\n Many of these gatherings are free, including  Security BSides events,  DEFCON groups, and  OWASP chapters. And because the tech industry continues to be disproportionately populated by men, there are also a number cybersecurity meetups and membership groups geared toward women, such as the  Women’s Society of Cyberjutsu and others  listed here.\n Unless you live in the middle of nowhere, chances are there’s a number of security conferences and security meetups in your general area. But even if you do reside in the boonies, the good news is many of these meetups are going virtual to avoid the ongoing pestilence that is the COVID-19 epidemic.\n In summary, don’t count on a degree or certification to prepare you for the kinds of skills employers are going to understandably expect you to possess. That may not be fair or as it should be, but it’s likely on you to develop and nurture the skills that will serve your future employer(s) and employability in this field.\n I’m certain that readers here have their own ideas about how newbies, students and those contemplating a career shift into cybersecurity can best focus their time and efforts. Please feel free to sound off in the comments. I may even update this post to include some of the better recommendations.", "posttime": "2020-07-25 13:55:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "网络安全,cybersecurity,技能", "title": "有没有想过从事网络安全职业？读这个", "title_en": "Thinking of a Cybersecurity Career? Read This", "transed": 1, "url": "https://krebsonsecurity.com/2020/07/thinking-of-a-cybersecurity-career-read-this/", "via": "", "real_tags": ["网络安全", "技能"]}, {"category": "", "categoryclass": "", "imagename": "d4436c9dcaa30017fa58fb406552b596.jpg", "infoid": 1014081, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "科学家们首次在南极洲的海底发现了活跃的甲烷气体泄漏。这一过程可能会加速全球变暖的进程。\n这一发现于周二发表在同行评议的《皇家学会学报》B期科学期刊上。\n甲烷是一种强大的温室气体，会加速气候变化，比二氧化碳更能让地球变暖。\n长期以来，它从冰下泄漏的风险一直令科学家感到担忧，他们可能会说，在它释放到大气之前，一些微生物可以帮助消耗它。\n但新的发现似乎削弱了这一过程在南极洲有效的希望。\n上图：W海特微生物垫是甲烷可能从地下甲烷储藏中释放的区域的警示信号。\n报告称，甲烷泄漏首次发现于2011年，帮助过滤甲烷的微生物花了五年时间才在现场发展起来。\n领导这项研究的俄勒冈州立大学海洋学家安德鲁·瑟伯博士告诉英国《卫报》：这不是好消息。微生物花了五年多的时间才开始出现，即使到那时，仍有甲烷从海底迅速逸出。\n瑟伯说，在该地区生长的第一批微生物是一种意想不到的菌株，一个群落可能需要5到10年的时间才能完全适应并开始消耗甲烷。\n海冰下储存着大量的甲烷。研究人员指出，据估计，南极洲含有多达四分之一的地球海洋甲烷。\n科学家们长期以来一直警告说，如果甲烷泄漏-这是由于全球气温上升导致的冰川融化-对地球的影响。\n美国国家航空航天局(NASA)在2018年警告称，北极冰的融化可能会释放甲烷等气体，导致全球变暖速度更快，而气候预测中没有考虑到这一点。\n从冰中释放甲烷也被认为是气候变化的临界点之一，气温上升的影响无法阻止或逆转。\n研究人员指出，在这种情况下，气体似乎并没有因为全球变暖而释放-泄漏发生的罗斯海并没有显著变暖。\n然而，报告称，这些发现将加深他们对南极洲甲烷消费和释放方式的理解，此前人们对此知之甚少。\n研究人员说，之前没有发现泄漏的事实阻碍了我们对调节南极洲甲烷释放过程的理解。\n他们补充说，更好地了解微生物是如何工作的，将有助于研究人员如何理解温度上升导致甲烷释放到海洋中的原因。\n他们说，这项研究表明，微生物是如何变化和发展的，可能会对海洋甲烷储藏库的温室气体排放产生未意识到的影响。\n我们的结果表明，通过考虑微生物群落对新的甲烷输入做出反应所需的时间，未来全球气候模型的准确性可能会提高。\n然而，在进行更多研究之前，可能还有很长的等待时间。据英国“卫报”报道，由于冠状病毒大流行，他们未来前往南极洲遗址的旅行已经中断。", "note_en": "Scientists have, for the first time, discovered an active leak of methane gas from the sea floor in Antarctica. It is a process that&#39;s likely to accelerate the process of global heating.\n   The finding was published in the peer-reviewed   Proceedings of the Royal Society B scientific journal on Tuesday.\n Methane is powerful greenhouse gas that accelerates  climate change, and warms the planet much more than carbon dioxide does.\n The risk of it leaking from under ice has long concerned scientists, who  say that some microorganisms can help to consume it before it is released into the atmosphere.\n But the new findings appear to dent the hopes of the effectiveness of this process in Antarctica.\n  Above: W hite microbial mats are telltale signs of areas where methane may be released from underground methane deposits.\n The report said the methane leak was first discovered in 2011, and that it took five years for the microorganisms that help filter away the gas to develop at the site.\n  Dr. Andrew Thurber, an oceanographer at Oregon State University, who led the research,  told  The Guardian: &#34;It is not good news. It took more than five years for the microbes to begin to show up and even then there was still methane rapidly escaping from the sea floor.&#34;\n Thurber said that the first microbes to grow in the area were of an unexpected strain, and that &#34;it may be five to 10 years before a community becomes fully adapted and starts consuming methane.&#34;\n    Vast amounts of methane are stored under sea ice. The researchers noted that &#34;Antarctica is estimated to contain as much as a quarter of Earth&#39;s marine methane.&#34;\n Scientists have long warned about the impact on the planet if methane leaks – something that is caused by melting ice as global temperatures rise.\n NASA warned in 2018 that the thawing of ice in the Arctic could release gases like methane, contributing to an even faster global heating that was not taken into account in climate projections.\n The release of methane from ice is also  considered one of the tipping points in climate change, where the effects of rising temperatures cannot be stopped or reversed.\n   The researchers noted that, in this case, the gas did not appear to have been released as a result of global heating – the Ross Sea, where the leak took place, has not warmed in a significant way.\n     The report said, however, that the findings would deepen their understanding of the way that methane is consumed and released in Antarctica, about which very little was known before.\n The fact that no leak had been identified before now was &#34;hindering our understanding of the processes that regulate the release of Antarctica&#39;s methane,&#34; the researchers said.\n They added that better understanding how the microorganisms work will inform how researchers understand the release of methane into oceans as the result of rising temperatures.\n The study, they said, shows that how microorganisms change and develop &#34;may have an unrealized impact on greenhouse gas emission from marine methane reservoirs.&#34;\n &#34;Our results suggest that the accuracy of future global climate models may be improved by considering the time it will take for microbial communities to respond to novel methane input.&#34;\n There may be a long wait before more research could be done, however.  According to  The Guardian, their future travels to the Antarctica site have been disrupted due to the  coronavirus  pandemic.", "posttime": "2020-07-25 13:54:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人员,leak,甲烷", "title": "南极海底首次发现甲烷泄漏证实了研究人员的担忧", "title_en": "First Methane Leak Found on Antarctic Sea Floor Confirms Researchers' Fears", "transed": 1, "url": "https://www.sciencealert.com/there-s-a-strange-methane-leak-from-antarctica-s-sea-floor-and-it-s-not-good-news", "via": "", "real_tags": ["人员", "leak", "甲烷"]}, {"category": "", "categoryclass": "", "imagename": "8e24d2c176aef962bc93e08267d0cd87.png", "infoid": 1014080, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "DataHike是一个持久的Datalog数据库，由高效的Datalog查询引擎提供支持。该项目最初是将DataScript移植到搭便车树。AllDataScript测试正在通过，但我们仍在进行内部工作。如上所述，我们认为Datahike对于中型项目是可用的，因为DataScript非常成熟并且部署在许多应用程序中，而且搭便车-树实现通过生成性测试进行了大量测试。我们正在建设这两个项目和搭便车-树直通Konserve的存储后端。我们愿意听取经验报告，如果您能加入我们，我们将非常高兴。\n目前我们为JVM提供了一个小而稳定的API，但是磁盘上的模式还没有修复。在达到稳定的磁盘架构之前，我们将提供迁移指南。在升级之前，请先查看一下ChangeLog。\n(要求&#39；[datahike.api：as d])；；使用文件系统作为存储介质(def cfg{：store{：backend：file：path&#34；/tmp/example&#34；}})；；在此位置创建数据库，根据默认配置，我们执行严格的；；模式并保留所有历史数据(d/create-database cfg)(def conn(d/connect cfg))；；第一个事务将是我们正在使用的模式；您也可以在数据库创建中添加：Initial-tx；；到配置(d/transact conn[{：db/ident：name：db/valueType：db.type/string：db/cardinality：db.cardinality/one}{：db/ident：age：db/valueType：db.type/long：db/cardinality：db.cardinality/one}])；；让我们添加一些数据并等待事务(d/transact conn[{{。，：age 20}{：name&#34；Bob&#34；，：age 30}{：name&#34；Charlie&#34；，：age 40}{：age}{：age 15}])；；搜索数据(d/q&#39；[：find？e？n？a：where[？e：name？n][？e：age？A]]@conn)；；=&gt；#{[3&#34；Alice&#34；20][4&#34；Bob&#34；30][5&#34；Charlie&#34；40]}；使用散列映射添加新实体数据(d/transact conn{：tx-data[{：db/id 3：age 25}]})；；如果要使用类似于中的查询；；https://grishaev.me/en/datomic-query/，；；您可以使用散列映射(d/q{：查询&#39；{：find[？e？n？a]：where[[？e：name？n][？e：age？a]}：args[@conn]})；=&gt；#{{[5&#34；Charlie&#34；40][4&#34；Bob&#34；30][3&#34；alice&#34；25]}；；查询数据历史记录(d/q&#39；[：find？a：where[？e：name&#34；alice&#34；][？e：age？a]](d/History@conn)；；=&gt；#{[20][25]}；可能需要释放特定商店的连接，如level db(d/release conn)；；如果不再需要，请清理数据库(d/delete-database cfg)。\nAPI命名空间提供了对数据功能子集的兼容性，并且应该作为JVM上的临时替代。DataHike的其余部分将被移植到core.async，以平台中立的方式协调IO。\nDataHike提供了类似于DATOMIC的功能，并且可以作为它的子集的临时替代。Datahike的目标不是提供一个重新实现的开源数据结构，而是旨在构建分布式数据管理解决方案的Replikativ工具箱的一部分。我们已经和许多后端工程师和ClojureDeveloper交谈过，他们试图远离Datonomic，因为它的专有性质，我们认为在这方面，Datahike应该让Datomic变得更容易，反之亦然，那些只想在小型应用程序中使用Datalog的好处的人不应该担心设置和依赖Datonomic的问题。在这方面，DataHike应该使DataMic变得更容易，反之亦然，那些只想在小型应用程序中使用Datalog的人不应该担心设置和依赖Datomic。\nDataHike在一个对等点上本地运行。将来可能会提供事务处理机，也可以通过任何线性化写入机制来实现，例如Apache Kafka。如果您有兴趣，请与我们联系。\nDataHike将数据库作为透明值提供，也就是说，您可以直接访问索引数据结构(搭便车-树)，并利用它们的持久性进行复制。这些内部结构不能保证保持稳定，但提供了对正在发生的事情的有用洞察力，并且可以进行优化。\n数据是由Clojure的作者和有丰富经验的人构建的成熟的可伸缩数据库(即服务)。如果你需要这样的专业支持，你绝对应该坚持使用DATOMIC。\nDatahike的查询引擎和大部分代码库都来自DataScript。如果没有DataScript上的工作，DataHike就不可能实现。这里记录了与数据公司在查询引擎方面的不同之处。\n如果你的应用程序对一个典型的耐用数据库有适度的要求，例如一台机器和最多几百万个实体，那么选择Datahike。同样，如果你想要一个开源的解决方案，并且能够研究和修补你的数据库的代码库，Datahike提供了一个相对较小和结构良好的代码库来根据你的需要进行调整。您还应该始终能够在以后轻松地迁移到DATMIC。\n如果您已经知道以后将需要可伸缩性，或者如果您的数据库需要网络API，请选择DATOMIC。关于“数据在线”的资料也已经很多了。其中大部分以这样或那样的形式应用于Datahike，但是在您第一次学习Datalog时，直接使用Datomic可能会更容易一些。\n如果您想要尽可能快的查询性能并且没有大量数据，请选择DataScript。您可以轻松地将写操作单独持久化，然后使用DataScript的快速内存索引数据结构。Datahike目前也不再支持ClojureScript，尽管我们计划恢复此功能。\n您必须在升级到已更改磁盘格式的DataHike版本之前执行此操作。只要我们达到版本1.0.0，就会发生这种情况，并且将始终通过ChangeLog进行通信。升级DataHike版本后，您可以使用。\n数据以基于行的格式存储为字符串，因此您可以轻松地检查您的转储是否包含合理的数据。您还可以使用它对数据库进行一些基于字符串的编辑。您还可以将导出用作备份。\n如果您要从我们还没有迁移代码的0.1.2之前版本升级，那么只需评估数据隐藏。在导出之前在您的项目中手动迁移命名空间。\n我们很乐意为Lambdaforge提供商业支持。如果您对某一特色感兴趣，请告诉我们。", "note_en": "Datahike is a durable  Datalog databasepowered by an efficient Datalog query engine. This project started as a port of DataScript to the hitchhiker-tree. AllDataScript tests are passing, but we are still working on the internals. Havingsaid this we consider Datahike usable for medium sized projects, since DataScript isvery mature and deployed in many applications and the hitchhiker-treeimplementation is heavily tested through generative testing. We arebuilding on the two projects and the storage backends for the hitchhiker-treethrough  konserve. We would like tohear experience reports and are happy if you join us.\n       We provide a small stable API for the JVM at the moment, but the on-disk schemais not fixed yet. We will provide a migration guide until we have reached astable on-disk schema.  Take a look at the ChangeLog before upgrading.\n ( require &#39;[datahike.api  :as d])  ;; use the filesystem as storage medium( def  cfg { :store { :backend  :file  :path   &#34;/tmp/example &#34;}})  ;; create a database at this place, per default configuration we enforce a strict  ;; schema and keep all historical data( d/create-database cfg)( def  conn ( d/connect cfg))  ;; the first transaction will be the schema we are using  ;; you may also add this within database creation by adding :initial-tx  ;; to the configuration( d/transact conn [{ :db/ident  :name  :db/valueType  :db.type/string  :db/cardinality  :db.cardinality/one } { :db/ident  :age  :db/valueType  :db.type/long  :db/cardinality  :db.cardinality/one }])  ;; lets add some data and wait for the transaction( d/transact conn [{ :name   &#34;Alice &#34;,  :age  20 } { :name   &#34;Bob &#34;,  :age  30 } { :name   &#34;Charlie &#34;,  :age  40 } { :age  15 }])  ;; search the data( d/q &#39;[ :find ?e ?n ?a  :where [?e  :name ?n] [?e  :age ?a]] @conn)  ;; =&gt; #{[3 &#34;Alice&#34; 20] [4 &#34;Bob&#34; 30] [5 &#34;Charlie&#34; 40]}  ;; add new entity data using a hash map( d/transact conn { :tx-data [{ :db/id  3  :age  25}]})  ;; if you want to work with queries like in  ;; https://grishaev.me/en/datomic-query/,  ;; you may use a hashmap( d/q { :query &#39;{ :find [?e ?n ?a ]  :where [[?e  :name ?n] [?e  :age ?a]]}  :args [@conn]})  ;; =&gt; #{[5 &#34;Charlie&#34; 40] [4 &#34;Bob&#34; 30] [3 &#34;Alice&#34; 25]}  ;; query the history of the data( d/q &#39;[ :find ?a  :where [?e  :name   &#34;Alice &#34;] [?e  :age ?a]] ( d/history @conn))  ;; =&gt; #{[20] [25]}  ;; you might need to release the connection for specific stores like leveldb( d/release conn)  ;; clean up the database if it is not need any more( d/delete-database cfg)\n The API namespace provides compatibility to a subset of Datomic functionalityand should work as a drop-in replacement on the JVM. The rest of Datahike willbe ported to core.async to coordinate IO in a platform-neutral manner.\n       Datahike provides similar functionality to  Datomic and canbe used as a drop-in replacement for a subset of it. The goal of Datahike is notto provide an open-source reimplementation of Datomic, but it is part of the replikativ toolbox aimed to build distributeddata management solutions. We have spoken to many backend engineers and Clojuredevelopers, who tried to stay away from Datomic just because of its proprietarynature and we think in this regard Datahike should make an approach to Datomiceasier and vice-versa people who only want to use the goodness of Datalog insmall scale applications should not worry about setting up and depending onDatomic.\n  Datahike runs locally on one peer. A transactor might be provided in thefuture and can also be realized through any linearizing write mechanism, e.g.Apache Kafka. If you are interested, please contact us.\n Datahike provides the database as a transparent value, i.e. you can directlyaccess the index datastructures (hitchhiker-tree) and leverage theirpersistent nature for replication. These internals are not guaranteed to staystable, but provide useful insight into what is going on and can be optimized.\n Datomic is a full-fledged scalable database (as a service) built from theauthors of Clojure and people with a lot of experience. If you need this kindof professional support, you should definitely stick to Datomic.\n Datahike&#39;s query engine and most of its codebase come from DataScript. Without the work onDataScript, Datahike would not have been possible. Differences to Datomic withrespect to the query engine are documented there.\n   Pick Datahike if your app has modest requirements towards a typical durabledatabase, e.g. a single machine and a few millions of entities at maximum.Similarly if you want to have an open-source solution and be able to study andtinker with the codebase of your database, Datahike provides a comparativelysmall and well composed codebase to tweak it to your needs. You should alsoalways be able to migrate to Datomic later easily.\n  Pick Datomic if you already know that you will need scalability later or if youneed a network API for your database. There is also plenty of material aboutDatomic online already. Most of it applies in some form or another to Datahike,but it might be easier to use Datomic directly when you first learn Datalog.\n  Pick DataScript if you want the fastest possible query performance and do nothave a huge amount of data. You can easily persist the write operationsseparately and use the fast in-memory index datastructure of DataScript then.Datahike also at the moment does not support ClojureScript anymore, although weplan to recover this functionality.\n      You must do so before upgrading to a Datahike version that has changed theon-disk format. This can happen as long as we are arriving at version  1.0.0and will always be communicated through the Changelog. After you have bumped theDatahike version you can use\n   The datoms are stored as strings in a line-based format, so you can easily checkwhether your dump is containing reasonable data. You can also use it to do somestring based editing of the DB. You can also use the export as a backup.\n If you are upgrading from pre  0.1.2 where we have not had the migration codeyet, then just evaluate the  datahike.migrate namespace manually in yourproject before exporting.\n              We are happy to provide commercial support with lambdaforge. If you are interested in a particularfeature, please let us know.", "posttime": "2020-07-25 13:11:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据库,database,datalog,数据", "title": "DataHike：由高效的Datalog查询引擎提供支持的持久Datalog数据库", "title_en": "Datahike: Durable Datalog database powered by an efficient Datalog query engine", "transed": 1, "url": "https://github.com/replikativ/datahike", "via": "", "real_tags": ["数据库", "database", "datalog", "数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014079, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现代网络浏览器(如Firefox或Chrome)有一个相当不错的功能，如果用户碰巧导航到恶意url，浏览器会自动警告用户：\n虽然概念上很简单，但这个功能实际上需要比人们预期的更多的工程工作-特别是，以实际的方式跟踪已知的恶意URL集被证明是多么困难。\n这是因为，一方面，试图存储所有已知恶意URL的数据库(记住，可能包含数百万个条目)对于大多数用户来说实际上是不可行的。\n相反，将用户访问的每个URL发送到某个外部服务，在那里可能会被邪恶的第三方(即Google)记录和数据挖掘，这可能会让大多数用户感到不舒服。\n事实证明，浏览器实际上是通过一种相当有趣的折衷方式来实现此功能的。\n使用称为Bloomfilter的概率数据结构，浏览器在本地维护已知恶意URL集的近似表示。通过查询这个节省空间的本地集合，浏览器将只发送一小部分实际上很可能是恶意的URL。\n使用Bloomfilter充当查询外部数据库的本地代理。\n这种每天保护数百万用户隐私的代理技术依赖于Bloomfilter的两个关键属性：\n这说明如果对Bloomfilter中的URL的查询返回否定，则可以保证所查询的项不存在于恶意URL集合中-即，Bloomfilter保证对所有已知的恶意URL返回肯定的结果。\n此属性规定，对于不在恶意URL集中的任何URL，Bloomfilter查询返回正结果的可能性应该非常低-从而将不必要的侵犯用户隐私的次数降至最低。\n这个机制工作得很好，布隆过滤器的保证似乎非常适合这个特殊的任务，但是它有一个小问题，那就是：\n事实上，事实证明，布隆过滤器的行为实际上是长达30年的数学争论的主题，需要多次修正，甚至需要修正这些修正。\n考虑到这段错误的历史，我们对Bloomfilter的理解真的有把握吗？\n嗯，别害怕，我写这篇文章是想告诉你，我们最近刚刚使用Coq产生了第一个通过认证的Bloomfilter假阳性率证明，终于结束了这一错误传奇，让无数人每天都依赖的机制恢复了确定性(请原谅双关语1)。\n在这篇文章的其余部分，我们将探讨这项研究的主要亮点，回答以下问题：\n这项研究最近刚刚在CAV2020上发表，题目是“认证近似成员资格结构中的确定性和不确定性”，你可以在这里找到论文，以及这里的视频演示。\n本研究项目中使用的代码和证明均为自由/开源软件，可在陶艺家资源库：https://github.com/certichain/ceramist上找到。\n要将Bloomfilter用作近似集合，我们可以按如下方式执行标准集合操作：\n要将一个值插入到布隆过滤器中，只需对每个哈希函数进行哈希运算，并将哈希输出作为位向量的索引，提高相应的位。\n要查询Bloomfilter中的值，请再次对每个哈希函数进行哈希运算，然后检查是否引发了所有相应的位。\n这些操作虽然相当简单，但实际上完全足以确保无假阴性属性(有关Coq语句，请参阅此处)：\n当项目被插入Bloomfilter时，它将导致位向量中的某些位的子集被引发。由于没有可以取消设置这些位的操作，我们可以确定对插入的元素的任何后续查询都必须返回TRUE。换句话说，如果查询得到否定的结果，我们可以确定该项目以前从未插入过Bloomfilter。\n这就是负面结果的情况；由于可能出现假阳性，对于正面结果来说，事情会变得稍微有趣一些。", "note_en": "There&#39;s this rather nifty feature of modern web browsers (such as Firefox or  Chrome) where the browser will automatically warn theuser if they happen to navigate to a &#34; malicious&#34; url:\n  While  conceptually simple, this feature actually requires moreengineering effort than one would expect - in particular, tracking theset of known malicious URLs in a practical manner turns out to besomewhat difficult.\n This is because, on one hand, trying to store the database of  allknown malicious URLs, which, bear in mind, may contain  millions andmillions of entries, is something that is just practicallyinfeasible for most users.\n Conversely, sending  every URL that a user visits to some externalservice, where it could be  logged and  data-mined by nefariousthird parties (i.e Google), is something that most users shouldprobably not be comfortable with.\n As it turns out, browsers actually implement this functionality bymeans of a rather interesting  compromise.\n Using a probabilistic data structure known as a  Bloomfilter,Browsers maintain a approximate representation of the set of knownmalicious URLs locally. By querying this  space-efficient local set,browsers will only send up a  small proportion of URLs that have a high likelihood of actually being malicious.\n Use a Bloomfilter to act as a local proxy for queries to an external database.\n This proxy technique, which safe-guards the privacy of millions ofusers ever day, depends on  two key properties of Bloomfilters:\n This states that if a query for an URL in theBloomfilter returns negative, then the queried item can beguaranteed to not be present in the set of malicious URLs - i.e the Bloomfilter is guaranteed to return a positive result forall known malicious URLs.\n  This property states that for any URLthat is  not in the set of malicious URLs, the likelihood of aBloomfilter query returning a positive result should be  fairlylow - thus minimising the number of  unnecessary infractions onuser privacy.\n This mechanism works  quite well, and the guarantees of a Bloomfilterseem to be perfectly suited for this particular task, however it hasone small problem, and that is:\n  In fact, as it turns out, the behaviours of a Bloomfilter haveactually been the subject of 30 years of mathematical contention,requiring  multiple corrections and even  corrections of thesecorrections.\n Given this history of errors, can we really have any certainty in ourunderstanding of a Bloomfilter at all?\n Well,  never fear, I am writing this post to inform you that we havejust recently used  Coq to produce the  very first  certified proofof the false positive rate of a Bloomfilter, finally putting an end tothis saga of errors and returning certainty (pardon the pun  1) to amechanism that countless people rely on  every single day.\n In the rest of this post, we&#39;ll explore the main highlights of thisresearch, answering the following questions:\n  This research was just recently presented at CAV2020 under the title&#34;Certifying Certainty and Uncertainty in Approximate Membership QueryStructures&#34;, you can find the paper  here, and a video presentation ofit  here.\n The code and proofs used in this research project are FOSS, and can befound on the Ceramist repo:  https://github.com/certichain/ceramist\n To use the Bloomfilter as an approximate set, we can perform thestandard set operations as follows:\n To insert a value   into a Bloomfilter  , simplyhash it over each one of the   hash functions, andtreating the hash outputs as indices into thebit-vector, raise the corresponding bits.\n  To query for a value   in the Bloomfilter, once againhash it over each one of the   hash functions, and thencheck whether  all of the corresponding bits are raised.\n These operations, while fairly straightforward, are actually entirelysufficient to ensure the  No false negatives property (see  here for Coq statement):\n When an item is inserted into the Bloomfilter, it will result in acertain subset of the bits in the bitvector being raised. As thereare no operations that can  unset these bits, we can be certain thatany subsequent query for the inserted element  must return true. Inother words, if we get a negative result for a query, we can becertain that the item has never been inserted into the Bloomfilterbefore.\n This is the case for negative results; things get slightly moreinteresting for  positive results due to the possibility of  falsepositives.", "posttime": "2020-07-25 13:11:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "揭穿,debunked,bloomfilter", "title": "Bloomfilter被揭穿：用Coq消解30年的数学", "title_en": "Bloomfilters debunked: Dispelling 30 Years of math with Coq", "transed": 1, "url": "https://gopiandcode.uk/logs/log-bloomfilters-debunked.html", "via": "", "real_tags": ["揭穿", "debunked"]}, {"category": "", "categoryclass": "", "imagename": "bad4799d04cda93ab78137695a9beaa4.jpg", "infoid": 1014077, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿一名技术高管已被拘留，并因550万美元的冠状病毒救济基金欺诈案被起诉。\n48岁的穆昆德·莫汉(Mukund Mohan)被控提交假文件和公司记录，以向Paycheck Protection Program(PPP)索赔资金。Paycheck Protection Program(PPP)是为了帮助企业在冠状病毒期间留住员工而设立的。\n这位在2015年TED演讲中谈到企业管理的连续创业者，被指控犯有一项电信欺诈罪和另一项洗钱罪。\n来自华盛顿的莫汉据称代表六家不同的公司提交了八份欺诈性的PPP贷款申请。\n根据司法部的说法，他对这两家公司各自的业务运营和工资支出做出了大量虚假和误导性的陈述。\n在一个例子中，莫汉告诉人民银行，他的公司Mahenjo有几十名员工。\n实际上，他是在5月份从互联网上买下Mahenjo的，当时Mahenjo还没有员工或商业活动，是从一家专门从事老化空壳公司的公司手中收购的，这样它们看起来就像是合法的。\n据莫汉的LinkedIn称，他目前担任加拿大在线建材零售商BuildDirect的首席技术官。\n他之前曾在亚马逊业务担任产品管理总监，并在微软云和企业业务担任工程总监。\nZiganitt LLC是他申请冠状病毒救济的公司之一，部分由他十几岁的儿子领导-他是公司的首席营销官。\n根据Geekwire的个人资料，它为游戏玩家和需要测试游戏的开发者牵线搭桥。\n莫汉获得了304,830美元的PPP公司贷款，尽管该公司从未支付员工工资或工资税。\n根据德里新闻网站Inc42 2015年的一篇报道，莫汉声称的许多技术成就都是捏造或夸大的。\n冠状病毒援助、救济和经济安全法案是一项联邦法律，旨在为遭受COVID经济影响的美国人提供紧急财政援助。\n小企业可以通过PPP申请高达3490亿美元的可免除贷款，用于保住工作和某些其他费用。\nPPP允许符合条件的小企业和其他组织获得利率为1%的贷款。\n如果企业在规定的时间内将收益花在这些费用上，这笔钱必须用于支付工资成本、抵押贷款利息、租金和水电费以及利息和本金。\n至少需要将一定比例的贷款用于工资支出。", "note_en": "A Washington technology executive has been taken into custody and charged over a $5.5million  coronavirus relief fund fraud.\n Mukund Mohan, 48, was accused of handing in fake documents and incorporation records to claim money from the Paycheck Protection Program (PPP) - which was set up to help businesses keep staff employed during coronavirus.\n The &#39;serial entrepreneur&#39;, who spoke about business management during a TED talk in 2015, has been charged with one count of wire fraud and another of money laundering.\n Mohan, from Washington, allegedly submitted eight fraudulent PPP loan applications on behalf of six different companies.\n He made &#39;numerous false and misleading statements about the companies&#39; respective business operations and payroll expenses&#39;, according to the Department of Justice.\n In one example, Mohan told a lender, the Peoples&#39; Bank, his company Mahenjo had dozens of employees.\n  He actually bought Mahenjo off the internet in May, when it had no employees or business activity, from a company that specialized in &#39;aging&#39; shell corporations so they seemed legitimate.\n  Mohan currently works as the chief technology officer at online Canadian building materials retailer BuildDirect, according to his LinkedIn.\n He previously worked as a director of product management at Amazon business and director of engineering at Microsoft Cloud and Enterprise Business.\n Ziganitt LLC, one of the companies for which he filed for coronavirus relief, is led in part by his teenage son - who is its Chief Marketing Officer.\n   It matches gamers with developers who need to test their games, according to Geekwire&#39;s profile.\n Mohan was handed $304,830 in PPP loans for the company, despite it never paying employee wages or payroll taxes.\n And many of Mohan&#39;s purported tech exploits were fabricated or exaggerated, according to a 2015 report in Delhi-based news site Inc42.\n The Coronavirus Aid, Relief, and Economic Security Act is a federal law meant to provide emergency financial assistance Americans suffering the economic effects of COVID.\n  Small businesses can claim up to $349 billion in forgivable loans for job retention and certain other expenses through the PPP.\n  The PPP lets qualifying small businesses and other organizations to receive loans with an interest rate of one percent.\n The money has to be used for payroll costs, interest on mortgages, rent and utilities and interest and principal to be forgiven if businesses spend the proceeds on these expenses within a set time period.\n At least a certain percentage of the loan needs to be put towards payroll expenses.", "posttime": "2020-07-25 12:47:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,冠状病毒,microsoft,亚马逊,病毒", "title": "前亚马逊和微软逮捕超过550万美元的冠状病毒救济基金欺诈案", "title_en": "Former Amazon and Microsoft arrested over $5.5M coronavirus relief fund fraud", "transed": 1, "url": "https://www.dailymail.co.uk/news/article-8557365/FBI-arrest-former-Amazon-Microsoft-executive-5-5million-coronavirus-relief-fund-fraud.html", "via": "", "real_tags": ["冠状病毒", "microsoft", "亚马逊", "病毒"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014076, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我的手机突然显示了火狐关于Facebook或Mark Z的通知。当我点击通知时，火狐打开并在blog.mozilla.org上显示了一个页面。顶部的第一篇文章是#StopHateForProfit&#34；使用您的声音来#StopHateForProfit&#34；。\n我并不反对收到有关产品和功能的提示；但我觉得火狐在未经我同意的情况下将一些竞选信息推送到我的手机上是不可接受的。如果Mozilla想要推送这样的消息，Firefox应该在Notification下面有一个新的类别，比如Mozilla.org&#34；的竞选消息。\n您需要先登录，然后才能对此错误进行评论或更改。", "note_en": "My phone suddenly shows a notification from Firefox about Facebook or Mark Z. when I clicked on the notification, Firefox opened to show a page on blog.mozilla.org. The first article at the top is &#34;Use Your Voice to #StopHateForProfit&#34;.\n  I don&#39;t object to receiving tips about product and feature; but I find it unacceptable that Firefox without my consent is pushing some campaign message to my phone. If Mozilla would like to push such messages, Firefox should have a new category under Notification, such as &#34;Campaign messages from Mozilla.org&#34;\n   You need to  log in before you can comment on or make changes to this bug.", "posttime": "2020-07-25 12:25:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "firefox,推送,push,火狐", "title": "Firefox推送[ing]无关通知", "title_en": "Firefox push[ing] irrelevant notifications", "transed": 1, "url": "https://bugzilla.mozilla.org/show_bug.cgi?id=1655178", "via": "", "real_tags": ["firefox", "推送", "push", "火狐"]}, {"category": "", "categoryclass": "", "imagename": "c05cd2a580ab8ec4f2b934b11aa98dae.jpg", "infoid": 1014075, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个月，一位宇宙来客正在为天空增光添彩。7月3日，一颗彗星掠过太阳，从那以后，肉眼就可以看到它了。从太阳系外瞥见古老冰块的难得机会应该会在下周继续，天文学家希望届时它会变得更加明亮。\n3月27日，科学家们使用近地物体广域红外勘测探测器(NEOWISE)太空望远镜首次发现了这颗冲向太阳的彗星。这颗彗星以望远镜的名字非正式地命名为NeOWISE，但官方标记为C/2020 F3，随着阳光和太阳风导致它释放气体并形成尾巴，这颗彗星逐渐变亮。6月初，从地球上看，它到达了太阳的另一边。由此产生的强光使天文学家在几周内无法观测到这颗彗星。然而，到了6月下旬，它又游回了另一架太空望远镜--太阳和日球层天文台(SOHO)的光学系统中。然而，它的命运仍然不明朗：新彗星是会变亮还是会褪色？\n7月3日，观察家们密切关注着这颗彗星开始了它旅程中最危险的部分：它最接近太阳的地方，这使它距离我们的恒星不到4400万公里。如此近距离产生的强烈光和热往往会使彗星解体并从夜空中消失。今年早些时候，另外两颗彗星ATLAS和Swan也发生了这样的解体，天文学家曾希望这两颗彗星能照亮地球的天空。但NeOWISE幸存了下来，出现了比以前更明亮的景象，让天文学家们眼花缭乱--前提是他们知道去哪里看。现在，至少在接下来的几天里，北半球的居民可以在黎明时分迎接过往的游客。\n“对于北半球的许多人来说，特别是如果你离中纬度更近的话，(彗星)应该在日出前一个小时就能看到，在东北部的天空非常低，”克里-安·莱基·赫本(Kerry-Ann Lecky Hepburn)说。他是一位气象学家和天体摄影师，捕捉到了多伦多上空NEOWISE彗星的图像。“现在它位于御夫座。”她建议使用带有互动星座地图的专门智能手机应用程序找到彗星的确切位置。虽然肉眼已经可以看到这个物体，但它仍然很模糊，双筒望远镜可以提供更好的视野。\n莱基·赫本说，从7月12日左右开始，NEOWISE彗星也将在晚上出现。日落后大约一个小时，它将出现在西北地平线附近。随着月份的推移，它将在天空中升得更高，从山猫星座向北斗七星移动。7月22日，这颗彗星将到达距离地球最近的一点-1.03亿公里-然后继续其宇宙飞行。然而，到那时它是否仍然可以用肉眼看到还不确定。\n“彗星就像猫，”SETI研究所的天文学家弗兰克·马奇斯(Franck Marchis)说。“他们是不可预测的。”如果NEOWISE彗星的放气耗尽了它储存的冰物质，它明亮的尾巴可能会消散，有效地将该物体从视野中移走。在另一个极端，来自太阳的持续加热可能导致彗星在明亮的爆发中解体，潜在地导致一颗具有历史意义的高度可见的“伟大的彗星”。马奇斯说，这种可能性将是“一个壮观的事件，对地球人来说是一场伟大的表演”。但“就我个人而言，我建议你早点走过去，趁我们知道它就在这里的时候，现在就去看看。”\n在这次相遇之后，天文学家们预计NEOWISE彗星将在相当长的一段时间内告别。它围绕我们的恒星的漫长而循环的轨道将在大约6800年后将它带回地球附近。\n你成功地发现并拍摄到新彗星了吗？用#EyesOnNEOWISE标签将您最喜欢的图片发送到Twitter@SCIAM上，发送给“科学美国人”。", "note_en": "This month a cosmic visitor is gracing the skies. A comet swept past the sun on July 3, and it has since become visible to the naked eye. The rare opportunity to glimpse the chunk of ancient ice from the outer solar system should continue next week, when astronomers hope it will become even brighter.\n Scientists using the Near-Earth Object Wide-Field Infrared Survey Explorer (NEOWISE) space telescope first spotted the comet as it hurtled toward the sun on March 27. Informally dubbed NEOWISE after the telescope but officially labeled C/2020 F3, the comet gradually brightened as sunlight and solar wind caused it to release gases and form a tail. In early June it reached the far side of the sun, as seen from Earth. The resulting glare prevented astronomers from observing the comet for several weeks. By late June, however, it swam back into the optics of another space telescope, the Solar and Heliospheric Observatory (SOHO). Its fate was still unclear, however: Would Comet NEOWISE brighten or fade?\n On July 3 observers watched closely as the comet began the most perilous part of its journey: its nearest approach to the sun, which brought it within 44 million kilometers of our star. The intense light and heat from such close proximity tends to make comets disintegrate and disappear from the night sky. Earlier this year, such breakups befell two other comets, ATLAS and SWAN, that astronomers had hoped would light up Earth’s skies. But NEOWISE survived and emerged brighter than before to dazzle stargazers—provided they know where to look. Now, for the next few days at least, residents of the Northern Hemisphere can greet the passing visitor at dawn.\n “For many people in the Northern Hemisphere, especially if you’re closer to the midlatitudes, [the comet] should be visible an hour before sunrise, very low in the northeastern sky,” says Kerry-Ann Lecky Hepburn, a meteorologist and astrophotographer who  captured an image of Comet NEOWISE over Toronto. “Right now it’s located in the constellation Auriga.” She recommends finding the comet’s exact spot using specialized smartphone apps with interactive maps of the constellations. Although already visible to the naked eye, the object is still faint, and binoculars would offer a better view.\n Starting around July 12, Comet NEOWISE will be visible in the evening as well, Lecky Hepburn says. About an hour after sunset, it will appear near the northwestern horizon. As the month progresses, it will rise higher in the sky, moving from the constellation Lynx toward the Big Dipper. On July 22 the comet will reach its closest point to Earth—a distance of 103 million kilometers—before continuing its cosmic flight. Whether it will still be visible to unaided eyes by then is uncertain, however.\n “Comets are like cats,” says Franck Marchis, an astronomer at the SETI Institute. “They are unpredictable.” If Comet NEOWISE’s outgassing exhausts its reserves of icy material, its bright tail could dissipate, effectively removing the object from view. On the other extreme, ongoing heating from the sun could cause the comet to disintegrate in a bright outburst, potentially resulting in a highly visible “great comet” of historic significance. This possibility would be “a spectacular event and a great show for the earthlings,” Marchis says. But “personally, I recommend walking up early and going to see it now, while we know it’s here.”\n After this encounter, astronomers expect Comet NEOWISE to bid farewell for quite some time. Its long, looping orbit around our star will next bring it back to Earth’s vicinity some 6,800 years from now.\n  Have you managed to spot and photograph Comet NEOWISE? Send Scientific American  your favorite images on Twitter  @sciam with the hashtag #EyesOnNEOWISE.", "posttime": "2020-07-25 12:03:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "彗星,neowise", "title": "NEOWISE彗星可能是壮观的：这里是如何观看它的", "title_en": "Comet NEOWISE Could Be Spectacular: Here’s How to See It", "transed": 1, "url": "https://www.scientificamerican.com/article/comet-neowise-could-be-spectacular-heres-how-to-see-it/", "via": "", "real_tags": ["彗星", "neowise"]}, {"category": "", "categoryclass": "", "imagename": "4a6ff1c6cec284de8307a3faa885f4da.png", "infoid": 1014074, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们才刚刚开始！如果您需要高性能的文本编辑器，可以尝试WindEdit。\n完全免费供商业和非商业使用，没有限制。所有源代码(第三方目录除外)均按照Apache-2.0许可证条款提供。\n支持突出显示开始分隔符和结束分隔符，如()、[]、{}和自定义分隔符。\n集成sftp、scp客户端，支持下载、上传、删除、重命名、新建文件/目录等。\n使用VIM键绑定的本地和远程模式。(使用Shift+Enter键在远程和本地模式之间切换)。\nWindows 10-2.3 GHz英特尔酷睿i5和8 GB内存。MacOS 10.13-2.3 GHz英特尔酷睿i5和8 GB内存。\n对于WindTerm：WinTerm中未使用配色方案。配色方案将导致大约2%的损失和更多的内存使用。对于Alacritty：找不到如何设置回滚行限制，因此每次测试都使用其默认设置，并且没有测量内存使用量。\n在所有情况下，都运行了三次来预热系统缓存。报道的数字是5次运行的中位数。\n考虑到网络对延迟的影响，以下数据来自DIGEdit。DIGEdit是WindTerm的文本组件。", "note_en": "We&#39;re just beginning! If you want a high performance text editor, you can try  WindEdit.\n  Completely FREE for commercial and non-commercial use without limitations. All source codes (except thirdparty directory) are provided under the terms of Apache-2.0 license.\n              Supports highlighting the opening and closing delimiter, such as (), [], {} and the customed delimiters.\n Integrated sftp, scp client, supports download, upload, remove, rename, make new file/directory and so on.\n Local and remote modes with vim keybindings. (Using Shift+Enter key to switch between remote and local mode)\n            windows 10 - 2.3 GHz Intel Core i5 and 8GB memory.MacOs 10.13 - 2.3 GHz Intel Core i5 and 8GB memory.\n   For WindTerm: No color scheme used in windterm. Color scheme will result in approximately 2% loss and more memory usage.For Alacritty: Can not find how to set the scrollback lines limit, so every test use its default setting and no memory usage measured.\n     In all cases, three runs were made to warm system caches. The reported numbers are the median of five runs.\n                   Considering the network influence on the latency, the following data is from  DIGEdit.DIGEdit is the text component of WindTerm.", "posttime": "2020-07-25 12:02:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "devops,ssh", "title": "WindTerm 1.4-用于DevOps的专业SSH/SFTP/Shell/Telnet/串行客户端", "title_en": "WindTerm 1.4 – A Professional SSH/SFTP/Shell/Telnet/Serial Client for DevOps", "transed": 1, "url": "https://github.com/kingToolbox/WindTerm", "via": "", "real_tags": ["devops", "ssh"]}, {"category": "", "categoryclass": "", "imagename": "c72a4bdf84c77ccc3eff0558d5edc17a.jpg", "infoid": 1014073, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在处理字符串时，很容易将其视为字符(或字节)数组，并将其作为字符(或字节)进行处理。\n假设您想要确定字符串是否为ASCII。在ASCII中，每个字符都必须是小于128的字节值。检查字符串是否为ASCII的一个很好的C++17方法可能如下所示。\nBool is_ascii_Branch(const std：：string_view v){for(size_t i=0；i&lt；v.size()；i++){if(uint8_t(v[i])&gt；=128){return false；}}返回true；}。\n在此代码的逻辑中考虑这一点很重要。您告诉编译器的是按顺序访问所有字符，检查它是否是ASCII字符，如果不是，则退出。因此，如果字符串不包含ASCII字符，则只应读取第一个字符。\n如果您希望字符串主要以非ASCII字符开头，则它可能是高性能代码。但是，如果您期望字符串几乎总是ASCII，那么此代码将不会是最佳的。\n您可能会抱怨编译器应该能够为您优化它，它确实会这样做，但只是在您提供的代码的约束范围内。编译器通常不负责重新设计算法。\n如果您期待ASCII输入，那么您应该使用尽可能少的步骤来遍历字符串。以下代码依赖于这样一个事实，即我们的处理器可以使用单个指令处理64位块：\nBool is_ascii_Branch(const std：：string_view v){uint64_t run=0；size_t i=0；for(；i+8&lt；=v.size()；i+=8){uint64_t payload；memcpy(&amp；payload，v.data()+i，8)；running|=payload；}for(；i&lt；v.size()；I++){Running|=v[i]；}return(Running&amp；0x8080808080808080)==0；}。\n这是一个乐观的函数：如果您在早期遇到非ASCII字符，如果字符串很长，您最终会做很多不必要的工作。\n你可以尝试一下这两者的混合体。你读8个字符，检查它们是否是ASCII，如果不是，就跳出来。\nBool is_ascii_hyder(const std：：string_view v){size_t i=0；for(；i+8&lt；=v.size()；i+=8){uint64_t payload；memcpy(&amp；payload，v.data()+i，8)；if((payload&amp；0x808080808080808080)！=0)返回false；}for(；i&lt；v.size(。I++){if((v[i]&amp；0x80)！=0)return false；}return true；}。\n这些功能如何比较？我用短的ASCII字符串(少于128个字符)编写了一个快速基准测试。我知道逐个字符的速度大约是原来的一半。您的结果各不相同，请使用您的编译器在您的机器上运行我的基准测试。\n通过一些工作，您可能可以进行得更快，但请注意，我特意选择了一个带有小的、零散的字符串的基准测试。", "note_en": "When processing strings, it is tempting to view them as arrays of characters (or bytes) and to process them as such.\n Suppose that you would like to determine whether a string is ASCII. In ASCII, every character must be a byte value smaller than 128. A fine C++17 approach to check that a string is ASCII might look as follows.\n bool is_ascii_branchy ( const std ::string_view v )  {\r  for  ( size_t i  =  0 ; i  &lt; v .size ( ) ; i + + )  {\r  if  (uint8_t (v [i ] )  &gt; =  128 )  {\r  return false ;\r  }\r  }\r  return true ;\r }\n It is important to consider at the logic of this code. What you are telling the compiler is to access all characters in sequence, check whether it is an ASCII character, and bail out if not. Thus if the string contains no ASCII character, only the first character should be read.\n It might be high performance code if you are expecting the strings to mostly start with non-ASCII characters. But if you are expecting the string to be almost always ASCII, then this code is not going to be optimal.\n You might complain that the compiler should be able to optimize it for you, and it will, but only within the constraints of the code you provided. Compilers are typically not in the business of redesigning your algorithms.\n If you are expecting ASCII inputs, then you should just run through the string  using as few steps as possible. The following code relies on the fact that our processors can process 64-bit blocks using single instructions:\n bool is_ascii_branchless ( const std ::string_view v )  {\r uint64_t running  =  0 ;\r  size_t i  =  0 ;\r  for ( ; i  +  8  &lt; = v .size ( ) ; i + = 8 )  {\r uint64_t payload ;\r  memcpy ( &amp;payload , v .data ( )  + i ,  8 ) ;\r running  | = payload ;\r  }\r  for ( ; i  &lt; v .size ( ) ; i + + )  {\r running  | = v [i ] ;\r  }\r  return  (running  &amp;  0x8080808080808080 )  = =  0 ; \r }\n It is an optimistic function: if you encounter a non-ASCII character early on, you will end up doing a lot of needless work if the string is long.\n You could try a hybrid between the two. You read 8 characters, check whether they are ASCII, and bail out if they aren’t.\n bool is_ascii_hybrid ( const std ::string_view v )  {\r\r  size_t i  =  0 ;\r  for ( ; i  +  8  &lt; = v .size ( ) ; i + = 8 )  {\r uint64_t payload ;\r  memcpy ( &amp;payload , v .data ( )  + i ,  8 ) ;\r  if ( (payload  &amp;  0x8080808080808080 )  ! =  0 )  return false ;\r  }\r  for ( ; i  &lt; v .size ( ) ; i + + )  {\r  if ( (v [i ]  &amp;  0x80 )  ! =  0 )  return false ;\r  }\r  return true ;\r }\n How do these functions compare?  I wrote a quick benchmark with short ASCII strings (fewer than 128 characters). I get that the character-by-character runs at about half the speed. Your results vary, feel free to run my benchmark on your machine with your compiler.\n  With some work, you can probably go much faster but be mindful of the fact that I deliberately chose a benchmark with small, fragmented, strings.", "posttime": "2020-07-25 11:17:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "性能,避免,character,字符串", "title": "当性能很重要时，避免逐个字符处理", "title_en": "Avoid character-by-character processing when performance matters", "transed": 1, "url": "https://lemire.me/blog/2020/07/21/avoid-character-by-character-processing-when-performance-matters/", "via": "", "real_tags": ["性能", "避免", "character", "字符串"]}, {"category": "", "categoryclass": "", "imagename": "d4923d230d10a14be6c66b3c3d6d7000.png", "infoid": 1014071, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对顾客的痴迷是我们文化的基础。只有当我们的所有客户都一致和可持续地取胜时，我们才是成功的。\n我们加强了我们自己、我们的团队和外部世界之间的反馈循环。我们寻求了解真相，并诚实地进行交流。\n从一端到另一端的思考放大了我们的影响力。我们专注于大局和更广泛的目标，同时又不失远见。\n我们深入了解每一个细节，积极学习、记录和分享知识。我们是日常工作以及如何连接Flexport更大系统的专家。\n我们观察世界，在适当的背景下引导信息，做出正确的决定，并对自己的果断行动负责。这就是我们如何以比我们的竞争对手更快的速度--朝着正确的方向--前进。\n没有捷径可走。我们寻求通过做最艰难的事情来创造最大的价值，从长远来看，最好地服务于每个利益相关者。", "note_en": "Customer obsession is the foundation of our culture. We are successful only when all of our customers are winning, consistently and sustainably.\n We strengthen feedback loops between ourselves, our teams, and the world beyond. We seek to understand the truth and communicate it honestly.\n Thinking from end to end amplifies our impact. We specialize without losing perspective on the big picture and broader goals.\n We dive deep to understand every detail, actively learning, documenting, and sharing knowledge. We are experts in our daily work and how it connects to Flexport’s larger systems.\n We observe the world, orient that information in proper context, make good decisions, and hold ourselves accountable for decisive action. This is how we move with more velocity—speed in the right direction—than our competitors.\n There are no shortcuts. We seek to create the most value by doing the hardest things that best serve every stakeholder over the long term.", "posttime": "2020-07-25 10:13:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "hiring,取胜", "title": "Flexport正在世界各地招聘员工", "title_en": "Flexport is hiring employees all over the world", "transed": 1, "url": "https://www.flexport.com/careers", "via": "", "real_tags": ["hiring", "取胜"]}, {"category": "", "categoryclass": "", "imagename": "6bc63b91a4f802c880147d6020f6a7ef.jpg", "infoid": 1014070, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "科罗拉多大学博尔德分校的研究人员已经开发出一种快速、便携、唾液为基础的新冠肺炎检测方法，能够在45分钟内返回结果。这样的测试最终可能会部署在学校和工厂等社区环境中，目前正在努力进行进一步的验证测试，并寻求监管部门的批准。\n科罗拉多大学博尔德分校生物前沿研究所(BioFrontiers Institute At CU Boulder)索耶实验室(Sawyer Lab)博士后助理尼古拉斯·迈耶森(Nicholas Meyerson)说，“随着越来越多的人想要接受检测，诊断实验室不堪重负，我们现在面临着严重的检测短缺。”“我们已经开发出一种测试，可以更快地将结果送到人们手中。”\n这项测试在周五发布在在线档案馆MedRxiv.org上的预印手稿中进行了描述，旨在进行广泛的筛查，以帮助识别无症状的个体。研究表明，感染病毒但没有明显症状的人占病例的70%，仍然可以传播疾病。在这项新的测试中，使用者在试管中吐痰，加入一种溶液来稳定试管，然后合上盖子，将其交给测试人员。他们通过一个简单的系统来处理它，只需要移液管、加热源和酶混合物即可。\n如果样本从粉红色变成黄色，则检测呈阳性。如果没有，那就是负面的。\n研究人员说，因为不需要棉签，也不需要花哨的设备，测试不太容易受到积压和供应链短缺的影响。\n“到目前为止，每一项已获批准的测试都要求样本，即使是唾液，也要在临床诊断实验室或医生办公室使用先进的设备进行处理。分子细胞和发育生物学系的病毒学家Sara Sawyer教授领导了这项测试的开发，她说：“现在，这可能需要长达9天的时间。”\n这项测试基于一项已有20年历史的技术，名为逆转录环介导的等温扩增(RT-LAMP)，例如，以前曾用于在南美偏远地区对蚊子进行寨卡病毒筛查。\n一旦样本被采集，它就被加热以释放存在于测试液中的任何病毒基因组。然后，这个样本被加入三个试管，每个试管都包含一种定制的酶混合物，当加热到一定的温度时，当检测到来自SARS-CoV-2的遗传物质时，会发生化学反应。那就是导致新冠肺炎的病毒。\n在论文中描述的一个实验中，研究人员进行了所谓的“人为的临床验证”。一名研究人员在实验室的60个唾液样本中添加了30个灭活的SARS-CoV-2。然后，他们将样本洗牌，交给另一位科学家用RT-LAMP技术进行测试。\nMeyerson说：“测试以100%的准确率预测了所有阴性样本，30个阳性样本中有29个被准确预测。”他指出，第30次测试的得分为不确定。额外的第二方验证测试目前正在进行中。\n作者指出，与在临床实验室进行的测试相比，该测试的敏感度略低。但同样由生物前沿研究所(BioFrontiers Institute)的研究人员进行的另一项计算机建模研究发现，快速周转检测对于遏制大流行甚至比检测敏感性更关键。\n该论文的合著者、BioFrontiers主任罗伊·帕克(Roy Parker)说：“我们的模型表明，测试是敏感的还是超敏感的并不那么重要。”这篇论文尚未经过同行审查。“重要的是频繁的检测，检测结果尽快返回，这样可以更快地识别更多的感染者，并可以限制新的感染。”\n“那些检测呈阳性的人可以在等待确认检测时进行自我隔离，”索耶说。该研究小组与CU Boulder的Venture Partners合作，创建了一家名为达尔文生物科学(Darwin Biosciences)的分支公司，将该测试商业化。这项测试还没有得到食品和药物管理局的批准，但研究小组已经通过该机构的紧急使用授权计划提交了文书工作。该团队还在与州政府合作，在当地进行进一步的验证测试，并在等待结果之前，加快监管审批，以便在科罗拉多州使用。\n州长贾里德·波利斯(Jared Polis)在周四的新闻发布会上说，我们非常兴奋，并为科罗拉多大学的科学家们鼓掌。\n该公司还在研发一种名为SickStick的快速、自行检测传染病的方法，它基于不同的技术，包装很像家用验孕。它希望有一天能通过零售店买到它。\n索耶说：“虽然我们都对冠状病毒疫苗持非常乐观的态度，但科学家们30年来一直在研究艾滋病毒疫苗，但没有取得成功。”“与此同时，艾滋病大流行向我们表明，普遍的检测可以起到很大的作用。”", "note_en": "CU Boulder researchers have developed a rapid, portable, saliva-based COVID-19 test able to return results in 45 minutes. Such a test might eventually be deployable in community settings like schools and factories, and efforts are underway to conduct further validation tests and seek regulatory approval.\n “We are facing a serious testing shortage in this country right now as more people want to get tested and diagnostics labs are overwhelmed,” said Nicholas Meyerson, a postdoctoral associate in the Sawyer Lab at the  BioFrontiers Institute at CU Boulder. “We’ve developed a test that could get results to people much faster.”\n   The test, described in a  preprint manuscript posted Friday on the online archive MedRxiv.org, is designed for widespread screening to help identify asymptomatic individuals. Research shows people infected with the virus but with no obvious symptoms make up as many as 70% of cases and can still spread disease. In this new test, a user spits in a tube, adds a solution to stabilize it then closes the lid and hands it off to testing staff. They process it through a simple system requiring little more than pipettes, a heating source and an enzyme mixture.\n If the sample turns from pink to yellow, the test is positive. If it doesn’t, it’s negative.\n Because no swabs are required, and no fancy equipment is needed, the tests are less vulnerable to backlogs and supply chain shortages, the researchers say.\n “Every test that has been approved to date requires that the sample, even if it’s saliva, be processed in a clinical diagnostic lab or at a doctor’s office, using sophisticated equipment. That can take up to nine days right now,” said Professor Sara Sawyer, a virologist in the Department of Molecular Cellular and Developmental Biology who led the development of the test.\n  The test is based on a 20-year-old technology known as reverse transcription loop-mediated isothermal amplification (RT-LAMP) previously used, for instance, to screen mosquitoes for the Zika virus in remote regions of South America.\n Once a sample is collected, it is heated to liberate any viral genome present in the test liquid. This sample is then added to three tubes, each containing a custom enzyme mixture which, when heated to a certain temperature, undergoes a chemical reaction when the genetic material from SARS-CoV-2 is detected. That’s the virus that causes COVID-19.\n In one experiment described in the paper, the researchers conducted what is known as a “contrived clinical validation.” One researcher spiked 30 out of 60 saliva samples with inactivated SARS-CoV-2 in the lab. Then they shuffled the samples and gave them to another scientist to test with the RT-LAMP technology.\n “The test predicted with 100% accuracy all of the negative samples, and 29 of 30 positive samples were predicted accurately,” said Meyerson, noting that the 30th test was scored as inconclusive. Additional second-party validation tests are currently underway.\n The authors note that the test is slightly less sensitive than those performed in clinical labs. But a separate computer modeling study, also by researchers at the BioFrontiers Institute, found that quick turnaround for testing is even more critical to curbing the pandemic than test sensitivity is.\n “Our modeling showed that whether a test is sensitive or super-sensitive is not that important,” said BioFrontiers Director Roy Parker, co-author of that  paper, which has not yet been peer reviewed. “What is important is frequent testing, with the test results returned as fast as possible, which identifies more infected people faster and can limit new infections.”\n   “Those who test positive could quarantine themselves as they await confirmatory testing,” said Sawyer. The research team, in cooperation with Venture Partners at CU Boulder, has created a spinoff company, Darwin Biosciences, to commercialize the test. The test has not been approved by the Food and Drug Administration yet, but the team has submitted paperwork via the agency&#39;s Emergency Use Authorization program. The team is also working with the state to carry out further validation tests locally and, pending those results, expedite regulatory clearance for use in Colorado.\n &#34;We are very excited and applaud the scientists at the University of Colorado,&#34; said Governor Jared Polis, during a press briefing on Thursday.\n The company is also working on a rapid, do-it-yourself test for infectious diseases, known as  SickStick, which is based on a different technology and packaged much like an at-home pregnancy test. It hopes to make it available via retail outlets someday.\n “While we are all very optimistic about a coronavirus vaccine, scientists have been working on an HIV vaccine for 30 years without success,” said Sawyer. “Meantime, the HIV pandemic showed us that pervasive testing can make a big difference.”", "posttime": "2020-07-25 09:50:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "covid,based,检测", "title": "唾液Covid检测：45分钟内结果", "title_en": "Saliva based Covid test: results in 45 minutes", "transed": 1, "url": "https://www.colorado.edu/today/2020/07/22/new-covid-19-test-returns-results-45-minutes-without-nasal-swab", "via": "", "real_tags": ["covid", "based", "检测"]}, {"category": "", "categoryclass": "", "imagename": "e3581a323c52fc1cc325d47cbc617bdd.png", "infoid": 1014069, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我花了一周的时间才找到一个塑料水瓶，里面装满了只能是尿液的东西。\n那是在废弃的房子用带子贴上警告之后，但在我转过身去，在布鲁克林深处一个陌生的街区看到三只达尔马提亚人摇摇晃晃地向我走来之前。当我看到放在人行道中央的瓶子时，感觉就像是一种通过仪式。\n这是我的暑期活动：四处走走，或者用互联网的话说就是“漫游”。装满小便的水瓶在宇航员社区被称为“尿瓶”，这个内部笑话激发了T恤的灵感。正如笑话所说，这很简单：如果你花足够多的时间随意探索世界，你会偶然发现一瓶尿液。\n漫游也很简单。你可以使用免费的应用程序Randonautica来做这件事，它会询问你的位置，提示你从几个不同的“熵”生成器中选择一个-你选择哪一个其实并不重要-然后要求你将注意力集中在你的“意图”上。然后，它会吐出一组坐标，据称，这可能会受到你的大脑与机器互动的影响，或者不会，你可以选择去那里，或者不去，然后提交一份关于你发现的东西的报告，或者没有。(您可以每天免费生成10组坐标，付费生成更多。)。这款应用的徽标恰如其分地是一只猫头鹰，因为猫头鹰在黑暗中看得见；宇航员看到的是其他人看不到的东西。尤其是，他们看到的是其他人看不到的东西。\nRandonautica于2月份推出，在App Store上的评论褒贬不一，因为它经常崩溃。此外，居住在水体附近的人往往会得到落入水下的坐标，这可能会令人沮丧。(您必须为排除它们的特权付费。)。它是由德克萨斯人约书亚·伦菲尔德(Joshua Lengfield)创建的，他曾是马戏团表演者，他告诉我，这款应用曾把他带到树林中一个废弃的鼓旁，在那里他差点踩到一条“鲜红的响尾蛇”。“我甚至不知道德克萨斯州有红色的响尾蛇，”他补充道，这是可以理解的，因为通常情况下没有。(红色响尾蛇通常也是铁锈色，或者只是棕色。)。\n据这款应用的开发者称，Randonautica已经被下载了800万次-自4月初以来已经被下载了600万次。“那真的是我们开始爆炸的时候，”伦费尔德说。“人们被困在自己的房子里，这给了他们一种打破常规的方法。这是为数不多的几项活动之一，你可以在保持社交距离的同时保持安全。“。\n然而，Randonautica的吸引力比“它让我可以在户外消磨时间”更有吸引力。当然，它看起来很简陋，而且并不总是装载。而其背后的科学-人类思维可以影响随机数生成器的想法-并没有太大的意义。但它玩弄了人们倾向于喜欢的概念：我们可以在我们想做的任何时候做一些令人惊叹的事情，如果我们试图倾听，宇宙会和我们交谈，如果我们有一个好的态度和清晰的头脑，这种随机性可以被驯服。\n虽然春季开始的居家订单对Randonautica来说肯定是件大事，但这款应用在6月下旬真的失败了。就在那时，一群青少年在TikTok上发布了一张TikTok，照片中Randonautica引导他们找到了一个被遗弃的手提箱，里面似乎装着一具身体。(西雅图警方后来宣布，里面有两个。)。这一事件得到了零星的新闻报道，包括一篇关于此次裁员的解说员文章。更重要的是，它激励了数百名TikTok用户开始记录-或上演-他们自己令人震惊的Randonautica冒险，通常是根据恐怖电影的配乐。\n“我们正处在游戏、科学和艺术之间的某个地方，”这款应用程序完全离奇的常见问题页面上写道。FAQ长达数千字，回答了诸如“这是否违背我的宗教信仰？”之类的问题。还有“我很害怕…。会有什么不好的事情发生吗？“。(答案基本上是：可能和可能。)。\n“当你把数百万人送到随机的地方，搜索现实中隐藏的角落时，有时你肯定会发现一些相当令人震惊的东西，”朗费尔德在回应这段身体视频时说。他指出，在精灵宝可梦Go狂热期间，人们经常偶然发现人类的遗骸。“这不是最好的媒体，但我并不真的为此感到不安，因为这有点酷。我有点希望是我发现的。“。\n因为那段视频，我决定试一试这款应用。来自温哥华的32岁真罪粉丝詹妮弗·科斯特洛(Jennifer Costello)也是如此，她幸运地找到了一个塑料袋，里面装满了数百张发霉面包的照片，这是她在一场暴雨中在树林里发现的。根据混合在一起的几张毕业照，她能够识别出照片来自哪里-附近的城市阿伯斯福德。她告诉我，还有一张蘑菇农场的照片，但阿伯斯福德有很多蘑菇农场，所以她无法进一步缩小搜索范围。她说，尽管如此，她还是对自己的“令人毛骨悚然的宝藏”心存感激，并计划在每次打开应用程序时停止崩溃后，再次进行漫游。\n其他宇航员在Reddit、Twitter、YouTube和TikTok上报告了他们的冒险经历，看到了很多值得记录的东西。真的，没有一个景点是这么奇怪的。也就是说，直到它被断章取义，呈现为一个以某种方式与宇宙合谋的设备的发现：一个覆盖着便利贴网格的窗户。中午，一只郊狼站在墓地里。骨头，蛇，厕所。还有一只羊，沙漠里的书架，彩虹灯下的洗车场。\n在朗费尔德推出他的应用程序之前，Randonauting社区(以及术语Randonauting)就已经存在了，过去随机坐标的生成通常是在即时通讯应用Telegram中的自定义机器人的帮助下进行的。(朗费尔德是制造这款机器人的团队的一员。)。Randonauts subreddit创建于2019年3月，目前拥有超过11.4万名会员。在那里，故事是令人难以置信的健康的-通常集中在拯救受伤的动物或偶然发现有意义的地点，让用户想起亲人或他们的沙拉日子。TikTok的宇航员们想看怪异的东西，想抓外星人。他们倾向于擅自闯入，其中许多人拍摄无人居住的人，有时称他们为“令人毛骨悚然”-这两种说法都不符合漫游的“9条信条”。\n尽管如此，主流的关注还是受到了欢迎。目前拥有2万多粉丝的官方随行者推特账号最近声称，随着越来越多的人开始相信思维影响机器的可能性，世界正在接近一种“范式转变，非凡的事情将变得平凡”。\nRandonautica的基本前提-你的大脑可以影响随机数发生器-来自于1979年开始在普林斯顿进行的有争议的研究。在那里，已故工程师罗伯特·G·扬(Robert G.Jahn)花了几十年的时间探索这个备受嘲笑的假设，即人们可以利用“微精神动力”以非常小的方式影响机器。这一理论--通常被其他科学家驳斥--在Randonautica官方网站上被引用，并被推断为一个人可以专注于任何一种特定的感觉或名词，然后被引导到以某种方式与之对应的坐标。多年来一直担任扬实验室经理的布伦达·邓恩(Brenda Dunne)在一封电子邮件中告诉我，在她看来，这似乎是可能的：“我预测，Randonautica应用程序产生的结果只会偶尔显示出有意义的相关性，但频率可能比预期的要高。”尽管如此，她补充说，这款应用程序有一个“心理方面”，可以让用户注意到巧合和神秘。\n在我的漫游冒险过程中，我请斯坦福大学统计学教授布拉德·埃夫隆(Brad Efron)向我解释随机性。“随机性比人类可以想象的更具随机性，”他说，进一步迷惑了我，并证明了他自己的观点。“你看到了一些非常不可能的事情，这真的很容易欺骗你自己。”事实上，奇怪的动物、身体和放错地方的发霉面包的照片和其他很多东西一样常见。\n尽管如此，我听到的最具说服力的故事来自住在华盛顿州斯波坎的23岁的泰勒·迪克森(Taylor Dickerson)，对我来说，这听起来相当不可能-但却是真的。\n迪克森第一次涉足宇航员，把她和一位朋友带到了树林里，她说他们在那里偶然发现了一封保存完好的信，信写在一张笔记本纸上。它看起来像是一封友谊的信，开头是，“我写这封信是为了告诉你，你真的是多么令人惊叹，…。我亲切地认为你很棒！“。签名的是一名男子，她在谷歌上搜索后发现他几周前就死了。在Facebook上，迪克森和她的朋友表示，他们找到了这封信的收件人，并安排将信带给她。\n迪克森告诉我：“有时我想知道我们周围是否有标志和信息，但我们就是无视它们。”当她发现这封信时，斯波坎已经下了几天的雨，显然没有动过。“我至少读了20遍。我在想，在一个不同的现实中，这张纸条会变成糊状。就好像我们注定要找到它一样。“。\n当然，怪事时有发生。信被丢在树林里。信件是由20多岁的年轻人找到的，他们出去寻找一种奇怪的经历。写信的人以意想不到的方式死去，对其他甚至不认识他们的人来说，他们成了神话中的人物。“最令人惊讶的巧合是没有巧合，”坦普尔大学(Temple University)数学教授J·A·保罗(J.A.Paulos)在听了一篇关于漫游文化的总结后告诉我。“有很多方法可以将你感兴趣的东西--你期望的，你害怕的--与你最终的归宿联系起来。”\n我现在几乎每天都使用Randonautica，努力在布鲁克林进行更多令人惊讶的餐后散步。(我没有找到更多的尿液瓶子。)。我确实意识到，我可能一直都在外出，而且我需要一个虚假软件的激励来让我经常考虑这样做，这可以说是不酷的。但现在我更喜欢这款应用了，因为我知道了它的工作原理。它提醒我，揭开世界的神秘面纱有时会让它变得更加壮观。\n我们想听听您对这篇文章的看法。向编辑提交一封信，或写信给letters@theatlantic.com。", "note_en": "It took me a week to find a plastic water bottle full of what could only be pee.\n That was after the abandoned house taped off with   warnings, but before I spun around on an unfamiliar block deep in Brooklyn to see three dalmatians wiggling toward me. When I saw the bottle lying in the middle of the sidewalk, it felt like a rite of passage.\n  This is my summer activity: walking around, or “randonauting” in internet parlance. Water bottles full of pee are known as “ piss bottles” in the randonaut community, an inside joke that has inspired  T-shirts. It’s pretty simple, as jokes go: If you spend enough time exploring the world at random, you will stumble upon a bottle full of pee.\n  Randonauting is also simple. You can do it using the free app Randonautica, which asks you for your location, prompts you to select one of a handful of different “entropy” generators—which one you choose should not really matter—and then asks you to focus your mind on your “intent.” Then it spits out a set of coordinates that  could, allegedly, be influenced by your mind interacting with the machine, or not, and you can choose to go there, or not, and submit a report of what you find, or not. (You can generate 10 sets of coordinates a day for free and pay to generate more.) The app’s logo, fittingly, is an owl, because owls see in the dark; randonauts see what other people don’t. In particular, they see what they otherwise wouldn’t.\n    Randonautica launched in February and has mixed reviews on the App Store, because it often crashes. Additionally, people who live near bodies of water tend to get coordinates that fall underwater, which can be frustrating. (You have to pay for the privilege of excluding them.) It was created by Joshua Lengfelder, a Texan and former circus performer who told me that the app once took him to an abandoned drum in the middle of the woods, where he nearly stepped on a “bright-red rattlesnake.” “I didn’t even know there were red rattlesnakes in Texas,” he added, understandably, because there typically are not. ( Red rattlesnakes are also usually a rust color, or just brown.)\n   According to the app’s developers, Randonautica has been downloaded 8 million times—6 million since the beginning of April. “That’s really when we started blowing up,” Lengfelder said. “People were trapped in their houses and it gave them a way to break out of their normal routine. It’s one of the few activities you can do while social distancing but still stay safe.”\n  The allure of Randonautica is bigger than “It allows me to be outdoors and kill time,” however. It is janky-looking, sure, and does not always load. And the science behind it—the idea that human thoughts can influence random-number generators—does not make a lot of sense. But it plays with concepts that people tend to love: that we can do something amazing whenever we feel like it, that the universe will talk to us if we try to listen, and that randomness can be tamed if we have a good attitude and a clear mind.\n  Though the start of stay-at-home orders in the spring was certainly big for Randonautica, the app  really blew up in late June. That’s when a group of teenagers posted  a TikTok in which Randonautica led them to an abandoned suitcase that seemed to contain a dead body. (Seattle police later announced that it contained  two.) The incident received a smattering of news coverage, including an  explainer article on  The Cut. More important, it inspired hundreds of TikTok users to start documenting—or staging—their own alarming Randonautica adventures, typically set to music from the soundtracks of scary movies.\n  “We are somewhere in the middle between a game, science, and art,” the app’s utterly bizarre  FAQ page reads. The FAQ is thousands of words long and answers questions such as “Does it go against my religion?” and “I’m scared … will anything bad happen?” (Answers, basically: Maybe and maybe.)\n  “When you’re sending millions of people to random locations and searching the hidden corners of reality, you’re bound to find some pretty shocking stuff sometimes,” Lengfelder said in response to the dead-body video, pointing out that people  frequently stumbled upon human remains during the Pokémon Go craze. “It’s not the best press, but I’m not really that upset about it, because it’s kind of cool. I kind of wish it was me who found it.”\n    I decided to try the app because of that video. As did Jennifer Costello, a 32-year-old true-crime fan from Vancouver, who was the lucky finder of  a plastic bag full of hundreds of photos of moldy bread, which she uncovered in the woods during a rainstorm. She was able to identify where the photos came from—the nearby city of Abbotsford—based on a handful of graduation photos that were mixed in. There were also photos of a mushroom farm, but there are a lot of mushroom farms in Abbotsford, she told me, so she was unable to narrow her search any further. Still, she is grateful for her “creepy treasure,” she said, and plans to go randonauting again when the app stops crashing every time she opens it.\n  Other randonauts, reporting their adventures on Reddit, Twitter, YouTube, and TikTok, have seen plenty worth documenting. None of the sights is so strange, really. That is, until it’s cut out of context, presented as the finding of a device that is somehow in cahoots with the universe: a  window covered with a grid of Post-it Notes. A  coyote standing in a cemetery at noon.  Bones,  snakes,  toilets. But also  a sheep, a  bookshelf in the desert, a  car wash with rainbow lights.\n The randonauting community (and the term  randonauting) existed before Lengfelder launched his app, and the generation of random coordinates used to take place with the help of a custom bot in the messaging app Telegram. (Lengfelder was part of the group that built that bot.) The randonauts  subreddit was created in March 2019, and currently has more than 114,000 members. There, stories are incredibly wholesome—usually focused on rescuing injured animals or stumbling across meaningful locations that remind users of loved ones or their salad days. It’s the TikTok randonauts who want to see spooky stuff and catch aliens. They tend to trespass and many of them film unhoused people, sometimes calling them “creepy”—neither of which is in line with the “ 9 Tenets” of randonauting.\n  Still, the mainstream attention has been welcomed. The official randonauts Twitter account, which currently has more than 20,000 followers,  recently claimed that the world is approaching a “paradigm shift, where the extraordinary will become ordinary,” as more and more people begin to believe in the possibility of minds influencing machines.\n  The basic premise of Randonautica—that your brain can influence a random-number generator—comes from controversial research conducted at Princeton beginning in 1979. There, the late engineer Robert G. Jahn spent decades exploring the  largely derided hypothesis that people could use “micro-psychokinesis” to affect machines in very small ways. This theory—which has  generally been dismissed by other scientists—is  cited on the official Randonautica website, and extrapolated to suggest that a person can focus on any kind of specific feeling or noun and then be led to coordinates that somehow correspond to it. Brenda Dunne, Jahn’s lab manager for many years, told me in an email that this seemed possible to her: “I would predict that the results produced with the Randonautica app would demonstrate meaningful correlations only occasionally, but more often than might be expected.” Though, she added, the app has a “psychological aspect” that would prime users to notice coincidences and mystery.\n    In the course of my randonauting adventures, I asked the Stanford University statistics professor Brad Efron to explain randomness to me. “Randomness is more random than humans can contemplate,” he said, confusing me further and proving his own point. “It’s really easy to fool yourself that you’ve seen something very improbable.” In fact, strange animals and dead bodies and misplaced photos of moldy bread are as common as plenty of other things.\n  Still, the best randonauting story I heard came from 23-year-old Taylor Dickerson, who lives in Spokane, Washington, and it sounded pretty improbable—but true—to me.\n Dickerson’s first foray into randonauting brought her and a friend into the woods, where she says they came across  a pristinely preserved letter written on a sheet of notebook paper. It appeared to be a friendship letter, beginning, “I am writing this to inform you of how amazing you really are … I graciously think you are swell!” and signed by a man who—upon her Googling—turned out to have died weeks before. On Facebook, Dickerson and her friend say they were able to find the woman the letter was addressed to, and made arrangements to bring it to her.\n  “Sometimes I wonder if there are signs and messages around us but we just ignore them,” Dickerson told me. It had been raining in Spokane for days when she found the letter, apparently untouched. “I’ve read it at least 20 times. I think about how in a different reality, the note would’ve disintegrated into mush. It was like we were meant to find it.”\n Of course, bizarre things happen all the time. Letters get dropped in the woods. Letters get found by 20-somethings who went out searching for a strange experience. People who write letters die in unexpected ways, and become mythological figures to other people who never even knew them. “The most amazing coincidence of all would be the absence of coincidences,” J. A. Paulos, a mathematics professor at Temple University, told me, upon hearing a summary of randonauting culture. “There’s so many ways to connect what you’re interested in—what you expect, what you fear—to where you end up.”\n I use Randonautica almost every day now, in an effort to have more surprising after-dinner walks around Brooklyn. (I haven’t found any more bottles of pee.) I do realize that I could have just been going outside this whole time, and that it is arguably uncool that I need the incentives of a hokey piece of software to make me think regularly about doing so. But I like the app even more now that I know how it purports to work. It reminds me that demystifying the world can sometimes make it more spectacular.\n  We want to hear what you think about this article.  Submit a letter to the editor or write to letters@theatlantic.com.", "posttime": "2020-07-25 09:28:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "下载,程序,beginning,randonautica", "title": "看看Randonautica，这是一款生成用户可以浏览的随机坐标的应用程序，自4月初以来已经被下载了600万次", "title_en": "A look at Randonautica, an app that generates random coordinates that users can explore, and has been downloaded 6M times since the beginning of April", "transed": 1, "url": "https://www.theatlantic.com/technology/archive/2020/07/randonautica-app-tiktok-body-reddit-quantum/614401/?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["下载", "程序", "beginning"]}]