[{"category": "", "categoryclass": "", "imagename": "9d5aff6093710508ad8e6fe9c23f45b3.jpg", "infoid": 1014177, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "A和图沙尔·辛格有几个共同点。他们分别19岁和18岁，住在距离德里几个小时车程的范围内，尽管方向相反。他们碰巧都是达利特人，来自印度庞大的种姓登记册的最底层。他们最近也都出现在新闻中，尽管原因截然不同。\n7月中旬，面带微笑、戴着眼镜的辛格赢得了短暂的名声，他在毕业考试中的五门科目中每一门都获得了100分(满分100分)的完美分数，这是全国最好的成绩。他告诉采访者，他想学习历史，进入印度行政服务部门，这是官僚机构的顶级梯队。相比之下，帕尔在去年的一段走红的视频中穿着粉色衬衫和灰色裤子，视频中来自拥有土地的贾特种姓的两名年轻男子强迫他脱下裤子，然后用粗棍子殴打他。折磨他的人很生气，因为帕尔在一家制造智能手机屏幕的工厂找到了一份工作，拒绝耕种他们的土地，也拒绝照看他们的牛，就像贾特(Jat)控制的村庄里的达利特人世世代代所做的那样。\n70年前，主要由达利特知识分子B.R.Ambedkar撰写的印度宪法宣布，所有公民在法律面前一律平等。它废除了贱民制度，使印度教习俗成为一种应受惩罚的罪行，并责成国家改善社会“弱势群体”的命运。\n达利特人的处境确实有所改善。对他们刻板的、仪式性的回避在很大程度上已经消退了。立法机构、公立学校和政府部门的三代配额制度造就了一个低种姓资产阶级，以至于中产种姓开始游说，并最终赢得了他们自己的“保留”。基于种姓的政党如雨后春笋般涌现，要求政府提供更多帮助，并在许多州赢得了权力。\n考虑到所有这一切，辛格先生的巨大成功应该是平淡无奇的，就像对帕尔先生施加的偶然暴力和仪式羞辱应该是不可想象的一样。然而，年轻学者起居室里安贝德卡的骄傲画像揭示了辛格的种姓，这一点受到了广泛的评论。辛格的不同寻常之处还在于，他曾就读于一所顶尖的私立学校。他的父母是大学老师。\n帕尔先生的运气则不同。幸运的是，他和许多达利特人一样，找到了逃避以前对他们开放的唯一工作的方法，比如分享作物、清除废物和晒黑，不再需要更高种姓的赞助人。他也很幸运能活着。很少有印度教徒再遵守严格的仪式纯洁，或者认为达利特人是字面上的“贱民”。即便如此，更高种姓的新闻故事仍以令人沮丧的规律性讲述着更高种姓的人残害、强奸或谋杀达利特人，因为他们敢于炫耀胡子，骑马，或者最糟糕的是，向地位更高的人示好。\n持续存在的歧视并不局限于印度教徒。据估计，印度2000万天主教徒中有65%是前达利特人，他们的祖先皈依部分是为了逃避种姓压迫。然而，根据印度教会最新公布的记录，在27000名牧师中，只有5%是达利特人，六名红衣主教和30名大主教中没有一人是达利特人。在印度14%的穆斯林少数民族中，一种类似的不言而喻的区别依然存在，将过去皈依或与统治穆斯林王朝有关的家庭与更大规模的被认为已经皈依了穆斯林王朝的家庭区分开来，以此来抹去他们之前想必是卑微的种姓地位。\n尽管保留地确保了一些人的高薪职位，但低种姓的提升一直是有限的。从1990年到2010年的加速经济增长使数千万人摆脱了贫困，其中包括许多低种姓的人，但总体上贫富之间的不平等，包括种姓群体内部的不平等，已经加剧。此外，在政府和私营部门一样，最高职位仍然近乎垄断了更广泛的种姓金字塔的三个最高等级或变种：婆罗门或祭司阶层，克沙特里亚或武士阶层，以及瓦伊什亚或商人阶层，这三个阶层加起来约占印度13亿人口的20%。不只是2.2亿达利特人，或1.9亿穆斯林，或来自“预定部落”的1.1亿人代表不足，还有40-50%的印度教徒来自金字塔最宽的一层，舒德拉或劳动种姓，也就是我们所知的其他落后阶层。\n根据最近的一项调查，在中央政府中排名最高的89名公务员中，只有4名不是高种姓的印度教徒，没有一名是印度教徒。在最高法院的31名法官中，三分之二的法官和超过一半的州长都是高种姓的印度教徒。当内政部最近组成一个小组修改刑法时，它的五名专家都是男性，都来自印度北部，都来自上层种姓。在政府之外，这一趋势也同样严峻。去年发表的一项针对主流印地语和英语媒体的研究显示，在编辑等高级职位的121人中，除了15人之外，所有人都是上层种姓。没有一个是达利特人。\n正如积极的歧视应该使工作场所平等一样，人们希望人口结构的变化，如从农村迁移到城市，将打破种姓僵化。乐观主义者指出，由于多种姓的人往往受到环境的限制，不得不共享同一城市的病房，因此混合程度更高。然而，顽固的是，统计数据显示，种姓之间的通婚仍然很少见：根据最近的统计，仅占所有夫妇的6%。\n哈佛大学纳文·巴拉蒂(Naveen Bharathi)领导的一个研究小组对住房进行了分析，结果显示出了惊人的持久性，在某些情况下，种姓隔离加剧了。Bharathi的团队利用147个城市的街区而不是区级的人口普查数据，不仅考虑了广泛的种姓类别，还考虑了贾蒂，也就是说，5000多个倾向于彼此联姻的亚种姓“社区”，发现印度城市的种姓隔离与美国城市的种族隔离相当。在古吉拉特邦最大的城市艾哈迈达巴德，60%的街区没有一个达利特人居住，而大约80%的达利特人只住在城市的10%。以基尼系数衡量的艾哈迈达巴德的不平等比约翰内斯堡更极端，约翰内斯堡是南非最不平等的城市，也是世界上最不平等的国家。\n然而，在看似停滞不前的情况下，巴拉蒂也发现了大量的流失。“城市中的壁垒正在被打破，但这不是种姓之间的大壁垒，”他说。“正在解散的是亚种姓。”由于姓氏与传统职业的联系，在农村唤起了一些记忆，在城市里变得越来越没有意义，在同一更广泛的种姓中，与相邻的贾提人结婚的禁忌更少了。同时，Bharathi先生说，阶级差异正在变得更加强烈。“如果你放大达利特贫民窟，你会发现贫穷的达利特人不会和住在隔壁的地位稍高的达利特人混在一起。”安贝德卡尔认为他在宪法中规定的积极歧视将结束数千年的种姓压迫，他会感到困惑。。\n这篇文章发表在印刷版的亚洲版块，标题为“不能逃脱”。", "note_en": "A  and Tushar Singh have a few things in common. They are 19 and 18 years old respectively and live within a couple of hours’ drive of Delhi, albeit in opposite directions. They both happen to be Dalits, from the bottom ranks of India’s voluminous caste register. And they have also both been in the news lately, though for very different reasons.\n In mid-July the smiling, bespectacled Mr Singh won brief fame by scoring a flawless 100 out of 100 in each of five subjects in school-leaving exams—the best marks in the country. He wants to study history, he told interviewers, and enter the Indian Administrative Service, the top echelon of the bureaucracy. Mr Pal, in contrast, appeared wearing a pink shirt and grey trousers in a viral video last year in which two young men from the landowning Jat caste force him to pull down his trousers and then beat him with a heavy stick. His tormentors were angry because Mr Pal, having found a job in a factory making smartphone screens, refused to work their land or look after their cows, as Dalits in the Jat-dominated village have done for generations.\n  Seventy years ago, India’s constitution, largely written by B.R. Ambedkar, a Dalit intellectual, declared all citizens equal before the law. It abolished untouchability, making the Hindu practice a punishable offence, and enjoined the state to improve the lot of the “weaker sections” of society.\n Dalits’ circumstances have indeed improved. The rigid, ritual shunning of them has largely faded. Three generations of quotas in legislative bodies, in state schools and in government service have created a lower-caste bourgeoisie, such that mid-ranked castes began lobbying for, and eventually won their own “reservations”. Caste-based parties have sprung up to agitate for more government help, and won power in many states.\n Given all this, the stellar success of Mr Singh ought to be unremarkable, just as the casual violence and ritual humiliation inflicted on Mr Pal ought to be unthinkable. Yet Mr Singh’s caste, revealed by the proud portrait of Ambedkar in the young scholar’s living room, was widely remarked upon. Mr Singh is also unusual in that he attended a top private school. His parents are college teachers.\n Mr Pal’s luck is of a different kind. It is lucky that he, like many Dalits who have found ways to escape the only jobs previously open to them, such as share-cropping, waste removal and tanning, no longer needs higher-caste patrons. He is also lucky to be alive. Few Hindus any longer observe strict ritual purity or consider Dalits literally “untouchable”. Even so, with dismal regularity news stories tell of higher-caste people maiming, raping or murdering Dalits for such slights as daring to sport a moustache, ride a horse or, worst of all, woo someone above their station.\n  The persistence of discrimination is not limited to Hindus. An estimated 65% of India’s 20m Catholics are former Dalits whose forebears converted in part to escape caste oppression. Yet according to the Indian church’s most recent published record, out of 27,000 priests only 5% were of Dalit origin, and not a single one of its six cardinals and 30 archbishops. Among India’s 14% Muslim minority a similar unspoken distinction persists, separating families that converted in the distant past, or were associated with ruling Muslim dynasties, from the larger mass imputed to have converted as a way of erasing their previous, presumably lowly, caste status.\n And although reservations have secured plum posts for some, lower-caste uplift has been limited. Accelerated economic growth from 1990 to 2010 pulled tens of millions out of poverty, including many of lower caste, but overall inequality between rich and poor, including within caste groups, has grown. Moreover, in the government as in the private sector, the highest positions remain a near-monopoly for the three top tiers or  varnas of the broader caste pyramid: the brahmins or priestly class, the  kshatriyas or warrior class and the  vaishyas or merchant class, who between them account for perhaps 20% of India’s 1.3bn people. It is not just the 220m Dalits, or the 190m Muslims, or the 110m from “scheduled tribes” who are under-represented, but also the 40-50% of Hindus who come from the widest tier of the pyramid, the  shudras or labouring castes, known as Other Backwards Classes ( s).\n Out of the 89 highest-ranked civil servants in the central government, according to a recent survey, just four are not upper-caste Hindus, and not one is an  . Two-thirds of the Supreme Court’s 31 judges and more than half of all state governors are high-caste Hindus. When the home ministry recently formed a panel to revise the criminal code, its five experts were all men, all from north India and all from upper castes. The trend is just as stark outside of government. A study published last year of the mainstream Hindi and English press revealed that out of 121 people in senior jobs, such as editors, all but 15 were upper caste. Not a single one was a Dalit.\n Just as positive discrimination was supposed to equalise workplaces, it was hoped that demographic change, such as migration from villages to cities, would break down caste rigidities. Optimists pointed to greater mixing as people of multiple castes were often obliged by circumstance to share the same city wards. Stubbornly, however, statistics have shown that intermarriage between castes remains rare: just 6% of all couples at the most recent count.\n An analysis of housing by a team led by Naveen Bharathi of Harvard University has revealed a striking persistence and, in some cases, an intensification of caste segregation. Using census data for 147 cities at the level of blocks rather than wards, and accounting not just for broad caste categories but for  jati, which is to say the 5,000-odd subcaste “communities” that tend to marry among themselves, Mr Bharathi’s team found that segregation by caste in Indian cities is comparable to that by race in American ones. Whereas 60% of blocks in Ahmedabad, the biggest city in Gujarat, housed not a single Dalit, some 80% of Dalits lived in just 10% of the city. Inequality in Ahmedabad as measured by the Gini coefficient was more extreme than in Johannesburg, the most unequal city in South Africa, the world’s most unequal country.\n Yet amid seeming stasis, Mr Bharathi also found a great deal of churn. “Barriers are breaking in cities, but it’s not the big barriers between castes,” he says. “It is the subcastes that are dissolving.” As the association of family names with traditional professions, which evoked some memories in villages, makes ever less sense in cities, there is less of a taboo around marrying into adjacent  jatis within the same broader caste. At the same time, says Mr Bharathi, class differences are growing stronger. “If you zoom in on a Dalit slum, you will find that poorer Dalits don’t intermix with Dalits of slightly higher status living right next door.” Ambedkar, who assumed that the positive discrimination he prescribed in the constitution would end millennia of caste oppression, would be perplexed.  ■\n This article appeared in the Asia section of the print edition under the headline &#34;No escape&#34;", "posttime": "2020-07-26 02:57:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "caste,种姓", "title": "印度没有逃避种姓的机会", "title_en": "No Escape from Caste in India", "transed": 1, "url": "https://www.economist.com/asia/2020/07/23/even-as-india-urbanises-caste-discrimination-remains-rife", "via": "", "real_tags": ["caste", "种姓"]}, {"category": "", "categoryclass": "", "imagename": "c218c0e5e0a95c4622180b99ef4c917a.jpeg", "infoid": 1014175, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我的名字是奥兹曼迪亚斯·奥兹曼迪亚斯法老拉美西斯二世(公元前1279-1213年在位)。根据“牛津英语词典”的记载，这座雕像曾有57英尺高，也就是“王者之王”；", "note_en": "My name is  Ozymandias  Ozymandias Pharaoh Rameses II (reigned 1279-1213 BCE). According to the  OED, the statue was once 57 feet tall., King of Kings;", "posttime": "2020-07-26 02:57:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "奥兹,ozymandias,英语词典", "title": "奥兹", "title_en": "Ozymandias", "transed": 1, "url": "https://www.poetryfoundation.org/poems/46565/ozymandias", "via": "", "real_tags": ["奥兹", "英语词典"]}, {"category": "", "categoryclass": "", "imagename": "f0a2861ce62cf055e776a3cd93adfdec.jpg", "infoid": 1014174, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "《泰晤士报》透露，政府官员讨论了爱尔兰的六个地点，作为一位香港富商提议的名为Nextpolis的新自治城市的可能选址。\n自去年12月以来，英国外交部一直在与国际特许城市投资公司维多利亚港集团(VHG)就一项从无到有创建一个将成为数万香港居民家园的城市的计划进行接触。\n根据信息自由法公布的文件显示，近几个月来，爱尔兰和香港就为新城市寻找500平方公里土地举行了一系列会议。", "note_en": "Six locations in Ireland were discussed by government officials as possible sites for a new autonomous city named Nextpolis proposed by a wealthy Hong Kong businessman,  The Times can reveal.\n The Department of Foreign Affairs has been in contact with the Victoria Harbour Group (VHG), an international charter city investment company, since December about a plan to create a city from scratch that would be home to tens of thousands of Hong Kong residents.\n Documents released under freedom of information laws show that a series of meetings have taken place in Ireland and Hong Kong in recent months about sourcing a 500 sq km area of land for the new city.", "posttime": "2020-07-26 02:56:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "官员,kong,城市", "title": "香港：官员讨论爱尔兰自治城市的六个选址", "title_en": "Hong Kong: Officials discussed six sites for autonomous city in Ireland", "transed": 1, "url": "https://www.thetimes.co.uk/article/hong-kong-security-law-officials-discussed-six-sites-for-autonomous-city-in-ireland-5566xs8jl", "via": "", "real_tags": ["官员", "kong", "城市"]}, {"category": "", "categoryclass": "", "imagename": "77e7479233d1d16d26dfe9a9a1704eaa.jpg", "infoid": 1014173, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软创始人比尔·盖茨回应了网上关于他和新冠肺炎流行病的许多阴谋论和广为流传的谣言。", "note_en": "Microsoft founder Bill Gates responds to the many conspiracy theories and widespread falsehoods online about him and the Covid-19 pandemic.", "posttime": "2020-07-26 02:35:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "阴谋,gates,肺炎", "title": "比尔·盖茨给阴谋论者一个信息", "title_en": "Bill Gates Has a Message For Conspiracy Theorists", "transed": 1, "url": "https://www.cnn.com/videos/business/2020/07/24/bill-gates-conspiracy-theories-coronavirus-covid-19-social-media-town-hall-vpx.cnnbusiness", "via": "", "real_tags": ["阴谋", "gates", "肺炎"]}, {"category": "", "categoryclass": "", "imagename": "00ed27f191705a43f3caa3958dc306b9.jpeg", "infoid": 1014171, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1978年推出的革命性的Intel8086微处理器导致了今天大多数台式机和服务器计算中使用的x86处理器。正如你所预期的那样，这种芯片是由数字电路构建的。但它也有模拟电路：电荷泵，它可以将8086的5伏电源转换为负电压，以提高性能。1I&#39；一直在逆向工程的8086芯片的照片，在这篇文章中，我讨论了这些电荷泵的结构和它们是如何工作的。\n8086微处理器的模具照片。算术逻辑单元和寄存器在左侧。微码ROM在右下角。单击以获取高分辨率图像。\n上面这张照片显示的是显微镜下8086处理器的微型硅晶片。芯片顶部的金属层是可见的，下面隐藏着硅。在芯片的外缘周围，将芯片上的焊盘连接到芯片的40个外部引脚上。然而，仔细检查发现，芯片上有42个焊盘，而不是40个。为什么多了两个呢？\n集成电路从硅衬底开始，晶体管建立在硅衬底上。对于高性能集成电路，在衬底上施加负偏置电压是有益的。2为了获得这种衬底偏置电压，在20世纪70年代，许多芯片都有一个外部引脚连接到-5V，3但是这个额外的电源对使用这些芯片的工程师来说并不方便。然而，到了70年代末，片上电荷泵电路被设计成内部产生负电压。这些芯片使用一个方便的+5V电源，让工程师们更高兴。\n8086芯片的特写，显示硅芯片和将其连接到引线框架的焊接线。\n在8086芯片上，两个额外的焊盘将负偏置电压馈送到基板。上图显示的是芯片中安装的硅芯片，焊线连接到形成引脚的引线框架。仔细观察，芯片上下有两个灰色的小方块；每个都连接到一个额外的焊盘。8086芯片上的电荷泵产生负电压，该电压通过焊线传递到这些正方形，然后通过下面的金属板到达8086晶片。8086芯片上的电荷泵产生负电压，该负电压通过焊线传递到这些正方形，然后通过下面的金属板连接到8086芯片上的引线框架。8086芯片上的电荷泵产生负电压，该电压通过焊线传递到这些正方形，然后通过下面的金属板到达8086芯片。\n下面的照片突出显示了8086中的两个电荷泵。我将讨论顶部的电荷泵；底部的电荷泵具有相同的电路，但布局不同，以适应可用的空间。每个电荷泵都有驱动电路、一个大电容和一个焊盘，焊线连接到基板上。每个电荷泵都位于8086的两个接地焊盘中的一个旁边，想必是为了将电气噪音降到最低。\n你可能想知道电荷泵是如何把正电压变成负电压的。诀窍是一个飞翔的电容器，如下所示。在左边，电容器充电到5伏。现在，断开电容器并将正端连接到地。电容器仍有5伏充电，所以现在低端必须是-5伏。通过在两种状态之间快速切换电容器，电荷泵产生负电压。\n在左边，飞行电容器充电到5伏。通过将地切换到上端，电容器现在输出-5伏。(来源)。\n8086和8086的电荷泵电路使用MOSFET晶体管和二极管在两种状态之间切换电容器，由振荡器控制晶体管，如下图所示。环形振荡器由三个逆变器组成一个环路(或环)连接。由于逆变器的数量是奇数，系统不稳定，会振荡。5例如，如果第一个逆变器的输入为0，则其输出将为1，第二个输出将为0，第三个输出将为1。这将翻转第一个逆变器，翻转将通过引起振荡的环路。为了降低振荡速率，在环中插入了两个电阻-电容网络。由于电容器需要一些时间来充电和放电，因此振荡将会减慢，从而使电荷泵有时间运行。4.。\nIntel 8086中用于提供负衬底偏置的电荷泵原理图。\n环形振荡器的输出被馈送到驱动电容器的晶体管。在第一步中，打开上部晶体管，使电容器通过第一个二极管充电到相对于地的5伏。第二步是魔术发生的地方。较低的晶体管接通，将电容器的高端连接到地。由于电容器仍然充电到5伏，电容器的低端现在必须是-5伏，从而产生所需的负电压。当振荡器再次翻转时，上部晶体管接通，循环重复。电荷泵得名，因为它将电荷从输出端泵送到地。6二极管类似于水泵中的止回阀，以确保电荷沿正确方向移动。\n下面的照片显示了电荷泵在芯片上的实现。在这张照片中，可以看到顶部的金属布线，下面是微红色的多晶硅，底部是米色的硅。主要电容器在中央可见，H形线将其连接到左侧的电路。(电容器的一部分隐藏在顶部宽广的金属电源线下面。)在右侧，衬底键合线连接到焊盘。测试图案在焊盘下方；每个掩模都有一个正方形。\n去掉金属层，下面更清楚地显示了电路。大的电荷泵电容器占据了照片的右半部分。虽然是微观的，但这个电容器按照芯片标准是很大的，大约16位寄存器的大小。电容器是由硅区上的多晶硅组成的，由绝缘氧化物隔开；多晶硅和硅形成电容器的极板。左边是较小的电容器和为振荡器提供R-C延迟的电阻器。下面是振荡器电路和驱动晶体管。7个。\n8086电荷泵，显示关键部件。为了显示下面的硅和多晶硅，这张照片中的金属已经被移走了。\n电荷泵的一个有趣的特点是两个二极管，每个二极管由8个晶体管组成，形成规则的图案。下图显示了晶体管的结构。硅的区域被掺入杂质以产生具有所需特性的扩散区域。晶体管可以被看作是一个开关，允许电流在称为源极和漏极的两个扩散区域之间流动。晶体管由栅极控制，栅极由一种称为多晶硅的特殊类型的硅制成。栅极上的高电压允许电流在源极和漏极之间流动，而低电压阻止电流流动。这些微小的晶体管可以组合成逻辑门、微处理器的组件和其他数字芯片。但在这种情况下，晶体管被用作二极管。\n下面的照片显示了电荷泵中的一个晶体管，从上面看。如图所示，多晶硅形成了两侧硅扩散区之间的栅极。通过照片底部的硅/多晶硅连接将栅极和漏极连接在一起(详细信息)，可以由MOSFET形成二极管。硅也可以通过通孔连接到金属层。在这张照片中，金属层被移除，但模糊的圆圈表示硅/金属通孔的位置。\n电荷泵电路中的晶体管。多晶硅栅极在两边分隔晶体管的源极和漏极。\n下图显示了两个二极管是如何由16个晶体管实现的。为了支持电荷泵的相对高电流，每个二极管并联使用了8个晶体管。请注意，相邻的晶体管共享源极或漏极区域，允许晶体管密集封装。蓝线表示金属线；在此照片中移除了金属。黑圈表示金属和硅之间的连接(通孔)。\n电荷泵有两个二极管，每个用8个晶体管实现。源极、栅极和漏极用S、G和D表示。\n把所有这些放在一起，上面的八个晶体管的源极通过一根金属线连接到地面。它们的栅极和漏极通过晶体管下面的多晶硅连接在一起，使它们成为二极管，它们通过金属线连接到电容器。下面的8个晶体管形成第二个二极管；它们的栅极和漏极通过下面的金属线环路连接在一起。请注意布局是如何优化的；例如，栅极具有弯曲的形状，以避免通孔(黑点)。\n8086芯片9上的衬底偏置发生器是数字电路(由反相器形成的环形振荡器)和模拟电荷泵的有趣组合。虽然偏置发生器似乎是20世纪70年代计算机历史上鲜为人知的一部分，但偏置产生仍然是现代集成电路的一部分。在现代芯片中，它要复杂得多，因为现代芯片在多个电源域具有多个精心调节的偏置。8在某种意义上，它类似于x86体系结构，这种体系结构始于20世纪70年代，今天甚至更加流行，但为了追求更高的性能，它变得难以想象地变得更加复杂。\n如果你对8086感兴趣，我早些时候写过关于8086芯片、它的芯片缩小过程和8086寄存器的文章。我计划在以后的博客文章中更详细地分析8086，所以请在Twitter@kenshiriff或RSS上关注我的更新。\n严格地说，整个芯片都是模拟的：有一句老话说，数字计算机是由模拟部件制成的。这句话出自DEC工程师唐·沃纳达之口，并于1978年发表在DEC的“计算机工程”杂志上。\n在衬底上施加负偏压有几个好处。它减少了寄生电容，使芯片速度更快，使晶体管阈值电压更可预测，并减少了泄漏电流。-↩。\n早期的DRAM存储芯片和微处理器芯片通常需要三个电源：+5V(Vcc)，+12V(Vdd)和-5V(Vbb)。在20世纪70年代末，芯片技术的进步允许使用单一电源。例如，Mostek&#39；的MK4116(1977年的16K比特DRAM)需要三个电压，而改进的MK4516(1981)只使用+5V的电源，简化了硬件设计。的存储芯片遵循类似的路线，2116DRAM(16K，1977)使用3个电压，改进的2118(1979)使用1个电压。同样，著名的Intel8080微处理器(1974)使用增强型晶体管，需要3个电压。改进的8085型(1976)使用耗尽型晶体管，由单+5V电源供电。摩托罗拉6800型微处理器(1974年)对单电源使用不同的方法；虽然6800型是由较旧的增强负载晶体管建造的，但它通过实现片上倍压器(一种增加电压的电荷泵)避免了+12电源。-↩。\n我试着通过观察芯片的电流来测量电荷泵的频率，看看电荷泵引起的波动。我测量了90兆赫的波动，但我怀疑我测量的是噪音，而不是电荷泵的振荡。-↩。\n因为电路有奇数个反相器，所以它会振荡。另一方面，如果它有偶数个逆变器，它将在两个不同的状态下稳定。这种技术用在寄存器中：一对反相器存储每个位(详细信息)。-↩。\n我稍微简化了电荷泵的讨论。由于晶体管的电压下降，衬底电压可能在-3V左右，而不是-5V左右。(如果芯片需要更大的电压下降，可以级联电荷泵级。)对于泵浦方向，i&39；m指的是电流。如果你把它想象成泵浦电子，负电子正被反方向泵入衬底。--↩。\n振荡器由13个晶体管组成。7个晶体管组成3个逆变器(一个逆变器有一个额外的晶体管提供额外的输出电流。6个驱动晶体管由2个晶体管拉高输出和4个晶体管拉低输出组成。布局与正常的逆变器电路有奇怪的不同，可能是因为电流要求不同于正常的数字逻辑。)↩。\n偏置发生器现在以IP块的形式提供，可以获得许可并插入到芯片设计中。有关现代芯片中偏置的更多信息，请参阅主体偏置、多偏压域实现或本演示文稿。甚至还有标准的IEEE1801电源格式，允许IC设计工具生成必要的电路。-↩。\n与8086配套的数学协处理器芯片Intel8087也有一个衬底偏置发生器，它使用相同的原理，但出乎意料地有不同的电路，使用了5个反相器。我在这里写了详细的内容。--↩", "note_en": "Introduced in 1978, the revolutionary Intel 8086 microprocessor led to the x86 processors used in most desktop and server computing today.This chip is built form digital circuits, as you would expect.However, it also has analog circuits: charge pumps that turn the 8086&#39;s 5-volt supply into a negative voltage to improve performance.  1I&#39;ve been reverse-engineering the 8086 from die photos, and in this post I discuss the construction of these charge pumps and how they work.\n Die photo of the 8086 microprocessor. The ALU and registers are on the left. The microcode ROM is in the lower right. Click for a high-resolution image.\n The photo above shows the tiny silicon die of the 8086 processor under a microscope. The metal layer on top of the chip is visible, with the silicon hidden underneath. Around the outside edge, bond wires connectpads on the die to the chip&#39;s 40 external pins.However, careful examination shows that the die has 42 bond pads, not 40. Why are there two extra ones?\n An integrated circuit starts with a silicon substrate, and transistors are built on this.For high-performance integrated circuits, it is beneficial to apply a negative &#34;bias&#34;voltage to the substrate.   2To obtain this substrate bias voltage,many chips in the 1970s had an external pin that was connected to -5V,  3but this additional power supply was inconvenient for the engineers using these chips.By the  end of the 1970s, however,on-chip &#34;charge pump&#34; circuits were designed that generated the negative voltage internally.These chips used a single convenient +5V supply, making engineers happier.\n A closeup of the 8086 chip showing the silicon die and the bond wires connecting it to the lead frame.\n On the 8086 die,the two extra pads feed this negative bias voltage to the substrate.The photo above shows the silicon die as mounted in the chip, with bond wires connected to the lead frame that forms the pins.Looking carefully, there are two small gray squares above and below the die; each connected to one of the &#34;extra&#34; bond pads.The charge pumps on the 8086 die generate a negative voltage, which passes through the bond wires to these squares, and then through the metal plate underneathto the 8086&#39;s substrate.\n  The photo below highlights the two charge pumps in the 8086.I&#39;ll discuss the top one; the bottom one has the same circuitry but a different layout to fit in the available space.Each pump has driver circuitry, a large capacitor, and a pad with the bond wire to the substrate.Each pump is located next to one of the 8086&#39;s two ground pads, presumably to minimize electrical noise.\n  You might wonder how a  charge pump can turn a positive voltage into a negative voltage.The trick is a &#34;flying&#34; capacitor, as shown below.On the left, the capacitor is charged to 5 volts. Now, disconnect the capacitor and connect the positive side to ground.The capacitor still has its 5-volt charge, so now the low side must be at -5 volts.By rapidly switching the capacitor between the two states, the charge pump produces a negative voltage.\n On the left, the &#34;flying capacitor&#39; is charged to 5 volts. By switching ground to the upper terminal, the capacitor now outputs -5 volts. ( source)\n The 8086&#39;s charge pump circuit uses MOSFET transistors and diodes to switch the capacitor between the two states, with an oscillator to control the transistors, as shown in the schematic below.The  ring oscillatorconsists of three inverters connected in a loop (or ring).Because the number of inverters is odd, the system is unstable and will oscillate.  5For instance, if the input to the first inverter is 0, its output will be 1, the second output will be 0, and the third output will be 1.This will flip the first inverter, and the &#34;flip&#34; will travel through the loop causing oscillation.To slow down the oscillation rate, two resistor-capacitor networks are inserted into the ring. Since the capacitors will take some time to charge and discharge, the oscillations will be slowed, giving the charge pump time to operate.  4\n Schematic of the charge pump used in the Intel 8086 to provide negative substrate bias.\n The outputs from the ring oscillator are fed to the transistors that drive the capacitor.In the first step, the upper transistor is switched on, causing the capacitor to charge through the first diode to5 volts with respect to ground.The second step is where the magic happens. The lower transistor turns on, connecting thehigh side of the capacitor to ground. Since the capacitor is still charged to 5 volts, the low side of the capacitor must now be at -5 volts, producing the desired negative voltage. This goes through the second diode and the bond wire to the substrate.When the oscillator flips again, the upper transistor turns on and the cycle repeats.The charge pump gets its name because it pumps charge from the output to ground.  6The diodes are similar to check valves in a  water pump,making sure charge moves in the right direction.\n  The photo below shows the charge pump as it is implemented on the chip.In this photo, the metal wiring is visible on top, with reddish polysilicon underneath and beige silicon at the bottom.The main capacitor is visible in the center, with H-shaped wiring connecting it to the circuitry on the left.(Part of the capacitor is hidden under the wide metal power trace at the top.)On the right, the substrate bond wire is attached to the pad.A test pattern is below the pad; it has a square for each mask used to produce a layer of the chip.\n  Removing the metal layer shows the circuitry more clearly, below.The large charge pump capacitor takes up the right half of the photo.Although microscopic, this capacitor is huge by chip standards, about the size of a 16-bit register.The capacitor consists of polysilicon over a silicon region, separated by insulating oxide;the polysilicon and silicon form the plates of the capacitor.On the left side are the smaller capacitors and the resistors that provide the R-C delay for the oscillator.Below them is the oscillator circuitry and the drive transistors.  7\n An 8086 charge pump, showing the key components. The metal has been removed for this photo, to show the silicon and polysilicon underneath.\n One interesting feature of the charge pump is the two diodes, each built from eight transistors in a regular pattern.The diagram below shows the structure of a transistor.Regions of the silicon are  doped with impurities to create diffusion regions with desired properties. The transistor can be viewed as a switch, allowing current to flow between two diffusion regions called the source and drain.The transistor is controlled by the gate, made of a special type of silicon called polysilicon.A high voltage on the gate lets current flow between the source and drain, while a low voltage blocks current flow.These tiny transistors can be combined to form logic gates, the components of microprocessors and other digital chips.But in this case, the transistors are used as diodes.\n  The photo below shows a transistor in the charge pump, viewed from above. As in the diagram, polysilicon forms the gatebetween the silicon diffusion regions on either side.A diode can be formed from a MOSFET by connecting the gate and drain together ( details)through the silicon/polysilicon connection at the bottom of the photo.The silicon can also be connected to the metal layer through a &#34;via&#34;.The metal layer was removed for this photo, but faint circles indicate the position of silicon/metal vias.\n A transistor in the charge pump circuit. The polysilicon gate separates the transistor&#39;s source and drain on either side.\n The diagram below shows how the two diodes are implemented from 16 transistors.To support the relatively high current of the charge pump, eight transistors are used in parallel for each diode.Note that neighboring transistors share source or drain regions, allowing transistors to be packed densely.The blue lines indicate the metal wires; the metal was removed for this photo. The dark circles indicate connections (vias) between the metal and silicon.\n The charge pump has two diodes, each implemented with 8 transistors. The source, gate, and drain are indicated with S, G, and D.\n Putting this all together, the upper eight transistors have their sources connected to ground by a metal wire. Their gates and drains connected together by the polysiliconbelow the transistors, making them into diodes, and they are connected to the capacitor by a metal wire.The lower eight transistors form a second diode; their gates and drains are wired together by the lower metal wire loop.Note how the layout has been optimized; for example, the gates have bent shapes to avoid the vias (black dots).\n  The substrate bias generator on the 8086 chip  9 is an interesting combination of digital circuitry (a ring oscillator formed from inverters) and an analog charge pump.While the bias generator may seem like an obscure part of 1970s computer history, bias generation is still part of modern integrated circuits.It is much more complex in modern chips which have multiple carefully regulated biases in multiple power domains.  8In a sense it is analogous to the x86 architecture, something that started in the 1970s and is even more popular today, but has become unimaginably more complex in the quest for higher performance.\n If you&#39;re interested in the 8086, I wrote about the  8086 die, its  die shrink process and the  8086 registers earlier.I plan to analyze the 8086 in more detail in future blog posts sofollow me on Twitter  @kenshirriff or  RSS for updates.\n  Strictly speaking, the entire chip is analog: there&#39;s an old saying that &#34;Digital computers are made from analog parts&#34;.This saying came from DEC engineer Don Vonada and was published in DEC&#39;s  Computer Engineering in 1978.\n Putting a negative bias voltage on the substrate had several benefits.It decreased  parasitic capacitance making the chip faster, made the transistor threshold voltage more predictable, and reduced  leakage current.  ↩\n Early DRAM memory chips and microprocessor chips often required three supplies: +5V (Vcc), +12V (Vdd) and -5V (Vbb) bias voltage.In the late 1970s, improvements in chip technology allowed a single supply to be used instead.For example, Mostek&#39;s  MK4116 (a 16 kilobit DRAM from 1977) required three voltages while the improved  MK4516 (1981)operated on a single +5V supply, simplifying hardware designs.(Amusingly,  some  ofthese chips still kept the Vbb and Vcc pins for backward compatibilitybut left them unconnected.)Intel&#39;s memory chips followed a similar path, with the  2116 DRAM (16K, 1977) using three voltages andthe improved 2118(1979) using a single voltage.Similarly, the famous Intel 8080 microprocessor (1974) used enhancement-mode transistors and required three voltages. An improved version, the 8085 (1976), used depletion-mode transistors and was powered by a single +5V supply.The  Motorola 6800 microprocessor (1974) used a different approach for a single supply; although the 6800 was built from the older enhancement-load transistors it avoided the +12 supply by implementing an on-chip  voltage doubler, a charge pump that increased the voltage.  ↩\n I tried to measure the frequency of the charge pump by looking at the chip&#39;s current to see fluctuations due to the charge pump.I measured 90 MHz fluctuations, but I suspect I was measuring noise and not the charge pump&#39;s oscillations.  ↩\n Because the circuit has an odd number of inverters, it oscillates. If, on the other hand, it had an even number of inverters,it would be stable in two different states. This technique is used in the 8086&#39;s registers: a pair of inverters stores each bit ( details).  ↩\n I&#39;ve simplified the charge pump discussion slightly. Due to voltage drops in the transistors, the substrate voltage will probably be around -3V, not -5V.(If a chip requires a larger voltage drop, charge pump stages can be cascaded.)For the pump direction, I&#39;m referring to current flow. If you think of it as pumpingelectrons, the negative electrons are being pumped the opposite direction, into the substrate.  ↩\n The oscillator is built from 13 transistors.Seven transistors form the 3 inverters (one inverter has an extra transistor to provide extra output current.The six drive transistors consist of two transistors pulling the output high and four transistors pulling the output low.The layout is strangely different from normal inverter circuitry, probably because the current requirements are different from normaldigital logic.  ↩\n Bias generators  are  now  available as  IP blocks that can be licensed and be plugged into a chip design.For more information on bias in modern chips, see Body bias,  Multi bias domain implementation, or this presentation.There is even a standard  IEEE 1801 power format that allows IC design tools to generate the necessary circuitry.  ↩\n The Intel 8087, the math coprocessor chip that goes along with the 8086, also has a substrate bias generator.It uses the same principles, but unexpectedly has a different circuit, using 5 inverters. I wrote about it in detail  here.  ↩", "posttime": "2020-07-26 02:34:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "产生,tiny,晶体管", "title": "处理器，微小的电荷泵产生负电压", "title_en": "Processor, tiny charge pumps create a negative voltage", "transed": 1, "url": "http://www.righto.com/2020/07/inside-8086-processor-tiny-charge-pumps.html", "via": "", "real_tags": ["产生", "tiny", "晶体管"]}, {"category": "", "categoryclass": "", "imagename": "f999cacc6bcb82de6ae344079e8c6b6e.jpg", "infoid": 1014170, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国国家篮球协会(NBA)正在使用微软球队的新一起模式，在现场比赛期间将篮球迷置于球场边的虚拟体验中。微软本月早些时候才刚刚为团队推出了一起模式，它使用人工智能来分割你的脸和肩膀，并将你和其他人放在一个虚拟空间中。\nNBA正在使用这种新的微软团队模式，并结合17英尺高的LED屏幕，这些屏幕将环绕在篮球场周围，让球迷回到球员身边。球迷将能够实时做出反应，球员将能够看到和听到这些反应。这些虚拟看台将包括300多名球迷，他们使用Together Mode在微软团队中几乎并排坐在一起。球迷们将能够在球队内部观看比赛的实况转播，同时还可以看到彼此的景色。\n微软365负责人贾里德·斯帕塔罗(Jared Spataro)解释说：“这是NBA和微软合作带来的第一次现场体验，让参与比赛的球迷有一种在现场比赛中坐在一起的感觉，而不会离开舒适和安全的家。”微软365的负责人贾里德·斯帕塔罗(Jared Spataro)解释说。与此同时，球员们将在球场上运球时体验到他们的能量和支持，并看到球迷的实时反应。在家里收看比赛的观众会感受到观众的能量，就像他们看到挤满了球迷的虚拟看台一样。“。\n显然，如果球迷在比赛期间突然变得无赖，那么很可能会出现滥用职权的情况。谢天谢地，NBA将有成员参与通话，并将移除任何行为不当或扰乱体验的参与者。\n广播公司ESPN和特纳体育也在重新定位摄像机，为在家观看的球迷提供新的角度，球场周围的麦克风将捕捉到我们习惯听到的运动鞋尖叫声和球弹跳。除了微软球队的体验外，球迷们还可以使用NBA应用程序虚拟地欢呼。这些虚拟欢呼声将在带有动画的游戏期间出现在视频板上。\nNBA与微软的合作都是两人今年早些时候结成的战略联盟的一部分。微软与NBA签署了一项多年的协议，成为联盟的官方人工智能、云和笔记本电脑提供商。这是这笔交易的第一个大例子，我们还将看到NBA使用微软的Azure平台直播和点播篮球比赛，并提供个性化的内容。\nNBA赛季将于7月30日恢复，此前该赛季在3月份因冠状病毒大流行而中断。微软团队的这种创新使用是世界各地不同运动试图创造虚拟球迷体验的多种方式的一部分。福克斯体育(Fox Sports)也将在周六的美国职业棒球大联盟(Major League Baseball)转播中带来“虚拟球迷”，用CGI球迷和虚假的人群噪音取代空座位。", "note_en": "The National Basketball Association (NBA) is using Microsoft Teams’ new Together Mode to place basketball fans courtside in a virtual experience during live games. Microsoft only just revealed  Together Mode for Teams earlier this month, and it uses AI to segment your face and shoulders and place you together with other people in a virtual space.\n The NBA is using this new Microsoft Teams mode combined with 17-foot tall LED screens that will wrap around basketball arenas to put fans back next to players. Fans will be able to react in real time, and players will be able to see and hear those reactions. These virtual stands will include more than 300 fans using Together Mode to sit side by side with each other virtually in Microsoft Teams. Fans will be able to watch a live feed of the game within Teams alongside a view of each other.\n “This new experience—the first to go live as a result of the NBA / Microsoft partnership — gives participating fans the feeling of sitting next to one another at a live game without leaving the comfort and safety of their homes,” explains Jared Spataro, head of Microsoft 365. “Players, meanwhile, will experience their energy and support as they dribble down the court and see fans’ real-time reaction. And viewers tuning into the game from home will feel the crowd’s energy as well as they see the virtual stands filled with fans.”\n   There’s obviously a lot of potential for abuse if fans suddenly go rogue during the sessions. Thankfully, the NBA will have members participating in the calls and will remove any participants who behave inappropriately or disrupt the experience.\n Broadcasters ESPN and Turner Sports are also repositioning cameras to include new angles for fans watching at home, and microphones around the court will capture the sneaker squeaks and ball bounces we’re used to hearing. Alongside the Microsoft Teams experience, fans will also be able to cheer virtually using the NBA app. These virtual cheers will appear on video boards during games with animations.\n The NBA’s work with Microsoft is all part of a strategic alliance that the pair formed earlier this year.  Microsoft signed a multiyear deal with the NBA to become the official AI, cloud, and laptop provider for the league. This is the first big example of the deal, and we’ll also see the NBA using Microsoft’s Azure platform to broadcast live and on-demand basketball games, with personalized content.\n  The NBA season is set to resume on July 30th, after it went on hiatus in March due to the coronavirus pandemic. This innovative use of Microsoft Teams is part of a number of ways that different sports around the world are trying to create virtual fans experiences. Fox Sports is also bringing “virtual fans”  to its Major League Baseball broadcasts on Saturday, replacing empty seats with CGI fans and fake crowd noises.", "posttime": "2020-07-26 02:33:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,微软,nba", "title": "NBA正在使用微软球队把篮球迷带到球场边", "title_en": "The NBA is using Microsoft Teams to bring basketball fans courtside", "transed": 1, "url": "https://www.theverge.com/2020/7/24/21337326/nba-microsoft-teams-together-mode-basketball-virtual-experience-fans", "via": "", "real_tags": ["microsoft", "微软", "nba"]}, {"category": "", "categoryclass": "", "imagename": "f8555b033038a828e46e6140515e2f02.jpg", "infoid": 1014169, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "去了坏的北方。前育碧。在程序生成方面相当在行。关于谈话产生的立方体瓷砖的互动速度通过混合舒适的城镇…", "note_en": "Made Bad North. Ex-Ubisoft. Pretty good at procedural generation. About the talk Generating cozy towns from cubic tiles at interactive speeds through a mix o...", "posttime": "2020-07-26 02:33:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "城镇,towns,生成", "title": "方形瓷砖中的有机城镇--奥斯卡·施塔尔伯格的演讲", "title_en": "Organic Towns from Square Tiles – A Talk by Oskar Stålberg", "transed": 1, "url": "https://youtu.be/1hqt8JkYRdI?t=273", "via": "", "real_tags": ["城镇", "towns", "生成"]}, {"category": "", "categoryclass": "", "imagename": "e30b6b15160fb3a1a773e0a1b9093269.jpg", "infoid": 1014168, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "简单的创业点子都已经完成了--只需要一些自制的硬件破解或PHP宿舍编码就可以了。如今，你可能需要多个高级技术学位才能完成一些有意义的事情。至少丹尼·克莱顿本周在一篇题为“当今创业公司的两个博士问题”(The Two Phd Problem Of Startups)的文章中冷静地思考了这一点。这里有一个新闻例子：\n以合成生物学和制药的未来为例。有一个广受欢迎且资金充裕的论文是关于将机器学习和生物/医学结合起来，创造下一代制药和临床治疗。数据集就在那里，患者已经准备好购买，与现代算法提供的更深思熟虑和自动化的方法相比，发现治疗疾病的新候选者的旧方法看起来确实很古老。\n然而，即使把针稍微移到这里，也需要对两个非常困难和截然不同的领域有丰富的知识。人工智能和生物是以极快的速度变得极其复杂的领域，也是研究人员和创始人迅速到达知识前沿的领域。无论想象力如何，这些都不是“已解决”的领域，快速得出“没有人真正知道”的问题答案并不少见。\n他认为，即使你试图用正确的知识组合来组建团队，现在每个领域都是如此复杂，所需的技能网络比以前的努力要难得多。\n我在一定程度上不同意，因为创新不会以如此简单的方式映射到现有领域。60年代的计算机科学家在苹果的家庭酿造商证明了这一点之前，并不认为个人计算机会成为一种东西。过去十年，企业软件行业专家并未预期消费者应用开发商会运用他们自下而上的增长技能，击败现有公司提供的复杂产品。我预计，各种神秘的学术思想将以意想不到的方式与市场需求融合在一起，打破我们今天所拥有的模式，领导这些模式的人可能不会勾选传统领域的所有方框。\n这包括博士学位本身和教育行业。这就是丹尼和我意见一致的地方。软件在教育中的应用一直是一场斗争，因为成功需要理解两个学科，他得出的结论是，我们的学习方式本身必须被打破和改革：\n“我们不能等到25年的学校结束，人们在40岁时憔悴地毕业，才能在这些迷人的十字路口尝试一下。”我们需要在创新尚未达到的领域建立滑流。“。\n几乎是为了证明丹尼的第一点，当今教育技术领域一些最大的公司都是由兼任大学教授的技术专家创立的。像Coursera这样的公司今天正在筹集他们的后期融资，这是在流行病推动的在线高等教育繁荣的基础上进行的。\n但这一代教育技术独角兽看起来已经与前几代教育专家的想象截然不同，你可以阅读娜塔莎·马斯卡伦纳斯(Natasha Mascarenhas)在Extra Crunch上的概述。例如，Udemy是由一群连续创业者创立的，他们从一开始就专注于实用技能(TechCrunch的长期读者可能还记得，我们在2013年左右与他们一起推出了专注于创业公司的CrunchU计划)。\n当然，这一代所谓的MOOC被广泛认为是有限的成功。Rish Joshi在“Extra Crunch”专栏中写道，在过去的十年里，许多学生的“毕业率”都在下降。相反，他看到了一波新的趋势，包括更深入的基于零工的专业知识和自动化的利基学习，这将帮助任何人在教育过程的每个阶段更快地获得更复杂的技能。以下是关于零工方式的更多信息：\n通过在线小组学习创造的潜在教育零工经济将对在线教育的供需双方产生巨大影响。让教育工作者能够在自己的家里在线授课，为世界各地更多可能没有考虑过教学的人打开了机会，这可以极大地增加世界各地的教师供应。它还有能力通过使学生能够独立于他们的位置获得相同质量的教师，来缓解城市和农村地区存在的教学质量差异。\n这一领域的公司，如OutSchool和Camp K12，都是大学预科学校。但环顾四周，每个试图教授数据科学、产品管理和其他传统行业需要融入的概念以更快创新的人，你都可以看到丹尼希望开始出现的解决方案。很快有一天，你可能会很快学会一项新技能，这是你找到工作所需的-或者是医学上的突破。\n要了解更多该领域的最新情况，请务必查看娜塔莎与顶尖edtech投资者共同进行的调查的第二部分。\n你认为你的独角兽雇主是下一个亚马逊还是谷歌？你准备好在任何一家公司经历所有起伏时持有潜在赢家的股票吗？创业公司财务顾问佩顿·卡尔(Peyton Carr)本周在一系列关于这个话题的文章中写道，如果你还没有，那么考虑尽快实现多元化：\n我们认为任何股票头寸或风险敞口超过投资组合的10%都是集中头寸。没有确切的数字，但适当的集中度取决于几个因素，如你的流动性需求、整体投资组合价值、风险偏好和较长期的财务计划。然而，在10%以上，该单一头寸的回报和波动性可能开始主导投资组合，使你面临高度的投资组合波动性。\n你投资组合中的公司“股票”通常只占你对公司整体财务敞口的一小部分。想想你的其他可能的风险敞口来源，比如限制性股票、RSU、期权、员工股票购买计划、401K、其他股权薪酬计划，以及你目前和未来与公司成功相关的工资流。在大多数情况下，实现你的财务目标的谨慎途径涉及到一个多元化的投资组合。\n除了广受欢迎的股票播客和TechCrunch和Extra Crunch的定期露面外，我的同事亚历克斯·威廉(Alex Wilhelm)还推出了一份名为“交易所”(The Exchange)的新时事通讯。这是他一周的总结，基于他每天为Extra Crunch和TechCrunch撰写的关于科技和创业融资的文章。你可以在这里报名。如果你不熟悉亚历克斯的工作，那么在本周的一篇文章中，他研究了无代码软件这一全新领域的爆炸性发展，在一个人们知之甚少的领域汇编了投资活动，并得出了以下分析：\n从这一点我们可以看出，2020年第一季度，无代码/低代码初创企业的风险投资总额至少超过8000万美元，尽管实际数字可能要高得多。在第二季度，我们可以看到至少1.4亿美元的资金，就在我今天早上挖到的几轮中。\n这使得低代码/无代码的初创公司有望在2020年至少筹集5亿美元。真实的数字更大，可能会急剧膨胀，这取决于你对空间的定义有多广泛。这意味着创业界不会等待风险投资来实现他们的愿景。资本已经在大量流动。\n下一个问题是，初创公司和更大的软件世界是否能让世界上的无代码服务变得足够容易，以至于很多人愿意培训自己。学习一种与软件交互的新方式所提供的能力和能力越多，很可能有助于确定采用了多少以及多快。\n大家好，欢迎回到TechCrunch专注于风险投资的播客The Equity(现已上Twitter！)，我们在这里解开头条背后的数字。\n本周剧组最高的是常规队员：丹尼·克莱顿，娜塔莎·马斯卡伦哈斯和我自己。作为一个小小的编程笔记，我们将在几周后回到YouTube上发布一些视频，所以如果你喜欢的话，一定要在TechCrunch频道偷看一下。\n如果你对金融奥秘感兴趣，我们确实制作了一集关于SPAC繁荣的特别节目。有关SPAC的更多信息，请单击此处。\n本周，Equity团队尝试了一些新的东西，即将我们的主要对话集中在一个我们正在密切关注的主题上：在当前由大流行引发的经济衰退中，科技的弹性。\n先从最近最新的经济消息说起，令人惊讶的是，华为科技的裁员速度已经放缓到了爬行的地步。而且，正如我们最近看到的那样，仍然有大量资金流入初创企业，即使与去年同期相比存在一些下降。为什么对初创公司和大型科技公司来说，情况仍然相当好？我们有几个想法，比如数字化转型的加速(更多信息在这里，更多信息在这里)，软件吞噬世界。当然，后一种概念与前者有关。\n在那之后，是时候从本周开始进行一些整洁的融资了，包括：\nKibbo的目标是让#Vanlife为更多的人实现，我们认为这很适合大流行和移动专业人士。\n苍井空筹集了530万美元用于无代码HR结缔组织，这是我相当看好的事情，但也引发了一些关于无代码本身的讨论，如果这一趋势更多的是炒作而不是实质的话。\n所有这些，我在这个周末推出了一份时事通讯，如果你读了，你会自动变得100%凉爽。它被称为TechCrunch Exchange，你可以在这里免费获得它。\n股市每周一上午7点下跌。PT和周五上午6点。PT，所以订阅我们的苹果播客，阴天，Spotify和所有的演员。", "note_en": "The easy startup ideas have all been done — the ones that just required some homebrew hardware hacking or PHP dorm-room coding to get off the ground. These days, you might need multiple advanced technical degrees to accomplish something significant. At least that’s what Danny Crichton muses grimly this week, in an essay entitled “ The two PhD problem of startups today.” Here’s one newsy example:\n Take synthetic biology and the future of pharmaceuticals. There is a popular and now well-funded thesis on crossing machine learning and biology/medicine together to create the next generation of pharma and clinical treatment. The datasets are there, the patients are ready to buy, and the old ways of discovering new candidates to treat diseases look positively ancient against a more deliberate and automated approach afforded by modern algorithms.\n  Moving the needle even slightly here though requires enormous knowledge of two very hard and disparate fields. AI and bio are domains that get extremely complex extremely fast, and also where researchers and founders quickly reach the frontiers of knowledge. These aren’t “solved” fields by any stretch of the imagination, and it isn’t uncommon to quickly reach a “No one really knows” answer to a question.\n Even when you try to build teams with the right combinations of knowledge, he argues, each domain is now so complex that the mesh of skills required is that much harder to achieve than previous efforts.\n I partly disagree, because innovation does not map on to existing domains in such a simple way. Computer scientists in the ’60s did not expect personal computing to be a thing until the homebrewers at Apple proved it. Enterprise software industry experts last decade did not expect consumer app developers to apply their bottoms-up growth skills and beat sophisticated offerings from incumbents. I expect all sorts of arcane academic ideas to be fused with market demand in unexpected ways that break apart the models we have to day, led by people who might not check all of the boxes in traditional fields.\n That includes the PhD itself and the education industry. Which is where Danny and I agree. The application of software to education has been a struggle because success requires understanding two disciplines, and he concludes that the way we learn will itself have to be broken down and reformed:\n “We can’t wait until 25 years of school is complete and people graduate haggard at 40 before they can take a shot at some of these fascinating intersections. We need to build slipstreams to these lacuna where innovation hasn’t yet reached.”\n   Almost to prove Danny’s first point, some of the biggest companies in edtech today were founded by technical experts who were also university professors. Companies like Coursera are today raising their late-stage funding rounds on top of a pandemic-fueled boom for online higher learning.\n But this  generation of edtech unicorns already looks pretty different from anything that previous generations of education experts had imagined, as you can read an overview of from Natasha Mascarenhas on Extra Crunch. For example, Udemy was founded by a group of serial entrepreneurs, and they focused on practical skills from the start (long-time TechCrunch readers may recall our startup-focused  CrunchU program with them circa 2013).\n Of course, this generation of so-called MOOCs is widely seen as a limited success. In a column for Extra Crunch,  Rish Joshi writes about the declining “graduation” rates that many show from students over the past decade. Instead, he sees a new wave of trends, including deeper gig-based expertise and automated niche learning, that will help anyone acquire more complex skills more quickly, at every stage of the education process. Here’s more, about the gig approach:\n A potential gig economy for education created via small-group learning online would have a large impact on both the supply and demand sides of online education. Giving educators the ability to teach online from their own home opens up the opportunity to many more people around the world who may not have otherwise considered teaching, and this can greatly increase the supply of teachers worldwide. It also has the ability to mitigate the discrepancy that’s existed between quality of teaching in urban and rural areas by enabling students to access the same quality of teachers independent of their location.\n Companies in this space like Outschool and Camp K12, are pre-college. But take a look around at everyone trying to teach data science, product management and other concepts that traditional industries need to incorporate to innovate more quickly, and you can see the solution that Danny hopes for starting to emerge. One day soon, you might be able to school up quickly on a new skill that you need to get a job — or a medical breakthrough.\n For more on the latest in the space, be sure to check out Natasha’s  second part of her survey with top edtech investors.\n   Do you think your unicorn employer is the next Amazon or Google? Are you ready to hold on to the stock of a potential winner through all of the ups and downs that happen to any company? If you haven’t already,  consider diversifying sooner rather than later, writes startup financial advisor Peyton Carr in a  series on the topic this week:\n We consider any stock position or exposure greater than 10% of a portfolio to be a concentrated position. There is no hard number, but the appropriate level of concentration is dependent on several factors, such as your liquidity needs, overall portfolio value, the appetite for risk and the longer-term financial plan. However, above 10% and the returns and volatility of that single position can begin to dominate the portfolio, exposing you to high degrees of portfolio volatility.\n The company “stock” in your portfolio often is only a fraction of your overall financial exposure to your company. Think about your other sources of possible exposure such as restricted stock, RSUs, options, employee stock purchase programs, 401k, other equity compensation plans, as well as your current and future salary stream tied to the company’s success. In most cases, the prudent path to achieving your financial goals involves a well-diversified portfolio.\n   In addition to the popular Equity podcast and regular appearances across TechCrunch and Extra Crunch, my colleague Alex Wilhelm is launching a new newsletter called The Exchange. It’s his weekly summary of the week, based on his daily writing for Extra Crunch and TechCrunch about tech and startup finance. You can sign up for it  here. As a taste of Alex’s work if you’re not familiar, in one article this week, he took a look at the explosion in the still-new area of no code software,  compiling investment activity in a space that is poorly understand and coming away with this analysis:\n From this we can tell that at the  very minimum, Q1 2020 VC totals for no-code/low-code startups were north of $80 million, though the real figure is likely far higher. In Q2 we can see at least $140 million in money, just among rounds that I was able to dig up this morning.\n That puts low-code/no-code startups on pace to raise around $500 million  at the very least in 2020. The real number is larger, and can swell sharply depending on how expansive your definition of the space is. That means that the startup world isn’t waiting for venture dollars to make their vision come true. The capital is already flowing in great quantity.\n The next question is whether the startup and larger software world can make the no-code services of the world easy enough that lots of folks are willing to train themselves. The more power and capability that can be offered in exchange for learning a new way of interacting with software will likely help determine how much adoption is had, and how soon.\n                    Hello and welcome back to  Equity, TechCrunch’s venture capital-focused podcast ( now on Twitter!), where we unpack the numbers behind the headlines.\n Up top the crew this week was the regular contingent:  Danny Crichton,  Natasha Mascarenhas and  myself. As a tiny programming note, we’re going back to posting some videos on YouTube in a few weeks, so make sure to peep  the TechCrunch channel if that’s your jam.\n And we did  a special episode on the SPAC boom, if you are into financial arcana. For more on SPACs –&gt;  here.\n The Equity crew tried something new this week, namely centering our main conversation around a theme that we’re keeping tabs on: The resilience of tech during the current pandemic-led recession.\n Starting with the  recent economic news, it’s surprising that  tech’s layoffs have slowed to a crawl. And, as we’ve recently seen, there’s  still plenty of money flowing into startups, even if there  are some dips present on a year-over-year basis. Why are things still pretty good for startups, and pretty good for major tech companies? We have a few ideas, like the  acceleration of the digital transformation (more  here, and  here), and software eating the world. The latter concept, of course, is related to the former.\n After that it was time to go through some neat funding rounds from the week, including:\n Kibbo’s shot at  making the #vanlife happen for more folks, something that we think is a good fit for the pandemic and the mobile professional.\n Sora’s $5.3 million raise  for no-code HR connective tissue, something that I was rather bullish on but drew some chat about no-code itself, and if the trend is more hype than substance.\n All that and I have a newsletter launching this weekend that if you read, you will automatically be 100% cooler. It’s called the TechCrunch Exchange, and you can snag it for free  here.\n Equity drops every Monday at 7:00 a.m. PT and Friday at 6:00 a.m. PT, so subscribe to us on  Apple Podcasts,  Overcast,  Spotify and all the casts.", "posttime": "2020-07-26 02:11:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "创业,周刊,weekly", "title": "\n《创业周刊》：要打造一家伟大的科技公司，你需要接受哪些教育？", "title_en": "\n\t\t\t\tStartups Weekly: What education do you need to build a great tech company?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/25/startups-weekly-what-education-do-you-need-to-build-a-great-tech-company/", "via": "", "real_tags": ["创业", "周刊", "weekly"]}, {"category": "", "categoryclass": "", "imagename": "8fcff592bebc0552f924247bdd02b869.jpg", "infoid": 1014167, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "研究人员首次发现大量火星沙子在迁移。这一发现打消了人们长期以来的看法，即这些“巨人”自数十万年前形成以来就没有移动过。它们也是这颗红色星球上强于预期的风的证据。\n约翰霍普金斯大学应用物理实验室的行星科学家拉尔夫·洛伦茨(Ralph Lorenz)没有参与这项研究，他说，人类能在火星上探测到这些变化，这是相当令人震惊的。“我们现在可以测量另一个星球表面的过程，这些过程只比我们头发生长的速度快几倍。”\n巨型恐龙分布在地球上的沙漠中，通常分布在沙丘之间。沙子中的波浪间隔达几十米，它们是一种更大版本的涟漪，每隔10厘米左右就会在许多沙丘上起伏。\n但与沙丘不同的是，巨型沙丘是由两种大小的沙粒组成的。意大利那不勒斯国家天体物理研究所的行星科学家西蒙妮·西尔维斯特罗(Simone Silvestro)说，更粗、更重的颗粒覆盖着巨型珠峰的顶部，使得风更难移动这些特征。\n自21世纪初以来，火星探测器和轨道器多次在这颗红色星球上发现巨星。但它们似乎没有以任何可测量的方式发生变化，这使得一些科学家认为它们是火星过去的遗迹，当时火星较厚的大气层允许更强的风。\n现在，利用NASA火星勘测轨道器拍摄的图像，西尔维斯特罗和他的同事们已经证明，一些巨人确实在爬行-只是非常缓慢。\n研究人员将重点放在火星赤道附近的两个地点。他们分析了麦克劳克林陨石坑的大约1100颗巨珠和尼利福萨地区的300颗。他们通过比较每个地点的延时图像(分别相隔7.6年和9.4年)来寻找运动的迹象。研究小组在“地球物理研究杂志：行星”上报道，这两个地区的巨型行星每年前进约10厘米。这就是伊朗卢特沙漠中巨人移动的速度。\n史密森学会航空航天博物馆的行星地质学家吉姆·津贝尔曼(Jim Zimbelman)说，火星上竟然有巨人活动，这令人惊讶。他说，就在几十年前，还没有证据表明火星上的沙子是流动的。“我们都认为风不够大。”\nSilvestro和他的同事们认为，火星上的风可能正在加速小沙粒的速度。一旦这些颗粒开始滚动或反弹，它们就会像撞击锤一样，撞到更大的颗粒上，并启动它们。这一过程被称为冲击驱动的蠕动，已经在地球上观察到。\n研究小组得出结论，火星上的沙丘很可能将它们的谷物捐赠给巨人的迁徙，因为附近的沙丘与巨人的移动方向相同。\n火星的大气模型表明，能够移动沙子的风很少。研究小组认为，迁徙中的巨人的发现将迫使这些模型进行修订。\n西尔维斯特罗计划将他对迁徙中的巨人的搜索范围扩大到整个星球。他怀疑速度最快的巨型陨石将位于火星移动速度最快的沙丘附近。研究人员认为，移动中的巨鸟是多风条件的灯塔，这可能反过来引发沙尘暴。空气中的灰尘会覆盖太阳能电池板，降低太阳能电池板的效率，还会使齿轮等机械部件结成胶状物。这对火星探测车和人类栖息地都是坏消息。", "note_en": "Researchers have spotted large waves of martian sand migrating for the first time. The discovery dispels the long-held belief that these “megaripples” haven’t moved since they formed hundreds of thousands of years ago. They’re also evidence of stronger-than-expected winds on the Red Planet.\n It’s pretty staggering that humans can detect these changes on Mars, says Ralph Lorenz, a planetary scientist at the Johns Hopkins University Applied Physics Laboratory who was not involved in the research. “We can now measure processes on the surface of another planet that are just a couple times faster than our hair grows.”\n Megaripples are found in deserts on Earth, often between dunes. Waves in the sand spaced up to tens of meters apart, they’re a larger version of ripples that undulate every 10 centimeters or so on many sand dunes.\n But unlike dunes, megaripples are made up of two sizes of sand grains. Coarser, heavier grains cap the crests of megaripples, making it harder for wind to move these features around, says Simone Silvestro, a planetary scientist at Italy’s National Institute of Astrophysics in Naples.\n Since the early 2000s, Mars rovers and orbiters have  repeatedly spotted megaripples on the Red Planet. But they didn’t seem to change in any measurable way, which led some scientists to think they were relics from Mars’s past, when its thicker atmosphere permitted stronger winds.\n Now, using images captured by NASA’s Mars Reconnaissance Orbiter, Silvestro and his colleagues have shown that some megaripples do creep along—just very slowly.\n The researchers focused on two sites near the equator of Mars. They analyzed roughly 1100 megaripples in McLaughlin crater and 300 in the Nili Fossae region. They looked for signs of movement by comparing time-lapse images of each site—taken 7.6 and 9.4 years apart, respectively. Megaripples in both regions advanced by  about 10 centimeters per year, the team reports in the  Journal of Geophysical Research: Planets. That’s about how fast megaripples move in the  Lut Desert of Iran.\n It’s a surprise that megaripples move at all on Mars, says Jim Zimbelman, a planetary geologist at the Smithsonian Institution’s Air and Space Museum. Just a few decades ago, there was no evidence that sands on Mars were mobile, he says. “None of us thought that the winds were strong enough.”\n Winds on Mars might be accelerating small grains of sand, Silvestro and his colleagues suggest. Once these grains start to roll or bounce, they can act like battering rams, knocking into larger grains and setting them in motion. This process, known as impact-driven creep, has been observed on Earth.\n Sand dunes on Mars likely donated their grains to the megaripples’ migration, the team concludes, because nearby dunes moved in the same direction as the megaripples.\n Atmospheric models of Mars suggest winds capable of moving sand are rare. This discovery of migrating megaripples will force those models to be revised, the team suggests.\n Silvestro plans to expand his search for migrating megaripples to the whole planet. He suspects the speediest megaripples will be near Mars’s fastest moving dunes. Megaripples on the move are beacons of windy conditions, which might in turn kick-start dust storms, the researchers suggest. Airborne dust can blanket solar panels, reducing their efficiency, and it can also gum up mechanical parts like gears. That’s bad news for Mars rovers and human habitats alike.", "posttime": "2020-07-26 02:11:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "火星,waves", "title": "巨大的沙浪正在火星上移动", "title_en": "Giant Waves of Sand Are Moving On Mars", "transed": 1, "url": "https://www.sciencemag.org/news/2020/07/giant-waves-sand-are-moving-mars", "via": "", "real_tags": ["火星", "waves"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014166, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎参加Redux Essentials教程！本教程将向您介绍Redux，并教您如何使用我们最新推荐的工具和最佳实践正确使用Redux。完成后，您应该能够使用您在这里学到的工具和模式开始构建您自己的Redux应用程序了。\n在本教程的第1部分中，我们将介绍使用Redux需要了解的关键概念和术语，而在第2部分中，我们将研究一个基本的Reaction+Redux应用程序，看看这些部分是如何组合在一起的。\n从第3部分开始，我们将利用这些知识构建一个具有一些实际功能的小型社交媒体订阅源应用程序，看看这些功能在实践中是如何工作的，并讨论使用Redux的一些重要模式和指导原则。\n本页面将重点向您展示如何正确使用Redux，并解释足够的概念，以便您能够理解如何正确构建Redux应用程序。\n我们试着让这些解释适合初学者，但我们确实需要对你已经知道的做出一些假设：\n如果您对这些主题还不太熟悉，我们鼓励您先花些时间熟悉它们，然后再回来了解Redux。当你准备好的时候，我们会在这里的！\n您应该确保在浏览器中安装了Reaction和Redux DevTools扩展：\n首先，它有助于理解这件事是什么。是干什么的呢？它帮助我解决了什么问题？我为什么要用它呢？\nRedux是用于管理和更新应用程序状态的模式和库，它使用称为&#34；Actions&#34；的事件。它充当需要在整个应用程序中使用的状态的集中存储，其规则确保状态只能以可预测的方式更新。\nRedux可帮助您管理应用程序许多部分所需的全局状态。\nRedux提供的模式和工具使您更容易理解何时、何地、为什么以及如何更新应用程序中的状态，以及当这些更改发生时应用程序逻辑将如何运行。Redux将引导您编写可预测和可测试的代码，这有助于您确信您的应用程序将按预期工作。\nRedux帮助您处理共享状态管理，但与任何工具一样，它也有权衡之处。有更多的概念需要学习，还有更多的代码需要编写。它还向您的代码添加了一些间接性，并要求您遵循某些限制。这是短期和长期生产力之间的权衡。\n您在应用程序中的许多位置都需要大量的应用程序状态。\n这个应用程序有一个中型或大型代码库，可能会有很多人使用。\n并不是所有的应用都需要Redux。花点时间考虑一下你正在开发的应用程序类型，并决定哪些工具最能帮助解决你正在处理的问题。\nRedux是一个小型的独立JS库。但是，它通常与其他几个软件包一起使用：\nRedux可以与任何UI框架集成，并且最常与Reaction一起使用。Reaction-Redux是我们的官方软件包，它允许您的Reaction组件通过读取状态片段并调度操作来更新存储，从而与Redux存储进行交互。\nRedux Toolkit是我们推荐的编写Redux逻辑的方法。它包含我们认为构建Redux应用程序所必需的软件包和函数。Redux Toolkit内置了我们建议的最佳实践，简化了大多数Redux任务，防止了常见错误，并使Redux应用程序的编写变得更容易。\nRedux DevTools扩展显示Redux存储中状态随时间的变化历史记录。这允许您有效地调试您的应用程序，包括使用强大的技术，如时间旅行调试。\n在我们深入了解一些实际代码之前，让我们先来谈谈使用Redux需要了解的一些术语和概念。\n让我们从一个小的Reaction计数器组件开始。它跟踪处于组件状态的数字，并在单击按钮时递增该数字：\n操作、基于用户输入在应用程序中发生的事件以及触发状态更新。\n当发生某些事情(如用户单击按钮)时，会根据发生的情况更新状态。\n但是，当我们有多个组件需要共享和使用相同的状态时，简单性可能会被破坏，特别是当这些组件位于应用程序的不同部分时。有时这可以通过将状态提升到父组件来解决，但这并不总是有帮助的。\n解决此问题的一种方法是从组件中提取共享状态，并将其放入组件树外部的集中位置。这样，我们的组件树就变成了一个很大的视图，任何组件都可以访问状态或触发操作，无论它们在树中的什么位置！\n通过定义和分离状态管理中涉及的概念，并实施维护视图和状态之间独立性的规则，我们使代码更具结构性和可维护性。\n这是Redux背后的基本思想：在您的应用程序中包含全局状态的单个集中位置，以及在更新该状态以使代码可预测时要遵循的特定模式。\n默认情况下，JavaScript对象和数组都是可变的。如果我创建一个对象，我可以更改其字段的内容。如果我创建一个数组，我还可以更改内容：\n这称为改变对象或数组。它在内存中是相同的对象或数组引用，但现在对象内部的内容已更改。\n为了不变地更新值，您的代码必须复制现有的对象/数组，然后修改这些副本。\n我们可以使用JavaScript的数组/对象扩散操作符，以及返回数组的新副本而不是改变原始数组的数组方法手动完成此操作：\nRedux希望所有状态更新都是一成不变的。稍后，我们将研究这一点在哪里以及如何重要，以及编写不可变的更新逻辑的一些更简单的方法。\n在我们继续之前，您需要熟悉一些重要的Redux术语：\n操作是具有类型字段的普通JavaScript对象。您可以将操作视为描述应用程序中发生的事情的事件。\n类型字段应该是为该操作指定描述性名称的字符串，如&#34；todos/todoAdded&#34；。我们通常编写类似&#34；domain/eventName&#34；的类型字符串，其中第一部分是该操作所属的特性或类别，第二部分是发生的具体事件。\n动作对象可以有其他字段，其中包含有关所发生事件的附加信息。按照惯例，我们将该信息放在一个名为Payload的字段中。\n动作创建器是创建和返回动作对象的函数。我们通常使用这些，这样我们就不必每次都手动编写操作对象：\n减法器是一个函数，它接收当前状态和操作对象，决定如何在必要时更新状态，并返回新状态：(state，action)=&gt；newstate。\n它们应该仅根据state和action参数计算新的状态值。\n不允许他们修改现有状态。相反，它们必须通过复制现有状态并更改复制的值来进行不可变的更新。\n他们不能做任何异步逻辑，不能计算随机值，也不能引起其他副作用；\n我们稍后将更多地讨论减速器的规则，包括为什么它们很重要以及如何正确遵循它们。\n检查减少器是否关心此操作如果是，请复制状态，使用新值更新副本，然后将其返回。\n这里有一个减速机的小例子，展示了每个减速机应该遵循的步骤：\n还原器可以使用内部的任何类型的逻辑来决定新状态应该是什么：IF/ELSE、SWITCH、循环等等。\nArray.Reduce()方法允许您获取一个值数组，一次处理数组中的每一项，然后返回一个最终结果。您可以将其视为&#34；将数组减少到一个值&#34；。\nArray.duce()接受一个回调函数作为参数，该函数将为数组中的每一项调用一次。它需要两个论点：\n回调第一次运行时，没有可用的previousResult，因此我们还需要传入一个初始值，该初始值将用作第一个previousResult。\n如果我们想要将一组数字相加，以确定总数是多少，我们可以编写一个如下所示的Reduce回调：\n请注意，此addNumber；Reduce回调函数本身不需要跟踪任何内容。它接受previousResult和currentItem参数，对它们执行一些操作，然后返回一个新的结果值。\nRedux Reducer函数与这个&#34；Reduce回调函数的概念完全相同！它接受&#34；前一个结果&#34；(状态)和&#34；当前项&#34；(操作对象)，根据这些参数决定新的状态值，并返回该新状态。\n如果我们要创建Redux操作的数组，调用Reduce()，然后传入一个Reducer函数，我们将以同样的方式获得最终结果：\n我们可以说Redux Reducer将一组动作(随着时间的推移)减少到单一状态。不同之处在于，在Array.duce()中，它是一次性发生的，而在Redux中，它是在您运行的应用程序的整个生命周期中发生的。\n该存储是通过传入减法器创建的，并且具有一个名为getState的方法，该方法返回当前状态值：\nRedux存储有一个名为Dispatch的方法。更新状态的唯一方法是调用Store.Dispatch()并传入一个操作对象。存储将运行其Reducer函数并将新的状态值保存在内部，我们可以调用getState()来检索更新后的值：\n您可以将调度操作视为在应用程序中触发事件。发生了一些事情，我们想让商店知道这件事。Reducer的作用类似于事件侦听器，当它们听到感兴趣的操作时，它们会更新状态作为响应。\n选择器是知道如何从存储状态值中提取特定信息的函数。随着应用程序变大，这可以帮助避免重复逻辑，因为应用程序的不同部分需要读取相同的数据：\n早些时候，我们谈到了单向数据流，它描述了更新应用程序的一系列步骤：\n当发生某些事情(如用户单击按钮)时，会根据发生的情况更新状态。\n初始设置：存储调用根减法器一次，并将返回值保存为其初始状态。\n首次呈现UI时，UI组件将访问Redux存储的当前状态，并使用该数据来决定要呈现的内容。他们还订阅任何未来的商店更新，这样他们就可以知道状态是否发生了变化。\n更新：存储使用以前的状态和当前操作再次运行Reducer函数，并将返回值保存为新状态。\n存储通知订阅的UI的所有部分存储已更新。\n每个需要来自存储区的数据的UI组件都会检查它们需要的状态部分是否已更改。\n每个看到其数据已更改的组件都会强制使用新数据重新呈现，这样它就可以更新屏幕上显示的内容。\nRedux确实有许多新的术语和概念需要记住。提醒一下，这里是我们刚刚报道的内容：\nRedux使用单向数据流应用程序结构状态描述应用程序在某个时间点的状况，并根据该状态呈现UI。\nRedux使用几种类型的代码操作是带有类型字段的纯对象，并在应用程序中描述发生了什么。\n减法器是基于先前状态+操作计算新状态值的函数。\n我们已经看过Redux应用程序的每一个单独部分。接下来，继续第2部分：Redux应用程序结构，在那里我们将查看一个完整的工作示例，看看这些部分是如何组合在一起的。", "note_en": "Welcome to the Redux Essentials tutorial!  This tutorial will introduce you to Redux and teach you how to use it the right way, using our latest recommended tools and best practices. By the time you finish, you should be able to start building your own Redux applications using the tools and patterns you&#39;ve learned here.\n In Part 1 of this tutorial, we&#39;ll cover the key concepts and terms you need to know to use Redux, and in  Part 2 we&#39;ll examine a basic React + Redux app to see how the pieces fit together.\n Starting in  Part 3, we&#39;ll use that knowledge to build a small social media feed app with some real-world features, see how those pieces actually work in practice, and talk about some important patterns and guidelines for using Redux.\n  This page will focus on showing you  how to use Redux the right way, and explain just enough of the concepts so that you can understand how to build Redux apps correctly.\n We&#39;ve tried to keep these explanations beginner-friendly, but we do need to make some assumptions about what you know already:\n  If you&#39;re not already comfortable with those topics, we encourage you to take some time to become comfortable with them first, and then come back to learn about Redux. We&#39;ll be here when you&#39;re ready!\n You should make sure that you have the React and Redux DevTools extensions installed in your browser:\n   It helps to understand what this &#34;Redux&#34; thing is in the first place. What does it do? What problems does it help me solve? Why would I want to use it?\n Redux is a pattern and library for managing and updating application state, using events called &#34;actions&#34;. It serves as a centralized store for state that needs to be used across your entire application, with rules ensuring that the state can only be updated in a predictable fashion.\n  Redux helps you manage &#34;global&#34; state - state that is needed across many parts of your application.\n The patterns and tools provided by Redux make it easier to understand when, where, why, and how the state in your application is being updated, and how your application logic will behave when those changes occur. Redux guides you towards writing code that is predictable and testable, which helps give you confidence that your application will work as expected.\n  Redux helps you deal with shared state management, but like any tool, it has tradeoffs. There&#39;s more concepts to learn, and more code to write. It also adds some indirection to your code, and asks you to follow certain restrictions. It&#39;s a trade-off between short term and long term productivity.\n  You have large amounts of application state that are needed in many places in the app\n   The app has a medium or large-sized codebase, and might be worked on by many people\n Not all apps need Redux. Take some time to think about the kind of app you&#39;re building, and decide what tools would be best to help solve the problems you&#39;re working on.\n   Redux is a small standalone JS library. However, it is commonly used with several other packages:\n  Redux can integrate with any UI framework, and is most frequently used with React.   React-Redux is our official package that lets your React components interact with a Redux store by reading pieces of state and dispatching actions to update the store.\n  Redux Toolkit is our recommended approach for writing Redux logic. It contains packages and functions that we think are essential for building a Redux app. Redux Toolkit builds in our suggested best practices, simplifies most Redux tasks, prevents common mistakes, and makes it easier to write Redux applications.\n  The   Redux DevTools Extension shows a history of the changes to the state in your Redux store over time. This allows you to debug your applications effectively, including using powerful techniques like &#34;time-travel debugging&#34;.\n  Before we dive into some actual code, let&#39;s talk about some of the terms and concepts you&#39;ll need to know to use Redux.\n  Let&#39;s start by looking at a small React counter component. It tracks a number in component state, and increments the number when a button is clicked:\n   The  actions, the events that occur in the app based on user input, and trigger updates in the state\n  When something happens (such as a user clicking a button), the state is updated based on what occurred\n  However, the simplicity can break down when we have  multiple components that need to share and use the same state, especially if those components are located in different parts of the application. Sometimes this can be solved by  &#34;lifting state up&#34; to parent components, but that doesn&#39;t always help.\n One way to solve this is to extract the shared state from the components, and put it into a centralized location outside the component tree. With this, our component tree becomes a big &#34;view&#34;, and any component can access the state or trigger actions, no matter where they are in the tree!\n By defining and separating the concepts involved in state management and enforcing rules that maintain independence between views and states, we give our code more structure and maintainability.\n This is the basic idea behind Redux: a single centralized place to contain the global state in your application, and specific patterns to follow when updating that state to make the code predictable.\n   JavaScript objects and arrays are all mutable by default. If I create an object, I can change the contents of its fields. If I create an array, I can change the contents as well:\n  This is called  mutating the object or array. It&#39;s the same object or array reference in memory, but now the contents inside the object have changed.\n In order to update values immutably, your code must make  copies of existing objects/arrays, and then modify the copies.\n We can do this by hand using JavaScript&#39;s array / object spread operators, as well as array methods that return new copies of the array instead of mutating the original array:\n  Redux expects that all state updates are done immutably. We&#39;ll look at where and how this is important a bit later, as well as some easier ways to write immutable update logic.\n   There&#39;s some important Redux terms that you&#39;ll need to be familiar with before we continue:\n  An  action is a plain JavaScript object that has a  type field.  You can think of an action as an event that describes something that happened in the application.\n The  type field should be a string that gives this action a descriptive name, like  &#34;todos/todoAdded&#34;. We usually write that type string like  &#34;domain/eventName&#34;, where the first part is the feature or category that this action belongs to, and the second part is the specific thing that happened.\n An action object can have other fields with additional information about what happened. By convention, we put that information in a field called  payload.\n    An  action creator is a function that creates and returns an action object. We typically use these so we don&#39;t have to write the action object by hand every time:\n   A  reducer is a function that receives the current  state and an  action object, decides how to update the state if necessary, and returns the new state:  (state, action) =&gt; newState.\n   They should only calculate the new state value based on the  state and  action arguments\n They are not allowed to modify the existing  state. Instead, they must make  immutable updates, by copying the existing  state and making changes to the copied values.\n They must not do any asynchronous logic, calculate random values, or cause other &#34;side effects&#34;\n We&#39;ll talk more about the rules of reducers later, including why they&#39;re important and how to follow them correctly.\n  Check to see if the reducer cares about this action If so, make a copy of the state, update the copy with new values, and return it\n Here&#39;s a small example of a reducer, showing the steps that each reducer should follow:\n  Reducers can use any kind of logic inside to decide what the new state should be:  if/else,  switch, loops, and so on.\n   The   Array.reduce() method lets you take an array of values, process each item in the array one at a time, and return a single final result. You can think of it as &#34;reducing the array down to one value&#34;.\n Array.reduce() takes a callback function as an argument, which will be called one time for each item in the array. It takes two arguments:\n  The first time that the callback runs, there isn&#39;t a  previousResult available, so we need to also pass in an initial value that will be used as the first  previousResult.\n If we wanted to add together an array of numbers to find out what the total is, we could write a reduce callback that looks like this:\n  Notice that this  addNumber &#34;reduce callback&#34; function doesn&#39;t need to keep track of anything itself. It takes the  previousResult and  currentItem arguments, does something with them, and returns a new result value.\n A Redux reducer function is exactly the same idea as this &#34;reduce callback&#34; function! It takes a &#34;previous result&#34; (the  state), and the &#34;current item&#34; (the  action object), decides a new state value based on those arguments, and returns that new state.\n If we were to create an array of Redux actions, call  reduce(), and pass in a reducer function, we&#39;d get a final result the same way:\n  We can say that  Redux reducers reduce a set of actions (over time) into a single state. The difference is that with  Array.reduce() it happens all at once, and with Redux, it happens over the lifetime of your running app.\n   The store is created by passing in a reducer, and has a method called  getState that returns the current state value:\n   The Redux store has a method called  dispatch.  The only way to update the state is to call  store.dispatch() and pass in an action object. The store will run its reducer function and save the new state value inside, and we can call  getState() to retrieve the updated value:\n  You can think of dispatching actions as &#34;triggering an event&#34; in the application. Something happened, and we want the store to know about it. Reducers act like event listeners, and when they hear an action they are interested in, they update the state in response.\n    Selectors are functions that know how to extract specific pieces of information from a store state value. As an application grows bigger, this can help avoid repeating logic as different parts of the app need to read the same data:\n   Earlier, we talked about &#34;one-way data flow&#34;, which describes this sequence of steps to update the app:\n When something happens (such as a user clicking a button), the state is updated based on what occurred\n  Initial setup: The store calls the root reducer once, and saves the return value as its initial  state\n When the UI is first rendered, UI components access the current state of the Redux store, and use that data to decide what to render. They also subscribe to any future store updates so they can know if the state has changed.\n Updates: The store runs the reducer function again with the previous  state and the current  action, and saves the return value as the new  state\n The store notifies all parts of the UI that are subscribed that the store has been updated\n Each UI component that needs data from the store checks to see if the parts of the state they need have changed.\n Each component that sees its data has changed forces a re-render with the new data, so it can update what&#39;s shown on the screen\n    Redux does have a number of new terms and concepts to remember. As a reminder, here&#39;s what we just covered:\n Redux uses a &#34;one-way data flow&#34; app structure State describes the condition of the app at a point in time, and UI renders based on that state\n Redux uses several types of code Actions are plain objects with a  type field, and describe &#34;what happened&#34; in the app\n Reducers are functions that calculate a new state value based on previous state + an action\n  We&#39;ve seen each of the individual pieces of a Redux app. Next, continue on to  Part 2: Redux App Structure, where we&#39;ll look at a full working example to see how the pieces fit together.", "posttime": "2020-07-26 02:10:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "教程,redux,状态", "title": "Redux概述和概念-重塑Redux教程", "title_en": "Redux Overview and Concepts – Reimagined Redux Tutorial", "transed": 1, "url": "https://redux.js.org/tutorials/essentials/part-1-overview-concepts", "via": "", "real_tags": ["教程", "redux", "状态"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014165, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你在去上班的火车上，打开手机上的卫报应用程序。一条隧道包围着你，但这款应用程序的工作方式仍然与往常非常相似-尽管你缺乏互联网连接，但你仍然可以获得完整的体验，只有显示的内容会变得陈旧。但是，如果您尝试对网站执行相同的操作，它将完全不会加载：\nChrome的隐藏游戏减轻了离线的痛苦(在桌面上按空格键，在移动设备上轻拍恐龙)。但我们可以做得更好。\n服务人员允许网站作者拦截对其网站的所有网络请求，这意味着我们可以提供丰富的离线体验，就像本地应用程序一样。在“卫报”上，我们最近发布了我们自己的定制离线体验。当用户离线时，他们会看到一个卫报品牌的页面，上面有一条简单的离线消息，还有一个纵横字谜供他们在等待连接时玩。这篇博客文章是关于我们是如何建造它的，但首先，这里是你可以如何亲身体验它的方法。\n您必须运行支持Service Worker和Fetch API的浏览器。在撰写本文时，只有Chrome(移动端和台式机)支持这两个API，但是Firefox很快就会支持这两个API(目前是夜间版本)，除了Safari之外，所有的浏览器都表现出了热情。此外，服务人员只能注册通过HTTPS提供服务的网站，theGuardian.com已经开始转向HTTPS。因此，我们只能为网站的HTTPS部分提供离线体验。目前，我们选择了开发者博客作为我们的试验场。所以，如果你在我们网站的开发者博客上读到这篇文章，你就很幸运了。\n一旦您在支持的浏览器中访问了我们的开发人员博客上的页面，您就一切都准备好了。断开您的设备与互联网的连接并刷新。如果您无法亲自试用，请看此演示视频。\n我们可以使用一些简单的JavaScript命令浏览器在用户到达页面后立即注册我们的服务工作者。目前对服务工作者的支持很少，因此我们需要使用功能检测来避免任何错误。\n作为服务人员安装活动的一部分，我们可以使用新的缓存API来缓存我们网站的各种移动部分，如HTML、CSS和JavaScript：\nVar staticCacheName=&#39；static&#39；var version=1；function updateCache(){1返回caches.open(staticCacheName+version))，然后(function(Cache){1)返回cache.addAll([])&#39；/Offline-page.html&#39；，#39；/sets/css/main.。/Assets/js/main.js&#39；{#39；{{#}；self.addEventListener(&#39；install&#39；，function(Event){www.event.waitUntil(updateCache())；})；\n安装完成后，服务人员可以监听和控制FETCH事件，让我们完全控制网站将来产生的所有网络请求。\n为了让您对我们这里的灵活性有一些了解，我们可以通过编程构造我们自己的响应：\nSelf.addEventListener(&#39；FETCH&#39；，Function(Event){var Response=new Response(&#39；&lt；h1&gt；Hello，World！&lt；/h1&gt；&39；，{Headers：{&#39；Content-Type&#39；：&#39；text/html&#39；}})；#event.respondWith(Response)；})；\n或者，如果我们可以找到给定请求的匹配项，我们可以使用缓存中的内容进行响应，回退到网络：\nSelf.addEventListener(&#39；FETCH&#39；，Function(Event){Eventevent.respondWith(Fetch.caches.Match(event.request)和Event.Request)；Then(Function(Response){Fetch(event.request)；Function(Event.request)；Function(Event.Request}))；})；\n首先，服务人员在安装时缓存离线页面所需的HTML和资源。此缓存中包括我们为纵横字谜页面开发的Reaction应用程序。此后，我们拦截对theGuardian.com上的网页的所有网络请求，包括对这些页面上的子资源的请求。处理这些请求的逻辑大致如下：\n如果我们检测到传入的请求是指向某个HTML页面的导航，我们总是希望提供最新的内容，因此我们尝试通过网络向服务器发出请求。\n如果网络请求抛出错误(即，由于用户脱机而失败)，我们将捕获该错误并使用脱机页面的缓存HTML进行响应。\n否则，如果我们检测到请求不是HTML，我们将在缓存中查找该请求。\n生成的代码使用新的缓存API(作为Service Worker API的一部分)和FETCH(用于发出网络请求)，如下所示：\nVar doRequestAcceptHtml=function(Request){}；return request.headers.get(&#39；Accept&#39；)；.plit(&#39；，&#39；)；.Some(function(Type){return type=&#39；text/html&#39；；})；}；self.addEventListener(&#39；FETCH&#39；，Function(Event){0。**if(doRequestAcceptHtml(Request)){Do RequestAcceptHtml(&#39；/Offline-page.html&#39；；*FETCH(Request)*FETCH(Request)*.catch(function(){*caches.Match(&#39；/Offline-page.html&#39；)；*})*)；**}否则{//默认取回行为将首先为所有其他请求提供缓存//缓存，以获取事件.respondWith()、caches.Match(Request)、(Request)，然后(function(Response){、返回响应||Fetch(Request)；、())、()、()；}})；\n我们有充分的理由对这些新的浏览器技术感到兴奋，因为它们可以用来为网站提供我们今天在本地应用程序中拥有的丰富的离线体验。将来，当theGuardian.com完成向HTTPS的迁移后，离线页面的重要性将会增加，我们可以对离线体验做进一步的改进。想象一下，在你没有互联网的通勤路上打开theGuardian.com去工作，找到为你个性化的内容，并在你访问之前由浏览器下载和缓存。安装过程中没有摩擦--与需要用户拥有应用商店帐户才能安装的本地应用不同，在网络上只需访问有问题的网站即可。服务人员还可以帮助缩短网站加载时间，因为可以像在本地应用程序中一样可靠地缓存网站的外壳。\n如果你有兴趣了解更多关于服务工作者的知识和可能发生的事情，Chrome的开发者倡导者Matt Gaant已经写了一篇关于服务工作者的入门文章，对此进行了更详细的介绍。", "note_en": "You’re on a train to work and you open up the Guardian app on your phone. A tunnel surrounds you, but the app still works in very much the same way as it usually would—despite your lack of internet connection, you still get the full experience, only the content shown will be stale. If you tried the same for a website, however, it wouldn’t load at all:\n  Chrome eases the pain of being offline with its hidden game (press space bar on desktop, tap the dinosaur on mobile). But we can do better.\n Service workers allow website authors to intercept all network requests to their websites, which means we can provide rich offline experiences, just like native apps. At the Guardian, we recently released a custom offline experience of our own. When users are offline they will see a Guardian branded page with a simple offline message and, for fun, a crossword to play while they wait for a connection. This blog post is about how we built it, but first, here’s how you can try it out for yourself.\n  You must be running a browser that supports the  Service Worker and  fetch  APIs. At the time of writing only Chrome (mobile and desktop) supports both of APIs, but support is coming in Firefox very soon (currently in the nightly build), and  all browsers except Safari have shown enthusiasm. Furthermore, service workers can only be registered for websites served over  HTTPS, which theguardian.com has started to move towards. Thus, we can only offer the offline experience for HTTPS sections of the website. For the time being, we have chosen the  developer blog as our testing ground. So, if you’re reading this on  our developer blog section of the website, you’re in luck.\n Once you’ve visited a page on our  developer blog in a supported browser, you’re all set. Disconnect your device from the internet and refresh. If you are unable to try it out for yourself,  take a look at this demo video.\n  We can instruct browsers to register our service worker as soon as the user arrives on the page with some simple JavaScript. Support for service workers is currently sparse, so we need to use feature detection to avoid any errors.\n  As part of the service worker’s install event, we can use the  new cache API to cache the various moving parts of our website, such as  HTML,  CSS, and  JavaScript:\n var staticCacheName = &#39;static&#39;;var version = 1;function updateCache() {    return caches.open(staticCacheName + version)        .then(function (cache) {            return cache.addAll([                &#39;/offline-page.html&#39;,                &#39;/assets/css/main.css&#39;,                &#39;/assets/js/main.js&#39;            ]);        });};self.addEventListener(&#39;install&#39;, function (event) {    event.waitUntil(updateCache());});\n Once install has completed, the service worker can listen to and control the fetch event, giving us full control over all future network requests incurred by the website.\n  To give you some idea of the flexibility we have here, we could construct our own response programmatically:\n self.addEventListener(&#39;fetch&#39;, function (event) {    var response = new Response(&#39;&lt;h1&gt;Hello, World!&lt;/h1&gt;&#39;,        { headers: { &#39;Content-Type&#39;: &#39;text/html&#39; } });    event.respondWith(response);});\n Or, we could respond with something from the cache if we can find a match for the given request, falling back to the network:\n self.addEventListener(&#39;fetch&#39;, function (event) {    event.respondWith(        caches.match(event.request)            .then(function (response) {                return response || fetch(event.request);            })    );});\n  Firstly, the HTML and resources needed for the offline page are cached by the service worker upon installation. Included in this cache is the  React  application we have developed for  our crossword pages. Thereafter we intercept all network requests to a web page on theguardian.com, including requests for subresources on those pages. The logic for handling these requests goes something like:\n If we detect the incoming request is a navigation to one of our HTML pages, we always want to serve the most up-to-date content, so we attempt to make the request over the network to the server.\n If the network request throws an error (i.e. failed because the user is offline), we catch this and instead respond with the cached HTML for the offline page.\n Else, if we detect the request is anything other than HTML, we will lookup the request in the cache.\n The resulting code, which uses the  new cache API (as part of the Service Worker API) and  fetch (for making network requests), is as follows:\n var doesRequestAcceptHtml = function (request) {    return request.headers.get(&#39;Accept&#39;)        .split(&#39;,&#39;)        .some(function (type) { return type === &#39;text/html&#39;; });};self.addEventListener(&#39;fetch&#39;, function (event) {    var request = event.request;    if (doesRequestAcceptHtml(request)) {        // HTML pages fallback to offline page        event.respondWith(            fetch(request)                .catch(function () {                    return caches.match(&#39;/offline-page.html&#39;);                })        );    } else {        // Default fetch behaviour        // Cache first for all other requests        event.respondWith(            caches.match(request)                .then(function (response) {                    return response || fetch(request);                })        );    }});\n  We have good reasons to be excited about these new browser technologies, because they can be used to give websites the same rich offline experiences we have in native apps today. In the future when theguardian.com has completed migration to HTTPS, the offline page will increase in significance and we can make further improvements to the offline experience. Imagine opening theguardian.com on your internet-less commute to work to find content personalised for you, downloaded and cached by the browser ahead of your visit. There is no friction involved in the installation step—unlike native apps which require users to have app store accounts for installation, all that’s needed on the web is to visit the website in question. Service workers can also help improve website load times, as the shell of a website can be cached reliably, just like in native apps.\n If you’re interested in learning more about service workers and what’s possible, Matt Gaunt, who is a Developer Advocate for Chrome, has written an  introduction to Service Worker which goes into more detail.", "posttime": "2020-07-26 02:09:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "脱机,offline,网站", "title": "为theGuardian.com构建脱机页面", "title_en": "Building an Offline Page for Theguardian.com", "transed": 1, "url": "https://www.theguardian.com/info/developer-blog/2015/nov/04/building-an-offline-page-for-theguardiancom", "via": "", "real_tags": ["脱机", "offline", "网站"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014164, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "{标题：密码学不是魔术描述：密码经常被视为一门黑术，只有受膏的专家才能希望安全地使用。它不是。法律是有的，我们可以学习。}2020年7月密码不是魔术=。&gt；损坏的密码通常看起来可以正常工作。&gt；构建密码的最好方法是学习如何破解它。&gt；使用现有的、经过审查、审阅良好的库。&gt；把它留给专家吧。_Infosec的人们和他们的追随者。_现在流行的主题似乎是，密码学是一种黑魔法，最好留给受膏的高级祭司。如果不先成为那些自吹自擂的专家中的一员，我们这些凡人就不能指望安全地完成这一任务--对于我们这些知道自己所处位置的人来说，这是一项了不起的努力。虽然这是一个很好的一级近似，但这种把门在很多层面上都是有问题的。首先，现实世界中的一些人有当前密码系统不能总是满足的需求。用你不知道自己在做什么来侮辱他们是无济于事的。其次，它有几个反常的影响：-它阻止了许多理性的人研究这个课题。-它导致不太理性的人无论如何都会[冲锋在前](电抗)。-如果密码学是一门艺术，我们可以边走边编。发明牢不可破的密码，决不是。[电抗]：https://en.wikipedia.org/wiki/Reactance_(psychology)(电抗)我想提倡一种不同的方法。密码学有一些规则，这些规则比我们想象的更简单，也更基本。我们可以告诉人们他们不知道什么，并给他们一些指导：入门[书籍][C101]或[课程][Boneh]，或者具体的单词和概念。在这里，我将概述您在推出自己的密码系统之前需要查找的内容。我已经确定了三大类：实现密码、设计协议和设计原语。[C101]：https://www.crypto101.io/[boneh]：https://crypto.stanford.edu/~dabo/courses/OnlineCrypto/_Note：这是一篇观点文章，所以让我澄清一下我来自哪里。我从2007年开始专业编程，4年前开始自学密码学。我编写了一个[密码库][Moncypher]，最近的[审核][]没有发现重大缺陷。_[审核]：https://cure53.de/pentest-report_monocypher.pdf[monocypher]：https://monocypher.org/Implementing Crypto-可能令人惊讶的是，实现加密原语&amp；协议需要的密码知识很少。*选择实现什么更加微妙(您需要了解最新技术)，但是一旦您做出了选择，您唯一担心的就是旁路和正确性。旁路有一条规则：不要让任何数据从秘密流向该通道。有趣的旁路包括定时、能耗、电磁辐射…。大多数时间都可以忽略(例如，能源消耗需要物理访问)，但计时除外。永远不要忽略计时，它们是大多数威胁模型的一部分。在大多数CPU上，可以通过删除所有秘密依赖分支和所有秘密依赖索引来消除计时侧通道。一些CPU还具有可变时间的算术运算。特别要注意公式和变量式的移位，也要小心编译器和解释器。没有主流语言指定如何生成恒定时间代码，因此您的工具可以在源代码没有的地方插入秘密依赖分支。高级语言尤其倾向于使用可变时间算术。在实践中，像C这样的低级语言是相当合理的，但我认为[Exceptions][].[Exceptions]：https://github.com/LoupVaillant/Monocypher/issues/25#issuecomment-356270587Note指出，某些原语比其他原语更容易受到恒定时间软件实现的影响：在大多数平台上，Chacha20倾向于自然地不受计时攻击，而AES则需要特别注意，如果你没有硬件支持，那么我们就有了正确性。最轻微的错误都可能把密码保证抛到窗外，所以我们不能容忍错误。您的代码必须是无错误的，句号。这并不容易，但很简单：这一切都是关于测试和证明。#密码和散列的正确性密码和散列相当容易测试。他们的核心是接受一个输入，然后彻底地破坏它，以至于输入的最轻微的变化都会完全扰乱输出。在实践中，最轻微的编程错误往往会完全改变最终结果，您所要做的就是将原语的输出与引用实现或测试向量进行比较。理想情况下，对所有可能的输入和输出长度执行此操作。_包括零(空输入)_。实际上，您可以在最大的内部循环的两次迭代处停止，以确保命中所有数据路径。如果您有一个初始化-更新-最终接口，请尝试更新中所有可能的切断点，以确保获得相同的结果。I&#39", "note_en": "{ title: Cryptography is not Magic description: Crypto is often treated like a black art only anointed experts can hope to wield safely. It&#39;s not. There are laws, and we can learn them.}July 2020Cryptography is not Magic=========================&gt; Don&#39;t roll your own crypto. &gt; Broken crypto often looks like it works. &gt; The best way to build crypto is to learn how to break it. &gt; Use existing, vetted, well reviewed libraries. &gt; Leave it to the experts._Infosec people and their followers._The running theme seems to be that cryptography is a kind of Dark Magic,best left to anointed High Priests. Us mere Mortals cannot hope towield it safely without first becoming one of those vaunted Experts —afutile endeavour for those of us who know their place.While being a good first order approximation,that kind of gate keeping is problematic on an number of levels. First,some people back in the real world have needs that current cryptosystems don&#39;t always fill. Insulting them with &#34;you don&#39;t know what youare doing&#34; does not help. Second, it has a couple perverse effects:- It stops many reasonable people from studying the subject.- It causes less reasonable people to [charge ahead][reactance] anyway.- If cryptography is an Art, we could make things up as we go along. And invent &#34;unbreakable&#34; ciphers that are anything but.[reactance]: https://en.wikipedia.org/wiki/Reactance_(psychology) (Reactance)I would like to advocate a different approach. Cryptography has rules,which are both simpler and more fundamental than we might think. Wecould tell people _what_ they don&#39;t know, and give them some pointers:introductory [books][C101] or [courses][boneh], or specific words andconcepts. Here, I will outline what you need to look for before youroll your own crypto system. I&#39;ve identified 3 broad categories:implementing crypto, designing protocols, and designing primitives.[C101]: https://www.crypto101.io/[boneh]: https://crypto.stanford.edu/~dabo/courses/OnlineCrypto/_Note: this is an opinion piece, so let my clarify where I came from. Iprogram professionally since 2007, and started to teach myselfcryptography 4 years ago. I wrote a [crypto library][monocypher], whoserecent [audit][] uncovered no major flaw._[audit]: https://cure53.de/pentest-report_monocypher.pdf[monocypher]: https://monocypher.org/Implementing crypto-------------------Perhaps surprisingly, implementing cryptographic primitives &amp; protocolsrequires little cryptographic knowledge. *Choosing* what to implementis more delicate (you need to know the state of the art), but onceyou&#39;ve made your choice, your only worries are side channels andcorrectness.Side channels have one rule: don&#39;t let any data flow from secrets tothat channel. Interesting side channels include timings, energyconsumption, electromagnetic emissions …Most can be ignored most of thetime (energy consumption for instance requires physical access), excepttimings. Never ignore timings, they&#39;re part of most threat models.On most CPUs, the timing side channel can be eliminated by removing allsecret dependent branches and all secret dependent indices. Some CPUsalso have variable time arithmetic operations. Watch out formultiplications and shifts by variable amounts in particular.Also be careful around compilers and interpreters. No mainstreamlanguage specifies how to make constant time code, so your tools couldinsert secret dependent branches where the source code had none. Highlevel languages in particular tend to have variable time arithmetic. Inpractice, low level languages like C are fairly reasonable, but I&#39;veseen [exceptions][].[exceptions]: https://github.com/LoupVaillant/Monocypher/issues/25#issuecomment-356270587Note that some primitives are more amenable to constant time softwareimplementations than others: Chacha20 tends to be naturally immune totiming attacks on most platforms, while AES requires special care if youdon&#39;t have hardware support.Then we have correctness. The slightest error may throw cryptographicguarantees out the window, so we cannot tolerate errors. Your code mustbe bug free, period. It&#39;s not easy, but it _is_ simple: it&#39;s all about_tests_ and _proofs_.### Correctness of ciphers and hashesCiphers and hashes are fairly easy to test. At their core, they areabout taking an input, and mangle it so thoroughly that the slightestchange in the input will completely garble the output. In practice, theslightest programming error tend to change the end result completely.All you have to do is compare the output of your primitive with areference implementation or test vectors. Ideally, do that for allpossible input &amp; output lengths. _Including zero (empty inputs)_.Practically, you can stop at a couple iterations of your biggestinternal loop, to be sure you hit all data paths.If you have an init-update-final interface, try all possible cut-offpoints in the updates to make sure you get the same results. I&#39;vecaught several bugs that way.### Correctness of modular arithmeticModular arithmetic (polynomial hashes, elliptic curves …) is moredelicate. Now we&#39;re adding or multiplying big numbers (130 bits, 255bits …) that do not fit in a single machine register. Many librariesdon&#39;t run in constant time, and custom code is often faster. So youend up dividing those big numbers in several _limbs_, which can fit in asingle machine register._(You can think of a limb as a huge digit: instead of working in base10, we can work in base 2³², and store the corresponding &#34;digits&#34; in32-bit registers.)_Once you&#39;ve applied the precautions used for ciphers and hashes, thebiggest trap is _limb overflow_. Not a problem with naiveimplementations, but there is one dangerous trick that often drasticallyimproves performance: _delayed carry propagation_. Make your limbssmaller than the range of the registers they are stored into (26 bitslimbs with 32 bits registers for instance), so that they can temporarilyexceed their normal range.With this trick, some overflow bugs happen rarely enough that randomtests will not catch them. There are two ways to address the problem:either don&#39;t delay carry propagation to begin with (it&#39;s safest), orwrite a mathematical proof that shows your algorithm never triggers anoverflow. Ideally you&#39;d have a machine verify that proof.### Correctness of elliptic curvesElliptic curves have their own traps. If you have explicit formulastelling you what arithmetic operation to perform in what order, noproblem (beyond comparing to a reference implementation and limboverflow). If you want to be clever, make sure you know _exactly_ whatyou are doing. If you see some mathematical term you haven&#39;t seenbefore (like &#34;[birational equivalence][BE]&#34;), don&#39;t guess, _look it up_.I broke that rule once, and it [wasn&#39;t pretty][vuln].[BE]: https://crypto.stackexchange.com/questions/43013/what-does-birational-equivalence-mean-in-a-cryptographic-context (Stack Exchange)[vuln]: https://monocypher.org/quality-assurance/disclosures (My biggest mistake)Also note that Elliptic curves often require conditional selection,swapping, or even lookups. There are techniques to do that in constanttime. Use them. Failing to do so has enabled actual exploits.### Correctness of constructions &amp; ProtocolsConstructions and protocols are generally much simpler to implement thantheir underlying primitives. The same precautions applies, with acouple differences:- Don&#39;t forget the checks. If the protocol says you must abort upon a certain condition, you _absolutely must_. Failing to check something almost certainly destroys the security properties of the protocol or construction you are implementing.- Try the protocol (or construction) with corrupted inputs. Corrupt every single byte, perhaps every single _bit_, one by one, and test whether this causes the protocol to abort. If it doesn&#39;t, you may have forgotten a check.- That&#39;s a corollary from &#34;no conditional branches&#34;, but it bears repeating: when you compare buffers, use constant time code. Crypto libraries generally provide the comparison routines you need.Designing protocols-------------------That&#39;s where things become interesting. Where implementing crypto wasmostly tedious, designing protocols is _delicate_. One is notnecessarily harder than the other, but they&#39;re very different.This is no longer about faithfully implementing an unambiguousspecification. This is about addressing a _threat model_. This meansbeing aware of what you&#39;re up against, addressing that threat, andproving that you have done so. On top of that, the protocol shouldallow, even encourage, good APIs that are hard to misuse.### Threat modelWe need to realistically and _precisely_ define the capabilities of theadversary. A typical threat model is the untrusted network, where theadversary can [basically do anything][DYM]: watch messages, interceptmessages, forge messages, replay messages …[DYM]: https://en.wikipedia.org/wiki/Dolev%E2%80%93Yao_model (Dolev-Yao model)Some adversaries can also steal your keys. Maybe the police comes witha warrant. Maybe your computer is being hacked. You can limit thedamage with [forward secrecy][] (messages sent before the key was stolencan&#39;t be decrypted), and _key compromise impersonation resistance_(where stealing your keys don&#39;t allow the attacker to impersonate_others_ when they are talking _to you_).[forward secrecy]: https://en.wikipedia.org/wiki/Forward_secrecy (Wikipedia)Yet another threat is meta data analysis. Maybe you want to hide youridentity to outsiders. Some protocols achieve some measure of_anonymity_, where it is hard for the attacker to determine who istalking to whom.Or maybe you fear _traffic analysis_, where the size and timings of themessages reveal too much about the content. You could mitigate that bypadding your messages to some standard size, or even send a constantstream of data, and fill the bandwidth you don&#39;t use with noise.### ProofsOnce you know your threat model, you need to demonstrate that yourprotocol addresses it. For instance, when the adversary is an untrustednetwork, you need [IND-CCA2][] (indistinguishability under adaptivechosen ciphertext attack). It&#39;s a formalisation of what you need tocombat active adversaries (man in the middle). It&#39;s defined thus:[IND-CCA2]: https://en.wikipedia.org/wiki/Ciphertext_indistinguishability (Wikipedia)- We allow the adversary to ask an _Oracle_ to encrypt or decrypt anything they please.- At any point, the adversary can issue a challenge, where they provide _two_ plaintexts, and the oracle responds with only _one_ ciphertext.- IND-CCA2 is achieved if the adversary cannot tell which plaintext the ciphertext is from, without asking for a decryption of that particular ciphertext.Let&#39;s try an example with _passive_ adversaries, for which we only needIND-CPA: independence under chosen _plaintext_ attack. It&#39;s the same asIND-CCA2, except we don&#39;t have the decryption oracle.Alice needs to send messages to Bob, using a shared secret key `K0`, anda stream cipher `Stream` that takes a key as input, and outputs anarbitrarily long key stream. (Real stream ciphers also have a[nonce][], but we&#39;ll make do without one for the sake of the exercise.)To send her messages, Alice will use _key erasure_, or _ratchet_:[nonce]: https://en.wikipedia.org/wiki/Cryptographic_nonce (Wikipedia) K1, S1 = Stream(K0) msg1 = plaintext XOR S1 K2, S2 = Stream(K1) msg2 = plaintext XOR S2 K3, S3 = Stream(K2) msg3 = plaintext XOR S3 ...To send a message, we first split the key stream in two parts: a newencryption key, and a data stream. Note that `K1` is the first bytes of`Stream(K0)`, and `S1` is the rest, so they&#39;re independent from eachother. Same for `K2` and `S2`, etc. We can&#39;t break that one with theencryption oracle alone (IND-CPA). Here&#39;s why:- For any `n`, if `K(n)` is an independent random string, then so are `K(n+1)` and `S(n+1)`, which come from `Stream(K(n))`- `K0` is an independent random string.- Corollary: `S1`, `S2`, `S3` …are all independent random strings. As a whole, they act like a [one time pad](OTP).- Conclusion: there is no relation whatsoever between different ciphertexts. To the attacker, they all look like independent random strings. When the attacker submits its challenge, the answer will be just as random, and there will be no way to tell which plaintext it came from.[OTP]: https://en.wikipedia.org/wiki/One-time_pad (Wikipedia)Not the most rigorous proof. That will do for this simple constructionunder this simple threat model, but a more complex protocol may nottolerate as much hand waving. And if you want a machine to check yourproof (a good thing to strive for), it&#39;ll have to be perfect.Another limitation is my choice of the _symbolic model_: I am assumingthe stream cipher is unbreakable, and will always be indistinguishablefrom a true random number generator to anyone who doesn&#39;t know the key.Works well enough for most purposes, but keep in mind that realcryptographic primitives aren&#39;t perfect: they can&#39;t generate a genuinelyinfinite stream without repeating themselves, and a finite amount ofcomputing work is enough to break them. Those limits are high enough tobe ignored in many cases, but depending on the primitive you use, andwhat you use them for, they may not be.The biggest limitation of all of course is that we only proved IND-CPAhere. This construction is only immune to _passive_ attackers, thatonly listen and never talk. What we really want is to protect against_active_ attackers, that could perform a full Man in the Middle attack.A chosen ciphertext attack easily destroys our construction:- Send the challenge with the plaintexts `p1` and `p2`. Get back the ciphertext `c`.- Generate some non-null string `r`.- Ask the oracle to decrypt `c XOR r`, get the plaintext `p` back.- Compute `p XOR r`. It will be equal to `p1` or `p2`, depending on which it came from.We basically tricked the oracle into decrypting the challengeciphertext, without breaking the rules: we didn&#39;t _directly_ asked todecrypt `c`, we only took advantage of [ciphertext malleability][CM] to getaround the restriction. To avoid this, we need [authentication][MAC],which I&#39;ll leave as an exercise to the reader for brevity&#39;s sake.[CM]: https://en.wikipedia.org/wiki/Malleability_%28cryptography%29 (Wikipedia)[MAC]: https://en.wikipedia.org/wiki/Message_authentication_code (Wikipedia)### APIThe proper way to achieve IND-CCA2 is to first encrypt the plaintext,_then_ compute an authentication tag over the ciphertext.Encrypt-then-mac. We could instead authenticate the _plaintext_, andonly then encrypt the whole thing (including the authenticationtag). Mac-then-encrypt. It can be done correctly, and we can even proveIND-CCA2. It is also a [bad idea][CDP].[CDP]: https://moxie.org/2011/12/13/the-cryptographic-doom-principle.html (Cryptographic Doom Principle)Ideally, we want the recipient to verify first. This has someadvantages:- No time lost decrypting corrupted messages.- No memory allocated or overwritten for corrupted messages.- No temptation to provide a detached API in two steps, where the users could forget the authentication step.What your users need is _authenticated encryption_, where decryptioneither successfully decrypts the message, or does nothing at all. That&#39;sthe only way you can be sure no information will leak because ofcorrupted messages.In fact, &#34;success or nothing&#34; is a rule I try generalise to all my APIs:check the inputs, _then_ act on them. If the inputs are wrong, don&#39;t doanything, just return an error to the caller.Designing primitives--------------------That&#39;s the tough one. There&#39;s generally no way to prove that a givenprimitive is indeed as secure as it claims to be. There&#39;s an obvioustension between performance and security, and designing something assecure _and_ as fast as the state of the art is not trivial to say theleast.I have also no experience in the domain. I can only give a fewpointers, that will hopefully make you realise what it means to stareinto the abyss.### Symmetric cryptoAll ciphers and hashes I know are designed around a core _permutation_:mangling the hell out of a block of data to produce a pseudo-randomresult:- __Hashes__ use that permutation to build a _compression function_, whose output is shorter than the sum of its inputs, then repeatedly use it to compress arbitrarily long messages into short digests.- __Block ciphers__ are like a compression function (with the key and a piece of data as input), except it&#39;s reversible if you have the key.- __Stream ciphers__ are something of a blend between hashes and block ciphers: they mix the key and some input (often a nonce and counter) to output a random piece of data, but they don&#39;t need to be reversible.- __Password hashes__ are their own beast. They&#39;re designed to require huge amounts of resources to make it harder to brute force passwords, so the underlying permutations tend to be very different.Some permutations (Keccak, Xoodoo, Gimli …) are designed to rule themall, but they don&#39;t have to. The most popular ciphers and hashes havetheir own permutation, tailored just for them. Chacha20&#39;s permutationfor instance produces zero when the input is all zero. Not very random,but we don&#39;t care, because the input is never zero: part of it is aconstant, that aims to &#34;break symmetry&#34;.Speaking of which: before you make a serious attempt at designing yourhash, cipher, or permutation, there are some terms and concepts youprobably should be deeply familiar with:- __Indistinguishability.__ Basically what we ask of most ciphers and hashes: the output must be indistinguishable from random under some conditions (like not knowing the keys). The primitive is broken if we find a &#34;distinguisher&#34;.- __Memory hardness.__ Good password hashes are optimised to require lots of resources. Our machines have lots of RAM, we want to use it so brute-force guesses are more expensive. The idea is to make honest verifications fast enough to be tolerable, and dishonest guesses as expensive as possible (ideally as expensive as a honest verification, even if the attacker can use custom hardware).- __Cache hardness.__ Our machines have a fast cache hierarchies. We could as well take advantage of it, make brute-force guesses even more expensive without slowing down honest attempts.- __Rounds.__ Permutations are generally about repeating a core permutation, the &#34;round&#34;, several time to achieve security. Chacha20 for instance repeats its core loop 20 times. Each round is strictly speaking a permutation, but we don&#39;t call them that.- __Security margin.__ Cryptographic literature shows that increasing the number of rounds in a primitive makes it harder to break. So when we study a primitive, we try and break weaker versions, with fewer rounds. The security margin of a primitive is the difference between the minimum number of rounds required to thwart all known attacks, and the actual number of rounds. Chacha20 for instance has a margin of 12 rounds: as of 2020, 8 rounds stop all known attacks, and we have 20.- __Confusion.__ It&#39;s how many bits of input you need to define a bit of output. If I wave my hands a lot, the higher the confusion, the more effective a single round is at contributing to security.- __Diffusion.__ It&#39;s the ability of a permutation round to propagate a change from the input to the output. Like confusion, higher diffusion increases the security contribution of a single round (if I wave my hands a lot).- __Symmetry.__ I&#39;m not familiar with the term myself. I believe it refers to algebraic properties of a permutation, which can help cryptanalysis in some conditions. It must be &#34;broken&#34;, or otherwise be rendered inexploitable to get a secure res\n......", "posttime": "2020-07-26 02:09:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "密码,密码学,cryptography", "title": "密码学不是魔术", "title_en": "Cryptography Is Not Magic", "transed": 1, "url": "http://loup-vaillant.fr/articles/crypto-is-not-magic", "via": "", "real_tags": ["密码", "密码学"]}, {"category": "", "categoryclass": "", "imagename": "11f09469245c2e30f8f10ed00b5647a7.jpg", "infoid": 1014162, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "编者按：在接下来的五年里，美国最有经验的大多数教师都将退休。婴儿潮一代正在离开一个由更多新手教育家组成的国家。在1988年，一名教师通常有15年的工作经验。不到三十年后，这个数字下降到只有三年，领先一个教室。“大西洋月刊”的“论教学”项目正在全国各地与资深教育工作者交谈。这个故事是我们系列的第18篇。\n2001年秋天，我拿着本科理科学位和匆忙的教师资格证，站在布朗克斯区一片黑棕色相间的中学生面前，宣布我是他们的老师。开学第一天，我告诉他们，“这是我的课。我要教你们科学和数学。你会倾听，你会努力工作，你会尊重别人。“。我对着镜子练习这些台词已经好几个星期了。我的肩膀向后仰，双手插在口袋里，我的老师的怒容也变得完美起来。我被告知的关于如何教学的一切-只有在安静、封闭的教室里才能取得成功，你必须坚持不懈地保持-都包含在这几行字中。\n几周后，我正走在教室的过道上，而我的学生们正在安静地做数学题，这时响亮的警报器开始穿透墙壁。我以为那只是另一辆警车或救护车，就冲我的学生大喊，让他们集中注意力。在那一刻，确保他们不会屈服于分心是我最大的担忧。但警报声持续的时间比往常更长。学生们忧心忡忡地抬头看着我，我皱起了眉头，迫使他们的眼睛回到了笔记本上。我知道没有发生数学运算，但只要眼睛不离开书页，我就觉得自己成功了。然后电话铃响了。\n电话另一端的声音告诉我，有两架飞机撞上了世贸中心。家长们冲进校舍，想把孩子带回家。我被告知要让学生们集中注意力，不要告诉他们发生了什么事。我班上的一个学生，被警笛和混乱吓坏了，问她能不能给她妈妈打个电话。我说了不行。\n在接下来的几周里，像恐怖分子和炸弹袭击者这样的词成为了共同语言。不止一次，我听到教室里的三名穆斯林学生说这些话，但我只是告诉那些挥舞着他们的学生注意他们的语言，继续教学。\n我通过针对穆斯林学生的暴力来授课，并利用我从学校得到的默许来为我的不作为辩护。我忽略了教室之外世界的混乱，因为我相信继续教学是我的工作。现在回想起来，我意识到我其实根本不是在教书。\n在2001年9月11日之后的近20年里，冠状病毒大流行已经成为另一个警报器，撕裂了我们共同的常态。我们正在应对这种病毒，并调整我们的远程学习方法。但制度性种族主义也是致命的，而且更加普遍。谋杀乔治·弗洛伊德的警官德里克·肖文(Derek Chauvin)有种族主义病毒的症状。但在教室里，老师总是比喻地把膝盖放在年轻人的脖子上-他们的症状并不总是那么明显。我知道这个，因为我也感染了病毒。\n最好的老师不只是继续教书。取而代之的是，他们用自己的教学方法来抗议：他们破坏了伤害弱势学生的教学规范。自2001年以来，在我的课堂上，我学到了一些关于如何做到这一点的知识。我称它为现实教育学，因为它是关于到达学生真正所在的地方，确保他们的生活和背景在课程和课堂对话中得到反映。\n现实教育学打破了教学就是管理学生及其行为的观念。取而代之的是，我学会了将他们视为合作老师，我创造了对话的空间-在课堂外以小组形式-关于他们如何体验课堂和课堂以外的世界。这是一个交流的空间，也是他们对我的教学的任何批评的地方。这些对话对参与其中的每个人都是有益的。教师需要学生的反馈，他们可以看到教师在盲目追求平静、宁静的课堂时被训练忽略了什么。学生们需要一种代理感，而这一点他们经常被拒绝。\n合作教学要求教师足够谦虚，成为学生的学生-特别是那些受到最大伤害的学生，并将从老师听取他们的经验中受益最大。在我执教的头几年里，我从来没有问过我的学生们，当他们周围的世界变得疯狂时，他们不得不坐着学习的想法。我没有腾出空间让我的穆斯林学生从被攻击中恢复过来。但如果我开始了对话，我就会从他们那里学到很多关于我如何成为一名更好的老师的知识。\n当学生有了这样的中介机构时，教室就可以开始像一个家庭-甚至是一个小社会一样发挥作用。我给我所有的学生一种课堂责任，这一责任计入他们的成绩，涉及到照顾物理教室和彼此之间的关系。我对课堂上采取的所有行动都实行民主决策：学生帮助决定我们做什么作业，我们花多长时间在活动上，以及讨论什么。课堂可以作为世界应该是什么样子的一个例子-所有的学生都拥有平等的权力，无论他们的文化或背景如何-而不是复制它是什么。\n现实教育学涉及将学术内容与世界上发生的影响学生的事件联系起来。课程可以具体提到年轻人来自的社区，他们和他们的家人受到伤害的不平等，以及社区中的抗议活动。但这并不意味着这些教训总是严肃的。学生们可以通过艺术、游戏和音乐比赛来展示他们的知识。我已经创建了像科学天才大赛这样的项目，年轻人写关于他们生活中发生的科学内容和事件的说唱，并竞争成为最好的科学家、说唱歌手和讲故事的人。教室--尤其是对黑人青年来说--不应该让他们感觉像是一个警察或沉默的地方。黑人的快乐可以成为日常学习的一部分。\n所有的老师有时都会失败。但这就是为什么我们必须在课堂上准确地看到自己的原因。我建议教师将他们的教学录制下来供学习，这样他们就可以自我诊断出他们可能正在遭受的种族主义病毒，并在无意中传播。\n2001年，我认为好的教学意味着向举止“得体”的学生传授内容知识。在2020年，我知道这是不够的。我学会了将我的课堂视为一个赋予学生权力和改变社会的平台，并将我的教学方法作为抗议让学生保持沉默的规范的一种形式。与其说是牺牲内容知识，不如说是参与其中的学生，他们的声音被听到了，他们更有能力学习这些知识。\n一种抗议特权的教学法，即使学校时间表上说没有时间，也要与学生对话。它为年轻人创造了教授他们生活的空间，即使课程说没有空间。它的重点是建立社区和家庭，即使学校行政部门告诉教师不要与学生表达情感。如果老师们想要像应对冠状病毒大流行一样应对种族主义，他们可以从这里开始--在他们自己的教室里。\n本文是我们“关于教学”项目的一部分，该项目得到了威廉和弗洛拉·休利特基金会、斯宾塞基金会、比尔和梅琳达·盖茨基金会和潘塔·瑞亚基金会的资助。\n我们想听听您对这篇文章的看法。向编辑提交一封信，或写信给letters@theatlantic.com。\n是哥伦比亚大学师范学院的科学教育学教授，也是“为那些在兜帽里教书的白人”一书的作者。Y&#39；的其他人也是如此。", "note_en": "Editor’s Note: In the next five years, most of America’s most experienced teachers will retire. The Baby Boomers are leaving behind a nation of more novice educators. In 1988, a teacher most commonly had 15 years of experience. Less than three decades later, that number had fallen to  just three years leading a classroom. The Atlantic’ s “On Teaching” project is crisscrossing the country to talk to veteran educators. This story is the 18th in  our series.\n    In the fall of 2001, armed with an undergraduate science degree and a rushed teaching credential, I stood in front of a sea of Black and brown middle-school students in the Bronx and announced that I was their teacher. On the first day of school, I told them, “This is  my class. I am going to be teaching you science and math. You will listen, you will work hard, and you will be respectful.” I had practiced these lines in the mirror for weeks. My shoulders were back, my hands were in my pockets, and my teacher scowl had been perfected. Everything I had been told about how to teach—that success was only attained in a quiet, contained classroom, and you had to be tough to maintain it—was contained in those few lines.\n A few weeks later, I was walking the aisles of the classroom while my students were working quietly on math problems, when loud sirens began to penetrate the walls. Thinking it was just another police car or ambulance, I yelled at my students to  focus. In that moment, ensuring that they were not yielding to distractions was my biggest concern. But the sirens persisted for longer than usual. Students looked up at me with concern; my brows tightened in a scowl that forced their eyes back to their notebooks. I knew that no math was happening, but as long as no eyes were lifted from the page, I felt successful. Then the phone rang.\n    The voice on the other end informed me that two airplanes had crashed into the World Trade Center. Parents were storming the school building and wanted to take their children home. I was told to keep the students focused and not tell them that anything was happening. One student in my class, scared by the sirens and the confusion, asked if she could call her mother. I said no.\n  In the weeks that followed, words like  terrorist and  bomber became common language. On more than one occasion, I heard those words hurled at the three Muslim students in my classroom, but I just told the students who had wielded them to watch their language and kept on teaching.\n I taught through violence against Muslim students and used the permission I tacitly received from the school to justify my inaction. I ignored the chaos of the world beyond the classroom because I believed that it was my job to just keep on teaching. Looking back now, I realize I was not actually teaching at all.\n Almost 20 years after September 11, 2001, the coronavirus pandemic has emerged as another siren, tearing through our collective sense of normal. We are responding to this virus and adjusting our methods for remote learning. But institutional racism is also deadly, and it’s even more widespread. Derek Chauvin, the police officer who murdered George Floyd, had a symptomatic case of the racism virus. But teachers place metaphorical knees on the necks of young people in classrooms all the time—and their symptoms aren’t always as obvious. I know this because I had the virus, too.\n  The best teachers don’t just keep teaching. Instead, they use their pedagogy as protest: They disrupt teaching norms that harm vulnerable students. In my years in the classroom since 2001, I’ve learned something about how to do this. I call it  reality pedagogy, because it’s about reaching students where they really are, making sure that their lives and backgrounds are reflected in the curriculum and in classroom conversations.\n Reality pedagogy interrupts the notion that teaching is about managing students and their behavior. Instead, I’ve learned to see them as co-teachers, and I create space for dialogue—in small groups outside of class—about how they experience the classroom and the world beyond it. It’s a space for connection, but also for any critiques they have of my teaching. These conversations are generative for everyone involved. Teachers need feedback from their students, who can see what teachers have been trained to ignore in their blind pursuit of a calm, quiet classroom. And students need a sense of agency, which they are often denied.\n  Co-teaching requires that teachers be humble enough to become students of their students—especially the students who have been most harmed, and will benefit most from a teacher listening to their experiences. In my first years of teaching, I never asked to hear my students’ thoughts about having to sit and learn while the world around them was going crazy. I didn’t make space for my Muslim students to heal from being targeted. But if I had started that dialogue, I would have learned a lot from them about how I could have been a better teacher.\n    When students have this kind of agency, a classroom can start to function like a family—or even a small society. I give all of my students a classroom responsibility that counts toward their grades and involves taking care of the physical classroom and each other. And I institute democratic decision making for all actions taken in the classroom: Students help to decide what assignments we work on, how long we spend on activities, and what to discuss. The classroom can serve as an example of what the world should look like— all students with equal power, regardless of their culture or background—rather than a replication of what it is.\n  Reality pedagogy involves connecting academic content to events happening in the world that affect students. The curriculum can weave in specific references to the neighborhoods where young people are from, inequities that they and their families are hurt by, and protests in the community. But that doesn’t mean these lessons are always serious. Students can compete to show their knowledge through art, games, and music. I have created projects like the  Science Genius competition, where young people write raps about science content and events happening in their lives and compete to be the best scientist, rapper, and storyteller. The classroom—especially for Black youth—should not feel like a place where they are policed or silenced. Black joy can be a part of daily learning.\n All teachers will sometimes fail. But that’s why we have to accurately see ourselves in the classroom. I suggest that teachers  videotape their teaching for study, so they can self-diagnose for the racism virus they may be suffering from and spreading unintentionally.\n  In 2001, I thought that good teaching meant delivering content knowledge to students who were behaving “appropriately.” In 2020, I know that is not enough. I’ve learned to see my classroom as a platform for empowering students and transforming society, and to use my pedagogy as a form of protest against norms that silence students. Far from sacrificing content knowledge, engaged students, whose voices are heard, are better able to learn it.\n A pedagogy of protest privileges dialogue with students even when the school schedule says there is no time for it. It creates space for youth to teach about their lives even when the curriculum says there is no space for it. It focuses on building community and family even when the school administration tells teachers not to express emotion with students. If teachers want to respond to racism as they’ve responded to the coronavirus pandemic, they can start here—in their own classrooms.\n  This article is part of our project “On Teaching,” which is supported by grants from the William and Flora Hewlett Foundation, the Spencer Foundation, the Bill &amp; Melinda Gates Foundation, and the Panta Rhea Foundation.\n  We want to hear what you think about this article.  Submit a letter to the editor or write to letters@theatlantic.com.\n         is a professor of science education at Teachers College, Columbia University, and the author of   For White Folks Who Teach in the Hood ... and the Rest of Y&#39;all Too.", "posttime": "2020-07-26 02:09:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "管理,isn,学生", "title": "教学不是关于管理行为的", "title_en": "Teaching Isn’t About Managing Behavior", "transed": 1, "url": "https://www.theatlantic.com/education/archive/2020/07/reality-pedagogy-teaching-form-protest/614554/", "via": "", "real_tags": ["管理", "isn", "学生"]}, {"category": "", "categoryclass": "", "imagename": "644165414a979a620976d907bad8120f.png", "infoid": 1014161, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "卓越的开发人员工作效率。穿越测地线。代码行数更少。漂亮的热重装。一个简单的动态模型。受控效果，包括状态。纯函数。各式各样的陈述性的。", "note_en": "Exceptional developer productivity. Travel the geodesic. Fewer lines of code. Beautiful hot reloading. A simple dynamic model. Managed effects, including state. Pure functions. Variously declarative.", "posttime": "2020-07-26 02:08:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "frame,开发人员", "title": "重定帧1.0", "title_en": "Re-Frame 1.0", "transed": 1, "url": "http://day8.github.io/re-frame/", "via": "", "real_tags": ["frame", "开发人员"]}, {"category": "", "categoryclass": "", "imagename": "b0cb2a7ee2b959af2718b567f8352331.jpg", "infoid": 1014158, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于iOS14的一项新功能，我们已经在这里介绍了一些在访问用户剪贴板时被抓到的应用程序，但这还不是全部。苹果移动操作系统的下一次重大更新还会显示应用程序何时使用摄像头或麦克风，而这也刚刚曝光了Instagram的应用程序。\n根据已经安装了iOS14的用户在社交网络上分享的一些报告，当Instagram应用程序打开时，摄像头的指示灯一直亮着。即使用户没有使用相机，在浏览照片源时，绿点也会显示应用程序正在后台访问相机。\n当然，预期的行为是，应用程序只在必要时才访问摄像头-比如当你打开Instagram Stories Composer时。然而，Instagram告诉The Verge，这种行为只是一个漏洞。\n“我们只在您告诉我们访问您的相机时才访问您的相机-例如，当您在Feed之间滑动相机时。我们发现并正在修复iOS14Beta中的一个漏洞，该漏洞错误地表明一些人正在使用摄像头，而他们并没有使用，“这位发言人说。在这些情况下，我们不会访问您的摄像机，并且不会录制任何内容。\n据该公司称，系统有时会理解用户滑动手指打开了应用内摄像头，但情况并不总是如此。Instagram承诺在其iOS应用程序的未来更新中解决这个问题。\n漫不经心地浏览Instagram，突然出现了新的iOS 14摄像头/麦克风指示灯。然后，控制面板揭露了它背后的应用程序。这将改变一切。#iOS14 pic.twitter.com/EnTIRsqq3R。\nIOS14的隐私功能甚至还不能向公众开放，但它们已经给一些开发者带来了麻烦。最近，LinkedIn被起诉，因为在未经授权的情况下阅读用户剪贴板的内容被抓到-该公司还表示，这是一个漏洞。\nIOS14目前是测试版，预计将在今年秋天向所有人开放。\n您正在阅读的是朝九晚五的Mac--日复一日地发布有关苹果及其周边生态系统的新闻的专家们。请务必查看我们的主页以获取所有最新新闻，并在Twitter、Facebook和LinkedIn上关注9to5Mac以随时了解最新消息。不知道从何说起？查看我们的独家故事、评论、操作指南，并订阅我们的YouTube频道", "note_en": "We have already  covered here some apps that were caught accessing users’ clipboard thanks to a new feature of iOS 14, but that’s not all. The next major update to Apple’s mobile operating system also indicates when an app is using the camera or microphone, and that has just exposed Instagram’s app.\n  According to some reports shared on social networks by users who have already installed iOS 14, the camera’s indicator stays on when the Instagram app is open. Even if the user is not using the camera, as when scrolling through the photo feed, the green dot shows that the app is accessing the camera in the background.\n The expected behavior, of course, is for the app to access the camera only when necessary — such as when you open the Instagram Stories composer. However, Instagram told   The Verge that this behavior is just a bug.\n “We only access your camera when you tell us to — for example, when you swipe from Feed to Camera. We found and are fixing a bug in iOS 14 Beta that mistakenly indicates that some people are using the camera when they aren’t,” the spokesperson said. “We do not access your camera in those instances, and no content is recorded.”\n According to the company, the system sometimes understands that the user has swiped the finger to open the in-app camera, which is not always the case. Instagram promises to fix this problem in a future update of its iOS app.\n Casually browsing Instagram when suddenly the new iOS 14 camera/microphone indicator comes on. Then control panel ratted out the app behind it. This is going to change things.  #iOS14  pic.twitter.com/EnTIRsqq3R\n  The privacy features of iOS 14 aren’t even available to the general public yet, but they have already caused trouble for some developers. More recently,  LinkedIn was sued by being caught reading the content of the users’ clipboard without authorization — the company also says that was a bug.\n iOS 14 is currently available as a beta release and it’s expected to be available to everyone this fall.\n  You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Mac on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2020-07-26 02:08:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ios,caught,应用程序", "title": "Instagram发现在使用过程中一直开着iOS摄像头", "title_en": "Instagram caught keeping iOS camera on during usage", "transed": 1, "url": "https://9to5mac.com/2020/07/25/instagram-promises-to-fix-bug-after-being-exposed-by-always-accessing-the-camera-on-ios-14/", "via": "", "real_tags": ["ios", "caught", "应用程序"]}]