[{"category": "", "categoryclass": "", "imagename": "33524689075e7fb996d0ac07df6acdee.png", "infoid": 1072764, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GitLab企业版", "note_en": "GitLab Enterprise Edition", "posttime": "2022-02-13 00:53:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "甲板,files,企业", "title": "蒸汽甲板外壳（表面拓扑）的CAD文件", "title_en": "CAD files for the external shell (surface topology) of Steam Deck", "transed": 1, "url": "https://gitlab.steamos.cloud/SteamDeck/hardware", "via": "", "real_tags": ["甲板", "files", "企业"]}, {"category": "", "categoryclass": "", "imagename": "ee39280e5a24c39efb0ead7ed14b252c.jpeg", "infoid": 1072763, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "数学产生了人类历史上最美丽、最优雅的抽象概念，系统思考者能从它们的精确性中学到什么？\n有一个概念被称为“数学的不合理有效性”由物理学家尤金·维格纳（Eugene Wigner）提出，它指的是数学不合理地擅长表达自然世界的观点，而数学往往是由这种观点发展而来的…", "note_en": "Mathematics has produced some of the most beautiful and elegant abstractions in human history, what can system thinkers learn from their accuracy?\n  There’s a concept known as the “ unreasonable effectiveness of mathematics.” Coined by physicist Eugene Wigner, it refers to the idea that math is unreasonably good at expressing the natural world, that mathematics often developed…", "posttime": "2022-02-13 00:52:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "不合理,math,数学", "title": "数学的不合理之处在于语境独立", "title_en": "The Unreasonableness of Math Is Context Independence", "transed": 1, "url": "https://bellmar.medium.com/the-unreasonableness-of-math-is-context-independence-6826fd5f3515", "via": "", "real_tags": ["不合理", "math", "数学"]}, {"category": "", "categoryclass": "", "imagename": "791846789857aaf7e1e99bc00dbace60.png", "infoid": 1072762, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Plost使使用Vega Litelibrary构建公共绘图变得简单，但无需深入研究Vega Lite规范（除非你正在做一些棘手的事情），也无需将数据帧从长格式转换为宽格式（大多数Vega Lite绘图的祸根！）\n导入plost plost。线条图（my_dataframe，x=&#39；time&#39；，用于x轴的列的名称。y=&#39；stock#U value&#39；，用于数据本身的列的名称。color=&#39；stock#U name&#39；，用于线条颜色的列的名称。）\n很简单！但是如果你有一个&#34；宽格式&#34；这样的表格在现实中很常见：\n通常你&#39；d必须先用熊猫融化桌子，或者创建一个复杂的Vega Lite分层图。但是有了Plost，你只需要指定你想要什么&#39；我们正在努力完成，它将为您在内部融化数据：\n但我们&#39；你只是在表面上摸索。基本上，这个想法是Plost允许你为你最常见的需求制作漂亮的Vega Lite驱动的图表，而不必学习Vega Lite背后强大而复杂的语言。\n查看示例应用程序/文档，了解您可以做的其他精彩事情！", "note_en": "Plost makes it easy to build common plots using the Vega-Litelibrary but without having to delve into Vega-Lite specs (unless you&#39;re doingsomething tricky), and without having to melt your DataFrame from long format to wideformat (the bane of most Vega-Lite plots!)\n    import  plost plost. line_chart(  my_dataframe,  x = &#39;time&#39;,  # The name of the column to use for the x axis.  y = &#39;stock_value&#39;,  # The name of the column to use for the data itself.  color = &#39;stock_name&#39;,  # The name of the column to use for the line colors.)\n Simple enough! But what if you instead have a &#34;wide-format&#34; table like this, which issuper common in reality:\n  Normally you&#39;d have to  melt() the table with Pandas first or create a complexVega-Lite layered plot. But with Plost, you can just specify what you&#39;re tryingto accomplish and it will melt the data internally for you:\n    But we&#39;re just scratching the surface. Basically the idea is that Plost allowsyou to make beautiful Vega-Lite-driven charts for your most common needs, withouthaving to learn about the powerful yet complex language behind Vega-Lite.\n Check out the  the sample app / docs fora taste of other amazing things you can do!", "posttime": "2022-02-13 00:38:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "图库,deceptively,plost", "title": "Plost——一个看似简单的绘图库", "title_en": "Plost – a deceptively simple plotting library", "transed": 1, "url": "https://github.com/tvst/plost", "via": "", "real_tags": ["图库", "plost"]}, {"category": "", "categoryclass": "", "imagename": "b4e7117f981fdb82d44507f752f815b2.jpg", "infoid": 1072761, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当美国建立了一个将成为互联网的网络时，智利的程序员们正在建立自己的愿景。\n在Mashable关于数字时代系列的新三集中&#39；在《黑暗面，内核恐慌》中，我们探索了萨尔瓦多·阿连德开发的一个惊人先进的计算机网络&#39；这是20世纪70年代的智利。该网络被称为Cybersyn项目，是阿连德&#39；智利努力使智利经济现代化。它与后来成为互联网的美国网络并行发展，当时尼克松总统正试图破坏智利经济，推翻拉丁美洲第一位民选马克思主义领导人阿连德。\nCybersyn是一个惊人的成功，它由一位头脑发热的英国理论家斯塔福德·比尔设计，由一群年轻的革命程序员运营。智利的这个项目只使用了旧的电话线和封存的战前机器，就成功地建立了一个实时数据流，非常像今天的社交媒体新闻提要，监视和监控这个国家；从首都一个复古的未来主义控制室中解放工业。\n两年来，程序员们一直使用Cybersyn来对抗罢工和未遂政变，直到1973年9月，阿连德最终被奥古斯托·皮诺切特领导的军政府推翻。一个稳定、现代化的智利的梦想随着阿连德而破灭，第二个互联网的潜力也随着阿连德而破灭。第二个互联网是在一个完全不同的信息共享系统下并行构建和发展的。\n马沙布尔采访了曾在阿连德手下担任财政部长、后来在皮诺切特手下服刑三年的费尔南多·弗洛雷斯，以及赛博新项目运营总监劳尔·埃斯佩乔和斯塔福德啤酒公司的家人，让你们了解赛博新项目的梦想和失望。", "note_en": "While America made the network that would become the internet, programmers in Chile were building a vision of their own.\n            In Mashable’s new three-part episode of our series on the digital age&#39;s dark side,   Kernel Panic, we explore a startlingly advanced computer network developed in Salvador Allende&#39;s Chile of the 1970s. Called Project Cybersyn, the network was a centerpiece of Allende&#39;s effort to modernize the Chilean economy. It was developed in parallel with the American networks that would become the internet, at a moment in time in which President Nixon was trying to undermine the Chilean economy and overthrow Allende, the first democratically elected Marxist leader in Latin America.\n Cybersyn, designed by a farthinking British theorist named Stafford Beer and run by a cadre of young revolutionary programmers, was an astonishing success. Using little more than old telephone wires and mothballed pre-war machinery, the Chilean program managed to build out a real-time data stream very much like the social media newsfeed of today, watching and monitoring the country&#39;s industry from a retro-futuristic control room in the capital.\n For two years, the programmers used Cybersyn to battle strikes and attempted coups until finally, in September of 1973, Allende was overthrown by a military junta led by Augusto Pinochet. The dream of a stable, modernized Chile died with Allende, and so did the potential for a second internet, built in parallel and evolved under a totally different system of information sharing.\n Mashable speaks to Fernando Flores who served under Allende as finance minister before spending three years in prison under Pinochet, as well as Raul Espejo, operational director of Project Cybersyn, and the family of Stafford Beer to take you inside the dream and disappointment of Project Cybersyn.", "posttime": "2022-02-13 00:33:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "情报局,cia,智利", "title": "几乎有两个互联网。然后，中央情报局摧毁了一个", "title_en": "There were almost two internets. Then, the CIA destroyed one", "transed": 1, "url": "https://pk.mashable.com/tech/15002/there-were-almost-two-internets-then-the-cia-destroyed-one", "via": "", "real_tags": ["情报局", "cia", "智利"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072760, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在采访中，我们讨论了Nyxt，它的不同之处，以及我们对未来的愿景——包括构建完整的lisp系统的梦想。\n你喜欢这篇文章吗？注册我们的时事通讯，接收来自Lisp和浏览器世界的最新黑客新闻！", "note_en": "During the interview, we covered Nyxt, what makes it different, and what our vision is for the future - including the dream of building a complete lisp system.\n  Did you enjoy this article? Register for our newsletter to receive the latest hacker news from the world of Lisp and browsers!", "posttime": "2022-02-13 00:09:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "采访,production,lisp", "title": "制作中的口齿不清：采访Nyxt浏览器背后的人[视频]", "title_en": "Lisp in Production: an interview with the guys behind Nyxt Browser [video]", "transed": 1, "url": "https://nyxt.atlas.engineer/article/gavin-freeborn-interview.org", "via": "", "real_tags": ["采访", "lisp"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072759, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载PDF摘要：原则上，稀疏神经网络应该比传统的密集网络更有效。大脑中的神经元表现出两种类型的分裂；它们之间的联系很少，活动也很少。这两种类型的稀疏性，称为权重稀疏性和激活稀疏性，结合起来，可以将神经网络的计算成本降低两个数量级。尽管有这种潜力，今天&#39；由于传统的计算硬件无法有效地处理稀疏网络，因此s神经网络仅使用权重稀疏性就可以带来适度的性能优势。在这篇文章中，我们介绍了互补稀疏性，这是一种新技术，可以显著提高双稀疏网络在现有硬件上的性能。我们证明了我们可以实现高性能的运行重量稀疏网络，并且我们可以通过合并活动稀疏性将这些加速倍增。利用互补稀疏性，我们在FPGA上进行推理时，吞吐量和能量效率提高了100倍。我们分析了商业卷积网络（如ResNet-50和MobileNet V2）中典型的各种内核的可伸缩性和资源权衡。我们的互补稀疏性结果表明，权重加上激活稀疏性可以有效地扩展未来人工智能模型。", "note_en": "Download PDF  Abstract: In principle, sparse neural networks should be significantly more efficientthan traditional dense networks. Neurons in the brain exhibit two types ofsparsity; they are sparsely interconnected and sparsely active. These two typesof sparsity, called weight sparsity and activation sparsity, when combined,offer the potential to reduce the computational cost of neural networks by twoorders of magnitude. Despite this potential, today&#39;s neural networks deliveronly modest performance benefits using just weight sparsity, becausetraditional computing hardware cannot efficiently process sparse networks. Inthis article we introduce Complementary Sparsity, a novel technique thatsignificantly improves the performance of dual sparse networks on existinghardware. We demonstrate that we can achieve high performance runningweight-sparse networks, and we can multiply those speedups by incorporatingactivation sparsity. Using Complementary Sparsity, we show up to 100Ximprovement in throughput and energy efficiency performing inference on FPGAs.We analyze scalability and resource tradeoffs for a variety of kernels typicalof commercial convolutional networks such as ResNet-50 and MobileNetV2. Ourresults with Complementary Sparsity suggest that weight plus activationsparsity can be a potent combination for efficiently scaling future AI models.", "posttime": "2022-02-13 00:03:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "性能,网络,sparse", "title": "两个稀疏比一个好：稀疏网络的性能", "title_en": "Two sparsities are better than one: Performance of sparse-sparse networks", "transed": 1, "url": "https://arxiv.org/abs/2112.13896", "via": "", "real_tags": ["性能", "网络", "sparse"]}, {"category": "", "categoryclass": "", "imagename": "7ab986943e4cfbc970641a05711cd0bf.png", "infoid": 1072758, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你好对于所有的修补工、改装工、配件制造商，或者那些只想3D打印蒸汽甲板的人来说，这是个好消息。今天，我们正在制作Steam Deck外壳（表面拓扑）的CAD文件，可根据知识共享许可证下载。其中包括STP模型、STL模型和图纸（DWG），以供参考。你可以在这里找到这些文件。我们期待着看到社区创造了什么！", "note_en": "Hello! Good news for all the tinkerers, modders, accessory manufacturers, or folks who just want to 3D print a Steam Deck to see how it feels. Today we're making the CAD files for the external shell (surface topology) of Steam Deck available for download under a Creative Commons license. This includes an STP model, STL model, and drawings (DWG) for reference. You can find the files here. We're looking forward to seeing what the community creates!", "posttime": "2022-02-12 23:58:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "甲板,deck,模型", "title": "蒸汽甲板CAD文件现在可用", "title_en": "Steam Deck CAD files now available", "transed": 1, "url": "https://store.steampowered.com/news/app/1675180/view/3106923225208810470", "via": "", "real_tags": ["甲板", "deck", "模型"]}, {"category": "", "categoryclass": "", "imagename": "0b63b8991bda2899de02c5dd0e3e6ae8.jpg", "infoid": 1072757, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天早些时候，参议院司法委员会投票通过了危险的“挣到钱”法案。我们很失望地看到委员会推进了这个被误导的法案。如果该法案获得通过，将对大大小小的互联网公司施加巨大的法律压力，要求它们停止使用加密，转而扫描所有用户信息、照片和文件。\n该法案现在可以在任何时候由参议院全体议员投票表决，或者更糟的是，作为另一个“必须通过”的立法方案的一部分。我们需要你们今天联系你们在国会的代表，让他们投票反对这项法案。\n我们已经扩大了我们的行动工具，与参议员和众议院议员联系。如果你已经采取我们的行动联系你的参议员，请再次采取行动，确保你联系两院的议员。\n法案发起人错误地表示，需要《挣到钱法案》来保护儿童。但是，根据联邦法律，他们担心的那种虐待形象已经是高度违法的。任何知道正在分发或接收儿童性虐待材料（CSAM）的互联网平台都必须对此采取行动，如果不采取行动，则可能会被起诉。\n它将允许各州降低对CSAM进行起诉所需的法律标准，并允许在诉讼和刑事审判中使用加密作为证据。EARN IT的公开目标是迫使互联网公司开始广泛扫描用户信息和照片。此扫描与强加密不兼容。\n伤害将落在最脆弱的人身上。一旦我们允许泄露加密来扫描CSAM，独裁政权将要求同样的能力来追踪活动人士和记者共享的信息。遭受家庭虐待的人，包括儿童，将没有安全的沟通渠道来报告和寻求可信的帮助。\n我们高兴地看到，几位参议员回应了美国和世界各地人权组织提出的关切。他们建议，如果该法案不能在打击针对儿童的犯罪与用户隐私权和加密权之间取得适当平衡，他们可能不会支持该法案。\n但目前的法案并没有“取得平衡”，因为没有平衡。该法案的发起人已明确表示，他们希望监控用户信息，甚至还分发了文献，建议他们更喜欢使用哪种软件。\nEARN IT威胁要惩罚那些没有开始遵守具体执法要求清单的公司。其中包括：开始扫描邮件。端到端加密与各州将要求的监控类型完全不兼容，该法案的发起人也明确表示了这一点。就在本周，法案发起人参议员理查德·布卢门塔尔（Richard Blumenthal）告诉《华盛顿邮报》，他拒绝在法案中为加密的使用设定一个广泛的豁免，因为他不想让加密成为一张“免出狱卡”\n如果有足够多的公众反对，我们仍然可以阻止这项法案。我们都有隐私权，并使用加密服务来保护我们的隐私。不要让国会把它拿走。", "note_en": "Earlier today, the Senate Judiciary Committee voted to advance   the dangerous EARN IT bill . We’re disappointed to see the committee advance this misguided bill. If enacted, EARN IT will put massive legal pressure on internet companies both large and small to stop using encryption and instead scan all user messages, photos, and files.\n The bill could now be voted on by the full Senate at any time, or worse, included as part of a different “must-pass” legislative package. We need you to contact your representatives in Congress today to tell them to vote against this bill.\n   We have expanded our action tool to contact both Senators and members of the House of Representatives. If you have already taken our action to contact your Senators, please take it again to make sure you contact lawmakers in both houses.\n  The bill sponsors have falsely stated that the EARN IT Act is needed to protect children. But the kind of abusive images they’re concerned about are already   highly illegal under federal law . Any internet platforms that knows about child sexual abuse material (CSAM) being distributed or received are required to take action on it, and can be prosecuted if they do not.\n EARN IT will allow states to lower the legal standard required for prosecutions over CSAM, and it will let the use of encryption be evidence in lawsuits and criminal trials. The   overt goal  of EARN IT is to pressure internet companies to start doing widespread scanning of user messages and photos. This scanning is   incompatible with strong encryption .\n The harms will fall on the most vulnerable people. Once we allow encryption to be compromised to scan for CSAM,, authoritarian regimes   will demand the same capabilities  to track information shared by activists and journalists. People subject to domestic abuse, including children, won’t have secure channels of communication to report and reach out for trusted help.\n We’re glad to see that several senators echoed   concerns raised by human rights groups  throughout the U.S. and the world. They suggested they might not support the bill if it doesn’t strike a proper balance between fighting crimes against children, and user rights to privacy and encryption.\n But the current bill does not “strike a balance” because there isn’t one to strike. The sponsors of the bill have made it clear they want to surveil user messages, and have even distributed   literature  suggesting which software they prefer be used.\n EARN IT threatens to punish companies that don’t start following a specific list of law enforcement demands. Among them: start scanning messages. End-to-end encryption is simply not compatible with the type of surveillance that states will demand, and that the bill’s sponsors   have explicitly  suggested. Just this week, bill sponsor Sen. Richard Blumenthal   told   The Washington Post  that he rejected the idea of creating a broad exemption in the bill for the use of encryption, because he didn’t want encryption to be a “get out of jail free card.”\n We can still stop this bill if there’s enough public pushback. We all have a right to privacy, and to use encrypted services to protect our privacy. Don’t let Congress take that away.", "posttime": "2022-02-12 23:55:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "参议员,senators,法案", "title": "关键参议员投票支持反加密法案", "title_en": "Key senators have voted for the anti-encryption EARN IT act", "transed": 1, "url": "https://www.eff.org/deeplinks/2022/02/key-senators-have-voted-anti-encryption-earn-it-act", "via": "", "real_tags": ["参议员", "senators", "法案"]}, {"category": "", "categoryclass": "", "imagename": "55dab0931be2ca0ce63b22005dc881ca.jpg", "infoid": 1072756, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们的物种在很大程度上要归功于相对的拇指。但如果进化给了我们额外的拇指，情况可能不会有多大改善。每只手一个拇指就够了。\n神经网络则不然，它是执行类似人类任务的领先人工智能系统。随着他们变得越来越大，他们开始掌握更多。这让旁观者大吃一惊。基本的数学结果表明，网络应该只需要这么大，但现代神经网络的规模通常远远超出了预期的要求——这种情况被称为过度参数化。\n微软研究院的塞巴斯蒂安·布贝克（Sébastien Bubeck）和斯坦福大学的马克·塞尔克（Mark Sellke）去年12月在领先的NeurIPS会议上发表了一篇论文，为scaling成功背后的奥秘提供了新的解释。他们表明，为了避免某些基本问题，神经网络必须比传统预期的要大得多。这一发现为一个持续了几十年的问题提供了普遍的见解。\n“这是一个非常有趣的数学和理论结果，”瑞士洛桑联邦理工学院的Lenka Zdebrová说。“他们用这种非常通用的方式证明了这一点。因此，从这个意义上说，它将成为计算机科学的核心。”\n神经网络的一个常见任务是识别图像中的对象。为了创建一个能够做到这一点的网络，研究人员首先向它提供许多图像和对象标签，训练它学习它们之间的相关性。之后，网络将正确识别它已经看到的图像中的对象。换句话说，训练会让网络记住数据。更值得注意的是，一旦一个网络记住了足够的训练数据，它还能够预测从未见过的物体的标签——以不同程度的准确性。后一个过程被称为泛化。\n网络的大小决定了它能记住多少。这可以用图形来理解。想象一下，得到放置在xy平面上的两个数据点。可以用两个参数描述的直线连接这些点：直线的坡度和横穿垂直轴时的高度。如果给其他人一条线，以及一个原始数据点的x坐标，他们可以通过查看该线（或使用参数）计算出相应的y坐标。这条线已经记住了两个数据点。\n神经网络也有类似的功能。例如，图像由数百或数千个值描述——每个像素一个值。这组自由值在数学上相当于高维空间中一个点的坐标。坐标的数量称为尺寸。\n“这不再是正在发生的事情，”德克萨斯大学的奥斯丁说。“现在，我们正在常规地创建神经网络，其参数数量超过训练样本数量。这意味着这些书必须重写。”\n布贝克和塞尔克并没有打算重写任何东西。他们正在研究神经网络通常缺乏的另一种特性，即鲁棒性，即网络处理微小变化的能力。例如，一个不健全的网络可能已经学会识别长颈鹿，但它会将一个几乎没有修改过的版本错误地标记为沙鼠。2019年，Bubeck和同事们意识到这个问题与网络的大小有关，他们试图证明有关这个问题的定理。\n布贝克说：“我们在研究对抗性的例子——然后规模强加给了我们。”。“我们认识到这是一个难以置信的机会，因为我们需要了解规模本身。”\n在他们的新证明中，这两人证明了过参数化对于网络的健壮性是必要的。他们通过计算出需要多少参数来拟合数据点，曲线的数学特性相当于鲁棒性：平滑度。\n要看到这一点，再次想象平面中的曲线，其中x坐标表示单个像素的颜色，y坐标表示图像标签。因为曲线是平滑的，如果你稍微修改像素的颜色，沿着曲线移动一小段距离，相应的预测只会改变一小部分。另一方面，对于极不规则的曲线，x坐标（颜色）的微小变化可能会导致y坐标（图像标签）的剧烈变化。长颈鹿可以变成沙鼠。\nBubeck和Sellke证明，平滑拟合高维数据点不仅需要n个参数，还需要n×d个参数，其中d是输入的维度（例如，784像素图像的784）。换句话说，如果你想让一个网络有力地记住它的训练数据，过度参数化不仅有帮助，而且是强制性的。这一证明依赖于一个关于高维几何的奇怪事实，即放置在球体表面上的随机分布点彼此之间几乎都有一个完整的直径。点之间的大间距意味着用一条平滑曲线拟合它们需要许多额外的参数。\n这一结果为理解扩展神经网络的简单策略为何如此有效提供了新的途径。", "note_en": "Our species owes a lot to opposable thumbs. But if evolution had given us extra thumbs, things probably wouldn’t have improved much. One thumb per hand is enough.\n Not so for neural networks, the leading artificial intelligence systems for performing humanlike tasks. As they’ve gotten bigger, they have come to grasp more. This has been a surprise to onlookers. Fundamental mathematical results had suggested that networks should only need to be so big, but modern neural networks are commonly scaled up far beyond that predicted requirement — a situation known as overparameterization.\n In a  paper presented in December at NeurIPS, a leading conference,  Sébastien Bubeck of Microsoft Research and  Mark Sellke of Stanford University provided a new explanation for the mystery behind scaling’s success. They show that neural networks must be much larger than conventionally expected to avoid certain basic problems. The finding offers general insight into a question that has persisted over several decades.\n  “It’s a really interesting math and theory result,” said  Lenka Zdeborová of the Swiss Federal Institute of Technology Lausanne. “They prove it in this very generic way. So in that sense, it’s going to the core of computer science.”\n The standard expectations for the size of neural networks come from an analysis of how they memorize data. But to understand memorization, we must first understand what networks do.\n One common task for neural networks is identifying objects in images. To create a network that can do this, researchers first provide it with many images and object labels, training it to learn the correlations between them. Afterward, the network will correctly identify the object in an image it has already seen. In other words, training causes a network to memorize data. More remarkably, once a network has memorized enough training data, it also gains the ability to predict the labels of objects it has never seen — to varying degrees of accuracy. That latter process is known as generalization.\n A network’s size determines how much it can memorize. This can be understood graphically. Imagine getting two data points that you place on an  xy-plane. You can connect these points with a line described by two parameters: the line’s slope and its height when it crosses the vertical axis. If someone else is then given the line, as well as an  x-coordinate of one of the original data points, they can figure out the corresponding  y-coordinate just by looking at the line (or using the parameters). The line has memorized the two data points.\n Neural networks do something similar. Images, for example, are described by hundreds or thousands of values — one for each pixel. This set of many free values is mathematically equivalent to the coordinates of a point in a high-dimensional space. The number of coordinates is called the dimension.\n  An old mathematical result says that to fit  n data points with a curve, you need a function with  n parameters. (In the previous example, the two points were described by a curve with two parameters.) When neural networks first emerged as a force in the 1980s, it made sense to think the same thing. They should only need  n parameters to fit  n data points — regardless of the dimension of the data.\n “This is no longer what’s happening,” said  Alex Dimakis of the University of Texas, Austin. “Right now, we are routinely creating neural networks that have a number of parameters more than the number of training samples. This says that the books have to be rewritten.”\n Bubeck and Sellke didn’t set out to rewrite anything. They were studying a different property that neural networks  often lack, called robustness, which is the ability of a network to deal with small changes. For example, a network that’s not robust may have learned to recognize a giraffe, but it would mislabel a barely modified version as a gerbil. In 2019, Bubeck and colleagues were seeking to prove theorems about the problem when they realized it was connected to a network’s size.\n “We were studying adversarial examples — and then scale imposed itself on us,” said Bubeck. “We recognized it was this incredible opportunity, because there was this need to understand scale itself.”\n In their new proof, the pair show that overparameterization is necessary for a network to be robust. They do it by figuring out how many parameters are needed to fit data points with a curve that has a mathematical property equivalent to robustness: smoothness.\n  To see this, again imagine a curve in the plane, where the  x-coordinate represents the color of a single pixel, and the  y-coordinate represents an image label. Since the curve is smooth, if you were to slightly modify the pixel’s color, moving a short distance along the curve, the corresponding prediction would only change a small amount. On the other hand, for an extremely jagged curve, a small change in the  x-coordinate (the color) can lead to a dramatic change in the  y-coordinate (the image label). Giraffes can become gerbils.\n Bubeck and Sellke showed that smoothly fitting high-dimensional data points requires not just  n parameters, but  n ×  d parameters, where  d is the dimension of the input (for example, 784 for a 784-pixel image). In other words, if you want a network to robustly memorize its training data, overparameterization is not just helpful — it’s mandatory. The proof relies on a curious fact about high-dimensional geometry, which is that randomly distributed points placed on the surface of a sphere are almost all a full diameter away from each other. The large separation between points means that fitting them all with a single smooth curve requires many extra parameters.\n “The proof is very elementary — no heavy math, and it says something very general,” said  Amin Karbasi of Yale University.\n  The result provides a new way to understand why the simple strategy of scaling up neural networks has been so effective.\n Other research has revealed additional reasons why overparameterization is helpful. For example, it can improve the efficiency of the training process, as well as the ability of a network to generalize. While we now know that overparameterization is necessary for robustness, it is unclear how necessary robustness is for other things. But by connecting it to overparameterization, the new proof hints that robustness may be more important than was thought, a single key that unlocks many benefits.\n “Robustness seems like a prerequisite to generalization,” said Bubeck. “If you have a system where you just slightly perturb it, and then it goes haywire, what kind of system is that? That’s not reasonable. I do think it’s a very foundational and basic requirement.”", "posttime": "2022-02-12 23:35:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "神经网络,科学家,scientists,网络", "title": "计算机科学家证明了为什么更大的神经网络做得更好", "title_en": "Computer scientists prove why bigger neural networks do better", "transed": 1, "url": "https://www.quantamagazine.org/computer-scientists-prove-why-bigger-neural-networks-do-better-20220210/", "via": "", "real_tags": ["神经网络", "科学家", "网络"]}, {"category": "", "categoryclass": "", "imagename": "8907cba0300fd2ae792d8143fffe80e7.gif", "infoid": 1072754, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在人类历史的大部分时间里，大约30万年前，我们作为狩猎采集者生活在几十人的可持续、平等的社区中。人类在地球上的生活，以及我们在地球生物物理系统中的位置，随着大约12000年前开始的全新世地质时代发生了巨大的变化。气候稳定和温暖的气温前所未有地结合在一起，使得世界上一些地区对野生谷物的依赖性更大。在接下来的几千年里，这种依赖导致了农业和大规模的国家社会。这些社会呈现出扩张和崩溃的共同模式。工业文明始于几百年前，当时化石燃料将人类经济的规模和复杂性推到了一个新的水平。这一变化带来了许多好处，但也给我们带来了全球气候变化的生存危机。气候模型表明，地球可能会变暖3摄氏度至4摄氏度 2100年时达到摄氏度，最终达到8摄氏度 摄氏度或以上。这将使地球回到更新世不稳定的气候条件，那时农业是不可能的。可以制定政策，减少工业文明转型的破坏性，改善狩猎采集后代的前景。这些措施包括减少长期极端气候变化的积极政策、积极的人口减少政策、重新包装和保护世界上现存的土著文化。", "note_en": "For most of human history, about 300,000 years, we lived as hunter gatherers in sustainable, egalitarian communities of a few dozen people. Human life on Earth, and our place within the planet’s biophysical systems, changed dramatically with the Holocene, a geological epoch that began about 12,000 years ago. An unprecedented combination of climate stability and warm temperatures made possible a greater dependence on wild grains in several parts of the world. Over the next several thousand years, this dependence led to agriculture and large-scale state societies. These societies show a common pattern of expansion and collapse. Industrial civilization began a few hundred years ago when fossil fuel propelled the human economy to a new level of size and complexity. This change brought many benefits, but it also gave us the existential crisis of global climate change. Climate models indicate that the Earth could warm by 3°C-4 °C by the year 2100 and eventually by as much as 8 °C or more. This would return the planet to the unstable climate conditions of the Pleistocene when agriculture was impossible. Policies could be enacted to make the transition away from industrial civilization less devastating and improve the prospects of our hunter-gatherer descendants. These include aggressive policies to reduce the long-run extremes of climate change, aggressive population reduction policies, rewilding, and protecting the world’s remaining indigenous cultures.", "posttime": "2022-02-12 23:34:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,采集者,gatherer,地球", "title": "我们狩猎采集者的未来：气候变化、农业和不文明（2020年）", "title_en": "Our hunter-gatherer future: Climate change, agriculture and uncivilization (2020)", "transed": 1, "url": "https://www.sciencedirect.com/science/article/pii/S0016328719303507", "via": "", "real_tags": ["2020", "采集者", "gatherer", "地球"]}, {"category": "", "categoryclass": "", "imagename": "046bbed8d1497a4babbaa0f8c85f4cbd.jpg", "infoid": 1072753, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "俄勒冈州参议员罗恩·怀登的美国参议院官方网站", "note_en": "The Official U.S. Senate website of Senator Ron Wyden of Oregon", "posttime": "2022-02-12 23:34:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "批量,declassified,参议员", "title": "新解密的文件揭露了中情局之前的秘密批量收集", "title_en": "Newly declassified documents reveal previously secret CIA bulk collection", "transed": 1, "url": "https://www.wyden.senate.gov/news/press-releases/wyden-and-heinrich-newly-declassified-documents-reveal-previously-secret-cia-bulk-collection-problems-with-cia-handling-of-americans-information", "via": "", "real_tags": ["批量", "参议员"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072752, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "[注：我发现了一些很久以前的cc:mail数据文件（早在创建trs-80.com之前）。这些存根还远远没有完成，而且在我试图转换CC:Mail文件时引入的日期似乎有一些错误。以下日期可能不正确。如果有人知道如何将古老的cc:mail CCA档案转换为Eudora MBX格式，请告诉我]1995年3月31日，我最好的朋友Rich Buchman告诉我Jeff Vavasour的Model I模拟器。我下载了它，并试图找出如何运行斯科特·亚当斯文本冒险。我于1995年4月3日注册了emulator，并于1995年4月4日加入了TRS-80 listserve。在“musie.phlab.missouri.edu/pub/TRS/TRS/TRS-80”网站上已经有一个不错的TRS-80资料档案，我又在天堂运行旧软件了。1996年4月17日，我在当时雇主的测试web服务器上获得了一个可访问web的帐户…http://w3.infonorth.com/~ira。它并没有真正关注TRS-80，许多朋友在访问它时遇到了困难（虽然有些人正在将w3改为www，但在那些日子里，DNS似乎不是很快就能恢复）。里面有我的简历和我写的股市分析程序。1996年4月19日，我添加了一个调查结果页面（似乎是我喜欢的网站列表）。4月22日，一个访问柜台进入。当我学习HTML（1996年4月17日之前我不知道）时，我实现了一些新东西，比如图像映射，但拒绝学习cgi（直到今天我仍然不知道）。在历史的这一点上，我似乎以1600美元的价格买到了一款奔腾166/Mhz、32MB内存和4MB Matrox Millenium视频卡。我妈妈刚买了一台Penium 100Mhz笔记本电脑，8MB内存，540MB硬盘（？），还有一台4倍的CD阅读器，售价900美元。到1996年6月28日，我开始把我的一点点TRS-80资料加载到网站上（或者更准确地说，加载到为TRS-80留出的一个页面上）。我似乎也有一个LITRUG（长岛TRS-80用户组）页面。到了7月，人们已经开始发送电子邮件，要求帮助寻找一些他们在过去喜欢使用的丢失已久的软件。1996年8月19日，斯科特·亚当斯（Scott Adams）给我发了一封电子邮件，告诉我该页面（仍然只是一个页面）很“迷人”。就在同一天，罗伯特·A·福克斯邀请我“继续奥奇”。我想那天我刚刚创建了一个兽人页面，因为很多伟大的人似乎都加入了其中，包括乔纳森·博克尔曼。在9月13日（是的，这是不正常的），比尔·霍格（Big 5 Software）说我带回了很多回忆，“其中大多数都很愉快！”，就在同一天，彼得·特雷福纳斯（克洛德饰）写了一封信。不过有个障碍。要将TRS-80磁盘转换为TRS-80格式，没有简单的方法。有几个实用程序可以尝试访问数据，但至少可以说这些程序很混乱。最常见的方式是通过串行端口，这是可怕的混乱。然而，Jeff Vavasour在他的III/4型仿真器软件包中编写了一个实用程序，使读取磁盘变得更加容易。当时，它被称为“GETDISK”，是唯一一个可以读取非Newdos/80磁盘（Newdos/80将磁道0写入磁盘物理中心的距离有问题）并使其成为DSK文件的程序。但是GETDISK包含在非共享软件Model III/4 emulator包中，所以我联系了Jeff，问他是否可以公开使用这个程序。Jeff这样做没有问题，但他已经授权经销商销售Model III/4 emulator，未经他们批准，不能发布该程序。杰夫建议我联系这个经销商，如果他同意的话，让公司的老板知道杰夫亲自批准了它的发布。请求电子邮件于1996年9月3日发送，请求于1996年9月7日被拒绝。在我下一次回纽约的旅行中，[日期未知]我连续9个小时使用Rich的Model 4和GETDISK（我已经注册了Model III/4模拟器）转换磁盘。我会在IBM上格式化一个空白磁盘，然后使用Rich的Model 4将我的TRS-80格式化的NEWDOS/80磁盘（它有我前面提到的磁道0问题）复制到那些IBM格式化的磁盘上。然后，我将使用GETDISK读取IBM格式化的磁盘。该网站当时似乎和现在一样进步很大。当不同的人发现它时，他们会非常兴奋，并通过电子邮件联系。关于在哪里修理TRS-80、在哪里购买TRS-80、在哪里找到他们编写的丢失已久的软件的询问开始源源不断。96年9月9日，我（对杰夫）对我收到的电子邮件数量和网站花费的时间表示失望。美好的愿望继续传来，人们尽他们所能给我他们的软件（或者问我是否有他们丢失已久的软件的副本）。随着各种作者提交他们自己的东西，该网站确实成功地发展了起来，其他人也被鼓励编写模拟器。Yves Lempereur为MAC电脑编写了唯一的TRS-80模拟器，他将自己编写的所有程序（FunSoft系列）都发送了出去。Tim Mann获得了Roy Soltoff的许可，可以发布整个Misosys/Breeze库，包括LDO和SuperUtility。保护工作确实在进行中……但最重要的部分，人们可以通过某种方式阅读自己的磁盘，以便通过电子邮件发送给他们，仍然被困在“专有土地”中。为了解决这个问题，马修·里德（Matthew Reed）欣然同意编写一个免费程序，在IBM驱动器中读取TRS-80磁盘。READDISK的测试版于1997年7月1日提供给我，版本为v1。0于7月15日发布…作为免费软件。这并不是马修对保存TRS-80记忆的巨大贡献的终结。1997年7月9日，坦迪联系我，告诉我他们正在准备TRS-80网页的20周年纪念日，并想知道他们是否可以提供我网站的链接。我说过这是我的荣幸！他们的网页上线后不久，Ed Juge（是的！）发来的邮件告诉我，他“惊讶地看到人们对TRS-80如此感兴趣”，他通过Radio Shack 20周年纪念页面的“链接”部分找到了我的网站。网站上还写着《亚利桑那共和国》，也是为了纪念20周年。事实上，在整个网站的运作过程中，我会收到来自不同人士的关于TRS-80的源源不断的询问，他们建议坦迪不知道如何回答他们的问题，并建议他们到网站寻求帮助🙂\nBunjor，Je Deou-CouvReR Hasad VoTre站点…et JaaaRajuni de 40 ANS。人物角色，Jai-Acet et on Trs80（单位EDE 16K，扩展Top-Avier-64K，Uune Crun，UNE IimrANTE AGIULLS et Le MIKK7……）EN 1979 JE CROIS，布雷斯特IL ME MeMeLable。J'tais kinésithérapeute et monépouse médecin。这是一项有效的计划，为内阁的医疗和公共医疗提供指导。我可以用“个人资料”来表达你的想法…还有“基本的”…表达你的程序员。这是一个很好的组织形式，它可以帮助你在一个地方找到一条大道，让你的信仰继续下去。Jai A'E.P.B.A.E.E.E.C.E.E'Cule'NeNeURU'A.ApPRIS，VITE JE TraveV.剥削者To.C.E.Quelg-MOIS et ANEES，Juelet et NuIT Jai AI解释UnStudio DE计划Relie Les uns AUX AutoRet et i QueReTe de Ge Re LES 2柜Me Digax。我是阿佩尔·罗吉姆卡姆（为运动和医疗辅助提供逻辑信息……为南部地区和南部地区的信息俱乐部提供辅助信息。此外，还提供了一个足球场、新球场、基本球场和基本球场……5英寸1/4的k7音频，一张脸，两张脸，两张脸，两张脸，两张脸，两张脸，两张脸，两张脸，两张脸，两张脸，一张脸，两张脸，两张脸，两张脸，两张脸，两张脸，一张脸，两张脸，两张脸，两张脸，两张脸，两张脸，一张脸，一张脸，两张脸，一张脸，一张脸，一张脸，一张脸72万。在这里，我是一名程序员，他基本上是一名西班牙人……我在2002年参加了一个俱乐部的信息交流会。看啊，我的历史告诉你，不要这样做。客户行政事务部、萨拉尔公报、文本事务部…。谢谢你的盛情款待\n在80年代初，我花了一年时间使用TRS 80和一个三间隔的扩展单元，写了一本关于莱昂内尔火车的书。书写完后，我有一堆大约24英寸高的光盘，放在阁楼上，我卖掉房子时放在那里了。我有一台打印机，我记不起它的名字了，那台打印机用折叠的纸把我键入的材料寄给了出版商，出版商是用来制作这本书的。在TRS 80“Trash 80”停止保存后，我得到了一个带有5英寸光盘的坦迪电台棚屋，当时我得到了一个50 MB的硬盘，当时人们认为它很大。我有一张8英寸的软盘，我记得它的主软件是DOS3。我还有一个叫做Dbase的东西，我用来研究玩具火车的年代。我有其他软件，82岁的时候我再也记不起它们的名字了。其中一些是Micro$oft购买的，并在以后的版本中使用。我想打印出我原来的TRS 80和扩展架的照片，但似乎找不到TRS 80。我认为这是灰色的，因为是扩展湾，有三个插槽的软盘。我现在有一个HP Pavilion，带有win 7的指纹读取器。我也有同样的胜利8，我不喜欢，以及胜利7。这个网站很有趣，但很多照片我都没看过。我从来没有保留过任何一件8英寸的东西，因为它们太笨重了，我搬来搬去太多了。\n我被介绍给大楼里的一位同住者，一位“一定年龄”的老妇人，她经历了艰难时期。她活泼可爱，尽管有点古怪——她非常害怕自己的思维开始衰退。我几乎看不到这方面的证据，但我确实看到了一个女人的影子，她曾经是她自己的一股力量。她给我讲了她前世的故事；她的祖先可以追溯到五月花；以前的室友都是歌剧迷，他们都会说不同的母语（英语、法语、德语），但发现如果他们使用普契尼和威尔第的意大利语，他们很容易交流。无论如何，这个女人（我叫她‘海伦’）再也不能独自生活了，被另一个州的亲戚收养了。但海伦的公寓（一套相当大的三居室公寓——这是纽约市梦寐以求的一种商品）却被不幸地忽视了，从一开始就堆满了她作为一名狂热的读者、木工、晶体学家的前世遗物——天知道还有多少其他爱好和爱好。除了背上的衣服外，她几乎需要脱掉所有的东西。她搬进了一个小房间，在她远在美国中部的亲戚家里，不能（也不需要）带家具、亚麻布或其他家居用品。她甚至没有带书。求你了，她恳求她认识的每个人和遇到的每个人拿走他们认为可以使用的任何东西。她很高兴知道有人会利用这些东西，而不是让它们浪费掉，然后被扔进垃圾堆。她把我从一个房间带到另一个房间，我们小心翼翼地穿过科利尔兄弟式的迷宫——她一个接一个地捡起东西，恳求我拿点什么——任何东西。这也让她感到沮丧，因为周围的环境如此混乱，她无法想象自己将如何走出自己在纽约的公寓（她在那里住了40年），如何“打包”，以及如何处理自己的“东西”。。，她给我看了亚麻布（还是20年前的原始包装）；桌子和椅子，一个接一个的书架（大部分书架都塌了），一个全新的电涌保护器（我拿了它），一端连接着平行电缆的打印机，另一端没有电脑。她捡起各种各样的旧五金，每次都问我能不能用——每次我都尽可能友好地告诉她让房东处理掉。它太过时了，任何人都不能使用，甚至不能捐赠……在最后一个走廊里，在我出去的路上，她捡到了一块满是灰尘的黑色“人造革”从另一个书架下面拿出一个箱子——当她开始向我展示里面一些非常过时的设备的边缘时，我悲伤地叹了口气，摇了摇头，告诉她如果其他东西都是好的门挡，那么这个就是一块很好的砖。“把它留下，房东会帮你处理掉的。”我听到自己说。但当她把它放下后，我的大脑里响起了一个小蜂鸣器，因为我觉得那个设备太旧了，甚至我都没认出它来——我开始想它是什么。（在80年代，我是一个大型机/Cobol/CICS的人）——尽管我很早就开始接触PC，但从来没有接近过，甚至没有见过一台“爱好”电脑。我必须看一下上面的标签才能知道它是什么——但当我看到TRS-80时；我简直不敢相信自己的眼睛。它没有电源线，所以我想即使这台机器很原始，我也永远找不到任何适合给它通电的东西。但我想，至少我的“前任”会从中得到乐趣：他在80年代拥有一家电脑商店。我告诉海伦，这是有史以来最早生产的个人电脑之一——我怀疑它的价值很高——但如果这种不太可能发生的事，我会把我从中获得的任何钱都给她。海伦的脸亮了起来——不是因为我们发现了一件稀罕的东西——也不是因为有任何赚钱的可能性——而是因为我真的在从她的公寓里拿东西！回到家后，我仔细检查了一下。我不敢相信它居然有地方放电池。由于对那些电脑一无所知，我震惊地发现这需要AAs。海湾里还有4节AA电池。但当我看到腐蚀和泄漏时，我的心都沉了下去。太糟糕了，我担心它漏到了电池舱之外。我当时太好奇了，坚持把海湾清理干净。但我真的没想到这玩意儿会像昨天刚被关闭一样突然启动。我不知道自己在做什么，但开始按按钮，屏幕上出现了一些东西。我在里面输入了一些东西，实际上还保存了一个文件。我觉得自己就像是发现图坦卡蒙国王陵墓的埃及学家。没想到会这样——但这是一个多么惊人的发现！几天后，我把它给我的“前男友”看，他以前真的做了一台自己喜欢的电脑：他用手把它翻过来，看起来像普鲁斯特在品尝他的马德兰面包屑。\n在70年代末，我们使用TRS-80为加利福尼亚州伯班克的AME公司开发了自动录像带复制系统。他们的主要业务是为电视广播复制商业广告。这是非常劳动密集型的，很容易出错。这个过程包括提示一盘录像带，选择颜色条，然后选择一块石板，开始播放录像带，选择它，然后等待广告结束，此时操作员会在重新提示录像带时选择黑色，然后一次又一次地开始这个过程，所以我们开发了一个在TRS-80上运行的系统来实现这些功能。该软件是用汇编语言编写的，并烧制成一个prom，取代了TRS-80中原来的基本prom。我们重新油漆了按钮，并给它们贴上了新标签，以便于操作员操作。我们用打印机端口控制视频切换器，用串行端口控制连接到Ampex VR-2000的CMX I2（智能接口）（当时的价格约为50000美元）。我们还添加了电视同步。将分离器连接到TRS-80以调节系统定时。该系统使用非常频繁，以至于TRS-80键盘和主板之间的内部扁平电缆不时会断开。\n嗨，Ira，很棒的网站，它让我想起了我是如何进入计算机行业的……当我13或14岁的时候，我看到了我的第一台电脑，一台坦迪TRS-80 I型4K机器……我在放学回家的路上逛到了我当地的坦迪商店，当时我正在看报纸。因为我带着一个大报纸袋，商店经理让我把它取下来，交给他，我环顾四周……我走到一个相当小的显示屏前，上面放着一台I型电脑，拿起基本手册，开始浏览并输入一些程序，我立刻被吸引住了！我问经理这本手册多少钱，他说如果我把他们的传单杂志送到我的报社，我就可以拿到。。那天晚上，我开始从头到尾阅读手册，很快就意识到我需要电脑来充分利用这个新的编程工具。于是我回到坦迪身边，问我放学后是否可以进来尝试一些编程，经理同意了我写一些演示程序来展示电脑的功能的附带条件！我继续定期拜访坦迪，大约一年后，我在他们那里找到了一份兼职工作。。事实上，我做了五年的兼职，在英国布里斯托尔及其周边的五家不同的商店工作。我获得了一个5年的pin码，我仍然可以使用它，并为许多不同的TRS-80型号编程，包括Model II/16（wow Xenix！），三、 4、cos（大的和小的）、可爱的Model 100和一些pocket PC。从我挣的钱中，我存了起来，买了我的第一台电脑，一台Model I Level II 16K机器，后来扩展到48K，三个软盘驱动器，再加上高分辨率升级。我刚从阁楼里拿出套件，第一次就把它烧起来了……很高兴回到一台我知道它是如何工作的机器上，我甚至还有它的电路板示意图！！遗憾的是，我已经没有了我编写的大多数程序，包括一个相当大的库存控制套件，它曾在我当地的坦迪商店使用。浏览网站上的节目列表，它让我想起了我玩过的所有精彩游戏。。我最喜欢的是机器人攻击。。通过盒式磁带输出的如此酷的语音合成，以及它使磁带接力器嘎嘎作响的方式，简直吓人！（谢天谢地，我的没有烧坏）。多亏了坦迪让我对计算机产生了兴趣，我上了大学，开始学习计算机科学（用Scriptsit编写我的项目，然后在区域经理办公室的一台非常响亮的雏菊轮打印机上打印出来——即使在它自己的特殊隔音柜里，也仍然非常响亮！）。然后我上了大学，获得了计算机系统工程学位，然后获得了计算机科学博士学位。。当我的研究经费用完时，我设法在大学的Unix支持团队找到了一份工作，在那里我对BSD Unix的热爱开始并一直延续到今天，我希望利用这个网站上的资源让我的TRS-80重新投入使用。。我建立了自己的RS232C接口，并为其编写了一个基于汇编程序的驱动程序，因此我可能会尝试使用它通过Unix设备将其连接到我的网络上……嗯，我想知道我是否可以开始工作\n谢谢你的记忆诱导网站！我还有我的型号1序列号B006841。我甚至手工焊接了一个带有拨动开关的芯片，以获得更低的外壳。我第一次接触计算机是我的Sophore科学老师拥有的TRS-80 Model 1。到那时，我基本上已经厌倦了学校，我相信这让我从一个我永远都不知道的厄运中解脱出来。我一直喜欢有按钮的东西，这是最棒的。一年后，我让老师放学后留下来用电脑“玩”，我决定拿出300美元买一台8轨立体声音响，并向父母索要差额，购买我在离家30英里的无线电棚屋商店看到的二手演示模型。我住在堪萨斯州的一个农业小镇上，我很可能会有任何电脑时间。但是，我的父母是那种\n......", "note_en": "[Note: I had found some cc:mail data files from a long long time ago (long long before trs-80.com was created). These stubs are far from complete, and there seems to be some error in dates, introduced in my attempt to convert the CC:Mail files. The dates below may be incorrect. If anyone knows a good way to convert ancient cc:mail CCA archives to Eudora MBX format, please let me know]  \t\tOn 3/31/1995, my best friend, Rich Buchman, told me about Jeff Vavasour’s Model I emulator. I downloaded it and tried to figure out how to run the Scott Adams text adventures. I registered the emulator on 4/3/1995, and joined the TRS-80 listserve on 4/4/1995.  \t\tThere was already a decent archive of TRS-80 stuff on the web, at “musie.phlab.missouri.edu/pub/trs/trs-80” and I was in heaven running the old software again.  \t\tOn 4/17/96, I was given a web-accessible account on my then-employer’s test web server … http://w3.infonorth.com/~ira. It didn’t really focus on the TRS-80, and a lot of friends had trouble accessing it (while some were changing w3 to www, it seemed that DNS was not really quick back in those days). It had my resume and a stock market analysis program I had written. On 4/19/96 I added a findings page (which seemed to be a list of web sites I liked). A visit counter went in on 4/22. As I learned HTML (which I did not know before 4/17/96), I implemented new things, such as image maps, but refused to learn cgi (something I still don’t know to this day).  \t\tAt this point in history, I seemed to have gotten a Pentium 166/Mhz with 32MB of RAM and a 4MB Matrox Millenium video card for $1,600. My mom had just bought a Penitum 100Mhz laptop with 8MB of RAM, a 540MB Hard Drive(?), and a 4x CD reader for $900.  \t\tBy 6/28/1996, I started loading the little bit of TRS-80 stuff I had onto the site (or, more accurately, onto the single page set aside for the TRS-80). I also seemed to have a LITRUG (Long Island TRS-80 Users Group) page as well. By July, people were already sending emails asking to help find some long lost piece of software they had enjoyed using back in the day. On 8/19/1996, Scott Adams had sent me an email advising that the page (it was still just a page) was “Fascinating”. On the same day, Robert A Fowkes invited me to “keep on Orch’in”. I think I had just created a ORCH page that day because a lot of the greats seemed to have gotten into the mix, including Jonathan Bokelman. On 9/13 (yes, this is out of order) Bill Hogue (Big 5 Software) said that I was bringing back a lot of memories “most of them are even pleasant!”, the same day Peter Trefonas (CLOAD) wrote in.  \t\tThere was a snag though. There was no easy way to get TRS-80 disks converted over to TRS-80 format. There were a couple of utilities which could try to access the data, but these were messy to say the least. The most common way was over the serial port which was DREADFULLY messy.  \t\tHowever, Jeff Vavasour, as part of his Model III/4 emulator package had written a utility which made it much easier to read disks. Called “GETDISK” it was then the only program available which could read a non-Newdos/80 disk (there was an issue with how close NewDos/80 wrote track 0 to the physical center of the disk) and make it a DSK file.  \t\tBut GETDISK was included in the non-shareware Model III/4 emulator package, so I contacted Jeff and asked if he could make this program publically available. Jeff had no problem with doing so, but he had licensed the right to sell the Model III/4 emulator to a distributor, and could not release the program without their approval. Jeff suggested that I contact this distributor and let the owner of the company that Jeff personally was approving its release, if it was ok with him. The request email was sent on 9/3/1996 and the request was rejected on 9/7/96.  \t\tOn my next trip back to New York, [date unknown] I spent 9 straight hours using Rich’s Model 4 and GETDISK (I had registered the Model III/4 emulator) to convert my disks. I would format a blank disk on the IBM, and then used Rich’s Model 4 to copy my TRS-80 formatted NEWDOS/80 disks (which had the track 0 problem I mentioned earlier) to those IBM formatted disks. I would then read the IBM formatted disks using GETDISK.  \t\tThe site seemed to progress very much then as it did now. As various people discovered it, they would get very excited and email. Inquiries as to where to get a TRS-80 repaired, where to buy TRS-80’s, where to find long lost software they had written, started to flow. On 9/9/96 I expressed frustration (to Jeff) as to how many emails I was getting and how much time the site was taking. The well wishes continued to come in, and people did what they could to get me their software (or to ask if I had a copy of their long lost software).  \t\tThe site did manage to grow as various authors sent in their own stuff, and others were spurred to write emulators. Yves Lempereur, who had written the one and only TRS-80 emulator for the MAC had sent over every program he had written (the FunSoft collection). Tim Mann secured permission from Roy Soltoff to release the entire Misosys/Breeze library including LDOS and SuperUtility. The preservation efforts were really on track … but the most important piece, some way for people to read their own disks so they could be emailed in, was still stuck in “proprietary-land”.  \t\tTo solve this problem, Matthew Reed graciously agreed to write a freeware program which would read TRS-80 disks in an IBM drive. The beta copy of READDISK was provided to me on July 1, 1997, with v1.0 released on July 15th … as freeware. This would not be the end of Matthew’s GIANT contributions to preserving the TRS-80’s memory.  \t\tOn July 9, 1997, Tandy contacted me telling me that they were preparing 20th Anniversary of the TRS-80 web page and wanted to know if it was ok if they provided a link to my site. I said that it would be my honor! Shortly after their page went live, Ed Juge (YUP!) emailed in told me that he was “surprised to see so much lingering interest in the TRS-80” and that he had found my site through the “links” portion of Radio Shack’s 20th anniversary page. The site was also written up in “The Arizona Republic”, also in honor of the 20th Anniversary.  \t\tActually, throughout the site’s operation I would receive a steady trickle of inquiries from various people about the TRS-80 which advised that Tandy had no idea how to answer their questions and referred them to the site for help 🙂\n     bonjour,  \t\tJe découvre par hasard votre site… et j’ai rajeuni de 40 ans.  \t\tPersonnellement, j’ai acheté mon TRS80 (unité debase 16k ,extension pour avoir 64k, un écran, une imprimante à aiguilles et le miniK7…) en 1979 je crois, à Brest il me semble.   \t\tJ’étais kinésithérapeute et mon épouse médecin. Bien sûr il n’y avait aucun programme spécifique pour la gestion d’un cabinet médical ou para médical. Il y avait “profile” pour la gestion des fichiers… et le “basic”… pour programmer.  \t\tJe n’avais bien sûr aucune formation dans ce domaine mais j’ai senti que c’était l’avenir et j’en ai fait mon présent.   \t\tJ’ai commencé par petits bouts de programmes, aidé par un beau-frère étudiant en école d’ingénieur et ai appris, vite je trouve à exploiter toutes ces possibilités. En quelques mois et années, jour et nuit j’ai construit un ensemble de programmes reliés les uns aux autres et qui permettaient de gérer les 2 cabinets médicaux. Je l’avais appelé LOGIMKAM (LOGIciel Informatique pour Médecin Kinesitherapeute et Auxiliaire Medicaux… qui faisait envi aux amis médecins de Nantes et du club d’informatique médicale nantais.  \t\tEt il a fallu évoluer, passer de TRSDOS à NEWDOS, du basic au Gbasic et au Qbasic… de la k7 audio au 5″1/4, 1 face some densité aux 2 faces double densité. Quel miracle… 720k. Pour gagner de la place, je me souviens programmer en basic en supprimant tous les espaces…  \t\tJe l’ai gardé longtemps et l’ai donné à un club informatique à Banyuls que javais créé en 2002.  \t\tVoilà mon histoire TRS80 dont je suis très fier. Le programme gérait la partie administrative des fiches clients, les bulletins de salaire, le traitement de texte….  \t\tMerci à vous pour ces mémoires TRS80   \t\tBien cordialement\n     During the early eighties I spent a year using a TRS 80 with a three bay expansion unit writing a book about Lionel Trains. When the book was finished I had a stack of discs about twenty four inches high which went into the attic and were left there when I sold the house. I had a printer which I don’t recall the name of that used folded paper to send the material I typed to the publisher which was used to make the book. When I got a later Tandy Radio Shack with five inch discs after the TRS 80 “Trash 80” stopped saving I got a 50 MB hard drive which was considered large back then.  \t\tI had an 8 inch floppy which as I recall had DOS 3 as my main software. I also had something called Dbase which I used to doÂ research on dating the toy trains. I had other software I can no longer at 82 recall the names of. Several were bought by Micro$oft and used in their later editions.  \t\tI wanted to print out a picture of my original TRS 80 and the Expansion Bay but can’t seem to find the TRS 80. I think it was gray as was the Expansion Bay which had three slots for floppies.  \t\tI presently have an HP Pavilion with a fingerprint reader with win 7. I also have the same with win 8 which I don’t like as well as win 7. The site was interesting but many of the pictures I don’t think I ever saw back then. I never kept any of the 8 inch items because they were just too bulky and I moved around too much.\n     I was introduced to a fellow tenant in my building, an older woman “of a certain age”, who had come upon hard times. She was spry and lovely, albeit a bit eccentric — and very much afraid that her mind was beginning to go. I saw little evidence of that — but I did see the shadow of a woman who had once been quite a force of her own. She told me stories of her former life; of her ancestry which dated back to the Mayflower; of former roommates — all opera buffs — who all spoke different mother tongues (English, French, German) — but found they could easily communicate if they used the Italian of Puccini and Verdi .  \t\tIn any case, this woman (I’ll call her ‘Helen’), could no longer live alone, and was being taken in by a relative in another state. But Helen’s apartment (a rather large 3 bedroom apartment — which is a commodity coveted dearly in New York City) had been sadly neglected and was stuffed from stem to stern with relics of her former life as an avid reader, as a woodworker, as a crystallographer — and heaven knows how many other avocations and hobbies. She needed to shed nearly all her belongings except for the clothes on her back. She was moving to a small room in her relative’s home halfway across the country and could not take (and had no need for) her furniture, linens, or other home furnishings. She wasn’t even taking her books with her. Please, she begged everyone she knew and met to take anything they thought they could use.  \t\tIt made her happy to know someone would make use of things — rather than letting them go to waste and winding up in a dump. She took me from room to room, as we gingerly wended our way thru a Colliers brothers type maze — and she picked up item after item, begging me to take something — anything. It also depressed her being surrounded by such disarray and not being able to picture how she would ever get out of her NYC apartment (where she’d lived for 40 years) and how she would “pack”, and what she would do about all her “stuff”..,  \t\tShe showed me linens (still in the original package from 20 years ago); tables and chairs, bookcase after bookcase (mostly with collapsed shelves), a fairly new surge protector (I took it), a printer attached to a parallel cable on one end – and no computer on the other. She picked up various pieces of old hardware, asking me each time if I could use it — and each time I told her as kindly as I could to let the landlord dispose of it. It was just too outdated for anyone to use or even donate… In the last hallway, on my way out, she picked up a dusty black “leatherette?” case from under yet another bookcase — and, as she started to show me an edge of some REALLY outdated piece of equipment inside it, I sighed sadly and shook my head and told her if the other things were good doorstops, this one was a great brick. “Just leave it behind and the landlord will get rid of it for you” I heard myself say.  \t\tBut after she put it down, a little buzzer went off in my brain, as I thought that equipment was so old even *I* didn’t recognize it — and I began to wonder what it was. (In the 80’s I was a mainframe/ Cobol/CICS person) – and though I had gotten involved with PCs early on, had never gotten near or even glimpsed a “hobby” computer. I had to look at the label on it to know what it was – but when I saw TRS-80; I could hardly believe my eyes. It had no power cord, so I figured even if the machine was pristine, I’d never find anything that would fit to power it up. But I thought at least my “ex” would get a kick out of seeing it: he had owned a computer store in the 80’s.  \t\tI told Helen it was one of the first personal computers ever made — and I doubted it was worth very much – but I would give her any money I gained from it, should that unlikely event happen. Helen’s face lit up – not because we had discovered a rarity – and not because there was any possibility of monetary gain – but because I was actually carrying something out of her apartment!  \t\tWhen I got it home, I examined it more closely. I couldn’t believe it had a place for batteries. Not having known anything about those computers, I was shocked to see it took AAs. Well, there *were* 4 AA batteries still sitting in the bay. But my heart sank when I saw the corrosion and leakage. It was so bad, I was afraid it had leaked beyond the battery bay. I was just so curious by that point, I persisted and cleaned out the bay. But I really didn’t expect the thing to fire up as though it had just been shut down yesterday. I had no idea what I was doing, but starting pushing buttons and got something on the screen. I entered something to it and actually saved a file to it. I felt like the Egyptologist who discovered King Tut’s tomb. Didn’t expect this – but what an amazing find! A few days later, I showed it to my “ex”, who had actually built his own hobby computer once upon a time: he turned it over in his hands and looked like Proust savoring his crumbs of madeleine.\n     In the late 70’s we developed an automatic video tape duplication system for AME, Inc., Burbank, CA, using a TRS-80.  \t\tTheir main business was the duplication of commercials for TV broadcast. This is very labor intensive and easily subject to mistakes. The process consists of cueing a video tape, selecting color bars, then a slate, starting the video playing, selecting it then waiting until the end of the commercial, when the operator would select black while re-cueing the tape, and starting the process over again, and again, and …  \t\tSo we developed a system that ran on a TRS-80 to do these functions.  \t\tThe software was written in assembler, and was burned into a prom, which replaced the original basic prom in the TRS-80.  \t\tWe repainted the buttons, and gave them new labels to ease the operators job.  \t\tWe used the printer port to control the video switcher, and the serial port to control an CMX I2 (Intelligent interface) which was connected to an Ampex VR-2000 (used prices in those days of about $50,000).  \t\tWe also added a TV sync. separator to the TRS-80 to regulate the system timing.  \t\tThis system was used so heavily, that from time to time the internal flat cable between the TRS-80 keyboard and the mother board would break.\n     Hi Ira, great site and its reminded me how I got in to computing …  \t\tI was around 13 or 14 when I saw my first computer, a Tandy TRS-80 Model I Level I 4K machine … I had wandered in to my local Tandy store on my way home from school while I was doing a newspaper round. Because I was carrying a large newspaper sack the store manager asked me to take it off and leave it with him while I looked around … I walked up to a rather small display with a Model I computer on it and picked up the BASIC manual and started to look through it and type in some of the programs, I was instantly hooked! I asked the manager how much the manual was and he said I could have it if I delivered a load of their Flyer magazines on my newspaper round .. I of course jumped at the chance That night I started reading the manual from start to finish and soon realised that I needed the computer to get the most out of this new programming lark. So I returned to Tandy and asked if I could come in after school and try out some programming, the manager agreed on the proviso that I wrote some demo programs to show off what the computer could do!  \t\tI carried on visiting Tandy regularly and a year or so later I got a part-time job with them .. in fact I was a part-timer for over 5 years and got to work in five different stores in and around Bristol in the UK. I was awarded a 5 year pin which I still have I got to play with and program lots of different TRS-80 models including Model II / 16 (wow Xenix !), III, 4, Co-cos (big and small), the lovely Model 100 and some of the pocket pcs. From the money I earned I saved up and bought my first computer a Model I Level II 16K machine which later got expanded to 48K and three floppy drives plus a hi-res upgrade. I’ve just got the kit out of the loft and it all fired up first time … its nice to go back to a machine which I know how it works and I even have the circuit board schematics for !! Its a pity I no longer have most of the programs I wrote including a rather large stock control suite which was used in my local Tandy store.  \t\tLooking through the list of programs on the site it reminded me of all the great games I played .. my favourite was Robot Attack .. such cool speech synthesis through the cassette output and the way it rattled the tape relay was just plain scary! (thankfully mine didn’t burn out).  \t\tThanks to Tandy getting me interested in computers I went on to college to do computer science (writing up my projects using Scriptsit and printing them out on a really LOUD daisywheel printer at the regional manager’s office – it was still really LOUD even in its own special sound proofing cabinet!). I then went to University and got a degree in Computer Systems Engineering, then did a PhD in Computer Science .. when I ran out of my research grant I managed to get a job at the University working in the Unix Support Team where my love for BSD Unix started and continues to this day with FreeBSD and Mac OS X  \t\tI hope to use resources on this site to get my TRS-80 back in to use .. I built my own RS232C interface and wrote an assembler based driver for it and so I might try using that to connect it up to my network through a Unix box … hmm, I wonder if I can get SLIP to work\n     Thanks for such a memory inducing site! I still have my Model 1 S/N B006841. I even hand soldered a chip with a toggle switch to get lower case.  \t\tMy first exposure to a computer was to the TRS-80 Model 1 that my sophmore science teacher owned. By this time, I had basically gotten bored with school and I believe it saved me from a doom I’ll never know.  \t\tI had always liked things with push buttons and this was the ultimate. After a year of asking my teacher to stay after school to get to use the computer for “fun,” I decided to take the $300 I had been squirrelling away for an 8-track stereo and ask my parents for the difference to buy the used demo model I had seen in the Radio Shack store 30 miles from home.  \t\tI lived in a small farming town in Kansas and the likelihood that I would have any computer time was grim. But, my parents were the kind that cou\n......", "posttime": "2022-02-12 23:33:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "个人,stories,trs", "title": "关于TRS-80的个人故事", "title_en": "Personal Stories about the TRS-80", "transed": 1, "url": "https://www.trs-80.com/wordpress/personal-stories/", "via": "", "real_tags": ["个人", "stories", "trs"]}, {"category": "", "categoryclass": "", "imagename": "13a8afb13b4b83a7af842ef476cb4734.png", "infoid": 1072751, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "街机出来了改变这一点。立即向公众推出的互动演示公司正在使公司更容易创建演示视频，称为“拱廊”，这将通过他们的工具工作如何运作。\n克拉克和曼加兰于2021年初创立了该公司，并于去年7月在私人测试版中启动了它。到目前为止，它在候补名单上有大约300个。其中，90家公司开始使用产品的免费版本，并于到目前为止创造了125多个Arcades。\n拥有营销背景的Clark告诉TechCrunch，而她和曼加兰在阿特拉斯人，她说，她说开创了产品LED增长的概念，他们发现许多客户在网站之外发现了他们的产品。问题是，他们没有看到如何让这些发现更好的解决方案。\n客户始终存在他们购买的产品和工具的期望，但克拉克在过去的几年里说，这种心态已经转移到他们将不再盲目注册的心态转向一个。\n新资金将使街机建立其产品和网站，因为它还期待添加更多的工程和产品设计师。克拉克表示，三个团队一直在支持90家公司，但她希望在年底之前加倍。\nAditi Maliwal，Upfront Ventures的合作伙伴通过电子邮件表示，Clark是一位朋友，她已经知道了几年，并且“兴奋地走了五到十年 - 如果不再旅程”。\n从Get-Go Maliwal认为，创始人都集中在寻找可以转化为全职客户的设计合作伙伴。她补充说，当他们在亚斯坦人工作时，他们看到了将您的产品和客户提供的产品有多强大。", "note_en": "Arcade is out to change that. The interactive demo company, which launched to the public today, is making it easier for companies to create demonstration videos, called “arcades,” that walk people through how their tools work.\n Former Atlassian co-workers Caroline Clark and Rich Manalang are behind the company, which also announced $2.5 million in seed funding led by Upfront Ventures, with participation by Sequoia and a group of angel investors, including Mathilde Collin, Laura Behrens Wu, Jaren Glover, Eric Wittman, Jay Simons, Jonathan Widawski and Lenny Rachitsky.\n  Clark and Manalang founded the company in early 2021 and launched it in private beta form last July. It has about 300 on the waitlist so far. Among them, 90 companies started using a free version of the product and have created more than 125 arcades so far.\n  Arcade remembers what you click on so users can make a version of their demo and then embed snippets of the product into websites, blogs and tweets so that people who haven’t used the product before can see it before signing on for a trial.\n Clark, who has a marketing background, told TechCrunch that while she and Manalang were at Atlassian, which she says pioneered the concept of product-led growth, they found that many customers were discovering their products outside of the website. The problem was, they didn’t see a solution for how to make those discoveries better.\n “We wanted to create a world where people discovered products in an easy and playful manner that clearly showed what they were getting,” she added.\n  Customers have always had expectations of products and tools they are buying, but Clark said in the past couple of years, that mindset has shifted to one where they will no longer blindly sign up.\n Historically, selling involved hiding behind the demo, and once the company got the person’s information, it was more of a “gotcha” moment. One of Arcade’s customers, Clockwork, which works with financial professionals, often asks potential users to connect their invoices to the product so users can see how Clockwork operates, but that is a big ask, Clark said. By utilizing Arcade, Clockwork is able to give potential customers a taste of what their platform is like without uploading that data. Carta is another customer that is deploying arcades across its social media, Clark said.\n The new funding will enable Arcade to build out its product and website as it also looks to add more engineering and product designers. Clark says the team of three have been supporting 90 companies, but she wants to double that by the end of the year.\n  “We are about helping people know what they are getting into before they load their data,” Clark said. “We plan to invest more in product updates, integration into other properties and how customers can make a more powerful tool.”\n Aditi Maliwal, partner at Upfront Ventures, said via email that Clark was a friend that she had known for a couple of years and is “excited to go on a five- to 10 year- — if not longer journey with.”\n “She is a values driven, intellectually honest founder,” Maliwal added. “I invest in strong founders, who I believe have founder-market fit and are building an authentic vision. I knew from very early on that no matter what Caroline was building I would want to invest in it. The PLG market is also growing so quickly, and our worlds are almost entirely virtual at this point. The idea of getting on a Zoom or a call with a sales rep in order to try out a vendor’s product feels disruptive to a users’ needs and flow. It should be much easier to for users to simply see an instance of their data on a vendor’s landing page. Arcade is empowering creators to develop magical experiences and for them to feel proud of their work.”\n From the get-go Maliwal believes the founders were both focused on finding design partners who could convert into full-time customers. When they worked at Atlassian, they saw first-hand how powerful showing your product to your prospects and customers can be, she added.\n “They understood the pain point very early on and recognize that differentiation comes down to delight in design and keeping it as simple as possible for marketers and for end-users,” Maliwal said. “Finally Caroline and Rich are both invested in building a massive company, starting with a design forward product and a high quality team.”", "posttime": "2022-01-11 21:54:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推出,launches,产品", "title": "街机在新资本中以250万美元的价格推出'尝试在购买之前的尝试", "title_en": "\n\t\t\t\tArcade launches ‘try before you buy’ demo capabilities with $2.5M in new capital\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/01/11/arcade-try-before-you-buy-demo/", "via": "", "real_tags": ["推出", "launches", "产品"]}, {"category": "", "categoryclass": "", "imagename": "80df216978c07d168354177fe505f19a.jpg", "infoid": 1072749, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有许多金融气，有些金融化人将自己描述为挑战者，在今天的市场上迎合了SMBS。 （我们已经涵盖了许多人;他们包括Brex，Rho，Juni，orthone，Lili，Mercury，Hatch，Anna，Tide，Viva钱包，开放等等;而且您可以争论亚马逊，提供其他货币管理和花费工具，也在空间中。）但是，目前诺维斯认为现任者是真正的“挑战者”。\n圆形是由条纹引导的，瓦尔斯企业，跨投资本，雨量企业和Boxgroup  - 所有这些都在其4000万美元的六个月前支持了Novo  - 也参与了。迄今为止的初创公司筹集了超过1.35亿美元。\nNovo现在拥有150,000名SMB客户，在去年6月的数据上涨50,000人。诺科现在统称为50亿美元的终身交易，去年6月最高为40亿美元。该公司表示，截至本月，追踪2022年的终身交易增长到70亿美元（虽然给予它只有1月份，那个数字可能会改变）。\n关于Novo非常值得注意的是，与许多其他纳布纳不同，它没有通过通过专注于基础设施的第三方和后端服务。相反，它决定将其中央功能从内部的内部建立。 （它有一个大型开发团队，主要是在印度出来，Rangel告诉我。）\n该公司还没有完全退出API。该公司在其系列和此次最新一轮之间推出了一个新的市场，可为大约1000个其他应用程序和服务提供API，可以集成到Novo体验中。在这里，它专注于坐在银行服务核心功能的特征，例如销售点，电子商务运营，发票和工资管理等。事实上，这也可能潜在能够向Novo提供最受欢迎和可能在未来内部产品的最受欢迎和潜在的价值的转向，但是现在它提供了另一种关键目的：它使Novo对其更有用客户，它为Novo提供了更多的数据来源，以建立未来的产品。\n“尽管是美国经济的核心，但美国超过3000万的小企业一直在努力访问甚至基本的金融服务，因为它们不断受到大银行的忽视，”条纹的合作伙伴，在一份声明。 “诺开的套装是一种从根本上有所不同的方法，帮助小企业成功。 Novo除了选择增量变化，而不是选择增加的银行平台，以便它不能只提供伟大的数字银行经验，但实际上将De Novo金融产品提供给渴望他们的客户群。在条纹上，我们只投资于建立惊人的产品的公司，诺沃的狂欢评论，牢固的保留和令人难以置信的增长使其清楚地建造了小企业的爱。“ Kulkarni用这一轮加入了Novo的董事会。\n“我们已经完成了收购舞蹈，”Rangel说：“但我认为我们现在将成为那些正在进行收购的人。”", "note_en": "There are a number of fintechs, some that describe themselves as challenger banks, in the market today catering to SMBs. (We’ve covered many of them; they include  Brex,  Rho,  Juni,  NorthOne,  Lili,  Mercury,  Hatch,  Anna,  Tide,  Viva Wallet,  Open and many more; and you could argue Amazon, offering other money management and spending tools, is also in the space.) But Novo sees incumbents as the real “challenger” here.\n “We are competing against big banks. They are the only ones we are concerned with because they own 99% of the market,” said Michel Rangel, CEO of Novo, in an interview earlier this month. “We believe our product is better value for businesses, but we’re happy to see others also pushing the charge forward.”\n  The round is being led by Stripes, with Valar Ventures, Crosslink Capital, Rainfall Ventures, and BoxGroup — all of whom backed Novo in its  $40 million Series A, just six months ago — also participating. The startup to date has raised just over $135 million.\n A lot of startups are getting into patterns of raising large funding rounds in rapid succession to ride their respective waves of growth, and to capitalize on the huge opportunity right now to tap deep-pocketed investors looking for smart places to put their LPs’ money. That is very much the case here with Novo, too. The company has seen truly accelerated growth in the last year, and specifically the last six months, both in terms of customer numbers and in terms of how much its app is getting used.\n Novo now has 150,000 SMB customers in the U.S., up by 50,000 on last June’s figures. And Novo has collectively now seen $5 billion in lifetime transactions, up by $4 billion on last June’s $1 billion. The company said that as of this month, it’s on track to see lifetime transactions for 2022 grow to $7 billion (although given it’s only January, that figure is likely to change).\n “The pandemic was a catalyst for our growth,” said Rangel, who co-founded Novo with  Tyler McIntylre, who is now the CTO. Rangel noted that this Series B came on the back of Stripes approaching Novo “at the tail end of its Series A” after the term sheets had already been signed. Watching its growth after that “validated” another quick round of funding, he added.\n  One thing that is very notable about Novo is that, unlike a number of other neobanks, it has not taken the “embedded finance” approach by porting in a number of basic services by way of APIs built by third parties that focus just on infrastructure and backend services. Instead, it decided to build its central functions from the ground up in-house. (It has a large development team, mostly based out of India, Rangel told me.)\n “We say everything starting from the underlying core processor that powers the bank to what is in the hands of our 150,000 business customers has been built in house,” Rangel said. (Middlesex Federal Savings handles the banking license, FDIC insurance, and access to rails for Novo.) Rangel added that its choice to build was partly done out of necessity, since in 2016 there weren’t many banking-as-a-service platforms to provide those APIs. “That has unshackled us from someone else’s release schedule, and it means tighter margins,” he continued, but it does have its challenges, for example, in sometimes keeping product focus, and the investment needed to continue maintaining all that technology.\n The company also hasn’t entirely opted out of APIs. Between its Series A and this latest round, the company launched a new Marketplace where it provides APIs for some 1,000 other apps and services that can be integrated into the Novo experience. Here, it focuses on features that sit otutside of the core functionality of a banking service, for example point of sale payments, e-commerce operations, invoice and payroll management and more. This, in fact, can also potentially provide a steer to Novo on what might be most popular and potentially worth considering as in-house products in the future, but for now it serves another couple of key purposes: it makes Novo more useful for its customers, and it provides more data sources to Novo to build future products.\n Chief among those, Rangel said, will be a new lending product where loan applications will be evaluated quickly and (the hope is) more accurately by bringing in and considering a wider set of data that gives a more informed picture of how a business is operating. This is not unlike how, for example, Stripe and Shopify have built their own cash advance and credit products; the difference here is that Novo is intentionally aiming to source as much siloed data as possible to have the most complete picture of a business’s financial health.\n  “Despite being the heart of the U.S. economy, the more than 30 million small businesses in the U.S. have always struggled to access even basic financial services as they are constantly overlooked by the big banks,” said Saagar Kulkarni, a partner at Stripes, in a statement. “What sets Novo apart is a fundamentally different approach to helping small businesses succeed. Instead of opting for incremental change, Novo built its banking platform from the ground up so that it could not just deliver a great digital banking experience, but actually deliver de novo financial products to a customer base that is yearning for them. At Stripes, we only invest in companies building amazing products, and Novo’s rave reviews, strong retention, and incredible growth make it clear it has built something that small businesses love.” Kulkarni is joining Novo’s board with this round.\n As the company continues to grow, Rangel said one other area it will be considering is picking up potential smaller players that fit with its bigger strategy. That’s if it doesn’t get acquired itself first. Rangel said it has been approached by at least one significant player in recent years but decided to stay solo. (That may have been for the best for other reasons, too: that company has since been acquired itself, one of the byproducts of changing tides due to the pandemic.)\n “We’ve done the acquisition dance,” Rangel said, “but I think we’ll be the ones doing the acquiring now.”", "posttime": "2022-01-11 21:26:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "smbs,led,novo", "title": "基于迈阿密的Novo，SMBS Neobank，由700米700米的条纹培养了90万系列B", "title_en": "Miami-based Novo, a neobank for SMBs, raises a $90M Series B led by Stripes at a $700M valuation", "transed": 1, "url": "https://techcrunch.com/2022/01/11/novo-the-smb-neobank-nabs-90m-at-a-700m-valuation/", "via": "", "real_tags": ["smbs", "led", "novo"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072748, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据该公司及其投资者及其投资者称，销售翻新的iPhone和其他电子设备的在线市场，促使资金增加到估值至57亿美元，跨越多年前的价值。\n该公司总部位于巴黎，最新资金筹集了5.1亿美元。领导投资是Sprints Capital，这是一家基于伦敦的投资公司，在其其他技术公司控股中核实在线支付公司革命。\n加入投资回合是电子商务运营商现有的投资者，大西洋; Eurazeo基于巴黎的私募股权公司; AglaéDitanBernault的风险投资 - 和伦敦的一代投资管理LLP。\n翻新器和品牌通过Backmarket.com直接向消费​​者销售，该公司在每个销售中获得佣金。该公司不披露财务状况。\n“新电子产品的销售增长和从垃圾填埋场转移这些设备的安装压力会为后达市场赢得更多业务，”Henrik Persson（Sprint）管理伴侣表示，赢得更多业务。“\n背部市场与基于美国的平台相竞争，如Swappa和Ecoatm International Ltd.，但与其一些竞争对手不同，所有物品都直接来自认证的翻新器，经销商和品牌。\n公司希望翻新电子设备可以复制二手车市场。经过翻新的设备占全球全球电子产品全销售额的6％。相比之下，使用约70％的汽车购买汽车，Hug de Larauze先生说。", "note_en": "Back Market, an online marketplace that sells refurbished iPhones and other electronic devices, has raised funding that boosts its valuation to $5.7 billion, leapfrogging what it was worth less than a year ago, according to the company and its investors.\n  Founded in 2014, Back Market fixes and resells electronic goods, including  Apple   and  Samsung smartphones and tablets, MacBook, Dell and  Microsoft laptops, Krups coffee makers and Dyson hair dryers.\n  The company, based in Paris, raised $510 million in its latest funding round. Leading the investment was Sprints Capital, a London-based investment firm that counts online payments company Revolut among its other technology-company holdings.\n  The new $5.7 billion valuation is almost an 80% jump from the $3.2 billion level Back Market achieved in May, when it raised $335 million. The increase underscores the  heady market for startups in Europe, which had previously been seen as an  also-ran in the tech universe.\n      Also joining the investment round were the e-commerce operator’s existing investors, General Atlantic;  Eurazeo  a Paris-based private-equity firm; Aglaé Ventures, the venture-capital arm of  luxury titan Bernard Arnault; and London’s Generation Investment Management LLP.\n  Back Market, based in Europe, has earmarked the new funds to double the size of its staff in the U.S. to about 100 this year and to boost its total global employee count by 350 to 1,000. It entered the U.S. in 2018 and expects to generate triple-digit annual revenue growth this year, said Thibaud Hug de Larauze, its co-founder and chief executive.\n  Refurbishers and brands sell directly to consumers through Backmarket.com and the company earns a commission on each sale. The company doesn’t disclose financials.\n  The investment is a bet on growing consumer demand for products that reduce electronic waste and offer discounted prices, particularly at a time when inflationary pressures are increasing.\n  “The sales growth of new electronics and the mounting pressures to divert these devices from landfills creates a massive opportunity for Back Market to win more business,” said Henrik Persson, Sprints’ managing partner.\n  Electronic waste contains toxic additives and hazardous substances such as mercury, yet only 17.4% of 2019’s e-waste was collected and recycled, according to a United Nations report published the following year.\n  Back Market competes with U.S.-based platforms like Swappa and ecoATM International Ltd. But unlike some of its competitors, all of its items come directly from certified refurbishers, distributors and brands.\n  The defective rate of devices sold over Back Market’s platform is about 4%, almost on par with the average unofficial rate of new devices, the company says. All purchases come with a contractual warranty that allows buyers to return faulty devices for a full refund.\n  The company hopes refurbished electronics can replicate the  secondhand car market. Refurbished devices represent about 6% of total global annual sales of electronics. By comparison, about 70% of cars purchased are used, Mr. Hug de Larauze said.", "posttime": "2022-01-11 21:25:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "iphone,sprints", "title": "基于巴黎的后期市场，一个用于翻新的iPhone和其他设备的在线市场，由Sprints Capital估价为510亿美元，估值$ 5.7B", "title_en": "Paris-based Back Market, an online marketplace for refurbished iPhones and other devices, raises $510M led by Sprints Capital at a $5.7B valuation", "transed": 1, "url": "https://www.wsj.com/articles/refurbished-iphone-seller-back-market-hits-5-7-billion-valuation-11641902402?mod=djemalertNEWS", "via": "", "real_tags": ["iphone", "sprints"]}]