[{"category": "", "categoryclass": "", "imagename": "c88b9580016859586046269d456b0099.jpg", "infoid": 1006085, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此网页以及其他几个项目(VPN、虚拟化、远程基础设施监控等)。都是从我的家庭实验室托管的，如上图所示。", "note_en": "This web page, along with several other projects (VPNs, virtualization, remote infrastructure monitoring, etc.) are hosted from my home lab, pictured above.", "posttime": "2020-06-11 09:59:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "homelab,vpn", "title": "自托管Homelab网站", "title_en": "Self-Hosted Homelab Website", "transed": 1, "url": "https://hydn.dev/homelab/", "via": "", "real_tags": ["homelab", "vpn"]}, {"category": "", "categoryclass": "", "imagename": "27037f3d6116bb61e74f4c78d02e50b4.png", "infoid": 1006084, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "AWS CodeArtiact是一项完全托管的软件工件存储库服务，使任何规模的组织都可以轻松安全地存储、发布和共享软件开发过程中使用的包。CodeArtiact使您不再需要设置、操作和扩展工件管理所需的基础设施，这样您就可以专注于软件开发。使用CodeArtiact，您只需为您使用的内容付费，而无需支付许可费或前期承诺。\nAWS CodeArtiact可与常用的包管理器和构建工具配合使用，例如Maven和Gradle(Java)、NPM和YAR(JavaScript)、pip和twine(Python)，从而可以轻松地将CodeArtiact集成到您现有的开发工作流中。可以将CodeArtiact配置为自动从公共构件存储库(如NPM public Registry、Maven Central和Python package Index(PyPI))获取软件包，从而确保团队能够可靠地访问最新的软件包。\nIT领导者可以使用AWS CodeArtiact创建集中式存储库，用于共享其开发团队批准使用的软件包。CodeArtiact与AWS Identity and Access Management(IAM)的集成为他们提供了控制谁有权访问包的能力。此外，CodeArtiact对AWS CloudTrail的支持使领导者能够清楚地了解哪些软件包正在使用以及在哪里使用，从而可以轻松识别需要更新或删除的软件包。CodeArtiact还支持使用AWS密钥管理服务进行加密，因此客户可以控制用于加密其包的密钥。\n要了解有关AWS CodeArtiact的更多信息，请查看博客，访问CodeArtiact产品页面或参考CodeArtiact文档。\n您可以在这里查看AWS CodeArtiact可用的AWS区域的完整列表﻿。", "note_en": "AWS CodeArtifact is a fully managed software artifact repository service that makes it easy for organizations of any size to securely store, publish, and share packages used in their software development process. CodeArtifact eliminates the need for you to set up, operate, and scale the infrastructure required for artifact management so you can focus on software development. With CodeArtifact, you only pay for what you use and there are no license fees or upfront commitments.\n  AWS CodeArtifact works with commonly used package managers and build tools such as Maven and Gradle (Java), npm and yarn (JavaScript), pip and twine (Python), making it easy to integrate CodeArtifact into your existing development workflows. CodeArtifact can be configured to automatically fetch software packages from public artifact repositories such as npm public registry, Maven Central, and Python Package Index (PyPI), ensuring teams have reliable access to the most up-to-date packages.\n  IT leaders can use AWS CodeArtifact to create centralized repositories for sharing software packages approved for use across their development teams. CodeArtifact’s integration with AWS Identity and Access Management (IAM) provides them with the ability to control who has access to the packages. Further, CodeArtifact’s support for AWS CloudTrail gives leaders visibility into which packages are in use and where, making it easy to identify packages that need to be updated or removed. CodeArtifact also supports encryption with AWS Key Management Service so customers can control the keys used to encrypt their packages.\n  To learn more about AWS CodeArtifact check out the  blog, visit the CodeArtifact  product page or refer to CodeArtifact  documentation.\n  You can see a full list of AWS Regions where AWS CodeArtifact is available  ﻿here. ﻿", "posttime": "2020-06-11 09:58:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,codeartifact,codeartiact", "title": "AWS CodeArtiject：完全托管的软件工件存储库服务", "title_en": "AWS CodeArtifact: A fully managed software artifact repository service", "transed": 1, "url": "https://aws.amazon.com/about-aws/whats-new/2020/06/introducing-aws-codeartifact-a-fully-managed-software-artifact-repository-service/", "via": "", "real_tags": ["软件"]}, {"category": "", "categoryclass": "", "imagename": "a6ff60e6c88915f32022949e7bd761be.png", "infoid": 1006082, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“好的，我准备好了，”亚历克斯说。我丈夫穿着他的绿色手术服，里面是一件医院发行的夹克，他的名字绣在左上角的心脏上：亚历山大·福滕科(Alexander Fortenko)医生，急诊内科。我的眼睛看到了他鼻梁上慢慢生长的红色压疮。\n他满怀期待地看着我。他在等我背诵我每班前做的咒语。“我爱你，”我说。“注意安全。远离生病的人。“。这是我们的护身符--这是一个不可能的要求，我希望违背所有的理性，能保证他的安全。他已经开始依赖它了，这让我很担心。\n我走进医院，径直走向医生的办公室和储物柜。一旦我打开门，我就给我的手消毒，然后我把护目镜从背包里拿出来。这些是可重复使用的，而且我们只有一对-通常情况下，我每隔几个病人就会清理和重新消毒这些东西，大约在12小时的轮班中大约五六次。然后，我把背包放到储物柜里。我确保我不会碰任何东西，除了我绝对必须要碰的东西。当我还戴着外科口罩时-就是我从家里戴的那个-我走进了急诊室。\n我要做的第一件事是从店员那里拿一个N95口罩，他通常会记录每个人一天中拿到了多少个口罩。在几周前纽约的高峰期，当物资稀缺时，办事员会实时统计谁收到了面具，以及什么时候收到的。我洗手，然后穿上我的N95。我要确保它密封得很紧。它痛苦地扎进我鼻子上的压疮，我的眼睛开始流泪。我练习做几次呼吸--空气紧紧地吸着，就像我在用吸管吸气一样。那很好。只有在呼吸困难的时候才是安全的。我在上面放了一个外科口罩，以保护N95，然后我再次清洁我的护目镜，并戴上它们。这是我最后一次摸我的脸。\n现在我开始用漂白湿巾清洁我的工作站，以避免以前使用过它的人可能造成的污染。它是仪式性的和彻底的-同样的事情，每一次轮班。我首先清洁的是椅子--它的靠背，然后是座椅，然后是任何把手。我走到桌子前--上面和下面也是。然后是我的键盘-在每个字母和行之间。然后我把它翻过来，把后面也擦干净。我走到鼠标旁边，小心地确保我也清洁了电线和轮子。电话就是下一个。我再打扫一遍号码之间的空隙，并特别小心听筒。最后，我会擦拭显示器和周围的墙壁或隔断，因为我在工作时可能会碰触到它们。\n我登录并开始检查我的病人数量。每个病人都被推定为COVID。阑尾炎的病人？科维德。卒中?。也叫COVID。腿疼吗？科维德。我们了解到，每一次遭遇都是潜在的暴露。因此，尽管纽约已经过了高峰期，但我们不能不保持高度警惕。\n在我看我的第一个病人之前，我洗手并戴上一副新手套。然后我把一件黄色的一次性礼服套在我的手术服上，然后戴上第二副手套，确保我把黄色礼服的袖子套进这第二双手套里，这样我的手腕就不会露出。我再次检查我的口罩和护目镜，以确保它们是舒适的，然后我走进房间。\n在接下来的12个小时里，我独自在家陪着我们21个月大的儿子罗南。当罗南在打盹时，我忙于自己的工作。当他醒来时，我们一起玩耍和读书。我断断续续地打扫公寓，心急如焚：我把玩具收起来，知道10分钟后它们会被拉出来再次丢弃。我是他玩具篮里的西西弗斯。然后，我擦拭经常接触到的表面，用吸尘器吸尘，并给亚历克斯淋浴的浴缸漂白。\n下午三点左右，我开始吃晚饭，试着做足够几顿饭吃的东西-我已经精通千层面和炖肉，任何可以重新加热的东西。下午5点，我喝了一天中的第三杯咖啡，然后给罗南放了点音乐。他跳舞的时候我回复工作邮件。我几乎一直在和他打交道，这使得我很难离开现在去任何地方。这是一种祝福，让我不用担心亚历克斯。\n下午6点57分，我们隔壁大楼的邻居拿着萨克斯管走出阳台，弹着“带我出去看球赛”，紧随其后的是“上帝保佑美国”。他是一位年长的绅士，可能80出头，喜欢用亮粉色来配饰-通常是一顶帽子，有时是一件看起来很舒服的羊毛衫。罗南砰的一声敲了敲我们的窗户，大喊“巴沃！”欣喜若狂--他还是发不出R的音。他在阳台上挥手鞠躬表示谢意。\n一旦我和病人在房间里，我试着保持6英尺的距离。视情况而定，我通常是一个人。有时，如果病人病情危重，可能会有护士或其他工作人员，但大多数情况下，我们会尽量减少进入的人数，以保存个人防护用品。我走近病人检查他们-我听他们的肺，我看他们的喉咙后面，我检查他们的腹部是否有压痛，我还看他们的腿。我们为每个人的投诉量身定做我们的例行检查-但如今，这些故事听起来都很相似。标准的历史和考试大约需要5到10分钟。\n当我看完病人后，我脱下我的黄色长袍，然后脱下最上面一层手套。我用最下面的一副手套开门。我关上门(或者拉上窗帘，取决于病人在哪里)，然后脱下剩下的一副手套。然后，我去洗手池洗手。如果病人咳嗽，或者如果我长时间靠得很近，我通常会更换手术面罩并擦去护目镜。然后，就转到下一个病人身上了。\n我明白了，我重复一项行动或例行程序越多，我就越善于成功地执行它，避免我们现在都害怕的污染。\n这是强迫症样的行为，我认为医院里的每个人都在一定程度上从这次大流行中感染上了这种行为。我一点也不偏离它。我知道这是让我安全的原因。\n我想，她这么说是为了搞笑。她知道这是个不可能的要求。但我不确定我的妻子是否意识到了我肩上的重担--我觉得有责任保证安全。我已经两个多月没有拥抱我的家人了--任何能让他们不感染可能会杀死他们的病毒的事情。\n一个病人进来了，DNR/DNI。由救护车送来的。超级变态。血氧水平在40多岁。虚弱，脱水-脱水得护士不能给他们静脉注射。我们必须做IO-骨内-在他们的胫骨上钻一根针，以便给他们补水和用药。这是一个痛苦的过程，但他们不会退缩-不要对疼痛做出反应，因为他们病得很重。\n因为“请勿插管”的命令，我们无能为力。BiPAP机器是一个简单的选择，但考生必须足够清醒，以协调他们的呼吸与设备。这个病人没有足够的精神能力来处理这件事。我们还知道，BiPAP将病毒雾化，通过空气传播新冠肺炎，将整个急诊室置于危险之中。\n正当我和我的团队讨论病人的治疗计划时，他们的搭档来了。他们要求被允许进入病人的房间，因为他们知道接下来会发生什么。他们感觉到了。我们都是这样做的。当配偶告诉我是时候停止争吵了-让病人舒服点。我看了看房间--病人呼吸非常快，很明显处于窘迫状态，所以我们给他们打了一点吗啡来帮助他们缓解呼吸。\n我和我的团队聚在一起，我们决定，只要合伙人了解呆在房间里的风险，他们就应该被允许进入房间。我们给他们穿上睡袍，解释安全程序，然后让他们进来。他们坐在床边等着，我们从窗户看。\n我们眼睁睁地看着病人的血氧浓度直线下降，意识到会发生什么--随时都会发生。他们的伴侣坐在他们旁边，我们看着他们的嘴唇在动--我们听不清任何话，只有温柔而舒缓的喃喃自语。\n警报器在房间和整个急诊室响起，几秒钟内，我们的一名护士走进去把它关掉了。我紧跟着她--重新穿上长袍，宣布死亡时间。\n当他们伤心地哭泣时，我握着他们戴着手套的手。难以想象：当一个人无助地坐在旁边，看着他们所爱的人变得越来越苍白，看着生活慢慢离开他们的身体时，他们一定会感到悲伤。在这种情况下不让他们享受人类的舒适是多么不公平。\n我感觉我对他们的手的握力放松了，我把他们拉了进来拥抱他们。和我在房间里的护士注视着我的心跳，然后静静地坐在另一边和我一起，双臂环抱着悲痛-一个临时的盾牌。\n“让我们为爸爸欢呼吧！”我从我们的一个小罐子和一个木勺里递给罗南一个不锈钢盖子，我们绕着我们的小厨房走来走去，制造了相当大的噪音。\n我想知道，在短暂的恐慌中，当他长大后，他是否会记住这一点，以及如何记住这一点。\n到晚上7：30，罗南已经吃过晚饭，洗过澡了。我们和祖父母一起聊天，读了最后一本书，7点45分，他在床上过夜。\n晚上8点左右，我收到亚历克斯发来的短信：“成交。回家了。“。\n这半个小时的独处是我一天中最难熬的部分。我一直在抵挡的所有恐惧和焦虑终于有机会表明自己了，它们确实做到了。贪婪地，怀着复仇之心-如果今天是亚历克斯感染病毒的日子呢？如果他病得很重怎么办？如果我病得很重怎么办？谁来照顾罗南？\n接下来是一些痛苦而病态的心理解释：我死了可能会更好。亚历克斯比我强壮。他将能够重建。他会给罗南一个更快乐的童年。\n我沉迷于这种世界末日的想法，因为它让我的大脑为最坏的情况做好了准备。如果我们中的一个人真的生病了，那不会完全令人震惊--也不会让我完全虚弱。至少我是这么告诉自己的。我需要考虑这些事情，我不能告诉其他任何人，因为-嗯，谁会愿意和我一起在水下度过那段时间呢？我觉得我几个月来一直在为大热做准备。累死了。\n亚历克斯和我所做的就是谈论冠状病毒。尽管我们都在讨论数字、趋势、患者、死亡人数和疫苗，但我们很少谈论他在医院看到的情况。我们从不谈论真正可怕的事情，担心大声呼吸会引起他们对我们的注意。\n当亚历克斯最终回到家时，他在我们的前门外脱掉了他的手术服，把它们塞进一个塑料袋里，然后紧紧地绑上。他脱下医院的木鞋，把它们放在外面，还有他的背包和外套。\n我们问我们的隔壁邻居，一位可爱的60多岁的妇女，她正在与癌症作斗争，她是否同意这一点。“当然，当然，”她说，当我们解释说我们害怕罗南会无意中碰到它们时，她的眼睛里充满了泪水。这些天他什么事都干。\n一进门，亚历克斯就和我打了个简短的招呼，然后跳进淋浴间，花了整整15分钟为自己减压和消毒。我在洗手间门口静静地等着他，听着。什么都没有-没有丝瓜络擦洗，没有水溅，也没有几乎空的洗发水瓶子里的树莓。他站在浴缸里一动不动，筋疲力尽。我想知道他在想什么。\n我通常不会推。有些日子，我需要的是模糊。他似乎本能地感觉到了这一点。\n但现在有些事情不同了。我厌倦了谈论这件事。我厌倦了勇敢。我厌倦了假装我不想让他辞职。别进去就好。和我们待在一起，注意安全。我已经想了一百万次了，但是，我不能让我自己说出来。我只想抓着他，即使这很自私。\n她能感觉到我在骗她，但她需要我告诉她一切都很好。所以我就这么做了。\n我在淋浴时闭上眼睛，一天的小画框就回来了。有些细节比其他的更生动--有些病人在他们离开后很久还会留在你身边。很难知道你的大脑会抓住什么，什么会给你带来痛苦。\n一个人的眼睛看着他们心脏停止跳动的确切时刻的方式。呼吸困难时发出的时而咯咯作响，时而沙哑的声音。血液在身体后部积聚和停滞的方式，出现了一个纬度鸿沟，几乎一半的血液已经不完美地浸泡在紫色的染料中。变得苍白，这就是所谓的。\n我试着把它们都洗掉。死亡感觉离表面太近了，就好像如果我足够努力地擦洗，我就可以把恐惧--原始的，兽性的--推回去。我告诉自己我需要听到的让它变得令人愉快的话-他们年纪大了，他们过着美好的生活。我忘了病人年轻的时候我说了什么。我想办法让它不那么具有破坏性。\n这就是我被困住的地方：我是别人在插管前最后见到的人之一。他们中的许多人呼吸困难，但他们是清醒的。我看着他们为这个决定而苦苦挣扎：如果我们不插管，你很可能会死。如果我们插管，你的生存机会只会稍高一点。不管怎样，这可能是你最后一次清醒了。你得说再见，以防万一。他们努力应对不确定性。他们是孤身一人。他们的眼睛睁得大大的，热泪盈眶。我该怎么办？他们想知道。你怎么做？\n我希望我能说，我记得他们所有的脸，事后我检查了他们的病历，看看他们发生了什么-他们成功了吗？但是数量太多了。\n洗完澡，没穿盔甲，他看起来很虚弱。只是人类。他吃得够吗？不，我不是这么想的。我想：我喂他吃得够多了吗？因为这不就是我们在这里做的吗-驻扎我们的瞭望塔？有效地分派我们的责任。我在做我该做的吗？我把你照顾得够好了吗？这就是我们要做的。我们互相照顾；我们很敏锐，我们在场，我们在做。误差容限为零。\n“我能做些什么呢？”我妻子想知道。我想拥抱一下，但还是忍住了。", "note_en": "“Okay, I’m ready,” Alex says. My husband is wearing his green scrubs under a hospital-issued jacket with his name embroidered on the upper left side, over his heart: Dr. Alexander Fortenko, Emergency Medicine. My eyes catch on the red pressure ulcer that’s been slowly growing on the bridge of his nose.\n He looks at me expectantly. He’s waiting for me to recite the incantation I do before each shift. “I love you,” I say. “Be safe. Stay away from sick people.” It’s our talisman — an impossible ask that I hope, against all rationality, will keep him safe. It worries me that he’s come to rely on it.\n   I walk into the hospital and head straight for the doctor’s offices and lockers. I sanitize my hands once I’ve opened the door, and then I take my goggles out of my backpack. These are reusable, and we only get one pair — typically, I clean and resanitize these every few patients, about five or six times in a twelve-hour shift. Then, I put my backpack away into my locker. I make sure I don’t touch anything else except what I absolutely must. While I’m still wearing a surgical mask — the same one I’ve worn from home — I walk into the ER.\n The first thing I do is grab an n95 mask from the clerk, who usually keeps track of how many each person has gotten throughout the day. During the peak in New York a few weeks back, when supplies were scarce, the clerk would have a running tally of who’d received a mask, and when. I wash my hands and then I put my n95 on. I need to make sure it’s tightly sealed. It digs painfully into the pressure ulcer on my nose, and my eyes start to water. I practice taking a few breaths — air comes in strained gulps, like I’m sucking it through a straw. That’s good. It’s only safe when it’s difficult to breathe. I put a surgical mask on top, to preserve the n95, and then I clean my goggles again, and put them on. This is the last time I touch my face.\n Now I begin cleaning my work station with bleach wipes, to avoid possible contamination from the person who has previously used it. It’s ritualistic and thorough — the same thing, every shift. The first thing I clean is the chair — the back of it, then the seat, then any handles. I move on to the desk — the top and underneath, too. Then my keyboard — between each letter and row. Then I turn it over and clean the back as well. I move on to the mouse, taking care to make sure I also clean the cord and the wheel. The phone is next. I clean again between the numbers and take special care with the receiver. Finally, I wipe down the monitor and any surrounding walls or partitions that I might touch incidentally while working.\n I log in and start to review my patient load. Every patient is presumed COVID. A patient with appendicitis? COVID. Stroke? Also COVID. Leg pain? COVID. We’ve learned that every encounter is a potential exposure. So, despite New York being past peak, we can’t afford to be anything less than extremely vigilant.\n Before I see my first patient, I wash my hands and put on a fresh pair of gloves. Then I put on a yellow disposable gown over my scrubs, and then a second pair of gloves, making sure that I catch the sleeve of the yellow gown into this second pair, so that my wrists are not exposed. I check my mask and goggles again to make sure they’re snug, and then I go into the room.\n  For the next twelve hours, I am home alone with our 21-month-old son, Ronan. I busy myself with my own work while Ronan is napping. When he wakes up, we play and read. I clean the apartment in fits and starts timed to waves of anxiety: I put the toys away, knowing they’ll be pulled out and abandoned again 10 minutes later. I am the Sisyphus of his toy basket. Then, I wipe down commonly touched surfaces, vacuum, and bleach the bathtub where Alex showers.\n Around mid-afternoon, I begin dinner and try to make enough for a few meals — I’ve become proficient in lasagnas and stews, anything that reheats well. At 5 PM, I have my third coffee of the day and I put on some music for Ronan. I answer work emails while he dances. I’m engaged with him almost constantly, which makes it difficult to be anywhere but in the present. It’s a blessing that keeps me from worrying about Alex.\n At 6:57 PM, our neighbor in the adjacent building exits onto his balcony with his saxophone and plays Take Me Out to the Ball Game , followed by God Bless America . He’s an older gentleman, probably in his early eighties, with a penchant for accessorizing with bright pink — usually a cap, sometimes a cozy-looking cardigan. Ronan bangs on our window and yells “Bavo!” gleefully — he still can’t pronounce his Rs. He’s acknowledged with a wave and a bow from the balcony.\n   Once I’m in the room with a patient, I try to maintain a six foot distance. Depending on the situation, I’m usually alone. Sometimes, if the patient is critically ill, there may be a nurse or other staff, but for the most part we try to minimize how many people go in, to conserve PPE. I approach the patient to examine them — I listen to their lungs, I look at the back of their throat, I examine their abdomen for tenderness, and I also look at their legs. We tailor our routine exam for each individual complaint — but these days, the stories all sound similar. A standard history and exam takes about five to ten minutes.\n When I’m done seeing the patient, I pull off my yellow gown and, with it, my top layer of gloves. I use the bottom set of gloves to open the door. I close the door shut (or pull the curtain, depending on where the patient is) and take off the remaining pair of gloves. Then, I head to the sink to wash my hands. If the patient was coughing or if I spent a lot of time in close proximity, I usually change the procedure mask and wipe down my goggles. Then, it’s on to the next patient.\n  I’ve learned that the more I repeat an action or a routine, the better I become at carrying it out successfully and avoiding what we all fear right now, contamination.\n It’s OCD-like behavior that I think everyone in the hospital has picked up, to a certain degree, from this pandemic. I don’t deviate from it, at all. I know it’s what keeps me safe.\n  She says it to be funny, I think. She knows it’s an impossible ask. But I’m not sure my wife realizes the weight on my shoulders — the responsibility I feel to stay safe. I haven’t hugged my family in over two months — anything to keep them from contracting a virus that could kill them.\n  A patient comes in, DNR/DNI. Brought in by ambulance. Super sick. Blood oxygen level in the 40s. Weak, dehydrated — so dehydrated the nurses can’t get an IV in them. We have to do an IO — intraosseous — drill a needle into their shinbone in order to hydrate and medicate them. It’s a painful procedure but they don’t wince — don’t react to the pain because they’re so sick.\n Because of the Do Not Intubate order, there’s not much we can do. A BiPAP machine is briefly an option, but candidates have to be lucid enough to coordinate their breathing with the device. This patient doesn’t have the mental capacity to handle that. We also know that BiPAPs aerosolize the virus — spreading COVID-19 through the air, putting the whole ER at risk.\n As I’m discussing the patient’s treatment plan with my team, their partner arrives. They ask to be allowed into the patient’s room because they know what’s coming. They sense it. We all do.  The spouse tells me it’s time to stop fighting — to make the patient comfortable. I look into the room — the patient is breathing really fast, clearly in distress, so we give them a little morphine to help ease their breathing.\n I huddle with my team and we decide that as long as the partner understands the risk of being in the room, they should be allowed inside. We gown them up, explain safety procedures, and let them in. They sit by the bed and wait, and we watch from the window.\n We watch the patient’s blood oxygen numbers plummet, aware of what will happen — any second now. Their partner sits by them and we watch their lips move — we can’t make out any words, just a gentle and soothing murmur.\n  The alarm blares in the room and throughout the ER and, within seconds, one of our nurses goes in to turn it off. I am on her heels — re-gowned, to call the time of death.\n I hold the partner’s gloved hand as they cry inconsolably. Unimaginable: the grief one must feel as they sit helplessly by, watching their loved one grow paler — watching life slowly leave their body. How unfair it feels to withhold human comfort from them in these circumstances.\n I feel my grip relax on their hand and I pull them in for a hug. The nurse in the room with me watches for a beat and then joins me quietly on the other side, interlocking her arms around the grieving — a temporary shield.\n  “Let’s cheer for papa!” I hand Ronan a stainless steel lid from one of our smaller pots and a wooden spoon, and we march around our small kitchen, making quite the racket.\n I wonder, in a brief moment of panic, if and how he’ll remember this when he’s older.\n By 7:30 PM, Ronan has had dinner and bathed. We FaceTime with both sets of grandparents, read one last book and at 7:45, he’s in bed for the night.\n At around 8 PM, I get a text from Alex: “Done. Coming home.”\n This half an hour of solitude is the hardest part of my day. All the fears and anxieties I’ve been warding off finally have a chance to declare themselves, and they do. Greedily, with vengeance — What if today is the day Alex contracted the virus? What if he gets very ill? What if I get very ill? Who will take care of Ronan?\n This, followed by some painfully morbid mental accounting: It’s probably better if I die. Alex is stronger than I am. He’ll be able to rebuild. He’ll give Ronan a happier childhood.\n I indulge myself in this doomsday thinking because it’s priming my brain for the worst case scenario. If one of us does get sick, it won’t come as a total shock — it won’t totally debilitate me. At least that’s what I tell myself. I need to think about these things and I can’t tell anyone else about them because — well, who would want to spend that time with me, underwater? I feel as if I’ve been bracing for a hit for months now. I’m exhausted.\n All Alex and I do is talk about coronavirus. And in spite of all our discussions about numbers, trends, patients, death toll, and vaccines, we seldom talk about what he sees at the hospital. And we never talk about the really scary things, afraid that by breathing them aloud we might call their attention to us.\n  When Alex finally gets home, he takes his scrubs off outside our front door and stuffs them into a plastic bag that he ties off tightly. He takes his hospital clogs off and leaves them outside, along with his backpack and coat.\n We asked our next door neighbor, a lovely 60-something-year-old woman who is battling cancer, if this was alright with her. “Of course, of course,” she said, her eyes filling with tears when we explained that we were afraid Ronan would touch them unwittingly. He gets into everything these days.\n Once inside, Alex greets me briefly and jumps into the shower where he spends a good fifteen minutes decompressing and sanitizing himself. I wait for him quietly in the bathroom doorway and listen. Nothing — no loofah scrubbing, no water splashing, and no raspberries from almost-empty shampoo bottles. He’s standing still in the tub, exhausted. I wonder what he’s thinking.\n   I don’t usually push. Some days, vague is what I need. He seems to instinctively sense that.\n But something is different now. I am tired of talking around this thing. I am tired of being brave. I am tired of pretending that I don’t want to ask him to quit. Just don’t go in. Stay here with us, stay safe. I have thought it a million times and yet, I can’t bring myself to give voice to it. I just want to hold on to him, even if it’s selfish.\n   She can sense when I’m lying to her, but she needs me to tell her everything is okay. So I do.\n I close my eyes in the shower and little frames of the day come back. Some details are more vivid than others — some patients stick with you long after they’re gone. It’s hard to know what your brain will latch on to, what will cause you pain down the road.\n The way someone’s eyes look at the exact moment that their heart has stopped beating. The sometimes gurgling, sometimes raspy sound someone makes when they can’t breathe. The way that blood pools and stagnates at the back of the body, a latitudinal divide emerging, almost like half of it has been dipped imperfectly in purple dye.  Lividity, it’s called.\n I try to wash it all away. Death feels too close to the surface, like if I scrub hard enough, I can push back the fear — the rawness, the animalism. I tell myself what I need to hear to make it palatable —  they were older, they lived a good life. I forget what I say when the patient is young. I find something to make it less devastating.\n This is what I get stuck on: I am one of the last people someone sees before they’re intubated. Many of them have difficulty breathing, but they’re awake. I watch them struggle with the decision: If we don’t intubate, you’ll most likely die. If we do intubate, your chance of survival is only slightly better. Either way, this may be the last time you’re ever lucid. You have to say goodbye,  just in case. They grapple with uncertainty. They’re alone. Their eyes widen, fill with tears.  What should I do?They want to know.  What would you do?\n I wish I could say that I remember all of their faces, that I check their charts afterwards to see whatever happened to them — did they make it? But there are too many.\n  Out of the shower, armorless, he seems frail. Just human. Has he been eating enough? No, that’s not what I think. I think: Have I been feeding him enough? Because isn’t that what we’re doing here — manning our lookout towers? Effectively dispatching our responsibilities. Am I doing my part? Am I taking care of you well enough? That’s what we do. We take care of each other; we’re sharp, we’re present, we’re on it. The margin for error is zero.\n     “What can I do?” my wife wants to know. I go in for a hug, but stop myself.", "posttime": "2020-06-11 09:41:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "嫁给,er,病人", "title": "我嫁给了纽约市的一个急诊室医生", "title_en": "I'm Married to an ER Doc in NYC", "transed": 1, "url": "https://superorganizers.substack.com/p/im-married-to-an-emergency-room-doctor", "via": "", "real_tags": ["嫁给", "er", "病人"]}, {"category": "", "categoryclass": "", "imagename": "83634ca5a1f041cc7d0dc7919062721e.jpeg", "infoid": 1006079, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您或您认识的人正面临驱逐，CNBC希望听到您的消息。请向财经记者Alicia Adamczyk发送电子邮件至alicia.adamczyk@nbcuni.com。\n甚至在冠状病毒大流行之前，美国就正在经历住房专家和倡导者认为的驱逐危机。每年有200多万人面临驱逐，远远超过2008年抵押贷款危机最严重时期面临丧失抵押品赎回权的人数。\n专家预计，未来几个月，驱逐危机将变得更加严重。新冠肺炎的经济衰退对租房者的打击尤其严重。他们将在服务业就业岗位中占据不成比例的份额，该行业已因冠状病毒关闭而遭受重创。\n事实上，根据城市研究所(Urban Institute)的数据，在今年3月25日至4月10日期间，在18岁至64岁的租房者中，近一半的人报告说，他们在支付房租或水电费方面遇到了困难，食物不安全，或者负担不起所需的医疗费用。\n在过去的几个月里，数以千计的租户拖欠租金。城市研究所(Urban Institute)报告称，由于所在社区不成比例的失业，有色人种的处境比白人租房者的情况更糟。大约25%的黑人和拉丁裔租房者报告说，5月份没有支付或推迟租金，相比之下，白人租房者的这一比例为14%。\n为了让人们留在家里，联邦政府禁止联邦政府援助的房产在7月25日之前进行驱逐，包括马萨诸塞州、纽约州和密歇根州在内的一些城市和州也实施了自己的临时驱逐暂停令。但根据普林斯顿大学(Princeton University)追踪全国驱逐情况的驱逐实验室(Exiction Lab)的数据，其中许多禁令将于本月开始到期，具体取决于该州。\n此外，每周额外发放的600美元联邦失业救济金将于7月底到期。城市研究所(Urban Institute)住房政策高级研究员所罗门·格林(Solomon Greene)告诉CNBC Make It，这笔额外的钱让许多失业的人能够继续支付房租。再加上暂停驱逐的结束，美国可能会在未来几周经历全国范围内驱逐事件的上升。\n住房权利倡议组织创始人兼执行董事亚伦·卡尔在接受CNBC采访时表示，在全球健康危机期间驱逐居民，会使他们面临更大的感染和传播新冠肺炎的风险，将一场灾难变成一场世界末日。\n卡尔说，街上可能有很多人。尤其是在像纽约市这样已经有无家可归问题的地方，它可能会变成无家可归的噩梦。\n驱逐实验室的作家Alieza Durana告诉CNBC Make It，驱逐也会对个人和家庭产生长期的-在某些情况下，会影响几代人-的经济后果。这可能会毁掉租户多年的信用，让他们更难找到新的住处。它还给那些受影响的人带来了精神和情感上的损失，并对少数族裔社区，特别是有色人种妇女和她们的孩子造成了特别严重的打击。\n杜拉纳说，驱逐给个人、家庭和社区带来的人员伤亡真的是毁灭性的。他指出，被驱逐的租户往往会面临失业和更高的抑郁症发病率等问题。\n格林说，即使我们没有面临大流行，住房不稳定也会带来巨大的健康后果。当你因为没有地方避难而不能在适当的地方避难时，暴露的风险就会放大得多，情况也会变得更糟。(工业和信息化部电子科学技术情报研究所陈皓)。\n如果你面临驱逐，卡尔建议尽快联系你所在地区的非营利性租户组织和你选出的官员。\n专家们表示，尽管如此，这场危机需要政府做出大规模回应。全国低收入住房联盟(National Low Income Housing Coalition)主席兼首席执行官迪奈·延特尔(Dinae Yentel)在给CNBC的一份声明中表示，如果州和地方政府不尽快介入帮助，全国范围内将出现一场驱逐海啸和无家可归者激增，这不仅会摧毁个人和他们的社区，还会摧毁整个经济。\nYentel说，现在住房比以往任何时候都更像是医疗保健。确保所有人的住房稳定既是道德上的当务之急，也是公共卫生的需要。\n自疫情爆发以来，活动人士一直在推动改革和改革政策，比如增加租金补贴和取消租金补贴，尽管各州行动迟缓，联邦政府在支持租户方面也几乎没有采取什么行动。杜拉纳说，政府可以立即采取的一项措施是确保有资格获得联邦租赁援助的租户真正获得资金。目前，只有四分之一的合格收件人收到了它。\n格林说，增加对租户的资源，比如为面临驱逐的租户提供倡导者和法律支持，也将有助于在未来几年和几十年里让人们留在家里。他还主张采取有针对性的救济措施，比如拨出大约1000亿美元来支付危机期间低收入租户的租金，以及为房东提供抵押贷款减免。\n格林说，目前还没有好的数据集来估计有多少人可能因为新冠肺炎而面临驱逐。但杜拉纳说，自从一些暂停令被取消后，驱逐实验室已经注意到驱逐申请的增加。与持续数年的抵押贷款危机不同，所有面临驱逐的租户可能会在暂停令解除后的短短几个月内发现自己没有房子。\n格林希望，当前的危机将刺激房地产行业的结构性改革，包括加强对全国租户的保护，就像2008年止赎危机后经历的房主那样。他说，我们早就应该在租房者领域进行这样的改革，特别是针对低收入租户的改革。\n至少，住房专家和倡导者希望联邦政府能在全国范围内实施统一的暂缓驱逐令，而不是目前实施的临时禁令。在这场已夺走超过11.3万美国人生命的大流行中，让人们呆在家里应该是当务之急。\n5月份众议院通过的“英雄法案”(Heros Act)包括将全国范围内暂停驱逐申请、听证和执行的期限延长12个月。堪萨斯城租户权利组织KC租户的负责人塔拉·拉格胡维尔(Tara Raghuveer)告诉CNBC，这是防止租房者失去家园的一个很好的开始。该法案于5月在众议院获得通过，但到目前为止一直在参议院陷入停滞状态，该法案包括在全国范围内暂停驱逐申请、听证和处决12个月。KC租户是一家位于堪萨斯城的租户权利组织。\n我确实认为在这一点上任何一次驱逐都是不人道的。Raghuveer说，如果人们被迫离开家园，这将带来潜在的人力成本，生命成本。我认为甚至一次驱逐都不应该发生。", "note_en": "If you or someone you know is facing eviction, CNBC Make It would like to hear from you. Please email money reporter Alicia Adamczyk at alicia.adamczyk@nbcuni.com.\n Even before the coronavirus pandemic, the U.S. was experiencing what housing experts and advocates deemed an eviction crisis.  More than 2 million people face eviction each year, far more than the number of people who faced foreclosure at the height of the 2008 mortgage crisis.\n  Experts expect the eviction crisis to get far worse in the coming months. The Covid-19 economic recession has hit renters especially hard. They  make up a disproportionate share of service sector jobs, an industry that has been decimated as a result of the coronavirus shutdowns.\n In fact, between March 25 and April 10 of this year,  nearly half of renters aged 18 to 64 reported that they were having trouble paying their rent or utilities, were  food insecure or couldn&#39;t afford needed medical care, according to the Urban Institute.\n Thousands of tenants have been missing rent payments over the past few months. People of color have fared worse than white renters due to the  disproportionate job loss in their communities, the Urban Institute reports. About 25% of black and Latino renters  reported not paying or deferring rent in May, compared to 14% of white renters.\n To keep people in their homes, the federal government banned evictions in federally assisted properties through July 25, and some cities and states,  including Massachusetts, New York and Michigan, put their own  temporary eviction moratoriums in place. But  many of those bans begin expiring this month depending on the state, according to Princeton University&#39;s Eviction Lab, which tracks evictions across the country.\n Plus, the  extra $600 per week in federal unemployment benefits is  set to expire at the end of July. That extra money is &#34;what has been allowing many people who have lost their jobs to continue paying rent,&#34; Solomon Greene, a senior fellow in housing policy at the Urban Institute, tells  CNBC Make It. Coupled with the end of eviction moratoriums, the U.S. is likely to experience an uptick in evictions nationwide in the coming weeks.\n  Evicting people in the middle of a global health crisis puts them at greater risk of contracting and spreading Covid-19, turning &#34;a catastrophe into an apocalypse,&#34; Aaron Carr, founder and executive director of the Housing Rights Initiative, tells CNBC Make It.\n &#34;A lot of people could be on the streets,&#34; says Carr. &#34;Especially in places like New York City that already have a homeless problem, it could turn into a homeless nightmare.&#34;\n Eviction also has long-term — in some cases, multi-generational — financial consequences for individuals and families, Alieza Durana, a writer with the Eviction Lab, tells CNBC Make It. It can ruin a tenant&#39;s credit for many years, making it harder for them to find a new place to live. It also takes a  mental and emotional toll on those affected, and hits minority communities,  particularly women of color and  their children, especially hard.\n  &#34;The human toll that an eviction takes on a person and family and community is really devastating,&#34; says Durana, noting that tenants who are evicted often experience  job loss and higher rates of depression, among other issues.\n  &#34;Housing instability has huge health consequences even when we&#39;re not facing a pandemic,&#34; says Greene. &#34;Exposure risk is so much more amplified and worsened when you can&#39;t shelter in place because you don&#39;t have a place to shelter.&#34;\n  If you are facing an eviction, Carr suggests contacting a  nonprofit tenant organization in your area and your elected officials as soon as you can.\n That said, the crisis requires a large-scale government response, according to experts. If state and local governments don&#39;t step in to help soon,  there will be a &#34;tsunami of evictions and a spike in homelessness&#34; nationwide, that will &#34;devastate&#34; not just individuals and their communities, but the economy broadly, Dinae Yentel, president and CEO of the National Low Income Housing Coalition, says in a statement to CNBC Make It.\n &#34;Now more than ever, housing is health care,&#34; says Yentel. &#34;Ensuring housing stability for all is both a moral imperative and a public health necessity.&#34;\n  Activists have been pushing for reforms and policies like increased rental assistance and rent cancellation since the start of the pandemic, though states have been slow to move and the federal government has done little to support tenants. One measure the government could take immediately, says Durana, is to ensure that renters who qualify for federal rental assistance actually get the funds. Currently,  only one in four eligible recipients receive it.\n Increased resources for tenants, like providing advocates and legal support to tenants facing eviction, would also help keep people in their homes in the years and decades to come, says Greene. He also advocates for targeted relief measures, like allocating roughly $100 billion to cover rent for low income tenants through the crisis, and mortgage relief for landlords.\n There&#39;s no good data set currently available to estimate how many people may face eviction because of Covid-19, says Greene. But the Eviction Lab has already noticed an increase in eviction filings since some moratoriums have been lifted, says Durana. And unlike with the mortgage crisis, that lasted years, all of the tenants facing eviction could find themselves without a home in just a couple of months after the moratoriums lift.\n Greene hopes the current crisis will spur structural changes in the housing sector, including stronger protections for tenants nationwide, like homeowners experienced after the 2008 foreclosure crisis. &#34;We&#39;re overdue to have that kind of reform in the renters space, particularly for low income renters,&#34; he says.\n At the very least, housing experts and advocates hope the federal government will put in place a uniform, nationwide eviction moratorium instead of the ad hoc bans currently in place. In the middle of a pandemic that has claimed the lives of over 113,000 Americans, keeping people in their homes should be a priority.\n And the  HEROES Act, which was passed by the House in May but has so far stalled in the Senate, includes an extension of the nationwide moratorium on eviction filings, hearings and executions for 12 months, which Tara Raghuveer, director of KC Tenants, a tenants rights group in Kansas City, tells CNBC Make It is a &#34;great start&#34; to prevent renters from losing their homes.\n &#34;I do think any one eviction at this point is inhumane. It comes at potential human cost, the cost of life, if people are forced out of their homes,&#34; says Raghuveer. &#34;I don&#39;t think even one eviction should be happening.&#34;", "posttime": "2020-06-11 09:22:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,冠状病毒,保护措施,apocalypse", "title": "随着冠状病毒保护措施在全国范围内到期，住房“启示录”即将到来", "title_en": "Housing ‘apocalypse' coming as coronavirus protections expire across the country", "transed": 1, "url": "https://www.cnbc.com/2020/06/10/how-to-prevent-the-coming-coronavirus-tsunami-of-evictions.html", "via": "", "real_tags": ["病毒", "冠状病毒", "保护措施"]}, {"category": "", "categoryclass": "", "imagename": "4c9061717d91ce9b027ff1b9ae6e7622.jpg", "infoid": 1006077, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特斯拉(Tesla)已超过丰田，成为世界上市值最高的汽车制造商，其股价已升至每股1,000美元的新高。\n随着股价的上涨，这家总部位于加州的汽车制造商在过去几年里一直在迅速攀登最有价值汽车制造商的行列。\n很难直接将特斯拉与其他汽车制造商进行比较，因为该公司不仅仅是一家汽车制造商，因为它不断增长的能源部门以及对汽车业务的科技式的做法。\n但其目前的大部分收入来自于销售汽车，这使得该公司从市值的角度来看，大多是一家“汽车制造商”。\n2018年，特斯拉的股价飙升，使其价值超过了几家主要汽车制造商，但对于这家电动汽车制造商来说，在经历了艰难的一年后，这一涨势是短暂的。\n现在，特斯拉的股票自去年年底以来又开始了一轮上涨，今天，该股再创新高，超过每股1,000美元。\n它将特斯拉的市值提高到了1800亿美元以上-超过丰田，成为全球最有价值的汽车制造商(通过u/brand dude87评选的市值最高的25家汽车制造商)：\n公平地说，特斯拉不仅通过自己的表现实现了这一目标，而且几乎所有其他汽车制造商的估值都有所下降。\n这家日本汽车制造商在全球大流行期间损失了高达20%的价值，但它仍然挽回了大部分损失。\n2010年，丰田向特斯拉投资了5000万美元，他们促成了Nummi工厂的大幅折扣出售，Nummi工厂现在是特斯拉的弗里蒙特工厂。\n早在2017年，这家汽车制造商就出售了所持特斯拉股份，获得了丰厚的利润，但这仍然只是今天价值的一小部分。\n我做多TSLA，我很高兴看到市场认识到它是一家成功的成长型公司，但我认为它有点失控-就像股市的其他部分一样。\n目前有数百万人失业，特斯拉在除亚洲以外的几乎所有市场都显示出需求疲软的明显迹象。\n我仍然对特斯拉的长期前景充满信心，但本季度将是一个艰难的季度，然而，特斯拉的股价正在创下新高。这很奇怪。\n显然，我不是唯一这样想的人，因为就在一个月前，埃隆说该股太高，当时股价为每股760美元。\n您正在阅读的是electrek，专家们日复一日地发布关于特斯拉、电动汽车和绿色能源的新闻。一定要查看我们的主页，了解所有最新新闻，并在Twitter、Facebook和LinkedIn上关注electrek，随时了解最新消息。不知道从哪里开始？请查看我们的YouTube频道以了解最新的评论。", "note_en": "Tesla (TSLA) has become the world’s most valuable automaker – surpassing Toyota – as its stock pushes to a new high at $1,000 a share.\n As its stock price rose, the California-based automaker has been rapidly climbing the ranks of the most valuable automakers in the last few years.\n It’s hard to directly compare Tesla to other automakers because the company is more than an automaker due to its growing energy division and its tech-like approach to the automotive business.\n But most of its revenue currently comes from selling cars, which mostly makes the company an “automaker” on a market capitalization standpoint.\n In 2018,  Tesla had a surge in stock price that made it more valuable than several major automakers, but it was short-lived after a difficult year on the stock market for the electric automaker.\n Now Tesla’s stock (TSLA) has been on another run since late last year and today, the stock hit another high of over $1,000 per share.\n It raised Tesla’s market valuation to over $180 billion – surpassing Toyota to become wold’s most valuable automaker (via  Top 25 Automakers by Market Cap by u/brandude87):\n  To be fair, Tesla didn’t just achieve that through its own performance but also declines in valuation from virtually all other automakers.\n  The Japanese automaker lost as much as 20% of its value during the global pandemic, but it has still recovered most of that loss.\n  In 2010, Toyota invested $50 million in Tesla and they brokered a heavily discounted sale of the Nummi factory, which is now Tesla’s Fremont factory.\n The automaker  sold its stake in Tesla for a good profit back in 2017, but it was still only a fraction of what it would be worth today.\n  I am long TSLA and I am glad to see the market recognize that it is a successful growing company, but I think it’s getting a bit out of control – like the rest of the stock market.\n There are millions of people without jobs and Tesla is showing clear signs of weak demand in virtually every market except in Asia.\n I am still confident about Tesla’s longterm prospect, but this quarter is going to be a rough one and yet, Tesla’s stock is hitting new highs. It’s weird.\n Apparently, I am not the only thinking that since it was just a month ago when Elon said the stock was too high and it was trading at $760 a share back then.\n  You’re reading Electrek— experts who break news about  Tesla,  electric vehicles, and  green energy, day after day. Be sure to check out our  homepage for all the latest news, and follow Electrek on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  YouTube channel for the latest reviews.", "posttime": "2020-06-11 08:49:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "特斯拉,位数,joins,制造商", "title": "特斯拉加入4位数俱乐部，股价突破1000美元", "title_en": "Tesla Joins 4-Digit Club, Share Price Cracks $1,000", "transed": 1, "url": "https://electrek.co/2020/06/10/tesla-tsla-becomes-wolds-most-valuable-automaker-hits-1000-per-share/", "via": "", "real_tags": ["特斯拉", "位数", "joins", "制造商"]}, {"category": "", "categoryclass": "", "imagename": "64884cdb8bad5ad833e9cd8a589b9981.png", "infoid": 1006076, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "MODEL正在招聘亲力亲为的首席工程师，他们将负责使用Node&amp；Reaction在我们的旗舰电子商务SaaS平台上运营软件开发团队和发货功能。\n做一个努力工作的人，管理一支每天都能做出高质量公关的团队。", "note_en": "Modal is hiring hands-on lead engineers who will be responsible for running software development squads and shipping feature on our flagship e-commerce SaaS platform using Node &amp; React.\n Be a hard worker, run a team that cranks out high-quality PR’s daily.", "posttime": "2020-06-11 08:31:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "hiring,团队", "title": "莫德蒙德正在聘请一名首席工程师", "title_en": "Modal is hiring a Lead Engineer", "transed": 1, "url": "https://jobs.lever.co/modal/d6c3c81d-1526-4f08-9a4e-4767dde0df17", "via": "", "real_tags": ["hiring", "团队"]}, {"category": "", "categoryclass": "", "imagename": "9358a3f7e8257b4cd6fbd12ee6fb17a1.jpeg", "infoid": 1006075, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-亚马逊公司(AMZN.O)周三表示，它将实施为期一年的暂停警方使用其面部识别软件的禁令，扭转了其长期以来支持将该技术出售给执法部门的做法。\n公民自由活动人士表示担心，在反对警察暴行、种族不公正和乔治·弗洛伊德(George Floyd)之死的示威活动中，面部识别可能会导致不公正的逮捕。\n批评人士还质疑该软件的准确性，指出过去的一项研究显示，亚马逊的“识别”服务很难识别肤色较深的人的性别。亚马逊对这项研究提出了异议。\n该公司通过其亚马逊网络服务部门销售云计算技术，该公司在一份声明中表示，它已经推动制定法规，以确保该软件的使用合乎道德。\n亚马逊表示：“我们希望这项为期一年的禁令能让国会有足够的时间来实施适当的规定，如果有要求，我们随时准备提供帮助。”\n几个月来，国会一直在权衡可能出台的面部识别法规。周一，科技巨头IBM(IBM.N)写信给会员表示，它不再全面提供这款软件。\n媒体报道指出，亚马逊的“Rekognition”并不是一部商业大片。它已经将这项服务出售给俄勒冈州和佛罗里达州的执法部门，据报道，它还向美国移民和海关执法局推销这项服务。众所周知，法国的Idemia和日本的NEC等公司在面部识别业务上的时间要长得多，它们拥有的合同要多得多。\n然而，由于亚马逊在科技行业的突出地位以及对面部识别的辩护，近年来它受到了首当其冲的批评，这赋予了它的声明象征意义。\n该公司表示，将继续允许客户Thorn和Marinus Analytics使用其技术来帮助执法部门寻找人口贩运受害者。", "note_en": "(Reuters) - Amazon.com Inc (  AMZN.O) on Wednesday said it was implementing a one-year moratorium on police use of its facial recognition software, reversing its long-time support of selling the technology to law enforcement.\n Civil liberties activists have voiced concern that facial recognition could lead to unjust arrests during demonstrations against police brutality, racial injustice and the death of George Floyd.\n Critics also have questioned the software’s accuracy, pointing to a past study showing Amazon’s “Rekognition” service struggled to identify the gender of individuals with darker skin tones. Amazon has taken issue with that research.\n The company, which sells cloud computing technology via its Amazon Web Services division, said in a statement it has pushed for regulations to ensure the software was used ethically.\n “We hope this one-year moratorium might give Congress enough time to implement appropriate rules, and we stand ready to help if requested,” Amazon said.\n Congress has been weighing possible regulations of facial recognition for months. On Monday, technology giant IBM (  IBM.N) wrote members to say it no longer is offering the software generally.\n Media reports indicate that Amazon’s ‘Rekognition’ has not been a commercial blockbuster. It has sold the service to law enforcement in Oregon and Florida, and it reportedly has marketed it to U.S. Immigrations and Customs Enforcement. Firms such as France’s Idemia and Japan’s NEC, in the facial recognition business for much longer, are known to have far more contracts.\n Yet Amazon, due to its prominence in the technology industry and its defense of facial recognition, has faced the brunt of criticism in recent years, giving symbolic significance to its announcement.\n The company said it would continue to permit use of its technology by customers Thorn and Marinus Analytics to help law enforcement find human trafficking victims.", "posttime": "2020-06-11 08:15:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚马逊,amazon,警方,pauses,表示", "title": "亚马逊暂停警方使用面部识别技术一年", "title_en": "Amazon Pauses Police Use of Facial Recognition Tech For a Year", "transed": 1, "url": "https://www.reuters.com/article/us-amazon-com-facial-recognition/amazon-pauses-police-use-of-facial-recognition-tech-for-a-year-idUSKBN23H3EO", "via": "", "real_tags": ["亚马逊", "amazon", "警方", "pauses", "表示"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006074, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我感谢许多同事在审阅MSS的各种草稿时提出的一些小的更正和主要的想法，其中主要是R.Pesch、E.E.McDonnell、R.许仕仁、D.L.福克斯、J.A.Cramer、K.B.Iverson、P.Cooper、R.H.张伯伦、L.J.迪基和J.Sansom。\nAPL是一种正式的、命令式语言。因为它是命令性的，所以句子可以被称为指令，并且可以被执行以产生结果。在这里使用的插图中，指令将被缩进，其执行结果将显示在下面的行上，没有缩进。因此：\n因为APL是形式化和明确的，所以APL可以由一台称为计算机的机器或严格地说，APL计算机或APL系统来机械地执行。由于这个原因，它也被称为编程语言，它的名字就是从这个短语派生出来的。因为它具有数学表示法的分析属性，所以也被称为分析型编程语言。\n与任何活着的语言一样，APL也有方言，这在一定程度上是由使某些结构过时的进化造成的，但也是由于在其上实现APL系统的许多不同计算机的限制和特殊特性造成的。虽然本简介包括对方言的简要讨论，但读者可能会发现有必要参考特定系统的手册或国际标准化组织颁布的APL标准[1]。\nAPL起源于试图为与计算机应用相关的主题的教学和分析提供一致的符号，并通过在各种主题中的应用和在计算机系统中的实施而发展起来。关于语言历史的广泛讨论可以在APL的设计[2]和APL的演变[3]中找到，也可以在其中引用的出版物中找到。\n字典不应该作为一种语言的介绍来阅读，而应该与其他在读者感兴趣的上下文中使用这种语言的材料一起查阅。即使是语法的一般部分，即使对初学者来说也可能是易懂的，也许也应该在接触了一定数量的其他语言之后才能学习。\n另一方面，词典不应该只用来查找个别单词的意思，还应该研究一下，以获得语言的整体看法。具体地说，根据语言知识的增加，可以一次又一次有益地复习语法，并且对相关动词和副词组的研究可以揭示重要的关系，否则很容易被忽视。\n除了一些本地字母表的字母，如英语(用于姓名)和十位十进制数字(用于数字和姓名)之外，APL字母表还包括6个希腊字母、54个图形符号和大约20个由一对图形符号叠加而成的复合符号。几乎所有的图形符号(至少在一个方向上)都出现在英语词典中的一些常用符号表中，例如“美国传统词典”中的符号和符号表[4]。至少有一半的人熟悉它们在英语和算术中的使用。\n在大多数apl系统上，名称⎕av表示其元素包括字母表的列表。许多系统以小写和大写斜体以外的方式打印这两个英文字母，通常使用下划线的大写和大写。\n每个“原始”动词和副词(即词典中定义的动词和副词)都是由单个图形、复合符号或希腊字母组成的。因此，符号与代词名称的选择并不冲突，编程语言中常用的保留字(由英语字母表中的字母表示的基元名称)也不冲突。\n在任何符号的使用中，有可发音的名称是很方便的。由于同一个符号在不同的工作中通常有许多不同的用途，最著名的名称通常反映了该符号的特定用途，而不是该符号本身的名称。例如，在[4]的引用表中，给出的是⍴和×10的“电阻率”和“乘以”，而不是“希腊Rho”和“圣安德鲁十字”。\n在本词典中，我们尝试为符号提供名称(在表1：字母表中)和在APL中的通用用法(第IV-VI节)。表4提供了在特定上下文中可能使用的同义词。表1的三列提供APL符号、符号名称和音译方案，用于在计算机终端设备上广泛提供的ASCII字符集[5]。最后二十五个apl符号(以⍝开头)称为复合符号，因为它们通常是通过叠加两个较简单的符号来输入的(如在∩和∘中为⍝)，并且通常按组成它们的对命名(如在⊖中为圆条)。\n任何语言的学生都应该警惕并利用其他语言知识提供的线索，以及符号本身的外观提供的线索。例如：\n符号⌊和⌈的出现暗示了它们对Minimum和Maximum的使用，而⌊与字母L的相似性表明“Lesser Of”；↑和↓这对符号用于获取和丢弃。\n希腊语-英语的对应也很重要，如在⍳中表示整数(⍳4)，在⍴中表示重复(3⍴4)或重塑(2⍴⍳3⍴⍳6)。\n⊥用作基值(如在10⊥1 8 6 7←→1867年中)，因为它的形状表示基数，而⊤用于反函数。\n∨用于或因为v是相应拉丁语vel的首字母，而∧用于和因为它与∨的图形关系。\n单词是按照以下规则从左向右扫描APL字母表的字母序列而成的：\n引号的处理方式与英语很相似：开始引号和结束引号之间的所有内容都构成一个单词。但是，左引号后面的一对相邻引号代表引号字符本身，并不充当右引号；&#39；can&#39；t&#39；是通常用作六个字母单词&#39；can&#39；t&#39；的缩写的五个字符的单词。其余规则在应用报价规则后使用。\n不是本地字母表的马克龙(‘)、点(.)、四元(⎕)、空格()、数字或字母的每个字母都是单字母单词，也用作分隔符。\n空格是分隔符，除非它落在两个数字之间，即以数字或马克龙开头的单词，或者以点后跟数字的单词。\n单词⍺、⍵、→和$⎕中的任何一个，或者以符号⎕或本地字母表中的字母开头并以其他字母、数字、马克龙或圆点继续的单词都是一个名称，并且可以通过语法部分中讨论的系词(←)来赋值。\n不是名字的单词称为令牌。记号要么没有意义，要么有固定的指称。例如，标记3.14和314e‘2和2j3有意义，但3..14和’2和&#39；pi和2k3没有意义。\n有意义的数字令牌可以是由空格分隔的两个或多个数字组成的列表，其中，数字可以是实数，也可以是由j-1分隔的两个实数形成的复数。\n实数要么是简单的，要么是由e-隔开的两个简单数字形成的指数数字。一个简单的数字可以由一个或两个马克龙(代表无穷大和负无穷大)组成，也可以包含至少一个数字，最多一个点和一个马克龙(它表示负数，必须处于领先位置)。\n名词，如数字3和5.6；字母字符或文字，如&#39；+&#39；和&#39；A&#39；和&#39；a&#39；…。\n动词，如+(加法)和|(量值)，作用于名词以产生也是名词的结果。一个特定动词所用的名词称为它的论元(一个在主题意义上或主语意义上采用的词)。根据动词是用于一个论元(在它的右边)还是两个论元(在它的左边和右边)，它可能有两个不同的(但通常是相关的)意义。例如：\n副词作用于动词或名词的副词，如//。例如，+/是一个(派生的)动词，名为PLUS，跨越它所应用的任何数字列表的总和，而×/是一个动词，它在列表的所有元素中生成乘积。当一个副词用于名词而不是动词时(如1 0 2/产生一个“选择”动词，因此1 0 2/5 8 7产生5+7/7)，它很可能被称为形容词。然而，由于(在英语中)由名词产生动词的方式更多地是由后缀而不是形容词(如deify、reify和nitrify)实现的，所以我们将在所有情况下使用副词这个术语。\n适用于两个参数的连词，如⍤和¨，如⌽⍤⍉(反转和转置)。连词的论元可以是动词(如上面的例子)，也可以是名词(如10？⍟，意思是以十为底的对数)。\n系词，由箭头←表示，用于为名词、动词、副词或连词指定名称。例如：箭头与英语中的系词“is”和“are”的作用相同；通常读作“is”，如Area←4×8←中的“Area is 4×8”，以及“(动词)sum is plus Cross”表示SUM←+/。指定给名词的名称将称为代词，而指定给动词的名称可能称为谚语(发音为长o，如“proonoun”，以区别于现有的英语单词)。\n标点符号，由指定执行顺序的成对括号提供，就像它们在初等代数中所做的那样。句子必须显示在不同的行上，并且不能使用标点符号来分隔它们。\n名词可以按四种独立的方式分类：数值型或字面型；记号或代词；开放式或盒式；不同等级的数组。秩0、1、2的数组具有特殊名称、项、列表和表，或者(在数学上)标量、向量和矩阵。这四种分类详述如下。\n数字和文字。数字写成2、2.3和23e2(对于2300)和2J5(对于复数)，负数有一个前导马克龙，如‘3.2；；文字用引号括起来，如&#39；A&#39；和&#39；a&#39；和&#39；+#39；*。\n记号和代词。已分配给名词的名称将称为代词。引用名词的记号包括“AND”和“∘”(表示无穷大、减去无限和装箱的空列表&lt；&#39；&#39；)，以及其他数字项和列表(如3.4e2和2 3 4)，以及文字项和列表(如&#39；a&#39；和&#39；cab&#39；)。产生名词的短语(例如3×4或⌽&#39；ABCD&#39；)可以称为名词短语。\n数组。单个实体(如2.3或2.3j5或&#39；A&#39；或&#39；+#39；)称为项目。用逗号表示的动词(称为连词或之前)链接其参数以形成一个列表，该列表的形状(由动词⍴给出)等于组合的项数。例如：\nDate←1，7，7，6⍴Date 4 Word←&#39；s&39；a&#39；a&#39；，&#39；w&#39；⍴Word 3⌽Word(⌽是动词反转)是⌽Date 6 7 7 1。\n表达式s⍴l从列表l生成形状s的数组。例如：\n(3，4)⍴Date，1，8，6，7，1，9，1，7 1 7 7 6 1 8 6 7 1 9 1 7表←2 3⍴Word，&#39；b&#39；，&#39；a&#39；，&#39；t&#39；⍴表2 3 SAW BAT。\n名词形状的元素的数目被称为名词的秩；因此，秩2的名词是表，秩1是列表，秩0是项，秩3是三维或秩3数组等。此外，形状的每个位置被称为数组的轴，并且轴由索引0、1、2等引用。例如，表的轴0具有长度2，轴1具有长度3。\n阵列A的最后k个轴确定阵列的秩-k个单元或k-个单元。例如，如果：\n那么列表ABCD&39；是一个单元格，两个分开的3x4表格是一个单元格的2个单元格，每个单独的字母是一个单元格的0个单元格。\n形状向量的其余部分被称为相对于秩为k的单元的阵列的外部形状或框架。例如，如果⍴b是2 3 4 5，则b具有相对于秩2的单元格的帧2-3(因此具有形状4 5)、相对于5元素的秩-1单元格的帧2 3 4、相对于秩0的单元格的帧2 3 4 5(即，项)、以及秩为4的单元格的空帧(表示项)。\n框架中的单元格数量是其形状的乘积，如果形状中的一个或多个元素为零，则单元格数量为零；然后称该框架为零框架。由于空列表中的乘积是1%，因此空帧不是零帧。\n排名比a小一的单元格被称为一个单元的大单元，大单元在名词的讨论和动词对其的应用中起着重要的作用。例如，动词from(由{表示)从其参数中选择主单元格，如下所示：\n0{a 1{a zu mnop EFGH qrst ijkl uvwx 0{0{a 2 1{0{a ju ijkl EFGH 1{2{0{a j。\n此外，动词等级(由⍋表示)为{提供索引，将主单元带入“词法”或“行-专业”顺序。例如：\nn←4 3⍴3 1 4 2 7 9 3 2 0 3 1 4 n 3 1 4 2 7 9 3 2 0 3 1 4 g←⍋n g 1 0 3 2 g{n 2 7 9 3 1 4 3 1 4 2 0&#39；⍋&#39；CARE&#39；1 0 32。\n负数(如1-CELL和‘2-CELL)也用于指代其对应的帧具有由该数字的大小指示的等级的单元。例如，列表可以称为单元的2个单元格或1个单元格，而两个独立的3×4表格中的每一个都称为单元的1个单元格或2个单元格。数组的1-单元格是其主单元格，而项本身只有一个主单元格。\n打开并装箱。到目前为止讨论的名词称为open，以区别于动词box(用&lt；表示)产生的盒装名词。box的结果是一个项，装箱的名词通常(但不一定)显示在box中。例如：\nBox允许将任何数组(如表示单词的字母列表)视为单个实体。例如：\nLetters←&#39；⍴Letters 10⌽Letters我在这里看到I Words←(&lt；&#39；I&#39；)，(&lt；&#39；is&#39；)，(&lt；&#39；Here&#39；)⍴Words 3⌽Words(2，3)⍴Words，⌽Words|`|这里|是||。\n大多数动词的正常用法都是有限的，动词通常适用的名词类别被称为它的领域。例如，动词减号(在表达式-n中)仅适用于数值参数n；而表达式-&#39；n&#39；n&#39；没有意义；减号的范围仅限于数值参数。\n一元和二元。大多数动词有两种定义，一种用于一元格(一个参数)，另一种用于二元格(两个参数)。如果省略其中一个定义，则动词的对应大小写具有空域。在任何句子中，如果动词前面有合适的左论元，即任何本身不是连词论元的名词，则动词的二元定义也适用。否则，适用一元定义。\n动词的一元格也叫单元格，我们可以说在短语？⍵？中使用的“The Monad？”，以及在短语⍺？⍵？中使用的“the二元？”。\n动词的等级。动词等级的概念与名词等级的概念密切相关：一个等级为k的动词适用于其论元的每个k单元。这个概念将通过使用动词Ravel(用逗号表示)的示例来介绍，它分解整个参数以生成元素列表。因此：\nA←2 3 4⍴&#39；abcdefghijklmnopqrstuvwx；一个eFGH ijkl mnop qrst uvwx，a abcdefghijklmnopqrstuvwx\n由于RAVEL应用于其整个参数，因此其秩被称为无界或无限；它还可以通过在表达式中使用秩合取⍤来应用于指定秩r的单元格⍤r。因此：\n最后一个结果说明了一条一般规则：结果的形状是参数的框架(相对于动词应用到的单元)，与将动词应用于单个单元所产生的形状相关联。通常情况下，这些单个形状是一致的，但如果不一致，则首先将它们设置为如下所示的共同形状：\n如果等级不同，则通过重塑每个参数来引入领导单位长度，从而使它们达到共同的最大等级mr。形式上，单个结果a由(u，⍴a)⍴a代替，其中u←(Mr-⍴⍴a)⍴1。\n如果各个形状不同(在达到共同的等级之后)，则通过表达式ms↑a-1将每个形状变为共同的形状，其中ms是形状上的最大值。因此，如果形状是S1、S2和S3，则Ms←S1⌈S2⌈S3是。例如，⍳⍤0(2 3 4)的单个结果为0 0 1和0 1 2和0 1 2 3；总体结果为表：0 1 0 0 0 1 2 0 0 1 2。\n零帧(其没有可以应用该函数的单元格)的情况通常如下处理：通过将该函数应用于具有该自变量单元格所需形状的代理自变量来确定单个结果的形状。例如，如果⍴m为0 5 4，则案例⌹m的单个结果形状为4 x 5，整个结果的形状为0 4 5。如果各个结果形状对于不同的合适代理参数可以不同，则认为它是所有代理参数中最小的形状。例如，如果⍴m为0×3，则⍳m的单个结果形状的秩为1，形状为0。整体结果的形状为00%。\n动词的并元格有两个等级，左等级控制其左参数的单元等级，右等级控制其右参数的单元等级。例如：\np←&#39；t q←3 4⍴&#39；q唤醒阅读灯p，⍤0 1q清醒面包夹。\n最后，每个动词有三个内在等级，一元等级、左边等级和右边等级。这一事实往往简化了动词的定义。例如，⌽的一元情况被定义为具有等级1，因此它足以定义其在列表上的行为，例如，如⌽&#39；abc&39；←→&#39；和⌽1-2-3-←→3-2-1所示。因此，⌽对更高等级的参数的应用是完全定义的。例如：\n堕落的案例。动词的等级只是对它所应用的单元的等级设置了一个上限，它的域可以包括比其名义等级低的等级的论元。例如，⌽的排名为1位，但其域名还包括如下项目s：s≡⌽s s。类似地，⌹(矩阵逆)的秩为2，但被扩展为列表和项参数，如下所示：(⌹a)≡⌹⍪⊃a表，其中表函数⍪从列表或项参数形成一个单列表。\n协议。动词并元格的两个参数必须在以下意义上一致：左框架和右框架(相对于特定动词)必须相同，除非如果一个框架是空列表，则单个对应的单元格与另一个参数的每个单元格一起用作参数。\n例如，如果q←3 4⍴&#39；wakereadlight&#39；和p←&#39；abc&#39；(与前面使用派生动词⍤0-1的示例相同)，则在。\n..", "note_en": "I am indebted to numerous colleagues for minor corrections\rand major ideas arising from their reviews of various\rdrafts of the mss., chief among them being R. Pesch,\rE.E. McDonnell, R. Hui, D.L. Forkes, J.A. Cramer, K.B.\rIverson, P. Cooper, R.H. Chamberlain, L.J. Dickey, and J.\rSansom.\n         APL is a formal, imperative language. \rBecause it is imperative,\ra sentence may be called an  instruction, \rand may be  executed to produce a  result. \rIn illustrations used here an\rinstruction will be indented, \rand the result of its execution\rwill be shown on the following line without indentation.\rThus:\n    Because it is formal and unambiguous, \rAPL can be executed mechanically \rby a machine called a  computer or,\rstrictly speaking, an  APL computer, \ror  APL system. \rFor this reason it is also \rcalled a  programming language, \ra phrase from which its name derives. \rBecause it shares the analytic properties \rof mathematical notation, \rit is also called \ran  analytical programming language.\n  Like any living language, APL has dialects, resulting\rin part from evolution that has rendered certain constructs\robsolete, but also from the limitations and special characteristics\rof the many different computers on which APL\rsystems are implemented. Although this introduction includes\ra brief discussion of dialects, the reader may find\rit necessary to consult manuals for specific systems, or the\rAPL Standard promulgated by the International Standards Organization \r [1].\n  APL originated in an attempt to provide consistent notation\rfor the teaching and analysis of topics related to the\rapplication of computers, and developed through its application\rin a variety of topics, and through its implementation\rin computer systems. Extensive discussions of the history\rof the language may be found in  The Design of APL  [2]\rand  The Evolution of APL  [3], \rand in the publications cited\rtherein.\n  A dictionary should not be read as an introduction to\ra language, but should rather be consulted in conjunction\rwith other material that uses the language in some context\rof interest to the reader. Even the general section on\rgrammar, which may be intelligible even to the beginner,\rshould perhaps be studied only after a certain amount of\rother exposure to the language.\n  On the other hand, a dictionary should not be used only\rto find the meanings of individual words, but should also\rbe studied to gain an overall view of the language. In particular,\rthe grammar may be profitably reviewed again and\ragain in the light of increased knowledge of the language,\rand the study of groups of related verbs and adverbs can\rreveal important relationships otherwise easily overlooked.\n      In addition to both cases of the letters of some  native\ralphabet such as English (used for names) and the ten decimal\rdigits (used in numbers and in names), the APL alphabet\rincludes six Greek letters, fifty-four graphic symbols,\rand about twenty composite symbols formed by superposing\ra pair of graphic symbols. Nearly all of the graphic\rsymbols occur (in at least one orientation) in some table\rof commonly-used symbols in English dictionaries, such as\rthe Table of Symbols and Signs in \r The American Heritage Dictionary  [4]. \rAt least half are familiar from their use in\rEnglish and in arithmetic.\n  On most APL systems, the name  ⎕av denotes a list\rwhose elements include the alphabet. Many systems print\rthe two English alphabets in other than lowercase and uppercase\ritalics, often using uppercase and uppercase underscored.\n  Every “primitive” verb and adverb \r(i.e., those defined in the dictionary) \ris formed from a single graphic, composite\rsymbol, or Greek letter. \rConsequently, symbols do not\rconflict with the choice of names for pronouns, as do the\r reserved words \r(names of primitives represented by letters\rof the English alphabet) \rcommonly used in programming languages.\n  In any use of symbols it is convenient to have pronounceable\rnames for them. Because of the many different\ruses commonly made of the same symbol in different endeavours,\rthe best-known names usually reflect a particular\ruse of the symbol rather than a name for the symbol itself.\rFor example, in the cited table from\r [4],\r“resistivity”, and\r“multiplied by” are given \rfor  ⍴ and  × ,  \rrather than “Greek rho” \rand “St. Andrew’s cross”.\n  In this dictionary, we attempt to provide both a name\rfor the symbol (in  Table 1: Alphabet) \rand for its general\ruse in APL (Sections IV-VI). \r Table 4 provides synonyms\rfor possible use in particular contexts. \rThe three columns of  Table 1 provide the APL symbol, \ra name for the symbol,\rand a transliteration scheme for use with the ASCII character set \r [5]\rwidely provided on computer terminal devices.\rThe last twenty-five APL symbols (beginning with  ⍝)  \rare called composite symbols because they are commonly entered\rby superposing two simpler symbols (as in  ∩ with  ∘ \rfor  ⍝),  \rand are often named by the pair composing them\r(as in circle-bar for  ⊖).\n  A student of any language should be alert to, and exploit,\rclues provided by knowledge of other languages, as\rwell as clues provided by the appearance of the symbols\rthemselves. For example:\n  The appearance of the symbols  ⌊ and  ⌈ \rsuggests their use for  minimum and  maximum, \rand the similarity of  ⌊ to the letter L suggests \r“lesser of”; the pair  ↑ and  ↓ \rare used for  take and  drop.\n  Greek-English correspondences are also significant, as\rin  ⍳ for  integers  ( ⍳4), \rand in  ⍴ \rfor  repetition  ( 3⍴4)  \ror  reshape  ( 2 3⍴⍳6).\n  ⊥ is used for  base-value \r(as in  10⊥1 8 6 7 ←→ 1867)  \rbecause its shape suggests a base, and  ⊤ is\rused for the inverse function.\n  ∨ is used for  or \rbecause v is the initial letter of the\rcorresponding Latin  vel, \rand  ∧ is used for and because\rof its graphic relationship to  ∨ .\n  Words are formed by scanning a sequence of letters\rof the APL alphabet from left to right according to the\rfollowing rules:\n  Quotes are treated much as in English: everything between\ran opening quote and a closing quote forms a\rsingle word. However, a pair of adjacent quotes following\ran opening quote represents the quote character\ritself, and does not act as a closing quote;  &#39;can&#39;&#39;t&#39; \ris the five-character word commonly used as an abbreviation\rof the six-letter word  &#39;cannot&#39; .  \rThe remaining rules are used after applying the rule for quotes.\n    Every letter that is neither a macron  ( ¯), \rdot  ( .), quad  ( ⎕), \rspace  (  ), digit, nor letter of the native alphabet,\ris a one-letter word, and also serves as a delimiter.\n  The space is a delimiter unless it falls between two\r numbers, that is, words that begin with a digit or a\rmacron, or with a dot followed by a digit.\n    Any of the words  ⍺ ,     ⍵ ,     → ,   \rand  $ ,  \ror a word that begins\rwith the symbol  ⎕ or a letter of the native alphabet and\rcontinues with further letters, digits, macrons or dots is a\rname, and may be assigned a value by means of a \rcopula  ( ←)  as discussed \rin the section on grammar.\n  A word that is not a name is called a  token. \rA token is either meaningless or has a fixed referent. \rFor example,\rthe tokens  3.14 and  314e¯2 \rand  2j3 are meaningful, \rbut  3..14 and  ¯¯2 and  &#39;pi \rand  2k3 are not.\n  A meaningful numeric token may be a list formed of\rtwo or more numbers separated by spaces, \rwhere a number may be a  real number \ror a  complex number formed by two\rreal numbers separated by a  j .\n  A  real number is either  simple or \ran  exponential number\rformed from two simple numbers separated \rby an  e .  \rA simple number may be formed of \rone or two macrons (representing infinity and minus infinity), \ror contain at least one\rdigit and at most one dot and one macron (which denotes\ra negative number and must be in the leading position).\n        Nouns, such as the  numbers  3 \rand  5.6 ,   alphabetic\rcharacters or  literals \rsuch as  &#39;+&#39; and  &#39;A&#39; \rand  &#39;a&#39; .\n  Verbs, such as  + (addition) \rand  | (magnitude) that act\rupon nouns to produce results that are also nouns.\rThe nouns to which a particular verb applies are called\rits  arguments \r(a word adopted in its sense of  theme,\ror  subject). \rA verb may have two distinct (but usually\rrelated) meanings according to whether it is applied\rto one argument (to its right) or two arguments (to its\rleft and right). For example:\n  Adverbs, such as  / ,  \rthat act upon verbs or nouns. \rFor example,  +/ is a ( derived) \rverb called  plus across that\rsums any list of numbers to which it is applied, \rand  ×/ is a verb that yields \rthe product across all elements of a list.  \r\rWhen an adverb applies to a noun rather than to a verb\r(as in   1 0 2 / to produce \ra “selection” verb so \rthat   1 0 2 / 5 8 7 \ryields  5 7 7)  \rit might well be called an  adjective. \rHowever, since such production of verbs\rfrom nouns is (in English) more commonly performed\rby a suffix rather than by an adjective (as in deify,\rreify, and nitrify), \rwe will use the term  adverb for all cases.\n  Conjunctions, such as  ⍤ \rand  ¨ ,   \rwhich apply to two arguments, as  ⌽⍤⍉ \r(reverse  and transpose). \rThe arguments of a conjunction may be either verbs \r(as in the examples above) \ror nouns (as in  10¨⍟ ,  \rmeaning base-ten logarithm).\n  copula, denoted by the \rarrow  ← ,  \rand used to assign a name to a noun, verb, \radverb, or conjunction. For example:\r\r \r\rThe arrow plays the same role as the copulas “is” \rand “are” in English; \rit is usually read as “is”, \ras in “area is four times eight” \rfor  area←4×8 ,  \rand “(the verb) sum is plus across” \rfor  sum←+/ .   \r\rA name assigned to a noun will be called a  pronoun,\rand one assigned to a verb may be called a  proverb\r(pronounced with a long o as in “pronoun” \rto distinguish it from the existing English word).\n  Punctuation, provided by paired parentheses that\rspecify the sequence of execution just \ras they do in elementary algebra. \rSentences must appear on separate lines, \rand no punctuation is used to separate them.\n      Nouns may be classified in four independent ways: numeric\ror literal; token or pronoun; open or boxed; arrays of\rvarious ranks. Arrays of \rranks  0 ,  1 ,  \rand  2 have the special\rnames,  item,  list, and  table, \ror, alternatively (in mathematics)\r scalar,  vector, and  matrix. \rThe four classifications are elaborated below.\n    Numeric and literal. Numbers are written \ras  2 and  2.3 \rand  23e2 (for  2300)  \rand  2j5 (for a complex number),\rand a negative number has a leading macron, \ras in  ¯3.2 ;  \rliterals are enclosed in quotes, \ras  &#39;A&#39; and  &#39;a&#39; and  &#39;+&#39; .\n    Tokens and pronouns. A name that has been assigned to\ra noun will be called a  pronoun. \rTokens that refer to nouns\rinclude  ¯ and  ¯¯ and  ∘ \r(denoting infinity, minus infinity,\rand the boxed empty list  &lt;&#39;&#39;),  \ras well as other numeric items and lists \r(such as  3.4e2 and  2 3 4),  \rand literal items and lists \r(such as  &#39;a&#39; and  &#39;cab&#39;).  \rA phrase that produces a noun \r(such as  3×4 or  ⌽&#39;abcd&#39;)  \rmay be called a  noun phrase.\n    Arrays. A single entity such \ras  2.3 or  2.3j5 or  &#39;A&#39; \ror  &#39;+&#39; is called an  item. \rThe verb denoted by a comma (and\rcalled  catenate or  before) \rchains its arguments to form a  list\rwhose  shape (given by the verb ⍴) \ris equal to the number\rof items combined. For example:\n  date←1,7,7,6\r ⍴date\r4\r word←&#39;s&#39;,&#39;a&#39;,&#39;w&#39;\r ⍴word\r3\r ⌽word (⌽  is the verb  reverse)\rwas\r ⌽date\r6 7 7 1\n  The expression  s⍴l produces an array of shape  s \rfrom the list  l. For example:\n  (3,4)⍴date,1,8,6,7,1,9,1,7\r1 7 7 6\r1 8 6 7\r1 9 1 7\r table←2 3⍴word,&#39;b&#39;,&#39;a&#39;,&#39;t&#39;\r ⍴table table\r2 3 saw\r bat\n  The number of elements in the shape of a noun is\rcalled the  rank of the noun; \rthus a noun of rank  2 is a\rtable, of rank  1 is a list, \rof rank  0 is an item, \rof rank  3 is a  3-dimensional \ror  rank-3 array, etc. \rMoreover, each position of the shape is \rcalled an  axis of the array, and axes\rare referred to by \rindices  0 ,  1 ,  2 ,  \retc. For example, axis  0 \rof  table has length  2 \rand axis  1 has length  3 .\n  The last  k axes of an array  a \rdetermine  rank-k cells\ror  k-cells of   a .   \rFor example, if:\n    then the list  &#39;abcd&#39; is a  1-cell \rof  a ,   \rthe two separate  3 by  4 \rtables are  2-cells of  a ,  \rand the individual letters are each  0-cells \rof  a .\n  The rest of the shape vector is called the  outer shape\ror  frame of the array relative to the cells \rof rank  k .  \rFor example, if  ⍴b \ris   2 3 4 5 ,  \rthen  b has the frame  2 3 \rrelative to the cells of rank  2 \r(and therefore of shape  4 5),  \rhas a frame of   2 3 4 \rrelative to  5-element rank- 1 cells,\ra frame of   2 3 4 5 \rrelative to cells of rank  0 \r(that is, items), and an empty frame \r(signifying an item) of cells of\rrank  4 .\n  The number of cells in a frame is the product over its\rshape, and if one or more of the elements in the shape is\rzero, the number of cells is zero; the frame is then said to\rbe a  zero frame. \rSince the product across an empty list \ris  1 ,  \ran empty frame is  not a zero frame.\n  A cell of rank one less than the rank \rof  a is called\ra  major cell of  a ,  \rand major cells play an important role\rin the discussion of nouns \rand the application of verbs to them. \rFor example, the verb  from \r(denoted by  {)  \rselects major cells from its argument, as in:\n  0{a 1{a\rabcd mnop\refgh qrst\rijkl uvwx\r0{0{a 2 1{0{a\rabcd ijkl\r efgh\r 1{2{0{a\rj\n  Moreover, the verb  grade \r(denoted by  ⍋)  \rprovides indices to  { \rthat bring major cells to “lexical” \ror “row-major” order. For example:\n  n←4 3⍴3 1 4 2 7 9 3 2 0 3 1 4\r n\r3 1 4\r2 7 9\r3 2 0\r3 1 4\r g←⍋n\r g\r1 0 3 2\r\r g{n\r2 7 9\r3 1 4\r3 1 4\r3 2 0\r &#39;abcdefg&#39; ⍋ &#39;care&#39;\r1 0 3 2\n  Negative numbers \r(as in  ¯1-cell and  ¯2-cell) \rare also used to refer to cells whose corresponding \rframes are of the rank indicated by the magnitude \rof the number. \rFor example, the list  &#39;abcd&#39; may be referred \rto either as a  ¯2-cell \ror as a  1-cell of  a ,   \rand each of the two \rseparate  3 by  4 tables \rare called either  ¯1-cells \ror  2-cells of  a .   \rThe  ¯1-cells of an array are its major cells, \rand an item has a\rsingle major cell, itself.\n    Open and boxed. The nouns discussed \rthus far are called  open, \rto distinguish them from  boxed nouns produced by\rthe verb  box (denoted by  &lt;).   \rThe result of box is an item,\rand boxed nouns are commonly (but not necessarily) \rdisplayed in boxes. For example:\n    Box allows one to treat any array \r(such as a list of letters that represent a word) \ras a single entity. For example:\n  letters←&#39;I was here&#39;\r ⍴letters\r10\r ⌽letters\rereh saw I\r words←(&lt;&#39;I&#39;),(&lt;&#39;was&#39;),(&lt;&#39;here&#39;)\r ⍴words\r3\r ⌽words (2,3)⍴words, ⌽words\r|¯¯¯¯||¯¯¯||¯| |¯| |¯¯¯||¯¯¯¯|\r|here||was||I| |I| |was||here|\r|____||___||_| |_| |___||____|\r |¯¯¯¯||¯¯¯||¯|\r |here||was||I|\r |____||___||_|\n      Most verbs are limited in their normal application, and\rthe class of nouns to which a verb normally applies is called\rits  domain. \rFor example, the verb  minus \r(in the expression  -n)  \rapplies only to a numeric \rargument  n ,  \rand the expression  -&#39;n&#39; \ris meaningless; the domain of  minus is limited\rto numeric arguments.\n    Monads and Dyads. Most verbs have two definitions, \rone for the  monadic case (one argument), \rand one for the  dyadic case (two arguments). \rIf one of these definitions is omitted,\rthe corresponding case of the verb has an empty domain.\rIn any sentence, the dyadic definition of a verb applies if\rit is preceded by a suitable left argument, that is, any noun\rthat is not itself an argument of a conjunction. Otherwise\rthe monadic definition applies.\n  The monadic case of a verb is also called a  monad,\rand we may speak of “the monad  ÷”  \rused in the expression  ÷⍵ ,   \rand of “the  dyad  ÷”  \rused in the expression  ⍺÷⍵ .\n    Ranks of verbs. The notion of verb rank \ris closely related\rto that of noun rank: a verb of rank  k \rapplies to each of\rthe  k-cells of its argument. \rThis notion will be introduced\rby an example using the verb  ravel \r(denoted by a comma),\rwhich ravels its entire argument \rto produce a list of the elements. \rThus:\n  a←2 3 4⍴&#39;abcdefghijklmnopqrstuvwx&#39;\r a\rabcd\refgh\rijkl\r\rmnop\rqrst\ruvwx\r ,a\rabcdefghijklmnopqrstuvwx\n  Since ravel applies to its entire argument, \rits rank is said to be  unbounded, \ror  infinite; \rit can also be applied to\rcells of a specified rank  r \rby using the rank conjunction  ⍤ \rin the expression  ,⍤r .  Thus:\n      The last result illustrates a general rule: the shape of\ra result is the frame of the argument (relative to the cells\rto which the verb applies) catenated with the shape produced\rby applying the verb to the individual cells. Commonly\rthese individual shapes agree, but if not, they are\rfirst brought to a common shape as follows:\n  If the ranks differ, they are brought to a common maximum\rrank  mr by reshaping each argument to introduce\rleading unit lengths. Formally, an individual result a\ris replaced by  (u,⍴a)⍴a,   \rwhere  u←(mr-⍴⍴a)⍴1 .\n  If the individual shapes differ (after being brought to a\rcommon rank), each is brought to a common shape by\rthe expression  ms↑a ,  \rwhere  ms is the maximum over\rthe shapes. \rThus, if the shapes \rare  s1 and  s2 \rand  s3 ,  \rthen  ms←s1⌈s2⌈s3 .  \rFor example, the individual\rresults of  ⍳⍤0(2 3 4) \rare  0 1 \rand   0 1 2 \rand   0 1 2 3 ;  \rthe overall result is the table:  \r0 1 0 0 \r0 1 2 0 \r0 1 2 3\n  The case of a zero frame (which has no cells to which\rthe function may be applied) \ris normally treated as follows:\rThe shape of the individual result is determined by\rapplying the function to a surrogate argument having the\rshape required for the argument cell. \rFor example, if  ⍴m \ris   0 5 4 ,  \rthen the individual result shape for the case  ⌹m \ris  4 5 ,  \rand the shape of the entire result \ris   0 4 5 .   \rIf the\rindividual result shape can differ \rfor different suitable surrogate\rarguments, it is taken to be the smallest shape over\rall surrogate arguments. \rFor example, if  ⍴m is  0 3 ,   \rthe individual result shape of  ⍳m \rhas rank  1 \rand is of shape  0 .  \rThe shape of the overall result is  0 0 .\n  The dyadic case of a verb has two ranks, \ra  left rank that\rgoverns the rank of the cells of its left argument, \rand a  right\rrank that governs the rank of cells of its right argument. \rFor example:\n  p←&#39;abc&#39;t\r q←3 4⍴&#39;wakereadlamp&#39;\r q\rwake\rread\rlamp\r\r p,⍤0 1 q\rawake\rbread\rclamp\n  Finally, each verb has three intrinsic ranks, a monadic\rrank, a left rank, and a right rank. \rThis fact often simplifies\rthe definition of a verb. \rFor example, the monadic case of  ⌽ \ris defined to have rank 1, \rand it therefore suffices to define\rits behaviour on lists, perhaps by example, \ras in  ⌽&#39;abc&#39; ←→ &#39;cba&#39; \rand  ⌽1 2 3 ←→ 3 2 1 .  \rThe application \rof  ⌽ to an argument of higher rank \ris therefore completely\rdefined. For example:\n      Degenerate cases. The rank of a verb merely places an\rupper limit on the ranks of the cells to which it applies, and\rits domain may include arguments of rank lower than its\rnominal rank. For example,  ⌽ \rhas rank  1 ,  \rbut its domain also includes an item  s as \rfollows:  s≡⌽s .  \rSimilarly,  ⌹ (matrix inverse) \rhas rank  2 ,  \rbut is extended to list and item\rarguments as follows:  (⌹a)≡⌹⍪⊃a ,  \rwhere the  table function  ⍪ \rforms a one-column table from a list or item argument.\n    Agreement. The two arguments of the dyadic case of a\rverb must  agree in the following sense: \rthe left frame and\rthe right frame (relative to the particular verb) must be\ridentical, except that if one frame is an empty list, the\rsingle corresponding cell is used as argument together with\reach cell of the other argument.\n  For example, if  q←3 4⍴&#39;wakereadlamp&#39; \rand  p←&#39;abc&#39; \r(as in the earlier example \rusing the derived verb  ,⍤0 1),  \rthen in the \n......", "posttime": "2020-06-11 08:13:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apl,dictionary,动词", "title": "APL词典(1987)", "title_en": "A Dictionary of APL (1987)", "transed": 1, "url": "https://www.jsoftware.com/papers/APLDictionary1.htm", "via": "", "real_tags": ["apl", "动词"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006073, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着最近所有关于Mac过渡到ARM处理器的谣言四起，我看到了一些关于这对未来软件意味着什么的断言。我想，作为一个长期为Mac开发软件的人，包括上一次从PowerPC到英特尔的架构过渡，我可以附和这一点。\n可以这么说，我对苹果的内部计划一无所知。这些都是基于我多年使用苹果和苹果框架的经验得出的有根据的猜测。也许这一切都是徒劳的，因为这种转变甚至可能不会发生！\n我发现可可不太可能在短期内消失。可可在很大程度上是用Objective-C编写的，既然苹果一直在对SWIFT大举投资，那么这个想法就是可可肯定会消失。\nCocoa是驱动MacOS上几乎所有应用程序的框架。没有NSWindow，没有NSView，Mac上就没有应用程序。苹果可以在SWIFT中完全重写Cocoa，但这将是对资源的巨大浪费，而且需要很多年的时间才能完成。众所周知，苹果的团队规模很小，所以我不认为他们会花时间去做这件事，只会说5年后的今天，一切都在斯威夫特！那不是很棒吗？抱歉，我们在此期间没有做任何事情，这里有一组全新的错误，您也会发现的。\n&#34；但是等一下！那么SwiftUI呢？你可能会说。SwiftUI还不到一岁。看看斯威夫特花了多长时间才到了不会让人难以置信地痛苦的地步。SwiftUI很可能是在类似的轨道上，无论如何，SwiftUI的许多部分也位于Cocoa之上。\n断言：Objective-C将随着ARM的过渡而消失，从现在开始它将是快速的。\nObjective-C短期内不会去任何地方。太多的MacOS和太多的重要应用程序依赖于它。见鬼-可可框架是用Objective-C编写的！Objective-C对苹果来说仍然非常重要，即使市场部不愿提及它。\n他们的想法是，由于像Microsoft Word和Photoshop这样的主要应用程序在iPad上已经有了版本，所以对它们来说，将其重新编译并作为Catalyst应用程序在MacOS上运行将是小菜一碟。\n对于MacOS上这些应用程序的用户来说，这将是一个严重的降级，也将严重偏离这些应用程序目前在MacOS上的表现方式。即使有了Catalyst，要让iPad应用程序看起来和感觉上都像Mac应用程序，仍然有很多工作要做。除了添加用户期望的所有缺少的功能外，您仍然需要一个团队来确保所有端口都正确无误。我只是不认为这会发生。\n这是有可能发生的。我给它50/50的机会。就我个人而言，我希望这不会发生，因为MacOS上的沙箱仍然有很多问题尚未解决，尽管开发人员多年来一直在抱怨这个问题。\n是的，这完全是真的。OpenGL和OpenCL已经弃用了一段时间，现在支持Metal。苹果将利用这个机会放弃它们。\n苹果今年会发布基于ARM的Mac吗？我希望如此，我认为上行空间是巨大的。我们将失去VMware和其他基于x86的应用程序，这将是可悲的，但如果它能带来更好的性能和更长的电池续航时间，我完全支持它。", "note_en": "With all the recent rumors flying around about the Mac transitioning to ARM processors, I&#39;ve seen some assertions about what this means for software going forward. I thought I could chime in on this as someone who&#39;s been developing software for the Mac for a long time, including the last architecture transition from PowerPC to Intel.\n Let it be stated that I have no knowledge of what Apple&#39;s internal plans are. These are educated guesses based on my years of experience of working with Apple and Apple&#39;s frameworks. And maybe this is all for nothing, since this transition might not even happen!\n  I find it very unlikely that Cocoa is going away anytime soon. Cocoa is largely written in Objective-C, and since Apple has been heavily investing in Swift the idea is that Cocoa must be going away.\n Cocoa is the framework that drives pretty much every app on MacOS. Without NSWindow, without NSView, you&#39;ve got no apps on the Mac. Apple  could completely rewrite Cocoa in Swift, but that would be a monumental waste of resources and would take many years to accomplish. Apple famously keeps its teams small, so I don&#39;t see them spending the time to do this, only to say 5 years from now &#34;Hey- it&#39;s all in Swift now! Isn&#39;t that great? Sorry we didn&#39;t get anything done in the meantime and here&#39;s a whole new set of bugs you&#39;ll be discovering as well&#34;.\n &#34;But wait! What about SwiftUI?&#34; you might say. SwiftUI is barely one year old. Look at how long it&#39;s taken Swift to get to a point where it&#39;s not incredibly painfully to use. SwiftUI is most likely on a similar track, and regardless, many parts of SwiftUI also sit atop Cocoa.\n Assertion: Objective-C is going away with the ARM transition, and it&#39;ll be Swift only from here on out.\n Objective-C isn&#39;t going anywhere anytime soon. Too much of MacOS and too many important applications rely on it. Heck- the Cocoa frameworks are written in Objective-C! Objective-C is still incredibly important to Apple, even if the marketing department doesn&#39;t like to mention it.\n   The thinking goes, since major apps like Microsoft Word and Photoshop already have versions on the iPad, it would be a piece of cake for them to recompile and run on MacOS as Catalyst apps.\n This would be a serious downgrade for users of these apps on MacOS, and would be a major departure from the way the apps currently behave on MacOS. And even with Catalyst, it&#39;s still a lot of work for an iPad app to look and feel like a Mac app. You&#39;re still going to need a team to make sure everything ports correctly, in addition to adding all the missing functionality that your users would expect to be there. I just don&#39;t see this happening either.\n  This could happen. I give it a 50/50 shot at happening. Personally, I hope it doesn&#39;t happen as there are still many problems with the sandbox on MacOS that have yet to be resolved, even though developers have been complaining about it for years.\n  Yea, this is totally happening. OpenGL and OpenCL have been deprecated for a while now in favor of Metal. Apple will use this opportunity to drop them.\n  Will Apple release ARM based Macs this year? I hope so, I think the upside is huge. We&#39;ll lose things like VMware and other x86 based applications which will be sad, but if it brings better performance and longer battery life, I&#39;m all for it.", "posttime": "2020-06-11 08:12:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,过渡,guesses,应用程序", "title": "关于软件过渡到ARM上的MacOS的有根据的猜测", "title_en": "Educated Guesses on Software Transitioning to macOS on ARM", "transed": 1, "url": "https://shapeof.com/archives/2020/6/educated_guesses_about_a_mac_transition_to_arm.html", "via": "", "real_tags": ["软件", "过渡", "guesses", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "3ee3b64159d3f861beb213cf808febf9.jpeg", "infoid": 1006071, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果答案是否定的--而且你试图在推特上发布一篇你还没有打开的文章的链接--Twitter可能会温和地建议你在发帖之前阅读这篇文章。\nTwitter周三宣布，该公司正在测试一项新功能，该功能将向任何试图在没有点击的情况下转发一篇文章的人显示一条警告消息，这是该公司帮助促进知情讨论的努力的一部分。\n公告写道，分享一篇文章可以引发对话，所以你可能想在发推特之前先读一读。\n这是Twitter近几个月来采取的最新举措之一，目的是更积极地引导这款应用的言论。今年5月，Twitter推出了新功能，让人们选择谁可以回复他们的推文，试图减少用户之间的火药战。\n该网站最近还承担了更积极的事实核查角色，在关于冠状病毒的误导性推文中添加警告标签，甚至在事实核查总统唐纳德·特朗普(Donald Trump)身上也添加了警告标签。\n目前还不清楚Twitter是否计划在更大范围内推出它的提示功能，敦促人们在分享文章之前先阅读它们。", "note_en": "If the answer is no — and you try to tweet the link to an article you haven&#39;t opened — Twitter might gently suggest that you read the article before posting.\n Twitter is testing out a new feature that will show a warning message to anyone who tries to retweet an article without clicking on it as part of an effort to &#34;help promote informed discussion,&#34; the company announced Wednesday.\n &#34;Sharing an article can spark conversation, so you may want to read it before you Tweet it,&#34; the announcement reads.\n    It&#39;s one of the latest measures Twitter has taken in recent months to more actively steer discourse on the app. In May, Twitter unrolled new features that let people select who can reply to their tweets in an attempt to reduce flame wars between users.\n The site has also taken on a  more aggressive fact-checking role as of late, adding warning labels to misleading tweets about coronavirus and even fact-checking President Donald Trump.\n It&#39;s not clear whether Twitter plans any wider rollout for its prompt urging people to read articles before sharing them.", "posttime": "2020-06-11 07:22:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推特,文章,feature,twitter", "title": "推特的新功能让你在没有打开文章的情况下分享文章而唠叨不休", "title_en": "New Twitter Feature Nags You For Sharing Articles Without Opening Them", "transed": 1, "url": "https://www.businessinsider.com/new-twitter-feature-sharing-articles-without-opening-them-2020-6", "via": "", "real_tags": ["推特", "文章", "feature", "twitter"]}, {"category": "", "categoryclass": "", "imagename": "6b85a700fb430e1c13d97823835dfbbd.jpg", "infoid": 1006069, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Thanos勒索软件是第一个使用研究人员披露的RIPlace反勒索软件规避技术的软件，以及许多其他高级功能，使其成为一个严重的威胁，需要密切关注。\nThanos第一次开始私人分发是在2019年10月底，但直到2020年1月，受害者才为当时被称为Quimera的勒索软件寻求帮助。\n随着时间的推移，受害者继续在嗡嗡作响的电脑和论坛上寻求帮助，以获得相同的勒索软件，但现在它似乎被确认为Hakbit。\n在Record Future的一份新报告中，我们了解到这种勒索软件名为Thanos，自2月份以来一直在俄语黑客论坛上作为勒索软件即服务进行推广。\n在一位名叫Nosophorus的威胁行为人的推动下，Thanos正在招募黑客和恶意软件分销商来分发勒索软件。这样做，他们将获得任何赎金支付的收入份额，通常在60-70%左右。\n加入Thanos RAAS的附属公司可以访问用于生成自定义勒索软件可执行文件的私人勒索软件生成器。\n虽然大多数用C#编写的勒索软件没有很高的复杂度，但是Thanos有许多高级特性，这些特性使它从其他软件中脱颖而出。\n正如您在上面看到的，该构建器允许广泛的功能，包括内置的未加密文件窃取器，自动传播到其他设备，以及采用研究人员披露的RIPlace规避技术。\n2019年11月，Bleepingcomputer报道了一种名为RIPlace的新的反勒索软件规避技术，该技术是由端点保护公司Nyotron的安全研究人员披露的。\nNyotron发现，当勒索软件将文件重命名为使用DefineDosDevice()函数创建的符号链接时，反勒索软件将无法准确检测该操作。\n取而代之的是，他们的监控功能将收到一个错误，而重命名仍然有效，从而绕过反勒索软件程序。\n如果在调用rename之前，我们调用了DefineDosDevice(创建符号链接的遗留函数)，我们可以传递任意名称作为设备名，传递原始文件路径作为指向的目标。这样，我们就可以让我们的设备引用&#34；C：\\passwords.txt&#34；。\nRIPlace发现在回调函数中，当使用公共例程FltGetDestinationFileNameInformation时，过滤驱动程序无法解析目的地路径。它在传递DosDevice路径时返回错误(而不是返回路径，后处理)；但是，Rename调用成功。\nThanos是第一个采用RIPlace技术的勒索软件，如下面的代码所示。\n当Nyotron公司负责任地向安全公司披露这项技术时，大多数人告诉他们，由于这是一种理论上的技术，不会在野外使用，因此不会得到解决。\n在被告知的公司中，只有卡巴斯基和碳黑修改了他们的软件来阻止这种技术。\n我们还针对微软的受控文件夹访问功能对该技术进行了测试，该功能无法检测到该方法。\n当我们向微软询问RIPlace时，Bleepingcomputer被告知这项技术不被认为是一个漏洞，因为它不符合他们的安全服务标准。\n描述的技术不是安全漏洞，不满足我们的安全服务标准。受控文件夹访问是一种深度防御功能，所报告的技术需要提升对目标计算机的权限。&#34；\n在过去的一年里，勒索软件操作采用了在加密计算机之前窃取受害者文件的策略。然后，威胁行为者威胁说，如果不支付赎金，他们将在数据泄露网站上公布被盗文件。\n这种文件盗窃通常是通过公司的云备份或通过手动将文件复制到远程位置来完成的。\nThanos包括ftp_file_exfile()函数，该函数在加密计算机时自动执行文件外泄到远程FTP站点。\nRecord Future声明默认窃取的文件是&#39；.docx&#39；、&#39；.xlsx&#39；、&#39；.pdf&#39；和&#39；.csv&#39；，但其他扩展名可以由勒索软件附属公司在构建勒索软件可执行文件时指定。\n除了内置的文件窃取功能外，Thanos还包括一项功能，该功能将尝试将勒索软件横向传播到网络上的其他设备。\n执行时，Thanos将从其GitHub存储库下载SharpExec攻击性安全工具包。勒索软件将使用SharpExec捆绑的PSExec程序在其他计算机上复制和运行勒索软件可执行文件。\n此功能允许勒索软件附属机构危害一台计算机，并可能使用它来加密网络上的其他设备。\n在嗡嗡作响的计算机看到的Thanos赎金纸条中，这种勒索软件被用于对多台服务器被加密的公司进行有针对性的攻击。\n众所周知，他们还监控研究人员、开发人员和记者的活动，以改进他们的恶意软件。\n在beepingcomputer看到的Thanos赎金纸条中，这种勒索软件已经出现在有针对性的公司攻击中，其中多台服务器被加密。", "note_en": "The Thanos ransomware is the first to use a researcher-disclosed RIPlace anti-ransomware evasion technique as well as numerous other advanced features that make it a serious threat to keep an eye on.\n Thanos first began private distribution at the end of October 2019, but it was not until January 2020 when victims seeking help for what was called then the  Quimera Ransomware.\n As time went on, victims continued to seek help in the BleepingComputer forums for the same ransomware, but it was now being  identified as Hakbit.\n In a  new report by Recorded Future, we learn that this ransomware is named Thanos and is being promoted as a Ransomware-as-a-Service on Russian-speaking hacker forums since February.\n  Being promoted by a threat actor named Nosophorus, Thanos is enlisting hackers and malware distributors to distribute the ransomware. For doing so, they will receive a revenue share, which is typically around 60-70%, of any ransom payments.\n Affiliates who join the Thanos RaaS gain access to a &#39;Private Ransomware Builder&#39; that is used to generate custom ransomware executables.\n  While most ransomware written in C# does not have a high level of sophistication, Thanos has numerous advanced features that make it stand out from the rest.\n As you can see above, the builder allows for a wide range of features, including a built-in unencrypted file stealer, automated spreading to other devices, and the adoption of the researcher-disclosed RIPlace evasion technique.\n  In November 2019, BleepingComputer reported on a new anti-ransomware evasion  technique called RIPlace that was disclosed by the security researchers at endpoint protection firm  Nyotron.\n Nyotron discovered that when ransomware renames a file to a symlink created using the DefineDosDevice() function, anti-ransomware software would not accurately detect the operation.\n Instead, their monitoring functions would receive an error, while the rename would still work, and thus bypass the anti-ransomware program.\n If prior to calling Rename, we call DefineDosDevice (a legacy function that creates a symlink), we can pass an arbitrary name as the device name, and the original file path, as the target to point on. This way we can get our device &#34;XY&#34; to refer to &#34;C:\\passwords.txt&#34;.\n The RIPlace discovery is that in the callback function filter driver fails to parse the destination path when using the common routine FltGetDestinationFileNameInformation. It returns an error when passing a DosDevice path (instead of returning the path, postprocessed); however, the Rename call succeeds.\n Thanos is the first ransomware to adopt the RIPlace technique, as shown by the code below.\n  When Nyotron responsibly disclosed this technique to security companies, they were told by most that since it was a theoretical technique and not used in the wild, it would not be addressed.\n Of the companies told, only Kaspersky and Carbon Black modified their software to prevent this technique.\n We had also tested the technique against Microsoft&#39;s  Controlled Folder Access feature, which was not able to detect the method.\n When we asked Microsoft about RIPlace, BleepingComputer was told that this technique is not considered a vulnerability as it does not satisfy their  security servicing criteria.\n &#34;The technique described is not a security vulnerability and does not satisfy our Security Servicing Criteria. Controlled folder access is a defense-in-depth feature and the reported technique requires elevated permissions on the target machine.&#34;\n  Over the past year, ransomware operations have adopted the tactic of stealing victim&#39;s files before encrypting a computer. The threat actors then threaten to  release the stolen files on data leak sites if a ransom is not paid.\n This file theft is usually done  via a company&#39;s cloud backups or through the manual copying of files to a remote location.\n Thanos includes a ftp_file_exfil() function that automatically performs file exfiltration to a remote FTP site as it encrypts a computer.\n Recorded Future stated that the files stolen by default are &#39;.docx&#39;, &#39;.xlsx&#39;, &#39;.pdf&#39;, and &#39;.csv&#39;, but other extensions can be specified by the ransomware affiliate when building the ransomware executable.\n  In addition to the built-in file theft, Thanos also includes a feature that will attempt to spread the ransomware laterally to other devices on the network.\n When executed, Thanos will download the  SharpExec offensive security toolkit from its GitHub repository. The ransomware will use SharpExec&#39;s bundled  PSExec program to copy and run the ransomware executable on other computers.\n  This feature allows the ransomware affiliate to compromise a single machine and potentially use it to encrypt other devices on the network.\n  In Thanos ransom notes seen by BleepingComputer, this ransomware has been seen in targeted attacks against companies where multiple servers were encrypted.\n   They are also known to monitor the activities of researchers, developers, and journalists to improve their malware.\n  In Thanos ransom notes seen by BleepingComputer, this ransomware has been seen in targeted company attacks where multiple servers were encrypted.", "posttime": "2020-06-11 07:03:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,windows,规避,ransomware", "title": "Thanos勒索软件自动传播到Windows设备，规避安全", "title_en": "Thanos ransomware auto-spreads to Windows devices, evades security", "transed": 1, "url": "https://www.bleepingcomputer.com/news/security/thanos-ransomware-auto-spreads-to-windows-devices-evades-security/", "via": "", "real_tags": ["软件", "windows", "规避"]}, {"category": "", "categoryclass": "", "imagename": "9512a824683caaf77735664c4b79196b.jpg", "infoid": 1006068, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "巴比伦健康已经承认其GP视频预约应用程序遭遇了数据泄露。\n在该公司的一名用户发现他被允许访问数十个其他患者的会诊视频后，该公司就被提醒了这个问题。\n巴比伦的一项后续检查显示，还有少量英国用户也可以看到其他会话。\n巴比伦允许其成员通过智能手机视频通话与医生、治疗师或其他健康专家交谈，并在适当的时候向附近的药店发送电子处方。它在英国拥有超过230万注册用户。\n总部设在利兹的罗里·格洛弗通过与巴比伦合作伙伴之一宝帕(Bupa)的私人健康保险计划会员资格获得了这项服务。\n周二上午，当他去检查处方时，他注意到应用程序的咨询回放部分有大约50个视频不属于他。\n当你使用一个可信的应用程序时，你不会期望看到这样的事情。看到犯下如此重大的错误，令人震惊。\n格洛弗说，他提醒了一位曾为巴比伦工作的同事注意这一事实。他转而向该公司的合规部门指出了这一问题。\n它在声明中说，6月9日星期二下午，我们发现并解决了一个问题，在两个小时内，一名患者访问了另一名患者的会诊记录介绍。\n我们的调查显示，今天预约预约的三名患者通过巴比伦应用程序中用户个人资料的一个部分，错误地看到了其他患者的会诊记录，但没有看到。\n周三，该公司修改了声明，明确表示除了格洛弗先生-事实上他已经看过一段录音-之外还有两名患者，总共是三名患者。\n这是软件错误的结果，而不是恶意攻击的结果，它继续说。\n当然，我们非常认真地对待任何安全问题，无论多么微小，我们都会联系受影响的患者，在需要的时候更新情况，向他们道歉，并提供支持。\n一位发言人说，在格洛弗的同事联系之前，巴比伦的工程团队就已经意识到了这个问题。\n他说，这个问题是通过一项新功能意外引入的，该功能允许用户在通话过程中将基于音频的咨询切换到基于视频的咨询。\n他补充说，受影响的用户仅在英国，这不会影响我们的国际业务。\n不过，格洛弗表示，他仍有顾虑，不打算再次使用这项服务。\n你希望你说的任何话都是私人的，而不是与陌生人分享。\n信息专员办公室已经证实，巴比伦已经联系过它，现在正在等待收到该公司的违规报告。\n一位女发言人表示，人们的医疗数据是高度敏感的信息，不仅人们希望这些数据得到谨慎和安全的处理，组织也有法律规定的责任。\n当数据事件发生时，我们希望组织考虑联系受影响的人是否合适，并考虑是否可以采取措施保护他们免受任何潜在的不利影响。\n巴比伦告诉BBC，它已经与所有相关人员联系，通知他们并道歉。", "note_en": "Babylon Health has acknowledged that its GP video appointment app has suffered a data breach.\n The firm was alerted to the problem after one of its users discovered he had been given access to dozens of video recordings of other patients&#39; consultations.\n A follow-up check by Babylon revealed a small number of further UK users could also see others&#39; sessions.\n  Babylon allows its members to speak to a doctor, therapist or other health specialist via a smartphone video call and, when appropriate, sends an electronic prescription to a nearby pharmacy. It has more than 2.3 million registered users in the UK.\n  Leeds-based Rory Glover had access to the service via his membership of a private health insurance plan with Bupa, one of Babylon&#39;s partners.\n On Tuesday morning, when he went to check a prescription, he noticed he had about 50 videos in the Consultation Replays section of the app that did not belong to him.\n   &#34;You don&#39;t expect to see anything like that when you&#39;re using a trusted app. It&#39;s shocking to see such a monumental error has been made.&#34;\n Mr Glover said he alerted a work colleague to the fact, who used to work for Babylon. He in turn flagged the issue to the company&#39;s compliance department.\n    &#34;On the afternoon of Tuesday 9 June we identified and resolved an issue within two hours whereby one patient accessed the introduction of another patient&#39;s consultation recording,&#34; it said in statement.\n &#34;Our investigation showed that three patients, who had booked and had appointments today, were incorrectly presented with, but did not view, recordings of other patients&#39; consultations through a subsection of the user&#39;s profile within the Babylon app.&#34;\n On Wednesday, the firm amended its statement to make clear that it meant two patients in addition to Mr Glover - who had in fact viewed a recording - to make the total of three.\n &#34;This was the result of a software error rather than a malicious attack,&#34; it continued.\n  &#34;Of course we take any security issue, however small, very seriously and have contacted the patients affected to update, apologise to and support where required.&#34;\n A spokesman said that Babylon&#39;s engineering team was already aware of the issue before it was contacted by Mr Glover&#39;s workmate.\n He said the problem had been accidentally introduced via a new feature that lets users switch from audio to video-based consultations part way through a call.\n  &#34;Affected users were in the UK only and this did not impact our international operations,&#34; he added.\n However, Mr Glover said he still had concerns and did not intend to use the service again.\n  &#34;You expect anything you say to be private, not for it to be shared with a stranger.&#34;\n The Information Commissioner&#39;s Office has confirmed that it had been contacted by Babylon and that it was now waiting to receive the company&#39;s breach report.\n &#34;People&#39;s medical data is highly sensitive information, not only do people expect it to be handled carefully and securely, organisations also have a responsibility under the law,&#34; said a spokeswoman.\n &#34;When a data incident occurs, we would expect an organisation to consider whether it is appropriate to contact the people affected, and to consider whether there are steps that can be taken to protect them from any potential adverse effects.&#34;\n Babylon told the BBC it had already been in touch with everyone involved to inform them and apologise.", "posttime": "2020-06-11 06:47:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "泄露,health,巴比伦", "title": "巴比伦健康数据泄露允许用户查看其他患者的视频会诊", "title_en": "Babylon Health Data Breach Allowed Users To View Other Patients' Video Consultations", "transed": 1, "url": "https://www.bbc.com/news/technology-52986629", "via": "", "real_tags": ["泄露", "health", "巴比伦"]}, {"category": "", "categoryclass": "", "imagename": "e95245e63190185494f939bf311171e6.jpg", "infoid": 1006067, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在搜索您的下一台支持GNU/Linux的计算机时，您可能会发现一些供应商，如戴尔、惠普和联想销售预装Ubuntu的台式机和笔记本电脑。事实上，Ubuntu在越来越多的硬件上获得了认证。但是，对于这样的设备来说，“Ubuntu认证”到底意味着什么，这又是如何发生的呢？我们来看看。\n计算机由许多不同的组件组成，从CPU到触摸板，从声卡到无线模块。为了给用户提供最好的体验，这些组件中的每一个都要单独很好地工作，所有这些组件都必须一起很好地发挥作用。如果您曾经在最近的计算机或具有非常特定组件的设备上安装过GNU/Linux，您就知道这不是一件容易的任务。在全新的笔记本电脑上安装了您最喜欢的Linux发行版后，您登录后发现蓝牙无法工作，因此您无法使用无线鼠标。稍后，你合上笔记本的盖子，把它放进包里，当你重新打开它时，你会发现音频不再可用，你必须重新启动才能听你的音乐！\nUbuntu认证计划在这里是为了确保，对于给定的计算机，它的所有组件都能按预期工作，用户可以“开箱即用”享受最佳体验。它是质量、功能和维护的保证，因为Ubuntu认证的设备基于长期支持(LTS)版本，因此可以在五年内接收更新。\nCanonical与硬件合作伙伴密切合作，在他们的设备上启用Ubuntu。目标有两个：\n为了创建我们称为“OEM映像”的磁盘映像，它将在出厂时用于预装Ubuntu设备，\n为了确保已经完成的创建OEM映像的工作被上传，这样已经启用的组件就可以在更高版本的Ubuntu(您可以在ubuntu.com上下载的“库存”映像)上很好地工作。\n你可能想知道为什么我们不在Ubuntu认证的硬件上使用“库存”的Ubuntu镜像。主要有两个原因：\n我们的硬件合作伙伴可能需要默认安装特定软件或在其设备上添加功能。例如，戴尔设备附带特定的磁盘分区和默认安装的戴尔恢复工具，使其用户能够分别执行系统恢复和创建恢复介质。\n最近的设备可能需要尚未进入上游Linux内核的驱动程序，或者只在可能没有长期支持的较新Linux内核上可用的驱动程序。拥有专用的OEM内核提供了更大的灵活性：我们可以从最新的主线内核中挑选特定的附加内容(支持更新的技术、改进已支持的组件等)。同时保持长期支撑的稳定性。\n那么，要为特定设备创建映像需要做些什么呢？Canonical内部的不同团队在项目的所有阶段都在合作，将Ubuntu带到给定的设备上，并确保其组件将在未来的Ubuntu版本中得到很好的支持。\n但这些球队站在巨人的肩膀上。没有创建和维护Ubuntu Linux基础上的许多积木的Linux社区的辛勤工作，以及桌面团队、基金会团队和安全团队等规范团队的共同努力，所有这些都不可能以现有的Ubuntu映像的形式结合在一起。\n现场工程师经常与组件供应商和制造商联系，以跟踪与硬件驱动程序和固件(BIOS、UEFI)相关的问题。它们有助于及早识别和调查问题，并帮助测试和调试新固件和驱动程序版本。\n硬件启用(HWE)工程师负责构建和维护OEM内核，该内核包含通用内核中不一定可用的新硬件、新功能和错误修复的驱动程序。他们还确保添加到OEM内核中的任何东西最终都会进入通用内核，这样每个人都可以从这些改进中受益，并使用更新的Ubuntu映像。最后，该团队开发和维护固件测试套件(FWTS)，这是一个免费的开源程序，可以识别BIOS、UEFI、ACPI和许多其他错误，并提供有关如何修复它们的反馈。\n当使用Ubuntu启用新设备时，主流团队会根据当前的LTS版本精心制作一个映像，其中包括特定于我们的合作伙伴的功能(例如，前面提到的戴尔恢复工具和分区)、正确版本的OEM Linux内核以及针对该特定设备优化版本的其他调整和修复。他们还设置了自动化的健全性检查，以便在将发布的每个映像传递给质量保证团队之前对其进行缺陷测试。\n一旦OEM映像准备就绪，质量保证(QA)团队就开始使用CheckBox运行认证测试套件，CheckBox是认证团队开发和维护的免费开源测试工具。测试套件允许团队运行数百个测试，以确保CPU、显卡、无线、触摸板、挂起和恢复功能都能按预期工作。如果在测试过程中出现问题，将打开错误报告并将其分配给正确的团队，以及工程师可能需要的所有信息来重现、调试和修复问题。一旦提供了修复，就会生成并测试一个新映像，直到所有问题都解决为止。\n认证是一头复杂的野兽，认证团队正在处理所有的事情！首先，认证团队开发和维护内部使用的不同工具，包括前面提到的复选框和另一个自动化设备配置和测试的软件。该团队充当认证设备的把关人，审核并颁发预装版本Ubuntu的实际证书(基本上，如果你在销售电脑的网站上看到Ubuntu标识或“Ubuntu认证”，这要归功于认证团队的批准)。它还负责我们实验室中经过认证的设备的持续自动化测试，以确保最新的Linux更新在这些设备上运行良好。最后但并非最不重要的一点是，该团队帮助使用更新的Ubuntu现货版本测试经过认证的设备(内部称为“N+1”的过程)，以确保对经过认证的设备所做的修复被上传并提供给所有人。\n没有良好的管理，任何项目都不可能完成。项目经理确保每个设备启用项目都保持在正轨上，确保不同的团队(内部和外部)更新了满足最后期限并进入下一阶段所需的信息，确保针对每个提出的错误找到解决方案，更一般地，确保启用设备并将映像发送到工厂，以便按时在设备上预安装！\n正如Martin Wimpress的文章“What‘s new in Ubuntu Desktop 20.04 LTS？”所提到的，从Ubuntu Desktop 20.04 LTS开始，现在可以通过安装Ubuntu的通用版本来获得认证的设备体验。安装在经过认证的硬件上时，特定于设备的启用将自动安装和配置，就像在预加载的出厂映像中一样。\n您已经拥有了这样一台设备，但是它已经预装了另一个操作系统，并且想用Ubuntu替换它。\n您想要预装Ubuntu的新设备，但此选项在您的国家不可用(一些供应商可能决定只在某些国家销售预装Ubuntu的设备)。\n我们只是触及了在设备上认证Ubuntu Linux意味着什么的皮毛，我们只讨论了台式机和笔记本电脑。每年，Canonical都会启用数百种设备，这样用户不仅可以在桌面端，也可以在服务器端以及物联网设备上获得开箱即用的出色Ubuntu体验。这个过程还为众多组件带来了更好的总体Linux支持，这对整个Linux社区都是有好处的。\n了解Ubuntu桌面操作系统如何支持全球数百万台PC和笔记本电脑。", "note_en": "While searching for your next GNU/Linux enabled computer, you may have found that some vendors such as Dell, HP and Lenovo sell a selection of desktops and laptops with Ubuntu pre-installed. In fact, Ubuntu is  certified on an ever-growing list of hardware. But what does it mean exactly for such a device to be “Ubuntu certified”, and how does this happen? Let’s find out.\n   A computer is made of many different components, from the CPU to the touchpad, from the sound card to the wireless module. In order to provide the best experience for the user, each of these components has to work well on its own, and all of them have to play well together. If you’ve ever installed GNU/Linux on a recent computer or a device with very specific components, you know it’s rarely an easy task. After installing your favorite Linux distribution on your brand new laptop, you log in and discover that the Bluetooth doesn’t work so you cannot use your wireless mouse. Later on, you close your laptop lid, put it in your bag and when you reopen it, you find out the audio is not available anymore and you have to reboot to listen to your music!\n The Ubuntu certification program is here to ensure that, for a given computer, all of its components work as expected and the user can enjoy the best experience “out of the box”. It is a guarantee of quality, functionality and maintenance, as Ubuntu certified devices are based on  Long Term Support (LTS) releases and therefore receive updates for five years.\n Canonical works closely with hardware partners to enable Ubuntu on their devices. The goal is two-fold:\n to create what we call an “OEM image”, a  disk image which will be used in factory to pre-install the devices with Ubuntu,\n to ensure the work that has been done to create the OEM image is upstreamed so that the components that have been enabled will work fine with later releases of Ubuntu (the “stock” image you can download on  ubuntu.com).\n  You might wonder why we don’t use the “stock” Ubuntu image on Ubuntu certified hardware. There are two main reasons:\n Our hardware partners may need specific software installed by default or features added on their devices. For instance, Dell devices come with a specific disk partitioning and with the  Dell Recovery tool installed by default, allowing their users to be able to perform system recovery and to create a recovery media, respectively.\n Recent devices may require drivers that have not made it to the upstream Linux kernel yet or that are only available on a newer Linux kernel that may not have  long term support. Having a dedicated OEM kernel provides more flexibility: we can cherry-pick specific additions from the latest mainline kernel (support for newer technology, improvements for already supported components, etc.) while keeping the stability of a long term supported one.\n  So what does it take to create an image for a specific device? Different teams within Canonical are working together throughout all phases of a project to bring Ubuntu to a given device and ensure its components will be well supported with the future releases of Ubuntu.\n But these teams stand on the shoulders of giants. Nothing would be possible without the hard work of the Linux community that creates and maintains many of the bricks Ubuntu Linux is built on, as well as  Canonical teams such as Desktop team, Foundations team and Security team that work together to bring all this together in the form of the stock Ubuntu image.\n  Field engineers are constantly in touch with component vendors and manufacturers to track issues related to hardware drivers as well as firmwares (BIOS, UEFI). They help identify and investigate problems early on and help testing and debugging new firmwares and drivers releases.\n  Hardware enablement (HWE) engineers are in charge of building and maintaining the  OEM kernel that contains drivers for new hardware, new features and bug fixes that are not necessarily available in the generic kernel. They also ensure anything that is added into the OEM kernel ends up in the generic kernel so that everyone can benefit from these improvements with a later stock Ubuntu image. Finally, the team develops and maintains  Firmware Test Suite (FWTS), a free and open source program that identifies BIOS, UEFI, ACPI and many other errors and provides feedback on how to fix them.\n  When a new device is enabled with Ubuntu, the mainstream team carefully crafts an image from the current LTS version that includes features specific to our partner (the Dell Recovery tool and partitioning mentioned earlier for instance), the proper version of the OEM Linux kernel and other tweaks and fixes to optimize the release for that specific device. They also set up automated sanity checks so that every image released is tested for defects before passing it to the quality assurance team.\n  Once the OEM image is ready, the quality assurance (QA) team kicks in and runs a certification test suite using  Checkbox, a free and open source testing tool developed and maintained by the Certification team. The test suite allows the team to run hundreds of tests to make sure things like CPU, graphics card, wireless, touchpad, suspend and resume features all work as expected. In case of issues during the tests, bug reports are opened and assigned to the right teams along with all the information engineers may need to reproduce, debug and fix the problem. Once fixes are provided, a new image is generated and tested until all the issues are ironed out.\n  Certification is a complex beast and the Certification team is handling all of it! First, the Certification team develops and maintains different tools used internally, including Checkbox mentioned earlier and another software to automate device provisioning and testing. The team acts as the gatekeeper for certified devices, reviewing and issuing the actual certificates for the pre-installed versions of Ubuntu (basically, if you see the Ubuntu logo or “Ubuntu certified” on a website selling computers, it’s thanks to the Certification team’s stamp of approval). It is also in charge of continuous automated testing of certified devices in our lab to ensure the latest Linux updates work well on them. Last but not least, the team helps testing certified devices with more recent stock Ubuntu versions (a process internally called “N+1”) to ensure the fixes made for certified devices are upstreamed and made available to everyone.\n  No project could be completed without good management. Project managers make sure each device enablement project keeps on track, that the different teams (both internal and external) are updated with the information required to meet the deadlines and go on to the next phase, that a solution is found for each bug raised, and more generally that the device gets enabled and the image sent to the factory  to be pre-installed on the devices on time!\n  As mentioned by Martin Wimpress’ article  “What’s new in Ubuntu Desktop 20.04 LTS?”, starting with Ubuntu Desktop 20.04 LTS, it is now possible to obtain a certified device experience by installing the general release of Ubuntu. When installed on certified hardware, the device-specific enablement will be automatically installed and configured, just as it would be in the preloaded factory images.\n  you already own such a device, but got it with another operating system pre-installed and would like to replace it with Ubuntu,\n you’d like to get a new device with Ubuntu pre-installed, but this option is not available in your country (some vendors may decide to only sell their devices with Ubuntu pre-installed in certain countries).\n  We just scratched the surface on what it means to certify Ubuntu Linux on a device, and we only discussed desktop and laptop computers. Every year, Canonical enables hundreds of devices so that users can get a great Ubuntu experience out of the box, not only on the desktop side but also on the server side as well as on IoT devices. This process also brings better Linux support overall for a multitude of components, which is always good for the Linux community at large.\n  Learn how the Ubuntu desktop operating system powers millions of PCs and laptops around the world.", "posttime": "2020-06-11 06:46:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ubuntu,认证,processes", "title": "“Ubuntu认证”设备背后的人员和流程", "title_en": "People and processes behind “Ubuntu certified” devices", "transed": 1, "url": "https://ubuntu.com/blog/people-and-processes-behind-ubuntu-certified-devices", "via": "", "real_tags": ["ubuntu", "认证", "processes"]}, {"category": "", "categoryclass": "", "imagename": "4a5151f5fe53c094f0e818748bd80423.jpg", "infoid": 1006066, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊周三表示，它将实施为期一年的禁令，禁止警方使用Rekognition。\n亚马逊在一份声明中表示：我们一直主张政府应该制定更强有力的法规来规范面部识别技术的道德使用，最近几天，国会似乎已经准备好迎接这一挑战。\n亚马逊(Amazon)周三表示，将在一年内禁止警方使用其面部识别软件，目前科技公司面临越来越大的压力，要求它们对明尼阿波利斯一名警察杀害乔治·弗洛伊德(George Floyd)一事做出回应。\n亚马逊在一份声明中表示，我们一直主张各国政府应该制定更强有力的法规来规范面部识别技术的道德使用，最近几天，国会似乎已经准备好迎接这一挑战。我们希望这项为期一年的禁令能给国会足够的时间来实施适当的规则，如果有要求，我们随时准备提供帮助。\n两天前，IBM宣布将退出面部识别业务，首席执行官阿尔温德·克里希纳(Arvind Krishna)呼吁国会立法改革，以促进种族正义和打击系统性种族主义。同样在周一，民主党议员公布了一项全面的警察改革法案，周三，众议院司法委员会就防止警察暴行举行了听证会。\n弗洛伊德是一名手无寸铁的黑人男子，他于5月25日被杀，视频显示，这名警察在他的脖子上跪了近9分钟。在接下来的几天里，亚马逊首席执行官杰夫·贝佐斯(Jeff Bezos)公开表示支持黑人生命也是(Black Lives Matter)运动，并发布了与对他的立场不满的客户的电子邮件往来。\n甚至在最近一波全国性的反对警察暴力的抗议活动之前，重新认识问题就一直是亚马逊的一个有争议的话题。这项技术已被执法机构使用，据报道，该技术被推销给美国移民和海关执法局。亚马逊网络服务公司过去曾表示，该技术被与执法部门合作的组织用来为犯罪受害者辩护。\n俄勒冈州华盛顿县警长办公室是AWS在其网站上点名为Rekognition客户的唯一警察局，亚马逊拒绝就使用Rekognition的警察部门总数置评。\nAWS在2016年推出了Rekognition，当时在一篇简短的博客文章中将其描述为一项服务，可以轻松地将图像分析添加到你的应用程序中，并检测图像中的物体、场景和人脸。去年，亚马逊表示，Rekognition能够通过识别表情来检测一个人的恐惧。它还可以决定一个人是快乐还是悲伤。\n研究表明，面部识别软件可能存在种族和性别偏见。去年，算法正义联盟(Algorithic Justice League)创始人乔伊·布朗维尼(Joy Buolamwini)就麻省理工学院(Massachusetts Of Technology)对这一主题的研究作证。她的发现帮助为亚马逊去年举行的股东投票提供了基础，有2.4%的股东投票赞成禁止向政府机构出售这项技术。\n据亚马逊网站上的一名追踪者称，全美1000多个警察部门与亚马逊旗下的智能门铃安全公司Ring建立了合作伙伴关系。这种合作关系允许警方要求从Ring安全摄像头获取视频，这引发了隐私问题。", "note_en": "Amazon said on Wednesday that it&#39;s putting in place a one-year moratorium on police use of Rekognition.\n &#34;We’ve advocated that governments should put in place stronger regulations to govern the ethical use of facial recognition technology, and in recent days, Congress appears ready to take on this challenge,&#34; Amazon said in a statement.\n Amazon said on Wednesday that it&#39;s  banning use of its facial recognition software by police for one year, as pressure on tech companies builds to respond to the killing of George Floyd by a police officer in Minneapolis.\n &#34;We&#39;ve advocated that governments should put in place stronger regulations to govern the ethical use of facial recognition technology, and in recent days, Congress appears ready to take on this challenge,&#34; Amazon said in a statement. &#34;We hope this one-year moratorium might give Congress enough time to implement appropriate rules, and we stand ready to help if requested.&#34;\n  The announcement comes two days after  IBM  said it was exiting the facial recognition business, with CEO Arvind Krishna  calling on Congress to enact reforms to advance racial justice and combat systemic racism. Also on Monday, Democratic lawmakers unveiled a sweeping police reform bill, and on Wednesday the House Judiciary Committee held hearings on preventing police brutality.\n Floyd, an unarmed black man, was killed on May 25, with video showing that the police officer knelt on his neck for almost nine minutes. In subsequent days, Amazon CEO  Jeff Bezos has spoken up in support of the Black Lives Matter movement and has  posted e-mail exchanges with customers who are unhappy with his stance.\n Rekognition has been a controversial topic for Amazon even before the latest spate of nationwide protests against police violence. The technology has been used by law enforcement agencies and was reportedly pitched to Immigration and Customs Enforcement in the U.S. Amazon Web Services has said in the past that the technology is used by organizations that work with law enforcement to advocate for victims of crime.\n The Washington County Sheriff Office in Oregon is the only police department that AWS names on its  website as a Rekognition customer. Amazon declined to comment on the total number of police departments that use Rekognition.\n AWS launched Rekognition in 2016, describing it in a  short blog post at the time as a &#34;service that makes it easy to add image analysis to your applications&#34; and to &#34;detect objects, scenes, and faces in images.&#34; Last year, Amazon  said that Rekognition was capable of detecting a person&#39;s fear by identifying expressions. It could also determine whether someone was happy or sad.\n  Research has indicated that facial recognition software may hold racial and gender bias. Last year Joy Buolamwini, founder of Algorithmic Justice League, testified about research into the subject  for Massachusetts Institute of Technology. Her findings helped provide the basis of a shareholder vote that Amazon held last year,  with 2.4% of shareholders voting in favor of banning the sale of the technology to government agencies.\n More than 1,000 police departments across the U.S. have partnerships with Ring, the smart doorbell security company owned by Amazon, according to  a tracker on its website. The partnerships allow police to request footage from Ring security cameras, which has  raised privacy concerns.", "posttime": "2020-06-11 06:29:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "亚马逊,amazon,禁止,bans,警察", "title": "亚马逊在一年内禁止警方使用面部识别技术", "title_en": "Amazon bans police use of facial recognition technology for one year", "transed": 1, "url": "https://www.cnbc.com/2020/06/10/amazon-bans-police-use-of-facial-recognition-technology-for-one-year.html", "via": "", "real_tags": ["亚马逊", "amazon", "禁止", "bans", "警察"]}, {"category": "", "categoryclass": "", "imagename": "90adf453aab64a6013ab205c5007e22a.jpg", "infoid": 1006065, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "考克斯通信是美国最大的有线电视提供商之一，据几位熟悉该公司计划的消息人士透露，该公司正准备推出一项移动服务。\n然而，考克斯移动战略的细节，包括何时推出，以及可能与哪家无线网络提供商合作，仍不清楚。AT&amp；T高管曾公开表示，该运营商正寻求与有线电视运营商签署MVNO合作伙伴关系，消息人士称，两家公司今年早些时候曾进行MVNO谈判，但目前尚不清楚两家公司是否完成了交易。\n值得注意的是，考克斯正准备通过向宽带有线电视客户提供手机和无线服务来重新进入移动行业。这一行动将使考克斯加入其他有线电视公司Altice USA、Comcast和Charge Communications的行列，这三家公司也都向宽带客户推出了移动服务。康卡斯特的Xfinity Mobile和Charge的Spectrum Mobile搭载在Verizon的无线网络上。Altice Mobile运行在T-Mobile的网络上。\n考克斯的一位代表证实，该公司有兴趣进入移动行业。公司发言人托德·史密斯(Todd Smith)在回答Light read的问题时写道：我们相信这个市场对我们进入无线领域越来越有吸引力，我们现在正在更积极地探索这个市场，但还没有宣布任何具体计划。我们还没有签订任何MVNO协议。\n与考克斯在2018年的立场相比，这是一个决定性的逆转，当时该公司表示没有重新进入无线行业的计划。\n考克斯公司及其员工最近发布的一些帖子突显了他再次追求移动业务的兴趣。考克斯公司的托尼·克鲁克四个月前在LinkedIn上写道，他正在建立并领导团队，为考克斯通信公司设计、开发和推出一条无线零售业务线。最近考克斯发布的招聘信息提到了考克斯移动新推出的无线产品和零售无线服务的发布。\n考克斯也是众多有线电视公司中的一员，他们已经注册竞标FCC即将举行的CBRS3.5 GHz频谱拍卖。有广泛的迹象表明，查特和其他公司正在考虑使用该频谱在选定的地点建设自己的移动网络。他们的目标将是通过将客户的移动流量转移到他们自己的CBRS网络来减少他们支付给MVNO合作伙伴的金额。\n考克斯在无线行业有着悠久的历史。该公司在2010年使用700 MHz频谱和华为设备建设了自己的3G CDMA无线网络，但在2012年停止了这一努力。在此期间，它还通过Sprint MVNO销售移动服务。", "note_en": "Cox Communications – one of the nation&#39;s largest cable providers – is preparing to launch a mobile service, according to several sources familiar with the company&#39;s plans.\n  However, the details of Cox&#39;s mobile strategy, including when it might launch and which wireless network provider it might partner with, are still unclear. AT&amp;T executives  have publicly indicated that the carrier is looking to sign MVNO partnerships with cable operators, and the sources said the two pursued MVNO talks earlier this year, but it&#39;s not clear whether the companies consummated the deal.\n    It&#39;s noteworthy that Cox is preparing to re-enter the mobile industry by offering cellphones and wireless services to its broadband cable customers. The action would put Cox alongside fellow cable companies Altice USA, Comcast and Charter Communications, which have all also launched mobile services to their broadband customers. Comcast&#39;s Xfinity Mobile and Charter&#39;s Spectrum Mobile piggyback on Verizon&#39;s wireless network. Altice Mobile runs on T-Mobile&#39;s network.\n  A Cox representative confirmed the company is interested in entering the mobile industry. &#34;We believe the market is becoming more attractive for us to enter the wireless space and we are exploring it more aggressively now, but have not announced any specific plans,&#34; company spokesperson Todd Smith wrote in response to questions from Light Reading. &#34;We have not entered into any MVNO agreements yet.&#34;\n  That&#39;s a decided reversal from Cox&#39;s  position in 2018, when it said it has no plans to re-enter the wireless industry.\n  Cox&#39;s interest in pursuing mobile again is underscored by some recent postings by the company and its employees. Cox&#39;s Tony Krueck  wrote on LinkedIn four months ago that he is &#34;establishing and leading the team to design, develop, and launch a retail wireless line of business for Cox Communications.&#34; And recent Cox  job postings mention a &#34;newly introduced Cox Mobile wireless offering&#34; and a &#34;Retail Wireless Services launch.&#34;\n  Cox also is among a number of cable companies that have  registered to bid in the FCC&#39;s upcoming CBRS 3.5GHz spectrum auction. There are widespread indications that  Charter and others are considering using that spectrum to construct their own mobile networks in select locations. Their goal would be to reduce the amount of money they pay to their MVNO partners by offloading their customers&#39; mobile traffic onto their own CBRS networks.\n  Cox has a lengthy history in the wireless industry. The company built its own 3G CDMA wireless network using 700MHz spectrum and Huawei equipment in 2010, but  shuttered the effort in 2012. It also sold mobile services through a Sprint MVNO during that period.", "posttime": "2020-06-11 06:13:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "重返,readies", "title": "考克斯准备重返移动领域", "title_en": "Cox Readies a Re-entry Into Mobile", "transed": 1, "url": "https://www.lightreading.com/cable-video/cox-readies-a-re-entry-into-mobile/d/d-id/761585", "via": "", "real_tags": ["重返", "readies"]}]