[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1073036, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "东京（美联社）-日本官员周四表示，一个遥控机器人捕捉到了一堆堆核燃料的图像，这些燃料在日本福岛核电站受损最严重的反应堆底部熔化并坠落。\n2011年的一场大地震和海啸破坏了发电厂的冷却系统，导致三个反应堆堆芯熔毁。他们的大部分高放射性燃料都落到了安全壳的底部，这使得清除这些燃料极其困难。\n工厂运营商东京电力公司控股星期四表示，此前曾试图将一架小型机器人带摄像头进入1号反应堆，但本周由RoV-A机器人拍摄的图像显示了被融化的燃料和其他碎片浸没在冷却水中的破碎结构、管道和土堆。\n在核电站三个受损的反应堆内，大约有900吨熔化的核燃料，其中包括1吨的约280吨。拆除它是一项艰巨的任务，官员们说这将需要30-40年的时间。批评人士说，这过于乐观了。\n东电称，该机器人携带了几台微型摄像机，在执行为后续探测器建立路径的任务时，获取了反应堆主安全壳的内部图像。\n东京电力发言人高原健一（Kenichi Takahara）说，成堆的碎片从容器底部升起，包括一些在基座内的碎片——这是堆芯正下方的一个结构——表明这些堆是熔化的燃料，落在该区域。\n高原说，在一个地方，机器人测量到的辐射水平为2西弗，这对人类是致命的。工厂工人的年度接触限值设定为50毫西弗。\n1号反应堆的机器人探测器从星期二开始，是2017以来的第一次，因为一个早期的机器人由于极高的辐射和内部结构损坏而没有获得任何熔化燃料的图像。\n第1单元的燃料被淹没在高放射性水中，深度约为2米（6.5英尺）。\n东电表示，在分析第一台机器人收集的数据和图像后，将进行额外的探测。\n日立GE核能公司和政府资助的财团国际核退役研究所（International Research Institute for Nuclear Decommission）共同开发的另外五台机器人将在未来几个月用于调查。\n东京电力公司官员说，第1单元的调查旨在测量熔化的燃料堆，在三个维度上绘制它们，分析同位素及其放射性，并收集样品。\n这些都是开发设备和安全有效地清除熔化燃料的战略的关键，从而使反应堆最终退役。\n关于如何在清理结束时安全移除、储存和处置这些高放射性物质的细节尚未确定。\n东京电力公司希望在今年晚些时候使用一个机械臂来移除来自第2单元的熔化燃料的初始勺，其中内部机器人探测器取得了最大进展。", "note_en": "TOKYO (AP) — A remote-controlled robot has captured images of what appears to be mounds of nuclear fuel that melted and fell to the bottom of the most damaged reactor at Japan’s wrecked Fukushima nuclear plant, officials said Thursday.\n A massive earthquake and tsunami in 2011 damaged cooling systems at the power plant, causing the meltdown of three reactor cores. Most of their highly radioactive fuel fell to the bottom of their containment vessels, making its removal extremely difficult.\n A previous attempt to send a small robot with cameras into the Unit 1 reactor failed, but images captured this week by a ROV-A robot show broken structures, pipes and mounds of what appears to be melted fuel and other debris submerged in cooling water, plant operator Tokyo Electric Power Company Holdings said Thursday.\n About 900 tons of melted nuclear fuel remain inside the plant’s three damaged reactors, including about 280 tons in Unit 1. Its removal is a daunting task that officials say will take 30-40 years. Critics say that’s overly optimistic.\n  The robot, carrying several tiny cameras, obtained the internal images of the reactor’s primary containment vessel while on a mission to establish a path for subsequent probes, TEPCO said.\n  TEPCO spokesperson Kenichi Takahara said the piles of debris rose from the bottom of the container, including some inside the pedestal — a structure directly beneath the core — suggesting the mounds were melted fuel that fell in the area.\n  At one location, the robot measured a radiation level of 2 sievert, which is fatal for humans, Takahara said. The annual exposure limit for plant workers is set at 50 millisievert.\n The robot probe of the Unit 1 reactor began Tuesday and was the first since 2017, when an earlier robot failed to obtain any images of melted fuel because of the extremely high radiation and interior structural damage.\n The fuel at Unit 1 is submerged in highly radioactive water as deep as 2 meters (6.5 feet).\n TEPCO said it will conduct additional probes after analyzing the data and images collected by the first robot.\n Five other robots, co-developed by Hitachi-GE Nuclear Energy and the International Research Institute for Nuclear Decommissioning, a government-funded consortium, will be used in the investigation over the next several months.\n The investigation at Unit 1 aims to measure the melted fuel mounds, map them in three dimensions, analyze isotopes and their radioactivity, and collect samples, TEPCO officials said.\n Those are key to developing equipment and a strategy for the safe and efficient removal of the melted fuel, allowing the reactor’s eventual decommissioning.\n Details of how the highly radioactive material can be safely removed, stored and disposed of at the end of the cleanup have not been decided.\n TEPCO hopes to use a robotic arm later this year to remove an initial scoop of melted fuel from Unit 2, where internal robotic probes have made the most progress.", "posttime": "2022-02-14 12:14:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机器人,福岛,photos", "title": "机器人照片似乎显示了福岛核反应堆融化的燃料", "title_en": "Robot photos appear to show melted fuel at Fukushima reactor", "transed": 1, "url": "https://apnews.com/article/science-technology-business-japan-tsunamis-9e906166eab4f838abb1251af1880a5f", "via": "", "real_tags": ["机器人", "福岛", "photos"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073035, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转到搜索XBAND（样式化为XBⱯND）是首批具有竞争力的在线游戏机网络之一，可用于Genesis和Super-NES系统。它由加利福尼亚州库比蒂诺的软件公司Catapult Entertainment制作。这是美国唯一一款获得任天堂官方许可的调制解调器。[1] [2][3]它于1994年底和1995年在美国多个地区首次亮相。\nXBAND的Genesis版本于1994年11月发布，[4]随后于1995年6月发布Super-NES版本，[5]并于1996年4月发布Super-Famicom版本。[6] 《创世纪》版本也适用于《创世纪》游牧民族。[7] 在巴西，Mega Drive服务被称为Mega Net 2，以世嘉Mega Net命名。[8]\n1995年，Catapult Entertainment与世嘉频道的制作人General Instrument签署了一项协议，该协议规定XBAND调制解调器将被安装到新的世嘉频道适配器中，世嘉频道每月提供的前5到10款游戏将通过XBAND进行连接。[9]\n最初，弹射器娱乐有限的员工，几乎没有广告。[引文需要]到1997年1月，XBAND网络可玩性几乎已经覆盖了美国的每一个大都市地区和几个农村地区。[引文需要]实际的XBAND调制解调器由美国各地的几家软件和视频租赁连锁店提供。【需要引证】在国际上，XBAND在日本市场的扩张有限，[10][11]，Catapult正在开发基于PC-[12]和Sega Saturn的[13]版本的平台，尽管它们与Mpath Interactive[14]合并，重点转向了在线PC游戏服务Mplayer。com（在2000年12月被GameSpy收购后，Mplayer.com于2001年离线并集成到GameSpy Arcade中）。[15]  [16]  [17]\n在线游戏的概念在当时是相当新的。街机仍然很受欢迎，在线游戏还不是一个家喻户晓的主意。\nXBAND调制解调器在百视达的视频分支机构中广泛使用。它的零售价为19.99美元，并根据使用情况收取额外费用。[18] 有两种定价方案。其中一家的月费为4.95美元，允许用户每月最多连接该服务50次，每增加一次连接费用为15美分。另一家的月费为9.95美元，并允许用户每月无限次连接。[19] 消耗玩家的活动&#39；该公司每月的通话费包括拨入XBAND服务进行配对、下载邮件（称为&#34；XMAIL&#34；），以及下载两份XBAND通讯的每日版，一份包含一般新闻，另一份包含特定平台的信息，如排行榜和竞赛公告。球员们还被评估为每小时3.95美元的费用，用于连接当地呼叫区以外的对手；[20] 本地通话区内的玩家对玩家连接是免费的。[7]\n调制解调器具有内置存储功能，最多可容纳四个用户（&#34；代码名&#34；）。它存储用户好友列表，其中最多可以包含10个用户的代号&#39；朋友；用户&#39；XMAIL Box，为每个用户存储最多十条传入和十条传出消息；用户&#39；排名、胜负记录和累积分数；短剖面；以及用户&#39；s化身（从40个预设化身中选择）。文本输入可以通过屏幕键盘或后来在网络上发布的可选XBAND键盘插件（29.95美元MSRP）来完成&#39；它的寿命。[19]\n客户端系统通过操纵游戏来工作&#39；s内存的方式类似于游戏精灵和第三方电脑游戏的修改，如多盗窃汽车。[21]\n当时大多数在线服务的一个问题是，只要拿起同一条线上的电话，就会失去连接。XBand操作系统旨在确保连接不会因手机活动而丢失；在呼叫等待的情况下，系统会提醒用户呼叫并允许游戏继续。[22]\nXBAND有一个官方网站，会员可以在那里查看任何其他玩家&#39；的统计数据，以及控制台上无法查看的其他信息和更新。\n1995年在《下一代》杂志上发表的一篇文章指出，XBAND调制解调器&#39；s&#34；超低延迟是其成功处理实时视频游戏的关键；。[18] 调制解调器&#39；s的数据传输速率为每秒2400位，虽然与当时的PC调制解调器相比较低，但足以处理XBAND使用的简单一对一游戏。[19]\n当连接到游戏时，除非玩家从其朋友列表中指定了特定用户，否则玩家将与该国其他地方的随机玩家（或玩家的本地区号，取决于他们的偏好设置）匹配，该玩家也将连接到同一游戏。服务器将尝试使用Elo评分系统匹配技能水平相同的玩家。[7] 当网络匹配两名玩家时，新连接的玩家&#39；XBAND调制解调器将断开与服务器的连接，并拨打另一个播放器，当电话铃响时，该播放器自己的XBAND调制解调器将应答。[7] 此时，玩家将看到XBAND徽标一起滑动，然后是配对屏幕，屏幕上显示每个玩家&#39；s的代码名、化身、位置和预输入的&#34；嘲弄&#34；。\n1995年12月，XBAND举办了第一届全国锦标赛。这是有史以来第一次在控制台上举行调制解调器对调制解调器的比赛。大奖得主因其XBAND个人资料获得了一个特别的成吉思汗图标，并从Catapult获得了200美元的现金奖励。彼得·卡佩斯，又名&#34；斯芬克斯和#34；在奥兰多，佛罗里达州成为历史上第一个通过控制台赢得现代对现代国家锦标赛的人。\n在服务的最后几个月里，一些用户发现了一种使用游戏精灵破解XBAND玩家图标的方法。这使玩家能够使用其他方面受到限制的图标，例如未发布的图标或为Xbox和团队成员之间的比赛保留的图标。图标黑客攻击导致其他用户投诉。关于XBAND图标黑客的谣言经常声称他们是精英黑客组织的成员或弹射器娱乐的成员。最终，黑客使用的方法被泄露，不可避免地在整个社区传播。[需要引用]\n到1997年3月16日，人们只能在当地区号内玩耍。[需要引证]1997年4月30日，整个网络中断，Mpath称《创世纪》和《超级无敌》缺少新游戏。[24]\nXBAND在之前的每月通讯中宣布将关闭。[需要引用]根据下一代，XBAND和#34；从未获得过可观的利润；。[14] 在XBAND和#39期间；自从XBAND存在以来，只有少数广告被制作出来，只有一款游戏《武器领主》的盒子上有XBAND的标志。XBAND在其通讯中表示，玩家是他们最好的广告形式，并提供&#34；XBAND 6套装&#34；，会员可以以折扣价订购六台调制解调器，并获得一个月的免费游戏，交换条件是注册一定数量的用户。\nXBAND和#39的主要贡献者；由于缺乏游戏开发商的支持和有限的内部资源，微软的倒闭。除了武器领主之外，弹射器必须对每一场比赛进行单独的逆向工程&#39；然后开发一个黑客程序来拦截两名玩家的活动，这样游戏就可以在一个低延迟（快速响应时间）2400波特的调制解调器连接上共享。[25]\n弹射器&#39；由于互联网使用量的增加（这是向信息时代转变的一种影响），Conexant阻止了其第二代尝试。Sega Saturn的XBAND于1996年7月27日在日本发布（尽管弹射器的总裁亚当·格罗泽表示它于1996年4月1日发布，但最终证明是超级Famicom版本）。[26][27]与SNES/Super Famicom和Genesis版本的XBAND不同，它不需要XBAND专用调制解调器，而是使用Sega&#39；s自己的世嘉NetLink设备（包括日本的14400波特调制解调器和北美的28800波特调制解调器）。[28]Saturn XBAND和PC市场的扩张都没有成功，因为开发者经常选择加入自己的网络链接，而不是使用Catapult#39；这是一项基于订阅的服务。\nXBAND服务的一个主要问题是免费的长途电话。人们发现，用户可以录制从XBAND调制解调器发送的铃声，然后接收您连接到的播放机的远程服务号码、身份验证码和电话号码。这一信息使任何人都可以拨打由Catapult公司负责的长途电话。\n寻呼公司SkyTel也面临着来自XBAND用户和他们自己客户的类似问题。XBAND用户对SkyTel和#39进行了暴力攻击；s的移动寻呼系统，以发现语音信箱使用相同的号码作为登录和密码，使用这些来扩展彼此之间的通信。大多数信息都只是在背景音乐中大声呼喊。\n一个常见的抱怨是，如果一名球员输掉了比赛，他们可以简单地拔出电话线或重置系统。这种策略被称为&#34；拉绳&#34；在XBAND用户中，阻止XBAND服务将赢家或输家归功于任何一位玩家。[7] 作为对投诉的回应，该公司开发了一个程序，可以检测此类强制断开，并将损失分配给肇事者，将胜利分配给受害者。[7] 然而，这导致大量用户致电，声称他们的重置按钮是意外按下的，并要求从他们的记录中删除损失；面对不可持续的客户服务成本，Catapult改变了计划，这样，虽然拉绳的受害者获得了胜利，但肇事者不再受到任何惩罚。[23]\n尽管营销成功率很低，但XBAND团队在与多家游戏杂志联手时确实获得了一些宣传收益，从网络上的Game Zero杂志开始，到后来的Tips&amp；技巧杂志。每日统计数据可通过&#39；XBAND新闻&#39；在调制解调器上，虽然公众看不到。发布统计数据增加了一个&#34；酷&#34；在网络游戏的早期前沿吹嘘的因素。上个月排名靠前的玩家从1996年1月开始在Game Zero和1996年初在Tips&amp；还有《技巧》杂志。\nXBAND对以下游戏进行了分析，并提供了在线兼容性。[7] [1][29]此外，在SNES版本中，可以通过插入一个“塞尔达传奇：过去的盒带链接”来解锁隐藏的迷宫游戏。\n^     &#34;过去广告中的小玩意——Baton电视剧系统；。世界1-1。2014年7月9日。\n^    &#34;XBAND进入任天堂&#34；。电子游戏月刊。72号。仙台出版社。1995年7月。p、 27。\n^a b c d e f g&#34；X体验XBAND&#34；。GamePro。第90号。IDG。1996年3月。第29-31页。\n^     &#34;Blast Processing——官方博客da@ComuDoMega 0.5&#34；。2011年4月30日。2011年5月10日从原件存档。\n^    &#34;在最后期限&#34；。GamePro。87号。IDG。1995年12月。p、 206。XBand PC将于今年晚些时候首次亮相，让Windows用户可以进行面对面的游戏。第一场比赛将是体育荣誉#39；s HardBall 5，Capcom和#39；《超级科幻II》和《僵尸&#39》；s轨迹。\n^    &#34;土星拨号XBAND服务&#34；。电子游戏月刊。85号。齐夫·戴维斯。1996年8月。p、 18。\n^34岁；在线游戏：两大巨头合并&#34；。下一代。22号。想象一下媒体。1996年10月。p、 23。\n^亚历克斯·范（2000年12月12日）&#34;GameSpy将斥资2000万美元购买Mplayer网站；。《洛杉矶时报》。\n^     &#34;GameSpy Industries完成了对Mplayer&#34；的收购；。GameSpy新闻稿。游戏区。2001年6月18日。2006年4月8日存档。\n^     &#34;GameSpy Arcade版本历史&#34；。游戏间谍。2006年3月19日从原件存档。\n^34岁；75名超级玩家：已连接&#34；。下一代。11号。想象一下媒体。1995年11月。p、 75。\n^a b c Yee，Bernard（1996年1月）&#34;快乐骑行&#34；。下一代。13号。想象一下媒体。p、 27。\n^大卫·阿什利（2010年10月25日）&#34;一些XBAND回忆&#34；。2013年5月10日从原件存档。\n^    &#34;游戏机选项&#34；。下一代。19号。想象一下媒体。1996年7月。第34-35页。\n^     &#34;存档副本&#34；。www.xband。通用域名格式。1997年2月9日从原件存档。{cite web}:CS1 maint:archivecopy as title（链接）\n受欢迎&#34；今日博客&#34；输入1up。com关于一名玩家&#39；让我们回顾一下他的疯狂和痴迷", "note_en": "Jump to navigation  Jump to search  XBAND (stylized as  XBⱯND) was one of the first competitive  online console gaming networks and was available for the  Genesis and  Super NES systems. It was produced by Catapult Entertainment, a Cupertino, California-based software company. It is the only modem released in America to have been officially licensed by Nintendo.  [1]  [2]  [3] It debuted in various areas of the United States in late 1994 and 1995.\n   The Genesis version of the XBAND was released in November 1994,  [4] with the Super NES version following in June 1995,  [5] and the Super Famicom version in April 1996.  [6] The Genesis version also works with the  Genesis Nomad.  [7] In Brazil the Mega Drive service was released as the Mega Net 2, named after the  Sega Meganet.  [8]\n In 1995, Catapult Entertainment signed a deal with General Instrument, producers of the  Sega Channel, which stipulated that the XBAND modem would henceforth be built into new Sega Channel adapters, and that the top 5 to 10 games offered by Sega Channel each month would be wired for play over XBAND.  [9]\n Initially, Catapult Entertainment had a limited staff and virtually no advertising. [   citation needed] By January 1997, XBAND network playability had reached practically every metropolitan area and several rural areas in the U.S. [   citation needed] The actual XBAND modems were carried by a handful of software and video rental chains across the United States. [   citation needed] Internationally, the XBAND saw some limited expansion in the Japanese market,  [10]  [11] and Catapult was working on PC-  [12] and  Sega Saturn-based  [13] versions of the platform, though they merged with  Mpath Interactive,  [14] and the focus shifted to the online PC gaming service,  Mplayer.com (Mplayer.com was taken offline and integrated into  GameSpy Arcade in 2001, after acquired by  GameSpy on December 2000).  [15]  [16]  [17]\n   The concept of playing online was fairly new at the time. Arcades were still quite popular, and online gaming was not yet a household idea.\n The XBAND modem was widely available at  Blockbuster Video branches during its time. It retailed for $19.99, with additional charges based on usage.  [18] Two pricing plans were available. One had a monthly fee of $4.95 and allowed the user to connect to the service up to 50 times a month with each additional connection costing 15 cents. The other had a monthly fee of $9.95 and granted the subscriber an unlimited number of connections per month.  [19] Activities that consumed a player&#39;s monthly allowance of connections included dialing into the XBAND service for matchmaking, downloading mail (called &#34;XMAIL&#34;), and downloading the daily edition of the two XBAND newsletters, one containing generic news and the other containing platform-specific information such as leaderboards and contest announcements. Players were also assessed a fee of $3.95/hour for connecting to opponents outside their local calling area;  [20] player-to-player connections inside their local calling area were free.  [7]\n The modem features built-in storage for up to four users (&#34;codenames&#34;). It stores user friend lists, which can contain the codenames of up to ten of the user&#39;s friends; the users&#39; XMAIL boxes, storing up to ten incoming and ten outgoing messages for each user; the users&#39; rankings, win/loss records, and accumulated scores; a short profile section; and the user&#39;s avatar (chosen from 40 preset avatars). Text entry is done either through an  on-screen keyboard or an optional XBAND keyboard add-on ($29.95 MSRP) released later in the network&#39;s lifespan.  [19]\n The client-side system worked by manipulating the game&#39;s memory in a way similar to  Game Genie and third-party computer game modifications such as  Multi Theft Auto.  [21]\n A problem of most online services of the time was that the connection would be lost whenever a phone on the same line was picked up. The XBand operating system was designed to ensure that connections are not lost due to phone activity; in the case of  call waiting, the system would alert the user to the call and allow the game to be resumed.  [22]\n XBAND had an official website where a member could check any other player&#39;s statistics, along with other information and updates that were not available to view on consoles.\n    A 1995 article in   Next Generation stated that the XBAND modem&#39;s &#34;ultra-low latency is the key to its successful handling of realtime videogaming&#34;.  [18] The modem&#39;s data transfer rate was 2,400  bits per second, which, while low compared to PC modems of the time, was sufficient to handle the simple one-on-one games which XBAND was used with.  [19]\n When connecting to play, unless a player specified a particular user from their friend list, players would be matched with a random player elsewhere in the country (or the player&#39;s local area code depending on their preference settings) who was also connecting to play the same game. The server would attempt to match players of like skill levels, using the  Elo rating system.  [7] When the network matched two players up, the newly-connected player&#39;s XBAND modem would disconnect from the server and dial the other player, whose own XBAND modem would answer when the phone rang.  [7] At that point the players would see the XBAND logo slide together, followed by the matchup screen, which displayed each player&#39;s codenames, avatars, locations, and a pre-typed &#34;taunt&#34;.\n In December 1995 XBAND launched its first national tournament. This was the first modem to modem tournament ever to be held over a console. The grand prize winner received a special  Genghis Khan icon for their XBAND profile and a $200 cash prize from Catapult. Peter Kappes aka &#34;SphiNX&#34; of  Orlando, FL became the first person in history to win a modem to modem national tournament over a console.\n  During the last few months of service, several users discovered a way to use a  Game Genie to hack the icons of XBAND players. This enabled players to use icons that were otherwise restricted, such as unreleased icons or icons reserved for matches between XBAND team members. Icon hacking resulted in complaints from other users. Rumors about XBAND icon hackers often claimed they were part of elite hacking organizations or members of Catapult Entertainment. Eventually, the method used by the hackers was leaked and inevitably spread throughout the community. [   citation needed]\n  By March 16, 1997, people could only play within their local area code. [   citation needed] On April 30, 1997, the entire network was discontinued, with Mpath citing a lack of new games for the Genesis and Super NES.  [24]\n XBAND had announced in their previous monthly newsletter that they were shutting down. [   citation needed] According to   Next Generation, XBAND &#34;never turned a significant profit&#34;.  [14] During XBAND&#39;s existence, only a handful of advertisements were ever made, and only one game,   Weaponlord, had the XBAND logo on its box. XBAND stated in their newsletter that players were their best form of advertising, and offered the &#34;XBAND 6 pack&#34;, where members could order six modems at a discounted rate and receive a month of free gaming in exchange for signing up a certain number of people to the service.\n Heavy contributors to XBAND&#39;s demise were the lack of support from game developers and limited internal resources. With the exception of  Weaponlord, Catapult had to individually  reverse engineer each game&#39;s code, then develop a hack to intercept two-player activity so the game could be shared over a low-latency (fast response time), 2,400-baud modem connection.  [25]\n Catapult&#39;s second generation attempts were blocked by  Conexant due to the increasing of Internet uses, a effect from the shift to the  Information Age. The XBAND for Sega Saturn was Released in Japan on July 27, 1996 (although the Catapult&#39;s president Adam Grosser stated that it was &#34;Launched on April 1, 1996&#34;, but turned out to be the Super Famicom versions).  [26]  [27] Unlike the SNES/Super Famicom and Genesis versions of XBAND, it did not require an XBAND-specific modem, instead utilizing Sega&#39;s own  Sega NetLink device (which included a 14,400 baud modem in Japan and a 28,800 baud modem in North America).  [28] Neither the Saturn XBAND nor an expansion into the PC market panned out, as developers frequently opted to include their own network linking rather than deal with Catapult&#39;s subscription-based service.\n  A major issue for the XBAND service was free long-distance phone calls. It was discovered that a user could record the tones sent from an XBAND modem and then receive the long-distance service number, the authentication code, and phone number of the player you were connecting to. This information allowed anyone to access long-distance phone calls that were charged to Catapult.\n Paging company  SkyTel faced similar problems from both XBAND users and their own customers. XBAND users performed brute-force attacks against SkyTel&#39;s mobile paging system in order to discover  voicemail boxes using the same number as the login and password, using these to extend their communication with each other. Most messages consisted simply of  shout-outs with music playing in the background.\n A common complaint was that if a player was losing a match, they could simply pull their phone cord out or reset their system. This tactic, known as &#34;cord-pulling&#34; among XBAND users, prevented the XBAND service from crediting either player with the win or loss.  [7] In response to complaints, the company developed a program which would detect such forced disconnections and assign a loss to the perpetrator and a win to the victim.  [7] However, this led to a flood of calls from users claiming that their reset button had been pushed by accident and demanding that the loss be erased from their record; facing unsustainable customer service costs, Catapult changed the program so that while victims of cord-pulling were awarded a win, perpetrators were no longer penalized in any way.  [23]\n  Despite poor marketing success, the XBAND team did manage some publicity gains when they joined forces with a number of gaming magazines, starting on the web with Game Zero magazine and later in  Tips &amp; Tricks Magazine. Daily stats were accessible via &#39;XBAND News&#39; on the modem, although they were not visible to the general public. Publishing stats added a &#34;cool&#34; factor to brag about in the early forefronts of online gaming. The top-ranked gamers of the previous month were published starting in January 1996 in Game Zero and, starting in early 1996, in Tips &amp; Tricks magazine as well.\n  The following games have been analyzed, and online compatibility provided, by XBAND.  [7]  [1]  [29] Additionally, a hidden maze game could be unlocked in the SNES version by inserting a   The Legend of Zelda: A Link to the Past cartridge.\n     ^     &#34;Gadgets from the ads of the past – Teleplay System by Baton&#34;.  World 1-1. July 9, 2014 .\n  ^    &#34;XBAND Goes Nintendo&#34;.   Electronic Gaming Monthly. No. 72. Sendai Publishing. July 1995. p. 27.\n  ^     a     b     c     d     e     f     g    &#34;X-Perience XBAND&#34;.   GamePro. No. 90.  IDG. March 1996. pp. 29–31.\n ^     &#34;Blast Processing – Blog Oficial da @ComuDoMega 0.5&#34;. April 30, 2011. Archived from  the original on May 10, 2011 .\n    ^    &#34;At the Deadline&#34;.   GamePro. No. 87.  IDG. December 1995. p. 206.  XBand PC will debut late this year to make head-to-head gameplay possible for Windows owners. The first games out of the chute will be Sport Accolade&#39;s  HardBall 5, Capcom&#39;s  Super SF II, and Zombie&#39;s  Locus.\n ^    &#34;Saturn Dials Up XBAND Service&#34;.   Electronic Gaming Monthly. No. 85.  Ziff Davis. August 1996. p. 18.\n ^     a     b    &#34;Online Gaming: Two Giants Merge&#34;.   Next Generation. No. 22.  Imagine Media. October 1996. p. 23.\n ^    Pham, Alex (December 12, 2000). &#34;GameSpy to Buy Mplayer Web Site for $20 Million&#34;.  Los Angeles Times.\n ^     &#34;GameSpy Industries Completes Acquisition of Mplayer&#34;.  GameSpy Press Release. GameZone. June 18, 2001. Archived from  the original on April 8, 2006 .\n ^     &#34;GameSpy Arcade Version History&#34;. GameSpy. Archived from  the original on March 19, 2006 .\n ^     a     b    &#34;75 Power Players: Connected&#34;.   Next Generation. No. 11.  Imagine Media. November 1995. p. 75.\n ^     a     b     c    Yee, Bernard (January 1996). &#34;Joyriding&#34;.   Next Generation. No. 13.  Imagine Media. p. 27.\n  ^    Ashley, David (October 25, 2010).  &#34;Some XBAND Recollections&#34;. Archived from  the original on May 10, 2013 .\n      ^    &#34;Game Console Options&#34;.   Next Generation. No. 19.  Imagine Media. July 1996. pp. 34–35.\n  ^     &#34;Archived copy&#34;.  www.xband.com. Archived from  the original on February 9, 1997 .   {{ cite web}}: CS1 maint: archived copy as title ( link)\n  Popular &#34; Blog of the Day&#34; entry on 1up.com about one gamer&#39;s look back on his XBand obsession", "posttime": "2022-02-14 12:07:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "xband", "title": "Xband", "title_en": "Xband", "transed": 1, "url": "https://en.wikipedia.org/wiki/XBAND", "via": "", "real_tags": ["xband"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073033, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "UFO观察人士表示，2022年可能会是一个丰收的年份，因为在一份备受期待的报告发布后，对细节的呼声越来越高\n去年是UFO突破的一年，一份具有里程碑意义的政府报告促使外星访客最终被所有人重视，从参议员到前总统，再到五角大楼。\n但专家们表示，2022年可能会更加深远，因为披露和发现UFO的呼声不断高涨，新的科学项目使我们比以往任何时候都更接近——可能是——发现非地球生命。\n6月，五角大楼发布了一份备受期待的关于不明飞行现象（UAP）的报告，这是目前地外界一些人首选的术语，该报告发现了140多个无法解释的UAP实例。\n此前，泄露的军事录像记录了天空中看似超凡脱俗的事件，海军飞行员的证词在某种程度上帮助澄清了一个长期以来被阴谋论和可疑目击事件定义的主题。\n尼克·波普（Nick Pope）说：“我相信2022年将是不明飞行物的地震年。”他在20世纪90年代初为英国国防部调查不明飞行物。\n在国会，一个由两党参议员组成的小组多年来一直在推动政府发布更多有关不明飞行物的信息，在国会，以及美国国防部和情报界，波普说，他感觉到“真正希望控制这个问题”。\n“我想我们会看到国会就不明飞行物举行听证会，”波普说。“我还认为，我们将看到更多关于不明飞行物的美军照片和视频以及相关文件的发布。其中一些可能是通过告密者发布的，但其中大部分可能是由政府自己主动发布的，或者是根据《信息自由法》的要求发布的。\n“最后，我认为我们会看到更多高水平的证人站出来，包括商业航空公司飞行员、军事机组人员、雷达操作员和直接了解这一主题的情报官员。”\n是一群飞行员在2021提出了这个问题。在60分钟的突破性采访中，美国海军成员排队回忆他们在美国海岸遭遇不明飞行物的经历。退役海军飞行员瑞安·格雷夫斯在哥伦比亚广播公司的节目中说，这件事发生得如此频繁，以至于这种遭遇变得司空见惯。\n“每天，”格雷夫斯说。“至少在几年内每天都这样。”\n多年来，飞行员一直拒绝分享他们的UFO经历，担心被贴上“怪人”的标签或被传给晋升。然而，泄露的军事录像显示，圣地亚哥附近一艘美国海军军舰附近有一个椭圆形飞行物体，另外还有一些视频显示，三角形物体在天空中嗡嗡作响，这两名海军飞行员的说法得到了证实。\n美国政府于2021年6月发布的不明飞行物报告激起了更多兴趣。五角大楼研究了2004到2021年间军事飞行员报告的144起事件。官员们能够解释其中一个事件——那是一个气球——但其余的仍然是个谜。\n自那以后，在美国参议员基尔斯滕·吉利布兰德（Kirsten Gillibrand）和马尔科·卢比奥（Marco Rubio）的推动下，五角大楼成立了一个新的办公室，负责报告和分析UFO报告，尽管UFO界的一些人怀疑政府对其调查结果不够坦诚。\n尽管如此，随着对信息的呼声越来越高，科学界的兴趣也越来越大，2022年将启动一系列新项目，专门用于探测外星生命。\n哈佛大学（Harvard University）小弗兰克·B·贝尔德（Frank B Baird Jr）科学教授阿维·勒布（Avi Loeb）就是其中之一的幕后推手。他是伽利略项目的负责人，该项目旨在建立一个复杂的望远镜网络，以扫描天空中的外星物体。\n这个由私人资助的项目涉及100多名科学家，它正在哈佛大学天文台的屋顶上建造第一个望远镜系统，并将于今年夏天开始运行。勒布计划公开这些项目的调查结果。\n该望远镜将使用红外摄像机对天空进行全天候拍摄，并配备无线电传感器、音频传感器和磁强计，以检测非视觉物体。勒布说，计算机将使用人工智能分析数据，忽略鸟类、无人机、飞机和流星等物体，并对任何“非人类制造”的物体给予额外关注。\n勒布说：“我们走的是一条没有人走过的路，所以可能会有低垂的果实，没有人采摘，因为它没有人走过。”。\n勒布说，尽管UFO研究可能正在走向终结，但该领域仍然受到一些天体物理学家和其他学者的轻视，这可能会让年轻科学家望而却步。\n勒布说：“我真的希望下一代能够自由地讨论它，让它成为主流的一部分。”。“我的希望是，通过获得某个不寻常事物的高分辨率图像，或找到证据，这在未来一两年内是很有可能的，我们将改变它。”\n伽利略项目还希望使用行星实验室收集的数据，该实验室使用一组微型卫星每天对整个地球成像一次。通过上下观察，发现的可能性增加了。\n勒布说，合作很重要，因为迄今为止，对不明飞行物的搜索充其量只是一种不切实际的行为。但勒布说，那些声称没有外星人证据的人是被误导了。\n“就像一个渔夫在海滩上，看着大海，说：‘鱼都在哪里？我什么都没看到？’”他说。“显然，如果你不使用渔网，你什么也找不到。”\n长时间的太空爱好者也对James Webb太空望远镜的影响充满希望，这是美国宇航局于2021年12月发射的最大、最强大的太空望远镜。当韦伯望远镜今年夏天开始运行时，它将使天文学家能够扫描天空，回顾宇宙最初形成的时间，并帮助研究系外行星：环绕其他太阳的行星。\n《奔月：新太空竞赛》一书的作者、50多年来一直在报道太空产业的记者伦纳德·戴维说，这些共同努力可能使2022年成为“一个重要的一年”。\n大卫说：“这是一个活着的好时机。底线是有东西要来了。你不能让那么多人做那么多的研究，然后一无所获。”。\n“在某个时刻，我们将拥有一系列科学数据，这些数据支持我们可能是地球上一个相当平凡的地方，那里有很多外星文明。”。\n“我们必须开始思考，我们并不孤单。问题是：那里有多拥挤？”\n任何关于外星生命的讨论都有一个常见的背景，那就是它将如何影响地球上的人类。一些人推测，宗教可能会彻底动摇，或者可能会出现大规模的生存危机。\n大卫说，然而，外星人可能意识到我们，并故意忽视我们的星球，这将对人类的自我重要性造成同样毁灭性的打击。\n“我不知道地球到底在哪里，为什么我们会成为任何关注的接收端，”他说。", "note_en": "UFO-watchers say 2022 could prove a bumper year, as clamor for details grows in the wake of a highly anticipated report\n   L ast year was a breakthrough time for UFOs, as a landmark government report prompted the possibility of extraterrestrial visitors to finally be taken seriously by everyone from senators, to  a former president, to the Pentagon.\n But 2022 could be even more profound, experts say, as the clamor for UFO disclosure and discovery continues to grow, and as new scientific projects bring us closer than ever to – potentially – discovering non-Earth life.\n   In June, the Pentagon released a highly anticipated report on unexplained aerial phenomena (UAP), the now preferred nomenclature by some in the extraterrestrial community, which found more than 140 instances of UAPs that could not be explained.\n The report came after leaked military footage  documented seemingly otherworldly happenings in the sky, and after testimony from navy pilots helped to somewhat destigmatize a subject that has long been defined by conspiracy theories and dubious sightings.\n  “I’m confident that 2022 is going to be a seismic year for UFOs,” said Nick Pope, who spent the early 1990s investigating UFOs for the British ministry of defence.\n In Congress, where a bipartisan group of senators has been pushing for years for the government to release more information on UFOs, and from the US defense department and intelligence community, Pope said he senses “a genuine desire to grip the issue”.\n “I think we’ll see congressional hearings on UFOs,” Pope said. “I also think we’ll see the release of more US military photos and videos of UFOs, and associated documents. Some of this may come via whistleblowers, but much of it may be released by the government itself, either proactively, or in response to requests under the Freedom of Information Act.\n “Finally, I think we’ll see more high-calibre witnesses coming forward, including commercial airline pilots, military aircrew, radar operators, and intelligence officers with direct knowledge of this subject.”\n It was a group of pilots who brought the issue to the fore in 2021. In a breakthrough interview  with 60 Minutes, members of the US Navy lined up to recall their experiences of encountering UFOs on America’s coasts. It happened so frequently that the encounters became commonplace, Ryan Graves, a retired navy pilot, told the CBS show.\n “Every day,” Graves said. “Every day for at least a couple years.”\n For years, pilots had refused to share tales of their UFO experiences, worried of being labeled kooks or being passed over for promotion. The account of the navy pilots was given credibility, however, by  leaked military footage which showed  an oval flying object near a US navy ship off San Diego, and  separate videos which showed triangular-shaped objects buzzing around in the sky.\n The US government’s UFO report, released in June 2021, fueled more interest. The Pentagon studied 144 incidents reported by military pilots between 2004 and 2021 in preparing the report. Officials were able to explain one of the incidents – it was a balloon – but the rest remain a mystery.\n Since then the Pentagon, pushed by US senators Kirsten Gillibrand and Marco Rubio, has launched a new office for reporting and analyzing UFO reports, although some in the UFO community suspect the government to be  less than forthcoming with its findings.\n Still, as the clamor for information has grown, so has interest from the scientific community, and in 2022 a slew of new projects will launch, specifically aimed at detecting alien life.\n Avi Loeb, the Frank B Baird Jr professor of science at Harvard University, is behind one of those. He is the head of the  Galileo Project, which aims to establish a network of sophisticated telescopes which will scan the skies for extraterrestrial objects.\n  The privately funded project, which involves more than 100 scientists, is building its first telescope system on the roof of the Harvard college observatory, and it will begin operating this summer. Loeb plans to make the projects’ findings publicly available.\n The telescope will use infra-red cameras to take 24/7 video of the sky, and is equipped with a radio sensor, an audio sensor and a magnetometer to detect non-visual objects. A computer will use artificial intelligence to analyze the data, ignoring objects like birds, drones, planes, and meteors, and paying extra attention to any objects “that are not human-made”, Loeb said.\n “We’re taking a road not taken so there may be low hanging fruit, that nobody else picked because it was not taken,” Loeb said.\n For all that UFO research may be becoming destigmatized, Loeb said the field is still looked down upon by some astrophysicists and other academics, which can turn off young scientists.\n “I really want the next generation to be free to discuss it, and for it to become part of the mainstream,” Loeb said. “My hope is that by getting a high resolution image of something unusual, or finding evidence for it, which is quite possible in the coming year or two, we will change it.”\n The Galileo Project also hopes to use data collected by  Planet Labs, which uses a fleet of miniature satellites to image the entire Earth once a day. By both looking up and down, the likelihood of discovery is increased.\n Collaboration is important, Loeb said, as the search for UFOs to date has been quixotic at best. But those who claim the lack of evidence of extraterrestrials means that alien life does not exist are misguided, Loeb said.\n “It’s just like a fisherman on the beach, looking at the ocean, saying: ‘Where are all the fish? I don’t see anything?’” he said. “And obviously if you don’t use a fishing net you will not find anything.”\n Long-time space enthusiasts are also hopeful about the impact of the  James Webb space telescope, the largest and most powerful of its kind, which Nasa launched in December 2021. When it begins operating this summer, the Webb telescope will enable astronomers to scan the skies, peering back to when the universe was first beginning to form, as well as help study exo-planets: worlds that circle other suns.\n These concerted efforts could make 2022 “a banner year”,  Leonard David, author of  Moon Rush: the New Space Race, and a journalist who has been reporting on the space industry for more than five decades, said.\n “It’s a great time to be alive. The bottom line is something’s coming. You can’t have that many people doing that much research and come up dry,” David said.\n “At some point we’re going to have a confluence of scientific data that supports the likelihood that we’re a pretty mundane place here on earth, and there’s a lot of alien civilizations that are out there.\n “We’ve got to start thinking we’re not alone. It’s: how crowded is it up there?”\n A frequent backdrop to any discussion of alien life is how it would affect humans here on earth. Some speculate that religions could be shaken to their core, or that there could be a mass existential crisis.\n David said that extraterrestrials, however, could be aware of us and be deliberately ignoring our planet, which would represent an equally devastating blow to the human sense of self-importance.\n “I don’t know exactly where the Earth fits in and why we would be on the receiving end of any attention,” he said.", "posttime": "2022-02-14 11:54:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,认真对待,finally,可能", "title": "美国终于准备好认真对待UFO了吗？", "title_en": "Is America finally ready to take UFOs seriously?", "transed": 1, "url": "https://www.theguardian.com/world/2022/feb/05/ufos-america-aliens-government-report", "via": "", "real_tags": ["美国", "认真对待", "finally", "可能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073032, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "西班牙当局表示，他们捣毁了一个SIM卡交换犯罪团伙，该团伙利用身份盗窃和伪造文件和短信来攻击受害者的银行账户。\n西班牙国家警察局在一份新闻稿中表示，他们逮捕了八名与该行动有关的人。该行动最迟于去年3月开始。当局说，这些嫌疑人伪装成银行雇员，利用假消息获取目标个人的个人信息和银行详细信息。\n“通过这种方式，他们欺骗了手机商店的员工，让他们获得了复制的SIM卡，并通过这种方式获得了银行的安全确认信息，”声明称。“通过这种方式，他们可以在网上银行进行操作，并在收到银行的安全确认信息后访问银行账户清空账户。”\n🚩8.关于欺诈行为的详细信息，包括中间人对中间人的信息的获取，以防止中间人的恶意行为，并使其成为电信业的雇员。啁啾com/tKfZfOFckI\n-国家警察局（@policia）2022年2月10日\nSIM卡是指插入特定硬件（通常是手机）的指甲大小的芯片，这样移动运营商就可以将其连接到移动账户。当犯罪分子诱骗运营商的员工用分配给骗子的新卡替换目标账户持有人的合法卡时，就会发生SIM卡交换。\nSIM卡交换通常用于重置电子邮件帐户，从而允许骗子重置银行帐户和其他在线帐户的密码。骗子还使用SIM卡交换来完成选择使用短信而非更安全的2FA形式的服务的双因素身份验证。\n去年3月，国家警察局特工在接到两起关于在该国不同地理位置进行欺诈性银行交易的投诉后，开始调查该团伙。两名受害方表示，他们的账户未经他们同意就被访问了。调查人员最终将注意力集中在巴塞罗那的活动上，他们说，犯罪分子在那里洗钱，这些钱是从非法银行转账中偷来的。\n当嫌疑人获得受害者的SIM卡时，“受害者失去了手机上的覆盖信号，因为在激活复制品时，它立即被停用，将线路留在被捕者手中，”当局表示。“欺诈者[然后]从银行收到了带有授权交易所需密钥的信息。为此，他们使用来自欧洲各国的网上银行，甚至代表受害者，使追踪和定位资金变得困难。”\nSIM卡交换已经演变成一种越来越普遍的犯罪形式。多年来，它导致了一系列盗窃案，从加密货币钱包和银行账户中流失了数百万美元。许多移动运营商几乎没有有效的SIM卡交换保护措施，即使有，T-mobile也有解决方案，例如，已知攻击者会利用漏洞进行攻击。单个智能手机（而不是使用同一运营商的其他智能手机）意外丢失网络信号可能是SIM卡交换的迹象。通常，在账户重置和资金耗尽之前，受害者几乎没有时间做出有效回应。\n本周早些时候，联邦调查局表示，从2018年1月到2020年12月，它收到了320起与SIM卡交换事件有关的投诉，这些事件导致调整后的损失约为1200万美元。去年，联邦调查局收到1611起SIM卡交换投诉，调整后的损失超过6800万美元。", "note_en": "Authorities in Spain said they broke up a SIM-swapping crime ring that used identity theft and falsified documents and texts to target victims’ bank accounts.\n In a  press release, Spain’s National Police agency said it arrested eight individuals in connection with the operation, which began no later than last March. The suspects, the authorities said, posed as bank employees and used fake messages to obtain personal information and bank details of targeted individuals.\n “With this, they deceived the employees of phone stores to obtain duplicate SIM cards and, in this way, have access to the bank&#39;s security confirmation messages,” the release stated. “In this way, they could operate in online banking and access bank accounts to empty them after receiving security confirmation messages from the banks.”\n 🚩8 detenidos por defraudar a personas de toda  #España mediante el  #SimSwapping   Obtenían información de sus víctimas mediante mensajes maliciosos y engañaban a empleados de tiendas de telefonía para duplicar las tarjetas SIM y así vaciar sus cuentas bancarias #SomosTuPolicía  pic.twitter.com/tKfZfOFckI\n— Policía Nacional (@policia)  February 10, 2022\n SIM cards are the fingernail-sized chips that are inserted into a specific piece of hardware—usually a phone—so mobile carriers can link it to a mobile account. SIM swapping occurs when a criminal tricks an employee of a carrier into replacing the legitimate card belonging to a targeted account holder with a new one that is assigned to the scammer.\n SIM swapping is typically used to perform email account resets, which in turn allow the scammer to reset passwords for bank accounts and other online accounts. Scammers also use SIM swapping to complete two-factor authentication verifications for services that choose to use SMS text messaging rather than more secure forms of 2FA.\n    National Police agents began investigating the ring last March after receiving two complaints of fraudulent bank transactions in different geographical locations in the country. The two injured parties said their accounts had been accessed without their consent. Investigators eventually zeroed in on activity in Barcelona, where they said the criminals were laundering money stolen in the illegal bank transfers.\n When the suspects obtained the victims’ SIMs, “the victims lost the coverage signal on their phones, since when activating the duplicate, it was immediately deactivated, leaving the line in the hands of those arrested,” the authorities stated. “The fraudsters [then] received the messages from the bank with the necessary keys to authorize transactions. For this, they used online banks from various European countries, and even on behalf of victims to make it difficult to trace and locate the money.”\n  SIM swapping has evolved into an increasingly prevalent form of crime. Over the years, it has led to a rash of thefts that has  drained  millions of dollars from  cryptocurrency wallets and  bank accounts. Many mobile carriers have few effective SIM-swapping safeguards in place, and even when they do— T-Mobile has a solution, for instance—attackers have been known to  exploit loopholes. An unexpected loss of network signal on a single smartphone (but not on others using the same carrier) is a possible sign of SIM swapping. Often, the victim has little time to effectively respond before accounts are reset and funds are drained.\n Earlier this week, the FBI  said that from January 2018 to December 2020, it received 320 complaints related to SIM-swapping incidents that resulted in adjusted losses of about $12 million. Last year, the FBI received 1,611 SIM-swapping complaints, with adjusted losses of more than $68 million.", "posttime": "2022-02-14 11:52:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "警方,spain,银行", "title": "西班牙警方拆除了一个耗尽银行账户的SIM卡交换环", "title_en": "Police in Spain dismantle a SIM-swapping ring that drained bank accounts", "transed": 1, "url": "https://arstechnica.com/information-technology/2022/02/police-in-spain-dismantle-a-sim-swapping-ring-that-drained-bank-accounts/", "via": "", "real_tags": ["警方", "spain", "银行"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073031, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "数据显示，英国脱欧加剧了新冠疫情的破坏，服装出口下降60%，蔬菜下降40%，汽车下降25%\n英国脱欧以来第一个全年的官方数据显示，与上一个稳定的对欧贸易期相比，英国对欧盟的商品出口下降了200亿英镑。\n国家统计局（ONS）周五发布的数据显示，与2018年相比，大流行和英国退出单一市场的综合影响导致去年1月至12月的出口下降了12%。\n与2018年的水平相比，对除27国集团以外的世界其他地区的出口下降了100亿英镑，降幅小得多，约为6%，突显了脱离欧盟的不成比例的影响。\n英国退欧2019冠状病毒疾病指数与三年前的数据相比，因为这是公司在BrimIT期限前的库存扭曲和COVID-19的蔓延前的最后一年。\n尽管受到干扰，欧盟仍然是英国最大的贸易伙伴。然而，自1997年开始有类似记录以来，英国从世界其他地区进口商品的支出首次超过了从欧盟进口商品的支出。\n与2018年相比，英国从欧盟进口的商品下降了近17%，约450亿英镑。相比之下，来自世界其他地区的进口增长了近13%，约280亿英镑。\n由于欧盟仅占英国全球出口额的一半以上，经济学家表示，英国脱欧对英国构成了额外的阻力，加剧了发达经济体感受到的新冠疫情带来的破坏。咨询公司万神殿宏观经济学（Pantheon Macroeconomics）的经济学家加布里埃拉·狄更斯（Gabriella Dickens）说：“英国出口商继续失去市场份额。”。\n尽管贸易水平在最近几个月有所回升，但荷兰经济政策分析局的数据显示，发达经济体的实际商品出口比2018年11月的平均水平高出3.8%，超过了英国。\n受打击最严重的大宗商品价格出现了大幅下跌。与2018年相比，出口至欧盟的服装和鞋类均下降了近60%。食品和活体动物出口——需要更严格的边境检查——下降了近18%，而蔬菜出口下降了近40%。由于全球供应链问题和新冠疫情的严重干扰，运往欧盟的汽车数量减少了四分之一。\n瑟赛克斯大学贸易经济学家Guillermo Larbalestier表示，蔬菜出口量的下降可能与季节性工人数量的减少有关，这些季节性工人可采摘和加工农作物，更繁重的文书工作和出口易腐烂的货物在边境的长期延误时难以出口。\n服装出口受到了影响，因为英国零售商销售的服装中有很大一部分是在亚洲或美国制造的，这使得他们没有资格享受脱欧后贸易协议中谈判的关税。\n然而，最新数据显示，2021年1月英国退欧最严重的一次，是在英国离岸后，欧盟出口骤降40%。\n根据最新数据，英国2021年12月对欧盟的出口量比2018月份同期高出2亿英镑，但其中大部分损坏是由于国际能源市场批发气价的上涨。\n商界领袖警告称，边境限制和大量繁文缛节推高了成本，延长了交货时间，永久性地削弱了英国商品在欧洲大陆的竞争力。\n国家统计局的调查显示，上个月67%的公司在出口时遇到了挑战，72%的公司在进口时遇到了挑战。\n在@BusinessDesk上通过电子邮件或Twitter上的《卫报》商业频道注册《今日商业日报》\n国家统计局首席经济学家格兰特·菲茨纳（Grant Fitzner）表示：“贸易摩擦要大得多，预计会产生更大的中长期影响。”。\n影子国际贸易部长加雷斯·托马斯（Gareth Thomas）表示，政府夸大了与欧盟以外尚未谈判的国家达成贸易协议的好处。他说：“部长们在支持我们在欧洲以外市场的出口商方面做得不够，而他们与欧盟谈判的协议导致进入多佛的卡车长龙，繁文缛节大幅增加，贸易大幅下降。”。\n英国政府发言人表示：2019冠状病毒疾病的全球经济衰退和供应链中断，导致了英国最近的统计数据的波动，但目前还没有过早得出任何结论。我们与欧盟的新贸易关系。\n“我们将继续确保企业获得与欧洲有效贸易所需的支持。”", "note_en": "Figures show Brexit compounding Covid disruption, with clothing exports plunging 60%, vegetables down 40% and cars 25%\n    UK exports of goods to the EU have fallen by £20bn compared with the last period of stable trade with  Europe, according to official figures marking the first full year since Brexit.\n Numbers released on Friday by the  Office for National Statistics (ONS) showed that the combined impact of the pandemic and Britain’s exit from the single market caused a 12% fall in exports between January and December last year compared with 2018.\n  Highlighting the disproportionate impact of leaving the EU, exports to the rest of the world excluding the 27-nation bloc dropped by a much smaller £10bn, or about 6% compared with 2018 levels.\n  The ONS compared trade performance against figures from three years ago because that was the last year before distortions caused by firms stockpiling ahead of  Brexit deadlines and the spread of Covid-19.\n Despite the disruption, the EU remains the UK’s largest trading partner. However, for the first time since comparable records began in 1997, the UK now spends more importing goods from the rest of the world than it does from the EU.\n UK goods imported from the EU were down almost 17%, or about £45bn, compared with 2018. In comparison, imports from the rest of the world increased by almost 13%, or about £28bn.\n  With the EU accounting for just over half of UK exports worldwide, economists said Brexit was serving as an extra headwind for Britain, compounding the disruption from Covid being felt across advanced economies. “UK exporters are continuing to lose market share,” said Gabriella Dickens, an economist at the consultancy Pantheon Macroeconomics.\n Although trade levels have picked up in recent months, data from the Netherlands Bureau for Economic Policy Analysis show that real goods exports from advanced economies were 3.8% above their 2018 average in November, outpacing the UK.\n The hardest-hit commodities recorded dramatic falls. Outbound shipments of clothing and footwear to the EU were both down by almost 60% compared with 2018. Food and live animal exports – for which more stringent border checks are required – were down almost 18%, while vegetable exports dropped by almost 40%. Shipments of cars to the EU, heavily disrupted by global supply chain issues and Covid, were down by a quarter.\n Guillermo Larbalestier, a trade economist at the University of Sussex, said the drop in vegetable exports was probably linked to a fall in the number of seasonal workers available to pick and process crops, more burdensome paperwork and the difficulty in exporting perishable goods in the face of extended delays at the border.\n Clothing exports have been affected because a high proportion of garments sold by UK retailers are made in Asia or the US, making them ineligible for the tariffs negotiated in the post-Brexit trade deal.\n  However, the latest figures do suggest a recovery from the worst of the Brexit damage seen in January 2021, just after Britain’s departure, when exports to the EU  plunged by 40%.\n According to the latest figures, UK exports to the EU were about £200m higher in December 2021 than the same month in 2018, but much of this was driven by an increase in wholesale gas prices on international energy markets.\n Business leaders have warned that border restrictions and reams of red tape have pushed up costs and added to delivery times, permanently undermining the competitiveness of UK goods on the continent.\n Sixty-seven percent of firms experienced a challenge when exporting and 72% when importing in the last month, according to ONS surveys.\n Sign up to the daily Business Today email or follow Guardian Business on Twitter at @BusinessDesk\n “There is a lot more friction on trade, which you would expect to have a more medium-to long-term impact,” said Grant Fitzner, chief economist at the ONS.\n Gareth Thomas, the shadow international trade minister, said the government had exaggerated the benefits of trade deals with countries outside the EU that have yet to be negotiated. “Ministers are not doing enough to support our exporters in markets outside Europe, while the deal they negotiated with the EU has led to long lorry queues into Dover, a big increase in red tape and a significant decline in trade,” he said.\n A UK government spokesperson said: “UK goods exports to EU nations were 4% higher last year compared with 2020. However, as the ONS itself recognises, the impact of the Covid-19 pandemic, global recession and supply chain disruption, have caused higher levels of volatility in recent statistics. It is therefore still too early to draw any firm conclusions on the long-term impacts of our new trading relationship with the EU.\n “We are continuing to ensure that businesses get the support they need to trade effectively with Europe.”", "posttime": "2022-02-14 11:48:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "出口,eu,英国", "title": "国家统计局的最新数据显示，去年英国对欧盟的出口下降了200亿英镑", "title_en": "UK exports to EU fell by £20bn last year, new ONS data shows", "transed": 1, "url": "https://www.theguardian.com/politics/2022/feb/11/uk-exports-to-eu-fell-by-20bn-last-year-new-ons-data-shows", "via": "", "real_tags": ["出口", "eu", "英国"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073030, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每隔一段时间，我需要通过USB引导设置一个系统。每次我都在拼命寻找一个可以通过操作系统安装程序擦除的U盘。这里是如何建立最后一个终极USB多开机棒，你永远都需要-与Ventoy&amp；mldr\n为了制造木棍，你首先需要一些硬件。当然，你可能已经有一个U盘了，对吧？我建议使用至少64GB和USB3的FAST one，因为我们会在上面放很多东西。以下是一些价格合理的选项（会员链接）：\n小巧快速的U盘价格适中，外形小巧，适合任何地方使用\n而不是一根棍子&amp；mldr可以在我试过的任何地方启动——所以拥有可升级存储的U盘是一个不错的选择\n注意：VentoyUSB stick既不适用于MacOS安装，也不适用于非x86/x64体系结构——但我知道，这些是唯一的限制。\n运行安装程序，格式化驱动器并让其完成（提示：选择NTFS或extFat，进一步阅读了解原因）\n如果您想升级ventoy版本（例如，为了支持更多图像），其步骤与安装相同。只需运行安装程序并升级。该操作是安全的，您的数据分区不会被更改，但我仍然建议备份您的文件，以防出现问题\n所以这里最棒的部分是：你不必总是刷新整个U盘，你可以\n任何你想去的地方——完成！从USB启动时，Ventoy将扫描整个数据分区，并为每个支持的操作系统映像自动生成一个菜单项。目录不会改变菜单结构，会被展平。\n不要将棒用作数据驱动器-额外的文件会降低菜单生成的速度\n出于兼容性原因，最好使用NTFS（如果不能使用NTFS，请使用extFAT）-请参阅https://www.ventoy.net/en/doc_disk_layout.html\n您还可以将非安装程序/不可引导的映像放在数据分区上（如RaspiOS或其他嵌入的东西），以将所有内容保持在一个位置\n由于本指南并不是什么创新，只是在炫耀Ventoy，因此我推荐以下操作系统映像列表，供日常使用，如系统恢复、格式化驱动器和在VM内引导USB（如果需要）。\nWindows 10 PE live CD提供了许多有用的备份和恢复工具\n帮助您引导到任何操作系统，即使您无法以正常方式引导到它。\nLinux系统救援工具包，用于在崩溃后管理或修复系统和数据", "note_en": "Every once in a while, I need to setup a system via USB boot. Everytime I’m desperately looking for a USB-stick that can be erased flashing an OS installer. Here is how to build the last ultimate USB multi boot stick, you’ll ever gonna need - with  Ventoy&amp;mldr\n  In order to build the stick you first need some hardware. Of course, you might already have a USB stick lying around, right? I would recommend to having FAST one with at least 64GB and USB3, because we gonna put a lot of stuff on it. Here are some options with good price point (affiliate links):\n Small and fast USB Stick with a good price point, fits anywhere because of its small form-factor\n Instead of a stick&amp;mldr Booted anywhere I tried - so a good option to have a USB stick with upgradable storage\n    Note: The  VentoyUSB stick will neither work for a MacOS installation nor Non-x86/x64 architecture - but these are the only restrictions, I’m aware of.\n   Run the  installer, format the drive and let it finish (tip: choose either  NTFS or  extFat, read further to learn why)\n   If you want to upgrade the ventoy version (e.g. to support more images), it is the same procedure as installing. Just run the installer and upgrade. The operation is stated as safe, your data partition will not be changed, but I still would recommend to backup your files, just in case something goes wrong\n  So here the best part: Instead of always having to flash the whole USB stick, you can just\n  anywhere you want to - done!  Ventoywill scan the whole data partition as you boot from USB and auto-generate a menu item for every supported OS image. Directories do not change the menu structure and will be flattened out.\n  Don’t use the Stick as data drive - extra files slow down the menu generation\n Best use  NTFS for compatibility reasons (or  extFAT if you can’t use  NTFS) - see  https://www.ventoy.net/en/doc_disk_layout.html\n  You can also put non-installer / non-bootable images onto the data partition (like RaspiOS or other embedded stuff) to keep everything in one place\n  Since this guide would not be much of an innovation but just showing off  Ventoy, here is a list of OS images that I recommend for daily use cases like system recovery, formatting drives and booting of USB inside VM if required.\n Windows 10 PE live CD with a lot of useful tools for backup and recovery\n    Helps you to boot into any Operating System even if you cannot boot into it by normal means.\n  A Linux system rescue toolkit available for administrating or repairing your system and data after a crash", "posttime": "2022-02-14 11:45:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "usb,boot,ventoy", "title": "唯一也是最后一个USB启动棒", "title_en": "The one and only last USB boot stick", "transed": 1, "url": "https://pilabor.com/blog/2022/01/the-ultimate-boot-stick/", "via": "", "real_tags": ["usb", "boot", "ventoy"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073029, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英特尔&#39；Xeon的下一个主要版本Linux 5.18将正式支持为Xeon CPU添加功能的神秘软件定义硅（SDSi）机制。SDSi允许用户在&#39；我已经买了。正式的SDSi支持意味着这项技术将进入英特尔&#39；s Xeon处理器即将发布，这意味着Sapphire Rapids将成为第一个使用SDSi的CPU。\n去年9月，英特尔开始推出Linux补丁，以在操作系统中启用其SDSi功能。到目前为止，已经发布了几套补丁，看起来它们将被添加到定于今年春天发布的Linux 5.18中。据Phoronix报道，长期从事Linux开发工作的Hans de Goede在Red Hat从事大量与硬件支持相关的项目，他声称如果没有问题出现，SDSi将在Linux 5.18中实现。\n&#34;假设没有发现重大问题，我们的计划肯定是在5.18合并窗口&34；德戈德说。\n英特尔软件定义硅（SDSi）是一种机制，用于激活已使用该软件生产和部署的服务器CPU中的其他硅功能。虽然Linux 5.18将正式支持该功能，并将于今年春天推出，但英特尔尚未&#39；t透露了它使用现收现付CPU升级模式的具体计划。我们没有&#39；我不知道它是如何工作的，它能带来什么，但我们可以做出一些有根据的猜测。\n每一代Intel Xeon CPU都增加了多种功能，使Intel&#39；s服务器平台更加通用。例如，除了微体系结构的改进和新指令，英特尔&#39；s Xeon可扩展CPU（各代）增加了对每个插槽最多4.5TB内存的支持、网络功能虚拟化、速度选择技术和大型SGX enclave大小，仅举几例。此外，还有针对搜索、虚拟机密度、基础设施即服务（IaaS）、软件即服务（SaaS）、液体冷却、媒体处理等的优化模型。第四代Xeon可扩展&#39；Sapphire Rapids和#39；英特尔计划在CPU上添加更多针对特定使用情况的专用功能。您可以看到上面的SKU堆栈示例，它包括所有类型的不同Xeon型号：\n但几乎没有英特尔&#39；s的客户需要所有受支持的功能，这就是为什么英特尔必须提供专用型号。例如，Xeon可扩展的第三代产品阵容中有57个SKU。但从硅的角度来看，所有英特尔&#39；s Xeon可伸缩CPU在内核数量和时钟/TDP方面基本相同，只是为了创建不同的型号而禁用了各种功能。\n英特尔当然通过提供工作负载优化的SKU来赚取溢价，但禁用某些型号的某些功能，然后对其进行适当标记，并将其与其他SKU（运送到同一客户机）分开运送是昂贵的——每年可能会增加数千万美元（甚至更多）的物流成本，更不用说为庞大的产品阵容增添的混乱了。\n但是，如果英特尔只提供基本型号的Xeon可扩展CPU，然后允许客户购买他们需要的额外功能，并通过软件更新启用这些功能，那会怎么样？这就是SDSi使英特尔能够做到的。其他用例包括在需要时对某些功能进行文字升级和/或重新调整现有机器的用途。例如，如果数据中心需要在时钟和TDP方面重新配置CPU，它将能够在不更改服务器或CPU的情况下购买该功能。\n英特尔还必须披露SDSi的所有特性及其关于该机制的具体计划，但目前，我们非常确定这项技术很快就会出现。\n英特尔复制EA的商业模式：制作完整的产品，然后剥离其功能单独销售。与其以1000美元的价格出售一个完整的处理器，不如以1000美元的价格出售一个残废的处理器，然后要求100美元重新启用每个功能。我知道&#39；这是资本主义和市场规则等等，但在我看来，这听起来像是不诚实的钱（EA客户对此表示同意）。希望这能给AMD带来更多销量。\n回复\n另一种降低物流成本的方法是，消除愚蠢的超精细的任意市场细分，这种方法可以降低每台CPU 10亿个变种的市场营销成本，这些变种具有极其细微的任意差异。制造功能齐全的全尺寸CPU只是为了禁用它们的大部分功能，并将它们作为硬件数据链路连接器出售/租赁回来，这听起来很愚蠢。\n回复\n我记得英特尔在过去——大约十年前——尝试过这个方法，但它没有&#39；不行。软件定义的升级/解锁造成了混乱，没有&#39；我不总是能正常工作。希望这项最新的努力也会失败。英特尔真的需要简化过于细分的CPU阵容。\n回复\n是的。制作2-3个模具，以经济高效地为主要服务器层提供服务，每个模具可能有2-3个箱子，每个箱子由最有可能出现缺陷的地方决定。销售DLC CPU需要销售的每个DLC驱动的CPU都是一个黄金样本，或者至少能够满足该细分市场的最高规格。不&#39；除非英特尔#39；不包括致命缺陷和边缘损失的s产量接近100%，可以直接冲销低于标准的模具，这意味着整个i5-i9系列是一场制造闹剧。\n回复\n英特尔只是没有&#39；我学不会。他们真的错过了一个机会。你可以&#39；不要只让客户为他们想要添加的功能付费。你必须把它变成一个“战利品箱”式的体验，顾客为一个随机的功能付费，并希望得到他们想要的东西。如果没有，他们会继续购买更多，直到他们得到想要的。然后英特尔可以建立一个在线商店，用户可以在那里转售他们不具备的功能；我不想和其他英特尔用户聊天。通过这种方式，你可以让人们无休止地购买CPU升级，试图赢得备受追捧的功能，他们可以在网上商店以更高的价格出售。\n回复\n因此，如果这些功能已经到位，那么它们就不再需要对不起作用的东西或每个SKU起作用的东西进行装箱了。所以基本上英特尔是说，我们可以一直在一个入门级芯片上为您提供所有这些功能。相反，为了节省我们的麻烦，并在为任意功能收取更多费用时保持利润，我们将时间和资源投入英特尔芯片市场。现在，当它与安全漏洞有关，他们必须开始禁用产品，或者有人破解它以启用所有功能时，它就会崩溃。\n回复\n我认为现在情况更糟了：例如，作为服务器所有者的客户有1000个Xeon和200个ePyc。现在他需要启用这一功能，因为他有一项新服务&#39；我会提供的。他必须联系英特尔，支付1000个新功能许可证，升级500台机器（可能是双插槽），并通过验证测试，以确保一切正常。他也完全不需要在EPYC上做任何事情，因为他们已经说过启用了功能。他们真的认为&#39；怎样才能赚更多的钱？短期内，当然，但这个客户&#39；美国下一步购买的可能是EPYC，它的成本更低（确实如此），更节能（确实如此），从长远来看，现在成本更低。我&#39；d表示，将旧系统换成新的EPYC，而不是花钱进行功能升级，可能会更便宜。\n回复\n他也完全不需要在EPYC上做任何事情，因为他们已经说过启用了功能。\n如果你得到的CPU数据链路是一个核心计数升级，那么你从基于EPYC的系统中得到这一点的唯一方法是物理CPU交换，这是一个更为劳动密集的过程，并且需要更广泛的重新验证，因为你有一个完全不同的芯片，而不是同样的芯片，但仍然需要支付更少的费用。\n回复\n特斯拉展示了这种商业模式（为一件带有你必须多付才能使用的功能的东西付费），这将是未来的悲哀。。。\n回复\n显示更多评论", "note_en": "Intel&#39;s mysterious  Software Defined Silicon (SDSi) mechanism for adding features to Xeon CPUs will be officially supported in Linux 5.18, the next major release of the operating system. SDSi allows users to add features to their CPU after they&#39;ve already purchased it. Formal SDSi support means that the technology is coming to Intel&#39;s Xeon processors that will be released rather shortly, implying Sapphire Rapids will be the first CPUs with SDSi.\n  Intel started to roll out Linux patches to enable its SDSi functionality in the OS last September. By now, several sets of patches have been released and it looks like they will be added to Linux 5.18, which is due this Spring. Hans de Goede, a long-time Linux developer who works at Red Hat on a wide array of hardware enablement related projects, claims that SDSi will land in Linux 5.18 if no problems emerge, reports  Phoronix.\n  &#34;Assuming no major issues are found, the plan definitely is to get this in before the 5.18 merge window,&#34;  said de Goede.\n   Intel Software Defined Silicon (SDSi) is a mechanism for activating additional silicon features in already produced and deployed server CPUs using the software. While formal support for the functionality is coming to Linux 5.18 and is set to be available this spring, Intel hasn&#39;t disclosed what exactly it plans to enable using its pay-as-you-go CPU upgrade model. We don&#39;t know how it works and what it enables, but we can make some educated guesses.\n  Every generation of Intel Xeon CPUs adds multiple capabilities to make Intel&#39;s server platform more versatile. For example, in addition to microarchitectural improvements and new instructions,  Intel&#39;s Xeon Scalable CPUs (of various generations) added support for up to 4.5TB of memory per socket, network function virtualization,  Speed Select technology, and large SGX enclave size, just to name a few. In addition, there are  optimized models for search, virtual machine density, infrastructure as a service (IaaS), software as a service (SaaS), liquid cooling, media processing, and so on. With its 4th Generation Xeon Scalable &#39;Sapphire Rapids&#39; CPUs, Intel plans to add even more features specialized for particular use cases. You can see an example of the SKU stack above, and it includes all types of different Xeon models:\n   But virtually none of Intel&#39;s customers need  all the supported features, which is why Intel has to offer specialized models. There are 57 SKUs in the Xeon Scalable 3rd-Gen lineup, for example. But from a silicon point of view, all of Intel&#39;s Xeon Scalable CPUs are essentially the same in terms of the number of cores and clocks/TDP, with various functionalities merely disabled to create different models.\n Intel certainly earns premium by offering workload optimized SKUs, but disabling certain features from certain models, then marking them appropriately and shipping them separately from other SKUs (shipped to the same client) is expensive — it can be tens of millions of dollars per year (or even more) of added logistical costs, not to mention the confusion added to the expansive product stack.\n But what if Intel only offers base models of its Xeon Scalable CPUs and then allows customers to buy the extra features they need and enable them by using a software update? This is what SDSi enables Intel to do. Other use cases include literal upgrades of certain features as they become needed and/or repurposing existing machines. For example, if a data center needs to reconfigure CPUs in terms of clocks and TDPs, it would be able to buy that capability without changing servers or CPUs.\n Intel yet has to disclose all the peculiarities of SDSi and its exact plans about the mechanism, but at this point, we are pretty certain that the technology will show up soon.\n      Intel copying the EA business model: make a full product, then strip its features to sell separately. Instead of selling one full processor for $1000, sell one crippled processor for $1000, then demand $100 for re-enabling each feature. I know that&#39;s capitalism and market rules and all, but it sounds like dishonest money to me (EA customers agree on that). Hopefully that gives more sales to AMD.\n   Reply\n The other way to reduce the logistics costs of marketing a billion variants of each CPU with razor-thin arbitrary differentiations would be get rid of the stupidly super-fine arbitrary market segmentation.  Making fully functional full-size CPUs only to disable most of their capabilities and sell/lease them back as hardware DLCs sounds stupid.\n   Reply\n I recall that Intel tried this in the past -- about a decade ago -- and it didn&#39;t work out. The software-defined upgrades/unlocks caused confusion and didn&#39;t always work properly. Hopefully this latest effort crashes and burns too. Intel really needs to simplify their overly segmented CPU lineup.\n   Reply\n Yup. Make 2-3 dies to cost-effectively service the major server tiers and maybe have 2-3 bins each dictated by where defects are most likely to land.  Selling DLC CPUs would require that every DLC-powered CPU sold to cover a given market segment range be a golden sample or at least capable of the highest specs for the market segment. Doesn&#39;t sound cost-effective unless Intel&#39;s yields excluding fatal defects and edge losses are close enough to 100% that it can just write off sub-par dies, which would imply that the entire i5-i9 range is a manufactured farce.\n   Reply\n Intel just doesn&#39;t learn. They are really missing an opportunity here. You can&#39;t just let customers pay for the features they want to add. You have to turn it into a loot box type experience where customers pay for a random feature and hope to get what they want. If not, they keep buying more until they do get what they want. Then Intel can setup an online shop where users can resell the features they don&#39;t want to other Intel users. That way you get people endlessly buying CPU upgrades in an attempt to win highly sought after features that they can sell for more at the online shop.\n   Reply\n So if the features are already in place then they are past binning for things not to work or work per SKU. So basically Intel is saying we could have been give you all these features in an entry level chip all along. Instead to save us hassle and maintain margins when charging more for arbitrary features we instead invested time and resources in to the Intel Chip Marketplace. Now comes the crash and burn of this when it’s linked to security exploits and they have to start disabling offerings or someone just cracks it to enable all features.\n   Reply\n  I though of it even worse now: customer, who is a server owner, has 1000 Xeons and 200 EPYCs, for example. Now he needs this one feature enabled, because of a new service he&#39;ll provide. He has to contact Intel, pay 1000 new feature licenses, upgrade 500 machines (dual-socket, maybe), and pass validation tests to see everything is working. He also needs to do absolutely nothing on the EPYCs, since they already have said feature enabled.  Do they really think that&#39;s the way to earn more money? In the short term, sure, but this customer&#39;s next purchases will probably be EPYCs, which cost less (they do), are more energy efficient (they are), and now cost less in the long run. I&#39;d say it could be cheaper still to change older systems to new EPYCs instead of spending money on feature upgrades.\n   Reply\n He also needs to do absolutely nothing on the EPYCs, since they already have said feature enabled.\nIf he CPU DLC you got is a core count upgrade, the only way you are getting that out of EPYC-based systems is a physical CPU swap which is far more labor-intensive and will require even more extensive re-validation since you have a whole different chip instead of the same chip with fewer things still pay-walled.\n   Reply\n Tesla showed this business model (paying for a thign with features you have to pay more for to use) and it will be future sadly...\n   Reply\n Show more comments", "posttime": "2022-02-14 11:39:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "英特尔,发布,现收,pay,cpu", "title": "英特尔的现收现付CPU功能进入发布窗口", "title_en": "Intel's Pay-as-You-Go CPU Feature Gets Launch Window", "transed": 1, "url": "https://www.tomshardware.com/uk/news/intel-software-defined-cpu-support-coming-to-linux-518", "via": "", "real_tags": ["英特尔", "发布", "现收", "pay", "cpu"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073028, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你从Verge link购买东西，Vox Media可能会获得佣金。参见我们的道德声明。\n谷歌上个月宣布，计划在5月1日之前让免费的“遗留”G套件账户支付订阅费用。这一举动让许多一直在自定义域中使用该服务的G套件用户感到惊讶，现在，微软正试图吸引G套件用户支付微软365的费用，而不是提供60%的折扣。\n微软365负责人贾里德·斯帕塔罗（Jared Spataro）表示：“如果你是一家依赖于G Suite legacy free edition的小企业，我们会情不自禁地注意到，你可能正在寻找一种新的解决方案。”。“我们有消息告诉您：今天，您可以在为期12个月的Microsoft 365 Business Basic、Business Standard或Business Premium订阅中获得60%的折扣，以及采取行动所需的帮助。”\n该厚颜无耻的服务可在微软网站上获得，包括对自定义域、微软团队访问、Office应用程序和OneDrive云存储的支持。微软还将为微软355提供为期一年的业务协助，帮助企业更轻松地迁移到微软365。此优惠仅适用于在2022年8月2日之前购买12个月Microsoft 365订阅的G Suite legacy free edition用户。\n不过，一些G套件遗留用户可能希望等待谷歌的新解决方案。在遭到强烈反对后，谷歌表示，它计划“为您提供一个选项，将非谷歌工作区付费内容和大部分数据转移到免费选项。”我们仍在等待谷歌的详细信息，但听起来G Suite遗留用户将能够过渡到免费的Gmail帐户，而无需定制电子邮件域或多帐户管理等高级功能。\n对于那些在YouTube频道上依赖免费G套件账户或使用该账户购买Google Play的人来说，这有望解决一些令人头疼的问题。对于在自定义域上使用免费G套件选项的家庭或企业电子邮件帐户的其他人来说，唯一的选择似乎是开始支付或转移到竞争对手（如Microsoft 365）那里。", "note_en": "If you buy something from a Verge link, Vox Media may earn a commission. See our  ethics statement.\n Google announced last month that it plans to make free “legacy” G Suite accounts  pay for a subscription by May 1st. The move surprised a bunch of G Suite users that have been using the service with custom domains, and now, Microsoft is trying to entice G Suite users to pay for Microsoft 365 instead with a 60 percent discount offer.\n “If you’re a small business that’s relied on G Suite legacy free edition, we couldn’t help but notice you might be in the market for a new solution,”  says Jared Spataro, head of Microsoft 365. “We’ve got news for you: today, you can get a 60 percent discount on a 12-month Microsoft 365 Business Basic, Business Standard, or Business Premium subscription, along with the help you need to make the move.”\n  The cheeky offer is  available on Microsoft’s website and includes support for custom domains, Microsoft Teams access, Office apps, and OneDrive cloud storage. Microsoft is also including a year of  Business Assist for Microsoft 355, which helps businesses migrate to Microsoft 365 more easily. The offer is exclusive to G Suite legacy free edition users who purchase a 12-month Microsoft 365 subscription by August 2nd, 2022.\n Some G Suite legacy users might want to wait on a new solution from Google, though. After a backlash,  Google says it plans to “provide an option for you to move your non-Google Workspace paid content and most of your data to a no-cost option.” We’re still waiting on full details from Google, but it sounds like G Suite legacy users will be able to transition to a free Gmail account without premium features like custom email domains or multi-account management.\n This should hopefully solve some headaches for people who have relied on their free G Suite accounts for their YouTube channels or who have used the account for Google Play purchases. For others who used the free G Suite option for family or business email accounts on a custom domain, it looks like the only option is to start paying or move to competitors like Microsoft 365.", "posttime": "2022-02-14 11:38:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,微软,谷歌,google,遗留", "title": "微软向谷歌“遗留”G套件客户提供60%的折扣", "title_en": "Microsoft offers 60 percent discount to Google ‘legacy’ G Suite customers", "transed": 1, "url": "https://www.theverge.com/2022/2/10/22927587/microsoft-365-discount-offer-google-g-suite-legacy-customers", "via": "", "real_tags": ["microsoft", "微软", "谷歌", "google", "遗留"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073027, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近的发展使我们有可能跳过OpenShift运行时的运行，并在使用macOS或Windows时将其用于运行带有podman的容器的唯一目的。本次演讲将重点讨论CodeReady容器的一个特定部分，即基于gVisor的userland TCP/IP堆栈。我们将探讨为什么需要这样做，以及容器如何-&gt；VM-&gt；实现了主机连接。", "note_en": "Recent developments have made it possible to skip running the OpenShift runtime, and to use it for the sole purpose of running containers with podman when using macOS or Windows. This talk will focus on one specific part of CodeReady Containers, which is its userland TCP/IP stack based on gVisor. We will explore why this was needed, and how the container -&gt; VM -&gt; host connectivity is achieved.", "posttime": "2022-02-14 11:37:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "连接,tcp,运行", "title": "用于外部容器连接的Userland TCP/IP堆栈", "title_en": "Userland TCP/IP stack for external container connectivity", "transed": 1, "url": "https://fosdem.org/2022/schedule/event/container_userlan_tcpip/", "via": "", "real_tags": ["连接", "tcp", "运行"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073026, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "城市流行的mod：Skylines的创建者将恶意代码捆绑在一起，据报道，他们使用自动更新程序向用户感染特洛伊木马，并影响特定目标的modders同伴和开发者巨量订单员工的性能。\n在2021，一个以混乱的名字命名的MODED启动了一个被称为“和谐”的MOD“重新设计”的版本，这是一个重要的框架项目，大多数城市MODS：天际线依赖于功能。\n随后，Chaos还“重新设计”了游戏中几种流行的MOD，并将其修改后的Harmony版本列为核心下载版本——这意味着玩家必须去下载，才能让任何依赖的MOD正常工作。\n然而，人们发现，这个版本的Harmony中隐藏了一个自动更新程序，这将允许Chaos向下载它的任何人的设备发送恶意软件。其他恶意代码被用来削弱其他MOD的性能，这反过来导致玩家下载更多的混沌MOD，因为它们被宣传为这些问题的解决方案。这是在一些受影响的修改者发现恶意代码时发现的，他们在收到来自粉丝的性能缓慢的报告后发现了恶意代码。\n“[混乱]分叉了另一个流行的mod，并将他们版本的Harmony设置为一个依赖项。然后，他们在这个mod中添加了虚假的错误消息，如果你使用原始的Harmony，就会触发错误消息，诱使用户使用他们的版本。然后，他们实施了一个访问控制列表，阻止某些Steam ID使用他们的MOD或询问他们的任何代码。\"\n我们的消息来源说，“从本质上说，他制造了一个恶性循环。”由于过去曾成为混乱的目标，他选择匿名。\n“用户安装Harmony（重新设计）是因为一个特殊的原因，突然他们在流行的MOD中出现错误。提供的解决方案是使用他的版本。这些版本获得了吸引力和用户，人们看到的是Harmony（重新设计）而不是原始版本…并将Harmony（重新设计）标记为依赖项。用户安装Harmony（重新设计）时使用[自动更新代码]与之捆绑。突然间，成千上万的用户在他们的计算机上安装了特洛伊木马。\"\n“然后，只要在GitHub上发布更新的代码，Chaos就可以远程向用户部署他选择的任何代码。Steam、GitHub或任何第三方都不会验证。这是从Chaos的大脑到用户计算机的直接链接。如果用户以[an]的身份运行游戏无论出于何种原因，这都可能让他们暴露于键盘记录者、病毒、比特币挖掘软件——几乎任何东西。\"\n单独的恶意代码还根据一个列表检查了用户的SteamID，该列表包括修改者、社区成员，甚至是该游戏开发者巨无霸的雇员的帐户。如果检测到此列表中的某个人，该代码会阻止用户调查国防部的代码，并会削弱用户的性能。\nValve已经删除了几个输入自动更新程序的Mod，并禁止了modder的最新帐户，该帐户名为Holy Water。最初的账户“混沌”此前因与社区其他成员打交道而被禁止。然而，到目前为止，Chaos的mods下载量约为35000次，实际下载量可能更高。\n“已经实施的技术可以让他对一堆机器进行加密锁定，创建一个僵尸网络（以及DDoS攻击他的敌人？）或者我的加密货币，”我们的消息来源补充道。\n尽管Valve已经禁止了Chaos的两个账户，但有人担心他会再次传播更多恶意软件——特别是因为Steam workshop规则中的漏洞将允许他继续从另一个账户使用他的mods，即使现有账户仍然被禁止。\n现在，合法的改造者正在进行一场“大规模教育运动”，以提高城市：天际线社区对正在发生的事情的认识，希望他们能够减少未来任何伤害降临社区的机会。\n我们已经联系了Valve，如果得到回复，我们会更新这个故事。\n微软总裁布拉德·史密斯（Brad Smith）表示，在收购Activision后，Activision的员工将受到“审查”。", "note_en": "Popular mods for   Cities: Skylines have been bundled with malicious code by their creator, who reportedly used an automatic updater to infect users with a trojan horse and affected performance for specifically targeted fellow modders and developer Colossal Order employees.\n  In 2021, a modder going by the name of Chaos launched a “redesigned” version of a mod called Harmony, a vital framework project that most mods in  Cities: Skylines rely upon to function.\n  Chaos also then “redesigned” several popular mods for the game, and listed his modified version of Harmony as a core download – meaning that players would have to go and download it for any dependent mods to work.\n However, it’s been discovered that an automatic updater was buried in this version of Harmony, which would allow Chaos to deliver malware to the devices of anyone that downloaded it. Other malicious code was used to cripple the performance of other mods, which in turn caused players to download more of Chaos’ mods as they were advertised as solutions to these issues. This was discovered when some of the affected modders who, after receiving reports of slow performance from fans, found the malicious code.\n    “[Chaos] forked another popular mod, and set their version of Harmony as a dependency. They then added fake error messages into this mod which would fire if you used the original Harmony, enticing users to their version. Then they implemented an access control list that would block certain Steam IDs from using their mods or interrogating any of their code.”\n Our source, who has chosen to remain anonymous due to being targeted by Chaos in the past, says that “in essence he’s created a vicious cycle.\n  “Users install Harmony (redesigned) for a particular reason, suddenly they get errors in popular mods. The solution provided is to use his versions. Those versions gain traction and users, and people come across them instead of the originals… and see Harmony (redesigned) marked as a dependency. Users install Harmony (redesigned) with the [automatic updating code] bundled with it. Suddenly you have tens of thousands of users who have effectively installed a trojan on their computer.”\n  “Chaos can then remotely deploy any code he chooses to users simply by releasing updated code on his GitHub. There is no validation by Steam, GitHub, or any third party. It’s a direct link from Chaos’ brain to users’ computers. If users run the game as [an] administrator for any reason, this could expose them to keyloggers, viruses, bitcoin mining software – literally anything.”\n Separate malicious code also checked users’ SteamID against a list that included the accounts of modders, community members and even employees of Colossal Order, the game’s developer. If someone on this list was detected, the code blocked the user from investigating the mod’s code and would also cripple the users performance.\n Valve has removed several of the mods that feed into the automatic updater, and banned the latest account of the modder, which went by the name Holy Water. The original account – Chaos – was previously banned for doxxing other members of the community. However, by this point there were around 35,000 downloads for Chaos’ mods – and it’s likely that the real number is even higher.\n “What’s been implemented would let him cryptolock a bunch of machines, create a botnet (and DDoS his enemies?) or mine cryptocurrency,” added our source.\n  Though both of Chaos’ accounts have been banned by Valve, there’s a concern that he will return to spread more malware – especially because a loophole in the  Steam workshop rules would allow him to continue working on his mods from another account even if the existing accounts remain banned.\n Right now, legitimate modders are undergoing a “massive education campaign” to raise the  Cities: Skylines‘ communities awareness of what’s going on, in the hopes that they can reduce the chance of any future harm befalling their community.\n We’ve reached out to Valve, and will update this story if we get a response.\n  In other news,  Activision staff will be “under scrutiny” following its acquisition, says  Microsoft president Brad Smith.", "posttime": "2022-02-14 11:34:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "skylines", "title": "城市：Skylines modder因恶意行为被禁止", "title_en": "Cities: Skylines modder banned for malicious behavior", "transed": 1, "url": "https://www.nme.com/news/gaming-news/valve-bans-cities-skylines-modder-after-discovery-of-major-malware-risk-3159709", "via": "", "real_tags": ["skylines"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073025, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大约一年前，Async Working Group 1开始合作编写一份共享的Async vision文档。在我们进入2022年之际，我们希望提供这一过程的最新结果，以及我们在实现这一愿景方面取得的进展。\n要设置场景，请想象一下&#39；s Rust 2024，而你&#39；我决定在Rust建造你的第一个项目。你&#39；我们正在做一个使用GitHub的项目，而你&#39；I’我想要一个工具，它可以遍历存储库中的所有问题，并进行一些自动分类。您决定为此使用async Rust。你拿出锈迹斑斑的书，用拇指指向异步I/O部分。在这里，它向您展示了异步应用程序的基本结构。和任何Rust程序一样，它从main开始，但这次是异步fn。。。\n翻到板条箱上。io，你搜索&#34；github和#34；并发现有一个漂亮的板条箱螃蟹猫导航github的问题。你导入它，然后坐下来工作。您需要做的第一件事是反复讨论所有问题：\nasync fn main（）{用于crabbycat:：issues（&#34；https://github.com/rust-lang/rust&#34;) {如果符合(发布){println！（&#34；{发布：？}&#34;); } }}\n你的板条箱似乎工作得很好，你很高兴地发推特。很快，你发现自己和一些用户在一起，其中一个用户打开了一个PR，将其扩展到支持GitLab。为了做到这一点，它们引入了一种特性，允许您编写针对问题提供程序的通用代码。这个特性有一个方法，它返回一个迭代器（在本例中是一个异步迭代器）：\ntrait IssueProvider{async fn issues（&amp；mut self，url:&amp；str）->impl asyncierator&lt；Item=Result&lt；Issue，Err&gt；}#[派生（调试）]结构问题{number:usize，header:String，assignment:String，}\n现在，他们能够将主循环重构为一个在IssueProvider上通用的函数。他们决定使用dyn性状来避免多次单形性。\nfn流程问题（提供者：&amp；mut-dyn IssueProvider）{for await？提供者中的问题。问题（&34；https://github.com/rust-lang/rust&#34;) {如果符合(发布){println！（&#34；{发布：？}&#34;); } }}\n你在公关上很开心地点击了merge，一切都很好。后来，有人想把你的系统移植到Chartreuse操作系统上运行。Chartreuse基于一个actor模型，并使用自己的自定义异步运行时——但幸运的是，您没有&#39；我不在乎。所有代码都能够无缝地将底层运行时实现切换到Chartreuse异步运行时。\n当然，这一年仍然是2022年，我们刚刚描绘的愿景不是现实——至少现在还不是。在RFCing和实现特性方面，还有很多工作要做，这些特性将让我们编写我们所讨论的代码：\n采取一个&amp；mut dyn IssueProvider参数要求在具有异步函数的traits中支持动态调度\n用于等待的代码？循环，允许在异步代码中通过迭代器轻松迭代。\n标准库（流）中异步迭代的特征具有不同的名称，并且不稳定；一旦我们在traits中强烈支持异步fns，它的定义也可能会改变。\n随着这项工作的进行，我们可以预期在过程中的细节会有很多变化，我们可能会决定一些细节不是&#39；不值得；如果没有其他问题的话，生成器的语法是一个备受争议的话题。什么赢了&#39；t change是总体愿景：除了偶尔使用async和await关键字之外，编写异步代码应该和编写同步代码一样简单。\n我们&#39；我们将异步工作组组织成了许多不同的计划，每个计划都在追求愿景的一部分。以下是当前活跃群体的列表，以及他们&#39；自从他们开始运营以来，我已经在过去的几个月里做了很多。\n我们还在traits RFC中实现了静态异步fn，并为return position impl trait起草了一份RFC（在准备好着陆之前，它还需要一些调整）。\n我们&#39；我一直在为动态调度设计，最近的一次迭代在这篇博客文章中进行了描述。\n我们&#39；我也一直在努力，比如tmandry在博客上提到的关于上下文和功能的建议。\nEstebank为生成器制作了一个程序宏原型，并呼吁大家讨论语法和其他细节。\n由nrc领导，探索如何使代码易于跨运行时移植，从AsyncRead和AsyncWrite之类的标准化特性开始。\n由eholk领导，专注于通过较小的变化来改善现有能力，这些变化共同带来了巨大的变化。\n我们&#39；我们有一个待定的PR，它将改进生成器#39；当变量移动到屈服点之前时，进行捕获分析，以及另一个PR，它收紧了临时范围，以进一步避免不必要的生成器捕获。\n古斯·韦恩（Gus Wynn）在“必须”而不是“暂停”皮棉（suspend lint）方面取得了重大进展，这种皮棉可以捕捉到值在不应该存在的等待点上存在的情况。\n我们开始研究如何使异步堆栈跟踪更具可读性和帮助性。\n由pnkfelix领导，致力于支持异步生态系统中的人员，他们正在构建有趣的工具来支持异步生态系统。\nMichael Woerister正在探索异步崩溃转储恢复，提供了一种机制来恢复和检查基于崩溃转储的异步生锈程序的状态。\n伊丽莎·魏斯曼和其他许多人最近宣布了他们0.1版的东京控制台。Tokio Console是一种用于异步程序的诊断和调试工具。它可以让您实时查看异步运行时的状态，还可以在检测到可能表明存在错误或性能问题的可疑行为时发出警告。\n你可以在我们的路线图页面上找到我们计划的整套工作，该页面还链接到我们&#39；我们正在努力。\n如果你&#39；如果你对帮助感兴趣，一个好的开始是波兰倡议页面的“如何帮助”部分。还有一个每周波兰分诊会议，你可能想参加。\n我们过去被称为异步基金会工作组，或wg Async Foundation。wg async更容易输入。工作组的重点是&#34；基金会和#34；异步的，即语言和标准库，没有&#39；没有改变。↩", "note_en": "Almost a year ago, the Async Working Group  1  embarked on a collaborative effort to write a  shared async vision document. As we enter 2022, we wanted to give an update on the results from that process along with the progress we are making towards realizing that vision.\n  To set the scene, imagine it&#39;s Rust 2024, and you&#39;ve decided to build your first project in Rust. You&#39;re working on a project that uses GitHub and you&#39;d like a tool that will walk over all the issues on your repository and do some automatic triage. You decide to use async Rust for this. You pull out the Rust book and thumb over to the Async I/O section. In there, it shows you the basic structure of an async Rust application. Like any Rust program, it begins with  main, but this time with an  async fn...\n  Thumbing over to crates.io, you search for &#34;github&#34; and find that there is a nifty crate  crabbycat for navigating github issues. You import it and sit down to work. The first thing you need to do is to to iterate over all the issues:\n async fn main() { for await? issue in crabbycat::issues(&#34;https://github.com/rust-lang/rust&#34;) { if meets_criteria(&amp;issue) { println!(&#34;{issue:?}&#34;); } }}\n Your crate seems to be working well and you happily tweet about it. Soon enough you find yourself with some users and one of them opens a PR to extend it to to support GitLab. To do this, they introduce a trait that allows you to write code that is generic over the issue provider. This trait has one method,  issues which returns an iterator (in this case, an async iterator):\n trait IssueProvider { async fn issues(&amp;mut self, url: &amp;str) -&gt; impl AsyncIterator&lt;Item = Result&lt;Issue, Err&gt;&gt;;}#[derive(Debug)]struct Issue { number: usize, header: String, assignee: String,}\n Now they are able to refactor the main loop into a function that is generic over the  IssueProvider. They decide to use a  dyn trait to avoid monomorphizing many times.\n fn process_issues(provider: &amp;mut dyn IssueProvider) { for await? issue in provider.issues(&#34;https://github.com/rust-lang/rust&#34;) { if meets_criteria(&amp;issue) { println!(&#34;{issue:?}&#34;); } }}\n You happily hit merge on the PR and everything works great. Later on, somebody wants to port your system to run on the Chartreuse operating system. Chartreuse is based on an actor model and uses its own custom async runtime -- but luckily for you, you don&#39;t care. All your code is seamlessly able to switch the underlying runtime implementation over to the Chartreuse async runtime.\n  Of course, the year is still 2022, and the vision we just painted is not reality -- at least not yet. There is a lot of work to do yet in terms of RFCing and implementing the features that will let us write the code we talked about:\n Taking an  &amp;mut dyn IssueProvider argument requires supporting dynamic dispatch in traits that have async functions\n The code used a  for await? loop, which permitted easy iteration over iterators in async code.\n The trait for async iteration in the standard library ( Stream) has a different name and is not stabilized; its definition is likely to change, too, once we have strong support for async fns in traits.\n As this work proceeds we can expect plenty of changes in the details along the way, and we might decide some pieces aren&#39;t worth it; if nothing else, the syntax for generators is a hotly contested topic.  What won&#39;t change is the the overall vision: that writing async Rust code should be as easy as writing sync code, apart from the occasional  async and  await keyword.\n  We&#39;ve organized the Async working group into a number of distinct initiatives, each of which is pursuing one part of the vision. What follows is a list of the currently active groups and some of the things they&#39;ve done over the last few months since they got up and running.\n   We have also landed the  static async fn in traits RFC and  drafted an RFC for return position impl trait (which still needs a few tweaks before it&#39;s ready to land).\n We&#39;ve been working on a design for dynamic dispatch, the most recent iteration of which is described in  this blog post.\n We&#39;ve also been spinning off efforts, such as the proposal for  context and capabilities that tmandry blogged about.\n   Estebank has  prototyped a procedural macro for generators and put out a call for discussion about the syntax and other details.\n  Led by  nrc, exploring what it takes to make code easily portable across runtimes, beginning with standardized traits for things like  AsyncRead and  AsyncWrite.\n   Led by  eholk, focused on improving the existing capabilities via smaller changes that collectively make a big difference.\n We&#39;ve got a  pending PR that will improve the generator&#39;s capture analysis when variables are moved before a yield point, as well as  another PR that tightens temporary scopes to further avoid unnecessary generator captures.\n Gus Wynn made significant progress towards a   must_not_suspend lint that catches cases where values are live across an await point that should not be.\n We are starting to look at ways to make  async stack traces more readable and helpful.\n  Led by  pnkfelix, working to support folks in the async ecosystem who are building interesting tooling to support async Rust others.\n Michael Woerister is exploring  async crashdump recovery, offering a mechanism to recover and inspect the state of an async Rust program based on a crashdump.\n Eliza Weisman and  many others recently  announced their 0.1 release of  tokio console. Tokio Console is a diagnostics and debugging tool for asynchronous Rust programs. It gives you a live view onto the state of the async runtime, and can also signal warnings when it detects suspicious behavior that might indicate a bug or performance problem.\n You can find the complete set of work that we have planned on our  roadmap page, which also links to various deliverables we&#39;re working toward.\n  If you&#39;re interested in helping out, a good place to start is the  How to help section of the polish initiative page. There is also a weekly  polish triage meeting which you may want to attend.\n We used to be called the Async Foundations Working Group, or wg-async-foundations. wg-async is much easier to type. The  focus of the working group being on the &#34;foundations&#34; of async, namely the language and standard library, hasn&#39;t changed.  ↩", "posttime": "2022-02-14 11:29:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,生锈,async", "title": "2022年的异步生锈", "title_en": "Async Rust in 2022", "transed": 1, "url": "https://blog.rust-lang.org/inside-rust/2022/02/03/async-in-2022.html", "via": "", "real_tags": ["rust", "生锈", "async"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073023, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自去年6月以来，Asana首席执行官兼联合创始人达斯汀·莫斯科维茨（Dustin Moskovitz）购买了该公司逾10亿美元的股票，这可能是有史以来最激进的内幕交易。\n根据向美国证券交易委员会提交的文件，在最近几周愈演愈烈的收购热潮中，莫斯科维茨以10.2亿美元的价格购买了1580万股Asana的A类股票。此次收购约占Asana已发行A股的16%。", "note_en": "In what is likely the most aggressive run of insider stock purchases ever, Asana CEO and co-founder Dustin Moskovitz has bought more than $1 billion of the company’s stock since last June.\n  During the buying spree, which has picked up steam in recent weeks, Moskovitz purchased 15.8 million shares of Asana’s Class A stock for $1.02 billion, according to filings with the Securities and Exchange Commission. The purchases represent about 16% of Asana’s Class A shares outstanding.", "posttime": "2022-02-14 11:21:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "股票,首席,ceo,购买", "title": "Asana的首席执行官购买了10亿美元的公司股票", "title_en": "Asana's CEO Has Bought $1B of Company Stock", "transed": 1, "url": "https://www.barrons.com/articles/asana-dustin-moskovitz-stock-buy-51644607520", "via": "", "real_tags": ["股票", "首席", "ceo", "购买"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073021, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "日期：2022年2月10日星期四14:16:41+0000From:Samuel Page&lt；塞缪尔。page@...gate.com&gt；致&#34；开放源码软件-security@...ts.openwall.com&#34; &书信电报；开放源码软件-security@...ts.openwall.com&gt；主题：CVE-2022-0435：自4.8（net/TIPC）以来Linux内核TIPC模块中的远程堆栈溢出免疫安全警告CVE-2022-0435：Linux内核中的远程堆栈溢出内核=时间线=；透明进程间通信（TIPC）协议的Linuxkernel网络模块中存在本地可访问的堆栈溢出。虽然在大多数主要发行版中都可以找到该模块，但必须将其归类才能加以利用。此外，对于远程攻击，目标需要已经设置TIPC承载，即漏洞扩展到使用TIPC的系统。利用该漏洞的行为微不足道，可能会通过kernelpanic导致拒绝服务。如果没有或绕过stack Canaris/KASLR，该漏洞可能导致利用任意有效载荷劫持控制流。自内核版本4.8中引入TIPCmonitoring框架以来，该漏洞一直存在。-介绍：提交35c55c9877f8（&#34；tipc:添加邻居监控框架&#34；）-固定的：https://github.com/torvalds/linux/commit/9aa422ad326634b76309e8ff342c246800621216========================================================================Analysis========================================================================Transparent进程间通信（TIPC）是为集群内通信而设计的一种IPC机制。集群拓扑是围绕节点的概念以及这些节点之间的链接进行管理的。TIPC模块的众多功能之一是其监控框架。该框架于2016年6月引入内核（commit 35c55c9），允许节点监视网络拓扑并与同一域中的其他节点共享视图。通过'struct tipc_Peer'：…/*StuttTiPCuPeL:对等节点的状态及其域*@ ADDR:对等体*@ Head映射的TIPC节点标识：显示哪些其他节点当前考虑对等体（39）；向上&#39；*@域：来自对等方的最新域记录*@hash:position in hash lookup list*@list:position in linked list，按&#39循环升序排列；地址&#39；*@已应用：在该监视列表上应用的已报告域成员数*@is_up:从该节点上看，对等方已向上*@is_head:从该节点上看，对等方已分配域头*@is_local:对等方在本地域中，应持续监视*@down_cnt:-在丢失的*/struct tipc_peer上报告此情况的其他对等方数{u32 addr；struct tipc_mon_domain*domain；struct hlist_node hash；struct list_head list；u8 applicated；u8 down_cnt；bool is_up；bool is_head；bool is_local；}`struct tipc_mon_domain`引用域记录，用于定义tipc拓扑的对等视图：#定义MAX_MON_域64…/*struct tipc_mon_domain:在对等方之间传输的域记录*@len:域记录的实际大小*@gen:当前一代发送方&#39；s domain*@ack_gen：最新一代的self&#39；s domain acked by peer*@member\\u cnt:此记录中描述的域成员节点数*@up\\u map:位图，指示发送方认为哪些成员是up*@members:域成员的标识*/struct tipc\\u mon\\u domain{u16 len；u16 gen；u16 ack\\u gen；u16 member\\u cnt；u64 up\\u map；u32 members[MAX\\u mon\\u domain]}；。。。这些记录在对等点之间传输，每个节点在“tipc_peer-”中保存从每个对等点接收的最新域记录的副本；域名字段。记录由函数“tipc_mon_rcv”处理，该函数检查从对等方收到的“STATE_MSG”，以查看消息正文是否包含avalid`struct tipc_mon_domain`:…/*tipc_mon_rcv-进程监视器域事件消息**@data:STATE_MSG body*@dlen:STATE_MSG body size（取自tipc头）*/void tipc_mon_rcv（struct net*net，void*data，u16 dlen，u32 addr，struct tipc_mon_STATE*STATE，int bearer\\u id）{…struct tipc_mon_domain*arrv_dom=data；struct tipc_mon_domain dom_bef；../*是否检查收到的域记录*/[0]如果（dlen&lt；dom_rec_len（arrv_dom，0））[1]返回；如果（dlen！=dom_rec len（arrv_dom，new_member_cnt））[2]返回；如果（dlen&lt；new|||| arrv dlen！=new|dlen）[3]返回；../*删除复制，除非我们正在等待探测响应*/if（！more（new_gen，state-&gt；peer_gen）&amp&amp！[4]返回；../*缓存当前域记录以备将来使用*/dom_bef。成员_cnt=0；dom=对等-&gt；领域if（dom）[5]memcpy（&amp；dom_bef，dom，dom-&gt；len）；[6] /*转换并存储收到的域记录*/if（！dom | |（dom-&gt；len&lt；new | dlen））{kfree（dom）；dom=kmalloc（new | dlen，GFP|ATOMIC）；[7]peer-&gt；domain=dom；if（！dom）goto exit；]。。。该函数会执行一些基本的健全性检查[0]，以确保a）消息正文实际上包含域记录，b）它是否包含avalid`struct tipc_mon_domain`。其中'data'是消息体，'dlen'是从消息头获取的'data'的长度，函数检查：“'data'的长度足以至少保存一个空记录[1]-“data'的长度与给定的'member_cnt'字段的域记录的预期大小匹配[2]-“data'的长度与提供的'len'字段匹配[3]之后，我们获取发送对等点的'struct peer'，以查看我们是否&#39；我已经收到他们的域记录[5]。如果有，我们希望临时缓存旧记录的副本，以便稍后进行比较[6]。然后，满足它&#39；这是一个新的有效记录，我们&#39；将更新'struct peer-&gt；带有新信息的域字段。如果是&#39；这是第一个域名记录，我们&#39；我会为这个[7]做一个新的'kmalloc'，或者如果它&#39；它比我们上次看到的大&#39；我会重新分配的-----------------漏洞-----------漏洞在于，在初始的健康检查期间，函数不&#39；t检查'member_cnt'是否低于定义'members'数组最大大小的最大MON_域。通过假装是对等节点并在本地或远程与目标建立链接，我们&#39；我们能够首先提交包含任意负载的恶意域名记录；只要len/member_cnt字段与健全性检查匹配，这将是K分配的罚款。接下来，我们可以发送一个新的域记录，这将导致之前的恶意记录为memcpy&#39；d转换为272字节的本地“struct tipc_mon_domain”&amp；dom_bef[6]触发堆栈溢出。这允许我们覆盖以下堆栈的内容&amp；dom_bef与我们的任意成员缓冲区一起从最先提交的恶意域名记录中删除；其大小受mediaMTU（以太网、UDP、Inifiband）的限制==========================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================，我们将发布一个后续博客来赞扬这一建议。关于漏洞利用，在给出修补和调解的时间后，我们还将发布一篇讨论漏洞利用的帖子。更多信息将发布在https://twitter.com/immunityinc/========================================================================Remediation========================================================================This自2016年6月首次引入监控框架以来，该漏洞一直存在，影响到4.8版以后的版本。下面的补丁是在commit 9AA422AD326中引入的，因此更新系统以包含此补丁是缓解CVE-2022-0435的最佳方法，包括Eric Dumazet发现的额外u16溢出。必须加载TIPC模块才能使系统易受攻击，此外，为了实现远程目标，系统需要启用TipBear。如果你没有&#39；如果您不需要使用TIPC或不确定是否需要，您可以采取以下步骤：“$lsmod | grep TIPC`将让您知道模块当前是否已加载，`modprobe-r TIPC`可能允许您在加载时卸载模块，但您可能需要重新启动系统-`echo&#34；安装tipc/bin/true&#34&gt&gt/etc/modprobe。d/禁用tipc。conf`将防止模块被加载，如果您需要使用TIPC和can&#39，那么如果您没有理由使用它，这是一个好主意；不要立即修补您的系统，请查看是否有任何配置阻止或限制攻击者模拟集群中节点的能力。选项包括TIPCprotocol级别的加密、IPSec/MACSec、网络分离等；还值得注意的是，当前的'CONFIG_FORTIFY_SRC=y'是利用CVE-2022-0435进行控制流劫持的一种硬缓解措施，因为它会对违规memcpy的大小进行边界检查，并导致akernel恐慌========================================================================感谢====================================================================================================================================================================================================================================I&#39；I’我要感谢TIPC模块的维护人员，以及security@...nel.org和linux-distros@...openwall.org在整个披露过程中为他们的帮助和工作。我还想提及SentinelLabs之前对TIPC进行的漏洞研究，以及他们在CVE-2021-43267上的工作，以及其他安全研究人员发表的关于TIPC利用的发现。-https://www.sentinelone.com/labs/tipc-remote-linux-kernel-heap-overflow-allows-arbitrary-code-execution/-  https://haxx.in/posts/pwning-tipc/========================================================================Disclosure时间线===================================================================================================================================-2022年1月27日：脆弱性与风险；修复建议报告-2022年2月5日：补丁定稿-2022年2月10日：协调发布日期（格林威治标准时间14:00）", "note_en": "Date: Thu, 10 Feb 2022 14:16:41 +0000From: Samuel Page &lt;samuel.page@...gate.com&gt;To: &#34;oss-security@...ts.openwall.com&#34; &lt;oss-security@...ts.openwall.com&gt;Subject: CVE-2022-0435: Remote Stack Overflow in Linux Kernel TIPC Module since 4.8 (net/tipc)Immunity Security AdvisoryCVE-2022-0435: A Remote Stack Overflow in The Linux Kernel========================================================================Contents========================================================================SummaryAnalysisFurther InformationRemediationAcknowledgementsDisclosure Timeline========================================================================Summary========================================================================We discovered a remotely &amp; locally reachable stack overflow in the Linuxkernel networking module for the Transparent Inter-ProcessCommunication (TIPC) protocol.While the module can be found in most major distributions, it must beloaded in order to be exploited. Furthermore, for remote exploitationthe target would need to have a TIPC bearer set up already i.e.vulnerability extends to systems using TIPC.Exploitation is trivial and can lead to denial of service via kernelpanic. In the absence, or bypass, of stack canaries/KASLR thevulnerability can lead to control flow hijacking with an arbitrarypayload.The vulnerability has been present since the introduction of the TIPCmonitoring framework in kernel version 4.8.- Introduced: commit 35c55c9877f8 (&#34;tipc: add neighbor monitoring framework&#34;)- Fixed:  https://github.com/torvalds/linux/commit/9aa422ad326634b76309e8ff342c246800621216========================================================================Analysis========================================================================Transparent Inter Process Communication (TIPC) is an IPC mechanismdesigned for intra-cluster communication. Cluster topology is managedaround the concept of nodes and the links between these nodes.One of the many features of the TIPC module is its monitoring framework.Introduced into the kernel in June 2016 (commit 35c55c9), the frameworkallows nodes to monitor network topology and share their view with othernodes in the same domain.Peer state is tracked via `struct tipc_peer`:... /* struct tipc_peer: state of a peer node and its domain * @addr: tipc node identity of peer * @head_map: shows which other nodes currently consider peer &#39;up&#39; * @domain: most recent domain record from peer * @hash: position in hashed lookup list * @list: position in linked list, in circular ascending order by &#39;addr&#39; * @applied: number of reported domain members applied on this monitor list * @is_up: peer is up as seen from this node * @is_head: peer is assigned domain head as seen from this node * @is_local: peer is in local domain and should be continuously monitored * @down_cnt: - numbers of other peers which have reported this on lost */ struct tipc_peer { u32 addr; struct tipc_mon_domain *domain; struct hlist_node hash; struct list_head list; u8 applied; u8 down_cnt; bool is_up; bool is_head; bool is_local; };...`struct tipc_mon_domain` referends a domain record, used to define thatpeers view of the TIPC topology:... #define MAX_MON_DOMAIN 64 ... /* struct tipc_mon_domain: domain record to be transferred between peers * @len: actual size of domain record * @gen: current generation of sender&#39;s domain * @ack_gen: most recent generation of self&#39;s domain acked by peer * @member_cnt: number of domain member nodes described in this record * @up_map: bit map indicating which of the members the sender considers up * @members: identity of the domain members */ struct tipc_mon_domain { u16 len; u16 gen; u16 ack_gen; u16 member_cnt; u64 up_map; u32 members[MAX_MON_DOMAIN]; };...These records are transferred between peers, with each node keeping acopy of the most up-to-date domain record received from each of itspeers in the `tipc_peer-&gt;domain` field.Records are processed by the function `tipc_mon_rcv`, which check`STATE_MSG` received from peers, to see if the message body contains avalid `struct tipc_mon_domain`:... /* tipc_mon_rcv - process monitor domain event message * * @data: STATE_MSG body * @dlen: STATE_MSG body size (taken from TIPC header) */ void tipc_mon_rcv(struct net *net, void *data, u16 dlen, u32 addr, struct tipc_mon_state *state, int bearer_id) { ... struct tipc_mon_domain *arrv_dom = data; struct tipc_mon_domain dom_bef; ... /* Sanity check received domain record */ [0] if (dlen &lt; dom_rec_len(arrv_dom, 0)) [1] return; if (dlen != dom_rec_len(arrv_dom, new_member_cnt)) [2] return; if (dlen &lt; new_dlen || arrv_dlen != new_dlen) [3] return; ... /* Drop duplicate unless we are waiting for a probe response */ if (!more(new_gen, state-&gt;peer_gen) &amp;&amp; !probing) [4] return; ... /* Cache current domain record for later use */ dom_bef.member_cnt = 0; dom = peer-&gt;domain; if (dom) [5] memcpy(&amp;dom_bef, dom, dom-&gt;len); [6] /* Transform and store received domain record */ if (!dom || (dom-&gt;len &lt; new_dlen)) { kfree(dom); dom = kmalloc(new_dlen, GFP_ATOMIC); [7] peer-&gt;domain = dom; if (!dom) goto exit; }...The function does some basic sanity checks [0] to make sure that a) themessage body actually contains a domain record and b) does it contain avalid `struct tipc_mon_domain`.Where `data` is the message body and `dlen` is the length of the `data`taken from the message header, the function checks:- the length of `data` is enough to at least hold an empty record [1]- the length of `data` matches the expected size of a domain record given the provided `member_cnt` field [2]- the length of `data` matches the provided `len` field [3]Later we fetch the sending peers `struct peer` to see if we&#39;ve alreadyreceived a domain record from them [5]. If we have, we want totemporarily cache a copy of the old record to do a comparison later [6].Then, satisfied it&#39;s a new and valid record, we&#39;ll update the`struct peer-&gt;domain` field with the new info. If it&#39;s the first domainrecord, we&#39;ll make a new `kmalloc`ation for this [7], or if it&#39;s largerthan the last one we&#39;ll reallocate it.-----------------The Vulnerability-----------------The vulnerability lies in the fact that during the initial sanitychecks, the function doesn&#39;t check that `member_cnt` is belowMAX_MON_DOMAIN which defines the maximum size of the `members` array.By pretending to be a peer node and establishing a link with the target,locally or remotely, we&#39;re able to first submit a malicious domainrecord containing an arbitrary payload; so long as the len/member_cntfields match up for the sanity checks, this will be kmallocated fine.Next, we can send a newer domain record which will cause the previousmalicious record to be memcpy&#39;d into a 272 bytes local`struct tipc_mon_domain` &amp;dom_bef [6] triggering a stack overflow.This allows us to overwrite the contents of the stack following&amp;dom_bef with our arbitrary members buffer from the malicious domainrecord submitted first; the size of which is constrained by the mediaMTU (Ethernet, UDP, Inifiband)========================================================================Further Information========================================================================For a more in-depth analysis, including additional TIPC background, wewill be posting up a follow-up blog to compliment this advisory.Regarding exploitation, after time has been given for patching andremediation we will also release a further post discussing exploitation.Further information will be posted over at  https://twitter.com/immunityinc/========================================================================Remediation========================================================================This vulnerability has been present since the monitoring framework wasfirst introduced in June 2016, impacting versions 4.8 forward.The patch below was introduced in commit 9aa422ad3266, so updating yoursystem to include this patch is the best way to mitigate CVE-2022-0435,including an additional u16 overflow spotted by Eric Dumazet.The TIPC module must be loaded for the system to be vulnerable,furthermore to be targeted remotely the system needs to have a TIPCbearer enabled. If you don&#39;t need to use TIPC or are unsure if you are,you can take the following steps:- `$ lsmod | grep tipc` will let you know if the module is currently loaded,- `modprobe -r tipc` may allow you unload the module if loaded, however you may need to reboot your system- `$ echo &#34;install tipc /bin/true&#34; &gt;&gt; /etc/modprobe.d/disable-tipc.conf` will prevent the module from being loaded, which is a good idea if you have no reason to use itIf you need to use TIPC and can&#39;t immediately patch your system, look toenforce any configurtions that prevent or limit the ability forattackers to imitate nodes in your cluster. Options include TIPCprotocol level encryption, IPSec/MACSec, network seperation etc.It&#39;s also worth noting that the current `CONFIG_FORTIFY_SRC=y` is a hardmitigation to leveraging CVE-2022-0435 for control-flow hijacking, as itdoes a bounds check on the size of the offending memcpy and causes akernel panic.========================================================================Acknowledgements========================================================================I&#39;d like to thank the maintainers of the TIPC module, as well as membersof the security@...nel.org and linux-distros@...openwall.org for theirhelp and work throughout the disclosure process.I would also like to mention the vulnerability research done on TIPCpreviously by SentinelLabs with their work on CVE-2021-43267 and othersecurity researchers for publishing their findings on TIPC exploitation.-  https://www.sentinelone.com/labs/tipc-remote-linux-kernel-heap-overflow-allows-arbitrary-code-execution/-  https://haxx.in/posts/pwning-tipc/========================================================================Disclosure Timeline========================================================================- 27/01/2022: Vulnerability &amp; fix suggestion reported- 05/02/2022: The patch is finalised- 10/02/2022: Coordinated release date (14:00 GMT)The information contained in this electronic mail is confidential information intended only for the use of the individual(s) or entity(s) named. If the reader of the message is not the addressee (or authorized to receive for the addressee), you are hereby notified that any dissemination, distribution or copying of this communication is strictly prohibited. If you have received this communication in error, please immediately notify the sender by reply e-mail and/or by telephone and destroy the original message.", "posttime": "2022-02-14 11:20:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,堆栈,tipc", "title": "CVE-2022-0435：自4.8版本以来，Linux内核TIPC模块中的远程堆栈溢出", "title_en": "CVE-2022-0435: Remote Stack Overflow in Linux Kernel TIPC Module Since 4.8", "transed": 1, "url": "https://www.openwall.com/lists/oss-security/2022/02/10/1", "via": "", "real_tags": ["linux", "堆栈", "tipc"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073019, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Newegg卖给我们一块他们知道已经损坏的主板。它甚至被贴上了这样的标签，纽蛋自己也开始对它进行RMA，但后来他们指责我们。。。", "note_en": "Newegg sold us a motherboard that they knew was damaged. It was even labeled as such and Newegg themselves had started to RMA it, but then they blamed us for...", "posttime": "2022-02-14 11:17:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "令人震惊,shocking,后来", "title": "纽格令人震惊的无能", "title_en": "Newegg's Shocking Incompetence", "transed": 1, "url": "https://www.youtube.com/watch?v=CL-eB_Bv5Ik", "via": "", "real_tags": ["令人震惊", "shocking", "后来"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073018, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Jump to navigation Jump to search RiegeOS是一款适用于智能手机、平板电脑和机顶盒的操作系统，基于安卓系统，大部分是免费的开源软件。它是定制ROM CyanogenMod的继任者，2016年12月，Cyanogen Inc.宣布停止开发并关闭该项目背后的基础设施时，该公司从该定制ROM CyanogenMod分出。[4] [5]由于Cyanogen Inc.保留了Cyanogen名称的权利，该项目将其fork更名为Riegeos。[6]\n天堂OS于2016年12月24日正式推出，源代码可在GitHub和GitLab上获得。[7] [8]与所有版本的安卓系统一样，操作系统版本只针对单一设备型号。自推出以来，天堂OS开发版可用于109款手机型号[9]，活动安装量超过280万次[10]，在2017年2月至3月的几个月内，其用户基数翻了一番。[11]\nCyanogenMod（通常缩写为&#34；CM&#34；）是一款流行的[12]开源操作系统，基于Android移动平台，适用于智能手机和平板电脑。尽管截至2015年3月23日，只有一部分CyanogenMod用户选择报告其固件使用情况，[13]，但一些报告显示，超过5000万人在手机上运行CyanogenMod。[12]  [14]\n2013年，创始人斯蒂芬妮·康迪克（Stefanie Kondik）以氰公司的名义获得了风险投资，以使该项目商业化。[15] [16]在她看来，公司没有利用这个项目&#39；2016年，作为公司重组的一部分，她离职或被迫离职[18]，该重组涉及更换CEO、关闭办公室和项目以及停止服务。[19] 代码本身既开放源代码又广受欢迎，很快就被改名为天堂OS，并开始作为一个社区项目恢复开发。\nCyanogenMod提供了许多在大多数移动设备供应商发布的官方固件中不可用的功能和选项。CyanogenMod支持的功能包括本机主题支持、[20]FLAC音频编解码器支持、大型接入点名称列表、隐私保护（每个应用程序权限管理应用程序）、支持公共接口上的连接、CPU超频、根访问、软按钮和其他&#34；平板电脑的调整&#34；在“通知”下拉列表中切换（如Wi-Fi、蓝牙和卫星导航），以及其他界面和性能增强功能。CyanogenMod的许多功能后来被集成到官方的Android代码库中。氰莫德&#39；s的开发者表示，它不包含间谍软件或膨胀软件。[21][22]与官方固件版本相比，CyanogenMod的性能更好、更可靠。[23]\n与CyanogenMod一样，LeageneOS项目由许多特定于设备的维护人员开发，并使用Gerrit进行代码审查。它还保留了旧的版本控制格式（例如，Android 7.1是天堂OS 14.1）。\n在正式发布天堂OS之前，XDA的许多开发人员已经从源代码开发了天堂OS的非官方版本。\n2017年1月22日，在一篇博客文章中正式宣布后，首批14.1和13.0官方版本开始发布。[24]\n2018年2月11日，13.0版本被停止，[25]，而源代码仍然可用，Gerrit上的安全修复程序仍被接受。\n2018年2月26日，在一篇博客文章中正式宣布后，首批15.1官方版本开始在某些设备上可用。[26]天堂操作系统的14.1版本将继续处于积极开发阶段，但没有功能改进。\n2019年2月24日，14.1版本被停止，15.1版本被改为每周一次[27]\n2019年3月1日，官方宣布后，首批16.0官方版本开始提供。[28]15.1分支仍在积极开发中，但没有功能改进。\n2020年2月28日，15.1版本停止，为17.1版本做准备。[29]\n2020年4月1日，官方宣布后，首批17.1版本发布。[30]16.0版本将以每周一次的节奏进行，而分支仍在积极开发中，但没有功能改进。\n2021年4月1日，在正式宣布之后，首批18.1座建筑得以上市。[1] 17.1分支仍在积极开发中，但没有功能改进。\n版本每周发布一次，直到2018年11月12日，设备的发布周期已经改变：最新的天堂OS分支每天都会发布，设备会收到&#34；每晚&#34；OTA更新，而旧分支上的设备则改为每周发布一次。[31]\n天堂OS允许社区以各种方式参与开发。Gerrit用于操作系统和基础架构的代码审查过程。\n该维基包含有关天堂操作系统的安装、支持和开发的信息，也可以通过Gerrit进行贡献。其他沿袭平台包括用于管理翻译的Crowdin、用于错误跟踪的Gitlab问题，以及一个统计页面，该页面显示选择报告此统计数据的用户的活动安装数量。Libera上还有一个IRC频道。聊天（沿袭操作系统）和subreddit（沿袭操作系统）。[32]\nXDA开发者论坛自软件发布以来一直被沿袭社区的成员使用&#39；《盗梦空间》。许多设备没有得到官方版本的支持，因此社区成员开发了自己的非官方ROM，允许旧手机使用Lineage。这些非官方版本通常与旨在帮助用户的软件捆绑在一起&#39；在官方版本中看不到的经验。它们还带有官方版本中可能看不到的已知漏洞和安全问题。[需要引用]\n2017年8月，天堂OS团队举行了一次夏季调查[33]，要求用户提供反馈，以改进操作系统的开发。研究结果于10月发布[34]，据该团队称，他们利用收集到的数据改进即将发布的天堂OS 15。2018年8月进行了第二次夏季调查。[35]\n作为对第一次公众调查期间收到的主要建议之一的回应，天堂公司在其博客上推出了一个名为&#34；天堂工程博客&#34；在这里，沿袭维护人员和开发人员可以发表文章，讨论与Android开发相关的高级技术信息。[36]\nLegeneos也以发布&#34；定期进行不定期审查&#34；[37]在其博客上讨论了该作品的积极发展。\n天堂操作系统包括许多重要且有用的应用程序，但与它的前身CyanogenMod一样，它没有通常由手机预装的不必要的软件&#39；被认为是臃肿软件的制造商或运营商。[41]  [21]\n浏览器——一种轻量级浏览器，它依赖于系统Webview，用于低端设备，也称为Jelly。\n日历–日历功能，具有日、周、月、年或议程视图。从17.1版开始的Etar的修改版。\n摄像头——根据设备规格，可以拍摄视频或照片，包括全景。它还可以用来读取二维码。该应用程序也称为Snap。\n文件–一个简单的文件管理器，用于移动、复制和重命名内部存储或SD卡上的文件。\nFM Radio–一款用于收听调频广播的应用程序，包含在带有调频调谐器的设备上。\n录音机——录音机。在18.1之前的版本中，它还可以记录屏幕。\n终端——一款简单标准的终端应用。隐藏，除非在开发人员设置中启用。\nGello–一款基于铬的浏览器，由CyanogenMod开发。这个应用现在被Jelly取代。\n尽管由于法律问题，这些应用不包括在天堂操作系统中，[42]用户在安装天堂操作系统时，可以使用一个Zip包（通常称为gapps）闪存普通的谷歌应用，包括谷歌游戏商店和游戏应用。使用天堂OS和其他定制ROM的一个副作用是对SafetyNet API的影响。[43]如果设备没有&#39；t通过安全网测试，或者可以选择检查设备的安全网状态以禁用某些功能。值得注意的例子包括隐藏在Play Store上的Netflix和每次使用该应用时都会检查SafetyNet的Android Pay。由于这些检查，运行“沿袭”的设备在Play Store中的可用应用选择可能较少。\n天堂OS提供了Android开源项目（AOSP）不包括的几个功能。其中一些功能包括：\n按钮自定义–为导航栏上的按钮设置自定义位置，或为带有硬件按钮的设备启用屏幕按钮。\n定制快装瓷砖–快装瓷砖，如&#34；咖啡因&#34；防止设备睡眠、启用/禁用提醒通知和#34；环境显示&#34；和&#34；亚洲开发银行通过网络#34；可轻松切换频繁访问的设置。\n锁屏定制——锁屏允许各种定制，包括媒体封面艺术、音乐可视化工具和双击睡眠。\n样式–设置全局深色或浅色主题模式，并自定义强调色。该功能也可以由系统根据壁纸或时间自动管理（与LiveDisplay一致）。\n系统配置文件–根据所选配置文件（例如，a&#34；Home&#34；配置文件和a&#34；Work&#34；配置文件）启用或禁用常用设置。可以手动或通过使用&#34；触发器&#34；，例如，连接到特定的WiFi接入点、连接到蓝牙设备或点击NFC标签时。\n定制图案尺寸——除了Android和#39；s 3x3图案尺寸，可使用4x4、5x5或6x6尺寸。\nPIN置乱–对于使用PIN保护设备的用户，每次设备锁定时，布局都会被置乱，使人们很难通过查看您的肩膀来识别您的锁定。\n隐私保护–允许用户微调授予每个应用程序的权限。对于某些权限，它是&#39；可以在每次请求许可时设置手动批准。它&#39；还可以了解应用程序使用特定权限的频率。17.1分支中删除了该功能，取而代之的是一个等价的#34；权限控制器&#34；基于隐藏的AOSP功能。\n受保护的应用程序–将特定应用程序隐藏在安全锁后。这与投石机密切相关；应用程序&#39；s图标从启动器中移除，并且&#34；保护文件夹&#34；可以创建以轻松访问这些应用程序。模式用于锁定这些应用程序。\n有些&#34；敏感数字&#34；，例如滥用支持号码，出于隐私考虑，不包括在通话记录中。[44]电话应用程序还包括一个帮助热线号码列表，以便用户能够轻松联系到他们。[1]\n天堂SDK–一组API，供应用程序开发人员将其应用程序与天堂操作系统的特定功能（如系统配置文件、样式和天气）集成。[45]\n（可选）Root–允许应用程序使用Root访问权限运行，以执行高级任务。这需要从恢复中闪烁，无论是从操作系统&#39；s根附加组件（16.0[46]版之前支持）或第三方实现，如Magisk或SuperSU。\n天气提供商–使用天气提供商在小部件或应用程序中显示天气。默认情况下不包括此功能；天气提供商必须从天堂OS下载网站下载。[可疑]应用开发者可以创建天气数据的提供者和消费者。\n随着天堂OS在开发过程中的发展，自2018年6月12日以来发布的所有天堂OS 15.1版本都引入了信任接口。[47]该界面可在支持的设备上的“设置”选项下的“安全和隐私”选项卡下找到，并允许用户&#34；了解核心安全功能的状态，并解释如何确保设备安全和数据保密；。\n此外，在设备上执行任何操作时，会显示信任图标，通知用户该操作是安全的。\n直线加速器所支持的设备数量随着时间的推移而增加，17.1和18.1的设备数量随着四月（1, 2021）的增加而增加。[9] [48]基于当前支持的开发分支的官方构建被标记为&#34；每晚&#34；。在该项目的前两个月，还制作了并行实验版本，允许从之前的CyanogenMod安装中进行就地升级，并简化了向天堂操作系统的迁移。[48]  [49]  [50]  [51]\n里杰戈斯因欺骗愚人节而受到批评#39；s的恶作剧包括2018年4月的一些版本。[52]\n2018年4月的第一周，天堂OS发布了带有&#34；34岁；恶作剧，通过持久性通知（除非用户在根shell中运行以下命令，否则无法禁用该通知），通知不知情的用户该软件可能是伪造的：\n点击通知时，软件声称该设备为&#34；未经认证&#34；需要挖掘&#34；LOSCoins&#34；，这是一种虚拟货币，无法实际使用。受影响的版本还预装了#34；钱包&#34；显示当前硬币余额的应用程序。[52]\n许多用户将恶作剧误认为是真正的恶意软件，据报道，其他人发现它位于&#34；品味差&#34；。它被特别批评为太&#34；迟到&#34岁；对于一个愚人节&#39；这是一个玩笑，因为很多用户都没有&#39；直到几天后，我才收到更新，这让玩笑变得不那么明显。2018年4月10日，天堂公司团队总监ciwrl就这一欺骗性恶作剧发布了官方道歉。[53]  [54]\nReplicator是一款完全免费的软件版本，它删除了所有内核blob和非免费驱动程序。\n作为对官方版本中支持签名欺骗的几个原因的拒绝的回应，[55]一个包含microG[56]服务的天堂OS fork，称为&#34；对于microG和#34；，它被创造出来了。该项目提供定制版本的天堂操作系统，附带所需的补丁和本机F-Droid支持，并与MicroG项目&#39捆绑在一起；免费重新实施专有GAPP。[57][58]在其他方面，它跟随上游，每14天发送一次OTA更新。[59]\n/e/是Gaël Duval创建的谱系分支，旨在成为&#34；从谷歌免费下载&#34；。它用microG取代了Google Play服务，microG是Google API的免费开源实现。[60]\n^b c d血统&#34;更改日志25&#34；。里杰戈斯。组织。{{cite web}:CS1 maint:url状态（链接）\n^加热器，布莱恩（2016年12月24日）&#34;基础设施关闭后，CyanogenMod将继续作为世系&#34；。TechCrunch。\n^     &#34;路的岔口&#34；。氰莫德。2016年12月24日。2016年12月25日存档。\n^肖恩·加拉赫，加拉赫（2016年12月27日）&#34;Cyanogen Inc.在圣诞大屠杀中关闭CyanogenMod；。Ars Technica。Ars Technica。\n^     &#34;天堂操作系统目前拥有100万用户，OnePlus one是最受欢迎的设备；。男性权威。通用域名格式。2017年3月20日。\n^你好，米格尔&#34;看看Cyanogen，一家想从谷歌（Google）窃取安卓系统（Android）的初创公司；。福布斯。\n^Chris Soyars（2011年3月21日）&#34;CM统计数据解释&#34；。2016年6月4日从原件存档。\n^CyanogenMod[@CyanogenMod]（2012年1月12日）&#34;CyanogenMod刚刚超过100万活跃用户&#34；（推特）——通过推特。\n^布莱德·里德（2013年9月18日）&#34;凭借700万美元的资金，Cyanogen计划与Windows Phone&#34；竞争；。男孩天才报告。\n^戴维·鲁多克（2016年11月28日）&#34;Cyanogen Inc.将在年底前关闭西雅图办事处，如果发生更多裁员，Kondik可能会退出&#34；。安卓警察。康迪克被从公司除名#39；据称，该公司董事会\n^CyanogenMod[@CyanogenMod]（2016年12月25日）&#34;更新：今天早上我们失去了DNS，Gerrit现在离线了——毫无疑问，这是对我们昨天博客帖子的回应。再见&#34；（推特）——通过推特。\n^     &#34;主题支持&#34；。氰莫德。2011年2月19日。2016年10月21日从原件存档。\n^34岁；Cyanogenmod承诺永远不会包括像Carrier IQ&#34；这样的应用程序；。计算机操作。2011年12月5日。2016年4月19日从原件存档。\n^     &#34;视频：CyanogenMod创始人史蒂夫·康迪克（Steve Kondik）谈论Android&#34；。打开电话。通用域名格式。2012年7月6日。2013年2月5日从原件存档。\n^里杰戈斯&#34;Changelog 16-智能风格，高音是麻烦，Omfg Oreo&#34；。www.delegeos。组织。\n^a b天堂&#34;更改日志24&#34；。里杰戈斯。组织。{{cite web}:CS1 maint:url状态（链接）\n^Siddharth Chauhan（2017年2月7日）&#34;如何：在智能手机上安装天堂操作系统；。在里面pcmag。通用域名格式。就用户界面而言，天堂操作系统提供了一个干净、无臃肿的Android体验，但仍有一些技巧。\n^里格，杰米（2017年1月24日）&#34;CyanogenMod继任者Riegeos的第一批产品已经面世&#34；。恩加吉特。\n^34岁；唐&#39；t疯狂：天堂有一个非常糟糕和非常晚的愚人节#39；最新版本中的笑话&#34；。安卓警察。2018年4月5日。\n^     &#34;里杰戈斯为迟到和&#39；品味差&#39；愚人节&#39；开玩笑&#34；。安卓警察。2018年4月10日。\n^  &#34;  microG提供了一套API的免费版本，相当于谷歌专有的核心库和应用程序&#34;\n^多米尼克菲利蓬（2018年9月19日）&#34;伊洛：l&#39；OS mobile开源de Gaël Duval sort en bêta-Le Monde Informatique&#34；。LeMondeInformatique（法语）。", "note_en": "Jump to navigation  Jump to search  LineageOS is an  operating system for  smartphones,  tablet computers, and  set-top boxes, based on  Android with mostly  free and open-source software. It is the successor to the custom ROM  CyanogenMod, from which it was  forked in December 2016 when  Cyanogen Inc. announced it was discontinuing development and shut down the infrastructure behind the project.  [4]  [5] Since Cyanogen Inc. retained the rights to the Cyanogen name, the project rebranded its fork as LineageOS.  [6]\n LineageOS was officially launched on 24 December 2016, with the  source code available on both  GitHub and  GitLab.  [7]  [8] As with all versions of Android, operating system releases are specific to a single device model. Since its launch, LineageOS development builds are available for 109 phone models  [9] with over 2.8 million active installs,  [10] having doubled its user base in the months February–March 2017.  [11]\n    CyanogenMod (often abbreviated &#34;CM&#34;) was a popular  [12]  open-source  operating system for  smartphones and  tablet computers, based on the  Android mobile platform. Although only a subset of total CyanogenMod users elected to report their use of the firmware,  [13] as of 23 March 2015, some reports indicated over 50 million people running CyanogenMod on their phones.  [12]  [14]\n In 2013, the founder, Stefanie Kondik, obtained  venture funding under the name Cyanogen Inc. to allow commercialization of the project.  [15]  [16] In her view, the company did not capitalize on the project&#39;s success and in 2016 she either left or was forced out   [18] as part of a corporate  restructure which involved a change of  CEO, closure of offices and projects, and cessation of services.  [19] The code itself, being both  open source and popular, was quickly  forked under the new name LineageOS and efforts began to resume development as a community project.\n CyanogenMod offered a number of features and options not available in the official  firmware distributed by most mobile device vendors. Features supported by CyanogenMod included native  theme support,  [20]  FLAC audio codec support, a large  Access Point Name list,  Privacy Guard (per-application  permission management application), support for  tethering over common interfaces, CPU  overclocking, root access, soft buttons and other &#34;tablet tweaks,&#34; toggles in the notification pull-down (such as  Wi-Fi,  Bluetooth and  satellite navigation), and other interface and performance enhancements. Many of the features from CyanogenMod were later integrated into the official Android code base. CyanogenMod&#39;s developers said that it did not contain  spyware or  bloatware.  [21]  [22] CyanogenMod was also said to perform better and be more reliable than official firmware releases.  [23]\n  Like CyanogenMod, the LineageOS project is developed by many device-specific maintainers and uses  Gerrit for its  code review process. It also retained the old versioning format (for example, Android 7.1 is LineageOS 14.1).\n Prior to the official launch of LineageOS, many developers from  XDA had already developed unofficial versions of LineageOS from the source code.\n On 22 January 2017, the first 14.1 and 13.0 official builds started to be made available, following the official announcement in a blog post.  [24]\n On 11 February 2018, the 13.0 builds were stopped,  [25] while the source code remains available and security fixes are still accepted on  Gerrit.\n On 26 February 2018, the first 15.1 official builds started to be available on certain devices, following official announcement in a blog post.  [26] The 14.1 versions of Lineage OS were to remain in active development, but without feature advancements.\n On 24 February 2019, the 14.1 builds were stopped and 15.1 builds moved to a weekly cadence  [27]\n On 1 March 2019, the first 16.0 official builds started to be available, following official announcement.  [28] The 15.1 branch remained in active development, but without feature advancements.\n On 28 February 2020, the 15.1 builds were stopped in preparation for the 17.1 release.  [29]\n On 1 April 2020, the first 17.1 builds were made available, following official announcement.  [30] The 16.0 builds are moved to a weekly cadence while the branch remains in active development, but without feature advancements.\n On 1 April 2021, the first 18.1 builds were made available, following official announcement.  [1] The 17.1 branch remains in active development, but without feature advancements.\n  Builds were released on a weekly basis until 12 November 2018, when the release cycle for devices has changed: the latest LineageOS branch is built daily, with devices receiving a &#34;nightly&#34; OTA update, while devices on the older branch were moved to a weekly release cycle.  [31]\n  LineageOS allows the community to get involved with development in various ways.  Gerrit is used for the code review process for both the operating system and the infrastructure.\n The wiki, containing information regarding installation, support, and development of LineageOS, is also open to contributions through Gerrit. Other Lineage platforms include  Crowdin for managing translations,  Gitlab Issues for bug tracking, and a stats page, which displays the number of active installations from users who opt in to report this statistic. There is also an  IRC channel hosted on  Libera.chat ( #lineageos) and  subreddit ( r/lineageos).  [32]\n The XDA Developers forums have been used by members of the Lineage community since the software&#39;s inception. Many devices are left unsupported by official releases so community members develop their own unofficial ROMs allowing older phones to use Lineage. These unofficial releases are often bundled with software intended to aid the user&#39;s experience that would otherwise be unseen in an official release. They also come with known bugs and security issues that may not be seen in official releases. [   citation needed]\n During August 2017 the LineageOS team held a Summer Survey  [33] in which they asked users for feedback to improve the development of the operating system. The results were published  [34] in October and, according to the team, they used the gathered data to improve the upcoming LineageOS 15 release. A second Summer Survey was conducted in August 2018.  [35]\n As a response to one of the main suggestions received during their first public survey, LineageOS launched a section on their blog titled &#34;LineageOS Engineering Blog&#34; where Lineage maintainers and developers can contribute articles discussing advanced technical information pertaining to Android development.  [36]\n LineageOS is also known for posting a &#34;regularly irregular review&#34;  [37] on its blog in which the active development of the work is discussed.\n       LineageOS includes many essential and useful apps, but like its predecessor, CyanogenMod, it is free from unnecessary software often pre-installed by a phone&#39;s manufacturer or carrier that is considered to be  bloatware.  [41]  [21]\n  Browser – A lightweight browser that relies on the System Webview, for low-end devices, also known as Jelly.\n  Calendar – Calendar functionality with Day, Week, Month, Year or Agenda views. A modified version of Etar starting with version 17.1.\n Camera – Dependent on device specification will take video or photos, including panoramic. It can also be used to read QR codes. This app is also known as Snap.\n    Files – A simple file manager to move, copy and rename files on internal storage or SD card.\n  FM Radio – An app for listening to FM radio broadcasts, included on devices with an FM tuner.\n     Recorder – A sound recorder. In versions prior to 18.1 it could also record the screen.\n Terminal – A simple and standard terminal app. Hidden unless enabled in the developer settings.\n  Gello – A browser based on Chromium and developed by CyanogenMod. This app is now replaced by Jelly.\n Although they are not included in LineageOS as such due to legal issues,  [42] users can flash the normal Google apps, including the Google Play Store and Play Apps, with a  Zip package, usually referred to as  gapps, while installing Lineage OS. A side effect of using LineageOS and other custom roms is the impact on SafetyNet API.  [43] App developers can choose to enable a toggle in the app developer console to hide their app on the Play Store if a device doesn&#39;t pass SafetyNet tests, or can choose to check the SafetyNet status of a device to disable certain functionality. Notable examples would be Netflix, which is hidden on the Play Store, and Android Pay, which checks SafetyNet each time the app is used. Devices running Lineage may have a smaller selection of usable apps in the Play Store as a result of these checks.\n  LineageOS offers several features that  Android Open Source Project (AOSP) does not include. Some of these features are:\n  Button customization – Set custom location for buttons on the navigation bar, or enable on-screen buttons for devices with hardware buttons.\n Custom Quick-Setting tiles – Quick Setting Tiles such as &#34;Caffeine&#34; preventing the device from sleeping, enabling/disabling Heads Up notifications, &#34;Ambient Display&#34; and &#34;ADB over network&#34; are present to easily toggle frequently accessed settings.\n  Lock screen customization – The lock screen allows all sorts of customizations, including media cover art, a music visualizer, and double-tap to sleep.\n Styles – Set a global dark or light theme mode and customize accent colors. This functionality can also be managed automatically by the system based on wallpaper or time of day (in line with LiveDisplay).\n System Profiles – Enable or disable common settings based on the selected profile (For example, a &#34;Home&#34; profile and a &#34;Work&#34; profile). The profile can be selected either manually or through the use of a &#34;trigger&#34;, such as upon connecting to a specific WiFi access point, connecting to a Bluetooth device, or tapping an  NFC tag.\n Custom pattern sizes – In addition to Android&#39;s 3x3 pattern size, a 4x4, 5x5 or 6x6 size can be used.\n  PIN scramble – For users securing their device with a  PIN, the layout can be scrambled each time the device locks to make it difficult for people to figure out your lock by looking over your shoulder.\n Privacy guard – Allow the user to fine-tune what permissions are granted to each application. For some permissions, it&#39;s possible to set a manual approval each time the permission is requested. It&#39;s also possible to find out how often apps use a specific permission. This feature was removed in the 17.1 branch in favor of an equivalent &#34;permission controller&#34; based on a hidden AOSP feature.\n Protected Apps – Hide specific apps behind a secure lock. This works hand-in-hand with Trebuchet; the app&#39;s icon is removed from the launcher, and &#34;secure folders&#34; can be created to easily access these applications. A pattern is used to lock these apps.\n Some &#34;sensitive numbers&#34;, such as abuse support numbers, are not included in the call log for privacy.  [44] The phone application also includes a list of helpline numbers for the users to be able to easily reach them.  [1]\n  LineageSDK – a set of APIs for app developers to integrate their apps with LineageOS specific features such as System Profiles, Styles and Weather.  [45]\n  (Optional) Root – Permit apps to function with  root access to perform advanced tasks. This requires flashing from Recovery either LineageOS&#39;s root add-on (supported until version 16.0  [46]) or a third-party implementation such as Magisk or SuperSU.\n  Weather providers – Display the weather in widgets or apps using a weather provider. This functionality is not included by default; a weather provider must be downloaded from the LineageOS Downloads website. [   dubious  ] App developers can create both providers and consumers of weather data.\n  As LineageOS evolved through development, the Trust interface was introduced for all the LineageOS 15.1 builds released since 12 June 2018.  [47] The interface can be found on supported devices under Security and Privacy tab under the Settings option, and enables the user to &#34;get an overview of the status of core security features and explanations on how to act to make sure the device is secure and the data is private&#34;.\n Additionally, while carrying out any action on the device, the trust icon is displayed, notifying the user that the action is safe.\n   The number of devices supported by LineageOS has increased over time, with 157 for 17.1 and 18.1 as of April 1, 2021 .  [9]  [48] Official builds on currently supported development branches are labeled as &#34;nightly&#34;. For the first two months of the project, parallel experimental builds were also produced, allowing in-place upgrades from previous CyanogenMod installations and easing migration to LineageOS.  [48]  [49]  [50]  [51]\n   LineageOS was criticized for a deceptive  April Fool&#39;s prank included with some April 2018 builds.  [52]\n During the first week of April 2018 LineageOS released new builds with the &#34;LOSGenuine&#34; prank that informed unaware users of the software possibly being counterfeit via a persistent notification (which could not be disabled unless the user ran the following command in a root shell):\n  When the notification was tapped, the software claimed that the device was &#34;uncertified&#34; and needed to mine &#34;LOSCoins&#34;, which were a virtual currency and could not actually be spent. Affected builds also had a preinstalled &#34;Wallet&#34; app that showed the current balance of LOSCoins.  [52]\n Many users mistook the prank for actual  malware, and others reportedly found it to be in &#34;poor taste&#34;. It was especially criticized for being too &#34;late&#34; for an April Fool&#39;s joke, since many users didn&#39;t receive the update until days later, making the jest less obvious. On 10 April 2018, LineageOS team director  ciwrl issued an official apology for the deceptive prank.  [53]  [54]\n  Replicant is a completely free software variant of LineageOS, with all kernel blobs and non-free drivers removed.\n As a response to the refusal for several reasons of support for signature spoofing in official builds,  [55] a LineageOS fork with  microG  [56] services included, known as &#34;LineageOS for microG&#34;, was created. The project ships custom builds of LineageOS with the required patch and native  F-Droid support, bundled with the MicroG project&#39;s  free re-implementation of proprietary  Gapps.  [57]  [58] In other respects it follows upstream, shipping OTA updates every fourteen days.  [59]\n /e/ is a fork of LineageOS created by  Gaël Duval that is intended to be &#34;free from  Google&#34;. It replaces  Google Play Services with  microG, a  free and open-source implementation of Google  APIs.  [60]\n     ^     a     b     c     d   LineageOS.  &#34;Changelog 25&#34;.  lineageos.org .   {{ cite web}}: CS1 maint: url-status ( link)\n   ^    Heater, Brian (24 December 2016).  &#34;After having its infrastructure shuttered, CyanogenMod will live on as Lineage&#34;.   TechCrunch .\n ^     &#34;A fork in the road&#34;.  CyanogenMod. 24 December 2016. Archived from  the original on 25 December 2016 .\n  ^    Gallagher, Sean Gallagher (27 December 2016).  &#34;Cyanogen Inc. shuts down CyanogenMod in Christmas bloodbath&#34;.  Ars Technica. Ars Technica.\n    ^     &#34;LineageOS now has one million users, OnePlus One is the most popular device&#34;.  Androidauthority.com. 20 March 2017 .\n ^     a     b    Helft, Miguel.  &#34;Meet Cyanogen, The Startup That Wants To Steal Android From Google&#34;.  Forbes .\n ^    Soyars, Chris (21 March 2011).  &#34;CM Stats explanation&#34;. Archived from  the original on 4 June 2016 .\n ^    CyanogenMod [@CyanogenMod] (12 January 2012).  &#34;CyanogenMod just passed 1 million active users&#34; (Tweet)  – via Twitter.\n  ^    Reed, Brad (18 September 2013).  &#34;With $7 million in funding, Cyanogen aims to take on Windows Phone&#34;.   Boy Genius Report .\n  ^    Ruddock, David (28 November 2016).  &#34;Cyanogen Inc. will shutter Seattle office by end of year, more layoffs happening, Kondik could be out&#34;.  Android Police .  Kondik was removed from the company&#39;s board, allegedly\n ^    CyanogenMod [@CyanogenMod] (25 December 2016).  &#34;UPDATE: As of this morning we have lost DNS and Gerrit is now offline — with little doubt as a reaction to our blog post yesterday. Goodbye&#34; (Tweet)  – via  Twitter.\n ^     &#34;Themes Support&#34;. CyanogenMod. 19 February 2011. Archived from  the original on 21 October 2016 .\n ^     a     b     &#34;Cyanogenmod promises to never include apps like Carrier IQ&#34;. Computer-Howto. 5 December 2011. Archived from  the original on 19 April 2016.\n ^     &#34;Video: CyanogenMod founder Steve Kondik talks Android&#34;.  UnleashThePhones.com. 6 July 2012. Archived from  the original on 5 February 2013 .\n    ^    LineageOS.  &#34;Changelog 16 - Smart Styles, Treble is trouble and Omfg Oreo&#34;.  www.lineageos.org .\n    ^     a     b    LineageOS.  &#34;Changelog 24&#34;.  lineageos.org .   {{ cite web}}: CS1 maint: url-status ( link)\n           ^    Siddharth Chauhan (7 February 2017).  &#34;How to: Install Lineage OS on your smartphone&#34;.  In.pcmag.com .  As far as user interface goes, Lineage OS presents a clean and bloatware free stock Vanilla Android experience but still has some tricks up its sleeve.\n          ^    Rigg, Jamie (24 January 2017).  &#34;The first builds of CyanogenMod successor LineageOS are out&#34;.   Engadget .\n ^     a     b     &#34;Don&#39;t freak out: LineageOS has a very bad and very late April Fools&#39; joke in latest builds&#34;.  Android Police. 5 April 2018 .\n  ^     &#34;LineageOS apologizes for late and &#39;bad taste&#39; April Fools&#39; joke&#34;.  Android Police. 10 April 2018 .\n  ^  &#34;  microG provides a free version of the set of APIs equivalent to Google’s proprietary core libraries and applications.&#34;\n    ^    Filippone, Dominique (19 September 2018).  &#34;Eelo : l&#39;OS mobile open source de Gaël Duval sort en bêta - Le Monde Informatique&#34;.  LeMondeInformatique (in French) .", "posttime": "2022-02-14 11:03:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "天堂,lineageos,设备", "title": "天堂", "title_en": "LineageOS", "transed": 1, "url": "https://en.wikipedia.org/wiki/LineageOS", "via": "", "real_tags": ["天堂", "lineageos", "设备"]}]