[{"category": "", "categoryclass": "", "imagename": "acd7a1d003d62b77d28e2738d08350c1.jpg", "infoid": 1005953, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Tuva项目是2009年与比尔·盖茨合作的一个重要合作研究项目，通过突出理查德·费曼的信使讲座系列的“核心科学概念”，展示了互动学习和视频学习的潜力。发布后，七场讲座中的第一场：万有引力定律-物理定律的例子，通过交互式可视化、可搜索成绩单的链接、集成的笔记功能和其他功能而栩栩如生。Silverlight应用程序已于2016年完全停用，但理查德·费曼的视频仍可在下面找到。详情请点击此处了解更多信息。", "note_en": "Project Tuva was a collaborative research project with  Bill Gates in 2009 demonstrating the potential of interactive video learning by highlighting the “core scientific concepts” of Richard Feynman’s Messenger Lectures Series. Upon release, the first of the seven lectures: The Law of Gravitation – An Example of Physical Law, was brought to life with interactive visualizations, links to searchable transcripts, integrated note taking capabilities and other features. The Silverlight application was retired in 2016, but the Richard Feynman videos are still available below.   Learn more.", "posttime": "2020-06-10 10:46:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "费曼,feynman,定律", "title": "理查德·费曼的“信使”系列视频讲座", "title_en": "Richard Feynman’s Messenger Lecture Series on Video", "transed": 1, "url": "https://www.microsoft.com/en-us/research/project/tuva-richard-feynman", "via": "", "real_tags": ["费曼", "feynman", "定律"]}, {"category": "", "categoryclass": "", "imagename": "b5af0c9611095fff8b9ca32099b6110f.jpg", "infoid": 1005951, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们非常高兴地宣布Linkerd 2.8的发布！此版本为Linkerd引入了一个新的多集群扩展，允许它跨Kubernetes集群建立连接，这些连接对应用程序是安全的、透明的，并且可以与任何网络拓扑一起工作。我们相信这是目前可用的安全Kubernetes多集群连接最简单的选择。2.8版本还使Linkerd在附加系统的开始变得更加模块化，并引入了各种其他特性和稳定性改进。\nLinkerd2.8；的新的多群集功能意味着Linkerd现在可以跨群集边界连接Kubernetes服务，其方式安全、对应用程序完全透明，并且独立于网络拓扑。正如我们在前面的帖子中所讨论的，此多群集功能旨在满足一些关键目标：\n提供统一的信任域。源和目标工作负载的身份必须在每个步骤进行验证，无论是在群集边界内还是跨群集边界都是如此。\n支持异构网络。由于集群可以跨越云、私有网络、内部数据中心及其组合，因此Linkerd不应引入网关连接以外的任何L3/L4要求。\n提供具有群集内通信的统一模型。Linkerd为群集内通信提供的相同的可观察性、可靠性和安全性特性应该扩展到这种新的跨群集通信。\n就像集群内连接一样，Linkerd的跨集群连接对应用程序代码是透明的。群集西部上的服务A可以简单地通过将其直接寻址为C.East，或者通过将其寻址为C并使Linkerd自动将该服务的业务路由(或甚至仅转移一部分)到群集东部，来与群集东部上的服务C对话。无论通信是发生在群集内、数据中心或vPC内的群集之间，还是通过公共Internet，Linkerd都会在两端都使用mTLS加密和验证的群集之间建立连接。\n这一新的多群集功能解锁了Linkerd的一整套使用案例，包括故障转移(在出现故障的情况下跨数据中心或云传输流量)、“反向多租户”(每个租户都拥有自己的群集)、混合云(工作负载可以在内部和云环境之间移动，而不会影响应用程序的其余部分)等等。\n最后，与所有Linkerd功能一样，Linkerd的多集群“服务镜像”方法尽可能多地利用现有的Kubernetes功能，并添加最少的额外机器。远程服务直接表示为Kubernetes服务；没有引入新的CRD；配置复杂性保持在最低限度。\n我们很高兴地报告，我们在大使项目的朋友们已经创建了多群集集成，允许大使用户利用大使部署作为Linkerd的多群集网关！在大使的博客帖子中了解更多信息。\n2.8版还引入了一个简单的附加系统，用于添加(或删除！)。Linkerd提供的功能捆绑包。Linkerd 2.8带有两个附加组件的船舶：\n一个Jaeger附加组件，它添加了Jaeger和oc收集器组件，用于收集和显示分布式跟踪到您的集群。\n在未来，我们将把更多的功能转移到附加组件中，例如，允许您删除默认的普罗米修斯安装，并将其替换为您自己的-或者可能根本不安装。\nLinkerd 2.8还提供了大量其他改进、性能增强和错误修复，包括：\n我们相信Linkerd的核心价值是连通性--在云的原生世界中，连通性不仅仅意味着“A和B可以交换数据包”，更重要的是“A和B可以以一种方式交换数据包，这种方式可以验证双方的身份；具有明确的授权语义；对第三方是保密的；并且是可测量和可检查的”。\n当我们展望未来时，我们看到Linkerd创建这种连接的能力-将其转换为Kubernetes基础设施的安全平面。2.8版标志着朝着这个方向迈出了重要的一步，接下来的几个版本将充实Linkerd的功能集，包括将mTLS扩展到所有连接、引入策略等等。请继续关注这个话题的更多内容。\n准备好试用Linkerd了吗？那些通过我们每周的EDGE版本跟踪2.x分支的人应该已经看到了这些功能在运行中。无论哪种方式，您都可以通过运行以下命令下载稳定的2.8版本：\n用头盔？请参阅我们的使用Helm安装Linkerd的指南。是否从以前的版本升级？我们已经为您介绍了：有关如何使用Linkerd升级命令，请参阅我们的Linkerd升级指南。\nLinkerd是一个社区项目，由云本地计算基金会托管。Linkerd致力于开放政府。如果您有专题请求、问题或意见，我们非常欢迎您加入我们快速增长的社区！Linkerd托管在GitHub上，我们在Slake、Twitter和邮件列表上有一个蓬勃发展的社区。快来加入我们的行列吧！", "note_en": "We&#39;re very happy to announce the release of Linkerd 2.8! This release introducesa new multi-cluster extension to Linkerd, allowing it to establish connectionsacross Kubernetes clusters that are secure, transparent to the application, andwork with any network topology. We believe this is the simplest option forsecure Kubernetes multi-cluster connectivity available today. The 2.8 releasealso makes Linkerd more modular with the beginnings of an  add-on system, andintroduces a variety of other features and stability improvements.\n   Linkerd 2.8&#39;s new  multi-cluster feature means thatLinkerd can now connect Kubernetes services across cluster boundaries in a waythat&#39;s secure, fully transparent to the application, and independent of networktopology. As discussed in our earlier posts,this multi-cluster feature is designed to meet some critical goals:\n Providing a unified trust domain. The identity of source and destinationworkloads must be validated at every step, both in and across clusterboundaries.\n  Supporting heterogeneous networks. Since clusters can span clouds, VPCs,on-premises data centers, and combinations thereof, Linkerd should notintroduce any L3/L4 requirements other than gateway connectivity.\n Providing a unified model with in-cluster communication. The sameobservability, reliability, and security features that Linkerd provides forin-cluster communication should extend to this new cross-clustercommunication.\n Just as with in-cluster connections, Linkerd&#39;s cross-cluster connections aretransparent to the application code. A service  A on cluster  west can talk toa service  C on cluster  east simply by addressing it directly as  C.east, orby addressing it as  C and having Linkerd automatically route (or even shiftjust a portion of) traffic for that service to cluster  east. Regardless ofwhether that communication happens within a cluster, across clusters within adatacenter or VPC, or across the public Internet, Linkerd will establish aconnection between clusters that&#39;s encrypted and authenticated on both sideswith mTLS.\n  This new multi-cluster functionality unlocks a whole host of use cases forLinkerd, including failover (transitioning traffic across datacenters or cloudin the presence of failure); “inverted multi-tenancy” (each tenant gets theirown cluster); hybrid cloud (workloads can move between on-premises and cloudenvironments without affecting the rest of the application); and more.\n Finally, like all Linkerd features, Linkerd&#39;s “service mirroring” approach tomulti-cluster leverages as much existing Kubernetes functionality as possibleand adds the bare minimum of additional machinery. Remote services arerepresented directly as Kubernetes services; no new CRDs are introduced; andconfiguration complexity is kept to a bare minimum.\n  We&#39;re happy to report that our friends at the Ambassador project have alreadycreated a multi-cluster integration, allowing Ambassador users to leverageAmbassador deployments as Linkerd&#39;s multi-cluster gateway! Learn more in the Ambassador blog post.\n  The 2.8 release also introduces a simple  add-on system for adding (orremoving!) bundles of functionality from Linkerd. Linkerd 2.8 ships with twoaddons:\n A Jaeger add-on, which adds the Jaeger and oc-collector components forcollecting and displaying distributed tracing to your cluster.\n In the future we&#39;ll be moving more functionality into add-ons, allowing you to,for example, remove the default Prometheus installation and replace it with yourown–or potentially with none at all.\n  Linkerd 2.8 also has a tremendous list of other improvements, performanceenhancements, and bug fixes, includng:\n    We believe that Linkerd&#39;s core value is  connectivity–and that in a cloudnative world, connectivity doesn&#39;t just mean “A and B can exchange packets”, butrather “A and B can exchange packets in a way that validates the identity onboth sides; has clear authorization semantics; is confidential to third parties;and is measurable and inspectable”.\n As we look ahead, we see Linkerd&#39;s ability to create this connectivitytransforming it into the  security plane for your Kubernetes infra. The 2.8release marks a major step forward in that direction, and the next severalreleases will flesh out Linkerd&#39;s featureset, including by extending mTLS to allconnections; introducing policy; and much more. Stay tuned for lots more on thistopic.\n  Ready to try Linkerd? Those of you who have been tracking the 2.x branch via our weekly edge releases will already have seen thesefeatures in action. Either way, you can download the stable 2.8 release byrunning:\n  Using Helm? See our guide to installing Linkerd with Helm.Upgrading from a previous release? We&#39;ve got you covered: see our Linkerd upgrade guide for how to use thelinkerd upgrade command.\n  Linkerd is a community project and is hosted by the Cloud Native Computing Foundation. Linkerd is committed to open governance.If you have feature requests, questions, or comments, we&#39;d love to have you joinour rapidly-growing community! Linkerd is hosted on GitHub, and we have a thriving community on Slack,  Twitter, andthe  mailing lists. Come and join the fun!", "posttime": "2020-06-10 10:28:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "集群,secure,linkerd", "title": "Linkerd 2.8：简单、安全的多集群Kubernetes", "title_en": "Linkerd 2.8: simple, secure multi-cluster Kubernetes", "transed": 1, "url": "https://linkerd.io/2020/06/09/announcing-linkerd-2.8/", "via": "", "real_tags": ["集群", "secure", "linkerd"]}, {"category": "", "categoryclass": "", "imagename": "a8f0b9a3bb971e0add42b0d5d2e5d31c.jpg", "infoid": 1005950, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我想用一篇文章来谈谈默会知识，以及为什么我认为它是技能习得领域中最有趣的话题。如果你是一个长期的普通读者，你很可能以前就遇到过这个想法，因为我在过去已经写过很多次了。但我认为用一整篇文章来讨论这个话题仍然是个好主意。\n我认为写这篇文章很重要的原因是，每次我谈到隐性知识的话题，不可避免地会有人在Twitter、黑客新闻、Reddit或电子邮件上出现，抗议隐性知识不存在。每当我遇到这样说的人时，我都想要一些链接，这样我就不必重复自己的话了。\n我认为探索什么是默会知识还有另一个原因：默会知识确实存在，而理解它的存在是你可以拥有的最有用的事情之一。一旦你明白了默会知识的存在，你就会开始看到任何技能树的很大一部分本质上都是默契的，这意味着你可以去寻找它，这反过来又意味着你可以开始问一个真正有用的问题，当涉及到专业知识的时候，那就是：那个人拥有它；那个人真的很擅长它；我怎么也能拥有它？\n想想骑自行车吧。骑自行车是不可能通过描述来教的。当然，你可以试着解释一下你在骑车的时候在做什么，但是当你在教孩子的时候，当你告诉他们“保持平衡！”而他们掉进排水沟的时候，这不会有多大帮助。试想一下，你是在走钢丝和平衡！“。\n毫无疑问，会有人说，如果你能更好地解释，如果你能找到合适的词来和你的学生交谈，你就可以教他们骑自行车。如果你碰巧相信这个…。好吧，我劝你自己去验证一下这个理论。去找几个孩子(或成年人！)。那些还没有学会骑自行车的人，看看你是否能教他们--仅靠你的讲解的力量！--如何骑自行车而不擦伤他们的胫骨。如果你成功了，要对自己挑剔：你的成功有多少要归功于骑车人自己想出来的？有多少是你的口头指示造成的呢？\n这一解释值得注意。在教育学中，这被称为“传播主义”，在严肃的教育家中，它被视为与今天你和我可能对地球平面理论有着相同类型的嘲弄。大概是这样的：有些人相信通过给别人讲解东西来教授技术是可能的。他们认为，如果你能找到正确的词语组合和正确的类比；如果你真的能把事情分解成正确的原子细节水平，事情就会奇迹般地在他们的学生脑海中闪现，他们就会成功。这样的人很可能从来没有认真地尝试过这样做。如果你是这样的人，那么我希望你能在某个时候开始执教，在一项我感兴趣的运动中，这样我的孩子就可以和你的孩子比赛，然后我就可以看着他们彻底摧毁你的孩子。\n你是如何教授默会知识的？就此而言，你是怎么教骑自行车的？\n当我还是个孩子的时候，我自学如何骑自行车…。纯属意外。然后我教了我的姐妹们，然后是我的表弟，然后是附近的另一个孩子，他很感兴趣，但有点害怕。他们每个人都在放大大约一个小时。具体步骤如下：\n选择一辆小自行车，它比你的学习者的身体小得多，因此离地面不远。这对学习者很有用，因为他们随时都能踏踏实实地自救。离地面不远也不那么可怕。\n让他们用腿推，再往前走一小段距离，同样是双脚离地面只有几英寸。反复这样做，推开，双脚放下，然后停下来重复。\n加大推力，拉长距离。最终，他们将用几十秒的时间抬起双脚滑行。这里的目标是让他们了解在自行车上保持平衡的感觉。\n在其中一个滑梯上，一旦他们觉得准备好了(可能有点无聊-关键是让他们多次做第三步，让他们感到安全并渴望继续前进)-嗯，一旦你到了那个点，告诉他们开始兜售。\n请注意，其中涉及的口头指导非常少。更重要的是仿真和行动-也就是说，关注成功骑自行车所必需的具体化的情感。这个练习对我来说非常神奇，因为在一个小时内我可以看到一个孩子从有意识的无能到有意识的能力，最后到无意识的能力。\n换句话说，默会知识教学是通过模仿、模仿和学徒等方式进行的。你通过盲目模仿大师的做法来学习，直到你将行为背后的原则内在化。\n你可能看到这个就会想：“啊，这对像自行车、网球和柔道这样的体能运动很管用，但是更多的脑力运动呢？”对此，我要说：默会知识无处不在。研究员萨莫·布尔贾举例解释了默契知识：他称之为“创造伟大艺术或评估初创公司的能力(…)”。例如木工、金属加工、家政、烹饪、舞蹈、业余公开演讲、流水线监督、快速解决问题和心脏手术。\n如果你是一名知识型员工，隐性知识对你专业领域的发展比你想象的要重要得多。\n我花了几年时间才意识到，我教人骑自行车的方法包含了许多可能适用于其他领域的原则。\n在我之前的工作中，我的技术主管Hieu有一种不可思议的能力，可以参加需求会议，并在几分钟内草拟出一个程序结构，这将是最简单的解决方案，移动部件最少。这个草图经常是我们最终实现的，然而我注意到Hieu总是为任何软件项目带来的不可避免的变化留出足够的回旋余地。当我设计实现时，总要在以后重新设计一些东西。我就是没那么好。最后，我问他是怎么做到的，在我们一起工作的这些年里，我多次试图让他说出这一点。我们的谈话不可避免地会是这样的：\n“嗯，”Hieu会开始说，“当你听说有一个外部API时，你应该把你的程序的重点放在这一点上，因为那里有很大的风险。”\n“是啊，但是你为什么不担心日历API呢？”\n“哦，因为我以前用过它，而且我认为它很容易实现。”\n“因为我们想把它用作数据库层。风险很大啊。“。\n“但是你为什么不担心库存API呢？我们以前从未整合过这一点。“。\n“是的，我想那件事现在已经不那么重要了。客户稍后可能会更改它。或者，也许我们的功能将会改变。我们先做基本的工作。“\n我回想起我的Viki时代，当时我还是一名软件工程实习生，第一次编写软件测试。一位高级软件工程师花了几秒钟的时间看了看我写的大约一百行代码，然后说：“哦，那不太好，这以后会有问题的。它是这样构建的。“。\n我问他，他是怎么在五秒钟内就知道情况不好的。他就软件工程原理给我作了很长的解释。我挥手让他走开，问他是怎么在5秒内做到的。他说：“嗯，感觉就是对的。好的，我们去吃午饭吧，你可以事后再安排。“。\n我已经在我的关于知觉学习的帖子中写到了这段Viki插曲。我并不是说Hieu或高级软件工程师不能解释他们的判断，也不是说他们不能清楚地说明他们用来评估十几个变量之间权衡的原则：他们可以。我的观点是，他们的解释不会把我引向他们所拥有的能力。\n为甚麽会这样呢？好了，再来看看我们的对话。当我敦促这些人做出判断时，他们会试图从原则或启发式的角度进行解释。但我推动的越多，我发现的例外、警告和潜在的陷阱就越多。\n这实际上是可以概括的。在任何足够复杂的领域，有专业知识的人总是这样解释他们的专业知识：“嗯，做X。除了当你看到Y的时候，然后做Z，因为A。如果你看到B，那就做P。但是如果你看到A和C，但没有看到B，那么就做Q，因为原因D。然后有一些奇怪的情况，你做了Z，然后看到C出现了，那么你就应该切换到Q。”\n如果你再往前推，最终他们可能会说“啊，感觉就是对了。坚持足够长的时间，你也会觉得这是对的。“。\n最终我意识到，学习Hieu技术的方法是模仿他：设计一些软件，然后征求他的反馈。我意识到，如果你曾经听到有人用一长串警告来解释事情，你很有可能看到的是行动中的默契。\n这一现象在专门知识的研究中实际上是根深蒂固的。它也被其他领域的从业者写了很多次。举个例子，这里是外科医生阿图尔·加万德(Atul Gawande)在做阑尾炎手术：\n假设你有个病人需要做阑尾炎手术。如今，外科医生通常会做腹腔镜阑尾切除术。你通过肚脐附近四分之一英寸的切口将一个小型相机-腹腔镜-滑入腹部，通过腰围下方的切口插入一个长把手，然后推动一个用于装订和切割的设备通过左下腹的切口进行缝合和切割。用抓手拿起手指大小的阑尾，用订书机穿过底部和供养它的血管，把切下的器官放进塑料袋里，然后把它拉出来。合上门，你就完了。不管怎么说，这就是你想要的。但通常不是这样的。甚至在你开始之前，你就需要做出一些判断。不寻常的解剖结构，严重的肥胖，或以前腹部手术留下的内部疤痕，都可能使相机很难安全进入；你不想把它戳进肠环。你必须决定使用哪种相机插入方法-有一系列选择-或者是放弃高科技方法，以传统的方式进行手术，用一个大开的切口让你直接看到一切。如果你把相机和仪器放进去，你可能抓不住阑尾。感染会使它变成一条肥大的、血淋淋的、发炎的蠕虫，粘附在它周围的一切-肠道、血管、卵巢、骨盆侧壁-要释放它，你必须从各种工具和技术中进行选择。你可以用一个长长的棉头乐器来试着推开周围的附着物。你可以使用电灼器、钩子、剪刀、尖头解剖器、钝尖解剖器、直角解剖器或吸引器。你可以调整手术台，使病人的头向下，双脚向上，让重力将内脏拉向正确的方向。或者你可以抓住阑尾的任何可见部分，用力拉。一旦你看到了这个小器官，你可能会发现阑尾炎是错误的诊断。它可能是阑尾肿瘤，克罗恩病，或者碰巧使附近的阑尾发炎的卵巢疾病。然后你必须决定是否需要额外的设备或人员-也许是时候招募另一名外科医生了。随着时间的推移，你会学会如何避免问题，当你做不到的时候，你会以更少的笨拙和更有把握的方式得出解决方案。八年过去了，我已经做了两千多个手术。四分之三涉及我的专业-内分泌外科-内分泌器官的手术，如甲状腺、甲状旁腺和肾上腺。其余的涉及从简单的活组织检查到结肠癌的方方面面。对于我的专业案例，我已经了解了大多数可能出现的严重困难，并制定了解决方案。对于其他人，我对自己处理各种情况的能力以及在必要时即兴发挥的能力获得了信心。\n请注意Gawande在解释他的专业知识时是如何包含各种警告的。这很可能是行动中的默契。学习这类复杂的判断--这种即时的解决方案选择碰巧在几十个考虑因素之间相互权衡--这才是值得学习的。光靠讲解几乎是不可能学会的。\n重新检查上面最后一句话是值得的。从原则上讲，是否有可能将隐性知识外化到一系列指令中呢？也许我们可以把专家的决策提取到一个多分支的过程中，并将其编码到一个“专家系统”中。或者我们可以把它变成一个过程列表，然后给这个领域的每一个从业者，而不是让他们以传统的方式学习隐性知识。\n对这个问题的一致回答似乎是：“是的，原则上可以这样做。在实践中，这是非常困难的。“。我对此的看法是，这太难了，我们甚至不应该费心去读这篇文章；假设你读这篇文章是因为你想在你的职业生涯中取得成功，你应该放弃把隐性知识变成显性知识，而只是追求隐性知识本身。\n在20世纪70年代，许多组织-其中包括美国军方-委托进行了一系列研究，以探讨建立各种专家系统以增强或取代人类特工的可能性。用专家系统取代人类的想法在当时有点时髦，就像神经网络在今天的炒作列车上大行其道一样，但自那以后的几十年里，专家系统已经被抛在了一边。\n在这股风潮之后，许多研究人员发现，要将人类专家的所有可能的分支、理解和细微差别编码到专家系统中是极其困难的。\n赎罪日战争结束后不久，这些项目之一就是将以色列飞机维修的日志录入美国数据库，目标可能是取代飞机维修。\n你可以眯着眼睛看到这一结果在同一时期在许多组织、许多领域重复出现。(维基百科称这个问题为“知识获取问题”，这是一种很好的表达方式；它最终导致了专家系统受欢迎程度的下降)。正如人们很快发现的那样，从一开始就想把“规则”从专家的头脑中去掉并不是那么容易的事。\n当然，还有其他的反对意见。克莱因现在被认为是心理学自然主义决策(NDM)分支的先驱之一，他喜欢说过度依赖程序会让人类操作员变得脆弱(第15章，权力的来源)。换句话说，盲目地给人们一份要执行的程序清单，会剥夺他们积累专业知识的能力，这反过来又会阻止他们进行专家操作员中常见的创造性问题解决。这也意味着，当某件事出了大问题--现实世界中总是出了大问题--他们将无法适应。\n有没有迹象表明，这并不是一个完全没有希望的企业？是的，事实证明有以下几点：\n我有一些从事人工智能研究的朋友认为，专家系统有可能卷土重来，或许是通过使用更现代的人工智能方法。\n加里·克莱因自己也因开发提取隐性知识片段并使其显性化的技术而声名鹊起。(这项技术被称为“关键决策方法”，但它很难实现，因为它需要CDM本身的专业知识)。\n对于一个特别有天赋的人来说，有时有可能把整个领域的隐性知识综合成一种有效而明确的教学方法。可以说，约翰·博伊德(John Boyd)在美国空军的第一本战斗机战术手册中做到了这一点--以前人们认为斗狗是一种无法组织成明确原则的艺术。但博伊德还是设法做到了这一点，经过几年的教学和整整一年的写作。\n所有这些观点都是正确的，值得思考--但我认为，它们是否大体上正确无关紧要。你可能会说：“事实上，既然所有的默会知识都是可以显性表达的，那么就没有默会知识这回事了”--但这是一种迂腐的做法，我对此并不感兴趣。等待专家系统复兴是不合理的，期望CDM应用于您的领域，或者等待博伊德式的天才出现也不是有成效的。我们应该像隐性知识是事实一样行事，因为思考如何直接获得隐性知识更有用，而不是希望通过某种突破口将隐性知识显性化。\n这对我们意味着什么？这意味着，如果我们想要在我们的领域追求专业知识，我们应该开始研究已发表的关于默会知识的研究。\n“等等，”我听到你说，“那刻意练习的领域呢？”这不就是最关心专业知识发展的主导性子领域吗？“。而这个问题的答案是否定的，它不是。\n在我对“爱立信的巅峰”的评论中，在我对刻意练习的问题的总结中，我解释说，刻意练习的定义只有在具有悠久教育学历史的领域才是可能的。换句话说，刻意练习只能存在于音乐、数学和国际象棋等领域。\nK·安德斯·爱立信(K.Anders Ericsson)在“巅峰”(Peak)一书中阐述了这个狭隘的定义，然后进行了回避，他辩称，尽管他没有研究过此类领域之外的实践，但来自刻意实践的想法可能会应用于教育学上较不成熟的领域。但爱立信很清楚NDM方法的存在-他是编辑之一，与许多来自NDM社区的名字一起-为专业知识和专家性能编写剑桥手册。\n因此，如果你是一名程序员、设计师或商人、投资者或作家，正在阅读有关刻意实践的文章，你可能会问：“那么，我的领域呢？如果我没有既定的教学技巧怎么办？“。如果你已经开始问这个问题，那么你已经开始走一条更有趣的路了。\n..", "note_en": "I want to spend an essay talking about tacit knowledge, and why I think it is  the most interesting topic in the domain of skill acquisition. If you are a longtime Commonplace reader, you’ll likely have come across this idea before, because I’ve written about it  numerous  times  in  the  past. But I think it’s still good idea to dedicate a whole piece to the topic.\n The reason I think it’s important to write this piece is because every time I touch on the topic of tacit knowledge, inevitably someone will pop up on Twitter or Hacker News or Reddit or email and protest that tacit knowledge doesn’t exist. I want something to link to whenever I come up against someone who says this, mostly so that I don’t have to repeat myself.\n There is one other reason I think it is good to explore what tacit knowledge is: tacit knowledge  does exist, and understanding that it does exist is one of the most useful things you can have happen to you. Once you understand that tacit knowledge exists, you will begin to see that big parts of  any skill tree is tacit in nature, which means that you can go hunting for it, which in turn means you can start to ask the really useful question when it comes to expertise, which is: that person has it; that person is really good at it; how can I have it too?\n   Think about riding a bicycle. Riding a bicycle is impossible to teach through descriptions. Sure, you can  try to explain what it is you’re doing when you’re cycling, but this isn’t going to be of much help when you’re teaching a kid and they fall into the drain while you’re telling them to “BALANCE! JUST IMAGINE YOU ARE ON A TIGHTROPE AND BALANCE!”.\n Undoubtedly there will be people who say that if you just explain better, if you could find the right  words to talk to your students, you can teach them to ride bikes. If you happen to believe this … well, I urge you to test this theory yourself. Go find a couple of kids (or adults!) who haven’t yet learned to ride a bike and see if you can teach them — through the power of your explanations alone! — how to cycle without scraping their shins. And if you are successful,  be critical with yourself: how much of your success is due to the bike rider figuring it out on their own? And how much of it is due to your verbal instructions?\n This explanation bit deserves some attention. In pedagogy, this is known as ‘ transmissionism’, and it is regarded amongst serious educators with the same sort of derision you and I might have about flat-earth theories today. It goes something like this: some people believe that it is possible to teach technique by  explaining things to others. They think that if you can find just the right combinations of words with the right sorts of analogies; if you can really break things down into the right level of atomic details, things will magically click in their students’s heads and they will succeed. Such people have likely never attempted to do so in a serious manner. And if you are one such person, then I hope that you pick up coaching at some point, in a sport that I am interested in, so that my kids can go up against your kids, and then I get to watch as  they absolutely crush yours.\n How do you teach tacit knowledge? How do you teach bike riding, for that matter?\n When I was a kid, I taught myself how to ride a bike … by accident. And then I taught my sisters and then my cousin and then another kid in the neighbourhood who was interested but a little scared. They were zooming around in about an hour each. The steps were as follows:\n Pick a small bike, much smaller than the body of your learner, and therefore not far off the ground. This is useful for the learner because they will be able to put their feet down and save themselves at any moment. It’s also less scary to be not far off the ground.\n Have them push with their legs and go forward a short distance, again with their feet only inches off the ground. Do this repeatedly, by pushing off, putting both feet down, then stopping and repeating.\n Make the pushes harder and the distances longer. Eventually, they will spend tens of seconds gliding with their feet held up. The goal here is have them learn how it feels like to balance on a bike.\n On one of those glides, once they feel ready (and likely a little bored — the point is to get them to do step 3 so many times that they’re feeling secure and eager to move on) — well, once you reach that point, tell them to start peddling.\n Notice how little verbal instruction is involved. What is more important is emulation, and action — that is, a focus on the embodied feelings necessary to ride a bicycle successfully. And this exercise was quite magical for me, for within the span of an hour I could watch a kid go from conscious incompetence to conscious competence and finally to unconscious competence.\n In other words, tacit knowledge instruction happens through things like imitation, emulation, and apprenticeship. You learn by copying what the master does, blindly, until you internalise the principles behind the actions.\n You might see this and think “ahh, this works for physical things like cycling and tennis and Judo, but what about more cerebral things?” To which I say: tacit knowledge exists all around us. Researcher Samo Burja explains tacit knowledge by way of example: he  calls it “the ability to create great art or assess a startup (…) examples include woodworking, metalworking, housekeeping, cooking, dancing, amateur public speaking, assembly line oversight, rapid problem solving, and heart surgery.”\n If you are a knowledge worker, tacit knowledge is a lot more important to the development of your field of expertise than you might think.\n  It took me years before I realised that my method of teaching people to bicycle contained a number of principles that might be applicable to other domains.\n In my previous job, my technical lead, Hieu, had an uncanny ability to sit in on requirements meetings and, within minutes, sketch out a program structure that would be the simplest possible solution with the fewest moving parts. That sketch was often the one we ended up implementing, and yet I noticed that Hieu always left enough wiggle room for the inevitable changes that came with any software project. When I designed implementations, something always had to be redesigned later. I simply wasn’t as good. Eventually, I asked him how he did this, and tried multiple times to get it out of him over the years we worked together. Our conversations would inevitably go something like the following:\n “Well” Hieu would begin, “When you hear there is an external API, you should focus your program around that because there is a lot of risk there.”\n “Yeah but then why didn’t you worry about the calendar API?”\n “Oh, because I’ve worked with it before and I think it is easy to implement.”\n  “Because we want to use it as a database layer. Quite risky ah.”\n   “But how come you didn’t worry about the inventory API? We’ve never integrated with that before.”\n “Ya that one not that important now I think. The client might change it later. Or maybe our feature is going to change. We do the basics first.”\n I thought back to my Viki days, when I was a software engineering intern and was writing software tests for the first time. A senior software engineer took a few seconds to look at about a hundred lines of code I’d written, and said “Oh, that’s not good, this would be a problem later. Structure it this way.”\n I asked him how he knew, within five seconds, that it was bad. He gave me a long explanation about software engineering principles. I waved him away and asked how he did it  in five seconds. He said “Well, it just  felt right. Ok, let’s go to lunch, you can fix it afterwards.”\n I’ve written about this Viki episode in my  post about perceptual learning. I don’t mean to say that Hieu or the senior software engineer couldn’t explain their judgment, or that they couldn’t make explicit the principles they used to evaluate the tradeoffs between a dozen or so variables: they could.  My point is that their explanations would not lead me to the same ability that they had.\n Why is this the case? Well, take a look at the conversation again. When I pushed these people on their judgments, they would try to explain in terms of principles or heuristics. But the more I pushed, the more exceptions and caveats and potential gotchas I unearthed.\n This is actually generalisable. People with expertise in any sufficiently complicated domain will always explain their expertise with things like: “Well, do X. Except when you see Y, then do Z, because A. And if you see B, then do P. But if you see A and C but not B, then do Q, because reason D. And then there are weird situations where you do Z but then see thing C emerge, then you should switch to Q.”\n And if you push further, eventually they might say “Ahh, it just feels right. Do it long enough and it’ll feel right to you too.”\n Eventually I realised that the way to learn Hieu’s techniques was to copy him: to design some software and then ask for his feedback. And I realised that if you ever hear someone explaining things in terms of a long list of caveats, the odds are good that you’re looking at tacit knowledge in action.\n This phenomenon is actually well established in the study of expertise. It has also been written about, many times, by practitioners in other fields. As an example, here’s surgeon Atul Gawande on  appendicitis surgery:\n Say you’ve got a patient who needs surgery for appendicitis. These days, surgeons will typically do a laparoscopic appendectomy. You slide a small camera—a laparoscope—into the abdomen through a quarter-inch incision near the belly button, insert a long grasper through an incision beneath the waistline, and push a device for stapling and cutting through an incision in the left lower abdomen. Use the grasper to pick up the finger-size appendix, fire the stapler across its base and across the vessels feeding it, drop the severed organ into a plastic bag, and pull it out. Close up, and you’re done. That’s how you like it to go, anyway. But often it doesn’t.  Even before you start, you need to make some judgments. Unusual anatomy, severe obesity, or internal scars from previous abdominal surgery could make it difficult to get the camera in safely; you don’t want to poke it into a loop of intestine. You have to decide which camera-insertion method to use—there’s a range of options—or whether to abandon the high-tech approach and do the operation the traditional way, with a wide-open incision that lets you see everything directly. If you do get your camera and instruments inside, you may have trouble grasping the appendix. Infection turns it into a fat, bloody, inflamed worm that sticks to everything around it—bowel, blood vessels, an ovary, the pelvic sidewall—and to free it you have to choose from a variety of tools and techniques. You can use a long cotton-tipped instrument to try to push the surrounding attachments away. You can use electrocautery, a hook, a pair of scissors, a sharp-tip dissector, a blunt-tip dissector, a right-angle dissector, or a suction device. You can adjust the operating table so that the patient’s head is down and his feet are up, allowing gravity to pull the viscera in the right direction. Or you can just grab whatever part of the appendix is visible and pull really hard.  Once you have the little organ in view, you may find that appendicitis was the wrong diagnosis. It might be a tumor of the appendix, Crohn’s disease, or an ovarian condition that happened to have inflamed the nearby appendix. Then you’d have to decide whether you need additional equipment or personnel—maybe it’s time to enlist another surgeon.  Over time, you learn how to head off problems, and, when you can’t, you arrive at solutions with less fumbling and more assurance. After eight years, I’ve performed more than two thousand operations. Three-quarters have involved my specialty, endocrine surgery—surgery for endocrine organs such as the thyroid, the parathyroid, and the adrenal glands. The rest have involved everything from simple biopsies to colon cancer. For my specialized cases, I’ve come to know most of the serious difficulties that could arise, and have worked out solutions. For the others, I’ve gained confidence in my ability to handle a wide range of situations, and to improvise when necessary.\n Notice how Gawande includes all sorts of caveats in his explanation of his expertise. This is probably tacit knowledge in action. Learning this type of complicated judgment — this instantaneous solution selection that happens to balance dozens of considerations against each other — this is what is valuable to learn. And it is almost impossible to learn it through explanation alone.\n   It is worth it to re-examine that last sentence, above.  Could it — in principle — be possible to externalise tacit knowledge into a list of instructions? Perhaps we could extract expert decision-making into a multi-branched process, and code that into an ‘expert system’. Or perhaps we could turn it into a process list, and give that to every practitioner in the field, instead of having them learn tacit knowledge the traditional way.\n The consensus answer to that question seems to be: “Yes, in principle it is possible to do so. In practice it is very difficult.” My take on this is that it is  so difficult that we shouldn’t even bother; assuming that you are reading this because you want to get good in your career, you should give up on turning tacit knowledge into explicit knowledge and just go after tacit knowledge itself.\n  In the 1970s, a bunch of organisations — amongst them the US military — commissioned a number of studies to look into the possibility of building out all sorts of expert systems to augment or replace human agents. This notion of replacing humans with expert systems was a bit of a fad at the time, the same way that neural networks are big on the hype train today, but expert systems have fallen to the wayside in the decades since.\n What many researchers found in the wake of that fad was that it is extremely difficult to encode  all the possible branches and gotchas and nuances from a human expert into an expert system.\n One of these projects, commissioned shortly after the Yom Kippur war, was to enter log books for Israeli aircraft maintenance into a US database, with the goal of perhaps replacing aircraft maintenance officers with an expert system. And a young researcher at the time — by the name of Gary Klein — was tasked with the job of interviewing aircraft maintenance officers to get at the core of their expertise.\n  “I could fill out 80% of the forms, but the other 20% ... maybe something was left blank … or maybe there was an error. And then I would interview them and ask “how did you fill this in?”  And then they (the maintenance officers) said: “OK look at this damage. Look at the size of the damage. And then the plane was back in service two days later. Now for this kind of damage, I know, if it severed any of these lines, it’s going to take a week or two (to repair). So obviously it didn’t sever those lines. So here’s the way the damage must have propagated, that they could get it back in service (so quickly).”  In other words, these guys could go beyond the logbooks, and imagine what it was like to be a maintenance technician, working on these kinds of problems.  (…) So when I wrote my report, the report was: here’s what I could do that was formulaic, but here are the critical incidents that I collected, so you can understand their expertise. And as a result the Air Force decided they could not build an expert system to replace these guys, and they had to keep paying them.”\n You can sort of squint and see this result being repeated across many organisations, in many domains, during the same period. (Wikipedia calls this problem the ‘ knowledge acquisition problem’, which is a nice way of putting it; it was what ultimately caused expert systems to decline in popularity). As people rapidly discovered, it wasn’t so easy to get the ‘rules’ out of experts’s heads in the first place.\n But there are other objections, of course. Klein — now considered one of the pioneers of the Naturalistic Decision Making (NDM) branch of psychology — likes to say that over-reliance on procedures makes human operators fragile (Chapter 15,   Source of Power). In other words, giving people a list of procedures to execute, blindly, denies them the ability to build expertise, which in turns prevents them from doing the sorts of creative problem solving that is common amongst expert operators. It also means that when something goes drastically wrong — and something  always goes drastically wrong in the real world — they would not be able to adapt.\n Are there indications that this isn’t a completely hopeless enterprise? Yes, it turns out there are:\n I have friends in artificial intelligence research who argue that it  is possible for expert systems to make a comeback, perhaps by using more contemporary AI methods.\n Gary Klein himself has made a name developing techniques for extracting pieces of tacit knowledge and making it explicit. (The technique is called ‘The Critical Decision Method’, but it is difficult to pull off because it demands expertise in CDM itself).\n It is sometimes possible for a particularly gifted person to synthesise an entire field’s worth of tacit knowledge into an effective and explicit method of instruction. Arguably,  John Boyd did this with the first fighter tactics manual for the US Air Force — where before people thought that dogfighting was an art that couldn’t be organised into explicit principles. But Boyd somehow managed to do so anyway, after a couple of years of teaching, and a full year of writing.\n All of these points are valid, and worth thinking about — but whether or not they turn out to be generally correct is irrelevant, I think. You may say “actually, since all tacit knowledge can be made explicit, there is no such thing as tacit knowledge” — but that is a pedantic exercise that is uninteresting to me. It is not reasonable to wait for an expert systems revival, nor is it fruitful to expect CDM to be applied to your field, or for a Boyd-like genius to appear. We should act as if tacit knowledge were a fact, because it is more useful to think about ways to gain that tacit knowledge directly, instead of hoping for some breakthrough to make tacit knowledge explicit.\n  What does this mean for us? It means that we should start looking into the published research on tacit knowledge if we want to pursue expertise in our fields.\n “But wait,” I hear you say — “What about the field of deliberate practice? Isn’t  that the predominant subfield most concerned with the development of expertise?” And the answer to that is  no, it is not.\n In my review of Ericssons’   Peak, and in my summary of  The Problems with Deliberate Practice, I explained that deliberate practice is defined as possible  only in domains with a long history of well-established pedagogy. In other words, deliberate practice  can only exist in fields like music and math and chess.\n K. Anders Ericsson lays out this narrow definition in  Peak, and then does a cop-out, arguing that while he hasn’t studied practice outside of such domains, the ideas from deliberate practice may be applied to pedagogically less established fields. But Ericsson is well aware that NDM methods exist  — he was one of the editors, alongside many names from the NDM community — who worked on the   Cambridge Handbook for Expertise and Expert Performance.\n And so if you are a programmer, or designer, or businessperson, an investor or a writer reading about deliberate practice, you may be asking: “Well, what about  my field? What if there are no established pedagogical techniques for me?” And if you have started to ask this question, then you have begun travelling a more interesting path\n......", "posttime": "2020-06-10 10:26:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "默会,knowledge,可能", "title": "默会知识是实实在在的东西", "title_en": "Tacit Knowledge Is a Real Thing", "transed": 1, "url": "https://commoncog.com/blog/tacit-knowledge-is-a-real-thing/", "via": "", "real_tags": ["默会", "knowledge", "可能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005949, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英联邦国家将免费获得卫星技术，这些技术将帮助它们监测和保护其濒临灭绝的珊瑚礁，使其免受气候崩溃、过度捕捞和污染等威胁。\n英联邦国家拥有世界上剩余的热带珊瑚礁的近一半，54个成员国中有47个拥有海岸线。其中近一半是岛屿或岛屿群，它们面临着气候危机的特别威胁，对它们来说，珊瑚礁往往是抵御风暴的重要保护地，以及鱼类苗圃和旅游景点。\n英联邦秘书长帕特里夏·苏格兰男爵夫人(Baroness Patricia Scotland)表示：“作为一个英联邦大家庭，无论我们做什么，都将为保护我们在全球范围内依赖的珊瑚礁做出巨大贡献。”“我们在世界各地都感受到了这种真正的责任。英联邦可以改变这场危机的轨迹，如果我们的成员国愿意共同努力，我们也会这样做。“。\n随着气候危机的蔓延，未来几十年几乎所有的珊瑚礁都面临灭绝的危险，在过去的30年里，由于气候变化、过度捕捞、污染和其他开发，世界上近一半的珊瑚礁已经被破坏或严重破坏。大约2.5亿人直接依赖珊瑚礁维持生计。\n这项技术将使用高分辨率卫星图像和数据分析，使海洋科学家、政府官员和政策制定者能够监测珊瑚礁的健康状况，并采取必要的行动来保护它们。软件将通过英联邦与Vulcan Inc的合作伙伴关系免费提供给各国，Vulcan Inc是一家由微软联合创始人兼慈善家保罗·艾伦创立的总部位于美国的组织，一张新的互动珊瑚礁地图将在英联邦创新中心在线托管。\n苏格兰在接受英国“卫报”采访时表示：“(各国)需要数据来了解他们在紧张的预算内能做些什么。”“能够分享信息将激励我们。”\n她说，气候和生态危机，以及冠状病毒大流行，需要采取紧急行动，海洋健康是全球生态系统的关键部分。“世界在对我们说，‘我不能呼吸了，’”她说。“当我们停止[开发它]时，自然会非常迅速地自我恢复。但我们的时间不多了。“。\n英联邦将于周一(指定为世界海洋日)开放该项目的演示，因为世界各国都在寻求改善本国水域和公海的管理。\n在英国，政府周一发布了一份关于海洋保护的审查报告，建议建立新的高度保护的海洋区域，在那里将禁止捕鱼、疏浚、石油钻探、建筑和所有其他形式的开采。\n英国目前有一个由355个海洋保护区组成的“蓝带”网络，在这些区域，捕鱼等活动受到限制。由前渔业部长理查德·贝尼恩(Richard Benyon)领导的这项审查将要求扩大这些区域，设立新的区域，除了通过该地区的航运和水肺潜水和皮划艇等无害的休闲活动外，一切都将是禁区。\n野生动物信托基金(Wildlife Trusts)海洋保护主任琼·爱德华兹(Joan Edwards)表示，让大片海域恢复自然状态可能是一个启示，让海洋生物在经历了数十年的过度开发后得以恢复。“我们的海洋是贫瘠的，我们这一代人很难理解我们的海水曾经是多么丰富。鳕鱼曾经和人类的身高一样长和宽，鲸鱼、海豚和晒鲨比现在常见很多倍，“她说。“我们需要让大海向我们展示它的能力。”\n根据活动人士的说法，今天的海洋保护区只能维持对一些最具破坏性的活动的基本保护，比如海底拖网捕捞，而且保护措施因地点而异。\n部长们尚未对贝尼昂审查的结果做出回应。英国绿色和平组织的海洋活动家菲利普·埃文斯(Philip Evans)表示：“重要的是，这些建议不仅要成为现实，而且要有更大的雄心，到2030年覆盖英国至少30%的水域，而不是坐在部长们的办公桌上尘土飞扬。”\n英国政府目前正与欧盟就英国退欧后的捕鱼权展开争斗。英国渔民辩称，几十年来，英国在20世纪70年代加入欧盟时达成的协议赋予了外国船只更大的通行权，这使得他们几十年来一直处于不利地位，结果是，英国一些水域的大部分渔获量现在都流向了欧盟船队。但作为任何英国退欧协议的一部分，欧盟希望保留其船只进入英国水域的权利，否则几个成员国的捕鱼船队将受到影响。\n活动人士担心，在争吵中，欧盟和英国停止过度捕捞并遵守关于捕获量的科学建议的承诺将会丢失。", "note_en": "Commonwealth countries are to gain free access to satellite technology that will help them monitor and protect their  endangered coral reefs from threats such as climate breakdown, overfishing and pollution.\n Commonwealth countries hold nearly half of the world’s remaining tropical  coral reefs, with 47 out of the 54 member countries having a coastline. Nearly half of them are islands or groups of islands, which face particular threats from the climate crisis, and for whom coral reefs are often vital protections against storms as well as fish nurseries and tourist attractions.\n “Whatever we do as a Commonwealth family will make a massive contribution to safeguarding the coral reefs that we are dependent on globally,” said  Baroness Patricia Scotland, secretary general of the Commonwealth. “We feel this real responsibility around the world. The Commonwealth can change the trajectory of this crisis, if our members are willing to work together, and we will.”\n Nearly all the reefs are at risk of extinction in the coming decades as the climate crisis takes hold, and nearly half of the world’s reefs have already been destroyed or badly damaged in the last 30 years owing to changes in the climate, overfishing, pollution and other exploitation. About 250 million people are directly dependent on coral reefs for their livelihoods.\n  The technology will use high-resolution satellite images and data analyses to allow marine scientists, government officials and policymakers to monitor the health of coral reefs and take the action needed to protect them. Software will be provided to countries free through the Commonwealth’s partnership with Vulcan Inc, a US-based group founded by Microsoft co-founder and philanthropist Paul Allen, and a new interactive coral reef map will be hosted online at the Commonwealth Innovation Hub.\n “[Countries] need data to know what they can do within their tight budgets,” Scotland told the Guardian in an interview. “Being able to share information will galvanise us.”\n She said the climate and ecological crises, as well as the coronavirus pandemic, required urgent action, and the health of the oceans was a key part of the global ecosystem. “The world is saying to us, ‘I can’t breathe,’” she said. “When we stop [exploiting it], nature restores itself very rapidly. But we have not got a lot of time.”\n The Commonwealth will open up a  demonstration of the project on Monday, designated as World Oceans Day, as countries around the world seek to improve the management of their own waters and the high seas.\n In the UK, the government on Monday published a review of ocean protections that has recommended setting up new highly protected marine areas, where fishing, dredging, oil drilling, construction and all other forms of exploitation would be banned.\n  The UK currently has a  “blue belt” network of 355 marine protected areas, where activities such as fishing are restricted. The review, led by former fisheries minister Richard Benyon, would require these to be expanded with new zones where everything would be off limits, except for shipping moving through the area and non-damaging leisure activities such as scuba diving and kayaking.\n Joan Edwards, director of marine conservation at the  Wildlife Trusts, said letting stretches of sea return to their natural state could be a revelation, in allowing marine life to recover after decades of overexploitation. “Our seas are in an impoverished state, and it’s hard for our generation to comprehend how abundant our waters once were. Cod were once as long and wide as humans are tall, and whales, dolphins and basking sharks were many times more common than they are today,” she said. “We need to let the sea show us what it’s capable of.”\n Today’s marine protected areas serve only to  maintain basic protections against some of the most damaging activities, such as bottom trawling, according to campaigners, and the protections vary across locations.\n Ministers have yet to respond to the Benyon review’s findings. Philip Evans, an oceans campaigner at Greenpeace UK, said: “It’s important that these recommendations not only become a reality, but grow in ambition to cover at least 30% of the UK’s waters by 2030, instead of sitting on ministers’ desks gathering dust.”\n The government is currently  locked in a battle with the EU over fishing rights after Brexit. British fishermen argue that they have been  disadvantaged for decades by agreements reached when the UK was joining the EU in the 1970s that gave greater access rights to foreign vessels, with the result that the majority of the catch in some UK waters now goes to EU fleets. But as part of any Brexit deal, the EU wants to preserve access to British waters for its vessels, as the  fishing fleets in several member states would suffer otherwise.\n Campaigners are concerned that amid the squabbles, the pledges by both the EU and the UK to  halt overfishing and abide by scientific advice on catch size will be lost.", "posttime": "2020-06-10 10:11:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "国家,nations,英国", "title": "英联邦国家将利用卫星技术保护珊瑚礁", "title_en": "Commonwealth Nations To Protect Coral Reefs With Satellite Technology", "transed": 1, "url": "https://www.theguardian.com/environment/2020/jun/08/commonwealth-nations-to-protect-coral-reefs-with-satellite-technology", "via": "", "real_tags": ["国家", "nations", "英国"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005947, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "除非你一直生活在岩石下，否则你知道多年来媒体几乎一直在尖叫着说，由于新的人工智能技术，特别是深度学习，我们进入了一场巨大的自动化革命，伴随着巨大的就业岗位流失。媒体援引了许多“专家”的说法，几乎每家管理咨询公司都觉得有必要发布相关报告，这个话题在美国民主党总统候选人辩论中也被提了出来。\n去年12月，我和凯勒·肖尔(Keller Scholl)发表了一篇工作论文，认为至少到目前为止，整个故事都是胡说八道。由一种新的自动化技术驱动的自动化革命应该会导致自动化总量和自动化速度的变化，以及各种工作的自动化程度更高。但看看1999-2019年美国所有的工作岗位，我们发现更有可能实现自动化的工作类型没有任何变化。我们甚至没有看到整体自动化水平的净变化，尽管语言习惯可能掩盖了这些变化。而且，让一项工作变得更加自动化与其工资或就业的变化丝毫不相关。(在狭窄的类别中可能会有影响，比如使用机器人的工作，但在所有自动化的总体水平上看不到任何影响。)。\n由试图预测哪些作业将很快实现自动化的团队创建的两个指标确实预测了过去的自动化，但不是在我们包括了25个平凡的作业特性(如由设备速度确定的速度和重复相同任务的重要性)之后，这两个指标加在一起预测了作业自动化的一半以上的差异。过去二十年的主要变化可能是工作任务逐渐变得更适合自动化，因为附近的任务已经自动化。\n到目前为止，我们的论文没有受到媒体的关注，尽管它与许多相当高知名度的媒体炒作相矛盾，这些炒作仍在以同样的速度继续下去。它现在已经正式发表在一家受人尊敬的同行评议期刊：经济学快报上。这会不会引起更多的媒体报道？可能不会，因为大多数其他论文在经过同行审查之前都得到了媒体的关注。模式似乎是，炒作被掩盖了，而相互矛盾的炒作紧缩却没有。当然，除非通缩出自某个足够有声望的人之手。\n写“经济快报”时，我们必须把报纸压缩得很厉害。以下是新的40字摘要：\n从1999年到2019年，工资和就业预测了832个美国工作岗位的自动化，但对前25个O*净工作功能几乎没有增加，它们的最好预测模型在此期间没有改变。自动化的变化既不会预测工资的变化，也不会预测就业的变化。\n25个简单的作业特征解释了作业自动化程度的一半以上的差异。", "note_en": "Unless you’ve been living under a rock, you know that for many years the media has been almost screaming that we entering a big automation revolution, with huge associated job losses, due to new AI tech, especially deep learning. The media has cited many “experts” making such claims, most every management consulting firm has felt compelled to issue a related report, and the subject came up in the Democratic US presidential debates.\n Last December, Keller Scholl and I  posted a  working paper suggesting that this whole narrative is  bullshit, at least so far. An automation revolution driven by a new kind of automation tech should induce changes in the total amount and rate of automation, and in which kinds of jobs get more automated. But looking at all U.S. jobs 1999-2019, we find no change whatsoever in the kinds of jobs more likely to be automated. We don’t even see a net change in overall level of automation, though language habits may be masking such changes. And having a job get more automated is not correlated at all with changes in its pay or employment. (There may be effects in narrow categories, like jobs that use robots, but nothing visible at the overall level of all automation.)\n Two metrics created by groups trying to predict which jobs will get automated soon did predict past automaton, but not after we included 25 mundane job features like  Pace Determined By Speed Of Equipment and  Importance of Repeating Same Tasks, which together predict over half of the variance in job automation. The main change over the last two decades  may be that job tasks have gradually become more suitable for automation, because nearby tasks have become automated.\n Our paper has so far received  zero media attention, even though it contradicts a lot of quite high visibility media hype, which continues on at the same rate. It has now been officially  published in a respected peer reviewed journal:  Economics Letters. Will that induce more media coverage? Probably not, as most of those other papers got media attention before they were peer reviewed. The patterns seems to be that hype gets covered, contradictory deflations of hype do not. Unless of course the deflation comes from someone prestigious enough.\n For  Economics Letters we had to greatly compress the paper. Here is the new 40 word abstract:\n Wages and employment predict automation in 832 U.S. jobs, 1999 to 2019, but add little to top 25 O*NET job features, whose best predictive model did not change over this period. Automation changes predict changes in neither wages nor employment.\n  25 simple job features explain over half the variance in which jobs are how automated.", "posttime": "2020-06-10 10:09:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "自动化,automation", "title": "没有最近的自动化革命", "title_en": "No Recent Automation Revolution", "transed": 1, "url": "http://www.overcomingbias.com/2020/06/no-recent-automation-revolution.html", "via": "", "real_tags": ["自动化"]}, {"category": "", "categoryclass": "", "imagename": "9e79d60dcf570c47f30ba23cc9c4593d.jpeg", "infoid": 1005946, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "PermalLink GitHub是5000多万开发人员的家园，他们一起工作，共同托管和审查代码、管理项目和构建软件。\n报名。\n属于LVFS(Linux供应商固件服务)的悬挂S3存储桶。悬挂存储桶被fwupd版本&lt；1.0.6(2018年发布)的默认配置引用。\n综上所述，这些漏洞将允许声称拥有S3存储桶的攻击者向运行旧版fwupd的Linux台式机和服务器提供恶意固件更新。\n绕过PGP验证存在于fwupd 1.4.0之前的版本中，以及fwupd从1.4.0开始使用的libjcat中。通过向后移植https://github.com/fwupd/fwupd/commit/21f2d12，，可以在1.4.0之前的fwupd中修复该漏洞，在1.4.0及更高版本的fwupd中，可以使用包含https://github.com/hughsie/libjcat/commit/839b89f的libjcat修复该漏洞。\n尽管悬而未决的S3存储桶只影响具有旧配置的fwupd客户端，但这些客户端的安装基数很大。例如，Debian Stretch(目前是oldtable&34；)仍然发布了一个引用存储桶的版本。在26天的时间里，S3存储桶收到了来自500,000多个唯一IP地址的250多万个更新请求。\n下图显示了每周每小时看到的平均更新请求数。\nGNOME-SOFTWARE通常每天刷新一次fwupd数据，第一张图中的24小时周期性流量模式反映了这一点。第二张图中的每日更新请求数约为100,000(不包括周末)，因此我估计至少有100,000个唯一的fwupd客户端到达悬而未决的S3存储桶。\n尽管存在悬而未决的S3存储桶问题，签名绕过漏洞仍可被以下攻击者利用：\n在公共fwupd元数据存储库(如LVFS)中处于特权位置；或。\n在本地元数据镜像(如属于企业的镜像)中处于特权位置。\n一些Linux发行版，如Red Hat Enterprise Linux(RHEL)，据报道没有附带包含LVFS元数据存储库的配置。\nfwupd不会自动为用户安装固件更新-用户必须手动接受更新。\n固件安装只能使用在fwupd本身内实现的规定协议来完成。在固件安装期间，更新不可能执行自定义代码，例如专有闪存实用程序。但是，该漏洞确实能够向以超级用户身份运行的XMLparser和.cab文件解析器提供恶意输入。这些代码路径没有被彻底检查。\n一些硬件设备执行自己的固件更新的片上验证(基于硬件供应商自己持有的密钥)，这可以防止安装一些恶意固件映像。\n2015年4月-发布fwupd 0.1.2；包括引入Pgp签名验证绕过漏洞(https://github.com/fwupd/fwupd/commit/36a8890))的提交\n2016年8月-发布fwupd 0.7.3；包括指示客户端计算机从lvfsbucket S3存储桶(https://github.com/fwupd/fwupd/commit/96e1ea6))下载固件元数据的提交。\n2018年3月-发布fwupd 1.0.6；包括指示客户端计算机离开lvfsbucket S3存储桶(https://github.com/fwupd/fwupd/commit/4ee0836))的提交。\n2018年11月-报告显示，lvfsbucket S3存储桶返回未找到文件的404&34；个错误(https://bugs.debian.org/cgi-bin/bugreport.cgi?bug=912414)。\n2019年11月-这是LVFS项目声称删除S3存储桶的时候。\n2020年4月-fwupd 1.4.0发布；包括从pgp签名转向jcat签名(https://github.com/fwupd/fwupd/commit/d5aab65))的提交。\n2020年5月28日-fwupd项目收到悬挂式S3存储桶和签名绕过漏洞的通知。\n2020年5月29日-lvfsbucket s3桶移交给fwupd项目保管。\n2020年5月30日-就libgpgme中的边缘案例处理与GnuPG项目联系\n2020年6月2日-GnuPG项目响应-这不会被认为是libgpgme中的错误。\n2020年6月10日-对本建议进行了更新(供应商参考和GnuPG的文档更改)。\n附录附录A-S3桶接管+绕过签名验证的理论攻击场景。\n允许硬件供应商上传固件更新的安全门户。所有主要的Linux发行版都使用该站点来提供元数据工具，如fwupdmgr和GNOME软件。\n固件更新文件(.cab文件)的URL，这些文件可以直接托管在LVFS上，也可以托管在第三方网站上。\n元数据将发布为名为firware.xml.gz的文件。可以使用使用LVFS PGP密钥(0x48A6D80E4538BAC2)或签名包(PGP和PKCS7)生成的分离PGP签名来验证此文件，本建议稍后将对此进行说明。\n一个简单的守护进程，允许会话软件更新本地计算机上的设备固件。它专为台式机设计，但也可用于手机和无头服务器。您可以使用GNOMESoftware之类的GUI软件管理器、命令行工具或System D-Businterface直接查看和应用更新。\n检查来自存储库(如LVFS)的固件元数据的PGP(fwupd&lt；1.4.0)或jcat(fwupd&&gt;=1.4.0)签名\n通知用户元数据中描述的可用于其硬件的固件更新，例如BIOS或Thunderbolt控制器更新。\n固件安装通过在fwupd内实现的有限数量的协议进行，例如DFU或FASTBOOT(https://fwupd.org/lvfs/docs/metainfo/protocol).。重要的是，单个固件更新不可能在用户机器上运行自定义代码，例如专有的闪存实用程序。\n在LVFS内，固件供应商适用于LVFS，并被授予上载某些硬件供应商-id值(https://blogs.gnome.org/hughsie/2019/12/11/improving-the-security-model-of-the-lvfs/))的固件元数据的权限。\nLVFS将所有供应商的元数据整理到一个文件(firware.xml.gz)中，该文件包括每个.cab文件的加密散列。\nLVFS对此文件进行签名以生成分离的PGP签名(firware.xml.gz.asc)和jcat(PGP&amp；&amp；PKCS7)签名(firware.xml.gz.jcat)。\n在客户端计算机上，客户端实用程序通过D-BUS将每个文件的文件描述符发送给Fwupd，以执行更新元数据操作(例如https://github.com/fwupd/fwupd/blob/1.4.1/libfwupd/fwupd-client.c#L1420-L1466)。\nFWUPD检查分离的PGP(例如，https://github.com/fwupd/fwupd/blob/1.3.9/src/fu-keyring-gpg.c#L279-L316)或JCAT签名)，这建立了信任锚。元数据包含各个固件更新的加密散列(例如，SHA)，并且元数据作为一个整体由LVFS签名。此模式(包含单个校验和的已签名元数据)类似于APT模型(https://wiki.debian.org/SecureApt#Secure_apt_groundwork：_checksums)。\n假设签名验证成功，fwupd使用AppStream组件规范(https://lvfs.readthedocs.io/en/latest/metainfo.html))的子集解析XML元数据\nfwupd根据firware.xml.gz中的散列验证.cab文件的加密散列，将其解包，然后刷新固件。\nFirmware.xml.gz描述各种硬件设备可用的更新，提供每个更新(.cab文件)的下载URL，并提供.cab文件的加密散列。\n如果固件.cab文件的散列与firware.xml.gz中列出的散列匹配，并且固件.xml.gz的签名正确，则可以认为该.cab文件是可信的。\n考虑这样一种情况：攻击者控制了firware.xml.gz的内容，并且可以对文件签名或绕过签名验证过程。攻击者可能会广告各种共享软件产品的恶意固件更新。如果用户选择安装恶意更新，攻击者可能会危害用户的硬件，破坏用户系统的完整性。\nfwupd版本附带固件存储库的URL，如LVFS。这些URL应从其中下载有关固件更新的信息。\n此更改发生在Commit https://github.com/fwupd/fwupd/commit/4ee0836(28(2018年2月)，以允许LVFS项目从AmazonS3迁移到替代CDN。\n据报道，某些Linux发行版(例如Red Hat Enterprise Linux)没有附带配置为使用LVFS元数据URL的fwupd。\n2018年11月(https://github.com/fwupd/fwupd/issues/831))向该项目报告，从旧URL下载失败，出现404个错误。该项目的解决方案是让用户更新fwupd；或修改他们的发行版以支持修复。针对Debian Stretch的漏洞(目前是老版本)于2018年10月在https://bugs.debian.org/cgi-bin/bugreport.cgi?bug=912414上开放，在撰写本文时尚未解决。\n离开Amazon S3托管安排后，LVFS项目删除了lvfsbucket S3存储桶。LVFS项目在披露过程中通知我，S3存储桶在2019年11月被删除。\n删除存储桶后，任何AmazonAWS客户都可以免费注册。然后，注册存储桶的用户将收到来自运行遗留fwupd客户端的用户的呼叫总部更新请求。\n我在2020年5月注册了存储桶，并启用了存储桶上的S3访问日志记录(https://docs.aws.amazon.com/AmazonS3/latest/dev/ServerLogs.html)。\n在26天的时间里，S3存储桶收到了来自500,000多个唯一IP地址的250多万个更新请求。\n请注意，在I控制S3存储桶期间，没有从存储桶发布任何内容。对于向其发出的每个请求，存储桶都返回&#34；403禁止&#34；。\n要使用这些原语，我们将需要使用受信任的LVFS密钥对firware.xml.gz进行签名；否则，我们将需要一种方法来绕过签入fwupd的PGP签名。\n悬挂的S3吊桶已经转移到LVFS项目。LVFS项目应保持对此存储桶的控制，直到不再在现场安装旧版本的fwupdale。在安全删除存储桶之前，不应删除该存储桶。\nfwupd&lt；1.4.0中基于PGP的元数据签名验证存在漏洞，可以可靠地绕过。由任何密钥签名的任何未分离的签名都将使验证逻辑失效。\n鉴于此漏洞，声称上述悬空S3存储桶或将自己置于fwupd客户端和元数据存储库之间的攻击者可能已经向fwupd客户端提供了签名的恶意固件更新信息。\n该漏洞取决于分离的和非分离的PGP签名之间的差异。附录A提供了关于PGP签名类型的入门读物。\n以fwupd 1.3.9中的签名验证码为例。\n/*加载文件数据*/[snip-将元数据数据读入&#39；data&#39；]//[snip-将元数据签名读入&#39；sig&#39；]/*Verify*/rc=gpgme_op_ify(self&gt；ctx，sig，data，null)；if(rc！=gpg_err_no_error){g_set_error(error，FWUPD_ERROR，FWUPD_ERROR。无法验证数据：%s&#34；，gpgme_strerror(Rc)；返回NULL；}/*验证结果*/RESULT=gpgME_OP_VERIFY_RESULT(Self&gt；CTX)；IF(RESULT==NULL){g_set_error_cripal(ERROR，FWUPD_ERROR，FWUPD_ERROR_INTERNAL，&#34；；libgpgme&#34；没有结果记录)；Return NULL；}/*Look。s！=null；s=s-&gt；Next){g_debug(&#34；返回签名指纹%s&#34；，s-&&gt;；fpr)；如果(！fu_keyring_gpg_check_sign(s，error))return null；/*保存结果的密钥详细信息*/if(Gint64)s-&gt；timeamp&gt；timeamp_newest){timeamp_newest=(Gint64)s-&gt；timeamp；timeamp；g_string_assign(Authority_newest，s-&gt；fpr)；}}return Fu_keyring_result(g_object_new(Fu_type_。，TIMESTAMP_NEWEST，&#34；AUTHORITY&#34；，AUTHORITY_NEWEST-&gt；字符串，NULL))；}。\n签名验证由gpgme_op_Verify()完成，gpgme_op_Verify()由libgpgme提供，并记录在https://www.gnupg.org/documentation/manuals/gpgme/Verify.html中。\n结果中的签名被循环。对于每个签名，如果fu_keyring_gpg_check_sign()不满意(例如，公钥未知；签名不正确；签名密钥过期)，则验证失败。\n提供一些数据(XML)和sig(Asc)数据，它们：使gpgme_op_verify_result()(上面的步骤2)成功并返回零签名的结果。\n由于没有签名，因此将完全跳过for循环(上面的步骤3)，因此不会调用fu_keyring_gpg_check_sign()，这允许我们跳过细粒度签名检查\n由于GPGme(GnuPG MadeEasy)中的边缘情况，当GPGme(GnuPG MadeEasy)试图像验证分离签名一样验证正常签名时，我们能够执行此攻击。\n显式检查结果-&&gt;签名是否是非零(即，gpgme_op_ify()至少观察到一个签名)；和/或。\n反转单个签名验证逻辑。目前，代码进行检查以确保没有错误的签名。相反，更安全的做法是确保至少有一个好的签名。这是Flatpak https://github.com/flatpak/flatpak/blob/1.7.2/common/flatpak-oci-registry.c#L2073-L2085)采取的方法。\nGPGme由GnuPG项目提供。它是一个包装gpg命令行实用程序并向软件开发人员公开GnuPG功能的库。\n当它验证分离的PGP签名时(fwupd通常是这种情况)：\n在验证普通或明文PGP签名时，纯文本应该是一个可写数据对象，它将包含验证成功后的明文&#34；\n虽然fwupd通常使用gpgme来验证分离的PGP签名，但在恶意情况下不能保证这一点-攻击者可以为签名文件提供任何数据。\n任何作为SIGNED_TEXT的数据(这是对gpgme的一个提示，即应该分离sig)\n如果赋予的是fwupd不知道签名密钥的分离签名，则验证码会正确拒绝签名，如下所示：\n/*Verify*/rc=gpgme_op_Verify(self&gt；ctx，sig，data，null)；IF(rc！=GPG_ERR_NO_ERROR){g_set_error(ERROR，FWUPD_ERROR，FWUPD_ERROR_INTERNAL，&#34；，gpgme_strerror(Rc))；返回NULL；}/*验证结果*/result=gpgme_op。IF(RESULT==NULL){g_SET_ERROR_TEXAL(ERROR，FWUPD_ERROR，FWUPD_ERROR_INTERNAL，&#34；无libgpgme&#34；的结果记录)；return null；}/*[+]调试跟踪gdb-peda$print*result$1={签名=0x5593c66668b0，file_name=0x0，is_mime=0x0，_unuse=0x0}g.。签名$2={NEXT=0x0，摘要=GPGME_SIGSUM_KEY_MISSING，fPR=0x5593c666d290&#34；88C202B687A57ED3D0109BAFAC92351AF277A464&#34；，Status=0x9，NOTIONS=0x0，TIMESTAMP=0x5ecf199e，EXP_TIMESTAMP=0x0，WRONG_KEY_USAGE=0x0，PKA_TRUST=0x0，CHAIN_MODEL=0x0，IS_DE_VS=0x0，_UNUSED=0x0，VALIDATION=GPGME_VALITY_UNKNOWN，VALIDATION_REASON=0x0，pubkey_algo=GPGME_PK_RSA，HASH_ALGO=。key=0x0}*//*查看每个签名*/(s=result-&gt；签名；s！=null；s=s-&&gt;；Next){g_debug(&#34；返回签名指纹%s&#34；，s-&&gt;；fpr)；如果(！fu_keyring_gpg_check_sign(s，error))return null；/*保存结果的密钥详细信息*/if(Gint64)s-&gt；timeamp&gt；timeamp_newest){timeamp_newest=(Gint64)s-&gt；timeamp；timeamp；g_string_assign(Authority_newest，s-&gt；fpr)；}}return Fu_keyring_result(g_object_new(Fu_type_。，TIMESTAMP_NEWEST，&#34；AUTHORITY&#34；，AUTHORITY_NEWEST-&gt；字符串，NULL))；}。\n调用gpgme_op_verify_result()返回一个签名的列表，我们可以看到该签名的摘要是GPGME_SIGSUM_KEY_MISSING，这将使fu_keyring_gpg_check_sign()在细粒度检查forloop中不愉快。\n将这与如果我们给出一个fwupd仍然不知道签名密钥的非分离签名所发生的情况进行比较。验证码错误接受签名，如下所示：\n/*Verify*/rc=gpgme_op_Verify(self&gt；ctx，sig，data，null)；IF(rc！=GPG_ERR_NO_ERROR){g_set_error(ERROR，FWUPD_ERROR，FWUPD_ERROR_INTERNAL，&#34；，gpgme_strerror(Rc))；返回NULL；}/*验证结果*/result=gpgme_op。IF(RESULT==NULL){g_SET_ERROR_TEXAL(ERROR，FWUPD_ERROR，FWUPD_ERROR_INTERNAL，&#34；无libgpgme&#34；的结果记录)；return null；}/*[+]调试跟踪gdb-peda$print*result$3={签名=0x0，文件名=0x0，is_mime=0x0，_unuse=0x0}*//*查看每个签名*。s=s-&gt；Next){g_debug(&#34；返回签名指纹%s&#34；，s-&gt；fpr)；如果(！fu_keyring_gpg_check_sign(s，error))return null；/*保存结果的密钥详细信息*/if(Gint64)s-&gt；timeamp&gt；timeamp_newest){timeamp_newest=(Gint64)s-&gt；timeamp；timeamp；g_string_assign(Authority_newest，s-&gt；fpr)；}}return Fu_keyring_result(g_object_new(Fu_type_。，TIMESTAMP_NEWEST，&#34；AUTHORITY&#34；，AUTHORITY_NEWEST-&gt；字符串，NULL))；}。\n这将导致忽略细粒度的for循环检查，因此根本不会调用fu_keyring_gpg_check_sign()。验证函数将错误地返回成功结果。\n顺便说一句，在Fwupd项目的公开过程中，项目注意到https://github.com/fwupd/fwupd/commit/f69a4810中添加的回滚/重放保护应该可以阻止这种攻击。在零签名的情况下(例如我们可以触发的情况)，验证过程将向调用函数返回默认时间戳值0，并且调用函数应该将该值作为arollback尝试来拒绝。\n然而，对于验证函数返回时间戳为0的情况，在https://github.com/fwupd/fwupd/commit/f69a4810#diff-300ca38c94199c9239dc835920e466ecR1550there是一个特定的分割。这使此特定情况的回滚保护失效。\n严格来说，这并不是回滚保护中的漏洞，撇开签名验证绕过不谈，攻击者尝试回滚攻击时，将会重播LVFS签名的旧元数据。此重放签名将始终具有与其关联的时间戳，因此攻击者应该不能触发时间戳为0的恶意回滚攻击。\n此反回滚错误已通过披露过程中的https://github.com/fwupd/fwupd/pull/2150during修复。它破坏了本建议中描述的利用漏洞，并可能破坏任何针对此漏洞的利用。但是，此反回滚修复程序不应被视为绕过漏洞的根本原因修复程序。\n说得非常清楚--这个概念证明从未使用Real lvfsbucket执行过。这是在脱机环境中通过调整fwupd配置文件完成的。\n通过将fwupd配置为指向您控制的服务器，可以在实验室中执行以下概念验证。我。\n..", "note_en": "Permalink     GitHub is home to over 50 million developers working together to host and review code, manage projects, and build software together.\n  Sign up\n       A  dangling S3 bucket that belonged to LVFS (Linux Vendor Firmware Service). The dangling bucket is referenced by the default configuration in  fwupd version &lt;1.0.6 (Released 2018)\n Taken together, these vulnerabilities would have allowed an attacker whoclaimed the S3 bucket to  offer malicious firmware updates to Linux desktopsand servers running legacy versions of  fwupd.\n   The PGP verification bypass existed in versions of  fwupd prior to 1.4.0, andin  libjcat used by  fwupd from 1.4.0 onwards. The vulnerability can be fixedin  fwupd prior to 1.4.0 by backporting https://github.com/fwupd/fwupd/commit/21f2d12, and in  fwupd from 1.4.0onwards by using a  libjcat that includes https://github.com/hughsie/libjcat/commit/839b89f\n  Although the dangling S3 bucket only affected  fwupd clients with a legacyconfiguration, there is a large install base of these clients. For example,Debian Stretch (currently &#34;oldstable&#34;) still ships a version that referencesthe bucket. Over the course of 26 days, the S3 bucket received more than  2.5million update requests from over  500,000 unique IP addresses.\n The following graph shows the average number of update requests seen per hour, per week.\n    gnome-software typically refreshes  fwupd data once per day, which isreflected by the 24-hour cyclical traffic pattern in the first graph. Thenumber of daily update requests in the second graph is ~100,000 excludingweekends, and so I estimate that there are  at least 100,000 unique  fwupdclients reaching out to the dangling S3 bucket.\n Notwithstanding the dangling S3 bucket issue, the signature bypassvulnerability would also have been exploitable by an attacker who:\n Is in a privileged position within a public  fwupd metadata repository (such as LVFS); or\n Is in a privileged position within a local metadata mirror (such as one belonging to an enterprise)\n  Some Linux distributions, such as Red Hat Enterprise Linux (RHEL), reportedlydo not ship with a configuration that includes the LVFS metadata repository.\n fwupd does not install firmware updates for users automatically - the usermust manually accept the updates.\n Firmware installation can only be done using prescribed protocols implementedwithin  fwupd itself. It is not possible for an update to execute custom code,such as a proprietary flasher utility, during firmware installation. However,the vulnerabilities do give the ability to provide malicious input to an XMLparser and  .cab file parser which run as root. These code paths were notthoroughly examined.\n Some hardware devices perform their own on-chip verification of firmwareupdates (based on a key held by the hardware vendor themselves) which couldprevent the installation of some malicious firmware images.\n  April 2015 -  fwupd 0.1.2 is released; includes the commit which introduces the PGP signature verification bypass vulnerability ( https://github.com/fwupd/fwupd/commit/36a8890)\n August 2016 -  fwupd 0.7.3 is released; includes the commit which instructs client machines to download firmware metadata from the  lvfsbucket S3 bucket ( https://github.com/fwupd/fwupd/commit/96e1ea6)\n March 2018 -  fwupd 1.0.6 is released; includes the commit which instructs client machines to move away from the  lvfsbucket S3 bucket ( https://github.com/fwupd/fwupd/commit/4ee0836)\n November 2018 - reports emerge that the  lvfsbucket S3 bucket is returning 404 &#34;file not found&#34; errors ( https://bugs.debian.org/cgi-bin/bugreport.cgi?bug=912414)\n November 2019 - This is when the LVFS project claims that the S3 bucket was deleted\n April 2020 -  fwupd 1.4.0 is released; includes the commit which moves away from PGP signatures in favour of  jcat signatures ( https://github.com/fwupd/fwupd/commit/d5aab65)\n  28 May 2020 - the  fwupd project is informed of the dangling S3 bucket and signature bypass vulnerabilities\n 29 May 2020 - the  lvfsbucket S3 bucket is transferred to the  fwupd project for safe-keeping\n 30 May 2020 - the GnuPG project is contacted regarding the edge-case handling in  libgpgme\n 2 June 2020 - the GnuPG project responds - this will not be considered a bug in  libgpgme\n     10 June 2020 - updates made to this advisory (Vendor References and GnuPG&#39;s documentation change)\n     Appendices Appendix A - Theoretical attack scenarios for the S3 bucket takeover + signature verification bypass\n   a secure portal which allows hardware vendors to upload firmware updates.[The] site is used by all major Linux distributions to provide metadata forclients such as fwupdmgr and GNOME Software.\n   URLs of firmware update files (.cab files) which may be hosted either directly on LVFS or on a third-party website\n  The metadata is published as a file named  firmware.xml.gz. This file can beverified using a detached PGP signature produced using the LVFS PGP key( 0x48A6D80E4538BAC2) or a &#34;jcat&#34; bundle of signatures (PGP and PKCS7) whichwill be described later in this advisory.\n    a simple daemon to allow session software to update device firmware on yourlocal machine. It&#39;s designed for desktops, but also usable on phones andheadless servers. You can either use a GUI software manager like GNOMESoftware to view and apply updates, the command-line tool or the system D-Businterface directly.\n   Checking the PGP ( fwupd &lt;1.4.0) or jcat ( fwupd &gt;=1.4.0) signature of the firmware metadata from repositories such as LVFS\n  Informing the user of firmware updates described in the metadata that are available for their hardware, such as BIOS or Thunderbolt controller updates\n The firmware installation occurs over a limited number of protocols implementedwithin  fwupd, such as DFU or Fastboot( https://fwupd.org/lvfs/docs/metainfo/protocol). Importantly, it is notpossible for an individual firmware update to run custom code on the user&#39;smachine, such as a proprietary flasher utility.\n   Within LVFS Firmware vendors apply to LVFS and are granted permission to upload firmware metadata for certain hardware  vendor-id value/s ( https://blogs.gnome.org/hughsie/2019/12/11/improving-the-security-model-of-the-lvfs/)\n  LVFS collates the metadata for all vendors into one file ( firmware.xml.gz) which includes cryptographic hashes of each .cab file\n LVFS signs this file to produce a detached PGP signature ( firmware.xml.gz.asc) and jcat (PGP &amp;&amp; PKCS7) signature ( firmware.xml.gz.jcat)\n On client machines The  client utility sends the file descriptor of each file to  fwupd via D-Bus to do an &#34;UpdateMetadata&#34; operation (e.g.  https://github.com/fwupd/fwupd/blob/1.4.1/libfwupd/fwupd-client.c#L1420-L1466)\n fwupd checks the detached PGP (e.g.  https://github.com/fwupd/fwupd/blob/1.3.9/src/fu-keyring-gpg.c#L279-L316) or jcat signature This establishes the anchor of trust. The metadata contains cryptographic hashes (e.g. SHA) of individual firmware updates, and the metadata as a whole is signed by LVFS. This pattern (Signed metadata containing individual checksums) is similar to the  apt model ( https://wiki.debian.org/SecureApt#Secure_apt_groundwork:_checksums)\n Assuming the signature verification succeeds,  fwupd parses the XML metadata using &#34;a subset of the AppStream component specification&#34; ( https://lvfs.readthedocs.io/en/latest/metainfo.html)\n     fwupd verifies the .cab file&#39;s cryptographic hash against the hash in  firmware.xml.gz, unpacks it, and flashes the firmware\n  firmware.xml.gz describes the updates available for various hardware devices, provides a download URL for each update ( .cab file), and provides cryptographic hashes of the  .cab files\n  If a firmware  .cab file&#39;s hash matches the hash listed in  firmware.xml.gz, and the signature of  firmware.xml.gz is correct, then the  .cab file can be considered trustworthy\n  Consider the case in which an attacker controls the contents of firmware.xml.gz, and can sign the file or bypass the signature verificationprocess. The attacker could advertise malicious firmware updates for varioushardware products. If a user chooses to install a malicious update, theattacker could compromise the user&#39;s hardware, violating the integrity of theuser&#39;s system.\n  Releases of  fwupd ship with URLs of firmware repositories, such as LVFS.These are the URLs from which information about firmware updates should bedownloaded.\n  This change occurred in commit  https://github.com/fwupd/fwupd/commit/4ee0836(28 February 2018) to allow the LVFS project to move from Amazon S3 to analternative CDN.\n Some Linux distributions (e.g. Red Hat Enterprise Linux) reportedly do not ship fwupd configured to use the LVFS metadata URL.\n It was reported to the project in November 2018( https://github.com/fwupd/fwupd/issues/831) that downloads from the old URLwere failing with 404 errors. The project&#39;s solution was for users to update fwupd; or nag their distro to backport a fix. A bug against Debian Stretch(which is currently &#34;oldstable&#34;) was opened in October 2018 at https://bugs.debian.org/cgi-bin/bugreport.cgi?bug=912414 and is unresolved atthe time of writing.\n After the migration away from the Amazon S3 hosting arrangement, the LVFSproject  deleted the  lvfsbucket S3 bucket. The LVFS project informed meduring the disclosure process that the S3 bucket was deleted in  November2019.\n   With the bucket having been deleted, it was free for registration by any AmazonAWS customer. The user who registered the bucket would then  receive thephone-home update requests from users running legacy  fwupd clients.\n I registered the bucket in May 2020, and enabled S3 access logging on thebucket ( https://docs.aws.amazon.com/AmazonS3/latest/dev/ServerLogs.html)\n Over the course of 26 days, the S3 bucket received more than  2.5 millionupdate requests from over  500,000 unique IP addresses.\n Note that, during the time in which the I controlled the S3 bucket,  nocontent was published from the bucket. The bucket returned &#34;403 Forbidden&#34;for every request made to it.\n   To make use of these primitives, we would need to sign  firmware.xml.gz usinga trusted LVFS key; or we would need a way to bypass the PGP signature checkingin  fwupd.\n  The dangling S3 bucket has been transferred to the LVFS project. The LVFSproject should maintain control of this bucket until legacy versions of  fwupdare no longer installed in the field. The bucket should not be deleted until itis safe to do so.\n  The PGP-based metadata signature verification in  fwupd &lt;1.4.0 isvulnerable and can be reliably bypassed. Any  non-detached signature signedby  any key will defeat the verification logic.\n Given this vulnerability, an attacker who claimed the above dangling S3 bucket,or can otherwise put themselves between  fwupd clients and a metadatarepository, could have provided signed malicious firmware update information to fwupd clients.\n The vulnerability relies on the difference between detached and non-detachedPGP signatures. A primer on PGP signature types is provided in Appendix A.\n To be taken as an example, the signature verification code is as follows in fwupd 1.3.9\n /* load file data  */   // [SNIP - read the metadata data into &#39;data&#39;]   // [SNIP - read the metadata signature into &#39;sig&#39;]   /* verify  */ rc = gpgme_op_verify (self-&gt;ctx, sig, data,  NULL);  if (rc != GPG_ERR_NO_ERROR) {  g_set_error (error, FWUPD_ERROR, FWUPD_ERROR_INTERNAL,   &#34;failed to verify data:  %s &#34;,  gpgme_strerror (rc));  return  NULL; }   /* verify the result  */ result = gpgme_op_verify_result (self-&gt;ctx);  if (result ==  NULL) {  g_set_error_literal (error, FWUPD_ERROR, FWUPD_ERROR_INTERNAL,   &#34;no result record from libgpgme &#34;);  return  NULL; }   /* look at each signature  */  for (s = result-&gt;signatures; s !=  NULL ; s = s-&gt;next ) {  g_debug (  &#34;returned signature fingerprint  %s &#34;, s-&gt; fpr);  if (! fu_keyring_gpg_check_signature (s, error))  return  NULL;   /* save details about the key for the result  */  if ((gint64) s-&gt; timestamp &gt; timestamp_newest) { timestamp_newest = (gint64) s-&gt; timestamp;  g_string_assign (authority_newest, s-&gt; fpr); } }  return FU_KEYRING_RESULT (g_object_new (FU_TYPE_KEYRING_RESULT,   &#34;timestamp &#34;, timestamp_newest,   &#34;authority &#34;, authority_newest-&gt;str,  NULL));}\n    The signature verification is done by  gpgme_op_verify() which is provided by  libgpgme and is documented at  https://www.gnupg.org/documentation/manuals/gpgme/Verify.html\n  The signatures within  result are looped over. For each signature, if  fu_keyring_gpg_check_signature() is unhappy (e.g. the public key was unknown; the signature was bad; the signing key is expired) the verification is  failed\n  Provide some  data (xml) and  sig (asc) data which: Causes  gpgme_op_verify_result() (step 2 above) to succeed and to return a  result with zero signatures\n Due to the fact that there are zero signatures, the  for loop (step 3 above) will be skipped entirely, and so  fu_keyring_gpg_check_signature() will not be called, which allows us to skip the fine-grained signature checking\n We are able to execute this attack due to an edge-case in GPGme (GnuPG MadeEasy) when it tries to verify a normal signature as if it were a detachedsignature.\n  Explicitly check that  result-&gt;signatures is non-zero (i.e. at least one signature was observed by  gpgme_op_verify()); and/or\n Invert the individual signature verification logic. Currently, the code checks to ensure that there are zero &#34;bad&#34; signatures. It would be safer to instead ensure that there is at least one &#34;good&#34; signature. This is the approach taken by  flatpak  https://github.com/flatpak/flatpak/blob/1.7.2/common/flatpak-oci-registry.c#L2073-L2085)\n  GPGme is provided by the GnuPG project. It is a library that wraps the  gpgcommand-line utility and exposes GnuPG functionality to software developers.\n      When it is verifying a detached PGP signature (as is usually the case for  fwupd):\n When it is verifying a normal or cleartext PGP signature: plain should be a &#34;writable data object that will contain the plaintext after successful verification&#34;\n Though  fwupd normally uses  gpgme to verify a  detached PGP signature,under adversarial conditions this is not guaranteed - an attacker can provideany data for the signature file.\n  Any data as  signed_text (which is a hint to  gpgme that  sig should be detached)\n  If it is given a  detached signature for which  fwupd does not know thesigning key, the verification code  correctly rejects the signature asfollows:\n /* verify  */ rc = gpgme_op_verify (self-&gt;ctx, sig, data,  NULL);  if (rc != GPG_ERR_NO_ERROR) {  g_set_error (error, FWUPD_ERROR, FWUPD_ERROR_INTERNAL,   &#34;failed to verify data:  %s &#34;,  gpgme_strerror (rc));  return  NULL; }   /* verify the result  */ result = gpgme_op_verify_result (self-&gt;ctx);  if (result ==  NULL) {  g_set_error_literal (error, FWUPD_ERROR, FWUPD_ERROR_INTERNAL,   &#34;no result record from libgpgme &#34;);  return  NULL; }   /* [+] DEBUG TRACE   gdb-peda$ print *result  $1 = {  signatures = 0x5593c66668b0,  file_name = 0x0,  is_mime = 0x0,  _unused = 0x0  }   gdb-peda$ print *result-&gt;signatures  $2 = {  next = 0x0,  summary = GPGME_SIGSUM_KEY_MISSING,  fpr = 0x5593c666d290 &#34;88C202B687A57ED3D0109BAFAC92351AF277A464&#34;,  status = 0x9,  notations = 0x0,  timestamp = 0x5ecf199e,  exp_timestamp = 0x0,  wrong_key_usage = 0x0,  pka_trust = 0x0,  chain_model = 0x0,  is_de_vs = 0x0,  _unused = 0x0,  validity = GPGME_VALIDITY_UNKNOWN,  validity_reason = 0x0,  pubkey_algo = GPGME_PK_RSA,  hash_algo = GPGME_MD_SHA512,  pka_address = 0x0,  key = 0x0  }   */   /* look at each signature  */  for (s = result-&gt;signatures; s !=  NULL ; s = s-&gt;next ) {  g_debug (  &#34;returned signature fingerprint  %s &#34;, s-&gt; fpr);  if (! fu_keyring_gpg_check_signature (s, error))  return  NULL;   /* save details about the key for the result  */  if ((gint64) s-&gt; timestamp &gt; timestamp_newest) { timestamp_newest = (gint64) s-&gt; timestamp;  g_string_assign (authority_newest, s-&gt; fpr); } }  return FU_KEYRING_RESULT (g_object_new (FU_TYPE_KEYRING_RESULT,   &#34;timestamp &#34;, timestamp_newest,   &#34;authority &#34;, authority_newest-&gt;str,  NULL));}\n The call to  gpgme_op_verify_result() returns a list of one signature, forwhich we can see the summary is  GPGME_SIGSUM_KEY_MISSING which will make fu_keyring_gpg_check_signature() unhappy in the fine-grained checking  forloop.\n Compare this to what happens if we give a  non-detached signature for which fwupd still does not know the signing key. The verification code incorrectly accepts the signature as follows:\n /* verify  */ rc = gpgme_op_verify (self-&gt;ctx, sig, data,  NULL);  if (rc != GPG_ERR_NO_ERROR) {  g_set_error (error, FWUPD_ERROR, FWUPD_ERROR_INTERNAL,   &#34;failed to verify data:  %s &#34;,  gpgme_strerror (rc));  return  NULL; }   /* verify the result  */ result = gpgme_op_verify_result (self-&gt;ctx);  if (result ==  NULL) {  g_set_error_literal (error, FWUPD_ERROR, FWUPD_ERROR_INTERNAL,   &#34;no result record from libgpgme &#34;);  return  NULL; }   /* [+] DEBUG TRACE   gdb-peda$ print *result  $3 = {  signatures = 0x0,  file_name = 0x0,  is_mime = 0x0,  _unused = 0x0  }   */   /* look at each signature  */  for (s = result-&gt;signatures; s !=  NULL ; s = s-&gt;next ) {  g_debug (  &#34;returned signature fingerprint  %s &#34;, s-&gt; fpr);  if (! fu_keyring_gpg_check_signature (s, error))  return  NULL;   /* save details about the key for the result  */  if ((gint64) s-&gt; timestamp &gt; timestamp_newest) { timestamp_newest = (gint64) s-&gt; timestamp;  g_string_assign (authority_newest, s-&gt; fpr); } }  return FU_KEYRING_RESULT (g_object_new (FU_TYPE_KEYRING_RESULT,   &#34;timestamp &#34;, timestamp_newest,   &#34;authority &#34;, authority_newest-&gt;str,  NULL));}\n  This will cause the fine-grained checking  for loop to be bypassed, and so fu_keyring_gpg_check_signature() will not be called at all. The verificationfunction will incorrectly return a successful result.\n  As an aside, during the disclosure process with the  fwupd project, it wasnoted by the project that rollback/replay protections added in https://github.com/fwupd/fwupd/commit/f69a4810 should have prevented thisattack from working. In a zero-signature case, such as the case we can trigger,the verification process will return a default  timestamp value of 0 to thecalling function, and the calling function  should reject this value as arollback attempt.\n However, at https://github.com/fwupd/fwupd/commit/f69a4810#diff-300ca38c94199c9239dc835920e466ecR1550there is a specific carve-out for cases where the verification function returnsa  timestamp of 0. This defeats the rollback protection for this specificcase.\n This is not, strictly speaking, a vulnerability in the rollback protection.Putting the signature verification bypass aside, for an attacker to attempt arollback attack, they will be replaying old metadata signed by LVFS. Thisreplayed signature will always have a timestamp associated with it, and so anattacker should not be able to trigger a rollback attack with a malicious timestamp of 0.\n This anti-rollback bug was fixed via  https://github.com/fwupd/fwupd/pull/2150during the disclosure process. It breaks the exploit described in thisadvisory, and probably breaks any exploit targeting this vulnerability.However, this anti-rollback fix should not be considered to be a root-cause fixfor the bypass vulnerability.\n    To be absolutely clear - this Proof of Concept was  never performed using thereal  lvfsbucket bucket. It was done in an offline environment by tweaking fwupd configuration files.\n  The following Proof of Concept can be executed in a lab by configuring  fwupdto point at a server you control. Im\n......", "posttime": "2020-06-10 10:08:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,lvfs,sig,签名", "title": "传统LVFS S3存储桶接管和CVE-2020-10759转发签名验证绕过", "title_en": "Legacy LVFS S3 bucket takeover and CVE-2020-10759 fwupd sig verification bypass", "transed": 1, "url": "https://github.com/justinsteven/advisories/blob/master/2020_fwupd_dangling_s3_bucket_and_CVE-2020-10759_signature_verification_bypass.md", "via": "", "real_tags": ["2020", "lvfs", "sig", "签名"]}, {"category": "", "categoryclass": "", "imagename": "e7a5ba45bf13ae7df02b943651c8c313.jpg", "infoid": 1005945, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国有线电视新闻网报道，为了遏制新冠肺炎的传播，世界各地的人们都在家里自我隔离，苹果公司已经获得了一项软件专利，该软件可以让人们在社交距离较远的情况下进行集体自拍。\n美国专利商标局(US Patent And Trademark Office)最近向苹果公司授予了该软件的专利，该软件将允许合成集体自拍，或社交遥远的集体自拍。\n该软件将允许用户邀请其他人参与集体自拍，将多个人安排到一张照片中。它将删除其他自拍用户的背景图像，并将其放入用户的照片中。\n虽然看起来苹果申请这项专利是为了应对流感大流行，但这家科技巨头最初是在2018年申请了这项专利，并于6月2日收到了这项专利。\n苹果是否决定推进这款专利软件还有待观察，但这将是人们在保持社交距离的同时创造彼此记忆的完美方式。", "note_en": "(CNN)With people around the world self-isolating at home in order to curb the spread of Covid-19, Apple has received a patent for software that would allow people to take group selfies while socially distancing from one another.\n The  US Patent and Trademark Office recently granted Apple a patent for the software that would allow for &#34;synthetic group selfies,&#34; or socially distant group selfies.\n The software would allow a user to invite others to participate in a group selfie that would arrange multiple people into a single image. It would remove the background image from other users&#39; selfies and place them into the user&#39;s photo.\n    While it appears as if Apple filed for the patent as a response to the pandemic, the tech giant originally filed for the patent in 2018 and it received it June 2.\n Whether Apple decides to move forward with the patented software remains to be seen, but it would be the perfect way for people to create memories with one another while still socially distancing.", "posttime": "2020-06-10 09:52:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,app,apple,授予,granted", "title": "苹果公司授予专利，允许社交距离远距离的集体自拍", "title_en": "Apple Granted Patent That Would Allow For Socially Distant Group Selfies", "transed": 1, "url": "https://www.cnn.com/2020/06/08/tech/apple-selfie-trnd/index.html", "via": "", "real_tags": ["苹果", "app", "apple", "授予", "granted"]}, {"category": "", "categoryclass": "", "imagename": "e4a57a3aeda36e99ce0066a8cfd3d184.jpeg", "infoid": 1005944, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在全国范围内的抗议活动中，两名发烧友设计了一种针对LRAD的防御方案，LRAD是警方用来驱散人群的军国主义声波武器。", "note_en": "Amidst nationwide protests, two audiophiles have designed a defense against LRADs, the militaristic sonic weapons used by police to disperse crowds.", "posttime": "2020-06-10 09:34:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "工程师,engineers,lrad", "title": "音响工程师建造了一个盾牌来转移警察的声炮", "title_en": "Audio Engineers Built a Shield To Deflect Police Sound Cannons", "transed": 1, "url": "https://www.vice.com/en_us/article/dyzpna/audio-engineers-built-a-shield-to-deflect-police-sound-cannons", "via": "", "real_tags": ["工程师", "engineers", "lrad"]}, {"category": "", "categoryclass": "", "imagename": "5e2b518392f0a0b3a444fe53fa6e3098.jpg", "infoid": 1005943, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该系统将允许无人机在几分钟内被运送到遥远的防御目标，然后它可以在那里追捕目标。\n五角大楼去年测试了一种游荡弹药，通常被称为自杀式无人机，它将以高超音速抵达指定的目标区域。自那以后，它已将该项目移交给美国陆军进行进一步开发。关于这个名为“老式赛车”的项目的更多细节现在已经出现在一张官方照片中，照片中陆军部长瑞安·麦卡锡(Ryan McCarthy)正在讨论它，以及其他先进的武器系统。\n史蒂夫·特里布尔是“航空周刊”的国防编辑，也是“战区”的好朋友。去年，他在华盛顿特区举行的美国陆军协会(AUSA)顶级年度会议和展览上看到麦卡锡的照片后，首先报道了有关老式赛车的最新细节。这张照片拍摄于2019年10月14日。根据五角大楼的预算文件，该项目本身至少可以追溯到2017财年，国防部长办公室在2017财年收到了250万美元，2018财年又收到了120万美元。\n老式赛车手成熟了起诉感兴趣目标的先进能力，五角大楼2021年预算申请中关于该项目的简短说明中提到了该计划。该项目成功地通过风洞测试验证了空气动力学设计，并在2019财年飞行测试达到顶峰之前集成了目标动力学效果的制导子系统。文档和原型技术被移交给美国陆军，用于额外的开发和后续的采购活动。\n其他预算文件称，原本计划在2018财年进行飞行演示。这个时间表似乎因为未知的原因被推迟了一年。此外，2019年财政年度于9月1日结束。2019年30日，这意味着当麦卡锡在华盛顿的AUSA活动上获得有关该项目的信息时，陆军可能已经接管了该项目。\n这位陆军部长在那次活动中的照片显示，他站在一张小桌子前，与其他人交谈，面前摆着一张古董赛车简报幻灯片。还可以看到普通高超声速滑翔体(C-HGB)高超声速助力滑翔飞行器的一个小型模型，该军种正在与美国海军共同开发作为其陆射远程高超声速武器(LRHW)的弹头，以及一种类似于电磁轨道炮发射的动能炮弹，例如陆军近年来一直在试验的那种。还发现了一些烧有洞的金属物体，包括似乎是155毫米榴弹炮的一段枪管，可能来自激光定向能武器。\n特里姆布尔强调，老式赛车简介幻灯片的标题中还有游荡武器系统概述，以及六大要点--高超音速入口、生存能力、超越目标的时间、多角色、模块化有效载荷和成本征收策略--每个要点都有若干子要点。航空周刊后来能够增强图像，以便能够阅读所有这些额外的亮点。\n高超声速入口表明老式赛车游荡弹药有能力以5马赫以上的高超声速到达目标。目前还不清楚弹药是如何以这种速度到达目标区域的，但根据目前公开的信息，弹道导弹似乎是最有可能的。呼吸空气的高超声速巡航导弹可能是另一种选择，但考虑到与这些类型的武器及其目前的发展状况相关的高昂成本和复杂性，这似乎不太可能。五角大楼的预算文件也不清楚国防部长办公室是对整个系统进行了全面的飞行测试，还是只对游荡弹药部件进行了全面的飞行测试。\n先进的机动高超声速武器，从本质上讲，基于它们的绝对速度，以及它们一般水平的大气飞行轨迹和高度的机动性，具有高度的生存能力。这使得他们可以穿透密集的综合防空系统。这一切都使它们成为对时间敏感的打击的理想选择，以及在被拒绝的地区与其他关键目标交战，因为对手几乎没有时间重新定位或以其他方式寻找掩护，甚至试图击落来袭的武器，一般来说，这是一个困难的前景。\n与此同时，弹道导弹仍然可以以高超声速飞行，可能很难防御，但在大多数情况下，与更先进的高超声速导弹相比，生存能力较差。麦卡锡部长去年10月看到的简报幻灯片还表明，老式赛车弹药将具有隐形雷达横截面和整体低签名，这也可能涉及其他特征，以减少其红外、视觉和声学特征，从而使其更难被发现。\n在这两种情况下，根据2019年AUSA会议的简报幻灯片，在混合弹药中增加游荡能力，将弹药超过目标时间的时间延长到60至90分钟，可能会带来额外的好处。发射单位在发射武器之前不一定需要知道目标的确切位置，然后它可以使用自己的多模式制导系统来寻找目标并摧毁它。\n有了双向卫星数据链路，一个人可以安全地回到发射场或单独的指挥中心，也可以使用人在环控制系统来实际引导它进入期望的目标。这种由以色列首创的能力将提供额外的准确性，特别是针对移动目标，以及在出现另一个更高优先级的威胁时迅速转移重点的能力。它还可以帮助避免附带损害，因为如果无辜的旁观者进入该地区，即使在武器非常接近撞击的情况下，也允许管制员中止打击。\n下面的视频展示了以色列航空航天工业“绿龙”的人在回路中的能力，这是一种战术游荡弹药。\n这种游荡弹药也可以用作区域封锁武器。将它们部署在某些区域，例如可能的公路机动弹道导弹或远程巡航导弹的部署地点，可能会挫败对手使用这些资产的企图，以及他们将这些资产分布到多个地点以帮助保护它们免受其他手段发现和打击的努力。\n同样，在友军飞机到来之前在关键地区播种它们，以摧毁敌人的防空系统也是可能的，特别是如果这些威胁的确切位置尚不清楚的话。它们还可以用来消除弹出威胁，如道路移动防空系统，或其他有机会的目标。\n可以接受模块化有效载荷的多功能武器设计也意味着这些游荡的弹药可以承担非动力打击任务，如情报、监视、侦察和电子战。根据五角大楼以及现在的陆军如何设想使用老式赛车系统，可能会将它们部署在联网的自主蜂群中，在那里不同配置的变体承担不同的角色。携带传感器的版本可以发现具有动能有效载荷的目标，或者指示那些具有电子战干扰器的目标扰乱敌人的防空系统。\n从本质上讲，蜂群也可能通过同时从各种不同的方向集中攻击来压倒和迷惑对手。美国国务卿麦卡锡在2019年10月审查的简报幻灯片中特别指出，希望老式赛车的部署成本不高，但击败它的成本很高。目标是每枚弹药的成本在10万美元到20万美元之间，例如，这只是美国军方为巡航导弹支付的一小部分。\n简报幻灯片还说，模块化游荡弹药可能能够承担非战斗支持角色，还可以提到位置、导航和计时，或PNT，以及在有争议的环境中的联网通信。随着GPS卫星导航系统面临的潜在威胁不断增加，美国军方作为一个整体，越来越多地关注一个名为Assured PNT的概念。\nAssured PNT背后的基本思想，你可以在过去的战区文章中读到更多，就是使用各种方法在整个战场空间的不同平台上分布导航系统节点，并将它们联网。其结果是一个生态系统，可以提供准确和可靠的位置信息，而不必依赖GPS。同样，分布式通信节点可以帮助克服敌人的电子战攻击。除了老式赛车系统在这些概念中提供有用的附加层的能力之外，它的快速部署特性可以使其成为在关键操作期间填补连接缺口的重要手段。\n值得注意的是，美国陆军实际上在2018年就曾嘲笑过使用未来的精确打击导弹(PRSM)准弹道导弹作为一种方式，将游荡情报、监视和侦察无人机部署到敌人领土深处，以便提供目标信息。采用移动的地面发射平台可以进一步增加系统的灵活性。\n洛克希德·马丁公司正在开发PRSM，表面上是为了取代现役的陆军战术导弹系统(ATACMS)准弹道导弹。陆军和洛克希德·马丁公司目前还在测试这些导弹的多模式制导系统，该系统可以使它们与大型移动目标(如舰船)交战。之前有传言说要给ATACMS类似的移动目标能力。\n在20世纪90年代和21世纪初，陆军研究了ATACMS的一个版本，它将携带13枚辉煌的反坦克(BAT)子弹药的有效载荷，这与使用PRSM发射无人机的想法以及老式赛车概念有一些广泛的相似之处。BAT是一种小型无动力滑翔炸弹，它使用声学传感器来寻找目标，并通过成像红外导引头来定位目标。陆军最终取消了装满蝙蝠的ATACMS项目，尽管这些武器本身已经演变成GBU-44/B毒蛇攻击空射滑翔炸弹。\n当然，老式赛车并不是美军第一次尝试使用远程、对峙的常规武装游荡弹药来起诉时间敏感型和其他关键打击。在本世纪初，美国海军研究办公室(ONR)致力于开发一种被称为“平价武器系统”(AWS)的具有漫游能力的低成本巡航导弹类型武器。\n2005年3月，时任海军研究总司令的海军少将杰伊·科恩(Jay Cohen)告诉国会议员，廉价武器系统是一种游荡的类似巡航导弹的系统，可以携带各种有效载荷，现在已经过渡到采购界进行开发。泰坦公司，现在是L-3通信公司的一部分，根据与ONR的合同，继续开发AWS至少到2007年。该公司本应制造85枚这样的导弹，用于测试和评估目的，但目前还不清楚这是否会实现。\n2014年，美国空军还发布了一份遥控飞行器(RPA)矢量，涵盖了2013年至2038年期间设想的远景和使能概念。这份文件提到了一种概念上的高超声速近空间母舰RPA，它可以在几分钟内交付多个SUA[小型无人机系统]，以提供具有重要战略意义的致命性、EA[电子攻击]或网络攻击能力。\n老式赛车似乎是提供这种能力的最新尝试。国防部长办公室最初管理了这一努力，并通过其快速反应基金支付了费用，这表明这个项目将迅速成为行动现实的希望是真实的。\n快速反应基金(QRF)提供.。利用相对成熟技术的机会。根据五角大楼的2021财年预算请求，能力解决了国防战略的优先事项和知情的记录计划或新的获取途径，以更有效和负担得起的方式将创新推向该领域。QRF专注于那些有可能解决常规、破坏性和不对称战争需求的项目。QRF计划通常在获得资金后的12个月内交付原型应用程序。\n看看陆军能以多快的速度继续完善和改进老式赛车系统，这将是非常令人兴奋的，因为它正在努力将其从实验能力转移到作战能力。", "note_en": "The system would allow a drone to be delivered to a defended target far away in a matter of minutes, where it could then hunt down its target.\n The Pentagon tested a loitering munition, more commonly referred to  as a suicide drone, last year that will arrive over its designated target area at hypersonic speeds. It has since turned the project over to the U.S. Army for further development. Additional details about the program, dubbed Vintage Racer, have now emerged in an official picture showing Secretary of the Army Ryan McCarthy discussing it, as well as other advanced weapon systems.\n Steve Trimble,  Aviation Week&#39;s Defense Editor and a good friend of  The War Zone,  first reported on the new details about Vintage Racer after spotting the picture of McCarthy at Association of the U.S. Army&#39;s (AUSA) top annual conference and exhibition in Washington, D.C. last year. The picture was taken on Oct. 14, 2019. The program itself dates back to at least the 2017 Fiscal Year, according to Pentagon budget documents, with the Office of the Secretary of Defense receiving $2.5 million in the 2017 Fiscal Year and another $1.2 million in the 2018 Fiscal Year for the project.\n  &#34;Vintage Racer matured an advanced capability to prosecute targets of interest,&#34; a brief note about the project in the  Pentagon&#39;s 2021 Budget Request says about the program. &#34;The project successfully validated aerodynamic design with wind tunnel testing and integrated a guidance subsystem for targeted kinetic effects before culminating in a FY 2019 flight test. Documentation and prototype technologies transitioned to the U.S. Army for additional development and follow-on acquisition activities.&#34;\n  Other budget documents say that there were originally plans for a flight demonstration in the 2018 Fiscal Year. This schedule appears to have gotten pushed back a year for unknown reasons. In addition, the 2019 Fiscal Year ended on Sept. 30, 2019, meaning that it is possible that the Army may have taken ownership of the project by the time McCarthy got the information about it at the AUSA event in Washington.\n   The picture of the Army Secretary at that event shows him standing in front of a small table talking with other individuals with a print out of a Vintage Racer briefing slide in front of him. A small model of the  Common Hypersonic Glide Body (C-HGB) hypersonic boost-glide vehicle, which the service is developing as the warhead for its ground-launched  Long Range Hypersonic Weapon (LRHW) together with the U.S. Navy, as well as a kinetic projectile similar to those fired from electromagnetic railguns, such as the one the Army  has been experimenting with in recent years, are also seen. A number of metal objects with holes burned in them, including what appears to be a section of a barrel from a 155mm howitzer, possibly from a  laser directed energy weapon, are also present.\n   Trimble highlighted that the Vintage Racer briefing slide also has &#34;Loitering Weapon System (LWS) Overview&#34; in its title, as well as six large bullet points – Hypersonic Ingress, Survivable, Time Over Target, Multi-role, Modular payload, and Cost Imposition Strategy – each with a number of sub-bullet points.  Aviation Week was later able to enhance the image to be able to read all of these additional highlights.\n   &#34;Hypersonic Ingress&#34; indicates the Vintage Racer loitering munition has the ability to get its target at hypersonic speeds, defined as above Mach 5. It&#39;s not clear how the munition gets to the target area at these speeds, but  a ballistic missile seems most plausible based on the information publicly available now. An  air-breathing hypersonic cruise missile could be another option, but this seems less likely given the high cost and complexity associated with those types of weapons and their current developmental state. It&#39;s also not clear from the Pentagon budget documents if the Office of the Secretary of Defense conducted a full flight test of the complete system or just the loitering munition component.\n Advanced maneuvering hypersonic weapons are,  by their nature, highly survivable based on their sheer speed, as well as their generally level atmospheric flight trajectories and their high degrees of maneuverability. This allows them to penetrate past dense integrated air defenses. This all makes them ideal for time-sensitive strikes, as well as engaging otherwise critical targets in denied areas, since opponents have little time to relocate or otherwise take cover or even attempt to shoot down the incoming weapon, which is a difficult prospect, in general.\n Meanwhile, ballistic missiles can still travel at hypersonic speeds and can be difficult to defend against, but are less survivable in most cases than their more advanced hypersonic counterparts. The briefing slide Secretary McCarthy saw last October also indicated that the Vintage Racer munition would have a stealthy radar cross-section and an overall &#34;low signature,&#34; which could also refer to other features to reduce its  infrared, visual, and  acoustic signatures, making it even harder to detect.\n In either case, adding a loitering capability to the mix, extending the munition&#39;s &#34;time over target&#34; to between 60 and 90 minutes according to the briefing slide from the 2019 AUSA conference, could provide additional benefits. The launching unit would not necessarily need to know the exact location of the target before firing the weapon, which could then use its own multi-mode guidance system to seek it out and destroy it.\n With a two-way satellite data-link, it is possible that an individual safely back at the launch site or in a separate command center could use a  man-in-the-loop control system to actually guide it into the desired target, as well. This kind of capability,  which Israel has pioneered, would offer additional accuracy, especially against moving targets, as well as offering the ability to shift focus rapidly if another, higher priority threat emerges. It can also help in avoiding collateral damage, by allowing the controller to abort the strike, even when the weapon is very close to impact, should innocent bystanders enter the area.\n The video below shows the man-in-the-loop capabilities of the Israel Aerospace Industries Green Dragon, a tactical loitering munition.\n  These kinds of loitering munitions could be employed as area denial weapons, as well. Deploying them over certain areas, such as likely deployment sites for  road-mobile ballistic or  long-range cruise missiles, could frustrate an opponent&#39;s attempt to employ those assets, as well as their efforts to distribute them to multiple locations to help protect them from detection and strikes by other means.\n It would be similarly possible to seed them in critical areas in advance of incoming friendly aircraft in order to destroy enemy air defenses, especially if the exact locations of those threats are not known. They could also be used to take out pop up threats, such as road-mobile air defense systems, or other targets of opportunity.\n A &#34;multi-role&#34; weapon design that can accept &#34;modular payloads&#34; also means that these loitering munitions could take on non-kinetic strike missions, such as intelligence, surveillance, and reconnaissance and  electronic warfare. Depending on how the Pentagon, and now the Army, envisions employing the Vintage Racer system, it might be possible to deploy them in networked autonomous swarms, where different configured variants take on various roles. Sensor carrying versions could spot targets for ones with kinetic payloads or direct those with electronic warfare jammers to scramble enemy air defenses.\n A swarm, by its very nature, might also just be able to overwhelm and confuse an opponent by striking en masse from various different directions at once. The briefing slide that Secretary McCarthy examined in October 2019 specifically noted that the Vintage Racer would hopefully be &#34;inexpensive to deploy,&#34; but &#34;costly to defeat.&#34; The goal is for each munition to cost between $100,000 and $200,000, a fraction of what the U.S. military is paying for cruise missiles, for instance.\n The briefing slide also said that modular loitering munition might be able to take on non-combat &#34;support roles,&#34; as well, mentioning &#34;position, navigation, and timing,&#34; or PNT, as well as &#34;networked communications in a contested environment. The U.S. military, as a whole, is looking increasingly at a concept called Assured PNT as potential threats to the GPS satellite-based navigation system grow.\n The basic idea behind Assured PNT, which you can read about more  in these past   War Zone pieces, is to use various means to distribute navigation system nodes across various platforms throughout the battlespace, and networking them together. The result is an ecosystem that can provide accurate and reliable position information without having to rely on GPS. Similarly, distributed communications nodes could help overcome enemy electronic warfare attacks. Beyond the Vintage Racer system&#39;s ability to provide a useful addition layer in these concepts, its rapidly deployable nature could make it an important means of filling connectivity gaps during critical operations.\n  It&#39;s worth noting that the Army actually teased the idea of using its future  Precision Strike Missile (PrSM) quasi-ballistic missile as a way to deploy loitering intelligence, surveillance, and reconnaissance drones deep into enemy territory in order to provide targeting information back in 2018. Employing a mobile, ground-launched platform could further increase the system&#39;s flexibility.\n  Lockheed Martin is developing PrSM ostensibly as a replacement for the service&#39;s existing Army Tactical Missile System (ATACMS) quasi-ballistic missiles. The Army and Lockheed Martin are also now  testing a multi-mode guidance system for these missiles that could enable them to engage large moving targets, such as ships. There had previously been  talk about giving ATACMS a similar moving target capability.\n In the 1990s and early 2000s, the Army had worked on  a version of the ATACMS that would carry a payload of 13  Brilliant Anti-Tank (BAT) submunitions, which has some broad similarities to the idea of launching drones using the PrSM, as well as the Vintage Racer concept. BAT was a small unpowered glide bomb that used acoustic sensors to find its targets and imaging infrared seeker to home in on them. The Army ultimately canceled the BAT-filled ATACMS project, though the weapons themselves evolved into the  GBU-44/B Viper Strike air-launched glide bomb.\n   Of course, Vintage Racer is hardly the U.S. military&#39;s first foray into the idea of a long-range, stand-off conventionally-armed loitering munition for prosecuting time-sensitive and other critical strikes. In the early 2000s, the U.S. Navy&#39;s Office of Naval Research (ONR) worked on developing a low-cost cruise missile-type weapon with loitering capability known as  the Affordable Weapon System (AWS).\n &#34;The Affordable Weapon System, a loitering cruise-missile-like system that can carry a variety of payloads, transitioned to the acquisition community for development,&#34; Navy Rear Admiral Jay Cohen, then-Chief of Naval Research,  told members of Congress in March 2005. The Titan Corporation, now part of L-3 Communications, continued development of the AWS under contract to ONR until at least 2007. The company was supposed to build 85 of these missiles for test and evaluation purposes, though it&#39;s unclear if that ever came to pass.\n   In 2014, the U.S. Air Force also published a  Remotely Piloted Vehicle (RPA) Vector, covering &#34;vision and enabling concepts&#34; envisioned for the 2013 to 2038 timeframe. This document included mention of a notional &#34;hypersonic near-space &#39;mother ship&#39; RPA that deliver[s] multiple SUAS [small unmanned aerial systems] to provide a strategically significant number of lethal, EA [electronic attack], or cyberattack capabilities within minutes.&#34;\n  Vintage Racer would seem to be the latest attempt to provide this kind of capability. That the Office of the Secretary of Defense initially managed the effort and paid for its through its Quick Reaction Fund, suggests that there is real hope that this project will move quickly toward becoming an operational reality.\n &#34;The Quick Reaction Fund (QRF) provided ... opportunities to capitalize on relatively mature technologies. Capabilities addressed National Defense Strategy priorities and informed programs of record or new acquisition pathways to more effectively and affordably push innovation to the field.,&#34; according to the Pentagon&#39;s 2021 Fiscal Year budget request. &#34;QRF focused on projects that have the potential to address conventional, disruptive, and asymmetric warfare needs. QRF initiatives typically delivered a prototype application within 12 months of being funded.&#34;\n It will be very exciting to see how quickly the Army can continue to refine and improve the Vintage Racer system as it works on moving it from an experimental to an operational capability.", "posttime": "2020-06-10 09:16:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "超音速,tested,目标", "title": "五角大楼测试了一架到达超音速目标区域的自杀式无人机", "title_en": "Pentagon Has Tested a Suicide Drone That Gets to Its Target Area at Hypersonic", "transed": 1, "url": "https://www.thedrive.com/the-war-zone/33934/pentagon-has-tested-a-suicide-drone-that-gets-to-its-target-area-at-hypersonic-speed", "via": "", "real_tags": ["超音速", "tested", "目标"]}, {"category": "", "categoryclass": "", "imagename": "d86091bb1822ecf011903440ffddb201.png", "infoid": 1005942, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个小但功能强大的便携工具，通过Windows API工作。WPD是在Windows中自定义隐私相关设置的最方便、最合适的方式。", "note_en": "A small but powerful portable tool working via Windows API. WPD is the most convenient and proper way to customize privacy related settings in Windows.", "posttime": "2020-06-10 09:15:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,windows-10,用于,privacy", "title": "Windows隐私仪表板：用于Windows 10隐私设置的GUI", "title_en": "Windows Privacy Dashboard: GUI for Windows 10 Privacy Settings", "transed": 1, "url": "https://wpd.app/", "via": "", "real_tags": ["windows", "用于", "privacy"]}, {"category": "", "categoryclass": "", "imagename": "9804d6a41b1dd1d44ad24885422add03.jpg", "infoid": 1005941, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "道德消费主义已经成为新的商业热词，在很大程度上是早期商业美德的延伸--我们看到的信号是，大量的商业活动为他们的公司目标增加了“可持续性”。很明显，从化妆品中“有机”产品的兴起到金融市场上的“绿色”产品，没有一个行业不改变这种说法。但是，如果我们从创收的角度谈论道德消费主义，利他主义动机实际上如何成功地改变了消费者的结构性习惯？\n也许探索它与这个问题相关的最相关的商业冒险之一是肉类替代品生产商Beyond Meat。当我们看到Beyond Burger的广告或餐厅菜单中Beyond Meat菜肴的选项时，我们可以感觉到成为一名道德消费者的愿望，从边缘转向了前面。随着股价在2019年突破200美元大关，Beyond Meat的估值达到了140亿美元的峰值，Beyond Meat的投资者需要问一个问题：道德消费主义的社会结构是否不仅能带来盈利，还能提供站得住脚的商业模式？\nBeyond Meat是在一个关键时刻进入市场的，当时消费者对可持续健康生活的偏好已经从餐桌上的讨论转变为切实的需求。认识到道德消费主义现在正成为文化叙事的一部分，并加大力度，这使得他们能够催化一种现任者无法实现的影响。\n为了理解肉类消费的趋势可能会如何演变，我们可以看看道德消费主义中的一个平行概念，有着非常相似的趋势线。虽然食物和垃圾不是我们经常同时想到的，但肉类行业面临的必要变化与我们在工业化后扩大生产时围绕垃圾和污染发生的情况非常相似。我们慢慢而坚定地认识到，虽然浪费是无法消除的，但它迫切需要管理。\n“直到20世纪70年代的主导模式是，在一个资源丰富的世界里，废物是高效制造的自然副产品。一旦我们意识到资源限制和污染，我们逐渐获得了一种新的观点：浪费是有害的。这一新模式变得更加强大，并导致了清洁生产和回收利用。另一种范式转变目前正在进行：认为浪费就是财富的想法-从摇篮到摇篮的范式。新的战斗口号不是减产，而是以不同的方式生产。“。\n同样，随着世界经济论坛推动全球努力寻找替代的可持续蛋白质供应，围绕肉类的叙述也从“肉类是必要的主食”演变为“肉类有害”。\nBeyond Meat利用“肉是不好的”这一说法创建了现有的客户群。面对日益增长的道德消费欲望，这些客户会主动超越根深蒂固的肉类消费习惯，转向植物性替代品。在抓住了这些“自我激励的顾客”之后，它继续在口味和质地上进行优化，并加大了努力更好地满足顾客对健康的期望。\n尽管有这些努力来增加市场份额，Beyond Meat的客户群很可能仅限于有限数量的“自我激励”的消费者。重要的是，应该指出的是，Beyond Meat的消费者中有93%实际上是肉食者，而不是人们普遍认为的素食或纯素食者。那么，对于主要是灵活的消费者基础来说，自我激励是一个棘手的命题。下一阶段的转型和进入更大的灵活市场将在便利性降低自我激励必要性的时候被催化。当肉类不再被认为是“坏的”并且有利可图的时候，便利就来了，同时也符合道德动机。\n当我们想到“肉类是有利可图的”时，没有任何符合道德规范的解决方案会立即浮现在我们的脑海中。这是因为在即将到来的转型中，最有可能捕捉价值的创新之一-养殖肉类-仍处于非常刚刚起步的阶段。养殖肉类有可能满足伦理关切，而不会带来改变消费者基本偏好的不便--毫不妥协地服务于利他主义。取而代之的是，它寻求通过增加便利性来增强消费者的内在动机，产生一种更具可扩展性和更具防御性的替代方案，以取代竞争对手的植物性创新。\n面对这场迈向肉类消费最后阶段的运动，“肉类是有利可图的”，很明显，伦理消费叙事继续演变为无可辩驳的消费转型。虽然Beyond Meat的成功在很大程度上依赖于其应对道德消费主义趋势的能力，但由于其改变消费者行为的内在要求，它面临着局限性。\n1.挖掘伦理消费主义叙事：养殖肉类生产与家畜肉类生产对环境的影响。\n道德消费主义是由工业化肉类生产对土地的环境影响、温室气体排放和能源消耗等因素推动的。\n“有一个…。供人类消费的牲畜和农作物之间土地使用的高度不平等分配。如果我们将用于放牧的牧场和用于种植动物饲料作物的土地结合起来，畜牧业占全球耕地的77%。虽然畜牧业占据了世界上大部分的农田，但它只生产了世界18%的卡路里和37%的总蛋白质。\n路透社的图表“养殖肉类-什么是利害关系”比较了养殖肉类能够将刻度盘转向可持续生活的规模，养殖肉类需要的土地和水比畜牧业少99%。\n马丁·菲什宾(Martin Fishbein)和伊切克·阿杰森(Icek Ajzen)于60年代末形成的理性行动理论认为，消费者做出决定是基于创造或接收特定结果的意图。如果我们假设消费者是理性的行为者，那么当他们意识到他们的决定将得到同样具体的结果时，他们可能会采取具体的行动。从本质上讲，意志和意图决定行为。这一理论经常被抽象到营销领域，但我们可以看到道德消费主义作为一个更广泛的概念是如何在消费者身上吸引这一特征的。寻找道德产品的具体行为会受到消费者价值观、社会地位和道德考量的影响。\n在这里，“养活世界”的紧迫性被描绘成一个社会问题，然而，种族实际上并不是由养活世界的利他主义来定义的，而是在哪里会产生价值。可持续和人性化的农业是该行业内经济自然演变的一个令人高兴的副产品。\n挤压加工技术-在挤压过程中，蛋白质会受到热应力和机械应力，从而产生植物性肉类的质地和形状。\n布勒集团(Buhler Group)：一家瑞士跨国公司，以涉及谷物/食品、消费食品和用于食品生产的先进材料的设备和服务而闻名。他们的挤压技术涵盖了从原料进料到烹饪、干燥和冷却的整个过程。\n未来食品技术：获得专利的生物反应器供应商，提供任何人都需要的硬件和细胞系，才能成为实验室培养肉的制造商。\n这些公司最贴近消费者终端，并解决最终产品的生产和分销以供消费。由于该行业刚刚起步，我们经常会发现垂直解决方案以端到端服务提供商的形式运营，而该行业则围绕创新建设基础设施。\nBeyond Meat：生产植物性最终产品的生产商。除了接受基本成分和关键蛋白质的供应外，该公司还负责向零售商和消费者进行生产、包装和分销。\n孟菲斯肉类：嘉吉(Cargill)和泰森食品(Tyson Foods)等大牌公司已经投资，并可能成为生产和分销供应链的合作伙伴。或者，当他们生产投放市场的产品时，他们将不得不扩大与Beyond Meat类似的设施，以满足需求。\n霍梅尔(Hormel)和泰森(Tyson)等大型食品公司正在采取行动，与可能扰乱其现有价值链的技术展开竞争。虽然他们甚至在Beyond Meat之类的产品上市之前就推出了植物性肉类替代品(例如素食汉堡肉饼)，但他们的消费者信息并不那么排外。早期大型食品的口感和质地不太理想，再加上对现有企业的商业认知，使这些公司无法走在“道德消费主义”浪潮的前列。面对这种情况，许多大型食品公司现在都在直接投资或与更专业的替代肉类生产商合作。\n投资：孟菲斯肉类(养殖肉类)和Aleph Farm(养殖肉类)产品：推出2020年植物性肉类产品来源\n为了顺应更广泛的道德消费趋势，我们可以观察到，纳入环境、社会和公司治理(ESG)筛选的基金数量有所上升-截至2019年底，564只ESG对价基金管理着9330亿美元的资产。ESG对价基金被定义为在其战略中进行考虑但不将可持续性作为中心目标的公司。由于道德消费主义的萌芽和更广泛的ESG转型，在明确承诺可持续基金方面的努力要少得多也就不足为奇了。\n与这种想法类似，Beyond Investment，一家影响力投资平台与其研究部门Beyond Advisors在2018年6月推出了美国素食气候指数(素食)指数。素食指数以Solactive美国大盘股指数(代表标准普尔500指数)为基础，是一个被动的、基于规则的美国主要大盘股指数，根据素食和气候意识原则进行筛选。美国素食气候ETF(素食：US)提供对该指数的直接敞口。美国素食气候指数(素食)：\nSolactive的市值的41%。被排除在外的大型公司被中型公司取代，这些公司坚持允许指数在不残酷的素食转型中受益于增长价值的原则。\n动物检测：15.9%动物产品：13.3%体育或娱乐动物：0.3%化石燃料：4.9%化石燃料能源生产：2.9%军事和国防：3.8%其他环境和人权侵犯行为：0.8%。\n这一新指数的投资者每投资1,000美元，就可以避免每年屠宰13头动物", "note_en": "Ethical consumerism has become the new business buzzword, very much an extension of the earlier commercial virtue-signalling we saw as swathes of business added ‘sustainability’ to their company goals. It’s apparent that no industry has left this narrative unturned, from the rise of ‘organic’ products in cosmetics to ‘green’ products in financial markets. But if we’re talking about ethical consumerism from a revenue-generating perspective, how successfully do altruistic motives actually change the structural habits of consumers?\n Perhaps one of the most pertinent business ventures to explore for its relevance to this question would be meat substitute producer, Beyond Meat. As we see ads for the Beyond Burger or an option in the restaurant’s menu for a Beyond Meat dish, we can feel the desire to be an ethical consumer shift from the periphery to the fore. Having reached a peak valuation of $14 billion as the stock price broke the $200 mark in 2019, Beyond Meat investors need to ask the question; whether the social construct of ethical consumerism can lend itself to not just profitable but also defensible business models?\n Beyond Meat entered the market at a pivotal time, when the consumer preference for sustainable and healthy living had matured from dinner table discussions into tangible demand. Recognising that ethical consumerism was now becoming an available part of the cultural narrative and supercharging this, allowed them to catalyse an impact that incumbents had not been able to.\n To understand how the trend of meat consumption may evolve, we can look at a parallel concept in ethical consumerism with a very similar trendline. While food and waste is not something we often think of in tandem, the necessary change facing the meat industry is very similar to what happened surrounding waste and pollution as we scaled production post industrialisation. We slowly but surely realised that while waste could not be done away with, it was in urgent need of management.\n  “The ruling paradigm up until the 1970s was that waste is a natural by-product of efficient manufacturing in a world in which resources are plentiful. Once we became aware of resource constraints and of pollution, we gradually acquired a new perspective: waste is bad. This new paradigm became more powerful and led to cleaner production and recycling. Another paradigm shift is currently underway: the idea that waste is wealth – the cradle-to-cradle paradigm. The new rallying cry is not to produce less, but to produce differently.”\n  Similarly, the narrative around meat has also evolved from ‘meat is a necessary staple’ to ‘meat is bad’, with WEF pushing a global effort to find alternative sustainable protein provisioning.\n  Beyond Meat has leveraged the “meat is bad” narrative to create its existing customer base.  These customers, in the face of their growing desire to ethically consume, are self-motivated to look beyond ingrained habits of meat-consumption to arrive at plant-based alternatives. Having captured a share of these ‘self-motivated customers’ it continues to optimise for taste and texture, with an increased effort to better address customer expectations of health.\n  Despite these efforts to increase market share, Beyond Meat’s customer base will most likely be limited to the finite number of ‘self-motivated’ consumers. Importantly it should be noted that 93% of Beyond Meat’s consumers are in actual fact  meat – eaters, not vegetarian or vegans as popularly perceived. Then self-motivation is a tricky proposition to scale for a primarily flexitarian consumer base. The next phase of transformation and access to the larger flexitarian market will be catalysed at the point where convenience reduces the necessity for self-motivation. Convenience arrives when meat is no longer considered ‘bad’ and is profitable, while aligning with ethical motivations.\n  When we think of ‘meat is profitable’, no ethically aligned solutions immediately spring to mind. This is because one of the innovations best positioned to capture value in this oncoming transformation – cultured meat – is still very much in its nascency. Cultured meat has the potential to satisfy ethical concerns without the inconvenience of changing fundamental consumer preferences – serving altruism without compromise. Instead, it seeks to augment the consumer’s inherent motivation with added convenience, producing a more scalable and defensible alternative to competing plant-based innovations.\n In the face of this movement towards the final stage of meat consumption, ‘meat is profitable’, it becomes apparent that the ethical consumption narrative continues to evolve into an irrefutable consumer transformation. While Beyond Meat’s success has largely pivoted on its ability to address the trend of ethical consumerism, it faces limitations because of its inherent requirement to change consumer behaviour.\n   1. Tapping into the ethical consumerism narrative: The environmental impact of cultured meat production vs livestock meat production\n Ethical consumerism is driven by factors of environmental impact on land, greenhouse emission and energy consumption as a result of industrialised meat production.\n “There is … a highly unequal distribution of land use between livestock and crops for human consumption. If we combine pastures used for grazing with land used to grow crops for animal feed, livestock accounts for 77% of global farming land. While livestock takes up most of the world’s agricultural land it only produces 18% of the world’s calories and 37% of total protein.”\n The Reuters diagram “ Cultured Meat – What’s at Stake” compares the scale at which cultured meat would be able to shift the dial towards sustainable living, with cultured meat requiring 99% less land and water than livestock agriculture.\n   The theory of reasoned action, formed in the late 60s by Martin Fishbein and Icek Ajzen posits that consumers make decisions based on an intention to create or receive a specific outcome. If we’re assuming the consumers are rational actors, then they may act specifically when they perceive their decision will be met with an equally specific result. Essentially that volition and intention predict behaviour. This theory has often been abstracted into the field of marketing, but we can see how ethical consumerism as a broader concept appeals to this trait in the consumer. The specific act of seeking out ethical products is met with a signalling of the consumer’s values, social standing and ethical considerations.\n         There is an urgency here in “feeding the world” that is portrayed as a social issue, however, the race is in fact not defined by altruism to feed the world, but rather where value will accrue. Sustainable and humane agriculture is a happy byproduct of the natural evolution of economics within the industry.\n Source: Editor’s Essay | The new asymmetric play in agronomy* –  4th Quadrant\n    The alternative meat industry is projected to capture 10% of the $1.4 trillion global meat industry reaching $140 billion over the next decade ( Barclays). Direct exposure to this could be distributed across three types of companies that operate in the alternative meat industry.\n These are the companies solving for the specific technological components required to make alternative meat a scalable, affordable product\n Protein source - pea and soy protein are used the most in the alternative meat industry due to consumer familiarity and cost-effectiveness but as protein producers and alternative meat producers compete to innovate and drive the price down, new entrants or variations of existing proteins may emerge at a more competitive price.\n Cargill: currently the company offers plant-based protein through the food and beverage segment - a protein market predicted to reach $40.6 billion by 2025. It offers a range of proteins including soy, corn and pea.    Solar Foods: a Finnish company working on fermented protein powder called Solein. Solein is made by applying electricity to water,  releasing bubbles of carbon dioxide and hydrogen captured from the air. It results in a near tasteless powder which is about 65% protein and will cost about €5 per kilo when it hits the market in 2021\n Medium for cultured meat growth - currently the industry is seeking a more efficient medium than the predominantly used fetal bovine serum (FBS) currently sitting around a $1000/L price point.\n Biftek.co: creating a plant-based medium to grow muscle stem cells instead of conventional fetal-bovine-serum (FBS)   Meatable:  eliminates the need to remove any tissue from an animal – a development that would make it the least invasive method for sourcing cells yet.\n These are companies that bridge the gap between cultured meat technology and other meat producers through the supply of components required for the transforming manufacturing line.\n Extrusion process technology - during extrusion, proteins undergo thermal and mechanical stresses that create the plant-based meat texture and form\n Buhler Group: a Swiss multinational company that is known for equipment and services that touch on grain/foods, consumer foods and advanced materials for food production. Their extrusion technology covers the entire process from raw material intake to cooking, drying and cooling.\n  Future Food Technologies: patented bioreactor supplier of the hardware and cell lines that anyone would need to become a manufacturer of lab-grown meat.\n These are companies closest to the consumer end and solve for the production and distribution of end product for consumption.   Due to the nascency of the industry, we would often find vertical solutions that operate as end-to-end service providers while the industry builds infrastructure around the innovations.\n  Beyond Meat:  producer who manufactures plant-based end-products. Apart from receiving a supply of basic ingredients and key proteins, the production, packaging and distribution to retailers and consumers are conducted by the company.\n  Memphis Meats: big names such as Cargill and Tyson Foods have invested and could potentially act as partners for the production and distribution supply chains.   Alternatively, when they produce the go-to-market product, they will have to scale facilities similar to Beyond Meat to meet the demand.\n  Big food companies like Hormel and Tyson, are moving to compete with the technologies that could disrupt their existing value chains. While they introduced plant-based meat substitutes (e.g. vegetarian burger patties) even before the likes of Beyond Meat came onto market, their consumer messaging was less exclusive. The less optimised taste and texture of the earlier big food products, coupled with commercial perception of incumbents prevented these companies from frontrunning the wave of ‘ethical consumerism’. In the face of this, many big food companies are now investing directly in or partnering with more specialised alternative meat producers.\n Investments: Memphis Meats (Cultured meat) and Aleph Farms (Cultured meat) Products: Launching 2020 plant-based meat product   source\n  In an endeavour to ride the broader ethical consumerism trend, we can observe the rise in the number of funds that incorporate environmental, social and corporate governance (ESG) screening –  with 564  ESG Consideration funds holding $933 billion in assets under management at the end of 2019. ESG Consideration funds are defined as companies that make considerations in their strategy but do not adopt sustainability as a central objective. As a result of the nascency of ethical consumerism and the broader ESG transformation it’s not surprising to see a much smaller cohort of efforts in a clear commitment to sustainable funds.\n Akin to this thinking, Beyond Investing, an impact investing platform together with its research arm Beyond Advisors launched a US Vegan Climate Index ( VEGAN)  in June 2018. Based on the Solactive US Large Cap Index (a proxy to S&amp;P 500), the VEGAN index is a passive, rules-based index of U.S. mainly large-cap stocks, screened according to vegan and climate-conscious principles. US Vegan Climate ETF ( VEGAN:US) provides direct exposure to this index.  US Vegan Climate Index ( VEGAN):\n 41% of the market capitalization of the Solactive.  The excluded large-cap companies are replaced with mid-cap companies that adhere to the principles allowing the indices to benefit from the growth value in cruelty-free, vegan transformation.\n Animal testing: 15.9% Animal-derived products: 13.3% Animals in sport or entertainment: 0.3% Fossil fuel: 4.9% Energy production from fossil fuel: 2.9% Military and defence: 3.8% Other environmental and human rights violations: 0.8%\n An investor in this new index will avoid funding the slaughter of 13 animals a year for every $1,000 invested", "posttime": "2020-06-10 09:15:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "肉类,scaling", "title": "超越肉类：攀登道德消费主义", "title_en": "Beyond Meat: Scaling ethical consumerism", "transed": 1, "url": "https://4thquadrant.io/exclusive/beyond-meat-scaling-ethical-consumerism/", "via": "", "real_tags": ["肉类", "scaling"]}, {"category": "", "categoryclass": "", "imagename": "af976d1d65fe3bd472c69a6ac8cb255f.gif", "infoid": 1005939, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "法拉利·诺维的布局非正统，与其他古罗马城市相比，标准化程度较低。之前使用磁力计(另一种非侵入性扫描方法)的工作识别了城市内的神圣空间。这项新工作确定了这一边缘空间内的大型建筑，特别是在法勒里诺维大门旁边。\n研究人员在研究中写道：“虽然我们还不清楚这片神圣的景观是如何发挥作用的，但这项调查为人们提供了新的见解，让人们对有时被错误地认为是‘标准化’的罗马城镇规划背后的各种规划概念有了新的认识。”通过与庞贝等更熟悉的城镇进行对比，这项工作也提出了更普遍的罗马城镇规划的重要问题。\n为了处理海量数据，研究人员正在开发一种自动化过程来帮助分析，这将涉及到计算机辅助对象检测。这可能会带来进一步的洞察力和发现。\n更重要的是，这篇新论文代表了一个重要的概念证明，展示了如何在将一切放在原位的同时，详细研究古代历史。", "note_en": "For the first time ever, archaeologists have used ground-penetrating radar to map an entire city while it’s still beneath the ground.\n  A preliminary map of Falerii Novi, an ancient Roman city located 50 kilometers (31 miles) north of Rome, has been compiled with data taken from ground-penetrating radar. It’s “preliminary” because it wasn’t humanly possible for the researchers to fully analyze the 28 billion data points collected during the course of the project, explained Martin Millett, a co-author of the study and an archaeologist at the University of Cambridge, to Gizmodo.\n     The researchers were able to document the locations of buildings, monuments, passageways, and even water pipes—all without having to pick up a single hand trowel. In addition to documenting these previously unknown architectural features, the scientists were able to chronicle changes to the city over time and discern unique elements not seen elsewhere in ancient Rome. The new research was published today in the scientific journal Antiquity.\n Falerii Novi is well documented in historical accounts, representing just one of roughly 2,000 cities across the Roman Empire. It first appeared in 241 BCE and was occupied until the Medieval period, when it was finally abandoned around 700 CE.\n    For the new survey, Millett and his colleagues used an all-terrain vehicle to tow a rig equipped with ground-penetrating radar. The scientists made scans every 12.5 centimeters (4.9 inches) across the entire 75-acre site. Falerii Novi was chosen as a good place to test the technology, as the town is not obscured by forests or buried beneath newer structures. What’s more, the site is protected under Italian law.\n  “But even if this city wasn’t protected by law, it would’ve been impossible to excavate on this scale,” Millett told Gizmodo, adding that it has taken nearly 200 years to excavate Pompeii, another ancient Roman city.\n   Equipped with their radar scans, the archaeologists documented a bath complex, a market, a pair of temples along the periphery, an outdoor theatre, atrium homes, and a shopping area. They also discovered a large public monument consisting of two structures facing each other in a configuration not seen elsewhere in ancient Rome.\n “Part of the importance is that our survey is showing us an ordinary Roman town in Italy, not a special town—but it is extremely impressive to see this level of architectural detail across the whole site,” said Millett.\n  Falerii Novi had an unorthodox layout and was less standardized compared to other ancient Roman cities. Previous work with magnetometers, another non-invasive scanning method, identified sacred spaces within the city. The new work identified large buildings within this marginal space, particularly next to Falerii Novi’s gates.\n   “Although we are yet to understand how this sacred landscape functioned, the survey provides new insights into the variety of planning concepts underlying what are sometimes incorrectly considered to be ‘standardized’ Roman town plans,” wrote the researchers in the study. “By providing a contrast with more familiar towns such as Pompeii, this work also raises important questions about the planning of Roman towns more generally.”\n   To cope with the massive amount of data, the researchers are developing an automated process to help with the analysis, which will involve computer-aided object detection. This could result in further insights and discoveries.\n What’s more, the new paper represents an important proof-of-concept, showing how ancient history can be studied in detail while leaving everything in its place.", "posttime": "2020-06-10 09:12:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "雷达,penetrating,诺维", "title": "探地雷达揭示了整个古罗马城市", "title_en": "Ground-Penetrating Radar Reveals Entire Ancient Roman City", "transed": 1, "url": "https://gizmodo.com/ground-penetrating-radar-reveals-entire-ancient-roman-c-1843955472", "via": "", "real_tags": ["雷达", "诺维"]}, {"category": "", "categoryclass": "", "imagename": "e7b6ec570aa857f9fca14b59393bf9d2.png", "infoid": 1005938, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个非营利性组织(由Salman Khan创立)，致力于全民免费教育事业。它提供了关于应用数学中各种主题的互动和基于视频的模块。\n标准化的备考平台，价格实惠。配备了定时练习题、远程视频课程、实时性能统计和远程协助。既有台式机版，也有移动版。\nOpenSTax是由赖斯大学(Rice University)创立的一个非营利性的教育技术倡议，它以该领域专家撰写的数字形式提供免费的、同行评议的数学教科书。这些教科书的印刷版也可以低价购买。\n保罗的在线数学笔记由拉马尔大学(Lamar University)的一位数学教授创建，提供一整套关于特定数学主题的免费数学笔记和教程，其中集成了复习问题和解决方案，以及其他方便的功能，如小抄和表格。\n一个致力于数学和科学天赋学生的社交学习平台，用户通过解决难度增加的有趣问题来学习。\n一个专门的、基于社区的数学证明维基，包含了来自数学所有分支的定义、公理和定理的庞大曲目。网站上的随机证明页面也被证明是有趣的。\n提供高等数学教育材料的在线平台，形式为综合模块、电子课本和视频课程。\n一个提供大学课程的在线平台，在这里人们可以免费或以最低的费用直接从顶尖大学获得更高的数学教育。\n专门的平台，如论坛和问答平台-人们聚集在这里，极客们谈论高等数学。\n网络上最受欢迎的问答网站之一。自从2015年5月整合LaTeX以来，Quora已经成为全球高等数学爱好者询问和回答与其感兴趣领域相关的超具体问题的枢纽。\n一个专门的问答网站，面向数学学生和专业人士。有技术倾向的人最喜欢的地方。", "note_en": "A non-profit organisation (founded by Salman Khan) dedicated to the cause of  free education for all. It provides   interactive  and   video-based modules  on a diverse range of topics in applied mathematics.\n Standardized test preparation platform at an affordable cost. Equipped with   timed practice questions,   video lessons ,  performance statistics  and  remote assistance. Available in both  desktop and  mobile.\n A non-profit, ed-tech initiative founded at Rice University,    OpenStax  provides free, peer-reviewed math textbooks  in digital forms written by experts in the field. Printed versions of the textbooks are also available for purchase at a low cost as well.\n Founded by a math professor of Lamar University,    Paul&#39;s Online Math Notes  provides a complete set of free math notes  and tutorials  on specific math topics, with review questions and solutions integrated in between and other handy features such as cheat sheets and tables.\n A   social learning platform  dedicated to  gifted students in math and science, where users learn by solving interesting problems of increasing difficulties.\n A specialized, community-based wiki for  mathematical proofs, housing a giant repertoire of  definitions,   axioms  and  theorems  from all branches of mathematics. Also proved to be interesting is the    random proof page  on the site.\n Online platforms with educational materials in higher mathematics, in the form of integrated modules , eTextbooks  and video courses.\n An online platform for  university courses , where one can get higher math education directly from top universities for free or for a minimal fee.\n In fact, with    ~30 math courses  from  statistics,  discrete math,  calculus,  differential equation to  probability theory,  Galois theory,  game theory and  complex analysis offered by universities such as Stanford and Yale, it&#39;s hard to get any better than that!\n A pion eering educational company which partners with world-renowned math experts to offer    40+ online math courses , with materials presented in  textual,  audio and  visual formats.\n A comprehensive platform with most of the undergraduate / graduate-level math courses offered by  MIT , featuring video instructions, eTextbooks, presentation slides and other helpful materials.\n Graphing calculators,   data analyzers,   symbolic calculators,   LaTeX editors  — among other stuffs that computer does the best.\n A powerful   answer engine  /   knowledge database  based on dynamic computations. A favorite among technical scientists.\n A powerful HTML5   online graphing calculator  with minimalist interface and stunning graphic / animation capabilities. Check out our    Desmos guide  to learn more.\n Online  graphical calculator  on steroids with calculus and statistics tools, plus other web applications for  3D graphing  and the creation of  geometrical figures . The favorite part? Graphs and figures created in GeoGebra can be exported to TikZ, thereby making drawing less time-consuming in LaTeX.\n A   cloud-based LaTeX editor  with real-time collaboration and rich text capabilities. It also provides an extensive database of LaTeX templates that one can choose from.\n Specialized platforms such as   forums  and   question-and-answer platforms  — where people gather and geek out about higher mathematics.\n One of the most popular   question-and-answer site  on the Web. Since its LaTeX integration in May 2015, Quora has become a hub where higher mathematics enthusiasts around the world ask and answer ultra-specific questions related to their fields of interest.\n  A specialized   question-and-answer website  for math students and professionals alike. A favorite place among the technically inclined.", "posttime": "2020-06-10 09:12:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "covid,math,数学", "title": "后Covid时代可以学习数学的15个数学网站", "title_en": "Fifteen math sites to learn math from in the post-Covid era", "transed": 1, "url": "https://mathvault.ca/website/", "via": "", "real_tags": ["covid", "math", "数学"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005937, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "科学家们在欧洲一些人口最稠密的地区附近发现了活火山活动的新证据。这项研究从西欧各地的天线“众包”GPS监测数据，以跟踪地球表面的细微运动，人们认为这是由地下地幔羽流上升引起的。这项研究发表在“地球物理杂志国际”上。\n埃菲尔地区大致位于德国中西部的亚琛、特里尔和科布伦茨三个城市之间。它拥有许多古老的火山特征，包括被称为“马尔斯”的圆形湖泊。\n这些是猛烈火山喷发的残留物，比如创造了该地区最大的湖泊拉切湖(Laacher See)的那次火山喷发。造成这一现象的爆炸被认为发生在大约1.3万年前，其爆炸力与1991年灾难性的皮纳图博火山喷发类似。\n可能为这一古老活动提供动力的地幔羽流被认为仍然存在，向下延伸到地球400公里处。然而，它是否仍然活跃还是个未知数：“大多数科学家认为艾菲尔的火山活动已经成为过去，”这项新研究的主要作者科内·克里默(CornéKreemer)教授说。“但把这些点连在一起，似乎很明显，在西北欧的心脏深处正在酝酿着一些东西。”\n在这项新的研究中，这个位于美国内华达大学雷诺分校(University of Nevada，Reno)和美国加州大学洛杉矶分校(University of California，Los Angeles)的团队使用了西欧各地数以千计的商业和国有GPS天线的数据，绘制出随着地壳的推动、拉伸和剪切，地面是如何垂直和水平移动的。\n研究显示，该地区的陆地表面在以埃菲尔为中心的大片区域内向上和向外移动，包括卢森堡、比利时东部和荷兰最南端的林堡省。\n“埃菲尔地区是研究中唯一一个地面运动明显大于预期的地区，”Kreemer教授补充道。“研究结果表明，上升的羽流可以解释观测到的地面运动模式和速度。”\n这些新的结果补充了之前发表在“国际地球物理杂志”上的一项研究，该研究发现了岩浆在湖下运动的地震证据。这两项研究都指出艾菲尔是一个活跃的火山系统。\n这项研究的含义是，欧洲这一地区不仅火山风险可能增加，而且还可能存在长期的地震风险。然而，研究人员敦促谨慎：“这并不意味着该地区即将发生爆炸或地震，甚至可能再次发生爆炸或地震。我们和其他科学家计划继续使用各种地球物理和地球化学技术监测该地区，以便更好地了解和量化任何潜在的风险。“。\n这项新工作发表在“欧洲西北部艾菲尔火山区之下存在浮地幔柱的大地测量证据”，C.Kreemer，G.Blewitt，P.Davis，“地球物理杂志国际”(2020年)，印刷中(doi：10.1093/gji/ggaa227)。\n皇家天文学会(RAS)成立于1820年，鼓励和促进天文学、太阳系科学、地球物理学和密切相关的科学分支的研究。皇家天文学协会组织科学会议，出版国际研究和评论期刊，通过颁发奖章和奖品来表彰杰出的成就，保持着广泛的图书馆，通过赠款和推广活动支持教育，并在全国和国际上代表英国天文学。它的超过4400名成员(研究员)，三分之一在海外，包括大学、天文台和实验室的科学研究人员以及天文学历史学家和其他人。\nRAS根据同行评审的原则接受其期刊的论文，在这一原则下，编辑委员会的其他专家认为论文值得考虑。该协会基于类似的原则发布新闻稿，但相关组织和科学家对其内容负有全面责任。\n到2020年，RAS已经有200年的历史了。该协会在英国各地举办了一系列活动来庆祝成立200周年，包括公开讲座、展览、管风琴演奏会、弹出式天文馆，以及RAS 200：天空与地球项目的高潮。", "note_en": "Scientists have discovered new evidence for active volcanism next door to some of the most densely populated areas of Europe. The study ‘crowd-sourced’ GPS monitoring data from antennae across western Europe to track subtle movements in the Earth’s surface, thought to be caused by a rising subsurface mantle plume. The work is published in   Geophysical Journal International.\n The  Eifel region lies roughly between the cities of Aachen, Trier, and Koblenz, in west-central Germany. It is home to many ancient volcanic features, including the circular lakes known as ‘ maars’.\n These are the remnants of violent volcanic eruptions, such as the one which created  Laacher See, the largest lake in the area. The explosion that created this is thought to have occurred around 13,000 years ago, with a similar explosive power to the cataclysmic  Mount Pinatubo eruption in 1991.\n The  mantle plume that likely fed this ancient activity is thought to still be present, extending up to 400km down into the Earth. However, whether or not it is still active is unknown: “Most scientists had assumed that volcanic activity in the Eifel was a thing of the past,” said Prof. Corné Kreemer, lead author of the new study. “But connecting the dots, it seems clear that something is brewing underneath the heart of northwest Europe.”\n In the new study, the team – based at the  University of Nevada, Reno and the  University of California, Los Angeles in the United States – used data from thousands of commercial and state-owned GPS antennae all over western Europe, to map out how the ground is moving vertically and horizontally as the Earth’s crust is pushed, stretched and sheared.\n The research revealed that the region’s land surface is moving upward and outward over a large area centred on the Eifel, and including Luxembourg, eastern Belgium and the southernmost province of the Netherlands, Limburg.\n “The Eifel area is the only region in the study where the ground motion appeared significantly greater than expected,” adds Prof. Kreemer. “The results indicate that a rising plume could explain the observed patterns and rate of ground movement.”\n The new results complement those of a  previous study in  Geophysical Journal International that found seismic evidence of magma moving underneath the Laacher See. Both studies point towards the Eifel being an active volcanic system.\n The implication of this study is that there may not only be an increased volcanic risk, but also a long-term seismic risk in this part of Europe. The researchers urge caution however: “This does not mean that an explosion or earthquake is imminent, or even possible again in this area. We and other scientists plan to continue monitoring the area using a variety of geophysical and geochemical techniques, in order to better understand and quantify any potential risks.”\n           The new work appears in, “Geodetic evidence for a buoyant mantle plume beneath the Eifel volcanic area, NW Europe”, C. Kreemer, G. Blewitt, P.M. Davis, Geophysical Journal International (2020), in press (DOI: 10.1093/gji/ggaa227).\n   The Royal Astronomical Society ( RAS), founded in 1820, encourages and promotes the study of astronomy, solar-system science, geophysics and closely related branches of science. The RAS organises scientific meetings, publishes international research and review journals, recognises outstanding achievements by the award of medals and prizes, maintains an extensive library, supports education through grants and outreach activities and represents UK astronomy nationally and internationally. Its more than 4,400 members (Fellows), a third based overseas, include scientific researchers in universities, observatories and laboratories as well as historians of astronomy and others.\n The RAS accepts papers for its journals based on the principle of peer review, in which fellow experts on the editorial boards accept the paper as worth considering. The Society issues press releases based on a similar principle, but the organisations and scientists concerned have overall responsibility for their content.\n In 2020 the RAS is 200 years old. The Society is celebrating its bicentennial anniversary with a series of events around the UK, including public lectures, exhibitions, an organ recital, a pop-up planetarium, and the culmination of the  RAS 200: Sky &amp; Earth project.", "posttime": "2020-06-10 08:55:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "活动,volcanism,研究", "title": "北欧心脏下火山活动的新迹象", "title_en": "New hints of volcanism under the heart of northern Europe", "transed": 1, "url": "https://ras.ac.uk/news-and-press/research-highlights/new-hints-volcanism-under-heart-northern-europe", "via": "", "real_tags": ["活动", "volcanism", "研究"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005936, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近，Raspberry Pi基金会宣布了Raspberry Pi 4的USB引导测试版。很长一段时间以来，我对Raspberry Pi最大的抱怨是I/O速度有限(特别是主引导卷)。而在较老的PI上，最大外部磁盘速度尤其受到USB2.0总线的限制-该总线与网络适配器共享，进一步限制了其带宽-即使是USB引导也不会让事情变得令人惊叹。\n但是PI4不仅把网卡和USB总线分开，它还有USB3.0，理论上可以比USB2.0快10倍。所以当USB引导测试版发布的时候，我想试一试。在测试了一下之后，我决定将PI 4作为我的全职工作站使用一天，看看它是否能应付得来，以及它的不足之处。我很快就会发布一段视频和博客文章，介绍更多关于这段经历的细节。\n首先，我用最新的64位测试版Raspberry PI OS刷新了一张32 GB的SanDisk Extreme Pro microSD卡。将来，您将能够从常规的Pi OS下载页面下载它，但目前它可以从这个论坛主题中获得。\n要想刷卡，我的Mac上还是要用好的老式dd，不过你可以用树莓PI成像仪来代替。\n注意：如果您在这里做错了什么，您可能会损坏PI的固件并使其无法操作。如果您尝试使用此测试版功能，我不能对您的PI发生的任何事情负责！\n在Raspberry PI OS中打开终端(注意：如果您想设置无头PI，可以通过SSH从另一台计算机执行这些步骤)。\n接下来，您需要将PI OS刷新到外部USB SSD或HDD。首先，最好在PI启动时将驱动器插入PI，并确保PI能够识别它(它应该显示在您的桌面上，或者您也可以使用lsusb查找它)。并非所有外置驱动器和USB转SATA适配器都能开箱即用。\n如果你想知道，我正在Inateck USB3.0 SATA机箱内使用便宜的Kingston A400 240 GB固态硬盘。是的，这些都是附属链接。\n因此，将USB驱动器插入您的主计算机(您之前在那里刷新了microSD卡)，并将Raspberry PI OS闪存到它，就像您对microSD卡执行的操作一样。\n弹出引导卷之前，需要用GitHub提供的最新版本替换引导卷上的一些文件：\n转到raspbercrypi/Firmware GitHub存储库并下载zip或将项目克隆到您的计算机(获取默认的主分支)。\n在引导文件夹内，将以.elf或.dat结尾的所有文件复制到USB驱动器的引导卷中(替换已存在的同名文件)。\n如果PI当前正从microSD卡运行，请将其关闭。然后拔下microSD卡，并插入USB驱动器。\n确保将驱动器插入USB 3.0端口(蓝色的)，而不是USB 2.0端口(黑色的)，否则您的吞吐量将受到严重限制。\n打开PI的电源，大约一分钟后(它必须扩展USB驱动器以填满卷，然后重新启动)，它应该会启动！\n不过，如果您和我一样，您可能会在软重启后进入此屏幕：\n这没问题；这似乎与系统重新启动后引导加载程序无法通过USB-HDD启动的错误有关，解决方案(目前)是拔下PI以完全关闭电源，然后再将其插入。\n现在，假设您的USB驱动器或SATA适配器是兼容的，PI应该会立即启动，您会发现它比以前从microSD卡启动时要快得多！\n为了了解从microSD卡启动时访问磁盘的原始性能差异(根据我2019年Raspberry PI microSD卡的比较，这是您可以购买的最好的卡之一)与从Kingston USB SSD启动之间的原始性能差异。\n第一个基准测试综合了大文件写入活动和小(4K)文件随机访问读/写活动。两者都很重要，但在许多方面，当使用PI这样的通用计算机时，后者的差异被放大，因为计算机不像摄像机或无人机那样整天读写大文件(大量顺序访问)(这是大多数microSD卡进行优化的使用案例)。\n如果您希望自己运行此基准测试，请参阅Pi Dramble Wiki的磁盘访问基准测试页面。注意，对于USB SSD，我修改了hdparm测试以使用路径/dev/sda1，而不是/dev/mmcblk0。\n在您问：是的，我运行了四次这些基准测试(放弃第一个结果)之前。我把它们放在一个全新的闪光系统上运行。我用完全相同的Raspberry Pi OS 64位测试版图像文件刷新了microSD卡和USB驱动器。我让PI在带风扇的情况下运行，PI在任何时候都没有油门。\n结果真的不言而喻。对于顺序操作，使用USB SSD比使用microSD卡快3-4倍。对于随机访问，随机读取速度稍快一些，但写入速度大约快8倍！这在许多活动中都有不同之处，比如启动应用程序，运行带有许多标签的网络浏览器。顺序性能意味着您应该能够轻松地流式传输和/或录制4K或HD视频，同时PI也有足够的带宽用于其他事情(假设您不通过CPU重新编码-这会杀死CPU)。\n为了了解磁盘访问如何影响我熟悉的真实应用程序的性能(并且能够使用非常精确的结果进行彻底的基准测试)，我还运行了一组Drupal基准测试，使用我在PI上运行多年的PI Dramble Drupal基准测试。我在安装的DrupalPI上运行它们，该安装在通过Nginx访问的Docker容器中运行Drupal和MariaDB。\n和以前一样，我将所有测试都运行了4倍，因为差别很大，所以我继续重新启动并再次运行它们；在相同的配置上，所有结果相差不到0.5%，所以很明显，SSD在许多操作中都有很大的不同-Drupal的安装和第一页加载导致数百个文件被访问和/或写入磁盘，所以在SSD上速度要快得多是有道理的。\n这些基准测试表明，对于某些操作，磁盘IO性能并不那么重要。在Drupal的例子中，处理和返回每个页面加载的响应所需的数据都被缓存(在PHP的例子中，在opcache中，也在数据库的缓存中，在它的查询缓存中)，因此实际的读取和写入都最小化了。\n那么我们接下来要去哪里呢？第一次，我想我是在说服自己，对某些人来说，树莓派4可能是一台称职的通用计算机。在过去，它主要是通用计算的一个有趣的旁观者，有一些严重的限制。从最初的型号B开始，所有的限制都被取消了，除了一些不错的功能(例如，内置的快速NVMe存储，可能完全支持USB-C，以及CPU的速度更快)之外，它实际上并没有那么糟糕了。(#**$${##**$$})。而且它很安静，如果你使用它没有外壳，或者与一个像样的散热盒，如Flirc(我与其他选项一起审查了最好的方式，以保持您的冷静运行树莓PI 4)。\n我不是在说陈词滥调：今天，我将树莓PI用于我所有的日常工作，看看在将其视为日常通用工作站的道路上有哪些坎坷的边缘。\n与我的Dell XPS 13和MacBook Pro 16相比，静音选项、非常低的功耗和相对较低的入门成本使PI 4比以往任何时候都更吸引人。\n在你深入评论并撕裂上面最后几段之前，请考虑一下，我不需要死亡之星级别的力量随时可用。我知道，一款64核、1 TB内存和1 TB NVMe固态硬盘RAID阵列的ThreadRipper将会在Raspberry PI 4上全力以赴。它的能效甚至更高(每单位计算的瓦数)！\n但我喜欢把它比作一辆卡车：如果你想拖8万磅的材料，你就需要一个结实的半挂车钻机(一台开线机)。但是，当你可以花十分之一的成本买到一辆小皮卡(一辆PI 4)时，你愿意把它停在你的车道上进行日常的轻型运输活动吗？它是不是更有趣(一般说来……)。开皮卡还是开半自动皮卡？\n尽管进一步扩大了比喻，PI可能更像是雪佛兰Aveo，而不是Macbook Air或戴尔XPS是皮卡。", "note_en": "Recently, the Raspberry Pi Foundation announced a  USB boot beta for the Raspberry Pi 4. For a very long time, the top complaint I&#39;ve had with the Raspberry Pi is limited I/O speed (especially for the main boot volume). And on older Pis, with the maximum external disk speed limited especially by the USB 2.0 bus—which was  shared with the network adapter, limiting its bandwidth further—even USB booting didn&#39;t make things amazing.\n But the Pi 4 not only separated the network adapter from the USB bus, it also has USB 3.0, which can be 10x faster than USB 2.0 (theoretically). So when the USB boot beta was announced, I wanted to put it through its paces. And after testing it a bit, I decided to use the Pi 4 as my full-time workstation for a day, to see whether it can cope and where it falls short. I&#39;ll be posting a video and blog post with more detail on  that experience very soon.\n  First, I flashed a  32GB SanDisk Extreme Pro microSD card with the latest 64-bit beta release of the Raspberry Pi OS. In the future, you&#39;ll be able to download it from the regular  Pi OS download page, but for now it&#39;s available from  this forum thread.\n To flash the card, I still rely on good old  dd on my Mac, but you can use the  Raspberry Pi Imager instead.\n NOTE: You could break your Pi&#39;s firmware and render it inoperable if you do something wrong here. I cannot be held responsible for anything that happens with your Pi if you try using this beta feature!\n  Opened Terminal in Raspberry Pi OS (note: you can do these steps from another computer via SSH if you want to set up the Pi headless).\n    Next, you need to flash the Pi OS to the external USB SSD or HDD. First things first, it&#39;s a good idea to plug your drive into the Pi while it&#39;s booted and make sure the Pi recognizes it (it should appear on your desktop, or you can also look for it with  lsusb). Not all external drives and USB to SATA adapters work out of the box.\n In case you&#39;re wondering, I&#39;m using a cheap  Kingston A400 240GB SSD inside an  Inateck USB 3.0 SATA enclosure. And yes, those are affiliate links.\n So plug the USB drive into your main computer (where you flashed the microSD card earlier), and flash the Raspberry Pi OS to it the same way you did to the microSD card.\n Before you eject the  boot volume, you need to replace some files on it with the latest versions from GitHub:\n Go to the  raspberrypi/firmware GitHub repository and download the zip or clone the project to your computer (get the default  master branch).\n Inside the  boot folder, copy over  all the files that end in  .elf or  .dat to the  boot volume of your USB drive (replacing the same-named files that already exist there).\n  Shut down the Pi if it&#39;s currently running from the microSD card. Then unplug the microSD card, and plug in the USB drive.\n Make sure you plug the drive into a USB 3.0 port (the blue-colored ones), and not one of the USB 2.0 ports (the black-colored ones), or else you&#39;ll be severely limited in throughput.\n Power up the Pi, and after a minute or so (it has to expand the USB drive to fill the volume and then reboot), it should boot up!\n If you&#39;re like me, though, you may run into this screen after the soft reboot:\n  That&#39;s okay; it seems related to the bug  Bootloader can&#39;t boot via USB-HDD after system reboot, and the solution (for now) is to unplug the Pi to power it down completely, then plug it back in.\n Now, assuming your USB drive or SATA adapter is compatible, the Pi should boot right up, and you&#39;ll find it much faster than before, when it was booting off a microSD card!\n  To get a sense of the raw performance difference between disk access while booted from the microSD card (one of the best you can buy, according to my  2019 Raspberry Pi microSD card comparison) versus booting from the Kingston USB SSD.\n The first benchmark gets a synthesis of large file write activity, plus small (4K) file random access read/write activity. Both are important, but in many ways, differences in the latter are amplified when using a general purpose computer like the Pi, because computers don&#39;t just read and write large files all day (lots of sequential access) like video cameras or drones do (that&#39;s the use case for which most microSD cards are optimized).\n If you want to run this benchmark on your own; it&#39;s documented in the  Pi Dramble Wiki&#39;s disk access benchmark page. Note that for the USB SSD, I modified the  hdparm test to use the path  /dev/sda1 instead of  /dev/mmcblk0.\n  Before you ask: yes, I ran these benchmarks four times (discarding the first result). I ran them on a clean brand new just-flashed system. I flashed both the microSD card and USB drive with the exact same Raspberry Pi OS 64-bit beta image file. I had the Pi running  in a case with a fan and the Pi did not throttle at any time.\n The results really speak for themselves. For sequential operations, using a USB SSD is 3-4x faster than using a microSD card. And for random access, random reads are a bit faster, but  writes are about  8x faster! This makes a difference in many activities, like launching apps, running a web browser with many tabs. And the sequential performance means you should be able to stream and/or record 4K or HD video easily while the Pi has enough bandwidth for other things too (assuming you&#39;re not re-encoding via the CPU— this kills the CPU).\n To get an idea of how the disk access affects the performance of a real-world application I&#39;m familiar with (and am able to benchmark thoroughly with highly accurate results), I also ran a set of  Drupal benchmarks, using the  Pi Dramble Drupal benchmarks I&#39;ve been running on Pis for years. I ran them against an installation of  Drupal Pi, which runs Drupal and MariaDB in Docker containers, accessed through Nginx.\n   Same as before, I ran all tests 4x, and since it was such a difference, I went ahead and rebooted and ran them again; all results were less than 0.5% apart on the same configuration, so it&#39;s pretty apparent the SSD makes a huge different in many operations—Drupal&#39;s installation and first page load result in hundreds of files being accessed and/or written to disk, so it makes sense it&#39;s a lot faster on the SSD.\n   These benchmarks show that for some operations, the disk IO performance is not that important. In Drupal&#39;s case, the data required to process and return the response for each page load is cached (both in PHP&#39;s case, in the opcache, and in the database&#39;s cache, in its query caches), so actual  reads and  writes are minimized.\n  So where do we go from here? For the first time, I think I&#39;m convincing myself that a Raspberry Pi 4 could be a competent general purpose computer  for some people. In the past it&#39;s mostly been a fun aside for general computing, with a number of severe limitations. Since the original model B, each of the limitations has been removed, and outside of a few nice-to-haves (e.g. built-in fast NVMe storage, maybe full USB-C support, and more speed from the CPU), it&#39;s actually not that bad. And it&#39;s silent, if you use it caseless or with a decent heat-sink case like the Flirc (which I reviewed alongside other options in  The best way to keep your cool running a Raspberry Pi 4).\n And I&#39;m not just speaking platitudes: today, I used the Raspberry Pi for all my daily work, to see what rough edges lay in the path towards considering it as a daily general purpose workstation.\n In comparison to my Dell XPS 13 and MacBook Pro 16, the option of silence, the very low power consumption, and the comparatively low cost of entry make the Pi 4 appealing for more use cases than ever before.\n Before you dive into the comments and tear apart the last few paragraphs above, please consider that I don&#39;t need &#39;death star&#39;-level power available at all times. I know a 64-core Threadripper with 1 TB of memory and a RAID array of 1 TB NVMe SSDs is going to beat the pants off a Raspberry Pi 4 at full tilt. It&#39;s even more power efficient (watts per unit of computing)!\n  But I like to compare it to a truck: if you want to haul 80,000 lbs of materials, you&#39;re going to need a beefy semi tractor-trailer rig (a Threadripper). But would you like to park that in your driveway for day-to-day light hauling activities when you could get a small pickup (a Pi 4) for 1/10th the cost? And is it more  fun (as a general rule...) to drive the pickup, or the semi?\n  Though stretching the analogy a bit further, the Pi is probably more like a  Chevy Aveo compared to a Macbook Air or Dell XPS being the pickup truck.", "posttime": "2020-06-10 08:53:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "固态硬盘,硬盘,raspberry-pi,固态,raspberry", "title": "我从USB固态硬盘启动我的树莓PI 4", "title_en": "I'm booting my Raspberry Pi 4 from a USB SSD", "transed": 1, "url": "https://www.jeffgeerling.com/blog/2020/im-booting-my-raspberry-pi-4-usb-ssd", "via": "", "real_tags": ["固态硬盘", "硬盘", "固态", "raspberry"]}]