[{"category": "", "categoryclass": "", "imagename": "4a17be94f6c3fa429b484b9567f7c7f0.jpg", "infoid": 1034316, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "花两天时间学习和接触打造太空旅行、探索、通信、制造等领域未来的人们。我们谈论的是来自公共、私营和国防部门的顶级行业创始人、投资者、政府和军方官员。\n3D打印有多酷？当你打印像蒂姆·埃利斯(Tim Ellis)这样的火箭时，它会以指数级的速度变得更酷，他是相对空间公司的首席执行官。这只是许多热门话题和经验丰富的领导者中的一个，他们等待着帮助你学习和推动你的业务向前发展。查看活动日程，现在就开始计划您的日程安排。\n您可以访问所有实时会话，还可以访问视频点播。无论您需要与客户见面，在展会上建立关系网，还是在世博会上查看早期参展商，VoD都能让您克服FOMO-害怕错过。\n网络对于初创企业的成功至关重要，我们的免费人工智能平台CrunchMatch使您可以轻松轻松地与与您的业务目标保持一致的人员见面、打招呼、联系和协作。你永远不知道CrunchMatch连接会产生什么。\n这是我们第一次致力于太空的TC会议，但这绝不是我们的第一支舞。所有级别的TC会议都是机会的代名词。举个例子：FlashParking的高级公关总监卡琳·马克(Karin Maake)在谈到她在TC会议上的经历时是这样说的：\n他说：“TC会议不仅是一个教育机会，也是一个真正的人脉机会。每个人都充满热情，对创建试点项目或其他合作伙伴关系持开放态度。这是最令人兴奋的部分。现在，多亏了一个会议连接，我们正在与固特异的创新实验室洽谈。\n12月16日至17日，在TC Sessions：Space 2020上加入这个勇敢的全球社区吧。储蓄的四天倒计时已经开始了--不要错过把100美元放在口袋里的机会。在11月13日晚上11点59分价格上涨之前购买早班票。(PT)。\n贵公司是否有兴趣赞助TC Sessions：Space 2020？请单击此处与我们讨论可用的机会。", "note_en": "Spend two days learning from and engaging with people forging the future of space travel, exploration, communications, manufacturing and so much more. We’re talking top industry founders, investors, government and military officials — across the public, private and defense sectors.\n How cool is 3D printing? It’s exponentially cooler when you’re printing rockets like  Tim Ellis, CEO of Relativity Space. That’s just one of many hot topics and experienced leaders waiting to help you learn and move your business forward. Check out  the event agenda and start planning your schedule now.\n  You’ll have access to all live sessions, and you can access video on demand. Whether you need to meet with clients, network at the event or check out early-stage exhibitors in the expo, VOD lets you conquer FOMO — fear of missing out.\n Networking’s essential for startup success and CrunchMatch, our free AI-powered platform, makes it simple and easy to meet, greet, connect and collaborate with the people who align with your business goals. You never know what might develop from a CrunchMatch connection.\n This is our first TC Sessions dedicated to space, but it is by no means our first dance. TC Sessions of all stripes are synonymous with opportunity. Case in point: Karin Maake, senior director of communications at FlashParking, had this to say about her TC Sessions experience:\n “TC Sessions wasn’t just an educational opportunity, it was a real networking opportunity. Everyone was passionate and open to creating pilot programs or other partnerships. That was the most exciting part. And now — thanks to a conference connection — we’re talking with Goodyear’s Innovation Lab.”\n Join this intrepid global community at  TC Sessions: Space 2020 on December 16-17. The four-day countdown to savings is on — don’t miss your chance to keep $100 in your pocket.  Buy your early-bird pass before prices go up on  November 13  at  11:59 p.m. (PT).\n Is your company interested in sponsoring TC Sessions: Space 2020?   Click here  to talk with us about available opportunities.", "posttime": "2020-11-11 02:04:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,sessions,left,tc", "title": "\n还剩四天，TC Sessions：Space 2020的门票就可以省下一大笔钱了", "title_en": "\n\t\t\t\tFour days left to save big on tickets to TC Sessions: Space 2020\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/10/four-days-left-to-save-big-on-tickets-to-tc-sessions-space-2020/", "via": "", "real_tags": ["2020", "sessions", "left", "tc"]}, {"category": "", "categoryclass": "", "imagename": "34a2b3f7638248e0387b1d788e12819a.png", "infoid": 1034315, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳到WWDC上的主要内容6月份，苹果宣布将于今年开始为期两年的过渡，在Mac电脑上使用自己的处理器。说到做到，它在2020年还有最后一次活动，名字是以史蒂夫·乔布斯(Steve Jobs)那句著名的口号命名为“再来一件事”(One More Thing)。\n我们绝对期待Mac电脑采用基于ARM的处理器。具体来说，彭博社(Bloomberg)报道称，首批上市的将是一款新的MacBook Air和一款新的13英寸MacBook Pro。特别是MacBook Pro的发布，似乎暗示着苹果对其新芯片的强大功能有高度的信心。\n即便如此，苹果仍有许多问题需要回答。为英特尔处理器设计的应用程序与苹果的Rosetta 2翻译层配合得如何？大苏尔(Big Sur)操作系统上的iPad应用程序会让人觉得它们完全属于那里吗？苹果是会选择ARM处理器所能提供的更长电池，还是会在保持电池续航时间不变的情况下加大电量？会有任何形式的重新设计吗？\n我们希望很快就能找到所有这些问题的答案。活动将于太平洋时间上午10点/东部时间下午1点开始，我们将现场直播所有的公告。", "note_en": "Skip to main content                                                                                                                At WWDC in June,  Apple announced it would begin a two-year transition to using its own processors on Macs this year. True to its word, it has one last event in 2020, titled “One More Thing” after Steve Jobs’ famous catchphrase.\n We are absolutely  expecting Arm-based processors for Macs. Specifically,   Bloomberg has reported that the first ones to arrive will be a new MacBook Air and a new 13-inch MacBook Pro. Releasing a MacBook Pro, in particular, seems to imply that Apple has a high degree of confidence in how powerful its new chips will be.\n Even so, there are many questions Apple will need to answer. How well will apps designed for Intel processors work with Apple’s Rosetta 2 translation layer? Will iPad apps on the Big Sur operating system feel like they belong there at all? Will Apple go for the longer battery you can sometimes expect from Arm processors or crank up the power and keep battery life about the same? Will there be any sort of redesign?\n We hope to find out all of those answers very soon. The event kicks off at 10AM PT / 1PM ET, and we’ll be live-blogging all of the announcements from the live stream.", "posttime": "2020-11-11 02:03:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,发布,博客,苹果", "title": "苹果发布会的直播博客，搭载苹果硅片的Mac很可能会在这里发布", "title_en": "Live blog of Apple's event, where Macs with Apple Silicon will likely be announced", "transed": 1, "url": "https://www.theverge.com/2020/11/10/21556786/apple-event-live-blog-silicon-arm-mac-one-more-thing?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["apple", "发布", "博客", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "dfaf880e9ea4b32a13b3a915b09c29cc.png", "infoid": 1034314, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在苹果公园观看苹果发布会。", "note_en": "Watch the Apple Event from Apple Park.", "posttime": "2020-11-11 02:03:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,发布,苹果,发布会", "title": "苹果“再来一件事”发布会现场直播", "title_en": "Livestream of Apple's “One More Thing” event", "transed": 1, "url": "https://www.apple.com/apple-events/event-stream/", "via": "", "real_tags": ["apple", "发布", "苹果", "发布会"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1034312, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "纽波特是计算机科学教授，也是《纽约时报》畅销书《数字极简主义与深度工作》(Digital Minimism And Deep Work)的作者。他的书用30多种语言出版，他关于技术、文化和生产力的文章出现在《纽约客》、《连线》和《纽约时报》上。在过去的15年里，他一直是时间段计划的公开倡导者。\n纽波特在他广受欢迎的博客上每周写一篇关于技术、生产力和深度生活的文章。点击此处阅读更多内容。\n他还在收视率最高的播客“深度问题”中深入探讨了这些话题。听我说。\n要直接在您的收件箱中接收他的文章，请加入订阅他的电子邮件时事通讯的数万名读者", "note_en": "Newport is a computer science professor and the  New York Times bestselling author of  Digital Minimalism and  Deep Work.  His books have been published in over 30 languages, and his articles on technology, culture, and productivity have appeared in the  New Yorker,  WIRED, and the  New York Times. He’s been a public advocate of time-block planning for the past fifteen years.\n  Newport writes weekly essays on technology, productivity, and the deep life on his popular blog.    READ MORE HERE\n  He also dives deep into these topics on his top-rated podcast Deep Questions.  LISTEN HERE\n     To receive his articles directly in your inbox, join the tens of thousands of readers who subscribe to his email newsletter", "posttime": "2020-11-11 01:48:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "时间,block,深度", "title": "《时间块规划者》", "title_en": "The Time-Block Planner", "transed": 1, "url": "https://www.timeblockplanner.com/", "via": "", "real_tags": ["时间", "block", "深度"]}, {"category": "", "categoryclass": "", "imagename": "a47e85fb602829dc97cbda279af95d20.png", "infoid": 1034311, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "来自那些在刑事司法系统工作和生活的人的观点。注册后，即可每周收到给您的电子邮件《生活内幕》(Life Inside)。\n甚至在我睁开眼睛之前，宿舍里的叫喊声和汗味，我四英寸厚床垫下金属床铺的坚硬，透过我的眼皮燃烧的荧光灯，以及我的焦虑，都让我想起了自己所处的位置。\n当我终于睁开眼睛的时候，我看到人们像蚂蚁大军一样在我周围移动。现在才凌晨5点14分，但他们已经坐在生锈的储物柜上抽着烟，在德克萨斯Hold Em的比赛上赌博了。其他人则忙于谋生：洗衣服、缝衣服或卷烟。\n帮派纹身覆盖了我周围的大多数囚犯，当我的脚碰到破裂的瓷砖地板时，我开始进攻。我准备好面对不可避免的马基雅维利式的日常监狱生活斗争，开始做100个钻石俯卧撑。我试着通过回想我的口头禅来放慢我的猴子思维：我并不软弱。在这里，弱者无法生存。你他妈的是个战士！\n我只起了五分钟，但沮丧已经刺痛了我的心灵。我对自己发誓，决不让监狱把我变成畜生。\n当我走进休息室去拿热水煮咖啡时，小电视上正在播放早间新闻，让我想起了我的前世。我前妻做的早餐。让我儿子上学前班，他虚弱地抗议着。\n我回到我18平方英尺的起居区，打开MP3播放器，把忧郁的情绪抛诸脑后。就像我的朋友欧内斯特说的，我被摧毁了，但没有被打败。我知道我配得上伟大的东西，但也知道那些东西还没有定义，它们在一个不确定的未来。\n突然，从洞穴般的宿舍后方传来动静。我感觉到了一种威胁。虽然不是朝我的方向，但我的心跳加快，手心出汗。我是暴力世界中的和平主义者，只有我的基因拯救了我。(我身高六英尺四英寸，肌肉发达，体重220磅。)\n我穿上蓝色囚裤和黑色靴子，拿起身份证，准备检查床铺。然后，我等待着一位无聊的惩教人员通过扩音器宣布的牛叫声，他坐在一个有机玻璃气泡里，等待他12小时的轮班结束。\n当我等着门打开吃早饭的时候--给了我一个走到户外感受自由的机会--我喝完了咖啡，锁上了我的储物柜。这个盒子里有我世界上所有的东西：拉面、袜子、T恤、全家福和一堆花花公子。\n现在，我确实听到了宿舍里发生的打架声：运动鞋吱吱作响，拳头敲打着肉，空气中弥漫着沉重的呼吸声。我转过身来看着，这样我就可以评估一下情况是否存在人身威胁。\n两名男子拳打脚踢，直到其中一人昏迷不醒地倒在地上；持续了20秒，这两位拉丁国王才被他们的兄弟分开。有一个男人的耳朵里流着血，他的眼睛已经肿胀闭上了，同时还在呻吟。这是一场关于扑克债务的争吵--这不关我的事--但我的手仍然在颤抖，我走进卫生间，想远离这场混战。\n一群疯狂的囚犯排起长队，把门口堵得水泄不通。我退后一步，让他们先走了，然后走到外面，进入佛罗里达狭长地带秋日黎明的清新空气中。我沿着混凝土人行道上蜿蜒的迷失灵魂的路线前进，人行道上沾满了刺伤受害者的鲜血。\n这两个人一边拖着脚，一边互相说着狗屎，一边走着去任何惩教机构中最危险的地方--食堂。我前世是克拉夫·马加的教练，不会让任何人占我的便宜。但我是一个中性派(意思是中立，或与任何帮派无关)，我们总是要小心。\n食堂里将挤满400名囚犯：饥饿的、精神病的和不耐烦的。我曾经在一家工程公司工作，负责管理项目和设计计划。现在我在惩教署工作。我曾经勘测过一块土地，用来建造一座未来的监狱。现在我住在一间房里。\n我想再见到我的家人。我的兄弟姐妹们。我的儿子们。我已经六年没有见到我的儿子了，六年前我在偷未婚妻家人的东西时被控入室行窃。试着支持我的习惯。六年前，止痛药再次毁了我，吸食可卡因比过正常生活更重要。比我的正直和自尊更重要。\n我厌倦和厌恶又一个日历上的日子因为我的瘾而被监禁，但是，突然，当我抬头环顾早晨的天空时，我被它的美丽迷住了。开始下起了小雨。我可以看到全景，它几乎让我泪流满面：紫罗兰、热带粉色和一缕缕橘子充斥着地平线上崭新的一天。\n东边是不朽的日出，日出越来越多。上面都是柔和的雨的积云--月球云。西边是我见过的最奇妙的彩虹。我感到平静。\n受伤的人蜿蜒穿过大门，穿过带刺的铁丝网，沿着混凝土人行道走下去。他们后面跟着拿着胡椒喷雾的警察，我把目光从天空移开了一会儿。一支步枪从警卫塔的一扇窗户指向我们，它的影子隐约笼罩着我们。\n就在我们走进去之前，我最后一次转身看了看天空。\n瑞安·M·莫泽(Ryan M.Moser)是一名正在康复的吸毒者，他因非暴力财产犯罪在佛罗里达州服刑10年。他的作品已在数十本文学期刊上发表，并将在即将出版的一期《上街》(UpStreet)杂志上发表。瑞安在2020年美国笔会(PEN America)的非虚构类文章中获得了荣誉称号。瑞安是费城人，也是两个孩子的父亲。这篇文章的一个版本首次发表在《荒野世界》上。", "note_en": "Perspectives from those who work and live in the criminal justice system.  Sign up to receive &#34;Life Inside&#34; emailed to you every week.\n  Before I even open my eyes I am reminded of where I am, by the yelling and smell of sweat in the dormitory, the hardness of the metal bunk beneath my four-inch thick mattress, the fluorescent lights burning through my eyelids, my anxiety.\n When I do finally open my eyes, I see men moving all around me like an army of ants. It’s only 5:14 in the morning, but they’re already gambling on Texas Hold Em’ games while sitting on rusty footlockers, smoking cigarettes. Others are hustling for their living: washing laundry, sewing clothes or rolling smokes.\n  Gang tattoos cover most of the inmates around me, and I get on the offensive as my feet hit the cracked tile floor. I get my game face ready for the inevitable Machiavellian struggle of daily prison life and drop down to do a hundred diamond push-ups. I try to slow my monkey mind by thinking of my mantra:  I am not weak. The weak do not survive, here. You ’ re a fucking warrior !\n I’ve only been up for five minutes, but despondency is already poking at my psyche. I vow to myself never to let prison make me an animal.\n When I walk into the dayroom to get hot water for my coffee, the morning news is on the tiny television, reminding me of my past life. Of my ex-wife’s breakfast-cooking. Of getting my son up for preschool as he feebly protested.\n I return to my 18-square-foot living area and put my MP3 player on to tune out the melancholy. Like my friend Ernest says, I am destroyed but not defeated. I know that I am worthy of great things, but also that those things aren’t defined yet and they’re in a future that’s not guaranteed.\n Suddenly, there is movement coming from the rear of the cavernous dorm. I sense a threat. Even though it’s not toward me, my heart beats faster and my palms sweat. I’m a pacifist in a violent world, only saved by my genetics. (I’m six-foot-four, muscular and carrying 220 pounds.)\n  I put on my blue prison-issue pants and black boots, grab my identification card and get ready for my bunk inspection. Then I wait for the cattle call of chow announced through the loudspeaker by a bored corrections officer sitting inside a Plexiglas bubble waiting for his 12-hour shift to end.\n While I wait for the door to open for breakfast—giving me an opportunity to walk outdoors and feel some sort of freedom—I finish my coffee and lock my footlocker. This box holds every possession I have in the world: ramen noodles, socks, T-shirts, family photos and a stack of Playboys.\n Now, I definitely hear the sounds of a fight happening in the dorm: sneakers squeak, fists thump flesh, and heavy breathing fills the air. I turn to watch so I can evaluate the situation for a personal threat.\n Two men tangle in punches until one slumps to the ground in a daze; it lasts 20 seconds before the two Latin Kings are separated by their brothers. There’s blood coming from one guy’s ear and his eye is already swelling shut as he moans. It’s a quarrel over a poker debt—none of my business—but still, my hands shake and I walk to the bathroom to get distance from the scuffle.\n     A frenzy of prisoners line up and clog the doorway. I hang back and let them go first then step outside into the crisp air of an autumn dawn in the Florida Panhandle. I follow the serpentine line of lost souls on the concrete sidewalk stained with the blood of stabbing victims.\n The men shuffle their feet and talk shit to each other while walking to the most dangerous place in any correctional institution—the chow hall. I was a Krav Maga instructor in a previous life, and will not let anyone get the jump on me. But I’m a neutron (meaning neutral, or unaffiliated with any gang), and we always have to watch our backs.\n The chow hall will be filled with 400 inmates: hungry, mentally ill and impatient. I used to work for an engineering firm, managing projects and designing plans. Now I work for the Department of Corrections. I once surveyed a plot of land for a future prison. Now I live in one.\n I want to see my family again. My brothers and sisters. My sons. It’s been six years since I’ve seen my boys, six years since I caught a burglary charge while stealing from my fiancée&#39;s family. Trying to support my habit. Six years since painkillers ruined me yet again and doing cocaine was more important than leading a normal life. More important than my integrity and self respect.\n I’m weary and loathing another calendar day imprisoned because of my addictions, but, suddenly, as I look up and around at the morning sky, I’m spellbound by its beauty. A light rain begins to fall. I have a panoramic view, and it almost brings a tear to my eye: violets, tropical pinks, and wisps of tangerine flood the horizon with a brand new day.\n To the east is the monumental sunrise, gaining ground. All above are the cumulus-nimbus clouds of the gentle rain. And to the west is the most fantastic rainbow I’ve ever seen. I feel peace.\n Damaged men snake through the gates and past barbed-wire fences down the concrete walk. They are followed by officers with pepper spray, and I look away from the sky for a moment. A rifle points from a window in the guard tower, its shadow looming over us.\n Just before we walk inside, I turn to look at the heavens one last time.\n  Ryan M. Moser is a recovering drug addict serving a  10 -year sentence in Florida  for nonviolent property crime s.  His work has been published in  dozens of lit journals and will be featured in an upcoming issue of Upstreet magazine. Ryan received an honorable mention in nonfiction essays from PEN America in 2020.  Ryan is a Philadelphia native  and  father of two. A  version of this essay was first published in The Wild Word.", "posttime": "2020-11-11 01:48:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "暴力,plan,生活", "title": "和平主义者在暴力的监狱世界中生存的计划", "title_en": "A pacifist's plan to survive the violent world of prison", "transed": 1, "url": "https://www.themarshallproject.org/2020/11/05/a-pacifist-s-plan-to-survive-the-violent-world-of-prison", "via": "", "real_tags": ["暴力", "plan", "生活"]}, {"category": "", "categoryclass": "", "imagename": "00e8c7a19491e8bac23b3c00c6c08df6.jpg", "infoid": 1034310, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每隔一段时间，我就会在黑客新闻(HackerNews)上看到一条评论，不由自主地让我下巴下垂、摇头、流泪。这通常与黑客新闻(HackerNews)上的一些人认为作为一名独唱者或制作人与作为一名员工能赚到多少钱有关。\n显然，每天浏览HN的沉默大众中可能只有一小部分人持有这些观点，但像下面这样的评论，或者它的变体如此频繁地出现，让我忍不住觉得，社区中有相当一部分人与人类其他人脱节得离谱得离谱。\n天哪。听着，这位评论者有提出地区生活成本的自我意识，并不是每个人都能在世界上的FAMANGs工作，但真的吗？仅仅7年的工作就能拿到370万美元，就像是一笔糟糕的交易？\n考虑到年薪50万美元是一个可行的、现实的薪水，在决定是创办公司还是只是找工作时要考虑在内。就像我们千禧一代所说的，我甚至不能。\n这份年薪远远超过了我在十年内合理预期的收入，我是金融科技创业公司的一名开发人员，有几年的经验。对于世界上大多数人来说，每年50万美元是一个荒谬的数字。\n我太懒了，不想去挖掘更多的例子，但我相信，如果你仔细研究一下过去的帖子，你一定会找到更多这样的珍品。\n这种对大多数人(我说的是90%的美国人，更别提世界上其他人了！)认为相当大的一笔钱会让人难以置信地兴奋，让我头晕目眩。\n现在我确信，在像上述世界这样的评论者中，这样的钱确实是微不足道的，但我想写这篇文章，只是为了试着和我们其他人打交道。\n我正在努力理解这样一个事实：我在这个论坛上，每天与人互动，谈论时事和问题，每年赚的钱比我想象的还要多。在某种程度上，我们是同龄人，但更现实的是，他们就像奥林匹斯之神，偶尔会与我们其他人一起生活在贫民窟。\n因此，如果你像我一样，甚至认为1000美元是一大笔钱，让我们像普通人一样看待这件事。\n让我们以每晚1000美元为例，因为坦率地说，对于我和几乎所有我认识的人来说，像360万美元这样的数字都是在拉拉的王国里。\n为了简单起见，让我们假设你可以将收入的60%作为净收益带回家。而且，该项目不会占用比你自己能处理的更多的空闲时间来处理维护和支持问题。那就是每月600美元。额外的。从旁边的一件东西。\n我意识到，我生活在世界上那些便宜、没有吸引力的地方，但这笔钱很容易支付我和我的家人每月的房租，甚至更多。你意识到一个人肩上的精神负担有多重吗？知道房租超过了你的日间工作收入吗？\n看看克里斯·麦考密克(Chris McCormick)的这篇帖子，标题是《见鬼，这很难》。\n当他最后一次查看时，17207名个人创始人中有12名的MRR超过10K美元。只有54种产品的价格超过2000美元。我不认为我需要用比例来表达这一点，才能让你看到一个有利可图的项目的可能性。\n启动一款产品并从中真正赚钱是很难的。太难了。见鬼，如果你能从一个副业中赚到100美元，我就很尊敬你了。你已经把我打败了好多次了！\n当我在IndieHacker或Twitter上看到制造商庆祝100美元的销售额时，我真的为他们感到兴奋。这真是一项令人难以置信的壮举。祝他们好运，祝他们在未来取得更大的成功。\n另一件需要考虑的事情是，每晚1000美元的收入意味着你的项目基本上已经通过验证，随时可以爆发。有了工作，你或许可以把它扩大到更高的倍数。\n当然，它赚的钱对硅谷的高层来说微不足道，但对我们这些普通民众来说，这是一个强烈的信号，表明你的项目可能会有立足之地。这甚至可能是一个项目，你可以在7年内卖出370万美元，如果你把作品放进去，并获得一点运气的话。\n当然，在美国买东西要贵一些。在桑弗兰更是如此。但我不能就这样搬到美国去生活。在第一世界的其他地方也是如此。许多每天经常光顾HN、TW和IH的人可能也不会。\n因此，对于像我们这样的人来说，读到一些牧羊人独立赚取1000美元的年薪是很鼓舞人心的。这给了我们希望，阿拉巴马州的一些家伙可以开始做一件事，然后把它卖出，赚的钱比我们做工薪族一辈子所能预期的要多。因为也许这意味着我们也可以。\n因为他们使用了我们也可以访问的相同工具(除了条纹😝)。他们可以进入我们能接触到的相同市场。\n他们用这些工具赚了很多钱，这些工具可以为我们这样的人带来自由。从工作中解脱出来的自由，从经济压力中解脱出来的自由，甚至可能是把家人搬到世界上更好的地方的自由。其他人刚出生的地方。\n所以，当你看到黑客新闻上的卖弄评论贬低别人的成功时，退后一步，你会意识到，这不是给你的。这不是私人恩怨。\n这只是几个幸运的、享有特权的神的沉思，反映了凡人的辛劳。\n谢谢你的阅读。如果您有任何意见或建议，请关注并通过Twitter@RikNieu与我联系。\n如果你想阅读更多我的咆哮，请在下面注册，当我发布新的内容时，我会发邮件给你。👇", "note_en": "Every so often I encounter a comment on HackerNews that involuntarily makes my jaw drop, head shake and eyes water. It&#39;s usually concerning what some on HackerNews consider a &#39;worthwhile&#39; amount of money you can earn as an solopreneur or maker VS being an employee.\n Obviously, it&#39;s probably a small minority of the silent masses who scroll through HN daily who have these views, but comments like the following, or a variant of it comes up so often I can&#39;t help but feel that a decent part of the community is  ridiculously out of touch with the rest of humanity.\n         My god. Look, the commenter had the self awareness to bring up regional cost of living and that not everyone can work at the FAMANGs of the world, but really? Getting $3.7 million dollars for just 7 years of work is, like, a bad deal?\n To consider making $500K pa as a doable, realistic salary to be taken into account when deciding between starting a company or just seeking a job... Like us millennials say, &#34;I can&#39;t. Even.&#34;\n That annual salary far outstrips what I can reasonably expect to earn in a decade, and I&#39;m a developer working for a fintech startup with a good couple of years under my belt. For most people in the world, $500K pa is a   preposterous amount of money.\n I&#39;m too lazy to go dig up more examples, but I&#39;m sure you&#39;ll find some more gems like these if you go digging around on past threads.\n This kind of poo-pooing of what most - and I&#39;m talking 90% of the US population, never mind the rest of the world! - would consider rather large amounts of money is incredibly mind-blowing and makes my head spin.\n Now I&#39;m sure that in commenters like the above&#39;s worlds, that kind of money is indeed average and peanuts, but I wanted to write this article for myself and the rest of us to just try and deal.\n I&#39;m trying to make sense of the fact that I&#39;m on this forum, interacting with people everyday, talking about current events and issues, that make more money per year than I can even imagine. In a way we&#39;re peers, but more realistically they&#39;re like the gods of Olympus who occasionally slum it with the rest of us.\n So if you&#39;re like me, and you consider even a $1000 as lot of money, let&#39;s look at this as average mortals should.\n  Let&#39;s go with the $1000 pm example, because figures like $3.6 million is, to be frank, in the realms of La-La land for me and almost everyone I know personally.\n And let&#39;s - for the sake of simplicity - assume that you can take home 60% of that revenue as net earnings. And that the project doesn&#39;t take up more free time with maintenance and support issues than you can handle on your own. That&#39;s $600 per month. Extra. From a thing on the side.\n I realise that I live in one of those cheap, unappealing parts of the world, but that kinda money would easily cover me and my family&#39;s rent every month, and then some. Do you realise how much of a mental weight that can take off a persons shoulders? To know rent is covered over and above your day-job earnings?\n   Take a look at  this post by  Chris McCormick, titled &#34; Holy heck this is hard&#34;.\n When he last checked, 12 solo founders out of 17207 made more than $10K MRR. Only 54 products made more than $2000pm. I don&#39;t think I need to express that in ratios for you to see the probability of making a profitable project.\n Starting a product and  actually earning money from it is hard. Insanely hard. Hell, if you manage to make even $100pm from a side project you&#39;ve got my respect. You&#39;ve got me beat by a lot!\n When I see makers on IndieHackers or Twitter celebrate $100 in sales I get genuinely excited for them. It&#39;s really an incredible feat. Bravo to them, I wish them luck and more success in the future.\n  Another thing to consider is that earning a $1000 pm means your project is basically validated and ready to explode. With work, you could probably scale it to much higher multiples.\n Sure, the money it makes is negligible to the higher beings in Silicon Valley, but for us regular plebs that&#39;s a  strong signal that your project potentially has legs. It might even be a project you could sell for $3.7 million dollars in 7 years time, if you put the work in and get a little lucky.\n  Sure, things cost more in the States. And more so in SanFran. But I can&#39;t just up and go live in the States. Nor pretty much anywhere else in the First World. A heck of a lot of the people frequenting HN, TW and IH on a daily basis could probably not either.\n So for people like us, it&#39;s inspiring to read about some rando making a $1000 pm, on their own, independently. It gives us hope that some dude in Alabama could start a thing and sell it for more money than we could expect to earn in a lifetime as a salaried employee. Because maybe that means we could too.\n Because they used the same tools we have access too(except for Stripe 😝). They had access to the same markets we could reach.\n And they make the kinds of money with those tools that could buy people like us freedom. Freedom from being chained to a job, freedom from financial stress, and possibly even the freedom to move our families to better places in the world. Places that others just get born in.\n So when you see smarmy comments on HackerNews new putting down the success of others, take a step back and realise, it&#39;s not meant for you. It&#39;s not personal.\n These are merely the musings of a few lucky, privileged gods, reflecting on the toils of the mortals.\n Thanks for reading. If you have any comments or suggestions, follow and contact me on Twitter  @RikNieu.\n If you want to read more of my rants, sign up below and I&#39;ll mail you when I post new stuff. 👇", "posttime": "2020-11-11 01:47:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,hacker,项目", "title": "黑客新闻中的神", "title_en": "The Gods on Hacker News", "transed": 1, "url": "https://www.riknieu.com/the-gods-on-hackernews/", "via": "", "real_tags": ["黑客", "hacker", "项目"]}, {"category": "", "categoryclass": "", "imagename": "60d9c4faed0cd2ff1657399aa85ef2b7.png", "infoid": 1034309, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天对于纤毛社区来说是令人兴奋的一天：纤毛背后的公司Isovality宣布了由Andreessen Horowitz、谷歌和思科支持的2900万美元的首轮融资。这是一个很好的机会，可以更深入地研究基于eBPF的网络是从哪里来的，以了解令人兴奋的一切。\n两周前，我们举办了有史以来第一次eBPF 2020年峰会。除了激动人心的主题演讲外，cilium的几位用户还谈到了他们的使用案例，包括Adobe、CapitalOne、Datadog、GitLab、Google和Wildlife Studios。上个月早些时候，阿里巴巴云报道了他们如何将Cilium用于基于eBPF的高性能云本地网络。就在几周前，谷歌刚刚宣布为GKE和Anthos提供基于纤毛的网络数据平面。\n过去的几个月对整个团队来说已经是令人难以置信的兴奋。Kubernetes的联合创始人之一并不是每天都会赞扬你的团队创造的技术和工作。\n今天的秘密发布对团队来说是又一个伟大的时刻，也是所有团队成员的成就，他们为这一天付出了令人难以置信的努力。我们期待着在继续围绕我们的开源项目创新的同时，更公开地谈论我们作为一家公司所做的事情。\n这是一个很好的机会，可以更深入地探讨使用eBPF进行网络交流的动机。所有这些用户在纤毛上看到的是什么？EBPF有什么特别之处？\n为了真正理解这一转变，让我们简要回顾一下人际关系网的历史。在90年代，网络几乎完全是物理的。电缆、外围设备、拨号调制解调器和大量的第二层。大约在同一时间，在1999年，为Linux创建了iptable，不久之后，为BSD发布了PF。这两个项目都专注于基于软件的防火墙。更大规模运动的早期迹象是：软件定义的网络。这是我个人参与Linux网络的时候。\n在2003-2008年间，VLAN首次被描述，XenHypervisor的第一个版本出现了，EMC收购了VMware，KVM被合并到Linux内核中。这是虚拟化时代的开始，但从网络的角度来看，并没有太大的变化。通过将虚拟机直接桥接到网络，将虚拟机的联网委托给底层物理网络。软件中几乎不存在联网逻辑。在这个早期的虚拟化时代，Linux内核联网的大部分焦点都集中在TCP/IP堆栈和将内核优化为一个运行应用程序的系统上。\n从软件网络的角度来看，2009年是事情变得令人兴奋的一年。Open vSwitch的第一个版本发布了，它为我们带来了软件定义的网络(SDN)。它为Linux内核带来了巨大的网络可编程性。\n这一可编程性方面在今天的基于eBPF的网络中仍然可以找到，并且是基石之一。基于eBPF的网络植根于SDN，并通过从等式中去掉以设备为中心的模型来转移它。\n2013年带来了多克。Docker主要从虚拟化层继承网络，从网络角度看，容器被视为微型虚拟机。Docker带来的根本性转变侧重于使用容器镜像打包应用程序，而不是基础架构方面。因此，几乎所有早期的容器网络解决方案都继承自OpenStack时代。\n2014年，第一次对库伯内斯的承诺发生了。Kubernetes显然不是第一个尝试将高级用户意图转化为基础设施自动化的项目，但Kubernetes做出了一个深思熟虑的决定，在网络和安全方面做了更少的假设。例如，Kubernetes中没有网络或子网的概念。这导致了一个令人印象深刻的创新周期。\n但Kubernetes的快速演变也有其阴暗面：对尽快达到足够完整状态的渴望使其依赖于iptable。Linux内核中的Apacket Filter，这是我在使用ADAL-UP调制解调器时亲自开发的。显然不是完全适合这项任务，但随处可得，而且足够好，可以开始使用。\n在Kubernetes成立的同一年，eBPF首次被合并到Linuxkernel中，作为替代长期存在的包过滤器BPF的继任者。因此取名为eBPF。一年后，eBPF后端被合并到LLVM编译器套件中，允许LLVM发出eBPF字节码。同时，一个新的eBPF分类器使Linux与eBPF联网成为可编程的。\n2016年，XDP被合并到Linux内核中，实现了一个高性能的数据路径，使eBPF程序可以直接在网络设备的驱动程序中运行。这就是后来开发基于eBPF的高性能负载均衡器的原因，这些负载均衡器驱动着当今一些最大的数据中心。\n从那以后，eBPF是一条令人难以置信的陡峭的发展轨迹，每年都会变得越来越强大。EBPF的通用性允许在其周围形成不同的社区，跨越网络、跟踪、安全、分析和可观察性。\n回顾一下历史，在硬件网络中，功能和规模都是由硬件来定义的。有了软件定义的网络，很多东西都从硬件转移到了软件上，采用了以前硬件提供的功能，用软件重写，然后把虚拟这个词放在前面。只要涉及到机器，所有这些都是有意义的。\n容器和云本地时代与机器无关。我们关心的是应用程序、API和服务。有些机器仍将存在很长一段时间，但您不想围绕它们构建体系结构。\n然而，在现代系统中，我们很少考虑连接机器、虚拟机，甚至容器。相反，我们关心的是连接微服务。因此，我们想到的不是机器和电线，而是云服务、API和用于连接它们的更高级别的协议和系统。过去是IP地址、端口、vNIC和VLAN。现在是服务标识、GRPC、Kafka、分布式数据存储、远程API等。\n是什么让eBPF和纤毛如此适合应对新的云本地挑战？\nEBPF的可编程性使其能够适应快速发展的云本地需求，并轻松应对规模的增长。下面是一个例子，说明eBPF的可编程性如何导致Google采用Cilium作为GKE的新网络数据平面：\n随着越来越多的企业采用Kubernetes，随着围绕多云、安全性、可见性和可扩展性的新需求，用例的范围也在扩大。此外，服务网状网和无服务器等新技术对底层Kubernetes层的定制提出了更高的要求，这些新需求都有一个共同点：它们需要一个更可编程的数据平面，能够在不牺牲性能的情况下执行Kubernetes感知的分组操作。\n进入扩展的Berkeley数据包过滤器(EBPF)，这是一种新的Linux网络范例，它将可编程钩子暴露到Linux内核内的网络堆栈。\n更重要的是，eBPF不是特定的网络，也不局限于某个特定的领域。EBPF的通用性不仅吸引了一个更大的社区进行创新，还避免了过早假设解决未来问题需要哪些积木。与任何特定于网络的可编程性解决方案(如iptables、OpenvSwitch或nftable)相比，这是一个巨大的优势。\n你们中的一些人可能会正确地说，可编程性已经以用户空间网络的形式存在了。EBPF可编程性的一个独特的新方面是嵌入到Linux内核中。应用程序使用系统调用通过网络进行交互，Linux内核负责处理这些系统调用。为了让用户空间网络框架对应用程序保持透明，它仍然必须遍历Linux内核的套接字层。EBPF通过完全保留在内核中来避免这一点。\n之前这一点并不重要的原因是，对于虚拟机，管理程序在金属机器的网络设备和虚拟机内部操作系统的插座之间创建了一个自然边界。对于容器，所有这些都发生在同一个内核中。\n那么为什么不直接加载Linux内核模块呢？显然，它以非常高的效率提供了任意的可编程性。我们可以深入研究跨内核版本维护内核模块的成本，但主要的缺点是更微不足道：既安全又高效。\n错误的内核代码会使你的机器崩溃。内核不受有缺陷的内核模块的保护。我认为人们认为这就是做内核编程的代价。EBPF改变了这一教条。它给内核编程带来了安全性。\n通过要求eBPF程序通过验证过程，eBPF程序比加载内核模块要安全得多。\n效率由保证eBPF字节码本地执行速度的即时(JIT)编译器保证。\n所有这些都使eBPF变得非常强大，但它也是一种低级技术，主要供Linux内核开发人员使用。这就是纤毛发挥作用的地方。\nCilium是在eBPF之上设计的开源项目，旨在满足集装箱工作负载的网络、安全和可见性需求。它在eBPF之上提供了高级抽象。Cilium对于eBPF的意义就像Kubernetes和容器运行时对于Linux内核名称空间、cgroup和seccomp的意义一样。位于顶部的右侧抽象层。\n网络连接：在其最基本的形式中，cilium是为Kubernetes工作负载提供网络连接的CNI。基于eBPF的数据路径具有IPv4和IPv6功能，能够支持直接路由、封装/覆盖拓扑，以及与云提供商特定的网络层集成。\n服务负载均衡：Cilium可以作为100%Kube-Proxy的替代品，在Kubernetes集群中提供所有服务负载均衡。该实现具有高度的可扩展性，并支持具有会话亲和性的直接服务器返回(DSR)。如果可能，cilium将在系统调用级别执行负载平衡，并在connect()系统调用中直接转换地址，而不是在整个网络连接期间依赖网络地址转换。\n边缘负载均衡：基于XDP的边缘负载均衡能力可以将流量引导到Kubernetes集群中，也可以完全独立于Kubernetes运行。它支持与磁悬浮一致的散列，并提供了Kubernetes服务类型NodePort、ExternalIP、LoadBalancer和HostPort的实现。\n多集群互联+安全：Kubernetes集群拥有多集群能力，无需引入额外的网关或代理即可实现互联。全局服务的部署允许跨群集来路由服务流量。\nVM/Metal集成：通过在Kubernetes集群中表示外部工作负载，就像工作负载作为吊舱运行一样，虚拟机和金属机器可以与Kubernetes工作负载无缝连接，而无需代理或网关。\n网络策略：基于完全内置在eBPF中的现代基于身份的实现，全面支持Kubernetes网络策略。ExtensiveVisibility功能允许轻松排除故障并监控合规性。\n基于FQDN/DNS：与基于DNS的服务发现透明集成，允许基于DNS名称而不是IP地址块定义网络策略，以应对由不断变化的IP地址集支持的现代服务的高度动态特性。内置的DNS授权进一步完善了安全模型。\nAPI感知：按需透明注入特使和其他代理，允许在API级别执行安全策略，如HTTP、Kafka、GRPC、Cassandra等。\n策略驱动的SSL终止和注入：SSL证书的终止和注入是策略驱动的，允许代表应用程序终止SSL连接或透明地为服务流量注入证书或令牌，而无需直接与工作负载共享秘密。\n模拟和审计：策略模拟和策略审计允许在丢弃实时流量之前评估网络策略更改的影响。\n流日志：L3-L7的流日志提供网络级别的转发和策略决策的深度可见性。群集范围的流量查询API允许快速评估整个行为中的网络行为，或检查事件期间的网络丢弃情况。\n可编程指标：可配置和可编程指标允许了解网络、应用程序和安全行为，并一致监控正确性。\n故障排除：故障排除工具从一开始就内置在Cilium中。内部跟踪系统允许跟踪每个转发决策，并且可以在运行时启用。指标通过详细的推理捕获数据包丢弃。\n对于我们的团队来说，激动人心的时刻还在继续。作为一家公司，Isovality的公开发布是我们作为一个团队的又一个重要里程碑。从技术上讲，这只是我们的客户已经使用了一段时间的东西--Hello world，但对我们的团队来说，今天是令人激动的。今年在许多方面都具有挑战性，并不是所有的事情都在我们的掌控之中。作为一个团队，能够取得和建立一些每个人都能真正引以为豪的东西，这对我来说永远是团队和公司建设中最有价值的方面。", "note_en": "Today is an exciting day for the Cilium community: Isovalent, the company behind Cilium, isannouncing its  $29M Series A financing round backed by AndreessenHorowitz, Google, and Cisco. This is a perfect occasion to take a deeper lookinto where eBPF-based networking is coming from to understand what theexcitement is all about.\n Two weeks ago, we hosted the first ever  eBPF Summit2020. Besides exciting keynotes, several usersof Cilium spoke about their use cases including Adobe,  CapitalOne, Datadog, GitLab, Google, and  WildlifeStudios. Earlier last month,  AlibabaCloud covered how they are usingCilium for eBPF-based high-performance cloud-native networking. This was just acouple of weeks after Google had announcedthe availability of a Cilium based networking dataplane for GKE and Anthos.\n The last few months have already been incredibly exciting for the entire team.It&#39;s not every day that one of the co-founders of Kubernetes praises thetechnology and work your team has created.\n  Today&#39;s launch out of stealth is another great moment for the team and anachievement of all team members who have worked incredibly hard for this day.We are looking forward to talk more publicly about what we do as a companywhile we continue to innovate around our open-source projects.\n This moment is a great opportunity to provide a deeper dive into the motivationto use eBPF for networking. What are all these users seeing in Cilium? What isso special about eBPF?\n  To really understand the shift, let&#39;s briefly look back at the history ofnetworking. In the 90s, networking was almost entirely physical. Cables,perimeters, dial-up modems and a lot of Layer 2. Around the same time, in 1999,iptables was created for Linux and just shortly after, PF was released for BSD.Both projects focused on software-based firewalling. Early sign of a muchlarger movement later on: software-defined networking. This was the time Ipersonally got involved in Linux networking.\n In the years 2003-2008, VLANs were first described, the first release of the Xenhypervisor happened, EMC acquired VMware, and KVM was merged into the Linuxkernel. This was the start of the virtualization era but from a networkingperspective, nothing much had changed. Networking of virtual machines wasdelegated to the underlying physical network by bridging VMs directly to thenetwork. Almost no networking logic existed in software. During this earlyvirtualization era, most of the Linux kernel networking focus was on the TCP/IPstack and optimizing the kernel as a system to run applications.\n  It was the year 2009 when things got exciting from a software networkingperspective. The first version of  Open vSwitchwas released which brought us software-defined networking (SDN). It broughtmassive network programmability to the Linux kernel.\n This programmability aspect can still be found in eBPF-based networking todayand is one of the corner stones. eBPF-based networking has its roots in SDN andevolves it by removing the device-centric model from the equation.\n  The year 2013 brought Docker. Docker primarily inherited the networking fromthe virtualization layers and containers were treated like miniature VMs from anetworking perspective. The fundamental shift that Docker brought focused onapplication packaging with container images and not on the infrastructure side.Therefore, almost all of the early networking solutions for containers wereinherited from OpenStack days.\n  In 2014, the first commit to Kubernetes happened. Kubernetes was obviously notthe first project to attempt translating high-level user intent intoinfrastructure automation but Kubernetes made a deliberate decision to make alot fewer assumptions in networking and security. For example, there is noconcept of a network or subnet in Kubernetes. This led to an impressive cycleof innovations.\n But the quick evolution of Kubernetes also has a dark side: The desire to getto a complete enough state as quickly as possible made it rely on iptables. Apacket filter in the Linux kernel I personally worked on while still using adial-up modem. Clearly not perfectly suited for the task but widely availableand good enough to get started.\n  The same year that Kubernetes started, eBPF was first merged into the Linuxkernel as a successor to replace the long-standing packet filter BPF. Hence thename eBPF. One year later, the eBPF backend was merged into the LLVM compilersuite, allowing for LLVM to emit eBPF bytecode. In parallel, a new eBPFclassifier made Linux networking programmable with eBPF.\n  2016, XDP was merged into the Linux kernel enabling a high-performance datapathallowing eBPF programs to run directly in the driver of a network device. Thisis what later unlocked the development of eBPF-based high-performance loadbalancers driving some of the largest data centers today.\n Ever since, eBPF is an incredibly steep trajectory to evolve further andbecomes more and more powerful every year. The general-purpose nature of eBPFallowed for a diverse community to form around it, spanning networking,tracing, security, profiling, and observability.\n  To recap history, with hardware networking, the functionality and scale weremostly defined by the hardware. With software-defined networking a lot of itmoved from hardware to software by taking functionality previously providedwith hardware, rewrite it in software, and then put the word virtual in front.All of this made sense as long as machines are involved.\n Containers and the cloud-native era are not about machines. We care aboutapplications, APIs, and services. Some machines will still exist for a longtime but you don&#39;t want to build your architecture around them.\n However, in modern systems we rarely think about connecting machines, orvirtual machines, or even containers really. Instead we’re concerned withconnecting microservices. So rather than machines and wires, we think interms of cloud services, APIs and the higher level protocols and thesystems used to connect them. The past was IP addresses, ports, vNICs andVLANS. Now it is service identity, gRPC, Kafka, distributed data stores,remote APIs, etc.\n What makes eBPF and thus Cilium such a great fit to address the new cloudnative challenges?\n  The programmability of eBPF allows to adjust to the quickly evolvingcloud-native requirements and tackle the increase in scale with ease. Here isan example on how the programmability of eBPF lead Google to adopt Cilium asits new networking dataplane for GKE:\n As more and more enterprises adopt Kubernetes, the gamut of use cases iswidening with new requirements around multi-cloud, security, visibility andscalability. In addition, new technologies such as service mesh andserverless demand more customization from the underlying Kubernetes layer.These new requirements all have something in common: they need a moreprogrammable dataplane that can perform Kubernetes-aware packet manipulationswithout sacrificing performance.\n Enter Extended Berkeley Packet Filter (eBPF), a new Linux networkingparadigm that exposes programmable hooks to the network stack inside theLinux kernel.\n Even more important, eBPF is not networking specific or tied to a particulardomain. The generic nature of eBPF not only attracts a much bigger community toinnovate, it also avoids making premature assumptions about what buildingblocks are required to solve future problems. This is a massive advantage overany networking specific programmability solution such as iptables, OpenvSwitch, or nftables.\n   Some of you may correctly state that programmability already existed in theform of user-space networking. The unique new aspect of eBPF&#39;s programmabilityis being embedded in the Linux kernel. Applications use system calls tointeract via the network and the Linux kernel is responsible to handle thesesystem calls. In order for a user-space networking framework to remaintransparent to the application, it still has to traverse the socket layer ofthe Linux kernel. eBPF avoids this by remaining in the kernel altogether.\n  The reason why this was not more important before is because with virtualmachines, the hypervisor created a natural boundary between the networkdevice of the metal machine and the sockets of the operator system inside theVM. With containers, this all happens in the same kernel.\n  Why not just load a Linux kernel module then? It obviously provides arbitraryprogrammability at a very high efficiency. We could dive into the cost ofmaintaining kernel modules across kernel versions but the major downside ismore trivial: Safety while remaining efficient.\n Buggy kernel code will crash your machine. The kernel is not protected froma buggy kernel module. I think people assumed that this is just how thingsare; that&#39;s the price to do kernel programming. eBPF changed this dogma. Itbrought safety to kernel programming.\n By requiring eBPF programs to pass through a verification process, eBPFprograms are significantly more secure than loading a kernel module.\n The efficiency is guaranteed by a Just in Time (JIT) compiler that guaranteesnative execution speed of eBPF bytecode.\n All of this makes eBPF incredibly powerful but it is also a low-leveltechnology intended to be used primarily by Linux kernel developers. This iswhere Cilium comes into play.\n  Cilium is an open source project that has been designed on top of eBPF toaddress the networking, security and visibility requirements of containerworkloads. It provides a high-level abstraction on top of eBPF. Cilium is toeBPF what Kubernetes and container runtimes are to Linux kernel namespaces,cgroups, and seccomp. The right abstraction layer on top.\n    Network connectivity: In its most basic form, Cilium is a CNI to providenetwork connectivity to Kubernetes workloads. The eBPF-based datapathfeatures both IPv4 and IPv6 with the ability to support direct-routing,encapsulation/overlay topologies, as well as integration with cloud providerspecific networking layer.\n Service Load-Balancing: Cilium can act as 100% kube-proxy replacement toprovide all service load-balancing in a Kubernetes cluster. Theimplementation is highly scalable and supports direct server return (DSR)with session affinity. If possible, Cilium will perform the load balancing onthe system call level and translate the address directly in the  connect()system call instead of relying on network address translation throughout theentire duration of a network connection.\n Edge Load-Balancing: The XDP-based edge load-balancing capability cansteer traffic into Kubernetes clusters or run entirely independent ofKubernetes. It supports consistent hashing with Maglev and provides animplementation for Kubernetes service types NodePort, ExternalIP,LoadBalancer, and HostPort.\n Multi-cluster connectivity + security: With the multi-cluster ability, Kubernetes clusters can beconnected without the introduction of additional gateways or proxies. Thenotion of global services allows to route service traffic across clusters.\n Integration of VM/metal: Virtual and metal machines can be seamlesslyconnected with Kubernetes workloads without proxies or gateways byrepresenting such external workloads in the Kubernetes cluster as if theworkload would run as a pod.\n  Network Policy: Full support for Kubernetes Network Policy based on amodern identity-based implementation built entirely in eBPF. Extensivevisibility functionality allows to troubleshoot problems and monitorcompliance easily.\n FQDN/DNS-based: Transparent integration with DNS-based service discoveryallows to define network policies based on DNS names instead of IP addressblocks to cope with the highly dynamic nature of modern services backed byconstantly changing set of IP addresses. The built-in DNS authorizationimproves the security model further.\n API Awareness: Transparent injection of Envoy and other proxies on aon-demand basis allows to enforce security policies on API level, e.g. HTTP,Kafka, gRPC, Cassandra, ...\n Policy-driven SSL termination &amp; injection: SSL termination and injectionof SSL certificates is policy driven allowing to terminate SSL connections onbehalf of an application or transparently inject use of a certificate ortoken for service traffic without requiring to share the secret with theworkload directly.\n Simulation &amp; Audit: Policy simulation and policy audit allow to assessthe effect of network policy changes before dropping live traffic.\n  Flow logging: Flow logs at L3-L7 provide deep visibility of forwardingand policy decisions on the network level. A cluster-wide flow query APIallows to quickly assess networking behavior in an entire behavior or checkfor network drops during incidents.\n Programmable Metrics: Configurable and programmable metrics allow tounderstand network, application and security behavior and monitor thecorrectness consistently.\n  Troubleshooting: The troubleshooting tooling has been built into Ciliumfrom the beginning. An internal tracing system allows to track everyforwarding decision and can be enabled on the fly. Metrics capture packetdrops with detailed reasoning.\n   The number of exciting moments for our team just keeps ongoing. The publiclaunch of Isovalent as a company is another major milestone for us as a team.Technically it&#39;s only a &#34;Hello world&#34; for something that our customers havealready been using for a while but for our team, today is emotional. This yearhas been challenging in many ways and not everything has always been within ourcontrol. Being able to achieve and build something as a team that everbody canbe truly proud of will always be the most rewarding aspect of team and companybuilding to me.", "posttime": "2020-11-11 01:47:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "网络,future", "title": "EBPF-网络和安全的未来", "title_en": "eBPF – The Future of Networking and Security", "transed": 1, "url": "https://cilium.io/blog/2020/11/10/ebpf-future-of-networking/", "via": "", "real_tags": ["网络", "future"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1034308, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2019年，我作为初选的机器检查员进入了选举委员会，这是新投票机投入使用的第一次选举。对我来说，这是一件好事--有机会了解机器的工作原理，并在一场争议较少的选举中改进投票过程，这是一件很有价值的事情。一旦2020年来临，事情就变得很明显，这次选举很重要，很可能成为企图颠覆的主题。我主动告诉选举委员会，我也准备为这次选举提供帮助，并重申了我的职责：宾夕法尼亚州第18/19分部的机器检查员。五分之八的机器检验员没有出现，所以我也做了他们的工作，直到一天过半救援人员才赶到。官方规定，机器检查员的唯一角色是在一天开始时打开投票站，始终保持机器的卫生，并在一天结束时关闭投票站。然而，任何合格的董事会成员也被允许完成选举委员会要求的大部分任务，所以我在剩下的时间里(15个半小时！)尽我所能地帮助他们！工作日。我们拿到了基本的外科口罩(我戴了两个)和面罩，还有足够擦拭机器、钢笔和工作区的消毒剂。早上6点，我们到达为上午7点开业做准备。我从选举事务的官方盒子(它有名字，但我忘了)里收集资料，然后开始工作。每个分区都有两台投票机。我取下盖子(检查并写下封条号码)，插上插头，取下保护背面垃圾箱的封条--其中包括存放空白纸质选票的地方。这些都交给了其他官员，我打开了行政控制箱。这里有一个闪存驱动器，用于存储本机的选举结果(一个副本)、一个电源和模式切换按钮以及另一个编号封条。一旦我完成了初始设置，这个另一个密封件就被用作管理箱本身的防篡改密封件。这个盒子和收集填好的纸质选票的区域，也被选举材料附带的一把桶钥匙锁住了。打开投票机器需要打开机器，验证一些信息是否符合我们的预期(比如分区号码和没有记录选票的事实)，然后输入选举代码。我不会在这里重复，但这不是一个特别安全的密码。然而，它变得更加安全，因为进入它总是伴随着管理箱中的物理测量，而管理箱一直处于锁定和密封状态。完成这些步骤后，机器就可以接受投票了。对于那些不住在宾夕法尼亚州的读者来说，典型的投票体验如下：当选民到达投票站时，他们会被问到他们重新投票的选区和分区。投票人会收到一张索引卡，上面写着他们的名字和选区/分组。每个区都排起了社交距离很远的队伍，每个区一次允许两名选民进入大楼。在我所在的地方，总共有四个分区投票，每个分区有四名选举委员会工作人员；两名民调观察员；少数城市工作人员；每个分区最多两名选民，在高峰期平均约有25-35人在房间里。投票者走近他们的桌子，说出他们的名字和党派。党派关系被用作一个信号，表明如果R和D的比例与记录的选票非常不同，可能会发生可疑的事情。桌上有三个人：一个在查A-M登记，另一个查N-Z登记，第三个人按顺序记录所有选民。投票人会被分配一个号码(从当天的第一个投票者开始按顺序分配)，这个号码写在他们的卡上、第三个工人的电话簿和登记簿上。第一次在我们分部投票的选民需要出示住址证明，有些选民有登记簿上注明的特殊情况。如果一切顺利，他们将被要求在登记簿上签名，并被发给一张空白纸质选票，并被送到该分区的下一台开放机器上。纸质选票的一侧有一个凹槽，通过右手边的槽指示它将被放入投票机的方向。狭缝通向传送带，传送带将其拉入透明玻璃下的机器中，使其看不见。触摸屏要求投票者选择一种语言(英语或西班牙语)，然后向他们展示他们的选择。有改变字体大小或对比度的选择，视力受损程度较重的投票者可以使用ADA设备。我从来没有设置过这个，所以我不确定它是如何工作的。在特定情况下，投票人可能会被陪同进入投票亭。如果符合以下条件，我可以进入投票站", "note_en": "In 2019, I was on the election board as a machine inspector for the primary election, the first election when the new voting machines were in use. And it&#39;s a good thing that I was — the opportunity to learn how the machines work, and to refine the voting process during a less contentious election, was valuable.\t Once 2020 rolled around, it became clear that this election was important, and was likely to be the subject of attempted subversion. I reached out to let the board of elections know that I was prepared to help out with this election as well, and reprised my role: machine inspector, division 18/19, PA. The machine inspector for 18/5 didn&#39;t show up, so I ended up doing their work as well until relief arrived partway through the day.\t Officially, the only role of the machine inspector is to open the polls at the beginning of the day, keep the machines sanitized throughout, and close the polls at the end of the day. However, any qualified board member is also permitted to do most of the tasks required of the election board, so I helped out where I could throughout the remainder of my (15 and a half hour!) workday. We were issued basic surgical masks (I wore two) and face shields, and more than enough sanitizer to wipe the machines, pens, and working areas down with.\t At 6 AM, we arrived to set up for the 7 AM opening. I gathered my materials from the official Box of Election Things (it has a name, but I forgot it), and got to work. Each division had two voting machines. I removed the covers (checking and writing down the seal numbers), plugged them in, and removed the seal protecting the bin on the back — where, among other things, the blank paper ballots are stored. These were handed off to the other officials, and I opened up the administrative controls box. In here is a flash drive which stores (one copy of) the election results for this machine, a power and mode switching button, and another numbered seal. This other seal is used as a tamper-evident seal for the admin box itself, once I&#39;m done with the initial setup. This box, and the area where the filled-in paper ballots are collected, are also locked with a barrel key that came with the election materials.\t Opening the poll machines involves turning on the machine, verifying some information matches our expectations (like the division number and the fact that no votes are already recorded), and entering the &#34;election code&#34;. I won&#39;t repeat it here, but it&#39;s not a particularly secure password. It is made much more secure, however, by the fact that entering it is always accompanied with a physical measure in the admin box, which is kept locked and sealed. After these steps, the machines are ready to accept votes.\t For those readers who do not live in PA, the typical voting experience is as follows: when the voter arrives at the polling place, they&#39;re asked which ward and division they&#39;re voting in. The voter is handed an index card to write their name and ward/division on while they wait. Socially distant lines are formed for each division, and two voters per division are allowed into the building at a time. There were a total of four divisions voting at my location, each with four election board workers; two poll watchers; a small number of city workers; and up to two voters per division, averaging about 25-35 people in the room at peak times.\t The voter approaches their table, and gives their name and party affiliation. The party affiliation is used as a signal that something fishy might be going on if the ratio of R to D is very different from the votes recorded. There are three people at the table: one looking up registrations A-M, another for N-Z, and a third recording all of the voters in order. The voter is assigned a number (assigned ordinally from the first voter of the day), which is written on their card, in the third worker&#39;s book, and in the registration book. Voters who are voting in our division for the first time are required to show proof of address, and some voters have special circumstances which are specified in the registration book. If all is well, they&#39;ll be asked to sign the registration book, are issued a blank paper ballot, and are sent to the next open machine for that division.\t The paper ballot has a notch on one side indicating the orientation it is to be placed into the voting machine in, via a slot on the right-hand side. The slot leads to a conveyor belt which pulls it into the machine underneath a transparent pane, and out of view. The touch screen asks the voter to select a language (English or Spanish), then presents them with their choices. There are choices for changing the font size or contrast, and voters who have a greater degree of visual impairment can use the &#34;ADA device&#34;. I&#39;ve never had to set this up so I&#39;m not sure how it works.\t Under specific circumstances, the voter may be accompanied into the booth. I am allowed to enter the voting booth if a voter asks, to help with any confusion with the machine. Additionally, one member of the public can be allowed to assist the voter ONLY if they and the voter fill out a form to consent to assistance, usually in the case of disability. I make an effort to avoid seeing the selections the voter makes, and I&#39;m not allowed to offer any advice on what to vote for.\t Once the voter makes their choices, they tap the &#34;Vote&#34; button, and their choices are printed onto their ballot. The ballot slides back out, under the transparent pane, for them to inspect for errors. They have an opportunity to reject it and ask to vote again. Otherwise, the vote is pulled back into the machine and stored in the hopper, under lock, key, and tamper-evident seal in the back. The printed ballot includes bar codes which can be quickly scanned to read the vote, and also has the selections printed out in plain English.\t After this, the voter is done, they get their sticker and go home. Outside of the typical case, there are primarily two other kinds of voters: those surrendering their mail-in ballot, and those voting provisionally. Voters who surrender their mail-in ballot to the election officials are allowed to vote on the machine; we give them a sharpie to censor their ballot with (if they already filled it in), and a form to fill out with some basic information about the voter, then staple them together and store them for later. After this, they may vote normally.\t The provisional ballots are used for anyone whose registration status is uncertain, for example voters who are required to provide proof of address, but who cannot do so. We are not allowed to refuse any voters for any reason, and provisional ballots are the last measure for anyone we don&#39;t know how to deal with. The voter is given a form to fill out with their registration and other details in the presence of the judge of elections for our division, and then the judge and another worker signs it. The voter is given a special paper ballot and a secrecy envelope, then brought to a private area to write in their votes and seal them in the secrecy envelope. When they&#39;re done, they return the envelope to the election board, we enclose it in the first envelope, and then add a sticker with a unique serial number on it. The same serial number is printed on a card which is given to the voter, which they can use to track the status of their provisional ballot on a website or via the phone, to make sure it&#39;s accepted and recorded.\t During the day, I helped out with a little bit of everything, here and there. Mainly I took care of unusual voters, those surrendering mail-in ballots or voting provisionally, to (1) make sure the rest of the election board was free to keep the voters moving, and (2) to stave off the boredom which comes with my official responsibilities being separated by 13 hours of doing nothing. There was one voter who insisted that we were going to throw away her provisional ballot, while another board worker and I patiently explained how the serial numbers worked, how she could use them to make sure her vote was counted, and that none of us wanted to go to jail over her vote.\t The other event came when a discrepancy developed between the number of votes recorded by the machine and the number of voters tallied in the books: one vote was recorded in the books that was not recorded by the machines. We ultimately concluded that someone had just walked out of the polling place after they were handed their ballot, never casting their vote on the machine. Other possibilities which we ultimately ruled out were election board error, or that the voter voted in the wrong division after receiving their ballot. The redundant records — the index card, the registration book, the list of voters — helped to narrow down the possible causes. In the end, there was nothing we could do about it.\t The polls close at 8 PM. In 2019, we had almost all of the votes at the end of the day, and had to keep the polls open longer — anyone who is in line at 8 PM is entitled to vote. This year, unexpectedly, we received hardly any voters in the last few hours of the day. At exactly 8 PM, I started closing down the machines, and this is when things began to go wrong.\t First: I will explicitly clarify that none of the problems I&#39;m about to describe ever had the slightest risk of causing votes to be miscounted or lost.\t At the end of the day, the machines print out eight receipts with tallies of the vote. Each copy is signed by the election board, then one is sent to city hall, one is kept by the judge of elections for at least a year, another two are given to representatives from each party, another is taped to the front door of the polling place for public inspection, and so on. However, my machines stopped before printing all of the receipts: one after 7, and one after just 5. The kicker: the only receipt which includes the full list of write-in votes is the last one, and that&#39;s the one which goes to city hall to provide (one of many) redundant sources for the vote.\t The machine malfunction was unexpected and required improvisation, which is something I really did not want to do. I first called up the machine hotline (one of several numbers provided to the election board to deal with issues that arose on the day), and I was connected to an expert. They told me to reboot the machine and hit &#34;print receipt&#34; as many times as I needed to get the appropriate number of receipts. After I got off the phone with them, however, I discovered that this approach would not print off the write-in votes. When I tried to call back to enquire further, I got a busy tone. I expect similar problems were happening across the state; it affected both of my machines and another one in the room.\t I was probably better equipped to address this than most divisions, as a computer expert by trade, but I was still skeeved out about doing anything to the machines which wasn&#39;t written down in my book. I was more skeeved out about the possibility of not counting write-in votes, however, so I decided to very carefully start pressing buttons. I guessed correctly at how to summon the administrative menu (something we had access to but were never trained on how to use), and poked around until I found some receipt printing tool that could prepare various kinds of reports. The specific report we needed to deliver to city hall was not available, but there were two reports which, together, contained the same information as the desired report. I printed this out on both machines, stapled them together, then included with them a signed note describing the undocumented process I used to obtain them. Then I went to the third machine in our room (for another division) which had the same malfunction, and repeated the process. The hardest part during this process was making sure none of the other well-meaning poll workers touched the machines — no, you there, DO NOT touch my machines, god dammit, you are not helping, fuck off! As soon as I found a button labelled &#34;erase media&#34;, I did not want anyone else anywhere near these machines.\t Ultimately, the votes are extremely secure regardless of this incident. The paper votes have two levels of redundancy, the plain-English votes and the barcode, and are stored in a locked and sealed hopper. The votes are digitally tallied on the USB stick in the machine, and again on each of the receipts. These records all also have to line up with the two books. All of these redundant sources of truth are handed to several different people, of different affiliations, and brought to different places. It would be very difficult to make an important error at any step, let alone to commit voting fraud. Regardless, every discrepancy and divergence from procedure was meticulously recorded to make it as easy as possible for city hall to make sense of the records.\t The rest of the process is straightforward, and much less stressful. The seal on the admin box is checked, removed, and recorded, and the machine is powered off. The flash drive is removed and placed into bag A, along with the signed receipts from the machine and a few other records. The ballot hopper bins are removed, secured with a numbered seal, and placed into bag B, along with the provisional ballots, surrendered mail-in ballots, and some other records. A pair of police officers arrives after the polls close to collect these, and they take them to city hall (having the police handle these skeeves me out, too, but again — the system is so redundant and secured that any funny business on their part would be discovered). The poll official&#39;s handbook didn&#39;t cover this, but I also took the opportunity (both this year and last) to record the officer&#39;s badge numbers.\t Actually, the police officers were the subject of another sketchy incident. The same officers arrived earlier in the day, while the polls were open, to drop off some materials. There are strict laws regulating police and poll workers while the polls are open. Police are not allowed within 100 feet of the polling location, unless they&#39;re actively voting or there on official business at the request of the election board. Additionally, anyone working at the polls in an official capacity is not allowed to wear any clothing with political messaging.\t One of the officers who showed up earlier in the day was wearing a hoodie with the American flag on it, and the US armed forces oath of enlistment printed in place of the white stripes. As they were leaving, I pulled the officer aside and asked him to remove the hoodie before making his next stop, politely explaining the law. Another poll worker affirmed my instruction as legitimate. Later, after the polls closed, the same officer returned to pick up the ballots (with the same hoodie on, but now that the polls were closed it didn&#39;t matter). Apparently, when I was photographing the badges of the officers as a matter of record, he believed that I was planning to file a complaint. I didn&#39;t catch on, but another poll worker tipped me off.\t On my way out of the polling location after everything was closed up, I passed the officers and stopped to clarify that I was just recording the badge number as a matter of course, and that there weren&#39;t any hard feelings over the hoodie — just trying to do my job. He was with 5 or 6 other officers at the time, and he started to puff up and make a scene. I didn&#39;t feel comfortable with the situation, so I just left, and with that, my long election day came to an end.\t Overall, the election day experience was decent enough. The voters were mostly polite and gracious, and the community was lovely — lunch, snacks, and bottled waters for poll workers throughout the day were donated by local businesses. I made $250 for my efforts, which probably won&#39;t show up for several months. If you have any ideas for who I should donate it to, let me know — usually my default is the EFF, but there are bigger problems right now.\t EDIT: After answering a few questions about this post, I think it would be helpful to share this link:\t Guide for Election Board Officials in Philadelphia County (PDF)  “My experience as a poll worker in Pennsylvania” was published on November 10, 2020.", "posttime": "2020-11-11 01:47:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "投票站,devault,机器", "title": "德鲁·德瓦特：我作为宾夕法尼亚州投票站工作人员的经历", "title_en": "Drew DeVault: My experience as a poll worker in Pennsylvania", "transed": 1, "url": "https://portal.drewdevault.com/2020/11/10/2020-Election-worker.gmi", "via": "", "real_tags": ["投票站", "devault", "机器"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1034306, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，我们庆祝Go开源版本的11岁生日。我们为Go 10岁生日举办的派对似乎是一个遥远的记忆。这是艰难的一年，但我们一直在不断地开发，积累了相当多的亮点。\n今年2月，GO 1.14发布了第一个正式的“生产就绪”的GO模块实现，同时还有许多性能改进，包括更快的延迟和非合作式的Goroutine抢占，以减少调度和垃圾收集延迟。\n3月初，我们发布了一个新的协议缓冲区API，google.golang.org/Protobuf，它对协议缓冲区反射和自定义消息的支持有了很大改进。\n当疫情来袭时，我们决定暂停春季的任何公开发布或发布，因为我们意识到每个人的注意力都理所当然地属于其他地方。但我们继续努力，我们的一名团队成员加入了苹果和谷歌在隐私保护暴露通知方面的合作，以支持全球范围内的联系人追踪工作。在5月份，该组织推出了参考后端服务器，用Go编写。\n我们继续改进GOPL，这使得许多编辑都支持先进的Go-Aware。今年6月，VSCode Go扩展正式加入Go项目，现在由开发GOPL的开发人员负责维护。\n同样在6月份，由于您的反馈，我们也将pkg.go.devas背后的代码开源，这也是Go项目的一部分。\n6月晚些时候，我们发布了最新的泛型设计草案，以及一个原型工具和泛型平台。\n7月份，我们发布并讨论了三个未来更改的新设计草案：new//go：为文件选择、文件系统接口和构建时文件嵌入构建行。(我们将在2021年看到所有这些内容，如下所示)。\n8月份，Go 1.15发布的主要是优化和错误修复，而不是新特性。最重要的是开始重写链接器，使其运行速度提高20%，在大型构建时平均减少30%的内存使用。\n上个月，我们进行了一年一度的围棋用户调查。一旦我们分析了结果，我们就会在博客上公布。\n围棋社区和其他所有人一样，已经适应了“虚拟优先”，今年我们看到了许多虚拟会议和十几场虚拟围棋会议。上周，围棋团队在谷歌开源直播(Google Open Source Live)上主持了围棋日(链接中的视频)。\n我们也对围棋第12年即将发生的事情感到非常兴奋。本周，围棋团队成员将在GopherCon 2020上展示8项活动。在你的日历上做上标记！\n《Typing[Generic]Go》，罗伯特·格里斯默(Robert Griesemer)演讲，11月11日上午10：00(美国东部)；问答：上午10：30。\n“What to Expect When You‘t Expect When You’t Expect”，现场录制了Go Time播客，包括Hana Kim在内的一组专家调试者，11月11日下午12点。\nMichael Knyszek的演讲《Go Memory Manager的内存和CPU效率的演变》，11月11日下午1：00；问答：下午1：50。\n“实施更快的延迟”，丹·斯卡尔斯(Dan Scales)的演讲，11月11日下午5：10；问答：下午5：40\n《Go Team-Ask Me Anything》，现场问答，朱莉·邱，丽贝卡·斯坦布勒，拉斯·考克斯，萨米尔·阿杰马尼，范·里珀，11月12日下午3点。\n“原谅中断：GO 1.14中的循环抢占”，奥斯汀·克莱门茨的演讲，11月12日下午4：45；问与答，下午5：15。\n“Working With Errors”，乔纳森·阿姆斯特丹的演讲，11月13日下午1：00；问答：下午1：50。\n卡门·安多(Carmen Andoh)的演讲“跨越鸿沟走向围棋：200万用户和增长”，11月13日下午5：55。\n2月份，Go 1.16版本将包括新的文件系统接口和构建时文件嵌入。它将完成链接器重写，带来额外的性能改进。它还将包括对新的Apple Silicon(GOARCH=arm64)Mac的支持。\n在8月份，Go 1.17版本无疑将带来更多的特性和改进，尽管确切的细节还有待商榷。它将包括一个新的x86-64基于寄存器的调用约定(不破坏现有的汇编！)，这将使程序在所有方面都变得更快。(其他架构将在以后的版本中跟进。)一个肯定会包括的很好的特性是新的//go：构建行，它比当前的//+版本更不容易出错。另一个备受期待的特性是对go test命令中的模糊的支持，我们希望明年能准备好进行beta测试。\n在接下来的一年里，我们将继续致力于开发对围棋模块的支持，并将它们很好地集成到整个围棋生态系统中。Go 1.16将包括我们迄今最流畅的围棋模块体验。我们最近的调查得出的一个初步结果是，96%的用户现在已经采用了围棋模块(一年前为90%)。\n最后，我们还将逐步减少对基于GOPATH的开发的支持：任何使用标准库以外的依赖项的程序都需要一个go.mod。(如果您还没有切换到模块，请参阅GOPATH维基页面，了解从GOPATH到模块之旅的最后一步的详细信息。)\n从一开始，围棋模块的目标就是将包版本的概念添加到围棋开发者和我们的工具的工作词汇表中，以实现对整个围棋生态系统中的模块和版本的深度支持。围棋模块镜像、校验和数据库和索引都是通过这种对包版本是什么的全生态系统的理解而成为可能的。在接下来的一年里，我们将看到更多的工具和系统增加了丰富的模块支持。例如，我们计划研究新的工具来帮助模块作者发布新的版本(GO发行版)。在接下来的一年中，我们将看到更多的工具和系统增加了丰富的模块支持。例如，我们计划研究新的工具，以帮助模块作者发布新的版本(GO发布。\n作为一个更大的例子，我们创建了gopls来减少编辑器为围棋支持而使用的许多工具(没有一个支持模块)，只剩下一个支持的工具。在接下来的一年里，我们将准备好让VSCode Go扩展在默认情况下使用gopls，以获得开箱即用的出色模块体验，并且我们将发布gopls 1.0。当然，gopls最大的好处之一是它是与编辑器无关的：任何理解语言服务器协议的编辑器都可以使用它。\n版本信息的另一个重要用途是跟踪构建中的任何包是否存在已知漏洞。在接下来的一年里，我们计划开发一个包含已知漏洞的数据库以及用于根据该数据库检查您的程序的工具。\nGo包发现网站pkg.go.dev是由Go模块启用的版本感知系统的另一个例子。我们一直专注于获得正确的核心功能和用户体验，包括今天启动的重新设计。在接下来的一年里，我们将把godoc.org统一到pkg.go.dev.我们还将扩展每个包的版本时间表，显示每个版本中的重要更改、已知漏洞等，遵循关于添加依赖项做出明智决策的总体目标。\n我们很高兴看到从GOPATH到GO模块的这段旅程即将完成，以及GO模块正在启用的所有优秀的依赖感知工具。\n每个人脑海中的下一个功能当然是泛型。正如我们上面提到的，我们在6月份发布了最新的泛型设计草案。从那时起，我们继续改进粗略的边缘，并将注意力转移到实现可投入生产的版本的细节上。我们将在2021年全年致力于这一点，目标是在今年年底之前有一些东西供人们试用，或许是Go 1.18测试版的一部分。\n围棋不仅仅是我们谷歌围棋团队中的一员。我们感谢与我们一起工作的围棋版本和工具的贡献者。此外，围棋之所以成功，是因为你们所有人都在为围棋蓬勃发展的生态系统工作和贡献。在围棋之外的世界里，这是艰难的一年。我们比以往任何时候都更感谢你们抽出时间加入我们，帮助围棋取得如此的成功。谢谢。我们希望你们都平安，并祝你们一切顺利。", "note_en": "Today we celebrate the eleventh birthday of the Go open source release.The parties we had for Go turning 10seem like a distant memory.It’s been a tough year, butwe’ve kept Go development moving forwardand accumulated quite a few highlights.\n  In February, the  Go 1.14 releasedelivered the first officially “production-ready” implementation of Go modules,along with many performance improvements,including faster defersand non-cooperative goroutine preemptionto reduce schedulingand garbage collection latency.\n In early March, we launched a new API for protocol buffers, google.golang.org/protobuf,with much-improved support for protocol buffer reflection and custom messages.\n  When the pandemic hit, we decided to pause any public announcementsor launches in the spring,recognizing that everyone’s attention rightly belonged elsewhere.But we kept working, and one of our team members joined theApple/Google collaboration on privacy-preserving exposure notificationsto support contact tracing efforts all over the world.In May, that group launched the reference backend server,written in Go.\n We continued to improve  gopls,which enables advanced Go-aware supportin many editors.In June, the VSCode Go extension officially joined the Go projectand is now maintained by the same developers who work on gopls.\n Also in June, thanks to your feedback, we open-sourced the code behind pkg.go.devas part of the Go project as well.\n Later in June, we released the latest design draft for generics,along with a prototype tool and  generics playground.\n In July, we published and discussed three new design drafts for future changes: new  //go:build lines for file selection, file system interfaces,and build-time file embedding.(We’ll see all of those in 2021, as noted below.)\n In August, the  Go 1.15 releasedelivered mainly optimizations and bug fixes rather than new features.The most significant was the start of a rewrite of the linker,making it run 20% faster and use 30% less memoryon average for large builds.\n Last month, we ran our  annual Go user survey.We will post results on the blog once we’ve analyzed them.\n The Go community has adapted to “virtual-first” along with everyone else,and we saw many virtual meetups and over a dozen virtual Go conferences this year.Last week, the Go team hosted Go day at Google Open Source Live(videos at the link).\n    We’re also incredibly excited about what’s in store for Go’s 12th year.Most immediately, this week Go team members willbe presenting eight events at GopherCon 2020.Mark your calendars!\n “Typing [Generic] Go”,a talk by Robert Griesemer,  Nov 11, 10:00 AM (US Eastern); Q&amp;A at 10:30 AM.\n “What to Expect When You’re NOT Expecting”,a live taping of the Go time podcast with a panel of expert debuggers,including Hana Kim,  Nov 11 12:00 PM.\n “Evolving the Go Memory Manager&#39;s RAM and CPU Efficiency”,a talk by Michael Knyszek,  Nov 11 1:00 PM; Q&amp;A at 1:50 PM.\n “Implementing Faster Defers”,a talk by Dan Scales,  Nov 11 5:10 PM; Q&amp;A at 5:40 PM.\n “Go Team - Ask Me Anything”,a live Q&amp;A with Julie Qiu, Rebecca Stambler, Russ Cox, Sameer Ajmani, and Van Riper,  Nov 12 3:00 PM.\n “Pardon the Interruption: Loop Preemption in Go 1.14”,a talk by Austin Clements,  Nov 12 4:45 PM; Q&amp;A at 5:15 PM.\n “Working with Errors”,a talk by Jonathan Amsterdam,  Nov 13 1:00 PM; Q&amp;A at 1:50 PM.\n “Crossing the Chasm for Go: Two Million Users and Growing”,a talk by Carmen Andoh,  Nov 13 5:55 PM.\n    In February, the Go 1.16 release will include the new file system interfacesand build-time file embedding.It will complete the linker rewrite, bringing additional performance improvements.And it will include support for the new Apple Silicon ( GOARCH=arm64) Macs.\n In August, the Go 1.17 release will no doubt bring more features and improvements,although it’s far enough out that the exact details remain up in the air.It will include a new register-based calling convention for x86-64(without breaking existing assembly!),which will make programs faster across the board.(Other architectures will follow in later releases.)One nice feature that will definitely be included is the new  //go:build lines,which are far less error-prone than the current  //  +build lines.Another highly anticipated feature we hope will be ready for beta testing next yearis support for fuzzing in the  go test command.\n    Over the next year, we will continue to work on developing support for Go modulesand integrating them well into the entire Go ecosystem.Go 1.16 will include our smoothest Go modules experience yet.One preliminary result from our recent survey is that 96% of usershave now adopted Go modules (up from 90% a year ago).\n We will also finally wind down support for GOPATH-based development:any programs using dependencies other than the standard library will need a  go.mod.(If you haven’t switched to modules yet, see the GOPATH wiki pagefor details about this final step in the journey from GOPATH to modules.)\n From the start, the  goal for Go moduleshas been “to add the concept of package versions to the working vocabularyof both Go developers and our tools,”to enable deep support for modules and versions throughout the Go ecosystem.The  Go module mirror, checksum database, and indexwere made possible by this ecosystem-wide understanding of what a package version is.Over the next year, we will see rich module support added to more tools and systems.For example, we plan to investigate new tooling to help module authors publish new versions( go release)as well as to help module consumers update their code to migrate away fromdeprecated APIs (a new  go fix).\n As a larger example, we created goplsto reduce many tools used by editors for Go support,none of which supported modules, down to a single one that did.Over the next year,we’ll be ready to make the VSCode Go extension use  gopls by default,for an excellent module experience out of the box,and we’ll release gopls 1.0.Of course, one of the best things about gopls is that it is editor-neutral:any editor that understands the language server protocolcan use it.\n Another important use of version information is tracking whetherany package in a build has a known vulnerability.Over the next year, we plan to develop a database of known vulnerabilitiesas well as tools to check your programs against that database.\n The Go package discovery site pkg.go.devis another example of a version-aware system enabled by Go modules.We’ve been focused on getting the core functionality and user experience right,including a redesign launching today.Over the next year,we will be unifying godoc.org into pkg.go.dev.We will also be expanding the version timeline for each package,showing important changes in each version,known vulnerabilities, and more,following the overall goal of surfacing what you need to make informed decisions about adding dependencies.\n We’re excited to see this journey from GOPATH to Go modulesnearing completion and all the excellent dependency-aware toolsthat Go modules are enabling.\n    The next feature on everyone’s minds is of course generics.As we mentioned above, we published the latest design draft for genericsback in June.Since then, we’ve continued to refine rough edges and have turned ourattention to the details of implementing a production-ready version.We will be working on that throughout 2021, with a goal of havingsomething for people to try out by the end of the year,perhaps a part of the Go 1.18 betas.\n    Go is far more than just us on the Go team at Google.We are indebted to the contributors who work with us with the Go releases and tools.Beyond that, Go only succeeds because of all of you who work inand contribute to Go’s thriving ecosystem.It has been a difficult year in the world outside Go.More than ever, we appreciate you taking the timeto join us and help make Go such a success.Thank you.We hope you are all staying safe and wish you all the best.", "posttime": "2020-11-11 01:46:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "走过,eleven,围棋", "title": "走过的11个年头", "title_en": "Eleven Years of Go", "transed": 1, "url": "https://blog.golang.org/11years", "via": "", "real_tags": ["走过", "eleven", "围棋"]}, {"category": "", "categoryclass": "", "imagename": "c048e76e97f37c2c2721591fa63f0f86.png", "infoid": 1034305, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，我们很兴奋地宣布F#5正式发布。它与.NET5一起发布。我们在过去的一年里一直致力于F#5，我们很高兴能与大家分享它。\n如果您在Windows上使用Visual Studio，则需要升级到最新的16.8版本。\n从F#4.1到F#5，F#的主要关注点一直是对.NET Core(现在是.NET5)的巨大支持。有了F#5，我们认为这段旅程基本结束了。F#5标志着F#演变的新时代的开始，主要围绕三个方面：\n我们带着大致相同的目标开始了F#5，在第一个预告片中说“F#5专注于更好的交互式和分析性编程”。这仍然是正确的，我们还添加了一些更多的正交特性，每个人都可以享受这些特性，而不管他们是如何使用F#的。\nF#5是.NET SDK和Visual Studio的新默认语言版本。任何使用这两个工具集编译的新项目或现有项目都将使用F#5。\n看看这个样本库，它展示了你可以用F#5做的一些事情。你可以尝试那里的每一个特性，而不是从头开始。\nF#5支持使用#r&#34；Nuget：...语法在F#脚本中引用包。以下是大多数套餐的外观：\n包引用还支持对引用依赖.dll有特殊要求的包。例如，FParsec包过去要求用户手动确保在F#Interactive中引用FParsec.dll之前首先引用其依赖的FParsecCS.dll。这不再需要，您只需如下所示引用该包即可：\n在Jupyter笔记本或VSCode笔记本中使用F#时，包引用是获取任何包的基础。\n为了与包引用相一致，Jupyter笔记本、Interact和VSCode笔记本都完全支持F#5。\nVSCode笔记本本身仍处于预览阶段，但它们已经支持相当多的功能：\n我们希望您能试用一下，并就您觉得需要的内容给我们反馈。要做到这一点，请按照安装说明操作，在GitHub上提交问题时不要害羞！\n字符串内插是最受欢迎的语言特性之一，也是我们在F#语言设计库中最初设计的第一个特性。多年来，这个设计经历了很多讨论，但最终李亚涛在如何最好地处理它方面取得了突破，他也提供了一个初步的实现方案。\nF#内插字符串与C#或JavaScript内插字符串非常相似，因为它们允许您在字符串文字内的“洞”中编写代码。下面是一个基本的例子：\n但是，F#内插字符串也允许类型内插，就像print intf函数一样，以强制内插上下文中的表达式符合特定类型。它使用相同的格式说明符。\n对于更高级的用法，您可以在一个插值(从技术上讲几乎是整个程序)中编写多个表达式。也就是说，通常最好将函数定义放在内插字符串之外！\nF#5的另一个被高度要求的特性是NameOf，它可以解析它所使用的符号，并在F#源代码中生成它的名字。这在各种情况下都很有用，例如日志记录，并保护您的日志记录不受源代码更改的影响。\n最后一行将抛出异常，错误消息中将显示“月”。\n最后增加的三项是对运算符工作方式的更改：为泛型类型参数添加了nameof&lt；type-参数&gt；形式，以及能够在模式匹配表达式中将nameof用作模式。\nF#5还增加了对开放类型声明的支持。开放类型声明类似于在C#中打开一个静态类，只不过它有一些不同的语法和一些稍微不同的行为来适应F#语义。\n使用Open Type声明，您可以打开任何类型以公开其中的静态内容。此外，您还可以打开F#定义的联合和记录以公开其内容。例如，如果您在一个模块中定义了一个联合，并且想要访问它的案例，但不想打开整个模块，那么这会很有用。\n在对数据集执行分析工作时，切片数据类型至关重要。为此，我们在两个方面增强了F#切片以供发布，其中一个仍被认为是预览版。\n在F#5之前，对内置FSharp.Core数据类型(数组、列表、字符串、2D数组、3D数组、4D数组)进行切片的行为通常不一致。有些边缘情况行为会引发异常，有些则不会。在F#5中，对于无法生成的切片，所有内置类型现在都会返回空切片：\n内置的3D和4D数组类型一直支持切片，但它们不支持固定特定的索引(例如3D数组中的y维)。现在他们做到了！\n如果要从数组中提取切片[|4；5|]，该怎么办？现在这很简单了！\n如今，计算表达式(CE)被用来建模“上下文计算”，或者用更多函数式编程友好的术语来说，就是一元计算。然而，与仅仅提供Monad语法相比，它们是一种更灵活的构造(如果愿意，您可以编码Monid，甚至可以编码显式违反每个Monad定律的计算表达式)。\nF#5介绍了应用型CE，它是CE的一种形式，与您可能习惯的形式略有不同。如果每个计算都是独立的，并且它们的结果只是在结束时累积，则应用CE允许更高效的计算。当计算相互独立时，它们也可以微不足道地并行化。不过，这一好处有一个限制：不允许进行依赖于先前计算值的计算。\n应用CES的工作是与G-Research合作完成的，G-Research经常为F#生态系统做出贡献。谢谢大家！\n如果您是一个现在在库中公开CE的库作者，那么您需要注意一些额外的考虑事项。这些将在逐个版本的计算表达式文章中进行记录。\n对于应用型CE的消费者来说，这与你已经在使用的CE并没有太大的不同。前面提到的关于独立计算的限制是要理解的关键概念。\n多亏了Nino Floris的贡献，来自计算表达式(如F#Async)中捕获的异常的堆栈跟踪现在保留了更多信息。请考虑以下使用PLY库的代码：\n在F#5之前，如果不在PLY库(以及任何其他可能出现这种情况的库)中解决问题，源函数就不会出现在堆栈跟踪中。现在，它显示了完整的跟踪信息：\n现在，您可以在不同的泛型实例化上实现相同的接口。Lukas Rieger贡献了这一特性的初始设计和实现。\n您可以通过实现接口的任何标准方法在F#中使用它：\n这使您可以在期望用户能够使用默认实现时，安全地利用用现代C#编写的C#代码和.NET组件。\n可空(值)类型(历史上称为可空类型)长期以来一直受到F#的支持，但传统上与它们交互有点麻烦，因为每次您想要传递一个值时，都必须构造一个可为空或可为空的SomeType&&gt;包装器。现在，如果目标类型匹配，则编译器将隐式地将值类型转换为Nullable&lt；ThatValueType&gt；。现在可以执行以下代码：\n.NET5改进了处理.ail调用的性能，F#在各种情况下(特别是在递归和异步代码中)会发出.ail调用。这对应用程序运行时性能的影响可能会因您编写的代码类型而异，因为并不是所有的.ail调用都是相等的。但是，与.NET Core3.1相比，您通常可以预期运行时性能会有所提高。\n多年来，F#编译器的性能一直在稳步提高。我将通过在FSharpPlus库中编译核心项目来演示这一点。这个核心项目使用了大量的F#构造，对编译器本身起到了很好的压力测试作用。我对F#5、F#4.7和F#4.5运行了以下命令。\n这些命令清理输出目录并强制msbuild串行运行(尽管无论如何它都可能是串行的，因为它正在编译单个项目)，并报告在构建期间运行的所有任务的时间。下表显示了完成FSC任务(即F#编译器)所需的时间：\n从F#4.5到F#4.7有了很大的进步，F#5也有了又一次大的飞跃！\n你自己的结果可能会因各种因素而略有不同，但如果你自己试一试，你应该会看到相当相似的价差。同样值得注意的是，.NET工具链中的其他所有东西也都得到了改进，所以当你在.NET5中使用F#5时，不仅仅是F#编译器变得更快了。\nF#5还带来了两个新的预览功能。要使用这些设置，您需要如下设置您的&lt；LangVersion&gt；preview&lt；/LangVersion&gt；：\n我们决定在F#5的预览版中保留反向索引的功能。在完全发布之前，仍然有一些关于System.Range和System.Index互操作的问题需要解决。\n语法为^IDX。下面是如何从列表末尾开始计算元素1值的方法：\n您还可以为自己的类型定义反向索引。为此，您需要实现以下方法：\n我们认为这三个增强将使F#中的数据类型切片更加方便。你认为如何？\n对于库和框架作者来说，计算表达式是一个强大的功能。它们允许您定义知名成员并为您所在的域形成DSL，从而极大地提高了组件的表现力。\n迭戈·埃斯梅里奥(Diego Esmerio)和瑞安·莱利(Ryan Riley)贡献了一个设计和实现，允许在计算表达式中重载自定义关键字。这一新功能允许编写如下代码：\n在此更改之前，您可以按原样编写InputBuilder类型，但不能像上一个示例中那样使用它。由于允许重载、可选参数以及现在的System.ParamArray类型，因此一切都如您所期望的那样工作。\n现在F#5发布了，我们将重点放在以下几个方面：\n今天，F#开发库是一个相当复杂的代码库。有几个测试套件是在历史上的不同阶段创建的，其中一个特别具有挑战性，因为它不会加载到任何IDE工具中。我们觉得要求开源贡献者在这个测试套件中添加或更新测试这样的事情是不公平的，所以我们正在将其迁移到现代版本。代码库还构建了两个版本的F#编译器，称为“桌面编译器”和“CoreCLR编译器”。从技术角度来看，“CoreCLR编译器”可以用来在任何操作系统上构建任何针对任何.NET风格的F#项目。我们仍在建设这两个项目的唯一原因是我们打算偿还的技术债务。从开源贡献者的角度来看，这也应该简化事情。\n我们还计划随着时间的推移对F#工具进行重大改进。我们已经开始这项工作了。第一步是将FSharp.Compiler.Service整合到我们的构建和打包基础架构中，这样任何使用此包的用户(例如VSCode中的Ionide插件)都可以简单地添加NuGet提要并获得每晚的更新。接下来，我们将致力于淘汰FSharp.Compiler.Private项目，该项目在功能上等同于FSharp.Compiler.Service，以便所有F#工具以相同的方式使用相同的功能。从那时起，我们打算与F#社区合作，最终强化F#LSP实现，使其支持所有F#编辑器工具(包括Visual Studio)。长期目标是所有F#工具都具有一致的行为和功能可用性，各个编辑器在该行为之上添加自己的“风格”和独特的功能集，以便F#程序员可以选择他们最喜欢的工具。\n此外，我们还将继续投资于Visual Studio的F#工具，以提高性能并增加几个功能。其中一个功能被称为“内联提示”，你可以通过按住一个按键命令来激活它。这使您可以看到所有声明的推断类型以及应用时F#参数的名称(就像它们是命名参数一样)：\n这样的功能背后的意图是让您能够有效地询问编译器，它在任何时候都可以为您的代码推断出什么。我们有兴趣加入其他功能，让F#开发人员的工作效率更高。\n最后，我们正在计划F#语言的下一个版本。议事日程上已经有几件事：\n新的F#语言特性列表在不断演变，新的需求不断涌现，我们也相应地进行了调整。然而，我们仍然致力于F#5开始的方向。我们希望继续让F#成为一种令人愉快的交互式和分析性编程语言。你可以期待在不久的将来看到更多的美好。", "note_en": "Today, we’re excited to announce the general availability of F# 5. It ships with  .NET 5. We’ve been working on F# 5 for over the past year now, and we’re excited to share it with everyone.\n   If you’re using Visual Studio on Windows, you’ll need to upgrade to the  latest 16.8 release.\n  From  F# 4.1 to F# 5, the chief focus for F# has been bringing up great support for .NET Core (now .NET 5). With F# 5, we’re considering this journey mostly complete. F# 5 marks the start of a new era of F# evolution centered around three main things:\n  We started F# 5 with roughly these same goals, stating in the first preview that  “F# 5 is focused on better interactive and analytical programming”. This remains true, and we also added a few more orthogonal features that everyone can enjoy regardless of how they’re using F#.\n  F# 5 is the new default language version for the .NET SDK and Visual Studio. Any new or existing project compiled with either of those toolsets will use F# 5.\n  Check out the  sample repository that shows off some of what you can do with F# 5. You can play with each of the features there instead of starting from scratch.\n  F# 5 brings support for package references in F# scripts with  #r &#34;nuget:...&#34; syntax. Here’s how it looks for most packages:\n   Package references also support packages with special requirements about referencing dependent  .dlls. For example, the  FParsec package used to require that users manually ensure that its dependent  FParsecCS.dll was referenced first before  FParsec.dll was referenced in F# Interactive. This is no longer needed, and you can simply just reference the package like this:\n  Package references are the basis for acquiring any package when using F# in Jupyter Notebooks or VSCode Notebooks.\n  To coincide with package references, F# 5 is fully supported in  Jupyter Notebooks,  nteract, and VSCode Notebooks.\n       VSCode Notebooks themselves are still in preview, but they already support quite a few features:\n    We’d love to have you try it out and give us feedback on what you feel needs to be there. To do so, follow the  installation instructions and don’t be shy when filing issues on GitHub!\n  String Interpolation is one of the most highly-requested language features and the very first feature that we had an initial design for in the  F# Language Design repository. The design has undergone a lot of discussion over the years, but finally a breakthrough on how to best handle it was made by  Yatao Li, who also supplied an initial implementation.\n F# interpolated strings are fairly similar to C# or JavaScript interpolated strings, in that they let you write code in “holes” inside of a string literal. Here’s a basic example:\n  However, F# interpolated strings also allow for typed interpolations, just like the  sprintf function, to enforce that an expression inside of an interpolated context conforms to a particular type. It uses the same format specifiers.\n  For more advanced usage, you can write multiple expressions inside of an interpolation (and technically almost an entire program). That said, it’s usually better to keep function definitions outside of interpolated strings as much as possible!\n  Another highly-requested feature of F# 5 is  nameof which resolves the symbol it’s being used for and produces its name in F# source. This is useful in various scenarios, such as logging, and protects your logging against changes in source code.\n  The last line will throw an exception and “month” will be shown in the error message.\n   Three final additions are changes to how operators work: the addition of the  nameof&lt;&#39;type-parameter&gt; form for generic type parameters, and the ability to use  nameof as a pattern in a pattern match expression.\n    F# 5 also adds support for open type declarations. An open type declaration is like opening a static class in C#, except with some different syntax and some slightly different behavior to fit F# semantics.\n With Open Type Declarations, you can  open any type to expose static contents inside of it. Additionally, you can  open F#-defined unions and records to expose their contents. For example, this can be useful if you have a union defined in a module and want to access its cases, but don’t want to open the entire module.\n   Slicing data types is critical when doing analytical work on sets of data. To that end, we enhanced F# slicing in two areas for release, with one still considered preview.\n  Behavior for slicing the built-in FSharp.Core data types (array, list, string, 2D array, 3D array, 4D array) used to not be consistent prior to F# 5. Some edge-case behavior threw an exception and some wouldn’t. In F# 5, all built-in types now return empty slices for slices that are impossible to generate:\n   The built-in 3D and 4D array types have always supported slices, but they did not support fixing a particular index (such as the  y-dimension in a 3D array). Now they do!\n      What if you wanted to extract the slice  [| 4; 5 |] from the array? This is now very simple!\n    Computation expressions (CEs) are used today to model “contextual computations”, or in more functional programming friendly terminology, monadic computations. However, they are a more flexible construct than just offering syntax for monads (you can encode monoids or even a computation expression that  explicitly violates every monad law if you like).\n F# 5 introduces applicative CEs, which are a slightly different form of CE than what you’re perhaps used to. Applicative CEs allow for significantly more efficient computations provided that every computation is independent, and their results are merely accumulated at the end. When computations are independent of one another, they are also trivially parallelizable. This benefit comes at a restriction, though: computations that depend on previously-computed values are not allowed.\n   Work for Applicative CEs was done in collaboration with  G-Research, who frequently contribute to the F# ecosystem. Thanks, folks!\n If you’re a library author who exposes CEs in their library today, there are some additional considerations you’ll need to be aware of. These will be documented in the  Computation Expressions article by release.\n For consumers of applicative CEs, things aren’t too different from the CEs that you already use. The previously-mentioned restriction around independent computations is the key concept to understand.\n  Thanks to a contribution by  Nino Floris, stack traces coming from caught exceptions in computation expressions (such as F# async) now retain more information. Consider the following code that uses the  Ply library:\n  Prior to F# 5, the  origin function would not appear in stack traces without a workaround in the Ply library (and any other library where this is a scenario). Now it shows the full trace:\n     You can now implement the same interface at different generic instantiations.  Lukas Rieger contributed an initial design and implementation of this feature.\n      You can consume it in F# through any of the standard means of implementing an interface:\n  This lets you safely take advantage of C# code and .NET components written in modern C# when they expect users to be able to consume a default implementation.\n  Nullable (value) types (called Nullable Types historically) have long been supported by F#, but interacting with them has traditionally been somewhat of a pain since you’d have to construct a  Nullable or  Nullable&lt;SomeType&gt; wrapper every time you wanted to pass a value. Now the compiler will implicitly convert a value type into a  Nullable&lt;ThatValueType&gt; if the target type matches. The following code is now possible:\n   .NET 5 brings improvements to the performance of processing  .tail calls, which F# emits in various scenarios (especially in recursive and async code). The impact of this on the runtime performance of your app can vary depending on the  kind of code you’re writing, as not all  .tail calls are equal. However, you should generally expect an improvement to runtime performance compared to .NET Core 3.1.\n   F# compiler performance has steadily improved over the years. I’ll demostrate this by compiling the core project in the  FSharpPlus library. This core project makes use of a lot of F# constructs in a way that acts as a great stress test for the compiler itself. I ran the following commands against F# 5, F# 4.7, and F# 4.5.\n  These commands clean the output directories and force msbuild to run serially (though it would likely be serial anyways since it’s compiling a single project), and reports timings for all tasks run during build. The following table shows the time it took for the  Fsc task to complete, which is the F# compiler:\n  There was a big improvement from F# 4.5 to F# 4.7, and another big jump with F# 5 as well!\n Your own results may vary a bit depending on a variety of factors, but if you try this out yourself you should see a fairly similar spread. It’s also worth noting that everything else in the .NET toolchain has improved too, so it’s not just the F# compiler getting faster when you use F# 5 with .NET 5.\n  F# 5 is also bringing along two new preview features. To use these, you’ll need to set your  &lt;LangVersion&gt;preview&lt;/LangVersion&gt; like so:\n   We decided to keep the ability to do reverse indexes in preview for F# 5. There are still some quirks to work out with respect to  System.Range and  System.Index interop that we want to get right before releaseing fully.\n The syntax is  ^idx. Here’s how you can an element 1 value from the end of a list:\n  You can also define reverse indexes for your own types. To do so, you’ll need to implement the following method:\n    We feel that these three enhancements will make slicing data types more convenient in F# moving forward. What do you think?\n  Computation expressions are a powerful feature for library and framework authors. They allow you to greatly improve the expressiveness of your components by letting you define well-known members and form a DSL for the domain you’re working in.\n Diego Esmerio and  Ryan Riley contributed a design an implementation to allow for overloading custom keywords in computation expressions. This new feature allows code like the following to be written:\n  Prior to this change, you could write the  InputBuilder type as it is, but you couldn’t use it the way it’s used in the previous example. Since overloads, optional parameters, and now  System.ParamArray types are allowed, everything just works as you’d expect it to.\n  Now that F# 5 is released, we’re moving our focus to a few areas:\n  Today, the  F# development repository is quite a complex codebase. There are several test suites that were created at various points in history, one of which being particularly challenging to work with because it doesn’t load in any IDE tooling. We feel that it’s unfair to ask open source contributors to do things like add or update tests when this test suite is concerned, so we’re migrating it to be modern. The codebase also builds two versions of the F# compiler, called the “desktop compiler” and the “CoreCLR compiler”. From a technical standpoint, the “CoreCLR compiler” can be used to build any F# project targeting any .NET flavor on any OS. The only reason why we still build both is technical debt that we intend on paying off. From an open source contributor’s standpoint, this should simplify things as well.\n We also plan on making significant F# tooling improvements over time. We’ve already started this work. One of the first steps was to incorporate  FSharp.Compiler.Service into our build and packaging infrastructure so that any consumers of this package (e.g., the  Ionide plugin in VSCode) can simply add a NuGet feed and get nightly updates. Next, we’ll work towards retiring the  FSharp.Compiler.Private project, which is functionally equivalent to  FSharp.Compiler.Service, so that all F# tooling consumes the same functionality in the same way. From there, we intend on working with the F# community to eventually harden the  F# LSP implementation so that it powers all F# editor tooling (including Visual Studio). The long-term goal is that all F# tools have consistent behavior and feature availability, with individual editors adding their own “flavor” and unique feature set on top of that behavior so that F# programmers can pick the tool they like the most.\n Additionally, we’re continuing to invest in F# tooling for Visual Studio by improving performance and adding several features. One such feature is called “Inline Hints”, which you can activate by pressing and holding a key command. This lets you see the inferred types for all declarations and the names of F# parameters when applied (as if they were named parameters):\n  The intention behind a feature like this is to let you effectively ask the compiler what it’s chosen to infer for your code at any time. We’re interested in incorporating other features that make things more productive for F# developers.\n Finally, we’re planning the next version of the F# language. There are several things on the docket already:\n  The list for new F# language features is constantly evolving and new requirements come in and we adjust accordingly. However, we’re still committed to the direction that we set out on with F# 5. We want to continue to make F# a delightful language for interactive and analytical programming. You can expect to see more goodness in the near future.", "posttime": "2020-11-11 01:46:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "类型", "title": "F#5", "title_en": "F# 5", "transed": 1, "url": "https://devblogs.microsoft.com/dotnet/announcing-f-5/", "via": "", "real_tags": ["类型"]}, {"category": "", "categoryclass": "", "imagename": "da3e900f2163988b7305880f61ef2e86.jpg", "infoid": 1034304, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "JetBrains发布了其首个用于桌面的Jetpack Compose的“里程碑”版本。JetBrains框架基于Google的用于Android用户界面开发的Jetpack Compose工具包，为使用Kotlin构建用户界面提供了一种声明性和反应性的方法。\nJetpack Compose for Desktop的API灵感来自于Reaction和Ffltter等框架，它通过组合可组合的功能来实现桌面用户界面的声明性创建。应用程序状态由框架负责，可视化表示由框架同步。\nJetpack Compose for Desktop提供的核心API与Android移动版类似，包括用户界面元素和修饰符。在建立了项目依赖关系之后，开发人员可以用几行代码来表达一个简单的有状态用户界面，并利用丰富的即用材料设计元素库来充实用户界面。\n为了确保这两种技术共同发展，Jetpack Compose for Desktop的核心正在与Google Jetpack Compose项目合作开发。开发者可以在桌面和Android之间共享用户界面实现的重要部分。桌面专用API的结构类似于Jetpack编写API，并允许应用程序对鼠标指针事件做出反应，查询和操作应用程序窗口的大小和位置，以及创建托盘图标或菜单栏条目。\n第一个里程碑是在11月5日发布的。该框架的入门教程已经发布。Jetpack Compose for Desktop集成了Swing和AWT(抽象窗口工具包)，提供了这些Jetpack Compose for Desktop应用程序的Java API的强大功能。此外，还提供了原生Skia图形库API的重要部分，支持桌面版Jetpack Compose中的低级渲染，并允许开发人员控制他们的应用程序的渲染方式。", "note_en": "JetBrains has published its first “milestone” release of Jetpack Compose for Desktop. Based on  Google’s Jetpack Compose toolkit for Android UI development, the JetBrains framework provides a declarative and reactive approach to building UIs with  Kotlin.\n With an API inspired by frameworks such as React and Flutter, Jetpack Compose for Desktop enables the declarative creation of a desktop UI by combining composable functions. Application state is taken care of and visual representation synchronized by the framework.\n  The core APIs provided by Jetpack Compose for Desktop behave like their Android mobile counterparts, including UI elements and modifiers. After setting up project dependencies, developers can express a simple stateful user interface with a few lines of code and draw on a rich library of ready-to-use Material Design elements to flesh out the UI.\n To ensure that the two technologies evolve together, the core of Jetpack Compose for Desktop is being developed in collaboration with the Google Jetpack Compose project. Developers can share significant parts of a UI implementation between the desktop and Android. Desktop-specific APIs are structured like Jetpack Compose APIs and allow an application to react to mouse pointer events, query and manipulate the size and positioning of application windows, and create tray icons or menu bar entries.\n  The first milestone was published November 5. A  Getting Started tutorial for the framework is available. Jetpack Compose for Desktop integrates with Swing and AWT (Abstract Window Toolkit), providing the power of these Java APIs for Jetpack Compose for Desktop applications. Also featured is a significant part of the native Skia graphics library API, powering low-level rendering in Jetpack Compose for Desktop and allowing developers to control how their application is rendered.", "posttime": "2020-11-11 01:45:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,releases,用户界面", "title": "JetBrains发布Kotlin桌面用户界面框架", "title_en": "JetBrains releases desktop UI framework for Kotlin", "transed": 1, "url": "https://www.infoworld.com/article/3596322/jetbrains-releases-desktop-ui-framework-for-kotlin.html", "via": "", "real_tags": ["发布", "releases", "用户界面"]}, {"category": "", "categoryclass": "", "imagename": "8512f4d7af3d6585658965dec14c6308.jpg", "infoid": 1034302, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欧洲最高竞争监管机构今天对亚马逊提起诉讼，指控该公司滥用其规模、地位和数据访问，以获得相对于竞争对手的不公平优势。\n欧盟委员会对亚马逊的反对声明集中在该公司在电子商务领域的双重角色上，亚马逊既是零售商，也是第三方零售商的平台。欧盟声称，作为一个平台，亚马逊可以获取所有其他商家的专有数据，然后收集这些数据，并以反竞争的方式利用这些数据在自己的零售业务中占据一席之地。\n欧盟委员会认定，这不只是一次罕见或偶尔的失误，相反，它发现亚马逊可以获得大量非公开卖家数据，而且这些数据直接流入[亚马逊]的自动化系统。据称，亚马逊随后利用这些数据做出自己的决定，损害了其他市场卖家的利益。\n今年早些时候，《华尔街日报》(Wall Street Journal)报道称，亚马逊在美国的员工正在访问和使用这些数据--尽管亚马逊的一名高管在听证会上当面告诉国会，该公司没有这样做。\n亚马逊的一名前雇员告诉“华尔街日报”：我们知道我们不应该访问这些数据。但与此同时，我们也在生产亚马逊品牌的产品，我们希望它们能卖出去。\n欧盟竞争局局长玛格丽特·维斯特格(Margrethe Vestager)表示：我们必须确保亚马逊(Amazon)等具有市场支配力的双重角色平台不会扭曲竞争。当亚马逊成为这些卖家的竞争对手时，有关第三方卖家活动的数据不应被用来造福亚马逊。亚马逊平台上的竞争条件也必须是公平的。它的规则不应该人为地偏袒亚马逊自己的零售产品，或者利用亚马逊物流和送货服务的零售商的产品。\n欧盟委员会还宣布，它已经开始对亚马逊的业务进行第二次反垄断调查。新的调查将确定，亚马逊购物箱中的因素及其对亚马逊物流和递送服务的杠杆作用，是否构成了非法滥用主导市场地位的行为。这项新的调查将确定，亚马逊购物箱及其对亚马逊物流和递送服务的杠杆作用是否构成了非法滥用市场主导地位的行为，这一调查将决定这些因素是否构成对亚马逊主导性市场地位的非法滥用。\n欧盟对亚马逊Marketplace的调查于2019年正式启动，此前初步事实调查显示，亚马逊很可能违反了反垄断规定。第一次调查催生了第二次调查并不令人意外，欧洲监管机构在大西洋彼岸也有自己的公司。\n在美国，州和联邦监管机构都对亚马逊的商业行为非常感兴趣。美国司法部(Department Of Justice)和联邦贸易委员会(Federal Trade Commission)采取了分而治之的方式来调查美国最大的科技公司的行为，而对亚马逊的调查落到了联邦贸易委员会的头上。\n联邦贸易委员会尚未公开谈论这项调查，但2019年至今年出现的媒体报道表明，在这里，监管机构也对亚马逊利用其对Marketplace供应商的权力的方式感到担忧。\n彭博社(Bloomberg)8月份报道称，纽约州和加利福尼亚州的总检察长现在都在直接与联邦贸易委员会合作进行反垄断调查。在重大案件中，州和联邦执法者集中资源的情况并不少见：例如，美国司法部上个月对谷歌(Google)提起的里程碑式的反垄断案已有11个州签署，还有数十个州可能计划在未来几个月加入。\n国会也对互联网的Everything Store感到不满。众议院反垄断小组委员会上个月发布了一份针对亚马逊、谷歌、Facebook和苹果的重磅炸弹报告，其中发现亚马逊向国会提交的一些声明似乎具有误导性，可能在刑事上是虚假的或有恶意的。\n该委员会得出结论称，亚马逊对大多数第三方卖家及其许多供应商拥有垄断权。许多卖家在采访中告诉委员会工作人员，他们不能求助于其他市场，不管亚马逊可能会增加他们的经营成本，或者他们受到多么恶劣的对待。", "note_en": "Europe&#39;s top competition regulator filed charges today against Amazon, alleging that the company has abused its size, position, and access to data to gain an unfair advantage over the competition.\n The European Commission&#39;s  statement of objections against Amazon is centered on the firm&#39;s &#34;dual role&#34; in e-commerce, where it is both a retailer and also a platform for third-party retailers. As a platform, Amazon has access to proprietary data about all those other merchants&#39; online business, which it then gathers and uses anticompetitively to get a leg up in its own retail operations, the EU alleges.\n This is not just an infrequent or occasional lapse, the EC determined, finding instead that &#34;very large quantities of non-public seller data&#34; are available to Amazon and &#34;flow directly into [Amazon&#39;s] automated systems.&#34; Amazon then allegedly uses that data to make its own determinations, &#34;to the detriment of the other marketplace sellers.&#34;\n The Wall Street Journal  reported earlier this year that Amazon employees in the US were accessing and using that data—even though an Amazon executive told Congress to their faces in a hearing that the company does no such thing.\n &#34;We knew we shouldn’t,&#34; access that data, one former Amazon employee told the WSJ. &#34;But at the same time, we are making Amazon branded products, and we want them to sell.&#34;\n &#34;We must ensure that dual role platforms with market power, such as Amazon, do not distort competition,&#34; said Margrethe Vestager, head of the EU&#39;s competition bureau. &#34;Data on the activity of third-party sellers should not be used to the benefit of Amazon when it acts as a competitor to these sellers. The conditions of competition on the Amazon platform must also be fair. Its rules should not artificially favor Amazon&#39;s own retail offers or advantage the offers of retailers using Amazon&#39;s logistics and delivery services.&#34;\n The Commission also announced that it has begun a second antitrust probe into Amazon&#39;s business. The new investigation will determine whether the factors that go into amazon&#39;s &#34;buy box,&#34; and its leverage of &#34;Fulfilled By Amazon&#34; logistics and delivery services, add up to unlawful abuse of a dominant market position.\n  This EU probe into Amazon&#39;s Marketplace  formally launched in 2019 after a &#34;preliminary fact-finding&#34; indicated there was likely an antitrust violation taking place. That the first investigation has spawned a second is not surprising, and European regulators have company on this side of the Atlantic as well.\n Here in the US,  both state and federal regulators have taken a deep interest in Amazon&#39;s business practices. The Department of Justice and the Federal Trade Commission took a  divide-and-conquer approach to probing the behavior of the country&#39;s biggest tech firms, and investigating Amazon fell to the FTC.\n The FTC has not spoken publicly about the probe, but  media reports that surfaced through 2019 and into this year indicate that here, too, regulators are concerned about the way Amazon leverages its power over Marketplace vendors.\n Bloomberg  reported in August that the attorneys general for both New York and California are now partnering directly with the FTC on the antitrust probe. It is not uncommon, in major cases, for state and federal enforcers to pool their resources: for example,  11 states signed on to the landmark antitrust case the DOJ filed against Google last month, with several dozen more potentially planning to join in the coming months.\n Congress, too, is displeased with the Internet&#39;s Everything Store. The House Antitrust Subcommittee last month published a  blockbuster report into Amazon, Google, Facebook, and Apple, in which it found, among other things, that that some statements Amazon made to Congress &#34;appear to be misleading, and possibly criminally false or perjurious.&#34;\n &#34;Amazon has monopoly power over most third-party sellers and many of its suppliers,&#34; the committee concluded. &#34;Numerous sellers told Subcommittee staff in interviews that they cannot turn to alternative marketplaces, regardless of how much Amazon may increase their costs of doing business or how badly they are treated.&#34;", "posttime": "2020-11-11 01:00:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚马逊,amazon,发现,launches,调查", "title": "欧盟对亚马逊展开第二次调查，发现公司“扭曲竞争”", "title_en": "EU launches second Amazon probe, finds company “distorts competition”", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/11/eu-launches-second-amazon-probe-finds-company-distorts-competition/", "via": "", "real_tags": ["亚马逊", "amazon", "发现", "launches", "调查"]}, {"category": "", "categoryclass": "", "imagename": "183a627b0c5ab6dec99d5136526b12b4.jpg", "infoid": 1034301, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你可能还记得去年这个时候Disrupt的Startup Battlefield中的Orbit Fab。首席执行官兼联合创始人丹尼尔·费伯(Daniel Faber)首次亮相其加油接口Rafti，并向公司展示了该接口和一个“加油机”卫星网络如何通过让航天器保持在轨道上而不是发射替代物来为公司节省数亿美元。\nAstroScale正在为地球同步轨道上的卫星进行类似的努力，这些卫星的更换成本甚至更高。但这家总部位于日本的公司也在致力于摧毁散落在其他轨道上的无数报废卫星和碎片，并为此筹集了巨额资金。美国总统罗恩·洛佩兹(Ron Lopez)将加入该小组，讨论提高太空可持续性的许多潜在方法。\n马克萨尔当然是太空行动中的知名人物，我们在TC Sessions：Robotics的舞台上请到了太空机器人负责人露西·康德拉基安(Lucy Condrakchian)。她的团队目前正在进行雄心勃勃的Restore-L任务，该任务将演示在轨加油、制造和组装。如果你能在上面建，为什么要建在这里？\n这三位小组成员将讨论这一新兴行业的可能性，以及它对当地的初创企业和老牌企业意味着什么。随着发射成本的下降，建造和维护一颗大型卫星的成本成为一个更大的问题-但小型、廉价的卫星也开始激增。\n市场将如何演变？像拉夫蒂这样专有但实用的技术能有所作为吗？我们离第一颗完全在太空建造的卫星有多近？所有这些，甚至更多，都将在下个月我们的小组讨论中提上议事日程。\n在本周五(11月13日)之前，只需125美元就能买到一张早班票。我们还为团体、学生、在职军人/政府雇员以及想要推销自己的初创公司并让他们的初创公司获得更多知名度的初创公司提供折扣。", "note_en": "You may remember Orbit Fab from Disrupt’s Startup Battlefield around this time last year. CEO and co-founder Daniel Faber  debuted its refueling interface, RAFTI, and showed how that and a network of “tanker” satellites could save companies hundreds of millions by keeping their spacecraft in orbit rather than sending up replacements.\n Astroscale   is embarking on a similar effort for satellites in geosynchronous orbits, which are even more expensive to replace. But the Japan-based company is it’s also aiming at taking down the innumerable dead satellites and debris scattered throughout other orbits, and has  raised huge sums to do so. US President Ron Lopez will join the panel to discuss the many potential approaches to improving sustainability in space.\n Maxar is of course a well-known name in space operations, and we’ve had head of space robotics Lucy Condrakchian on stage at TC Sessions: Robotics. Her team is currently working on  the ambitious Restore-L mission, which will demonstrate on-orbit refueling, manufacturing, and assembly. Why build it down here if you can do it up there?\n  These three panelists will discuss the possibilities of this emerging industry and what it could mean for startups and established enterprises here on the ground. With costs of launch dropping, the cost of building and maintaining a major satellite becomes a greater issue — but tiny, cheap satellites are also beginning to proliferate.\n How will the market evolve? Can proprietary but practical tech like RAFTI make a difference? How close are we to the first satellite built entirely in space? All this and more will be on the table for our panel next month.\n Get an early-bird ticket for just $125 until this Friday, November 13. And we have  discounts available for groups,  students,  active military/government employees and for  early-stage space startup founders who want to pitch and give their startup some extra visibility.", "posttime": "2020-11-11 00:55:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "太空,2020,space", "title": "\n太空加油和制造的先驱加入TC会议：太空2020", "title_en": "\n\t\t\t\tPioneers of in-space refueling and manufacturing join TC Sessions: Space 2020\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/10/pioneers-of-in-space-refueling-and-manufacturing-join-tc-sessions-space-2020/", "via": "", "real_tags": ["太空", "2020", "space"]}, {"category": "", "categoryclass": "", "imagename": "8edb8652dad799a2573e1b166f9b7e7c.png", "infoid": 1034300, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "区块链侦探公司CipherTrace表示，分散的金融对黑客很有吸引力，因为它不受监管，而且是匿名的。\n根据CipherTrace的数据，今年到目前为止，Defi黑客攻击已经给密码平台和用户造成了1亿美元的损失。\n在2020年上半年，Defi盗窃占所有密码盗窃和黑客攻击的40%。\n区块链调查公司CipherTrace今天发布的一份报告显示，2020年上半年，40%的密码黑客攻击目标是去中心化金融(Defi)协议和加密货币交易所。\n这家成立五年的公司发现，从1月到6月，与Defi相关的密码失窃事件价值5150万美元。从7月到现在，这一数字为4770万美元，占第三季度至第四季度总额的14%。\nDEFI指的是非托管金融产品，如分散贷款协议和交易所。它们在今年夏天变得流行起来，因为它们开始向投资者提供丰厚的奖金，因此在接下来的几个月里，投资者在这些协议中插入了价值超过140亿美元的密码。这些产品中有几种是新的、高度实验性的、不受监管的。这使得他们很容易受到黑客的攻击。\n密码追踪公司在其报告中说：“Defi 协议在设计上是 无许可的 ， 意味着它们通常缺乏任何明确的法规遵从性，任何国家的任何人都可以在几乎没有收集到KYC信息的情况下访问它们的  。因此， Defi 很容易成为洗钱者的避风港。\n其中一项协议-分散保证金贷款协议BZX-今年曾三次遭到黑客攻击。2月份的两次黑客攻击让它损失了100万美元，9月份的一次黑客窃取了810万美元。\n今年4月，黑客从DForce协议中窃取了2500万美元(尽管在资金被列入黑名单时返还了部分资金)。上个月，Defi机器人顾问协议公司嘉实金融(Variest Finance)在一名黑客手中损失了3400万美元(这名黑客还返还了一小部分钱)。\nCipherTrace表示，由于KuCoin密码交换攻击，价值近2.81亿美元的加密货币被盗，下半年因Defi黑客攻击和盗窃而损失的资金比例下降。大部分密码最终被列入黑名单或被淘汰，但黑客仍在继续出售部分资金。\n区块链调查公司表示，如果Defi行业不能找到一些方法来保持其智能合约的完好无损，“Defi很可能只会继续遭受漏洞、欺诈和洗钱造成的后果。”\n为获得最佳体验，请立即下载最新密码新闻和独家功能。", "note_en": "Decentralized finance is attractive to hackers because it’s unregulated and anonymous, says blockchain sleuthing firm CipherTrace.\n   DeFi hacks have cost crypto platforms and users $100 million so far this year, according to CipherTrace.\n During the first half of 2020, DeFi thefts accounted for 40% of all crypto thefts and hacks.\n Blockchain investigation firm CipherTrace today published a report that shows 40% of all crypto hacks in the first half of 2020 targeted decentralized finance ( DeFi) protocols and cryptocurrency exchanges.\n The five-year-old company found $51.5 million in DeFi-related crypto theft from January through June. From July until now, that figure is $47.7 million—14% of the Q3-Q4 total.\n  DeFi refers to non-custodial financial products, such as decentralized lending protocols and exchanges. They became popular this summer after they began offering lucrative bonuses to investors, who consequently plugged over $14 billion worth of crypto into those protocols in the following months. Several of these products are new, highly experimental and unregulated. That makes them vulnerable to hackers.\n Said CipherTrace in its report: “DeFi protocols are permissionless by design, meaning they often lack any clear regulatory compliance and anyone in any country is able to access them with little to no KYC information collected. As a result, DeFi can easily become a haven for money launderers.”\n One protocol, decentralized margin lending protocol   bZx , was   hacked three times  this year. Two hacks cost it $1 million in February, and a hacker in September stole $8.1 million.\n Hackers stole $25 million from the dForce protocol in April  (though returned some of the money when the funds were blacklisted).   Harvest Finance, a DeFi robo-advisor protocol,  lost $34 million to a hacker last month (the hacker also returned a small amount of the money).\n CipherTrace said that the proportion of funds lost to DeFi hacks and thefts declined in the second half of the year due to the   KuCoin crypto exchange attack , in which   almost $281 million  worth of cryptocurrency was stolen. Much of that crypto was eventually   blacklisted or rendered obsolete , but the hacker   continues to sell  some of the funds.\n  The blockchain investigation firm said that if the DeFi industry doesn’t find some way to keep its  smart contracts shipshape, “it is likely that DeFi will only continue to suffer from the consequences resulting from vulnerabilities, fraud, and money laundering.”\n  For the best experience, top crypto news at your fingertips and exclusive features download now.", "posttime": "2020-11-11 00:54:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,密码,2020,盗窃,thefts", "title": "密码追踪：2020年上半年，Defi盗窃占所有密码盗窃和黑客攻击的40%，总计5150万美元；自7月以来，Defi被盗的金额又增加了4770万美元", "title_en": "CipherTrace: in H1 2020, DeFi thefts accounted for 40% of all crypto thefts and hacks, amounting to $51.5M; since July, $47.7M more has been stolen from DeFi", "transed": 1, "url": "https://decrypt.co/47732/defi-hacks-costing-10-million-a-month-report", "via": "", "real_tags": ["黑客", "密码", "2020", "盗窃", "thefts"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1034299, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正如你可能知道的，在写这篇文章的时候，YouTube-dl在GitHub的存储库被屏蔽了，因为GitHub代表RIAA收到了一封DMCA的下架信。虽然我不能评论目前的维护者计划或正在进行的讨论，但考虑到信中的说法，我认为将YouTube-dl作为项目创建者和最初维护者的头几年写下来是有价值的。\n所有好的故事都至少需要一个恶棍，所以我武断地选择了偷铜贼作为故事中的恶棍，这个故事催生了YouTube-dl的今天。早在2006年，我住在距离阿维莱斯5到10公里的一个小镇上，阿维莱斯本身就是西班牙北部的一个小城市或小镇。虽然阿维莱斯的人们享受着一些不错的基础设施和服务，包括有线电视和ADSL互联网接入，但我居住的地区缺乏这些优势。我离电话交换机太远了，无法享受ADSL，铜盗们多年来一直在沿途窃取铜线，导致电话服务不时中断，电话公司知道这些电线可能会再次被盗，因此更换了更弱、更细的电线。在这一点上，这种情况已经持续了几年。\n这意味着到目前为止，我家庭互联网接入的唯一选择是拨号连接和56K的V.90调制解调器。事实上，连接质量太差了，我不得不将调制解调器的速度限制在33.6kbps模式，这样连接至少是稳定的。实际下载速度很少超过4KB/秒。YouTube当时越来越受欢迎，直到当年年底被谷歌收购。\n正如你可以想象的那样，在我上面描述的那种连接上观看任何YouTube视频肯定是痛苦的。任何中等大小的视频都需要很长时间才能下载。例如，如果你计算一下，一段10MB的短片需要40分钟才能下载，这使得流媒体成为不可能。一个更长、质量更高的视频将需要几个小时的时间，在您等待连接可用期间，连接将无法用于其他目的，更不用说连接被中断并不得不重新启动下载过程的可能性。现在想象一下，在看完一段特定的视频后，你会非常喜欢它，然后想要再看一遍或三遍。再次经历这一过程几乎是一种受虐狂行为。\n这种情况让我对下载我想看的视频的可能性很感兴趣：如果视频很有趣，拥有一份拷贝就意味着我可以很容易地观看几次。此外，如果下载程序运行良好，如果连接中断，下载过程可能会恢复，就像经常发生的情况一样。\n当时，还有其他从YouTube下载视频的解决方案，包括一个非常流行的Gresemonkey脚本。纯属偶然，我测试的为数不多的几个工具在我工作时都不工作，所以我决定探索创建我自己的工具的可能性。这或多或少就是YouTube-dl诞生的原因。我把它做成了一个命令行程序，使它对我来说很容易使用，并用Python编写它，因为它很容易，这要归功于它广泛的标准库，还有一个很好的副作用，那就是它将是独立于平台的。\n该程序的最初版本只适用于YouTube视频。它几乎没有任何内部设计，因为它是不需要的。作为一个简单的脚本，它做了它必须做的事情，直截了当地说出了要点。行数只有223行，实际代码行只有143行，其中44行是注释，36行是空白。选择这个名字纯粹是出于方便：YouTube-dl是一个显而易见的名字，很难忘记，在我的终端上，它可以直观地输入为“Y-O-U-TAB”。\n那时我已经使用Linux好几年了，我决定以自由软件许可证(麻省理工学院的第一个版本)发布这个程序，以防有人会觉得它有用。当时，GitHub还不存在，我们只能用SourceForge来“凑合”，它有一个有点繁琐的表格，你需要填写它才能创建一个新项目。所以，我没有去SourceForge，而是很快把它发布在我的互联网提供商给我的网络空间下。虽然现在并不常见，但对于互联网服务提供商来说，给你一个电子邮件地址和一些你可以使用FTP上传内容的网络空间是很常见的。那样的话，你就可以在网上拥有自己的个人网站了。第一个公开的版本是2006.08.08，尽管那时我可能已经使用这个程序好几个星期了。\n为了制作这个程序，我研究了使用Firefox观看YouTube视频时网络浏览器在做什么。如果我没记错的话，Firefox还没有今天用来分析网络活动的开发工具。连接主要是HTTP和Wireshark，直到那一年，Wireshark还被称为“以太”，事实证明，在加载YouTube视频时，检查进出我的盒子的网络流量是非常宝贵的。我编写youtube-dl的具体目标是做与网络浏览器相同的事情来检索视频。它甚至发送了一个从Firefox for Linux逐字复制的User-Agent字符串，以确保该网站向程序发送的视频网页版本与用于研究网络浏览器正在做什么的版本相同。\n此外，YouTube当时还使用Adobe Flash作为播放器。视频被用作Flash Video文件(FLV)，这意味着需要一个专有插件才能在浏览器上观看它们(很多人都会记得可怕的libflashplayer.so库)，这将使任何浏览器开发工具变得毫无用处。这个专有插件一直是安全建议和问题的来源。我使用了一个名为Flashblock的Firefox扩展，它在默认情况下阻止加载插件，并将网页中使用插件嵌入的内容替换为包含可点击图标的占位符元素，这样内容只会按需加载，除非用户请求，否则不会使用插件库。\n除了让浏览体验更安全外，Flashblock还有两个不错的副作用。一方面，它从许多网页上删除了大量嘈杂和令人厌恶的广告，这在由第三方提供服务时也可能成为安全问题的来源。另一方面，它可以方便地分析视频播放器是如何下载视频的。我会等到视频页面完全下载完毕，然后开始使用Wireshark记录流量，然后点击嵌入式视频播放器占位符图标，允许其加载。这样，需要分析的唯一流量与下载视频播放器应用程序的插件和下载视频的应用程序本身相关。\n同样值得一提的是，当时的Flash Player插件已经将这些视频的副本下载到了你的硬盘上(它们存储在Linux下的/tmp中)，许多用户依靠该功能来保存它们的副本，而无需使用额外的工具。例如，youtube-dl更方便，因为它可以检索视频标题，并以自动方式更恰当地命名文件。\nFlash Player插件最终被修改，这样视频就不会那么容易被抓取了。最初的措施之一是在创建视频文件后取消链接，以便i节点仍然存在，并可供使用它的进程使用(直到它被关闭)，同时从文件系统的角度保持该文件不可见。仍然可以通过使用/proc文件系统来检查浏览器进程使用的文件描述符来获取文件，但是通过每一个小步骤，youtube-dl变得越来越方便。\n就像当时许多自由和开源的爱好者一样，我用鲜肉订阅了我感兴趣的项目的新版本。当我创建youtube-dl时，我还在网站上为它创建了一个项目条目，这样用户就可以很容易地获得新版本的通知，以及列出新功能、修复和改进的更改日志。人们还可以浏览鲜肉来寻找新的有趣的项目，它的首页包含了最新的更新，通常一天只有几十个。这只是我的猜测，在2006年，linux.com的编辑乔·巴尔(安息吧)发现了这个项目，并决定写一篇关于这个项目的文章。Linux.com当时有点不同，我认为它是Linux爱好者经常访问的网站之一，还有其他经典网站，如Slashdot或Linux Weekly News。至少对我来说是这样。\n从那时起，YouTube-dl的人气开始增长，我开始时不时地收到一些电子邮件，感谢我创建和维护这个程序。\n快进到2008年。YouTube-dl的受欢迎程度一直在缓慢增长，用户经常要求我制作类似的程序，以便从更多的网站下载，我已经几次答应了这个请求。正是在这一点上，我决定从头开始重新编写程序，使其在本地支持多个视频网站。我有一些简单的想法，可以将程序内部划分为几个部分。为了简化最重要的部分：一个是每个网站通用的文件下载程序，另一个是信息提取程序：包含特定于视频网站的代码的对象(类)。当给定URL或伪URL时，信息提取器将被查询以了解哪个信息提取器可以处理该类型的URL，然后请求提取INFORM\n我还借此机会切换了版本控制系统，并更改了项目的托管位置。当时，Git正在赢得开源项目的分布式版本控制系统之战，但Mercurial也有很多用户，在对两者都进行了测试后，我决定我更喜欢它而不是Git。我开始在youtube-dl上使用它，并将项目转移到了Bitbucket，这是自然而然的选择。当时，Bitbucket只能托管Mercurial存储库，而GitHub只能托管Git存储库。这两款产品都是在2008年推出的，与SourceForge相比，这两款产品都带来了新鲜空气。将按用户划分的项目名称空间(即项目名称不必是全球唯一的，但对于您的项目而言是唯一的)与分布式源代码控制系统相结合，意味着您可以在几分钟内将您的个人项目发布到这两个站点中的任何一个。无论如何，将项目历史迁移到Git并将项目迁移到GitHub还需要几年时间。\n在重写这个项目时，毫无疑问，我应该抓住机会重新命名它，但我不想让现有用户感到困惑，我保留了这个名称，以努力保持该程序的小小人气。\n那一年，国内的技术环境也发生了一些变化。移动数据计划开始获得吸引力，在那年年底，我给自己买了一台3G调制解调器和数据计划，这是我第一次能够以相当快的速度浏览网络。无论如何，这并没有让我停止使用youtube-dl。我每月支付45欧元，但每月的数据上限是5 GB。连接速度终于很快了，但根据计算，我平均每天只能使用150MB左右，这意味着我在使用网络时必须有选择性，如果可能的话，要避免大量下载。YouTube-dl对防止我多次下载大型视频文件有很大帮助。\n一段时间之后，也就是2009年底，我搬到了阿维莱斯，终于开始和我的女朋友(现在是我的妻子，两个孩子的母亲)住在一起。我第一次开始使用我的很多朋友和家人多年来的标准连接和服务。我记得那是一个100/10 Mbps(下行/上行)的电缆连接，没有每月上限。这一变化无疑标志着我使用youtube-dl的频率以及我对这个项目的关注程度出现了转折点。\n没过多久，我终于把它转到了Git和GitHub上，当时市场已经发出了声音，这两种工具都是可行的。YouTube也开始尝试HTML5视频，尽管它要到2015年左右才会成为默认选项。2011年，我做了几年的全职软件工程师工作，总的来说，我并不急于回家编写更多的代码，调优YouTube-dl，或者实现我可能不会亲自使用的最受欢迎的功能请求。\n2011年下半年，我正在进行另一个重要的个人软件项目，知道自己已经好几个月没有完成这项任务了，于是决定辞去YouTube-dl维护员一职。Philipp Hagemeister已经被证明是一个伟大的程序员，在GitHub中有一些未决的拉请求，其中有几个许多人感兴趣的修复。我给了他访问我的youtube-dl回购的提交权限，这基本上就是我这方面的故事了。该项目的Git主分支日志显示，我有一个连续的提交流，直到2011年3月，他们跳到2011年8月合并Philipp的修复。从那以后，一名职员在2013年承诺在源代码中将rg3.github.com改为rg3.github.io，这是GitHub将用户页面从USERNAME.github.com移动到USERNAME.github.io时所需要的，以避免(如果我没记错的话)恶意用户网页从他们自己的官方github.com域提供服务时出现的安全问题。\n虽然我基本上没有参与Youtube-dl的开发，但多年来官方项目页面一直以我在https://github.com/rg3/youtube-dl和https://rg3.github.io/youtube-dl/.的用户名命名。只有当Philipp或其他维护人员要求我授予其他开发人员提交权限时，我才会出现，比如当时的Filippo Valsorda或谢尔盖(Sergey)，他是目前的维护人员之一。不幸的是，在2019年，我们的项目问题跟踪器出现了一个小问题，只有项目所有者才被允许屏蔽用户。这使得我们最终将项目转移到了一个GitHub组织，在那里所有拥有提交访问权限的人都被邀请了(尽管不是每个人都加入了)。GitHub组织让项目维护人员可以更自由地行动，而不需要我时不时地介入文书工作。\n我想重申我最真诚的感谢这些年来不同的项目维护人员，他们极大地改进了代码，能够围绕它创建一个真正的贡献者社区，他们使这个项目比我卸任近10年时更受欢迎。\n我想再说一次，YouTube-dl作为一个工具的目的在它存在的14年中几乎没有改变。在收到RIAA的DMCA信之前和之后，许多人解释了他们是如何怀着不同的目标使用YouTube-dl的。\n对我来说，它一直是关于离线访问已经在网上向普通公众提供的视频。在一个移动网络和始终在线的互联网连接的世界里，你可能会怀疑这是否真的有必要。我想，如果Netflix、亚马逊、迪士尼或HBO都在它们极其流行的流媒体应用中实现了类似的功能，那肯定是这样的。对于长途公路旅行，或者特别是带着孩子出国旅行，或者在地下或飞机上，或者在连接不畅或连接不畅的地方，离线访问评论、报道、播客、讲座、新闻或艺术品是非常方便的。\nYouTube-dl的另一个副作用是当默认的在线界面不能完成任务时在线访问。旧的专有Flash插件并不适用于所有平台和架构，具体取决于您的选择。如今，网络浏览器可以播放视频，但有时可能无法利用高效可用的GPU解码，从而在播放过程中浪费大量电池电量。YouTube-DL可以与本地视频播放器相结合，以使播放某些视频成为可能和/或高效。例如，MPV包括本地YouTube-dl支持。你只需要给它提供一个受支持的视频网站的网址，它就会使用youtube-dl来访问视频流并播放它，而不会在你的硬盘上存储任何东西。\n默认的在线界面也可能缺乏可访问性特征，可能会使某些人难以导航内容，或者缺少同样可以从本地视频播放器应用程序获得的色盲滤镜。\n最后但并非最不重要的一点是，像youtube-dl这样的工具允许人们只使用免费软件访问在线视频。我知道没有多少自由、自由和开放源码的软件纯粹主义者。我甚至不认为自己是其中之一，绝对不会。专有软件一直存在于我们的现代生活中，每天以大量Javascript代码的形式提供给我们，供我们的Web浏览器运行，具有许多不同的不同目的，并不总是符合用户的最佳利益。GDPR的所有缺陷和问题都证明了这一点。使用youtube-dl访问在线视频可能会给你一种隐姓埋名模式的安心，uBlock Origin或Privacy Badger只能勉强理解。", "note_en": "As you may know, as of the time this text is being written  youtube-dl’s repository at GitHub is blocked due to a  DMCA takedown letter received by GitHub on behalf of the RIAA. While I cannot comment on the current maintainers&#39; plans or ongoing discussions, in light of the claims made in that letter I thought it would be valuable to put in writing the first years of youtube-dl as the project creator and initial maintainer.\n All good stories need at least a villain so I have arbitrarily chosen copper thieves as the villains of the story that set in motion what youtube-dl is today. Back in 2006 I was living in a town 5 to 10 kilometers away from  Avilés, which is itself a small city or town in northern Spain. While people in Avilés enjoyed some nice infrastructures and services, including cable and ADSL Internet access, the area I lived in lacked those advantages. I was too far away from the telephone exchange to enjoy ADSL and copper thieves had been stealing copper wires along the way to it for years, causing telephone service outages from time to time and making the telephone company replace those wires with weaker and thinner wires, knowing they would likely be stolen again. This had been going on for several years at that point.\n This meant my only choice for home Internet access so far had been a dial-up connection and a  56k V.90 modem. In fact, connection quality was so poor I had to limit the modem to 33.6 kbps mode so the connection would be at least stable. Actual download speeds rarely surpassed 4 KB/sec.  YouTube was gaining popularity then to the point it was purchased by Google at the end of that year.\n Watching any YouTube video on the kind of connection I described above was certainly painful, as you can imagine. Any video that was moderately big would take ages to download. For example, a short 10 MB video would take, if you do the math, 40 minutes to download, making streaming impossible. A longer and higher-quality video would take several hours and render the connection unusable for other purposes while you waited for it to be available, not to mention the possibility of the connection being interrupted and having to start the download process again. Now imagine liking a specific video a lot after watching it and wanting to watch it a second or third time. Going through that process again was almost an act of masochism.\n This situation made me interested in the possibility of downloading the videos I was trying to watch: if the video was interesting, having a copy meant I could watch it several times easily. Also, if the downloader was any good, maybe the download process could be resumed if the connection was interrupted, as it frequently was.\n At the time, there were other solutions to download videos from YouTube, including a quite popular  Greasemonkey script. By pure chance, none of the few I tested were working when I did, so I decided to explore the possibility of creating my own tool. And that is, more or less, how youtube-dl was born. I made it a command-line program so it would be easy to use for me and wrote it in Python because it was easy thanks to its extensive standard library, with the nice side effect that it would be platform independent.\n The initial version of the program only worked for YouTube videos. It had almost no internal design whatsoever because it was not needed. It did what it had to do as a simple script that proceeded straight to the point. Line count was merely 223, with only 143 being actual lines of code, 44 for comments and 36 of them blank. The name was chosen out of pure convenience: youtube-dl was an obvious name, hard to forget, and it could be intuitively typed as “Y-O-U-TAB” in my terminal.\n Having been using Linux for several years at that point, I decided to publish the program under a free software license (MIT for those first versions) just in case someone could find it useful. Back then, GitHub did not exist and we had to “make do” with  SourceForge, which had a bit of a tedious form that you needed to fill to create a new project. So, instead of going to SourceForge, I quickly published it under  the web space that my Internet provider gave me. While not usual today, it was common for ISPs to give you an email address and some web space you could upload stuff to using FTP. That way, you could have your own personal website on the net. The first ever version made public was 2006.08.08, although I probably had been using the program for a few weeks at that point.\n To create the program, I studied what the web browser was doing when watching a YouTube video using Firefox. If I recall correctly, Firefox didn’t yet have the development tools it has today to analyze network activity. Connections were mostly HTTP and  Wireshark, known as “Ethereal” up to that year, proved invaluable to inspect the network traffic coming in and out of my box when loading a YouTube video. I wrote youtube-dl with the specific goal of doing the same things the web browser was doing to retrieve the video. It even sent out a User-Agent string that was verbatim copied from Firefox for Linux, as a way to make sure the site would send the program the same version of video web pages that were used to study what the web browser was doing.\n In addition, YouTube used  Adobe Flash back then for the player. Videos were served as Flash Video files (FLV), and this all meant a proprietary plugin was required to watch them on the browser (many will remember the dreaded  libflashplayer.so library), which would have made any browser development tools useless. This proprietary plugin was a constant source of security advisories and problems. I used a Firefox extension called  Flashblock that prevented the plugin from being loaded by default and replaced embedded content using the plugin, in web pages, with placeholder elements containing a clickable icon so content would be loaded only on demand and the plugin library was not used unless requested by the user.\n Flashblock had two nice side effects apart from making the browsing experience more secure. On the one hand, it removed a lot of noisy and obnoxious ads from many web pages, which could also be a source of security problems when served by third parties. On the other hand, it eased analyzing how videos were being downloaded by the video player. I would wait until the video page had finished downloading completely and then start logging traffic with Wireshark just before clicking on the embedded video player placeholder icon, allowing it to load. This way, the only traffic to analyze was related to the plugin downloading the video player application and the application itself downloading the video.\n It’s also worth noting the Flash Player plugin back then  was already downloading a copy of those videos to your hard drive (they were stored in  /tmp under Linux) and many users relied on that functionality to keep a copy of them without using additional tools. youtube-dl was simply more convenient because it could retrieve the video title and name the file more appropriately in an automated way, for example.\n The Flash Player plugin was eventually  modified so videos wouldn’t be so easily available to grab. One of the first measures was to  unlink the video file after creating it, so the i-node would still exist and be available to the process using it (until it was closed) while keeping the file invisible from the file system point of view. It was still possible to grab the file by using the  /proc file system to examine file descriptors used by the browser process, but with every one of those small steps youtube-dl turned to be more and more convenient.\n As many free and open source enthusiasts back then, I used  Freshmeat to subscribe to new releases of projects I was interested in. When I created youtube-dl, I also created a project entry for it in that website so users could easily get notifications of new releases and a change log listing new features, fixes and improvements. Freshmeat could also be browsed to find new and interesting projects and its front page contained the latest updates, which usually amounted to only a few dozens a day. It’s only my guess that’s the way  Joe Barr (rest in peace), an editor for  linux.com, found out about the program and decided to write  an article about it back in 2006. Linux.com was a bit different then and I think it was one of the frequently-visited sites for Linux enthusiasts together with other classics like  Slashdot or  Linux Weekly News. At least, it was for me.\n From that point on, youtube-dl’s popularity started to grow and I started getting some emails from time to time to thank me for creating and maintaining the program.\n Fast forward to the year 2008. youtube-dl’s popularity had kept growing slowly and users frequently asked me to create similar programs to download from more sites, a request I had conceded a few times. It was at that point that I decided to rewrite the program from scratch and make it support multiple video sites natively. I had some simple ideas that would separate the program internals into several pieces. To simplify the most important parts: one would be the file downloader, common for every website, and another one would be the information extractors: objects (classes) that would contain code specific to a video site. When given a URL or pseudo-URL, the information extractors would be queried to know which one could handle that type of URL and then requested to extract information about that video or list of videos, with the primary goal of obtaining the video URL or a list of video URLs with available formats, together with some other metadata like the video titles, for example.\n I also took the chance to switch version control systems and change where the project would be hosted. At that moment, Git was winning the distributed version control systems war for open source projects, but Mercurial also had a lot of users and, having tested both, I decided I liked it a bit more than Git. I started using it for youtube-dl and moved the project to  Bitbucket, which was the natural choice. Back then, Bitbucket could only host Mercurial repositories, while GitHub only hosted Git repositories. Both were launched in 2008 and were a breath of fresh air compared to SourceForge. The combination of compartmentalized per-user project namespaces (i.e. the name of your project did not have to be globally unique but unique for your projects) with distributed source control systems meant you could publish your personal projects in a matter of minutes to any of the two sites. In any case, migrating the project history to Git and moving the project to GitHub was still  a couple of years away in the future.\n When rewriting the project I should have taken the chance to rename it, no doubt, but I didn’t want to confuse existing users and kept the name in an effort to preserve the little popularity the program had.\n The technological context at home also switched a bit that year. Mobile data plans started to gain traction and, at the end of that year, I got myself a  3G modem and data plan that, for the first time, allowed me to browse the web at decent speeds. In any case, that didn’t make me stop using youtube-dl. I was paying 45 euros a month but the monthly data cap was limited to 5GB. Connection speed was finally great but, doing the math, I could only use an average of around 150MB a day, which meant I had to be selective when using the network and avoid big downloads if possible. youtube-dl helped a lot to prevent me from downloading large video files multiple times.\n Some time later, at the end of 2009, I moved and finally started living with my girlfriend (now my wife and the mother of my two children) in Avilés. For the first time, I started accessing the Internet using the type of connection and service that had been the standard for many of my friends and family for many years. I remember it was a 100/10 Mbps (down/up) cable connection with no monthly cap. That change definitely marked a turning point in how often I used youtube-dl and how much attention I paid to the project.\n Not much later, I finally moved it to Git and GitHub, when the market had spoken and both tools were the way to go. YouTube also started experimenting with HTML5 video, even if it wouldn’t  become the default option until around 2015. In 2011 I had been working a full-time job as a software engineer for several years and, in general, I was not eager to get home to code a bit more tuning youtube-dl or implementing the most popular feature request I was probably not going to use personally.\n In the second half of 2011 I was in the middle of another important personal software project and decided to step down as the youtube-dl maintainer, knowing I hadn’t been up to the task for several months.  Philipp Hagemeister had proved to be a great coder and had some pending pull requests in GitHub with several fixes many people were interested in. I gave him commit access to my youtube-dl repo and that’s mostly the end of the story on my side. The project’s Git master branch log shows I had a continuous stream of commits until March 2011, when they jump to August 2011 to merge a fix by Philipp. Since then, a single clerical commit in 2013 to change  rg3.github.com to  rg3.github.io in the source code, which was needed when GitHub moved user pages from  USERNAME.github.com to  USERNAME.github.io in order to, if I recall correctly, avoid security problems with malicious user web pages being served from their own official github.com domain.\n While I was basically not involved as a developer of youtube-dl, for years the official project page kept sitting under my username at   https://github.com/rg3/youtube-dl and   https://rg3.github.io/youtube-dl/. I only had to show up when Philipp or other maintainers asked me to give commit access to additional developers, like  Filippo Valsorda at the time or  Sergey, one of the current maintainers. Unfortunately, in 2019 we had a small troll problem in the project issue tracker and only project owners were allowed to block users. This made us finally move the project to a GitHub organization where everyone with commit access was invited (although not everyone joined). The GitHub organization has allowed project maintainers to act more freely without me having to step in for clerical tasks every now and then.\n I want to  reiterate my most sincere thanks to the different project maintainers along these years, who greatly improved the code, were able to create an actual community of contributors around it and who made the project immensely more popular than it was when I stepped down almost 10 years ago, serving the needs of thousands of people along the way.\n I’d like to remark one more time that the purpose of youtube-dl as a tool has barely changed along its 14 years of existence. Before and after the RIAA’s DMCA letter was received, many people have explained how they use youtube-dl with  different  goals in mind.\n For me, it has always been about offline access to videos that are already available to the general public online. In a world of mobile networks and always-on Internet connections, you may wonder if that’s really needed. It must be, I guess, if Netflix, Amazon, Disney or HBO have all implemented similar functionality in their extremely popular streaming applications. For long road trips, or trips abroad specially with kids, or underground or on an airplane, or in a place with poor connectivity or metered connections, having offline access to that review, report, podcast, lecture, piece of news or work of art is incredibly convenient.\n An additional side-effect of youtube-dl is online access when the default online interface is not up to the task. The old proprietary Flash plugin was not available for every platform and architecture, depending on what your choice was. Nowadays, web browsers can play video but may sometimes not take advantage of efficient available GPU decoding, wasting large amounts of battery power along the way. youtube-dl can be combined with a native video player to make playing some videos possible and/or efficient. For example,  mpv includes native youtube-dl support. You only need to feed it a supported video site URL and it will use youtube-dl to access the video stream and play it without storing anything in your hard drive.\n The default online interface may also lack accessibility features, may make content navigation hard for some people or lack color blind filters that, again, may be available from a native video player application.\n Last, but not least, tools like youtube-dl allow people to access online videos using only free software. I know there are not many free, libre and open source software purists out there. I don’t even consider myself one, by a long shot. Proprietary software is ever present in our modern lives and served to us every day in the form of vast amounts of Javascript code for our web browser to run, with many different and varied purposes and not always in the best interest of users.  GDPR, with all its flaws and problems, is a testament to that. Accessing online videos using youtube-dl may give you a peace of mind incognito mode, uBlock Origin or Privacy Badger can only barely grasp.", "posttime": "2020-11-11 00:49:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "youtube,dl,项目", "title": "YouTube-DL项目的由来", "title_en": "Origins of the YouTube-Dl Project", "transed": 1, "url": "https://rg3.name/202011071352.html", "via": "", "real_tags": ["youtube", "dl", "项目"]}]