[{"category": "", "categoryclass": "", "imagename": "f4fe8508b7a5913c12d82b0d96d556c2.jpg", "infoid": 1070797, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(美国有线电视新闻网) 亚马逊 (AMZN) 面临创纪录的 7.46 亿欧元（约合 8.87 亿美元）罚款，此前欧盟数据隐私监管机构表示，这家电子商务巨头在广告中违反了欧盟的标志性隐私法，即 GDPR。相关决定。罚款于 7 月 16 日实施，并于周五在一份财务文件中披露。这是该法律三年历史上规模最大的一次，其次是谷歌 2019 年的 5000 万欧元罚款。监管机构表示，亚马逊对个人数据的处理不符合 GDPR 要求，该公司承认已被勒令改变其商业惯例。亚马逊表示，监管决定“毫无根据”，并补充说它计划“在这件事上大力捍卫自己”。该公司表示：“关于我们如何向客户展示相关广告的决定取决于对欧洲隐私法的主观和未经检验的解释，拟议的罚款甚至与这种解释完全不成比例。”亚马逊的欧洲总部所在地卢森堡的数据监管机构对涉嫌违规行为进行了处罚。卢森堡数据管理局 (CNPD) 的发言人以法律程序的持续性质为由拒绝置评。罚款标志着欧洲监管机构对大型科技公司的关注的最新例证。欧洲和英国的官员越来越多地审查亚马逊、苹果 (AAPL)、Facebook (FB) 和谷歌 (GOOG) 等公司的商业行为，因为这些公司被指控损害竞争和滥用消费者隐私。 GDPR，即《通用数据保护条例》，旨在控制数字平台如何使用消费者数据并监管数据泄露。\n在给 CNN Business 的进一步声明中，亚马逊表示客户信息没有被泄露或暴露。声明说：“维护我们客户信息的安全性和他们的信任是重中之重。” “没有数据泄露，也没有客户数据暴露给任何第三方。这些事实是无可争议的。”根据欧盟的隐私法，违规行为最高可处以 2000 万欧元或公司全球收入 4% 的罚款，以较高者为准。", "note_en": "(CNN) Amazon  (  AMZN) faces a record-breaking €746 million (roughly $887 million) fine after a European Union data privacy regulator said the e-commerce giant had violated the bloc&#39;s signature privacy law, known as GDPR , in an advertising-related decision.\n The fine was imposed on July 16 and disclosed Friday in a financial filing. It is the largest in the law&#39;s three-year history, followed by Google&#39;s 2019 fine of €50 million.\n Regulators said Amazon&#39;s processing of personal data didn&#39;t comply with GDPR requirements, and the company acknowledged it has been ordered to change its business practices.\n     Amazon said the regulatory decision was &#34;without merit&#34; and added that it plans to &#34;defend ourselves vigorously in this matter.&#34;\n   &#34;The decision relating to how we show customers relevant advertising relies on subjective and untested interpretations of European privacy law, and the proposed fine is entirely out of proportion with even that interpretation,&#34; the company said.\n  The penalty for the alleged violation was imposed by data regulators in Luxembourg, where Amazon has its European headquarters. A spokesperson for the Luxembourg data authority, CNPD, declined to comment, citing the ongoing nature of the legal proceeding.\n The fine marks the latest example of European regulators zeroing in on Big Tech. Officials in Europe and the UK have increasingly been scrutinizing the business practices of companies including Amazon,  Apple  (  AAPL),  Facebook  (  FB) and  Google  (  GOOG) amid allegations they have harmed competition and abused consumer privacy. GDPR, or the General Data Protection Regulation, seeks to rein in how digital platforms use consumer data and to regulate data breaches.\n In a further statement to CNN Business, Amazon said customer information had not been leaked or exposed.\n   &#34;Maintaining the security of our customers&#39; information and their trust are top priorities,&#34; the statement said. &#34;There has been no data breach, and no customer data has been exposed to any third party. These facts are undisputed.&#34;\n Under the EU&#39;s privacy law, violations can carry penalties of up to €20 million or 4% of a company&#39;s global revenue, whichever is higher.", "posttime": "2021-07-31 12:29:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚马逊,amazon,欧盟,hit", "title": "亚马逊被欧盟罚款 8.87 亿美元", "title_en": "Amazon hit by record $887 million EU privacy fine", "transed": 1, "url": "https://edition.cnn.com/2021/07/30/tech/amazon-eu-privacy-fine/index.html", "via": "", "real_tags": ["亚马逊", "amazon", "欧盟", "hit"]}, {"category": "", "categoryclass": "", "imagename": "d5a4a9f3cebefcd8457e2217e8ed3cc8.jpg", "infoid": 1070796, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "东京——越南支付提供商 VNLife 周五表示，它已从投资者那里筹集了 2.5 亿美元，其中包括总部位于美国的 General Atlantic 和 Dragoneer Investment Group，凸显了全球对该国金融科技行业的兴趣。美国支付公司 PayPal 的风险投资部门 PayPal Ventures 和新加坡的 EDBI 以及现有投资者 GIC 和软银集团的 Vision Fund 参与了本轮融资。在接受 Zoom 采访时，董事总经理 Niraan De Silva 表示，这笔投资对公司的估值“远超过 10 亿美元”。他表示，所得款项将用于加强其金融科技业务以及在线旅游和零售软件部门。他补充说，该公司距离首次公开募股还有“几年的时间”。 VNLife 的核心金融科技子公司 VNPay 为希望提供移动支付应用程序和其他数字服务的银行提供软件。它还为零售商提供二维码支付系统，零售商可以处理来自这些银行应用程序的付款。 VNLife 表示，它与 40 多家银行合作，其支付网络拥有 2200 万用户和超过 150,000 家合作商户。 “我们将在未来 24 个月真正加速的是无现金支付和推动市场采用，因为现在还为时过早，”德席尔瓦说。措施包括向通过其二维码支付系统付款的用户提供折扣。本轮融资可能会加剧越南移动支付行业的竞争，该行业挤满了 30 多家电子钱包提供商。最大的参与者包括国内领先的 MoMo 和运营该国最受欢迎的消息应用程序的 VNG，以及区域性参与者 Grab 和 Sea。德席尔瓦将 VNLife 与 Visa 和万事达卡进行了比较，并表示它比同行更有利可图，因为它专注于向企业销售服务。他拒绝透露具体的财务数据。\n迄今为止，今年是全球金融科技初创公司融资创纪录的一年。根据 CB Insights 的数据，初创企业在第二季度筹集了 337 亿美元，比去年同期增长 191%。", "note_en": "TOKYO -- Vietnamese payments provider VNLife on Friday said it has raised $250 million from investors, including U.S.-based General Atlantic and Dragoneer Investment Group, highlighting global interest in the country&#39;s fintech industry.\n PayPal Ventures, the venture capital arm of U.S. payments company PayPal, and Singapore&#39;s EDBI participated in the funding round, along with existing investors GIC and SoftBank Group&#39;s Vision Fund.\n In an interview on Zoom, Managing Director Niraan De Silva said the investment valued the company at &#34;well over $1 billion.&#34; He said the proceeds will be used to strengthen its fintech businesses, as well as its online travel and retail software units. He added that the company is still &#34;years away&#34; from an initial public offering.\n  VNLife&#39;s core fintech subsidiary, VNPay, offers software for banks that want to provide mobile payment apps and other digital services. It also offers QR code payment systems to retailers, which can process payments from those bank apps. VNLife says it works with over 40 banks and that its payments network has 22 million users and more than 150,000 partner merchants.\n  &#34;Where we will really accelerate over the next 24 months is cashless payment and driving adoption in the market, because it&#39;s still very early,&#34; De Silva said. Measures include giving discounts to users who pay through its QR payment system.\n The funding round will likely intensify competition in Vietnam&#39;s mobile payments sector, which is crowded with more than 30 electronic wallet providers. The biggest players include domestic leader MoMo and VNG, which operates the country&#39;s most popular messaging app, as well as regional players Grab and Sea.\n De Silva compared VNLife to Visa and Mastercard and said it is more profitable than its peers because of its focus on selling services to businesses. He declined to give specific financial figures.\n This year has so far been a record year for fundraising by fintech startups globally. Startups raised $33.7 billion in the second quarter, up 191% from the same period a year ago, according to CB Insights.", "posttime": "2021-07-31 12:20:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,位于,based,支付", "title": "总部位于越南的 VNLife 是 VNPay 的母公司，该公司帮助银行提供移动支付应用程序和其他数字服务，以 1B 美元以上的估值筹集了 2.5 亿美元", "title_en": "Vietnam-based VNLife, the parent company of VNPay, which helps banks provide mobile payment apps and other digital services, raises $250M at a valuation of $1B+", "transed": 1, "url": "https://asia.nikkei.com/Business/Startups/Vietnam-s-fintech-VNLife-says-valuation-now-well-over-1bn", "via": "", "real_tags": ["程序", "位于", "based", "支付"]}, {"category": "", "categoryclass": "", "imagename": "fa2f0d4970c6c2686e2a3e4943a57234.jpg", "infoid": 1070795, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(CNN) 创造力是一种独特的人类品质，很难定义，甚至更难客观衡量。当然，这并不意味着科学家们没有尝试过，6 月份发表在 PNAS 杂志上的一项研究提出了一种新的、令人惊讶的简单测试来衡量这种能力。它只需要几分钟，涉及思考 10 个彼此无关且意义尽可能远的名词。提出这个概念并且是研究作者之一的哈佛大学博士后杰伊奥尔森说，你的分数揭示了你的创造力。 “这项任务可以客观和自动地评分，这意味着它不需要人们对回答进行主观评分，”他说。 “它的完成速度也比大多数其他创造力衡量标准要快；许多人在两分钟内完成。”该测试专门衡量创造力的一个组成部分，称为发散思维，即针对开放式问题生成不同解决方案的能力。它不衡量另一个组成部分——心理学家称之为趋同思维，或考虑各种限制来解决问题。 “该测试衡量发散性思维和口头创造力，这是整体创造力的重要但有限的方面。我们的任务不会预测您的创意烹饪技能，但会预测各种解决问题的表现，这表明它正在做更多而不是简单地测量词汇量，”奥尔森说。 “不过，我们需要未来的研究来评估我们的任务与其他语言能力或更广泛的智力之间的关系。”\n奥尔森说，虽然测试很简单，但评分更复杂，涉及计算所列单词的平均“语义距离”（或相关性）。为了计算这一点，研究人员使用了一个数据库，该数据库根据它们在数十亿个网页中的使用情况推断出数千个单词的语义距离。新测试称为发散关联任务 (DAT) 的表现与两项现有的创造力测量相关，该研究还包括来自加拿大麦吉尔大学和澳大利亚墨尔本大学的研究人员，发现：1) 替代方案使用任务，它会要求您列出常见对象（例如回形针）的新用途。评估者然后根据他们的独创性（相对于其他人的反应它们的罕见程度）或灵活性（列出了多少不同类别的用途）来判断提议的用途。 2) Bridge-the-Associative-Gap 任务，一种聚合思维测试，参与者看到两个词（例如，长颈鹿和围巾）并需要找到与这两个词都相关的第三个词（例如，脖子）。评分者然后判断所提供词的适当性。 Olson 说，DAT 的另一个好处是测试的自动性质，它不涉及任何其他人给出的主观分数，这会引入偏见。真正的创造力衡量标准还包括在音乐、作曲、发明或科学专利等创意领域的现实成就，以及基于任务的衡量标准，例如上述测试。在这项包括近 9,000 名 7 至 70 岁参与者的研究中，研究人员发现，20 多岁的参与者的得分高于其他年龄组的参与者，而女性的得分略高，但总体人口统计学差异非常小。\n“我们的研究结果表明，年龄、性别和地点并不是限制因素：几乎任何人都可以发挥创造力，”奥尔森说。 “拥有更多衡量创造力的方法意味着我们可以更好地评估促进和培养创造力的各种不同方法的成功与否。”哈佛大学心理学系教授、《成为艺术家：通过正念创造力重塑自我》一书的作者艾伦兰格说，创造力不是少数特殊人才的领域。这是每个人都能做到的，无论他们做什么。她将创造力与正念联系起来——通过在日常生活中积极注意新事物来激发我们的神经元。此外，有必要接受不确定性和并不总是有正确答案的想法，兰格说，他没有参与衡量创造力的研究。例如，她说，我们在学校被教导 1+1=2，但这个答案不适用于一堆衣物或两片口香糖。 “人们非常害怕做错事或不知道某事，但事实并非没有上下文，”兰格说。 “重要的是要认识到一切都在不断变化，”她补充道。 “我们被困在先前的理解中，这切断了创造性的能力。你需要利用不确定性的力量。”兰格说，创造力常常被视为一种最终产品——一本书、一首音乐或一件艺术品——受到批判性的评估和判断。但培养创造力的最好方法是关注过程，不要害怕不知道答案。\n“创造力是产生新奇的东西。当你保持专注时，你就会产生对你来说新奇的东西。”", "note_en": "(CNN)Creativity is a uniquely human quality that&#39;s difficult to define and, perhaps, even harder to objectively measure.\n Of course, that doesn&#39;t mean that scientists haven&#39;t tried, and a study published in June  in the journal PNAS proposes a new and surprisingly simple test to gauge this ability.\n It only takes a few minutes and involves thinking of 10 nouns that are unrelated to one another and as far apart in meaning as possible. Your score reveals how creative you are, said Jay Olson, a postdoctoral fellow at Harvard University, who came up with the concept and is one of the study authors.\n     &#34;The task can be objectively and automatically scored, meaning that it does not need people to subjectively score the responses,&#34; he said.  &#34;It is also faster to complete than most other creativity measures; many people complete it in under two minutes.&#34;\n     The test specifically measures one component of creativity called divergent thinking, which is the ability to generate diverse solutions to open-ended problems. It doesn&#39;t measure another component -- what psychologists call convergent thinking, or solving problems  considering various constraints.\n &#34;The test measures divergent thinking and verbal creativity, which are important but limited aspects of overall creativity. Our task won&#39;t predict your creative culinary skills, but it will predict performance on various types of problem-solving, which suggests it is doing more than simply measuring vocabulary,&#34; Olson said.\n &#34;Still, we&#39;ll need future research to assess how our task relates to other verbal abilities or intelligence more broadly.&#34;\n While the test is simple, the scoring is more complex  and involves computing the average &#34;semantic distance&#34; (or relatedness) of the listed words, Olson said. To calculate this, the researchers used a database that infers the semantic distances of thousands of words based on their usage across billions of webpages.\n  Performance on the Divergent Association Task (DAT), as the new test is called, correlated with two existing measures of creativity  the study,  which also included researchers from McGill University in Canada and the University of Melbourne in Australia, found:\n 1) The Alternative Uses Task, which asks you to list novel uses of a common object -- such as a paper clip. Raters then judge the proposed uses based on their originality (how rare they are relative to other people&#39;s responses) or flexibility (how many different categories of uses are listed).\n  2) The Bridge-the-Associative-Gap Task, a test of convergent thinking in which participants see two words (e.g., giraffe and scarf) and need to find a third one that relates to both (e.g., neck). Raters then judged the appropriateness of the provided words.\n Another benefit of DAT, Olson said, is the automatic nature of the test, which doesn&#39;t involve any other people giving a subjective score, which can introduce bias.\n A true measure of creativity would also include real-world achievements in creative fields like music, compositions, inventions or scientific patents, as well as task-based measures, such as  the tests mentioned above.\n In the study, which included nearly 9,000 participants ages 7 to 70, the researchers found that scores were higher for participants  in their 20s than those in other age groups and slightly higher for women, but overall demographic differences in performance were very small.\n &#34;Our results suggest that age, gender and location are not limiting factors: Almost anyone can be creative,&#34; Olson said. &#34;Having more methods to measure creativity means that we can better assess the success of various different methods to promote and nurture creativity.&#34;\n   Ellen Langer, a professor in the Department of Psychology at Harvard University and author of &#34;On Becoming an Artist: Reinventing Yourself Through Mindful Creativity,&#34; said that creativity isn&#39;t the realm of a few special, talented people. It&#39;s something everyone is capable of, no matter what they do.\n  She links creativity with mindfulness -- firing up our neurons by actively noticing new things as we go about our daily routines. Plus, it&#39;s necessary to embrace uncertainty and the idea that there is not always a correct answer, said Langer, who wasn&#39;t involved  in the research on measuring creativity.\n For example, she said, we&#39;re taught in school that 1+1=2, but that answer doesn&#39;t apply to a pile of laundry or two pieces of chewing gum.\n &#34;People are very afraid of doing the wrong thing or of not knowing something but facts aren&#39;t context free,&#34; Langer said.\n &#34;It&#39;s important to recognize that everything is always changing,&#34; she added. &#34;We get trapped in prior understandings, and this cuts off the ability to be creative. You need to exploit the power of uncertainty.&#34;\n   Too often, Langer said, creativity is viewed as an end product -- a book, a piece of music or a work of art -- that is critically evaluated and judged. But the best way to foster creativity is to pay attention to the process and not be afraid  of not knowing the answer.\n &#34;Creativity is the production of something novel. When you&#39;re being mindful, you produce something that is novel for you.&#34;", "posttime": "2021-07-31 12:19:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,测试,word,创造力", "title": "科学家说，简单的单词测试揭示了你的创造力", "title_en": "Simple word test reveals how creative you are, scientists say", "transed": 1, "url": "https://edition.cnn.com/2021/07/14/health/words-creativity-test-scn-wellness/index.html", "via": "", "real_tags": ["科学家", "测试", "word", "创造力"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070794, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尤里卡！一个由数十名科学家组成的研究团队与谷歌的量子计算实验室合作，可能已经在量子计算机中创造了世界上第一个时间晶体。这是一种让我想跳起来跳快乐舞的消息。这些科学家可能已经产生了一个全新的物质阶段。我将尽力解释这意味着什么，以及为什么我个人认为这是我们一生中最重要的科学突破。但是，为了清楚起见，我首先需要说明两点：Google 团队可能已经创建了时间晶体。这是预印本研究，尚未接受完整的同行评审。在其他科学界有时间审查和复制这项工作之前，我们不能肯定地说它是合法的。时间晶体是物质的新相。为简单起见，让我们想象一个冰块。当您将一块冰块放入一杯水中时，您将在两个不同温度下相互引入两个独立的实体（冰块和液态水）。\n每个人都知道水会变冷（这就是我们将冰放在那里的原因），随着时间的推移，冰会变暖并变成水。最终，您将只喝一杯室温水。大多数人都熟悉牛顿第一运动定律，它说“静止的物体趋于静止，运动的物体趋于运动”。这个物理定律的一个重要副作用是，它意味着永动机在经典上是不可能的。根据经典物理学，宇宙总是朝着熵的方向运动。换句话说：如果我们将一块冰块和一杯常温的水与所有其他外力隔离开来，水总是会融化冰块。如果没有过程，任何系统的熵（朝向变化的运动）将始终保持不变，如果有过程，它总是会增加。由于我们的宇宙有恒星爆炸、黑洞吸吮、人们着火——化学过程——熵总是在增加。除了时间晶体。时间晶体不在乎牛顿或其他任何人的想法。他们是违法者和心悦诚服的人。从理论上讲，即使在过程中使用它们，它们也可以保持熵。\n想想你熟悉的水晶，比如雪花。雪花不仅美丽，因为每一个都是独一无二的，它们也是迷人的形态，几乎打破了物理定律本身。晶体结构在物理世界中形成，因为无论出于何种基本科学原因，其中的原子“想要”存在于某些确切的点上。当我们谈论原子时，“想要”是一个非常奇怪的词——我当然不是在暗示它们是有知觉的——但很难用“为什么”这样的抽象来描述晶体结构的趋势。时间晶体是物质的一个新阶段，简化后就像雪花在两种不同的配置之间不断来回循环。前一刻是七角格子，下一刻是十角格子，或者其他什么。时间晶体的惊人之处在于，当它们在两种不同的配置之间来回循环时，它们不会损失或使用任何能量。时间晶体可以在能量过程中幸存下来，而不会成为熵的牺牲品。他们被称为时间水晶的原因是因为他们可以吃蛋糕也可以吃。他们可以处于吃掉整个蛋糕的状态，然后又回到仍然吃蛋糕的状态——理论上，他们可以永远这样做。\n最重要的是，他们可以在一个孤立的系统内完成这项工作。这意味着他们可以吃掉蛋糕，然后神奇地让它一次又一次地永远重新出现，而无需使用任何燃料或能量。从字面上看，每个人都应该关心。正如我在 2018 年写的那样，时间晶体可能是量子计算的奇迹。几乎每个人类可以想象的未来科技，从隐形传送到曲速驱动器，从人工食物合成器到能够在不燃烧燃料或利用能源的情况下为世界供电的永动机，都需要量子计算系统。量子计算机可以解决非常困难的问题。不幸的是，它们很脆弱。构建它们很难，很难维护它们，很难让它们做任何事情，更难解释它们给出的结果。这是因为一种叫做“退相干”的东西，它的工作原理很像熵。量子世界中的计算机位，量子位，具有量子力学的一个时髦特征，这使得它们在被观察时的行为与单独存在时的行为不同。这使得对量子位状态的任何直接测量（读取计算机的输出）变得困难。但时间晶体想要保持一致。因此，将它们放入量子计算机中，并使用它们进行计算机处理，可能会起到非常重要的作用：确保量子相干性。不，不，不，不，不，不。不要误会我的意思。这是婴儿的步骤。这是初级研究。这是安东尼范列文虎克成为第一个使用显微镜在放大镜下观察一滴水的人。\n谷歌所做的可能是证明人类可以制造时间晶体。用研究人员自己的话来说：这些结果建立了一种可扩展的方法来研究当前量子处理器上物质的非平衡相。基本上他们相信他们已经证明了这个概念，所以现在是时候看看可以用它做什么了。时间晶体一直是理论上的。 “总是”，我的意思是：自 2012 年首次假设它们以来。如果谷歌真的创造了时间晶体，它可以将量子计算突破的时间表从“可能永远不会”加速到“可能在几十年内”。在牵强的、超级乐观的事情结束时——我们可以看到在我们的有生之年创建一个工作的曲速引擎。想象一下，去火星或太阳系边缘旅行，然后及时回到地球上的家，看晚间新闻。而且，即使在保守的一端有着更现实的期望，也不难想象基于量子计算的化学和药物发现会导致普遍有效的癌症治疗。\n这可能是我们一直在等待的大尤里卡。我迫不及待地想看看同行评审会发生什么。如果你想了解更多，你可以在这里阅读谷歌的论文。如果您正在寻找对研究人员在实验室完成的科学细节的技术深入研究，那么 Natalie Wolchover 在 Quanta 杂志上的这篇文章就是蜜蜂的膝盖。", "note_en": "Eureka! A research team featuring dozens of scientists working in partnership with Google‘s quantum computing labs  may  have created the world’s first time crystal inside a quantum computer.\n This is  the kind of news that makes me want to jump up and do a  happy dance.\n These scientists  may have produced an entirely new phase of matter. I’m going to do my best to explain what that means and why I personally believe this is the most important scientific breakthrough in our lifetimes.\n  However, for the sake of clarity, there’s two points I need to make first:\n The Google team  might have created time crystals. This is pre-print research and has yet to receive full peer-review. Until the rest of the scientific community has time to review and replicate the work, we can’t say for sure it’s legitimate.\n   Time crystals are a new phase of matter. For the sake of simplicity, let’s imagine a cube of ice.\n When you put a cube of ice in glass of water, you’re introducing two separate entities (the ice cube and the liquid water) to each other at two different temperatures.\n Everyone knows that the water will get colder (that’s why we put the ice in there) and, over time, the ice will get warmer and turn into water. Eventually you’ll just have a glass of room-temperature water.\n  Most people are familiar with  Newton’s first law of motion, it’s the one that says “an object at rest tends to stay at rest and an object in motion tends to stay in motion.”\n An important side-effect of this law of physics is that it means a perpetual motion machine is classically impossible.\n According to classical physics, the universe is always  moving towards entropy. In other words: if we isolate an ice cube and a room-temperature glass of water from all other external forces, the water will always melt the ice cube.\n The entropy (the movement towards change) of any system will always remain the same if there are no processes, and it will always increase if there are processes.\n Since our universe has stars exploding, black holes sucking, and people lighting things on fire – chemical processes – entropy is always increasing.\n Except when it comes to time crystals. Time crystals don’t give a damn what Newton or anyone else thinks. They’re lawbreakers and heart takers. They can, theoretically, maintain entropy even when they’re used in a process.\n  Think about a crystal you’re familiar with, such as a snowflake. Snowflakes aren’t just beautiful because each one is unique, they’re also fascinating formations that nearly break the laws of physics themselves.\n Crystalline structures form in the physical world because, for whatever fundamental scientific reason, the atoms within them “want” to exist in certain exact points.\n “Want” is a really weird word to use when we’re talking about atoms – I’m certainly not implying they’re sentient – but it’s hard describe the tendency toward crystalline structures in abstracts such as “why.”\n A time crystal is a new phase of matter that, simplified, would be like having a snowflake that constantly cycled back and forth between two different configurations. It’s a seven-pointed lattice one moment and a ten-pointed lattice the next, or whatever.\n What’s amazing about time crystals is that when they cycle back and forth between two different configurations,  they don’t lose or use any energy.\n Time crystals can survive energy processes without falling victim to entropy. The reason they’re called time crystals is because they can have their cake and eat it too.\n They can be in a state of  having eaten the whole cake, and then cycle right back to a state of  still having the cake – and they can, theoretically, do this forever and ever.\n Most importantly, they can do this inside of an isolated system. That means they can consume the cake and then magically make it reappear over and over again forever, without using any fuel or energy.\n  Literally everyone should care. As I wrote back in 2018,  time crystals could be the miracle quantum computing needs.\n Nearly every far-future tech humans can imagine, from teleportation to warp drives and from artificial food synthesizers to perpetual motion reactors capable of powering the world without burning fuels or harnessing energy, will require quantum computing systems.\n Quantum computers can solve really hard problems. Unfortunately, they’re brittle. It’s hard to build them, hard to maintain them, hard to get them to do anything, and even harder to interpret the results they give. This is because of something called “decoherence,” which works a lot like entropy.\n Computer bits in the quantum world, qubits, share a funky feature of quantum mechanics that makes them act differently when observed than when they’re left alone. That sort of makes any direct measurements of qubit states (reading the computer’s output) difficult.\n But time crystals  want to be coherent. So putting them inside a quantum computer, and using them to conduct computer processes could potentially serve an incredibly important function: ensuring quantum coherence.\n  No. No, no, no, no no. Don’t get me wrong. This is baby steps. This is infancy research. This is Antony van Leeuwenhoek becoming the first person to use a microscope to look at a drop of water under magnification.\n What Google‘s done, potentially, is prove that humans can manufacture time crystals. In the words of the researchers themselves:\n These results establish a scalable approach to study non-equilibrium phases of matter on current quantum processors.\n Basically they believe they’ve proven the concept, so now it’s time to see what can be done with it.\n  Time crystals have always been theoretical. And by “always,” I mean: since 2012 when they were first hypothesized.\n If Google‘s actually created time-crystals, it could accelerate the timeline for quantum computing breakthroughs from “maybe never” to “maybe within a few decades.”\n At the far-fetched, super-optimistic end of things – we could see the creation of  a working warp drive in our lifetimes. Imagine taking a trip to Mars or the edge of our solar system, and being back home on Earth in time to catch the evening news.\n And, even on the conservative end with more realistic expectations, it’s not hard to imagine  quantum computing-based chemical and drug discovery leading to universally-effective cancer treatments.\n This could be the big eureka we’ve all been waiting for. I can’t wait to see what happens in peer-review.\n If you want to know more, you can read  Google’s paper here. And if you’re looking for a technical deep-dive into the scientific specifics of what the researchers accomplished in the lab,  this piece on Quanta Magazine by Natalie Wolchover is the bee’s knees.", "posttime": "2021-07-31 12:16:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,量子,created", "title": "谷歌在量子计算机中创造了世界上第一个时间晶体", "title_en": "Google created the world’s first time crystal inside a quantum computer", "transed": 1, "url": "https://thenextweb.com/news/google-may-have-achieved-breakthrough-time-crystals", "via": "", "real_tags": ["google", "谷歌", "量子", "created"]}, {"category": "", "categoryclass": "", "imagename": "35d0ad37cfe28fbf5618c11aafe3c590.jpeg", "infoid": 1070793, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿（美联社）——美国司法部周五表示，去年，大规模 SolarWinds 网络间谍活动背后的俄罗斯黑客闯入了全国一些最著名的联邦检察官办公室的电子邮件帐户。该部门表示，纽约四家美国律师事务所员工使用的微软电子邮件帐户中有 80% 被泄露。总而言之，司法部表示，在黑客攻击活动期间，27 个美国检察官办公室至少有一名员工的电子邮件帐户遭到入侵。司法部在一份声明中表示，它认为这些账户在 2020 年 5 月 7 日至 12 月 27 日期间遭到入侵。这样的时间框架值得注意，因为 SolarWinds 活动渗透了数十家私营部门公司和智囊团以及至少9 家美国政府机构，于 12 月中旬首次被发现并公布。拜登政府 4 月宣布制裁，包括驱逐俄罗斯外交官，以应对 SolarWinds 黑客攻击和俄罗斯干预 2020 年美国总统大选。俄罗斯否认有不当行为。哥伦比亚法学院讲师詹妮弗·罗杰斯 (Jennifer Rodgers) 表示，她在纽约担任联邦检察官时，办公室电子邮件经常包含各种敏感信息，包括案件策略讨论和机密线人的姓名。 “我不记得有人因为安全问题给我带来文件而不是通过电子邮件发送给我，”她说，并指出机密材料的例外情况。美国法院行政办公室在 1 月份证实，它也遭到破坏，这为 SolarWinds 黑客提供了另一个切入点来窃取商业机密、间谍目标、举报人报告和逮捕令等机密信息。\n受影响的办公室名单包括洛杉矶、迈阿密、华盛顿和弗吉尼亚东区等几个大型且备受瞩目的办公室。纽约南区和东区有大量工作人员被击中，处理该国一些最著名的检察官。 “纽约是世界金融中心，这些地区以调查和起诉白领犯罪和其他案件而闻名，包括调查与前总统关系密切的人，”福特汉姆法学院教授布鲁斯格林说。曾任南区检控官。该部门表示，已通知所有受害者，并正在努力减轻黑客攻击造成的“运营、安全和隐私风险”。司法部在 1 月份表示，没有迹象表明任何机密系统受到影响。司法部没有提供关于所获取的信息类型以及此类黑客攻击可能对正在进行的案件产生什么影响的更多细节。国会议员对拜登政府没有分享有关 SolarWinds 活动影响的更多信息表示失望。美联社此前曾报道称，SolarWinds 黑客获得了时任国土安全部部长查德沃尔夫和该部门网络安全人员的电子邮件帐户的访问权限，他们的工作包括来自外国的狩猎威胁。", "note_en": "WASHINGTON (AP) — The Russian hackers behind the massive SolarWinds cyberespionage campaign broke into the email accounts of some of the most prominent federal prosecutors’ offices around the country last year, the Justice Department said Friday.\n The department said 80% of Microsoft email accounts used by employees in the four U.S. attorney offices in New York were breached. All told, the Justice Department said 27 U.S. Attorney offices had at least one employee’s email account compromised during the hacking campaign.\n The Justice Department said in a statement that it believes the accounts were compromised from May 7 to Dec. 27, 2020. Such a timeframe is notable because the SolarWinds campaign, which infiltrated dozens of private-sector companies and think tanks as well as at least nine U.S. government agencies, was first discovered and publicized in mid-December.\n  The Biden administration in April announced  sanctions, including the expulsion of Russian diplomats, in response to the SolarWinds hack and Russian interference in the 2020 U.S. presidential election. Russia has denied wrongdoing.\n Jennifer Rodgers, a lecturer at Columbia Law School, said office emails frequently contained all sorts of sensitive information, including case strategy discussions and names of confidential informants, when she was a federal prosecutor in New York.\n “I don’t remember ever having someone bring me a document instead of emailing it to me because of security concerns,” she said, noting exceptions for classified materials.\n The Administrative Office of U.S. Courts  confirmed in January that it was also breached, giving the SolarWinds hackers another entry point to steal confidential information like trade secrets, espionage targets, whistleblower reports and arrest warrants.\n The list of affected offices include several large and high-profile ones like those in Los Angeles, Miami, Washington and the Eastern District of Virginia.\n The Southern and Eastern Districts of New York, where large numbers of staff were hit, handle some of the most prominent prosecutors in the country.\n “New York is the financial center of the world and those districts are particularly well known for investigating and prosecuting white-collar crimes and other cases, including investigating people close to the former president,” said Bruce Green, a professor at Fordham Law School and a former prosecutor in the Southern District.\n The department said all victims had been notified and it is working to mitigate “operational, security and privacy risks” caused by the hack. The Justice Department said in January that it had no indication that any classified systems were impacted.\n  The Justice Department did not provide additional detail about what kind of information was taken and what impact such a hack may have on ongoing cases. Members of Congress have  expressed frustration with the Biden administration for not sharing more information about the impact of the SolarWinds campaign.\n The Associated Press previously reported that SolarWinds hackers had gained access to email accounts belonging to the  then-acting Homeland Security Secretary Chad Wolf and members of the department’s cybersecurity staff whose jobs included hunting threats from foreign countries.", "posttime": "2021-07-31 11:31:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,黑客,2020,美国,俄罗斯", "title": "美国司法部表示，2020 年 5 月 7 日至 12 月 27 日期间，27 个美国检察官办公室至少有一名员工的 Microsoft 电子邮件帐户遭到俄罗斯黑客入侵", "title_en": "The Justice Department says 27 US Attorney offices had at least one employee's Microsoft email account breached by Russian hackers from May 7 to Dec. 27, 2020", "transed": 1, "url": "https://apnews.com/article/technology-europe-russia-election-2020-5486323e455277b39cd3283d70a7fd64", "via": "", "real_tags": ["microsoft", "黑客", "2020", "美国", "俄罗斯"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070792, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随处快速搜索输入单词/短语/DOI/ISBN/关键字/作者/等", "note_en": "Quick Search anywhere Enter words / phrases / DOI / ISBN / keywords / authors / etc", "posttime": "2021-07-31 11:31:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "创业,破坏性,destructive,输入", "title": "创业的黑暗和破坏性缺点", "title_en": "The Dark and Destructive Downsides of Entrepreneurship", "transed": 1, "url": "https://journals.aom.org/doi/full/10.5465/amd.2018.0194.summary", "via": "", "real_tags": ["创业", "破坏性", "输入"]}, {"category": "", "categoryclass": "", "imagename": "ec82f17a122a1034c1393ee6ae804ccf.jpg", "infoid": 1070791, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "巴育总理已下令互联网服务提供商立即阻止任何传播可能吓到人们的信息的人访问互联网。该命令是根据紧急情况法令发布的，于周四晚上在皇家公报上公布，并于周五生效。它禁止任何人“报道新闻、传播可能使人民感到恐惧或故意歪曲信息，造成对紧急情况的误解，最终可能影响国家安全、秩序和人民良好道德的新闻”。根据该命令，国家广播和电信委员会 (NBTC) 应通知互联网服务提供商检查此类信息来自哪个 IP 地址。之后，ISP 将通知 NBTC 并阻止有关 IP 地址的互联网访问。早前，学者们批评了授予 Chan-o-cha 将军发布此类命令的权力的公告。他们认为，任何人都不应因分享真实信息而受到起诉，即使这些信息令人恐惧。在正常渠道下，当局，主要是数字经济与社会部，要求法院禁止涉嫌违法的内容。法院裁定准许的，应当要求承载内容的平台经营者遵守。新命令通过要求 ISP 在采取法律行动之前立即阻止内容来加快审查过程。\n然而，目前还不清楚当局如何实现这一点，因为大多数家庭用户在每次打开路由器或使用互联网一段时间后都会被分配不同的 IP 地址或动态 IP，只有 ISP 知道。因此，阻止一个 IP 地址并不意味着用户将无法使用另一个 IP。他只能通过完全暂停他的互联网帐户来阻止他。此外，虚拟专用网（VPN）服务始终可以用来屏蔽用户的 IP 地址。", "note_en": "Prime Minister Prayut Chan-o-cha has ordered internet service providers to immediately block the internet access of anyone who propagates information that may frighten people.\n The order, issued under the emergency situation decree, was published in the Royal Gazette on Thursday night and takes effect on Friday.\n It prohibits anyone from “reporting news or disseminating information that may frighten people or intentionally distorting information to cause a misunderstanding about the emergency situation, which may eventually affect state security, order or good morality of the people.”.\n Under the order, the National Broadcasting and Telecommunications Commission (NBTC) shall notify internet service providers to check from which IP address such information has come. After that, the ISPs are to notify the NBTC and block internet access of the IP address in question.\n    Academics earlier criticised the announcement that gives Gen Chan-o-cha the power to issue such an order. They argued no one should be prosecuted for sharing truthful information, even when it is frightening.\n Under normal channels, authorities, mainly the Ministry of Digital Economy and Society, ask the court to ban content suspected to be illegal. If the court approves by issuing an order, the operator of the platform hosting the content shall be asked to comply.\n The new order speeds up the process of censoring by requiring the ISPs to block the content immediately before legal action is taken.\n However, it is unclear how authorities can achieve this since most home users are assigned different IP addresses, or dynamic IPs, each time he turns on a router or after using the internet for a predefined period of time, known only to the ISPs.\n Blocking one IP address, therefore, does not mean a user won’t be able to use another IP. He could be stopped only by having his internet account suspended altogether. Besides, a virtual private network (VPN) service can always be used to mask the IP address of a user.", "posttime": "2021-07-31 11:31:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "总理,pm,互联网", "title": "泰国总理下令禁止任何传播可能吓到人们的信息的人上网", "title_en": "Thai PM Orders Internet Block for Anyone Spreading Info That May Frighten People", "transed": 1, "url": "https://chiangmaione.com/featured/pm-orders-internet-blocked-for-anyone-spreading-info-that-might-frighten-people", "via": "", "real_tags": ["总理", "pm", "互联网"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070789, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Fly 通过获取 Docker 映像并将它们转换为 Firecracker 微型虚拟机，在我们遍布全球的硬件上运行，从而在用户附近运行应用程序（和数据库）。您应该立即尝试部署 Elixir 应用程序：只需几分钟。作为开发人员，您的经理是否曾经来问过这样的问题：“我们赚了多少钱？”如果您是一家全球保险公司的业务线开发人员，您会使用方便且昂贵的商业智能 (BI) 套件来回答这个问题。但你不是，那么你是如何为他们回答的？显然，你会做我们都做的事情。您可以通过 SSH 连接到您的服务器，启动 Elixir iex 会话或 Rails 控制台，然后运行一些脚本来查询数据、求和并得出答案。它可能看起来不是超级复杂，但它解决了业务需求。对于此类问题，Livebook 可以成为 Elixir 开发人员更好的 BI 工具。商业智能 (BI) 包括用于对商业信息进行数据分析的策略和技术。从 Gartner 的话说，这意味着您运行的任何工具都是 BI 工具。在我工作的最后一家自助创业公司中，管理层经常向后端开发人员询问业务数字。这是简单的东西，例如：\n尽管这些事情看起来很简单，但对于那些以业务为中心的领导者来说，理解并做出更好的决策非常重要。这就是为什么全球保险公司的应用程序过于复杂而无法启动 Rails 控制台，因此在 BI 套件上花费了六位数。我们是如何得到这些答案的？使用我们的 Elixir iex，或交互式 shell。我们运行了一些脚本，并为他们提供了 CSV 友好的行，他们可以添加到他们的电子表格中。在早期的启动阶段，我们使用 iex 作为我们的 BI 工具。在此之前的启动中，我们做了同样的事情，但使用的是 Rails 控制台。如果您正在使用 Rails 控制台、Elixir 的 iex 或其他 REPL 来检查您的数据，那么这就是您现在的 BI 工具。但是有了 Elixir，我们可以做得更好。 Livebook 也为您提供数据、图表和图形，但由于它正在执行您的 Elixir 代码，因此它还可以调用您的其他集成并引入更多。要了解为什么 Livebook 可以成为更好的工具，让我们更深入地讨论一般的 BI 工具，而不仅仅是您的 REPL。我们在这篇文章中的前提是，我们可以通过 Elixir 和 Livebook 为“严肃”的 BI 工具提供资金。让我们看看我们要反对什么。公司每年在其 BI 工具上花费大量资金。你听到了一些数字，看起来像香蕉。但这是因为它们增加了很多价值。发现数据和客户行为的趋势可以决定公司的成败。大多数 BIS 工具都是商业工具。但是有一些可信的开源项目。例如，Metabase 是一种运行良好的开源 BI 工具。它直接连接到应用程序的数据库并帮助您进行一些探索、聚合和闪亮的绘图。您甚至可以创建和共享自定义仪表板。把它想象成 Grafana，但对于 MBA 来说，它是一个很好的工具。", "note_en": "Fly runs apps (and databases) close to users, by taking Docker images and transmogrifying them into Firecracker micro-vms, running on our hardware around the world. You should try deploying an Elixir app, right now:  it only takes a few minutes.\n As a developer, has your manager ever come and asked a question like, &#34;How much money are we making?&#34; If you were a line-of-business developer at a global insurance company, you&#39;d reach for your handy, nosebleed-expensive Business Intelligence (BI) suite to answer this question. But you&#39;re not, so how did you answer it for them?\n  Obviously, you&#39;d do what we all do. You&#39;d SSH into your server, start an Elixir  iex session or a Rails console, then run some scripts to query data, sum numbers, and come up with answers.\n    It may not seem super sophisticated, but it solves the business need. And for problems like this, Livebook can be a better BI tool for Elixir developers.\n     Business intelligence (BI) comprises the strategies and technologies used ... for the data analysis of business information.\n  Translated from Gartner-speak, that means any tools you run to get a picture of how the business is doing are BI tools.\n  In the last bootstrapped startup I worked at, management routinely asked backend developers for business numbers. It was simple stuff, like:\n    As simple as this stuff seems, it&#39;s really important for those business focused leaders to understand and make better decisions. That&#39;s why global insurance companies with applications that are too complicated to bring up a Rails console on spend six figures on BI suites.\n  How did we get those answers? Using our Elixir  iex, or interactive shell. We ran some scripts and gave them CSV friendly rows they could add to their spreadsheets. In that early stage startup, we were using  iex as our BI tool. At a startup before that, we did the same thing but using the Rails console.\n  If you&#39;re using the Rails console, Elixir&#39;s  iex, or another REPL to examine your data, then that&#39;s your BI tool for now. But with Elixir, we can do better. Livebook gives you data, charts and graphs too, but because it&#39;s executing your Elixir code, it can also call out to your other integrations and pull in even more.\n  To understand why Livebook can be a better tool, let&#39;s go further and talk about BI tools in general, not just your REPL.\n   Our premise in this post is that we can give &#34;serious&#34; BI tools a run for their money with Elixir and Livebook. Let&#39;s see what we&#39;re up against.\n  Companies spend lots of money every year on their BI tools. You hear some of the numbers and it seems bananas. But it&#39;s because they  add a lot of value. Spotting trends in your data and customer behavior can make the difference of success and failure for a company.\n  Most BIS tools are commercial. But there&#39;s a handful of credible open source projects.  Metabase, for example, is an open source BI tool that works quite well. It connects directly to an application&#39;s database and helps you do some spelunking, aggregation, and shiny graphing. You can even create and share custom dashboards. Think of it as Grafana, but for MBAs – it&#39;s a great tool.", "posttime": "2021-07-31 11:30:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "商业,livebook,intelligence,elixir", "title": "使用 Livebook 在 Elixir 中实现更好的商业智能", "title_en": "Better Business Intelligence in Elixir with Livebook", "transed": 1, "url": "https://fly.io/blog/better-business-intelligence-in-elixir-with-livebook/", "via": "", "real_tags": ["商业", "livebook", "elixir"]}, {"category": "", "categoryclass": "", "imagename": "7e5edb8d6bfa5e183b01fbdc4b65e21a.jpg", "infoid": 1070787, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "他们是法属圭亚那的金矿工人、科德角的狂欢者和印度的卫生保健工作者。尽管他们居住在不同的世界，但他们最终有两个共同点。所有人都接种了 COVID-19 疫苗。他们都成为感染群的一部分。最近几周，此类案例证明，即使在几乎每个人都接种了疫苗的群体中，covid-19 传播链和超级传播事件也可能发生，这在卫生官员中引发了警报，并破坏了美国迅速恢复正常业务的希望。 2021 年 5 月，疾病预防控制中心曾告诉已接种疫苗的美国人，他们可以不戴口罩，但周二该机构改变了方向，称接种疫苗的人应该在室内公共场所戴口罩。原因是调查人员从马萨诸塞州普罗温斯敦爆发的疫情中了解到，科德角的一个海滨小镇在 7 月初举办了一场喧闹的游行和数周拥挤的泳池派对。卫生调查人员说，从那时起，已有 800 多例与这些事件有关的 covid-19 病例，其中 74% 是接种了疫苗的人。普罗温斯敦爆发是由所谓的三角洲变异引起的，现在美国的大多数病例都是这种变异。在今天发布的一份声明中，CDC 负责人罗谢尔·瓦伦斯基 (Rochelle Walensky) 表示，“关键发现”是普罗温斯敦感染了三角洲病毒的接种者似乎与未接种疫苗的人一样多。 “高病毒载量表明传播风险增加，并引发了人们的担忧，即与其他变种不同，接种了 delta 疫苗的人可以传播病毒，”她说。该建议建议迅速恢复到分层的对策方法，包括戴口罩和保持社交距离，这也可能使美国下个月开始的学校重新开放复杂化。\n数周以来，世界各地的调查一直在建立疫苗接种者爆发疫情的证据。例如，巴黎和法属圭亚那的一个科学团队最近描述了 5 月份 covid-19 如何撕裂南美金矿，尽管几乎所有矿工都接种了辉瑞的疫苗。尽管接种了疫苗，但仍有 60% 的人感染了一种叫做 gamma 的变种。这让科学家们感到非常惊讶，以至于他们检查了疫苗是否在运输过程中被损坏，但他们没有。辉瑞（Pfizer）疫苗（在美国最广泛使用）的初步研究表明，它在预防有症状的疾病方面的有效性超过 90%。但这不是在金矿工身上看到的。一半最终出现发烧等症状。不过，疫苗可能仍然有帮助。尽管大多数矿工都超过 50 岁，并且有些人有高血压和糖尿病等危险因素，但这些矿工都没有染上重病。更多证据来自印度，从 2021 年初开始，那里的卫生保健工作者有资格接种阿斯利康疫苗。但是，当来自英国和印度的一个团队对这些工作者的 covid-19 病例进行研究时，他们发现“大量疫苗突破性感染”在德里的三家医院，包括一次感染了 30 人的超级传播事件。他们说，与任何较旧的菌株相比，突破性感染更有可能由 delta 变体引起。较旧的变体永远无法在卫生保健工作者中引起两个以上的关联病例。但是研究人员发现了 10 次三角洲爆发就是这样做的。 delta 变体不同的原因是它更容易传输；研究人员说，一个原因是该菌株可能正在“逃避”先前的免疫力。这可以帮助解释接种疫苗的人群中的爆发，这也意味着如果你已经感染了 covid-19，你可以更容易地再次感染它。英印团队估计，当人们接触三角洲时，抵御感染的自然保护能力下降了一半。在美国，普罗温斯敦疫情可能在 7 月 4 日“独立周”期间爆发，当时该镇接待了数千名游客。随着 7 月的过去，调查人员了解到数百个 covid-19 病例，波士顿的测序实验室确定它们是由 delta 引起的。\n据华盛顿邮报报道，普罗温斯敦的爆发给 CDC 敲响了警钟，因为疫苗似乎并不能阻止病毒在人与人之间传播，尽管大多数人都接种了疫苗。像水痘一样具有传染性。另一个关键线索来自对普罗温斯敦集群中大约 200 人进行的 PCR 测试。研究人员发现，无论人们是否接种疫苗，呼吸道中的病毒数量——以及该人每次咳嗽和打喷嚏时可能发射到这个词中的病毒量——大致相同。加州大学旧金山分校的传染病研究员莫妮卡甘地说，这并不能证明接种疫苗的人传播得同样多。她说，PCR 测试可以检测病毒片段和活细菌，因此接种疫苗的人可能会排出更少的活病毒或传染时间更短。甘地补充说，即使存在变异，但迄今为止，疫苗在预防大多数重大疾病方面仍然有效。尽管如此，“我们看到了更多轻度、有症状的病例，”她说，以及疫苗接种者之间的传播。对于疾控中心来说，新信息带来了一个难以沟通的问题：如何告诉所有人疫苗派对可能已经结束。今年 5 月，它曾表示，在大多数情况下，完全接种疫苗的美国人可以不用戴口罩和保持社交距离。但到 7 月 25 日，普罗温斯敦的地方官员重新为该镇引入了室内戴口罩的规定，覆盖室内餐厅、办公室、酒吧和舞池，并表示他们将开始测试废水。两天后，疾控中心也效仿，建议在高传播地区，每个人在室内公共场所都戴上口罩。由于 delta 变体，美国的大部分地区可能很快就会成为高风险地区。自 6 月份的低点以来，covid-19 病例增加了六倍多。", "note_en": "They were gold miners in French Guiana, revelers in Cape Cod, and Indian health-care workers. Even though they inhabit worlds apart, they ended up having two things in common. All were vaccinated against covid-19. And they all became part of infection clusters.\n  In recent weeks, cases like these are proving that covid-19 transmission chains and superspreading events can occur even in  groups where nearly everyone is vaccinated, setting off alarms among health officials and torpedoing hopes of a quick return to business as usual in the US.\n  In May 2021, the CDC had told vaccinated Americans they could safety go unmasked, but on Tuesday the agency reversed course, saying  vaccinated people should wear masks in indoor public settings.\n  The reason was what investigators learned from an outbreak in Provincetown, Massachusetts, a seaside town on Cape Cod, which in early July hosted a rowdy parade and crowded weeks of pool parties. Since then, health investigators say, there have been more than 800 cases of covid-19 linked to those events, 74% of which are in people who were vaccinated.\n  The Provincetown outbreak was caused by the so-called delta variant, which now accounts for most cases in the US.  In  a statement released today, Rochelle Walensky, head of the CDC, said the “pivotal discovery” was that vaccinated people infected with delta in Provincetown appear to have just as much virus in their systems as those who are unvaccinated.\n  “High viral loads suggest an increased risk of transmission and raised concern that, unlike with other variants, vaccinated people infected with delta can transmit the virus,” she said.\n  The recommendation suggests a rapid return to a layered approach of countermeasures, including masks and social distancing, which could also complicate school reopenings starting next month in the US.\n    Investigations around the world have been building evidence of outbreaks among the vaccinated for weeks. For instance, a scientific team in Paris and French Guiana  recently described how covid-19 tore through a South American gold mine in May, even though nearly all the miners had received Pfizer’s vaccine.\n  Despite being inoculated, 60% became infected by a variant called gamma. That surprised the scientists so much that they checked to see if the vaccines had been damaged in shipping, but they weren’t.\n  The initial studies of Pfizer’s vaccine, the mostly widely used in the US, showed it was more than 90% effective in preventing symptomatic disease. But that’s not what was seen in the gold miners; half ended up with symptoms like a fever. The vaccines may still have helped, though. None of the miners became seriously ill, even though most were older than 50 and some had risk factors like high blood pressure and diabetes.\n  More evidence comes from India, where health-care workers were eligible for the AstraZeneca vaccine starting in early 2021. But when a team from the UK and India looked at covid-19 cases in these workers,  they found “significant numbers of vaccine breakthrough infections” at three Delhi hospitals, including a superspreading event that infected 30 people.\n  The breakthrough infections were much more likely to be caused by the delta variant, they say, than any of the older strains. The older variants were never able to cause a cluster of more than two linked cases among the health-care workers. But the researchers found 10 delta outbreaks that did so.\n  The reason the delta variant is different is that it transmits more easily; one reason is that the strain may be “evading” prior immunity, say researchers. That could help explain outbreaks among vaccinated people, and it also means that if you’ve already had covid-19, you could more easily get it again. The UK-India team estimated that natural protection against infection dropped by as much as half when people were exposed to delta.\n    In the US, the Provincetown outbreak may have taken hold during the July 4 “Independence Week,” when the town hosts thousands of visitors. As July wore on, investigators learned of hundreds of covid-19 cases, and sequencing labs in Boston determined they were caused by delta.\n  The Provincetown outbreak set off alarm bells at the CDC because vaccines didn’t seem to prevent the virus from spreading person to person, even though most were vaccinated, according to the Washington Post, which  obtained an internal CDC presentation that described delta as being as contagious as chicken pox.\n   Another key clue came from PCR tests run on about 200 people in the Provincetown cluster. Researchers found that the amount of virus in someone’s airway—and hence what the person might launch into the word with every cough and sneeze—was roughly the same, no matter whether people were vaccinated or not.\n  That doesn’t prove that vaccinated people transmit just as much, says Monica Gandhi, an infectious disease researcher at the University of California, San Francisco. She says that PCR tests detect virus fragments as well as live germs, so vaccinated people might be shedding less live virus or be infectious for less time. Gandhi adds that even with variants circulating, vaccines are still effective so far at preventing most major illness.\n  Nevertheless, “we are seeing more mild, symptomatic cases,” she says, as well as transmission among the vaccinated.\n  For the CDC, the new information posed a difficult communication problem: how to tell everyone the vaccine party might be over. In May, it had said that fully vaccinated Americans could dispense with masks and social distancing in most circumstances.\n  But by July 25, local officials in Provincetown had  reintroduced an indoor mask mandate for the town, covering indoor restaurants, offices, bars, and dance floors, and said they would begin testing wastewater. Two days later, the CDC followed suit, recommending that in high-transmission areas everyone wear a mask in indoor public settings.\n  Because of the delta variant, much of the US may soon qualify as being a high-risk area. Since a low in June, covid-19 cases have risen more than sixfold.", "posttime": "2021-07-31 11:29:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "疫苗,clusters", "title": "接种疫苗的 Covid 集群正在扼杀我们恢复正常的梦想", "title_en": "Covid clusters among the vaccinated are killing our back-to-normal dreams", "transed": 1, "url": "https://www.technologyreview.com/2021/07/30/1030390/vaccinated-getting-covid-delta-mask-mandate-superspreaders/", "via": "", "real_tags": ["疫苗", "clusters"]}, {"category": "", "categoryclass": "", "imagename": "274ab7d040af3f5097a8a8c854847b62.jpg", "infoid": 1070786, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "看起来，标志性的 GPU 制造商之一 3dfx Interactive 在 20 年后卷土重来。一个据称由该公司运营的新推特账户发推文称，该公司正在回归，并将在下周发布重大公告。 3dfx Interactive 时隔 20 年重返 GPU 市场？下周预告重大公告 我们都拥有或听说过 Voodoo 系列显卡，所有这些显卡都是由 3dfx Interactive 设计和制造的。该公司曾经是其他 GPU 制造商（当时主要是 NVIDIA）的主要竞争对手，但在产品发布乏力后，该公司最终申请破产，其大部分资产于 2002 年被 NVIDIA 以 7000 万美元收购。这个新帐户似乎表明 3dfx Interactive 经过 20 年的等待而回归，他们的第一个重大公告将在下周星期四（8 月 5 日）发布。我们不知道该公司计划宣布什么，但如果这确实是真实的消息，那么除了 NVIDIA、AMD 和英特尔之外，我们将在 GPU 市场上拥有另一个主要参与者。你可以看到下面的预告公告（请注意，下面使用的图片是 2014 年 DeviantArt 的粉丝创作）：20 年后，3dfx Interactive 又回来了。准备好迎接关于我们本周四回归的重大公告！ pic.twitter.com/KXPeY20lQ7 我们最近看到了 3dfx Voodoo 5 6000 显卡的一个模型，其中显卡是用现代风格重新创建的。显卡由设计师 Anthony 设计，采用定制 PCB 设计，带有五个 VSA-100 GPU，每个 GPU 具有 8 MB (166 MHz) SDRAM，总共有 32 兆字节的内存，每个 GPU 都连接到由一个4针电源接口。该卡具有 PCI 接口（不是 PCIe），并具有用于显示输出的双 VGA 端口。当然，这只是粉丝的消遣，除了怀旧的原因，像这样的卡在今天的 GPU 市场上没有多大意义，所以我们将获得一些现代的东西。再次，让我们等到下周看看这是怎么回事。据我们所知，它很可能是一个玩得很好的巨魔帐户。", "note_en": "It looks like 3dfx Interactive, one of the iconic GPU makers, is making a comeback after 20 years. A  new Twitter account which is supposedly run by the company has tweeted out that the company is making a return and going to make a major announcement next week.\n 3dfx Interactive Coming Back To The GPU Market After 20 Years? Teases Major Announcement Next Week\n We all have owned or heard about the Voodoo series of graphics cards, all of which were designed and made by 3dfx Interactive. The company used to be a major rival to other GPU manufacturers, primarily NVIDIA back in the day but after lackluster product launches, the company ultimately filed for bankruptcy and most of their assets were acquired by NVIDIA in 2002 for $70 Million.\n  This new account seems to suggest that 3dfx Interactive is coming back after a 20 years wait and their first major announcement will be made on Thursday (5th of August) which is next week. We don&#39;t know what the company plans to announce but if this is indeed real news, then we will have another major player in the GPU market aside from NVIDIA, AMD &amp; Intel. You can see the teaser announcement below (Do note that the picture used below is a fan creation from  DeviantArt from 2014):\n  3dfx Interactive is coming back, 20 years later. Prepare for an major announcement regarding our return this Thursday!  pic.twitter.com/KXPeY20lQ7\n  We recently saw a mod of the  3dfx Voodoo 5 6000 graphics card where the graphics card was recreated with a modern touch to it. The graphics card, designed by modder, Anthony, utilizes a custom PCB design with five VSA-100 GPUs, each with 8 MB (166 MHz) SDRAM for a total of 32 Megabytes of memory and each GPU connected to an active heatsink solution powered by a 4-pin power interface. The card rocks a PCI interface (not PCIe) and features dual VGA ports for display output.\n  Of course, that was just a fan recreation and cards like these aren&#39;t going to make much sense in today&#39;s GPU market aside from nostalgic reasons so we are going to get something modern. Again, let&#39;s wait till next week to see what this is all about. It could very well be a well-played troll account for all we know.", "posttime": "2021-07-31 11:29:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "gpu,interactive,下周", "title": "GPU Maker、3dfx Interactive 20 年后卷土重来", "title_en": "GPU Maker, 3dfx Interactive Teases a Comeback After 20 Years", "transed": 1, "url": "https://wccftech.com/gpu-maker-3dfx-interactive-teases-a-comeback-after-20-years-major-announcement-expected-next-week/", "via": "", "real_tags": ["gpu", "下周"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070785, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周在我的播客上，我阅读了我最新的 Locus 杂志专栏，“技术垄断和互操作性的不足”。它提出了一种变革理论，让我们进入一个充满侵略性、跨行业、全球信任破坏的世界。大多数行业都被垄断了。无论我们谈论的是运动鞋还是药房福利经理，垄断的路径都是一样的：公司收购小型竞争对手，与主要竞争对手合并，并使用投资者的现金来补贴反竞争攻击。他们能够侥幸逃脱的原因是，40 年来，世界一直处于危险的经济错觉中：打击垄断的唯一基础是“消费者福利”。也就是说，只有在使价格上涨的情况下，垄断才会被认为是有害的。 “消费者福利”标准起源于芝加哥大学的极右翼经济学崇拜，由罗纳德·里根 (Ronald Reagan) 发起，此后得到历任总统的支持（直到拜登上周的 EO 明确拒绝）。里根患有初期痴呆症（即使在他的鼎盛时期也像猪屎一样厚），但消费者福利的推动者了解其后果：通过只关注垄断对我们作为“消费者”的影响，我们将不考虑垄断者如何对我们采取行动公民。 “消费者福利”是集中公司权力的秘诀，它可以压倒监管者、立法者和法官，创造一种富人的计划经济，在这种经济中，我们的生活和工作方式由不负责任的董事会决定，而不是公共立法机构。立法者在这种权力攫取的同时也是他们的同谋——虽然竞选捐款抵消了每次公司抛售所带来的选民疏远——但今天，似乎有足够数量的立法者受够了。\n在众议院民主党六项具有里程碑意义的反垄断法案的 26 小时加价会议上，各种立法者都反对科技垄断——从马特·盖茨这样的极右翼小丑到“小队”成员普拉米拉·贾亚帕尔，以及介于两者之间的各种“温和派” .立法者一度领先于选民。许多选民对某种垄断感到愤怒——技术、健康保险、有线电视、啤酒、金融、肉类包装——但很少有人明白问题不在于某个行业，而在于垄断本身。为了创造我们需要的全球跨行业信任破坏的动力，我们必须为这场运动创造和建立动力。我认为我们应该从技术开始。尽管很少有人将修复技术列为他们的首要任务，但没有人喜欢科技行业。更重要的是，尽管科技公司的垄断方式与职业摔跤的垄断方式相同（花钱登上顶峰、买断或击败所有竞争对手），但科技公司具有特殊的、特定的特征，可以更容易地再次撬开。您可能听说过技术被垄断是因为“网络效应”。这是一种产品或服务的经济术语，随着更多人使用它而变得更有价值。您加入 Facebook 是因为您的朋友在那里。一旦你在 FB 上，其他人就会加入，因为你在那里。但是，虽然网络效应解释了为什么技术变得强大，但它们并不是技术保持强大的原因。为此，您需要查看被忽视的“转换成本”的经济学概念——当您停止使用产品或服务时放弃的东西。\nFacebook 和其他大型科技公司竭尽所能提高转换成本。当您退出 FB 时，您将无法接触到留下来的朋友、社区和客户。这不是必须发生的技术原因。毕竟，您可以切换手机运营商而不会失去呼叫朋友的能力。离开 FB 的高昂成本是该公司故意制造的，它使用昂贵的诉讼和技术对策来阻止与其互操作的每一次尝试。但是，如果我们使用法律来保证互操作性，强制 FB 连接到其他非垄断性服务（例如，由合作社、非营利组织或初创公司运营的服务），那么 FB 的数十亿用户将不是加入 FB 的理由，他们会成为离开它的理由。如果我们通过了 ACCESS 法案——该法案规定 Facebook 有义务与承诺不挖掘或商业化数据的竞争对手进行互操作——那么离开 FB 将为您带来 FB（社区和朋友）的所有好处，而无需支付任何隐私成本。如果我们保护竞争兼容性——未经许可进行互操作的权利，我们将通过保护 mod FB 的权利来保护未来的访问法，以保护安全、增加可访问性和添加其他形式的互操作。修复行业——包括尤其是科技行业——需要公共部门采取行动。我们不能通过充当“消费者”来改善垄断——我们必须充当公民。尽管科技公司对它们的竞争——谷歌与 Facebook、苹果与谷歌——之间的竞争发出了所有的噪音，但它们的差异在本质上就像一盒幸运符中的“棉花糖”的味道一样毫无意义。\n苹果和谷歌实际上是一个联合体——多年来，谷歌的埃里克施密特一直是苹果董事会的成员。苹果最大的单一客户是谷歌。苹果和谷歌通过“不挖角”协议非法勾结压低工资也没有问题。 Google-Facebook 的竞争也是如此。对于两家本该日日夜夜不同的公司来说，有一大群人从一个公司搬到另一个公司——一直到雪莉·桑德伯格（Sheryl Sandberg），曾经的谷歌副总裁，现在是 Facebook 的首席运营官。史蒂文斯法官在对公民联合组织的异议中写道，企业言论自由是胡说八道，因为“企业没有良心、没有信仰、没有感情、没有思想、没有欲望。”这就是为什么垄断如此容易。当美国司法部终止 AT&amp;T 和 T-Mobile 的合并时，John Legere 接管了 T-Mobile 并宣布自己为“非 CEO”，留长头发并穿上 T 恤并强调他与竞争对手完全不同。但莱杰尔是前 AT&amp;T 高管。 T-Mobile 与其他运营商的不同之处——它声称自己是“非运营商”，就像那些 Lucky Charm 棉花糖口味一样肤浅。如果公司真的有个性和个性，如果公司竞争真的意味着什么，那么我们就不会有一波又一波的合并。我的意思是，要么迪斯尼和福克斯完全不和，鲁珀特·默多克和鲍勃·伊格尔就是罗密欧与朱丽叶，他们对彼此绝望而炽热的爱将他们两个伟大的家族团结在一起，或者……\n就公司具有“性格”和“价值”而言，这些归结为一件事：这就是为什么抵制或其他购买决定不会解决垄断问题。您不是消费者，不是通过购买或不购买来投票的流动钱包。您是公民，可以而且必须代表您要求所在州采取行动。企业被收购并非不可避免。这是垄断的结果——巨大的利润和集中的决策权，从一个行业到几家公司。我们可以拥有一个响应迅速的政府，但前提是它比公司更强大。我们需要打破每一个信任，但我们必须从某个地方开始。技术特别适合作为这个起点，因为互操作可以在粉碎技术力量方面发挥作用，而且因为技术是改变每个行业的大规模运动的基础设施。这是 MP3 的直接链接（托管由 Internet Archive 提供，他们将永远免费托管您的资料）：萨克勒家族参与了一项跨代、半个世纪的贩毒计划；从创造苯并类药物市场开始，最终导致阿片类药物流行。他们从他们创造的苦难中发了大财，如今他们比洛克菲勒家族更富有。\n家族制药公司 Purdue Pharma 制造了令人上瘾的、具有破坏性的阿片类药物奥施康定，然后系统地就其安全性向公众撒谎，同时贿赂医生和药品分销商以过量开药，导致超过 850,000 名美国阿片类药物死亡。这个家族利用慈善事业来确保其名称与画廊和博物馆相关，而不是与大屠杀相关联，并让他们的律师威胁他们的批评者（比如我），当这停止工作时，他们将数十亿美元藏在海外。萨克勒夫妇蓄意进行的大规模杀戮活动使他们赚了数十亿美元，但它让我们其他人付出了更多的代价，无论是在人命方面，还是在应对阿片类药物流行的地方政府和州的现金成本方面。他们的许多受害者起诉要求赔偿。萨克勒家族不仅仅是世界级的毒贩和名誉洗钱者，他们还掌​​握了抓捕法官的黑暗艺术。他们作为推动者的漫长而有利可图的职业生涯归功于他们有能力让法庭压制理查德萨克勒的证词。随着赔偿请求的涌入，萨克勒夫妇利用他们的司法默许，将他们所有的个人责任推到了普渡制药的公司责任中，然后宣布公司破产：这将在非双方同意的情况下解决所有针对萨克勒夫妇的个人和政府索赔。这是一个大胆的举动，美国很少有法官会同意。幸运的是萨克勒斯，他们知道如何滥用系统去法官购物：游戏的名字是罗伯特·德莱恩法官，美国对亿万富翁最友好的破产法官，他有让富有的罪犯宣布破产，解除他们的罪的悠久历史。义务，并带走数十亿美元。\n将他们的案子提交给纽约南区的 Drain 涉及一些明显的诡计，比如在他们的法庭文件中的机器可读元数据中放入虚假的威彻斯特县地址——该公司从未使用过的纽约州怀特普莱恩斯办公室。萨克勒斯的策略奏效了。他们的案件将在 8 月 9 日提交给 Drain 法官审理，而聪明的资金表示 Drain 将允许和解，而不顾州 AG 的反对意见。萨克勒家族将保留数十亿美元。他们不必承认对他们从中获利的死亡负有任何责任。他们甚至不必道歉。各州、城市和个人受害者将因索赔而获得几分钱。诚然，和解会让一些钱（只是萨克勒家族血统的一小部分）落入迫切需要它的人民和政府手中，但要以任何责任为代价。没有萨克勒会进监狱。没有萨克勒会破产。我们倾向于认为阿片类药物的流行是经济萎靡不振的症状，但有强有力的证据表明，阿片类药物成瘾是萨克勒家族令人难以置信的创新欺诈行为的结果，而不是更广泛的社会经济条件。 David M. Cutler 和 Edward Glaeser 在 Vox EU 上撰文表明，阿片类药物的流行与身体疼痛或情绪困扰的增加之间没有相关性。 1999 年至 2009 年间——当阿片类药物的使用量激增时——报告两种或两种以上痛苦状况的美国人没有显着增加；更重要的是，美国人报告的生活满意度在那些年里没有显着变化。\n解释阿片类药物兴起的主要变化是什么？萨克勒斯的奥施康定的发布，以及他们对其安全性的欺诈性声明，以及他们广泛的贿赂或诱骗医生开出阿片类药物的活动。这与阿片类药物成瘾的整体历史相吻合：阿片类药物问题的激增总是与技术突破相关，比如 1897 年的海洛因，一种“安全”的鸦片替代品，或 1904 年的吗啡，作为海洛因的非成瘾替代品出售。海洛因和吗啡经历了与氧气相同的循环——作为现有止痛药的安全替代品出售，大量过度处方，然后被发现与它们所替代的产品一样危险——甚至更糟。 #15yrsago Techno 混音参议员史蒂文的“互联网是管”疯狂 https://web.archive.org/web/20060715012809/http://www.boldheaded.com/2006/07/dj-ted-stevens-techno -remix-series-of.html #5yrsago 服务条款是“互联网上最大的谎言”的实证证明 https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2757465 溢出，一个小弟弟的短篇关于管道抗议的故事。周五进度：252字（共9712字）", "note_en": "This week on my podcast, I read my latest Locus Magazine column, &#34;Tech Monopolies and the Insufficient Necessity of Interoperability.&#34; It presents a theory of change to get us to a world of aggressive, trans-industry, global trustbusting.\n  Most industries are monopolized. Whether we&#39;re talking about athletic shoes or pharmacy benefit managers, the path to monopolization is the same: companies buy up small competitors, merge with major ones, and use their investors&#39; cash to subsidize anticompetitive attacks.\n The reason they&#39;re able to get away with it is that for 40 years, the world&#39;s been in the grip of a dangerous economic delusion: that the only basis for fighting monopolies is &#34;consumer welfare.&#34; That is, monopolies should only be considered harmful if they make prices go up.\n The &#34;consumer welfare&#34; standard originated with the far-right economics cult of the University of Chicago and was launched by Ronald Reagan, and has been supported by every president since (until Biden, whose EO from last week explicitly rejects it).\n  Reagan had incipient dementia (and was thick as pigshit even in his prime), but consumer welfare&#39;s boosters understood its consequences: by focusing solely on what monopolies did to us as &#34;consumers,&#34; we&#39;d remove from consideration how monopoles acted on us as  citizens.\n &#34;Consumer welfare&#34; was a recipe for concentrating corporate power so that it could overwhelm regulators, lawmakers and judges, creating a kind of pluocratic planned economy where how we live and work is decided in unaccountable board-rooms, not public legislatures.\n Lawmakers were complicit in this power-grab while it benefited them – while the campaign contributions offset the voter alienation that followed from every corporate sellout – but today, it seems, a critical mass of lawmakers have had enough.\n The 26-hour markup session for House Democrats&#39; six landmark antitrust bills saw every kind of lawmaker speak out against tech monopolies – from far-right clowns like Matt Gaetz to &#34;squad&#34; member Pramila Jayapal, and every kind of &#34;moderate&#34; in between.\n Lawmakers are, for once, ahead of the electorate. Lots of voters are furious about some kind of monopoly – tech, health insurance, cable, beer, finance, meat packing – but precious few who understand that the problem isn&#39;t with one industry, it&#39;s with monopoly itself.\n To create the momentum we&#39;ll need for global, cross-industry trustbusting, we have to create and build momentum for the movement. I think we should start with tech.\n Even though few people have fixing tech at the top of their agenda,  nobody likes the tech industry.\n What&#39;s more, though tech companies monopolized the same way that, say pro wrestling did (spending their way to the top, buying out or crushing all rivals), tech has particular, specific characteristics that make it easier to pry apart again.\n You&#39;ve probably heard that tech is monopolized because of &#34;network effects.&#34; That&#39;s econ jargon for a product or service that gets more valuable as more people use it. You join Facebook because your friends are there. Once you&#39;re on FB, others join because  you&#39;re there.\n But while network effects explain why tech  gets big, they&#39;re not why tech  stays big. For that, you need to look at the neglected economics concept of &#34;switching costs&#34; – the things you give up when you stop using a product or service.\n Facebook and other Big Tech companies do everything they can to raise switching costs. When you quit FB, you lose access to the friends, communities and customers who stay behind. There&#39;s no technical reason this has to happen.\n You can switch cell carriers without losing the ability to call your friends, after all. The high cost of leaving FB was deliberately created by the company, which has used expensive lawsuits and technological countermeasures to block every attempt to interoperate with it.\n But if we used the law to guarantee interop, to force FB to connect to other, non-monopolistic services (say, ones run by co-ops, nonprofits or startups) then FB&#39;s billions of users wouldn&#39;t be a reason to join FB, they&#39;d be a reason to  leave it.\n If we passed the ACCESS Act – which imposes a duty on Facebook to interoperate with rivals that promise not to mine or commercialize data – then leaving FB would give you all the benefits of FB (community and friends), with none of the privacy costs.\n  And if we safeguarded Competitive Compatibility – the right to interoperate without permission, we&#39;d future-proof the ACCESS Act, by securing the right to mod FB to protect security, add accessibility, and add other forms of interop.\n  Fixing industry – including and especially tech – requires action from the public sector. We can&#39;t make monopolies better by acting as &#34;consumers&#34; – we have to act as  citizens.\n   For all the noise that tech companies make about their rivalries – Google vs Facebook, Apple vs Google – at bottom, they differences are as meaningless as the flavors of &#34;marshmellows&#34; in a box of Lucky Charms.\n Apple and Google are effectively a combine – for years, Google&#39;s Eric Schmidt sat on Apple&#39;s board. Apple&#39;s biggest single customer is Google. And Apple and Google had no problem illegally colluding to suppress wages with &#34;no poach&#34; agreements.\n  Same goes for Google-Facebook&#39;s rivalry. For two companies that are supposed to be as different as night and day, there are a fuckton of personnel who have moved from one to the other – all the way up to Sheryl Sandberg, the one-time Google VP who&#39;s now Facebook&#39;s COO.\n In his dissent to Citizens United, Justice Stevens wrote that corporate free speech was bullshit because &#34;corporations have no consciences, no beliefs, no feelings, no thoughts, no desires.&#34;\n  That&#39;s why monopoly is so easy. Back when the DoJ killed AT&amp;T and T-Mobile&#39;s merger, John Legere took charge of T-Mobile&#39;s and declared himself the &#34;un-CEO,&#34; growing out his hair and donning a t-shirt and emphasizing that he was nothing like his rivals.\n But Legere was an ex-AT&amp;T exec. T-Mobile&#39;s differences from the other carriers – its claim to be an &#34;un-carrier&#34; were as superficial as those Lucky Charm marshmellow flavors.\n  If corporations really had character and personality, if corporate rivalries really meant anything, then we wouldn&#39;t have waves and waves of mergers.\n I mean, either Disney and Fox were completely at odds with one another and Rupert Murdoch and Bob Iger were Romeo and Juliet, whose desperate, burning love for one another united their two great houses, or…\n  To the extent that corporations have &#34;character&#34; and &#34;value,&#34; these boil down to one thing:\n  Which is why boycotts or other purchase decisions are not going to solve the monopoly problem. You&#39;re not a consumer, an ambulatory wallet who votes by buying or not buying. You&#39;re a citizen, who can and must demand action from your state on your behalf.\n Corporate capture isn&#39;t inevitable. It&#39;s the result of monopoly – of massive profits and concentrated decision-making power following from boiling an industry down to a few companies.\n We  can have a responsive government, but only while it is more powerful than companies.\n We need to bust every trust, but we have to start somewhere. Tech is uniquely suited to being that starting point, both because of the role interop can play in shattering tech&#39;s power, and because tech is the infrastructure for a mass movement to change every industry.\n     Here&#39;s a direct link to the MP3 (hosting courtesy of the Internet Archive, they&#39;ll host your stuff for free, forever):\n        The Sacklers engaged in an intergenerational, half-century program of drug-pushing; starting by creating the market for benzos and culminating in creating the opioid epidemic. They made a vast fortune off the misery they created and today they&#39;re richer than the Rockefellers.\n The family drug company, Purdue Pharma, created the addictive, destructive opioid Oxycontin, then systematically lied to the public about its safety, while bribing doctors and pharma distributors to overprescribe it, leading to over 850,000 US opioid deaths.\n The family used philanthropy to ensure its name was associated with galleries and museums rather than mass murder and had their lawyers threaten their critics (like me) and when that stopped working, they stashed billions offshore.\n  The Sacklers&#39; deliberate campaign of mass killing made them billions, but it cost the rest of us far more, both in human lives and in the cash-money costs for local governments and states coping with the opioid epidemic. Many of their victims sued for compensation.\n The Sacklers aren&#39;t mere world-class drug-dealers and reputation launderers, they&#39;ve mastered the dark art of capturing judges. They owe their long, profitable career as pushers to their ability to get a court to suppress Richard Sackler&#39;s testimony.\n  As the compensation claims poured in, the Sacklers used their judicial connivance to push all their personal liability into Purdue Pharma&#39;s corporate liability, and then declared the company bankrupt:\n  This would nonconsensually settle all claims – personal and governmental – against the Sacklers. It&#39;s a bold move, one that few judges in America would agree to. Lucky for the Sacklers, they know how to abuse the system to go judge-shopping:\n  The name of the game is Judge Robert Drain, America&#39;s most billionaire-friendly bankruptcy judge, who has a long history of letting wealthy criminals declare bankruptcy, discharge their obligations, and walk away with billions.\n  Getting their case in front of Drain in the Southern District of New York involved some obvious chicanery, like putting a bogus Westchester County address in the machine-readable metadata in their court filings – a White Plains, NY office that the company never used.\n The Sacklers&#39; gambit worked. Their case is going before Judge Drain on Aug 9 and the smart money says Drain will permit the settlement, overriding state AGs&#39; objections.\n  The Sacklers will keep billions. They will not have to admit to any culpability in the deaths they profited from. They won&#39;t even have to apologize. States, cities and individual victims will get pennies on the dollars for their claims.\n It&#39;s true that a settlement will get some money (a mere fraction of the Sacklers&#39; blood-fortune) into the hands of people and governments that desperately need it, but at the cost of any accountability. No Sackler will go to jail. No Sackler will go broke.\n We tend to think of the opioid epidemic as a symptom of economic malaise, but there&#39;s strong evidence that opioid addiction was the result of the Sacklers&#39; incredible, innovative frauds and not wider socioeconomic conditions.\n Writing in Vox EU, David M. Cutler and Edward Glaeser show that there is no correlation between the opioid epidemic and either a rise in physical pain or emotional distress.\n  Between 1999 and 2009 – when opioid use was spiking – there was no significant rise in Americans reporting two or more painful conditions; what&#39;s more, Americans&#39; reported life-satisfaction did not change significantly during those years.\n The major change that explains the rise of opioids? The release of the Sacklers&#39; Oxycontin, and their fraudulent claims about its safety, and their extensive campaign to bribe or trick doctors into prescribing opioids.\n This tracks with the history of opioid addiction overall: the spikes in opioid troubles  always correlate to technological breakthrough, like 1897&#39;s heroin, a &#34;safe&#34; opium alternative, or 1904&#39;s morphine, sold as a nonaddictive alternative to heroin.\n Heroin and morphine went through the same cycle as oxy – sold as a safe alternative to existing painkillers, vastly overprescribed, and then revealed to be every bit as dangerous – or worse – than the products they replaced.\n      #15yrsago Techno remix of Sen. Steven’s “The Internet is Tubes” lunacy  https://web.archive.org/web/20060715012809/http://www.boldheaded.com/2006/07/dj-ted-stevens-techno-remix-series-of.html\n    #5yrsago Empirical proof that Terms of Service are “the biggest lie on the Internet”  https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2757465\n         Spill, a Little Brother short story about pipeline protests. Friday&#39;s progress: 252 words (9712 words total)", "posttime": "2021-07-31 11:26:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "克勒斯,sacklers,技术", "title": "萨克勒斯将保留数十亿美元", "title_en": "The Sacklers Will Get to Keep Billions", "transed": 1, "url": "https://pluralistic.net/2021/07/12/monopolist-solidarity/#sacklers-billions", "via": "", "real_tags": ["克勒斯", "sacklers", "技术"]}, {"category": "", "categoryclass": "", "imagename": "8f011b6bbc988ed535acbfba794bf697.jpg", "infoid": 1070784, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据本周宣布的交易，莱德的车队维护设施将作为 TuSimple 货运网络的终端。 TuSimple 所谓的 AFN，即自动货运网络，是一系列航线和码头，专为自动卡车运输业务而设计，到 2024 年将扩展到美国。UPS 在上市前持​​有 TuSimple 的少数股权，美国承运商Xpress、Penske Truck Leasing 和 Berkshire Hathaway 的杂货和食品服务供应链公司 McLane Inc. 是该网络的首批合作伙伴。 TuSimple 的 AFN 包括四部分，包括其自动驾驶卡车、数字地图路线、货运终端和一个系统，让客户可以监控自动卡车运输操作并实时跟踪他们的货物。 Ryder 的设施将主要作为战略终端，TuSimple 卡车可以在那里接受维护，并在需要时校准自动驾驶系统中使用的传感器。在某些情况下，码头可能被用作可能想要提货的小型运营商的中转枢纽。但是，根据 TuSimple 总裁兼首席执行官程璐的说法，这并不意味着是一个枢纽到枢纽的系统，客户可以来这里取货。 “这些卡车需要具有可维护性和可维护性，它们需要有更长的正常运行时间，这是每个承运人都关心的，无论它是否自动驾驶，”卢说。小型托运人和承运人可能会使用这些终端来取货和卸货。不过，卢强调，在大多数情况下，尤其是像UPS这样的大型运营商，图森会直接将货物运送到客户的配送中心。 Lu 补充说，Ryder 设施在其网络上充当节点或站点，使 TuSimple 能够覆盖更大地理区域的更多客户。合作伙伴关系将逐步启动。 TuSimple 的车队中有 50 辆自动驾驶卡车，还有一名人类安全操作员，为亚利桑那州、新墨西哥州和德克萨斯州的客户运输货物。该合作伙伴关系最初将使用莱德在这些领域的设施，并最终扩展到该公司在美国的 500 个维护设施。 TuSimple 表示，预计将在今年晚些时候将业务扩展到东海岸，在凤凰城和奥兰多之间运送货物。 TuSimple 订购了大约 25 辆新卡车，一旦可用，它们将被添加到车队中。", "note_en": "Under the deal announced this week, Ryder’s fleet maintenance facilities will act as terminals for TuSimple’s freight network. TuSimple’s so-called AFN, or autonomous freight network, is a collection of shipping routes and terminals designed for autonomous trucking operations that will extend across the United States by 2024. UPS, which took a minority stake in TuSimple before it went public, carrier U.S. Xpress, Penske Truck Leasing and Berkshire Hathaway’s grocery and food service supply chain company McLane Inc. were the inaugural partners in the network.\n TuSimple’s AFN involves four pieces that includes its self-driving trucks, digital mapped routes, freight terminals and a system that will let customers monitor autonomous trucking operations and track their shipments in real time.\n  Ryder’s facilities will primarily serve as strategic terminals where TuSimple trucks can receive maintenance and have sensors used in the self-driving system calibrated, if needed. In some cases, the terminals might be used as a transfer hub for a smaller operator that might want to pick up cargo. But this is not meant to be a hub-to-hub system where its customers would come and pick up freight, according to TuSimple President and CEO Cheng Lu.\n “These trucks need to be serviceable and maintainable and they need to have higher uptime, which is what every carrier cares about regardless of whether it is autonomous or not,” Lu said.\n Small shippers and carriers might use these terminals to pick up and drop off freight. However, Lu stressed that in most cases, especially for large-scale operators like UPS, TuSimple will take the freight directly to the customer’s distribution centers. The Ryder facilities work as nodes, or stops, on its network to allow TuSimple to reach more customers over a larger geographic area, Lu added.\n The partnership will start gradually. TuSimple has 50 autonomous trucks in its fleet that — along with a human safety operator behind the wheel — transport freight for customers in Arizona, New Mexico and Texas. The partnership will initially use Ryder’s facilities in these areas and eventually expand to the company’s 500 maintenance facilities in the United States.\n TuSimple said it expects to expand operations to the East Coast, carrying freight between Phoenix and Orlando later this year. TuSimple has about 25 new trucks on order, which will be added to the fleet once they become available.", "posttime": "2021-07-31 10:49:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "自动,driving,tusimple", "title": "TuSimple 的自动驾驶卡车网络与 Ryder 合作初具规模", "title_en": "\n\t\t\t\tTuSimple’s self-driving truck network takes shape with Ryder partnership\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/30/tusimples-self-driving-truck-network-takes-shape-with-ryder-partnership/", "via": "", "real_tags": ["自动", "driving", "tusimple"]}, {"category": "", "categoryclass": "", "imagename": "7d55d8f713a0b0e2fd8ed5d68a3d6ce1.jpeg", "infoid": 1070783, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国各地的亚马逊快递公司正在指示工人绕过旨在确保货车安全驾驶的日常检查。作为安全预防措施，亚马逊要求签约的送货司机在轮班开始和结束时检查他们的车辆。但一些司机表示，他们被迫忽略损坏并尽快完成检查，这样送货公司就可以避免将货车停在路上。如果快递公司将面包车停在路上，他们就有可能失去宝贵的包裹路线，司机可能会失去一个班次。这些不一致的检查做法破坏了公司围绕工人安全的公开信息。他们还强调了交付合作伙伴在确保司机安全和跟上亚马逊激进的交付配额之间面临的紧张局势，每个司机每天可能会收到数百个包裹。 CNBC 采访了佐治亚州、俄亥俄州、印第安纳州、伊利诺伊州、肯塔基州和德克萨斯州的 10 位现任和前任亚马逊送货司机，他们发现他们的货车存在问题，从门和轮胎卡住，几乎没有胎面，到倒车摄像头损坏和镜子坏了。他们说经理告诉他们忽略这些问题并像往常一样完成交付。其中一些司机要求匿名，以免遭到雇主或亚马逊的报复。 “他们会告诉我们，只要确保一切顺利就可以了，”Chastity Cook 说，他今年早些时候辞去了伊利诺伊州一家亚马逊快递公司的工作。 “我们只是检查了清单。我们甚至没有停下来阅读它并确保一切都在那里。”亚马逊在一份声明中告诉 CNBC，该公司会定期审核快递公司对安全政策的遵守情况，包括每天进行两次车辆安全检查。该公司表示，在安全问题得到解决之前，亚马逊会停止运营车辆。 “当安全协议被破坏时，我们会采取各种行动，包括在有必要的情况下终止与 DSP [交付服务合作伙伴] 的关系，”该公司表示。 “我们正在积极调查这个故事中的经历，不相信他们代表了每天安全递送包裹的 150,000 多名司机。”\n亚马逊的 DSP 计划于 2018 年启动，在公司庞大的履行和物流运营中发挥着关键作用。 DSP 网络由美国至少 2,000 家签约送货公司和 115,000 名司机组成，通常以蓝色亚马逊品牌货车为特色，负责处理到购物者家门口的最后一英里。由于 DSP 网络由合作伙伴运营，因此司机和经理与零售巨头保持一定的距离。司机说，不同 DSP 的工作环境和管理质量差异很大。亚马逊此前曾表示，它会告知司机最佳安全实践，并已在整个 DSP 网络的安全机制上投资了数亿美元。在卸任 CEO 之前，亚马逊创始人兼执行主席杰夫·贝索斯 (Jeff Bezos) 承诺将安全和员工满意度作为公司的更大重点。该公司越来越依赖软件和车载技术来监控驾驶员安全。亚马逊 2 月份在其送货车中推出了支持人工智能的摄像头，旨在检测安全违规行为，多年来，它一直使用名为 Mentor 的应用程序来跟踪员工的驾驶行为。亚马逊对司机和 DSP 的评分，部分取决于他们对安全措施的遵守情况，这可以决定他们是否有资格获得奖金。快递公司已经发现了其中一些工具的变通方法。 Vice 在 5 月份报道说，一些 DSP 鼓励司机在他们的路线上关闭 Mentor，以确保他们继续达到亚马逊的交付目标。此外，亚马逊继续面临对其仓库和送货员工的安全和待遇的广泛审查。在为亚马逊 2 亿多 Prime 会员提供包裹的压力下，司机们越来越多地谈论工作条件，包括声称工人经常用瓶子小便，并在路上被推入危险境地。 CNBC 获得了检查过程的屏幕记录，称为驾驶员车辆检查清单，显示了其工作方式的逐步细分。\n司机打开 Flex 应用程序并扫描车辆上的条形码，将其与应用程序配对。之后，应用程序中会出现一个窗口，指示司机开始检查。驾驶员检查车辆的前侧、乘客侧、后侧、驾驶员侧和驾驶室。每个类别中都有几个子部分需要进一步检查，例如货车的灯、轮胎、后视镜、转向、摄像头和刹车。如果司机标记货车有问题，Flex 应用程序会立即提示他们联系他们的经理。该应用程序也不会向司机显示他们的包裹递送路线。修理好面包车后，首先分配给车辆的司机必须在 Flex 应用程序中验证所有问题是否已解决。否则，清单末尾的屏幕会显示“您没有报告车辆的任何问题”。司机必须勾选一个方框，上面写着“我在此证明我的车辆检验报告真实准确。”在其 DSP 安全手册和教学材料中，亚马逊鼓励司机不要驾驶危险车辆。一份分发给司机并由 CNBC 查看的检查指南，以粗体和红色字体显示，“不要在路线上驾驶任何不安全的车辆。”一份单独的 11 页 DSP 安全手册指出，“驾驶员必须立即报告所有车辆缺陷，包括故障和缺陷。”这份未注明日期的文件还说，旅行前和旅行后的检查是必要的，以“确保您指定的车辆可以上路，并且不会造成任何妨碍车辆安全运行的危险。”但司机们表示，他们的车辆始终存在安全隐患，从卡住的车门和损坏的倒车摄像头，到无法锁上的光头轮胎和安全带，管理人员不鼓励他们在清单上报告这些问题。\n来自伊利诺伊州的司机库克说：“他们告诉我们，如果东西坏了，不要做标记，否则面包车就无法驾驶了。” “他们说要向管理层报告损失。”一位来自德克萨斯州奥斯汀的前司机因害怕受到前雇主的报复而要求匿名，他说一位经理告诉他们，如果他们的车辆有任何问题，他们当天就不会轮班。司机说，他们在为 DSP 工作时注意到了许多安全隐患。几辆货车打破了备用警报器，当货车倒车时，它会提醒行人和其他车辆。司机说，检查引擎灯和其他传感器经常在货车上闪烁——足以让司机开玩笑说它看起来像圣诞灯。印第安纳州的前亚马逊送货司机安德烈·柯克 (Andre Kirk) 回忆说，当他检查自己的货车时，注意到检查引擎灯亮了。柯克认为这意味着它应该停止服务，但无论如何他还是被迫驾驶它。出于安全考虑，Kirk 将货车开到附近的 Jiffy Lube。修理工告诉柯克，他无法在某些 DSP 使用的梅赛德斯-奔驰短跑面包车上工作，因此柯克决定回到路上并尽可能安全地完成他的轮班。 Kirk 说他很困惑为什么他的 DSP 不让员工报告他在车辆检查期间遇到的问题。 “我觉得有些不对劲。为什么不报告呢？” Kirk 在接受采访时说，他在 5 月份被 DSP 解雇。 “如果这不应该投入使用，我为什么还要驾驶它？”\n在司机在检查期间发现问题后，亚马逊要求 DSP 公司将车辆“停飞”，或停止运营以进行维修。司机说，管理人员避免停运车辆，因为他们不想放弃送货路线。例如，如果 DSP 被迫停飞三辆货车进行维修，他们的车队中可能没有足够的备用货车来处理亚马逊当天分配给他们的所有送货路线。据司机和一位前 DSP 所有者称，亚马逊会为每周交付的每个包裹以及他们取走的每条交付路线向签约的快递公司支付费用，他们要求匿名，因为他们仍在从事物流业务。这位前 DSP 所有者表示，他们试图尽快修复车辆问题，但他们会告诉司机不要在 Flex 应用程序中标记问题，以避免任何货车停飞和“掉线”。放弃路线不仅会在经济上伤害 DSP，还会影响亚马逊分配给他们的分数。亚马逊将交付合作伙伴的等级从“差”到“出色+”，并考虑交付性能等因素。如果 DSP 的排名下降，它可能会失去奖金支付或在未来获得更差的路线。一位来自印第安纳州的司机说：“侧门可能被打破，前门可能被打破，你不应该报告，因为他们会把车辆搁浅。” “然后就是你的路线。”", "note_en": "Amazon delivery companies around the U.S. are instructing workers to bypass daily inspections intended to make sure vans are safe to drive.\n Amazon requires contracted delivery drivers to inspect their vehicles at the beginning and end of their shift as a safety precaution. But some drivers say they&#39;re pressured to ignore damage and complete the inspections as quickly as possible, so that delivery companies can avoid taking vans off the road. If delivery companies take a van off the road, they risk forfeiting valuable package routes and drivers may lose a shift.\n  These inconsistent inspection practices undermine the company&#39;s public messaging around worker safety. They also highlight the tension that delivery partners face between ensuring drivers&#39; safety and keeping up with Amazon&#39;s aggressive delivery quotas, which can stretch into hundreds of packages per day per driver.\n CNBC spoke to 10  current and former Amazon delivery drivers in Georgia, Ohio, Indiana, Illinois, Kentucky and Texas who discovered their vans had issues ranging from jammed doors and tires with little to no tread to busted backup cameras and broken mirrors. They say managers told them to ignore these problems and complete their deliveries as usual. Some of these drivers asked to remain anonymous for fear of retribution from their employers or Amazon.\n &#34;They&#39;d tell us, just make sure everything&#39;s great and go,&#34; said Chastity Cook, who quit working for an Amazon delivery company in Illinois earlier this year. &#34;We just checked down the list. We don&#39;t even stop to read it and make sure everything is there.&#34;\n  Amazon told CNBC in a statement that the company regularly audits delivery companies&#39; compliance with safety policies, including two vehicle safety checks every day. Amazon takes vehicles out of operation until safety issues are addressed, the company said.\n  &#34;When safety protocol is broken, we take various actions including ending our relationship with a DSP [delivery service partner] if warranted,&#34; the company said. &#34;We&#39;re actively investigating the experiences in this story and don&#39;t believe they are representative of the more than 150,000 drivers that safely deliver packages every day.&#34;\n Amazon&#39;s DSP program, launched in 2018, plays a critical role in the company&#39;s vast fulfillment and logistics operations. The DSP network is made up of at least 2,000 contracted delivery firms and 115,000 drivers in the U.S., often distinguishable by blue Amazon-branded vans, that handle the last mile to shoppers&#39; doorsteps.\n Because the DSP network is run by partners, drivers and managers operate at arm&#39;s length from the retail giant. The working environment and management quality varies greatly between DSPs, drivers say.\n Amazon has previously said it informs drivers of best safety practices and has invested hundreds of millions of dollars in safety mechanisms across the DSP network. Before stepping down as CEO, Amazon founder and Executive Chairman Jeff Bezos  pledged to make safety and employee satisfaction a greater focus at the company.\n The company has increasingly relied on software and in-vehicle technology to monitor driver safety. Amazon  in February rolled out AI-enabled cameras in its delivery vans that are designed to detect safety infractions and, for years, it has  used an app called Mentor to track employees&#39; driving behavior. Drivers and DSPs are scored by Amazon, in part, on their adherence to safety measures, which can determine their eligibility to receive bonuses.\n Delivery companies have discovered workarounds to some of these tools.  Vice reported in May that some DSPs were encouraging drivers to turn off Mentor while on their route to make sure they continue to hit Amazon&#39;s delivery targets.\n Additionally, Amazon continues to face broad scrutiny around the safety and treatment of its warehouse and delivery workforce. Under the pressure of getting packages to Amazon&#39;s 200 million-plus Prime members, drivers are increasingly  speaking out about working conditions, including claims that workers routinely urinate in bottles and are  pushed into dangerous situations while on the road.\n   CNBC obtained a screen recording of the inspection process, referred to as a Driver Vehicle Inspection Checklist, showing a step-by-step breakdown of how it works.\n Drivers open the Flex app and scan a barcode on their vehicle that pairs it to the app. After that, a window appears in the app, instructing drivers to start the inspection.\n Drivers check their vehicle&#39;s front side, passenger side, back side, driver side and cab. Within each category are several subsections that require further inspection, such as the van&#39;s lights, tires, mirrors, steering, cameras and brakes.\n If a driver marks issues with the van, the Flex app will immediately prompt them to contact their manager. The app also won&#39;t show drivers their package delivery route. Once the van is repaired, whichever driver is first assigned to the vehicle must verify in the Flex app that any issues were fixed.\n Otherwise, a screen at the end of the checklist will say &#34;you didn&#39;t report any issues with the vehicle.&#34; Drivers are required to check a box which states, &#34;I hereby certify that my vehicle inspection report is true and accurate.&#34;\n  In its DSP safety manuals and instructional materials, Amazon encourages drivers not to drive dangerous vehicles. An inspection guide distributed to drivers and viewed by CNBC states, in bold and red font, &#34;Do not operate any unsafe vehicle out on route.&#34;\n A separate, 11-page safety manual for DSPs states that, &#34;Drivers must report all vehicle deficiencies, including malfunctions and defects, immediately.&#34; The document, which is undated, also says that pre- and post-trip inspections are necessary to &#34;ensure your assigned vehicle is road ready and doesn&#39;t pose any hazards that prevent the safe operation of the vehicle.&#34;\n But drivers say there are persistent safety hazards in their vehicles, from jammed doors and broken backup cameras to bald tires and seatbelts that won&#39;t lock, and managers discourage them from reporting these issues on the checklist.\n &#34;They told us not to mark things if they were broken because then the van wouldn&#39;t be drivable,&#34; said Cook, the driver from Illinois. &#34;They said to report damages to management.&#34;\n  One former driver from Austin, Texas, who asked to remain anonymous out of fear of retribution from their former employer, said a manager told them that if they marked anything wrong with their vehicle, they wouldn&#39;t have a shift that day.\n The driver said they noticed numerous safety hazards while working for their DSP. Several vans had broken backup alarms, which alert pedestrians and other vehicles when the van is reversing. Check engine lights and other sensors were often flashing on the vans — enough that drivers joked it looked like Christmas lights, the driver said.\n Andre Kirk, a former Amazon delivery driver in Indiana, recalled when he was inspecting his van and noticed the check engine light was on. Kirk thought it meant it was supposed to be taken out of service, but he was forced to drive it anyway.\n Concerned for his safety, Kirk drove the van to a nearby Jiffy Lube. The repairman told Kirk he couldn&#39;t work on the Mercedes-Benz sprinter vans used by some DSPs, so Kirk decided to get back on the road and complete his shift as safely as possible.\n Kirk said he was confused why his DSP wouldn&#39;t let employees report issues like he experienced during vehicle inspections.\n &#34;I felt like something wasn&#39;t right. Why not report this?&#34; said Kirk,  who was fired from his DSP in May, in an interview. &#34;If this is not supposed to be in service, why am I still driving it?&#34;\n  After drivers flag an issue during inspections, Amazon requires DSP companies to &#34;ground&#34; the vehicle, or take it out of operation for repairs.\n Drivers say that managers avoid grounding vehicles because they don&#39;t want to give up delivery routes. For example, if a DSP is forced to ground three vans for repairs, they may not have enough spare vans in their fleet to handle all the delivery routes Amazon assigned them that day.\n  Amazon pays contracted delivery companies for every package delivered each week and for every delivery route they pick up, according to drivers and a former DSP owner, who asked to remain anonymous because they are still in the logistics business.\n The former DSP owner said they tried to get vehicle issues repaired as quickly as possible, but they would tell drivers not to mark issues in the Flex app in order to avoid grounding any vans and &#34;dropping routes.&#34;\n Dropping a route not only hurts DSPs financially, but it can also affect the score assigned to them by Amazon. Amazon  ranks delivery partners on a scale of &#34;Poor&#34; to &#34;Fantastic+,&#34; factoring in things like delivery performance. If a DSP&#39;s ranking falls, it may lose out on bonus payments or receive worse routes in the future.\n &#34;The side door could be broken, front door could be broken and you&#39;re not supposed to report it because they&#39;ll ground the vehicle,&#34; said one driver from Indiana. &#34;And then there goes your route.&#34;", "posttime": "2021-07-31 10:40:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚马逊,amazon,delivery,司机", "title": "亚马逊快递公司定期告诉司机绕过安全检查", "title_en": "Amazon Delivery Companies Routinely Tell Drivers To Bypass Safety Inspections", "transed": 1, "url": "https://www.cnbc.com/2021/07/30/amazon-dsps-tell-drivers-to-bypass-safety-inspections.html", "via": "", "real_tags": ["亚马逊", "amazon", "delivery", "司机"]}, {"category": "", "categoryclass": "", "imagename": "e96f867b690461773db677c379aebece.jpg", "infoid": 1070782, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "已经发现以前未记录的基于 Android 的远程访问木马 (RAT) 使用屏幕录制功能窃取设备上的敏感信息，包括银行凭据，并为设备上的欺诈打开大门。由于使用虚拟网络计算 (VNC) 的远程屏幕共享技术来全面了解目标用户，因此被称为“Vultur”，移动恶意软件通过官方 Google Play 商店分发，并伪装成名为“Protection Guard”的应用程序,”吸引了 5,000 多个装置。来自意大利、澳大利亚和西班牙实体的银行和加密钱包应用程序是主要目标。 ThreatFabric 的研究人员在与 The Hacker News 分享的一篇文章中说：“我们第一次看到一种 Android 银行木马，它以屏幕录制和键盘记录作为主要策略，以自动和可扩展的方式获取登录凭据。” “攻击者选择避开我们通常在其他 Android 银行木马中看到的常见 HTML 覆盖开发：这种方法通常需要攻击者投入更多的时间和精力来创建能够欺骗用户的多个覆盖。相反，他们选择了只需记录屏幕上显示的内容，即可有效地获得相同的最终结果。”虽然 MysteryBot、Grandoreiro、Banker.BR 和 Vizom 等银行恶意软件传统上依赖于覆盖攻击——即创建银行登录页面的虚假版本并将其覆盖在合法应用程序之上——来诱骗受害者泄露他们的密码和其他重要的私人信息，越来越多的证据表明威胁行为者正在远离这种方法。在本周早些时候发布的一份报告中，意大利网络安全公司 Cleafy 发现了 UBEL，这是 Oscorp 的更新变体，观察到它使用 WebRTC 与受感染的 Android 手机实时交互。 Vultur 采用了类似的策略，它利用可访问性权限来捕获按键，并利用 VNC 的屏幕录制功能秘密记录手机上的所有活动，从而避免注册新设备的需要，并使银行难以发现欺诈行为。更重要的是，该恶意软件使用 ngrok，这是一种跨平台实用程序，用于通过安全隧道将 NAT 和防火墙后面的本地服务器暴露给公共互联网，以提供对在手机上本地运行的 VNC 服务器的远程访问。此外，它还与命令和控制 (C2) 服务器建立连接，以通过 Firebase 云消息传递 (FCM) 接收命令，然后将其结果（包括提取的数据和屏幕截图）传输回服务器。\nThreatFabric 的调查还将 Vultur 与另一个名为 Brunhilda 的知名恶意软件联系起来，这是一种利用 Play 商店在所谓的“投放即服务”（DaaS）操作中分发不同类型恶意软件的投放程序，并引用了重叠在用于促进​​攻击的源代码和 C2 基础设施中。这家总部位于阿姆斯特丹的网络安全服务公司表示，这些关系表明 Brunhilda 是一家私人经营的威胁行为者，拥有自己的投放器和专有的 RAT Vultur。研究人员总结道：“Vultur 的故事再次展示了攻击者如何从使用在地下市场出售的租用木马 (MaaS) 转向专为该群体需求量身定制的专有/私有恶意软件。” “这些攻击是可扩展和自动化的，因为执行欺诈的操作可以在恶意软件后端编写脚本并以命令序列的形式发送，从而使攻击者很容易撞上并逃跑。”觉得这篇文章有趣吗？在 Facebook、Twitter  和 LinkedIn 上关注 THN，以阅读我们发布的更多独家内容。", "note_en": "A previously undocumented Android-based remote access trojan (RAT) has been found to use screen recording features to steal sensitive information on the device, including banking credentials, and open the door for on-device fraud.\n Dubbed &#34;Vultur&#34; due to its use of Virtual Network Computing (VNC)&#39;s remote screen-sharing technology to gain full visibility on targeted users, the mobile malware was distributed via the official Google Play Store and masqueraded as an app named &#34;Protection Guard,&#34; attracting over 5,000 installations. Banking and crypto-wallet apps from entities located in Italy, Australia, and Spain were the primary targets.\n &#34;For the first time we are seeing an Android banking trojan that has screen recording and keylogging as the main strategy to harvest login credentials in an automated and scalable way,&#34; researchers from ThreatFabric  said in a write-up shared with The Hacker News.\n  &#34;The actors chose to steer away from the common HTML overlay development we usually see in other Android banking Trojans: this approach usually requires a larger time and effort investment from the actors to create multiple overlays capable of tricking the user. Instead, they chose to simply record what is shown on the screen, effectively obtaining the same end result.&#34;\n While banking malware such as  MysteryBot,  Grandoreiro,  Banker.BR, and  Vizom have traditionally relied on  overlay attacks — i.e., creating a false version of the bank&#39;s login page and overlaying it on top of the legitimate app — to trick victims into revealing their passwords and other important private information, evidence is mounting that threat actors are pivoting away from this approach.\n  In a report published earlier this week, Italian cybersecurity firm Cleafy uncovered  UBEL, an updated variant of Oscorp, that was observed using WebRTC to interact with the compromised Android phone in real-time. Vultur adopts a similar tactic in that it takes advantage of accessibility permissions to capture keystrokes and leverages VNC&#39;s screen recording feature to stealthily log all activities on the phone, thus obviating the need to register a new device and making it difficult for banks to detect fraud.\n What&#39;s more, the malware employs ngrok, a cross-platform utility used to expose local servers behind NATs and firewalls to the public internet over secure tunnels, to provide remote access to the VNC server running locally on the phone. Additionally, it also establishes connections with a command-and-control (C2) server to receive commands over Firebase Cloud Messaging ( FCM), the results of which, including extracted data and screen captures, are then transmitted back to the server.\n  ThreatFabric&#39;s investigation also connected Vultur with another well-known piece of malicious software named  Brunhilda, a dropper that utilizes the Play Store to distribute different kinds of malware in what&#39;s called a &#34;dropper-as-a-service&#34; (DaaS) operation, citing overlaps in the source code and C2 infrastructure used to facilitate attacks.\n These ties, the Amsterdam-based cybersecurity services company said, indicate Brunhilda to be a privately operating threat actor that has its own dropper and proprietary RAT Vultur.\n &#34;The story of Vultur shows one more time how actors shift from using rented Trojans (MaaS) that are sold on underground markets towards proprietary/private malware tailored to the needs of this group,&#34; the researchers concluded. &#34;These attacks are scalable and automated since the actions to perform fraud can be scripted on the malware backend and sent in the form of commands sequence, making it easy for the actor(s) to hit-and-run.&#34;\n    Found this article interesting? Follow THN on  Facebook,  Twitter   and  LinkedIn to read more exclusive content we post.", "posttime": "2021-07-31 10:39:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "android,密码,软件,恶意软件,malware", "title": "新的 Android 恶意软件使用 VNC 来监视和窃取受害者的密码", "title_en": "New Android Malware Uses VNC To Spy and Steal Passwords From Victims", "transed": 1, "url": "https://thehackernews.com/2021/07/new-android-malware-uses-vnc-to-spy-and.html", "via": "", "real_tags": ["android", "密码", "软件", "恶意软件", "malware"]}, {"category": "", "categoryclass": "", "imagename": "0e6e1192e32d65a37e7c6c101f209ca6.jpeg", "infoid": 1070779, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在击剑运动员花了太多时间无所事事地跳舞之后，这项运动引入了一种新的方式来迫使动作——它已经在日本千叶奥运会上引入了新的刺激——击剑出现了问题。世界上最好的击剑运动员拒绝真正击剑。出于各种战略原因，世界上最负盛名的重剑比赛正在演变成长长的比赛，剑士们只是站在那里，像一对和平主义者一样战斗。有时他们会互相敬礼，以表示他们更愿意在这一轮比赛中放下武器。但是击剑没有规则来阻止它。击剑相当于没有击球时钟的篮球——动作几乎在整场比赛中都停止了。重剑学科中问题的可笑严重性被规则击剑管理机构的名称暴露了出来作为解决方案。这就是所谓的“不愿战斗”规则。东京奥运会是自 2019 年实施这项惩罚不活动的击剑运动员的规则以来的第一届奥运会，这项运动的人士表示，这不仅仅是现代击剑史上最具震撼力的变化之一。他们说，这项运动重振了一项拥有锋利武器但变得沉闷乏味的运动。这一变化已经帮助将一项经常被视为令人眼花缭乱的奥林匹克运动变成了令人难以置信的惊险刺激。\n“我们正在努力让击剑更有趣，”赢得重剑个人金牌的法国人罗曼·坎诺 (Romain Cannone) 说。 “当一个人在两端什么都不做时，它并没有真正展示这项运动的本来面目。”击剑的核心问题是如何使一项可以追溯到第一届奥运会的小众运动现代化。一些规则更改很受欢迎。有些人讨厌。例如，在 2016 年奥运会上，一项相当神秘的提案将击剑手在每个点开始时的位置改变了几英寸，引起了如此狂热，以至于潜在的章程被称为“俄罗斯死亡之盒”。不愿意战斗规则适用于所有三个击剑项目，但最重要的是重剑，重剑通常被认为是这项运动中最慢的武器。它是最重的剑，得分可能更困难，而且比赛更具防御性。但他们已经变得过于防御了。二十年前，一位名叫 Ivan Kovacs 的匈牙利人在世界击剑锦标赛的团体重剑决赛中面对一位名叫 Meelis Loit 的爱沙尼亚人，这项运动的未来岌岌可危。击剑在奥运会上的地位受到质疑，击剑界希望为人群中的特邀嘉宾——国际奥委会主席上演一场耀眼的表演。相反的情况发生了：科瓦奇和洛伊特之间的比赛变成了一场闹剧。当 Loit 撤退时，Kovacs 以 4-3 领先，然后两名击剑手放下了武器。四分钟，他们只是站在那里。这种情况是每个击剑手都感到有动力不打架的奇怪结果。 Kovacs 领先并与一位臭名昭著的防守击剑手对抗，因此攻击 Loit 将是一个不应有的风险。与此同时，洛伊特是一名排名较低的击剑手。如果他只输给他的精英对手一分，他的爱沙尼亚队友就有机会在比赛中获得足够的积分来赢得球队的胜利。这已经不是第一次发生了。这不会是最后一次。但在击剑界想要避免这种情况的确切时刻，这是一个不和谐的例子。\n“从字面上看，男人不是击剑，”美国男子击剑队的重剑教练 Kornel Udvarhelyi 说。 “观众什么都没有。”击剑的国际管理机构 FIE 试图在打鼾之后修改规则。效果不是特别好。最初的被动规则给了没有使用黄牌的击剑手，这是警告，可能导致红牌和对手的接触。它没有解决问题。如果得分时间不够长，该规则的后续版本允许裁判将比赛简单地发送到下一个阶段。这消除了击剑手站在垫子上做 zilch 的时间，但实际上并没有强迫他们战斗。这就是为什么FIE在2019年引入了“不愿战斗”规则。它规定，当一分钟没有得分时，落后的击剑手将收到一张黄牌。屡次犯规导致红色。通过只惩罚落后的击剑手，它彻底改变了激励机制。现在，一名击剑手被迫变得咄咄逼人，因为他，而不是他的对手，会受到惩罚。所以他必须进攻。围栏开着。 “它迫使你围栏，”美国奥林匹克重剑运动员杰克霍伊尔说。 “没有人愿意看到两个击剑手站着不动。”击剑运动员说，他们立即看到了这项运动的影响。有更多的行动。以前通过停放公共汽车和生活在超防御性比赛中而茁壮成长的击剑运动员突然取消了这个选择。 Romain Cannone 知道如果没有新规则，他可能无法称自己为奥运金牌得主。 Cannone 世界排名第 47 位，甚至直到 6 月中旬才进入法国奥运会名单，取代了一名兴奋剂检测呈阳性的队友。预计有许多竞争对手将在东京争夺重剑金牌。 Cannone 不是其中之一。\n但在千叶幕张展览馆 B 厅内，重剑的动作往往看起来与过去的奥运会不同，因为这项规则诱使击剑运动员进攻。一位精力充沛的年轻法国击剑手在世界排名第 47 位并在东京组别中排名第 23 位，他能够利用这一优势。 “我喜欢进攻，”Romain Cannone 说。 “我喜欢把它混合起来。” “这是一个非常好的规则，因为它展示了击剑的真正含义，”Cannone 说。 “这是一种心理游戏，但也是一种身体游戏。”该设置非常适合 Cannone。他在四分之一决赛中击败了 2 号种子。他在半决赛中击败了 3 号种子。然后他打破了金牌的1号种子。一项新规则帮助他成为了新的奥运冠军。出现在 2021 年 7 月 29 日的印刷版中，名称为“让奥运会击剑再次变得有趣的规则变化”。", "note_en": "After fencers spent too much time dancing around doing nothing, the sport introduced a new way to force the action—and it has already introduced new thrills at the Olympics\n   CHIBA, Japan—Fencing had a problem. The world’s best fencers were refusing to actually fence.\n  For various strategic reasons, the world’s most prestigious epee matches were devolving into long stretches in which the sword fighters simply stood around, fighting as much as a pair of pacifists. They would sometimes just salute one another to signal they preferred to lay down their weapons for the round.\n  But fencing didn’t have a rule to stop it. It was the fencing equivalent of basketball without a shot clock—with the action grinding to a halt for almost the entire game.\n  The comic severity of the issue within the epee discipline was laid bare by the name of the rule fencing’s governing body came up with as a solution. It’s called the “Unwillingness to Fight” rule.\n  The Tokyo Games are the first Olympics since this rule penalizing fencers for inactivity was implemented in 2019, and people inside the sport say it’s not just one of the most seismic changes in modern fencing history. They say it has reinvigorated a sport that features sharp weapons yet had become painfully dull.\n  The change has already helped transform an Olympic sport that had often been seen as an eyesore into a blur of breakneck thrills.\n  “We’re trying to make fencing more enjoyable,” says Romain Cannone, the Frenchman who won the individual gold in epee. “When a person was at each end not doing anything, it’s not really showing the sport for what it is.”\n    The issue at the heart of fencing is how to modernize a niche sport that dates back to the very first Olympics. Some rule changes are popular. Some are loathed. At the 2016 Olympics, for example, a fairly arcane proposal, that changed where the fencer would stand at the start of each point by matter of inches, caused such a frenzy that the potential bylaw was being called  “the Russian Box of Death.”\n  The Unwillingness to Fight rule applies to all three of fencing’s disciplines but comes into play most with epee, which is generally considered to be the slowest weapon in the sport. It’s the heaviest of the swords, scoring can be more difficult and the bouts are more defensive. But they had become far too defensive.\n  It was two decades ago when a Hungarian named Ivan Kovacs faced an Estonian named Meelis Loit in the team epee finals of the World Fencing Championships with nothing less than the future of the sport at stake. Fencing’s place at the Olympics was in doubt, and the fencing community hoped to put on a dazzling show for the special guest in the crowd: the president of the International Olympic Committee.\n  The opposite happened: The match between Kovacs and Loit became a farce. Kovacs had a 4-3 lead when Loit retreated and then both fencers put down their weapons. For four minutes, they simply stood there.\n    The situation was the strange result of circumstances in which each fencer felt motivated not to fight. Kovacs was ahead and going up against a notoriously defensive fencer, so attacking Loit would have been an undue risk. Loit, meanwhile, was a lower-ranked fencer. If he lost by just one point to his elite opponent, his Estonian teammates would have a chance to score enough points in their matches to collect a team win.\n  It wasn’t the first time this had happened. It wouldn’t be the last. But it was a jarring example at the exact moment the fencing world wanted to avoid just that.\n  “Literally, guys were not fencing,” says Kornel Udvarhelyi, the epee coach for the U.S. men’s fencing team. “There was nothing for the spectators.”\n  FIE, fencing’s international governing body, tried to fiddle with the rules in the wake of that snorefest. It didn’t work especially well. An initial passivity rule gave fencers who didn’t fence yellow cards, which are warnings that can lead to red cards and a touch for the opponent. It didn’t solve the problem. A later version of the rule allowed the referee to simply send the bout to the next period if a point wasn’t scored for long enough. That eliminated the time fencers stood on the mat doing zilch, but didn’t actually force them to fight.\n  That’s why FIE introduced the Unwillingness to Fight rule in 2019. It dictates that when a minute elapses without a point, the fencer who is behind receives a yellow. Repeated offenses lead to a red.\n  By penalizing just the fencer who is behind, it completely changes the incentive system. Now, one fencer is compelled to be aggressive because he, and not his opponent, would suffer the penalty. So he must attack. The fencing is on.\n  “It forces you to fence,” says American Olympic epeeist Jake Hoyle. “Nobody wants to watch two fencers stand still.”\n    Fencers say they immediately saw the effects ripple through the sport. There was way more action. And fencers who had previously thrived by parking the bus and living in ultra-defensive bouts suddenly had that option removed.\n  Romain Cannone knows he might not be able to call himself an Olympic gold medalist without the new rule. Cannone is ranked 47th in the world and didn’t even make the French Olympic roster until the middle of June, replacing a teammate who had a positive doping test. There were a number of competitors expected to compete for epee gold in Tokyo. Cannone was not one of them.\n  But inside Makuhari Messe Hall B here in Chiba, the epee action often looked different than it had at past Olympics, as the rule coaxed fencers into attacking. A feisty young French fencer ranked 47th in the world and seeded 23rd in the Tokyo bracket was able to take advantage.\n  “I love to attack,” Romain Cannone says. “I love to mix it up.”\n    “It’s a really good rule because it shows what fencing really is,” Cannone said. “It’s a mind game, but it’s also a physical game.”\n  The set-up wonderfully suited Cannone. He upset the No. 2 seed in the quarterfinals. He upset the No. 3 seed in the semifinals.\n  Then he upset the No. 1 seed for the gold. A new rule helped make him the new Olympic champion.\n  Appeared in the July 29, 2021, print edition as &#39;The Rule Change That Made Olympic Fencing Fun Again.&#39;", "posttime": "2021-07-31 10:38:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "拒绝,refused,击剑", "title": "击剑者拒绝战斗。然后是改变这项运动的规则", "title_en": "Fencers Refused to Fight. Then Came the Rule That Changed the Sport", "transed": 1, "url": "https://www.wsj.com/articles/fencers-refused-to-fight-rule-change-epee-11627457900", "via": "", "real_tags": ["拒绝", "refused", "击剑"]}]