[{"category": "", "categoryclass": "", "imagename": "77e32cee2ad44cd006f35ad108f5ff5e.jpg", "infoid": 1072115, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国联邦通信委员会终于发布了最新的移动宽带覆盖图，为消费者提供了一个长期需要的工具，以了解他们在美国任何给定区域可以预期的蜂窝覆盖类型交互式工具显示 4G LTE 宽带美国四大运营商的数据和语音移动覆盖：AT&amp;T、T-Mobile、USmobile 和 Verizon。 FCC 在周五的新闻稿中表示，您看到的数据截至 2021 年 5 月 15 日是准确的。用户可以为不同的运营商叠加不同的覆盖图，以在一个地方比较所有信息，并区分数据可用性和语音可用性。 “这是 FCC 发布的第一张显示更新的移动覆盖范围的公共地图，与该机构之前发布的其他数据相比有了显着改进，”该机构表示，并补充说它“将提高由联邦通信委员会收集的宽带可用性数据的统一性和一致性。美国联邦通信委员会。”但是，值得注意的是，FCC 还表示，它使用上述运营商自愿提供的数据创建了地图，这些运营商在准确自我报告其覆盖范围方面没有良好的记录。这不是唯一明显的问题。该工具没有解决家庭互联网可用性的范围，这是所谓的数字鸿沟的主要问题，也没有解决能够获得负担得起的、可靠的互联网服务的居民与无法获得的居民之间的差距。每个运营商的 5G 建设也没有反映出来。还缺少用户在任何给定网络上可以期望的速度类型。 FCC 代理主席杰西卡·罗森沃塞尔 (Jessica Rosenworcel) 在有关该工具推出的说明中表示，要获得 4G 数据覆盖，网络必须提供至少 5Mbps 的下载速度和 1Mbps 的上传速度。但是，目前无法在地图上判断运营商在任何给定区域的覆盖范围是否超过这些基准或多次超过这些基准。所以这是向前迈出的一步，但只是勉强，而且早就应该这样做了。促使该地图首先创建的法律，即去年的宽带部署准确性和技术可用性法案，要求 FCC 提高其宽带可用性地图的准确性，因为冲突和过时的数据阻碍了弥合数字鸿沟的努力年。除其他要求外，该机构还被命令汇编和发布有关有线、固定无线和卫星宽带提供商的更可靠数据，并建立众包流程以收集公众信息。美国联邦通信委员会周五表示，现在该工具已上线，众包流程将发挥更大作用。一旦后端通过一些最终的验证过程，消费者以及州和地方当局将能够“根据实际经验提供输入”，以从长远来看提高工具的准确性。\n“一张好的地图会随着时间的推移而变化，”罗森沃塞尔在新闻稿中说。 “今天的新地图代表了我们在实施宽带数据法案和构建下一代宽带地图方面取得的进展，这些地图可以帮助连接 100% 的美国人。使用改进的系统和数据，我们可以提供有关宽带服务在全国范围内和不在全国范围内的更好信息。” Rosenworcel 在她的笔记中表示，这张地图是“一系列努力中的第一次”，旨在让消费者更清楚地了解全国的网络覆盖范围。", "note_en": "The Federal Communications Commission has finally released   an up-to-date mobile broadband coverage map, giving consumers a long-needed tool to find out what kind of cellular coverage they can expect in any given area across the U.S.\n  The interactive tool shows 4G LTE broadband data and voice mobile coverage of four of the nation’s largest carriers: AT&amp;T, T-Mobile, UScellular, and Verizon. The data you see is accurate as of May 15, 2021, the FCC said in   a press release Friday. Users can overlay different coverage maps for different carriers to compare all of the information in one place as well as differentiate between data availability and voice availability.\n “This is the first public map showing updated mobile coverage released by the FCC and represents a significant improvement over other data previously published by the agency,” the agency said, adding that it “will improve the uniformity and consistency of broadband availability data collected by the FCC.”\n    However, it’s worth noting that the FCC also said it created the map using data voluntarily provided by the aforementioned carriers, who don’t have   a great track record of accurately self-reporting their coverage. That’s not the only glaring issue. The tool doesn’t address the scope of home internet availability, a leading concern of the so-called   digital divide, or the gap between residents who have access to affordable, reliable internet service and those who don’t. Each carrier’s 5G buildouts aren’t reflected as well.\n  Also missing is what kind of speeds users can expect on any given network. Acting FCC chairwoman Jessica Rosenworcel said in   a note about the tool’s launch that to qualify as 4G data coverage, a network has to provide at least 5Mbps download speeds and 1Mbps upload speeds. Currently, though, there’s no way to tell on the map if a carrier’s coverage in any given area narrowly squeaks past those benchmarks or tops them several times over.\n   So it’s a step forward, but just barely, and a long-overdue one at that. The   law that prompted this map to be created in the first place, last year’s Broadband Deployment Accuracy and Technological Availability Act, required the FCC to improve the accuracy of its broadband availability maps because conflicting and outdated data has hampered efforts to bridge the digital divide for years. Among other requirements, the agency was ordered to compile and release more robust data about wired, fixed wireless, and satellite broadband providers as well as establish a crowdsourcing process to collect information from the public.\n   Now that the tool is live, that crowdsourcing process will come more into play, the FCC said Friday. Once the backend goes through some final verification processes, consumers along with state and local authorities will be able to “provide input informed by real-world experience” to improve the tool’s accuracy in the long run.\n “A good map is one that changes over time,” said Rosenworcel in the press release. “Today’s new map represents progress in our efforts to implement the Broadband DATA Act and build next-generation broadband maps that can help to connect 100 percent of Americans. Using improved systems and data, we can provide better information about where broadband service is and is not across the country.”\n  In her note, Rosenworcel said that this map is the “first in a series of efforts” to offer consumers a clearer understanding of network coverage across the nation.", "posttime": "2021-08-08 21:51:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,美国,宽带,finally,数据", "title": "FCC 终于发布了美国最新的移动宽带地图", "title_en": "FCC Finally Debuts an Up-to-Date Mobile Broadband Map of the U.S.", "transed": 1, "url": "https://gizmodo.com/fcc-finally-debuts-an-up-to-date-mobile-broadband-map-o-1847443988", "via": "", "real_tags": ["发布", "美国", "宽带", "finally", "数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072114, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个过程是自动的。您的浏览器将很快重定向到您请求的内容。", "note_en": "This process is automatic. Your browser will redirect to your requested content shortly.", "posttime": "2021-08-08 21:51:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "国会议员,mps,请求", "title": "2012 年，有 59% 的英国国会议员不及格的概率连续翻转两个头", "title_en": "In 2012, 59% of British MPs Flunked Probability of Flipping Two Heads in a Row", "transed": 1, "url": "https://www.unz.com/isteve/british-mps-flunked-probability-of-flipping-two-heads-in-a-row/", "via": "", "real_tags": ["国会议员", "mps", "请求"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072113, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然搜索引擎对普通互联网用户非常有帮助，但版权所有者也看到了巨大的负面影响。 “侵权网站”出现在搜索结果中这一事实已成为令人沮丧的根源。因此，谷歌和其他搜索引擎正面临源源不断的 DMCA 删除通知。仅 Google 就处理了超过 50 亿个删除请求，每周都会报告数百万个新 URL。虽然其中大多数正确指向有问题的链接，但也有很多错误。一些版权所有者将完全合法的网站标记为盗版天堂，而另一些版权所有者则通过瞄准他们自己的网站来打击自己。后者最近发生在网络漫画订阅服务 Toomics 上。本周我们看到了另一个有问题的 DMCA 通知，这可能更糟。乌克兰电视频道 TRK 要求 Google 删除 IP 地址 127.0.0.1 上托管的内容，该 IP 地址是设备或服务器的本地主机。该请求是由 TKR 的反盗版合作伙伴 Vindex 发送的，它基本上在自己的机器上标记了一个文件。 “侵权”链接是 127.0.0.1:6878/ace/manifest.m3u。这指向一个播放列表文件，可能用于经常用于盗版内容的 P2P 流媒体平台 Ace Stream。根据删除通知，所有被举报的链接“都非法提供了外部链接，用户可以通过这些链接访问和/或下载未经授权的受版权保护的足球内容。”然后将包含 Vindex 计算机上的文件。\n由于 127.0.0.1 指的是主机，因此技术上要求 Google 从其服务器中删除文件。一个不存在的文件。不用说，谷歌没有采取任何回应措施。以上表明 Vindex 可能想要好好看看它的移除机器人。在 DMCA 通知方面，该公司的声誉并不高。在报告给 Google 的所有链接中，只有 10% 多一点被搜索引擎删除。", "note_en": "While search engines are extremely helpful for the average Internet user, copyright holders also see a massive downside.\n The fact that “infringing sites” show up in search results has become a source of frustration. As a result, Google and other search engines are facing a steady stream of DMCA takedown notices.\n Google alone has processed more than  five billion takedown requests and millions of new URLs are reported every week. While the majority of these correctly point to problematic links, there are plenty of mistakes too.\n Some copyright holders flag perfectly  legitimate websites as piracy havens, which others shoot themselves in the foot by targeting their own websites. The latter happened to the webtoon  subscription service Toomics just recently.\n  This week we saw yet another problematic DMCA notice, which is perhaps even worse. TV channel  TRK Ukraine asked Google to remove content hosted on the IP-address  127.0.0.1, which is the localhost of a device or server.\n  The request was sent by TKR’s anti-piracy partner  Vindex, which essentially flagged a file on its own machine. The ‘infringing’ link is 127.0.0.1:6878/ace/manifest.m3u. This points to a playlist file, possibly for the P2P streaming platform  Ace Stream that’s often used to pirate content.\n  According to the takedown notice, all reported links “illegally provide external links with which users can access and/or download unauthorized copyrighted contents of Football.” That would then include the file on Vindex’s computer.\n Since 127.0.0.1 refers to the host computer, Google is technically asked to remove a file from its servers. A file that doesn’t exist. Needless to say, Google hasn’t taken any action in response.\n The above suggests that Vindex may want to take a good look at its takedown bots. The company doesn’t have a stellar reputation when it comes to DMCA notices. Of  all the links that were reported to Google, little more than 10% were removed by the search engine.", "posttime": "2021-08-08 21:50:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,piracy,网站", "title": "反盗版公司要求谷歌阻止 127.0.0.1", "title_en": "Anti-Piracy Firm Asks Google to Block 127.0.0.1", "transed": 1, "url": "https://torrentfreak.com/anti-piracy-firm-asks-google-to-block-127-0-0-1-210808/", "via": "", "real_tags": ["谷歌", "google", "piracy", "网站"]}, {"category": "", "categoryclass": "", "imagename": "ff0287210796737fd34a6056d629fa7a.png", "infoid": 1072112, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您在公司的生产环境中见过的最邪恶或最危险的代码片段是什么？我从未遇到过我认为是故意恶意和邪恶的生产代码，所以我很想知道其他人发现了什么。我见过的最危险的代码是一个存储过程，距离我们的核心生产数据库服务器有两个链接服务器。该存储过程接受任何 NVARCHAR(8000) 参数并通过双跳 sp_executeSQL 命令在目标生产服务器上执行该参数。也就是说，sp_executeSQL 命令执行了另一个 sp_executeSQL 命令，以便跳转两个链接的服务器。哦，链接服务器帐户在目标生产服务器上具有系统管理员权限。 1 我写过我以前在这里和这里工作过的一个应用程序。简单来说，我公司从印度继承了13万行垃圾。该应用程序是用 C# 编写的；这是一个柜员应用程序，当你去银行时，柜员在柜台后面使用的那种软件。该应用程序每天崩溃 40-50 次，而且根本无法重构为可运行的代码。我的公司不得不在 12 个月的时间里重新编写整个应用程序。为什么这个应用程序是邪恶的？因为看到源代码就足以让一个理智的人发疯，一个理智的疯子。用于编写此应用程序的扭曲逻辑可能只是受到洛夫克拉夫特式噩梦的启发。此应用程序的独特功能包括： 在 130,000 行代码中，整个应用程序包含 5 个类（不包括表单文件）。所有这些都是公共静态类。一个类称为 Globals.cs，其中包含 1000 和 1000 和 1000 个公共静态变量，用于保存应用程序的整个状态。这五个类总共包含 20,000 行代码，其余代码嵌入在表单中。你一定想知道，程序员是如何在没有任何类的情况下编写如此大的应用程序的？他们用什么来表示他们的数据对象？事实证明，程序员仅仅通过组合 ArrayLists、HashTables 和 DataTables 就成功地重新发明了我们都学到的关于 OOP 的一半概念。我们看到了很多这样的：\n请记住，上面的数据结构都不是强类型的，因此您必须将列表中的任何神秘对象转换为正确的类型。仅使用 ArrayLists、HashTables 和 DataTables 就可以创建什么样的复杂的、类似于 Rube Goldberg 的数据结构，真是令人惊奇。要分享如何使用上面详述的对象模型的示例，请考虑 Accounts：原始程序员为帐户的每个可理解的属性创建了一个单独的 HashTable：一个名为 hstAcctExists、hstAcctNeedsOverride、hstAcctFirstName 的 HashTable。所有这些哈希表的键都是“|”分隔的字符串。可以想到的键包括“123456|DDA”、“24100|SVG”、“100|LNS”等。由于整个应用程序的状态很容易从全局变量中访问，程序员发现没有必要将参数传递给方法。我会说 90% 的方法采用 0 参数。在少数这样做的情况下，为了方便起见，所有参数都作为字符串传递，而不管字符串代表什么。没有副作用的功能不存在。每个方法都修改了 Globals 类中的 1 个或多个变量。并非所有的副作用都有意义；例如，其中一种表单验证方法有一个神秘的副作用，即为存储 Globals.lngAcctNum 的任何帐户计算贷款的超额和短额付款。尽管有很多形式，但只有一种形式可以统治它们：frmMain.cs，其中包含高达 20,000 行的代码。 frmMain 做了什么？一切。它查帐、打印收据、发放现金，它什么都做。有时其他形式需要调用 frmMain 上的方法。与其将表单中的代码分解为一个单独的类，为什么不直接调用代码：尽管它已经创建了一个不可见的表单来执行业务逻辑，但您认为表单如何知道要查找哪个帐户？这很简单：表单可以访问 Globals.lngAcctNum 和 Globals.strAcctType。 （谁不喜欢匈牙利符号？）\n代码重用是 ctrl-c、ctrl-v 的同义词。我发现 200 行方法在 20 个表单中复制/粘贴。该应用程序有一个奇怪的线程模型，我喜欢称之为线程和计时器模型：每个生成线程的表单都有一个计时器。产生的每个线程都会启动一个有 200 毫秒延迟的计时器；一旦计时器启动，它会检查线程是否设置了一些魔法布尔值，然后它会中止线程。产生的 ThreadAbortException 被吞了。您可能认为这种模式只会看到一次，但我至少在 10 个不同的地方发现了它。说到线程，关键字“锁”从未出现在应用程序中。线程无需锁定即可自由操作全局状态。应用程序中的每个方法都包含一个 try/catch 块。每个异常都被记录并吞下。一些天才发现您可以将多个表单控件连接到同一个事件处理程序。程序员是怎么处理的？ private void OperationButton_Click(object sender, EventArgs e){ Button btn = (Button)sender; if (blnModeIsAddMc) { AddMcOperationKeyPress(btn); } else { string strToBeAppendedLater = string.Empty; if (btn.Name != &quot;btnBS&quot;) { UpdateText(); } if (txtEdit.Text.Trim() != &quot;Error&quot;) { SaveFormState(); } switch (btn.Name) { case &quot;btnC&quot;: ResetValues();休息; case &quot;btnCE&quot;: txtEdit.Text = &quot;0&quot;;休息; case &quot;btnBS&quot;: if (!blnStartedNew) { string EditText = txtEdit.Text.Substring(0, txtEdit.Text.Length - 1); DisplayValue((EditText == string.Empty) ? &quot;0&quot; : EditText); } 休息; case &quot;btnPercent&quot;: blnAfterOp = true; if (GetValueDecimal(txtEdit.Text, out decCurrValue)) { AddToTape(GetValueString(decCurrValue), (string)btn.Text, true, false); decCurrValue = decResultValue * decCurrValue / intFormatFactor; DisplayValue(GetValueString(decCurrValue)); AddToTape(GetValueString(decCurrValue), string.Empty, true, false); strToBeAppendedLater = GetValueString(decResultValue).PadLeft(20) + strOpPressed.PadRight(3); if (arrLstTapeHist.Count == 0) { arrLstTapeHist.Add(strToBeAppendedLater); blnEqualOccurred = false; blnStartedNew = true; } 休息; case &quot;btnAdd&quot;: case &quot;btnSubtract&quot;: case &quot;btnMultiply&quot;: case &quot;btnDivide&quot;: blnAfterOp = true; if (txtEdit.Text.Trim() == &quot;Error&quot;) { btnC.PerformClick();返回; } if (blnNumPressed || blnEqualOccurred) { if (GetValueDecimal(txtEdit.Text, out decCurrValue)) { if (Operation()) { AddToTape(GetValueString(decCurrValue), (string)btn.Text, true, true); DisplayValue(GetValueString(decResultValue)); } else { AddToTape(GetValueString(decCurrValue), (string)btn.Text, true, true); DisplayValue(&quot;错误&quot;); strOpPressed = btn.Text; blnEqualOccurred = 假； blnNumPressed = 假； } } else { strOpPressed = btn.Text; AddToTape(GetValueString(0), (string)btn.Text, false, false); } if (txtEdit.Text.Trim() == &quot;Error&quot;) { AddToTape(&quot;Error&quot;, string.Empty, true, true); btnC.PerformClick(); txtEdit.Text = &quot;错误&quot;; } 休息; case &quot;btnEqual&quot;: blnAfterOp = false; if (strOpPressed != string.Empty || strPrevOp != string.Empty) { if (GetValueDecimal(txtEdit.Text, out decCurrValue)) { if (OperationEqual()) { DisplayValue(GetValueString(decResultValue)); } else { DisplayValue(&quot;错误&quot;); } if (!blnEqualOccurred) { strPrevOp = strOpPressed; decHistValue = decCurrValue; blnNumPressed = 假； blnEqualOccurred = 真； strOpPressed = string.Empty; } } 休息; case &quot;btnSign&quot;: GetValueDecimal(txtEdit.Text, out decCurrValue); DisplayValue(GetValueString(-1 * decCurrValue));休息; } }}\nstrDrCr = chkCredits.Checked &amp;&amp; chkDebits.Checked ? string.Empty : chkDebits.Checked ？ “D”：chkCredits.Checked ？ “C”：“N”； if (strDefaultVals == strNowVals &amp;&amp; (dsTranHist == null ? true : dsTranHist.Tables.Count == 0 ? true : dsTranHist.Tables[0].Rows.Count == 0 ? true : false))演示了 StringBuilder 的典型误用。请注意程序员如何在循环中连接字符串，然后将结果字符串附加到 StringBuilder： private string CreateGridString(){ string strTemp = string.Empty; StringBuilder strBuild = new StringBuilder(); foreach (DataGridViewRow dgrRow in dgvAcctHist.Rows) { strTemp = ((DataRowView)dgrRow.DataBoundItem)[&quot;Hst_chknum&quot;].ToString().PadLeft(8, &#39; &#39;); strTemp += &quot; &quot;; strTemp += Convert.ToDateTime(((DataRowView)dgrRow.DataBoundItem)[&quot;Hst_trandt&quot;]).ToString(&quot;MM/dd/yyyy&quot;); strTemp += &quot; &quot;; strTemp += ((DataRowView)dgrRow.DataBoundItem)[&quot;Hst_DrAmount&quot;].ToString().PadLeft(15, &#39; &#39;); strTemp += &quot; &quot;; strTemp += ((DataRowView)dgrRow.DataBoundItem)[&quot;Hst_CrAmount&quot;].ToString().PadLeft(15, &#39; &#39;); strTemp += &quot; &quot;; strTemp += ((DataRowView)dgrRow.DataBoundItem)[&quot;Hst_trancd&quot;].ToString().PadLeft(4, &#39; &#39;); strTemp += &quot; &quot;; strTemp += GetDescriptionString(((DataRowView)dgrRow.DataBoundItem)[&quot;Hst_desc&quot;].ToString(), 30, 62); strBuild.AppendLine(strTemp); } strCreateGridString = strBuild.ToString(); return strCreateGridString;//strBuild.ToString();} 表上不存在主键、索引或外键约束，几乎所有字段都是 varchar(50) 类型，并且 100% 的字段可以为空。有趣的是，位域不用于存储布尔数据；相反，使用了 char(1) 字段，字符“Y”和“N”分别用于表示真和假。 ALTER PROCEDURE [dbo].[Get_TransHist] ( @TellerID int = null, @CashDrawer int = null, @AcctNum bigint = null, @StartDate datetime = null, @EndDate datetime = null, @StartTranAmt decimal(18,2) = null , @EndTranAmt decimal(18,2) = null, @TranCode int = null, @TranType int = null )AS 声明@WhereCond Varchar(1000) 声明@strQuery Varchar(2000) Set @WhereCond = &#39; &#39; Set @strQuery = &#39; &#39; 如果不是@TellerID 为null Set @WhereCond = @WhereCond + &#39; AND TT.TellerID = &#39; + Cast(@TellerID as varchar) 如果不是@CashDrawer 为null Set @WhereCond = @WhereCond + &#39; AND TT.CDId = &#39; + Cast(@CashDrawer as varchar) 如果不是 @AcctNum 为 null Set @WhereCond = @WhereCond + &#39; AND TT.AcctNbr = &#39; + Cast(@AcctNum as varchar) 如果不是 @StartDate 为 null Set @WhereCond = @WhereCond + &#39; AND Convert(varchar,TT.PostDate,121) &gt;= &#39;&#39;&#39; + Convert(varchar,@StartDate,121) + &#39;&#39;&#39;&#39; 如果不是 @EndDate 为 null Set @WhereCond = @WhereCond + &#39; AND Convert(varchar,TT .PostDate,121) &lt;= &#39;&#39;&#39; + Convert(varchar,@EndDate,121) + &#39;&#39;&#39;&#39; 如果不是@TranCode为 null Set @WhereCond = @WhereCond + &#39; AND TT.TranCode = &#39; + Cast(@TranCode as varchar) 如果不是 @EndTranAmt 为 null Set @WhereCond = @WhereCond + &#39; AND TT.TranAmt &lt;= &#39; + Cast(@EndTranAmt as varchar) 如果不是 @StartTranAmt 为 null Set @WhereCond = @WhereCond + &#39; AND TT.TranAmt &gt;= &#39; + Cast(@StartTranAmt as varchar) 如果不是 (@TranType is null or @TranType = -1) Set @WhereCond = @WhereCond + &#39; AND TT.DocType = &#39; + Cast(@TranType as varchar) -- 根据过滤器获取柜员交易记录 Set @strQuery = &#39;SELECT TT.TranAmt as [Transaction Amount], TT.TranCode as [Transaction Code], RTrim(LTrim(TT.TranDesc)) 作为[交易描述], TT.AcctNbr 作为[账号], TT.TranID 作为[交易编号], Convert(varchar,TT.ActivityDateTime,101) 作为[活动日期] ], Convert(varchar,TT.EffDate,101) 为[生效日期], Convert(varchar,TT.PostDate,101) 为[发布日期], Convert(varchar,TT.ActivityDateTime,108) 为[时间], TT .BatchID, TT.ItemID, isnull(TT.DocumentID, 0) as DocumentID, TT。 TellerName, TT.CDId, TT.ChkNbr, RTrim(LTrim(DT.DocTypeDescr)) as DocTypeDescr, (CASE WHEN TT.TranMode = &#39;&#39;F&#39;&#39; THEN &#39;&#39;Offline&#39;&#39; ELSE &#39;&#39;Online&#39;&#39; END) TranMode, DispensedYN FROM TellerTrans TT WITH (NOLOCK) LEFT OUTER JOIN DocumentTypes DT WITH (NOLOCK) on DocType = DocumentType WHERE IsNull(TT.DeletedYN, 0) = 0 &#39; + @WhereCond + &#39; Order By BatchId, TranID, ItemID&#39; Exec (@strQuery) ) 尽管如此，这个 130,000 行应用程序的最大问题是：没有单元测试。\n10 令人沮丧的是，在某个地方，一些编写代码的程序员认为他们做得很好，并在他的简历上炫耀。 “不熟练而且不知道它”——塞尔吉奥·阿科斯塔，嘿，你写的这段代码，我认为它很好，如果你认为自己做得更好，你应该尝试——贝斯卡 一些管理历史的淡化版本最终出现在 DailyWTF 上今天：thedailywtf.com/Articles/eTeller-Horror.aspx – Juliet 4 LOL – 这就像用透明信封分发工资单、银行对账单等。 :-) – 克里斯蒂安·海特·约奇。我曾经在商业网络应用程序的数据库中发现了看起来很好散列的密码。原来它们只是存储在 VARBINARY 列中的纯文本，因此您乍一看无法分辨。 - 马特·吉布森说来悲哀，这基本上在我继承了一个项目的密码加密。尽管他们旧的自定义编写的 base64 编码函数做错了，所以我想这有什么好处 ;-) – Allbite 在一个接受信用卡付款的系统中，我们过去常常存储完整的信用卡号码以及姓名、到期日期等。\n事实证明这是非法的，鉴于我们当时正在为司法部编写程序，这具有讽刺意味。 5 有谁知道亚马逊是如何解决这个问题的？或者如果您要求用户许可是否合法？ – Davy Landman @Davy – 加密。如果它是加密的并且只能在需要知道的情况下访问，则存储是合法的。有很多关于强度、保留、DMZ 等的规则，请参阅此处 pcisecuritystandards.org/security_standards/pci_dss.shtml – Luke Schafer 5 好消息是有一个 FIXME，因此 IDE 可以将您引导至该行。 – Josh Lee @Chadworthington：如果是故意的，评论应该是 /* DON&#39;T FIXME！ */ ;P – David 在构建商业版本时，这种东西不是被编译器优化了吗？ – Attila Kun 在这种情况下，编译器没有“优化”循环；它会“优化”什么？此外，“故意破坏”是一个确定的可能性。 “FIXME”可能是为了否认。 – 杜尔高拱门\n（在我意识到它们不是同一个变量之前，我真的花了一个小时试图弄清楚它是如何工作的）包含 50 个文件，每个文件包含 50 个文件，并且内容以有条件和不可预测的方式在所有 50 个文件中线性/程序地执行.现在考虑 $x 包含来自您的 URL 的值（ register globals magic ），因此在您的代码中没有任何地方很明显您使用的是哪个变量，因为它全部由 url 决定。现在考虑当该变量的内容可以是网站用户指定的 url 时会发生什么。是的，这对您来说可能没有意义，但它会创建一个名为该 url 的变量，即：除了不能直接访问之外，您必须通过上面的双 $ 技术使用它。此外，当用户可以在 URL 上指定一个变量来指示要包含哪个文件时，有一些讨厌的技巧，例如“evilcode.php”打印其代码明文，并且 Php 没有得到适当的保护，php 只会被淘汰，下载 evilcode.php，并以 Web 服务器的用户身份执行它。\n网络服务器会给它所有的权限等等，允许 shell 调用，下载任意二进制文件并运行它们等等，直到最终你想知道为什么你的盒子用完了磁盘空间，一个目录有 8GB 的​​盗版电影意大利语配音，通过机器人在 IRC 上共享。我很庆幸我在运行攻击的脚本决定做一些非常危险的事情之前发现了暴行，比如从或多或少不安全的数据库中获取极其机密的信息：| （我可以用那个代码库在 6 个月的时间里每天娱乐 Dailywtf，我没有骗你。很遗憾我在我逃脱了那个代码之后发现了 Dailywtf） 3 “我很庆幸我在脚本决定之前发现了暴行收获数据库:|&quot;你怎么知道的？对于所有密集的海豚，它可能已经在没有人注意到的情况下这样做了...... – Piskvor 离开了建筑物 它可能已经这样做了，但数据库日志并没有表明它做了多少。 – Kent Fredric 在主项目头文件中，来自一位老手 COBOL 程序员，他莫名其妙地用 C 编写了一个编译器：“所以如果你忘记声明你的循环变量，你就不会得到编译器错误。”\n0 3 只要您使用正确的工具来构建包 (WiX)，这还不错。然而，VS 编辑器和 InstallShield 是邪恶的——erikkallen 这篇文章如何编写不可维护的代码涵盖了一些人类已知的最出色的技术。我最喜欢的一些是： 购买一本婴儿命名书，您永远不会对可变名称感到茫然。 Fred 是一个美妙的名字，而且很容易打字。如果您正在寻找易于输入的变量名称，如果您使用 DSK 键盘输入，请尝试使用 adsf 或 aoeu。如果您必须使用描述性变量和函数名称，请拼错它们。通过在某些函数和变量名称中拼错并在其他中正确拼写（例如 SetPintleOpening SetPintalClosing），我们有效地否定了 grep 或 IDE 搜索技术的使用。它工作得非常好。通过在不同的剧院/剧院拼写 tory 或 tori 来添加国际风味。在命名函数和变量时，大量使用抽象词，如 it、everything、data、handle、stuff、do、routine、perform 和数字，例如routineX48、PerformDataFunction、DoIt、HandleStuff 和 do_args_method。将单词中间的音节的第一个字母随机大写。例如 ComputeRasterHistoGram()。\n使用小写 l 表示长常量。例如，10l 更可能被误认为是 101，而不是 10l。禁止任何明显消除 uvw wW gq9 2z 5s il17|!j oO08 `&#39;&quot; ;,. m nn rn {[()]} 歧义的字体。要有创意。只要范围规则允许，重复使用现有的不相关变量名称。类似地，使用相同的临时变量用于两个不相关的目的（声称是为了节省堆栈槽）。对于一个恶魔变体，将变量变形，例如，在很长的方法顶部为变量赋值，然后在中间的某处更改以微妙的方式了解变量的含义，例如将其从基于 0 的坐标转换为基于 1 的坐标。一定不要记录这种含义的变化。在变量或方法名称中使用缩写时，用同一个词的几种变体，甚至偶尔拼写出来。这有助于打败那些使用文本搜索只理解程序的某些方面的懒惰的流浪汉。考虑将变体拼写作为策略的变体，例如混合国际颜色, 带有美国色彩和花花公子的酷乐rz。如果您完整地拼出姓名，则每个姓名只有一种可能的拼写方式。这些对于维护程序员来说太容易记住了。因为有很多不同的方式来缩写一个词，通过缩写，你可以有几个不同的变量，它们都具有相同的明显目的。作为额外的好处，维护程序员甚至可能不会注意到它们是单独的变量。使用诸如 LancelotsFavouriteColour 之类的常量名称而不是蓝色，并将其指定为 $0204FB 的十六进制值。颜色看起来不错......", "note_en": "What is the most evil or dangerous code fragment you have ever seen in a production environment at a company? I&#39;ve never encountered production code that I would consider to be deliberately malicious and evil, so I&#39;m quite curious to see what others have found.\n The most dangerous code I have ever seen was a stored procedure two linked-servers away from our core production database server. The stored procedure accepted any NVARCHAR(8000) parameter and executed the parameter on the target production server via an double-jump sp_executeSQL command. That is to say, the sp_executeSQL command executed another sp_executeSQL command in order to jump two linked servers. Oh, and the linked server account had sysadmin rights on the target production server.\n  1\n    I&#39;ve written about one application I&#39;ve worked on before  here and  here. To put it simply, my company inherited 130,000 lines of garbage from India. The application was written in C#; it was a teller app, the same kind of software tellers use behind the counter whenever you go to the bank. The app crashed 40-50 times a day, and it simply couldn&#39;t be refactored into working code. My company had to re-write the entire app over the course of 12 months.\n Why is this application evil? Because the sight of the source code was enough to drive a sane man mad and a mad man sane. The twisted logic used to write this application could have only been inspired by a Lovecraftian nightmare. Unique features of this application included:\n Out of 130,000 lines of code, the entire application contained 5 classes (excluding form files). All of these were public static classes. One class was called Globals.cs, which contained 1000s and 1000s and 1000s of public static variables used to hold the entire state of the application. Those five classes contained 20,000 lines of code total, with the remaining code embedded in the forms.\n You have to wonder, how did the programmers manage to write such a big application without any classes? What did they use to represent their data objects? It turns out the programmers managed to re-invent half of the concepts we all learned about OOP simply by combining ArrayLists, HashTables, and DataTables. We saw a lot of this:\n  Keep in mind, none of the data structures above are strongly typed, so you have to cast whatever mystery object you get out of the list to the correct type. It&#39;s amazing what kind of complex, Rube Goldberg-like data structures you can create using just ArrayLists, HashTables, and DataTables.\n To share an example of how to use the object model detailed above, consider Accounts: the original programmer created a seperate HashTable for each concievable property of an account: a HashTable called hstAcctExists, hstAcctNeedsOverride, hstAcctFirstName. The keys for all of those hashtables was a “|” separated string. Conceivable keys included “123456|DDA”, “24100|SVG”, “100|LNS”, etc.\n Since the state of the entire application was readily accessible from global variables, the programmers found it unnecessary to pass parameters to methods. I&#39;d say 90% of methods took 0 parameters. Of the few which did, all parameters were passed as strings for convenience, regardless of what the string represented.\n Side-effect free functions did not exist. Every method modified 1 or more variables in the Globals class. Not all side-effects made sense; for example, one of the form validation methods had a mysterious side effect of calculating over and short payments on loans for whatever account was stored Globals.lngAcctNum.\n Although there were lots of forms, there was one form to rule them all: frmMain.cs, which contained a whopping 20,000 lines of code. What did frmMain do? Everything. It looked up accounts, printed receipts, dispensed cash, it did everything.\n Sometimes other forms needed to call methods on frmMain. Rather than factor that code out of the form into a seperate class, why not just invoke the code directly:\n As bad as it already is creating an invisible form to perform business logic, how do you think the form knew which account to look up? That’s easy: the form could access Globals.lngAcctNum and Globals.strAcctType. (Who doesn&#39;t love Hungarian notation?)\n Code-reuse was a synonym for ctrl-c, ctrl-v. I found 200-line methods copy/pasted across 20 forms.\n The application had a bizarre threading model, something I like to call the thread-and-timer model: each form that spawned a thread had a timer on it. Each thread that was spawned kicked off a timer which had a 200 ms delay; once the timer started, it would check to see if the thread had set some magic boolean, then it would abort the thread. The resulting ThreadAbortException was swallowed.\n You&#39;d think you&#39;d only see this pattern once, but I found it in at least 10 different places.\n Speaking of threads, the keyword &#34;lock&#34; never appeared in the application. Threads manipulated global state freely without taking a lock.\n Every method in the application contained a try/catch block. Every exception was logged and swallowed.\n  Some genius figured out that you can hook multiple form controls up to the same event handler. How did the programmer handle this?\n private void OperationButton_Click(object sender, EventArgs e){ Button btn = (Button)sender; if (blnModeIsAddMc) { AddMcOperationKeyPress(btn); } else { string strToBeAppendedLater = string.Empty; if (btn.Name != &#34;btnBS&#34;) { UpdateText(); } if (txtEdit.Text.Trim() != &#34;Error&#34;) { SaveFormState(); } switch (btn.Name) { case &#34;btnC&#34;: ResetValues(); break; case &#34;btnCE&#34;: txtEdit.Text = &#34;0&#34;; break; case &#34;btnBS&#34;: if (!blnStartedNew) { string EditText = txtEdit.Text.Substring(0, txtEdit.Text.Length - 1); DisplayValue((EditText == string.Empty) ? &#34;0&#34; : EditText); } break; case &#34;btnPercent&#34;: blnAfterOp = true; if (GetValueDecimal(txtEdit.Text, out decCurrValue)) { AddToTape(GetValueString(decCurrValue), (string)btn.Text, true, false); decCurrValue = decResultValue * decCurrValue / intFormatFactor; DisplayValue(GetValueString(decCurrValue)); AddToTape(GetValueString(decCurrValue), string.Empty, true, false); strToBeAppendedLater = GetValueString(decResultValue).PadLeft(20) + strOpPressed.PadRight(3); if (arrLstTapeHist.Count == 0) { arrLstTapeHist.Add(strToBeAppendedLater); } blnEqualOccurred = false; blnStartedNew = true; } break; case &#34;btnAdd&#34;: case &#34;btnSubtract&#34;: case &#34;btnMultiply&#34;: case &#34;btnDivide&#34;: blnAfterOp = true; if (txtEdit.Text.Trim() == &#34;Error&#34;) { btnC.PerformClick(); return; } if (blnNumPressed || blnEqualOccurred) { if (GetValueDecimal(txtEdit.Text, out decCurrValue)) { if (Operation()) { AddToTape(GetValueString(decCurrValue), (string)btn.Text, true, true); DisplayValue(GetValueString(decResultValue)); } else { AddToTape(GetValueString(decCurrValue), (string)btn.Text, true, true); DisplayValue(&#34;Error&#34;); } strOpPressed = btn.Text; blnEqualOccurred = false; blnNumPressed = false; } } else { strOpPressed = btn.Text; AddToTape(GetValueString(0), (string)btn.Text, false, false); } if (txtEdit.Text.Trim() == &#34;Error&#34;) { AddToTape(&#34;Error&#34;, string.Empty, true, true); btnC.PerformClick(); txtEdit.Text = &#34;Error&#34;; } break; case &#34;btnEqual&#34;: blnAfterOp = false; if (strOpPressed != string.Empty || strPrevOp != string.Empty) { if (GetValueDecimal(txtEdit.Text, out decCurrValue)) { if (OperationEqual()) { DisplayValue(GetValueString(decResultValue)); } else { DisplayValue(&#34;Error&#34;); } if (!blnEqualOccurred) { strPrevOp = strOpPressed; decHistValue = decCurrValue; blnNumPressed = false; blnEqualOccurred = true; } strOpPressed = string.Empty; } } break; case &#34;btnSign&#34;: GetValueDecimal(txtEdit.Text, out decCurrValue); DisplayValue(GetValueString(-1 * decCurrValue)); break; } }}\n strDrCr = chkCredits.Checked &amp;&amp; chkDebits.Checked ? string.Empty : chkDebits.Checked ? &#34;D&#34; : chkCredits.Checked ? &#34;C&#34; : &#34;N&#34;;\n  if (strDefaultVals == strNowVals &amp;&amp; (dsTranHist == null ? true : dsTranHist.Tables.Count == 0 ? true : dsTranHist.Tables[0].Rows.Count == 0 ? true : false))\n Here&#39;s a code snippet which demonstrates the typical misuse of the StringBuilder. Note how the programmer concats a string in a loop, then appends the resulting string to the StringBuilder:\n private string CreateGridString(){ string strTemp = string.Empty; StringBuilder strBuild = new StringBuilder(); foreach (DataGridViewRow dgrRow in dgvAcctHist.Rows) { strTemp = ((DataRowView)dgrRow.DataBoundItem)[&#34;Hst_chknum&#34;].ToString().PadLeft(8, &#39; &#39;); strTemp += &#34; &#34;; strTemp += Convert.ToDateTime(((DataRowView)dgrRow.DataBoundItem)[&#34;Hst_trandt&#34;]).ToString(&#34;MM/dd/yyyy&#34;); strTemp += &#34; &#34;; strTemp += ((DataRowView)dgrRow.DataBoundItem)[&#34;Hst_DrAmount&#34;].ToString().PadLeft(15, &#39; &#39;); strTemp += &#34; &#34;; strTemp += ((DataRowView)dgrRow.DataBoundItem)[&#34;Hst_CrAmount&#34;].ToString().PadLeft(15, &#39; &#39;); strTemp += &#34; &#34;; strTemp += ((DataRowView)dgrRow.DataBoundItem)[&#34;Hst_trancd&#34;].ToString().PadLeft(4, &#39; &#39;); strTemp += &#34; &#34;; strTemp += GetDescriptionString(((DataRowView)dgrRow.DataBoundItem)[&#34;Hst_desc&#34;].ToString(), 30, 62); strBuild.AppendLine(strTemp); } strCreateGridString = strBuild.ToString(); return strCreateGridString;//strBuild.ToString();}\n No primary keys, indexes, or foreign key constraints existed on tables, nearly all fields were of type varchar(50), and 100% of fields were nullable. Interestingly, bit fields were not used to store boolean data; instead a char(1) field was used, and the characters &#39;Y&#39; and &#39;N&#39; used to represent true and false respectively.\n ALTER PROCEDURE [dbo].[Get_TransHist] ( @TellerID int = null, @CashDrawer int = null, @AcctNum bigint = null, @StartDate datetime = null, @EndDate datetime = null, @StartTranAmt decimal(18,2) = null, @EndTranAmt decimal(18,2) = null, @TranCode int = null, @TranType int = null )AS declare @WhereCond Varchar(1000) declare @strQuery Varchar(2000) Set @WhereCond = &#39; &#39; Set @strQuery = &#39; &#39; If not @TellerID is null Set @WhereCond = @WhereCond + &#39; AND TT.TellerID = &#39; + Cast(@TellerID as varchar) If not @CashDrawer is null Set @WhereCond = @WhereCond + &#39; AND TT.CDId = &#39; + Cast(@CashDrawer as varchar) If not @AcctNum is null Set @WhereCond = @WhereCond + &#39; AND TT.AcctNbr = &#39; + Cast(@AcctNum as varchar) If not @StartDate is null Set @WhereCond = @WhereCond + &#39; AND Convert(varchar,TT.PostDate,121) &gt;= &#39;&#39;&#39; + Convert(varchar,@StartDate,121) + &#39;&#39;&#39;&#39; If not @EndDate is null Set @WhereCond = @WhereCond + &#39; AND Convert(varchar,TT.PostDate,121) &lt;= &#39;&#39;&#39; + Convert(varchar,@EndDate,121) + &#39;&#39;&#39;&#39; If not @TranCode is null Set @WhereCond = @WhereCond + &#39; AND TT.TranCode = &#39; + Cast(@TranCode as varchar) If not @EndTranAmt is null Set @WhereCond = @WhereCond + &#39; AND TT.TranAmt &lt;= &#39; + Cast(@EndTranAmt as varchar) If not @StartTranAmt is null Set @WhereCond = @WhereCond + &#39; AND TT.TranAmt &gt;= &#39; + Cast(@StartTranAmt as varchar) If not (@TranType is null or @TranType = -1) Set @WhereCond = @WhereCond + &#39; AND TT.DocType = &#39; + Cast(@TranType as varchar) --Get the Teller Transaction Records according to the filters Set @strQuery = &#39;SELECT TT.TranAmt as [Transaction Amount], TT.TranCode as [Transaction Code], RTrim(LTrim(TT.TranDesc)) as [Transaction Description], TT.AcctNbr as [Account Number], TT.TranID as [Transaction Number], Convert(varchar,TT.ActivityDateTime,101) as [Activity Date], Convert(varchar,TT.EffDate,101) as [Effective Date], Convert(varchar,TT.PostDate,101) as [Post Date], Convert(varchar,TT.ActivityDateTime,108) as [Time], TT.BatchID, TT.ItemID, isnull(TT.DocumentID, 0) as DocumentID, TT.TellerName, TT.CDId, TT.ChkNbr, RTrim(LTrim(DT.DocTypeDescr)) as DocTypeDescr, (CASE WHEN TT.TranMode = &#39;&#39;F&#39;&#39; THEN &#39;&#39;Offline&#39;&#39; ELSE &#39;&#39;Online&#39;&#39; END) TranMode, DispensedYN FROM TellerTrans TT WITH (NOLOCK) LEFT OUTER JOIN DocumentTypes DT WITH (NOLOCK) on DocType = DocumentType WHERE IsNull(TT.DeletedYN, 0) = 0 &#39; + @WhereCond + &#39; Order By BatchId, TranID, ItemID&#39; Exec (@strQuery)\n With all that said, the single biggest problem with this 130,000 line application this: no unit tests.\n  10  And the depressing thing is that somewhere, some programmer that worked on that code, thinks they did a good job and is showing it off on his resume. &#34;Unskilled and Unaware of it&#34;\r \r–  Sergio Acosta\n  hey you i writted this code adn i think its prety good if you think you cuold do better you shoud try\r \r–  Beska\n  A very watered down version of some of the management history ended up on the DailyWTF today:  thedailywtf.com/Articles/eTeller-Horror.aspx\r \r–  Juliet\n      4  LOL - that&#39;s like handing out payslips, bank statements etc in transparent envelopes. :-)\r \r–  Christian Hayter\n    Yowch. I found what looked like nicely-hashed passwords in a commercial web app&#39;s database once. Turned out they were just plain text stored in a VARBINARY column so you couldn&#39;t tell at first glance.\r \r–  Matt Gibson\n  Sad to say, that&#39;s basically the password encryption in a project I inherited. Albeit their old custom written base64 encoding function did it wrong, so I guess there&#39;s solice in that ;-)\r \r–  Allbite\n    In a system which took credit card payments we used to store the full credit card number along with name, expiration date etc.\n Turns out this is illegal, which is ironic given the we were writing the program for the Justice Department at the time.\n  5  Does anybody know how amazon solves this problem? Or is it legal if you ask for the users permission?\r \r–  Davy Landman\n      @Davy - encryption. It&#39;s legal to store if it&#39;s encrypted and only accessible on need-to-know. There are lots of rules about strength, retention, DMZs etc, see here  pcisecuritystandards.org/security_standards/pci_dss.shtml\r \r–  Luke Schafer\n      5  Good thing there was a FIXME so the IDE could direct you to that line.\r \r–  Josh Lee\n  @Chadworthington: If it was intentional the comment would have been /* DON&#39;T FIXME! */ ;P\r \r–  David\n  Isn&#39;t this kind of thing optimized out by compilers when building a commercial release?\r \r–  Attila Kun\n  In this situation the compiler did not &#34;optimize out&#34; the loop; what would it &#34;optimize&#34; to? Also, &#34;intentional sabotage&#34; was a definite possibility. The &#34;FIXME&#34; could have been for deniability.\r \r–  Dour High Arch\n    ( I literally spent an hour trying to work out how that worked before I realised they  wern&#39;t the same variable )\n Include 50 files, which each include 50 files, and stuff is performed linearly/procedurally across all 50 files in conditional and unpredictable ways.\n   Now consider $x contains a value from your URL ( register globals magic ), so nowhere in your code is it obvious what variable your working with becuase its all determined by the url.\n Now consider what happens when the contents of that variable can be a url specified by the websites user. Yes, this may not make sense to you, but it creates a variable named that url, ie:\n  except it cant be directly accessed, you have to use it via the double $ technique above.\n Additionally, when its possible for a user to specify a variable on the URL which indicates which file to include, there are nasty tricks like\n   and &#39;evilcode.php&#39; prints its code plaintext, and Php is inappropriately secured, php will just trundle off, download evilcode.php, and execute it as the user of the web-server.\n The web-sever will give it all its permissions etc, permiting shell calls, downloading arbitrary binaries and running them, etc etc, until eventually you wonder why you have a box running out of disk space, and one dir has 8GB of pirated movies with italian dubbing, being shared on IRC via a bot.\n I&#39;m just thankful I discovered that atrocity before the script running the attack decided to do something really dangerous like harvest extremely confidential information from the more or less unsecured database :|\n ( I could entertain the dailywtf every day for 6 months with that codebase, I kid you not. Its just a shame I discovered the dailywtf after I escaped that code )\n  3  &#34;I&#39;m just thankful I discovered that atrocity before the script decided to harvest the database :|&#34; How would you know? For all intensive porpoises, it may already have done that without anyone noticing...\r \r–  Piskvor left the building\n  It may have, but the database logs didn&#39;t indicate much that it did.\r \r–  Kent Fredric\n    In the main project header file, from an old-hand COBOL programmer, who was inexplicably writing a compiler in C:\n  &#34;So you won&#39;t get a compiler error if you forget to declare your loop variables.&#34;\n  0\n    3  It&#39;s not so bad as long as you use the correct tools to build the package (WiX). The VS editor, and InstallShield, are evil, though\r \r–  erikkallen\n    This article  How to Write Unmaintainable Code covers some of the most brilliant techniques known to man. Some of my favorite ones are:\n   Buy a copy of a baby naming book and you&#39;ll never be at a loss for variable names. Fred is a wonderful name, and easy to type. If you&#39;re looking for easy-to-type variable names, try adsf or aoeu if you type with a DSK keyboard.\n  If you must use descriptive variable and function names, misspell them. By misspelling in some function and variable names, and spelling it correctly in others (such as SetPintleOpening SetPintalClosing) we effectively negate the use of grep or IDE search techniques. It works amazingly well. Add an international flavor by spelling tory or tori in different theatres/theaters.\n  In naming functions and variables, make heavy use of abstract words like it, everything, data, handle, stuff, do, routine, perform and the digits e.g. routineX48, PerformDataFunction, DoIt, HandleStuff and do_args_method.\n  Randomly capitalize the first letter of a syllable in the middle of a word. For example ComputeRasterHistoGram().\n  Use lower case l to indicate long constants. e.g. 10l is more likely to be mistaken for 101 that 10L is. Ban any fonts that clearly disambiguate uvw wW gq9 2z 5s il17|!j oO08 `&#39;&#34; ;,. m nn rn {[()]}. Be creative.\n  Wherever scope rules permit, reuse existing unrelated variable names. Similarly, use the same temporary variable for two unrelated purposes (purporting to save stack slots). For a fiendish variant, morph the variable, for example, assign a value to a variable at the top of a very long method, and then somewhere in the middle, change the meaning of the variable in a subtle way, such as converting it from a 0-based coordinate to a 1-based coordinate. Be certain not to document this change in meaning.\n  When using abbreviations inside variable or method names, break the boredom with several variants for the same word, and even spell it out longhand once in while. This helps defeat those lazy bums who use text search to understand only some aspect of your program. Consider variant spellings as a variant on the ploy, e.g. mixing International colour, with American color and dude-speak kulerz. If you spell out names in full, there is only one possible way to spell each name. These are too easy for the maintenance programmer to remember. Because there are so many different ways to abbreviate a word, with abbreviations, you can have several different variables that all have the same apparent purpose. As an added bonus, the maintenance programmer might not even notice they are separate variables.\n  Use constant names like LancelotsFavouriteColour instead of blue and assign it hex value of $0204FB. The color looks iden\n......", "posttime": "2021-08-08 21:50:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,生产,code,quot", "title": "您在生产中见过的最邪恶的代码是什么？", "title_en": "What is the most EVIL code you have ever seen in production?", "transed": 1, "url": "https://stackoverflow.com/questions/434414/what-is-the-most-evil-code-you-have-ever-seen-in-a-production-enterprise-environ", "via": "", "real_tags": ["代码", "生产", "code", "quot"]}, {"category": "", "categoryclass": "", "imagename": "9c198ae4180f01f9f3651ce4f301a6c0.jpg", "infoid": 1072111, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "群体机器人是一个相对较新且极具前景的研究领域，需要开发可以一起移动和完成任务的多机器人团队。机器人群可以有许多有价值的应用。例如，它们可以在搜索和救援任务中为人类提供支持，或者允许他们监视难以进入的地理区域。 Fraunhofer FKIE 和德国波恩大学的研究人员最近设计了一种理论结构，可以指导自组织群系统的发展。该结构在 Sage 的 Adaptive Behavior 期刊上发表的一篇论文中提出，为人与群交互提供了一个新的整体视角，该团队将其称为“联合人-群循环”。 “我们专注于研究人与群交互的机器人技术子领域，”进行这项研究的研究人员之一乔纳斯 D.哈斯巴赫告诉 TechXplore。 “到目前为止，对于我们如何最好地设计未来的人与群交互，还没有普遍的看法。我们这篇文章的目的是为研究界提供一个理论基础，一种思维方式，可以将人类中的孤立解决方案联系起来——群互动。”当研究人员试图为在现实世界环境中表现良好的人与群交互设计“循环”时，理想情况下，他们应该全面考虑这些交互。例如，指定人类如何向机器人群发出他们的意图是不够的，方法还应该考虑机器人群如何向人类用户提供反馈。 “我们从理论的角度提出问题，在复杂世界的背景下，我们如何将人类认知的好处与自组织机器人群的好处结合起来，”哈斯巴赫说。 “这导致了一个受生物启发的设计隐喻，即群体放大的人类，它本质上提出群体应该自我组织成人体并像人体一样行事。我们假设这种观点可能是设计人类的一个很好的隐喻-能够处理现实世界动态的群循环。”在机器人群作为人类的延伸（即通过覆盖他们无法覆盖的区域来帮助人类完成任务）的情况下，这组研究人员引入的设计隐喻可用于导航人类复杂的设计空间。群互动。这可能会导致开发更高效且可应用于更复杂场景的人类集群系统。 “例如，我们可以询问真实的身体部位控制感觉如何，并将其映射到人群界面设计上，”哈斯巴赫解释道。 “当你走在街上时，你有多少次有意识地考虑你的腿部运动？可能没有那么频繁。从进化的角度来看，这是有道理的；陈规定型的身体控制由神经子系统负责，以便有意识的认知系统可以处理更多复杂的世界动态。” Hasbach 和他的同事的论文强调了使用人类状态分类作为提供给机器人群的控制输入的潜在好处，而不是让人类用户始终控制群。研究人员引入的设计比喻也可以作为有时被称为“群体认知”的发展的灵感。这是生物群（例如蚂蚁、鸟类）和大脑共享类似的自组织原则的想法，这些原则导致认知和决策。\n“群体认知”的思想还没有在工程的背景下进行探索。研究人员的工作可以为开发受大脑和生物群启发的机器人群开辟有趣的可能性。 “设计作为人体延伸的机器人群涉及在网络级别将神经逻辑集成到机器人群中，到目前为止，这仅受到有限的关注，”哈斯巴赫说。 “我们已经提出了一些关于如何被视为神经系统的想法。”未来，这组研究人员设计的理论方法可以激发新系统的开发，使人类和成群的​​机器人之间能够有效交互。在他们的论文中，Hasbach 和他的同事们还展示了一个有趣实验的结果，该实验展示了如何将一个群体视为一个自组织的界面。 “到目前为止，我们的概念纯属理论性质，但我们目前正在实施原型，以便我们可以凭经验研究群体放大的人类，”哈斯巴赫说。 “这将用于更新群体放大的人类，作为关于如何设计人与群体交互的科学理论。”引文：一种设计自组织人类群系统的理论方法（2021 年，8 月 5 日），2021 年 8 月 8 日检索自 https://techxplore.com/news/2021-08-theoretical-approach-self-organizing-human- swarm.html 本文档受版权保护。除了出于私人学习或研究目的的任何公平交易外，未经书面许可，不得复制任何部分。内容仅供参考。", "note_en": "Swarm robotics is a relatively new and highly promising research field, which entails the development of multi-robot teams that can move and complete tasks together. Robot swarms could have numerous valuable applications. For instance, they could support humans during search and rescue missions or allow them to monitor geographical areas that are difficult to access.    Researchers at Fraunhofer FKIE and University of Bonn in Germany have recently devised a theoretical construct that could guide the development of self-organizing  -swarm systems. This construct, presented in a paper published in Sage&#39;s Adaptive Behavior journal, provides a new holistic perspective to human-swarm interaction, which the team refers to as &#34;joint human-swarm loops.&#34;\n  &#34;We focus on the subfield of robotics that investigates human-swarm interaction,&#34; Jonas D. Hasbach, one of the researchers who carried out the study, told TechXplore. &#34;So far, there exists no general perspective on how we could best design future human-swarm interactions. The aim of our article was to provide the research community with a theoretical base, a way of thinking, that can relate isolated solutions in human-swarm interaction.&#34;\n  When researchers are trying to design &#34;loops&#34; for human-swarm interactions that perform well in real-world settings, they should ideally consider these interactions in their totality. For instance, specifying how humans may signal their intent to a robot swarm is not enough and approaches should also consider how the robot swarm can offer feedback to human users.\n  &#34;We asked from a theoretical point of view how we could join the benefits of human cognition with the benefits of self-organizing robot swarms in the context of a complex world,&#34; Hasbach said. &#34;This led to a bio-inspired metaphor for design, the swarm-amplified human, which essentially proposes that the swarm should self-organize itself into and act like human body parts. We hypothesize that this view may be a good metaphor for designing human-swarm loops that are capable of dealing with real-world dynamics.&#34;\n  In situations where a robot swarm acts as an extension of humans (i.e., helping humans to complete a task by covering areas they cannot cover), the design metaphor introduced by this team of researchers could be used to navigate the complex design space of human-swarm interactions. This could lead to the development of human-swarm systems that are more efficient and can be applied in more complex scenarios.\n   &#34;For example, we can ask how real body part control feels like and map this onto the human-swarm interface design,&#34; Hasbach explained. &#34;How often have you consciously thought about your leg movement when walking down the street? Probably not that often. This makes sense from an evolutionary perspective; stereotypical body control is taken care of by neural subsystems so that the conscious cognitive system can deal with more complex world dynamics.&#34;\n     The paper by Hasbach and his colleagues highlights the potential benefits of using human state classification as a control input fed to a robot swarm, rather than having a human user controlling the swarm at all times. The design metaphor introduced by the researchers could also serve as an inspiration for the development of what is sometimes referred to as &#34;swarm cognition.&#34; This is the idea that biological swarms (e.g., ants, bird folks) and the brain share similar self-organizing principles that lead to cognition and decision making.\n  The idea of &#34;swarm cognition&#34; has not yet been explored in the context of engineering. The researchers&#39; work could open interesting possibilities for the for the development of robot swarms inspired both by the brain and biological swarms.\n  &#34;Designing robot swarms that are an extension of the human body relates to integrating neural logic into robot swarms on the network level, which has received only limited attention so far,&#34; Hasbach said. &#34;We have proposed some ideas on how   could be thought of as neural systems.&#34;\n  In the future, the theoretical approach devised by this team of researchers could inspire the development of new systems that enable effective interactions between humans and swarms of robots. In their paper, Hasbach and his colleagues also presented the results of an interesting experiment that showed how a   swarm could be considered as a self-organized interface in and of itself.\n  &#34;So far, our concepts are of purely theoretical nature, but we are currently implementing prototypes so that we can empirically investigate the swarm-amplified human,&#34; Hasbach said. &#34;The   will be used to update the swarm-amplified human as a scientific theory on how to design human-swarm interaction.&#34;             Citation: A theoretical approach for designing a self-organizing human-swarm system (2021, August 5) retrieved 8 August 2021 from https://techxplore.com/news/2021-08-theoretical-approach-self-organizing-human-swarm.html\n  This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.", "posttime": "2021-08-08 21:49:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,组织,approach,人类", "title": "一种设计自组织人群系统的理论方法", "title_en": "A theoretical approach for designing a self-organizing human-swarm system", "transed": 1, "url": "https://techxplore.com/news/2021-08-theoretical-approach-self-organizing-human-swarm.html", "via": "", "real_tags": ["设计", "组织", "approach", "人类"]}]