[{"category": "", "categoryclass": "", "imagename": "86f1dfccf357b2fa8e7140fa0c327611.jpg", "infoid": 1072487, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在几年前的求职面试中，面试官请我解释加密，编码和哈希之间的区别。当我为一家专门加密的公司工作时，所以我知道授予的差异。\n与编码不同，加密消息，如Base64-编码的文本“LQNBJA38QFHNITLOKNZDVG ==”完全没用。即使您知道使用的算法，也无法从加密的消息从加密的消息从加密的消息中获取。\nHashing是一种永久地将一个可识别的东西永久转换为统一和简单的方式。喜欢把牛磨成汉堡包 - 你可以始终制作汉堡，但你永远不能把牛再次放在一起。", "note_en": "In a job interview years ago, the interviewer asked me to explain the difference between encryption, encoding, and hashing. At the time I was working for a company that specialized in encryption, so I took knowing the difference for granted.\n It wasn’t until much later that I understood how easily most folks can confuse the three topics for one another. Let’s take a look at each in turn.\n  Encoding is the practice of taking data in one format and converting it to another. There are no secrets involved – the specifications for each format are public, well-documented, and easily implemented everywhere.\n The content of this article is rendered in your browser as either ASCII or UTF-8. What that means is the ones and zeros representing are interpreted in a specific way that converts them into English characters.\n The text “Hi, folks!” is nothing more than ones and zeros, interpreted as ASCII and converted into readable text. You could just as easily encode this data as hex, which would instead be the string “48 69 2C 20 66 6F 6C 6B 73 21.”\n These are completely interchangeable. There’s nothing special or magic about encoding, it’s merely a way to interpret and present the underlying, raw data.\n  With encryption, everything changes. Encryption requires a secret (a key, password, or passphrase) that is used to convert usable data into something indistinguishable from random noise. Given an encrypted message, you can only  decrypt it if you have the original secret.\n Unlike with encoding, an encrypted message, like the base64- encoded text “lqNBja38qFHnITloKNzdVg==,” is entirely useless. There is no way you can get from an encrypted message back to the plain text original, even if you know the algorithm used, without the password.\n If, however, you know this message used AES for encryption. And you know it used “thisisasecret” as the password. Then you can properly decrypt the message and read “Hi, folks!” yet again.\n  Anyone who’s spent any period of time working with encryption has likely used a hashing algorithm as well. Hashes look somewhat like encrypted messages. The underlying algorithms take a piece of plain text and convert it (with or without a key) into something indistinguishable from random noise.\n  These algorithms are one-way. Even if you know the algorithm and any secret keys involved, there is no way to un-hash a string. It’s an entirely destructive operation.\n  The easiest way to remember how these topics differ is with a simple mental model.\n Encoding is a way of translating between different formats. Like converting a Spanish recipe for cake into English.\n Encryption is a way of protecting data behind a secret. Like sealing a box of chocolate in a locked safe so your kids don’t find it.\n Hashing is a way of permanently converting from one recognizable thing to something uniform and simple. Like grinding a cow into a hamburger – you can always make a burger, but you can never put the cow back together again.\n These are rough analogies, but they should help the next time you’re faced with the same interview question.", "posttime": "2022-01-09 22:17:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "加密,hashing", "title": "哈希不是加密", "title_en": "Hashing is not encryption", "transed": 1, "url": "https://eric.mann.blog/hashing-is-not-encryption/", "via": "", "real_tags": ["加密", "hashing"]}, {"category": "", "categoryclass": "", "imagename": "2cf3717162541ad7b03f044d3869e7b3.png", "infoid": 1072486, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "命令行工具和终端JSON Viewer🔥。通过在GitHub上创建帐户，为Antonmedv / FX开发有助于开发。", "note_en": "Command-line tool and terminal JSON viewer 🔥. Contribute to antonmedv/fx development by creating an account on GitHub.", "posttime": "2022-01-09 22:16:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "jq,interactive,工具", "title": "FX：JQ进程JSON的互动替代方案", "title_en": "FX: An interactive alternative to jq to process JSON", "transed": 1, "url": "https://github.com/antonmedv/fx", "via": "", "real_tags": ["jq", "工具"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072485, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2015年，我谈到了一个谈话，我叫做唐纳德·克朗的顾客圣殿的牦牛刮胡子。原因是唐纳德·克坦斯达到了最完美，最漫长的牦牛剃须：Tex。\n但是，TEX做了什么？主要是，它确实是文本布局和几件事。众所周知，Knuth在算法上无法与他自己的算法一起出现，后来与Michael Plass一起出版。算法做了什么？它找到了一个视觉上令人愉悦的方式，在没有发出线条的情况下放置一个页面上的段落，看起来jarring（例如通过调整“胶水”，单词之间的空格）。这是一个很好的解释。\n作为一个副作用，Metafont稍后会进化到通用矢量图纸的Metapost，它具有我仍然错过的许多现代图形描述语言：描述（可寻址）点作为两个其他基元之间的交叉点。\n但大多数情况下，两个大项目涌出。第一个是Leslie Lamport的乳胶。 Lamport是一名非常高效的研究员，以TLA +以正式方法研究着名，也是许多分布式算法的铺设基础。乳胶是基于分离介绍和内容的想法。它围绕文档类的想法，然后描述某个文档的布置方式。想想市场，更复杂。第二个是上下文，远远专注于细粒度的布局控制。\n通过对其历史的理解接近Tex，可以从中吸取很多东西。是的，更换会很棒，但它需要年龄。", "note_en": "In 2015, I gave a talk in which I called  Donald Knuth the Patron Saint of Yak Shaves. The reason is that Donald Knuth achieved the most perfect and long-running yak shave: TeX.\n      The ultimate yak shave is the combination of improbable circumstance, the privilege to be able to shave at your hearts will and the will to follow things through to the end. Here’s the way it was achieved with TeX. The recount is purely mine, inaccurate and obviously there for fun. I’ll avoid the most boring facts that everyone always tells, such as  why Knuth’s checks have their own Wikipedia page.\n      TeX was invented to typeset a book. No plural. It was invented to typeset the second edition of “The Art of Computer Programming”. The second edition had to be typeset again, as “hot type” typesetting, which was used for the first edition, was not available anymore. Being unimpressed by the available options, Knuth decided to write his own system, which later ended up as TeX.\n  But “The Art of Computer Programming” is an impressive book in its own right: it is still unfinished, currently spanning 3.5 volumes (yes, the fourth is unfinished, but the first chapters are released). It was called a book of the century by  American scientist writers.\n    Digging deeper into TAOCP, it already shows the works of a yak shaver destined for greater things. All programs in this book refer to a common assembly language: MIX. Which was invented for the book.\n      The first version of TeX was implemented using the  SAIL programming language. It was later replaced by WEB. What’s WEB? It’s a programming language, invented by… You’ll have guessed it by now, Donald Knuth. It transpiles to PASCAL. Knuth transpiled the WEB before it was cool.\n    WEB is a special language: in WEB, any bare text is just text. It’s interleaved with marked pieces of code, which are later used for the program code. The documentation can be run through a special program to produce… a TeX file. The concept is called “literate programming” and was introduced by… Donald Knuth.\n    But, what does TeX do? Mainly, it does text layout and a couple of other things. Knuth being known for research on algorithms couldn’t do without coming up with his own algorithm, later published together with Michael Plass. What does the algorithm do? It finds a visually pleasing way to lay out a paragraph on a page without making line breaks look jarring (for example by adjusting the “glue”, the whitespace between words). Here’s a  nice explanation.\n  It’s still considered good and has a huge factor in the recognisable look of TeX documents.\n    Which brings us to the next problem:  what does this thing lay out? Generically speaking: objects and clusters of objects of varying sizes. Interestingly, that’s what TeX deals with, it has no concept of a character other then dimensions.\n  Nevertheless, these are usually characters and characters are provided by fonts. Fonts must usually be licensed at a fee and free fonts weren’t so available in the 70s.\n  Another very recognisable feature of TeX documents that they are often set in a font called “Computer Modern”.\n  I’m trying to make this whole thing a bit more thrilling, so I will let you guess who created that one.\n    Fonts need to be authored. Usually, they are described in some vector description, often Bézier curves. This is fairly standard and not an innovation of Knuth.  But, he wrote a description language for that, along with an interpreter to turn this descriptions into proper font files. This is  METAFONT. It’s not strictly part of TeX, it’s just that the Yak happened to stand close.\n    As a side-note, METAFONT was later evolved into METAPOST for generic vector drawings, which has the one feature I still miss from many modern graphics description languages: the ability to describe an (addressable) point as the intersection between two other primitives.\n  Another side-note: both TeX and METAFONT still see releases, at a slow pace. TeX is currently at version 3.14159265, METAFONT at 2.7182818. Yep, TeX is slowly converging towards pi, while METAFONT towards e. Take that, semantic versioning advocates!\n  Yak shave 6: Come up with your own versioning scheme \rYak shave 7: Avoid adoption of it for greater good\n  We’re not done yet. We can layout text (and other things), but where do we convert it to? Now, everyone knows the horror printers invoke, so no one wants to deal with those directly. Classic TeX instead converts things to  DVI, the “device independent” format. I don’t know many details about it, except what’s on the wiki page, which feels the need to specifically point out that “DVI is not a document encryption format”. It is again a stack-based language (in contrast to PostScript not turing complete), which can then be interpreted through a driver, which would then send that to whatever target (a printer, PDF or such). It was designed by…\n      Note that I haven’t mentioned that TeX is an… interesting… language by itself, but I don’t consider that a yak shave, this was just the implementation.\n  That makes most of the initial implementation complete. Which means, in orderly fashion, you should give matters in the hand of the community.\n    Since the release of TeX, the community has been busy working on using it as a platform. If you ever downloaded the full TeX distribution, please bear in mind that you are downloading the amassed work of over 40 years, to make sure that each and every TeX document ever written builds. We’re talking about documents here.\n  But mostly, two big projects sprung out of that. The first is LaTeX by Leslie Lamport. Lamport is a very productive researcher, famous for research in formal methods through TLA+ and also known laying groundwork for many distributed algorithms. LaTeX is based on the idea of seperating presentation and content. It is based around the idea of document classes, which then describe the way a certain document is layed out. Think Markdown, just much more complex. The second is ConTeXt, which is far more focused on fine grained layout control.\n    Community yak shave 1: Create not one, but two programs that are very ungoogleable… Before Google is invented.\n  Being active in a language that has lingo built around “Rust”, “Cargo” and “manifests”, I feel right at home.\n  Now, the community also wants to evolve TeX: a lot has changed over the years in technology, so, for example, you’d like to use modern font formats, directly write to modern output formats or use this new UTF-8 thingy. For that, there are specialised TeX interpreters, such as  pdf(la)tex,  lua(la)tex and  xe(la)tex. There’s a problem here: you are not allowed to change TeX and distribute  it under that name. The thinking here is that if you have a  tex binary, you can compile any valid TeX from the past and from the future.\n  The first issue on that road is that WEB isn’t really a popular programming language, neither is PASCAL and running it on modern systems is a bit of a pain. Which means…\n          Whenever you feel like “can’t we just replace this whole thing, it can’t be so hard” when handling TeX, don’t forget how many years of work and especially knowledge were poured into that system. Typesetting isn’t the  most popular knowledge around programmers. Especially see it in the context of the space it is in: they can’t remove legacy. Ever. That would break documents.\n  TeX is also not a programming language. It might resemble one, but mostly, it should be approached as a typesetting system first. A lot of its confusing lingo gets much better then. It’s not programming lingo.\n  By approaching TeX with an understanding for its history, a lot of things can be learned from it. And yes, a replacement would be great, but it would take ages.\n  In any case, I hope I thoroughly convinced you why Donald Knuth is the Patron Saint of Yak Shaves.\n    This comes out of a enjoyable discussion with  Arne from Lambda Island, who listened and said “you should totally turn this into a talk”.\n  top", "posttime": "2022-01-09 22:16:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "knuth,算法", "title": "唐纳德Knuth  -  Yak Shaves的顾客圣徒（2017年）", "title_en": "Donald Knuth – The Patron Saint of Yak Shaves (2017)", "transed": 1, "url": "https://yakshav.es/the-patron-saint-of-yakshaves/", "via": "", "real_tags": ["knuth", "算法"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072484, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在开始阅读之前，您应该意识到这篇文章有关在平台工作两年后被迫的复杂情况和退款。\n我遇见了罗宾，我们开展了一个头脑风暴会议和一些会议。此阶段唯一合理的事情是添加手动时间。在空白屏幕上打开软件并只需点击某个位置即可保持计算机的活动并没有意义。因此，我录制了手动时间，很多。我通常会与其他客户一起做到这一点，这绝不是一个问题。\n罗宾真的要求退款吗？这不可能。我开始通过调用罗宾来调查。他道歉并表示他从来没有召唤任何银行，另外，他说这有点搞砸了，因为他忘了他有“在他的账户中没有实际上是他的信用卡。\n是的，如果我手动录制数小时，客户可以要求退款，并证明他们的案件。但这不是客户要求这笔钱。这是信用卡所有者，谁是另一个人。这是不审查客户的努力的错。\n每当我和某人说话时，他们都很震惊并认为它不公平。我决定在这里写这篇文章，因为我很乐意听到这件事的双方的意见。如果您对此事有任何意见，请与我分享。", "note_en": "Before starting to read this, you should be aware that this article is concerning an Upwork complex situation and refund that’s been forced to my account after two years of working on the platform.\n I’m a successful Upwork freelancer, and I love it. I’ve made over $100k on that platform and was able to career shift through it. The reason why I’m posting about this is to understand whether I’m being in a fair or a non-fair position from an external perspective.\n It’s important to note that I’ve informed Upwork’s support that I’ll post this problem externally online on Medium and my website. They didn’t inform me not to.\n  I started off on Upwork a few years back. I built my status slowly and learned a huge deal along the way. In 2018, I signed a client as usual. Let’s call him “Robin” for the sake of the non-disclosure agreements.\n Robin was far by the best and the worst thing that ever happened to me on Upwork. I’ve worked with him till Sept of 2020. Robin worked with me fairly and I never had any dispute with Upwork on him. He needed presentations for investments, plans, designs, financial sheets; all within my area of expertise.\n It was perfect. I even met Robin in real life in Zurich, instead of virtually. We continued working via Upwork while locating in Zurich, as to not violate any Upwork terms.\n  There are two ways of recording how you work on Upwork, either  hourly through the software or  adding manual hours. They state it very obvious that  a freelancer falls under the Upwork protection if they record their hours through the software, not manually.\n I meet Robin, and we conduct a brainstorming session and a few meetings. The only reasonable thing to do at this stage is to add manual hours. It doesn’t make sense to open the software on a blank screen, and just click somewhere to keep the computer alive. Hence, I recorded manual hours, lots of them. I usually do that with other clients as well, it’s never a problem.\n Here’s when it could be a problem: If  the client on Upwork asks for a chargeback (refund). Then he might be entitled to it if you’re manually recording the hours.\n I’m on very good terms with Robin. He would never request a refund from Upwork, I’m sure of that.\n Anyway, that lasted for a couple of years and ended when he informed me that he has issues with Upwork and his credit card. I just told him to go sort it out and call me when he’s ready to work again. I will not work with him for free till he fixes his credit card on Upwork. In all cases,I don’t care really, I have several other clients, and Upwork pays me per week. So, worst-case scenario, I would lose one week of earnings, but that’s tolerable.\n   We are writing today to let you know that a payment made to your account has been reversed by your client’s bank.\n This reversal (chargeback) is a result of your client contacting their bank and asking them to reverse the payment for the following transaction(s):\n    I went nuts. A day after, a few other freelancers whom we were working with, started contacting me saying that Upwork is asking all of them for a refund as well.\n Is Robin really asking for a chargeback? That’s impossible. I start investigating by calling Robin. He apologized and said he never called any bank, additionally, he said this is a bit of a mess-up as he forgot that there is  “a credit card connected in his account that wasn’t actually his”.\n Let me translate this. Robin has been using someone else’s credit card for two years, and this other person realized that money was being withdrawn in the previous two years on a platform called Upwork without his consent.\n  I’ve worked with Robin for two years, and I worked hard for this.\n  They told me, here’s what you can do: —  Provide us with proof of your work, and we will try to convince the bank to not ask for this chargeback on behalf of their client. — That option sounds illogical in all sorts of ways.  Why would  a bank take my side (a freelancer from another country) instead of his own actual client who never actually requested those services?\n Nevertheless, I sent Upwork two years’ worth of projects. They respond 40 days later telling me that they tried and failed. Then they said something that seemed, in my point of view, a bit of a human-right violation.\n “You have to pay this money back, what we want you to do is work on our platform and we will take your earnings from there. Till then, you’re not allowed to withdraw any earnings.”  (Paraphrasing)\n Let me get this straight — Upwork, a billion-dollar company, wants me, a freelancer, to work for free on their platform for approximately 230 hours (with my hourly rate) because a client on their platform was using someone else’s credit card? How in god’s name is that my fault?\n Yes, the clients can ask for a chargeback if I record the hours manually and their case was proven.  But that’s not the client asking for the money. That’s  the credit card owner, who is another person. That’s Upwork’s fault for not vetting their clients.\n Eventually, I keep trying to open a communication channel with Upwork and their support concerning this refund situation. They insist on this situation.\n    Whoever owns the credit card can ask their bank to chargeback a payment. We cannot get around this, unfortunately.\n We consider this matter closed as we believe we have gone over this with you at length.”\n They consider this matter closed. I even tried to raise a complaint on this “Escalation” department — their response  “We’re sorry, the executive escalations are the highest tier.”\n At the moment of this writing, I’m still on the platform. It’s a little bit demotivational knowing that the next 230 hours that I’ll work will go to Upwork instead of me because of this, so I’m slowed down on a motivational level.\n I’ve worked honorably and by the book on Upwork for a long time. When things were not making sense, I still followed the rules. I could’ve easily gotten paid from Robin outside of Upwork. Heck, he was physically in front of me. Yet, I respect how Upwork opened my eyes to becoming the person I am today, and for that, I’m forever grateful.\n Whenever I speak to someone about this, they are shocked and deem it unfair. I decided to write this here because I would love to hear opinions on both sides of the matter. If you have any opinion on this matter, please share it with me.\n In my opinion, a better way to think of this is as follows — If you’re working as a cook at Mcdonalds and it turns out that Mcdonalds has been scamming the world without you being aware. Do you, as a cook, have the responsibility to pay what you honorably earned back to the world?", "posttime": "2022-01-09 22:15:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "client,罗宾", "title": "春天要求客户使用别人的卡，要求12,500美元退款", "title_en": "Upwork asking for a $12,500 refund as the client was using someone else's card", "transed": 1, "url": "https://alanany.com/2021/12/23/upwork-12k-refund-client-using-another-credit-card/", "via": "", "real_tags": ["client", "罗宾"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072483, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "理解和建模围绕机器学习预测的不确定性对任何生产模型至关重要。它提供了处理模型频串离其适用范畴太远的情况的句柄，进入使用预测的地区是彻底或彻头彻尾的危险。认为医疗诊断或自动驾驶汽车。\n为简单起见，我们将考虑以下众所周知的正态分布，但该方法对于任何其他概率分布也是类似的。\n设M（x，θ1）\\ mu（x，θ1）μ（x，θ1）和σ（x，θ1）\\ sigma（x，\\ theta_1）σ（x，θ1）是两个子网络具有各自的培训参数Th 1 \\ Theta_11 Th 1和Th 2 \\Theta_2θ2。\nl = 1 2（y  - μ（x，θ1）σ（x，θ2））2 + log {2π⋅Σ（x，θ2）}（iii）\\标签{iii} \\ mathcal {l} = \\ frac {1} {2}左（\\ frac {y  -  \\ mu（x，\\ theta_1）} {\\ sigma（x，\\ theta_2）} \\右）^ 2 + log \\，\\ left \\ {\\ ，\\ sqrt {2 \\ pi} \\ cdot \\ sigma（x，\\ theta_2）\\，\\右\\} l = 2 1（σ（x，θ2）y  - μ（x，θ1）） 2 +日志{2π⋅Σ（x，θ2）}\n模型 。 eval（）ronal_dist = model（x）＃使用形状（n，m）的x上的型号均值= normal_dist。均值＃检索以形状（n，）std = normal_dist的平均值。 stddev＃检索标准偏差（n，）\n这种方法很容易和多功能 - 当我需要一个不确定感时，我是我的方法。", "note_en": "Understanding and modeling uncertainty surrounding a machine learning prediction is of critical importance to any production model. It provides a handle to deal with cases where the model strays too far away from its domain of applicability, into territories where using the prediction would be inacurate or downright dangerous. Think medical diagnosis or self-driving cars.\n Modeling uncertainty is a whole field of research in itself, with vast amount of theory and plethora of methods. Briefly, for simple models (such as the ubiquitous  linear regression), analytic approaches provide an exact solution. For more complex models where an exact solution is intractable, statistical sampling approaches can be used, the gold standard of which are  Markov Chain Monte Carlo methods (e.g. the state of the art  Hamiltonian Monte Carlo).\n However, when it comes to neural networks, both approaches fall short. Exact solutions are unavailable, and even the best sampling algorithms choke on the thousands — if not millions — of parameters a typical neural network is made of.\n Thankfully, even if full Bayesian uncertainty is out of reach, there exist a few other ways to estimate uncertainty in the challenging case of neural networks.\n Today, we’ll explore one approach, which boils down to  parametrizing a probability distribution with a neural network.\n We’ll use nothing but good ol’ PyTorch, thanks to the little known   distributions package.\n     The first step is to choose an appropriate probability distribution. The choice is context dependent: in a regression setting, a Normal or LogNormal distribution may be appropriate while for classifications, one would pick a Categorical distribution. Thankfully, PyTorch   distributions package provides implementation for all the major probability distributions.\n  For simplicity’s sake, we’ll consider the well known Normal distribution in the following, but the approach would be similar for any other probability distribution.\n The normal distribution       N \\mathcal{N}     N with mean       μ \\mu    μ and standard deviation       σ \\sigma    σ is defined as follows:\n z ∼ N ( μ , σ )    ⟺    P ( z ∣ μ , σ ) =  1  σ   2 π ⋅ e x p  { −  1 2   (   z − μ σ ) 2 }   (i) \\tag{i} z \\sim \\mathcal{N}(\\mu, \\sigma) \\iff P(z \\mid \\mu, \\sigma) = \\frac{1}{\\sigma\\sqrt{2\\pi}} \\cdot exp\\left\\{-\\frac{1}{2}\\left(\\frac{z - \\mu}{\\sigma}\\right)^2\\right\\}    z  ∼     N ( μ ,  σ )   ⟺     P ( z  ∣    μ ,  σ )  =             σ        2 π      ​          1 ​      ⋅    e x p    { −          2       1 ​         (          σ       z  −  μ ​      )        2  }\n Here, “      ∼ \\sim    ∼” merely means “sampled from”, and       P ( z ∣ μ , σ ) P(z \\mid \\mu, \\sigma)    P ( z  ∣    μ ,  σ ) is the probability density function (PDF), a quantity that determines the likelihood of a value       z z    z given the distribution mean and standard deviation. Instances of Normal PDFs are shown below for various values of       μ \\mu    μ and       σ \\sigma    σ.\n   Let’s assume we are trying to model an outcome       y y    y from a set of features       x x    x. In the classical, non probabilistic setting, our neural network is represented by a function       f f    f, which depends both on the input       x x    x and the trainable parameters       Θ \\Theta    Θ:\n   Looking back at the previous section, we can equate the prediction of our model with the distribution mean       μ \\mu    μ: not withstanding uncertainty,       μ \\mu    μ is the most probable outcome.\n  In turn, assuming a normal distribution is appropriate in this context, the standard deviation       σ \\sigma    σ is a good statistic to summarize the uncertainty surrounding our prediction.\n Let       μ ( x ,  Θ 1 ) \\mu(x, \\Theta_1)    μ ( x ,   Θ        1 ​    ) and       σ ( x ,  Θ 1 ) \\sigma(x, \\Theta_1)    σ ( x ,   Θ        1 ​    ) be two  sub networks with respective trainable parameters        Θ 1 \\Theta_1     Θ        1 ​    and        Θ 2 \\Theta_2     Θ        2 ​   .\n The mean network       μ ( x ,  Θ 1 ) \\mu(x, \\Theta_1)    μ ( x ,   Θ        1 ​    ) is nothing more than the original network       f f    f, i.e. the model prediction. The second network       σ ( x ,  Θ 2 ) \\sigma(x, \\Theta_2)    σ ( x ,   Θ        2 ​    ) is responsible for explicitly modeling uncertainty. From (i), we get:\n y ∼ N   [   μ ( x ,  Θ 1 ) , σ ( x ,  Θ 2 )   ]   (ii) \\tag{ii} y \\sim \\mathcal{N}\\,[\\,\\mu(x, \\Theta_1), \\sigma(x, \\Theta_2)\\,]    y  ∼     N  [  μ ( x ,   Θ        1 ​    ) ,  σ ( x ,   Θ        2 ​    )  ]\n Note that in practice,        Θ 1 \\Theta_1     Θ        1 ​    and        Θ 2 \\Theta_2     Θ        2 ​    overlap, i.e. the two networks share their first few layers. (We’ll look at an in-depth example later on.)\n We now have two sub-networks, with both shared and distinct parameters. We’d really like to train them jointly, using a single loss function.\n The probability density function of equation (i) is an ideal candidate: the trick is to maximize the likelihood of observing       y y    y, which the PDF represents exactly.\n It is best to take the logarithm of the PDF rather than dealing with the pesky exponential. Plus, PyTorch expects a function to minimize, so we are negating the quantity: the loss function is the  negative log likelihood of observing       y y    y given       x x    x,        Θ 1 \\Theta_1     Θ        1 ​    and        Θ 2 \\Theta_2     Θ        2 ​   :\n L =  1 2   (   y − μ ( x ,  Θ 1 )  σ ( x ,  Θ 2 ) ) 2 + l o g    {     2 π ⋅ σ ( x ,  Θ 2 )   }   (iii) \\tag{iii} \\mathcal{L} = \\frac{1}{2}\\left(\\frac{y - \\mu(x, \\Theta_1)}{\\sigma(x, \\Theta_2)}\\right)^2 + log\\,\\left\\{\\,\\sqrt{2\\pi}\\cdot\\sigma(x, \\Theta_2)\\,\\right\\}     L  =             2       1 ​         (          σ ( x ,   Θ        2 ​    )       y  −  μ ( x ,   Θ        1 ​    ) ​      )        2  +    l o g     {         2 π      ​     ⋅  σ ( x ,   Θ        2 ​    )   }\n Notice how we recovered the  square of difference term       ( y − μ  ) 2 (y - \\mu)^2    ( y  −    μ  )        2 from the classic mean squared error, decorated with terms dependent on the standard deviation.\n This is it, we have parametrized the normal distribution with a neural network and devised an appropriate loss function. Every input gets its own unique set of mean (prediction) and standard deviation (uncertainty) neatly calibrated from optimization of the PDF.\n   We’ll use data from the  OLS Regression Challenge, where the goal is to predict cancer mortality rates in US counties based on a number of socio-demographic variables such as median age, income, poverty rate, unemployment rate, etc.\n We won’t be discussing the dataset or data prep steps any further, but the code to reproduce is available on  this jupyter notebook.\n  class  DeepNormal ( nn . Module ):  def  __init__ ( self ,  n_inputs ,  n_hidden ):  super (). __init__ ()  # Shared parameters  self . shared_layer  =  nn . Sequential (  nn . Linear ( n_inputs ,  n_hidden ),  nn . ReLU (),  nn . Dropout (),  )  # Mean parameters  self . mean_layer  =  nn . Sequential (  nn . Linear ( n_hidden ,  n_hidden ),  nn . ReLU (),  nn . Dropout (),  nn . Linear ( n_hidden ,  1 ),  )  # Standard deviation parameters  self . std_layer  =  nn . Sequential (  nn . Linear ( n_hidden ,  n_hidden ),  nn . ReLU (),  nn . Dropout (),  nn . Linear ( n_hidden ,  1 ),  nn . Softplus (),  # enforces positivity  )  def  forward ( self ,  x ):  # Shared embedding  shared  =  self . shared_layer ( x )  # Parametrization of the mean  μ  =  self . mean_layer ( shared )  # Parametrization of the standard deviation  σ  =  self . std_layer ( shared )  return  torch . distributions . Normal ( μ ,  σ )\n The bulk of the implementation should look familiar: network layers (including trainable parameters) are defined in the  __init__ function, then the  forward function pieces everything together.\n         model . eval () normal_dist  =  model ( x )  # evaluate model on x with shape (N, M) mean  =  normal_dist . mean  # retrieve prediction mean with shape (N,) std  =  normal_dist . stddev  # retrieve standard deviation with shape (N,)\n       Different instances get different uncertainty profiles since       μ \\mu    μ and       σ \\sigma    σ both depend on       x x    x:\n   One way to find out is to  compare uncertainty to a measure of how  surprinsing or  unexpected an input is. Unexpected inputs should correlate with higher uncertainty (e.g. a self-driving car encountering a rare weather event).\n For our purpose here, unexpectedness is measured as the average deviation from the median of an instance’s feature values. The most extreme the feature values, the more unexpected an instance.\n  There is an upward trend: uncertainty tends to grow with less expected inputs, just as it should.\n   In this post, we modeled uncertainty using the Normal distribution, but there are a plethora of other distributions available for different problems.\n   The benefit is an estimate of uncertainty around the model prediction, at the cost of a few extra layers.\n This approach is easy and versatile — it is my go to method when I need a sense of uncertainty.", "posttime": "2022-01-09 22:14:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "建模,uncertainty,模型", "title": "用Pytorch建模不确定性", "title_en": "Modeling Uncertainty with PyTorch", "transed": 1, "url": "https://romainstrock.com/blog/modeling-uncertainty-with-pytorch.html", "via": "", "real_tags": ["建模", "模型"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072482, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "发布您希望根据应用程序数据（如用户ID或用户忠诚度）汇率限制请求。但是，您希望在应用程序层之前应用速率限制，因此您无法信任客户提供的值。\n如果您试图防止DOS攻击确保验证足够便宜。\n验证成本可能很低。这是因为您一般想要验证身份验证的请求的Auth-令牌，并且验证Auth-token通常会给您提供足够的信息以验证速率限制设置（例如用户ID）。但是对于公共信息的请求，可能会否则可能会不必要地提高服务请求的总成本。", "note_en": "Posted    You want to rate limit requests based on application data such as User ID or User Loyalty. However you want to apply rate-limiting before the application layer, so you have no way to trust the client provided values.\n This is a common problem, making the industry-standard approach rate limiting by IP (or CIDR block). In fact some  popular  CDNs only support rate-limits keyed by IP. Unfortunately IP-based limiting usually insufficient as it either allows too much malicious traffic or blocks a significant number of legitimate users (imagine a lot of users behind a carrier-grade or office NAT).\n  Pass the application info in a proxy-visible part of the request such as a cookie.\n  Configure the rate limiter to use the application info. (likely falling back to IP-based keys)\n  The application must validate the info and provide a “useless” response if it isn’t accurate.\n Step 1 and 2 are quite obvious but step 3 is the secret ingredient to allow a “dumb” proxy to apply rate-limiting based on application values. Step 3 ensues that spoofed values don’t provide any value to the attacker, defeating the purpose of spoofing them in the first place.\n Note that “value to the attacker” can be very broad, so make sure that it reflects your rate limiting goals.\n If you are trying to prevent DoS attacks ensure that the validation is sufficiently cheap.\n  If you are trying to prevent scraping ensure that you don’t return any valuable data.\n  If the information is being passed in a cookie unset (or correct) the cookie and redirect the user to the same URL.\n  NGINX can support this quite easily. Here is an example of rate limiting by User ID which is passed in the  uid cookie.\n  This snippet applies the same limit to users and IPs but two  limit_req_zones can be used to enforce different limits for each group.\n   Be sure that you don’t lock out a user based on a mismatch. For example if you use an auth-token in the cookie to validate the user ID don’t return a 401 if the auth token is expired or revoked. This will result in the user having all request blocked with no obvious way to fix the problem. (Your support team will probably need to ask them to clear their cookies).\n As mentioned above a better option would be to clear the untrusted data so that the user reverts to the regular IP-based filtering.\n  The cost of validation is likely low. This is because you will generally want to validate the auth-token for authenticated requests anyways and validating the auth-token will often give you enough information to validate the rate-limiting settings anyways (for example the user ID). However for requests for public information this validation may be otherwise unnecessary and raise the overall cost of serving the requests.\n Unfortunately I don’t know of any great solutions, this is a cost of rate limiting based on authentication, you actually need to perform the authentication! One workaround is excluding requests for public data from rate limiting, then you don’t need to validate the authentication information. However be sure that the requests that bypass the rate-limit in sync between the rate-limiter and the application as any endpoint that isn’t validated is effectively unlimited (as an attacker can send a random rate-limit key for each request). One easy way to keep this in-sync is to strip the rate-limit key from the request before passing it to the application, then the application doesn’t have anything to validate. This approach will reduce the cost but will leave the application exposed to scrapers, using a very high IP-based rate limit may be enough to prevent the worst attacks without affecting many legitimate requests.\n   Passing the rate-limiting info via cookie is an easy option because it is automatically added by the browser to all subsequent requests, however basically any method will work, including URL parameters or custom headers. Just be careful about locking a user out. If you are using a custom method to pass the rate-limiting information you need to ensure that all of your clients will gracefully handle a request that has been rejected due to mismatched rate-limiting information.\n  If you have a flexible enough rate-limiting system you can even set the rate limit based on the application data. For example logged-in users may get 10r/s but logged in users who have spent at least $20 can make 20r/s. This can be a good way to prevent the effectiveness of account-spamming while serving your most loyal customers reliably.", "posttime": "2022-01-09 22:14:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "速率,rate,验证", "title": "每用户速率限制", "title_en": "Per-User Rate Limiting", "transed": 1, "url": "https://kevincox.ca/2021/04/14/per-user-rate-limiting/", "via": "", "real_tags": ["速率", "rate", "验证"]}, {"category": "", "categoryclass": "", "imagename": "f5c4e174d1c475d3a8b1f6b1f8e85154.jpeg", "infoid": 1072481, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "科技iPhone制造商培养了IMESSage作为青少年的必备短信工具。 Android用户触发了一个只有一点凉爽的绿色泡泡：'ew，这是粗略的。", "note_en": "Tech     The iPhone maker cultivated iMessage as a must-have texting tool for teens. Android users trigger a just-a-little-less-cool green bubble: ‘Ew, that’s gross.’\n   Soon after 19-year-old Adele Lowitz gave up her Apple iPhone 11 for an experimental go with an Android smartphone, a friend in her long-running texting group chimed in: “Who’s green?”\n  The reference to the color of group text messages—Android users turn Apple Inc.’s iMessage into green bubbles instead of blue—highlighted one of the challenges of her experiment. No longer did her group chats work seamlessly with other peers, almost all of whom used iPhones. FaceTime calls became more complicated and the University of Michigan sophomore’s phone didn’t show up in an app she used to find friends.\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2022-01-09 22:14:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,imessage", "title": "为什么Apple的Imessage正在获胜：青少年害怕绿色文本泡沫", "title_en": "Why Apple’s iMessage is winning: teens dread the green text bubble", "transed": 1, "url": "https://www.wsj.com/articles/why-apples-imessage-is-winning-teens-dread-the-green-text-bubble-11641618009", "via": "", "real_tags": ["apple", "imessage"]}, {"category": "", "categoryclass": "", "imagename": "e1ddf16bc853e538d96097e5ace731e4.png", "infoid": 1072480, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“当我累了，我睡了。当我饿了，我吃了。当我不得不去的时候，你知道，我去了。“ - 阿甘\n随着时间的推移，非牙医和不重要的活动创造了陈立行;当机会出现时，偶然就会发生，并且您有能力利用它。在象限IV中花费的时间大规模增加了掌握机会所需的技能和环境组合的机会。 [3]", "note_en": "“When I got tired, I slept. When I got hungry, I ate. When I had to go, you know, I went.” – Forrest Gump\n   This “Eisenhower matrix” says to sort your activities into four quadrants and then handle them accordingly. This maximizes your productivity, and it’s important to avoid the “ urgency trap” of being so caught up in Quadrants I and III that Quadrant II is forgotten.\n Quadrant II, nonurgent and important, is needed because it improves your long-term effectiveness. Going to a networking event or industry conference, growing your professional network on Linkedin, having  informational interviews with experts in your field, and getting an MBA at a top school are examples of Quadrant II activities.\n  Spending all of your time on Quadrants I and III is bad, but I disagree that we should eliminate Quadrant IV.  Ambitious people should be spending much more of their time in Quadrant IV.\n   These may seem frivolous, but Quadrant IV is actually a useful complement to Quadrant II.\n  Quadrant II builds up your existing strengths, while Quadrant IV exposes you to new abilities and trains you in less immediately needed skills. These “unimportant” activities are chosen by your subconscious.  Your subconscious knows what you need. [1] Your conscious brain is much worse than your subconscious at identifying and prioritizing, because it’s too busy thinking of Quadrant II things. That’s why Quadrant IV activities invariably turn out to be useful, even though it doesn’t look like it when you’re doing them. [2]\n  Is emailing a stranger a waste of time, or could it open doors you didn’t even know about?\n    Over time, nonurgent and unimportant activities create  serendipity; serendipity happens when an opportunity arises and you have the ability to take advantage of it. Time spent in Quadrant IV massively increases the chances that you have the combination of skills and circumstance needed to grasp the opportunity. [3]\n If you feel like your achievements aren’t proportional to your hard work, consider whether you need more Quadrant IV in your life. As the famous phrase goes, “The peerless samurai walks the path of hardship, the light-hearted fool walks the path of providence.”\n    [1] An important caveat: to benefit from Quadrant IV activities, you must avoid  superstimuli. Examples of superstimuli are heroin, video games, junk food. Superstimuli will hijack your subconscious and you won’t get serendipity.\n [2] This is also why advice like “cold email one person a day if you want to build a great network” is useless; it’s forcing Quadrant IV activities into Quadrant II, and overruling your subconscious.\n [3] A personal anecdote: serendipity arising from Quadrant IV activity has massively improved my life. I’ve spent significant amounts of time playing competitive games, reading about rationality and effective altruism, emailing strangers to chat about things I was interested in, and blogging and writing. These “unimportant” activities have led to deep friendships, career transformations and monetary blessings many years down the line.", "posttime": "2022-01-09 22:11:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "陷阱,importance,机会", "title": "重要的陷阱", "title_en": "The Importance Trap", "transed": 1, "url": "https://brianlui.dog/2021/08/18/the-importance-trap/", "via": "", "real_tags": ["陷阱", "机会"]}, {"category": "", "categoryclass": "", "imagename": "3cf5cd8470ee4c29c9759277defbc8b1.png", "infoid": 1072479, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Garmin观看山地自行车导向的应用程序。通过在GitHub上创建帐户，为RJMCCANN101 / MBO开发作出贡献。", "note_en": "Garmin Watch Apps for Mountain Bike Orienteering. Contribute to rjmccann101/MBO development by creating an account on GitHub.", "posttime": "2022-01-09 22:10:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,garmin,观看", "title": "MBO  -  Garmin观看山地自行车定向的应用程序", "title_en": "MBO – Garmin Watch Apps for Mountain Bike Orienteering", "transed": 1, "url": "https://github.com/rjmccann101/MBO", "via": "", "real_tags": ["程序", "garmin", "观看"]}, {"category": "", "categoryclass": "", "imagename": "9e1d76193d5cfae8e272353464008277.jpg", "infoid": 1072478, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着预期需要更多的锂电池来投入电池，以帮助为更绿的未来提供动力，您可能会认为环保主义者会传递给在内华达州周边地区的拟议锂矿的一些负面影响。那不是这种情况。对一些拟议的地雷的反对已经强劲，甚至可能会增加。\nFalk和Wilbert是激进的环保主义者，在ProtectThackerPass.org网站上有粉丝写作“我讨厌化石燃料并积极倡导所有工业基础设施的拆除......”\n2月26日，2021年2月26日，西方流域项目，荒地防御，大盆地资源手表和盆地和范围观察提起了一项诉讼，称之为决定的批判者通过记录没有充分衡量矿山对大型鼠尾草松鸡和其他野生动物的影响。\nHumboldt County Manger Dave Mendiola在气候新闻中讲述了“我想你可以将自己连锁在栅栏上，就像一些抗议者可能会这样做，我不责怪他们。但最终，作为一家公司，如果他们遵守所有规则，你可能不会停止它。我们可以做的是一个县的东西是监控它并提出现在解决问题的方法。“\nMike Kobler，U.S. Operational of Tonopah Lithium Corp.的总经理告诉NYE县委员于11月2日会议，他的公司矿场大约托普托普西北约六英里的占地面积可能成为世界上最大的锂电资源之一。\n如果在内华达州和美国其他地方停止提出的锂矿山的努力成功，那么随着对锂斜坡的需求，锂矿业可能会在环境法规比美国的国家升级，燃料更多的燃料将被烧毁锂电片和世界各地的电池和美国\nAlbemarle Corporation的Silver Peak锂矿山约40英里的Tonopah西南，自20世纪60年代以来一直在运行。 5月6日，2021年纽约时报故事说，银峰每年产生约5,000吨锂。\n加入所有锂电新闻，加热全球锂电资源竞争，锂电图均为2021年，增加约240％。", "note_en": "With the anticipated need for a lot more lithium to put into batteries to help power a greener future, you might think environmentalists would give a pass to some of the negative effects of the proposed lithium mines that are being planned at sites around Nevada. That’s not the case. The opposition to some of the proposed mines has been strong and may even be ramping up.\n Thacker PassLithium Americas’ Thacker Pass lithium mine may be the biggest project on the horizon, and it is facing lots of opposition.\n Lithium Americas has been working for years on plans for Thacker Pass, which is about 60 miles northwest of Winnemucca.\n  The company’s website says Thacker Pass is “the largest known lithium resource in the United States.” Lithium Americas estimates there is $3.9 billion worth of recoverable lithium at the site. The company has said it hopes to start mining operations next year.\n  The mine is expected to produce up to 60,000 tons a year of battery-quality lithium carbonate, which would be a huge boost to the world supply of lithium. The mine is expected to employ about 300 people and have a 46-year mine life.\n    On Jan. 15, 2021, the last Friday of the Trump Administration, the Bureau of Land Management approved the Record of Decision for Thacker Pass, giving federal approval to the project.\n   That evening, Will Falk and Max Wilbert set out on an eight-hour drive to the Thacker Pass site to set up a camp nearby to protest the mine. People have been camped out there ever since.\n Falk and Wilbert are radical environmentalists, with Falk writing on the  protectthackerpass.org website that “I hate fossil fuels and actively advocate for the dismantling of all industrial infrastructure …”\n Elisabeth Robson wrote on the website, “Many people believe they can’t live without cars. But all humans lived without cars until a mere 113 years ago, and we can do so again. A world without cars is a quieter, slower, and more wonderful world, not just for humans but for everyone.”\n  “I hope one day a militant and offensive environmental movement forms,” Falk wrote.\n  The people opposed to the Thacker Pass mine and other lithium mine projects don’t all hold these views, of course, but have a variety of reasons for their opposition.\n A March 10 letter in the Elko Daily Free Press from Alex Eisenberg said the plan to transition to electric vehicles in the years ahead “is incredibly short-sighted and irresponsible and will do virtually nothing to curb carbon emissions, as electric car production is completely reliant on the fossil fuel industry.”\n “The Thacker Pass mine alone would burn 11,000 gallons of diesel every day for onsite operations,” the letter said. “Double that for off-site operations. Carbon emissions are expected to be 150,000+ tons per year, equating to 2.3 tons of carbon for every ton of lithium produced. Hundreds of tons of sulfur (ironically a waste product from oil refineries) would be used daily in mine operations.”\n    On Feb. 11, 2021, Edward Bartell, a rancher who owns property above and below the mine, filed a lawsuit with a long list of objections to the mine. One of his big concerns is the water the mine will use. The project’s Environmental Impact Statement says the projected water demand for years 5 through 41 is equivalent to an average pumping rate of 3,224 gallons per minute.\n  On Feb. 26, 2021, the Western Watersheds Project, Wildlands Defense, Great Basin Resource Watch, and Basin and Range Watch filed a lawsuit saying the Thacker Pass Record of Decision did not adequately gauge the mine’s impacts on greater sage grouse and other wildlife.\n Local Indigenous communities say Thacker Pass is important to them historically and in their daily lives. Local tribal members have been camping near the mine site to protest the mine.\n The tribal council of the Fort McDermitt Indian Reservation, which is about 26 miles from the mine site, made an engagement agreement with Lithium Nevada in 2020, but withdrew from the agreement in March 2021.\n On July 28, the Reno-Sparks Indian Colony and Atsa Koodakuh Wyh Nuwu/People of Red Mountain were allowed to intervene as plaintiffs in the lawsuits against the mine. On Aug. 6, the Burns Paiute Tribe was also allowed to intervene.\n    On Sept. 5, U.S. District Court Judge Miranda Du denied a request from the Reno-Sparks Indian Colony and the People of Red Mountain for a preliminary injunction to temporarily halt work.\n  Falk is a lawyer for the People of the Red Mountain, but he told The Guardian he is skeptical they will be able to win by arguing the right things.\n “Eventually we’re going to have to be ready to physically block construction equipment. I think that one of the ways to wake up people in the United States (is seeing) people getting dragged away by the police for trying to protect their land. And I think that’s where this is going,” Falk said.\n Humboldt County Manager Dave Mendiola told Inside Climate News, “I guess you can chain yourself to the fence like some of the protesters might do and I don’t blame them for that. But in the end, as a company, if they’ve followed all the rules, you’re probably not going to stop it. What we can do as a county is monitor it and come up with ways to address problems now.”\n Rhyolite RidgeAt ioneer’s proposed Rhyolite Ridge lithium mine about 65 miles southwest of Tonopah, debates continue over the Tiehm’s buckwheat that is found only on the site.\n James Calaway, executive chairman of ioneer Ltd., said the company is working to protect the plant and increase the size of its habitat. He said about half of the plants were destroyed by drought and rodents last year.\n  John Scire, PhD, an adjunct professor at UNR, said in a December editorial that “the bottom line is that the Fish and Wildlife Service should veto the false claims by the Las Vegans that the ioneer mine will wipe out the buckwheat plants and should consider instead the macro environmental impacts of not letting the mine get cranked up ASAP. The best available science supports that the mine and the plant can co-exist.”\n However, Patrick Donnelly, the Nevada director of the Center for Biological Diversity, said he disagrees with ioneer’s expectation that the wildflower can be established near the current growing site.\n “Attempts to propagate the plants failed,” Donnelly told Mining the West magazine. “They all died, so ioneer doesn’t have a plan. Their plan is bunk and doesn’t reflect the consensus of the scientific community.”\n   He said the Center for Biological Diversity does not oppose lithium mining, and lithium is “all over the place” in Nevada.\n   Mike Kobler, general manager of U.S. operations for Tonopah Lithium Corp., told the Nye County commissioners at their Nov. 2 meeting that his company’s mine site about six miles northwest of Tonopah could become one of the biggest lithium resources in the world.\n “We are in the perfect location in Nevada,” Kobler said. “We don’t have the sage grouse issues that they have up north, we don’t have the desert tortoise issues that they have down south, we have not found any Tiehm’s buckwheat; we’ve cleared all of our environmental hurdles and cultural hurdles, so we’re just moving ahead.”\n In addition to Nevada, companies are also working on proposed lithium production sites in California, Oregon, Tennessee, Arkansas and North Carolina.\n   In Serbia, Rio Tinto has been planning a $2.4 billion lithium mine. For three consecutive weekends in late 2021, thousands of protesters blocked roads in Serbia to protest lithium mining, with environmentalists saying that extracting lithium causes huge damage to mined areas.\n On Dec. 16, authorities in western Serbia suspended a plan that would allow Rio Tinto to operate the lithium mine.\n “We will continue to provide information on all aspects of the project for which we are responsible and in which we participate,” Rio Tinto said in a statement.\n Chile, which has about 44% of the world’s lithium reserves, elected leftist Gabriel Boric as president on Dec. 19, but it is not clear what impact Boric’s election will have on lithium mining. Boric has supported mining tax hikes and royalties and promised to create a state-run lithium company.\n  If efforts to stop proposed lithium mines in Nevada and elsewhere in the United States are successful, then as the need for lithium ramps up, lithium mining could escalate in countries that have fewer environmental regulations than the U.S., and more fuel will be burned shipping lithium and batteries around the world and to the U.S.\n In the “National Blueprint for Lithium Batteries 2021-2030” published in June 2021, U.S. Secretary of Energy Jennifer M. Granholm wrote, “The Biden Administration has laid out a bold agenda to address the climate crisis and build a clean and equitable energy economy that achieves carbon-pollution-free electricity by 2035, and puts the United States on a path to achieve net-zero emissions, economy-wide, by no later than 2050 to the benefit of all Americans.”\n The report says the Federal Consortium for Advanced Batteries will “secure U.S. access to raw materials for lithium batteries by incentivizing growth in safe, equitable, and sustainable domestic mining ventures while leveraging partnerships with allies and partners to establish a diversified supply.”\n “The worldwide lithium battery market is expected to grow by a factor of 5 to 10 in the next decade,” the report says. “The U.S. industrial base must be positioned to respond to this vast increase in market demand that otherwise will likely benefit well-resourced and supported competitors in Asia and Europe.”\n However, on May 25, 2021, Reuters ran a story saying, “U.S. President Joe Biden will rely on ally countries to supply the bulk of the metals needed to build electric vehicles and focus on processing them domestically into battery parts, part of a strategy designed to placate environmentalists, two administration officials with direct knowledge told Reuters.\n “The plans will be a blow to U.S. miners who had hoped Biden would rely primarily on domestically sourced metals, as his campaign had signaled last autumn.”\n  Currently about 46% of the world’s mine production of lithium is in Australia, and about 21% is Chile and another 16% is in China, according to U.S. Geological Survey data. In the United States, all the lithium mining is at one mine in Nevada, and accounts for less than 2% of the world’s mine production.\n  Albemarle Corporation’s Silver Peak lithium mine is about 40 miles southwest of Tonopah and has been in operation since the 1960s. A May 6, 2021 New York Times story said Silver Peak produces about 5,000 tons of lithium a year.\n On Jan. 7, 2021, Albemarle announced that it planned to invest $30 million to $50 million to double the lithium production at Silver Peak by 2025.\n The company also said it planned to begin exploration in 2021 and evaluate technology “that could accelerate the viability of lithium production from clay resources in the region.”\n The lithium produced at Silver Peak is shipped to Asia to be made into cathodes for batteries.\n China has for years been focused on building capacity at every stage of the battery supply chain, according to a Sept. 1, 2020 VOA News story.\n China “has been buying stakes in mining operations in Australia and South America where most of the world’s lithium reserves are found,” the VOA story said.\n China’s Ganfeng Lithium, which has been “snapping up lithium mines and salt lakes abroad as it plots out an ambitious road map for growth,” according to a Dec. 8, 2021 Nikkei Asia story, is the largest shareholder in Lithium Americas, the company planning the Thacker Pass mine, according to the New York Times story.\n To add to all the lithium news and heat up the global competition for lithium resources even more, lithium prices shot way up in 2021, increasing about 240%.\n  In the years ahead, refining capacity might be built in the U.S. as more battery factories and electric vehicle factories are built here. The U.S. Department of Energy announced on Dec. 20, 2021 that 13 new electric vehicle battery factories are planned in the U.S. within the next five years. Most of these factories will be in the Southeast or Midwest.\n So, although U.S. will lag behind China, parts of the EV battery supply chain will be growing in the U.S. in the years ahead. But the question remains, how much of the lithium and other elements needed for the supply chain will come from mines in Nevada? We’ll being finding that out as the approval and funding processes – and the legal battles and protests – roll on.", "posttime": "2022-01-09 22:09:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "抗议,year,可能", "title": "锂：一年的进步和抗议", "title_en": "Lithium: A Year of Progress and Protests", "transed": 1, "url": "https://elkodaily.com/mining/lithium-a-year-of-progress-and-protests/article_6f35f8be-34a8-5406-b1fb-afaeeabec81d.html", "via": "", "real_tags": ["抗议", "year", "可能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072477, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着我们通过启示录的方式继续IRC，让我们在2021年下半年期间看看生态系统的事件。\niOS应用程序对后台任务进行了更聪明，并对MacOS催化剂的实验支持进行了进展。 Android应用程序支持Android 12并改进稳定性。\n版本4.1已释放添加脚本和自定义的新编辑器，支持UTF8令牌和许多插件API和脚本改进。\n在此期间，客户进入了客户。另外的添加包括在开始时自动加入通道，更细粒度的未读/突出显示状态，垂直成员列表在通道上，改进的Chathistory支持，显示模式更改，支持指定外部密码命令，以避免以明文存储密码，/（联合国）禁止，/ kick，/邀请和/ query命令，实施远离通知，支持SOJU.IM/Bouncer-Networks，并显示时间轴顶部的当前频道主题。\n添加包括用户启动的密码通过电子邮件重置，草稿/扩展监视器的实现，支持Scram-Sha-256 SASL Auth（即使未签名），升级的草稿/注册能力，OpenSolaris / illumos的服务管理文件和S6 init脚本。\n此机器人使用Duktape作为JavaScript引擎。制作了许多修复，并改善了BSD支持和POSIX一致性\nQT 6加入支持，提高了302章支持，现在可以跳过能力验证。", "note_en": "As we continue to irc our way through the apocalypse, let’s look at the happenings in the ecosystem during the second half of 2021.\n  I have been using a custom bot to welcome newcomers to the various  LibreOffice contributor channels. I wanted to make it more maintainable, so I reimplemented it as  a Limnoria plugin. Thanks to Val for the support, it was fun to write it!\n Sourcehut folks launched  an IRC bouncer service for the paying users of their software forge. One point of the endeavour is to drive improvements in the whole IRC ecosystem.\n IRC Driven, a site indexing IRC networks was relaunched. The site was originally created in 2006 and it provides statistics for a curated selection of IRC networks.\n   The IRCv3 Working Group published  a spec round-up in November 2021, including new drafts for WebSocket, Client batches, Account registration and Extended monitor. You can now  follow the WG on Fediverse.\n   Modern IRC Client Protocol received numerous additions and improvements from many contributors after Val from Limnoria was made editor. Val reports that the docs now cover nearly all meaningful parts from the RFCs.\n       Compatibility with Ergo ircd was improved, eight colour schemes were added, sixteen character set options were added to the server configuration screen and message log storage functionality was added.\n  The iOS app got smarter regarding background tasks and progress was made on the experimental support for macOS Catalyst. The Android app got support for Android 12 and improvements to stability.\n     Many of these include support for persistent history, so there is some overlap with the bouncer category.\n  Additions include handling of irc:// links, support for raw messages, /away command, progress bar for uploads, file management in frontend, IRC colours and text formatting and many UI improvements.\n  Lots of activity and two beta releases for 1.0.0. Additions include commands /whowas, /list and /away, improved /query, support for MONITOR, chghost, websocket, extended-join, account-notify, WHOX, SASL EXTERNAL, draft/extended-monitor, draft/account-registration with a UI to register and verify accounts, support for irc:// links, auto-joining channels upon reconnect and allowing bouncers to customise their shown name by setting NETWORK in ISUPPORT.\n  Public development started in April 2021. There is support for Redis as session store and an authorization middleware.\n  Version 1.6.0 was released in November. Message input box was made user-friendlier, channel list behaviour on desktop and mobile widths was improved among many other UI improvements.\n  Version 4.3.0 was released in November. New stuff during the half-year period include accessibility improvements, /umode and /kickban commands, optimised handling of modes based on ISUPPORT and better touch control support\n    Version 4.1 was released with additions such as a new editor for scripts and customisations, support for UTF8ONLY token and many plugin API and scripting improvements.\n    Versions 5.4 and 5.4.1 were released with additions such as asynchronous reconnection, improved nick highlighting, TLS improvements, convenience commands /opme, /deopme and /wii (whois with idle time) and an erc-bug command for reporting ERC bugs.\n  Version 2.16.0 was released in October with  a call for maintainers. Fixes went into mode support, URI parsing and the build system. An addon for handling notices and server notices was added and oper and whois addons were updated with expanded network and ircd support.\n  Version 9.51 was released in July adding a Strict Transport Security policy, a channel list export button and several fixes.\n  Many releases were made adding support for SASL authentication, system colour theme detection, integration with OS notifications and a redesigned headerbar.\n              Version 91.0 and multiple point releases were made. Changes include replacing image-based emoticons with Unicode and several fixes to the chat module.\n       While Irssi development has been slow, Ailin Nemui has a fork that is quite active. Improvements and fixes went into text rendering, TLS, performance of autojoin, the docs, /SERVER ADD and autocompletion among lots of maintenance work.\n  Lots of work went in the client during this period. Additions include automatically joining channels on start, more fine-grained unread/highlight state, a vertical member list on channels, improved CHATHISTORY support, showing of mode changes, support for specifying an external password command to avoid storing passwords in plaintext, /(un)ban, /kick, /invite and /query commands, implementation of away-notify, support for soju.im/bouncer-networks and showing the current channel topic at the top of the timeline.\n    Many fixes and code cleanups were made, IRCv3 cap key=val parsing was implemented, support was added for SASL PLAIN and EXTERNAL authentication and startup options were added for user mode as well as TLS and SASL.\n  /quit command was added, key bindings were made configurable and handling of text formatting (colours etc.) was improved.\n  Three releases were made with plenty of new goodies: plugin to support ”user is typing”, all IRC capabilities enabled by default (if supported), support was added for IRCv3.2 SASL auth, message-tags and setname as well as FAIL/WARN/NOTE messages.\n    bnc help command output was improved and an internals extension was added to help debugging and development.\n    Version 0.14.0 was released on 1 Jan 2022, while it was nearly three years since the previous one, so let’s celebrate it in this 2021 article. Changes in the half-year period include fixing a security issue with LDAP usernames and fixing macOS build failures.\n  A very active period for soju leading up to Sourcehut’s hosted bouncer service. Support was added for PostgreSQL databases, instrumentation via Prometheus, a new ”server status” BouncerServ command, many new configuration options and protocol features MONITOR, WHOX, ELIST, account-notify, CHATHISTORY LATEST, draft/event-playback and draft/extended-monitor.\n     Additions include user-initiated password resets via email, implementation for draft/extended-monitor, support for SCRAM-SHA-256 SASL auth (even though  not endorsed), upgraded draft/register capability, service management files for OpenSolaris/Illumos and an s6 init script.\n  An inspircd.org/account-id tag was added for exposing immutable  account identifiers to users, connectban got delaying options and TLS received several improvements. Version 4 saw several alpha releases with additions such as /CHECK for finding users by an ident or real name mask, a regex_pcre2 module and FRHOST S2S command to change the real hostname of a remote user.\n      A tutorial for connecting servers and services was added, registration messages were made configurable, SNO_BANNED server notice mask was added and mask support was improved.\n  Version 6.0.0 was released with a redone logging system, named extended bans, implementations for MONITOR, draft/extended-monitor, invite-notify and setname, GeoIP support and configurable WHOIS output.\n      The codebase was updated to use es6 classes, a markov command to generate text via a gpt-2 based synthesiser was added and the commands received many improvements.\n   Cardinal – bot built with Twisted library with a focus on ease of development (Python)\n       Version 1.9.2 RC1 was released with full CAP 302 support, implementations for monitor, cap-notify and SASL 3.2 as well as new Tcl commands (monitor, isircbot, server list) and a new Twitch bind.\n    This bot uses  Duktape as the JavaScript engine. Many fixes were made and BSD support and POSIX conformance was improved\n  A very active half year period for this bot with additions such as a greet command, weather command changed to use OpenWeatherMap amid lots of improvements to the commands and cleanups of the codebase.\n    Hostmask parsing was improved, SQLAlchemy was removed from the dependencies and many fixes and doc improvements were made.\n    It was a veritable ”Summer of IRC” for this bot with extensive improvements to the docs and code. Additions include a Wiktionary applet ( applets are external command line programs/scripts), a Wolfram|Alpha plugin, RunCommand plugin to run system commands (recommended to be used through locked-down factoids), a usershow command to show user metadata, GetUrl plugin to retrieve text contents of a URL and a qrpn module for evaluating expressions written in Reverse Polish notation with units.\n  A ”quick dirty add command” module was added to teach the bot simple actions.\n  The codebase was migrated to Scala 3 and a spam-list functionality was added to the link listener.\n    UTF-8 locale is now detected on Windows, docs were expanded and many improvements were made to the platform plugins (reddit, wikipedia).\n         Qt 6 support was added, CAP 302 support was improved and capability validation can now be skipped.\n                    Functionality was added to record when a user was first seen and when they joined.\n       superseriousstats - a fast and efficient program to create statistics out of various types of IRC chat logs (PHP)\n    Public development of this bridge started in April 2021 and the first stable release was made in August. The aim is to provide a solution that is not disruptive to IRC users. Despite its young age, it has a wealth of features, good spec support and is performant with thousands of users. In addition to the bouncer mode, it offers a relaybot mode where a single authorized Matrix user manages the bot.\n  URL handling was improved and an /annoy command was added to annoy people, showing oneself as typing when they are.\n        Version 2.0.10 was released in August and changes after that include improvements to InspIRCd support.\n  Additions include configurable length for generated passwords, a fix for confirming an account that had its email changed while unconfirmed and more robust validation of nicknames and handling of SASL.", "posttime": "2022-01-09 22:09:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "技术,technology,支持", "title": "IRC技术新闻从2021年下半年", "title_en": "IRC technology news from the second half of 2021", "transed": 1, "url": "https://www.ilmarilauhakangas.fi/irc_technology_news_from_the_second_half_of_2021/", "via": "", "real_tags": ["技术", "支持"]}, {"category": "", "categoryclass": "", "imagename": "90b7efbd950ead3de01ba7f8aef9fe02.png", "infoid": 1072476, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当他们试图克服他们的成瘾时，大多数人都错过了一件事。他们使自己更困难。\n我们经常误以为长期满意度的即时满足感（感觉更好地立即更好，但在长远来看，感觉很可怕）。例如。通过滚动Instagram逃避孤独。\n是否有可能在没有自己的情况下戒烟？绝对，但它简单得多，可能更健康，因为你会永远感受到拉。你可能会觉得对这件事的愿望。\n每天多次阅读新闻并不让我更明智 - 这让我更加紧张。我失去了看到更大的画面的能力。\n有时只有在我们退出后，我们开始看到我们自己撒谎的消极事物。只有在你进一步之后，你只能看到你过去自我的行为有多荒谬。\n思考你上瘾的行为。意识到它并没有带给你满意的承诺，它实际上是一个只有真正满足和更加艰难地体验的陷阱。让你的不满结晶。", "note_en": "There is one thing most people miss when they try to overcome their addiction. And they make it much more difficult for themselves.\n  It’s about  realizing you don’t want to be doing it anymore.\n  Sure, it is but that doesn’t make it a common practice because most people don’t follow this path.\n   However,  this makes them feel a constant pull towards the behavior. It’s forbidden fruit, a desire that they’re trying to run away from.\n It often looks like this: “I should stop smoking, it’s bad for me and costs me a lot of money”.\n    When a bad day comes, a lot of people give up their attempt to quit and smoke again.\n    It’s about realizing you don’t want to be doing it anymore.\n     We often mistake instant gratification for long term satisfaction (feeling a bit better immediately but feeling terrible in the long run). E.g. Escaping loneliness by scrolling on Instagram.\n Also this is often nostalgia (remembering the good old days). The thing in the past brought us satisfaction and we remember it like that. E.g. playing old games\n Addictions often start as a way to find pleasure, but over time they turn into a form of pain avoidance. You no longer get satisfaction from indulging, you just feel psychological pain if you don’t.\n However, if you realize that the addiction is ultimately empty, and doesn’t really add anything good to your life, then you’re on the right path.\n   Most people abandon things when they lose interest. In addictions, losing interest (seeing through the illusion) is a bit more difficult because your brain is wired towards craving the thing. The illusion makes you believe that the thing is the way to achieve satisfaction.\n If you realize that watching YouTube videos isn’t fun like it used to be or you thought it was (the illusion that it is fun), it loses a lot of its appeal.\n If you see through this illusion, you don’t feel the desire to do it anymore.\n Is it possible to quit without coming to this realization by yourself? Definitely, but it’s simply much harder and probably less healthy because you will always feel the pull. You might always feel the desire towards the thing.\n But what if you already know the activity is bad for you, and you still do it anyway?\n       People can help you realize the reasons by showing you. People can help you label the issues the thing causes you that haven’t been able to name yourself. People can give you the information (like we do in  Reasons to stop surfing mindlessly).\n However, it’s you that needs to internalize them, or even better come to your own conclusions.\n  Everyone should have their own reasons for why they don’t want to do it. Generic arguments won’t stand.\n  In reality, being addicted to the Internet pulled me away from real satisfaction. It actually started pulling me away from any real joy in life. I started to feel disengaged.\n I dissected my Internet behaviors and with all of them, I could logically explain why they brought me further away from satisfaction. I mistook immediate gratification for actual satisfaction.\n  Reading news multiple times per day doesn’t make me more informed - it makes me more stressed. I lose the ability to see the bigger picture.\n Watching YouTube videos instead of real entertainment fills my head with the information I don’t need or care about.\n Scrolling on Instagram doesn’t make me more connected, on the contrary, it sometimes makes me feel lonely.\n   Often, we like to stay in denial - hiding from the hard truths. It’s a way to rationalize why you’re doing what you’re doing. This denial protects our fragile egos.\n I deserve to have a drink or two after a long day at work. - In reality, drinking every evening.\n I need to scroll on my phone in the morning, otherwise, I won’t wake up. - Wasting morning energy and ending up rushed/late because of it.\n  Of course, others usually notice this kind of self-deception more clearly than we do ourselves. If they care about you, they try to show you the way out of denial but we’re often close-minded to their suggestions.\n Sometimes only after we quit, we start seeing the negative things we were lying about to ourselves. Only after you’re further away, you can see how ridiculous were the actions of your past self.\n  Some kinds of addictions are strong. They don’t let you come to this realization while you’re actively engaging in the addictive behavior. Only after you quit, you come to realize how harmful they were to you and how heavily addicted you were. Often a weekend is enough to experience this.\n For example, my catalyst was traveling for a week. A few years ago, I was addicted to playing video games but when I traveled for a week and didn’t have the access to playing video games, I realized how much better my life was. When I came back and felt the urge to play again, the first day I realized how it’s a false promise that steers me off living a fulfilling life. The next day I quit with no regrets and I haven’t looked back since.\n This is why different challenges are popular because they allow people to see what life can be without addictive behavior. People mistakenly believe just abstaining is the solution but we’ve covered this here already.\n   There are 2 main things you can do to come to the realization that addiction is empty of satisfaction and that you actually don’t want to do this anymore.\n Reflect on the cost of the addiction. Reflect on how it’s not fulfilling you at all. How you feel after you’ve indulged. Pondering the personal negative effects that a specific behavior has on your life is a good initial step. Bonus points if you do this in writing.\n Abstain for a couple of days as an experiment. Remove a distracting app from your phone for a weekend. Plan a trip that will take you away from the environment that makes the addiction easy to engage in.\n Ponder your addictive behavior. Realize that it doesn’t bring you the satisfaction it promised and that it’s actually a trap that only makes real satisfaction and joy much harder to experience.  Let your discontent crystallize.\n But these are only some tips. You need to come to this conclusion by yourself, we (or others) can only help you see the way.\n When you voluntarily come to the conclusion that you want to quit, the desire to engage in the problematic behavior will gradually fade away. And it’s much more likely that you’ll actually change.", "posttime": "2022-01-09 22:08:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "成瘾,addiction,看到", "title": "如何让您的成瘾更容易", "title_en": "How to make quitting your addiction easier", "transed": 1, "url": "https://www.deprocrastination.co/blog/how-to-make-quitting-your-addiction-easier", "via": "", "real_tags": ["成瘾", "addiction", "看到"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072475, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "......以前所未有的历史准确性重新创建传奇的RMS泰坦尼克。从豪华楼梯的豪华栏杆到锅炉房的煤尘空气，泰坦尼克号是您的探索，她很多故事都是您的发现。\n目睹了航行，忍受了曾经建造的最豪华的大洋划线的沉没。", "note_en": "...aboard the legendary RMS Titanic recreated with unprecedented historical accuracy. From the lavish balustrades of the Grand Staircase to the coal dusted air of the boiler rooms, Titanic is yours to explore and her many stories are yours to discover.\n    Walk the decks of a fully recreated and historically perfected Titanic as she appeared on her maiden - and only - voyage.\n      Uncover Titanic’s infamous history and the stories of her passengers and crew as you catalog your journey through this massive Titanic museum.\n      Witness the voyage and endure the sinking of the grandest, most luxurious ocean liner ever built.\n  ...aboard the legendary RMS Titanic recreated with unprecedented historical accuracy. From the lavish balustrades of the Grand Staircase to the coal dusted air of the boiler rooms, Titanic is yours to explore and her many stories are yours to discover.\n  Walk the decks of a fully recreated and historically perfected Titanic as she appeared on her maiden - and only - voyage.\n  Uncover all that is known of Titanic’s infamous history as you catalog your journey through this massive Titanic museum.\n  Witness the voyage and endure the sinking of the grandest, most luxurious ocean liner ever built.\n      Please choose your currency, type in your donation amount and checkout with your credit / debit card or with PayPal.\n  If you pay with your credit/debit card, THG receives more of your donation due to lower fees!\n          $     Please ensure you have entered a numerical value in the amount box.", "posttime": "2022-01-09 22:08:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "荣耀,honor,历史", "title": "泰坦尼克号：荣耀和荣耀", "title_en": "Titanic: Honor and Glory", "transed": 1, "url": "https://www.titanichg.com", "via": "", "real_tags": ["荣耀", "honor", "历史"]}, {"category": "", "categoryclass": "", "imagename": "7cf484ceeae6bc7fc2161eddc603cd15.jpg", "infoid": 1072474, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有些人可能认为Fortran是一种古老的语言，当然不是应该教授的语言，但在任何方面，现代福特兰是一种专注的语言，以教导编程。肯定比C及其特质更好。比Python或Julia好吗？在许多情况下是的。当然，I / O这样的事情对这些语言的新手程序员仍然存在问题。部分原因是现代福斯坦易于阅读和理解，这是第一次学习为个人学习的重要因素。介绍语言的想法并不一定是它们适合商业努力，而是易于实现算法，（ii）可读，（iii）不包含将混淆和迷惑的东西。", "note_en": "Some may think Fortran is an archaic language, and certainly not one that should be taught, but in any respects modern Fortran is an exceptionally good language to teach programming in. Certainly better than  C and its idiosyncrasies. Better than Python or Julia you say? In many cases yes. Certainly things like I/O are still problematic for the novice programmer in these languages. Partially it is because modern Fortran is easy to read and comprehend, which is an important factor for the individual learning to program for the first time. The idea of introductory languages is not necessarily that they are suited to commercial endeavours, but rather that they are (i) easy to implement algorithm in, (ii) readable, and (iii) do not contain things that will confuse and bewilder.\n Let’s perform the simple task of calculating the distance to the horizon. The calculation is quite simple, all that is required is the height of your eye, i.e. the distance that your eyes are off the surface of the water. The formula for calculating the distance,  d, is  d=√(2rh), where  r is the radius of the earth (6367.45km), and  h is the height of the object in metres (divided by 1000 to convert to km). So for an observer standing in a tower 42m above sea level, the distance to the horizon is  d=√(2×6367.45×(42/1000)) = 23.13km. So a program to calculate this in Fortran would look like this:\n  There is very little the novice programmer could not understand in this program – even without having any real notion of the syntax of Fortran. The terms  read and  write imply something is being input and output, the distance calculation is effectively just an equation. The only real sticking point maybe the variable declaration on the second line. The equivalent C program is somewhat more challenging.\n  Firstly it is four lines longer, and the only thing the same between the two programs is the equation. Two of the lines in the C program are taken up including libraries for I/O and math functions – which Fortran doesn’t require. The  printf function deals with output, and is quasi-intuitive… the  scanf function is not at all intuitive. What about  int main(void) – muddy. What about the Python program, surely it must be better than both Fortran and C?\n  Python dispenses with the notion of defining the “program”, allowing the algorithm to take place with little fanfare… I mean it is only 4 lines. But the math library still has to be imported. The prompt for the height is combined together with reading in the value, which is nice and compact, but the user will still question what  float() is doing. And Julia?\n  It suffers from input issues as well, chomping and parsing things – things novice programmers don’t care to know about. The commonality among all these programs is of course the calculation. The usability of a programming language is likely associated with how well it uses appropriate words to describe functions and actions, and uses symbols appropriately.", "posttime": "2022-01-09 22:07:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "fortran,easy,语言", "title": "Fortran很容易学习", "title_en": "Fortran is easy to learn", "transed": 1, "url": "https://craftofcoding.wordpress.com/2022/01/05/why-fortran-is-easy-to-learn/", "via": "", "real_tags": ["fortran", "easy", "语言"]}, {"category": "", "categoryclass": "", "imagename": "7d28451dd24205055e1fac71db27af2a.png", "infoid": 1072473, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Paul McBride的一个努力提醒", "note_en": "A stoic reminder by Paul McBride", "posttime": "2022-01-09 22:07:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "死亡,death,paul", "title": "死亡时钟", "title_en": "Death Clock", "transed": 1, "url": "https://thedeathclock.co/", "via": "", "real_tags": ["死亡", "death", "paul"]}]