[{"category": "", "categoryclass": "", "imagename": "672f9aa408dd8815427c4ce87277d574.jpg", "infoid": 1071164, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周四，俄罗斯新的大型空间站模块 Nauka 在前往轨道实验室途中遇到了几个技术问题后，终于与国际空间站对接。然而，问题并没有就此结束。连接到空间站大约三个小时后，瑙卡开始发射推进器，使空间站失去平衡。这导致位于休斯敦的 NASA 任务控制中心在空间站上启动了“失去姿态控制”程序，这是为应急宇航员和飞行控制员训练的。然后，在莫斯科的飞行控制员的配合下，这些团队命令空间站向空间站的俄罗斯部分以及连接到实验室的 Progress 补给车发射推进器。在 Nauka 耗尽其主要燃料供应之前，这些联合行动防止了空间站过于剧烈地翻滚。在这次差点失误之后，美国宇航局匆忙召开了新闻发布会，并在媒体面前公布了关键人物，包括载人航天主管凯西·卢德斯和国际空间站计划的负责人乔尔·蒙塔尔巴诺。两人都表示，美国宇航局和俄罗斯航天公司 Roscosmos 掌握了情况，并淡化了空间站和机上宇航员的整体风险。然而，他们将许多关于技术问题的问题推迟到 Roscosmos，后者提供了混合信息。 Roscosmos的一位高级官员，前宇航员弗拉基米尔·索洛维约夫在一份官方声明中说：“由于短期软件故障，错误地执行了直接命令打开模块引擎进行撤出，导致方向有所修改整个综合体。”这使问题听起来像是软件错误。但后来，Roscosmos 的负责人德米特里·罗戈津（Dmitry Rogozin）承认，地面上的某个人可能犯了错误。据路透社报道，他对一家俄罗斯出版物说：“一切进展顺利，但存在人为因素。” “有一些欣快感（在成功对接之后），每个人都放松了。”既然眼前的危险已经过去，最紧迫的担忧是这是否发生了，以及这对俄罗斯继续参与国际空间站计划可能意味着什么。对于 NASA 来说，主要目标是在低地球轨道上保持人类的存在，这意味着在 2020 年代的剩余时间里飞行该站。考虑到 Nauka 错误的推进器点火可能涉及人为错误，这至少是不到三年内由于劣质工作导致的第三个主要问题。 2018 年 10 月，俄罗斯宇航员 Aleksey Ovchinin 和 NASA 宇航员 Nick Hague 在联盟号助推器故障后中止发射，机组人员不得不紧急返回地球。随后的调查发现，侧面安装的助推器与联盟号火箭的核心级连接不当。\n大约在同一时间，俄罗斯宣布另一艘联盟号飞船上有一个小洞，该飞船已经连接到国际空间站。 Rogozin 谈到这个问题时说：“我们能够将原因缩小到技术人员的技术错误。”这些技术错误发生的原因是 Roscosmos 难以支付其工程师和技术人员的生活工资。现在该国的太空预算面临着由于 SpaceX 的 Crew Dragon 飞行器以及有望很快推出波音的 Starliner，NASA 不再需要为其宇航员购买联盟号座椅以供其前往国际空间站。尽管如此，NASA 仍然公开支持俄罗斯及其太空计划。而且必须松口气的是，尽管它在到达空间站时遇到了无数的麻烦，但 Nauka 现在在那里并发挥作用。这很重要，因为它可能会巩固俄罗斯在这十年余下的时间里参与空间站的活动。这并不能保证。最近几个月，俄罗斯官员开始表示，Roscosmos 在轨现有的硬件，其中大部分已有 20 多年的历史。无法修复。俄罗斯人还表示，他们可能会在 2025 年退出该计划并建造一个全新的车站。事实上，就在星期六，也就是在 Nauka 麻烦的对接两天后，Roscosmos 发表了一份声明，称它正在继续研究一个名为俄罗斯轨道服务站的低地球轨道新站项目。这似乎很可能是装腔作势，因为俄罗斯既没有预算也没有能力快速建造新的空间站。那么，NASA 的问题就变成了，它愿意依赖一个明显存在技术问题、总是要求更多资金、并且想要退出空间站合作伙伴关系的合作伙伴，该合作伙伴已经存在了多久？现在大约三年。 NASA 声明的意图是在低地球轨道上保持存在。到 2028 年或之后不久，它希望在那里运行商业空间站。但在那之前，国际空间站是美国宇航局在城里唯一的游戏。如果俄罗斯人变得更不可靠，U 航天局有选择，但这些都需要时间来实施。 NASA 可以向 Axiom 这样的公司支付费用，以加快其将与空间站对接的商业模块的开发，该模块可以接管现在连接到空间站的俄罗斯服务模块的推进任务。或者它甚至可以与SpaceX这样的公司签订合同，将其星际飞船停靠在空间站以保持其高度。\n就目前而言，NASA 与 Roscosmos 的关系似乎并未处于破裂点，但是，就像老化的空间站一样，它正在显示出磨损、撕裂和破裂的迹象。 Roscosmos 可以通过与 NASA 明确 Nauka 到底发生了什么并致力于合作伙伴关系的未来来应用一些急需的迫击炮。", "note_en": "Last Thursday the large new Russian space station module, Nauka, finally docked with the International Space Station after several technical issues en route to the orbiting laboratory. However, the problems did not end there. About three hours after linking to the station, Nauka began firing its propulsion thrusters,  throwing the space station off kilter.\n This led NASA Mission Control in Houston to initiate &#34;loss of attitude control&#34; procedures on board the station, a contingency astronauts and flight controllers train for. Then, in concert with flight controllers in Moscow, the teams commanded the station to fire its thrusters on the Russian segment of the space station, as well as a Progress supply vehicle attached to the laboratory. These combined actions prevented the station from tumbling too violently until Nauka exhausted its primary fuel supply.\n  Following this near miss, NASA hastily called a news conference and brought out key figures before the media, including human spaceflight chief Kathy Lueders and the leader of the International Space Station program, Joel Montalbano. Both said NASA and the Russian space corporation, Roscosmos, had the situation well in hand and downplayed the overall risk to the station and the astronauts on board.\n However, they deferred many questions on the technical issues to Roscosmos, which has offered mixed messages. A senior official in Roscosmos, former cosmonaut Vladimir Solovyov,  said in an official statement, &#34;Due to a short-term software failure, a direct command was mistakenly implemented to turn on the module&#39;s engines for withdrawal, which led to some modification of the orientation of the complex as a whole.&#34;\n This makes the problem sound like a software error. But later, the head of Roscosmos, Dmitry Rogozin, acknowledged that someone on the ground could have made a mistake. &#34;Everything was going well, but there was a human factor,&#34; he told a Russian publication,  as reported by Reuters. &#34;There was some euphoria (after the successful docking), everybody got relaxed.&#34;\n    Now that the immediate danger has passed, the most pressing concerns are that this happened at all and what it may mean for ongoing Russian participation in the International Space Station program. For NASA, the primary goal is to maintain a human presence in low Earth orbit, and this means flying the station for the remainder of the 2020s.\n  Given the likelihood that Nauka&#39;s errant thruster firing involved human error, that would be at least the third major problem in less than three years resulting from shoddy work. In October 2018, the launch of Russian cosmonaut Aleksey Ovchinin and NASA astronaut Nick Hague was aborted after a Soyuz booster failure, and the crew had to make an emergency return to Earth. A subsequent investigation  found that the side-mounted booster had been improperly mated to the core stage of the Soyuz rocket.\n  At around the same time, Russia announced that there was a small hole in a different Soyuz vehicle, already attached to the International Space Station. “We are able to narrow down the cause to a technological mistake of a technician,&#34;  Rogozin said of the problem.\n These technical errors have occurred as Roscosmos has had difficulty paying its engineers and technicians a living wage. And now the country&#39;s space budget faces further pressure as NASA no longer needs to buy Soyuz seats for its astronauts to ride to the International Space Station—thanks to SpaceX&#39;s Crew Dragon vehicle and, hopefully soon, Boeing&#39;s Starliner.\n Despite all of this, NASA has remained publicly supportive of Russia and its space program. And it has to be relieved that, regardless of its myriad troubles in getting to the space station, Nauka is now there and functional. This is important because it  likely cements Russian participation in the space station for the remainder of this decade.\n    There is no guarantee of that. In recent months Russian officials have begun saying that Roscosmos&#39; existing hardware on orbit, much of which is more than two decades old, is aging beyond repair. The Russians  have also suggested they may pull out of the program in 2025 and build a brand-new station. Indeed, just on Saturday, two days after Nauka&#39;s troublesome docking, Roscosmos issued a statement saying it was  continuing a study of a new station project in low Earth orbit called the Russian Orbital Service Station. This seems very likely to be posturing, as Russia has neither the budget nor likely the ability to rapidly build a new space station.\n The question for NASA becomes, then, how long it is willing to rely on a partner that is clearly having technical issues with its workforce, is always asking for more money, and making noises about wanting to exit the space station partnership that has existed for about three decades now.\n NASA&#39;s stated intent is to maintain a presence in low Earth orbit. By 2028 or shortly after, it hopes to have commercial space stations operating there. But until that time, the International Space Station is NASA&#39;s only game in town. Should the Russians become even less reliable, the U space agency has options, but those will take time to implement.\n NASA could pay a company like Axiom to accelerate development of its commercial module that will dock to the station, which could take over the propulsion tasks of the Russian Service Module now attached to the station. Or it could even give a company like SpaceX a contract to dock its Starship vehicle at the space station to maintain its altitude.\n For now, it does not appear as though the NASA-Roscosmos relationship is at the breaking point, but, like the aging space station, it is showing signs of wear, tear, and cracking. Roscosmos could apply some much-needed mortar by being clear with NASA about what exactly happened with Nauka and committing to the future of the partnership.", "posttime": "2021-08-02 21:11:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "模块,module,空间站", "title": "Nauka模块的未遂事件引发了对空间站未来的担忧", "title_en": "Nauka module’s near miss raises concerns about future of space station", "transed": 1, "url": "https://arstechnica.com/science/2021/08/nauka-modules-near-miss-raises-concerns-about-future-of-space-station/", "via": "", "real_tags": ["模块", "module", "空间站"]}, {"category": "", "categoryclass": "", "imagename": "c2086f44543491c3b4f6e9c2c40ce7b4.jpg", "infoid": 1071162, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多年来，它见证了许多令人印象深刻的退出，证明了它的眼睛可以在赢家自己意识到之前就发现赢家。事实上，正是合伙人 David Tisch 认为对公司的早期信心是 BoxGroup 成功的关键。 “如果你要创办一家公司并且要筹集资金，那么第一个是是最难的。正是它给了你信心和兴奋——知道有人会相信这一点并为此给你钱，”合伙人大卫蒂施告诉 TechCrunch。 “我们确实努力为自己经常成为第一个肯定的人而感到自豪。因此，我们越早与公司见面越好。”今天，BoxGroup 宣布它已经加强了它的资金储备，以便通过关闭两个总额为 2.55 亿美元的新基金，它可以成为更多公司的“第一个同意”。 BoxGroup Five 是该公司的第五只早期基金，旨在投资处于种子前和种子阶段的新兴科技公司。 BoxGroup Strive 是其第二个机会基金，将在随后的后续轮次中支持公司。每个基金的金额为 1.275 亿美元。多年来，BoxGroup 已经进行了 300 多项投资，其中包括对 Ro、Plaid、Airtable、Workrise、Scopely、Bowery Farms、Ramp、Titan、Warby Parker、Classpass、Guideline 和 Glossier 的最早几轮投资。它在 Flatiron Health、PillPack、Matterport、Oscar、Mirror、Bark、Bread 和 Trello 方面有许多令人印象深刻的退出。除了是第一家开出 Plaid 支票的公司，BoxGroup 还是 PillPack 的第一个投资者，PillPack 最终在 2018 年以不到 10 亿美元的价格卖给了亚马逊。 BoxGroup Five——该公司的早期基金——将投资约 40 到每年有 50 家新公司，投资范围从 250,000 美元到 100 万美元不等。 “我们希望成为一轮中第二大或第三大支票，”蒂施说。\n机会基金偶尔会对新公司进行后期投资，但大多只是继续支持其早期投资的公司。例如，BoxGroup 于 2010 年首次投资 id.me。“这家公司在一夜之间取得了 11 年的成功，我们已经支持了十多年，”Tisch 说。 “这是我们继续支持公司度过生命周期的一个例子。” BoxGroup 还为数字医疗初创公司 Ro 提供了种子资金，但也为自那以后筹集的每一轮融资，包括最近一次以 50 亿美元估值的 5 亿美元融资。 Tisch 将 BoxGroup 的六人团队描述为投资领域的“通才”，其投资组合包括消费者、企业、金融科技、医疗保健、市场、合成生物学和气候领域的初创公司。有趣的是，BoxGroup 上一次关闭的基金总额为 1.65 亿美元，这标志着该公司九年来首次接受外部资金。在此之前，它仅由个人资本资助。它的有限合伙人是由捐赠基金、基金会和家族办公室组成的混合团体。合伙人 Nimi Katragadda 表示，对于 BoxGroup 而言，与创始人建立真实的关系是公司工作的根本。这包括对创始人下注，有时甚至不止一次，即使他们的一家公司没有成功。这意味着在某些情况下只支持想法和人。 “这不能是交易性的，它必须是个人的，”她说。 “我们想和某人一起踏上十年的旅程，因为他们建立自己的业务......我们对早期的含义感到满意，包括很多假设、比牵引力更多的愿景和原始产品。”\n合伙人 Adam Rothenberg 表示同意，他说：“我们的目标是成为房间里的朋友。我们相信在与创始人建立关系时要诚实、坚定的爱和透明。我们更关注“如何”而不是“是什么”——创始人如何思考，他们将如何构建产品，以及他们如何考虑吸引人才。” Tisch 表示，该公司在旧金山和纽约设有办事处，随着 BoxGroup 寻求增加一些“一线投资者”，该公司可能会在不久的将来发展壮大。最近，Greg Rosen 被任命为该公司的合伙人。 Rosen 最初于 2015 年加入 BoxGroup，他在那里待了三年才离开加入 Benchmark。他于 2020 年初重新加入 BoxGroup，并加入了该公司的其他三位合伙人：Tisch、Rothenberg 和 Katragadda。虽然现在风险投资的世界非常火爆，但 Tisch 表示，该公司以一种只能通过经验和及时获得的智慧来保持自己的基础。 “似乎有无限的资本等待部署，”他说。 “无需调用周期，我们知道随着时间的推移，市场会起起落落……无论我们处于给定的周期中的哪个位置，聪明而坚定的头脑都会齐心协力建立重要的技术公司。我们的工作是确保我们会见这些创始人，并明智地选择与哪些创始人合作 10 多年的旅程。”", "note_en": "It has seen a number of impressive exits over the years, proving an eye that can detect winners before the winners themselves may even realize it. In fact, it’s that early faith in companies that partner David Tisch believes has been key to BoxGroup’s success.\n “If you’re starting a company and you’re going to raise money, that first yes is the hardest. And it’s that’s the one that  gives you the confidence, the excitement – to know that there’s somebody out there that’s going to believe in this and give you money for it,” Partner David Tisch told TechCrunch. “We really do try to pride ourselves on being that first yes on a regular basis. So the earlier we meet companies, the better.”\n  Today, BoxGroup is announcing it has beefed up its war chest so that it can be that “first yes” to more companies with the closure of two new funds  totaling $255 million of capital. BoxGroup Five is the firm’s fifth early stage fund, and is aimed at investing in emerging tech companies at the pre-seed and seed stages. BoxGroup Strive is its second opportunity fund that will back companies in their subsequent follow-on rounds. Each fund amounts to $127.5 million.\n Over the years, BoxGroup has  made over 300 investments including having invested in the earliest rounds of Ro, Plaid, Airtable, Workrise, Scopely, Bowery Farms, Ramp, Titan,  Warby Parker, Classpass, Guideline and Glossier. It has had a number of impressive exits in Flatiron Health, PillPack, Matterport, Oscar, Mirror, Bark, Bread and Trello.\n  Besides being the first firm to write Plaid a check, BoxGroup was also the first investor in PillPack, which ended up   selling to Amazon  for just under $1 billion in 2018.\n BoxGroup Five – the firm’s early-stage fund – will  invest in about 40 to 50 new companies a year with investments ranging from $250,000 to $1 million.\n “We want to be the second or third biggest check in a round,” Tisch said.\n  The opportunity fund occasionally makes later-stage investments in new companies, but mostly just continues to support companies it invested in at an earlier stage. For example, BoxGroup first invested in  id.me in 2010.\n “The company is  sort of an 11-year overnight success that we’ve been backing for over a decade now,” Tisch said. “It’s an example of us just continuing to support companies through their life cycle.”\n BoxGroup also pre-seeded digital healthcare startup Ro, but also funded every round it’s raised since, including its most recent  $500 million funding at a $5 billion valuation.\n Tisch describes the BoxGroup six-person team as “generalists” in terms of the spaces it invests in, with a portfolio consisting of startups in the consumer, enterprise, fintech, healthcare, marketplace, synthetic biology and climate sectors.\n Interestingly,  BoxGroup’s last fund closures – which totaled $165 million – marked the first time the firm had accepted outside capital in nine years. Prior to that point, it had been funded with only personal capital. Its LPs are a mixed group of endowments, foundations and family offices.\n For BoxGroup, building authentic relationships with founders is at the root of what the firm does, says  Partner Nimi Katragadda. That includes taking bets on founders, sometimes more than once, even if one of their companies didn’t work out. It means backing just ideas in some cases, and people.\n “This cannot be transactional, it has to be personal,” she said. “We want to go on a journey with someone for a decade as they build their business…. We’re comfortable with what early means, including a lot of assumptions, more vision t han traction, and raw product.”\n Partner Adam Rothenberg agrees, saying: “Our goal is to be the friend in the room. We believe in honesty, tough love, and transparency in building relationships with founders. We focus on the “how” more than the “what” — how a founder thinks, how they will build product, and how they think about attracting talent.”\n With offices in San Francisco and New York, the firm will likely be growing in the near future as BoxGroup is looking to add on some “first-line investors,” Tisch said.\n Recently,  Greg Rosen was named a partner at the firm. Rosen originally joined BoxGroup in 2015, where he spent three years before leaving to join Benchmark. He re-joined BoxGroup in early 2020 and joins the firm’s three other partners: Tisch, Rothenberg and Katragadda.\n While the world of venture is crazy hot right now, Tisch said the firm keeps itself grounded with a wisdom that can only be gained with experience and in time.\n “There is seemingly infinite capital waiting to be deployed,” he said. “Without calling the cycle, we know that over time markets go up and down…No matter where we are in a given cycle, smart and determined minds will come together to build important technology companies. Our job is to make sure we are meeting those founders and choosing wisely about which ones to partner with for 10+ year journeys.”", "posttime": "2021-08-02 21:10:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "早期,startups", "title": "BoxGroup 以 2.55 亿美元的资金筹集了两支基金，以支持初创公司的早期阶段", "title_en": "\n\t\t\t\tBoxGroup closes on $255M across two funds to back startups at their earliest stages\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/02/boxgroup-closes-on-255m-across-two-funds/", "via": "", "real_tags": ["早期", "startups"]}, {"category": "", "categoryclass": "", "imagename": "efee49be567fe429e7be4440ed019e94.jpg", "infoid": 1071161, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据 Dealroom 的数据，欧洲金融科技公司在 2021 年筹集了 123 亿美元，但市场仍然为 B2B 金融科技初创公司提供更多资金。因此，专注于 B2B 金融科技的 Element Ventures 宣布设立 1.3 亿美元的基金，以在这一新的金融科技企业趋势上加倍投资也就不足为奇了。 Element 由金融服务资深人士史蒂夫·吉布森 (Steve Gibson) 和迈克尔·麦克法根 (Michael McFadgen) 创立，并由 Spencer Lake（汇丰银行前全球银行和市场副董事长）加入，得到了面向金融的有限合伙人以及该行业约 30 位创始人和高管的支持。 Element 表示将专注于它所谓的“高信念投资策略”，这意味着每年只投资约 15 家公司，但它表示，为其投资组合提供“高水平的支持”。到目前为止，它已经支持了英国和欧洲的 B2B 金融科技公司，包括 Hepster（总共筹集了 1000 万美元），这是我最近报道的德国以外的嵌入式保险平台； Billhop（总共筹集了 670 万美元），瑞典以外的 B2B 支付网络； Coincover（共筹集了 1160 万美元），英国以外的加密货币恢复服务；以及瑞典以外的订阅管理平台 Minna（共筹集了 2500 万美元）。 Element Ventures 合伙人 McFadgen 在电话中对我说：“Steven 和我一直在共同投资 B2B 金融科技。 2018 年，我们有机会启动 element，而 Spencer 在 2019 年加入了野猪。因此，Element 作为一家独立风险投资公司确实是我们长期以来参与的战略的延续。”吉布森补充说：“我们对欧洲的运动以及这些欧洲金融科技和保险科技公司所取得的突破深信不疑。保险业一直是创新的沙漠，而这种情况正在发生变化。你可以看到，我们正试图围绕那些拥有突破性时刻的公司建立一个网络，不仅提供资金，还提供我们认为是故事一部分的所有其他东西。从 A 到 C 和 D 建立公司是我们尝试卷起袖子帮助这些公司的领域。”", "note_en": "European fintech companies have raised $12.3bn in 2021 according to Dealroom, but the market is still wide-open for a great deal more funding for B2B fintech startups.\n So it’s little surprise that B2B fintech-focused  Element Ventures, has announced a $130 million fund to double-down on this new FinTech enterprise trend.\n  Founded by financial services veterans Steve Gibson and Michael McFadgen, and joined by Spencer Lake (HSBC’s former Vice Chairman of Global Banking and Markets) Element is backed by finance-oriented LPs and some 30 founders and executives from the sector.\n Element says it will focus on what it calls a “high conviction investment strategy,” which will mean investing in only around 15 companies a year, but, it says, providing a “high level of support” to its portfolio.\n So far it has backed B2B fintech firms across the UK and Europe including Hepster (total raised $10M), the embedded insurance platform out of Germany  which I recently reported on; Billhop (total raised $6.7M), the B2B payment network out of Sweden; Coincover (total raised $11.6M), a cryptocurrency recovery service out of the UK; and Minna (total raised $25M), the subscription management platform out of Sweden.\n  Speaking to me over a call McFadgen, Partner at Element Ventures, said: “Steven and I have been investing in B2B FinTech together for quite a long time. In 2018 we had the opportunity to start element and Spencer came on boar in 2019. So Element as an independent venture firm is really a continuation of a strategy we’ve been involved in for a long time.”\n Gibson added: “We are quite convinced by the European movement and the breakthrough these Fintech and insure tech firms in Europe are having. Insurance has been a desert for innovation and that is changing. And you can see that we’re sort of trying to build a network around companies that have those breakthrough moments and provide not just capital but all the other things we think are part of the story. Building the company from A to C and D is the area that we try and roll our sleeves up and help these firms.”", "posttime": "2021-08-02 21:10:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ventures", "title": "Element Ventures 投资 1.3 亿美元，以加倍关注金融科技企业趋势", "title_en": "\n\t\t\t\tElement Ventures pulls in $130M to double-down on the FinTech enterprise trend\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/02/element-ventures-pulls-in-130m-to-double-down-on-the-fintech-enterprise-trend/", "via": "", "real_tags": ["ventures"]}, {"category": "", "categoryclass": "", "imagename": "c3a946a44957c943c869eece6e8e0587.jpg", "infoid": 1071160, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Yes 创始人兼首席执行官 Julie Bornstein 帮助一些世界上最大和最受欢迎的品牌发展了行业领先的电子商务业务，并且还担任过 Stitch Fix 的首席运营官，这可以说是数字优先时尚的成功案例之一。然而，The Yes 是她第一次涉足创业，我们有机会与 Julie 谈论她作为创始人的所有经历。在本周的 Found 节目中，我们的每周采访播客，我们从 Julie 那里听到了关于她如何确定 The Yes 旨在解决的差距，以及她如何改变时尚品牌如何销售其商品和与客户合作的一些长期基本面的内容销售渠道。朱莉还告诉我们为什么 The Yes 知道它需要比平均水平更大的种子来实现其目标，以及她是如何走出去并得到它的。我们喜欢与朱莉聊天的时光，我们希望你喜欢听这一集的时光。当然，如果您可以订阅 Found in Apple Podcasts、Spotify、Google Podcasts 或您选择的播客应用程序，我们会很高兴。请给我们留下评论，让我们知道您的想法，或者通过 Twitter 或发送电子邮件至 found@techcrunch.com 向我们发送直接反馈，或者给我们发送语音邮件（510）936-1618。请下周再次加入我们，为我们的下一位特色创始人。", "note_en": "The Yes founder and CEO Julie Bornstein helped some of the world’s biggest and best-loved brands develop industry leading e-commerce operations, and also served as COO at Stitch Fix, arguable one of the top success stories of digital-first fashion. The Yes is her first foray into entrepreneurship, however, and we got the chance to talk to Julie all about her experience as a founder.\n On this week’s episode of Found, our weekly interview podcast, we hear from Julie all about how she identified the gap The Yes was created to address, and how she changed some of the longtime fundamentals about how fashion brands sell their wares and work with customer sales channels. Julie also tells us about why The Yes knew it needed a larger-than-average seed to accomplish its goals, and how she went out and got it.\n  We loved our time chatting with Julie, and we hope you love yours listening to the episode. And of course, we’d love if you can subscribe to  Found in Apple Podcasts, on  Spotify, on  Google Podcasts or in  your podcast app of choice. Please leave us a review and let us know what you think, or send us direct feedback either on  Twitter or via email at  found@techcrunch.com, or leave us a voicemail at (510) 936-1618. And please join us again next week for our next featured founder.", "posttime": "2021-08-02 21:10:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "经验,turned,julie", "title": "一位创始人如何将她丰富的零售经验转变为一种全新的购物方式", "title_en": "\n\t\t\t\tHow one founder turned her extensive retail experience into an entirely new kind of shopping\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/02/how-one-founder-turned-her-extensive-retail-experience-into-an-entirely-new-kind-of-shopping/", "via": "", "real_tags": ["经验", "turned", "julie"]}, {"category": "", "categoryclass": "", "imagename": "ae122b5efe49eb9afc733f5978af190d.jpg", "infoid": 1071158, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该基金将向处于种子阶段的初创公司投资 25 万至 100 万美元，以帮助他们实现 A 轮融资所需的里程碑。 Mariano Mayer，阿根廷前企业家和中小企业国家秘书，Marea Venture Partners 创始人； Sacha Spitz，Yavu Ventures 联合创始人兼合伙人，圣安德烈斯大学孵化项目前任主任；该集团已经投资了墨西哥、巴西和阿根廷的初创公司，包括 Aleph（电子商务的 B2B SaaS）、Apperto（社交商务）、Choiz（健康科技）、Exactly（DeFi）、Elevva（电子商务品牌）、Inipay （金融科技）、Leef（可持续性）、Wibson（电子隐私）和 Yerbo（健康）。 Mayer 告诉 TechCrunch，他认为拉丁美洲正在发生一个伟大的时刻，围绕着全球风险投资公司——如红杉资本、安德森霍洛维茨和软银——在该地区下注，尤其是针对后期投资。也有本土风险投资公司表现良好，比如 Kazek 的 10 亿美元基金。 “然而，我们看到种子投资和 A 轮投资之路存在差距，”他补充道。 “我们的目标是帮助处于这些阶段的企业家。 Newtopia 始于大流行期间的对话，现在我们看到了传​​统行业转型的巨大势头，以及让企业利用这些机会的人才。” Newtopia 提供投资和实践指导模式，以指导初创公司度过初始阶段，以便它们能够在区域或全球范围内发展。该基金已经聚集了一个由 70 多名创始人组成的社区，为投资组合公司提供投资、建议和风险合作伙伴。\nNewtopia 10 周计划与公司合作，寻找产品与市场的契合点，实现初始目标并为进一步增长奠定基础。该公司开始招募申请人，并将选择 10 家初创公司获得该计划的一个位置，每家可获得 100,000 美元。 Mayer 说，通过在早期投资中处于领先地位，它将为其他正在进行后期投资的风险投资公司提供资金。他看到拉丁美洲的投资每年都在增长，估计该地区的投资额达到创纪录的 40 亿美元，将一些公司变成了独角兽，其中包括 Jutard&#39;s Mural，该公司在 7 月份筹集了 5000 万美元。 Mayer 补充说，这不仅证实了未来几年将会有更多资金投入。 Jutard 表示，该基金的创始人都是自己投资或指导公司，但新的资金将使他们能够构建这种援助，以帮助数百家初创公司，而不是少数。 “早期公司会经历情绪上的过山车，他们感到孤独，遇到难以销售产品或招聘的时期，因此我们专注于建立一个支持社区，”Jutard 补充道。", "note_en": "The fund will invest between $250,000 and $1 million in startups at the seed stage to help them achieve the milestones needed on the path to raising a Series A.\n   Mariano Mayer, former national secretary for entrepreneurs and SMEs in Argentina and founder of Marea Venture Partners;\n Sacha Spitz, co-founder and partner of Yavu Ventures and former director at the Universidad de San Andrés incubation program;\n The group has already invested in startups in Mexico, Brazil and Argentina, including Aleph (B2B SaaS for e-commerce), Apperto (social commerce), Choiz (healthtech), Exactly (DeFi), Elevva (e-commerce brands), Inipay (fintech), Leef (sustainability), Wibson (e-privacy) and Yerbo (wellness).\n Mayer told TechCrunch that he sees a great moment happening in Latin America around global venture capital firms — like Sequoia Capital, Andreessen Horowitz and  SoftBank —making bets in the region, especially targeting later-stage investments. There are home-grown venture capital firms doing well, too, citing  Kazek’s $1 billion funds.\n  “However, we see a gap in investments in seed and road to Series A,” he added. “We aim to help entrepreneurs in those stages. Newtopia started with conversations during the pandemic, and now we see a big momentum for transformation of traditional sectors and the talent to make businesses out of these opportunities.”\n Newtopia is offering both investment and a hands-on mentorship model to guide startups through the initial stages so they can grow regionally or globally. The fund has already amassed a community of more than 70 founders to invest, advise and be venture partners to the portfolio companies.\n The Newtopia 10-Week Program works with companies to find product-market fit, achieve initial goals and set a foundation for further growth. The firm opened the call for applicants and will select 10 startups to receive a spot in the program and $100,000 each.\n By taking a lead in early-stage investing, it will feed the rest of the venture capital firms that are doing later-stage investing, Mayer said.\n He sees investments growing in Latin America every year, estimating there was a record $4 billion spread across the region, turning some companies into unicorns, including Jutard’s Mural, which  raised $50 million in July. That has more than validated that there will be more money in coming years, Mayer added.\n Jutard said the fund’s founders were all investing or mentoring companies on their own, but the new funding will enable them to structure that assistance to help hundreds of startups rather than a handful.\n “Early-stage companies go through an emotional rollercoaster where they feel alone, encounter times when it is hard to sell their product or recruit, so we are focused on building a community of support,” Jutard added.", "posttime": "2021-08-02 21:09:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "投资,closes", "title": "Newtopia 完成首笔 5000 万美元基金投资拉丁美洲初创公司", "title_en": "\n\t\t\t\tNewtopia closes first fund of $50M to invest in LatAm startups\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/02/newtopia-closes-first-fund-of-50m-to-invest-in-latam-startups/", "via": "", "real_tags": ["投资", "closes"]}]