[{"category": "", "categoryclass": "", "imagename": "72ec5862b7929c4b0b11d6f1fa2439c0.png", "infoid": 1009237, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大多数羽翼未丰的开源项目都使用Github或GitLab进行代码协作。但是，有一种较旧的方法是开发人员应该知道的，因为它提供了一些优势。\n另一种方法是开发人员邮件列表。它出现在80年代末到90年代初，早于网络浏览器的流行。但是，讨论列表远非仅仅是历史珍品，它仍然是许多重要开源项目(从数据库到操作系统再到Web浏览器)的主要开发方法。\n在本文中，我将仔细比较邮件列表和代码协作网站(如Github)的使用情况。我会尽最大努力展示每种方法的优缺点，以便评估这两种方法的项目能够做出明智的决定。\nGitHub托管一个GIT服务器、一个bug跟踪器、一个维基，以及发布的工件。参与讨论或代码更改需要Github身份。建议更改代码的方法是创建另一个由Github托管的项目(“fork”)，修改远程分支，并使用GUI打开从您的分支到原始分支的Pull请求。项目成员讨论注释中的更改，随后的更改作为提交推送到Pull Request分支。最终，项目所有者可以决定合并提交。\n邮件列表维护一个订户列表，这些订户接收发送到“反射器”电子邮件地址的所有消息。项目必须在其他地方承载其自己的版本控制服务器。代码更改建议通过向反射器发送一封电子邮件，并附带更改的文本差异或内联更改。列表成员通过电子邮件回复就更改进行辩论，将后续更改作为更多不同之处发送，以取代或修改原始更改。最终，项目提交者可以决定将补丁应用到代码库。\n邮件列表有三个属性，使开发人员可以比在Github UI中更精确、更灵活地进行通信：电子邮件的线程化、用户生成补丁以及自由混合讨论和补丁。\nGithub web UI有一个有限的线程模型，其中拉取请求作为一个整体有一个线程，其他线程附加到单个更改的代码行。UI显示了所选讨论行周围的几行上下文代码，但必须推断讨论中的完整代码块。\n电子邮件子线程允许对代码的不同方面或部分进行专门讨论。线性的Github风格的讨论会将这些对话混为一谈。\n与Github的评论相比，通过电子邮件进行的对话具有更大的持久性和参考价值。在Github上，评论不断变化。它们会变得“过时”，并在连接到已更改的线路时消失。提交也是如此，在强制推送到拉取请求分支之后，提交就会消失。相比之下，在电子邮件线程中，原始消息和建议的更改将保留下来，以便与以后的消息和补丁进行比较。\n此外，来自多个作者的补丁不能混合在Github拉取请求中。打开拉取请求的人“拥有”它。其他参与者可以将代码建议作为注释删除，但UI最终合并的是分支上的提交。如果Pull请求者想要合并建议的更改，他或她必须将这些注释转换为分支上的提交。\n在邮件列表上，任何人都可以自由地回复现有的帖子，提供一组新的建议补丁。另一个好的效果是，如果原作者不再关心或参与，其他人可以把补丁带到终点线。(多年来，我在我的项目的拉请求中遇到了许多MIA作者。)。\n自定义补丁是电子邮件进程通过Github UI改进通信的另一种方式。贡献者可以调整补丁的形状，使其对其他人更具可读性。\n使用Github你提交你的更改，然后Github选择如何将差异呈现给审阅者，但是当你自己创建补丁时，你可以调整设置。差异可以是统一格式或上下文格式，对于后者，上下文行的数量是可配置的。(公平地说，Github也允许围绕变化扩大背景视角。)。\n有些人认为，GIT样式的统一差异对于少数几行的小更改最为清晰，而上下文差异更适合更改较大的范围，特别是具有缩进更改的行。(为了公平起见，我应该注意到，如果在显示更改的URL中添加？w=1，则Github将隐藏缩进更改。)。\n最后，使用diff手动创建补丁可以利用其他选项，比如注释影响C函数的块标头(使用-p标志)，以及选择“Patience”等各种算法。\n耐心会多做一点工作来计算其结果，但输出对人类来说更有意义。例如，标准(非耐心)差异可能如下所示：\nvoid func1(){x+=1+}++void funcThree halves(){+x+=1.5}void func2(){x+=2}。\nvoid func1(){x+=1}+void funceHalves(){+x+=1.5+}+void func2(){x+=2}。\n最后，没有什么可以阻止邮件列表风格的协作适应新兴的差异格式，例如结构差异。这是因为电子邮件中的补丁直接描述更改，而Github呈现的是没有细微差别的增量。\n围绕一个新功能的大部分交流都是在它的提案中进行的，而不是围绕随后的代码。贡献者在编写任何代码之前提出该功能，证明其合理性，并确认其范围。社区做出了响应，通常在任何人实现任何东西的时候，想法已经从流程开始时发生了重大变化。\n这也是电子邮件非常适合小组讨论的地方，它具有上面提到的内联回复和线状结构。到了开始编码的时候，从“问题”切换到“拉请求”是没有间断的。作者简单地再次回复，并附上补丁。\nWeb应用程序提供集中控制的用户界面，而本地应用程序允许每个人定制自己的体验。像SMTP这样的开放协议促进了客户端的激增。邮件客户端也是如此，每个客户端都提供自己的功能、过滤器、文件夹、标志和乐趣。邮件客户端提供了将邮件标记为重要邮件或将其设置为未读的方法。一般来说，你不需要在五年内向中央委员会乞求更换接口，但没有失败。(碰巧，在一份非官方的回购中可以看到这份请愿书，该请愿书旨在恳求吉图布诸神。)。\n有些人编写邮件客户端脚本，以便可以使用键盘快捷键应用补丁程序，有些人选择极简主义，还有一些人甚至使用Webmail。每个人都是不同的，他们的软件也是不同的，但邮件列表的性质允许他们所有人一起工作。\n另一个控制区域是脱机时搜索邮件列表并与之交互的能力。这通常是自愿的，而不是必然的。城市和郊区通常可以随时随地使用互联网接入，如果需要的话，可以使用蜂窝服务。事情不再像以前那样有断断续续的拨号连接，但脱机工作是一些人更喜欢的选择。\n虽然Git本身是分布式的，并且在没有网络连接的情况下在本地运行，但Github需要连接才能检查问题和拉入请求。为一项本质上需要反思的单独任务要求连通性是不合理的。\n请记住，在线有两个方向：开发者的互联网连接和Github的正常运行时间。虽然后者已经相当稳定了一段时间，但我确实记得有几次我的整个办公室因为Github停机而脱轨。对于愤怒的国家和野心勃勃的黑客来说，拿下Github是一个很有吸引力的目标。\n使用本机电子邮件客户端，您可以脱机查看所有电子邮件和附件。您甚至可以脱机发送对邮件的回复，客户端将对它们进行排队，直到可以访问Internet为止。\n另一方面，邮件列表服务器的正常运行时间，发送到脱机服务器的邮件最终将通过。电子邮件链上的邮件传输代理被设计为重试传输。此外，开发人员列表建议用户“全部回复”消息，以便线程中涉及的每个人以及列表反射器地址都能收到消息。这样，即使反射器离线，您的电子邮件也可以直达最近参与的人。\n归根结底，邮件列表开发风格所享有的控制和可定制性来自于为开放标准构建的各种工具。补丁文件是普遍支持的(git本身直接支持补丁)，SMTP有一个RFC。工具可以协同工作，而不是将GUI锁定在浏览器中。\nGit最初是为了逃避BitKeeper而创建的，BitKeeper是一个具有相关集中托管的版本控制系统。BitKeeper为开源项目授予了免费许可，并要求项目将其元数据存储在公司服务器上。\n那么，Git的用户选择了Github…，这真是历史的转折。为开源项目授予免费许可证的集中式主机，并要求项目将其元数据存储在公司服务器上。\nGitHub可以合法删除项目或用户，无论是否有原因。这当然是有意义的，因为这些项目使用的是Github拥有的计算机。此外，虽然没有像BitKeeper那样明确禁止竞争项目的开发，但Github仍然可以查看所有选择与它们一起托管的公司的私人源代码。\n说真的，Github(或任何利润驱动但免费的代码托管服务)的未来是什么？历史提供了SourceForge的例子，SourceForge是世纪之交首屈一指的代码协作平台。在被Dice.com收购后，SourceForge为赚取更多资金做了最后的努力，劫持了托管项目，以便它们的安装程序将包括广告软件和间谍软件。\n当我第一次开始为这篇文章做笔记时，对Github的影响纯粹是假设的，但即使在撰写本文时，有消息称微软正在收购Github。说Github可能进入“SourceForge阶段”并不牵强。\n然而，让这一教训比吉瑟布更广泛。同样的逻辑也适用于集中和组合程序员通信和托管的其他Web平台。\n一些主要的开放源码项目，如PostgreSQL数据库，非常安全，并明确选择从不将代码放在外部公司服务器上(镜像除外)。Postgres还煞费苦心地将控制权放在一个横跨多家公司的管理机构中。任何公司都不允许大多数提交者，组织的设计是为了独立生存。\n并不是所有的项目都重要到需要这种程度的中立，但所有的项目都应该掌握自己的命运。\n我们正在讨论的基本任务是代码更改的异步组通信。补丁是一种普遍理解的描述代码更改的方式，而电子邮件是一种普遍理解的通信方法。因此，这种方法似乎与手头的问题相匹配。\n事实上，通过电子邮件发送补丁适用于任何版本控制系统，而不仅仅是Git。OpenBSD项目仍然很乐意将邮件列表与CVS结合使用。补丁作者根本不需要安装任何版本控制软件。作者可以下载源代码发行版tarball、在副本中进行更改、捕获差异并通过电子邮件发送。\n发送和应用补丁程序省去了一些工作，比如合并后清理远程分支，或者在派生的回购中创建本地分支以准备拉入请求。作为对比，我记得我教过一群新程序员如何使用Github，在我要求他们做所有奇怪的步骤时，我都是有意识的。\n完成通信的工作也更少了。没有需要“清理”的东西，比如放弃的拉取请求、合并的分支或要标记为已关闭的问题。回复只是停留在那些帖子上。稍后会有更多关于这一点的负面信息，但目前来看好的一面。\n使用电子邮件还可以将数字身份从Github这样的网站上的账户中分离出来，并最终信任由国际组织ICANN管理的DNS系统。有关这方面的更多信息，请参阅我的文章“回归最初的社交网络”。PGP通过分散的信任网络提供进一步的身份保证。请看我录制的尼尔·沃尔菲尔德的演讲“GnuPG的高级入门”(The Advanced Intro To GnuPG)。\n邮件列表方法带来了相当多的问题和困难。我已经尽了最大努力承认这些问题，并提出可能的解决方案。\n当您浏览Github项目时，您确切地知道它是如何工作的。当然，插件/配置项/挂钩可能会有所不同，设置项目可能会涉及一些扭曲，但浏览代码、查找已知bug和提交更改的过程总是相同的。对于有自己的网络存在和邮件列表的项目来说，这绝对不是真的。\n我甚至听到人们说，“如果一个项目不在Github上，那么我贡献的可能性为0%。”老实说，我也不能说我为非Github项目做出了贡献。在我从Google Code迁移到Github之后，我唯一的非Github贡献(如果你想这么称呼他们的话)是为Chrome提交一份bug报告，另一份是为GitLab上的一个工具提交错误报告。\n另一个不熟悉的来源是，许多人，特别是年轻的开发人员，从来没有见过像MUTT这样的真正的邮件客户端。在他们的脑海中，他们可能会想象一个满满的Gmail收件箱，里面装满了来自不同项目的热门回复。这不是一个诱人的形象。也许本文可以让这些开发人员重新发现传统电子邮件客户端(它们被称为“MUA”)中的关怀和工程。\n考虑到不熟悉的情况，自托管项目需要非常清楚地沟通它是如何进行协作的。仅有一个邮件列表是不够的；一个项目需要在网络上进行自我解释，并提供有关参与的信息。\n关于陌生感的最后一点说明。请注意，在当今的互联时代，离线用户可能会被误解。在离线状态下写一封电子邮件可能看起来很愚蠢，只是在另一个更好的回复使您的回复变得不必要之后，它才会让它排队、发送和到达。可能明智的做法是在签名行中加上这样的内容：“注意：离线编写，可能缺少最近的上下文。”\nGithub以外的项目面临的下一个问题是缺乏通过明星投票的社会证明。没有明星，新项目更难建立声誉。人们注意到一个拥有数千颗星的项目的方式，仅仅是项目描述是无法唤起人们的注意的。虽然许多成熟的软件，如操作系统、浏览器和数据库在没有明星的情况下都表现良好，但它们在几年前就获得了认可，或者得到了大公司的推广。\n帮助自托管项目受欢迎的一种方法是在不太深入的情况下与Github挂钩。像git和linux这样的一些项目是运行他们自己的服务器，但是在Github上提供一个只读镜像，以供公众欣赏和代码浏览。\n可以提供帮助的两个工具是Pull Request Rejection Bot和用于禁用问题的内置设置。在禁用Pull请求和问题之后，项目自述文件需要包含有关如何以及在哪里做出贡献的信息。\n自托管的Git服务器还需要一个提交后挂钩来使Github保持最新。此命令应该会在钩子中起到作用：\n邮件列表的一大困难是共享电子邮件线程的全局状态。显然，不是信息的内容，而是需要采取行动的决定。单个投稿人可以在其邮件客户端中标记要操作的邮件，但此状态对每个人都是私有的。公开记录补丁已被接受以供将来应用，或修复了之前报告的错误，这很有帮助。\n项目通过以下两种方式之一来实现这一点：将元数据添加到git存储库本身，或者使用绑定到邮件列表的外部工具。\n例如，PostgreSQL有一个问题，补丁挂起而没有被接受或拒绝(一次有多达250个建议的补丁需要考虑！)。因此，该团队创建了Commifest.postgresql.org。贡献者现在在此站点上注册补丁以供最终审查。提交者每年几次停止自己的工作，并抽出时间接受/推迟/拒绝/应用补丁。\nPatchwork是一种与Postgres无关的类似工具，更适合一般使用。Patchwork通过订阅邮件列表来补充邮件列表，就像一个人一样，并从电子邮件中捕获补丁。它为每个补丁创建一个网页。它不会分割讨论，因为它不允许通过Web界面进行评论，它只反映电子邮件中的任何评论，并允许维护人员使用诸如已接受、已拒绝或正在审查的状态来标记补丁。\n我刚刚了解到一件令人惊讶的事情：PostgreSQL项目没有任何新的贡献者可以去寻找该项目的开放bug列表。有一个单独的邮件列表pgsql-bugs，人们在那里报告它们，但没有任何与pgsql-hacker上的活动联系在一起的东西来表明漏洞是否已经解决。有趣的是，OpenBSD还有一个bug电子邮件列表，没有集中的bug状态。\nPostgres仍在寻找一种与他们喜欢的工作方式相匹配、不会影响邮件列表的系统。我不相信OpenBSD想要一个bug追踪器。就像他们在IRC上打趣的那样，“如果我们真的有一个，我们就是FreeBSD了，不是吗？”\n对于确实需要bug跟踪器的项目，Debian项目中的Debbugs是一个很好的竞争者。它提供了一个电子邮件界面来处理错误，并且可以用于Debian以外的项目。\n其他bug系统通过将文件或对象添加到项目git repo本身来工作。因此，修复分支上的bug可能意味着将该bug与该分支上的其他更改一起从repo中删除。与电子邮件一样，这也保留了对错误信息的离线访问权限。也许最好的之一是到处都是虫子。另一个相当干净的代码被简单地称为bug。\n一旦您订阅了邮件列表，新邮件就会流入您的客户端并可供搜索。万岁！但是，在你加入列表之前发送的消息怎么办？此外，您如何“链接”到来自新消息的旧消息？Github上的每个问题都有自己的URL，所以问题可以相互引用，但是一封电子邮件怎么会说这样的话：“我们已经在消息X中讨论过这个问题，请看那里。”\n其工作方式是使用Message-ID头。每封电子邮件都有一封，它们是回复方式的一部分。它们是大GUID，看起来像8953.1527887111@sss.pgh.pa.us或CAFjFpReKyYrsUF8sP5GoPYyyp9ZSqm_mLeD8kQLigX-3CzDiUg@mail.gmail.com.。因此，一封电子邮件可能会说，“我们在8953.1527887111@sss.pgh.pa.us讨论了这个问题，让我们将讨论转移到那里。”\n阅读在您加入列表之前发送的邮件需要转到Web上的列表存档。好的存档提供指向Mbox文件的链接，这些文件可以导入到本地邮件客户端。这样就可以在邮件客户端中搜索/回复旧邮件。档案通常还提供一个Web界面来读取HTML格式的邮件，但是在这些旧界面中导航线程通常比在一个好的邮件客户端中要麻烦得多。\n例如，查看pgsql-hacker的存档。请注意Mbox文件链接。你可以下载一个月的邮件Mbox，可以是单独的邮件，也可以是完整的帖子。要导航到某个消息ID，请使用URL https://www.postgresql.org/message-id/:the-id.。试试我前面列出的其中一个ID。同样，Linux内核邮件列表存档可以通过lkml.kernel.org按id显示消息。\n请记住，所有电子邮件都有Message-ID。\n..", "note_en": "Most fledgling open source projects use Github or Gitlab to collaborate on code. However there’s an older method that developers ought to know about because it offers some advantages.\n  The alternative method is the developer mailing list. It arose in the late eighties to early nineties, and predates the popularity of the web browser. But far from being a mere historical curiosity, the discussion list is still the primary method of development in many important open source projects, from databases to operating systems to web browsers.\n In this article I’ll carefully compare the use of mailing lists with code collaboration web sites such as Github. I’ll do my best to present the pros and cons of each, so that projects assessing the two can make an informed decision.\n  Github hosts a git server, a bug tracker, a wiki, as well as release artifacts. Participation in discussions or code changes requires a Github identity. Code changes are proposed by making another Github-hosted project (a “fork”), modifying a remote branch, and using the GUI to open a pull request from your branch to the original. Project members debate the change in comments, with subsequent changes pushed as commits to the pull request branch. Ultimately a project owner can decide to merge the commits.\n A mailing list maintains a list of subscribers who receive all messages sent to a “reflector” email address. A project must host its own version control server elsewhere. Code changes are proposed by sending an email to the reflector, with a textual diff of the changes either attached or inline. List members debate the change with email replies, sending subsequent changes as more diffs, either to replace or amend the original. Ultimately a project committer can decide to apply the patch(es) to the codebase.\n   Mailing lists have three properties that allow developers to communicate with greater precision and flexibility than is possible in the Github UI: the threaded nature of emails, the user generation of patches, and the free mixing of discussion and patches.\n  The Github web UI has a limited model of threading, where there is one thread for the pull request as a whole, and other threads attached to single changed lines of code. The UI shows a few lines of code for context around the line chosen for discussion, but the full chunk of code under discussion must be inferred.\n Email sub-threads allow specialized discussion about different aspects or sections of the code. A linear Github-style discussion would mix those conversations.\n Conversations over email have a greater permanence and reference value than Github comments. On Github, comments continually change. They become “outdated” and disappear when attached to a line that has been changed. Same for the commits, which vanish after a force-push to the pull request branch. In an email thread, by contrast, the original messages and proposed changes remain for comparison with later messages and patches.\n Furthermore, patches from multiple authors can’t mix in a Github pull request. The person opening the pull request “owns” it. Other participants can drop code suggestions as comments, but what gets merged by the UI is ultimately the commits on the branch. The pull requester must turn those comments into commits on the branch if he or she wants to incorporate the suggested changes.\n On a mailing list, anyone is free to reply to an existing thread with a new proposed set of patches. Another nice effect is that other people can carry the patch to the finish line if the original author stops caring or being involved. (I’ve encountered a number of MIA authors in pull requests on my projects over the years.)\n  Custom patches are another way that the email process improves communication over the Github UI. Contributors can shape the patches to make them more readable for other people.\n With Github you commit your changes and then Github chooses how to render the diff to the reviewer, but when creating the patch yourself you can tweak the settings. Diffs can be in  unified or  context format, and for the latter the number of context lines is configurable. (To be fair, Github allows expanding the view of context around changes too.)\n Some people feel that git-style unified diffs are clearest for small changes of a few lines, and context diffs are more suitable for changing larger ranges, especially lines with indentation changes. (To be fair, I should note that Github will hide indentation changes if you add  ?w=1 to the URL displaying the change.)\n Finally, creating patches by hand with  diff can take advantage of other options, like annotating the hunk headers with which C functions are affected (using the  -p flag), and the choice of  various algorithms such as “patience.”\n Patience does a little more work to calculate its results, but the output makes more sense for humans. For instance, a standard (non-patience) diff might look like this:\n void func1() { x += 1 +} + +void functhreehalves() { + x += 1.5 } void func2() { x += 2 }\n  void func1() { x += 1 } +void functhreehalves() { + x += 1.5 +} + void func2() { x += 2 }\n Finally, there’s nothing to stop the mailing list style of collaboration from adapting to emerging diff formats, such as  structural diffs. That’s because patches in emails directly describe changes whereas Github renders commit deltas without nuance.\n  The bulk of communication around a new feature is in its proposal, not around the subsequent code. A contributor proposes the feature, justifies it, and confirms the scope before writing any code. The community responds, and often by the time anyone implements anything, the idea has shifted significantly from the start of the process.\n This is again where emails fit the group discussion well, with inline replies and the threaded structure as mentioned above. When it’s time to get coding there’s no discontinuity of switching from an “issue” to a “pull request.” The author simply replies again with patches attached.\n  While web apps deliver a centrally-controlled user interface, native applications allow each person to customize their own experience. Open protocols like SMTP encourage a proliferation of clients. So it is with with mail clients, each providing its own functions, filters, folders, flags and fun. Mail clients provide ways to mark a message important, or set it back as unread. In general you don’t have to unsuccessfully beg a central committee over five years for an interface change. (It happens, see this  petition in an unofficial repo designed to supplicate the Github deities.)\n Some people script their mail client so that they can apply patches with a keyboard shortcut, others go minimalist, and still others even use webmail. Each person is different, and so is their software, but the nature of the mailing list allows them all to work together.\n Another area of control is the ability to search and interact with a mailing list while offline. This is often by choice rather than necessity. Urban and suburban areas usually have internet access available anywhere at any time, using cellular service if need be. Things are no longer as they once were with intermittent dial-up connections, but working offline is a choice that some people simply prefer.\n Although git is itself distributed and operates locally without a network connection, Github requires connectivity to review issues and pull requests. Demanding connectivity for an essentially reflective solitary task is unreasonable.\n Remember that being online applies in two directions: the developer’s connection to the internet and also Github’s uptime. Although the latter has been pretty stable for a while, I do remember a handful of times where my entire office got derailed by Github downtime. Taking Github down is a big attractive target for angry nations and ambitious hackers.\n With a native email client you can review all emails and attachments offline. You can even send replies to messages offline and the client will queue them until internet access becomes available.\n For the other side, the uptime of the mailing list server, mail sent to an offline server will eventually go through. Mail transfer agents along the email chain are designed to retry transmissions. In addition, developer lists recommend that users “Reply All” to messages so that everyone involved in a thread as well as the list reflector address get the message. That way even if the reflector is offline, your email can go through to those most recently involved.\n Ultimately the control and customizability enjoyed by the mailing list style of development comes from diverse tools built for open standards. Patchfiles are universally supported (git itself directly  supports  patches), SMTP has an RFC. Tools can work together, rather than having a GUI locked in the browser.\n  Git was originally created as an escape from BitKeeper, a version control system with associated centralized hosting. BitKeeper granted a free license for open source projects, and required projects to store their metadata on company servers.\n What a twist of history, then, that users of git chose Github… a centralized host granting free licenses for open source projects, and requiring projects to store their metadata on company servers.\n Github can legally delete projects or users with or without cause. This makes sense of course, since the projects are using computers owned by Github. Also, while not explicitly prohibiting development of competing projects like BitKeeper did, Github can still view the private source code of all companies who choose to host with them.\n Really, what’s the future of Github (or any profit-driven yet free code hosting service)? History provides the example of SourceForge, the premier code collaboration platform at the turn of the century. After acquisition by dice.com, and in a last-ditch effort to grab some more money, SourceForge hijacked hosted projects so that their installers would include adware and spyware.\n When I first began notes for this article, the implications for Github were purely hypothetical, but even as of this writing news has emerged that Microsoft is buying Github. It doesn’t feel far-fetched to suggest that Github may be moving into its “SourceForge stage.”\n Let this lesson be broader than Github though. The same logic applies to other web platforms that centralize and combine programmer communication and hosting.\n Some major open source projects like the PostgreSQL database played it safe and explicitly chose never to put their code on external company servers (other than for mirroring). Postgres also takes pains to place control in a governing body spanning multiple companies. No company is allowed a majority of committers, and the organization is designed to survive independently.\n Not all projects are important enough to require this level of neutrality, but all projects deserve to control their own destiny.\n  The fundamental task we’re talking about is asynchronous group communication of code changes. Patches are a universally understood way of describing code changes, and email is a universally understood method of communication. So it seems that this approach matches the problem at hand.\n In fact emailing patches works with any version control system, not just Git. The OpenBSD project still happily uses mailing lists with CVS. Patch authors don’t need any version control software installed at all. An author can download the source release tarball, make changes in the copy, capture the diff, and email it.\n Sending and applying patches cuts out busywork like cleaning up remote branches after merge, or creating a local branch in the forked repo in preparation for a pull request. For comparison, I remember teaching a group of new programmers how to use Github, and was conscious at the time of all the weird steps I asked them to do.\n There’s also less busywork for finished communications. There aren’t things to “clean up” like abandoned pull requests, merged branches, or issues to mark closed. The replies just stop on those threads. More on some downsides of this later, but for now look on the bright side.\n Using email also decouples digital identity from the accounts on a site like Github, and ultimately places that trust in the DNS system managed by an international organization, ICANN. For more about this, see my article  Returning to the Original Social Network. PGP provides a further guarantee of identity, verified through a decentralized web of trust. See my recording of Neal Walfield’s talk  An Advanced Intro to GnuPG.\n  The mailing list approach raises quite a few questions and difficulties. I’ve done my best to try to acknowledge them and suggest possible solutions.\n   When you browse a Github project you know exactly how it works. Sure, the addons/CI/hooks may differ, and setting up the project might involve some contortions, but the process of browsing code, finding known bugs, and submitting changes is always the same. This is most definitely not true for projects with their own web presence and mailing lists.\n I’ve heard people go so far as to say, “If a project is not on Github then there is a 0% chance that I will contribute.” To be honest I can’t say that I’ve contributed to non-Github projects either. After I migrated to Github from Google Code my only non-Github contributions (if you want to call them that) were filing a bug report for Chrome, and another for a tool on Gitlab.\n One more source of unfamiliarity is that many people, especially younger devs, have never seen a real mail client like  mutt. In their minds they may picture an overflowing GMail inbox full of  top posted replies all mixed together from different projects. That’s not an enticing image. Perhaps this article can start these developers on the path to rediscovering the care and engineering that went into classic email clients (“MUAs” as they are called).\n Given the unfamiliarity, a self-hosted project needs to communicate very clearly how it does collaboration. A mailing list alone is not enough; a project needs to explain itself on the web, and provide information about getting involved.\n A final note about unfamiliarity. Beware that offline users can be misunderstood in today’s connected age. It can look silly to write an email while offline, only to have it queue, send, and arrive after another better response renders yours unnecessary. It’s probably wise to include a signature line saying something like, “Note: composed offline, may lack recent context.”\n  The next problem that projects outside Github face is the lack of social proof through star voting. It’s harder for new projects to build reputation without stars. People take notice of a project with thousands of stars in a way that the mere project description doesn’t evoke. While much established software like OSes, browsers, and databases do fine without the stars, they won their acceptance years ago, or are promoted by big companies.\n One way to help self-hosted project popularity is to hook into Github without going too deep. What some projects like git and Linux do is run their own servers, but offer a read-only mirror on Github for public admiration and code browsing.\n Two tools that can help are the  Pull Request Rejection Bot and the built-in setting to  disable issues. After disabling pull requests and issues, the project README needs to include information about how and where to contribute.\n The self-hosted git server will also need a post-commit hook to keep Github up to date. This command should do the trick in the hook:\n    A big difficulty for mailing lists is sharing the global state of email threads. Not the content of the messages, obviously, but the decisions that require action. Individual contributors can flag messages for action in their mail clients, but this status remains private for each individual. It’s helpful to record publicly that a patch has been accepted for future application, or that a previously reported bug was fixed.\n Projects do this in one of two ways: adding metadata to the git repository itself, or using an external tool that ties into the mailing list.\n For instance PostgreSQL had a problem where patches hung around without being accepted or rejected (there are up to ~250 proposed patches to consider at one time!). So the team created  commitfest.postgresql.org. Contributors now register the patches on this site for final review. Several times per year committers stop their own work and make time to accept/defer/reject/apply the patches.\n Patchwork is a similar tool that is not tied to Postgres and is more suitable for general use. Patchwork supplements a mailing list by subscribing to the list just like a person would, and capturing patches from the emails. For each patch it creates a web page. It doesn’t fragment discussion because it doesn’t allow commenting through the web interface, it merely reflects any comments from the emails, and allows maintainers to mark patches with a state such as Accepted, Rejected, or Under Review.\n  Here’s something surprising I just learned: the PostgreSQL project does not have any place a new contributor can go to find a list of open bugs for the project. There is a separate mailing list, pgsql-bugs, where people report them, but there’s nothing that ties that with the activity on pgsql-hackers to indicate whether the bug is resolved. Interestingly, OpenBSD also has a  bugs email list and no central bug status.\n Postgres is still searching for a system which matches how they like to work and which doesn’t detract from the mailing lists. I don’t believe OpenBSD desires a bug tracker. As they quipped on IRC, “If we did [have one] we would be FreeBSD, wouldn’t we?”\n For projects that do want a bug tracker, one good contender is  Debbugs from the Debian project. It provides an email interface to manipulate the bugs and can be used for projects other than Debian.\n Other bug systems work by adding files or objects into the project git repo itself. Thus fixing a bug on a branch could mean deleting the bug from the repo along with the other changes on that branch. Like email, this preserves offline access to bug information. Probably one of the best is  Bugs Everywhere. Another pretty clean one is simply called  bug.\n  Once you subscribe to a mailing list, new messages flow into your client and are available for searching. Hooray! But what about messages sent before you joined the list? Furthermore, how do you “link” to old messages from newer ones? Every issue on Github has its own URL, so issues can refer to each other, but how would an email say something like, “we already discussed this in message X, look there.”?\n The way this works is with the  Message-ID header. Every email has one, and they are part of how replies work. They are big GUIDs that look like  8953.1527887111@sss.pgh.pa.us or  CAFjFpReKyYrsUF8sP5GoPYyyp9ZSqm_mLeD8kQLigX-3CzDiUg@mail.gmail.com. So an email could say, “We discussed this issue in 8953.1527887111@sss.pgh.pa.us, let’s move the discussion there.”\n Reading a message sent prior to your joining the list requires going to the list archive on the web. Good archives provide links to  mbox files which can be imported into a native mail client. This makes the old messages available for search/reply in the mail client. Archives also usually provide a web interface to read the messages as HTML, but navigating threads in these old interfaces is usually way more painful than in a good mail client.\n As an example, check out the  archives for pgsql-hackers. Notice the mbox file links. You can download an mbox for a month’s worth of messages, for individual messages or for full threads. To navigate to a certain message id, use the url  https://www.postgresql.org/message-id/:the-id. Try one of the ids I listed earlier. Similarly the Linux kernel mailing list archives can display a message by id via  lkml.kernel.org.\n Remember that all emails have a Message-ID \n......", "posttime": "2020-07-01 15:49:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "github,列表,mailing", "title": "邮件列表VS GitHub(2018)", "title_en": "Mailing Lists vs. GitHub (2018)", "transed": 1, "url": "https://begriffs.com/posts/2018-06-05-mailing-list-vs-github.html", "via": "", "real_tags": ["github", "列表", "mailing"]}, {"category": "", "categoryclass": "", "imagename": "090213d951d8c6a3d08a1ddd5c6b53e1.jpg", "infoid": 1009236, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几十年来，科学家们一直就6600万年前的一次大规模灭绝事件的确切原因争论不休，那次事件摧毁了地球上大约75%的生命，包括所有大型恐龙。一些人认为火山活动可能是罪魁祸首，但一项新的研究表明，巨大的小行星撞击是罪魁祸首。\n科学家们已经知道，撞击造成了巨大的希克苏鲁布陨石坑(位于现在的墨西哥东南部尤卡坦半岛)，是这次物种灭绝事件的主要原因。但是，大约在同一时间发生的火山活动引发了人们的疑问，即哪些因素可能是改变了我们星球上导致地球生物灭绝的条件的主要因素。\n在一项新的研究中，来自伦敦帝国理工学院、布里斯托尔大学和伦敦大学学院的研究人员表明，小行星撞击，而不是火山活动，是当时地球上大约75%的生命死亡的主要原因，而且它严重干扰了地球的气候和生态系统。\n我们证明，小行星造成了长达数十年的冬季撞击，这些环境效应摧毁了适合恐龙生存的环境。相比之下，剧烈火山喷发的影响还不足以实质性破坏全球生态系统，首席研究员亚历山德罗·基亚伦扎(Alessandro Chiarenza)在一份声明中说。基亚伦扎在帝国理工学院攻读博士学位期间进行了这项研究。影响冬季意味着一个半永久性的冬季，当撞击后阻挡阳光的粒子被踢到大气中时，就会产生一个半永久性的冬季。我们的研究首次从数量上证实，对恐龙灭绝的唯一可信的解释是冬季的影响，它摧毁了世界各地的恐龙栖息地。&#34；我们的研究首次从数量上证实，对恐龙灭绝的唯一看似合理的解释是冬季对全世界恐龙栖息地的影响。\n为了得出这一结论，研究人员模拟了地球气候预计将如何应对两种独立的可能灭绝原因：火山作用和小行星撞击。在这些数学模型中，他们包括了包括降雨和温度在内的环境因素，这对这些物种的生存至关重要。它们还包括阻挡阳光的气体和颗粒以及温室气体二氧化碳的存在。\n布里斯托尔大学(University Of Bristol)气候学家亚历克斯·法恩斯沃斯(Alex Farnsworth)在同一份声明中补充道，我们不是只使用地质记录来模拟小行星或火山可能在全球范围内对气候造成的影响，而是将这种方法向前推进了一步，为研究增加了生态方面的因素，以揭示这些气候波动是如何严重影响生态系统的。他是布里斯托尔大学(University Of Bristol)的气候学家之一亚历克斯·法恩斯沃斯(Alex Farnsworth)。\n有了这些模型，研究小组发现，撞击我们星球的巨型小行星将向地球大气层释放大量气体和粒子，连续多年阻挡太阳。这种效应将在地球上造成一种半永久的冬天，使地球上的大多数居民无法居住。\n现在，虽然研究小组发现小行星的撞击是导致地球不适合大多数动物居住的主要因素，但他们也发现，随着时间的推移，火山活动实际上可能有助于生命的恢复，这是科学家以前得出的结论。\n他们发现，虽然火山确实会释放阻挡阳光的气体和颗粒，这在短期内有助于阻挡太阳，但它们也释放了大量的二氧化碳，因为它是一种温室气体，会在大气中积聚，使地球变暖。\n因此，正如研究人员在这项工作中提出的那样，虽然小行星造成的毁灭性冬季杀死了地球上的大多数生命，但随着时间的推移，火山温室气体造成的变暖效应可能有助于恢复栖息地的生命。\n我们提供了新的证据表明，大约在同一时间发生的火山喷发可能减少了影响对环境造成的影响，特别是在影响冬季之后，加速了气温的上升。这种火山引起的变暖帮助促进了在物种灭绝中生存和恢复的动植物的生存和恢复，许多群体在灭绝后立即扩大，包括鸟类和哺乳动物，奇亚伦扎补充道。\n这项研究发表在6月29日的“美国国家科学院院刊”上。\n向切尔西·戈德发送电子邮件至cgohd@space.com或在Twitter@cheley_gohd上关注她。在Twitter@spacedotcom和Facebook上关注我们。\n加入我们的空间论坛，继续谈论空间的最新任务，夜空和更多！如果您有任何新闻提示、更正或评论，请发送电子邮件至：Community@space.com。\n我依稀记得，我看到这个火山假说的时间框架也被发现是不够的。\n回覆\n这就是试图假设过去的有趣之处；谁知道呢？为什么？没人知道。那么，让我们试试这个的大小；小行星，火山冷却地球，不是很多，只有几度。撞击坑不够大，不足以引起物种灭绝事件。在降温过程中，一个新的敌人出现了：哺乳动物。到了晚上，它们在星球上漫游，以数万亿的恐龙蛋为食，变得越来越大……。恐龙妈妈太僵硬了，守不住巢。那么为什么有些恐龙幸存下来呢？看看它们的筑巢习惯，找出它们的筑巢习惯。但是，我们不能责怪哺乳动物，因为这只是将今天发生的物种灭绝事件归咎于人类的一小步。此外，我提供的证据是，许多恐龙在这次事件之前就已经灭绝了，许多在这次事件中幸存了数百万年。想一想：有人真的付钱给了撰写和合作写这篇垃圾文章的蜥蜴大脑。\n回覆。\n是吗？6600万年？他们是怎么算出那个数字的！？此外，世界只存在了大约6000年。\n回覆", "note_en": "For decades, scientists   have gone back and forth over exactly what caused a mass extinction event 66 million years ago, which destroyed about 75% of all life on Earth, including all of the large dinosaurs. Some have thought that volcanic activity could be to blame, but one new study shows that a giant asteroid impact was the prime culprit.\n   Scientists have known that the impact, which created the massive   Chicxulub impact crater (located in what is now the Yucatán Peninsula in southeast Mexico), was a major contributing factor to this extinction event. But volcanic activity happening at around the same time has raised questions over which could have been the main factor which changed conditions on our planet that led to the demise of Earth&#39;s creatures.\n In a new study, researchers from Imperial College London, the University of Bristol and University College London have shown that the asteroid impact, not volcanic activity, was the main reason that about 75% of life on Earth perished at that time, and it did so by significantly interfering with Earth&#39;s climate and ecosystems.\n  &#34;We show that the asteroid caused an impact winter for decades, and that these environmental effects decimated suitable environments for dinosaurs. In contrast, the effects of the intense volcanic eruptions were not strong enough to substantially disrupt global ecosystems,&#34; lead researcher Alessandro Chiarenza, who conducted this work whilst studying for his PhD in the Department of Earth Science and Engineering at Imperial,   said in a statement. &#34;Impact winter&#34; signifies a semi-permanent &#34;winter&#34; created when sunlight-blocking particles are kicked up into the atmosphere after an impact. &#34;Our study confirms, for the first time quantitatively, that the only plausible explanation for the extinction is the impact winter that eradicated dinosaur habitats worldwide.&#34;\n To come to this conclusion, the researchers modeled how Earth&#39;s climate would be expected to respond to two separate possible extinction causes: volcanism and asteroid impact. In these mathematical models, they included environmental factors including rainfall and temperature, which would have been critical to the survival of these species. They also included the presence of sunlight-blocking gases and particles and carbon dioxide, a   greenhouse gas.\n &#34;Instead of only using the geologic record to model the effect on climate that the asteroid or volcanism might have caused worldwide, we pushed this approach a step forward, adding an ecological dimension to the study to reveal how these climatic fluctuations severely affected ecosystems,&#34; co-lead author Alex Farnsworth, a climatologist at the University of Bristol, added in the same statement.\n With these models, the team found that the giant asteroid hitting our planet would have released tremendous amounts of gas and particles into   Earth&#39;s atmosphere, blocking out the sun for years on end. This effect would have created a sort of semi-permanent winter on Earth, making the planet unlivable for most of its inhabitants.\n Now, while the team found the asteroid impact to be the major factor in making Earth unlivable for most animals, they also found that volcanic activity could have actually helped life to recover over time,   a conclusion that scientists have drawn before.\n They found that, while volcanoes do release sunlight-blocking gases and particles, which would have helped to block the sun in the short term, they also release large amounts of carbon dioxide which, because it&#39;s a greenhouse gas, would have built up in the atmosphere and warmed the planet.\n So, as the researchers suggest in this work, while the devastating winter caused by the asteroid killed off most life on Earth, over time, the warming effect created from the volcanic greenhouse gases could have helped to restore life to habitats.\n &#34;We provide new evidence to suggest that the volcanic eruptions happening around the same time might have reduced the effects on the environment caused by the impact, particularly in quickening the rise of temperatures after the impact winter. This volcanic-induced warming helped boost the survival and recovery of the animals and plants that made through the extinction, with many groups expanding in its immediate aftermath, including birds and mammals,&#34; Chiarenza added.\n This work   was published June 29 in the journal Proceedings of the National Academy of Sciences.\n Email Chelsea Gohd at  cgohd@space.com  or follow her on Twitter  @chelsea_gohd . Follow us on Twitter  @Spacedotcom  and on  Facebook .\n Join our Space Forums to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at:  community@space.com.\n     I vaguely recall seeing that the time frame for this volcanic hypothesis was found wanting as well.\n   Reply\n That&#39;s the funny thing about trying to hypothesize about the past; who knows? Why: no one knows. So let&#39;s try this one for size; asteroid, volcanoes cool the earth, not much, a few degrees. The impact crater isn&#39;t large enough to cause an extinction event.  In the cooling, a new enemy emerges: mammals. At night they roam the planet growing larger as they feed on dinosaur eggs by the trillions... mama dino too stiff to defend the nest. So how come some dinosaurs survived? Look at their nesting habits and figure it out. But OH NO; we CAN&#39;T blame the mammals because then it is one one small step to blaming the humans for this extinction event happening today. Besides, I offer for proof that many dinosaurs had already become extinct before this event and many survived this event by millions of years. To think: someone actually pays the lizard brains who wrote and collaborated on this junk.\n   Reply\n Really? 66 million years? Just how do they come up with that number!? Besides, the world has been in existence for just about 6,000 years.\n   Reply", "posttime": "2020-07-01 15:12:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发现,impact,地球", "title": "研究发现，导致恐龙死亡的是小行星撞击，而不是火山活动", "title_en": "Asteroid Impact, Not Volcanic Activity, Killed the Dinosaurs, Study Finds", "transed": 1, "url": "https://www.space.com/asteroid-impact-not-volcanoes-killed-dinosaurs.html", "via": "", "real_tags": ["发现", "impact", "地球"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1009234, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了帮助支持我们的社区在新冠肺炎期间远程工作，我们将在2020年6月30日之前免费提供ACM在我们数字图书馆中发布的所有作品。了解更多。\n我们使用饼干，以确保我们给你最好的经验，在我们的网站。\n您的浏览器似乎不支持它们，这会影响网站功能。", "note_en": "To help support our community working remotely during COVID-19, we are making all work published by ACM in our Digital Library freely accessible through June 30, 2020.  Learn more\n   We use cookies to ensure that we give you the best experience on our website.\n  It seems your browser doesn&#39;t support them and this affects the site functionality.", "posttime": "2020-07-01 15:04:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据,atomic,网站", "title": "对分散数据执行原子操作(1983)", "title_en": "Implementing atomic actions on decentralized data (1983)", "transed": 1, "url": "https://dl.acm.org/doi/10.1145/357353.357355", "via": "", "real_tags": ["数据", "atomic", "网站"]}, {"category": "", "categoryclass": "", "imagename": "aef8843b2013ef1dc072e504fdfc24e4.jpeg", "infoid": 1009232, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多个欧洲核监测机构在斯堪的纳维亚半岛和俄罗斯西部上空的大气中检测到高于正常水平的放射性同位素。\n6月22日至23日，全面禁止核试验条约组织(CTBTO)-一个运营监测站以帮助执行核条约的监督组织-注意到瑞典监测站的铯-134、铯-137和钌-103水平上升。\n禁核试组织执行秘书Lassina Zerbo在推特上分享了一张受影响地区的地图，并表示这些同位素“与核裂变有关”，高于正常水平(但对人类健康无害……。这些同位素很可能来自民用来源。我们能够指出来源的可能区域，但确定确切来源超出了禁核试组织的职权范围。“。\n距离受影响地区最近的核电站都在俄罗斯，靠近其西部边境。列宁格勒工厂在圣彼得堡运营，科拉工厂在摩尔曼斯克运营。运营这两座核电站的Rosenergoatom电力公司的一位发言人告诉俄罗斯通讯社塔斯社(TASS)，两座核电站都运行正常，一端没有检测到泄漏。\n两个加油站都在正常状态下工作，“该公司告诉塔斯社。“没有关于设备工作的投诉。”\n禁核试组织并不是唯一一个监测到空气中核材料水平升高的监测站。瑞典、芬兰、挪威和荷兰的辐射和核安全当局在6月份几乎同一时间都在空气中检测到放射性同位素。\n“检测到的放射性物质是人造的。放射性核素的结合可能可以用一座核电站的燃料元件异常来解释，“荷兰核监测机构RVIM在其网站上称.。“放射性核素从俄罗斯西部方向运往斯堪的纳维亚半岛，但目前还不能指出具体的原产国。”\n核监测站不断采集空气、水和土壤样本，以检查环境中的放射性物质水平。这起事件之所以如此引人注目，是因为如此多的机构都在同时报道同样的事情。\n2017年也发生了类似的事件，当时一大团钌在欧亚大陆移动。许多不同的机构都得出了相同的结论--俄罗斯的一次核事故释放了一团向西移动的辐射云。起初，莫斯科否认云的存在，然后改变路线，说它存在，但俄罗斯没有责任。\n监测机构表示，他们目前正在追踪的放射性同位素不会立即造成危险，最有可能的原因是核电站的燃料源受到污染。\n没有证据表明俄罗斯的发电厂是罪魁祸首，但俄罗斯在核问题上有掩盖真相的历史。去年八月，俄罗斯导弹设施发生核事故，造成七名俄罗斯人死亡，并将核材料释放到空中。莫斯科两天来没有公开承认这一事件。\n签署“色情通讯”，即表示您同意接收来自“色情通讯”的电子通讯，其中有时可能包括广告或赞助内容。", "note_en": "Multiple European nuclear monitoring agencies have detected higher than normal levels of radioactive isotopes in the atmosphere above Scandinavia and western Russia.\n  From June 22 to 23, The Comprehensive Test Ban Treaty Organization (CTBTO)—a watchdog group that operates monitoring stations to help enforce nuclear treaties—noticed elevated levels of caesium-134, caesium-137, and ruthenium-103 from its monitoring station in Sweden.\n   CTBTO Executive Secretary Lassina Zerbo  shared a map of the affected region in a tweet and said the isotopes are “associated w/Nuclear fission @ higher than usual levels (but not harmful for human health... these isotopes are most likely from a civil source. We are able to indicate the likely region of the source, but it’s outside the CTBTO’s mandate to identify the exact origin.”\n     The closest nuclear power plants to the affected area are both in Russia, near its western border. The Leningrad plant operates in St. Petersburg and the Kola plant in Murmansk. A spokesperson for the Rosenergoatom power company, which operates both plants,  told Russian news agency TASS that both plants are operating normally and that no leak has been detected on its end.\n  &#34;Both stations are working in normal regime,”  the company told TASS. “There have been no complaints about the equipment’s work.&#34;\n  The CTBTO wasn’t the only monitoring station that picked up on elevated levels of nuclear material in the air. Radiation and nuclear safety authorities in  Sweden,  Finland, Norway, and  the Netherlands all detected radioactive isotopes in the air around the same time in June.\n  “The detected radioactive substances are artificial. The combination of radionuclides may be explained by an anomaly in the fuel elements of a nuclear power plant,” RVIM, the Netherlands nuclear monitoring agency,  said on its website. “The radionuclides travelled from the direction of western Russia to Scandinavia, but no specific country of origin can be pointed out at this moment.”\n  Nuclear monitoring stations constantly take air, water, and soil samples to check the levels of radioactive material in the environment. What makes this incident so striking is that so many agencies are all reporting the same thing at the same time.\n  A similar incident happened in 2017 when a large cloud of ruthenium moved across Eurasia. Many separate agencies all came to the same conclusion— that a nuclear accident in Russia released a cloud of radiation which traveled west. At first, Moscow denied that the cloud existed, then switched course and said it existed,  but that Russia wasn’t responsible.\n  The monitoring agencies said there’s no immediate danger from the radioactive isotopes they are currently tracking and that the most likely cause is a contaminated fuel source at a nuclear power plant.\n  There is no proof that Russian power plants are to blame, but Russia has a history of occluding the truth when it comes to nuclear issues. In August of last year,  a nuclear accident at a Russian missile facility killed seven Russians and released nuclear materials into the air. Moscow didn’t  publicly acknowledge the incident for two days.\n  By signing up to the VICE newsletter you agree to receive electronic communications from VICE that may sometimes include advertisements or sponsored content.", "posttime": "2020-07-01 15:03:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "漂浮,radiation,俄罗斯", "title": "核辐射漂浮在北欧上空，没有人知道原因", "title_en": "Nuclear Radiation Is Floating Above Northern Europe and Nobody Knows Why", "transed": 1, "url": "https://www.vice.com/en_us/article/k7q7kz/nuclear-radiation-is-floating-above-northern-europe-and-nobody-knows-why", "via": "", "real_tags": ["漂浮", "radiation", "俄罗斯"]}, {"category": "", "categoryclass": "", "imagename": "9250be733d1af3ad9060595654327f64.jpg", "infoid": 1009231, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近，我读到了很多关于电子邮件有多么破损的夸张言论。当然，电子邮件有问题，但它真的坏了吗？我不这么认为。\n很多这种夸张的说法似乎都是在Basecamp的新电子邮件服务“嘿”发布后出现的。我已经注册了“嘿”试用版，虽然它看起来是一项不错的服务，但我不认为它能解决电子邮件的任何问题。\n要开始讨论像电子邮件这样两极分化的事情，一个很好的起点是清楚地说明电子邮件到底是什么。这样一来，你们就有希望从一开始就明白我是从哪里来的。\n对我来说，电子邮件是一种接收生活时间短的简单交流的方式。\n这就是电子邮件对我来说的全部意义。它们大多是我接收、处理并继续前进的无关紧要的信息。我想他们对其他很多人也是如此，特别是当你考虑到有多少人的收件箱里有成百上千的未读邮件时。如果到处都是未读的邮件，那么绝大多数电子邮件到底有多重要呢？\n需要说明的是，我不是那种有很多未读邮件的人。就我个人而言，我是一个收件箱为零的人。但我数不清有多少次，我看到某人解锁的手机，注意到一个邮件图标，上面有一个红色的斑点，上面显示着一个异常大的数字。\n当我和我的妻子从Gmail迁移到Zoho时，她邮箱里未读的邮件太多了。我以为她不回复我的电子邮件只是因为她不喜欢我，结果她只是不检查她的电子邮件！🙂。\n现在我们已经确定了我认为电子邮件是什么，让我们来看看电子邮件的一些问题。对我来说，主要问题有三个：\n到目前为止，垃圾邮件是困扰电子邮件的最大问题。没有一个垃圾邮件过滤器是完美的，需要努力才能保持在它的顶端。\n许多电子邮件提供商允许您在运行中管理您的垃圾邮件。您可以将通过网络的电子邮件标记为垃圾邮件，这样下次它们就会被捕获。相反，您可以将误报标记为安全。\n假设我收到了一封垃圾邮件，它击中了我的收件箱。我不会删除它，我实际上会将其标记为垃圾邮件，这样我的垃圾邮件过滤器就会知道什么是垃圾邮件。如果我删除它，我的垃圾邮件过滤器不会变得更明智，而且我会使这个问题永久化。\n相反，如果一封合法的电子邮件被错误地标记为垃圾邮件，我不会直接将该邮件移到我的收件箱中。我会将发件人标记为安全，然后移动电子邮件。再一次，它给了我的垃圾邮件过滤器一个学习的机会。\n我使用Zoho已经有几年了，通过这样做，垃圾邮件过滤非常出色，我几乎没有收到垃圾邮件到我的收件箱。\n如果您收到电子邮件到您的收件箱(真的吗？收件箱…。多么荒谬的名字)，来自一个嘿以前从未见过的地址，它迫使用户首先筛选它。\n我认为这是一个很好的解决方案，因为它迫使人们在收到任何潜在的垃圾邮件时进行审查。但是，尽管据我所知，这个特定的工作流程还没有融入到任何其他电子邮件提供商中，但如今审查和管理垃圾邮件的能力已经成为常态。\n在这种情况下，电子邮件并没有损坏--人们无法管理他们收到的邮件，这才是问题所在。\n显然，全球有15亿人在使用Gmail。我已经努力大幅减少我的谷歌使用量，但很多人对Gmail很满意，这没什么。\n令人不快的是，Gmail给用户提供的隐私完全缺失。显然，谷歌将不再阅读你的电子邮件来个性化广告。我一点也不相信这一点，但即使他们这样做了，Gmail中仍然有广告，如果他们不从中获利，他们就不会免费为数十亿人提供服务。\n电子邮件不是私人邮件，所以我不会把它当作私人邮件。如果我有想要/需要通过私人电子邮件发送的东西，我会对电子邮件进行加密，或者发送加密的附件。我的电子邮件提供商Zoho有一个非常开放的隐私政策，但我仍然不会使用他们的服务来发送私人数据。\n这不仅仅是Gmail的问题--大多数免费电子邮件提供商都有隐私问题。\n当谈到隐私时，嘿有一个很好的政策，在他们的宣言中说了以下几句话：\n市面上有很多“免费”的电子邮件服务，但免费电子邮件会让你失去你所拥有的最有价值的东西之一--你的隐私和你的个人信息。我们对你的个人资料不感兴趣。它永远是你的，不是我们的。我们只需对“嘿”收取统一的全包99美元/年的费用。这使得我们的业务无需出售您的数据、向您做广告或以其他方式采用不道德的营销策略。\n“嗨宣言”\n我爱死这个了。作为一个“嘿”用户，你不会被广告给你，也不会被跟踪，你的数据也不会被收集。太棒了。然而，这与其他数不清的付费电子邮件服务没有什么不同，比如Fastmail，Mailbox.org，Tutanota，Proton和Zoho。\n因此，尽管嘿对待用户隐私的方法很棒，但它并没有什么创新之处，也没有解决任何问题。在我看来，人们解决电子邮件隐私问题的唯一真正方法是停止使用这些免费服务，并为尊重隐私的服务付费。\n大多数尊重隐私的电子邮件服务的价格都低于每月一杯咖啡的价格。我认为，对于一项许多人每天都在使用的服务来说，这是一个相对较小的成本。\n你有一个电子邮件地址，随着时间的推移，数以百计的人和公司都会得到这个地址。这意味着成吨的邮件被随意扔进你的收件箱。这反过来又会导致手机主屏幕上的红色斑点显示非常大的数字。\n建立电子邮件工作流程极其重要。我能想到的每个电子邮件提供商都有某种过滤系统，可以让你自动将电子邮件过滤到特定的文件夹中。\n例如，如果你从亚马逊或eBay上买了很多东西，你可以创建规则，自动将购物和送货收据放入购物文件夹，并将它们标记为已读。\n那你根本不需要和他们打交道。它们是自动处理的，如果您需要的话，您知道它们在哪里。时事通讯也是如此--那些你想保留的，把它们归档。那些你不订阅的，取消订阅时事通讯。如果没有取消订阅链接，请制定自动删除这些时事通讯的规则。\n通过处理收到的邮件并过滤掉噪音，剩下的需要实际处理的邮件数量要少得多。\n这就是我认为嘿真的让自己失望的地方。传统的文件夹树在屏幕右侧的设置，以及在它们之间轻松切换的能力对我来说是合乎逻辑的。\n然而，在我看来，嘿上的工作流程完全被打破了。嘿的界面有三个主要部分：\n“收件箱”与您的“收件箱”完全相同，只是名字有点傻。Feed是时事通讯等应该投递的地方，而Paper Trail是收据之类的东西。\n这一切听起来都不错，但是没有一次点击就可以在这些界面之间来回切换。每个版本的用户界面也略有不同，这很不和谐。\n“嘿”中没有“已发送邮件”文件夹(至少我看不到)。所有内容都会进入收件箱下方不断滚动的邮件馈送中，这就是所谓的“之前看到的”。\n如果我有一份要保存的时事通讯，同时还有一封需要处理的电子邮件，我必须在“嘿”中的多个界面之间切换。而这两个都会在我的收件箱里的一个传统邮箱里。\n如果我想在三个#提要之间移动东西，就无法拖放。取而代之的是，我必须进入电子邮件，单击更多，单击移动，然后最终选择正确的提要。\n与传统邮箱中的一次点击(或拖放)相比，这是4次点击。\n我应该在这里注意到，整个“嘿”都有键盘快捷键。我真的很喜欢他们按菜单项列出快捷方式。然而，绝大多数人更喜欢使用鼠标。\n根据我的经验，高级用户倾向于使用键盘快捷键(包括我自己)。但是，如果“嘿”试图“修复电子邮件”，界面需要高效，让每个人都能导航。\n我在这篇文章中谈到的关于电子邮件的所有三个问题归根结底都是用户和他们的选择，而不是电子邮件作为一种服务。\n嘿是对电子邮件的一种有趣的看法，它可能是电子邮件的下一件大事。但我个人觉得这是一种炒作，纯粹是因为这对技术人员来说是一种新的闪亮的东西。\n如果我给我妻子一个“嘿”信箱，她会很快迷路的。这是一个有趣的概念，但我不由自主地认为，“嘿”是在试图解决一个不存在的问题。\n电子邮件远非完美，但它已经成熟成熟。只要做一点工作，你的收件箱就可以成为一个高度适度的列表，上面只有你需要处理的项目。\n我想在结束这篇文章的时候说，这只是我的观点。有些人可能不想像我一样花时间来管理他们收到的邮件。\n这绝对没问题，在这种情况下，像嘿这样的服务可能更适合你。但是，仅仅因为你没有准备好把工作放进去，并不意味着电子邮件就坏了。\n电子邮件远非完美，但我不认为它是坏的。你认为如何？", "note_en": "I’ve been reading a lot of hyperbole lately around how broken email is. Sure, email has problems, but is it actually broken? I don’t think it is.\n A lot of this hyperbole appears to have come about following the release of Basecamp’s new email service,  Hey. I’ve signed up for a Hey trial, and although it seems like a good service, I don’t think it fixes  any of the problems with email.\n  A good place to start a discussion about something as polarising as email, is to articulate what email actually is. That way, you guys will hopefully understand where I am coming from right from the start.\n To me, email is a way of receiving simple communications that have a short time to live.\n That’s all email is to me. They’re mostly unimportant messages that I receive, deal with, and move on. I imagine that’s what they are to many other people too, especially when you consider how many people have hundreds of unread items in their inbox. How important can the vast majority of email actually be if there’s so much unread mail floating around?\n To be clear, I’m not one of those people that has lots of unread mail. I’m a zero inbox kind of guy personally. But I couldn’t count the amount of times I’ve seen someone’s unlocked phone and noticed a mail icon sporting a red blob with an inordinately large number displayed in it.\n When I migrated my wife and I from  Gmail to Zoho, the amount of unread mail she had in her mailbox was ridiculous. I thought she didn’t reply to my emails just because she didn’t like me, turns out she just doesn’t check her email! 🙂\n  Now we have established what I believe email is, let’s look at some of the problems with email. To me, the main problems are threefold:\n   Spam is by far the biggest problem to plague email. No spam filter is perfect and it takes work to keep on top of it.\n Many email providers allow you to manage your spam on the fly. You can mark emails that slip through the net as spam, so the next time they will be caught. And conversely, you can mark false positives as safe.\n Let’s say that I received a spam email and it hits my inbox. I won’t delete it, I’ll actually mark it as spam so that my spam filter learns what spam is. If I were to delete it, my spam filter would be none the wiser and I would be perpetuating the problem.\n Conversely, if a legitimate email gets incorrectly marked as spam I won’t just move that mail into my inbox. I will mark the sender as safe,  then move the email. Again, it’s giving my spam filter the opportunity to learn.\n I’ve been using Zoho for a few years now and by doing this, the spam filtering is excellent and I receive very few spam mails to my inbox.\n  If you receive an email to your  Imbox (seriously?  Imbox…what a ridiculous name) that has come from an address Hey has never seen before, it forces the user to screen it first.\n  I think this is a good solution, in that it forces people to vet any potential spam as it comes in. But although this specific workflow isn’t baked into any other email provider that I know of, the ability to vet and manage spam is the norm these days.\n Email isn’t broken in this case – peoples’ inability to manage their incoming mail is.\n  Apparently  there are 1.5 billion people using Gmail globally. I’ve made efforts to significantly  reduce my Google usage, but a lot of people are happy with Gmail and that’s fine.\n What isn’t fine is the complete lack of privacy that Gmail affords its users. Apparently  Google will no longer read your email to personalise adverts. I don’t believe that for a second, but even if they do, there’s still adverts in Gmail and they wouldn’t provide a service to  billions of people  for free if they weren’t making a profit from it.\n  Email is not private, so I don’t treat it as such. If I have something that I want/need to email that is private, I will either  encrypt the email, or send an encrypted attachment. My email provider, Zoho, has a very  open privacy policy but I still wouldn’t use their service to send private data.\n It’s not just Gmail that’s the problem here – most free email providers have privacy issues.\n  When it comes to privacy, Hey has a great policy, saying the following on  their manifesto:\n There are lots of “free” email services out there, but free email costs you one of most valuable things you have – your privacy and your personal information. We’re not interested in your personal data. It’s always yours, never ours. We simply charge a flat, all‑inclusive $99/year fee for HEY. That makes our business work without having to sell your data, advertise to you, or otherwise engage in unscrupulous marketing tactics.\n The Hey manifesto\n I love this. As a Hey user you’re not being advertised to, or tracked and your data isn’t being harvested. Awesome. However, that’s no different than an untold number of other paid for email services like Fastmail, Mailbox.org, Tutanota, Proton and Zoho.\n So although Hey’s approach to their users’ privacy is great to see, it isn’t anything innovative and it isn’t fixing any problems. The only true way that I see for people to fix the privacy problems with email, is for people to stop using these free services and pay for a privacy respecting one.\n Most privacy respecting email services cost less than the price of a cup of coffee per month. I think this is a relatively small cost for a service that many people use every day.\n  You have an email address and over time hundreds of people and companies get that address. This means that tonnes of mail is just arbitrarily dumped in your inbox. Which in turned leads to that red blob on your phone’s home screen that displays a  very large number.\n  Establishing an email workflow is extremely important. Every email provider I can think of has some sort of filtering system that allows you to filter emails into certain folders automatically.\n For example, if you buy a lot of stuff from Amazon or eBay, you could create rule that automatically puts shopping and delivery receipts into a  Shopping folder and marks them as read.\n You don’t need to deal with them at all then. They’re dealt with automatically and you know where they are if you need them. Same with newsletters – the ones you want to keep, file them away. The ones you don’t, unsubscribe from the newsletter. If there is no unsubscribe link, make a rule that automatically deletes those newsletters.\n By working through your incoming mail and filtering out the noise, you’re left with a much smaller collection of mail that you need to actually deal with.\n  This is where I think Hey really lets itself down. The traditional setup of a folder tree down the right-hand side of the screen, and the ability to easily flip between them is logical to me.\n However, the workflow on Hey is completely broken in my opinion. There are three main parts to Hey’s interface:\n  The  Imbox is exactly the same as your Inbox, just with a silly name.  The Feed is where newsletters etc. are suppose to be delivered to and  The Paper Trail is for things like receipts.\n This all sounds good, but there’s no single-click way of getting to and from those interfaces. The UI for each is also slightly different, which is jarring.\n There is no sent items folder in Hey (not that I could see at least). Everything just goes into an ever scrolling feed of mail below your  Imbox, called  Previously Seen.\n  If I have a newsletter I’m saving for later, along with an email I need to deal with, I have to flip between multiple interfaces within Hey. Whereas both would be in my Inbox in a traditional mailbox.\n If I want to move something between the three Hey feeds, there’s no way to drag and drop. Instead I have to go into the email, click  More, click  Move then finally select the right feed.\n   That’s 4 clicks compared to a single click (or drag &amp; drop) in a traditional mailbox.\n I should note here that there are keyboard shortcuts throughout Hey. I really like that they list the shortcuts by the menu items too. However, the vast majority of people prefer using a mouse.\n Power users tend to prefer keyboard shortcuts in my experience (myself included). But if Hey are trying to “fix email” the interface needs to be efficient for  everyone to navigate.\n  All three of the problems with email that I have talked about in this post boil down to the user and their choices, rather than email as a service.\n Hey is an interesting take on email and it may be the next big thing for email. But I personally feel that it’s a lot of hype, purely because it’s a new shiny thing for techies to play with.\n If I were to give my wife a Hey mailbox, she would get very lost, very quick. It’s an interesting concept, but I can’t help but think that Hey are trying to fix a problem that doesn’t exist.\n Email is far from perfect, but it’s well established and mature. With a little bit of work your inbox can be a highly moderated list of only items you need to deal with.\n   I’d like to end this post by saying that  this is just my opinion. Some people may not want to invest the time to manage their incoming mail like I do.\n That’s absolutely fine and in such cases services like Hey may work better for you. But just because you’re not prepared to put the work in, doesn’t mean that email is broken.\n Email is far from perfect, but I don’t think it’s broken. What do you think?", "posttime": "2020-07-01 15:02:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电子邮件,email", "title": "电子邮件未损坏", "title_en": "Email Is Not Broken", "transed": 1, "url": "https://kevq.uk/email-is-not-broken/", "via": "", "real_tags": ["电子邮件", "email"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1009229, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "顾问皮尔克说，马斯克的薪酬和Twitter的爆发对公司构成了“严重的声誉损害风险”\n特斯拉(Tesla)投资者被敦促投票罢免这家电动汽车公司创始人兼首席执行官埃隆·马斯克(Elon Musk)的董事会职务，因为人们对他的奖金协议越来越愤怒，他可能会获得创纪录的558亿美元(400亿英镑)奖金。\nPirc是包括英国地方政府养老基金在内的股东的颇具影响力的顾问，该公司周二建议投资者投票反对特斯拉的高管薪酬协议，因为该协议“不公平地让首席执行官致富”。\n皮尔克表示，这笔交易使公司面临诉讼，指控称：“董事会，包括首席执行官埃隆·马斯克，在三年的时间里给自己提供了过高的薪酬方案，据称这让董事们‘以公司为代价谋取私利’。”\n这位股东顾问呼吁投资者投票反对马斯克因薪酬协议而连任董事会成员，并警告称，马斯克“对公司及其股东构成了严重的声誉损害风险”。\n皮尔克表示，马斯克在推特上频繁爆发的有争议的行为已经让特斯拉付出了数百万美元的和解费用，同时也给“公司带来了不必要的声誉风险”。\n去年，马斯克因在推特上对英国洞穴探险家弗农·昂斯沃斯(Vernon Unsworth)进行诽谤而被起诉，要求获得1.9亿美元的诽谤赔偿金。昂斯沃斯当时正在帮助营救被困在泰国一个洞穴中的13人。陪审团裁定，这些推文没有达到诽谤的法律标准，马斯克也没有被判承担损害赔偿责任。\n2018年，美国证券交易委员会(SEC)监管机构对马斯克和特斯拉都处以2000万美元的罚款，原因是这位首席执行官在推特上表示，他计划以较股价大幅溢价的价格将公司私有化，导致股价飙升。作为与SEC达成和解的一部分，马斯克被迫放弃了特斯拉董事长的职位。\n美国证券交易委员会裁定：“事实上，马斯克知道潜在的交易是不确定的，并受到许多或有事件的影响。马斯克没有与任何潜在的融资伙伴讨论过包括价格在内的具体交易条款，他关于可能交易的声明实际上缺乏充分的基础。\nPirc称，这一事件“引发了对股市滥用行为的指控，SEC指控马斯克对投资者撒谎.”马斯克和特斯拉与SEC就这些索赔达成和解，支付了4,000万美元，造成了财务损失。\nPIRC的股东报告还引发了对马斯克反对新冠肺炎锁定措施的推文的担忧。皮尔克表示：“马斯克一直直言不讳地反对新冠肺炎的隔离措施，据报道，他要求工人在隔离期间返回工作岗位，而没有足够的预防/保护措施，而且不顾工人的抗议。”“这一担忧进一步加剧，因为也有报道称，自重返工作岗位以来，多名特斯拉员工的新冠肺炎检测呈阳性。”\n投资者还被敦促投票反对连任罗宾·登霍尔姆(Robyn Denholm)担任特斯拉董事长。2018年11月马斯克被迫下台时，她接替了他。皮尔克说，她应该辞职，因为她作为独立非执行主席和薪酬委员会成员监督马斯克的薪酬奖励。\n特斯拉的年度股东大会原定于7月7日举行，但该公司周日将投票推迟到了9月。", "note_en": "Adviser Pirc says Musk’s pay and Twitter outbursts pose ‘serious risk of reputation harm to the company’\n    Tesla investors are being urged to vote to remove Elon Musk, the electric vehicle company’s founder and chief executive, from the board of the firm as anger mounts over his bonus deal that  could pay him a record $55.8bn (£40bn).\n Pirc, an influential adviser to shareholders, including the UK’s local authority pension funds, on Tuesday recommended that investors voted against Tesla’s executive pay deal because it “unfairly enriches the chief executive”.\n Pirc said the deal had exposed the company to a lawsuit, alleging that: “The board, including CEO Elon Musk, awarded themselves excessive compensation packages over a three-year period that allegedly allowed directors to ‘enrich themselves at the company’s expense’.”\n The shareholder adviser called on investors to vote against re-electing Musk to the board because of the pay deal, and warned he posed “a serious risk of reputational harm to the company and its shareholders”.\n Pirc said Musk’s frequent controversial outbursts on Twitter had cost Tesla millions of dollars in settlements and also represented an “unnecessary reputational risk to the company”.\n  Last year Musk was sued for $190m in defamation damages over  derogatory tweets about  the British caver Vernon Unsworth, who was helping to rescue 13 people trapped in a Thai cave. A jury found the tweets did not reach the legal standard for defamation, and Musk was not found liable for damages.\n In 2018 the  US Securities and Exchange (SEC) regulator fined both Musk and Tesla $20m over the chief executive’s tweets that he planned to take the company private at a substantial premium to the share price, causing the stock price to surge. As part of the settlement with the SEC Musk was forced to give up his position as Tesla’s chairman.\n  The SEC ruled: “In truth, Musk knew that the potential transaction was uncertain and subject to numerous contingencies. Musk had not discussed specific deal terms, including price, with any potential financing partners, and his statements about the possible transaction lacked an adequate basis in fact.”\n Pirc said the episode had “prompted accusations of stock market abuse, with the SEC alleging that Musk had lied to investors. Mr Musk and Tesla settled these claims with the SEC, paying $40m, causing financial damage”.\n Pirc’s shareholder report also raised concerns about  Musk’s tweets in  opposition to Covid-19 lockdown measures. “Mr Musk has been a vocal  opponent of the Covid-19 quarantine, and reportedly  required workers to return to work during quarantine, without sufficient precautions/protections and despite protests from workers,” Pirc said. “This concern is furthered as it has also been reported that multiple Tesla employees have tested positive for Covid-19 since returning to work.”\n Investors were also urged to vote against re-electing Robyn Denholm as Tesla’s chair. She succeeded Musk when he was forced to step down in November 2018. Pirc said she should step down because of her role overseeing Musk’s pay award as independent non-executive chair and as a member of the remuneration committee.\n Tesla’s annual general meeting was due to take place on 7 July, but the company on Sunday delayed the vote until September.", "posttime": "2020-07-01 14:35:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,交易,埃隆·马斯克,pay", "title": "特斯拉股东敦促埃隆·马斯克因550亿美元薪酬交易下台", "title_en": "Tesla shareholders urged to oust Elon Musk over $55bn pay deal", "transed": 1, "url": "https://www.theguardian.com/business/2020/jun/30/tesla-shareholders-urged-to-oust-elon-musk-over-55bn-pay-deal", "via": "", "real_tags": ["特斯拉", "交易", "埃隆·马斯克", "pay"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1009228, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几年前，我的阅读清单上突然出现了一篇题为“改进质量、稳定和变化的渐进式增长的甘斯”(Progative Growth of Gans for ImprovedQuality，Stability，and Variation)的论文。它描述了逐渐发展的生成性对抗网络，从低分辨率图像开始，然后随着训练的进行建立更多的细节。它在当时得到了相当多的新闻报道，因为作者们用他们的想法产生了逼真的、独特的人脸图像。\n看着这些图像，神经网络似乎必须学习大量的东西才能做到这些网络正在做的事情。其中一些似乎相对简单而又真实--比如，眼睛的颜色应该相配。但其他方面非常复杂，很难用语言表达。例如，需要哪些细微差别才能将眼睛、嘴巴和嘴巴的配置连接成连贯的面部表情？当然，我在这里将随机机器拟人化，我们可能会被我们的直觉愚弄--结果可能是，工作的变体相对较少，而解空间比我们想象的更有限。也许最有趣的不是图像本身，而是它们对我们产生的不可思议的影响。\n一段时间后，一个最受欢迎的微型PhyloPic播客出现了，这是一个关于动物、植物和其他生命形式的剪影图像的数据库。沿着上面的思路沉思，我想知道如果你训练一个像ProgressiveGans的论文中那样的系统，在这样一个非常多样化的数据集上会产生什么结果。你会不会只产生一些已知动物类型的变体，或者是否会有足够的变体来进行神经网络驱动的推测动物学？不管结果如何，我确信我会从它的研究墙上得到几个很好的指纹，所以我开始以一种开放的实验态度来满足我的好奇心。\n我改编了渐进式GANspaper中的代码，并使用具有8NVIDAK80GPU的Google Cloud实例在完整的PhyloPic数据集上训练了12000次迭代的模型。总训练时间为4天，包括部分假启动和实验。我用最终训练好的模型制作了50k张单独的图片，然后花了几个小时仔细研究结果，对图片进行分类、过滤和整理。我还做了一些光线编辑，通过翻转图像使生物朝向相同的方向，因为我发现这在视觉上更令人满意。这种亲身实践的方法意味着你下面看到的是我和神经网络之间的某种合作-它完成了创造性的工作，而我进行了编辑。\n第一件让我惊讶的事情是，结果是多么的美观愉悦。这在很大程度上当然反映了制作原始数据的艺术家的良好品味。然而，也有一些令人高兴的意外。例如，似乎每当神经网络进入不确定的领域-无论是它还没有完全掌握的繁琐的比特，还是完成模糊的生物幻想的飞行-色差就开始进入画面。这很奇怪，因为输入集完全是黑白的，所以颜色不可能是某些生成性问题的习得解决方案。任何颜色都必须是机器头脑的纯人工制品。令人高兴的是，持续触发色差的东西之一是飞行昆虫的翅膀。这意味着它产生了成百上千种色彩斑斓的蝴蝶，就像上面提到的那样。我想知道这是否可能是一个有用的观察-如果你只使用黑白图像进行训练，但需要全彩色输出，那么彩色斑点可能是一种有用的方式来查看模型在哪里仍然无法准确地表示训练集。\n作品的大部分是各种完全可辨认的剪影-鸟类、各种四足动物、大量优雅的小兽脚类恐龙、蜥脚类动物、鱼类、虫子、蜘蛛类和人形动物。\n一旦已知的生物被淘汰，我们就能找到更陌生的东西。我对此提出的问题之一是，是否会出现自然界中不存在的看似合理的动物身体计划-也许是输入集合中的生物的杂交。嗯，通过仔细的搜索和一丝有用的空想，我发现了数百只四足鸟，蛇头鹿和其他奇妙的怪物。\n在更深的未知中，这个模型产生了奇怪的抽象模式和无法辨认的实体，所有这些都给人一种模糊的生物般的、栩栩如生的感觉。\n在上面的图像中没有体现出来的是结果中的绝对丰富的变化。我正在打印和装框一些这样的图像集，数以百计的小的、细节的图像在规模上并排的效果相当令人震惊。为了对整个数据集的范围有一些了解，我在下面包括了其中一张照片--这张照片是从未过滤的图像语料库中随机抽取的样本。", "note_en": "A couple of years ago a paper titled   Progressive Growing of GANs for ImprovedQuality, Stability, and Variationcropped up on my reading list. It describes growing  generative adversarialnetworksprogressively, starting with low-resolution images, and then building up moredetail as training goes on. It got quite a bit of press at the time because theauthors used their idea to generate realistic, unique images of human faces.\n  Looking at these images, it seems like the neural net would have to learn a vastnumber of things to be able to do what these networks were doing. Some of thisseems relatively simple and factual - say, that eye colours should match. Butother aspects are fantastically complex and hard to articulate. For instance,what nuances are needed to link the configuration of eyes, mouth and skincreases into a coherent facial expression? Of course, I&#39;m anthropomorphising astatistical machine here, and we may be fooled by our intuition - it could turnout that there are relatively few working variations, and that the solutionspace is more constrained than we imagine. Maybe the most interesting thing isnot the images themselves, but rather the uncanny effect they have on us.\n Some time later, a  favourite podcast of minementioned  PhyloPic, a database of silhouette images ofanimals, plants and other lifeforms. Musing along the lines above, I wonderedwhat would result if you trained a system like the one in the  ProgressiveGANs paper on a very diverse dataset of this sort. Would you just generatemany variations of a few known animal types, or would there be enough variationto do neural-network driven  speculativezoology?However things played out, I was pretty sure I would get a few good prints formy study wall out of it, so I set out to satisfy my curiosity with an attitudeof open-minded experimentation.\n  I adapted the  code from the progressive GANspaper, and trained amodel for 12000 iterations using a Google Cloud instance with 8 NVIDA K80 GPUsover the complete PhyloPic dataset. Total training time, including some falsestarts and experiments, was 4 days. I used the final trained model to produce50k individual images, and then spent hours poring over the results,categorising, filtering and collating images. I also did some light editing byflipping images to orient creatures in the same direction, because I found thisa bit more visually satisfying. This hands-on approach means that what you seebelow is a sort of collaboration between me and the neural net - it did thecreative work, and I edited.\n  The first surprising thing to me was how aesthetically pleasing the resultswere. Much of this is certainly a reflection of the good taste of the artistswho produced the original data. However, there were also some happy accidents.For instance, it seems that whenever the neural net enters uncertain territory -whether it be fiddly bits that it hasn&#39;t quite mastered yet or complete flightsof vaguely biological fantasy - chromatic aberrations begin to enter thepicture. This is curious, because the input set is entirely in black and white,so colour cannot be a learned solution to some generative problem. Any colourmust necessarily be a pure artefact of the mind of the machine. Delightfully,one of the things that consistently triggers chromatic aberrations are the wingsof flying insects. This means that it generated hundreds and hundreds ofvariations of evocatively-coloured &#34;butterflies&#34; like the ones above. I wonderif this could be a useful observation - if you train using only black-and-whiteimages, but demand output in full colour, splotches of colour might be a usefulway to see where the model is still not able to accurately represent thetraining set.\n The bulk of the output is a huge variety of entirely recognisable silhouettes -birds, various quadrupeds, reams of little gracile theropod dinosaurs,sauropods, fish, bugs, arachnids and humanoids.\n        Once the known critters have been weeded out, we get to stranger things. One ofthe questions I had going into this was whether plausible animal body plans thatdon&#39;t exist in nature would emerge - perhaps hybrids of the creatures in theinput set. Well, with careful search and a helpful touch of pareidolia, I foundhundreds of quadrupedal birds, snake-headed deer and other fantasticalmonstrosities.\n  Straying even further into the unkown, the model produced weird abstractpatterns and unidentifiable entities, all with a vaguely biological, &#34;life-ish&#34;feel to them.\n    What doesn&#39;t come through in the images above is the sheer abundance ofvariation in the results. I&#39;m having a number of these image sets printed andframed, and the effect of hundreds of small, detailed images side by side atscale is quite striking. To give some idea of the scope of the full dataset, I&#39;mincluding one of these prints below - this one is a random sample from theunfiltered corpus of images.", "posttime": "2020-07-01 13:45:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "神经网络,生殖,zoology,图像", "title": "神经网络在生殖动物学中的应用", "title_en": "Generative Zoology with Neural Networks", "transed": 1, "url": "https://corte.si/posts/code/genzoo/", "via": "", "real_tags": ["神经网络", "生殖", "zoology", "图像"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1009227, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我最近偶然看到安德鲁·肯斯勒(Andrew Kensler)迷人的名片光线追踪器(Raytracer)。他的代码，只有1337字节，生成了一个完整的光线跟踪图像，包括景深、反射、天空渐变和纹理地板。同样，我开始创建一个可以放在名片背面的完整神经网络。下面的代码就是结果，创建了一个带有泄漏-重新激活的3层完全连接的神经网络，并对其进行训练以生成我的名字的小图像。\n#include&lt；bits/stdc++.h&gt；tyfinf Float f；tydeff std：：Vector&lt；f&gt；v；f K=0.01，R=0.01；struct L{int w，h，i；v W，x，z；L(int i，int o){W。Resize(i*o)；for(f&amp；a：w)a=(rand()/(1.1-(1&lt；&lt；31)-0.5)/sqrt(i+o+0.。)；w=i；h=o；}v F(V X){x=X；v a(H)；i=h*w；而(i--)a[i/w]+=W[i]*x[i%w]；z=a；对于(f&amp；i：a)i=K&gt；i？k：i；return a；}v B(V Y){v X(W)；i=w*h；而(i--){f Z=Y[i/w]*(z[i/w]&gt；0？1：k)；X[i%w]+=Z*W[i]；W[i]-=R*Z*x[i%w]；}return X；}}；int main(){Ln[]{L(40，50)，L(50，50)，L(50，1)}；int l，z，k，i=500337；而(i-){z=242%243；k=40；vx(K)，y；而(k--)x[k]=sin((k%2？z/27/3.：z%27/5)+6.14*k/20)；y=x；对于(l=0；l&lt；3；l++)y=n[l]。F(Y)；v Y{2*(y[0]-(&#34；\\x1e\\0\\0\\b\\x01\\0@H\\374\\377 B\\x12@\\x18\\x12 G\\302\\\\x10@\\x12\\372\\377\\221\\x10\\0\\0\\200\\0\\0\\\\x02&#34；[z/8]&gt；&gt；z%8&amp；1)。B(Y)；putchar(&#34；.，-*Oo##&#34；[(Int)(y[0]*8)%9])；如果(i%27&lt；1)放入(i？i%243？&#34；&#34；：&#34；\\033[9A&#34；：&#34；：\\r\\-Oisin Carroll-\\n\\gh：Oisincar web：imois.in&#34；)；}}。\n您可以通过单击播放按钮在此处查看输出。(我不愿承认这一点，因为它实际上并没有在浏览器中运行代码：p，但是如果您自己运行代码，您将看到相同或相似的输出)。\n代码只有878个字符，并且(如前所述)创建和训练一个小型神经网络。我确信有可能让它变得更短，但我很高兴能走到这一步！我想把它再短一点就不可能推理了，现在至少可以很容易地添加或删除新的层，并且向前/向后传播相当整齐！(我发誓我没有偏见)。\n定义简单的导入和typedefs。这两个浮点定义用于泄漏REU的泄漏的常数(即\\(K\\)in\\(f(X)=max(Kx，x)\\))和学习速率。\n层结构L的开始。构造函数接受输入和输出大小，并以Xavier初始化的近似值初始化权重矩阵。理想情况下，随机变量应该是正态分布的，但是线性似乎也可以很好地工作！\nLayer结构的两个函数。F执行前向传播，获取输入向量并返回输出。有些值被缓存以备以后使用。B执行反向传播，取输出的导数，更新权重矩阵，并返回输入的导数。两家公司都在使用漏水的RELU。\n从Main开始，创建一个3层网络。该网络接受40个值作为输入，具有两个隐含层，每个隐含层有50个节点，最后返回单个值。输入基于当前预测的x，y坐标，输出是该像素应该是空格还是&#39；#&#39；的单个值。在最后，我们打开训练循环，它运行500336次迭代，这是输出大小的倍数；243.\n生成输入向量x。x的每个元素都基于当前预测的像素的x或y坐标的sin。\n根据网络的输出y，计算\\(\\frac{de}{dy}\\)。我们使用均方误差，所以导数正好是\\(2(y-\\hat{y})\\)，其中\\(\\hat{y}\\)是目标值，并编码在字符串中。当用非ASCII字符书写时，这要短得多。\n输出：根据预测值的高低选择不同的字符。如果我们位于行尾(I%27==0)，或者我们已经完成了一个完整的纪元(I%243==0)，则打印特殊字符。最后，当我们完成时，i==0并打印结束文本。\n谢谢你的阅读！我想听听关于如何缩短篇幅的建议，或者任何其他的想法。", "note_en": "I recently came across Andrew Kensler&#39;s fascinating  Business Card Raytracer. His code, in just 1337 bytes, generates a full raytraced image complete with depth of field, reflections, a sky gradient, and a textured floor. In a similar vein, I set out to create a full neural network that could fit on the back of a business card. The code below is the result, creating a 3-layer fully-connected neural network with leaky-relu activations and training it to generate a small image of my name.\n #include  &lt;bits/stdc++.h&gt;  typedef  float  f ; typedef  std :: vector &lt; f &gt;  v ; f  K = 0.01 , R = 0.01 ; struct  L { int  w , h , i ; v  W , x , z ; L ( int  i , int  o ){ W . resize ( i * o ); for ( f &amp; a : W ) a = ( rand () / ( 1.1 - ( 1 &lt;&lt; 31 )) - 0.5 ) / sqrt ( i + o + 0. ) ; w = i ; h = o ;} v  F ( v  X ){ x = X ; v  a ( h ); i = h * w ; while ( i -- ) a [ i / w ] += W [ i ] * x [ i % w ]; z = a ; for ( f &amp; i : a ) i = K &gt; i ? K : i ; return  a ;} v  B ( v  Y ){ v  X ( w ); i = w * h ; while ( i -- ){ f  Z = Y [ i / w ] * ( z [ i / w ] &gt; 0 ? 1 : K ); X [ i % w ] += Z * W [ i ]; W [ i ] -= R * Z * x [ i % w ];} return  X ;}}; int  main (){ L  n []{ L ( 40 , 50 ), L ( 50 , 50 ), L ( 50 , 1 )}; int  l , z , k , i = 500337 ; while ( i -- ){ z = 242 - i % 243 ; k = 40 ; v  x ( k ), y ; while ( k -- ) x [ k ] = sin (( k % 2 ? z / 27 / 3. : z % 27 / 5. ) + 6.14 * k / 20 ); y = x ; for ( l = 0 ; l &lt; 3 ; l ++ ) y = n [ l ]. F ( y ); v  Y { 2 * ( y [ 0 ] - ( &#34; \\x1e\\0 \\ \\0\\b\\x01\\0 @H \\374\\377 B \\x12 @ \\x18\\x12 G \\302 \\ \\x10 @ \\x12\\372\\377\\221\\x10\\0\\0\\200\\0\\0\\0 \\ \\x02 &#34; [ z / 8 ] &gt;&gt; z % 8 &amp; 1 ))}; while ( l -- ) Y = n [ l ]. B ( Y ); putchar ( &#34; .,-*oO##&#34; [( int )( y [ 0 ] * 8 ) % 9 ]); if ( i % 27 &lt; 1 ) puts ( i ? i % 243 ? &#34;&#34; : &#34; \\033 [9A&#34; : &#34; \\r \\  --- Oisin Carroll --- \\n \\  gh:Oisincar web:imois.in&#34; );}}\n You can view the output here by clicking the play button. (I hate to admit it&#39;s not actually running the code in the browser :P, but you&#39;ll see the same or similar output if you run the code yourself).\n  The code is only 878 characters, and (as mentioned previously) creates and trains a small neural network. I&#39;m sure it&#39;s possible to make it shorter still, but I was happy enough to get this far! I think making it any shorter would make it impossible to reason about, now at least new layers can be added or removed easily and the forward/back propagation is pretty neat! (I&#39;m not biased I swear).\n  Define simple imports and typedefs. The two floats define constants used for the &#39;leak&#39; of leaky relu, (I.e. the \\(K\\) in \\(f(x) = max(Kx, x)\\)), and the learning rate.\n Start of the layer struct  L. The constructor takes the input and output sizes, and initializes a weights matrix in an approximation of  Xavier Initilization. Ideally, the random variable would be normally distributed, but linearly seems to work decently too!\n Two functions for the layer struct.  F performs forward propagation, taking the input vector and returning the output. Some values are cached for later.  B performs backward propagation, taking the derivative of the output, updating the weights matrix, and returning the derivative of the input. Both are using leaky relu.\n Start of main, create a 3 layer network. The network takes 40 values for input, and has two hidden layers with 50 nodes each, and returns single value at the end. The input is based on the x,y coordinate currently predicted, and the output is a single value for whether this pixel should be a space or &#39;#&#39;. At the end we open the training loop, which runs for 500336 iterations, which is a multiple of the output size; 243.\n Generate the input vector  x. Each element of  x is based on the sin of either the x or y coordinate of the pixel currently being predicted.\n  From the output of the network,  y, calculate \\(\\frac{dE}{dy}\\). We use mean squared error, so the derivative is just \\(2(y-\\hat{y})\\), where \\(\\hat{y}\\) is the target value and is encoded in a string. When written with non-ascii characters this is a lot shorter.\n  Output: Choose different chars based on how high/low the value predicted is. Then print special characters if we&#39;re at the end of a line ( i%27==0) or we&#39;ve done a full epoch ( i%243==0). Finally, when we&#39;re finished,  i==0 and we print the end text.\n Thanks for reading! I&#39;d love to hear suggestions on how to make it shorter, or any other ideas.", "posttime": "2020-07-01 13:44:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "神经网络,名片,card,输出", "title": "名片神经网络", "title_en": "Business Card Neural Network", "transed": 1, "url": "https://imois.in/posts/card-network/", "via": "", "real_tags": ["神经网络", "名片", "card", "输出"]}, {"category": "", "categoryclass": "", "imagename": "036d5195b64e301b4cb22f6c1e34455e.jpeg", "infoid": 1009225, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据底特律警察局自己的统计数据，2020年到目前为止，底特律警方几乎完全针对黑人使用了高度不可靠的面部识别技术。上周，在美国公民自由联盟(American Civil Liberties Union)和“纽约时报”(New York Times)曝光了罗伯特·朱利安-博尔恰克·威廉姆斯(Robert Julian-Borchak Williams)的案件后，国务院对这项技术的使用引起了全国的关注。由于这项技术，威廉姆斯被错误逮捕。\n在周一的一次公开会议上，底特律警察局长詹姆斯·克雷格(James Craig)承认，这项由一家名为Dataworks Plus的公司开发的技术几乎永远不会带来直接匹配，而且几乎总是误认人。\n克雷格说：“如果我们只使用该软件[识别对象]，我们95-97%的时间都不会破案。”“这是如果我们完全依赖软件的话，这将违反我们目前的政策…。如果我们仅仅使用这项技术本身来识别某人，我会说96%的时间它会误认。\nDataworks Plus总经理托德·帕斯托里尼(Todd Pastorini)告诉主板，该公司没有统计该软件在现实世界中使用的准确性，也没有专门指导执法部门如何使用该软件。\n帕斯托里尼说，没有这方面的统计数据。问题在于所用探头的质量。根据“纽约时报”上一篇文章，我非常不情愿，因为根据所用的上下文，我被错误地引用或略微歪曲了。你可能知道铲子是怎么工作的--你把它插进地里捡土，然后你就可以把它当作武器了。面部识别在某种程度上已经被媒体武器化了。我明白酋长的话，但不幸的是很多人不明白。\n帕斯托里尼将Dataworks Plus软件比作自动指纹识别系统，可以返回数十或数百个潜在的匹配项。他说，它没有带回一个候选人。有几百个。它们的权重就像基于探针的指纹系统(以及数据库中的内容)。\n根据底特律警察的说法，这样做的结果是，他们最终决定根据软件返回的信息和侦探的判断来询问和调查人们。这意味着，可能与犯罪无关的人最终会受到警方的讯问和调查。在底特律，这意味着几乎只有黑人。\n根据底特律警察局公开发布的数据，今年到目前为止(截至6月22日)，这项技术已经被使用了70次。在其中68起案件中，输入软件的照片是一名黑人；在其中两起案件中，种族被列为U，这很可能意味着身份不明(在警方的其他报告中，U代表身份不明)；底特律警察局没有回应要求澄清的请求。这些照片主要来自社交媒体(70例中有31例)或安全摄像头(70例中18例)。\n几个城市已经禁止警察使用面部识别软件，该软件存在众所周知的种族偏见问题(以及许多假阳性问题)。然而，底特律在2019年就面部识别的使用展开了一场非常公开的辩论，并决定对其使用进行监管，而不是完全禁止。去年年底，该市通过了一项政策，禁止使用面部识别来“通过任何摄像头或视频设备监控公众”，禁止在直播和录制的视频上使用面部识别，并限制(但不禁止)在抗议活动中使用面部识别。根据该政策，该软件只能用于“个人的静止图像”，并且只能作为正在进行的刑事调查的一部分。该软件检查州照片数据库中的图像，其中包括面部照片。作为这些规定的一部分，警察局被要求每周发布有关该技术使用情况的报告，报告显示，该技术几乎只用于黑人身上。\n威廉姆斯在该政策付诸实施前被捕。克雷格在会议上说，它通过DataWorks的面部识别系统运行的媒体是“一个可怕的视频”。它是颗粒状的…。在新的政策…下，它永远不会成功。如果我们拍不到好照片，我们是不会把它推给侦探的。“。\n克雷格和他的同事阿里克·托斯基上尉表示，他们希望继续使用面部识别，因为他们表示，面部识别可以成为协助调查人员的工具，即使它通常不会导致逮捕。但是，即使某人没有被错误逮捕，通过面部识别错误识别他们的人往往会导致调查人员对他们进行讯问，这充其量是一种不便，在最糟糕的情况下可能是致命的。据托斯基介绍，多年来，这项技术总共用于185例病例。“侦探报告的大多数案件都说(该软件)没用。”\n尽管存在这些问题，Dataworks Plus表示，它并不指导执法部门如何最好地使用该软件。帕斯托里尼说：我们不会告诉客户如何使用该系统。已经有执法政策了。根据我的经验，图像越清晰，显然会影响到更坚实的结果的可能性。\n底特律警察局没有回应进一步置评的请求。近几个月来，市议会议员发起了一场新的运动，禁止使用这项技术。\n签署“色情通讯”，即表示您同意接收来自“色情通讯”的电子通讯，其中有时可能包括广告或赞助内容。", "note_en": "Detroit police have used highly unreliable facial recognition technology almost exclusively against Black people so far in 2020, according to the Detroit Police Department’s own statistics. The department’s use of the technology gained national attention last week after the American Civil Liberties Union and   New York Times brought to light the case of Robert Julian-Borchak Williams, a man who was wrongfully arrested because of the technology.\n  In a public meeting Monday, Detroit Police Chief James Craig admitted that the technology, developed by a company called DataWorks Plus, almost never brings back a direct match and almost always misidentifies people.\n  “If we would use the software only [to identify subjects], we would not solve the case 95-97 percent of the time,” Craig said. “That’s if we relied totally on the software, which would be against our current policy … If we were just to use the technology by itself, to identify someone, I would say 96 percent of the time it would misidentify.&#34;\n  Todd Pastorini, a general manager at DataWorks Plus, told Motherboard that it does not keep statistics on the software&#39;s accuracy in real-world use, and it does not specifically instruct law enforcement how to use the software.\n  &#34;There&#39;s no statistics for that,&#34; Pastorini said. &#34;The matter is the quality of the probes used. I’m very reluctant based on the last   New York Times article I was misquoted or slightly misrepresented based on the context that was used. You might know how a shovel works—you stick it in the ground to pick up dirt and you might use it as a weapon. Facial recognition has been weaponized by the media to some degree. I understand the chief’s comment, but unfortunately many people don’t.&#34;\n  Pastorini likened DataWorks Plus&#39; software to automated fingerprint identification systems, where dozens or hundreds of potential matches are returned. It &#34;does not bring back a single candidate,&#34; he said. &#34;It&#39;s hundreds. They are weighted just like a fingerprint system based on the probe [and what&#39;s in the database].&#34;\n  The result of this, according to Detroit&#39;s own police officers, is that they are ultimately making the decision to question and investigate people based on what the software returns and a detective&#39;s judgment. This means that people who may have had nothing to do with a crime are ultimately questioned and investigated by police. In Detroit, this means, almost exclusively, Black people.\n  So far this year (through June 22), the technology had been used 70 times,  according to publicly released data by the Detroit Police Department. In 68 of those cases, the photo fed into the software was of a Black person; in two of the cases, the race was listed as &#39;U,&#39; which likely means unidentified (in other reports from the police, U stands for unidentified); the Detroit Police Department did not respond to a request to clarify. These photos were largely pulled from social media (31 of 70 cases), or a security camera (18 of 70 cases).\n  Several cities have banned police from using facial recognition software, which has well-known racial bias issues (and many false-positive issues as well). Detroit, however, has a very public debate in 2019 about the use of facial recognition, and instead decided to regulate its use rather than ban it altogether. Late last year, the city adopted a policy, which bans the use of facial recognition to “surveil the public through any camera or video device,” bans its use on livestream and recorded videos, and restricts (but does not ban) its use at protests. According to the policy, the software must be used only “on a still image of an individual,” and can only be used as part of an ongoing criminal investigation. The software checks images across a state database of photos, which include mugshot images. As part of these regulations, the police department is required to release weekly reports about the use of the technology, which show that it has been almost exclusively used on Black people.\n  Williams was arrested before the policy went into practice. Craig said during the meeting that the media it ran through DataWorks’ facial recognition system was “a horrible video. It was grainy … it would have never made it under the new policy … if we can’t obtain a good picture, we’re not going to push it through to the detective.”\n  Craig and his colleague, Captain Ariq Tosqui, said that they want to continue using facial recognition because they say it can be a tool to assist investigators even if it doesn’t often lead to arrest. But even when someone isn’t falsely arrested, their misidentification through facial recognition can often lead to an investigator questioning them, which is an inconvenience at best and a potentially deadly situation at worst. According to Tosqui, the technology has been used on a total of 185 cases throughout the years. “The majority of the cases the detective reported back that [the software] was not useful.”\n  Despite these problems, DataWorks Plus said that it does not guide law enforcement on how to best use the software. &#34;We don&#39;t tell our customers how to use the system,&#34; Pastorini said. &#34;There’s already law enforcement policies. It is my experience the clearer the image, clearly is going to affect the likelihood of a more solid result.&#34;\n  The Detroit Police Department did not respond to a request for further comment. In recent months, there has been a new movement  by city council members to ban the use of the technology.\n  By signing up to the VICE newsletter you agree to receive electronic communications from VICE that may sometimes include advertisements or sponsored content.", "posttime": "2020-07-01 13:20:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,底特律,detroit", "title": "底特律警察局长：面部识别软件96%会误认|底特律监管的面部识别软件。它仍然只在黑人身上使用。", "title_en": "Detroit Police Chief: Facial Recognition Software Misidentifies 96% of the Time | Detroit regulated facial recognition software. It's still used only on Black people.", "transed": 1, "url": "https://www.vice.com/en_us/article/dyzykz/detroit-police-chief-facial-recognition-software-misidentifies-96-of-the-time", "via": "", "real_tags": ["软件", "底特律", "detroit"]}, {"category": "", "categoryclass": "", "imagename": "8f75bfbe36a2cac21db01cca202e8803.jpeg", "infoid": 1009224, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多伦多-周一，太阳马戏团娱乐集团(Cirque Du Soleil Entertainment Group)在加拿大申请破产保护，以挽救因冠状病毒大流行而陷入停滞的马戏团业务。\n该公司表示，将裁员近3500名自3月份以来一直被暂时解雇的员工，剩下213人的核心团队。该公司正寻求重组业务，并在政府支持和减少债务的情况下重新崛起。\n..。", "note_en": "TORONTO—Cirque du Soleil Entertainment Group filed for bankruptcy protection in Canada on Monday, in an effort to salvage a circus business that’s ground to a halt because of the coronavirus pandemic.\n  The company said it would lay off almost 3,500 employees who have been furloughed since March, leaving it with a core team of 213 people. The company is seeking to restructure its business and re-emerge with government support and less debt.\n...", "posttime": "2020-07-01 13:18:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "马戏团,du", "title": "太阳马戏团申请破产保护的文件", "title_en": "Cirque Du Soleil Files for Bankruptcy Protection", "transed": 1, "url": "https://www.wsj.com/articles/cirque-du-soleil-files-for-bankruptcy-protection-in-canada-11593455498", "via": "", "real_tags": ["马戏团", "du"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1009222, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在是我们关闭CodeFund的时候了。和其他许多人一样，我们无法在经济低迷时期幸存下来。\n我们想向我们所有令人惊叹的出版商和敬业的广告商表达我们的感激之情。在一个小项目上冒险是一个艰难的决定，特别是在有其他更成熟的替代方案的情况下。我们要感谢金币和Consensys给我们一个机会，并为我们提供了一条成功的跑道。\n当我们在2017年创办CodeFund(当时的Code赞助商)时，我们的目标是为开源项目创造一条产生资金的道德道路。从那时起，我们已经向世界各地的开发者、博客作者和应用程序开发者支付了超过67万美元。在整个旅程中建立的关系不仅仅是商业关系，而且将远远超出CodeFund的范畴。\n在露天工作是一次令人难以置信的有益经历。我们很自豪能围绕它构建最大的开源Rubyon rails项目之一，并希望社区能从我们在CodeFund创建的工具和技术中发现一些价值。我们队可供租用。请给我们留言，探讨我们可以帮助贵公司的方式。", "note_en": "The time has come for us to shut down CodeFund. As many others, we were unable to survive the economicdownturn.\n We want to express our gratitude to all of our amazing publishers and dedicated advertisers. It’s a harddecision to take a risk with a small project, especially when there are other more establishedalternatives. We want to thank  Gitcoin and ConsenSys for taking a chance on us andproviding a runway for success.\n When we started CodeFund (then Code Sponsor) back in 2017, our goal was to create an ethical path for opensource projects to generate funds. Since then, we have paid out over $670,000 to developers, bloggers andapp builders all over the world. The relationships forged throughout this journey are more than businessrelationships and will live well beyond CodeFund.\n Working in the open has been an incredibly rewarding experience. We’re proud to have built one of the  largest open source Rubyon Rails projects around and hope the community found some value in the tools and techniques wecreated at CodeFund.   Our team is  availablefor hire. Drop us a note to explore ways we can help your company.", "posttime": "2020-07-01 12:27:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "codefund", "title": "CodeFund正在关闭", "title_en": "CodeFund Is Shutting Down", "transed": 1, "url": "https://codefund.io", "via": "", "real_tags": ["codefund"]}, {"category": "", "categoryclass": "", "imagename": "b3d6406ea5b4ea77658eb58ee271cdfa.jpg", "infoid": 1009221, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你能缩小到足够小，可以像螺旋楼梯一样沿着地球上任何动物、植物、真菌、细菌或病毒的基因螺旋下降，你就会发现自己总是向右转--而不是向左转。这是一个普遍的特点，需要一个解释。\n化学家和生物学家认为没有明显的理由说明为什么所有已知的生命都喜欢这种结构。“手性”分子以成对的形式存在，就像右手手套和左手手套相匹配一样。基本上，所有已知的化学反应甚至都会产生两者的混合物。原则上，由左撇子核苷酸砖制成的DNA或RNA链应该和由右撇子砖制成的一样好(尽管结合左右亚基的嵌合体可能不会那么好)。\n然而，今天的生活只使用了化学公司提供的两套乐高积木中的一套。许多研究人员认为选择是随机的：那些右撇子遗传链只是碰巧最先出现，或者数量稍多。但一个多世纪以来，一些人一直在思考生物学与生俱来的利手性是否有更深层次的根源。\n“这是地球上的生命和宇宙之间的联系之一，”路易斯·巴斯德(Louis Pasteur)在1860年写道，他是最早认识到生命分子中不对称的科学家之一。\n现在，两位物理学家可能已经通过将自然DNA的一成不变的扭曲与基本粒子的行为联系起来，验证了巴斯德的本能。这一理论发表在5月份的“天体物理杂志快报”上，并没有解释生命如何获得现在的惯用手的每一步，但它确实断言，陆地DNA和RNA的形状并不是偶然的。我们的螺旋线可能都可以追溯到宇宙射线意想不到的影响。\n哈佛大学天文学家、该校生命起源倡议主任迪米塔尔·萨塞洛夫(Dimitar Sasselov)说，这项工作“指出了一种我们没有考虑过的新的手性试剂”，他没有参与这项研究。“看起来非常不错.”\n宇宙射线是来自深空的子弹，原子弹片不断地落在我们的头上。这些猛烈的天体是纽约大学高能天体物理学家诺埃米·格洛布斯(Noémie Globus)和熨斗研究所(Flatiron Institute)计算天体物理中心的长期猎物。(“广达杂志”是一份编辑独立的出版物，由西蒙斯基金会(Simons Foundation)赞助，该基金会也为熨斗研究所(Flatiron Institute)提供资金。)。但格洛布斯直到2018年才过多地考虑宇宙射线可能会如何影响生命，当时她是卡夫利粒子天体物理和宇宙学研究所的访问学者，在那里她遇到了同为天体物理学家的斯坦福大学研究所前所长罗杰·布兰德福(Roger Blandford)。\n他们开始于这样一个事实，即宇宙射线阵雨，就像DNA链一样，都有惯用手。物理事件通常向右打破的频率与它们向左打破的频率一样高，但被称为介子的宇宙射线粒子利用了自然界罕见的例外之一。当介子衰变时，这个过程受弱力的支配，弱力是已知镜像不对称的唯一基本力。撞向大气层的介子会产生粒子阵雨，其中包括电子及其较重的兄弟姐妹µ子，所有这些粒子都配备了相对于其路径具有相同手性磁取向的弱力。Globus说，这些粒子在穿过大气层时会反弹，但总的来说，当它们撞击地面时，它们往往会保持自己喜欢的手性。\n研究人员推测，地球上最早的有机体可能只有两个品种，它们可能只是一根赤裸的遗传物质理发杆。一些人的DNA或RNA链像我们的一样卷曲，她和布兰德福德将其称为“活的”分子(手性命名惯例因场而异)，而另一些人的DNA或RNA链与我们的相反，即“邪恶”的生命。通过一系列玩具模型，研究人员计算出，偏向的宇宙射线粒子比起理论上会导致突变的“邪恶”螺旋，更有可能将电子从“活的”螺旋中击散。\n其影响将是微小的：根据事件的能量，可能需要数百万次(如果不是数十亿次)宇宙射线撞击，才能在一条“活的”链中额外产生一个自由电子。但是，如果这些电子改变了有机体遗传密码中的字母，那么这些微调可能会加起来。格洛布斯认为，在大约一百万年的时间里，宇宙射线可能加速了我们最早的祖先的进化，让他们在竞争中击败了他们的“邪恶”对手。“如果你没有突变，你就不会进化，”她说。\n研究人员的下一项任务是看看真实粒子的左旋手是否真的能导致他们模型中看到的快速突变。在他们发表了他们的研究之后，Globus向加州大学圣克鲁斯分校的生物学家和工程师David Deamer寻求帮助。她的想法给他留下了深刻的印象，他提出了他能想到的最简单的生物测试：一种被称为Ames测试的现成测试，将细菌菌落暴露在一种化学物质中，以找出这种物质是否会导致突变。但研究人员计划用手性电子束或µ子束来烘烤微生物，而不是评估一种化学物质。\n粒子的左旋性真的可以使微生物变异的证据将强化他们的观点，即宇宙射线将我们的祖先推下了进化的起点，但这仍然不能完全解释地球上生命的均匀手性。例如，该理论没有解决“活的”有机体和“邪恶的”有机体是如何从包含右手和左手积木的原始奶昔中实现的。\n“这是非常困难的一步，”NASA戈达德太空飞行中心(NASA Goddard Space Flight Center)资深天体生物学家、西蒙斯生命起源合作项目(Simons Collaboration On The Origins Of Life)的研究员杰森·德沃金(Jason Dworkin)说，“但如果这个[理论]能提供一种不同的机制，另一种达尔文式的压力，那就很有趣了。”\n甚至在基因进化进入画面之前，另一个未知的过程似乎就阻碍了“邪恶”的生命。形成蛋白质的简单氨基酸分子也存在于生命喜欢的“活”构型和不喜欢的“邪恶”构型中(尽管“活”氨基酸的首选手性几乎完全是左撇子)。德沃金和其他人对陨石的仔细分析发现，某些“活的”氨基酸比“邪恶的”氨基酸多出20%或更多，这一过剩可能是他们传递给地球的。多余的分子可能是数十亿年来暴露在圆偏振光下的幸运幸存者，圆偏振光是一组沿着同一方向螺旋运动的光束，实验表明，这种光束可以比另一种稍微彻底地破坏一种氨基酸。\n但是，像宇宙射线一样，光束也有边际效应。需要无数的互动才能留下明显的不平衡，所以其他一些力量可能也在起作用。德沃金说，光必须粉碎难以承受的大量分子，才能解释这种过度行为。\n萨塞洛夫鼓励Globus和Blandford考虑宇宙射线是否可能与偏振光联合起来塑造小行星上的氨基酸。他推测，在地球上，产生明显手性差异所需的宇宙射线剂量-他将其比作超音速子弹-可能被证明过于致命。“你破坏了太多的东西，”他说。“你可能用的是[正确的]左撇子，但从本质上说，你是在自食其果。”\n归根结底，研究人员努力寻找一种理论来平衡手性的增加和生物材料的破坏，这一事实表明，我们的祖先可能很幸运地找到了这条微妙的界限。\n萨塞洛夫说：“像地球这样的行星有一些特殊之处，可以保护这种化学物质。”", "note_en": "If you could shrink small enough to descend the genetic helix of any animal, plant, fungus, bacterium or virus on Earth as though it were a spiral staircase, you would always find yourself turning right — never left. It’s a universal trait in want of an explanation.\n Chemists and biologists see no obvious reason why all known life prefers this structure. “Chiral” molecules exist in paired forms that mirror each other the way a right-handed glove matches a left-handed one. Essentially all known chemical reactions produce even mixtures of both. In principle, a DNA or RNA strand made from left-handed nucleotide bricks should work just as well as one made of right-handed bricks (although a chimera combining left and right subunits probably wouldn’t fare so well).\n Yet life today uses just one of chemistry’s two available Lego sets. Many researchers believe the selection to be random: Those right-handed genetic strands just happened to pop up first, or in slightly greater numbers. But for more than a century, some have pondered whether biology’s innate handedness has deeper roots.\n “This is one of the links between life on Earth and the cosmos,”  wrote Louis Pasteur, one of the first scientists to recognize the asymmetry in life’s molecules, in 1860.\n  Now two physicists may have validated Pasteur’s instincts by connecting the unvarying twist in natural DNA with the behavior of fundamental particles. The theory, which  appeared in May in  The Astrophysical Journal Letters, doesn’t explain every step of how life acquired its current handedness, but it does assert that the shape of terrestrial DNA and RNA is no accident. Our spirals might all trace back to an unexpected influence from cosmic rays.\n This work “points out a new chiral agent which we were not considering,” said  Dimitar Sasselov, an astronomer at Harvard University and the director of the school’s Origins of Life Initiative, who was not involved in the research. “It seems to be very good.”\n Cosmic rays are bullets from deep space, atomic shrapnel raining down constantly on our heads. These violent objects are the long-time quarry of  Noémie Globus, a high energy astrophysicist at New York University and the Center for Computational Astrophysics at the Flatiron Institute. ( Quanta Magazine is an editorially independent publication sponsored by the Simons Foundation, which also funds the Flatiron Institute.) But Globus didn’t think much about how cosmic rays might affect life until 2018 when she was a visiting scholar at the Kavli Institute for Particle Astrophysics and Cosmology, where she met  Roger Blandford, a fellow astrophysicist and the Stanford University institute’s former director.\n They started from the fact that cosmic ray showers, like DNA strands, have handedness. Physical events typically break right as often as they break left, but cosmic ray particles called pions tap into one of nature’s rare exceptions. When pions decay, the process is governed by the weak force — the only fundamental force with a known mirror asymmetry. Pions slamming into the atmosphere produce showers of particles including electrons and their heavier siblings, muons, all of which are equipped by the weak force with the same chiral magnetic orientation relative to their path. The particles bounce around as they streak through the atmosphere, Globus said, but overall they tend to keep their preferred chirality when they slam into the ground.\n Earth’s first organisms — which were perhaps little more than naked barber poles of genetic material — likely came in two varieties, the researchers assumed. Some had DNA or RNA strands that curled like ours, which she and Blandford dubbed “live” molecules (chiral naming conventions differ by field), and others had mirror-reversed strands — “evil” life. With a series of toy models, the researchers calculated that the biased cosmic ray particles were ever-so-slightly more likely to knock an electron loose from a “live” helix than from an “evil” one, an event that theoretically causes mutations.\n The effect would be tiny: Millions if not billions of cosmic ray strikes could be required to yield one additional free electron in a “live” strand, depending on the event’s energy. But if those electrons changed letters in the organisms’ genetic codes, those tweaks may have added up. Over perhaps a million years, Globus suggests, cosmic rays might have accelerated the evolution of our earliest ancestors, letting them out-compete their “evil” rivals. “If you don’t have mutations, you don’t evolve,” she said.\n  The researchers’ next task is to see if the handedness of real particles can actually cause the speedy mutation seen in their model. After they published their research, Globus approached  David Deamer, a biologist and engineer at the University of California, Santa Cruz, for help. Impressed by her ideas, he suggested the simplest biological test he could think of: an off-the-shelf assay known as the Ames test that exposes a bacterial colony to a chemical to find out if the substance causes mutations. But instead of evaluating a chemical, the researchers plan to roast the microbes with beams of chiral electrons or muons.\n Proof that the handedness of particles really can mutate microbes would strengthen their case that cosmic rays shoved our ancestors off the evolutionary starting block, but it still wouldn’t fully explain the uniform chirality of life on Earth. The theory doesn’t address, for example, how “live” organisms and “evil” organisms managed to materialize from a primordial smoothie containing both right- and left-handed building blocks.\n “That is a very hard step,” said  Jason Dworkin, a senior astrobiologist at the NASA Goddard Space Flight Center and an investigator with the  Simons Collaboration on the Origins of Life, “but if this [theory] can provide a different mechanism, another Darwinian pressure, that’d be interesting.”\n Even before genetic evolution enters the picture, another unknown process seems to handicap “evil” life. The simple amino acid molecules that form proteins also exist in “live” configurations favored by life and “evil” configurations that are not (although the preferred chirality for “live” amino acids is almost exclusively left-handed). Careful analysis of meteorites by Dworkin and others has found that certain “live” amino acids outnumber “evil” ones  by 20% or more, a surplus they may have passed on to Earth. The excess molecules could be the lucky survivors of billions of years of exposure to circularly polarized light, a collection of beams all spiraling in the same direction that,  experiments have shown, can destroy one type of amino acid slightly more thoroughly than the other.\n But, like the cosmic rays, the beams of light have a marginal effect. Countless interactions would be needed to leave behind a noticeable imbalance, so some other force may be at work as well. Light would have to pulverize untenably huge quantities of molecules to explain the excesses on its own, Dworkin says.\n  Sasselov has encouraged Globus and Blandford to consider whether cosmic rays might join forces with polarized light to shape the amino acids on asteroids. On Earth, the doses of cosmic rays — which he likens to supersonic bullets — that would be needed to make a noticeable chiral difference might prove too lethal, he speculated. “You’re destroying so much of everything,” he said. “You may be left with the [correct] handedness, but essentially you’re shooting yourself in the foot.”\n Ultimately, the fact that researchers struggle to find a theory that balances the rise of chirality against the destruction of biological materials suggests that our ancestors may have been lucky to find that fine line.\n “There is something special about planets like the Earth that protect this kind of chemistry,” Sasselov said.", "posttime": "2020-07-01 12:01:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可能,rays", "title": "宇宙射线可能解释生命对右手DNA的偏爱", "title_en": "Cosmic Rays May Explain Life’s Bias for Right-Handed DNA", "transed": 1, "url": "https://www.quantamagazine.org/cosmic-rays-may-explain-lifes-bias-for-right-handed-dna-20200629/", "via": "", "real_tags": ["可能", "rays"]}, {"category": "", "categoryclass": "", "imagename": "ccde8595c2ccf27d59d7a13431dffb7a.jpeg", "infoid": 1009218, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加利福尼亚州奥克兰。(路透社)-加州监管机构周二起诉思科系统公司(Cisco Systems Inc)，指控其歧视一名印裔美国员工，并允许他受到两名经理的骚扰，因为他来自比他们更低的印度种姓。\n美国劳动法没有明确禁止基于种姓的歧视，但加州公平就业和住房部在诉讼中辩称，印度教信仰挥之不去的种姓制度是基于宗教等受保护的阶层。\n这起诉讼是在圣何塞的联邦法院提起的，没有提到所谓的受害者的名字。声明称，自2015年10月以来，他一直是思科圣何塞总部的首席工程师，他出生在种姓等级的最底层，是一度被称为“贱民”的达利特人。\n与硅谷的其他大型雇主一样，思科的员工包括数以千计的印度移民，他们中的大多数出生于婆罗门或其他高种姓。\n前思科工程经理桑达尔·伊耶(Sundar Iyer)和拉马纳·孔佩拉(Ramana Kompella)也是这起诉讼的被告，诉讼指控他们在内部实施种姓等级制度的骚扰。\n思科发言人罗宾·布鲁姆(Robyn Blum)表示，这家网络设备制造商遵循其程序调查了员工在此案中的担忧，并将在诉讼中“积极为自己辩护”。\n她说：“思科致力于为所有人创造一个包容性的工作场所。”“我们完全遵守所有法律，也完全遵守我们自己的政策。”\nIyer和Kompella没有立即回复记者的置评请求。目前还不清楚这两人是否聘请了律师。\n民权组织平等实验室在诉讼中引用的2018年报告中发现，67%的受访达利特人觉得自己在美国的工作场所受到了不公平对待。\n在思科，这位未透露姓名的员工于2016年11月向人力资源部门举报了伊耶，因为他向同事揭露了他是达利特人。起诉书称，Iyer据称进行了报复，但思科认定种姓歧视并不违法，问题一直持续到2018年。\n诉讼称，思科重新分配并隔离了这名员工，拒绝了本会导致一次晋升的加薪和机会，并拒绝了两次晋升。\n印度教徒传统上根据血统将人分成四个主要种姓，在印度禁止基于种姓的歧视65年后，印度的达利特人仍然在为获得教育和工作机会而苦苦挣扎。", "note_en": "OAKLAND, Calif. (Reuters) - California regulators sued Cisco Systems Inc (  CSCO.O) on Tuesday, accusing it of discriminating against an Indian-American employee and allowing him to be harassed by two managers because he was from a lower Indian caste than them.\n  U.S. employment law does not specifically bar caste-based discrimination, but California’s Department of Fair Employment and Housing contends in the lawsuit that the Hindu faith’s lingering caste system is based on protected classes such as religion.\n The lawsuit, filed in federal court in San Jose, does not name the alleged victim. It states he has been a principal engineer at Cisco’s San Jose headquarters since October 2015 and that he was born at the bottom of caste hierarchy as a Dalit, once called “untouchables.”\n Like other large Silicon Valley employers, Cisco’s workforce includes thousands of Indian immigrants, most of whom were born Brahmins or other high castes.\n Former Cisco engineering managers Sundar Iyer and Ramana Kompella also are defendants in the lawsuit, which accuses them of harassment for internally enforcing the caste hierarchy.\n Cisco spokeswoman Robyn Blum said the network gear maker followed its process to investigate employee concerns in this case and would “vigorously defend itself” against the lawsuit.\n “Cisco is committed to an inclusive workplace for all,” she said. “We were fully in compliance with all laws as well as our own policies.”\n Iyer and Kompella did not immediately respond to requests for comment. It was not immediately known if the two have retained attorneys.\n The civil rights group Equality Labs in a 2018 report cited in the lawsuit found that 67% of Dalits surveyed felt treated unfairly at their U.S. workplaces.\n At Cisco, the unnamed employee reported Iyer to human resources in November 2016 for outing him as a Dalit to colleagues. Iyer allegedly retaliated, but Cisco determined caste discrimination was not illegal and issues continued through 2018, the lawsuit states.\n Cisco reassigned and isolated the employee, rejected a raise and opportunities that would have led to one and denied two promotions, according to the lawsuit.\n Hindus traditionally grouped people into four major castes based on ancestry, and Dalits in India still struggle with access to education and jobs 65 years after India banned caste-based discrimination.", "posttime": "2020-07-01 11:09:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "指责,accuses,思科", "title": "加州指责思科基于印度员工种姓的工作歧视", "title_en": "California accuses Cisco of job discrimination based on Indian employee's caste", "transed": 1, "url": "https://www.reuters.com/article/us-cisco-lawsuit/california-accuses-cisco-of-job-discrimination-based-on-indian-employees-caste-idUSKBN2423YE", "via": "", "real_tags": ["指责", "accuses", "思科"]}, {"category": "", "categoryclass": "", "imagename": "024364e2a008d317dd3c3b0dcafe3762.jpg", "infoid": 1009217, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "不和谐周二宣布，它正在进行一系列改变，以将其服务扩展到游戏社区以外。该公司表示，这一改变是它的用户要求的，因为不和谐已经更多地成为一种“日常沟通”的工具。\nDiscord首席执行官Jason Citron和CTO Stanislav Vishnevski在一篇博客中写道：“游戏把你们中的许多人带到了这个平台上，我们永远会对此心存感激。”“随着时间的流逝，你们中的许多人意识到，你们只是想要一个在自己的社区和朋友中舒适地闲逛和交谈的地方。你想要一个地方进行真诚的对话，并与人们共度优质时光，无论是叙旧、学习还是分享想法。\n该公司已经推出了一个重新设计的网站，标语是“你可以说话的地方”(Your Place To Talk)。新网站将不和谐描述为适合学校俱乐部、游戏团体、艺术社区或仅仅是朋友团体。\nDiscorde概述了它计划采取的一系列行动，以使其平台对非游戏用户更加友好。这些措施包括改善“新用户入职体验”，增加语音和视频聊天的能力，以及继续投资于“可靠性和性能作为我们的首要任务”。不和谐说，它使得界面的内置笑话和引用不那么针对游戏。该公司还创建了一个“不和谐安全中心”，为家长和教师总结其数据实践、规则、安全提示和解释。\n“不和谐”的受众持续增长，特别是在冠状病毒大流行增加了对语音和视频聊天服务的需求的情况下。该公司主要与Slake等工作场所聊天应用程序竞争，该公司宣布，目前月度活跃用户超过1亿，每天花在对话上的时间超过40亿分钟。Discord还获得了1亿美元的额外资金，该公司表示，这将“有助于加快我们对社区、新功能和公司的投资”。\n近几个月来，“不和谐”还做出了其他努力，以接触到更广泛的受众。6月19日，该公司在其平台上宣布了一系列打击仇恨言论的举措。这些措施包括发誓要审计其用户传播种族主义的方式；开发新的软件来管理虐待行为；使其员工多样化；为专注于种族正义的组织做出贡献；以及为社区组织者和活动人士提供定制服务。\n不和谐最近也更加重视其语音聊天平台。该公司在4月份表示，自2020年初以来，美国语音用户增长了50%。该公司在测试版中引入了噪音抑制功能，作为与Krisp.ai合作的一部分，该功能可以检测并消除背景噪音，以便更清晰地听到声音-微软上个月也为团队宣布了这一功能。\n今年3月，不和谐将可以同时观看直播的用户数量从10人增加到50人，这也是因为新冠肺炎的流行病，以及随之而来的直播和视频聊天的激增。Citron指出，这一功能将对远程授课的教师或同事协作很有用。“不和谐”在一条推文中表示，它将在“最迫切需要的时候”保持更高的上限。", "note_en": "Discord on Tuesday announced it’s making a number of changes to expand its service beyond the gaming community. The company  says the change is one its users have requested as Discord has become more of a tool for “day-to-day communication.”\n “Games are what brought many of you on the platform, and we’ll always be grateful for that,” reads a blog post by Discord CEO Jason Citron and CTO Stanislav Vishnevskiy. “As time passed, a lot of you realized, and vocalized, that you simply wanted a place designed to hang out and talk in the comfort of your own communities and friends. You wanted a place to have genuine conversations and spend quality time with people, whether catching up, learning something, or sharing ideas.”\n  The company has launched a redesigned  website with the tagline “Your place to talk.” The new site describes Discord as appropriate for school clubs, gaming groups, art communities, or just groups of friends.\n Discord outlined a number of actions it plans to take to make its platform friendlier to non-gaming users. They include improving “the new user onboarding experience,” increasing capacity for voice and video chat, and continuing to invest in “reliability and performance as our top priority.” Discord says it made the interface’s built-in jokes and references less specific to gaming. And the company has created a  “Discord Safety Center” that summarizes its data practices, rules, safety tips, and explanations for parents and teachers.\n Discord’s audience continues to grow, especially as the coronavirus pandemic has increased demand for voice and video chat services. The company, which competes primarily with workplace chat apps like Slack, announced it now has more than 100 million monthly active users who spend 4 billion minutes in conversation each day. Discord has also secured an additional $100 million in funding, which it says will “help accelerate our investment in the community, new features, and the company.”\n Discord has made other efforts to reach a broader audience in recent months. On  Juneteenth, the company announced a set of initiatives to combat hate speech on its platform. Those include vowing to audit the ways its users spread racism; developing new software to manage abuse; diversifying its staff; contributing to organizations focused on racial justice; and offering customized services to community organizers and activists.\n  Discord has also placed a heavier emphasis on its voice chat platform of late. The company said in  April that it had seen 50 percent growth in voice users in the US since the beginning of 2020. The company introduced a noise-suppression feature in beta as part of a partnership with Krisp.ai that detects and removes background noise so voices can be heard more clearly — a function that Microsoft also announced for Teams last month.\n In March, Discord upped the number of users who can simultaneously view a live stream from 10 to 50, also citing the COVID-19 pandemic and the accompanying surge in live streaming and video chatting. Citron noted that the feature would be useful for teachers conducting classes remotely or co-workers collaborating. Discord stated in a tweet that it would maintain the higher limit “while it’s most critically needed.”", "posttime": "2020-07-01 11:09:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "估值,discord", "title": "不和谐以35亿美元估值筹集1亿美元", "title_en": "Discord raises $100M at $3.5B valuation", "transed": 1, "url": "https://www.theverge.com/2020/6/30/21308194/discord-gaming-users-safety-center-video-voice-chat", "via": "", "real_tags": ["估值", "discord"]}, {"category": "", "categoryclass": "", "imagename": "ed473defc8c65c73e82fc3ee418156ef.png", "infoid": 1009216, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "想象一下：您有一个大型的多模块ClojureScript项目，并且您计划在生产中进行新的部署，您的项目使用的是CLJS编译器的高级优化模式，一切似乎都很顺利。在发布之前，您正在执行一些最后的E2E测试。然后，加载有故障的模块。砰！您会被打耳光，并出现类似如下的错误：\n未捕获错误：没有协议方法IMultiFn.-Add-为类型函数定义的方法：函数xr(){[本机代码]}位于Nb((INDEX)：964)，位于Yh((INDEX)：443at(INDEX)：236(INDEX)：143)。未捕获类型错误：无法读取位于Nu((INDEX)：143)处未定义的、位于Nu((INDEX)：143)的属性&#39；j&#39；login-a5a67c0fffdfa158b7220c8c2553253b645e4e2e.js:169。\n你没料到会这样。自上一次构建以来没有重大的新变化，单元测试也都是完美无缺的。此外，在使用Firefox时一切正常，但现在编译后的代码在Google Chrome上崩溃了。怎么一回事？发布的最后期限迫在眉睫，你必须尽快解决这个问题。\n当您使用CLJS编译器构建代码时，它会发出与Google闭包编译器的ADVANCED_OPTIMIZATIONS级别兼容的JavaScript代码。然后，如果启用了&#34；：Optimations：Advanced&#34；编译器选项，CLJS编译器将使用Close Compiler的高级优化缩小结果。\n闭包编译器的高级优化模式可能会在您的构建中导致一些错误，如果您是Closure编译器的新手，跟踪这些错误可能会很不舒服。最重要的是，如果您试图搜索带有错误消息的Web，可能很难找到帮助，因为函数名称都已损坏。\n最好从项目开始时就牢记高级编译模式来避免这些错误。我将描述一些帮助您避免和解决高级编译问题的常用方法，并展示如何解决开头描述的更不常见的问题及其背后的原因。\n建议对您的生产构建使用&#34；：优化：高级CLJS编译器选项。通过使用更积极的高级转换(如删除死代码和积极重命名)，您将极大地减小最终的构建大小。在此处阅读有关高级转换的更多信息：闭包编译器编译级别。\n不同的构建工具(如lein-cljsbuild和dow-cljs)可能会将不同的默认选项传递给Close Compiler。我不会在这篇博客文章中讨论这些不同之处，但我会提供一些关于如何避免在项目中使用高级编译的一般指导原则。\nextern是一种声明不应该被闭包编译器忽略(重命名)的名称的机制。当您使用外部库时，如果您使用的是lein-cljsbuild这样的构建工具，请确保它们与externs捆绑在一起。或者，如果需要，提供您自己的externs文件。否则，闭包编译器将在高级编译期间无意中忽略对外部定义符号的引用，从而导致只有在稍后运行编译代码时才会发现错误。\n要添加您自己的externs，请使用编译器选项，例如：&#34；：externs[&#34；exters.js&#34；]&#34；并在您的工作目录中提供一个exters.js文件。\n此外，使用&#34；：infer-externs true&#34；编译器选项也很好。此选项将启用为JavaScript互操作调用自动生成外部变量。\n值得一提的是，闭包编译器包含稳定JavaScriptAPI外部变量，但可能还没有包含处于试验状态的新特性。实验API变化非常快，因此将它们包含在闭包编译器工具中是没有意义的。因此，如果您计划使用一些实验特性，请确保将它们添加到您自己的externs文件中。\n如果要将CLJS代码拆分为：模块，则可能需要使用：rename-prefix&#34；.&#34；编译器选项。拆分模块在全局JavaScript作用域中运行，因此它们可能会干扰同一页上加载的其他代码(例如Google Analytics)，并在发生名称冲突时导致不可预测的错误。使用&#34；：rename-prefix&#34；时，最好使用非常短的字符串作为前缀，例如：：rename-prefix&#34；r_&#34；\n这将略微增加最终(Gzided)构建大小，因为现在每个被忽略的全局变量都将以“r_”为前缀。\n在高级编译过程中，闭包编译器将生成大量全局变量，这些变量可能会导致与同一页上运行的其他代码发生名称冲突。如果您在同一页上加载其他代码，并且没有将代码拆分成多个模块，则可以使用&#34；：output-wrapper true&#34；编译器选项。编译器将使用默认值&#34；(Function(){…}包装输出的JavaScript代码。​}；)()&#34；。这将防止污染全局JavaScript作用域，从而防止与其他外部代码发生冲突。\n但是，如果项目中有多个模块，则必须添加编译器选项：Rename-Prefix-Namespace&#34；.&#34；。这使每个模块都可以访问它所依赖的其他模块中定义的变量。这与&#34；：Rename-Prefix&#34；选项的工作方式类似。不同之处在于，现在每个全局变量的作用域都是一个全局变量，而不是多个全局变量。例如，如果使用这样的前缀命名空间：：rename-prefix-nampace&#34；P&#34；，编译后的代码将引用变量&#34；foo&#34；like&#34；p.foo&#34；。此选项还会像&#34；：rename-prefix&#34；选项一样增加最终的构建大小，因此在使用它之前请三思。\n还有其他与高级优化没有直接关系的有趣编译器选项，例如&#34；：fn-Invoke-direct&#34；，它们对于优化性能关键型代码很有用。您可以在CLJS文档中阅读有关它们的更多信息。\n如果您怀疑高级编译可能有问题，浏览器控制台中可能没有意义的错误通常会提示您，最好通过以下方式解决问题。\n为您的高级编译构建添加两个额外的编译器选项&#34；：伪名称true&#34；和&#34；：Pretty-print true&#34；。您的错误现在将显示与源代码中的名称相对应的可读名称。这将帮助您推断是否缺少外部定义。\n此外，如果在启用上述编译器选项后错误消失，它会提示您可能存在名称冲突问题。如果强制变量名与外部变量名冲突出现问题，则当强制变量名更改时，该问题就会消失，就像启用：Pseudo-Names选项时发生的情况一样。通常，如果没有正确修复，名称冲突问题可能会出现，然后在添加新更改时神奇地“修复”，这反过来会导致构建输出中的参数变量名称发生更改。最好是彻底消除这些问题。\n在极少数情况下，可能有一些高级编译问题不是那么容易避免的。让我们回到开头。在Chrome中运行我们构建的Web应用程序时出现错误。火狐没有任何问题。\n未捕获错误：没有为类型函数定义协议方法IMultiFn.-add-method：函数xr(){[本机代码]}，位于Nb((Index)：964)，位于yh((Index)：443)，位于(Index)：236。\n堆栈跟踪指向CLJS源代码中的某个多方法。乍一看，这个错误可能毫无意义。编译后的代码正在尝试为名为xr的函数调用-add-method IMultiFn协议方法。在构建输出中搜索强制的XR时，一切似乎都很正常。XR看起来不错，应该可以工作，对吧？错误消息中需要注意的关键一点是&#34；[本机代码]&#34；部分&#34；函数xr(){[本机代码]}&#34；。这告诉我们，编译后的代码正在尝试调用本机浏览器函数xr，而不是我们的参数xr。一次偶然的机会，闭包编译器将我们的Multimethod命名为XR，这恰好与浏览器提供的XR函数冲突。\n在使用较旧版本的闭包编译器时，偶尔会遇到这样的错误。开发人员一直在向Web浏览器添加新功能。当用户升级他/她的网络浏览器时，有可能添加了新的保留字，该保留字与被忽略的变量冲突。\n原来，xr是WebXR平台API添加的保留字。当错误发生时，“xr”被添加到最新版本的Google Chrome中，但还没有添加到Firefox中。较新的闭包编译器版本通过为其提供外部元素来考虑到这一点。升级ClojureScript版本以及项目中使用的闭包编译器并不总是很容易。在这种情况下，您可以通过添加自己的自定义外部来快速解决问题：\n很多时候，如果准备得当，CLJS的高级编译问题很容易避免。在极少数情况下，可能会发生一些奇怪的错误。因此，使用当前浏览器版本测试您的构建，并学习快速调试高级编译问题，以避免浪费宝贵的时间。", "note_en": "Imagine this: You have a large multi-module ClojureScript project, and you are planning to make a new deployment in theproduction.Your project is using CLJS Compiler’s Advanced Optimizations mode.Everything seems to be working smoothly. You are performing some last E2E tests before making a release. Then, a faulty module loads.  BAM! You are slapped in the face with an error something like this:\n Uncaught Error: No protocol method IMultiFn.-add-method defined for type function: function XR() { [native code] } at Nb ((index):964) at yh ((index):443) at (index):236(index):143 Uncaught TypeError: Cannot read property &#39;j&#39; of undefined at NU ((index):143) at login-a5a67c0fffdfa158b7220c8c2553253b645e4e2e.js:169\n You did not expect this. There were no significant new changes since the last build, and the unit tests were allhunky-dory. Additionally, everything worked fine when using Firefox, but now the compiled code crashes on Google Chrome. What is going on? The release deadline is looming and you have to fix this ASAP.\n  When you build your code with the CLJS compiler, it emits JavaScript code that is compatible with the advanced_optimizations level of the Google Closure compiler. Then, if  &#34;:optimizations :advanced&#34; compiler option isenabled, the CLJS compiler will minify the result with Closure Compiler’s Advanced Optimizations.\n Closure Compiler’s Advanced Optimizations mode can cause some errors in your build that can be uncomfortable totrack down if you are new to Closure Compiler.On top of that, help might be hard to find if you are trying to search the web with the error message because the functionnames are all mangled up.\n It is better to avoid these errors by keeping the Advanced Compilation mode in mind from the start of the project. I’ll describe some common methods to help you to avoid and resolve advanced compilation issues, and show how to resolve the more uncommon issue that was described in the beginning and what is the reason behind it.\n  It is recommended to use  &#34;:optimizations :advanced&#34; CLJS compiler option for your production builds.You will greatly reduce your final build size by using more aggressive advanced transformations such as dead code removal and aggressive renaming. Read more about the advanced transformations at here:  Closure Compiler compilation levels\n Different build tools such as lein-cljsbuild and shadow-cljs might pass different default options to Closure Compiler.I won’t cover the differences in this blog post, but instead, I will provide some general guidelines on how to avoidissues with advanced compilation in your project.\n  Extern is a mechanism for declaring names that should not be munged (renamed) by Closure Compiler.When you are using external libraries, make sure that they come  bundledwith externs if you are using a build tool like lein-cljsbuild. Or, provide externs files of your own if needed. Otherwise, Closure Compiler will munge references to externally defined symbols unintentionally during advanced compilation causing errors found only later when running the compiled code.\n To add externs of your own, use a compiler option for example:  &#34;:externs [&#34;externs.js&#34;]&#34; and provide anexterns.js file in your working directory.\n Also, It is good to use  &#34;:infer-externs true&#34; compiler option. This option will enable generating externs automaticallyfor JavaScript interop calls.\n It is worth to know, that Closure Compiler includes externs for stable JavaScript APIs, but newer features that have anexperimental status might not be included yet. The experimental APIs change very quickly, so it makes no sense to includethem in the Closure Compiler tool. So, if you are planning to use some experimental features, make sure you add them to your own externs file.\n   If you are  splitting your CLJS code into  :modules, you might wantto use  :rename-prefix &#34;...&#34; compiler option. Split modules are running in the global JavaScript scope, so they might interfere with other code loaded on the same page (e.g. Google Analytics) and cause unpredictable errors if name collisions occur.When using  &#34;:rename-prefix&#34;, it is best to use a very short string as a prefix, for example:  :rename-prefix &#34;r_&#34;\n This will increase the final (gzipped) build size slightly because now each munged global variable will be prefixed with “r_”.\n  Closure Compiler will generate a lot of global variables during advanced compilation that can cause name collisionswith other code running on the same page.If you are loading other code on the same page, and you are not splitting code into multiple modules you can utilize the  &#34;:output-wrapper true&#34; compiler option. The compiler will wrap the outputted JavaScript code with the default  &#34;(function(){…​};)()&#34;. This will prevent polluting the global JavaScript scope and thus will prevent conflictswith other external code.\n However, if you have multiple modules in your project you must add a compiler option  :rename-prefix-namespace &#34;...&#34;.This enables each module to access the variables defined in the other modules it depends on.This works similarly to the  &#34;:rename-prefix&#34; option. The difference is that every global variable will be nowscoped under one global variable instead of many. For example, if you use a prefix-namespace like this: :rename-prefix-namespace &#34;P&#34;, the compiled code will refer to variable  &#34;foo&#34; like  &#34;p.foo&#34;. This option will also increase the final build size like the  &#34;:rename-prefix&#34; option, so think before using it.\n There are other interesting compiler options not directly related to advanced optimizations, such as  &#34;:fn-invoke-direct&#34; which can be useful for optimizing performance-critical code. You can read more about them in CLJS  documentation.\n  If you suspect you might have a problem with advanced compilation, often hinted by errors in the browser console that might make no sense, it is best to approach the problem in the following way.\n Add two additional compiler options  &#34;:pseudo-names true&#34; and  &#34;:pretty-print true&#34; for your Advanced Compilation build.Your error will now show a readable name that corresponds to the name in the source code. This will help you to deduce if an extern definition is missing.\n Additionally, if your error goes away after enabling the above-mentioned compiler options, it gives you a hintof a possible name collision problem. When there is a problem with a munged variable name colliding with an external variable name, the problem disappears when the munged variable name changes, like what happens when enabling the :pseudo-names option. Often, if not fixed properly, the name collision issues can arise and then be magically “fixed” when one adds new changes, which in turn causes changes in munged variable names in the build output. It is best to eliminate these problems for good.\n  In some rare cases, there might be some advanced compilation issues that are not so easy to avoid.Let’s go back to the beginning. We had an error when running our built web app in Chrome. Firefox had no issues.\n Uncaught Error: No protocol method IMultiFn.-add-method defined for type function: function XR() { [native code] } at Nb ((index):964) at yh ((index):443) at (index):236\n The Stack Trace was pointing to a certain multimethod in the CLJS source code. At the first glance, the error might make no sense. The compiled code is trying to invoke -add-method IMultiFn protocol method for a function named XR. When searching for the munged  XR in the build output, everything seems to be fine. XR looks good and should work, right?The key thing to notice in the error message is the  &#34;[native code]&#34; part of  &#34;function XR() { [native code] }&#34;.This tells us, that the compiled code is trying to invoke a native browser function  XR instead of our munged  XR. By chance, the Closure Compiler named our multimethod to  XR which happens to collide with the browser provided XR function.\n Occasionally you can encounter errors like this when using an older version of Closure Compiler.Developers add new features to web browsers all the time. When a user upgrades his/her web browser there is a chance a new reserved word was added that collides with a munged variable.\n It turns out, XR is a reserved word added by the WebXR platform API. When the error occurred “XR” was added in the newest version of Google Chrome, but not yet in Firefox. Newer Closure Compiler versions take this into account by providingan extern for it. It is not always easy to upgrade the ClojureScript version and thus the Closure Compiler used in a project. In that case, you can fix the problem fast by adding a custom extern of your own:\n   Many times, Advanced Compilation issues with CLJS are easy to avoid with proper preparation. On rare occasions, somestranger errors can happen. Thus, test your builds with the current browser versions and learn to debug advanced compilation issues swiftly to prevent wasting precious time.", "posttime": "2020-07-01 10:42:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编译,clojurescript,advanced,错误", "title": "驯服ClojureScript项目中的高级编译错误", "title_en": "Taming Advanced Compilation bugs in ClojureScript projects", "transed": 1, "url": "https://dev.solita.fi/2020/06/25/taming-cljs-advanced-compilation.html", "via": "", "real_tags": ["编译", "advanced", "错误"]}]