[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1029034, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "以下是乔尔·格林布拉特(Joel Greenblatt)在与巴里·里索尔茨(Barry Ritholtz)合作的商业大师节目中提供的一项。\n如果你买下每一家2019年亏损的市值超过10亿美元的公司，那么它们大约是261家，而你买下了每一家公司，今年到目前为止，你将上涨65%。\n这是一个疯狂的数字，所以我想在这个问题上做更深入的研究。使用YCharts的数据，我研究了罗素3000指数(Russell 3000 Index)2020年的股票回报率，这些股票的市值至少为10亿美元，最新年报的净收入为负值。\n这些亏损公司中几乎五分之一的公司今年涨幅达到100%或更高。这份榜单上有一些涨幅巨大的公司，包括Overstock.com(+1055%)、特斯拉(+429%)、佩洛顿(+348%)和现代(+285%)等公司。\n但这些亏损公司也有大量的大输家。其中超过四分之一的股票今年下跌了10%或更多，而近50只股票在2020年下跌了30%或更多。\n有三种不同的方式来看待大赢家在无利可图的公司中的盛行情况：\n(3)这对一些公司来说是有道理的，但另一些公司将会得到报应。\nStratechery的本·汤普森(Ben Thompson)写了一篇关于最近雪花公司(Snowflake)公开募股的文章，这是有史以来规模最大的软件IPO。尽管上半年亏损近1.8亿美元，但该公司目前的估值接近700亿美元。在你理解为什么雪花现在亏损是有意义的之前，试图平方这个等式在表面上是没有意义的。\n汤普森将SaaS(软件即服务)的商业模式描述为：“与其说你在销售一种产品，不如说你创造的年金的终生价值远远超过了你为购买它们所支付的任何费用。”\n对于这种类型的商业模式，与直觉相反的是，假设他们能够建立这种未来收入的年金流，亏损可能是一件好事。汤普森解释说：\n在Snowflake的业务环境中考虑这一点：数据仓库的整个概念是它几乎包含公司的所有数据，这些数据(1)必须出售给公司的最高层，因为只有当公司中的每个人都贡献他们的数据时，您才能获得全部好处，(2)一旦数据进入数据仓库，将非常困难和昂贵地将其转移到其他地方。这两点都表明，雪花应该在销售和营销上花更多的钱，而不是更少：\n考虑到数据一旦导入，哪里也不会去的事实，数据仓库本身就有很大的生存期价值。\n为此，雪花是一项有吸引力的投资，不仅因为它令人瞠目结舌的增长数字，还因为它令人瞠目结舌的亏损。这正是你希望在一家销售锁定的企业中看到的，雪花的IPO如此巨大的成功也就不足为奇了。\n当你通过这个镜头来看事情的时候，很有可能某些企业在2020年会看到非同寻常的收益，尽管是亏损的。股票或企业的现值来自其贴现的未来现金流。因此，投资者担心的不是当前的现金流，而是现在的支出将如何影响未来的现金流。只关注当前业绩的投资者只见树木不见森林。\n如果其中一些公司对未来的预期达不到预期，其中许多股票的问题就会出现。\n格林布拉特认为，世界上的亚马逊和谷歌不一定会回归地球，但人们押注的是这些公司将成为世界上的下一个亚马逊和谷歌：\n我认为泡沫不在谷歌、亚马逊和-亚马逊。这些都是我们有生以来见过的最好的生意。\n市场上的泡沫出现在我之前谈到的数百家公司中，人们会认为这些公司将与下一个亚马逊、谷歌和微软押韵。不可能有数百家公司这样做。所以我想这就是报应所在。\n你不应该对这么多SaaS公司看到股市大幅上涨感到惊讶，尽管他们的业务出现了巨大的亏损。这就是这些企业的本质，那些坚持使用旧的基本估值框架的人很可能错过了其中许多公司的机会。\n但当投资者将其中许多股票的预期定得过高时，你也不应该感到惊讶。效仿亚马逊、微软、谷歌、苹果和Facebook并非易事。这些都是世界上最大、最好的公司，这是有原因的。\n因此，散布有关公司巨额亏损推动股市上涨的恐惧言论是错误的，但并不是每个人都能成为下一个亚马逊。", "note_en": "Here’s a wild stat from Joel Greenblatt on  Masters in Business with Barry Ritholtz:\n If you bought every company that lost money in 2019 that had a market cap over $1 billion, and so they’re about 261 of those and you bought every single one of those companies, you’ll be up 65 percent so far this year.\n This is a crazy number so I wanted to do a deeper dive on this one. Using data from  YCharts, I looked at the 2020 returns for stocks from the Russell 3000 Index with a market cap of at least a billion dollars and a negative net income from their latest annual report.\n   Almost one in five of these money-losing companies is up 100% or more this year. There are some huge gainers on this list including companies like Overstock.com (+1055%), Tesla (+429%), Peloton (+348%) and Moderna (+285%).\n But there are also plenty of big losers of these money-losing firms. More than one-quarter of these stocks are down 10% or more this year while almost 50 names have fallen 30% or more in 2020.\n  There are three different ways to think about the prevalence of big-gainers among unprofitable companies:\n   (3) This makes sense for some companies but others are going to get their comeuppance.\n Ben Thompson at Stratechery wrote a piece about the recent Snowflake public offering which was  the largest software IPO ever. The company is now valued at nearly $70 billion despite losing close to $180 million in the first half of the year. Trying to square this equation makes little sense at face value until you understand why it makes sense for Snowflake to lose money right now.\n Thompson describes the SaaS (software as a service) business model as, “you’re not so much selling a product as you are creating annuities with a lifetime value that far exceeds whatever you paid to acquire them.”\n For this type of business model, counterintuitively, losses can be a good thing assuming they’re able to build this annuity stream of future revenues. Thompson explains:\n Think about this in the context of Snowflake’s business: the entire concept of a data warehouse is that it contains nearly all of a company’s data, which (1) it has to be sold to the highest levels of the company, because you will only get the full benefit if everyone in the company is contributing their data and (2) once the data is in the data warehouse it will be exceptionally difficult and expensive to move it somewhere else. Both of these suggest that Snowflake should spend more on sales and marketing, not less:\n Data warehouses have inherently large lifetime values given the fact that the data, once imported, isn’t going anywhere.\n To that end, Snowflake was an attractive investment not simply because of its eye-popping growth numbers, but also because of its eye-popping losses. That is exactly what you want to see in a business that is selling lock-in, and it isn’t a surprise that Snowflake’s IPO was massively successful.\n When you look at things through this lens, it makes perfect sense that certain businesses would see extraordinary gains in 2020 despite losing money. The present value of a stock or business comes from its discounted future cash flows. So investors aren’t as worried about current cash flows but how spending now will impact cash flows in the future. Investors who focus exclusively on the current results miss the forest for the trees.\n The problem for many of these stocks will come if and when some of these companies don’t meet their expectations for the future.\n Greenblatt thinks it won’t necessarily be the Amazons and Googles of the world that will come back to earth but those companies people are betting on becoming the next Amazons and Googles of the world:\n I don’t think the froth is in the Google, Amazon and — Amazon. Those are some of the best businesses we’ve ever seen in our lifetime.\n The froth in the market is in the hundreds of companies that I was talking about before, that people will think will rhyme with the next Amazon, Google and Microsoft. And there just can’t be hundreds of companies that do that. So I think that’s where the comeuppance will be.\n  You shouldn’t be surprised so many SaaS companies are seeing huge stock market gains despite huge losses in their businesses. This is the nature of these businesses and people who are stuck using old fundamental valuation frameworks likely missed the boat on many of these companies.\n But you also shouldn’t be surprised when investors set their expectations far too high for many of these stocks. Emulating Amazon, Microsoft, Google, Apple and Facebook will not be easy. These are some of the biggest and best companies in the world for a reason.\n So the fear-mongering about companies with huge losses driving the stock market is misplaced but not everyone can become the next Amazon.", "posttime": "2020-10-15 23:43:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "股票,companies", "title": "为什么这么多无利可图的公司是今年表现最好的股票？", "title_en": "Why Are So Many Unprofitable Companies the Best Performing Stocks This Year?", "transed": 1, "url": "https://awealthofcommonsense.com/2020/10/why-are-so-many-unprofitable-companies-the-best-performing-stocks-this-year/", "via": "", "real_tags": ["股票", "companies"]}, {"category": "", "categoryclass": "", "imagename": "ae63da79f4eedb3dc75d1bb458a6bc29.png", "infoid": 1029033, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在虚拟机或真实硬件上尝试最新和最好的GNOME软件", "note_en": "Try the latest and greatest GNOME software in a VM or on real hardware", "posttime": "2020-10-15 23:43:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "操作系统,gnome", "title": "GNOME操作系统", "title_en": "Gnome OS", "transed": 1, "url": "https://os.gnome.org/", "via": "", "real_tags": ["操作系统", "gnome"]}, {"category": "", "categoryclass": "", "imagename": "616803ea1df61cd987e60158f3696018.jpg", "infoid": 1029031, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在3月份感染冠状病毒后，迈克尔·里根(Michael Reagan)对他在巴黎的12天假期完全失去了记忆，尽管那次旅行只是在几周前。\n埃里卡·泰勒(Erica Taylor)从新冠肺炎的恶心和咳嗽症状中恢复几周后，她变得困惑和健忘，甚至认不出自己的车，这是她公寓楼停车场唯一的丰田普锐斯(Toyota Prius)。\n丽莎·米泽尔(Lisa Mizelle)是一家紧急护理诊所的资深护士，她在7月份感染了这种病毒，她发现自己忘记了常规治疗和实验室测试，不得不向同事询问她过去自动知道的术语。\n“我离开了房间，我不记得病人刚才说了什么，”她说，并补充说，如果她没有用完病假，她就会休更多的假。\n“一想到我在工作，我就害怕，”53岁的米泽尔说。“我感觉自己像是得了痴呆症。”\n它被称为Covid大脑迷雾：令人不安的认知症状，可能包括记忆力丧失、困惑、难以聚焦、头晕和抓取日常词汇。Covid幸存者表示，越来越多的Covid幸存者表示，脑雾正在削弱他们的正常工作和功能能力。\n“有成千上万的人患有这种疾病，”伊戈尔·科拉尼克(Igor Koralnik)博士说，他是芝加哥西北医学(Northwest Medicine)的神经传染病主任，他领导的一家后Covid诊所已经看过数百名幸存者。“对受影响的劳动力的影响将是巨大的。\n科学家们不确定是什么导致了脑雾，这种雾变化很大，甚至影响到那些从新冠肺炎那里只患了轻微身体疾病并且以前没有任何疾病的人。主要的理论是，当身体对病毒的免疫反应没有停止或通向大脑的血管发炎时，它就会发生。\n新冠肺炎因呼吸问题住院期间出现过神志不清、神志不清和其他类型的精神功能改变，称为脑病，一项研究发现，这类患者需要更长的住院时间，死亡率更高，而且往往在住院后无法立即管理日常活动。\n但对长期脑雾的研究才刚刚开始。法国8月份的一份报告对120名住院患者进行了调查，发现34%的患者在几个月后出现记忆力丧失，27%的患者出现注意力集中问题。\n印第安纳大学医学院(Indiana University School Of Medicine)副教授娜塔莉·兰伯特(Natalie Lambert)帮助领导了这项研究，她说，在一项即将公布的针对幸存者军团(Survivor Corps)3930名成员的调查中，超过一半的人报告说，他们很难集中注意力或注意力。幸存者军团是一群与Covid之后的生活有联系的人。在幸存者报告的101种长期和短期的身体、神经和心理状况中，这是第四种最常见的症状。三分之一或更多的受访者报告了记忆问题、头晕或神志不清。\n60岁的里克·沙利文(Rick Sullivan)来自加利福尼亚州布伦特伍德，他克服了与新冠肺炎长达数周的呼吸问题和身体疼痛，自7月以来一直出现脑雾发作，他说：“这让人虚弱。”“我几乎得了紧张症。感觉我好像被麻醉了。“。\n当31岁的泰勒在6月中旬感染病毒时，她认为自己只需要短暂地离开亚特兰大一家帮助低收入租户的非营利组织的律师工作就行了。\n但她变得如此迷失方向，以至于她用洗好的衣服洗了电视遥控器，不得不归还最近收养的一只寄养狗，因为她不相信自己能照顾宠物。\n一天早上，“我脑子里的一切都是白色静电，”她说。“我坐在床边哭着，感觉‘有些不对劲，我应该寻求帮助’，但我不记得我应该向谁或该问什么。我忘了我是谁，也忘了我在哪里。“。\n到了7月份，她认为自己的情况有所改善，并告诉老板她可以回来。但在另一个“白色静电”插曲之后，她给他发了一条信息：“我很害怕。我真的很想回去工作。但是，我一直很累，很困惑。“。他建议她休息并痊愈。\n她在8月初重新开始工作，但她的思绪飘忽不定，阅读电子邮件“就像读希腊语一样”，她说。到了9月份，她的雇主敦促她休13周的假。\n“他们最终落到了‘你必须离开’的地步，”泰勒说，她要求在休假期间为这个非营利性组织做志愿者，但被拒绝了。“老实说，我累坏了。”\n现年50岁的里根在医院进进出出呆了五天，他最初恢复了在一家制造支架和导管的公司担任血管专家的工作。\n但手指震颤和癫痫发作，以及有时伴随脑雾的神经症状，意味着“我不可能去做手术，教医生如何缝合动脉，”他说。\n现在已经休假的里根先生说，在会议中，“我找不到合适的语言。”“我觉得我听起来像个白痴。”\n在米泽尔7月感染病毒并在8月因肺炎住院五天之前，她每小时会在阿拉巴马州亨茨维尔的诊所独自治疗六名患者。但最近，她说，“我告诉我们的调度员，我不能单独工作，因为我思维迟缓，头晕，我只是需要其他人和我一起工作。”\n有时在检查室里，她说，“我试着对病人圆滑一些，这样他们就不会知道了，因为你不想让你的医疗服务提供者陷入迷雾中，这非常可怕。”\n米泽尔说，她忘了订购泌尿系统感染的培养物，但一名实验室技术人员发现了这一点，他说，“丽莎，我找到你了。”\n她说：“据我所知，我没有犯错。”她补充说，最近情况略有改善。“我还没有杀过人。”\n“最简单的答案是，在最初的感染消退后，人们仍然有持续的免疫激活，”美国国家神经疾病和中风研究所神经系统感染主任阿文德拉·纳特(Avindra Nath)博士说。\n耶鲁大学医学院(Yale School Of Medicine)神经感染和全球神经病学主任塞雷娜·斯皮迪奇(Serena Spudich)博士说，可能涉及血管内的炎症或血管衬里的细胞。她说，在有效的免疫反应中释放的炎症分子“也可能是一种毒素，特别是对大脑”。\n神经学家和神经学家多娜·金·默菲(Dona Kim Murphey)博士说，微小的中风可能会导致一些症状。她自己也经历过Covid后的神经问题，包括“外星人手综合征”，在这种情况下，她感觉“我的左手有一种超级奇怪的感觉，就像我不明白它为什么会放在这个位置，我真的被它迷住了。”\nSpudich博士说，其他可能的原因是“当抗体错误地攻击神经细胞时”的自身免疫反应。\n西奈山卫生系统(Mount Sinai Health System)的神经传染病专家艾利森·纳维斯(Allison Navis)博士说，当受损的神经发出错误信号时，可能会出现刺痛或麻木等症状。一些有脑雾的人仍然会经历肺或心脏的问题，这可能会加剧神经症状。\n默菲博士是一家脑电波技术公司的科学总监，他在最近的一次会议上不能用“工作”这个词，他说，研究是至关重要的，所以症状被认真对待。\n“人们以一种轻蔑的方式说‘这都是他们的想法，’”她说。“在这种情况下，它确实存在于我们的脑海中，而且是非常真实的。”\n今年夏天，血管内科专家里根先生打开炉子煮鸡蛋，然后心不在焉地去遛狗，名叫沃尔夫-帕金森-怀特(Wolff-Parkinson-White)，这只狗是以心律失常的名字命名的。回来后发现一个热得危险的空平底锅，他惊慌失措，从此再也没有做饭。\n他已经忘记了刚刚过去的圣诞节、新年和他为伴侣穆斯塔法·阿尔·尼亚马(Mustafa Al Niama)40岁生日安排的3月份巴黎假期。\n“我看着我所有的巴黎照片，试图回忆，”他说，并展示了这对夫妇在卢浮宫蒙娜丽莎(Mona Lisa)的自拍。“我们去看了麦当娜的演唱会，我们去了埃菲尔铁塔，我们去了地下墓穴。我什么都不记得，什么都不记得。“。\n沙利文经历了一系列认知障碍。在他称之为“蓬松”的最温和的状态下，他的头感觉很重。在中期阶段，“模糊的，”他说，“当人们和我说话时，我会变得愤怒，因为试图集中注意力会伤害我的大脑。”最严重的是“雾”，当“我不能工作”和“我坐着盯着看，没有动力移动，我的头脑在飞驰。”\n即使是轻微的脑力或体力消耗也会引发他的雾气，沙利文在疫情爆发前从一家摄影公司的高级职位下岗，他说很多天他只能承担两项职责：“清理猫砂和捡狗粪。”\n即使是这样，也是令人焦虑的。“对我来说，这是一系列的15或16项任务，”他说。“哦，天哪，我得找个袋子把垃圾放进去，然后我得把盖子打开。”\n61岁的朱莉娅·多纳休(Julia Donahue)来自纽约州萨默斯，她很难用流畅的句子说话，这很痛苦，因为她长期以来一直喜欢在历史节目中扮演阿比盖尔·亚当斯(Abigail Adams)。\n“现在，阿比盖尔只是我衣柜里的一堆衣服，”她说。“我不能发表45分钟的演讲。”\n最近，她甚至想不起“牙刷”这个词了，她对一位朋友说：“你知道的，就是那种能让你的牙齿干净的东西。”\n专家建议患有脑雾的人去看医生，排除其他疾病，并治疗剩余的身体症状。\n米泽尔女士、里根先生、泰勒女士和其他人正在咨询心脏病专家和其他专家，还有神经学家。\n医生不知道症状是否会随着时间的推移而改善或消失。一些患者正在设计解决办法或临时的康复练习。\n里根先生也失去了方向感，他听从了一位治疗师的建议，步行到他位于曼哈顿下城的家附近的任意地点。最近，他选择了几个街区外的纽约证券交易所(New York Stock Exchange)。他写下指示，反复阅读，然后带着他的伴侣和他们的狗出发。\n在第一个拐弯处，他的头脑摇摇欲坠。“左转？”他问Al Niama先生，他告诉他应该右转。\n9月中旬，沙利文认为最糟糕的时期已经过去，但在杂货店里，他和妻子出现了“浓雾”，抓住了购物车，“像僵尸一样在商店里闲逛，”他说。\n几天后，他举起了3磅重的哑铃-与Covid之前65磅的例行公事相比算不了什么-这时“砰，雾袭击了我，”他回忆道，意识到“我还没有走出这一步。”然后他崩溃了，抽泣着。", "note_en": "After contracting the  coronavirus in March, Michael Reagan lost all memory of his 12-day vacation in Paris, even though the trip was just a few weeks earlier.\n Several weeks after Erica Taylor recovered from her Covid-19 symptoms of nausea and cough, she became confused and forgetful, failing to even recognize her own car, the only Toyota Prius in her apartment complex’s parking lot.\n Lisa Mizelle, a veteran nurse practitioner at an urgent care clinic who fell ill with the virus in July, finds herself forgetting routine treatments and lab tests, and has to ask colleagues about terminology she used to know automatically.\n “I leave the room and I can’t remember what the patient just said,” she said, adding that if she hadn’t exhausted her medical leave she’d take more time off.\n “It scares me to think I’m working,” Ms. Mizelle, 53, said. “I feel like I have dementia.”\n It’s becoming known as Covid brain fog: troubling cognitive symptoms that can include memory loss, confusion, difficulty focusing, dizziness and grasping for everyday words. Increasingly, Covid survivors say brain fog is impairing their ability to work and function normally.\n “There are thousands of people who have that,” said Dr. Igor Koralnik, chief of neuro-infectious disease at Northwestern Medicine in Chicago, who has already seen hundreds of survivors at a post-Covid clinic he leads. “The impact on the work force that’s affected is going to be significant.\n Scientists aren’t sure what causes brain fog, which varies widely and affects even people who became only mildly physically ill from Covid-19 and had no previous medical conditions. Leading theories are that it arises when the body’s immune response to the virus doesn’t shut down or from inflammation in blood vessels leading to the brain.\n  Confusion, delirium and other types of  altered mental function, called encephalopathy, have occurred during  hospitalization for Covid-19 respiratory problems, and a  study found such patients needed longer hospitalizations, had higher mortality rates and often couldn’t manage daily activities right after hospitalization.\n But research on long-lasting brain fog is just beginning. A  French report in August on 120 patients who had been hospitalized found that 34 percent had memory loss and 27 percent had concentration problems months later.\n In a soon-to-be-published survey of 3,930 members of Survivor Corps, a group of people who have connected to discuss life after Covid, over half reported difficulty concentrating or focusing, said Natalie Lambert, an associate research professor at Indiana University School of Medicine, who helped lead the study. It was the fourth most common symptom out of the 101 long-term and short-term physical, neurological and psychological conditions that survivors reported. Memory problems, dizziness or confusion were reported by a third or more respondents.\n “It is debilitating,” said Rick Sullivan, 60, of Brentwood, Calif., who’s had episodes of brain fog since July after overcoming a several-week bout with Covid-19 breathing problems and body aches. “I become almost catatonic. It feels as though I am under anesthesia.”\n  When Ms. Taylor, 31, contracted the virus in mid-June, she thought she’d need only a brief break from working as a lawyer for an Atlanta nonprofit helping low-income tenants.\n  But she became so disoriented that she washed her TV remote with her laundry and had to return a foster dog she’d recently taken in because she couldn’t trust herself to care for a pet.\n One morning, “everything in my brain was white static,” she said. “I was sitting on the edge of the bed, crying and feeling ‘something’s wrong, I should be asking for help,’ but I couldn’t remember who or what I should be asking. I forgot who I was and where I was.”\n By July, she thought she’d improved and told her boss she could return. But after another “white static” episode, she messaged him: “I’m scared. I really want to get back to work. But, I keep getting really tired and really confused.” He suggested she rest and heal.\n She resumed working in early August, but her mind wandered and reading emails was “like reading Greek,” she said. By September, her employer urged a 13-week leave.\n “They finally landed on ‘You’re going to have to step away,’” said Ms. Taylor, who requested to volunteer for the nonprofit while on leave but was told no. “I’m gutted, to be honest.”\n  Mr. Reagan, 50, who spent five days in and out of hospitals, initially resumed work as a vascular specialist for a company that makes stents and catheters.\n But finger tremors and seizures, neurological symptoms that sometimes accompany brain fog, meant “there is no way I’m going to go into surgery and teach a doctor how to suture an artery,” he said.\n  In meetings, “I can’t find words,” said Mr. Reagan, who has now taken a leave. “I feel like I sound like an idiot.”\n Before Ms. Mizelle contracted the virus in July and was hospitalized with pneumonia for five days in August, she’d treat six patients an hour by herself at her clinic in Huntsville, Ala. But recently, she said, “I told our scheduler I can’t work alone because I’m slow in thinking, I’m dizzy, and I just need somebody else there to work with me.”\n Sometimes in exam rooms, she said, “I’m trying to be slick with the patient so they don’t know, because you don’t want your provider to be in a fog, which is very scary.”\n She’s forgotten to order cultures for urinary infections, but a lab technician caught it, saying “I’ve got you, Lisa,” Ms. Mizelle said.\n “As far as I know, I have not made a mistake,” she said, adding that things have recently improved slightly. “I haven’t killed anybody yet.”\n  “The simplest answer is people still have persistent immune activation after the initial infection subsided,” said Dr. Avindra Nath, chief of infections of the nervous system at the National Institute of Neurological Disorders and Stroke.\n Inflammation in blood vessels, or cells lining the vessels, may be involved, said Dr. Serena Spudich, chief of neurological infections and global neurology at Yale School of Medicine. Inflammatory molecules, released in effective immune responses, “can also be sort of toxins, particularly to the brain,” she said.\n Tiny strokes may cause some symptoms, said Dr. Dona Kim Murphey, a neurologist and neuroscientist, who herself has experienced post-Covid neurological issues, including “alien hand syndrome,” in which she felt a “super-bizarre sense of my left hand, like I didn’t understand why it was positioned the way it was and I was really captivated by it.”\n Other possible causes are autoimmune reactions “when antibodies mistakenly attack nerve cells,” Dr. Spudich said.\n Symptoms like tingling or numbness can occur when damaged nerves send wrong signals, said Dr. Allison Navis, a neuro-infectious disease specialist at Mount Sinai Health System. Some people with brain fog still experience lung or heart issues, which can exacerbate neurological symptoms.\n  Dr. Murphey, scientific director for a brain-wave technology company, who couldn’t summon the word “work” in a recent meeting, said research is crucial so symptoms are taken seriously.\n “People say in a disparaging way ‘It’s all in their head,’” she said. “In this case it is literally in our heads, and it is very real.”\n  This summer, Mr. Reagan, the vascular medicine specialist, turned the stove on to cook eggs and then absent-mindedly left to walk the dog, Wolff-Parkinson-White, named after a cardiac arrhythmia. Returning to discover a dangerously hot empty pan, he panicked and hasn’t cooked since.\n He’s forgotten this past Christmas, New Year’s and the Paris vacation in March that he arranged for his partner Mustafa Al Niama’s 40th birthday.\n “I look at all my pictures of Paris, trying to remember,” he said, showing a selfie of the couple at the Mona Lisa in the Louvre. “We went and saw a Madonna concert, we went to the Eiffel Tower, we went to the Catacombs. And I remember nothing, nothing at all.”\n Mr. Sullivan navigates a spectrum of cognitive speed bumps. In the mildest state, which he calls “fluffy,” his head feels heavy. In the middling phase, “fuzzy,” he said, “I become angry when people talk to me because it hurts my brain to try and pay attention.” Most severe is “fog,” when “I cannot function” and “I sit and stare, unmotivated to move, my mind racing.”\n Even slight mental or physical exertion can trigger his fog, and Mr. Sullivan, laid off before the pandemic from a senior position with a photography company, said many days he could manage only two responsibilities: “Clean the kitty litter and pick up dog poop.”\n Even that was anxiety-provoking. “To me, it was a series of 15 or 16 tasks,” he said. “Oh, my God, I have to find a bag to put the litter in, then I have to take the lid off.”\n Julia Donahue, 61, of Somers, N.Y., struggles to speak in fluid sentences, painful because she’s long enjoyed playing Abigail Adams in historical programs.\n “Now, Abigail is just a bunch of dresses in my closet,” she said. “I wouldn’t be able to give a 45-minute address.”\n Recently, she couldn’t even recall “toothbrush,” saying to a friend “‘You know, the thing that makes your teeth clean.’”\n  Experts advise people with brain fog to see doctors to rule out other medical conditions and treat remaining physical symptoms.\n Ms. Mizelle, Mr. Reagan, Ms. Taylor and others are consulting cardiologists and other specialists, along with neurologists.\n Doctors don’t know whether symptoms will improve or evaporate with time. Some patients are devising workarounds or makeshift recovery exercises.\n Mr. Reagan, who’s also lost his sense of direction, follows a therapist’s suggestion to walk to random locations near his home in Lower Manhattan. Recently, he chose the New York Stock Exchange, several blocks away. He wrote down directions and read them repeatedly before setting out with his partner and their dog.\n At the first corner, his mind faltered. “Left?” he asked Mr. Al Niama, who informed him they should turn right.\n In mid-September, Mr. Sullivan thought the worst was over, but at the grocery store with his wife, he developed “full-blown fog,” gripped the cart and “wandered around the store like a zombie,” he said.\n Days later, he was lifting three-pound dumbbells — nothing compared with his pre-Covid 65-pound routine — when “Bam, the fog hit me,” he recalled, realizing, “I’m not over this.” Then he broke down, sobbing.", "posttime": "2020-10-15 23:42:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "肆虐,fog,神经", "title": "脑雾肆虐新冠肺炎幸存者", "title_en": "Brain Fog Plagues Covid-19 Survivors", "transed": 1, "url": "https://www.nytimes.com/2020/10/11/health/covid-survivors.html", "via": "", "real_tags": ["肆虐", "fog", "神经"]}, {"category": "", "categoryclass": "", "imagename": "4d0dbc516b3e84e0b525ed303b0886b3.png", "infoid": 1029030, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司此前筹集了600万美元的种子前融资和600万美元的种子融资，TechCrunch去年11月报道了这一轮融资。\n羊驼是一家最近突然出现在我们对初创公司和私人资本市场的报道中的公司，为我们讨论API驱动的初创公司及其最近的成功增添了自己的视角。\n根据我们的计算，新一轮融资将把羊驼的总融资推到2200万美元左右。\n它利用现有的资金做了很多事情，包括在过去一年里大幅提高了交易量。正如我们在免佣金经纪人罗宾汉身上看到的那样，交易量可以非常有利可图。在之前接受羊驼首席执行官横川方明(Yoshi Yokokawa)的采访时，这家初创公司证实，它通过通过特定做市商传递订单流来获得收入。\n因此，随着羊驼交易量的增长，其收入也随之增长。这一点很重要，因为我们有关于羊驼2020年交易量的说明，以及其中一些数字与其2019年业绩的比较情况。这些数据有助于解释为什么，以及这家初创公司是如何吸引新资本的。\n以下是这家初创公司通过客户使用其API产生的历史交易额(以美元计算)：\n根据该公司的说法，9月份20亿美元的业绩是去年同期的10倍，这意味着羊驼的收入在最近几个季度飙升。快速的收入增长，以及可能的10倍收入增长，是投资者的梦寐以求的东西。因此，该公司的首轮比赛并不令人意外。\n横川表示，紧随这种增长，羊驼希望吸引更多的企业客户，并在API中加入双倍功能，以便实现为地球上每个人提供金融服务的愿景。顺便说一句，这就是为什么该公司正在建设基础设施技术，而不是面向消费者的工具的原因。羊驼想要坐在幕后，环游世界，为其他玩家提供动力，这样它就可以达到最大限度的伸展。(如果它为许多不同公司的交易工具提供动力，这家初创公司可能能够接触到更多的最终用户，而不是试图将世界上的交易人口联合到一项单一的第一方服务中。)\n为了实现它的抱负目标，这家初创公司需要更多的人来制造更多的东西。与许多初创公司一样，羊驼已经完全远离家乡，正拿着新的资金在世界各地招聘。我问这位首席执行官，随着羊驼寻求在全球范围内扩大客户基础，他是否主要增加了市场销售人员。他回应说，它的大多数分布式员工都是开发人员，尽管也有一些人是营销人员。\n新冠肺炎到达时，羊驼的员工人数减少到10人左右，现在有35人。这些人将帮助羊驼跨越两个载体发展，即在API开发的推动下，在地理上的扩张和进入企业的增长。该公司在经纪自营商功能方面的工作是其国际增长计划的一部分。\nAPI空间很热。金融科技的世界着火了。而在金融科技内部，我们看到了储蓄和投资的繁荣。羊驼横跨这三个世界。让我们看看再多花1000万美元能走多远。", "note_en": "The company previously raised a $6 million pre-Seed and $6 million Seed round that  TechCrunch covered last November.\n Alpaca   is a company that has cropped up in our coverage of the startup and private capital markets recently, adding its perspective to  our discussion of API-powered startups and their recent success.\n By our math, the new round pushes Alpaca to around $22 million in total funding.\n It’s done a lot with the pre-existing funds, including driving its transaction volume sharply higher over the last year. As  we’ve seen with commission-free broker Robinhood, transaction volume  can be robustly lucrative. In a prior interview with Alpaca CEO  Yoshi Yokokawa, the startup confirmed that it generates revenues from routing order flow through specific market makers.\n  So, as Alpaca’s trading volume grows, so too does its revenue. This matters as we have notes on Alpaca’s trading volume in 2020, and how some of those figures compare to its 2019 results. The data helps explain why, and how the startup attracted new capital.\n Here’s the startup’s historical trading volume in dollars, generated via customer’ use of its API:\n  Per the company, that $2 billion result in September is up 10x its year-ago performance, implying that revenue at Alpaca has soared in recent quarters. Fast revenue growth, and possible 10x revenue expansion, is investor catnip. The company’s Series A, therefore, is not a surprise event.\n  Off the heels of this growth, Alpaca wants to go after more enterprise customers and double-down on building features into its API so that it can pursue a vision of providing financial services to everyone on the planet, according to Yokokawa. That hope, by the way, is why the company is building infrastructure tech and not consumer-facing tooling. Alpaca wants to sit behind the scenes, the world ’round, powering other players so that it can have maximum reach. (If it powers lots of different companies’ trading tooling, the startup might be able to reach more total end-users than trying to accrete the world’s trading population to a single, first-party service.)\n To accomplish its aspirational goal, the startup needs more folks to build more things. Similar to many startups, Alpaca has gone fully remote and is taking its fresh cash to hire around the world. I asked the CEO if he was adding mostly, say, in-market salespeople as Alpaca looks to expand its customer base globally. He responded that most of its distributed hires have been developers, though some have been marketers as well.\n After reducing staff to around 10 when COVID-19 arrived, Alpaca is now 35 people strong. Those folks will help Alpaca grow across two vectors, namely geographic expansion and growth into the enterprise, powered by API development. The company’s work on broker-dealer features is part of its international growth plan.\n The  API-space is hot. The  fintech world is on fire. And inside of fintech itself, we’ve  seen a savings and investing boom. Alpaca straddles all of three of those worlds. Let’s see how far it can get with $10 million more.", "posttime": "2020-10-15 23:26:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "股票,交易,api,羊驼", "title": "\n羊驼为其API驱动的股票交易服务筹集1000万美元的首轮股票交易服务", "title_en": "\n\t\t\t\tAlpaca raises $10M Series A for its API-powered equities trading service\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/15/alpaca-raises-10m-series-a-for-its-api-powered-equities-trading-service/", "via": "", "real_tags": ["股票", "交易", "api", "羊驼"]}, {"category": "", "categoryclass": "", "imagename": "cba6a200737f82b9a8b206479954904a.jpg", "infoid": 1029028, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "YouTube周四表示，它将不再允许针对具有阴谋论的个人和团体的内容，特别是Qanon及其前身披萨门(Pizzagate)。\n该公司在其博客上宣布：“今天，我们在努力遏制仇恨和骚扰方面又迈出了一步，删除了更多被用来为现实世界的暴力辩护的阴谋论内容。”\n该帖子写道，新规定是YouTube现有仇恨和骚扰政策的扩展，将禁止“通过暗示某人参与了QAnon或Pizzagate等有害阴谋而威胁或骚扰他人”的内容。\nYouTube表示，它将立即执行更新后的政策，并计划“在未来几周内加大力度”。\nYouTube去除Qanon内容之前，其他社交媒体平台最近也进行了类似的调整。今年7月，Twitter删除了QAnon账户，并限制了QAnon内容。上周，Facebook表示将删除与Qanon有关的群组、页面和Instagram账户。\nQAnon是一种阴谋论，毫无根据地声称，备受瞩目的民主党人和好莱坞名人正在按照仪式牺牲儿童，作为唐纳德·特朗普(Donald Trump)总统正在打击的阴谋的一部分。在网上，QAnon的追随者无情地攻击公众和私人人物，他们认为自己是撒旦阴谋的一部分。一些追随者将他们的暴力幻想带入了现实世界，据称他们犯下了包括谋杀在内的暴力罪行，这一事实促使联邦调查局(FBI)在2019年将其列为潜在的国内恐怖威胁。\n自2018年以来，YouTube利用禁止煽动暴力或泄露私人信息的现有规则，采取了一系列执法行动和政策变化，以减少QAnon内容。YouTube表示，这些举措导致数以万计的QAnon视频下架，数百个与Q相关的频道被终止。\n但是，正如YouTube首席执行官苏珊·沃西基本周告诉CNN的那样，到目前为止，Qanon的很多视频都逃脱了审查，因为它们被认为是边缘内容，“没有违反任何特定的政策”。\n我认为，对于每项政策，它都必须定义得非常清楚。沃西基说，那到底是什么意思，一个Qanon团体？&#34；沃西基(Wojcicki)说。这是我们需要从政策的角度考虑的一种事情，并确保我们超级清楚。“。\n虽然不是全面禁止，但YouTube预计新政策将对QAnon剩余内容产生重大影响。\nQAnon的追随者在YouTube上发布的视频中指责名人、政客和公司似乎是随机的。然后，这些视频的浏览量如此之大，以至于它们淹没了搜索结果的顶部，充斥着阴谋论，淹没了官方信息来源，对于名人来说，甚至淹没了电影预告片和电视节目的剪辑。\nQAnon的追随者一再错误地瞄准演员汤姆·汉克斯，在YouTube上搜索这位演员通常会返回奇幻的阴谋论。汉克斯的儿子切特·汉克斯(Chet Hanks)本周在Instagram上表示，由于QAnon追随者的辱骂，他“暂时离开了社交媒体”。\n北卡罗来纳大学信息、技术和公共生活中心(Center for Information，Technology and Public Life)研究员贝卡·刘易斯(Becca Lewis)专注于互联网激进化，她表示，YouTube的QAnon新政策在范围上比Facebook的彻底禁令要窄得多，所以“在我们看到它在实践中的执行情况之前，很难评估它的实际影响。”\n刘易斯说：“一方面，这肯定比他们目前的骚扰或阴谋论政策更具侵略性。”“另一方面，如果只禁止专门针对其他个人或团体的阴谋性内容，可能会给QAnon内容继续蓬勃发展留下巨大的回旋余地.”\nYouTube的一位发言人拒绝就将受到新政策影响的QAnon视频或创作者发表评论。YouTube上一些病毒量最大的QAnon内容，包括一部点击量超过1500万次的纪录片，周四被撤下，取而代之的是一条横幅，解释称删除是“由于多次或严重违反了YouTube禁止旨在骚扰、欺凌或威胁内容的政策”。其他病毒式的QAnon视频有数百万的点击量，仍然可以访问。", "note_en": "YouTube said Thursday that it would no longer allow content that targets individuals and groups with conspiracy theories, specifically QAnon and its antecedent, &#34;pizzagate.&#34;\n “Today, we are taking another step in our efforts to curb hate and harassment by removing more conspiracy theory content used to justify real-world violence,” the company  announced on its blog.\n   The new rules, an expansion of YouTube’s existing hate and harassment policies, will prohibit content that “threatens or harrasses someone by suggesting they are complicit in one of these harmful conspiracies, such as QAnon or Pizzagate,” the post read.\n YouTube said it would be enforcing the updated policy immediately and plans to “ramp up in the weeks to come.”\n YouTube’s move to rid the platform of QAnon content follows similar recent changes by other social media platforms. In July, Twitter  removed QAnon accounts and restricted QAnon content. Last week, Facebook said it would  remove groups, pages and Instagram accounts that identified with QAnon.\n QAnon is a conspiracy theory that baselessly claims high-profile Democrats and Hollywood celebrities are ritually sacrificing children as part of a cabal that President Donald Trump is fighting. Online, QAnon followers relentlessly attack public and private figures they imagine to be part of the satanic cabal. Some followers have taken their violent fantasies into the real world, allegedly committing violent crimes,  including murder, a fact that moved the F.B.I. to label it  a potential domestic terror threat in 2019.\n  Since 2018, YouTube has taken a series of enforcement actions and policy changes to reduce QAnon content using existing rules against incitement to violence or revealing private information. These moves led to the removal of tens of thousands of QAnon videos and the termination of hundreds of Q-related channels, YouTube said.\n  But, as YouTube CEO Susan Wojcicki  told CNN this week, &#34;a lot&#34; of QAnon videos have escaped moderation thus far because they are considered &#34;borderline content,” having not violated any specific policy.\n &#34;I think with every policy, it has to be defined very clearly. Like what does that exactly mean, a QAnon group exactly?&#34; Wojcicki said. &#34;That&#39;s a kind of thing that we would need to put in terms of the policies and make sure that we were super clear.”\n While not a blanket ban, YouTube expects the new policy to have a significant impact on the remaining QAnon content.\n QAnon followers have targeted celebrities, politicians and companies seemingly at random with accusations of pedophilia in videos posted to YouTube. Those videos are then so widely viewed that they saturate the top of search results with conspiracy theories, drowning out official sources of information and, for celebrities, even movie trailers and clips from TV shows.\n  QAnon followers have repeatedly falsely targeted the actor Tom Hanks, and searches for the actor on YouTube routinely return fantastical conspiracy theories. Hanks’ son, Chet Hanks,  said on Instagram that he was “taking a break from social media for a while” this week because of abuse from QAnon followers.\n Becca Lewis, a research affiliate at the University of North Carolina’s Center for Information, Technology, and Public Life who focuses on internet radicalization, said that YouTube’s new QAnon policy is much narrower in scope than Facebook’s outright ban, so “the actual impact is incredibly difficult to assess until we see how it&#39;s enforced in practice.”\n “On the one hand, it is certainly more aggressive than their current harassment or conspiracy theory policies,” Lewis said. “On the other hand, by only prohibiting conspiratorial content that specifically targets other individuals or groups, it may leave huge amounts of leeway for QAnon content to continue to thrive.”\n A spokesperson for YouTube declined to comment on specific QAnon videos or creators that would be affected by the new policy. Some of the most viral QAnon content on YouTube, including a documentary-style QAnon film that had racked up more than 15 million views, was taken down Thursday and replaced with a banner explaining the removal was “due to multiple or severe violations of YouTube’s policy prohibiting content designed to harass, bully or threaten.” Other viral QAnon videos with millions of views were still accessible.", "posttime": "2020-10-15 23:24:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "youtube,内容,banning,qanon", "title": "YouTube现在正在禁止阴谋论内容，如QAnon或Pizzagate，这些内容针对的是个人和团体，并被用来为现实世界的暴力行为辩护", "title_en": "YouTube is now banning conspiracy theory content, such as QAnon or Pizzagate, that targets individuals and groups and is used to “justify real-world violence”", "transed": 1, "url": "https://www.nbcnews.com/tech/tech-news/youtube-bans-qanon-other-conspiracy-content-targets-individuals-n1243525", "via": "", "real_tags": ["youtube", "内容", "banning", "qanon"]}, {"category": "", "categoryclass": "", "imagename": "5490d9630d9cab759abdfbcca60be622.png", "infoid": 1029026, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "网络浏览器是70%终端安全漏洞背后的罪魁祸首。将用户连接到整个Internet的同一应用程序也将您连接到Internet的所有潜在有害部分。这是一扇通往地球上几乎所有相连系统的大门，这是强大而可怕的。\n我们也比以往任何时候都更加依赖浏览器。我们使用的大多数应用程序都在浏览器中运行，而且还会继续增加。对于越来越多的组织来说，公司笔记本电脑只是一台托管的Web浏览器机器。\n为了确保这些设备及其持有或访问的数据的安全，企业已经开始在浏览器本身不在机器上运行的情况下部署“浏览器隔离”服务。取而代之的是，浏览器运行在云提供商某处的虚拟机上。通过逃离设备，来自浏览器的威胁会停留在云中的某个虚拟机上。\n但是，大多数隔离解决方案采用两种方法中的一种，这两种方法都会破坏Web浏览器的便利性和灵活性：\n录制隔离的浏览器并将其实况流发送给用户，这会很慢，并且很难执行诸如向表单输入文本之类的基本操作。\n对网页进行解包、检查、重新打包并将其发送给用户-有时会丢失威胁，或者更常见的情况是无法以仍然正常工作的方式重新打包网页。\n今天，我们很兴奋地开启了第三种方法的测试版，通过Cloudflare浏览器隔离来保证网络浏览的安全。浏览器会话在全球200个城市的Cloudflare数据中心的沙箱环境中运行，使远程浏览器距离用户几毫秒，感觉就像本地Web浏览。\nCloudflare浏览器隔离不是将像素流式传输给用户，而是将浏览器的网页渲染的最终输出发送给用户。这种方法意味着，唯一发送到该设备的是一个绘制命令包来呈现网页，这也使得Cloudflare浏览器隔离与任何兼容HTML5的浏览器兼容。\n其结果是，浏览器感觉就像一个浏览器，同时将威胁远离设备。\n作为Cloudflare零信任周的一部分，我们今天邀请用户注册测试版。如果您现在有兴趣注册，请访问此帖子的底部。如果您想了解它是如何工作的，请继续阅读。\n虽然它从来没有完全成为Marc Andreessen在1995年预测的替代操作系统，但Web浏览器可能是当今终端用户设备上最重要的应用程序。在工作场所，许多人将大部分工作计算机时间完全花在连接到内部应用程序和外部SaaS应用程序和服务的Web浏览器中。随着这种情况的发生，浏览器需要变得越来越复杂-以满足Web日益丰富的需求和现代Web应用程序(如Office365和Google Workplace)的需求。\n然而，尽管Web浏览器扮演着举足轻重和无处不在的角色，但它们是企业中控制最少的应用程序。企业很难控制用户与网络浏览器的交互方式。用户很容易无意中下载受感染的文件，安装恶意扩展，上传敏感的公司数据，或者点击电子邮件或网页上的恶意零日链接。\n使问题变得更糟的是日益盛行的自带设备。这使得很难强制要求使用哪些浏览器，或者是否正确修补了这些浏览器。移动设备管理(MDM)是朝着正确方向迈出的一步，但就像本地防火墙的缓慢修补周期一样，MDM通常速度太慢，无法抵御零日威胁。我收到了许多来自CISO的大量电子邮件，提醒每个人现在就给浏览器打补丁，因为这一次“真的很重要”(CVE-2019-5786)。\n本周早些时候，我们发布了Cloudflare One，这是我们对企业网络未来的展望。我们采取的基本方法是一张白纸：摒弃旧模式(如城堡和护城河)的所有假设，引入基于当今企业网络的复杂性和向零信任、基于云的网络即服务转变的新模式。\n如果不考虑浏览器，就不可能做到这一点。远程计算技术提供了修复浏览器问题的承诺已有一段时间-在未来，任何人都可以从个人设备上的云计算的安全性和规模中受益。现实情况是，获得一个总体性能良好的解决方案比听起来要困难得多。它需要通过互联网发送用户的输入，计算该输入，从网络上检索资源，然后将它们流式传输给用户。这一切都必须在毫秒内发生，才能创造出使用本地软件的错觉。\n一般的体验都很糟糕，许多实现只会给IT人员带来愤怒的电子邮件和服务台罚单。\n这是一个棘手的问题，也是我们一直在努力解决的问题。通过提供基于矢量的流，无需高带宽连接即可扩展到任何显示尺寸，我们能够远程重现原生浏览器体验。用户可以体验到网站的原意，而不会因为清理HTML、CSS和JavaScript而带来所有的兼容性问题。托管浏览器仅在几毫秒之外托管在我们的网络上，这极大地帮助了性能问题。\nCloudFlare Access创建零信任网络边界，允许用户访问公司应用程序，而无需使用传统VPN设备在其内部网络中穿孔。\nCloudFlare Gateway创建了一个安全的Web网关，可保护用户免受任何网站上的威胁。\n这些工具非常适用于保护私有互联网财产免受来自已知恶意网站的未经授权的访问和Web浏览活动。但是，未知和不可预见的威胁怎么办？\nCloudFlare浏览器隔离通过将Web浏览器沙箱放在远程容器中来回答这个问题，该容器可以在用户浏览会话结束时或受到危害时轻松处理。\n如果诸如零日漏洞或恶意网站之类的未知威胁利用数百个Web API中的任何一个，则攻击仅限于在受监管的云环境中运行的浏览器，而最终用户的设备不受影响。\n网络浏览器是向云计算转移的基础。只是他们总是跑错地方。\n正如开发人员运行和维护其应用程序所在的硬件没有意义一样，同样的情况也适用于云等式的另一边：浏览器。有趣的是，解决方案完全相同：与开发人员的应用程序一样，浏览器需要迁移到云。然而，就像所有的颠覆一样，新技术的性能要赶上旧技术需要时间和投资。当AWS在2006年首次推出时，固有的限制意味着对于大多数开发人员来说，继续运行内部部署解决方案是有意义的。\n不过，在某种程度上，这项技术改进到了可以开始从以前的范式中取代颠覆的地步。\n到目前为止，基于云的浏览器的限制因素通常是使用体验。用户的体验受到光速的限制；它限制了用户输入传输到远程数据中心并返回到他们的显示器所需的时间。在完美的世界中，这需要在毫秒内发生，才能提供实时体验。\n为了提供实时远程计算体验，我们的200多个数据中心都能够在几乎所有连接到互联网的人眨眼之间提供远程浏览会话。这使我们能够提供低延迟、响应速度快的网页流，无论您身处何处。\n不过，说到这里就够了。我们很想请您尝尝！请在此处填写表格，注册成为我们网络中这项新技术的首批用户之一。当我们将测试版扩展到更多的用户时，我们会保持联系。\n产品新闻零信任零信任周浏览器隔离零日威胁", "note_en": "Web browsers are the culprit behind 70% of endpoint compromises. The same application that connects users to the entire Internet also connects you to all of the potentially harmful parts of the Internet. It’s an open door to nearly every connected system on the planet, which is powerful and terrifying.\n We also rely on browsers more than ever. Most applications that we use live in a browser and that will continue to increase. For more and more organizations, a corporate laptop is just a managed web browser machine.\n To keep those devices safe, and the data they hold or access, enterprises have started to deploy “browser isolation” services where the browser itself doesn’t run on the machine. Instead, the browser runs on a virtual machine in a cloud provider somewhere. By running away from the device, threats from the browser stay on that virtual machine somewhere in the cloud.\n However, most isolation solutions take one of two approaches that both ruin the convenience and flexibility of a web browser:\n Record the isolated browser and send a live stream of it to the user, which is slow and makes it difficult to do basic things like input text to a form.\n Unpack the webpage, inspect it, repack it and send it to the user - sometimes missing threats or more often failing to repack the webpage in a way that it still works.\n Today, we’re excited to open up a beta of a third approach to keeping web browsing safe with Cloudflare Browser Isolation. Browser sessions run in sandboxed environments in Cloudflare data centers in 200 cities around the world, bringing the remote browser milliseconds away from the user so it feels like local web browsing.\n Instead of streaming pixels to the user, Cloudflare Browser Isolation sends the final output of a browser’s web page rendering. The approach means that the only thing ever sent to the device is a package of draw commands to render the webpage, which also makes Cloudflare Browser Isolation compatible with any HTML5 compliant browser.\n The result is a browser that just feels like a browser, while keeping threats far away from the device.\n   We’re inviting users to sign up for the beta today as part of Zero Trust week at Cloudflare. If you’re interested in signing up now, visit the bottom of this post. If you’d like to find out how this works, keep reading.\n  While it never quite became the replacement operating system Marc Andreessen  predicted in 1995, the web browser is perhaps the most important application today on end-user devices. In the workplace, many people spend the majority of their at-work computer time entirely within a web browser connected to internal apps and external SaaS applications and services. As this has occurred, browsers have needed to become increasingly complex — to address the expanding richness of the web and the demands of modern web applications such as Office 365 and Google Workplace.\n However, despite the pivotal and ubiquitous role of web browsers, they are the least controlled application in the enterprise. Businesses struggle to control how users interact with web browsers. It’s all too easy for a user to inadvertently download an infected file, install a malicious extension, upload sensitive company data or click a malicious zero-day link in an email or on a webpage.\n Making the problem worse is the growing prevalence of BYOD. It makes it difficult to enforce which browsers are used or if they are properly patched. Mobile device management (MDM) is a step in the right direction, but just like the slow patching cycles of on-premise firewalls, MDM can often be too slow to protect against zero day threats. I’ve been the recipient of many mass emails from CISO’s reminding everyone to patch their browser and to do it right now because this time it’s “  really important” (CVE-2019-5786).\n  Earlier this week we announced Cloudflare One, which is our vision for the future of the corporate network. The fundamental approach we’ve taken is a blank sheet: to zero out all the assumptions of the old model (like castle-and-moat) and usher in a new model based on the complex nature of today’s corporate networking and the shift to Zero Trust, cloud-based networking-as-a-service.\n It would be impossible to do this without thinking about the browser. Remote computing technologies have offered the promise of fixing the problems of the browser for some time — a future where anyone can benefit from the security and scale of cloud computing on their personal device. The reality has been that getting a generally performant solution is much more difficult than it sounds. It requires sending a user’s input over the Internet, computing that input, retrieving resources off the web, and then streaming them back to the user. And it all must occur in milliseconds, to create an illusion of using a local piece of software.\n The general experience has been terrible, and many implementations have created nothing but angry emails and help-desk tickets for IT folks.\n It is a tough problem, and it’s something we’ve been hard at work at solving. By delivering a vector-based stream that scales across any display size without requiring high bandwidth connections we’re able to reproduce the native browser experience remotely. Users experience the website as it was intended, without all the compatibility issues introduced by scrubbing HTML, CSS and JavaScript. And performance issues are aided tremendously by the fact that the managed browser is hosted only milliseconds away on our network.\n   Cloudflare Access creates a Zero Trust network perimeter that allows users to access corporate applications without needing to poke holes in their internal network with a legacy VPN appliance.\n Cloudflare Gateway creates a Secure Web Gateway that protects users from threats on any website.\n These tools are excellent for protecting private Internet properties from unauthorized access and web browsing activity from known malicious websites. But what about unknown and unforeseeable threats?\n Cloudflare Browser Isolation answers this question by sandboxing a web browser in a remote container that is easily disposed of at the end of the user’s browsing session or when compromised.\n Should an unknown threat such as a zero day vulnerability or malicious website exploit any of the hundreds of Web APIs, the attack is limited to a browser running in a supervised cloud environment leaving the end-user’s device unaffected.\n  Web browsers are the foundation that the shift to the cloud has been built on. It’s just that they’ve always run in the wrong place.\n In the same way that it made no sense for a developer to run and maintain the hardware that their application runs on, the same exact case can be made for the other side of the cloud’s equation: the browser. Funnily enough, the solution is exactly the same: like the developer’s application, the browser needed to move to the cloud. However, as with all disruptions, it takes time and investment for the performance of the new technology to catch up to the old one. When AWS was first launched in 2006, the inherent limitations meant that for most developers, it made sense to continue to run on-premise solutions.\n At some point though, the technology improves to the point where the disruption can start taking over from the previous paradigm.\n The limiting factor until today for a cloud-based browser has often been the experience of using it. A user’s experience is limited by the speed of light; it limits the time it takes a user’s input to travel to the remote data center and be returned to their display. In a perfect world, this needs to occur within milliseconds to deliver a real time experience.\n   To deliver real-time remote computing experiences, each of our 200+ data centers are capable of serving remote browsing sessions within the blink of an eye of nearly everyone connected to the Internet. This allows us to deliver a low latency, responsive stream of a webpage regardless of where you’re physically located.\n  But that’s enough talking about it. We’d love for you to try it! Please complete the form  here to sign up to be one of the first users of this new technology in our network. We’ll be in touch as we expand the beta to more users.\n  Product News  Zero Trust  Zero Trust Week  Browser Isolation  Zero Day Threats", "posttime": "2020-10-15 23:20:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "浏览器,browser", "title": "重塑浏览器：Cloudflare浏览器隔离测试版简介", "title_en": "Reimagining the Browser: Introducing Cloudflare Browser Isolation Beta", "transed": 1, "url": "https://blog.cloudflare.com/browser-beta", "via": "", "real_tags": ["浏览器", "browser"]}, {"category": "", "categoryclass": "", "imagename": "b92d47bac2dc5ba7b3ebf7b9ed8cc37f.jpg", "infoid": 1029024, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳到主要内容针对过去的危机，对有形基础设施的投资帮助美国在经历了重大挑战后恢复并蓬勃发展。例如，在大萧条(Great Depression)和大衰退(Great Recession)之后，增加对交通基础设施的投资是将美国经济从灾难中带回的关键部分。\n新冠肺炎大流行和随之而来的经济危机需要同样重要的应对措施，但它也要求立法者考虑下一步该做什么。我们不能只投资高速公路--我们还需要投资于支撑信息高速公路的技术。为了从我们这个时代最大的挑战之一中重建，美国必须同时投资于物理和数字基础设施，以确保其复苏。\n在过去的几年里，民主党人和共和党人都呼吁进行重大的基础设施投资，结果都没有实现。这些为基础设施投资提供资金的努力主要集中在实体世界-高速公路、铁路、桥梁。虽然这些都是重要的投资领域，但我们不能忘记数字基础设施的同等重要性，特别是主要由志愿者劳动构建并支撑数字世界的自由和开放源码软件(FOSS)。自由和开放源码软件甚至正在进入物理世界，因为它内置在我们的手机、汽车和冰箱中。\n自由和开放源码软件开始于20世纪80年代，目的是让开发人员能够修补和修改软件，而这在当时大多数软件供应商都是被阻止的。这导致自由/开源软件中的“免费”被定义为“言论自由，而不是自由啤酒”，尽管该软件通常也是免费的。多年来，自由/开源软件主要是业余爱好者的领域，但随着计算和互联网成为日常生活中更大的一部分，自由/开源软件也是如此。在无数志愿者的不懈努力下，远程协作最终形成了一个强大的自由/开源软件生态系统。现在，自由/开源软件以操作系统(Linux、Android等)、数据库(MySQL、PostgreSQL、MongoDB等)、大数据和人工智能软件(Hadoop、TensorFlow等)的形式支撑着整个数字经济。价值数十亿美元的公司经常建立在自由/开源软件的支持下。即使是微软，其领导层曾将Linux称为“癌症”，并将其等同于共产主义，现在也接受了自由和开放源码软件，并将其作为其Azure云计算产品的核心。\n正如大流行所强调的那样，我们的经济越来越依赖数字基础设施。随着越来越多的面对面互动转移到网上，像Zoom这样的产品已经成为支持商务会议、课堂教育甚至国会听证会的关键基础设施。这样的通信技术建立在自由/开源软件的基础上，并依赖于深深扎根于互联网核心的自由/开源软件。即使是实体零售业的大本营之一的杂货店购物，也越来越依赖数字技术，这种技术允许高风险购物者支付费用，让某人通过Insta等应用程序为他们购物(Insta本身依赖于自由/开源软件，并为其做出了贡献)。\n数字世界的核心基础设施现在需要重大升级。35年前，联邦政府对国家超级计算中心(NSCC)进行了大量投资，这不仅导致了计算机硬件的进步，也带来了软件的进步-包括Apache Web服务器，它现在是使用最广泛的Web服务器之一，并帮助刺激了我们今天所知的互联网的建设。\n这类对数字基础设施的投资往往会带来巨大的回报。我们的研究表明，NSCC的投资至少为Apache软件本身带来了17%的回报率，更不用说后来在其基础上建立起来的数十亿美元的技术和商业了。这是联邦政府常用的基准预期收益率7%的两倍多。\n虽然这种直接投资是鼓励积极、有效结果的一种方式，但还有其他成本效益高的方法，需要较少的前期资本支出。例如，我最近的研究表明，改变偏爱自由/开源软件而不是专有软件的联邦采购法规可能会对私营部门产生许多积极的溢出效应，包括提高公司生产率、创建技术初创公司的数量以及与技术相关的劳动力规模。这项研究表明，法国通过这样一项法律，导致法国IT相关初创企业的成立数量增加了多达18%，从事IT相关工作的法国工人数量增加了多达14%。\n虽然一些自由和开放源码软件的贡献者是由他们的雇主支付贡献的，但对自由和开放源码软件的大部分贡献是没有直接补偿的。因此，另一个选择是向那些自愿利用空闲时间帮助创建和维护自由/开源软件的人提供税收抵免。自2009年以来，纽约州议会每届立法会议都会提出这样一项抵免法案，但从未通过委员会审议。如果获得通过，这项法案将为与自由/开源软件开发相关的费用提供200美元的税收抵免，这将有助于激励更多的个人做出贡献，可能会为纽约州带来类似于法国采购法规的溢出好处。\n自由和开放源码软件的这三个杠杆-直接融资、采购监管和税收激励-都应该包括在下一个基础设施法案中。\n尽管众议院最近通过的1.5万亿美元基础设施法案包括1000亿美元，用于增加服务不足社区的宽带接入，但这只解决了今天的问题-它没有为解决明天的问题奠定基础。我们通过哈佛创新科学实验室和Linux基金会的联合项目-核心基础设施倡议(Core Infrastructure Initiative)所做的工作表明，数字经济的核心基础设施存在重大漏洞，如果不加以解决，可能会导致未来的重大问题。这些漏洞包括：严重依赖过时或不定期维护的自由/开源软件组件，缺乏透明度和一致的命名约定，使公司难以正确更新其软件，以及缺乏项目治理保障措施，这可能允许恶意行为者向自由/开源软件项目插入后门。\n要了解广泛部署的开源代码中包含的漏洞的严重程度，请考虑OpenSSL中的心脏出血漏洞，该漏洞影响了互联网上近20%的安全网站。2012年，该项目的底层代码中错误地引入了一个错误。两年来，“心脏出血”一直没有被发现，部分原因是该项目只由一名全职工程师和几名兼职志愿者负责维护。核心基础设施计划是为了响应“心脏出血”而启动的，谷歌、IBM、英特尔和微软等主要科技公司捐赠了数百万美元，以更好地支持OpenSSL和其他关键的自由/开源软件项目。通常相互竞争的公司意识到自由和开放源码软件对数字经济是如此关键，他们需要共同努力来帮助确保数字经济的安全。\n自由和开放源码软件项目对现代商业和通信非常重要，不能仅仅依靠私营部门的善意。联邦政府也需要发挥自己的作用。未来的基础设施法案还应该包括为自由和开放源码软件的开发和维护提供新的资金和奖励。为了让我们的经济明天复苏和增长，我们今天需要投资于我们的开源数字基础设施。\n弗兰克·纳格尔(Frank Nagle)是哈佛商学院(Harvard Business School)工商管理学助理教授。他的研究部分得到了Linux基金会的支持。\n谷歌、IBM、英特尔和微软为布鲁金斯学会(Brookings Institution)提供资金支持，布鲁金斯学会是一个致力于严格、独立、深入的公共政策研究的非营利性组织。", "note_en": "Skip to main content                                                                                                                                                          In response to past crises, investments in physical infrastructure have helped the United States recover and thrive after significant challenges. After both the Great Depression and the  Great Recession, for example, increased investment in transportation infrastructure was a key part of bringing the American economy back from disaster.\n The COVID-19 pandemic and its attendant economic crisis requires a similarly significant response, but it also asks of lawmakers to consider what is next. We can’t just invest in highways—we also need to invest in the technology underpinning the information superhighway. To rebuild from one of the greatest challenges of our time, the United States must invest both in physical and digital infrastructure to secure its recovery.\n For the last few years, both  Democrats and  Republicans have called for major infrastructure investments, only for them not to materialize. These efforts to fund infrastructure investment have focused on the physical world—highways, railroads, bridges. While those are important areas for investment, we must not forget the equal importance of digital infrastructure, especially the free and open-source software (FOSS) that is built mostly by volunteer labor and underpins the digital world. FOSS is even working its way into the physical world, as it is built into our  phones,  cars, and  refrigerators.\n  FOSS began in the 1980s as an effort to give developers the ability to tinker with and alter software, which was prevented by most software vendors at the time. This led to the “free” in FOSS being defined as  “Free as in Free Speech, not as in Free Beer,” although frequently the software was also free of costs. For years, FOSS was primarily the domain of hobbyists, but as computing and the internet became a larger part of daily life, so too did FOSS. The untiring efforts of countless volunteers collaborating remotely eventually led to a robust FOSS ecosystem. Now, FOSS underpins the entire digital economy in the form of operating systems (Linux, Android, etc.), databases (MySQL, PostgreSQL, MongoDB, etc.), and big data and artificial intelligence software (Hadoop, TensorFlow, etc.).  Multi-billion dollar companies are regularly built on the back of FOSS. Even Microsoft, whose leadership once  called Linux “a cancer” and equated it to communism, has now embraced FOSS and uses it as the core of its Azure cloud computing offering.\n As the pandemic has highlighted, our economy is increasingly reliant on digital infrastructure. As more and more in-person interactions have moved online, products like Zoom have become  critical infrastructure supporting business meetings, classroom education, and even congressional hearings. Such communication technologies build on FOSS and rely on the FOSS that is deeply ingrained in the core of the internet. Even grocery shopping, one of the strongholds of brick and mortar retail, has seen an increased reliance on digital technology that allows higher-risk shoppers to pay someone to shop for them via apps like InstaCart (which itself  relies on, and contributes to, FOSS).\n The core infrastructure of the digital world now needs major upgrades. Thirty-five years ago, the federal government  invested heavily in the National Super Computing Centers (NSCC), which led not only to advances in computer hardware, but also in software – including the  Apache web server, now one of the most widely used web servers, and which helped spur the construction of the internet we know today.\n These kinds of investments in digital infrastructure tend to see major returns.  Our research has shown that NSCC investments saw a rate of return of at least 17% for the Apache software itself, let alone the billions of dollars of technology and commerce that have since been built on top of it. This is more than double the federal government’s commonly used  baseline expected rate of return of 7%.\n Although such direct investment is one way to encourage positive, effective outcomes, there are additional cost-effective methods that require less upfront capital outlay. For example, my recent  research has shown that changing federal procurement regulations that favor FOSS over proprietary software can have numerous positive spillovers to the private sector, including increases in company productivity, the number of technology startups founded, and the size of the technology-related labor force. This research shows that the passage of such a law in France led to as much as an 18% increase in the founding of French IT-related startups and as much as a 14% increase in the number of French workers employed in IT-related jobs.\n While some FOSS contributors are paid by their employer to contribute, most contributions to FOSS are made without direct compensation. Therefore, another option is to provide tax credits to the people who volunteer their free time to help create and maintain FOSS. A  bill for such a credit has been introduced in the New York State Assembly every legislative session since 2009 but has never made it out of committee. If passed, this bill would provide a $200 tax credit for expenses related to FOSS development, which would help incentivize more individuals to contribute, likely leading to spillover benefits for the state of New York similar to those from the French procurement regulation.\n All three of these levers for FOSS—direct funding, procurement regulation, and tax incentives—should be included in the next infrastructure bill.\n Although the $1.5 trillion  infrastructure bill recently passed by the House of Representatives includes $100 billion for increasing access to broadband in underserved communities, that only solves the problem of today—it does not lay the groundwork to solve the problems of tomorrow. Our work through the  Core Infrastructure Initiative, a joint project between Harvard’s Laboratory for Innovation Science and the Linux Foundation, has shown there are significant vulnerabilities in the core infrastructure of the digital economy that, unaddressed, could lead to significant problems down the road. These vulnerabilities include: a heavy reliance on FOSS components that are outdated or not regularly maintained, a lack of both transparency and consistent naming conventions, making it difficult for companies to update their software properly, and a lack of project governance safeguards, which could allow malicious actors to insert backdoors into FOSS projects.\n To understand the magnitude of the vulnerabilities contained in widely deployed open-source code, consider the Heartbleed bug in OpenSSL, which affected nearly  20% of secure websites on the internet. In 2012 a bug was mistakenly introduced into the project’s underlying code. Heartbleed went undiscovered for two years, partly because the project was being maintained by only one full-time engineer and a few part-time volunteers. The Core Infrastructure Initiative was launched in response to Heartbleed, and major technology companies like Google, IBM, Intel, and Microsoft donated millions to better support OpenSSL and other critical FOSS projects. Firms that normally compete against each other realized that FOSS is so critical to the digital economy that they need to  work together to help secure it.\n FOSS projects are too vital to modern commerce and communications to rely on the benevolence of the private sector alone. The federal government also needs to play its part. Future infrastructure bills should also include new funding and incentives for FOSS development and maintenance. For our economy to recover and grow tomorrow, we need to invest in our open-source digital infrastructure today.\n Frank Nagle is an assistant professor of business administration at Harvard Business School.  His research is supported in part by the Linux Foundation.\n Google, IBM, Intel, and Microsoft provide financial support to The Brookings Institution, a nonprofit organization devoted to rigorous, independent, in-depth public policy research.", "posttime": "2020-10-15 23:19:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,软件,应该,invest", "title": "国会应该投资于开源软件", "title_en": "Congress should invest in open-source software", "transed": 1, "url": "https://www.brookings.edu/techstream/why-congress-should-invest-in-open-source-software/", "via": "", "real_tags": ["开源", "软件", "应该", "invest"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029023, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Channable是一个提要处理工具，用户可以在其中定义规则来优化其产品提要。在一个特定的提要中，我们发现处理时间比预期的要长得多。我们开始调查，我们发现的瓶颈来自一个不太可能的地方：文本库。\n在这篇博客文章中，我们描述了瓶颈，并比较了四种不同的解决方案。它伴随着一个小项目，该项目包含下面显示的所有代码的基准。试试看！\n{-#内联切片#-}--|从@Offset@到@Offset+len@Slice的子字符串：：int-&gt；Int-&gt；Text-&gt；Text-&gt；Text Slice Offset len=T.ake len。T.Drop偏移。\n起初，这似乎极不可能。文本库以其性能特征而闻名。此外，提要处理软件运行的算法比上面提到的片1复杂得多。但是，用id替换此函数的主体可将此提要的处理速度加快约30%。为什么这个函数会这么慢呢？\n让我们来看看Take和Drop函数是如何工作的。由于目前为2，文本库使用UTF-16作为其内部表示。在UTF-16中，字符表示为一个或两个16位代码单元。当一个字符占据两个16位代码单元时，第一个称为“高代理”，第二个称为“低代理”3。具体地说，对于文本，这意味着文本数据结构包含一个表示代码点的Word16数组。除此之外，它还包含Offset：：Int和Length：：Int，以指示文本表示数组的哪一部分。这对于我们的切片函数非常方便，因为唯一需要做的就是计算新的偏移量和长度。遗憾的是，基本算术不能用来计算这个新的偏移量和长度。这是因为有些字符占据了数组中的两个条目。相反，偏移量和长度都是通过迭代数组、计算字符而不是代码点来计算的。这使得Take和Drop都是O(N)。尽管如此，可以在不修改底层数组的情况下返回答案，因此它们应该不会那么昂贵。以下是Take和Drop(截至Text-1.2.4.0)4的实现：\nTake：：int-&gt；Text-&gt；Text Take n t@(Text Arr Off Len)|n&lt；=0=空|n&gt；=len=t|否则=Text Arr Off(IterN N T){-#inline[1]Take#-}{-#Rules&#34；Text Take-&gt；FUSED&#34；[~1]for all n Take n t=unstream(S.ake n(流t))&#34；Text Take-&gt；Unfused&#34；[1]for all n T.unstream(S.ake n(Stream T))=Take n t#-}drop：：int-&gt;；text-&gt；text drop n t@(Text Arr Off Len)|n&lt；=0=t|n&gt；=len=空|否则=text arr(off+i)(len-i)，其中i=iterN n t{-#inline[1]drop#-}{-#Rules&#34；text drop-&gt；fused&#34；[~1]for all n T.drop n t=unstream(S.drop n(Stream T))&#34；text drop-&gt；unfuse&#34；[1]for all n T.unstream(S.drop n(流t))=drop n t#-}。\n在这些实现中，我们确实可以看到一些对iterN的调用，修改了偏移量和len，并原封不动地传递底层数组。不过，有一些重写规则，它们会重写成完全不同的内容，然后再重写回来。也许问题出在那里。\n通过重写规则，可以指示GHC用等价但更有效的函数调用替换低效的函数调用。其中一个著名的例子是map f(Map G Xs)可以写成map(Fg)xs。最终结果在语义上是相同的，但是第二个结果只在数据结构上映射一次，从而使其速度更快。有关重写规则的更多信息，请参阅GHC手册。\nData.Text的文档提示了为什么存在这些特定的重写规则：\n此模块中的大多数函数都要进行融合，这意味着此类函数的管道通常最多分配一个文本值。\n为了实现这种融合，还有文本价值的第二种表示，即流。每个受融合影响的函数都有重写规则，这些规则可以与使用Stream而不是文本的替代实现相互转换。根据这些规则的应用方式，编译后的代码可能最终会完全不同。幸运的是，有一些编译器选项可以显示应用了哪些规则(-ddump-Rule-firings)，甚至可以显示它们如何重写代码(-ddump-Rule-rewrite)。这表明应用了三条重要规则：\n激发的规则：Text Drop-&gt；Fused(Data.Text)规则激发的规则：Text Take-&gt；Fused(Data.Text)(许多其他无关的规则)激发的规则：流/非流融合(Data.Text.Internal.Fusion)。\n前两条规则如上所示，第三条规则如下：\n此规则意味着将Stream转换为文本，然后再转换回Stream与仅保留Stream原样相同。之所以可以这样做，是因为流和文本是同一数据的不同表示形式。\n切片偏移量len=\\t-&gt；Take Len(Drop Offset T)--应用规则&#34；text drop-&gt；fused&#34；~\\t-&&gt；Take Len(unstream(S.drop Offset(Stream T)--应用规则&#34；text Take-&gt；fused&#34；~\\t-&&gt；unstream(stream(unstream(S.drop Offset(Stream T)--应用规则&#34；流/流融合&#34；~\\t-&gt；unstream(S.taken len(S.Drop Offset(Stream T)。\n最后，我们有一个表达式将文本转换为Stream，应用Drop和Take的一些Stream变体，然后再次转换回文本。这兑现了融合的承诺：即使管道中有多个更改原始值的操作，也只创建一个新文本。对于许多情况，这将是一种优化，因为它可以消除创建中间副本。然而，对于我们的切片函数，原始实现一开始并不创建中间副本。这里的优化比原始优化效率低得多，因为它创建了一个完全不必要的输入字符串副本。\n现在我们了解了瓶颈的来源，我们可以研究一个解决方案：确保在这种特定情况下不会发生融合。\n在这个问题的内部讨论中，提到了几种解决方案。每个人都以自己的方式处理这个问题。下面列出了它们，并说明了它们解决问题的原因。为了便于访问，这些解决方案的基准结果放在基准repo的readme.md中。\nNoInlineTakeSlice：：int-&gt；Int-&gt；text-&gt；text noInlineTakeSlice Offset len=noInlineTake len。T.drop Offset--禁用Text&#39；的Take的内联{-#NOINLINE noInlineTake#-}noInlineTake：：Int-&gt；Text-&gt；Text noInlineTake=T.Take。\n这将导致编译器无法重写Take函数。具体地说，文本Take-&gt；融合规则在调用点不匹配，因为该函数被赋予了不同的名称，并且它在noInlineTake的定义中也不匹配，因为该规则仅在使用其两个参数调用Take函数时才匹配。\n相反，有两个规则在DROP上触发，即文本DROP-&gt；FUSED和Text DROP-&gT；UNFUSED。重写拖放到流版本，然后再重写回文本版本。请注意，它实际上不会应用这两条规则。\n为什么要这样做，而不是丢弃呢？武断的选择。使用Drop或同时使用Take和Drop执行此操作将具有基本相同的效果。\nSequencedSlice：：int-&gt；Int-&gt；Text-&gt；Text SequencedSlice Offset Limit Text=let！Suffix=T.Drop Offset Text in T.Take Limit Sufix。\n强制求值时，DROP和Take都将被重写为流版本。但是，数据流/非数据流融合规则将无法匹配，因为评估是在两者之间强制进行的。无法合并流，使用文本DROP-&gT；UNFUSED和TEXT Take-&&gt;UNFUSED规则将DROP和Take重写回文本版本。\n{-#OPTIONS_GHC-WNO-OBORANS#-}--取消有关孤立规则sliceWithRule：：int-&gt；Int-&gt；text-&gt；text sliceWithRule Offset Limit=T.Take Limit的警告。T.Drop Offset{-#Rules&#34；Text Take。DROP-&&gt;；UNFUSED&GT；UNFUSED&#34；[1]for all len off t.unstream(S.taken(S.drop off(S.stream t)=T.taken(T.drop off t)#-}。\n此规则与重写Slice函数后创建的特定问题流相匹配，并将其全部返回到原始实现。此解决方案将影响直接或间接导入此模块的所有代码，因此应牢记这一点。\n最后一个解决方案使用内部函数实现略有不同的切片操作版本。为了获得最好的性能，我们作弊：\n重新实现Slice：：int-&gt；Int-&gt；Text-&gt；Text-&gt；Text重新实现切片偏移量len t@(Text.Internal.Text u16data off prevLen)|offset2&gt；=prevLen=Text.Internal.Empty|len2&lt；=0=Text.Internal.Empty|Also=Text.Unsafe.takWord16 len2$Text.Unsafe.dropWord16 offset2 t其中offset1=min premisLen$max 0 Offset len1=min(PrevLen-Offset1)$max 0 len offset2=if isLowSurrogate offset1则offset1+1否则offset1 len2=if isHighSurrogate(offset2+len1-1)则len1-1其他len1--|返回给定索引处的代码单元是否启动代理项对。--在有效的UTF-16中，这样的代码单元后面必须跟一个低代理。IsHighSurrogate：：int-&gt；Bool isHighSurrogate！i=let w=Text.Array.unsafeIndex u16data(off+i)in i&gt；=0&amp；&amp；i&lt；prevLen&amp；&amp；w&gt；=0xd800&amp；&amp；w&lt；=0xdbff--|返回给定索引处的代码单元是否结束代理项对。--在有效的UTF-16中，这样的代码单元前面必须有高替代项。IsLowSurrogate：：int-&gt；Bool isLowSurrogate！i=let w=Text.Array.unsafeIndex u16data(off+i)in I&gt；=0&amp；&amp；i&lt；prevLen&amp；&amp；w&gt；=0xdc00&amp；&amp；w&lt；=0xdfff；\n如前所述，由于UTF-16编码，字符占据底层数组中的一个或两个条目。此实现基本上忽略了这一点，并计算新的偏移量和长度，而无需迭代数组来正确计算字符。它假设所有字符只占用一个字16。该假设使该实现成为O(1)而不是O(N)。不过，它确实确保了至少不会在高和低代理之间进行切割，因为那样会创建无效的UTF-16。\n认为底层数组每个字符包含一个Word16字的假设是明显错误的。尽管如此，还是有一些理由需要认真考虑这一实施。除了速度之外，这种实现更接近于许多常见编程语言(如Java和C#)的子字符串操作。虽然指责其他编程语言几乎不是借口，但当必须与第三方程序或服务交互时，它可能成为一个合理的论据。这是因为在这种情况下，匹配不良行为可能比拥有正确的行为更重要。\n幸运的是，最常用的字符是基本多语言平面(BMP)，它占用一个单词16。这可能意味着这种实现在实践中可能不会有太大的不同。在它确实起作用的地方，弦被比应有的更早和更短地切断。虽然不是很理想，但对于我们的特定用例来说可能已经足够了。\n下面是基准测试结果的图表。基准的来源可以在这里找到。请注意，Y轴是对数的。这是因为naiveSlice的值与其他函数的值相差很大。\n作为唯一的恒定时间实现，reimplementedSlice轻而易举地击败了基准测试中的所有其他实现。尽管如此，我们还是没有选择这个实现。事实证明，在我们的现实世界中，所有解决方案之间的性能差异可以忽略不计。基准测试中显示的重新实现的Slice的巨大收益在存在其他瓶颈的情况下丢失了。此外，在生产中使用之前，重新实现Slice需要做大量的工作：测试错误，测量对客户的实际影响，更不用说在文本库更改其实现时的未来工作。这种工作量，再加上它不会产生真正的性能差异的知识，使得它的不正确实现不可能得到辩护。\n选择权落到了另外三个人身上。NoInlineTake、SequencedSlice和sliceWithRule在基准测试中的表现都非常相似。然后排除了sliceWithRule解决方案，因为它的重写规则规则将影响直接或间接导入包含文件的任何内容。虽然这可能会使其他代码变得更快，但具体何时发生就变得不清楚了，特别是当包含规则的文件是几个导入的时候。最好将此规则放在文本库本身中，它将始终出现在文本所在的任何位置。\n后两种解决方案很难选择，尽管在基准测试中，noInlineTake比SequencedSlice略有优势。这种轻微的优势可能没有任何意义，因为它可以归因于这个特定的基准是如何编制的5。不过，它允许我们决定获胜者。所以，noInlineTake就是这样。\n总体而言，这一经历提醒我们，瓶颈可以在不太可能的地方找到。不过，更值得注意的是，您在查找函数时看到的函数的实现不一定是最终出现在编译程序中的实现。重写规则的存在应该会提醒查看者进行更深入的调查。最后，并不是所有的优化都能使代码更快。有时，在边缘情况下，它们最终会造成伤害。\n此问题的真正解决方案是将sliceWithRule中显示的规则逆流到文本库。可以在Haskell/text存储库中找到此更改的拉取请求。由于子字符串操作可能相当常见，因此这种特殊的优化可能会对许多项目有利。也许还有其他功能组合可以从类似的规则中受益。我们期待着进行那次讨论。\n他说：其中一个算法是Alfred-Margaret，早些时候的一篇博客文章中提到的Aho-Corasick的实现。↩︎。\n他说：文本图书馆的黑客页面说，关于改用UTF-8作为内部表示法的调查正在进行中。↩︎。\n他说：为了简洁起见，这个解释很简单。要更全面地解释Unicode和UTF编码，我建议到处阅读UTF-8。↩︎\n4：代码按照其许可在此处复制，托管在GitHub的Haskell/text下。↩︎。\n5：在编写基准时，我们遇到了GHC问题，该问题已通过Package.yaml中的标志解决。这里使用的微基准测试受到编译器实现细节细微差别的影响。↩︎", "note_en": "Channable is a feed processing tool where users can define rules to optimize their product feeds. In one particular feed, we found that processing took much longer than expected. We set out to investigate, and the bottleneck we found came from an unlikely place: the   text library.\n In this blog post we describe the bottleneck and compare four different solutions. It is accompanied by a small project that contains benchmarks for all code shown below.  Try it out!\n   {-# INLINE slice #-}   -- | Substring from @offset@ to @offset + len@   slice ::  Int  -&gt;  Int  -&gt;  Text  -&gt;  Text  slice offset len  = T.take len  . T.drop offset\n At first this seemed highly unlikely. The  text library is known for its performance characteristics. Besides, the feed processing software runs much more complicated algorithms than the above mentioned slice  1. Yet, replacing the body of this function with  id sped up the processing of this feed by about 30%. Why would this function be so slow?\n  Let’s take a look at how the  take and  drop functions work. As it currently stands  2, the  text library uses UTF-16 as its internal representation. In UTF-16, a character is represented as either one or two 16-bit code units. When a character takes up two 16-bit code units, the first one is called a “high surrogate”, and the second one is called a “low surrogate”  3. For  text specifically, this means that the  Text data structure holds an array of  Word16 representing code points. Besides that it holds an  offset :: Int and a  length :: Int, to indicate which part of the array is represented by the  Text. This is very convenient for our slice function, for the only thing that needs to happen is to calculate the new  offset and  length. Sadly, basic arithmetic cannot be used to calculate this new  offset and  length. This is because some characters take up two entries in the array. Instead, both  offset and  length are calculated by iterating over the array, counting characters rather than code points. This makes both  take and  drop O(n). Still, an answer can be returned without modifying the underlying array, so they should not be  that expensive. Below are the implementations of  take and  drop (as of   text-1.2.4.0)  4:\n take  ::  Int  -&gt;  Text  -&gt;  Text   take n t @( Text arr off len)    | n  &lt;=  0  = empty    | n  &gt;= len  = t    |  otherwise  = text arr off (iterN n t)   {-# INLINE [1] take #-}     {-# RULES   &#34;TEXT take -&gt; fused&#34; [~1] forall n t.    take n t = unstream (S.take n (stream t))   &#34;TEXT take -&gt; unfused&#34; [1] forall n t.    unstream (S.take n (stream t)) = take n t    #-}     drop  ::  Int  -&gt;  Text  -&gt;  Text   drop n t @( Text arr off len)    | n  &lt;=  0  = t    | n  &gt;= len  = empty    |  otherwise  = text arr (off +i) (len -i)    where i  = iterN n t   {-# INLINE [1] drop #-}     {-# RULES   &#34;TEXT drop -&gt; fused&#34; [~1] forall n t.    drop n t = unstream (S.drop n (stream t))   &#34;TEXT drop -&gt; unfused&#34; [1] forall n t.    unstream (S.drop n (stream t)) = drop n t    #-}\n In these implementations we can indeed see some calls to  iterN, modifying the  offset and  len, and passing the underlying array unchanged. There are some rewrite rules, though, and they rewrite to something completely different, and then back again. Perhaps the problem lies there.\n  With rewrite rules, GHC can be instructed to replace inefficient function calls with equivalent, but more efficient ones. One famous example of this is that  map f (map g xs) can be written as  map (f.g) xs. The end result is semantically the same, but the second one only maps over the data structure once, making it faster. More info on rewrite rules can be found in the  GHC manual.\n The  documentation of  Data.Text give a hint as to why these specific rewrite rules exist:\n Most of the functions in this module are subject to fusion, meaning that a pipeline of such functions will usually allocate at most one Text value.\n To realize this fusion, there is a second representation of text values, namely  Stream. Every function that is subject to fusion has rewrite rules that convert to and from an alternative implementation that uses  Stream instead of  Text. Depending on how these rules are applied, the compiled code might end up being completely different. Luckily, there are some compiler options that show which rules are being applied (  -ddump-rule-firings), and even how they rewrite the code (  -ddump-rule-rewrites). This shows that there are three important rules being applied:\n Rule fired: TEXT drop -&gt; fused (Data.Text)Rule fired: TEXT take -&gt; fused (Data.Text)(lots of other, unrelated rules)Rule fired: STREAM stream/unstream fusion (Data.Text.Internal.Fusion)\n The first two rules are the ones shown above, the third rule is as follows:\n  This rule means that converting a  Stream to  Text and then back to  Stream again is the same as just leaving the  Stream as is. This can be done because  Stream and  Text are different representations of the same data.\n  slice offset len    = \\t  -&gt;  take len ( drop offset t)    -- Applying rule &#34;TEXT drop -&gt; fused&#34;    ~ \\t  -&gt;  take len (unstream (S.drop offset (stream t)))    -- Applying rule &#34;TEXT take -&gt; fused&#34;    ~ \\t  -&gt; unstream (S.take len (stream (unstream (S.drop offset (stream t)))))    -- Applying rule &#34;STREAM stream/unstream fusion&#34;    ~ \\t  -&gt; unstream (S.take len (S.drop offset (stream t)))\n In the end we have an expression that converts the  Text to  Stream, applies some  Stream variants of  drop and  take, and then converts back to  Text again. This delivers on the promise of fusion: only a single new  Text is created, even though there are multiple operations in the pipeline that alter the original value. For many situations this would be an optimization, as it can eliminate the creation of intermediate copies. For our  slice function, however, the original implementation doesn’t create intermediate copies in the first place. The optimization here is significantly more inefficient than the original because it creates a completely unnecessary copy of the input string.\n Now that we understand the source of the bottleneck, we can work on a solution: making sure fusion does not happen in this particular case.\n  In the internal discussion of this issue, several solutions were mentioned. Each tackles the issue in their own way. They are listed below, with a description as to why they solve the problem. For easy access, the benchmark results of these solutions are placed in the benchmark repo’s  README.md\n   noInlineTakeSlice ::  Int  -&gt;  Int  -&gt;  Text  -&gt;  Text  noInlineTakeSlice offset len  = noInlineTake len  . T.drop offset     -- Disable inlining for Text&#39;s take   {-# NOINLINE noInlineTake #-}   noInlineTake ::  Int  -&gt;  Text  -&gt;  Text  noInlineTake  = T.take\n This will cause the compiler to fail to rewrite the  take function. Specifically, the  TEXT take -&gt; fused rule fails to match at the call site because the function is given a different name, and it fails to match in the definition of  noInlineTake because the rule only matches when the  take function is called with its two arguments.\n Instead, two rules fire on  drop, namely  TEXT drop -&gt; fused and  TEXT drop -&gt; unfused. Rewriting  drop to the  Stream version, and then back to the  Text version. Note that it does  not actually apply those two rules to  take.\n Why do this with  take and not  drop? Arbitrary choice. Doing this with  drop or both  take and  drop would have essentially had the same effect.\n   sequencedSlice ::  Int  -&gt;  Int  -&gt;  Text  -&gt;  Text  sequencedSlice offset limit text  =    let    !suffix  = T.drop offset text    in   T.take limit suffix\n When forcing evaluation, both  drop and  take will be rewritten to the  Stream version. However, the  STREAM stream/unstream fusion rule will fail to match, because the evaluation is forced in between. Unable to combine the streams, both  drop and  take are rewritten back to the  Text version using the  TEXT drop -&gt; unfused and  TEXT take -&gt; unfused rules.\n   {-# OPTIONS_GHC -Wno-orphans #-}  -- Suppress warning about orphan rule     sliceWithRule ::  Int  -&gt;  Int  -&gt;  Text  -&gt;  Text  sliceWithRule offset limit  = T.take limit  . T.drop offset     {-# RULES   &#34;TEXT take . drop -&gt; unfused&#34; [1] forall len off t.    S.unstream (S.take len (S.drop off (S.stream t))) = T.take len (T.drop off t)    #-}\n This rule matches on the specific problematic  Stream created after rewriting the  slice function, and turns it all back to the original implementation. This solution will affect all code that either directly or indirectly imports this module, so that should be kept in mind.\n  The last solution implements a slightly different version of the slice operation using internal functions. To get the most performance, we cheat:\n reimplementedSlice ::  Int  -&gt;  Int  -&gt;  Text  -&gt;  Text  reimplementedSlice offset len t @( Text.Internal.Text u16data off prevLen)    | offset2  &gt;= prevLen  = Text.Internal.empty    | len2  &lt;=  0  = Text.Internal.empty    |  otherwise  = Text.Unsafe.takeWord16 len2  $ Text.Unsafe.dropWord16 offset2 t    where   offset1  =  min prevLen  $  max  0 offset   len1  =  min (prevLen  - offset1)  $  max  0 len     offset2  =  if isLowSurrogate offset1  then offset1  +  1  else offset1   len2  =  if isHighSurrogate (offset2  + len1  -  1)  then len1  -  1  else len1      -- | Return whether the code unit at the given index starts a surrogate pair.    -- Such a code unit must be followed by a low surrogate in valid UTF-16.    isHighSurrogate ::  Int  -&gt;  Bool   isHighSurrogate  !i  =    let   w  = Text.Array.unsafeIndex u16data (off  + i)    in   i  &gt;=  0  &amp;&amp; i  &lt; prevLen  &amp;&amp; w  &gt;=  0xd800  &amp;&amp; w  &lt;=  0xdbff      -- | Return whether the code unit at the given index ends a surrogate pair.    -- Such a code unit must be preceded by a high surrogate in valid UTF-16.    isLowSurrogate ::  Int  -&gt;  Bool   isLowSurrogate  !i  =    let   w  = Text.Array.unsafeIndex u16data (off  + i)    in   i  &gt;=  0  &amp;&amp; i  &lt; prevLen  &amp;&amp; w  &gt;=  0xdc00  &amp;&amp; w  &lt;=  0xdfff\n As said earlier, characters take up either one or two entries in the underlying array because of the UTF-16 encoding. This implementation mostly ignores that and calculates a new  offset and  length without iterating over the array to properly count characters. It assumes that all characters take up only one  Word16. That assumption makes this implementation O(1) rather than O(n). It does make sure to at least not cut between a high and low surrogate, though, as that would create invalid UTF-16.\n The assumption that the underlying array holds one  Word16 per character is blatantly wrong. Still, there are some reasons to seriously consider this implementation. Besides speed, this implementation is closer to the substring operation of many common programming languages, such as  Java and C#. While pointing at other programming languages is hardly an excuse, it could become a reasonable argument when having to interface with third party programs or services. This is because in such cases, matching bad behavior could be more important than having correct behavior.\n Luckily, most commonly used characters are in the Basic Multilingual Plane ( BMP), which take up a single  Word16. This could mean that this implementation may not make much of a difference in practice. Where it does make a difference, strings are cut earlier and shorter than they should be. While not ideal, it may be sufficient for our particular use case.\n  Below is a graph of the benchmark results. The source of the benchmark can be found  here. Note that the Y-axis is logarithmic. This is because of the large difference between the values of  naiveSlice and that of the other functions.\n   As the only constant time implementation,  reimplementedSlice handily beats all other implementations in the benchmark. Still, we did not choose for this implementation. It turns out that in our real world situation, the performance difference among all solutions is negligible. The tremendous gains of  reimplementedSlice shown in the benchmark are lost in the presence of other bottlenecks. Besides,  reimplementedSlice demands a significant amount of work before use in production: testing for bugs, measuring actual effects on customers, not to mention future work when the  text library changes its implementation. This amount of effort combined with the knowledge that it does not make a real performance difference makes its incorrect implementation impossible to defend.\n The choice came down to the other three. The  noInlineTake,  sequencedSlice and  sliceWithRule all performed very similarly in the benchmark. The  sliceWithRule solution was then ruled out as its rewrite rule rule will affect anything that imports the containing file directly or indirectly. While this may make other code faster, it becomes unclear when exactly this happens, especially when the file containing the rule is several imports down the line. It is better to have this rule in the  text library itself, where it would always be present wherever  Text is.\n The last two solutions are hard to pick from, though  noInlineTake has a slight edge over  sequencedSlice in the benchmark. This slight edge may not mean anything, as it could be attributed to how this particular benchmark was compiled  5. Still, it allowed us to decide upon the winner. So,  noInlineTake it is.\n  Overall, this experience has reminded us that bottlenecks can be found in unlikely places. More remarkable, though, is that the implementation of a function you see when looking it up is not necessarily the implementation that ends up in the compiled program. The presence of rewrite rules should alert the viewer to investigate deeper. Lastly, not all optimizations always make code faster. Sometimes there are edge cases where they end up causing harm.\n The real solution to this problem is to upstream the rule shown in  sliceWithRule to the  text library. A pull request for this change can be found at the  haskell/text repository. Since substring operations can be quite common, this particular optimization could prove beneficial for many projects. Perhaps there are other combinations of functions that would benefit from similar rules. We look forward to having that discussion.\n  1: One of these algorithms is Alfred-Margaret, an implementation of Aho-Corasick mentioned in an  earlier blog post.  ↩︎\n 2: The  hackage page of the  text library says that an investigation is ongoing about switching to UTF-8 for its internal representation.  ↩︎\n 3: For the sake of brevity, this explanation is minimal. For a more thorough explanation of Unicode and the UTF encodings I recommend reading  UTF-8 Everywhere.  ↩︎\n 4: The code is reproduced here in accordance with its license, hosted on GitHub under  haskell/text.  ↩︎\n 5: While writing the benchmark we hit this  ghc issue, which was solved with a flag in  package.yaml. Microbenchmarks like the one used here are affected by nuanced implementation details of the compiler.  ↩︎", "posttime": "2020-10-15 23:18:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "文本库,haskell,规则", "title": "Haskell文本库的瓶颈", "title_en": "Bottlenecked on Haskell's Text Library", "transed": 1, "url": "https://tech.channable.com/posts/2020-10-15-bottlenecked-on-haskells-text.html", "via": "", "real_tags": ["文本库", "haskell", "规则"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029022, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "否则，我们的路径必须使用图中所示的其中一条紫色边。此外，由于路径(和循环)不能重复顶点，因此一旦使用了这些紫色边中的一条，其他边就不能使用了，因为否则我们将返回顶点$u$。这是被禁止的。所以我们可以去掉紫色的边，然后对于每个红色的顶点，我们计算从那里到$v$的路径数。因此，让我们获得紫色边列表，并删除它们：对于紫色边中的边，如果e[0]==u或e[1]==u，则紫色边=[e for e in graph_edges if e[0]==u或e[1]==u]：del graph_edge[edge]。\n然后我们就会得到红色顶点的列表。如果e[0]==u]，则对于紫色边缘中的e，红色顶点=[e[1]；如果e[1]==u，则对于紫色边缘中的e，红色顶点=[e[1])。\n从$u$到$v$的路径总数是从红色顶点到$v$的路径总数。因此，我们通过递归调用相同例程来求和：最后，我们将所有这些边放回原处，并返回我们的结果：def count_path(graph_edges，u，V)：if u==v：对于紫色边缘中的边，如果e[0]==u或e[1]==u，则返回1紫色边缘=[e对于graph_edges中的e，或者e[1]==u]。对于紫色边缘中的e，如果e[0]==u，则返回1紫色边缘中的e；如果e[1]==u，则返回1紫色边缘中的e；对于red_vertex中的red_vertex，如果e[1]=u，则返回[e[0]；对于red_vertex中的red_vertex，总计=0；对于red_vertex中的red_vertex，总计+=count_path(graph_edges，red_vertex，V)对于紫色边缘中的边：GRAPH_EDGES[EDGE]=1返回totaldef COUNT_COUNDS(GRAPH_EDGES)：如果不是GRAPE_EDGES：返回0 SELECTED_EDGE=CHOOSE_EDGE(GRAPH_EDGES)del GRAPH_EDGE[SELECTED_EDGE]Cycle_Without=COUNT_CORLES(GRAPH_EDGE)u，v=vertices_of_edge(SELECTED_EDGE)CYCLES_WITH=count_path(graph_Edges，u，v)graph_Edgees[SELECTED_EDGE]=1返回COUNT_PAT", "note_en": "Otherwise our path must use one of the purple edges shown here onthe diagram. Further, since paths (and cycles) can&#39;t repeat a vertex,once one of these purple edges is used, the other ones can&#39;t be usedbecause otherwise we would be returning to vertex $u$. Which isforbidden. So we can remove the purple edges, and for each of the red verticeswe then count the number of paths from that to $v$. So let&#39;s get our list of purple edges, and remove them: purple_edges = [ e for e in graph_edges if e[0]==u or e[1]==u ] for edge in purple_edges: del graph_edges[ edge ]\n  Then we get our list of red vertices. red_vertices = [ e[1] for e in purple_edges if e[0]==u ] + [ e[0] for e in purple_edges if e[1]==u ]\n  The total number of paths from $u$ to $v$ is the total number ofpaths from the red vertices to $v$. So we take that total by arecursive call to this same routine: Finally, we put all those edges back, and return our result: def count_paths( graph_edges, u, v ): if u == v: return 1 purple_edges = [ e for e in graph_edges if e[0]==u or e[1]==u ] for edge in purple_edges: del graph_edges[ edge ] red_vertices = [ e[1] for e in purple_edges if e[0]==u ] + [ e[0] for e in purple_edges if e[1]==u ] total = 0 for red_vertex in red_vertices: total += count_paths( graph_edges, red_vertex, v ) for edge in purple_edges: graph_edges[ edge ] = 1 return totaldef count_cycles( graph_edges ): if not graph_edges: return 0 selected_edge = choose_edge( graph_edges ) del graph_edges[ selected_edge ] cycles_without = count_cycles( graph_edges ) u, v = vertices_of_edge( selected_edge ) cycles_with = count_paths( graph_edges, u, v ) graph_edges[ selected_edge ] = 1 return cycles_without + cycles_with", "posttime": "2020-10-15 23:18:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "递归,recursion,count", "title": "再谈递归", "title_en": "Recursion Revisited", "transed": 1, "url": "https://www.solipsys.co.uk/new/RecursionRevisited.html?tj15lo", "via": "", "real_tags": ["递归", "recursion", "count"]}, {"category": "", "categoryclass": "", "imagename": "9d6e052f1fc19fee59374745101a3f05.jpg", "infoid": 1029017, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你想评估微软对其即将推出的Xbox Series X游戏机的信心，那就从该公司三周前给我们的游戏机开始吧……。并且没有在这里逗留，看看我们将如何处理它。\n这不是尖端硬件预览版的工作方式。应该有多天的活动！还有公司经理！还有手指三明治！但最重要的是，在更换新硬件或解决潜在批评者可能出错的那一刻故障方面，制造商应该掌握控制权。在这样的活动中，工作人员不妨穿上写着“我们还在努力解决问题”的衬衫。\n显然，大规模的面对面活动并没有发生在今年。那么，作为游戏机行业的失败者，为了让人们相信你的500美元游戏机比其他500美元的游戏机更好，你会做些什么呢？显然，微软的答案之一就是开着一卡车标有Xbox Series X的原型游戏机，比我们预想的要早得多。\n今天，在写了几篇预备文章之后，我终于获准预览我想要的任何关于游戏机的东西。(不是复习，&#34；&#34；预览。&#34；)", "note_en": "If you&#39;d like to estimate Microsoft&#39;s confidence in its upcoming Xbox Series X console, start with the fact that  the company gave us a console three weeks ago... and didn&#39;t hang around to see what we&#39;d do with it.\n That&#39;s not how cutting-edge hardware previews tend to work. There are supposed to be multiday events! And corporate handlers! And finger sandwiches! But mostly, there&#39;s supposed to be  control on the manufacturer&#39;s part, in terms of swapping in new hardware or addressing failures the moment something might go wrong for a prospective critic. At such events, staffers may as well wear shirts that read, &#34;We&#39;re still working the kinks out on that.&#34;\n Obviously, the massive, in-person events didn&#39;t happen this year. So what do you do as the industry&#39;s game-console underdog in order to convince people that your $500 console is better than the other $500 console? One of Microsoft&#39;s answers, apparently, was to drive a truck full of &#34;PROTOTYPE&#34;-labeled Xbox Series X consoles to critics&#39; homes  far earlier than we expected.\n Today, after a few preliminary articles, I&#39;ve finally been given the go-ahead to preview anything about the console that I want. (Not &#34;review,&#34; &#34;preview.&#34;)", "posttime": "2020-10-15 23:02:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,限制,series,游戏机", "title": "Xbox系列X发布：我们的无限制预览", "title_en": "Xbox Series X unleashed: Our unrestricted preview", "transed": 1, "url": "https://arstechnica.com/gaming/2020/10/xbox-series-x-unleashed-our-unrestricted-preview/", "via": "", "real_tags": ["发布", "限制", "series", "游戏机"]}, {"category": "", "categoryclass": "", "imagename": "97c177536cfe326345e7e48af5195d7e.jpg", "infoid": 1029016, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Theranos的创始人伊丽莎白·霍姆斯(Elizabeth Holmes)将她的刑事起诉书和指控抛到了墙上，看她是否能让自己的指控落空，但这些指控都站不住脚。\n这位斯坦福大学(Stanford University)辍学生被控在她已经倒闭的帕洛阿尔托(Palo Alto)血液测试初创公司上犯有十几项重罪欺诈。8月下旬，她向圣何塞的美国地区法院提出了六项动议，寻求撤销起诉和指控。\n周二，法官爱德华·达维拉(Edward Davila)否认了所有这些指控，为定于3月开始的审判铺平了道路。\n霍姆斯声称，由于联邦检察官不合理地推迟了两份起诉书，她获得快速审判的权利受到了侵犯，戴维拉发现，拖延的大部分原因是她的法律团队要求在审判前有更多时间，冠状病毒大流行随后将这一日期推后了更远的未来。\n达维拉指出，福尔摩斯的律师辩称，举行一场关于十多年前事件的审判意味着证人可能无法找到，或者记忆褪色，但他们的论点“过于含糊和投机性”，不足以表明她的权利会受到损害，他写道。\n此外，达维拉写道，这件事很复杂。他写道：“此案涉及两起诈骗阴谋，有多名受害者，两名共同被告，以及大量的发现。”“法院认为，考虑到这种复杂性，延误的时间‘并不算过长’。”\n福尔摩斯的另一项动议认为，应该撤销六项指控，因为后来的两项起诉书扩大了对她的指控，违反了诉讼时效，该法令规定了从被指控的犯罪行为到开始法律行动之间可以经过的时间长度。然而，由于对福尔摩斯的三项起诉书中的指控“基本相同”，戴维拉否决了这项动议。\n第三项关于诉讼时效的类似主张的动议也以类似的理由失败。此外，霍姆斯提出的驳回她最近的两项起诉书的动议，理由是在扩大投资者的定义时，它们变得不允许的模糊，也未能说服达维拉。他写道：“法院不相信‘投资者’的定义有任何扩展。”\n2003年创立Theranos的霍姆斯被指控诈骗投资者数亿美元，并谎称该公司的机器只需几滴血就可以进行全方位的测试，并欺骗患者。她和她的共同被告，前公司总裁桑尼·巴尔瓦尼(Sunny Balwani)否认了这些指控。\n达维拉驳回的另外两项动议辩称，福尔摩斯的一些指控相互重复，最近的起诉违反了达维拉之前的决定，而其余的动议则重复了他之前裁定反对的指控。\n霍姆斯可能面临20年监禁，最高275万美元的罚款，并可能向政府声称损失超过7亿美元的投资者赔偿。联邦政府表示，如果她被判有罪，将追查她可能拥有的任何非法所得或资产。另一起民事案件的原告正在寻求未指明的损害赔偿。", "note_en": "Theranos founder Elizabeth Holmes threw her criminal indictments and charges against the wall to see if she could get any to fall away, but they all stuck.\n The Stanford University dropout, charged with a dozen felony counts of fraud over her defunct Palo Alto blood-testing startup, filed six motions in U.S. District Court in San Jose in late August, seeking to have indictments and charges thrown out.\n On Tuesday, Judge Edward Davila denied all of them, paving the way for a trial scheduled to begin in March.\n To Holmes’ claim that her right to a speedy trial had been violated because federal prosecutors unreasonably delayed filing two indictments, Davila found the bulk of the delay resulted from her legal team’s request for more time before trial, with the coronavirus pandemic subsequently pushing that date further into the future.\n  Holmes’ lawyers had argued that holding a trial concerning events going back more than a decade means witnesses could be unavailable or have fading memories, Davila noted, but their argument was “too vague and speculative” to indicate her rights would be harmed, he wrote.\n Also, Davila wrote, the matter is complex. “The case involves two fraud conspiracies with multiple victims, two co-defendants, and voluminous discovery,” he wrote. “The Court finds that the length of the delay was ‘not excessive’ in light of this complexity.”\n Another Holmes motion argued that a half-dozen charges should be thrown out because two later indictments broadened the charges against her, violating the statute of limitations, which governs the length of time that can pass between an alleged offense and the start of legal action. Because the charges in all three indictments against Holmes are “substantially the same,” however, Davila nixed the motion.\n A third motion making similar claims about the statute of limitations failed on similar grounds. And Holmes’ motion to dismiss her two most-recent indictments, on the basis that in expanding the definition of investors they became impermissibly vague, also failed to convince Davila. “The Court is not persuaded that there has been any expansion in the definition of ‘investors,&#39;” he wrote.\n Holmes, who founded Theranos in 2003, is charged with allegedly bilking investors out of hundreds of millions of dollars, and defrauding patients with false claims that the company’s machines could conduct a full range of tests using just a few drops of blood. She and her co-accused, former company president Sunny Balwani, have denied the allegations.\n  Two other motions Davila rejected argued that some of Holmes’ charges duplicated each other and that the recent indictments violated a previous decision by Davila, while the remaining motion repeated previous claims he had ruled against.\n Holmes faces a potential 20-year prison sentence, up to $2.75 million in fines, and possible restitution to investors the government alleges lost more than $700 million. The federal government has said that if she’s found guilty, it will go after any ill-gotten money or assets she may have. Plaintiffs in a separate civil case are seeking unspecified damages.", "posttime": "2020-10-15 23:02:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "创始人,founder,指控", "title": "Theranos创始人伊丽莎白·霍姆斯(Elizabeth Holmes)零星出价否决指控", "title_en": "Theranos founder Elizabeth Holmes’ scattershot bid to nix charges goes down hard", "transed": 1, "url": "https://www.mercurynews.com/2020/10/14/theranos-founder-elizabeth-holmes-scattershot-bid-to-nix-charges-goes-down-hard/", "via": "", "real_tags": ["创始人", "founder", "指控"]}, {"category": "", "categoryclass": "", "imagename": "1ae892852bb7088ddcc20c0fd3052085.png", "infoid": 1029015, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "距离地球相当近的是西班牙初创公司Hearts Radiant，该公司表示，它从事的是“长寿科技”业务，但正在采取更脚踏实地、更实际的方法来解决老龄化问题。简而言之，它认为它确定了一个帮助人们活到高龄的公式。\n所以它的登月计划并不是为了帮助人们达到圣经中的150甚至120。这是为了支持老年人生活得很好，达到95局这样的“好局”，同时(希望)通过应用技术来保持他们的独立性和活力，这种技术创造了一种有组织的、引人入胜的生活方式，有助于对抗与年龄相关的疾病，如虚弱和社会孤立。\n今天，这家初创公司将从秘密状态中走出来，披露第一批种子前期资金，并与TechCrunch谈论其支持老年人过上更积极、更有成就感和更独立生活的梦想。\n由JME.vc牵头，Kfund、SeedCamp和NextVentures参与的欧元45万种子前一轮将用于研究和继续开发其最新的Rosita Longevity数字教练。自1月份以来，这款应用一直在进行有限的Beta测试-目前仅适用于Android设备，因为老年人往往拥有亲戚用过的二手智能手机硬件(但iOS正在规划中)-为其目标人群提供直播和点播视频课程，如有氧弗拉门戈和适合年龄的瑜伽。\nRosita的联合创始人是夫妻团队，首席执行官胡安·卡塔赫纳(Juan Cartagena)和首席运营官克拉拉·费尔南德斯(Clara Fernández)，以及首席技术官大卫·吉尔(David Gil)。他们的前提是，随着年龄的增长，人类真正需要的是尽可能长时间保持活跃的指导和动力-数字平台是为老年人广泛提供个性化的“健康习惯”形成疗法的最佳方式。\n“我们相信我们必须成为一个习惯引擎，”卡塔赫纳说，并提供“健康长寿”作为他们目标实现的范围的另一个描述符。\n费尔南德斯直接利用了她在Balneario de Cofrentes担任首席执行官的多年经验，Balneario de Cofrentes是巴伦西亚的一家家族企业，她将其描述为“长寿学校”或老年人夏令营-网站建议将水疗/酒店、物理治疗/康复和教育中心结合在一起。在那里，她一直负责监督为老年人量身定做的活动和教育计划，提供有指导的锻炼和关于避免疾病和良好营养等方面的建议。\n她解释说：“在过去的十年里，我们制定了一个非常全面的战略，关于如何教育，如何在老年人社区中养成习惯，以便他们能够延长自己的健康寿命。”“我们有一套具体的方法。我们从教老年人如何管理他们目前的健康状况开始，我们逐步开始教育他们生活方式，预防主要疾病，以及关于科学领域的最新发现的教育。“\n“我意识到，扩大规模的主要方式是把它放到网上，”她补充道，并决定将该项目打包成一款数字教练应用-“在那里，更大比例的老年人可以受益”。\n生活方式是这一命题的关键部分。但他们最喜欢“长寿科技”的徽章。\n卡塔赫纳补充道：“出于很多原因，我们正在努力不参加体能比赛。”“这在范围上是有限的。我们正在努力超越这一点--这只是(减少脆弱)的起点，以及与此相关的问题，包括最终的‘疾病’，那就是依赖。“。\n由于Rosita应用程序背后的前提是，作为对抗一系列与年龄相关的疾病的手段，定期适度锻炼对健康的好处已经得到证实-比如肌肉质量下降和导致虚弱的骨密度降低(这反过来可能导致摔倒、髋骨骨折，以及突然依赖个人护理的老年人)-除此之外，作为精神和大脑健康的普遍支撑，他们正蹲在既定的(而不是登月的)科学上。\n尽管他们仍然需要证明，通过数字交付的个性化生活方式培训项目-采用熟悉但有时仍然笨重的技术，如人工智能和聊天机器人-实际上可以帮助远程参与的老年人扭转脆弱(首先)，没有人类理疗师在场帮助。\n因此，部分资金将继续研究他们的实体“长寿学校”计划如何转化为一个数字平台。更具体地说，为60岁以上的人提供个性化的数字教练是否会像面对面的集体锻炼一样，切实减少身体虚弱(从而在活跃的年龄段获得收益)。(当然值得密切研究的一个领域是，纯粹的数字体验与面对面的小组治疗相比，源于社交的人际接触是否会对治疗结果产生影响。)。\n诚然，世界上没有一款智能手机能将一个沼泽标准的浴室变成一个完全豪华的水疗中心。但巴尔内里奥计划的其他要素只是需要数字化和结构化，才能提供类似的好处，这是他们的想法。\n他们为这款应用程序设计的各种数字活动程序都是为了给老年人带来乐趣，并为特定的脆弱水平提供有益和合适的服务。目前提供的课程包括减少活动能力的舞蹈、无穿孔的“交叉配合”和骨关节炎安全的空手道。\n入职过程包括一项评估，以确定老年人的脆弱程度，以便向用户提供适合其身体状况的活动水平的内容。\n卡塔赫纳指出，他们正在与巴伦西亚大学(University Of Valencia)教授何塞·维尼亚(JoséViña)博士合作，后者在长寿领域享有盛誉。他已经证明，他可以通过对特定的肌肉应用某种方法，结合一些生活习惯的锻炼-融合-来在最早的阶段恢复虚弱。现在还没有证明的是，这是否适用于人们自己做这件事的偏远环境，“他补充道。“这就是我们现在正在做的事情。这一轮预播基本上是为了抓住这种不确定性，把它放在几千个[APP]用户面前，拿着那个研究…。看看未来12个月我们是否会改善(他们的脆弱程度)。“。\n在这种新型冠状病毒肆虐的一年里，真正的巴尔内里奥目前已经关闭，但计划在2021年3月重新开放-然后向罗西塔介绍每年的摄入量-不断获得关于它是否正在引导他们养成支持健康的习惯的反馈。\n“这一切都是为了更好地理解客户，这才是这家公司真正的竞争优势所在，”卡塔赫纳辩称。“通过每年有1.5万名高年级学生来这所学校，我们每年都非常了解客户，了解他们的习惯，他们做什么，不做什么。他们每年都来，这样我们就可以问他们你去年做了什么？”\n这将是我们拥有一个庞大的焦点小组的方式-比方说一个滑动的焦点小组窗口，我们可以在使用该产品的10天内看到-我们可以更快地重复，因为我们不仅通过我们的分析看到人们，而且看到在我们面前使用该产品的人。我们度假村每天有一百到五百人。我认为这将是我们能够真正建造人们真正需要、使用和关心的东西的根本途径。“。\n目前版本的应用程序还不包括人工智能支持的个性化教练。但这也是种子前期资金的用武之地。卡塔赫纳说：“教育和脆弱行程的初始教练应该在三周内准备好(连同我们的iOS应用程序)。”“这解决了我们用户今天面临的一个紧迫问题。\n“个性化教练(病理、随访、上下文、练习的原子化等)背后有很多逻辑，正确地测试这一点需要更多的时间。我们会慢慢释放这种智慧，到圣诞节时，我们应该会感到“自豪”。这将成为我们习惯的引擎。再加上我们的老年科学研究计划，这些都是我们目前资金使用得当的不确定因素。“。\n瞄准慢性疼痛是这款应用的另一个关键目标，尽管他承认可能有一些类型的疼痛他们无法解决。联合创始人补充说，这款应用程序的目的是补充而不是取代传统的医疗保健-指出它的设计更具前瞻性；也就是说，预防与年龄相关的问题正是让人活得更长的战略。\n“远程医疗更多的是管理疾病--我们更多的是预防，”Fernández补充说。“我们更多的是发现哪些指标和工具来确保老年人口的…。了解他们的身体会发生什么，未来十年会发生什么，然后开始慢慢养成这些习惯，这样他们就可以最大限度地减少进化，减少自然衰老过程。“。\n卡塔赫纳指出，他们还在与研究人员合作开发传感器硬件，这些硬件可以与这款应用配套使用，以增强他们预测脆弱性的能力-这表明这将允许他们定义更广泛/更细微的用户类别(该应用的第一个版本有三个类别，但他表示，他们希望能够提供九个类别)。\n智能手机和传感器硬件与人工智能技术相结合，多年来一直在推动新一代有指导的理疗应用程序，这些应用程序寻求为慢性疼痛的基于药物的管理提供一种替代方案-例如Kaia Health和Hinger Health，仅举两例。当然，正念/引导式调解已经成为一项巨大的应用程序业务。而更广泛的“数字健康”概念，在过去五年左右的时间里，看到了CBT式的治疗项目被打包起来，放在人们的口袋里。因此，为老年人设立长寿教练的想法本身并不奇怪或充满异国情调。\n尽管如此，获得正确的用户体验很可能是最大的挑战。卡塔赫纳表示，这款应用的基调很重要--不想“居高临下”，也不想让老年人觉得罗西塔在给他们“作业”--所以他们真的和虚拟教练打成一片，保持参与。\n费尔南德斯也强调目标是保持好习惯。因此，这是一场(温和的)马拉松，而不是短跑。\n如果他们能设计出一种安全而引人入胜的体验，让老年人不会觉得令人不快、乏味或困惑，那么扩大获得治疗、活动和信息的潜力，从而提高人们的生活质量看起来是巨大的。脆弱性也只是该团队的第一个关注点。随着他们开发产品和增加使用，他们希望能够支持他们的用户形成健康的习惯，这可能有助于延缓神经退行性疾病，如痴呆症。战胜孤独和社会孤立是另一个目标。所以他们希望罗西塔能够提供一系列的医疗计划。\n费尔南德斯说：“我们现在做的是特别关注脆弱问题-我们正在开发个性化的人工智能教练-我们要做的是开始增加我们将在长寿教练的基础上建立的所有不同健康计划的层级，”费尔南德斯说，“我们现在正在做的是特别关注脆弱问题-我们正在开发个性化的人工智能教练-我们要做的是开始在长寿教练的基础上增加所有不同的健康计划的层次。”“营养、认知刺激、放松和呼吸，最重要的是，我们将提供所有的预防策略--以及我们为长寿准备的所有课程。”\n“我们在诊所测试过的一件事非常重要，那就是教育用户。不只是他们今天需要做什么，还有他们的衰老过程正在发生什么，他们的新陈代谢正在发生什么，他们的肌肉骨骼系统正在发生什么。你的身体衰老的方式和原因是最基本的，所以你可以做出小的决定。通过教育增强用户的能力，他们可以理解和理解为什么你今天告诉他们的这件事从长远来看是有用的。“\n她补充说：“我们建立的最成功的策略之一是创建关于长寿的整个课程，这就是你的身体正在发生的事情-今天科学对长寿领域的了解。”“以及如何将这些症状降至最低。我们正在将这些东西完全翻译到(应用程序)中。“。\n卡塔赫纳还指出了新冠肺炎“第四波”死亡的风险，这可能是因为老年人在采取封锁措施并担心接触冠状病毒的风险后变得比其他情况下更加虚弱，从而被迫更久地生活。\n或者，换句话说，坐在家里的沙发上可能有助于老年人远离病毒，但如果突然不活动会危及他们的活力，那也可能缩短他们的健康寿命。因此，帮助老年人保持活力的工具看起来比以往任何时候都更加重要。为此，他表示，这款应用程序将在整个大流行期间保持免费-预计这可能会持续到2022年。\n商业模式的计划是B2C，可能专注于销售优质内容-比如直接将用户与治疗师联系起来，讨论他们的进展。与此同时，他们依赖风险投资将他们的数字“动力引擎”推向市场。\n目前，他们有5000名应用程序的“预注册”，1000名老年人在积极测试这款产品(所有人的年龄都在60岁到80岁之间，在西班牙)。他们还刚刚推出了一项更新，将软件从“早期使用”阶段移出--因为他们正朝着推出“个性化的长寿人工智能教练”迈进。\n虽然罗西塔的教练目前只有西班牙语-到目前为止，该团队已经为不同水平和不同的慢性病录制了“数百个”视频-目标是在欧洲(也许还有更远的地方)扩大规模，从英国市场开始。这使得英语成为他们构建内容的下一个自然语言。", "note_en": "Coming considerably closer to Earth is Spanish startup  Hearts Radiant, which says it’s in the “longevity tech” business but is taking a far more grounded and practical approach to addressing ageing. In short it believes it’s nailed a formula for helping people live to a ripe old age.\n   So its moonshot isn’t to help people get to a biblical 150 or even 120. It’s about supporting seniors to live well, up to a ‘good innings’ like 95, while (hopefully) retaining their independence and vitality through the application of technology that creates a structured and engaging lifestyle routine which works to combat age-related conditions such as frailty and social isolation.\n  The startup is coming out of stealth today to disclose a first tranche of pre-seed funding and chat to TechCrunch about its dream of supporting seniors to live a more active, fulfilling and independent life.\n The €450k pre-seed round, which is led by JME.vc with participation from Kfund, Seedcamp and NextVentures, will be used for research and continued development of its  Rosita Longevity digital coach. The  app has been in beta testing in a limited form since January — currently only for Android devices, given seniors tend to have their relatives’ hand-me-down smartphone hardware (but iOS is on the roadmap) — offering livestreamed and on-demand video classes like cardio flamenco and age-appropriate yoga for its target 60+ year-olds.\n Rosita’s co-founders are husband and wife team, Juan Cartagena (CEO) and Clara Fernández (CCO), along with CTO David Gil. Their premise is that what humans really need, as they age, is guidance and motivation to stay as active as they can, for as long as they can — and that a digital platform is the best way to make personalized, ‘healthy habit’ forming therapy for seniors widely accessible.\n “We believe that we have to be a habit engine,” says Cartagena, offering “health longevity” as another descriptor for the scope of what they’re aiming to achieve.\n Fernández is drawing directly on her years of experience as CEO of  Balneario de Cofrentes, a family business in Valencia, which she describes as a “longevity school” or camp for seniors — and which the website suggests is a combination of spa/hotel, physical therapy/rehabilitation and education center. There she’s been responsible for overseeing activity and education programs tailored to seniors, offering guided exercise and advice on things like disease avoidance and good nutrition.\n “Over the last ten years we have developed a very comprehensive strategy on how to educate, how to create habits in the senior community so that they can increase their healthy lifespan,” she explains. “We have a specific methodology. We start with teaching seniors how to manage their current health situation and we progressively start educating them with lifestyle, prevention of the main diseases, and also education about the latest discoveries in the field of science.”\n “I realized that the main way to expand this was taking it online,” she adds on the decision to package the program into a digital coaching app — “where a bigger percentage of the senior population could benefit”.\n Lifestyle is a key part of the proposition. But they’re most comfortable with the badge of ‘longevity tech’.\n “We are trying not to play in fitness for many reasons,” adds Cartagena. “It’s limited in scope. And we are trying to go beyond that — it’s just the starting point [for reducing frailty] and the issues related to that, including the final ‘disease’ which would be dependence.”\n Since the premise underlying the Rosita app hinges on the proven health benefits of regular, moderate exercise as a means of combating a range of age-related conditions — such as muscle mass loss and reduced bone density leading to frailty (which in turn can lead to a fall, a broken hip, and a senior who’s suddenly dependent on personal care) — or, beyond that, as a general bolster for mental and brain health — they are squatting on established (rather than moonshotty) science.\n Although they do still need to demonstrate that digitally delivered, personalized programs of lifestyle coaching — featuring familiar but still sometimes clunky technologies like AI and chatbots — can  actually help reverse frailty (in the first instance) for seniors participating remotely, with no human physiotherapists on hand to help.\n  Hence some of the funding will go on researching how their bricks-and-mortar ‘longevity school’ program translates to a digital platform. And, more specifically, whether personalised digital coaching for 60+ year olds will yield tangible reductions in frailty (and thus gains in active years) in the same way that in-person group exercises have already been shown to.  (One area that certainly merits close study is whether social human contact derived from a purely digital experience vs in-person group therapy makes a difference to treatment outcomes.)\n It’s true that no smartphone in the world can transform a bog-standard bathroom into a full on luxury spa. But other elements of the Balneario’s program simply need digitizing and structuring to serve up similar benefits, is the thinking.\n The sorts of digital activity programs they’re devising for the app are designed to be fun for seniors as well as beneficial and appropriate for a particular frailty level. Examples of classes currently offered include reduced mobility dance, burpee-free ‘cross fit’, and osteoarthritis-safe karate.\n The onboarding process involves an assessment to determine a senior’s frailty level in order that users are offered content at an activity level that’s appropriate for their physical condition.\n  Cartagena notes they’re working with  Dr. José Viña, a professor at the University of Valencia, who is renowned in the longevity field. “He has proven he can revert frailty in the earliest stages by applying a certain methodology to specific muscles with a treatment of exercise-fusion — with some lifestyle habits. Now what has  not been proven is whether that is applicable to a remote environment where people do it on their own,” he adds. “And this what we are doing right now. This pre-seed round is basically to take that uncertainty, put that in front of a few thousand [app] users, take that research… and see if in the next 12 months we improve [their frailty level].”\n The actual Balneario is closed at the moment, in this health-stricken year of the novel coronavirus, but the plan is to reopen in March 2021 — and then introduce the annual intake to Rosita — garnering ongoing feedback on whether or not it’s steering them toward health-supporting habits.\n “It’s all about understanding the customer so well and that’s where the competitive advantage of this company really comes from,” argues Cartagena. “By having 15,000 seniors per year coming to the school, every year we understand the customer very well, their habits, what they do, what they don’t. They come every year so we can ask them what did you do last year?\n “That will be for us the way to have a massive focus group — let’s say a sliding window of focus group that we can see for ten days using the product — and we can iterate much faster by seeing not people just through our analytics but people who are using the product in front of us. One hundred or 500 people a day in our resort. And I think that will be a fundamental way in which we can actually build something that people really need and use and care about.”\n The current version of the app doesn’t yet include AI-powered personalized coaching. But that’s again where the pre-seed funding comes in. “The initial coach for education and frailty itineraries should be ready in three weeks (together with our iOS app),” says Cartagena. “This solves a pressing problem our users have today.\n “The personalized coach (pathologies, followups, context, atomization of exercises, etc) has a lot of logic behind and testing this properly will take more time. We will release that intelligence slowly and we should feel ‘proud’ by Christmas. That will become our Habits Engine. Together with our geroscience research plan, those are the uncertainties to get right with our current funding.”\n Targeting chronic pain is another key aim for the app, although he concedes there may be some types of pain they won’t be able to address.  The co-founders add that the app is intended to supplement not replace traditional healthcare — pointing out it’s being designed to be more forward-looking; aka that prevention of age-related problems is exactly the strategy to live better for longer.\n “Telehealth is more about managing a disease — we’re more about preventing,” adds Fernández. “We’re more about discovering what are the indicators and the tools to make sure that the senior population… understand what it happening to their body, what is going to happen over the next ten years and start to slowly develop those habits so that they can minimize, reduce the evolution, the natural ageing process.”\n Cartagena notes they are also working with researchers on developing sensor hardware that could go alongside the app to enhance their ability to predict frailty — suggesting it will allow them to define a wider/more nuanced range of user categories (the first version of the app has three categories but he says they want to be able to offer nine).\n Smartphone and sensor hardware combined with AI technology has, for some years now, been enabling a new generation of guided physical therapy apps that seek to offer an alternative to pharmaceutical-based management for chronic pain — such as  Kaia Health and  Hinge Health, to name two. And of course mindfulness/guided mediation has become  a huge app business. While the broader concept of ‘digital health’ has, over the past half decade or so, seen  CBT-style therapy programs packaged up to be put on tap in people’s pockets. So there’s nothing inherently strange or exotic about the idea of a longevity coach for seniors.\n Albeit, getting the user experience right could well be the biggest challenge. Cartagena says the app’s tone is important — talking in terms of not wanting to be “patronizing” or make seniors feel like Rosita is giving them “homework” — so they really click with the virtual coach and stay engaged.\n Fernández too emphasizes the goal is to sustain good habits. Ergo, this is a (gentle) marathon not a sprint.\n If they can design a safe and engaging experience that seniors don’t find off-putting, tedious or confusing the potential to expand access to therapies, activities and information that can improve people’s quality of life looks huge. Frailty is also only the team’s first focus. As they develop the product and grow usage they want to be able to support their users to form healthy habits that could help stave off neurodegenerative conditions like dementia, for example. Combating loneliness and social isolation is another goal. So there’s a whole range of health plans they’re hoping Rosita will be able to deliver.\n “What we’re doing right now is focused especially on frailty — we’re developing the personalized AI coach on top of that — and what we’re going to do is start adding the layers of all the different health plans that we’re going to be establishing off the longevity coach,” says Fernández. “Nutrition, cognitive stimulation, relaxation and breathing, and on top of that we will put all the prevention strategies — and all the classes that we’re preparing for longevity.\n “One of the things that we have tested in the clinic that is very important is to educate the user. Not just on what they need to do today — but on what is happening to their ageing process, what is happening to their metabolism, what is happening to their musculoskeletal system. How and why your body is ageing is fundamental so you can make small decisions. By empowering users through education they can understand and relate to why this specific thing that you’re telling them today is useful in the long run.”\n “One of the most successful strategies that we have built is creating this whole course on longevity which is what is happening to your body — what science knows today about the field of longevity,” she adds. “And how you can minimize those symptoms. And those things we’re translating completely into the [app].”\n Cartagena also points to the risk of a COVID-19 ‘4th wave’ of deaths that could result from seniors becoming more frail than they otherwise would after being forced into a more sedentary existence as a result of lockdown measures and concerns about their risk of exposure to the coronavirus.\n Or, in other words, sitting at home on the sofa might help seniors stay free of virus but if abrupt inactivity risks their vitality that too could cut short a healthy lifespan. So tools to help older people stay active are looking more important than ever. And to that end he says the app will remain free throughout the pandemic — envisaging that could stretch into 2022.\n The plan for the business model is b2c, likely focused on selling premium content — such as connecting users directly with a therapist to chat through their progress. In the meanwhile they’re relying on VC to get their digital “motivation engine” to market.\n Right now they have 5,000 “pre-registrations” for the app and 1,000 seniors actively testing the product (all aged 60 to 80, in Spain). They’ve also just pushed out an update, moving the software out of the ‘early access’ phase — as they progress toward launching their “personalized AI coach for longevity.”\n And while Rosita’s coaching is currently only available in Spanish — with the team having recorded “hundreds” of videos so far for different levels and chronic pathologies — the aim is to scale up in Europe (and perhaps beyond), starting with the U.K. market. Which makes English the next natural language for them to build out content.", "posttime": "2020-10-15 22:56:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "长寿,longevity,老年人", "title": "\n罗西塔长寿想教老年人如何长寿，健康生活", "title_en": "\n\t\t\t\tRosita Longevity wants to teach seniors how to live long, healthy lives\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/15/rosita-longevity-wants-to-teach-seniors-how-to-live-long-healthy-lives/", "via": "", "real_tags": ["长寿", "longevity", "老年人"]}, {"category": "", "categoryclass": "", "imagename": "c9b73b9e13172086b824f69f73caf72b.jpg", "infoid": 1029014, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然有很多评级服务可以比较你周围的地方，比如Foursquare，Yelp和TripAdvisor，但谷歌地图一直在慢慢地更突出地展示评级。而且，你现在比以往任何时候都更有可能在谷歌地图上查看收视率。\n“我在客户评级方面已经工作了十年。联合创始人兼首席执行官蒂莫西·德·莱特雷(Timothée de Laitre)告诉我，现在正在发生一件大事--“谷歌和谷歌地图正在接管与小商店的客户关系。\n然而，许多小企业主并没有注意到他们的谷歌我的企业评级，客户可以在谷歌地图上和谷歌搜索结果上方看到这些评级。WizVille认为这是您可以跟踪的最重要的指标。了解你的竞争对手的表现也很重要。\n当您将业务添加到WizVille Local Monitor时，公司会显示您周围提供相同产品和服务的其他地方。您最多可以从该列表中选择五名竞争者。\n在此之后，您将收到一份报告，其中包含您的评级、您的竞争对手的评级以及随时间的演变情况。这样一来，你就知道与竞争对手相比你的排名如何了。该服务每月向您发送一份新报告，以便您可以跟踪您的进度。\n谷歌地图的评级真的不是那么聪明，因为该公司正在计算你所有评级的平均值，以确定你的整体评级。你本可以在十天前或十年前开业--你所有的评论都会很重要。\n如果您有多家商店或需要更多功能，您必须切换到全面的WizVille客户体验管理服务，更具体地说是WizVille Local Insight。对于这项服务，这家初创公司与道达尔(Total)、Etam、Naturalia和施密特等更大的客户合作。", "note_en": "While there are plenty of ratings services to compare places around you, such as Foursquare, Yelp and Tripadvisor, Google Maps has slowly been showcasing ratings more prominently. And chances are you’re now checking ratings on Google Maps more than ever before.\n “I’ve been working for ten years in customer ratings. There’s something huge happening right now — Google and Google Maps are taking over the customer relationship with small shops,” co-founder and CEO Timothée de Laitre told me\n  And yet, many small business owners don’t pay attention to their Google My Business rating that customers can see on Google Maps and above Google search results.  WizVille   thinks this is most important metric you can track. And it’s also important to know how your competitors are doing.\n When you add your business to WizVille Local Monitor, the company displays other places around you that provide the same products and services. You can choose up to five competitors from that list.\n After that, you receive a report with your rating, your competitors’ ratings and the evolution over time. This way, you know how you rank compared to your competitors. The service sends you a new report every month so that you can track your progress.\n Google Maps ratings are really not that smart as the company is calculating the average of all your ratings to determine your overall rating. You could have opened your business ten days ago or ten years ago — all your reviews will matter.\n If you have more than one shop or you need more features, you have to switch to the  full-fledged WizVille customer experience management service, and more specifically  WizVille Local Insight. For that service, the startup works with bigger clients, such as Total, Etam, Naturalia and Schmidt.", "posttime": "2020-10-15 22:56:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,local,ratings,评级", "title": "\nWizVille Local Monitor帮助小商店跟踪谷歌地图对竞争对手的评级", "title_en": "\n\t\t\t\tWizVille Local Monitor helps small shops track Google Maps ratings of competitors\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/15/wizville-local-monitor-helps-small-shops-track-google-maps-ratings-of-competitors/", "via": "", "real_tags": ["google", "谷歌", "local", "ratings", "评级"]}, {"category": "", "categoryclass": "", "imagename": "976f04a28f45c909a091fb52dd69c77c.jpg", "infoid": 1029012, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Cochlear.ai宣布，它已经在Smilegate Investment牵头的首轮融资中筹集了200万美元，新韩资本(Shinhan Capital)和NAU IB Capital参与其中。这使其到目前为止的总融资达到270万美元，其中包括这家韩国互联网巨头的投资部门Kakao Ventures的一轮种子融资。Cochlear.ai将在未来18个月利用其A系列招聘，并增加用于训练其深度学习算法的声音数据集。\n该公司成立于2017年，由六名音乐和音频研究科学家组成的团队创立，其中包括韩，他在首尔国立大学完成了音乐信息检索博士学位。在攻读博士学位时，韩发现“每个人都在专注于语音识别系统。这方面的公司很多，但从技术上讲，分析其他类型的声音与语音识别有很大的不同。“。\n语音识别技术通常一次识别一个或两个声音，并假设人们正在进行对话，而不是彼此交谈。它还在后处理中使用语言学知识来提高准确性。但对于音乐或环境噪音，不同类型的声音通常会重叠。\n“我们必须注意所有不同的频率范围，不仅有声音，而且真的有成千上万的声音，”韩说。“因此，我们认为这将是下一代声音识别技术，这也是我们创业的动力所在。”\nCochlear.ai的SaaS名为Cochl.Sense，以云API和EDGE SDK的形式提供，目前可以检测到大约40种不同的声音，分为三类：紧急检测(包括玻璃破碎、尖叫和警报声)、人类互动(包括使用手指、拍手或口哨与硬件交互)和人类状态(用于识别咳嗽、打喷嚏或打鼾等声音，用于患者监护或自动音频字幕等使用情况)。\n韩说，公司还计划为Cochl.Sense增加新的功能，用于家庭(包括智能扬声器)、车辆和音乐分析。Cochl.Sense的灵活性意味着它可能适合许多使用案例，包括通过检测智能扬声器发出的噪音将其变成家用电器的“控制塔”，或者通过向包括智能手表在内的可穿戴设备发送汽车喇叭等噪音警报来帮助听力受损的人。\n韩指出，在过去三年左右的时间里，人们已经从专注于语音识别技术转向了其他声音。\n例如，亚马逊(Amazon)、谷歌(Google)和苹果(Apple)等更多大型科技公司正在为其产品添加上下文感知声音识别功能。例如，Amazon Alexa Guard和Nest Secure都能检测到玻璃破碎的声音，而iOS 14的声音识别功能使其能够添加新的无障碍功能。\n韩表示，各大科技公司的推出对Cochlear.ai来说是一个福音，因为这意味着声音识别技术的市场正在增长。这家初创公司计划与许多不同的行业合作，但目前专注于智能消费设备和汽车，因为这是人们对其软件最感兴趣的领域。例如，Cochlear.ai目前正在与戴姆勒股份公司(Daimler AG)合作一个项目，除了与主要的电子、电信和消费品公司合作外，还将在汽车中加入其声音识别功能(例如，如果儿童被锁在车内会发出警报)。\n韩说，可以识别枪声、玻璃破碎和其他声音进行紧急检测的软件已经存在了几十年，但传统技术经常导致错误警报，或者需要使用特定的麦克风和其他硬件。\n其他致力于改进声音识别技术的公司包括英国剑桥的Audio Analytica，它专注于基于上下文的声音智能，以及总部位于荷兰的Sound Intelligence，它为紧急警报和医疗系统开发软件。\nCochlear.ai计划通过构建可以与包括低端智能手机或USB麦克风在内的各种麦克风一起使用的软件来实现差异化，而不需要进行微调，而是依靠深度学习来完善算法并减少误报。\n在为特定声音建立数据集的早期阶段，Cochlear.ai的团队使用较旧的智能手机型号和USB麦克风自己录制了许多音频样本，以确保他们的软件即使没有高质量的麦克风也能工作。\n其他样本是从网上来源收集的。一旦声音的初始学习模型达到一定的准确度，它就可以自己在线搜索更多的同类音频片段，从而成倍提高数据训练的速度。Cochlear.ai的A系列将使其能够更快地建立音频样本的数据集，从而使其能够在其软件中添加更多的声音。\n“我们所有的联合创始人都是这个领域的研究人员，所以信号处理和机器学习技术-我们正在尝试许多不同的算法，因为每种声音都有不同的特征，”韩说。“我们必须尝试很多不同的东西，才能制造出能够识别所有不同声音的单一模型。”", "note_en": "Cochlear.ai   announced it has raised $2 million in Series A funding, led by Smilegate Investment, with participation from Shinhan Capital and NAU IB Capital. This brings its total funding so far to $2.7 million, including a seed round from Kakao Ventures, the investment arm of the South Korean internet giant. Cochlear.ai will use its Series A on hiring over the next 18 months and to increase the dataset of sounds used to train its deep learning algorithms.\n The company was founded in 2017 by a team of six music and audio research scientists, including Han, who completed his PhD in music information retrieval at Seoul National University. While working on his doctorate, Han found “that everyone was really focusing on speech recognition systems. There are so many companies for that, but analyzing other kinds of sounds are technically quite different from speech recognition.”\n  Speech recognition technology usually recognizes one or two voices at a time, and assumes that people are engaging in a conversation, instead of talking over one another. It also uses linguistic knowledge in post-processing to increase accuracy. But with music or environmental noises, different types of sounds usually overlap.\n “We have to take care about all different frequency ranges, and there are not only voices, but really thousands of sounds out there,” Han said. “So we think this will be the next generation of sound recognition, and that was the motivation for our startup.”\n Cochlear.ai’s SaaS, called Cochl.Sense, is available as a cloud API and edge SDK, and can currently detect about 40 different sounds, which are grouped into three categories: emergency detection (including glass breaking, screaming and sirens), human interaction (which includes using finger snaps, claps or whistles to interact with hardware) and human status (to identify sounds like coughing, sneezing or snoring for use cases like patient monitoring or automatic audio captioning).\n Han said the company also plans to add new functionality to Cochl.Sense for use in homes (including smart speakers), vehicles and music analysis. Cochl.sense’s flexibility means it can potentially fit many use cases, including turning a smart speaker into a “control tower” for home appliances by detecting the noises they make, or helping hearing impaired people by sending alerts about noises, like car horns, to wearable devices including smart watches.\n  Han notes that over the past three years or so, there has been a shift from focusing on speech recognition technology to other sounds as well.\n For example, more major tech companies, like Amazon, Google and Apple, are adding context-aware sound recognition to their products. For example, both Amazon Alexa Guard and Nest Secure detect the sound of glass breaking, while iOS 14’s sound recognition enabled it to add new accessibility features.\n  Han said the launches by major tech companies is a boon for Cochlear.ai, because it means that the market for sound recognition technology is growing. The startup plans to work with many different industries, but is currently focused on smart consumer devices and automotive because that is where the most interest for its software is coming from. For example, Cochlear.ai is currently working on a project with Daimler AG to include its sound recognition in cars (for example, alerts if a child is locked inside), in addition to collaborations with major electronic, telecommunications and consumer good companies.\n Software that can identify sounds like gunshots, glass breaking and other noises for emergency detection has been around for decades, but conventional technology often resulted in false alarms or required the use of specific microphones and other hardware, Han said.\n Other companies dedicated to improving sound recognition technology include Cambridge, England’s Audio Analytica, which focuses on context-based sound intelligence, and Netherlands-based Sound Intelligence, which develops software for emergency alert and healthcare systems.\n Cochlear.ai plans to differentiate by building software that can be used with a wide array of microphones, including in low-end smartphones or USB microphones, without needing to be fine-tuned, instead relying on deep learning to refine its algorithms and reduce false positives.\n During the early stages of building a dataset for a specific sound, Cochlear.ai’s team records many audio samples by themselves using older smartphone models and USB microphones, to ensure that their software will work even without high-quality microphones.\n Other samples are gathered from online sources. Once the sound’s initial learning model reaches a certain level of accuracy, it is then able to search online by itself for more of the same kind of audio clips, exponentially increasing the speed of data training. Cochlear.ai’s Series A will enable it to build datasets of audio samples more quickly, allowing it to add more sounds to its software.\n “All of our co-founders are researchers in this field, so signal processing and machine learning techniques–we are trying many different algorithms, because every sound has different characteristics,” said Han. “We have to try many different things to make one single model that can identify all different sounds.”", "posttime": "2020-10-15 22:55:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "korean,声音", "title": "\n韩国初创公司Cochlear.ai首轮融资200万美元用于检测语音识别遗漏的声音", "title_en": "\n\t\t\t\tSouth Korean startup Cochlear.ai raises $2 million Series A to detect the sounds missed by speech recognition\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/15/south-korean-startup-cochlear-ai-raises-2-million-series-a-to-detect-the-sounds-missed-by-speech-recognition/", "via": "", "real_tags": ["korean", "声音"]}, {"category": "", "categoryclass": "", "imagename": "392577dac1b540fb87e90387bff2b581.jpg", "infoid": 1029011, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在幕后，Arianee正在使用符合Etherum的ERC-721标准的不可替换令牌(还记得CryptoKitties吗？)。通过使用基于区块链的解决方案，Breitling确保其数字护照仍然是未来的证明，并且不能被更改-但由于节点之间的共识机制，任何人都不能连接到中央数据库，更改一些值或删除一些数据。\n如果你买了百年灵手表，你会得到一张可以扫描的保修卡。在手机上下载Arianee钱包应用程序后，您可以将手表添加到您的数字钱包中。您可以看到数字保修的序列号和激活日期。\n正如你可能已经猜到的那样，当你试图出售你的手表时，这些数字证书可能会有所帮助。有一个功能可以让你证明手表的真实性。您还可以将证书传输给其他所有者。\n百年灵还可以随着时间的推移添加信息。例如，您可以想象一个带有时间戳的维修时间表，这样您就可以跟踪整个故事。不久，该品牌也可以通过这个新渠道提供保险产品。\n当涉及到隐私时，证书不会与您的姓名、电子邮件地址或其他个人信息捆绑在一起。您的钱包地址是与您关联的唯一标识符。\nArianee证明，不可替换的令牌可以在奢侈品行业提供一些有趣的使用案例。百年灵还与电通追踪(Dentsu Tracking)合作追踪其供应链。有了数字证书，最终客户也看到了供应链监管的好处。", "note_en": "Behind the scene,  Arianee   is using non-fungible tokens compliant with the Ethereum’s ERC-721 standard (remember CryptoKitties?). By using a blockchain-based solution,  Breitling   ensures that its digital passports remain future proof and can’t be altered — due to consensus mechanisms between nodes, nobody can connect to a centralized database, change some values or remove some data.\n If you buy a Breitling watch, you get an guarantee card that you can scan. After downloading the Arianee wallet app on your phone, you can add your watch to your digital wallet. You can see the serial number and the activation date of the digital warranty.\n  As you may have guessed, those digital certificates can be helpful when you’re trying to sell your watch. A feature lets you prove the authenticity of the watch. You can also transfer the certificate to another owner.\n Breitling can also add information over time. For instance, you can imagine a timeline of repairs with timestamps so that you can keep track of the whole story. Soon, the brand could also offer insurance products through this new channel.\n When it comes to privacy, the certificate isn’t tied to your name, email address or other personal information. Your wallet address is the only unique identifier associated with you.\n Arianee proves that non-fungible tokens can provide some interesting use cases in the luxury industry. Breitling also works with  Dentsu Tracking to track its supply chain. With digital certificates, end customers also see the benefits of supply chain regulation.", "posttime": "2020-10-15 22:55:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "区块链,手表,watch", "title": "\n奢侈手表制造商百年灵在以太区块链上颁发数字证书", "title_en": "\n\t\t\t\tLuxury watch maker Breitling issues digital certificates on the Ethereum blockchain\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/15/luxury-watch-maker-breitling-issues-digital-certificates-on-the-ethereum-blockchain/", "via": "", "real_tags": ["区块链", "手表", "watch"]}]