[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1073538, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "数据显示，极地用户通常步行一小时，在此期间行走4.5公里。数学很简单：平均步行速度是每小时4.5公里。但这是巧合还是有生物学上的解释来解释为什么我们倾向于以这样的速度行走？\n为了理解步行背后的科学，让我们来思考一下竞走者。\n你可能已经在电视上看过多次了。精疲力竭，精疲力竭，几乎不能再走一步，优秀竞走运动员一到达终点线就会崩溃。这些超级运动员可以走得比我们许多人都快，在短短四小时内完成50公里，但在这样做的同时，他们似乎消耗了所有的精力。\n相比之下，马拉松选手跑相似的距离要快得多。尽管传说中的42k比赛是如此激烈和不可原谅，但马拉松选手似乎总有一些精力去进行最后的冲刺。想想埃利乌德·基普乔格，他在不到两小时的时间里完成了一场马拉松比赛。他满脸笑容，看上去很强壮。见鬼，一些马拉松运动员甚至可能在终点线前做俯卧撑。\n那么，为什么竞走运动员会崩溃而马拉松运动员不会呢？走路比跑步容易。还是这样？\n事实是，竞走者完成50公里后，所做的工作不会比马拉松运动员多20%。相反，以尽可能快的速度步行50公里所需的工作量和精力几乎是马拉松的两倍，尽管距离仅比马拉松长8公里。\n等一下！马拉松选手以平均20公里/小时的速度跑完全程，而竞走选手的速度仅为14公里/小时。那么，为什么竞走选手会消耗更多的能量呢？\n关键不在于运动员消耗能量的速度。当然，马拉松运动员每单位时间消耗的燃料更多——这就是他们跑得更快的原因。但是，与此同时，马拉松运动员每单位行程消耗的燃料更少。这是通过运输成本来衡量的。\n运输成本表示一个人每行驶公里每千克体重消耗的能量，单位为卡路里或焦耳。在跑步中，运输成本与速度的关系大致是一条直线。这意味着，无论你跑得有多快，你每公里每公斤体重都要消耗1千卡。\n步行是另一种情况。当我们步行时，交通成本形成一条U形曲线。人类从步行转向跑步的过渡点平均速度约为7 km/h。此时，跑步比步行更经济。这就是为什么当我们走得很快时——例如，为了赶上公共汽车，我们可能会不假思索地开始跑步。\n人类从步行转向跑步的过渡点平均速度约为7 km/h。此时，跑步比步行更经济。\n竞走是一项特殊的运动，因为尽管运动员天生就有跑步的冲动，但他们不得不以超过7公里/小时的速度行走。因此，他们每行驶一段距离消耗的能量比跑步时多50%。\n这就是为什么精英竞走运动员在50公里的比赛中消耗的能量几乎是马拉松运动员的两倍。马拉松距离已经足以消耗一个人肌肉和肝脏中储存的大部分能量。竞走将这一点发挥到了极致。在越过终点线后，竞走者的肌肉和思维都耗尽了能量和意志力，以至于他们几乎不可能继续走下去。\n我们大多数人都不是竞走者。然而，我们——我们的身体——本能地知道什么时候该跑步，什么时候该走路。但身体是如何得出这个结论的呢？这一点我们可能还不完全清楚，但我们知道的是，对于我们的身体来说，当速度超过7公里/小时时，跑步比步行更经济。身体选择步行或开始跑步取决于哪种活动更经济。\n多年来，生物力学研究人员一直在使用超声波探头观察我们运动时的肌肉内部。研究表明，小腿肌肉的收缩速度随着我们步行速度的增加而增加。这是件好事，但只是在一定程度上。肌肉不想收缩得太快或太慢——它们希望以中速收缩，以确保以经济的方式供电。\n当走路时肌肉收缩速度变得太快时，我们就开始跑步。此时——步行到跑步的过渡点——长而有弹性的跟腱帮助小腿肌肉将收缩速度和长度降低到接近最佳范围。这时，身体才知道跑步比快走需要更少的体力。\n步行可以而且是一种非常有效的运动。即使你恰好达到了步行交通成本曲线的最小值，与跑步相比，你每走一段距离所消耗的能量将接近80%。如果你再用力一点，你会消耗更多的能量，从步行锻炼中获得更多的能量。\n让我们回到极地用户的平均步行速度。它往往是4.5公里/小时，或2.8英里/小时。这种速度与U形步行交通成本曲线的最小值一致。因此，这意味着我们选择以最经济的速度行走——即每走一段距离消耗最少能量的速度。\n这个解释也帮助我们理解为什么步行是一种非常有效的运动。首先，即使你恰好达到了步行交通成本曲线的最小值，与跑步相比，你每走一段距离消耗的能量将接近80%。其次，步行对肌肉的压力较小，因此，你可以在更长时间内保持步行速度，并进行更长时间的锻炼。\n一旦你了解了步行背后的科学，就很容易理解它的好处。步行会消耗大量的能量，而且不会因为高强度的运动而导致肌肉紧张。要想从步行中获得更多能量，你只需要通过超越舒适的速度和努力来增加能量消耗。以下是实现这种效果的三种方法：\n上坡和下坡——正坡会增加你的能量消耗，负坡会让你的肌肉做一些古怪的工作，增强力量。\n如果你喜欢这篇文章，别忘了分享，这样别人也能找到。\n或者竖起大拇指！我喜欢这篇文章你喜欢这篇文章谢谢！\n请注意，Polar博客文章中提供的信息不能取代卫生专业人士的个人建议。在开始新的健身计划之前，请咨询你的医生。", "note_en": "Data says that  Polar users typically walk for an hour and cover a distance of 4.5km during that time. The math is simple: the average walking speed is 4.5 km per hour. But is this a coincidence or is there some biological explanation why we tend to walk at that speed?\n To understand the science behind walking, let’s think about race walkers for a moment.\n You’ve probably seen it on TV multiple times. Exhausted, depleted of energy, and barely capable of taking another step, elite race walkers collapse as soon as they reach the finish line. These super athletes can walk faster than many of us can run, completing 50 kilometers in barely four hours, but while doing so, they seem to use all their energy.\n By contrast, marathoners cover a similar distance much faster. Despite of how intense and unforgiven the mythical 42k race is, marathoners always seem to have some energy left for a final sprint. Think of Eliud Kipchoge  as he finished a marathon in less than two hours. He was all smiles and looked strong. Heck, some marathoners might even  do some push-ups right before the finish line.\n So, why do race walkers collapse and marathoners don’t? Walking is easier than running. Or is it?\n The truth is that race walkers, when they complete 50km, don’t do 20% more work than a marathon runner. Instead, walking 50km as fast as possible takes nearly double the work and energy than running a marathon, even though the distance is just 8km longer.\n Wait a minute! Marathon runners cover the distance at a mean pace of 20km/h whereas race walkers reach just 14 km/h. So, how come a race walker consumes so much more energy?\n    The key isn’t the rate at which athletes consume energy. Surely, marathoners burn more fuel per unit time – that’s why they finish much faster. But, at the same time, marathoners burn less fuel per unit distance traveled. This is measure by cost of transport.\n Cost of transport expresses how much energy, measured in calories or joules, a person consumes per traveled kilometer per kilogram of body weight. In running, the cost of transport in relation to speed is roughly a straight line. This means that it doesn’t matter how fast you run, you always spend about 1 kcal per traveled kilometer per kilogram of body weight.\n Walking is a different case. When we walk, the cost of transport forms a U-shaped curve. The transition point, where humans switch from walking to running, occurs, on average, at around 7 km/h. At that point, running becomes more economical than walking. That’s why when we walk very fast – to catch the bus, for example, we’re likely to start running without thinking about it.\n The transition point, where humans switch from walking to running, occurs, on average, at around 7 km/h. At that point, running becomes more economical than walking.\n Race walking is a peculiar sport because athletes are forced to walk beyond 7 km/h despite their natural urge to run. As a result, they consume 50% more energy per travelled distance as they would do if they ran.\n That’s why elIte race walkers competing during 50 km consume almost double the energy compared to marathoners. The marathon distance is already enough to drain most of the energy resources stored in one person’s muscles and liver. Race walking takes this to extreme. After crossing the finish line, a race walker’s muscles and mind are so depleted of energy and willpower that it becomes literally impossible for them to keep on walking.\n  Most of us are not race walkers. And yet, we – our body – instinctively understands when it’s to time to run and when it’s time to walk. But how does the body come to this conclusion? That’s something we may not fully know, but what we do know is that, for our body, running becomes more economical than walking when we go faster than 7 km/h. The body chooses to walk or start running depending on which activity is more economical.\n For some years, biomechanical researchers have used ultrasound probes to look inside our muscles as we move. The research has revealed that calf muscle contraction velocity increases as we gain speed in walking. This is a good thing, but only to a point. The muscles don’t want to contract too fast or too slow – they want to contract at an intermediate speed to ensure they supply power in an economical manner.\n When muscle contraction velocity becomes too fast while walking, we switch to running. At this moment – the walk-to-run transition point -, the long and elastic Achilles tendon helps calf muscles to decrease their contraction velocity and length close to an optimal range. It is then when the body learns that running will take less work than walking fast.\n Walking can and is a very effective exercise. Even if you happen to hit exactly the minima of the walking cost of transport curve, you’ll be consuming nearly 80% of the energy per traveled distance as compared to running. If you push a little bit more, you’ll consume more energy and get more out of your walking workouts.\n  Let’s return to the  average walking speed of Polar users. It tends to be 4.5 km/h, or 2.8 mph. Such speed coincides with the minima of the U-shaped walking cost of transport curve. Therefore, it means that we select to walk at the most economical speed – the speed that consumes the least amount of energy per traveled distance.\n This explanation also help us understand why walking can be a very effective exercise. First, even if you happen to hit exactly the minima of the walking cost of transport curve, you’ll be consuming nearly 80% of the energy per traveled distance as compared to running. Secondly, walking causes less stress to your muscles and therefore, you can sustain a walking speed for a longer period of time and exercise for a longer time.\n   Once you know the science behind walking, it is easy to understand its benefits. Walking consumes lots of energy for a long time without the muscle strain of high-impact activities. To get more out of your walking, you only need to increase energy consumption by going beyond a comfortable speed and effort. Here’re are three ways to achieve this effect:\n Walk uphill… and downhill – Positive slopes increase you energy consumption, and negative slops make your muscles do eccentric work that builds strength.\n  If you liked this post, don’t forget to share so that others can find it, too.\n    Or give it a thumbs up!       I like this article      You liked this article  Thanks!\n  Please note that the information provided in the Polar Blog articles cannot replace individual advice from health professionals. Please consult your physician before starting a new fitness program.", "posttime": "2022-02-15 22:06:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "知道,步行", "title": "该跑了还是该走了？你的身体知道答案", "title_en": "Time to run or time to walk? Your body knows the answer", "transed": 1, "url": "https://www.polar.com/blog/time-to-run-or-time-to-walk-your-body-knows-the-answer/", "via": "", "real_tags": ["知道", "步行"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073536, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "埃隆·马斯克计划再次突破现状。如果他成功了，在第一次太空竞赛中获胜的航空航天巨头可能永远无法在这次竞赛中赶上他。\n周四晚上，马斯克站在位于德克萨斯州西南部的太空X“星际基地”的高耸星际飞船火箭前，承诺他迄今为止最雄心勃勃的宇宙飞船将在未来几个月进行首次太空旅行。\n“在这一点上，我非常有信心我们将在今年进入轨道，”他在两年来首次更新这项发明时说，他承认这项发明“听起来很疯狂”\n“它会成功的，”他宣称。“一路上可能会有一些坎坷，但它会奏效。”\n星际飞船被设计成第一个多用途航天器：一个可重复使用和可加油的航天器，它可以将几十人和数百万吨货物从地球直接运送到月球，最终到达火星——并一次又一次地这样做。\n如果他能成功，马斯克之前的突破——电动汽车、用于发射卫星的可重复使用火箭、第一个与国际空间站对接的商业太空舱——相比之下，可能看起来是微不足道的成就。\n“这是我们过去常说的‘如果我们能做这类事情不是很棒吗？’”前宇航员斯科特·奥尔特曼说，他现在是ASRC联邦公司的总裁，这是一家太空研发中心；D公司。\n但NASA官员——以及他们长期的航空航天承包商——正在怀着敬畏和恐惧的心情观看。\n“他们在床上拉屎，”华盛顿一位顶级太空说客说。他为SpaceX的竞争对手工作，要求匿名，以免惹恼客户。\n美国国家航空航天局及其主要行业合作伙伴正在同时努力完成他们自己的月球飞行器：太空发射系统巨型火箭和配套的猎户座太空舱。但该项目比预算高出数十亿美元，比计划晚了几年——许多人认为，在创新方面比SpaceX落后几代人。\n美国宇航局在未来三年内的前三次阿耳特弥斯登月任务——包括计划于2025年进行的人类着陆——都将乘坐SLS火箭和猎户座太空舱，这两个太空舱由波音、洛克希德·马丁、诺斯罗普·格鲁曼、Aerojet Rocketdyne和许多其他供应商和工程服务公司建造。\n但随着SLS今年的首次飞行进一步推迟，至少推迟到春季末，人们越来越担心，即使它成功，该系统的每次发射成本估计为20亿美元，对于NASA在月球表面建立永久人类存在所需的多次登月旅行来说，成本可能太高。\n这使得去年成功飞行到太空边缘的星际飞船，尤其是对承包商及其在国会的盟友构成威胁。\n据航空工程师和太空顾问兰德·辛伯格（Rand Simberg）称，随着星际飞船的发展，它将进一步掩盖坚持使用SLS的理由。\n他说：“一旦新系统的可靠性在几个月内的大量飞行中得到证明，它将淘汰所有现有的发射系统。”。\n他补充说：“如果SLS不会每两年飞行一次以上，它就不会在未来的太空中扮演重要角色，尤其是在星际飞船飞行时。”。\nSLS火箭的主要承包商波音公司和NASA均未回应对该计划或马斯克最新星际飞船计划的批评置评请求。\n辛伯格表示，星际飞船的最大突破将是它可能提供的“大幅降低成本”，特别是在近地轨道使用油轮为其加油的计划，这将大大降低深空作业的长期成本。\n他在最近一篇题为《沃尔玛，但为了太空》的论文中写道：“如果该公司能够证明其新型重型运载火箭不仅是可重复使用的，而且用埃隆·马斯克的话说，是可快速重复使用的——它将彻底改变太空飞行。”\n马斯克周四还表示，“关键技术——需要的圣杯突破——是一种快速且完全可重复使用的火箭系统。”\n他补充说：“所以这以前从未实现过，很多人在很长一段时间内认为这是不可能的。”。\n众议院科学委员会前主席、航天行业顾问罗伯特·沃克说，如果星舰成功，NASA运载火箭的价值将受到严重威胁，因为它的设计飞行频率不如星舰。\n“如果阿耳特弥斯的第一次飞行成功，我们可能需要两年才能到达第二次，”他说。“马斯克可以很快推出产品。”\n“龙”号太空舱已经成功地进行了三次飞行，另一次计划于4月进行，而波音公司的“星舰”号在同一NASA公私合作伙伴关系下开发的第一次飞行继续被推迟。\n该公司去年受聘使用其星舰技术提供载人着陆系统，将宇航员带到月球表面执行第三次阿尔忒弥斯任务。\n它击败了包括Blue Origin在内的竞争对手。Blue Origin是亚马逊创始人杰夫·贝佐斯（Jeff Bezos）旗下的火箭公司，该公司正在德克萨斯沙漠开发自己的火箭和航天器舰队，但尚未将任何火箭发射入轨道。\n前宇航员奥特曼说，除了现在计划于2025年着陆外，SpaceX及其星际飞船在NASA的月球计划中可以发挥更大的作用。他说：“我们一直在努力让SLS和猎户座在阿尔忒弥斯项目中结合起来。”。\n“现在星际飞船是这条链条中的一环，”他补充说，指的是它在登月过程中已经扮演的角色。“这是一种技术，是我们需要的一种能力。”\n目前尚不清楚NASA将如何与星际飞船签订未来任务合同。但它可以建立一种公私合作关系，类似于其乘坐空间站或月球着陆器的安排。\n五角大楼已经聘请SpaceX发射了一些间谍卫星，同时也在关注这种新型运载工具在地球上的“点对点”货运任务。\n沃克说：“星际飞船可以运载一架C-17装载的货物，并在一小时内到达世界任何地方。”沃克曾在SpaceX咨询委员会任职，但与该公司已无任何关系。\n他补充道：“如果他真的能成功，这项技术有着重要的用途。”。\n就连马斯克本人在周四也发出了警告，警告称在星际飞船证明其可靠性之前，可能会有技术上的挫折。\n“轨道飞行实际上只是一个开始，”他说。“你知道，道路上可能会有一些颠簸，但我们希望通过卫星任务和测试任务来解决这些问题，达到高飞行速度，并拥有非常可靠的东西。”\n这位满嘴脏话的华盛顿说客是SpaceX的长期批评者，他将客户对马斯克周四演讲的反应描述为“承诺、承诺、承诺”\n但他说，这样的解雇是不可能的。“就像你一直说‘他做不到’，但它一直在起作用。它一直在起作用。我认为人们都很害怕。他开始让从不相信他的人认为他可能会这样做。”", "note_en": "Elon Musk is planning yet again to rocket beyond the status quo. And if he succeeds, the aerospace giants that won the first space race may never catch him in this one.\n Standing in front of the  towering Starship rocket at Space X’s southwest Texas “Starbase” on Thursday night, Musk pledged that his most ambitious spaceship yet will make its first journey in the coming months.\n  “At this point, I am highly confident we will get to orbit this year,” he said in the first update in two years on the invention he acknowledged “does sound crazy.”\n “It will work,” he declared. “There might be a few bumps along the way, but it will work.”\n Starship is designed to be the first all-purpose space vehicle: a reusable and refuelable spacecraft that can take scores of people and millions of tons of cargo from Earth directly to the moon and eventually Mars — and do it over and over again.\n  If he can pull it off, Musk’s previous breakthroughs — electric cars,  reusable rockets for launching satellites, the first  commercial space capsule to dock with the International Space Station — might seem, by comparison, to be modest achievements.\n “It is the kind of thing we used to talk about as ‘wouldn’t it be great if we could do these kinds of things?’” said Scott Altman, a former astronaut who is now president of ASRC Federal, a space R&amp;D company.\n But NASA officials — and their longtime aerospace contractors — are watching with a mix of awe and horror.\n “They are shitting the bed,” said a top Washington space lobbyist who works for SpaceX’s competitors and asked for anonymity to avoid upsetting his clients.\n  NASA and its major industry partners are simultaneously scrambling to complete their own moon vehicles: the Space Launch System mega-rocket and companion Orion capsule. But the program is billions of dollars over budget and years behind schedule — and, many would argue, generations behind SpaceX in innovation.\n The space agency’s  first three Artemis moon missions over the next three years — including a human landing planned for 2025 — are all set to travel aboard the SLS rocket and Orion capsule, which are being built by Boeing, Lockheed Martin, Northrop Grumman, Aerojet Rocketdyne and numerous other suppliers and engineering services firms.\n But with  the SLS’ first flight this year further delayed at least until late spring, concerns are growing that even if it succeeds, the system, at an estimated $2 billion per launch, could prove too costly for the multiple journeys to the moon that NASA will need to build a permanent human presence on the lunar surface.\n That makes Starship, which conducted a successful flight to the edge of space last year, especially threatening to the contractors and their allies in Congress.\n As Starship progresses, it will further eclipse the argument for sticking with SLS, according to Rand Simberg, an aerospace engineer and space consultant.\n “Once the new system’s reliability is demonstrated with a large number of flights, which could happen in a matter of months, it will obsolesce all existing launch systems,” he said.\n “If SLS is not going to fly more than once every couple of years, it’s just not going to be a significant player in the future in space, particularly when Starship is flown,” he added.\n Neither Boeing, the main contractor on the SLS rocket, nor NASA responded to requests for comment on the criticism of the program or Musk’s latest plans for Starship.\n Simberg said the biggest breakthrough of Starship would be the “radical cost reduction” it potentially offers, particularly the plan to use tankers in low-Earth orbit to refuel it, which could significantly bring down the long term cost of operations in deep space.\n “If the company can demonstrate that its new heavy-lift rocket is not just reusable but, in Elon Musk’s words, rapidly reusable — it will revolutionize spaceflight,”  he wrote in a recent paper titled “Walmart, But for Space.”\n Musk on Thursday also said “the essential technology — the holy grail breakthrough that’s needed — is a rapid and completely reusable rocket system.”\n “So this has never been accomplished before and a lot of people for the longest time thought this was not possible,” he added.\n  Robert Walker, former chair of the House Science Committee and a space industry consultant, said that if Starship succeeds, the value of the NASA launch vehicle will be seriously imperiled simply because it is not designed to fly nearly as often as Starship.\n “If the first Artemis flight is successful, it may be two years until we can get to the second one,” he said. “Musk can roll things out pretty quickly.”\n  The Dragon space capsule has made three successful trips, with another planned for April, while the first flight of Boeing’s Starliner, which was developed under the same NASA public-private partnership,  continues to be delayed.\n  The company  was hired last year to use its Starship technology to provide the Human Landing System that will take astronauts to the lunar surface on the third Artemis mission.\n It beat out competitors including Blue Origin, the rocket company owned by Amazon founder Jeff Bezos that is developing its own fleet of rockets and spacecraft in the Texas desert, but has yet to launch anything into orbit.\n Altman, the former astronaut, said SpaceX and its Starship could play a much bigger role in NASA’s moon program beyond the landing now set for 2025. “We’ve been trying to get the SLS and Orion together for the Artemis program,” he said.\n “Right now Starship is a link in that chain,” he added, referring to the role it will already play in the moon landing. “It’s a technology, it’s a capability we’re going to need.”\n It’s unclear how exactly NASA might contract with Starship for future missions. But it could establish a public-private partnership, similar to its arrangement for rides to the space station or for the moon lander.\n  The Pentagon, which has hired SpaceX to launch some of its spy satellites, is also eyeing the new vehicle  for “point to point” cargo missions on Earth.\n “Starship can carry a C-17 load of cargo and get it anywhere in the world in an hour,” said Walker, who previously served on a SpaceX advisory board but no longer has any ties to the company.\n “There are just major uses for this if, in fact, he can pull it off,” he added.\n  Even Musk himself sounded a cautionary note on Thursday, warning that there will likely be technical setbacks before Starship proves its reliability.\n “Orbital flight is really just the beginning,” he said. “There will probably be a few bumps in the road, you know, but we want to iron those out with satellite missions and test missions and get to a high flight rate and have and have something that’s extremely reliable.”\n The potty-mouthed D.C. lobbyist, a longtime detractor of SpaceX, described the reaction among his clients to Musk’s presentation on Thursday as “promises, promises, promises.”\n But he said such dismissals are passé. “It’s like you keep saying ‘he can’t do it’ but it keeps working. It keeps working. I think people are scared. He’s starting to make people who were never believers think he might.”", "posttime": "2022-02-15 21:52:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nasa,飞船,threatening,太空", "title": "星际飞船正在威胁NASA的月球承包商", "title_en": "Starship is threatening NASA’s moon contractors", "transed": 1, "url": "https://www.politico.com/news/2022/02/12/elon-musk-space-freaking-out-competitors-00008441", "via": "", "real_tags": ["nasa", "飞船", "太空"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073535, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在最近的一次在线讨论中，几位同龄人提出了一个简单的说法，我想验证一下：当你从那些你知道正在侵蚀你注意力的活动中休息一下时，你的注意力主要集中在手机和网络习惯上——你只需一两天后就会注意到它正在改善。\n在过去的十年里（尤其是最近两年），我的注意力广度确实恶化了，这种恶化似乎与我上网的次数有关。我认为这是一种双向关系——注意力分散会让你更难专注于离线活动，这会让在线活动更具吸引力，等等。\n我立即开始计划一个简单的实验，即离线三天，并很快意识到这样的休息只会产生一个减速带，而不是持久的改变。我可以看到自己把笔记本电脑扔到抽屉里，把有趣的手机应用程序屏蔽72小时，然后在第四天补上我错过的信息和字谜，基本上让我回到了一直在线的模式。\n取而代之的是，我想通过这个实验，通过几天的暴力切断所有的触须，来精确地观察互联网将触须附在我的思想和身体上的位置。我会无聊吗？孤独的人们会因为我不在而恨我吗？我要猜猜公共图书馆星期三的时间吗？\n一旦我知道为什么以及在哪里我需要与互联网建立一种永远在线的关系，我就会拿着一支铅笔坐下来，研究如何在每周至少几天完全离线的情况下满足我合法的在线需求，而在其他几天只部分在线。\n这是我的梦想，生活在2022年，但要像我们在90年代和21世纪初那样使用互联网，那时互联网接入与你必须与他人共享的台式电脑相连。“在线”是一个你去查找东西、交换信息、闲逛或探索的地方，但只是一天中的一部分时间，而不是每天。与你的现实生活相比，互联网很小，而现实生活是离线的。\n几年前，我在一篇题为《是时候把互联网放回地下室的盒子里了》的帖子中表达了这个愿望：\n我希望我的互联网再次被限制在地下室的一个盒子里。这样一个盒子仍然会非常强大，如果我们能阻止它不断地打断我们有限的时间，加剧我们的不安全感，削弱我们集中注意力的能力，它可能会非常强大。我们当然不想像今天这样每天打开盒子50次，每次几分钟。\n下班后我想去地下室，把我的信息和文字放进盒子里，把别人的信息和文字拿出来，在我的安乐椅上读。我想要一个大的机械开关，当我用完它的时候，把它关掉。\n这个愿景对我来说过去是，现在仍然是非常清楚的，但我只是写了一篇关于它的如意算盘。\n前几天，当我考虑进行为期三天的“排毒”治疗我疲惫的注意力时，我意识到这将教会我很多关于我真正需要互联网做什么和我不需要什么的东西。之后，我可以利用我学到的知识来设计我真正想要的、更精心策划的、有限的与互联网的关系。\n也许我应该每周两天清理信件，改天下载研究和阅读材料，周六浏览社交媒体一小时。写作和创作完全是在离线状态下进行的，无论是在不插电源的笔记本电脑上还是在打字机上，我上网只是为了出版。我不知道我的新在线程序会采取什么样的形式，但我知道它们不会涉及全天的放牧。\n所以我从休息三天的实验开始，在打字机上做大量笔记。这个短暂的休息有两个目的：\n1.看看我的注意力广度是否像一些人所说的那样在短时间内显著提高。\n2.发现为什么不一直在线是如此困难。\n归根结底，我们的目标不是停止使用互联网，甚至是最小化它的使用，而是把它放回它所属的地下室的一个盒子里。第一步是发现我面对的是什么。如果我能找到一种方法让互联网再次变小，我会写一本关于它的书，这样其他人也可以这样做。\n基本上，我会在这三天里尽可能多地远离互联网，而不会进入一种我迫不及待想要摆脱的不可持续的隐居模式。\n首先是电话。我要关掉手机数据，把手机拴在厨房的墙上，在那里我可以用它打电话和发短信。我出去的时候会带着它，数据还是没有。文本通知将被禁用，我不担心周转时间。当我坐在厨房的椅子上时，我期待着和我的朋友们在电话里聊天，就像1996年一样。\n我仍然会用手机播放音乐或有声读物，这不需要打开数据。（我有一个蓝牙扬声器和耳机，所以我可以把手机放在厨房里。）\n第二，电脑。我要把我的笔记本电脑放在一个架子上，关上，然后把它留在那里，除了一些预定的例外情况。虽然将来我确实打算在笔记本电脑上写字（关闭wi-fi），但在这三天里，我将在打字机上写下所有东西，包括这次实验的日记条目。我想尽可能使用单一用途的非电子工具。\n我会给我生命中的某些人发电子邮件，让他们知道我在这么做。其他所有人都必须找到艰难的道路。（我很想看看这会造成多大的实际影响——我怀疑比我担心的要少。）\n接下来的三天是周六、周日和周一。完成后我会发布一个简报。\n在实验过程中，任何需要上网的任务都会记录在剪贴板上，在实验结束后进行批处理。\n然而，我确实希望遇到无法避免使用互联网的情况。例如，我将解决任何网站问题或其他紧急问题。\n我唯一知道我会使用互联网的时间是两次晚上的Zoom通话，一次在周六，一次在周一，我打算保留这两次通话。这些社交活动（具体来说，是与朋友的D&D会议）都是有益健康的，正是我想利用互联网技术的目的。如果可以的话，我们会围坐在桌子旁。\n有时使用互联网是可以避免的，但避免使用互联网是荒谬的。例如，如果我忘记了我要去的地方的地址，我会查一下，而不是耸耸肩回家。在这些情况下，我会打开数据，使用所需的工具，然后再次关闭它，而不会走私任何琐碎的东西。\n我也会让一些事情简单地爆炸，而不是试图事先解决它们。我会自动放弃一些正在进行的国际象棋比赛。我的梦幻曲棍球队可能会输。我要打破我的言辞习惯。我希望任何这样的崩溃都能说明我一直致力于在线的许多毫无意义的方式。\n我希望有更多的时间在我的手上，我想把它重定向到阅读，锻炼，冥想，创造性的工作，和其他有意义的活动，我经常假装我没有足够的时间。我会用食谱和纸质食谱卡做饭。换句话说，我会深入我的线下爱好，深度年风格。\n如果可能的话，我也会尽可能多地与人交往。我相信我会学到很多关于如何依靠在线平台来取代真实交互的知识。\n我仍然会使用Netflix和其他电视流媒体服务，因为这就是现在看电影的方式，我不认为是电影分散了我的注意力。不过我不会使用YouTube——那是另一种动物。\n一如既往，如果你愿意，欢迎你加入我，哪怕只是一天或一天的一部分。我很想听听你学到了什么。你可以在评论中发表你的见解。\n拉皮泰德现在在帕特伦。它&#39；这是一个简单的方法来帮助保持这个网站的广告免费。作为对你支持的交换，你可以获得额外的帖子和其他好处。加入一个不断壮大的赞助人社区。[看看这是怎么回事]", "note_en": "In a recent online discussion, several peers made a simple claim I want to test out: when you take a break from the activities you know are eroding your attention span—mostly phone and internet habits–you notice it improving after only a day or two.\n My attention span has certainly worsened over the last ten years (especially the last two), and this worsening seems to correlate with how much I use the internet. I presume it is a two-way relationship—a shredded attention span makes it more difficult to absorb yourself in offline activities, which makes online activities more appealing, and so on.\n I immediately began planning the simple experiment of staying offline for three days, and quickly realized that such a break would just create a speedbump, not a lasting change. I could see myself dumping my laptop in a drawer, blocking my fun phone apps for 72 hours, then catching up on my missed messages and Wordle puzzles on day four, essentially rebounding me right back into always-online mode.\n  Instead of that, I want to use this experiment to see precisely  where the internet has attached its creeping tendrils to my mind and body, by violently severing all of them all for a few days. Will I be bored? Lonely? Will people hate me for being unavailable? Will I have to guess at the public library’s Wednesday hours?\n  Once I have some idea why and where I’ve come to  need an always-on relationship to the internet, I’m going to sit down with a pencil and work out how I can meet my legitimate online needs  while staying completely offline at least a few days a week, and only partly online on the other days.\n That is my dream—to live in 2022 but use the internet like we used it in the ‘90s and early 2000s, when internet access was tied to desktop computers you had to share with others. “Online” was a place you went to look things up, exchange messages, goof off, or explore—but only for a part of the day, and not every day. The internet was small compared to your real life, which was something that happened offline.\n  I articulated this desire a few years ago, in a post called  It’s Time to Put the Internet Back into a Box in the Basement:\n I want my internet confined to a box in the basement again. Such a box would still be supremely powerful—or it could be, if we could keep it from constantly fragmenting our limited time, stoking our insecurities, and dulling our ability to focus. We certainly wouldn’t want to be opening the box fifty times daily, a few minutes at a time, as we tend to do today.\n I want to go down to the basement after work, put my messages and my writings into the box, take other people’s messages and writings out, and read them in my easy chair. And I want a big mechanical switch to shut it all off when I’m done with it.\n This vision was and still is very clear to me, but I didn’t do any more than write that wishful rant about it.\n The other day, when I pondered taking a three-day “detox” to heal my frayed attention span, I realized it would teach me a lot about what I actually  need the internet for and what I don’t. Afterward, I can use what I learn to design the more curated, limited relationship with the internet that I actually want.\n Perhaps I’d clear my correspondence two days a week, research and reading-material downloads another day, and browse social media for an hour on Saturdays. Writing and creating would happen strictly offline, either on an unplugged laptop or a typewriter, and I’d go online only to publish. I don’t know quite what form my new online routines would take, but I know they won’t involve all-day-every-day grazing.\n So I’m starting with the three-days-off experiment, taking copious notes on my typewriter. This short break has two purposes:\n 1. To see if my attention span improves noticeably in a short time, as some claim.\n 2. To discover exactly why it is so damn hard not to be online all the time.\n Ultimately, the goal is not to stop using the internet, or even minimize its use, but to put it back into a box in the basement where it belongs. The first step is to discover what I’m up against. If I find a way to make the internet small again, I’ll write a book about it so others can do it too.\n  Basically, I’m going to spend as much of the three days as possible away from the internet, without entering a kind of unsustainable hermit-mode that I can’t wait to rebound from.\n  First, the phone. I’m going to shut off mobile data, and tether the phone to the wall of my kitchen, where I can use it for calls and text. I’ll take it with me when I go out, data still off. Text notifications will be disabled and I won’t worry about turnaround time. I look forward to chatting on the phone with my pals while I’m sitting in a kitchen chair, like it’s 1996.\n I will still use my phone to play music or audiobooks, which doesn’t require data to be on. (I have a Bluetooth speaker and headphones so I can keep the phone in the kitchen.)\n  Second, the computer. I’m going to put my laptop on a shelf, closed, and leave it there, with a few scheduled exceptions. While in the future I do intend to write on my laptop (with wi-fi off), for this three days I’m going to write everything on my typewriter, including my journal entries for this experiment. I want to use single-purpose nonelectronic tools wherever I can.\n I’m going to email a few certain people in my life to let them know I’m doing this. Everyone else will have to find out the hard way. (I’m interested to see how much real fallout this creates—I suspect less than I fear.)\n The three days will be this coming Saturday, Sunday, and Monday. I’ll post a debriefing sometime after I’m done.\n  During the experiment, any tasks requiring the internet will be recorded on a clipboard, to be batch-processed after the experiment period is over.\n However, I do expect to run into situations where using the internet is unavoidable. I will address any website problems or other urgent issues, for example.\n The only time I know I will use the internet is for two evening Zoom calls, one on the Saturday and one on the Monday, which I intend to keep. These are social events (D&amp;D sessions with friends, to be specific) that are good and healthy and exactly what I want to be using internet technology for. We’d do it sitting around a table if we could.\n There may also be times when using the internet is avoidable, but avoiding it is absurd. For example, if I forget the address of the place I’m going to, I’ll look it up rather than shrugging and going home. In these cases I will turn data on, use the required tool, then turn it off again, without smuggling in any frivolous stuff.\n  I’m also going to let some things simply blow up, rather than try to resolve them all beforehand. I’ll auto-forfeit some ongoing chess games. My fantasy hockey team may lose. I’ll break my Wordle streak. My hope is that any such breakdowns will illuminate the many pointless ways I’ve committed myself to being online all the time.\n  I expect to have more time on my hands, and I’d like to redirect it to reading, exercise, meditation, creative work, and other rewarding activities I often pretend I don’t have enough time for. I’ll cook from cookbooks and paper recipe cards. In other words, I’ll dive into my offline hobbies,  Depth Year style.\n I’ll also socialize as much as I can, in person when possible. I’m sure I’ll learn a lot about how much I lean on online platforms to replace real interaction.\n I’ll still use Netflix and other TV streaming services, because that’s how movies are watched these days, and I don’t think it’s movies that are fragmenting my attention. I won’t use YouTube though – that’s a different animal.\n As always, you’re welcome to join me if you like, even for just a day or a part of one. I’d love to hear what you learn. You can post your insights in the comments.\n   Raptitude is now on Patreon. It&#39;s an easy way to help keep this site ad-free. In exchange for your support, you  get access to extra posts and other goodies. Join a growing community of patrons.  [See what it&#39;s all about]", "posttime": "2022-02-15 21:46:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "互联网,internet", "title": "如何让互联网再次变小", "title_en": "How to make the internet small again", "transed": 1, "url": "https://www.raptitude.com/2022/02/how-to-make-the-internet-small-again/", "via": "", "real_tags": ["互联网", "internet"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073534, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "jDeploy将你的应用发布到云上，这样你的用户就可以立即使用它。\n应用程序的下载页面允许用户下载Linux、Mac和Windows的本机安装程序。\n你的应用在启动时会自动下载更新，这样你的用户就永远是最新的。\n原生mac安装程序由jDeploy进行代码签名和公证，因此您不需要&#39；我不必费劲了。", "note_en": "jDeploy publishes your app to the cloud, so that it is instantly available to your users.\n  A Download page for your app lets your users download native installers for Linux, Mac, and Windows.\n  Your app downloads updates automatically at launch time so that your users are always up-to-date.\n  The native mac installer is codesigned and notarized by jDeploy so you don&#39;t have to futz with it.", "posttime": "2022-02-15 21:45:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,linux,windows,程序,mac", "title": "JDeploy——在Mac、Linux和Windows上以本机捆绑包的形式部署桌面Java应用程序", "title_en": "JDeploy – Deploy desktop Java apps as native bundles on Mac, Linux, and Windows", "transed": 1, "url": "https://www.jdeploy.com", "via": "", "real_tags": ["java", "linux", "windows", "程序", "mac"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073532, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "--&gt；抽象是素描的核心，因为线条画的简单性和简约性。抽象需要识别对象或场景的基本视觉属性，这需要语义理解和高级概念的先验知识。因此，抽象描绘对艺术家来说是一个挑战，对机器来说更是如此。我们提出了一种对象绘制方法，可以在几何和语义简化的指导下实现不同层次的抽象。虽然草图生成方法通常依赖于显式草图数据集进行训练，但我们利用CLIP（对比语言图像预训练）的卓越能力从草图和图像中提取语义概念。我们将草图定义为一组Bézier曲线，并使用可微光栅化器直接针对基于片段的感知损失优化曲线的参数。通过改变笔画的数量来控制抽象程度。生成的草图展示了多个抽象层次，同时保持了所绘制主题的可识别性、底层结构和基本视觉组件。\n我们的方法是基于优化的，因此不需要任何明确的草图数据集。我们使用剪辑图像编码器来指导将照片转换为抽象草图的过程。剪辑编码提供了对所描述概念的语义理解，而照片本身为具体主题提供了草图的几何基础。我们将草图定义为放置在白色背景上的一组N个黑色笔划。我们通过改变笔画的数量N来创建不同层次的抽象。\n给定所需对象的目标图像I，我们的目标是合成相应的草图S，同时保持对象的语义和几何属性。我们首先提取输入图像的显著区域来定义笔划的初始位置。接下来，在优化的每一步中，我们将笔划参数提供给可微光栅化器，以生成光栅化草图。生成的草图以及原始图像随后被输入到剪辑中，以定义基于剪辑的感知损失。我们的方法成功的关键是使用预训练片段模型的中间层来约束输出草图的几何图形。如果没有这个术语，输出草图将与输入图像不相似。我们通过可微光栅化器反向传播损失，并更新笔划#39；在每一步直接控制点，直到损失函数收敛。学习的参数和损耗项以红色突出显示，而蓝色分量在整个优化过程中被冻结，实心箭头用于标记反向传播路径。\n@misc{vinker2022clipasso，title={CLIPasso:语义感知对象素描}，author={Yael Vinker and Ehsan Pajouheshgar and Jessica Y.Bo and Roman Christian Bachmann and Amit Haim Bermano and Daniel Cohen Or and Amir Zamir and Ariel Shamir}，年份={2022}，eprint={2202.05822}，archivePrefix={arXiv}，primaryClass={cs.GR\n基于Nerfies项目页面的网站源代码。如果你想重用他们的源代码，请适当地信任他们。", "note_en": "--&gt;   Abstraction is at the heart of sketching due to the simple and minimal nature of line drawings. Abstraction entails identifying the essential visual properties of an object or scene, which requires semantic understanding and prior knowledge of high-level concepts. Abstract depictions are therefore challenging for artists, and even more so for machines. We present an object sketching method that can achieve different levels of abstraction, guided by geometric and semantic simplifications. While sketch generation methods often rely on explicit sketch datasets for training, we utilize the remarkable ability of CLIP (Contrastive-Language-Image-Pretraining) to distill semantic concepts from sketches and images alike. We define a sketch as a set of Bézier curves and use a differentiable rasterizer to optimize the parameters of the curves directly with respect to a CLIP-based perceptual loss. The abstraction degree is controlled by varying the number of strokes. The generated sketches demonstrate multiple levels of abstraction while maintaining recognizability, underlying structure, and essential visual components of the subject drawn.\n  Our method is optimization-based and therefore does not require any explicit sketch dataset. We use the CLIP image encoder to guide the process of converting a photograph to an abstract sketch. CLIP encoding provides the semantic understanding of the concept depicted, while the photograph itself provides the geometric grounding of the sketch to the concrete subject. We define a sketch as a set of N black strokes placed on a white background. We vary the number of strokes N to create different levels of abstraction.\n    Given a target image I of the desired subject, our goal is to synthesize the corresponding sketch S while maintaining both the semantic and geometric attributes of the subject. We begin by extracting the salient regions of the input image to define the initial locations of the strokes. Next, in each step of the optimization we feed the stroke parameters to a differentiable rasterizer to produce the rasterized sketch. The resulting sketch, as well as the original image are then fed into CLIP to define a CLIP-based perceptual loss. The key to the success of our method is to use the intermediate layers of a pretrained CLIP model to constrain the geometry of the output sketch. Without this term, the output sketch would not be similar to the input image. We back-propagate the loss through the differentiable rasterizer and update the strokes&#39; control points directly at each step until convergence of the loss function. The learned parameters and loss terms are highlighted in red, while the blue components are frozen during the entire optimization process, solid arrows are used to mark the backpropagation path.\n      @misc{vinker2022clipasso, title={CLIPasso: Semantically-Aware Object Sketching}, author={Yael Vinker and Ehsan Pajouheshgar and Jessica Y. Bo and Roman Christian Bachmann and Amit Haim Bermano and Daniel Cohen-Or and Amir Zamir and Ariel Shamir}, year={2022}, eprint={2202.05822}, archivePrefix={arXiv}, primaryClass={cs.GR} }\n Website source code based on the   Nerfies project page. If you want to reuse their  source code, please credit them appropriately.", "posttime": "2022-02-15 21:39:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "语义,semantically,草图", "title": "CLIPasso：语义感知的对象绘制", "title_en": "CLIPasso: Semantically-Aware Object Sketching", "transed": 1, "url": "https://clipasso.github.io/clipasso/", "via": "", "real_tags": ["语义", "草图"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073531, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "frawk是一种小型编程语言，用于编写处理文本数据的短程序。首先，它是AWK语言的一个实现；许多常见的Awk程序在传递给frawk时会产生等效的输出。如果希望脚本处理转义的CSV/TSV格式的标准Awk字段，或者希望脚本执行得更快，那么您可能会对Frawk感兴趣。\n基准：在处理大型CSV或TSV文件时，frawk和其他工具的相对性能。\n内置函数参考：frawk实现的内置函数列表，包括一些与Awk相比新的函数。\n你需要安装防锈漆。如果要使用LLVM后端，需要在计算机上安装LLVM 12：\n有关一些基于debian的Linux发行版的安装说明，请参阅本网站。另请参阅关于这个问题的评论，了解可用于在Ubuntu上构建二进制文件的docker文件。\n在Arch pacman上，Sy llvm llvm LIB和一个C编译器（例如clang）到2020年9月就足够了。\n根据软件包管理器放置这些库的位置，您可能需要在LLVM库安装时指向LLVM_SYS_120_前缀（例如，Linux上的/usr/lib/LLVM-12或/usr/local/opt）/llvm@12在Mac OS上安装时llvm@12通过自制）。\n虽然建议使用LLVM后端，但只有在支持基于Cranelift的JIT及其字节码解释器的情况下才能构建frawk。要做到这一点，请在不使用llvm_后端功能的情况下进行构建。Cranelift后端为较小脚本的LLVM提供可比较的性能，但LLVM&#39；s的优化有时会比Cranelift带来显著的性能提升（有关这方面的一些示例，请参阅Benchmarks文档）。\n默认情况下，frawk目前需要夜间编译器。要使用stable编译frawk，请在不使用不稳定功能的情况下编译。构建frawk需要使用Rustop default nightly或其他方法来运行夜间编译器版本。\n有了这些先决条件，克隆这个存储库和一个cargo构建——release或cargo[+nightly]install——path&lt；frawk回购路径&gt；将生成一个二进制文件，如果您选择，可以将其添加到路径中：\n$cd&lt；frawk回购路径&gt；#使用LLVM$cargo+夜间安装--path.#没有LLVM，但有其他推荐的默认值$cargo+nightly install--path--没有默认功能——功能使用_jemalloc，允许_avx2，不稳定\n弗劳克现在在板条箱上。io，所以运行cargo install frawk和所需的功能也应该可以工作。\n虽然frawk中没有经过深思熟虑的unix ISM，但我还没有在Windows上测试过它。\n弗劳克有虫子，还有许多粗糙的边缘。如果你注意到frawk中有一个bug，提交一个问题并解释如何重现错误将非常有帮助。无法保证修复的响应时间或延迟。没有人全职在frawk上工作。同样的策略适用于功能请求。", "note_en": "frawk is a small programming language for writing short programs processingtextual data. To a first approximation, it is an implementation of the AWK language; many common Awk programsproduce equivalent output when passed to frawk. You might be interested in frawkif you want your scripts to handle escaped CSV/TSV like standard Awk fields, orif you want your scripts to execute faster.\n  Benchmarks:A sense of the relative performance of frawk and other tools when processinglarge CSV or TSV files.\n Builtin Functions Reference:A list of builtin functions implemented by frawk, including some that are newwhen compared with Awk.\n   You will need to  install Rust. If you would like to usethe LLVM backend, you will need an installation of LLVM 12 on your machine:\n See  this site for installation instructions on some debian-based Linux distros.See also the comments on  this issue for docker files thatcan be used to build a binary on Ubuntu.\n On Arch  pacman -Sy llvm llvm-libs and a C compiler (e.g.  clang) are sufficient as of September 2020.\n Depending on where your package manager puts these libraries, you may need topoint  LLVM_SYS_120_PREFIX at the llvm library installation (e.g. /usr/lib/llvm-12 on Linux or  /usr/local/opt/llvm@12 on Mac OS when installing llvm@12 via Homebrew).\n  While the LLVM backend is recommended, it is possible to build frawk only withsupport for the Cranelift-based JIT and its bytecode interpreter. To do this,build without the  llvm_backend feature. The Cranelift backend providescomparable performance to LLVM for smaller scripts, but LLVM&#39;s optimizationscan sometimes deliver a substantial performance boost over Cranelift (see the benchmarksdocument for some examples of this).\n  frawk currently requires a nightly compiler by default. To compile frawk using stable,compile without the  unstable feature. Using  rustup default nightly, or some othermethod to run a nightly compiler release is otherwise required to build frawk.\n  With those prerequisites, cloning this repository and a  cargo build --releaseor  cargo [+nightly] install --path &lt;frawk repo path&gt; will produce a binary that you canadd to your  PATH if you so choose:\n $ cd &lt;frawk repo path&gt;# With LLVM$ cargo +nightly install --path .# Without LLVM, but with other recommended defaults$ cargo +nightly install --path . --no-default-features --features use_jemalloc,allow_avx2,unstable\n frawk is now on  crates.io, so running cargo install frawk with the desired features should also work.\n While there are no  deliberate unix-isms in frawk, I have not tested it on Windows.\n  frawk has bugs, and many rough edges. If you notice a bug in frawk, filing an issuewith an explanation of how to reproduce the error would be very helpful. There areno guarantees on response time or latency for a fix. No one works on frawk full-time.The same policy holds for feature requests.", "posttime": "2022-02-15 21:36:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,输入,fast,frawk", "title": "Frawk：一种用Rust编写的快速、紧张、静态输入的AWK", "title_en": "Frawk: A fast, JITted, statically-typed AWK written in Rust", "transed": 1, "url": "https://github.com/ezrosent/frawk", "via": "", "real_tags": ["rust", "输入", "fast", "frawk"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073530, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你可能在一周前询问一位经理时看到过这样一个疯狂的故事：出现的新员工与我们采访的人不一样。如果没有，花一分钟读故事；这是一段相当长的旅程。简而言之：公司面试了一个人，雇佣了他，但当他第一天上班时；mldr那是一个完全不同的人。\n这个故事传遍了我所有的在线社交团体，我们大多只是嘲笑它有多奇怪。但有一次，谈话继续进行，我们开始认真对待，讨论如果这件事发生在我们身上，我们会如何应对。一位朋友问：“如果这是你的雇佣，而你的经理要求你改变雇佣习惯以防止这种情况发生，你会怎么做？”\n没有什么我什么也不做。我不会试图阻止候选人在面试时让其他人冒充他们。\n这里的前提很简单：围绕病理病例设计一个人类过程会导致自身病理的过程。\n招聘流程旨在根据“适合角色”的范围来衡量候选人；他们试图预测应聘者如果被录用，表现会有多好（或差）。因此，我们选择过程衡量与工作绩效相关的行为。但是这种行为——在面试席上，别人假装你是这样的人，这是任何人都无法想象的事情。\n如果我们开始想象在面试过程中增加一些步骤来防止冒名顶替的求职者，那么我们想出的“解决方案”是相当积极的。我们可以通过视频（或面对面）要求应聘者查看带照片的身份证，并将身份证与简历进行匹配。但这看起来很奇怪。它以敌对的方式开始面试，并向面试官发出强烈的不信任信息。诚实的候选人——记住，他们是绝大多数人——会想知道为什么这家公司的行为如此怪异，并且会正确地将其视为公司文化的一面红旗。这将对你的招聘行为产生负面影响。例如，任何名字与政府身份证不符的人都可能被迫做出令人不安的解释。祝贺你：你试图识别欺诈者，却意外地创造了一种跨恐惧症的雇佣行为。\n当我们设计软件系统时，我们学会了深入思考角落的情况。我们进行防御性编码，确保我们的系统能够处理各种不寻常的事件。Amazon承诺对存储在S3中的对象有99.99999999%的可靠性，即使如此，我也编写了代码来处理对象消失后0.00000000 1%的变化。\n设计人类系统是不同的。计算机没有情感；我不必担心每次都在防御性地检查完整性时会侮辱绝大多数S3对象。但人类是不同的；当我们在不寻常的情况下设计一个人类系统时，我们确实需要考虑对大多数人的影响。有时——这就是其中之一——解决古怪行为需要采取不可接受的步骤。\n事实并非总是如此——例如，防止金融欺诈往往依赖于突击审计等做法，这对诚实的人和欺诈者来说都是不舒服的。但盗用公款的成本非常高，各组织可以证明审计是合理的。\n但在这起招聘案件中，欺诈的代价是&amp；mldr真的很低吗？事实上，这个系统基本上起到了作用：这个人在第一天出现，立即被认作其他人，并在一周内辞职。\n当出现问题时，我们的冲动是试图做出某种改变，以防止问题的发生。但当我们谈论人类系统时，我们需要衡量成本。预防人类系统中的病理行为通常会产生非常不舒服和令人不快的过程。在人类系统中，并非所有角落的案例都需要修复。有时候最好的反应就是翻白眼，说“大家，我说得对吗？”然后回去工作。", "note_en": "You may have seen this wild story from Ask A Manager a week ago:  the new hire who showed up is not the same person we interviewed. If not, take a minute to read the story; it’s quite a ride. In short: the company interviewed someone, hired him, but when he showed up for his first day of work &amp;mldr it was a totally different person.\n The story made the rounds of all my online social groups, where we mostly just laughed at how bizarre it was. But in one Slack, the conversation continued, and we started taking it seriously, discussing how we’d respond if this happened to us. A friend asked, “if this was your hire, and you manager asked you to change your hiring practices to prevent this, what would you do?”\n Nothing. I would do nothing. I would not try to prevent candidates from getting someone else to pose as them during interviews.\n The premise here is simple:  designing a human process around pathological cases leads to processes that are themselves pathological.\n Hiring processes are designed to measure candidates on a “fit for the role” spectrum; they try to predict how well (or poorly) a candidate would perform, if hired. So we our selection process measures behaviors correlated with job performance. But this behavior – having someone else pretend to be you during a job interview – is so far outside anything that normal people would consider that it’s simply not measurable on the same axis as anything job-related.\n If we start to imagine adding steps to the interview process to protect against an imposter job candidate, the “solutions” we come up with are quite aggressive. We could ask candidates on video (or in person) to see a photo ID and match the ID against the resume. But this would seem very weird. It starts an interview off in a hostile manner, and send the a strong message of distrust. Honest candidates – which are, remember, the vast majority – will wonder why the heck this company is acting so weird, and will rightly see this as a red flag about the company culture. There will be negative consequences for your hiring practices. For example, anyone who goes by a name that doesn’t match their government ID could be forced into an uncomfortable explanation. Congratulations: your attempt to identify fraudsters has accidentally created a transphobic hiring practice.\n When we design software systems, we learn to think deeply about corner cases. We code defensively, making sure our systems handle all sorts of uncommon events. Amazon promises 99.999999999% reliability on objects stored in S3, and even then I’ve written code that handles the 0.000000001% change that an object disappears.\n Designing human systems is different. Computers don’t have emotions; I don’t need to worry insulting the vast majority of S3 objects when I defensively check integrity every time. But humans are different; when we design a human system around uncommon cases, we do need to consider the ramifications on the majority. There are times – and this is one of them – where addressing outlandish behavior requires steps that are just unacceptable.\n This isn’t always the case — preventing financial fraud, for example, often leans on practices like surprise audits, which are uncomfortable for honest people and fraudsters alike. But the cost of embezzlement is high enough that organizations can justify audits.\n But the cost of fraud in this hiring case is &amp;mldr pretty low actually? In fact, the system basically worked: this person showed up on his first day, was immediately recognized as someone else, and quit within the week.\n When something goes wrong, our impulse is to try to make some sort of a change that prevents that problem from ever happening against. But when we’re talking about human systems, we need to measure the cost. Preventing pathological behavior in human systems often creates highly uncomfortable and off-putting processes. In human systems, not all corner cases need fixes. Sometimes the best response is just to roll your eyes, say “people, am I right?” and get back to work.", "posttime": "2022-02-15 21:34:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "经理,manager,面试", "title": "那个疯狂的问经理的故事", "title_en": "That Wild Ask a Manager Story", "transed": 1, "url": "https://jacobian.org/2022/feb/14/that-wild-aam-story/", "via": "", "real_tags": ["经理", "manager", "面试"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073529, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们写东西不是为了记住它们。我们把它们写下来以便忘记。\n就像猎人/采集者把猎物藏起来一样，我们偶然发现的想法和联系让人觉得有价值、稀有，值得保存。我们把在网上发现事物的时间视为价值所在。那一次肯定没有白费。\n然后我们就被我们的发现压得喘不过气来。当你仍然把旧的东西铭记在心时，很难专注于新的东西。\n所以我们把事情写下来。把它们加入书签。把它们加入我们的阅读清单。强调我们的发现。列一长串清单，检查两次。我们需要一个洞穴，一个仓库，一个藏匿我们发现的地方。\n夏洛克·福尔摩斯在BBC的演绎中建造了一座寓言中的心灵宫殿，这是一座想象中的城堡，用来存放他的线索和概念，供日后回忆。拥有一般记忆力的普通人转而使用笔记和书签应用程序，他们承诺成为我们的“第二大脑”，帮助我们“记住一切”\n他们确实做到了，有一段时间。你想到了什么，把它写下来，然后感到自由。找到其他内容，将其添加到书签中，然后无需担心地关闭选项卡。如果你还需要这个发现，只需几次点击即可。安慰剂效应，或者至少是新的应用程序效应是真实的。\n通过放手，你为新任务腾出了空间。不再有几十个标签永远打开；你救了他们，然后让他们回到乙醚里。对一个想法没有永恒的思考；你把它写下来，让你的第二个大脑记住。\n那我们就自由了。我们跟踪了猎物，保护它以备日后食用。我们可以放心地忘记。我们为错误记忆投保了。现在继续下一个任务，寻找新的藏品。\n那&#39；这就是笔记本电脑、笔记应用程序、书签工具以及其他帮助我们记忆的东西的真正价值。它们是创意的保险。他们让我们忘记了。\n《把事情做完》的作者大卫·艾伦（David Allen）宣扬，遗忘的自由是GTD帮助你提高工作效率的核心方式。“如果你只把事情记在脑子里，就没有真正的方法实现我承诺的那种放松控制，”他建议道。\n所以GTD推荐一个收件箱来记录你脑海中闪过的每一项任务和想法。你把事情写下来，忘记它们，相信它们会在你需要的时候回来。然后，你要组织任务并确定其优先级，委派任务并执行任务，翻阅档案，看看你是如何实际完成任务的。\n然而，清空大脑的第一步才是真正重要的。我们的大多数想法和我们发现的随机事物实际上都没有价值。我们会把它们写下来，然后再也不考虑它们。你可以把它们写下来，然后在纸上生火，把灰烬撒到风中，得到同样的值。\n问题是我们认为我们的想法和发现很有价值。他们花时间思考和发现；他们必须有价值。我们害怕失去他们。正如丹尼尔·卡尼曼（Daniel Kahneman）在快速和慢速思维中解释的“损失厌恶”概念，“对损失的反应比对收益的反应更强烈。”我们会担心从银行账户损失100美元，而不是突然获得150美元。我们害怕失去同样的想法。这是生物性的，自然地被选入我们的DNA：“将威胁视为比机遇更紧迫的生物有更好的生存和繁殖机会。”\n时间和思想对我们来说是有价值的，所以我们也不愿意失去它们。足够让我们害怕失去我们已经发现的东西，而不是支持获得新的想法。\n“我不想扔掉任何东西。至少现在还不想，”威廉·杰马诺在重写早期草稿时写道。“我告诉自己，我可能会改变主意。”\n“杀了你的宝贝，”亚瑟·奎勒·科奇爵士建议道。但是扔掉完美的散文是很痛苦的。我们犹豫不决，手指悬停在删除按钮上，不愿意删除我们喜欢的单词。史蒂文·金（Steven King）在写作中警告说，“杀死你的宝贝会让你这个以自我为中心的小涂鸦者心碎。”。\n所以我们囤积。试着用错位的损失厌恶来记住这一切，只会在一百万张打开的精神标签的重压下感到疲惫，削弱我们记住重要事情的能力。\n这就是为什么笔记和书签应用对我们如此有价值。他们承诺为我们所有短暂的突发奇想建立一个仓库，这看起来像是我们迫切需要的救赎。在完成事情的祭坛上免除拖延。\n笔记让我们同时忘记和记住。不再厌恶损失；我们可以有自己的想法，也可以忘记它们。我们可以修剪，但仍能留住我们的宝贝。\n我们需要感到安全，我们的记忆不是徒劳的，如果我们想再次回忆，它们会在那里。只有这样我们才能放手。\n然后裂缝出现了。你读了新的东西，有了新的想法。然后你去保存它，感觉到一丝似曾相识，以为你以前见过这件事，却找不到记忆。想想看，你也从来没有用过那些被谋杀的宝贝。你对第二个大脑的信心动摇了。\n丹·希伯（Dan Shipper）发现，翻阅旧笔记突然“感觉像是在陈旧的垃圾中筛选”，在漫游研究中建立了一系列笔记后，他大失所望。事实证明，我们的大多数想法和发现实际上都没有那么大的价值，不管怎样，它们本身也没有价值。\n但有些东西真的很好；我们将利用这一点，至少从我们储蓄的1%中获得价值。然后你试图重新定位一个便条，却发现你最喜欢的应用程序的搜索似乎没有你最初想象的那么好。\n现在我们不再觉得忘记是安全的了。咒语被打破了；现在我们的第二个大脑变成了灰尘，我们又回到了试图回忆一切的时候。\n所以我们再试一次。下一个应用程序将是唯一真正的方式。我们以前的哲学都错了。箭头可能比清单更好。文件夹和层次结构与Wiki和反向链接。圣人在革命结束时看到了技术启蒙；我们只是还没有达到完美。\nEvernote到OneNote，Moleskins到Field Notes，漫游到Obsidian。我们归咎于工具和技术。他们当然是罪魁祸首。一个新的应用会更好。\n然后我们把最新的想法放进去，尝试最新的功能来组织笔记，直到我们安全地忘记事情。然后幻觉再次破灭，我们开始下一个新事物。\n然而，也许这些应用一直在让我们忘记。我们不需要书签和笔记，就像我们需要安全地放手一样。我们可以在任何地方保存我们的思想就足够了。\n当我们把想法写下来时，我们做了最重要的工作。“我写下来不是为了以后记住它，”每个Fields Notes笔记本都宣称，“我现在写下来是为了记住它。”写作的行为才是最重要的，它会在我们的大脑中留下重要的想法。这张便条本身就是一张让事情过去的许可证。\n注意和书签应用程序需要让我们感到安全。安全的是我们可以保存一切并忘记它，当我们回来时它会在那里。任何东西都可以是这样一个安全的地方，即使是一个普通的文档，一个草稿行，你添加的东西越多，它就越长。搜索、链接、组织、归档对你最重要的笔记来说都很好，但同样，最重要的东西会自己再次出现（最好的笔记应用程序可以做的其他事情，用你的照片“记忆”重新呈现像Apple Pictures这样的旧笔记）。你会一次又一次地遇到那些最好的想法；你的笔记最终只是你第一次遇到这个想法的记录。\n那就依靠它吧。把所有东西都倒在那里。无情地删掉你的文字，知道你可以把你的宝贝留到以后。把打开的标签和片段扫掉，相信它们会在你真正需要的时候出现。\n但是，嘿，存储很便宜。不妨让价值的幻觉继续下去，只要它能让你的精神安全得以忘却。", "note_en": "We don’t write things down to remember them. We write them down to forget.\n Like a hunter/gatherer stashing their prey, the ideas and the links we stumble upon feel valuable, rare, something worth saving. We ascribe value to the time we spend discovering things online. Surely that time wasn’t in vain.\n Then we’re burdened with our findings. It’s tough to focus on something new when you’re still holding the old in your mind.\n So we write things down. Bookmark them. Add them to our reading list. Highlight our findings. Make long lists and check them twice. We need a cave, a storehouse, somewhere to stash our findings.\n Sherlock Holmes, in BBC’s rendition, builds a fabled mind palace, an imaginary castle in which to stash his clues and concepts for later recall. Mere mortals with our average powers of recollection turn instead to notes and bookmarking apps, with their promises to be our “second brain” and help us “remember everything.”\n And they do, for a time. You think of something, write it down, and feel free. Find something else, bookmark it, and close the tab without worry. If you need that discovery again, it’s only a few taps away. The placebo effect—or, at least, the new app effect—is real.\n By letting go, you’ve cleared up space for new quests. No more dozens of tabs open forever; you saved them, then let them go back into the ether. No perpetual thinking on an idea; you wrote it down, let your second brain remember for you.\n Then we’re free. We’ve stalked the prey, secured it for later nourishment. We can safely forget. We’ve insured against faulty memories. Now on to the next quest, finding something new to stash.\n That&#39;s the true value of notebooks, notes apps, bookmarking tools, and everything else built to help us remember. They’re insurance for ideas. They let us forget.\n Getting Things Done author David Allen preached the freedom of forgetting as the core way GTD would help you be more productive. “There’s no real way to achieve the kind of relaxed control I’m promising if you keep things only in your head,” he advised.\n So GTD recommends an inbox to file every task and idea that flits through your mind. You write things down to forget them, trusting they’ll be there when you come back later and need them. Then, you’re to organize and prioritize the tasks, delegate and do them, flip back through the archives and see how you actually got things done.\n That first step of emptying your brain was what actually mattered, though. Most of our thought and the random things we discover aren’t actually valuable. We’ll write them down then never give them a second thought. You could get the same value by writing them down, then setting fire to the paper and scattering the ashes to the wind.\n  The problem is we ascribe value to our thoughts and findings. They took time to think up and find; they’ve got to be worth something. We’re scared to lose them. As Daniel Kahneman explains the concept of “Loss aversion” in   Thinking, Fast and Slow, “The response to losses is stronger than the response to gains.” We’d fear losing $100 from our bank account more than we’d value gaining $150 out of the blue. We fear losing our ideas the same. It’s biological, naturally selected into our DNA: “Organisms that treat threats as more urgent than opportunities have a better chance to survive and reproduce.”\n Time and thoughts have value, to us anyway, so we’re averse to losing them, too. Enough that we fear losing the things we’ve already found out more than we favor gaining new ideas.\n “I don’t want to throw anything out. At least not yet,” wrote William Germano in   On Rewriting of his early drafts. “I might change my mind, I tell myself.”\n “Murder your darlings,” advised Sir Arthur Quiller-Couch. But it hurts to throw out perfectly good prose. We hesitate, finger hovering over the delete button, reluctant to expunge the words we love. It’ll “break your egocentric little scribbler’s heart [to] kill your darlings,” warned Steven King in   On Writing.\n So we hoard. Try to remember it all with misplaced loss aversion, only to strain under the weight of a million open mental tabs and erode our ability to remember the important things.\n  That’s why notes and bookmark apps are so valuable to us. Their promise of a storehouse for all our fleeting whims looks like the salvation we so desperately need. Absolution from procrastination at the altar of getting things done.\n Notes let us forget and remember, simultaneously. No more loss aversion; we can have our ideas and forget them, too. We can cut and trim and still keep our darlings.\n We need to feel safe that our memories were not in vain, that they’ll be there if we want them again. Only then can we let go.\n Then the cracks appear. You read something new, think new thoughts. Then you go to save it and feel a tinge of déjà vu, think you’ve seen this thing before, yet you couldn’t find the memory. And, come to think of it, you never did use all those murdered darlings, either. Your faith in the second brain falters.\n Flipping through your old notes suddenly “feels like sifting through stale garbage,” as  Dan Shipper found, disillusioned after building a galaxy of notes in Roam Research. It turns out most of our ideas and discoveries aren’t actually worth that much, not on their own anyhow.\n But some of the stuff’s really good; we’ll use that, at least, get value from the 1% of what we save. Then you try to relocate a note, only to find that your favorite app’s search doesn’t seem to be as good as you thought it was at first.\n Now we don’t feel safe forgetting anymore. The spell is broken; back to trying to remember everything again, now that our second brain turned to dust.\n So we try again. This next app will be the one true way. We had the philosophy all wrong before. Arrows, perhaps, are better than checklists. Folders and hierarchies versus wikis and backlinks. The sages saw technological enlightenment at the end of the revolution; we simply haven’t attained perfection yet.\n Evernote to OneNote, Moleskins to Field Notes, Roam to Obsidian. We blame the tools, the techniques. Surely they’re to blame. A new app will be better.\n Then we dump our newest thoughts into it, try the latest features to organize notes, until we’re back to safely forgetting things. Then the illusion gets shattered again, and we’re on to the next new thing.\n Yet maybe the apps worked all along by letting us forget. We didn’t need bookmarks and notes as much as we needed the safety of letting go. Anywhere we could save our thoughts was enough.\n We did the most important work when we wrote the ideas down. “I’m not writing it down to remember it later,” declares every  Fields Notes notebook, “I’m writing it down to remember it now.” The action of writing is what counts, what imprints important ideas in our brain. The note itself is a permission slip to let things go.\n Note and bookmarks apps need to make us feel safe. Safe that we can save everything and forget it, that it’ll be there when we come back. Anything could be that safe place, even a plain document, a scratchpad, that gets longer the more things you add to it. Search, linking, organizing, filing—all good for your most important notes, but then again, the most important stuff will show up again on its own (something else the best notes apps could do, resurfacing older notes like Apple Pictures does with your photo “memories”). You’ll come across those best ideas again and again; your notes end up merely being a record of when you first encountered the idea.\n Then rely on it. Dump everything there. Cut mercilessly from your writing, knowing you can save your darlings for later. Sweep open tabs and snippets away, trusting they’ll be there if you really need them.\n  But hey, storage is cheap. Might as well keep the illusion of value going, as long as it gives you the mental safety to forget.", "posttime": "2022-02-15 21:28:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,创意,应用程序,apps,发现", "title": "Notes应用程序是创意消亡的地方。这很好。", "title_en": "Notes apps are where ideas go to die. And that’s good.", "transed": 1, "url": "https://reproof.app/blog/notes-apps-help-us-forget", "via": "", "real_tags": ["程序", "创意", "应用程序", "apps", "发现"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073528, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "旧金山警察犯罪实验室已经在一个用来识别犯罪嫌疑人的数据库中输入性侵犯受害者的DNA档案，地区检察官Chesa Boudin星期一说，这一指控引发了关于受害者隐私权的法律和伦理问题。\nBoudin说，他的办公室上周得知了这一据称的做法，几年前，一名女性在强奸检查中收集的DNA被用来将她与最近的财产犯罪联系起来。\n布丁说，如果在未经同意的情况下，将强奸工具包中的DNA用于调查潜在强奸案以外的目的，这可能违反了宪法对不合理搜查和扣押的保护，以及加利福尼亚州的《受害者权利法案》。\n这种做法还可以为性侵犯受害者提供另一种威慑，使他们不敢向执法部门举报已经少报的指控。\n布丁说：“我和我的办公室最关心的……是侦查和预防未来的犯罪。”。“我们希望旧金山尽可能安全，并且我们希望性侵犯的幸存者能够感到舒适和安全，并与执法部门合作。”\nBoudin说，他的办公室不知道性侵犯受害者的DNA在后来的案件中被用于确保他们被捕的次数。Boudin以隐私问题为由，没有提供有关该案的具体细节，他说，该案提醒了他的办公室注意犯罪实验室的政策，但他说，该案涉及一名多年前在家庭暴力和性虐待案件中接受强奸检查的妇女。\n布丁说，这名女子最近因涉嫌重罪财产犯罪而被捕，警方根据她作为受害者提供的强奸工具证据对她进行了辨认，布丁说。\n布丁说，他的办公室正在调查这种做法的范围，并研究如何处理任何使用这种证据的案件。Boudin说，该数据库可能包含数千名受害者的DNA档案，其中包含“很多很多年”的条目。\n旧金山市公安局局长Bill Scott说：“我认为，今天我们地方检察官提出的问题，充分考虑到我要求我的助理局长与我们的调查局合作，彻底审查这件事，并向我和D.A.的办公室伙伴汇报。”\n斯科特说，这起财产犯罪案件的嫌疑人可能是通过非受害者DNA数据库中的DNA匹配来确定的。\n尽管如此，斯科特说，“我们绝不能阻止犯罪受害者与警方合作，如果从强奸或性侵犯受害者身上收集的DNA真的被SFPD用于确认和逮捕另一犯罪嫌疑人，我将致力于结束这种做法。”\n斯科特说，该部门现有的DNA收集政策“已经过法律审查，符合州和国家法医标准。”\n旧金山警察局的犯罪实验室保存了大量DNA数据库，这些数据库主要是由犯罪嫌疑人或犯罪嫌疑人收集的DNA图谱。数据库中输入的DNA通常会与犯罪现场发现的证据进行比较。\n有地方、州和国家数据库，这些数据库可能包含不同的DNA输入标准。这些数据库中最著名的是联合DNA索引系统，它可以连接全国各地的DNA图谱。\nBodin说，从强奸案中输入DNA的数据库仅用于解决旧金山犯罪。\nD.A.官员说，他们不相信在检查前受害者的弃权签名中披露了使用从强奸工具包中收集的DNA将嫌疑人与犯罪联系起来的做法。Boudin说，“即使在细则的某个地方提到了这一点，这是否是一种适当的豁免，可以向刚进来报案的受害者寻求帮助？绝对不是。”\n旧金山监督员Hillary Ronen说，她对本周末被指控的做法感到警觉，她已经向市检察官办公室提交了一份调查案，起草法律以防止DNA证据——或者从受害者的强奸工具箱收集到的任何证据——用于调查强奸本身。\n检查你所在地区的缺水状况，并查看水库水位和湾区最大水域的限制清单。\n“既然我知道这是一个问题，我想立即停止在旧金山，”她说。“但我认为这不应该在任何级别的政府、任何地方进行。”\n倡导组织“结束对妇女的暴力行为国际”的首席执行官乔安妮·阿坎博说，她认为不应将受害者的DNA输入任何级别的数据库。\n“在这种情况下，我认为这是不合适的，除非在法医检查时告知受害者这种可能性，”她说。“我非常怀疑这种情况是否会发生。”\n卡米尔·库珀（Camille Cooper），强奸、虐待和虐待协会公共政策副总裁；她说，她以前从未听说过执法部门利用受害者的DNA将他们与其他犯罪联系起来。\n州参议员斯科特·维纳（Scott Wiener）称这一指控“极其令人不安”，并表示他的办公室正在调查州法律是否允许在未来的无关案件中使用强奸工具包DNA。\n“如果有必要，我会认真考虑引入州立法来禁止这种做法。”他说。\n《纪事报》的旗舰新闻播客。收听并订阅你最喜欢的应用程序。点击下面的播放器观看最新一集。\n检查你所在地区的缺水状况，并查看水库水位和湾区最大水域的限制清单。\n梅根·卡西迪是《纪事报》的犯罪记者，也报道警察、刑事司法问题和混乱。此前，卡西迪曾在亚利桑那州共和国工作，负责报道凤凰城警察局、治安官乔·阿帕约以及沙漠地区的犯罪和混乱。她是密苏里堪萨斯大学的两届毕业生，并在卡斯珀《星际论坛》、《美国国家地理杂志》和布宜诺斯艾利斯的一家在线出版物上工作。卡西迪可以在twitter上@meganrcassidy上联系到，只要你&#39；我会让她去的。", "note_en": "The San Francisco police crime lab has been entering sexual assault victims’ DNA profiles in a database used to identify suspects in crimes, District Attorney  Chesa Boudin said Monday, an allegation that raises legal and ethical questions regarding the privacy rights of victims.\n   Boudin said his office was made aware of the purported practice last week, after a woman’s DNA collected years ago as part of a rape exam was used to link her to a recent property crime.\n  If DNA from a rape kit were used without consent for purposes other than investigating the underlying rape case, it may be a violation of constitutional protections against unreasonable searches and seizures as well as  California’s Victims’ Bill of Rights, Boudin said.\n  Such a practice could also create another deterrent to sexual assault victims coming forward with allegations that are already underreported to law enforcement.\n    “The primary concern that I and my office have ... is with detecting and preventing future crime,” Boudin said. “We want San Francisco to be as safe as possible, (and) we want survivors of sexual assault to feel comfortable and safe reporting and cooperating with law enforcement.”\n  Boudin said his office is not aware of how many times a sexual assault victim’s DNA may have been used to secure their arrest in a later case. Citing privacy concerns, Boudin offered few specifics about the case that he said alerted his office to the crime lab’s policy, but said it concerned a woman who received a rape exam in a domestic violence and sexual abuse case years ago.\n  The woman, Boudin said, was recently arrested on suspicion of a felony property crime, with police identifying her based on the rape-kit evidence she gave as a victim, Boudin said.\n   Boudin said his office was investigating the scope of the practice, as well as studying what it would do with any cases that used this type of evidence. The database potentially includes thousands of victims’ DNA profiles, with entries over “many, many years,” Boudin said.\n  San Francisco Police Chief Bill Scott said “I think the questions raised by our district attorney today are sufficiently concerning that I have asked my assistant chief for operations to work with our Investigations Bureau to thoroughly review the matter, and report back to me and to our D.A.’s office partners.”\n  Scott said it was possible the suspect in the property crime case may have been identified through a DNA match in a non-victim DNA database.\n  Still, Scott said, “We must never create disincentives for crime victims to cooperate with police, and if it’s true that DNA collected from a rape or sexual assault victim has been used by SFPD to identify and apprehend that person as a suspect in another crime, I’m committed to ending the practice.”\n  The department’s existing DNA collection policies, Scott said, “have been legally vetted and conform with state and national forensic standards.”\n  The San Francisco Police Department’s crime lab maintains several DNA databases populated largely by DNA profiles gathered from suspects or people convicted of a crime. The DNA entered in the databases is routinely compared with evidence found at crime scenes.\n  There are local, state and national databases, which may carry different criteria for when DNA gets entered. The most well-known of these databases is the Combined DNA Index System, which can connect DNA profiles across the country.\n   The database where DNA is entered from rape kits is used solely to solve San Francisco crimes, Boudin said.\n  D.A. officials said they don’t believe the practice of linking suspects to crimes using DNA collected from rape kits is disclosed in a waiver victims sign before an exam. Boudin said, “Even if it were mentioned somewhere in the fine print, is that an appropriate waiver to seek from a victim who’s just come in and reported a sex assault? Absolutely not.”\n  San Francisco Supervisor Hillary Ronen said she was alerted to the alleged practice this weekend, and that she has submitted an inquiry to the City Attorney’s Office to draft legislation to prevent DNA evidence — or any sort of evidence collected from a victim’s rape kit — to be used for anything other than investigating that rape itself.\n  Check the water shortage status of your area, plus see reservoir levels and a list of restrictions for the Bay Area’s largest water districts.\n  “Now that I know that it is an issue I want to stop it immediately in San Francisco,” she said. “But I think that this should not be done at any level of government, anywhere.”\n  Joanne Archambault, chief executive officer for the advocacy group  End Violence Against Women International, said she doesn’t believe a victim’s DNA should be entered into a database at any level.\n  “In this situation, I think it’s inappropriate unless a victim is advised of that possibility at the time of the forensic medical examination,” she said. “And I doubt very much that that is happening.”\n  Camille Cooper, vice president of public policy at the Rape, Abuse &amp; Incest National Network, said she had never before heard of law enforcement using a victim’s DNA to connect them to other crimes.\n     State Senator Scott Wiener called the alleged practice “extremely troubling” and said his office was looking into whether state law allows rape-kit DNA to be used in future, unrelated cases.\n  “If necessary, I’ll seriously consider introducing state legislation to ban the practice,” he said.\n The Chronicle’s flagship news podcast.   Listen and subscribe on your favorite app. Click the player below for the latest episode.\n  Check the water shortage status of your area, plus see reservoir levels and a list of restrictions for the Bay Area’s largest water districts.\n Megan Cassidy is a crime reporter with The Chronicle, also covering cops, criminal justice issues and mayhem. Previously, Cassidy worked for the Arizona Republic covering Phoenix police, Sheriff Joe Arpaio and desert-area crime and mayhem. She is a two-time graduate of the University of Missouri, and has additionally worked at the Casper Star-Tribune, National Geographic and an online publication in Buenos Aires. Cassidy can be reached on twitter at @meganrcassidy, and will talk about true crime as long as you&#39;ll let her.", "posttime": "2022-02-15 21:22:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "旧金山,犯罪,francisco,dna", "title": "旧金山警方利用强奸案中的DNA将一名妇女与犯罪联系在一起", "title_en": "San Francisco police linked a woman to a crime using DNA from her rape exam", "transed": 1, "url": "https://www.sfchronicle.com/sf/article/San-Francisco-police-linked-a-woman-to-a-crime-16918673.php", "via": "", "real_tags": ["旧金山", "犯罪", "francisco", "dna"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073527, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为软件开发人员，我们总是争取更好的工具，但很少考虑字体。然而，我们大部分时间都在看屏幕，阅读和编写代码。使用错误的字体会对我们的工作效率产生负面影响，并导致错误。MonoLisa由专业人士设计，旨在提高开发人员的工作效率，减少疲劳。\n设计单空间字体要比传统的比例字体困难得多：所有字形的宽度都相同，这可能会导致字体枯燥或不可读。\nMonoLisa采用了一些独特的技术，提高了易读性，并使其在视觉上更易于长时间观看。\n增加字符宽度有助于我们设计出更自然、更开放的字体。形状更放松，长时间内眼睛疲劳更小。\n区分对于一个好的编码字体至关重要，因为它减少了歧义，并有助于避免可能导致软件错误的错误。\nMonoLisa有一组组合在一起的标志符号，但同时又足够清晰，所以你可以将它们区分开来。\n与常规字体相比，等距字体的暗色和浅色空间分布不均。MonoLisa通过使用独特的字母形状来保持平衡，仔细地弥补了这个问题。\nMonoLisa使用指向相邻字母的开放形式和终端（起点和终点），让眼睛流畅地跟随文本。\nMonoLisa的斜体字不仅仅是直立字体的倾斜版本。一些构造明显不同的标志符号起到了作用。\nMonoLisa配备了120多个专门设计的编码连接器。连字是一种特殊符号，将两个或多个字符组合在一起，使其看起来像一个标记。通过适当对齐特殊符号，连字有助于减少视觉噪音并平衡空白。\nMonoLisa的设计考虑到了开发人员。它是为数不多的几个带有符号的字体之一，可用于包括PowerLine在内的CLI。\n弗朗索瓦·èèèèèèèèèèèèèèèèếng ViệT\nMonoLisa由专业字体设计师、FaceType foundry联合创始人马库斯·斯特兹（Marcus Sterz）与软件开发商安德烈·奥科内奇尼科夫（Andrey Okonetchnikov）和朱霍·维普斯·莱宁（Juho Vepsäläinen）合作设计，他们在编程方面贡献了丰富的专业知识。\n这项合作的结果是一种获奖的编码字体，由专业人士为专业人士创建。", "note_en": "As software developers, we always strive for better tools but rarely consider font as such. Yet we spend most of our days looking at screens reading and writing code. Using a wrong font can negatively impact our productivity and lead to bugs. MonoLisa was designed by professionals to improve developers’ productivity and reduce fatigue.\n Designing a monospace font is much harder than a traditional, proportional one: being constrained by the same width of all glyphs can result in a boring or unreadable font.\n MonoLisa features a few unique techniques that increase the legibility and make it visually pleasant to look at for longer periods of time.\n Increased character width helped us designing a typeface with more natural, open forms. The shapes are more relaxed creating less eye strain over long periods of time.\n Distinction is critical for a good coding font since it  reduces ambiguity and helps avoid mistakes that can lead to software bugs.\n MonoLisa has a set of glyphs that fit together but at the same time are distinct enough so you can tell them apart.\n Monospaced fonts tend to have unevenly distributed dark and light space when compared to regular typefaces. MonoLisa carefully compensates the issue by using unique letter shapes to maintain the balance.\n MonoLisa uses open forms and terminals (starting and ending points) that are pointing towards the neighboring letters to let the eye follow the line of text fluently.\n The italics of MonoLisa are not simply slanted versions of the upright font. Some clearly differently constructed glyphs make the difference.\n  MonoLisa comes with  over 120 specially designed coding ligatures. Ligature is a special symbol that combines two or more characters together so it looks like one token. Ligatures help  reduce visual noise and balance white space by aligning special symbols appropriately.\n MonoLisa was designed with developers in mind. It’s one of the few fonts that comes packed with symbols to use in CLIs including PowerLine.\n  Français Русский Ελληνικά Tiếng Việt\n MonoLisa is designed by  Marcus Sterz, a professional typeface designer and co-founder of  FaceType foundry, in collaboration with software developers  Andrey Okonetchnikov and  Juho Vepsäläinen who contributed their vast expertise in programming.\n The result of this collaboration is an  award-winning coding font created  by professionals for professionals.", "posttime": "2022-02-15 21:19:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,设计,字体,开发人员,font", "title": "MonoLisa–为开发人员设计的字体", "title_en": "MonoLisa – A font designed for developers", "transed": 1, "url": "https://www.monolisa.dev", "via": "", "real_tags": ["开发", "设计", "字体", "开发人员", "font"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073526, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着飓风越来越频繁地登陆，我想要一个更好的解决方案，而不是每当我们遇到停电时，就给我的便携式发电机连接多条延长线。如果您使用过这种设置，您就知道这些窗户和门的缝隙（延长线的布线位置）容易让水和/或冷空气进入。\n相反，我在寻找一种操作和维护简单（即故障风险最小）的灵活设置。\n我很快就取消了备用发电机（带有自动转换开关），原因有三个：\n我不喜欢再担心另一个电子部件（即standyby gen的大脑）；\n发电机互锁只不过是一个滑动金属锁紧机构，允许用户打开主断路器或发电机反向馈电断路器。这种方法一次只允许任一断路器接通一个。\n这种简单而优雅的解决方案可以防止用户意外地将其便携式发电机的电力输送回公用事业线路，从而可能导致公用事业工人触电和/或死亡。\n在本文中，我将向您展示如何为我的Square D QO负载中心安装Square D发电机联锁套件。\n您需要记住，当您关闭主断路器时，外部仪表的导线（也称为电缆或“支腿”）将保持“热”或通电。\n直接（导体）或间接（凸耳螺母）接触它们将导致严重的伤害或死亡，因此绝对有必要格外小心。\n所以，在使用电的时候，请诚实地告诉自己你的技能。这篇文章向你展示了我是如何用20多年的DIYer经验做到这一点的。如有疑问，请咨询电工。\n放置便携式发电机对于避免致命废气（即一氧化碳）至关重要。\n我把发电机放在离房子大约45英尺的通风良好的地方。你需要确保发电机远离附近的窗户、门和通风口，因为废气可能会进入房子！\n记住，一氧化碳是一种无声的杀手，因为它是无色无味的。出于偏执，我在离发电机最近的泥房门口安装了一个一氧化碳探测器。你可能也想这么做。\n本项目假设您的便携式发电机有一个30安培联锁插座（NEMA L-14-30公插座–点击此处查看）。仔细检查，确保你的发电机有这个插头。\n我目前拥有一家百力通；斯特拉顿5500风暴响应器发电机，配备120/240伏交流30安培锁定插座，可接受NEMA L14-30公插座。\n据B&amp；S、 该插座可接受一个额定值为30安培（或更大）的240伏交流负载和60赫兹电源的4线电源线组，240伏的单相负载在22.9安培时需要高达5500瓦的功率，或两个独立的120伏负载，每个负载在22.9安培时。插座由两极摇臂开关断路器保护。\n**更新**我相信我现在5岁的B&amp；S Storm Responder 5500的排气阀漏气，所以我最终购买了一台CAT RP7500E便携式发电机。我很快会做一个回顾\n尽管便携式发电机的设计是在露天运行，但我发现，如果能很好地防止雨雪侵袭，即使它是一个临时结构（比如我在甲板角落的“屋顶”），问题也会少一些。\n我安装了Reliance Controls PR30/PB30电源输入盒（单击此处）以连接到发电机。这是一个极好的全金属盒子，非常耐用。\n然而，如果我必须买一个替代品，我会花额外的几美元买一个Reliance Controls PBN30塑料外壳的电源输入盒，30安培。\n虽然PBN30是由塑料制成的，但它的内部容量很大，因此更容易弯曲并在内部布线重型电线。更重要的是，NEMA连接器连接件位于底部，因此您无需担心水会滴入。\n这根电线是发电机与电源输入盒连接的方式。这是一种重型电缆，设计用于便携式电器、工具和设备。\n我制作了自己的电缆（由Carol cable制作，FT-2-P-7K-123033）以及NEMA L14-30公接头和母接头，因为当时我找不到35英尺长的电缆。\n但老实说，如果我必须重新做一次，我只会购买一根像Reliance Control PC3040 40英尺30安培L14-30发电机电源线这样的预制电源线，用于7500瓦的发电机。它实际上比我定制的电源线要好（稍微便宜一点，NEMA连接器防水）。\n如果你想了解更多关于布线尺寸的信息，请查看我的文章《室内电缆类型》\n此外，我会确保获得一条比必要时更长的电源线，这样你就可以灵活地移动发电机，而不必再购买另一条电源线。\n电缆的尺寸大致取决于电流、电压以及插座到主面板的距离。\n当时我很忙，所以我买了一根比我需要的大的电缆：AWG 8/3，AWG 10接地（电缆可以处理高达45安培的电流）\n与其他解决方案相比，我特别选择了Square D发电机联锁套件，因为它：\n安装更简单——你只需要添加一个断路器和一个金属滑块，作为主面板中的转换开关；\n更灵活–无需预先确定在紧急情况下要使用哪些电路。您可以打开或关闭安装在主面板或副面板上的任何断路器，只要您保持在便携式发电机的容量范围内；\n更可靠——整个设置只有两个简单的部分，因此与其他解决方案相比，失败的可能性更小。在不太可能发生的情况下，当一个反向馈电断路器发生故障时，您只需将其拔出，并更换一个新的断路器即可。涉及手动转换开关的故障（顺便说一下，手动转换开关有许多内部电子元件）很可能需要您断开所有电线并更换整个装置。当你没有权力时，这不是一个好的场景；\n请记住，在大多数情况下，您需要安装一个发电机联锁套件，该套件与负载中心的制造商相同。例如，我有Square D QO系列200安培负载中心，所以我需要购买Square D QO系列发电机联锁套件。\n我选择了Square D断路器，60安培，2极，QO260而不是QO230CP QO 30安培两极断路器，因为价格差异可以忽略不计，而且我一直喜欢尺寸过大规格的概念。\n尽管断路器的额定电流为60安培，但请记住，电源输入盒有NEMA-30连接器，只能接受30安培。\n如果我决定升级到50或60安培的服务，我需要更换电源插座盒和插座盒与主负载中心之间的服务电缆。\n在购买了所有必要的部件和工具后，请看一下我是如何将便携式发电机连接到我家的——第二部分，看看我是如何安装安装程序的。\nAllThumbsDIY。com参与了亚马逊服务有限责任公司联合项目，这是一个附属广告项目，旨在为网站通过广告和链接亚马逊来赚取广告费。通用域名格式。\n此外，AllThumbsDIY。com还参与了其他各种联盟项目，我们有时通过链接购买产品来获得佣金。", "note_en": "With hurricanes coming ashore more often, I wanted a better solution than running multiple extensions cords to my portable generator whenever we experienced a power outage. If you have used this setup, you know those windows and door gaps (where the extension cords are routed) tend to let in water and/or freezing cold air.\n Instead, I was looking for a flexible setup that was simple (i.e. minimal failure risk) to operate and maintain.\n  I quickly eliminated the standby generator (comes with an automatic transfer switch) for three main reasons:\n I did not like having yet another electronic part (i.e.brain of the standyby gen) to worry about;\n     Generator interlock is nothing more than a sliding metal locking mechanism that allows a user to either turn on the main breaker or the generator backfeed circuit breaker. This method only allows either circuit breaker to be ON one at a time.\n This simple, but elegant solution prevents a user from accidentally sending electricity from his portable generator back out to utility lines, where it can possibly electrocute and/or kill an utility worker.\n In this article, I am going to show you how I installed a   Square D Generator InterLock kit, for my Square D QO load center.\n   You need to remember that when you turn off the main breaker, conductors (a.k.a. cables or “legs”) from the outside meter will remain  “HOT” OR ENERGIZED.\n Touching them directly (conductors) or indirectly (lug nuts) will result in serious injury or death so  extreme caution is absolutely necessary.\n So please be honest with yourself about your skills when working with electricity. This article shows you how I did it with 20+ years of experience as a DIYer. When in doubt, please consult with an electrician instead.\n  The placement of your portable generator is critical to avoid deadly exhaust gas (i.e. carbon monoxide).\n I placed my generator in a well ventilated area approximately 45 feet away from the house. You need to make sure that the generator is away from nearby windows, doors and ventilation intakes where exhaust gas could enter the house!\n Remember, carbon monoxide is a silent killer because it is odorless and colorless. Being paranoid, I installed a carbon monoxide detector by the mudroom door nearest to the generator. You may want to do the same.\n  This project assumes that your portable generator has a 30 Amp interlocking receptacle ( NEMA L-14-30 male receptacle – click here to see). Double check to make sure that your generator has this plug.\n   I currently own a Briggs &amp; Stratton 5500 Storm Responder generator which comes with a 120/240 Volt AC, 30 Amp, locking receptacle that accepts NEMA L14-30 male receptacle.\n  According to B&amp;S, this receptacle accepts a 4-wire cord set rated for 240 Volt AC loads at 30 Amps (or greater) and powers 60 Hz, single phase loads requiring up to 5,500 watts of power at 22.9 Amps for 240 Volts or two independent 120 Volt loads at 22.9 Amps each. The outlet is protect by a two pole rocker switch circuit breaker.\n **UPDATE** I believe my now-5-years-old B&amp;S Storm Responder 5500 has a blown exhaust valve so I ended up purchasing a CAT RP7500E portable generator. I will do a review of it soon\n   Although portable generators are designed to operate in the open, I found that I tend to have less issues when it is well protected from rain and snow, even if it is a temporary structure (like my “roof” in the corner of my deck).\n   I installed a  Reliance Controls PR30/PB30 power inlet box (click here) to connect to the generator. It is an excellent, all-metal box which makes it super durable.\n However, if I had to buy a replacement, I would spend the few extra $ and buy a  Reliance Controls PBN30 Plastic Case Power Inlet Box, 30-Amp .\n  Although PBN30 is made of plastic, it has a large interior capacity which makes it easier to bend and route the heavy duty wires inside. More importantly, NEMA connector hookup is located on the bottom so you never have to worry about water dripping in.\n  This cord is how the generator gets connected to the Power Inlet Box. It’s a heavy duty electric cable designed to be use with portable appliances, tools and equipment.\n I made my own cable (made by Carol Cable, FT-2-P-7K-123033) along with NEMA L14-30 male and female connectors because at the time, I could not find one that was 35 feet long.\n But honestly, if I had to do it over, I would just purchase a pre-made cord like this  Reliance Controls PC3040 40-Feet 30-Amp L14-30 Generator Power Cord for Up to 7500-Watt Generators . It’s actually better than my custom made cord (slightly cheaper and NEMA connectors are water-tight).\n If you want to know more about wiring sizes, check out my post  Indoor Electric Cable Types\n Also, I would make sure to get a longer cord than necessary so you have the flexibility to move your generator around without having to buy another cord.\n   The size of the cable roughly depends on the amps, voltage and the distance from the receptacle to the main panel.\n I was in a hurry at the time so I ended up purchasing a cable that was larger than I needed:  AWG 8/3 with AWG 10 ground (cable can handle up to 45 Amps)\n  I specifically chose the Square D generator interlock kit over other solutions because it is:\n Simpler to install – You just need to add a circuit breaker and a metal slider that will act as a transfer switch in the main panel;\n More Flexible – No need to pre-identify which circuits you want to use during an emergency. You can turn on or off any circuit breakers installed in your main or subpanel, as long as you remain within your portable generator’s capacity;\n More Reliable – The whole setup has just two simple parts so it is less likely to fail than other solutions. In the unlikely event when a backfeed circuit breaker fails, you simply need to yank it out and replace it with a new one. A failure involving a manual transfer switch (which by the way has many internal electronic components) would most likely require you to disconnect all wires and replace the entire unit. Not a good scenario when you don’t have power;\n Please keep in mind that in most situations, you will be required install a generator interlock kit that is from the same manufacturer as that of your load center. For example, I have Square D QO Series 200 amp load center so I needed to purchase a Square D QO Series generator interlock kit.\n  I chose the   Square D Circuit Breaker, 60 Amp, 2-Pole, QO260 instead of the   QO230CP QO 30-Amp Two-Pole Circuit Breaker because the price difference was negligible and I always liked the concept of over-sizing specifications.\n Although the breaker is rated at 60 amps, please remember that the power inlet box has NEMA-30 connector that can only accept 30 amps.\n Should I decide the upgrade to a 50 or 60 amp service, I would need to replace both the power inlet box and the service cable between the inlet box and the main load center.\n  After purchasing all necessary parts and tools, head over to  How I Connected My Portable Generator to My Home – Part 2  to see how I installed my setup.\n AllThumbsDIY.com participates in the  Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to Amazon.com.\n Additionally, AllThumbsDIY.com participates in various other affiliate programs, and we sometimes get a commission through purchases made through our links.", "posttime": "2022-02-15 21:12:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "连接,portable,发电机", "title": "将便携式发电机连接到家用主配电盘", "title_en": "Connecting a Portable Generator to the Home Main Electric Panel", "transed": 1, "url": "https://allthumbsdiy.com/electrical/connecting-a-portable-generator-to-the-home-main-electrical-panel-part-1", "via": "", "real_tags": ["连接", "portable", "发电机"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073525, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "ProteusISC是一个Linux JTAG控制器抽象库和驱动程序框架。它用于使用JTAG控制器通过JTAG与设备通信。", "note_en": "ProteusISC is a Linux JTAG controller abstraction library and driver framework. It is used for communicating to devices via JTAG using a JTAG controller.", "posttime": "2022-02-15 21:12:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "jtag", "title": "ProteusISC–JTAG控制器抽象库", "title_en": "ProteusISC – JTAG Controller Abstraction Library", "transed": 1, "url": "https://github.com/diamondman/proteusisc", "via": "", "real_tags": ["jtag"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073524, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "荷兰消费者和市场协会（Dutch consumer and markets association）裁定，苹果为约会应用提供商制定的修订条件不合理，为制造商制造了不必要的障碍。\n苹果公司的新条款规定，约会应用提供商如果想使用另一种支付系统，必须开发一款全新的应用程序——正如ACM去年订购的那样。\nACM去年8月告诉苹果，它必须调整加入荷兰应用商店的条件，以便约会应用提供商可以使用苹果自己的支付系统以外的支付系统。\n上个月，ACM表示，苹果未能“满足要求”，现在需要支付第一笔罚款。\n在另一项裁决中，ACM现在表示，苹果施加的新条件不仅不合理，而且与之前的条件不一致。\nACM表示，要求应用程序制造商制作一款全新的应用程序，以便能够使用替代支付系统，这增加了他们的成本，也将影响到必须更换系统的消费者。\n在这家美国科技巨头面临的不断增长的罚款总额上，该机构现在又增加了500万欧元的罚款，使罚款总额达到2000万欧元。\n达奇纽斯。nl团队要感谢最近几周捐款的所有慷慨的读者。你们的财政支持帮助我们将冠状病毒危机的报道范围扩大到晚上和周末，并确保你们及时了解最新的事态发展。\nDutchNews。nl已经免费14年了，但如果没有读者的经济支持，我们将无法为您提供关于荷兰所有事物的公平准确的新闻和特写。你的贡献使这成为可能。", "note_en": "The revised conditions that Apple has drawn up for dating app providers are unreasonable and create unnecessary barriers for makers, the Dutch consumer and markets association has ruled.\n Apple’s new conditions state that dating app providers must develop a completely new app if they want to be able to use an alternative payment system – as ordered by the ACM last year.\n The ACM told Apple last August it had to adjust its conditions for inclusion in the Dutch App Store so that dating app providers can use payment systems other than Apple’s own.\n  Last month, the ACM said Apple had failed to ‘satisfy the requirements’ and is now liable for the first penalty payment.\n In yet another ruling, the ACM now says that the new condition imposed by Apple is not only unreasonable, but is also at odds with its earlier one.\n Requiring app makers to make a completely new app to be able to use alternative payment systems is adding to their costs, and will also impact on consumers who will have to change systems, the ACM said.\n The agency has now added a further €5m in fines to the growing tally facing the US tech giant, taking the total to €20m.\n    The DutchNews.nl team would like to thank all the generous readers who have made a donation in recent weeks. Your financial support has helped us to expand our coverage of the coronavirus crisis into the evenings and weekends and make sure you are kept up to date with the latest developments.\n DutchNews.nl has been free for 14 years, but without the financial backing of our readers, we would not be able to provide you with fair and accurate news and features about all things Dutch. Your contributions make this possible.", "posttime": "2022-02-15 21:10:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,市场,authority", "title": "荷兰市场管理局（Dutch markets authority）向苹果的约会应用支付罚款增加500万欧元", "title_en": "Dutch markets authority adds €5m to Apple’s dating app payment penalty", "transed": 1, "url": "https://www.dutchnews.nl/news/2022/02/dutch-markets-authority-adds-e5m-to-apples-dating-app-payment-penalty/", "via": "", "real_tags": ["苹果", "apple", "市场", "authority"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073523, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们喜欢async Rust，同上。我们是早期采用者，早在async/await变得稳定之前，我们就在网络代码中使用未来和流。我们的产品是一个完美的用例。它&#39；在I/O方面，有大量的对等连接同时同步数据，我们需要在手机等低功耗设备上高效地使用所有核心。\n异步中的一个常见挑战是编写好的测试。举个简单的例子：下面我们创建一个假设的连接。如果10秒钟内没有活动，它应该在内部超时并关闭其事件通道。我们可以编写一个测试来验证这一点：\n#[tokio:：test]异步fn test_timeout_ocurses（）{//创建连接让mut conn=Connection:：new（）.Wait；//等待一段时间延迟_for（Duration:：from_secs（11））.Wait.unwrap（）；//接收通道应该关闭assert_eq！（conn.try_recv（）.unwrap_err（），tryrecveror:：Disconnected）}\n这个测试的一个问题是执行总是需要11秒：10秒等待超时加上安全系数。缓慢的测试对开发人员和CI/CD来说都是一个巨大的麻烦。想象一下，如果是30分钟。你的CI运行至少需要30分钟，这都是因为这一次测试！\n一个相关的挑战是测试计时器是否过期。在这里，我们确保事件频道在5秒时仍然打开：\n#[tokio:：test]异步fn test_timeout_not_Occurse（）{//创建连接让mut conn=Connection:：new（）.Wait；//等待时间小于其他测试延迟中的时间（持续时间：：from_secs（5））.Wait.unwrap（）；//接收通道仍应打开（但没有值）assert_eq！（conn.try_recv（）.unwrap_err（），TryRecvError:：Empty）；]\n这个测试也很慢，在5秒钟内称重，但有一个更隐蔽的问题。想象一下，我们的连接出现了一个错误，导致它在4秒钟后关闭了通道。这个测试能抓住它吗？可能…但不一定。\n当内部4秒计时器过期时，必须执行一系列步骤。一个tokio worker线程必须被解列并轮询等待该计时器的任务。在注意到计时器已过期后，它会丢弃事件发送器，这向接收端指示通道已关闭。它&#39；这只是一小部分工作，但它&#39；它不是即时的，它必须与主测试任务同时运行。\n如果在高端开发机器（Rust开发者使用的机器）上运行这个程序，那么过期和通道关闭过程将在几毫秒内发生。当测试任务在1秒后执行断言时，几乎肯定会关闭通道并检测到错误。然而，在负载沉重的CI服务器上，线程之间可能存在激烈的竞争。处理内部超时可能会延迟1–2秒，测试似乎会通过。上一次测试的问题相反；如果内部超时被延迟，它将失败，即使测试的代码是正确的。\n这些测试是不确定的，会导致不稳定的CI：间歇性的构建失败，其中&#39；我们不确定你是否能相信结果。这是次优的。\n传统智慧认为你不应该&#39；不要这样构造代码。要测试的任何逻辑都应该表示为完全确定的同步代码，并从系统时钟中抽象出来。这对于小型单元测试来说是可以的，但在大型集成测试中却成了一个头疼的问题。我们的一些业务逻辑与异步行为有关。为什么可以&#39；我们不测试一下吗？我们的客户将如何体验？如果我们只测试同步部分，我们&#39；我们正在失去报道。\n在测试环境中，时间的流逝应该被抽象出来，这样无论延迟多长，测试都可以立即执行。\n测试应该是完全确定的：一个更早的计时器总是在一个更晚的计时器之前工作到完成。\n随着单元测试推进模拟时间，Instant:：now（）应该在触发每个计时器期间返回正确的中间时间。\n附加在计时器上的处理工作应该允许新的计时器在此过程中注册。\n同上，我们已经建立了一个内部库来解决所有这些问题。这个板条箱，同上，抽象了std:：time和东京定时器的功能。这里是第一次测试，除了现在使用这个库。\n#[test]fn test_timeout_occurrent_fast（）{let（time_control，_guard）=register_new_control（）；let rt=build_instrumented_runtime（&amp；time_control）；rt.block_on（async{let mut conn=Connection:：new（）.wait；time_control.advance（Duration:：from_secs（10））.wait；//&lt；--assert_eq！（conn.try_recv（）.unwrap)），TryRecvError:：Disconnected）}）\n该测试是可靠的，并立即完成。首先，有一个小样本，确保测试中的代码将使用模拟计时器，而不是真正的计时器。现在，请关注对时间控制的调用。advance（）。请注意，它将时间精确地向前移动10秒。然后在下一条线路上，通道保证关闭。\n这是最困难的部分。触发计时器是不够的。不知何故，我们必须知道接收计时器事件的代码何时完成了所有相关工作。这不是&#39；使用传统计时器是不可能的。我们没有&#39；我不知道相关的任务将在什么时候被安排，更不用说什么时候&#39；结束了。因此，在同上的时间里，期货是不同的，它们输出一个FrozenTimeControlGuard。\n{let _guard=ditto_time:：delay_for（Duration:：from_secs（10））.wait.unwrap（）//处理计时器事件//保护被丢弃；时间可以提前}\n事实证明，在几乎所有情况下，计时器驱动的代码在等待之后立即在单个块中执行所有相关处理。因此，我们所要做的就是创建一个像_-guard这样的绑定，现在我们有了一个值，可以在到达块的末尾时通知我们，因此时间可以继续。在不寻常的情况下，开发人员可以根据需要保留警卫。\n在单元测试代码中，警卫包含一个一次性发送器。在drop上，通道关闭，对advance（）的调用知道它可以转到下一个计时器。advance（）是一个异步循环，覆盖所有当前注册的计时器，一次触发一个计时器，并等待相应的通道关闭。在非测试代码中，根本没有通道，不需要额外的处理。\n最后一个技巧是正确选择真实计时器和模拟计时器，并确保它们与正确的时间控件相关联。Rust并行运行测试，因此可能有许多tokio运行时同时执行测试。如果我们试图使用全局存储，不同的测试将相互碰撞。\n解决方案是线程本地存储（TLS）。Tokio提供了在每个工作线程启动时运行代码的能力，这是一个存储Arc的机会&lt；时间控制&gt；。这就是测试中构建的测试运行时模板的目的。当被测代码调用delay_for（）时，它将动态创建正确变量的延迟未来：\n本地线程！（静态模拟_控件：RefCell&lt；Option&lt；Arc&lt；TimeControl&gt；=RefCell:：new（无））；发布fn延迟（持续时间：标准时间：持续时间）->；延迟{MOCK_CONTROL.with（|it | match it.borrow（）.as_ref（）{Some（CONTROL）=&gt；{let deadline=CONTROL.now（）+持续时间；延迟：：new_MOCK（CONTROL，deadline）}None=&gt；延迟：：真实（盒子：：引脚（东京：：时间：：睡眠（持续时间）），}\n#[test]fn test_timeout_occurrent_fast（）{let（time_control，_guard）=register_new_control（）；let rt=build_instrumented_runtime（&amp；time_control）；rt.block_on（异步{let mut conn=Connection:：new（）.wait；time_control.advance（持续时间：：from_secs（10））.wait；断言_eq！（conn.try_recv（）.unwrap_err（），TryRecvError:：Disconnected）}）\n创建了一个TimeControl实例，测试将使用该实例来提前计时，并且还将收集模拟计时器的注册。\n调用advance（）的持续时间为10秒。这将提前到10秒，允许连接中的所有代码运行。频道关闭了。\n第二个测试也可以进行类似的调整。如果通道在5秒或更短时间内关闭，我们&#39；你一定会抓住的。\n#[test]fn test_timeout_not_occurrent_fast（）{let（time_control，_guard）=register_new_control（）；let rt=build_instrumented_runtime（&amp；time_control）；rt.block_on（async{let mut conn=Connection:：new（）.wait；time_control.advance（持续时间：from_secs（5））.wait；assert_eq！（conn.try_recv（）.try_err（）.unwrap（），TryRecvError:：Empty）}）\n这种技术使Ditto能够在我们的客户使用的完全相同的异步代码上构建快速运行的单元测试，只需对代码进行适度的修改即可解决这些问题。测试让我们有信心将业务逻辑直接包含在异步层中，避免了将计时器驱动的代码构造为同步和异步组件的开销。我们相信async Rust有着光明的未来，我们的客户已经看到了它的好处。", "note_en": "We love async Rust at Ditto. We were early adopters, using futures and streams in our networking code long before async/await became stable. Our product is a perfect use case. It&#39;s I/O-heavy, there are numerous peer-to-peer connections synchronizing data concurrently, and we need to use all cores efficiently on low-powered devices like mobile phones.\n A common challenge in async is writing good tests. Take a simple example: below we create a hypothetical  Connection. If there is no activity for 10 seconds it should time out internally and close its events channel. We can write a test verifying this:\n #[tokio::test]async fn test_timeout_occurs() { // Create the Connection let mut conn = Connection::new().await; // Wait for a while delay_for(Duration::from_secs(11)).await.unwrap(); // The receive channel should have closed assert_eq!(conn.try_recv().unwrap_err(), TryRecvError::Disconnected);}\n One problem with this test is that it always takes 11 seconds to execute: 10 seconds to wait for the timeout plus a safety factor. Slow tests are a huge hassle for both developers and CI/CD. Imagine if it was 30 minutes instead. Your CI runs would take  at least 30 minutes, all because of this one test!\n A related challenge is testing for the  absence of a timer expiry. Here we ensure the events channel is still open at 5 seconds:\n #[tokio::test]async fn test_timeout_does_not_occur() { // Create the Connection let mut conn = Connection::new().await; // Wait less than in the other test delay_for(Duration::from_secs(5)).await.unwrap(); // The receive channel should still be open (but no value) assert_eq!(conn.try_recv().unwrap_err(), TryRecvError::Empty);}\n This test is also slow, weighing in at 5 seconds, but there is a more insidious problem. Imagine our  Connection had a bug which caused it to close the channel after only 4 seconds. Would this test catch it? Probably… but not necessarily.\n When that internal 4-second timer expires a series of steps must occur. A tokio worker thread must be unparked and poll the task which was waiting on that timer. Having noticed that the timer has expired it drops the events sender, which indicates to the receiving end that the channel is closed. It&#39;s only a small amount of work but it&#39;s not instantaneous, and it has to run concurrently with the main test task.\n If you run this on your high-end development machine (which is what Rust developers use) then that expiry-and-channel-close process will occur in a matter of milliseconds. By the time the test task performs the assertion 1 second later, the channel will almost certainly be closed and the bug will be detected. On a heavily-loaded CI server, however, there may be fierce contention between threads. Processing the inner timeout might be delayed by 1–2 real-world seconds and the test would appear to pass. The previous test has the same problem in reverse; if the inner timeout gets delayed it will fail, even though the code being tested is correct.\n These tests are non-deterministic and will result in flaky CI: intermittent build failures where you&#39;re not sure whether you can trust the results. This is suboptimal.\n Conventional wisdom says that you shouldn&#39;t structure your code this way. Any logic you want to test should be expressed as synchronous code which is fully deterministic and abstracted away from the system clock. This is okay for small unit tests but it becomes a headache in larger integration tests. Some of our business logic is tied up in async behavior. Why can&#39;t we test that, the way our customers will experience it? If we test only the sync parts we&#39;re losing coverage.\n  In a test context, passage of time should be abstracted so that tests execute near-instantly no matter how long the delays are.\n Tests should be fully deterministic: an earlier timer always gets to work to completion before a timer scheduled later.\n As a unit test advances mock time,  Instant::now() should return the correct intermediate time during the triggering of each timer.\n The processing work attached to a timer should allow new timers to be registered along the way.\n Ditto has built an internal library to address all of these problems. This crate,  ditto_time, abstracts over  std::time and the tokio timer functions. Here is the first test again, except now using this library.\n #[test]fn test_timeout_occurs_fast() { let (time_control, _guard) = register_new_control(); let rt = build_instrumented_runtime(&amp;time_control); rt.block_on(async { let mut conn = Connection::new().await; time_control.advance(Duration::from_secs(10)).await; // &lt;---- assert_eq!(conn.try_recv().unwrap_err(), TryRecvError::Disconnected); });}\n This test is reliable and completes immediately. First there is a little boilerplate which ensures the code under test will use mock timers instead of real ones. For now, focus on the call to  time_control.advance(). Notice that it moves time ahead precisely 10 seconds. Then on the next line, the channel is guaranteed to be closed.\n This is the most difficult part. It is not sufficient to trigger the timer. Somehow we have to know when the code which  received that timer event has finished doing all of its associated work. This isn&#39;t possible using conventional timer futures. We don&#39;t know when the associated task will get scheduled, let alone when it&#39;s finished. Therefore the futures in  ditto_time are different—they output a  FrozenTimeControlGuard.\n { let _guard = ditto_time::delay_for(Duration::from_secs(10)).await.unwrap(); // handle timer event // guard dropped; time can advance}\n It turns out that in almost all situations, timer-driven code does all of the relevant processing in a single block immediately following the  await. Therefore all we have to do is create a binding like  _guard, and now we have a value that can notify us when the end of the block has been reached—and therefore time can continue. In unusual cases the developer can preserve the guard as long as needed.\n  In unit test code the guard contains a oneshot sender. On drop the channel closes and the call to  advance() knows that it can move on to the next timer.  advance() is an async loop over all the currently-registered timers, triggering them one at a time and waiting for the corresponding channel to close. In non-test code there is no channel at all—no extra processing is required.\n The last trick is correctly selecting real vs mock timers, and ensuring that they are associated with the correct  TimeControl. Rust runs tests in parallel so there may be many tokio runtimes executing tests simultaneously. If we tried to use global storage, different tests will clobber each other.\n The solution is thread-local storage (TLS). Tokio offers  the ability to run code when each worker thread is started, which is an opportunity to store an  Arc&lt;TimeControl&gt;. This is the purpose of the  build_instrumented_runtime boilerplate in the test. When the code under test calls  delay_for() it will dynamically create a  Delay future of the correct variant:\n thread_local!( static MOCK_CONTROL: RefCell&lt;Option&lt;Arc&lt;TimeControl&gt;&gt;&gt; = RefCell::new(None));pub fn delay_for(duration: std::time::Duration) -&gt; Delay { MOCK_CONTROL.with(|it| match it.borrow().as_ref() { Some(control) =&gt; { let deadline = control.now() + duration; Delay::new_mock(control, deadline) } None =&gt; Delay::Real(Box::pin(tokio::time::sleep(duration))), })}\n  #[test]fn test_timeout_occurs_fast() { let (time_control, _guard) = register_new_control(); let rt = build_instrumented_runtime(&amp;time_control); rt.block_on(async { let mut conn = Connection::new().await; time_control.advance(Duration::from_secs(10)).await; assert_eq!(conn.try_recv().unwrap_err(), TryRecvError::Disconnected); });}\n A  TimeControl instance is created that the test will use to advance time, and will also collect registrations of mock timers.\n   advance() is called with a 10 second duration. This will advance to 10 seconds, permitting all of the code inside  Connection to run. The channel gets closed.\n The second test can be adapted similarly. If the channel closes in 5 seconds or less, we&#39;re guaranteed to catch it.\n #[test]fn test_timeout_does_not_occur_fast() { let (time_control, _guard) = register_new_control(); let rt = build_instrumented_runtime(&amp;time_control); rt.block_on(async { let mut conn = Connection::new().await; time_control.advance(Duration::from_secs(5)).await; assert_eq!(conn.try_recv().unwrap_err(), TryRecvError::Empty); });}\n This technique has enabled Ditto to build fast-running unit tests on exactly the same async code our customers use, with only modest code modifications to account for the guards. Testing gives us the confidence to include business logic directly in our async layer, avoiding the overhead of structuring timer-driven code into sync and async components. We believe async Rust has a bright future and our customers are already seeing the benefits.", "posttime": "2022-02-15 21:04:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,模拟,测试", "title": "异步Rust中的模拟时间", "title_en": "Mocking Time in Async Rust", "transed": 1, "url": "https://www.ditto.live/blog/mocking-time-in-async-rust", "via": "", "real_tags": ["rust", "模拟", "测试"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073522, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1995年，皮克斯动画工作室（Pixar Animation Studio）和迪士尼（Disney）推出了一部彻底改变了动画游戏的电影。《玩具总动员》是第一部完全由电脑动画制作的电影，讲述了当你的玩具被放在自己的设备上时会发生什么。这部电影打破了障碍和票房记录，成为皮克斯最著名、最永恒的故事之一。\n三年后，迪士尼准备发行备受期待的续集《玩具总动员2》。这部电影几乎完成了，正在进行最后的编辑和修改。然后，不可思议的事情发生了，有人按下按钮，在无助的皮克斯技术总监的注视下，电影文件被删除。\n奥伦·雅各布（Oren Jacob）现在是皮克斯（Pixar）的首席技术官，他是这部电影的助理技术总监，他回忆起当他看着文件消失时所感受到的绝对恐惧。他对下一个网站说，他试图阻止它，但什么也做不了。\n“他有一个错误，我忘记了确切的那个。就像是，“目录不再有效”，因为他在一个刚刚被删除的地方。然后他想走上[目录]，然后他走了回来，然后我们看到了哈姆、土豆头和雷克斯。然后我们再次看了看，只有哈姆，然后什么也没有。\n“主机器坏了，”雅各布说有些人正在制作一个镜头的动画，他们可以工作一分钟或五分钟，但最终你将不得不出于某种原因从主计算机中提取数据，你的计算机将冻结这些数据。\"\n“最终，每一位动画师，每一位TD，每一位在节目中工作的人都会说，“哦，所有的机器都坏了。”。我们去吃午饭吧。哈哈。\"\n雅各布说，当他们后来检查机器以检查保存的电影备份时，只剩下10%的电影文件。备份机出了问题，文件也不见了。所有的希望似乎都破灭了，但谢天谢地，有一个婴儿拯救了这一天。\n皮克斯公司的一位名叫加林·苏斯曼的员工是《玩具总动员2》的技术总监，她在孩子出生后一直在家工作。这部电影的文件每周自动发送给她，她把所有文件都保存在自己的家庭电脑上。\n文件是从苏斯曼的房子里取回的，电影也保存了下来！几乎雅各布承认，这部电影大约10%的文件从未被检索到，并且永远消失了，但他们能够让电影在没有场景的情况下工作。\n你认为《玩具总动员2》几乎永远消失了吗？请在评论中告诉我们！", "note_en": "In 1995, Pixar Animation Studio and Disney came out with a movie that completely changed the animation game.   Toy Story — a story about what happens when your toys are left to their own devices — was the first movie made that was completely by computer animation. The film broke both barriers and box office records and become one of Pixar’s most famous and timeless stories.\n  Three years later, Disney was getting ready to release the highly  anticipated sequel,  Toy Story 2 . The movie was nearly complete and final edits and changes were being made. Then, the unthinkable happened, someone hit a button and the film’s files were being deleted as helpless Pixar technical directors looked on.\n  Oren Jacob, now Chief Technical Officer at Pixar, was an assistant technical director on the movie and recalls the absolute dread that he felt as he watched the files disappear. He  spoke to  The Next Web and said that he tried to stop it, but couldn’t do anything.\n “He had an error, I forget the exact [one]. It was like, “Directory no longer valid,” because he’s in a place that had just been deleted. Then he thought to walk up [a directory] and he walked back up and then we saw Hamm, Potato Head, and Rex. Then we looked at it again and there was just Hamm and then nothing.\n The master machine goes down,” says Jacob. “Some people are animating a shot and they can work for like a minute or five minutes, but eventually you’ll have to pull data from the master machine for some reason or another, which your machine will freeze.”\n “Eventually every animator and, every TD, everyone working on the show goes, “Oh, all machines down. Let’s go to lunch. Ha, ha.”\n  Jacob said that when they checked the machines later to check on the film’s backups that were saved, only 10% of all of the film’s files remained. Something had gone wrong with the backup machines and the files were gone from there as well. All hope looked lost, but thankfully, there was a baby who saved the day.\n A Pixar employee named Galyn Susman, who was the supervising technical director on   Toy Story 2 had been working from home after the birth of her baby. The film’s files were automatically sent to her on a weekly basis, and she kept all of the files on her personal home computer.\n  The files were retrieved from Susman’s house and the film was saved! Almost. Jacob admits that about 10% of the film’s files were never retrieved and are gone forever, but they were able to make the film work without the scenes.\n What do you think about  Toy Story 2 almost being lost forever? Let us know in the comments!", "posttime": "2022-02-15 21:02:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "玩具,saved,电影", "title": "一个婴儿将《玩具总动员2》从近乎完全的删除中拯救出来（2021年）", "title_en": "A baby saved ‘Toy Story 2’ from near complete deletion (2021)", "transed": 1, "url": "https://insidethemagic.net/2021/09/toy-story-2-saved-from-deletion-ks1/", "via": "", "real_tags": ["玩具", "saved", "电影"]}]