[{"category": "", "categoryclass": "", "imagename": "b66da6fcde0ae4f30db2b12316a761b4.png", "infoid": 1035237, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人们为什么使用VIM的原因已经被相当广泛地讨论过了，所以我想我应该花一点时间来解释为什么我要教我的高中生VIM，即使是在2020年。\n这一切都始于2008年金融危机后不久，我被分配到一个由九年级到十二年级的混合班学习计算机科学。嗯，金融危机第一次让我开始教授使用VB6.0和Windows瘦客户机编程的入门课程，这本身就是一种体验(部分归功于Conficker病毒)。这段经历值得写一篇单独的博客文章，这也是为什么我的专长之一是教授计算机安全的一个很好的原因。\n因此，我与所有级别的学生在一起，包括AP CS A(读：AP CS Java)和过时的Windows PC(至少瘦客户端已经消失)。我不会安装任何软件，想教C语言，不得不教Java，而且我的选择很少(那是在基于Web的IDE在线出现之前的日子)。\n多亏了我在加州大学洛杉矶分校(UCSC)的出色教育，我有过使用UNIX命令行(主要是Sun工作站)的经验，所以这不是问题。我曾在20世纪90年代尝试过Linux，并取得了一定的成功，但我已经有近10年没有接触过它了。所以我在公寓外面的垃圾堆里发现了一台旧的奔腾2，安装了一个硬盘，并尝试了这个(对我来说)新的Linux版本，奇怪的是，它叫做Ubuntu。\n我很快意识到这台机器可以让所有的学生同时编程，我发现了一个奇迹，那就是PuTTY.exe(它不需要任何安装就能运行！)。把过时的PC连接到服务器上，很快我的学生们就开始编程了。\n我为什么要教他们VIM？我希望我可以说，我当时苦恼于所有的选择，并认为vim是最好的教学解决方案，但现实情况是，我在大学里使用的是vi，因为我父亲教我vi。你看，我很幸运有一位在这个行业工作的父亲，在文本编辑史上甚至可以说是一个脚注。所以我教vi(后来的vim)，因为这是我所知道的。在FIRE…的许多计算机科学教师的试验中，一个持续不断的主题。教授一些东西，因为这是他们所知道的。我甚至认为，更重要的是教师了解编辑器，特别是编程语言，而不是把任何重要的东西都放在一个正确的编辑器或所有教师都应该教授的一种正确的语言上。\n然而，多年后，我仍在教授vim和命令行。因此，以下是我如何证明我的决定是合理的，即使只是对我自己。\n只是起作用了。每次我去一所新学校，安装运行IDE所需的软件都需要时间。我记得走进一所学校，AP CS A班级在Mac OS X上挥舞着Eclipse，因为学生们需要(而不是拥有)管理员访问权限。在我目前的工作中，我有一个令人惊叹的技术部门，但即使是在这里，我们也花了几周的时间来弄清楚如何在学生的MacBook Air上部署Visual Studio代码，然后我们必须弄清楚如何部署Python3和Java。所以没有混淆，我教授VIM和许多IDE，我完全相信教授多平台和多IDE是我的责任，但CLI和VIM永远是我的安全网。\n我的学生可以在现在基于云的CLI Linux机器上用任何语言编程(谢谢Linode和Digital Ocean--这两家公司都提供每月5美元的套餐)。顾客快乐！)。通过使用CLI，我几乎可以支持任何类型的电脑连接(包括iPad，尽管缺少虚拟Esc键让我作为VIM用户抓狂，还有Chromebook)。学生们可以从世界的任何地方进行连接，一切都很顺利。在流行病的远程和混合学习体验中，所有这些都变得极其重要。这一切都是可能的，因为学生们使用了VIM。\n我跟踪了很多主修CS的学生，他们都非常感谢我教他们VIM和CLI。太多的大学以集成开发环境(IDE)启动CS1，然后用CLI将CS2学生推入困境。并不是每个人都像我一样幸运，因为我有一个精通CLI的父亲。\n是的，现在有在线IDE，但我发现这些IDE充满了它们自己的陷阱、隐私问题和成本，并发现使用它们做任何高级工作即使不是不可能的话也是非常困难的。\n另外，需要说明的是，Nano和Emacs在CLI Linux环境中都能很好地工作，我不认为教师应该使用VIM而不是那些同样可以接受的命令行文本编辑器，除了一个小问题。大多数人都同意，计算机安全很大程度上需要命令行和文本编辑器的知识。我总是告诉我的学生，他们很可能会发现一个已经安装在机器上的编辑器是vim，如果你不得不安装另一个编辑器，那真是糟糕的一天。对于对道德渗透测试…感兴趣的学生来说，这可能只是一个问题", "note_en": "The why of why people use vim has been  covered fairly extensively, so I thought I would spend a little time explaining why I  teach vim to my high school students, even in 2020.\n It all began when I was assigned a mixed class of ninth through twelfth grade students in computer science just after the financial collapse on 2008. Well, the financial collapse first brought me to teach Intro to Programming using VB 6.0 and Windows thin clients, which was an experience unto itself (thanks in part to the  Conficker virus). That experience is worth a separate blog post and is a good part of why one of my specialties is teaching computer security.\n So here I am with all levels of student, including AP CS A (read: AP CS Java), and obsolete Windows PCs (at least the thin clients were gone). I couldn’t install any software, wanted to teach C, had to teach Java, and had very few options (these were the days before online web based IDEs).\n I had experience with the UNIX command line, primarily Sun Workstations, thanks to my wonderful education at  UCSC, so that wasn’t an issue. I had played with Linux in the 1990s to a bit of success, but hadn’t touched it for almost a decade. So I found an old Pentium 2 carcass in the the garbage outside my condo complex, installed a hard drive, and tried this new (to me) flavor of Linux called, strangely,  Ubuntu.\n I quickly realized this machine could have all the students coding at one, discovered the wonder that is  putty.exe (it doesn’t require any installation to run!) to connect the obsolete PCs to the server and soon my students were off and coding.\n Why did I teach them vim? I wish I could say I agonized over all the options at the time and decided vim was the best pedagogical solution, but the reality of the situation was that vi was what I used in college because my father taught me vi. You see, I am lucky to have a father who worked in the industry and is even somewhat of a  footnote in text editor history. So I taught vi (later vim) because it is what I knew. A running theme in many computer science teacher’s trials by fire… teaching something because it is what they know. I will go as far as to argue that it is more important that the teacher knows the editor, and especially the programming language, rather than assigning any importance to one correct editor or one correct language that all teachers should teach.\n Years later, though, I still teach vim and the command line. So here is how I justify my decision, even if only to myself.\n It just works. Every time I go to a new school, it takes time to get the software installed necessary to run IDEs. I remember walking into one school in which the AP CS A class was flailing away with Eclipse on Mac OS X because the students needed, and didn’t have, administrator access. I have an amazing tech department at my current job, but even here it took us weeks to figure out how to deploy Visual Studio Code on the student’s MacBook Airs and then we had to figure out how to deploy Python3 and Java. So there’s no confusion, I teach vim along with many IDEs and I fully believe it is my responsibility to teach multiple platforms and multiple IDEs, but the CLI and vim are always my safety net.\n My students can program in any number of of languages on a now cloud based CLI Linux machine (thank you  Linode and  Digital Ocean – both of whom offer a $5/month plan – just. happy customer!). By using the CLI, I can support literally any type of computer connecting (including iPads, although the lack of a virtual esc key drives me batty as a vim user, and  ChromeBooks). Students can connect from anywhere in the world and things just work. All of this became infinitely important in the remote and hybrid learning experience of the pandemic. And this is all possible because the students use vim.\n I keep track of as many of my students that major in CS and a running theme is they all profusely thank me for teaching them vim and the CLI. Too many colleges start CS1 with an IDE and then throw the CS2 students into the deep end with the CLI. Not everyone is as lucky as I was in regards to having a father well versed in the CLI.\n And yes, there are online IDEs these days, but I’ve found those to be full of their own pitfalls, privacy issues, and costs and find doing any advanced work using them to be very difficult if not impossible.\n Also, to be clear, both nano and Emacs work quite well in the context of CLI Linux and I don’t make any claim that teachers should use vim over those equally acceptable command line text editors except for one small argument. Most people agree, computer security pretty much requires knowledge of the command line and a text editor. I always tell my students that the one editor they are likely to find already installed on a machine is vim and it is a bad day when you have to install another editor. Maybe just an issue for students interested in ethical penetration testing…", "posttime": "2020-11-15 14:14:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "vim,teach,学生", "title": "为什么我要教Vim", "title_en": "Why I Teach Vim", "transed": 1, "url": "https://blog.ceos.io/2020/11/14/why-i-teach-vim/", "via": "", "real_tags": ["vim", "teach", "学生"]}, {"category": "", "categoryclass": "", "imagename": "1a8873bf6896dae5f4d5d6dc337fc13a.jpg", "infoid": 1035236, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由一家提供汽车保险行业的软件供应商撰写的报告承认，本周发生了一起数据泄露事件，暴露了约2770万持有德克萨斯州驾照的人的个人信息。\n在周四发布在其网站上的一份声明中，Vertafort公司透露，在今年3月11日至8月1日的某个时候，有三个包含2019年2月之前发放的驾照信息的数据文件被“未经授权访问”。\n被曝光的文件包括驾照号码、姓名、出生日期、地址和车辆登记历史，尽管Vertafort表示，没有社会安全号码或财务信息在此次入侵中被扫地出门。\n根据该公司的说法，这些数据文件被存储在一个不安全的外部存储服务中，Vertafort将此归咎于人为错误。这一漏洞是在8月中旬发现的。虽然第三方调查没有发现任何证据表明司机的信息被恶意使用，但它确实发现了至少一起不当获取的情况。\n该公司在声明中写道：“在意识到这个问题后，Vertafort立即保护了可能受到影响的文件，并一直在调查这一事件以及数据可能受到影响的程度。”\n该公司向受害者提供为期一年的免费信用监测和身份恢复服务。该事件还报告给了德克萨斯州有关部门，包括州机动车管理局、公共安全部和总检察长办公室。", "note_en": "Written by       A software vendor that supplies the auto insurance industry acknowledged a data breach this week that exposed the personal information of about 27.7 million people with Texas driver’s licenses.\n In a statement posted to its website Thursday, the company, Vertafore, disclosed that at some point between March 11 and Aug. 1 of this year, there was “unauthorized access” to three data files containing information pertaining to driver’s licenses issued prior to February 2019.\n The exposed files included driver’s license numbers, names, dates of birth, addresses and vehicle registration histories, though Vertafore said no Social Security numbers or financial information was swept up in the breach.\n According to the company, the data files had been stored in an unsecured external storage service, which Vertafore attributed to human error. The breach was detected in mid-August. While a third-party investigation found no evidence that any drivers’ information has been used maliciously, it did discover at least one instance of improper access.\n “Immediately upon becoming aware of the issue, Vertafore secured the potentially affected files and has been investigating the event and the extent to which data may have been impacted,”  the company’s statement reads.\n The company is offering one year of free credit monitoring and identity restoration services to victims. It’s also reported the incident to Texas authorities, including the state Department of Motor Vehicles, Department of Public Safety and Office of the Attorney General.", "posttime": "2020-11-15 14:14:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "司机,breach,驾照", "title": "数据泄露暴露了近2800万名德克萨斯州司机的记录", "title_en": "Data breach exposes nearly 28M Texas drivers' records", "transed": 1, "url": "https://statescoop.com/data-breach-exposes-nearly-28-million-texas-drivers-records/", "via": "", "real_tags": ["司机", "breach", "驾照"]}, {"category": "", "categoryclass": "", "imagename": "dffc806d685fe205b02ac37b8920af80.gif", "infoid": 1035235, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "研究还发现，脑电波的特定频段与大脑皮层感觉信息的编码或抑制编码有关。\n为了产生你的思想和行动，你的大脑在其表面或皮层上处理信息的层次结构，从对传入感觉进行基本解析的“较低”区域到制定你运用新发现知识计划的“较高”执行区域。在一项新的研究中，麻省理工学院的神经科学家试图解释这一组织是如何出现的，他们报告了两个广泛的趋势：在三个不同的区域中，信息编码或抑制与特定脑电波频段之间的类似拉锯战有关，一个区域在该层次结构中的地位越高，其在每个频段中的峰值频率就越高。\n通过对动物三个大脑皮层区域的数千个神经元和周围电场进行测量和分析，该团队在《认知神经科学杂志》(Journal Of Cognitive NeuroScience)上发表的这项新研究为脑波(脑细胞活动的振荡模式)如何控制整个大脑皮层的信息流提供了一个统一的视角。\n这项研究的资深作者、麻省理工学院皮考尔学习与记忆研究所的皮考尔神经科学教授厄尔·米勒说：“当你查看之前的研究时，你会看到我们在许多地区发现的例子，但它们都是在不同的实验中以不同的方式发现的。”“我们想要得到一张最重要的照片，所以我们就这么做了。”我们解决了这样一个问题，整个大脑皮层看起来是什么样子。“。\n斯德哥尔摩大学的合著者Mikael Lundqvist曾是麻省理工学院的博士后，他补充道：“很多很多研究都着眼于一个特定频率的相位在大脑皮层区域之间是如何同步的。它本身就成了一个领域，因为同步性会影响地区之间的交流。但可以说，更重要的是，如果各地区以完全不同的频率进行通信。在这里，我们发现了不同地区首选频率的系统性变化。通过拼凑早期的研究，可能已经怀疑到了这一点，但据我所知，之前还没有直接证明过这一点。这是一个简单但可能非常基本的观察结果。“。\n为了进行观察，研究小组给动物们布置了一项任务，让它们正确区分刚刚看到的图像--这是一项简单的视觉工作记忆壮举。在动物玩游戏的过程中，科学家们测量了每只动物大脑皮质层级的底部、中部和顶部三个区域数百个神经元的个体放电活动，这三个区域分别是视觉皮质、顶叶皮质和前额叶皮质。他们同时跟踪了这一活动产生的波动。\n他们发现，在每个区域，当图像被编码(第一次呈现时)或回忆时(当测试工作记忆时)，脑电波的theta和Gamma频段的能量会突然增加，而α和β频段的能量会减少。当必须记住这些信息时，例如，在第一眼看到和测试之间的一段时间里，θ和伽马能量下降，而α和β能量突然上升。米勒说，这些频段之间的这种功能性“推/拉”序列已经在几个单独的区域显示出来，包括运动皮质，但在同一任务过程中，通常不会同时出现在多个区域。\n研究人员还观察到，θ和伽马能量的爆发与编码图像信息的神经尖峰密切相关。同时，阿尔法和贝塔能量爆发与同样的尖峰活动呈反相关。\n虽然这一规则适用于所有三个地区，但一个关键的区别是，每个地区在每个频段内都使用了一个不同的峰值。例如，视觉皮质β波段在11赫兹达到峰值，顶叶β波段在15赫兹达到峰值，前额β波段在19赫兹达到峰值。同时，视觉皮质伽马出现在65赫兹，顶叶伽马出现在72赫兹，前额伽玛出现在80赫兹。\n米勒说：“当你从大脑的后部移到前部时，所有的频率都会稍微高一点。”\n虽然这项研究中的两个主要趋势-频段之间的反向关系和每个频段内峰值频率的系统性上升-都是始终如一的，而且具有统计学意义，但它们只显示出与功能的关联，而不是因果关系。但研究人员表示，他们与阿尔法和贝塔交替抑制或释放伽马来控制信息编码的模型是一致的-这是一种自上而下控制感觉活动的形式。\n同时，他们假设，在层级上系统地增加峰值频率可以起到多种作用。例如，如果每个频带中的波携带信息，则较高的区域将以更快的频率采样，以提供来自较低区域的原始输入的更细粒度的采样。此外，更快的频率更有效地将相同的频率带到其他地区，给较高的地区提供了一种有效的方法来控制较低的地区的活动。\n作者写道：“振荡节律频率的增加可能有助于塑造大脑皮层的信息流。”\n参考文献：Mikael Lundqvist，AndréM.Bastos和Earl K.Miller，2020年10月，《认知神经科学杂志》的《跨皮质层级振荡动力学的保存和变化》。DOI：10.1162/jocn_a_01600。\n这项研究得到了美国国立卫生研究院、海军研究办公室、JPB基金会、瑞典研究理事会以及大脑和行为研究基金会的支持。", "note_en": "Study also finds specific frequency bands of brain waves associated with encoding, or inhibiting encoding, of sensory information across the cortex.\n To produce your thoughts and actions, your brain processes information in a hierarchy of regions along its surface, or cortex, ranging from “lower” areas that do basic parsing of incoming sensations to “higher” executive regions that formulate your plans for employing that newfound knowledge. In a new study,  MIT neuroscientists seeking to explain how this organization emerges report two broad trends: In each of three distinct regions, information encoding or its inhibition was associated with a similar tug of war between specific brain wave frequency bands, and the higher a region’s status in the hierarchy, the higher the peak frequency of its waves in each of those bands.\n By making and analyzing measurements of thousands of neurons and surrounding electric fields in three cortical regions in animals, the team’s new study in the  Journal of Cognitive Neuroscience provides a unifying view of how brain waves, which are oscillating patterns of the activity of brain cells, may control the flow of information throughout the cortex.\n “When you look at prior studies you see examples of what we found in many regions, but they are all found in different ways in different experiments,” says Earl Miller, the Picower Professor of Neuroscience in The Picower Institute for Learning and Memory at MIT and senior author of the study. “We wanted to obtain an overarching picture, so that’s what we did. We addressed the question of what does this look like all over the cortex.”\n  Adds co-first author Mikael Lundqvist of Stockholm University, formerly a postdoc at MIT: “Many, many studies have looked at how synchronized the phases of a particular frequency are between cortical regions. It has become a field by itself, because synchrony will impact the communication between regions. But arguably even more important would be if regions communicate at different frequencies altogether. Here we find such a systematic shift in preferred frequencies across regions. It may have been suspected by piecing together earlier studies, but as far as I know hasn’t been shown directly before. It is a simple, but potentially very fundamental, observation.”\n  To make their observations, the team gave animals the task of correctly distinguishing an image they had just seen — a simple feat of visual working memory. As the animals played the game, the scientists measured the individual spiking activity of hundreds of neurons in each animal in three regions at the bottom, middle, and top of the task’s cortical hierarchy — the visual cortex, the parietal cortex, and the prefrontal cortex. They simultaneously tracked the waves produced by this activity.\n  In each region, they found that when an image was either being encoded (when it was first presented) or recalled (when working memory was tested), the power of theta and gamma frequency bands of brain waves would increase in bursts and power in alpha and beta bands would decrease. When the information had to be held in mind, for instance in the period between first sight and the test, theta and gamma power went down and alpha and beta power went up in bursts. This functional “push/pull” sequence between these frequency bands has been shown in several individual regions, including the motor cortex, Miller said, but not often simultaneously across multiple regions in the course of the same task.\n The researchers also observed that the bursts of theta and gamma power were closely associated with neural spikes that encoded information about the images. Alpha and beta power bursts, meanwhile, were anti-correlated with that same spiking activity.\n While this rule applied across all three regions, a key difference was that each region employed a distinct peak within each frequency band. While the visual cortex beta band, for instance, peaked at 11 Hz, parietal beta peaked at 15 Hz, and prefrontal beta peaked at 19 Hz. Meanwhile, visual cortex gamma occurred at 65 Hz, parietal gamma topped at 72 Hz, and prefrontal gamma at 80 Hz.\n “As you move from the back of the brain to the front, all the frequencies get a little higher,” Miller says.\n While both main trends in the study — the inverse relationships between frequency bands and the systematic rise in peak frequencies within each band — were both consistently observed and statistically significant, they only show associations with function, not causality. But the researchers said they are consistent with a model in which alpha and beta alternately inhibit, or release, gamma to control the encoding of information — a form of top-down control of sensory activity.\n Meanwhile, they hypothesize that the systematic increase in peak frequencies up the hierarchy could serve multiple functions. For instance, if waves in each frequency band carry information, then higher regions would sample at a faster frequency to provide more fine-grained sampling of the raw input coming from lower regions. Moreover, faster frequencies are more effective at entraining those same frequencies in other regions, giving higher regions an effective way of controlling activity in lower ones.\n “The increased frequency in the oscillatory rhythms may help sculpt information flow in the cortex,” the authors wrote.\n Reference: “Preservation and Changes in Oscillatory Dynamics across the Cortical Hierarchy” by Mikael Lundqvist, André M. Bastos and Earl K. Miller, October 2020,  Journal of Cognitive Neuroscience.  DOI: 10.1162/jocn_a_01600\n The study was supported by the U.S. National Institutes of Health, the Office of Naval Research, The JPB Foundation, the Swedish Research Council, and the Brain and Behavior Research Foundation.", "posttime": "2020-11-15 14:13:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "higher,研究", "title": "当信息流经大脑层级结构时，较高的区域使用较高频率的波", "title_en": "As Info Flows Through Brain Heirarchy, Higher Regions Use Higher-Frequency Waves", "transed": 1, "url": "https://scitechdaily.com/whats-the-frequency-kenneth-as-information-flows-through-brains-heirarchy-higher-regions-use-higher-frequency-waves/", "via": "", "real_tags": ["higher", "研究"]}, {"category": "", "categoryclass": "", "imagename": "e8a45a60cfbff65a08e431e47908de04.jpeg", "infoid": 1035234, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-私募股权公司凯雷集团(Carlyle Group Inc.)周四表示，已向专注于健康、个人护理和美容产品的美国电子商务公司Pharmapacks投资逾2.5亿美元。\n凯雷的投资对Pharmapack的估值约为11亿美元，正值新冠肺炎疫情推动更多消费者在网上购物之际。\nPharmapacks成立于2010年，最初是一家实体药店，现已成长为利洁时集团(Reckitt Benckier Group)、拜耳(Bayer AG)和欧莱雅(L‘OrealSA)等健康和消费品巨头的在线零售商。\n总部位于纽约哈帕克(Hauppauge)的Pharmapack去年主要通过亚马逊(Amazon)、eBay、谷歌(Google)、Facebook、沃尔玛(Walmart)和塔吉特(Target)等大型电子商务市场销售产品，创造了约2.5亿美元的销售额。\nPharmapacks首席执行长瓦格纳斯(Andrew Vagenas)在接受采访时说，Pharmapacks的目标是利用这笔投资在美国西海岸开设一个新的供应链中心，扩大其技术能力，并在食品和宠物等类别增加更多产品。\n对Pharmapacks的投资是由凯雷合伙公司(Carlyle Partners VII)出资185亿美元成立的，该公司最近用这笔185亿美元的收购基金收购了数字医疗保健公司Grand Runds Inc.的1.75亿美元股份。", "note_en": "(Reuters) - Private equity firm Carlyle Group Inc said on Thursday it had invested more than $250 million in Pharmapacks, a U.S. e-commerce firm focused on health, personal care and beauty products.\n Carlyle’s investment, which values Pharmapacks at about $1.1 billion, comes as the COVID-19 pandemic has pushed more consumers to shop online.\n  Founded as a brick-and-mortar pharmacy shop in 2010, Pharmapacks has grown into an online retailer for health and consumer goods giants such as Reckitt Benckiser Group, Bayer AG, and L’Oreal SA.\n Hauppauge, New York-based Pharmapacks generated about $250 million in sales last year by selling products mainly through large e-commerce marketplaces, including Amazon, eBay, Google, Facebook, Walmart and Target.\n  Pharmapacks aims to use the investment to open a new supply chain hub on the U.S. West Coast, expand its technology capabilities, and add more products in categories such as food and pets, its Chief Executive Andrew Vagenas said in an interview.\n The investment in Pharmapacks was made out Carlyle Partners VII, a $18.5 billion buyout fund the firm recently used to acquire a $175 million stake in digital healthcare firm Grand Rounds Inc.", "posttime": "2020-11-15 13:35:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "护理,group", "title": "专注于健康、个人护理和美容产品的电子商务公司Pharmapacks从凯雷集团(Carlyle Group)融资2.5亿美元，估值约11亿美元", "title_en": "Pharmapacks, an e-commerce company focused on health, personal care, and beauty products, raises $250M from Carlyle Group at a valuation of ~$1.1B", "transed": 1, "url": "https://www.reuters.com/article/us-carlyle-group-investment-idUSKBN27S1KW", "via": "", "real_tags": ["护理", "group"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1035233, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上个月，网络开发人员詹姆斯·萨默斯(James Somers)为《永旺杂志》(Aeon Magazine)撰写了一篇漂亮而有趣的文章，他思考了这样一个问题：程序员值得吗？\n这是一个有思想的人努力理解他的职业价值的作品。根据萨默斯自己的估算，他的账目失衡了。他的薪水很高，但工作很琐碎。正如他所说：\n事实上，我们正在做的大部分事情就是把盒子放在一页上……。我们用这些框的单调维护来打发我们的每一天：我们改变颜色；我们添加一个链接让你编辑一些文本；我们跟踪你向下滚动了多远的页面。网络开发比我们任何一个坐在两个圆滑的监视器前的人都不愿意承认的更像是管道。\n萨默斯的痛苦显而易见，他的一连串谦逊言论听起来像是在道歉。他对自己、他的工作以及他的整个职业都大加批评。他感叹道，网络初创公司就像游戏公司。他们的产品既便宜又有趣，就像创造了啤酒乒乓球的新变种一样改变了世界。\n他试图弥补的是拿得太多(薪水和津贴)，而换来的(技能和努力)太少。社会对他的补偿过高，因此他债台高筑--因此产生了负罪感。\n为此，我忍不住钦佩萨默斯。以这种方式质疑自己，让我觉得自己在智力上是诚实的。但我担心他的担忧是错误的--当一阶问题隐现得更大时，他却在为二阶问题而苦恼。\n假设有一天你醒来，发现客厅的茶几上堆着一大堆刚果法郎。\n这还不是全部。你还会发现，你的前门以前只有一块木板，现在水平地分成上下两半(所谓的荷兰门)。当你使用门把手时，这两部分会一起移动，像往常一样打开到你的前廊。但你只能单独打开上半部分，就像一扇窗户。当你这样做的时候，它会打开，展示刚果户外市场的陌生景象和声音。\n你还没来得及反驳这个奇怪的新现实，一个男人就走近了你的窗户。他肩上扛着一袋粮食，呼唤着你。幸运的是你会说足够多的法语来听懂他的话。他在问你是否愿意以500法郎的价格买下他的粮食。\n请忽略人为设置。关键是：你有机会在你的起居室里安全地参与刚果经济。\n假设你只能从窗口通过两样东西--法郎和一袋粮食。知道刚果是地球上最贫穷的国家之一，你会采取什么战略来为他们的社会做最好的事情？\n选择的数量多得惊人。首先，你可以简单地把一大堆现金交给第一个从你窗户走来的人。或者，你可能会把少量现金交给一群不同的人。这两件事看起来都是不错的选择。但随后你会想：如果你客厅里的现金是假的呢？更重要的是，这有什么关系吗？无论这些钱是从哪里来的，如果你把它扔进窗户，你将帮助一些人，但同时也会导致通货膨胀，这将伤害到其他所有人。综合考虑，最好的办法可能就是烧掉货币，然后把窗户钉上。\n然后你想象一下用法郎买卖谷物，你的选择就变得更加有趣了。例如，你可以投机，希望在谷物价格便宜时买入，在价格高时卖出。或者，你可以试着成为做市商，提供以小价差买卖谷物的机会。或者你可以扮演银行的角色，为你的客户保管粮食，在他们以后需要的时候还给他们。你甚至可以借鉴部分储备金制银行的做法，借出一部分储粮。\n你非常想帮助这些人，但你担心这些策略中存在隐患。投机、做市和银行业都抽象得令人痛苦，沾染着各种令人讨厌的(资本家！)。内涵。你开始希望自己在经济课上更加用心。\n因为这相对简单，所以你决定把重点放在投机策略上。你的计划是在你认为价格在不久的将来会上涨的时候买入谷物，在你认为价格会下降的时候卖出。\n没有人被迫与你做生意，这让人放心。不管你和谁交易，都可以自由地进入交易，大概是因为这对他有利。所以你可以放心地知道，至少你没有直接和任何人做爱。\n但随后你突然意识到一个令人不快的事实：如果你把工作做好了，你就会开始赚钱。事实上，你越擅长投机，你赚的钱就越多。这笔钱是与你交易的每个人辛苦赚来的。他们中的任何一个人都会为你目前在客厅里囤积的现金付出自己的右臂。\n你开始怀疑，从刚果穷人那里拿走所有这些钱是否应该感到内疚--他们现在(你必须得出结论)因此变得更加贫穷。\n等等，让我们放慢脚步，把这件事想清楚。情绪不能总是从表面上看，在这种情况下，你的负罪感会误导你得出一个非常危险的结论。\n你的罪恶感没有意识到的是，有些东西(比如食物)具有内在价值，而另一些东西(比如金钱)只是占位符。这种区别可能看起来很迂腐，但它实际上非常重要。\n假设一个精灵提出用两种方式中的一种来调整世界。他要么(A)将每个人的银行账户增加一倍，要么(B)将现有的食物数量增加一倍。哪个对社会更好？答案显然是B，食物翻了一番。选项A(将货币翻倍)只是创造了更多的占位符和代币--而选项B创造了更多具有内在价值的物品。换句话说，A是零和变化，而B是正和变化。\n关键是，金钱没有内在价值。你不能吃钱或用它耕地，金钱也不能照看你的孩子。这只是一个象征，我们都同意接受，以换取放弃那些确实具有内在价值的东西。在大多数交易中，货币和内在价值流向相反的方向。\n当谈到放在客厅里的那堆法郎时，这就完全不同了。这些法郎并不代表你从刚果经济中榨取的价值。恰恰相反：它们代表着你通过你的窗口传递给它的价值。\n想一想这一点。如果你为赚钱而感到内疚，那么你的道德指南针就指向了错误的方向--与正确的方向相差180度。收入衡量的是为他人做的好事，而不是对他们做的坏事。\n也许你仍然感到不舒服--担心我们在做诡辩。如果是这样的话，我们可以仔细看看其中一些谷物交易，以确保我们做的是正确的事情。\n想象一下，你在T1以200法郎的价格购买了一袋特定的谷物，一个月后在T2以800法郎的价格出售。在这段时间里，改变的是粮食的相对稀缺。在T1，粮食很丰富(因此很便宜)，但在T2，它变得稀缺(因此很贵)。\n你把粮食从刚果人民由于相对过剩而不需要的时候(T1)转移到了他们非常需要的时候(T2)，因为相对短缺。\n是的，你会因为提供这项服务而得到补偿。但这笔钱并不代表你从经济中榨取了什么，而是你为经济增加的内在价值。\n奇怪的是，反之亦然。你在投机过程中损失的钱越多，你从经济中拿走的价值就越多。当你高价买入，低价卖出时，你就会把谷物的时间转移到错误的方向上，当它更有价值时，把它从经济中带走，当它不那么值钱时，把它还回去。\n不过，总的来说，我们不需要追踪每袋谷物。我们只需追踪货币，就能推断内在价值正朝着相反的方向流动。\n现在，刚果贸易窗口不仅仅是一个思想实验。这是一个比喻--一种重塑我们日常经济生活的方式。\n我们拥有的不是装满谷物和法郎的起居室，而是许多不同类型的资产。我们与自己的社会互动，而不是刚果。尽管我们不是通过一个窗口进行买卖，但效果是一样的：商品和货币在所有权边界之间来回流动，在我的和属于社会上其他人的之间来回流动。\n因此，刚果贸易窗口的同样原则也适用于我们每个人：我们通过为他人提供价值来赚钱。因此，\n想想农场主吧。他卖食物赚钱。他的利润反映了这样一个事实，即他正在创造价值，并将其奉献给社会。\n以餐厅老板为例。只要她付钱(如原材料、人工、水电费等)。她付钱从社会上拿走有内在价值的东西，并把它们用于自己的目的。每当她赚到钱，比如从顾客那里赚到钱，她就会给他们一些有内在价值的东西(一顿美餐)作为交换。希望她能赚到钱--钱进钱出，价值创造和价值毁灭之间的差别。\n或者考虑一下私人股本商店。当他们收购一家公司，改变其管理层和战略，然后转手获利时，这是因为他们把它变成了一台效率更高的机器。但如果他们亏本转售，那是因为他们拿走了一些有价值的东西，并以比发现时更糟糕的状态归还(给社会)。\n在这些和大多数其他情况下，利润反映了创造和给予社会的价值。\n也许庆祝是一项艰巨的任务，但我们几乎不承认这一点。诚然，我们经常尊敬比尔·盖茨、史蒂夫·乔布斯或埃隆·马斯克等伟大的企业家--但我们尊重他们，尽管他们赚了很多钱。在我们看来，这些钱本身仍然是肮脏的，就像是价值创造过程中的某种有毒副产品。\n想象一下，在刚果谷物市场投机多年，积累了数百万法郎之后，你决定通过最后一步套现，通过窗户买一艘游艇(然后把它钉死)。更别提把游艇驶入起居室的后勤保障了。关键是，这是一种令人难以置信的自私行为，几乎完美地抵消了你通过投机所做的一切好事。\n游艇是由木头、金属和塑料制成的。建造它需要数千小时的努力。工人们必须找到树木，砍倒它们，把木材拖到很远的地方，切割、打磨、抛光、喷漆等等。如果你没有委托游艇，所有这些材料和工时都可以被用到其他更好的用途上。尽管这对刚果人民有好处，但你不妨付钱让他们建造这艘游艇，然后在他们眼前烧毁它。把它从窗户拿出来，进入你自己的财产，供你自己消费，也会有同样的效果。\n关键是，花在消费上的钱是有害的--破坏价值。即使在我们的日常生活中也是如此，没有字面上的魔力之窗。每次我们花钱买游艇、iPhone、漂亮的夹克甚至食物，我们都在从社会上拿走一些有价值的东西，并将其用于我们自己的目的。\n这就是财富有毒的原因。只要某人的钱存在他的银行账户里，我们就是安全的。但一旦它开始通过消费泄露出去，我们所有人的境况都会变得更糟。\n别误会我的意思--这远不是全貌。我们需要做出大量的二阶修正。例如，我们想问一下这笔钱是怎么赚到的。如果它是在自由、诚实、竞争性的交易中赚取的，那么它将是衡量附加值的一个更好的指标，而不是通过强迫、不诚实或在令人窒息的市场中赚取。如果它是在正和游戏(如农业)中赚取的，那么它将比它在零和游戏或负和游戏(如垃圾邮件)中赚取的价值更好地衡量。\n在支出方面，我们需要考虑我们重新消费的商品是竞争性的还是非竞争性的，以及消费带来的所有外部效应，无论是正面的还是负面的。如果没有人消费基本生活以外的东西，我们的经济增长就会慢得多，创新就会少得多，技术(包括医疗技术)也会低劣。\n重点不是用一个人银行账户的大小来衡量道德价值。这样的措施在很多方面都有问题。它忽视了人们做的所有不会得到金钱回报的好事。它忽视了运气这一巨大因素。它忽略了人们的意图，如果这些对你很重要的话--斯克鲁奇在积累财富时并不是想要亲社会。\n相反，关键在于，一般来说，赚钱是值得庆祝的，而不是感到内疚。\n或许詹姆斯·萨默斯(James Somers)是对的：或许目前网络开发被夸大了。换一个不同的职业可能会让他做更有价值的工作。老实说，我赞赏他的提问方式。很多行业(广告、高频交易、营利性高等教育)都会很好地用这种方式质疑自己，了解它们是正和企业、零和企业，甚至是负和企业。\n但只要我们重新反省，我们也不要忘记审视自己的消费习惯。\n正在融化的沥青是由凯文·西姆勒(Kevin Simler)维护的。\r我很少发表文章，所以你可能需要通过电子邮件发送新的文章：", "note_en": "In a beautiful, rollicking piece last month for Aeon Magazine, web developer James Somers ponders the question,  Are coders worth it?\n The piece is a thinking man&#39;s struggle to understand the value of his profession. By Somers&#39; own reckoning, his accounts are out of balance. He&#39;s paid handsomely, but the work is trivial. As he says:\n Most of what we’re doing, in fact, is putting boxes on a page.... We fill our days with the humdrum upkeep of these boxes: we change the colours; we add a link to let you edit some text; we track how far you scroll down the page.... Web development is more like plumbing than any of us, perched in front of two slick monitors, would care to admit.\n Somers&#39; anguish is palpable, and his catalogue of self-effacing remarks reads like an apology. He heaps criticism on himself, his job, and his entire profession. &#34;Web start-up companies are like play-companies,&#34; he laments. Their products are &#34;cheap, fun, and about as worldchanging as creating a new variation on beer pong.&#34;\n  What he&#39;s trying to atone for is taking too much (salary and perks) in exchange for too little (skill and effort). Society has overcompensated him, so he&#39;s left in its debt — hence the guilt.\n I can&#39;t help admiring Somers for this. It strikes me as intellectually honest, to question oneself in this way. But I worry that his concerns are misplaced — that he&#39;s anguishing over a second-order problem when a first-order problem looms much larger.\n    Suppose one day you wake up to find a large pile of Congolese francs heaped on your living room coffee table.\n That&#39;s not all. You also find that your front door, previously a single slab of wood, is now divided horizontally into top and bottom halves (a so-called  Dutch door). When you use the doorknob, both pieces move together, opening out onto your front porch as usual. But you can open just the top half, separately, like a window. And when you do, it pushes open to reveal the unfamiliar sights and sounds of a Congolese outdoor market.\n Before you have time to object to this strange new reality, a man approaches your window. He&#39;s carrying a sack of grain over his shoulder and calling out to you. Luckily you speak enough French to understand him. He&#39;s asking if you&#39;d like to buy his grain for 500 francs.\n Please ignore the contrived setup. The point is this: you have a chance to participate in the Congolese economy from the safety of your living room.\n Assume you can only pass two things through the window — francs and sacks of grain. Knowing that the Congo is one of the poorest countries on the planet,  what strategy will you pursue in order to do the most good for their society?\n There are a surprising number of options. For one, you could simply hand the pile of cash out to the first person who comes by your window. Or you might hand small amounts of cash to a bunch of different people. Both of these seem like nice things to do. But then you wonder: what if the cash in your living room is counterfeit? More to the point — does it even matter? Wherever the money came from, if you dump it through the window, you&#39;ll be helping a few people, but at the same time causing inflation that will hurt everyone else. All things considered, it might be best simply to burn the currency and nail the window shut.\n Then you imagine using the francs to buy and sell grain, and here your options get much more interesting. You could speculate, for example, hoping to buy when grain is cheap and sell when it&#39;s dear. Or you might try to become a market-maker, by offering to buy and sell grain at a small spread. Or you could act as a bank, holding grain for your clients and giving it back when they need it later. You might even loan out some of your grain deposits, taking your cue from fractional-reserve banking.\n You desperately want to help these people, but you&#39;re worried there are hidden hazards in these strategies. &#34;Speculation,&#34; &#34;market-making,&#34; and &#34;banking&#34; are painfully abstract, tainted with all manner of unsavory ( capitalist!) connotations. You begin to wish you&#39;d paid more attention in your econ classes.\n Because it&#39;s relatively simple, you decide to focus on the speculation strategy. Your plan is to buy grain whenever you think the price is poised to go up in the near future, and sell whenever you think the price is poised to go down.\n  It&#39;s reassuring that no one is forced to do business with you. Whomever you trade with enters freely into the exchange, presumably because it&#39;s to his benefit. So you can relax in knowing that at least you&#39;re not screwing anyone  directly.\n But then you&#39;re struck with an uncomfortable realization: If you do your job well, you&#39;ll start to  make money. In fact, the better you are at speculating, the more money you&#39;ll make. That money was hard-earned by each of the people with whom you traded. Any one of them would give his right arm for the amount of cash you&#39;re currently hoarding in your living room.\n You begin to wonder if you should feel guilty taking all this money from the poor Congolese — who are now (you must conclude) even poorer as a result.\n  Wait, let&#39;s slow down and think this through. Emotions can&#39;t always be taken at face value, and in this case, your guilt is about to mislead you to a very dangerous conclusion.\n What your guilt has failed to appreciate is that some things (like food) have  intrinsic worth, while others (like money) are mere  placeholders. This distinction might seem pedantic, but it&#39;s actually very important.\n Suppose a genie offers to tweak the world in one of two ways. Either he will (A) double everyone&#39;s bank account, or (B) double the amount of food in existence. Which is better for society? Clearly the answer is B, doubling the food. Option A (doubling the money) merely creates more placeholders, more tokens — while option B creates more objects of intrinsic value. In other words, A is a zero-sum change, while B is positive-sum.\n The point is, money doesn&#39;t have intrinsic value. You can&#39;t eat money or use it to plow a field, nor can money babysit your children. It&#39;s just a token we&#39;ve all agreed to accept in exchange for giving up things that do have intrinsic value. In most transactions, money and intrinsic value flow in opposite directions.\n When it comes to the pile of francs sitting in your living room, this makes all the difference. Those francs don&#39;t represent value you&#39;ve  extracted from the Congolese economy. Just the opposite: they represent value you&#39;ve  delivered to it, through your window.\n Think about that for a second. If you feel guilty for making money, your moral compass is pointing in exactly the wrong direction — 180-degrees from what is right. Earnings are a measure of the  good done  for other people, not evils done against them.\n Perhaps you&#39;re still uncomfortable — worried that we&#39;re engaging in sophistry. If so, we can take a closer look at some of these grain trades, to make sure we&#39;re doing the right thing.\n Imagine a particular bag of grain that you bought at T1 for 200 francs, and then sold a month later, at T2, for 800 francs. What changed in this interval was the relative scarcity of grain. At T1 the grain was abundant (and therefore cheap), but at T2 it had become scarce (and therefore expensive).\n  You moved the grain from a time (T1) when the Congolese people didn&#39;t need it, due to a relative surplus, to a time (T2) when they very much needed it, due to a relative shortage.\n And yes, you&#39;re compensated for providing this service. But the money doesn&#39;t represent what you&#39;ve  weaseled from the economy, but rather the intrinsic value you  added to it.\n Oddly enough, the converse is also true. The more money you lose while speculating, the more value you&#39;re taking away from the economy. When you buy high and sell low, you&#39;re time-shifting grain in the wrong direction, taking it away from the economy when it&#39;s more valuable and returning it when it&#39;s less valuable.\n In general, though, we don&#39;t need to track individual bags of grain. We can just track the money, and infer that intrinsic value is flowing in the opposite direction.\n  Now the Congolese Trading Window isn&#39;t just a thought experiment. It&#39;s a metaphor — a way of re-framing our everyday economic lives.\n Instead of a living room filled with grain and francs, we have &#39;ownership&#39; over many different types of assets. Instead of the Congo, we interact with our own societies. And although we don&#39;t do our buying and selling through a single window, the effect is the same: goods and currency move back and forth across the ownership boundary, between &#34;mine&#34; and &#34;belonging to others in society.&#34;\n So the same principle that held in the Congolese Trading Window holds for each of us: We earn money by providing value to other people. And consequently,\n   Consider the farmer. He sells food for money. His profits reflect the fact that he&#39;s creating value and giving it to society.\n Consider the restaurateur. Whenever she pays money (e.g. for raw ingredients, labor, utilities, etc.) she&#39;s paying to take things of intrinsic value from society and use them for her own purposes. Whenever she earns money, i.e. from customers, it&#39;s in exchange for giving them something of intrinsic value (a nice meal). Hopefully she makes a profit — the difference between money in and money out, between value created and value destroyed.\n Or consider the private equity shop. When they buy a company, change its management and strategy, and then re-sell it for a profit, it&#39;s because they turned it into a more efficient machine. But if they re-sell it at a loss, it&#39;s because they took something of value and returned it (to society) in a worse condition than when they found it.\n In these and most other cases, profit reflects the amount of value created and given to society.\n   Maybe celebration is a tall order, but we hardly even acknowledge it. It&#39;s true that we often respect great entrepreneurs like Bill Gates, Steve Jobs, or Elon Musk — but we respect them  in spite of the money they&#39;ve earned. The money itself still feels dirty to us, like some kind of toxic byproduct of the value-creating process.\n  Imagine if, after years of speculating in the Congolese grain market and accumulating millions of francs, you decide to cash out with one final act of  buying a yacht through your window (then nailing it shut). Nevermind the logistics of passing a yacht into your living room. The point is it&#39;s an incredibly selfish act, and almost perfectly cancels out all the good you did through speculation.\n The yacht is made of wood, metal, and plastic. Building it requires many thousands of hours of effort. Workers have to find the trees, cut them down, haul the lumber across vast distances, cut it, sand it, polish it, paint it, etc., etc., etc. If you weren&#39;t commissioning the yacht, all of those materials and man-hours could be put to other, better uses. For all the good it does the Congolese people, you may as well pay them to build the yacht, then burn it before their eyes. Taking it through the window, into your own possession and for your own consumption, has the same effect.\n The point is, money spent on consumption is toxic — value-destroying. This is true even in our daily lives, without the literal magic window. Every time we spend money on a yacht or an iPhone or a nice jacket or even food, we&#39;re taking something of value from society and using it for our own purposes.\n That&#39;s why wealth is toxic. As long as someone&#39;s money is tucked away in his bank account, we&#39;re safe. But the minute it starts to leak out, via consumption, we all become that much worse off.\n    Don&#39;t get me wrong — this is far from the full picture. There are a ton of second-order corrections we need to make. We&#39;d want to inquire  how the money was earned, for example. If it&#39;s earned in free, honest, competitive transactions, it&#39;s going to be a better measure of value-added than if it&#39;s earned coercively, dishonestly, or in stifled markets. If it&#39;s earned in positive-sum games (like farming), it&#39;s going to be a better measure of value than if it&#39;s earned in zero- or negative-sum games (like spamming).\n On the spending side, we need to account for whether the goods we&#39;re consuming are rivalrous or non-rivalrous, as well as all the externalities from consumption, both positive and negative. If no one consumed anything above basic subsistence, we&#39;d have a lot less economic growth, fewer innovations, and inferior technology (including medical technology).\n The point isn&#39;t to use the size of one&#39;s bank account as a measure of moral worth. Such a measure breaks down in a ton of ways. It ignores all the good things people do that aren&#39;t rewarded with money. It ignores the huge element of luck. It ignores people&#39;s intentions, if those matter to you — Scrooge wasn&#39;t  trying to be pro-social in accumulating his fortune.\n Instead, the point is that earning money is, in general, something to celebrate, not feel guilty about.\n Maybe James Somers is right: maybe web development is overhyped at the moment. A different profession might allow him to do more valuable work. And to be honest, I applaud his line of questioning. Plenty of industries (advertising, high-frequency trading, for-profit higher education) would do well to question themselves in this way, to understand if they are positive-sum, zero-sum, or even negative-sum enterprises.\n But as long as we&#39;re soul-searching, let&#39;s not forget to examine our spending habits as well.\n       Melting Asphalt is maintained by  Kevin Simler.\r I publish pretty infrequently, so you might want  new essays delivered by email:", "posttime": "2020-11-15 13:31:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "有毒,toxic,价值", "title": "财富：有毒的副产品", "title_en": "Wealth: The Toxic Byproduct", "transed": 1, "url": "https://meltingasphalt.com/wealth-the-toxic-byproduct/", "via": "", "real_tags": ["有毒", "toxic", "价值"]}, {"category": "", "categoryclass": "", "imagename": "ad2593af4c131c973a51ead50b791b29.png", "infoid": 1035232, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着远程医疗的使用继续激增--有望在不受冠状病毒感染的情况下提供远程护理，并有可能成为大流行后世界的新常态--数字联网听诊器的制造商筹集了新的资金，以扩大其远程疾病筛查项目。\n在由Highland Capital Partners和Questa Capital牵头的C系列风险投资中，Eko获得了6500万美元，另外还有Artis Ventures、DigiTx Partners、NTTVC、3M Ventures和其他投资者的支持。\n所得资金将用于进一步开发该公司的设备在医院和诊所的使用，并推动推出一个面向家庭患者的人工智能监控平台，重点是心肺疾病。\nEko联合创始人兼首席执行官康纳·兰德格拉夫说：“对虚拟心肺护理需求的爆炸式增长推动了EKO在数千家医院和医疗机构的快速扩张，我们对这笔资金将如何加速我们心肺平台的增长感到兴奋。”\n该公司的两个听诊器同时捕捉心音和心电图读数，并与一个人工智能项目相连，该项目在今年年底获得FDA的批准，以检测心房颤动和心脏杂音的迹象。\n高地资本合伙公司(Highland Capital Partners)负责人罗布·图伊斯(Rob Toews)表示：“市场对远程医疗的巨大需求不会消失。”监管和报销方面的变化一直在进行中，以支持这一增长。EKO在这一领域具有独特的地位，因为他们的技术解决了其他公司无法满足的关键临床需求，而且EKO的平台非常容易部署和扩展。“。\nEko的最终目标是使其人工智能分析成为医生办公室进行的每一次例行体检的标准内容-同时帮助人们在可能的情况下完全避免去诊所就诊。\n今年10月，Eko与3M合作，开发了其无处不在的利特曼听诊器品牌的数字版本，供全球医疗专业人士使用。基于3M以心脏病学为重点的模型，数字版本的目标是将细微的心音放大40倍，同时消除不想要的背景噪音。", "note_en": "As the use of telehealth continues to surge—promising a way to deliver distanced care in spite of the coronavirus, and potentially a new normal in a post-pandemic world—the makers of a digital, connected stethoscope have raised new funds to expand its remote disease screening programs.\n  Eko secured $65 million in a series C venture capital round, led by Highland Capital Partners and Questa Capital, alongside additional backers in Artis Ventures, DigiTx Partners, NTTVC, 3M Ventures and other investors.\n The proceeds will be used to further develop the use of the company’s devices in hospitals and clinics—and fuel the launch of an artificial intelligence-powered monitoring platform for patients at home with a focus on heart and lung conditions.\n  “The explosion in demand for virtual cardiac and pulmonary care has driven Eko’s rapid expansion at thousands of hospitals and healthcare facilities, and we are excited for how this funding will accelerate the growth of our cardiopulmonary platform,” Eko co-founder and CEO Connor Landgraf  said.\n The company’s Duo stethoscope captures both heart sounds and electrocardiogram readings, and is connected to an AI program that received an  FDA clearance at the top of this year to detect the signs of atrial fibrillation and heart murmurs.\n  “The massive market need for telehealth is not going away,” said Rob Toews, principal at Highland Capital Partners. “Regulatory and reimbursement changes have been underway to support this growth. Eko is uniquely positioned in this space because their technology addresses crucial clinical needs that other companies cannot satisfy, and Eko’s platform is very easy to deploy and scale.”\n Eko’s ultimate goal is to make its AI analyses a standard inclusion to every routine physical exam performed in a doctor’s office—while at the same time helping people to avoid clinic visits altogether when possible.\n In October, Eko  teamed up with 3M to develop a digital version of its ubiquitous Littmann stethoscope brand, used by healthcare professionals worldwide. Built off of 3M’s cardiology-focused model, the digital version aims to amplify subtle heart sounds up to 40 times while also canceling out unwanted background noise.", "posttime": "2020-11-15 12:54:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "capital", "title": "数字听诊器制造商Eko筹集6500万美元C系列资金，以扩大其由Highland Capital Partners和Questa Capital牵头的远程疾病筛查项目", "title_en": "Digital stethoscope maker Eko raises $65M Series C to expand its remote disease screening programs, led by Highland Capital Partners and Questa Capital", "transed": 1, "url": "https://www.fiercebiotech.com/medtech/digital-stethoscope-maker-eko-nets-65m-to-develop-home-telehealth-offerings", "via": "", "real_tags": ["capital"]}, {"category": "", "categoryclass": "", "imagename": "1050129b7f122a5f8d61f65eeb0cbb9f.jpg", "infoid": 1035231, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "乐器零售商吉他中心(Guitar Center)计划在与关键投资者和贷款人谈判债务削减协议后，根据破产法第11章申请破产保护。\n该公司多年来一直在为过度负债而苦苦挣扎，上周五晚些时候表示，计划继续经营下去。\n这家总部位于加利福尼亚州西湖村的零售商表示，它对其整体门店面积感到满意，其中包括近300家吉他中心门店和200多家音乐与艺术门店。\n但该零售商表示，它已经聘请了一家房地产公司，以探索优化其房地产投资组合的机会，并达成其他协议，专注于最有利于公司回到新冠肺炎之前的增长轨道的投资。\n吉他中心出售和租赁乐器，提供课程和维修服务。该公司的其他品牌包括音乐家的朋友，木管铜管和AVDG。\n像大多数非必需品零售商一样，吉他中心在疫情爆发初期被迫暂时关闭了门店。标普全球评级(S&P Global Ratings)在5月下旬的一份研究报告中写道：尽管该公司在此期间的在线收入大幅增长，但我们预计所产生的收入将不足以弥补通过门店实现的销售收入，标普全球评级公司(S&P Global Ratings)在5月下旬的一份研究报告中写道。\n吉他中心周五表示，已与控股所有者达成重组协议，后者是一家由私募股权公司Ares Management管理的基金，后者在2014年收购了吉他中心的股份。该公司表示，它的交易还得到了新投资者Brigade Capital Management和凯雷集团(Carlyle Group)管理的一只基金以及多家贷款机构的支持。\n吉他中心首席执行官罗恩·贾平加在一份声明中表示：“这项协议将使我们能够大幅削减债务，并对我们的业务进行再投资，以便更好地服务我们的客户，实现我们将更多音乐推向世界的使命，”吉他中心首席执行官罗恩·贾平加在一份声明中表示。", "note_en": "Musical instrument retailer Guitar Center plans to file for Chapter 11 bankruptcy protection after negotiating a debt-cutting deal with key investors and lenders.\n The company, which has been struggling with excessive debt for years, said late Friday that it plans to stay in business.\n The Westlake Village, Calif.-based retailer said it&#39;s &#34;pleased with its overall store footprint,&#34; which includes nearly 300 Guitar Center stores and more than 200 Music &amp; Arts stores.\n But the retailer said it had hired a real estate firm &#34;to explore opportunities to optimize its real estate portfolio and other agreements to focus on investments that best position the Company to return to its growth trajectory prior to COVID-19.&#34;\n Guitar Center sells and rents instruments, provides lessons and handles repairs. The company&#39;s other brands include Musician’s Friend, Woodwind Brasswind and AVDG.\n  Like most non-essential retailers, Guitar Center was forced to temporarily close its stores in the early days of the pandemic. While its online revenue jumped during that period, &#34;we expect revenues generated will not cover the sales that would have occurred through the stores,&#34; S&amp;P Global Ratings wrote in a research note in late May.\n    Guitar Center said Friday it had reached a restructuring deal with its controlling owner, a fund managed by private equity firm Ares Management, which acquired its stake in Guitar Center in 2014. The company said it also got support for its deal from new investors Brigade Capital Management and a fund managed by The Carlyle Group and from various lenders.\n  “This agreement will allow us to significantly reduce our debt and reinvest in our business in order to better serve our customers and deliver on our mission of putting more music in the world,&#34; Guitar Center CEO Ron Japinga said in a statement.", "posttime": "2020-11-15 12:49:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "中心,center", "title": "吉他中心将根据破产法第11章申请破产保护", "title_en": "Guitar Center to file for Chapter 11 bankruptcy protection", "transed": 1, "url": "https://www.usatoday.com/story/money/2020/11/14/guitar-center-chapter-11-bankruptcy/6294720002/", "via": "", "real_tags": ["中心", "center"]}, {"category": "", "categoryclass": "", "imagename": "04cea8cb07f8edeef8f7ad3820d4585a.jpg", "infoid": 1035230, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "S含有大约10%的糖。但这意味着它含有大约90%的非糖--被称为甘蔗渣(如图)的物质，一旦甘蔗被碾碎，含糖的汁液从甘蔗中榨出，这种物质就会保留下来。2017年全球蔗糖产量为1.85亿吨。这会产生大量的甘蔗渣。\n目前，这其中的大部分都被烧毁了。通常，它为为磨坊提供动力的当地发电机提供燃料，因此不会被浪费。但波士顿东北大学的机械工程师朱红力(音译)认为，它可以得到更好的利用。正如她和她的同事们在本周的《物质》(Matter This Week)中所描述的那样，在咖啡杯等一次性食品容器中使用的塑料，经过一点调整后，甘蔗渣是一种极好的、可生物降解的塑料替代品。\n朱博士并不是第一个有这种想法的人。但之前的尝试往往无法在与液体接触后存活下来。她认为她可以通过在甘蔗果肉中添加另一种可生物降解的材料来克服这一点。她从之前的研究中了解到，过去的努力在潮湿时失败的主要原因是甘蔗渣由短纤维组成，这些短纤维无法重叠到足以赋予成品弹性的程度。因此，她试图加入一种适当的长纤维物质。\n竹子似乎符合要求。它生长迅速，容易降解，并且有适当的长纤维。而且成功了。当研究人员将少量竹浆混合到甘蔗渣中时，他们发现结果是短纤维和长纤维强烈交织在一起。令人惊喜的是，他们还发现，在这一过程中使用的热压已经动员了纤维中的一些木质素，这种坚硬的防水材料现在起到了将纤维粘合在一起的粘合剂的作用。\n为了测试他们的新材料，朱博士和她的同事们首先将热油倒在上面，发现他们的发明并没有像以前的甘蔗渣产品那样渗透到材料中，相反，油被他们的发明排斥了。他们还发现，当他们用这种材料做了一个杯子，并在里面装满了加热到几乎沸点的水时，杯子保持了两个多小时的完好无损。虽然这没有塑料杯的寿命长(它可以无限期地存活)，但对于所有的实际用途来说，它已经足够长了。此外，这种新材料的强度是制造杯子的塑料的两倍，而且绝对是可生物降解的。当朱博士将一个用它制成的杯子埋在地里时，其中一半在两个月内腐烂了，她估计六个月内就会完全消失。\n最后，但并非最不重要的一点是，她估计，用这种新材料制作的杯子每吨价格将达到2333美元。这是由聚乳酸(发酵植物淀粉)制成的可生物降解杯子每吨4750美元成本的一半，仅略高于制造塑料杯所需的每吨2177美元。总体而言，朱博士认为，蔗渣是制作咖啡杯、吸管、一次性盘子、轻质餐具等的明显选择。一旦使用，这些垃圾就可以问心无愧地被丢弃在垃圾填埋场。。\n有关气候变化的更多报道，请注册我们每两周一次的时事通讯《气候问题》，或访问我们的气候变化中心。\n这篇文章刊登在印刷版的科技版上，标题是“你想要甘蔗吗？”", "note_en": "S  contains around 10% sugar. But that means it contains around 90% non-sugar—the material known as bagasse (pictured) which remains once the cane has been pulverised and the sugar-bearing juice squeezed out of it. World production of cane sugar was 185m tonnes in 2017. That results in a lot of bagasse.\n At the moment, most of this is burned. Often, it fuels local generators that power the mills, so it is not wasted. But Zhu Hongli, a mechanical engineer at Northeastern University in Boston, thinks it can be put to better use. As she and her colleagues describe in  Matter this week, with a bit of tweaking bagasse makes an excellent—and biodegradable—replacement for the plastic used for disposable food containers such as coffee cups.\n  Dr Zhu is not the first person to have this idea. But previous attempts tended not to survive contact with liquids. She thought she could overcome that by spiking the sugar cane pulp with another biodegradable material. She knew from previous research that the main reason past efforts fell to pieces when wet is that bagasse is composed of short fibres which are unable to overlap sufficiently to confer resilience on the finished product. She therefore sought to insert a suitably long-fibred substance.\n Bamboo seemed to fit the bill. It grows quickly, degrades readily and has appropriately long fibres. And it worked. When the researchers blended a small amount of bamboo pulp into bagasse, they found that the result had a strong interweaving of short and long fibres. As a bonus, they also discovered that the hot pressing used as part of the process had mobilised some of the lignin in the fibres, and that this stiff, water-repelling material was now acting as an adhesive that bound the fibres together.\n To put their new material through its paces, Dr Zhu and her colleagues first poured hot oil onto it and found that, rather than penetrating the material, as it would have with previous bagasse products, the oil was repelled by their invention. They also found that when they made a cup out of the stuff and filled it with water heated almost to boiling point, the cup remained intact for more than two hours. Though this is not as long as a plastic cup would last (it would survive indefinitely) it is long enough for all practical purposes. Moreover, the new material is twice as strong as the plastic used to make cups, and is definitely biodegradable. When Dr Zhu buried a cup made out of it in the ground, half of it rotted away within two months, and she reckons six months would have seen it gone completely.\n Last, but by no means least, she estimates that cups made from the new material would cost $2,333 a tonne. That is half the $4,750 a tonne cost of biodegradable cups made from polylactic acid (fermented plant starch), and only slightly more than the $2,177 a tonne that it takes to make plastic cups. Overall, then, Dr Zhu argues that bagasse is an obvious choice for making coffee cups, straws, disposable plates, lightweight cutlery and so on. Once used, these could be dumped in landfills with a clear conscience. ■\n  For more coverage of climate change, register for The Climate Issue, our fortnightly  newsletter, or visit our  climate-change hub\n This article appeared in the Science &amp; technology section of the print edition under the headline &#34;Would you like sugar cane in that?&#34;", "posttime": "2020-11-15 12:28:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "甘蔗,coffee,杯子", "title": "用甘蔗制成的更好的一次性咖啡杯", "title_en": "Better disposable coffee cups made from Sugar Cane", "transed": 1, "url": "https://www.economist.com/science-and-technology/2020/11/14/better-disposable-coffee-cups", "via": "", "real_tags": ["甘蔗", "coffee", "杯子"]}, {"category": "", "categoryclass": "", "imagename": "7d13744d6ceeb25a5a6f7170ad81784c.jpg", "infoid": 1035229, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一次近2800万张德克萨斯州驾照的黑客攻击中，你的个人信息可能被盗了。一家可以访问车管所记录的保险软件公司表示，它被攻破了。\n仅仅是知道我的信息可能被用于欺诈活动就让我感到非常不安，司机amera Guest做出了反应。\n近2800万名在2019年2月前拿到驾照的德克萨斯州司机的驾照号码、姓名、出生日期、地址和车辆登记信息被盗。\n身份窃贼可以利用这些信息做很多事情。身份盗窃资源中心的詹姆斯·李(James Lee)表示：“他们可以尝试创建一个新账户，当他们登录到现有账户时，他们可以试着证明自己就是你。”\n一家名为Vertafort的保险软件公司在一份声明中表示，这些数据无意中存储在一个不安全的存储服务中，该服务在今年3月至8月期间遭到黑客攻击。Vertafort拥有合法访问车管所信息的权限。\nVertafort表示，该公司自8月中旬以来就知道了这起泄密事件。所以我们问为什么他们刚刚宣布了这一消息。\n该公司表示，他们向德克萨斯州总检察长办公室、德克萨斯州机动车管理局和德克萨斯州公共安全部报告了此事，并写道，应执法部门的要求，Vertafort的通知被推迟了。\nVertafort说，他们聘请了第三方公司进行调查，但到目前为止没有发现信息被滥用。但是身份盗窃资源中心的詹姆斯·李说，要等一等。\n这是他们可能会等待使用的东西。所以你并没有因为一年过去了、两年过去了、三年过去了而走出困境，李解释道。\n要非常勤奋地查看信用卡对账单和类似的东西。然后最终考虑升级一些密码。李开复说：“我们今天给人们的建议是，不要有密码，要有密码短语。”\n德克萨斯州机动车管理局就这起泄密事件发表了以下声明：信息泄露是由Vertafort造成的。德克萨斯州机动车管理局(Texas Department Of Motor Vehicles)没有遭到黑客攻击，也不是此次入侵的原因。德克萨斯州机动车管理局非常重视保护消费者信息。该部门根据现有的法律法规和行业原则对数据进行分类和保护，并根据国家和机构的数据保留和数据清理政策保留和销毁所有数据。\n出于《交通法规》第730章和《联邦司机隐私保护法》(Federal Drivacy Privacy Protection Act)的规定，交通部只允许外部使用信息。这些法律允许，有时还要求向被授权方发布机动车辆记录。\n司机可以通过拨打888-479-3560联系Vertafort，了解他们的信息是否被黑客入侵。*Vertafort表示，它将通过Kroll向受影响的人提供一年的免费信用监测，这将有助于解决你的信用报告受到的任何损害。你可以在这里报名参加监控。\n身份盗窃资源中心在其网站上提供了更多处理身份盗窃的信息和资源。", "note_en": "Your personal information may have been stolen in a hack of nearly 28 million Texas driver&#39;s licenses. An insurance software company with access to DMV records says it was breached.\n  &#34;Just to know my information could be used for fraudulent activity makes me feel very uneasy,&#34; reacted driver Amera Guest.\n       Driver&#39;s license numbers, names, birthdates, addresses, and vehicle registration information were stolen for nearly 28 million Texas drivers who received a license before February of 2019.\n     &#34;There&#39;s a lot an identity thief can do with this information.  They can try to create a new account and they can try to prove they are you when they&#39;re logging in to an existing account,&#34; said James Lee with the Identity Theft Resource Center.\n An insurance software company called Vertafore, which has legal access to that DMV information, said in a statement the data was inadvertently stored in an unsecured storage service that was hacked between March and August of this year.\n    Vertafore says the company has known about the breach since mid-August.  So we asked why they&#39;re just now announcing it.\n  The company says they reported it to the Texas Office of the Attorney General, the Texas Department of Motor Vehicles, and the Texas Department of Public Safety and wrote, &#34;Vertafore’s notice was delayed at law enforcement’s request.&#34;\n Vertafore says they hired a third-party firm to investigate but identified no misuse of the information so far. But James Lee with the Identity Theft Resource Center says give it time.\n &#34;It&#39;s something they may wait to use.  So you&#39;re not out of the woods just because a year has passed, two years have passed, three years have passed,&#34; Lee explained.\n  &#34;Be very diligent about watching credit card statements and things of that nature.  And ultimately consider upgrading some passwords.  The advice we give people today is don&#39;t have a password, have a passphrase,&#34; said Lee.\n   The Texas DMV issued this statement regarding the breach:  &#34;The breach of information was caused by Vertafore. The Texas Department of Motor Vehicles was not hacked and was not the cause of the breach. The Texas Department of Motor Vehicles takes protecting consumer information very seriously. The department classifies and protects data based on existing statutory regulations and industry principles, and retains and destroys all data in accordance with state and agency data retention and data sanitization policies.\n &#34;The department only allows outside use of information for reasons found in Transportation Code Chapter 730 and the Federal Drivers Privacy Protection Act. These laws permit, and at times require, the release of motor vehicle records to authorized parties.&#34;\n Drivers can contact Vertafore to see if their information was hacked by calling 888-479-3560.  Vertafore says it is offering those impacted one year of free credit monitoring through Kroll, which will help resolve any damage to your credit report.  You can sign up for monitoring  here.\n  The Identity Theft Resource Center offers more information and resources to deal with identity theft on  their website.", "posttime": "2020-11-15 12:28:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据,texas,信息", "title": "近2800万持有执照的德克萨斯州司机遭遇数据泄露", "title_en": "Nearly 28M licensed Texas drivers hit by data breach", "transed": 1, "url": "https://www.fox26houston.com/news/nearly-28-million-licensed-texas-drivers-hit-by-data-breach?taid=5fafc6ce1ef01a000123a0c2&utm_campaign=trueanthem&utm_medium=trueanthem&utm_source=twitter", "via": "", "real_tags": ["数据", "texas", "信息"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1035228, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "登录失败。请检查您是否从列表中选择了正确的社团，并输入了用于登录您的社团网站的用户名和密码。\n一些社会期刊要求您创建个人简档，然后激活您的社会帐户。", "note_en": "Login failed. Please check you selected the correct society from the list and entered the user name and password you use to log in to your society website.\n   Some society journals require you to create a personal profile, then activate your society account", "posttime": "2020-11-15 12:28:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "sars,detection,登录", "title": "意大利流行前期意外检测到SARS-CoV-2抗体", "title_en": "Unexpected detection of SARS-CoV-2 antibodies in the prepandemic period in Italy", "transed": 1, "url": "https://journals.sagepub.com/doi/10.1177/0300891620974755", "via": "", "real_tags": ["sars", "detection", "登录"]}, {"category": "", "categoryclass": "", "imagename": "6de68e4e504016b66db2cb5ab14ffd72.jpg", "infoid": 1035227, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在最近关于音乐的DMCA下架通知激增的情况下，一些Twitch流媒体用户报告说，他们的视频由于游戏中的音效而被标记。\n在推特上，多名内容创作者批评Twitch将音频静音，或者在他们的视频中发布DMCA，因为他们听到了祖父的钟声、鸟和昆虫的声音、警笛和风声。\n在Twitch平台上个月在打击版权音乐的行动中清除了数千个视频后，他们加入了许多其他流媒体用户的行列，表达了对Twitch的不满。Twitch平台面临着来自各大唱片公司的数千起DMCA索赔。\n该公司随后鼓励流媒体用户查看档案，删除任何可能的版权材料，但没有提供构成侵权的信息，谁提出了索赔，如何联系他们，或者可能会受到什么处罚--这引发了进一步的反弹。\n尽管Twitch已经为自己对此事的处理方式道歉，但音效方面的DMCA等问题仍在继续出现，此外还有其他报道的问题，比如越来越多的流媒体用户报告说，他们因为多年的侵犯版权行为而面临平台禁播，或者在某些情况下，DMCA会在他们已经删除的视频上标记DMCA。\n注册每日更新，在您的收件箱中获取最好的GamesIndustry.biz。\n流媒体平台为给流媒体用户无益的警告道歉，面对唱片公司如雪崩般的DMCA索赔几乎没有通知。\n目前还没有关于这篇文章的评论。为什么不第一个发布呢？", "note_en": "Amid a recent surge of DMCA takedown notices over music, a number of Twitch streamers are reporting their videos being flagged due to in-game sound effects.\n On Twitter, multiple content creators have criticized Twitch for muting the audio or issuing DMCAs on their videos for sounds such as  grandfather clock chimes,  bird and insect noises,  police sirens, and  wind.\n They join numerous other streamers voicing displeasure with Twitch after the platform  purged thousands of videos last month in a crackdown on copyrighted music, as the platform faced thousands of DMCA claims from major record labels.\n The company then went on to encourage streamers to go through their archives to delete any possible copyrighted material, but did not provide information on what would constitute a violation, who was making claims, how to contact them, or what penalties could be issued -- prompting further backlash.\n Though  Twitch has apologized for its handling of the situation, issues such as DMCAs on sound effects continue to arise, alongside other reported problems, such as  a growing list of streamers reporting either facing platform bans for years-old copyright violations, or in some cases, DMCA flags on videos they&#39;ve already deleted.\n Sign up for The Daily Update and get the best of GamesIndustry.biz in your inbox.\n Streaming platform apologizes for giving streamers unhelpful warnings, little notice in face of avalanche of DMCA claims from record labels\n  There are no comments on this article yet. Why not be the first to post one?", "posttime": "2020-11-15 12:28:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,dmca,streamers", "title": "Twitch Streamers报告游戏中音效的DMCA被拿下", "title_en": "Twitch streamers report DMCA takedowns for in-game sound effects", "transed": 1, "url": "https://www.gamesindustry.biz/articles/2020-11-13-twitch-streamers-report-dmca-takedowns-for-in-game-sound-effects", "via": "", "real_tags": ["游戏", "dmca", "streamers"]}, {"category": "", "categoryclass": "", "imagename": "1c31ecfa570625c6776f1f5bf2bcc797.jpg", "infoid": 1035226, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我对打开别人推到我手机上的应用程序持怀疑态度。尤其是如果他们告诉我我是如何生活的，并提出可以让我过得更好的方法。\n毕竟，它们是由一些人创造出来的，这些人可能只是伪装的技术类型，过着自己俗气的生活。我并不是特指任何为苹果工作的人。\n然而，最近，我屈服了。我打开iPhone上的Apple Health应用，只是想看看里面有什么。\n我稍微在撒谎。我有太多朋友吹嘘自己每天走了多少步。\n我从未考虑过这样的数据。我试着走路。我试着骑自行车。我试着移动。我希望能活得久一点。\n但有一位朋友告诉我，在最近的一次纽约之旅中，他一天走了4万步。嗯，他是个多愁善感的人。\n尽管如此，我还是开始查看我的健康应用程序数据，同时担心这只是一个开始，只会导致一个可怕的结局。\n我的iPhone Health应用程序提供了一些简单的信息乐趣。步数，步行和骑行的距离，以及攀登的次数。\n它开始赞扬我。上面说我比去年走了更多的步，走得更远。\n这似乎很奇怪，我很快就明白了原因。去年，我经常去健身房。我会把手机放在自行车操纵台上，这样它就永远不会进我的口袋了。这意味着我的手机没有计算所有这些假定的步数。\n现在，当我在家里骑固定自行车时，健康应用程序就放在我的短裤口袋里，坚持让我在骑车时走7000步。这些台阶总共有2.7英里。\n我的自行车告诉我，我已经骑了14英里，上上下下。Health应用程序只是感觉到我似乎在大踏步前进。它不能辨别我骑自行车的身份。\n然而，应用程序的阴险本质是如此之深，以至于你忍不住又回到了它们的网站上。再三。\n苹果会告诉我，Health应用程序只是为了帮助我成为一个更好、更健康的人。\n你看，在任何情况下，它都会告诉我，我比前一天走得更少了。或者是前一周。即使是0.1英里的差距，责骂也是痛苦的。\n每次我下楼的时候，我都会确保我的iPhone在我的口袋里。只是为了提高我的步数，你明白的。\n每次我走进房子里的任何地方--这些天我在家里待了很长时间--如果我把手机忘在沙发上、桌子上或车里，我都会责备自己。\n我会在超市里快速扫一眼，看看我的成绩如何。\n这些东西的精神成本是多少？事实上，一款健康应用能让你的血压升高多少？\n尽管如此，每次我的手机声称我爬了52段楼梯时，我都会自豪地拍拍自己。我一直在看我的健康应用程序，以获得更多的认可。\n健康应用现在已经成为一种习惯。我每天至少参观10次。现在我可以准确地告诉你我在当地的超市里走了多少步--897步。\n我可以告诉你我在高尔夫球场上走了多少步--16979步。\n这是走路时双脚着地的时间百分比。值越低，意味着你走路的重心用一只脚而不是两只脚的时间更多，这可能是更好的平衡迹象。苹果公司表示，在散步过程中，这一指标将下降20%至40%。\n它补充道：当你把手机放在腰部附近，比如放在裤子口袋里，在平地上稳步行走时，iPhone会自动记录下两次支撑的时间。\n我当时的年龄在20多岁到20多岁之间。但令人痛苦的是，我不能确定这有多好。我的iPhone让我左右为难。我是平衡的还是不平衡的？我应该改变我的步态还是我的手机？\n现在就是步长问题了。如果头发变短了，我不得不担心，因为这意味着我在变老。我现在会人为地延长我的步长，从而危及我的双支撑时间吗？\n我的自行车让事情变得更加复杂。我把手机放在口袋里，以便多走几步。同时，这也缩短了我的平均步长。毕竟，骑自行车感觉--对手机来说--就像是迈出了很小的一步。突然间，我的平均步长表明我已经78岁了。(披露：我不是。)。\n我显然有麻烦了。现在，我的注意力会集中在走路的方式上，以至于我不能再想其他的事情了。这就像是当地警察局进行的芭蕾舞培训。\n还有更多。行走速度。我无法应付这件事。苹果又来了：随着年龄的增长，走路的速度往往会变慢，但突然下降可能表明你的健康状况发生了变化。\n我希望我能意识到我什么时候走得更慢或更快。在高尔夫球场上，我不着急，因为我可能会和和我一起打球的人聊天。\n但现在我发现自己偷偷地浏览了一下Health应用程序，看看我是否在几个洞之后损失了一个百分点。\n我知道现在我们都应该通过数据来定义一切。我敢肯定，Tinder上有很多人的个人资料中都有这样的短语，比如十几岁时的双倍支持时间(Double Support Time)和每天37,000步，伙计，也许没有逗号。\n走路不对称是指你用一只脚走路的速度比另一只脚快或慢的时间所占的百分比。\n我的手机突然想让我知道，走路不均匀，比如一瘸一拐的，可能是疾病、受伤或其他健康问题的征兆。\n我的是健康的0%。这很奇怪，因为我的一条腿有一种名为腓神经综合症的疾病，偶尔会让我有点跛行。", "note_en": "I&#39;m suspicious of opening  apps that someone else has shoved onto my phone. Especially if they tell me how I&#39;m living my life and suggest ways I could be living it better.\n They were, after all, created by people who may merely be sanctimonious tech types with a tawdry life of their own. And I&#39;m not specifically referring to anyone who works for  Apple.\n Recently, though, I succumbed. I opened the  Apple Health app on my  iPhone, just to see what was there.\n I&#39;m lying, slightly. I have too many friends who boast about how many steps they take every day.\n I&#39;d never considered such data. I try and walk. I try and bike. I try and move. I hope to survive a little longer.\n But here was one friend telling me that, on a recent trip to New York, he&#39;d taken 40,000 steps a day. Well, he&#39;s a troubled soul.\n    Still, I began to look at my Health app data, simultaneously fearing that this was a beginning that could only lead to a horrible end.\n My iPhone Health app offered a few simple delights of information. The number of steps, the walking and riding distance, and the number of flights climbed.\n It began to praise me. It said I was taking more steps and walking further than I did last year.\n This seemed strange and I soon realized why. Last year, I used to go to a gym. I&#39;d prop my phone up on the bike console, so it would never be in my pocket. This meant my phone didn&#39;t count all those supposed steps.\n Now, as I ride a stationary bike at home, the Health app sits in the pocket of my shorts and insists that I perform 7,000 steps while I&#39;m biking. These steps constitute 2.7 miles.\n Which they don&#39;t. My bike tells me I&#39;ve ridden 14 miles, up and downhills. The Health app is merely feeling that I appear to be taking strides. It can&#39;t tell I&#39;m on a bike.\n Yet the insidious nature of apps is such that you can&#39;t help but go back to them. Again and again.\n Apple will tell me the Health app is only there to help me become a better, healthier person.\n  You see, it would, at any instance, tell me I was walking less than I did the day before. Or the week before. Even if it was a 0.1 miles difference, the scolding was painful.\n Every time I went downstairs, I made sure my iPhone was in my pocket. Just to better my step score, you understand.\n Every time I went anywhere in the house -- and I&#39;m spending a lot of time in the house these days -- I&#39;d berate myself if I&#39;d left my phone on the couch, on a table, or in the car.\n I&#39;d take a quick glance in the supermarket, just to see how I was scoring.\n What is the mental cost of these things? How much, indeed, does a Health app raise your blood pressure?\n Still, every time my phone claimed I&#39;d climbed 52 flights of stairs I patted myself with pride. And kept looking at my Health app for more approbation.\n   The Health app was now a habit. I was visiting it at least 10 times a day. I can now tell you exactly how many steps I take wafting around my local supermarket -- 897.\n I can tell you how many steps I take walking a golf course -- 16,979.\n    &#34;This is the percentage of time during a walk that both feet are on the ground. A lower value means you spend more of your walk with your weight on one foot instead of two, which can be a better sign of balance. During a walk, this measure will fall somewhere between 20% to 40%,&#34; says Apple.\n It adds: &#34;Double Support Time is recorded automatically on iPhone when you carry your phone near your waist, such as in a pants pocket and walk steadily over flat ground.&#34;\n I was ranging in the mid to high 20s. But the agony was that I couldn&#39;t be sure how good this was. My iPhone left me hanging between two feet. Am I balanced or unbalanced? Should I change my gait or my phone?\n And now there&#39;s Step Length. I have to worry if it gets shorter, as this means I&#39;m getting older. Will I now artificially lengthen my Step Length, hence endangering my Double Support Time?\n My biking complicates things further. I keep the phone in my pocket, in order to score more steps. At the same time, this reduces my average Step Length. After all, riding a bike feels -- to the phone -- like taking little steps. Suddenly, then, my average Step Length suggested I was 78 years old. (Disclosure: I&#39;m not.)\n I was clearly in trouble. My mind would now focus so hard on how I walked that I wouldn&#39;t be able to think about anything else. This was like ballet dancer training conducted by the local police department.\n There was more. Walking Speed. I can&#39;t cope with this. Here&#39;s Apple again: &#34;Walking speed tends to slow down as you get older but sudden decreases may indicate a change in your health.&#34;\n  I hope I&#39;m conscious of when I walk more slowly or more quickly. On the golf course, I don&#39;t hurry, as I&#39;m likely chatting to the people I&#39;m playing with.\n But now I found myself sneaking a look at the Health app to see if I&#39;d lost a percentage point after a few holes.\n  I know we&#39;re all supposed to define everything via data now. I feel sure there are many on Tinder whose profiles includes phrases such as &#34;Double Support Time in the low teens&#34; and &#34;37,000 steps a day, man,&#34; perhaps without the comma.\n    &#34;Walking Asymmetry is the percent of time that your steps with one foot are faster or slower than the other foot.&#34;\n  My phone suddenly wants me to know that &#34;uneven walking patterns, such as limping, can be a sign of disease, injury, or other health issues.&#34;\n   Mine was a wholesome 0%. Which is odd, as I have a thing called Peroneal Nerve Syndrome in one leg, which occasionally makes me limp a little.", "posttime": "2020-11-15 12:27:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ios,ios14,updated,手机", "title": "我更新到了iOS14，我慢慢发疯了", "title_en": "I updated to iOS 14 and I'm slowly going mad", "transed": 1, "url": "https://www.zdnet.com/article/apple-updated-my-iphone-software-and-im-slowly-going-mad/", "via": "", "real_tags": ["ios", "ios14", "updated", "手机"]}, {"category": "", "categoryclass": "", "imagename": "bc934bf5106bdc02677b23f8373364bd.jpg", "infoid": 1035225, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据Block Research的数据，美国最大的两个市场监管机构-美国证券交易委员会(SEC)和商品期货交易委员会(CFTC)-迄今已对密码公司和创始人处以至少1.98亿美元的罚款。", "note_en": "The top two U.S. market regulators — the SEC and the CFTC — have charged crypto firms and founders at least $198 million in penalties to date, according to The Block Research.", "posttime": "2020-11-15 12:09:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "密码,美国,来自,crypto,委员会", "title": "美国监管机构迄今已对密码公司开出1.98亿美元罚单，其中1.75亿美元来自SEC，2300万美元来自CFTC", "title_en": "US regulators have levied $198M in fines against crypto firms to date, of which $175M came from SEC and $23M from CFTC", "transed": 1, "url": "https://www.theblockcrypto.com/linked/84544/u-s-regulators-have-hit-crypto-firms-with-at-least-198-million-in-financial-penalties-to-date", "via": "", "real_tags": ["密码", "美国", "来自", "crypto", "委员会"]}, {"category": "", "categoryclass": "", "imagename": "48a963b9441f2f697f75db165f932a17.jpg", "infoid": 1035224, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在最近的记忆中，NASA做过的一件更令人兴奋的事情是将探测器降落在小行星本努的表面。奥西里斯-霸王龙成功地在小行星表面短暂着陆，并吞噬了一堆样本，这些样本将被带回地球进行研究。在围绕这颗小行星运行了几年后，一些新的数据现在被公布了，这让人们对这颗小行星的组成有了更多的了解。科罗拉多大学的研究人员宣布了基于航天器在轨道上两年内捕获的数据的发现，表明小行星很可能是空心的。航天工程科学部的丹尼尔·舍尔斯说，小行星中心的空隙似乎可以容纳几个足球场。由于小行星的核心看起来比外部更弱，从长远来看，小行星的生存可能会受到威胁。舍尔斯说，在一百万年或更短的时间内，整个小行星可能会飞散。通过结合OSIRIS-Rex记录的数据，科学家们可以绘制出这颗小行星的重力地图，这表明内部是坚固的和岩石的假设是错误的。研究小组认为，小行星的自转可能是造成内部空洞的原因。随着时间的推移，本努的旋转速度越来越快，他们认为它正在将自己旋转成碎片。由于小行星的核心密度较低，因此整个小行星在自转时更容易解体。现在，小行星重力场的测量已经结束，科学家团队已经结束了他们在OSIRIS-REX任务中的工作。他们的工作成果为分析航天器将返回地球的样本的计划做出了贡献。目前的计划将对样本进行分析，以确定颗粒之间的凝聚力，这是影响研究中观察到的质量分布的关键物理特性。", "note_en": "One of the more exciting things that NASA has done in recent memory is landing a probe on the surface of asteroid Bennu. OSIRIS-REx successfully touched down briefly on the asteroid’s surface and gobbled up a bunch of samples that will be returned to earth for study. After orbiting the asteroid for a couple of years, some new data has now been published that sheds more light on the asteroid’s composition.    Researchers from the University of Colorado announced findings based on data captured by the spacecraft in the two years it was in orbit that shows the asteroid is likely hollow. Department of aerospace engineering sciences Daniel Scheeres said it appears the void in the asteroid center could hold a couple of football fields. Since the core of the asteroid appears to be weaker than the exterior, the asteroid’s survival over the long-term could be at risk. Scheeres says that in a million years or less, the entire asteroid could fly apart. By combining data recorded by OSIRIS-REx, the scientists could create a map of sorts of the gravity of the asteroid, suggesting that assumptions the inside was solid and rocky were wrong. The team believes that the asteroid’s rotation could be responsible for the void inside. Over time, Bennu’s rotation is gaining speed, and they think it’s in the process of spinning itself into pieces. Since the core is low density, it’s easier for the entire asteroid to fall apart as it spins. Now that measurements of the gravity field of the asteroid over, the team of scientists have wrapped up their work on the OSIRIS-REx mission. The results of their work have contributed to the plan to analyze samples that will be returned to earth by the spacecraft. The current plan will see the samples analyzed to determine the cohesion between grains, a key physical property that impacts the mass distribution observed in the study.", "posttime": "2020-11-15 11:26:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "研究,bennu,小行星", "title": "根据一项新的研究，小行星本努可能是空心的", "title_en": "Asteroid Bennu may be hollow, according to a new study", "transed": 1, "url": "https://www.slashgear.com/asteroid-bennu-may-be-hollow-according-to-a-new-study-08646233/", "via": "", "real_tags": ["研究", "bennu", "小行星"]}, {"category": "", "categoryclass": "", "imagename": "336d53abac7507a4a3ba8f0133fddd3f.jpg", "infoid": 1035223, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "五角大楼代理参谋长克里斯·米勒(Chris Miller)在向美国军队发出的第一条信息中表示，现在是结束美国在中东战争的时候了。\n我们迎接了挑战，我们全力以赴。现在，是时候回家了，米勒写道。\n自9月1日以来，阿富汗、伊拉克和叙利亚的战争已经让美国纳税人损失了超过1.57万亿美元。根据美国国防部的一份报告，2001年11月11日。\n华盛顿报道--五角大楼代理参谋长克里斯·米勒(Chris Miller)在向美军发出的第一条信息中表示，他厌倦了战争，是时候结束美国在中东的冲突了。\n周一，在唐纳德·特朗普(Donald Trump)总统突然解除国防部长马克·埃斯佩尔(Mark Esper)职务后，米勒升任五角大楼代理国防部长。\n的确，这场斗争持续了很长时间，我们付出了巨大的牺牲，许多人厌倦了战争--我就是其中之一--但这是我们将努力从领导角色转变为辅助角色的关键阶段，米勒在周六清晨给国防部员工的邮件中写道。\n我们不是一个永无休止的战争的民族--这是我们祖先为之奋斗的一切的对立面。他补充说，所有的战争都必须结束，他写道，美国正处于击败基地组织及其同伙的边缘。\n我们迎接了挑战，我们全力以赴。现在，是时候回家了，米勒写道。\n自9月1日以来，阿富汗、伊拉克和叙利亚的战争已经让美国纳税人损失了超过1.57万亿美元。根据美国国防部的一份报告，2001年11月11日。据五角大楼称，阿富汗战争于19年前开始，已耗费美国纳税人1930亿美元。这场战争已成为美国持续时间最长的冲突。\n特朗普在2016年的竞选中号召停止中东地区无休止的可笑战争，上个月他在推特上宣布，目前在阿富汗服役的美军将在圣诞节前回国。\n当时，尚不清楚特朗普是通过推文下达命令，还是重申长期以来的竞选承诺，以便在美国总统大选之前吸引选民。\n今年早些时候，美国与塔利班达成了一项和平协议，这将带来永久停火，并在7月中旬之前将美军的足迹从大约1.3万人减少到8600人。到2021年5月，所有外国军队都将离开这个饱受战争蹂躏的国家。\n特朗普此前曾指示五角大楼减少美国在冲突地区的战斗力量。\n2018年，特朗普在推特上表示，美国将从叙利亚撤军，此举在五角大楼引发了冲击波，并在一定程度上导致了时任国防部长詹姆斯·马蒂斯(James Mattis)的辞职。特朗普后来改变了从叙利亚撤军的决定。\n今年5月，特朗普在推特上抱怨称，美国在阿富汗的角色已经沦为警察部队，而不是战斗部队。\n在白宫的一次活动中，当被媒体记者问及对这条推文的看法时，特朗普表示，如果需要，美国可能会回到阿富汗。\n如果有必要，我们总是可以回去的。如果我们必须回去，我们会回去，我们会怒气冲冲地回去，“特朗普在5月份说。", "note_en": "In his first message to U.S. military forces, acting Pentagon chief Chris Miller said it&#39;s time to end America&#39;s wars in the Middle East.\n &#34;We met the challenge; we gave it our all. Now, it&#39;s time to come home,&#34; Miller wrote.\n The wars in Afghanistan, Iraq and Syria have cost U.S. taxpayers more than $1.57 trillion since Sept. 11, 2001, according to a Defense Department report.\n WASHINGTON — In his first message to U.S. military forces, acting Pentagon chief Chris Miller said he was &#34;weary of war&#34; and that it was time to end America&#39;s conflicts in the Middle East.\n On Monday, Miller ascended to the Pentagon&#39;s acting Secretary of Defense role after President Donald Trump&#39;s  sudden termination of Secretary of Defense Mark Esper.\n  &#34;Indeed, this fight has been long, our sacrifices have been enormous, and many are weary of war — I&#39;m one of them — but this is the critical phase in which we transition our efforts from a leadership to supporting role,&#34; Miller wrote in an early Saturday morning  message to Department of Defense employees.\n &#34;We are not a people of perpetual war — it is the antithesis of everything for which we stand for which our ancestors fought. All wars must end,&#34; he added, writing that the U.S. was &#34;on the verge of defeating Al Qaida and its associates.&#34;\n &#34;We met the challenge; we gave it our all. Now, it&#39;s time to come home,&#34; Miller wrote.\n  The wars in Afghanistan, Iraq and Syria have cost U.S. taxpayers more than $1.57 trillion since Sept. 11, 2001, according to a  Defense Department report. The war in Afghanistan, which has dragged on to become America&#39;s longest conflict, began 19 years ago and has cost U.S. taxpayers $193 billion, according to  the Pentagon.\n Trump, who campaigned in 2016 on stopping &#34;ridiculous endless wars&#34; in the Middle East, took to Twitter last month to announce that  American forces currently serving in Afghanistan will be home by Christmas.\n  At the time, it was unclear if Trump was giving an order via tweet or reiterating a long-held campaign promise in order to appeal to voters ahead of the U.S. presidential election.\n  Earlier this year, the  United States brokered a peace deal with the Taliban that would usher in a permanent cease-fire and reduce the U.S. military&#39;s footprint from approximately 13,000 to 8,600 by mid-July. And by May 2021, all foreign forces would leave the war-torn country.\n Trump has previously directed the Pentagon to reduce the U.S. fighting force in conflict zones.\n In 2018, Trump tweeted that the United States would be withdrawing troops out of Syria, a move that sent a shockwave through the Pentagon and contributed in part to the resignation of then-Defense Secretary James Mattis. Trump later reversed his decision to withdraw from Syria.\n In May, Trump complained on Twitter that America&#39;s role in Afghanistan has been reduced to a &#34;police force&#34; and not a &#34;fighting force.&#34;\n  When asked about the tweet by reporters during a White House event, Trump said that the U.S. could go back to Afghanistan if needed.\n &#34;We can always go back if we have to. If we have to go back, we&#39;ll go back, and we&#39;ll go back raging,&#34;  Trump said in May.", "posttime": "2020-11-15 11:26:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "五角大楼,home,美国", "title": "是时候回家了-五角大楼参谋长希望结束中东战争", "title_en": "‘It’s time to come home’ – Pentagon chief wants to end wars in Middle East", "transed": 1, "url": "https://www.cnbc.com/2020/11/14/acting-pentagon-chief-says-wars-must-end-in-first-address.html", "via": "", "real_tags": ["五角大楼", "home", "美国"]}]