[{"category": "", "categoryclass": "", "imagename": "feac27f1bf65a9b73c1cab1aa31ba241.jpg", "infoid": 1015360, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "已验证美国的Google My Business Profile所有者现在可以将黑人拥有的业务属性添加到他们的列表中。\n当客户在移动端查看业务档案时，业务属性会突出显示为图标，如下图所示。\n谷歌表示，近几个月来，“对黑人所有企业的在线搜索激增”--在此期间，“黑人生命也是命”(Black Lives Matter)运动势头强劲。在本地搜索中区分黑人所有的企业可能有助于这些企业在搜索和地图中吸引知名度，并获得客户。\n谷歌美国创业公司负责人Jewel Burks在周四的声明中表示：“有了这个属性，我们的目标是让搜索和地图更具包容性，并在黑人拥有的企业最需要的时候帮助他们提供支持，”Google for Startups U.S.的负责人Jewel Burks在周四的声明中表示。\n谷歌还在其数字技能培训计划Growth With Digital Coach中增加了这一新属性，该计划旨在帮助黑人和Latinx小企业接触到新客户。\n此外，该公司表示，它正在与美国黑室公司(U.S.Black Chambers，Inc.)合作，以传播对这一新属性的认识。美国黑室公司是一个在全国拥有145个黑人商会和32.6万名会员的组织。\n周四，谷歌还宣布了面向黑人创始人的谷歌创业加速器(Google For Startups Accelerator For Black Founders)的首个班级。\n根据“纽约时报”(New York Times)报道的一项对政府数据的分析，4月份，超过40%的黑人企业主报告说，他们没有工作，相比之下，只有17%的白人小企业主报告说他们没有工作。", "note_en": "Verified  Google My Business profile owners in the U.S. can now add a Black-owned business attribute to their listings.\n Business attributes are highlighted as icons when customers view a business’ profile on mobile, as shown below.\n   Google said it has seen “a surge in online searches for Black-owned businesses” in recent months — a period in which the Black Lives Matter movement gained momentum. Distinguishing Black-owned businesses in local search may help those businesses attract visibility in Search and Maps and gain customers.\n “With this attribute, our goal is to make Search and Maps more inclusive and help support Black-owned businesses when they need it most,” Jewel Burks, head of Google for Startups U.S. said in Thursday’s  announcement.\n Google is also adding the new attribute to its digital skills training program  Grow with Digital Coaches, an initiative designed to help Black and Latinx small businesses reach new customers.\n  In addition, the company said it is partnering with the U.S. Black Chambers, Inc., an organization that includes 145 Black Chambers of Commerce and 326,000 members nationwide, to spread awareness for the new attribute.\n Google also announced the  inaugural class of the Google for Startups Accelerator for Black Founders on Thursday.\n In April, more than 40% of Black business owners reported that they weren’t working, compared to only 17% of white small business owners, according to an analysis of government data  reported on by  The New York Times.", "posttime": "2020-07-31 10:59:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,商业,谷歌,增加,adds", "title": "谷歌在当地房源中增加了“黑人所有”的商业属性", "title_en": "Google adds \"Black-owned\" business attribute to local listings", "transed": 1, "url": "https://searchengineland.com/google-adds-black-owned-business-attribute-to-local-listings-338526", "via": "", "real_tags": ["google", "商业", "谷歌", "增加", "adds"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015359, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载PDF摘要：在这篇文章中，我们探索了随机在金融市场中的具体作用，灵感来自于噪声在许多物理系统中的有益作用，以及在以前对复杂社会经济系统的应用中的有益作用。在简要介绍之后，我们研究了一些最常用的交易策略在预测不同国际证券交易所指数的金融市场动态方面的表现，目的是将它们与完全随机策略的表现进行比较。在这方面，FTSE-UK、FTSE-MIB、DAX和S&amp；P500指数的历史数据被考虑到大约15-20年的周期(从它们创建到今天)。\n出发地：Alessandro Pluchino[查看电子邮件][v1]Mon，18 Mar 2013 18：24：11 UTC(1,163 KB)[v2]Fri，2013 Jun 28 08：46：36 UTC(1,808 KB)[v3]Mon，2013 Jul 1 08：39：10 UTC(1,761KB)[v4]Sun，2013 Jul 14 09：37：00 UTC(1,761 KB)", "note_en": "Download PDF  Abstract: In this paper we explore the specific role of randomness in financialmarkets, inspired by the beneficial role of noise in many physical systems andin previous applications to complex socio- economic systems. After a shortintroduction, we study the performance of some of the most used tradingstrategies in predicting the dynamics of financial markets for differentinternational stock exchange indexes, with the goal of comparing them with theperformance of a completely random strategy. In this respect, historical datafor FTSE-UK, FTSE-MIB, DAX, and S&amp;P500 indexes are taken into account for aperiod of about 15-20 years (since their creation until today).\n  From: Alessandro Pluchino [ view email]     [v1] Mon, 18 Mar 2013 18:24:11 UTC (1,163 KB)    [v2] Fri, 28 Jun 2013 08:46:36 UTC (1,808 KB)    [v3] Mon, 1 Jul 2013 08:39:10 UTC (1,761 KB)  [v4]Sun, 14 Jul 2013 09:37:00 UTC (1,761 KB)", "posttime": "2020-07-31 10:59:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "交易,trading,表现", "title": "随机交易策略是否比技术性交易策略更成功？(2013)", "title_en": "Are random trading strategies more successful than technical ones? (2013)", "transed": 1, "url": "https://arxiv.org/abs/1303.4351", "via": "", "real_tags": ["交易", "trading", "表现"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015358, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每年秋天，我都会向一批新的博士生解释什么是博士生。\n更新：5年后，我写了一篇后续文章--“如何获得终身教职”(HOW TO：GET TERFORM)。", "note_en": "Every fall, I explain to a fresh batch of Ph.D. students what a Ph.D. is.\n      Update: I wrote a follow-up to this 5 years later --  HOWTO: Get tenure.", "posttime": "2020-07-31 10:58:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "图解,guide,文章", "title": "博士图解指南", "title_en": "The Illustrated Guide to a PhD", "transed": 1, "url": "http://matt.might.net/articles/phd-school-in-pictures/", "via": "", "real_tags": ["图解", "guide", "文章"]}, {"category": "", "categoryclass": "", "imagename": "a60d5efbc32f614dda6401acc2199a2d.jpg", "infoid": 1015357, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然我在这里的时间现在已经结束，但我想让你们知道，在我生命的最后几天和最后几个小时，是你们激励了我。当你用你的力量改变我们的社会时，你让我对伟大的美国故事的下一个篇章充满了希望。数百万人仅仅是被人类的同情心所激励，放下了分裂的负担。在全国和世界各地，你们把种族、阶级、年龄、语言和国籍放在一边，要求尊重人的尊严。\n这就是为什么我不得不参观华盛顿的黑人生命也是广场，尽管我第二天住进了医院。我只能亲眼看到，亲身感受到，经过多年的沉默见证，真相仍在继续前行。\n埃米特·蒂尔是我的乔治·弗洛伊德。他是我的雷沙德·布鲁克斯、桑德拉·布兰德和布雷娜·泰勒。他遇害时只有14岁，而我当时只有15岁。我永远不会忘记的那一刻，事情变得如此明显，他很容易就成了我。在那些日子里，恐惧就像一座想象中的监狱一样束缚着我们，而无缘无故犯下潜在暴行的令人不安的想法就是障碍。\n虽然我被两位慈爱的父母，还有许多兄弟姐妹和堂兄弟姐妹包围着，但他们的爱并不能保护我免受就在那个家庭圈子外等待的邪恶的压迫。不受控制的、肆无忌惮的暴力和政府批准的恐怖行为有能力将简单的漫步到商店品尝彩虹，或者在一条寂寞的乡间小路上进行一次无辜的早晨慢跑，变成了一场噩梦。如果我们要作为一个统一的国家生存下来，我们必须发现什么东西很容易在我们心中扎根，它可能会剥夺南卡罗来纳州伊曼纽尔教堂母亲最聪明和最好的东西，在拉斯维加斯枪杀无意中的音乐会观众，扼杀像伊莱贾·麦克莱恩这样有天赋的小提琴家的希望和梦想。\n就像今天的许多年轻人一样，我在寻找一条出路，或者有些人可能会说一条进去的路，然后我听到了小马丁·路德·金博士(Dr.Martin Luther King Jr.)的声音。在一台旧收音机上。他说的是非暴力的哲学和纪律。他说，当我们容忍不公正时，我们都是同谋。他说，仅仅说情况会逐渐好转是不够的。他说，我们每个人在道义上都有义务站出来，说出来，说出来。当你看到一些不对劲的事情时，你必须说点什么。你必须做点什么。民主不是一个国家。这是一种行为，每一代人都必须尽自己的一份力量，帮助建立我们所说的可爱的共同体，一个与自己和平相处的国家和世界社会。\n具有非凡远见的普通人可以通过陷入我所说的好麻烦，必要的麻烦来救赎美国的灵魂。投票和参与民主进程是关键。投票是民主社会中最有力的非暴力变革推动者。您必须使用它，因为它不能保证使用。你可以把它弄丢。\n你们还必须研究和吸取历史的教训，因为人类已经卷入这场令人痛苦的、事关生存的斗争很长一段时间了。在你们之前的几十年和几个世纪里，每个大洲的人们都站在你们的立场上。事实不会改变，这就是为什么很久以前得出的答案可以帮助你们找到应对我们时代挑战的解决方案。继续在全球各地的运动之间建立联盟，因为我们必须摒弃从剥削他人中获利的意愿。\n虽然我可能不在这里，但我敦促你响应你内心最高的呼唤，为你真正相信的东西挺身而出。在我的一生中，我已经尽我所能证明，和平之路、爱之路和非暴力之路是更好的方式。现在轮到你让自由之声响起。\n当历史学家拿起笔来书写21世纪的故事时，让他们说，是你们这一代人终于放下了仇恨的沉重包袱，和平终于战胜了暴力、侵略和战争。所以我对你们说，弟兄姊妹们，你们要随风而行，让和平的灵和永远爱的力量作你们的向导。\n7月17日去世的民权领袖和国会议员约翰·刘易斯(John Lewis)在去世前不久写了这篇文章。\n“泰晤士报”致力于向编辑发表各种信件。我们想听听您对这篇文章或我们的任何一篇文章的看法。这里有一些小贴士。这是我们的电子邮件：Letters@nytimes.com。", "note_en": "While my time here has now come to an end, I want you to know that in the last days and hours of my life you inspired me. You filled me with hope about the next chapter of the great American story when you used your power to make a difference in our society. Millions of people motivated simply by human compassion laid down the burdens of division. Around the country and the world you set aside race, class, age, language and nationality to demand respect for human dignity.\n That is why I had to visit Black Lives Matter Plaza in Washington, though I was admitted to the hospital the following day. I just had to see and feel it for myself that, after many years of silent witness, the truth is still marching on.\n Emmett Till was my George Floyd. He was my Rayshard Brooks, Sandra Bland and Breonna Taylor. He was 14 when he was killed, and I was only 15 years old at the time. I will never ever forget the moment when it became so clear that he could easily have been me. In those days, fear constrained us like an imaginary prison, and troubling thoughts of potential brutality committed for no understandable reason were the bars.\n  Though I was surrounded by two loving parents, plenty of brothers, sisters and cousins, their love could not protect me from the unholy oppression waiting just outside that family circle. Unchecked, unrestrained violence and government-sanctioned terror had the power to turn a simple stroll to the store for some Skittles or an innocent morning jog down a lonesome country road into a nightmare. If we are to survive as one unified nation, we must discover what so readily takes root in our hearts that could rob Mother Emanuel Church in South Carolina of her brightest and best, shoot unwitting concertgoers in Las Vegas and choke to death the hopes and dreams of a gifted violinist like Elijah McClain.\n Like so many young people today, I was searching for a way out, or some might say a way in, and then I heard the voice of Dr. Martin Luther King Jr. on an old radio. He was talking about the philosophy and discipline of nonviolence. He said we are all complicit when we tolerate injustice. He said it is not enough to say it will get better by and by. He said each of us has a moral obligation to stand up, speak up and speak out. When you see something that is not right, you must say something. You must do something. Democracy is not a state. It is an act, and each generation must do its part to help build what we called the Beloved Community, a nation and world society at peace with itself.\n Ordinary people with extraordinary vision can redeem the soul of America by getting in what I call good trouble, necessary trouble. Voting and participating in the democratic process are key. The vote is the most powerful nonviolent change agent you have in a democratic society. You must use it because it is not guaranteed. You can lose it.\n You must also study and learn the lessons of history because humanity has been involved in this soul-wrenching, existential struggle for a very long time. People on every continent have stood in your shoes, through decades and centuries before you. The truth does not change, and that is why the answers worked out long ago can help you find solutions to the challenges of our time. Continue to build union between movements stretching across the globe because we must put away our willingness to profit from the exploitation of others.\n Though I may not be here with you, I urge you to answer the highest calling of your heart and stand up for what you truly believe. In my life I have done all I can to demonstrate that the way of peace, the way of love and nonviolence is the more excellent way. Now it is your turn to let freedom ring.\n When historians pick up their pens to write the story of the 21st century, let them say that it was your generation who laid down the heavy burdens of hate at last and that peace finally triumphed over violence, aggression and war. So I say to you, walk with the wind, brothers and sisters, and let the spirit of peace and the power of everlasting love be your guide.\n  John Lewis, the civil rights leader and congressman who died on July 17, wrote this essay shortly before his death.\n  The Times is committed to publishing   a diversity of letters  to the editor. We’d like to hear what you think about this or any of our articles. Here are some   tips . And here’s our email:   letters@nytimes.com .", "posttime": "2020-07-31 10:58:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "齐心协力,lewis,非暴力", "title": "约翰·刘易斯：齐心协力，你们可以救赎我们国家的灵魂", "title_en": "John Lewis: Together, You Can Redeem the Soul of Our Nation", "transed": 1, "url": "https://www.nytimes.com/2020/07/30/opinion/john-lewis-civil-rights-america.html", "via": "", "real_tags": ["齐心协力", "lewis", "非暴力"]}, {"category": "", "categoryclass": "", "imagename": "fd51313e372b38bd5e0e2a433176d6ba.jpg", "infoid": 1015356, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当用户今晚在地址栏中键入内容时，微软新的Edge浏览器会随机崩溃。这些问题似乎正在影响选择谷歌作为默认搜索引擎的Edge用户。微软表示已经意识到这些问题，公司的Edge团队正在进行调查。\nMicrosoft建议关闭edge：//settings/search中的搜索建议。Verge已经测试了这个变通方法，如果您将Google设置为您的默认搜索引擎，它可以解决这个问题。\n当您尝试在地址栏中键入内容时，是否看到Edge Crash？团队正在调查这件事！同时，作为一种解决办法，请关闭此处的搜索建议：edge：//settings/search。一旦我们有了更多的信息，我们就会跟进！\n-Microsoft Edge Dev(@MSEdgeDev)2020年7月30日。\nMicrosoft Edge崩溃开始于美国东部时间晚上7点左右，影响到了MacOS和Windows用户。不过，目前还不清楚为什么他们只限于Edge中的谷歌搜索用户。如果您在Edge中切换到Microsoft的必应搜索引擎，则不会发生崩溃。\n我们已联系Microsoft以获取有关问题的更多信息，我们会相应地向您提供最新消息。", "note_en": "Microsoft’s new Edge browser is randomly crashing when users type into the address bar tonight. The issues appear to be affecting Edge users who have selected Google as the default search engine. Microsoft says it’s aware of the problems and the company’s Edge team is investigating.\n Microsoft recommends turning off Search Suggestions in edge://settings/search.  The Verge has tested this workaround and it solves the problem if you have Google set as your default search engine.\n Are you seeing Edge crash when trying to type into the address bar? The team is looking into it! In the meantime, as a workaround, please turn off Search Suggestions here: edge://settings/search. We&#39;ll follow up once we have more!\n— Microsoft Edge Dev (@MSEdgeDev)  July 30, 2020\n The Microsoft Edge crashes started at around 7PM ET, and are affecting macOS and Windows users. It’s not clear why they’re only limited to Google search users in Edge, though. If you switch to Microsoft’s Bing search engine within Edge, the crashes do not occur.\n We’ve reached out to Microsoft for more information on the problems, and we’ll update you accordingly.", "posttime": "2020-07-31 10:58:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,microsoft,设置,edge", "title": "如果您将Google设置为默认搜索，Microsoft的Edge浏览器将崩溃", "title_en": "Microsoft’s Edge browser is crashing if you have Google set as default search", "transed": 1, "url": "https://www.theverge.com/2020/7/30/21348923/microsoft-edge-crash-address-bar-google-search-browser-issues", "via": "", "real_tags": ["google", "microsoft", "设置", "edge"]}, {"category": "", "categoryclass": "", "imagename": "cb5227db2c7f575dcbaa87eef1e99e73.jpg", "infoid": 1015355, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据报道，一架直升机在新南威尔士州里维里纳与电线相撞后坠毁，紧急救援人员正在对此做出反应。\n联合国人权办公室向美国当局发出严厉警告，不要对参与全国各地反系统性种族主义抗议的抗议者和记者使用不成比例的武力。\n联合国人权办公室表达了对官员为了匿名行动而模糊他们的徽章号码的担忧。\n世界各地的警察因对基本上和平的抗议活动过度使用武力而受到尖锐批评。\n在警察对抗议者使用武力时隐藏徽章号码的图像浮出水面后，联合国呼吁当局特别确保联邦和地方警察的身份是清晰可辨的。\n联合国人权发言人利兹·索塞尔(Liz Throssell)表示，有报道称，和平抗议者被身份不明的警察拘留。\n这是一个令人担忧的问题，因为它可能会将被拘留的人置于法律保护之外，并可能导致任意拘留和其他侵犯人权的行为。\n在手无寸铁的黑人乔治·弗洛伊德(George Floyd)被明尼阿波利斯警方谋杀后，黑人生命也是命中注定的运动在5月份重新点燃，世界各地举行了反对系统性种族主义的抗议活动。警方使用防暴驱散技术驱散了基本上和平的抗议活动，包括澳大利亚的抗议活动。\n俄勒冈州波特兰市已经成为抗议者和当局之间爆发冲突的导火索，以至于一名联邦法官发布了针对联邦执法部门的临时限制令，禁止他们对波特兰的记者和法律观察员使用武力。\n特朗普政府违背地方官员的意愿部署的军事化联邦当局，对一直以波特兰法院为目标的抗议者使用了催泪瓦斯、杀伤力较低的弹药和其他武力。\n根据这项法律，联邦政府有权保护联邦建筑和财产，尽管一些分析人士认为这是特朗普打击法律和秩序的竞选战略的标志。\n周三晚上，市长泰德·惠勒(Ted Wheeler)是被警方催泪瓦斯袭击的人之一。他称这是滥用联邦权力导致暴力升级。\n还代表联邦特工用非致命性冲击性弹药袭击的记者提起诉讼。\n芝加哥警方也被指控过度使用武力，因为他们使用警棍对付向警察投掷冷冻水瓶、烟花和其他投射物的示威者。\n芝加哥抗议活动的目标是克里斯托弗·哥伦布(Christopher Columbus)的雕像，这座雕像于周五上午正式从格兰特公园(Grant Park)的基座上移走。\n在“黑人生命也是命”抗议者与警察支持者发生冲突后，丹佛也爆发了暴力事件。\n警方表示，他们使用胡椒球和胡椒喷雾来驱散规模更大的黑人生命也是小分队。", "note_en": "Emergency crews are responding to reports a helicopter has crashed in the New South Wales Riverina after colliding with powerlines.\n The United Nations human rights office has issued a stark warning to authorities in the US against using disproportional force against protesters and journalists involved in anti-systemic racism protests across the country.\n The UN human rights office voiced concerns about officers obscuring their badge numbers in order to act with anonymity\n Police across the world have faced sharp criticism for using excessive force against the largely peaceful protests\n The UN called on authorities to specifically ensure federal and local police were clearly identifiable, after images emerged of officers hiding their badge numbers when using force against protesters.\n &#34;There have been reports that peaceful protesters have been detained by unidentified police officers,&#34; said Liz Throssell, UN human rights spokesperson.\n &#34;That is a worry because it may place those detained outside the protection of the law and may give rise to arbitrary detention and other human rights violations.&#34;\n  The Black Lives Matter movement, rekindled in May after the murder of unarmed black man George Floyd by Minneapolis police, saw protests against systemic racism held across the world. Police used riot dispersion techniques to disperse the largely peaceful protests, including in Australia.\n  The city of Portland, Oregon has become a flashpoint for flare-ups between protesters and authorities, so much so that a federal judge has issued a temporary restraining order against federal law enforcement, barring them from using force against journalists and legal observers in Portland.\n The militarised federal authorities,  deployed by the Trump administration against the wishes of local officials, have used tear gas, less-lethal ammunition and other force against protesters who have been targeting the Portland courthouse with vandalism.\n  Under the law, the Federal Government has the authority to protect federal buildings and property, though some analysts see it as a mark of Mr Trump&#39;s campaign strategy of cracking down on law and order.\n On Wednesday night, Mayor Ted Wheeler was among those tear-gassed by police. He called it an abuse of federal power that was escalating the violence.\n   A lawsuit has also been filed on behalf of journalists whom federal agents had hit with non-lethal &#34;impact munitions.&#34;\n Police in Chicago have also been accused of excessive force after using their batons against demonstrators who threw frozen water bottles, fireworks and other projectiles at officers.\n The Chicago protests targeted the statue of Christopher Columbus, which was officially removed from its pedestal in Grant Park on Friday morning.\n Violence also erupted in Denver after Black Lives Matter protesters clashed with supporters of police.\n Police said they used pepper balls and pepper spray to disperse the larger Black Lives Matter contingent.", "posttime": "2020-07-31 10:58:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,warning,联邦", "title": "联合国向美国当局发出警告，要求其下台打击暴徒", "title_en": "UN issues warning to US authorities to stand down against rioters", "transed": 1, "url": "https://www.abc.net.au/news/2020-07-24/un-issues-warning-to-us-authorities-over-black-lives-matter/12491624", "via": "", "real_tags": ["美国", "warning", "联邦"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015354, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年9月28日之后，所有渠道的社区捐款都将停止。社区贡献允许观众为视频添加闭路字幕、字幕和标题/描述。这个功能很少使用，而且在垃圾邮件/滥用方面有问题，所以我们将它们删除以专注于其他创建者工具。您仍然可以使用自己的字幕、自动字幕以及第三方工具和服务。您必须在2020年9月28日之前发布您的社区投稿，然后再将其删除。\n您的观众社区可以通过为您的视频添加标题、描述、字幕和隐藏字幕来帮助您吸引更多的观众。一旦您为视频添加了相同语言的字幕，您的社区就可以提交翻译来帮助您接触到全球观众。\n提交内容后，您可以通过审阅、编辑、发布、标记或拒绝对其进行管理。你的社区也可以审查内容，当它获得足够的评论时，它会自动发布。\n在您的社区可以提交标题、描述、隐藏字幕或字幕之前，您需要打开社区投稿。您可以打开选定视频的社区投稿，或将其设置为您频道上所有视频的默认设置。您可以了解粉丝如何投稿，并为您的视频审阅此内容。\n注意：如果您打开了社区标题，则必须在发布之前手动审阅它们。\n为所有视频启用投稿按照以下步骤为所有视频启用社区投稿。请注意，此更改将重置应用于单个视频的所有设置。\n打开或关闭特定视频选中“社区投稿”复选框，然后在此视频的“打开”和“此视频的关闭”之间进行选择。\n打开或关闭一组选定的视频选择是打开还是关闭，然后选择更新视频。\n“一旦你打开了社区投稿，一定要让你的观众知道他们可以帮助你审阅和翻译视频。\n一旦提交了抄本或翻译，内容就会经过审查过程。YouTube审核这些垃圾和不恰当内容的提交，同时从您和您的社区获取意见。\n一旦添加了足够的投稿，社区将被要求帮助审核。审核后，您可以将投稿发布到您的视频上。\n在发布之前，请务必仔细检查、编辑、标记或拒绝内容。您还可以编辑或删除已发布的内容。\n若要查看正在进行的提交，请单击“字幕”栏下语言的“正在审核”。\n编辑提交：单击文本并进行任何更正。当您在您编辑的标题之外单击时，更改将自动保存。*选择发布以批准。\n要求社区进行改进：在页面顶部，选择“需要更多工作”。\n删除或编辑已发布的内容要查看已发布的内容，请单击“字幕”列下面的语言的“已发布”。\n编辑提交：*单击文本并进行任何更正。当您在您编辑的标题之外单击时，更改将自动保存。选择发布以进行审批。\n删除标题和描述的提交：我会在您的视频管理器中找到您的视频。选择编辑翻译的信息和设置，然后选择相关语言旁边的删除(&A)。\n小贴士：如果翻译的语言是你不知道的，请在谷歌翻译上查一查。这会将翻译后添加的社区翻译回原始语言。\n当您允许社区投稿出现在您的YouTube频道或视频上时，我们会自动发布视频描述中排名靠前的投稿人。只有拥有YouTube频道且未选择退出积分的投稿人才能获得积分。\n显示了每种语言的5个主要贡献者，按他们对出版版本的贡献排序。\n您还可以在他们添加到的版本旁边的副标题&amp；抄送选项卡下看到投稿人列表。\n注意：在将社区投稿发布到您的视频之前，一定要检查它们的质量。了解如何管理社区投稿中的垃圾邮件。", "note_en": "Community contributions will be discontinued across all channels after September 28, 2020. Community contributions allowed viewers to add closed captions, subtitles, and title/descriptions to videos. This feature was rarely used and had problems with spam/abuse so we’re removing them to focus on other creator tools. You can still use  your own captions,  automatic captions, and  third-party tools and services. You have until September 28, 2020 to publish your community contributions before they’re removed.\n Your community of viewers can help you reach a larger audience by adding title, description, subtitles, and closed captions to your videos. Once you have same language captions for a video, your community can submit translations to help you reach a global audience.\n When content is submitted, you can manage it by reviewing, editing, publishing, flagging, or rejecting it. Your community can also review the content, and it will automatically be published when it gets enough reviews.\n   Before your community can submit titles, descriptions, closed captions, or subtitles, you need to turn on community contributions. You can turn on community contributions for selected videos or make it the default setting for all videos on your channel.  Learn how fans contribute and review this content for your videos.\n Note: If you have community captions turned on, you’ll have to manually review them before they’re published.\n Turn on contributions for all videos  Follow these steps to turn on community contributions for all videos. Note that this change will reset any settings applied to individual videos.\n Turn on or off for a specific video  Select the  Community Contributions box and choose between  On for this video and  Off for this video.\n Turn on or off for a group of selected videos  Choose whether you’d like them to be  On or  Off, then select  Update videos.\n  Once you&#39;ve turned on community contributions, make sure to  let your viewers know that they can help with reviewing and translating videos.\n  Once transcriptions or translations are submitted, the content goes through a review process. YouTube moderates these submissions for spam and inappropriate content, while getting input from you and your community.\n Once enough contributions are added, the community will be asked to help review them. After review, you can publish contributions to show on your videos.\n Be sure to carefully review, edit, flag, or reject content before publishing. You can also edit or delete content that&#39;s been published.\n  To see submissions in progress, click “In Review” for a language beneath the “Subtitles” column.\n  Edit submission: Click on the text and make any corrections. Changes will be saved automatically when you click outside of the caption you edited. Select  Publish to approve.\n    Ask the community to make improvements: At the top of the page, select  Needs more work.\n  Remove or edit published content To see published content, click “Published” for a language beneath the “Subtitles” column.\n  Edit submissions:  Click on the text and make any corrections. Changes will be saved automatically when you click outside of the caption you edited. Select  Publish to approve.\n    Delete submissions for title and description: Find your video in your Video Manager. Select  Edit     Info &amp; settings    Translations and select Delete   next to the language in question.\n Tip: If the translations are in a language that you don&#39;t know, check the Google Translation. This translates the community added translation back to the original language.\n  When you allow community contributions on your channel or video(s), we automatically publish the top contributors in the video&#39;s description. Contributors can only get credit if they have a YouTube channel and haven&#39;t already opted out of credits.\n The main 5 contributors per language are shown, ranked by their contribution to the published version.\n You can also see the list of contributors under the  Subtitles &amp; CC tab next to the version they added to.\n  Note: Be sure to check the quality of community contributions before they’re published on your video. Learn how to  manage spam on community contributions.", "posttime": "2020-07-31 10:57:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,youtube,removing,社区", "title": "谷歌正在从YouTube上删除社区贡献", "title_en": "Google is removing community contributions from YouTube", "transed": 1, "url": "https://support.google.com/youtube/answer/6052538", "via": "", "real_tags": ["google", "谷歌", "youtube", "removing", "社区"]}, {"category": "", "categoryclass": "", "imagename": "f4ad75ae995142eaf5b33166d88a0d0b.jpg", "infoid": 1015353, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周四晚上，众议院投票否决了纽约州众议员亚历山德里亚·奥卡西奥-科尔特斯(D-NY)提出的一项修正案，该修正案将禁止美军在Twitch上招募新兵。如果获得通过，这将是对众议院拨款委员会法案的修正案，这是五角大楼年度预算制定过程的一部分。\n现在的投票结果是45票赞成，105票反对。大多数人不赞成@AOC的法案。美国海军和陆军表示，他们将继续在Twitch上流媒体，并拒绝对即将出台的立法发表评论。\n--廖香农(@Shannon_Liao)2020年7月30日。\n想象一下，试图向身为国会议员的同事解释什么是Twitch。\n-亚历山德里亚·奥卡西奥-科尔特斯(@AOC)2020年7月30日。\n周四投票前，奥卡西奥-科尔特斯在众议院发表了慷慨激昂的演讲。奥卡西奥-科尔特斯说：“除了服兵役之外，儿童一般不应该成为许多营销目的的目标。”“现在，目前，像Twitch这样的平台上的儿童被横幅广告轰炸，横幅广告链接到招募登记表，这些表格可以由年仅12岁的儿童提交。这些不是军方的教育外展项目。“。\n美国军方在使用流媒体渠道和视频游戏招募人员方面并不陌生。自2018年以来，陆军的几个军种-除了海军陆战队-一直有体育团队。根据Military.com的数据，仅陆军的ESPORTS努力就在2019年产生了3500个招聘线索。\n上周，在Twitch频道因禁止询问战争罪的观众而受到批评后，陆军暂停了对Twitch的招募。军方告诉GameSpot：“团队已经暂停了流媒体，以审查内部政策和程序，以及所有平台特定的政策，以确保在恢复流媒体之前，参与该空间的人是清楚的。”\n本月早些时候，Twitch告诉陆军停止在其频道上分享虚假的奖品，这些奖品承诺使用Xbox Elite Series 2控制器，结果用户点击时会被引导到招聘页面。\n奥卡西奥-科尔特斯草案的语言将使这一暂停成为永久性的，禁止美国军事组织使用资金“在Twitch.com或任何视频游戏、电子竞技或直播平台上保持存在”。\n更新7月30日，美国东部时间下午7：19：做出了改变，以反映修正案未能通过众议院的投票。", "note_en": "An amendment proposed by Rep. Alexandria Ocasio-Cortez (D-NY) that would ban the US military from recruiting on Twitch failed a House vote Thursday evening. Had it passed, it would have been  an amendment to the House Committee on Appropriations bill, which is part of the process in how the Pentagon’s annual budget is set.\n The vote is now at 45 yeas to 105 nays. Majority is not in favor of  @AOC&#39;s bill. The US Navy and Army have stated they will continue to stream on Twitch and declined to comment on pending legislation.\n— Shannon Liao (@Shannon_Liao)  July 30, 2020\n  Imagine trying to explain to your colleagues who are members of Congress what Twitch is\n— Alexandria Ocasio-Cortez (@AOC)  July 30, 2020\n Ocasio-Cortez gave an impassioned speech on the House floor in advance of the vote on Thursday. “Children should not be targeted in general for many marketing purposes in addition to military service,” Ocasio-Cortez said. “Right now, currently, children on platforms such as Twitch are bombarded with banner ads linked to recruitment signup forms that can be submitted by children as young as 12 years old. These are not education outreach programs for the military.”\n  The US military isn’t new to using streaming channels and video gaming to recruit people. Several branches of the military — with the exception of the Marines — have had esports  teams since 2018. And according to  Military.com, the Army’s esports efforts alone generated 3,500 recruiting leads in fiscal year 2019.\n Last week, the Army  paused its use of Twitch for recruitment after its channel was criticized for banning viewers who asked about war crimes. The Army told   GameSpot: “The team has paused streaming to review internal policies and procedures, as well as all platform-specific policies, to ensure those participating in the space are clear before streaming resumes.”\n And earlier this month,  Twitch told the Army to stop sharing phony prize giveaways on its channel that promised an Xbox Elite Series 2 controller, only for users to be directed to a recruitment page when they clicked through.\n The language of Ocasio-Cortez’s draft would have made that pause permanent, banning US military organizations from using funds to “maintain a presence on Twitch.com or any video game, e-sports, or live-streaming platform.”\n Update July 30th, 7:19PM ET : Made changes to reflect that the amendment failed a House vote.", "posttime": "2020-07-31 10:17:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "应该,recruiting,twitch", "title": "美军应该在Twitch上征兵吗？", "title_en": "Should the US Military Be Recruiting On Twitch?", "transed": 1, "url": "https://www.theverge.com/2020/7/30/21348451/military-recruiting-twitch-ban-block-amendment-ocasio-cortez", "via": "", "real_tags": ["应该", "twitch"]}, {"category": "", "categoryclass": "", "imagename": "db21741bc2fc38cccea183f12c778cce.jpg", "infoid": 1015352, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Twitter在周四晚间发布的一篇博客文章和一系列推文中，提供了有关7月15日史无前例的攻击的最新消息，那次攻击允许黑客从该服务上一些最引人注目的账户发布推文。Twitter现在表示，几名员工成为了一次电话鱼叉式网络钓鱼攻击的目标。虽然Twitter没有明确表示，但这可能意味着黑客冒充Twitter的同事或自己的安全团队成员给Twitter员工打电话，让他们透露他们用来访问内部系统的凭据。\nTwitter之前曾表示，它自己的工具在这次攻击中受到了攻击，但直到现在，该公司还没有具体说明这是如何发生的。Twitter在其支持账户的一条推文中表示：“这次攻击依赖于一次重大的、协同的尝试，目的是误导某些员工，并利用人类的漏洞进入我们的内部系统，”Twitter在其支持账户上发布的一条推文中表示。\n通过获得员工凭证，他们能够锁定有权访问我们的帐户支持工具的特定员工。然后，他们瞄准了130个Twitter账户-从45个账户开始发推文，访问36个DM收件箱，下载7个Twitter数据。\n-Twitter支持(@TwitterSupport)2020年7月31日。\nTwitter还重申，攻击者的目标是130个账户，推文从45个减少到36个，但将他们的Twitter数据下载(也包括直接信息)的账户数量从“最多8个”减少到了7个。\nTwitter在攻击发生后立即限制了一些用户的功能，并锁定了他们的账户。Twitter在其博客文章中表示，虽然许多功能已经恢复，但“一些功能(即访问您的Twitter数据下载功能)和流程受到了影响。”该公司还表示，目前对其内部工具的访问“明显受到限制”，并正在“改进我们的方法，以检测和防止对我们内部系统的不当访问。”\n我们正在加速几个先前存在的安全工作流，并改进我们的工具。我们还在改进我们的方法，以检测和防止对我们内部系统的不当访问，并对我们许多团队的安全工作进行优先排序。\n-Twitter支持(@TwitterSupport)2020年7月31日。\n在攻击期间，黑客从奥巴马总统、民主党总统候选人乔·拜登、特斯拉和SpaceX首席执行官埃隆·马斯克、微软联合创始人比尔·盖茨等人的推特账户上发布了比特币骗局。联邦调查局已经对这起袭击事件展开调查。", "note_en": "Twitter provided an update about the unprecedented July 15th attack that allowed hackers to tweet from some of the most high-profile accounts on the service, in  a blog post and  a series of tweets published Thursday evening. Twitter now says that a few employees were targeted in a phone spear phishing attack. While Twitter doesn’t quite say, that presumably means hackers called up Twitter employees while posing as colleagues or members of Twitter’s own security team, and got them to reveal the credentials they use to access internal systems.\n Twitter had previously said its  own tools were compromised in the attack, but up until this point, the company hadn’t specified how that had happened. “This attack relied on a significant and concerted attempt to mislead certain employees and exploit human vulnerabilities to gain access to our internal systems,” Twitter said  in a tweet from its support account.\n By obtaining employee credentials, they were able to target specific employees who had access to our account support tools. They then targeted 130 Twitter accounts - Tweeting from 45, accessing the DM inbox of 36, and downloading the Twitter Data of 7.\n— Twitter Support (@TwitterSupport)  July 31, 2020\n Twitter also reiterated that the attackers targeted 130 accounts, tweeted from 45, and accessed the direct messages of 36, but lowered the number of accounts that had their Twitter data downloaded (which would have also included direct messages)  from “up to 8” to 7.\n Twitter limited features and  locked accounts for some users in the immediate aftermath of the attack. While many features have come back, “some features (namely, accessing the  Your Twitter Data download feature) and processes have been impacted,” Twitter said in its blog post. The company  also said it has “significantly limited” access to its internal tools for the moment  and is “improving our methods for detecting and preventing inappropriate access to our internal systems.”\n We’re accelerating several of our pre-existing security workstreams and improvements to our tools. We are also improving our methods for detecting and preventing inappropriate access to our internal systems and prioritizing security work across many of our teams.\n— Twitter Support (@TwitterSupport)  July 31, 2020\n During the attack, hackers tweeted a bitcoin scam from the Twitter accounts of President Barack Obama, Democratic presidential candidate Joe Biden, Tesla and SpaceX CEO Elon Musk, Microsoft co-founder Bill Gates, and more. The FBI  has launched an investigation into the attack.", "posttime": "2020-07-31 10:10:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,访问,twitter", "title": "在7月15日黑客攻击的最新版本中，Twitter表示，几名员工成为电话鱼叉式网络钓鱼攻击的目标，自那以来，该公司对内部工具的访问权限有限", "title_en": "In an update to the July 15 hack, Twitter says a few employees were targeted in a phone spear phishing attack, and it had since limited access to internal tools", "transed": 1, "url": "https://www.theverge.com/2020/7/30/21348974/twitter-spear-phishing-attack-bitcoin-scam?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["黑客", "访问", "twitter"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015350, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正如我在上一篇文章中提到的，我一直在对C128中的PLA芯片进行逆向工程，现在我已经基本完成了这个过程，所以我认为是时候分享一些发现了。\n这是一个非常有趣的项目，因为我对半导体设计和制造了解不多。我现有的知识延伸到看过一些死亡镜头，欣赏过那些漂亮的照片。\n这一切都是从我买了一台便宜的显微镜来帮助焊接表面贴装元件开始的。\n一段时间后，我最终在YouTube上观看了一段视频，视频显示了一种从包装中取出硅片的更简单的方法。\n这看起来很简单，可以在家里试一试，因为我已经有了所有需要的设备。拆解集成电路通常涉及加热的硫酸或其他类似的令人讨厌的化学物质，我真的不想在家里玩这些东西。因此，我挖出了几个散落在各处的MOS芯片(不要扔掉东西，可能会派上用场)。在摆弄了一会儿之后，我最终得到了两个8521R0骰子和一个8721PLA。第一张真正的照片是上一篇帖子中显示的那张。\n虽然这是成功的，但我很快意识到，这台显微镜没有足够的分辨率让我能够捕捉到足够高质量的图像。使用2倍Barlow镜头时，最大放大倍数为90倍。此外，它没有舞台，所以我不得不把碟子放在桌子上，然后移动整个显微镜，这非常不稳定，很难捕捉到你想要看到的部分。\n事实证明，这款相机在拍摄质量不错的照片方面要好得多，但我对用它买的相机并不满意。这是一款便宜的相机，除了使用AmScope应用程序外，我无法远程管理它。大约在这个时候，Raspberry Pi基金会发布了用于Raspberry Pi的新款高品质相机。这台相机上有一个与显微镜相配的C型支架，所以我很快就把它放到了显微镜上。这款相机非常适合这项工作，可以在舒适的Linux上完全控制整个过程。\n总而言之，这是对以前设置的巨大改进。有了更高的分辨率，我开始需要把照片缝合在一起来制作更大的照片。这在开始时听起来很简单，但最终(正如您可能猜到的那样)并不是很容易。我还在努力缝合，但慢慢好起来了。一个成功的全景拼接的关键之一是在平移、对焦、白平衡等方面拥有一致的照片。照片越均匀，拼接就越容易、越好。\n这使我开始致力于电动化这张桌子。不得不手动移动桌子真的很烦人，照片最终要在多个轴上移动，等等。\n大量的设计工作，3D打印和对CNC固件的研究之后，我最终完成了以下设置：\n从顶部开始，我们有一个7英寸的Raspberry显示屏，背面安装了一个Raspberry pi4。没有看到的还有安装在显微镜上的RPI HiQ相机。RPI拍摄照片，在显示器上显示预览，还运行控制CNC板的python代码。\n工作台和调平工作台由28BYJ-48步进电机驱动，使用一个运行Grbl_Esp32的ESP32和四个AD4498步进电机控制器的小电路板进行控制。\n整个设置在软件和硬件上都有一些问题，但现在它工作得足够好，可以让我做一些工作。\n物流现在已经理顺了，我又回到了芯片本身的逆向工程工作上。我最初的关注点是PLA Chipas，这应该是最简单的解决方案之一。PLA代表可编程逻辑阵列，是这个时代设计中非常常见的结构。\n看一下维基百科的示意图，我们应该会看到两个主要的数组，AND和OR。输入连接到OR阵列的AND AND输出。\n返回到上一次的冲模，可以通过对管脚和芯片的一般区域进行一些注释来改进它。一旦我们建立了引脚，我们就可以看到所有的输入都连接到一个阵列，所有的输出都连接到另一个阵列，正如预期的那样。这也有助于我们确定哪个阵列是哪个阵列。\n在这里，我们看到I/O引脚标有它们如何连接到引线框架和DIP本身上的引脚。我们还可以看到组成PLA结构的两个主要区域，AND数组和OR数组。此外，底部还有一些用问号标记的额外逻辑。我不知道它的功能，但由于所有的输出引脚都通过它，我猜测这是某种类型的输出阶段。\n因此，如果我们仔细研究一下和矩阵，我们将看到以下内容。颜色有点不对劲，因为这仍然是用AmScope相机完成的，我不知道如何在上面设置白平衡。\n这对理解发生了什么没有太大帮助，因为所有有趣的部分都被最上面的金属层掩盖了。这是在我还在学习很多东西的早期，所以为了移除金属，我采取了一种非常暴力的方法。我使用重型机械擦洗来去除金属，我也了解到，一旦我把它放回显微镜里，它已经除去了除了衬底本身之外的所有东西。哎呀。\n仔细观察这张图像，我们可以看到晶体管所在的小弯曲线，以在矩阵中创建连接。\n继续看OR数组，我们会看到完全相同的模式。金属层就位很难辨别，尽管与AND矩阵相比更容易。只剩下衬底和扩散就容易多了。\n有了这些知识，我们现在可以继续从图像中提取完整的PLA逻辑矩阵。\n我用一个点标记了每个矩阵中的所有晶体管，得到了下面的图片：\n所有输入在AND矩阵中都是水平的，每行都有一个正常信号和一个反相信号被馈入。所有输出在OR矩阵中都是水平的，它们由称为乘积项的垂直线连接。\n例如，通过查看点，我们可以通过对AND矩阵中的所有垂直线执行逻辑AND来解码乘积项。\nP0=Charen&amp；Hiram&amp；BA&amp；！MS3&amp；游戏&amp；RW&amp；AEC&amp；A12&amp；！A13&amp；A14&amp；A15。\n例如，对于输出，我们改为水平查看每个输出，并与或组合。\n回过头来看完整的芯片图片，现在除了输出路径中标有问号的盒子之外，我们已经拥有了所有东西。\n看一看这个的高分辨率照片，我们可以看到每个输出都有相似的结构。除两种情况外，所有情况下都绕过结构，OR矩阵的输出直接进入输出引脚。但是，两个端号DWE和CASENB并非如此。\nDWE是去往主系统DRAM芯片的写使能信号，CASENB将CAS信号选通到RAM。这两个信号是使用这些输出门结构以某种形式进行处理的，所以我必须对这个模块进行反向工程。\n在阅读了相当长一段时间的硅芯片设计和制造以及多次尝试之后，我终于想出了一个有意义的原理图。我不打算在这里讨论整个过程，但我会在稍后记录并发布它。在这里，我也要感谢弗兰克·沃尔夫的帮助，如果可以的话，请支持他的项目！\n更进一步说，它在DWE和CASENB输出中的使用方式使其成为普通的D锁存器。对于OR矩阵中的一对行中的PLA矩阵，也会出现对此的锁存启用。\n因此，作为最终结果，我们现在可以写下C128PLA芯片的完整HDL代码。为此，我使用verilog。请注意，这是我写过的第一个verilog，所以它可能是次优的。在verilog中使用D锁存器输出通常被认为是一件坏事，但在这种情况下，我这样做是为了复制现有芯片的逻辑和功能。\n据我所知，我已经证实了这一点，但如果我遗漏了什么，请让我知道！\n与C64PLA不同的是，由于输出锁存器的存在，C128PLA不能仅用EPROM或类似的器件代替。\n模块pla_8721(输入rom_256，输入va14，输入charen，输入hiram，输入loam，输入ba，输入vma5，输入vma4，输入ms0，输入ms1，输入ms2，输入ms3，输入z80io，输入z80en，输入exrom，输入游戏，输入rw，输入aec，输入dmaack，输入vicfix，输入a10，输入a11，输入a12，输入a13，输入a14，输入a15，输入。OUTPUT FROM、OUTPUT ROM4、OUTPUT ROM3、OUTPUT ROM2、OUTPUT ROM1、OUTPUT IOCS、OUTPUT DIR、OUTPUT REG DWE、OUTPUT REG CASENB、OUTPUT VIC、OUTPUT IOACC、OU。导线p0；导线p1；导线p2；导线p3；导线p4；导线p5；导线p6；导线p7；导线p8；导线p9；导线p10；导线p11；导线p12；导线p13；导线p14；导线p15；导线p16；导线p17；导线p18；导线p19；导线p20；导线p21；导线p22；导线p23；导线p24；导线p25；导线p26；导线p27；导线p28；导线p29；线p44；线p45；线p46；线p47；线p48；线p49；线p50；线p51；线p52；线p53；线p54；线p55；线p56；线p57；线p58；线p59；线p60；线p61；线p62；线p63；线p64；线p65；线p66；线p67；线p68；线p69；线p70；线p71；线p72；线p73；线。Wire p88；wire p89；wire casenb_int；/*产品条款*/Assign P0=Charen&amp；Hiram&amp；ba&amp；！MS3&amp；Game&amp；RW&amp；A12&amp；！A13&amp；A14&amp；a15；Assign p1=Charen&amp；Hiram&amp；！MS3&amp；Game&amp；！RW&amp；AEC&amp；！A14&amp；a15；分配p2=Charen&amp；Loram&amp；ba&amp；！MS3&amp；游戏&amp；rw&amp；AEC&amp；a12&amp；！a13&amp；a14&amp；a15；分配p3=Charen&amp；Loram&amp；！MS3&amp；游戏&amp；！RW&amp；AEC&amp；A12&amp；！A13&amp；A14&amp；a15。Hiram&amp；ba&amp；！MS3&amp；！exrom&amp；！Game&amp；rw&amp；AEC&amp；A12&amp；！A13&amp；A14&amp；a15；分配P5=Charen&amp；Hiram&amp；！MS3&amp；！exrom&amp；！Game&amp；！RW&amp；AEC&amp；A12&amp；！A13&amp；A14&amp；a15；Assign p6=Charen&amp；Loram&amp；ba&amp；！MS3&amp；！exrom&amp；！Game&amp；RW&amp；AEC&amp；A12&amp；！A13&amp；a14&amp；a15；Assign p7=Charen&amp；Loram&amp；！MS3&amp；！exrom&amp；！Game&amp；！RW&amp；AEC&amp；！A13&amp；！A15；分配p8=ba&amp；！ms3&amp；exrom&amp；！Game&amp；rw&amp；AEC&amp；a13&amp；！A13&amp；a14&amp；a15；分配p9=！MS3&amp；exrom&amp；！Game&amp；rw&amp；AEC&amp；a12&amp；！a13&amp；a14&amp；a15；分配p10=ba&amp；！MS2&amp；RW&amp；AEC&amp；a12&amp；！A13&amp；A14&amp；a15；Assign p11=！MS2&amp；MS3&amp；！RW&amp；AEC&amp；A12&amp；！a13&amp；a14&amp；a15；Assign p12=Charen&amp；Hiram&amp；ba&amp；！MS3&amp；游戏&amp；RW&amp；AEC&amp；！A10&amp；！A10&amp；A12&amp；！A13&amp；A14&amp；a15；Assign p13=Charen&amp；Hiram&amp；！MS3&amp；Game&amp；！RW&amp；AEC&amp；！A10&amp；！A11&amp；a12&amp；！A13&amp；A14&amp；a15；Assign p14=Charen&amp；Loram&amp；ba&amp；！MS3&amp；Game&amp；RW&amp；Aa。！A10&amp；！A11&amp；a12&amp；！A13&amp；A14&amp；a15；Assign p15=Charen&amp；Loram&amp；！MS3&amp；Game&amp；！RW&amp；AEC&amp；！A10&amp；！A11&amp；a12&amp；！A13&amp；a14&amp；a15；Assign p16=Charen&amp；Hiram&amp；BA&amp；！MS3&amp；！exrom&amp；！Game&amp；rw&amp；AEC&amp；！A10&amp；！A11&amp；A12&amp；！A13&amp；A14&amp；a15；Assign p17=Charen&amp；Hiram&amp；！MS3&amp；！exrom&amp；！Game&amp；！RW&amp；AEC&amp；！A10&amp；！A11&amp；A12&amp；！A13&amp；A14&amp；a15；Assign p18=Charen&amp；Loram&amp；BA&amp；！MS3&amp；！Exrom&amp；！Game&amp；RW&amp；AEC&amp；！A10&amp；！A11&amp；a12&amp；！A13&amp；A14&amp；a15；Assign p19=Charen&amp；Loram&amp；！MS3&amp；！exrom&amp；！Game&amp；！", "note_en": "As I mentioned in my last post I’ve been working on reverse engineering the PLA chip in the C128.I’m now mostly done with this process so I think it’s time to share some of the findings.\n This has been a very interesting project as I did not really know much about semiconductor designand manufacturing. My existing knowledge extended to having seen some die shots and admiring the prettylooking pictures.\n It all started with me buying a cheap microscope to help with soldering surface mount components.\n  Some time later I ended up watching a video on youtube showing a simpler way of getting silicon dies outof the packaging.\n This looked simple enough to try at home as I already had all the equipment needed. Decapping an IC usually involves heated sulphuric acid orother similar nasty chemicals which I do not really want to play with at home. So I dug out a couple of broken MOS chips I had lying around(never throw things away, could come in handy). After fiddling around a bit I ended up with two 8521R0 dies and one 8721 PLA.The first real photo was the one show in the last post.\n   While this was a success I quickly realised that this microscope did not have enough resolution for me to be able to capture images of highenough quality. The maximum magnification is 90x, when using a 2x barlow lens. Additionally it does not have a stage so I had to place the dieon a table and then move the whole microscope, which is very unstable and makes it hard to capture the bits you want to see.\n   This proved to be much better at taking pictures of decent quality, I was however not happy with the camera I bought with it. It’s a cheap camera with no capability for me to manage it remotely except using the AmScope application. Around this time, the Raspberry Pi foundationreleased the new High Quality camera for the Raspberry Pi. This camera has a C-mount on it which matches the microscope so I quickly boughtone and put in on the microscope. This camera is fantastic for this job, full control of the whole process from the comfort of linux.\n  All in all a vast improvement to the previous setup. With the higher resolution I started needing to stitch the photos together to makelarger pictures. This sounded simple at the start and ended up being (as you can probably guess) not very easy at all. I’m still strugglingwith the stitching, but slowly improving. One of the key things for a successful panorama stitch is to have consistent photos when it comesto panning, focus, white balance etc. etc. The more even the photos, the easier and better the stitching becomes.\n  This led me to start working on motorizing the table. It was getting really tiresome having to manually move the table around and the photosended up being moved in multiple axis etc.\n Lots of design work, 3D printing and research into CNC firmwares later I ended up with the following setup:\n  Going from the top we have a Raspberry 7” display, with a Raspberry Pi4 mounted on the back. Not see is also the RPi HiQ camera mounted onthe microscope. The RPi takes photos, displays previews on the display and also runs the python code that controls the CNC board.\n The stage and the levelling table is motorized with 28BYJ-48 steppers controlled using a small board with an ESP32 running  Grbl_Esp32 and four AD4498 stepper motor controllers.\n This whole setup has some issues both in software and hardware but it works well enough for now to enable me to do some work.\n  With the logistics now sorted out I returned to the work of reverse engineering the chip itself. My initial focus was on the PLA chipas this should be one of the simpler ones to figure out. PLA stands for  Programmable Logic Array and is a very common structure in designs from this era.\n Looking at the schematic diagram from wikipedia we should expect to see two main arrays, AND and OR. Inputs are connected to AND andoutputs from the OR array.\n Going back to the previous die shot with can improve it with some annotations for the pins and the general areas of the chip. Once wehave established the pins we can see that all the inputs are connected to one array and all the outputs to the other array, just asexpected. This also helps us establish which array is which.\n  Here we see the I/O pins marked up with how they are connected to the lead frame and the pins on the DIP itself. We can also see the two mainareas that make up a PLA structure, the AND array and the OR array. Additionally there is some extra logic at the bottom marked with a questionmark. The function of this was unknown to me but as all the output pins are passing through it I was guessing that it was an output stage ofsome kind.\n  So, if we take a closer look at the AND matrix to start with we will see the following. The colours are a bit off as this was still doneusing the AmScope camera and I didn’t figure out how to set the white balance on it.\n  This was not very helpful to understand what was going on as all the interesting bits are covered up by the top-most metal layer. This wasearly on when I was still learning a lot so to remove the metal I took a very brute force approach. I use heavy mechanical scrubbing toremove the metal which I also learned once I put it back in the microscope had removed everything but the substrate itself. Oops.\n   Looking closely at this image we can see little squiggly lines where a transistor is located to create a connection within the matrix.\n  Moving on to the OR array we see the exact same pattern. Hard to tell with the metal layer in place, though easier compared to the ANDmatrix. Much easier with just the substrate and diffusion left.\n   Armed with this knowledge we can now proceed with extracting the full PLA logic matrix from the images.\n I marked all transistors in each matrix with a dot and got the following picture:\n  All inputs are horizontal in the AND matrix, with each line having a normal and an inverted signal being fed in.All outputs are horizontal in the OR matrix and they are connected with vertical lines called product terms.\n By looking at the dots, we can decode the product terms by doing logic and for all vertical lines in the AND matrix, for example\n p0 = CHAREN &amp; HIRAM &amp; BA &amp; !MS3 &amp; GAME &amp; RW &amp; AEC &amp; A12 &amp; !A13 &amp; A14 &amp; A15\n For the outputs we instead look horizontal for each output and combine with or, for example\n    Going back to the full die picture, we now have everything but the box marked with a question mark in the output path.\n Looking at higher resolution photos of this we can see similar structures for each output. In all cases except two the structureis bypassed and the output from the OR matrix goes directly to the output pin. This is however not the case for the two pins  DWE and  CASENB.\n DWE is the Write Enable signal going to the main system DRAM chips, CASENB is gating the CAS signal towards the RAM. These two signals areprocessed in some form using these output gate structures, so I had to reverse engineer this block.\n  After quite some time reading up on silicon chip design and manufacturing and a lot of attempts I managed to come up with a schematicfor this that makes sense. I’m not going to go into the whole process here but I will document and post it later. Here I would also liketo thank  Frank Wolf for his help, please support his project if you can!\n  Going a bit further, the way this is used in the  DWE and  CASENB outputs makes it a normal D-latch. The latch enable for this also comesfor the PLA matrix in a pair of lines in the OR matrix.\n  So as a final result we can now write down the full HDL code for the C128 PLA chip. I’m using verilog for this. Mind you this is the firstverilog I’ve ever written so it’s probably suboptimal. Using a D-latch for the output in verilog is normally seen as a bad thing, howeverin this case I am doing it to replicate the logic and function of the existing chip.\n I have validated this to the best of my knowledge, but if I’ve missed anything please let me know!\n In difference to the C64 PLA the C128 PLA can not be replaced with just an EPROM or similar due to the presence of the output latches.\n module pla_8721(  input rom_256,  input va14,  input charen,  input hiram,  input loram,  input ba,  input vma5,  input vma4,  input ms0,  input ms1,  input ms2,  input ms3,  input z80io,  input z80en,  input exrom,  input game,  input rw,  input aec,  input dmaack,  input vicfix,  input a10,  input a11,  input a12,  input a13,  input a14,  input a15,  input clk,  output sden,  output roml,  output romh,  output clrbnk,  output from,  output rom4,  output rom3,  output rom2,  output rom1,  output iocs,  output dir,  output  reg dwe,  output  reg casenb,  output vic,  output ioacc,  output gwe,  output colram,  output charom); wire p0; wire p1; wire p2; wire p3; wire p4; wire p5; wire p6; wire p7; wire p8; wire p9; wire p10; wire p11; wire p12; wire p13; wire p14; wire p15; wire p16; wire p17; wire p18; wire p19; wire p20; wire p21; wire p22; wire p23; wire p24; wire p25; wire p26; wire p27; wire p28; wire p29; wire p30; wire p31; wire p32; wire p33; wire p34; wire p35; wire p36; wire p37; wire p38; wire p39; wire p40; wire p41; wire p42; wire p43; wire p44; wire p45; wire p46; wire p47; wire p48; wire p49; wire p50; wire p51; wire p52; wire p53; wire p54; wire p55; wire p56; wire p57; wire p58; wire p59; wire p60; wire p61; wire p62; wire p63; wire p64; wire p65; wire p66; wire p67; wire p68; wire p69; wire p70; wire p71; wire p72; wire p73; wire p74; wire p75; wire p76; wire p77; wire p78; wire p79; wire p80; wire p81; wire p82; wire p83; wire p84; wire p85; wire p86; wire p87; wire p88; wire p89; wire casenb_int; wire casenb_latch; /* Product terms */ assign p0  = charen  &amp; hiram  &amp; ba  &amp;  !ms3  &amp; game  &amp; rw  &amp; aec  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p1  = charen  &amp; hiram  &amp;  !ms3  &amp; game  &amp;  !rw  &amp; aec  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p2  = charen  &amp; loram  &amp; ba  &amp;  !ms3  &amp; game  &amp; rw  &amp; aec  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p3  = charen  &amp; loram  &amp;  !ms3  &amp; game  &amp;  !rw  &amp; aec  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p4  = charen  &amp; hiram  &amp; ba  &amp;  !ms3  &amp;  !exrom  &amp;  !game  &amp; rw  &amp; aec  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p5  = charen  &amp; hiram  &amp;  !ms3  &amp;  !exrom  &amp;  !game  &amp;  !rw  &amp; aec  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p6  = charen  &amp; loram  &amp; ba  &amp;  !ms3  &amp;  !exrom  &amp;  !game  &amp; rw  &amp; aec  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p7  = charen  &amp; loram  &amp;  !ms3  &amp;  !exrom  &amp;  !game  &amp;  !rw  &amp; aec  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p8  = ba  &amp;  !ms3  &amp; exrom  &amp;  !game  &amp; rw  &amp; aec  &amp; a13  &amp;  !a13  &amp; a14  &amp; a15; assign p9  =  !ms3  &amp; exrom  &amp;  !game  &amp; rw  &amp; aec  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p10  = ba  &amp;  !ms2  &amp; ms3  &amp; rw  &amp; aec  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p11  =  !ms2  &amp; ms3  &amp;  !rw  &amp; aec  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p12  = charen  &amp; hiram  &amp; ba  &amp;  !ms3  &amp; game  &amp; rw  &amp; aec  &amp;  !a10  &amp;  !a11  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p13  = charen  &amp; hiram  &amp;  !ms3  &amp; game  &amp;  !rw  &amp; aec  &amp;  !a10  &amp;  !a11  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p14  = charen  &amp; loram  &amp; ba  &amp;  !ms3  &amp; game  &amp; rw  &amp; aec  &amp;  !a10  &amp;  !a11  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p15  = charen  &amp; loram  &amp;  !ms3  &amp; game  &amp;  !rw  &amp; aec  &amp;  !a10  &amp;  !a11  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p16  = charen  &amp; hiram  &amp; ba  &amp;  !ms3  &amp;  !exrom  &amp;  !game  &amp; rw  &amp; aec  &amp;  !a10  &amp;  !a11  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p17  = charen  &amp; hiram  &amp;  !ms3  &amp;  !exrom  &amp;  !game  &amp;  !rw  &amp; aec  &amp;  !a10  &amp;  !a11  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p18  = charen  &amp; loram  &amp; ba  &amp;  !ms3  &amp;  !exrom  &amp;  !game  &amp; rw  &amp; aec  &amp;  !a10  &amp;  !a11  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p19  = charen  &amp; loram  &amp;  !ms3  &amp;  !exrom  &amp;  !game  &amp;  !rw  &amp; aec  &amp;  !a10  &amp;  !a11  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p20  = ba  &amp;  !ms3  &amp; exrom  &amp;  !game  &amp; rw  &amp; aec  &amp;  !a10  &amp;  !a11  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p21  =  !ms3  &amp; exrom  &amp;  !game  &amp; rw  &amp; aec  &amp;  !a10  &amp;  !a11  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p22  = ba  &amp;  !ms2  &amp; ms3  &amp; rw  &amp; aec  &amp;  !a10  &amp;  !a11  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p23  =  !ms2  &amp; ms3  &amp;  !rw  &amp; aec  &amp;  !a10  &amp;  !a11  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p24  = charen  &amp; hiram  &amp; ba  &amp;  !ms3  &amp; game  &amp; rw  &amp; aec  &amp;  !a10  &amp; a11  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p25  = charen  &amp; hiram  &amp;  !ms3  &amp; game  &amp;  !rw  &amp; aec  &amp;  !a10  &amp; a11  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p26  = charen  &amp; loram  &amp; ba  &amp;  !ms3  &amp; game  &amp; rw  &amp; aec  &amp;  !a10  &amp; a11  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p27  = charen  &amp; loram  &amp;  !ms3  &amp; game  &amp;  !rw  &amp; aec  &amp;  !a10  &amp; a11  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p28  = charen  &amp; hiram  &amp; ba  &amp;  !ms3  &amp;  !exrom  &amp;  !game  &amp; rw  &amp; aec  &amp;  !a10  &amp; a11  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p29  = charen  &amp; hiram  &amp;  !ms3  &amp;  !exrom  &amp;  !game  &amp;  !rw  &amp; aec  &amp;  !a10  &amp; a11  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p30  = charen  &amp; loram  &amp; ba  &amp;  !ms3  &amp;  !exrom  &amp;  !game  &amp; rw  &amp; aec  &amp;  !a10  &amp; a11  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p31  = charen  &amp; loram  &amp;  !ms3  &amp;  !exrom  &amp;  !game  &amp;  !rw  &amp; aec  &amp;  !a10  &amp; a11  &amp; a12  &amp;  !a13  &amp; a15; assign p32  = ba  &amp;  !ms3  &amp; exrom  &amp;  !game  &amp; rw  &amp; aec  &amp;  !a10  &amp; a11  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p33  =  !ms3  &amp; exrom  &amp;  !game  &amp; rw  &amp; aec  &amp;  !a10  &amp; a11  &amp; a12  &amp;  !a13  &amp; a15; assign p34  = ba  &amp;  !ms2  &amp; ms3  &amp; rw  &amp; aec  &amp;  !a10  &amp; a11  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p35  =  !ms2  &amp; ms3  &amp;  !rw  &amp; aec  &amp;  !a10  &amp; a11  &amp; a12  &amp;  !a13  &amp; a15; assign p36  =  !aec; assign p37  =  !rw  &amp; aec  &amp;  !a10  &amp; a11  &amp; a12  &amp;  !a13  &amp; a15; assign p39  =  !charen  &amp; hiram  &amp;  !ms3  &amp; game  &amp; rw  &amp; aec  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p40  =  !charen  &amp; loram  &amp;  !ms3  &amp; game  &amp; rw  &amp; aec  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p41  =  !charen  &amp; hiram  &amp;  !ms3  &amp;  !exrom  &amp;  !game  &amp; rw  &amp; aec  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p42  = va14  &amp;  !vma5  &amp; vma4  &amp;  !ms3  &amp; game  &amp;  !aec; assign p43  = va14  &amp;  !vma5  &amp; vma4  &amp;  !ms3  &amp;  !exrom  &amp;  !game  &amp;  !aec; assign p44  =  !ms0  &amp;  !ms1  &amp; ms2  &amp;ms3  &amp; z80en  &amp; rw  &amp; aec  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p45  = hiram  &amp; loram  &amp;  !ms3  &amp;  !exrom  &amp; rw  &amp; aec  &amp;  !a13  &amp;  !a14  &amp; a15; assign p46  =  !ms3  &amp; exrom  &amp;  !game  &amp; aec  &amp;  !a13  &amp;  !a14  &amp; a15; assign p47  = ms0  &amp;  !ms1  &amp; ms3  &amp; exrom  &amp;  !game  &amp; aec  &amp;  !a14  &amp; a15; assign p48  =  !ms0  &amp; ms1  &amp; ms3  &amp; aec  &amp;  !a14  &amp; a15; assign p49  = hiram  &amp;  !ms3  &amp;  !exrom  &amp;  !game  &amp; aec  &amp; a13  &amp;  !a14  &amp; a15; assign p50  = ms3  &amp; exrom  &amp;  !game  &amp; aec  &amp; a13  &amp;  !a14  &amp; a15; assign p51  = vma5  &amp; vma4  &amp;  !ms3  &amp; exrom  &amp;  !game  &amp;  !aec; assign p52  = ms0  &amp;  !ms1  &amp; ms3  &amp; rw  &amp; aec  &amp;  !a12  &amp;  !a13  &amp; a14  &amp; a15; assign p53  =  !ms0  &amp; ms1  &amp; ms3  &amp; rw  &amp; aec  &amp;  !a12  &amp;  !a13  &amp; a14  &amp; a15; assign p54  =  !ms0  &amp;  !ms1  &amp; ms3  &amp; rw  &amp; aec  &amp;  !a12  &amp;  !a13  &amp; a14  &amp; a15; assign p55  =  !ms0  &amp;  !ms1  &amp; z80io  &amp;  !z80en  &amp; rw  &amp; aec  &amp;  !a12  &amp;  !a13  &amp;  !a14  &amp;  !a15; assign p56  =  !ms0  &amp;  !ms1  &amp; ms3  &amp; rw  &amp; aec  &amp;  !a14  &amp; a15; assign p57  =  !ms0  &amp;  !ms1  &amp; ms3  &amp; rw  &amp; aec  &amp; a14  &amp;  !a15; assign p58  = hiram  &amp;  !ms3  &amp; game  &amp; rw  &amp; aec  &amp; a13  &amp; a14  &amp; a15; assign p59  = hiram  &amp;  !ms3  &amp;  !exrom  &amp;  !game  &amp; rw  &amp; aec  &amp; a13  &amp; a14  &amp; a15; assign p60  = hiram  &amp; loram  &amp;  !ms3  &amp; game  &amp; rw  &amp; aec  &amp; a13  &amp;  !a14  &amp; a15; assign p61  =  !z80io  &amp;  !z80en  &amp; aec  &amp;  !a10  &amp;  !a11  &amp;  !a13  &amp; a14  &amp; a15; assign p62  =  !z80io  &amp;  !z80en  &amp; aec  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p63  =  !z80io  &amp;  !z80en  &amp; aec  &amp;  !a10  &amp; a11  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p64  =  !rw  &amp; aec; assign p65  = rw  &amp; aec; assign p66  =  !aec; assign p67  =  !ms2  &amp;  !z80en  &amp; aec  &amp;  !a10  &amp;  !a11  &amp; a12  &amp;  !a13  &amp;  !a14  &amp;  !a15; assign p68  =  !ms2  &amp;  !z80en  &amp;  !rw  &amp; aec  &amp;  !a10  &amp;  !a11  &amp; a12  &amp;  !a13  &amp;  !a14  &amp;  !a15; assign p69  =  !charen  &amp;  !vma5  &amp; vma4  &amp; ms3  &amp; aec; assign p70  =  !rom_256  &amp;  !ms0  &amp;  !ms1  &amp; ms3  &amp; rw  &amp; aec  &amp; a14  &amp;  !a15; assign p71  =  !rom_256  &amp;  !ms0  &amp;  !ms1  &amp; ms3  &amp; rw  &amp; aec  &amp;  !a12  &amp;  !a13  &amp; a14  &amp; a15; assign p72  =  !rom_256  &amp;  !ms0  &amp;  !ms1  &amp; z80io  &amp;  !z80en  &amp; rw  &amp; aec  &amp;  !a12  &amp;  !a13  &amp;  !a14  &amp;  !a15; assign p73  = clk; assign p74  = rw  &amp;  !aec  &amp; vicfix; assign p75  =  !ms0  &amp;  !ms1  &amp; ms3  &amp; rw  &amp; aec  &amp; a13  &amp; a14  &amp; a15; assign p76  =  !rom_256  &amp;  !ms0  &amp;  !ms1  &amp; ms3  &amp; rw  &amp; aec  &amp; a13  &amp; a14  &amp; a15; assign p77  =  !ms0  &amp; ms1  &amp; ms3  &amp; rw  &amp; aec  &amp; a13  &amp; a14  &amp; a15; assign p78  =  !ms0  &amp; ms1  &amp; ms2  &amp; ms3  &amp; rw  &amp; aec  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p79  = ms0  &amp;  !ms1  &amp; ms3  &amp; rw  &amp; aec  &amp; a13  &amp; a14  &amp; a15; assign p80  = ms0  &amp;  !ms1  &amp; ms2  &amp; ms3  &amp; rw  &amp; aec  &amp; a12  &amp;  !a13  &amp; a14  &amp; a15; assign p81  =  !ms3  &amp; exrom  &amp;  !game  &amp; aec  &amp; a12  &amp;  !a14  &amp;  !a15; assign p82  =  !ms3  &amp; exrom  &amp;  !game  &amp; aec  &amp; a13  &amp;  !a14; assign p83  =  !ms3  &amp; exrom  &amp;  !game  &amp; aec  &amp; a14; assign p84  =  !ms3  &amp; exrom  &amp;  !game  &amp; aec  &amp;  !a12  &amp;  !a13  &amp; a14  &amp; a15; assign p85  =  !loram  &amp; ms3  &amp; aec; assign p86  =  !hiram  &amp; ms3  &amp;  !aec; /* outputs */ assign sden  = p42  || p43  || p66  || p69; assign roml  = p45  || p46  || p47; assign romh  = p49  || p50  || p51  || p52  || p79  || p80; assign clrbnk \n......", "posttime": "2020-07-31 10:08:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "芯片,逆向工程,engineering,输入", "title": "对Commodore 128中的PLA芯片进行逆向工程", "title_en": "Reverse Engineering the PLA Chip in the Commodore 128", "transed": 1, "url": "https://c128.se/posts/silicon-adventures/", "via": "", "real_tags": ["芯片", "逆向工程", "输入"]}, {"category": "", "categoryclass": "", "imagename": "c4993f0e6c40eb99e1b37d0803746b25.jpeg", "infoid": 1015349, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你可能会认为周三的大型科技公司首席执行官听证会--亚马逊(Amazon)、苹果(Apple)、谷歌(Google)和Facebook的高管计划就反垄断和不正当竞争问题接受国会质询--将是本季度必看的国会山活动之一。\n但与2020年早些时候的国会事件-特别是众议院弹劾和参议院对唐纳德·特朗普(Donald Trump)总统的审判-一样，国会承诺过度，承诺不足。对于学习美国公共政策的学生来说，这本来是一个可以教导的时刻，但很快就演变成了基本上(尽管不完全)是一种空洞的练习。鉴于听证会总体上专注于仅仅是表演性的-如此多的成员主要寻求为C-SPAN或在家的观众得分-从周三的听证会中能学到什么教训是值得一问的。我有几个想法。\n对我来说，第一个教训是明确的：如果你设法把这个国家的四大首席执行官召集起来，进行了一个下午的质询--这本身就是一场妙计--你必须对你的委员会成员施加足够的纪律，让他们的问题停留在听证会的名义主题上。周三的听证会由众议院司法委员会反垄断小组委员会召集。这本应意味着，成员们的问题-以及他们提出问题的紧密时间间隔-应该集中在反垄断和竞争问题上。作为一个实际问题，这本应意味着共和党人对反保守派偏见的抱怨是不符合规程的--民主党人关于俄罗斯干预2016年大选的问题和言论也应该是不符合规程的。这并不是说这些问题绝对与竞争问题无关，但它们大多是无关的。主席和高级成员应该坚持让他们的同事坚持这个话题。\n第二个教训是，一名议员一开始就把自己的愤怒程度放大到11人，对任何人都没有好处。许多共和党成员在基于可疑的反保守派偏见(有时还带有阴谋论)的言论要点上大发雷霆。在发言中，许多共和党成员愤怒地提出了一些观点，这些言论都是基于可疑的反保守派偏见，有时还会充斥着阴谋论。佛罗里达州众议员格雷格·斯图贝(Greg Steube)明确表示，他确信科技公司故意让选民和他的家人更难通过电子邮件联系到他。\n尽管如此，斯图贝还是比俄亥俄州众议员吉姆·乔丹(Jim Jordan)平静了一些，乔丹除了坚称科技公司歧视保守的新闻来源和观点外，还愤怒地表示，这些公司正在积极策划，以确保民主党人在今年秋天的选举中获胜。他还认为，或者至少表现得像是他相信，谷歌试图在2016年为希拉里·克林顿策划一场胜利。周三，他告诉福克斯新闻(Fox News)的塔克·卡尔森(Tucker Carlson)：“2016年，谷歌试图调整自己的功能，以在关键州帮助克林顿。”他补充说，“好消息是，在2016年，尽管谷歌做了什么，美国人民还是看到了它的本来面目，唐纳德·特朗普(Donald Trump)当选了。”阴谋论声称其实质已经够令人不安的了，但对于任何观看听证会的人来说，演讲也是令人不安的。当其他委员会成员表示不同意他的断言时，乔丹似乎几乎无法控制自己，而且一度主席似乎不得不命令乔丹离开房间。后来，乔丹试图将提问引向他对“取消文化”的担忧，他坚称，这让“纽约时报”前观点撰稿人和编辑巴里·韦斯(Bari Weiss)成为了受害者。“我以为我们有第一修正案，”他抱怨道。(作为法律问题，第一修正案与韦斯辞去时报职务的决定无关。)。\n我的意思并不是说，似乎只有共和党成员受到敌意的驱使。罗德岛小组委员会主席大卫·西西林(David Cicilline)基本上宣布，他已经得出结论，这些公司的行为是反竞争的。好吧，让我们假设他们有-即使这是真的，也有一些事情可以说，把你的愤怒保存到第一次破坏性的Admission…之后。或者撒谎。相比之下，来自威斯康星州的共和党资深议员吉姆·森森布伦纳(Jim Sensenbrenner)似乎很平静，或许是因为知道他将在今年之后从众议院退休-尽管他确实感到有一两次被迫形式上回应对所谓的反保守派偏见的担忧。(我自己的众议员、来自马里兰州的民主党人杰米·拉斯金(Jamie Raskin)谢天谢地地指出，从现有的统计数据来判断，保守派新闻和观点来源在接触在线受众方面做得相当好。)。\n第三个教训，委员会的几名成员已经成功地内化了，那就是，没有什么能真正取代高度细粒度的准备，就你想要质疑的这个或那个公司做法挑战证人。让我们在这里实事求是吧：哦\n巧合的是，今天的“纽约时报”谜题的答案是“iPhone 7plus”！\n-布雷特·托马斯(@the_Quark)2020年7月29日。\n别误会我的意思：我认为，强迫杰夫·贝佐斯听一段录音(由佐治亚州民主党众议员露西·麦克巴斯(Lucy McBath)提供)实际上可能是出于社会有益的目的，甚至是道德上的目的。录音内容是一个倒霉的小贩，他的教科书商店被亚马逊(Amazon)摘牌了。如果听证会在整个过程中都有如此戏剧性的焦点，那么5个多小时的活动就会飞驰而过。但是，如此多的委员会成员总体上缺乏纪律和专注，再加上首席执行官们的避险情绪，导致他们即使在“是”或“不是”的回答可能是最安全的回应时，也会避免直截了当的回答--这本应是与大型科技公司最大的首席执行官们的历史性对峙，也可能是对他们的追问，让他们陷入了沉闷的困境。如果国会还有机会再次召集这个全明星证人小组-这似乎不太可能-让我们希望议员们至少从这次机会中学到了一些关于不应该做什么的教训。\n未来时态是Slate、New America和亚利桑那州立大学的合作项目，研究新兴技术、公共政策和社会。", "note_en": "You may be forgiven for having thought that Wednesday’s Big Tech CEO hearing—in which the top executives at Amazon, Apple, Google, and Facebook were scheduled to get grilled by Congress on antitrust and unfair competition issues—would be one of the must-see Hill events of the season.\n  But as with earlier congressional events in 2020—notably the impeachment in the House and trial in the Senate of President Donald Trump—Congress overpromised and underdelivered. What could have been a teachable moment for students of American public policy quickly morphed into something that was mostly (although not entirely) an empty exercise. Given how much the hearing overall was focused on the merely performative—with so many members seeking primarily to score points for audiences on C-SPAN or at home—it’s worth asking what kind of lessons could be learned from Wednesday’s hearings. I have a few ideas.\n        For me, the first lesson is clear: If you’ve managed to corral the top four of this country’s CEOs for an afternoon of questioning—quite a  coup de  théâtre in itself—you must impose enough discipline on your committee members to keep their questions on the nominal subject of the hearing. Wednesday’s hearing was convened by the House Judiciary Committee’s subcommittee on antitrust. This should have meant that the members’ questions—and the tight intervals of time in which they got to ask them—should have been focused on antitrust and competition questions. As a practical matter, this should have meant that Republicans’ complaints about  anti-conservative bias were out of order—and that Democrats’ questions and comments about 2016 election interference by the Russians should have been out of order, too. It’s not that these issues are categorically unrelated to competition questions, but they mostly are. The chair and the ranking member ought to insist that their colleagues stick to the topic.\n      A second lesson is that it does no one any good for a member to start out with his or her rage volume amped up to 11. Many Republican members lock-stepped their furious way through talking points based on dubious claims of anti-conservative bias, sometimes seasoned with conspiracy theories. Florida Rep. Greg Steube made it clear that he’s certain the tech companies have deliberately made it harder for constituents and his family members to reach him through email.\n  That said, Steube was a bit calmer than Rep. Jim Jordan of Ohio, who—in addition to insisting that the tech companies are discriminating against conservative news sources and opinions—fumed that the companies are actively plotting to ensure election victories for Democrats this fall. He also believes, or at least performs as if he believes, that Google tried to engineer a victory for Hillary Clinton in 2016. “In 2016, Google tried to tailor their features to help Clinton in key states,” he told Fox News’s Tucker Carlson on Wednesday, adding that “[t]he good news is in 2016, in spite of what Google did, the American people saw it for what it was and Donald Trump was elected.” The conspiracy theory claims were disturbing enough in their substance, but to anyone watching the hearing, the delivery was disturbing, too. Jordan seemed barely able to contain himself when other committee members expressed disagreement with his assertions, and at one point it seemed possible that the chairman might have to order Jordan removed from the room. Later, Jordan tried to steer the questioning to his concerns about “cancel culture,” which he insisted has made a victim of former New York Times opinion writer and editor Bari Weiss. “I thought we had a First Amendment,” he complained. (As a legal matter, the First Amendment has nothing to do with Weiss’ decision to resign from the Times.)\n        I don’t mean to suggest that only Republican members seemed driven by animus. Subcommittee Chair David Cicilline of Rhode Island basically declared that he already had concluded the companies were acting anti-competitively. Well, let’s assume they have—even if that’s true, there’s something to be said for saving your anger until after the first damaging admissions … or lies. By comparison, ranking member Jim Sensenbrenner, a Republican from Wisconsin, seemed calm, perhaps comforted by the knowledge that he’s retiring from the House after this year—even if he did feel compelled once or twice to echo, pro forma, concerns about the purported anti-conservative bias. (My own representative, Jamie Raskin, a Democrat from Maryland, thankfully took time to point out that, to judge by available statistics, conservative news and opinion sources are doing quite well at reaching their online audiences.)\n      A third lesson, which several members of the committee already have successfully internalized, is that there’s no real substitute for being prepared at a highly granular level to challenge the witnesses about this or that company practice that you want to call into question. Let’s be real here: Of course Amazon, a platform for other vendors that’s also selling its own branded products, is using its data to decide what products to offer, how to price them, and how to compete. Of course Facebook, once it had a lot of cash in its coffers, ended up weighing whether to compete against uppity rivals or just buy them. If it’s less clear whether Google or Apple have indulged to the same degree in similar strategic uses of platform data or the ability to purchase rivals, a prepared member of Congress ought to have done the homework necessary to dig down into what the differences are. Among the members who deserve good grades for meeting the homework requirement are Rep. Pramila Jayapal, a Democrat from Washington, challenging Facebook’s Mark Zuckerberg about the acquisition of Instagram and Rep. Kelly Armstrong, a Republican from North Dakota, who quizzed Google/Alphabet’s Sundar Pichai about “ geofence warrants” that force tech companies to turn over data for anyone who happened to be near the scene of a particular crime.(OK, I’m not entirely sure of the antitrust connection for geofence warrants, but I was still glad to see the question asked.)\n          Which brings us to the fourth lesson, which is this: Members of Congress, don’t let the sheer dramatic impact of haling a couple of billionaires (Zuckerberg and Amazon’s Jeff Bezos), together with a couple of high-performance multimillionaires (Apple’s Tim Cook and arguably Pichai, although the latter may already have crossed into the billionaire club) distract you from the primary purpose of these hearings, which is both to inform the public and to make the case (if there is one) for legislative intervention in these markets, with these particular businesses. The witness list was impressive, but it was hard to ignore the fact that committee members were so focused on Facebook, Google, and Amazon that we hardly heard much from Tim Cook, other than some not-entirely well-researched questions about Apple’s App Store. At one point I found myself imagining Cook’s sending a message in Zoom chat: “Guys, I’m still here? In case you want to ask me anything?” Shortly afterward I wondered openly on Twitter whether “Tim Cook is filling out a crossword puzzle right now.” To which I got this tweet in reply:\n    Today’s NYT puzzle had “IPHONE SEVEN PLUS” as an answer, coincidentally!\n— Brett Thomas (@the_quark)  July 29, 2020\n  Don’t get me wrong: I think there actually can be socially useful purposes—even morally instructive ones—in compelling Jeff Bezos to listen to a recording (provided by Rep. Lucy McBath, a Democrat from Georgia) of a hapless vendor whose textbook store was delisted by Amazon. If the hearing had had even that much dramatic focus throughout, the five-plus-hour event would have flown by. But the overall lack of discipline and focus on the part of so many of the committee members—together with the CEOs’ risk aversion that led them to avoid straight answers even when a “yes or no” answer might have been the safest response—transmuted what should have been a historic confrontation with, and possibly a calling-to-account of, the biggest of Big Tech CEOS into a dreary slog. If Congress ever has another chance to assemble this all-star witness panel again—which seems unlikely—let’s hope the members have at least learned a few lessons from this one about what not to do.\n  Future Tense is a partnership of  Slate,  New America, and  Arizona State University that examines emerging technologies, public policy, and society.", "posttime": "2020-07-31 09:52:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,国会,lessons", "title": "戈德温：国会从大科技反垄断听证会中吸取的教训", "title_en": "Godwin: Lessons for Congress from the Big Tech antitrust hearing", "transed": 1, "url": "https://slate.com/technology/2020/07/antitrust-big-tech-hearing-apple-amazon-google-facebook.html", "via": "", "real_tags": ["rust", "国会", "lessons"]}, {"category": "", "categoryclass": "", "imagename": "2915258f6fd6cf8728c117fd08c23a0f.jpg", "infoid": 1015348, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周四，大众集团(VW Group)敲定了对Argo AI的26亿美元投资近两个月后，官方估值得到确认。根据该协议，福特和大众拥有同等的所有权股份，随着时间的推移，这一比例将分别约为40%。剩余的股权由Argo的联合创始人和员工持有。Argo的董事会由两个大众席位、两个福特席位和三个Argo席位组成。\n福特在2017年2月宣布将投资Argo AI，这让许多人感到意外。这家初创公司成立仅六个月就被推到了聚光灯下。其创始人布莱恩·萨莱斯基(Bryan Salesky)和彼得·兰德(Peter Rander)在紧密联系且往往重叠的自动驾驶汽车行业闻名；在成立Argo之前，萨莱斯基是谷歌自动驾驶项目(现为Waymo)的硬件开发总监，兰德是优步高级技术集团(Uber Advanced Technologies Group)的工程主管。但即使是那些认识萨莱斯基和兰德的内部人士也想知道如何看待这笔交易。\n从那时起，Argo一直专注于开发虚拟驾驶员系统-所有的传感器、软件和计算平台-以及为福特自动驾驶汽车设计的高清地图。\n这一使命现在也延伸到了大众集团。根据交易条款，福特和大众将分担开发Argo AI自动驾驶汽车技术的成本。这家总部位于匹兹堡的公司在底特律、帕洛阿尔托和新泽西州克兰伯里也设有办事处。它在奥斯汀、迈阿密、匹兹堡和华盛顿特区的公共道路上有自动驾驶车队进行测绘和测试。\n大众的这笔投资将其劳动力和业务扩展到欧洲。2017年为大众集团开发自动驾驶技术而成立的自动驾驶子公司自动驾驶智能驾驶(AID)正被并入Argo AI。援助组织慕尼黑办事处将成为Argo的欧洲总部。Argo现在总共雇佣了1000多名员工。\n虽然自动驾驶汽车的开发和部署将是一段漫长的旅程-福特首席执行官吉姆·哈克特(Jim Hackett)周四也发表了这一言论-但Argo的投资已经为这家汽车制造商提供了短期和及时的收益。\n这家汽车制造商周四表示，第二季度通过将部分Argo股权出售给大众汽车(Volkswagen)净赚35亿美元。这一增长一次性提振了这家汽车制造商第二季度的收益。\n如果将Argo交易计算在内，福特第二季度实现利润11亿美元。福特本季度息税前和一次性项目前亏损19亿美元。福特公布营收为194亿美元，较2019年同期减少50%，因新冠肺炎疫情导致公司工厂闲置数周。\n尽管如此，结果可能要糟糕得多。福特此前警告称，第二季度可能出现高达50亿美元的净亏损。\n尽管有这些新冠肺炎的逆风，哈克特表示，福特仍致力于对AV的长期追求，首席财务官蒂姆·斯通重申了这一点，他表示，福特将继续投资，将其自动驾驶汽车业务商业化，包括产品开发、工程和测试。\n“AV之旅将是漫长的，但福特现在处于有利地位，可以跑完这场比赛，像其他几个人一样竞争，”哈克特补充道。", "note_en": "The official valuation was confirmed Thursday nearly two months after VW Group finalized its $2.6 billion investment in Argo AI. Under that deal, Ford and VW have equal ownership stakes, which will be roughly 40% each over time. The remaining equity sits with Argo’s co-founders as well as employees. Argo’s board is comprised of two VW seats, two Ford seats and three Argo seats.\n Ford’s announcement in February 2017 that it was investing in Argo AI surprised many. The startup was barely six months old when it was thrust into the spotlight. Its founders, Bryan Salesky and Peter Rander, were known in the tight knit and often overlapping autonomous vehicle industry; prior to forming Argo, Salesky was director of hardware development at the Google self-driving project (now Waymo) and Rander was the engineering lead at Uber Advanced Technologies Group. But even those insiders who knew Salesky and Rander wondered what to make of the deal.\n  Since then, Argo has focused on developing the virtual driver system — all of the sensors,  software and compute platform — as well as high-definition maps designed for Ford’s self-driving vehicles.\n That mission now extends to VW Group as well. Ford and VW will share the cost of developing Argo AI’s self-driving vehicle technology under the terms of the deal. The Pittsburgh-based company also has offices in Detroit, Palo Alto and Cranbury, N.J. It has fleets of autonomous vehicles mapping and testing on public roads in Austin, Miami, Pittsburgh and Washington, D.C.\n The investment by VW expands its workforce and operations to Europe. Autonomous Intelligent Driving (AID), the self-driving subsidiary that was  launched in 2017 to develop autonomous vehicle technology for the VW Group, is being absorbed into Argo AI. AID’s Munich offices will become Argo’s European headquarters. In all, Argo now employs more than 1,000 people.\n While the development and deployment of autonomous vehicles will be a long journey — a remark shared Thursday by Ford CEO Jim Hackett — the Argo investment has already provided the automaker with a short-term and timely gain.\n The automaker said Thursday it netted  $3.5 billion in the second quarter from selling some of its Argo equity to Volkswagen. That gain gave the automaker a one-time boost in its second-quarter earnings.\n Ford posted a $1.1 billion profit in the second quarter, if the Argo transaction is counted. Ford lost $1.9 billion in the quarter before interest and taxes and one-time items. Ford reported a revenue of $19.4 billion, a 50% decrease from the same period in 2019 due to the COVID-19 pandemic which caused the company to idle its factories for weeks.\n Still, the result could have been far worse. Ford had previously warned that it could post as much as a $5 billion net loss in the second quarter.\n Despite these COVID-19 headwinds, Hackett said Ford is still committed to the long-term pursuit of AVs, a point reiterated by CFO Tim Stone, who said the automaker continues to make investments to commercialize its autonomous vehicle business, including product development, engineering and testing.\n “The AV journey will be a long one, but Ford is now well positioned to run this race and compete like few others can,” Hackett added.", "posttime": "2020-07-31 09:22:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "驾驶,startup,argo", "title": "\n自动驾驶初创公司Argo AI估值达到75亿美元", "title_en": "\n\t\t\t\tSelf-driving startup Argo AI hits $7.5 billion valuation\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/30/self-driving-startup-argo-ai-hits-7-5-billion-valuation/", "via": "", "real_tags": ["驾驶", "startup", "argo"]}, {"category": "", "categoryclass": "", "imagename": "76597fa56f4265a2638f3da1a06c8dfd.jpg", "infoid": 1015347, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据福特称，已有超过15万名客户斥资100美元预订了其中一辆车的订单。\n哈克特说：“我们认为，这一系列车辆在不断增长的越野类别中具有很大的上行潜力，到目前为止，这是一个拥有领先OEM的类别，还没有受到严重挑战。”\n当然，这些仅仅是预订，而不是实际的订单。押金是可以退还的。现在，福特在制定该品牌的制造战略时，正专注于所需的尽职调查，以确定这些保留中有多少将转换为订单。\n福特野马2和野马4将在密歇根州韦恩的密歇根州组装厂生产。野马运动将在墨西哥的工厂组装。该公司目前正在确定每家工厂员工的班次，以便与实际订单相匹配。\n福特首席运营官吉姆·法利(Jim Farley)周四在与分析师的电话会议上表示：“还有很多工作要做。”“但组合很棒。”\nBronco是一个严重依赖怀旧、定制、功能设计和技术的品牌，比如该汽车制造商的下一代信息娱乐系统和数字轨迹地图功能，让车主可以通过应用程序计划、记录和分享他们的经历。\n虽然对野马的反应是令人愉快的，但也有一些竞争对手的目标是赢得客户。通用汽车本周发布了一段视频，调侃其全电动GMC悍马。虽然这段视频是流行语的宣传混搭，但它也显示，通用汽车已经明确将福特野马(Ford Bronco)和特斯拉(Tesla)CyberTruck确定为主要竞争对手。然后是电动新贵Rivian，该公司计划在2021年开始生产其电动皮卡和SUV。", "note_en": "More than  150,000 customers have plunked down $100 to reserve a spot to order one of the vehicles, according to Ford.\n “We think this family of vehicles has big upside potential in the growing off-road category and this is a category with a leading OEM has not been seriously challenged until now,” Hackett said.\n  These are, of course, mere reservations, not actual orders. The deposits are refundable. Now, Ford is focused on the due diligence required to determine how many of these reservations will be converted to orders as it lay outs its manufacturing strategy for the brand.\n The Ford Bronco 2 and Bronco 4 will be built at Michigan Assembly Plant in Wayne, Michigan. The Bronco Sport will be assembled at plant in Mexico. The company is now determining how many shifts to staff at each factory in order to match actual orders.\n “There’s still a lot of work to do,” Ford COO Jim Farley said in a call with analysts Thursday. “But the mix is great.”\n The Bronco is a brand that leans heavily on nostalgia, customization, functional design and technology, such as the automaker’s next-generation infotainment system and a digital trail mapping feature that lets owners plan, record and share their experiences via an app.\n While the response to the Bronco has been palatable, there are a number of competitors also aiming to win over customers. GM released a video this week teasing its  all-electric GMC Hummer. While the video was a promotional mashup of buzzwords, it also showed that GM had clearly identified Ford Bronco and  Tesla Cybertruck as its main competitors. Then there’s electric upstart Rivian, which plans to start production of its EV pickup and SUV in 2021.", "posttime": "2020-07-31 09:22:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "福特,野马,bronco", "title": "\n福特野马预订量超过15万辆", "title_en": "\n\t\t\t\tFord Bronco reservations surpass 150,000\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/30/ford-bronco-reservations-surpass-150000/", "via": "", "real_tags": ["福特", "野马", "bronco"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015346, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "需要你的机器所能提供的每一盎司电力吗？无需关闭浏览器。GX Control允许您设置浏览器占用的RAM和CPU使用量限制。\n您可以使用所需的任何颜色自定义浏览器，并从不同的特效和主题中进行选择。\n永远不要错过现场直播。Twitch就在你的侧边栏中，你可以很容易地看到你关注的频道，谁在线，并选择在你关注的人上线时接收通知。\n在一个方便访问的地方，随时了解最优惠的交易、最新发布的产品和最新的游戏新闻。", "note_en": "Need every ounce of power your machine can give you? No need to close your browser. GX Control lets you set limits on how much RAM and CPU usage your browser will take up.\n  You can customize your browser with any color you want and choose from different special effects and themes.\n  Never miss a live stream. With Twitch right in your sidebar, you can easily see channels you follow, who&#39;s online, and choose to receive notifications whenever someone you follow goes live.\n  Stay up-to-date with the best deals, the newest releases, and breaking gaming news all in one easily accessible place.", "posttime": "2020-07-31 09:20:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,gx,关注", "title": "Opera GX游戏浏览器", "title_en": "Opera GX Gaming Browser", "transed": 1, "url": "https://www.opera.com/lp/gx-light", "via": "", "real_tags": ["游戏", "gx", "关注"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015345, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "图1。(A)CurveBoards是直接集成到物理对象表面的3D面包板。(B)CurveBoards既提供了电路板的高电路流动性，又保持了原型的外观和手感。曲线板是集成到物理对象中的面包板。与传统的面板相比，CurveBoards在保持高电路流动性的同时更好地保留了对象的外观和手感，这使得设计者能够在设计迭代期间交换和重新定位元件。由于CurveBoards功能齐全，即屏幕显示内容，按钮接受用户输入，因此设计人员可以在物理原型上测试交互场景和记录交互数据，同时仍可以根据需要更改组件布局和电路设计。我们提供了一个交互式编辑器，使用户能够将3D模型转换为CurveBoards，并讨论我们制作CurveBoard原型的制造技术。我们还对CurveBoard的导电性和耐久性进行了技术评估，并总结了非正式的用户反馈。导言面包板在早期电路原型中被广泛使用，因为它们使用户能够快速试用不同的元件并改变它们之间的连接[23]。虽然电路板为电路建设提供了极大的支持，但当电路必须在物理原型上进行测试时，它们很难使用。因为面包板是盒状的，所以当连接到它上面时，它们会扭曲原型的外观和手感，并且可能会干扰测试期间的用户交互。此外，它们还限制了可以在原型上放置电子元件的位置，因为用于电路构建的区域仅限于电路板的大小。更好地保留原型外观的一个工作流程是将组件焊接到原板上或制造PCB。但是，这要求设计者放弃电路流动性，因为所有组件都已固定到位。如果没有额外的焊接，就不能再尝试不同的组件并更改它们之间的连接。替代方法，如将元件贴到原型上，提供了更大的灵活性；但是，它们使设计人员难以更换和重新布线部件，并且不能提供与电路板相同的电路构建支持。在这篇文章中，我们提出了一种新的电子原型技术，称为曲线板，它将面板的结构嵌入到物理原型的表面(图1)。与传统的面板相比，CurveBoards在保持高电路流动性的同时更好地保留了对象的外观和手感，这使得设计者能够在设计迭代期间交换和重新定位元件。由于CurveBoards功能齐全，即屏幕显示内容，按钮接受用户输入，因此设计人员可以在物理原型上测试交互场景和记录交互数据，同时仍可以根据需要更改组件布局和电路设计。CurveBoards被认为不会取代现有的技术，如面包板或PCB，而是为早期的交互式设备实验提供了一种额外的原型技术。当设计人员已经测试了基本的电子功能并在下一步想要进行交互设计时，CurveBoards在中保真原型制作期间工作得特别好，即将电子部件集成到原型表单的上下文中，作为交互设计实践的一部分[26]。总之，我们的贡献是：演示它在不同应用场景中的适用性&以五个交互原型为例说明对象几何。\n用于将3D模型转换为CurveBoards的交互式编辑器，包括通道布局的不同选项。\n一种以3D打印为外壳、导电性硅胶为通道的曲线板制造方法。\n一种给定三维模型特定曲率的针孔和通道自动生成算法。\n讨论我们方法的扩展，包括使用曲线板模板和灵活的电子设备。\n在本文的其余部分，我们将首先回顾电子原型工具的相关工作，然后按顺序讨论上面列出的每一项贡献。CurveBOARDS CurveBoards的主要优点是，它们允许设计者直接在原型的物理形状上下文中迭代原型的交互设计。使用CurveBoards，设计人员可以快速交换和重新定位原型表面上的组件。重新布线后，原型功能完全正常，即CurveBoard上的屏幕显示内容，按钮接受用户输入。通过使设计者能够直接在物理原型上制作电子电路原型，CurveBoards特别适用于：(1)寻找符合人体工程学的\n下面，我们将介绍我们根据经验确定的最适合填充曲线板的混合程序。为了制造导电有机硅，我们首先将10g的短切碳纤维(0.7 mm长，Procotex[4]的直径7μm)与3毫升异丙醇混合。在搅拌和分散纤维毛发后，我们将它们混合到100克普通双组分硅酮(类型：光滑分类-透明37透明[34])中，搅拌5分钟(图12a/b)。碳硅比为5wt%，加入等量的B部分。如果没有B部分，导电硅胶将不会开始固化，也就是说，我们可以将A部分+碳纤维的混合物放在货架上，如果用盖子储存的话，可以使用几天。一旦我们准备好使用硅胶，我们就向混合物中加入100克B部分(光滑的透明37度)(图12c)，这将开始固化。搅拌5分钟后，我们将导电硅胶转移到注射器(3ml，带16号钝头锥形分配针)(图12d)。这个SY。\n.", "note_en": "Figure 1. (a) CurveBoards are 3D breadboards directly integrated into the surface of physical objects. (b) CurveBoards offer both the high circuit fluidity of breadboards, while maintaining the look and feel of prototypes.\t\t    \t\tCurveBoards are breadboards integrated into physical objects. In contrast to traditional breadboards, CurveBoards better preserve the object’s look and feel while maintaining high circuit fluidity, which enables designers to exchange and reposition components during design iteration.\t\t   \t\tSince CurveBoards are fully functional, i.e., the screens are displaying content and the buttons take user input, designers can test interactive scenarios and log interaction data on the physical prototype while still being able to make changes to the component layout and circuit design as needed.\t\t   \t\tWe present an interactive editor that enables users to convert 3D models into CurveBoards and discuss our fabrication technique for making CurveBoard prototypes. We also provide a technical evaluation of CurveBoard’s conductivity and durability and summarize informal user feedback.\t\t     \t\tIntroduction\t\t    \t\tBreadboards are widely used in early-stage circuit prototyping since they enable users to rapidly try out different components and to change the connections between them [23].\t\t   \t\tWhile breadboards offer great support for circuit construction, they are difficult to use when circuits have to be tested on a physical prototype. Since breadboards are box-like shapes, they distort the look and feel of the prototype when attached onto it and can interfere with user interaction during testing. In addition, they limit where electronic components can be placed on the prototype since the area for circuit construction is limited to the size of the breadboard.\t\t   \t\tOne workflow to better preserve the look and feel of the prototype is to solder components onto a protoboard or to fabricate a PCB. However, this requires designers to give up circuit fluidity since all components are fixed in place. Trying out different components and changing connections between them can no longer be done without additional soldering. Alternative methods, such as taping the components onto the prototype, offer more flexibility; however, they make it difficult for designers to exchange and rewire parts and do not offer the same circuit building support as breadboards.\t\t   \t\tIn this paper, we present a new electronic prototyping technique called CurveBoard that embeds the structure of abreadboard into the surface of a physical prototype (Figure 1). In contrast to traditional breadboards, CurveBoards better preserve the object’s look and feel while maintaining high circuit fluidity, which enables designers to exchange and reposition components during design iteration.\t\t   \t\tSince CurveBoards are fully functional, i.e., the screens are displaying content and the buttons take user input, designers can user test interactive scenarios and log interaction data on the physical prototype while still being able to make changes to the component layout and circuit design as needed.\t\t   \t\tCurveBoards are not thought to replace existing techniques, such as breadboards or PCBs, but rather provide an additional prototyping technique for early stage interactive device experimentation. CurveBoards work particularly well during mid-fidelity prototyping when designers have already tested basic electronic functionality and in a next step want to work on the interaction design, i.e. integrate electronic parts within the context of a prototype form as part of interactive design practice [26].\t\t   \t\tIn summary, we contribute:\t\t a demonstration of its applicability across different application scenarios &amp; object geometries at the example of five interactive prototypes\n  an interactive editor for converting 3D models into CurveBoards including different options for the channel layout\n  a fabrication method for CurveBoards that uses 3D printing for the housing and conductive silicone for channels\n      an algorithm for automatic pinhole and channel generation given the specific curvature of a 3D model\n  a discussion of extensions of our approach, including the use of CurveBoard templates and flexible electronics\n\t\tIn the remainder of the paper, we will first review the related work on electronic prototyping tools and then discuss each of the contributions listed above in order.\t\t     \t\tCURVEBOARDS\t\t    \t\tThe main benefit of CurveBoards is that they allow designers to iterate on the interaction design of a prototype directly in the context of its physical shape. Using CurveBoards, designers can quickly exchange and reposition components on the prototype’s surface. Once rewired, the prototype is fully functional, i.e. screens on a CurveBoard display content and buttons take user input.\t\t   \t\tBy enabling designers to prototype electronic circuits directly on a physical prototype, CurveBoards are particularly suitable for: (1) finding ergonomic and efficient component layouts, (2) ensuring that the components fit onto the physical prototype, (3) preserving a prototype’s look and feel while iterating on a visual design, (4) preserving an object’s intended function while testing a circuit, and (5) identifying component needs based on the prototype’s form factor.\t\t   \t\tIn the next section, we illustrate each of these use cases at the example of prototyping an interactive device.\t\t      #1 Finding Efficient and Ergonomic Component Layouts \t\tFor interactive devices, the placement of I/O components plays an important role in achieving efficient and ergonomic interaction. The design of wearables is particularly challenging since I/O components have to be placed with respect to the user’s body and the way the wearable device is worn.\t\t   \t\tFigure 2 shows this at the example of headphones with built-in speakers and music streaming capabilities, for which we explore the placement and type of menu controls to optimize for user’s arm reach and ability to distinguish controls.\t\t   \t\tOur initial version of the prototype had the volume controls on the side of the user’s dominant hand and the playlist controls on the non-dominant hand. After analyzing the logged interaction data recorded on the micro-controller over the course of a day, we realize that the playlist controls are being used more often than the volume controls. We therefore move the playlist controls to the side of the dominant hand.\t\t   \t\tIn addition, users informed us that it was difficult to distinguish between the volume and channel controls since they both used press input with similar button sizes. To avoid wrong user input, we replaced the volume buttons with a dial.\t\t         \t\tFigure 2. Finding efficient and ergonomic I/O layouts for a pair of headphones.\t\t       #2 Ensuring that Components Fit onto the Prototype \t\tWhen prototyping on a traditional breadboard, it is difficult for designers to estimate if all components will later fit onto the physical prototype. A physical design, especially when small or filigree, can limit which types of interactive components can be used and where they can be placed, which is an important part of interaction design.\t\t   \t\tFigure 3 shows this at the example of an interactive bracelet with display and button for menu control, a photoresistor and LED for heart rate monitoring, and an IMU for step counting. While prototyping directly on the bracelet, we notice that the large display that we initially selected does not fit on the slender bridges of bracelet, we thus exchange it for two smaller ones. After testing different button sizes on the bracelet prototype ranging from 2.3mm to 16mm, we find that the 7mm button fits best while providing the largest interactive space among other different options. We next add the LED and photoresistor and make sure they can be positioned together and offer enough space for users to place their finger. Finally, we exchange the wider IMU with a slimmer one, and replace the larger microcontrollers with two smaller ones.\t\t   \t\tWhile some components, like micro-controllers, can be made more compact in later design iterations via custom PCBs, user-facing I/O components (buttons, displays) will be similar in size since they relate to user’s physical characteristics, such as finger sizes and what the human eye can see.\t\t         \t\tFigure 3. Upon the available space on the prototype, we iterate designs with the exchange of large OLED display with two smaller ones, and add selected push button &amp; DIP LED.\t\t       #3 Preserving “Look” and “Feel” \t\tWhen prototyping visual designs, such as a piece of interactive jewelry, it is difficult for designers to get a sense of the overall look and feel when using a breadboard that significantly distorts the prototype’s shape. CurveBoards, in contrast, allow designers to integrate the components directly on the prototype’s surface, which better preserves the shape..\t\t         \t\tFigure 4. The look and feel of this interactive ring is preserved since the pinholes are directly integrated into its geometry.\t\t    \t\tFigure 4 shows this at the example of an interactive ring for which we iterate on the placement of LEDs. Since in our CurveBoard the pinholes form a part of the object geometry, no additional space is needed for them. We try different LED arrangements and based on how the ring looks on our hand, we decide to use multiple LEDs in a row rather than side by side. Note that while CurveBoard better preserved the shape, the pinholes are still visible and impact overall aesthetics.\t\t      #4 Preserving an Object’s Intended Function \t\tTraditional breadboards add volume to an interactive object, which can hinder its intended function. For instance, a frisbee may not fly anymore since its shape is no longer aerodynamic, a ring may no longer fit on a user’s hand, and a teapot may not be able to hold the same amount of liquid inside.\t\t   \t\tFigure 5 shows this in more detail with the example of an interactive frisbee that displays a light pattern when thrown. Prototyping this frisbee with a breadboard attached to its surface would make the frisbee dysfunctional, i.e. it would not fly anymore. CurveBoard, in contrast, preserves the shape of the frisbee and thus its function. Our frisbee design initially contained a microcontroller and an IMU for sensing when the frisbee is in motion. We then iterated on different LED layouts until we settled on the one shown in Figure 5b.\t\t         \t\tFigure 5. CurveBoard keeps this frisbee functional, which allows us to test the appearance of different light patterns: (a) circular design, and (b) POV “CHI” design when thrown.\t\t       #5 Identifying Component Needs \t\tBrainstorming interactive functionality without considering the physical form can be challenging for a designer, who is left with an abstract circuit on a breadboard. The direct, hands-on interaction with a prototype, in contrast, supports exploration, which enhances creativity and can help designers to envision interactive workflows and to identify the components needed to realize them [28]. In addition, since certain object geometries can affect component placement (e.g., high curvature may prevent access to movable elements like knobs or sliders [12]), brainstorming in the context of shape also allows to take such challenges into account.\t\t   \t\tFigure 6 shows this via the Utah teapot example for which we want to visualize its inside liquid temperature. After trying different display and temperature components on the teapot, we realize that the temperature is also needed for the teapot handle as an indicator to show if it is safe to hold. Since the tea handle is too small for another OLED display, we instead add one RGB LED onto the handle that displays either red or blue color to indicate the hot/cold. Later on, we decide to add a camera module on the inside of the lid to detect the tea concentration so that we know exactly when the brewed tea reaches the best saturation based on our preferences.\t\t         \t\tFigure 6. Here we brainstorm interactive functionality for the Utah teapot: (a) camera and display to monitor tea shade, and (b) LED and display to indicate temperature.\t\t      \t\tINTERACTIVE EDITOR FOR CREATING CURVEBOARDS\t\t    \t\tTo support designers in creating CurveBoards from their digital prototype designs, we developed an interactive editor. After loading the 3D model of the prototype, our editor first generates the pinholes across the model’s surface. Next, designers connect the pinholes into a desired channel layout using either the automatic or manual layout tools. Once the layout is completed, our editor automatically generates the channel geometry and provides the fabrication files.\t\t         \t\tFigure 7. (a) CurveBoards interactive editor UI, (b) Example of a generated pinhole pattern.\t\t       #1 Converting the 3D Model into a Set of Pinholes \t\tDesigners start by loading a 3D model into the CurveBoard editor. Next, designers click the ‘generate pinholes’ button, which creates the characteristic pinhole pattern across the surface of the board (Figure 7).\t\t      #2 Creating the Board Layout \t\tNext, designers create the board layout, i.e. define how to connect the pinholes into power and terminal lines. Similar to 2D breadboards that have a fixed row and column layout that cannot be modified dynamically, CurveBoards are also subject to this limitation once the board is fabricated. However, besides the standard breadboard layout that the CurveBoard editor can generate automatically, designers can also modify the layout manually depending on their prototyping needs, or for maximum flexibility leave all pinholes on the board disconnected, effectively creating a Curve-Protoboard.\t\t     Automatic Channel Layout:  This method automatically generates a default breadboard layout across the surface of the 3D model. It requires minimal effort from the designer but also pre-defines how components can be placed (Figure 8a). Users can explore different versions of the automatic layout with different channel orientations on the object geometry by pressing “Generate Board Layout” button multiple times.\t\t         \t\tFigure 8. (a) Automatic layout, (b) manual layout.\t\t      Manual Channel Layout:  Alternatively, designers can customize the automatic layout or create a new manual layout from scratch using the interactive tools for terminal and power line creation. Designers only have to select a set of pinholes and then indicate the desired type of connection using the corresponding button. This provides designers with more freedom in how to route the channels but comes at the expense of additional manual effort (Figure 8b).\t\t     No Channel Connections (Curve-ProtoBoard):  Finally, designers also have the choice to leave all pinholes disconnected, effectively creating a Curve-Protoboard. The holes for a Curve-Protoboard are bigger in diameter (1mm vs. ~0.3mm for Curveboards) and fit both a component’s header pin and a wire. While this provides maximum flexibility, it requires additional wiring while prototyping.\t\t      #3 Export &amp; Fabrication \t\tOnce designers hit the ‘export’ button, the CurveBoard editor generates the final CurveBoard geometry containing all the pinholes and connection channels underneath the CurveBoard’s surface (Figure 9). The CurveBoard editor then exports the geometry as an .stl file for 3D printing.\t\t         \t\tFigure 9. Generated 3D printable file: (a) in render mode, and (b) in transparent ‘ghost’ mode.\t\t      \t\tFABRICATION METHOD OF CURVEBOARDS\t\t    \t\tIn the next section, we describe the fabrication technique used for CurveBoards and provide details on the material preparation and mixing procedure.\t\t      Dual Material 3D Printing with Conductive Rubber \t\tOur initial goal was to use dual-material 3D printing to fabricate CurveBoards, with one rigid non-conductive material used for the housing and a deformable conductive material (e.g., conductive rubber) used for the channels to facilitate repeated plugging of components.\t\t   \t\tSince dual-material 3D printing with conductive rubber is still an experimental fabrication technique, we used the external printing services from ACEO, which is the only company we found to offer this type of fabrication (materials: ACEO Silicone GP White for the housing, and ACEO Silicone EC for the conductive rubber, Shore Hardness 30 A).\t\t   \t\tWe developed a range of 3D printed object geometries to test with their printing service, including different channel widths ranging from 0.6-1.5mm. However, we found that even the best of our prototypes still had a resistance of 1.4k ohm per channel (6-hole length). Thus, while the resistance was good enough to light up an LED (see Figure 10 for the 3D printed result), it was not conductive enough to work with other standard electronic I/O components. In addition, the maximum volume currently supported by the 3D printer is 200 cm3, with resolution ~1 mm to achieve reliable prints. Therefore, we conclude that dual-material 3D printing it is not yet suitable for fabricating CurveBoards.\t\t         \t\tFigure 10. (a) Dual-material silicone 3D printed CurveBoard, and (b) with SMD LED connected.\t\t       3D Print Housing + Fill with Conductive Silicone \t\tTo address this issue, we developed a fabrication technique based on 3D printing the housing and filling the channels with conductive silicone (Figure 11). It enables high conductivity at the expense of additional manual effort (filling the channels for a CurveBoard takes between 15-30min based on our experience building the prototypes for this paper).\t\t         \t\tFigure 11. (a) 3D printing the CurveBoard housing. (b) Filling the hollow channels with conductive silicone.\t\t    \t\tWe next provide more details on both the 3D printing process and the task of filling the channels with conductive silicone.\t\t     3D Printing: For 3D printing, we used FDM 3D printers and printed on both the Ultimaker 3 and Prusa i3 MK2. We tried layer heights from 0.1mm-0.2mm and found that all created CurveBoard housings with channels that were suitable for filling them with conductive silicone. The prototypes in this paper were printed with a layer height of 0.15mm.\t\t     Conductive Silicone for Channels:  To find a material mix that is both conductive and easy to extrude, we tested a range of different carbon fiber lengths, carbon-silicone ratios, and needle sizes.\t\t   Carbon fiber length:  The longer the carbon fibers are the more conductive the mixture is but the harder to extrude. We tried fibers ranging from 0.5mm to 2.5mm.\n  Carbon-Silicone ratios:  A higher carbon amount increases conductivity but makes the mixture harder to extrude. We tried ratios ranging from 3% to 10% carbon.\n  Needle size:  The larger the needle size, the easier it is to extrude the mixture but the more difficult it is to insert the needle into a pinhole. We tried needle sizes ranging from 20G (0.6mm) to 14G (1.55mm).\n    \t\tBelow, we describe the mixing procedure that we empirically determined to work best for filling CurveBoards.\t\t   \t\tTo create the conductive silicone, we first mixed 10g of chopped carbon fiber (0.7mm long, 7 μm diameter from Procotex [4]) with 3ml of isopropyl alcohol. After stirring and dispersing the fiber hairs, we mix them into 100g part A of a regular two-component silicone (type:  Smooth-On SORTA-Clear 37 Clear [34]) and stir for 5 minutes (Figure 12a/b). The carbon-silicone ratio is 5wt%, with same amount of part B added. Without part B, the conductive silicone will not start curing, i.e. we can keep the mix of part A + carbon fiber on the shelve to use over several days if stored covered.\t\t   \t\tOnce we are ready to use the silicone, we add 100g of part B ( Smooth-On SORTA-Clear 37 Clear) to the mix (Figure 12c), which initiates curing. After stirring for 5 minutes, we transfer the conductive silicone to a syringe (3ml, with 16-gauge blunt tip tapered dispensing needle) (Figure 12d).\t\t   \t\tThe sy\n......", "posttime": "2020-07-31 09:20:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "物理,integrating,原型", "title": "CurveBoards：将面包板集成到物理对象中", "title_en": "CurveBoards: Integrating Breadboards into Physical Objects", "transed": 1, "url": "https://hcie.csail.mit.edu/research/curveboard/curveboard.html", "via": "", "real_tags": ["物理", "原型"]}]