[{"category": "", "categoryclass": "", "imagename": "201c08d2ea80aaab34326c785f426c5c.png", "infoid": 1066354, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "EARFER是一种免费和开放的标准，具有现成的SDK，可提供伟大的用户体验，在设备上配置Wi-Fi。\n 随着改进创造者可以在与他人分享他们的创作时提供更好的船上体验：\n  EXPLECATIONIONING也适用于支持WebBluetooth的浏览器。不支持您的浏览器。要尝试，请使用Google Chrome或Microsoft Edge访问此页面（但不在iOS设备上）访问此页面。\n        许多设备需要连接到网络或接收数据。这些设备的大多数使用Wi-Fi与本地应用程序或云建立连接。\n 配置设备连接到Wi-Fi是一种痛苦。最常见的方法是软启用的接入点。该设备启动其自己的Wi-Fi接入点，用户使用手机/计算机连接到它，然后通过应用程序或设备服务的网站直接与设备进行交互。\n 事情很容易出错。用户提交不正确的Wi-Fi凭据或手机丢失对接入点的访问。在这种情况下，难以恢复。手机也有糟糕的时间处理不提供互联网接入的接入点。\n  标准的目标是通过蓝牙低能量（BLE）将设备连接到Wi-Fi。提供设备共享数据或控制的方法不是目标。标准应在不需要设备包含屏幕的情况下工作。 ", "note_en": "Improv is a free and open standard with ready-made SDKs that offer a great user experience to configure Wi-Fi on devices.\n With Improv creators can offer a better onboarding experience when they share their creations with others:\n  Improv provisioning also works in browsers that support WebBluetooth.     Your browser is not supported. To try it out, visit this page with Google Chrome or Microsoft Edge  (but not on your iOS device).\n        A lot of devices require to be connected to the network to be controlled or receive data. The majority of these devices use Wi-Fi to establish a connection with a local application or the cloud.\n Configuring a device to connect to your Wi-Fi is a pain. The most common approach is Soft Enabled Access Point. The device starts its own Wi-Fi access point, the user connects to it with their phone/computer and then interacts directly with the device via an app or a website served from the device.\n It’s easy for something to go wrong. The user submits incorrect Wi-Fi credentials or the phone loses access to the access point. In such cases it is difficult to recover. Phones also have a bad time dealing with access points that don’t provide internet access.\n  The goal of the standard is to get the device connected to the Wi-Fi via Bluetooth Low Energy (BLE). It is not the goal to offer a way for devices to share data or control. The standard should work without requiring the device to contain a screen.", "posttime": "2021-06-17 09:01:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "蓝牙,wi,设备", "title": "通过蓝牙le，GENT Wi-Fi：开放标准设置Wi-Fi ", "title_en": "Improv Wi-Fi: Open Standard for Setting Up Wi-Fi via Bluetooth LE", "transed": 1, "url": "https://www.improv-wifi.com/", "via": "", "real_tags": ["蓝牙", "wi", "设备"]}, {"category": "", "categoryclass": "", "imagename": "fe13daf19b993d1190971ace7e58b83f.jpg", "infoid": 1066353, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2018年通过的欧洲联盟＆＃39;常规数据保护条例（GDPR）需要网站在放置饼干之前要求访客同意。由于任何互联网用户现在都意识到，这意味着在每次第一次或潜在的时候访问几乎任何网站时所需的额外步骤，如果您选择不接受cookie。来自您的企业和可持续计算实验室的新提出的HTTP标准将允许用户在浏览器本身内部设置其隐私首选项，并且浏览器与用户访问的任何网站无形地将这些偏好通信。\n  所提出的标准启用了两种自动偏好传递方法 - 其中直接与托管访问的网站的Web服务器通信，另一个与网站本身通信。\n 当ADPC直接与Web服务器通信时，它通过HTTP标头 - 将链路标头指向服务器上的JSON文件，用户＆＃39浏览器发出的ADPC标题。当与网站本身通信时，该机制通过JavaScript  - 配置将作为对象传递给DOM接口，例如Navigator.DataProtectionControl.request（...）。\n 在任何一种情况下，用户＆＃39; s的隐私首选项将传送到网站或服务器作为他们同意的请求标识符列表。此列表是在ADPC标题中发送的，以获取基于HTTP的方法，并作为JavaScript方法中DOM接口的最终返回值。\n    虽然这两个机制都以类似的方式实现了相同的目标，但有很多原因支持两者。基于HTTP的方法可能更有效 - 但它显然需要新版本的Web服务器应用程序，该网页服务器应用程序明确地支持它（或者至少是新的可插拔模块，就像支持它们的Apache等服务器的情况下）。同时，基于JavaScript的机制在没有任何特殊的Web服务器配置的情况下 - 但它为拒绝启用Javascript的用户而赢得＆＃39;\n  JSON文件位于网站的核心＆＃39; adpc的末端，无论是使用HTTP或JavaScript机制到达它。该同意文件将看起来像这样：\n {\r ＆＃34;同意咨询＆＃34 ;: {\r ＆＃34; cookie＆＃34 ;:＆＃34;存储和/或访问您的设备上的cookie。＆＃34 ;,\r ＆＃34; ADS_Profiming＆＃34 ;:＆＃34;创建一个个性化的广告配置文件。＆＃34;\r }\r} \n在基于HTTP的ADPC中，WebServer将直接链接到同意文件，以其对HTTP获取的响应：\n  当Web浏览器检测到此链接时，它可以通过先前用户配置的设置响应或通过弹出对话框请求从用户的答案（最有可能，从浏览器＆＃39生成一个锁定按钮）。一旦用户相应地设置了他们的偏好，浏览器在将来的HTTP GET请求上包含一个ADPC头：\n  在上面的示例中，我们看到类似于网络防火墙在网络防火墙上看到的配置：默认拒绝以撤回= *，通过特定接受cookie覆盖。因此，对于我们想要设置cookie并创建广告配置文件的网站，授予Cookie请求（允许存储，例如用户身份验证和个人设置），但拒绝广告配置文件。\n ADPC方案的另一个好处是用户与自己的浏览器交互，无论网站如何，都有一致的UI。另一个好处是用户可以为用户设置持久的偏好而不需要允许cookie  - 这是一个必须通过嵌入网页本身嵌入的横幅询问同意的东西的东西。\n    最后，Cookie横幅可能经常在我们的测试中显示，流行的广告阻挡插件阻止了许多饼干横幅的显示，包括但不限于监护人＆＃39; s。这种阻塞可能是由于由过于激进的块规则或故意最小化的抵消损坏，以最小化＆＃34;点击疲劳。＆＃34;在任何一种情况下，他们都可以防止用户直接表达同意或拒绝与隐私相关的问题。\n  重要的是意识到ADPC不是强制执行用户的机制＆＃39; s的隐私权概况 - 它只是一种符合欧盟遵守欧盟的正常化方式＆＃39; s gdpr和类似的方式其他地方的隐私法。\n 无论如何，无论如何，没有任何假设的ADPC标准的网站要求为用户创建一个广告配置文件，然后拒绝，然后创建该配置文件。但是，合法的网站可以要求同意更加机器可读，一致，较少的用户疲劳方式。 \nadpc仍然帮助用户处理忽略他们的用户的阴暗网站＆＃39; 偏好 - 在GDPR或其他诉讼，用户＆＃39; 偏好更有可能从自己的系统中记录和读取。 如果用户拒绝通过cookie横幅接受任何cookie，则无法保存它们所表达的首选项，并记录 - 但是ADPC首选项将是。  即使用户与cookie横幅交互接受cookie（但禁用广告分析），那种cookie也更有可能被误解＆＃34;清洁＆＃34; 由用户自己。 那和＃34;清洁＆＃34; 可以在寻求维护隐私甚至解决常见网站的问题。 由于ADPC偏好仅适用于在隐私问题上表达或拒绝同意 - 以来，因此他们被摧毁的原因要少得多。 ", "note_en": "The European Union&#39;s General Data Protection Regulation ( GDPR), passed in 2018, requires websites to ask visitors for consent prior to placing cookies. As any Internet user is now aware, this means an extra step required when visiting nearly any website for the first time—or potentially  every time, if you choose not to accept cookies. A new proposed HTTP standard from  None of Your Business and the  Sustainable Computing Lab would allow the user to set their privacy preferences  once, inside the browser itself, and have the browser communicate those preferences invisibly with any website the user visits.\n  The proposed standard enables two methods of automated preference delivery—one which communicates directly with the web server hosting a site being visited, and another which communicates with the website itself.\n When  ADPC communicates directly with the web server, it does so via HTTP headers—a Link header pointing to a JSON file on the server, and the ADPC header emitted by the user&#39;s browser. When communicating with the website itself, the mechanism is via JavaScript— configuration is passed as an object to the DOM interface, e.g.,  navigator.dataProtectionControl.request(...).\n In either case, the user&#39;s privacy preferences are communicated to the website or server as a list of request identifiers they consent to. This list is sent in ADPC headers for the HTTP-based approach and as the final return value of the DOM interface in the JavaScript approach.\n    Although both mechanisms accomplish the same goal in similar fashions, there are plenty of reasons to support both. The HTTP-based approach is probably more efficient—but it obviously would require new versions of web server applications which explicitly support it (or at least, new pluggable modules in the case of servers like Apache which support them). Meanwhile, the JavaScript-based mechanism works without any special web server configuration necessary—but it won&#39;t work for users who refuse to enable JavaScript.\n  A JSON file is at the heart of the website&#39;s end of ADPC, whether using HTTP or Javascript mechanisms to reach it. That consent file will look something like this:\n {\r &#34;consentRequests&#34;: {\r &#34;cookies&#34;: &#34;Store and/or access cookies on your device.&#34;,\r &#34;ads_profiling&#34;: &#34;Create a personalised ads profile.&#34;\r }\r}\n In HTTP-based ADPC, the webserver links to the consent file directly in its response to an HTTP GET:\n  When the web browser detects this link, it can either respond with previously user-configured settings or request an answer from the user via a pop-up dialog (most likely, one spawned from the browser&#39;s lock button). Once the user has set their preferences accordingly, the browser includes an ADPC header on future HTTP GET requests:\n  In the above example, we see a configuration similar to what one might see on a network firewall: a default DENY in the form of  withdraw=*, overridden by a specific acceptance of  cookies. So for our website which wanted both to set cookies and create an advertising profile, the cookie request is granted (allowing storage of, e.g., user authentication and personal settings), but advertising profile is denied.\n Another benefit of the ADPC scheme is that the user is interacting with their own browser, with consistent UI regardless of website. Another benefit is that it&#39;s possible for the user to set persistent preferences for a site without needing to allow cookies—something which isn&#39;t possible for a website which must ask for consent via a banner embedded in the webpage itself.\n    Finally, cookie banners may frequently not be displayed at all—in our testing, popular ad-blocking plugins blocked the display of many cookie banners, including but not limited to  The Guardian&#39;s. Such blocking can be due to collateral damage caused by overly aggressive block rules or deliberate attempts to minimize &#34;click fatigue.&#34; In either case, they prevent the user from directly expressing consent or refusal to privacy-related issues.\n  It&#39;s important to realize that ADPC is not a mechanism for enforcing a user&#39;s privacy profile—it&#39;s simply a normalized way of requesting it in compliance with the European Union&#39;s GDPR and similar privacy laws elsewhere.\n Nothing technically prevents a hypothetical ADPC-compliant website from requesting permission to create an advertising profile for a user, being denied, and then creating that profile anyway. But legitimate sites can request consent in a more machine-readable, consistent, and less user-fatiguing way.\n ADPC does still assist users in dealing with shady sites that ignore their users&#39; preferences—in the event of a GDPR or other lawsuit, users&#39; preferences are more likely to be logged and readable from their own systems. If a user refuses to accept any cookies via a cookie banner, their expressed preference cannot be saved and logged—but ADPC preferences will be.\n Even if a user interacting with a cookie banner accepts cookies (but disables ad profiling), that cookie is much more likely to be mistakenly &#34;cleaned&#34; by the user themselves. That &#34;cleaning&#34; could be in the quest to maintain privacy or even fix problems with frequently visited websites. Since ADPC preferences are only good for that one thing—expressing or refusing consent on privacy issues—there is much less reason for them to be destroyed.", "posttime": "2021-06-17 08:24:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "规范,spec", "title": "一个新的HTTP规范建议消除令人讨厌的“饼干横幅” ", "title_en": "A new HTTP spec proposes elimination of obnoxious “cookie banners”", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/06/tired-of-accepting-rejecting-cookies-adpc-wants-to-automate-the-process/", "via": "", "real_tags": ["规范", "spec"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066352, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创建帐号 ", "note_en": "Create\t\t\t\t\t\t\t\t\t\t\tAccount", "posttime": "2021-06-17 08:16:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,eating,创建", "title": "软件如何吃汽车 ", "title_en": "How Software Is Eating the Car", "transed": 1, "url": "https://spectrum.ieee.org/cars-that-think/transportation/advanced-cars/software-eating-car", "via": "", "real_tags": ["软件", "eating", "创建"]}, {"category": "", "categoryclass": "", "imagename": "d7a2c507bfb81011029047a5dded30a7.gif", "infoid": 1066351, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌首席执行官Sundar Pichai上个月预览了一个人工智能模型，他表示将使人们能够拥有技术开放的对话。但是，与语言模型合作的当前和前雇员说，人类和技术之间的一致性，自由流动和准确对话仍然是一个高大的秩序。\n 因此，谷歌正在通过谷歌搜索通过谷歌搜索来教授外语来在会话ai中采取更加渐进的步骤。该项目在内部称为Tivoli，从其谷歌研究单位中延伸，可能会在今年晚些时候推出。\n    周三的字母表的自动驾驶汽车子公司Waymo表示，它从投资者筹集了25亿美元，据熟悉这笔交易的人表示，符合星号：字母表是领先投资者。在硅谷，铅名称通常属于圆形的派对中贡献了一半的总金额。所以字母表CFO Ruth Porat想要确保...... ", "note_en": "Google CEO Sundar Pichai last month previewed an artificial intelligence model that he said would enable people to have open-ended conversations with technology. But current and former employees who have worked with the language model say enabling coherent, free-flowing and accurate dialogue between humans and technology remains a tall order.\n As a result, Google is taking a more incremental step in conversational AI by preparing to teach foreign languages through Google Search, according to people involved in the work. The project, referred to internally as Tivoli, grew out of its Google Research unit and is likely to be rolled out later this year.\n    Alphabet’s self-driving car subsidiary Waymo on Wednesday said it raised $2.5 billion from investors, with an asterisk: Alphabet was the lead investor in the round, according to a person familiar with the deal. In Silicon Valley, the lead designation usually belongs to the party that contributed half of the total amount in the round. So either Alphabet CFO Ruth Porat wanted to make sure...", "posttime": "2021-06-17 08:16:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,开发,表示", "title": "消息来源：谷歌正在开发一个谈论的会话AI产品，内部为Tivoli，旨在通过谷歌搜索教授外语 ", "title_en": "Sources: Google is developing a conversational AI product, known internally as Tivoli, which aims to teach foreign languages through Google Search", "transed": 1, "url": "https://www.theinformation.com/articles/googles-next-ai-move-teaching-foreign-languages", "via": "", "real_tags": ["google", "谷歌", "开发", "表示"]}, {"category": "", "categoryclass": "", "imagename": "c76d17c8d93585fdb4265427a41f46bb.jpg", "infoid": 1066350, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Satya Nadella，Microsoft＆＃39; S CEO，正在成为软件公司和＃39;在运营公司七年后，他取代了史蒂夫鲍尔默。\n 微软周三表示，首席执行官Satya Nadella正在成为公司的主席＆＃39;董事会，取代了独立董事John Thompson，遵循了一定的软件公司＆＃39; S板。\n 这种变化反映了成功的Nadella在过去的七年里，在技术和业务方面都突出了更加突出的。\n  ＆＃34;在这一角色中，Nadella将导致董事会议程的工作，利用他对业务的深刻理解提升正确的战略机会，并确定董事会的主要风险和缓解方法， ＆＃34;微软在一份声明中说。\n 在Nadella＆＃39; Sing Microsoft恢复了世界上最有价值的公共公司的标题。今天它矗立在苹果上的第二个最有价值，微软股票上涨超过600％。\n Nadella＆＃39;微软已更加专注于云计算服务，以电源其他公司和＃39;＆＃39;＆＃39;公司通过收购企业社交网络LinkedIn，源代码共享站点Github和视频游戏开发者Zenimax扩展。\n Microsoft＆＃39; S董事会成员在12月提交的公司提交的Coronavirus Pandemer中为Nadella提供了普拉德斯，为他的领导，公司在2020财年在2020财年下提供了14％的收入增长，即使公司面临广告挑战和其他市场。 ＆＃34;董事会抵免Nadella先生为他的巨大进展推动整个组织的文化变革，特别是考虑到Covid-19对我们的业务和我们的人民的前所未有的影响，＆＃34;微软说。 \nNadella是Microsoft＆＃39; S顶级个人股东之一，拥有超过160万股的公司＆＃39; S股。  在Microsoft及其第一首席执行官的联合创始人之后，举行了一年后的一年，离开了公司＆＃39;董事会。 一家公司发言人表示，盖茨调查了一份报告，盖茨调查了一份报告，盖茨试图与员工开始与员工的亲密关系。  Thompson，以前的赛门铁克首席执行官于2012年加入了Microsoft＆＃39; 2014年以2014年的Microsoft＆＃39;董事会更换了盖茨，同一天Nadella替换了史蒂夫·鲍尔默作为Microsoft CEO。 ", "note_en": "Satya Nadella, Microsoft&#39;s CEO, is becoming the software company&#39;s chair, after running the company for seven years, when he replaced Steve Ballmer.\n Microsoft said Wednesday that CEO Satya Nadella is becoming the chair of the company&#39;s board, replacing independent director John Thompson, following a unanimous vote of the software company&#39;s board.\n The change reflects the success Nadella has had in the past seven years making Microsoft more prominent in technology and business altogether.\n  &#34;In this role, Nadella will lead the work to set the agenda for the board, leveraging his deep understanding of the business to elevate the right strategic opportunities and identify key risks and mitigation approaches for the board&#39;s review,&#34; Microsoft said in a  statement.\n Under Nadella&#39;s watch Microsoft regained the title of world&#39;s most valuable public company. Today it stands as the second most valuable, only behind  Apple, with Microsoft stock having risen more than 600%.\n Nadella&#39;s Microsoft has become more focused on cloud computing services to power other company&#39;s applications, and the company has expanded through acquisitions of business social network LinkedIn, source code-sharing site GitHub and video-game developer Zenimax.\n Microsoft&#39;s board members gave plaudits to Nadella for his leadership during the coronavirus pandemic in  the proxy statement the company filed in December, with the company delivering 14% revenue growth in the 2020 fiscal year, even as the company faced challenges in advertising and other markets. &#34;The board credits Mr. Nadella for his tremendous progress driving cultural change across the organization, especially given the unprecedented impact of Covid-19 on our business and our people,&#34; Microsoft said.\n Nadella is one of Microsoft&#39;s top individual shareholders, with more than 1.6 million shares of the company&#39;s stock.\n  The move came a year after Bill Gates, a co-founder of Microsoft and its first CEO, left the company&#39;s board. Gates stepped down after the board investigated a report that Gates had tried to start an intimate relationship with an employee in 2000,  a company spokesperson said.\n Thompson, formerly CEO of Symantec, joined Microsoft&#39;s board in 2012 and replaced Gates as Microsoft&#39;s chair in 2014, on the same day Nadella replaced Steve Ballmer as the Microsoft CEO.", "posttime": "2021-06-17 08:16:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "微软,microsoft,主席,chair", "title": "微软将首席执行官Satya Nadella命名为董事会主席，取代了2014年担任主席的独立董事John Thompson ", "title_en": "Microsoft has named CEO Satya Nadella as chair of its board, replacing independent director John Thompson who succeeded Bill Gates as chair in 2014", "transed": 1, "url": "https://www.cnbc.com/2021/06/16/microsoft-ceo-satya-nadella-will-also-become-chairman-of-the-board.html", "via": "", "real_tags": ["微软", "microsoft", "主席", "chair"]}, {"category": "", "categoryclass": "", "imagename": "4b5f14c37a4af26c965efa6afa85fafa.png", "infoid": 1066349, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一个地方管理您的所有在线和离线销售，具有单个条纹集成，简化报告和和解，并提供统一的客户视图。终端与条纹付款，连接和计费无缝工作。\n  提供跨频道的无缝客户体验，如在线保留和在商店中拾取。我们的SDK可以轻松将条纹集成到您自己的移动和Web应用程序中，以创建自定义的店内结帐流程。\n  为您的平台或市场添加个人支付。使用带连接的条纹终端，您可以在线和人员支付的用户，并统一跨渠道的支付。\n  使用我们的集中式舰队管理工具轻松管理符合规模的金属物流。订购和Dropship新硬件，远程配置读者，并监控设备状态。\n    摆脱现成的现成软件的限制。条纹终端可以更轻松地建立您的销售点并拥有您的结账体验，包括创建自定义的电子邮件收据或读取器飞溅屏幕。我们的API和SDK将终端集成到JavaScript，iOS和基于Android的销售点应用程序中。\n  const终端= stripeterminal.create（{onfetchconnectionToken：server.fetchconnectiontoken，}）; const结果= await erigent.discoverReaders（）; const reader =结果.discoveredreaders [0]; await erigenter.connectreder（reader）; const项目= {description ：＆＃39;高增长手册＆＃39;，金额：2000，数量：1，}; const cart = {lineItems：[项目]，货币：＆＃39;美元＆＃39;}; erigenter.setReaderDisplay（{类型：＆＃39;购物车＆＃39;购物车}）;\n  使用我们的EMV认证的条纹读卡器省几个月的开发人员和认证时间。它们提供端到端加密，本身支持芯片卡和非接触式支付 - 包括Apple Pay和Google Pay  - 并帮助您保护您免受假冒欺诈的责任。 \n一个带有5英寸触摸屏的智能读者显示混合柜台和手持式使用。\n  从条带仪表板上管理整个条纹卡读卡器，您可以在那里将读卡器分配给物理商店或位置，监控设备状态和订单读卡器。我们将照顾您需要的硬件。\n  终端和连接的组合是市场中强大的集成解决方案，雄心勃勃的平台，以促进其商家的付款。\n  条纹终端对我们来说是一个非常棒的双赢;帮助我们增长我们的收入，同时也让Jobber客户看起来更专业。通过良好的SDK，清晰的文档和响应条纹联系，建立一体化是微风。\n  我们集成了终端，只有三个开发人员的短时间，而不是20或30的团队。\n  阅读案例研究\n  在两周内，我们能够整合终端并开始将其掌握在1,500人的专利手中。这是1,500名小企业，现在正在向内支付，节省自动结构的时间，并通过即时支出将其资金快速获取。 \n条纹终端与预认证的第三方硬件配合使用，以支持一系列使用情况。 我们目前提供两个读者和SDK组合，即将推出。  您所在国家/地区的企业目前可用条纹终端作为测试计划的一部分。 请提供以下信息，我们将更详细地联系。  名字姓氏工作电子邮件公司网站国家国家当前客户关联的电子邮件付款批量付款当前解决方案SDKS其他信息可选  我们最后出了问题。 对于那个很抱歉。 您仍然可以通过sales@stripe.com与我们联系。  我们收到了您的询问。 我们会尽快回复您。 ", "note_en": "Manage all your online and offline sales in one place with a single Stripe integration, simplifying reporting and reconciliation, and providing a unified customer view. Terminal works seamlessly with Stripe Payments, Connect, and Billing.\n  Provide a seamless customer experience across channels, like reserving online and picking up in store. Our SDKs make it easy to integrate Stripe into your own mobile and web applications to create a customized in-store checkout flow.\n  Add in-person payments to your platform or marketplace. Using Stripe Terminal with Connect, you can onboard users for online and in-person payments, and unify their payouts across channels.\n  Easily manage in-person payments logistics at scale with our centralized fleet management tools. Order and dropship new hardware, configure readers remotely, and monitor device status.\n    Break free from the constraints of off-the-shelf point of sale software. Stripe Terminal makes it easier to build your point of sale and own your checkout experience, including creating customized email receipts or reader splash screens. Our APIs and SDKs simplify the integration of Terminal into JavaScript, iOS, and Android-based point of sale applications.\n  const terminal = StripeTerminal.create({ onFetchConnectionToken: server.fetchConnectionToken,});const result = await terminal.discoverReaders();const reader = result.discoveredReaders[0];await terminal.connectReader(reader);const item = { description: &#39;High Growth Handbook&#39;, amount: 2000, quantity: 1,};const cart = { lineItems: [item], currency: &#39;usd&#39;,};terminal.setReaderDisplay({ type: &#39;cart&#39;, cart });\n  Save months of developer and certification time with our EMV-certified Stripe card readers. They provide end-to-end encryption, natively support chip cards and contactless payments—including Apple Pay and Google Pay—and help protect you against liability for counterfeit fraud.\n  A smart reader with a 5” touchscreen display ideal for hybrid countertop and handheld use.\n  Manage your entire fleet of Stripe card readers right from the Stripe Dashboard, where you can assign card readers to physical stores or locations, monitor device statuses, and order card readers. We’ll take care of delivering the hardware where you need it.\n  The combination of Terminal and Connect is a powerful integrated solution in the market for ambitious platforms to facilitate payments for their merchants.\n  Stripe Terminal has been a fantastic win-win for us; helping us grow our revenue while also making Jobber customers look more professional. With a good SDK, clear documentation and a responsive Stripe contact, building the integration was a breeze.\n  We integrated Terminal in only a few sprints with three developers, not a team of 20 or 30.\n  Read the case study\n  In two weeks we were able to integrate Terminal and start getting it in the hands of 1,500 of our Pros. That’s 1,500 small businesses that are now saving money on in-person payments, saving time with automated reconciliation, and getting their money fast with Instant Payouts.\n  Stripe Terminal works with pre-certified third-party hardware to support a range of use-cases. We currently offer two reader and SDK combinations, with more coming soon.\n    Stripe Terminal is currently available to businesses in your country as part of a beta program. Please provide the information below and we’ll be in touch with more detail.\n  First name       Last name       Work email       Company website       Country       Current customer           Associated email           Payments volume           In-person payments           Current solution           SDKs           Other info Optional\n  Something went wrong on our end. Sorry about that. You can still contact us at  sales@stripe.com.\n  We received your inquiry. We’ll get back to you as soon as possible.", "posttime": "2021-06-17 08:15:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "条纹,stripe,终端", "title": "条纹终端 ", "title_en": "Stripe Terminal", "transed": 1, "url": "https://stripe.com/terminal", "via": "", "real_tags": ["条纹", "stripe", "终端"]}, {"category": "", "categoryclass": "", "imagename": "7e1dcae442e761d3901e69b0afdbc5e3.jpeg", "infoid": 1066348, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国，今年夏天，疲惫的美国人为最受欢迎的公园，附近的城镇正在越来越多\n   穆阿布，犹他州东南犹他州是美国最受欢迎的旅游目的地之一。有两个国家公园和数百万个未开发的亩。\n  但游客越来越多地花费更多的时间坐在车里，因为他们等待进入广阔的户外活动。\n  “你去的任何地方，都会有一条线，”最近星期四的Libby Preslock说，他在上午9点抵达拱门国家公园。只要发现它已经满了，并且鼓励游客在三到五个小时后回来。然后，她前往该地区的其他国家公园，峡谷地，她等待大约半小时进入内部。\n  凭借其天然石拱门，砂岩翅片和高耸的红岩形成，拱门于4月吸引了194,000人，从2019年4月开始增加15％。由于大流行，它于2020年4月关闭。\n  拱门在公园社交媒体渠道的说法根据公园暂时关闭时，拱门达到容量，并将其大部分时间缩小到游客到游客。由于停车场暂时关闭，因此在公园暂时关闭时发送实时推文。那些不能经常前往峡谷的人，传统上不太受欢迎的公园超过拱门的尺寸超过四倍。峡谷兰州在2019年4月2021年4月2021年4月开始访问30％，近117,000。进入峡谷地的线路可以在峰值访问时期延伸到两个小时。\n  您将收取$ +税（如果适用）为华尔街日记。您可以随时在客户中心的任何时间更改帐单偏好或致电客户服务。您将在率或条款的任何变化提前通知您。您可以随时通过调用客户服务来取消订阅。 ", "note_en": "U.S.     As pandemic-weary Americans head for the most popular parks this summer, nearby towns are getting overrun\n   MOAB, Utah—Southeast Utah is among the most popular tourist destinations in the U.S. with two national parks and millions of undeveloped acres.\n  But visitors are increasingly spending more time sitting in their cars as they wait to  access the vast outdoors.\n  “Anywhere you go, there’s going to be a line,” said Libby Preslock, who on a recent Thursday arrived at Arches National Park at 9 a.m. only to find that it was full and signs encouraged visitors to come back in three to five hours. She then headed to the area’s other national park, Canyonlands, where she waited about half an hour to get inside.\n  With its natural stone arches, sandstone fins and towering red rock formations, Arches attracted about 194,000 people in April, up 15% from April 2019. It was closed in April 2020 due to the pandemic.\n  Arches reaches capacity and closes its gate to visitors most days before 9 a.m., according to the park social-media channels, which send out real-time tweets when the park temporarily closes because its parking lots are full. Those who can’t get in often head to Canyonlands, a traditionally less popular park more than four times the size of Arches. Canyonlands has seen its own visits jump 30% in April 2021 from April 2019, to nearly 117,000. Lines to enter Canyonlands can stretch up to two hours during peak visitation times.\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2021-06-17 08:15:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "拥挤,parks,拱门", "title": "国家公园已经过度拥挤，闭上门 ", "title_en": "National Parks Are Overcrowded and Closing Their Gates", "transed": 1, "url": "https://www.wsj.com/articles/national-parks-are-overcrowded-and-closing-their-gates-11623582002", "via": "", "real_tags": ["拥挤", "parks", "拱门"]}, {"category": "", "categoryclass": "", "imagename": "541bfb1267068b4e38cfe07a341f79c7.jpg", "infoid": 1066347, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新闻，最新消息，安卢，纳米，纳米级，纳米级水晶，nighvision，在黑暗中看到罗科莫尔，夜护目镜\n 由于堪培拉科学家的突破，在没有使用夜视护目镜的情况下，能够在没有使用的情况下看到现实。澳大利亚国立大学的研究人员有助于开发由纳米级水晶制成的薄膜，这些电影将允许用户在晚上看到清楚。薄膜比人发薄薄，有可能放在标准一副眼镜上，使它们用于夜视。大学项目和博士后研究员领导研究员Rocio Camacho Morales博士表示，该新技术具有各种各样的用途。 ＆＃34;这是一个非常重要的突破，它将能够提供很多机会，例如能够在晚上更安全地开车，以防动物跳出无处可去的地方，＆＃34;莫拉莱斯博士说。 ＆＃34;我们制作了看不见的可见。＆＃34;开发纳米级水晶电影的工作已经成为德国博士和澳大利亚，英国和欧洲的研究人员的五年项目。它希望这部电影能够作为过滤器应用于眼镜甚至无人机，以便人们在夜间更清楚地看到更清晰。其他潜在用途，例如在工作中提高家庭的人们行走的人们，并在工作中为警察和应急服务提供促进，这被吹捧为技术的未来可能性。 Morales博士表示，除了传统的夜视设备，新电影也比传统的夜视设备更容易，更安全，更繁重，这通常会使用户由于其重量而留下慢性颈部损伤的用户。 ＆＃34;在正常的夜视或红外摄像头，它需要一个冷却系统来工作，因此通常也有很多噪音，而且＃34;她说。 ＆＃34;当前技术将红外灯转换为电气信号，然后在显示器上显示。 ＆＃34;在我们的情况下，[纳米级晶体胶片]全部是光学的，所以不需要转换。＆＃34;新技术能够在室温下工作而不是需要低温冷冻。虽然研究导致了这部电影的第一个概念验证实验，但将进行进一步的工作以确定该技术如何先进。莫拉莱斯博士表示，一旦进一步研究进行了进一步的研究，新技术将易于批量生产，并能够在澳大利亚进行。 ＆＃34;这只是一开始，它有很多野心和应用程序，＆＃34;她说。 ＆＃34;下一步是继续探索这些可能性，这将为我们提供更多的效率，并让我们开始与行业合作。 ＆＃34;在澳大利亚，我们拥有这项技术的能力，知识和经验，为自己制造它。＆＃34;该研究已在高级光子学杂志上发表。我们的记者努力为社区提供当地的最新消息。这是您如何继续访问我们可信内容的方式：\n         由于堪培拉科学家的突破，在没有使用夜视护目镜的情况下，能够在没有使用的情况下看到现实。\n 澳大利亚国立大学的研究人员有助于开发由纳米级水晶制成的薄膜，这些电影将允许用户在晚上看到清楚。\n 薄膜比人发薄薄，有可能放在标准一副眼镜上，使它们用于夜视。\n 大学项目和博士后研究员领导研究员Rocio Camacho Morales博士表示，该新技术具有各种各样的用途。\n ＆＃34;这是一个非常重要的突破，它将能够提供很多机会，例如能够在晚上更安全地开车，以防动物跳出无处可去的地方，＆＃34;莫拉莱斯博士说。 \n开发纳米级水晶电影的工作已经成为德国博士和澳大利亚，英国和欧洲的研究人员的五年项目。\n 它希望这部电影能够作为过滤器应用于眼镜甚至无人机，以便人们在夜间更清楚地看到更清晰。\n 其他潜在用途，例如在工作中提高家庭的人们行走的人们，并在工作中为警察和应急服务提供促进，这被吹捧为技术的未来可能性。\n Morales博士表示，除了传统的夜视设备，新电影也比传统的夜视设备更容易，更安全，更繁重，这通常会使用户由于其重量而留下慢性颈部损伤的用户。\n ＆＃34;在正常的夜视或红外摄像头，它需要一个冷却系统来工作，因此通常也有很多噪音，而且＃34;她说。\n ＆＃34;当前技术将红外灯转换为电气信号，然后在显示器上显示。\n ＆＃34;在我们的情况下，[纳米级晶体胶片]全部是光学的，所以不需要转换。＆＃34; \n新技术能够在室温下工作而不是需要低温冷冻。  虽然研究导致了这部电影的第一个概念验证实验，但将进行进一步的工作以确定该技术如何先进。  莫拉莱斯博士表示，一旦进一步研究进行了进一步的研究，新技术将易于批量生产，并能够在澳大利亚进行。  ＆＃34;这只是一开始，它有很多野心和应用程序，＆＃34; 她说。  ＆＃34;下一步是继续探索这些可能性，这将为我们提供更多的效率，并让我们开始与行业合作。  ＆＃34;在澳大利亚，我们拥有这项技术的能力，知识和经验，为自己制造它。＆＃34;  我们的记者努力为社区提供当地的最新消息。 这是您如何继续访问我们可信内容的方式： ", "note_en": "news, latest-news, anu, nanoscale, nanoscale crystal, nighvision, see in the dark, rocio morales, night goggles\n Being able to see in the dark without the use of night-vision goggles could soon become reality, thanks to a breakthrough from Canberra scientists. Researchers at the Australian National University have helped to develop a thin film made of nanoscale crystals that would allow users to see clearly at night. The film, thinner than a human hair, has the potential to be placed on a standard pair of glasses, allowing them to be used for night vision. Lead researcher on the project and postdoctoral fellow at the university, Dr Rocio Camacho Morales, said the new technology had the potential for a wide variety of uses. &#34;This is a very important breakthrough, and it will be able to provide lots of opportunities, like being able to drive more safely at night in case an animal jumps out of nowhere,&#34; Dr Morales said. &#34;We have made the invisible visible.&#34; Work on developing the nanoscale crystal film has been a five-year project for Dr Morales and a team of researchers from Australia, the UK and Europe. It&#39;s hoped the film would be able to be applied as a filter to glasses or even drones in order for people to see more clearly during the night. Other potential uses, such as improving safety for people walking home at night or for police and emergency services while on the job, have been touted as future possibilities for the technology. Dr Morales said the new film would also be easier, safer and less heavy to use than traditional night-vision devices, that often leave users with chronic neck injuries due to its weight. &#34;In normal night-vision or infrared cameras, it requires a cooling system for it to work, and so there is often a lot of noise going on as well,&#34; she said. &#34;The current technology converts infrared lights to an electrical signal, which is then displayed on a monitor. &#34;In our case, the [nanoscale crystal film] will all be optical, so no conversion is required.&#34; Rather than requiring cryogenic freezing in order to work, the new technology is able to function at room temperature. While research has led to the first proof-of-concept experiments for the film, further work will be carried out to determine how the technology would be advanced. Dr Morales said the new technology would be easy to mass produce and would be able to be done within Australia, once further research was conducted. &#34;This is just the start, and there are lots of ambitions and applications for it,&#34; she said. &#34;The next steps are to keep exploring those possibilities, which will give us more efficiency and allow us to start partnering with industry. &#34;In Australia, we have the capacity, knowledge and experience in this technology to manufacture it ourselves.&#34; The research has been published in the journal Advanced Photonics. Our journalists work hard to provide local, up-to-date news to the community. This is how you can continue to access our trusted content:\n         Being able to see in the dark without the use of night-vision goggles could soon become reality, thanks to a breakthrough from Canberra scientists.\n Researchers at the Australian National University have helped to develop a thin film made of nanoscale crystals that would allow users to see clearly at night.\n The film, thinner than a human hair, has the potential to be placed on a standard pair of glasses, allowing them to be used for night vision.\n Lead researcher on the project and postdoctoral fellow at the university, Dr Rocio Camacho Morales, said the new technology had the potential for a wide variety of uses.\n &#34;This is a very important breakthrough, and it will be able to provide lots of opportunities, like being able to drive more safely at night in case an animal jumps out of nowhere,&#34; Dr Morales said.\n  Work on developing the nanoscale crystal film has been a five-year project for Dr Morales and a team of researchers from Australia, the UK and Europe.\n It&#39;s hoped the film would be able to be applied as a filter to glasses or even drones in order for people to see more clearly during the night.\n Other potential uses, such as improving safety for people walking home at night or for police and emergency services while on the job, have been touted as future possibilities for the technology.\n Dr Morales said the new film would also be easier, safer and less heavy to use than traditional night-vision devices, that often leave users with chronic neck injuries due to its weight.\n &#34;In normal night-vision or infrared cameras, it requires a cooling system for it to work, and so there is often a lot of noise going on as well,&#34; she said.\n &#34;The current technology converts infrared lights to an electrical signal, which is then displayed on a monitor.\n &#34;In our case, the [nanoscale crystal film] will all be optical, so no conversion is required.&#34;\n Rather than requiring cryogenic freezing in order to work, the new technology is able to function at room temperature.\n While research has led to the first proof-of-concept experiments for the film, further work will be carried out to determine how the technology would be advanced.\n Dr Morales said the new technology would be easy to mass produce and would be able to be done within Australia, once further research was conducted.\n &#34;This is just the start, and there are lots of ambitions and applications for it,&#34; she said.\n &#34;The next steps are to keep exploring those possibilities, which will give us more efficiency and allow us to start partnering with industry.\n &#34;In Australia, we have the capacity, knowledge and experience in this technology to manufacture it ourselves.&#34;\n  Our journalists work hard to provide local, up-to-date news to the community. This is how you can continue to access our trusted content:", "posttime": "2021-06-17 08:14:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "护目镜,breakthrough,能够", "title": "Anu突破让人们在没有夜视护目镜的情况下在黑暗中看到 ", "title_en": "ANU breakthrough lets people see in the dark without night-vision goggles", "transed": 1, "url": "https://www.canberratimes.com.au/story/7298280/made-the-invisible-visible-new-technology-lets-people-see-in-the-dark-without-night-vision/?src=rss", "via": "", "real_tags": ["护目镜", "能够"]}, {"category": "", "categoryclass": "", "imagename": "08b6f4cfbf108affdfbe6e19d66a4179.png", "infoid": 1066345, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Apple最近从立法者，开发人员，法官和用户审查了一座审查。在所有情况下，首席执行官蒂姆库克坐在出版物上。讨论Apple＆＃39;策略和政策。短暂但广泛的采访提供了一些深入了解Apple计划未来的地方。\n 正如蒂姆克在公开发言的那样，隐私是一个重点。他对其重要性的问题的回应是我们多次听到他的同一个人：＆＃34;我们认为它是一个基本的人权，一个基本的人权。＆＃34;注意苹果一直专注于隐私长期。\n  你可以想到一个隐私并不重要的世界，监督经济接管，它成为一个每个人都担心其他人正在观看他们的世界，所以他们开始少，他们开始思考，没有人想住在一个言论自由的世界里。\n 当被问及监管审查时，他指向GDPR作为监管苹果支持的例子，并表示苹果公司将支持进一步扩大与隐私相关的法规。\n 但除了严格居中的法规外，他是＆＃39。 ＆＃34;正如我看着讨论的技术法规，我认为它有很好的部分，然后我认为它的部分是用户的最佳利益，＆＃34 ;他说。\n 作为后者的一个例子，他说＆＃34;正在讨论的当前DMA语言将强制在iPhone上侧行。＆＃34;他加了：\n 这将破坏iPhone的安全性以及我们在App Store中建立的很多隐私计划，我们拥有隐私营养标签和应用跟踪透明度......这些事情不再存在。 \n隐私看门狗已经赞扬Apple＆＃39;即使是广告商已经抨击它，甚至也是普遍存在的透明度，但营养标签一直受到击中。许多观察者指出，标签通常不准确或不完整。\n ＆＃34; android的恶意软件比iOS更多47倍，＆＃34;厨师声称。 ＆＃34;它＆＃39; s是因为我们设计了ios，即在商店之前审查了一个＆＃39;一家App商店和所有应用程序。因此，这使得很多这种恶意软件脱离了我们的生态系统，而且客户已经持续地告诉我们它们的价值，所以我们＆＃39;重新在讨论中为用户站起来。＆＃34 ;\n  虽然，采访尚不为条例和隐私而诞生;库克还回应了关于Apple＆＃39;未来产品战略的开放式问题。当被问及他相信苹果和＃39的东西，从现在开始看起来像多年的时间，他仔细提供了警告，没有人能够真正预测事物的目标是：\n 我们接近未来的谦卑，因为我们知道我们可以预测它。我不是那些将说我能看到20年的人中的那些人，而且30年来告诉你会发生什么。我可以＆＃39; t。我真的不相信任何人都可以。\n 要回到那一点，他谈到了苹果＆＃39;在将自己的硅片放入MAC上的路径：\n 我们没有知道我们在芯片上何时何时为iPhone工作，它将成为iPad的核心，我们没有知道它最终会成为Mac的核心，因为它刚刚做到了在过去的一年。我们没有知道，但是我们一直在发现，我们一直拉着弦，我们把我们的想法打开了那个旅程会带我们，它把我们带到了＆＃39; s令人难以置信的地方这在它之前有一个艰难的未来。\n 那就说，厨师被命名为增强现实（AR）和健康和技术的交叉点作为他看到未来潜力的地区。他说他看到了AR＆＃34;作为一种能够以广义增强生活的技术。＆＃34;他再次暗示野心计划的未来AR硬件，他说：＆＃34;我们一直在使用我们的手机和iPad，以及后来的我们＆＃39; LL看看产品方面的位置。＆＃34; \n在健康方面，库克说他是＆＃34;非常乐观的＆＃34;关于健康与技术的交点：\n 你知道，当我们开始运送手表时，我们从一个健康的角度来看这么想，但我们把心率传感器放在上面，我正在获得关于发现他们有心脏问题的人的大量电子邮件他们没有知道它。因此，我们开始向观看添加更多功能......我开始从发现它们＆＃39; D的人们获得更多的票据，因为这种能力不断监控自己。我认为不断监测身体的想法，就像在你的车里发生的警告灯等等，我认为这是一个有很大的想法，在它之前有一个漫长的道路道路。所有这些事情都让我令人难以置信的乐观。\n 提到汽车作为灵感来自Brut的傻笑。＆＃39;我们的面试官很快问过苹果计划设计并开始销售汽车。 ＆＃34;在汽车方面，＆＃34;厨师回答，＆＃34;我必须保留秘密，并且总是必须要成为我们的袖子。＆＃34; ", "note_en": "Apple has been under a mountain of scrutiny lately from legislators, developers, judges, and users. Amidst all that, CEO Tim Cook sat with publication Brut. to discuss Apple&#39;s strategy and policies. The  short but wide-ranging interview offered some insight into where Apple plans to go in the future.\n As is so common when Tim Cook speaks publicly, privacy was a major focus. His response to a question about its importance was the same one we&#39;ve heard from him many times: &#34;we see it as a basic human right, a fundamental human right.&#34; Noting Apple has been focused on privacy for a long time.\n  You can think of a world where privacy is not important, and the surveillance economy takes over and it becomes a world where everyone is worried that somebody else is watching them, and so they begin to do less, they begin to think less, and nobody wants to live in a world where that freedom of expression narrows.\n And when asked about regulatory scrutiny, he pointed to the GDPR as an example of regulation Apple supports and also said Apple would support further expanding privacy-related regulations.\n But beyond regulations strictly centered on privacy, he wasn&#39;t as effusive. &#34;As I look at the tech regulations that&#39;s being discussed, I think there are good parts of it and then I think there are parts of it that are not in the best interests of the user,&#34; he said.\n As an example of the latter, he said &#34;the current DMA language that is being discussed would force sideloading on the iPhone.&#34; He added:\n That would destroy the security of the iPhone and a lot of the privacy initiatives that we&#39;ve built into the App Store, where we have privacy nutrition labels and App Tracking Transparency... these things would not exist anymore.\n Privacy watchdogs have praised Apple&#39;s App Tracking Transparency move even as advertisers have lambasted it, but the nutrition labels have been less of a hit. Many observers have pointed out that the labels are often inaccurate or incomplete.\n &#34;Android has 47 times more malware than iOS does,&#34; Cook claimed. &#34;It&#39;s because we&#39;ve designed iOS in such a way that there&#39;s one app store and all of the apps are reviewed prior to going on the store. And so that keeps a lot of this malware stuff out of our ecosystem, and customers have told us very continuously how much they value that, and so we&#39;re going to be standing up for the user in the discussions.&#34;\n  The interview wasn&#39;t all about regulation and privacy, though; Cook also responded to open-ended questions about Apple&#39;s future product strategy. When asked what he believes Apple&#39;s products will look like many years from now, he carefully offered the caveat that no one can really predict where things are headed:\n We approach the future with great humility because we know we can&#39;t predict it. I&#39;m not one of those people that is going to say I can see 20 years out, and 30 years out, and tell you what is going to happen. I can&#39;t. I really don&#39;t believe anyone can.\n To back that point, he talked about Apple&#39;s path towards putting its own silicon in Macs:\n We didn&#39;t know when we were working on the chip for the iPhone that it would become the heart of the iPad, and we didn&#39;t know that it would eventually become the heart of the Mac as it just did in this past year. We didn&#39;t know that, but we kept discovering, and we kept pulling the string, and we kept our minds open about where that journey would take us, and it&#39;s taken us somewhere that&#39;s incredible and that has a great future ahead of it.\n That said, Cook named augmented reality (AR) and the intersection of health and tech as areas where he sees future potential. He said he sees AR &#34;as a technology that can enhance life in a broad way.&#34; And once again hinting at ambitions plans for future AR hardware, he said: &#34;We&#39;ve been working on AR first with our phones and iPads, and later we&#39;ll see where that goes in terms of products.&#34;\n On the health side, Cook said he is &#34;exceedingly optimistic&#34; about the intersection of health and technology:\n You know, when we started shipping the Watch, we did so thinking about it from a wellness point of view, but we put a heart rate sensor on it, and I was getting tons of emails about people that found out they had heart problems that they didn&#39;t know about it. And so we started adding more function to the Watch... and I begin to get even more notes from people that found that they&#39;d had a problem because of this ability to continually monitor themselves. I think the idea of continually monitoring the body, much like happens in your car with warning lights and so forth, I think this is a big idea that has a long road path ahead of it. All of those things make me incredibly optimistic.\n The mention of a car as inspiration drew a smirk from Brut.&#39;s interviewer, who shortly afterwards asked if Apple plans to design and begin selling a car. &#34;In terms of a car,&#34; Cook answered, &#34;I&#39;ve gotta keep secrets, and there always has to be something up our sleeve.&#34;", "posttime": "2021-06-17 07:38:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,tim,苹果", "title": "Apple的Tim Cook：Sideloading是“不是用户的最佳利益” ", "title_en": "Apple‘s Tim Cook: Sideloading is “not in the best interests of the user”", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/06/apples-tim-cook-sideloading-is-not-in-the-best-interests-of-the-user/", "via": "", "real_tags": ["apple", "tim", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "190553c2b96526e7d8dc412c25e73c82.jpg", "infoid": 1066344, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "蒂姆伯勒斯 - 万维网的创造者，正在拍卖他的发明＆＃39; s源代码作为nft。\n 虽然突破性的代码长期以来一直在公开领域，但英国电脑科学家现在授权出售单一版本的原始时间戳文件。\n 包含超过9.500行代码，文件包含根据我们知道的语言和协议的基础：超文本传输​​协议（HTTP），超文本标记语言（HTML）和识别通用文档（URI）。\n  它们与代码和数字＆＃34的动画可视化一起出售;海报＆＃34;那是＆＃34;签名＆＃34;通过伯恩李通过图形签名。获胜的投标人还将在主页上回家，由计算机科学家撰写，其中他反映了代码及其创造。\n  ＆＃34;回去看看代码一切都很有趣，＆＃34;这封信读了。 ＆＃34;看到那些相对较少的代码的东西，（）帮助（）在整个行星上的一个惊人生长的合作者的帮助下，轨道上留下了足够的东西，以成为现在的网络。\n ＆＃34;我从来没有觉得我可以放松并坐下来 - 因为网络是并且不断变化，＆＃34;伯恩斯 - 李某签下了。 ＆＃34;它不是最好的：总有工作要做！＆＃34;\n  虽然世界＆＃39;第一个网页并没有去1991年，诞生网上的诞生通常被认为是1989年，伯尔斯 - 李提交了一个题为＆＃34;信息管理的稿件：提案＆＃34;在CERN，瑞士粒子物理研究实验室。 \n最初旨在帮助科学家合作，他的发明很快扩大到学术界之外。现在，世界上有超过46亿有活跃的互联网用户。\n  苏富比＆＃39; s，它们组织出售，将代码描述为＆＃34;第一个数字出生的artifact＆＃34;永远来拍卖。拍卖公寓＆＃39;全球科学和流行文化负责人Cassandra Hatton表示，销售提供了机会＆＃34;自己的＆＃34;一部分的技术发展，雄伟的A＆＃34;范式班次＆＃34;对于人类。\n ＆＃34;我一直试图提出类似的东西，＆＃34;她从纽约打电话说。 ＆＃34;我认为也许是相对论，皮革表现，印刷机，灯泡或内燃机的理论。但我认为这是一个更大的东西。\n ＆＃34;灯泡是蜡烛的改善，燃烧发动机作为蒸汽机的改进，但与万维网有所改善，它是完全新的。＆＃34;\n   基于区块链技术，NFT或非娱乐标记，通过提供所有权证明，已经彻底改变了数字艺术和收藏品。令牌使得更容易购买和贸易数字资产，否则可以很容易地复制，例如推文或照片。\n  Berners-Lee＆＃39; S代码自1993年以来一直公开使用，但哈顿认为有机会拥有＆＃34;原始文件＆＃34;使这个nft像其他高价值的历史收藏品。\n ＆＃34;我从＆＃39的镜头看它是旧的镜头近二十年的书籍和手稿专家，＆＃34;她补充道。 ＆＃34;平装的存在不会贬值第一版，第一版的存在并不会贬值手稿的存在。 \n＆＃34;它与绘画相同：梵高的海报有多少海报＆＃39; s＆＃39;繁星之夜＆＃39;那里有吗？他们根本不会贬低绘画。＆＃34;\n  2004年伊丽莎白二世伊丽莎白二世士士的伯恩·李说，在一份新闻声明中表示，NFT代表＆＃34;存在的最合适的所有权手段＆＃34;为了他的开创性代码。\n ＆＃34;为什么nft？好吧，它＆＃39;当你的计算机科学家和写作代码时，＆＃39;何时写作代码，并且已经多年了，＆＃34;他被引用说。 ＆＃34;在完全数字工件上以数字签名签名签名的感觉是正确的。＆＃34;\n  竞标将于6月23日以1,000美元开放，拍卖将在月底之前在线运行。与苏富比的所有销售额一样 - 包括迄今为止的28个数字艺术品，该艺术品上周售价为1710万美元 - 拍卖所拒绝为伯纳尔·李＆＃39; S代码提供估计的价格。\n 鉴于市场上的NFTS有限的历史，哈顿表示它可能会有可能＆＃34;有一片＆＃34;在拍卖者之前可以为NFTS市场提供准确的估值。但她预测，买方可能是某人＆＃34;谁已经通过范式转变＆＃34;由网络带来的抵达。\n ＆＃34;真正理解本发明，＆＃34;她补充说，＆＃34;你必须了解它之前的样子。＆＃34; ", "note_en": "Tim Berners-Lee, creator of the World Wide Web, is  auctioning off his invention&#39;s source code as an NFT.\n Although the groundbreaking code has long been in the public domain, the British computer scientist has now authorized the sale of a single edition of his original time-stamped files.\n Comprising over 9.500 lines of code, the files contain the basis of the languages and protocols underpinning the internet as we know it: Hypertext Transfer Protocol (HTTP), Hypertext Markup Language (HTML) and Universal Document Identified (URI).\n  They are being sold alongside an animated visualization of the code and a digital &#34;poster&#34; that is &#34;signed&#34; by Berners-Lee via a graphic signature. The winning bidder will also take home a letter, written by the computer scientist, in which he reflects on the code and its creation.\n  &#34;It has been fun to go back and look over the code,&#34; the letter reads. &#34;It is amazing to see the things that those relatively few lines of code, with (the) help of an amazing growing gang of collaborators across the planet, stayed enough on track to become what the web is now.\n &#34;I have never once felt I could relax and sit back -- as the web was and is constantly changing,&#34; Berners-Lee signs off. &#34;It is not yet the best it can be: there is always work to be done!&#34;\n  Although the world&#39;s first web page didn&#39;t go live until 1991, the birth of the World Wide Web is usually considered to be 1989, the year that Berners-Lee  submitted a manuscript entitled &#34;Information Management: A Proposal&#34; at CERN, a particle physics research laboratory in Switzerland.\n Initially designed to help scientists collaborate, his invention soon expanded beyond the academic world. There are now  over 4.6 billion active internet users in the world.\n  Sotheby&#39;s, which is organizing the sale, described the code as the &#34;first digital-born artifact&#34; ever to come to auction. The auction house&#39;s global head of science and popular culture, Cassandra Hatton, said the sale offered a chance to &#34;own&#34; part of a technological development that heralded a &#34;paradigm shift&#34; for humankind.\n &#34;I&#39;ve been trying to come up with something comparable,&#34; she said on the phone from New York. &#34;I thought maybe the theory of relativity, heliocentrism, the printing press, light bulbs or the combustion engine. But I think that this is a much bigger thing.\n &#34;Light bulbs were an improvement on candles, the combustion engine as an improvement of steam engine, but with the World Wide Web, it was something entirely new.&#34;\n   Based on blockchain technology, NFTs, or non-fungible tokens, have have  revolutionized digital art and collectibles by offering proof of ownership. The tokens have made it easier to buy and trade digital assets that could otherwise be easily copied, such as tweets or photographs.\n  Berners-Lee&#39;s code has been publicly available since 1993, but Hatton believes that the chance to own the &#34;original files&#34; makes this NFT like other high-value historical collectibles.\n &#34;I look at it from the lens of somebody who&#39;s been a books and manuscripts specialist for almost two decades,&#34; she added. &#34;The existence of paperback does not devalue the first edition, and the existence of the first edition does not devalue the existence of the manuscripts.\n &#34;It&#39;s the same with paintings: How many posters of Van Gogh&#39;s &#39;The Starry Night&#39; are there out there? They do not devalue the painting at all.&#34;\n  Berners-Lee, who was knighted by Queen Elizabeth II in 2004, said in a press statement that NFTs represent &#34;the most appropriate means of ownership that exists&#34; for his pioneering code.\n &#34;Why an NFT? Well, it&#39;s a natural thing to do as when you&#39;re a computer scientist and when you write code and have been for many years,&#34; he is quoted as saying. &#34;It feels right to digitally sign my autograph on a completely digital artifact.&#34;\n  Bidding will open at $1,000 on June 23, and the auction will run online until the end of the month. As with all of Sotheby&#39;s NFT sales to date -- including 28 digital artworks that sold for a combined $17.1 million last week -- the auction house declined to offer an estimated price for Berners-Lee&#39;s code.\n Given NFTs limited history on the market, Hatton said it would likely &#34;be a while&#34; before auctioneers can provide accurate valuations for NFTs market. But she predicted that the buyer would likely be someone &#34;who has lived through the paradigm shift&#34; brought about by the web&#39;s arrival.\n &#34;To really appreciate this invention,&#34; she added, &#34;you have to understand what it was like before.&#34;", "posttime": "2021-06-17 07:37:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "代码,发明家,wide", "title": "万维网的发明家正在将原始代码销售为NFT ", "title_en": "The World Wide Web's inventor is selling its original code as an NFT", "transed": 1, "url": "https://www.cnn.com/style/article/tim-berners-lee-nft-auction/index.html", "via": "", "real_tags": ["代码", "发明家", "wide"]}, {"category": "", "categoryclass": "", "imagename": "2cd868838db1f5b268d99d3408db78f5.jpg", "infoid": 1066343, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新的空间明天早上10点在上午10点开放。当地时间填补了谷歌大，昂贵的西方房地产投资的5000平方英尺的销售空间。零售地点以前由邮局和星巴克占据，一旦他们的租约到期在他们的新公司房东下才腾出了该处所。\n   该商店的布局设计为经验，突出了公司不断增长的硬件产品组合以及选择第三方合作伙伴。本质上是公司获得像素手机，家庭产品，斯塔迪亚，Wearos和最新的Fitbit设备，在游客和当地人面前的一种方式。\n “我们真的在过去几年中使用了弹出窗口，以获得更好的顾客对我们在谷歌唯一交付的期望，”在新闻预览周刊期间表示，“VP Jason Rosenthal表示。我们从2016年，2016年，2018年和2019年的弹出窗口中学了，并真正喂养了在切尔西开设的东西中的学习。“\n  由于流行性限制，预览是虚拟的。虽然本周对公众开放，但该公司将保持标准的安全预防措施，因为城市处理大流行的尾端。\n 虽然Covid-19几乎肯定会放慢计划的开场，但谷歌承诺在明天开始的事情会全力以赴。这在几个星期的驾驶期间，其中商店的50岁左右的员工通过他们的步伐进行，而该公司将完成触及的经验。在此之前，谷歌在山景中建造了一个全尺寸的商店大型库，在山景中的机库空间，以测试想法。\n  除了产品屏幕和Dioramas衬里17英尺的窗户外，公司还使用“沙盒” - 有效地将商店 - 有效的场景，如起居室，与您在大型家具店中可能找到的东西不一样 - 尽管更好点亮。还有一个游戏区域，用于播放Stadia和用于测试各种家庭/巢产品的隔音点。\n 像Apple的商店一样，客户可以为像素等像素的修复破损的设备带来。该公司表示，它正在增长可以在现场修复的设备数量，而某些问题如破碎的屏幕，则应该能够同行。 \n这家商店似乎本身是一个飞行员，进一步计划在美国销售硬件的国际市场中开进一步开放地点。 但是，现在，谷歌不会在明天在切尔西开业时讨论主题。 ", "note_en": "The new space, which opens tomorrow morning at 10 a.m. local time, fills 5,000 square feet of selling space in Google’s big, pricey West Side real estate investment. The retail location was previously occupied by a Post Office and Starbucks, which vacated the premises once their leases expired under their new corporate landlord.\n   The store’s layout is designed to be experiential, highlighting the company’s growing hardware portfolio along with select third-party partners. Essentially it’s a way for the company to get Pixel phones, Home offerings, Stadia, WearOS and the newest addition to the hardware portfolio, Fitbit devices, in front of tourists and locals.\n “We really used the pop-ups over the last several years to get a better sense of what are customer expectations for what we can uniquely deliver at Google,” VP Jason Rosenthal said during a press preview week. We’ve taken learnings from our 2016, 2017, 2018 and 2019 pop-ups and really fed that learning into what we’re opening[…] in Chelsea.”\n  Due to pandemic restrictions, the preview was virtual. And while it’s open to the public this week, the company will be maintaining the standard safety precautions, as the city deals with (knock on wood) the tail end of the pandemic.\n And while COVID-19 almost certainly slowed the planned opening, Google promises that things will be in full force starting tomorrow. This follows several weeks of piloting, wherein the store’s 50 or so staffers were put through their paces, while the company put the finishing touches on the experience. Prior to this, Google built a full-size store mockup in a hangar space in Mountain View to test out ideas.\n  In addition to product screens and dioramas lining the 17-foot windows, the company filled the store with “sandboxes” — effectively scenarios like a living room, not dissimilar to what you might find in a large furniture store — albeit better lit. There’s also a gaming area for playing Stadia and a soundproof spot for testing out various Home/Nest products.\n Like Apple’s Store, customers can bring in for repair broken devices like Pixels. The company says it’s growing the number of devices that can be repaired on-site, while certain issues, like a broken screen, should be able to be fixed same day.\n  It seems likely that the store is a pilot in and of itself, with further plans to open additional locations in the U.S. and, perhaps, international markets where the company sells hardware. For now, however, Google won’t discuss the subject beyond tomorrow’s opening in Chelsea.", "posttime": "2021-06-17 07:37:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,明天,store", "title": "在谷歌的第一家商店里面看，明天在纽约的切尔西街区开业 ", "title_en": "\n\t\t\t\tA look inside Google’s first store, opening in NYC’s Chelsea neighborhood tomorrow\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/16/a-look-inside-googles-first-store-opening-in-nycs-chelsea-neighborhood-tomorrow/", "via": "", "real_tags": ["google", "谷歌", "明天", "store"]}, {"category": "", "categoryclass": "", "imagename": "ce82a55db973b4b24d10f02dbd818704.jpeg", "infoid": 1066342, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1.在最近访问科隆时，我避免了这座城市最磁场的景点 - 你已经看到了一个哥特大教堂，你已经看到了他们 - 而且我探索了这个城市的书店。大而小，一般，专业，宽敞又狭窄，似乎没有结束品种。但他们都有一个共同点：他们蓬勃发展。\n 德国人如何做到这一点？当像边界这样的巨大的一次强大的书籍销售链在大西洋中的火焰中下降，德国人如何让他们的书籍出版业如此多样化，所以坚固，如此稳定？本书商如何始终如一地转向从歌德到格拉姆的所有东西的利润？是因为仔细规划吗？愚蠢的运气？一些神秘的条目基因？或者它可以是一个kultur的东西吗？\n 2. Buchladen，科隆北侧的一家小商店，是一个开始寻找答案的好地方。从街道上看起来并不像街头 - 绿色遮阳篷，小型显示窗口 - 但一旦你进入商店，你就会受到质量和数量的震惊，架子上的内容的品种和美丽。在商店的前面是新的小说和历史书籍，在简称德国作者和众多美国人的翻译和平装中，包括菲利普罗斯，理查德价格，尼科尔克劳斯，保罗·普斯特和理查德力量。在平装小说部分，30英尺的落地架子上，我找到了David Foster Wallace，Jonathan Safran Foer，Karin屠宰，Don Winslow，以及Elmore Leonard与德国，法语，苏格兰，爱尔兰，英语，和日本作家。德国读者有天主教的口味。他们将犯罪小说饥肠辘辘地作为文学小说，历史，哲学，情色，以及其他一切。\n 在德国书店，大型或小的货架上找不到的一件事是大型美国书店的主干 - 展示当前畅销书的陡峭折扣。这是因为德国所有新书的成本受到了叫做Buchpreisbindung的一些典型定价政策，这是由1888年的书籍自愿通过的统一定价政策，并在2002年成为国家法律。通过迫使所有商店和在线供应商出售新的卖方标题价格同比，法律显然，一个福音到小商店，不能与亚马逊等大链和在线巨头的批量购买竞争.de和buch.de。\n “Buchpreisbindung的想法是消除价格竞争，以促进梅斯州连锁店的发言人Simone Thelen说，这是在19世纪，现在拥有49家商店在北莱茵威斯特法伦州的州。 “这使得出版商可以发布各种书籍和作者，并且它让我们有机会促进年轻，未知的作者和书本不是块牌的书籍。”\n 这种看似反向直观的策略 - 保护书籍通过保持昂贵 - 实际上与今天在德国的大部分内容符合。该国享有欧洲最健康的经济，就业不断增长，平衡的预算，且令人羡慕的贸易顺差，但由于其付出良好的工人及其庞大的社会服务网络，包括普遍（即强制性） ）保健，加上至少四周的带薪假期，在某些情况下超过七个。它对繁荣的德国人来说是完美的感觉，为新书籍支付公平，严格监管的价格，因为他们认为书籍行业的健康 - 就是出版商，书商和作家，从名为未知 - 是对整个社会的健康至关重要。\n 政府监管消费品价格的想法是大多数美国人的血清，那些买入自由市场福音和沃尔玛·曼蒂拉的价格是一切，较低总比高于更高。那么，许多美国人都毫不奇怪，许多美国人正在哀悼普遍保健的成本，我们的繁重税率（在工业化世界中最低），并且通过削减政府在保留时削减政府支出需要修剪联邦赤字富人的税收休息。然而，随着边界争论的说明，允许美国的书店在他们选择的任何地方设定价格无法保证，即使是最大的鱼也会生存。怜惜消失的小油炸。 \nWarning: Can only detect less than 5000 characters\n“阅读麦克约妥群岛的杂志，全国出版商和法兰克福商业学会的杂志编辑迈克尔·罗斯勒 - 格拉希文“这不是整个人口。所谓的更高文献或Belles Lettres，由小百分比读取。但这是一个非常重要的传统。“\n 2007年，美国出版商（AAP）调查协会透露，四分之一的美国人没有阅读一本书 - 不是一本书 - 去年。自从击中那种无处到守望的Nadir以来，事情似乎有所改善。 2009年，本艺术的国家捐赠报告称，自1982年以来首次增加了美国人阅读文学（小说，短篇小说，诗歌）的数量。今年夏季AAP和书籍行业集团的联合调查透露，由于电子书的销售以及少年和成人小说，美国出版商的净销售额从2008年到2010年增加了5.6％。现在正在借鉴电子书的优势和他们给予美国书籍行业的提升。我说万岁。但是，我倾向于怀疑这个电子阅读器和电子书销售的这种升级是美国人突然读更多的指标。我怀疑他们只是下载更多。我希望我错了。时间会告诉。\n 这一切都不是建议德国销售书籍制度可以或应该将批发移植到美国。暗示暗示所有德国人都比所有美国人更好地阅读和受过更好的教育。编辑罗斯勒 - 格拉希登很乐意在该得分上直接设置录制。 “每当我访问美国，人们都说，'哦，你德国人受过良好教育，你是如此熟悉的阅读，＆＃39;”他说。然后，随着笑声，他补充说：“我必须告诉他们所有德国人都不是真的。”\n 当然，他是对的。但是，在德国生活中占据了一个特殊的地方，否则就可以否认，这是给我们打印的书的国家。梅斯州连锁店的发言人蒂伦，很好地放置。 “书籍不仅仅是在这里的商品，”她说。 “他们有一个必须挽救的文化价值。”\n   一个有趣的作品出错。在澳大利亚，小商店在1972年取消了固定定价后保持了他们的市场份额，最终近40年后，已关闭的折扣员可能比以往任何时候都有更多的小商店。\n 这不是自满或沾沾自的原因，然而随着市场受到萎缩的威胁，这是真正的问题。更少的人在谦卑的书上使用他们的自由裁量费用。\n 在RRP（出版商而非零售商设定）的高价格加剧了这一点，以及在线竞争价格的有利汇率的公司的能力（阅读亚马逊及其最近的购买书籍存款） \n在废除前后，这个国家RRP的预订价格在国际条款中得到了很高的。这是一个废话，保护几乎所有专门的国际出版商在1972年重新获得的利润使得价格下降。现在仍然是一个废话。\n 从外面非常有趣，写得很好，突出了这里的情况。谢谢！\n 这肯定是真的：虽然妨碍德国电子书的出现，但是Buchpreisbindung是 - 暂时节省较小的书店突然下降。介意你：即使没有电子书和侵蚀者的崛起，这也是在这里的小商店更加困难和更难。许多人在过去几年里必须罢工。\n  （顺便说一下的附录：如果漂亮的老式明信片（可能是从60岁时从60岁开始）是说明科隆，你被误解了。这是波恩的大教堂。）\n   我住在德国，莫里斯先生做得很好地描述了这里的情况。伟大的论文 - 非常有洞察力。我们必须意识到有些事情值得保留 - 并支付！\n 很高兴局外人可以让这些见解探索德国文化的书籍和阅读。作为纽约的德国生活，我甚至甚至可以说德国一般是一个比美国更为开明的国家 - 可能是回收，健康保险，征税。所有德国人都相信进化，为天然气付出很多......你称之为......，但随后，为什么野蛮的美国生活在德国生活比生活更有趣？\n 非常感谢这篇文章的，因为我们德国人也非常善于抱怨，尤其是书商！ \n但它不仅仅是因为出版商修复价格，它必须昂贵。他们只是做了书店在美国会做的事情：计算消费者愿意支付的价格以及如何仍然可以获得利润（记住：欧元比美元更值得，所以简单地转换了这本书更多比他们实际昂贵的是问题是，虽然它是违法的，但他们卖给他们的书比较较小的链子。所以虽然读者支付相同的价格，但并非所有书商都赚取相同的。\n   这是“斯蒂芬妮”迈耶。我很惊讶这篇文章中没有副本，显然是。\n  作为科隆出生的居民，我深深地伤害了你没有参观我们着名的“DOM”即哥特式大教堂;）\n 如果您想到了一篇新的文章，也许您应该调查科隆人民及其与DOM，Karneval的关系以及如何避免法律“法律”方式（称为“Klüngel” - 但这是一个整体不同的故事）\n 与欧洲的其他国家一样，人们获得了更少和更少的书籍。定价明显高于市场现实。\n  我们可以在过去几年中观察家庭支出中的书籍的一部分，从而减少（除以三个）。\n 每本书的单一价格的法律未订购贵单的豪华市场，但只有机会为市中心的小商店与零售市场最大的公司竞争中生存。 \n一个非常好的重新成立，非常好的写作 - 谢谢你。确实是一个奇妙的事情，至少对新自由主义者来说，他们称之为定价固定卡特尔为涉及的每个人都有利于：零售商，生产者，作者和Readres相似。其中一位评论员表示，出版商以更高的零售商销售他们的书籍。这并不是那么：德国零售价维持（rpm）的法律允许一定的余地，但不是一种让大家伙出于较小的竞争。在我们看到明显差异的地方，营销支出：大型零售商的需求并获得商店内首选展示位置的休息。在过去的30年里，价格没有太远，我参与贸易的时期，精装虚构几乎没有超过25欧元，优质的平装棍子周围的19欧元标记，大众市场有时，但不经常休息超过12欧元。在此期间，通货膨胀非常严重的预订价格 - 事实上，今天的书籍比15年前的10人相对便宜。 rpm也有益，因为它将巨大的零售集团脱离了书籍贸易：德国沃尔玛或特易购的兄弟不能利用书籍作为亏损领导者引诱人们进入他们的商店。另一个评论员表示，阅读已作为德国活动缩减 - 这不是由数据承载的。是的，人们已经以某种方式迁移到互联网和电视，但阅读一直留在驴多年的前10名休闲活动中，没有理由相信这会发生巨大变化。至于电子书：它不是RPM，慢慢通过电子阅读速度 - 它是可用的相对少量的标题（约80.000），结合了一定的文化保守主义，这些标题与一定的文化保守主义相结合，这些标题与某种文化保守主义相结合，这限制了购买readers和电子书的急剧。目前，马赛特徘徊在1％左右。我读了电子书，发现这是一个愉快的体验，但我认为电子书有一个内在的价值，可以迫使我们从纸张切换到屏幕。至于我在纽约的同胞居住并询问为什么美国生活在德国的生活更有趣，因为纽约在美国生活与生活有关？你有没有尝试过跨越国家？与红尘平板，爱荷华州的红尘公寓相比，Bad Berleburg是一个大都会的刺激性。以及我们的朋友竖立了关于“德国解决方案”的最后一次评论 - 获得生命，悲伤！\n 嗨霍尔格，嗯，你有一个关于剩下的美国=纽约外部的一切。我想我在这个国家一直在一点。是的，“外面”这只是非常令人惊讶。我不去过Bad Berleburg。但我最近访问了巴伐利亚树林，没有互联网或智能手机的非常落后的家庭。但他们确实相信进化。他们正在阅读书籍！\n    所以 - 你已经看到了一个哥特式大教堂，你已经看到了他们，呃？好吧，你必须是一个典型的傻瓜。德国出版行业.so强大，如此稳定？询问文学绩效的较小的压力和出版商，那些不会从翻译畅销者中获得利润的人，你将听到完全不同的故事。\n  Herr Helmut Schwarzer，它完全有可能我是一个典型的傻瓜，或者也许是我的\n...... ", "note_en": "1. During a recent visit to Cologne, I avoided the city’s most magnetic tourist attraction – you’ve seen one Gothic cathedral, you’ve seen them all – and instead I explored the city’s bookshops. Large and small, general and specialized, spacious and cramped, there seemed to be no end to the variety. But they all had one thing in common: they were thriving.\n How do the Germans do it? When a huge, once-mighty book-selling chain like Borders is going down in flames across the Atlantic, how do the Germans manage to keep their book publishing industry so diverse, so robust, so stable? How do booksellers consistently turn a profit on everything from  Goethe to  Grass to  Grisham? Is it because of careful planning? Dumb luck? Some mystical Teutonic gene? Or could it be a  Kultur thing?\n 2. Buchladen, a small shop on the north side of Cologne, is as good a place as any to begin searching for answers. It doesn’t look like much from the street – green awning, small display window – but as soon as you enter the shop you’re stunned by the quality and quantity, the variety and beauty of what’s on the shelves. At the front of the shop are new fiction and history books, in hardcover and paperback, by well-known German authors and numerous Americans in translation, including  Philip Roth,  Richard Price,  Nicole Krauss,  Paul Auster, and  Richard Powers. In the paperback fiction section, 30 feet of floor-to-ceiling shelves, I found books by  David Foster Wallace,  Jonathan Safran Foer,  Karin Slaughter,  Don Winslow, and  Elmore Leonard mixed in with German, French, Scottish, Irish, English, and Japanese authors. German readers have catholic tastes. They consume crime novels as hungrily as literary fiction, history, philosophy, erotica, and just about everything else.\n One thing you will not find on the shelves at German bookshops, large or small, is that mainstay of big American bookstores – signs announcing steep discounts on current bestsellers. That’s because the cost of all new books in Germany is strictly regulated by something called the  Buchpreisbindung, a uniform pricing policy that was adopted voluntarily by booksellers in 1888 and became national law in 2002. By forcing all stores and on-line vendors to sell new titles at the same price, the law is, obviously, a boon to small stores that can’t compete with the volume purchasing of the big chains and online giants like Amazon.de and Buch.de.\n “The idea [of the  Buchpreisbindung] was to eliminate price competition in order to promote the sale of little-known books,” says  Simone Thelen, spokeswoman for the Mayersche chain, which was founded in the 19th century and now has 49 stores, mostly in the state of North Rhine Westphalia. “It makes it possible for publishers to publish a variety of books and authors, and it gives us the chance to promote young, unknown authors and books that are not blockbusters.”\n This seemingly counter-intuitive strategy – protecting books by keeping them expensive – is actually in line with much of what goes on in Germany today. The country enjoys the healthiest economy in Europe, rising employment, a balanced budget, and an enviable trade surplus not in spite of, but because of, its well-paid workers and their vast network of social services, including universal (that is, mandatory) health care, plus at least four weeks of paid vacation and in some cases more than seven. It makes perfect sense to prosperous, book-loving Germans to pay a fair, strictly regulated price for new books because they believe that the health of the book industry – that is, of publishers, booksellers, and writers, from famous to unknown – is vital to the health of the whole society.\n The idea of the government regulating the price of consumer goods is anathema to most Americans, who have bought into free-market gospel and the Walmart mantra that price is everything, and lower is always better than higher. It comes as no surprise, then, that many Americans are wailing about the coming cost of universal health care, our onerous tax rate (among the lowest in the industrialized world), and the need to trim the federal deficit by slashing government spending while preserving tax breaks for the rich. And yet, as the Borders debacle illustrates, allowing booksellers in America to set prices anywhere they choose is no guarantee that even the biggest fish will survive. Pity the vanishing small fry.\n Marion Krefting, a sales clerk at Buchladen for the past 13 years, is, like most Germans, widely read, fluent in English, and addicted to foreign travel. Krefting happens to be in love with Australia, which she first visited in the late 1970s and has revisited many times since, most recently two years ago. In Australia she saw first-hand what happens when the government stops regulating the price of books and lets market forces do the job. “The first time I visited Australia, about 35 years ago, they had regulated pricing like we do,” she told me. “When I went back a few years later they had stopped it. What happened was that the bestsellers became cheaper, everything else became more expensive, and there was less variety.” And now the predictable kicker: “The little bookshops don’t exist anymore.”\n Australia’s experience is not unique. After price regulation ended in England, the price of books rose by 8 percent; and when it ended in Sweden, one out of four bookstores went out of business. Always willing to go against the grain, the Swiss, who do not now have a book pricing law, are talking about instituting one.\n Krefting, the daughter of a bookseller, is a fan of such writers as  Tad Williams,  Elizabeth George, and  William Boyd. But her great love is children’s books, and she points with pride to her personal fief, the large, colorful section devoted to children’s books at the back of Buchladen. When a customer comes in and asks for an appropriate book for a 6-year-old girl, Krefting steers her to a book called  Rita das Raubschaf. She gives the customer a concise synopsis of the plot – it’s about a sheep named Rita who gets bored chewing grass and runs off to become a pirate – along with her enthusiastic personal endorsement. The customer buys the book without hesitation. Such crisp professionalism is the norm in German bookstores because clerks are required to study for several years – literature, accounting, and the mechanics of the book business – then pass a standardized exam before they can become certified booksellers. In DIY, blue-sky, go-for-it America, such rigid standards are almost unthinkable. Which is not to say there are no knowledgeable booksellers in the U.S. There are many, of course. It’s just that Americans hope to find knowledgeable employees when they go to a bookstore, while Germans insist on it. To Krefting, the German way makes perfect sense. “This is not a job, it’s a profession I love,” she says. “The pay is not good, the hours are terrible, but I just love books.”\n At a nearby shop called Agnes Buchhandlung, the display window contains copies, in German translation, of  Gary Shteyngart’s   Super Sad True Love Story,  Lorrie Moore’s   A Gate at the Stairs, and  Salman Rushdie’s   Luka and the Fire of Life. The owner,  Uli Ormanns, leaves no doubt about the importance of the  Buchpreisbindung for small shops like his. “It’s absolutely critical to our survival,” he says. Another thing that helps, he adds, is the national network of book warehouses and its shipping system. “Of the one million books available in Germany, we can order 400,000 of them overnight, just like the big chain stores,” Ormanns says. “Other books, like textbooks, technical books, university presses – which are not a big part of our business – we can get in a week.” He then leads me to the corner of the shop devoted to books – in English – by American and British authors. Particularly popular with Agnes Buchhandlung’s customers are  Stephenie Meyer, Philip Roth, Paul Auster, and  Jonathan Franzen. “It’s a small part of our business,” Ormanns says, “but more and more customers are asking for American and English authors in English, usually after they’ve read the book in German.”\n Catherine Brull, a native of Belgium who has worked in the shop for seven years, is getting ready to crack open her new copy of  Super Sad True Love Story, which is priced at 19.95 euros, about $28, including tax. (The sales tax on books in Germany is 7 percent, compared with 19 percent for most consumer goods.) “The German people like the American way of writing,” Brull says. “Sometimes the German authors aren’t easy to read. They have a heavy heritage – Grass,  Mann,  Boll – and they’re always thinking about that.”\n Discounted books are not unheard-of in Germany. When I walked into the venerable Buchhandlung Walther Koenig in the heart of Cologne, I was greeted by a large table festooned with high-quality art books reduced in price by as much as 75 percent. There are four ways sellers can make such sharp price cuts: if the book is used, if it’s damaged, if it was imported from a country without a  Buchpreisbindung, or if the sales are so slow after 18 months that the publisher declares it a “remainder,” thus freeing stores to set their own price. The effect of the rule is that large chain stores tend to offer remaindered books at sharp discounts, which smaller stores rarely try to match. Similarly, there are no price rules on audio books, and therefore it’s almost impossible to find them at small shops. The prices of e-books, which currently account for less than 1 percent of all book sales in Germany, are regulated by the  Buchpreisbindung.\n 3.   Which brings us, finally, inevitably, to the elephant in the middle of the bookshop. I’m talking of course about the differences in reading habits between Americans and Germans – or, to be a bit more broad, between Americans and most of the rest of the civilized world. Simply put, one of the major reasons Germany has a healthy book publishing industry, beyond its pricing law, is because Germans (like the English, the Irish, the Japanese, the French, and many other nationalities) tend to read more, and more seriously, than Americans. I can’t cite statistics to prove this, but after traveling much of the world I know in my bones that it’s true. I became convinced of it the day I boarded an airplane in Dusseldorf and sat next to a perfectly typical German  hausfrau who spent the flight devouring   Foucault’s Pendulum by  Umberto Eco, a novel that has defeated me every time I’ve tried to read it. I remember thinking: Germans are different.\n “It’s true that the tradition of reading is very deep-rooted in German culture,” says  Michael Roesler-Graichen, an editor at the magazine put out by the Borsenverein, the national society of publishers and booksellers based in Frankfurt. “It’s not the whole population. The so-called higher literature, or  belles lettres, is read by a small percentage. But it’s a very vital tradition.”\n In 2007 an Association of American Publishers (AAP) survey revealed that one in four Americans did not read a single book – not one book – the previous year. Things seem to have improved since hitting that nowhere-to-go-but-up nadir. In 2009 the National Endowment for the Arts reported that the number of Americans reading literature (novels, short stories, poems, and plays) had increased for the first time since 1982. And this summer a joint survey by the AAP and the Book Industry Group revealed that American publishers’ net sales rose by 5.6 percent from 2008 to 2010, thanks to surging sales of e-books as well as juvenile and adult fiction. Much is now being made of the ascendancy of e-books and the boost they’re giving to the American book industry. I say hooray. But I’m inclined to wonder if this ramping-up of e-reader and e-book sales is an indicator that Americans are suddenly reading more. I suspect they’re merely downloading more. I hope I’m wrong. Time will tell.\n None of this is to suggest that the German system of selling books could or should be transplanted wholesale to the United States. Nor is it to imply that all Germans are better-read and better-educated than all Americans. Roesler-Graichen, the editor, is happy to set the record straight on that score. “Whenever I visit America, people say, ‘Oh, you Germans are so well educated, you’re so well read,&#39;” he says. Then, with a laugh, he adds, “I have to tell them it’s not true of all Germans.”\n He’s right, of course. But there can be no denying that books occupy a special place in the life of Germany, the country that gave us the printed book. Thelen, the spokeswoman for the Mayersche chain, sums that place up nicely. “Books are not just a commodity here,” she says. “They have a cultural value that has to be saved.”\n   An interesting piece with an error. In Australia the small stores maintained their market share after the abolition of fixed pricing in 1972 and ultimately nearly 40 years later it is the discounters that have closed there are probably more small stores than ever before.\n That is no reason for complacency or smugness however as the market is under threat of contraction, and that is the real issue.. fewer people are using their discretionary spend on the humble book.\n This is exacerbated by high prices at RRP (set by publishers not retailers ) and the capacity of companies with favorable exchange rates to compete on price online (read Amazon and their recent purchase Book Depository)\n Book prices at RRP in this country have been high in international terms before and after the abolition. It’s a nonsense that protecting the the profits of what were almost all exclusively International publishers back in 1972 kept the prices down. It remains a nonsense now.\n Very interesting and well written view from the outside, highlighting the situation over here. Thanks!\n It’s certainly true: While hampering the advent of ebooks in Germany, the Buchpreisbindung is – for the time being – saving the smaller bookstores from sudden decline. Mind you: Times are getting harder and harder for the small shops here, too, even without the rise of ebooks and ereaders. And many had to strike sail during the last years already.\n  (An addendum by the way: If the nice vintage postcard (presumably from the late 60’ies) is there to illustrate Cologne, you are mistaken. It’s the Minster at Bonn.)\n   I live in Germany and Mr. Morris did a great job describing the situation here. Great essay – very insightful. We have to realize that some things are worth preserving — and paying for!\n Nice that an outsider can have these insights into the German culture of books and reading. As a German living in New York, I would even go so far as to say Germany is in general a more enlightened country than America – may it be recycling, health insurance, taxing the rich. All Germans believe in evolution, pay a lot for gas… you name it …., but then, why is life in barbaric America so much more interesting than life in Germany?\n Thank you very very much for this article, because we Germans are also very good at whining, especially the booksellers!\n But it is not true that only because the publisher fixes the price, it has to be expensive. They just do what a bookseller would do in the US: Calculating what price the consumer would be willing to pay and how they can still make a profit (remember: The Euro is more worth than the Dollar, so simply converting makes the books look more expensive than they actually are) The problem is, although it is illegal, they sell their books cheaper to the big chain-stores than to the smaller ones. So although the reader pays the same price, not all booksellers earn the same.\n   It’s “Stephenie” Meyer. I’m surprised that there’s no copyediting in this article, apparently.\n  as a born inhabitant of Cologne I am deeply deeply hurt that you didn’t visit our famous “Dom” i.e. the gothic cathedral ;)\n If you ever think of a new article maybe you should investigate on the people of Cologne and their relationship to the Dom, Karneval and how to avoid the law the “legal” way (called “Klüngel” – but that’s a whole different story)\n As in others countries in Europe, people acquires less and less books. Pricing is obviously higher than the reality of market.\n  We can observe the part of books in household spending has decreased hugely (divided by three) during the last years.\n Law of a single price for each book was not ordered for having an luxury market of expensive items but only to give a chance for little shops in downtown to survive at the competition with retail markets biggest companies.\n A very well reserached and very well written piece – thank you for that. It is indeed a wonderous thing, at least to Neoliberals, that what they would call a price fixing cartel serves to benefit everyone involved: The retailers, producers, authors and readres alike. One of the commentators said that publishers sell their books at higher discounts to larger retailers. This is not quite so: The German law on retail price maintenace (rpm) allows a certain leeway, but not in a way that would allow the big guys to outgun the smaller competition. Where we see marked differences is in the marketing spending: the big retailers demand and get hefty fees for preferred display locations within the shops. Prices have not risen too far over the past 30 years, the period over which I have been involved in the trade, Hardcover fiction hardly ever goes beyond 25 Euros, quality paperback sticks around the 19 Euro mark, mass market sometimes,but not often breaks beyond 12 Euros. Over this period, inflation has outpaced book prices quite severely – in fact, books today are relatively cheaper than they were 10, 15 years ago. Rpm has also been beneficial in that it has kept the huge retail conglomerates out of the book trade: the German brothers of Walmart or Tesco cannot lure people into their outlets by using books as loss leaders. Another commentator said that reading has shrunk as an activity in Germany – this is not borne out by the data. Yes, people have migrated in some ways towards the internet and TV, but reading has been staying in the top 10 leisure activities for donkey’s years and there is no reason to believe this will change dramatically. As for eBooks: It is not rpm that slows down the adoption of electronic reading – it is the relatively small number of titles available (approx. 80.000) , combined with a certain cultural conservatism, that has limited the rush to buy eReaders and eBooks. Currently the maket hovers around 1 per cent. I do read eBooks and find it a pleasant experience, but I do not think that eBooks have an intrinsic value that would oblige us to switch from paper to screen. As for my compatriot living in New York and asking why life in the US is so much more interesting than life in Germany: Since when has New York been associated with life in the USA? Have you ever tried the flyover states? Bad Berleburg is a heaving thrill of a metropolis compared to Red Dust Flats, Iowa… And a last comment for our friend harping on about the “German Solution” – Get a Life, saddo!\n Hi Holger, well, you got a point about the rest of the USA = everything outside of NYC. I guess I have been around in this country quite a bit. And yes, “outside” it’s just very astonishing. I have not been to Bad Berleburg though. But I have recently visited a very backward family in the Bavarian Woods, no internet or smart phones and such. But they did believe in evolution. AND they were reading books!!!\n    So – you’ve seen one gothic cathedral, you’ve seen them all, eh? Well, you must be a quintessential fool. The German publishing industry..so robust, so stable? Ask the smaller presses and publishers of literary merit, those that don’t derive their profits from translating bestsellers, and you will hear an utterly different story.\n  Herr Helmut Schwarzer, It’s entirely possible that I’m a quintessential fool, or maybe my \n......", "posttime": "2021-06-17 07:30:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "书籍,books,德国", "title": "保存书籍通过保持昂贵（2011） ", "title_en": "Saving books by keeping them expensive (2011)", "transed": 1, "url": "https://themillions.com/2011/09/the-german-solution-saving-books-by-keeping-them-expensive.html", "via": "", "real_tags": ["书籍", "books", "德国"]}, {"category": "", "categoryclass": "", "imagename": "612e60f03e73120a73098268bcac164b.jpg", "infoid": 1066341, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "他们的挑战是我给自己的挑战，通常没有太多的水赌，并且足够小的范围，这样我就可以在一两天内运送它，同时保持备用家庭时间。\n 本周末＆＃39; S项目是为集中式泛价构建一个事务资源管理器。像一个区间的探险家一样，但没有加密的开销。\n 系统中的每个节点由哈希表示。因为人类在阅读和快速识别大量时（除了通过它们的漏斗或最后几位）时，所以需要进行视觉表示。\n  我想要一个仍然看起来摘要（不像怪物或机器人那样自思索），并且在圆形的化身UI组件中播放很好。\n    如果您对数学和三角术过敏，请随时在此处与Moredetailed互动示例一起玩。否则，让＆＃39;潜水进入它＆＃39所做的。\n  许多现有的解决方案产生正方形图像，但是头像作为圆形。当圆形时，它们会在角落里丢失信息，所以而不是笛卡尔（x-y）方法，我们＆＃39;重新使用极性（角度半径）坐标。\n  SHA-256哈希有256位，我们需要代表。 Dividinga Circle到256个部分将使每个部分太小才能视觉上有用，只会留下1位＆＃34;价值＆＃34;在每个部分（0或1，黑色或白色）表示。 \n生成的这样的网格的SVG代码看起来像这样（在反应组件中）：  导出const =（）=＆gt; {//等于的RADII const R1 = 1 const r2 = r1 * 0.75 const r3 = r1 * 0.5 const r4 = r1 * 0.25 return（）}  每天真地做这个，每个同心环＆＃39; s radius是1/4的一个/最大的一个/最大的环，给我们这个：  如果我们计算了半径，以便每个部分都有一个相同的区域，我们得到以下结果：  通过求解方程式来计算等区域。 每个部分区域是整个圆面积的1/32。 假设外圆的半径为1，即π/ 32的区域。  要计算环的相关半径，我们将饼图区域与外半径r表示，并将饼图区域与内半径R：Pi R ^ 2  -  Pi R ^ 2一起减去，然后我们从外部迭代。  更多细节 \n我不知道你，但是0.42在美学和书呆子的满意度下都会击中球场，所以让＆＃39;去吧。\n  现在我们在我们的圈子上有32个漂亮的段，我们可以将每个部分映射到哈希中的8位值。\n   我们可以将其拆分为8位（2个十六进制数字），并将其组织为8个8个块以映射到圆环：\n 12 O＆＃39;时钟 - ＆gt; ClockWise31 5F 5B DB 76 D0 78 C4外圈3B 8A C0 06 4E 4A 01 64中间外环61 2B 1F CE 77 C8 69 34中内圈15B FC 94 C7 58 94 ED D3内圈\n                                    31 5F 5B DB 76 D0 78 C4 3B 8A CO 06 4E 4A 01 64 61 2B 1F CE 77 C8 69 34 5B FC 94 C7 58 94 ED D3以填充具有不同颜色的每个部分，我们产生SVG＆lt;路径＆gt ; Polygon.each部分类似于馅饼/比萨饼切片，从圆圈的中心到给定的半径，并覆盖圆圈的1/8。\n 我们可以通过前往中心的所有部分逃脱的原因是因为我们的映射顺序：通过从外部铺设，内部部分将覆盖在Z索引中的外部部分。\n 由于SVG使用笛卡尔坐标，我们＆＃39; LL必须转换我们的Polar LogicInto Cartesian SVG Path命令： \n接口{x：number y：number}函数polar点（半径：数字，角度：数字）：{//角度表示为[0,1 [//注意：我们减去PI / 2开始在中午开始，顺时针/ /三角旋转+倒y轴=顺时针旋转，漂亮！返回{x：RADIUS *。 COS（2 *。PI *角度 - 。PI / 2），Y：RADIUS *。 sin（2 *。pi *角度 -  pi / 2）}}函数moveto（{x，y} :) {return`m $ {x} $ {y}`}函数lineto（{x，y} :) {return` l $ {x} $ {y }`}函数arcto（{x，y}：，半径：数字）{return` $ {Radius} $ {RADIUS} 0 0 0 $ {x} $ {Y }`} const =（{index，Radius}）=＆gt; {const anglea = index / 8 const angleb =（索引+ 1）/ 8 return}\n   为此，我们有很多选择。 8位可以直接映射到256种颜色，如窗口Windows系统，但这需要查找表。相反，我们可以使用HSL（）CSS函数来获得颜色。\n HUE是具有最大影响的组件，而饱和度和闪光可用于为每个部分添加很少的变型。\n 要将8位值映射到3个组件，我们可以将字节划分为：\n  函数mapvalueTocolor（值）{const colorh =值＆gt;＆gt; 4 const颜色=（值＆gt;＆gt; 2）＆amp; 0x03 const colorl = value＆amp; 0x03 const ranalizedh = colorh / 16 const归一化=颜色/ 4 const normalizedl = colorl / 4 const h = 360 *标准化hcons s = 50 + 50 *归一化//饱和度为50和100％const l = 40 + 30 *标准化/ 40％至70％之间的亮度返回`hsl（$ {h}，$ {s}％，$ {l}％）`}\n                                     颜色映射函数可以使用聚焦在亮度信道而不是色调上的高对比度版本。\n  我们的颜色编码遭受了缺陷：两个哈希可以看起来非常相似，但在这里和那里有几个差异。它们可以在色调/饱和度/亮度分量的LSB中出现差异来忽略差异。 \n如果哈希有一些模式，这会很好，这使得Itrandom足够区分但在其自身之内足够一致。秩序与混乱之间的平衡。\n 为了解决这个问题，我们使用XOR操作来计算哈希的灵魂。\n 对于每个戒指，我们XOR形成这个环的字节＆＃39; s部分来计算环＆＃39;灵魂。 （魂器？）\n //每个灵魂都在-1和1函数计算汇位（字节：String []）{const ringlength =。圆形（字节长度/ 4）const rings = [字节。切片（0，铃声），字节。切片（1 *铃声，2 *铃声），字节。切片（2 *铃声，3 *铃声），字节。切片（3 *铃声，4 *铃声）] const xorreducer =（xor：number，byte：string）=＆gt; xor ^ parseint（字节，16）返回{hashsoul :( bytes。减少（xorreducer，0）/ 0xff）* 2  -  1，ringsouls：圆环。地图（环=＆gt;（环。减少（Xorreducer，0）/ 0xff）* 2  -  1）}}} //示例我们的演示散列：// hashsoul：0.2313725490196079 // ringsoul 0：0.09137254901960785 // Ringsoul 1： - 0.8274509803921568 // ringsoul 2：-0.050980392156862786 // ringsoul 3：-0.9529411764705882\n  值得注意的是，我们可以＆＃34;种子＆＃34;随着哈希灵魂的色调，并用每个环灵介绍色调的变形戒指，并具有价值本身。\n 导出函数mapvalueTocolor（{value，hashsoul，ringsoul}）{const colorh = value＆gt;＆gt; 4 const颜色=（值＆gt;＆gt; 2）＆amp; 0x03 const colorl = value＆amp; 0x03 const rancorizeh = colorh / 16 const randalizeds = colors / 4 const rancorizedl = colorl / 4 const s = 50 + 50 *归一化const l = 40 + 30 * rancorimedl返回`hsl（$ {h}，$ {s}％， $ {l}％）`}\n 我们还可以通过根据环形灵魂改变每个环和＃39;突出的凸起来介绍结构变化，以产生惊人的效果： \n这不仅有助于对头像提供更多的唯一性，它还可以帮助最佳色盲人物的可访问性  如果我们改变截面路径的弧形部分的半径和标志，每个环＆＃39;开始角度，我们可以获得有趣的变化：  在彩色映射值中有一点调整，我们可以轻松地将ThisteChnique延伸到任意哈希长度（只要所述长度可被32即）即可。  它恰好发生在我开始这个项目时，集中硬币使用SHA-256，但后来在切换到SHA-384，每个部分给出12位。  您可以在集中式硬币资源管理器中看到哈希托尔（谢谢@Wzulfikar的名称），或在操场上使用viniants。  我将在稍后将代码发布为NPM包，同时在GitHub上的此课程以及组件本身的源代码。 ", "note_en": "They are little challenges I give myself, usually without too many stakesinvolved, and with small enough a scope so that I can ship it in a day or two,while keeping spare family time.\n This weekend&#39;s project is to build a transaction explorer for the  Centralized Coinexperiment. Something like a blockchain explorer, but without the crypto overhead.\n Each node in the system is represented by a hash. Because humans areterrible at reading and quickly identifying large numbers (other than by theirfirst or last few digits), a visual representation is needed.\n  I wanted one that still looks abstract (not as opinionated as monsters or robots),and that plays nice in a rounded avatar UI component.\n    If you are allergic to maths and trigonometry, feel free to play with the moredetailed  interactive example here. Otherwise, let&#39;s dive intohow it&#39;s done.\n  Many of the existing solutions produce square images, yet avatars are oftendisplayed as circles. They would lose information on the corners when rounded,so instead of a cartesian (x-y) approach, we&#39;re going to use polar (angle-radius)coordinates instead.\n  SHA-256 hashes have 256 bits of information that we need to represent. Dividinga circle into 256 sections would make each section too small to be visually useful,and would only leave 1 bit of &#34;value&#34; to represent in each section(0 or 1, black or white).\n   The resulting SVG code for such a grid looks like this (in a React component):\n export  const     =  ( )  =&gt;  {  // Equal radii  const r1  =  1  const r2  = r1  *  0.75  const r3  = r1  *  0.5  const r4  = r1  *  0.25  return  (                               ) }\n Doing this naively, with each concentric ring&#39;s radius being 1/4th of theoutermost/largest one gives us this:\n                                    If we calculate the radii so that each section has an equal area, we getthe following result:\n                                   Equal areas are calculated by solving a system of equations. Each section area is 1/32nd of the area of the whole circle. Assuming the outer circle has a radius of 1, that&#39;s an area of  π/32.\n To compute the associated radius for a ring, we express the pie slice area with the outer radius R and subtract the pie slice area with the inner radius r:  Pi R^2 - Pi r^2, then we iterate from the outside in.\n More details\n   I don&#39;t know about you, but  0.42 hits the ballpark both in aesthetics and nerd-sniping satisfaction, so let&#39;s go for that.\n  Now that we have 32 nice looking sections on our circle, we can map each sectionto an 8-bit value in the hash.\n   We can split it in 32 blocks of 8 bits (2 hexadecimal digits), and organise them by4 blocks of 8 to map to the rings:\n 12 o&#39;clock -&gt; clockwise31 5f 5b db 76 d0 78 c4 Outer ring3b 8a c0 06 4e 4a 01 64 Middle-outer ring61 2b 1f ce 77 c8 69 34 Middle-inner ring5b fc 94 c7 58 94 ed d3 Inner ring\n                                    31 5f 5b db 76 d0 78 c4 3b 8a c0 06 4e 4a 01 64 61 2b 1f ce 77 c8 69 34 5b fc 94 c7 58 94 ed d3 In order to fill each section with a different colour, we generate an SVG  &lt;path&gt; polygon.Each section resembles a pie/pizza slice, going from the centerof the circle to a given radius, and covering 1/8th of the circle.\n The reason we can get away with all sections going to the center is because of our mapping order: by laying out from the outside in, the inner sections will be overlaid on top of the outer ones in z-index.\n Since SVG uses cartesian coordinates, we&#39;ll have to convert our polar logicinto cartesian SVG path commands:\n interface    { x :  number y :  number } function  polarPoint ( radius :  number , angle :  number ) :    {  // Angle is expressed as [0,1[  // Note: we subtract pi / 2 to start at noon and go clockwise  // Trigonometric rotation + inverted Y axis = clockwise rotation, nifty!  return  { x : radius  *   . cos ( 2  *   . PI  * angle  -   . PI  /  2 ) , y : radius  *   . sin ( 2  *   . PI  * angle  -   . PI  /  2 )  } } function  moveTo (  { x , y  } :   )  {  return   ` M   ${x }    ${y } ` } function  lineTo (  { x , y  } :   )  {  return   ` L   ${x }    ${y } ` } function  arcTo (  { x , y  } :   , radius :  number )  {  return   ` A   ${radius }    ${radius }  0 0 0   ${x }    ${y } ` } const     =  (  { index , radius  } )  =&gt;  {  const angleA  = index  /  8  const angleB  =  (index  +  1 )  /  8        return   }\n   For that, we have many options. 8 bits could map directly to 256 colours like theold Windows systems, but that would require a lookup table. Instead, we cangenerate colours using the   hsl() CSS function.\n Hue is the component that has the most visual impact, while Saturation andLightness can be used to add little variants to each section.\n To map our 8 bit value to 3 components, we can divide the byte into:\n  function  mapValueToColor ( value )  {  const colorH  = value  &gt;&gt;  4  const colorS  =  (value  &gt;&gt;  2 )  &amp;  0x03  const colorL  = value  &amp;  0x03  const normalizedH  = colorH  /  16  const normalizedS  = colorS  /  4  const normalizedL  = colorL  /  4  const h  =  360  * normalizedH  const s  =  50  +  50  * normalizedS  // Saturation between 50 and 100%  const l  =  40  +  30  * normalizedL  // Lightness between 40 and 70%  return   ` hsl(  ${h } ,   ${s } %,   ${l } %) ` }\n                                     The colour mapping function could use a high-contrast version that focuses on the Luminosity channel rather than the Hue.\n  Our colour encoding suffers from a flaw: two hashes can look very similar, buthave a few bits of difference here and there. They can go unnoticed especiallyif differences occur in the LSBs of hue/saturation/lightness components.\n  It would be nice if there was some pattern to a hash that makes itrandom enough to be distinguished yet coherent enough within itself.A balance between order and chaos.\n In order to fix that, we compute the  soul of the hash, using XOR operations.\n For each ring, we XOR the bytes that form this ring&#39;s section to compute the  ring&#39;s soul.   (horcruxes?)\n // Each soul is between -1 and 1 function  computeSouls ( bytes :  string [ ] )  {  const ringLength  =   . round (bytes . length  /  4 )  const rings  =  [ bytes . slice ( 0 , ringLength ) , bytes . slice ( 1  * ringLength ,  2  * ringLength ) , bytes . slice ( 2  * ringLength ,  3  * ringLength ) , bytes . slice ( 3  * ringLength ,  4  * ringLength )  ]  const  xorReducer  =  ( xor :  number , byte :  string )  =&gt; xor  ^  parseInt (byte ,  16 )  return  { hashSoul :  (bytes . reduce (xorReducer ,  0 )  /  0xff )  *  2  -  1 , ringSouls : rings . map ( ring  =&gt;  (ring . reduce (xorReducer ,  0 )  /  0xff )  *  2  -  1 )  } } // Example for our demo hash: // hashSoul: 0.2313725490196079 // ringSoul 0: 0.9137254901960785 // ringSoul 1: -0.8274509803921568 // ringSoul 2: -0.050980392156862786 // ringSoul 3: -0.9529411764705882\n  Notably, we can  &#34;seed&#34; the Hue with the hash soul, and introduce hue varitionsper-ring with each ring soul, and with the value itself.\n export  function  mapValueToColor (  { value , hashSoul , ringSoul  } )  {  const colorH  = value  &gt;&gt;  4  const colorS  =  (value  &gt;&gt;  2 )  &amp;  0x03  const colorL  = value  &amp;  0x03  const normalizedH  = colorH  /  16  const normalizedS  = colorS  /  4  const normalizedL  = colorL  /  4     const s  =  50  +  50  * normalizedS  const l  =  40  +  30  * normalizedL  return   ` hsl(  ${h } ,   ${s } %,   ${l } %) ` }\n We can also introduce structural variations by changing each ring&#39;s startingangle based on the ring soul, to create a staggering effect:\n   Not only does this help give a bit more uniqueness to the avatar, it also helpswith accessibility for colour-blind people\n  If we change the radius and flags for the arc part of the section paths andplay with each ring&#39;s starting angle, we can obtain interesting variations:\n   With a bit of tweaking in the colour mapping value, we can easily extend thistechnique to arbitrary hash lengths (as long as said length is divisible by 32).\n It so happens that when I started this project, Centralized Coin was using SHA-256,but later on switched to SHA-384, which gives 12 bits per section.\n  You can see the hashvatars  (thanks to  @wzulfikar for the name)in action in the Centralized Coin Explorer,or play with the variants yourself  on the playground.\n I will publish the code as an NPM package later, in the mean time the source code for this articleis on GitHub, as well as the component itself.", "posttime": "2021-06-17 07:30:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代表,representing,const", "title": "代表SHA-256作为头像 ", "title_en": "Representing SHA-256 Hashes as Avatars", "transed": 1, "url": "https://francoisbest.com/posts/2021/hashvatars", "via": "", "real_tags": ["代表", "const"]}, {"category": "", "categoryclass": "", "imagename": "7da31021a15afb77e936607dadf4ea1f.jpg", "infoid": 1066339, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "麦迪逊大道，我们有一个问题。创意已经死了，电子表格和算法谋杀了它。机器人胜利，结果是令人沮丧的。 “没有人被解雇购买IBM，”他们曾经说过。现在，没有人被解雇购买Facebook广告。\n 我们都知道比令人讨厌的人有更好的方法。广告不应该推动人们想要的东西，它应该与他们想要的东西一致。这就是为什么我们在未提出我们决定在我们呼叫开源广告的新型号上建立我们的业务。\n 开源广告：通过释放媒体（尤其是图像）推广品牌的行为，以其产品为公众使用和分发免费。\n 我们与互联网的产品展示伴侣的品牌。以品牌为特色的内容被创建者拾取并重新批准，通过文章，博客帖子，演示和社交媒体在互联网上有机蔓延。\n 最终结果是远远超过目前挫败消费者和广告商的模型的路径。我们知道，因为它为我们每天营造的创造者和品牌工作。\n   这些天人们讨厌广告。他们令人讨厌，令人毛骨悚然，和中断你得到你想要的东西。 Facebook，Google和YouTube可能改变了游戏，而是他们将行业推向了深黑色的一面。\n 但曾几何时，在点击统治之前，广告旨在引人注目。想到苹果，大众，Absolut和Nike的经典活动。 \n在这个时代，广告差不多转换;它希望人们感受到一些东西。它依靠伟大的创意（和难忘的视觉效果）来赢得人们的注意，而不是隐私入侵和针对广告来购买它。结果，品牌得到了两个世界：销售和长期品牌股权。\n    遗憾的是，我们已经失去了那些伟大的Ogilvy-Esque，创意活动，并用挡风玻璃传单，直邮竞选和门标签的数字等同物取代了它们。多么贪睡。\n  谁应该责备？广告工业综合体，在中断，编程广告和令人毛骨悚然的隐私入侵上销售过时的方法过度依赖。这是一个行业的结果，它越来越巨大的力量，建在卡片之家。\n 大广告喜欢告诉品牌他们的广告如何达到千禧一代，以及视频如何“性感”。但这是一些数字大广告不希望你看到：\n 从2018年到2019年，与广告拦截的世界各地的设备总数从1.42亿到高达615万人上升。 （ 来源）\n 45％的人民报告“我不再发现在线广告了，即使我不阻止他们。” （ 来源）\n  96％的美国人民选择了最新的Apple iOS中的应用程序跟踪。 （ 来源） \n消费者不是唯一的痛苦;品牌也是受害者。他们被迫将钱扔进广告工业综合管道，以达到大量的人，但是在只转化一小部分时，还会加入许多人。在短期内，这推动了一些销售。但从长远来看，这对他们的品牌带来了越来越多的人。凭借摊薄品牌，您必须继续支出增加金额以获得新客户。大广告再次获得，品牌丢失。什么是腐烂的系统。\n   开源广告建立在意图型号而不是中断的模型上。它将品牌内容变成了促进在线媒体的创造者和策展人的手中，谁反过来又为他们的观众重新培养它。\n 这个过程提供了不同（更好）的原籍故事;一个是有机而不是加工的。煽动互动不是“这是一个广告”，它是“我是一个创造者，我需要一个图像，所以我可以制作我关心的东西。”这是一个与出版物和创作者对齐品牌的有机方式;然后，这些人使用该品牌图像来讲述已经信任他们的观众的故事。\n   品牌被迫在创造性营销的乐观和付费媒体购买的群众之间进行选择。通过开源广告，您可以拥有两者。\n 想想海洋喷涂滑板（真实姓名：Nathan Apodaca）在高速公路上滑动到Fleetwood Mac。剪辑到处都是在线，架起了数千万个景色。这是品牌无法计划的东西，它只能有机地发生。\n  然而，品牌不能只是坐在身边，等待这种闪电罢工;他们需要计划预算，他们需要广告尺度。因此，即使它们为像海洋喷射视频等有机病毒的东西产生较差的结果，方案广告预算也会呈指数级增长。\n 开源广告提供两全其美的佼佼者。它将您的品牌放在诸如Apodaca这样的数百万个创造者的手中（和手机/笔记本电脑）。当您让创造者使用您的图像时，他们到处都会到处。这种品牌种植是一种自然的方式，提供规模，同时保留了当创造者在创造真正意图中创造的品牌时导致创造品的独特，真实的感觉。 \n“但如果去这条路线，我的品牌会安全吗？”是的。这就是为什么你不应该担心：首先，在知识产权法下，您有能力发出灭亡通知，以删除对您品牌负面侵犯的内容。其次，创造者将以消极的方式使用品牌图像的最小风险。我们有超过3500万的图片下载的品牌内容，但只有五个不恰当的使用情况。基本上，这是一个非问题。为什么？在很大程度上，它＆＃39; s是因为未提出是一个策划的环境。只有一个图像中只有一个符合未提交的提交指南。高质量的视觉效果导致高质量的使用。此外，品牌可以选择他们希望首先分享的视觉效果。通过使用首选内容涂抹品牌很困难。当您考虑上行状态时（即将以积极的方式传播您的品牌视觉效果到数百万人），机会是指数级的大于风险。为创作者提供许可单据;不要害怕去病毒。\n  最有价值的数字房地产不是出售，它由创造者拥有，他们赢得了他们忠诚的受众的信任。开源广告允许品牌以与这些创造者以福利的方式与这些创造者对齐。\n    他们在高度信任的创造者的沙箱中结束，知道如何与观众交谈。\n   消费者信任他们所知道的人使用的这些图像，这些图像是随机的“媒体单位”，可以中断他们的一天。\n 图像使用情况并不源于付费交易，它始于创造者的真实愿望来展示品牌。真正的热情没有替代品。\n  在创造者和观众之间保持信任桥梁。创作者正在使用此内容，因为他们想要，而不是因为他们得到报酬。\n    未提出视觉级别占据互联网 - 在每月数万个互联网上占有超过数万人（和成长）的观众（和成长）。每个月的最受欢迎的平台和网站。随着互联网变得更加视觉，开源广告是一种品牌骑那波的方式。 \n获取图像。未提出与品牌一起使用，以查找与广告系列的目标对齐的视觉效果（如果尚未存在，我们有助于查找摄影师以创建它们）。目标是为了品牌印象是显而易见的，但不是令人讨厌的。\n 图像出现在结果中。然后，图像介绍在未提出的内容上浏览相关搜索，其中他们被创建者下载。\n 创作者使用图像。创建者搜索他们想要在他们的创作中使用并在线传播它们的视觉效果。 （适用于品牌的好消息：创建者往往使用与undleash上的其他图像相同的速率使用品牌图像。）\n Creator＆＃39; S Content由信任制造商信任的受众观看。图像视图指数展示，推动品牌的意识及其期望的定位。\n 品牌获得结果。通过API集成和反向图像搜索使用该品牌图像的文章，图像和其他创建的追踪结果。\n 这是品牌实现大规模规模相关性的完美方式。就好像品牌可以选择将其新闻套件纳入数百万创作者渴望使用其Hi-Res品牌图像。\n   我们曾经合作过超过70亿美元的品牌。这个品牌种植导致主要出版物，博客帖子，Instagram帖子，主题演示等的品牌视觉效果超过3500万。 \n根据研究公司Kantar进行的品牌升降机研究，未提出电视和现有的数字频道，包括Instagram，2x-5x。  92％的品牌尝试了一个未提出的开放源广告活动，今天仍然与我们合作。  开源广告提供了一种新的方式。 它的中断不那么少，意图更少。 较少入侵，更加选择。 摩擦少，更多自由。 少买入，更赚钱。 这是广告工业综合体的解毒剂。 和Phew，我们现在需要那个。  如果您想了解更多有关开源广告的更多信息，请联系。  我们＆＃39; LL在未提出品牌上的广告和更新时分享更多信息。 如果您＆＃39; d喜欢看到它们，您可以在此订阅我们的新新闻通讯。 ", "note_en": "Madison Avenue, we’ve got a problem. Creative is dead and the spreadsheets and algorithms murdered it. The bots have triumphed and the result is mind-numbingly dull. “Nobody gets fired for buying IBM,” they used to say. Now, nobody gets fired for buying Facebook ads.\n We all know there’s a better way than annoying people. Advertising shouldn’t push against what people want, it should  align with what they want. That’s why at Unsplash we’ve decided to build our business on a new model we call  Open Source Advertising.\n Open Source Advertising:  the act of promoting a brand by releasing media (especially images) featuring its product(s) to the public to use and distribute free of charge.\n The brands we partner with say it’s like product placement for the internet. Content featuring a brand gets picked up and repurposed by creators, spreading organically across the internet via articles, blog posts, presentations, and social media.\n The end result is a path far superior to the model that currently frustrates consumers and advertisers alike. And we know because it’s working for the creators and brands we partner with at Unsplash every day.\n   People hate ads these days. They’re annoying, creepy, and interrupt you from getting what you want. Facebook, Google, and YouTube could have changed the game, but instead they pushed the industry even further toward the dark side.\n But once upon a time, before clicks ruled, ads aimed to be compelling. Think of the classic campaigns from Apple, Volkswagen, Absolut, and Nike.\n  During this era, advertising was about more than conversion; it wanted people to  feel something. It relied on great creative (and memorable visuals) to  earn people’s attention instead of privacy invasions and targeted ads to  buy it. As a result, brands got the best of both worlds: sales and long-term brand equity.\n    Sadly, we’ve lost those great, Ogilvy-esque, creative campaigns and replaced them with the digital equivalents of windshield flyers, direct mail campaigns, and door tags. What a snooze.\n  Who’s to blame? The advertising-industrial complex, which sells an outdated approach over-reliant on interruption, programmatic ads, and creepy privacy invasions. It’s the result of an industry that’s gained enormous power yet is built on a house of cards.\n Big Ad loves to tell brands how their ads reach millennials and how video is “sexy.” But here’s some numbers Big Ad doesn’t want you to see:\n From 2018 to 2019, the total number of devices around the world with ad blockers rose from 142 million to upwards of 615 million. ( source)\n 45% percent of people report “I don’t notice online ads anymore, even if I don’t block them.” ( source)\n  96% of US people opted out of app tracking in the latest Apple iOS. ( source)\n Consumers aren’t the only ones suffering; brands are victims too. They are forced to keep throwing money into the advertising-industrial complex pipeline in order to reach a ton of people, but wind up infuriating many of them while converting only a tiny fraction. In the short-term, this drives some sales. But in the long-term, this negatively impacts their brand by annoying more and more people. And with a diluted brand, you have to keep spending increasing amounts to get new customers. Big Ad wins again and brands lose.  What a rotten system.\n   Open Source Advertising is built on a model of intention instead of interruption. It gets branded content into the hands of the creators and curators who fuel online media who, in turn, repurpose it for their audiences.\n This process provides a different (and better) kind of origin story; one that’s organic instead of processed. The inciting interaction isn’t “this is an ad,” it’s “I’m a creator and I need an image so I can make something I care about.” It’s an organic way to align brands with publications and creators; these people then use that brand imagery to tell stories to an audience which already trusts them.\n   Brands have been forced to choose between the playfulness of creative marketing and the mass reach of paid media buying. With Open Source Advertising, you can have both.\n Think of the Ocean Spray-sipping skateboarder (real name: Nathan Apodaca) gliding down the highway while grooving to Fleetwood Mac. The clip was everywhere online, racking up  tens of millions of views. That’s the kind of thing a brand can’t plan, it can only happen organically.\n  However, brands can’t just sit around and wait for this kind of lightning to strike; they need to plan budgets and they need advertising that scales. As a result, programmatic ad budgets have grown exponentially even though they yield inferior results to something that’s organically viral like the Ocean Spray video.\n Open Source Advertising delivers the best of both worlds. It puts your brand in the hands (and phones/laptops) of millions of creators like Apodaca. And when you let creators use your images, they wind up everywhere. This kind of  brand planting is a natural way to provide scale while retaining the unique, authentic feeling that results when a creator uses a brand in what they’re creating with genuine intent.\n “But will my brand be safe if go this route?” Yes. Here’s why you shouldn’t worry: First, under intellectual property law, you have the ability to issue a takedown notice to remove content that negatively infringes on your brand. Second, there’s minimal risk that creators will use your brand imagery in a negative way. We’ve had over 35 million image downloads of branded content yet there have been only five instances of inappropriate usage. Basically, it’s a non-issue. Why? In large part, it&#39;s because Unsplash is a curated environment. Only one in a hundred images meet the submission guidelines of Unsplash. High quality visuals result in high quality usage. Plus, brands get to choose which visuals they want to share in the first place. It’s tough to smear a brand by using its preferred content. When you consider the upside (i.e. creators spreading your brand visuals in a positive way to millions of people), the opportunity is exponentially greater than the risk.  Give creators a permission slip; don’t be afraid to go viral.\n  The most valuable digital real estate is not for sale, it’s owned by creators who have earned the trust of their loyal audiences. Open Source Advertising allows brands to align with these creators in a symbiotic way that benefits everyone involved.\n    They wind up in the sandbox of creators who are highly trusted and know how to speak to their audience.\n   Consumers trust these images used by someone they know more than random “media units” that interrupt their day.\n The image usage doesn’t originate in a paid transaction, it begins with the creator’s authentic desire to show the brand. There’s no substitute for authentic enthusiasm.\n  A bridge of trust is maintained between creator and audience. Creators are using this content because they  want to, not because they’re getting paid to.\n    Unsplash visuals dominate the internet – reaching an audience of more than 300 million people (and growing) across tens of thousands of the internet&#39;s most popular platforms and websites each month. As the internet becomes more visual, Open Source Advertising is a way for brands to ride that wave.\n  Get images. Unsplash works with brands to find visuals that align with the goals of the campaign (if none exist yet, we help find photographers to create them). The goal is for the brand impression to be obvious but not obnoxious.\n Images appear in results. The images then appear promoted across relevant searches on Unsplash where they’re downloaded by creators.\n Creators use images. Creators search for visuals they want to use in their creations and spread them online. (Good news for brands: Creators tend to use branded images at the same rate they use other images on Unsplash.)\n The creator&#39;s content is viewed by audiences who trust the maker. Image views spread exponentially, driving awareness to the brand and its desired positioning.\n Brands get results. Unsplash tracks results via API integrations and reverse image searches revealing the articles, images, and other creations using the brand’s image.\n It’s the perfect way for brands to achieve relevance at mass scale. It’s as if a brand had the option to get its press kit into the hands of millions of creators eager to use its hi-res brand imagery.\n   Brands we’ve worked with have gotten over 7 billion impressions. This brand planting has resulted in over 35 million uses of brand visuals in major publications, blog posts, Instagram posts, keynote presentations, and more.\n According to brand lift studies conducted by the research firm Kantar, Unsplash outperforms TV and existing digital channels, including Instagram, by 2x-5x.\n 92% of the brands that have tried an Open Source Advertising campaign with Unsplash are still working with with us today.\n   Open Source Advertising provides a new way. It’s less interruption, more intention. Less invasion, more opt-in. Less friction, more freedom. Less buying attention, more earning it. It’s the antidote to the advertising-industrial complex. And phew, we need that right now.\n If you’d like to learn more about Open Source Advertising,  get in touch.\n We&#39;ll be sharing more of our point of view on advertising and updates on Unsplash for Brands. If you&#39;d like to see them, you can subscribe to our new newsletter  here.", "posttime": "2021-06-17 07:29:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,喜欢,likes,品牌", "title": "没有人喜欢广告。 所以让我们做点什么 ", "title_en": "No one likes ads. So let’s do something about it", "transed": 1, "url": "https://unsplash.com/blog/no-one-likes-ads-so-lets-do-something-about-it/", "via": "", "real_tags": ["广告", "喜欢", "likes", "品牌"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066338, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果我不得不在黑暗中挥杆，我会猜想你的生活中可能需要很多事情。如果我在它上投注它，我会说你的许多人都没有说过你的＆＃39;\n 不幸的是，如果你是绝大多数人的一部分（92％确切）我＆＃39; D是正确的。\n 推迟整个个性，缺陷，自尊＆amp是非常容易和缓解的;激励模糊的无法解决的原因。我自己做了一点，我知道你也知道你们。\n  毕竟，如果你能记住的那样，你是一定的方式，那么也许你应该假设它是谁是对的？客观地它可能是你长大的环境的混合物，遗传/脑化学以及所有那些有趣的东西吗？你＆＃39;从出生以来一直是一个拖延者，你＆＃39;自幼儿园以来感受到社会尴尬。这些事情至少不适合你。这只是你是谁，而你＆＃39; ll学会解决它。没有任何意义地解决嵌入到您的DNA中的东西。\n 在点击此页面之前，我想我即将推出Tony Robbins风格的自助指南（我的样子），请用以下招待我。\n  如果你没有答案，感觉自然只是做出一些东西。写一些听起来有些讨厌的人可能会同意它。\n 不要担心我＆＃39;除非有人为我提供优惠，否则不录制你的类型。 \n对于你实际上努力完成提示的人，你可能会注意到它是不是那些难以提出的东西。\n 你也可能注意到你的答案都有一定程度的真理。虽然一个人可能比另一个更客观。\n  如果其中一个人必须在你的思想中留下你的思想，你会选择哪一个？\n   我不是试图问你哪一个更接近真相。但是，无论你选择专注的哪一个肯定会影响你生命中所做的决定。像这种东西一样烦人可能会遇到真正的否定。专注于限制的人将拥有更多。即使他们有效。\n 我们从我们的思想中选择数据来证实我们已经相信自己和世界的真实。\n 几乎完整的自我身份归结为确认偏见，数据不足。\n 当谈到自我形象时，一切都可以是真的（和假），你可能比你＆＃39更少客观。 \n也许？我当然想相信答案总是是的。您可以提高自尊，信心和动力到您认为不可能的级别。至少这太多了。您可以在您可能认为不可改变的一天内更改深刻的植物性格特征。但也许不是所有这些。\n 但是，也许你专门可以＆＃39; t。也许你完全正确地对待自己。您可以以某种方式设法构建自己的身份，纯粹的客观性，并且没有增长的空间。也许你已经完美了，或者你可能只是吮​​吸的方式比其他人都多或者得到真正不可能的手。那个＆＃39;肯定是读这件事的人。我真的很抱歉你必须通过这篇文章来留下来。\n 但事实是大多数人确实满足最低要求，以达到目标并改善更好。他们可能已经知道，但仍然无所事事。不幸的是，如果他们不做关于它的事情，他们会aren＆＃39; t将获得一个非常满足的生活。真的没有任何方式。\n 对于大多数人来说，他们确切职位的人已经完成了他们可以梦寐以求的一切。\n 好消息是它＆＃39;因为你想像你的想法一样难以变化你的心态。\n 就像一个精神上的沙发马铃薯，你可能会允许你的信心和自我信仰被剥夺出色。这可能是你改变的时间。\n 非常深刻，我知道。如果我有一个不太恼火的写作方式，我会有。 \n到目前为止，这主要是德拉米。 我肯定是你＆＃39;在自助中看到了一百万个文章，用同样的几个点爆炸你，但最终让你没有任何东西可以申请。  希望我能为您提供一些您实际上可以做的事情。 实际上会让你注意到你思考和感受的方式差异。  所有这一切都是，是练习。 精神练习，迫使你从角度思考，你逃离了所有习惯的。 也许甚至想到你一生中从未过的想法。  如果你是整个生命的长期拖延者，你可能永远不会问自己：  因为你为什么要这样做？ 它没有任何意义。 但是你怎么能期望改变你生命中每一天不断重申自己的东西？  你必须知道它的感觉是成为你＆＃39的人;重申不好......你的人和＃39;重新。 ", "note_en": "If I had to take a swing in the dark here I would guess that there are probably a lot of things you want to accomplish in your life. If I was betting money on it I&#39;d say you haven&#39;t accomplished many of them.\n Unfortunately if you are part of the vast majority of people  (92% to be exact) i&#39;d be correct.\n It’s incredibly easy and relieving to defer the entirety of your personality, flaws, self esteem &amp; motivation onto vague unsolvable causes. I’ve done it quite a bit myself and I know you&#39;ve all done it too.\n  After all, if you&#39;ve been a certain way since you can remember, then maybe you should just assume it’s who you are right? Objectively it&#39;s probably a mixture of the environment you grew up in, genetics / brain chemistry and all that fun stuff right? You&#39;ve been a procrastinator since birth, you&#39;ve felt socially awkward since kindergarten. These things don’t change, at least not for you. It’s just who you are, and you&#39;ll learn to work around it. No point in addressing something that&#39;s embedded into your DNA.\n Before you click off this page thinking I’m about to launch into a Tony Robbins style self help guide (I kind of am), please just entertain me with the following.\n  If you don’t have an answer that feels natural just make something up. Write something that sounds like some annoying person somewhere would probably agree with it.\n Don&#39;t worry I&#39;m not recording what you type unless someone offers me a good price.\n    For the few of you that actually tried to complete the prompts you probably noticed that it wasn&#39;t all that difficult to come up with something.\n You probably also noticed that both of your answers had some degree of truth to them. Although one might be more objective than the other.\n  If one of these had to be engrained into your mind for the rest of your life which one would you pick?\n   I&#39;m not trying to ask you which one is closer to the truth. But whichever one you chose to focus on would surely impact the decisions you make throughout your life. As annoying as this kind of stuff may come across as there really isn&#39;t any denying it. The people who focus on limitations will have more of them. Even if they are valid.\n We pick the data from our minds to confirm what we already believe to be true of ourselves and the world.\n Almost the entirety of our self identity comes down to confirmation bias and there is no shortage of data.\n When it comes to self image pretty much everything can be true (and false) and you are probably much less objective than you&#39;d like to think.\n    Maybe? I would of course like to believe the answer is always yes. You can boost your self esteem, confidence and motivation to levels you thought impossible. At least that much is true. You can change deeply engrained personality traits in a day that you probably thought were unchangeable. But maybe not all of them.\n However, maybe you specifically can&#39;t. Maybe you are entirely right about yourself. You have somehow managed to build your self identity out of pure objectivity and there is no room for growth. Maybe you are already perfect or maybe you just suck way more than everyone else or got dealt a truly impossible hand. That&#39;s definitely the case for someone out there reading this. I&#39;m truly sorry you had to get through this article just to be left with that.\n But the truth is most people do meet the minimum requirements to reach their goals and change for the better. And they probably know that already but still do nothing. Unfortunately if they don&#39;t do something about it they aren&#39;t going to have a very fulfilled life. There really isn&#39;t any way around that.\n For most people, someone in their exact position has accomplished everything they could dream of.\n The good news is that it&#39;s probably not going to be as hard to shift your mindset as you would think.\n Like a mental couch potato, you may have allowed your confidence and self beliefs to get ridiculously out of shape. It’s probably time that you change that.\n Very deep, I know. If I had a less irritating way of writing that I would have.\n  So far this has been mostly drivel. I&#39;m sure you&#39;ve seen a million articles in the self help niche blasting you with the same few points but ultimately leaving you with nothing you can apply.\n Hopefully I can offer you something that you actually can do. Something that will actually make you notice a difference in both the way you think and feel.\n And all it really is, is exercises. Mental exercises that force you to think from perspectives that you aren&#39;t all that used to. Maybe even think thoughts that you have never had in your entire life.\n If you have been a chronic procrastinator for your entire life, you&#39;ve probably never asked yourself:\n  Because why would you ever do that? It doesn&#39;t make any sense. But how can you ever expect to change something you constantly reaffirm to yourself every single day of your life?\n You have to know what it feels like to be someone you&#39;re not to be well... someone you&#39;re not.", "posttime": "2021-06-17 07:28:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "自尊,esteem,可能", "title": "如何提升自尊和停止拖延 ", "title_en": "How to Boost Self Esteem and Stop Procrastinating", "transed": 1, "url": "https://neuralshifter.com/posts/boost-self-esteem-stop-procrastination", "via": "", "real_tags": ["自尊", "esteem", "可能"]}]