[{"category": "", "categoryclass": "", "imagename": "d13717388dee65ae9ccf4d12f27c6858.jpg", "infoid": 1000741, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "成人直播网站CAM4发生了一起数据泄露事件，暴露了超过7TB的会员个人身份信息。\n这起事件是由安全侦探和阿努拉格参议员发现的。PII存储在超过108.8亿条数据库记录中。故障是错误配置的Elasticsearch群集。\nPII之所以被租用，是因为该网站的一个生产数据库在配置错误的Elasticsearch服务器上对互联网开放。CAM4每年约有20亿访问者，会员每周播放的成人内容超过100万小时。这使得每天播放的私人节目超过75，999个。\n好消息是，在事件报道后不久，CAM4的爱尔兰母公司Granity Entertainment立即撤下了这个不安全的数据库。\n显然，CAM4的用户记录包含各种不同组合的PII，包括姓名、性取向、电子邮件、IP地址、电子邮件信息记录，甚至用户的私人对话。\n此外，1100万条记录中还包括至少一个来自Gmail、iCloud和Hotmail等电子邮件提供商的电子邮件地址。这使得与成人站点相关的高度敏感的信息非常丰富。\n经过详细的分析，安全研究人员发现，650万受攻击的CAM4用户是美国居民。根据安全侦探的报告，其他受影响的国家包括巴西和意大利用户：\n美国、巴西和意大利用户受到的影响最大，尽管由于多个条目重复，很难准确估计电子邮件记录的确切数量。不出所料，阿联酋、沙特阿拉伯和伊朗等国的词条都为零，因为这些国家在国内禁止成人内容。\n研究人员指出，欺诈检测日志的可用性可以使恶意黑客更好地了解网络安全系统是如何建立的。然后，这些知识可以作为威胁参与者的有效验证工具加以利用，从而实现更高级别的服务器渗透。\n涉及恶意软件的恶意攻击也可能被启用，因为“网站后端数据可能被利用来利用网站并制造包括勒索软件攻击在内的威胁”。\n最后，最大的风险与受损的CAM4用户的财务和声誉方面有关。勒索骗局(性勒索骗局)可以向受害人发起，我们在其他类似的案件中已经看到了这种情况。\n2019年10月，Data Viper安全研究人员Bob Diachenko和Vinny Troia发现了一个完全开放的Elasticsearch服务器，其中包含“史无前例的40亿用户账户，数据超过4TB。”该服务器无需身份验证即可访问，从而暴露了超过12亿个独立个人的数据。\n可能会在您的系统上持续存在，并可能会再次感染。我们建议您下载SpyHunter并运行免费扫描以删除PC上的所有病毒文件。与自己进行拆卸相比，这为您节省了数小时的时间和精力。\nSpyHunter 5免费删除程序允许您在48小时的等待期内，对发现的结果进行一次补救和删除。阅读EULA和隐私政策。\n在开始实际删除过程之前，我们建议您执行以下准备步骤。\n备份所有文件，即使它们可能已损坏。您应该使用云备份解决方案备份您的数据，并确保您的文件不会丢失任何类型，即使是最严重的威胁。", "note_en": "CAM4, an adult live streaming website, has been through a data breach which exposed over 7TB of personally identifiable information of its members.\n The incident was discovered Security Detectives and Anurag Sen. The PII was stored on more than 10.88 billion database records. At fault is a misconfigured Elasticsearch cluster.\n  The PII was leased because one of the website’s production databases was left open to the Internet on a misconfigured Elasticsearch server.  CAM4 has approximately 2 billion visitors a year, with member streaming more than 1 million hours of adult content weekly. This makes over 75,999 private shows being broadcast every day.\n The good news is that the unsecured database was immediately taken down by Granity Entertainment, the Irish parent company of CAM4, shortly after the incident was reported.\n  Apparently, the CAM4 user records contained various PII in different combinations, including names, sexual orientation, emails, IP addresses, email message transcripts, and even private conversations of users.\n    In addition, 11 million of the records also included at least one email address from email providers such as Gmail, iCloud, and Hotmail. This makes for an abundance of highly sensitive information, associated with an adult site.\n   After a detailed analysis, the security researchers discovered that 6.5 million of the compromised CAM4 users are residents of the United States. Other affected nationalities include Brazilian and Italian users, according to the  Safety Detectives report:\n US, Brazilian and Italian users were the most heavily affected although the precise number of email records is difficult to gauge accurately due to multiple entries being duplicated. As expected, countries such as the UAE, Saudi Arabia and Iran all had zero entries given the fact that these countries ban adult content domestically.\n  The availability of fraud detection logs could enable malicious hackers to better understand how cybersecurity systems have been set up, the researchers noted. This knowledge could then be exploited as an efficient verification tool for threat actors, enabling a greater level of server penetration.\n Malicious attacks involving malware can also be enables, as “ website backend data could be harnessed to exploit the website and create threats including ransomware attacks”.\n Finally, the greatest risk is associated with the financial and reputational aspects of the compromised CAM4 users. Blackmail scams ( sextortion scams) can be launched against the victims, as we have already seen happening in other similar cases.\n  In October 2019, Data Viper security researchers Bob Diachenko and Vinny Troia  discovered a wide-open Elasticsearch server which contained “ an unprecedented 4 billion user accounts spanning more than 4 terabytes of data.” The server was accessible without the need of authentication, which exposed the data of more than 1.2 billion unique individuals.\n      may remain persistent on your system and may  re-infect it. We recommend you to download SpyHunter and run  free scan to remove all virus files on your PC. This saves you hours of time and effort compared to doing the removal yourself.\n SpyHunter 5 free remover allows you, subject to a 48-hour waiting period, one remediation and removal for results found. Read  EULA and  Privacy Policy\n    Before starting the actual removal process, we recommend that you do the following preparation steps.\n Do a backup of all of your files, even if they could be damaged. You should back up your data with a cloud backup solution and insure your files against any type of loss, even from the most severe threats.", "posttime": "2020-05-05 20:28:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据,data,电子邮件,cam4", "title": "CAM4数据泄露：7TB高度敏感的用户数据泄露", "title_en": "CAM4 Data Breach: 7 Terabytes of Highly Sensitive User Data Exposed", "transed": 1, "url": "https://sensorstechforum.com/cam4-data-breach-7tb-data/", "via": "", "real_tags": ["数据", "data", "电子邮件", "cam4"]}, {"category": "", "categoryclass": "", "imagename": "f56ecb788e4a3730f7bd633da09352aa.jpg", "infoid": 1000740, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我以前写过如何处理明显错误时的错误：当人们引入软件错误、破坏构建或意外删除某些内容时。有一条明确的路线可以遵循，在这个过程中你有机会提高团队的安全性。\n如果行为是错误的，但是这个人没有意识到，我们该如何处理这种情况呢？我们如何指出错误，并确保我们下次有更好的行为？\n在我职业生涯的早期，我的一个团队将我复制到他回复给外部联系人的电子邮件中。他的电子邮件听起来有点讽刺，我觉得这是不专业的。我决定我对此真的不高兴。在我看来，文化界限已经被越过了。\n我开始私下给他回信。想了想之后，我开始说：“我不赞成这种沟通方式。”我不记得那封电子邮件的其余部分了，但我记得那封邮件相当长，我详细地解释了我所有的理由。\n我发了电子邮件，转了转椅子，看着他打开了它。突然感到尴尬，我去拿了一杯咖啡，感觉到他在我离开房间时看着我。\n我们再也没谈过交换的事。在那之后，这个人在我的团队里呆了将近一年。我不认为我们的关系会完全恢复。\n这种方法有很多地方不对劲。让我们从“问题”本身开始。\n我根本没有给他任何关于如何代表公司的指示，他几乎没有工作经验。在更广泛的公司文化中，也没有任何东西可以清楚地表明这一点。当我没有解释我的标准时，期望我的团队成员符合我的标准是不公平的。通过我的无所作为，我的团队被完美地设计来实现我正在获得的结果。因此，这真的是我的错，因为我没有交流文化。\n如果我再这么做，我就不会管这件事了。损害已经造成，还没有重要到迫使他回去道歉的地步。稍后，我会非常清楚地告诉整个团队我期待的是什么样的行为。我会观察病情的好转或复发，只有在这种情况再次发生时才会提出这个问题。\n电子邮件是我处理这个问题的错误方式。这太正式了，而且矫揉造作。在之前解释了我的期望之后，我应该简单地和他私下谈一谈。然而，我太缺乏经验，不知道如何通过仔细的交谈来推动某人做出我所期待的行为。(如果你是远程领导，这里有更多关于如何远程实现这一点的信息。)。\n在这类谈话中，关键是要确保我们真的沟通得很好。沟通真的、真的很难做到正确。我们必须努力确保我们所说的话真正进入，被理解，并引起变化。如果我们在这件事上失败了，我们弊大于利。\n对于像这样的小问题，说：“这是一个小问题，但是…”是值得的。或“…”不过，这不是什么大事。“。明确确保您清楚问题有多严重。\n如果这是一个更大的问题，你手头的工作就更难了。首先“要求理解”。确保问题真的很严重是值得的，而且你没有弄错问题的另一端。问一些探索性的问题，以了解正在发生的事情。保持真诚的好奇心。你可能误解了所发生事情的情况。只有弄清楚实际问题是什么，你才会知道如何处理好它。\n(有关进行精彩对话的更多信息，我强烈建议您预订即将出版的“敏捷对话”一书。我很幸运地阅读了预览版，它是伟大的团队沟通的真正里程碑式的指南。在未来的帖子中会有更多关于这方面的信息。)。\n如果有任何形式的定期回顾，或者1：1，那么处理这件事可能会更容易。我什么都没做。\n说实话，我根本没有和这个人建立起良好的工作关系。我们只谈工作任务。我们的关系完全是肤浅的。因此，我很难很好地驾驭这个过程。\n从我的错误中吸取教训。花点时间问问你的团队成员他们做得怎么样。发现他们做得很好，并为此称赞他们。尽可能地建立关系和善意，在可能的情况下帮助你的团队。每个人都会更喜欢他们的工作(包括你)，而且你以后永远不会知道你什么时候会需要这种善意。\n错误地纠正某人是打击团队成员积极性的快捷方式。他们将不再关心球队，他们的产出将因此受到影响，传染将蔓延到其他人，这将是我们的错。随着时间的推移建立关系，努力进行正确的沟通。然后，你可以在需要的时候轻而易举地改正路线，这样你就可以把你的团队带到交付的新高度。\n在此浏览器中保存我的姓名、电子邮件和网站，以便下次我发表评论时使用。", "note_en": "I have written before on  how to deal with mistakes when the mistake is obvious: when people introduce software bugs, break the build, or delete something by accident. There’s a  clear route to follow, and you have an opportunity to improve team safety in the process.\n How do we deal with cases where behaviour is wrong, but the person isn’t aware? How do we point out the mistake, and ensure we get better behaviour next time?\n  Earlier in my career, one of my team copied me in to his email reply to an external contact. His email had a slightly sarcastic ring to it, and I felt that was unprofessional. I decided that I really wasn’t happy about this. In my mind, a cultural line has been crossed.\n  I started a private reply to him. After some thought, I began with “I don’t approve of this type of communication.” I don’t remember the rest of the email, but I do remember that it was quite long, and that I explained all my reasons in detail.\n I sent the email, turned my chair, and watched him open it. Suddenly embarrassed, I went to get a cup of coffee, feeling him watching me as I left the room.\n We never spoke about the exchange again. This person was in my team for nearly a year after that. I don’t think our relationship ever fully recovered.\n  There are so many things wrong with this approach. Let’s start with the “issue” itself.\n I had given no indication at all to him about how to represent the company, and he had little work experience. There was also nothing in the wider company culture that would have made this clear. It wasn’t fair to expect my team member to conform to my standards, when I hadn’t explained my standards. Through my inaction, my team was  perfectly designed to achieve the result I was getting. Therefore, this was really my fault for not communicating culture.\n If I was to do this again, I’d let the issue go. The damage was done, and it wasn’t important enough to force him to go back and apologise. At a later time, I’d make it quite clear to the whole team what kind of behaviour I was expecting. I’d have watched for an improvement or relapse, and only brought up this issue if it was repeated.\n  Email was the wrong way for me to deal with this issue. It was overly formal, and stilted. I should have simply had a quiet word with him, after previously explaining expectations. Yet I was too inexperienced to know how to nudge someone towards the behaviour that I was expecting through a careful conversation. (If you’re leading remotely,  here’s more on how to do this remotely.)\n In these kind of conversations, the key thing is to make sure we really are communicating well. Communicating is really, really difficult to get right. We must strive to ensure what we say actually goes in, is understood, and elicits change. If we fail in this, we have done more harm than good.\n For minor issues like this one, it pays to say: “this is a minor issue, but…” or “…it’s not a huge deal though”. Explicitly ensure you are clear about how severe the issue is.\n If it’s a bigger issue, you have a harder job on your hands. “Ask to understand” first. It pays to ensure that the issue really is severe, and you haven’t got the wrong end of the stick. Ask probing questions to understand what’s going on. Be genuinely curious. You may have misunderstood the circumstances of what happened. Only when it’s clear what the actual problem is will you know how to deal with it well.\n (For more on having great conversations, I’d highly recommend  preordering the upcoming Agile Conversations book. I’m lucky enough to have read a preview copy, and it’s a truly landmark guide to great team communication. More on this in a future post.)\n  If there had been  any kind of regular retrospective happening, or 1:1s, then dealing with this might have been easier. I wasn’t doing any of that.\n Truth be told, I simply hadn’t built up a proper working relationship with this person. We only talked about work tasks. Our relationship was entirely superficial. Therefore it was difficult for me to navigate this process well.\n Learn from my mistakes. Take the time to ask your team members how they’re doing. Catch them doing something well, and compliment them for it. Build up relationship and goodwill wherever possible, and help your team out wherever possible. Everyone will enjoy their jobs more (including you), and you’ll never know when you will need that goodwill later.\n  Correcting someone badly is a fast way to demotivate a team member. They will care less about the team, their output will suffer as a result, the contagion will spread to others, and it will be our fault. Build relationship over time, and work hard at getting the communication right. Then you can gently effortlessly course correct when needed, and you’ll take your team to new heights of delivery.\n      Save my name, email, and website in this browser for the next time I comment.", "posttime": "2020-05-05 20:27:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "团队,team", "title": "如何纠正团队成员：避免我破坏性的新手错误", "title_en": "How to correct a team member: avoid my damaging rookie mistakes", "transed": 1, "url": "https://deliverydoubled.com/correcting-a-team-member-avoid-my-damaging-rookie-mistakes/", "via": "", "real_tags": ["团队", "team"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000739, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "某些Word功能无法在Google Docs中显示，如果您进行更改，这些功能将被删除", "note_en": "Some Word features can&#39;t be displayed in Google Docs and will be dropped if you make changes", "posttime": "2020-05-05 20:27:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,app,android,issues,功能", "title": "在COVIDSafe Android应用程序的BLE实施中发现的隐私问题", "title_en": "Privacy issues discovered in the BLE implementation of the COVIDSafe Android app", "transed": 1, "url": "https://docs.google.com/document/d/1u5a5ersKBH6eG362atALrzuXo3zuZ70qrGomWVEC27U/edit#heading=h.q4sovraiy4kn", "via": "", "real_tags": ["程序", "app", "android", "issues", "功能"]}, {"category": "", "categoryclass": "", "imagename": "41f43f7e000723d8dadbe59120d0cd36.png", "infoid": 1000738, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "更新：30小时后，我们仍然无法验证我们的付款方式，即使我们已经两次联系到实时聊天支持团队，他们表示他们理解这是一个紧急情况，正在优先治疗。但一切都没有改变，除了一封确认他们几个小时前收到了请求的电子邮件。\n根据这篇帖子，从2018年开始，但变化不大。甚至他们也更新了他们的帐户管理策略，使其对GCP客户更加友好。\n我们的项目是一个区块链游戏服务，我们选择GCP是因为他们背后有非常好的产品，比如FiRestore，Cloud Functions，Cloud Pubsub，Kubernetes，…。并相信不会存在停机。\n我们已经运行了2个月的项目，所有的人都很满意。云功能和FiRestore是自动扩展，代码和管理更少。即使每秒有100个请求，该函数仍然运行良好，只是来自BigQuery的意外账单，但最终我们已经控制了这一点。\n那么我们的项目马上就被关闭了。所有故障、防火墙故障、云计算故障、云SQL故障、…故障。\n当时，我的团队没有意识到这一点，因为当时是我国时间的凌晨3点左右。然后3个小时后，我们开始核实。\n他们需要一张维萨卡的照片和一张政府签发的身份证的照片。我的帐单账户是我的，但为了支付发票，我们使用的是联合创始人的VISA卡。不幸的是，他没有身份证，所以我们用护照代替。\n大约一个小时后，我们收到了这封电子邮件：“您的Google支付将继续暂停”(请注意：由于Covid 19，响应时间可能比正常情况下预期的要长)\n我们不明白为什么？没有理由退货，我们以为VISA卡是无效的。所以这次我们提交了一张短信银行对账单的截图作为替代，并说明了我们的情况。\n然后大约一个小时后，电子邮件回复说：“您的谷歌支付将继续暂停”，上面同样的内容，并要求我们再次核实。然后我们又试了一次，这次我们把护照换成了驾照。但是它仍然不起作用，我们不知道为什么和如何使它起作用？而我们的客户却怒不可遏，因为网站关闭了将近6个小时。他们也不能做得和我们队一样好。\n现在我们试图再次提交，但是一个多小时，我们没有收到任何回复。而我的联合创始人正试图拿到银行对账单。但不幸的是，他现在在国外，处理过程可能需要1天或几个小时以上。\n我们已经尝试将项目备份或转移到另一个帐户以建立网站，但由于项目已暂停，因此无法完成。我们有一些备份文件，但这还不够，我们从来没有计划在Google Cloud上进行自动备份，因为我们从来没有想过这种情况会发生在今天。那是我们的错。现在我们所有的数据都可能丢失，如果验证不能通过，即使卡是我们自己的，我们的网站也会丢失。\n根据他们的付款条款，他们保留随时更改、暂停或中断其服务的任何方面的权利，包括任何服务或任何功能，而无需通知和承担任何责任。\n他们是对的，因为我注册帐户时按了“同意”键。\n嘿，谷歌！是否只有一个办法：立即暂停项目，然后要求核实付款方式？\n哦，我不知道该怎么回答。因为Google Cloud拥有很好的产品，如Firebase Auth、Functions、FiRestore、…。。使得开发时间更短。但是请注意计费方式。", "note_en": "Update: After 30 hours, we still cannot verify our payment method even we’ve reached the live chat support team twice and they said that they understand this is an urgent case and getting priority treatment. But nothing’s changed, except an email confirm that they have received the request few hours ago.\n   According to  this post since 2018, but there are not many things that have been changed. Even they updated their account management policies to be friendlier to GCP customers\n  Our project is a blockchain gaming service, we chose GCP because they have really good products behind such as Firestore, Cloud Functions, Cloud Pubsub, Kubernetes, … and believe that there will be no downtime exists.\n  We have run the project for 2 months with all satisfied. The Cloud functions and Firestore is auto scaleup with less code and management. Even there are 100 requests/second the function still works great, except an unexpected billing came from BigQuery, but finally we’ve controlled that.\n     Then immediately our project has been turned off. All downed, Firebase downed, Cloud Compute Downed, Cloud SQL downed, …\n At that time, my team did not recognize that, because it was about 3 AM in my country’s time. Then 3 hours later we started to verify.\n They required a photo of the VISA card and a photo of an ID issued by the government. My billing account was mine, but we used a co-founder’s VISA card in order to pay the invoices. Unfortunately, he hasn’t had the ID, so we used the passport as the replacement.\n About one hour later, we received this email: “Your Google payments will remain suspended“ (Please note: Due to Covid 19, the response time might take longer than normal expected)\n  We don’t understand why? No reason give back, we assumed that the VISA card wasn’t valid. So this time we submitted a screenshot of the SMS bank statement as the replacement and explain about our situation.\n Then about 1 hour later, the email responded: “Your Google payments will remain suspended” with the same content above and asked us to verify again. Then we tried again, this time we replace the passport by a driver license. But it still didn’t work, we don’t understand why and how to make it work? While our customers are ablaze with anger because the site is downed for almost 6 hours. They cannot do anything as well as our team too.\n Now we tried to submit once again, but more than an hour, we haven’t received any responses. While my co-founder is trying to get the bank statement. But unfortunately, he is abroad and the processing might take more than 1 day or several hours.\n  We’ve tried to backup or transfer the project to another account to make the website up, but that couldn’t because the project was suspended. We have some backup files, but it doesn’t enough, we’ve never planned to have an automatic backup on Google Cloud because we’ve never thought about this situation is occurring today. That’s our bad. Now all our data might be lost, our website will be lost if the verification cannot be passed even the card is our own.\n   By their Payments Terms, they reserve the right to change, suspend or discontinue any aspect of their services at any time, including any services or any feature  without notice and liability.\n  They were right because I was press “Agree” when I registered the account.\n     Hey Google! Is there just one way: immediately suspend the project then ask to verify the payment method?\n    Oh, I don’t know how to answer that. Because Google Cloud is owning good products such as Firebase Auth, Functions, Firestore,…. it makes the development time is shorter. But please be careful about the billing method.", "posttime": "2020-05-05 19:42:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,project", "title": "为什么不应该使用FireBase和Google云", "title_en": "Why you should not use firebase and google cloud", "transed": 1, "url": "https://medium.com/@amton15127/why-you-should-not-use-firebase-and-google-cloud-c05fe6ccdbe8", "via": "", "real_tags": ["google", "project"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000736, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "41年前的这个夏天，我还是一名年轻的调查员，在宾夕法尼亚州哈里斯堡和华盛顿特区为三里岛事故总统委员会工作，这是一项由达特茅斯教授约翰·凯梅尼(John Kemeny)主持的大型联邦调查，他最出名的身份是Basic编程语言之父。那年夏天和秋天，我不仅学到了很多关于核事故的知识，也学到了很多关于政府和行业如何应对危机的知识。其中一些经验教训适用于目前的冠状病毒大流行，它也管理不善。这可能会让你大吃一惊(41年前的教训仍然适用)，但尤其是政府，变化速度非常缓慢。\n我主要与之打交道的两个联邦机构是联邦紧急事务管理局(FEMA)和核管理委员会(NRC)。这两个机构在不久之前都经历了品牌重塑的努力，所以我遇到的几乎所有人都是在老品牌下开始他们的职业生涯的-民防和原子能委员会。这些早期的身份是这个故事的关键。\n如果你不记得民防，那就是负责规划第三次世界大战期间行动计划的机构。第三次世界大战是一场可能导致数百万人死亡的热核战争。民防在全国各地的公共建筑地下室修建了防空洞，为它们配备了生存物资。民防每周进行一次空袭测试，全镇都能听到巨大的警报声。民防教会了像我这样的小孩子躲在我们学校的课桌下，希望能在核武器落下的情况下拯救我们。\n但核武器从未下降，最终民防对美国政策的重要性开始下降。我明白我们还处于冷战时期。柏林墙仍然屹立不倒，罗纳德·里根甚至还没有参加总统竞选。但事情渐渐平息下来，所以决定将民防改建为联邦应急管理局，并承担其他类型的灾难的责任，如飓风、龙卷风，以及，嗯，核事故。三里岛是他们的第一个。\n没过多久，我就意识到，我会见的民防人员(每个人都是男性)都怀念过去与俄罗斯人争斗的日子，他们非常不确定如何处理这些新的紧急情况，比如我们称之为三里岛(TMI)的三里岛(Three Mile Island)。拥有TMI(通用公用事业或GPU)的公司表示，工厂是他们的孩子，事故都在控制之中，他们很快就会恢复运行。当然，这是一个彻头彻尾的谎言，但联邦应急管理局并不知道，因为联邦应急管理局什么都不知道。\n联邦应急管理局：“我们正在监测情况，并支持GPU，这似乎做得很好。”\n从某种意义上说，很难指责联邦应急管理局，因为他们不知道自己不知道的事情。但我们可以在某种结构层面上指责它们推迟使用GPU。我们在监管官僚机构中经常看到这一点。如果其他人要为这场巨大的、可能无法取胜的危机承担责任-那就让他们去吧-那是一堆热气腾腾的狗屎。站在一边看着假人失败。这就是联邦应急管理局最初在TMI做的事情。这是掩饰自己的好办法，但根本不是解决实际危机或帮助你的国家的办法。联邦应急管理局没有尽到自己的职责。\n联邦应急管理局不得不为卡特里娜飓风和玛丽亚飓风再次吸取同样的教训-又是两场他们迟迟没有进入的巨大灾难。\n在这一点上，我们可能会问，联邦应急管理局在1979年擅长什么？他们认为存在的真正原因是什么？我很快了解到联邦应急管理局非常擅长绘制地图和研究盛行风向。他们认为他们的真正职能是计划核攻击，目标是在最初的30天内将生命损失降至最低。为此，联邦应急管理局(如民防)制定并不断更新了详细的计划，以便在袭击发生后不久转移大量人员。他们会把死者留在那里，把活着的人转移到他们计算过的地方，在那里风力驱动的核尘埃会更少。\n他们的努力是一项崇高的30年努力，最终产生了越来越详细和复杂的计划，随着时间的推移，这些计划越来越远离现实。到1979年，联邦应急管理局的计划-只针对东北部各州-是在核袭击后的72小时内转移超过5000万人-据推测，这次袭击也会摧毁大部分基础设施。\n在当前冠状病毒危机的背景下看待这一点。在目前的情况下，我们没有被要求搬家，我们被要求不要搬家，这要简单得多。实际行动仅限于医疗箱、人员和补给。我们处理得怎么样了？街道很安静，没有核武器摧毁他们，我们所做的一切就是转移数百万人，向他们提供他们需要的东西。进展如何？坦率地说，事情一点也不顺利。\n旧的CD/FEMA疏散计划很像手机中的GPS路由算法，它让你额外转七个弯，在100英里的旅程中节省0.3英里。如果他们能将5000万人从辐射较多的地方转移到辐射较少(但仍有辐射)的地方，那么如果他们真的到达目的地，就会多出几千人存活下来。那之后30天呢？这就是民防计划停止的地方，所以那些现在离家几英里远，想必仍在死于辐射中毒的人，在30天后，完全是独自一人。是啊，对。\n我之所以告诉你这些，是因为昨天疾控中心和联邦应急管理局宣布他们正在为美国制定重返工作岗位的计划。这听起来是不是开始有点耳熟了？\n我不是说联邦应急管理局/疾控中心的计划不好。我简直不知道他们的计划。但如果非要我打赌的话，我会说这个计划不是很好。它不是很好的原因是因为-就像旧的CD撤离计划一样-它从一个根本上不好的想法开始，在这种情况下就是“我们如何在6月1日之前让经济启动和运行，同时杀死最少的人？”\n他们不会说这是目标，但这是目标，因为这是特朗普总统的目标。\nCDC和FEMA甚至不会在这一点上公开计划，如果他们不是被白宫推动的话。\n所以他们的目标是错误的。它可能应该是“我们如何最终以最小的生命损失回到工作岗位？”他们甚至可能会说这就是目标。但我们都知道，真正的目标是“我们如何在6月1日之前恢复工作，并将生命损失降至最低？”\n这两个目标之间的差异可能在3万到5万死亡人数之间，这些人将会死亡，所以唐纳德·特朗普有希望再次当选。\n在1979年与联邦应急管理局的会议上，我提出了一些问题，我认为这些问题切中了TMI危机管理问题的核心。他们不喜欢我的问题。他们一点也不喜欢我问问题。这就是他们开始在会议桌上敲打西点军校班级戒指的时候。\n对于1979年联邦应急管理局的精英们来说，我是个朋克。但我是为美国总统工作的朋克。吉米·卡特总统本人毕业于美国海军学院，拥有核工程研究生学位。吉米·卡特不是朋克，所以联邦应急管理局的人必须把我当回事。\n所以他们在会议桌上敲了敲他们的班级戒指，让我知道他们是成年人，而我是个朋克。但事实最终变得清晰起来，他们几乎不知道实际该做什么，主要是希望GPU说的是实话，核事故将在几周内结束，生活将恢复正常。这听起来是不是有点耳熟？\n100多亿美元和41年后，GPU破产和死亡，而TMI仍然需要花费金钱来修复。\n适用于冠状病毒，这意味着我们在6月1日之前不能回去工作了。\n在这一点上，我本打算继续我在核管理委员会的冒险，这让联邦应急管理局看起来像鹰式童子军。但是这已经太长了，所以这将是我的下一个专栏。", "note_en": "Forty-one years ago this summer I was a young investigator working in Harrisburg, Pennsylvania and Washington, DC for the President’s Commission on the Accident at Three Mile Island, a big federal investigation chaired by Dartmouth Professor  John Kemeny, who is best known as the father of the BASIC programming language. I learned a lot that summer and fall not only about nuclear accidents but about how governments and industries respond to crises. Some of those lessons apply to the current COVID-19 pandemic, which is also being poorly managed. This may surprise you (that 41-year-old lessons can still apply) but governments, especially, change at a glacial pace.\n The two federal agencies with which I mainly dealt were the Federal Emergency Management Agency ( FEMA) and the Nuclear Regulatory Commission ( NRC). Both agencies had not long before gone through rebranding efforts so nearly all of the people I met had started their careers under the old brands — Civil Defense and the Atomic Energy Commission. These earlier identities are key to this story.\n If you don’t remember Civil Defense, it was the agency charged with planning what to do during World War III — a thermonuclear war that would have killed millions. Civil Defense built bomb shelters all over the country in the basements of public buildings, equipping them with survival supplies. Civil Defense ran  weekly air raid tests where huge sirens could be heard all over town. Civil Defense taught little kids like me to hide under our school desks in hopes that would save us in case the nukes ever dropped.\n But the nukes never dropped and eventually Civil Defense began to look less and less crucial to U.S. policy. Understand we were still in the Cold War. The Berlin Wall still stood and Ronald Reagan wasn’t even running for President yet. But things were winding-down a bit, so it was decided that Civil Defense would be remade into FEMA and take on responsibility for other kinds of disasters like Hurricanes, tornadoes, and, well, nuclear accidents. Three Mile Island was their first one of those.\n It didn’t take long for me to realize that the Civil Defense folks I was meeting with (everyone was a man) both missed the old days of sparring with the Russkies and they were very uncertain how to handle these new kinds of emergencies like Three Mile Island, which we called TMI. The company that owned TMI, General Public Utilities, or GPU, was saying the plant was their baby, that the accident was all under control, and they’d be back up and running in no time at all. It was a complete lie of course, but FEMA didn’t know that because FEMA didn’t know much of anything.\n  FEMA: “We’re monitoring the situation and supporting GPU, which seems to be doing a very good job.”\n In one sense it is hard to fault FEMA because they didn’t know what they didn’t know. But we  can fault them on a kind of structural level for deferring to GPU. We see this a lot in regulatory bureaucracies. If someone else is going to grab responsibility for that huge and probably un-winnable crisis — that steaming pile of shit — heck, let them. Stand aside and watch the dummies fail. That’s what FEMA did initially at TMI. It’s a good way to cover your ass, but not at all a way to solve an actual crisis or to help your country. FEMA wasn’t doing its job.\n FEMA had to learn this same lesson again for Hurricane Katrina and then again for Hurricane Maria –two more huge disasters they were slow to enter.\n Here is a point where we might ask what  was FEMA good at back in 1979? What did they see as their real reason for existing? I quickly learned that FEMA was really good at making maps and studying prevailing winds. They saw their true function as planning for a nuclear attack with the goal of minimizing loss of life in those first 30 days. Toward that end FEMA (as Civil Defense) had created and continually updated elaborate plans for moving large groups of people shortly after an attack. They’d leave the dead and move the living to places where they had calculated there would be less nuclear fallout driven by the wind.\n Theirs’ was a noble 30-year effort that resulted in ever more detailed and complex plans that diverted further and further from reality as the years passed. By 1979, FEMA’s plan — just for the northeast states — was to move more than 50 million people over the 72 hours following a nuclear attack — an attack that would presumably have also destroyed most infrastructure.\n Look at this in the context of the current COVID-19 crisis. In the current case we aren’t being asked to move, we’re being asked to  not move, which is way simpler. Actual movement is limited to medical cases, personnel, and supplies. How are we doing with that? The streets are quiet, no nukes have destroyed them, and all we are trying to do is move a couple million people around and supply them with what they need. How is that going? It’s not going well at all, frankly.\n  The old CD/FEMA evacuation plan was a lot like that GPS routing algorithm in your phone that has you make seven extra turns to save 0.3 miles on a 100-mile trip. IF they could move 50 million people from where there was more fallout to where there was a little less fallout (but still fallout) then a few thousand more people were calculated to survive  if they actually made it to their destinations. And 30 days after that? That’s where the Civil Defense plan stopped, so people who were now miles away from their homes and presumably still dying of radiation poisoning were, after 30 days, completely on their own. Yeah, right.\n I’m telling you this because yesterday the CDC and FEMA announced they are working on a  back-to-work plan for America. Is this starting to sound familiar?\n I’m not saying the FEMA/CDC plan is bad. I simply don’t know their plan. But if I had to bet I’d say the plan isn’t very good. And the reason it isn’t very good is because — just like the old CD evacuation plan — it is starting with a fundamentally bad idea, which in this case is “how do we get the economy up and running by June 1 while killing the least people?”\n They won’t say that’s the goal, but that  is the goal because it is President Trump’s goal.\n The CDC and FEMA wouldn’t be even going public with a plan at this point if they weren’t being pushed into it by the White House.\n So their goal is wrong. It probably should be “how do we eventually get back to work with minimal loss of life?” They may even say that’s the goal. But we all know the real goal is “how do we get back to work by June 1 with minimal loss of life?”\n The difference between those two goals is probably somewhere between 30,000 and 50,000 dead people — people who will have died so Donald Trump has a hope of being re-elected.\n In my meetings with FEMA back in 1979, I asked questions that, I thought, got to the heart of the TMI crisis management problem. They didn’t like my questions. They didn’t like that I was asking questions at all. And that’s when they would start tapping their West Point class rings on the conference table.\n To the fine men of FEMA in 1979, I was a punk. But I was a punk working for the President of the United States. And that President, Jimmy Carter, was himself a graduate of the U.S. Naval Academy and had a post-graduate degree in nuclear engineering. Jimmy Carter was no punk, so the FEMA guys had to take me seriously.\n  So they tapped their class rings on the conference table to let me know they were the adults and I was a punk. But the truth eventually became clear that they had little idea what actually to do and were mainly hoping GPU was telling the truth, that the nuclear accident would be over in a couple of weeks, and that life would get back to normal. Does this sound somewhat familiar?\n $10+ billion and 41 years later, GPU is bankrupt and dead and TMI is still costing money to fix.\n Applied to COVID-19 that means we won’t be back to work by June 1.\n At this point, I had planned to move on to my adventures with the Nuclear Regulatory Commission, which made FEMA look like Eagle Scouts. But this is too long already, so that will be my next column.", "posttime": "2020-05-05 19:41:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,冠状病毒,island,管理局,fema", "title": "三里岛冠状病毒的教训：联邦应急管理局和我", "title_en": "Three Mile Island Lessons for Covid-19: FEMA and Me", "transed": 1, "url": "https://www.cringely.com/2020/04/15/three-mile-island-lessons-for-covid-19-fema-and-me/", "via": "", "real_tags": ["病毒", "冠状病毒", "island", "管理局", "fema"]}, {"category": "", "categoryclass": "", "imagename": "38cc5160afd1515105f2898de548cbd3.png", "infoid": 1000734, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Expensify在很多方面都有不同寻常的技术堆栈。例如，我们不在内部使用DNS-只是配置管理的/etc/hosts文件-它工作得很好。类似地，我们只有限地使用AWS-而不是托管我们自己的Web和数据库层硬件-它工作得很好。但最令人惊讶的是，我们没有使用MySQL或Postgres-而是使用SQLite-它工作得非常好。\n诚然，它本身并不是SQLite。我们已经将它包装在一个名为Bedock的自定义分布式事务层中，该层是开源的，可以在这里获得：www.Bedckdb.com。它不仅是我们核心数据库背后的主力，而且还为我们的任务关键型作业队列提供动力，并提供一个本地托管的复制缓存层。功能越重要，它对Bedrock的依赖就越大。\n因此，考虑到2017年的爆炸性增长，升级驱动基岩的服务器一直是当务之急--同时升级基岩(在不可思议的SQLite团队和SQLite本身的帮助下)，以利用所有这些硬件。为此，我们即将推出全新的一代自托管硬件，其基本规格如下：\n这是一个庞然大物的服务器，几乎是在现货Linux内核上运行的最大的服务器(没有进入“超级计算机”领域)，我们正在得到一大批这样的服务器。但仅有硬件是不够的。需要明确的是，以上规格对于大多数数据库来说是毫无意义的，因为几乎没有任何可伸缩的东西可以很好地处理这种硬件-而且几乎没有人尝试。\n传统的智慧是，你应该总是“向外”而不是“向上”，这意味着拥有大量的小服务器比相对较少的大型服务器更好。大多数公司会将他们的数据“分割”到单独的服务器中，比如在每台服务器上放置1000名客户-然后在客户登录时只需将每个客户路由到正确的服务器即可。这种设计对许多应用程序都非常有效，这意味着你永远不需要学习如何管理大型数据库-只需要很多小型数据库。\nExexpsify有点不同，因为没有分片-也没有明确的“断层线”来做这件事。“每一个用户都可以与其他每个用户分担费用，无论他们在哪里工作。”这是一个关键功能，使我们能够为管理数百甚至数千客户的大型会计师事务所提供如此好的支持：当一家公司与一家公司竞争时，我们希望让该公司访问该公司的数据，而不需要将公司迁移到会计师事务所已经在使用的同一服务器上。(这是一个关键功能，使我们能够为管理数百甚至数千客户的大型会计师事务所提供如此好的支持：当一家公司与一家公司竞争时，我们希望让该公司访问该公司的数据，而不需要将该公司迁移到该会计师事务所已经在使用的同一服务器上。\n换句话说，作为一名会计师，你的Expensify“收件箱”向你展示了你需要同时在所有客户身上做的所有事情，而不需要从一个客户“切换”到另一个客户，看看是否需要为每个客户做什么。当然，即使你进行了分片，也有其他方法可以做到这一点。但是，由于没有分片，这以及其他一系列类似的多客户处理变得超级容易。\n显然，SQLite从来不是为做这样的事情而设计的。但这并不能改变这样一个事实，即它做得非常好，尽管SQLite多年来应我们的要求做了一些修改(我们是SQLite联盟非常热情的赞助商，他们给了我们很大的帮助)。这些修改是开源的，任何人都可以使用(只要问他们，我相信他们会把你联系起来)，而且基本上不在本文的讨论范围内，但包括(如果我都记得的话)：\n禁用POSIX建议锁。这会阻止您在数据库运行时从外部进程(例如，从命令行工具)访问同一数据库，但这对于我们的使用是可以接受的。\n禁用malloc()全局锁(我不记得为什么会有这样的锁，但对于我们的情况显然不需要)。\n换句话说，SQLite的核心设计非常准确。我认为人们没有意识到它是一个多么不可思议的工具。相反，优化系统性能的大部分努力归结为优化BIOS和内核功率设置，以消除无关的内存访问(例如，禁用预取)，并防止CPU自行节流以节省电力。\n人们普遍认为EC2比托管你自己的硬件更快、更便宜、更容易。也许我是老派，但我从来都不完全认同这个观点。你在EC2服务器上可能得到的最好价格是预付3年合约的一年，但你在第一天支付的价格仍然等于硬件成本。因为想想看：亚马逊不会在你身上冒险，所以他们不会为你购买硬件，除非他们预付了钱，否则他们不会为你购买硬件，因为亚马逊不会在你身上冒险，所以他们不会为你购买硬件，除非他们预付了钱，否则他们不会为你购买硬件，因为亚马逊不会在你身上冒险，所以他们不会为你购买硬件，除非他们预先付款。他们相信他们会得到很多倍的回报。因此，对于同样的硬件，你拿出了同样的现金，除了不是得到5年的稳定使用-你需要再支付同样的钱5次(因为与手机不同，服务器硬件在3年后不会变成南瓜)。EEC2的溢价令人震惊-可能是实际硬件成本的3-10倍-如果你这么看重便利性，这是可以接受的。但鲜为人知的是，它也会带来巨大的性能损失。\n在撰写本文时，您可以买到的最大的ec2实例是具有128vCPU和4TB内存的3x1e.32xLarge。它的价格为每小时26.688美元，即每台服务器每年233K美元。)(如果您承诺使用3年，并预付1年，则可以“仅”花35万美元购买3年。)以下是该服务器与您可以托管的服务器的比较结果，预付成本和持续成本都很低：“只需”35万美元。(如果您承诺购买3年，并预付1年的费用，则可以“仅”花35万美元购买3年的服务器。)下面是该服务器与您可以托管的服务器的比较结果，前者的预付成本和持续成本都只有很小的一部分：\n纵轴显示每秒查询的总数，横轴显示获取该数据点所使用的线程数。对于每个线程计数配置(例如，一个线程为100s，两个线程为100s，等等)，测试运行100s，并使用最快的单个秒作为结果。(这一点很重要，因为CPU缓存“预热”可能需要一段时间，这会过滤掉人为缓慢的样本。)完整的性能测试可以在GitHub上找到。(这很重要，因为CPU缓存需要一段时间才能“预热”，这会过滤掉人为缓慢的样本。)-完整的性能测试可以在GitHub上找到。(这一点很重要，因为CPU缓存需要一段时间才能“预热”，这会过滤掉人为缓慢的样本。)。\n查询本身只是对随机整数的10B行(447 GB)两列数据库中随机放置的10行的范围求和，其中一行已编制索引，另一行未编制索引。*这意味着测试已完全缓存在RAM中，而数据库在测试之前已预缓存。*在此测试期间不执行写入，只执行读取操作。*每个线程都支持NUMA，这意味着其所有本地内存访问都在本地内存节点内完成，数据库本身在NUMA节点之间拆分(尽管与预期相反，NUMA感知不会。\n橙色线条显示EC2机器的总聚合性能，上限约为每秒150万次查询。蓝线显示在“裸机”机器上进行的相同测试，每秒查询次数超过4M次，并且在测试期间不断攀升。(出于测试目的，我只关心192个线程，所以我不担心线程数会更高。)红线显示的是同样的测试，只不过是30B的行表(1.3TB)--比裸机的物理RAM还大。\n首先，哇。这是一吨的马力。一台服务器每秒进行400万次查询是不容小觑的，即使认识到这是一个很难测试的人工查询。)(如果你测试“SELECT 1”，它每秒会获得大约1.6亿次查询，但这更是人为的。)(如果你测试“SELECT 1”，它每秒会得到大约1.6亿次查询，但这更是人为的。)。\n其次，SQLite的伸缩性令人惊叹，几乎开箱即用。这项测试在添加物理CPU时实现了近乎完美的线性可伸缩性，超线程在释放额外容量方面的效果比我预期的要好得多。\n但第三，wtf与EC2有问题？我真的认为1个vCPU大致等于1个物理CPU，但MAN错了。这一点在这里真正突出显示：\n这是相同的基本图表，但这一次显示了每个线程的平均性能，以及该性能是如何随着线程数量的变化而变化的。蓝线显示的几乎与我预期的一样：当新的物理核心被激活时，每个线程的性能保持稳定(非常明显)，但当我们达到超线程区域时，性能开始下降。事实上，这比我预期的线性程度要高得多，因为测试的设计方式确保每个CPU 87.5%的时间都在访问远程RAM。这意味着这几乎是最糟糕的情况。但这似乎丝毫没有降低测试的性能，看起来英特尔可以做对一些事情，而Purley的新内存架构相当稳固！\n此外，红线显示，即使25%的读取进入磁盘，对总体性能的影响也可以忽略不计。我将此归因于NVMe固态硬盘的疯狂快速访问-同样，远远好于预期。\n但橙色的线条显示，EC2机器上的每个新线程都会对其他线程造成很大的惩罚。首先，这个图表非常明显地显示，128个“虚拟CPU”实际上意味着64个物理CPU+超线程。*这相当令人失望和误导，因为我真的认为每个vCPU都意味着同等的性能。\n然而，更重要的是橙线本身的曲线。当用单行数据库替换100亿行数据库后重新运行测试时，更容易看到这一点，以便从等式中删除内存访问：\n(请原谅参差不齐的数据，这是以每个样本较短的周期运行的，因此噪音较大，但它让人明白了这一点。)\n蓝线显示了添加新线程时裸机上每个线程的QPS，正如您所预期的那样，它获得了高达192个物理核心的完美线性可伸缩性，然后随着超线程开始发挥作用，QPS线性下降。\n红线是EC2的盒子，性能甚至在达到64个物理核心之前就会下降，但在达到64个物理核心之前就会急剧下降。更糟糕的是，这条线的曲线表明它不是内存访问减慢了速度-这是电源节流。*一旦超过64个核心并开始超线程，每个CPU消耗的功率就会上升。但很明显，EC2已经将其配置为某种“平衡”的性能配置文件，这意味着当总功耗变得太高时，CPU的时钟速度会降低-从而限制了CPU的运行速度。但很明显，EC2在达到64个物理核心之前就会降低性能，这意味着当总功耗过高时，CPU的时钟速度会降低，从而限制了。\n这会导致每个线程的性能-计数曲线，在128个线程处趋于平缓的线性下降斜率，因为这是所有128个CPU都在使用的点。“一旦所有CPU都被使用了，线程就会竞争一个插槽-添加更多的线程不会消耗更多的电力(但它是线性的，因为每个新线程都会占用现有线程的时间)。\n事实证明，托管您自己的硬件的一个主要隐藏优势是，它意味着您可以配置BIOS以满足您自己的需求，在我们的特定情况下，这些更改就是一切。\n购买功能强大的服务器价格低得惊人(只要您托管的是您自己的硬件)。\n并不是所有的EC2虚拟CPU都是相同的，而且它们都不像您自己托管的实际CPU那样强大。\n所有这些测试都是在Meltdown和Spectre之前完成的，所以我不确定这项测试的性能会受到什么影响。“我们现在正在进行这些测试，如果有人感兴趣，我会写下来分享结果。”早期迹象显示，性能大约会下降2.5%，但还有更多的工作要做。\n此外，虽然这项测试的重点是读取性能，但我应该提一下SQLite也有出色的写入性能。*默认情况下，SQLite使用数据库级锁定(最小并发)，并且有一个“开箱即用”的选项来使WAL模式获得出色的读取并发性--如此测试所示。但是不太为人所知的是，SQLite有一个分支具有页面锁定，这可以实现出色的并发写入性能。如果您联系SQLite人员，我相信他们会告诉您更多！", "note_en": "Expensify has an unusual technology stack in many ways.  For example, we don’t use DNS internally — just configuration-managed /etc/hosts files — and it works  great.  Similarly, we only make limited use of AWS — instead hosting our own hardware for the web and database layer — and it works  great.  But most surprising of all is that we don’t use MySQL or Postgres — instead using none other than SQLite — and it works  great.\n Granted, it’s not SQLite by itself.  We’ve wrapped it in a custom distributed transaction layer named Bedrock, which is open sourced and available here:  www.bedrockdb.com.  It’s not just the workhorse behind our core database, but also powers our mission-critical  job queue, and provides a locally-hosted  replicated caching layer.  The more important the function, the more it depends on Bedrock.\n Accordingly, given the  explosive growth of 2017, upgrading the servers that power Bedrock has been a top priority — along with upgrading Bedrock (and with the help of incredible the SQLite team, SQLite itself) to take advantage of all that hardware.  To that end we’re just about to roll out an entirely new generation of self-hosted hardware with the following basic specs:\n  This is a monster server, nearly the biggest that is possible to buy that runs on a stock Linux kernel (without getting into “supercomputer” territory), and we’re getting a bunch of them.  But hardware alone isn’t enough.  To be clear, the above specs would be pointless for most databases, as almost nothing scales to handle this kind of hardware well — and almost nobody tries.\n  The traditional wisdom is that you should always build “out” not “up”, meaning it’s better to have a large number of small servers than a relatively small number of large servers.  Most companies will “shard” their data into separate servers, such as to put 1000 customers on each server — and then just route each customer to the right server when they sign in.  That design works super well for many applications, and means you never need to learn how to manage a big database — just a lot of small databases.\n Expensify is a bit different in that there is no sharding — and no clear “faultline” on which to do it.  Every single user can share expenses with every single other user, regardless of where they work.  This is a critical feature that enables us to offer such good support for large accounting firms that manage hundreds or even thousands of clients: when a company takes on a firm, we want to give that firm access to that company’s data, without needing to migrate the company onto the same server the accounting firm is already on.\n Said another way, as an accountant, your Expensify “Inbox” shows you everything you need to do aggregated across all your clients simultaneously, without needing to “switch” from one client to the next to see if anything needs to be done for each.  Sure, there are other ways to do it even if you do shard.  But the lack of sharding makes this, and a bunch of other similar kinds of multi-client processing, super easy.\n  Obviously, SQLite was never designed to do anything like this.  But that doesn’t change the fact that it does this incredibly well, albeit with a few modifications created by SQLite over the years at our request (we are a very enthusiastic sponsor of the  SQLite Consortium, and they’ve been a tremendous help).  The modifications are open source and available to anyone (just ask them and I’m sure they’ll hook you up), and are largely out of scope of this post, but consist of (if I can remember them all):\n Disable Posix advisory locks.  This prevents you from accessing the same database from an external process (eg, from the command line tool) while the database is running, but that is acceptable for our use.\n  Disable the malloc() global lock (I don’t remember why this was there, but apparently not needed for our case)\n In other words, the core design of SQLite was pretty much on point.  I don’t think people realize how incredible a tool it is.  Rather, most of the effort into optimizing the performance of the system came down to optimizing the BIOS and kernel power settings to eliminate extraneous memory access (eg, disable prefetching) and prevent CPUs self-throttling to conserve power.\n  There’s a general conception that EC2 is faster, cheaper, and easier than hosting your own hardware.  Maybe I’m old school, but I’ve never quite subscribed to that notion.  The best price you can possibly get on an EC2 server is to prepay for a year with a 3 year commitment, but the price you still pay on day one is  equal to the cost of the hardware.  Because think of it: Amazon isn’t going to take a chance on you, so they’re not going to buy hardware for you unless they get paid up front, and are confident they’ll get paid back many times more.  So you are out the same amount of cash, for the same hardware, except rather than getting five years of solid use — you need to pay that same amount of money 5 more times (because unlike phones, server hardware doesn’t turn into a pumpkin after 3 years).  EC2 comes at an astonishing premium — perhaps 3-10x the actual hardware cost — which is fine if you value the convenience that much.  But what’s less known is that it also comes at an enormous performance penalty.\n At the time of this writing, the largest EC2 instance you can possibly buy is the x1e.32xlarge, with 128 “vCPUs” and 4TB of RAM.  It costs $26.688 per hour, meaning $233K/yr — for a single server.  (If you commit to 3 years and prepay for 1, you can get it for “only” $350K for 3 years.)  Here’s how that server compares to what you can host yourself at a fraction of both the up front and ongoing cost:\n  The vertical axis shows the total number of Queries Per Second, and the horizontal axis shows how many threads are being used to get that datapoint.  The test is run for 100s for each thread count configuration (eg, 100s with 1 thread, 100s with 2 threads, etc), and the fastest individual second is used as the result.  (This is important as it can take a while for the the CPU caches to “warm up” and this filters out the artificially slow samples.)  The full performance test can be found on  GitHub here.\n The query itself just sums a range of 10 rows randomly located inside 10B row (447GB) two column database of random integers, one of which is indexed and the other not.  This means that the test is fully cached in RAM, and the database is precached prior to the test.  No writes are done during this test, only reads.  Each thread is NUMA aware, meaning all its local memory access is done inside a local memory node, and the database itself is split between the NUMA nodes (though contrary to expectation, NUMA awareness doesn’t actually matter much for this test).  Everything is done on a stock 16.04 Ubuntu install.\n The orange line shows total aggregate performance of the EC2 box capping out around 1.5M queries per second.  The blue line shows the same test on a “bare metal” machine, which gets upwards of 4M queries per second and keeps on climbing for the duration of the test.  (I only care about 192 threads for the purpose of my test so I didn’t worry about going higher.)  The red line shows the same test, but for a 30B row table (1.3TB) — larger than the physical RAM of the bare metal machine.\n  First, wow.  This is a ton of horsepower.  4M queries per second from a single server is nothing to sneeze at, even recognizing that it’s a pretty artificial query to be testing.  (If you test “SELECT 1;” it gets about 160M queries per second, but that’s even more artificial.)\n Second, SQLite scales amazingly, almost out of the box.  This test achieves almost perfect linear scalability as we add physical CPUs, and hyperthreading works much better than I expected in eeking out extra capacity after that.\n But third, wtf is wrong with EC2?  I really assumed 1 vCPU was roughly equal to 1 physical CPU, but man is that wrong.  That is really highlighted here:\n  This is the same basic chart, but this time showing the average performance of each thread, and how that performance changes with thread count.  The blue line shows pretty much what I’d expect: per-thread performance stays stable (remarkably so) as new physical cores are activated, but starts to drop as we hit hyperthreading territory.  In fact, this is scaling far more linearly than I expected, as the test is designed in such a way to ensure each CPU is accessing remote RAM 87.5% of the time.  This means it’s pretty much a worst-case scenario in terms of NUMA access, but it doesn’t seem to degrade the performance of the test much at all.  Looks like Intel can do something right, and Purley’s new memory architecture is pretty solid!\n Additionally, the red line shows that even when 25% of the reads go to disk, it has a negligible impact on total performance.  I attribute this to the crazy fast access of NVME SSD drives — again, much better than expected.\n But the orange line shows that each new thread on the EC2 box comes at a substantial penalty to the others.  First, this chart shows pretty obviously that 128 “virtual CPUs” actually means 64 physical CPUs + hyperthreading.  That’s pretty disappointing and misleading, as I really assumed every vCPU was implied to be equal performance.\n More importantly, however, is the curve of that orange line itself.  This is easier to see when the test is re-run after replacing the 10-billion row database with a single-row database, to remove memory access from the equation:\n  (Please excuse the jagged data, this was run with a shorter period per sample and thus is a bit more noisy, but it gets the point across.)\n The blue line shows QPS per thread on the bare machine as new threads are added, and as you would expect, it gets perfect linear scalability up to 192 physical cores, and then linearly drops off as hyperthreading comes into play.\n The red line is the EC2 box, and performance degrades even before hitting 64 physical cores, but then drops off precipitously after that.  Even worse, the curve of that line signals that it’s not memory access slowing things down — it’s power throttling.  Once you get over 64 cores and start hyperthreading, the power consumed by each CPU goes up.  But clearly EC2 has configured things in some kind of “balanced” performance profile, which means the clock speed of the CPU is reduced when the total power consumption gets too high — thereby limiting power consumption at the expense of performance.\n This results in a curved performance-per-thread-count profile, which levels off into a linear downward slope at 128 threads because that’s the point at which all the 128 CPUs are in use.  Once all CPUs are used, threads just compete for a slot — and adding more threads doesn’t consume any more power (but it’s linear because each new thread takes time away from the existing threads).\n It turns out a major hidden advantage of hosting your own hardware is it means you can configure the BIOS to suit your own needs, and in our particular case those changes were everything.\n   Crazy powerful servers are surprisingly cheap to buy (so long as you are hosting your own hardware)\n   Not all EC2 virtual CPUs are the same, and none of them are remotely as powerful as an actual CPU you host yourself\n  All this testing was done before Meltdown and Spectre, so I’m not sure how the performance of this test will be impacted.  We’re running those tests now, and if anybody is interested, I’ll write up and share the results.  Early indications suggest about a 2.5% reduction in performance, but more work remains to be done.\n Additionally, though this test was focused on read performance, I should mention that SQLite has fantastic write performance as well.  By default SQLite uses database-level locking (minimal concurrency), and there is an “out of the box” option to enable WAL mode to get fantastic read concurrency — as shown by this test.  But lesser known is that there is a branch of SQLite that has  page locking, which enables for fantastic concurrent write performance.  Reach out to the SQLite folks and I’m sure they’ll tell you more!", "posttime": "2020-05-05 19:38:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "sqlite,服务器,single,性能,performance", "title": "在单台服务器上将SQLite扩展到4M QPS(EC2与裸机)", "title_en": "Scaling SQLite to 4M QPS on a Single Server (EC2 vs. Bare Metal)", "transed": 1, "url": "https://blog.expensify.com/2018/01/08/scaling-sqlite-to-4m-qps-on-a-single-server/", "via": "", "real_tags": ["sqlite", "服务器", "single", "性能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000733, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "巴尔的摩警方备受争议的空中侦察机周五开始飞行，记录城市中每个人在白天的行动。这是这个项目在巴尔的摩的第二次生命。它于2016年在当时的专员凯文·戴维斯(Kevin Davis)的领导下首次秘密运营。现在，它变得更加公开了，但争论仍然存在：这是侵犯隐私还是有效的打击犯罪的工具？你不能真正看到这一点，但私人资助的侦察机正在飞行。这是一种侵犯隐私的行为，还是一种有效的打击犯罪的工具？你不能真正看到这一点，但这架私人资助的侦察机正在飞行。该项目名为空中调查研究(AIR)试点项目，由俄亥俄州一家公司运营，费用由德克萨斯州的一位亿万富翁支付。周五下午，警察局长迈克尔·哈里森告诉11News I-Team，他正在控制人们的期望。我对此没有什么期望，我会持开放态度，让数据来说明问题。与其说我有什么看法或期望，不如说我不想抱太大希望，也不想让任何人抱太大希望。但哈里森说，让我们把这看作是一项实验，该项目将试行6个月。该合同将监视的重点缩小到枪击、凶杀、抢劫和劫车，图像储存45天，只能用于刑事调查。为了评估该项目的有效性，将进行一项独立审计。该项目的总预算为3690667美元，全部由私人支付。美国公民自由联盟(American Civil Liberties Union)在维持该项目的诉讼中败诉，但该组织已经提起上诉。马里兰州ACLU的律师大卫·罗卡说，这是美国历史上对美国城市实施的最全面的监控。(注：美国公民自由联盟(ACLU)律师大卫·罗卡(David Rocah)表示，该项目的总预算为3690667美元，全部由私人支付。)美国公民自由联盟(American Civil Liberties Union)在维持该项目的诉讼中败诉，但该组织已经上诉。这是美国历史上对美国城市实施的最全面的监控。这实际上相当于让一名警察在居民每次出门时都跟着他们，如果这发生在现实生活中，我们所有人都会理解这样做对隐私的巨大影响。哈里森认为没有隐私问题。在公共街道上，人行道上没有隐私可言。哈里森说，它不能在私人场所或墙外拍摄，而且当你在户外时，也不能期望隐私。美国公民自由联盟表示，联邦上诉法院已经同意加快上诉速度，争论可能会在今年夏天进行听证。||阅读：BPD侦察机专业服务协议备忘录||", "note_en": "The controversial aerial surveillance planes for Baltimore police started flying Friday, recording movements of everyone in the city during the day.This is the second life of this program in Baltimore. It first operated in secret in 2016 under then-Commissioner Kevin Davis. Now, it&#39;s more public, but the debate remains the same: Is it an invasion of privacy or an effective crime-fighting tool?You can&#39;t really see it, but the privately funded surveillance plane is flying. It&#39;s called the Aerial Investigation Research (AIR) Pilot Program, and it&#39;s operated by an Ohio-based company and is paid for by a Texas billionaire.Police Commissioner Michael Harrison told the 11 News I-Team Friday afternoon that he&#39;s keeping expectations in check.&#34;I don&#39;t have an expectation, and I am going into this with an open mind and let the data speak for itself. And rather than have an opinion or an expectation, I don&#39;t want to get my hopes up or anybody&#39;s hopes up. But let&#39;s look at this as an experiment,&#34; Harrison said.The program will operate on a trial basis for six months. The contract narrows the focus of the surveillance to shootings, homicides, robberies and carjackings.Images are stored for 45 days and can be used only for criminal investigation. An independent audit will be done to evaluate the program&#39;s effectiveness.The total budget for the program is $3,690,667 -- all of it paid for privately.The American Civil Liberties Union lost a court battle to keep the program grounded, but the organization has already appealed.&#34;It&#39;s the most comprehensive surveillance ever imposed on an American city in the history of the country,&#34; ACLU of Maryland attorney David Rocah said. &#34;It&#39;s the virtual equivalent of having a police officer follow a resident every time they walk out the door, and if that happened in real life, all of us would understand the huge privacy implications in doing that.&#34;Harrison sees no privacy concern.There is no expectation of privacy on a public street, a sidewalk. It can&#39;t film inside private places or beyond walls, and while you are outside, there is no expectation of privacy,&#34; Harrison said.The ACLU said the federal appeals court has agreed to expedite the appeal, and arguments could be heard over the summer.|| Read: BPD surveillance plane professional service agreement memo ||", "posttime": "2020-05-05 19:27:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "巴尔的摩,plane,项目,surveillance", "title": "一架侦察机开始在巴尔的摩上空飞行，记录每个人的行动", "title_en": "Surveillance plane starts flying over Baltimore, recording everyone's movements", "transed": 1, "url": "https://www.wbaltv.com/article/baltimore-police-surveillance-plane-starts-flying-recording-everyones-movements/32346318", "via": "", "real_tags": ["巴尔的摩", "plane", "项目"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000732, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "NVIDIA在2006年发布的统一特斯拉架构解决了日益复杂的问题。在G80模具中，层与层之间没有更多的区别。流多处理器(SM)取代了所有以前的单元，这要归功于它能够无差别地运行顶点、碎片和几何体内核(kernel&#34；kernel)。根据流水线的需要，通过交换每个SM运行的内核自动实现负载平衡。我们几乎从NV30/NV40中丢弃了整个着色器架构，并使用新的通用处理器架构(SIMT)从头开始创建了一个新的着色器架构，这也引入了新的处理器设计方法。\n不再支持SIMD，着色器单元现在每个时钟可以处理一个整数或一个浮点32指令。SM接收以32条为一组的称为经纱的线程。理想情况下，WARP中的所有线程将同时执行相同的指令，只是针对不同的数据(因此称为SIMT)。多线程指令单元(MT)负责启用/禁用WARP中的线程，以防它们的指令指针(IP)聚合/发散。这里有两个SFU单元来帮助进行复杂的数学计算，如平方根反比、sin、cos、exp和rcp。这些单元也能够在每个时钟执行一条指令，但是因为它们只有两条，所以WARP执行速度除以4。Float64没有硬件支持，它是由软件完成的，极大地影响了执行速度。当SM可以通过始终具有可调度的Warps来隐藏内存延迟时，而且当Warp中的线程没有分歧时(控制流将它们保持在相同的指令路径上)，SM将以其最大潜力执行。4KiB寄存器文件(RF)是存储线程状态的位置。消耗太多堆栈的线程会减少可以保持运行的线程数量，并会降低性能。特斯拉的旗舰芯片是90纳米的G80，在GeForce 8800GTX中具有特色。两个SMS与纹理单元和TeX L1高速缓存一起捆绑到纹理处理器集群(TPC)中。在8TPC的情况下，G80公布了128个内核，生成了345.6个Gflop[3]。8800GTX卡在当时非常受欢迎，收到了极好的评论，受到了负担得起的客户的喜爱。它是如此强大，以至于在发布13个月后，它仍然是市场上速度最快的GPU之一。与特斯拉一起，NVIDIA推出了计算统一设备架构(CUDA)C编程语言，这是C99的超集。这让GPGPU爱好者松了一口气，他们欢迎用GLSL着色器和纹理欺骗GPU的另一种选择。尽管本节广泛关注SM，但它只是系统的一半。SM需要提供驻留在GPU存储器中的指令和数据。为了避免停滞，GPU不会像CPU那样试图避免带有大量缓存和投机的内存旅行。GPU通过使内存总线饱和来满足数以千计的线程I/O来实现延迟。为此，像G80这样的芯片通过六条双向DRAM存储线实现了高内存吞吐量。\n特斯拉是一个冒险的举动，结果证明是一件非常好的事情。它非常成功，在接下来的二十年里成为了NVIDIA图形处理器的基础。虽然从那时起我们确实进行了重大的架构更改(费米是一个重大的系统架构更改，Maxwell是处理器设计的另一个重大更改)，但我们在G80中引入的基本结构至今仍在很大程度上保留着[Pascal]。\n2010年，NVIDIA发布了基于其全新费米架构的GF100。他们最新芯片的内部结构在费米白皮书中有大量描述[4]。执行模型仍然围绕SM上调度的32个线程的偏差。多亏了40纳米的制程，NVIDIA将所有东西都翻了一番/翻了四番。SM现在可以同时调度两个半翘曲(16个线程)，这要归功于16个CUDA内核的两个阵列。由于每个内核每个时钟执行一条指令，因此SM可以在每个时钟有效地引退一条WARP指令(容量是Tesla SM的4倍)。特种部队的数量也有所增加，尽管没有那么多，因为运力只增加了一倍。可以推断，这些类型的指令并没有被广泛使用。对Float64有半硬件支持，其中操作由两个CUDA内核组合而成。GF100可以在单个时钟内进行整数乘法运算，这要归功于32位ALU(特斯拉为24位)，并且使用融合乘加(FMA)技术从IEEE 754-1985移动到IEEE 754-2008的Float32流水线具有更好的精度(比特斯拉使用的MAD更精确)。从编程的角度来看，Fermi的统一内存系统允许CUDA C使用C++特性(如对象、虚拟方法和异常)进行扩展。随着纹理单位现在成为SM的一部分，TPC的概念消失了。取而代之的是具有四个SM的图形处理器群集(GPC)。最后但并非最不重要的是，SM\n有传言称，代号为Ampere的下一个架构将于2020年晚些时候宣布。由于英特尔证明了7纳米的冰湖还有小型化的空间，毫无疑问，NVIDIA将利用它进一步缩小其SM，并再次将性能提高一倍。有趣的是，既然现在有三种不同用途的内核，NVIDIA将如何继续发展下去，这将是令人感兴趣的。我们会看到模具完全由张量芯或RT芯组成吗？我很好奇想知道。\n*", "note_en": "Nvidia solved the problem of escalating complexity with its &#34;unified&#34; Tesla architecture, released in 2006.    In the G80 die, there is no more distinction between layers. The Stream Multiprocessor (SM) replaces all previous units thanks to is ability to run vertex, fragment and geometry &#34;kernel&#34; without distinction. The load balancing happens automatically by swapping the &#34;kernel&#34; run by each SM depending on the need of the pipeline.  We pretty much threw out the entire shader architecture from NV30/NV40 and made a new one from scratch with a new general processor architecture (SIMT), that also introduced new processor design methodologies.\n No longer SIMD capable, &#34;shaders units&#34; are now &#34;core&#34; capable of one integer or one float32 instruction per clock. SM receive threads in groups of 32 called warps. Ideally all threads in a warp will execute the same instruction at the same time, only on different data (hence the name SIMT). The Multi-threaded Instruction Unit (MT) takes care of enabling/disabling threads in a warp in case their Instruction Pointer (IP) converge/diverge.    Two SFU units are here to help with complex mathematic calculation such as inverse square root, sin, cos, exp, and rcp. These units are also able to execute one instruction per clock but since there are only two of them, warp execution speed is divided by four. There is no hardware support for float64, it is done in software and greatly affects the execution speed.     A SM will perform at its maximum potential when it can hide memory latency by always having schedulable warps but also when the thread in a warp don&#39;t diverge (control-flow keeps them on the same instruction path). The 4KiB Register File (RF) is where thread states are stored. Threads consuming too much stack reduce how many of them can be kept in-flight and will degrade performance.    The Tesla flagship die was the 90nm based G80, featured in the GeForce 8800 GTX. Two SMs are bundled into a Texture Processor Cluster (TPC) along with a Texture Unit and Tex L1 cache. With 8 TPC, the G80 advertised 128 cores generating 345.6 Gflops  [3]. The 8800 GTX card was immensely popular in its time, receiving stellar reviews and beloved by customers who could afford it. It was such a tour-de-force that thirteen months after its release, it remained one of the fastest GPU on the market.        Along with Tesla, Nvidia introduced the Compute Unified Device Architecture (CUDA) C programming language, a super-set of C99. It was a relief for GPGPU enthusiasts who welcomed an alternative to cheating the GPU with GLSL shaders and textures.    Even though this section focuses extensively on the SM, it is only one half of the system. The SM needs to be fed instructions and data which resides in the GPU memory. To avoid stalling, GPUs don&#39;t try to avoid memory trips with a lot of cache and speculation like CPUs do. GPUs embrace latency by saturating the memory bus to satisfy thousands of threads I/O. To this effect a die like the G80 implements a high memory throughput via six bi-directional DRAM memory lines.\n   Tesla was a risky move which turned out to be a very Good Thing. It was so successful that it became the foundation of NVidia GPUs for the next two decades. While we’ve definitely made major architectural changes since then (Fermi was a major system architecture change and Maxwell was another large change to the processor design), the basic structure that we introduced in G80 is still very much there today [Pascal].\n In 2010, Nvidia released the GF100 based on its brand new Fermi architecture. The internals of their latest chip were abundantly described in the Fermi white-paper  [4].  The execution model still revolves around warps of 32 threads scheduled on a SM. Only thanks to a process of 40nm, NVidia doubled/quadrupled everything. A SM can now schedule two half-warp (16 threads) simultaneously thanks to two arrays of 16 CUDA cores. With each core executing one instruction per clock, a SM has can effective retire one warp instruction per clock (4x the capacity of Tesla SM).  The SFU count was also beefed up although not as much since capacity only doubled. It can be inferred these types of instructions were not widely used.  There is a semi-hardware support for float64 where operations are carried by two CUDA core combined. The GF100 can do an integer multiplication in a single clock thanks to a 32-bit ALU (vs 24-bit in Tesla) and has better accuracy with a float32 pipeline moving from IEEE 754-1985 to IEEE 754-2008 with Fused Multiply-Add (FMA) (more accurate than MAD used in Tesla).  From a programming perspective, the unified memory system of Fermi allowed CUDA C to be augmented with C++ features such as object, virtual methods, and exceptions.   With the Texture Units now part of the SM, the concept of TPC disappeared. It is replaced with the Graphics Processor Clusters (GPC) which features four SMs.Last but not least, the SM is gifted with a Polymorph Engine which takes care of vertex fetching, viewport transform, and tessellation. The flagship card, the GeForce GTX 480 featured a GF100 advertising 512 cores and 1,345 Gflops  [5].\n   In 2012 Nvidia released the Kepler architecture named after the astrologer best known for his laws of planetary motion. As usual an inside peek was allowed by the GK104 whitepaper  [6].   With Kepler, Nvidia drastically improved the energy efficiency of their die by lowering the clock and unifying the core clock with the card clock (they used to be clocked at 2x).  These changes should have resulted in lower performance. However, thanks to a process halved down to 28nm and the removal of the hardware scheduler in favor of software, Nvidia was able to not only pack more SMs but also improve their design.  The Next Generation Streaming Multiprocessor (SMX) is a monster where pretty much everything has been doubled or tripled.  With four warp scheduler able to process a whole warp in one clock (compared to Fermi&#39;s half-warp design) the SMX now contains 196 cores. Each scheduler has a double dispatch to execute a second instruction in a warp if it is independent from the instruction currently executed. This double scheduling may not always doable since one column of 32 cores is shared by two dispatchs.   This approach made the scheduling logic more complicated (we will revisit this) but with up to six warp instruction per clock a SMX provided 2x the performance of a Fermi SM.  The flagship NVIDIA GeForce GTX 680 card with a GK104 die and 8 SMX advertised 1536 cores to reach 3,250 Gflops  [7]. The details of the die become so intricate that the labels in the drawing must be removed.        Notice how a completely revamped memory sub-systems running at a whooping 6Ghz allowed to reduce the number of memory controllers from six to four.\n   In 2014 Nvidia release Maxwell, its 10th generation GPU. As the GM107 whitepaper  [8] explains, the soul of the first generation was &#34;Extreme power efficiency and Exceptionalperformance per watt consumed&#34;. The consumer target was &#34;power-limited environments like notebooks and small form factor (SFF) PC&#34;.  The major decision was to drop the Kepler approach of having a non-power-of-two CUDA cores per SM where some cores are shared and go back to running half-warp. For the first time in the series, the SMM features less cores than its predecessor with &#34;only&#34; 128 cores.   Having the core count &#34;aligned with warp size&#34; improved die partitioning which resulted in saved area and power.     The second generation of Maxwell (described in the GM200 whitepaper  [9]) improved performance significantly while preserving the energy efficiency of the first generation.   With a process stagnating at 28nm, Nvidia engineers could not bank on raw miniaturization to improve performance. However, fewer cores per SMM reduced their size which meant many more SMM could be packed on a die. Maxwell Gen2 packs 2x the number of SMM as Kepler with only a 25% increase in die area.     On the list of improvements can also be found a simplified scheduling logic which reduced redundant recomputation of scheduling decisions reduced computation latency to provide a better warp occupancy. Memory clock was also cranked up 15%.  Looking at the Maxwell GM200 block diagram starts to hurt the eyes. But we still do it like the GPU heroes we are. The flagship NVIDIA GeForce GTX 980 Ti card with a GM200 die and 24 SMM advertised 3072 cores to reach 6,060 Gflops  [10].\n    In 2016, Nvidia introduced Pascal. The GP104 whitepaper  [11] gives a impression of &#34;deja-vu&#34; since the Pascal SM looks exactly like the Maxwell SMM. No change in the SM did not mean stagnating performance since the 16nm process allowed to pack more SMs and once again double the Gflops.   The other major improvements was the memory system built around the brand new GDDR5X. Providing 10 Gflops transfer rates thanks to eight memory controllers, the 256-bit memory interface provides 43% more memory bandwidth to reduce warp starvation.  The flagship NVIDIA GeForce GTX 1080 Ti card with a GP102 die and 28 TSM advertised 3584 cores to reach 11,340 Gflops  [12].\n   With the release of Turing in 2018, Nvidia operated its &#34;biggest architectural leap forward in over a decade&#34;  [13]. Not only the &#34;Turing SM&#34; added A.I dedicated Tensor cores, they also gained Raytracing cores. This fragmented design reminds of the Pre-Tesla layered architecture, proving once again that history likes to repeat itself. Besides the new cores, Turing added three major features. First, the CUDA core is now a super-scalar able to execute both integer instruction and float instruction in parallel. If you were around in 1996 this may remind you of the Intel &#34;breakthrough&#34; Pentium architecture.  Second, the new GDDR6X memory sub-system, backed by 16 controllers, can now achieve 14 Gbps.   Last, threads are no longer sharing their Instruction Pointer in a warp. Thanks to Independent Thread Scheduling introduced in Volta each thread has its own IP. As a result, SMs are free to fine schedule threads in a warp without the need to make them converge as soon as possible.   The flagship NVIDIA GeForce GTX 2080 Ti card with a TU102 die and 68 TSM advertised 4352 cores to reach 13,45 Gflops  [14]. No block diagram is provided since it would have looked like a blurry green blob.\n   The next architecture, codenamed Ampere, is rumored to be announced later in 2020. Since Intel proved that there is still room for miniaturization with the 7nm of Ice Lake, there is little doubt Nvidia will leverage it to shrink its SM even more and double performance again.        What will be interesting is to see is how Nvidia keeps on evolving now that there dies have three types of cores serving different purpose. Will we see die entirely made of Tensors cores or RT cores? I am curious to find out.\n       *", "posttime": "2020-05-05 19:12:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nvidia,stream,sm,memory", "title": "NVIDIA Stream多处理器发展史", "title_en": "An History of Nvidia Stream Multiprocessor", "transed": 1, "url": "http://fabiensanglard.net/cuda/index.html", "via": "", "real_tags": ["nvidia", "stream", "sm", "memory"]}, {"category": "", "categoryclass": "", "imagename": "b5d0f1167a86fdbbb8945644fc4c54f6.png", "infoid": 1000731, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "具有系统跟踪功能的Python GOTO。GitHub Gist：即时共享代码、笔记和代码片段。", "note_en": "python goto with system trace function . GitHub Gist: instantly share code, notes, and snippets.", "posttime": "2020-05-05 19:12:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,goto,代码", "title": "Python Goto实现系统跟踪功能(2017)", "title_en": "Python goto implemented with system trace function (2017)", "transed": 1, "url": "https://gist.github.com/georgexsh/ede5163a294ced53c3e2369ccaa392cc", "via": "", "real_tags": ["python", "goto", "代码"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000730, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一项研究显示，全球气温每上升1摄氏度，10亿人要么流离失所，要么被迫忍受难以忍受的高温，气候危机的人类代价将比之前认为的更严重、更广泛、更快。\n这篇论文警告说，在加速排放的最坏情况下，目前居住着世界三分之一人口的地区将在50年内变得与撒哈拉最热的地区一样热。即使在最乐观的前景下，12亿人也将落入人类至少在6000年来蓬勃发展的舒适“气候利基”之外。\n这项研究的作者说，他们对这些发现感到“震惊”和“震惊”，因为他们没有想到我们这个物种会如此脆弱。\n“数字令人瞠目结舌。埃克塞特大学的蒂姆·兰顿(Tim Lenton)说：“我第一次看到它们的时候，真的是看了两眼。”“我之前研究过气候临界点，通常被认为是世界末日。但这更加切中要害。这让威胁变得非常人性化。“。\n这篇发表在“美国国家科学院院刊”上的论文没有将气候变化视为一个物理学或经济学问题，而是研究了它如何影响人类栖息地。\n绝大多数人类一直生活在年平均气温在6摄氏度(43华氏度)到28摄氏度(82华氏度)左右的地区，这对人类健康和食品生产是理想的。但是，由于人为的全球变暖，这一甜蜜点正在转移和缩小，这让更多的人陷入了作者所说的“几乎不适合居住”的极端境地。\n人类之所以特别敏感，是因为我们集中在陆地上--陆地变暖的速度比海洋还快--而且未来的人口增长大多将在本已炎热的非洲和亚洲地区。由于这些人口因素，当全球气温达到3摄氏度(预计到本世纪末)时，人类平均气温将上升7.5摄氏度。\n在这个水平上，世界上大约30%的人口将生活在极端高温中-定义为平均温度为29摄氏度(84华氏度)。在撒哈拉沙漠最炎热的地区以外，这种情况极其罕见，但随着全球气温达到3摄氏度，预计印度将有12亿人，尼日利亚将有4.85亿人，巴基斯坦、印度尼西亚和苏丹各将超过1亿人。\n“我认为公平地说，平均气温超过29摄氏度是不适宜居住的。你必须搬家或适应。但适应是有限度的。如果你有足够的钱和精力，你可以用空调和空运食物，然后你可能就没事了。但对大多数人来说，情况并非如此，“该研究的主要作者之一、瓦格宁根大学的马腾·谢弗教授说。\n谢弗是一名训练有素的生态学家，他说这项研究最初是一次思维实验。他之前曾研究过热带雨林和稀树草原的气候分布，并想知道如果他将同样的方法应用于人类，结果会是什么。“我们知道大多数生物的栖息地都受到温度的限制。例如，企鹅只在冷水中发现，珊瑚只在温暖的水中发现。但我们没想到人类会这么敏感。我们认为自己适应能力很强，因为我们使用衣服、暖气和空调。但事实上，绝大多数人都生活在--而且一直都生活在--这个气候利基环境中，这个环境正在以前所未有的速度移动。“。\n我们被震级震撼了，“他说。“未来50年将发生比过去6000年更多的变化。”\n作者说，他们的发现应该会刺激政策制定者加快减排，共同努力应对移民，因为每一个可以避免的变暖程度都将拯救10亿人，使其免于脱离人类的气候利基。\n另一位作者、南京大学的徐驰表示：“显然，我们需要一种全球性的方式来保护我们的孩子免受预期变化可能引发的潜在巨大社会紧张局势的影响。”", "note_en": "The human cost of the  climate crisis will hit harder, wider and sooner than previously believed, according to a  study that shows a billion people will either be displaced or forced to endure insufferable heat for every additional 1C rise in the global temperature.\n In a worst-case scenario of accelerating emissions, areas currently home to a third of the world’s population will be as hot as the hottest parts of the Sahara within 50 years, the paper warns. Even in the most optimistic outlook, 1.2 billion people will fall outside the comfortable “climate niche” in which humans have thrived for at least 6,000 years.\n The authors of the study said they were “floored” and “blown away” by the findings because they had not expected our species to be so vulnerable.\n “The numbers are flabbergasting. I literally did a double take when I first saw them, ” Tim Lenton, of Exeter University, said. “I’ve previously studied climate tipping points, which are usually considered apocalyptic. But this hit home harder. This puts the threat in very human terms.”\n  Instead of looking at climate change as a problem of physics or economics, the paper, published in the Proceedings of the National Academy of Sciences, examines how it affects the human habitat.\n The vast majority of humanity has always lived in regions where the average annual temperatures are around 6C (43F) to 28C (82F), which is ideal for human health and food production. But this sweet spot is shifting and shrinking as a result of manmade global heating, which drops more people into what the authors describe as “near unliveable” extremes.\n Humanity is particularly sensitive because we are concentrated on land – which is warming faster than the oceans – and because most future population growth will be in already hot regions of Africa and Asia. As a result of these demographic factors, the average human will experience a temperature increase of 7.5C when global temperatures reach 3C, which is forecast towards the end of this century.\n At that level, about 30% of the world’s population would live in extreme heat – defined as an average temperature of 29C (84F). These conditions are extremely rare outside the most scorched parts of the Sahara, but with global heating of 3C they are projected to envelop 1.2 billion people in India, 485 million in Nigeria and more than 100 million in each of Pakistan, Indonesia and Sudan.\n   “I think it is fair to say that average temperatures over 29C are unliveable. You’d have to move or adapt. But there are limits to adaptation. If you have enough money and energy, you can use air conditioning and fly in food and then you might be OK. But that is not the case for most people,” said one of the lead authors of the study, Prof Marten Scheffer of Wageningen University.\n An ecologist by training, Scheffer said the study started as a thought-experiment. He had previously studied the climate distribution of rainforests and savanna and wondered what the result would be if he applied the same methodology to humans. “We know that most creatures’ habitats are limited by temperature. For example, penguins are only found in cold water and corals only in warm water. But we did not expect humans to be so sensitive. We think of ourselves as very adaptable because we use clothes, heating and air conditioning. But, in fact, the vast majority of people live – and have always lived – inside a climate niche that is now moving as never before.”\n We were blown away by the magnitude,” he said. “There will be more change in the next 50 years than in the past 6,000 years.”\n The authors said their findings should spur policymakers to accelerate emission cuts and work together to cope with migration because each degree of warming that can be avoided will save a billion people from falling out of humanity’s climate niche.\n “Clearly we will need a global approach to safeguard our children against the potentially enormous social tensions the projected change could invoke,” another of the authors, Xu Chi of Nanjing University, said.", "posttime": "2020-05-05 19:12:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "生活,people,人类", "title": "50年内将有10亿人生活在令人难以忍受的炎热中--研究", "title_en": "One billion people will live in insufferable heat within 50 years – study", "transed": 1, "url": "https://www.theguardian.com/environment/2020/may/05/one-billion-people-will-live-in-insufferable-heat-within-50-years-study", "via": "", "real_tags": ["生活", "people", "人类"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000728, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了帮助支持我们的社区在COVID-19期间远程工作，我们将在2020年6月30日之前免费访问ACM在我们的数字图书馆中发布的所有作品。了解更多。\n我们使用饼干，以确保我们给你最好的经验，在我们的网站。\n您的浏览器似乎不支持它们，这会影响网站功能。", "note_en": "To help support our community working remotely during COVID-19, we are making all work published by ACM in our Digital Library freely accessible through June 30, 2020.  Learn more\n   We use cookies to ensure that we give you the best experience on our website.\n  It seems your browser doesn&#39;t support them and this affects the site functionality.", "posttime": "2020-05-05 18:43:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "度量,cost,网站,ensure", "title": "在实践中度量回归测试的成本", "title_en": "Measuring the Cost of Regression Testing in Practice", "transed": 1, "url": "https://dl.acm.org/doi/pdf/10.1145/3106237.3106288", "via": "", "real_tags": ["度量", "cost", "网站", "ensure"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000726, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "学生们经常要求推荐他们下一步应该学习什么语言。如果你正在找一份工业界的工作，我的回答是学习目前最热门的东西：C++、Java和C#--可能还有Python、Ruby、PHP和Perl。\n另一方面，如果你对启蒙、学术研究或初创企业感兴趣，那么你选择下一门语言的标准不是就业能力，而是表达能力。在学术研究和创业中，你需要提高你作为程序员的效率，因为你(可能)不会使用根深蒂固的代码库，所以你可以自由地使用任何最适合手头任务的语言。\n在这里，您将找到四种值得学习的好语言的描述--Haskell、Scala、ML和Scheme--每种语言都列出了我最喜欢的特性，并指出了在哪里可以学到更多。\n当然，这份简短的名单绝不是详尽的。有许多不同寻常的语言擅长于利基语言。仅举几个例子，还有用于系统编程的D；用于并发的Erlang或Clojure；以及用于约束编程的Datalog。然后还有像Smalltalk这样的语言--很久以前从主流计算中分支出来的另类但功能齐全的领域。\n我鼓励我的学生永远不要停止学习利基语言。它们拓展了你的思维方式，拓展了你快速解决的问题种类，拓展了你对计算意义的理解。\nHaskell作为编写编译器、解释器或静态分析器的语言表现出色。我不做很多人工智能、自然语言处理或机器学习研究，但如果我做了，哈斯克尔也会是我在那里的第一选择。(该计划将是第二个强有力的计划。)。Haskell是唯一广泛使用的纯惰性函数式编程语言。\n与Standard ML和OCaml一样，Haskell使用了Hindley-Milner风格的类型推断的扩展，这意味着程序员不必写下(大多数)类型，因为编译器可以推断它们。根据我的经验，通过Hindley-Milner类型的系统很难获得bug。事实上，有经验的程序员能够熟练地将正确性约束直接编码到Haskell类型的系统中。在第一次用Haskell(或ML)编程后，人们常说的一句话是，一旦程序编译完毕，几乎可以肯定它是正确的。\n作为一种纯语言，其副作用(变量或数据结构和I/O的突变)在语言本身中是被禁止的。这迫使该语言的设计者认真考虑如何提供这样的功能。他们的答案是Monads，使人们能够在安全约束的框架内执行副作用和I/O。当然，Haskell允许用户定义他们自己的Monad，现在程序员可以访问Monad来进行延续、传感器、异常、逻辑编程等等。\n除了纯洁之外，哈斯克尔还很懒。也就是说，Haskell中的表达式直到(并且除非)其结果是向前计算所必需的，否则不会求值。一些人争辩说，承诺的懒惰带来的效率收益并没有实现，但这并不是我关心的问题。我欣赏懒惰，因为它增加了表现力。在Haskell中，描述无限范围的数据结构是微不足道的。在其他语言允许相互递归函数的情况下，Haskell允许相互递归的值。\n更务实的是，我发现懒惰在编码选项类型时很有用，在这种情况下，利用空格应该总是会破坏程序。在Haskell中，您可以避免创建选项类型，而是使用ERROR生成空值。由于懒惰，Haskell中的每种类型都自动具有两个附加值：不终止和错误。使用得当，这消除了许多繁琐的模式匹配。\n我最喜欢的Haskell特性是类型类。Haskell的类型系统允许编译器根据其类型上下文推断要运行的正确代码，即使该类型上下文也被推断出来。让我兴奋的类型类的例子是有界格。有界格是具有最小元素(BOT)、最大元素(TOP)、偏序小于关系(&lt；：)、联接运算(Join)和相交运算(Meet)的数学结构。\n在Haskell中，可以将有界格定义为类型类：class Lattice a where top：：a bot：：A(&lt；：)：：A-&gt；a-&gt；Bool Join：：A-&gt；a-&&gt；a-&gt；a。\n这就是说，如果类型a是一个格子，那么a就支持预期的操作。\n我真正喜欢Haskell的地方是，它允许程序员定义类的条件实例；例如：Instance(Ord k，Lattice a)=&gt；Lattice(Map K A)，其中bot=Map.Empty top=error$&#34；无法表示。&#34；f&lt；：g=Map.isSubmapOfBy(&lt；：)f g f`joining`g=Map.unionWith Join f g f`Meet`g=Map.inter.。\n这条规则说，如果类型k是序的实例(类Ord)，类型a是格的实例，那么从k到a的映射也是格的实例。\n作为另一个示例，您可以很容易地将两个晶格的笛卡尔乘积转换为晶格：Instance(Lattice a，Lattice b)=&gt；Lattice(a，b)，其中bot=(bot，bot)top=(top，top)(a1，b1)&lt；：(a2，b2)=(a1&lt；：a2)||(a1=a2&amp；&amp；b1&lt；：b2)(a1，b1)`加入`(a2，b2)=(a1`加入`a2，b1`加入`b2)(a1，b1)`相遇`(a2，b2)=(a1`相遇`a2，b1`相遇`b2)\n它很容易将网格操作、关系和元素自然地提升到几乎任何数据结构。最终结果是，如果您在代码中的任何位置使用表达式bot或关系&lt；：，Haskell就可以在编译时根据表达式的类型(它也可以推断)推断出它们的适当含义。\nML语言有函数器来扮演类型类的角色，但是它们缺乏对Haskell类型类的即席多态性支持。在MLS和Haskell中花费了相当多的时间进行编程，推理对表现力的实际影响怎么强调都不为过。\n真实世界的哈斯克尔。正如书名所暗示的，本书关注的是将Haskell用于实际应用程序(例如，Web编程)，而不仅仅是编译器、解释器和程序分析器。\nScala是Java的一个坚固、富有表现力、绝对优越的替代品。Scala是我用于编写Web服务器或IRC客户端等任务的编程语言。与OCaml不同的是，OCaml是一种移植了面向对象系统的函数式语言，而Scala感觉更像是一个真正的混合体。也就是说，面向对象的程序员应该能够立即开始使用Scala，只按照他们选择的方式选择功能部分。\n我是从马丁·奥德斯基(Martin Odersky)在2006年POPL的特邀演讲中了解到Scala的。当时，我认为函数式编程严格优于面向对象编程，所以我不认为需要一种融合了函数式编程和面向对象编程的语言。(这可能是因为我当时写的只有编译器、解释器和静态分析器。)。\n直到我从头开始编写了一个并发httpd来支持针对yaplet的长期轮询的Ajax，我才意识到对Scala的需求。为了获得多核支持，我用Java编写了第一个版本。我不认为Java有那么糟糕，我可以享受做得很好的面向对象编程。然而，作为一名函数式程序员，缺少对函数式编程特性(如高阶函数)的简洁支持让我很恼火。所以，我给了斯卡拉一个机会。\nScala在JVM上运行，因此我可以逐步将现有项目移植到Scala中。这还意味着，Scala除了拥有相当大的库之外，还可以访问整个Java库。这意味着您可以在Scala中完成真正的工作。\n当我开始使用Scala时，函数世界和面向对象世界是如此紧密地混合在一起，给我留下了深刻的印象。具体地说，Scala有一个强大的case类/模式匹配系统，解决了我使用Standard ML、OCaml和Haskell时挥之不去的烦恼：程序员可以决定对象的哪些字段应该匹配(而不是强制所有字段都匹配)，并且允许使用可变参数。事实上，Scala甚至允许程序员定义的模式。\n我编写了很多在抽象语法节点上操作的函数，所以只在语法子节点上匹配，而忽略注释或源位置的字段是很好的。\nCASE类系统允许跨多个文件或同一文件的多个部分拆分代数数据类型的定义。Scala还通过称为特征的类结构支持定义良好的多重继承。而且，Scala允许操作符重载；甚至函数应用程序和集合更新也可以重载。如果使用得当，这往往会使我的Scala程序更加直观和简洁。\n事实证明，与类型类在Haskell中节省代码的方式相同，有一个特性可以节省大量代码，那就是隐含。您可以将隐含想象为类型检查器的错误恢复阶段的API。简而言之，当类型检查器需要X但得到Y时，它将检查在作用域中是否有标记为隐式的函数将Y转换为X；如果找到，它会自动应用隐式函数来修复类型错误。\n含义使您看起来像是在有限范围内扩展类型的功能。例如，假设您想要将&#34；一个egrieHTML()方法添加到字符串类型中。您不能修改String的定义，但可以通过隐式修改，以便当myString.scape eHTML()的类型检查失败时，它将在作用域中查找隐式函数，该函数可以将String对象转换为支持audeHTML()方法的类型。\nIMPLICE还允许在Scala中使用更干净的特定于域的嵌入式语言(DSEL)，因为它们允许您将Scala文字(如3或#34；While)透明地映射到dsel中的文字。\nMartin Odersky(Scala的创建者)、Lex Spoon和Bill Venners在Scala中的编程既是一个很好的介绍，也是一个很好的参考。\nML家族是语言设计领域的一个甜蜜点：严格的、副作用大的和Hindley-Milner类型推断的。这使得这些语言适用于需要高性能和更强的正确性保证的实际项目。ML家族得到了航空工程师(因为它对无bug代码的支持)和金融行业的程序员(出于同样的原因)的支持。标准ML是我学得很好的第一种函数式语言，所以我仍然记得被它的表现力所震惊。\n今天，OCaml似乎是最受欢迎的学习ML，但至少有一个令人信服的论据支持SML&#39；MLton。MLton确实阐述了函数式语言提供最好的优化机会这一论点。作为一个全程序优化编译器，我还没有看到另一个编译器的性能能与之匹敌。我曾经为MLton创建了OpenGL绑定来玩弄3D图形，结果得到的程序比我用作参考的基于C++的模型运行得更快，只用了10%的代码。\nSML中的函数器系统虽然比Haskell的类型类系统更冗长，但更灵活。一旦您在Haskell中为种类/类型k实例化了一个类型类T，您就不能为该种类/类型再次实例化该类型类。使用函数器，每个实例都有自己的名称，因此您可以拥有同一类型的给定函数器的多个实例。我很少需要这样的表现力，但在那些我需要的情况下，这是很好的。\nML族谱上的另一个现代分支OCaml是很好了解的，因为有一个很大的社区投资于它，这意味着有很多可用的库。OCaml工具链也很丰富，开发人员可以使用解释器、优化编译器和字节码编译器。\n因为ML语言比所有主流语言更有表现力，但是它们仍然允许产生副作用，所以它们在学习Haskell的过程中做了一个很好的停顿。在Haskell中，还不精通函数式程序设计的程序员可能会发现他们在角落里重复编写代码，在那里他们无法访问他们需要的Monad。MLS保持对不完整设计的副作用进行修补，这可以防止项目突然出现不可预料的重构或中止决定点。(工业和信息化部电子科学技术情报研究所陈冯富珍译为“逃生舱门”，即“逃生舱门”)，以防止项目突然出现意外的重构或中止决策点。语言的一个有用的衡量标准是它对软件系统的糟糕或不完整设计的容忍度，因为设计不可避免地会随着程序的发展而变化。在这方面，MLS仍然比哈斯克尔占上风。\n面向正在工作的程序员的ML可作为SML的很好的入门和参考文本。这是我学到的一本书，它很好地介绍了ML语言家族(包括Haskell)的编程思想过程。它还介绍了如何实现SML库没有提供的重要功能数据结构(树和映射)。\nSchema是一种具有纯粹核心(λ演算和列表理论)和最大化表达自由的设计任务的语言。它是非类型化的，这使得它非常适合基于网络的编程和快速原型制作。考虑到它的Lisp传统，Scheme是人工智能的天然选择。\n由于支持任意精度的数字，Scheme也是我实现密码算法的首选。[有关示例，请参阅我对RSA的简短实现，以及Scheme中的Fermat和Solovay-Strassen素数测试。]。\n到目前为止，使用Scheme最有说服力的理由是它的宏观系统。Scheme可用的所有宏系统，包括标准语法规则和语法大小写系统，都是图灵等价的。\n因此，程序员可以重新配置方案，以减少语言和手头任务之间的阻抗失配。与对一流延续的支持相结合，甚至可以嵌入替代编程范例(如逻辑编程)。\n例如，在代码中：(let((x(Amb345))(y(Amb678)(assert(=(+xy)12))(Display X)(Display Y))。\n可以编写一个amb宏，该宏选择正确的参数使后续的ASSERT语句为真。(此程序先打印4，然后打印8。)。\n在Scheme中，在计算的任何时间点，程序都可以捕获当前延续作为过程：调用此过程会将程序返回到捕获延续时存在的求值上下文。使用延续的编程感觉就像在时间中来回旅行，在平行的宇宙之间转换。\n归根结底，Scheme是如此的小巧和可扩展，所以关于它没有太多可说的，除了Scheme允许程序员从语言中提取程序员愿意放入其中的任何内容。\n球拍(前身为PLT Scheme)是一个包含电池的Scheme系统，包括一个经过战斗测试的IDE、一个编译器和一个解释器。更重要的是，racket库非常庞大：它有一个将类型系统添加到语言中的模块；它有一个添加模式匹配的模块；它有一个用于OpenGL编程的模块；它还有一个用于基于延续的web服务器的模块。在球拍中，几乎所有的东西都已经有了一个模块。\n我在球拍上看到的最好的一本书--球拍领域--通过游戏编程介绍了这种语言的特点：", "note_en": "Students often ask for a recommendation on what language they should learn next. If you&#39;re looking for a job in industry, my reply is to learn whatever is hot right now: C++, Java and C#--and probably Python, Ruby, PHP and Perl too.\n  If, on the other hand, you&#39;re interested in enlightenment, academic research or a start-up, the criterion by which you should choose your next language is not employability, but expressiveness. In academic research and in entrepreneurship, you need to multiply your effectiveness as a programmer, and since you (probably) won&#39;t be working with an entrenched code base, you are free to use whatever language best suits the task at hand.\n  Here you&#39;ll find descriptions of four good languages to learn--Haskell, Scala, ML and Scheme--with a list of my favorite features for each, and pointers on where to learn more.\n  Of course, this short list is by no means exhaustive. There are many uncommon languages that excel at niches. To name just a few more, there&#39;s also D for systems programming; Erlang or Clojure for concurrency; and Datalog for constraint programming. Then there are languages like Smalltalk--alternate yet fully capable universes that branched off from mainstream computing long ago.\n  I encourage my students to never stop learning niche languages. They expand your modes of thinking, the kinds of problems you solve quickly and your appreciation for the meaning of computation.\n   Haskell excels as a language for writing a compiler, an interpreter or a static analyzer. I don&#39;t do a lot of artificial intelligence, natural-language processing or machine-learning research, but if I did, Haskell would be my first pick there too. ( Scheme would be a strong second.) Haskell is the only widely used pure, lazy functional programming language.\n  Like Standard ML and OCaml, Haskell uses an extension of  Hindley-Milner-style type inference, which means that the programmer doesn&#39;t have to write down (most) types, because the compiler can infer them. It has been my experience that it is difficult to get a bug through the Hindley-Milner type system. In fact, experienced programmers become adept at encoding correctness constraints directly into the Haskell type system. A common remark after programming in Haskell (or ML) for the first time is that once the program compiles, it&#39;s almost certainly correct.\n  As a pure language, side effects (mutations of variables or data structures and I/O) are prohibited in the language proper. This has forced the language&#39;s designers to think seriously about how to provide such functionality. Their answer,  monads, enables one to perform side effects and I/O inside a safely constrained framework. Naturally, Haskell lets users define their own monads, and now the programmer has access to monads for continuations, transducers, exceptions, logic programming and more.\n  Aside from being pure, Haskell is also lazy. That is, an expression in Haskell is not evaluated until (and unless) its result is required to make forward computational progress. Some have argued that the promised efficiency gains from laziness haven&#39;t materialized, but that&#39;s not of concern for me. I appreciate laziness for the increase in  expressiveness. In Haskell, it is trivial to describe data structures of infinite extent. Where other languages permit mutually recursive functions, Haskell permits mutually recursive values.\n  More pragmatically, I have found laziness useful in encoding option types, where utilizing the empty case should always nuke the program. In Haskell, you can avoid creating an option type and instead use  error to produce the empty value. Because of laziness, every type in Haskell automatically has two additional values: non-termination and error. Used well, this eliminates much tedious pattern matching.\n  My favorite feature of Haskell is type classes. Haskell&#39;s type system allows the compiler to infer the correct code to run based on its type context, even when that type context is  also inferred. The example of type classes that got me excited was bounded lattices. A  bounded lattice is a mathematical structure that has a least element ( bot), a greatest element ( top), a partially ordered less than relation ( &lt;:), a join operation ( join) and a meet operation ( meet).\n  In Haskell, one can define a bounded lattice as a type class:  class Lattice a where top :: a bot :: a (&lt;:) :: a -&gt; a -&gt; Bool join :: a -&gt; a -&gt; a meet :: a -&gt; a -&gt; a\n This says that if type  a is a  Lattice, then  a supports the expected operations.\n  What I really love about Haskell is that it lets the programmer define conditional instances of a class; for example:  instance (Ord k, Lattice a) =&gt; Lattice (Map k a) where bot = Map.empty top = error $ &#34;Cannot be represented.&#34; f &lt;: g = Map.isSubmapOfBy (&lt;:) f g f `join` g = Map.unionWith join f g f `meet` g = Map.intersectionWith meet f g\n This rule says that if the type  k is an instance of an order (class  Ord) and the type  a is an instance of a lattice, then a map from  k to  a is also an instance of a lattice.\n  As another example, you can easily turn the Cartesian product of two lattices into a lattice:  instance (Lattice a, Lattice b) =&gt; Lattice (a,b) where bot = (bot,bot) top = (top,top) (a1,b1) &lt;: (a2,b2) = (a1 &lt;: a2) || (a1 == a2 &amp;&amp; b1 &lt;: b2) (a1,b1) `join` (a2,b2) = (a1 `join` a2, b1 `join` b2) (a1,b1) `meet` (a2,b2) = (a1 `meet` a2, b1 `meet` b2)\n  It&#39;s easy to make the &#34;natural&#34; lifting of the lattice operations, relations and elements to almost any data structure. The end result is that if you use the expression  bot or the relation  &lt;: anywhere in your code, Haskell can infer, at compile-time, their &#34;appropriate&#34; meaning based on the type of the expression (which it can also infer).\n  The ML languages have functors to play the role of type classes, but they lack the  ad hoc polymorphism support of Haskell&#39;s type classes. Having spent a considerable amount of time programming in the MLs and in Haskell, the practical ramifications of inference on expressiveness cannot be overstated.\n        Real World Haskell. As the title implies, this book pays attention to using Haskell for real applications ( e.g., web programming), instead of just for compilers, interpreters and program analyzers.\n      Scala is a rugged, expressive, strictly superior replacement for Java. Scala is the programming language I use for tasks like writing web servers or IRC clients. In contrast to  OCaml, which was a functional language with an object-oriented system grafted to it, Scala feels more like a true hybrid. That is, object-oriented programmers should be able to start using Scala immediately, picking up the functional parts only as they choose to.\n  I learned of Scala from  Martin Odersky&#39;s invited talk at POPL 2006. At the time, I saw functional programming as strictly superior to object-oriented programming, so I didn&#39;t see a need for a language that fused functional and object-oriented programming. (That was probably because all I wrote back then were compilers, interpreters and static analyzers.)\n  The need for Scala didn&#39;t become apparent to me until I wrote a concurrent HTTPD from scratch to support long-polled AJAX for  yaplet. In order to get multicore support, I wrote the first version in Java. I don&#39;t think Java is all that bad, and I can enjoy well-done object-oriented programming. As a functional programmer, however, the lack of terse support for functional programming features (like higher-order functions) grates on me. So, I gave Scala a chance.\n  Scala runs on the JVM, so I could gradually port my existing project into Scala. It also means that Scala, in addition to its own rather  large library, has access to the entire Java library as well. This means you can get real work done in Scala.\n  As I started using Scala, I became impressed by how tightly the functional and object-oriented worlds had been blended. In particular, Scala has a powerful case class/pattern-matching system that addressed annoyances lingering from my experiences with Standard ML, OCaml and Haskell: the programmer can decide which fields of an object should be matchable (as opposed to being forced to match on all of them), and variable-arity arguments are permitted. In fact, Scala even allows programmer-defined patterns.\n  I write a lot of functions that operate on abstract syntax nodes, so it&#39;s nice to match on only the syntactic children, while ignoring fields for annotations or source location.\n  The case class system lets one split the definition of an algebraic data type across multiple files or across multiple parts of the same file. Scala also supports well-defined multiple inheritance through class-like constructs called traits. And, Scala allows operator overloading; even function application and collection update can be overloaded. Used well, this tends to make my Scala programs more intuitive and concise.\n  One feature that turns out to save a lot of code, in the same way that type classes save code in Haskell, is implicits. You can imagine implicits as an API for the error-recovery phase of the type-checker. In short, when the type checker needs an X but got a Y, it will check to see if there&#39;s a function marked implicit in scope that converts Y into X; if it finds one, it automatically applies the implicit function to repair the type error.\n  Implicits make it possible to look like you&#39;re extending the functionality of a type for a limited scope. For example, suppose you want to &#34;add&#34; an  escapeHTML() method to type  String. You can&#39;t modify the definition of  String, but with implicits, you can make it so that when type-checking fails on  myString.escapeHTML(), it will look for an implicit function in scope that can convert a  String object into a type that supports the  escapeHTML() method.\n  Implicits also allow cleaner domain-specific embedded languages (DSELs) in Scala, since they allow you to transparently map Scala literals (like  3 or  &#34;while&#34;) into literals in the DSEL.\n            Programming in Scala  by Martin Odersky (creator of Scala), Lex Spoon, and Bill Venners is great as both an introduction and a reference.\n      The ML family is a sweet spot in the language-design space: strict, side-effectable and Hindley-Milner type-inferred. This makes these languages practical for real-world projects that need high performance  and stronger guarantees of correctness. The ML family has gained traction with aerospace engineers (for its support of bug-free code) and with programmers in the financial industry (for the same reason). Standard ML was the first functional language I learned well, so I still remember being shocked by its expressiveness.\n  Today, OCaml seems to be the popular ML to learn, but there is at least one convincing argument in SML&#39;s favor:  MLton. MLton really delivers on the thesis that functional languages offer the best opportunities at optimization. As a whole-program optimizing compiler, I&#39;ve yet to see another compiler match its performance. I once created OpenGL bindings for MLton to toy around with 3D graphics, and the resulting program ran faster than the C++-based model I had used as a reference, with just 10% of the code.\n  The functor system in SML, while more verbose than Haskell&#39;s type class system, is more flexible. Once you instantiate a type class  T for a kind/type  k in Haskell, you can&#39;t instantiate that type class again for that kind/type. With functors, each instance gets its own name, so you can have multiple instances of a given functor for the same type. It&#39;s rarely been the case that I needed such expressiveness, but it has been nice in those cases where I have.\n  The other modern branch on the ML family tree, OCaml, is good to know because there is a large community invested in it, which means that there are a lot of libraries available. The OCaml tool-chain is also rich, with interpreters, optimizing compilers and byte-code compilers available to the developer.\n  Because the ML languages are more expressive than all the mainstream languages, but they still permit side effects, they make a nice stop on the way to learning Haskell. In Haskell, programmers not yet well versed in functional program design may find they repeatedly code themselves into a corner, where they don&#39;t have access to the monad that they need. The MLs keep the side effects &#34;escape hatch&#34; open to patch over incomplete design, which prevents projects from coming to a sudden, unexpected &#34;refactor-or-abort&#34; decision point. One useful measure of a language is how well it tolerates a bad or incomplete design for the software system, since design is something that inevitably changes as a program evolves. In this regard, the MLs still have the upper hand over Haskell.\n        ML for the Working Programmer  serves as a good introductory and reference text for SML.   It&#39;s the book I learned from, and it&#39;s a good introduction to the thought process of programming in the ML family of languages (including Haskell). It also covers how to implement the important functional data structures (trees and maps) not provided by the SML library.\n      Scheme is a language with a pure core (λ-calculus and the theory of lists) and a design mandate to maximize freedom of expression. It&#39;s untyped, which makes it ideal for web-based programming and rapid prototyping. Given its Lisp heritage, Scheme is a natural fit for artificial intelligence.\n  With its support for arbitrary-precision numerics, Scheme is also my first choice for implementing cryptographic algorithms. [For examples, see my short implementations of  RSA and the  Fermat and Solovay-Strassen primality tests in Scheme.]\n  By far, the most compelling reason to use Scheme is its macro system. All of the macro systems available for Scheme, including the standard  syntax-rules and  syntax-case systems, are Turing-equivalent.\n  Consequently, the programmer can reconfigure Scheme to reduce the impedance mismatch between the language and the task at hand. Combined with support for first-class continuations, it is even possible to embed alternate programming paradigms (like logic programming).\n  For example, in the code:  (let ((x (amb 3 4 5)) (y (amb 6 7 8 ))) (assert (= (+ x y) 12)) (display x) (display y))\n it is possible to write an  amb macro that &#34;chooses&#34; the right argument to make a subsequent  assert statement be true. (This program prints 4 and then 8.)\n  In Scheme, during any point in the computation, the program can capture the current continuation as a procedure: invoking this procedure returns the program to the evaluation context that existed when the continuation was captured. Programming with continuations feels like traveling back and forth in time and shifting between parallel universes.\n  Ultimately, Scheme is so minimal and extensible that there&#39;s not a whole lot to say about it, except that Scheme allows the programmer to extract from the language whatever the programmer is willing to put into it.\n            Racket (formerly PLT Scheme) is a &#34;batteries included&#34; Scheme system, including a battle-tested IDE, a compiler and an interpreter. More importantly, the Racket library is immense: it has a module that adds a type system to the language; it has a module that adds pattern-matching; it has a module for OpenGL programming; and it has a module for continuation-based web servers. In Racket, there&#39;s already a module for just about everything.\n  The best book I&#39;ve seen on Racket -- Realm of Racket  -- introduces the features of the language through game programming:", "posttime": "2020-05-05 18:43:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming language,编程语言,programming,类型", "title": "高级编程语言", "title_en": "Advanced Programming Languages", "transed": 1, "url": "http://matt.might.net/articles/best-programming-languages/", "via": "", "real_tags": ["编程", "language", "编程语言", "类型"]}, {"category": "", "categoryclass": "", "imagename": "26b84a86800a731030ff2028a4cc736f.jpg", "infoid": 1000725, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我们的最佳CPU指南系列中，这里是我们推荐的工作站CPU列表的最新更新。文本中的所有数字都会更新，以反映撰写时的定价。图表中的数字反映了MSRP。\n有时选择CPU很困难。所以我们会帮你掩护的。在我们的CPU指南中，我们为您挑选了一些可用的最好的处理器，并从我们的评论中提供了数据。我们的工作站最佳CPU指南主要涵盖消费者可用的工作站处理器，尽管有些服务器产品涵盖了这两个细分市场。\nEPYC 7302P(2 TB/skt)英特尔级联湖(2 TB/skt？)英特尔至强+Optane(4.5 TB/skt)。\n随着我们迈入2020年，高端台式机市场会有所放缓，每个人都可以暂时坐在一些新硬件上，因为他们知道自己的钱是最划算的。随着AMD的第三代ThreadRipper处理器和Intel的Cascade Lake-X硬件的发布，我们现在正处于这个安静的时期，我们可以给出一些建议。\n值得注意的是，对于一些高端台式机用户，特别是专业人士来说，由于吞吐量的增加，可以随着时间的推移摊销硬件成本，价格和寿命可能不是问题。此外，企业甚至学术机构可能会首选预建系统的供应商，因此将体验到与简单地购买处理器不同的成本结构-他们最终得到的系统可能具有延长的部件和支持保修，甚至可能具有渐进的自动升级，这将由供应商来提供。希望这份清单在为他们的客户构建系统时也能对这些供应商有用。\n另外，为了解决在AMD的Ryzen和ThreadRipper平台上的ECC问题。ECC位于这一地区，这类工作，但它是未经验证的。还有所谓的非官方支持，这与官方资格不同。从技术上讲，Ryzen和ThreadRipper CPU都不是ECC的正式合格处理器，但是它们中的大多数(如果不是全部)将显示非官方支持。这意味着它可能会起作用，但AMD不会为此给你帮助。对此，有两点需要注意：\n首先，它需要主板支持。一些供应商正在设计具有ECC支持的电路板，一些供应商将正式获得支持ECC的资格。请注意，即使供应商列出了官方支持，从AMD的角度来看，您也属于非官方支持。\n其次，还有一个问题，那就是它是否起作用了。当然，您可以在主板上拥有非正式支持ECC的CPU和正式支持ECC的ECC内存，并且操作系统中有一些工具可以确定链中的所有部分是否都支持ECC。但下一个问题是它是否真的起作用了--一些软件只检查它是否支持ECC标志，而不是实际测试它。有报告称，根据大多数衡量标准，用户已将链中的所有内容排序并报告为正在工作，但没有一项实际启用。这可能是由于特定驱动程序或BIOS问题造成的。某些软件可能会显示找到、运行但未启用ECC或类似的文字。最终，您需要能够支持ECC跟踪，这在消费级主板上通常不受本地支持。在服务器级主板上，是这样的。\n这是一个雷区，你的里程数可能会有所不同。我们这里的建议是，如果您绝对需要一个带有ECC的AMD CPU作为构建的关键任务部分，那么可以选择EPYC。\n因此，马上就会有强烈的抗议，因为我不建议在这里使用任何英特尔CPU。英特尔最近在11月推出了Cascade Lake-X刷新平台，价格明显低于上一代Skylake Refresh-X，那么为什么这会成为问题呢？它分为几个阶段。\n首先，英特尔最近的生产持续供不应求。因此，该公司主要专注于制造高性能硬件，主要是Xeon系列。英特尔之前曾承诺继续以酷睿i9和酷睿i7硬件保住市场，所以我们在美国的主要电子零售商找不到任何HEDT处理器的事实是一个相当令人担忧的问题。相比之下，消费级的9900K处理器似乎确实供应充足。\n此外，由于库存不足和缺乏获得新库存的承诺，美国的主要网店甚至从他们的网站上完全删除了英特尔的产品页面。尽管英特尔首席执行官鲍勃·斯旺甚至在一封题为“我们为你而来”的公开信中写下了维持生产和支持客户的内容，但这一点仍然存在。在亚马逊上搜索高端的Cascade Lake-X Corei9-10980XE没有显示列表，只有第二件实际上给出了一个没有库存的相关CPU。第三方有一些库存，例如Newegg上的核心计数最低的模型，但没有库存。B&amp；H有所有CPU的列表，但所有CPU都没有库存或延交订单。\n英特尔表示，到2020年，其处理器仍将存在供应问题。鉴于HEDT市场只占公司总吞吐量的很小一部分，这意味着这个市场目前可能不是生产的优先级。此外，考虑到英特尔最近缩小了其Cooper Lake Xeon平台的范围，在这一点上，我们不知道英特尔的HEDT平台未来会有什么。该公司刚刚发布了Comet Lake处理器，但这只是消费者平台上双通道设计的最多10个内核。\n有时，您需要的只是核心--要么是大量虚拟机的核心，要么是高度并行的工作负载，或者其他什么。AMD和英特尔都试图为其企业级产品线保留其最高内核数量的硬件，例如64核EPYC和28/56核Xeons，这意味着这些硬件还需要为多插槽功能或RDIMM支持和RAS功能等功能支付额外费用。\n对于更多的“消费者”硬件，提供的最高内核数量是AMD的64个内核，ThreadRipper 3990X，目前售价为3700美元，建议零售价为3990美元。该芯片提供56个PCIe 4.0通道，另外8个通道用于芯片组，基频为2.9 GHz，Turbo为4.3 GHz。我们在价值20000美元的英特尔高级企业CPU上测试了ThreadRipper 3990X，并测试了令人尴尬的并行工作负载。\n如果需要ECC，用户如果想去EPYC，可以通过这种方式获得64个内核。单路64核EPYC 7702P是这里的正确选择，建议零售价为4425美元，或者说最近的零售价为4784美元。对于这个价格，硬件有2.0 GHz的基频和3.35 GHz的turbo频率，并且可以访问8个完整的内存通道。ThreadRipper 3990X具有更高的频率，这是因为它的TDP更高(200W比280W)，但到目前为止，3990X只有四个内存通道。重要的是要牢记这一点。\n英特尔的产品包括56核的Cascade Lake-AP处理器，但这些处理器只能作为默认服务器系统的一部分提供，英特尔的合作伙伴可以在其上销售。英特尔仍然拒绝透露这款处理器的价格，尽管我们估计它的价格在25000美元左右。有28个内核的至强W-3175X待售，售价为3100美元，但只有一半内核的价格几乎相同。在这种情况下，EPYC7702P是一个可以现成购买的插入式部件，得到了我们的投票。\n最近HEDT更新的最佳性能之一是ThreadRipper 3970X。在采用统一内存设计的高端台式机平台上以英特尔不久前提供的10个内核的价格提供32个内核，每美元的内核数量是一个惊人的飞跃，而当你考虑到ThreadRipper拥有更高的IPC和激进的频率时，它就更加令人印象深刻。\n上一代32核第二代Threadriper的主要抱怨是内存分布不均，这一点随着3970X一起消失了，允许更统一的设计，几乎可以在工作站上很好地完成您想要做的所有事情。\n在我们的3970X评测中，我用了“血洗”这个词，因为在任何基准测试中，酷睿i9-10980XE想要做得很好，3970X都会获胜，有时会因为拥有几乎两倍的内核而大幅领先。10980XE赢得的唯一一次多线程测试是与AVX512相关的，一些人抱怨说，我没有指出10980XE也以很小(低于3%)的利润率赢得了35+游戏测试，但那些人显然不知道这些处理器是怎么回事。对于任何人来说，3970X都是一款很好的处理器，只要他们能为芯片支付2000美元，另外再支付100美元以上的散热费(然后是500美元以上的内存，500美元的主板，等等)。\n对于任何想要更具成本效益的高端台式机系统的人来说，我们可以通过看看中层台式机来节省一些钱。这就是英特尔实际上更具竞争力的地方：i9-10980XE有18个内核，OEM价格为979美元，而24核TR 3960X的价格为1399美元。每个核心的成本显然很接近，两个处理器的成本都在55美元左右，而且两个处理器都有加分(尽管在我们的测试中，24核确实经常领先，这可能是意料之中的)。\n在以前的指南中，由于可用性的不同，这一部分始终是不同的。然而，尽管英特尔仍然存在问题，但这一次AMD的选择似乎很多。其中一些处理器最终落入系统建造商或原始设备制造商(尤其是英特尔)手中，而不是进入零售市场。\n这里的一个选择是看看AMD的Ryzen93950X，尽管在高端桌面空间，如果你需要大量的内存或PCIe通道，这并不是很合适。Ryzen 9 3950X在某些地区也很难找到。\n可以选择查看较旧的硬件。AMD的16核第二代Threadriper 2950X是个不错的选择，尽管考虑到第三代硬件的性能，我可能会避免更高的内核数量，除非它真的很便宜。英特尔仍在销售Skylake-X处理器，希望当这篇文章上线时，他们能享受半价折扣，尽管这可能不是既定的。\n如果你真的想要最好的中端硬件，对于AMD，我建议你买便宜的2950X，或者等到3960X上市。\n我在这里添加了AVX处理器的建议，因为如果用户可能遇到AVX加速，它将使用针对消费者和高端桌面用户的软件。英特尔一直在推动其AVX512支持，甚至将其引入其消费类笔记本电脑处理器，以努力推动DLBoost等产品提高AI吞吐量。在过去的几年里，我在英特尔遇到的一个痛点实际上是获得了一份AVX512使用案例的列表：使用AVX512的确切软件示例。它通常是针对非常具体的东西而添加的，比如Photoshop中的某个滤镜，或者是一个特别版的基准测试，但最终高性能计算领域的人会从中获益最多。对于那些用户，这个建议是给您的。\n我们的酷睿i9-10980XE审核示例。这是一个QS(合格样本)芯片，这意味着尽可能接近零售。\n你能买到的适用于AVX512的最好的高端台式机现成处理器是酷睿i9-10980XE，它的18核都支持AVX512。如果您需要ECC，那么Xeon W-3275/3175X将是您最好的选择，但它的成本会稍高一些，并且需要一个特殊的Xeon W主板。如果不考虑成本，则迁移到具有Xeon Scalable处理器的双插槽系统可能更可取，不过请注意，这会引入非统一内存访问(NUMA)环境，如果软件不支持NUMA，则会阻止批量数据传输。为了安全起见，通常首选单插座。英特尔在这里的不利之处是找到一个待售的CPU。\n每插槽高达2 TB的AMD EPYC、采用Optane DCPMM的英特尔至强，每插槽高达4.5 TB，或英特尔酷睿i9-10900X(或任何酷睿i9-109xx系列)。\n由于多个虚拟机或高内存使用情形要求，有些用户只是为了提供内存支持。对于这些问题，有时内存容量比计算性能更重要，因为软件需要以TB为单位的工作空间-在这种情况下，将DRAM增加一倍至128 GB或更多总是比增加计算更有利，因为它减少了在DRAM和存储之间来回移动数据的压力。通常也是在这种情况下，建议使用带ECC的RDIMM，因为随着内存容量的增加，错误位翻转的可能性确实会随着内存容量的增加而增加。这一产品类别的内存价格通常也比CPU成本高出一个数量级。\n在这种情况下，一种选择是EPYC，像售价500美元的7232P可以轻松支持2TB的LRDIMM(请注意，如果你要购买*那么多内存，那么以4784美元的价格购买64核7702P并不是什么飞跃)。\n使用x86处理器获得更多内存的唯一方法是选择配备Optane DC永久内存的英特尔至强可扩展处理器，每个插槽允许高达4.5 TB的内存。为了达到这个数字，你必须投资于M个处理器中的一个，这会使芯片的成本再增加3000美元。这里的另一个因素是Optane DCPMM不能通过通常的渠道免费销售：它通常是OEM系统构建的一部分，因此用户最终将获得特定OEM的支持联系。对于较大的企业和研究社区，这应该是合适的-请咨询您首选的OEM，了解他们提供的产品。\n我还想在这里为英特尔最新的Cascade Lake-X处理器说句话。通常情况下，如果有四个通道/八个内存插槽和每个插槽32 GB的DRAM，则最大可达256 GB。但足够有趣的是，当与ASRock X299主板(X299X Taichi、X299 Steel Legend或X299 Creator)配对时，这些主板现在可以支持128 GB RDIMM，允许每个单个插槽有1 TB的DRAM。\n目前，华硕也在考虑启用LRDIMM支持。这是一个相对较新的发展，由ASRock的一名工程师在他的个人社交媒体账户上发布，但所需的BIOS现在是公开的，对于投资于英特尔生态系统的用户来说，这非常值得一看。\n对于任何想要以最少的$$获得最多内核的人来说，当它们打折时，我们的选择必须是16核ThreadRipper 2950X或1950X。随着新的3000系列开线器处理器的推出，以前的部件经常以低价找到，一些零售商希望清空库存。我们看到，即使在亚马逊上，2950X处理器的价格也低至GB330/400美元(目前为500美元)，而1950X处理器的价格为250美元。\n拥有四通道内存和64个PCIe通道用于生产者工作流是非常棒的-正如我们在评论中指出的那样，这些处理器覆盖了大多数(但不是全部)高端台式机基础，因此值得研究哪些最适合目标软件。但与几年前的旧硬件相比，这对很多人来说是非常值得升级的。与2970WX/2990WX相比，2950X在多个工作负载上的性能也更好，而且价格便宜得多，物有所值。\n如果你想要一个预算内的HEDT系统，问题是它是必须是新的还是要用的。在许多专业情况下，NEW仍然是首选，而在这里获得阶梯的处理器是AMD的ThreadRipper 1900X。8核处理器提供高容量内存支持，大量PCIe通道，ThreadRipper的低端主板现在正进入中低端定价。在减价销售中，1900X的价格不到200美元(有钱的用户可能会转而寻找便宜的1950X)，对于高端台式机处理器来说，这似乎是一个疯狂的低价。\n我们正处于高端台式机市场相对稳定的时期。AMD和英特尔最近都有最新一代硬件的重大发布，我们至少还有2-3个季度才会谈论下一代部件，如果不是更长的话，还有2个季度才会发布。今天购买的任何系统都将持续很长一段时间，因此，在2020年的大部分时间里，人们都不会有太多期待。\n对于英特尔来说，情况丝毫不明朗。我们不知道英特尔计划在这一领域推出什么产品，也不知道什么时候推出。该公司最近将其Cooper Lake Xeon平台的范围缩小为只选择客户，这也停止了任何HEDT产品。这意味着即将上市的下一代Xeon应该是该公司10纳米制程上的冰湖。由于这款产品的预计发布日期为2020年底，人们对实际推出多少款有很多担忧-冰湖至强是否会全面上市，性能会是什么样子，然后对于HEDT市场，它将在什么时候过滤掉呢？。这些都是我想知道英特尔现在是否可以暗示的问题--对于那个制造过程，关键将是试图制造出它能做到的最具成本效益的部件，而HEDT并不能与高端Xeon组件相提并论。在这个时间点上，英特尔2020年的HEDT前景看起来很可怕，我们对2021年或10 nm一无所知。\n这方面的亮点是AMD的ThreadRipper 3990X。该公司推出了64核版本的Zen 2高端台式机系列，这是64核EPYC处理器之一，但拥有一半的内存、一半的PCIe和更高的280W TDP，以提高频率。“我们预计Zen 3产品将于2020年底开始上市，尽管AMD承诺在今年年底之前推出EPYC和Ryzen部件，但我们预计HEDT市场将处于这一产品热潮的后端。”\n看来今天购买的任何HEDT系统在很长一段时间内都不会过时。\n进入2020年，我们希望在未来12-18个月内更新我们的基准套件。最近，我们增加了一个AI基准测试、更多的延迟测试、指令集测试、NAMD(目前限制为64个线程)、一个重量级的单线程有限模拟测试，以及在CPU上渲染的CROSITION。我们正在寻找更多以工作站为重点的测试，最好是使用可以自动化的Windows版免许可证软件。如果你有什么想法，请告诉我们。或者，如果任何ISV/软件供应商正在阅读本文，认为该软件非常适合，并且可以安排新闻许可，请务必与其联系。\n发表评论没有单核类别？遗憾的是，大多数工作站都是在同步工作负载中使用的，这些工作负载不会跨核心均衡负载。回覆。\n大多数？你似乎不明白那是什么意思。仅限单核的工作负载是小众产品，任何系统(英特尔或AMD)都能提供足够不错的单核性能。回覆。\n我不知道大多数情况，但AutoCAD主要是一个单核心应用程序，它是广泛使用的工作站软件。它在很多情况下是受CPU限制的，因此单核性能至关重要。回覆。\nAutodesk有许多产品是单线程的，或者没有很好地利用多线程。还有许多科学工作负载没有内置线程。这包括许多R(或旧的S)包。此外，还有很多科学框架需要快速的单核性能。对于许多人来说，这确实包括大多数工作量。这当然不是通用的，但并不是每个人都有现代代码库、积极的软件优化或可并行的代码路径。回覆。\n存在许多单线程或严重多线程的工作负载。\n..", "note_en": "In our series of Best CPU guides, here’s the latest update to our recommended workstation CPUs list. All numbers in the text are updated to reflect pricing at the time of writing. Numbers in graphs reflect MSRP.\n    Sometimes choosing a CPU is hard. So we&#39;ve got you covered. In our CPU Guides, we give you our pick of some of the best processors available, supplying data from our reviews. Our Best CPUs for Workstations guide mostly covers workstation processors available to consumers, although some server products cover both segments.\n  EPYC 7302P (2 TB/skt) \r\t\t\tIntel Cascade Lake (2 TB/skt?) \r\t\t\tIntel Xeon + Optane (4.5 TB/skt)\n  As we move through 2020, there comes a time when the high-end desktop market slows down a bit and everyone can sit on some new hardware for a while, knowing that they have the best for their money. With the release of AMD’s Third Generation Threadripper processors and Intel’s Cascade Lake-X hardware, we are now in that quiet period and we can give some recommendations.\n  It is worth noting that for some high-end desktop users, particularly professionals that can amortize the cost of the hardware over time due to their increased throughput, price and longevity might not be an issue. Also, businesses or even academic institutions may have preferred vendors for their pre-built systems, and as a result will experience a different cost structure than just simply buying a processor – they end up with a system that might have an extended parts and support warranty, or even with progressive automatic upgrades, and it will be up to the vendor to supply that. Hopefully this list can be useful to those vendors as well when it comes to building systems for their customers.\n    Also, to address the issue of ECC on AMD&#39;s Ryzen and Threadripper platforms. ECC lies in this region of &#39;it kind of works&#39; but isn&#39;t validated. There is what&#39;s called &#39;unofficial support&#39;, which is different to &#39;official qualification&#39;. Technically, none of the Ryzen and Threadripper CPUs are &#39;officially qualified&#39; for ECC, however most of them (if not all) will exhibit unofficial support. This means that it might work, but AMD won&#39;t give you assistance for it. There are two caveats to this:\n  First, it requires motherboard support. Some vendors are designing their boards with ECC support, and some will formally qualify supporting ECC. Note that even if the vendor lists official support, you are in &#39;unofficial support&#39; from AMD&#39;s perspective.\n  Secondly, there&#39;s the &#39;is it working&#39; question. Sure you can have a CPU that unofficially supports ECC, and ECC memory in a motherboard that &#39;officially supports&#39; ECC, and there are tools in the OS to determine that all the parts of the chain support it. But the next question is if it actually works - some software only checks the &#39;does it support ECC&#39; flag, rather than actually testing for it. There are reports of users who, by most measures, have everything in the chain sorted and reported as working, but none of it is actually enabled. This could be down to specific drivers, or a BIOS issue. Some software might say &#39;ECC found, running, but not enabled&#39;, or words to that effect. Ultimately you need the ability to support ECC tracking, which often isn&#39;t supported natively on consumer grade motherboards. On server grade motherboards, it is.\n  It&#39;s a minefield, and your mileage may vary. Our recommendation here is that if you absolutely need an AMD CPU with ECC as a mission critical part of your build, go for EPYC.\n    So straight off the bat, there’s going to be an outcry that I’m not recommending any Intel CPUs here. Intel recently launched its Cascade Lake-X Refresh platform in November with significantly lower prices than the previous Skylake Refresh-X generation, so why is this a problem? It comes in several stages.\n  Firstly, Intel’s recent production demand continues to outstrip supply. As a result, the company is focusing on manufacturing mostly its high performance hardware, mostly in its Xeon line. Intel has previously made a commitment to still keeping the market with Core i9 and Core i7 hardware, so the fact that we can’t find any HEDT processors to buy at the major etailers in the US is quite a concern. The consumer 9900K processors do seem to be in good supply by comparison.\n  Also, major etailers in the US have even gone so far as to remove Intel  product pages from their website completely, due to both the lack of stock and the lack of a commitment to obtaining new stock. This is despite Intel’s CEO Bob Swan even writing about maintaining production and supporting its customers in an open letter entitled ‘ We Are Here For You’. Searching for the top-end Cascade Lake-X Corei9-10980XE on  Amazon shows no listing, and only the second item actually gives a relevant CPU that isn’t in stock. There is some stock at third parties, such as on Newegg with the  lowest core count model, but out of stock.  B&amp;H has listings for all CPUs, but zero stock or back-order for all of them.\n  Intel has stated that through 2020 there will still be supply issues for its processors. Given that the HEDT market is a thin slice of the company’s total throughput, it means that this market might be low priority for production right now. Also, given that Intel has  recently reduced the scope of its Cooper Lake Xeon platform, at this point we don’t know what’s in store for Intel’s HEDT platform in the future. The company has just announced its  Comet Lake processors, but this is only up to 10 cores for a dual channel design on the consumer platform.\n      Sometimes all you want are cores - either for masses of virtual machines, or highly parallel workloads, or something else. Both AMD and Intel try to keep their highest core count hardware for their enterprise lines, such as 64-core EPYCs and 28/56-core Xeons, which means that these also come at an additional cost for features such as multi-socket capabilities or RDIMM support and RAS features.\n  For more ‘consumer’ hardware, the highest core count on offer is 64 cores from AMD, with the Threadripper 3990X, currently available for $3700 from its MSRP of $3990. This chip gives 56 lanes of PCIe 4.0, with another 8 lanes for the chipset, and comes in at a base frequency of 2.9 GHz and turbo of 4.3 GHz.  We tested the Threadripper 3990X against $20k of Intel’s premium enterprise CPUs, and for workloads that were embarrassingly parallel.\n        If there is a need for ECC, users can get 64 cores in this way if they want to go EPYC. The single socket 64-core EPYC 7702P is the right choice here, with an MSRP of $4425, or a recent retail price of $4784. For that price the hardware has a base frequency of 2.0 GHz and a turbo frequency of 3.35 GHz, and access to eight full memory channels. The Threadripper 3990X has higher frequencies due to its higher TDP (200W vs. 280W), but as far the 3990X only has four memory channels. It will be important to keep this in mind.\n    Intel’s offerings go up to the 56-core Cascade Lake-AP processors, but these are only available as part of a default server system that Intel’s partners can sell on. Intel still refuses to attribute a price to this processor, although we’ve estimated it around $25000. There is the Xeon W-3175X up for sale, with 28-cores, for $3100, but this is almost the same cost for only half the cores. The EPYC 7702P in this instance, being a socketed part that can be purchased off the shelf, gets our vote.\n      One of the peak performers of the recent HEDT refreshes was the Threadripper 3970X. Offering 32 cores on a high-end desktop platform with a unified memory design at a price where Intel used to offer 10 cores not too long ago is an astonishing leap in cores per dollar, and when you factor in that the Threadripper has a higher IPC and an aggressive frequency makes it all the more impressive.\n  The main complaint with the previous generation 32-core 2 nd gen Threadripper was the un-even memory distribution, and that is gone with the 3970X, allowing for a more unified design that does almost everything you want to do on a workstation really well.\n    In  our 3970X review, I used the word ‘bloodbath’, because any benchmark where the Core i9-10980XE wanted to do well, the 3970X came and won, sometimes by a large margin by having nearly double the cores. The only multi-threaded test that the 10980XE won was AVX512 related, and some people complained that I didn’t point at the 35+ gaming tests where the 10980XE also won by small (sub-3%) margins, but those people clearly don’t know what these processors are about. The 3970X is a fine processor for anyone who can lay down $2000 for the chip and another $100+ for cooling (then $500+ for memory, $500 for motherboard, etc).\n        For anyone wanting a more cost-effective high-end desktop system, then we can save some monies by looking at the mid-stack. This is where Intel is actually a bit more competitive: 18 cores in the i9-10980XE for an OEM price of $979 compared to the 24 core TR 3960X at $1399. Cost per core is obviously close, around $55/core for both, and both processors have plus points (although in our tests, the 24-core does pull ahead more often than not as is perhaps to be expected).\n    In previous guides this segment has always been varied due to availability. However while Intel still has issues, AMD’s options seem plentiful this time around. Some of these processors are ending up in the hands of system builders or OEMs (especially in Intel’s case), rather than going to retail.\n    One option here is to look at AMD’s Ryzen 9 3950X, although in the high-end desktop space this isn’t really suitable if you need lots of memory or lots of PCIe lanes. The Ryzen 9 3950X is also hard to find in certain regions.\n  There is an option of looking at older hardware. Finding a good deal on AMD’s 16-core 2 nd generation Threadripper, the 2950X, is a good option, although given the performance of the 3rd generation hardware, I would perhaps avoid higher core counts unless it was really cheap. Intel is still selling the Skylake-X processors, and hopefully when this post goes live they will have half-price discounts applied, although that might not be a given.\n  If you really want the best mid-tier hardware, for AMD I’d suggest a cheap 2950X or wait until a 3960X is available.\n      I have added an AVX processor suggestion here for the simple fact that if a user is likely to encounter AVX acceleration, it’s going to be with software aimed at prosumers and high-end desktop users. Intel has been pushing its AVX512 support, even bringing it into its consumer laptop processors, in an effort to drive things like DLBoost to enhance AI throughput. One of the pain points I’ve had with Intel over the last couple of years is actually getting a list of AVX512 use cases: exact software examples where AVX512 is used. It often gets added for very specific things, like a certain filter in Photoshop, or a special edition of a benchmark, but ultimately those in the HPC space get the most from it. For those users, this suggestion is for you.\n  Our Core i9-10980XE review sample. It&#39;s a QS (Qualification Sample) chip, \rwhich is meant to be as near as retail as possible.\n  The best high-end desktop off-the-shelf processor for AVX512 you can buy is the Core i9-10980XE, with 18-cores that all enable AVX512. If you need ECC, then the Xeon W-3275/3175X is going to be your best bet, but it will cost a bit more and a special Xeon W motherboard is needed. If cost is no object, then moving into a dual socket system with Xeon Scalable processors might be preferable, although take note that this introduces a non-uniform memory access (NUMA) environment, which would inhibit bulk data transfer if the software is not NUMA-aware. To be on the safe side usually single socket is preferred. The downside to going Intel here is finding a CPU for sale.\n    AMD EPYC up to 2 TB per socket, \rIntel Xeon with Optane DCPMM up to 4.5 TB per socket, \ror Intel Core i9-10900X (or any Core i9-109xx series)\n  Some users are in it just for the memory support, either due to multiple VMs or high-memory use-case requirements. For these, sometimes the memory capacity is more important than the compute performance, as the software requires workspace in the terabytes – in this case doubling up to 128 GB of DRAM or more is always more beneficial than adding compute, as it reduces the pressure on moving data back and forth between DRAM and storage. Normally it is in this instance too that RDIMMs with ECC are recommended, just because as the memory capacity gets larger, the chance of an errant bit flip does scale with memory capacity. The price of the memory in this product category normally outweighs the CPU cost by an order of magnitude as well.\n    In this instance, one choice is an EPYC, something like the  7232P at $500 will easily support 2 TB of LRDIMMs (mind you, if you’re buying *that* much memory, then going for the  64-core 7702P at $4784 isn’t that much of a leap) out of the box.\n  The only way to get more memory than this with an x86 processor would be to look to Intel Xeon Scalable processors equipped with Optane DC Persistent Memory, allowing up to 4.5 TB per socket. In order to get that amount, you have to invest in one of the M processors, which adds another $3k to the cost of the chip. The other factor here is that Optane DCPMM isn’t freely for sale through usual channels: it typically comes as part of an OEM system build, and as a result the user will end up with a support contact for a specific OEM. For bigger businesses and research communities, that should be suitable – check with your preferred OEM with what they have to offer.\n  I also want to put in a word here for Intel’s latest Cascade Lake-X processors. Normally, with four channels / eight memory slots and 32 GB of DRAM per slot, this would max out at 256 GB. But interestingly enough, when paired with an ASRock X299 motherboard (either the X299X Taichi, the X299 Steel Legend, or the X299 Creator), these motherboards can now support 128 GB RDIMMs, allowing for 1 TB of DRAM per single socket.\n    At this time ASRock is looking into also enabling LRDIMM support. This is a relatively new development, posted by one of ASRock’s engineers to his personal social media accounts, but the BIOSes required are now public, and for users invested in the Intel ecosystem this is well worth a look.\n      For anyone wanting the most cores for the least amount of $$$, then our pick has to go to the 16-core Threadripper 2950X or 1950X when these are on sale. With the launch of the new 3000 series Threadripper processors, the previous parts are often found at low prices with some retailers looking to empty their stock of them. We’ve seen 2950X processors as low as £330/$400 even on Amazon (currently $500), and 1950X for $250.\n      Having four channel memory and 64 PCIe lanes for prosumer workflows is great – as we noted in our reviews these processors cover most, but not all, the high-end desktop bases, so it is worth researching what works best for the intended software. But compared to several years old hardware, this is very much a worthy upgrade for a lot of people. The 2950X also performs better on a number of workloads compared to the 2970WX/2990WX, and can be found for a lot cheaper, making it a worthwhile purchase.\n      If you want a HEDT system on a budget, the question to ask is if it has to be new or used. In a lot of professional circumstances, new is still preferred, and the processor to get on the ladder here is AMD’s Threadripper 1900X. The 8-core processor offers high capacity memory support, lots of PCIe lanes, and the low-end motherboards for Threadripper are now entering that low-to-mid range pricing. In a sale, the 1900X can be found for under $200 (users with more money might look for a cheap 1950X instead), which seems like a crazy low price for a high-end desktop processor.\n      We’re at a time where the high-end desktop market is relatively stable. Both AMD and Intel have recently had big launches of the latest generation hardware, and we’re at least 2-3 quarters away from even speaking about the next generation parts, if not longer, and another 2 quarters away from launch. Any system purchased today will be set to last for a long time, and as a result, there isn’t much to look forward to for most of 2020.\n  For Intel, the situation is not clear in the slightest. We don’t know what Intel plans to launch in this space, or when. The company recently  reduced the scope of its Cooper Lake Xeon platform to select customers only, which also puts a stop to any HEDT product. This means that the next generation Xeon coming to market should be Ice Lake on the company’s 10nm process. With an expected launch date of late 2020 for this, there are lots of concerned thoughts as to how many will actually be available – will Ice Lake Xeon be in general availability, what will the performance be like, and then for the HEDT market, when will it filter down? These are all questions I wonder if Intel can even hint at right now – for that manufacturing process, the key would be trying to manufacture the most cost effective parts that it can, and HEDT doesn’t hold a candle to the premium Xeon components. At this point in time, Intel’s HEDT future in 2020 looks dire, and we have no idea about 2021 or 10nm.\n    The highlight on this perspective is AMD’s Threadripper 3990X. The company launched a 64 core version of its Zen 2 high-end desktop family, which is one of the 64-core EPYC processors but with half the memory, half the PCIe, and a higher 280W TDP to drive the frequency higher. We&#39;re expecting Zen 3 products to start coming by the end of 2020, and although AMD has committed to both EPYC and Ryzen parts being available by the end of the year, we expect the HEDT market to be at the back end of that product rush, so we&#39;re looking into the middle of 2021 for a Threadripper refresh.\n  It seems then that any HEDT system purchased today isn&#39;t going to be obsolete for a long while yet.\n              Moving into 2020, we&#39;re looking to update our benchmark suite for the next 12-18 months. Recently we&#39;ve added an AI benchmark, more latency tests, instruction set testing, NAMD (limited to 64 threads right now), a heavy single threaded-limited simulation test, and Crysis rendered on the CPU. We&#39;re on the lookout for more workstation-focused tests, preferably with licence-free software for Windows that can be automated. If you have any ideas, please let us know. Or, if any ISV / software vendor is reading this, think the software is a good fit, and can arrange press licenses, please do get in touch.\n  POST A COMMENT      No Single-core category? Sadly most workstations are used in synchronous workloads that do not balance loads across cores.  Reply\n  Most? You don’t appear to understand what that means. Single core only workloads are niche, and any system (Intel or AMD) provides decent enough single core performance.  Reply\n  Don&#39;t know about &#39;most&#39;, but AutoCAD is mostly a single-core application, and it&#39;s widely used workstation software. It is CPU bound in many cases, thus single-core performance is critical.  Reply\n  Autodesk has a number of products that are single-threaded or don&#39;t make good use of multithreading. There are also a number of scientific workloads that have no threading built-in. This includes many R (or old S) packages. In addition, there are plenty of scientific frameworks that need fast single core performance.  For many people, this does include &#34;most&#34; workloads. This certainly isn&#39;t universal, but not everyone has the luxury of modern codebases, agressive software optimization or parallelizable code paths.  Reply\n  There are many single-threaded or badly multi-threaded workloads arou\n......", "posttime": "2020-05-05 18:43:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,anandtech,cpus,处理器,intel", "title": "AnandTech：工作站的最佳CPU，2020年5月", "title_en": "AnandTech: Best CPUs for Workstations, May 2020", "transed": 1, "url": "https://www.anandtech.com/show/11891/best-cpus-for-workstations", "via": "", "real_tags": ["2020", "anandtech", "cpus", "处理器", "intel"]}, {"category": "", "categoryclass": "", "imagename": "27037f3d6116bb61e74f4c78d02e50b4.png", "infoid": 1000724, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Amazon RDS for PostgreSQL现在支持主要版本12。PostgreSQL 12包括更好的索引管理、改进的分区功能、符合SQL/JSON规范的JSON路径查询、支持ICU提供的排序的不区分大小写和不区分重音的不确定排序、改进查询计划的最常见值统计信息、创建使用表达式计算值的生成列，以及许多其他功能。\n此版本将扩展包括PostGIS更新到3.0版，PGAudit更新到1.4版，wal2json更新到2.1版，PLV8更新到2.3.14版，Orafce更新到3.8版，pg_repack更新到1.4.5版，pg_hint_plan更新到1.3.5.22a77c版，pglogic更新到2.3.0版。\n要使用新版本，您只需在AWS管理控制台中单击几下即可创建新的Amazon RDS for PostgreSQL数据库实例。\nAmazon RDS for PostgreSQL使您可以在云中轻松设置、操作和扩展PostgreSQL部署。有关定价详细信息和区域可用性，请参阅Amazon RDS for PostgreSQL定价。有关PostgreSQL 12新功能的更多信息，请访问AWS数据库博客。", "note_en": "Amazon RDS for PostgreSQL now supports major version 12.  PostgreSQL 12 includes better management of indexing, improved partitioning capabilities, JSON path queries per SQL/JSON specifications, nondeterministic collations that support case-insensitive and accent-insensitive comparisons for ICU provided collations, most common-value statistics for improved query plans, creation of generated columns that computes values with an expression, and many additional features.\n  This release updates extensions including  PostGIS to version 3.0,  PGAudit to version 1.4,  wal2json to version 2.1,  PLV8 to version 2.3.14,  Orafce to version 3.8,  pg_repack to version 1.4.5,  pg_hint_plan to version 1.3.5.22a77c, and  pglogical to version 2.3.0.\n  To use the new version, you can create a new  Amazon RDS for PostgreSQL database instance with just a few clicks in the  AWS Management Console.\n  Amazon RDS for PostgreSQL makes it easy to set up, operate, and scale PostgreSQL deployments in the cloud. See  Amazon RDS for PostgreSQL Pricing for pricing details and regional availability. Learn more about the new functionality of PostgreSQL 12 in the  AWS Database Blog.", "posttime": "2020-05-05 18:42:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,postgresql,rds,version", "title": "Amazon RDS现在支持PostgreSQL 12", "title_en": "Amazon RDS Now Supports PostgreSQL 12", "transed": 1, "url": "https://aws.amazon.com/about-aws/whats-new/2020/03/amazon-rds-now-supports-postgresql-12/", "via": "", "real_tags": ["amazon", "rds", "version"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000722, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从JSON、模式和GraphQL生成模型和序列化程序，以便在任何编程语言中快速、安全地处理数据。\n立即生成代码。\n{：[{：&#34；Atticus&#34；，：100}，{：&#34；Cleo&#34；，：900}，{：&#34；Orly&#34；}，{：&#34；Jasper&#34；}]}。\n类myData{：Person[]；Static(：String){…。}}类人员{：string；：int？；}。\n设DATA=MyData。(&#39；{&#34；People&#34；：[{&#34；name&#34；：&#34；Olivia&#34；}]}&#39；)。{打印(人员。)。一个人。++}高分可能未定义。\n从npm安装快速类型生成简单JSON示例$ECHO&#39；[1，2，3.14]&#39；|快速类型--lang Go为比特币API生成C#$QuickType https://blockchain.info/latestblock-o LatestBlock.cs为天气API生成打字脚本和运行时检查$QuickType https://goo.gl/Dq2yKd-o Weather.ts--运行时-类型检查从打字脚本类型生成C#类从示例目录生成SWIFT alum.json artist.cs。\n一个好的是金色的，但是大多数都是过时的，或者根本就不能在你的应用程序的编程语言中使用。\n这需要很大的努力，并且必须在API更改时进行更新。不管怎样，你应该专注于你的应用程序。\n这是一种令人不快的编程方式，并且使您的应用程序容易受到API更改的影响。\n给定示例API响应后，QuickType将以您的应用程序语言生成一个易于使用的客户端库。\n当API更改时，QuickType可以重新生成类型，因此您只需更新受影响的应用程序代码(如果有的话)即可。\n在处理类型化API数据时，充分利用编辑器或IDE(自动完成、重构)。", "note_en": "Generate models and serializers from JSON, schema, and GraphQL for working with data quickly &amp; safely in any programming language.\n Generate Code Now\n {  : [ {  :  &#34;Atticus&#34;,  :  100 }, {  :  &#34;Cleo&#34;,  :  900 }, {  :  &#34;Orly&#34; }, {  :  &#34;Jasper&#34; } ]}\n class  MyData {  :  Person[];  static  ( :  string) {…}} class  Person {  :  string;  :  int?;}\n let  data =  MyData. ( &#39;{ &#34;people&#34;: [ { &#34;name&#34;: &#34;Olivia&#34; } ]}&#39;) for  person  in  data.  {  print( person. )  person. ++} highScore may be undefined\n Install quicktype from npm  Generate Go for a simple JSON sample $ echo &#39;[1, 2, 3.14]&#39; | quicktype --lang go  Generate C# for a Bitcoin API $ quicktype https://blockchain.info/latestblock -o LatestBlock.cs  Generate TypeScript and runtime checks for a weather API $ quicktype https://goo.gl/Dq2yKd -o Weather.ts --runtime-typecheck  Generate C# classes from TypeScript types  Generate Swift from a directory of samples  album.json artist.json track.json $ quicktype spotify-api-samples -o SpotifyClient.swift\n A good one is golden, however most are outdated or simply unavailable in your app’s programming language.\n  Takes a lot of effort and must be updated when the API changes. You should be focused on your app, anyway.\n  This is an unpleasant way to program and leaves your app vulnerable to API changes.\n Given sample API responses, quicktype will generate an easy-to-use client library in your app’s language.\n  quicktype can regenerate types when APIs change, so you can simply update affected app code, if any.\n  Get more out of your editor or IDE (autocomplete, refactoring) when working with typed API data.", "posttime": "2020-05-05 18:40:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,json,convert,生成,generate", "title": "QuickType-将JSON转换成任何语言的华丽、类型安全的代码", "title_en": "Quicktype - convert JSON into gorgeous, typesafe code in any language", "transed": 1, "url": "https://quicktype.io", "via": "", "real_tags": ["代码", "json", "convert", "生成", "generate"]}]