[{"category": "", "categoryclass": "", "imagename": "408fded67255ccd2bd11c6d2368471a4.jpg", "infoid": 1007656, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在上周拒绝更新后，苹果批准了订阅电子邮件应用程序嘿的新版。\n上周，在今天的苹果全球开发者大会(Apple Worldwide Developer Conference)召开之前，苹果批准了这一决定，旨在降低苹果最初拒绝应用程序的温度，此前苹果公司的应用程序遭到了立法者和其他开发者的广泛谴责。但这一批准在精神上也只是暂时的，意在让开发者Basecamp有时间开发一个更符合苹果政策的应用程序版本-Basecamp对这一挑战的态度非常积极，正如今天发布在其网站上的一封信中所述。\n随着美国和欧盟对App Store的监管审查力度加大，苹果通过批准嘿Now，肯定也是希望将焦点重新带回其价值5190亿美元的开发者生态系统的积极方面。\n新版本的嘿符合苹果规则的严格文字，但违背了他们的精神。\n但是大本营还没有结束战斗。苹果公司已经提交了一个新版本的“嘿”，它符合严格的苹果规则，但显然违背了他们的精神：该公司现在将向iOS用户提供一个免费的临时“嘿”电子邮件账户，地址是随机的，这样这款应用在第一次打开时就可以正常使用了。这些刻录机帐户将在14天后过期。嘿现在也可以与企业客户合作，因为苹果最初对这款应用的消费者导向提出了异议。\n嘿没有采用苹果自己的应用内支付系统，也没有允许用户通过iOS应用注册其全面的付费服务。取而代之的是，用户仍然需要通过直接进入嘿的网站进行订阅。\n这些变化是否会让苹果满意还有待观察，但Basecamp显然是在押注苹果将不得不允许这款应用的未来版本，因为它在发布时就做了一些事情。BasecCamp的CTO David Heinemeier Hansson告诉我：“我们会信守菲尔(席勒)的诺言。”“人们的主要抱怨是，‘你下载了这款应用，但它不能工作’，尽管很多应用都是这样工作的。”\n“我们已经看到了大卫的推文，并期待着在前进的道路上与你合作，”苹果的应用程序审查委员会上周给Basecamp写道。“此更新已获得批准。”\n嘿和苹果的背景非常复杂，但简单的版本是这样的：\n苹果应用商店的规则要求付费服务为用户提供使用苹果支付工具在应用中注册和支付的能力。这让开发商付出了30%的不可讨价还价的折扣。\n规则中对Netflix和Spotify等“阅读器”应用程序有一个有争议的划分，但不适用于电子邮件应用程序。\n苹果最初在iOS应用商店批准了嘿应用，但拒绝了错误修复更新，因为它认为嘿违反了规则，不提供应用内订阅。\n苹果告诉Protocol，“客户应用”被允许用于“商业服务”，但不允许用于“消费产品”，这一区别在规则中没有出现，苹果也没有向其他媒体宣传这一区别。\n这一拒绝发生在欧盟委员会宣布对App Store和Apple Pay进行反垄断调查的同一天。(真的。)。\nBasecamp首席技术官David Heinemeier Hansson说，他宁愿“自己烧毁这座房子”，也不愿向苹果支付30%的费用。(也是真的。)。\n海内梅尔·汉森(Heinemeier Hansson)和众议院反垄断委员会主席大卫·西西林(David Cicilline，D-RI)在Vergecast上讨论了这一情况。西西林领导着对App Store等数字市场的反垄断调查。西西林称苹果收取的30%费用是“不合情理的”和“高速公路抢劫”。(再说一遍：真的。)\n苹果营销主管菲尔·席勒(Phil Schiller)在接受TechCrunch采访时正式谈到了这一情况，他说：“他们可以做很多事情来让这款应用在我们现有的规则范围内运行。我们希望他们能做到这一点。“。\n重要的是，席勒还告诉TechCrunch：“你下载了这款应用程序，它就不起作用了，这不是我们想在商店里看到的。”\n苹果再次拒绝了嘿应用程序。它在Basecamp收到拒绝信之前就把它发给了媒体。(再说一次：真的。)。这封拒绝信指出，Basecamp的应用程序“在过去的八年里没有为App Store带来任何收入”，这句话在开发者社区就像一个铅气球一样传开了。\n据本·汤普森专栏报道，开发者非常害怕苹果。据Kara Swisher专栏报道，开发者非常害怕苹果。John Gruber专栏关于Kara Swisher专栏报道开发者害怕苹果。突然之间，每个人都知道了苹果，而App Store吓坏了开发者。\nBasecamp认为，通过最新的更新，它现在已经直接解决了苹果的两个问题-应用程序打开时不会做任何事情，以及消费者而不是企业的关注点。\n苹果方面表示，它一直在努力帮助开发者按照规则获得并保留应用程序，并坚称目标一直是以某种方式解决嘿的问题。该公司表示，它一直在努力帮助开发者按照规则获得并保留应用程序，并坚称其目标一直是以某种方式解决嘿问题。\n真正的问题是，苹果如何看待14天后到期的免费电子邮件应用。\nHeinemeier Hansson告诉我，Basecamp已经为“几个”企业客户提供了“嘿电子邮件”服务，现在它已经为其他客户加速了这项工作。但真正的问题是，苹果如何看待一款提供14天后到期的免费随机电子邮件地址的电子邮件应用。Basecamp说，它的目的是模仿“你旅行时购买的临时SIM卡”，或者允许用户在Craigslist上销售商品，而不需要提供真实的电子邮件地址。\n这看起来确实像是对一个在胁迫下创建的产品的用例改造，但如果这能让嘿团队专注于他们的应用程序，而不是App Store，他们会接受的。Heinemeier Hansson告诉我，已经有25000人收到了嘿邀请，目前还有10万多人在等待，Basecamp已经雇佣了5名临时员工来满足客户支持需求。\nHeinemeier Hansson说：“我们原本希望第一个月就有20000名用户。”“到下周末，我们很有可能会有20万人使用这项服务。这就是我想要关注的问题。“", "note_en": "After rejecting an update last week, Apple has approved a new version of the subscription email app Hey.\n The approval, which came last week, ahead of today’s Apple Worldwide Developer Conference, is meant to lower the temperature after Apple’s initial app rejection drew widespread condemnation from lawmakers and other developers. But the approval is also only temporary in spirit, meant to give Hey developer Basecamp time to develop a version of the app more in line with Apple’s policies — and Basecamp’s approach to that challenge is very aggressive, as  a letter posted to its website today details.\n By approving Hey right now, Apple is also surely hoping to bring the focus back to the positive aspects of its  $519 billion developer ecosystem as regulatory scrutiny of the App Store increases in the United States and European Union.\n The new version of Hey meets the strict letter of Apple’s rules but defies their spirit\n But Basecamp isn’t done with the fight. The company has submitted a new version of Hey that meets the strict letter of Apple’s rules but clearly defies their spirit: the company will now offer iOS users a free temporary Hey email account with a randomized address, just so the app is functional when it is first opened. These burner accounts will expire after 14 days. Hey is also now able to work with enterprise customers, as Apple initially took issue with the app’s consumer focus.\n Hey has not adopted Apple’s own in-app payment system or allowed users to sign up for its full, paid service through the iOS app. Instead, users will still need to subscribe by going directly to Hey’s website.\n It remains to be seen whether these changes will thread the needle to Apple’s satisfaction, but Basecamp is clearly betting that Apple will have to allow future versions of the app now that it does  something on launch. “We’re going to take Phil [Schiller] on his word here,” Basecamp CTO David Heinemeier Hansson tells me. “The chief complaint was that ‘you download the app and it doesn’t work,’ even though  lots of apps work like that.”\n “We’ve  seen David’s tweets and look forward to working with you on a path forward,” Apple’s App Review Board wrote to Basecamp last week. “This update has been approved.”\n The backstory of Hey and Apple is extremely complicated, but the simple version is this:\n Apple’s App Store rules require paid services to offer users the ability to sign up and pay in the app using Apple’s payment tools. That costs developers a nonnegotiable 30 percent cut.\n There is a  controversial carveout in the rules for “reader” apps like Netflix and Spotify but not email apps.\n Apple initially approved the Hey app in the iOS App Store but rejected a bug-fix update because it decided Hey violated the rules by not offering in-app subscriptions.\n Apple told   Protocol that “client apps” are allowed for “business services” but not “consumer products,” a distinction that  appears nowhere in the rules and which Apple did not push with other media outlets.\n This rejection happened on the same day the European Commission announced an  antitrust investigation into the App Store and Apple Pay. (Really.)\n Basecamp CTO David Heinemeier Hansson said he would rather “ burn this house down myself” than pay the 30 percent fee to Apple. (Also really.)\n Heinemeier Hansson and House Antitrust Committee chairman Rep. David Cicilline (D-RI), who is leading an antitrust investigation into digital marketplaces like the App Store, appeared on  The Vergecast to discuss the situation. Cicilline called Apple’s 30 percent fee  “unconscionable” and “highway robbery.” (Again: really.)\n Apple marketing chief  Phil Schiller spoke to  TechCrunch on the record about the situation and said, “There are many things that they could do to make the app work within the rules that we have. We would love for them to do that.”\n Importantly, Schiller also told  TechCrunch: “You download the app and it doesn’t work, that’s not what we want on the store.”\n Apple  rejected the Hey app again. It sent the rejection letter to the press  before Basecamp received it. (Once again: really.) The rejection letter noted that Basecamp’s apps had “have not contributed any revenue to the App Store over the last eight years,” a line that went over in the developer community  like a lead balloon.\n Ben Thompson column reports developers are terrified of Apple.  Kara Swisher column reports developers are terrified of Apple.  John Gruber column about Kara Swisher column reports developers are terrified of Apple. Suddenly, everyone knows Apple and the App Store terrifies developers.\n  Basecamp thinks it has now directly addressed Apple’s two concerns — the app not doing anything when opened, and a consumer rather than enterprise focus — with this latest update.\n For its part, Apple says that it has always tried to help developers get and keep apps in the store in compliance with the rules, and maintains that the goal was always to solve the Hey issue somehow.\n The real question is how Apple views a free email app that expires after 14 days\n Heinemeier Hansson tells me that Basecamp has already onboarded a “couple” of enterprise customers for Hey email and that it’s accelerated that work for other customers now. But the real question is how Apple views an email app that offers free, randomized email addresses that expire after 14 days. Basecamp says it’s meant to mimic “a temporary SIM card you buy when traveling” or allow users to sell things on Craigslist without giving out a real email address.\n That certainly seems like a retrofitting of use cases to a product created under duress, but if that allows the Hey team to focus on their app instead of the App Store, they’ll take it. Heinemeier Hansson tells me 25,000 people have already gotten Hey invites, there’s currently a waitlist of 100,000 more, and that Basecamp has hired five temporary staffers to meet the customer support demand.\n “We’d hoped for 20,000 users in the first month,” Heinemeier Hansson says. “There’s a good chance by the end of next week, we’ll have 200,000 people on the service. That’s what I would like to focus on.”", "posttime": "2020-06-22 23:52:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,批准,approves", "title": "苹果批准嘿电子邮件应用，但斗争还没有结束", "title_en": "Apple approves Hey email app, but the fight’s not over", "transed": 1, "url": "https://www.theverge.com/2020/6/22/21298552/apple-hey-email-app-approval-rules-basecamp-launch", "via": "", "real_tags": ["苹果", "apple", "批准", "approves"]}, {"category": "", "categoryclass": "", "imagename": "ffcd1078994fd5cb31c66e1c73e8c998.jpg", "infoid": 1007654, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于广场恐惧症和焦虑，雅基·肯尼的身体冒险活动受到了限制，但在伦敦的家中，雅基·肯尼已经看到了世界。自2016年以来，她一直在美国西南部天蓝色的天空下漫步，在墨西哥普埃布拉的锥形树木投射的阴影中漫步。她曾在蒙古狂风肆虐的大片土地上看望过马，在吉尔吉斯斯坦的一条积雪覆盖的道路上漫步。她通过谷歌街景做到了这一点，并收集了大约4万张她旅行的快照。\n在她网络漫游的巅峰时期，肯尼每天花18个小时在她的漫游上。她说：“我感觉自己就像是刚跳进这个世界，几年后就出来了。”“我正在经历我生命中的一段时间，我只需要进入另一个世界。”最近，她的漫游减少了，因为她的广场恐惧症有所减轻，但她仍然在她的Instagram上发布数字旅行的快照，她的Instagram是她的广场恐惧症旅行者。\n阿特拉斯·奥布斯库拉(Atlas Obscura)与肯尼谈论了偶然的景象，迷人的风景，以及在隔壁和地球周围寻找奇迹。\n大约25年前，我开始患上恐慌症。随着时间的推移，他们变得越来越糟糕。我开始担心我可能会得恐慌症，特别是在飞机上。我害怕被困住，不能找到出口回家。我发现离家越远，生活就越艰难。当你在3万英尺高空的飞机上，你不可能那么容易跳出飞机回家。然后，(恐慌)越来越频繁地出现，而不是像在飞机上飞行-在火车上，在公交车上-这样的大事。这也不仅仅是交通问题：(我惊慌失措地)在我感到有点迷失的地方，或者如果我不知道如何才能回到家。我可能只是走在几条街道上，有点迷失方向，然后开始惊慌失措。\n我开始注意到我的世界在不断缩小。然后是像开会这样的事情-我不能去开会，因为我觉得我会惊慌失措。我开始管理我的生活，所以我哪儿也不用去。我意识到我需要一些帮助，因为你知道，情况正在逐渐恶化。\n起初，它无处不在，无处不在。我从巴西开始，因为我一直在看一些街头艺术；我忘了是谁画的。我开始环顾四周，决定再走远一点。就在那时，我开始看到，“哦，天哪，这太不可思议了。”巴西很美--那里的颜色、有利位置、街景如何让每个人看起来都很小，就像他们在舞台上一样。这是超现实的。\n我开始四处旅行，看看其他地方，对很多事情感到兴奋。\n然后我意识到这是一种我真的很喜欢的样子。我发现很多都在赤道附近或任何极端温度的地方，特别是沙漠。我意识到我喜欢空间感和孤立感，所以我会离开城市，到小城镇去。\n对于患有广场恐惧症的人来说，这些地方是很难想象身临其境的。你离家那么远，沙漠本身就是我觉得相当可怕的东西-也很吸引人，但也很可怕，因为离开沙漠…的想法。关于广袤的沙漠，有一些东西是相当可怕的。我可能是被我很害怕去的地方所吸引，但我也很喜欢。\n在城市里，真的很难得到一个好的构图，因为总有一些东西挡住了去路。你不能移动任何东西；你不能要求别人做不同的姿势。这是我开始进军城镇的另一个原因，这样我就可以拍到我喜欢的照片。出于实际目的，但是-我真的，真的，真的很投入。“痴迷”可能是个更好的词。\n你可以在任何地方跳伞。你可以身处世界的一端，两秒钟后就到了另一端，而不必担心飞行、边界等问题。\n这与你通常的旅行方式相反。你没有任何行程，你没有计划的假期。你不知道你要去哪里，你也不知道你要降落在哪里。所以，很多时候我会跳进去，然后说，“哦，我的天哪，我在哪里？”然后再对这个地方做些调查。突然间，你对一个你以前一无所知的地方有了一些了解。这有点动摇了你对旅行的想法。尽管这是一个奇怪的、平行的宇宙，但我只是喜欢所有的联系，以及那种“我们都在一起”的感觉。\n由于新冠肺炎的缘故，你有什么建议给那些感觉有旅游欲，但这些天大多呆在家里的人呢？\n我想，每个人现在都会重新审视他们是如何旅行的。在过去的几年里，我发现享受你当地的生活是多么美好。你会惊讶于那些你甚至不知道存在的东西。你不必总想着一定要去度假才能找回自我。\n你是否最终亲自去了你在网上参观过的任何一个地方？\n不是的。我希望如此，但我不确定这是否会发生。尽管我感觉好多了，但那些地方仍然相当偏远和遥远。我要去那些地方要花很多钱。\n除了风景，旅行的一些乐趣还包括气味和声音。你有没有试过在家里重现这些？\n我没那么做过。这一切都在我的脑海里。我会想象一些场景，那么多的小电影。我甚至不记得它和现实世界有什么联系。\n显然，这与身体旅行是如此不同的体验，因为当你正常旅行时，你会使用更多的感官。但我的问题是，因为我太焦虑旅行了，而且已经有很长一段时间了，我从来没有享受过旅行过程中的任何一部分。因此，即使这只是视觉上的，在我的想象中，对我来说-暂时-这是很有意义的。", "note_en": "Her physical adventures have been curtailed by agoraphobia and anxiety, but from her home in London, Jacqui Kenny has seen the world. Since 2016, she has wandered beneath cerulean skies in the American Southwest and among the shadows cast by tapered trees in Puebla, Mexico. She has visited horses on windswept expanses in Mongolia and ambled along a snow-flanked road in Kyrgyzstan. She has done it all through Google Street View, and collected some 40,000 snapshots of her travels.\n At the peak of her web-based wanderlust, Kenny devoted up to 18 hours a day to her wanderings. “I kind of felt like I just jumped into this world, and then came out a couple of years later,” she says. “I was going through a time in my life where I just needed to go into another world.” Her roaming has decreased recently, as her agoraphobia has abated a bit, but she still posts snapshots from her digital travels on her Instagram,  the Agoraphobic Traveller.\n Atlas Obscura talked to Kenny about serendipitous sights, captivating landscapes, and finding wonder next door and around the planet.\n   I started having panic attacks about 25 years ago. Over time, they got progressively worse. I started fearing places that I might get a panic attack, especially flying on planes. I feared being trapped and not being able to get to an exit and go home. I found that the farther away I was from home, the harder it became. When you’re on a plane, 30,000 feet up in the air, there’s no way you can jump out and go home that easily. Then [the panic] came more and more often, and not [from] such big things like flying on a plane—on the train, on a bus. It wasn’t just transportation, either: [I panicked] anywhere I felt a little bit lost, or if I didn’t know exactly how I could get back home again. I could just be walking down a few streets and get a bit disoriented and then start panicking.\n I started noticing that my world was shrinking and shrinking and shrinking. Then it would be things like meetings—I couldn’t go to meetings because I thought that I would have a panic attack. I started managing my life so I didn’t have to go anywhere. I realized that I needed to get some help because you know, it was just progressively getting worse.\n   At first, it was anywhere and everywhere. I started in Brazil, because I’d been looking at some street art; I forget who did it. I started looking around and decided to go a little bit further. And that’s when I started seeing, “Oh, my god, this is incredible.” Brazil is beautiful—the colors, the vantage point, how Street View makes everybody look miniature, like they’re on a stage. It’s surreal.\n I started traveling around and looking at other places and getting excited about lots of things.\n Then I realized that it was a certain look that I really liked. I found a lot of that was around the equator or anywhere with extreme temperatures, especially the desert. I realized that I liked a sense of space and isolation, so I would leave the city and go into small towns.\n  These are places that, for someone with agoraphobia, it’s hard to imagine being there physically. You’re so far away from home, and the desert itself is something that I find quite frightening—fascinating as well, but frightening, because the idea of exiting the desert … There’s something about the vastness of the desert that’s quite scary. I was probably attracted to places I would be quite fearful going to, but also loved.\n In cities, it’s really hard to get a good composition because there’s always something in the way. You can’t move anything; you can’t ask somebody to do a different pose. That’s another reason why I started reaching out into towns, so I could get the shots that I liked. For practical purposes, but—I just got really, really, really into it. Obsessed is probably a better word.\n   You can just parachute anywhere. You can be on one side of the world and then two seconds later be on the other side, and never have to worry about flying, borders, any of that.\n It’s the opposite of how you normally travel. You don’t have any itinerary, you don’t have a planned holiday. You don’t know exactly where you’re going, you don’t know exactly where you’re going to land. So, many times I would jump in and go, “Oh my goodness, where am I?” and then do some research on the place. Then suddenly you know something about a place that you didn’t know anything about before. It kind of shakes up your idea of travel. Even though it’s kind of this strange, parallel universe, I just loved all the connections, and that sense of, “We’re all in it together.”\n  What advice would you have to people who feel a sense of wanderlust but are mostly at home these days, due to COVID-19?\n Everybody’s going to revisit how they travel now, I think. Over the last few years, I’ve discovered how great it can be to enjoy your local area. You’d be amazed at what you don’t even know exists. You don’t have to always be thinking you have to go on a holiday to find yourself.\n Have you wound up going in person to any of the places that you have visited online?\n No. I hope to, but I’m not sure if it’s going to happen. Even though I’m feeling better, those places are still quite remote and far away. It would take quite a lot for me to go to those places.\n  Beyond the sights, some of the joys of travel include the smells and  the sounds. Do you ever try to recreate those at home?\n I haven’t done that. It was just all in my head. I would imagine scenes, so many little films. I can’t even really remember it being connected to the real world.\n Obviously it’s such a different experience from traveling physically, because you use a lot more senses when you’re traveling normally. But the thing with me is that, because I’m so anxious traveling and have been for a really, really, really long time, I was never able to enjoy any part of the process of traveling. So even if it’s just visual, in my imagination, to me—for the time being—that makes a lot of sense.", "posttime": "2020-06-22 23:29:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "恐惧症,traveler,旅行", "title": "一个有广场恐惧症的旅行者在地球上游荡", "title_en": "An Agoraphobic Traveler Wanders the Earth", "transed": 1, "url": "https://www.atlasobscura.com/articles/agoraphobic-travel", "via": "", "real_tags": ["恐惧症", "traveler", "旅行"]}, {"category": "", "categoryclass": "", "imagename": "30dc72b7c995e7d05ca3eb936294d366.jpg", "infoid": 1007653, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几千年来，乌鸦可以识别人类的面孔(和其他身体属性)，这是我们与它们相处的主要体验。这是让他们在我们的文化中占据如此显赫地位的一部分，也是让我们不断地往口袋里装满花生或杂物的原因，我们渴望有机会被认出来，被野生动物看到。如果你像我一样一直致力于这样的关系，你可能会发现自己一直在想他们在说什么。虽然我们的问题还是比答案多，但这并不是因为没有尝试；事实上，解析乌鸦“语言”仍然是Corvidology的热门话题。如果不是我们所有的努力去理解乌鸦经常在说什么，你有没有想过它们是如何理解我们所说的话的？\n询问任何喂食乌鸦的人关于他们的仪式，很有可能开始时不仅仅是让自己看得见。为了引起“它们的”鸟的注意，大约一半的乌鸦喂食者从某种听觉提示开始，比如吹口哨或轻柔地叫名字。²鉴于美国乌鸦(Corvus Brachyrinchos)可以通过它们的叫声单独区分，而且许多乌鸦-包括大嘴乌鸦(Corvus Macrorhynchos)-可以识别熟悉的同种*叫声，所以这种策略似乎一点也不迷信。2，3事实上，以前的研究已经证明乌鸦可以辨别人类的声音。\n当看到看门人或不熟悉的说话者说“嘿”的回放时，手工饲养的腐肉乌鸦(Corvus Corone)对不熟悉的说话者表现出明显更大的反应。他们的反应是不同的，这表明他们可以区别对待，但他们似乎更感兴趣的是他们不认识的人，这一事实很难不引起他们的注意。难道他们不应该对那些通常带着礼物来的人更感兴趣吗？虽然我们对这个问题仍然没有一个非常令人满意的答案，但这可能来自这样一个事实，即新人比可以安全地忽视的熟悉的看门人更难预测，因此更具威胁性。同样，一项新的研究表明，不只是个别人乌鸦可以听出不同语言之间的差异，而是整个语言之间的差异。\n在Schalz和Izawa(2020)最新发布的一项研究中，在日本各地的主要城市捕获了8只野生大嘴乌鸦，随后将它们饲养在庆应义塾大学的鸟类养殖场，由讲流利日语的人照顾它们。5.考虑到它们的生活史和它们在鸟舍的时间，可以有把握地认为这些鸟一生中都听了大量的日本人的话。因此，顺理成章的是，它们也许能够真正认识到这种语言是熟悉的，但到目前为止，还没有人研究乌鸦区分语言的能力。为了测试这个问题，研究人员使用回放来呈现说荷兰语或日语的录音。就像腐烂乌鸦的研究一样，当向这些乌鸦播放更熟悉的声学风格-在这种情况下是说日语的人-它们没有表现出强烈的反应。给他们演奏一种很可能是完全陌生的语言-荷兰语-乌鸦们就全神贯注了。或者至少他们表现得更加警觉，把自己放在离演讲者更近的地方。换句话说，大嘴乌鸦无需任何训练就能辨别人类的语言！\n下一个最明显的问题是，嗯，为什么？在不熟悉的人中区分不同的语言有什么作用呢？一种可能性是，这只是它们成功成为乌鸦所需的听觉感知技能的产物。正如我之前提到的，他们的电话中编码了很多信息，包括个人身份，所以专注于节奏课可能很重要。然而，另一个值得追求的原因是，这可能有助于向游客透露信息，他们可能比当地人更倾向于分享或更容易利用。*幸运的是，这项研究的主要作者Sabrina Schalz将在即将到来的秋天开始她在这个主题上的博士学位。你可以在推特上找到她，地址是@Sabrinaschalz，她承诺会让我们了解她未来的发现。\n因此，下次你在日本闲逛的时候，别忘了在当地乌鸦周围注意你的语言。为了安全起见，我也不会向他们泄露任何秘密。它们被称为大嘴乌鸦不是无缘无故的。\n引用文献1.Marzluff JM和Amp；Miller M.(2014)。乌鸦和乌鸦喂食者：种间符号学的观察。收录于：Witzany，G.ed.，动物的生物通讯。纽约：Springer Science+Business Media Dordrecht。第191-211页。\n3.Kondo N，Izawa Ei，&amp；Watanabe S.(2010)。丛林乌鸦(Corvus Macrorhynchos)声音和个体识别的知觉机制：联系电话签名和辨别。行为147：1051-1072。\n4.洗衣机咖啡馆，Szipka G，Boeckle M，和Wilkinson A.2012。你听起来很熟悉：腐肉乌鸦能区分已知和未知的异种叫声。阿尼姆·科恩15：1015-1019。\n5.Schalz S.&Amp；Izawa E.(2020)。大嘴乌鸦的语言歧视。在Ravignani，A.，Barbieri，C.，Martins，M.，Flaherty，M.，Jadul，Y.，Ltenkamp，E.，Little，H.，Mudd，K.&amp；Verhoef，T.。(编著)：语言的演变：第十三届国际会议论文集(EvoLang13)。10.17617/2.3190925。", "note_en": "That crows can recognize humans faces (and other physical attributes) has been a staple of our experiences with them for thousands of years.  It’s part of what has allowed them to take such a prominent place within our cultures, and it’s what keeps us refilling our pockets with peanuts or kibble, anxious for the chance to be recognized, to be  seen by a wild animal. If, like me, you’ve been committed to such a relationship, you probably found yourself wondering about what it is they’re saying all the time. Although we still have more questions than answers, it’s not for  lack of trying; in fact parsing crow “language” is still a hot topic in corvidology.  But for all our efforts to understand what crows are so often going on about, have you ever thought much about what they make of what  we’re saying?\n  Ask any crow feeder about their ritual and there’s a good chance that it starts with more than just making themselves visible. To get “their” bird’s attention, about half of crow feeders start with some kind of auditory cue, like a whistle or gentle name calling.¹ Given that American crows ( Corvus brachyrhynchos) can be individually distinguished by their calls, and many corvids—including the large-billed crows ( Corvus macrorhynchos)—can recognize familiar conspecific* calls, this strategy seems far from superstitious. 2,3 In fact, previous work has demonstrated that crows can discriminate human voices.\n When presented with playback of their caretakers or unfamiliar speakers saying, “hey,”  hand-reared carrions crows ( Corvus corone) showed significantly more responsiveness towards unfamiliar speakers. 4 That their response is different is what suggests that they can discriminate, but it’s hard to not do a double take at the fact that the thing they seem more interested in is the person they  don’t know.  Shouldn’t they be more interested in the folks that generally come bearing gifts? While we still don’t have a super satisfying answer to this question, it’s possible this comes from the fact that novel humans are less predictable, and therefore more threatening, than a familiar caretaker who can be safely ignored. Likewise, a new study out suggests that it’s not just individual people crows can hear the difference between, but entire languages.\n In a newly released study conducted by  Schalz and Izawa (2020), eight wild  large-billed crows were captured in major cities around Japan and subsequently housed in aviaries at Keio University where they were cared for by fluent Japanese speakers. 5  Given both their life histories and their time in the aviary, it’s safe to assume these birds had listened to a tremendous amount of Japanese throughout their lives. So, it stands to reason they might be able to actually recognize this language as familiar, but to date no one had looked at crows’ ability to discriminate between languages.  To test this question the researchers used playback to present recordings of either Dutch or Japanese speakers.  As with the carrion crow study, when these crows were presented with playback of a more familiar acoustic style—in this case a Japanese speaker—they didn’t show a strong reaction. Play them what was likely a completely unfamiliar language—Dutch—and the crows were rapt. Or at least they acted more vigilant and positioned themselves closer to the speaker. In other words, large-billed crows were able to discriminate between human languages without any prior training!\n  The next most obvious question is, well, why? What purpose would it serve to discriminate between different languages among unfamiliar speakers? One possibility is that it’s just an artifact of the auditory perceptual skills they need to successfully be a crow.  As I mentioned earlier, there’s a lot of information encoded in their calls, including individual identity, so being attentive to rhythmic classes may be important.  Another reason that’s worth pursuing, though, is that it may help tip them off to tourists, who may be more inclined to share or easier to take advantage of, than locals.  Fortunately the lead author on this study, Sabrina Schalz, will be starting her PhD on this topic in the coming fall. You can find her on twitter at @Sabrinaschalz, where she’s promised to keep us abreast of her future discoveries.\n So the next time you’re hanging out in Japan, don’t forget to literally watch your language around the local crows. And to be safe, I wouldn’t divulge any secrets to them either.  They’re not called large-billed crows for nothing.\n  Literature cited 1. Marzluff JM, &amp; Miller M. (2014). Crows and crow feeders: Observations on interspecific semiotics.  In: Witzany, G. ed., Biocommunication of Animals.  New York: Springer Science+Business Media Dordrecht. pp 191-211.\n  3. Kondo N, Izawa EI, &amp; Watanabe S. (2010). Perceptual mechanism for vocal  individual recognition in jungle crows ( Corvus macrorhynchos ): contact call signature and discrimination.  Behaviour 147: 1051–1072.\n 4. Washer CAF, Szipka G, Boeckle M, and Wilkinson A. 2012. You sounds familiar: carrion crows differentiate between the calls of known and unknown heterospecifics.  Anim Cogn 15: 1015-1019.\n 5. Schalz S. &amp; Izawa E. (2020). Language Discrimination by Large-Billed Crows. In Ravignani, A., Barbieri, C., Martins, M., Flaherty, M., Jadoul, Y., Lattenkamp, E., Little, H., Mudd, K. &amp; Verhoef, T. (Eds.): The Evolution of Language: Proceedings of the 13th International Conference (EvoLang13). doi:10.17617/2.3190925.", "posttime": "2020-06-22 23:23:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "字面,watching,乌鸦", "title": "乌鸦在看你的语言，字面意思", "title_en": "Crows are watching your language, literally", "transed": 1, "url": "https://corvidresearch.blog/2020/06/21/the-crows-are-watching-your-language-literally/", "via": "", "real_tags": ["字面", "watching", "乌鸦"]}, {"category": "", "categoryclass": "", "imagename": "eba90020e764d031f80ccd4a1c317709.jpg", "infoid": 1007652, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "3月中旬，当洛杉矶县自然历史博物馆(Natural History Museum)因流感大流行而关闭时，丽莎·冈萨雷斯(Lisa Gonzalez)怀着几周后回来的期望回家。但是，一旦确定她不会很快回来，博物馆的昆虫学收集助理经理冈萨雷斯就把她家的工艺室改造成了一个临时实验室。然后，她开始筛选博物馆之前通过一个公民科学项目收集的数千只昆虫。\n通常，冈萨雷斯和其他生物学家会使用DNA条形码来识别不同的物种。这是一个多步骤的过程，需要几个小时的化学准备，并能产生准确的结果。博物馆的DNA测序仪使用一种名为聚合酶链式反应的方法来放大每种昆虫的遗传物质，然后将其与现有DNA条形码的参照物进行比较。\n随着这个装置回到博物馆，冈萨雷斯转向了自17世纪以来一直为生物学家服务的模拟仪器：显微镜。冈萨雷斯说：“这绝对让我欣赏过去的科学家能够用最基本的工具完成的工作。”“我家里没有符合人体工程学的椅子；我没有花哨的显微镜。我们都对我们认为理所当然的事情表示赞赏。“。\n冈萨雷斯仅用自己的显微镜，通过观察细小的毛发或苍蝇翅膀的形状等特征，识别了数十种昆虫。她还发现了一些不同寻常的昆虫，并将它们交给了她的同事、博物馆昆虫学馆长布莱恩·布朗(Brian Brown)。使用他从办公室拖来的较大的徕卡立体显微镜，以及他在Craigslist上找到的较小的复合显微镜，布朗发现了9种小苍蝇，这些都是科学上新发现的。“发现新事物总是很酷的，这是这份工作最大的乐趣之一，”布朗说。“这不仅仅是发现略有不同的新事物--我们一直都在发现非常不同的东西。”\n这些昆虫主要是小苍蝇、黄蜂和类似黄蜂的苍蝇，是通过BioSCAN项目收集的，该项目始于2012年，在洛杉矶各地的30个地点设置了捕虫器，主要是在后院或公共场所。这对夫妇招募了志愿者，然后他们接受了如何使用“恶心陷阱”的培训，这种陷阱类似于两个人的小狗帐篷，迫使虫子向上飞到收集网中，然后志愿者才能把它们放进瓶子里。\n尽管洛杉矶是来自世界各地的文化混杂之地，但对其城市野生动物，特别是将广阔盆地称为家的昆虫的研究很少。生物扫描项目始于布朗与一名博物馆托管人打赌，称他可以在她位于洛杉矶西部的后院发现一种新的昆虫。他做到了，项目开始了。在最初的三年里，布朗和后院收藏家发现了30种新的昆虫，并发表了他们的结果。博物馆团队在过去两年中又发现了13个新物种，加上他和工作人员自大流行关闭以来又发现了9个新物种。\n尽管生物扫描参与者自去年11月以来没有收集到任何新的昆虫，但在新冠肺炎关闭期间，鉴定数以千计的个体标本的艰苦工作仍在继续。这在科学上等同于清理你的衣柜：单调乏味，但最终是有回报的。\n布朗说：“我们现在不能进入实验室，所以我们又回到了用显微镜识别东西和寻找难以看到的特征上来。”“这些费时费力的工作，面对的都是时间充裕的人。这些昆虫有2毫米长，生殖器很小。用形态学鉴定其中一个样本可能需要10分钟或20分钟。“\n这九个新物种包括幻蝇，其中一些以能够跑过表面和/或进入棺材吃掉身体而闻名。布朗和冈萨雷斯还发现了以前在南加州从未见过的肉蝇、老鼠寄生虫和黄蜂状苍蝇。他们很可能是从中美洲来的，可能搭上了开花的植物或食物的便车。\n在通过BioSCAN项目收集的数万只昆虫的帮助下，多年来，布朗和冈萨雷斯已经将洛杉矶盆地已知的昆虫种类从1993年上次人口普查时的3500种扩大到今天的2万种左右。“我们已经观察了来自洛杉矶地区的10万个样本，”布朗说。“我对我们不断遇到的新物种的数量感到惊讶。”在自家后院的捕虫器里，布朗发现了几种奇怪的昆虫，包括一种被烟雾吸引的苍蝇(很可能来自附近的野火)和另一种喜欢夜间盛开的茉莉花香味的苍蝇。\n冈萨雷斯说，关闭和随后的家庭工作也让人们关注城市社区存在的生态生物多样性。“我们确实有令人难以置信的多样性和新物种生活在我们的眼皮底下，”她说。“这是大多数人没有意识到的。即使是我们惊讶地看到的昆虫，我也不知道洛杉矶有螳螂苍蝇。“。(螳螂苍蝇看起来有点像螳螂和黄蜂的杂交后代，尽管它们实际上两者都不是，而且更常见于热带栖息地。)。\n冈萨雷斯在她5岁的侄子的帮助下继续在家工作，他自己提供了显微镜。她希望将她的昆虫计数实验室归还给她的缝纫空间，在那里她为恐怖和科幻角色扮演活动制作服装，而她和她的伴侣错过了这些活动。\n布朗也已经厌倦了在家工作的世界。重返博物馆藏品和他的实验室的现代科学仪器是不可能很快发生的。布朗说：“当你第一次开始在家工作的时候，你会想，‘这太棒了，因为没有分心的事情，而且我可以迅速写出一打论文。’”“但是，有一个工作的地方能让你集中精力和注意力，这真是令人惊讶。重要的是要有人与之互动和合作，并以昆虫收藏为参考。“。\n👁大脑是人工智能的有用模型吗？另外：获取最新的人工智能新闻。\n🏃🏽‍♀️想要最好的健康工具吗？看看我们Gear团队挑选的最好的健身跟踪器、跑步装备(包括鞋子和袜子)和最好的耳机", "note_en": "When the Natural History Museum of Los Angeles County shut down due to the pandemic in mid-March, Lisa Gonzalez headed home with the expectation that she would be back in a few weeks. But once it became clear that she wouldn’t get back anytime soon, Gonzalez, the museum’s assistant entomology collection manager, converted her home’s craft room into a makeshift lab. Then she began sifting through thousands of insects the museum had previously collected via a citizen science project.\n Normally, Gonzalez and other biologists would use DNA bar-coding to identify different species. It’s a multistep process that takes a few hours of chemical preparation and gives spot-on results. The museum’s DNA sequencer uses a method called polymerase chain reaction to amplify the genetic material from each insect, which then can be compared to a reference of existing DNA barcodes.\n With that device back at the museum, Gonzalez switched to the analog instrument that has served biologists since the 17th century: a microscope. “It definitely makes me appreciate what scientists of the past were able to accomplish with rudimentary tools,” Gonzalez says. “I don’t have an ergonomic chair at home; I don’t have a fancy microscope. We are all feeling appreciation for things we take for granted.”\n  Using just her own microscope, Gonzalez identified dozens of insect species by looking at features like tiny hairs or the shape of a fly’s wings. She also found some unusual insects that she turned over to her colleague, Brian Brown, the museum’s curator of entomology. Using a larger Leica stereoscope that he hauled in from the office, as well as a smaller compound microscope he found on craigslist, Brown discovered nine species of small flies, all new to science. “It’s always cool to find new things, and it is one of the great joys of this job,” says Brown. “It&#39;s not just finding slightly different new things—we find extravagantly different things all the time.”\n   The insects, mostly small flies, wasps, and wasplike flies, had been collected through the  BioSCAN project, which began in 2012 with insect traps set at 30 sites throughout Los Angeles, mostly in backyards or public spaces. The pair recruited volunteers who were then trained in how to use the “Malaise traps,” which resemble two-person pup tents that force bugs to fly upward into collecting nets before the volunteers can put them into vials.\n  Even though Los Angeles is a jumble of cultures from around the world, very little research has been done into its urban wildlife, especially the insects that call the broad basin home. The BioSCAN project started when Brown bet a museum trustee that he could find a new species of insect in her backyard in West LA. He did, and the project took off. In its first three years, Brown and the backyard collector discovered 30 new species of insects and  published their results. The museum team found an additional  13 new species in the past two years, plus he and the staff have discovered nine more since the pandemic shutdown.\n  Although BioSCAN participants haven’t collected any new insects since November, the painstaking work of identifying thousands of individual specimens has continued during the Covid-19 shutdown. It’s the scientific equivalent of cleaning out your closets: tedious but ultimately rewarding.\n “We can’t go into the lab right now, so we are back to identifying things with microscopes and looking for characteristics that are difficult to see,” Brown says. “These time-consuming tasks are confronted with people who have a lot of time. The insects are 2 millimeters long, with minute genitalia. Identifying one of those specimens using morphology can take 10 minutes or 20 minutes.”\n The nine new species include phorid flies, some of which are known for their ability to run across surfaces and or enter coffins to  consume dead bodies. Brown and Gonzalez have also found botflies, parasites of rats and wasplike flies that have never been seen before in Southern California. They likely arrived from Central America, perhaps hitching a ride on a flowering plant or piece of food.\n WIth the help of tens of thousands of insects collected through the BioSCAN project, over the years Brown and Gonzalez have expanded the count of known insect species in the Los Angeles basin from 3,500 during the last census in 1993 to around 20,000 today. “We have looked at 100,000 specimens from the LA area,” Brown says. “I’m surprised at the magnitude of new species we keep running into.” In his own backyard insect trap, Brown has found several weird ones, including one kind of fly that is attracted to smoke (likely sourced from nearby wildfires) and another that likes the scent of night-blooming jasmine.\n Gonzalez says the shutdown and subsequent work at home has also put a spotlight on the ecological biodiversity that exists in urban neighborhoods. “We do have incredible diversity and new species living under our noses,” she says. “That’s something most people don’t realize. Even insects we were surprised to see—I had no idea we have mantis flies in LA.” ( Mantis flies look sort of like a cross between a praying mantis and a wasp, although they are actually neither and are more commonly found in tropical habitats.)\n Gonzalez continues to work from home with some help from her 5-year-old nephew, who has provided his own microscope. She’s hoping to return her insect-counting lab to being her sewing space, where she crafts costumes for horror and sci-fi cosplay events that she and her partner miss attending.\n Brown, too, has grown weary of the work-from-home world. Returning to the museum collection and his lab’s modern scientific instruments can’t happen soon enough. “When you first start this work-at-home thing, you think, ‘This is great because there are no distractions, and I can whip out a dozen papers,’” Brown says. “But it’s amazing how having a place to go to work focuses your efforts and attention. It’s important to have people to interact with and work with, and to have the insect collection as a reference.”\n   👁 Is the brain a  useful model for AI? Plus:  Get the latest AI news\n 🏃🏽‍♀️ Want the best tools to get healthy? Check out our Gear team’s picks for the  best fitness trackers,  running gear (including  shoes and  socks), and  best headphones", "posttime": "2020-06-22 23:22:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,home,昆虫", "title": "困在家里，科学家发现9种新昆虫", "title_en": "Stuck at Home, Scientists Discover 9 New Insect Species", "transed": 1, "url": "https://www.wired.com/story/stuck-at-home-scientists-discover-9-new-insect-species/", "via": "", "real_tags": ["科学家", "home", "昆虫"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007651, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我见过很多人对更新他们网站的DNS记录来更改IP地址感到困惑。为什么会慢呢？你真的要等2天才能更新所有东西吗？为什么有些人看到新IP，有些人看到旧IP？发生什么事了呢？\n所以我想写一篇关于当您更新DNS记录时幕后发生的事情的快速探索。\n首先，我们需要稍微解释一下DNS。DNS服务器有两种：权威性和递归性。\n权威DNS服务器(也称为名称服务器)有一个数据库，其中包含它们负责的每个域的IP地址。例如，现在github.com的权威DNS服务器是ns-421.awsdns-52.com。您可以这样向它索要github.com的IP；\n递归DNS服务器本身并不知道谁拥有什么IP地址。他们通过询问正确的权威DNS服务器来找出域的IP地址，然后缓存该IP地址，以防再次被询问。8.8.8.8是递归DNS服务器。\n当人们访问您的网站时，他们可能正在向递归DNS服务器进行DNS查询。那么，递归DNS服务器是如何工作的呢？让我们看看!。\n让我们来看一个例子，当您向递归DNS服务器(如8.8.8.8)请求github.com的IP地址(A记录)时，它会做些什么。首先，如果它已经缓存了一些内容，它会给您提供它已经缓存的内容。但是如果它所有的缓存都过期了呢？以下是发生的情况：\n步骤1：它在源代码中硬编码了根DNS服务器的IP地址。您可以在Unbinded的源代码中看到这一点。假设它首先选择198.41.0.4。以下是这些硬编码IP地址的官方来源，也称为“根提示文件”。\n我们可以粗略地重现挖掘过程中发生的事情。这给我们提供了一个新的权威域名服务器来询问：.com的域名服务器，IP为192.5.6.30。\nDNS响应的细节要稍微复杂一些-在本例中，有一个包含一些NS记录的AUTHORITY部分和一个包含A记录的附加部分，因此您不需要进行额外的查找即可获得这些名称服务器的IP地址。\n(实际上，99.99%的情况下它已经缓存了.com域名服务器的地址，但我们假装我们真的是从头开始)。\n我们有一个新的IP地址要问！这是github.com的名称服务器。\n万岁！！我们为github.com创造了A级的记录！现在，递归名称服务器拥有github.com的IP地址，可以将其返回给您。而且它只需硬编码几个IP地址：根名称服务器的地址，就可以完成所有这些工作。\n当我想要查看递归DNS服务器在解析adomain时将执行什么操作时，我运行。\n这将显示它请求的所有DNS记录，从根DNSservers开始-我们刚刚经历的所有4个步骤。\n现在我们已经了解了DNS工作原理的基础知识，让我们更新一些DNS记录，看看会发生什么。\n不过，我们忘了一些重要的事情！TTLS！您知道我们前面是怎么说的吗？递归DNS服务器将缓存记录，直到它们过期。它决定记录是否应该过期的方式是通过查看TTL或“活着的时间”。\n在本例中，GitHub的名称服务器为其DNS记录返回的A记录的TTL为60，这意味着60秒：\n这是一个相当短的TTL，从理论上讲，如果每个人的DNS实现都遵循DNS标准，这意味着如果Github决定更改github.com的IP地址，每个人都应该在60秒内获得新的IP地址。让我们看看这在实践中是如何发挥作用的。\n首先，我更新了名称服务器(Cloudflare)以拥有一个新的DNS记录：将test.jvns.ca映射到1.2.3.4的A记录。\n这立即奏效了！根本不需要等待，因为在缓存之前没有test.jvns.ca DNS记录。太棒了。但是看起来新记录被缓存了大约5分钟(299秒)。\n那么，如果我们尝试更改该IP呢？我将其更改为5.6.7.8，然后运行相同的DNS查询。\n嗯，看起来DNS服务器的1.2.3.4记录还缓存了144秒。有趣的是，如果我多次查询8.8.8.8，实际上得到的结果并不一致--有时会给我新的IP，有时会给我旧的IP，我猜这是因为8.8.8.8实际上会将负载平衡到一组不同的后端，每个后端都有自己的缓存。\n我等了5分钟后，所有的8.8.8.8缓存都更新了，并且总是返回新的5.6.7.8记录。太棒了。那真是太快了！\n与大多数互联网协议一样，并不是所有的东西都遵循DNS规范。一些ISP DNS服务器缓存记录的时间会比TTL指定的时间更长，比如2天而不是5分钟。而且人们总是可以在他们的/etc/hosts中硬编码旧的IP地址。\n在实践中，当使用5分钟的TTL更新DNS记录时，我预计会发生的情况是，很大比例的客户端将转移到新的IPsquickly(比如在15分钟内)，然后会有一大批落后者在接下来的几天里慢慢更新。\n我们已经看到，当您在不更改名称服务器的情况下更新IP地址时，很多DNS服务器会非常快地获取新的IP。太棒了。但是，如果您更改了您的命名服务器，会发生什么情况呢？让我们试一试吧！\n我不想更新我的博客的名称服务器，所以我使用了我拥有的另一个域名，并在HTTPzine的示例中使用：examplecat.com。\n以前，我的名称服务器设置为dns1.p01.nsone.net。我决定将它们切换到Google的名称服务器-ns-cloud-b1.googledomains.com等。\n当我进行更改时，我的域名注册商有点不祥地弹出了主题消息-“对examplecat.com的更改已保存。它们将在接下来的48小时内生效“。然后，我为该域设置了一个新的A记录，使其指向1.2.3.4。\n但8.8.8.8仍然毫无头绪。尽管我在5分钟前刚刚更换了新IP，1.1.1.1仍然会看到它的原因可能是之前没有人查询过1.1.1.1关于examplecat.com的信息，所以它的缓存中没有任何东西。\n我的注册员说“这将需要48小时”的原因是TTLson NS记录(递归名称服务器如何知道要询问哪个名称服务器)要长得多！\n172800秒就是48小时！因此，与只更新IP地址而不更改名称服务器相比，名称服务器更新通常需要更长的时间才能从缓存中过期并传播。\n当我更新examplecat.com的名称服务器时，发生的情况是.com名称服务器获得新域的新NS记录。就像这样：\n但是，新的NS记录是如何做到这一点的呢？发生的事情是，我通过在网站上更新来告诉域名注册商我想要的新域名服务器是什么，然后我的域名注册商告诉.com域名服务器进行更新。\n对于.com，这些更新发生得相当快(在几分钟内)，但我认为对于其他一些TLD，TLD名称服务器可能不会那么快地应用更新。\nTTLS在实践中可能得不到尊重的另一个原因是：许多程序需要解析DNS名称，一些程序还会在内存中无限期地缓存DNS记录(直到程序重新启动)。\n例如，AWS有一篇关于为DNS NameLookup设置JVM TTL的文章，我自己还没有编写那么多执行DNS查找的JVM代码，但是从少量关于JVM和DNS的搜索可以看出，您似乎可以配置JVM，使其无限期地缓存每个DNS查找。(比如这期ElasticSearch)。\n我希望这能帮助您了解更新DNS时发生的事情！\n作为免责声明，再次声明-TTL绝对不能说明有关DNS传播的全部内容-一些递归DNS服务器肯定不尊重TTL，即使像8.8.8.8这样的主要服务器也是如此。所以，即使你只是用一个短的TTL来更新A记录，很有可能在实践中，你仍然会在一两天内收到对旧IP的请求。\n此外，在发布这篇文章后，我将examplecat.com的名称服务器改回了原来的值。", "note_en": "I’ve seen a lot of people get confused about updating their site’s DNS recordsto change the IP address. Why is it slow? Do you really have to wait 2 days foreverything to update? Why do some people see the new IP and some people see theold IP? What’s happening?\n So I wanted to write a quick exploration of what’s happening behind the sceneswhen you update a DNS record.\n  First, we need to explain a little bit about DNS. There are 2 kinds of DNSservers:  authoritative and  recursive.\n authoritative DNS servers (also known as  nameservers) have a databaseof IP addresses for each domain they’re responsible for. For example, right nowan authoritative DNS server for github.com is ns-421.awsdns-52.com. You can ask it for github.com’s IP like this;\n  recursive DNS servers, by themselves, don’t know anything about who ownswhat IP address. They figure out the IP address for a domain by askingthe right authoritative DNS servers, and then cache that IP address in case they’re askedagain. 8.8.8.8 is a recursive DNS server.\n When people visit your website, they’re probably making their DNS queries to arecursive DNS server. So, how do recursive DNS servers work? Let’s see!\n  Let’s go through an example of what a recursive DNS server (like 8.8.8.8) doeswhen you ask it for an IP address (A record) for github.com. First – if italready has something cached, it’ll give you what it has cached. But what ifall of its caches are expired? Here’s what happens:\n step 1: it has IP addresses for the root DNS servers hardcoded in its source code. You can see this in  unbound’s source code here. Let’s say it picks  198.41.0.4 to start with. Here’s the  official source for those hardcoded IP addresses, also known as a “root hints file”.\n  We can roughly reproduce what happens with  dig. What this gives us is a newauthoritative nameserver to ask: a nameserver for  .com, with the IP  192.5.6.30.\n  The details of the DNS response are a little more complicated than that – inthis case, there’s an authority section with some NS records and an additionalsection with A records so you don’t need to do an extra lookup to get the IPaddresses of those nameservers.\n (in practice, 99.99% of the time it’ll already have the address of the  .com nameservers cached, but we’re pretending we’re really starting from scratch)\n   We have a new IP address to ask! This one is the nameserver for  github.com.\n    Hooray!! We have an  A record for  github.com! Now the recursive nameserverhas  github.com’s IP address and can return it back to you. And it could doall of this by only hardcoding a few IP addresses: the addresses of the rootnameservers.\n  When I want to see what a recursive DNS server would do when resolving adomain, I run\n  This shows all the DNS records that it requests, starting at the root DNSservers – all the 4 steps that we just went through.\n  Now that we know the basics of how DNS works, let’s update some DNS records and seewhat happens.\n    We’ve forgotten something important though! TTLs! You know howwe said earlier that the recursive DNS server will cache records until theyexpire? The way it decides whether the record should expire is by looking atits  TTL or “time to live”.\n In this example, the TTL for the A record github’s nameserver returns for itsDNS record is  60, which means 60 seconds:\n  That’s a pretty short TTL, and  in theory if everybody’s DNS implementationfollowed the  DNS standard it means thatif Github decided to change the IP address for  github.com, everyone shouldget the new IP addresswithin 60 seconds. Let’s see how that plays out in practice\n  First, I updated my nameservers (Cloudflare) to have a new DNS record: an A record that maps test.jvns.ca to  1.2.3.4.\n  This worked immediately! There was no need to wait at all, because there was no test.jvns.ca DNS record before that could have been cached. Great. But itlooks like the new record is cached for ~5 minutes (299 seconds).\n So, what if we try to change that IP? I changed it to  5.6.7.8, and then ran the same DNS query.\n  Hmm, it seems like that DNS server has the  1.2.3.4 record still cached foranother 144 seconds. Interestingly, if I query  8.8.8.8 multiple times I actually getinconsistent results – sometimes it’ll give me the new IP and sometimes theold IP, I guess because 8.8.8.8 actually load balances to a bunch of differentbackends which each have their own cache.\n After I waited 5 minutes, all of the  8.8.8.8 caches had updated and werealways returning the new  5.6.7.8 record. Awesome. That was pretty fast!\n  As with most internet protocols, not everything obeys the DNS specification.Some ISP DNS servers will cache records for longer than the TTL specifies, likemaybe for 2 days instead of 5 minutes. And people can always hardcode the oldIP address in their /etc/hosts.\n What I’d expect to happen in practice when updating a DNS record with a 5minute TTL is that a large percentage of clients will move over to the new IPsquickly (like within 15 minutes), and then there will be a bunch of stragglersthat slowly update over the next few days.\n  So we’ve seen that when you update an IP address without changing yournameservers, a lot of DNS servers will pick up the new IP pretty quickly.Great. But what happens if you change your nameservers? Let’s try it!\n I didn’t want to update the nameservers for my blog, so instead I went with adifferent domain I own and use in the examples for the  HTTPzine:  examplecat.com.\n Previously, my nameservers were set to dns1.p01.nsone.net. I decided to switchthem over to Google’s nameservers –  ns-cloud-b1.googledomains.com etc.\n When I made the change, my domain registrar somewhat ominiously popped up themessage – “Changes to examplecat.com saved. They’ll take effect within thenext 48 hours”. Then I set up a new A record for the domain, to make it point to  1.2.3.4\n     but 8.8.8.8 is still clueless. The reason 1.1.1.1 sees the new IP even thoughI just changed it 5 minutes ago is presumably that nobody had ever queried1.1.1.1 about examplecat.com before, so it had nothing in its cache.\n  The reason that my registrar was saying “THIS WILL TAKE 48 HOURS” is that the TTLson NS records (which are how recursive nameservers know which nameserver toask) are MUCH longer!\n     172800 seconds is 48 hours! So nameserver updates will in general take a lotlonger to expire from caches and propagate than just updating an IP addresswithout changing your nameserver.\n  When I update the nameservers for  examplecat.com, what happens is that he .com nameserver gets a new  NS record with the new domain. Like this:\n  But how does that new NS record get there? What happens is that I tell my domain registrar what I want the new nameservers to be by updating it onthe website, and then my domain registrar tells the  .com nameservers to makethe update.\n For  .com, these updates happen pretty fast (within a few minutes), but Ithink for some other TLDs the TLD nameservers might not apply updates as quickly.\n  One more reason TTLs might not be respected in practice: many programs need toresolve DNS names, and some programs will also cache DNS records indefinitelyin memory (until the program is restarted).\n For example, AWS has an article on  Setting the JVM TTL for DNS NameLookups.I haven’t written that much JVM code that does DNS lookups myself, but from alittle Googling about the JVM and DNS it seems like you can configure theJVM so that it caches every DNS lookup indefinitely. (like  this elasticsearch issue)\n  I hope this helps you understand what’s going on when updating your DNS!\n As a disclaimer, again – TTLs definitely don’t tell the whole story about DNSpropagation – some recursive DNS servers definitely don’t respect TTLs, evenif the major ones like 8.8.8.8 do. So even if you’re just updating an A recordwith a short TTL, it’s very possible that in practice you’ll still get somerequests to the old IP for a day or two.\n Also, I changed the nameservers for  examplecat.com back to their old valuesafter publishing this post.", "posttime": "2020-06-22 23:22:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "时会,update,dns", "title": "更新DNS时会发生什么情况？", "title_en": "What happens when you update your DNS?", "transed": 1, "url": "https://jvns.ca/blog/how-updating-dns-works/", "via": "", "real_tags": ["时会", "update", "dns"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007650, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Prolog非常适合开发Web应用程序。Web页面自然地表示为Prolog术语，并且可以方便地创建、检查和递归处理。我们区分客户端和服务器应用程序。本页更详细地说明了如何使用PROLOG执行这些任务。对Web开发的支持因Prolog系统而异。在最基本的层面上，几个让我们访问网络数据流的简单谓词，例如SICStus-Prolog和Scryer-Prolog中的库(套接字)提供的谓词，就足以构建初级的Web应用程序。当然，最广泛使用的Prolog系统通常远远超过这一点，并为这类应用程序提供更全面和更高级别的支持。例如，SICStus、Prolog和其他几个系统附带了用于WWW编程的枕头库。在SICStus中，它可以作为图书馆(枕头)使用。tau-prolog是一个用JavaScript编写的Prolog解释器，可以无缝嵌入到Web应用程序中。客户端从服务器获取页面。使用Scryer和Prolog，我们可以很容易地通过HTTP和使用http_open/3的HTTPS来获取页面。示例：这将打开Stream来阅读页面。http_open/3的第三个参数是一个选项列表，我们可以使用这些选项来获取报头字段并控制连接的各个方面。由于在上面的示例中指定了https方案，因此会自动建立并使用安全连接。您可以使用库(套接字)显式建立安全连接。一旦我们获得了网页的流句柄，我们就可以通过几种方式读取该页面。例如，我们可以一次读取一个字符，或者使用DCG以一种纯粹的方式处理流。很多时候，将HTML页面转换为以统一方式反映页面结构的PROLOG术语是最方便的。谓词LOAD_HTML/3执行此转换：？-http_open(&#34；https://www.metalevel.at/prolog&#34；，流，[])，LOAD_HTML(STREAM(流)，DOM，[]).Stream=.，DOM=[Element(HTML，[]，[Element(Head，[]，[Element(Head，[]，[Element(Title，.)])])。\n有关更多信息，请参见库(SGML)，以及用于解析标记语言(如XML)的相关谓词。纯Prolog已经使得处理这样一个SGML元素的嵌套列表非常方便，其中每个元素都表示为一个元素(名称、属性、内容)。我们可以使用内置的PROLOG功能简单地递归地处理这样的结构。令人惊讶的是，我们可以做得更好：在Scryer Prolog中，库(XPath)允许我们通过XPath规范以直接的方式访问HTML元素。例如，让我们获取页面上显示的所有列表项的文本，继续前面的示例：？-use_module(library(Xpath))。是真的。？-http_open(&#34；https://www.metalevel.at/prolog&#34；，流，[])，LOAD_HTML(STREAM(流)，DOM，[])，XPATH(DOM，//li(文本)，Item).Stream=.，DOM=.，Item=&#34；Introduction&#34；；Stream=.，DOM=.，Item=&#34；；流=.，DOM=.，项目=#34；基本概念；流=.，DOM=.，项目=#34；数据结构；等等。\n关于回溯，报告了所有解决方案。对于服务器应用程序，我们使用SWI-PROLOG，这是一种PROLOG方言，具有对健壮而高效的多线程的出色支持。首先，考虑一个非常初级的HTTP服务器：该代码片段使用HTTP Unix守护程序库来实现一个简单地使用“Hello！”响应的服务器！满足每一个请求。该库使用可以在命令行上使用的选项隐式地增加代码。要运行服务器，请将代码片段复制到server.pl并通过以下命令了解更多信息：例如，您可以使用以下命令在端口13040上启动服务器：一旦服务器正在运行，您可以通过浏览到http://127.0.0.1:3040.对其进行测试。在更现实的HTTP客户端服务器中，响应当然取决于客户端的实际请求。服务器库将解析后的请求表示为名称(值)元素列表，这些元素可以很容易地在Prolog中处理。使用不同的或附加的http_handler/3指令，您可以更改服务器的行为。例如，要提供当前目录中的文件，请改用以下指令：要发出HTML页面，您有几个选项：您可以简单地在stdout上发出您想要的任何回复，如上面的示例所示。这很容易出错，很容易忘记结束标记等。\n您可以使用库(http/html_write)从Prolog术语创建HTML页面。下面是一个示例，使用DCG的非终端html//1将序言术语转换为HTML并打印出来：\n根据任务的不同，其中一些选项会比其他选项更合适。有关详细信息，请参阅HTTP服务器和库。要运行基于Prolog的HTTPS服务器，请参阅LetSWICcrypt。Proloxy是一个基于Prolog的代理，它使用可扩展的Prolog子句进行灵活配置。P引擎允许", "note_en": "Prolog is extremely well suited for developing  web applications. Web pages are naturally represented as  Prolog terms and can be easily created, inspected and processed recursively.         We distinguish between  client and  server applications. This page explains in more detail how to use Prolog for these tasks.    Support for web development differs between Prolog systems. At the most basic level, a few simple predicates that let us access network streams, such as the predicates provided by   library(sockets) in SICStus Prolog and Scryer Prolog, suffice to build rudimentary web applications.    Of course, the most widely used Prolog systems typically go far beyond this and ship with more thorough and high-level support for such applications. For example, SICStus Prolog and several other systems ship with the  PiLLoW library for WWW programming. In SICStus, it is available as   library(pillow).     Tau Prolog is a Prolog interpreter written in JavaScript and can be seamlessly embedded in web applications.       A  client fetches pages from a  server. Using Scryer Prolog, we can easily fetch a page via HTTP and HTTPS using    http_open/3.    Example:   This opens  Stream for reading the page. The third argument of  http_open/3 is a list of  options that we can use to obtain header fields and control various aspects of the connection.    Since the  https scheme was specified in the example above, a  secure connection is automatically established and used. You can use   library(sockets) to establish secure connections explicitly.    Once we obtain a stream handle for a web page, we can read the page in several ways. For example, we can read one character at a time or use a  DCG to process the stream in a  pure way.    Very often, it is most convenient to convert the HTML page to a  Prolog term that reflects the page structure in a uniform way. The predicate   load_html/3 performs this conversion:  ?- http_open(&#34;https://www.metalevel.at/prolog&#34;, Stream, []),  load_html(stream(Stream), DOM, []).Stream = ..., DOM = [element(html, [], [element(head, [], [element(title, ...)])])].\n See    library(sgml) for more information, and related predicates for parsing markup languages like XML.    Plain Prolog already makes it extremely convenient to process such a nested list of SGML elements, where each element is represented as  element(Name, Attributes, Content). We could simply process such structures recursively, using  built-in Prolog features.    Amazingly, we can do even better: In Scryer Prolog,    library(xpath) allows us to access HTML elements by  XPath specifications in a straight-forward way.    For example, let us obtain the text of all  list items that appear on a page, in continuation of the previous example:  ?- use_module(library(xpath)). true. ?- http_open(&#34;https://www.metalevel.at/prolog&#34;, Stream, []), load_html(stream(Stream), DOM, []),  xpath(DOM, //li(text), Item).Stream = ...,DOM = ..., Item = &#34; Introduction&#34; ;Stream = ...,DOM = ..., Item = &#34; Facets of Prolog&#34; ;Stream = ...,DOM = ..., Item = &#34; Basic Concepts&#34; ;Stream = ...,DOM = ..., Item = &#34; Data Structures&#34; ;etc.\n On backtracking, all solutions are reported.    For  server applications, we use  SWI-Prolog, a Prolog dialect with excellent support for robust and efficient multithreading.    To get started, consider a very rudimentary HTTP server:   The snippet uses the HTTP  Unix daemon library to implement a server that simply responds with  Hello! to every request. This library implicitly augments your code with options that you can use on the command line.    To run the server, copy the snippet to  server.pl and find out more with:   For example, you can start the server on port 3040 using:   Once the server is running, you can test it by browsing to   http://127.0.0.1:3040.    In a more realistic HTTP server, the response will of course depend on the actual  request of the client. The server libraries represent the  parsed request as a list of  Name(Value) elements, which can be easily processed in Prolog.    Using different or additional  http_handler/3 directives, you can change the behaviour of the server. For example, to serve  files from the current directory, use the following directives instead:   To emit HTML pages, you have several options:  You can simply emit any reply you want on  stdout, as in the example above. This is quite error-prone, making it easy to forget closing tags etc.\n    You can use   library(http/html_write) to create HTML pages from Prolog terms. Here is an example, using the  DCG nonterminal  html//1 to convert a Prolog term to HTML and printing it:\n Depending on the task, some of these options will be more appropriate than others.    See the   HTTP server libraries for more information.    To run a Prolog-based HTTPS server, see   LetSWICrypt.      Proloxy is a Prolog-based  proxy that uses extensible Prolog clauses for flexible configurations.      Pengines allow us to implement powerful client/server applications in Prolog.    Using Pengines, you can query a remote Prolog server  as if it were local, using its results in client Prolog programs or web pages with JavaScript.    For example, consider again the animal identification task described in   Expert Systems. We can implement it as a client/server application with:   Importantly, the application logic resides completely on the server.    See   RITS for an example of a more complex application.    See also Pengine&#39;s successor,   Web Prolog, and the upcoming book   Web Prolog and the programmable Prolog Web by Torbjörn Lager.       More about Prolog       Main page", "posttime": "2020-06-22 23:22:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,web,prolog", "title": "Prolog Web应用程序", "title_en": "Prolog Web Applications", "transed": 1, "url": "https://www.metalevel.at/prolog/web", "via": "", "real_tags": ["程序", "web", "prolog"]}, {"category": "", "categoryclass": "", "imagename": "887ef309c0772a0581bddc2c9e3a3c96.jpg", "infoid": 1007649, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个国际科学家小组警告说，使用气溶胶反射阳光和冷却地球将削弱两个半球温带纬度的风暴路径。他们的模型表明，虽然这样的太阳地球工程计划可以减轻冬季风暴的严重程度，但它们也会使夏季的天气系统停滞不前。这可能会导致更强烈的热浪，空气污染增加，海洋环流发生变化。\n太阳地球工程涉及通过反射入射的阳光来冷却地球，一些科学家认为这是减轻全球变暖影响的一种方式。一种流行的策略是在平流层放置反射气溶胶-使用飞机、气球或飞艇-以阻挡阳光。\n但太阳地球工程的效果尚不清楚。它不会像冷却地球那样简单地起作用，从而使地球的气候恢复到工业化前的水平。太阳地球工程下的气候将有所不同，因为大气中的二氧化碳水平仍将显著增加。\n查尔斯·格特勒(Charles Gertler)是美国麻省理工学院地球、大气和行星科学系的研究生，他和同事们感兴趣的是，向大气中注入气溶胶将如何影响两个半球的极地到赤道温度梯度，以及这可能对温带风暴路径产生的影响。这些地区位于中高纬度地区，被称为温带气旋的风暴发生频率较高，在决定世界许多地区的日常天气条件方面发挥着重要作用。\n格特勒解释说：“世界上大约一半的人口生活在温带地区，那里的风暴路径主导着天气。”他补充说，“风暴路径依赖于经向温度梯度，而风暴路径之所以有趣，是因为它们帮助我们了解极端天气。”\n该研究小组使用各种气候模型来探索太阳地球工程对风暴路径的影响。首先，他们分析了地球工程模型对比项目实验G1中的模拟，该项目为研究人员提供了太阳辐射管理方案，供研究人员与气候模型一起使用。\n在G1方案中，太阳辐射减少，以平衡二氧化碳浓度相对于工业化前水平翻了两番而导致的变暖。这一模型运行了50年，并与将二氧化碳保持在工业化前水平的模型和模拟二氧化碳浓度翻了两番的模型进行了比较，以分别提供基线和全球变暖情景。\n该团队还进行了另外两次气候模拟。第一个被称为“半个G1”，旨在模拟一个介于G1地球工程模拟和未来二氧化碳浓度翻两番之间的情景。在另一个模型中，气溶胶被注入四个不同纬度的平流层，由反馈算法控制。\n发表在“地球物理研究快报”上的他们的研究结果表明，反射太阳辐射以抵消全球变暖将削弱南北半球的风暴路径。这些影响是由不同纬度的平均温度和湿度的变化推动的，这些变化降低了两半球从极点到赤道的温度梯度。从本质上讲，减少传入的太阳辐射会使赤道降温，而两极则继续变暖。\n“我们的结果表明，太阳地球工程不会简单地逆转气候变化，”格特勒解释说。“相反，它本身有可能导致气候发生新的变化。”\n在北半球，风暴路径预计也会随着气候变化而减弱。最新的研究表明，这将发生在与太阳地球工程类似的震级。然而，在南半球，全球变暖预计将增加风暴路径的强度，并使其向南移动。有了太阳地球工程，这些风暴路径将会减弱，一些模型表明，这些系统可能也会向极地移动。\n格特勒说：“在两个半球，减弱的风暴路径将意味着更弱的冬季风暴，但也会导致更多的停滞天气，这可能会影响热浪。”“在所有季节，这可能会影响空气污染的通风。这也可能会削弱水文循环，导致区域降雨量减少。与我们习惯的基线气候相比，这些都不是什么好的变化。“。研究人员警告说，在南半球，风暴路径强度的变化可能会影响风力驱动的海洋环流，并影响南极冰盖的稳定性。\n格特勒说：“这项工作突出表明，太阳地球工程并没有逆转气候变化，而是用一种前所未有的气候状态取代了另一种。”", "note_en": "Using aerosols to reflect sunlight and cool the planet will weaken storm tracks in the temperate latitudes in both hemispheres, an international team of scientists warn. Their modelling suggests that while such solar geoengineering schemes could reduce the severity of winter storms, they would also stagnate weather systems in the summer. This could lead to more intense heat waves, increases in air pollution, and changes in ocean circulation.\n   Solar geoengineering involves cooling the Earth by reflecting incoming sunlight and is seen by some scientists as a way of mitigating the effects of global warming. One popular strategy involves placing reflective aerosols in the stratosphere – using aircraft, balloons or blimps – to block sunlight.\n But the effects of solar geoengineering are unknown. It would not work as simply as cooling the planet and therefore returning Earth’s climate to pre-industrial levels. Climate under solar geoengineering would be different, as there would still be marked increases in atmospheric carbon dioxide levels.\n  Charles Gertler, a graduate student in the Department of Earth, Atmospheric and Planetary Sciences at the Massachusetts Institute of Technology, in the US, and colleagues were interested in how injecting aerosols into the atmosphere would impact the pole‐to‐equator temperature gradient in both hemispheres, and the effect that could have on extratropical storm tracks. These are regions in the mid and high latitudes with heightened incidences of storms known as extratropical cyclones, which play a significant role in determining the day-to-day weather conditions in many parts of the world.\n “About half the world’s population lives in the extratropical regions where storm tracks dominate weather,” Gertler explains. He adds, “Storm tracks feed off of meridional temperature gradients, and storm tracks are interesting because they help us to understand weather extremes.”\n The team used various climate models to explore the effects of solar geoengineering on storm tracks. First, they analysed simulations from experiment G1 of the  Geoengineering Model Intercomparison Project which provides solar radiation management schemes for researchers to use with climate models.\n  In the G1 scenario solar radiation is reduced to balance warming caused by a quadrupling of carbon dioxide concentrations, relative to pre-industrial levels. This was run for 50 years and compared with a model that kept carbon dioxide at pre-industrial level and one that simulated a quadrupling of carbon dioxide concentrations, to provide a baseline and a global warming scenario, respectively.\n The team ran two other climate simulations. The first, known as ‘half G1’, aims to model a scenario half-way between the G1 geoengineering simulation and a future where carbon dioxide concentrations quadruple. In the other model aerosols are injected into the stratosphere at four different latitudes controlled by a feedback algorithm.\n Their results, described in   Geophysical Research Letters, show that reflecting solar radiation to counteract global warming would weaken storm tracks in both the northern and southern hemispheres. These effects are driven by changes in mean temperature and humidity at different latitudes that reduce the pole‐to‐equator temperature gradient in both hemispheres. Essentially, reducing incoming solar radiation cools the equator while the poles continue to warm.\n  “Our results show that solar geoengineering will not simply reverse climate change,” Gertler explains. “Instead, it has the potential itself to induce novel changes in climate.”\n In the Northern hemisphere storm tracks are also predicted to weaken with climate change. The latest work suggests that this would occur at a similar magnitude as with solar geoengineering. In the southern hemisphere, however, global warming is expected to increase the intensity of the storm tracks and shift them south. With solar geoengineering these storm track would weaken, with some of the models indicating that there may also be a poleward shift in these systems.\n  “A weakened storm track, in both hemispheres, would mean weaker winter storms but also lead to more stagnant weather, which could affect heat waves,” Gertler says. “Across all seasons, this could affect ventilation of air pollution. It also may contribute to a weakening of the hydrological cycle, with regional reductions in rainfall. These are not good changes, compared to a baseline climate that we are used to.” In the southern hemisphere changes in storm track intensity could impact wind‐driven ocean circulations and affect the stability of Antarctic ice sheets, the researchers warn.\n “This work highlights that solar geoengineering is not reversing climate change, but is substituting one unprecedented climate state for another,” Gertler says.", "posttime": "2020-06-22 23:21:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "表明,geoengineering,风暴", "title": "建模表明，太阳地球工程可能会导致不必要的气候变化", "title_en": "Solar geoengineering could cause unwanted changes in climate, modelling suggests", "transed": 1, "url": "https://physicsworld.com/a/solar-geoengineering-could-cause-unwanted-changes-in-climate-new-modelling-suggests/", "via": "", "real_tags": ["表明", "风暴"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007648, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "古老的工作场所极其危险，它的条件会导致健康问题，从老茧和疤痕到永久性畸形或其他不太明显的问题，比如呼吸问题。尽管缺乏对健康和安全的现代理解，甚至缺乏基本的卫生原则，但在那里工作的人认识到保护的必要性，他们使用各种保护设备来管理，从初级到高级，其复杂性和独创性无所不包。\n农业工作伴随着许多危险。在最基本的层面上，工人们长时间在烈日下工作，戴着头盔保护自己。田园诗人卡尔普尔纽斯·斯库鲁斯(Calpurnius Scurus)形容他们戴着贴身的皮帽，而考古学家威廉·马修·弗林德斯·皮特里(William Matthew Flinders Petrie)在1901年至1902年在埃及的发掘季节发现了一顶巴拿马风格的草帽，这可能也有类似的目的。自那以后，它被放射性碳测得可以追溯到公元420-568年，使其成为世界上最古老的此类帽子。根据植物学家Theophrastus的说法，当冒险进入茂密的灌木丛时，工人们还试图通过穿戴坚固的手部和脚部覆盖物来避免致命的叮咬和叮咬。读了埃利修斯的诗，这就说得通了。这首诗讲的是一个叫敏登的人，在砍树的时候，被一只蜘蛛咬伤了脚；被咬的地方感染了，变成了坏疽，他的腿被截肢了。这也是众所周知的，一些植物有很强的特性，既有正面的，也有负面的。普卢塔克记录说，那些负责收获鸦片罂粟的人被警告要警惕令人昏昏欲睡的烟雾，并用什么东西遮住鼻子和嘴巴，也许是皮革或布料制成的口罩，以防止吸入。\n埃涅阿斯·塔克提库斯在围困期间对破坏的实际操作提供了长篇指导：“一个人应该把两辆马车的杆子…绑在一起。高高举起的，朝同一点倾斜的。然后，当这件事做完后，除了上面的其他木头和各种覆盖物外，还应该把杆子绑在上面，用粘土把它们覆盖起来。因此，这个装置可以在你想要的任何地方通过轮子前进和撤退，而那些正在挖掘的人可以保持在这种保护之下。\n显然，军事矿工比那些开采矿物和金属的矿工更受重视：后者没有这样的保护，在悲惨的条件下劳动-就像从古代矿山发现的骨骼所显示的那样-经常戴着镣铐和锁链。老普林尼在服兵役期间曾在西班牙的银矿呆过相当长的时间，并详细描述了他们的工作方式。他说，那些负责加工矿物的人会把动物膀胱制成的口罩绑在他们的鼻子和嘴巴上，以防止他们吸入灰尘并损害肺部。他们的眼睛保持畅通，这样他们就能看到他们在做什么。根据学者朱利叶斯·波勒克斯(Julius Pollux)的说法，这种临时面罩是逐渐开发和改进的：增加了一个麻布过滤器，并开始与身体其他地方佩戴的袋子和麻袋一起使用，想必是为了保护皮肤的敏感区域不受伤害和感染。\n潜水员在寻找用于制造紫色染料、海绵、珍珠甚至从沉船中打捞的蜗牛时，通常会把海绵绑在他们的头上。亚里士多德得出结论，这是为了保护他们的耳朵。Lycophron在他唯一幸存的诗中建议，有时潜水员还会穿着简陋的皮革潜水服，让自己适应冰冻的水。虽然许多古代潜水似乎采取了我们今天所知的自由潜水的形式，但亚里士多德关于这一主题的反复写作清楚地表明，有时会使用类似通气管的呼吸器-似乎一些潜水员甚至走得更远，用大锅制作初级潜水钟，即使在水下也可以保留一定数量的空气。几个世纪以来，关于这些策略的故事流传开来，变得越来越富有想象力，越来越精致，最终变得虚构。他们最终发现自己融入了亚历山大传奇的中世纪现象，在这一现象中，亚历山大大帝被描绘成指挥着现代潜艇的古代先驱。这个装置被认为是由玻璃制成的气泡、桶或盒子组成的，这些气泡、桶或盒子被放在船上，带到大海中，然后通过金属链条从侧面一直降到海床上，让亚历山大能够在相对安全和舒适的情况下征服海洋，就像他征服陆地一样。\n就像战士，无论是士兵还是角斗士，在战斗中穿着盔甲保护自己不受伤害和死亡一样，其他不那么引人注目的古代工人在日常生活中也理所当然地使用个人防护装备。但必须指出的是，由于这项工作的大部分是由被奴役和以前被奴役的人承担的，c", "note_en": "The ancient workplace was extremely hazardous, its conditions causing health problems from callouses and scars to permanent deformities or other, less immediately visible, issues, such as breathing problems. Despite the absence of the modern understanding of health and safety, or even basic principles of hygiene, the people working in it recognised the need for protection, which they managed using a variety of protective equipment, ranging in complexity and ingenuity from the rudimentary to the advanced.\n Agricultural work came with many dangers. At the most basic level, workers, spending long hours under the hot sun, protected themselves with headgear. The bucolic poet Calpurnius Siculus describes them wearing close-fitting leather caps, while the archaeologist William Matthew Flinders Petrie recovered a Panama-style straw hat during his 1901-2 excavation season in Egypt, which may have served a similar purpose. It has since been radiocarbon-dated to AD 420-568, making it the oldest such hat in the world. According to the botanist Theophrastus, workers also attempted to avoid deadly bites and stings by wearing sturdy hand and foot coverings when venturing into dense undergrowth. This makes sense when read against Erycius’ poem about a man named Mindon, who, while cutting down a tree, was bitten on the foot by a spider; the bite became infected, turned gangrenous and his leg was amputated. It was common knowledge, too, that some plants had powerful properties, both positive and negative. Plutarch records that those tasked with harvesting the opium poppy were warned to be on their guard against the soporific fumes and to cover their noses and mouths with something, perhaps a mask made from leather or cloth, to prevent inhalation.\n Aeneas Tacticus provided lengthy instructions on the practicalities of undermining during a siege: ‘One should fasten together the poles of two wagons … raised aloft, inclining toward the same point. Then, when this has been done, one should fasten on to the poles in addition other timbers and sorts of covering above and cover them over with clay. This device, then, could be advanced and withdrawn on its wheels wherever you desire, and those who are excavating could keep under this protection.’\n Clearly, military miners were valued more highly than those who mined for minerals and metals: the latter had no such protection and laboured in miserable conditions, often – as skeletons recovered from ancient mines have shown – in shackles and chains. Pliny the Elder spent considerable time at the silver mines in Spain during his military service and described their workings in detail. Those responsible for processing the minerals, he recounted, tied masks made from animal bladders over their noses and mouths to prevent them from inhaling the dust and damaging their lungs. Their eyes were left unobstructed so they were able to see what they were doing. According to the scholar Julius Pollux, this makeshift mask was gradually developed and refined: a sackcloth filter was added and it began to be used in conjunction with bags and sacks worn elsewhere on the body, presumably to protect sensitive areas of skin from injury and infection.\n  Divers on the lookout for snails used in the manufacture of purple dye, sponges, pearls, or even salvage from shipwrecks, would routinely bind sponges around their heads. Aristotle concluded that it was to protect their ears. Lycophron suggested in his only surviving poem that, on occasion, divers would also wear rudimentary leather wetsuits to inure themselves to the freezing water. While much ancient diving seems to have taken the form of what we know today as freediving, Aristotle’s repeated writings on the subject make it clear that breathing apparatus akin to a snorkel was sometimes used – and it seems some divers went even further than that, making rudimentary diving bells out of cauldrons that could retain a certain amount of air even while submerged. Over the centuries, stories about these tactics spread and became increasingly imaginative, elaborate – and, ultimately, fictional. They eventually found themselves incorporated into the medieval phenomenon of the  Alexander Romance, in which Alexander the Great was portrayed commanding an ancient precursor to the modern submarine. This contraption was thought to have consisted of a bubble, barrel or case made of glass that was placed on a ship, taken out to sea, then lowered over the side and all the way down to the seabed on a metal chain, allowing Alexander, in relative safety and comfort, to conquer the sea as he had conquered the land.\n Just as warriors, whether soldiers or gladiators, wore armour to protect themselves from injury and death during battle, other, less high profile, types of ancient workers also used personal protective equipment as a matter of course in their daily lives. But it is important to note that, since much of this work was undertaken by the enslaved and formerly enslaved, considered to be the lowest of the low in ancient Greek and Roman society, the physical and mental welfare of the members of the workforce was not uppermost in the minds of those in charge of and responsible for them; they were not considered to be individuals of consequence, or even individuals at all. In fact, ancient authors routinely referred to them as ‘articulate tools’. Rather, it was their productivity that was privileged. Consequently, these measures were not only aimed at protecting the frail human body, they were also aimed at augmenting it to provide a functional advantage in an inhospitable environment, somewhere that humans would not, or could not, normally go, all in the pursuit of financial gain for a relative few.", "posttime": "2020-06-22 23:20:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "古代,easily,保护", "title": "轻松呼吸：古代世界对防护设备的解决方案", "title_en": "Breathing Easily: The ancient world's solutions for protective equipment", "transed": 1, "url": "https://www.historytoday.com/history-matters/breathing-easily", "via": "", "real_tags": ["古代", "easily", "保护"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007647, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "唐纳德·特朗普(Donald Trump)总统一直在以子弹头列车的速度解雇联邦监督机构。在4月和5月的短短6周时间里，总统解雇了5名联邦机构的监察长。在上周五晚上的政变中，司法部长威廉·巴尔(William Barr)作为总统的参谋罢免了纽约南区联邦检察官，后者是负责监督该地区华尔街银行起诉的联邦检察官。私人所有的纽约联邦储备银行(Federal Reserve Bank Of New York)也位于该地区，该银行负责美联储的大部分救助计划。\n巴尔和总统希望让一个没有检察官经验的人来负责这个办公室，杰伊·克莱顿目前是美国证券交易委员会(Securities And Exchange Commission)的主席，而证券交易委员会只有民事执行权。在加入SEC成为Sullivan&amp；Cromwell合伙人之前的三年里，克莱顿代表了华尔街10家最大银行中的8家。\n不幸的是，监管机构和检察官是美国公民目前最需要的，因为财政部和美联储都有大量资金下落不明。\n被称为CARE法案的刺激法案于2020年3月27日由总统签署成为法律。它呼吁“不超过454,000,000美元的…。可向联邦储备系统理事会设立的项目或设施提供贷款和贷款担保，并对其进行其他投资，目的是向支持向符合条件的企业、州或市政当局放贷的金融系统提供流动性。“。此外，如果财政部有国会在CARE法案中分配的460亿美元剩余资金中的任何一笔，以帮助航空公司或国家安全企业，这笔资金也将移交给美联储。\n近三个月前，在大萧条以来最严重的经济动荡开始时，CARE法案获得通过。有人会认为，国会采取行动通过这项立法的紧迫性，会导致4540亿美元迅速部署到美联储，以帮助支撑经济。\n但根据美国联邦储备委员会(Federal Reserve)上周四公布的数据，在国会拨给美联储的4540亿美元中，财政部只上缴了1140亿美元。美国联邦储备委员会(Federal Reserve)每周公布的资产负债表数据(H.4.1)显示，一个标题为“财政部对信贷安排的贡献”的项目显示，余额仅为1140亿美元。\nH.4.1上的一个脚注确切地解释了哪些美联储救助计划从财政部获得了这笔钱：\n“商业票据融资工具II LLC的股权投资额为100亿美元，企业信贷融资工具LLC为375亿美元，MS[Main Street]Facilities LLC为375亿美元，市政流动性工具LLC为175亿美元，TALF II LLC为100亿美元，货币市场互惠基金流动性工具的信用保护为15亿美元。”\n总统的经济顾问拉里·库德洛(Larry Kudlow)在立法签署前的新闻发布会上解释了为什么美联储将获得这笔巨额资金。这笔钱将被美联储用作特殊目的载体(Special Purpose Vehicle)的股权投资，这些资金将用作“吸收亏损的资本”，这意味着纳税人将承担前4540亿美元的损失。然后，美联储将可以自由地将这笔钱的杠杆率提高10倍，以创建4.54万亿美元的救助计划。\n美联储主席鲍威尔在3月26日的《今日秀》节目中史无前例地亮相，并这样解释该计划：\n鲍威尔：“在像现在这样的某些情况下，我们确实有能力基本上使用我们的紧急贷款权力，唯一的限制将是我们从财政部获得多少支持。我们被要求为我们的贷款获得全额担保，这样我们就不会赔钱。因此，财政部在我们估计可能的损失时提供了资金，…。实际上，财政部吸收1美元的损失支持足以支持10美元的贷款。\nCARE法案立法的撰稿人显然预计美联储可能想要对其一些货币交易保密，因为CARE法案的第4009条暂停了美联储的信息自由法，并允许美联储秘密举行会议，直到总统表示冠状病毒国家紧急状态结束。\n鲍威尔和美联储负责监管的副主席兰德尔·夸尔斯都在听证会上多次向国会表示，这些救助计划的接受者对美国人民将是透明的。上周二和周三，美联储主席鲍威尔每半年一次在参议院银行和众议院金融服务委员会露面。他就美联储的紧急救助机制向两个委员会发表了以下声明：\n“这些设施中的许多都得到了CARE法案的资金支持。我们将按月披露每项贷款参与者的姓名和详情；借款金额和收取的利率；以及每项贷款的总成本、收入和费用。我们接受我们对美国人民的责任，即尽可能地透明，我们理解，当我们被要求使用我们的紧急权力时，透明度的必要性变得更加必要。“。\n但这是美联储的网页，显示了根据美联储法案第13(3)条指定为紧急贷款工具的安排向国会披露的情况。列出了11个项目。只有3个项目(占总数的27%)提供了实际交易数据，显示了向特定收款人提供的具体贷款。\n这些计划是二级市场公司信贷安排(Second Market Corporation Credit Facility)，它花了大部分资金购买由贝莱德(BlackRock)赞助的交易所交易基金(ETF)，贝莱德是美联储聘请来监督该计划的投资管理公司；市政流动性安排只向伊利诺伊州提供了一笔12亿美元的贷款，因为该计划的条款非常苛刻，本应帮助州和地方政府在大流行病关闭后幸存下来；以及Paycheck Protection Program流动性安排，它向一家规模很小的新泽西银行提供了53亿美元，占其总支出的9%。\n但这份美联储正在运营的11项救助设施的清单很难说是全貌。2019年9月17日，美联储开始每周向华尔街大型银行的交易部门发放数千亿美元的超低成本回购贷款。这些贷款正在进行中，目前的利率仅为1%的十分之一。自去年9月以来，美联储已经累计发放了超过9万亿美元的这些贷款。它没有公布任何关于华尔街公司具体收到了这笔钱的信息，或者他们各自收到了多少钱。\n美联储还通过贴现窗口向华尔街银行发放了多笔贷款。美联储没有公布这些银行的名称，也没有公布它们需要借入多少钱。美联储还没有解释它如何能够不断地告诉美国人民，华尔街的银行“资本充足”，而它需要继续发放这些最后贷款人的贷款。\n美联储(Federal Reserve)还设立了一项流动性安排，进行大规模的外国央行美元掉期，为这些央行购买美元计价资产创造流动性，并帮助支撑市场。上周四的H.4.1显示，美元掉期机制目前的余额为3520亿美元。截至5月27日，该机构的余额高达4490亿美元。\n根据美国政府问责局(Government Accounability Office)在2008年金融危机后对美联储进行的审计，这是当时那些美元掉期额度的用途之一：\n“2008年10月，根据美国联邦储备委员会(美联储/FED)工作人员的说法，联邦储备委员会允许瑞士国家银行(瑞士央行)根据其互换额度协议使用美元向瑞士大型银行组织瑞银提供特别援助。具体地说，2008年10月16日，瑞士国家银行(Swiss National Bank)宣布，将使用通过与纽约联邦储备银行(FRBNY)互换额度获得的美元，帮助为其将创建的特殊目的工具(SPV)提供资金，以从瑞银(UBS)购买至多600亿美元的非流动性资产。\n瑞银是一家主要的投资银行和贸易公司，也是华尔街的主要参与者。它在2000年收购了美国大型零售经纪公司PaineWebber。瑞银暗池(UBS Dark Pool)，相当于在瑞银内部运营的监管不力的证券交易所，一直是华尔街银行股的最大交易商之一。\n联邦储备理事会已经让纽约联邦储备银行负责这些救助计划的大部分。它的冲突很多。(请参阅下面的相关文章。)。现在是国会阻止美联储重复其弥天大谎的时候了，即它将不遗余力地保持透明度，并迫使它交出这些贷款接受者的姓名和美元金额。", "note_en": "President Donald Trump has been sacking federal watchdogs at the speed of a bullet train. In just a six-week period in April and May,  the President fired five Inspectors General of federal agencies. In last Friday night’s coup d’état, Attorney General William Barr, acting as consigliere for the President, ousted the U.S. Attorney for the Southern District of New York, the federal prosecutor that oversees prosecutions of Wall Street banks in that district. The privately owned Federal Reserve Bank of New York, which is in charge of the bulk of the Fed’s bailout programs, also resides in that district.\n Barr and the President want to put a man with zero experience as a prosecutor in charge of that office, Jay Clayton, who currently heads the Securities and Exchange Commission which has only civil enforcement powers. Clayton represented 8 of the 10 largest Wall Street banks in the three years before going to the SEC as a partner at Sullivan &amp; Cromwell.\n Unfortunately, watchdogs and prosecutors are what American citizens need the most right now as vast sums of money are unaccounted for at both the Treasury and Federal Reserve.\n The stimulus bill known as  the CARES Act was signed into law by the President on March 27, 2020. It called for “Not more than the sum of $454,000,000,000…shall be available to make loans and loan guarantees to, and other investments in, programs or facilities established by the Board of Governors of the Federal Reserve System for the purpose of providing liquidity to the financial system that supports lending to eligible businesses, States, or municipalities.” In addition, if the Treasury had any of its $46 billion left over that Congress had allotted in the CARES Act to assist airlines or national security businesses, that was to be turned over to the Fed as well.\n The CARES Act was passed almost three months ago at the outset of the worst economic upheaval since the Great Depression. One would have thought that the urgency with which Congress acted to pass the legislation would have resulted in rapid deployment of the $454 billion to the Fed to help shore up the economy.\n But according to data released this past Thursday by the Federal Reserve, the Treasury has turned over just $114 billion of the $454 billion that was allocated to the Fed by Congress. The Federal Reserve’s weekly balance sheet data release,  known as the H.4.1, showed a line item titled “Treasury contributions to credit facilities” and it showed a balance of just $114 billion.\n A footnote on the H.4.1 explained exactly which Fed bailout programs had received the money from the Treasury:\n “Amount of equity investments in Commercial Paper Funding Facility II LLC of $10 billion, Corporate Credit Facilities LLC of $37.5 billion, MS [Main Street] Facilities LLC of $37.5 billion, Municipal Liquidity Facility LLC of $17.5 billion, and TALF II LLC of $10 billion, and credit protection in the Money Market Mutual Fund Liquidity Facility of $1.5 billion.”\n  The President’s economic advisor, Larry Kudlow, explained at a press briefing before the signing of the legislation, why the Fed was to get this vast sum of money. The money would be used as equity investments by the Fed in Special Purpose Vehicles that would use the money as “loss absorbing capital,” meaning that taxpayers would eat the first $454 billion in losses. The Fed would then be free to leverage this money up by a factor of 10 to create $4.54 trillion in bailout programs.\n Fed Chairman Powell made an unprecedented appearance on the  Today show on March 26 and explained the plan like this:\n Powell: “In certain circumstances like the present, we do have the ability to essentially use our emergency lending authorities and the only limit on that will be how much backstop we get from the Treasury Department. We’re required to get full security for our loans so that we don’t lose money. So the Treasury puts up money as we estimate what the losses might be…Effectively $1 of loss absorption of backstop from Treasury is enough to support $10 of loans.”\n The writers of the CARES Act legislation apparently expected that the Fed might want to keep some of its money transactions a secret because Section 4009 of the CARES Act suspends the Freedom of Information Act for the Fed and allows it to conduct its meetings in secret until the President says the coronavirus national emergency is over.\n Both Powell and the Fed’s Vice Chairman for Supervision, Randal Quarles, have repeatedly stated to Congress in hearings that the recipients of these bailout programs would be transparent to the American people. Last Tuesday and Wednesday, Fed Chairman Powell made his semi-annual appearances before the Senate Banking and House Financial Services Committee. He stated the following to both Committees regarding the Fed’s emergency bailout facilities:\n “Many of these facilities have been supported by funding from the CARES Act. We will be disclosing, on a monthly basis, names and details of participants in each such facility; amounts borrowed and interest rate charged; and overall costs, revenues, and fees for each facility. We embrace our responsibility to the American people to be as transparent as possible, and we appreciate that the need for transparency is heightened when we are called upon to use our emergency powers.”\n But this is the  Fed’s web page that shows the disclosures being made to Congress under the facilities that the Fed has designated as emergency lending facilities under Section 13(3) of the Federal Reserve Act. There are 11 programs listed. Just three of the programs, or 27 percent of the total, have provided the actual transaction data showing specific loans to specific recipients.\n Those programs are the Secondary Market Corporation Credit Facility, which has spent the bulk of its money buying up Exchange Traded Funds sponsored by BlackRock, the investment manager that the Fed hired to oversee the program; the Municipal Liquidity Facility which has made just one loan of $1.2 billion to the state of Illinois because the terms are so onerous in this program that is supposed to be helping state and local governments survive the pandemic shutdowns; and the Paycheck Protection Program Liquidity Facility, which provided $5.3 billion or 9 percent of its total outlays to  a tiny New Jersey Bank that has been cited by the Federal Deposit Insurance Corporation for “unsafe or unsound banking practices.”\n But this list of 11 bailout facilities that the Fed is operating is hardly the full picture. On September 17, 2019 the Fed began making hundreds of billions of dollars a week in super low cost repo loans to the trading units of Wall Street’s mega banks. Those loans are ongoing and are currently being made at an interest rate of just 1/10 th of one percent interest. Since September of last year, the Fed has made more than $9  trillion cumulatively in these loans. It has not announced one scintilla of information on what specific Wall Street firms have received this money or how much they individually received.\n The Fed has also made multiple loans through its Discount Window to Wall Street banks. The Fed has not released the names of these banks or how much they needed to borrow. The Fed has yet to explain how it can continuously be telling the American people that the Wall Street banks are “well capitalized” while it needs to continue to make these lender-of-last-resort loans.\n The Federal Reserve has also set up a liquidity facility to make massive foreign central bank dollar swaps to create liquidity for those central banks to buy dollar-denominated assets and help prop up markets. Last Thursday’s H.4.1 shows the dollar swap facility has a current balance of $352 billion. The facility’s balance had been as high as $449 billion as of May 27.\n According to the Government Accountability Office’s audit of the Fed that was conducted after the 2008 financial crisis, this is one of the uses of those dollar swap lines back then:\n “In October 2008, according to Federal Reserve Board staff, the Federal Reserve Board allowed the Swiss National Bank [the central bank of Switzerland] to use dollars under its swap line agreement to provide special assistance to UBS, a large Swiss banking organization. Specifically, on October 16, 2008, the Swiss National Bank announced that it would use dollars obtained through its swap line with FRBNY [Federal Reserve Bank of New York] to help fund an SPV [Special Purpose Vehicle] it would create to purchase up to $60 billion of illiquid assets from UBS.”\n UBS is a major investment bank and trading house and a major player on Wall Street. It purchased the large U.S. retail brokerage firm, PaineWebber, in 2000. The UBS Dark Pool, the equivalent of a thinly regulated stock exchange operating internally within UBS, has been one of the largest traders in Wall Street bank stocks.\n The Federal Reserve Board of Governors has put the New York Fed in charge of the bulk of these bailout programs. Its conflicts are legion. (See related articles below.) It’s time for Congress to stop the Fed from repeating its Big Lie that it’s going out of its way to be transparent and force it to cough up the names and dollars amounts of the recipients of these loans.", "posttime": "2020-06-22 23:03:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "移交,turn,美联储", "title": "4540亿美元中的3400亿美元姆努钦将移交给美联储，但下落不明", "title_en": "$340B of $454B Mnuchin Was to Turn over to the Fed Is Unaccounted For", "transed": 1, "url": "https://wallstreetonparade.com/2020/06/340-billion-of-the-454-billion-that-mnuchin-was-to-turn-over-to-the-fed-is-unaccounted-for/", "via": "", "real_tags": ["移交", "turn", "美联储"]}, {"category": "", "categoryclass": "", "imagename": "13b564ff7381912ff0be3b2bc175429d.jpeg", "infoid": 1007646, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "路透法兰克福/马尼拉8月23日电-Wirecard周一表示，其账户中失踪的19亿欧元(21亿美元)可能永远不存在，该公司正在考虑出售或关闭部分业务，以避免迫在眉睫的现金紧缩.。\n这家前德国股市宠儿为Visa和万事达卡(Mastercard)等公司处理支付业务，最近几天其价值蒸发了数十亿欧元，并开始在法兰克福交易，跌幅达40%。\nWirecard正忙于支撑其财务状况，并已任命投资银行Houlihan Lokey与债权人达成协议。上周五，评级机构穆迪(Moody‘s)将Wirecard的信用评级大幅下调至“垃圾”。\n在周一的一份声明中，Wirecard还撤回了2019年的财务报表，并表示正在研究削减成本，以应对这场危机。这场危机曾被誉为德国科技行业相对罕见的成功故事。\n“Wirecard的管理委员会评估.。银行信托账户余额19亿欧元很可能不存在，“它说。\nWirecard周四表示，审计师安永(EY)拒绝签署其2019年的账目，因为它无法确认信托账户中存在19亿欧元的现金余额，约占其资产负债表的四分之一。\n近年来，安永(EY)经常批准Wirecard的账户，该公司拒绝签署2019年协议，证实了毕马威(KPMG)4月份的一项外部调查发现的失败之处，随后英国“金融时报”发布了调查报告。\nWirecard的最新声明发布之前，前首席执行官马库斯·布劳恩(Markus Braun)上周五离职，由德国证券交易所前合规官詹姆斯·弗里斯(James Freis)接替。\n自从一名举报人声称该公司的成功部分归因于虚假交易网络以来，该公司一直受到密切关注。这在寻找失踪的现金时达到了顶峰，在菲律宾陷入了死胡同。\n菲律宾央行表示，似乎没有一笔资金进入该国，此前菲律宾群岛银行(BPI)和BDO Unibank表示，据称显示Wirecard在他们那里存入资金的文件是虚假的。两人都表示，Wirecard不是客户。\nBPI告诉路透社，它已经将一名助理经理停职，这名助理经理的签名出现在其中一份文件上，而BDO告诉央行，其一名营销人员似乎伪造了一份银行证书。\n周一，Pilipinas总裁Benjamin Diokno对ANC电视频道表示：“央行实际上正在进行自己的调查。”(Bangko Sentral Ng Pilipinas)行长本杰明·迪奥克诺(Benjamin Diokno)。\n总部位于慕尼黑的Wirecard被誉为金融科技在本土取得的成功，并于2018年被推入德国蓝筹股DAX指数。Mirabaud的分析师表示，其DAX成员资格现在完全不合适，应该进行审查。\n一些人担心愈演愈烈的丑闻会损害德国的声誉，联邦议院议员法比奥·德·马西(Fabio De Masi)表示，该国的金融监管机构Bafin失职。\nWirecard既是向消费者发行真实和“虚拟”支付卡的机构，也是代表商家进行收购的机构。\n该公司曾将自己定位为一个通用支付平台，定位于从数字支付的增长中获利。它还为商家和消费者推出了智能手机支付应用。", "note_en": "FRANKFURT/MANILA (Reuters) - Wirecard said on Monday that 1.9 billion euros ($2.1 billion) missing from its accounts was likely never there and it was looking at the sale or closure of parts of its business as it sought to avert a looming cash crunch.\n The former German stock market darling, which processes payments for companies including Visa and Mastercard, has seen billions of euros wiped off its value in recent days and began trading in Frankfurt down 40%.\n Wirecard is scrambling to shore up its finances and has appointed investment bank Houlihan Lokey as it seeks a deal with creditors, after seeing its credit rating slashed to ‘junk’ by rating agency Moody’s on Friday.\n In a statement on Monday, Wirecard also withdrew financial statements for 2019 and said it was examining cost cuts to address the crisis which has engulfed what was once hailed as a relatively rare success story for the German technology sector.\n “The Management Board of Wirecard assesses ... that there is a prevailing likelihood that the bank trust account balances in the amount of 1.9 billion EUR do not exist,” it said.\n Wirecard said on Thursday that auditor EY had refused to sign off its 2019 accounts as it was unable to confirm the existence of 1.9 billion euros in cash balances in trust accounts, about a quarter of its balance sheet.\n EY had regularly approved Wirecard’s accounts in recent years, and its refusal to sign off for 2019 confirmed failings found in an external investigation by KPMG in April, which in turn followed investigative reports by the Financial Times.\n  Wirecard’s latest announcement follows the exit on Friday of former chief executive Markus Braun, who was replaced by James Freis, an ex-compliance officer at Germany’s stock exchange.\n The company has been under scrutiny since a whistleblower alleged that it owed its success in part to a web of sham transactions. This culminated in a search for the missing cash, which hit a dead end in the Philippines.\n The Philippine central bank said none of the money appeared to have entered the country, after Bank of the Philippine Islands (BPI) and BDO Unibank said documents purporting to show Wirecard had deposited funds with them were false. Both said Wirecard was not a client.\n BPI told Reuters it had suspended an assistant manager whose signature appeared on one of the documents, while BDO told the central bank one of its marketing officers appeared to have fabricated a bank certificate.\n “The central bank is actually doing its own investigation,” Bangko Sentral ng Pilipinas Governor Benjamin Diokno told television channel ANC on Monday.\n Munich-based Wirecard has been lauded as a home-grown fintech success and was propelled into Germany’s blue-chip DAX index in 2018. Analysts at Mirabaud said its DAX membership was now completely inappropriate and should be reviewed.\n Some fear the growing scandal will damage Germany’s reputation and Fabio De Masi, a lawmaker in the Bundestag, said the country’s financial watchdog Bafin had failed in its duty.\n  Wirecard operates both as an issuer of real and ‘virtual’ payment cards to consumers, and as an acquirer on behalf of merchants.\n The company had marketed itself as a universal payments platform positioned to profit from the growth in digital payments. It also launched smartphone payment apps for merchants and consumers.", "posttime": "2020-06-22 22:42:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "存在,existed,wirecard", "title": "Wirecard称失踪21亿美元从来不存在，撕毁了早先的账户", "title_en": "Wirecard Says Missing $2.1 Billion Never Existed, Rips Up Earlier Accounts", "transed": 1, "url": "https://www.reuters.com/article/us-wirecard-accounts-idUSKBN23T06V", "via": "", "real_tags": ["存在", "existed", "wirecard"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007645, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "通常有人会提出这样的建议：HTML不应该发展成今天这样的变异应用程序运行时。文档的表示关注点与应用程序呈现不同。javascript堆栈应该是完全独立的。我强烈认为我们应该创建一个轻量级的HTML fork，它同样是以文档为中心的，并且不允许所有这些javascript的胡言乱语。一些不允许愚蠢的自定义用户界面或行为跟踪的东西。只有文本、图像、视频和链接。绘制算法将非常简单，文档加载将闪电般的快，我们相信不会有广告恶意软件。\n我决定写这篇博文，而不是直接回复，这样下次我就可以再看一遍。这里有不正确的事实假设。文档的表现关注点与应用程序呈现不同；呈现是不正确的；有很多重叠，静态文档和交互式应用程序之间有一个连续体，用例一直都在这个连续体中。不允许愚蠢的自定义用户界面或行为跟踪的东西。仅仅文字、图像、视频和链接是矛盾的；嵌入的图像、视频和链接允许大量的跟踪和自定义UI。一个更大的问题是，定义HTML的静态分支很容易，但说服Web开发人员使用它才是真正的问题所在，而这是非常困难的，而且没有人知道如何做到这一点。当然，如果您确实找到了说服Web开发人员避免您不喜欢的功能的方法，那么定义一个特定的HTML静态子集就没有多大价值了。顺便说一下，我刚刚撒了部分谎。定义HTML的静态分支很容易，但我敢肯定，每个认为现代Web已经脱轨的人都有一个略微不同的应该允许的功能列表，所以让你的整个支持者就允许的功能的具体列表达成一致将是非常困难的。(例如，表单是否在该子集中？心满意足吗？录像？动画GIF？CSS：悬停？CSS媒体查询？对于这些问题，不同的人会给出不同的答案。)。有些人认为定义HTML的静态子集将使Web开发人员和用户受益，因为我们可以为该子集构建更高效的浏览器(或浏览器模式)。作为一名前Mozilla杰出工程师，我对此表示怀疑。即使像窗口大小更改这样的基本操作也需要增量重新布局的能力。任何类型的编辑或表单都需要支持DOM更改，递增加载文档的呈现也是如此。你可以走几条捷径，但在相同的内容上，你不会轻易击败现有浏览器的性能，特别是要记住，那些浏览器已经实现了令人难以置信的优化。我看到定义的静态HTML子集唯一可能的好处是，对于选择加入该子集的文档，浏览器可以将所有这些文档放入单个沙箱子进程中，而不是将它们拆分到每个站点的不同沙箱进程中，前提是这些文档对彼此的安全风险可以忽略不计。我不认为这是静态HTML子集倡导者最关心的问题。", "note_en": "Quite often someone proposes something like this: HTML should never have grown into the mutated application runtime it is today. The presentational concerns for documents are different from application rendering. The javascript stack should have been something entirely separate. I strongly feel we should create a lightweight HTML fork that is again document-centric and doesn&#39;t allow for all of this javascript nonsense. Something that doesn&#39;t allow for stupid custom UI or behavioural tracking. Just text, images, videos, and links. The painting algorithm would be dead simple, documents would load lightning fast, and we&#39;d be confident there would be no ad malware.\nRather than reply directly, I decided to write this blog post so I can refer to it again next time this comes up. There are incorrect factual assumptions here. &#34;The presentational concerns for documents are different from application rendering&#34; is incorrect; there&#39;s a lot of overlap, and there is a continuum between static documents and interactive applications, with use-cases all the way along that continuum. &#34;Something that doesn&#39;t allow for stupid custom UI or behavioural tracking. Just text, images, videos, and links&#34; is contradictory; embedded images, videos and links allow for lots of tracking and custom UI. A bigger issue is that defining a static fork of HTML is easy, but persuading Web developers to use it is where the real problem lies, and that is immensely difficult and no-one has any good ideas for how to do it. Of course, if you do find a way to persuade Web developers to avoid features you don&#39;t like, there isn&#39;t much value in defining a specific &#34;static subset&#34; of HTML. By the way, I just partially lied. Defining a static fork of HTML is easy, but I&#39;m sure everyone who thinks the modern Web has gone off the rails has a slightly different list of features that should be allowed, so getting your entire constituency to agree on a specific list of allowed features is going to be very difficult. (E.g., are forms in that subset? contenteditable? Video? Animated GIFs? CSS :hover? CSS media queries? Different people will give different answers to these questions.) Some people believe that defining a static subset of HTML would benefit Web developers and users because we could build a much more efficient browser (or browser mode) for that subset. As a former Mozilla distinguished engineer, I&#39;m skeptical. Even something as fundamental as window size changes requires the ability to do incremental relayout. Any kind of editing or forms requires support for DOM changes, as does rendering of incrementally loaded documents. You could take a few shortcuts but you won&#39;t easily beat the performance of existing browsers on the same content, especially keeping in mind the incredibly impressive optimizations those browsers have already implemented. The only possible benefit I can see of a defined static HTML subset is that for documents opting into that subset, browsers  might be able to put all those documents into a single sandboxed child process instead of splitting them into a different sandboxed process per site, on the assumption that these documents are a negligible security risk to each other. I don&#39;t think this is at the forefront of the minds of advocates for a static HTML subset.", "posttime": "2020-06-22 22:23:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "派生,html,文档", "title": "为什么将HTML派生为静态语言没有意义", "title_en": "Why Forking HTML into a Static Language Doesn't Make Sense", "transed": 1, "url": "https://robert.ocallahan.org/2020/05/why-forking-html-into-static-language.html", "via": "", "real_tags": ["派生", "html", "文档"]}, {"category": "", "categoryclass": "", "imagename": "46b566a8548fd684730b4028949183ff.jpg", "infoid": 1007644, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "接收日期：2020年5月25日/修订日期：2020年6月17日/接受日期：2020年6月18日/发布日期：2020年6月20日。\n在世界许多地区的前瞻性队列研究中，习惯喝咖啡与较低的疾病风险(如2型糖尿病、慢性肝病、某些癌症类型或降低全原因死亡率)之间的关联已得到证实。其分子机制尚不清楚。咖啡成分清除自由基和抗炎的活性太弱，无法解释这些影响。我们在这里争辩说，咖啡作为植物性食物与许多蔬菜和水果具有相似的有益特性。最近的研究已经确定了咖啡、蔬菜和水果共同的促进健康的机制，即激活适应性细胞反应，其特征是参与细胞保护的蛋白质上调，特别是抗氧化酶、解毒酶和修复酶。这种反应的关键是酚类植物化学物质激活Nrf2(核因子红系2相关因子-2)系统，诱导细胞防御基因的表达。咖啡在这方面起着主导作用，因为在发达国家，咖啡是酚酸和多酚的主要膳食来源。一种可能的支持作用可能是咖啡中未消化的益生菌成分对肠道微生物区系的调节，但可用的数据仍然很少。我们得出结论，咖啡促进健康的途径与其他蔬菜和水果相似。咖啡豆可以被视为健康的蔬菜食品和膳食酚类植物化学物质的主要供应商。查看全文。\n关键词：咖啡；植物化学物质；咖啡因；糖尿病；dna损伤；抗氧化剂；nrf2；微生物区系咖啡；植物化学物质；咖啡因；糖尿病；dna损伤；抗氧化剂；nrf2；微生物区系。\n►显示数字", "note_en": "Received: 25 May 2020 / Revised: 17 June 2020 / Accepted: 18 June 2020 / Published: 20 June 2020\n The association of habitual coffee consumption with a lower risk of diseases, like type 2 diabetes mellitus, chronic liver disease, certain cancer types, or with reduced all-cause mortality, has been confirmed in prospective cohort studies in many regions of the world. The molecular mechanism is still unresolved. The radical-scavenging and anti-inflammatory activity of coffee constituents is too weak to account for such effects. We argue here that coffee as a plant food has similar beneficial properties to many vegetables and fruits. Recent studies have identified a health promoting mechanism common to coffee, vegetables and fruits, i.e., the activation of an adaptive cellular response characterized by the upregulation of proteins involved in cell protection, notably antioxidant, detoxifying and repair enzymes. Key to this response is the activation of the Nrf2 (Nuclear factor erythroid 2-related factor-2) system by phenolic phytochemicals, which induces the expression of cell defense genes. Coffee plays a dominant role in that regard because it is the major dietary source of phenolic acids and polyphenols in the developed world. A possible supportive action may be the modulation of the gut microbiota by non-digested prebiotic constituents of coffee, but the available data are still scarce. We conclude that coffee employs similar pathways of promoting health as assumed for other vegetables and fruits. Coffee beans may be viewed as healthy vegetable food and a main supplier of dietary phenolic phytochemicals. View Full-Text\n Keywords:  coffee; phytochemicals; caffeine; diabetes; DNA damage; antioxidant; Nrf2; microbiota   coffee;  phytochemicals;  caffeine;  diabetes;  DNA damage;  antioxidant;  Nrf2;  microbiota\n  ► ▼Show Figures", "posttime": "2020-06-22 22:23:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "咖啡,effects", "title": "咖啡对健康的影响", "title_en": "Health Effects of Coffee", "transed": 1, "url": "https://www.mdpi.com/2072-6643/12/6/1842", "via": "", "real_tags": ["咖啡", "effects"]}, {"category": "", "categoryclass": "", "imagename": "b244013f8dadcbe1ee009c650489722d.png", "infoid": 1007643, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "6月19日周五深夜，苹果应用商店审核委员会批准了上周搁置的嘿iOS应用程序的漏洞修复，这让我们大吃一惊：\n(他们所指的推文是当晚我们刚刚延长两个小时的橄榄枝推文)。\n今天早上的第一件事是，我们向我们的客户发布了新批准的1.0.2错误修复更新。这对苹果来说是一场胜利，对我们来说也是一场胜利，对我们的客户来说也是一场胜利。\n当然，1.0.2不是我们打算发布到App Store的最后一个版本。我们希望继续发布更新，并尽最大努力将iOS版的嘿App做到最好。但在我们被明确允许这么做之前，苹果要求我们做一些改变。\n苹果负责全球营销的高级副总裁菲尔·席勒(Phil Schiller)告诉我们，他希望看到我们做出什么样的改变。他的主要反对意见是“你下载了这款应用程序，但它不起作用，这不是我们想在商店里看到的。”\n好吧。我们认为我们遵循了苹果ʼ对多平台软件即服务产品的不成文规定：没有注册，没有链接，没有提到在哪里注册。今天，App Store中的许多应用程序都是这样工作的，包括Netflix、Google、Salesforce和任天堂(Nintendo)长期批准的应用程序。\n但席勒随后表示，“嘿本可以走的一条路……是在App Store上提供免费或付费版本的应用程序，带有基本的电子邮件阅读功能，然后在自己的网站上单独提供升级后的电子邮件服务，与iOS上的嘿应用程序配合使用。”因此，我们开始认真工作，并在周末工作，以便在周一早上获得苹果办公桌上的最新消息。我们的团队很好地实现了席勒要求的产品更改，今天早上的第一件事就是，在我们将1.0.2交付给客户之后，我们向App Store提交了1.0.3以供批准。\n这个新版本为iOS应用程序引入了一个新的免费选项。现在，用户可以直接在应用内注册一个免费的、临时的、随机的@hey.com电子邮件地址，有效期为14天。把它想象成你在旅行时买的一张临时SIM卡。或者当你不想给出你的真实电子邮件地址时，比如一个短期的“待售”列表，就像Craigslist那样。\n我们还加快了我们的多用户嘿for work服务的速度，在这种服务中，公司付钱，但员工不付钱。这使得嘿与Basecamp以及其他几十个在App Store允许了十年的高调多平台企业服务保持一致。我们刚刚完成了多家公司的入职，我们所有的Basecamp公司电子邮件都通过嘿运行，而且已经有数千家企业加入了嘿的工作等待名单。嘿，工作用的是和其他人一样的iOS应用。\n因此，现在我们提供了这个新的免费选项，以及多用户嘿for Work-所有这些都在同一个iOS应用程序中。我们相信，这些改进将满足席勒对用户体验和商业模式的担忧。希望这也能为像我们这样的其他多平台SaaS服务铺平一条可预测的道路。\n我们和苹果一样关心用户体验，这是一个很好的折衷方案。苹果的iOS用户可以注册新的免费版本的嘿，我们可以继续对所有客户给予同样的特殊照顾，无论平台是什么。此外，iOS客户可以使用一项流行的新电子邮件服务，该服务包含我们承诺追求的所有错误修复和新功能，而不必支付比其他平台客户更高的价格。\n菲尔，我们为你留出了一个令人惊叹的@hey.com地址。终身免费，我们送给您的礼物。让我知道。", "note_en": "Late Friday night, on June 19th, Apple’s App Store Review Board surprised us by approving the pending bug fixes to the HEY iOS app that were held up all last week:\n  (The tweets they refer to were  the olive-branch tweets we extended just two hours earlier that night)\n  First thing this morning, we released the newly-approved 1.0.2 bug-fix update to our customers. A win for Apple, a win for us, and a win for our customers.\n But of course 1.0.2 isn’t the last version we intend to ship to the App Store. We want to continue shipping updates, and putting in our best effort to make the HEY App for iOS the best it can be. But before we’re definitively allowed to do that, Apple asked us make some changes.\n Phil Schiller, Apple’s Senior Vice President of Worldwide Marketing,  told us the kind of changes he’d love to see us make. His primary objection \twas “You download the app and it doesn’t work, that’s not what we want on the store.”\n Okay. We thought we were following Appleʼs unwritten rules for multi-platform SaaS products: No signups, no links, no mentions of where to sign up.  Plenty of applications in the App Store work exactly like this today, including long-approved apps from Netflix, Google, Salesforce, and Nintendo.\n But  then Schiller said “One way that HEY could have gone...is to offer a free or paid version of the app with basic email reading features on the App Store, then separately offered an upgraded email service that worked with the Hey app on iOS on its own website.” So we got down to it, and worked the weekend to get an update on Apple’s desk Monday morning. Our team did a great job implementing the product changes that Schiller asked for, and first thing this morning, right after we shipped 1.0.2 to our customers, we submitted 1.0.3 to the App Store for approval.\n This new version introduces a new free option for the iOS app. Now users can sign up directly in-app for a free, temporary, randomized @hey.com email address that works for 14 days. Think of it like a temporary SIM card you buy when traveling. Or for when you don’t want to give out your real email address, like a short term “for sale” listing, like Craigslist does it.\n We’ve also accelerated our multi-user HEY for Work offering where the company pays but the employees don’t. This brings HEY in line with Basecamp, and dozens of other high profile multi-platform enterprise offerings that have been permitted in the App Store for a decade. We just completed onboarding multiple companies, we’re running all our Basecamp company email through HEY, and thousands of businesses have joined  the HEY for Work waitlist already. HEY for Work uses the same iOS app as everyone else.\n So now we offer this new free option, and the multi-user HEY for Work — all in the same iOS app. We’re confident these improvements will satisfy Schiller’s concerns about both the user experience and business model. Hopefully this paves a predictable path for other multi-platform SaaS services like ours as well.\n We care as much about the user experience as Apple, and this is a good compromise. Apple’s iOS customers can sign up for a new free version of HEY, and we can continue to  take the same exceptional care of all our customers, regardless of platform. Plus, iOS customers get access to a popular new email service with all the bug fixes and new features we’ve committed to pursue, without having to pay higher prices than customers on other platforms.\n And Phil, we set aside an amazing @hey.com address for you. Free for life, our gift to you. Lemme know.", "posttime": "2020-06-22 22:22:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,前进,hey,服务", "title": "苹果，嘿，还有前进的道路", "title_en": "Apple, Hey, and the Path Forward", "transed": 1, "url": "https://hey.com/apple/path/", "via": "", "real_tags": ["苹果", "apple", "前进", "hey", "服务"]}, {"category": "", "categoryclass": "", "imagename": "ff03be275fa4479793949fd507723c35.jpeg", "infoid": 1007642, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个实现比用Python编写的竞争对手快一到两个数量级，能够在带有GPU的标准台式计算机上解决琐碎的游戏。\nDeepMind的AlphaZero算法除了在国际象棋和围棋等游戏中达到超人水平这一广为人知的成功之外，还展示了一种更通用的方法，将学习和搜索结合起来，有效地探索更大的组合空间。我们相信，这种方法论在许多不同的研究领域都会有令人兴奋的应用。\n由于AlphaZero非常耗费资源，成功的开源实现(如Leela Zero)都是用低级语言(如C++)编写的，并针对高度分布式的计算环境进行了优化，这使得学生、研究人员和黑客很难访问它们。\n这个项目的动机是提供一个AlphaZero的实现，它足够简单，可以广泛访问，同时也足够强大和快速，可以在有限的计算资源上进行有意义的实验。我们发现Julia语言在实现这一目标方面发挥了重要作用。\nGit克隆https://github.com/jonathan-laurent/AlphaZero.jl.gitcd AlphaZero.jljulia--项目-e&34；导入包；Pkg.instantiate()&#34；jia--项目--color=yes脚本/alphazero.jl--游戏连接-4系列。\n在配备英特尔酷睿i5 9600K处理器和8 GB nVidia RTX2070 GPU的台式计算机上，每次培训迭代需要一到两个小时。我们在下面绘制了AlphaZero代理相对于两条基线(一条普通的MCTS基线和一条使用手工设计的启发式在深度5计划的minmax代理)的胜率演变图：\n注意，AlphaZero代理在培训期间不会接触到基线，完全是通过自我发挥学习的，没有任何形式的监督或事先的知识。\n我们还评估了神经网络单独在相同基线下的性能。我们不是将其插入到MCTS中，而是在每个状态下播放分配有最高先验概率的操作：\n不出所料，该网络一开始无法赢得任何一场比赛，然而，尽管不能执行任何搜索，它最终仍明显强于minmax基线。\n有关使用AlphaZero.jl培训Connect 4代理的更多信息，请参阅我们的完整教程。\n非常欢迎对AlphaZero.jl的贡献。在我们的投稿指南中有很多投稿的想法。请不要犹豫，打开一期Github来分享任何想法、反馈或建议。\n本材料基于美国空军和美国国防部高级研究计划局(DARPA)根据第号合同支持的工作。FA8750-18-C-0092。本材料中表达的任何观点、发现和结论或建议均为作者的观点，不一定反映美国空军和DARPA的观点。", "note_en": "Being between one and two orders of magnitude faster than competingalternatives written in Python, this implementation enables to solvenontrivial games on a standard desktop computer with a GPU.\n  Beyond its much publicized success in attaining superhuman level at gamessuch as Chess and Go, DeepMind&#39;s AlphaZero algorithm illustrates a moregeneral methodology of combining learning and search to explore largecombinatorial spaces effectively. We believe that this methodology canhave exciting applications in many different research areas.\n  Because AlphaZero is resource-hungry, successful open-sourceimplementations (such as  Leela Zero)are written in low-level languages (such as C++) and optimized for highlydistributed computing environments.This makes them hardly accessible for students, researchers and hackers.\n The motivation for this project is to provide an implementation ofAlphaZero that is simple enough to be widely accessible, while also beingsufficiently powerful and fast to enable meaningful experiments on limitedcomputing resources.We found the  Julia language to be instrumental in achieving this goal.\n   git clone https://github.com/jonathan-laurent/AlphaZero.jl.gitcd AlphaZero.jljulia --project -e &#34;import Pkg; Pkg.instantiate()&#34;julia --project --color=yes scripts/alphazero.jl --game connect-four train\n   Each training iteration takes between one and two hours on a desktopcomputer with an Intel Core i5 9600K processor and an 8GB Nvidia RTX2070 GPU. We plot below the evolution of the win rate of our AlphaZero agent against two baselines (a vanilla MCTS baseline and a minmax agent that plans at depth 5 using a handcrafted heuristic):\n    Note that the AlphaZero agent is not exposed to the baselines during training andlearns purely from self-play, without any form of supervision or prior knowledge.\n We also evaluate the performances of the neural network alone against the samebaselines. Instead of plugging it into MCTS, we play the action that isassigned the highest prior probability at each state:\n    Unsurprisingly, the network alone is initially unable to win a single game.However, it ends up significantly stronger than the minmax baseline despite notbeing able to perform any search.\n For more information on training a Connect Four agent using AlphaZero.jl, see our full  tutorial.\n    Contributions to AlphaZero.jl are most welcome. Many contribution ideas are available in our  contribution guide.Please do not hesitate to open a Github issue to shareany idea, feedback or suggestion.\n  This material is based upon work supported by the United States Air Force andDARPA under Contract No. FA8750-18-C-0092. Any opinions, findings andconclusions or recommendations expressed in this material are those of theauthor(s) and do not necessarily reflect the views of the United StatesAir Force and DARPA.", "posttime": "2020-06-22 22:22:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,julia,alphazero,implementation", "title": "DeepMind的AlphaZero算法在Julia中的快速实现", "title_en": "Fast implementation of DeepMind's AlphaZero algorithm in Julia", "transed": 1, "url": "https://github.com/jonathan-laurent/AlphaZero.jl", "via": "", "real_tags": ["算法", "julia", "alphazero"]}, {"category": "", "categoryclass": "", "imagename": "db15d0cd49be4cb18e8a6d2c617e8a4a.jpg", "infoid": 1007641, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着呆在家里的订单减少，城市重新开业，许多医生和医院管理人员呼吁迅速将医疗保健恢复到大流行前的水平。几个月来，常规护理一直被推迟。选择性程序-赚钱的大手笔-被停止，这样医院就可以将资源转移到治疗新冠肺炎患者上。常规的诊所就诊被取消或取而代之的是在线会议。这给医院和诊所造成了严重的经济损失。医疗诊所已经关门了。医院被迫让员工休假或削减工资。\n另一方面，大多数患者，至少是那些慢性病稳定的患者，似乎都做得不错。在最近的一项调查中，只有十分之一的受访者表示，他们的健康或家庭成员的健康因延误治疗而恶化。86%的人表示，他们的健康状况大致保持不变。\n诚然，推迟医疗对一些非新冠肺炎疾病的患者的健康造成了可怕的后果，比如那些新诊断的癌症患者因为门诊被取消而没有得到治疗，或者是因为患者出于对感染冠状病毒的恐惧而避免去医院。在危机期间，纽约等大城市的死亡人数激增，几乎肯定包括这样的患者。\n尽管如此，绝大多数患者的情况似乎比大多数医生预期的要好。可能需要数年时间才能理解其中的原因。也许病人可以通过采取健康的行为来减轻延误护理的危害，比如减少吸烟和多锻炼。也许压力的巨大增加被其他事情所抵消，比如花更多的时间与所爱的人在一起。\n然而，还有一个更令人不安的解释需要考虑：也许美国人不需要他们的医生习惯提供的医疗量。\n众所周知，美国大量的医疗保健是浪费的，占医疗保健预算总额的数千亿美元。造成医疗浪费的原因有很多：医生试图避免诉讼的“防御性”药物；医生和患者不愿接受诊断的不确定性(这会导致更多的检查)；美国医生和医院收取的过高价格(至少与其他国家的收费相比是如此)；对哪些治疗有效缺乏共识；以及普遍认为更新、更昂贵的技术总是更好的信念。“。\n造成医疗浪费的最重要因素之一是某些地区的人均医疗服务供给过多。例如，在专科医生密集的迈阿密-戴德县，医疗保险的人均支出是新墨西哥州圣达菲的两倍多，这主要是因为那里的人均医生服务利用率更高。可悲的是，更多的关怀并不总是带来更好的结果。\n如果有益的常规护理在大流行封锁的过去几个月里减少了，那么它的恶性对应的不必要的护理可能也是如此。如果是这样的话，这对我们应该如何重新开放我们的医疗保健系统有一定的影响。医生和医院将希望加强护理，以弥补收入的损失。但这并不能满足我们病人的需要。\n初创公司应该重新承诺促进有益的护理并消除不必要的护理。大多数医生都认识到这一区别的重要性，即使我们并不总是采取行动。在几年前的一项调查中，三分之二的美国医生承认15%到30%的医疗保健可能是不必要的。\n医学会已经列出了必要的和最好避免的程序清单。后者包括大多数下腰痛的核磁共振扫描和没有心脏病迹象的核负荷测试。随着医院和诊所对非新冠肺炎的护理重新开放，这样的名单应该得到更广泛的宣传。\n病人也扮演着重要的角色。研究表明，在一些专科中，高达20%的手术是不必要的。如果你的手术是因为大流行而推迟的，那么有必要和你的医生谈谈是否还需要做手术。尽管今天的疾病很复杂，但有时疾病确实会自行好转。在某些情况下，预定的手术从一开始就没有必要。\n许多机构正在利用我们国家历史上的这段艰难时期做出改变。医疗保健系统也应该这样做。这场大流行让我们看到了一个世界，在这个世界上，我们的医疗保健系统一切照旧被颠覆了。它还提供了一个以更健康和更具财务责任感的方式重新启动的机会。条件反射地回到现状可能对我们的底线有好处，但对我们的病人没有很好的服务。\n桑迪普·焦哈尔(@sjauhar)是一位心脏病专家，也是一位观点撰稿人，最近出版了“心脏：历史”(Heart：a History)一书。\n“泰晤士报”致力于向编辑发表各种信件。我们想听听您对这篇文章或我们的任何一篇文章的看法。这里有一些小贴士。这是我们的电子邮件：Letters@nytimes.com。", "note_en": "As stay-at-home orders ease and cities reopen for business, many doctors and hospital administrators are calling for a quick return of health care to pre-pandemic levels. For months now, routine care has been postponed. Elective procedures — big moneymakers — were halted so that hospitals could divert resources to treating Covid-19 patients. Routine clinic visits were canceled or replaced by online sessions. This has resulted in grievous financial losses for hospitals and clinics. Medical practices have closed. Hospitals have been forced to furlough employees or cut pay.\n Most patients, on the other hand, at least those with stable chronic conditions, seem to have done OK. In a recent  survey, only one in 10 respondents said their health or a family member’s health had worsened as a result of delayed care. Eighty-six percent said their health had stayed about the same.\n Admittedly, postponing health care had terrible health consequences for some patients with non-Covid-19 illnesses, such as those with newly diagnosed cancers that went untreated because outpatient visits were canceled, or because patients avoided going to the hospital out of fear of contracting the coronavirus. The spike in deaths in major cities like New York during the crisis almost certainly includes such patients.\n Still, a vast majority of patients seem to have fared better than what most doctors expected. It will probably take years to understand why. Perhaps patients mitigated the harm of delayed care by adopting healthful behaviors, such as smoking less and exercising more. Perhaps the huge increases in stress were balanced out by other things, such as spending more time with loved ones.\n However, there is a more troubling explanation to consider: Perhaps Americans don’t require the volume of care that their doctors are used to providing.\n It is well recognized that a substantial amount of health care in America is wasteful, accounting for hundreds of billions of dollars of the total health care budget. Wasteful care is driven by many forces: “defensive” medicine by doctors trying to avoid lawsuits; a reluctance on the part of doctors and patients to accept diagnostic uncertainty (which leads to more tests); the exorbitant prices that American doctors and hospitals charge, at least compared to what is charged in other countries; a lack of consensus about which treatments are effective; and the pervasive belief that newer, more expensive technology is always better.\n One of the most significant factors in wasteful health care is having too much supply of health care per capita in certain areas. In specialist-heavy Miami-Dade County, for example, Medicare  spends more than twice per person what it spends in Santa Fe, N.M., largely because there is more per capita utilization of doctors’ services. Sadly, more care doesn’t always result in better outcomes.\n If beneficial routine care dropped during the past few months of the pandemic lockdown, so perhaps did its malignant counterpart, unnecessary care. If so, this has implications for how we should reopen our health care system. Doctors and hospitals will want to ramp up care to make up for lost revenue. But this will not serve our patients’ needs.\n The start-up should begin with a renewed commitment to promoting beneficial care and eliminating unnecessary care. Most doctors recognize the importance of this distinction, even if we don’t always act on it. In a survey a few years ago, two-thirds of doctors in the United States  admitted that between 15 percent and 30 percent of health care is probably unnecessary.\n Medical societies already produce lists of procedures that are essential and those that are better avoided. The latter  include M.R.I. scans for most lower-back pain and nuclear stress tests when there are no signs of heart disease. As hospitals and clinics reopen for non-Covid-19 care, such lists should be more widely publicized.\n Patients have an important role to play, too. Studies  suggest that up to 20 percent of surgeries in some specialties are unnecessary. If your surgery was postponed because of the pandemic, it is worth having a conversation with your doctor about whether it is still needed. Despite the complexity of disease today, ailments sometimes do get better by themselves. And in some cases, scheduled surgeries weren’t necessary in the first place.\n Many institutions are using this difficult time in our nation’s history to make changes. The health care system should do the same. The pandemic has given us a glimpse of a world in which business as usual in our health care system was upended. It has also provided an opportunity to start up again in a healthier and more financially responsible way. Reflexively returning to the status quo may be good for our bottom line, but it won’t serve our patients well.\n Sandeep Jauhar ( @sjauhar) is a cardiologist, a contributing Opinion writer and the author, most recently, of “Heart: A History.”\n The Times is committed to publishing   a diversity of letters  to the editor. We’d like to hear what you think about this or any of our articles. Here are some   tips . And here’s our email:   letters@nytimes.com .", "posttime": "2020-06-22 22:21:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "看起来,stopped,医生", "title": "人们已经不去看医生了，大多数人看起来都很好。", "title_en": "People have stopped going to the doctor and most seem fine", "transed": 1, "url": "https://www.nytimes.com/2020/06/22/opinion/coronavirus-reopen-hospitals.html", "via": "", "real_tags": ["看起来", "stopped", "医生"]}]