[{"category": "", "categoryclass": "", "imagename": "880d14e34a55514fec736fced64af906.jpg", "infoid": 1069815, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有问题的具体合同涉及为人类着陆系统计划开发月球着陆器，该计划旨在自阿波罗时代以来首次将人类送回月球。 NASA 于 2020 年 4 月宣布，在合同的初始阶段选择了 Blue Origin、SpaceX 和 Dynetics，并认为竞争可能会缩减为两家最终公司来建造月球着陆器。正如 TechCrunch 的 Darrell Etherington 指出的那样，NASA 选择两家供应商的情况并不少见，就像它在其商业船员计划下授予波音和 SpaceX 合同时所做的那样。但一年后，美国宇航局宣布，它只选择了一家公司来签订合同，这与历史惯例背道而驰：SpaceX。这家由埃隆·马斯克 (Elon Musk) 领导的公司为其着陆器提出了 28.9 亿美元的计划——约占蓝色起源 59.9 亿美元计划的一半。贝索斯现在提出将这一价格标签削减 20 亿美元。在华盛顿邮报获得的一份文件中，美国宇航局在解释为 HLS 合同选择唯一供应商背后的理由时承认，它“当前的财政年度预算甚至不支持一项[合同]授予。”作为回应，SpaceX 更新了其付款时间表，使其符合“美国宇航局目前的预算”。该机构面临严重的预算限制已不是什么秘密：国会在 2021 财年仅批准了 8.5 亿美元用于 HLS 计划，远低于 NASA 要求的 34 亿美元。输入贝索斯给美国宇航局局长比尔纳尔逊的公开信，它直接解决了预算问题。他写道，提议的激励措施将解决人类着陆系统计划中“感知到的近期预算问题”，该计划导致 NASA 选择一家公司而不是两家公司。贝索斯在信中说：“该机构没有按照最初的计划投资两个相互竞争的月球着陆器，而是选择授予 SpaceX 多年、数十亿美元的先机。” “这一决定打破了美国宇航局成功商业太空计划的模式，结束了未来几年有意义的竞争。”这不是 Blue Origin 第一次公开质疑 NASA 只与一家供应商合作的决定。该公司与 Dynetics 一起，在宣布该奖项后仅一周就向政府问责办公室提出抗议。 Blue Origin 辩称，合同要求并没有赋予公司“有意义地竞争”的能力。 GAO 必须在 8 月 4 日之前对抗议做出裁决。Blue Origin 和 Dynetics 并不是唯一支持两项合同授予的实体。据太空新闻报道，参议院最近通过了一项法案，除其他事项外，该法案要求 NASA 为 HLS 着陆器选择两家公司，并为此提供额外资金。然而，并非每个立法者都对包含额外资金感到高兴：参议员伯尼桑德斯称其为“贝索斯救助”，但最终未能从法案中剥离额外资金。\n贝索斯说：“我们随时准备帮助 NASA 降低技术风险并解决其预算限制，并使 Artemis 计划重新走上更具竞争力、可信度和可持续性的道路。”", "note_en": "The specific contract in question relates to developing a lunar lander for the Human Landing System program, which aims to return humans to the moon for the first time since the Apollo days. NASA announced in April 2020 that Blue Origin, SpaceX and Dynetics were chosen for  the initial phase of the contract, and it was thought that the competition would likely be whittled down to two final companies to build lunar landers. As TechCrunch’s  Darrell Etherington notes, it’s not uncommon for NASA to select two vendors, as it did when it awarded both Boeing and SpaceX contracts under its Commercial Crew program.\n But a year later, in a move that veered from historical practice, NASA announced  it had selected just one company for the contract: SpaceX. That company, headed by Elon Musk, proposed a $2.89 billion plan for its lander – around half of Blue Origin’s $5.99 billion proposal. Bezos is now offering to cut that price tag by $2 billion.\n  In a document obtained by  The Washington Post explaining the rationale behind selecting a sole vendor for the HLS contract, NASA admits that it’s “current fiscal year budget did not support even a single [contract] award.” In response, SpaceX updated its payment schedule so it would fit “within NASA’s current budget.” That the agency has severe budgetary constraints is no secret: Congress approved just $850 million for the HLS program in fiscal year 2021, far short of the $3.4 billion NASA requested.\n  Enter  Bezos’ open letter to NASA Administrator Bill Nelson, which addresses the budget issue directly. He writes that the proposed incentives would remedy “perceived near-term budgetary issues” with the Human Landing System Program, which caused NASA to select a single company instead of two.\n “Instead of investing in two competing lunar landers as originally intended, the Agency chose to confer a multi-year, multi-billion-dollar head start to SpaceX,” Bezos says in the letter. “That decision broke the mold of NASA’s successful commercial space programs by putting an end to meaningful competition for years to come.”\n This is not the first time that Blue Origin has publicly questioned NASA’s decision to go with just one vendor. The company, along with Dynetics, filed protests with the Government Accountability Office just one week after the award was announced. Blue Origin argued that the contract requirements did not give companies an ability to “meaningfully compete.” GAO must rule on the protest by August 4.\n Blue Origin and Dynetics are not the only entities to support two contract awards. The Senate recently passed a bill that would, among other things, require NASA to select two companies for the HLS lander – and the extra funds to do so,  SpaceNews reported. Not every lawmaker was happy about the inclusion of the extra funding, however: Senator Bernie Sanders called it a “Bezos bailout,” but was ultimately unsuccessful in getting the extra funding stripped from the bill.\n “We stand ready to help NASA moderate its technical risks and solve its budgetary constraints and put the Artemis Program back on a more competitive, credible, and sustainable path,” Bezos said.", "posttime": "2021-07-26 23:38:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nasa,美国,美国宇航局,offers,计划", "title": "贝索斯为美国宇航局的月球着陆器合同提供数十亿美元的奖励", "title_en": "\n\t\t\t\tBezos offers billions in incentives for NASA’s lunar lander contract\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/26/bezos-offers-billions-in-incentives-for-nasas-lunar-lander-contract/", "via": "", "real_tags": ["nasa", "美国", "美国宇航局", "offers", "计划"]}, {"category": "", "categoryclass": "", "imagename": "b3acb64cef8b906536890689b16fdf05.jpg", "infoid": 1069814, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Queenly 将自己视为正装的“StockX”，但在奢侈品转售市场上占有一席之地。这家初创公司让消费者在平台上列出他们用过的衣服——无论是婚礼、舞会还是选美——以折扣价出售给其他人。然后，当一件衣服售出时，卖家会赚取标价的 80% 左右，而买家则会得到一件无论如何都不会穿过的独特衣服。在一份声明中，A16z 的 Chan 表示，她亲身体验了“正装市场在技术上的独特性，但服务不足。”这位投资者指出，合身程度不那么重要，因为人们通常依赖于变化，但独特性很重要。她还赞扬了 Queenly 联合创始人 Trisha Bantigue 和 Kathy Zhou 在选美上的经验，这些经验已经进入最终产品。果然，联合创始人将大量精力投入到一种旨在帮助买家找到最适合他们的衣服的算法上，其搜索功能比零售店和 Poshmark 等竞争对手更能包括尺寸和肤色。 “这些只是我们知道的一些事情，因为我们是女性，我们知道如何为女性打造这种产品，”周在之前的一次采访中说。 “与如果这是一位男性创始人相反，他们不会知道这甚至是女性会寻找的东西。”转售市场面临着自身的挑战，其中最大的挑战通常是质量保证。对于价格在 300 美元或以下的连衣裙，Queenly 会获得状况证明照片，然后允许卖家直接发货给买家。价值 300 美元以上的连衣裙由公司自己处理，质量保证团队会更仔细地检查连衣裙的状况。 Queenly 于 2021 年冬季从 Y Combinator 毕业，当时正值冠状病毒大流行。尽管没有面对面的活动，但联合创始人表示，由于 Zoom 婚礼、Twitch 选美和远离社交的毕业典礼，他们的销售额达到了 50 万。 Queenly 也有一些小型化装企业，他们正在寻找一种数字解决方案来吸引 ubuyers，在网站上列出他们的库存。这一增长帮助这家初创公司在仍处于加速器阶段的时候筹集了 80 万美元，从包括 Stitch Fix 前首席运营官 Mike Smith、优步前首席技术官 Thuan Pham 和 Samsclub.com 和 Walmart.com 前首席运营官 Kelly Thompson 在内的投资者那里获得了 80 万美元。该公司随后以 230 万美元完成了第一轮种子轮融资，并吸引了 Dragon Capital 和其他投资者。\n现在，三个月后，Queenly 将种子轮融资扩大了几百万。该公司拒绝透露其新的估值或销量，但确实表示，Queenly 平台上的连衣裙数量已从 2 月份的 50,000 件增加到现在的 7 月份的 60,000 件。根据《福布斯》杂志，Queenly 还与美国小姐组织建立了合作伙伴关系，这将通过参赛者将他们的衣服上传到平台来帮助扩大其足迹。当然，连衣裙并不是销售额的同义词——但如果有数百万人，这家初创公司可能有能力将这种影响转化为真正的美元。", "note_en": "Queenly sees itself as a “StockX” for formalwear, but has its own hold on the resale market for luxury goods. The startup gets consumers to list their used dresses – whether it be from weddings, proms, or pageants – on the platform to sell at a discounted price to others. Sellers then make about 80% of the listed price when a dress is sold, while buyers get a unique dress that wouldn’t have been worn gain anyways.\n  In a statement, A16z’s Chan said that she experienced “firsthand how unique but underserved the formalwear market is by technology.” The investor noted how fit is less important because people often rely on alterations, but uniqueness matters. She also credited the experience that the Queenly co-founders Trisha Bantigue and Kathy Zhou both have at pageants, which has made its way into the end-product.\n Sure enough, the co-founders have put much of their energy into an algorithm designed to help buyers find the best dress for them, with search capabilities that are meant to be more inclusive of size and skin color than competitors like retail stores and Poshmark.\n “These are just some things that we know because we’re women, and we know how to build this product for women,” Zhou said in a previous interview. “As opposed to if this was a male founder, they would not know that that would even be something that women would search for.”\n The resale marketplace comes with its own challenges, the biggest of which can often be quality assurance. For dresses priced at $300 or less, Queenly gets proof photos of condition and then allows sellers ship directly to buyers. Dresses above $300 are routed through the company’s own operation, where a qualiy assurance team more closely checks for the condition of the dress.\n Queenly  graduated from Y Combinator in Winter 2021, in the thick of the coronavirus pandemic. Despite the lack of in-person events, the co-founders said that they had half a million in sales, thanks to Zoom weddings, Twitch pageants and socially-distant graduations. Queenly also got small fancy dress businesses, looking for a digital solution to get ubuyers, to list their inventory on the site.\n The growth helped the startup raise while still in the accelerator, landing $800,000 from investors including Mike Smith, former COO of Stitch Fix, Thuan Pham, former CTO of Uber, and Kelly Thompson, former COO of Samsclub.com and Walmart.com. The company then closed the first bit of  its seed round at $2.3 million, bringing on Dragon Capital along with other investors.\n Now, three months later, Queenly has extended that seed round by a few million. The company declined to disclose its new valuation or sales volume, but did say that number of dresses on Queenly’s platform have grown from 50,000 in February to 60,000 now, in July. Queenly also landed a partnership,  per Forbes, with the Miss USA organization, which will help grow its footprint through contestants uploading their dresses to the platform. Of course, dresses aren’t synonymous with sales – but with millions more, the startup could be equipped to turn that reach into real dollars.", "posttime": "2021-07-26 23:38:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "正装,marketplace,queenly", "title": "Queenly 的正装市场获得数百万美元的融资，由 A16z 领投", "title_en": "\n\t\t\t\tQueenly’s marketplace for formalwear gets millions in round led by A16z\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/26/queenly-a16z-seed-extension/", "via": "", "real_tags": ["正装", "queenly"]}, {"category": "", "categoryclass": "", "imagename": "c4c136719b08bbbc97258f05727f4718.jpg", "infoid": 1069813, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你是科技创业生态系统的一部分——或者渴望成为——为什么你不一头扎进三天，专注于建立和扩大成功创业公司所需的艺术和科学？听听三位过去的与会者如何评价他们的 Disrupt 体验。 Disrupt 是一个很好的甜蜜点，而且非常有价值，对于任何处于创意阶段的人来说，一直到筹集到一些天使资金。沉浸在音高甲板拆解和 VC 演示文稿中。他们会告诉你他们在寻找什么，是什么激励他们，是什么促使他们联系你开会。而这正是每个筹集资金的初创公司都需要知道的。 — Repositax 首席执行官迈克尔·麦卡锡 (Michael McCarthy)。 “TechCrunch 创造了一个伟大的场所，将创业生态系统中的所有不同的人聚集在一起。这是一个新的创业公司可以展示的地方，与会者可以向顶级行业专家学习，谁知道呢？有一天，他们可能会成为在 Disrupt 舞台上发言的人。总的来说，这是一个很棒的活动。” — JC Bodson，Arbitrage Technologies 的创始人兼首席执行官 “我在 Disrupt 建立的联系提供了长期利益。愿意投入资金的投资者、提供技术专长的工程师和制造商来帮助我简化流程。培养这些关系将帮助我发展我的公司和我的底线。” — Felicia Jackson，CPRWrap 的发明者和创始人。 Disrupt 是学习、联系、协作和密切关注快速变化趋势的地方。这只是我们拥有的及时主题和世界级专家的一个例子。不要忘记查看议程。拯救世界：COVID-19 改变了一切。它不仅威胁到我们个人的健康和福祉，而且还震动了全球的行业和经济。 COVID-19 疫苗也是如此。听听 BioNTech 联合创始人兼首席执行官 Ugur Sahin 与辉瑞一起快速开发世界上最受欢迎的疫苗的过程，以及基于 mRNA 的疗法的长期潜力。 Sahin 将与 Mayfield Fund 的 Ursheet Parikh 一起讨论初创公司在这个快速发展的行业中的下一步发展。专业提示：我们将在 Disrupt 之前添加新的演讲者、活动和折扣 - 注册更新，这样您就不会错过。\nTechCrunch Disrupt 2021 将于 9 月 21 日至 23 日举行，但节省大量资金的时间将在本周结束。在 7 月 30 日晚上 11 点 59 分（太平洋时间）交易到期之前，在此处购买您的早鸟通行证。贵公司是否有兴趣赞助或参展 Disrupt 2021？填写此表格，联系我们的赞助销售团队。", "note_en": "And if you’re part of the tech startup ecosystem — or aspire to be — why the heck wouldn’t you dive headlong into three days dedicated to the art and science required to build and scale successful startups? Just listen to what three past attendees said about their Disrupt experience.\n Disrupt is a great sweet spot, and highly valuable, for anyone in the idea stage all the way through to having raised some angel money. Soak up the pitch deck teardowns and the VC presentations. They’re telling you what they’re looking for, what motivates them, what pushes them to contact you for a meeting. And that’s exactly what every startup raising capital needs to know. — Michael McCarthy, CEO, Repositax.\n  “TechCrunch has created a great venue that brings together all the different people within the startup ecosystem. It’s a place where new startups can present, attendees can learn from top industry experts and who knows? One day they might be the person speaking on the Disrupt stage. It’s a great event overall.” — JC Bodson, founder and CEO of Arbitrage Technologies\n “The connections I made at Disrupt offer long-term benefits. Investors willing to put forth capital, engineers offering tech expertise and manufacturers to help me streamline. Fostering these relationships will help me grow my company and my bottom line.” — Felicia Jackson, inventor and founder of CPRWrap.\n Disrupt is the place to be to learn, connect, collaborate and keep tabs on rapidly changing trends. Here’s just one example of the timely topics and world-class experts we have on tap. Don’t forget to  check out the agenda.\n Saving the World: COVID-19 changed everything. It not only threatened our individual health and wellbeing, but it also shook industries and economies across the globe. The same could be said about the COVID-19 vaccines. Hear from BioNTech Cofounder and CEO, Ugur Sahin on the process of rapidly developing the world’s most sought-after vaccine, alongside Pfizer, and the long-term potential of mRNA-based therapies. Sahin will be joined by Ursheet Parikh of Mayfield Fund to discuss what’s next for startups in this rapidly evolving industry.\n Pro Tip: We’ll add new speakers, events and discounts in the run up to Disrupt —  sign up for updates so you don’t miss out.\n TechCrunch Disrupt 2021 takes place September 21-23, but the time to snag serious savings ends this week.  Buy your early bird pass here before the deal expires on  July 30 at 11:59 pm (PT).\n Is your company interested in sponsoring or exhibiting at Disrupt 2021? Contact our sponsorship sales team by   filling out this form.", "posttime": "2021-07-26 23:38:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "优惠,bird,disrupt", "title": "TechCrunch Disrupt 2021 通行证的早鸟优惠将于本周结束", "title_en": "\n\t\t\t\tEarly bird savings on passes to TechCrunch Disrupt 2021 end this week\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/26/early-bird-savings-on-passes-to-techcrunch-disrupt-2021-end-this-week/", "via": "", "real_tags": ["优惠", "bird", "disrupt"]}, {"category": "", "categoryclass": "", "imagename": "e5cfc7223fb65e39ca88d26f05c34063.png", "infoid": 1069812, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Box Inc. 正在通过添加一项重要的新功能来构建其内容云。该公司今天表示，它正在推出 Box Sign，这是 Box 中的一种原生电子签名功能，将使用户能够以电子方式签署合同并请求他人签名。 Box 表示，Box Sign 支持无限签名，并带有一组强大的应用程序编程接口，使企业能够完全在云中实现协议的现代化和管理。 Box Sign 功能是通过该公司今年早些时候以 5500 万美元收购荷兰初创公司 SignRequest BV 而实现的。 Box 首席执行官 Aaron Levie 在接受采访时告诉 SiliconANGLE，在 COVID-19 大流行期间，电子签名是其客户最需要的功能。由于大多数企业被迫在线开展业务，人们无法再面对面地签署合同和交易。 “越来越多的交易正在从纸质流程转移到云端，”Levie 说。 “但是现有的解决方案存在问题。它们成本太高，分散且存在安全问题。” Box Sign 旨在解决所有三个问题。它与 Box 原生集成，这意味着不再存在碎片化，客户无需支付额外费用即可使用它。这些功能甚至可以通过 Box for Salesforce 集成提供，因此可以从 Salesforce 内部生成和创建保密协议、合同等。该公司表示，至于安全性，Box Sign 继承了 Box 坚如磐石的安全性和合规性。\n“这是我们多年来所做的最重要的新产品，”Levie 说。 Box Sign 功能包括向任何人发送和请求签名的能力，无论他们是否使用 Box，用于常见可重复流程（如 NDA）的模板，以及跟踪工具和电子邮件提醒和通知。 Box 表示，从今天开始，部分客户可以使用 Box Sign，其他用户将在未来几个月内看到它。 ZK Research 首席分析师 Zeus Kerravala 表示：“Box 的方法不同，因为它考虑了电子签名的生命周期，其中包括实际签名以及上游和下游流程。” “随着企业采用电子签名，重要的是将其视为整个文档管理流程的一部分，而不是孤立地完成。” Box Sign 功能帮助 Box 构建它喜欢称之为“内容云”的东西，它可以被认为是管理所有企业文档和文书工作的基础设施。借助 Box Content Cloud，该公司旨在通过增加关键自动化和安全功能的多合一服务取代分散的遗留系统，例如网络存储和文档和文件管理工具。 “我们正在构建一个内容云，帮助客户在单一架构中管理内容的整个生命周期，”Levie 说。 “所以你会看到我们投资于所有这些支柱。”为此，Box 宣布了一项名为 Enterprise Plus 的新订阅计划，该计划从今天开始可用。 Levie 说，它是迄今为止最高的级别，包括所有主要的附加组件。它将 Box 的基本功能与 Box Shield、Box Governance、Box Relay、Box Platform 和新的 Box Sign 捆绑在一起。除此之外，Enterprise Plus 客户将能够直接从 Salesforce 内发送无限数量的文档进行签名。\nLevie 表示，他认为 Box Enterprise 可能会看到一些强劲的动力，并指出该公司最近看到了自去年第四季度以来的“增长重新加速”，超过 10 万美元的交易显着增长。他还指出了混合工作的趋势，在这种趋势中，人们将继续花费大量时间远程工作，而在办公室的时间有限。 “新的病毒变种和疫苗接种不足意味着混合工作将持续很长一段时间，”Levie 说。 “我们认为内容在混合工作中扮演着如此重要的角色，它将成为未来混合工作的主要组成部分。”加入我们的 Cube 俱乐部和 Cube 活动专家社区，表达您对我们使命的支持。加入社区，其中包括 Amazon Web Services，即将成为 Amazon.com 首席执行官 Andy Jassy、戴尔科技公司创始人兼首席执行官迈克尔戴尔、英特尔首席执行官 Pat Gelsinger 以及更多名人和专家。我们将于 6 月 16 日举行第二次云创业展示会。单击此处加入免费且开放的 Startup Showcase 活动。", "note_en": "Box Inc. is building out its content cloud with the addition of an important new capability.\n The company said today it’s rolling out Box Sign, a native e-signature capability within Box that will give users the ability to electronically sign contracts and request signatures from others.\n Box said Box Sign enables unlimited signatures and comes with a robust set of application programming interfaces that will enable businesses to modernize and manage their agreements entirely in the cloud.\n The Box Sign capability was made possible through the company’s  $55 million acquisition of Dutch startup SignRequest BV earlier this year.\n Box Chief Executive Aaron Levie told SiliconANGLE in an interview that e-signatures were the most-demanded feature from its customers during the COVID-19 pandemic. With most enterprises forced to do business online, people couldn’t meet face-to-face anymore to sign contracts and deals.\n “So many more transactions are moving from paper-based processes to the cloud,” Levie said. “But there are problems with existing solutions. They cost too much, they’re fragmented and there are security problems.”\n Box Sign is aimed at doing away with all three problems. It’s natively integrated with Box, meaning no more fragmentation and customers don’t have to pay extra to use it. The capabilities are even made available through the Box for Salesforce integration, so it’s possible to generate and create non-disclosure agreements, contracts and the like from within Salesforce. As for security, Box Sign inherits Box’s rock-solid security and compliance profile, the company said.\n “This is the most significant new product we’ve done in a number of years,” Levie said.\n Box Sign features include the ability to send and request signatures from anyone, regardless of if they use Box or not, templates for common repeatable processes such as NDAs, plus tracking tools and email reminders and notifications.\n Box said Box Sign is available to a subset of its customers starting today, and the rest of its users will see it in the coming months.\n “Box’s approach is different as it thinks about the lifecycle of the e-signature which includes the actual signature but also the upstream and downstream processes,” said Zeus Kerravala, principal analyst with ZK Research. “As businesses adopt e-signatures, it’s important to think of it as part of the overall document management process versus something done in isolation.”\n  The Box Sign capability helps Box to build out what it  likes to call its “Content Cloud,” which can be thought of as an infrastructure for managing all of a businesses’ documentation and paper work. With Box Content Cloud, the company is aiming to displace fragmented legacy systems such as network storage and document and file management tools with an all-in-one service that adds in key automation and security capabilities.\n “We’re building out a content cloud that helps customers manage the entire lifecycle of content in a single architecture,” Levie said. “So you’ll see us invest in all these pillars.”\n In line with that, Box has announced a new subscription plan called Enterprise Plus that’s available starting today. It’s highest tier yet that includes all of its major add-ons, Levie said. It bundles Box’s basic capabilities with  Box Shield,  Box Governance,  Box Relay, Box Platform and the new Box Sign. In addition to that, Enterprise Plus customers will be able to send an unlimited number of documents for signature directly from within Salesforce.\n Levie said he believes Box Enterprise is likely to see some solid traction, noting that the company recently saw a “reacceleration of growth” from the fourth quarter of last year, with deals above $100,000 growing significantly. He also pointed to the trend of hybrid work, in which people will continue to spend many hours working remotely with only limited time spent in offices.\n “New virus variants and inadequate vaccination means hybrid work will continue for quite some time,” Levie said. “We think content plays such an important role in hybrid work, and it will be a major fixture of what hybrid work looks like in the future.”\n   Show your support for our mission by joining our Cube Club and Cube Event Community of experts. Join the community that includes Amazon Web Services and soon to be Amazon.com CEO Andy Jassy, Dell Technologies founder and CEO Michael Dell, Intel CEO Pat Gelsinger and many more luminaries and experts.\n We are holding our second cloud startup showcase on June 16.  Click here to join the free and open Startup Showcase event.", "posttime": "2021-07-26 23:29:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "box,sign", "title": "在今年早些时候以 5500 万美元收购 SignRequest 之后，Box 推出了 Box Sign，它允许用户以电子方式签署合同并请求签名", "title_en": "Box rolls out Box Sign, which lets users electronically sign contracts and request signatures, following its $55M acquisition of SignRequest earlier this year", "transed": 1, "url": "https://siliconangle.com/2021/07/26/box-brings-e-signatures-content-cloud-box-sign/", "via": "", "real_tags": ["box", "sign"]}, {"category": "", "categoryclass": "", "imagename": "7861a22bf722de5459e5a860bc7478f9.png", "infoid": 1069811, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“best-freelancer.com”是本网站知识产权的所有者，尤其是文本、图像、图形。本网站及其内容是“Maya Centopani”的知识产权。严禁对本网站的照片进行任何复制、修改、出版，甚至部分内容。对于任何信息或联系请求：maya@best-freelancer.com 根据法律 n ° 78-17 Informatique et Liberté of 06/01/1978 第 27 条，我们保证您有权访问、修改和删除有关您的数据.要行使此权利或如果您不希望被联系，请发送电子邮件至：maya@best-freelancer.com 免责声明：本网站上的某些链接是附属链接，可能会为我提供少量佣金不花钱。", "note_en": "“best-freelancer.com” is the owner of the intellectual property rights on the site, in particular the texts, images, graphics.    This site and its content are the intellectual property of &#34;Maya Centopani&#34;. Any reproduction of photos, modification, publication, even partial, of this site is strictly prohibited.    For any information or contact request: maya@best-freelancer.com In accordance with article 27 of law n ° 78-17 Informatique et Liberté of 06/01/1978, we guarantee you the right to access, modify and delete data concerning you. To exercise this right or in the event that you do not wish to be contacted, send us an email at: maya@best-freelancer.com\n    Disclaimer: Some of the links on this website are affiliate links that may provide me with a small commission at no cost to you.", "posttime": "2021-07-26 23:28:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "自由职业者,find,网站", "title": "最佳自由职业者 – 寻找 2021 年最佳 Fiverr 卖家", "title_en": "Best Freelancer â€“ Find the Best Fiverr Sellers in 2021", "transed": 1, "url": "https://best-freelancer.com/", "via": "", "real_tags": ["自由职业者", "find", "网站"]}, {"category": "", "categoryclass": "", "imagename": "03336371274e47fa1ce1b2a0c6bffe7e.jpg", "infoid": 1069810, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "可以调整形状的曲面成像器可能有许多有价值的应用，例如，有助于开发更先进的医学成像工具和相机。然而，大多数现有的柔性弯曲成像器要么与可调焦面不兼容，要么只能捕获具有低分辨率和像素填充因子的图像。休斯顿大学和科罗拉多大学博尔德分校的研究人员最近设计并创造了一种具有高像素填充因子的弯曲自适应成像仪。发表在《自然电子》杂志上的一篇论文中介绍了这种新型成像器，它是通过使用一种称为保形增材印章印刷的技术将具有剪纸设计的超薄硅光电像素阵列转移到弯​​曲表面上制造的。 “基于弯曲成像传感器的相机，例如由视网膜和晶状体组成的类人眼球，在许多关键应用中具有广阔的前景，”进行这项研究的研究人员之一于存江告诉 Phys.org。 “尽管如此，此类相机的开发面临许多技术挑战，例如与高像素填充因子和形状可调性相关的技术挑战，这两个功能对于捕捉无光学像差的清晰图像是必不可少的。” Yu 和他的同事最近研究的目标是克服之前在尝试开发弯曲和形状自适应成像器时遇到的问题。与传统数码相机相比，事实上，弯曲成像传感器通常需要多个复杂的镜头组合才能拍摄清晰和高分辨率的图像。研究人员开发的弯曲成像仪的灵感来自人类眼球的形状。就像人的眼球一样，其实弯曲的相机应该是由弯曲的、形状自适应的成像传感器阵列和镜头组成的。 “使用传统或现有技术创建弯曲的成像器可能非常具有挑战性，”Yu 解释说。 “我们的曲线成像仪的关键新颖之处在于新颖、可靠和稳健的制造技术，名为保形增材印章 (CAS) 印刷，这是我的研究小组发明的。”首先，Yu 和他的同事使用成熟的微加工工艺，按照 kirikami 设计（即日本折纸艺术的一种变体，也包括剪纸以创建 3D对象，而不仅仅是折叠它）。随后，研究人员使用一种称为 CAS 打印的技术来创建具有所需形状的弯曲成像器。 “镜头的焦距和成像传感器（或成像器）的曲率可以相应地进行调整，以实现自适应光学聚焦并减少远近物体成像的像差，这甚至超过了人眼的能力，因为人类视网膜没有提供类似水平的可调性，”于说。\n弯曲成像器在拉伸前的填充因子为 78%，并且可以在 30% 的双轴应变下保持其电气性能。未来，它可能有许多有价值的应用，例如帮助开发更先进、性能更好的内窥镜、视网膜假体、人工复眼相机和鱼眼镜头。 “我们的工作为实现具有高填充因子的弯曲、形状可调的自适应/可调成像器铺平了道路，以保证高质量和低光学像差的成像捕获，”于说。 “我们未来的研究将致力于开发其他高性能成像传感器像素和阵列，以及上述设备。”更多信息：基于带有剪纸设计的印刷光电像素的弯曲形状自适应成像器。自然电子（2021）。 DOI：10.1038/s41928-021-00600-1", "note_en": "Curved imagers that can adjust their shape could have many valuable applications, for instance, aiding the development of more advanced medical imaging tools and cameras. Most existing flexible curvy imagers, however, are either not compatible with tunable focal surfaces or can only capture images with low resolutions and pixel fill factors.    Researchers at University of Houston and University of Colorado-Boulder have recently designed and created a curvy and  -adaptive imager with high pixel fill factors. The new imager, presented in a paper published in  Nature Electronics, was fabricated by transferring an array of ultrathin silicon optoelectronic pixels with a kirigami design onto curvy surfaces, using a technique known as conformal additive stamp printing.\n  &#34;Curvy imaging sensor-based cameras, such as a human-like eyeball composed of retina and a lens, hold great promise for many critical applications,&#34; Cunjiang Yu, one of the researchers who carried out the study, told  Phys.org. &#34;Nonetheless, the development of such cameras entails many technical challenges, for instance associated with high pixel fill factor and shape tunability, two features that are necessary to capture clear images without optical aberration.&#34;\n  The objective of the recent study by Yu and his colleagues was to overcome the   previously encountered when trying to develop curvy and shape-adaptive imagers. In contrast with conventional digital cameras, in fact, curvy imaging sensors typically require multiple and complex lens combinations to take clear and high-resolution  .\n  The curvy imager developed by the researchers is inspired by the shape of human eyeballs. Just like a human eyeball, in fact, curvy cameras should be made of a curvy and shape adaptive imaging sensor array and a lens.\n   &#34;Creating curvy imagers using conventional or existing technologies can be highly challenging,&#34; Yu explained. &#34;The key novelty of our curvy imager is the novel, reliable and robust manufacturing technology, named conformal additive stamp (CAS) printing, which was invented by my research group.&#34;\n  First, Yu and his colleagues used mature microfabrication processes to create a planar shaped, very thin 32 x 32-pixel imaging sensor array, following a kirikami design (i.e., a variation of the Japanese art of origami that also involves cutting paper to create 3D objects, rather than just folding it). Subsequently, the researchers used a technique called CAS printing to create curvy imagers with desired shapes.\n    &#34;The focal length of the lens and the curvature of the imaging sensor (or imager) can be tuned accordingly, to achieve adaptive optical focus and reduce aberration for imaging far and near objects, which even exceeds the capability of the human eye, since the human retina does not offer a similar level of tunability,&#34; Yu said.\n  The curvy imager exhibits a fill factor of 78% before stretching and can maintain its electrical performance under a 30% biaxial strain. In the future, it could have a number of valuable applications, for instance aiding the development of more advanced and better performing endoscopes, retinal prostheses,  , artificial compound eye cameras and fisheye cameras.\n  &#34;Our work paves way to achieve curvy, shape tunable adaptive/tunable imager with high   fill factor to guarantee imaging capture with high quality and low optical aberration,&#34; Yu said. &#34;Our future research will be aimed at developing other high-performance imaging sensor pixels and arrays, and the aforementioned   devices.&#34;        More information:\t\t\t\t\t\t\t\t\t\t\t\tCurvy, shape-adaptive imagers based on printed optoelectronic pixels with a kirigami design.  Nature Electronics(2021).  DOI: 10.1038/s41928-021-00600-1", "posttime": "2021-07-26 23:28:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "图像,adaptable,成像", "title": "弯曲的自适应成像传感器改善图像，保留更多像素", "title_en": "Curvy adaptable imaging sensor improves image, retains more pixels", "transed": 1, "url": "https://phys.org/news/2021-07-curvy-shape-adaptive-imager-based-optoelectronic.html", "via": "", "real_tags": ["图像", "adaptable", "成像"]}, {"category": "", "categoryclass": "", "imagename": "af030499dfdf1222a597cedbf260b05f.jpeg", "infoid": 1069808, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您讨厌 Apple 的 MacOS，但又羡慕 M1 的性能和能效，那么在您这一方的 OS 战争中，大门刚刚为您打开了一个更加阳光明媚的未来。领导 Panfrost 和 Asahi 图形驱动程序的 Linux 开发人员 Alyssa Rosenzweig 在推特上发布了一个正在运行的 Debian GNU/Linux 安装，该安装在 Apple 闪亮的明星 SoC 上运行裸机。这不是我们第一次在 M1 上看到 Linux，但毫无疑问，这不会影响 Rosenzweig 的工作。 Rosenzweig 的开发是在对 M1 SoC 工作进行逆向工程数月之后进行的，它代表了软件世界中最复杂的任务之一——将工作操作系统移植到相当于硬件黑盒的地方。虽然我们距离 M1 上 Linux 的“一劳永逸”安装过程还有一段相对较长的时间，但 Alyssa 和合作伙伴所做的工作为实现这一目标开辟了前沿。当前安装已经具有支持 USB 的工作上游主线内核，为进一步开发增加了灵活性。目标是通过生态系统支持和主线内核更新，使任何 Linux 发行版都能够安装并通过 M1 SoC 运行。 M1 在 MacOS 上的性能是众所周知的——它甚至击败了一些应该超过 M1 重量的台式 Windows PC。然而，Linux 也是如此吗？ M1 Linux 实现最终会提供比 x86 实现更高的性能（和每瓦性能）吗？我们将不得不拭目以待，但如果您喜欢 M1 的性能和能源效率，但又不想被锁定在 Apple 的生态系统中，那么这是您应该密切关注的一项发展。", "note_en": "If you loathe Apple&#39;s MacOS but envy the M1&#39;s performance and power efficiency, the door has just been opened for a sunnier future on your side of the OS wars. Alyssa Rosenzweig, a Linux developer leading the Panfrost and Asahi graphics drivers, has  tweeted a running Debian GNU/Linux installation running bare metal on Apple&#39;s shining star  SoC.\n  This isn&#39;t the first time that we have seen Linux on the M1 but make no mistake that this takes nothing away from Rosenzweig&#39;s work. Rosenzweig&#39;s development follows months of work in reverse engineering the M1 SoC&#39;s workings, and represents one of the most complicated tasks in the software world - porting a working OS to what amounts to a hardware blackbox. While we&#39;re still a relatively long time before a set-it-and-forget-it installation process for Linux on M1, the work done by Alyssa and co opens up the frontier for that to happen. The current installation already features a working upstream mainline kernel with USB support, adding flexibility to further developments. The objective is to enable any Linux distro to be installed on and run through the M1 SoC, with ecosystem support and mainline kernel updates.\n  The M1&#39;s performance on MacOS is a known quantity - and it beats even some desktop Windows PCs that should punch above the M1&#39;s weight. However, is the same true for Linux? Will the M1 Linux implementation eventually offer higher performance (and performance per watt) than comparable x86 implementations? We&#39;ll have to wait and see, but if you love the M1&#39;s performance and energy efficiency but don&#39;t want to be locked into Apple&#39;s ecosystem, this is one development you should keep your eyes on.", "posttime": "2021-07-26 23:27:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,apple,bare", "title": "Debian Linux 在 Apple 的 M1 SoC 上运行 Bare Metal", "title_en": "Debian Linux Running Bare Metal on Apple's M1 SoC", "transed": 1, "url": "https://www.tomshardware.com/news/apple-m1-debian-linux", "via": "", "real_tags": ["linux", "apple", "bare"]}, {"category": "", "categoryclass": "", "imagename": "bce87e65352f3484295850a09728774c.jpeg", "infoid": 1069806, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“电动汽车的转变正在加快速度，”戴姆勒和梅赛德斯-奔驰的负责人 Ola Källenius 说。戴姆勒的计划是大型汽车公司如何为基于电动汽车的未来做准备的最新迹象。德国戴姆勒周四表示，其梅赛德斯-奔驰品牌将“准备在 10 年末，在市场条件允许的情况下，实现全电动化”。这是主要汽车公司如何为基于电动汽车的未来做准备的最新迹象。戴姆勒表示，从 2025 年起，梅赛德斯-奔驰所有“新推出的车辆架构都将纯电动”。分解一下，戴姆勒解释了它如何计划在当年推出三种纯电动架构：MB.EA，将与中大型乘用车相关； AMG.EA，将专注于性能车；和 VAN.EA，用于轻型商用车和货车。基于这些平台的模型将仅是电动的。从 2025 年开始，消费者还可以选择“为公司生产的每种型号购买全电动替代品”。\n“电动汽车的转变正在加速——尤其是在梅赛德斯-奔驰所属的豪华车领域，”戴姆勒和梅赛德斯-奔驰的负责人奥拉·卡列纽斯在一份声明中表示。 “临界点越来越近了，随着市场在本十年末转向纯电动，我们将做好准备，”他补充道。 “这一步标志着资本的深刻重新配置。”根据其计划，戴姆勒表示梅赛德斯-奔驰将加大研发力度。 “总的来说，2022 年至 2030 年对纯电动汽车的投资将超过 400 亿欧元。”除了全球合作伙伴，梅赛德斯还将寻求建立八家超级工厂来制造其车辆所需的电池。这将补充开发九家专注于电池系统开发的工厂的计划。戴姆勒补充说，梅赛德斯-奔驰打算“与新的欧洲合作伙伴合作开发和高效生产未来的电池和模块，这一步确保欧洲即使在电动时代也仍然是汽车行业的核心。”低排放和零排放交通被视为主要经济体试图减少环境足迹和减少空气污染的重要工具。例如，英国政府计划到 2030 年停止销售新的柴油和汽油汽车和货车，并要求从 2035 年起所有新车和货车的尾气排放为零。\n在其他地方，欧盟执行机构欧盟委员会的目标是到 2035 年将汽车和货车的二氧化碳排放量减少 100%。零排放车辆。例如，本月早些时候，大众汽车集团表示，到 2030 年，其一半的销量预计将是纯电动汽车。到 2040 年，该公司表示，到 2040 年，其在主要市场的新车几乎 100% 应该是零排放的。早在 3 月份，大众汽车集团的首席执行官就驳斥了他的公司可以与特斯拉联手的想法，并告诉 CNBC，这家德国汽车巨头正在寻求走自己的路。在接受“Squawk Box Europe”采访时，赫伯特·迪斯被问及他是否会排除与埃隆马斯克的电动汽车制造商的任何未来交易，大众可以在其中制造汽车，或者特斯拉和大众品牌是否会联合起来。 “不，我们没有考虑过[那个]，我们正在走自己的路，”他回答道。 “我们想接近然后超车。” “我们认为我们可以——我们需要我们自己的软件堆栈，我们自己的技术，”他补充道。 “而且，我认为特斯拉或埃隆正在思考...... [关于]他前进的道路。所以不，埃隆马斯克和我之间没有关于联手的谈判。”", "note_en": "&#34;The EV shift is picking up speed,&#34; Ola Källenius, who heads up both Daimler and Mercedes-Benz, says.\n Daimler&#39;s plans are the latest sign of how major automotive firms are gearing up for a future based around electric vehicles.\n Germany&#39;s  Daimler said Thursday that its Mercedes-Benz brand would &#34;be ready to go all electric at the end of the decade, where market conditions allow.&#34;\n It&#39;s the latest sign of how major automotive firms are gearing up for a future based around electric vehicles.\n  According to Daimler, from 2025 all of Mercedes-Benz&#39; &#34;newly launched vehicle architectures will be electric-only.&#34;\n Breaking things down, Daimler explained how it planned to launch three pure-electric architectures that year: MB.EA, which will relate to medium and large passenger cars; AMG.EA, which will focus on performance vehicles; and VAN.EA, for light commercial vehicles and vans. Models based on these platforms will be electric only.\n From 2025 onward, consumers will also have the option of purchasing an &#34;all-electric alternative for every model the company makes.&#34;\n &#34;The EV shift is picking up speed — especially in the luxury segment, where Mercedes-Benz belongs,&#34; Ola Källenius, who heads up both Daimler and Mercedes-Benz, said in a statement.\n &#34;The tipping point is getting closer and we will be ready as markets switch to electric-only by the end of this decade,&#34; he added. &#34;This step marks a profound reallocation of capital.&#34;\n  In light of its plans, Daimler stated that Mercedes-Benz would ramp-up its research and development. &#34;In total, investments into battery electric vehicles between 2022 and 2030 will amount to over 40 billion euros.&#34;\n Alongside global partners, Mercedes will also look to establish eight gigafactories to manufacture the cells it needs for its vehicles. This would supplement plans to develop nine plants focused on the development of battery systems.\n Daimler added that Mercedes-Benz intended to, &#34;team up with new European partners to develop and efficiently produce future cells and modules, a step which ensures that Europe remains at the heart of the auto industry even in an electric era.&#34;\n Low and zero-emission transportation is seen as being a crucial tool for major economies attempting to reduce their environmental footprint and cut air pollution.\n The U.K. government, for example, plans to stop the sale of new diesel and gasoline cars and vans by 2030 and require, from 2035, all new cars and vans to have zero tailpipe emissions.\n Elsewhere, the European Commission, the EU&#39;s executive arm, is targeting a 100% reduction in CO2 emissions from cars and vans by 2035.\n Against this backdrop, a host of companies involved in the auto industry have announced plans to expand their offering of low and zero-emission vehicles.\n Earlier this month, for example, the  Volkswagen Group said half of its sales  were expected to be battery-electric vehicles by 2030. By 2040, the company said almost 100% of its new vehicles in major markets should be zero-emission.\n Back in March, the Volkswagen Group&#39;s CEO dismissed the notion that his firm could join forces with  Tesla, telling CNBC that the German automotive giant  was looking to go its own way.\n Speaking to &#34;Squawk Box Europe,&#34; Herbert Diess was asked if he would rule out any future deal with Elon Musk&#39;s electric car maker, in which VW could manufacture its cars, or if the Tesla and VW brands would ever unite.\n &#34;No, we haven&#39;t considered [that], we are going our own way,&#34; he replied. &#34;We want to get close and then overtake.&#34;\n &#34;We think that we can — we need our own software stack, our own technology,&#34; he added. &#34;And also, I think Tesla, or Elon, is very much thinking ... [about] his way forward. So no, there are no talks between Elon Musk and myself regarding joining forces.&#34;", "posttime": "2021-07-26 22:49:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "本世纪末,plans", "title": "梅赛德斯计划在本世纪末实现全电动", "title_en": "Mercedes plans to go all-electric by the end of the decade", "transed": 1, "url": "https://www.cnbc.com/2021/07/22/mercedes-plans-to-go-all-electric-by-the-end-of-the-decade.html", "via": "", "real_tags": ["本世纪末", "plans"]}, {"category": "", "categoryclass": "", "imagename": "78ffe7b1871e83f8e404d3fd18c165f3.jpg", "infoid": 1069805, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在本周的 Found 一集中，我和 TechCrunch 总编辑 Jordan Crook 与 Aditi 坐下来谈论她从哪里获得无尽的动力和决心，以及为什么她喜欢财务管理（我试图让她对我失去热情, tbh)。我们还探讨了为什么 Zeta 在传统金融解决方案领域如此有意义，这些解决方案通常不承认我们管理和思考金钱的方式，尤其是与多人之间的动态相关的方式，已经发生了显着变化在过去几十年的过程中。 Aditi 绝对不害怕真正了解成为一名企业家所需的条件，并致力于实现您真正相信的愿景。和往常一样，我和 Jordan 最终对我们的生活选择感到深深的不足和羞愧——但在一个有趣的过程中大大地。我们喜欢与 Aditi 聊天的时光，我们希望您喜欢收听这一集的时光。当然，如果您可以订阅 Found in Apple Podcasts、Spotify、Google Podcasts 或您选择的播客应用程序，我们会很高兴。请给我们留下评论并告诉我们您的想法，或者通过 Twitter 或通过电子邮件发送给我们直接反馈至 found@techcrunch.com。请下周再次加入我们，为我们的下一位特色创始人。", "note_en": "On this week’s episode of Found, me and TechCrunch Managing Editor Jordan Crook sit down with Aditi to talk about where she gets her endless drive and determination, to why she loves financial management (I’m trying to get her zeal to wear off on me, tbh). We also get into why Zeta makes so much sense in the context of a field of legacy financial solutions that generally don’t acknowledge that the way we manage and think about money, especially as it relates to the dynamics between multiple people, has changed significantly over the course of the past several decades.\n  Aditi definitely isn’t afraid to get real about what’s required to be an entrepreneur and dedicate yourself to a vision you really believe in. And as usual, me and Jordan end up feeling deeply inadequate and ashamed about our life choices — but in a fun way.\n We loved our time chatting with Aditi, and we hope you love yours listening to the episode. And of course, we’d love if you can subscribe to  Found in Apple Podcasts, on  Spotify, on  Google Podcasts or in  your podcast app of choice. Please leave us a review and let us know what you think, or send us direct feedback either on  Twitter or via email at found@techcrunch.com. And please join us again next week for our next featured founder.", "posttime": "2021-07-26 22:48:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,资金,aims,喜欢", "title": "一位创始人如何将资金管理变成多人游戏", "title_en": "\n\t\t\t\tHow one founder aims to make money management a mutiplayer game\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/26/how-one-founder-aims-to-make-money-management-a-mutiplayer-game/", "via": "", "real_tags": ["游戏", "资金", "aims", "喜欢"]}, {"category": "", "categoryclass": "", "imagename": "5233a47f52fd5d7b5d5dc62a99dad2fc.jpg", "infoid": 1069803, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "布鲁塞尔，7 月 26 日（路透社） - Alphabet 部门谷歌 (GOOGL.O) 有两个月的时间来改进其显示航班和酒店的互联网搜索结果的方式，并解释如何对这些结果进行排名或面临可能的制裁、欧盟委员会和欧盟消费者当局周一说。这个世界上最受欢迎的互联网搜索引擎长期以来一直因其商业行为而受到全球反垄断执法者和消费者团体的审查，在某些情况下，这导致它被处以巨额罚款。最新的不满集中在其服务 Google Flights 和 Google Hotels 的价格上。这些的最终价格应包括可以提前计算的费用或税费，而用于计算促销折扣的参考价格应清晰可辨，由荷兰机构和比利时经济总局领导的欧盟执行和国家消费者监督机构检查，在一份联合声明中说。 “在使用搜索引擎计划假期时，欧盟消费者不能被误导。我们需要让消费者能够根据透明和公正的信息做出选择，”欧盟司法专员迪迪埃·雷恩德斯 (Didier Reynders) 说。这些机构还要求谷歌修改其谷歌商店的标准条款，因为一些案例表明交易者比消费者拥有更多的权利。如果谷歌的提议不够充分，这些机构将与该公司进一步讨论该问题，并可能实施制裁。\n谷歌在一份声明中表示：“我们欢迎这种对话，并正在与消费者保护机构和欧盟委员会密切合作，看看我们如何做出有利于我们用户并提供更多透明度的改进。”", "note_en": "BRUSSELS, July 26 (Reuters) - Alphabet unit Google  (GOOGL.O) has two months to improve the way it presents internet search results for flights and hotels and explain how it ranks these or face possible sanctions, the European Commission and EU consumer authorities said on Monday.\n The world&#39;s most popular internet search engine has long faced scrutiny from antitrust enforcers and consumer groups around the world over its business practices, which in some cases have landed it with hefty fines.\n The latest grievance centres on the prices on its services Google Flights and Google Hotels.\n The final prices for these should include fees or taxes that can be calculated in advance, while reference prices used to calculate promoted discounts should be clearly identifiable, the EU executive and national consumer watchdogs, led by the Dutch agency and the Belgian Directorate General for Economic Inspection, said in a joint statement.\n &#34;EU consumers cannot be misled when using search engines to plan their holidays. We need to empower consumers to make their choices based on transparent and unbiased information,&#34; EU Justice Commissioner Didier Reynders said.\n The agencies also told Google to revise the standard terms of its Google Store because some cases showed that traders have more rights than consumers.\n If Google&#39;s proposals are not sufficient, the agencies will discuss the issue further with the company and may impose sanctions.\n Google said in a statement: &#34;We welcome this dialogue and are working closely with consumer protection agencies and the European Commission to see how we can make improvements that will be good for our users and provide even more transparency.&#34;", "posttime": "2021-07-26 22:39:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,改进,results,消费者", "title": "欧盟给谷歌两个月的时间来改进它呈现航班和酒店搜索结果的方式，并解释它如何对这些结果进行排名，否则将面临制裁", "title_en": "EU gives Google two months to improve the way it presents search results for flights and hotels, and explain how it ranks such results, or face sanctions", "transed": 1, "url": "https://www.reuters.com/technology/eu-gives-google-2-months-improve-hotel-flight-search-results-2021-07-26/", "via": "", "real_tags": ["谷歌", "google", "改进", "results", "消费者"]}, {"category": "", "categoryclass": "", "imagename": "d3a64c44109afb5ea05410c16872cb6c.jpeg", "infoid": 1069802, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Spotify 正在推出一项功能，当人们最喜欢的艺术家和播客制作人有新版本要查看时，它会通知人们。 What&#39;s New 面板采用应用程序主页界面顶部的钟形图标形式，收集乐队、音乐家的新专辑以及您在平台上关注的节目。 Spotify 表示，该功能将实时更新，铃铛图标上方会覆盖一个蓝点，指示面板何时刷新了新内容。 Spotify 计划在未来几周内向所有 Android 和 iOS 用户推出该功能。本质上，What&#39;s New 类似于 Spotify 现有的 Release Radar 播放列表。它们都旨在为您提供新内容以添加到您的 Spotify 库中，但它们执行该任务的方式不同。与 Discover Weekly 一样，Release Radar 使用人工策划和软件的组合来突出显示您最有可能从新专辑、EP 或单曲中欣赏的歌曲。相比之下，What&#39;s New 放弃了策展以支持全面性。它还具有专用接口元件的优点。作为播放列表，Release Radar 很容易在您可以添加到 Spotify 库中的所有其他播放列表中迷失。 Engadget 推荐的所有产品均由我们的编辑团队选择，独立于我们的母公司。我们的一些故事包括附属链接。如果您通过这些链接之一购买商品，我们可能会赚取会员佣金。由于您的隐私偏好，此内容不可用。在此处更新您的设置，然后重新加载页面以查看它。", "note_en": "Spotify is introducing a feature to notify people when their favorite artists and podcast producers have a new release to check out. Taking the form of a bell icon you’ll find at the top of the app’s home interface, the  What’s New panel collects new releases from bands, musicians and shows you follow on the platform. Spotify says the feature will update in real-time, with a blue dot overlaid on top of the bell icon indicating when the panel has been refreshed with new content. Spotify plans to roll out the feature to all Android and iOS users over the coming weeks.\n  In intent, What’s New is similar to Spotify’s existing  Release Radar playlist. They’re both designed to surface new content for you to add to your Spotify library, but the way they go about that task is different. Like  Discover Weekly, Release Radar uses a mix of human curation and software to highlight the songs you’re most likely to enjoy from a new album, EP or single. What’s New, by contrast, forgoes curation in favor of comprehensiveness. It also has the advantage of a dedicated interface element. As a playlist, it’s easy for Release Radar to get lost among all the other playlists you can add to your Spotify library.\n   All products recommended by Engadget are selected by our editorial team, independent of our parent company. Some of our stories include affiliate links. If you buy something through one of these links, we may earn an affiliate commission.\n   This content is not available due to your privacy preferences.  Update your settings here, then reload the page to see it.", "posttime": "2021-07-26 22:39:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "android,艺术,ios,adds,spotify", "title": "Spotify 在 iOS 和 Android 上添加了 What&#39;s New 提要，显示关注艺术家不断更新的新版本，并在未来几周内推出", "title_en": "Spotify adds a What's New feed on iOS and Android, showing continually updating new releases from followed artists, rolling out over the coming weeks", "transed": 1, "url": "https://www.engadget.com/spotify-whats-new-bell-icon-130053002.html", "via": "", "real_tags": ["android", "艺术", "ios", "adds", "spotify"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069800, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载 PDF 摘要：这是 1996 年 3 月在波士顿大学举行的“量子场论基础的历史和哲学反思”会议上的演讲。它将在本次会议的会议记录中发表。书目工具 代码和数据相关论文 关于 arXivLabs arXivLabs 是一个框架，允许合作者直接在我们的网站上开发和共享新的 arXiv 功能。与 arXivLabs 合作的个人和组织都接受并接受了我们的开放、社区、卓越和用户数据隐私价值观。 arXiv 致力于这些价值观，并且只与遵守这些价值观的合作伙伴合作。有一个可以为 arXiv 社区增加价值的项目的想法吗？了解有关 arXivLabs 以及如何参与的更多信息。", "note_en": "Download PDF  Abstract: This is a talk presented at the conference ``Historical and PhilosophicalReflections on the Foundations of Quantum Field Theory,&#39;&#39; at Boston University,March 1996. It will be published in the proceedings of this conference.\n      Bibliographic Tools      Code &amp; Data      Related Papers       About arXivLabs   arXivLabs is a framework that allows collaborators to develop and share new arXiv features directly on our website.\n  Both individuals and organizations that work with arXivLabs have embraced and accepted our values of openness, community, excellence, and user data privacy. arXiv is committed to these values and only works with partners that adhere to them.\n  Have an idea for a project that will add value for arXiv&#39;s community?   Learn more about arXivLabs and   how to get involved.", "posttime": "2021-07-26 22:38:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "温伯格,weinberg,arxivlabs", "title": "史蒂文温伯格：什么是量子场论，我们认为它是什么？ (1997)", "title_en": "Steven Weinberg: What Is Quantum Field Theory, and What Did We Think It Is? (1997)", "transed": 1, "url": "https://arxiv.org/abs/hep-th/9702027", "via": "", "real_tags": ["温伯格", "weinberg", "arxivlabs"]}, {"category": "", "categoryclass": "", "imagename": "6f1a43cc2a9dc613e1c05b5791e4ca8b.jpg", "infoid": 1069799, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它的街道在早上和下午都堵塞了，拥堵程度创下了历史新高。公共交通巴士闲置在拥挤不堪的僵局中，无法克服，即使有专门的红色车道，旨在加快乘客的通勤。 Uber 和 Lyft 等叫车服务将更多车辆带入该地区，使问题更加恶化。因此，在 2019 年，在大流行病席卷市中心之前，旧金山再次引发了一场有争议的、长达数十年的辩论，即是否向司机收取进入该市人口最密集地区的费用。尽管拥堵不是大流行前的问题，但该市仍在考虑增加的成本。据领导该市研究的旧金山县交通局发言人称，拥堵收费可能需要三到五年才能到达该市。但关于旧金山拥堵收费计划的细节已经浮出水面，这项努力将在今年年底达到一个关键点，届时监事会将决定是否推进该问题。如果是这样，根据最新的细节，旧金山的拥堵收费是如何运作的： • 进入拥堵收费区需要支付 6.50 美元的基本费用，并根据收入水平享受符合条件的折扣。如果您每年的收入超过 100,000 美元，您将全额支付。收入低于 46,000 美元的通勤者不会支付费用。 • 运输当局正在考虑两个定价区。其中之一将包括紧邻的市中心区域，包括金融区、唐人街、田德隆和市场南部社区。第二个更大的区域将扩大到包括北部海滩、俄罗斯山和渔人码头，以及南部的使命湾。 • 司机需要在工作日的早上 6 点到 9 点和下午 3:30 到 6:30 之间支付进入市中心的费用。交通当局的研究正在考虑是否推荐每日费用上限。\n• Uber 和Lyft 等网约车每次进入该区域将被收取费用，并且该费用可能会转嫁给乘客。 • 该研究正在为残疾司机、已经通过金门大桥或海湾大桥支付 FasTrak 通行费的市中心通勤者以及生活在定价区的居民权衡额外折扣。不过，大多数大流行前的市中心通勤者来自城市内部。根据 2010 年交通当局的一项研究，该市早在 2004 年就考虑实施拥堵收费，该研究是在大萧条后市中心拥堵达到当时的记录水平后委托进行的。根据这项研究，当时，它被视为一种管理随着城市和地区发展而出现的僵局并减少污染和温室气体的方法。报告发布后，拥堵情况进一步恶化，并在 2019 年达到顶峰，因为数十辆私家车和网约车驶入市中心；该计划旨在将 2019 年的拥堵水平降低 15%。根据城市研究，减少拥堵也意味着更可靠的公共交通，可以充分发挥公共交通专用车道的全部潜力，并帮助该市实现日益难以实现的零行人死亡零愿景目标。然而，这个问题引发了关于公平的问题，以及拥堵收费是否意味着有效地为特权通勤者私有化道路，这些通勤者可以负担进入市中心的日常费用，同时将低收入司机定价。\n“我相信最终我们将得出结论，并且应该得出结论，拥堵收费确实可以解决拥堵问题，”主管拉斐尔曼德曼在本月早些时候的县交通局会议上说。曼德曼承认拥堵收费“引起了严重的公平问题”，但支持将这种做法作为解决大流行之前“令人不快”和“不可接受”的拥堵水平的一种可能方式。拥堵收费的结构将影响数十万湾区居民的日常生活。加州大学伯克利分校交通研究所所长亚历山大·贝恩 (Alexandre Bayen) 表示，广泛的公众宣传是旧金山在制定拥堵定价计划时应采取的最重要步骤之一。 “您如何与合适的社区互动？你如何确定谁受到影响？如果你在没有好的替代方案的情况下将郊区的人搬走，他们可能会被淘汰，”拜恩说。 “所以我认为困难在于找到正确的问题来提出，这样你才能真正实现包容和公平的解决方案。” SFCTA 的工作人员说他们正在这样做。正在进行的研究中的最新细节已通过公众宣传获得。在向监事会提交建议之前，它计划举办虚拟市政厅、在线民意调查和几次公开委员会会议。公众可以通过电子邮件发送反馈至拥塞定价@sfcta.org。移动？我们的指南可让您搜索数十个城市、城镇和社区，以找到适合您的城市、城镇和社区。 Mission Bay 交通管理协会的经理 Wendy Silvani 告诉 The Chronicle，该社区的许多居民“不知道”旧金山可能会收取拥堵费，“而我们是该区域的一部分。”\nSilvani 最近帮助为 Mission Bay 居民组织了一次虚拟信息会议，他说“CTA 的下一轮外展确实有责任确保他们在所有这些蓝领社区并解释这一点。”从西雅图到洛杉矶，美国几个最大的城市也在权衡拥堵收费的利弊。纽约将在 2023 年成为全国第一个这样做的城市，加入新加坡、斯德哥尔摩和伦敦，这些城市已经实施了几十年的拥堵收费。在新加坡，Bayen 表示可能拥有技术最先进的拥堵收费计划，车辆必须安装一个设备，以便在车辆进入城市收费区时进行跟踪。旧金山距离达到这一点还有几年的时间。如果监事会在年底批准交通部门研究的建议，将引发另一轮关于该市究竟如何执行拥堵收费的研究。该市还需要获得加利福尼亚州立法机构的批准。由于雇主考虑是否要求员工在远程工作一年半后亲自报到，许多市中心的办公室仍然空无一人。一些雇主允许更大的灵活性。其他人说他们的工人可以永远在家工作。根据交通当局的数据，一些城市走廊和高速公路的拥堵正在恢复到接近大流行前的水平，其工作人员表示，它推进一项研究的原因之一是因为拥堵有可能恢复到之前的水平经济衰退和 2019 年。 Silvani 说，如果没有更好的公共交通选择，拥堵费就不可能发生。她说，考虑到市中心复苏的不确定性，努力应该集中在改善公共交通而不是拥堵收费上。\n西尔瓦尼说，“现在是考虑拥堵收费的时机不对”。 “参数在变化，我们还不知道它们是如何变化的。我们还需要一段时间才能知道。”编年史的旗舰新闻播客。在您最喜欢的应用上收听和订阅。单击下面的播放器以获取最新剧集。移动？我们的指南可让您搜索数十个城市、城镇和社区，以找到适合您的城市、城镇和社区。里卡多·卡诺 (Ricardo Cano) 负责《旧金山纪事报》(The San Francisco Chronicle) 的交通运输。在 2021 年加入 The Chronicle 之前，他在萨克拉门托的 CalMatters 和凤凰城的亚利桑那共和报担任该报的教育记者，报道 K-12 教育。他在弗雷斯诺州立大学获得新闻学学士学位。", "note_en": "Its streets were clogged mornings and afternoons with record levels of congestion. Public transit buses sat idly in gridlock too dense to overcome, even with the benefit of dedicated red-painted lanes meant to hasten passengers’ commutes. Ride-hailing services such as Uber and Lyft brought more vehicles into the area, worsening the problem.\n  So in 2019, before the pandemic emptied out downtown, San Francisco once again revived a controversial, decades-long debate about whether to charge drivers a fee to enter the city’s densest portions. And even though congestion isn’t the problem it was pre-pandemic, this added cost is still being considered by the city.\n  Congestion pricing is still three to five years from potentially arriving to the city, according to a spokesperson for the San Francisco County Transportation Authority, which is leading the city’s study. But details on what a congestion pricing plan could look like in San Francisco have emerged, and the effort will reach a critical point at the end of this year when the Board of Supervisors will decide whether to move forward on the issue.\n  If it does, here’s how  congestion pricing could work in San Francisco, based on the latest details:\n     • There would be a base fee of $6.50 to enter the congestion pricing zone with eligible discounts based on income level. If you make more than $100,000 a year, you’d pay the full amount. Commuters who make less than $46,000 would not pay a fee.\n  • The transportation authority is considering two pricing zones. One would encompass the immediate downtown area that includes the Financial District, Chinatown, Tenderloin and South of Market neighborhoods. The second, larger zone would be expanded to include North Beach, Russian Hill and Fisherman’s Wharf to the north, and Mission Bay to the south.\n   • Drivers would pay a fee for entering downtown on weekdays between 6 to 9 a.m., and 3:30 to 6:30 p.m.. The transportation authority study is considering whether to recommend a daily fees cap.\n  • Ride-hail vehicles such as Uber and Lyft would be charged for entering the zone per trip, and the fee is likely to be passed on to the passengers.\n  • The study is weighing additional discounts for drivers who are disabled, downtown commuters who already paid FasTrak tolls by crossing the Golden Gate or Bay bridges, as well as residents living in the pricing zones. Most pre-pandemic downtown commuters, though, came from within the city.\n  The city considered implementing congestion pricing as early as 2004, according to a 2010 transportation authority study that was commissioned after downtown congestion had reached then-record levels following the Great Recession.\n  Back then, it was viewed as a way to manage the gridlock that would come with a growing city and region and reduce pollution and greenhouse gases, according to the study.\n  Congestion only worsened after the report and reached a peak in 2019 as scores of private and ride-hailing vehicles descended into downtown; the program aimed to reduce 2019 congestion levels by 15%.\n  Less congestion would also mean more reliable public transit that could realize the full potential of transit-only lanes, according to city studies, and help the city reach its increasingly elusive Vision Zero goals of reaching zero pedestrian fatalities.\n  The issue, though, raises questions about equity, and whether congestion pricing would mean effectively privatizing roads for privileged commuters who could afford the daily fees to enter downtown while pricing out lower-income drivers.\n   “I believe that ultimately we will conclude, and should conclude, that congestion pricing does have a role in addressing congestion,” Supervisor Rafael Mandelman said at a County Transportation Authority meeting earlier this month.\n  Mandelman acknowledged congestion pricing “raises serious equity concerns,” but supported the practice as a possible way to address the “unpleasant” and “unacceptable” levels of congestion reached before the pandemic.\n  How congestion pricing is structured will affect the everyday lives of hundreds of thousands of Bay Area residents. Extensive public outreach is one of the most important steps San Francisco should take in crafting its congestive pricing plan, said Alexandre Bayen, director of UC Berkeley’s Institute of Transportation Studies.\n  “How do you engage with the right communities? How do you determine who gets impacted? If you displace people in suburban areas without good alternatives, they might be priced out,” Bayen said. “So I think the difficulty is to find the right questions to ask so that you have truly achieved an inclusive and equitable solution.”\n  Staff for the SFCTA say they’re doing just that. The latest details in the ongoing study have been informed by public outreach. Before it submits recommendations for the Board of Supervisors to consider, it plans to host virtual town halls, an online public opinion survey and several public committee meetings. The public can submit feedback via email at  congestion-pricing@sfcta.org.\n  Moving? Our guide lets you search dozens of cities, towns and neighborhoods to find the one that’s right for you.\n  Wendy Silvani, manager of the Mission Bay Transportation Management Association, told The Chronicle that many of the neighborhood’s residents “had no idea” that congestion pricing could be coming to San Francisco, “and we were part of the zone.”\n  Silvani, who recently helped organize a virtual information session for Mission Bay residents, said it “really is incumbent on this next round of outreach for the CTA to make sure they’re in all of those blue-collar neighborhoods and explaining this.”\n  From Seattle to Los Angeles, several of the nation’s largest cities are also weighing the merits of congestion pricing. New York will be the first in the nation to do it in 2023, joining Singapore, Stockholm and London, cities that have enforced congestion pricing for decades.\n  In Singapore, which Bayen said may have the most technologically advanced congestion pricing program, vehicles are required to have a device installed that tracks when a vehicle enters the city’s pricing zone. San Francisco is years away from getting to that point.\n  If the Board of Supervisors approves the transportation authority study’s recommendations at the end of the year, it would trigger another round of studies on how, exactly, the city would enforce congestive pricing. The city would also need approval to do it from the California State Legislature.\n    Many downtown offices remain empty as employers mull whether to require workers to report in person after more than a year and half of remote work. Some employers are allowing greater flexibility. Others have said their workers can work from home forever.\n   Congestion is returning to near pre-pandemic levels on some city corridors and highways, according to transportation authority data, and its staff said one of the reasons it’s moving forward with a study is because of the potential for congestion to return the way it did after the recession and in 2019.\n  Silvani said congestion pricing can’t happen without better public transit options. She said efforts should be focused on improving public transit instead of congestion pricing given the uncertainty of downtown’s recovery.\n  “This is kind of the wrong time” to be considering congestion pricing, Silvani said. “The parameters are changing, and we don’t know yet how they’re changing. And it’s going to be a while before we do know.”\n The Chronicle’s flagship news podcast.   Listen and subscribe on your favorite app. Click the player below for the latest episode.\n  Moving? Our guide lets you search dozens of cities, towns and neighborhoods to find the one that’s right for you.\n Ricardo Cano covers transportation for The San Francisco Chronicle. Before joining The Chronicle in 2021, he covered K-12 education at CalMatters based in Sacramento and at The Arizona Republic in Phoenix as the newspaper&#39;s education reporter. He received his bachelor&#39;s degree in journalism at Fresno State.", "posttime": "2021-07-26 22:38:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "拥堵,congestion", "title": "顺丰正在考虑市中心的“拥堵收费”。对于那些年收入 4.6 万美元的人", "title_en": "S.F. is considering downtown 'congestion pricing.' for those making $46K", "transed": 1, "url": "https://www.sfchronicle.com/sf/article/S-F-is-considering-downtown-congestion-16336449.php", "via": "", "real_tags": ["拥堵"]}, {"category": "", "categoryclass": "", "imagename": "9e043fc70b007e38cc98bc6216cbb31b.jpg", "infoid": 1069798, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "数以千计的白蚁看似无头，在地上爬行，携带和掉落沙粒。虽然白蚁没有建造计划，但有规律的沙柱图案却是凭空冒出来的。在这个白蚁-沙土系统中，白蚁提供能量，将沙子改造成一座活生生的动态建筑，与不断变化的环境持续耦合。 Bastiaens 的跨学科生物化学家和应用以及理论物理学家小组现在表明，在我们的细胞中发生了非常相似的情况，这些细胞使用化学势作为能源来产生由分子而不是沙粒组成的动态维持结构。使这种集体行为成为可能的失衡、充满活力的状态是生命物质的一种属性，可以在不断变化的世界中产生和稳定动态保持的身份。自组织过程的一个特征是随机波动，可以通过代理之间的局部交互放大。例如，当白蚁随机行走时，它们会捡起和掉落沙粒，这会导致沙子的密度发生波动。然而，在重新洗沙的过程中，白蚁会在它们携带的沙粒上留下信息素气味，这增加了另一只装载的白蚁随机经过的机会。这会导致沙堆的自我放大，从而耗尽自由沙粒。放大和耗尽的过程导致形成规则的沙柱图案，形成它们的巢穴的基础。这种现象被称为 stigmergy，意思是“在进行中的工作上留下标志”最早由法国动物学家 Pierre-Paul Grassé 在 1959 年描述，并解释了社会昆虫通过沙子的间接交流如何导致产生动态结构的集体行为例如沙柱，它们有规律地组织起来。白蚁蚁后通过释放信息素梯度与这种自组织的白蚁沙系统进行交流。这可以作为一个模板，在她周围建造一座动态建筑，以适应她不断增长的体型。为了研究白蚁-沙土系统的 stigmergic 集体行为的原理是否也适用于细胞形态发生中生物分子的自组织，Bastiaens 的小组通过将无生命的生物构建块封装在一个具有生命特性的合成细胞中可变形的脂质膜，并通过用 ATP/GTP 化学势为系统提供能量来赋予它们生命。这种现在失去平衡的封装系统由动态微管细胞骨架和光响应分子信号模块组成，其操作类似于自然形态发生素信号。在细胞形态发生中，新结构的出现是由于细胞骨架的动态重排使质膜变形。细胞外形态发生素通过与细胞膜上的受体结合来指导这一过程。通过重新平衡细胞内磷酸化反应循环，信息在细胞内被转导。这会产生局部促进细胞骨架生长的细胞内化学信号梯度。这位科学家通过设计一种光响应信号系统，将生物工程激酶转移到膜上，重新平衡了微管蛋白螯合分子 Stathmin 的磷酸化反应循环，从而重新创建了这一过程。因此，他们可以证明，真正促进细​​胞骨架生长的是这些磷酸化循环就像一个分子机器，不断地将微管构建块泵送到膜上。科学家们的想法被证明是正确的，因为他们栩栩如生的原始细胞表明，根据与白蚁相同的 stigmergic 原理，细胞骨架和信号系统通过与膜相互作用而自组织成不同的模式。砂系统。在细胞骨架的情况下，由微管局部生长形成的膜的小突起捕获了更多的微管，从而放大了耗尽游离微管的突起的生长。在信号系统的情况下，激酶向膜的募集导致耗尽游离激酶的自扩增簇。\n更重要的是，研究人员可以证明信号和细胞骨架系统之间的间接通信是由可变形膜介导的，导致自组织形状，如星状或极性结构。他们还可以证明，局部细胞外信号线索的运作类似于释放信息素的白蚁女王，提供了一个化学模板，指导自组织白蚁沙系统在她周围构建一个动态建筑。在原始细胞的情况下，信号梯度限制了双向通信信号和细胞骨架系统的自组织解决方案，以在细胞外线索的方向上重组生命样细胞。然而，这种对细胞外线索的反应在很大程度上取决于原始细胞的初始、自组织形状，这使得它们的反应对塑造它们的先前经验具有主观性。结果证明，两个递归相互作用的柱头系统的平衡决定了原始细胞的基础形态，例如它是否具有极地或星状形状。当基础信号主导微管诱导的膜变形时，原始细胞表现出星状形态，而当微管诱导的变形主导信号时，原始细胞变为极性。通过细胞外信号改变 stigmergic 系统之间的平衡可以将恒星重塑为极地形状，但反之则不然。这表明细胞的变形不仅仅由来自细胞外线索的单向信息流引导，而且还取决于由先前事件形成的细胞本身的形态。 “发育中的健康或患病组织中的细胞是否根据先前的经验对其环境做出反应，这是细胞和发育生物学领域的一个大问题。我们的工作表明，细胞的行为不像简单的输入输出机器，而是在对不断变化的环境的响应中整合了以前的经验。在发育中的组织中，细胞环境由其他细胞组成，我们的自组织原始细胞有可能通过机械传感的特性在它们之间建立递归通信，机械传感的特性来自信号传导和细胞骨架系统之间的递归耦合。因此，这使我们能够研究细胞内自组织分子系统之间的递归通信如何导致更高尺度的自组织组织形成”，Philippe Bastiaens 总结道。", "note_en": "Seemingly headless, thousands of termites crawl over the ground carrying and dropping sand grains. And although the termites do not have a construction plan, a regular pattern of sand pillars emerges as if from nowhere. In this termite-sand system the termites provide the energy to restructure the sand into a living, dynamic building that is in continuous coupling with an ever changing environment.\n Bastiaens’s interdisciplinary group of biochemists and applied as well as theoretical physicists has now shown that a very similar situation occurs in our cells that use chemical potential as an energy source to generate dynamically maintained structures consisting of molecules instead of sand grains. The out-of-equilibrium, energized state that enables this collective behavior is a property of living matter to generate and stabilize a dynamically maintained identity in an ever changing world.\n  One characteristic of self-organizing processes is random fluctuations that can be amplified by local interactions between agents. When termites make their random walks for example, they pick up and drop sand grains, which leads to fluctuations in the density of sand. However, during the reshuffling of the sand, the termites leave a pheromone scent on the sand grains that they have carried around that increases the drop chances of another loaded termite randomly passing by. This leads to a self-amplification of sand piles that depletes the free sand grains. The process of amplification and depletion leads to a regular pattern of sand pillars that forms the fundament of their nest.\n This phenomenon, called stigmergy, which means ‘leaving a sign on work in progress’ was first described by the French zoologist Pierre-Paul Grassé in 1959 and explains how the indirect communication of social insects via sand leads to a collective behavior that generates dynamical structures such as sand pillars, that are organized in a regular way. The termite queen communicates with this self-organizing termite-sand system by emitting a pheromone gradient. This functions as a template to have a dynamic building being built around her that adapts to her growing size.\n  In order to study if the principles of the stigmergic collective behavior of the termite-sand system also apply for the self-organization of biomolecules in cellular morphogenesis, Bastiaens’s group build a synthetic cell with life-like properties by encapsulating lifeless biological building blocks within a deformable lipid membrane and put life into them by energizing the system with ATP/GTP chemical potential. This now out-of-equilibrium encapsulated system consisted of a dynamic microtubule cytoskeleton as well as a light responsive molecular signaling module that operates akin to natural morphogen signaling.\n In cellular morphogenesis the emergence of new structures occurs by the deformation of the plasma membrane by dynamic rearrangements of the cytoskeleton. Extracellular morphogens guide this process by binding to receptors on the cell membrane. Information is transduced inside the cell by rebalancing intracellular phosphorylation reaction cycles. This generates intracellular chemical signaling gradients that locally promote growth of the cytoskeleton. The scientist have recreated this process by engineering a light responsive signaling system that translocates a bioengineered kinase to the membrane, which rebalances phosphorylation reaction cycles of the tubulin sequestration molecule Stathmin. They could thereby show that what actually promotes cytoskeletal growth is that these phosphorylation cycles operate like a molecular machine that continuously pumps microtubule building blocks towards the membrane.\n  The ideas of the scientists turned out to be true as their life-like proto-cells revealed that both the cytoskeleton as well as the signaling system self-organize into different patterns by interaction with the membrane according to the same stigmergic principles as the termite-sand system. In case of the cytoskeleton, a small protrusion of the membrane formed by the local growth of a microtubule captures more microtubules, thereby amplifying the growth of the protrusion that depletes the free microtubules. In case of the signaling system, the recruitment of the kinase to the membrane results in self-amplified clusters that deplete the free kinase.\n Even more, the researchers could show that indirect communication between the signaling and cytoskeletal system was mediated by the deformable membrane leading to self-organized shapes such as star-like or polar structures. They could also demonstrate that localized extracellular signaling cues operate akin to the pheromone emitting termite queen, providing a chemical template that directs the self-organizing termite-sand system to have a dynamic building being structured around her. In case of the proto-cells, the signaling gradient constrained the self-organizing solutions of the bi-directionally communicating signaling and cytoskeletal systems to reorganize the life-like cells in the direction of extracellular cues. However, this response to extracellular cues was very much dependent on the initial, self-organized shape of the proto cells, which makes their response subjective to their prior experience that shaped them.\n  The balance of the two recursively interacting stigmergic systems turned out to determine the basal morphology of the proto-cell, for example if it had a polar or star-like shape. When basal signaling dominated over microtubule-induced membrane deformation, proto-cells exhibited star-like morphology whereas when microtubule-induced deformations dominated over signaling, the proto cells became polar. Changing the balance between the stigmergic systems by an extracellular signal can reshape a star into a polar shape but not the other way around. This shows that morphing of cells is not solely guided by an unidirectional information flow from extracellular cues, but is also determined by the morphology of the cell itself as shaped by prior events.\n “Whether cells in a developing healthy or diseased tissue respond to their environment in dependence on prior experience is a big question in the field of cell and developmental biology. Our work shows, that cells do not behave like simple input-output machines but integrate previous experiences in their response to an ever changing environment. In a developing tissue the environment of cells consists of other cells and our self-organized proto-cells have the potential to establish recursive communication among them via the property of mechano-sensing that emerges from the recursive coupling between the signaling and cytoskeletal system. This could thereby enable us to investigate how recursive communication between self-organized molecular systems within cells leads to self-organized tissue formation at the higher scale”, concludes Philippe Bastiaens.", "posttime": "2021-07-26 22:37:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "细胞,cells", "title": "白蚁和细胞有什么共同点", "title_en": "What termites and cells have in common", "transed": 1, "url": "https://www.mpg.de/what-termites-and-cells-have-in-common?c=2249", "via": "", "real_tags": ["细胞", "cells"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069796, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "10.1088/1748-9326/ac13f1 燃烧化石燃料发电是造成部门级人为碳污染的最大单一因素。然而，由于全行业的政策往往难以实施，一些研究人员建议通过针对每个国家电力行业最极端的排放者来减少基于电力的二氧化碳排放。在这里，我们使用独特的国际数据源来衡量发电厂二氧化碳排放量的国家不成比例，并估计如果其最肆意挥霍的污染者降低排放强度，改用气体燃料，以及每个国家基于电力的二氧化碳排放量将减少的比例，以及结合碳捕获和储存系统。我们发现各国的不成比例差异很大，而且大多随着时间的推移而增长。我们还发现，根据高排放工厂采用的强度标准、燃料或碳捕获技术，可以消除全球 17% 至 49% 的发电二氧化碳排放量。这表明旨在改善“超级污染者”环境绩效的政策是向脱碳能源系统过渡的有效策略。由于本文的记录版本将/已经在 CC BY 3.0 许可下在黄金开放获取基础上发布，因此本已接受的手稿可立即在 CC BY 3.0 许可下重复使用。尽管已采取合理措施从第三方获得所有必要的许可，以将其受版权保护的内容包含在本文中，但在此已接受的手稿版本中可能不存在其完整的引文和版权行。在使用本文中的任何内容之前，请参阅 IOPscience 上发布的记录版本以获取完整的引用和版权详细信息，因为可能需要许可。所有第三方内容均受版权保护，除非在记录版本的图标题中明确说明，否则不会根据 CC BY 许可以黄金开放获取的方式发布。", "note_en": "10.1088/1748-9326/ac13f1      Combusting fossil fuels to produce electricity is the single largest contributor to sector-level, anthropogenic carbon pollution. Because sector-wide policies are often too unwieldy to implement, however, some researchers have recommended reducing electricity-based CO2 emissions by targeting the most extreme emitters of each nation&#39;s electricity industry. Here, we use a unique international data source to measure national disproportionalities in power plant CO2 emissions and estimate the fraction of each country&#39;s electricity-based CO2 emissions that would be reduced if its most profligate polluters lowered their emission intensities, switched to gas fuels, and incorporated carbon capture and storage systems. We find that countries&#39; disproportionalities vary greatly and have mostly grown over time. We also find that 17% to 49% of the world&#39;s CO2 emissions from electricity generation could be eliminated depending on the intensity standards, fuels, or carbon capture technologies adopted by hyper-emitting plants. This suggests that policies aimed at improving the environmental performance of &#34;super polluters&#34; are effective strategies for transitioning to decarbonized energy systems.\n     As the Version of Record of this article is going to be/has been published on a gold open access basis under a CC BY 3.0 licence, this Accepted Manuscript is available for reuse under a CC BY 3.0 licence immediately.\n  Although reasonable endeavours have been taken to obtain all necessary permissions from third parties to include their copyrighted content within this article, their full citation and copyright line may not be present in this Accepted Manuscript version. Before using any content from this article, please refer to the Version of Record on IOPscience once published for full citation and copyright details, as permission may be required. All third party content is fully copyright protected, and is not published on a gold open access basis under a CC BY licence, unless that is specifically stated in the figure caption in the Version of Record.", "posttime": "2021-07-26 22:36:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "减少,co2,排放", "title": "通过瞄准世界上污染严重的发电厂来减少二氧化碳排放", "title_en": "Reducing CO2 emissions by targeting the world's hyper-polluting power plants", "transed": 1, "url": "https://iopscience.iop.org/article/10.1088/1748-9326/ac13f1", "via": "", "real_tags": ["减少", "co2", "排放"]}]