[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1029853, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "产品经理的核心工作是通过影响利益相关者而不对他们施加权力来实现变革。这不是一件容易的事。但有了正确的工具，它就更容易接近了。\n在这里，我从心理学领域以及受过劝说培训的专家那里收集了一些强有力的原则和实用技巧，这样你就可以在你的想法背后获得支持。\n劝说是这篇文章的重点。其他主题，如构建正确的产品和做出可靠的决策，都不在讨论范围之内(将在未来的帖子中讨论)。\n这应该是不言而喻的，但要明智地使用这些技术。永远做对产品和客户都合适的事。\n我们喜欢认为我们是完全合乎逻辑和理性的存在。但我们不是。人类倾向于基于(通常是隐藏的)偏见和情绪做出决定。\n只要有可能，一定要把事实和数据带到谈判桌上。但是，别指望事实本身就能改变人们的想法。\n我们天生就会报答别人的恩惠。如果你明天想要一个合作伙伴，今天就帮他一个忙。但要提供真正的价值，而不仅仅是作为一种手段来获得你想要的东西。\n回报对你有利的另一种方式是从一个更大的(夸张的)要求开始，而这个要求很可能会被拒绝。然后向一个较小的要求让步。它比自己呈现时更有可能奏效。\n在某种程度上，这类似于视觉或音频错觉。即使你知道某些心理影响在起作用，你也很难抗拒。\n当你把精力投入到一个想法上时，你会记得更清楚。在你心目中，它变得更加重要。因此，邮件中的故意错误(如电子邮件中的打字错误)会使邮件变得更加重要，即使这些错误会招致批评(这是一种关注形式)。\n在我们做出决定的那一刻，有一种倾向，那就是证明我们的选择是明智的，并找到理由放弃其他选择。从这一点来看，认知不和谐和确认偏差在起作用。\n琐碎的请求增加了遵守较大请求的可能性。罗伯特·恰尔迪尼(Robert Cialdini)在“影响力”(Influence)一书中指出，一旦做出了小小的承诺，人们往往会为进一步的承诺增加理由。\n在其他条件相同的情况下，视觉说服比非视觉说服更有力。人类通常是视觉动物。使用视觉语言和视觉意象是有说服力的。更重要的是，如果你能让人想象这个场景，你甚至不需要一张实物照片。\n试着在会议中使用白板，边走边画出你的想法，或者在你的电子邮件/消息中附上简单的插图来传达你的想法。\n与上面关于可视化的几点相关，以及我们倾向于赋予我们更多思考的重要性，让你的利益相关者想象一个你的提案将会体现出来的未来是很有力量的。\n随着他们更多地考虑你提出的未来，他们更有可能看到让未来成为现实的机会。根据劝说作家斯科特·亚当斯(Scott Adams)的观察，人们往往会被他们最生动地想象的未来所吸引，即使他们不想要那个未来。\n如果你已经得到了一些其他利益相关者的支持，你的想法更有可能获得支持。\n你知道镇上那家因为受欢迎而受欢迎的餐厅吗？还是每个人都在谈论的电视节目，因为每个人都在谈论它？您的功能构思也可以是这样的。\n我们都喜欢被倾听。当我们与忽视我们的人交谈时，怨恨和挫败感就会积聚起来。我们互相夸夸其谈。谈话破裂了。\n当人们回应你的话时，要密切关注他们的细微变化。确认和承认另一个人的感受的一种方式就是贴上标签。给他们的情感起个名字。然后以这样的词开头：它看起来像……，它听起来像……，或者它看起来像。\n一旦你使用了标签，就要安静地倾听。给对方一个分享和展示的机会。\n美国联邦调查局人质谈判代表克里斯·沃斯(Chris Voss)表示，任何谈判中最甜蜜的两个词就是“没错”。如果你与利益相关者发生争执，你会想要把谈话引向正确的话题。\n正是在这一点上，他们感到被听到了，并准备好倾听你要说的话。他们在暗示他们相信你理解他们的观点。你们现在站在同一条战线上。您现在可以继续讨论了。", "note_en": "The core of a product manager&#39;s job is to make change happen by influencing stakeholders without exerting power over them. It is not an easy task. But it is much more approachable with the right tools.\n  Here I have curated some powerful principles and practical tips from the field of psychology as well as experts trained in persuasion so that you can rally support behind your ideas.\n  Persuasion is the focus of this post. Other topics such as building the right product and making robust decisions are out of scope (to be covered in future posts).\n  It should go without saying, but use these techniques wisely. Always do what&#39;s right for the product and for your customers.\n      We like to think we are perfectly logical and rational beings. But we are not. Humans tend to make decisions based on (often hidden) biases and emotions.\n  By all means, bring facts and data to the table wherever possible. But don&#39;t expect facts alone to change people&#39;s minds.\n      We are hardwired to reciprocate favours. If you want a partner&#39;s cooperation tomorrow, do that person a favour today. But offer real value, not just as a means to get what you want.\n  Another way in which reciprocation can work to your advantage is starting with a bigger (exaggerated) ask that is likely to get rejected. Then concede to a smaller request. It is more likely to work than when presented on its own.\n      In a way, this is similar to optical or audio illusions. Even if you know certain psychological effects are at play, it is hard to resist.\n      When you devote mental energy to an idea, you remember it better. In your mind, it becomes more important. For this reason, intentional &#34;errors&#34; in your message (such as a typo in your email) can make the message rise in importance, even as the errors attract criticism (which is a form of attention).\n                The moment we make a decision, there is a tendency to justify the wisdom of our choice and find reasons to dismiss the other options. From this point, cognitive dissonance and confirmation bias are at play.\n  Trivial requests increase the likelihood of compliance to larger requests. In the book Influence, Robert Cialdini noted that once a small commitment has been made, people tend to add justification to further commitments.\n      All else being equal, visual persuasion is more powerful than non-visual persuasion. Humans are generally visual creatures. Using visual language and visual imagery is persuasive. What&#39;s more, if you can make someone imagine the scene, you don&#39;t even need a physical picture.\n  Try using the whiteboard in a meeting and drawing out ideas as you go, or attaching simple illustrations in your emails/messages to convey your ideas.\n      Related to the above points about visualization and the importance we tend to assign to what we think about more, getting your stakeholder to &#34;imagine&#34; a future where your proposal will have manifested is powerful.\n  As they think about your proposed future more, they are more likely to see opportunities to make that future a reality. In persuasion writer Scott Adams&#39; observations, people tend to gravitate to the future they are imagining most vividly, even if they don’t want that future.\n      If you already have buy-in from some other stakeholders, you are more likely to gain support for your idea.\n  You know that restaurant in town that is popular   because   it is popular? Or the TV show that everyone is talking about   because   everyone is talking about it? Your feature idea can be like that too.\n      We all like to be heard. When we talk to people who ignore us, resentment and frustration build up. We talk past each other. Conversations break down.\n  Pay close attention to the subtle changes in people when they respond to your words. One way to validate and acknowledge the other person&#39;s feelings is by labeling. Give their emotion a name. Then lead with words such as &#34;it seems like...&#34;, &#34;it sounds like...&#34;, or &#34;it looks like...&#34;.\n  And once you have used a label, be quiet and listen. Give the person a chance to share and reveal.\n      According to FBI hostage negotiator Chris Voss, the sweetest two words in any negotiation are &#34;that’s right.&#34; If you are arguing with your stakeholder, you want to lead the conversation to a &#34;that&#39;s right&#34;.\n  It is at the point that they feel heard and become ready to listen to what you have to say. They are signaling that they believe you understand their perspective. You are now on the same page. You are now ready to move the discussion forward.", "posttime": "2020-10-20 01:41:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "产品经理,经理,product,视觉", "title": "对产品经理的劝说", "title_en": "Persuasion for Product Managers", "transed": 1, "url": "https://informedpm.com/posts/persuasion-product-manager", "via": "", "real_tags": ["产品经理", "经理", "product", "视觉"]}, {"category": "", "categoryclass": "", "imagename": "ec8aa7780b42869e97662fbdc5230696.jpg", "infoid": 1029852, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据安全记者布莱恩·克雷布斯(Brian Krebs)的一篇文章称，昨天，一家DDoS保护供应商禁用了Qanon和8chan相关网站的访问权限，导致数十个网站暂时下线。\n克雷布斯写道，这些名为8kun.net、8kun.top、8chan.se和qanonbin.com的网站通过总部位于美国的ISP VanwaTech连接到互联网，而VanwaTech的一端又有一个单点故障。服务于各种8kun/qanon站点的互联网地址条带受到保护，以免受到俄勒冈州希尔斯伯勒(Hillsboro)的严重且持续不断的分布式拒绝服务(DDoS)攻击。Based CNServers LLC.&#34；\n昨天，当安全研究员Ron Guilmette打电话给CNServers时，情况发生了变化，CNServers显然没有意识到它是在为网站提供安全保护。克雷布斯写道，在那通电话几分钟内，CNServers就告诉它的客户-在北爱尔兰贝尔法斯特注册的斯巴达主机有限公司-它将不再为斯巴达主机代表VanwaTech路由的254个互联网地址集提供DDoS保护。这254个地址包括与qanon和8chan有关的几十个地址，8chan现在被称为8kun。\nKrebs写道，这些网站没有长时间处于离线状态，因为Spartan Host很快改变了设置，这样VanwaTech的互联网地址就不会受到俄罗斯圣彼得堡的DDoS-Guard[.]Net公司的攻击。\n尽管昨天的停电没有持续很长时间，但它说明了Qanon和8chan相关网站保持在线的困难。Facebook本月宣布禁止与QAnon阴谋论者组织相关的页面和群组，称Qanon页面庆祝和支持暴力，并助长了其他形式的现实世界伤害，包括最近声称西海岸野火是由某些团体挑起的，这分散了当地官员对扑救火灾和保护公众的注意力。\n毫无根据的QAnon阴谋论声称，民主党政客、好莱坞演员和其他人是一个崇拜撒旦、贩卖儿童性交易的团伙的一部分，该团伙正在密谋反对特朗普总统。\n克雷布斯指出，8chan/8kun&34；与白人至上主义、新纳粹主义、反犹太主义、多起大规模枪击事件有关，并以托管儿童色情内容而闻名。2019年8月，Cloudflare切断了8chan网站对CDN和DDoS保护服务的访问，导致8chan网站下线。这发生在一名疑似恐怖分子枪手向8chan发布了一篇报道后不久，就在埃尔帕索沃尔玛一家门店杀害23人之前。CloudFlare首席执行官马修·普林斯(Matthew Prince)表示，8chan一再证明自己是仇恨的污水池，除了埃尔帕索枪击案外，还与多起枪击案有关。\n三个月后，8chan再次出现在8kun.net上，但由于DDoS攻击，它很难继续在线。该网站现在只包含一个到8kun.top的链接，也就是过去被称为8chan的地方的当前位置。\n万华科技(VanwaTech)首席执行官尼克·林(Nick Lim)在2019年11月为他的公司在让8kun网站保持在线方面所扮演的角色进行了辩护，他在Twitter上写道，我之所以这么做，是因为我真的相信言论自由，我相信保护人们免受网络安全攻击。\n斯巴达东道主创始人Ryan McCully昨天告诉Krebs，他打算保留VanwaTech作为客户。麦卡利告诉Krebs说，我们在决定允许什么与我们一起举办时遵循当地的法律，除了可能导致资源问题等的一些例外情况。仅仅因为我们托管了一些内容，它并没有说明我们做什么和不支持什么；我们的观点不会进入托管内容决策。", "note_en": "A few dozen QAnon and 8chan-related sites were knocked offline temporarily yesterday when a DDoS-protection vendor disabled their access, according to an  article by security reporter Brian Krebs.\n The websites—with names like 8kun.net, 8kun.top, 8chan.se, and qanonbin.com—are connected to the Internet via the US-based ISP VanwaTech, which in turn &#34;had a single point of failure on its end,&#34; Krebs wrote. &#34;The swath of Internet addresses serving the various 8kun/QAnon sites were being protected from otherwise crippling and incessant distributed-denial-of-service (DDoS) attacks by Hillsboro, Ore. based CNServers LLC.&#34;\n That changed yesterday when security researcher Ron Guilmette called CNServers, which apparently didn&#39;t realize it was providing security protection to the websites. &#34;Within minutes of that call, CNServers told its customer—Spartan Host Ltd., which is registered in Belfast, Northern Ireland—that it would no longer be providing DDoS protection for the set of 254 Internet addresses that Spartan Host was routing on behalf of VanwaTech,&#34; Krebs wrote. Those 254 addresses included the few dozen related to QAnon and 8chan, which is now known as 8kun.\n The websites didn&#39;t remain offline for long because Spartan Host quickly &#34;changed its settings so that VanwaTech&#39;s Internet addresses were protected from attacks by ddos-guard[.]net, a company based in St. Petersburg, Russia,&#34; Krebs wrote.\n  Though yesterday&#39;s outage didn&#39;t last long, it illustrates the difficulty QAnon and 8chan-related sites have had remaining online. Facebook this month  announced a ban on pages and groups related to the QAnon conspiracy-theorist group, saying that QAnon pages &#34;celebrate[d] and support[ed] violence&#34; and contributed to other &#34;forms of real-world harm including recent claims that the west coast wildfires were started by certain groups, which diverted attention of local officials from fighting the fires and protecting the public.&#34;\n The baseless  QAnon conspiracy theory claims that Democratic politicians, Hollywood actors, and others are part of a Satan-worshipping, child sex-trafficking ring that is plotting against President Trump.\n 8chan/8kun &#34;has been linked to white supremacism, neo-Nazism, antisemitism, multiple mass shootings, and is known for hosting child pornography,&#34; Krebs noted. The primary 8chan website was  knocked offline in August 2019 when Cloudflare cut off its access to CDN and DDoS-protection services. That occurred shortly after a suspected terrorist gunman posted a screed to 8chan just before killing 23 people at an El Paso Walmart store. Cloudflare CEO Matthew Prince said that &#34;8chan has repeatedly proven itself to be a cesspool of hate,&#34; with ties to multiple shootings in addition to the El Paso one.\n Three months later,  8chan reappeared at 8kun.net but struggled to stay online because of DDoS attacks. The site now contains little more than a link to 8kun.top, the current location of what used to be called 8chan.\n  VanwaTech CEO Nick Lim in November 2019  defended his company&#39;s role in keeping 8kun websites online,  writing on Twitter, &#34;I do what I do because I truly believe in free speech and I believe in protecting people from cyber security attacks.&#34;\n Spartan Host founder Ryan McCully told Krebs yesterday that he intends to keep VanwaTech as a customer. &#34;We follow the &#39;law of the land&#39; when deciding what we allow to be hosted with us, with some exceptions to things that may cause resource issues etc.,&#34; McCully told Krebs. &#34;Just because we host something, it doesn&#39;t say anything about [what] we do and don&#39;t support; our opinions don&#39;t come into hosted content decisions.&#34;", "posttime": "2020-10-20 00:57:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "供应商,protection,网站", "title": "Qanon/8chan网站在被DDoS保护供应商赶下台后重新上线", "title_en": "QAnon/8chan sites back online after being ousted by DDoS-protection vendor", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/10/qanon-8chan-sites-back-online-after-being-ousted-by-ddos-protection-vendor/", "via": "", "real_tags": ["供应商", "网站"]}, {"category": "", "categoryclass": "", "imagename": "48dfc7975b4f142410c028b4f31f896f.png", "infoid": 1029851, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，苹果推出了一个名为Apple Music TV的24小时流媒体视频频道，该频道将主要播放音乐视频，让人回想起MTV的早期-但在这一次，它没有广告。\n观众可以在电视应用程序(在Mac、iPhone或Apple TV等苹果设备上)或音乐应用程序(在浏览选项卡中找到)中观看该频道。此外，你可以在www.apple.co/AppleMusicTV上找到它。\n它没有实时聊天功能，没有任何互动功能，而且与Apple Music应用程序完全没有集成(就像播放喜爱的歌曲一样)，所以用户可能会发现，与其他一些专注于音乐的流媒体服务相比，这项服务只是个基础服务。\n然而，那些只想回归早期马拉松音乐视频的MTV公式的人，每天24小时，几乎没有额外的华而不实，他们会发现这里有很多值得喜欢的地方。\n目前看来，该频道绝大多数时间都会播放人类精心策划的音乐视频。该频道的开幕式是一场马拉松式的活动，汇集了苹果音乐(Apple Music)上最热门的100个音乐视频。其他一些特别活动也将紧随其后--比如在10月22日举办为期一天的布鲁斯·斯普林斯汀(Bruce Springsteen)活动，展示视频和采访，以配合斯普林斯汀的新专辑。此外，苹果音乐电视(Apple Music TV)将在每周五推出新的音乐视频。\nApple Music TV将不需要订阅Apple Music或Apple TV+，但目前该频道只在美国提供，可能是因为许可限制。\n提供这个频道将让苹果有地方播放它已经制作的一些与音乐相关的内容，尽管该公司尚未表示是否计划在那里播放纪录片(比如苹果电视+上由斯派克·琼兹(Spike Jonze)执导的获奖纪录片“野兽男孩的故事”(Beastie Boys Story))。\n该频道在数亿活跃的苹果设备上的可用性也将使其成为该公司的营销工具，特别是在宣传与Apple Music服务有关系的艺人方面。", "note_en": "Today, Apple launched a 24-hour streaming video channel called Apple Music TV that will harken back to the early days of MTV by playing mostly music videos—but in this case, it&#39;s ad-free.\n Viewers will be able to watch the channel in either the TV app (on an Apple device like a Mac, iPhone, or Apple TV) or the Music app (it&#39;s found in the Browse tab). Additionally, you can find it at   apple.co/AppleMusicTV.\n There is no live chat, there aren&#39;t any interactive features, and there&#39;s no integration at all with the Apple Music app (like the ability to favorite songs), so users may find the service is barebones compared to some other music-focused streaming offerings.\n However, those who just want the return of the early MTV formula of marathoning music videos 24 hours a day with few additional frills will find a lot to like here.\n It currently seems like the channel will stream human-curated music videos the vast majority of the time. The opening act for the channel is a marathon of the top 100 music videos streamed on Apple Music. Other special events will follow—like a day-long Bruce Springsteen event featuring videos and interviews on October 22 to coincide with Springsteen&#39;s new album. Also, Apple Music TV will debut new music videos each Friday.\n Apple Music TV will not require a subscription to Apple Music or Apple TV+, but for now, the channel is only available in the United States, likely due to licensing restrictions.\n Offering this channel will give Apple a place to air some of the music-related content it has already produced, though the company hasn&#39;t yet said whether it plans to air documentaries (like the award-winning, Spike Jonze-directed  Beastie Boys Story on Apple TV+) there.\n The channel&#39;s availability on hundreds of millions of active Apple devices will also make it a marketing tool for the company, especially in terms of promoting artists that have a relationship with the Apple Music service.", "posttime": "2020-10-20 00:57:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,视频,music,音乐", "title": "苹果将通过Apple Music TV频道重新推出音乐视频广播", "title_en": "Apple is bringing music video broadcasting back with Apple Music TV channel", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/10/apple-is-bringing-music-video-broadcasting-back-with-apple-music-tv-channel/", "via": "", "real_tags": ["apple", "苹果", "视频", "music", "音乐"]}, {"category": "", "categoryclass": "", "imagename": "c202a891060db6f4d7b326eecd5139d2.jpg", "infoid": 1029850, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "传统的树莓PI是一台带有大量端口的单板计算机。计算模块略有不同。这些模块上系统的变体是更紧凑的单板计算机，没有任何传统端口。\n它允许您使用传统的Raspberry PI创建原型，然后订购一系列计算模块以嵌入到您的商业产品中。埃本·厄普顿(Eben Upton)在Raspberry Pi博客上写道：“我们每年销售的700万台树莓PI中，有一半以上用于工业和商业应用，从数字标牌到瘦客户端，再到流程自动化。”\nRaspberry PI 4和Compute Module 4之间的一些东西非常相似，例如采用VideoCore VI显卡的基于ARM的64位处理器。对于以前的计算模块客户来说，这将是一次巨大的升级。\n尤其是对于H.265视频采用4Kp60硬件解码，对于H.264视频采用1080p60硬件解码，对于H.264视频采用1080p30硬件编码，可以获得更好的视频性能。您还可以利用双HDMI接口以每秒60帧的速度连接最多两个4K显示器。\n计算模块4的另一个重大变化是有大量的选项。您可以选择采用或不采用无线技术(Wi-Fi和蓝牙)、1 GB、2 GB、4 GB或8 GB RAM、8 GB、16 GB或32 GB eMMC闪存的计算模块。还有一种型号没有任何eMMC闪存，以防您想使用外部eMMC或SD卡接口。\n您可以混合搭配这些规格，以在规模上降低成本。结果是，计算模块4有32种不同的版本，价格从25美元(无无线，1 GB内存，‘Lite’eMMC)到90美元(无线，8 GB内存，32 GB eMMC)不等。\n与以前的Compute Module相比，外形发生了变化，这意味着您将需要一个新的Compute Module IO板来利用所有接口并开始开发。它的价格是35美元。", "note_en": "A traditional Raspberry Pi is a single-board computer with a ton of ports sticking out. Compute Modules are somewhat different. Those system-on-module variants are more compact single-board computers without any traditional port.\n It lets you create a prototype using a traditional Raspberry Pi, and then order a bunch of Compute Modules to embed in your commercial products. “Over half of the seven million Raspberry Pi units we sell each year go into industrial and commercial applications, from digital signage to thin clients to process automation,” Eben Upton  wrote on the Raspberry Pi blog.\n  Some things are strictly similar between the Raspberry Pi 4 and the Compute Module 4, such as the 64-bit ARM-based processor with VideoCore VI graphics. This is going to represent a huge upgrade for previous Compute Module customers.\n In particular, you get much better video performance with 4Kp60 hardware decode for H.265 videos, 1080p60 hardware decode for H.264 videos, 1080p30 hardware encode of H.264 videos. You can also take advantage of the dual HDMI interfaces to connect up to two 4K displays at 60 frames per second.\n  Another big change with the Compute Module 4 is that there are  a ton of options. You can choose compute modules with or without wireless technologies (Wi-Fi and Bluetooth), with 1GB, 2GB, 4GB or 8GB of RAM, with 8GB, 16GB or 32GB of eMMC flash storage. There’s also a model without any eMMC flash storage in case you want to use external eMMC or the SD card interface.\n You can mix-and-match those specs to keep your costs down at scale. The result is that there are 32 different versions of the Compute Module 4 ranging from $25 (no wireless, 1GB of RAM, ‘Lite’ eMMC) to $90 (wireless, 8GB of RAM, 32GB of eMMC).\n The form factor has changed compared to the previous Compute Module, which means that you’ll need a new Compute Module IO Board to take advantage of all the interfaces and start developing. It costs $35.", "posttime": "2020-10-20 00:53:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "raspberry-pi,pi,硬件", "title": "\nRaspberry Pi Foundation推出面向工业用户的计算模块4", "title_en": "\n\t\t\t\tRaspberry Pi Foundation launches Compute Module 4 for industrial users\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/19/raspberry-pi-foundation-launches-compute-module-4-for-industrial-users/", "via": "", "real_tags": ["pi", "硬件"]}, {"category": "", "categoryclass": "", "imagename": "424092b0899178aabc16e3d041fa5bd2.jpg", "infoid": 1029849, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌(Google)以21亿美元收购Fitbit的交易可能会成为唯一一笔同时符合大流行前和大流行后条件的合并。\n推动新闻：欧盟反垄断监管机构再次延长了决定的最后期限，这一次是到2021年1月8日。而且，美国当局可能会进一步复杂化，他们正在起草针对谷歌和/或其母公司Alphabet的更广泛的反垄断案件。这笔交易最初是在2019年11月1日宣布的。\n推迟的原因在于数据：谷歌一直表示，此次收购以设备为中心，但仅凭这一点并不能减轻监管机构对这些设备收集的信息会发生什么的担忧。\n据路透社(Reuters)报道，谷歌最近向欧盟委员会(European Commission)做出了让步：它将限制Fitbit数据用于谷歌广告，为寻求连接Android平台的可穿戴设备竞争对手提供便利，并允许第三方在征得Fitbit用户同意的情况下继续访问他们的数据。\n这些修订似乎让欧盟感到满意，但一旦外部批评人士分析，这种情况可能会改变。另外，还有那些讨厌的美国人。\n如果欧洲或美国的监管机构阻止这笔交易，谷歌将被要求向Fitbit支付2.5亿美元。\nIDC报告称，从2019年第二季度到2020年第二季度，Fitbit&#39；在整个可穿戴设备市场的份额下降了近30%，从4.6%下降到2.9%，手腕可穿戴设备市场的份额也下降了类似的比例，从9.8%下降到7.3%。\n在2020年的大部分时间里，Fitbit股票的交易价格都低于每股7美元，尽管谷歌的交易对其的现金估值为每股7.35美元。\n一句话：这不是过去12个月世界上规模最大、影响最大的科技公司并购案，但却是最令人担忧的。", "note_en": "Google&#39;s $2.1 billion deal for Fitbit might go down as the only merger to qualify as both pre-pandemic and post-pandemic.\n Driving the news: European Union antitrust regulators have again extended their decision deadline, this time to Jan. 8, 2021. And it could be further complicated by U.S. authorities, who are drawing up a broader antitrust case against Google and/or its parent company Alphabet. The deal was originally announced on Nov. 1, 2019.\n The delay is about data: Google has always said the acquisition is centered on devices, but that alone hasn&#39;t allayed regulator fears over what happens to the information those devices collect.\n Reuters  reports that Google recently offered concessions to the European Commission: It would &#34;restrict the use of Fitbit data for Google ads, facilitate rival makers of wearables seeking to connect to the Android platform and allow third parties’ continued access to Fitbit users’ data with their consent.&#34;\n These revisions appear to have satisfied the EC, but that could change once analyzed by outside critics. Plus, again, there are those pesky Americans.\n Were regulators to block the deal, in Europe or the U.S., Google would be required to pay Fitbit $250 million.\n  IDC  reports that Fitbit&#39;s piece of the overall wearables market fell nearly 30% between Q2 2019 and Q2 2020, from 4.6% to 2.9%, while its share of the wrist-worn wearables market fell by a similar percentage, from 9.8% to 7.3%.\n Fitbit stock has spent most of 2020 trading below $7 per share, even though Google&#39;s deal would value it at $7.35 per share in cash.\n The bottom line: This isn&#39;t the world&#39;s largest or most consequential tech merger of the past 12 months, but it is the most fraught.", "posttime": "2020-10-20 00:53:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,rust,fitbit", "title": "欧盟反垄断监管机构再次将谷歌/Fitbit合并的决定截止日期延长至2021年1月8日；与此同时，Fitbit的市场份额继续流失", "title_en": "EU antitrust regulators again extend their decision deadline on the Google/Fitbit merger, to Jan. 8, 2021; meanwhile Fitbit keeps hemorrhaging market share", "transed": 1, "url": "https://www.axios.com/google-fitbit-deal-pre-post-pandemic-merger-eca12d38-0b77-4ffe-8a1e-579eda9f92e5.html", "via": "", "real_tags": ["谷歌", "google", "rust", "fitbit"]}, {"category": "", "categoryclass": "", "imagename": "83ca3f00b5bb7b1551b3cd5dde085c7d.png", "infoid": 1029848, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Juniper Networks表示，将以4.5亿美元收购128 Technology，此举将使其通过其网络投资组合获得更多基于人工智能的功能。\n该公司表示，将以现金和承担股权奖励的方式收购128 Technology。Juniper表示，128科技发行了专注于保留的限制性股票单位，这些单位将由Juniper承担。\nJuniper一直在通过收购加强其人工智能专业知识和投资组合。2019年，Juniper以4.05亿美元收购了Mist Systems。自从收购Mist以来，Juniper一直在为其投资组合和分析添加人工智能网络工具。\n这笔与128科技公司的交易预计将在瞻博网络第四财季完成，并将略微增加2021财年的收入，但会稀释非公认会计准则的收益。128技术将驻留在Juniper的人工智能驱动的企业业务部门。128科技拥有120名员工，300多名客户，年收入约1.2亿美元。\nJuniper表示，该计划将把128科技的Session Smart Networking与其园区和分支机构产品组合以及Mist AI平台结合起来。两家公司的目标是使用人工智能来优化语音、5G和协作的网络和用户体验。\n128 Technology的平台基于实时用户会话和业务策略(而不是静态系统)做出网络决策。Juniper将把128技术与其广域网保证软件相结合，并计划提供AIOps、异常检测、安全和自动驾驶网络。", "note_en": "Juniper Networks said it will acquire 128 Technology for $450 million in a move that will give it more artificial intelligence-based features through its networking portfolio.\n The company said it will it will  acquire 128 Technology with cash and assumption of equity awards. Juniper said  128 Technology issued retention focused restricted stock units that&#39;ll be assumed by Juniper.\n Juniper has been beefing up its AI expertise and portfolio via acquisitions. In 2019,  Juniper bought Mist Systems for $405 million. Since the purchase of Mist, Juniper has been adding AI networking tools for its portfolio and analytics.\n  The 128 Technology deal is expected to close in Juniper&#39;s fiscal fourth quarter and to add slightly to fiscal 2021 revenue, but dilutive to non-GAAP earnings. 128 Technology will reside in Juniper&#39;s AI Driven Enterprise business unit. 128 Technology as 120 employees, more than 300 customers and about $120 million in annual revenue.\n According to Juniper, the plan is to combine 128 Technology&#39;s Session Smart networking with its campus and branch portfolio and its Mist AI platform. The two companies will aim to use AI to optimize the network and user experiences for voice, 5G and collaboration.\n  128 Technology&#39;s platform bases networking decisions on real-time user sessions and business policies instead of static systems. Juniper will integrate 128 Technology with its WAN Assurance software with plans to offer AIOps, anomaly detection, security and self-driving networks.", "posttime": "2020-10-20 00:52:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,juniper,网络", "title": "Juniper宣布有意以4.5亿美元收购128 Technology，以在Juniper的网络产品中提升基于人工智能的功能", "title_en": "Juniper announces intent to acquire 128 Technology for $450M, to boost AI-based features across Juniper's networking products", "transed": 1, "url": "https://www.zdnet.com/article/juniper-acquires-128-technology-for-450-million-as-it-builds-out-its-ai/", "via": "", "real_tags": ["人工智能", "juniper", "网络"]}, {"category": "", "categoryclass": "", "imagename": "572f5ba6d69052b56e362515581b2327.png", "infoid": 1029845, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您在MacOS或iOS中发现了错误。软件中的某些东西不能正常工作。你决定让苹果知道，然后前往http://bugreport.apple.com，用你的苹果ID登录。你填写了所需的表格，列出了复制步骤，点击了特殊的键和弦，生成了一个胖乎乎的系统诊断，附上了一些屏幕截图，希望他们能修复它。\n所有的bug都是通过一个叫做雷达的内部应用程序来跟踪的；苹果内部员工只需将bug直接登录到这个应用程序中即可。外部人员使用网站“Bug Reporter”，该网站只显示特定开发人员与该错误的交互，并隐藏该错误的所有其他详细信息。这些细节是工程师的意见、bug的进度、他们何时“期望”修复它或修复它的版本，以及优先级。优先级对于bug来说很重要；如果没有设置优先级，它们就被认为是“未筛选的”。具有高优先级(1)的错误很可能得到修复，而具有较低优先级(3或4)的错误不太可能得到修复。\n每个错误都放在一个特定的顶级组件中，该组件可以有子组件。精明的内部开发人员会将Bug直接记录到Bug对应的组件中，例如“AppKit/NSTableView”。这将把它直接送到需要查看它的合适的人手中。顶级组件有一个很大的下落区域，一般的bug可能会落入其中，例如“iTunes/All”。这些组件充斥着错误报告。\n一旦你的虫子击中雷达，就会有人看着它。开发人员支持通常会首先查看与SDK/编程问题相关的错误。然后，它们将把它传递给更具体的顶级组件，或者直接传递给更具体的组件(即：NSWindow)。\n这就是事情变得混乱的地方，这取决于你的错误所在的组件，因为错误管理依赖于团队。许多团队只有一两个QA人员来对那些大的投放区域进行错误的初始筛选。QA工程师有时会接到指示，在将错误传递给负责代码的工程师之前，要优先筛选错误并“修复期限”。这很可怕，因为许多工程师不会查看优先级较低的错误。对于“拥有代码”的工程师来说，查看错误并确定优先级要好得多。QA工程师经常要筛选大量积压的错误，一些错误可能需要几周甚至几个月的时间才能筛选出来。有时，这会导致对错误进行大规模筛选，将所有错误标记为低优先级。错误发起者必须注意到这一点，并对此进行抱怨，以获得更高的优先级。更糟糕的是，一些组织大量关闭了超过一年左右的错误，如果问题仍然存在，他们会要求发起者重新打开错误。很多人没有注意到需要验证的bug，它们只是迷失了方向。\n从内部开发人员的角度来看，花时间记录一个详细的bug是相当令人沮丧的，结果却看到它一周又一周地“未筛选”。看到这种情况发生在你的虫子身上是令人沮丧的。但更糟糕的是，有时你的bug会上当受骗。其他人稍后会记录相同的错误，并且您的旧错误报告会被复制到该错误中。通常情况下，这仅仅是因为延迟了对错误的筛选。\n从外部开发人员的角度来看，情况甚至更糟。当错误正在进行时，几乎没有关于它们的反馈。您不知道bug的优先级，也不知道它是否被查看和筛选过。这是苹果故意不透明。更高的透明度可能很容易泄露功能或产品，因此这是意料之中的。\n希望一个bug最终会有一个单独的工程师来处理代码。许多这样的漏洞仍将不会被筛查，苹果的工程师们似乎厌恶筛查漏洞的过程。所以他们让他们坐一段时间，有时是几周或几个月。人们宁愿专注于编写新的代码，或者致力于他们必须修复的已经筛选出来的错误，而不是花时间阅读错误报告并计算出需要对其做些什么。他们不需要马上阅读并修复它，只需做一个筛选：确定优先级，何时修复(这有时是含糊不清的)，并可能要求发起人提供更多信息(或将其标记为副本)。\n工程师也不喜欢筛选bug，因为有时他们不得不将它们添加到当前版本的队列中。这增加了他们发布该版本所需的工作量，这是人们不喜欢做的事情。因此，取而代之的是，许多细菌没有经过筛选。\n未筛选的错误指示需要修复的潜在软件问题。显然，这很糟糕，管理层不喜欢有高的未筛选的错误数量。经理们会经常指示工程师筛选错误，或者让QA工程师来做这件事(这是不好的)。\n有时QA屏幕会出现优先级较低的错误，并将其保留下来。他们永远不会被转移到适当的代码工程师那里，实际上会在系统中迷失方向。可悲的是，这种情况我见得太多了。\n具有低优先级和模糊的未来修复日期的错误也会丢失。它们很少会被重新检修和修复。有时候这也没什么大不了的。有些错误太隐蔽或太罕见，无法花时间修复。\n一些错误所有者不想花时间与发起者来回查找他们可能需要的一些信息。他们长时间坐在bug上，最终试图在未发布的操作系统的较新版本上重现bug。他们不能复制它，所以他们只是假设它是固定的，然后把它发回给发起人。这对外部开发人员尤其不利，我将在下面描述原因。\n当错误作为已修复的错误发回时，引发该错误的内部开发人员应该验证问题是否已解决。如果问题没有解决，他们可以把它送回去。然而，内部开发人员并没有真正的动机去验证错误。管理层不会跟踪需要验证的bug，也不会真正要求开发人员对其进行验证。大多数工程师确实会验证错误；他们喜欢确保问题得到解决。但外部开发人员却陷入了更加悲哀的境地。虫子就会对它们关闭，并且已经死了。\n当错误被修复时，外部开发人员确实会收到通知，但只有在操作系统的公共版本中提供修复后才会收到通知。这意味着一些错误可能需要大约一年的时间才能回到外部开发者那里，因为在操作系统向公众发布之前，错误就已经开始修复了。*通常情况下，该错误会要求外部开发人员通过安装最新的操作系统来验证该错误。对于包括我在内的一些人来说，这是不可能的；他们需要运行和支持较旧的操作系统，并且没有能力在特定的机器上安装较新的操作系统。或者，他们只是不想安装最新的操作系统，因为它没有他们想要或需要的任何东西(那就是我，我运行10.13)。即使他们真的安装了操作系统，他们也可能会发现错误并没有修复。在这一点上，已经太晚了；工程技术很可能已经关闭了这个错误，它迷失在了以太中。\n这很简单：内部工程师需要承担更多责任，及时筛选错误。管理层需要让工程师有更多的时间来做这件事，这是以开发功能或修复已经屏蔽的错误为代价的。工程师应该总是被期望有一个非常低的未筛选的错误数量。\n内部工程师需要在将错误发回给他们时立即验证这些错误。他们需要安装操作系统的测试版，并进行一些测试。如果没有修好，就把它送回去。\n如果错误报告指的是某个问题，那么开发人员应该查看与所描述的区域交互的代码，并尝试考虑是什么导致了这种问题的发生。例如，如果一个按钮在iTunes中被错误地禁用，那么开发人员应该试着找出为什么会发生这种情况，而不是仅仅询问“如何再现这个？”\n当我在苹果工作的时候，我实践了我现在所宣扬的东西。我会在一天左右的时间里筛选出我所有的虫子。我会在一周左右的时间内验证错误。我会仔细查看代码，并尝试对无法重现的错误进行理论上的修复。我觉得这是我工作的一部分，我只是把这些事情当作日常任务来做。\n显然，您必须记录错误报告。记录缺少信息的bug是可以的；开发人员可以询问他们需要的详细信息。一般而言，对于与AppKit相关的错误，我会发现“系统诊断”很少能提供任何有用的信息。我不喜欢人们(通常是QA，而不是编写代码的工程师)问我要系统诊断，而我知道这不会帮助他们弄清楚任何事情。\n日志重复。如果您知道其他人记录了错误，但您遇到了相同的问题，则记录相同的错误。它将被标记为副本，但这将有助于提高错误的优先级。这是可悲的，但苹果确实考虑到了这一点，并对“高复制数量”的错误进行了研究。", "note_en": "You find a bug in macOS or iOS. Something in the software isn’t working the way it should work. You decide to let Apple know, and head over to  http://bugreport.apple.com and login with your Apple ID. You fill out the required form, list the reproduction steps, hit the special key chord to generate a fat sysdiagnose, attach some screen shots, and hope they fix it.\n  All bugs are tracked with an internal application called Radar; internal Apple employees simply log bugs directly into this application. External people use the website “Bug Reporter”, which only shows specific developer interactions with the bug, and hide all other details of the bug. Those details are engineer comments, progress on the bug, when they “expect” to fix it or which build it is fixed in, and priority. Priority is important for bugs; they are considered “unscreened” if they don’t have a priority set. Bugs with a high priority (1) are highly likely to get fixed, whereas bugs with a lower priority (3 or 4) are not likely to ever get fixed.\n Each bug is placed into a particular top level component, which can have sub components. Savvy internal developers will log bugs directly into the component that the bug corresponds to, such as “AppKit / NSTableView”. This will get it directly to the right person who needs to look at it. Top level components have a large dropping areas that generic bugs can fall into, such as “iTunes / All”. These components get saturated with bug reports.\n Once your bug hits Radar someone will look at it. Developer Support will often take a first look at bugs that are related to SDK/programming issues. They will then pass it on to a more specific top level component, or directly to a more specific component (ie: NSWindow).\n This is where things get screwy depending on the component your bug lands in, since bug management is group dependent. Many groups will have only one or two QA people to do the initial screening of those large drop areas for bugs. QA engineers are sometimes instructed to screen bugs with a priority and “fix period” before passing them off to the engineer responsible for the code. This is terrible because many engineers will not look at bugs with a low priority. It is much better for the engineer who “owns the code” to look at a bug and determine the priority. The QA engineers will frequently get a huge back log of bugs to screen, and it can take weeks, or even months, for some bugs to get screened. Sometimes this leads to a mass screening of bugs, marking them all with a low priority . Bug originators have to notice this, and complain about it for the priority to get increased. Worse yet, some groups mass close bugs older than a year or so, and ask the originator to re-open the bug if the issue still exists. A lot of people don’t pay attention to bugs that need verification, and they simply become lost.\n From an internal developer’s perspective, it was quite frustrating to take the time to log a detailed bug, only to see it sit “unscreened” for weeks and weeks. It is demoralizing to see this happen to your bugs. But worse yet, sometimes your bug would get forward-duped. Someone else at a later time logs the same bug, and your older bug report gets duplicated to it. More often than not, this is simply because of the delayed screening of bugs.\n From an external developer’s perspective, it is even worse. There is very little feedback on bugs when they are in progress. You don’t know what priority the bug has, or if it has even been looked at and screened. This is Apple intentionally being opaque. More transparency could easily leak features or products, so this is expected.\n Hopefully a bug ends up with an individual engineer who works on the code. A lot of these bugs will still be unscreened, and Apple engineers seem to loathe the process of screening bugs. So they let them sit around for a while, sometimes for weeks or months. People would rather focus on coding something new up, or working on already screened bugs that they  have to fix, as opposed to taking the time to read a bug report and figure out what needs to be done with it. They don’t have to read it and fix it right then, but just do a screening: determine priority, when to fix it (this is sometimes nebulous), and possibly ask the originator for more information (or mark it as a duplicate.)\n Engineers also dislike screening bugs because sometimes they have to add them to their queue for the current release. This increases their required workload for that release, which is something people don’t like doing. So, instead, many bugs stay unscreened.\n Unscreened bugs indicate potential software problems that need to be fixed. Obviously this is bad, and management doesn’t like to have high unscreened bug counts. Managers will frequently instruct engineers to screen bugs, or ask QA engineers to do it (which is bad).\n Sometimes QA screen bugs with a low priority and holds onto them. They  never get moved to the appropriate code engineers, and effectively become lost in the system. Sadly, I had seen this happen way too often.\n Bugs screened with a low priority and a nebulous-future fix date are also lost. They rarely will be revisited and fixed. Sometimes this is okay. Some bugs are just too obscure or rare to spend time fixing.\n Some bug owners don’t want to take the time to go back and forth with the originator to find out some piece of information they may need. They sit on bugs for a long time, and eventually try to reproduce a bug on a later version of the un-released OS. They can’t reproduce it, so they just assume it is fixed, and send it back to the originator. This is particularly bad for external developers, and I’ll describe why below.\n When a bug is sent back as fixed, the internal developer who originated the bug is supposed to verify the problem is resolved. They can send it back if the problem isn’t resolved. However, internal developers don’t really have an incentive to verify bugs. Management doesn’t keep track of bugs that need verification or really require developers to verify them. Most engineers do verify bugs; they like to make sure problems are resolved. But external developers are left in a more sad state. The bug becomes closed for them, and is dead.\n External developers do get notified when bugs are fixed, but only after the fix is available in a public release of the OS. This means it could take about a year for some bugs to get back to the external developer, since bugs start to get fixed *before* an OS is released to the public.  Generally, the bug will ask the external developer to verify the bug by installing the latest OS. For some people, including me, this just isn’t possible; they need to run and support an older OS, and don’t have the ability to install a newer OS on a particular machine. Or, they just won’t want to install the latest OS because it doesn’t have anything they want or need (that’s me, I run 10.13). Even if they do install the OS, they may find the bug isn’t fixed. At this point, it is simply too late; engineering has likely closed the bug, and it is lost in the ether.\n  It is simple: Internal engineers need to take more responsibility in promptly screening bugs. Management needs to allow engineers to have more time to do this, which is at the expense of working on features or fixing already screened bugs. Engineers should always be expected to have a very low unscreened bug count.\n Internal engineers need to promptly verify bugs when they are sent back to them. They need to install beta versions of the OS and do some testing. If it isn’t fixed, send it back.\n If a bug report refers to some problem, then the developer should look at the code that interacts with the area described and try to think about what would cause such a problem to happen. For instance, if a button is incorrectly disabled in iTunes, then the developer should try to figure out why that could happen instead of just asking for “how to reproduce this?”\n When I worked at Apple I practiced what I am now preaching. I would screen all my bugs within a day or so. I would verify bugs within a week or so. I would poke around at code and attempt to make theoretical fixes for bugs I couldn’t reproduce. I felt like it was part of my job, and I just did these things as a daily task.\n  Obviously, you have to log bug reports. It’s okay to log bugs that are missing information; developers can ask for specifics of what they need. In general, for AppKit related bugs, I would find that a “sysdiagnose” rarely would provide any useful information. I would hate it when people (usually QA, and not the engineers who worked on the code) would ask me for a sysdiagnose, when I know it wouldn’t help them figure anything out.\n Log duplicates. If you know someone else logged a bug, but you are encountering the same issue, then log the same bug. It will get marked as a duplicate, but this will help increase the priority of a bug. It is sad, but Apple does look at this, and bugs with “high dupe counts” are looked at.", "posttime": "2020-10-20 00:47:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,苹果,漏洞,记录,state", "title": "苹果记录漏洞的可悲状态(2019年)", "title_en": "The Sad State of Logging Bugs for Apple (2019)", "transed": 1, "url": "https://www.corbinstreehouse.com/blog/2019/03/the-sad-state-of-logging-bugs-for-apple/", "via": "", "real_tags": ["apple", "苹果", "漏洞", "记录", "state"]}, {"category": "", "categoryclass": "", "imagename": "c7d004f54843a25b7ad9e754ba5866bb.jpg", "infoid": 1029844, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在Pandora上，播客将使用该公司专有的播客基因组计划技术进行索引。该系统利用自动化技术-如自然语言处理、协作过滤和其他机器学习方法-然后将其与人工管理相结合，向潘多拉应用程序上的播客听众提供个性化建议。\n该公司表示，这些播客还将继续在北美的Stitcher应用程序中提供。\n收购Stitcher带来了几项关键资产，包括它自己的移动收听应用程序，其中包括高端独家节目，以及用于播客广告的Midroll Media网络。Stitcher还通过Earwolf创建了自己的原创节目，并运营着多个内容网络。\n这意味着随着交易的完成，SirusXM获得了数千个顶级播客。该公司现在还声称，由于卫星广播服务SiriusXM、流媒体应用Pandora以及现在的Stitcher的结合，它在所有类别的数字音频(包括音乐、体育、谈话和播客)中拥有“北美最大的可寻址观众”。\n该公司相信，交易完成后，由于其提供的增强的生产、营销和分销能力，这笔交易将有助于它将更多的创作者吸引到其平台上。同时，SiriusXM表示，广告商将能够更精确地定向播客，以提高广告效率，并将获得改进的测量结果。\n就Stitcher的高管而言，首席执行官埃里克·迪恩现在将向SiriusXM总裁兼首席内容官斯科特·格林斯坦(Scott Greenstein)汇报工作，后者也负责Pandora的内容。Stitcher的首席营收官Sarah van Mosel将直接向SiriusXM的首席广告营收官John Trimble汇报工作。\nSiriusXM首席执行官吉姆·迈耶(Jim Meyer)在一份关于交易完成的声明中表示：“我们正在深化我们在播客领域的地位，播客是数字音频领域增长最快的领域，随着这笔交易的完成，我们的愿景正在形成。”有了Stitcher及其各种资产，我们现在是一站式商店，能够满足播客创作者、出版商和广告商的需求，同时还为听众提供获得精彩节目、系列剧和节目的机会。“。\n尽管冠状病毒大流行扰乱了许多消费趋势，并加速了其他消费趋势，但播客仍然是快速增长的数字音频行业之一。今年夏天，播客下载量恢复到COVID之前的水平，和Spotify报告称，第二季度播客消费翻了一番以上，近四分之一(21%)的活跃用户现在收听播客。\nStitcher并不是SiriusXM专注于播客或广告技术的第一笔收购。今年6月，它还收购了播客管理平台Simplecast，在此之前，它以6630万美元收购了AdsWizz，为Pandora的广告努力提供支持。", "note_en": "On Pandora, the podcasts will be indexed using the company’s  proprietary Podcast Genome Project technology. This system leverages  automated technology — like natural language processing, collaborative filtering, and other machine learning approaches — then combines that with human curation to make personalized recommendations to podcast listeners on Pandora’s app.\n The podcasts will also continue to be available in the Stitcher app in North America, the company says.\n  The Stitcher acquisition brought with it several key assets, including its own mobile listening app, which includes a premium tier of exclusives, and the Midroll Media network for podcast advertising. Stitcher also creates its own original programs and runs multiple content networks, via Earwolf.\n That means SirusXM gained thousands of top podcasts with the deal’s closure. The company also now claims it has the “largest addressable audience in North America” across all categories of digital audio, including music, sports, talk, and podcasts thanks to the combination of satellite radio service SiriusXM, streaming app Pandora, and now Stitcher.\n The company believes the deal will help it to attract more creators to its platform, thanks to the enhanced production, marketing, and distribution capabilities it offers, following the deal’s close. Advertisers, meanwhile, will be able to more precisely target podcasts for better ad efficiency, and will gain access to improved measurements, says SiriusXM.\n In terms of Stitcher’s execs, CEO Erik Diehn will now report to Scott Greenstein, President and Chief Content Officer of SiriusXM, who also oversees content at Pandora. Stitcher’s Chief Revenue Officer, Sarah van Mosel, will report directly to John Trimble, Chief Advertising Revenue Officer of SiriusXM.\n “We are deepening our position in podcasting, the fastest-growing sector in digital audio, and with completion of this transaction, our vision is taking shape,” said SiriusXM CEO Jim Meyer, in a statement about the deal’s completion. “With Stitcher and its varied assets, we are now a one-stop shop able to meet the needs of podcast creators, publishers and advertisers, while also providing listeners with access to great shows, series and programming.”\n Despite the coronavirus pandemic, which disrupted many consumer trends and accelerated others, podcasting still remains one of the fast-growing digital audio industries. Podcast downloads  returned to pre-COVID levels this summer, and Spotify  reported that podcast consumption more doubled in Q2 and nearly a quarter (21%) of its active users now listen to podcasts.\n Stitcher was not SiriusXM’s first acquisition focused on podcasts or ad technologies. It also  bought podcast management platform Simplecast this June, and before that, it  acquired AdsWizz for $66.3 million to power Pandora’s advertising efforts.", "posttime": "2020-10-20 00:31:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "播客,podcasts", "title": "\nStitcher的播客在收购完成后抵达Pandora", "title_en": "\n\t\t\t\tStitcher’s podcasts arrive on Pandora with acquisition’s completion\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/19/stitchers-podcasts-arrive-on-pandora-with-acquisitions-completion/", "via": "", "real_tags": ["播客", "podcasts"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029843, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多年来，对坚实原则的了解一直是我们招聘程序的标准部分。应聘者被要求对这些原则有很好的工作知识。然而，最近我们的一位经理不再编写太多代码，他质疑这样做是否明智。他的观点是，开放-封闭原则不再非常重要，因为我们编写的大多数代码都不是包含在大型整体中，对小型微服务进行更改既安全又容易。利斯科夫替代原则早已过时，因为我们不再像20年前那样关注继承。我认为我们应该考虑Dan North对Solid的立场--“只需编写简单的代码。”\n这些坚实的原则与90年代(甚至在此之前)一样，在今天仍然具有现实意义。这是因为软件在所有这些年里没有改变太多--这是因为自从1945年图灵为电子计算机编写了第一行代码以来，软件就没有改变太多。软件仍然是IF语句、WHILE循环和赋值语句-序列、选择和迭代。\n每一代新一代都喜欢认为他们的世界与上一代有很大的不同。每一代人在这一点上都是错误的；这是每一代人在下一代到来时都会学到的东西，告诉他们一切都发生了多么大的变化。&lt；咧嘴笑&gt；\n把因为同样的原因而改变的东西聚集在一起。将因不同原因而改变的事情分开。\n很难想象这一原则与软件无关。我们不会将业务规则与GUI代码混为一谈。我们不会将SQL查询与通信协议混为一谈。我们将因不同原因更改的代码分开，以便对一个部分的更改不会破坏其他部分。我们确保由于不同原因更改的模块不会有使它们纠缠在一起的依赖项。\n微服务不能解决这个问题。您可以创建一个错综复杂的微服务，或者如果您混合了因不同原因而更改的代码，则可以创建一组错综复杂的微服务。\n丹·诺斯的幻灯片完全没有抓住这一点，让我相信他根本不理解这个原理。他对SRP的回答是“编写简单的代码”(或者说他是在讽刺，这一点我了解丹的可能性要大得多)。我同意。SRP是我们保持代码简单的方法之一。\n在所有的原则中，任何人都会质疑这一原则的想法让我对我们行业的未来充满了恐惧。当然，我们希望创建无需修改即可扩展的模块。您能想象在一个没有设备独立性的系统中工作吗？在这个系统中，写入磁盘文件与写入打印机、屏幕或管道有着根本的不同。我们是否希望看到语句是否散布在代码中以处理所有的小细节？\n或…。我们想把抽象概念和详细概念分开吗？我们是否希望将业务规则与GUI、微服务通信协议和数据库的任意行为隔离开来？我们当然知道！\n再说一次，丹的幻灯片完全搞错了。当需求改变时，只有部分现有代码是错误的。现有的大部分代码仍然是正确的。我们希望确保我们不必仅仅为了让错误的代码再次工作而更改正确的代码。丹的回答是“编写简单的代码”。再说一次，我同意。而且，具有讽刺意味的是，他是对的。简单的代码既是开放的，也是封闭的。\n使用接口的程序不能被该接口的实现所混淆。\n人们(包括我)犯了一个错误，认为这是关于继承的。但事实并非如此。它是关于子类型的。接口的所有实现都是接口的子类型。所有的鸭子类型都是隐含接口的子类型。而且，基接口的每个用户，无论是声明的还是隐含的，都必须就该接口的含义达成一致。如果实现使基类型的用户感到困惑，则IF/Switch语句将激增。\n这个原则是关于保持抽象的清晰和定义良好。不可能相信这是一个过时的概念。\n丹在这个主题上的幻灯片是完全正确的；他只是没有抓住原则的要点。简单代码是维护清晰的子类型关系的代码。\n保持界面小，这样用户就不会最终依赖于他们不需要的东西。\n我们仍然使用编译语言。我们仍然依赖修改日期来确定哪些模块应该重新编译和重新部署。只要这是真的，我们就必须面对这样一个问题：当模块A在编译时而不是在运行时依赖于模块B时，对模块B的更改将强制重新编译和重新部署模块A。\n这个问题在静态类型的语言(如Java、C#、C++、GO、SWIFT等)中尤其严重。动态类型的语言受到的影响要小得多，但仍然不能幸免。Maven和Leiningen的存在就是证明。\n丹关于这个话题的幻灯片可以证明是错误的。如果客户端在修改其中一个方法时必须重新编译和重新部署，那么它们确实依赖于它们没有调用的方法。就目前而言，丹关于这一原则的最后一点是正确的。是的，如果您可以将具有两个接口的类分割为两个单独的类，则最好这样做(SRP)。但这样的分离往往是不可行的，甚至是不可取的。\n依赖于抽象的方向。高级模块不应依赖于低级详细信息。\n很难想象没有大量使用这一原则的体系结构。我们不希望我们的高级业务规则依赖于低级细节。我希望这是非常明显的。我们不希望为我们赚钱的计算受到SQL、低级验证或格式化问题的污染。我们希望将高级抽象与低级细节隔离开来。这种分离是通过仔细管理系统内的依赖项来实现的，以便所有源代码依赖项，特别是那些跨越体系结构边界的源代码依赖项，都指向高级抽象，而不是低级细节。\n在每种情况下，Dan的幻灯片都以：只要编写简单的代码就可以了。这是个好建议。然而，如果说岁月教会了我们什么的话，那就是简单性需要原则指导下的纪律。正是这些原则定义了简单性。正是这些规则约束了程序员生成倾向于简单性的代码。\n把事情搞得一团糟的最好办法就是告诉每个人“简单一点”，不要给他们进一步的指导。", "note_en": "For years the knowledge of the SOLID principle has been a standard part of our recruiting procedure. Candidates were expected to have a good working knowledge of these principles. Lately, however, one of our managers, who doesn’t code much anymore, has questioned whether that is wise. His points were that the Open-Closed principle isn’t very important anymore because most of the code we write isn’t contained in large monoliths and making changes to small microservices is safe and easy. The Liskov Substitution Principle is long out of date because we don’t focus on inheritance nearly as much as we did 20 years ago. I think we should consider  Dan North’s position on SOLID – “Just write simple code.”\n   The SOLID principles remain as relevant to day as they were in the 90s (and indeed before that). This is because software hasn’t changed all that much in all those years — and  that is because software hasn’t change all that much since 1945 when Turing wrote the first lines of code for an electronic computer. Software is still  if statements,  while loops, and assignment statements —  Sequence,  Selection, and  Iteration.\n Every new generation likes to think that their world is vastly different from the generation before. Every new generation is wrong about that; which is something that every new generation learns once the next new generation comes along to tell them how much everything has changed.  &lt;grin&gt;\n   Gather together the things that change for the same reasons. Separate things that change for different reasons.\n It is hard to imagine that this principle is not relevant in software. We do not mix business rules with GUI code. We do not mix SQL queries with communications protocols. We keep code that is changed for different reasons separate so that changes to one part to not break other parts. We make sure that modules that change for different reasons do not have dependencies that tangle them.\n Microservices do not solve this problem. You can create a tangled microservice, or a tangled set of microservices if you mix code that changes for different reasons.\n Dan North’s slides completely miss the point on this, and convinces me that he did not understand the principle at all. (or that he was being ironic, which knowing Dan, is far more likely) His answer to the SRP is to “Write Simple Code”. I agree. The SRP is one of the ways we keep the code simple.\n   Of all the principles, the idea that anyone would question this one fills me full of dread for the future of our industry. Of course we want to create modules that can be extended without modifying them. Can you imagine working in a system that did not have device independence, where writing to a disk file was fundamentally different than writing to a printer, or a screen, or a pipe? Do we want to see  if statement scattered through our code to deal with all the little details?\n Or… Do we want to separate abstract concepts from detailed concepts. Do we want to keep business rules isolated from the nasty little details of the GUI, and the micro-service communications protocols, and the arbitrary behaviors of the database? Of course we do!\n Again, Dan’s slide gets this completely wrong. When requirements change only  part of the existing code is wrong. Much of the existing code is still right. And we want to make sure that we don’t have to change the right code just to make the wrong code work again. Dan’s answer is “write simple code”. Again, I agree. And, ironically, he is right.  Simple code is both open and closed.\n  A program that uses an interface must not be confused by an implementation of that interface.\n People (including me) have made the mistake that this is about inheritance. It is not. It is about sub-typing. All implementations of interfaces are subtypes of an interface. All duck-types are subtypes of an implied interface. And, every user of the base interface, whether declared or implied, must agree on the meaning of that interface. If an implementation confuses the user of the base type, then  if/switch statements will proliferate.\n This principle is about keeping abstractions crisp and well-defined. It is impossible to believe that this is an outmoded concept.\n Dan’s slides are entirely correct on this topic; he simply missed the point of the principle. Simple code is code that maintains crisp subtype relationships.\n  Keep interfaces small so that users don’t end up depending on things they don’t need.\n We still work with compiled languages. We still depend upon modification dates to determine which modules should be recompiled and redeployed. So long as this is true we will have to face the problem that when module A depends on module B at  compile time, but not at run time, then changes to module B will force recompilation and redeployment of module A.\n This issue is especially acute in statically typed languages like Java, C#, C++, GO, Swift, etc. Dynamicaly typed languages are affected much less; but are still not immune. The existence of Maven and Leiningen are proof of that.\n Dan’s slide on this topic is provably false. Clients  do depend on methods they don’t call, if they have to be recompiled and redeployed when one of those methods is modified. Dan’s final point on this principle is fine, so far as it goes. Yes, if you can split a class with two interfaces into two separate classes, then it is a good idea to do so (SRP). But such separation is often not feasible, nor even desirable.\n  Depend in the direction of abstraction. High level modules should not depend upon low level details.\n It is hard to imagine an architecture that does not make significant use of this principle. We do not want our high level business rules depending upon low level details. I hope that is perfectly obvious. We do not want the computations that make money for us polluted with SQL, or low level validations, or formatting issues. We want isolation of the high level abstractions from the low level details. That separation is achieved by carefully managing the dependencies within the system so that all source code dependencies, especially those that cross architectural boundaries, point towards high level abstractions, not low level details.\n In every case Dan’s slides end with:  Just write simple code. This is good advice. However, if the years have taught us anything it is that simplicity requires disciplines guided by principles. It is those principles that define simplicity. It is those disciplines that constrain the programmers to produce code that leans towards simplicity.\n The best way to make a complicated mess is to tell everyone to “just be simple” and give them no further guidance.", "posttime": "2020-10-20 00:27:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "鲍勃,relevance,原则", "title": "鲍勃叔叔的“坚实的关联性”", "title_en": "Solid Relevance by Uncle Bob", "transed": 1, "url": "http://blog.cleancoder.com/uncle-bob/2020/10/18/Solid-Relevance.html", "via": "", "real_tags": ["鲍勃", "relevance", "原则"]}, {"category": "", "categoryclass": "", "imagename": "8b928c5a365a0a9e7d04e52530ee3289.jpeg", "infoid": 1029841, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "保时捷创造了一种移动电动汽车充电车，一次可以给10辆泰康充电。\n泰坎起价10.38万美元，是这家德国汽车制造商的旗舰车型，也是第一款全电动跑车，其功能和规格是市场上其他电动汽车所没有的。\n随着一款标志性汽车的推出，驾驶活动和保时捷的客户驾驶程序也随之而来，据保时捷称，泰康现在已经成为其中不可或缺的组成部分。然而，其中几项赛事的举办地点并不具备足够强大的基础设施，无法同时为几辆电动跑车快速充电。\n因此，这家汽车制造商与专注于工业用途的德国硬件和软件制造商ADS-Tec合作开发了一款移动充电装置，可以同时为多辆泰康充电。\n点击“注册”，即表示您同意接收来自Business Insider的营销电子邮件以及其他合作伙伴优惠，并接受我们的服务条款和隐私政策。\n形成一条X的两条交叉线。它指示一种关闭交互或取消通知的方式。", "note_en": "Porsche created a mobile electric vehicle charging truck that can recharge 10 Taycans at once.\n The Taycan — which starts at  $103,800 — is the German automaker&#39;s flagship, first fully electric sports car with  features and specs that aren&#39;t found in other electric vehicles on the market.\n With the introduction of a hallmark car comes driving events and  Porsche&#39;s &#34;customer driving programs,&#34; which the Taycan has now become an &#34;integral&#34; component of,  according to the automaker. However, several of these events have been held in locations that don&#39;t have a strong enough infrastructure to support the quick recharge of several electric sports cars at once.\n As a result, the automaker, in partnership with  Ads-Tec — a German hardware and software creator that specializes in &#34;industrial&#34; use — has developed a mobile charging unit that can repower several Taycans at once.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.\n        Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2020-10-20 00:13:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "保时捷,porsche,制造商", "title": "保时捷创造了一辆巨大的电动汽车充电车，一次可以给10辆保时捷泰康充电", "title_en": "Porsche created a huge EV charging truck that can recharge 10 Porsche Taycans at once", "transed": 1, "url": "https://www.businessinsider.com/porsches-electric-vehicle-charging-truck-recharge-10-taycans-at-once-2020-9", "via": "", "real_tags": ["保时捷", "porsche", "制造商"]}, {"category": "", "categoryclass": "", "imagename": "b7a23deb04d3dc59c80152fc2e1a5c3d.jpg", "infoid": 1029840, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当约翰尼斯·西伯斯(Johannes Siebers)坐在那里紧张地等待冒名顶替的人出现时，这就像是间谍电影中的一个场景。\n约翰尼斯和他的弟弟迈克尔在慕尼黑的一家咖啡馆里，他们安排在那里会见一名假记者。\n这位假装的作家已经联系上了，声称自己来自德国一家领先的杂志。他说，他想就他们的新公司Holidu采访兄弟俩，Holidu是一个度假租赁价格比较网站。\n这名男子补充说，他特别有兴趣了解更多关于他们开发的图像识别软件的信息。\n这会自动检查世界各地数百万别墅和公寓的照片，无论是私人网站上的照片，还是Airbnb等网站上的照片。该软件这样做是为了确保如果某一特定的房产在网上的许多地方都有特色，通常情况下，Holidu只会以最便宜的价格列出一次。\n但我马上就嗅到了老鼠的味道，迈克尔在回顾2014年的事件时说。作为一名记者，他写得不是很好，他的电子邮件地址看起来也很奇怪。\n所以我给杂志社打了电话，他们非常震惊和愤怒，因为他们从来没有听说过这个人。然后，我们显然给警察打了电话，警察要求我们继续安排与这名男子见面。\n我们照做了，咖啡馆里有两个杂志社的人坐在不同的桌子上。当那个人进来的时候，他也很紧张，我们只是让他说了一会儿话，然后警察就赶到逮捕了他。\n虽然迈克尔和他的兄弟从未发现是谁雇佣了这名男子，但他们相信这是他们众多竞争对手之一，一家热衷于了解更多关于他们技术的公司。\n快进到今年，Holidu的图像识别软件仍在忙于工作。虽然旅游业的许多公司在2020年经历了可怕的2020年，因为大流行关闭了该行业的大部分，但Holidu表示，它在一个领域看到了增长-来自逗留。\n迈克尔说，今年年初，情况看起来非常令人担忧，但我们受益的是，越来越多的人在自己的国家度假，而不是出国。\n他们选择租一间度假屋，而不是住在旅馆里，在那里他们会与其他人接触。\n近年来，随着图像识别软件在复杂性和使用率上的增长，现在有越来越多的公司的商业模式完全基于该技术的使用。\nBrandwatch就是这样一家公司，它的软件允许公司在互联网和各种形式的社交媒体上搜索他们产品的照片。\nBrandwatch的总部设在英国南海岸的布莱顿，在美国、西班牙、法国、德国、新加坡和澳大利亚设有大型办事处。该公司表示，它每天处理超过1亿张图像。\nBrandwatch&39；驻美国首席技术官克里斯·宾厄姆(Chris Bingham)表示，今年对其基于云的应用的查询大幅增加。\n他说，这不仅仅是因为越来越多的零售商争先恐后地转移到网上。取而代之的是，这场大流行表明情况变化得有多快--越来越多的人在家工作，在网上购物。这种变化真的是一夜之间发生的。\n新技术经济是探索技术创新如何塑造新兴经济新格局的系列丛书。\n因此，各品牌都在寻找尽可能多的洞察力。我们估计，80%的在线产品照片没有附带文字形式的品牌名称。所以要找到80%的图片，你只需要搜索图片本身。\n我们的系统的工作方式是，比方说，你输入一个品牌的名称和“海滩”这个词，几秒钟之内，你就会在海滩上看到该品牌产品的所有照片。\nBrandwatch的2000名客户可以将这些信息用于各种用途，从更好地定位他们的广告，到开发适应商品最常使用或消费的新产品线，再到追查假货，不一而足。\n对于在商业街上保持实体存在的零售商来说，近年来越来越多地使用图像识别软件来解决屡次犯法的商店扒手的问题。然而，在某些地点强制使用口罩已经导致一些系统出现故障。\n英国一家供应商Facewatch表示，它现在已经更新了闭路电视系统，即使是戴着口罩的人也能识别出来。\n发言人斯图尔特·格林菲尔德(Stuart Greenfield)说，它专注于眼周区域-你眼睛周围的区域。我们非常兴奋，这不仅是面部识别方面的一大进步，也是预防犯罪方面的一大进步。\n我们已经看到零售商非常感兴趣，因为他们继续在持续的大流行限制下进行交易。\nCo-Op(连锁超市)刚刚接受了它，Budgen也是如此，我们正在与其他零售商洽谈。我们的目标是到明年年底拥有5000名用户。", "note_en": "As Johannes Siebers sat and nervously waited for the imposter to turn up, it could have been a scene from a spy movie.\n Johannes and his younger brother Michael were in a cafe in Munich, where they had arranged to meet a fake journalist.\n The pretend writer had got in touch, claiming to be from one of Germany&#39;s leading magazines. He said he wanted to interview the brothers about their new company Holidu, a holiday rentals price comparison website.\n The man added that he was particularly interested in finding out more about the image recognition software they had developed.\n This automatically checks the photos of millions of villas and apartments around the world, be they on private websites, or the likes of Airbnb. The software does this to ensure that if a particular property is featured in numerous places online, which is often the case, Holidu only lists it once, and at the cheapest available price.\n &#34;But I smelt a rat straight away,&#34; says Michael, looking back on events in 2014. &#34;For a journalist he didn&#39;t write very well, and his email address looked odd.\n  &#34;So I phoned the magazine, and they were very shocked and cross because they had never heard of the man. Then we obviously phoned the police, who asked us to go ahead and arrange to meet the man.\n &#34;So we did, with two people from the magazine sat on a different table in the cafe. When the man came in, he was very nervous too, and we just had to keep him talking for a bit, before the police arrived and arrested him.&#34;\n While Michael and his brother never found out who had employed the man, they believe it was one of their many rivals, a firm keen to find out more about their technology.\n Fast forward to this year, and Holidu&#39;s image recognition software is still busy at work. While many firms in the travel industry have had a terrible 2020 as the pandemic has shut down large parts of the industry, Holidu says it has seen growth in one area - from staycations.\n &#34;Things looked very worrying back at the start of the year, but what we have benefited from is a big increase in the number of people going on holiday in their own country, instead of going abroad,&#34; says Michael.\n  &#34;And rather than staying in hotels, where they would come into contact with other people, they are choosing to rent a holiday home.&#34;\n As image recognition software has grown in both sophistication and usage in recent years, there are now an increasing number of companies whose business model is based solely on the use of the technology.\n One such firm is Brandwatch, whose software allows companies to search for photographs of their products across the internet, and all forms of social media.\n  Brandwatch, which has its headquarters in Brighton, on England&#39;s south coast, plus large offices in the US, Spain, France, Germany, Singapore and Australia, says it processes more than 100 million images every day.\n Chris Bingham, Brandwatch&#39;s US-based chief technology officer, says it has seen a big rise in enquiries this year for its cloud-based app.\n &#34;This is not just because more retailers are rushing to move online,&#34; he says. &#34;Instead the pandemic has shown how quickly things can change - more people working from home and shopping online. That change was literally overnight.\n   New Tech Economy is a series exploring how technological innovation is set to shape the new emerging economic landscape.\n  &#34;So brands are looking for as much insight as possible. And we estimate that 80% of photos of products online are not accompanied by the name of the brand written in text form. So to find that 80% you have to just search for the images themselves.\n &#34;The way our system works is you type in, say, the name of a brand, and the word &#39;beach&#39;, and within seconds you&#39;ll see all the photos of that brand&#39;s products on a beach.&#34;\n  Brandwatch&#39;s 2,000 customers can then use this information for everything from better targeting of their advertising, or developing new product lines adapted for where items are most used or consumed, or tracking down counterfeits.\n For retailers who maintain a physical presence on High Streets, image recognition software has been increasingly used in recent years to tackle the problem of repeat offending shoplifters. However, the mandatory use of face masks in certain locations has tripped up some systems.\n One UK provider, Facewatch, says it has now updated its CCTV systems to be able to recognise someone even if they are wearing a mask.\n  &#34;It focuses on the periocular area - the area around your eyes,&#34; says spokesman Stuart Greenfield. &#34;We are very excited, it is a big development not just in facial recognition, but in crime prevention.\n &#34;We have seen a lot of interest from retailers as they continue to trade under the continuing pandemic restrictions.\n &#34;The Co-Op [supermarket chain] has just taken it on, as has Budgens, and we are talking to other retailers. We are aiming to have 5,000 users by the end of next year.&#34;", "posttime": "2020-10-20 00:07:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,记者,reporter", "title": "假记者想了解我们的软件", "title_en": "The fake reporter wanted to know about our software", "transed": 1, "url": "https://www.bbc.co.uk/news/business-54551873", "via": "", "real_tags": ["软件", "记者", "reporter"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029839, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "截至今天，Windows信任来自47个国家和地区的122个不同组织颁发的322个根证书。这个数字相当高，在过去的几年里一直在稳步增长。事实证明，绝大多数Windows用户根本不需要这些证书，可以不信任这些证书，没有任何不良影响。\n这些CA中的每一个都被赋予了对您的Internet通信的巨大权力，因此最大限度地减少您的计算机信任的CA的数量是非常有意义的。实现此目标的一种简单方法是用严格得多的Mozilla信任列表替换默认的Windows根CA列表，该列表包括142个根(52个组织-21个国家)。一个更严格的选择是使用Google CTL，它目前只包含127个根证书(48个组织-21个国家)。对于绝大多数用户来说，应用任何一种设置都是减少接触不必要CA的好方法，而且没有任何负面影响。\n用Mozilla或Google信任列表替换默认的Windows根CA列表可以手动完成，但非常耗时且容易出错。RootIQ(*)的免费版本提供了一种简单得多的方式来执行此系统更改：\n1.使用快速选择下拉菜单选择Mozilla信任集2。右键单击选择，然后单击反转选择3。右键单击所选内容，然后单击不信任在确认对话框上单击是。这将不信任所有不属于Mozilla信任集的根目录，Microsoft操作系统关键根目录除外。4.。使用快速选择下拉菜单选择Mozilla信任集(再次)5.右键单击选择和信任。\n在撰写本文时，在标准的Windows10系统上，您最终将拥有145个受信任的根目录(而不是默认的Microsoft CTL的322个根目录)。\n(*)我们自己的Windows根证书管理器RootIQ现在可用。免费版的RootIQ可供家庭和评估使用。", "note_en": "As of today, Windows trusts 322 root certificates issued by 122 different organizations from 47 countries. This number is quite high, and has been steadily growing over the last few years. And it turns out many of those certificates are not needed at all by the vast majority of Windows users, can be distrusted with no ill effects of any sort.\n Each of these CAs is given tremendous power over your Internet traffic, so it makes great sense to minimize the number of CAs your computer trusts. One simple way to achieve this goal is to replace the default Windows list of root CAs with the much stricter Mozilla trust list, which includes 142 roots (52 organizations - 21 countries). An even stricter option is using the Google CTL, which currently includes just 127 root certificates (48 organizations - 21 countries). For the vast majority of users, applying either set is a great way to reduce your exposure to unnecessary CAs, with no negative impact whatsoever.\n Replacing the default Windows list of root CAs with the Mozilla or Google trust lists can be done manually, but is extremely time-consuming and error prone. The free version of RootIQ(*) offers a much simpler way to perform this system change:\n 1. Use the Quick select dropdown to select the Mozilla trust set2. Right-click the selection and click Invert selection3. Right-click the selection and click Distrust Click Yes on the confirmation dialog This will distrust all roots that are not part of the Mozilla trust set, except for any Microsoft OS-critical roots.4. Use the Quick select dropdown to select the Mozilla trust set (again)5. Right-click the selection and Trust\n  As of this writing, on a standard Windows 10 system, you will end up with 145 trusted roots (rather than 322 roots for the default Microsoft CTL)\n (*) RootIQ, our own root certificate manager for Windows, is now  available. A free version of RootIQ is available for home and evaluation use.", "posttime": "2020-10-20 00:07:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "需要,root,信任", "title": "您不需要所有那些根证书", "title_en": "You don't need all those root certificates", "transed": 1, "url": "https://hexatomium.github.io/2020/10/17/001.html", "via": "", "real_tags": ["需要", "root", "信任"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029838, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在Slake中你应该使用标点符号。你还应该使用完整的句子和正确的语法。你应该扩展首字母缩略语[1]，在交流情感时，甚至加入一些表情符号以达到效果。你不仅应该在Slake中这样做，而且应该在你所有的专业交流中这样做。\n书面交流很难，但在我们工作的数字世界里，它也是至关重要的。可悲的是，像Slake这样的服务所激励的沟通方式很糟糕。\n要在对话继续之前发表意见，您可以快速键入，使用缩写，并在拼写错误的情况下单击发送。你一次只想一条信息。你在不同的线程之间跳跃，很容易分心。\n这种快而松散的风格有一些明显的缺点。最值得注意的是，它干扰了更有成效的工作，阻碍了深入思考。但一个很大且经常被忽视的负面影响是它对其他人的影响。\n当您使用晦涩难懂的缩写或在语法和拼写方面走捷径时，它可能会为您节省几秒钟的时间。问题是，这些小小的节省往往会被你的观众承担的成本所超过。\n每个阅读你的信息的人都会花一些有限的时间来解读你说的话。撇开草率的消息可能导致读者错误解释的可能性不谈，更难分析仓促编写的消息-语法不佳、拼写错误、标点符号最少、首字母缩略语晦涩难懂或一次只传递几个单词的消息。\n例如，假设您将以下消息发送到包含10个其他人的Slake频道。\n并进一步假设“蔡”指的是一项内部计划：反对原始主义的十字军东征。通过全部小写，使用首字母缩写来引用项目，并省略问号，您已经为自己节省了两个单词和几次额外的击键。在最慷慨的假设下，假设这相当于节省了5秒。太多了！\n但现在让我们来看看这些快捷方式对您的10人观众的影响。\n有两个人认为“蔡”是打字错误，花了几分钟时间试图猜测你打字的实际意思，然后才意识到你指的是内部项目。费用：20秒。\n有两个人不知道“蔡”是什么意思。其中一个人花了三分钟在内部维基上追踪，另一个人发了一条私人消息给另一名团队成员询问。费用：4分钟。\n有一个人忽略了您的要求，因为他们在扫描频道时没有意识到这是一个问题。成本：无价之宝。\n有五个人明白你的意思，但在将你的要求内在化之前，他们仍然必须在心理上扩展缩写。费用：5秒。\n您节省的5秒相当于大约4.5分钟的成本分摊给您的观众。当然，这是一个做作的例子，当然也有成本更低的情况，但重点是：你的沟通捷径是昂贵的。\n负外部性是影响不选择承担该成本的第三方的成本。\n每次你走一条沟通捷径，你就是在给你的受众施加微观外部性。捷径越惊人，外部性就越大；受众越多，外部性倍增的次数就越多，总成本就越大。\n如果你正在与一位亲密的朋友交流，并选择使用速记，那么你可能没什么问题。不仅你的朋友可能会习惯它(即外部性会很小)，而且观众也会很少(即总成本会很小)。在这种情况下，您的速记完全有可能比您的朋友节省更多的时间。\n然而，当你在一对多的场合(如电子邮件或松弛)进行交流时，尤其是在专业场合，草率的写作会带来真正的后果。它优先考虑你的时间，而不是其他所有要阅读该信息的人的时间，而且可能会曲解你的意图或语气。总体而言，这是对贵公司生产力的净消耗。\n所以使用正确的拼写和语法。在点击发送之前写下你的全部想法。展开缩略语。使用标点符号。\n一个句号，即使在“做吧”的结尾，也会传达出“我已经说出了我想说的一切”。\n[2]草率这个词可能听起来很刺耳，但我是故意选择的。并不是每个人都会说公司的母语(例如英语)，至少可以说，对他们来说，使用正确的拼写或语法可能是一种挑战。这里的争论仅限于那些对这门语言有一定程度的掌握，但在书面交流中粗心大意的人，也就是说，粗心大意的，没有系统的；过于随意的。", "note_en": "You should use punctuation in Slack. You should also use complete sentences and proper grammar. You should expand acronyms [1] and — when communicating emotion — even mix in some emoji for effect. You should do that not just in Slack, but in all of your professional communication.\n  Written communication is hard, but in the digital world we work in it’s also vital. Sadly, the style of communication that services like Slack incentivize is awful.\n To voice an opinion before the conversation moves on, you type fast and use abbreviations and hit send even with misspellings. You think one message at a time. You bounce between different threads and become easily distracted.\n There are some obvious downsides to this fast and loose style. Most notably, it interrupts more productive work and deters deep thinking. But one large and often overlooked downside is the impact it has on others.\n  When you use an obscure initialism or take shortcuts on grammar and spelling, it may save you a couple seconds. The problem is those small savings are often outweighed by the cost born by your audience.\n Every person who reads your message spends some finite period of time interpreting what you’re saying. Setting aside the possibility that a sloppy message might lead the reader to an incorrect interpretation, it’s harder to parse messages written hastily — messages with poor grammar, misspellings, minimal punctuation, obscure acronyms, or delivered a few words at a time.\n As an example, assume you send the following message to a Slack channel with 10 other people in it.\n  And further assume that “cai” refers to an internal project:  Crusade  Against  Initialisms. By writing in all lower case, using an initialism to refer to the project, and omitting the question mark, you’ve saved yourself two words and a handful of extra keystrokes. Under the most generous assumptions, say that translates to five seconds in savings. That’s a lot!\n But let’s now examine the impact the shortcuts have on your 10-person audience.\n Two people thought “cai” was a typo and spent several moments trying to guess what you actually meant to type before realizing you were referring to the internal project.  Cost: 20 seconds\n  Two people didn’t know what “cai” stood for. One spent three minutes tracking it down on the internal wiki, and the other sent a private message to another team member to ask.  Cost: 4 minutes\n  One person ignored your ask because they didn’t realize it was a question when scanning the channel.  Cost: Priceless\n  Five people understood what you meant but still had to mentally expand the initialism before internalizing your ask.  Cost: 5 seconds\n Your 5 seconds of savings amounted to roughly 4.5  minutes of cost spread across your audience. Sure, this is a contrived example and sure there are cases where the cost is lower, but the point stands:  your communication shortcuts are costly.\n  A negative externality is the cost that affects a third party who did not choose to incur that cost.\n Every time you take a communication shortcut, you are inflicting a micro-externality on your audience. The more egregious the shortcut, the larger the externality; the larger your audience, the more times the externality is multiplied and the larger the overall cost.\n  If you’re communicating with a close friend and choose to use shorthand, you’re probably fine. Not only will your friend probably be accustomed to it (i.e. the externality will be small), but the audience is also small (i.e. the total cost will be small). In this case, it’s entirely possible your shorthand saves you more time than it costs your friend.\n However, when you’re communicating in a one-to-many setting such as email or Slack, and particularly in a professional setting, sloppy writing [2] has real consequences. It prioritizes your time above the time of  every other person that will be reading that message and might misinterpret your intent or tone. In aggregate, it is a net drain on productivity at your company.\n So use proper spelling and grammar. Write out your entire thought before hitting send. Expand acronyms. Use punctuation.\n A period, even at the end of “Do it,” communicates, “I’ve said everything I wanted to say.”\n   [2] The term &#34;sloppy&#34; might sound harsh, but I chose it deliberately. Not everyone speaks the company language (e.g. English) natively, and for them using proper spelling or grammar might be challenging to say the least. The argument here is scoped to people who have some degree of mastery over the language but are being  sloppy with their written communication, which is to say &#34;careless and unsystematic; excessively casual&#34;.", "posttime": "2020-10-20 00:07:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "punctuation,可能", "title": "在松弛中使用标点符号", "title_en": "Use Punctuation in Slack", "transed": 1, "url": "https://blog.mitchjlee.com/2020/your-writing-style-is-costly", "via": "", "real_tags": ["可能"]}, {"category": "", "categoryclass": "", "imagename": "d00bea1d733a315169cdb424db866d1f.jpg", "infoid": 1029837, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Trusted Contacts是一款适用于Android的个人安全应用程序。它允许您将某些联系人标记为信任，然后这些人可以在紧急情况下请求您的位置。基本功能与谷歌地图位置共享没有太大不同，但当值得信赖的联系人在2016年-Google+黑暗时代-推出时，谷歌地图并没有内置位置共享。(Google Latitude，最初的Google地图位置共享功能，于2009年首次亮相，但在2013年被扼杀，转而支持Google+位置共享。到了2016年，Google+即将退出，位置共享在2017年又回到了谷歌地图。)除了主动的位置共享之外，还增加了一个值得信任的联系人来声明紧急位置请求，其他用户将不得不拒绝，否则它将自动共享。\n这款应用程序在Play Store上的评分为3.8分，下载量超过100万次，这还不足以将其从谷歌严酷的收割者手中拯救出来。谷歌向用户发送电子邮件称，由于谷歌地图现在内置了位置共享功能，因此不再需要值得信赖的联系人应用程序。这款应用程序将在43天后关闭，也就是2020年12月1日。", "note_en": "Trusted Contacts was  a personal safety app for Android. It let you flag certain contacts as &#34;trusted,&#34; and those people could then request your location in an emergency situation. The base functionality was not all that different from Google Maps location sharing, but when Trusted Contacts launched in 2016—the Google+ dark ages—Google Maps did not have location sharing built in. (Google Latitude, the original Google Maps location sharing functionality, debuted in 2009, but that  was killed in 2013 in favor of Google+ location sharing. Google+ was on the way out by 2016, and location sharing returned to  Google Maps in 2017.) The one addition besides a proactive location sharing was for a trusted contact to declare an emergency location request, which the other user would have to deny or it would automatically share.\n The app has a 3.8 rating  on the Play Store and over a million downloads, which is not good enough to save it from the Google grim reaper. Google  sent out emails to users saying that since location sharing was now built into Google Maps, the Trusted Contacts app was no longer need. The app will shut down in just 43 days, on December 1, 2020.", "posttime": "2020-10-19 23:53:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,rust,共享,shuts", "title": "谷歌关闭其紧急位置共享应用Trusted Contacts", "title_en": "Google shuts down Trusted Contacts, its emergency location sharing app", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/10/google-shuts-down-trusted-contacts-its-emergency-location-sharing-app/", "via": "", "real_tags": ["谷歌", "google", "rust", "共享", "shuts"]}, {"category": "", "categoryclass": "", "imagename": "1ff6e1b28909a6b1befe0792db5fa036.jpg", "infoid": 1029836, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "她说，“我们看到了围绕国家合法化的乐观情绪，感觉到一波娱乐用途合法化将是”看到毒品改革所需的最后一步“。这对多克里来说是个好消息，他正计划成立一家投资大麻、CBD、迷幻剂和性科技等类别的公司。\n她在2019年6月宣布了一项2500万美元的基金，但国家政策格局发生了很大变化。\n“围绕选举的尖酸刻薄和分歧确实没有留下实质性讨论的空间。我认为这种情况最终会改变，但在选举完成(如果有的话)之前，不要对太多的政策辩论寄予厚望，“她说。“在一个不确定的时期，我们正在后退一小步.”\n与许多风投公司一样，副风险投资公司提高了为哪些初创公司提供资金的标准，但几位投资者告诉TechCrunch，他们在总统竞选的最后几天如何做出决定的问题上存在分歧。在经历了一个繁荣的夏天之后，一些人说势头正在增强，而另一些人告诉我们，对初创公司的期望从未像现在这样高。\n“如果说有什么不同的话，那就是步伐正在加快，”灵感资本的亚历克萨·冯·托贝尔(Alexa Von Tobel)说。她说，传统上，创始人在临近寒假的时候会缩减募集资金的力度，因为投资者的度假心态正在发挥作用。她说，今年，“我认为，我们将继续看到创始人利用目前充裕的资金流，支撑资源，这样他们就可以在坚实的基础上进入2021年。”\n虽然这对创始人来说可能是个好消息，但冯·托贝尔表示，灵感资本在内部并没有对选举给予太多重视。\n她说：“我们认为自己是耐心的资本，无论时机如何，我们都专注于寻找最好的公司。”“虽然我们知道选举将制造噪音，并对企业产生长期影响，但目前它在我们的进程中没有一席之地。”\n灵感资本在早期环境中投资范围更广，这对其度过危机和动荡的投资能力起到了一定作用。看起来，拥有更多利基投资主题的公司更有可能在选举前改变步伐。", "note_en": "“We saw quite a bit more optimism around national legalization, with the feeling that a wave of states legalizing recreational use would be the final push needed” to see drug reform, she said. It was good news for Dockery, who was planning to launch a firm investing in categories like cannabis, CBD, psychedelics and sextech.\n She announced a $25 million fund in June 2019, but the national policy landscape had shifted considerably.\n “The vitriol and division around the election really haven’t left room for substantive discussions. I think this will eventually change, but don’t have high hopes for much policy debate until the election is complete, if at all,” she said. “In a time of uncertainty, we’re taking a small step back.”\n Along with many VC firms, Vice Ventures has raised the bar regarding which startups it will fund, but several investors told TechCrunch they were split about how they’re making decisions in the closing days of the presidential campaign. After  a booming summer, some said momentum is increasing, while others told us that expectations have never been higher for startups.\n “If anything, the pace is increasing,” said Alexa Von Tobel of Inspired Capital. Traditionally, she said founders scale back on fundraising efforts close to the winter holidays because investors’ vacation mentality is kicking in. This year, “ I think we’ll continue to see founders taking advantage of the ample flow of capital right now and shore up resources so they can enter 2021 on strong footing,” she said.\n While that may be good news for founders, Von Tobel said Inspired Capital is not giving too much weight to the election internally.\n “We think of ourselves as patient capital, focused on looking for the best companies no matter the timing,” she said. “While we know the election will create noise and have an impact on businesses long-term, it does not have a place in our process right now.”\n Inspired Capital invests more broadly in the early-stage environment, which plays a part in its ability to invest through crises and turbulence. It seems that firms that have more niche investment theses have been more likely to change their pace ahead of the election.", "posttime": "2020-10-19 23:49:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,投们,cutting,选举", "title": "\n风投们是否会在2020年大选的最后几天削减支票？", "title_en": "\n\t\t\t\tAre VCs cutting checks in the closing days of the 2020 election?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/19/are-vcs-cutting-checks-in-the-closing-days-of-the-2020-election/", "via": "", "real_tags": ["2020", "投们", "cutting", "选举"]}]