[{"category": "", "categoryclass": "", "imagename": "8b5f8a180bcba92c26b84a6feea44cda.jpg", "infoid": 1004569, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一月份，我的同事收到了一封奇怪的电子邮件。她转发给我的这条消息来自几个沃尔玛公司的员工，他们自称是“忧心忡忡的家庭办公室合伙人”(Concerned Home Office Associates)。(沃尔玛位于阿肯色州本顿维尔的总部通常被称为内政部。)。虽然记者收到匿名消息并不少见，但他们通常不会带上自己制作的巧妙视频。\n这些员工表示，他们对Eversee的“临界点已经过去”，Eversee是一家总部位于爱尔兰科克的小型人工智能公司，沃尔玛于2017年开始使用其技术。沃尔玛在数千家门店使用Eversee来防止在收银台和自助结账亭的商店行窃。但工人们声称，它将无害的行为误认为盗窃，而且经常无法阻止实际的盗窃事件。\n他们告诉“连线”杂志，他们对自己的雇主--世界上最大的零售商之一--依赖人工智能感到失望，他们认为人工智能是有缺陷的。一名工人说，这项技术有时甚至在内部被称为“NeverSeen”，因为它经常出错。连线杂志允许这些员工匿名，因为他们没有被授权向媒体发表讲话。\n工人们表示，他们多年来一直对沃尔玛使用Eversee感到不安，并声称同事们向经理们提出了对这项技术的担忧，但遭到了指责。他们说，在2019年6月的一篇《商业内幕》(Business Insider)的一篇文章首次公开报道沃尔玛与Eversee的合作伙伴关系后，他们决定向媒体发表讲话。这篇报道描述了Eversee如何使用人工智能来分析安装在天花板上的监控摄像头的镜头，并可以实时检测到问题，例如当客户在没有扫描的情况下将物品放入包中时。当系统发现什么时，它会自动提醒商店员工。\n“Eversee克服了人类的局限。通过使用最先进的人工智能、计算机视觉系统和大数据，我们可以检测到异常活动和其他威胁，“故事中提到的一段宣传片解释道。“我们的数码眼睛有完美的视力，它从来不需要休息一天。”\n为了反驳“商业内幕”这篇文章中的说法，忧心忡忡的Home Office Associates制作了一段视频，据称显示Eversee的技术未能标记出在沃尔玛三家不同门店没有扫描的商品。在欢快的电梯音乐中，故事开始于一个人使用自助结账购买了两大包里斯的白花生酱杯子。由于包裹堆叠在一起，因此只扫描了一个，但两个包裹都成功放置在装袋区，没有问题。\n然后，同一个人抓住手柄拿起两加仑牛奶，用一只手在扫描仪上移动。只有一个被叫醒，但两个都被放在装袋区。然后，他们把自己的手机放在机器上，弹出一个警报，说他们需要等待帮助-这是一个假阳性。“Eversee终于发出警报了！但这样做是错误的。哦，又来了，“一条说明写道。电影制作人在另外两家商店重复了同样的过程，他们没有扫描一个心形的情人节巧克力盒，盒子的正面是一只小狗，还有一把飞利浦Sonicare电动牙刷。最后，一条说明文字解释说，Eversee未能阻止100多美元的潜在盗窃。\n这段视频并不能确凿地证明Eversee的技术没有宣传的那么有效，但它的存在说明了这群匿名沃尔玛员工的挫折感，以及他们竭尽全力证明自己的反对意见是有道理的。\n在采访中，这些员工表示，他们对Eversee最担心的是自助结账时的误报。这些员工的工作包括了解沃尔玛的防损计划。员工们认为，这项技术经常将无辜的行为误解为潜在的商店行窃，这会让顾客和商店同事感到沮丧，并导致排队的时间更长。“这就像一种嘈杂的技术，一种假装保护的假人工智能，”一名工人表示。\n冠状病毒大流行使他们的担忧变得更加紧迫。一位忧心忡忡的内政部同事说，他们担心假阳性可能会导致沃尔玛员工不必要地违反社交距离指导方针。当Eversee标记一个问题时，商店助理需要进行干预，并确定是否发生了商店行窃或其他问题。在Wire获得的一份4月份的内部通信中，沃尔玛的一名公司经理表达了强烈的担忧，即误报导致的额外接触将员工置于危险之中，并询问是否应该关闭Eversee系统，以保护客户和工人。\n这位工人说，在新冠肺炎之前，“这不是很理想，客户体验很差。”“人工智能现在正在制造一种公共健康风险。”(“赫芬顿邮报”(HuffPost)上周报道称，沃尔玛员工担心Eversee的技术会让商店员工在疫情中面临风险。)。\n当新冠肺炎到达美国时，美国人争相在沃尔玛囤积食品和家庭必需品，销售额飙升。工人们很快就开始生病；据倡导零售工人的非营利性组织联合尊重组织(United For Reference)称，目前至少有20名沃尔玛员工在感染冠状病毒后死亡。该组织正在全国各地的沃尔玛门店众包新冠肺炎的感染率和工作条件。上个月，联合尊重组织表示，数百名沃尔玛员工参加了一场全国性罢工，要求更安全的工作条件和更好的福利。\n沃尔玛的一位发言人表示，公司一直在努力保护客户和员工，并相信员工与新冠肺炎签约的比率低于美国普通民众。他们否认Eversee造成的误报是一个普遍存在的问题，并表示公司出于对新冠肺炎的担忧，没有考虑关闭系统。\n这位发言人在一封电子邮件中说：“我们定期评估我们的技术，正如Eversee在整个链条上的大规模实施所表明的那样，我们有信心它目前正在达到我们的标准。”就在大流行开始之前，沃尔玛表示，它对Eversee系统进行了重大改进，导致总体警报减少。这位发言人拒绝回答有关更新可能涉及的问题。\n这位发言人还指出，员工在自助结账交易期间可能会干预的原因有很多不同，比如当客户的信用卡出现问题时。该公司表示，它已经采取了一系列措施，以确保人们在这些互动过程中受到保护，包括定期清理自助结账亭，并为员工提供保护设备。此外，该公司表示，员工还获得了手持设备，这些设备允许他们远距离处理大多数干预。\nEversee拒绝回答有关其技术的问题。一位发言人在一份声明中说，该公司“准确和有效地识别了潜在的盗窃[原文如此]，这就是为什么零售商到目前为止已经成功地在数千个地点部署了它，并计划安装更多。”他们补充说，Eversee通常只占自助结账总干预措施的不到10%。在另一份声明中，这位发言人表示：“Eversee致力于帮助其客户为购物者和商店同事提供尽可能好的体验，特别是在新冠肺炎疫情期间。自助结账提供了一般非接触式购物体验的好处，允许适当的社交距离，并避免在员工有限的繁忙商店中走有人车道。“\n但忧心忡忡的内政部同事表示，他们对Eversee的担忧早在大流行之前就已经很久了。Wire获得的电子邮件显示，其他公司员工在2017年和2018年都提出了这项技术未能防止盗窃的问题。这些员工表示，沃尔玛对Eversee的持续投资尤其让他们感到恼火，因为沃尔玛大部分门店的制造商NCR Corporation已经收购了Eversee的竞争对手StopLift。他们认为这笔收购是一种认可，并对为什么StopLift的技术没有得到进一步探索感到困惑。\n更重要的是，根据沃尔玛内部获得的信息，员工们表示，沃尔玛内部研发小组智能零售实验室(IRL)开发了自己的防盗软件，他们认为比Eversee的更准确。沃尔玛的一名员工表示，这项技术目前正在大约50家门店进行测试。华尔街日报此前曾报道过这项技术的存在。\n沃尔玛拒绝回答有关其内部防盗软件的问题，但对《连线》的报道没有异议。一位发言人在一份声明中表示：“在企业层面，我们的近5000家门店在任何给定的时间都会进行多项测试。”“IRL的目标是建立可以转移到更多门店的AI能力。我们定期测试在少数商店内部建立的能力。“。\nEversee的技术在一定程度上是为了帮助解决自助结账的长期问题。虽然允许顾客扫描并支付自己购买的商品减少了零售商的劳动力成本，但由于商店行窃、员工盗窃和其他问题，这也导致了更多的库存损失，或称“缩水”。德鲁大学(Drew University)社会学教授克里斯托弗·安德鲁斯(Christopher Andrews)表示：“自助结账通道的盗窃率比传统结账通道高出一倍。”安德鲁斯著有“过度工作的消费者：自助结账、超市和DIY经济”(The Overwork Consumer：Self-Check Out，Supermarket，and DIY Economy)一书。\n过去，沃尔玛和其他零售商依靠重量传感器通过自助结账来防止商店扒窃，但这些容易出错，让顾客感到沮丧。一些商店现在转而求助于Eversee这样的公司，这些公司承诺通过依赖监控摄像头和机器视觉来减少萎缩，提高客户满意度。Eversee表示，它与多家主要零售商合作。亚马逊在其Amazon Go便利店使用了类似的技术，那里的摄像头网络会自动记录顾客服用的产品。(亚马逊现在正将其“走出去”技术授权给其他公司。)。\n在冠状病毒大流行及其后果期间，自助结账对商店可能变得更加重要，因为顾客正在寻找低风险的购物方式。ncr公司说，它现在正在帮助零售商修改其设备，使其尽可能地非接触式：例如，通过重新配置机器，这样客户就可以插入借记卡或信用卡，而不需要按“信用卡”付款选项。非营利机构Data&Amp；Society的研究员亚历山德拉·马蒂埃斯库(Alexandra Mateescu)表示：“除了无现金支付之外，自助结账成为一种公共健康战略，这是一件令人着迷的事情。”马蒂埃斯库曾撰写过关于新技术对零售业工人影响的文章。\n沃尔玛发言人在一份声明中表示：“除了送货、提货、收银台非接触式支付和网上购物等其他选择外，自助结账只是我们为顾客提供的在这段时间内安全获得所需商品的解决方案之一。”客户现在一如既往地使用这一选项，我们将继续努力确保我们客户的店内体验是安全、负担得起和方便的，以及我们的员工也是安全的。“", "note_en": "In January, my coworker received a peculiar email. The message, which she forwarded to me, was from a handful of corporate Walmart employees calling themselves the “Concerned Home Office Associates.” (Walmart’s headquarters in Bentonville, Arkansas, is often referred to as the Home Office.) While it’s not unusual for journalists to receive anonymous tips, they don’t usually come with their own slickly produced videos.\n The employees said they were “past their breaking point” with Everseen, a small artificial intelligence firm based in Cork, Ireland, whose technology Walmart began using in 2017. Walmart uses Everseen in thousands of stores to prevent shoplifting at registers and self-checkout kiosks. But the workers claimed it misidentified innocuous behavior as theft and often failed to stop actual instances of stealing.\n They told WIRED they were dismayed that their employer—one of the largest retailers in the world—was relying on AI they believed was flawed. One worker said that the technology was sometimes even referred to internally as “NeverSeen” because of its frequent mistakes. WIRED granted the employees anonymity because they are not authorized to speak to the press.\n The workers said they had been upset about Walmart’s use of Everseen for years and claimed colleagues had raised concerns about the technology to managers but were rebuked. They decided to speak to the press, they said, after a  June 2019 Business Insider article reported Walmart’s partnership with Everseen publicly for the first time. The story described how Everseen uses AI to analyze footage from surveillance cameras installed in the ceiling and can detect issues in real time, such as when a customer places an item in their bag without scanning it. When the system spots something, it automatically alerts store associates.\n “Everseen overcomes human limitations. By using state-of-the-art artificial intelligence, computer vision systems, and big data, we can detect abnormal activity and other threats,” a  promotional video referenced in the story explains. “Our digital eye has perfect vision, and it never needs a day off.”\n In an effort to refute the claims made in the Business Insider piece, the Concerned Home Office Associates created a video, which purports to show Everseen’s technology failing to flag items not being scanned in three different Walmart stores. Set to cheery elevator music, it begins with a person using self-checkout to buy two jumbo packages of Reese’s White Peanut Butter Cups. Because the packages are stacked on top of each other, only one is scanned, but both are successfully placed in the bagging area without issue.\n The same person then grabs two gallons of milk by their handles and moves them across the scanner with one hand. Only one is rung up, but both are put in the bagging area. They then put their own cell phone on top of the machine, and an alert pops up saying they need to wait for assistance—a false positive. “Everseen finally alerts! But does so mistakenly. Oops again,” a caption reads. The filmmaker repeats the same process at two more stores, where they fail to scan a heart-shaped Valentine’s Day chocolate box with a puppy on the front and a Philips Sonicare electric toothbrush. At the end, a caption explains that Everseen failed to stop more than $100 of would-be theft.\n  The video isn’t definitive proof that Everseen’s technology doesn’t work as well as advertised, but its existence speaks to the level of frustration felt by the group of anonymous Walmart employees, and the lengths they went to prove their objections had merit.\n In interviews, the workers, whose jobs include knowledge of Walmart’s loss-prevention programs, said their top concern with Everseen was false positives at self-checkout. The employees believe that the tech frequently misinterprets innocent behavior as potential shoplifting, which frustrates customers and store associates, and leads to longer lines. “It’s like a noisy tech, a fake AI that just pretends to safeguard,” said one worker.\n The coronavirus pandemic has given their concerns more urgency. One Concerned Home Office Associate said they worry false positives could be causing Walmart workers to break social-distancing guidelines unnecessarily. When Everseen flags an issue, a store associate needs to intervene and determine whether shoplifting or another problem is taking place. In an internal communication from April obtained by WIRED, a corporate Walmart manager expressed strong concern that workers were being put at risk by the additional contact necessitated by false positives and asked whether the Everseen system should be turned off to protect customers and workers.\n Before COVID-19, “it wasn’t ideal, it was a poor customer experience,” the worker said. “AI is now creating a public health risk.” (HuffPost  reported last week that corporate Walmart employees were concerned about Everseen’s technology putting store associates at risk amid the pandemic.)\n  When COVID-19 reached the United States, Americans rushed to stock up on food and household essentials at Walmart, and  sales soared. Workers soon began falling sick; at least 20 Walmart associates have now died after contracting the coronavirus, according to  United for Respect, a nonprofit that advocates for retail workers and that is  crowdsourcing COVID-19 infection rates and working conditions at Walmart stores across the country. Last month, United for Respect said hundreds of Walmart employees participated in a  national strike demanding safer working conditions and better benefits.\n A spokesperson for Walmart said the company has been working diligently to protect customers and its workforce and believes the rate at which associates have contracted COVID-19 is lower than that of the general US population. They denied that false positives caused by Everseen were a widespread issue and said the company had not considered turning the system off due to concerns about COVID-19.\n “We assess our technology regularly, and as evident with the large scale implementation of Everseen across the chain, we have confidence it is currently meeting our standards,” the spokesperson said in an email. Just prior to the start of the pandemic, Walmart said it made significant improvements to its Everseen system, which resulted in fewer alerts overall. The spokesperson declined to answer questions about what the updates may have entailed.\n The spokesperson also noted that there are a number of different reasons an associate might intervene during a self-checkout transaction, like when a customer has problems with their credit card. The company said it has taken a number of steps to ensure people are protected during these interactions, including regularly cleaning self-checkout kiosks and providing employees with protective equipment. In addition, workers are given handheld devices that allow them to handle most interventions from a distance, the company said.\n  Everseen declined to answer questions about its technology. In a statement, a spokesperson said the company “accurately and effectively identifies potential theft [sic] is why retailers have successfully deployed it at thousands of locations to date, with many more installations planned.” They added that Everseen typically accounts only for less than 10 percent of total interventions at self-service checkouts. In a separate statement, the spokesperson said “Everseen is committed to helping its customers deliver the best possible experience for shoppers and store associates, especially during the COVID-19 pandemic. Self-checkout offers the benefits of a generally contactless shopping experience, allowing for proper social distancing and avoiding manned-lanes in busy stores with limited staff available.”\n But the Concerned Home Office Associates said their worries about Everseen long predate the pandemic. Emails obtained by WIRED show that other corporate employees raised issues about the technology failing to prevent theft in both 2017 and 2018. The employees said they were particularly vexed by Walmart’s continued investment in Everseen because NCR Corporation, which makes the majority of Walmart’s registers, had  acquired an Everseen competitor called StopLift. They considered the acquisition an endorsement and were confused as to why StopLift’s technology wasn’t being further explored.\n What’s more, the workers said an internal Walmart research and development group, the Intelligent Retail Lab (IRL), created its own anti-theft software they believed was more accurate than Everseen’s, according to information they were given internally. One Walmart employee said the technology, the existence of which was previously reported by  The Wall Street Journal, is now being tested in roughly 50 stores.\n Walmart declined to answer questions about its internal anti-theft software but did not dispute WIRED’s reporting. “At an enterprise level, there are a number of tests happening at any given time across our footprint of nearly 5,000 stores,” a spokesperson said in a statement. “The goal of IRL is to build AI capabilities that can be transferred to additional stores. We regularly test capabilities built internally in a small number of stores.”\n  Everseen’s technology was designed in part to help solve a persistent problem with self-checkout. While allowing customers to scan and pay for their own items cuts down on labor costs for retailers, it has also led to more inventory loss, or “shrinkage,” due to shoplifting, employee theft, and other problems. “Theft through self-checkout lanes is exponentially higher than through traditional checkout lanes,” says Christopher Andrews, a sociology professor at Drew University and the author of  The Overworked Consumer: Self-Checkouts, Supermarkets, and the Do-It-Yourself Economy.\n In the past, Walmart and other retailers relied on weight sensors to prevent shoplifting through self-checkout, but those were prone to error and frustrated customers. Some stores are now turning instead to firms like Everseen, which promise to reduce shrink and increase customer satisfaction by relying instead on surveillance cameras and machine vision. Everseen has said that it works with a number of major retailers. Amazon uses similar technology in its Amazon Go convenience stores, where a network of cameras automatically log the products customers take. (Amazon is now licensing its “Just Walk Out” tech to other companies.)\n  During the coronavirus pandemic and its aftermath, self-checkout may become even more important for stores, as customers look for low-risk ways to shop. NCR corporation said it’s now helping retailers modify its equipment to be as touchless as possible: for example, by reconfiguring machines so that customers can insert a debit or credit card without needing to press the “credit card” payment option. “It is fascinating to see self-checkout become poised as a public health strategy, in addition to things like cashless payment,” says Alexandra Mateescu, a researcher at the nonprofit institute Data &amp; Society, who has  written about the effects of new technology on retail workers.\n “Self-checkout is just one of the ways that we’ve offered customers solutions to get the items they need safely during this time, in addition to other options like delivery, pickup, touchless payment at the register and shopping online,” the Walmart spokesperson said in a statement. “Customers are using this option now, as much as ever, and we will continue to work hard to ensure the in-store experience for our customers is safe, affordable and convenient, as well as safe for our associates.”", "posttime": "2020-06-01 04:03:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,员工,employees,eversee", "title": "沃尔玛员工外出展示其反入店行窃的人工智能不起作用", "title_en": "Walmart employees are out to show its anti-shoplifting AI doesn’t work", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/05/walmart-employees-are-out-to-show-its-anti-shoplifting-ai-doesnt-work/", "via": "", "real_tags": ["人工智能", "员工", "employees", "eversee"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004568, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周四，“异形”导演雷德利·斯科特和“泰晤士报”影评人张贾斯汀一起谈论了这部电影，西格尼·韦弗在其中的扮演者，以及他漫长而广阔的职业生涯。这位目前在洛杉矶的电影制作人说，对他来说，隔离时间是“完成所有未完成剧本的绝佳机会”。\n斯科特当时正在拍摄由本·阿弗莱克(Ben Affleck)、马特·达蒙(Matt Damon)和亚当·德雷弗(Adam Driver)主演的阿弗莱克、达蒙和妮可·霍洛夫辛纳(Nicole Holofcener)的剧本《最后的决斗》(The Last Duel)。回到工作岗位上，斯科特说，“我们还得想办法什么时候回来，什么时候都能完成。”\n在“泰晤士报”的读者选择“异形”作为“终极夏季电影对决”系列第四周的获胜者后，这位导演与张进行了现场虚拟对话。斯科特导演了这部1979年的电影，改编自丹·奥班农(Dan O&#39；Bannon)的剧本。多年来，在同一周上映的其他电影中，“异形”击败了“星球大战”、“闪耀”和“碟中谍”。在半决赛投票中，《异形》与斯科特1991年的电影《西尔玛与路易丝》不相上下。\n在与张的交谈中，斯科特分享了他对大流行后观影和电影业未来的看法。\n他说：“我认为，我们的工作中有一些东西，因为拍摄一部电影是一个完全不合逻辑的过程，你需要把一大群人聚集在一起，制定一个名为剧本的蓝图。”你们所有人都在早上见面，经常是第一次见面，然后不知何故就把它们放在了一起。因此，如果你不是一个乐观主义者，你就不应该真正进入电影业。所以我想我是一个乐观主义者。我们会想办法的。这也会过去的。“。\n至于“异形”(Alien)，这是他在1977年凭借“决斗”(The Duelist)首次亮相后的第二部导演故事片，斯科特指出，他是这份工作的第五选择，这意味着没有人预料到这部电影会像现在这样重要和有影响力。\n这部电影的演员阵容非凡，包括韦弗、汤姆·斯凯里特、约翰·赫特、伊恩·霍姆、维罗妮卡·卡特赖特、哈里·迪恩·斯坦顿和亚菲特·科托，故事背景是一艘名为Nostromo的太空拖船，被一种来历不明的怪物入侵。当外星人一个接一个地把他们带走时，机组人员拼命还击。这部电影花了很长时间才第一次出现，这部电影是一部具有阶级意识的慢燃科幻恐怖动作惊悚片，是一部非凡的元素组合。\n正如张最近在谈到这部电影时所写的那样，“”异形“最引人注目的事情之一--它不仅是一部优秀的科幻恐怖片，而且是一件真正的艺术品--就是它有多么的耐心，这一品质现在似乎比1979年(我想象的)更明显。”…。与许多大片不同的是，“异形”并不想迫使你屈服；它需要时间，因为它意味着渗透到你的神经系统。就像我们这位令人心跳加速的小朋友一样，它想要进入你的身体。“\n艾伦·里普利(Ellen Ripley)的核心角色-也是由韦弗在随后的三部续集中饰演-最初是作为一个男人写的，斯科特谈到了性别翻转是如何发生的，以及韦弗是如何被选上演员的。\n斯科特说：“我认为这个想法实际上出自小艾伦·拉德之手。”“我想是艾伦·拉德(当时是20世纪福克斯的总裁)说过，‘为什么雷普利不能是个女人？’”有很长一段时间的停顿，在那一刻我从来没有想过这件事。我想，为什么不呢，这是一个新的方向，就像我对此的想法一样。然后我们就走了。\n“我通过口口相传找到了西格尼。有人告诉我，苏尔尼在百老汇外的舞台上表演，我应该见见他。我做到了，“斯科特说。“就在那里，她是完美的。就规模、体型和智力而言，她的演技简直太棒了。所以这是为她量身定做的，真的。“。\n这部电影臭名昭著的胸部爆裂场景，一个外星人从演员约翰·赫特的胸膛里冒出来，现在是现代恐怖电影中的经典场景之一。它是用多个摄像机拍摄的，因为斯科特只能真正表演一次完整的效果，“因为一旦我把血溅得布满布景，就没有办法清理它了。赫特跪了下来，这样桌子上的一个洞上方就只能看到他的头，一个假躯干被放置到他的脖子上。”\n“我非常不让演员知道，我也不让演员知道真正的小动物，不管那会是什么。”我从来不想让他们看到，“斯科特说。“别忘了，那时候根本没有数码特效。我要想办法把那东西从他的胸膛里弄出来。“。\n斯科特回忆说，桌子底下受伤的相对简单的效果显然奏效了，“我记得斯坦利·库布里克打电话给我说，‘你是怎么做到的？’”他说，“我已经慢慢地看过了，我看不到刀子。”我刚说了这么多。他说，‘好的，我知道了。我拿到了，它起作用了。‘“。\n电影“异形”在第四周的终极夏季电影对决中被击败，这是1977年由乔治·卢卡斯执导的第一部“星球大战”电影。斯科特回忆起当时那部电影对他的影响，他指出：“它为我打开了一扇门，让我感到舒服，科幻小说不再是愚蠢的幻想，而是实际上有了现实。…。所以我被打动了。当我看到它的时候，我想我沮丧了一个月，因为我想，他到底是怎么做到的？\n斯科特在谈到卢卡斯在第一部“星球大战”中的表现时说：“我还是要向乔治脱帽致敬。”“毫无疑问，他的是目前为止最好的。”\n尽管随后的“异形”续集由导演詹姆斯·卡梅隆(James Cameron)、大卫·芬奇(David Fincher)和让-皮埃尔·朱奈(Jean-Pierre Jeunet)承接，斯科特还是带着2012年的“普罗米修斯”(Prometheus)和2017年的“异形：圣约”(Alien：Covenant)重返故事世界。他可能还没有完蛋。\n斯科特说：“我仍然认为”异形“有很大的发展空间，但我认为你现在必须重新进化。”“当我制作它的时候，我一直在想的是，第一个，为什么要制造这样的生物，为什么它会乘坐一种我一直认为是一种战机的东西，它携带着这些鸡蛋的货物。这辆车的目的是什么，鸡蛋的目的是什么？这就是要问的问题--我想下一个想法是谁，为什么，目的是什么。“。\n接下来是什么：周四，“海底总动员”在最后一周以微弱优势击败了“哈利波特与阿兹卡班的囚徒”，投票选出了下一部#终极夏日电影“哈利波特与阿兹卡班的囚徒”。下午6点加入张的行列。6月4日，在洛杉矶时报经典好莱坞Facebook页面、YouTube和Twitter上进行关于“海底总动员”的现场对话。", "note_en": "&#34;Alien&#34; director Ridley Scott joined Times film critic Justin Chang on Thursday for a conversation about the film, casting Sigourney Weaver in it, and his long, expansive career. The filmmaker, who is currently in Los Angeles, said that for him, quarantine-time has been “a great opportunity to get all those unfinished scripts finished.”\n Scott was shooting “The Last Duel,” starring Ben Affleck, Matt Damon and Adam Driver from a screenplay by Affleck, Damon and Nicole Holofcener, when the production was shut down due to the worldwide pandemic. On getting back to work, Scott said, “We still have to work out when we’re returning to finish it off, whenever.”\n The director joined Chang for a  live virtual conversation after Times readers chose &#34;Alien&#34; as the Week 4 winner in the  Ultimate Summer Movie Showdown series. Scott directed the 1979 film from a screenplay by Dan O&#39;Bannon. Among the other movies released in the same week over the years that “Alien” defeated were “Star Wars,” “The Shining” and “Mission: Impossible.” In the semifinal round of voting, “Alien” went head-to-head with Scott’s 1991 film, “Thelma and Louise.”\n  In his conversation with Chang, Scott shared his thoughts on the post-pandemic future of moviegoing and the movie business.\n “There&#39;s something in part of the job that we do, I think, because to make a movie and shoot it is an entirely illogical process where you&#39;re bringing a whole bunch of people together to a blueprint called the script,&#34; he said. &#34;You all meet in the morning, frequently for the first time, and somehow you put it together. So if you&#39;re not an optimist, you shouldn&#39;t be actually in the film industry. So I guess I&#39;m an optimist. We&#39;ll find a way. This too will pass.”\n As for “Alien,” his second feature as a director after his debut with 1977’s “The Duelists,” Scott noted that he was the fifth choice for the job, meaning that no one was expecting the film to become as important and influential as it now is.\n  With a phenomenal cast that includes Weaver, Tom Skerritt, John Hurt, Ian Holm, Veronica Cartwright, Harry Dean Stanton and Yaphet Kotto, the movie is set aboard a space tug called the Nostromo that is invaded by a monstrous creature of unknown origin. The crew desperately tries to fight back as the alien picks them off one by one. Taking its time for the alien creature to first appear, the movie is a remarkable combination of elements, a class-conscious slow-burn sci-fi horror action thriller.\n  As  Chang recently wrote about the movie, “One of the most remarkable things about &#39;Alien’ — and what makes it not just a superior piece of sci-fi horror filmmaking but a genuine work of art — is just how patient it is, a quality that seems even more apparent now than (I imagine) it did in 1979. … Unlike so many blockbusters, ‘Alien’ has no desire to bludgeon you into submission; it takes its time because it means to infiltrate your nervous system. Like our chest-bursting little friend, it wants to get inside you.”\n The central role of Ellen Ripley — also portrayed by Weaver in three subsequent sequels — was originally written as a man, and Scott talked about how the gender flip came to be, along with how Weaver came to be cast.\n “I think the idea actually came from Alan Ladd Jr.,” Scott said. “I think it was Alan Ladd [then president of 20th Century Fox] who said, ‘Why can&#39;t Ripley be a woman?’ And there was a long pause, that at that moment I never thought about it. I thought, why not, it&#39;s a fresh direction, the ways I thought about that. And away we went.\n “And I found Sigourney by word of mouth. Somebody had been told that Siourney was on an off-Broadway stage doing something, that I should meet. And I did,” Scott said. “And there it was, she was perfect. In terms of scale, size, intelligence, her acting is just fantastic. And so it was made for her, really.”\n The film’s notorious chest-burster scene, in which an alien creature emerges from within actor John Hurt’s chest, is now among the classic scenes in modern horror cinema. It was shot with multiple cameras because Scott could only really perform the full effect once, “because once I blew blood all over that set, there was no cleaning it up.&#34; Hurt knelt so that only his head was visible above a hole in a table and a false torso was placed to meet his neck.\n “I kept it very much from the actors and I kept the actual little creature, whatever that would be, from the actors. I never wanted them to see it,” Scott said. “Remember there was no digital effects in those days at all. I&#39;m going to somehow bring that creature out of his chest.”\n  The relatively simple effect of having Hurt under the table obviously worked, as Scott recalled, “I remember Stanley Kubrick called me up saying, ‘How&#39;d you do that?’ He said, ‘I&#39;ve run it through slowly, I can&#39;t see the cut.’ And I just said that much. He said, ‘OK, I got it. I got it, it worked.’”\n The movie that “Alien” defeated in Week 4&#39;s final Ultimate Summer Movie Showdown round was the first “Star Wars” film from 1977, directed by George Lucas. Scott recalled the influence that movie had on him at the time, noting, “It opened the gate for me feeling comfortable that science fiction was no longer silly fantasy but actually had a reality to it. … So I was blown away. I think I was depressed for a month when I saw it, ’cause I thought, &#39;How on Earth could he have done that?&#39;\n “My hat still comes off to George,” Scott said of Lucas for the first “Star Wars.” “Without question his was by far the best, still.”\n  Although subsequent “Alien” sequels were undertaken by directors James Cameron, David Fincher and Jean-Pierre Jeunet, Scott returned to the world of the story with 2012’s “Prometheus” and 2017’s “Alien: Covenant.” And he may not yet be done.\n “I still think there&#39;s a lot of mileage in ‘Alien,’ but I think you&#39;ll have to now re-evolve,” Scott said. “What I always thought when I was making it, the first one, why would a creature like this be made and why was it traveling in what I always thought was a kind of war-craft, which was carrying a cargo of these eggs. What was the purpose of the vehicle and what was the purpose of the eggs? That&#39;s the thing to question — who, why, and for what purpose is the next idea, I think.”\n What&#39;s next:  On Thursday,“Finding Nemo” narrowly edged out “Harry Potter and the Prisoner of Azkaban” in the final  Week 5 voting for the next #UltimateSummerMovie. Join Chang at 6 p.m. on June 4 for a live conversation about “Finding Nemo” on the Los Angeles Times Classic Hollywood Facebook Page, YouTube and Twitter.", "posttime": "2020-06-01 03:49:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "斯科特,ridley,电影", "title": "82岁的雷德利·斯科特分享了一些关于“异形”的秘密", "title_en": "82-Year-Old Ridley Scott Shares Some Secrets About 'Alien'", "transed": 1, "url": "https://news.yahoo.com/director-ridley-scott-classic-alien-012315603.html", "via": "", "real_tags": ["斯科特", "ridley", "电影"]}, {"category": "", "categoryclass": "", "imagename": "50612914a05c7636a1c54a67f57a23ba.jpg", "infoid": 1004567, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周，警察击毙了一名手无寸铁的明尼阿波利斯男子乔治·弗洛伊德(George Floyd)，明尼苏达州的抗议活动继续升级，并在全国各地引发了类似的示威活动。\n明尼苏达州官员表示，他们正在使用接触追踪来更好地了解抗议者是谁，他们来自哪里。\n随着明尼苏达州的抗议活动蔓延到全国各地，抗议者对警察杀害手无寸铁的明尼阿波利斯男子乔治·弗洛伊德(George Floyd)感到愤怒，抗议活动已经演变为游行和示威，从纽约市到洛杉矶，到处都演变成了暴力事件。在撰写本文时，美国各大城市正在实施宵禁，至少有八个州以及哥伦比亚特区已请求国民警卫队协助当地执法。\n然而，在明尼阿波利斯等一些城市，官员们开始求助于一种熟悉的工具来调查抗议者网络。这个工具是接触者追踪，它是一个熟悉的工具，因为最近几周人们经常听说它是全面的冠状病毒大流行应对措施的重要组成部分。明尼苏达州公共安全专员约翰·哈林贡(John Harringon)表示，那里的官员一直在使用他们所说的联系方式进行追踪，但没有透露太多细节，目的是勾勒出抗议者的从属关系-该州官员表示，这一过程导致他们得出结论，那里的大部分抗议活动都是由外部进入的人推动的。\n事实上，明尼苏达州州长蒂姆·沃尔兹(Tim Walz)告诉记者，高达80%的破坏性地震来自明尼苏达州以外的地区。\n撇开这是否属实不谈，不抗议的一面是，这一事实说明了总体上关于接触者追踪的隐私问题，因为使用这种工具来对抗冠状病毒大流行，从定义上讲是对隐私的侵犯。接触追踪器需要知道你的个人信息，比如你周围有谁，你在一段不重要的时间里去过哪里。现在，它显然被用来构建一个完全不同的、与冠状病毒无关的美国人的信息图景。\n更有趣的是，美国有线电视新闻网(CNN)对明尼阿波利斯数据的分析发现，似乎与关于外地人的断言完全相反。根据CNN对亨内平县警长办公室数据的分析，“过去两天，在明尼阿波利斯因骚乱和其他可能与骚乱有关的指控而入狱的人中，超过80%来自明尼苏达州。”官员们早些时候声称，大多数抗议者来自外州。“。\n与此同时，随着抗议活动的成倍增加和升级，全国各地城市的情况正在继续恶化。截至撰写本文时，最新的事态发展包括：\n国民警卫队已被召集起来帮助保护白宫免受抗议者的伤害。\n16个州的20多个城市实施了宵禁。其中之一的芝加哥已经从晚上9点开始实施宵禁。并于上午6点结束。官员们说，这将每晚到位，“直到另行通知”。\n明尼苏达州州长表示，由于人群抗议，他预计该州冠状病毒病例将会激增。\n看看这疯狂的目标抢劫场面。你觉得这些人会听任何人的话吗？那是一个可怕的场景。https://t.co/rKqanlooVW。\n近12辆洛杉矶警察局巡洋舰3日在费尔法克斯附近被抗议者损坏和摧毁。一辆公交车也被摧毁。pic.twitter.com/JAGI4uQ20n。\n暴徒刚刚在一辆废弃的警车里发现了一架AR-15，一名英雄立即拔出枪并解除了他的武装。", "note_en": "Minnesota protests are continuing to escalate and inspire similar demonstrations around the country in the wake of police killing an unarmed Minneapolis man this week named George Floyd.\n Minnesota officials say they’re using contact tracing to better understand who the protestors are and where they’re coming from.\n  As the Minnesota protests have spilled across the country, fueled by protestors angered over the police killing of an unarmed Minneapolis man named  George Floyd, the protests have morphed into marches and demonstrations that have turned violent everywhere from New York City to Los Angeles. Curfews are being imposed in major cities around the US at the time of this writing, and at least eight states, as well as the District of Columbia, have requested the National Guard to assist local law enforcement.\n  In some cities like Minneapolis, though, officials are starting to turn to a familiar tool to investigate networks of protestors. The tool is contact-tracing, and it’s a familiar tool in that people have been hearing about it frequently in recent weeks as an important component of a comprehensive coronavirus pandemic response. According to  Minnesota Public Safety Commissioner John Harringon, officials there have been using what they describe, without going into much detail, as contact-tracing in order to build out a picture of protestor affiliations — a process that officials in the state say has led them to conclude that much of the protest activity there is being fueled by people from outside coming in.\n   In fact, Minnesota’s Gov. Tim Walz  told reporters that as much as 80% of those being destructive are from outside Minnesota.\n Setting aside whether or not that’s true, the non-protest aspect to this is the fact that it speaks to privacy concerns around contact-tracing in general, since using this tool to fight the coronavirus pandemic is by definition an invasion of privacy. Contact tracers need to know personal details about you, such as who you’ve been around and where you’ve gone over a not-insignificant period of time. And now, it’s a tool that’s apparently being used to build a completely different, non-coronavirus-related informational picture of Americans.\n And what makes this even more interesting is the fact that  a  CNN analysis of Minneapolis data found what appears to be the  complete opposite of the assertion about out-of-towners. Per CNN, “More than 80% of people booked into jail in Minneapolis on riot and other potentially riot-related charges over the past two days are from Minnesota, according to a  CNN analysis of data from the Hennepin County Sheriff’s office. Officials had earlier claimed that most protesters came from out of state.”\n  Meanwhile, the situation in cities around the country is continuing to deteriorate, as protests multiply and escalate. Among the most recent developments as of the time of this writing:\n The National Guard has been called up to help protect the White House from protestors.\n More than two dozen cities in 16 states have implemented curfews. One of those, Chicago, has imposed a curfew starting at 9 p.m. and ending at 6 a.m. that officials say will be in place nightly “until further notice.”\n Minnesota’s governor has said he’s expecting the state to see a spike in coronavirus cases as a result of the crowds protesting.\n  Look at this crazy scene of the target looting. Do you think these people would listen to anyone? It was a scary scene.  https://t.co/rKqanlooVW\n  Nearly a dozen  #lapd cruisers damaged and destroyed by protesters on 3rd near Fairfax. A bus also destroyed.  pic.twitter.com/JAGI4uQ20n\n Rioters just found an AR-15 in an abandoned police car and a hero immidiately pulled his gun and disarmed him.", "posttime": "2020-06-01 03:48:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "追踪,contact,抗议者", "title": "明尼苏达州现在正在使用联系人追踪来追踪抗议者", "title_en": "Minnesota is now using contact tracing to track protestors", "transed": 1, "url": "https://bgr.com/2020/05/30/minnesota-protest-contact-tracing-used-to-track-demonstrators/", "via": "", "real_tags": ["追踪", "contact", "抗议者"]}, {"category": "", "categoryclass": "", "imagename": "096a96738ce12bce479602e692656682.jpg", "infoid": 1004566, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国4月个人所得大增10.5%，为美国经济分析局1959年开始编制数据以来最大增幅。\n这一增长主要是由于政府支付了帮助美国人应对新冠肺炎全球大流行的影响。联邦经济复苏计划，包括个人刺激计划，总额接近6.2万亿美元。与此同时，4月份失业保险金增长超过500%，达到4300亿美元。\n因此，4月份政府社会福利占个人收入的30%，即63亿美元。这一数字高于之前七个月的月平均水平17%--或32亿美元。\n即使有了这种额外的现金流入，由于冠状病毒相关的限制，美国人的支出也在减少。4月个人支出较前月减少近1.9万亿美元，或14%。受下降影响最大的行业是医疗保健、食品服务、酒店以及酒吧和餐馆。\n想要冷静，理性，甚至是好奇的方法来对付冠状病毒吗？我们已经收到了一封关于这件事的电子邮件。\n为我注册每日简报，Quartz为聪明、忙碌的人提供的早间电子邮件。", "note_en": "Personal income in the US surged 10.5% in April, the biggest jump since the  US Bureau of Economic Analysis starting compiling data in 1959.\n The rise was mainly due to government payments to help Americans cope with the fallout of the Covid-19 global pandemic. Federal economic recovery programs, including personal stimulus checks, amounted to nearly $6.2 trillion. Unemployment insurance payments, meanwhile, rose by more than 500% to $430 billion in April.\n  As a result, government social benefits accounted for 30%, or $6.3 billion, of personal income in April. That’s up from a monthly average of 17%—or $3.2 billion—in the previous seven months.\n  Even with this additional cash influx, Americans are spending less due to coronavirus-related restrictions. Personal spending declined by nearly $1.9 trillion, or 14%, in April from the previous month. The industries that were hurt most by the drop were health care, food services, hotels, as well as bars and restaurants.\n Want a calm, rational, even curious approach to coronavirus? We’ve got an email for that.\n  Sign me up for the Daily Brief, Quartz’s morning email for smart, busy people.", "posttime": "2020-06-01 03:31:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "历史,income,经济", "title": "--美国4月个人所得猛增10.5%，创历史新高", "title_en": "Personal income in the US shot up a record 10.5% in April", "transed": 1, "url": "https://qz.com/1862614/personal-income-in-the-us-shot-up-a-record-10-5-percent-in-april/", "via": "", "real_tags": ["历史", "income", "经济"]}, {"category": "", "categoryclass": "", "imagename": "0a695089568b4b882403051a8cc97eae.jpg", "infoid": 1004564, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "家/2020/5/宇宙的“失踪物质”终于在星系之间的空间找到了。\n一个由国际天文学家组成的团队已经解开了数十年之久的“失踪物质”之谜，这个“失踪物质”早就被预言存在于宇宙中，但此前从未被发现过。研究人员现在已经在星系之间的广阔空间中找到了所有丢失的“正常”物质。\n这一发现发表在5月27日的“自然”杂志上，是通过研究来自深空的巨大能量闪光(称为快速射电爆发)而取得的。\n“几十年来，我们一直在用最大的望远镜搜寻这一失踪物质，但都没有成功。快速射电爆发的发现和定位是解开这个谜团所需的关键突破，“加州大学圣克鲁斯分校天文学和天体物理学教授、通讯作者J·泽维尔·普罗查斯卡说。\n澳大利亚国际射电天文学研究中心(ICRAR)科廷大学节点的主要作者Jean-Pierre MacQuart说，天文学家已经寻找失踪物质近30年了。\n“我们从大爆炸的测量中知道宇宙开始时有多少物质，”他说。“但是当我们向外看现在的宇宙时，我们找不到应该在那里的一半。这是一件有点尴尬的事。“。\n麦夸特说，失踪的物质被发现潜伏在恒星和星系之间的广阔空隙中。“星际空间非常稀疏，”他说。“失踪的物质只相当于一个普通办公室大小的房间里的一两个原子。因此，使用传统技术很难检测到这件事。“。\n研究人员能够使用快速射电爆发现象直接探测到丢失的物质。快速射电爆发是一种短暂的能量闪光，似乎来自天空中的随机方向，持续时间只有几毫秒。科学家们不知道是什么导致了它们，但它肯定涉及到令人难以置信的能量，相当于太阳在80年内释放的量。\n麦夸特说，研究小组通过使用快速无线电爆发作为“宇宙称重站”探测到了失踪的物质。\n他说：“快速射电爆发产生的辐射通过丢失的物质扩散开来，就像你看到太阳光的颜色在棱镜中被分开一样。”“我们现在已经能够测量到足够快的射电爆发的距离，以确定宇宙的密度。我们只需要6个就能找到这件失踪的东西。“。\n在这种情况下，缺失的物质是重子物质或“普通”物质--就像构成行星和恒星中所有元素的质子和中子一样。它与暗物质不同，暗物质仍然难以捉摸，约占宇宙总物质的85%。\n研究小组还确定了快速射电爆发的距离和爆炸在宇宙中传播时的分散程度之间的关系。\n麦夸特说，我们已经发现了等同于星系的哈勃-莱梅特定律，只是适用于快速射电爆发。20世纪20年代发现的哈勃-勒梅特定律是所有宇宙距离星系测量的基础。\n研究中使用的快速射电爆发是由CSIRO的澳大利亚平方公里阵列探路器(ASKAP)望远镜探测到的，该望远镜位于西澳大利亚内陆。斯温本大学(Swinburne University)的合著者瑞安·香农(Ryan Shannon)说，ASKAP的能力对这项研究至关重要。\n他说：“ASKAP既有宽广的视野，大约是满月大小的60倍，又能以高分辨率成像。”“这意味着我们可以相对容易地捕捉到爆发，然后以令人难以置信的精度精确地定位到它们所在的星系的位置。”\nASKAP是未来平方公里阵列(SKA)望远镜的先驱。SKA可以观测到大量的快速射电爆发，为天文学家提供了一种研究宇宙中以前看不见的结构的新方法。", "note_en": "Home /  2020 /  May / Universe’s ‘missing matter’ finally found in the space between galaxies\n    An international team of astronomers has solved the decades-old mystery of the ‘missing matter’ long predicted to exist in the universe but never before detected. The researchers have now found all of the missing ‘normal’ matter in the vast space between galaxies.\n The discovery, published May 27 in  Nature, was made by studying massive flashes of energy from deep space, called fast radio bursts.\n “For decades, we have unsuccessfully searched for this missing matter with our largest telescopes. The discovery and localization of fast radio bursts was the key breakthrough needed to solve this mystery,” said corresponding author J. Xavier Prochaska, professor of astronomy and astrophysics at UC Santa Cruz.\n Lead author Jean-Pierre Macquart at the Curtin University node of the International Centre for Radio Astronomy Research (ICRAR) in Australia said astronomers have been searching for the missing matter for almost 30 years.\n “We know from measurements of the big bang how much matter there was in the beginning of the universe,” he said. “But when we looked out into the present universe, we couldn’t find half of what should be there. It was a bit of an embarrassment.”\n Macquart said the missing matter was found lurking in the vast emptiness between stars and galaxies. “Intergalactic space is very sparse,” he said. “The missing matter was equivalent to only one or two atoms in a room the size of a normal office. So it&#39;s very hard to detect this matter using traditional techniques.”\n The researchers were able to directly detect the missing matter using the phenomenon of fast radio bursts—brief flashes of energy that appear to come from random directions in the sky and last for just milliseconds. Scientists don’t know what causes them, but it must involve incredible energy, equivalent to the amount released by the sun in 80 years.\n Macquart said the team detected the missing matter by using fast radio bursts as “cosmic weigh stations.”\n “The radiation from fast radio bursts gets spread out by the missing matter in the same way that you see the colors of sunlight being separated in a prism,” he said. “We’ve now been able to measure the distances to enough fast radio bursts to determine the density of the universe. We only needed six to find this missing matter.”\n The missing matter in this case is baryonic or ‘ordinary’ matter—like the protons and neutrons that make up all the elements in planets and stars. It’s different from dark matter, which remains elusive and accounts for about 85 percent of the total matter in the universe.\n The research team also pinned down the relationship between how far away a fast radio burst is and how the burst disperses as it travels through the universe.\n &#34;We&#39;ve discovered the equivalent of the Hubble-Lemaitre Law for galaxies, only for fast radio bursts,&#34; Macquart said. &#34;The Hubble-Lemaitre Law, which was discovered in the 1920s, underpins all measurements of galaxies at cosmological distances.”\n The fast radio bursts used in the study were detected using CSIRO’s Australian Square Kilometre Array Pathfinder (ASKAP) telescope, which is located in outback Western Australia. ASKAP’s abilities were crucial to this study, said coauthor Ryan Shannon at Swinburne University.\n “ASKAP has both a wide field of view, about 60 times the size of the full moon, and can image in high resolution,” he said. “This means that we can catch the bursts with relative ease and then pinpoint locations to their host galaxies with incredible precision.”\n ASKAP is a precursor for the future Square Kilometre Array (SKA) telescope. The SKA could observe large numbers of fast radio bursts, giving astronomers a new way to study the previously invisible structure in the universe.", "posttime": "2020-06-01 03:30:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "失踪,missing,宇宙", "title": "宇宙的“失踪物质”终于在星系之间的空间被发现", "title_en": "Universe’s ‘missing matter’ finally found in the space between galaxies", "transed": 1, "url": "https://news.ucsc.edu/2020/05/missing-matter.html", "via": "", "real_tags": ["失踪", "missing", "宇宙"]}, {"category": "", "categoryclass": "", "imagename": "320547f4e9f2e060ef1ff2be01081f43.jpg", "infoid": 1004562, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你还没有看过(前)明尼阿波利斯警官德里克·肖文(Derek Chauvin)将乔治·弗洛伊德(George Floyd)的膝盖塞进弗洛伊德的颈椎近9分钟直到失去意识的视频，你真的应该看一下。如果你不能理解为什么这几个晚上美国城市的大片地区着火了，多做两件事：(1)不是你可能不认识的乔治·弗洛伊德(George Floyd)，想象一下被压在肖文的膝盖下、戴着手铐、毫不抗拒、乞求宽恕的人是你爱的人；(2)听保守派专家剖析肖文对弗洛伊德的无情攻击，并像裁判一样冷静地进行即时重播审查。(2)听保守派专家剖析肖文对弗洛伊德的无情攻击，像裁判一样冷静地立即重播。难怪这个国家似乎要分崩离析了。\n在决定政府和被统治者之间的关系时，一个社会可以做出的最重要的决定之一是，行使官方权力的人必须对行使这种权力的人承担多大的责任。国会在这方面做出了明确的选择，它通过了1871年的执行法案，我们现在称其为“1983年条款”，因为它在美国法典中的位置。简而言之，1983年条款建立了严格责任的标准，规定国家行为者对“剥夺任何权利”“应对受害方负责”。因此，如果一名警察走到你家，在没有搜查令的情况下偷看了你的一扇窗户-这显然违反了你禁止不合理搜查的第四修正案权利-他要为你侵犯这一权利而对你负责。\n但许多保守派人士做了一件奇怪的事：他们倾向于采取一种更宽容的政策，让警方和其他政府官员在行使自由裁量权时有很大的回旋余地，他们放弃了对文本主义的承诺，转而接受完全脱离文本的对1983年条款的“解释”。我们可以称之为“活的法定解释主义”的这一保守品牌的载体是最高法院的限定豁免原则，该原则对1983年条款进行了司法修订，规定责任的标准将不再是剥夺国会明确规定的“任何权利”，而是剥夺任何“明确确立的”权利。\n正如卡托的非法盾牌网站上相当详细地记录的那样，这两个词--“明确成立”--在将有价值的案件排除在法庭之外，并确保被警察或其他国家行为者侵犯权利的原告不会得到赔偿，除非他们能在司法管辖区找到事实几乎相同的先前存在的案件，否则他们做了大量的工作。但这显然不是国会制定的法规，也不是国会选择的问责标准。此外，正如威尔·鲍德(Will Baude)教授在他的杰作“限定豁免是非法的吗？”中所展示的那样，限定豁免理论没有可信的文本或历史基础；它是支持政府的司法政策制定的明目张胆的行为--如果你愿意的话，是激进主义--仅此而已。\n现在回到乔治·弗洛伊德被杀一事上。看着这段可怕的视频，人们不禁会注意到德里克·肖文(Derek Chauvin)膝盖撞到弗洛伊德脖子时脸上完全自满的表情。没有你死我活的斗争--事实上，根本没有斗争；也没有任何明显的愤怒或激情--只不过是一个佩戴徽章的人，在其他佩戴徽章的人的包围和支持下，有条不紊地榨取另一个人的生命的陈词滥调。\n众所周知，检察官很少对警察提起刑事指控，事实上，如果肖文对乔治·弗洛伊德(George Floyd)的攻击没有被病毒式视频捕捉到，他似乎不太可能被起诉。这意味着，对大多数警察不当行为的受害者追究责任的唯一途径是他们自己可以发起民权诉讼，而不需要一些检察官或公民审查委员会的慷慨。但最高法院已经在很大程度上破坏了这一补救措施，给出了司法上精心配制的粉饰，将立法选择的严格责任政策转变为近乎零问责的政策。\n城市正在燃烧，许多人再次发泄他们的愤怒，因为警察对他们发誓要保护的公民使用武力(包括致命武力)变得多么武断。这些人愤怒是正确的，如果他们明白从来不应该是这样的话，他们可能会更愤怒-国会特别选择了一种遭到最高法院否认和歪曲的强有力的政府问责制度。\n本周一，我们将了解最高法院是否会利用它现在拥有的前所未有的机会重新审查有条件的豁免权。特别有趣的是，看看哪些自封的保守派-无论是在法庭上还是在法庭外-将他们声明的对文本主义和司法尊重的承诺放在了更高的位置上", "note_en": "If you haven’t watched the video of (former) Minneapolis police officer Derek Chauvin killing George Floyd by jamming his knee into Floyd’s cervical spine for nearly nine minutes until he loses consciousness, you really should. And if you can’t understand why large swaths of urban America have been in flames these last few nights, do two more things: (1) instead of George Floyd, who you probably don’t know, imagine the person pinned under Chauvin’s knee—prone, handcuffed, unresisting, and begging for mercy—was someone you love; and (2) listen to conservative pundits dissecting Chauvin’s merciless assault on Floyd with all the sangfroid of a referee performing an instant replay review to see whether the runner’s knee was down when the ball came loose. No wonder it seems as though the country is coming apart at the seams.\n In determining the relationship between government and governed, one of the most important decisions a society can make is how accountable those who wield official power must be to those against whom that power is wielded. Congress made a clear choice in that regard when it passed the Enforcement Act of 1871, which we now call “Section 1983” after  its location in the U.S. Code. Simply put, Section 1983 creates a standard of strict liability by providing that state actors “shall be liable to the party injured” for “the deprivation of any rights.” Thus, if a police officer walks up to your house and peeks inside one of your windows without a warrant—a clear violation of your Fourth Amendment right against unreasonable searches—he is liable to you for the violation of that right.\n But many conservatives do an odd thing: In their preference for a more forgiving policy that gives police and other government officials substantial leeway in the exercise of discretion, they abandon their stated commitment to textualism and embrace an “interpretation” of Section 1983 that is utterly divorced from its text. The vehicle for this conservative brand of what we might call “living statutory interpretivism” is the Supreme Court’s qualified immunity doctrine, which judicially amends Section 1983 to provide that the standard for liability will no longer be the deprivation of “any rights”—as Congress expressly provided—but rather the deprivation of any “clearly established” rights.\n As documented in considerable detail on Cato’s  Unlawful Shield website, those two words—“clearly established”—do an extraordinary amount of work in keeping meritorious cases out of court and ensuring that plaintiffs whose rights have been violated by police or other state actors will receive no recovery unless they can find a pre-existing case in the jurisdiction with nearly identical facts. But that is plainly not the statute that Congress wrote, nor is it the standard of accountability that Congress chose. Moreover, as Professor Will Baude demonstrates in his masterful article, “ Is Qualified Immunity Unlawful?,” there is no credible textual or historical basis for the qualified immunity doctrine; it is a blatant act of pro-government judicial policymaking—activism, if you will—and nothing more.\n So now back to the killing of George Floyd. Watching that horrific video, one cannot help but notice the look of utter complacency on the face of Derek Chauvin as he drives his knee into Floyd’s neck. There is no life-or-death struggle—indeed, no struggle at all; nor is there any evident anger or passion—there is simply the banality of a man wearing a badge, surrounded and supported by other men with badges, methodically squeezing the life out of another human being.\n It is well known that prosecutors rarely bring criminal charges against police officers, and indeed it seems unlikely Chauvin would have been charged had his assault on George Floyd not been captured on a viral video. That means the only avenue of accountability for most victims of police misconduct is a civil rights lawsuit that they themselves can initiate without the largesse of some prosecutor or citizen review board. But the Supreme Court has largely gutted that remedy with a judicially confected gloss that transforms the legislatively chosen policy of strict liability into one of near-zero accountability.\n Cities are burning, and many people are venting their rage—yet again—about how cavalier police have become with the use of force, including lethal force, against the very citizens they are sworn to protect. Those people are right to be angry, and they’d probably be even angrier if they understood that it was never supposed to be like this—that Congress specifically chose a system of robust government accountability that was repudiated and perverted by the Supreme Court.\n This Monday we will find out whether the Court will take the  unprecedented opportunity it now has to revisit qualified immunity. It will be particularly interesting to see which self-styled conservatives—on and off the Court—place their stated commitment to textualism and judicial deference above whatever personal preference they may have for continuing our half-century experiment in near-zero accountability for law enforcement.", "posttime": "2020-06-01 02:54:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "警察,accountable", "title": "要追究警察的责任，结束有条件的豁免权", "title_en": "To Make Police Accountable, End Qualified Immunity", "transed": 1, "url": "https://thebulwark.com/to-make-police-accountable-end-qualified-immunity/", "via": "", "real_tags": ["警察"]}, {"category": "", "categoryclass": "", "imagename": "544da62d11178429379a472cc70d061b.jpg", "infoid": 1004560, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在肯定会让大公司的粉丝和奴隶都感到震惊的新闻中，有报道称，微软在Linux上的进步面临着严重的拒绝。\n“微软热爱Linux”是这家雷蒙德公司继续拥抱开源的最新口号。但Linux的一位发言人表示，这一步走得太远了。\n“嗯，可以这么说，它并没有被很好地接受，”这位发言人说，他希望保持无记忆状态。\n“它开始于一段时间以前，微软玩得有点难，故意表现得有点刻薄。说了一些伤人的话。但后来事情开始变得有点诡异。微软开始送小礼物，Linux恰好出现在各个地方。\n“人们觉得这已经够吓人的了。随之而来的是“微软爱Linux”，还有一个爱心表情符号和所有的东西。这足以让你呕吐。“。\n当这位发言人被问到这不是微软第一次表白时，他很快做出了回应。“是的，就像Java一样，”他说。“看看结果是什么。微软把他们的部分塞到了不受欢迎的地方，最终以诉讼告终。来自Linux的信息是这样的--‘对不起，我有男朋友了’。“。\n“这就像我总是告诉我十几岁的女儿一样，”他补充道。“我想，‘亲爱的，你知道像这样的人只想要一样东西，而且它有三个字母长：EEE。’你知道，拥抱，延伸，熄灭。他们表现得很好，让你以为他们关心你，不知不觉中，他们就把肮脏的手套放在你身上，占你的便宜。然后他们最终把你当垃圾对待，就像他们利用你一样。“。\n当被问到Linux到底在看谁时，这位发言人摇摇头，似乎停顿了一下，最后补充道：“谁知道呢，Linux到处都有。”", "note_en": "In news sure to devastate fans and slaves of the megacorporation alike, it has been reported that Microsoft has faced a crippling rejection in its advances on Linux.\n  “Microsoft loves Linux” is the latest catchphrase by the Redmond company as it continues to embrace Open Source. But a spokesperson for Linux says that it was a step too far.\n “Well, it hasn’t been well received, let’s say that,” said the spokesperson, who wished to remain memeless.\n “It started off some time ago with Microsoft playing a little hard to get, deliberately being a bit mean even. Saying some hurtful things. But then things started getting a bit creepy. Microsoft starting sending little gifts, and appearing in various places Linux happened to be.”\n “People found that creepy enough. Then along came the ‘Microsoft Loves Linux’ thing, complete with a love heart emoji and everything. It’s enough to make you barf.”\n When it was put to the spokesperson that this isn’t the first time Microsoft has professed a love interest, he was quick to respond. “Yeah, like with Java,” he said. “And look how  that turned out. Microsoft stucks their bits in places unwanted and ended up with a lawsuit. The message from Linux is this - ‘sorry, I have a boyfriend’.”\n “It’s just like I always tell my teenage daughter,” he added. “I’m like, ‘Honey, you know guys like that only want ONE thing, and it’s three letters long: EEE.’ You know, Embrace, Extend, Extinguish. They act all nice and make you think they care about you and, before you know it, they’re putting their dirty mitts all over you and taking advantage of you. And then they end up treating you like trash as they use you.”\n When asked who Linux was really seeing, the spokesperson shook his head and seemed to pause before finally adding: “Who knows, Linux gets around.”", "posttime": "2020-06-01 02:37:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "微软,linux,microsoft,男朋友", "title": "“对不起，我有男朋友了，”Linux告诉微软", "title_en": "“Sorry, I Have a Boyfriend,” Linux Tells Microsoft", "transed": 1, "url": "https://www.sudosatirical.com/articles/i-have-a-boyfriend-linux-tells-microsoft/", "via": "", "real_tags": ["微软", "linux", "microsoft", "男朋友"]}, {"category": "", "categoryclass": "", "imagename": "63e4517b9b57ed054aec1ac124432f13.jpeg", "infoid": 1004558, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "说真的，一周比一周疯狂。比如贝佐斯可能在几年内成为万亿富翁的想法。\n或者Facebook在周五收购了Giphy。说真的，扎克，伙计，别再买东西了。你拥有FB，IG和许多其他史诗般的东西。\n还有-抱着我两个月大的宝宝也很疯狂！她太珍贵了。还是很难相信我当爸爸了。\n让我们从有趣的事情开始吧。拿一杯双份浓缩咖啡，我们开始吧。\n直到我看到“食客”的这篇关于800美元寿司盒饭的文章，我才想到这个问题。当一场大流行导致一切都关门大吉时，超级豪华餐厅会做些什么呢？\n嗯，纽约寿司餐厅Masa决定采用外卖盒来服务顾客-他们将其提升到了一个新的水平。\n这是我见过的最漂亮的寿司盒子之一！它的设计是为4个人服务的，而且每周只提供20盒-这是某种疯狂的排他性。\n在餐厅相当黑暗的时期，这是一次绝妙的营销举措。一场史诗般的寿司盛宴，备受追捧和超级专属？这肯定会推动销售，即使在大流行期间也是如此。\n我知道很多州的情况开始变得轻松起来，但普通的餐厅怎么能接触到这样的东西呢？\n我脑子里突然冒出一个想法。也许会有一些特殊的家庭聚餐，并对一天的供应数量设置上限。“为您和您的家人提供价格实惠的25美元大餐--每天只有30份。”我们正在烹调一些食谱，一旦重新开张就再也看不到了。快点！现在就点你的吧！“。(哦，天哪，它有很酷的包装，还有一张手写便条。这一切都是为了创造那个强大而特殊的时刻，对吗？)。\n许多餐厅正在跳出框框来推动销售-我希望他们也能在这份清单上增加一些专营性！\n看看这篇来自“食客”的文章。它有关于这场史诗盛宴的所有有趣的细节。\n总有一天，会有一款涉及某种加密货币的流行游戏。我指的不是像Cryptokitties那样的利基市场。我的意思是堡垒之夜很受欢迎。为什么？\n有一些视频游戏变得上瘾并像病毒一样传播开来，比如“守望者”、“堡垒之夜”或“动物穿越”。\n人们喜欢快速轻松地赚钱。例如，目前的任天堂Switch Animal Crossing有一个非常健康的第三方经济，这在Etsy上已经出现。\n如果你可以玩一个在线射击游戏，并制作数字加密货币，会怎么样？这就是Lightnite.io背后的想法，这是一款早期访问的Battle Royale。我不知道这是否会获得任何形式的主流人气-但你永远不会知道。这可能是我们期待已久的“杀手级BTC应用”。\n看起来挺耐人寻味的！在游戏中赚取比特币用于购买数字商品的想法对我来说一直是一个耐人寻味的概念。有没有可能仅仅依靠虚拟经济就能过上体面的生活？有些人已经在这么做了--但是这种工作会不会变得更加主流呢？\n只有时间能证明这一点！无论如何，请点击链接查看Lightnite的官方网站。\n这是另一款非常棒的游戏--但这款游戏会让你回到游戏的旧时代--那时一切都是8位的。这个游戏叫做VirtuaVerse，是一款充满怀旧情绪、反乌托邦的评论和那些疯狂的逻辑谜题的赛博朋克游戏，需要永远搞清楚。(老实说，我并不真的怀念那些。当我还小的时候，那些东西把我逼疯了)。\n当我一看预告片，我就想起了很多年前我经常玩的所有老游戏“游戏男孩先行游戏”(Game Boy Advance Games)。它看起来也很像赛博朋克，但它是为“游戏男孩”制作的。🤣还记得他们曾经为所有平台制作游戏吗？\n厌倦了Zoom电话吗？你为什么不换个地方，在网上的“红死救赎”里围着篝火见面呢？这就是薇薇安·施瓦茨和她的编辑团队所做的。😁这只是第一条消息-点击它可以阅读整个帖子。相信我，这值得你花时间。\n我知道有这样的东西存在，但我从来没有花时间去真正地去检查它。Grabify是一个创建链接的工具，可以跟踪您的IP地址，从而跟踪您的位置。这也是永远不要点击你不认识或不信任的人发给你的随机链接的另一个原因。\n这个网站将永远播放同一首歌，创造一个永无止境、千变万化的版本。它还可以与Spotify配合使用，这样你就可以输入你最喜欢的歌曲，永远听下去。老实说，当我不得不做大量工作时，这个网站会出现在我的候选名单上。你能想象用这个恶作剧别人吗？\n这是AronChupa的“客厅里的骆驼”的永恒版本。到目前为止，我已经听了10分钟了，它还在继续。\n不要买一本枯燥的咖啡桌上的书--买一本美学的Vaporwave书，这是洛菲嘻哈站的物理表现。它被称为“梦境与人工建筑”。看起来棒极了。", "note_en": "Seriously - every week gets crazier. Like the idea that Bezos might become a trillionaire in a few years.\n or that Facebook bought Giphy on Friday. Seriously, Zuck, my man, please stop buying stuff. You own FB, IG, and a host of other epic things.\n Also - holding my two-month-old baby is pretty wild too! She’s so precious. It’s still hard to believe that I’m a Dad.\n  Let’s get started with the fun stuff. Grab a double espresso and let’s get to it.\n  This question never struck me until I saw this Eater article about an $800 Sushi Box meal. What do super fancy restaurants do when a Pandemic shuts down everything?\n Well, NY Sushi restaurant Masa decided to embrace a takeout box in order to serve customers - and they took it to the next level.\n     This is one of the most beautiful Sushi Boxes I’ve ever seen! It’s designed to serve 4 people, and only 20 boxes a week are offered - which is some insane exclusivity.\n This is a brilliant marketing move in a pretty dark time for restaurants. An epic Sushi feast that’s highly sought after and super-exclusive? That definitely will move sales, even during a pandemic.\n I know things are starting to lighten up in a lot of the states, but how could normal restaurants tap into something like this?\n Here’s one idea that popped into my head. Perhaps some special family meals with a cap on how many are available a day. “An affordable $25 feast for you and your family - only 30 available a day. We’re cooking up some recipes that won’t be seen again once we reopen. Hurry! Order yours now!” (And oh boy it comes in cool packaging with a handwritten note. It’s all about making that powerful and special moment, right?)\n A lot of restaurants are getting outside the box to drive sales - I hope they’re adding some exclusivity to that list too!\n Check out this article from Eater. It has all the juicy details about this epic feast.\n   Someday, there will be a popular game involving some kind of cryptocurrency. I don’t mean a niche like Cryptokitties. I mean Fortnite popular. Why?\n There are video games that become addicting and go viral - like Overwatch, Fortnite, or Animal Crossing.\n People love making fast and easy money. For example, the current Nintendo Switch Animal Crossing has a very healthy third party economy that has popped up on Etsy.\n What if you could play an online Shooter and make digital cryptocurrency? That’s the idea behind Lightnite.io, an early access Battle Royale. I have no idea if this will achieve any kind of mainstream popularity - but you never know. This  could be the “killer BTC app” we’ve all been waiting for.\n   Looks pretty intriguing! The idea of earning BTC in-game to spend on digital goods has always been an intriguing concept to me. Is it possible one could make a decent living just off virtual economies? Some people are already doing it - but could this kind of job go more mainstream?\n Only time will tell! Anyway, check out the official website for Lightnite at the link.\n   Here’s another really neat game - but this one will take you back to the old days of games - back when everything was 8-bit. It’s called VirtuaVerse and it’s a Cyberpunk game full of nostalgia, Dystopian Commentary, and those crazy logic puzzles that take forever to figure out. (Honestly, I don’t really miss those. Those things drove me nuts when I was little).\n As soon as I watched the trailer, I was reminded of all the old Game Boy Advance Games I used to play so many years ago. It also looks like CyberPunk but the one made for Game Boy. 🤣 Remember when they used to make games for all the platforms?\n        Bored of Zoom Calls? Why don’t you switch things up and meet around the campfire in Red Dead Redemption Online. That’s what Viviane Schwartz and her editing team did. 😁 This is just the first message - click on it to read the whole thread. Trust me, it’s worth your time.\n   I knew something like this existed, but had never taken the time to actually check it out. Grabify is a tool for creating links that track your IP address - and thus your location. This is also another reason NEVER to click on random links that people you don’t know or trust send you.\n    This website will play the same song forever, creating a never-ending and ever-changing version as it goes. It also works with Spotify, so you can enter your favorite song and listen to it forever. I’ll be honest - this website is going on my shortlist for when I have to crank out a lot of work. Can you imagine pranking someone with this?\n Here’s an eternal version of “Llama in my Living Room” by Aronchupa. I’ve listened to it for 10 minutes so far and it’s still going.\n    Don’t get a boring Coffee table book - get an Aesthetic Vaporwave one that’s the physical manifestation of a lofi hiphop station. It’s called “Deamscapes and Artificial Architecture.” It looks awesome.", "posttime": "2020-06-01 02:37:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "寿司,sushi,游戏", "title": "你会买800美元的寿司盒吗？", "title_en": "Would you buy an $800 Sushi Box?", "transed": 1, "url": "https://thelandofrandom.substack.com/p/-the-800-sushi-box-btc-battle-royale", "via": "", "real_tags": ["寿司", "sushi", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "ab9fdc4cade9050167877d22518d89e3.jpg", "infoid": 1004557, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳到主要内容周五晚上，摄影记者琳达·提拉多(Linda Tirado)在明尼阿波利斯报道反警察暴行抗议活动时被橡皮子弹击中眼睛-这是记者在报道最近的示威活动时遭遇暴力的20多起事件之一。\n提拉多说她的左眼是永久性失明的。(她很庆幸自己用右眼拍照，所以这次受伤并不是职业生涯的终结。)。\n最新消息：我的左眼是永久性失明的，医生说六周内绝对不让我回去工作。我绝对不能靠近烟或煤气。通常情况下，如果我不得不呆在家里，我会花很多时间放大人们的想法，但今天读书很伤人。\n-琳达·提拉多(@KillerMartinis)2020年5月30日。\n明尼阿波利斯警察局和市长雅各布·弗雷(Jacob Frey)的办公室没有回应关于提拉多受伤的置评请求。\n全国各地的记者都成为警察的目标，面临逮捕、拘留和暴力，包括被胡椒喷雾和橡皮子弹射杀。记者在2015年弗格森抗议活动和民权时代成为警方的目标，这种暴力和逮捕模式一直持续到本周末的抗议活动。\n周六，非营利倡导组织保护记者委员会(Committee To Protect Journers)的项目主任卡洛斯·马丁内斯·德拉塞纳(Carlos Martínez de la Serna)在一份声明中表示，“针对报道示威活动的记者、媒体工作人员和新闻机构的有针对性的攻击表明，他们完全无视他们在记录公共利益问题方面的关键作用，是恐吓他们的不可接受的企图。”“美国各城市的当局需要指示警察不要以记者为目标，并确保他们可以安全地报道抗议活动，而不必担心受伤或报复。”\n一名记者和她的摄制组在路易斯维尔被警察开枪打死。VOX新闻的亚历克斯·沃德将从这里详细报道路易斯维尔事件。\n直播@Wave3news--这是我职业生涯中从未见过的事情。在#路易斯维尔的抗议活动中，一名武装官员直接向本报记者@KaitlinRustWAVE和摄影师@jbtcardfan开枪。今晚我要为每个人祈祷。对所有人来说都是如此可怕的情况。pic.twitter.com/ipg0DjFIXu。\n-劳伦·琼斯(@LaurenWAVE3TV)2020年5月30日。\n阿里·维尔希和他的MSNBC摄制组在报道和平抗议活动时遭到明尼阿波利斯警方的枪击。\n阿里·维希和他的CNN工作人员遭到#明尼阿波利斯警察的催泪瓦斯和橡皮子弹的袭击。“绝对没有任何挑衅行为。警察开了车，把人群一分为二，开始向两个方向开枪。“。pic.twitter.com/GTXKU1fTdz。\n-乍得·洛德(@chadloder)2020年5月31日。\n周六，加拿大广播公司记者苏珊·奥米斯顿被明尼阿波利斯警方发射的橡皮子弹和催泪瓦斯击中。\n#GeorgeFloyd抗议：明尼阿波利斯的CBC#违反宵禁是有效的，但抗议者仍然在外面，所以警方开始向他们发射催泪瓦斯和橡皮子弹。包括我们的同事，CBC高级记者苏珊·奥米斯顿在内的人都受到了袭击。pic.twitter.com/N8XcXaAyHH。\n-娜塔莎·法塔赫(@NatashaFatah)2020年5月31日\n周六，路透社电视摄制组的两名成员在明尼阿波利斯被橡皮子弹击中。\n明尼阿波利斯警方将目标对准了身份明确的记者。路透社电视摄制组的两名成员被橡皮子弹击中受伤。https://t.co/cxFmi4QJoR pic.twitter.com/ORFeVxAOYN。\n-Andrew Stroehlein(@asterehlein)2020年5月31日。\n周六晚上，在加利福尼亚州奥克兰，记者兼摄影记者莎拉·贝利·林(Sarah Belle Lin)在报道抗议活动时被警方发射的橡皮子弹击中大腿。\n我被警察击中了大腿内侧。我受伤了。我重复了我的第一修正案权利。奥克兰#乔治·弗洛伊德抗议。pic.twitter.com/1Gm6Se1LQ8。\n--Sarah Belle Lin(@sarahBellelin)2020年5月31日。\n周六，CNN拍摄到一名手持摄像机和新闻头盔的男子被明尼阿波利斯警方用橡皮子弹击毙。\n一名手持摄像机和新闻头盔的男子被.。一些东西..。显然是警方发射的某种子弹pic.twitter.com/OpH2Q60ry4\n--Brian Stelter(@brianstelter)2020年5月31日。\n哥伦比亚广播公司新闻记者迈克尔·乔治报道，明尼阿波利斯警方向他的工作人员发射橡皮子弹，击中音响工程师约翰·马希茨的手臂。\n这是明尼阿波利斯警方用橡皮子弹向我们的CBS新闻组开枪的时刻。如你所见，我们附近没有抗议者--我们都戴着证件，拿着相机。我们的音响工程师手臂中弹了。#cbsnews pic.twitter.com/UAy7HYhGnL。\n-迈克尔·乔治(@MikeGeorgeCBS)2020年5月31日。\n明尼阿波利斯的警察用橡皮子弹向我们(媒体)开火。我们的音响工程师约翰·马希茨被击中了。他很好。当时我们站在离任何抗议者不到500英尺的地方，我们展示了证件，拿出了相机。#cbsnews pic.twitter.com/Ai6Qd8gLjz。\n-迈克尔·乔治(@MikeGeorgeCBS)2020年5月31日。\n洛杉矶时报记者Molly Hennessy-Fiske报道，明尼苏达州巡警周六在明尼阿波利斯向记者和摄制组发射催泪瓦斯。\n明尼苏达州巡逻队刚刚近距离向记者和摄影师发射催泪瓦斯。pic.twitter.com/r7X6J7LKo8\n-Molly Hennessy-Fiske(@mollyhf)2020年5月31日。\n周六，在加利福尼亚州圣莫尼卡的牛仔竞技场，一名ABC7记者和他的工作人员被催泪瓦斯击中。\n当抗议活动席卷罗迪欧大道的奢侈品商店时，我们正受到催泪瓦斯的袭击！来自洛杉矶@ABC7现场记者的现场报道。LIVE UPATES：https://t.co/xJQvixJr2S pic.twitter.com/xw9ZO9yFYN。\n-早安美国(@GMA)2020年5月31日。\n周六，底特律警方向几名底特律自由媒体记者喷洒胡椒，其中一名记者在警察瞄准他时举着记者证。\n我们的几名@freep记者今晚遭到底特律警方的胡椒喷雾袭击，其中一人在举着媒体徽章时直接打在脸上。一名摄影师在做自己的工作时，被另一名DPD官员拍掉了手中的直播相机。这是不对的。看看这个：https://t.co/PMq8IAnawi。\n-吉姆·谢弗(@DetroitReporter)2020年5月31日。\nKSTP记者瑞安·拉切(Ryan Raiche)在明尼阿波利斯与一群媒体在一起，周六他们被警方催泪瓦斯和胡椒喷雾。\n我自己，摄影师和制片人刚刚回到车里。我们和一群媒体在一起，认为我们在一个安全的地方。我们一直说我们是媒体。警察用催泪瓦斯和胡椒喷雾喷洒了整个人群。所有人都跑了。这太疯狂了。事情发生得太快了。pic.twitter.com/Wl3Fzzlsnw。\n-Ryan Raiche(@ryanraiche)2020年5月31日。\n副新闻记者迈克尔·亚当斯报道说，警方突袭了一个加油站，那里有几名媒体成员在避难。他说，警察将他推倒在地，并向他喷洒胡椒。\n警方刚刚突袭了我们藏身的加油站。在多次呼喊媒体，并在空中举起我的记者证后，我被摔倒在地。然后，另一个警察走过来，在我被按住的时候用胡椒喷雾喷到了我的脸上。pic.twitter.com/23EkZIMAFC。\n-迈克尔·安东尼·亚当斯(@MichaelAdams317)2020年5月31日。\n周五早上，CNN记者奥马尔·希门尼斯(Omar Jimenez)和他的工作人员在明尼阿波利斯现场直播被捕。VOX新闻的马修·伊格莱西亚斯将在这里进行更详细的报道。\n赫芬顿邮报记者克里斯托弗·马蒂亚斯(Christopher Mathias)周六晚上在布鲁克林报道抗议活动时被捕，他的照片显示，警察清楚地看到了他的记者证。据赫芬顿邮报的几名同事说，他后来获释，情况良好。\n证实这是“赫芬顿邮报”的记者@letsgomathias被逮捕-他们第一次逮捕他的时候我没有发现，但这是令人难以置信的暴力行为。他的记者证清晰可见。pic.twitter.com/ob3FvEzkiK\n--Phoebe Leila Barghouty(@PLBarghouty)2020年5月31日。\n驻明尼阿波利斯的记者Madeleine Baran在推特上说，一名明尼阿波利斯警察用武器指着她，当她自称是记者时，没有放下武器。这一事件促使她离开，停止对抗议活动的报道。\n明尼阿波利斯的一名警官用武器指着@sfreemark的头部，当时我们正站在尼科莱街和第32街报道抗议活动。我大喊大叫说我是记者。他没有放下武器，所以我们就跑了。今晚到此为止。\n-Madeleine Baran(@madeleinebaran)2020年5月30日。\n周六，明尼阿波利斯的一名警官告诉记者西蒙·莫亚-史密斯“滚到你这边去，记者先生”之后，西蒙·莫亚-史密斯被胡椒喷雾袭击并逮捕。\n我昨晚被明尼阿波利斯警方用胡椒喷雾扫射，然后被明尼阿波利斯警方逮捕，尽管我多次自称是记者：警察1：*当我在地上时检查记者徽章*警察2：“记者先生，站在你这边。”警察3：*把我装上车，看到我的记者证，然后耸耸肩*。\n-Simon Moya-Smith(@Simonmoyasmith)2020年5月31日。\n警察把我锁在拉紧的拉链上，弄伤了我的手腕。他们在面包车里把我扣留了一个小时。然后坐了一小时火辣的警车。然后，他们把我带到警察广场1号，把我和其他大约35人关在一间牢房里，没有社交距离，其他许多人都被揭穿了面具。\n-Keith Boykin(@keithboikin)2020年5月31日。\n但不幸的是，周末针对记者的不仅仅是警察。周五，福克斯新闻记者Leland Vittert和他的工作人员在华盛顿特区白宫附近遭到骚扰、袭击和驱赶。他们的相机在这个过程中坏了。\n“维特尔特和机组人员在逃跑时遭到投射物的拳打脚踢，一台福克斯新闻的摄像机在一名暴徒试图抢夺时被砸坏。”https://t.co/scwxYvIb1s。\n-凯特兰·柯林斯(@kaitlancollins)2020年5月30日。\n周五，一群人包围、污损并砸碎了CNN亚特兰大总部的窗户，但应该注意的是，CNN中心内有一个警察局总部。\n警方和安全人员现在封锁了CNN中心的入口，因为人群的意图已经变得清晰起来。这是新闻2直升机在他们的实时馈送上的视图：KHPfFVOsKG：https://t.co/YBVCxZWGYR pic.twitter.com/KHPfFVOsKG。\n-Ryan Maue(@RyanMaue)2020年5月29日。\nCBS5记者布里安娜·惠特尼(Briana Whitney)在报道凤凰城警察局总部外的抗议活动时，在电视直播中被一名男子抓住。\n这是不对的。这就是我在广播中试图报道凤凰城警察局总部抗议期间发生的事情时被这名男子故意抓住的那一刻。我觉得被侵犯了，这太可怕了。让我们做好本职工作吧。我们正在尽最大努力#AZ Family pic.twitter.com/bHXwbnDVPB。\n-Briana Whitney(@BrianaWhitney)2020年5月30日。\n在Vox的每一天，我们都致力于回答您最重要的问题，并为您和世界各地的观众提供有能力拯救生命的信息。此时此刻，我们的使命从未像现在这样重要：通过理解来增强你们的能力。VOX的工作正在接触到比以往任何时候都多的人，但我们独特的解释性新闻品牌需要资源-特别是在大流行和经济低迷时期。您的财政贡献不会构成捐赠，但它将使我们的工作人员能够继续以当前所需的质量和音量提供免费的文章、视频和播客。请考虑今天就为VOX做出贡献。\n99年前的今天，美国最严重的种族暴力事件之一发生在塔尔萨。\n查看身份中的所有故事", "note_en": "Skip to main content                                                                                                                On Friday night, photojournalist Linda Tirado was shot in the eye by a rubber bullet while covering an anti-police brutality protest in Minneapolis — one of more than  two dozen incidents of journalists experiencing violence while covering the recent demonstrations.\n Tirado says she’s permanently blind in her left eye. (She is thankful she  uses her right eye to take photos, so the injury is not career-ending.)\n an update: I am permanently blind in my left eye, and the docs absolutely refuse to let me go back to work for they say six weeks. I’m definitely not allowed to be near smoke or gas.  Usually if I had to stay home I’d spend a lot of time amplifying folk but reading hurts today\n— Linda Tirado (@KillerMartinis)  May 30, 2020\n The Minneapolis Police Department and Mayor Jacob Frey’s office didn’t respond to requests for comment about Tirado’s injury.\n Across the country journalists have been  targeted by police, facing arrest,  detention and violence, including being  pepper sprayed and  shot by rubber bullets. Journalists were  targeted by police in the Ferguson protests in 2015 and during the  civil rights era, and that pattern of violence and arrests continued into this weekend’s protests.\n “Targeted attacks on journalists, media crews, and news organizations covering the demonstrations show a complete disregard for their critical role in documenting issues of public interest and are an unacceptable attempt to intimidate them,” said Carlos Martínez de la Serna, program director at the nonprofit advocacy group Committee to Protect Journalists, in a  statement Saturday. “Authorities in cities across the U.S. need to instruct police not to target journalists and ensure they can report safely on the protests without fear of injury or retaliation.”\n  A reporter and her camera crew were shot at by police in Louisville. Vox’s Alex Ward has more detailed coverage of the Louisville incident  here.\n LIVE ON  @wave3news - something I’ve never seen in my career.  An armed officer shooting directly at our reporter  @KaitlinRustWAVE and photographer  @jbtcardfan during the protests in  #Louisville.  My prayers are going out to everyone tonight.  Such a scary situation for all.  pic.twitter.com/Ipg0DjFIXu\n— Lauren Jones (@LaurenWAVE3TV)  May 30, 2020\n Ali Velshi and his MSNBC camera crew were shot at by Minneapolis police live on the air while covering a peaceful protest.\n Ali Veshi and his CNN crew come under fire from  #Minneapolis police with tear gas and rubber bullets.  “There was absolutely no provocation. The police just drove up, split the crowd in two and started firing in both directions.”  pic.twitter.com/GTXKU1fTdz\n— Chad Loder (@chadloder)  May 31, 2020\n Canadian Broadcasting Corporation journalist Susan Ormiston was hit with rubber bullets and tear gas fired by Minneapolis police live on the air Saturday.\n #GeorgeFloyd Protests: CBC in Minneapolis #BREAKING The curfew is in effect but protesters are still out so police started tear gas and rubber bullets at them.   People have been hit including our colleague, CBC Senior Correspondent Susan Ormiston.  pic.twitter.com/N8XcXaAyHH\n— Natasha Fatah (@NatashaFatah)  May 31, 2020\n Two members of a Reuters TV camera crew were hit by rubber bullets in Minneapolis Saturday.\n Minneapolis police here aiming directly at clearly identified journalists...   Two members of a Reuters TV crew were hit by rubber bullets and injured.  https://t.co/cxFmi4QJoR  pic.twitter.com/ORFeVxAOYN\n— Andrew Stroehlein (@astroehlein)  May 31, 2020\n Reporter and photojournalist Sarah Belle Lin was hit in the thigh by a rubber bullet fired by police while covering protests in Oakland, California, Saturday evening.\n I was hit by the police by in the inner thighs. I am injured. I repeated my First Amendment rights. Oakland  #GeorgeFloyd protest.  pic.twitter.com/1Gm6Se1LQ8\n— Sarah Belle Lin (@SarahBelleLin)  May 31, 2020\n  A man with a video camera and a press helmet was filmed by CNN getting shot with rubber bullets by Minneapolis police Saturday.\n A man with a video camera and a PRESS helmet runs after being hit by... something... apparently some sort of pellet fired by police  pic.twitter.com/OpH2Q60ry4\n— Brian Stelter (@brianstelter)  May 31, 2020\n CBS News reporter Michael George reported that police in Minneapolis fired rubber bullets at his crew, striking sound engineer John Marschitz in the arm.\n This is the moment Minneapolis Police fired on our CBS News crew with rubber bullets. As you can see, no protesters anywhere near us- we all were wearing credentials and had cameras out. Our sound engineer was hit in the arm.  #cbsnews  pic.twitter.com/UAy7HYhGnL\n— Michael George (@MikeGeorgeCBS)  May 31, 2020\n Police in Minneapolis are firing on us (press) with rubber bullets. Our sound engineer John Marschitz was hit. He is ok. We were not standing within 500 feet of any protesters at the time, and we had credentials displayed and cameras out.  #cbsnews  pic.twitter.com/Ai6Qd8gLjz\n— Michael George (@MikeGeorgeCBS)  May 31, 2020\n  LA Times reporter Molly Hennessy-Fiske reported that Minnesota State Patrol troopers fired tear gas at reporters and camera crews in Minneapolis Saturday.\n Minnesota State Patrol just fired tear gas at reporters and photographers at point blank range.  pic.twitter.com/r7X6J7LKo8\n— Molly Hennessy-Fiske (@mollyhf)  May 31, 2020\n On Rodeo Drive in Santa Monica, California, an ABC7 reporter and his crew were hit with tear gas Saturday.\n &#34;We&#39;re getting hit by tear gas!&#34; Live coverage from field reporters from  @ABC7 in Los Angeles as protests rage through the luxury stores of Rodeo Drive.  LIVE UPATES:  https://t.co/xJQvixJr2S  pic.twitter.com/xw9ZO9yFYN\n— Good Morning America (@GMA)  May 31, 2020\n Several Detroit Free Press reporters were pepper sprayed by Detroit police Saturday, including one who held up a press badge while police targeted him.\n Several of our  @freep journalists got pepper-sprayed tonight by Detroit Police, one directly in the face as he held up his media badge. A photographer had her livestream camera slapped out of her hand by another DPD officer as she tried to do her job. This is not OK. See this:  https://t.co/PMq8IAnawi\n— Jim Schaefer (@DetroitReporter)  May 31, 2020\n KSTP reporter Ryan Raiche was with a group of media in Minneapolis before they were tear gassed and pepper sprayed by police Saturday.\n Myself, photographer, and producer just made it back to the car. We were with a group of media and thought we were in a safe spot. We kept saying we’re media. Police tear gassed and pepper sprayed the entire group. Everyone ran. It was insane. It happened so fast.  pic.twitter.com/Wl3Fzzlsnw\n— Ryan Raiche (@ryanraiche)  May 31, 2020\n VICE News correspondent Michael Adams reported that police raided a gas station where several members of the press were taking shelter. He said police threw him to the ground and pepper sprayed him.\n Police just raided the gas station we were sheltering at. After shouting press multiple times and raising my press card in the air, I was thrown to the ground. Then another cop came up and peppered sprayed me in the face while I was being held down.  pic.twitter.com/23EkZIMAFC\n— Michael Anthony Adams (@MichaelAdams317)  May 31, 2020\n  On Friday morning, CNN reporter Omar Jimenez and his crew were arrested live on the air in Minneapolis. Vox’s Matthew Yglesias has more detailed coverage  here.\n  HuffPost reporter Christopher Mathias, who photos show with his press badge clearly visible to officers, was arrested while covering protests in Brooklyn Saturday evening. He was later released and in good condition, according to several of his HuffPost colleagues.\n Confirmed that this is  @huffpost reporter  @letsgomathias getting arrested — I didn’t catch when they first apprehended him but it was incredibly violent. His press badge is clearly visible.  pic.twitter.com/ob3FvEzkiK\n— Phoebe Leila Barghouty (@PLBarghouty)  May 31, 2020\n Minneapolis-based reporter Madeleine Baran tweeted that a Minneapolis police officer pointed a weapon at her and did not lower it when she identified herself as a reporter. The incident prompted her to leave and stop reporting on the protest.\n A Minneapolis police officer pointed a weapon at me at  @sfreemark’s heads, while we were standing on Nicollet and 32nd covering the protests. I yelled that I’m a journalist. He did not lower his weapon, so we ran. Calling it a night.\n— Madeleine Baran (@madeleinebaran)  May 30, 2020\n Journalist Simon Moya-Smith was pepper sprayed and arrested after being told “Roll on your side, Mr. Journalist,” by a Minneapolis police officer Saturday.\n I was pepper-sprayed then arrested last night by Minneapolis PD even after identifying myself as a reporter MULTIPLE times:  Cop 1: *checks press badge as I’m on the ground* Cop 2: “Roll on your side, Mr. journalist.” Cop 3: *loads me in the car, sees my press badge and shrugs*\n— Simon Moya-Smith (@SimonMoyaSmith)  May 31, 2020\n  The police locked me in tight zip ties that bruised my wrists. They held me in a van for an hour. Then a hot police bus for an hour. Then they took me to 1 Police Plaza and held me in a jail cell with about 35 others with no social distancing and many of the others unmasked.\n— Keith Boykin (@keithboykin)  May 31, 2020\n  But it was unfortunately not just police targeting journalists over the weekend. Fox News reporter Leland Vittert and his crew were harassed, assaulted, and chased off the scene near the White House in Washington, DC, Friday. Their camera was broken in the process.\n “Vittert and the crew were punched and hit with projectiles as they fled, and a Fox News camera was broken when a member of the mob tried to grab it.”  https://t.co/scwxYvIb1s\n— Kaitlan Collins (@kaitlancollins)  May 30, 2020\n A crowd surrounded, defaced, and smashed windows at CNN’s Atlanta headquarters Friday, though it should be noted that there is a police precinct headquarters inside the CNN Center.\n The police and security are now blocking the entrances to the CNN Center as the crowd&#39;s intentions had become clear.  This is view from the News 2 Chopper on their Live Feed: https://t.co/YBVCxZWGYR  pic.twitter.com/KHPfFVOsKG\n— Ryan Maue (@RyanMaue)  May 29, 2020\n CBS5 reporter Briana Whitney was grabbed by a man on live television while reporting on protests outside Phoenix police department headquarters.\n THIS IS NOT OKAY.  This is the moment I was intentionally tackled by this man while I was on air trying to report what was happening during the protest at Phoenix PD headquarters. I feel violated, and this was terrifying.  Let us do our jobs. We are trying our very best  #azfamily  pic.twitter.com/bHXwbnDVPB\n— Briana Whitney (@BrianaWhitney)  May 30, 2020\n   Every day at Vox, we aim to answer your most important questions and provide you, and our audience around the world, with information that has the power to save lives. Our mission has never been more vital than it is in this moment: to empower you through understanding. Vox’s work is reaching more people than ever, but our distinctive brand of explanatory journalism takes resources — particularly during a pandemic and an economic downturn. Your financial contribution will not constitute a donation, but it will enable our staff to continue to offer free articles, videos, and podcasts at the quality and volume that this moment requires.  Please consider making a contribution to Vox today.\n Identities   99 years ago today, one of America’s worst acts of racial violence took place in Tulsa\n  View all stories in Identities", "posttime": "2020-06-01 02:36:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "活动,targeted,记者", "title": "警方的目标是报道乔治·弗洛伊德抗议活动的记者", "title_en": "Police targeted journalists covering the George Floyd protests", "transed": 1, "url": "https://www.vox.com/identities/2020/5/31/21276013/police-targeted-journalists-covering-george-floyd-protests", "via": "", "real_tags": ["活动", "targeted", "记者"]}, {"category": "", "categoryclass": "", "imagename": "86c8aef6f54c06e265e082743f486770.jpg", "infoid": 1004556, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为一个重大突破，Microsoft Edge现在支持原生文件系统API，这将把渐进式Web应用程序(PWA)及其使用提升到一个全新的水平。官方的路线图是通往新开发的切入点，这只意味着一件事：使用现代网络技术弥合本地应用程序的差距。\n“Microsoft Edge现在支持本机文件系统API。Microsoft Edge现在支持通过本机文件系统API授予站点编辑文件或文件夹的权限。“。\nMicrosoft Edge最终支持Native File System API是一件大事。原因如下：\n渐进式Web应用程序(PWA)显然是软件交付的未来。在过去的几年里，Web本身已经发展成为一个功能强大的平台，随着PWAS的引入和大量采用，跨设备的软件交付变得容易得多。这就是促使如此多的Web开发人员将他们的注意力转移到PWAS上的原因。\n但是，无论PWA有多伟大，它们都有一些我们不可能忽视的局限性。这些限制使用户无法将本地应用替换为渐进式Web应用。简而言之，PWAS不能做原生应用程序能做的一切。这正是谷歌、微软和其他公司试图改变的。\n正如Chrome OS开发者倡导者Sam Richard在2019年Chrome Dev峰会上指出的那样，捆绑在本地包装器中的Web应用程序迫使Web开发人员承担使浏览器和其本地包装器保持最新的安全和维护负担。\n“对于那些确实想为Web构建但需要原生功能的人，他们被迫将Web应用捆绑在原生包装器中。”\n这正是Microsoft Edge的Native File System API支持发挥作用的地方，Edge已经推出了使用此Native File System API的原生PDF编辑支持。\n将来，Microsoft Edge用户可以轻松地将对PDF文档所做的编辑保存回文件，而不是每次都保存一份副本。\n从Google Chrome83开始，针对所有桌面平台(包括Windows、Linux和MacOS)的Native File System API开始了新的原始试用。我们在文本编辑器演示中看到了它的实际应用。但首先，我们必须通过Chrome：//标志启用Native File System API实验。\n现在，转到googlechromelab.github.io/text-Editor，在您的计算机上创建并保存一个.txt文件。有趣的是，您可以使用Web应用程序直接更改存储在上的保存的TXT文件。\nMicrosoft Edge正在扩展对编辑PDF文档的类似支持。原生文件系统API和原生PDF编辑都在向Microsoft Edge Beta Channel推出。", "note_en": "In a major breakthrough, Microsoft Edge now supports Native File System API, which will take  Progressive Web Apps (PWAs) and their usage to a whole new level. An official roadmap entry points towards the new development, which only means one thing: Bridging the native app gap using modern web technologies.\n    “Microsoft Edge now supports Native File System API. Microsoft Edge now supports giving sites permissions to edit files or folders via the Native File System API.”\n  Microsoft Edge finally supporting Native File System API is kind of a big deal. Here’s why:\n Progressive Web Apps (PWAs) are clearly the future of software delivery. Over the last few years, the web has evolved into an incredibly powerful platform in itself, and with the introduction and significant adoption of PWAs, the cross-device software delivery became much easier. That’s what prompted so many web developers to shift their focus towards PWAs.\n But no matter how great PWAs are, they have certain limitations that we can’t possibly ignore. And these limitations prevent users from replacing native apps with progressive web apps. In short, PWAs can’t do everything that native apps can do. This is what Google, Microsoft, and others are trying to change.\n As Sam Richard, Developer Advocate for Chrome OS pointed out at Chrome Dev Summit 2019, web applications bundled in native wrappers force web developers to take on the security and maintenance burden of both keeping the browser and their native wrapper up to date.\n  “For those that do want to build for the web but need the capabilities of native, they’re forced to bundle web apps in native wrappers.”\n     This is exactly where Microsoft Edge’s Native File System API support comes into play, and Edge is already rolling out a native PDF editing support that uses this Native File System API.\n  In the future, Microsoft Edge users can easily save edits made to PDF documents back to the file instead of saving a copy each time.\n Starting in  Google Chrome 83, a new origin trial has started for the Native File System API for all desktop platforms including Windows, Linux, and macOS. We saw it in action in the text editor demo. But first, we had to enable the Native File System API experiment via  chrome://flags.\n  Now, go to  googlechromelabs.github.io/text-editor, create, and save a .txt file on your computer. Interestingly, you can make changes directly to a saved TXT file stored on your using a web app.\n  Microsoft Edge is extending similar support to editing PDF documents. Both Native File System API and native PDF editing is rolling out to Microsoft Edge Beta Channel.", "posttime": "2020-06-01 01:53:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,保存,edge,原生", "title": "Microsoft Edge可保存对PDF文件所做的编辑，而无需每次保存副本", "title_en": "Microsoft Edge To Save Edits Made To PDF Files Without Saving a Copy Each Time", "transed": 1, "url": "https://news.thewindowsclub.com/edge-to-save-edits-made-to-pdf-without-saving-a-copy-each-time-100308/", "via": "", "real_tags": ["microsoft", "保存", "edge", "原生"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004555, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我喜欢学习。我也喜欢构建和自动化。这些活动为我提供了自然的、内在的快乐。另一方面，写作是一种需要有意识地练习的技能。因此，为此，我使用以下技术记录了用于设置构建和部署管道的相关部分：\n上述管道的最大好处之一是成本。对于开源项目来说，除了数字海洋中的水滴之外，其他所有东西都是完全免费的。\n下面是build.gradle配置的一部分，其中添加了JaCoCo支持，SonarQube配置为向SonarCloud项目发送报告。\n插件{id&#39；Jacoco&#39；id&#39；org.sonarqube&#39；version&#39；2.8&#39；}应用插件：&#39；Jacoco&#39；Jacoco{toolVersion=&#34；0.8.5&#34；}子项目{测试。useTestNG()}JacocoTestReport{Reports{XML.。Enabled=true}}def env=系统。getenv()sonarqube{properties{property&#34；sonar.projectKey&34；，&#34；&lt；&lt；SONARCLOUD项目关键字&&gt;34；；sonar.Organization&34；，&lt；&lt；&lt；SONARCLOUD组织&&gt;&34；&34；property&#34；sonar.host.url。，env[&#34；SONARCLOUD&#34；]Property&#34；sonar.java.coveragePlugin&#34；，&#34；Jacoco&#34；Property&#34；sonar.coverage.jacoco.xmlReportPaths&#34；，File(&#34；${rootProject.projectDir}/build/reports/jacoco/test/jacocoTestReport.xml&#34；)}}JacocoTestReport。依赖于{子项目*。测试}。\nGitHub操作是GitHub的一个相对较新的功能，它允许自动执行工作流。下面的示例工作流被配置为在推送提交时运行(第二行，On：Push)。步骤大致如下：\n名称：在以下位置运行Gradle测试：推送作业：Gradle：Run-On：Ubuntu-最新步骤：-Users：Actions/checkout@v1-Uses：Actions/Setup-java@v1 with：Java-Version：11-Name：Gradle测试用法：eskatos/Gradle-command-action@v1 env：env：CI GitHub_Token：${Secrets.GITHUB_TOKEN}}With：Arguments：CLEAN TEST JacocoTestReport。：HurricanKai/Publish-Docker-Github-Action@master IF：CONTAINS(github.ref，&#39；Refs/Tags/v&#39；)，带：名称：&lt；&lt；Docker存储库URL&gt；&gt；用户名：${actis.DOCKER_USERNAME}}密码：${Secrets.DOCKER_PASSWORD}}注册表：quay.io标记：true-name：重新启动服务用法：appleboy/ssh-action@master if：包含(github.ref，&#39；res/tag/v&#39；)与：主机：${secus.HOST}}用户名：${{Secrets.USERNAME}}端口：${{Secrets.PORT}}密钥：${{Secrets.SSHKEY}}脚本：|systemctl stop&lt；&lt；我的服务&&gt;&gt;；/snap/bin/docker系统prune-af systemctl start&lt；&lt；我的服务&&gt;。\n还要将&lt；&lt；占位符&gt；值替换为实际值，这样您的项目就应该可以运行了。", "note_en": "I love to learn. I also love to build and automate. These are activities that provide natural, intrinsic joy for me. Writing, on the other hand, is a skill to be consciously practiced. So, to that end, I’m documenting the relevant parts for setting up a build and deploy pipeline using the following technologies:\n   One of the biggest benefits to the above pipeline is cost. For open source projects, everything except the droplet in Digital Ocean is completely free.\n   Below are portions of a  build.gradle configuration which add  JaCoCo support, and  SonarQube configured to send reports to a  SonarCloud project.\n plugins  { id  &#39;jacoco&#39; id  &#39;org.sonarqube&#39; version  &#39;2.8&#39; }apply plugin:  &#39;jacoco&#39;jacoco  { toolVersion  =  &#34;0.8.5&#34; }subprojects  { test . useTestNG () }jacocoTestReport  { reports  { xml . enabled  =  true  } } def env  = System . getenv ()sonarqube  { properties  { property  &#34;sonar.projectKey&#34; ,  &#34;&lt;&lt; SONARCLOUD PROJECT KEY &gt;&gt;&#34; property  &#34;sonar.organization&#34; ,  &#34;&lt;&lt; SONARCLOUD ORGANIZATION &gt;&gt;&#34; property  &#34;sonar.host.url&#34; ,  &#34;https://sonarcloud.io&#34; property  &#34;sonar.login&#34; , env [ &#34;SONARCLOUD&#34; ] property  &#34;sonar.java.coveragePlugin&#34; ,  &#34;jacoco&#34; property  &#34;sonar.coverage.jacoco.xmlReportPaths&#34; , file ( &#34;${rootProject.projectDir}/build/reports/jacoco/test/jacocoTestReport.xml&#34; )  } }jacocoTestReport . dependsOn  { subprojects *. test }\n  GitHub Actions are a relatively new feature of GitHub, which allow automating workflows. The example workflow below is configured to run whenever a commit is pushed (line two,  on: push). The steps roughly follow:\n  name: Run Gradle Tests on: push jobs:  gradle:  runs-on: ubuntu-latest  steps: -  uses: actions/checkout@v1 -  uses: actions/setup-java@v1  with:  java-version:  11 -  name: Gradle Tests  uses: eskatos/gradle-command-action@v1  env:  ENV: ci  GITHUB_TOKEN: ${{ secrets.GITHUB_TOKEN }}  with:  arguments: clean test jacocoTestReport sonarqube -Dsonar.login=${{ secrets.SONARCLOUD }} -  name: Publish to Quay  uses: HurricanKai/Publish-Docker-Github-Action@master  if: contains(github.ref,  &#39;refs/tags/v&#39;)  with:  name: &lt;&lt; DOCKER REPOSITORY URL &gt; &gt;  username: ${{ secrets.DOCKER_USERNAME }}  password: ${{ secrets.DOCKER_PASSWORD }}  registry: quay.io  tagging:  true -  name: Restart service  uses: appleboy/ssh-action@master  if: contains(github.ref,  &#39;refs/tags/v&#39;)  with:  host: ${{ secrets.HOST }}  USERNAME: ${{ secrets.USERNAME }}  PORT: ${{ secrets.PORT }}  KEY: ${{ secrets.SSHKEY }}  script:  |  systemctl stop &lt;&lt; MY SERVICE &gt;&gt; /snap/bin/docker system prune -af systemctl start &lt;&lt; MY SERVICE &gt;&gt;\n   Also replace  &lt;&lt; PLACEHOLDER &gt;&gt; values with actual values, and your project should be good to go.", "posttime": "2020-06-01 01:52:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,项目,cd,docker", "title": "关于开源项目预算的CI/CD", "title_en": "CI/CD on a budget for open source projects", "transed": 1, "url": "https://danmunro.com/posts/ci-cd-on-a-budget-for-open-source-projects/", "via": "", "real_tags": ["开源", "项目", "cd", "docker"]}, {"category": "", "categoryclass": "", "imagename": "9904c91821787cffd5c0365e7a03a07e.png", "infoid": 1004554, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "KNN又称K-近邻，是一种有监督的模式分类学习算法，当选择k个近邻并计算它们之间的距离时，可以帮助我们发现新的输入(测试值)属于哪一类。", "note_en": "KNN also known as K-nearest neighbor is a  supervised and pattern classification learning algorithm which helps us to find which class the new input(test value) belongs to when  k nearest neighbors are chosen and distance is calculated between them.", "posttime": "2020-06-01 01:52:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,近邻,nearest", "title": "基于Sklear的K-近邻算法简介", "title_en": "Introduction to K-nearest neighbour algorithm using Sklear", "transed": 1, "url": "https://ranvir.xyz/blog/k-nearest-neighbor-algorithm-using-sklearn-distance-metric/", "via": "", "real_tags": ["算法", "近邻", "nearest"]}, {"category": "", "categoryclass": "", "imagename": "740ba72a7a959e5a088d1962f9201b48.jpeg", "infoid": 1004553, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年的万维网与仅仅五年前相去甚远，更不用说20年或更长时间了。21世纪初，当我的拨号调制解调器的第一声尖叫声平息下来，数据开始通过我的电话连接的铜线进入我的台式PC时，我突然之间拥有了世界上所有的信息-天哪，我真的知道了。有一种不和谐的颜色，尖叫的标题，和字幕滚动的文字。网站是风格、内容和形式的不可预测的混合体。你实际上需要一个指南针才能在他们中间导航。\n随着GeoCities的死亡和Web1.0的大部分消失，许多狂热的早期在线生活一去不复返了。一些小的遗迹仍然存在：访问凌氏汽车(Ling‘s Cars)的网站，这是一家位于英格兰东北部我家附近的二手车经销商，你会发现一个网站故意怀旧地避开了当今的网站设计标准。凌志强的车应有尽有，千兆字节的高迪般的设计让人回想起一个更简单(但更极致)的时代。\n但是凌志美的车是一个漂亮、凌乱的异类。今天在网上走走，你会看到一片标准化的-我敢说是无聊的-网站的海洋。圆形、扁平的按钮让位于大量的空白。下拉菜单消失了，取而代之的是便于移动的导航栏。汉堡按钮的激增速度快于麦当劳-数十亿的销量-而且一切都是模块化的。\n网页设计顾问、CSS倡导者埃里克·迈耶(Eric Meyer)说，他著有多本关于CSS的畅销书，他说：“我们已经花了30年时间，仍在努力找出在什么情况下什么是最适合网络的。”目前的解决方案似乎是模块化设计，由诸如React这样的框架实现，Reaction是一个开源JavaScript库，允许站点动态呈现页面以响应用户输入和操作。模块化设计是由小型独立组件定义的，这些组件可以随时随地插入需要的站点，从而帮助站点快速扩展。它已经被像Facebook这样的大平台所普及，Facebook为数十亿用户处理无数的组件和功能。有时候，我想知道这是不是正确的答案，或者是一个被过度使用的好答案，我认为这在我们这个行业经常发生。最新的闪闪发光的东西出来了，然后，在你使用了几年后，你说，我应该偶尔使用这个，而不是一直使用。\nReaction是无处不在的，也是批评的避雷针，但正如迈耶所说，这只是一个更广泛的趋势的一个方面，即把所有东西都推到JavaScript中。如果您是JavaScript程序员，这是个好消息，但对用户来说可能有不利之处。我注意到反应驱动型网站在我的手机上往往非常耗电，因为有很多繁重的工作正在进行。\nReaction的广泛采用，以及更广泛的JavaScript，在一定程度上要归功于少数几家大牌科技公司的支持。随着社交平台逐渐主导我们的生活，它们也强行进入了设计界。自从2013年由软件工程师乔丹·沃克创建以来，Reaction一直由Facebook维护，它是Facebook和Instagram前端背后的推动力。这个框架引导人们做出的设计决策正迅速成为网上的常态：Dropbox、Netflix、Reddit和BBC都使用Reaction。\n迈耶说：“我认为，很多人看着它就会想，‘如果一家价值万亿美元的公司在使用模块化，那么它一定有它的用武之地。’”即使这与他们如何成为一家万亿美元的公司没有任何关系。\n一些人认为Facebook对Reaction的所有权是积极的。该公司可以在问题上投入的大量资源，无论多么微小，都可以让开发人员识别和解决否则可能被忽视的问题。当你在一家大型科技公司工作时，技术挑战往往比小公司更大。Facebook的前工程经理、Reaction的经理索菲·阿尔珀特解释说：“这让人们更容易发现某些规模问题，这些问题在较小的空间里可能也存在，但你可能感觉不到，也可能不会认为这是一个改进的机会。”她目前就职于硅谷公司Humu。(阿尔伯特也是增值基金的贡献者。)\n其他人则担心Facebook的管理能力对大多数用户没有特别的帮助。例如，迈耶认为Reaction是一个最有用的框架，但它一直被Facebook视为解决Facebook问题的一种方式，我们中很少有人的网站存在Facebook那样的问题。\n例如，Facebook是一堆拼凑成一个网站的小模块，而Reaction的设计就是让一切都变成一个小模块。这可能适合Facebook和Twitter，后者最近在2019年重新设计他们的网络应用程序时使用了Reaction，但大多数项目都不是这样的，“迈耶说。当我做网站时，我通常不需要极端的模块化。“。此外，模块化在某些情况下可能会耗尽资源，而且对于Meyer正在构建的网站来说-它往往不值得这样做。\n然而，Meyer并不嫉妒那些都参与到模块性中来的人。如果你在一个一切都有反应的环境中工作，就会开始把你的注意力吸引到某个特定的方向上，“他说。反应会让某些事情变得容易，让其他事情变得困难。我们通常会走向容易的事情，而远离困难的事情。它会把你赶到某个特定的方向。\n迈耶的一位朋友在一家为汽车经销商提供统包网站的公司工作。在那里，模块化的方法效果很好：经销商都希望在其他地方看到的网站版本略有不同，而且他们希望这些网站是直观和可靠的。因此，他们选择了基于反应的设计。\n阿尔伯特并不认为这是Facebook的方式或途径，也不认为Reaction与这家科技巨头的联系意味着只有Facebook的需求才能得到满足。即使是在大型组织中，也总有一些人是第一次学习这个框架，从头开始，“她说。例如，虽然Facebook员工的大多数网络属性都有统一的软件包，但他们自己不必配置Reaction上的JavaScript捆绑，他们通过社区反馈了解到其他人这样做了，并实现了一个名为Create Reaction App的应用程序来提供帮助。\nWordPress的开发者Matt Mullenweg说，模块化正在成为标准，尽管它不一定是新的--至少，不是基本的概念。我不知道你想追溯到什么时候，但我认为它真的来自CSS和将内容与样式分开的想法，“他说，并列举了雅虎的YUI Library和苹果甚至更早的设计指南等例子，作为我们现在将居住的勇敢的新模块化未来的典型例子。\n今天，当我想到Web模块化时，令我兴奋的是，人们不仅将代码开源，而且还将设计开源。\nMullenweg选择在他的平台上部署模块化，目前估计有三分之一的网站在使用他的平台。但是，尽管WordPress现在采用了模块化设计，允许人们使用内容块(他们自己的模块化格式，可以从WordPress上移除并嵌入到其他地方)来创建帖子，但Mullenweg在模块化开发方面并不总是很容易\n在过去的15年里，WordPress最大的变化是引入了新的编辑古腾伯格(Gutenberg)。2018年12月6日，团队发布了WordPress 5.0，并发布了Gutenberg，将每个帖子分解成模块化的内容块。但发布几乎没有发生，因为社区中的一场争议表明，为什么搭上科技潮流的顺风车有时会带来比实际价值更大的麻烦。\n当用户开始提出担忧时，wordpress已经深入到了使用react开发古登堡的过程中--不是担心模块化设计(尽管有些人觉得wordpress向块的转变使其编辑器变得复杂)，而是在react的许可中有一个小条款。Facebook当时的工程总监亚当·沃尔夫(Adam Wolff)写道，由于担心自己会成为专利诉讼的目标，Facebook插入了一项条款，规定用户不能起诉他们侵犯专利。WordPress用户对这一条款和签字放弃他们的权利持谨慎态度-Mullenweg不得不做出决定。\n这是一个很大的责任，因为当我们发布新版本的WordPress时，每个人都会自动更新。我们已经选择了数百万人和公司加入这项专利条款，“他说。\nMullenweg没有明白这一条款的意义；他认为Facebook是在保护自己免受永远不会发生的事情的影响。他说：“这看起来像是律师无意中塞进了他们不需要的东西。”因此，大约在阿帕奇软件基金会将Facebook的专利条款列入禁止许可的名单的同时，Mullenweg开始通过反向渠道联系游说这家硅谷巨头。脸书站稳脚跟让他大吃一惊：将维持这一条款。\n穆伦韦格被撕裂了。他可以接受专利条款，推出古腾堡最新版本，并不顾数百万人的抗议选择加入。或者，他和他的团队可以在不使用Reaction的情况下从头开始重写它，这一决定将使开发时间表增加6到12个月。\n他选择了后者，并于2017年9月发表了一篇博客文章，解释了他的理由。我们无法想象这项专利条款会强加给我们的用户，“他说。\n令穆伦韦格惊讶的是，一周后，Facebook改变了路线。我们将在麻省理工学院的许可下重新授权我们的开源项目Reaction、Jest、Flow和Immutable.js。“Wolff写道。Reaction是广泛的网络开源软件生态系统的基础，我们不想因为非技术原因而阻碍前进。\nFacebook和开源社区之间关于Reaction的小规模冲突象征着人们对网络上无处不在的科技巨头的更广泛担忧：通过将对如此无处不在的东西的控制权交给一家超国家的科技公司，你就放弃了拥有话语权的能力\n净收益是否大于风险？我会说，Reaction不需要资源。“迈耶承认。虽然很多开源项目都遵循着一条熟悉的轨迹--第一次宣布时激动人心，大张旗鼓，然后随着人们失去兴趣而迅速衰落和淡出，但Reaction并非如此。如果Facebook有问题，他们会投入资源解决问题，所以Reaction可以继续前进。\n索菲·阿尔伯特亲眼目睹了这一点。虽然致力于Reaction的开发团队-通常是7人，从来不超过9人-与Facebook的庞大规模相比可能看起来微不足道，但这样的问题解决是很少有人能负担得起的奢侈品，尤其是绝大多数依赖志愿者贡献的开源项目。来自Facebook的机构支持，以及受薪长期合同的安全性，还有另一个好处：连续性。那些在这个项目上工作的人有时间和资源去深入研究更深层次的问题，并开发出比快速解决方案更多的东西。团队可以承担可能需要数年时间才能完成的较大项目，因为正是这个长期团队在追求如何(使)更容易构建用户界面这一单一目标。\n这种长期思维在许多方面使RESPECT社区受益。最近推出的两个功能，并发模式和悬念，源于Alpert将时间投入到突破极限的项目的能力。现在判断这些想法是否会在这个行业流行起来还为时过早，“她说，但她怀疑这些想法是否会出现在一个由一群贡献者开发的图书馆里，而这些图书馆的资源要少得多。\n那么更长期的影响是什么呢？这是试图找出创建网站和Web应用程序的最佳方式的又一步，“Meyer说，他认为除了HTTP和HTML之外，不会有明确的答案。这是我们作为一个行业尝试一种新方法并找出它最适合什么的又一个例子。\nMeyer和Mullenweg一致认为，至少这不会是昙花一现。今天，网站与其他网站的不同之处不在于它们的底层架构，而在于它们的内容、设计和社论。Mullenweg补充说：我们已经进入了抽象的层次，这使得更丰富的用户体验和(允许)技术对人们的生活产生更大的影响。对我来说，Web模块化只是一个抽象层。我们如何将简单的东西抽象出来，这样我们就可以把时间花在有趣和新鲜的事情上？\n帮助绘制Reaction崛起图表的阿尔伯特认为，短期内不会出现另一种选择。如果您坐下来说，‘我不想使用这些库或框架中的任何一个’，那么您很可能最终会[创建]一个您自己的库或框架。它只是不会那么深思熟虑，也不会有一个社区或广泛的文档围绕着它。\n她鼓励其他人考虑Reaction和模块化的更广泛的影响。我认为，任何人都可以在为世界上最大的网站提供动力的相同技术之上构建自己的应用程序，这真的很棒。", "note_en": "The World Wide Web of 2020 is a far cry from what it was just five years ago, never mind 20 or more. In the early 2000s, when the first screech of my dial-up modem died down and data began to course through the copper wires of my telephone connection into my desktop  PC, I suddenly had all the world’s information at my fingertips —and boy, did I know it. There was a cacophony of colors, screaming headlines, and marquee scrolling text. Websites were an unpredictable mashup of styles, content, and form. You practically needed a compass to navigate them\n With the death of GeoCities and the disappearance of much of Web 1.0, many of the riotous early years of life online are gone forever. Some small vestiges remain: Visit the website for  Ling’s Cars, a secondhand car dealership near my home in North East England, and you’ll find a site that deliberately, nostalgically shuns today’s web design standards. Ling’s Cars has it all, with gigabytes of Gaudí-like design hearkening back to a simpler (yet more maximalist) time\n  But Ling’s Cars is a beautiful, messy outlier. Traverse the web today and you’ll see a sea of standardized —dare I say, boring —sites. Rounded, flattened buttons give way to oceans of white space. Drop-down menus have disappeared, replaced by mobile-friendly nav bars. Hamburger buttons proliferate faster than McDonald’s —billions installed —and everything is modular\n We’re 30 years in and still trying to figure out what’s best for the web in what circumstances,” says web design consultant and  CSS advocate Eric Meyer, author of a number of popular books about  CSS. The solution of the moment appears to be modular design, enabled by frameworks like React, an open-source JavaScript library that allows sites to render pages dynamically in response to user input and actions. Modular design is defined by small, standalone components that can be plugged into sites where and whenever needed, which can help sites scale quickly. It has been popularized by big platforms like Facebook, which handles countless components and features for billions of users.  I wonder, sometimes, if it’s the right answer, or if it’s one good answer that’s being overused, which I think happens a lot in our industry,” Meyer says.  The latest shiny thing comes out and then, after you use it for a few years, you say, ‘I should use this sometimes, not all the time.’\n React is both ubiquitous and a lightning rod for criticism, but it’s just one aspect of a broader trend toward, as Meyer puts it,  shoving everything into JavaScript.” That’s good news if you’re a JavaScript programmer, but it could have downsides for users.  I’ve noticed React-driven websites tend to be pretty battery-draining on my mobile because there’s a lot of heavy lifting going on,” he says\n The widespread adoption of React, and JavaScript more broadly, is due in part to support from a handful of big-name tech companies. As social platforms have grown to dominate our lives, they’ve muscled into the design world, too. Since its creation by software engineer Jordan Walke in 2013, React has been maintained by Facebook, where it’s the driving force behind Facebook and Instagram’s frontends. The design decisions the framework funnels people toward are quickly becoming the norm online: Dropbox, Netflix, Reddit, and the  BBC  all use React\n I think there’s a good amount of people looking at it and thinking, ‘If a trillion-dollar company is using modularity, there must be something to it,’” says Meyer.  Even if it has nothing to do with how they became a trillion-dollar company.\n Some see Facebook’s ownership of React as a positive. The vast resources the company can throw at a problem, no matter how minute, allows developers to identify and solve issues that might otherwise be overlooked.  When you work at a large tech company, the technical challenges tend to be larger than [they would be] at a small company. It makes it easier to identify certain problems of scale, which in a smaller space might also be there, but which you might not feel as acutely and might not identify as an opportunity to make an improvement,” explains Sophie Alpert, a former engineering manager and manager of React at Facebook, who now works at the Silicon Valley firm Humu. (Alpert is also an  Increment contributor.)\n Others worry that Facebook’s stewardship has not been especially helpful to most users. Meyer, for instance, believes React is a mostly useful framework, but that it  has been treated by Facebook as a way to solve Facebook’s problems, and few of us have websites that have Facebook’s problems.\n For instance, Facebook is a bunch of little modules pieced together to form a website, and React is designed to make everything a little module. That may suit Facebook —and Twitter, which recently used React in the  2019 redesign of their web app —but  most projects are not like that,” says Meyer.  When I’m making a website, I often don’t have that need for extreme modularity.” Moreover, modularity can, in some instances, be a resource drain, and for the websites Meyer is building —it tends to not be worth it\n Meyer doesn’t begrudge those who are all in on modularity, however.  If you’re working in an environment where everything is React, that starts to draw your focus in a certain direction,” he says.  React makes certain things easy and other things hard. We generally move toward the things that are easy and away from the things that are hard. It herds you in a certain direction.\n A friend of Meyer’s works for a company that provides turnkey websites to car dealerships. There, the modular approach works well: The dealerships all want slightly different versions of sites they’ve seen elsewhere, and they want them to be intuitive and reliable. So they go for a React-based design\n Alpert doesn’t think that it’s Facebook’s way or the highway, or that React’s ties to the tech colossus mean only Facebook’s needs get served.  Even in a large organization, there are always people who are learning the framework for the first time, people who are starting from scratch,” she says. For example, while Facebook employees, who had a unified software pack for most of their web properties, didn’t have to configure the JavaScript bundling on React themselves, they learned through community feedback that others did, and implemented an application, Create React App, to help\n Matt Mullenweg, the developer of WordPress, says modularity is becoming the norm, though it isn’t necessarily new —at least, not the underlying concept.  I don’t know how far back you want to go, but I think it really comes from  CSS and the idea of separating out the content from the styling,” he says, citing examples such as  Yahoo’s mid-2000s  YUI Library and Apple’s even earlier design guidelines as prototypical examples of the brave new modular future we now inhabit\n When I think about web modularity today, what’s exciting to me is that people aren’t just open-sourcing the code but also the design,” he says\n Mullenweg elected to deploy modularity on his platform,  used by an estimated one in three websites today. But while WordPress now has a modular design, allowing people to create posts using blocks of content —their own modular format, which can be taken off WordPress and embedded elsewhere —Mullenweg hasn’t always had an easy time with modular development\n The biggest change to WordPress over the last 15 years has been the introduction of its new editor, Gutenberg. On December 6, 2018, the team published WordPress 5.0 and released Gutenberg, which broke down every post into modular content blocks. But the release almost didn’t happen, due to a controversy in the community that shows why hitching your wagon to a tech trend can sometimes be more trouble than it’s worth\n WordPress was deep into the development of Gutenberg using React when users began to raise concerns —not with the modular design ( although some feel WordPress’s shift to blocks has complicated its editor), but with a small clause inside React’s license. Fearing it would become a target for patent litigation, Facebook inserted a clause stating that users couldn’t sue them for patent infringement,  wrote Adam Wolff, an engineering director at Facebook at the time. WordPress users were wary of the clause, and of signing away their rights —and Mullenweg had a decision to make\n It’s a big responsibility, because when we ship a new version of WordPress, everyone auto-updates. We’d have been opting millions of people and companies into this patent clause,” he says\n Mullenweg didn’t see the point of the clause; he believed Facebook was protecting itself from something that would never happen.  It seemed like something a lawyer had slipped in [that] they didn’t need,” he says. So around the same time the Apache Software Foundation  placed Facebook’s patent clause on its list of disallowed licenses, Mullenweg began to lobby the Silicon Valley giant through backchannel connections. He was surprised when Facebook stood firm: It would maintain the clause\n Mullenweg was torn. He could accept the patent clause, roll out the Gutenberg update, and opt in millions of people despite their protestations. Or he and his team could rewrite it from scratch without using React, a decision that would add anywhere from six to 12 months to the development timetable\n He chose the latter, and published  a September 2017 blog post explaining his rationale.  We couldn’t imagine this patent clause being pushed on our users,” he says\n To Mullenweg’s surprise, a week later, Facebook changed course.  We are going to relicense our open-source projects React, Jest, Flow, and Immutable.js under the  MIT license,”  wrote Wolff.  React is the foundation of a broad ecosystem of open-source software for the web, and we don’t want to hold back forward progress for nontechnical reasons.\n The skirmish between Facebook and the open-source community over React is emblematic of broader concerns about the ubiquity of tech giants on the web: By handing over control of something so ubiquitous to a supranational tech firm, you cede the ability to have a say\n Do the net benefits outweigh the risks?  I will say, React does not want for resources,” Meyer admits. While a lot of open-source projects follow a familiar trajectory —plenty of excitement and fanfare when first announced, followed by a rapid decline and fade-out as people lose interest —that’s not the case with React.  If Facebook has a problem, they’re going to throw resources at the problem, so React can keep advancing.\n Sophie Alpert has seen that firsthand. While the team of developers working on React —usually seven people, never more than nine —may seem minuscule in light of Facebook’s sheer size, such problem-solving is a luxury few others could afford, not least the vast majority of open-source projects that rely on volunteer contributions. Institutional support from Facebook, and the security of salaried, long-term contracts, has another benefit: continuity. Those working on the project have the time and resources to delve into deeper issues and develop more than quick fixes.  The team can take on larger projects that might take multiple years to finish, because it’s this long-term team that is chasing after the singular goal of how [to] make it easier to build user interfaces,” she says\n That long-term thinking benefited the React community in a number of ways. Two recently rolled-out features, Concurrent Mode and Suspense, stem from Alpert’s ability to dedicate time to projects that push the envelope.  It’s too early to tell if these ideas are going to catch on in the industry,” she says, but she doubts they would have arisen in a library developed by a group of contributors with significantly fewer resources\n And what about the longer-term impact?   This is another step in that process of trying to figure out the best way to create websites and web apps,” says Meyer, who doesn’t believe there will be a definite answer, other than  HTTP and  HTML.  It’s another example of us as an industry trying out a new approach and figuring out what it’s best for.\n  Meyer and Mullenweg agree that, at the very least, it won’t be a flash in the pan. What differentiates websites from one another today isn’t their underlying architecture but their content, design, and editorial. Mullenweg adds:  We’ve moved to levels of abstraction that enable much richer user experiences and [allow] technology to have a much greater impact on people’s lives. To me, web modularity is just a layer of abstraction. How do we abstract the easy stuff so we can spend time on what’s interesting and new?\n Alpert, who helped chart React’s rise, doesn’t see an alternative emerging anytime soon.  If you were to sit down and say, ‘I don’t want to use any of these libraries or frameworks,’ chances are you’ll end up [creating] a library or framework of your own. It just won’t be as thought-out or have a community or extensive documentation around it.\n She encourages others to think about the broader impact of React and of modularity.  I think it’s really great that anyone can build their [own] applications on top of the same technologies that power the biggest websites in the world.", "posttime": "2020-06-01 01:51:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "反动派,rise,facebook", "title": "反动派的兴起", "title_en": "The rise of React", "transed": 1, "url": "https://increment.com/frontend/the-rise-of-react/", "via": "", "real_tags": ["反动派", "rise", "facebook"]}, {"category": "", "categoryclass": "", "imagename": "c0fdbe323d34d5d77bb0720e1e5fe3f1.jpg", "infoid": 1004552, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加州大学戴维斯分校心理研究所(UC Davis Mind Institute)的一项研究发现，在儿童早期，自闭症女孩的自闭症症状严重程度往往比自闭症男孩表现出更大的下降和更少的上升。幼儿期是大脑大量发育的时期，具有学习和发展的关键能力。这也是自闭症初步诊断的典型时间，也是早期干预的最佳时间。在美国，大约每54名儿童中就有1名被确认患有自闭症谱系障碍(ASD)，其中男孩患有自闭症谱系障碍的人数是女孩的四倍。\n先前的研究表明，在儿童时期自闭症严重程度的变化方面，结果不一致。一般的感觉是，确诊时自闭症的严重程度将持续一生。\n思维研究所的这项研究发表在5月14日的“自闭症和发育障碍杂志”上，评估了儿童早期症状严重程度的变化以及与这些变化相关的潜在因素。它包括125名患有自闭症儿童(89名男孩和36名女孩)，来自自闭症表现者项目(APP)，这是一个在思维研究所进行了第14年的纵向项目。这些儿童在整个童年期间都接受了大量的基于社区的自闭症干预。\n研究人员使用了一种名为ADOS校准严重性评分(CSS)的10分严重程度衡量标准，该评分来自自闭症诊断观察表(ADOS)，这是自闭症研究中的黄金标准评估工具。他们计算了参与者在6岁和3岁时的ADOS CSS评分之间的差异，计算出参与者的严重程度变化得分。两分或更多的变化被认为是症状严重程度的显著变化。\n这项研究根据参与者的严重程度变化得分将他们分为严重程度降低组(28.8%)、稳定严重度组(54.4%)和严重程度增加组(16.8%)。一个关键的发现是，儿童的症状严重程度可能会随着年龄的变化而变化。事实上，孩子们可以进步，也可以变得更好。\n加州大学戴维斯分校精神研究所(UC Davis Mind Institute)著名精神病学和行为科学教授、该研究的资深作者大卫·阿马拉尔(David Amaral)表示：“我们发现，近30%的幼儿在6岁时的自闭症症状没有3岁时严重。在某些情况下，儿童完全失去了自闭症诊断。”他是加州大学戴维斯分校(UC Davis Mind Institute)的著名精神病学和行为科学教授，也是这项研究的资深作者。\n阿马拉尔说：“有些孩子似乎病情恶化，这也是事实。”“不幸的是，目前还无法预测谁会做得很好，谁会出现更严重的自闭症症状，需要不同的干预措施。”\n最佳结果是当先前被诊断患有自闭症的人由于自闭症症状消失而不再符合自闭症诊断标准时所达到的标准。在这项研究中，7名参与者(4名女孩和3名男孩)在6岁时ADOS CSS低于ASD临界值，这可能表明最佳结果。与病情稳定或加重的儿童相比，症状严重程度下降的儿童在多个领域具有更好的适应技能。\n女孩和男孩可能有不同的自闭症症状表现。在认知能力、社交能力和实际沟通能力方面，女孩可能表现出比男孩更好的发展结果。\n这篇论文的第一作者、思维研究所的研究生Einat Waizbard-Bartov说：“我们发现，在童年早期，自闭症女孩的严重程度比男孩降低得更多，而严重程度的增加则比男孩更少，”Einat Waizbard-Bartov是思维研究所的研究生，也是这篇论文的第一作者。\n根据Waizbard-Bartov的说法，这种差异的一个可能的解释是女孩们能够伪装或隐藏她们的症状。伪装自闭症的特征包括在社交场合掩饰自己的症状。这种应对策略是一种社会补偿行为，在包括成年期在内的不同年龄范围内，与患有ASD的男性相比，被诊断为ASD的女性更普遍。\nWaizbard-Bartov说：“事实上，更多的女孩似乎降低了自闭症的严重程度，这可能是因为与男孩相比，女孩的数量越来越多，随着年龄的增长，男孩已经学会了如何掩盖自己的症状。”“我们将在未来的研究中探索这种可能性。”\n研究还发现，智商与症状严重程度的变化有显著关系。智商高的儿童更有可能表现出自闭症症状的减少。\n“智商被认为是自闭症儿童症状严重程度的最强预测因子，”Waizbard-Bartov说。随着智商分数从3岁增加到6岁，症状严重程度降低。\n研究人员无法确定早期严重程度与未来症状变化之间的关系。令人惊讶的是，症状严重程度在6岁时增加的儿童组在3岁时的严重程度明显较低，他们的严重程度评分比其他组的变量更小。\n这项研究提出了几个需要进一步调查的问题，如智商、最初的严重程度、接受的干预类型和强度之间的关系，以及随着时间的推移症状变化的关系。\n这项研究得到了美国国立卫生研究院(NIH)(R01MH103371、R01MH104438、R01MH106518、R01MH104438、R01MH103284和T32 MH073124)的资助，并得到了国家儿童健康与发展研究所(NICHD)授予的自闭症卓越中心的资助(P50 HD093079)。它还得到了智力研究所智力和发育障碍研究中心(U54HD079125)和西蒙斯基金会的支持。\n这项研究的其他作者是加州大学戴维斯分校心理学系的埃米利奥·费雷尔，以及加州大学戴维斯分校精神病学和行为科学系的布里安娜·希思、格雷戈里·S·杨、萨利·罗杰斯、克里斯蒂娜·吴·诺达尔和玛乔丽·所罗门。\n文章：Waizbard-Bartov等人。(2020)。儿童早期自闭症症状严重程度变化轨迹的研究。自闭症与发育障碍杂志。https://link.springer.com/article/10.1007/s10803-020-04526-z", "note_en": "During early childhood, girls with autism tend to show greater reduction and less rise in their autism symptom severity than boys with autism, a UC Davis MIND Institute  study has found.    Early childhood is a period of substantial brain growth with critical ability for learning and development. It also is the typical time for an initial diagnosis of autism and the best time for early intervention. In the U.S., about  1 in 54 children has been identified with autism spectrum disorder (ASD), with four times as many boys with ASD as girls.\n Previous studies indicated inconsistent results in terms of changes in autism severity during childhood. The general sense was that the severity of autism at diagnosis would last a lifetime.\n The MIND Institute’s study, published May 14 in the  Journal of Autism and Developmental Disorders, evaluated changes in symptom severity in early childhood and the potential factors associated with those changes. It included 125 children (89 boys and 36 girls) with ASD from the  Autism Phenome Project (APP), a longitudinal project in its 14th year at the MIND Institute. The children received substantial community-based autism intervention throughout their childhood.\n The researchers used a 10-point severity measure called the ADOS Calibrated Severity Score (CSS) derived from the Autism Diagnostic Observation Schedule (ADOS), the gold standard assessment tool in autism research. They computed a severity change score for participants as the difference between their ADOS CSS scores at age 6 and at age 3. A change of two points or more was considered a significant change in symptom severity.\n  The study classified participants based on their severity change score into a Decreased Severity Group (28.8%), a Stable Severity Group (54.4%) and an Increased Severity Group (16.8%). One key finding was that children’s symptom severity can change with age. In fact, children can improve and get better.\n “We found that nearly 30% of young children have less severe autism symptoms at age 6 than they did at age 3. In some cases, children lost their autism diagnoses entirely,” said  David Amaral, a distinguished professor of psychiatry and behavioral sciences, faculty member at the UC Davis MIND Institute and senior author on the study.\n “It is also true that some children appear to get worse,” Amaral said. “Unfortunately, it is not currently possible to predict who will do well and who will develop more severe autism symptoms and need different interventions.”\n Optimal outcome is a standard achieved when someone previously diagnosed with ASD no longer meets autism diagnostic criteria due to loss of autism symptoms. In this study, seven participants (four girls and three boys) had an ADOS CSS below the ASD cutoff at age 6, potentially indicating optimal outcome. Children showing decreasing symptom severity had better adaptive skills in multiple domains compared to those in the stable or increased severity groups.\n  Girls and boys might be characterized with different manifestations of autism symptoms. Girls might show better developmental results than boys in cognition, sociability and practical communication skills.\n “We found that girls with autism decrease in severity more than boys and increase in severity less than boys during early childhood,” said Einat Waizbard-Bartov, a graduate researcher at the MIND Institute and the first author of the paper.\n One possible explanation for this difference is the girls’ ability to camouflage or hide their symptoms, according to Waizbard-Bartov. Camouflaging the characteristics of autism includes masking one’s symptoms in social situations. This coping strategy is a social compensatory behavior more prevalent in females diagnosed with ASD compared to males with ASD across different age ranges, including adulthood.\n “The fact that more of the girls appear to have decreased in autism severity may be due to an increasing number of girls compared to boys who, with age, have learned how to mask their symptoms,” Waizbard-Bartov said. “We will explore this possibility in future studies.”\n  The study also found that IQ had a significant relationship with change in symptom severity. Children with higher IQs were more likely to show a reduction in ASD symptoms.\n “IQ is considered to be the strongest predictor of symptom severity for children with autism,” Waizbard-Bartov said. “As IQ scores increased from age 3 to age 6, symptom severity levels decreased.”\n The researchers could not identify a relationship between early severity levels and future symptom change. Surprisingly, the group of children with increased symptom severity at age 6 showed significantly lower severity levels at age 3, and their severity scores were less variable than the other groups.\n The study raises several issues for further investigation, such as the relationships between IQ, initial severity level, and type and intensity of intervention received, in relation to symptom change over time.\n This research was supported by grants from the National Institutes of Health (NIH) (R01MH103371, R01MH104438, R01MH106518, R01MH104438, R01MH103284 and T32 MH073124) and by an Autism Center of Excellence grant awarded by the National Institute of Child Health and Development (NICHD) (P50 HD093079). It also was supported by the MIND Institute Intellectual and Developmental Disabilities Research Center (U54HD079125) and the Simons Foundation.\n Other authors on this study are Emilio Ferrer from the UC Davis Department of Psychology, and Brianna Heath, Gregory S. Young, Sally Rogers, Christine Wu Nordahl and Marjorie Solomon from the UC Davis Department of Psychiatry and Behavioral Sciences.\n Article: Waizbard-Bartov et al. (2020). Trajectories of Autism Symptom Severity Change during Early Childhood.  Journal of Autism and Developmental Disorders.  https://link.springer.com/article/10.1007/s10803-020-04526-z", "posttime": "2020-06-01 01:51:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "表明,severity,自闭症", "title": "研究表明，自闭症的严重程度在儿童早期可能会有很大的变化", "title_en": "Autism severity can change substantially during early childhood, study suggests", "transed": 1, "url": "https://health.ucdavis.edu/health-news/contenthub/autism-severity-can-change-substantially-during-early-childhood/2020/05", "via": "", "real_tags": ["表明", "severity", "自闭症"]}, {"category": "", "categoryclass": "", "imagename": "6f1fe79901da00f9f96a4be2480d1c61.jpg", "infoid": 1004551, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的72小时里，美国各地的人们捕捉到了可能是有史以来最全面的警察暴行的现场画面。我们看到的任何一段视频都可能引发一场全国性的讨论，人们挑选自己的元素，寻找背景进行辩论，并挖掘每个参与其中的人的过去。但这不仅仅是一起暴力事件。它无处不在。\n纽约市一名警察撕下一名年轻黑人男子的防护口罩，并用胡椒喷雾袭击他，而受害者则和平地站在那里举起双手。\n纽约市警察开着两辆不同的车，在街上冲撞人群。另外，一辆行驶中的警车用车门砰的一声撞上了某人，然后驾车离开。\n明尼阿波利斯的安全部队沿着一条安静的居民区街道行进，并向在私人门廊上观看的居民发射油漆罐。\n路易斯维尔警方突袭了一个公共广场，没收并销毁了用来对抗胡椒喷雾等刺激性物质的水和牛奶。\n亚特兰大警方截住了两名黑人，莫名其妙地用泰瑟枪向他们射击，并将他们从车里撕下来。\n据报道，一名纽约市官员用双手将一名女子推倒在地，称她为“他妈的愚蠢的婊子”。\n圣安东尼奥警方对人们使用催泪瓦斯。达拉斯警方也是如此。洛杉矶警方也是如此。华盛顿警方也是。名单还在继续。\n许多人报告说被橡皮子弹击中。MSNBC主持人阿里·维尔希表示，他是在州警察无端向和平集会开枪后被枪杀的。明尼阿波利斯的一名自由摄影师表示，在被警察开枪打死后，她的左眼永久失明。\n周六，几名据称在不同城市实施暴力的警察的名字开始在Twitter上走红，人们努力将视频中的面孔与网络上的个人信息进行交叉对照。\n暴力事件似乎如此普遍和持续，以至于你可能会误以为它是在国家层面上协调一致的。在某种程度上，的确如此：特朗普总统像体育赛事上的球迷一样为警察的暴力欢呼，全国各地的警察部门在接受了20年来反恐战争的传授后，把自己塑造成了军事力量。\n“美国城市面临暴力抗议的死亡人数，”福克斯新闻(Fox News)头版头条这样写道。“纽约时报”说：“随着抗议活动在美国各地蔓延，街头出现了骚乱。”“华盛顿邮报”说：“火力和愤怒席卷了美国。”CNN说：“愤怒和痛苦的浪潮席卷了美国几十个城市。”但是谁的怒火呢？谁的怒火？谁的暴力行为？\n这里还有另一则新闻：犹他州的ABC当地新闻刊登了一则图片，上面写着“盐湖城的暴力抗议活动”。在视频的背景中，警察用拐杖将一名老人击倒在地。他只是站在一个公共汽车站附近。\n盐湖城警方推倒一名手持拐杖的老人，罪名是沿街站立：pic.twitter.com/PCLkHqQtJg。\n-蒂莫西·伯克(@bubaprog)2020年5月31日。\n我们不能否认我们所看到的，我们必须准确地描述它。谁的暴力行为？谁的怒火？是美国警方寄来的。\n纽约警察局官员刚刚称一名女抗议者为“愚蠢的婊子”，并将她推倒在地pic.twitter.com/18YUHYmqQa。\n--Jason Lemon(@JasonLemon)2020年5月30日。\n警察不喜欢我拍摄着火的汽车，所以他们拿着警棍向我走来。撞了我的自行车。啊，这里是音频pic.twitter.com/tfaOoVCw5v。\n-约翰·库萨克(@JohnCusack)2020年5月31日。\n她说，当警察向她脸上发射某种子弹时，她正带着她的食品杂货回家。说她不是抗议者。#DallasProtestpic.twitter.com/2IyO1S9j6n。\n-凯文·克劳斯(@Kevin RKrause)2020年5月31日。\nMSNBC记者在明尼阿波利斯pic.twitter.com/Cy4ayEm5TE几乎被执法人员用某种爆炸装置击中。\n-Aaron Rupar(@atrupar)2020年5月31日\n广泛分享：国民警卫队和MPD扫荡我们的住宅区街道。在我们家的前廊向我们发射油漆罐。大喊“照亮他们”#JusticeForGeorgeFloyd#JusticeForGeorge#BlackLivesMatter pic.twitter.com/bW48imyt55。\n-Tanya Kerssen(@tkerssen)2020年5月31日。\n在亚特兰大市中心，警方增加了警力，因为警方使用泰瑟枪将两人从一辆车里拉出来。https://t.co/dSjEgItPcy。\n-CBS46(@CBS46)2020年5月31日。\n警方刚刚突袭了我们藏身的加油站。在多次呼喊媒体，并在空中举起我的记者证后，我被摔倒在地。然后，另一个警察走过来，在我被按住的时候用胡椒喷雾喷到了我的脸上。pic.twitter.com/23EkZIMAFC。\n-迈克尔·安东尼·亚当斯(@MichaelAdams317)2020年5月31日。\n我哥哥昨晚去丹佛参加抗议活动了。当警察离开时，其中一人用胡椒弹向他开枪，打碎了他的手机背面，并在他的脸上爆炸。他们彼此相距约30英尺，看起来这名警官直接对准了他的脸pic.twitter.com/m9vxaSQbwI。\n-Rachelle D&39；nae(@heyydnae)2020年5月31日\n我们到家了，我们很安全。但是我的孩子们今晚被喷了胡椒喷雾整个和平抗议。我当时在场。我看到它了。纽约警察局对抗议者的暴力和残暴令人震惊。如此多的愤怒针对的正是他们发誓要保护的人。pic.twitter.com/XnJHT0jIls。\n-Dianne Morales(@Diann4NYC)2020年5月30日", "note_en": "Over the past 72 hours, people across the US have captured what may be the most comprehensive live picture of police brutality ever. Any one of the videos we’ve seen could have sparked a national discussion, with people picking apart their elements, searching for context to argue about, and digging through the pasts of everyone involved. But it’s not just one act of violence. It’s everywhere.\n  A New York City police officer tore a protective mask off of a young black man and  assaulted him with pepper spray while the victim peacefully stood with his hands up\n New York City police officers, in two separate vehicles,  rammed a crowd in a street. Separately, a moving police vehicle  slammed someone with a car door and drove away\n Security forces in Minneapolis marched down a quiet residential street and  shot paint canisters at residents who were watching from their private porch\n Police in Louisville raided a public square,  confiscating and destroying water and milk, which is used to counter irritants like pepper spray\n Atlanta police stopped two black people, inexplicably  shooting them with tasers and tearing them out of their car\n A New York City officer used two hands  to throw a woman to the ground, reportedly calling her a “stupid fucking bitch”\n San Antonio Police  used tear gas against people.  So did Dallas police.  So did Los Angeles police.  So did DC police. The list goes on.\n Many people  reported being shot by rubber bullets. MSNBC host Ali Velshi  says he was shot after state police fired unprovoked into a peaceful rally. A freelance photographer in Minneapolis says she  went permanently blind in her left eye after being shot by police.\n On Saturday, the names of several police officers allegedly seen perpetrating violence in different cities began trending on Twitter as people worked to cross-reference faces from videos with personal information on the web.\n The violence appears so widespread and consistent that you could be mistaken for thinking it’s coordinated at a national level. To some extent, it is: President Trump has  cheered on police violence like a fan at a sports event, and police departments across the country have styled themselves as military forces after receiving two decades of hand-me-downs from the War on Terror.\n “US cities face toll of violent protests,” says a headline at the top of  Fox News. “Fury in the streets as protests spread across the US,” says  The New York Times. “Fire and fury spread across the US,” says  The Washington Post. “Wave of rage and anguish sweeps dozens of US cities,” says CNN. But whose rage? Whose fury? Whose violence?\n Here’s another: ABC local news in Utah runs a graphic saying “violent protests in Salt Lake City.” In the background of the video, police knock an elderly man with a cane to the ground. He was simply standing near a bus stop.\n Salt Lake City cops shove down an elderly man with a cane for the crime of standing along the street:  pic.twitter.com/PCLkHqQtJg\n— Timothy Burke (@bubbaprog)  May 31, 2020\n We can’t deny what we are seeing, and we must describe it accurately. Whose violence? Whose rage? It’s from American police.\n  NYPD officer just called a female protester a “stupid fucking bitch” and threw her to the ground  pic.twitter.com/18YUHYmqQa\n— Jason Lemon (@JasonLemon)  May 30, 2020\n Cops didn’t like me filming the burning car so they came at me with batons. Hitting my bike.  Ahhm herea the audio  pic.twitter.com/tfaOoVCw5v\n— John Cusack (@johncusack)  May 31, 2020\n She says she was walking home with her groceries when police fired some sort of pellet in her face. Says she’s not a protester.  #DallasProtests  pic.twitter.com/2IyO1S9j6n\n— Kevin Krause (@KevinRKrause)  May 31, 2020\n   MSNBC reporters were just almost hit with some sort of explosive device by law enforcement officers in Minneapolis  pic.twitter.com/Cy4ayEm5TE\n— Aaron Rupar (@atrupar)  May 31, 2020\n Share widely: National guard and MPD sweeping our residential street. Shooting paint canisters at us on our own front porch. Yelling “light em up”  #JusticeForGeorgeFloyd  #JusticeForGeorge  #BlackLivesMatter  pic.twitter.com/bW48imyt55\n— Tanya Kerssen (@tkerssen)  May 31, 2020\n Police exercise increased force as tasers are used to pull two people from a vehicle in downtown Atlanta. https://t.co/dSjEgItPcy\n— CBS46 (@cbs46)  May 31, 2020\n Police just raided the gas station we were sheltering at. After shouting press multiple times and raising my press card in the air, I was thrown to the ground. Then another cop came up and peppered sprayed me in the face while I was being held down.  pic.twitter.com/23EkZIMAFC\n— Michael Anthony Adams (@MichaelAdams317)  May 31, 2020\n  my older brother went to a protest in Denver last night. as the police were leaving, one of them shot him with a pepper pellet that smashed the back of his phone and exploded in his face. they were ~30 feet from each other and it looks like the officer aimed directly at his face  pic.twitter.com/m9vxaSQbwI\n— Rachelle D&#39;nae (@heyydnae)  May 31, 2020\n We are home and we are safe. But my children were pepper sprayed tonight whole peacefully protesting. I was there. I saw it. The violence and brutality the NYPD unleashed on protesters was staggering. So much rage targeted toward the very people they are sworn to protect.  pic.twitter.com/XnJHT0jIls\n— Dianne Morales (@Dianne4NYC)  May 30, 2020", "posttime": "2020-06-01 01:50:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "捕捉到,camera,警察", "title": "镜头捕捉到，美国各地的警察在愤怒和暴力中爆炸", "title_en": "Caught on camera, police explode in rage and violence across the US", "transed": 1, "url": "https://www.theverge.com/2020/5/31/21276044/police-violence-protest-george-floyd", "via": "", "real_tags": ["捕捉到", "camera", "警察"]}]