[{"category": "", "categoryclass": "", "imagename": "cb461faf3aeabbedba22006a918b12b3.jpg", "infoid": 1012998, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Gyant的人工智能健康平台旨在推动患者与医生的互动，该公司今天完成了一轮1360万美元的融资。该公司表示，这笔资金将支持其正在进行的产品开发、运营和互操作性努力。\n随着冠状病毒大流行的肆虐，对分类技术(如对话机器人)的需求大幅上升，这并不令人惊讶。根据美国疾病控制和预防中心(CDC)发布的一项研究，数百万患者至少等待两个小时才能看到医疗保健提供者。作为回应，IBM、Facebook和微软等科技巨头已经与政府和私营行业合作，推出基于聊天机器人的解决方案，一些初创公司也是如此。\nGyant拥有24家客户(一年前为3家)，其中包括InterMountain Healthcare和Geisinger，该公司与医院和提供商合作，改善工作流，降低成本。这家初创公司的可定制、支持人工智能的导航和症状检查工具-前门-可以添加到任何网站或门户，并与医疗记录系统捆绑在一起。它将患者引导到配备有医疗专业人员的医疗工具和聊天室。这是对Gyant的虚拟“候诊室”产品Gyant Clipboard的补充，Gyant Clipboard捕获患者信息，并通过自然语言处理进行入职处理，以自动填充病历。\nGyant通过移动应用程序发送通知和短信，让患者参与到个别围手术期方案和出院后治疗计划中。在加利福尼亚州，有没有医疗保险的用户都可以接触有执照的医生，这些医生会打电话给当地的药店开处方。在签约并回答了三到四个关于他们的症状或健康问题的问题后，患者会与临床医生聊天，并收到诊断和治疗计划。\n翼风险投资公司领导了A系列投资，山间风险投资公司和现有投资者Grazia Equity、Alpana Ventures、Techstar Ventures和Plug and Play Ventures也加入了投资行列。\n总部位于旧金山的Gyant在98point6、CirrusMD、Heal、Pager、krY、HealthTap、RubiconMD、SnapMD、Mfine、K Health、Doctor on Demand以及数十多家远程医疗提供商方面存在竞争。全球远程医疗市场-其中包括促进远程医疗诊断和治疗的技术-预计将从目前的383亿美元攀升至2025年的1305亿美元。考虑到贝克医院评论最近的一项调查发现，超过67%的美国人认为远程医疗比面对面就诊更好，这个估计可能并不高估。\n由于预计远程患者将激增，2万亿美元的美国CARE法案试图免除一些围绕远程医疗的财务和医疗保险困难。例如，医疗保险和医疗补助服务中心(Center For Medicare And Medicaid Services)表示，将暂时向临床医生支付费用，让他们为居住在全国各地的受益人提供服务，联邦通信委员会(FCC)公布了一项2亿美元的计划，通过购买必要的服务和设备来促进远程医疗服务。", "note_en": "Gyant, whose AI-enabled health platform is designed to drive patient-doctor engagement, today closed a $13.6 million round. The company says the funding will support its ongoing product development, operational, and interoperability efforts.\n The demand for triaging technologies, like conversational bots, has risen substantially as the coronavirus pandemic rages on, which isn’t surprising. Millions of patients wait at least two hours to see a health care provider,  according to a study published by the U.S. Centers for Disease Control and Prevention (CDC). In response, tech giants like IBM, Facebook, and Microsoft have partnered with governments and private industry to roll out chatbot-based solutions, as have a  number of startups.\n  Gyant, which has 24 customers (up from three a year ago) including Intermountain Healthcare and Geisinger, works with hospitals and providers to improve workflows and reduce costs. The startup’s customizable, AI-enabled navigation and symptom-checking tool — Front Door — can be added to any website or portal and ties in with medical record systems. It guides patients to health tools and chatrooms staffed with medical professionals. This complements Gyant’s virtual “waiting room” product — Gyant Clipboard — which captures patient information and handles onboarding with natural language processing to automatically populate medical charts.\n  Gyant delivers notifications and text messages via a mobile app to keep patients engaged with individual perioperative protocols and post-discharge treatment plans. In California, users with and without health insurance can access licensed doctors, who call in prescriptions to local pharmacies. After signing up and answering three to four questions about their symptoms or health issues, patients chat with a clinician and receive a diagnosis and treatment plan.\n Wing Venture Capital led the series A investment and was joined by Intermountain Ventures and existing investors Grazia Equity, Alpana Ventures, Techstars Ventures, and Plug and Play Ventures.\n San Francisco-based Gyant has competition in  98point6,  CirrusMD, Heal,  Pager, Kry,  HealthTap, RubiconMD, SnapMD,  Mfine,  K Health,  Doctor on Demand, and dozens more telemedical providers. The global telemedical market — which encompasses tech that facilitates remote medical diagnosis and treatment — is  anticipated to climb from its current $38.3 billion valuation to $130.5 billion by 2025. That’s likely not an overestimate, given that a recent  survey by Becker Hospital Review found over 67% of people in the U.S. believe telemedicine is better than in-person visits.\n In anticipation of a surge in remote patients, the $2 trillion U.S. CARES Act sought to waive some of the financial and health care coverage difficulties around telehealth. For instance, the Centers for Medicare and Medicaid Services said it would temporarily pay clinicians to provide services for beneficiaries residing across the country, and the Federal Communications Commission (FCC) unveiled a $200 million plan to boost telehealth services by purchasing the necessary services and equipment.", "posttime": "2020-07-20 18:00:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,检查,providers,医疗", "title": "Gyant为医院和医疗保健提供商提供启用人工智能的远程医患互动和症状检查工具，A系列融资1360万美元", "title_en": "Gyant, which provides AI-enabled remote patient-doctor engagement and symptom checking tools for hospitals and healthcare providers, raises $13.6M Series A", "transed": 1, "url": "https://venturebeat.com/2020/07/15/gyant-raises-13-6-million-for-its-ai-telehealth-platform/", "via": "", "real_tags": ["人工智能", "检查", "providers", "医疗"]}, {"category": "", "categoryclass": "", "imagename": "26764d579aab7703bdcd9241ae02c524.png", "infoid": 1012997, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "将在医疗保健和医疗领域建立一份令人惊叹的开源软件、图书馆、工具和资源的精选清单。必须对每个链接进行审查，以确保项目处于活动状态，并为用户、提供商、政策专家、开发人员和/或研究科学家提供价值。", "note_en": "Will be setting up a Curated list of amazing open-source software, libraries, tools, resources in the healthcare and medical space. Each link must be vetted to ensure the projects is active and provides value to users, providers, policy experts, developers and/or research scientists.", "posttime": "2020-07-20 17:42:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,精选,list,医疗", "title": "医疗保健中的开源库和工具的精选列表", "title_en": "Curated list of open source libraries and tools in healthcare", "transed": 1, "url": "https://gitter.im/amazing-healthcare/community", "via": "", "real_tags": ["开源", "精选", "list", "医疗"]}, {"category": "", "categoryclass": "", "imagename": "b805a578c069ca7982bd4ddafc4a1f84.png", "infoid": 1012996, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这很难夸大；它比微软已经很大的17B参数Turing-NLG大了整整一个数量级。[1]在FP16中加载整个模型的权重将占用绝对荒谬的300 GB的VRAM，甚至不包括渐变。但是，庞大的规模带来了强大的泛化能力：GPT-3在许多基准测试中具有竞争力，甚至不需要对目标任务进行调优。当我说很多的时候，我指的是很多-这篇72页的完整论文包含了对GPT-3在许多NLP数据集上的广泛评估。然而，也许最令人印象深刻的部分是，即使是在如此大规模的情况下，该模型在性能上仍然可以平稳地扩展，而不是停滞不前，这意味着更大的模型会表现得更好。在这篇文章的其余部分，我的目标是将这篇巨大的论文(以多种方式)提炼成可消化的大小，并阐明它为什么重要。\n下表总结了过去几年中一些最大的自回归变压器模型。我已经排除了像XLNet和BERT衍生品这样的模型，因为它们没有相同的单向自回归训练目标。\n虽然GPT-3没有那么深，但它的宽度几乎是Turing-NLG的3倍，因为参数计数与隐藏大小的平方大致成正比，它解释了大多数额外参数的来源。它的上下文大小也翻了一番，达到2048个令牌，这令人印象深刻(而且内存昂贵！)，尽管不是所有型号中最大的上下文大小；有些型号的上下文甚至更长，比如Transformer-XL，它通过在段之间传递上下文向量来合并更长的上下文，还有Reformer，它使用位置敏感的散列来实现稀疏关注。同样，GPT-3在每隔一层使用稀疏的关注层，尽管具体细节有些含糊。有趣的是，为与GPT-2进行比较而训练的较小的GPT-3版本略浅、略宽，GPT-3-XL只有24层，但隐藏的大小是2048。[2]GPT-3还重用了GPT-2的BPE标记化。总体而言，GPT-3本质上只是GPT-2的一个彻头彻尾的巨型版本。\n培训数据是Common Crawl、WebText2(原始数据的更大版本，还包括2018年1月至10月期间采样的链接)、两本书语料库和英语维基百科的重新加权组合。其中一些组件，如维基百科，在培训期间被查看超过3次；其他组件，如庞大的Common Crawl组件，其数据被查看的次数不到一半。作者声称，这是为了通过对已知良好的数据集进行优先排序来帮助提高语料库的整体质量。此外，与原来的WebText相比，这个新的语料库没有按语言过滤，但仅仅因为英语的流行，英语仍然占数据集的93%。经过过滤和清理后，数据集总共是5000亿令牌，或700 GB[3]。本文还详细描述了数据集的过滤过程，这是GPT-2论文没有做的。\n作者还试图删除与评估的训练集和测试集重叠的任何数据。不幸的是，由于一个错误，一些被遗漏了，所以为了补偿，论文提供了一个相当好的分析这种泄漏的影响。\nGPT-3的评估部分非常全面，在Zero-shot(生成上下文中仅给出自然语言描述)、One-shot(生成上下文中的单个示例)或Null-shot(生成上下文中的少数几个示例)设置下对大量NLP任务进行评估。事实上，这篇论文甚至没有尝试对目标任务进行微调，而是将其留给未来的工作。[4]然而，一个关键的结论是，在几乎所有的测试中，更大的模型的性能继续提高，即使是在4个完整的数量级上，而微调只在一项任务上有所改善，并面临灾难性的遗忘和过度匹配的风险。\n在不做太多单独测试的情况下，总体结果是：在大多数任务上，GPT-3的性能明显逊于微调SOTA(例如，Superglue、CoQA、Winograd等)，但在其他一些任务(即PhysicalQA、Lambada、Penn Tree Bank)上优于微调SOTA。GPT-3在PTB上的表现尤其出色，将SOTA困惑从35.76降至20.5-这是一个巨大的进步。GPT-3最终还可以进行算术运算，这是GPT-2做不好的。\n令人印象深刻，或许有些令人担忧的是，人们无法区分GPT-3产生的新闻故事和真实的新闻故事，这只会加剧GPT-2已经提出的伦理问题。本文对GPT-2的发布结果进行了分析，认为GPT-2的发布并没有导致LMS的广泛使用，因为无论是在中低技能的对手中，还是在高级人员中，由于难以控制输出和输出质量的差异，LMS都没有导致错误信息的广泛使用，因此GPT-2的发布并没有导致LMS在错误信息方面的广泛使用\n作者还调查了GPT-3中的性别偏见，表明GPT-3是男性倾向的；然而，作者声称，Wingender数据集(测试同一句子但具有不同性别代词的共指分辨率)上的一些初步证据似乎表明，较大的模型对偏见问题更稳健。种族和宗教也出现了类似的问题，人们对同时使用的术语的看法随着种族的不同而有很大不同。作者声称，这个问题在较大的模型中也变得更好-尽管，如果没有适当的假设检验，很难在这里得出任何可靠的结论。\n但是，如果GPT-3甚至不能在所有基准中击败SOTA，那么它为什么重要呢？我们为什么要关心一个如此庞大的模型，以至于一个小的计算集群即使只是为了以合理的速度运行推理也是必要的呢？\n关于GPT-3的一件事是，它在从未见过的任务上做得相当好。此外，GPT-3并没有达到收益递减点，而是显示较大型号表现更好的趋势至少持续了另一个数量级，没有停止的迹象。尽管GPT-3很笨拙，即使它仍然没有完全达到人类水平的全面性能，但GPT-3表明，模型有一天在NLP中达到人类水平的泛化是可能的-一旦不可能成为可能，它变得实用只是个时间问题。\n早在去年年底，当我谈到大型Transformer语言模型(如GPT-2、CTRL和Megatron-LM)时，我简要地谈到了语言模型变得越来越大的趋势，并讨论了一些简单的计算可能无法解决的问题。我的普遍预期是，模型大小的军备竞赛很快就会暂时停滞，焦点将转移到更好的文本生成解码策略上(可能是通过基于RL的方法)。我肯定没有想到OpenAI会这么快带着这么庞大的模型回来。\n这是如此令人惊讶，以至于我放下一切去看报纸，开始写这篇文章，包括我已经写了几个月的一篇更注重理论的文章。当我从GPT-3休克中恢复过来后，它可能会完成。敬请关注！↩︎。\n这样做很可能是为了更容易的模型并行性-更大的矩阵乘法比像GPipe那样按顺序应用的层更容易并行化。\n不过，这也可能有其他优势。在EfficientNet问世后，我独立地对Transformer模型进行了一些相同概念的实验，结果是在相同的计算量下，更广泛的模型比更深的模型有相当大的优势-这证实了这里选择使用更广泛的模型。↩︎。\n这个数字是从文中给出的公共爬行集的大小推断出来的。↩︎\n有人猜测，这篇论文中缺乏微调的例子。一个原因可能是，对于如此大的模型，微调范例由于容易过度拟合而开始崩溃，尽管无法访问模型(以及硬件对其进行调优！)。除了推测之外，我们没什么可做的了。↩︎", "note_en": "is hard to overstate; it’s an entire  order of magnitude larger than Microsoft’s  already-massive 17B parameter Turing-NLG.  [1] Loading the entire model’s weights in fp16 would take up an absolutely preposterous 300GB of VRAM, not even including the gradients. But, with massive size comes massive generalization ability: GPT-3 is competitive in many benchmarks  without even tuning on the target task. And when I say many, I mean  many—the full, 72-page paper contains an extensive evaluation of GPT-3 on many NLP datasets. Perhaps the most impressive part, though, is that even at such a massive scale, the model still scales smoothly in performance instead of plateauing, implying that still-larger models would perform  even better. Throughout the rest of this post, my goal is to distill this massive (in multiple ways) paper down to a digestible size, and shed some light on why it matters.\n  The following table summarizes some of the largest autoregressive Transformer models of the past few years. I’ve excluded models like  XLNet and BERT-derivatives because they don’t have the same unidirectional autoregressive training target.\n  While GPT-3 isn’t that much deeper, its width is nearly  3x that of  Turing-NLG, which—since parameter count scales approximately proportional to the square of the hidden size—explains where most of the extra parameters come from. It also has double the context size, at 2048 tokens, which is impressive (and memory-expensive!), though not the biggest context size across all models; some models have even longer contexts, like  Transformer-XL, which incorporates longer contexts by passing context vectors between segments, and  Reformer, which uses locality-sensitive hashing to enable sparser attention. Similarly, GPT-3 uses  sparse attention layers in every other layer, though the exact details are left somewhat ambiguous. It’s also interesting to note that the smaller GPT-3 versions trained for comparison with GPT-2 are slightly shallower and wider, with GPT-3-XL having only 24 layers but a hidden size of 2048.  [2] GPT-3 also reuses the BPE tokenization of GPT-2. Overall, GPT-3 is essentially just a downright massive version of GPT-2.\n   The training data is a reweighted mix of Common Crawl, WebText2 (a larger version of the original that  also includes links sampled in the period of Jan-Oct 2018), two book corpora, and English Wikipedia. Some of these components, such as Wikipedia, were seen more than 3 times during training; others, like the massive Common Crawl component, had less than half of their data seen. The authors claim that this is to help raise the overall quality of the corpus by prioritising known-good datasets. Also, in contrast to the original WebText, this new corpus is not filtered by language, but English still constitutes 93% of the dataset by words simply due to its prevalence. Altogether, the dataset is 500 billion tokens, or 700GB  [3], after filtering and cleaning. The paper also provides a detailed description of the filtering process of the dataset, which the GPT-2 paper didn’t.\n The authors also attempted to remove any data that overlapped with the train and test sets of the evaluations. Unfortunately, due to a bug, some were missed, so to compensate the paper provides a fairly good analysis of the impact of this leakage.\n   The Evaluation section of GPT-3 is very comprehensive, evaluating on a massive battery of NLP tasks in the Zero-shot (given only a natural language description in the generation context), One-shot (a single example in the generation context), or Few-shot (a small handful of examples in the generation context) settings. In fact, the paper doesn’t even attempt to fine-tune on the target task, leaving that to future work.  [4] However, one crucial conclusion is that in almost all tests, performance continues to get better with larger models, even across 4 entire orders of magnitude, whereas fine-tuning only improves on one task and  risks catastrophic forgetting and overfitting.\n Without going too much into the individual tests, the general result is this: on most tasks, GPT-3 achieves performance significantly worse than fine-tuned SOTA (i.e SuperGLUE, CoQA, Winograd, to name a few), but beating fine-tuned SOTA for some other tasks (i.e PhysicalQA, LAMBADA, Penn Tree Bank). GPT-3 does particularly well on PTB in particular, taking the SOTA perplexity from 35.76 down to 20.5—a massive improvement. GPT-3 can also finally do arithmetic, something GPT-2 was unable to do well.\n  Impressively, and perhaps somewhat alarmingly, people are unable to distinguish GPT-3 generated news stories from real ones, only exacerbating the ethical concerns already raised by GPT-2. The paper analyzes the result of the release of GPT-2, and concludes that the release of GPT-2 has not led to widespread use of LMs for misinformation due to the difficulty of controlling output and variance in output quality, both among low-to-mid skill adversaries and “advanced persistent threats”—adversaries with “high skill and long-term agendas”—such as state actors. However, the paper also acknowledges that with further development, LMs will eventually become advanced enough for these adversaries.\n The authors also investigate gender bias in GPT-3, showing that GPT-3 is male leaning; however, the authors claim that some preliminary evidence on the Winogender dataset (which tests coreference resolution on the same sentence but with different gendered pronoun) seems to suggest that larger models are more robust to bias issues. Similar issues appeared for race and religion, with the sentiment of coöccurrent terms varying significantly with race. The authors claim that this issue also got better with the larger models—although, without proper hypothesis testing, it’s difficult to draw any solid conclusions here.\n   But why does GPT-3 matter, if it can’t even beat SOTA across all benchmarks? Why should we care about a model so large that a small computing cluster is necessary even just to run inference at a reasonable speed?\n One thing about GPT-3 is that it’s doing reasonably well on tasks it has  never even seen. Additionally, instead of reaching a point of diminishing returns, GPT-3 shows that the trend of larger models performing better continues for at least another order of magnitude, with no signs of stopping. Even though GPT-3 is unwieldy, and even though it still doesn’t quite reach human level performance across the board, GPT-3 shows that it’s  possible for a model to someday reach human levels of generalization in NLP—and once the impossible becomes possible, it’s only a matter of time until it becomes practical.\n  Back when I talked about  large Transformer language models like GPT-2, CTRL, and Megatron-LM late last year, I touched briefly on the trend of Language Models getting bigger, and covered some of the issues that simply more compute might not fix. My general anticipation was that the model size arms race would soon be at a temporary standstill, with focus being diverted to better decoding strategies for text generation (perhaps via RL-based methods). I most certainly had not expected that OpenAI would be back at it so soon with such a massive model.\n This was such a surprise that I dropped everything to read the paper and work on this post, including a more theory-oriented post that I’ve been working on for a few months now. It will probably be finished  , after I recover from GPT-3 shock. Stay tuned!  ↩︎\n It’s likely that this was done for easier model parallelism—bigger matrix multiplications are much easier to parallelize than sequentially-applied layers à la  GPipe.\n This could have other advantages too, though. After  EfficientNet came out, I independently ran some experiments of the same concepts to Transformer models, and the result was that for the same amount of compute, wider models had a sizeable advantage over deeper ones—which corroborates the choice here to go with wider models.  ↩︎\n This figure is extrapolated from the size of the Common Crawl set, which is given in the paper.  ↩︎\n There has been some speculation over the lack of fine-tuning examples in this paper. One reason could be that with a model this big, the fine tuning paradigm starts to break down due to the ease of overfitting, though without access to the model (and hardware to tune it!) there’s not much more than speculate that we can do.  ↩︎", "posttime": "2020-07-20 17:03:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "gpt", "title": "为什么GPT-3很重要", "title_en": "Why GPT-3 Matters", "transed": 1, "url": "https://leogao.dev/2020/05/29/GPT-3-A-Brief-Summary/", "via": "", "real_tags": ["gpt"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012995, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这些都是人工智能生成的推文，使用的是OpenAI的GPT-3模型，该模型仍处于测试版。在社交媒体上分享产出之前，请行使合理的酌处权。", "note_en": "These are AI generated tweets using OpenAI&#39;s GPT-3 model, which is still in its beta version. Please exercise reasonable discretion before sharing outputs in social media.", "posttime": "2020-07-20 17:03:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "gpt,openai,行使", "title": "OpenAI的GPT-3演示如何在给定单词的情况下生成推文", "title_en": "Demo of OpenAI's GPT-3 generating tweets given a word", "transed": 1, "url": "https://thoughts.sushant-kumar.com/hong%20kong", "via": "", "real_tags": ["gpt", "openai", "行使"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012994, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "别担心！我们意识到扫描重复种子的工作单元太多了，所以我们已经将原始工作单元缩减到正确的种子范围(没有触及正在进行的结果，所以你们都不应该失去任何积分)。我们已经找到了一些在处理过程中遗漏的有希望的种子候选者，可以用作此作业的输入，因此他们当前被设置为最高优先级。还有，我们现在有徽章了！如果您查看论坛、帖子中的任何评论或排行榜上的任何评论，您将看到新的徽章。我们对未来徽章的建议持开放态度，因此请在此帖子上给我们留下一些评论。个人资料创建和OpenCL供应商锁定在上一篇新闻帖子中，我建议每个人创建个人资料，以便有资格获得当天的用户选择。不幸的是，ReCaptcha实现有一个问题阻止了这一点。此问题现在已解决。现在，您可以在此处创建配置文件。此外，对于拥有来自多个供应商(例如，Intel IGPU和Nvidia GPU)支持OpenCL的硬件的主机来说，kaktwoos应用程序的最新更新应该可以确保任务在正确的设备上运行。如果您是使用多供应商主机的用户，请密切关注您的结果，并让我们知道您是否有任何问题。请一如既往地参与留言板上的对话，加入不和谐的行列！多GPU、检查点和另一个破纪录的仙人掌(22个街区高)终于，对多GPU和检查点的支持落地了。·如果您有多个GPU，研究应用程序现在将利用所有可用的GPU。·我们现在支持英特尔GPU。·如果工作暂停，或您的机器断电，检查点现在将确保工作不会从头开始。·你还会注意到，工作量估算要准确得多。·您无需执行任何操作即可启用这些功能。·我们还在采取措施，提高计算错误后添加到工作单位的附加结果的优先级。这是为了加快未完成工作单元的验证速度。\n感谢Hypprs、Nicoboss、duChen18、BalintCsala以及其他参与测试和更新该应用程序的人员。“我的世界@家”在一周内第三次打破了正常地形下仙人掌的最高高度记录。我现在呈现的是一个22街区高的仙人掌：1.14.4World Seed：11343195073417814，坐标：14955936 64-3750655。祝贺志愿者SirNapkin1334，你们的主人负责找到这个！请注意，现在已启用用户配置文件，请确保您创建了用户配置文件。这将确保您可以被选为主页上显示的当天的&#39；用户。请在我们的留言板上发布任何问题。或者，要进行实时讨论，请加入我们的不和谐。..。更多", "note_en": "Worry not! We realised there were far too many workunits scanning duplicate seeds, so we&#39;ve scaled back the original workunits to the correct seed ranges   (no in-progress results were touched, so none of you should have lost any credit).   \rWe have located some promising seed candidates which were missed from processing and can be used as an input to this job, so they are currently set as the highest priority.   \rAlso,   we now have badges! If you view the forums, any comments in threads, or on the leaderboards; you will see the new badges. \rWe&#39;re open to suggestions for future badges, so please leave us some comments on this thread.          Profile creation and OpenCL vendor pinning  In the last news post, I advised everyone to create a profile in order to be eligible for &#39;user of the day&#39; selection. Unfortunately, there was an issue with the ReCaptcha implementation which prevented this. This issue is now resolved. Now, you are able to  create a profile here.   \rAlso, good news for hosts with OpenCL capable hardware from more than one vendor  (e.g. an Intel iGPU and an Nvidia GPU) \rThe latest update to the kaktwoos app should ensure the tasks run on the correct device. \rIf you are a user with a multi-vendor host, please keep an eye on your results and let us know if you&#39;re having any issues.   \rAs always, please get involved with the conversation in the  message boards, and  join the Discord!          MultiGPU, checkpointing, and another record breaking cactus (22 blocks tall)    Finally, support for multiple GPUs and checkpointing has landed. • If you have multiple GPUs, the research apps will now make use of all available GPUs. • We now support Intel GPUs. \r• If work is suspended, or your machine is powered off, checkpoints will now ensure work does not start from the beginning. \r• You will also notice work estimates are far more accurate. \r• You do not need to take any actions to enable these features. \r• We are also taking steps to increase the priority of additional results added to workunits after computation errors. This in order to speed up validation of incomplete workunits.\n \rThank you to Hypprs, nicoboss, DutChen18, BalintCsala, and anyone else who was involved in testing and updating the app.   \rFor the third time in 1 week, Minecraft@Home has broken the tallest cactus height record in normal terrain generation. \rI present, a  22 block tall cactus:            1.14.4 world seed: 11343195073417814, co-ordinates: 14955936 64 -3750655.     Congratulations to volunteer   SirNapkin1334, your host was responsible for locating this one!   \rWhile I have your attention, user profiles are now enabled, please ensure you  create a user profile. \rThis will ensure you can be selected for  &#39;user of the day&#39; which is displayed on the homepage.   \rPlease post any issues on our  message boards. Alternatively, for real-time discussion,  join our Discord.          ... more", "posttime": "2020-07-20 17:03:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "世界,minecraft", "title": "我的世界@家", "title_en": "Minecraft@Home", "transed": 1, "url": "https://minecraftathome.com/minecrafthome/", "via": "", "real_tags": ["世界", "minecraft"]}, {"category": "", "categoryclass": "", "imagename": "d3bc05171e4530501c48e9973945ba07.jpg", "infoid": 1012993, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“华尔街日报”(Wall Street Journal)在2月份首次报道称，eBay正计划出售其分类广告业务，当时公布的潜在买家包括私募股权公司TPG和黑石集团(Blackstone Group)、Naspers和德国出版商Axel Springer SE。\n最近，由Naspers控股的总部位于阿姆斯特丹的投资公司Prosus NV成为了竞争者，但彭博社(Bloomberg)上周末报道称，谈判遭遇挫折，因为eBay希望在出售分类广告业务后保持其股份。\n维权股东埃利奥特管理公司(Elliot Management)和Starboard Value LP推动eBay出售非核心业务部门，以专注于其市场，导致去年以超过40亿美元的价格将StubHub出售给Viagogo，并任命了一位新的首席执行官。\nEBay的分类广告部门大多在美国以外运营，包括加拿大、欧洲、非洲、澳大利亚和墨西哥。如果Adevinta最终收购了它，它可以扩大其P2P电子商务平台的国际投资组合。\nAdevinta的一名代表告诉TechCrunch，该公司对报道的谈判不予置评。TechCrunch也与eBay进行了接触。\nEBay在4月份发布的上一份季度收益报告中表示，它正在“解释”其分类广告业务的潜在价值创造选择，正在与多方积极讨论，预计将在今年年中公布最新情况。\n今年第一季度，eBay的主要市场业务产生了21亿美元的收入，下降了，而分类广告业务的收入为2.48亿美元。2019年，分类广告业务的收入为11亿美元，而eBay Marketplace的收入为76亿美元，eBay Marketplace正在经受住来自亚马逊(Amazon)等规模更大的在线竞争对手的竞争。", "note_en": "The Wall Street Journal first  reported in February that eBay was planning to sell off its classifieds business, with prospective buyers named at that time including private equity firms TPG and Blackstone Group, Naspers, and German publisher Axel Springer SE.\n More recently, Prosus NV, an Amsterdam-based investment firm that is controlled by Naspers, emerged as a contender, but  Bloomberg reported over the weekend that negotiations hit a bump because eBay wants to maintain a stake in the classifieds business after selling it.\n  Activist shareholders Elliot Management and Starboard Value LP have pushed  eBay   to sell off non-core business units to focus on its marketplace, resulting in the  sale of StubHub to viagogo for more than $4 billion last year and the  appointment of a new chief executive officer.\n Ebay’s classifieds division operates mostly outside of the United States, including in Canada, Europe, Africa, Australia and Mexico. If  Adevinta   ends up acquiring it, it can expand its international portfolio of peer-to-peer e-commerce platforms.\n An Adevinta representative told TechCrunch the company had no comment on the reported negotiations. TechCrunch has also reached out to eBay.\n Ebay said in its last quarterly earnings report, issued in April, that it was “explor[ing] potential value-creating alternatives for its Classifieds business, is holding active discussions with multiple parties and anticipates having an update by the middle of the year.”\n During the first quarter of this year, eBay’s main marketplace business generated $2.1 billion in revenue, down, while its classifieds business saw $248 million in revenue. In 2019, the classifieds business made $1.1 billion in revenue, versus $7.6 billion for eBay Marketplace, which is weathering competition from larger online rivals like Amazon.", "posttime": "2020-07-20 16:36:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,部门,reportedly,ebay", "title": "\n据报道，eBay即将将其分类广告部门出售给Adevinta", "title_en": "\n\t\t\t\teBay reportedly getting close to selling its classified-ads unit to Adevinta\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/20/ebay-reportedly-getting-close-to-selling-its-classified-ads-unit-to-adevinta/", "via": "", "real_tags": ["广告", "部门", "ebay"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012992, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "第一级，只有国家和像谷歌和微软这样的大公司才应该被允许复制我们的工作。不应该把这种权力托付给普通人。\n-OpenAI-我们正在拯救世界，不让小公司利用人工智能来欺负你。\n级别1这是OpenAI一直以来的运作方式。围绕他们的名字和政策的认知不和谐令人印象深刻。如此多的项目和令人印象深刻的结果没有得到代码的支持。\n编辑：也许在GPT-2的情况下，代码太笼统了(尽管对于过去的许多项目，这肯定适用)。语言可能/应该是……没有复制其结果所需的材料支持。\n级别2不幸的是，这适用于许多论文，而不仅仅是OpenAI。DeepMind不会大量发布他们的代码，因为其中嵌入了他们的IP(近似的重新措辞，记不住确切的单词)。\n级别1没有那么重要。它可以而且将会被复制。几年后，我们将拥有可能比这更好的开源模型。\n第一级，我不认为他们真的明确表示他们的开放代表共享一切--我认为称之为OpenAI只是听起来比NonForProfitAI更好，而且正在从开放源码文化的炒作浪潮中获利。但是，是的，在开源文化的背景下，提到带有开放前缀的工具，例如OpenBLAS，它肯定是有误导性的。\n我们在顶级机器学习会议上发表文章，这是用于加速人工智能研究的开源软件工具，并发布博客文章来交流我们的研究。我们不会为了私人利益而将信息保密，但从长远来看，我们希望在存在安全问题时建立正式的程序，使技术保密。\n当存在安全问题时，我们希望建立正式的流程来保护技术的私密性。&#34；我们希望创建正式的流程，以便在存在安全问题时保持技术的私密性。\n级别2即使对于OpenAI已经开源的项目，他们也不是很好的开源管理人员。\n大家好！我们想让你知道，为什么我们已经有一段时间没有把变化引入这个回收库了：我们正在研究机器人学校2，这是一个具有不同优先级的新代码库，我们希望它能进一步加速机器人研究。我们继续推荐使用Roboschool1Hopper、蚂蚁、人形和Flagrun来评估和测试算法。如果您有使安装更容易的修复程序，我们将很乐意将其合并。稍后我们将会有更多关于机器人学校的信息与大家分享。\n我找不到一个开源项目，他们在超过一个月的时间里不断更新和添加新功能。\n如果他们没有宣称自己是开放人工智能的冠军，那就好了。如果他们给自己的公司命名为ResearchAI&34；或pineappleAI&34；或其他任何名称，都不会让人觉得虚伪。\n第二级我认为有相当多的误解。我认为有一群人认为这一切都是关于开源和发布开放工具。还有另外一群人，我想很多人不再这么想了，但他们一度认为这是在没有任何安全预防措施的情况下制作AGI，只是给每个人发一份副本，这样就能以某种方式解决安全问题。这是在我加入OpenAI之前很久就存在的两个早期误解。我的理解是，它的意思是表明OpenAI希望AI技术的好处得到广泛传播。\n级别1对纯粹的喜剧价值给予了高度评价。我认为OpenAI Move工作得足够好，足以引发讨论，这是他们的目标。\n第二级，现在更多的人想要实施它。很好地演示了史翠珊效应。\n第一级，他们确实发布了代码，所以可能他们并没有完全关闭。他们发布了这个模型，但却认为那些能够造成真正危害的人(国家行为者)没有资源来复制，这实在是太愚蠢了。他们已经造成了破坏。不妨公布剩下的细节，这样人们就可以看看它们是否有特定的弱点(比如是否可以训练另一个模型，看看它是生成的还是与事实相反的)。\n其他含义是，如果人们可以嵌入敌意模式，这将使假新闻分类器错误地将其标记为真新闻。谁知道呢！\n正如戴维·琼斯(Davey Jones)简明扼要地说的那样，它是解决世界上所有问题的通用方案-释放重量！", "note_en": "level 1  Only the state and large corporations like Google and Microsoft should be allowed to replicate our work. The average man should not be trusted with such power.\n - OpenAI - we&#39;re saving the world from small companies using AI to screw you.\n level 1  This is how OpenAI has always operated. The cognitive dissonance around their name and their policies is impressive. So many projects and impressive results not backed up by code.\n Edit: Perhaps &#34;code&#34; was too general in the case of GPT-2 (though for many past projects this certainly applies). Language could/should be &#34;...not backed up by the materials required to reproduce their results.&#34;\n level 2  Unfortunately this is true for a lot of papers, not just OpenAI. Deepmind doesn&#39;t release their code a lot because it has their IP embedded in it (approximate rephrasing, can&#39;t remember the exact words)\n           level 1  It doesn&#39;t matter that much. It can and will be reproduced. In a few years we will have open source models possibly better than this.\n   level 1  I don&#39;t think they ever really specified that their &#34;open&#34; stands for sharing everything -- I think calling it OpenAI just sounds better than NonForProfitAI and is profiting from the hype wave of open source culture. But yeah, in the context of the open source culture and referring to tools with the &#34;open&#34; prefix e.g. OpenBLAS, it is definitely is misleading.\n  We publish at top machine learning conferences, open-source software tools for accelerating AI research, and release blog posts to communicate our research. We will not keep information private for private benefit, but in the long term, we expect to create formal processes for keeping technologies private when there are safety concerns.\n ==&gt; &#34;we expect to create formal processes for keeping technologies private when there are safety concerns.&#34;\n level 2  Even for the the projects OpenAI has open sourced, they haven&#39;t been good open source stewards.\n   Hi everyone! We wanted to let you know why we haven&#39;t pushed changes into this repo for a while: we&#39;re working on roboschool2, a new codebase with different priorities, which we hope will further accelerate robotics research. We continue to recommend the use of roboschool1 Hopper, Ant, Humanoid and Flagrun for evaluation and testing of algorithms. If you have fixes to make installation easier we&#39;ll be happy to merge it. We&#39;ll have more to share about roboschool2 in a while.\n       I can&#39;t find a single open source project that they&#39;ve continually updated and added new features for more than a single month.\n And this would be fine, if they haven&#39;t claimed to be champions of &#34;open AI&#34;. If they named their company &#34;ResearchAI&#34; or &#34;pineappleAI&#34; or anything else, it wouldn&#39;t feel as hypocritical.\n  level 2  I think there’s been fair amount of misunderstanding. I think there’s one group of people who think it’s all about open source, and releasing open tools. There’s another set of people who, I don’t think many people think this anymore but who for a while thought that it was about making an AGI without any safety precautions and just giving a copy to everyone and that this would somehow solve safety problems. These were two early misconceptions that were around long before I joined OpenAI. My understanding is that it’s meant to indicate the idea that OpenAI wants the benefits of AI technology to be widely distributed.\n level 1  Upvoted for the sheer comedy value. I think OpenAI move works well enough to raise the discussion, which is their goal.\n level 2  And now even more people want to implement it. Nice demonstration of the Streisand effect.\n  level 1  They did release the code so maybe they aren&#39;t fully closed. It&#39;s just silly that they&#39;ve released the model but think the people who can do real harm (state actors) don&#39;t have the resources to replicate. They&#39;ve already done the damage. Might as well release the rest of the details so people can look at them and see if they have specific weaknesses (like if it is possible to train another model to see if it was generated or if it opposes facts).\n Other implications are if people can embed adversarial patterns that will make fake news classifiers wrongly flag it as genuine. Who knows!\n As Davey Jones succinctly put it as a universal solution to all the world&#39;s problems - Release the weights!!!", "posttime": "2020-07-20 16:29:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "现在,change", "title": "OpenAI现在应该将其名称更改为ClosedAI", "title_en": "OpenAI should now change their name to ClosedAI", "transed": 1, "url": "https://www.reddit.com/r/MachineLearning/comments/aqwcyx/discussion_openai_should_now_change_their_name_to/", "via": "", "real_tags": ["现在", "change"]}, {"category": "", "categoryclass": "", "imagename": "33bd43654d5c2dd64a12ae05c1db3207.jpg", "infoid": 1012991, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在物理学中，我们通过猜测，然后将猜测的结果与实验结果进行比较，发现了一条新的定律。正如经常被引用的理查德·费曼(Richard Feynman)所说：“你的猜测有多美没有任何区别。你有多聪明没有任何区别，…。如果它与实验不一致，那就错了。“。\n这就是区分物理和数学的本质。数学家也会猜测，他们对真理的最终裁决者是严格的证据。物理学家可能会使用甚至发明复杂的数学工具，但他们的目标不同：解释宇宙的本来面目。为此，实验是必不可少的。\n当然，实验验证可能远远落后于我们的理论推测。科学家们花了100年的时间探测到地球上的引力波，花了50年的时间才发现了希格斯玻色子。两者都需要极大的独创性、技术开发和货币投资。这些实验观察不仅证实了理论预测，也教会了我们一些新的东西，同时也为进一步的研究打开了大门。我们预计天体物理源可以产生可探测到的引力波，但我们不知道这些源有多常见，我们有理由相信希格斯玻色子的存在，但不确定它的质量。\n量子引力的研究是理论走到实验前面的一个极端情况。我们对原子和亚核粒子尺度上的量子物理有了相当满意的理解，但还没有经过实验验证的适用于非常强引力的量子理论。如果没有这样的理论，我们就无法理解大爆炸后早期宇宙中发生了什么，也无法预测一个不幸的宇航员在黑洞内被压缩到难以想象的高密度的确切命运。我们需要实验来指导我们，但令人沮丧的是，它们难以捉摸。\n粒子物理学的历史提供了一个具有启发性的类比。到了20世纪50年代，我们已经有了一个与实验相一致的弱核力理论。但纯粹出于理论上的原因，我们知道它是有缺陷和不完整的；我们甚至可以估计，该理论的预测在非常短的距离尺度上会失败，大约10−18米或更短。最终，强大到足以在这些微小尺度上探索物质的加速器导致了新现象的发现，如W玻色子和Z玻色子以及希格斯粒子，这指向了一个更完整的理论。\n有了引力，我们又有很好的理由相信目前的理论是不完整的，在这里我们也可以估计新现象必须出现的距离尺度：大约10−35米。不幸的是，利用现有技术建造一台能够探测这种尺度的粒子加速器需要一台与银河系差不多大小的机器。显然，即使在遥远的未来，这也是遥不可及的。\n既然用“蛮力”研究量子引力是行不通的，我们必须找到一种更巧妙、更不直接的方法来取得进展。事实上，我们确实有各种关于在实验室中探测量子引力的建议，所有这些都需要实验者做出英勇的-但不一定是徒劳的-努力。我想讨论一种我觉得令人兴奋的特殊方法。\n为了理解它，让我们关注由于量子效应导致的黑洞的形成和最终的蒸发，这是量子引力中研究的典型现象。起初，在实验室进行相关实验似乎是不可能的，更不用说危险了。但也许有办法。\n量子引力的理论研究在同一物理现象的两种不同公式之间建立了惊人的等价性。由于这种等价性，黑洞的生命周期可以用一种完全不涉及重力的完全不同的语言来描述。取而代之的是，“双重”量子系统由许多相互强烈相互作用的粒子组成。当前研究的一个目标是充实词典，将这些语言中的一种翻译成另一种。\n对同一基础物理的两种不同描述的等价性似乎“仅仅”是一种数学观察，但它对实验的影响却是深远的。事实证明，研究黑洞非引力描述所需的实验工具，正是物理学家出于完全不同的原因已经在开发的工具-操作解决非常困难的计算问题的量子设备。这是因为在量子重力和量子计算的模拟中，我们都需要存储一个由许多粒子组成的复杂系统，并精确地控制它们如何相互作用。\n多年来，我一直对量子计算和黑洞都非常感兴趣，所以对我来说，这两者之间的这种联系是令人着迷和满足的。可以肯定的是，量子计算技术还不成熟，所以我们不可能很快在实验室里模拟出逼真的黑洞。没关系-我们将满足于研究简化的模型，这些模型捕捉到了量子引力的一些有趣的特征。即使是这些也可能是有启发性的，随着量子技术的进步，我们将能够进行越来越复杂的实验。\n此外，二元性是一条双行道。量子计算机不仅会教给我们有关量子引力的知识；通过将许多强相互作用粒子的行为与引力现象联系起来，我们可以更好地理解这种行为。通常，如果我们在一个强相互作用的系统中的特定位置印上一些信息，这些信息会迅速传播，很快就会变得非常难以阅读。但我们知道有一些有趣的情况，由于一些不明显的原因，信息最终会重新聚焦，并在遥远的不同位置变得很容易阅读。\n当翻译成双重引力语言时，这个神秘的过程就更容易理解了。在这个框架中，虫洞将空间中两个遥远的点连接起来。当印记信息进入虫洞的一端时，它就消失了，然后当它从另一端出现时，它又重新出现了。物理学家渴望这种对复杂现象的直观解释，而实验学家和理论家的共同努力必然会产生更多类似的见解。\n我们有时担心，随着科学的进步，它会不断分裂成越来越窄的专业，彼此之间的互动越来越少。但根据我自己的经验，我看到了一个更强大的反补贴趋势：随着知识的进步，在不同领域工作的科学家发现，他们有越来越多的东西可以相互学习。在实验室探索量子引力的机会受到高能理论家的猜测的推动，但它也大量借鉴了凝聚态物理学家、原子物理学家和计算机科学家的专业知识。这些令人兴奋和不断加深的联系让我对未来持乐观态度。", "note_en": "In physics, we discover a new law by making a guess, and then comparing the consequences of the guess with experimental results. As the ever-quotable Richard Feynman put it: “It does not make any difference how beautiful your guess is. It does not make any difference how smart you are … if it disagrees with experiment it is wrong.”\n This is the essence of what separates physics from, say, math. Mathematicians make guesses too, and their final arbiter of the truth is rigorous proof. Physicists may use or even invent sophisticated mathematical tools, but theirs is a different objective: to explain the universe as it really is. For that purpose, experiments are indispensable.\n Of course, experimental validation may lag far behind our theoretical speculations. It took 100 years for scientists to detect gravitational waves on Earth, and 50 years to discover the Higgs boson. Both required much ingenuity, technological development and monetary investment. And those experimental observations not only confirmed theoretical predictions, they also taught us something new, while opening the door to further investigation. We expected that astrophysical sources could produce detectable gravitational waves, but we couldn’t know how common those sources would be, and we had reason to believe the Higgs boson existed but were not sure about its mass.\n The study of quantum gravity is an extreme case of theory getting in front of experiment. We have a quite satisfactory understanding of quantum physics at the scale of atoms and subnuclear particles, but no experimentally validated quantum theory that applies to very strong gravitational forces. Without such a theory we cannot understand what happened in the early universe right after the Big Bang, or predict the exact fate of an unfortunate astronaut compressed to unimaginably high density within a black hole. We need experiments to guide us, yet they are depressingly elusive.\n  The history of particle physics provides an instructive parallel. By the 1950s, we had a theory of the weak nuclear force that agreed with experiment. But for purely theoretical reasons, we knew that it was flawed and incomplete; we could even estimate that the theory’s predictions would fail at very short distance scales, around 10 − 18 meters or less. Eventually, accelerators powerful enough to explore matter at these tiny scales led to the discovery of new phenomena, such as the W and Z bosons and the Higgs particle, pointing toward a more complete theory.\n With gravitation, we again have good reason to believe that the current theory is incomplete, and here too we can estimate the distance scale at which new phenomena must appear: about 10 − 35 meters. Unfortunately, building a particle accelerator that could probe that scale using existing technology would require a machine about as big as the Milky Way galaxy. Clearly, that will be far out of reach even in the distant future.\n Since investigating quantum gravity by “brute force” isn’t going to work, we’ll have to find a more ingenious and less direct way to make progress. And we do in fact have various proposals for probing quantum gravity in the lab, all requiring heroic — but not necessarily futile — efforts by experimentalists. I’d like to discuss one particular approach that I find exciting.\n To understand it, let’s focus on the formation and eventual evaporation of a black hole due to quantum effects, the quintessential phenomenon studied in quantum gravity. At first it may seem impossible, not to mention dangerous, to perform related experiments in the lab. But there may be a way.\n Theoretical investigations of quantum gravity have established an astonishing equivalence between two different formulations of the same physical phenomena. Thanks to that equivalence, a black hole’s life cycle can be described in a completely different language that does not involve gravity at all. Instead, the “dual” quantum system consists of many particles strongly interacting with one another. One goal of current research is to flesh out the dictionary that translates one of these languages into the other.\n  This equivalence of two different descriptions of the same underlying physics may seem like a “merely” mathematical observation, but its implications for experiments are profound. It turns out that the experimental tools needed to study the nongravitational description of a black hole are exactly the ones physicists have already been developing for completely different reasons — to operate quantum devices that solve very hard computational problems. That’s because in both a simulation of quantum gravity and a quantum computation, we need to store a complex system of many particles and accurately control how they interact.\n I have been deeply interested in both quantum computing and black holes for many years, so for me this connection between the two is fascinating and satisfying. To be sure,  quantum computing technology is still immature, so we won’t be able to simulate a realistic black hole in the lab anytime soon. That’s OK — we’ll settle for studying simplified models that capture some of the interesting features of quantum gravity. Even these can be instructive, and as quantum technology advances we’ll be able to do increasingly sophisticated experiments.\n Furthermore, duality is a two-way street. Not only will quantum computers teach us about quantum gravity; by relating the behavior of many strongly interacting particles to gravitational phenomena, we can better understand that behavior. Typically, if we imprint some information at a particular location in a strongly interacting system, this information spreads rapidly and soon becomes exceedingly hard to read. But we know of a few intriguing situations where, for reasons that are far from obvious, the information eventually refocuses and becomes easily readable at a different location far away.\n When translated into the dual gravitational language,  this mysterious process is much easier to grasp. In this framework, a wormhole connects two distant points in space. The imprinted information disappears as it enters one end of the wormhole, and then reappears as it emerges from the other. Physicists long for such intuitive explanations of complex phenomena, and the joint efforts of experimentalists and theorists are bound to yield further insights of the same sort.\n  We sometimes worry that as science progresses, it continually splinters into narrower and narrower specialties that interact less and less with one another. But based on my own experience, I see a more powerful countervailing trend: As knowledge advances, scientists working in different fields find that they have more and more to learn from one another. The opportunity to probe quantum gravity in the lab is fueled by the speculations of high-energy theorists, but it also draws heavily from the expertise of condensed matter physicists, atomic physicists and computer scientists. These exciting and deepening connections make me optimistic about the future.", "posttime": "2020-07-20 16:18:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "量子,quantum", "title": "在实验室中发现量子黑洞", "title_en": "Spotting Quantum Black Holes in the Lab", "transed": 1, "url": "https://www.quantamagazine.org/john-preskill-quantum-computing-may-help-us-study-quantum-gravity-20200715/", "via": "", "real_tags": ["量子", "quantum"]}, {"category": "", "categoryclass": "", "imagename": "f3e233d6eb984ed94941fcee2c0f8fbd.png", "infoid": 1012990, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“乔拉姆的小家伙”罗伦战车艾迪质问了塞莉·加思·阿尔达和16只风青蛙。\n阿维拉的来者德鲁西尔·休伯特·刘易斯为费安、崎岖的弗洛里和5条硬鳟鱼欢呼。\n巴恩斯代尔的佩特斯人雅克·布兰特·乔姆怀疑格伦·盖伊·格雷格和12只吵闹的白鼬。\nConst id=需要(&#39；uuid-可读&#39；)控制台。Log(id())//Cathleen d Dieball奥尔德森的巨石反映了Arly Arnie Keenan和18只大型蚂蚁。\nConst id=Required(&#39；uuid-readable&#39；)readable_id：{&#39；type&#39；：string，&#39；default&#39；：id}//或用作真实id_id：{&#39；type&#39；：string，&#39；default&#39；：id}", "note_en": "Loren Chariot Addy the Titbit of Cholame questioned Cele Garth Alda and 16 windy frogs\n Drucill Hubert Lewse the Comer of Avera rejoices Fiann Craggy Florie and 5 hard trouts\n Jacquette Brandtr Johm the Pectus of Barnsdall doubted Glenn Gay Gregg and 12 noisy stoats\n    const  id  =  require ( &#39;uuid-readable&#39; ) console . log (  id ( )  ) // Cathleen d Dieball the Monolith of Alderson reflects Arly Arnie Keenan and 18 large ants\n    const  id  =  require ( &#39;uuid-readable&#39; )readable_id:  {  &#39;type&#39;:  String ,  &#39;default&#39;:  id } // or use as real id_id:  {  &#39;type&#39;:  String ,  &#39;default&#39;:  id }", "posttime": "2020-07-20 16:12:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "易读,easy,id", "title": "生成易记、易读的UUID；莎士比亚风格；语法正确", "title_en": "Generate Easy to Remember, Readable UUIDs; Shakespearean; Grammatically Correct", "transed": 1, "url": "https://github.com/Debdut/uuid-readable", "via": "", "real_tags": ["易读", "easy", "id"]}, {"category": "", "categoryclass": "", "imagename": "00c0a4ba3031169939ad94d225eb3def.jpg", "infoid": 1012989, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌决定禁用Windows10版本2004中的一项功能，该功能允许Chrome和Microsoft Edge浏览器使用更少的RAM。\nWindows 10允许包括Chrome在内的Win32应用程序访问段堆API，以允许应用程序减少内存使用，但正如TechDows发现的那样，Chromium工程师在发现Chrome 85对CPU使用率有负面影响后，目前已决定关闭该功能的默认设置。Chrome 85应该会在8月达到稳定状态。\n微软上个月吹嘘说，在2020年5月的更新中，Edge使用的内存比没有段堆时最多减少了27%。Chrome开发人员在Windows102004及更高版本上对Chrome采用了它。\nCPU问题是由英特尔工程师发现的，他发现当Chrome使用段堆时，会导致在采用英特尔酷睿i9-9900K处理器的PC上进行基准测试时性能显著下降。谷歌发现，根据基准，CPU性能下降了10%到13%。\n微软为内存和CPU之间的权衡进行了辩护，但承认可以更好地实现，以减少对CPU性能的影响。\n用一种资源交换另一种资源是很常见的做法。更常见的情况是，它增加了内存使用量，从而减少了CPU使用量。微软的一名员工写道，在这种情况下，它增加了CPU使用量，从而大幅减少了内存使用量，或者更准确地说，是提交。\n要减少对CPU的影响，需要对整个浏览器代码库进行重大更改，微软的Windows团队正在研究它是否可以提高段堆的性能。\n这位微软员工辩称，短期内，这是一种资源与另一种资源的很好的权衡，因为内存/提交使用是浏览器用户的一个重大痛点。\n然而，Chromium开发人员希望看到更多关于使用段堆的Chrome可能影响的证据。\nChromium会员布鲁斯·道森写道：虽然我从实验室测试中听到了关于节省内存的令人鼓舞的消息，但在20H1有干净的遥测数据和实验室测试之前，我看不到有任何方法可以让这一功能保持不变，而这两种情况都不会及时发生在M85上，Chromium成员布鲁斯·道森(Bruce Dawson)写道。\n因此，计划在M85中禁用此功能(从而为我们提供另一个遥测数据点)，并在将来重新考虑。\nCPU成本(速度计2.0降低了10%，CPU/功耗增加了13%)太高了，我们无法承受。", "note_en": "Google has decided to disable a feature in Windows 10 version 2004 that allowed Chrome and Microsoft Edge browsers to use a lot less RAM.\n Windows 10 gave Win32 apps including Chrome access to a &#39;segment heap&#39; API to allow apps to reduce memory usage, but  as Techdows spotted, Chromium engineers have decided for now to turn off the feature by default in Chrome 85 after discovering it has a negative impact on CPU usage. Chrome 85 should reach stable status in August.\n    Microsoft boasted last  month that Edge on the May 2020 Update was using up to 27% less memory than without segment heap. Chromium developers adopted it for Chrome on Windows 10 2004 and later.\n  The CPU issue was  discovered by an Intel engineer who found that when Chrome used segment heap, it led to significant performance regression in benchmarks on a PC with an Intel Core i9-9900K processor. Depending on the benchmark, CPU performance was degraded between 10% to 13%, Google found.\n   Microsoft has defended the trade-off between memory and CPU but conceded it can be implemented better to reduce the impact on CPU performance.\n &#34;It is common practice to trade one resource for another. More often it&#39;s increased memory usage for reduced CPU usage. In this case it&#39;s increased CPU usage for dramatically reduced memory usage, or more accurately commit,&#34; wrote a Microsoft employee.\n   Reducing the impact on CPU would require &#34;significant changes across the entire browser codebase&#34;, and Microsoft&#39;s Windows team is investigating whether it can improve the performance of segment heap.\n &#34;In the short term this is a good trade-off of one resource for another as memory/commit usage is a significant pain point for browser users,&#34; argued the Microsoft employee.\n  However, Chromium developers want to see more evidence about the possible impact of Chrome using segment heap.\n &#34;Although I have heard encouraging things about memory savings from lab tests I don&#39;t see any way for us to leave this enabled until we have clean telemetry data and lab tests on 20H1, neither of which will be happening in time for M85,&#34; wrote Chromium member Bruce Dawson.\n &#34;So, the plan is to disable this for M85 (thus giving us another telemetry datapoint) and reconsider in the future.\n &#34;The CPU cost (10% slowdown on Speedometer 2.0, 13% increase in CPU/power consumption) is too great for us to keep.&#34;", "posttime": "2020-07-20 15:50:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "windows-10,google,windows,微软,chrome", "title": "谷歌将在Windows10中禁用微软Chrome的内存节约功能", "title_en": "Google Will Disable Microsoft's RAM-Saving Feature for Chrome in Windows 10", "transed": 1, "url": "https://www.zdnet.com/article/google-disables-windows-10-ram-reduction-in-chrome/", "via": "", "real_tags": ["google", "windows", "微软", "chrome"]}, {"category": "", "categoryclass": "", "imagename": "9dd8ae816f4c6da57c5743c630cbf923.jpg", "infoid": 1012988, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本月早些时候，国土安全部和美国法警服务局向俄勒冈州波特兰部署了联邦执法人员，以镇压该市正在进行的抗议活动。\n因此，在过去的几周里，波特兰的示威者不仅不得不与当地警察抗争-他们一直在积极地试图用催泪瓦斯、橡皮子弹和大规模逮捕来镇压抗议活动-还有联邦特工，根据最近的报道，他们一直在对抗议者使用暴力和违反宪法的策略，包括向人群发射“不具致命性”的弹药，以及开着没有标志的面包车在城市周围行驶，将抗议者从街道上拖走。\n7月15日凌晨，波特兰居民马克·佩蒂伯恩(Mark Pettibone)在结束抗议活动步行回家时被联邦官员拖上一辆面包车，他告诉“华盛顿邮报”(Washington Post)：“我很害怕。它看起来像是出自一部恐怖/科幻小说，就像菲利普·K·迪克(Philip K.Dick)的小说。这就像是被掠夺一样。“。\n在推特上，联邦警察驻扎在波特兰街头的照片和视频在网上疯传，到周五早上，“法西斯主义”这个词在全国范围内流行起来。与此同时，波特兰的市政府官员对联邦执法部门的涌入表示担忧，称他们没有请求联邦机构的协助，联邦军队的存在只会加剧本已紧张的局势。周六，在抗议者放火焚烧波特兰警察协会大楼后，警方宣布发生骚乱，当地和联邦警察对示威者部署极端武力。\n最近抗议活动的视频显示，穿着似乎是军用迷彩服的警察开着没有标志的小型面包车在波特兰四处行驶，在没有明显原因的情况下逮捕了示威者。\nMark Pettibone告诉俄勒冈州公共广播公司(OPB)，他在7月15日星期三凌晨被迫上了一辆这样的面包车，当时他和一位朋友从联邦法院外的和平抗议活动中步行回家。\n“我基本上是被扔进了面包车，”佩蒂伯恩说。“我把我的小帽子拉到脸上，这样我就看不见了，他们把我的手放在我的头上。”\n佩蒂伯恩说，面包车里有几名警官和他在一起，他们都穿着迷彩服和防弹衣，他们不愿透露自己的身份。开车带着他转了一段时间后，他们把他带到了一座他直到被释放才会知道的建筑，那就是联邦法院。警察检查了他的身体，给他拍照，检查了他的东西，然后把他关进了牢房。后来，两名警官走了进来，问他是否愿意放弃他的米兰达权利并回答问题。佩蒂伯恩拒绝了，警官们离开了，大约一个半小时后，他被释放了。\n佩蒂伯恩说，他想不到自己做过任何可以作为逮捕理由的事情，也没有收到任何文件、传票或逮捕记录。\n当OPB联系到请其置评时，美国法警服务局表示，尚未逮捕佩蒂伯恩。国土安全部没有对他的被捕发表评论。\n7月15日发布的另一段视频显示，两名全副武装的联邦官员接近一名站在人行道上的抗议者，这名抗议者举起双手。他们把示威者的手放在她背后，强迫她上了一辆等候在街对面的面包车，无视旁观者的喊叫，“你们在做什么？”你要把她带到哪里去？“。\n周五，CBP在一份针对最近扣押行人的声明中表示，“CBP特工掌握的信息表明，视频中的人涉嫌袭击联邦特工或破坏联邦财产。”\n“一旦CBP特工接近嫌疑人，一大群暴力暴徒就向他们的位置移动，”声明继续说。为了每个人的安全，CBP特工迅速将嫌疑人转移到更安全的地方进行进一步讯问。CBP特工在遭遇过程中表明了自己的身份，并佩戴了CBP徽章。由于最近发生了针对服务和保护我们国家的执法人员的斗鸡事件，特工的名字没有显示出来。“。\n26岁的多纳万·拉贝拉(Donavan LaBella)于7月11日(周六)晚上在波特兰市中心的抗议活动中，被联邦官员开枪击中面部，导致头骨骨折，随后住院治疗。\n拉贝拉的母亲告诉俄勒冈直播，她的儿子在袭击后需要面部重建手术。她周日早上说：“他的头骨里还有一根管子用来排出血液。”\n波特兰市长泰德·惠勒(Ted Wheeler)7月12日晚表示，美国法警服务局将对这起事件进行调查。\n自从今年早些时候乔治·弗洛伊德(George Floyd)被杀后首次爆发反对种族主义和警察暴行的抗议活动以来，特朗普总统多次表达了镇压示威者的愿望。在他的演讲中，总统将抗议者称为“暴徒”和“恐怖分子”，并表达了“报复”的愿望。\n6月26日，在抗议者试图推倒白宫对面公园里的安德鲁·杰克逊(Andrew Jackson)雕像后，特朗普总统签署了一项行政命令，以保护纪念碑、纪念馆和雕像。\n7月1日，国土安全部代理部长查德·沃尔夫在一份声明中说：“国土安全部正在响应总统的号召，动用我们在全国各地的执法人员来保护我们的历史地标。”“当暴力无政府主义者和暴徒不仅试图破坏和摧毁我们国家的象征，而且还在扰乱法律和秩序，在我们的社区播下混乱的种子时，我们不会袖手旁观。”在沃尔夫7月16日星期四发表的一份声明中，他将抗议者描述为一群“无法无天的无政府主义者”的“暴力暴徒”，他们“包围”了联邦财产。\n据美联社报道，PACT特别工作组从海关和边境保护局以及其他机构，如美国法警特别行动小组，向波特兰、西雅图和华盛顿特区派遣了官员。然而，根据7月16日为沃尔夫准备的一份备忘录，沃尔夫在抵达波特兰之前，这些军官穿着战争装备，被分配到城市各地的各个联邦地点-可能没有接受过适合他们目前任务的培训。备忘录指出：“展望未来，如果这种类型的应对将成为常态，就应该向应对机构部署专门的培训和标准化的设备。”正如“纽约时报”报道的那样，国土安全部似乎已经撤出了调查贩毒集团的机构，而且缺乏管理城市中大量抗议者的经验。\n周六，这些警察在马克·O·哈特菲尔德联邦法院会见了抗议者。“俄勒冈州人报”报道称，目前“不清楚”是联邦部队还是当地警方对抗议者使用催泪瓦斯。根据最近的立法，执法部门可能只会在俄勒冈州的骚乱期间使用催泪瓦斯，但一名波特兰论坛报记者在Twitter上发布的视频显示，戴着防毒面具和伪装的联邦警察用警棍和胡椒直接喷洒在一名抗议者的脸上。抗议者没有反应，当警察蜂拥而至时，他静静地站着，然后走开。\n联邦警察用警棍袭击抗议者，在波特兰pic.twitter.com/VX2xTVaaYq法院外使用胡椒喷雾和催泪瓦斯。\n-赞恩·斯帕林(@PDXzane)2020年7月19日。\n周五深夜，俄勒冈州总检察长艾伦·罗森布鲁姆(Ellen Rosenblum)对国土安全部、美国法警服务局、美国海关和边境保护局、联邦保护局及其特工提起诉讼。一份新闻稿援引拉贝拉和佩蒂伯恩的案件称：“他们在没有正当理由的情况下扣押和拘留俄勒冈州人的民事权利，从事了侵犯俄勒冈州人民权的非法执法活动。”\n在一份声明中，罗森布鲁姆称联邦政府的策略“完全没有必要”。\n“他们不仅让人们无法维护第一修正案和平抗议的权利，他们还在我们的街道上制造了更加不稳定的局势。“Rosenblum说。“联邦政府选择波特兰来使用他们的恐吓策略，以阻止我们的居民抗议警察的暴行和支持”黑人生命也是命“(Black Lives Matter)运动。当每个美国人看到这种情况发生时，都应该被拒之门外。“如果这件事能在波特兰这里发生，那就可以在任何地方发生。”\n俄勒冈州的美国公民自由联盟基金会(ACLU Foundation Of Oregon)也在起诉联邦政府，该基金会已于周五对国土安全部(DHS)和美国法警服务局(U.S.Marshalls Service)提起诉讼。这起诉讼旨在阻止联邦特工“逮捕、威胁逮捕或对他们知道或理应知道是记者或法律观察员的任何人使用武力”，这些人没有犯罪。\n针对拉贝拉遭枪击一事，俄勒冈州州长凯特·布朗谴责特朗普总统“继续推动武力和暴力以回应抗议活动”。她补充说，“暴力循环必须结束。”\n在给“华盛顿邮报”的一份声明中，波特兰市专员乔·安·哈德斯蒂(Jo Ann Hardesty)说：“我很自豪能加入民选官员的大合唱，呼吁波特兰街头的联邦军队回家。”她继续说，“他们在这里的存在加剧了紧张局势，并将无数行使第一修正案权利的波特兰人置于更大的危险之中。”\n据“华盛顿邮报”报道，波特兰市长泰德·惠勒(Ted Wheeler)将这些官员描述为总统的“私人军队”。他说：“这是特朗普白宫利用联邦军队来支撑他低迷的民调数据的协调战略的一部分，这是对联邦执法官员的绝对滥用。”“当我们开始看到事态缓和时，他们的行动…。实际上加剧了我们街道上的紧张局势。“。\n与此同时，特朗普总统赞扬了联邦军队的工作，在周一的新闻发布会上说：“我们在波特兰做得很好。波特兰完全失控了，他们进去了，我猜我们现在有很多人在监狱里。我们在很大程度上平息了它，如果它再次启动，我们将非常容易地再次平息它。如果你知道自己在做什么，这并不难做到。“。据报道，周六晚上，他在Twitter上幸灾乐祸地庆祝联邦特工的策略，然后将其删除：“俄勒冈州官员在波特兰问题上吓了一跳。”\n特朗普昨晚深夜删除了一条推文，其中他听起来对俄勒冈州官员被联邦官员冲进来感到愤怒感到高兴。这似乎是对该&&gt;https://t.co/tbIj7sySER pic.twitter.com/mAAXQedwrR的清理\n-克里斯蒂娜·威尔基(@christinawilkie)2020年7月19日。\n他后来将这种情绪修正为：“我们试图帮助波特兰，而不是伤害它。几个月来，他们的领导层已经失去了对无政府主义者和煽动者的控制。他们在行动中失踪了。我们必须保护联邦财产和我们的人民。这些不仅仅是抗议者，这才是真正的交易！“。\n周五上午，随着“法西斯主义”风靡全国，一些政界人士和评论员指责特朗普部署了一支“秘密警察部队”。\n我以为我们在拉斐特广场袭击事件发生后已经谈到了这个问题：美国政府不应该使用身份不明的联邦官员作为秘密警察部队来恐吓美国公民，侵犯他们的宪法权利。这太离谱了。Https://t.co/EIXbZmHXak。\n-伊丽莎白·沃伦(@SenWarren)2020年7月17日。\n这些人是谁？他们为哪个机构工作？谁给他们下命令？他们使用武力的准则是什么？他们在波特兰有什么管辖权？这种缺乏问责的行为是联邦当局无法接受的。在美国我们没有秘密警察。Https://t.co/gHMJadt7BH。\n-众议员唐·拜尔(@RepDonBeyer)2020年7月17日。\n波特兰的这名抗议者看起来像是被特朗普的盖世太保风格的秘密警察重伤。有人知道他发生了什么事吗？他得到他需要的医疗服务了吗？#FascistTrump pic.twitter.com/bCEtpszuV4\n-奇普·富兰克林(@chipfrklin)2020年7月17日。\n不明身份的冲锋队。没有标记的车。作为对涂鸦的回应，绑架抗议者并造成重伤。这些不是民主共和国的行为。@DHSgov在波特兰的行动破坏了它的使命。必须阻止特朗普和他的冲锋队。\n--南希·佩洛西(@SpeakerPelosi)2020年7月18日。\n第一修正案的演讲永远不应该受到充当特朗普秘密警察的联邦特工的片面暴力，特别是在身份不明的情况下。这是我们期望香蕉共和国做出的可耻行为，而不是美国政府。\n--南希·佩洛西(@SpeakerPelosi)2020年7月18日。\n鉴于本周末警方的残酷回应，这些谴责只会升级，美国参议员杰夫·默克利(Jeff Merkley)在推特上表示，他和参议员罗恩·怀登(Ron Wyden)将“对国防法案…提出修正案。以阻止特朗普政府派遣准军事小组走上美国街头。“。\n突破：当我下周回到华盛顿时，我将和@RonWyden一起提出一项国防法案修正案，以阻止特朗普政府派遣准军事小队进入美国街头。我们不会让这些独裁策略继续存在。\n-参议员杰夫·默克利(@SenJeffMerkley)2020年7月18日\n美国-伊斯兰关系委员会俄勒冈州分会发言人扎基尔·汗(Zakir Khan)告诉《华盛顿邮报》(Washington Post)，他认为特朗普政府试图测试行政权力的极限：“我认为波特兰是个试金石。他们希望在进军该国其他地区之前，先看看自己能做些什么。“。\n提交您的电子邮件，即表示您同意我们的条款和隐私通知，并接受我们的电子邮件通信。", "note_en": "Earlier this month, the Department of Homeland Security and the U.S. Marshals Service deployed federal law enforcement officers to Portland, Oregon, to crack down on ongoing protests in the city.\n  As a result, over the past few weeks, demonstrators in Portland have had to contend with not only the local police force — which has been aggressively trying to quash the protests with tear gas,  rubber bullets, and  mass arrests — but also federal agents, who, according to recent reports, have been employing violent and constitutionally dubious tactics against protesters, including firing “less-than-lethal” munitions into crowds, and driving around the city in unmarked vans to yank protesters off the streets.\n      Mark Pettibone, a Portland resident who was hauled into a van by federal officers as he was walking home from a protest in the early hours of July 15, told the  Washington  Post: “I was terrified. It seemed like it was out of a horror/sci-fi, like a Philip K. Dick novel. It was like being preyed upon.”\n    On Twitter, photos and videos of the heavy federal police presence in the streets of Portland went viral, and by Friday morning, the word “fascism” was trending nationwide. City officials in Portland, meanwhile, have expressed concern about the influx of federal law enforcement, saying that they did not request assistance from federal agencies, and that the presence of the federal troops has only served to escalate an already tense situation. On Saturday, police  declared a riot after protesters set fire to the Portland Police Association building, with local and federal officers  deploying extreme force against demonstrators.\n          Videos from recent protests show officers in what appear to be military fatigues driving around Portland in unmarked minivans, and arresting demonstrators without apparent cause.\n        Mark Pettibone told  Oregon Public Broadcasting (OPB) that he was forced into one such van in the early hours of Wednesday, July 15, when he and a friend were walking home from a peaceful protest outside the federal courthouse.\n    “I am basically tossed into the van,” Pettibone said. “And I had my beanie pulled over my face so I couldn’t see, and they held my hands over my head.”\n  Pettibone said there were several officers in the van with him, all of them in camouflage and body armor, and they wouldn’t identify themselves. After driving him around for a while, they took  him to a building that he wouldn’t learn until he was released was the federal courthouse. Officers patted him down, took his picture, went through his things, and then put him in a cell. Later, two officers came in and asked him if would like to waive his Miranda rights and answer questions. Pettibone declined, the officers left, and he was released about an hour and a half later.\n      Pettibone said he could not think of anything he had done that could serve as grounds for arrests, nor did he receive any paperwork, citation, or record of his arrest.\n  When reached for comment by OPB, U.S. Marshals Service said it had not arrested Pettibone. DHS did not comment on his arrest.\n  Another video, posted on July 15, shows two federal officers in full tactical gear approaching a protester who is standing on the sidewalk with her hands up. They put the protester’s hands behind her back, and force her into a van waiting across the street, ignoring bystanders as they yell, “What are you doing? Where are you taking her?”\n          On Friday, in  a statement addressing its recent seizure of pedestrians, the CBP said, “CBP agents had information indicating the person in the video was suspected of assaults against federal agents or destruction of federal property.”\n  “Once CBP agents approached the suspect, a large and violent mob moved towards their location,” the statement continued. “For everyone’s safety, CBP agents quickly moved the suspect to a safer location for further questioning. The CBP agents identified themselves and were wearing CBP insignia during the encounter. The names of the agents were not displayed due to recent doxing incidents against law enforcement personnel who serve and protect our country.”\n    Donavan LaBella, 26, was hospitalized and suffered skull fractures after federal officials shot him in the face with “less-than-lethal” ammunition at a protest in downtown Portland on the night of Saturday, July 11.\n        LaBella’s mother told  Oregon Live that her son required facial reconstruction surgery following the attack. “He still has a tube in his skull to drain the blood,” she said Sunday morning.\n  Portland mayor Ted Wheeler said on the night of July 12 that the U.S. Marshal Service would conduct an investigation into the incident.\n    Ever since protests against racism and police brutality first erupted following  the killing of George Floyd earlier this year, President Trump has repeatedly expressed his desire to crack down on demonstrators. In his speeches, the president has referred to protesters as “ thugs” and “ terrorists,” and expressed a desire for “retribution.”\n  On June 26, after protesters attempted to pull down a statue of Andrew Jackson that sits in the park across from the White House, President Trump signed an  executive order to protect monuments, memorials, and statues.\n        “DHS is answering the president’s call to use our law enforcement personnel across the country to protect our historic landmarks,”  acting DHS secretary Chad Wolf said in a statement on July 1. “We won’t stand idly by while violent anarchists and rioters seek not only to vandalize and destroy the symbols of our nation, but to disrupt law and order and sow chaos in our communities.” In a  statement Wolf issued on Thursday, July 16, he described protesters as a “violent mob” of “lawless anarchists” who had laid “siege” to federal property.\n    Per the  AP, the PACT task force sent officers from Customs and Border Protection and other agencies like the U.S. Marshals Special Operations Group, to Portland, Seattle, and Washington, D.C. According to  a July 16 memo prepared for Wolf in advance of  his arrival in Portland, however, these officers — outfitted as if for war, and assigned to various federal sites around the city — may not have undergone training appropriate to their current assignment. “Moving forward, if this type of response is going to be the norm, specialized training and standardized equipment should be deployed to responding agencies,” the memo notes. As the New York   Times reports, the DHS appears to have pulled from agencies that investigate drug cartels, for example, and lack experience managing large crowds of protesters in cities.\n  On Saturday, these officers met protesters at the Mark O. Hatfield Federal Courthouse. The   Oregonian reports that it was “unclear” whether or not federal forces or local police deployed tear gas — a substance that,  per recent legislation, law enforcement may only use during riots in Oregon — against protesters, but footage  tweeted by a Portland  Tribune reporter shows federal officers in gas masks and camouflage beating a protester with batons and pepper spraying him directly in the face. The protester did not react, standing still as the officers swarmed and then walking away.\n      Federal police strike protester with baton, use pepper spray and tear gas outside courthouse in Portland  pic.twitter.com/VX2xTVaaYq\n— Zane Sparling (@PDXzane)  July 19, 2020\n    Oregon’s Attorney General, Ellen Rosenblum, filed a lawsuit against the DHS, the United States Marshals Service, the United States Customs and Border Protection, the Federal Protection Service, and their agents late Friday night. “They have engaged in unlawful law enforcement in violation of the civil rights of Oregonians by seizing and detaining them without probable cause,” a  press release contends, citing LaBella and Pettibone’s cases.\n    In a statement, Rosenblum called the federal government’s tactics “entirely unnecessary.”\n  “They not only make it impossible for people to assert their First Amendment rights to protest peacefully. They also create a more volatile situation on our streets,” Rosenblum said. “The federal administration has chosen Portland to use their scare tactics to stop our residents from protesting police brutality and from supporting the Black Lives Matter movement. Every American should be repulsed when they see this happening. If this can happen here in Portland, it can happen anywhere.”\n      The ACLU Foundation of Oregon  is also suing the federal government, having filed its own  lawsuit against the DHS and the U.S. Marshalls Service on Friday. The suit seeks to block federal agents from “arresting, threatening to arrest, or using physical force directed against any person whom they know or reasonably should know is a Journalist or Legal Observer” who has committed no crime.\n    In response to LaBella’s shooting,  Oregon governor Kate Brown condemned President Trump for “continuing to push for force and violence in response to protests.” She added,  “The cycle of violence must end.”\n  In a statement to the  Washington  Post, Portland city commissioner Jo Ann Hardesty said, “I am proud to be among the loud chorus of elected officials calling for the federal troops in Portland’s streets to go home.” She continued, “Their presence here has escalated tensions and put countless Portlanders exercising their First Amendment rights in greater danger.”\n        Ted Wheeler, Portland’s mayor, characterized the officers as the president’s “personal army,” according to the Washington   Post. “This is part of a coordinated strategy of Trump’s White House to use federal troops to bolster his sagging polling data, and it is an absolute abuse of federal law enforcement officials,” he said. “As we were starting to see things de-escalate, their actions … have actually ratcheted up the tension on our streets.”\n  President Trump, meanwhile, praised the work of the federal troops, saying in a  press conference on Monday: “We’ve done a great job in Portland. Portland was totally out of control, and they went in, and I guess we have many people right now in jail. We very much quelled it, and if it starts again, we’ll quell it again very easily. It’s not hard to do, if you know what you’re doing.” On Saturday night, he  reportedly tweeted —  and then deleted — a gloating celebration of federal agents’ tactics: “Oregon officials are running scared when it comes to Portland.”\n  Trump deleted a tweet late last night in which he sounded pleased that Oregon officials were angered by federal officials storming in. This appears to be cleanup for that&gt;&gt;&gt;  https://t.co/tbIj7sySER  pic.twitter.com/mAAXQedwrR\n— Christina Wilkie (@christinawilkie)  July 19, 2020\n      He later revised that  sentiment to: “We are trying to help Portland, not hurt it. Their leadership has, for months, lost control of the anarchists and agitators. They are missing in action. We must protect Federal property, AND OUR PEOPLE. These were not merely protesters, these are the real deal!”\n      On Friday morning, as “fascism” trended across the country, some politicians and commentators accused Trump of deploying a “secret police force.”\n  I thought we’d already covered this after the attacks in Lafayette Square: the US government should not be using unidentified federal officers as a secret police force to terrorize US citizens &amp; violate their constitutional rights. This is outrageous.  https://t.co/EIXbZmHXak\n— Elizabeth Warren (@SenWarren)  July 17, 2020\n  Who are these people? What agency do they work for? Who gives them orders? What are their use of force guidelines? What is their jurisdiction in Portland?   This lack of accountability is UNACCEPTABLE from federal authorities.  We don&#39;t have secret police in the United States.  https://t.co/gHMJadt7BH\n— Rep. Don Beyer (@RepDonBeyer)  July 17, 2020\n      This protester in Portland looks like he was seriously injured by Trump’s gestapo style, secret police.  Does anyone know what happened to him? Did he get the medical care he needed? #FascistTrump    pic.twitter.com/bCEtpszuV4\n— Chip Franklin (@chipfranklin)  July 17, 2020\n  Unidentified stormtroopers. Unmarked cars. Kidnapping protesters and causing severe injuries in response to graffiti.  These are not the actions of a democratic republic. @DHSgov’s actions in Portland undermine its mission.  Trump &amp; his stormtroopers must be stopped.\n— Nancy Pelosi (@SpeakerPelosi)  July 18, 2020\n    First Amendment speech should never be met with one-sided violence from federal agents acting as Trump’s secret police, especially when unidentified. This is disgraceful behavior we would expect from a banana republic — not the government of the United States.\n— Nancy Pelosi (@SpeakerPelosi)  July 18, 2020\n      Those condemnations have only escalated in light of this weekend’s brutal police response, with U.S. Sen. Jeff Merkley  tweeting that he and Sen. Ron Wyden would be “introducing an amendment to the defense bill … to stop the Trump administration from sending its paramilitary squads onto America’s streets.”\n  BREAKING: When I get back to DC next week, I will be introducing an amendment to the defense bill with  @RonWyden to stop the Trump administration from sending its paramilitary squads onto America&#39;s streets. We won&#39;t let these authoritarian tactics stand.\n— Senator Jeff Merkley (@SenJeffMerkley)  July 18, 2020\n    Zakir Khan, a spokesman for the Oregon chapter of the Council on American-Islamic Relations, told the  Washington  Post he thought the Trump administration was trying to test the limits of executive power: “I think Portland is test case. They want to see what they can get away with before launching into other parts of the country.”\n    By submitting your email, you agree to our  Terms and  Privacy Notice and to receive email correspondence from us.", "posttime": "2020-07-20 15:38:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发生,happening,波特兰", "title": "波特兰到底发生了什么事？", "title_en": "What the hell is happening in Portland?", "transed": 1, "url": "https://www.thecut.com/2020/07/portland-protesters-federal-police-trump-dhs.html", "via": "", "real_tags": ["发生", "happening", "波特兰"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012987, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎回到Cryptoography Dispatches，这是我编辑很少的密码工程时事通讯。感谢大家，这期杂志比往常来得更早。", "note_en": "Welcome back to Cryptography Dispatches, my lightly edited newsletter on cryptography engineering. This issue is coming sooner than usual thanks to everyone...", "posttime": "2020-07-20 15:38:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "https,dispatches,工程", "title": "加密派单：将PGP替换为HTTPS表单", "title_en": "Cryptography Dispatches: Replace PGP with an HTTPS Form", "transed": 1, "url": "https://buttondown.email/cryptography-dispatches/archive/cryptography-dispatches-replace-pgp-with-an-https/", "via": "", "real_tags": ["https", "工程"]}, {"category": "", "categoryclass": "", "imagename": "61118277bcdc797f8b082a64d2a9f5eb.jpg", "infoid": 1012986, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "订阅1998年在我的第一份工作中，我是玻利维亚最大的互联网提供商的系统管理员，现在它仍然是最大的提供商。互联网在1995年或1996年来到这里，所以它才刚刚开始。\n我负责BGP路由器，通过卫星连接到互联网，在那些日子里，整个国家的连接速度只有2 Mbps。我还负责电子邮件服务器(roble.scz.entelnet.bo)，DNS服务器在Unix机器上运行，而电子邮件和Web服务器在RedHat Linux驱动的PC上运行。\n快进到2001年，我成立了自己的公司，它与系统管理无关，但无论如何我们需要电子邮件服务，所以我只是获得了一个带有/28公共IP段的在线通道，并设置了一台运行BIND、Sendmail、Dovecot的CentOS服务器。\n2007年，我开始使用Apache、PHP和MySQL在同一台服务器上运行的Drupal上写博客，这里是我的第一篇文章。我以前是主持服务的。\n但后来我手中的时间变少了，维护服务运行也变得更加困难，更新垃圾邮件过滤器和规则变得困难，BIND也有问题，Slashdot发生了，带宽不足。\n我把我的服务器转移到一家网络托管公司，然后转移到Linode VPS，我还外包了DNS服务，并将电子邮件转移到Google Apps。\n那或多或少是在2010年，所以我停止了托管我的服务，只有我的博客在我手中，但那时我开始使用Jekyll，所以它只是一个带有Nginx的VPS。\n今年4月，我开始了这个博客，但我也注册了Fedariable，并决定运行我自己的实例，因此我再次托管，那不只是一台Nginx服务器，然后我读到了这个、这个和这个。\n经营我的服务的想法又一次出现在我的脑海里。我想随着时间的推移做不同的事情，现在已经不是1998年了，所以我决定了解一下Docker。所以现在我只有一台Arch Linux服务器：\n都是用Docker编写的文件，但是遗漏了一些东西，那就是电子邮件。(乳齿象有自己的服务器-还没有-)。\n我想在Docker上运行一个电子邮件服务器，所以我寻找了一些替代方案，我发现有一些非常好的。\n我还没有测试过，但似乎真的很容易部署，它有一个免费版本，我认为个人使用已经足够了，有两个专业选项，每月收费。\n它是Poste.io的克隆，但仅使用我安装和配置的免费开放源码替代方案，我只用了45分钟就为我的一个域运行了服务器。它有一个根据您的选项创建配置文件的工具，它可以为您设置一切，您可以在这里找到它，您只需回答几个问题，然后运行三四个命令，您就拥有了一个完整的电子邮件服务器。\n然后我发现了这个，它也是一个完整的套件，都是开源的，有非常好的文档，可以用Docker部署在服务器上。它不像麦露那么简单，但我决定用它。我遵循了这个指南，是的，我知道，如果你遵循这个指南，你仍然需要Gmail或任何其他提供商来发送你的电子邮件。但是我还没有准备好完全跳进池子里。\nMX记录指向我的服务器，所以我的所有电子邮件都由我的服务器接收。\nGmail配置为使用这些帐户作为默认帐户，而不是Gmail地址，并使用我的SMTP服务器发送\n这样，我确信我在使用我的域名，因为我们已经同意每个人都应该拥有自己的域名，对吗？我正在使用Gmail作为我的电子邮件客户端。\n我之所以这样做，是因为使用Gmail搜索电子邮件很容易，也因为我不确定我是否会丢失服务器和丢失一些重要的电子邮件。我需要确定这一点，因为我是为我的家人举办的，而不仅仅是我自己。\n此外，在手机上安装IMAP客户端也会耗尽电池，因为即使没有东西可下载，或者如果您保持打开的IMAP空闲连接，它也会轮询服务器，也会耗尽电池。有一个解决方案，你需要Pushover，这个IMAP to Pushover应用程序，我还没有测试，但我认为是可行的。\n如果您计划托管您自己的电子邮件服务器，您需要考虑一些重要的事情，那就是正确配置您的DNS服务器。以下是您需要的内容：\n您确实需要配置SPF记录，这并不适用于所有提供商，但是有大量的文档，这并不难做到。该记录基本上告诉收件人服务器谁有权代表您的域发送邮件。最常见的配置是MX服务器是授权的，如下所示。\n这个有点难，您需要创建DKIM密钥，您的电子邮件服务器可以做到这一点，上面的所有示例都可以做到，一旦您有了它，您需要在DNS上创建一个TXT记录并将其粘贴到那里，它将如下所示：\n您的所有电子邮件都将使用该DKIM密钥签名，接收服务器可以使用DNS中的信息检查签名是否有效。\n这是可选的，但最好有它，您可以使用像这样的在线工具生成它。它所做的是告诉发生故障时要做什么，以及向谁报告这一点，通常是服务器管理员，也就是您。\n您需要有一个PTR DNS记录，即您的服务器正在使用的IP的反向DNS应该指向与A记录相同的名称。举个例子，如果你有一张A唱片。\n您需要要求IP所有者为您添加该记录，如果您使用的是VPS，您可以查看相关文档。\n当然，您需要一个MX记录，但是您已经知道了这个记录，否则运行您自己的服务器可能不是一个好主意。这基本上通知所有发送服务器哪个服务器正在接收您的域的电子邮件。\n一旦您设置好一切，等待24小时DNS传播并测试它，这个工具非常棒。\n您可能不需要托管您的电子邮件服务器，您可以使用Fastmail、Zoho、Office 365或Google Suite，但您必须使用您的域，所有帐户、所有银行对帐单都应发送到您域中的电子邮件地址，否则您可能会失去对帐户的控制。托管电子邮件服务器不是一件容易的事情，处理垃圾邮件很难，停机也可能是一场噩梦，但在托管电子邮件的过程中，您会学到一两件事。", "note_en": "Subscribe    In 1998 at my first job, I was the system administrator of the biggest Internet provider in Bolivia, it still is the biggest provider. The Internet arrived here in 1995 or 1996, so it was just starting.\n I was in charge of BGP routers, with a satellite connection to the Internet, the whole country had just 2 mbps of connection back in those days. I was also in charge of the email server, (roble.scz.entelnet.bo), the DNS server run on a Unix machine while the email and web server on a RedHat Linux powered PC.\n Fast forward to 2001, I started my own company, it had nothing to do with system administration, but anyway we needed email service, so I just got an on-line channel with a /28 public IP segment, and setup a CentOS server running bind, sendmail, Dovecot.\n In 2007, I started blogging on Drupal running on that same server using Apache, PHP and MySQL  here the first post. I was used to host services.\n  But then I had less time in my hands, it was also more difficult to maintain the services running, keeping up to date with Spam filters and rules became difficult, Bind also had its problems, and Slashdot happened and Bandwidth was not enough.\n I moved my server to a web hosting company, and then to a Linode VPS, I also outsourced the DNS service and moved the email to Google Apps.\n   That was in 2010 more or less, so I stopped hosting my services, only my blog was in my hands, but at that time I started using Jekyll, so it was just a VPS with Nginx.\n  In April this year I started this blog, but I also enrolled in the Fediverse, and decided to  run my own instance, therefore I was hosting again, that was not just a NGINX server, then I read  this,  this and  this.\n And the idea of running my services was in my head again. I wanted to do it different with time, it is not 1998 anymore, so I decided to learn about  Docker. So now I have in just one Arch Linux server:\n  All running with Docker Compose files, but there was something missing, it was email. (Mastodon has its own server -yet-)\n  I wanted to run an email server on Docker, so I looked for alternatives and I have found that there are some really nice.\n  I have not tested it, but seems really easy to deploy it has a free version that I think is enough for personal use, with two professional options with a monthly charge.\n  It is a clone of Poste.io, but using only free, Open Source alternatives, I have installed and configured, it took me just 45 minutes to have server running for one of my domains. It has a tool that create a configuration file based on your options, and it set up everything for you, you can find it  here, you only need to answer a few questions, and run three or four commands and there you have a complete email server.\n    Then I found this one, it is also a complete suite, all Open Source, with really good documentation, and ready to deploy on a server with Docker. It is not as easy as Mailu, but I decided to use it. I followed  this guide, yes I know, you still need Gmail or any other provider to send your emails, if you follow that guide. But I was not ready to jump into the pool completely.\n  MX record points to my server, so all my email is received by my server\n    Gmail is configured to use those accounts as default and not the Gmail address, and uses my SMTP server to send\n This way I am sure I am using my domain, because we already agreed that  everybody should own his domain, right?. I am using Gmail as my email client.\n I am doing this way, because it is easy to search emails when they are with Gmail, also because I am not sure if I may lose my server and lose some important email. I need to be sure about that, because I am hosting for my family, not only for me.\n Also having an IMAP client on a cell phone drains the battery, because it polls the server even when there is nothing to download, or if you keep an open IMAP IDLE connection, it will also drain the battery. There is a solution for that, you need  PushOver, and this  IMAP to PushOver app, I have not tested yet, but I think is the way to go.\n  If you plan to host your own email server, there are some important things you need to consider, and it is to properly configure your DNS server. Here is what you need:\n  You really need to configure a SPF record, it is not the same with all providers, but there is plenty of documentation, and it is not hard to do. This record basically tells the recipient server who is authorized to send mail on behalf of your domain. The most common configuration is that the MX server are the authorized ones, something like this.\n   This one is a little bit more difficult, you need to create the DKIM key, your email server may do it, all examples above can do it, once you have it, you need to create a TXT record on your DNS and paste it there, it will look something like this:\n  All your emails will be signed with that, DKIM key, and the receiving server can check if the signature is valid, using the info from the DNS.\n  This one is optional, but is better to have it, you can generate it using on-line tools like  this one. What it does is to tell what to do when something fails, and who to report that, usually the server admin, well you.\n  You need to have a PTR DNS records, that is the reverse DNS for the IP your server is using should point to the same name the A record has. So, for example, if you have this A record\n    You need to ask to the owner of the IP to add that record for you, if you are using a VPS, you can look in the documentation about that.\n  Of course you need a MX record, but you already knew about this one, otherwise maybe is not a good idea to run your own server. This basically informs al sending servers which server is receiving email for your domain.\n  Once you have set-up everything, wait 24 hours for DNS to propagate and test it,  this tool is great\n  You may not need to host your email server, you can use  Fastmail,  Zoho, Office 365, or Google Suite, but you  must use your domain, all accounts, all bank statements should be sent to an email address at your domain, otherwise you can lose control over your accounts. Hosting your email server is not an easy task, dealing with SPAM is hard, and downtimes can be a nightmare too, but you learn one or two things while hosting your email.", "posttime": "2020-07-20 15:37:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电子邮件,email,服务器", "title": "自托管电子邮件服务器", "title_en": "Self Hosting Email Server", "transed": 1, "url": "https://www.garron.blog/posts/host-your-email-server.html", "via": "", "real_tags": ["电子邮件", "email", "服务器"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012985, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Vectorly正在开发一种新的视频压缩技术，它利用计算机视觉和矢量图形技术，将视频内容的比特率比HEVC降低一个数量级(或更多)，同时提高视频质量。\n这将主要是有效的矢量友好的视频内容，其中将包括动画，屏幕播放，许多电子学习视频和潜在的3D游戏内容。\n通过利用所有设备上现有的矢量图形渲染功能，此编解码器不需要最终用户、原始设备制造商或浏览器安装特殊软件即可播放这些视频。\n该项目背后的核心见解是，您可以使用基于矢量图形的动画来模拟视频，其方式与传统的基于光栅图形的视频格式(如MP4容器中的H264视频流)没有什么区别。\n普通视频，就像你在Netflix或YouTube上看到的那样，只是屏幕上快速更新的图像序列，以创造运动的错觉。每幅图像都由独立的色点组成。更高的分辨率意味着更大的像素、更好的视觉质量和更大的文件大小。\n互联网上几乎所有的视频都是这种格式，也就是众所周知的光栅图形。像H264这样的视频压缩算法在使用较少的数据点来重建任何给定帧中的像素以及仅存储视频帧之间的像素差异方面非常有效。\n相反，我们使用一个称为矢量图形的概念来渲染视频。代替像素，我们用形状、直线和曲线来表示屏幕上的一切，它们可以用数学公式(矢量图形)来表示。\n使用这些数学公式，我们可以在屏幕上重新绘制任意形状--从字母到巴特·辛普森的头像。此外，通过添加颜色、屏幕位置以及它们如何随时间移动或改变形状等信息，您可以创建完整的视频-包括整个“辛普森一家”剧集，只需一系列数学方程式。\n这个项目背后的核心见解是，对于某种矢量友好的视频内容，使用矢量图形存储视频将比使用光栅图形效率高得多(在某些情况下，效率高达2个数量级)。\n这个想法与大约20年前基于Flash的动画的想法没有实质性的不同。为什么现在要这么做？\n不需要解码器：大多数设备现在支持SVG、HTML5、WebGL/OpenGL和/或某种形式的硬件加速矢量图形渲染。这使您可以在任何设备上呈现矢量图形内容，而不需要最终用户、OEM或浏览器安装特殊软件来实现矢量图形内容的回放，并通过这样做来实现本地级别的性能。应用程序开发者只需要在他们的网站或应用程序中包括适当的库或SDK，就可以在原生或第三方视频播放器中播放。\n计算机视觉：我们的专利矢量化技术在很大程度上依赖于计算机视觉将光栅图形视频转换为矢量格式。利用计算机视觉的先进性和商品化，以及在云上运行批量计算机视觉繁重任务的简便性，现在大规模矢量化大量视频是可行的，这在5年前都是不可能的。\n我们正在构建基于现有标准(SVG、WebGL和amp；OpenGL)的视频格式，使用Javascript对其进行扩展，以启用时间轴和关键帧等视频功能。我们将生成的视频数据打包到一个MP4容器中，该容器可以使用现有的视频基础设施(如HLS/DASH和DRM系统)进行流式传输和分发。\n我们是务实的，不想为了创建标准而创建标准。为此，我们已经创建了库和SDK，这些库和SDK可以使用标准/原生接口(如下所示)回放我们的矢量图形视频。\n我们的第一个动画概念的矢量化证明是位于这里的17秒的“辛普森一家”剪辑。请记住，我们的技术仍处于非常早期的阶段，这还有很多优化工作要做。\n我们的技术也非常适用于电子学习，特别是可汗学院风格的内容。你可以在这里找到30秒的可汗学院片段", "note_en": "Vectorly is developing a new kind of video compression technology, which uses computer vision and vector graphics to reduce bitrates for video content by an order of magnitude (or more) compared to HEVC, while  improving video quality.\n This would be primarily effective for &#34;vector friendly&#34; video content, which would include animations, screen-casts, many e-learning videos and potentially 3d gaming content.\n By leveraging existing vector-graphics rendering capabilities on all devices, this codec wouldn&#39;t require end-users, OEMs or browsers to install special software to enable playback of these videos.\n    The core insight behind this project was that you could use vector-graphics based animations to simulate &#34;videos&#34; in a way that is indistinguishable from a traditional raster-graphics based video format such as an h264 video stream in an MP4 container.\n  Normal videos, like the ones you see on Netflix or YouTube, are just sequences of images which get updated quickly on the screen, to create the illusion of motion. Each image is composed of &#34;pixels&#34; - individual dots of color. Higher resolution means more pixels, better visual quality, and bigger file sizes.\n  Almost all video on the internet is of this format, known as &#34;raster graphics&#34;. Video compression algorithms like h264 are just very efficient at using fewer data-points to reconstruct the pixels in any given frame, and at storing only the differences in pixels between frames of a video.\n  In contrast, we use a concept called &#34;vector-graphics&#34; to render video. Instead of pixels, we represent everything on the screen using shapes, lines and curves, which can be represented as mathematical equations (vector graphics).\n  Using these mathematical equations, we can re-draw any arbitrary shape on the screen - from the letter &#34;T&#34; to Bart Simpson&#39;s head. Furthermore, by adding information such as color, position on the screen, and how they move or change shape over time, you can create whole videos - including entire episodes of the Simpsons, with just sequences of mathematical equations.\n  The core insight behind this project was that for a certain kind of &#34;vector-friendly&#34; video content, storing the video using vector graphics would be much more efficient than using raster graphics (in some cases, up to 2 orders of magnitude more efficient).\n This idea is not substantively different from the idea of Flash based animations about 20 years ago. Why do this now?\n No need for a decoder: Most devices now support SVG, HTML5, WebGL/OpenGL and/or some form of hardware-accelerated vector-graphics rendering. That lets you render vector-graphics content on any device without require end-users, OEMs or browsers to install special software to enable playback of vector-graphics content, and to achieve native-level performance by doing so. App developers would only need to include an appropriate library or SDK in their website or app to enable playback within native or 3rd player video players.\n Computer vision: Our patented vectorization technology relies heavily on computer vision to convert raster-graphics videos to a vector format. Leveraging the advancement &amp; commoditization of Computer Vision, and the ease of running batch computer-vision heavy tasks on the cloud, it&#39;s feasible to &#39;vectorize&#39; large volumes of video at scale now, in a way that wasn&#39;t possible even 5 years ago.\n  We are building a video-format based on existing standards (SVG, WebGL &amp; OpenGL), extending it with Javascript to enable video features such as a timeline and key-frames. We package the resulting video data within an MP4 container, which can be streamed and distributed using existing video infrastructure (such as HLS/DASH, and DRM systems).\n  We are pragmatic, and don&#39;t want to create a standard  for the sake of creating a standard. To that end, we&#39;ve created libraries and SDKs that enable playback of our vector-graphics videos using standard / native interfaces like so\n    Our first vectorized proof of concept for animations is a 17 second clip of the Simpsons located  here. Keep in mind, our technology is still at a very early stage, and this is much optimization work left to be done.\n  Our technology also works very well for e-learning, and especially Khan Academy style content. You can find 30 second Khan Academy clip  here", "posttime": "2020-07-20 15:09:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "艺术,视频,video", "title": "视频矢量化-将基于艺术线条的视频大小减少约95%", "title_en": "Video Vectorization – reduce video size by about 95% for line-art based videos", "transed": 1, "url": "https://vectorly.io/docs/technology/", "via": "", "real_tags": ["艺术", "视频", "video"]}, {"category": "", "categoryclass": "", "imagename": "bf1568c34f2b1fcc722ee3bcd4829721.jpg", "infoid": 1012984, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "就试验性提案而言，这一提案当然不乏雄心壮志。首先，取一个黑洞。现在制造第二个与之量子纠缠的黑洞，这意味着发生在其中一个黑洞上的任何事情似乎都会影响另一个黑洞，无论它们相距有多远。\n其余的听起来容易一些，但却奇怪得多。将一些信息输入第一个黑洞，编码在量子粒子中。当它落到视界之外--甚至连光都无法逃脱的视界之外--信息很快就会被涂抹在整个黑洞中，并被扰乱，似乎无法回忆。\n但是要有耐心--如果你以正确的方式连接了这两个黑洞，在短暂的等待之后，量子信息就会从第二个黑洞中跳出来，完全重新聚焦成可读的形式。为了到达那里，它将通过一条连接这两个物体的时空捷径-虫洞。\n至少，这是物理学家的预测。现在，由加州理工学院的塞佩尔·内扎米(Sepehr Nezami)领导的一个小组已经提出了如何实际执行这项非凡的实验的建议-他们正开始与合作者合作，将这一想法付诸实践。\n如果预测得到证实，这项工作可能会为在哪里寻找物理学中最难以捉摸的理论提供线索：一种将量子力学与描述引力的广义相对论相结合的理论。此外，它还将支持这样的观点，即时空不是宇宙上演的基本背景，而是它本身是由量子纠缠描述的粒子之间的相互联系编织而成的。\n正如你可能已经猜到的那样，这个实验不需要通常意义上的黑洞，也就是说，大质量恒星因自身引力而坍塌到无限小的体积。研究人员说，只需使用几个原子或离子，就可以在实验室台面上完成这项工作。尽管如此，这个想法还是源于对天体物理黑洞的理论研究，该研究一直在努力解决一个深刻而令人不安的问题：这些吞噬一切的怪物是否会不可逆转地破坏信息？\n人们普遍认为，信息和能量一样，应该遵守一条守恒定律：宇宙中的信息总量将永远保持不变。这似乎就是量子力学所暗示的：描述量子实体的波函数总是以信息守恒的方式顺利演化，不可能突然被扼杀。\n但是黑洞似乎确实从宇宙中移除了信息。比方说，如果一个量子比特或“量子比特”落入黑洞，它就不能再从视界之外观察到。\n这种“黑洞信息悖论”的一种可能的解决办法是在黑洞从其事件视界发出的辐射中找到的。斯蒂芬·霍金(Stephen Hawking)在20世纪70年代预测的霍金辐射将导致黑洞失去引力能量，从而失去质量。实际上，黑洞并不是永恒的。它们会慢慢蒸发。\n霍金最初认为，即使黑洞完全蒸发，它消耗的信息也会永远丢失。但是，一个被称为ADS/CFT对应的想法展示了霍金辐射的光子如何能够编码关于黑洞内部的信息，从而将这些信息带回整个宇宙。\nADS/CFT对应是理论物理学家胡安·马尔达塞纳(Juan Maldacena)在1997年提出的假设，它被广泛认为是追求量子引力理论的最有前途的方向之一。它表明，比方说，四维空间中的时空物理结构等同于量子理论在三维边界上的操作。\n这种联系是奇怪的、深刻的和令人惊讶的。它说，如果你构建一个具有特殊曲率(因此也就是重力)的时空，被称为反de Sitter空间-那就是ADS部分-数学描述被证明等同于一种被称为共形场论的量子场论的描述-那就是CFT部分-在一个更少的维度上。换句话说，这种对应关系就像全息图一样--高维时空投影中的所有信息都编码在低维量子相互作用中。这个“全息原理”首先是由诺贝尔物理学奖获得者杰拉德·t·胡夫特提出的，马尔达塞纳的ADS/CFT通信提供了第一幅关于它如何在特定形式的时空中工作的具体图景。\n在这个观点中，ADS宇宙中看似连续的空间在CFT量子观中表现为纠缠-量子比特的相互依赖。马尔达塞纳说，在这里，“时空的出现应该发生在拥有大量高度纠缠和高度相互作用的量子比特的系统中。”换句话说，量子纠缠可以产生一个似乎有引力的时空。你可能会说，重力是由量子效应产生的。\n这一切与黑洞有什么关系？黑洞信息悖论的问题是，扔进黑洞的信息会发生什么情况。ADS/CFT通信是提出的一种解决方案的关键组成部分，因为它提供了量子纠缠可以将信息印记在Hawking辐射上并防止其不可挽回地丢失的手段。2004年，霍金自己解释了，假设ADS/CFT猜想是正确的，我们可以通过捕捉黑洞在整个生命周期中在完全蒸发之前辐射的每一个霍金光子来恢复这一信息。正如加州大学伯克利分校的诺曼·姚(Norman姚)所描述的那样，“如果你是上帝，你收集了所有这些霍金光子，原则上你可以做一些不虔诚的计算来重新提取[每个被吞噬的]量子比特中的信息。”\n直到黑洞蒸发的中点之前，黑洞内部的信息都是隐藏的。然而，在这一点之后，黑洞开始在其霍金辐射中揭示其信息。所以你要等很长一段时间才能开始做这件事。根据阿尔伯塔大学物理学家唐·佩奇在1993年的一项论证，它将以恒定的速度逐渐渗出。\n但在2007年，帕特里克·海登(Patrick Hayden)和约翰·普雷斯基尔(John Preskill)修改了这张图片，他们指出，事实上，在中途之后，信息出现的速度比这更快。姚说，奇怪的是，一旦黑洞蒸发了一半，扔进黑洞的任何进一步的量子信息都会“从字面上反弹回来”。这是因为到那个阶段，黑洞已经与它已经发射的霍金辐射变得如此量子纠缠，以至于它吞噬的任何更多信息都会立即有效地登记在它所发射的任何进一步的辐射中。海登和普雷斯基尔说，黑洞就像一面“信息镜子”。\n海登和普雷斯基尔偶然发现了黑洞热力学和量子信息理论之间的联系，这种联系引发了一种称为量子加扰的现象。这种效应非常类似于热量在达到平衡时随时间在系统中均匀分布的方式，这一过程被称为热化。姚说，想象一下，创造两个包含局部能量的系统，然后让它们接触。能量将在这两个系统中传播，直到“它们失去了初始启动状态的记忆，你再也无法区分它们。”\n加扰在本质上是相同的，但要强得多：即使您不仅查看本地，而且查看两个系统之间的相关性，您也无法区分两个加扰的系统。“争抢是一种很强的热化形式，”姚说。“这是量子信息的离域。”\n“这是对洗牌的量子模拟，”谷歌和斯坦福大学的物理学家亚当·布朗(Adam Brown)说。“如果你从一副有序的纸牌开始，如果你看着纸牌，说里面没有明显的图案，你就会说它是洗过的。这并不等同于说它完全是随机的-它非常混乱，你必须非常老练才能知道它不是随机的。这比真正的随机性来得快得多。“。\n“几乎任何多体量子系统最终都会陷入混乱，”他补充道。但是黑洞是特别的。就像一副牌洗牌的速率取决于你使用的技术一样，系统的加扰速率取决于该系统中粒子如何相互作用的细节。这些细节由一个称为哈密顿量的函数进行数学描述。事实证明，支配黑洞的哈密顿量意味着它们以尽可能快的速度扰乱量子信息。\n这就是海登和普雷斯基尔得出结论的原因。黑洞的行为就像快速的量子加扰电路，所以一旦它们与自己的霍金辐射充分纠缠在一起，进入黑洞的任何新信息都会很快出现在这种辐射中。\n尽管如此，你必须等到黑洞和它的霍金辐射足够纠缠-也就是说，直到它蒸发了一半-才能发生这种情况。\n但有一种更快的方法来获取信息：最大限度地将黑洞与其他东西缠绕在一起-比如另一个黑洞。这是哈佛大学的高平和丹尼尔·贾弗里斯(Daniel Jafferis)在2016年提出的建议，他们与新泽西州普林斯顿高级研究所的阿伦·沃尔(Aron Wall)合作。他们说，如果你能以这种方式纠缠一对黑洞，那么被第一个黑洞吞噬的量子比特就会登记在另一个黑洞中。高和他的同事展示了如何通过在黑洞之间增加进一步的耦合，使它们之间的量子信息传输与称为量子隐形传态的过程正式相同。在这里，两个粒子之间的纠缠被用来将其中一个粒子的量子态转移到另一个粒子上。目标粒子最终看起来与最初的粒子一模一样-事实上，没有任何有意义的方法来说它不是同一个粒子，从空间的一个部分消失，在另一个空间重新组成。姚说，对于信息来说，他们的纠缠就像一座桥梁。\n姚解释说，具有黑洞动力学的系统“允许在尽可能快的时间尺度上进行隐形传态。”这是因为进入其中一个黑洞的任何信息都会很快在它的所有粒子之间共享-因此，由于与第二个黑洞的纠缠，它也会很快与那个黑洞共享。\n量子隐形传态已经被实验证明了很多次，它已经被用来在量子设备之间发送安全加密的信息。然而，它不允许你立即发送信息，因为信号不能被解码-它看起来是随机的-没有一些经典机制发送的额外信息，这意味着它不能以比光速更快的速度传播。海登的前博士生内扎米解释说，这就是为什么像高和同事们提出的那样的方案需要一些额外的手段，而不是纠缠，来耦合黑洞。“耦合的作用是发送重要的经典数据，在纠缠的帮助下，将信号从一个黑洞传送到另一个黑洞，”他说。\n至少，这是量子信息理论家对这一过程的看法。但根据ADS/CFT的通信，在基于广义相对论的描述中，由纠缠产生的黑洞之间的通道等同于连接它们的时空中的虫洞。在这个视图中，量子比特进入一个黑洞，然后沿着虫洞行进到另一个黑洞。\n通常情况下，这样的虫洞--虽然广义相对论允许--被认为是不可穿越的：你实际上不可能将任何东西送到它们下面。但高，贾弗里斯和沃尔展示了如何使用量子信息理论和隐形传态(在ADS/CFT图片中)来制造一个可穿越的虫洞。\n如果ADS/CFT的通信是真实的，它允许观点的根本改变。原则上，研究人员可以通过以正确的方式纠缠量子电路，并在它们之间传送量子比特，来构建完全等同于虫洞连接的黑洞的系统。\n内扎米和布朗与斯坦福大学的伦纳德·苏斯金德、马里兰大学的布莱恩·斯文格尔和帕克学院的其他人一起工作，现在已经就如何做到这一点提出了一个切实可行的建议。他们说，要让一组量子粒子在这种情况下表现得像黑洞，需要给它们的相互作用分配一个哈密顿量，使它们成为非常快速的加扰器。\n事实上，量子加扰只是在去年才第一次明确地展示了这一点。马里兰州的克里斯托弗·门罗(Christopher Monroe)和他的同事们采纳了姚和他的同事贝尼·吉田贝尼(Beni Yoshida)的一项实验提议，创建了一个由量子态被纠缠的电子陷阱离子组成的量子电路。在像这样的真实系统中，加扰可能很难在其他不受控制的过程中被发现，比如经典噪声，特别是量子退相干。像加扰一样，退相干是由粒子的相互作用和随之而来的纠缠而产生的-但在这种情况下，它们是量子系统自身周围环境中的粒子。随着消相干的进行，信息泄露到环境中，基本上就永远丢失了。退相干是不可能完全避免的，这使得它成为量子计算机的头疼问题：在退相干将信息随机化之前，任何量子计算都必须完成。\n通常情况下，退相干往往比混乱发生得更快，因此很难清楚地看到后者。门罗的团队想出了如何使用量子隐形传态算法来区分这两个离子，该算法编码在一个电路中，该电路由七个耦合的镱离子组成，每个离子充当一个量子比特。这个过程--实际上是量子计算--将单个量子比特从一行的一端传送到另一端。为了测量扰乱的速度，研究人员比较了算法向前和向后进化时的隐形传送过程(就好像它发生在“时间上的倒退”)。在没有加扰的情况下，这两个过程保持相关。但随着加扰将最初编码在某些量子比特中的信息分散在其他信息之间，正向和反向计算的结果变得不那么相关：系统已经从初始状态改变，因此隐形传态不能精确逆转。门罗说：“如果它们是相关的，就不会发生太多事情。”“但如果出现混乱，相关性就会降至零。”这就是随着时间的推移他们所看到的。\n布朗和他的同事们现在建议，与这些非常相似的量子电路可以用来构建一个简单的类似于高、贾弗里斯和沃尔设想的情况，用来构建一个可以传送量子比特的可穿越虫洞。在他们想象的版本中，两个黑洞中的每一个都只由几个量子比特组成，所有这些量子比特都是最大限度地相互纠缠在一起的。他们的协议在这两组量子比特之间引入了进一步的相互作用，这是高和他的同事完成隐形传态过程所需的额外通道。\n直觉告诉我们，电磁陷阱中的一小撮离子完全不像一颗坍塌的恒星，没有光线可以逃脱。但这里有一件令人费解的事情：如果ADS/CFT的通信是正确的，那么这些实验将不仅仅是实验室中的黑洞模拟。这两种类型的系统将是完全相等的。在广告空间中，耦合离子正是(非常小的)黑洞的样子。这是一个例证，如果马尔达塞纳的猜想告诉我们一些关于宇宙构成方式的真实情况，我们关于事物是什么的直觉将会被打破。\n去年10月，在与马里兰州同事门罗的一次聊天中，斯文格尔描述了他的虫洞般的量子电路。门罗认识到，这或多或少就是他的团队用来演示量子加扰的那种电路。尽管门罗已经知道海登和普雷斯基尔关于利用量子纠缠从黑洞中恢复量子信息的想法，但他说，他的团队选择他们的电路只是为了证明量子加扰，而没有真正考虑到与引力的联系。\n如果Swingle和他的同事设计的电路真的可以建造，那么寻找他们预测的效果应该是相当直截了当的。这能做到吗？“当然可以，”门罗说。人们期待看到的是，首先，馈送到两个黑洞型量子比特系统之一的量子比特信息将被扰乱，似乎消失了。但在一段可预测的时间之后，它会在另一组量子比特中再次跳出，解开，跳入虫洞。令人惊讶的不是信息被传递--毕竟这两个系统是耦合的。那就是，即使第一个“黑洞”完全扰乱了信息，信息也会以可读的形式重新出现，不需要解码。\n在这个阶段，使用量子电路的实验可能只希望创造一个我们居住的时空的简化玩具模型，用广义相对论来描述。马尔达塞纳说：“如果我们的目标是建立一个受爱因斯坦方程式支配的时空，那么目前已知的唯一能产生这种时空的系统是非常特殊的，很可能很难在实验室里制造出来。”但他补充说，“这些作者的目标是创建一个足够复杂的系统，使其具有某些引力特性(虽然不是全部)，但也要足够简单，以便能够实际实现。”\n如果这样的实验结果证实了预测，那么ADS/CFT的对应关系会被证明是正确的吗？那要看你的观点了。在这些量子电路的理论分析中，没有什么是与标准量子理论完全一致的。但用引力语言来描述正在发生的事情更简单、更经济：就像沿着虫洞的一段话。布朗说：“虽然你可以用薛定谔方程来解释这一切，但有一个简单得多的解释，那就是引用黑洞。”\n斯温格尔问道，寻找这样的经济，并为这种描述赋予一个有意义的现实，难道不是物理学的目标吗？例如，你可以纯粹用电子波函数来描述超导--另一种量子现象。但使用“准粒子”图片要简单得多：考虑所谓的库珀纠缠电子对。我们并不质疑这些准粒子的真实性--那么为什么我们要否认量子比特虫洞的真实性呢？\n门罗说，出于这个原因，“从对原子的观察中，我们可能会了解到一些与原子无关的东西”--即黑洞。使用多量子比特系统的更雄心勃勃的实验版本可能会揭示时空本身的有趣特性。马尔达塞纳说：“如果这些实验能够完成，就有可能创造出越来越复杂的纠缠系统，从而测试量子系统中时空出现的更多方面。”内扎米补充道：“这类复杂的实验甚至可以提供弦理论数学的实验探索。”\n至于这种实验的前景，斯文格尔说，他正在与各种实验者商谈将量子加扰电路改造成对这些遥远想法的直接测试，尽管具体计划尚未出现。但这些对话本身在某种程度上是一个里程碑。布朗说：“在这里，我们有来自量子引力的理论物理学家与实验原子物理学家交谈。”“从历史上看，他们之间的距离就像物理系中的任何两个群体一样远。所以这是一个新的t\n.", "note_en": "As experimental proposals go, this one certainly doesn’t lack ambition. First, take a black hole. Now make a second black hole that is quantum entangled with it, which means that anything that happens to one of the black holes will seem to have an effect on the other, regardless of how far apart they are.\n The rest sounds a bit easier, but a lot weirder. Feed some information into the first black hole, encoded in a quantum particle. As it falls beyond the event horizon — the point beyond which not even light can escape — the information is rapidly smeared throughout the black hole and is scrambled seemingly beyond recall.\n But have patience — if you’ve linked the two black holes in the right way, after a short wait the quantum information will pop out of the second one, fully refocused into readable form. To get there, it will have traveled through a shortcut in space-time that links the two objects — a wormhole.\n That, at least, is what physicists have predicted. Now a group led by  Sepehr Nezami of the California Institute of Technology has suggested how to actually perform this extraordinary experiment — and they are beginning to work with collaborators to put the idea to the test.\n If the predictions are borne out, the work may offer clues about where to look for the most elusive theory in physics: one that unites quantum mechanics with the theory of general relativity that describes gravity. And, for good measure, it would support the idea that space-time is not the fundamental backdrop against which the universe plays out but is itself woven from the interconnections between particles described by quantum entanglement.\n  This experiment, as you might have guessed, doesn’t require black holes in the usual sense, meaning massive stars that have collapsed by their own gravity to an infinitesimally small volume. The researchers say that it could be done on a lab benchtop using just a few atoms or ions. All the same, the idea arises out of theoretical research on astrophysical black holes that has struggled to resolve a deep and unsettling question: Do these all-devouring monsters destroy information irreversibly?\n It’s widely thought that information, like energy, should obey a conservation rule: The total amount of information in the universe will always stay the same. That’s what quantum mechanics seems to imply: The wave functions that describe quantum entities always evolve smoothly in an information-conserving way and can’t be suddenly snuffed out.\n But black holes do seem to remove information from the universe. If, say, a quantum bit, or “qubit,” falls into a black hole, it can no longer be observed from outside the event horizon.\n  One possible resolution of this “ black hole information paradox” can be found within the radiation that black holes emit from their event horizons. Hawking radiation, predicted by Stephen Hawking in the 1970s, will cause a black hole to lose gravitational energy — and thus mass. In effect, black holes are not eternal. They slowly evaporate.\n Hawking initially believed that even if a black hole fully evaporated, the information it had consumed would remain lost forever. But an idea known as the AdS/CFT correspondence shows how the photons of Hawking radiation might be able to encode information about the interior of the black hole, thereby carrying that information back out into the universe at large.\n The AdS/CFT correspondence was postulated by the theoretical physicist  Juan Maldacena in 1997, and it’s widely regarded as one of the most promising directions in which to pursue theories of quantum gravity. It suggests that the physical structure of space-time in, say, four dimensions is equivalent to the operation of a quantum theory at a three-dimensional boundary.\n This connection is strange, deep and surprising. It says that if you construct a space-time with a particular kind of curvature (and thus gravity) known as an anti-de Sitter space — that’s the AdS part — the mathematical description turns out to be equivalent to the description of a kind of quantum field theory called a conformal field theory — that’s the CFT part — in one fewer dimension. In other words, the correspondence works like a hologram — all the information in the higher-dimensional space-time projection is encoded within the lower-dimensional quantum interactions. This “holographic principle” was first proposed by the physics Nobel laureate Gerard ’t Hooft, and Maldacena’s AdS/CFT correspondence provided the first concrete picture of how it might work for a particular form of space-time.\n In this view, what looks like continuous space in the AdS universe manifests in the CFT quantum view as entanglement — the interdependence of quantum bits. Here, said Maldacena, “the emergence of space-time is supposed to happen in systems with a large number of qubits that are highly entangled and highly interacting.” In other words, quantum entanglement can produce a space-time that seems to have gravity in it. Gravity, you might say, is spun from quantum effects.\n  What does all this have to do with black holes? The black hole information paradox asks what happens to the information that gets tossed into a black hole. The AdS/CFT correspondence is a key component of one proposed solution, since it supplies the means by which quantum entanglement could imprint the information on Hawking radiation and prevent it from being irrevocably lost. In 2004, Hawking himself explained how, assuming the AdS/CFT conjecture is true, we could recover this information by capturing every single Hawking photon a black hole radiates over its entire lifetime before fully evaporating. As  Norman Yao of the University of California, Berkeley described it, “If you were God and you collected all these Hawking photons, there is in principle some ungodly calculation you can do to re-extract the information in [each swallowed] qubit.”\n Up until the halfway point of a black hole’s evaporation, the information inside it remains concealed. After that point, however, the black hole starts to reveal its information in its Hawking radiation. So you have a long wait before you can start to get at it. And according to an argument made in 1993 by the physicist  Don Page of the University of Alberta, it will then seep out gradually, at a constant rate.\n But in 2007,  Patrick Hayden and  John Preskill revised this picture by showing that, in fact, after the halfway point the information emerges more rapidly than that. Weirdly enough, once the black hole is half-evaporated, any further quantum bit of information tossed into it “literally bounces right back,” said Yao. This is because the black hole has by that stage become so quantum-entangled with the Hawking radiation it has already emitted that any more information it swallows is effectively registered at once in any further radiation it emits. The black hole, Hayden and Preskill said, then acts like an “information mirror.”\n  Hayden and Preskill had hit on a connection between black hole thermodynamics and quantum information theory that invokes a phenomenon called quantum scrambling. This effect is rather like the way heat gets evenly distributed in a system over time as it comes to equilibrium, a process called thermalization. Imagine, said Yao, creating two systems containing localized pockets of energy and then bringing them into contact. The energy will spread throughout both systems until “they have lost the memory of that initial starting state, and you can no longer distinguish them.”\n Scrambling is the same in essence, but much stronger: You can’t distinguish two scrambled systems even if you look not just locally but at correlations across both systems. “Scrambling is a very strong form of thermalization,” said Yao. “It is the delocalization of quantum information.”\n “It’s a quantum analogue of shuffling,” said  Adam Brown, a physicist at Google and Stanford University. “If you start off with an ordered pack of cards, you say it’s shuffled if you look at the cards and say there is no obvious pattern left in them. This is not the same as saying that you’ve made it entirely random — it’s sufficiently mixed up that you have to be very sophisticated to know that it’s not random. It happens much sooner than genuine randomness.”\n  “Almost any many-body quantum system is eventually going to scramble,” he added. But black holes are special. Just as the rate at which a pack of cards gets shuffled depends on the technique you use, the scrambling rate of a system depends on the details of how the particles in that system interact. These details are described mathematically by a function called a Hamiltonian. And it turns out that the Hamiltonian governing black holes means they scramble quantum information at the fastest rate possible.\n And that’s what leads to Hayden and Preskill’s conclusion. Black holes act like fast quantum-scrambling circuits, so once they are sufficiently entangled with their own Hawking radiation, any new information entering them shows up very quickly in that radiation.\n All the same, you’ll have to wait until the black hole and its Hawking radiation are entangled enough — that is, until it is half evaporated — before this happens.\n But there’s a faster alternative for getting at the information: Entangle the black hole maximally with something else — like another black hole. That’s the  proposal put forward in 2016 by  Ping Gao and  Daniel Jafferis of Harvard University, working with  Aron Wall at the Institute for Advanced Study in Princeton, New Jersey. If you could entangle a pair of black holes this way, they said, then a qubit swallowed by the first black hole would be registered in the other. Gao and colleagues showed how, by adding a further coupling between the black holes, you could make the transfer of quantum information between them formally identical to the process called quantum teleportation. Here the entanglement between two particles is used to transfer the quantum state of one of them to the other. The target particle ends up looking identical to the initial one — in fact, there is no meaningful way to say it is not the same particle, vanished from one part of space and reconstituted in another. “Their entanglement acts like a bridge” for the information, said Yao.\n  Systems with the dynamics of black holes, Yao explained, “allow teleportation on the fastest possible timescale.” That’s because any information that enters one of them is quickly shared among all its particles — and thus, because of the entanglement with the second black hole, it’s shared quickly with that one too.\n Quantum teleportation has been demonstrated experimentally many times, and it is already being used to send securely encrypted information between quantum devices. It does not, however, allow you to send messages instantly, because the signal can’t be decoded — it looks random — without additional information sent by some classical mechanism, which means it can’t travel faster than light. This, explained Nezami, a former doctoral student of Hayden’s, is why a scheme like the one proposed by Gao and colleagues requires some additional means, beyond entanglement, of coupling the black holes. “The role of the coupling is to send the essential classical data, which, with the aid of entanglement, teleports the signal from one black hole to another,” he said.\n This, at least, is how a quantum information theorist would view the process. But according to the AdS/CFT correspondence, the channel between the black holes created by entanglement is equivalent, in a description based on general relativity, to a wormhole in space-time that connects them. In this view, qubits enter one black hole and travel down the wormhole to the other.\n Normally, such wormholes — while permitted by general relativity — have been thought to be non-traversable: You couldn’t actually send anything down them. But Gao, Jafferis and Wall showed how quantum information theory and teleportation could be used (within the AdS/CFT picture) to make a wormhole that is traversable.\n  If the AdS/CFT correspondence is real, it allows a radical change in perspective. In principle, researchers could construct systems entirely equivalent to wormhole-connected black holes by entangling quantum circuits in the right way and teleporting qubits between them.\n Nezami and Brown, working with  Leonard Susskind of Stanford,  Brian Swingle of the University of Maryland, College Park, and others have now  come up with a practical proposal for how to do that. What you need to make a group of quantum particles act like a black hole in this context, they say, is to assign their interactions a Hamiltonian that makes them very rapid scramblers.\n Quantum scrambling was in fact only  demonstrated unambiguously for the first time last year. Adopting an experimental  proposal by Yao and his colleague  Beni Yoshida,  Christopher Monroe at Maryland and his colleagues created a quantum circuit made from electrically trapped ions whose quantum states had been entangled. In real systems like this, scrambling can be hard to spot among other unruly processes such as classical noise and — in particular — quantum decoherence. Like scrambling, decoherence arises from the interaction and consequent entanglement of particles — but in this case, they are particles in the environment surrounding the quantum system itself. As decoherence proceeds, the information leaks into the environment and is essentially lost for good. Decoherence is impossible to avoid entirely, which makes it the bugbear of quantum computers: Any quantum calculation has to be completed before decoherence randomizes the information.\n  Usually, decoherence tends to happen faster than scrambling, so it has been very hard to see the latter clearly. Monroe’s team figured out how to distinguish the two using a quantum teleportation algorithm encoded in a circuit made from seven coupled ytterbium ions held in a row, each acting as a single qubit. The process — a quantum computation, in effect — teleported a single qubit from one end of the row to the other. To measure the rate of scrambling, the researchers compared the teleportation process as the algorithm evolved forward and then in reverse (as if it were happening “backward in time”). Without scrambling, the two processes remain correlated. But as scrambling disperses the information initially encoded in certain qubits among the others, the outcomes of the forward and backward computations become less correlated: The system has changed from its initial state, and so the teleportation can’t be precisely reversed. “If they’re correlated, not much is happening,” said Monroe. “But if there’s scrambling, the correlation goes to zero.” That’s what they saw as time progressed.\n Brown and colleagues now suggest that quantum circuits very much like these could be used to construct a simple analogue of the situation envisioned by Gao, Jafferis and Wall for a traversable wormhole that could teleport a qubit. In the version they imagine, each of the two black holes is made up of just a few qubits, all of which are maximally entangled with one another. Their protocol introduces a further interaction between these two groups of qubits, which acts as the additional channel needed by Gao and colleagues to complete the teleportation process.\n Intuition tells us that a handful of ions in an electromagnetic trap is nothing like a collapsed star from which no light can escape. But here’s the mind-bending thing: If the AdS/CFT correspondence is right, then these experiments would be more than a laboratory analogue of a black hole. The two types of systems would be entirely equivalent. The coupled ions are precisely what, in an AdS space, a (very tiny) black hole would look like. It’s an illustration of how, if Maldacena’s conjecture tells us something real about the way the universe is constituted, our intuitions about  what things are would be shattered.\n  In a chat with his Maryland colleague Monroe last October, Swingle described his wormhole-like quantum circuit. Monroe recognized that it was more or less precisely the kind of circuit his team had used to demonstrate quantum scrambling. Although Monroe had been aware of Hayden and Preskill’s ideas on using quantum entanglement to recover quantum information from a black hole, he said that his team had chosen their circuit simply to demonstrate quantum scrambling, without really thinking about the connection to gravity.\n  If the circuit devised by Swingle and colleagues can indeed be built, it should be rather straightforward to look for the effect they predict. Can that be done? “Absolutely,” said Monroe. What one would expect to see is that, first, a quantum bit of information fed into one of the two black-hole-type qubit systems would be scrambled and appear to vanish. But after a predictable amount of time, it would pop out again, unscrambled, in the other group of qubits, having jumped down the wormhole. The surprise is not so much that the information is transferred — the two systems are coupled, after all. It’s that the information reappears in a readable form, needing no decoding, even though the first “black hole” fully scrambled it.\n At this stage, experiments using quantum circuits can hope to create only a simplified toy model of the space-time we inhabit, described by general relativity. “If the goal is to get a space-time governed by Einstein’s equations,” said Maldacena, “then the only systems that are known to produce it are very special and probably hard to make in the lab.” But he adds that “the goal of these authors is to create a system complex enough to have some features of gravity (though not all), but simple enough that it could actually be done.”\n If the results of such an experiment bear out the predictions, will the AdS/CFT correspondence be proved correct? That depends on your point of view. There is nothing in the theoretical analysis of these quantum circuits that isn’t fully consistent with standard quantum theory. But it is simpler and more economical to describe what is going on in the language of gravity: as a passage along a wormhole. “While you could explain it all by using the Schrödinger equation, there’s a much simpler explanation that invokes black holes,” said Brown.\n And isn’t it the goal of physics, asks Swingle, to look for such economy, and to ascribe a meaningful reality to that description? You could, for example, describe superconductivity — another quantum phenomenon — purely in terms of electron wave functions. But it’s much simpler to use a “quasiparticle” picture: to consider the so-called Cooper pairs of entangled electrons. We don’t question the reality of these quasiparticles — and so why should we deny the reality of qubit wormholes?\n  For this reason, said Monroe, “from observations of atoms, we might learn about something that has nothing to do with atoms” — namely, black holes. And more ambitious versions of the experiment using many-qubit systems could reveal interesting properties of space-time itself. “If these experiments can be done, it might become possible to create more and more complex entangled systems that could test more aspects of the emergence of space-time from quantum systems,” said Maldacena. Added Nezami: “A sophisticated experiment of this type could even provide an experimental probe of the mathematics of string theory.”\n As to the prospects for such an experiment, Swingle said that he is talking to various experimentalists about adapting quantum-scrambling circuits into a direct test of these far-out ideas, although concrete plans have yet to emerge. But the conversations themselves are something of a milestone. “Here we have theoretical physicists from quantum gravity talking to experimental atomic physicists,” said Brown. “Historically they have been about as far apart as any two groups in a physics department. So this is a new t\n......", "posttime": "2020-07-20 14:30:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "操纵,reveal,黑洞", "title": "虫洞揭示了一种在实验室操纵黑洞信息的方法", "title_en": "Wormholes Reveal a Way to Manipulate Black Hole Information in the Lab", "transed": 1, "url": "https://www.quantamagazine.org/wormholes-reveal-a-way-to-manipulate-black-hole-information-in-the-lab-20200227/", "via": "", "real_tags": ["操纵", "reveal", "黑洞"]}]