[{"category": "", "categoryclass": "", "imagename": "dd36227cf9a1f90767a7e4aed5489dae.png", "infoid": 1016406, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "LibreOffice7.0：有史以来最好的自由/开源软件办公套件的新主要版本在所有操作系统和平台上都可用，并提供了重要的新功能。\n柏林，2020年8月5日-LibreOffice项目宣布推出LibreOffice 7.0，这是一个新的主要版本，提供了重要的新功能：支持OpenDocument Format(ODF)1.3；支持Skia图形引擎和基于Vulkan GPU的加速以实现更好的性能；并仔细改进了与Docx、xlsx和pptx文件的兼容性。\n支持ODF 1.3。OpenDocument是LibreOffice原生的开放和标准化的办公文档格式，最近作为OASIS技术委员会规范更新到了1.3版。最重要的新功能是文档的数字签名和基于OpenPGP的XML文档加密，并在更改跟踪等方面进行了改进，并在首页、文本、数字和图表中的元素描述方面提供了额外的详细信息。ODF1.3特性的开发资金来自对文档基金会的捐赠。\nSkiA图形引擎和基于Vulkan GPU的加速。多亏了AMD的赞助，Skia图形引擎已经实现，并且现在是Windows上的默认引擎，以获得更快的性能。SkiA是一个开源的2D图形库，它提供了可在各种硬件和软件平台上运行的通用API，可用于绘制文本、形状和图像。Vulkan是新一代图形和计算API，可高效、跨平台地访问现代GPU。\n更好地兼容Docx、xlsx和pptx文件。DOCX现在以本机2013/2016/2019模式保存，而不是2007兼容模式，以基于相同的Microsoft方法提高与多个版本的MS Office的互操作性。现在可以将图纸名称超过31个字符的文件导出为xlsx文件，同时还可以在xlsx中导出复选框。打开带有形状的导出xlsx文件时，已解决“无效内容错误”消息。最后，对pptx导入/导出过滤器进行了改进。LibreOffice在办公套件领域提供了最高级别的兼容性，从对OpenDocument Format(ODF)的本机支持(具有比专有格式更好的安全性和互操作性功能)到对Docx、xlsx和pptx文件的近乎完美的支持。此外，LibreOffice包含许多遗留文档格式的过滤器，因此是市场上最好的互操作性工具。\nLibreOffice7.0的新功能是由一个庞大的代码贡献者社区开发的：74%的提交来自咨询委员会中的公司雇佣的开发人员，比如Collabora、Red Hat和CIB，以及其他几个组织，26%来自个人志愿者。\n此外，还有一个由个人志愿者组成的全球社区，负责其他基本活动，如质量保证、软件本地化、用户界面设计和用户体验、编辑帮助内容和文档，以及倡导自由软件和开放文档标准。\n在Youtube：https://www.youtube.com/watch?v=XusjjbBm81s和PeerTube：https://tdf.io/lo70peertube上都可以找到一段总结LibreOffice7.0的顶级新功能的视频\n基于LibreOffice技术的产品可用于所有主流桌面操作系统(Windows、MacOS、Linux和ChromeOS)、云和移动平台。它们由文档基金会和为软件开发做出贡献的生态系统公司发布。\nLibreOffice7.0代表了开源办公套件功能的前沿，因此面向技术爱好者、早期采用者和高级用户。Document Foundation不为用户提供任何技术支持，尽管他们可以从邮件列表和Ask LibreOffice网站上的其他用户那里获得帮助：https://ask.libreoffice.org。\n对于主要目标是个人工作效率的用户，因此他们更喜欢经过更多测试和错误修复的版本，而不是新功能，Document Foundation维护了LibreOffice 6.4系列，其中包括几个月的后端修复。当前版本为LibreOffice 6.4.5。\n对于企业级部署，tdf强烈建议从生态系统合作伙伴之一采购libreoffice，以获得长期支持的版本、专用帮助、自定义新功能和其他好处，包括sla(服务级别协议)：https://www.libreoffice.org/download/libreoffice-in-business/.。生态系统合作伙伴所做的工作是LibreOffice技术不可或缺的一部分。\n对于从专有办公套件和培训的迁移，专业支持应来自认证的专业人员，他们提供增值服务，将社区的覆盖范围扩展到企业界，并为CIO和IT经理提供与专有产品一致的解决方案。参考页面：https://www.libreoffice.org/get-help/professional-support/.。\n事实上，LibreOffice-由于其成熟的代码库、丰富的功能集、对开放标准的强大支持、出色的兼容性以及来自认证合作伙伴的长期支持选项-代表着希望重新控制其数据并将自己从供应商束缚中解脱出来的企业的理想解决方案。\nLibreOffice7.0可立即从以下链接获得：https://www.libreoffice.org/download/.。专有操作系统的最低要求是Microsoft Windows 7 SP1和Apple MacOS 10.12。最新的LibreOffice online源代码的内部版本可以从tdf：https://hub.docker.com/r/libreoffice/online/以Docker镜像的形式获得。\n适用于安卓和iOS的基于LibreOffice技术的产品在这里列出：https://www.libreoffice.org/download/android-and-ios/，，而用于App Store和ChromeOS的产品在这里列出：https://www.libreoffice.org/download/libreoffice-from-microsoft-and-mac-app-stores/\nLibreOffice用户、自由软件倡导者和社区成员可以通过在https://www.libreoffice.org/donate上捐款来支持文档基金会。\n[1]LibreOffice7.0新特性的更全面列表可以在发行说明维基页面上找到：https://wiki.documentfoundation.org/ReleaseNotes/7.0。\n带有新闻稿以及高分辨率图片和屏幕截图的新闻工具包可在此处获得：https://tdf.io/lo70presskit", "note_en": "LibreOffice 7.0: the new major release of the best FOSS office suite ever is available on all OSes and platforms, and provides significant new features\n Berlin, August 5, 2020 – The LibreOffice Project announces the availability of LibreOffice 7.0, a new major release providing significant new features: support for OpenDocument Format (ODF) 1.3; Skia graphics engine and Vulkan GPU-based acceleration for better performance; and carefully improved compatibility with DOCX, XLSX and PPTX files.\n Support for ODF 1.3. OpenDocument, LibreOffice’s native open and standardised format for office documents, has recently been updated to version 1.3 as an OASIS Technical Committee Specification. The most important new features are digital signatures for documents and OpenPGP-based encryption of XML documents, with improvements in areas such as change tracking, and additional details in the description of elements in first pages, text, numbers and charts. The development of ODF 1.3 features has been funded by donations to The Document Foundation.\n Skia graphics engine and Vulkan GPU-based acceleration. The Skia graphics engine has been implemented thanks to sponsorship by AMD, and is now the default on Windows, for faster performance. Skia is an open source 2D graphics library which provides common APIs that work across a variety of hardware and software platforms, and can be used for drawing text, shapes and images. Vulkan is a new-generation graphics and compute API with high-efficiency and cross-platform access to modern GPUs.\n Better compatibility with DOCX, XLSX and PPTX files. DOCX now saves in native 2013/2016/2019 mode, instead of 2007 compatibility mode, to improve interoperability with multiple versions of MS Office, based on the same Microsoft approach. Export to XLSX files with sheet names longer than 31 characters is now possible, along with exporting checkboxes in XLSX. The “invalid content error” message was resolved when opening exported XLSX files with shapes. Finally, there were improvements to the PPTX import/export filter. LibreOffice offers the highest level of compatibility in the office suite arena, starting from native support for the OpenDocument Format (ODF) – with better security and interoperability features over proprietary formats – to almost perfect support for DOCX, XLSX and PPTX files. In addition, LibreOffice includes filters for many legacy document formats, and as such is the best interoperability tool in the market.\n           LibreOffice 7.0’s new features have been developed by a large community of code contributors: 74% of commits are from developers employed by companies sitting in the Advisory Board, such as Collabora, Red Hat and CIB, plus several other organizations, and 26% are from individual volunteers.\n In addition, there is a global community of individual volunteers taking care of other fundamental activities, such as quality assurance, software localization, user interface design and user experience, editing of help content and documentation, along with free software and open document standards advocacy.\n A video summarizing the top new features in LibreOffice 7.0 is available on YouTube:  https://www.youtube.com/watch?v=XusjjbBm81s and also on PeerTube:  https://tdf.io/lo70peertube\n Products based on LibreOffice Technology are available for all major desktop operating systems (Windows, macOS, Linux and ChromeOS), for the cloud and for mobile platforms. They are released by The Document Foundation, and by ecosystem companies contributing to software development.\n  LibreOffice 7.0 represents the bleeding edge in term of features for open source office suites, and as such is targeted at technology enthusiasts, early adopters and power users. The Document Foundation does not provide any technical support for users, although they can get help from other users on mailing lists and the Ask LibreOffice website:  https://ask.libreoffice.org\n For users whose main objective is personal productivity and therefore prefer a release that has undergone more testing and bug fixing over the new features, The Document Foundation maintains the LibreOffice 6.4 family, which includes some months of back-ported fixes. The current version is LibreOffice 6.4.5.\n  For enterprise-class deployments, TDF strongly recommends sourcing LibreOffice from one of the ecosystem partners, to get long-term supported releases, dedicated assistance, custom new features and other benefits, including SLA (Service Level Agreements):  https://www.libreoffice.org/download/libreoffice-in-business/. The work done by ecosystem partners is an integral part of LibreOffice Technology.\n For migrations from proprietary office suites and training, professional support should be sourced from certified professionals who provide value-added services which extend the reach of the community to the corporate world, and offer CIOs and IT managers a solution in line with proprietary offerings. Reference page:  https://www.libreoffice.org/get-help/professional-support/.\n In fact, LibreOffice – thanks to its mature codebase, rich feature set, strong support for open standards, excellent compatibility and long-term support options from certified partners – represents the ideal solution for businesses that want to regain control of their data and free themselves from vendor lock-in.\n  LibreOffice 7.0 is immediately available from the following link:  https://www.libreoffice.org/download/. Minimum requirements for proprietary operating systems are Microsoft Windows 7 SP1 and Apple macOS 10.12. Builds of the latest LibreOffice Online source code are available as Docker images from TDF:  https://hub.docker.com/r/libreoffice/online/\n LibreOffice Technology based products for Android and iOS are listed here:  https://www.libreoffice.org/download/android-and-ios/, while for App Stores and ChromeOS are listed here:  https://www.libreoffice.org/download/libreoffice-from-microsoft-and-mac-app-stores/\n LibreOffice users, free software advocates and community members can support The Document Foundation with a donation at  https://www.libreoffice.org/donate\n  [1] A more comprehensive list of LibreOffice 7.0 new features is available on the Release Notes wiki page:  https://wiki.documentfoundation.org/ReleaseNotes/7.0\n  The press kit with press release and high-resolution images and screenshots, is available here:  https://tdf.io/lo70presskit", "posttime": "2020-08-05 23:34:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,libreoffice,announcement", "title": "LibreOffice 7.0发布", "title_en": "Announcement of LibreOffice 7.0", "transed": 1, "url": "https://blog.documentfoundation.org/blog/2020/08/05/announcement-of-libreoffice-7-0/", "via": "", "real_tags": ["发布"]}, {"category": "", "categoryclass": "", "imagename": "a4365d2bd1e9377725c90896066ff30b.jpg", "infoid": 1016405, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在网上搜索埃隆·马斯克(Elon Musk)，你会首先找到他的维基百科(Wikipedia)页面。1第一句话如下：\n埃隆·里夫·马斯克·弗里斯(/ˈiːlɒn/；生于1971年6月28日)是一位工程师、工业设计师、技术企业家和慈善家。\n尽管埃隆·马斯克可能取得了很大成就，但他不是一名工程师。作为一名工程师，我花了多年的时间学习，这感觉不对劲。特别是在网上假新闻无处不在的情况下，维基百科应该是一个真实的信息来源。到目前为止，许多人要求将工程师从他的半保护的维基百科第二页中删除或修改，但都无济于事；成名显然伴随着相当一部分的粉丝(或者是粉丝？3)。通过这篇文章，我想让这场争吵在维基百科之外更广为人知，并解释为什么埃隆·马斯克不是一名工程师。\n支持埃隆·马斯克成为工程师的人参考了美国机械工程师协会(ASME)的一篇文章。4在本文中，提供了一本关于马斯克的传记，其中包含以下引述：\n我是一名工程师，所以我做的是工程。这就是我擅长的。\n你已经猜到了，这是埃隆自己的一句话。这就是埃隆成为工程师的由来。但是声称你是一名工程师并不意味着你就是一名工程师，不是吗？同一篇文章甚至在引文上方写道，他没有工程学学位。在引言中，他被称为“实用工程师”。(好的，在以色列，这似乎是一个真正的学位5，但我怀疑埃隆赢得了这个学位)。\n维基百科上的一些编辑认为，因为这篇文章，那些支持撤换或修改的人应该提供推荐信，说明埃隆·马斯克不是工程师。对我来说，这似乎有点倒退了。\n我认为这场争议源于世界各地对工程师的头衔不同对待。在欧洲，工程师往往是一个只有在获得硕士学位后才能授予的头衔。一些司法管辖区对这一头衔的保护程度与医生、律师等不相上下。在美国，你可以成为注册专业工程师，但显然可以自由地称自己为工程师。在英国，公众似乎将工程师等同于汽车修理工或修理工。然而，在我看来，工程师是经过多年培训并获得工程学硕士学位的人。此外，你通常会是某种类型的工程师，而不仅仅是工程师本身。(例如，土木工程师)\n埃隆·马斯克(Elon Musk)攻读了物理学和经济学的本科生。在我看来，这并不意味着你就是一名工程师。但是，即使我们假设埃隆·马斯克会是一名工程师，那么他会是什么类型的呢？他会成为一名机械工程师吗？化学工程师？航空工程师？没有证据表明马斯克确实(部分)设计了他的公司催生的任何创意。正如你可能知道的，他在12.6岁时创造了一款视频游戏，因此他更有可能是一名软件工程师。由于这是一种较新的工程类型，标题似乎受到的保护较少。尽管如此，类似的论点仍然反对马斯克被贴上工程师的标签。有了埃隆出现在社交媒体上，我会给他贴上更多的社会工程师的标签：一个试图影响群体态度和行为的人。\n希望这个例子能提高人们对维基百科上也存在的谬误的认识。(我会把这个例子贴上一个讨论声或呼吁民众的标签：如果很多人相信的话，那就是7)形成你自己的观点，并在下面的评论中自由地分享你的想法。我希望你也参与维基百科的埃隆·马斯克谈话页面。8个。\n我并不反对埃隆·马斯克和他正在执行的任何任务。举这个例子，我只是想指出，维基百科可能并不像它看起来那样客观。考虑到现在很多人(包括我在内)经常只依靠维基百科页面来了解某个主题的更多信息，这可能会产生严重的后果。\n埃隆·马斯克的视频游戏名为Blastar，并被移植到网络上：↩。\n你可以在维基百科(The Referony…)上读到更多关于议论和民众的信息。*↩。\n参与维基百科上关于埃隆·马斯克是不是工程师的讨论--↩", "note_en": "Search online for Elon Musk and one of the first things you will find is his Wikipedia page.  1 The first sentence reads as follows:\n  Elon Reeve Musk  FRS (/ˈiːlɒn/; born June 28, 1971) is an  engineer, industrial designer, technology entrepreneur and philanthropist.\n  Though Elon Musk might have achieved a lot, an engineer he is not. As an engineer myself, who has spent years studying, this does not feel right. Especially with fake news being omnipresent online, Wikipedia should be a factual source of information. So far, many have requested the removal or alteration of  engineer from his semi-protected Wikipedia page  2 to no avail; being famous apparently comes with its fair share of fans (or is it fanboys?  3). With this article I would like to make this quarrel more known outside Wikipedia and explain why Elon Musk is not an  engineer.\n    People in favor of Elon Musk being an engineer refer to an article by the American Society of Mechanical Engineers (ASME).  4 In this article, a biography on Musk is provided that contains the following quote:\n  I’m an engineer, so what I do is engineering. That’s what I’m good at.\n  You have guessed it, this is a quote from Elon himself. This is where Elon being an engineer comes from. But claiming you are an engineer, does not really make you an engineer, does it? The same article even states right above the quote that he holds no engineering degree. And in the introduction he is referred to as  practical engineer. (okay that seems to be an actual degree in Israel  5, but I doubt Elon earned that)\n  Some editors on Wikipedia argue that because of the article, those who favor removal or alteration should provide references that Elon Musk is  not an engineer. That seems to be a bit backwards to me.\n    I believe the controversy stems from the title of engineer being treated differently across the world. Here in Europe,  engineer tends to be a title that you can only carry after earning a master’s degree. Some jurisdictions protect the title as much as  doctor,  lawyer, etc. In the US, you can become a certified  Professional Engineer, but are apparently free to call yourself an engineer. In the UK, the public seems to equate an engineer with a car mechanic or repair man. In my opinion however, an engineer is someone who has gone through years of training and has obtained a master’s degree in engineering. Besides, you would typically be a certain type of engineer, not just an engineer by itself. (for example, a  civil engineer)\n    Elon Musk did an undergraduate in Physics and Economics. This does not make you an engineer in my book. But even if we assume that Elon Musk would be an engineer, then what would be his type? Would he be a mechanical engineer? A chemical engineer? An aerospace engineer? There is no evidence that Musk actually (partly) designed any of the creations his companies spawned. As you might know, he created a video game at age 12.  6 He would be thus more likely be a software engineer. As that is a more recent type of engineering, the title seems to be less protected. Still, similar arguments hold against Musk being labeled engineer. And with Elon’s presence on social media, I would label him more of a social engineer: someone who tries to influence the attitude and behavior of groups.\n      Hopefully this example creates more awareness for fallacies that are also present on Wikipedia. (I would label this example a case of  argumentum ad populum or appeal to the people: if many believe so, it is so  7) Form your own opinions and feel free to share what you think in the comments below. I hope you also participate on Wikipedia’s Elon Musk  Talk page.  8\n    I am not against Elon Musk and whatever mission he is on. With this example, I would just like to point out that Wikipedia might not be as objective as it may appear. Given that many often rely only on Wikipedia pages nowadays (me included) to learn more about a certain topic, this could have serious consequences.\n    Elon Musk’s video game is called   Blastar and it is ported to the web  ↩\n  You can read more about argumentum ad populum on  Wikipedia (the irony…)  ↩\n  Participate in the discussion about Elon Musk being an engineer or not on  Wikipedia  ↩", "posttime": "2020-08-05 23:34:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "埃隆·马斯克,埃隆,musk,工程师", "title": "为什么埃隆·马斯克不是工程师", "title_en": "Why Elon Musk is not an engineer", "transed": 1, "url": "https://www.ietsism.net/why-elon-musk-is-not-an-engineer/", "via": "", "real_tags": ["埃隆·马斯克", "埃隆", "musk", "工程师"]}, {"category": "", "categoryclass": "", "imagename": "580df394c6a74836a84fba1e83a3aa1f.png", "infoid": 1016402, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大家好，我很高兴地宣布，TypeScript网站的下一代版本已经在tyescriptlang.org上推出了。\n新版本的网站是出于一种愿望，即用适合现代微软风格的设计，让Tyescript的文档感觉像它的类型系统一样宽泛。\n为了了解人们想要什么，我们联系了社区，询问他们希望在哪里看到改进，并根据反馈制定了路线图。\n让我们来看看这些要点，并了解一下新的打字网站是如何解决这些问题的。\n我们在6年前就决定了打字稿主页的设计和文案，但从那以后事情发生了很大的变化。TypeScript已经成长起来，并且了解它想要成为什么：JavaScript之上的一个提供强大工具支持的类型层。\n这一重点意味着解释团队如何使用JavaScript标准体，描述DefinitelyTyped如何允许TypeScript向非类型库提供类型，以及教导采用TypeScript不一定是一个全有或全无的选择。\n希望新的主页能让我们更容易理解TypeScript在JavaScript生态系统中的位置。\n此外，重新设计的个人亮点是新的打字标识，它更贴近地反映了人们在野外使用的东西：\n完全拆分移动站点导航与桌面站点导航，以便他们更专注于自己的域。\n将游乐场的代码示例与现有文档交织在一起，使得与想法的交互变得容易，而不仅仅是被动地阅读。\n网站地图已经过修改(没有中断任何链接)，以允许更多的文档部分，新的网站地图为文档提供了更具层次性的方法，这将使您更容易快速找到您正在查找的内容。\n在过去的一年里，游乐场突飞猛进-你可以在即将发布的帖子中找到TypeScript的交互式代码资源管理器的所有功能和更改。\n\n这本新手册有不同的结构。以前的手册是网站的一个单独部分，新网站有更多的文档页面，并将手册分为三个主要部分：\n打字入门-帮助您理解基于不同背景的语言。\n手册-阅读打字稿中的内容，以更好地理解这门语言\n这种分割在开始学习Tyescript时特别有用，因为它提供了一个集中学习的轨道。然后，由于您需要特定的技术，有更深入地探讨主题的参考文档。\n我们正在移动越来越多的代码样本，以使用一种名为twoslash的新打字标记格式。两个loslash代码示例使用TypeScript编译器生成准确的错误消息，获取编译器输出，并查询悬停工具提示以获取快速信息。然后可以将此信息呈现在代码示例的静态页面中。\n使用此技术，我们可以确保在使用TypeScript编译器时，我们的代码示例保持准确和最新。\n需要改进的最大领域之一是我们收集了100多个编译器标志的文档。新的TypeScript网站为每个标志都提供了详细的描述，并且示例都是由编译器支持的。这意味着我们可以确保示例准确地显示了更改特定配置时发生的情况。\n新网站从第一天起就考虑到了可访问性。为了让您对支持列表有个了解，下面是我们对每个页面的说明：\n任何人都可以学习编程，但是要想掌握一门编程语言，需要增加精通英语的额外障碍，这是一个令人担忧的问题。我们是一个小型的编译团队，并希望提供基础设施，使其他人能够本地化我们的网站。新网站的每个部分都考虑到了多语言支持。\n我们已经在中文、日文、葡萄牙文和西班牙文的翻译方面取得了很大进展-你可以通过GitHub的这些问题看到它们的进展情况。如果你有兴趣帮忙，来打招呼吧，请在“打字社区不和谐”一栏中打个招呼。\n这个新网站是在整整一年前开始的，到这里来已经提交了1600多条信息，并收到了100多人的贡献。你可以在GitHub的网络基础设施更新中阅读更多关于网站是如何设计和架构的动机。\n尽管如此，我们始终对反馈持开放态度，现在每个人都可以提供一些新的观点，因此有很大的改进空间。", "note_en": "Hey folks, I&#39;m happy to announce that the next iteration version of the TypeScript Website has launched on  typescriptlang.org.\n The new version of the website was built out of a desire to make the documentation for TypeScript feel as expansive as its type-system, with a design that fits  modern Microsoft styles.\n  To get a sense of what people wanted,  we reached out to the community about where they would like to see improvements and road-mapped based on that feedback.\n     Let&#39;s go through these points and learn about how the new TypeScript website addresses them.\n  We decided on the design and copy for the homepage for TypeScript 6 years ago, but things have changed quite a lot since then. TypeScript has grown up and understands what it wants to be: a type layer above JavaScript that provides great tooling support.\n This focus means explaining how the team works with JavaScript standard bodies, describing how DefinitelyTyped allows TypeScript to provide types to un-typed libraries, and teaching how adoption of TypeScript doesn&#39;t have to be an all or nothing choice.\n Hopefully, the new homepage makes it easier to understand TypeScript&#39;s place in the JavaScript ecosystem.\n Also, a personal highlight from the re-design, the new TypeScript logo which more closely reflects what people use in the wild:\n    Completely  splitting mobile vs desktop site navigation so they are more focused on their domains\n  Interweaving code samples for the playground with existing documentation, making it easy to interact with ideas instead of just passively reading\n The sitemap has been revised (without breaking any links) to allow for more sections of documentation, the new sitemap provides a more hierarchical approach to the documentation which should make it easier to find what you&#39;re looking for quickly.\n  Over the past year, the playground has jumped in leaps and bounds - you can find out all of the features and changes to TypeScript&#39;s interactive code explorer in it&#39;s own post coming soon.\n   \n     The new handbook has a different structure. The previous handbook was a single section of the website, the new site features a lot more documentation pages and splits the handbook into three main sections:\n Intros to TypeScript - which help you get an understanding of the language based on different backgrounds\n Handbook - the &#39;read from a-z&#39; of TypeScript to get a better understanding of the language\n This split is especially helpful when starting to learn TypeScript, as it provides a focused track to learn. Then later, as you need particular techniques, there are reference docs which explore a topic in more depth.\n   We&#39;re moving more and more of our code samples to use a new  TypeScript markup format called twoslash. Twoslash code samples use the TypeScript compiler to generate accurate error messages, get compiler outputs, and query hover tooltips for quick-info. This information can then be rendered in a a static page for code samples.\n  With this technique we can be certain that our code samples stay accurate and up-to-date as we work on the TypeScript compiler.\n  One of the biggest areas for improvement was our documentation for the collection of over 100 compiler flags. The new TypeScript website includes a long-form description for every flag and examples are compiler-backed. This means we can be sure that the examples show exactly what happens when a particular config is changed.\n   The new website has been built with accessibility in mind from day one. To give a sense of the support matrix, here&#39;s what we account for with each page:\n   Anyone can learn to code, but adding the extra barrier of being proficient in English to master a programming language is a worry. We&#39;re a small compiler team, and wanted to provide the infrastructure to enable others to localize our site. Every section of the new site is built with multi-language support in mind.\n  We&#39;ve gotten far on the translations for Chinese, Japanese, Portuguese and Spanish - you can see how far along they are via  these GitHub issues. If you&#39;re interested in helping out, come and say hi in the  TypeScript Community Discord.\n  The new site was started exactly  a year ago, getting here took over 1600 commits and received contributions from over  100 people. You can read more about the motivations for how the site was designed and architected in the  &#39;Web Infra Updates&#39; GitHub issue.\n With that said, we&#39;re always  open to feedback and there&#39;s a lot of space for improvement now that everyone can provide some fresh perspective.", "posttime": "2020-08-05 23:09:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "打字,typescript,网站", "title": "宣布新的打字网站", "title_en": "Announcing the new TypeScript Website", "transed": 1, "url": "https://devblogs.microsoft.com/typescript/announcing-the-new-typescript-website/", "via": "", "real_tags": ["打字", "网站"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1016401, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "近30年来，arxiv通过提供对学术文章的开放访问来服务于公众和研究社区，从物理学的广泛分支到计算机科学的许多分支学科，再到介于两者之间的一切，包括数学、统计学、电气工程、定量生物学和经济学。\nArxiv研究论文的绝对数量既是有益的，也是具有挑战性的。无论是各自领域的研究生，还是深入研究邻近领域的老牌教授，还是为公共利益寻找宏观洞察力的研究人员，这些丰富的信息语料库都提供了重要的，但有时是压倒性的深度。\n为了使arxiv更容易访问，我们在Kaggle上提供了一条通往机器可读的arxiv数据集的免费、开放的管道：170万篇文章的存储库，具有文章标题、作者、类别、摘要、全文PDF等相关功能。\n“在Kaggle上拥有整个arxiv语料库极大地提高了arxiv文章的潜力，”arxiv执行董事埃莱奥诺拉·普雷萨尼(Eleonora Presani)说。通过提供关于Kaggle的数据集，我们超越了人类通过阅读所有这些文章所能学到的东西，我们以机器可读的格式向公众提供了arxiv背后的数据和信息。“。\nKaggle是数据科学家和机器学习工程师寻找有趣的数据集、公共笔记本和比赛的目的地。研究人员可以利用Kaggle丰富的数据探索工具，轻松地与他人共享相关脚本和输出。\n“arxiv不仅仅是一个文章仓库，它还是一个知识共享的平台，”普雷萨尼说。他说：“这需要我们在如何呈现和解释我们提供的知识方面不断创新。Kaggle用户可以帮助推动这一创新的极限，它可以成为我们社区合作的新渠道。“。\nArxiv科学总监斯坦恩·西古尔德松(Steinn Sigurdsson)表示：“对于大型数据集，人们通常预计可能会忽视发现、联系、创新工具或视角，这可能会带来额外的洞察力，不仅是在最初的主题上，而且是在其他研究领域，使更多的发现和创新成为可能，”arxiv科学总监斯坦恩·西古尔德松(Steinn Sigurdsson)说。\n我们希望能够支持新的用例，这些用例可以导致探索更丰富的机器学习技术，这些技术将多模态功能结合到趋势分析、论文推荐引擎、类别预测、共引网络、知识图构建和语义搜索界面等应用程序中。\n这种建立在特定语料库之上的语义搜索应用程序的一个例子是谷歌的新冠肺炎研究浏览器，这是一个帮助研究人员钻研CORD-19数据集的工具-一个包含19万多篇关于新冠肺炎的科学文章的存储库。在这样的数据集上构建的接口利用高级NLU技术来理解用户在查询背后的意图。最终，这可以通过将相关数据和证据浮出水面来解决复杂的科学问题，从而使研究更有效率。我们希望机器可读的arxiv数据集的发布将激励在这个新的语料库上创建类似的NLU工具。\n谷歌高级研究科学家亚历克斯·阿莱米(Alex Alemi)也一直在使用arxiv追求ML更令人兴奋的应用。正如论文中所描述的，在使用arxiv作为数据集方面，Alex和他的同事们试图推动arxiv成为大规模、多关系任务的基准，例如使用图形神经网络。“看到研究界接受具有如此多现实世界实用性的丰富、多方面的数据集的挑战，以及这将带来的新问题，我感到很兴奋，”Alex说。\n该数据集现已在Kaggle上提供，并将每周更新一次。请将您的反馈发送给我们，并继续关注更多更新！\n特别感谢arxiv背后的著名物理学家和远见卓识的物理学家Paul Ginsparg和登月工厂X的杰克·希达里，他们帮助实现了这一合作。\n如果没有许多人的帮助，这个数据集是不可能的。非常感谢(按照姓氏的字母顺序)：亚历克斯·阿莱米(Alex Alemi)、蒂莫·博兹索里克(Timo Bozsolik)、艾莉森·弗罗姆(Alison Fromme)、林佩珍(Peijen Lin)、布莱恩·马尔赞(Brian Maltzan)、埃莱奥诺拉·普雷萨尼(Eleonora Presani", "note_en": "For nearly 30 years,  arXiv has served the public and research communities by providing open access to scholarly articles, from the vast branches of physics to the many subdisciplines of computer science to everything in between, including math, statistics, electrical engineering, quantitative biology, and economics.\n The sheer number of arXiv research papers is both beneficial and challenging. Whether it’s a graduate student ramping up in her respective field, an established professor delving into adjacent ones, or researchers searching for big picture insights for the public good, this rich corpus of information offers significant, but sometimes overwhelming, depth.\n To help make the arXiv more accessible,  we present a free, open pipeline on Kaggle to the machine-readable arXiv dataset: a repository of 1.7 million articles, with relevant features such as article titles, authors, categories, abstracts, full text PDFs, and more.\n “Having the entire arXiv corpus on Kaggle grows the potential of arXiv articles immensely,” said Eleonora Presani, arXiv Executive Director. “By offering the dataset on Kaggle we go beyond what humans can learn by reading all these articles and we make the data and information behind arXiv available to the public in a machine-readable format.”\n Kaggle is a destination for data scientists and machine learning engineers seeking interesting datasets, public notebooks, and competitions. Researchers can utilize Kaggle’s extensive data exploration tools and easily share their relevant scripts and output with others.\n “arXiv is more than a repository of articles, it’s a platform for knowledge sharing,” said Presani. “This requires constant innovation on how we present and interpret the knowledge we make available. Kaggle users can help push the limits of this innovation and it can be a new outlet for our community to collaborate.”\n “With large data sets, there is generally an expectation that there are likely to be overlooked discoveries, connections, innovative tools or perspectives, which may lead to additional insights, not just in the original subject, but across other fields of study, enabling yet more discovery and innovation,” said Steinn Sigurdsson, arXiv Scientific Director.\n  Our hope is to empower new use cases that can lead to the exploration of richer machine learning techniques that combine multi-modal features towards applications like trend analysis, paper recommender engines, category prediction, co-citation networks, knowledge graph construction, and semantic search interfaces.\n An example of such a semantic search application built on top of a specific corpus would be  Google’s COVID-19 Research Explorer, a tool that helps researchers pore through the  CORD-19 dataset – a repository of 190,000+ science articles on COVID-19. Interfaces built on datasets such as this leverage advanced NLU techniques to understand a user’s  intent behind a query. Ultimately, this can enable more efficient research by surfacing relevant data and evidence to complex, scientific questions. We hope the release of the machine-readable arXiv dataset will inspire the creation of similar NLU tools over this new corpus.\n Alex Alemi, Senior Research Scientist at Google, has also pursued more exciting applications of ML using the arXiv. As described in the paper,   On the Use of arXiv as a Dataset , Alex and his colleagues sought to propel the arXiv as a benchmark for large scale, multi-relational tasks, such as with graph neural networks.  “I’m excited to see the research community rise to the challenge of a rich, multifaceted dataset with so much real-world practicality, and the new questions this will raise,” says Alex.\n  The dataset is now available on Kaggle and will be updated weekly. Please send us your feedback and stay tuned for additional updates!\n   Special thanks to Paul Ginsparg, the noted physicist and visionary behind the arXiv, and Jack Hidary of X, The Moonshot Factory, who helped work to bring this collaboration to fruition.\n This dataset would not be possible without the helpful input of many people. Much appreciation to (in alphabetical order of last name): Alex Alemi, Timo Bozsolik, Alison Fromme, Peijen Lin, Brian Maltzan, Eleonora Presani, Steinn Sigurdsson and Joe Tricot.", "posttime": "2020-08-05 23:03:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "提供,machine,arxiv", "title": "利用机器学习为Arxiv数据集的新发现提供动力", "title_en": "Leveraging Machine Learning to Fuel New Discoveries with the ArXiv Dataset", "transed": 1, "url": "https://blogs.cornell.edu/arxiv/2020/08/05/leveraging-machine-learning-to-fuel-new-discoveries-with-the-arxiv-dataset/", "via": "", "real_tags": ["提供", "machine", "arxiv"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1016400, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "地震事件页面应用程序支持最新的浏览器，查看支持的浏览器。或者，尝试我们的实时通知、摘要和Web服务。", "note_en": "The Earthquake Event Page application supports most recent browsers,  view supported browsers. Or, try our  Real-time Notifications, Feeds, and Web Services.", "posttime": "2020-08-05 23:03:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,地质,data,支持", "title": "美国地质调查局关于黎巴嫩爆炸的数据", "title_en": "USGS Data on the Lebanon Blast", "transed": 1, "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us6000b9bx/executive", "via": "", "real_tags": ["美国", "地质", "data", "支持"]}, {"category": "", "categoryclass": "", "imagename": "0058383b157d7c4f7e1da37985b1b679.png", "infoid": 1016399, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(彭博商业周刊)--3月，艾伦·罗斯的生意陷入停顿。罗斯是一名心理治疗师，习惯于坐在病人对面，帮助他们处理最深的创伤……", "note_en": "(Bloomberg Businessweek) -- In March, Ellen Ross’s business came to a standstill. Ross is a psychotherapist, accustomed to sitting across from patients, helping them deal with their deepest traumas...", "posttime": "2020-08-05 23:02:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,搜索,search,商业", "title": "谷歌搜索垄断使精神健康危机复杂化", "title_en": "Google’s Search Monopoly Complicates a Mental Health Crisis", "transed": 1, "url": "https://www.bloombergquint.com/businessweek/google-s-search-monopoly-complicates-a-mental-health-crisis", "via": "", "real_tags": ["谷歌", "google", "搜索", "search", "商业"]}, {"category": "", "categoryclass": "", "imagename": "e988f2c442f5b1e67dca93bd52fa6a0a.jpg", "infoid": 1016397, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "经过一年多的传言、戏弄和曝光，我们终于玩起了即将上映的“复仇者联盟”视频游戏，定于9月4日在PS4、Xbox One和Windows PC上发布。它可以说是有史以来最大的复仇者联盟主题游戏，这在一定程度上要归功于Crystal Dynamics(现代“古墓丽影”三部曲的开发商)的巨大努力。你们中的许多人很快就能玩到同样的内容，届时游戏的测试版将于8月7日(星期五)开始，专门针对预订了游戏的PS4玩家。(到月底，所有三个平台都将有开放测试期，不需要购买；更多信息见下文。)。\n我们一直小心翼翼地报道这款超级英雄游戏，部分原因是它在2019年E3期间的表现看起来令人怀疑，也因为我们无法预测其以命运为灵感的抢劫者射击系统将如何转化为击打类游戏。这个测试版的任务和故事序列的选择让我们更加怀疑最终的游戏会发生什么--而这个消息并不是很好。\n测试版以旧金山的一场全明星超级英雄斗殴开场，主要是在金门大桥上，它看起来可能很眼熟，因为这部电影曾在去年的E3上首映。这是一个展示力量的介绍，玩家们从一个熟悉的超级英雄跳到另一个：雷神、绿巨人、钢铁侠、美国队长和黑寡妇。每一种都有近战、远程、反击和特殊攻击的混合，每一种都可以对大量普通的机器人士兵敌人进行严重的打击。击打、奔跑、跳跃，然后重复。\n作为一个定调的任务，这场在旧金山的战斗在PS4 Pro上以稳定的30fps刷新运行，同时提供各种令人愉快的爆炸性效果和详细的人物。真的，整件事看起来比之前披露的要好得多--特别是那些有名无实的英雄面孔，他们看起来不再像现实生活中的复仇者联盟电影中的特技替身。但是实际控制这项任务会暴露出几乎每一个角色的攻击都行动迟缓。黑寡妇的打斗是这款游戏中最接近时髦的东西，其他所有人都觉得自己被氪石击中了(是的，我特意在那里把我的漫画出版商的经典作品混在一起了)。(是的，我特意在那里把我的漫画出版商的经典作品混在一起了)，其他人都觉得自己被氪星石击中了(是的，我特意在那里把我的漫画出版商的经典作品混在一起了)。\n更糟糕的是，即使是黑寡妇，一个被认为是神枪手的人，每当她使用远程攻击时，也会遭受按钮按下滞后和干瞄准后坐力的严重混合，其他所有的英雄都可以这样说。绿巨人的远程攻击是水晶动力公司处理这方面战斗的一个很好的例子。绿巨人在开始投掷之前，必须经历一段从地面挖出碎片并将其填塞成球的动画。然后，他有一个额外的动画周期来实际扔东西。最糟糕的是，这种远程攻击的明显规模只有豌豆大小，需要精确打击你的远处目标，其视觉和音频影响也是微不足道的。其中一些问题可能是在正确的组合中进行权衡，比如缓慢但强大或快速而脆弱，但截至发稿时，测试版的远程攻击都让人感觉笨拙、软弱和乏味。\n即使你已经玩了足够多的测试版，为一个给定的英雄积累了新的战利品，这一点仍然适用，因为每个角色都有四个装备插槽：一个用于近战攻击，一个用于远程攻击，一个用于特殊攻击，一个用于防御。就像经典的ARPG系列(“暗黑破坏神”、“边疆”)一样，你将通过越来越艰难的任务来寻找和装备越来越强大的设备。但与那些系列不同的是，该设备只是简单地改变了你的英雄的预设能力的统计数据。\n说到平台：Square Enix选择将一个广受欢迎的与复仇者联盟相关的超级英雄限制在PlayStation游戏机上。当这款游戏的零售版推出时，蜘蛛侠将成为PS4的独家免费角色。作为对这一决定的回应，我们的蜘蛛感并不完全是刺痛的。\n因为游戏是围绕原型英雄展开的，所以战利品不会在游戏机制上产生明显的差异。换句话说，你永远不会要求美国队长从盾牌换成火焰喷射器，因为你在地上发现了一个。(顺便说一句，“美国队长带着火焰喷射器”会是一款不错的电子游戏，漫威。)。相反，漫威的“复仇者联盟”中的定制主要来自技能树，这将允许你在游戏过程中解锁并分配不同的攻击类型，但测试版只有一个技能树可供使用。测试版的战利品只允许玩家增加每个角色现有技能树的统计信息。在某些情况下，新的战利品拾取可能会增加元素加值(减少寒冷攻击造成的伤害，或者在远程攻击中增加火力伤害)。？仅此而已。", "note_en": "After over a year of rumors, teases, and reveals, we have finally played the upcoming  Avengers video game, slated to launch on PS4, Xbox One, and Windows PC on September 4. It&#39;s arguably the biggest Avengers-themed game ever made, in part thanks to a massive effort by developers Crystal Dynamics (makers of the modern  Tomb Raider trilogy). Many of you will soon get to play the same content when the game&#39;s beta test opens Friday, August 7, exclusively for PS4 players who preordered the game. (By month&#39;s end, all three platforms will have open beta periods, no purchase required; more on that below.)\n We&#39;ve been careful about covering this superhero game, in part because its performance looked suspect during E3 2019 and because we couldn&#39;t tell how its  Destiny-inspired looter-shooter system would translate to the beat-&#39;em-up genre. This beta&#39;s selection of missions and story sequences has firmed up our suspicions on what to expect in the final game—and the news isn&#39;t great.\n     The beta opens with an all-star superhero brawl in San Francisco, primarily atop the Golden Gate Bridge, and it may look familiar, as this previously premiered at last year&#39;s E3. It&#39;s a show-of-force intro, with players jumping from one familiar superhero to the next: Thor, Hulk, Iron Man, Captain America, and Black Widow. Each comes with a mix of melee, ranged, counter, and special attacks, and each can put the serious smackdown on large crowds of generic robo-soldier foes. Pummel, run, jump, and repeat.\n As a tone-setting mission, this battle in San Francisco runs on PS4 Pro at a consistent 30fps refresh while serving up a delectable variety of explosive effects and detailed characters. Really, the whole thing looks much better than prior reveals—especially the titular heroes&#39; faces, which no longer look like stunt doubles from the real-life  Avengers films. But having actual control of this mission reveals a sluggishness to nearly every character&#39;s attacks. Black Widow&#39;s fisticuffs are the closest thing this game has to &#34;snappy,&#34; with everyone else feeling like they&#39;ve been hit by a ray of Kryptonite (yep, I&#39;m conflating my comics-publisher canon on purpose there).\n Worse, even Black Widow, a supposed sharpshooter, suffers from a gross mix of button-press lag and jerky-aim recoil whenever she uses a ranged attack, and the same can be said for every other hero. Hulk&#39;s ranged attack is a great example of how badly Crystal Dynamics handles this aspect of combat. Hulk must go through an animation of scooping debris from the ground and wadding it into a ball before he can begin throwing. Then, he has an additional animation cycle to actually throw the thing. Worst of all, the apparent size of that ranged attack is pea-sized, requiring precision to strike your distant target, and its visual and audio impact is piddly. Some of those issues could be tradeoffs in the right mix, like slow-but-powerful or quick-and-wimpy, but as of press time, the beta&#39;s ranged attacks all feel unwieldy, weak, and ho-hum.\n     This applies even once you&#39;ve played enough of the beta to amass new loot for a given hero, as each character has four equipment slots: one for melee attacks, one for ranged attacks, one for special attacks, and one for defense. Much like classic ARPG series ( Diablo,  Borderlands), you&#39;ll grind through increasingly tough missions to find and equip increasingly powerful equipment. But unlike those series, that equipment simply changes the stats for your hero&#39;s pre-set abilities.\n  Speaking of platforms: Square Enix has chosen to restrict one popular Avengers-related superhero to PlayStation consoles. When the game&#39;s retail version launches, Spider-man will become an exclusive, free character for PS4. Our spidey-sense isn&#39;t exactly &#34;tingling&#34; in response to that decision.\nBecause the game revolves around archetypal heroes, the loot doesn&#39;t drive significant differences in gameplay mechanics. In other words, you&#39;ll never ask Captain America to switch from a shield to a flamethrower because you found one on the ground. (By the way: &#34;Captain America with a flamethrower&#34; would be a sweet video game, Marvel.) Customization in  Marvel&#39;s Avengers instead comes primarily from skill trees, which will let you unlock and assign different attack types over the course of the game, but the beta only includes a single skill tree to play with. The beta&#39;s loot only lets players augment the stats of each character&#39;s existing skill tree. In certain cases, a new loot pickup might add elemental bonuses (take less damage from &#34;cold&#34; attacks, or add &#34;fire&#34; damage to your ranged attack). That&#39;s about it.", "posttime": "2020-08-05 21:20:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,电子游戏,联盟,video", "title": "复仇者联盟电子游戏测试版印象：命运，这不是", "title_en": "Avengers video game beta impressions: Destiny, this ain’t", "transed": 1, "url": "https://arstechnica.com/gaming/2020/08/avengers-video-game-beta-impressions-destiny-this-aint/", "via": "", "real_tags": ["游戏", "电子游戏", "联盟", "video"]}, {"category": "", "categoryclass": "", "imagename": "3dfdd6173a2e2f257e9641d337d8b498.jpg", "infoid": 1016396, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与曾在Mobileye等公司工作的创始团队合作，Sight很早就押注于使用机器视觉分析血液样本，并在几分钟内提供可与现有实验室测试相媲美的完整血细胞计数。该公司去年年底获得了FDA的批准，这肯定有助于为这一轮额外的融资扫清道路。\n“历史上，验血是由人类在显微镜下观察血液进行的。Sight首席执行官兼联合创始人尤西·波拉克告诉我说：“这种情况可能持续了200年之久。”“大约60年前，一项名为流式细胞术(FCM)的新技术开始用于从静脉样本中提取大量血液，以实现自动检测。从某种意义上说，我们正在回到第一种方法，我们只是用机器视觉取代了显微镜后面的人眼。“。\n波拉克指出，这些测试产生了大约60G字节的信息(当然，其中很大一部分是图像)，他认为完整的血细胞计数只是第一步。它希望诊断的疾病之一是新冠肺炎。为了做到这一点，该公司在世界各地的医院放置了设备，看看是否可以收集数据，以检测可能表明疾病某些方面的严重程度的异常情况。\n波拉克说：“我们只是在某种程度上触及了人工智能帮助实现血液诊断愿望的能力的皮毛。”具体地说，现在，COVID在分散诊断和血液测试方面有如此大的价值。想想让人们-COVID-阴性或-阳性-留在医院外，以减少医院的繁忙，并降低癌症患者和许多其他需要持续完整血细胞计数的人群的污染风险。我认为我们现在可以特别为不同的市场带来很大的潜力和很大的价值，我们肯定在寻找[全血计数]以外的其他应用，并完善我们的产品。“。\n到目前为止，视力诊断已经申请了20项专利，到目前为止已经颁发了8项专利。虽然机器学习显然是该公司工作的核心-模型运行在OLO机器上，而不是在云中-Pollak也强调，团队在样本准备方面取得了突破，使其能够自动准备样本进行分析。\nPollok强调，该公司在这一轮融资中专注于美国市场，考虑到该公司仍在寻求FDA的批准，这是有道理的。他还指出，这标志着Koch Disrupt Technologies在以色列的第三笔投资，另外两笔也是医疗保健初创企业。\n科赫颠覆技术公司总裁Chase Koch说：“KDT的投资是对该公司颠覆性技术的证明，我们相信这项技术将从根本上改变血液诊断工作的方式。”我们为能与SIGHT团队合作感到自豪，该团队在创新这项技术方面做了令人难以置信的工作，以改变现代医疗保健，并为世界各地的患者、医护人员和医院提供更高的效率和安全性。“。\n该公司目前约有100名员工，主要从事研发工作，在伦敦和纽约设有办事处。", "note_en": "With a founding team that used to work at Mobileye, among other companies, Sight made an early bet on using machine vision to analyze blood samples and provide a full blood count comparable to existing lab tests within minutes. The company received FDA clearance late last year, something that surely helped clear the way for this additional round of funding.\n   “Historically, blood tests were done by humans observing blood under a microscope. That was the case for maybe 200 years,” Sight CEO and co-founder Yossi Pollak told me. “About 60 years ago, a new technology called FCM — or flow cytometry — started to be used on large volume of blood from venous samples to do it automatically. In a sense, we are going back to the first approach, we just replaced the human eye behind the microscope with machine vision.”\n  Pollak noted that the tests generate about 60 gigabytes of information (a lot of that is the images, of course) and that he believes that the complete blood count is only a first step. One of the diseases it is looking to diagnose is COVID-19. To do so, the company has placed devices in hospitals around the world to see if it can gather the data to detect anomalies that may indicate the severity of some of the aspects of the disease.\n “We just kind of scratched the surface of the ability of AI to help with with a wish with blood diagnostics,” said Pollak. “Specifically now, there’s so much value around COVID in decentralizing diagnostics and blood tests. Think keeping people — COVID-negative or -positive —  outside of hospitals to reduce the busyness of hospitals and reduce the risk for contamination for cancer patients and a lot of other populations that require constant complete blood counts. I think there’s a lot of potential and a lot of a value that we can bring specifically now to different markets and we are definitely looking into additional applications beyond [complate blood count] and also perfecting our product.”\n So far,  Sight Diagnostics   has applied for 20 patents and eight have been issued so far. And while machine learning is obviously at the core of what the company does — with the models running on the OLO machine and not in the cloud — Pollak also stressed that the team has made breakthroughs around the sample preparation to allow it to automatically prepare the sample for analysis.\n  Pollok stressed that the company focused on the U.S. market with this funding round, which makes sense, given that it was still looking for its FDA clearance. He also noted that this marks Koch Disrupt Technologies’ third investment in Israel, with the other two also being healthcare startups.\n “KDT’s investment in Sight is a testament to the company’s disruptive technology that we believe will fundamentally change the way blood diagnostic work is done,’ said Chase Koch, President of  Koch Disruptive Technologies  . “We’re proud to partner with the Sight team, which has done incredible work innovating this technology to transform modern healthcare and provide greater efficiency and safety for patients, healthcare workers, and hospitals worldwide.”\n The company now has about 100 employees, mostly in R&amp;D, with offices in London and New York.", "posttime": "2020-08-05 21:19:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "diagnostics", "title": "\nSight Diagnostics为其血液分析仪D系列筹集7100万美元", "title_en": "\n\t\t\t\tSight Diagnostics raises $71M Series D for its blood analyzer\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/05/sight-diagnostics-raises-71m-series-d-for-its-blood-analyzer/", "via": "", "real_tags": []}, {"category": "", "categoryclass": "", "imagename": "71a839a9a39018577ee67d8934a1475a.jpg", "infoid": 1016395, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“无人机是一款持续集成的软件。它帮助开发人员持续构建、测试和部署他们的代码。该项目始于2012年，是市场上第一个云原生、容器原生持续集成解决方案，我们将其开源，“公司联合创始人Brad Rydzewski告诉TechCrunch。\n虽然Harness之前缺乏与其持续交付工具配套的CI工具，但创始人兼首席执行官Jyoti Bansal表示，这与其说是为了填补一个漏洞，不如说是为了扩大目前的平台。\n“我认为这是我们视野的扩展，也是我们的发展方向的扩展。正如您和我过去谈过的那样，Harness的使命是成为每个人的下一代软件交付平台。“。他补充说，购买无人机有很多好处。“所有这些--开源社区的规模、产品的简单性--对Harness和无人机来说，走到一起，将这种集成的CI/CD推向市场是[有意义的]。”\n虽然这是Harness第一次涉足开源领域，但Bansal说这只是一个起点，他们希望随着公司的发展拥抱开源。他说：“随着时间的推移，我们致力于越来越多地参与开源工作，实际上，我们的原创产品Harness的更多部分也是开源的。”\n对于可能担心此次收购的无人机社区成员，班萨尔表示，他“100%致力于”继续支持开源无人机产品。事实上，Rydzewski说他想与Harness合作，因为他觉得与他们合作可以做的事情比他作为一家独立公司继续做的要多得多。\n“无人机是一个不断增长的社区，一个不断增长的项目和一个不断增长的业务。归根结底，我认为时机是正确的，希望与Harness这样的公司合作，共同建设未来。无人机奠定了很多基础，但这是一个让它更上一层楼的问题，“他说。\nBansal说，Harness还打算在Harness平台上提供具有一些企业功能的无人机的商业版本，即使在继续支持其开源方面也是如此。\n无人机公司成立于2012年。根据Crunchbase的数据，2013年参加炼金术士加速器时，它唯一筹集到的资金是2.8万美元。交易已经完成，Rydzewski加入了Harness团队，", "note_en": "“Drone is a continuous integration software. It helps developers to continuously build, test and deploy their code. The project was started in 2012, and it was the first cloud native, container native continuous integration solution on the market, and we open sourced it,” company co- founder  Brad Rydzewski   told TechCrunch.\n   While  Harness   had previously lacked a CI tool to go with its continuous delivery tooling, founder and CEO Jyoti Bansal said this was less about filling in a hole than expanding the current platform.\n “I would call it an expansion of our vision and where we were going. As you and I have talked in the past, the mission of Harness is to be a next generation software delivery platform for everyone,” he said. He added that buying Drone had a lot of upside.”It’s all of those things — the size of the open source community, the simplicity of the product — and it [made sense], for Harness and Drone to come together and bring this integrated CI/CD to the market.”\n  While this is Harness’ first foray into open source, Bansal says it’s just the starting point and they want to embrace open source as a company moving forward. “We are committed togetting more and more involved in open source and actually making even more parts of Harness, our original products, open source over time as well,” he said.\n For Drone community members who might be concerned about the acquisition, Bansal said he was “100% committed” to continuing to support the open source Drone product. In fact, Rydzewski said he wanted to team with Harness because he felt he could do so much more with them than he could have done continuing as a stand-alone company.\n “Drone was a growing community, a growing project and a growing business. It really came down to I think the timing being right and wanting to partner with a company like Harness to build the future. Drone laid a lot of the groundwork, but it’s a matter of taking it to the next level,” he said.\n Bansal says that Harness intends to also offer a commercial version of Drone with some enterprise features on the Harness platform, even while continuing to support the open source side of it.\n Drone was founded in 2012. The only money it raised was $28,000 when it participated in the Alchemist Accelerator in 2013, according to Crunchbase data. The deal has closed and Rydzewski has joined the Harness team,", "posttime": "2020-08-05 21:19:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开源,acquisition,harness", "title": "\nHarness进行首次收购，抢占开源CI公司Drone.io", "title_en": "\n\t\t\t\tHarness makes first acquisition, snagging open source CI company Drone.io\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/05/harness-makes-first-acquisition-snagging-open-source-ci-company-drone-io/", "via": "", "real_tags": ["开源", "harness"]}, {"category": "", "categoryclass": "", "imagename": "17484b5af86c7f85c5ad68aeb526aec9.jpg", "infoid": 1016394, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Covert Dock包括一个符合Power Delivery 3.0标准的USB Type-C端口，这意味着它不仅可以为交换机充电，还可以为iPhone、Android智能手机、iPad Pro甚至MacBook充电(尽管它的最大输出功率为30W，所以你不会为任何耗电的大型设备全速充电)。它还包括一个USB-A端口，您不仅可以使用该端口充电，还可以将控制器、麦克风、鼠标、以太网适配器等连接到通过USB-C连接的设备。最后，还有一个HDMI端口，您可以使用该端口将您的交换机(或其他支持USB-C视频输出的设备)连接到您的电视或显示器。\nHDMI端口在高达60 Hz时支持1080p的最大分辨率，因此可以轻松处理交换机的720p输出。Genki Covert Dock还具有可折叠的电源插头，以实现最大的便携性-而且它非常紧凑，尽管具有所有功能，但它比MacBook Air充电器还小。\nGenki还提供了一套全球电源适配器，可以滑到折叠的叉子上，便于旅行兼容，增加了它的多功能性。盒子里还有一根6英尺长的USB-C3.1充电线，所以你马上就可以开始使用它了。当您没有插入HDMI电缆时，它还可以像使用任何其他标准USB-C充电器一样为您的开关供电。\nGenki Covert Dock的售价为74.99美元，实际上低于任天堂为Switch设置的官方底座的零售价-而且它是一款功能更多的设备，这要归功于它能够充当支持USB-C显示输出的各种设备的集线器。将这一点与旅行适配器组合在一起，Covert Dock实际上将取代你包里的两到三个设备，而不仅仅是一个开关基座。\nGenki的Covert Dock感觉非常结实，建造得很好，一点也不像你在亚马逊上可以找到的许多第三方Dock替代品。在内部，它使用了氮化镓技术，使其体积小，同时仍能确保在不过热的情况下提供良好的功率输出。\n无论是给我的开关(和其他设备)充电，还是把开关连接到我的电视上，它都工作得无懈可击。只要你插上HDMI电缆，开关就会像使用官方坞站时一样工作，关闭内置显示器，以高清分辨率输出到电视上。\n插上iPad Pro和MacBook Pro的情况也是如此。两者都会自动检测HDMI连接，并像使用任何其他显示适配器一样工作。\n考虑到第三方硬件导致控制台砖块等问题的频率，其他第三方交换机显示器坞站解决方案的用户可能会犹豫是否信任另一个解决方案。但是Genki对为什么他们的Dock不应该遇到这样的问题有很好的透彻的解释，而且这主要涉及到他们对PD3.0规范的正确实现。在几个星期的最新交换机控制台测试过程中，我绝对没有遇到任何问题。\n如果你有一个交换机(遗憾的是，不是Switch Lite，因为它不支持视频输出)，那么毫无疑问，你也应该拥有一个Genki Covert Dock。这是游戏机应该附带的底座，因为它尊重交换机的便携性，并提供了一种连接电视的方式，占用的空间不超过交换机USB充电器本身。\n即使您没有开关，Genki Covert Dock也可能是您需要的东西-例如，它是在会议上演示时为iPad供电的一种很好的方式，也是一个非常棒的旅行充电器，即使您不使用显示功能也是如此。Genki做了大量的工作，将一款独特的、制作精良的设备封装成一款功能齐全的设备，而且当你考虑到它正在取代多少其他潜在的小玩意儿和加密狗时，这个价格是非常合理的。", "note_en": "The Covert Dock includes a USB Type-C port that’s rated for the Power Delivery 3.0 standard, which means it can charge not only the Switch, but also an iPhone, Android smartphones, the iPad Pro and even a MacBook (though its max output is 30w, so you won’t get full-speed charging for any power-hungry large devices). It also includes a USB-A port, which you can use not only for charging, but also for connecting controllers, microphones, mice, Ethernet adapters, and more to devices connected via USB-C. Finally, there’s an HDMI port, which you can use to connect your Switch (or other devices that support USB-C video out) to your TV or display.\n The HDMI port supports a maximum resolution of 1080p at up to 60hz, so it can easily handle the 720p output of the Switch. The Genki Covert Dock also features folding power prongs for maximum portability – and it’s extremely compact, coming in smaller than a MacBook Air charger despite all of its capabilities.\n   Genki also provides a set of global power adapters that slide on to the folded prongs for easy travel compatibility, adding to its versatility. There’s also a six-foot USB-C 3.1 charging cable included in the box, so you have everything you need to begin using it right away. When you don’t have an HDMI cable plugged in, it can also power your Switch while you play just like with any other standard USB-C charger.\n At $74.99, the Genki Covert Dock actually comes in under the retail price of Nintendo’s official dock set for Switch – and it’s a much more versatile device thanks to its ability to act as a hub for a wide range of devices that support display output over USB-C. Combine that with the travel adapter set, and the Covert Dock is really replacing two or three devices in your bag, rather than just a Switch dock.\n  Genki’s Covert Dock feels very sturdy and well-built, not at all like many of the third-party dock alternatives that you can find on Amazon. Inside, it uses Gallium Nitride technology to enable its small size while still making sure it can provide good power output without overheating.\n It worked flawlessly both for charging my Switch (and other devices) and for connecting the Switch to my TV. As soon as you plug in an HDMI cable, the Switch behaves just as it would when using the official dock, switching off the built-in display and outputting to the television in HD resolution.\n  Ditto with plugging in an iPad Pro, and a MacBook Pro. Both automatically detect the HDMI connection and behave just like they would using any other display adapter.\n Users of other third-party Switch display docking solutions might be hesitant to trust another one, given how frequently third-party hardware has led to issues including console bricking. But Genki has a  great and thorough explanation of why their dock shouldn’t encounter such issues, and it mostly relates to their proper implementation of the PD 3.0 specification. Over the course of testing on an up-to-date Switch console over a couple of weeks, I definitely haven’t encountered any issues.\n  If you own a Switch (not the Switch Lite, sadly, since it doesn’t support video out), then there’s no question that you should also own a  Genki Covert Dock. It’s the dock that the console should’ve shipped with, since it respects the Switch’s portability and offers a way to connect to a TV that takes up no more space than the Switch USB charger itself.\n Even if you don’t own a Switch, the Genki Covert Dock might be something you need – it’s a great way to power an iPad while presenting during a meeting, for instance, and also a fantastic travel charger even when you’re not using the display features. Genki has done a tremendous job of packing a whole lot of versatility into a unique and well-built device, and at a price that’s very reasonable when you consider how many other potential gadgets and dongles it’s replacing.", "posttime": "2020-08-05 21:18:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "任天堂,covert,dock,设备", "title": "\nGenki的Covert Dock是任天堂交换机和其他小玩意儿的完美底座", "title_en": "\n\t\t\t\tGenki’s Covert Dock is the perfect dock for the Nintendo Switch – and other gadgets, too\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/05/genkis-covert-dock-is-the-perfect-dock-for-the-nintendo-switch-and-other-gadgets-too/", "via": "", "real_tags": ["任天堂", "covert", "dock", "设备"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1016392, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎访问Bridges 2020虚拟会议网站！“桥”是一个探讨艺术和数学交集的年度会议。在2020年，我们已经将很大一部分会议搬到了网上。要了解更多信息，请观看布里奇斯校长乔治·哈特的欢迎视频。\n在这个网站上，您可以找到由Bridges撰稿人准备的在线内容，他们希望在虚拟环境中尽可能多地分享会议的精神。许多论文包括预先录制的视频演示文稿，以及到其他网站的链接，这些网站提供了更多信息。您还可以找到我们一些年度艺术类别的链接：视觉艺术展、短片展和诗歌朗读。今年，我们提供了一个小型的现场工作坊，在那里你可以通过视频链接实时探索艺术/数学的想法。最后，在整个网站中，您可以使用大多数页面底部的论坛系统与作者互动，提出问题，并参与到与Bridges参与者和访问者的讨论中。我们希望你喜欢你在这里找到的想法，我们明年会在芬兰见到你！当您准备好开始浏览时，请选择以下类别之一，或使用侧栏中的菜单。\n介绍数学和艺术之间联系的新的学术研究的报告。通常长度为六到八页。还包括从计划于2020年的主旨演讲者中挑选的一小部分受邀论文。\n介绍数学和艺术之间联系的新的学术研究的报告。通常长度为两到四页。\n研讨会论文描述了数学和艺术交汇的实践活动。一些适合课堂使用，另一些用于鼓舞人心的手工艺，还有一些作为研究或教学发展的培训。\n我们正在推广一些现场社交活动，这些活动将在原定的会议期间举行，我们鼓励您组织更多的活动。\n我们将通过视频会议现场举办四个实际操作的数学艺术研讨会。任何人都可以免费参加，只要你提前注册并提供你自己的材料。\n布里奇斯的乐趣在于现场发生的相互交流和鼓舞人心的精神。我们提供了一个空间，个人可以在这里提议一次现场聚会或分享他们可能带到会议上的工作。", "note_en": "Welcome to the website for the Bridges 2020 Virtual Conference!\t\t\t Bridges is an annual\t\t\tconference that explores intersections between art and mathematics.\t\t\tIn 2020, we&#39;ve moved a big part of the conference online.\t\t\tTo learn more, please watch this welcome video from Bridges\t\t\tpresident George Hart.\n   On this site, you&#39;ll find online content prepared by Bridges\t\tcontributors who wish to share the spirit of the conference as much\t\tas possible in a virtual setting. Many papers include prerecorded\t\tvideo presentations and links to other websites with additional\t\tinformation. You&#39;ll also find links to some of our annual arts\t\tcategories: the Visual Art Exhibition, the Short Film Festival, and\t\tthe Poetry Reading. And this year, we&#39;re offering a small selection\t\tof live workshops, where you can explore art/math ideas in real time\t\tover a video link. Finally, throughout the site, you&#39;ll be able to\t\tinteract with authors, ask questions, and engage in discussion with\t\tBridges participants and visitors, using a forum system at the bottoms\t\tof most pages. We hope you enjoy the \t\tideas you find here, and we&#39;ll see you \t\t next year in Finland!\t\t   When you&#39;re ready to start exploring, select one of the categories\t\tbelow, or use the menu in the sidebar.\n Reports presenting new scholarly research in connections between mathematics\tand the arts. Typically six to eight pages in length. Also includes a \tsmall selection of invited papers from planned 2020 keynote speakers.\n Reports presenting new scholarly research in connections between mathematics\tand the arts. Typically two to four pages in length.\n Workshop papers describe hands-on activities that lie at the intersection\tof mathematics and art. Some are suited to classroom use, others \tfor inspiring crafts, and others as training for research or pedagogical\tdevelopment.\n We are promoting a few live social events that will take place during the\ttime of the originally scheduled conference, and we encourage you \tto organize additional events.\n We&#39;ll be hosting four hands-on math-art workshops by live videoconference.\tAnybody can participate for free, as long as you register in advance\tand supply your own materials.\n The joy of Bridges\t\tis the spirit of mutual exchange and inspiration that takes place on site.\t\tWe offer a space where individuals can propose a\t\tlive get-together or share work they might have brought to the \t\tconference.", "posttime": "2020-08-05 21:16:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,虚拟,virtual,现场", "title": "Bridge 2020虚拟会议", "title_en": "Bridges 2020 Virtual Conference", "transed": 1, "url": "https://2020.bridgesmathart.org", "via": "", "real_tags": ["2020", "虚拟", "virtual", "现场"]}, {"category": "", "categoryclass": "", "imagename": "2b8a4def4e65617e0186879b9393b50e.png", "infoid": 1016391, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "长期以来，Mac电脑一直享有比Windows电脑更安全的美誉。然而，在过去的几年里，随着越来越多的人选择Mac-特别是在大公司-这种观念正在改变，这要归功于黑客将目光投向了苹果的电脑操作系统。\n周三，美国国家安全局(NSA)前黑客帕特里克·沃德尔(Patrick Wardle)将展示他是如何创造出一系列漏洞的，这些漏洞本可以让黑客通过简单地说服目标打开一个加载了恶意宏的Microsoft Office文件来控制Mac。用恶意宏创建Office文件是一个老把戏，最近对Windows目标感兴趣的黑客们开始享受它的第二次生命。Wardle现在正在展示宏-本质上是嵌入在文档中的小程序-也可以在MacOS上利用。\n“目前的MacOS攻击非常无效，有点蹩脚，”沃德尔在电话中告诉主板。“我基本上是说，情况还会更糟吗？”\n事实证明，他们可以做到。沃德尔周三上午发表了一篇博客文章，并将在周三的黑帽安全会议上展示他的发现。由于冠状病毒大流行，该会议今年在网上举行。\n沃德尔的黑客攻击是可能的，这要归功于他发现的一系列偶然事件和错误，并将它们联系在一起。沃德尔现在是专注于Mac的公司JAMF的安全工程师，他第一次意识到他可以用一种古老的文件格式(.slk)创建Office文件，这将促使Office在不警告用户的情况下自动在MacOS上运行宏，这是另外两名安全研究人员在2018年发现的一种技术。\n沃德尔说：“安全研究人员喜欢这些古老的文件格式，因为它们是在没有人考虑安全的时候创建的。”\n你现在还是以前在苹果公司工作？你研究iOS还是MacOS？我们很想听到你的消息。您可以通过Signal安全地联系Lorenzo Franceschi-Bicchierai，电话：+1 917 257 1382，OTR聊天电子邮件：lorenzofb@jabber.ccc.de，或电子邮件lorenzofb@vice.com。\n然后，他利用了另一位研究人员发现的一个漏洞，该漏洞允许黑客通过创建以“$”符号开头的文件来逃离Microsoft Office沙箱。最后，问题的最后一块是意识到如果该文件是.zip文件，MacOS不会根据其新的公证保护对其进行检查，从技术上讲，除非文件来自已知的开发者，否则不允许从互联网下载的文件访问用户文件。\n值得一提的是，沃德尔也承认，为了让这个漏洞发挥作用，受害者必须在两个不同的场合登录他们的Mac电脑，因为每次登录都会触发链中的不同步骤。然而，这并不意味着它不能工作，特别是在黑客以尽可能多的人为目标，希望有人上当的情况下。\n微软的一位发言人在一份电子邮件声明中写道，公司已经“调查并确定，任何应用程序，即使在沙箱中，也容易受到这些API的滥用”。“我们正在与苹果定期讨论，以确定这些问题的解决方案，并在需要时提供支持.”\nWardle利用的漏洞现在已在最新版本的Office on Mac和MacOS 10.15.3中得到修复。沃德尔说，然而，当他报告这些缺陷时，苹果没有做出回应。\n“你知道，当我们作为安全研究人员基本上都在做这种免费的安全研究时，这只是一件有点令人沮丧的事情。”我们这样做是因为我们相信我们可以帮助我们作为Mac用户，也为其他Mac用户提高平台中生态系统的安全性，“Wardle说，他指的是他向苹果报告的错误。\n“我还是收到了苹果公司寄来的零点零美元。所以，你知道，也许里面有一个条款，就像是没有钱给帕特里克，这很好，“他笑着补充道。\n签署“色情通讯”，即表示您同意接收来自“色情通讯”的电子通讯，其中有时可能包括广告或赞助内容。", "note_en": "Mac computers have long enjoyed the reputation of being more secure than their Windows counterparts. Over the last few years, however, as more and more people choose Macs—especially at big corporations— that notion is changing thanks to  hackers  turning  their  sights on Apple’s computer operating system.\n  On Wednesday, former NSA hacker Patrick Wardle will demonstrate how he was able to create a chain of exploits that would have allowed hackers to take control of a Mac by simply convincing the target to open a Microsoft Office file laden with a malicious macro. Creating Office files with malicious macros is  an old trick that’s been enjoying a second life lately for hackers interested in Windows targets. Wardle is now showing how macros—essentially small programs embedded in documents—could be exploited on MacOS as well.\n   “Current MacOS attacks are very ineffective, kind of lame,” Wardle told Motherboard in a phone call. “I basically said, could things be worse?”\n  As it turns out, they could. Wardle  published a blog post on Wednesday morning, and will demonstrate his findings during the Black Hat security conference on Wednesday, which is being held online this year due to the coronavirus pandemic.\n  Wardle’s hack was possible thanks to a series of happenstances and bugs he found and linked together. Wardle, who is now a security engineer at the Mac-focused company  Jamf, first realized he could create an Office file with an ancient file format (.slk), that would prompt Office to automatically run macros on MacOS without alerting the user, a technique  discovered by two other security researchers in 2018.\n  “Security researchers love these ancient file formats because they were created at a time when no one was thinking about security,” Wardle said.\n Do you work or did you use to work at Apple? Do you do research on iOS or MacOS? We’d love to hear from you. You can contact Lorenzo Franceschi-Bicchierai securely on Signal at +1 917 257 1382, OTR chat at  lorenzofb@jabber.ccc.de, or email  lorenzofb@vice.com\n  Then, he took advantage of  a flaw discovered by another researcher, which allows a hacker to escape the Microsoft Office sandbox by creating a file that starts with the “$” sign. Finally, the last piece of the puzzle was to realize that if that file was a .zip file, MacOS wouldn’t check it against its  new notarization protections, which technically won’t allow files downloaded from the internet to access user files unless they come from known developers.\n  It’s worth noting, and Wardle admitted it too, that for this exploit to work, the victim has to login into their Mac computer on two separate occasions, as every login triggers a different step in the chain. That, however, doesn’t mean it could not work, especially in a scenario where hackers target as many people as possible, hoping one falls for it.\n       A Microsoft spokesperson said that the company has “investigated and determined that any application, even when sandboxed, is vulnerable to misuse of these APIs,” the company wrote in an emailed statement. “We are in regular discussion with Apple to identify solutions to these issues and support as needed.”\n  The flaws Wardle took advantage of are now fixed for the latest version of Office on Mac, and for MacOS 10.15.3. Wardle said that, however, Apple was unresponsive when he reported the flaws.\n  “It&#39;s just a little frustrating when, you know, again, us as security researchers are basically doing this free security research. And we do it because we believe that we can help increase the security of the ecosystem in the platform for ourselves as Mac users, but also other Mac users,” Wardle said, referring to the bugs he’s reported to Apple.\n  “I still have received zero dot zero dollars from Apple. So, you know, maybe there&#39;s like a clause in there that&#39;s like &#39;no money for Patrick,&#39; which is fine,” he added laughing.\n  By signing up to the VICE newsletter you agree to receive electronic communications from VICE that may sometimes include advertisements or sponsored content.", "posttime": "2020-08-05 21:15:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,美国,黑客,hacker,安全", "title": "前美国国家安全局黑客找到通过Microsoft Office攻击Mac用户的方法", "title_en": "Ex-NSA Hacker Finds a Way to Hack Mac Users via Microsoft Office", "transed": 1, "url": "https://www.vice.com/en_us/article/jgxamy/hacker-finds-a-way-to-hack-mac-users-via-microsoft-office", "via": "", "real_tags": ["microsoft", "美国", "黑客", "hacker", "安全"]}, {"category": "", "categoryclass": "", "imagename": "2602ee9ac60ca918449d387272f6cec2.gif", "infoid": 1016390, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周二晚上，SpaceX在他们的星际飞船(Starship)航天器开发项目中取得了重大胜利，在单一猛禽发动机的推动下，未来飞行器的SN5原型飞到了约500英尺的高度。这次测试在SpaceX公司位于德克萨斯州博卡奇卡的火箭开发和测试设施进行，标志着全尺寸星际飞船原型首次离开地面。\n该公司发布了整个测试的视频，包括从无人机视角以及安装在星际飞船SN5上的摄像头拍摄的视频，这些视频位于机身内部，让人可以看到猛禽发动机的运行情况，以及着陆腿在为着陆做准备时处于激活状态。\n测试成功后，SpaceX首席执行官兼创始人埃隆·马斯克(Elon Musk)概述了星际飞船开发过程的下一步，其中包括“几个”更短的跳跃，随后是高空测试。根据马斯克的说法，着陆腿也将经历一些变化，首先在长度上延伸，然后变得更宽更高，能够在更不平坦的地形上着陆。", "note_en": "SpaceX   achieved a big win in their Starship spacecraft development program on Tuesday evening, flying the SN5 prototype of that future vehicle to a height of around 500 feet, propelled by a single Raptor engine. The test, which took place at SpaceX’s rocket development and testing facility in Boca Chica, Texas, marks the first time that a full-scale Starship prototype has left the ground.\n The company released a video of the whole test, including footage captured both from a drone’s-eye-view, as well as from a camera mounted on board Starship SN5, inside the fuselage and offering a look at the Raptor engine in action, as well as the landing legs activating in preparation for landing.\n  Following the successful test, SpaceX CEO and founder Elon Musk outlined next steps for the Starship development process, which includes “several” more short hops, followed by high altitude testing. The landing legs will also go through some changes, first extending in length and then becoming much wider and taller, with the ability to land on more uneven terrain,  according to Musk.", "posttime": "2020-08-05 20:23:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "spacex,开发", "title": "\n观看SpaceX令人惊叹的星际飞船原型“HOP”试飞和着陆", "title_en": "\n\t\t\t\tWatch SpaceX’s stunning Starship prototype ‘hop’ test flight and landing\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/05/watch-spacexs-stunning-starship-prototype-hop-test-flight-and-landing/", "via": "", "real_tags": ["spacex", "开发"]}, {"category": "", "categoryclass": "", "imagename": "66fd46f1c2e007e15bf950e0d1d822ab.jpg", "infoid": 1016389, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“万物之母”(1968)标志着几种开创性的计算机技术的引入，如鼠标、超文本和图形用户界面。被誉为活动导演的比尔·英格利希(Bill English)两天前刚刚去世。由于其突破性的技术和戏剧性的、几乎是不祥之兆的呈现，今天的演示仍然令人震惊。演讲由道格拉斯·恩格尔巴特在SRI国际增强研究中心实验室期间发表。恩格尔巴特通常专注于通过知识的协作工具来增强人类的智力。\n该演示在其计算概念上几乎是柏拉图式的；今天的远程办公室运行在协作应用程序上，这些应用程序看起来与半个世纪前展示的非常相似。这些工具建立在两个基本基础上：可编程电子计算机和数字信息传输。没有一个人提出这些想法，但有两篇论文可以说是弥合了从概念到应用工程的鸿沟：\n可编程电子计算机：约翰·冯·诺伊曼(1945)关于EDVAC的报告初稿。\n“数字信息的传输：通信的数学理论”，克劳德·香农(1948)，第一部分和第二部分。\n在它们出版后的十年内，就开始了形成所有演示之母的基础的技术方面的工作。许多公司应用了这些世纪中叶的发明，一直延续到今天。下面是一个简短的调查。\n冯·诺伊曼在一份关于EDVAC的报告初稿中列出了计算机的三个主要内部“器官”：\n1945年描述的这些单位基本上仍然是今天计算的基础。算术单元从存储单元接收数字，计算它们，然后提供再次存储的结果。控制单元根据严格的时钟周期协调信息的获取和放置，如Neumann的论文所示：\n⊕插图来自EDVAC报告的初稿。请注意，每个脉冲都是均匀间隔的，或者向上(开)或向下(关)。\n这台计算机保证在时钟的每一个滴答声中都处于稳定状态。在每个滴答声之间，计算机处于从一种状态到下一种状态的转换中--电子冲进和冲出存储单元，并通过运算单元中的数百万个门。新稳定的布置将确定在下一个时钟周期期间发生什么。\n在EDVAC报告初稿公布后不久，整个计算机行业就建立起来了。MICR和SABRE只是它们早期应用的两个例子。使资金和人员流动变得更容易，有助于建立现代全球经济。\n早在冯·诺伊曼的论文之前很久，穿孔制卡机就已经实现了金融业各部分的自动化。但是，如果时间就是金钱，那么电子计算机的速度、准确性和可靠性就是一场革命。磁性墨迹字符识别(MICR)是迈向交易自动化的关键一步。肯·吉尔摩，“银行电子学”，“电子世界”，1963年4月，第29页。\n巨头美国银行(Bank Of America)已经在招聘足够的人员来跟上其飙升的文书工作方面遇到了困难。因此，在1957年，它聘请了斯坦福研究所(Stanford Research Institute)来制定磁性墨水提案的细节。斯坦福大学的科学家们设计了一系列人类和磁传感设备都能读懂的磁性字符。[…]。美国银行在1958年谨慎地让ERMA(电子记录机会计)开始工作，但让簿记员继续工作-以防万一。然而，在几个月内，很明显，尔玛不仅可以比人做得更快，而且更准确。[…]。目前流经美联储系统的支票中，已经有近70%的支票下缘带有小的磁性数字。\n一旦计算机可以阅读纸张并自动计算交易，货币就变得更快、更容易移动。该系统的最初工作是由通用电气和SRI共同完成的，但真正利用MICR采用的是计算公司Burroughs。几十年来，它一直是公司的基石。Burroughs的创始人是作家William S.Burroughs的祖父。作者帮助推广了一种可以作为机械过程执行的切割技术。\n计算机自动化也使人们更容易移动。IBM打造的航空预订系统SABRE(Semi-Automated Business Research Environment)帮助美国航空公司利用日益增长的航空旅行需求。该公司至今仍在运营，处理着全球三分之一的航空旅行预订。Sabre墨西哥业务前首席执行官格洛丽亚·格瓦拉(Gloria Guevara)声称，在1995年至2010年间，Sabre运营着世界上最大的两个私人拥有的数据库之一。这使得它成为国家监控的丰富资源-在2016年、2017年和2019年公开遵守美国调查人员的要求。[托马斯·布鲁斯特(Thomas Brewster)，“联邦调查局正在秘密利用价值20亿澳元的旅游公司作为全球监控工具”，“福布斯”，2020年。]。\n创建航班和预订座位的数据库只是问题的一部分。将该信息传输到其他系统也同样重要。\n克劳德·香农的“通信的数学理论”描述了如何系统地对复杂的信息进行编码，并在其传输不可避免地引入噪声时如何处理其丢失：在克劳德·香农发表他的论文之前，数字电信已经活跃了几十年。例如，电报依靠一组称为摩尔斯电码的脉冲来编码和解码远距离发送的信件。电传这个词的字面意思是远距离书写；编码是对远距离快速交流的回报。\n⊕钟声系统技术期刊，第27卷，第379-423623-656页，1948年7月、10月。\n⊕钟声系统技术期刊，第27卷，第379-423623-656页，1948年7月、10月。\n用某些弹性保证编码的信息可以在发送之前被压缩或分解。数据完整性的承诺意味着碎片可以从世界的任何地方寻址，并最终重新组合成一个有意义的整体。\n信息论立即使人、钱和思想的流动变得更容易。美国国家标准研究所(ANSI)前主席、信息时代数字隐私领域的早期参与者约翰·兰克(John Ranke)在20世纪80年代向美国国会作证时提到了这种力量：我最初引用了约翰·兰肯(John Rankine)在个人隐私(Personal Privacy)一书中的话，这是受到下面IBM广告的启发。“个人隐私”研究了为什么数字隐私法在半个世纪的立法之后变得如此无效。\n如果没有高度的信息交流，美国和欧洲的航空航天工业都不可能取得这样的进步，从而开创了航空运输的一个全新时代。类似的例子也存在于医疗、教育、通信、能源、信息处理和消费者服务等领域。\n约翰·兰肯，IBM公司标准、产品安全和数据安全总监，1980年3月10日在美国众议院发表的声明。\n如果没有调制解调器，Sabre系统就不可能在计算机之间传输机票预订。美国电话电报公司(AT&amp；T)在1958年推出了他们的第一款商用调制解调器Bell 101 Dataset Modem。这些计算机使用的通信协议最终随着分组交换的发明而被取代，分组交换出现在早期的计算机网络中，如NPL网络、ARPANET和Cyclades。运行当今互联网的分组交换的具体实现，TCP/IP，于1983年1月1日在ARPANET上开始服务。NSF的CSNET(国家科学基金会的计算机科学网络)在同月上线，也是使用TCP/IP。丹尼斯·詹宁斯(Dennis Jennings)于1985年来到NSF，领导整个计划(包括新的超级计算网络)采用TCP/IP。其他非NSF计算机网络也紧随其后，该协议现在无处不在。\n佩剑有助于人的快速移动，但思想可以移动得更快。卫星通信使它们的传输几乎是即时的，并且在遥远的距离上更加灵活。\n1962年，IBM通过卫星将第一批数据从纽约传输到法国。“IBM档案：IBM和Telstar”，IBM.com，2003。这一努力也标志着人类历史上第一次通过卫星进行视频广播。\n50年后，布莱恩·威廉姆斯(Brian Williams)结束了NBC晚间新闻，他播放了来自埃及开罗的实况画面，并感谢“Telstar，Version 12”。\n所有演示之母是快速信息处理和传输的综合体，其构思方式是增强人类智能并帮助远距离协作。我们站在巨人的肩膀上，巨人站在巨人的肩膀上。", "note_en": "The Mother of All Demos (1968) marks the introduction of several seminal computer technologies such as the mouse, hypertext, and the graphical user interface. The person  credited with directing the event, Bill English, passed away just two days ago. The demonstration is still striking today because of its breakthrough technologies and dramatic, almost ominous presentation.    The presentation was given by Douglas Engelbart during his time at the Augmentation Research Center Lab in SRI International. Engelbart was generally focused on augmenting human intelligence through collaborative tools of knowledge.\n  The demo is almost platonic in its concept of computing; today’s remote office runs on collaborative applications that look remarkably similar to what was shown a half-century ago. The tools were built upon two essential foundations: the  programmable electronic computer and the  transmission of digital information. No single person came up with these ideas, but two papers arguably bridge the gap from concept to applied engineering:\n The programmable electronic computer:   First Draft of a Report on the EDVAC by John von Neumann (1945)\n The transmission of digital information:  A Mathematical Theory of Communication, parts  I &amp;  II by Claude Shannon (1948)\n Within ten years of their publication, work started on the technologies that form the foundation for  The Mother of All Demos. Many companies that applied these mid-century inventions endure to this day. What follows is a brief survey.\n  Von Neumann laid out the three main internal “organs” of a computer in  First Draft of a Report on the EDVAC:\n  These units as described in 1945 essentially remain the foundation for computing today. The  arithmetic unit receives numbers from the  memory unit, computes them, and then provides a result which is once again stored. The  control unit coordinates the getting and putting of information based on a strict clock cycle, illustrated below in Neumann’s paper:\n ⊕   Illustration from  First Draft of a Report on the EDVAC. Notice each pulse is an evenly spaced, either up (on) or down (off).\n The computer promises to be in a stable state at every tick of the clock. In between each tick, the computer is in transition from one state to the next - electrons rush to and from the memory unit and through millions of gates in the arithmetic unit. The newly stabilized arrangement will determine what happens during the next clock cycle.\n An entire computer industry was established shortly after the publication of  First Draft of a Report on the EDVAC. MICR and SABRE are just two examples of their early application. Making the movement of money and people easier helped establish the modern global economy.\n   Punch card tabulators automated parts of the finance industry long before Von Neumann’s paper. But if time is money, the speed, accuracy, and reliability of electronic computers were a revolution. Magnetic ink character recognition (MICR) was a critical step towards transaction automation.    Ken Gilmore, “Electronics In Banking”,  Electronics World, April 1963, pp. 29.\n The giant Bank of America was already having trouble hiring enough people to keep up with its soaring paper work. So in 1957 it hired Stanford Research Institute to work out the details of the magnetic ink proposal. Stanford scientists designed a series of magnetic characters which would be readable by both human beings and magnetic sensing devices. […] Bank of America cautiously put ERMA (Electronic Recording Machine Accounting) to work in 1958, but kept bookkeepers on the job - just in case. Within a few months, however, it was obvious that ERMA could not only do the job faster than people, but more accurately as well. […] Already, nearly 70% of the checks now flowing through the Federal Reserve System bear the small magnetic numbers on the lower edge.\n Once computers could read paper and automatically calculate transactions, money became much faster and easier to move.    The initial work on the system was done by General Electric in conjunction with SRI, but it was the computing firm Burroughs that truly exploited MICR’s adoption. It was a cornerstone of the company for decades. The founder of Burroughs is the grandfather of writer William S. Burroughs. The author helped popularize a  cut-up technique that could be executed as a mechanical process.\n  Computer automation also made people easier to move. SABRE (Semi-Automated Business Research Environment), an airline reservation system built by IBM, helped American Airlines capitalize on the growing demand for air travel. The company still operates today, handling  a third of all air travel bookings in the world.    Gloria Guevara, former CEO of Sabre’s Mexican business, claims that between 1995 and 2010 Sabre operated one of the two largest privately-owned databases in the world. This makes it a rich resource for state surveillance - having publicly complied with American investigators in 2016, 2017, and 2019. [Thomas Brewster, “ The FBI Is Secretly Using A $2 Billion Travel Company As A Global Surveillance Tool”,  Forbes, 2020.]\n  Creating a database for flights and reserved seats was only part of the problem. Transmitting that information to other systems was just as crucial.\n  Claude Shannon’s  A Mathematical Theory of Communication describes how to systematically encode complex information and deal with its loss when noise is inevitably introduced into its transmission:    Digital telecommunications excited for decades before Claude Shannon published his paper. For example, the telegraph relied on a set of pulses known as  Morse Code to encode and decode letters sent over a distance. The word  tele-graph literally means  far-writing; encoding is a requite for speedy communication over a distance.\n ⊕   The Bell System Technical Journal,Vol. 27, pp.  379–423,  623–656, July, October, 1948\n  ⊕   The Bell System Technical Journal,Vol. 27, pp.  379–423,  623–656, July, October, 1948\n Information encoded with certain resiliency guarantees can be compressed or broken up before it is sent out. A promise of data integrity means that fragments can addressed from anywhere in the world and ultimately reassembled into a meaningful whole.\n Information theory immediately made the movement of people, money, and ideas easier. John Ranke, the former chair of  American National Standards Institute (ANSI) and an  early actor in the field of digital privacy in the information age, testified about this power to the United States Congress in the 1980s:    I originally cited John Rankine in   Personal Privacy, prompted by the IBM advertisement seen below.   Personal Privacy examines why digital privacy laws have been so ineffective after a half century of legislation.\n Neither the United States nor European aerospace industries could have progressed as they have without a high degree of information exchange, thus ushering in a whole new era in air transportation. Similar examples exist in the fields of medicine, education, communications, energy, information processing, and consumer services.\n John Rankine, Director of Standards, Product Safety and Data Security, IBM Corp.,  Statement to the United States House of Representatives, March 10, 1980.\n  The SABRE system would not have been possible without a modem to transmit flight reservations between computers. AT&amp;T introduced their first commercial modem, Bell 101 Dataset Modem, in 1958. These computers used a communications protocol that was eventually displaced with the invention of  packet switching, seen in early computer networks like the NPL network, the ARPANET, and CYCLADES.    The specific implementation of packet switching that runs today’s internet, TCP/IP, began service on the ARPANET on January 1, 1983. NSF’s CSnet (National Science Foundation’s Computer Science network) came online that same month, also using TCP/IP. Dennis Jennings came to the NSF in 1985  to lead the adoption of TCP/IP across the entire program, including the new supercomputing network. Other non-NSF computer networks soon followed and the protocol is now ubiquitous.\n  SABRE aided the speedy movement of people, but ideas can move much faster. Satellite communication makes their transmission nearly instantaneous and much more flexible over vast distances.\n IBM transmitted the first data over satellite from New York to France in 1962.    “ IBM Archives: IBM And Telstar”, ibm.com, 2003.   This endeavor also marks the first video broadcast via satellite in human history.\n Fifty years later, Brian Williams signs off NBC Nightly News by showing live footage from Cairo, Egypt and thanking “Telstar, version 12.”\n  The  Mother of All Demos is the synthesis of speedy information processing and transmission, conceived in a way to augment human intelligence and aid collaboration over a distance. We stand on the shoulders of giants who stood on the shoulders of giants.", "posttime": "2020-08-05 20:21:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "之母,mother,传输", "title": "万物之母的母亲", "title_en": "The Mothers of the Mother of All Demos", "transed": 1, "url": "https://schmud.de/posts/2020-08-04-mother-of-mothers.html", "via": "", "real_tags": ["之母", "mother", "传输"]}, {"category": "", "categoryclass": "", "imagename": "19666185bb0332dd963dc11b0df572fa.jpg", "infoid": 1016388, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尼日利亚交通初创公司Plentywaka宣布，它已经获得了30万美元的种子前投资，这也将帮助其进入阿布贾。这一轮种子前投资融资由EMFATO、MicroDrawing和利基资本(Niche Capital)牵头。\n自2019年9月以来，Plentywaka一直在拉各斯运营叫车服务。随着这座城市的成功，它似乎验证了市场需求。\n“在大流行期间，在我们的第一年内获得投资并扩展到阿布贾，充分说明了对我们提供的服务的需求。我们很高兴有看到并相信我们愿景的投资伙伴加入我们的行列。高效的交通系统是任何城市繁荣的基础，我们相信安全、方便和舒适的旅行不应该只是少数人的旅行，而应该是每个人的旅行。阿布贾的Plentywaka使我们更接近于改造尼日利亚的交通运输，一次一个州，“Plentywaka董事总经理兼联合创始人Johnny Enagwolor说。\nPlentywaka援引一项研究称，尼日利亚首都70%的人依赖公共交通，在缺乏强大的交通系统的情况下，他们发现尼日利亚的交通市场在阿布贾提供更可靠、更高效的公共汽车服务方面存在巨大缺口。\n近年来，拉各斯州政府已经禁止了一种广受欢迎的公共交通方式，即OKADAS(摩托车出租车)。这一禁令导致许多冈田叫车初创公司转向物流，并留下了一个市场空白，需要可靠的公共交通服务来填补。\n然而，冈田叫车初创公司和Plentywaka本质上都是在履行一项服务，这项服务本应是政府的一项公共服务提供职能。政府缺乏公共交通，留下了一个可以由私营公司填补的空白。\n这家初创公司报告称，自2019年9月推出以来，他们已经为超过4万名客户提供了服务，仅6个月就达到了10万次乘车的里程碑。\n除了向阿布贾扩张外，Plentywaka还推出了解决方案驱动的服务，如Plentywaka及其员工巴士解决方案公司的物流。\n自去年第三季度推出以来，Plentywaka的快速增长到目前为止一直是惊人的。我们很高兴能与一支非常强大的团队合作，他们热衷于为日常通勤者提供便利、安全和舒适。这些通勤者中的大多数人的痛苦和不安经历是显而易见的，特别是在大城市。我们支持Plentywaka团队通过创建一种高效的交通系统，逐步改变通勤者的这种体验，微牵引公司合伙人戴奥·科莱奥沃(Dayo Koleowo；)表示。\n通过以下方式共享此信息：", "note_en": "Plentywaka, a Nigerian transport startup, has announced that it has secured a $300,000 pre-seed investment that will also help it launch into Abuja. The pre-seed investment funding round is led by  EMFATO,  Microtraction, and  Niche Capital.\n Plentywaka has been running a ride-hailing bus service in Lagos since September 2019. With the success in the city, it appears it has validated a market need.\n “Securing investment and expanding into Abuja within our first year, in the midst of a pandemic speaks volumes of the demand for the service we provide. We are excited to have investment partners on board that see and believe in our vision. An efficient transport system is fundamental to the prosperity of any city and we believe safe, convenient and comfortable travel should not just be for the few; but for everyone. Plentywaka in Abuja brings us closer to transforming transport in Nigeria, one state at a time,” said Johnny Enagwolor, Managing Director and Co-Founder, Plentywaka.\n   Plentywaka cites research that says that 70% of people in Nigeria’s capital city rely on public transport and that, in the absence of a robust transport system, they have identified a significant gap in Nigeria&#39;s transport market for a more reliable and efficient bus service in Abuja.\n In recent years the  Lagos State Government has banned one form of public transportation that proved popular, namely okadas (motorbike taxis). This ban led to many okada-hailing startups pivoting to logistics and leaving a market gap for a reliable public transport service to fill.\n However, both the okada-hailing startups and Plentywaka are essentially performing a service that should be a public service delivery function by the government. This lack of public transportation by the government leaves a gap that can be filled by private companies.\n  The startup reports that since their launch in September 2019, they have serviced over 40,000 customers, reaching a milestone of 100,000 rides after just 6 months.\n Apart from expanding into Abuja, Plentywaka has also launched solution-driven services such as Logistics by Plentywaka and its Staff Bus Solutions.\n &#34;Plentywaka&#39;s rapid growth since they launched Q3 last year has been tremendous so far. We are glad to be partnering with a very strong team that is passionate about providing convenience, safety, and comfort to everyday commuters. The distressful and uneasy experience by the majority of these commuters, especially in large cities is evident. We are backing the Plentywaka team to change that experience for commuters progressively by creating a transport system that is efficien,&#34; said Dayo Koleowo, Partner at Microtraction.\n    Share this via:", "posttime": "2020-08-05 20:20:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "获得,ride,plentywaka", "title": "尼日利亚叫车服务初创公司获得种子前投资", "title_en": "Nigerian ride-hailing bus service startup secures pre-seed investment", "transed": 1, "url": "https://www.iafrikan.com/2020/08/05/nigerias-plentywaka-secures-300-000-investment-and-launches-in-abuja/", "via": "", "real_tags": ["获得", "ride"]}]