[{"category": "", "categoryclass": "", "imagename": "14fe4eaea047d40a8e138fa49e170ea9.jpg", "infoid": 1013713, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司最近发布了其旗舰自行车的第三代，这款自行车完全是在现有产品的基础上进行改进和迭代。如果你还没有在欧洲城市看到过，它的特色是标志性的三角形铝制框架，集成了药丸状的灯光。\n在注重简单性的情况下，没有齿轮或按钮来控制马达辅助。当你开始踩踏板时，马达会自动启动。牛仔自行车的一些关键特征是碳带、带刺穿保护层的定制轮胎和可拆卸的电池。\n牛仔自行车也是联网的自行车，这要归功于一些电子元件。例如，您可以在不使用自行车时将其锁定。该公司目前正在测试自动解锁，这是一项利用蓝牙低能耗来检测手机的功能。\n通过结合来自加速度计、自行车速度和你的踏板功率的数据，牛仔还将很快自动检测碰撞并通知紧急联系人。\n除了设计自行车，牛仔还是一家服务公司。它已经建立了维修合作伙伴网络，并为潜在客户提供试乘服务。它现在几十个欧洲城市都可以买到。\n该公司还提供一种保险产品，这要归功于与Qover的合作伙伴关系。每月8欧元，当有人试图偷你的自行车时，你可以收到实时通知，而且你有被盗保险。每月10欧元，您还可以投保损失险。\n通过今天的一轮融资，这家初创公司计划在未来6个月内雇佣30多人，扩大其试乘网络，并通过Flex扩大生产运营规模。", "note_en": "The company recently released the  third generation of its flagship bike, which is all about refinements and iterating on its existing offering. If you haven’t seen one in a European city, it features an iconic triangle-shaped aluminum frame with integrated pill-shaped lights.\n With a focus on simplicity, there are no gears or buttons to control motor assistance. The motor kicks in automatically when you start pedaling. Some of the key features of the  Cowboy   bike are the carbon belt, custom-made tires with a puncture protection layer and the detachable battery.\n  Cowboy bikes are also connected bikes thanks to some electronic components. For instance, you can lock your bike when you’re not using it. The company is currently testing auto-unlock, a feature that takes advantage of Bluetooth Low Energy to detect your phone.\n By combining data from the accelerometer, the speed of the bike and your pedal power, Cowboy will also soon automatically detect crash and notify an emergency contact.\n In addition to designing a bike, Cowboy is also a service company. It has built a network of repair partners and offers  test rides to potential clients. It is now available in dozens of European cities.\n The company also offers an insurance product thanks a partnership with  Qover. For €8 per month, you can receive real-time notification whenever someone is trying to steal your bike and you’re insured against theft. For €10 per month, you’re also insured against damage.\n With today’s funding round, the startup plans to hire over 30 people in the next six months, expand its network of test rides and scale production operations with Flex.", "posttime": "2020-07-23 17:32:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "自行车,bike", "title": "\n电动自行车制造商牛仔筹集2600万美元", "title_en": "\n\t\t\t\tElectric-bike maker Cowboy raises $26 million\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/23/electric-bike-maker-cowboy-raises-26-million/", "via": "", "real_tags": ["自行车", "bike"]}, {"category": "", "categoryclass": "", "imagename": "c4e21e906974abe0c34697018883344f.jpg", "infoid": 1013711, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Pinephone vlog：在Pinephone上演示Manjaro Linux，功能和工作：通话(输入/输出)、短信/文本(输入/输出)、WiFi数据、蜂窝数据、互联网、Wireshark.", "note_en": "Pinephone VLOG: Demo of Manjaro Linux on Pinephone, functional & working: calls (in/out), SMS/text (in/out), WiFi data, Cellular data, internet, wireshark......", "posttime": "2020-07-23 17:30:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,wifi,手机,manjaro,数据", "title": "Pinephone Manjaro Linux：工作短信/通话/手机数据/WiFi/摄像头", "title_en": "Pinephone Manjaro Linux: Working SMS/Calls/Cell Data/WiFi/Cam", "transed": 1, "url": "https://www.youtube.com/watch?v=0oIF9z6Bwzw", "via": "", "real_tags": ["linux", "wifi", "手机", "manjaro", "数据"]}, {"category": "", "categoryclass": "", "imagename": "a7e83786b9bb75ac27401b47256c3568.jpeg", "infoid": 1013710, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您好，我刚刚开始学习c#，我即将开始学习Mosh Hamedani的一门关于Udemy的课程，名为“初学者的C#基础：通过编码学习C#基础”。我看得出他使用的是.NET Framework，但我读到.NET Core是较新的，是未来吗？我真的不知道从哪里开始，如果有人能帮我的话，我会很高兴的。我想学习C#，以便更好地理解OOP，并学习一种编程语言来帮助我的大学课程。谢谢。\n首先，祝贺作者学习了C#，这是一个很好的编程语言选择，并为更好地理解面向对象编程(OOP)的概念付出了额外的努力！我真心希望他们在学习.NET的过程中会有很好的体验，最重要的是，他们会喜欢学习一些新技能，并在学习过程中获得乐趣！我还记得我开始编程的时候(20多年前)，那对我来说是多么有趣！看到有多少人回复了真正有帮助的答案，并为原始帖子提供了一些有用的指导，这也是一件很棒的事情！这真正证明了.NET社区是多么的支持和欢迎！然而，尽管有这些积极的观察，我仍然有点气馁，因为这样的问题一开始就不得不问。我并不是在暗示作者本身有什么过错--恰恰相反--我真的很同情他们，能够理解一个新的C#或F#开发人员可能面临的挣扎。这样的问题确实说明了这些年来.NET已经变得多么复杂。现在是退一步反思的好时机！\n.NET有很高的认知进入门槛。我这么说的意思是，新的开发人员必须在他们的教育旅程中过早地迅速熟悉相当无聊和复杂的主题。特别是关于.NET、.NET Core、Mono、Xamarin之间的区别，以及C#、F#、VB.NET和什么是目标框架或运行时之间的关系的问题，对人们最初的学习体验几乎没有什么好处。大多数初来乍到的人只想阅读教程、看视频或上课，然后能够以一种简单而简单的方式应用他们新学到的技能。理想情况下，教育材料，如几个多月前购买的在线课程或书籍，今天应该仍然适用。不幸的是，这两个都不适用于.NET。事实上，几乎可以说，一年多前编写的任何内容在今天基本上都已经过时了。只要想想即将发布的.NET5，以及它将如何使几个月前教给我们的大部分课程失效。另一个突出的例子是非常短暂的.NET标准。曾经盛行福音派，现在事实上已经死了。我个人认为微软、.NET团队以及在某种程度上更广泛的.NET社区在使.NET成为更适合初学者的语言方面失败了。我说这话是出于内心的好意。编程是一项非常强大的技能，可以让人们从各种背景中提升自己，我们对初学者来说越难，我们进入我们的职业就越排他性。我认为下一个十年的成功将取决于我们如何让一群全新的开发人员访问.NET，我认为为了改善目前的状况，还有一些真正的工作要做！\n在你认为目前的复杂性在编程中是正常的，没有.NET本身特有的东西之前，我恐怕要证明你错了。请看一下PHP。PHP在过去几年中发展了很多，虽然它引入了更复杂的面向对象的概念并改进了性能，但它丝毫没有失去最初简单的美感。PHP是一门很好学的编程语言。初学者的内容就像沙滩上的沙子一样存在。在线社区、论坛、Reddits和会议都是首屈一指的。最重要的是，一个学生可以把一本几年前的PHP书传给另一个人，但他们仍然会从中获得很大的价值。这门语言可能已经向前发展了，但是很多在初学者水平上教授的东西在今天仍然是百分之百准确的。这是一个巨大的优势，像我这样的高级开发人员很容易忘记这一点。此外，语言和解释器之间的区别不是PHP新开发人员必须理解的。一个初学者不必把头脑绕在这些相对不重要的话题上才能开始。他们只知道他们已经安装了PHP并且运行正常。\n另一个很好的例子(有很多很好的例子)是围棋。围棋根本不是一门新语言。它已经有10多年的历史了，尽管在语言、编译器和标准库方面有了巨大的改进，但它仍然忠于最初的简单设计。与PHP类似，新开发人员不必测试\n不过，最令人沮丧的是，对一种语言的更改会给另一种语言带来额外的复杂性。\n这三种语言之间的互操作问题对新开发人员来说是一个很大的负担，特别是当他们从C#以外的其他东西开始的时候。然而，尽管这可能很痛苦，但互操作问题并不是初学者必须面对的唯一复杂性。尝试以一种有意义的方式向C#新用户解释他们何时应该对标准类、接口、抽象类或具有默认方法实现的接口使用继承。这些选项之间的差异已经被淡化，以至于人们不能再用一个连贯的答案来解释这些差异。\n以这个StackOverflow问题为例。下面接受的(且最受欢迎的)答案中描述的任何内容都不适用于今天使用默认方法实现的接口：\n另一个很好的例子是种类越来越多的C#数据类型。什么时候适合创建数据类、不可变数据类、可变结构、不可变结构、元组类、命名元组的新概念或即将出现的记录类型？\n经验丰富的.NET开发人员在何时使用这些类型时非常固执己见，根据初学者会问谁，或者他们会阅读哪个StackOverflow线程，他们很可能会得到非常不同的建议，而且往往是相互矛盾的。任何不认为这是一个大问题的人都必须严肃地否认这一点。学习一门编程语言本身就够难的了。在两个导师(你可能会尊敬的人)给你相互矛盾的建议的情况下，学习一门编程语言就更难了。\n具有讽刺意味的是，许多新添加的语言和框架功能本应使.NET更容易学习：\n(顺便说一句，很长一段时间以来，我一直是删除.csproj和.sln文件的坚定支持者，但之前微软员工为它们辩护，就好像有人冒犯了他们的家人，所以很高兴终于看到这个想法得到了一些支持！：)。\n别误会我的意思，我同意斯科特的观点，这一特殊功能会让编写第一个Hello world应用变得比以前容易得多。然而，我们的朋友约瑟夫·伍德沃德(Joseph Woodward)提出了一个很好的观点，那就是没有什么是免费的：\n这不仅仅是学习如何编写C#。学习.NET的很大一部分是阅读其他人的代码，这本身也变得更加困难：\n虽然我确实喜欢并支持向C#添加更多功能的想法，但我不能忽视这样一个事实，即这也是要付出代价的。\n一些人提出了一个很好的观点，认为现在可能是时候考虑让一些旧功能过时了：\n无论一个人的个人观点是什么，特性膨胀肯定会成为C#社区日益关注的问题，而微软如果不倾听或者至少做一些笔记，那将是愚蠢的。\n考虑到F#已经是一种函数式的第一种多范例语言，而且C#肯定也在朝着这个方向发展，也许有一天会有机会将这两种语言合并为一种语言？(是的，我敢提出来！)。要么这样，要么微软应该建立100%的功能对等，这样语言之间的互操作是无缝的，唯一的区别因素仍然是它们的语法-一个面向功能的第一次体验，另一个面向面向对象的等价语言。\n如上所述，所有三种.NET语言都是从.NET独立发展而来的。C#正在向版本9发展，F#正在接近版本5，而VB.NET已经在版本16。同时，.NET Framework在版本4.8，.NET Core在版本3.1。不要让我开始使用Mono、Xamarin或ASP.NET。\n现在我明白了，所有这些东西都是非常不同的，我正在比较苹果和橙子，但是一个新的开发人员怎么可能知道所有这些呢？所有这些组件都是独立的，但又足够相关，足以让新开发人员对下面这样的屏幕感到不知所措：\n即使是有5年以上经验的.NET开发人员也很难消化上述信息。我知道这是事实，因为我在面试中经常问这个问题，很少能得到正确的解释。问题不是这些信息太冗长、错误或没有必要知道，而是不幸的是.NET已经变得如此庞大。事实上，它甚至更大，但我相信.NET团队已经尽了最大努力将这个屏幕压缩成尽可能简单的形式。我理解其中的困难--如果你有一个非常成熟和功能丰富的平台，那么就有很多需要解释的地方--但尽管如此，它看起来并不是特别性感。\n与.NET相比，这是围棋初学者面临的认知负担：\n它在各方面都要简单得多。诚然，这不是一个完全公平的比较，因为围棋被直接编译成机器代码，因此SDK和运行时之间并没有真正的区别，但我的观点仍然是一样的。当然还有很大的改进空间，我不认为我们今天在那里看到的是我们能做的最好的。\n也许将语言、ASP.NET核心和.NET(核心)版本正式统一起来，每次发布一个连贯的发行版会有一些价值吗？幸运的是，.NET5是朝着这个方向迈出的正确的一步，但在我看来，还有更多的事情要做！\n这可能会触动一些人的神经，但.NET的一个“大”问题是，微软到处都痴迷于.NET的想法。每一项新开发的目标都是将所有东西统一到一个大平台中，以迎合可以想象到的每一个可能的用例：\n(多亏了本·亚当斯，我更新了这张图片，以代表.NET的全貌。本为自己的博客创作了这张图片，您可以在www.ageofascent.com/blog上阅读。)。\n在许多方面，这很有意义，但所采取的角度造成的伤害大于帮助。虽然走在舞台上向潜在客户吹嘘你的产品可以解决他们现有和未来的所有问题是很有意义的，但当你真的想让来自各种不同行业的新开发人员加入时，这并不总是最好的方法。\n将整个堆栈统一到一个.NET平台中并不是没有代价的。多年来，东西一直在移动，新的东西不断涌现，其他的东西也被丢弃了。就在最近，我不得不再次重新分解我的ASP.NET核心启动代码：\n每一次为了统一而统一事物的尝试都会使简单的代码变得更加冗长。毫无疑问，前面的代码更容易理解。我赞同通用主机的概念，但人们不得不想知道开发人员实际想要将两台服务器组合成一台服务器的频率有多高？在我看来，必须有真正的好处才能证明复杂性是合理的，比如将一个构建器放在另一个构建器中！开发人员多久想要“创建”一个Web服务器，而不是“运行”它？我确信这些边缘情况确实存在，但是为什么不能对其他99.9%的正常发生的用例隐藏它们呢？\n尽管构建器模式很好很有用，不管lambda表达式可能会给架构带来什么好处，但对于一个只想创建hello world web应用程序的C#新手来说，这简直是疯了！\nRouter：=...//等效于.NETif Err：=http.ListenAndServe(&#34；：5000&#34；，Router)中的Startup类；err！=nil{//Handle Err}。\n微软的“瑞士军刀”方法以许多不同的方式给新的.NET开发人员带来了不必要的负担。\n例如，以下是作为.NET CLI的一部分附带的所有默认.NET模板的输出(不包括Giraffe模板)：\n它们几乎不能放在一个屏幕上。再说一次，微软有Blazor作为WASM的答案，或者他们有WPF作为Windows的选项，这很好，但为什么这些东西都作为一个丑陋的东西一起发布呢？为什么不能只有一个控制台应用程序或类库的模板，然后再有一些解释如何下载更多内容的文本呢？这是一个经典的例子，.NET Everywhere正在以这种方式进入大多数用户！\n一个新的.NET开发人员在开始编写一些基本代码之前，很少会想要淹没在选择的海洋中。大多数初来乍到的人只想设置最低限度的基础，以便启动和运行，并编写他们的第一行代码。他们甚至不在乎它是控制台应用程序还是ASP.NET核心应用程序。\n我完全支持单一.NET的想法，它可以满足各种不同的需求，但它必须以一种不那么压倒性的方式应用。Visual Studio的新项目对话不需要与微软的营销幻灯片相匹配，DotNet的new命令也不需要为每种类型的应用程序提供模板。开发人员首先被派去开发一条业务线的Web应用程序，然后被告知要开发一款Windows窗体商店应用程序，然后又被要求开发一款游戏，这种情况并不经常发生。绝对没有人需要他们的机器上横跨十个不同行业的二十个不同的模板。\n我的建议是优化初学者的.NET体验，根本不用担心高级开发人员。高级用户被称为高级用户是有原因的。如果高级开发人员想要从iOS切换到物联网开发，那么他们会知道在哪里可以找到工具。目前.NET CLI发布了15个！供用户选择的不同web应用模板。如果一个新的C#开发人员连有经验的.NET开发人员都摸不着头脑，他该如何决定正确的模板呢？微软必须明白，不是让每个工具或IDE都有一百万个不同的选项，并不意味着用户不知道这些选项确实存在。\n在我看来，围绕.NET Everywhere的整个心态是完全错误的。这应该是一个积极的副作用，而不是目标。\n我观察到的另一个问题是微软害怕被忽视。对于开发人员可能面临的几乎所有问题，微软都有解决方案。这是一项令人惊叹的成就，也是一件值得骄傲的事情(我是认真的)，但同时微软也必须学会如何给开发人员一些空间。\n当人们只看一种产品时，微软不会错过任何一次为整个产品做广告的机会。在做.NET开发吗？哦，看，这是Visual Studio，它可以帮你做到这一点！哦，顺便说一下，您可以直接部署到IIS！如果你想知道，IIS附带了Windows Server，它也可以在Azure中运行！啊哈，说到Azure，你知道吗，你也可以点击这个按钮，它会自动创建订阅并部署到云中。如果您不喜欢右击发布，我们还有Azure DevOps，这是一个功能齐全的CI/CD管道！当然没有压力，但是如果你现在就报名，我们会给你一个月的免费学分！无论如何，这只是一个友好的提醒，所以你知道，理论上我们提供全套服务，以防你需要！妈妈，看着我，看着我，现在看着我！\n再说一次，我完全理解微软为什么要这么做(我相信这里面有很多好的用意)，但它给人的印象是完全错误的，而且是完全相反的。\n嘿，伙计们，看，我们现在不同了，我们是跨平台的，我们到处跑，我们希望你们有一个很棒的体验。这里有一些东西可以帮助你旅行。\n嘿，.NET是微软的产品，而且它大多只能与其他微软产品一起使用，所以这里有一些你必须要用到的东西！\n一方面，微软想要创建这个新品牌的开源、跨平台开发工具链，但另一方面，每当Visual Studio和Azure使用.NET时，他们就会推动它们。这是在传递复杂的信息，让新的开发人员感到困惑，削弱了.NET的实际才华，并对整个开发平台造成了巨大的伤害。令人沮丧的是，.NET对世界开放的程度越高，微软推动他们自己的专有工具的力度就越大。如今，当你看到一些最具标志性的.NET员工发表关于.NET的演讲时，只有50%的人是.NET，其余的都在宣传Windows、Edge和Bing。这不是大多数.NET开发人员看到的，在其他编程社区，如Node.js、Rust或Go中也不会出现这种情况。此外，如果有人不断地宣传每月微软的每一种新口味，那么随着时间的推移，他们也会失去开发人员的可信度。\n这个问题，特别是答案真的很糟糕，贝卡\n.", "note_en": "Hello, I am just starting to learn c# and i am about to start with a course on Udemy by Mosh Hamedani called &#34;C# Basics for Beginners: Learn C# Fundamentals by Coding&#34;. I can see that he is using .NET Framework but i have read that .NET Core is newer and is the future? I am really not sure where to start and would appreicate if anyone could help me. I would like to learn C# to have a better understanding with OOP and to learn a programming language to help with my Univeristy course. Thank you\n First of all congratulations to the author for learning C# which is a great choice of programming language and for putting in the extra effort into better understanding the concepts of OOP (object oriented programming)! I genuinely hope that they&#39;ll have a great experience learning .NET and most importantly that they&#39;ll enjoy picking up some new skills and have fun along the way! I remember when I started to code (more than 20 years ago) and how much fun it was for me! It is also great to see how many people have replied with really helpful answers and provided some useful guidance to the original thread! It is a true testament to how supportive and welcoming the .NET community is! However, despite these positive observations I&#39;m still a little bit gutted that such a question had to be even asked in the first place. I don&#39;t imply any fault on the author themselves - quite contrary - I actually really sympathise with them and can understand the sort of struggles which a new C# or F# developer may face. Questions like these really demonstrate how complex .NET has become over the years. It is a good time to take a step back and reflect!\n  .NET has a high cognitive entry barrier. What I mean by this is that a new developer has to quickly familiarise themselves with rather boring and complex topics way too early in their educational journey. In particular questions around the differences between .NET, .NET Core, Mono, Xamarin, and the relation between C#, F#, VB.NET and what a target framework or a runtime is add very little to almost no benefit to one&#39;s initial learning experience. Most newcomers just want to read a tutorial, watch a video or attend a class and then be able to apply their newly learned skills in an easy and uncomplicated way. Ideally educational material such as purchased online courses or books from more than a few months ago should still be relevant today. Unfortunately neither of these are true for .NET. As a matter of fact it&#39;s almost given that any content which has been written more than a year ago is largely outdated today. Just think about the  upcoming release of .NET 5 and how it will invalidate most of the lessons taught just a few months ago. Another prominent example is the very short lived  .NET Standard. Once hugely evangelised and now de-facto dead. I personally think Microsoft, the .NET team and to some extent the wider .NET community has failed in making .NET a more beginner friendly language. I say this from a good place in my heart. Programming is an extremely powerful skill which can allow people to uplift themselves from all sorts of backgrounds and the harder we make it for beginners, the more exclusive we make the entry to our profession. I think the success of the next ten years will be defined by how accessible we make .NET to a whole new population of developers and I think there&#39;s some real work to be done in order to improve the current situation!\n  Before you think that the current complexity is normal in programming and nothing endemic to .NET itself then I&#39;m afraid to prove you wrong.  Take a look at PHP. PHP has evolved a lot over the years and while it has introduced more complicated object oriented concepts and improved on its performance, it hasn&#39;t lost the beauty of its original simplicity at all. PHP is a great programming language to learn. Beginner content exist like sand on a beach. The online community, forums, Reddits and conferences are second to none. Most importantly, a student could pass on a several years old PHP book to another person and they would still get a lot of value from it. The language might have moved on, but many things which were taught on a beginner level are still 100% accurate today. This is a huge advantage which gets easily forgotten by more advanced developers like myself. Furthermore the distinction between language and the interpreter is not something which a new PHP developer has to understand. A new beginner doesn&#39;t have to wrap their head around such relatively unimportant topics to get started. They just know that they&#39;ve installed PHP and it works.\n Another great example (and there are many great examples) is  Go. Go is not a new language at all. It&#39;s  been around for more than 10 years and despite huge improvements to the language, the compiler and the standard library it has remained faithful to its original simple design. Similar to PHP a new developer doesn&#39;t have to think about complicated nuances between &#34;target frameworks&#34;, weird gotchas if they write Go in one IDE or another and they certainly don&#39;t have to look up a complicated version matrix to understand the intricate relations between an SDK, the runtime and newly available language features. There is just one version which maps to a well defined list of features, bug fixes and improvements in Go. It&#39;s documentation is simple and easy to comprehend. It is a very beginner friendly language.\n  Why is .NET so complicated? Well, the answer is perhaps not that easy itself. It&#39;s mostly history, legacy baggage, some bad decisions in the past and what I believe an overly eager desire (almost urgency) to change things for changes&#39; sake. I will try to name a few selected issues from my personal observation, describe the problems which I have perceived and try to provide some constructive suggestions which I think could be a good improvement for the future.\n    If a person sets out to learn C# (like the author from the question above), what do they learn? Is it C# or .NET? The answer is both. C# doesn&#39;t exist without .NET and you cannot program .NET without C# (or F# or VB.NET for that matter). This is not a problem in itself, but certainly where some of the issues begin. A new beginner doesn&#39;t just learn C# but also has to learn the inner workings of .NET. Things get even more confusing when C# isn&#39;t the initial .NET language to learn. Supposedly the loose relationship between .NET languages shouldn&#39;t really matter because they compile into IL and become cross compatible.  Except when they don&#39;t:\n  The  BCL (Base Class Libraries) provide the foundation for all three languages, yet they are only written in C#. That&#39;s not really an issue unless entire features were written with only one language in mind and are extremely cumbersome to use from another. For example, F# still doesn&#39;t have  native support for  Task and  Task&lt;T&gt;, converting between  System.Collection.* classes and F# types is a painful undertaking and F# functions and .NET  Action&lt;T&gt; objects don&#39;t map very well.\n The most frustrating thing though is when  changes to one language force  additional complexity on another.\n Interop issues between those three languages are a big burden on new developers, particularly when they start with something else but C#. However, as painful as this might be, interop problems are not the only complexity which a new beginner has to face. Try to explain to a new C# user in a meaningful way when they should use  inheritance with standard classes,  interfaces,  abstract classes or  interfaces with default method implementations. The differences between those options have been so watered down that one cannot explain the distinctions in a single coherent answer anymore.\n Take this  StackOverflow question for an example. Nothing which has been described in the accepted (and most upvoted) answer below isn&#39;t also true for interfaces with default method implementations today:\n  Another great example is the growing variety of C# data types. When is it appropriate to create a  data class, an  immutable data class, a  mutable struct, an  immutable struct, a  tuple class, the new concept of  named tuples or the upcoming  record type?\n Seasoned .NET developers are very opinionated about when to use each of these types and depending on who a new beginner will ask, or which StackOverflow thread they&#39;ll read, they will most likely get very different and often contradicting advice. Anyone who doesn&#39;t think that this is a massive problem must be in serious denial. Learning a programming language is hard enough on its own. Learning a programming language where two mentors (who you might look up to) give you contradicting advice is even harder.\n The irony is that many of the newly added language and framework features are supposed to make .NET easier to learn:\n  (BTW, I have been a huge proponent of dropping the  .csproj and  .sln files for a very long time but previously Microsoft employees defended them as if someone offended their family, so it&#39;s nice to finally see some support for that idea too! :))\n Don&#39;t get me wrong, I agree with Scott that *this particular feature* will make writing a first hello world app a lot easier than before, however, our friend Joseph Woodward makes a good point that nothing comes for free:\n     It&#39;s not just about learning how to write C#. A huge part of learning .NET is reading other people&#39;s code, which is also getting inherently more difficult as a result:\n  Whilst I do like and support the idea of adding more features to C#, I cannot ignore the fact that it also takes its toll.\n Some people raised a good point that it might be time to consider making some old features obsolete:\n   Whatever one&#39;s personal opinion is, &#34;feature bloat&#34; is certainly becoming a growing concern in the C# community and Microsoft would be stupid not to listen or at least take some notes.\n Given that F# is already a  functional first multi paradigm language, and C# is definitely heading towards that direction too, maybe one day there&#39;s a future opportunity to consolidate both languages into one? (YES, I dared to suggest it!) Either that, or Microsoft should establish 100% feature parity so that interop is seamless between the languages and the only differentiating factor remains in their syntax - one geared towards a functional first experience and the other towards the object oriented equivalent.\n  As mentioned above, all three .NET languages evolve independently from .NET. C# is heading towards  version 9, F# is approaching  version 5 and VB.NET is already on  version 16. Meanwhile .NET Framework is on  version 4.8 and .NET Core on  version 3.1. Don&#39;t even get me started on  Mono,  Xamarin or  ASP.NET.\n Now I understand that all these things are very different and I&#39;m comparing apples with oranges, but how is a new developer supposed to know all of that? All these components are independent and yet correlated enough to overwhelm a new developer with screens like this:\n  Even .NET developers with 5+ years of experience find the above information hard to digest. I know this for a fact because I ask this question in interviews a lot and it&#39;s rare to get a correct explanation. The problem is not that this information is too verbose, or wrong, or unnecessary to know, but rather the unfortunate case that it&#39;s just how big .NET has become. In fact it&#39;s even bigger but I believe that the .NET team has already tried their best to condense this screen into the simplest form possible. I understand the difficulty - if you&#39;ve got a very mature and feature rich platform then there&#39;s a lot to explain - but nevertheless it&#39;s not a particularly sexy look.\n In contrast to .NET this is the cognitive load which is thrown at a beginner in Go:\n  It&#39;s much simpler in every way. Admittedly it&#39;s not an entirely fair comparison because Go gets compiled directly into machine code and therefore there isn&#39;t a real distinction between SDK and runtime, but my point is still the same. There is certainly plenty of room for improvement and I don&#39;t think what we see there today is the best we can do.\n Maybe there&#39;s some value in officially aligning language, ASP.NET Core and .NET (Core) versions together and ship one coherent release every time? Fortunately .NET 5 is the right step in that direction but in my opinion there&#39;s still more to do!\n  Now this one will probably hit some nerves, but one of the *big* problems with .NET is that Microsoft is obsessed with the idea of  .NET Everywhere. Every  new development aims at  unifying everything into  one big platform, catering for  every  single  possible  use  case  imaginable:\n  (Thanks to the courtesy of  Ben Adams I&#39;ve updated the graphic to represent the  full picture of .NET. Ben created this image for the purpose of his own blog which you can read on  www.ageofascent.com/blog.)\n In many ways it makes a lot of sense, but the angle taken is causing more harm than help. While it makes a lot of sense to walk on a stage and boast to potential customers that your product can solve all their existing and future problems, it&#39;s not always the best approach when you actually want to on-board new developers from all sorts of different industries.\n Unifying the entire stack into a single .NET platform doesn&#39;t come without a price. For years things have been constantly moved around, new things have been created and others have been dropped. Only recently I had to re-factor my ASP.NET Core startup code yet again:\n  Every attempt at unifying things for unification&#39;s sake makes simple code more verbose. Without a doubt the previous code was a lot easier to understand. I applaud the concept of a  generic host, but one has to wonder how often does a developer actually want to combine two servers into one? In my opinion there must be a real benefit in order to justify complexity such as having a builder inside another builder! How often does a developer want to *create* a web server and not *run* it as well? I&#39;m sure these edge cases do exist, but why can&#39;t they be hidden from the other 99.9% of use cases which normally take place?\n As nice and useful as the builder pattern may be, and whatever architectural benefits the lambda expression might give, to a C# newbie who just wants to create a hello world web application this is insane!\n  router := ... // Equivalent to the Startup class in .NETif err := http.ListenAndServe(&#34;:5000&#34;, router); err != nil { // Handle err}\n Microsoft&#39;s &#34;Swiss Army Knife&#34; approach creates an unnecessary burden on new .NET developers in many different ways.\n For example, here&#39;s the output of all the default .NET templates which get shipped as part of the .NET CLI (minus the Giraffe one):\n  They barely fit on a single screen. Again, it&#39;s great that Microsoft has Blazor as an answer to WASM, or that they have WPF as an option for Windows, but why are these things shipped together as one big ugly thing? Why can&#39;t there just be be a template for a console app or class library and then some text which explains how to download more? This is a classic example where &#34;.NET Everywhere&#34; is getting into most users&#39; way!\n     It&#39;s rarely the case that a new .NET developer wants to be drowned in a sea of options before they can get started with some basic code. Most newcomers just want to set up the bare bones minimum to get up and running and write their first lines of code. They don&#39;t even care if it&#39;s a console app or an ASP.NET Core application.\n I totally support the idea of a single .NET which can cater to all sorts of different needs, but it must be applied in a much less overwhelming way. Visual Studio&#39;s new project dialogue doesn&#39;t need to match Microsoft&#39;s marketing slides and the  dotnet new command doesn&#39;t have to ship a template for every single type of app. It doesn&#39;t happen very often that a developer is first tasked to work on a line of business web application, then told to build a Windows forms store app and later asked to build a game. Absolutely nobody needs twenty different templates which span across ten different industries on their machine.\n My advice would be to optimise the .NET experience for beginners and not worry about advanced developers at all. There&#39;s a reason why advanced users are called advanced. If a senior developer wants to switch from iOS to IoT development then they will know where to find the tools. Currently the .NET CLI ships FIFTEEN!!! different web application templates for a user to pick. How is a new C# developer supposed to decide on the right template if even experienced .NET developers scratch their head? Microsoft must understand that not bloating every tool or IDE with a million different options doesn&#39;t mean that users don&#39;t understand that these options do exist.\n In my opinion the whole mentality around &#34;.NET Everywhere&#34; is entirely wrong. It should be a positive side effect and not the goal.\n  Another problem which I have observed is Microsoft&#39;s fear of being ignored. Microsoft has a solution for almost every problem which a developer might face. It&#39;s an amazing achievement and something to be really proud of (and I really mean it), but at the same time Microsoft has to learn how to give developers some space.\n Microsoft does not miss a single opportunity to advertise a whole range of products when someone just looks at one. Doing .NET development? Oh look, here is Visual Studio which can help you with that! Oh and by the way you can deploy directly to IIS! In case you wonder, IIS comes with Windows Server which also runs in Azure! Aha, speaking of Azure, did you know that you can also click this button which will automatically create a subscription and deploy to the cloud? In case you don&#39;t like right-click-publish we also have Azure DevOps, which is a fully featured CI/CD pipeline! Of course there&#39;s no pressure, but if you *do sign up now* then we&#39;ll give you free credits for a month! Anyway, it&#39;s just a &#34;friendly reminder&#34; so you know that in theory we offer the full package in case you need it! C&#39;mon look at me, look at me, look at me now!\n  Again, I totally understand why Microsoft does what they do (and I&#39;m sure there&#39;s a lot of good intention there), but it comes across the complete wrong and opposite way.\n    Hey folks, look we&#39;re different now, we are cross platform, we run everywhere and we want you to have a great experience. Here&#39;s a bunch of things which can help you on your journey.\n  Hey, so .NET is a Microsoft product and it mostly only works with other Microsoft products, so here&#39;s a bunch of stuff which you will have to use!\n On one hand Microsoft wants to create this new brand of an open source, cross platform development tool chain and yet on another they push Visual Studio and Azure whenever they talk .NET. This is sending mixed messages and confusing new developers, detracting from .NET&#39;s actual brilliance and doing a massive disservice to the entire development platform. The frustrating thing is that the more .NET is becoming open to the world, the more Microsoft is pushing for their own proprietary tools. Nowadays when you watch some of the most iconic .NET employees giving a talk on .NET then it&#39;s only 50% .NET and the rest advertising Windows, Edge and Bing. This is not what most .NET developers came to see and it doesn&#39;t happen in other programming communities such as Node.js, Rust or Go either. Besides that, if someone constantly advertises every new Microsoft flavour of the month then they also lose developer credibility over time.\n   This question and particularly the answer are really bad, beca\n......", "posttime": "2020-07-23 17:24:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "面向,net", "title": "面向初学者的.NET", "title_en": ".NET for Beginners", "transed": 1, "url": "https://dusted.codes/dotnet-for-beginners", "via": "", "real_tags": ["面向", "net"]}, {"category": "", "categoryclass": "", "imagename": "13f865d5132514af8ce82f2c85010405.jpg", "infoid": 1013708, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "著名海底探险家雅克-伊夫·库斯托(Jacques-Yves Cousteau)的孙子法比安·库斯托(Fabien Cousteau)正在其家族遗产的基础上，在海面下60英尺处建造一座最先进的研究设施。\n法比安·库斯托生来就是一名水手。这位著名探险家雅克·伊夫·库斯托的孙子在四岁时学会了戴水肺潜水，并与祖父一起进行研究探险长大。“戴水肺潜水是一件令人惊叹的好事，但时间是非常有限的，”他说。\n绕过这一时间限制的一种方法是生活在水下栖息地，这为研究人员提供了在海洋中进行更多长期工作的机会。他的祖父在20世纪60年代开创了这样的栖息地，今天法比恩计划通过建设Proteus来继续这一遗产，Proteus是一个水下栖息地和研究站，将是有史以来最大的栖息地和研究站之一。栖息地将需要三年时间才能完成，位于加勒比海库拉索岛成本附近60英尺的海洋保护区内。它将有空间让最多12人一次在水下生活数周-甚至可能是几个月。\n这对于水下栖息地来说是一个重大的升级，在过去，水下栖息地的大小从小型面包车到大型校车不等。法比安于2016年创立了总部位于纽约的非营利组织法比恩·库斯托海洋学习中心(Fabien Cousteau Ocean Learning Center)，他说：“大多数栖息地都是专门为一项或一系列任务建造的。”“他们从来没有被设想为一个国际空间站，这是一个需要更长时间部署的东西。”\n建造栖息地并在前三年运营估计将耗资1.35亿美元，法比安正在努力筹集这笔资金。他拒绝透露支持该项目的资助者的名字，但其战略合作伙伴包括东北大学、罗格斯大学和总部位于库拉索的非营利组织加勒比海生物多样性研究和管理组织。\n该项目是以希腊原始海神普罗秋斯的名字命名的，他被认为是知识的守护者-可以呈现不同的形状。这就是项目本身的灵感来源。绝大多数海洋仍未开发，栖息地被设计为模块化的，因此可以通过多种方式升级和扩大。这可以使许多研究途径成为可能，从药物发现到可持续的粮食生产，再到气候变化，不一而足。\n在建造普罗秋斯的过程中，法比安延续了家族传统。1962年，他的祖父帮助开发了最早的这样的栖息地之一，被称为康斯托，这是一个两人栖息地，位于法国马赛海岸海面下约33英尺的地方。紧随其后的是Condle II，这是一个栖息地，水手们在36英尺深的地方生活了一个月，然后在82英尺的红海中生活了两周。在接下来的20年里，世界各地接踵而至的类似项目层出不穷，但今天存在的项目不多，大多数可以追溯到20世纪70年代或80年代。\n这一传统的另一个方面是Proteus将包括一个视频制作设施，能够从海洋进行16K分辨率的广播。法比安希望，这将是他祖父开创的电视特辑的现代版本，他祖父开创的电视特辑激励了一代又一代的海洋探险家进入这一领域。\n“今天有一种误解，认为所有的知识都是已知的，”东北部教授布莱恩·赫尔穆斯(Brian Helmuth)说，他是该项目的科学合作者，他称赞雅克·库斯托(Jacques Cousteau)激励了他在海洋生物学领域的职业生涯。“如果你想知道一些事情，你只需要在互联网上查一查，去维基百科。公众意识中仍然有那么多未知的东西的想法已经消失了。这对于重新燃起探险的胃口至关重要。“。\n赫尔穆斯在2013年遇到了法比恩，当时他的东北同事马克·帕特森(Mark Patterson)正在帮助组建一个团队，参加2014年的短途旅行，法比恩在佛罗里达群岛的宝瓶座水下栖息地生活了31天。宝瓶座最初是由美国海军和美国国家海洋和大气局于1986年建造的。2012年，它被佛罗里达国际大学接管。水瓶座的大小相当于一辆校车，可以容纳大约6个人，但也不是没有限制。\n“我喜欢把宝瓶座比作住在灰狗巴士里，”东北大学副院长兼教授帕特森说。\nProteus的目标是克服这些限制。宝瓶座的面积约为400平方英尺，而普罗蒂斯的面积约为4000平方英尺--相当于一座大房子的大小。这将为实验室、医疗舱、录像室、生活区和睡眠区，甚至一个水培温室留出空间，这样水生生物就可以吃到新鲜的食物。(在海底，“你渴望新鲜的食物，”法比安说。)。空间站将通过一条脐带生命线连接到地面，这条生命线输送可呼吸的空气和通讯。\n帕特森说，这将使研究变得更容易。他说：“拥有一个设计良好的、更大的、未来可以扩展的空间，这在世界上是很有意义的。”\nProteus空间站是由FuseProject的伊夫·贝哈尔(Yves Béhar)设计的，他从事过从可穿戴设备到智能摇篮再到安全机器人的各种设计。一旦建成，Fabien估计它每年的运营成本约为300万美元(运营的前三年包括在1.35亿美元的数字中)。这笔费用将由研究人员、大学和公司抵消，他们“租用”栖息地进行除了与战争有关的研究之外的几乎任何事情的科学研究。\n对该项目特别感兴趣的是鼓励药物研究和药物发现。根据伊利诺伊州中西部大学药理学系教授亚历杭德罗·迈耶(Alejandro Mayer)维护的跟踪器，自1969年以来，FDA已经批准了12种海洋药物。这些化合物包括治疗癌症、疼痛和疱疹的化合物，这些化合物来自各种鱼类、海绵和其他海洋动物。目前还有24种以海洋为基础的药物正在进行临床开发。\n对生物制药的早期研究通常留给大学的科学家，他们收集和测试从海洋中提取的数千个样本。但这类研究面临的一个挑战是，如果将生物样本从海洋中移走，它们将对压力和温度的变化做出反应。赫尔穆斯说，Proteus将使研究人员能够在设施内外设置容器，使科学家能够“观察没有压力的完整群落和植物”。“当我们来回奔波，不停地看着我们的空气时，我们得不到这种水平的洞察力。”\n栖息地是“对海洋药物发现的合理贡献，但不是可有可无的恩惠，”加州斯克里普斯海洋研究所(Scripps Institution Of Ocean)杰出的海洋学和药学教授威廉·费尼奇(William Fenical)说，他没有参与该项目。虽然生活在栖息地的潜水员可以长时间探索，但在不得不返回之前，他们可以旅行的距离仍然是有限的。Fenical说，行动的自由很重要，因为药物发现“建立在拥有多样性和大量材料的基础上”。\n考虑到这一限制，Proteus的目标也是超越其60英尺的深度。库斯托还希望在600英尺左右建造一个更深的延伸段，以另一位海神的名字命名为海王星(Triton)。使用自主水下机器人，研究团队还将能够探索高达2000英尺的深度。\n当被问及他希望在海洋中发现什么时，库斯托打电话给他的祖父，他的祖父说，如果他知道答案，他就不会费心去了。“我只是一个怀有梦想的疯子，”法比安·库斯托(Fabien Cousteau)说。“这不仅是可能的，而且对于我们未来的福祉，以及更好地了解我们的生命维持系统来说，都是绝对必要的。”\n更正：这篇文章的早期版本称雅克·库斯托已经在第二控制台住了一个月。这是不正确的-他从服务部门运营业务，但会定期潜水和拜访。", "note_en": "Fabien Cousteau, grandson of famous undersea explorer Jacques-Yves Cousteau, is building on his family legacy by constructing a state-of-the art research facility—60 feet below the surface of the ocean.\n      Fabien Cousteau was born to be an aquanaut. The grandson of the famed explorer Jacques-Yves Cousteau learned how to scuba dive at the age of four and grew up joining his grandfather on research expeditions. “Scuba diving is an amazing blessing, but there’s a very real limit of time,” he says.\n  One way to circumvent that time limit is to live in an underwater habitat, which provides researchers the opportunity to do more extended work in the ocean. His grandfather pioneered such habitats in the 1960s, and today Fabien plans to continue that legacy with the construction of Proteus, an underwater habitat and research station that would be one of the largest ever built. The habitat will take three years to complete, located 60 feet underwater in a marine protected area off the cost of Curaçao, an island in the Caribbean Sea. And it will have room for up to 12 people to live underwater for weeks—possibly even months—at a time.\n     That’s a serious upgrade for underwater habitats, which in the past have ranged in size from a minivan to a large school bus. “Most of the habitats were purpose-built for one mission or set of missions,” says Fabien, who founded the New York-based non-profit organization Fabien Cousteau Ocean Learning Center in 2016. “They were never conceived as an International Space Station, something that’s to be deployed for a longer period of time.”\n  Building the habitat and operating it for its first three years will cost an estimated $135 million, which Fabien is working to raise. He declined to name the funders backing the project, but its strategic partners include Northeastern University, Rutgers University and the Caribbean Research and Management of Biodiversity, a Curaçao-based non-profit.\n    The project is named for Proteus, the Greek primordial sea god who was known to be a keeper of knowledge—and could assume different shapes. This is where the project itself gets its inspiration. The vast majority of the oceans remain unexplored, and the habitat is designed to be modular, so it can be upgraded and expanded in a multitude of ways. This can enable a number of research avenues, ranging from drug discovery to sustainable food production to climate change.\n    In building Proteus, Fabien is continuing in the family tradition. His grandfather helped develop one of the first such habitats, known as Conshelf, in 1962, a two-person habitat located about 33 feet below the surface off the coast of Marseilles, France. That project was followed by Conshelf II, a habitat where aquanauts lived for a month at a depth of 36 feet and then at 82 feet for two weeks in the Red Sea. A spate of similar projects followed around the world over the next two decades, but less than a handful exist today, most dating back to the 1970s or 1980s.\n  Another aspect of that tradition is that Proteus will include a video production facility, capable of broadcasting from the ocean in 16K resolution. It will be, Fabien hopes, a modern-day version of the TV specials his grandfather pioneered, which inspired generations of marine explorers to enter the field.\n  “Today there’s this misperception that all knowledge is known,” says Northeastern professor Brian Helmuth, a scientific collaborator on the project who credits Jacques Cousteau for inspiring his career in marine biology. “If you want to know something, you just have to look it up on the internet, going to Wikipedia. The idea that there is still so much that is unknown has been lost from the public consciousness. And that’s critical for rekindling the appetite for exploration.”\n  Helmuth met Fabien in 2013, when his Northeastern colleague Mark Patterson was helping put together a team for Mission-31, a 2014 excursion in which Fabien lived for 31 days in the Aquarius underwater habitat in the Florida Keys. Aquarius was originally built in 1986 by the US Navy and NOAA. In 2012, it was taken over by Florida International University. The size of a school bus, Aquarius can hold about six people, but it’s not without limitation.\n  “I like to describe Aquarius as living in a Greyhound bus,” says Patterson, a professor and associate dean at Northeastern.\n    Proteus aims to overcome those limitations. While Aquarius is about 400 square feet, Proteus will be about 4,000 square feet—the size of a large house. This will allow space for a laboratory, a medical bay, the video studio, living and sleeping quarters and even a hydroponic greenhouse so that aquanauts can have fresh food. (Under the ocean, “you crave fresh food,” says Fabien.) The station will be connected to the surface through an umbilical lifeline that ferries breathable air and communications.\n  This, says Patterson, will make research easier. “Having a well-designed space that’s bigger and can be expanded in the future makes all the sense in the world,” he says.\n  The Proteus station is being designed by Yves Béhar at fuseproject, who’s worked on designs ranging from wearables to smart bassinets to security robots. Once built, Fabien estimates it will have a yearly operational cost of about $3 million (the first three years of operation are included in the $135 million figure). That cost will be offset by researchers, universities and corporations who “rent” the habitat to conduct scientific research on just about anything except research related to warfare.\n    Of particular interest for the project is to encourage pharmaceutical research and drug discovery. The FDA has approved twelve marine-based drugs since 1969,  according to a tracker maintained by Alejandro Mayer, a professor in the department of pharmacology at Midwestern University in Illinois. These include compounds that treat cancer, pain and herpes that have been derived from various fish, sea sponges and other marine animals. There are two dozen more marine-based pharmaceuticals currently in clinical development.\n  Early-stage research into biopharmaceuticals is often left to scientists at universities, who collect and test thousands of specimens retrieved from the oceans. But one challenge to this type of research is that organism samples will react to changes in pressure and temperature, if they are removed from the ocean. Proteus will enable researchers to set up containers both inside and outside the facility that enable scientists “to look at intact communities and plants that aren’t stressed,” says Helmuth. “Its’ a level of insight we don’t get when we’re rushing back and forth, constantly looking at our air.”\n    Habitats are a “reasonable contribution to drug discovery from the ocean, but it isn&#39;t a saving grace,” says William Fenical, a distinguished professor of oceanography and pharmaceutical sciences at the Scripps Institution of Oceanography in California, who is not involved in the project. While the divers living in the habitat will be able to explore for long amounts of time, they will still be limited in the distances they could travel before having to turn back. That freedom of movement is important, since drug discovery “is based on having diversity and a lot of materials to the test,” says Fenical.\n  Mindful of this limitation, Proteus aims to go beyond its 60-foot depth as well. Cousteau also hopes to build a deeper extension, dubbed Triton after another sea god, at around 600 feet. Using autonomous underwater robots, research teams will also be able to explore depths of up to 2000 feet.\n  When asked what he expects to find in the ocean, Cousteau invokes his grandfather, who said that if he knew the answer, he wouldn’t bother going. “I&#39;m just a crazy person with a dream,” says Fabien Cousteau. “That sees this as being not only possible—but absolutely necessary—for our future well being, as well as a better understanding of our life support system.”\n  Correction: An earlier version of this article stated that Jacques Cousteau had lived in Conshelf II for a month. This was incorrect - he ran operations from the service but would dive and visit regularly.", "posttime": "2020-07-23 16:36:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "cousteau,海洋", "title": "Fabien Cousteau正在筹集1.35亿美元建设深海国际空间站", "title_en": "Fabien Cousteau Is Raising $135 Million To Build The International Space Station Of The Deep Sea", "transed": 1, "url": "https://www.forbes.com/sites/katiejennings/2020/07/22/fabien-cousteau-is-raising-135-million-to-build-the-international-space-station-of-the-deep-sea/#74ba9c621013", "via": "", "real_tags": ["cousteau", "海洋"]}, {"category": "", "categoryclass": "", "imagename": "4a5bb8ce8cd42365e21e9f88b3dbebb0.png", "infoid": 1013707, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们很重视比特沃登的安全。除了我们的开源代码库和公共漏洞赏金计划之外，我们还理解来自信誉良好的第三方的官方安全评估和渗透测试的必要性。2018年11月，Bitwarden成功完成了安全公司Cure53的源代码审计和密码分析。\n我们承诺定期对Bitwarden平台的各个方面进行安全审计，我们很高兴地宣布，Bitwarden已由审计公司Insight Risk Consulting完成了全面的安全评估和渗透测试。\n为了提供完整的信息披露，您可以在下面找到Insight Risk Consulting团队编制的执行摘要以及内部报告，其中包含每个问题的摘要、影响分析以及Bitwarden针对确定的问题采取/计划采取的行动。我们很高兴地报告，在这次审计过程中没有发现重大问题。在最新的Bitwarden服务器更新中修补了一个中度问题。\n我们希望这份评估重申我们对整个Bitwarden平台的安全和完整性的承诺，并有助于进一步加强我们的用户每天对Bitwarden的信任。", "note_en": "We take the security of Bitwarden seriously. In addition to our  open source codebase and public  bug bounty program, we also understand the need for official security assessments and penetration testing from reputable third parties.  In November, 2018, Bitwarden successfully completed a source code audit and cryptographic analysis by security firm Cure53.\n In our commitment to a regular cadence of security audits on various aspects of the Bitwarden platform, we are pleased to announce that Bitwarden has completed a thorough security assessment and penetration test by auditing firm  Insight Risk Consulting.\n In the interest of providing full disclosure, below you will find the executive summary that was compiled from the team at Insight Risk Consulting along with an internal report containing a summary of each issue, impact analysis, and the actions taken/planned by Bitwarden regarding the identified issues. We are happy to report that no major issues were identified during this audit. One moderate issue has been patched in the latest Bitwarden server update.\n We hope that this assessment reiterates our commitment to the security and integrity of the entire Bitwarden platform and helps further strengthen the trust that our users place in Bitwarden every day.", "posttime": "2020-07-23 16:34:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "安全,security", "title": "比特沃登第二次安全审计报告", "title_en": "Bitwarden second security audit report", "transed": 1, "url": "https://bitwarden.com/blog/post/bitwarden-network-security-assessment-2020/", "via": "", "real_tags": ["安全", "security"]}, {"category": "", "categoryclass": "", "imagename": "1bec4d797159639c31a213b020982f9b.jpg", "infoid": 1013706, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Twilio今天透露，其TaskRouter JS SDK在获得了一个配置错误的亚马逊AWS S3存储桶的访问权限后，被攻击者攻破，自2015年以来，这使得SDK的路径在大约5年内都是公开可读和可写的。\nTwilio是一家云通信平台即服务(CPaaS)公司，为40,000多家企业提供通信支持，并帮助开发人员使用Twilio的Web服务API将语音、视频、消息传递和身份验证功能添加到他们的应用程序中。\n该公司的客户名单包括Twitter、Netflix、Uber、Facebook Shopify、摩根士丹利(Morgan Stanley)、Airbnb、Wix、Spotify、Yelp、Hulu、Intuit、ING、eBay以及无数其他公司。\n根据Twilio今天发布的一份事件报告，攻击者仅在客户使用的TaskRouter JS SDK库版本1.20内注入恶意代码，以便通过基于TaskRouter属性的路由引擎将任务路由到代理或进程。\nTwilio说，由于托管库的S3存储桶中的配置错误，不良行为者能够注入代码，使用户的浏览器加载与Magecart攻击组关联的无关URL。\n该公司表示，其安全和产品团队在最初接到攻击警报后一小时内更换了恶意的TaskRouter JS SDK库，并确保了S3存储桶的安全。\n在7月19日星期天，我们意识到对我们托管的一个Javascript库进行了修改，以便我们的客户将其包含在他们的应用程序中。修改版本的TaskRouter JS SDK已于太平洋标准时间下午1：12(UTC-07：00)上传到我们的网站。我们在太平洋标准时间晚上9：20左右收到关于修改文件的警报，并在太平洋标准时间晚上10：30左右在我们的网站上更换了该文件。--Twilio。\n正如Twilio解释的那样，修改后的TaskRouter JS SDK库可能在更换后通过用户浏览器或通过该公司的CDN再提供长达24小时。\nTwilio表示，到目前为止还没有发现攻击者获得任何客户信息或数据的证据。攻击者也无法访问Twilio的任何内部系统、代码或数据。\n在最初的补救和对其他AWS S3存储桶的审计之后，该公司在审计后还发现了其他不安全的存储桶，但表示没有其他托管的SDK在事件中受到影响。\n同样在事件审查期间，该公司发现托管TaskRouter JS SDK的路径在近五年的时间里一直配置为公共写入访问权限。\n在我们的事件审查期间，我们发现此路径在2015年添加时最初未配置公共写访问权限。5个月后，我们在解决其中一个构建系统的问题时实现了一项更改，一旦问题得到修复，该路径上的权限就无法正确重置。--Twilio。\nTwilio说，虽然Twilio Flex使用TaskRouter为代理提供交互路由，但Flex客户并未受到此问题的影响。Twilio Flex为TaskRouter使用不同的SDK，不从公共站点加载，并将其捆绑为flex-UI的单个JS文件的一部分。&#34；\n然而，该公司也敦促客户，如果他们在SDK被泄露时下载了它，请立即更换受影响的SDK。\n如果您在PDT时间2020年7月19日下午1：12到PDT时间7月20日10：30(UTC-07：00)之间下载了TaskRouter JS SDK的1.20版本，请立即重新下载该SDK，并将旧版本替换为我们当前服务的版本。--Twilio。\n正如Twilio在分析攻击者注入的JavaScript代码时发现的那样，这些代码实际上是一个恶意的流量重定向器-RiskIQ追踪的重定向器名为jqueryapi1oad-并与一项名为IHookads的长期广告活动有关。\nHookads使用JavaScript重定向器通过一系列看起来像在线广告和在线游戏的诱骗网站来重定向网站访问者，最终目标是使用利用工具套件安装恶意软件有效负载。\n正如RiskIQ威胁研究员乔丹·赫尔曼告诉BleepingComputer的那样，jqueryapi1oad连接到671个独特的域名，其中包括Alexa排名前1500的域名。自本月初以来，我们检测到173个新受影响的域名。\n赫尔曼还表示，TTwilio妥协是不安全的Amazon S3存储桶被用作攻击载体的又一次实例。\n由于攻击者很容易找到他们，而且他们的访问级别很高，我们看到这样的攻击正在以惊人的速度发生。\n黑客只不过是@RiskIQ大约几个月前写的一个不安全的S3桶：https://t.co/y8KfAmoTEa这里的实际攻击者是我们所说的钩子/jqueryapi1oad，我的同事@tracerspiff写道：https://t.co/y8KfAmoTEa。\n-Yonathan Klijnsma(@ydklijnsma)2020年7月22日。\nTwilio发现，注入到TaskRouter JS SDK库中的恶意代码从Tgold.platinumus[.]top/Track/awswrite加载一个URL，然后重定向到其他网站，阻止使用浏览器的后退按钮，试图一路上收集与移动设备相关的数据。\nTwilio说，这个脚本还特别尝试收集有关用户触摸屏大小的数据，并使用针对移动设备的事件。\n这一行为，连同这些指标，与针对移动设备用户的Magecart攻击组相关的恶意广告活动是一致的。\n我们认为该攻击旨在向移动设备上的用户提供恶意广告。\n@Twilio事件中的重定向活动来自一家多产的流量分销商，该分销商从事恶意广告、广告欺诈、技术诈骗和一度略读。我们在这里进行了报道：https://t.co/1SxOj9lRTW cc@serghei。\n-杰罗姆·塞古拉(@jeromesegura)2020年7月22日", "note_en": "Twilio today disclosed that its TaskRouter JS SDK was compromised by attackers after they gained access to one of its misconfigured Amazon AWS S3 buckets which left the SDK&#39;s path publicly readable and writable for roughly five years, since 2015.\n Twilio is a cloud communications platform as a service (CPaaS) company that powers communications for over 40,000 businesses and helps developers add voice, video, messaging, and authentication capabilities to their apps using Twilio&#39;s web service APIs.\n The company&#39;s customer list includes Twitter, Netflix, Uber, Shopify, Morgan Stanley, Airbnb, Wix, Spotify, Yelp, Hulu, Intuit, ING, eBay, and countless others.\n According to an incident report published by Twilio today, the attackers injected the malicious code only within version 1.20 of the TaskRouter JS SDK library used by customers to route tasks to agents or processes via the Twilio TaskRouter attribute-based routing engine.\n &#34;Due to a misconfiguration in the S3 bucket that was hosting the library, a bad actor was able to inject code that made the user’s browser load an extraneous URL that has been associated with the Magecart group of attacks,&#34; Twilio said.\n  The company says that its security and product teams replaced the malicious TaskRouter JS SDK library and secured the S3 bucket within an hour after initially being alerted of the attack.\n On Sunday July 19th, we became aware of a modification that had been made to a Javascript library that we host for our customers to include in their applications. A modified version of the TaskRouter JS SDK was uploaded to our site at 1:12 PM PDT (UTC-07:00). We received an alert about the modified file at approximately 9:20 PM PDT and replaced it on our site around 10:30 PM PDT. - Twilio\n As Twilio explained, the altered TaskRouter JS SDK library may have been available through user browsers or via the company&#39;s CDN for up to another 24 hours after being replaced.\n Twilio says that it has found no evidence so far of the attackers gaining access to any customer information or data. The attackers were also not able to access any of Twilio&#39;s internal systems, code, or data.\n After the initial remediation and an audit of its other AWS S3 buckets, the company also found other unsecured buckets after an audit but says that no other hosted SDKs have been impacted in the incident.\n Also during the incident review, the company discovered the path that hosted the TaskRouter JS SDK was left configured with public write access for almost five years.\n During our incident review, we identified that this path was not initially configured with public write access when it was added in 2015. We implemented a change 5 months later while troubleshooting a problem with one of our build systems and the permissions on that path were not properly reset once the issue had been fixed. - Twilio\n Twilio said, that &#34;while Twilio Flex uses TaskRouter to provide routing of interactions to agents, Flex customers were not impacted by this issue. Twilio Flex uses a different SDK for TaskRouter, does not load it from the public site, and bundles it as part of a single JS file for flex-ui.&#34;\n However, the company also urged customers to replace the impacted SDK immediately if they downloaded it while it was compromised.\n If you downloaded a copy of v1.20 of the TaskRouter JS SDK between July 19th, 2020 1:12 PM and July 20th, 10:30 PM PDT (UTC-07:00), you should re-download the SDK immediately and replace the old version with the one we currently serve. - Twilio\n  As Twilio discovered while analyzing the JavaScript code injected by the attackers, the code is actually a malicious traffic redirector —  tracked by RiskIQ as jqueryapi1oad — and is connected to a long-running advertising campaign known as  Hookads.\n Hookads uses JavaScript redirectors to redirect website visitors through a series of decoy sites looking like online ads and online games with the end goal of installing malware payload using exploit kits.\n jqueryapi1oad is connected to 671 unique domains, &#34;including a domain in the top 1,500 of Alexa rankings,&#34; as RiskIQ threat researcher Jordan Herman told BleepingComputer. &#34;We’ve detected 173 newly affected domains since the start of the month.&#34;\n Herman also said that the Twilio compromise is yet another instance of unsecured Amazon S3 buckets used as an attack vector.\n &#34;Because of how easy they are to find and the level of access it grants attackers, we&#39;re seeing attacks like this happening at an alarming rate.&#34;\n The  @twilio &#34;hack&#34; was nothing more than an unsecured S3 bucket  @RiskIQ wrote about months ago:  https://t.co/y8KfAmoTEa  The actual attackers here is what we call hookads/jqueryapi1oad which my colleague  @TracerSpiff wrote about:  https://t.co/y8KfAmoTEa\n— Yonathan Klijnsma (@ydklijnsma)  July 22, 2020\n Twilio found that the malicious code injected in the TaskRouter JS SDK library loads an URL from gold.platinumus[.]top/track/awswrite and then redirects to other sites, blocking the use of the browser&#39;s back button, attempting to collect data related to mobile devices all along the way.\n &#34;This script also specifically attempts to gather data about the size of the user’s touchscreen and uses events that are targeted at mobile devices,&#34; Twilio said.\n &#34;This behavior, along with the indicators, are consistent with a malvertising campaign associated with the Magecart group of attacks targeted at users of mobile devices.\n &#34;We believe that the attack was designed to serve malicious advertising to users on mobile devices.&#34;\n The redirect campaign in the  @twilio incident is from a prolific traffic distributor dealing in malvertising, ad fraud, tech scams and at one point skimming. We covered it here:  https://t.co/1SxOj9lRTW cc  @serghei\n— Jérôme Segura (@jeromesegura)  July 22, 2020", "posttime": "2020-07-23 16:34:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,曝光,exposes", "title": "Twilio曝光SDK，攻击者植入恶意代码", "title_en": "Twilio exposes SDK, attackers inject it with malvertising code", "transed": 1, "url": "https://www.bleepingcomputer.com/news/security/twilio-exposes-sdk-attackers-inject-it-with-malvertising-code/", "via": "", "real_tags": ["代码", "曝光", "exposes"]}, {"category": "", "categoryclass": "", "imagename": "cf673e649cb509de3299c1bb0a9219a9.jpg", "infoid": 1013705, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "就像SpaceX火箭将特斯拉跑车放样送入轨道一样，特斯拉股票正垂直进入外层空间。自3月份以来，这家电动汽车制造商的股价上涨了四倍多，市值达到令人难以置信的2900亿美元。\n这使得周三公布第二季度收益的特斯拉成为世界上估值最高的汽车公司-尽管远远不是最大的。在2019年全球售出的9000万辆汽车中，特斯拉售出了36.7万辆。以世界上最畅销的两家汽车制造商丰田(Toyota)和大众(Volkswagen)为例，再加上福特，股市对特斯拉的估值仍然高于这三家公司的总和。\n周一，特斯拉股价攀升近10%，单日市值增加265亿美元。该股周二回落4.5%，至每股1,568.36美元，周三收盘上涨约1.5%。特斯拉公布季度净利1.04亿美元，股价在盘后交易中急升逾5%。\n就连过去大肆炒作特斯拉股票的CNBC名人吉姆·克雷默(Jim Cramer)也感到震惊。周一在推特上被问及特斯拉股票时，他写道：“我甚至不知道它是不是股票。这完全是另一回事，就像在野外发现的新物种一样。“。\n或者它可能是一只更熟悉的野兽，只是增压了。特斯拉令人眼花缭乱的攀升更有意义，因为你会认为它是股票市场的超级夸张的产物，或许是对股市的比喻，而股市本身已经失去了意义，至少按照传统的衡量标准是这样。\n在全球大流行和经济灾难的背景下，市场徘徊在创纪录高位附近，与特斯拉一样，市场突显出股价与当前经济现实和未来收益预期的脱节程度。\n在这两种情况下，数万亿美元的新资金注入经济，以及被动投资的稳步增长都支撑了价格。被动投资是指资金从401(K)缴费中自动流入，并用于购买股票，从而推高了价格。特斯拉可能被纳入标准普尔500指数增加了上行压力。\n然后是首席执行官埃隆·马斯克(Elon Musk)成功地编造了一个美好的未来故事，解释了为什么特斯拉应该比现在更贵。马斯克的巨额薪酬方案几乎完全与股价挂钩；周二，在特斯拉六个月平均市值超过1,500亿美元后，他有资格获得额外价值21亿美元的期权。\n撇开叙述不谈，该公司最近的表现几乎没有理由证明这种过高的热情是合理的。\n虽然特斯拉的销量稳步增长，但并没有突然加速，该公司多次降价。特斯拉将其一连串微薄的季度利润归功于政府信贷和对一项尚不存在的“全自动驾驶”技术的预付订单的积极预订。工资和奖金-针对工人，而不是针对马斯克-正在被削减。\n总体而言，很难看到特斯拉是一家快速增长的公司，因为它在2017年推出了Model3。(见图表。)。\n特斯拉并不是唯一一家市值飞涨的公司，它的市值很难与大萧条以来最糟糕的经济相匹配。\n在经典分析中，股票价格表明了对公司未来利润的预期。这些现金可以通过股息支付或股票回购来奖励股东，也可以再投资于公司，以推动未来的增长。\n整个经济领域2020年的利润前景看起来都很黯淡。“华尔街日报”(The Wall Street Journal)报道称，标准普尔500指数(S&P；500)中有180家公司取消了盈利指引，这导致“至少自2007年以来，分析师的盈利预期差距最大”。\n然而，标准普尔500指数在经历了3月份令人震惊的暴跌后，正再次走向创纪录的高点。正如达拉斯联邦储备银行(Federal Reserve Bank Of Dallas)行长罗伯特·卡普兰(Robert Kaplan)最近所说：“如果你看到这种脱节，它不会无限期地持续下去。”\n尽管自2月份以来，美国已有3,200万人申请失业救济金，新冠肺炎感染人数激增，但仍有几股力量推动股市走高，并将其保持在高位。\n其中之一是美联储(Federal Reserve Board)，它向经济注入了数万亿美元以确保流动性，用通常会在成熟市场交易的资产填满了资产负债表，并创造了新的美元，这些美元在某个时候可能会引发通胀。它甚至首次开始购买垃圾债券，以帮助边缘公司和投资于它们的对冲基金维持运营。\n美联储的低利率使股市成为获得有意义回报的唯一途径。中产阶级和上流社会的人过去常常退休，希望在很大程度上依靠投资债券所产生的利息为生。现在不行。\n美联储的努力是否让人们大量重返工作岗位还有待确定，但到目前为止，这些努力已经帮助股市和债市克服了重力。\n对错过反弹的恐惧激发了新一代日内交易者的活力。罗宾汉(Robinhood)等免费零售投资应用的出现吸引了新的股票买家，他们通常是年轻和缺乏经验的。与指数基金、共同基金、养老基金和其他大型机构投资者相比，个股交易者的市场交易量并不大，但他们的出价可以在边际上影响价格。根据robintrack.com汇编的数据，特斯拉是罗宾汉交易最活跃的股票之一。\n与此同时，被动投资的稳步上升，特别是购买广泛横截面股票的指数基金，对市场的长期牛市产生了巨大的影响。Logica Funds合伙人兼首席策略师迈克尔·格林(Michael Green)认为，被动投资为规避风险的投资者提供了一个低成本的切入点，按市值计算，被动投资已增长至占美国股票的43%。格林之前曾担任投资者彼得·蒂尔(Peter Thiel)的宏观基金的投资组合经理，他研究了被动投资，并向公众公布了研究结果。\n格林说，通过按市值比例批量购买股票，指数基金和其他被动投资工具在不考虑基本面的情况下，扭转了传统股票交易在研究和分析的基础上对投机性证券施加的下行压力，格林说，指数基金和其他被动投资工具通过研究和分析扭转了传统股票交易对投机性证券施加的下行压力。被动投资越盛行，市场与公司经济表现的脱节就越大。格林表示，由于监管和人口结构的原因，被动投资工具的增长越来越成定局。\n他表示，危险在于，当投资者受到惊吓并赎回股票时，指数基金的卖超买盘，无论价格多低，基金都必须卖出股票。他说，这可能会导致严重的市场崩盘。\n被动投资可能很快就会以更直接的方式为特斯拉的股票火箭增添更多推力。该公司第二季度净利润1.04亿美元，这是该公司17年来首次连续四个季度实现盈利。这一壮举将使特斯拉有资格进入标准普尔500指数(Standard&amp；Poor‘s500 index)。如果标普指数委员会批准将其纳入，追踪股市的指数基金将被要求买入特斯拉股票。其中很大一部分潜在原因是其庞大的当前市值将反映在其指数权重中。\n1999年，雅虎在互联网泡沫期间被纳入标准普尔500指数，从获得资格到正式被纳入的五天时间里，其股价上涨了64%，达到当时令人印象深刻的560亿美元的市值。\n然而，多伦多大学法学院(University Of Toronto Law School)金融学和法学教授阿德里亚娜·罗伯逊(Adriana Robertson)表示，纳入“不是自动的”。标准普尔指数委员会“可以随时做出决定”。没有最后决定的期限。而指数委员会3月份的一份声明表明并不着急：它暂停了定期的指数再平衡，直到另行通知。\n由于电池制造成本居高不下，特斯拉一直依赖股市和债券市场，以及政府补贴来维持运营。该公司今年第一季度盈利1600万美元，向其他汽车制造商出售零排放空气污染抵免。马斯克在今年第二季度削减了工人工资和奖金，这也将有助于利润。\n由于无法指望通过销售汽车赚钱，马斯克一直依赖其他方面来编织他的增长故事。去年，他预测到2020年底，特斯拉将有100万辆无人驾驶机器人出租车上路。坦率地说，自动驾驶汽车专家对此持怀疑态度。还有六个月的时间，马斯克已经停止在推特上谈论这件事。\n他表示，2017年，特斯拉将在2019年开始生产电动半卡车。到目前为止还没有工厂，除了几个原型之外，没有卡车。四年前，他推出了一种名为太阳能屋顶的产品-太阳能电池集成到诱人的屋顶瓦片中，为家庭发电。2019年7月，他在推特上写道，特斯拉正在“迅速集中生产”，到2019年底每周生产1000个屋顶。除了一些原型场地外，并不存在商业产品业务，政府补贴的纽约州布法罗工厂本应生产屋顶，但尚未投入使用。\n本月早些时候，他说，到今年年底，我们将拥有无人驾驶汽车的“基本功能”，这些汽车可以自己在世界任何地方漫游。他没有定义“基本功能”。\n除特斯拉外，没有任何行业专家表示相信该公司即将部署无人驾驶汽车。事实上，德国慕尼黑的一家法院本月裁定，特斯拉误导客户，让他们相信该公司的自动驾驶驾驶员辅助技术比实际能力更强。法院禁止特斯拉在其德国广告中包含“自动驾驶的全部潜力”和“Autopilot Include”。据报道，韩国官员正在考虑采取类似的举措。\n马斯克关于特斯拉的未兑现主张是更广泛模式的一部分。另一家马斯克公司Neuralink正在开发植入人脑的计算机芯片。马斯克曾表示，该芯片将在“短期内”“解决”大脑和脊柱损伤，并“解决癫痫”。他没有公布任何数据来支持这样的说法，这些说法仍然是理论上的。公开宣布的通过马斯克在芝加哥、东北走廊和其他地方的钻孔公司修建交通隧道网络的计划已被放弃。钻孔公司正在完成一个项目，该项目将通过拉斯维加斯大道附近一条4500英尺长的隧道，提供特斯拉汽车的付费乘车服务。\n尽管特斯拉没有对这篇报道发表评论，但马斯克的忠实信徒军团对这一切都有答案。他们说，特斯拉不仅仅是汽车品牌，而是一家硅谷式的科技公司，在软件开发方面遥遥领先于传统汽车制造商。特斯拉开创了“空中”软件的先河，对汽车及其系统进行远程升级，而其他公司仍在迎头赶上。\n特斯拉确实有一件事要做，那就是一群愿意对其赞不绝口的评论员，尽管他们的信念可能看起来很肤浅。方舟投资公司(Ark Invest)首席执行官凯西·伍德(Cathie Wood)经常出现在CNBC上，告诉观众特斯拉的股票在五年内将价值6000美元。7月1日，伍德在推特上写道，特斯拉车主在未来的某个时候，通过将他们的汽车纳入特斯拉机器人出租车网络，每人每年将获得1万美元的自由现金流。但与此同时，方舟定期出售大量特斯拉股票。仅在7月的前两周，该公司就出售了近14万股特斯拉股票，尽管伍德在兜售该公司。方舟没有回应采访请求。\n特斯拉估值是否合适的问题让分析师意见不一，但那些倾向于承销特斯拉股票发行和债券发行的公司的人最支持。\n摩根士丹利(Morgan Stanley)分析师亚当·乔纳斯(Adam Jonas)发布了题为“特斯拉与希望的力量”的投资者报告。他认为，以目前的价格计算，该公司股票估值过高，但也给出了超过2,000美元的“牛市”价格。\n“我不认为卖方分析师是独立的，”弗朗辛·麦肯纳(Francine McKenna)说，她是一位受过金融培训的作家，撰写了会计和审计在线时事通讯theDig.com。“在摩根士丹利帮助特斯拉融资之前，乔纳斯总是打出正面的电话.”\n作为对乔纳斯的回应，摩根士丹利表示，按当前价格计算，他“减持了特斯拉”。\n公平地说，乔纳斯或任何股票分析师或投资者现在都很难知道任何东西的真正价值。当面对不合理的事实时，在一个经济物理定律不再适用的市场上，正如马斯克所展示的那样，你所能做的最好的事情就是讲述一个令人信服的故事。", "note_en": "Like a SpaceX rocket lofting a Tesla Roadster  into orbit, Tesla stock is on a vertical trip into outer space. Since March, the electric car maker’s share price has more than quadrupled to a mind-boggling market value of $290 billion.\n That makes Tesla, which reported second-quarter earnings Wednesday, the world’s highest valued car company — if far from the largest. Of the 90 million cars sold around the world in 2019 Tesla sold 367,000. Take the two top-selling carmakers in the world, Toyota and Volkswagen, toss in Ford; the stock market still values Tesla higher than all three combined.\n On Monday, Tesla stock climbed nearly 10%, adding $26.5 billion to its market value in a single day. It pulled back 4.5% on Tuesday, to $1,568.36 a share, then closed up about 1.5% Wednesday. Shares spiked more than 5% in after-hours trading when Tesla reported a net quarterly profit of $104 million.\n Even Jim Cramer, the CNBC personality who has hyped Tesla stock plenty in the past, is astounded. Asked about Tesla stock on Twitter on Monday,  he wrote: “I don’t even know if it is a stock. it is something else entirely, like a new species discovered in the wild.”\n  Or maybe it’s a more familiar beast, only supercharged. Tesla’s bewildering ascent makes more sense when you think of it as a hyper-exaggerated product of — and maybe metaphor for — a stock market that itself has stopped making sense, at least by conventional measures.\n Hovering near record highs amid a global pandemic and economic catastrophe, the market, like Tesla, highlights the degree to which equity prices have come untethered from current economic reality and future earnings expectations.\n In both cases, prices are supported by the infusion of trillions of dollars of new money into the economy and by the steady growth of passive investing, in which money automatically flows in from 401(k) contributions and is put to work buying stocks, pushing prices higher. The potential inclusion of Tesla in the Standard &amp; Poor’s 500 stock index adds upward pressure.\n Then there’s the success of Chief Executive Elon Musk in crafting a beautiful-future narrative to explain why Tesla should be even more expensive than it is. Musk’s enormous compensation package is almost entirely tied to share price; on Tuesday, he qualified for an additional $2.1 billion worth of options after Tesla’s average market capitalization over a six-month period exceeded $150 billion.\n    Narrative aside, there’s little in the company’s recent performance to justify such outsize enthusiasm.\n Although Tesla’s sales have grown steadily, there has been no sudden acceleration, and the company has repeatedly lowered prices. Tesla owes its string of small quarterly profits to government credits and aggressive booking of prepaid orders for a “Full Self Driving” technology that does not yet exist. Pay and bonuses — for workers, not for Musk — are being cut.\n  Overall, it’s hard to see Tesla, since it introduced the Model 3 in 2017, as a rapid growth company. (See chart.)\n  Tesla isn’t the only company whose rip-roaring market value is hard to square with the worst economy since the Great Depression.\n In the classical analysis, stock prices indicate expectations of a company’s future profits. The cash can be used to reward shareholders through dividend payments or stock buybacks, or reinvested in the company to fuel future growth.\n The profit outlook for 2020 looks bleak across the economy.  The Wall Street Journal reports 180 companies in the S&amp;P 500 have pulled their earnings guidance, which has led to “the widest dispersion in earnings estimates among analysts since at least 2007.”\n Yet the S&amp;P 500, after an alarming plunge in March, is headed again toward record highs. As Robert Kaplan, president of the Federal Reserve Bank of Dallas, put it recently: “If you see that kind of disconnect, it doesn’t go on indefinitely.”\n  Several forces have pushed stocks high and kept them there even as 32 million people in the U.S. have applied for unemployment assistance since February and COVID-19 infections have surged.\n One is the Federal Reserve Board, which has  injected trillions into the economy to ensure liquidity,  engorged its balance sheet with assets that normally would be traded in established markets, and created new dollars that could at some point spark inflation. It has even, for the first time, begun to  buy junk bonds to help keep marginal companies and the hedge funds that invest in them afloat.\n The Fed’s low interest rates have the effect of making equity markets about the only avenue for meaningful returns. Middle- and upper-class people used to retire expecting to live largely on interest thrown off by their investments in bonds. Not now.\n Whether the Fed’s efforts put people back to work in large numbers is yet to be determined, but so far they’ve helped stock and bond markets defy gravity.\n  Fear of missing out on the bounces animates a new generation of day traders. The advent of no-fee retail investing apps such as Robinhood has invited new stock buyers, often young and inexperienced, into the mix. Compared with index funds, mutual funds, pension funds, and other huge institutional investors, individual stock traders don’t account for much market volume, but their bids can influence prices on the margins. Tesla is one of the most actively traded stocks on Robinhood, according to data compiled by robintrack.com.\n  At the same time, the steady rise of passive investing, in particular index funds that buy a broad cross section of stocks, has had a massive influence on the market’s long bull run. Offering a low cost entry point for risk-averse investors, passive investing has grown to account for 43% of U.S. shares by market capitalization, reckons Michael Green, partner and chief strategist at Logica Funds. Green, who previously worked as portfolio manager for investor Peter Thiel’s Macro fund, has  researched passive investing with findings available to the public.\n By purchasing stocks en masse in proportion to market cap, regardless of fundamentals, index funds and other passive investment vehicles have reversed the downward pressure traditional stock trading, informed by research and analysis, exerts on speculative securities, Green said. The more prevalent passive investing becomes, the more the market disconnects from the economic performance of companies. The growth of passive investment vehicles is increasingly a foregone conclusion because of regulations and demographics, Green said.\n  The danger, he said, is when investors get spooked and redeem their shares, index fund selling exceeds buying and the fund must sell stocks no matter how low the price goes. That, he said, could cause a severe market crash.\n Passive investing may soon add more thrust to Tesla’s stock rocket in a more direct way. The company’s net profit of $104 million for the second quarter marks the first time in its 17 years it has achieved four profitable quarters in a row. Such a feat would qualify Tesla for a spot on the Standard &amp; Poor’s 500 index. If S&amp;P’s index committee approves its inclusion, index funds that track stock markets would be required to buy Tesla stock. A lot of it, potentially, because its massive current market capitalization would be reflected in its index weighting.\n Yahoo’s inclusion in the S&amp;P 500 in 1999 during the dot-com bubble boosted its stock 64% in the five days from its qualification to its official inclusion, to a then-impressive market value of $56 billion.\n Inclusion, however, “is not automatic,” said Adriana Robertson, finance and law professor at the University of Toronto Law School. The S&amp;P’s index committee “can decide whenever they want.” There’s no deadline to decide. And a March announcement by the index committee indicates no rush: it put regular index rebalancing on hold until further notice.\n  With the cost of making batteries stubbornly high, Tesla has relied on stock and bond markets, along with government subsidies, to keep afloat. The company earned a $16-million profit in the first quarter this year selling zero emission air pollution credits to other automakers. Musk cut worker pay and bonuses in this year’s second quarter, which will also help profits.\n Unable to count on making money from selling cars, Musk has relied on other strands to weave his growth narrative. Last year he predicted Tesla would have 1 million driverless robotaxis on the road by the end of 2020. Autonomous car experts were, to be kind,  skeptical. With six months to go Musk has stopped tweeting about it.\n In 2017, he said Tesla would  begin producing electric semi-trucks in 2019. Thus far there is no factory, and beyond a couple of prototypes, there are no trucks. Four years ago, he introduced a product called a solar roof — solar cells integrated into attractive roof tiles to generate electricity for the home. In July 2019, he tweeted Tesla was  “spooling up production rapidly” to manufacture 1,000 roofs a week by the end of 2019. Apart from some prototype sites, a commercial product business does not exist, and the government-subsidized Buffalo, N.Y., factory where the roofs are supposed to be made has yet to spool.\n Early this month, he said,  “we will have the basic functionality” for driverless cars that can roam on their own anywhere in the world — by the end of this year. He did not define “basic functionality.”\n  No industry expert outside Tesla has expressed a belief the company is anywhere close to deploying driverless cars. In fact, a court in Munich, Germany, this month  ruled Tesla misleads customers into believing the company’s Autopilot driver-assist technology is more capable than in fact it is. The court banned Tesla from including “full potential for self autonomous driving” and “Autopilot inclusive” in its German advertising. Korea officials are reportedly considering a similar move.\n Musk’s unfulfilled claims about Tesla are part of a broader pattern. Another Musk company, Neuralink, is developing computer chips to be implanted in human brains. Musk has  said the chip will “solve” brain and spine injuries, and  “address epilepsy,” too, in the “near term.” He’s released no data to support such claims, which remain theoretical. Publicly announced plans to build networks of transportation tunnels through Musk’s Boring Co. in Chicago, the Northeast Corridor and elsewhere have been abandoned. Boring Co. is  finishing a project that will provide paid rides in Tesla cars through a 4,500-foot tunnel near the Las Vegas Strip.\n Although Tesla did not comment for this story, Musk’s legions of true believers have an answer for all this. Tesla is no mere car brand, they say, but a  Silicon Valley-style technology company that is eons ahead of traditional carmakers in software development. Tesla did pioneer “over the air” software to upgrade the car and its systems remotely, while others are still playing catch-up.\n One thing Tesla does have going for it is a constellation of commentators willing to sing its praises to infinity and beyond, though their convictions can appear shallow. Cathie Wood, chief executive of Ark Invest, regularly appears on CNBC to tell viewers Tesla stock will be worth $6,000 in five years. On July 1, Wood tweeted Tesla owners at some point in the future will each earn $10,000 in free cash flow every year by including their cars in a Tesla robotaxi network. But meantime, Ark regularly sells big chunks of Tesla shares. It sold nearly 140,000 Tesla shares the first two weeks of July alone even as Wood touted the company. Ark did not respond to a request for an interview.\n  The question of Tesla’s proper valuation divides analysts, but those whose firms tend to underwrite Tesla’s stock issues and bond offerings are the most supportive.\n Morgan Stanley analyst Adam Jonas puts out investor notes with titles such as “Tesla and the Power of Hope.” He thinks at the current price the stock is overvalued but also puts a “bull case” price on the stock over $2,000.\n “I don’t think of sell-side analysts as independent,” said Francine McKenna, a writer trained in finance who writes the accounting and audit online newsletter  theDig.com. “Jonas is always making positive calls before Morgan Stanley helps Tesla raise money.”\n Responding for Jonas, Morgan Stanley said he was “underweight Tesla” at the current price.\n  To be fair, it’s hard for Jonas or any stock analyst or investor to know what anything is really worth right now. When faced with facts that don’t add up, in a market in which the laws of economic physics no longer apply, the best you can do — as Musk has shown — is tell a compelling story.", "posttime": "2020-07-23 16:27:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,股价,insane", "title": "在一个疯狂的市场上，特斯拉疯狂的股价是有道理的", "title_en": "Tesla’s insane stock price makes sense in a market gone mad", "transed": 1, "url": "https://www.latimes.com/business/story/2020-07-22/why-the-stock-market-is-so-high-and-tesla-even-higher", "via": "", "real_tags": ["特斯拉", "股价", "insane"]}, {"category": "", "categoryclass": "", "imagename": "85cbe8bf91e6c784eb4194c39a4ad97e.jpg", "infoid": 1013703, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了推出这个名为Flipkart Wholesale的批发市场，这家电商巨头表示，它将收购沃尔玛印度业务100%的股份。沃尔玛在印度的独立业务有限，并运营着Best Price现金自运业务，在全国经营着28家门店，已积累了超过150万会员。\nFlipkart已将80%以上的业务出售给美国零售巨头沃尔玛(Walmart)，该公司没有披露收购的财务条款。本月早些时候，沃尔玛在Flipkart牵头进行了一轮12亿美元的融资，以增加其在这家印度公司的多数股权。\nFlipkart Wholesale将于下个月开始运营，该公司表示，该公司将利用这家电商巨头现有的庞大供应链基础设施，为社区商店(当地称为kiranas)和其他小企业提供“详尽”的产品和商品系列，以及更容易的信贷选择和额外创收机会。该公司补充说，它还将帮助这些有洞察力的企业，以便他们能够更有效地规划库存需求。\nFlipkart集团首席执行官Kalyan Krishnamurthy表示，收购沃尔玛印度公司“增加了一个在批发业务方面拥有深厚专业知识的强大人才库，这将加强我们在满足基拉纳和中小企业独特需求方面的地位。有了这一发展，Flipkart集团将进一步加强其业务的协同效应，为终端消费者和企业带来更大的价值和选择。“。\nFlipkart表示，它已经与印度顶级品牌、当地制造商和全国各地的卖家签约。批发业务将由Flipkart资深人士阿达什·梅农(Adarsh Menon)和沃尔玛印度公司(Walmart India)首席执行官萨米尔·阿加瓦尔(Sameer Aggarwal)负责，下个月将试行食品杂货和时尚类别的服务。阿加瓦尔将在交接后离开目前的职位，并将在沃尔玛担任新的职务。\n十多年来，我们一直致力于印度的繁荣，为基拉纳和中小企业提供服务，支持小农，并在全国各地建立全球采购和技术中心。沃尔玛国际总裁兼首席执行官朱迪思·麦肯纳(Judith McKenna)在一份声明中表示：“今天标志着沃尔玛印度开创性的现金自运传统与Flipkart的创新文化在Flipkart Wholesale的推出上迈出了重要的一步，”沃尔玛国际总裁兼首席执行官朱迪思·麦肯纳(Judith McKenna)在一份声明中表示。\n多年来，一些初创公司一直试图在印度建立B2B市场。光速支持的Udaan已经成为这一领域最大的参与者，其物流网络覆盖了印度的600个城市(另外还有300个与第三方物流提供商合作)。今年又有一位新的竞争者加入了它的行列。\n印度首富穆凯什·安巴尼(Mukesh Ambani)的JioMart是印度最大的零售连锁店(Reliance Retail)和电信网络(Reliance Jio Platforms)之间的一家新的电子商务企业，今年4月开始有限运营，此后已扩展到印度各地200多个城镇。\nFacebook今年早些时候向Reliance Jio平台投资了57亿美元，该公司表示，两家公司将探索为全国6000万中小企业服务的方法。\n“这些小企业对印度经济至关重要。Facebook印度负责人阿吉特·莫汉在今年早些时候的一次采访中告诉TechCrunch，“如果你把Facebook视为一家公司，你会发现它一直专注于帮助这些业务。”这些小企业、首次创业者和新企业利用Facebook平台寻找新客户，并拓展到更多市场。“。\n社区商店散布在印度数以万计的城市、城镇和村庄。尽管零售业巨头在这个国家进行了数十亿美元的投资，但它们还是存活了下来，并蓬勃发展。最近几个季度，Flipkart和亚马逊都争相与这些夫妻店合作。", "note_en": "To launch the wholesale marketplace, called Flipkart Wholesale, the e-commerce giant said it was acquiring a 100% stake in  Walmart’s   India business, which had limited standalone presence in the country and operated Best Price cash-and-carry business that runs 28 stores across the country and has amassed more than 1.5 million members.\n Flipkart, which has sold more than 80% of the business to U.S. retail giant Walmart, did not disclose the financial terms of the acquisition. Earlier this month, Walmart  led a $1.2 billion financing round in Flipkart to increase its majority stake in the Indian firm.\n  Flipkart Wholesale, which will become operational next month, will use the e-commerce giant’s existing vast supply chain infrastructure and offer an “exhaustive” range of products and merchandise, as well as easy credit options and opportunities for additional income generation to neighborhood stores (locally known as kiranas) and other small businesses, the company said, adding it will also help these businesses with insights so that they can plan their inventory needs more effectively.\n Kalyan Krishnamurthy, chief executive of Flipkart Group, said the acquisition of Walmart India “adds a strong talent pool with deep expertise in the wholesale business that will strengthen our position to address the needs of kiranas and MSMEs uniquely. With this development, the Flipkart Group will further build upon the synergies across its businesses to drive greater value and choice for end-consumers and businesses alike.”\n Flipkart said it has already signed up top Indian brands, local manufacturers, and sellers across the country. The wholesale business — to be overseen by Adarsh Menon, a veteran at Flipkart, and Sameer Aggarwal, chief executive at Walmart India — will pilot services for the grocery and fashion categories next month. Aggarwal will leave his current position after the transition and will serve in a new role within Walmart.\n “For over a decade, we’ve been committed to India’s prosperity by serving kiranas and MSMEs, supporting smallholder farmers and building global sourcing and technology hubs throughout the country. Today marks the next big step as Walmart India’s pioneering cash-and-carry legacy meets Flipkart’s culture of innovation in the launch of Flipkart Wholesale,” said Judith McKenna, president and chief executive of Walmart International, in a statement.\n A handful of startups have attempted to build business-to-business marketplaces in India over the years. Lightspeed-backed  Udaan   has emerged as the largest player in this space, with its logistics network  reaching 600 cities in India (and an additional 300 with third-party logistics providers). It was joined by a new contender this year.\n India’s richest man Mukesh Ambani’s JioMart, a new e-commerce venture between the nation’s largest retail chain (Reliance Retail) and telecom network (Reliance Jio Platforms), began limited  operations this April and has since  expanded to over 200 cities and towns across India.\n Facebook, which  invested $5.7 billion in Reliance Jio Platforms earlier this year, said the two companies will explore ways to serve the nation’s 60 million small and medium sized businesses.\n “These small businesses are critical to the Indian economy. If you look at Facebook as a company, there has always been a focus on helping these businesses,” Facebook India head Ajit Mohan told TechCrunch in an interview earlier this year. “These small businesses, first-time entrepreneurs and new ventures leverage the Facebook platform to find new customers and expand to additional markets.”\n  Neighborhood stores dot tens of thousands of cities, towns and villages in India. They have survived — and thrived, despite — retail giants’ billions of investment in the country. In recent quarters, both Flipkart and  Amazon   have  rushed to collaborate with these mom and pop.", "posttime": "2020-07-23 15:30:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "收购,buys,印度", "title": "\nFlipkart收购沃尔玛印度批发业务以接触夫妻店", "title_en": "\n\t\t\t\tFlipkart buys Walmart’s India wholesale business to reach mom and pop\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/23/flipkart-buys-walmarts-india-wholesale-business-to-reach-mom-and-pop/", "via": "", "real_tags": ["收购", "buys", "印度"]}, {"category": "", "categoryclass": "", "imagename": "5731bb1b22000b5197f3d42d3cf9753c.jpg", "infoid": 1013702, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "头状化是一种进化趋势，经过许多世代，嘴巴、感觉器官和神经节集中在动物的前端，形成头部区域。这与运动和两侧对称有关，这样动物就有了明确的头端。这导致了三类动物，即节肢动物、头足类软体动物和脊椎动物，形成了高度复杂的大脑。\n线虫，如放射状对称的水生动物，表现出一定程度的头状化。花水母的头端有嘴、感光细胞和密集的神经细胞。[1]。\n头状化是双头目的一个特征，双头目是一个包含大多数动物门的大群体。[2]它们有移动的能力，使用肌肉，并且它们的身体计划有一个前端，当动物向前移动时，它首先会遇到刺激，相应地，它们已经进化到包含身体的许多感官，能够探测到光、化学物质和经常是声音。通常也有一组神经细胞能够处理来自这些感觉器官的信息，在几个门类中形成一个大脑，在另一些门类中形成一个或多个神经节。[3]。\nAcoela是基本的双侧类，是异形类的一部分。它们是小而简单的动物，头端的神经细胞比其他地方略多，不能形成清晰而紧凑的大脑。这代表了头化的早期阶段。[4]。\n扁形蠕虫(扁虫)的神经系统比Acoela的神经系统更复杂，并且头部较轻，例如在大脑上方靠近前端有一个眼点。[4]。\n哲学家迈克尔·特雷斯特曼(Michael Trestman)指出，节肢动物、头足类形状的软体动物和脊索动物这三个双边动物门的独特之处在于，它们拥有复杂的活动体，这是鳄鱼和扁平线虫所没有的。任何这样的动物，无论是捕食者还是猎物，都必须意识到它的环境-捕捉它的猎物，或者躲避它的捕食者。这些群体正是那些头头化程度最高的群体。[5][6]然而，这些群体并不是紧密相关的：事实上，正如系统发育树所示，他们代表了比拉特里亚的广泛分离的分支；他们的血统在数亿年前就分裂了。为清楚起见，未显示其他(头骨较少的)门。[7][8][9]。\n在节肢动物中，随着躯干节段越来越多地并入头部区域，头化也在进行。这是有利的，因为它允许进化出更有效的口部来捕捉和处理食物。昆虫是高度头状化的，它们的大脑由三个与腹神经索相连的融合神经节组成，腹神经索在胸部和腹部的每一段都有一对神经节。昆虫头部是一种精细的结构，由几个部分刚性地融合在一起，并配备了单眼和复眼，以及包括感官触角和复杂口器(上颌和下颌)在内的多个附属物。[4]。\n包括章鱼、鱿鱼、墨鱼和鹦鹉螺在内的头足类软体动物是最聪明和高度头化的无脊椎动物，具有发达的感官，包括先进的相机眼睛和巨大的大脑。[10][11]\n脊椎动物(包括哺乳动物、鸟类和鱼类)的头颅已被广泛研究。[4]脊椎动物的头部是复杂的结构，有不同的感觉器官；有一个大的、多叶的大脑；通常有牙齿的下巴；还有一条舌头。像Branchiostoma(Lanclet，一种很小的鱼形动物，几乎没有头骨)这样的头颈动物与脊椎动物关系密切，但没有这些结构。20世纪80年代，新的头部假说提出，脊椎动物头部是神经嵴和颅骨安慰剂(外胚层增厚区域)出现的进化产物。[12][13]然而，在2014年，人们发现柳叶刀的暂时性幼虫组织与形成脊椎动物头骨的神经嵴来源的软骨几乎没有区别，这表明该组织的持续存在并扩展到整个头部空间可能是形成脊椎动物头部的一条可行的进化路线。[14]高级脊椎动物的大脑越来越精细。[4]。\n理查德·萨特利(2017年2月)。牛津无脊椎动物神经生物学手册。1.牛津：184-218。Doi：10.1093/oxfordhb/9780190456757.013.7.。ISBN为9780190456757。位于许多触角底部的小脑细胞代表B系统的一个输入，而O系统的神经元是直接感光的。许多水母类具有不同程度的复杂性(Singla，1974)。此外，与外神经环相关的其他边缘感觉结构包括他汀囊(Singla，1975)和机械感受器，如Aglantha的触觉梳子，它们位于触须基部，可以激活逃逸游泳回路(Arkett&Amp；Mackie，1988；Mackie，2004b)。引用日记需要|日记=(帮助)；|章节=忽略(帮助)。\n^a b c d e圣阿贝吉，Nelson(2013)。动物界的兴起与进化的表观遗传机制。建造地球上最复杂的结构：动物发展和进化的表观遗传叙事。埃尔塞维尔。第239-298页。ISBN978-0-12-401667-5。\n^Trestman，Michael(2013年4月)。寒武纪大爆炸和具身认知的起源(PDF)。生物学理论。8(1)：80-92。DOI：10.1007/s13752-0130102-6.。\n^Godfrey-Smith，Peter(2017)。其他心智：章鱼和智能生命的进化。哈珀柯林斯出版社。第38页。ISBN978-0-00-822628-2。\n^Peterson，Kevin J.；Cotton，James A.；Gehling，James G.；Pisani，Davide(2008年4月27日)。双边埃迪卡拉纪的出现：遗传化石记录和地质化石记录之间的一致性。伦敦皇家学会哲学汇刊B：生物科学。363(1496)：1435-1443。DOI：10.1098/rstb.2007.2233.。太平洋投资管理公司上涨了2614224。PMID为18192191。\n^Parfrey，Laura Wegener；Lahr，Daniel J.G.；Knoll，Andrew H.；Katz，Laura A.(2011年8月16日)。用多基因分子钟估计早期真核生物多样化的时机。美国国家科学院院刊。108(33)：13624-13629。密码：2011PNAS..10813624P。Doi：10.1073/pnas.1110633108.。太平洋投资管理公司上涨了3158185。PMID为21810989。\nTricarico，E.；Amanuo，P.；Ponte，G.；Fiorito，G.(2014)。头足类软体动物章鱼的认知与再认：协调与环境和同种生物的相互作用&#34；，。在Witzany，G.(编辑)。动物的生物传播学。斯普林格。第337-349页。ISBN电话：978-94-007-7413-1。\n^所罗门，埃尔德拉；伯格，琳达；马丁，戴安娜·W(2010)。生物学。进行学习。884页。ISBN978-1-133-17032-7。\n甘斯，C.；诺斯卡特，R.G.(1983)。神经嵴与脊椎动物的起源：一个新的头部。科学。220：268-273。DOI：10.1126/Science.220.4594.268.。\n^Diogo，R.；等人。(2015年)。在脊椎动物的心咽进化中，为新的头部换一个新的心脏。大自然。520(7548)：466。DOI：10.1038/nature14435。\n^Jandzik，D.；Garnett，A.T.；Square，T.；Cattell，M.V.；Yu，J.K.；Medeiros，D.M.(2015年2月26日)。通过选择一个古老的脊索骨组织来进化新的脊椎动物头部。大自然。518(7540)：534-537。密码：2015Natur.518..534J.。DOI：10.1038/nature14000。PMID为25487155。版面摘要见：进化：脊椎动物是如何长出头的。研究。自然(纸张)。516(7530)：171.。2014年12月11日。", "note_en": "Cephalization is an  evolutionary trend in which, over many generations, the mouth,  sense organs, and nerve ganglia become concentrated at the front end of an  animal, producing a  head region. This is associated with  movement and  bilateral symmetry, such that the animal has a definite head end. This led to the formation of a highly sophisticated  brain in three groups of animals, namely the  arthropods,  cephalopod  molluscs, and  vertebrates.\n   Cnidaria such as the radially symmetrical  Hydrozoa, show some degree of cephalization. The  Anthomedusae have a head end with their mouth, photoreceptive cells, and a concentration of neural cells.  [1]\n    Cephalization is a characteristic feature of the  Bilateria, a large group containing the majority of animal phyla.  [2] These have the ability to move, using muscles, and a  body plan with a front end that encounters stimuli first as the animal moves forwards, and accordingly has evolved to contain many of the body&#39;s sense organs, able to detect light, chemicals, and often sound. There is often also a collection of nerve cells able to process the information from these sense organs, forming a brain in several phyla and one or more ganglia in others.  [3]\n  The  Acoela are basal bilaterians, part of the  Xenacoelomorpha. They are small and simple animals, and have very slightly more nerve cells at the head end than elsewhere, not forming a distinct and compact brain. This represents an early stage in cephalization.  [4]\n   The  Platyhelminthes (flatworms) have a more complex nervous system than the Acoela, and are lightly cephalized, for instance having an eyespot above the brain, near the front end.  [4]\n  The philosopher Michael Trestman noted that three bilaterian phyla, namely the arthropods, the molluscs in the shape of the cephalopods, and the chordates, were distinctive in having &#34;complex active bodies&#34;, something that the acoels and flatworms did not have. Any such animal, whether predator or prey, has to be aware of its environment—to catch its prey, or to evade its predators. These groups are exactly those that are most highly cephalized.  [5]  [6] These groups, however, are not closely related: in fact, they represent widely separated branches of the Bilateria, as shown on the  phylogenetic tree; their lineages split hundreds of millions of years ago. Other (less cephalized) phyla are not shown, for clarity.  [7]  [8]  [9]\n     In  arthropods, cephalization progressed with increasing incorporation of trunk segments into the head region. This was advantageous because it allowed for the evolution of more effective mouth-parts for capturing and processing food.  Insects are strongly cephalized, their brain made of three fused  ganglia attached to the ventral nerve cord, which in turn has a pair of ganglia in each segment of the thorax and abdomen. The insect head is an elaborate structure made of several segments fused rigidly together, and equipped with both simple and  compound eyes, and multiple appendages including sensory  antennae and complex  mouthparts (maxillae and mandibles).  [4]\n    Cephalopod  molluscs including  octopus,  squid,  cuttlefish and  nautilus are the most intelligent and highly cephalized invertebrates, with well-developed senses, including  advanced &#39;camera&#39; eyes and large brains.  [10]  [11]\n    Cephalization in  vertebrates, the group that includes  mammals,  birds, and  fishes, has been studied extensively.  [4] The heads of vertebrates are complex structures, with distinct sense organs; a large, multi-lobed brain; jaws, often with teeth; and a tongue.  Cephalochordates like   Branchiostoma (the lancelet, a small fishlike animal with very little cephalization), are closely related to vertebrates but do not have these structures. In the 1980s, the  new head hypothesis proposed that the vertebrate head is an evolutionary novelty resulting from the emergence of  neural crest and cranial  placodes (thickened areas of  ectoderm).  [12]  [13] However, in 2014, a transient  larva tissue of the lancelet was found to be virtually indistinguishable from the  neural crest-derived  cartilage which forms the vertebrate  skull, suggesting that persistence of this tissue and expansion into the entire head space could be a viable evolutionary route to formation of the vertebrate head.  [14] Advanced vertebrates have increasingly elaborate  brains.  [4]\n    ^   Satterlie, Richard (February 2017).  &#34;The Oxford Handbook of Invertebrate Neurobiology&#34;.  1. Oxford: 184–218.  doi: 10.1093/oxfordhb/9780190456757.013.7.  ISBN   9780190456757.  Ocelli located at the base of the many tentacles represent one input to the B system, whereas the neurons of the O system are directly photosensitive. Many hydromedusae have ocelli of different levels of complexity (Singla, 1974). In addition, other marginal sensory structures associated with the outer nerve ring include statocysts (Singla, 1975), and mechanoreceptors, such as the tactile combs of Aglantha, which are located at the tentacle bases, and can activate the escape swimming circuitry (Arkett &amp; Mackie, 1988; Mackie, 2004b).   Cite journal requires  |journal= ( help);   |chapter= ignored ( help)\n   ^     a     b     c     d     e   Çabej, Nelson (2013).  Rise of the Animal Kingdom and Epigenetic Mechanisms of Evolution.  Building the most complex structure on Earth : an epigenetic narrative of development and evolution of animals. Elsevier. pp. 239–298.  ISBN   978-0-12-401667-5.\n ^   Trestman, Michael (April 2013).  &#34;The Cambrian Explosion and the Origins of Embodied Cognition&#34;  (PDF).  Biological Theory.  8 (1): 80–92.  doi: 10.1007/s13752-013-0102-6.\n ^   Godfrey-Smith, Peter (2017).   Other Minds: The Octopus and the Evolution of Intelligent Life. HarperCollins Publishers. p. 38.  ISBN   978-0-00-822628-2.\n ^   Peterson, Kevin J.; Cotton, James A.; Gehling, James G.; Pisani, Davide (27 April 2008).  &#34;The Ediacaran emergence of bilaterians: congruence between the genetic and the geological fossil records&#34;.  Philosophical Transactions of the Royal Society of London B: Biological Sciences.  363 (1496): 1435–1443.  doi: 10.1098/rstb.2007.2233.  PMC   2614224.  PMID  18192191.\n ^   Parfrey, Laura Wegener; Lahr, Daniel J. G.; Knoll, Andrew H.; Katz, Laura A. (16 August 2011).  &#34;Estimating the timing of early eukaryotic diversification with multigene molecular clocks&#34;.  Proceedings of the National Academy of Sciences.  108 (33): 13624–13629.  Bibcode: 2011PNAS..10813624P.  doi: 10.1073/pnas.1110633108.  PMC   3158185.  PMID  21810989.\n  ^   Tricarico, E.; Amodio, P.; Ponte, G.; Fiorito, G. (2014). &#34;Cognition and recognition in the cephalopod mollusc  Octopus vulgaris: coordinating interaction with environment and conspecifics&#34;. In Witzany, G. (ed.).  Biocommunication of Animals. Springer. pp. 337–349.  ISBN   978-94-007-7413-1.\n ^   Solomon, Eldra; Berg, Linda; Martin, Diana W. (2010).   Biology. Cengage Learning. p. 884.  ISBN   978-1-133-17032-7.\n ^   Gans, C.; Northcutt, R. G. (1983). &#34;Neural crest and the origin of vertebrates: a new head&#34;.  Science.  220: 268–273.  doi: 10.1126/science.220.4594.268.\n ^   Diogo, R.; et al. (2015). &#34;A new heart for a new head in vertebrate cardiopharyngeal evolution&#34;.  Nature.  520 (7548): 466.  doi: 10.1038/nature14435.\n ^   Jandzik, D.; Garnett, A. T.; Square, T. A.; Cattell, M. V.; Yu, J. K.; Medeiros, D. M. (26 February 2015). &#34;Evolution of the new vertebrate head by co-option of an ancient chordate skeletal tissue&#34;.  Nature.  518 (7540): 534–537.  Bibcode: 2015Natur.518..534J.  doi: 10.1038/nature14000.  PMID  25487155.    For laysummary see:  &#34;Evolution: How vertebrates got a head&#34;. Research.   Nature (paper).  516 (7530): 171. 11 December 2014.", "posttime": "2020-07-23 15:29:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "形成,cephalization,进化", "title": "&lt;动&gt;头部形成，头向集中", "title_en": "Cephalization", "transed": 1, "url": "https://en.wikipedia.org/wiki/Cephalization", "via": "", "real_tags": ["形成", "进化"]}, {"category": "", "categoryclass": "", "imagename": "8edf00ea37586dd95d0200feb2464a14.png", "infoid": 1013700, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在窥探太空最深处五年后，研究人员发布了他们所称的有史以来最大的宇宙三维地图。不，你不能看你的房子。\n这张令人难以置信的地图是一个名为斯隆数字天空调查(SDSS)的正在进行的项目的结果，该项目是一个雄心勃勃的国际探索项目，旨在绘制可观测宇宙的扩张图，并有望在此过程中解决一些宇宙难题。随着这次最新的更新，该项目已经绘制和测量了200多万个星系，从我们的银河系延伸到110亿光年以外的古代物体。\n这张详细的新地图将帮助天文学家拼凑出宇宙膨胀的模糊时期，即所谓的缺口。\n犹他大学宇宙学家、该项目首席研究员凯尔·道森(Kyle Dawson)在一份声明中表示：我们对宇宙的古代史和最近的膨胀史都相当了解，但在110亿年的中期存在一个麻烦的缺口。五年来，我们一直在努力填补这一空白。\n这一鸿沟始于宇宙大爆炸后的数十亿年。多亏了宇宙微波背景，科学家们才能在此之前测量宇宙的膨胀速率。宇宙微波背景是研究人员仍然可以探测到的宇宙幼年遗留下来的古老辐射；他们还可以通过测量地球与附近星系之间的距离随着时间的推移而增加来计算最近的膨胀。但是中期的膨胀很少被研究，因为超过几亿光年的星系的光线可能非常微弱。为了填补这一空白，一个由来自世界各地的100多名科学家组成的团队不仅观察了遥远的星系，还观察了明亮燃烧的类星体(由宇宙中最饥饿的黑洞提供动力的极其明亮的物体)。\n这项调查的关键是一种被称为红移的现象，通过这个过程，来自最古老、最遥远的星系的光实际上被宇宙的膨胀所拉伸，增加了它的波长，并将其向光谱中更红的一端移动。这种宇宙颜色变化的结果是，远处的光源看起来更红，而那些离地球更近的光源看起来更蓝(你可以在上面团队的地图中看到这种现象)。\n为了计算110亿年前的宇宙膨胀率，研究小组测量了数百万远处物体的红移及其速度-这一测量显示了一个星系受到周围其他物质的引力的拖累程度。7月20日发布的23项新研究中描述了该团队的研究结果，结果表明，宇宙在经历了一段减速期后，在大约60亿年前开始以更快的速度膨胀。\n科学家们将宇宙的膨胀归因于一种名为暗能量的神秘力量，尽管没有人完全确定它是什么或存在于何处。研究人员说，像这样的调查有助于科学家更好地限制暗能量的性质，尽管它仍然远未被理解。这个难题的解决方案将不得不等待另一天…。希望这不会是几十亿年前的事。", "note_en": "After five years of peering into the deepest reaches of space, researchers have released what they call the &#34;largest three-dimensional map of the universe&#34; ever. No, you cannot see your house.\n The mind-boggling map is the result of an ongoing project called the Sloan Digital Sky Survey (SDSS) — an ambitious, international quest to map the expansion of the observable universe, and hopefully solve a few   cosmic conundrums in the process. With this newest update, the project has mapped and measured more than 2 million galaxies, stretching from our Milky Way to ancient objects more than 11 billion light-years away.\n     The detailed new map will help astronomers piece together a murky period of the universe&#39;s expansion known as &#34;the gap.&#34;\n &#34;We know both the ancient history of the universe and its recent expansion history fairly well, but there&#39;s a troublesome gap in the middle 11 billion years,&#34; Kyle Dawson, a cosmologist at the University of Utah and lead researcher of the project,    said in a statement. &#34;For five years, we have worked to fill in that gap.&#34;\n The gap begins a few billion years after the   Big Bang. Scientists are able to measure the rate of the universe&#39;s expansion before this thanks to the   cosmic microwave background — ancient radiation left over from the infancy of the universe that researchers can still detect; and they can calculate recent expansion by measuring how the distance between Earth and nearby galaxies increases over time. But expansion in the middle period has been little studied because the light of galaxies more than a few hundred million light-years away can be incredibly faint. To fill in the gap, a team of more than 100 scientists from around the world looked at not just distant galaxies, but also bright-burning quasars (extremely luminous objects powered by the hungriest black holes in the cosmos).\n Key to this survey is a phenomenon called redshift — a process by which light from the most ancient, distant galaxies is literally stretched by the expansion of the universe, increasing its wavelength and shifting it toward the redder end of the spectrum. As a result of this cosmic color-change, distant light sources appear redder, while those nearer to Earth look bluer (you can see this phenomenon illustrated in the team&#39;s maps above).\n  To calculate the rate of cosmic expansion 11 billion years ago, the team measured the redshift of millions of distant objects along with their velocities — a measurement that shows how much a galaxy is being tugged by the   gravity of other matter around it. The team&#39;s results, which are described in   23 new studies released on July 20, show that the universe began expanding at an increased rate about 6 billion years ago, following a period of deceleration.\n Scientists attribute the universe&#39;s expansion to a mysterious force called   dark energy, though no one is entirely sure what it is or where it exists. Surveys like this one help scientists better constrain the properties of dark energy, the researchers said, though it remains far from understood. The solution to that conundrum will have to wait for another day … hopefully one not too many billions of years away.", "posttime": "2020-07-23 15:01:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "科学家,揭开,unveil,宇宙", "title": "科学家揭开有史以来最大的宇宙3D地图面纱", "title_en": "Scientists Unveil Largest 3D Map of the Universe Ever", "transed": 1, "url": "https://www.livescience.com/largest-3d-universe-map.html", "via": "", "real_tags": ["科学家", "揭开", "unveil", "宇宙"]}, {"category": "", "categoryclass": "", "imagename": "fab34e03aa65fc34628171c5e1b23cdd.jpg", "infoid": 1013699, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了创作这首曲子，我们选取了2008年由“滚石”杂志编撰的100位最伟大的歌手。在这份名单中，我们增加了一些当今的顶级歌手，包括2014年公告牌音乐大奖最佳男歌手和女歌手的提名者。我们交叉引用了结果列表和由范围位置管理的声音范围数据。我们包括了名单上所有数据容易获得的歌手。\n保罗·麦卡特尼(Paul McCartney)住在都柏林，菲奥娜(Fiona)在CC BY-SA 2.0下使用/从原始数据中去除饱和度。\n碧昂斯-蒙特利尔2013&#34；由Nat CH Villa在CC下使用，由2.0/从原来的降低饱和度。\n麦当娜和弗雷迪·墨丘利，由Debarshi Ray在CC By-SA 2.0下使用/从原始中去饱和。\n&#34；NáTTúra演唱会雷克雅未克2008 Björk&#34；由Bruce McAdam在CC By-SA 2.0下使用/从原始中去饱和。\n隐藏", "note_en": "To create this piece, we took the  100 Greatest Singers of All Time as compiled by Rolling Stone magazine in 2008. To this list, we added some of today&#39;s top singers including the nominees for top male and female artist at the  Billboard Music Awards 2014. We cross-referenced the resulting list with vocal range data curated by  The Range Place. We included all of the singers on the list for whom the data was readily available.\n    &#34; Paul McCartney live in Dublin&#34; by  Fiona used under  CC BY-SA 2.0 / Desaturated from original.\n  &#34; Beyonce - Montreal 2013&#34; by  Nat Ch Villa used under  CC BY 2.0 / Desaturated from original.\n      &#34; Madonna and Freddie Mercury&#34; by  Debarshi Ray used under  CC BY-SA 2.0 / Desaturated from original.\n      &#34; Náttúra concert Reykjavik 2008 Björk&#34; by  Bruce McAdam used under  CC BY-SA 2.0 / Desaturated from original.\n  hide", "posttime": "2020-07-23 14:59:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "艺术,艺术家,ranges,cc", "title": "有史以来最伟大的艺术家的音域", "title_en": "The vocal ranges of the greatest artists of all time", "transed": 1, "url": "https://www.concerthotels.com/worlds-greatest-vocal-ranges", "via": "", "real_tags": ["艺术", "艺术家", "ranges", "cc"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1013698, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "庆祝那些大放异彩的制造者、创造者和编码者。", "note_en": "Celebrating the makers, creators and coders who shine.", "posttime": "2020-07-23 14:53:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,静态,free,大放异彩", "title": "快速和免费的静态网站上的小故障和新的项目时间-微光", "title_en": "Fast and free static sites on Glitch and new Project Hours – Glimmer", "transed": 1, "url": "https://glitch.com/glimmer/post/fast-free-static-site-hosting-glitch-project-hours", "via": "", "real_tags": ["免费", "静态", "free", "大放异彩"]}, {"category": "", "categoryclass": "", "imagename": "a09566c780fa28929a775420bbec3f19.jpg", "infoid": 1013696, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "约瑟夫·詹姆斯·迪安吉洛(中)，被指控为金州杀手，于6月份出庭。刑事调查人员使用GEDMatch确认了DeAngelo的身份。\n7月19日，使用GEDMatch网站上传自己的DNA信息并寻找亲人填写家谱的家谱爱好者得到了一个不愉快的惊喜。突然间，警方可以搜索100多万份隐藏起来的DNA图谱，这些DNA图谱是警方使用该网站查找与犯罪现场DNA部分匹配的。\n这一消息削弱了去年12月收购GEDMatch的法医遗传学公司Verogen的努力，该公司试图让用户相信，它将保护用户的隐私，同时追求一项基于基因谱系帮助解决暴力犯罪的业务。\n第二个警报出现在7月21日，总部位于以色列的家谱网站MyHeritage宣布，它的一些用户受到了网络钓鱼攻击，目的是获取他们在该网站的登录详细信息-显然是针对两天前在GEDMatch上的攻击中获得的电子邮件地址。\n在通过电子邮件发送给BuzzFeed新闻并发布在Facebook上的一份声明中，Verogen解释说，突然揭开本应对执法部门隐藏的GEDMatch个人资料是“通过通过现有用户账户对我们的一台服务器进行复杂的攻击而策划的”。\n“由于这次入侵，所有用户权限都被重置，所有用户都可以看到所有配置文件。这种情况持续了大约3个小时，“声明说。“在此期间，没有选择参与执法配对的用户可以进行执法配对，相反，GEDMatch用户可以看到所有执法配置文件。”\n2018年4月，随着被指控为金州杀手的约瑟夫·詹姆斯·迪安吉洛(Joseph James DeAngelo)被捕，调查基因系谱爆炸式增长。上个月，迪安吉洛承认了13起谋杀案，并承认了数十起其他罪行。调查人员已经将1980年一起双重谋杀案现场发现的DNA与GEDMatch上属于肇事者远亲的个人资料进行了部分匹配。通过艰苦的研究，他们建立了家谱，最终汇聚在迪安吉洛。\n从那时起，数十名被指控的谋杀犯和强奸犯也以类似的方式被确认。但这在家谱学界造成了很大的分歧。虽然一些系谱学家现在正在与警方合作，但另一些人认为基因隐私已经受到损害。\nGEDMatch的解决方案是，用户必须明确选择接受执法部门的搜索。在一起有争议的事件发生后，GEDMatch修改了自己的规则，允许警方调查一起不那么严重的暴力袭击事件。根据Verogen的数据，在黑客攻击之前，145万个个人资料中约有28万个被选中。周日的入侵事件改变了设置，因此所有145万份DNA图谱都被选择用于执法搜查。\n这场激烈辩论双方的系谱学家告诉BuzzFeed新闻，他们担心新的安全漏洞会阻碍人们将自己的DNA档案放到网上-这既会损害在线家谱社区，也会损害破获悬案的努力。\n加州利弗莫尔的家谱学家莉亚·拉金(Leah Larkin)直言不讳地倡导遗传隐私，她告诉BuzzFeed新闻：“这是一个全新的糟糕水平。”\nParabon NanoLabs公司的首席系谱学家CeCe Moore告诉BuzzFeed News：“从长远来看，如果人们认为他们对GEDMatch没有信心，这会导致更多的个人资料被删除，这不是一件好事。”Parabon NanoLabs公司与警方合作解决暴力犯罪。\n目前还不清楚执法部门是否搜查了任何未经授权的个人资料。然而，摩尔告诉BuzzFeed新闻，到目前为止，她的团队负责通过基因系谱确定大部分犯罪嫌疑人的身份，当时处于离线状态。“我们没有看到任何我们不应该看到的东西，”她说。\n在最初的黑客攻击后，GEDMatch的正常服务曾短暂恢复，但在7月20日，摩尔注意到所有个人资料的权限再次被切换，这一次阻止了整个数据库的执法搜索，但使标记为“研究”的个人资料可见，这些个人资料本应对所有搜索隐藏。\n该网站很快就离线了，取而代之的是一条消息：“GedMatch网站正在停机进行维护--目前没有预计到达时间。”\n“我们正在与一家网络安全公司合作，进行全面的法医审查，并帮助我们实施尽可能好的安全措施，”维罗根在第二起事件后发布的声明称。\n这起入侵事件让Verogen感到尴尬，用户在七个月前收购该网站时，曾希望该公司能为基因隐私带来更专业的方式。在Verogen之前，GEDMatch由两名业余家谱爱好者柯蒂斯·罗杰斯(Curtis Rogers)和约翰·奥尔森(John Olson)创立并运营。\n尽管如此，该公司的声明向用户保证：“没有用户数据被下载或泄露。”\n一封发送给MyHeritage用户的钓鱼电子邮件将他们发送到myheritaqe.com域名上的一个虚假登录页面。\n这一结论在7月21日遭到质疑，当时家谱网站MyHeritage警告其客户，那些在GEDMatch拥有账户的人正成为一封钓鱼电子邮件的目标，这封电子邮件将他们发送到myheritaqe.com域名的一个虚假登录页面-该网站将MyHeritage中的“g”替换为“q”-以获取他们的用户名和密码。\nMyHeritage在一篇博客文章中指出：“因为GEDMatch在两天前遭遇了数据泄露，我们怀疑肇事者就是通过这种方式获得了他们的电子邮件地址和名字。”\n“[W]我们发现其中16人已经成为该网站的受害者，并在网站上输入了他们的密码。现在这个数字可能会更高。我们试图单独联系这些用户，警告他们再次更改密码，并在MyHeritage上设置双因素身份验证。“该公司表示。\n与GEDMatch不同，MyHeritage不允许警方使用其数据库。但没有证据表明，这些黑客攻击是由试图颠覆执法搜查限制的流氓警察实施的。\n袭击的动机尚不清楚。科琳·菲茨帕特里克(Colleen Fitzpatrick)是一名系谱学家，也是与执法部门合作的Identifinders International的总裁。她说，她怀疑黑客是在“兜风”。\n菲茨帕特里克在接受BuzzFeed新闻采访时表示：“他们看到了一些他们可以扰乱的东西，然后坐下来看新闻。”", "note_en": "Joseph James DeAngelo (center), who has been charged with being the Golden State Killer, in court in June. Criminal investigators identified DeAngelo using GEDmatch.\n  On July 19, genealogy enthusiasts who use the website  GEDmatch to upload their DNA information and find relatives to fill in their family trees got an unpleasant surprise. Suddenly, more than a million DNA profiles that had been hidden from cops using the site to find partial matches to crime scene DNA were available for police to search.\n The news has undermined efforts by  Verogen, the forensic genetics company that  purchased GEDmatch last December, to convince users that it would protect their privacy while pursuing a business based on using genetic genealogy to help solve violent crimes.\n A second alarm came on July 21, when  MyHeritage, a genealogy website based in Israel, announced that some of its users had been  subjected to a phishing attack to obtain their log-in details for the site — apparently targeting email addresses obtained in the attack on GEDmatch just two days before.\n In a statement emailed to BuzzFeed News and  posted on Facebook, Verogen explained that the sudden unmasking of GEDmatch profiles that were supposed to be hidden from law enforcement was “orchestrated through a sophisticated attack on one of our servers via an existing user account.”\n “As a result of this breach, all user permissions were reset, making all profiles visible to all users. This was the case for approximately 3 hours,” the statement said. “During this time, users who did not opt in for law enforcement matching were available for law enforcement matching and, conversely, all law enforcement profiles were made visible to GEDmatch users.”\n Investigative genetic genealogy exploded onto the scene in April 2018 with the  arrest of Joseph James DeAngelo, alleged to be the Golden State Killer. DeAngelo  pleaded guilty to 13 murders and admitted to dozens of other crimes last month. Investigators had partially matched DNA found at the scene of a  1980 double murder to profiles on GEDmatch that belonged to the perpetrator’s distant relatives. Through painstaking research, they built out family trees that eventually converged on DeAngelo.\n Since then, dozens of alleged murderers and rapists have been identified in a similar way. But this has caused a big split within the world of genealogy. While some genealogists are now working with police, others argue that genetic privacy has been compromised.\n GEDmatch’s solution, which followed a controversial incident in which the site  bent its own rules to allow police to investigate a less serious violent assault, was that users would have to  explicitly opt in for searching by law enforcement. About 280,000 out of 1.45 million profiles had been opted in before the hack, according to Verogen. Sunday’s breach changed the settings so that all 1.45 million DNA profiles were opted in for law enforcement searches.\n Genealogists on both sides of this fractious debate told BuzzFeed News that they feared the new security breaches would discourage people from putting their DNA profiles online — hurting both the online genealogy community and efforts to solve cold cases.\n “This is a whole new level of bad,” Leah Larkin, a genealogist in Livermore, California, who is an outspoken advocate for genetic privacy, told BuzzFeed News.\n “Long term, if people decide they have less confidence in GEDmatch and it leads to more deletions of profiles, that’s not a good thing,” CeCe Moore, lead genealogist with the company Parabon NanoLabs, which works with police to solve violent crimes, told BuzzFeed News.\n It’s unclear whether any unauthorized profiles were searched by law enforcement. However, Moore told BuzzFeed News that her team, which is responsible for most of the identifications of criminal suspects made through genetic genealogy so far, was offline at the time. “We didn’t see anything we shouldn’t have,” she said.\n Normal service at GEDmatch had briefly resumed after the initial hack, but on July 20, Moore noticed that the permissions on all profiles had been switched again, this time blocking law enforcement searches across the entire database, but making visible profiles marked as “Research,” which are supposed to be hidden from all searches.\n The site was quickly taken offline and replaced with the message: “The gedmatch site is down for maintenance - Currently No ETA.”\n “We are working with a cybersecurity firm to conduct a comprehensive forensic review and help us implement the best possible security measures,” said Verogen’s statement, which was released after the second incident.\n The breach is embarrassing for Verogen, which users hoped would bring a more professional approach to genetic privacy when it purchased the site seven months ago. Before Verogen, GEDmatch was founded and run by two amateur genealogy enthusiasts, Curtis Rogers and John Olson.\n Still, the company statement reassured users: “No user data was downloaded or compromised.”\n  A phishing email sent to MyHeritage users sent them to a fake login page at the domain myheritaqe.com.\n  That conclusion was contested on July 21, when the genealogy site MyHeritage  warned its customers that those with accounts at GEDmatch were being targeted by a phishing email that sent them to a fake log-in page at the domain myheritaqe.com — which replaced the “g” from MyHeritage with a “q” — to harvest their usernames and passwords.\n “Because GEDmatch suffered a data breach two days ago, we suspect that this is how the perpetrators got their email addresses and names for this abuse,” MyHeritage noted in a blog post.\n “[W]e have found that 16 of them have fallen victim to the website and entered their password in it. The number may be higher by now. We attempted to contact each of these users individually to warn them to change their password again and to set up Two-Factor Authentication on MyHeritage,” the company said.\n Unlike GEDmatch, MyHeritage does not allow its database to be used by police. But there is no evidence that the hacks were perpetrated by rogue cops trying to subvert restrictions on law enforcement searches.\n What motivated the attacks is unclear. Colleen Fitzpatrick, a genealogist and president of Identifinders International, which works with law enforcement, said she suspected that the hackers were “joyriding.”\n “They see something they can disrupt and sit back and watch the news,” Fitzpatrick told BuzzFeed News.", "posttime": "2020-07-23 14:30:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,gedmatch,opted", "title": "黑客攻击了GEDMatch服务器，导致执法部门选择加入GEDMatch服务器的100多万个个人资料进行搜索，而这些资料之前是被选择退出的", "title_en": "Hackers attacked GEDmatch servers and caused over 1M of its profiles to be opted-in for searching by law enforcement, which were previously opted-out", "transed": 1, "url": "https://www.buzzfeednews.com/article/peteraldhous/hackers-gedmatch-dna-privacy?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["黑客", "gedmatch", "opted"]}, {"category": "", "categoryclass": "", "imagename": "684700db927619ac5333d49d106c87f0.jpeg", "infoid": 1013695, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "生锈是一种新语言，已经有了很好的教科书。但有时它的教科书很难，因为它们是为以英语为母语的人准备的。现在很多公司和个人都在学习“生锈”，用一本有简单英语的书可以学得更快。这本教材是为这些公司和个人用简单的英语学习的。\n也许您还不想安装铁锈，这也没关系。你可以去https://play.rust-lang.org/开始写“锈”。您可以在那里编写代码，然后单击Run查看结果。\n如果希望代码更快，请将Debug更改为Release。调试：编译速度较快，运行速度较慢，包含调试信息。版本：编译速度较慢，运行速度较快，删除调试信息。\n单击共享以获取URL。如果需要帮助，您可以使用它来共享您的代码。\n如果您想安装铁锈，请访问此处https://www.rust-lang.org/tools/install并按照说明操作。通常，您将使用Rustup来安装和更新Rust。\nRuust具有称为基元类型的简单类型。我们将从整数开始。整数是没有小数点的整数。有两种类型的整数：\n符号表示+(加号)和-(减号)，因此带符号的整数可以是正的，也可以是负的(例如+8，-8)。但无符号整数只能为正，因为它们没有符号。\n有符号整数是：i8、i16、i32、i64、i128和isize。无符号整数是：u8、u16、u32、u64、u128和usize。\nI或u后面的数字表示该数字的位数，因此位数越多的数字可能越大。8位=一个字节，所以i8是一个字节，i64是8个字节，依此类推。大小较大的数字类型可以容纳较大的数字。例如，U8最多可以容纳255个人，而U16最多可以容纳65535个人。U128最多可容纳340282366920938463463374607431768211455。\n那么什么是isize和usize呢？这意味着您的计算机类型上的位数。(这称为计算机的体系结构。)。因此，32位计算机上的isize和usize类似于i32和u32，而64位计算机上的isize和usize类似于i64和u64。\n造成不同类型整数的原因有很多。其中一个原因是计算机性能：字节数越少，处理速度越快。但这里还有其他一些用途：\n铁锈中的字符称为字符。U8数字只会上升到255，Unicode和ASCII对这些数字使用相同的数字。这意味着Rust可以使用AS安全地将U8转换为char。(将U8转换为字符意味着&#34；假设U8是字符&#34；)。\n使用AS进行强制转换非常有用，因为Rust始终需要知道整数的类型。例如，这将不会编译：\nFn main(){让my_number=100；//我们没有编写整数类型，//所以Rust选择I32。Rust Always//如果您不告诉它使用不同类型的println！(&#34；{}&34；，my_number as char)；}。\n错误[E0604]：只能将`u8`转换为`char`，不能转换为`i32`--&gt；src\\main.rs：3：20|3|println！(&#34；{}&#34；，my_number为char)；|^。\n解决此问题的一个简单方法是使用AS。首先，我们使用As将my_number设置为U8，然后再使用一个AS将其设置为char。现在它将编译：\n所有字符均为4个字节。它们是4个字节，因为字符串中的某些字符多于一个字节。例如：\nFn Main(){let Slice=&#34；Hello！&#34；；println！(&#34；Slice为{：？}字节。&#34；，std：：Mem：：Size_of_val(Slice))；//std：：Mem：：Size_of_val提供以字节为单位的大小LetSlice2=&#34；안녕！&#34；；//韩语for&#34；hi&#34；println！(&#34；，std：：mem：：size_of_val(Slice2))；}。\nSlice的长度为6个字符和6个字节，而Slice2的长度为3个字符和7个字节。Char需要适合任何语言的任何字符，所以它是4字节长。\n类型推断意味着，如果您不告诉编译器类型，但是编译器可以自己决定，那么它就会决定。编译器总是需要知道变量的类型，但您并不总是需要告诉它。例如，如果MY_NUMBER=8，则MY_NUMBER将是I32。这是因为如果您不告诉它，编译器会选择I32作为整数。但是如果您说让my_number：u8=8，它会使my_number变成U8，因为您告诉它U8。\n所以通常编译器可以猜到。但有时你需要说出来，原因有两个：\n您正在做一件非常复杂的事情，而编译器并不知道您想要的类型。\n对于数字，你可以在数字后面说类型。您不需要空格，只需在数字后面键入即可。\n如果您想使数字易于阅读，还可以添加_。\nFn main(){LET Small_Number=10_U8；//这个更容易读，让BIG_Number=100_000_000_I32；//1亿用_}容易读。\n_不会更改数字。只是为了方便您阅读。不管你使用了多少，这都无关紧要：\nFn main(){let number=0_U8；let number 2=1_6_2_4_I32；println！(&#34；{}，{}&#34；，number，number 2)；}。\n浮点数是带小数点的数字。5.5是浮点数，6是整数。5.0也是浮点数，甚至5.也是浮点数。\nFn main(){设MY_FLOAT=5。；//Rust参见。并且知道它是一个浮点数}。\n但是这些类型不被称为浮点，它们被称为F32和F64。它与整数相同：f后面的数字表示位数。如果你不写字体，拉斯特会选择F64。\n当然，只有相同类型的浮点才能一起使用。因此，您不能将F32添加到F64。\nFn main(){让MY_FLOAT：F64=5.0；//这是F64让MY_OTHER_FLOAT：F32=8.5；//这是F32让Third_Float=My_Float+My_Other_Float；}\n错误[E0308]：类型不匹配--&gt；src\\main.rs：5：34|5|let Third_Float=MY_FLOAT+MY_OTHER_FLOAT；|^需要`f64`，找到的是`f32`。\n当您使用错误的类型时，编译器会写入&#39；&#39；&#39；&#39；&#39；&#39；&#39；&#39；&#39；期望的(Type)，发现(Type)&#39；。它按如下方式读取您的代码：\n让MY_FLOAT：F64=5.0；//编译器看到F64，让MY_OTHER_FLOAT：F32=8.5；//编译器看到F32。它是一种不同的类型。让Third_Float=MY_FLOAT+//编译器看到一个新变量。它必须是一个F64加另一个F64。现在它预计会有一架F64型的.。让Third_Float=MY_FLOAT+MY_OTHER_FLOAT；//但是找到了F32。它不能添加它们。\n因此，当您看到&#34；Expect(Type)、Found(Type)&#34；时，您必须找出编译器为什么需要不同的类型。\n当然，简单的数字很容易修正。您可以使用AS将F32转换为F64：\nFn main(){让My_Other_Float：F64=5.0；让My_Other_Float：F32=8.5；让Third_Float=My_Float+My_Other_Float As F64；//My_Other_Float As F64=像F64一样使用My_Other_Float}。\n或者更简单地，删除类型声明。铁锈将选择可以相加的类型。\nFn main(){让MY_FLOAT=5.0；//Rust将选择F64让MY_OTHER_FLOAT=8.5；//这里再次选择F64，让Third_Float=My_Float+My_Other_Float；}\nFn main(){让MY_FLOAT：F32=5.0；让MY_OTHER_FLOAT=8.5；//Rust会选择F32，让Third_Float=My_Float+My_Other_Float；//因为它知道您需要将其添加到F32}。\n普林特恩！是打印到控制台的宏。宏就像一个为您编写代码的函数。宏有一个！跟在他们后面。我们稍后将学习如何制作宏。现在，请记住这一点！表示它是宏。\n要了解；，我们将创建另一个函数。首先，在Main中，我们将打印数字8：\nPrintln中的{}！意思是将变量放在这里。这将打印Hello world编号8。\n这还会打印您好，世界编号8！当Rust查看number()时，它看到了一个函数。此函数用于：\n函数内部只有8。因为没有；，所以这是它返回的值。如果它有；，则不会返回任何内容。如果Rust包含；，则不会编译此代码，因为返回的是I32和；return()，而不是I32：\n5|fn number()-&gt；I32{|-^预期`i32`，找到`()`|隐式返回`()`，因为其正文没有尾部或`rereturn`表达式6|8；|-help：考虑删除此分号。\n这意味着您告诉我number()返回一个I32，但是您添加了一个；，所以它不会返回任何&#34；。因此编译器建议删除分号。\n您也可以编写Return 8；但在Rust中，只删除；返回是正常的。\n当您想要为函数提供变量时，请将它们放在()中。您必须给它们一个名称并写出类型。\nFn main(){Multiply(8，9)；//我们可以直接给出数字，让SOME_NUMBER=10；//也可以声明两个变量，让SOME_OTHER_NUMBER=2；Multiply(SOME_NUMBER，SOME_OTHER_NUMBER)；//将它们放入函数}FN Multiply(NUMBER_ONE：I32，NUMBER_2：I32){//两个i32将进入函数。我们称他们为一号和二号。设result=number_one*number_Two；println！(&#34；{}次{}is{}&#34；，number_one，number_Two，result)；}。\nFn main(){let multiply_result=Multiply(8，9)；//我们使用Multiply()打印并将结果交给Multiply_Result}fn Multiply(number_one：I32，number_Two：I32)-&gt；I32{let result=number_one*number_Two；println！(&#34；{}次{}is{}&#34；，number_one，number_2，result)；result//这是I32。\n使用let声明一个变量(声明一个变量=告诉Rust生成一个变量)。\n变量在代码块{}内开始和结束。在本例中，my_number在我们调用println！之前结束，因为它在自己的代码块中。\nFn main(){{let my_number=8；//my_number从这里开始//my_number在这里结束！}println！(&#34；Hello，number{}&#34；，my_number)；//没有my_number，//println！()找不到}。\nFn main(){let my_number={let Second_number=8；Second_number+9//没有分号，因此代码块返回8+9。//它的工作方式与函数一样}；println！(&#34；我的编号是：{}&#34；，my_number)；}\nFn main(){let my_number={let Second_number=8；//声明Second_Number，Second_Number+9；//将9加到Second_Number//但我们没有返回它！//Second_Number Now}；println！(&#34；My Number is：{：？}&#34；，My_Number)；//My_Number is()}。\n那么为什么我们写的是{：？}而不是{}？我们现在就来谈谈这个问题。\nRust中的简单变量可以在println！()中打印{}。但是有些变量不能，您需要调试打印。调试打印是为程序员打印的，因为它通常会显示更多信息。DEBUG有时看起来并不美观，因为它有额外的信息可以帮助您。\n您如何知道您是否需要{：？}而不需要{}？编译器会告诉您。例如：\n错误[E0277]：`()`没有实现`std：：fmt：：Display`--&gt；src\\main.rs：3：41|3|println！(&#34；这不会打印：{}&#34；，dots_print)；|^FMT：：FMT：：Help：特性`std：：fmt：：Display`没有为`()`。\n这是大量的信息。但重要的是：您可以使用`{：？}`(或者{：#？}来表示漂亮的打印效果)。这意味着您可以尝试{：？}，也可以尝试{：#？}({：#？}以不同的格式打印)。\n还有一件事：如果您不想换一行，也可以不带ln使用print！()。\nFn main(){print！(&#34；这不会打印新行&#34；)；println！(&#34；所以这将在同一行&#34；)；}\n此操作将打印此命令，而不会打印新行，因此此命令将在同一行上。\n如果您想查看最小和最大的数字，可以使用MIN和MAX。\nFn main(){println！(&#34；最小的i8是{}，最大的i8是{}。&#34；，std：：i8：：min，std：：i8：：max)；println！(&#34；最小的U8是{}，最大的U8是{}。&#34；，std：u8：min，std：：u8：：max)；println！(&#34；最小的i8。，std：：i16：：min，std：：i16：：max)；println！(&#34；最小的u16为{}，最大的u16为{}。&#34；，std：：u16：：min，std：：u16：：max)；println！(&#34；最小的I32为{}，最大的I32为{}。&#34；，STD：：I32：MIN，STD：I32：最小的u32为{}，最大的u32为{}。&#34；，std：：u32：：min，std：：u32：：max)；println！(&#34；最小的i64为{}，最大的i64为{}。&#34；，std：：i64：：min，std：：i64：：max)；println！(&#34；最小的u64为{}，最大的u64为{}。&#。Println！(&#34；最小的i128为{}，最大的i128为{}。&#34；，std：：i128：：min，std：：i128：：max)；println！(&#34；最小的u128为{}，最大的u128为{}。&#34；，std：：u128：：min，std：：u128：：max)；}。\n最小的i16为-32768，最大的i16为32767；最小的i16为0，最大的i16为65535；最小的i32为-2147483648，最大的i32为2147483647；最小的u32为0，最大的u32为4294967295。最小的i64为-9223372036854775808。最小的u128为0，最大的u128为340282366920938463463374607431768211455。\n编译器显示：错误[E0384]：不能将两次赋值给不可变变量`MY_NUMBER。这是因为如果只编写let，变量是不可变的。\n您将看到来自编译器的相同&#34；预期&34；消息：期望的整数，找到`&amp；str````。&amp；str```是我们将很快学习的字符串类型。\n隐藏意味着使用let声明一个与另一个变量同名的新变量。它看起来像是变化无常，但它是完全不同的。阴影如下所示：\nFn main(){设my_number=8；//这是I32 println！(&#34；{}&#34；，my_number)；//打印8设my_number=9.2；//这是F64。它不是my_number-它是完全不同的！Println！(&#34；{}&#34；，my_number)//打印9.2}\n那么第一个my_number被销毁了吗？不是，但是当我们调用my_number时，我们现在得到的my_number是F64。因为它们在同一个作用域块中，所以我们再也看不到第一个my_number了。\nFn main(){let my_number=8；//这是I32 println！(&#34；{}&#34；，my_number)；//打印8{let my_number=9.2；//这是F64。它不是my_number-它是完全不同的！Println！(&#34；{}&#34；，my_number)//打印9.2//但是阴影的my_number只存在到这里。//第一个my_number还活着！}println！(&#34；{}&#34；，my_number)；//打印8}。\n那么，跟踪的好处是什么呢？当您需要大量更改变量时，隐藏是很好的。\nFn main(){let inal_number={let y=10；let x=9；//x从9let x=Times_Two(X)；//Shadow with new x：18 let x=x+y；//Shadow with new x：28 x//return x：inal_number现在是x的值}；println！(&#34；现在数字是：{}&#34；，inal_number)}fn Times_Two(number：I32)-&gt；I32{编号*2}。\n如果没有影子，您将不得不考虑不同的名称，即使您并不关心x：\nFn main(){//假装我们使用的是无阴影的铁锈let Final_Number={设y=10；设x=9；//x从9let x_Two=Times_Two(X)；//x的第二个名称let x_Two_and_y=x+y；//x_Two_and_y//糟糕的是我们没有阴影-我们本可以只使用x}；println！(&#34；，Final_Number)}Fn次_Two(编号：I32)-&gt；I32{编号*2}。\n堆栈和堆是保存内存的两个位置。重要区别在于：\n堆栈需要知道编译时变量的大小。所以像I32这样的简单变量会被放入堆栈，因为我们知道它们的确切大小。\n有些类型在编译时不知道大小。但是堆栈需要知道确切的大小。你的工作是什么?。您将数据放入堆中，因为堆可以有任意大小的数据。为了找到它，指针放在堆栈上，因为我们总是知道指针的大小。\n我的BOOK第一章：我的生活第一章：我的生活第二章：我的猫15第三章：我的工作23第四章：我的家庭30第5章：未来计划43。\n所以这就像是五个点。“我的生活”这一章在哪里？它在第1页(它指向第1页)。我的工作在哪里？在第23页。\n铁锈中的指针通常称为引用。引用意味着你借用了价值，但你并不拥有它。在Rust中，引用有&amp；。所以：\n这意味着MY_REFERENCE仅查看MY_VARIABLE的数据。MY_VARIABLE仍然拥有其数据。\n我们认识那个王子！可以使用{}(用于显示)和{：？}(用于调试)进行打印，再加上{：#？}进行美观打印。但是还有许多其他的打印方式。\n例如，如果有引用，可以使用{：p}打印指针地址。\nFn main(){let number=555；println！(&#34；二进制：{：B}，十六进制：{：x}，八进制：{：O}&#34；，number，number，number)；}\nFn Main(){let Parent_Name=&#34；Vlad&34；；let Son_Name=&#34；Adrian Fahrenheit&#34；；let Family_Name=&#34；ȚEPEș&#34；；println！(&#34；这是{1}{2}，{0}{2}的儿子。&#34；，父亲名称，儿子名称，家庭名称)；}。\n父亲名称在位置0，儿子名称在位置1，家庭名称在位置2。所以它会打印这是Adrian FahrenheitȚepeș，VladȚepeș的儿子。\n可能您有一个非常复杂的字符串要打印，并且想要将名称添加到{}。您可以这样做：\nFn main(){println！(&#34；{City1}位于{Country}，{City2}也位于{Country}，但{City3}不在{Country}。&#34；，City1=&#34；首尔&34；，City2=&#34；釜山&#34；，City3=&#34；东京&#34；，Country=&#34；Korea&#34；)；}。\n非常复杂的印刷在“铁锈”中用得不多。但这里是如何做到这一点的。\n例如，如果我要编写左侧有5个ㅎ字符，右侧有5个ㅎ字符的&#34；a&#34；：\n这将打印ㅎaㅎ。让我们从1)到5)来看看这一点。\n是否需要变量名？{：ㅎ^11}无变量名：位于：之前。\n是否需要填充字符？{：ㅎ^11}是。ㅎ在：之后，有一个^。&lt；表示左侧填充字符，&gt；表示右侧填充，^表示中间填充。\n是否需要最小长度？{：ㅎ^11}是：后面有一个11。\n是否需要最大长度？{：ㅎ^11}否：没有带.的数字。在此之前。\nFn main(){let title=&#34；Today&#39；S news&#34；；println！(&#34；{：-^30}&#34；，title)；//没有变量名称，垫上-，居中，30个字符长度的字母栏=&#34；|&#34；；println！(&#34；{：&lt；15}{：&gt；15}&#34；，bar，bar)；//无变量名称，填充空格，每个15个字符，左1个，右1个字母a=&#34；首尔&#34；；让b=&#34；Tokyo&#34；；println！(&#34；{City1：-&lt；15}{City2：-&gt；15}&#34；，City1=a，City2=b)；//变量名称City1和City2，用-填充，左1个。\n&amp；str是一个简单字符串。当您编写let my_Variable=&#34；Hello，world！&#34；时，您将创建一个&amp；字符串。A&A；STR非常快。\n字符串是一个更复杂的字符串。速度有点慢，功能也比较多。字符串是指针，数据位于堆上。\nFn Main(){let Name=&#34；서태지&#34；；//这是韩文名称。没问题，因为a&amp；str是UTF-8。让其他人。\n.", "note_en": "Rust is a new language that already has good textbooks. But sometimes its textbooks are difficult because they are for native English speakers. Many companies and people now learn Rust, and could learn faster with a book that has easy English. This textbook is for these companies and people to learn Rust with simple English.\n  Maybe you don&#39;t want to install Rust yet, and that&#39;s okay. You can go to  https://play.rust-lang.org/ and start writing Rust. You can write your code there and click Run to see the results.\n  Change Debug to Release if you want your code to be faster. Debug: compiles faster, runs slower, contains debug information. Release: compiles slower, runs much faster, removes debug information.\n Click on Share to get a url. You can use that to share your code if you want help.\n If you want to install Rust, go here  https://www.rust-lang.org/tools/install and follow the instructions. Usually you will use  rustup to install and update Rust.\n   Rust has simple types that are called  primitive types. We will start with integers. Integers are whole numbers with no decimal point. There are two types of integers:\n  Signs means  + (plus sign) and  - (minus sign), so signed integers can be positive or negative (e.g. +8, -8). But unsigned integers can only be positive, because they do not have a sign.\n The signed integers are:  i8,  i16,  i32,  i64,  i128, and  isize.The unsigned integers are:  u8,  u16,  u32,  u64,  u128, and  usize.\n The number after the i or the u means the number of bits for the number, so numbers with more bits can be larger. 8 bits = one byte, so i8 is one byte, i64 is 8 bytes, and so on. Number types with larger sizes can hold larger numbers. For example, a u8 can hold up to 255, but a u16 can hold up to 65535. And a u128 can hold up to 340282366920938463463374607431768211455.\n So what is  isize and  usize? This means the number of bits on your type of computer. (This is called the  architecture of your computer.) So  isize and  usize on a 32-bit computer is like  i32 and  u32, and  isize and  usize on a 64-bit computer is like  i64 and  u64.\n There are many reasons for the different types of integers. One reason is computer performance: a smaller number of bytes is faster to process. But here are some other uses:\n Characters in Rust are called  char.  u8 numbers only go up to 255, and Unicode and ASCII use the same numbers for these numbers. This means that Rust can safely  cast a  u8 into a  char, using  as. (Cast  u8 as  char means &#34;pretend  u8 is a  char&#34;)\n Casting with  as is useful because Rust always needs to know the type of the integer. For example, this will not compile:\n fn  main() {  let my_number  =  100;  // We didn&#39;t write a type of integer,   // so Rust chooses i32. Rust always\t\t\t  // chooses i32 for integers if you don&#39;t\t\t\t  // tell it to use a different type  println!( &#34;{}&#34;, my_number  as  char);}\n  error[E0604]: only `u8` can be cast as `char`, not `i32` --&gt; src\\main.rs:3:20 |3 | println!(&#34;{}&#34;, my_number as char); | ^^^^^^^^^^^^^^^^^\n One easy way to fix this is with  as. First we use  as to make my_number a  u8, then one more  as to make it a  char. Now it will compile:\n    All chars are 4 bytes. They are 4 bytes because some characters in a string are more than one byte. For example:\n fn  main() {  let slice  =  &#34;Hello!&#34;;  println!( &#34;Slice is {:?} bytes.&#34;, std ::mem :: size_of_val(slice));  // std::mem::size_of_val gives the size in bytes  let slice2  =  &#34;안녕!&#34;;  // Korean for &#34;hi&#34;  println!( &#34;Slice2 is {:?} bytes.&#34;, std ::mem :: size_of_val(slice2));}\n slice is six characters in length and six bytes, but  slice2 is three characters in length and seven bytes.  char needs to fit any character in any language, so it is 4 bytes long.\n   Type inference means that if you don&#39;t tell the compiler the type, but it can decide by itself, it will decide. The compiler always needs to know the type of the variables, but you don’t always need to tell it. For example, for  let my_number = 8,  my_number will be an  i32. That is because the compiler chooses i32 for integers if you don&#39;t tell it. But if you say  let my_number: u8 = 8, it will make  my_number a  u8, because you told it  u8.\n So usually the compiler can guess. But sometimes you need to tell it, for two reasons:\n You are doing something very complex and the compiler doesn&#39;t know the type you want.\n   For numbers, you can say the type after the number. You don&#39;t need a space - just type it right after the number.\n  You can also add  _ if you want to make the number easy to read.\n fn  main() {  let small_number  =  10_u8;  // This is easier to read  let big_number  =  100_000_000_i32;  // 100 million is easy to read with _}\n The  _ does not change the number. It is only to make it easy for you to read. And it doesn&#39;t matter how many  _ you use:\n fn  main() {  let number  =  0________u8;  let number2  =  1___6______2____4______i32;  println!( &#34;{}, {}&#34;, number, number2);}\n   Floats are numbers with decimal points. 5.5 is a float, and 6 is an integer. 5.0 is also a float, and even 5. is a float.\n fn  main() {  let my_float  =  5.;  // Rust sees . and knows that it is a float}\n But the types are not called  float, they are called  f32 and  f64. It is the same as integers: the number after  f shows the number of bits. If you don&#39;t write the type, Rust will choose  f64.\n Of course, only floats of the same type can be used together. So you can&#39;t add an f32 to an f64.\n fn  main() {  let my_float:  f64  =  5.0;  // This is an f64  let my_other_float:  f32  =  8.5;  // This is an f32  let third_float  = my_float  + my_other_float;}\n  error[E0308]: mismatched types --&gt; src\\main.rs:5:34 |5 | let third_float = my_float + my_other_float; | ^^^^^^^^^^^^^^ expected `f64`, found `f32`\n The compiler writes &#39;&#39;&#39;expected (type), found (type)&#39;&#39;&#39; when you use the wrong type. It reads your code like this:\n let my_float:  f64  =  5.0;  // The compiler sees an f64 let my_other_float:  f32  =  8.5;  // The compiler sees an f32. It is a different type. let third_float  = my_float  +  // The compiler sees a new variable. It must be an f64 plus another f64. Now it expects an f64... let third_float  = my_float  + my_other_float;  // But it found an f32. It can&#39;t add them.\n So when you see &#34;expected (type), found (type)&#34;, you must find why the compiler expected a different type.\n Of course, with simple numbers it is easy to fix. You can cast the f32 to an f64 with  as:\n fn  main() {  let my_float:  f64  =  5.0;  let my_other_float:  f32  =  8.5;  let third_float  = my_float  + my_other_float  as  f64;  // my_other_float as f64 = use my_other_float like an f64}\n Or even more simply, remove the type declarations. Rust will choose types that can add together.\n fn  main() {  let my_float  =  5.0;  // Rust will choose f64  let my_other_float  =  8.5;  // Here again it will choose f64  let third_float  = my_float  + my_other_float;}\n  fn  main() {  let my_float:  f32  =  5.0;  let my_other_float  =  8.5;  // Rust will choose f32,  let third_float  = my_float  + my_other_float;  // because it knows you need to add it to an f32}\n      println! is a  macro that prints to the console. A  macro is like a function that writes code for you. Macros have a  ! after them. We will learn about making macros later. For now, remember that  ! means that it is a macro.\n To learn about the  ;, we will create another function. First, in  main we will print a number 8:\n  The  {} in  println! means &#34;put the variable inside here&#34;. This prints  Hello world number 8.\n      This also prints  Hello, world number 8!. When Rust looks at  number() it sees a function. This function:\n  Inside the function is just  8. Because there is no  ;, this is the value it returns. If it had a  ;, it would not return anything. Rust will not compile this if it has a  ;, because the return is  i32 and  ; returns  (), not  i32:\n  5  |  fn  number() -&gt;  i32 {  |  ------  ^^^ expected ` i32`, found `()`  |  |  | implicitly returns `()`  as its body has no tail or ` return` expression 6  |  8;  |  - help: consider removing this semicolon\n This means &#34;you told me that  number() returns an  i32, but you added a  ; so it doesn&#39;t return anything&#34;. So the compiler suggests removing the semicolon.\n You can also write  return 8; but in Rust it is normal to just remove the  ; to  return.\n When you want to give variables to a function, put them inside the  (). You have to give them a name and write the type.\n fn  main() {  multiply( 8,  9);  // We can give the numbers directly  let some_number  =  10;  // Or we can declare two variables  let some_other_number  =  2;  multiply(some_number, some_other_number);  // and put them in the function} fn  multiply(number_one:  i32, number_two:  i32) {  // Two i32s will enter the function. We will call them number_one and number_two.  let result  = number_one  * number_two;  println!( &#34;{} times {} is {}&#34;, number_one, number_two, result);}\n  fn  main() {  let multiply_result  =  multiply( 8,  9);  // We used multiply() to print and to give the result to multiply_result} fn  multiply(number_one:  i32, number_two:  i32) -&gt;  i32 {  let result  = number_one  * number_two;  println!( &#34;{} times {} is {}&#34;, number_one, number_two, result); result  // this is the i32 that we return}\n  Use  let to declare a variable (declare a variable = tell Rust to make a variable).\n  Variables start and end inside a code block  {}. In this example,  my_number ends before we call  println!, because it is inside its own code block.\n fn  main() { {  let my_number  =  8;  // my_number starts here  // my_number ends here! }  println!( &#34;Hello, number {}&#34;, my_number);  // there is no my_number and  // println!() can&#39;t find it}\n  fn  main() {  let my_number  = {\t let second_number  =  8; second_number  +  9  // No semicolon, so the code block returns 8 + 9.\t  // It works just like a function };  println!( &#34;My number is: {}&#34;, my_number);}\n  fn  main() {  let my_number  = {\t let second_number  =  8;  // declare second_number, second_number  +  9;  // add 9 to second_number\t\t  // but we didn&#39;t return it!  // second_number dies now };  println!( &#34;My number is: {:?}&#34;, my_number);  // my_number is ()}\n So why did we write  {:?} and not  {}? We will talk about that now.\n  Simple variables in Rust can be printed with  {} inside  println!(). But some variables can&#39;t, and you need to  debug print. Debug print is printing for the programmer, because it usually shows more information. Debug sometimes doesn&#39;t look pretty, because it has extra information to help you.\n How do you know if you need  {:?} and not  {}? The compiler will tell you. For example:\n   error[E0277]: `()` doesn&#39;t implement `std::fmt::Display` --&gt; src\\main.rs:3:41 |3 | println!(&#34;This will not print: {}&#34;, doesnt_print); | ^^^^^^^^^^^^ `()` cannot be formatted with the default formatter | = help: the trait `std::fmt::Display` is not implemented for `()` = note: in format strings you may be able to use `{:?}` (or {:#?} for pretty-print) instead = note: required by `std::fmt::Display::fmt` = note: this error originates in a macro (in Nightly builds, run with -Z macro-backtrace for more info)\n This is a lot of information. But the important part is:  you may be able to use `{:?}` (or {:#?} for pretty-print) instead. This means that you can try  {:?}, and also  {:#?} ( {:#?} prints with different formatting).\n  One more thing: you can also use print!() without  ln if you don&#39;t want a new line.\n fn  main() {  print!( &#34;This will not print a new line&#34;);  println!( &#34; so this will be on the same line&#34;);}\n This prints  This will not print a new line so this will be on the same line.\n  If you want to see the smallest and biggest numbers, you can use MIN and MAX.\n fn  main() {  println!( &#34;The smallest i8 is {} and the biggest i8 is {}.&#34;, std :: i8 ::MIN, std :: i8 ::MAX);  println!( &#34;The smallest u8 is {} and the biggest u8 is {}.&#34;, std :: u8 ::MIN, std :: u8 ::MAX);  println!( &#34;The smallest i16 is {} and the biggest i16 is {}.&#34;, std :: i16 ::MIN, std :: i16 ::MAX);  println!( &#34;The smallest u16 is {} and the biggest u16 is {}.&#34;, std :: u16 ::MIN, std :: u16 ::MAX);  println!( &#34;The smallest i32 is {} and the biggest i32 is {}.&#34;, std :: i32 ::MIN, std :: i32 ::MAX);  println!( &#34;The smallest u32 is {} and the biggest u32 is {}.&#34;, std :: u32 ::MIN, std :: u32 ::MAX);  println!( &#34;The smallest i64 is {} and the biggest i64 is {}.&#34;, std :: i64 ::MIN, std :: i64 ::MAX);  println!( &#34;The smallest u64 is {} and the biggest u64 is {}.&#34;, std :: u64 ::MIN, std :: u64 ::MAX);  println!( &#34;The smallest i128 is {} and the biggest i128 is {}.&#34;, std :: i128 ::MIN, std :: i128 ::MAX);  println!( &#34;The smallest u128 is {} and the biggest u128 is {}.&#34;, std :: u128 ::MIN, std :: u128 ::MAX);}\n  The smallest  i8 is  - 128 and the biggest  i8 is  127.The smallest  u8 is  0 and the biggest  u8 is  255.The smallest  i16 is  - 32768 and the biggest  i16 is  32767.The smallest  u16 is  0 and the biggest  u16 is  65535.The smallest  i32 is  - 2147483648 and the biggest  i32 is  2147483647.The smallest  u32 is  0 and the biggest  u32 is  4294967295.The smallest  i64 is  - 9223372036854775808 and the biggest  i64 is  9223372036854775807.The smallest  u64 is  0 and the biggest  u64 is  18446744073709551615.The smallest  i128 is  - 170141183460469231731687303715884105728 and the biggest  i128 is  170141183460469231731687303715884105727. The smallest  u128 is  0 and the biggest  u128 is  340282366920938463463374607431768211455.\n     The compiler says:  error[E0384]: cannot assign twice to immutable variable `my_number. This is because variables are immutable if you only write  let.\n      You will see the same &#34;expected&#34; message from the compiler:  expected integer, found `&amp;str````. &amp;str``` is a string type that we will learn soon.\n  Shadowing means using  let to declare a new variable with the same name as another variable. It looks like mutability, but it is completely different. Shadowing looks like this:\n fn  main() {  let my_number  =  8;  // This is an i32  println!( &#34;{}&#34;, my_number);  // prints 8  let my_number  =  9.2;  // This is an f64. It is not my_number - it is completely different!  println!( &#34;{}&#34;, my_number)  // Prints 9.2}\n  So is the first  my_number destroyed? No, but when we call  my_number we now get  my_number the  f64. And because they are in the same scope block, we can&#39;t see the first  my_number anymore.\n   fn  main() {  let my_number  =  8;  // This is an i32  println!( &#34;{}&#34;, my_number);  // prints 8 {  let my_number  =  9.2;  // This is an f64. It is not my_number - it is completely different!  println!( &#34;{}&#34;, my_number)  // Prints 9.2  // But the shadowed my_number only lives until here.  // The first my_number is still alive! }  println!( &#34;{}&#34;, my_number);  // prints 8}\n So what is the advantage of shadowing? Shadowing is good when you need to change a variable a lot.\n fn  main() {  let final_number  = {  let y  =  10;  let x  =  9;  // x starts at 9  let x  =  times_two(x);  // shadow with new x: 18  let x  = x  + y;  // shadow with new x: 28 x  // return x: final_number is now the value of x };  println!( &#34;The number is now: {}&#34;, final_number)} fn  times_two(number:  i32) -&gt;  i32 { number  *  2}\n Without shadowing you would have to think of different names, even though you don&#39;t care about x:\n fn  main() {\t // Pretending we are using Rust without shadowing  let final_number  = {  let y  =  10;  let x  =  9;  // x starts at 9  let x_twice  =  times_two(x);  // second name for x  let x_twice_and_y  = x  + y;  // third name for x x_twice_and_y  // too bad we didn&#39;t have shadowing - we could have just used x };  println!( &#34;The number is now: {}&#34;, final_number)} fn  times_two(number:  i32) -&gt;  i32 { number  *  2}\n   The stack and the heap are two places to keep memory. The important differences are:\n The stack needs to know the size of a variable at compile time. So simple variables like i32 go on the stack, because we know their exact size.\n Some types don&#39;t know the size at compile time. But the stack needs to know the exact size. What do you do? You put the data in the heap, because the heap can have any size of data. And to find it, a pointer goes on the stack, because we always know the size of a pointer.\n  MY BOOKChapter PageChapter 1: My life 1Chapter 2: My cat 15Chapter 3: My job 23Chapter 4: My family 30Chapter 5: Future plans 43\n So this is like five pointers. Where is the chapter &#34;My life&#34;? It&#39;s on page 1 (it points to page 1). Where is the chapter &#34;My job?&#34; It&#39;s on page 23.\n A pointer in Rust is usually called a  reference. A reference means you  borrow the value, but you don&#39;t own it. In Rust, references have a  &amp;. So:\n  This means that  my_reference is only looking at the data of  my_variable.  my_variable still owns its data.\n  We know that  println! can print with  {} (for Display) and  {:?} (for Debug), plus  {:#?} for pretty printing. But there are many other ways to print.\n For example, if you have a reference, you can use {:p} to print the pointer address.\n    fn  main() {  let number  =  555;  println!( &#34;Binary: {:b}, hexadecimal: {:x}, octal: {:o}&#34;, number, number, number);}\n  fn  main() {  let father_name  =  &#34;Vlad&#34;;  let son_name  =  &#34;Adrian Fahrenheit&#34;;  let family_name  =  &#34;Țepeș&#34;;  println!( &#34;This is {1} {2}, son of {0} {2}.&#34;, father_name, son_name, family_name);}\n father_name is in position 0,  son_name is in position 1, and  family_name is in position 2. So it prints  This is Adrian Fahrenheit Țepeș, son of Vlad Țepeș.\n Maybe you have a very complex string to print and want to add names to the  {}. You can do that:\n fn  main() {  println!( &#34;{city1} is in {country} and {city2} is also in {country}, but {city3} is not in {country}.&#34;, city1  =  &#34;Seoul&#34;, city2  =  &#34;Busan&#34;, city3  =  &#34;Tokyo&#34;, country  =  &#34;Korea&#34;);}\n Very complex printing is not used too much in Rust. But here is how to do it.\n   For example, if I want to write &#34;a&#34; with five ㅎ characters on the left and five ㅎ characters on the right:\n  This prints  ㅎㅎㅎㅎㅎaㅎㅎㅎㅎㅎ. Let&#39;s look at 1) to 5) for this.\n Do you want a variable name?  {:ㅎ^11} No variable name: it comes before  :.\n Do you want a padding character?  {:ㅎ^11} Yes. ㅎ comes after the  : and has a  ^.  &lt; means padding with the character on the left,  &gt; means on the right, and  ^ means in the middle.\n Do you want a minimum length?  {:ㅎ^11} Yes: there is an 11 after.\n Do you want a maximum length?  {:ㅎ^11} No: there is no number with a  . before.\n  fn  main() {  let title  =  &#34;TODAY&#39;S NEWS&#34;;  println!( &#34;{:-^30}&#34;, title);  // no variable name, pad with -, put in centre, 30 characters long  let bar  =  &#34;|&#34;;  println!( &#34;{: &lt;15}{: &gt;15}&#34;, bar, bar);  // no variable name, pad with space, 15 characters each, one to the left, one to the right  let a  =  &#34;SEOUL&#34;;  let b  =  &#34;TOKYO&#34;;  println!( &#34;{city1:-&lt;15}{city2:-&gt;15}&#34;, city1  = a, city2  = b);  // variable names city1 and city2, pad with -, one to the left, one to the right}\n     &amp;str is a simple string. When you write  let my_variable = &#34;Hello, world!&#34;, you create a  &amp;str. A  &amp;str is very fast.\n String is a more complicated string. It is a bit slower, and has more functions. A  String is a pointer, with data on the heap.\n  fn  main() {  let name  =  &#34;서태지&#34;;  // This is a Korean name. No problem, because a &amp;str is UTF-8.  let oth\n......", "posttime": "2020-07-23 14:29:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,解释,explained,number", "title": "用简单的英语解释生锈", "title_en": "Rust Explained in Simple English", "transed": 1, "url": "https://github.com/Dhghomon/easy_rust", "via": "", "real_tags": ["rust", "解释", "explained", "number"]}, {"category": "", "categoryclass": "", "imagename": "5857b7a143d0955ec847e30d3b66c940.jpg", "infoid": 1013694, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“哈尔科夫昌卡”-俄罗斯的巨型南极巡洋舰，它已经连续在地球上一些最极端的环境中运行了超过...", "note_en": "\"The Kharkovchanka\" - Russia's Colossal Antarctic Cruisers which have been continuously operating in some of the most extreme environments on Earth for over ...", "posttime": "2020-07-23 14:23:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苏联,巡洋舰,colossal,环境中运行", "title": "“哈尔科夫昌卡”--苏联巨型南极巡洋舰[视频]", "title_en": "“Kharkovchanka” – The Colossal Soviet Antarctic Cruisers [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=f6R-h06IsJw", "via": "", "real_tags": ["苏联", "巡洋舰", "colossal", "环境中运行"]}]