[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1072810, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "拥有公司一小部分股份，并有权要求获得公司股份#39；公司的资产和利润等于持有的股票数量\n美国上市证券公司总部设在美国\n将一家公司的价格乘以#39；s股票的流通股总数。\n当前股价与12个月后每股收益的比率，表明股价与其他股票相比是高还是低\n估计股票股息回报率的年度股息与当前股价的比率", "note_en": "Stock Ownership of a fraction of a corporation and the right to claim a share of the corporation&#39;s assets and profits equal to the amount of stock owned\n    US listed security     US headquartered\n    A valuation method that multiplies the price of a company&#39;s stock by the total number of outstanding shares.\n  The ratio of current share price to trailing twelve month EPS that signals if the price is high or low compared to other stocks\n The ratio of annual dividend to current share price that estimates the dividend return of a stock", "posttime": "2022-02-13 09:44:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,ipo,twitter,股票", "title": "推特自2013年IPO以来下跌了10.4%", "title_en": "Twitter is down 10.4% since IPO in 2013", "transed": 1, "url": "https://www.google.com/finance/quote/TWTR:NYSE", "via": "", "real_tags": ["推特", "ipo", "twitter", "股票"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072809, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "更新：CNIL决定欧盟-美国向谷歌分析传输数据是非法的，并命令控制器遵守GDPR\n就在奥地利数据保护局做出突破性决定，持续使用谷歌分析违反GDPR两周后，法国数据保护局（CNIL）遵循这一决定，命令一家法国网站遵守GDPR。这两项决定都基于noyb&#39；这是在法院裁定隐私保护无效后提出的101项典型投诉。noyb预计其他当局也会做出类似的决定\n欧盟2020年的裁决触及了现实世界。2020年7月，中欧联合会发布了开创性的#34；施雷姆斯二世&#34；裁定，认为根据FISA 702和EO 12.333向美国供应商传输数据违反了GDPR中的国际数据传输规则。CJEU因此取消了该转让协议#34；隐私保护&#34；，取消之前的交易后&#34；安全港&#34；2015年。虽然这给科技行业带来了冲击波，但美国供应商和欧盟数据出口商基本上忽视了这一点。就像微软、Facebook或亚马逊一样，谷歌也依赖于所谓的&#34；标准合同条款&#34；继续数据传输，安抚欧洲商业伙伴。\n麦克斯·施雷姆斯，noyb荣誉主席。欧盟：34；它&#39；有趣的是，不同的欧洲数据保护机构都得出了相同的结论：使用谷歌分析是非法的。欧洲有一个特别工作组，我们认为这一行动是协调的，其他当局也会做出类似的决定&#34;\n这项决定几乎适用于所有欧盟网站。谷歌分析是最常见的统计程序。虽然有许多替代方案在欧洲托管或可以自托管，但许多网站依赖谷歌，从而将其用户数据转发给美国跨国公司。数据保护机构现在可能会逐渐宣布美国服务为非法，这一事实给欧盟公司和美国供应商带来了额外的压力，迫使他们转向安全和合法的选择，比如在美国境外托管服务。\n长期解决方案。从长远来看，似乎有两种选择：要么美国调整对外国人的基线保护，以支持其技术产业，要么美国供应商将不得不在美国境外托管外国数据。\n马克斯·施雷姆斯：&#34；从长远来看，我们要么在美国需要适当的保护，要么最终为美国和欧盟提供单独的产品。我个人更希望在美国得到更好的保护，但这取决于美国立法者，而不是欧洲的任何人&#34;\n美国互联网上最新的信息是什么。\nDerösterreichische Datenschutzaktivist和法学家马克斯·施雷姆斯（Max Schrems）将与einstweiligen合作，与DPC zwingen、欧盟-美国Datentressfers von Facebook和anderen Firmen zu stoppen合作。施雷姆斯和塞恩·达滕舒茨是麻省理工学院的一名教师，他是西切斯特伦学院的学生，也是该学院的学生。\n行动主义者马克斯·施雷姆斯·克拉格特在一篇简短的欧盟日期简报中写道，欧盟的日期是由爱尔兰的日期决定的。在欧罗巴的Datenschutz的Nadelöhr für den Datenschutz的DSGVO中，他是一位非常出色的球员。\n隐私活动人士马克斯·施雷姆斯呼吁欧洲当局推动爱尔兰监管机构加快处理他在引入旨在帮助保护消费者数据的规则两周年之际对Facebook提起的诉讼。施雷姆斯长期以来一直是Facebook的眼中钉，他哀叹自2018年在欧洲引入通用数据保护监管（GDPR）制度以来缺乏进展。\n马克斯·施雷姆斯（Max Schrems）的集团Noyb在周一的一封公开信中呼吁欧盟当局对爱尔兰数据保护委员会（Irish Data Protection Commission）采取“行动”。爱尔兰数据保护委员会（Irish Data Protection Commission）在严格的欧盟规则授权监管机构对严重侵犯隐私的行为处以重罚整整两年后，尚未发布任何重大罚款。", "note_en": "UPDATE: CNIL decides EU-US data transfer to Google Analytics illegal and orders controller to comply with GDPR\n Only two weeks after the      groundbreaking decision by the Austrian Data Protection Authority that the continuous use of Google Analytics violates the GDPR, the French Data Protection Authority (CNIL) follows this decision and orders a French website to comply with the GDPR. Both decisions are based on  noyb&#39;s  101 model complaints which were filed after the Court of Justice ruling invalidating Privacy Shield. noyb expects similar decisions by the other authorities\n  2020 CJEU ruling hits the real world. In July 2020, the CJEU has issued its groundbreaking &#34;Schrems II&#34; ruling, holding that a transfer to US providers that fall under FISA 702 and EO 12.333 violate the rules on international data transfers in the GDPR. The CJEU consequently annulled the transfer deal &#34;Privacy Shield&#34;, after annulling the previous deal &#34;Safe Harbor&#34; in 2015. While this sent shock waves through the tech industry, US providers and EU data exporters have largely ignored the case. Just like Microsoft, Facebook or Amazon, Google has relied on so-called &#34;Standard Contract Clauses&#34; to continue data transfers and calm its European business partners.\n Max Schrems, honorary chair of  noyb.eu: &#34; It&#39;s interesting to see that the different European Data Protection Authorities all come to the same conclusion: the use of Google Analytics is illegal. There is a European task force and we assume that this action is coordinated and other authorities will decide similarily.&#34;\n Decision relevant for almost all EU websites. Google Analytics is the most common statistics program. While there are many alternatives that are hosted in Europe or can be self-hosted, many websites rely on Google and thereby forward their user data to the US multinational. The fact that data protection authorities may now gradually declare US services illegal, puts additional pressure on EU companies and US providers to move towards safe and legal options, like hosting outside of the US.\n Long Term Solution. In the long run, there seem to be two options: Either the US adapts baseline protections for foreigners to support their tech industry, or US providers will have to host foreign data outside of the United States.\n Max Schrems: &#34; In the long run we either need proper protections in the US, or we will end up with separate products for the US and the EU. I would personally prefer better protections in the US, but this is up to the US legislator - not to anyone in Europe.&#34;\n  Auch nach dem EuGH-Urteil zum Datenschutz liefern Internetkonzerne weiter Nutzer-Informationen in die USA. Alan Dahi hat ihnen den Kampf angesagt.\n  Der österreichische Datenschutzaktivist und Jurist Max Schrems will mit einer einstweiligen Verfügung die irische Datenschutzbehörde DPC zwingen, die EU-US-Datentransfers von Facebook und anderen Firmen zu stoppen. Schrems und sein Datenschutz-Verein noyb teilten am Donnerstag mit, dies solle sicherstellen, dass die DPC hinsichtlich aller rechtlichen Grundlagen für Datenübermittlungen tätig werde.\n  Der Aktivist Max Schrems klagt in einem offenen Brief an die EU-Datenschutzbehörden über die Arbeit der irischen Datenschutzaufsicht. Diese sei im dritten Jahr der DSGVO ein Nadelöhr für den Datenschutz in Europa.\n  Privacy activist Max Schrems called on the European authorities to push the Irish regulator to speed up its handling of cases he has brought against Facebook on the second anniversary of the introduction of rules designed to help protect the data of consumers. Schrems, long a thorn in the side of Facebook, bemoaned the lack of progress since the introduction of the General Data Protection Regulation (GDPR) regime across Europe in 2018.\n  Max Schrems’s group Noyb in an  open letter on Monday called on European Union authorities to “take action” against the Irish Data Protection Commission, which has yet to issue any significant fines exactly two years after strict EU rules empowered the regulator to levy hefty penalties for serious privacy violations.", "posttime": "2022-02-13 09:42:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,谷歌,google,法国,france", "title": "CNIL（法国）裁定欧盟-美国向谷歌分析传输数据是非法的", "title_en": "CNIL (France) decides EU-US data transfer to Google Analytics illegal", "transed": 1, "url": "https://noyb.eu/en/update-cnil-decides-eu-us-data-transfer-google-analytics-illegal", "via": "", "real_tags": ["美国", "谷歌", "google", "法国", "france"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072808, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Firefox浏览器的所有者和开发者Mozilla多年来多次攻击Facebook（现在是Meta），因为该公司在隐私和安全方面的灾难性记录。然而，这两家公司目前正在合作制定一项略为私人化的在线广告提案，该提案已经招致Mozilla长期粉丝的批评。\nMozilla在周二的一篇博文中透露，“过去几个月，我们一直在与Meta（前Facebook）的一个团队合作，制定一项新提案，旨在为名为“可互操作私人归因”（Interoperable Private attribution，简称IPA）的广告启用转换度量或归因。”该项目旨在让广告商衡量在线广告的成功率，同时比现有的在线广告更尊重隐私。\n正如提案草案中所解释的那样，核心概念是用批量事件的聚合报告取代按行动的广告报告（例如，当你点击广告时，浏览器向广告组发送数据）。网站可以创建一个连接到您的帐户或设备的“匹配密钥”，显然只有通过浏览器才能访问该密钥，以避免指纹识别。此外，还有一些功能旨在让任何人（包括收集数据的公司或广告商）难以识别与广告互动的人。这与Prio类似，Prio是Mozilla几年前开发的一种分析人们如何使用Firefox的技术。\n尽管这个提议看起来很可靠，但这种合作关系还是相当令人惊讶的。Mozilla上个月刚刚开始与Markup合作进行一项试验性研究，旨在确定Meta/Facebook是如何通过追踪网络上的像素来记录网络活动的。Mozilla表示，这项研究的目的是“报告Facebook在哪里跟踪你，以及他们在收集什么样的信息。”在最近的历史中，该组织还多次与Facebook对抗，不到一年前，该组织开始在Meta的平台上发布广告，展示该公司令人毛骨悚然的广告定位能力。\n与该公司发布的几乎所有其他文章不同，Firefox或Mozilla的官方Twitter账户上没有分享这篇博文。到目前为止，批评是有限的，可能是因为低调的声明（例如，它只出现在周五的Firefox subreddit上），但目前总体反馈大多是负面的。\nMeta/Mozilla working doc中关于广告属性差异隐私的讨论非常有趣👀\n在评论中，@robinberjon与💯 引用：“我们今天并不是没有噪音，我们只是假装没有。”🙃 https://t.co/s9v1WL9AVw\nMozilla和Meta/Facebook还必须鼓励苹果和谷歌（至少）在他们自己的浏览器中实现这种行为，这可能是一个艰难的销售。谷歌也在试验一项提议，用一种更尊重隐私的替代方案取代浏览器cookie，但该项目的目标与IPA不同，理论上谷歌可以同时实现这两个目标。", "note_en": "Mozilla, owner and developer of the Firefox browser, has attacked Facebook (now Meta) many times over the years for the company’s disastrous record on privacy and security. However, the two companies are now working together on a proposal for slightly more private online advertising, which is already drawing criticism from long-time fans of Mozilla.\n Mozilla revealed in  a blog post on Tuesday, “For the last few months we have been working with a team from Meta (formerly Facebook) on a new proposal that aims to enable conversion measurement – or attribution – for advertising called Interoperable Private Attribution, or IPA.” The project aims to allow advertisers to measure the success rate of online ads, while being more privacy-respecting than existing online ads.\n The core concept, as explained in the  proposal draft, is to replace per-action ad reporting (e.g. the browser sending data to an advertising group when you click on an ad) with aggregated reports for batches of events. Websites can create a “match key” connected to your account or device, which is apparently only accessible by the browser to avoid fingerprinting. There are also a few functions in place intended to make it difficult for anyone (including the companies or advertisers collecting data) to identify people interacting with ads. It’s similar to  Prio, the technology Mozilla developed a few years ago to analyze how people use Firefox.\n  Even though the proposal seems solid, the partnership is rather surprising. Mozilla just began  a trial study last month in partnership with  The Markup that aimed to identify how Meta/Facebook was using tracking pixels across the web to record web activity. Mozilla said the goal of the study was to “report on where Facebook is tracking you and what kind of information they are collecting.” The group has also rallied against Facebook many times in recent history, and less than a year ago,  started publishing ads on Meta’s platforms that called out the company’s creepy ad targeting abilities.\n The blog post has  not been shared on the official Twitter accounts for Firefox or Mozilla, unlike nearly every other article the company publishes. Criticism has been limited so far, possible due to the low-key announcement (it only  appeared on the Firefox subreddit on Friday, for example), but overall feedback at the moment is mostly negative.\n    Very interesting discussion of differential privacy for ad attribution in the Meta/Mozilla working doc 👀\n In the comments,  @robinberjon with the 💯 quote: “It’s not like we don’t have noise today, we just pretend that we don’t.” 🙃 https://t.co/s9v1WL9AVw\n  Mozilla and Meta/Facebook would also have to encourage Apple and Google (at a minimum) to implement this behavior in their own browsers, which might be a tough sell. Google is also experimenting with  a proposal to replace browser cookies with a more privacy-respecting alternative, but that project doesn’t have the same goals as IPA, and Google could theoretically implement both at the same time.", "posttime": "2022-02-13 09:40:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,meta", "title": "Mozilla和Meta（FB）正在合作制作“隐私”广告", "title_en": "Mozilla and Meta (FB) are working together on “privacy” ads", "transed": 1, "url": "https://www.xda-developers.com/mozilla-meta-interoperable-private-attribution/", "via": "", "real_tags": ["广告", "meta"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072807, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌分析提供网站流量的统计数据。在收到NOYB协会的投诉后，CNIL与其欧洲同行合作，分析了通过该服务收集的数据传输到美国的条件。CNIL认为这些转移是非法的，并命令法国网站经理遵守GDPR，如有必要，在当前条件下停止使用该服务。\n谷歌分析（Google Analytics）是一项服务，可以通过在线销售网站等网站进行整合，以衡量互联网用户的访问量。在这种情况下，会为每个访问者分配一个唯一的标识符。该标识符（构成个人数据）和相关数据由谷歌传输到美国。\nCNIL收到了NOYB协会的几项投诉，涉及将使用谷歌分析访问网站期间收集的数据转移到美国。NOYB在27个欧盟成员国和其他三个欧洲经济区（EEA）国家总共提出了101项投诉，指控101名数据控制员涉嫌向美国传输个人数据。\nCNIL与欧洲同行合作，分析了通过谷歌分析收集的数据转移到美国的条件，以及相关个人所面临的风险。目的是集体得出&#34；施雷姆斯二世&#34；欧盟法院2020年7月16日判决隐私保护无效。CJEU强调了美国情报机构可能会在未得到适当监管的情况下获取传输到美国的个人数据的风险。\nCNIL的结论是，向美国的转移目前没有得到充分的监管。事实上，在没有关于向美国传输数据的充分性决定（该决定将确定该国在GDPR方面提供足够水平的数据保护）的情况下，数据传输只能在为这种数据流提供适当保证的情况下进行。\n然而，CNIL发现情况并非如此。事实上，尽管谷歌在谷歌分析功能的背景下采取了其他措施来监管数据传输，但这些措施不足以排除美国情报机构获取这些数据的可能性。\n因此，使用该服务并将其数据导出的法国网站用户存在风险。\nCNIL指出，互联网用户的数据因此被转移到美国，违反了第44条及以下条款。GDPR的一部分。因此，CNIL命令网站经理在必要时停止使用谷歌分析功能（在当前条件下）或使用不涉及欧盟境外转移的工具，使该处理符合GDPR。该网站运营商有一个月的时间来遵守。\n关于网站受众测量和分析服务，CNIL建议，这些工具只能用于生成匿名统计数据，因此，如果数据控制员确保不存在非法传输，则可以免除同意。CNIL启动了一项评估计划，以确定哪些解决方案不需要获得同意。\nCNIL及其对等机构的调查还涉及导致欧洲互联网用户数据传输到美国的网站使用的其他工具。在不久的将来可能会采取这方面的纠正措施。", "note_en": "Google Analytics provides statistics on website traffic. After receiving complaints from the NOYB association, the CNIL, in cooperation with its European counterparts, analysed the conditions under which the data collected through this service is transferred to the United States. The CNIL considers that these transfers are illegal and orders a French website manager to comply with the GDPR and, if necessary, to stop using this service under the current conditions.\n  Google Analytics is a service that can be integrated by websites such as online sale sites in order to measure the number of visits by Internet users. In this context, a unique identifier is assigned to each visitor. This identifier (which constitutes personal data) and the associated data are transferred by Google to the United States.\n The CNIL received several complaints from the NOYB association concerning the transfer to the United States of data collected during visits to websites using Google Analytics. In total, 101 complaints were filed by NOYB in the 27 EU Member States and the three other European Economic Area (EEA) states against 101 data controllers allegedly transferring personal data to the US.\n  The CNIL, in cooperation with its European counterparts, analysed the conditions under which data collected through the use of Google Analytics was transferred to the United States and the risks incurred for the individuals concerned. The aim is to collectively draw the consequences of the &#34;Schrems II&#34; judgment of the Court of Justice of the European Union of 16 July 2020, which invalidated the Privacy Shield. The CJEU had highlighted the risk that American intelligence services would access personal data transferred to the United States if the transfers were not properly regulated.\n  The CNIL concludes that transfers to the United States are currently not sufficiently regulated. Indeed, in the absence of an adequacy decision (which would establish that this country offers a sufficient level of data protection with regard to the GDPR) concerning transfers to the United States, the transfer of data can only take place if appropriate guarantees are provided for this flow in particular.\n However, the CNIL found that this was not the case. Indeed, although Google has adopted additional measures to regulate data transfers in the context of the Google Analytics functionality, these are not sufficient to exclude the accessibility of this data for US intelligence services.\n There is therefore a risk for French website users who use this service and whose data is exported.\n The CNIL notes that the data of Internet users is thus transferred to the United States in violation of Articles 44 et seq. of the GDPR. The CNIL therefore ordered to the website manager to bring this processing into compliance with the GDPR, if necessary by ceasing to use the Google Analytics functionality (under the current conditions) or by using a tool that does not involve a transfer outside the EU. The website operator in question has one month to comply.\n Regarding website audience measurement and analysis services, the CNIL recommends that these tools should only be used to produce anonymous statistical data, thus allowing for an exemption from consent if the data controller ensures that there are no illegal transfers. The CNIL has launched an evaluation programme to determine which solutions are exempt from consent.\n  The investigation by the CNIL and its counterparts also extends to other tools used by sites that result in the transfer of data of European Internet users to the United States. Corrective measures in this respect may be adopted in the near future.", "posttime": "2022-02-13 09:38:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,法国,analytics,美国", "title": "使用被法国数据保护局宣布为非法的谷歌分析", "title_en": "Use of Google Analytics declared illegal by French data protection authority", "transed": 1, "url": "https://www.cnil.fr/en/use-google-analytics-and-data-transfers-united-states-cnil-orders-website-manageroperator-comply", "via": "", "real_tags": ["谷歌", "google", "法国", "analytics", "美国"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072806, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌的零日安全研究小组透露，2021的Project Noice报告的安全漏洞平均比28快了28天。\n去年，硬件和软件供应商修复安全漏洞的平均时间为52天，远低于90天的截止日期，而两年前的平均时间为80天。\n只有一个bug超过了修复期限，尽管14%的bug需要额外的14天宽限期才能发布有效的修复。\nProject Zero的Ryan Schoen在一篇博客文章中说：“我们怀疑，这一趋势可能是因为负责任的披露政策已成为该行业事实上的标准，供应商更有能力对不同截止日期的报告做出快速反应。”。\n“我们还怀疑，随着行业透明度的提高，供应商已经相互学习了最佳实践。”\n然而，Schoen警告称，Project Zero报告可能是异常值，“因为它们可能会收到更快的行动，因为存在公开披露的有形风险（如果不满足截止日期条件，团队将予以披露），并且Project Zero是可靠缺陷报告的可靠来源”。\n在2019, 2020和2021年间，Project Neo在其标准的90天补救期限内向供应商报告了376个问题，其中351个（93.4%）是固定的，而供应商拒绝修复14（3.7%）个bug。\n在25天时，Linux的平均修复时间最快，其次是谷歌（44天）和Mozilla（46天）。最慢的是甲骨文（109个），但只有七个漏洞，其次是微软（83个）和三星（72个）。\n在三大领先的开源浏览器中，Chrome从收到错误报告到向用户发送修复程序的时间间隔最短，为30天，其次是Firefox（38天）和Safari（73天）。\nProject Zero赞扬了谷歌的快速发布周期和额外的安全更新稳定版本，以及Chrome最近从六周的发布周期改为四周的发布周期。\nSchoen警告称，苹果因更快地推出修补程序而广受赞誉，但因在登陆WebKit修补程序和将其发送给用户之间间隔太长而受到批评，这“给机会主义攻击者留下了很长的时间，让他们在修补程序提供给用户之前找到修补程序并加以利用”。\n微软在补丁方面的相对缓慢被归咎于其“补丁周二”更新的“每月节奏”。\n谷歌还宣布，它在2021的安全漏洞奖励计划（VRPS）中支付了破纪录的870万美元给安全研究人员。\nChrome VRP不仅涉及谷歌Chrome的安全性，还涉及其他几种基于Chrome的浏览器的安全性，它为333个漏洞报告提供了330万美元的赔偿，其中最大的一笔赔偿是为Chrome操作系统漏洞提供了45000美元的赔偿。\nAndroid VRP支付了近300万美元，是2020年奖励总额的两倍，其中包括单个漏洞链的15.7万美元——这是Android有史以来最高的奖励。", "note_en": "Security vulnerabilities reported by Project Zero in 2021 were patched 28 days faster on average than in 2019, Google’s  zero-day security research team has revealed.\n Hardware and software vendors took an average of 52 days to fix security flaws last year, well below the 90-day deadline and down from the mean time average of 80 days two years prior.\n Only one bug exceeded its fix deadline, although 14% required the additional 14-day grace period before a working fix was released.\n  “We suspect that this trend may be due to the fact that responsible disclosure policies have become the de-facto standard in the industry, and vendors are more equipped to react rapidly to reports with differing deadlines,” said Ryan Schoen of Project Zero in a  blog post.\n “We also suspect that vendors have learned best practices from each other, as there has been increasing transparency in the industry.”\n    However, Schoen cautioned that Project Zero reports may be outliers “in that they may receive faster action as there is a tangible risk of public disclosure (as the team will disclose if deadline conditions are not met) and Project Zero is a trusted source of reliable bug reports”.\n Across 2019, 2020, and 2021, Project Zero reported 376 issues to vendors under its standard 90-day remediation deadline, 351 (93.4%) of which were fixed, while vendors declined to fix 14 (3.7%) bugs.\n At 25 days, Linux had the quickest average time to a fix, followed by Google (44) and  Mozilla (46). The slowest was Oracle (109) but from a small sample of seven bugs, followed by Microsoft (83) and Samsung (72).\n  Among the three leading open-source  browsers – data being unavailable for their proprietary rivals – Chrome had the shortest gap between receiving bug reports to shipping fixes to users – 30 days – followed by Firefox (38 days) and Safari (73).\n Project Zero commended Google’s rapid release cycle and additional stable releases for security updates, and Chrome’s recent switch from a six-week to a four-week release cycle.\n    Apple drew plaudits for faster fix rollouts overall, but was criticized for a large interval between landing WebKit patches and shipping them to users, which “leaves a very long amount of time for opportunistic attackers to find the patch and exploit it prior to the fix being made available to users”, Schoen warned.\n Microsoft’s comparative slowness in patching was blamed on “the monthly cadence” of its ‘Patch Tuesday’ updates.\n  Google has also announced that it paid out a  record-breaking $8.7 million in rewards to security researchers under its Vulnerability Reward Programs (VRPs) in 2021.\n The Chrome VRP, which covers not only  Google Chrome security but that of several other browsers built on Chromium, awarded $3.3 million for 333 bug reports, with the biggest payout, $45,000, awarded for a Chrome OS flaw.\n The Android VRP paid out nearly $3 million, double the total rewards across 2020, including $157,000 for a single exploit chain – the highest-ever Android reward.", "posttime": "2022-02-13 09:35:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "漏洞,google,project,报告", "title": "Google Project Zero在安全漏洞修复方面取得了巨大的进步", "title_en": "Google Project Zero hails dramatic acceleration in security bug remediation", "transed": 1, "url": "https://portswigger.net/daily-swig/google-project-zero-hails-dramatic-acceleration-in-security-bug-remediation", "via": "", "real_tags": ["漏洞", "google", "project", "报告"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072804, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "马克龙的一名随行人员说，我们不能接受他们掌握了总统的DNA\n埃马纽埃尔·马克龙拒绝了Kremlin 2019冠状病毒疾病测试的请求，他本周抵达弗拉基米尔·普京时，与俄罗斯领导人保持距离，两名麦克龙随行人员告诉路透社。\n周一，观察人士看到马克龙和普京坐在4米长（13英尺）桌子的两端讨论乌克兰危机的画面，有些外交官和其他人表示，普京可能想发出外交信息。\n但这两位了解法国总统健康协议的消息人士告诉路透社，马克龙有一个选择：要么接受俄罗斯当局进行的PCR检测，允许他接近普京，要么他拒绝并不得不遵守更严格的社交距离。\n“我们很清楚这意味着没有握手和那张长桌子。但我们不能接受他们拿到总统的DNA，”一位消息人士告诉路透社，他指的是如果这位法国领导人接受俄罗斯医生的检测，会带来安全问题。\n马克龙随行人员中的第二位消息人士证实，马克龙拒绝接受俄罗斯的PCR检测。消息人士称，马克龙在出发前进行了法国PCR检测，并在俄罗斯进行了一次抗原检测。\n“俄罗斯人告诉我们，普京需要被严格控制在健康泡沫中，”第二位消息人士说。\n周四，在马克龙和普京举行社交距离会议三天后，俄罗斯领导人接见了哈萨克斯坦总统卡西姆·约马特·托卡耶夫。两个人握了握手，坐得很近，中间只有一张小咖啡桌。", "note_en": "‘We could not accept that they get their hands on the president’s DNA’ a member of Macron’s entourage said\n    Emmanuel Macron refused a Kremlin request that he take a Russian Covid-19 test when he arrived to see Vladimir Putin this week, and was therefore kept at a distance from the Russian leader, two sources in Macron’s entourage told Reuters.\n Observers were struck by  images of Macron and Putin sitting at opposite ends of 4-metre-long (13 ft) table to discuss the Ukraine crisis on Monday, with some diplomats and others suggesting Putin might have wanted to send a diplomatic message.\n  But the two sources, who have knowledge of the French president’s health protocol, told Reuters Macron had been given a choice: either he accepted a PCR test done by the Russian authorities and was allowed to get close to Putin, or he refused and had to abide by more stringent social distancing.\n  “We knew very well that meant no handshake and that long table. But we could not accept that they get their hands on the president’s DNA,” one of the sources told Reuters, referring to security concerns if the French leader was tested by Russian doctors.\n  The second source in Macron’s entourage confirmed Macron declined to take a Russian PCR test. The source said Macron instead took a French PCR test before departure and an antigen test done by his own doctor once in Russia.\n “The Russians told us Putin needed to be kept in  a strict health bubble,” the second source said.\n On Thursday, three days after Macron and Putin had their socially distanced meeting, the Russian leader received Kazakh president Kassym-Jomart Tokayev. The two men shook hands, and sat close to each other, divided only by a small coffee table.", "posttime": "2022-02-13 09:26:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,俄罗斯,新冠病毒,龙因,putin", "title": "马克龙因“拒绝俄罗斯新冠病毒检测”而被普京拒之门外", "title_en": "Macron was kept away from Putin for ‘refusing Russian Covid test’", "transed": 1, "url": "https://www.theguardian.com/world/2022/feb/10/macron-was-kept-away-from-putin-in-kremlin-for-refusing-russian-covid-test", "via": "", "real_tags": ["病毒", "俄罗斯", "新冠病毒", "龙因", "putin"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072803, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它&#39；丹麦已经有几周没有任何形式的新冠病毒限制了。每日感染人数仍与取消限制时一样高，检测阳性率仍高达惊人的30%。然而，丹麦社会只是继续前进。在我们的孩子&#39；在学校，似乎现在几乎每个人都有了omicron。从没有任何症状到大多数人患有轻度感冒，再到少数人有流感样症状。大多数教师现在也经历了感染，因此代课教师的流失也基本结束。丹麦卫生当局对此感到非常兴奋。Omicron基本上被认为是一种祝福。大流行的入场券。通过感染大多数丹麦人，社会将拥有持久的自然免疫力，并为以后出现更致命的变种做好更好的准备。为6-11岁儿童接种疫苗的官方建议也在重新考虑之中。在过去的两周里，这个年龄段的孩子中至少有五分之一感染了omicron！在那次高峰之后，我们儿童学校的新感染已经放缓到涓涓细流。丹麦卫生当局还对疫苗和感染指南更新缓慢表示歉意。现在&#39；很明显，接种疫苗的人和未接种疫苗的人感染病毒的比例相同。支持接种疫苗的论点被简化为这样一个事实：它为成年人提供了良好的保护，使他们免受严重疾病的侵害。丹麦人对国际评论员对数据的误读也有点发笑。虽然住院人数确实有所增加，但几乎所有的增加都是因新冠肺炎住院的患者，而不是因新冠肺炎住院的患者。因新冠肺炎死亡的ICU人数在整个过程中保持稳定，死亡人数的增加也主要归因于因新冠肺炎死亡而非因新冠肺炎死亡。但是，尽管取得了成功，瑞典和格陵兰岛也取消了限制，但似乎许多其他国家的行为与意大利一开始遭受重创时一样：这不是&#39；与我们无关！当然也有一些不同之处——丹麦人不是&#39；比如说，与美国人一样肥胖，疫苗接种率也高于其他一些地方（DK约为80%）——世界级的数据收集能力应该也能帮助其他国家摆脱限制。丹麦人对新冠病毒的检测比世界上任何其他国家都多。从对病毒的深入调查中发现的事实清楚地表明，omicron&#39；疫苗接种并不能缓解病毒的传播，在极端、严厉的封锁之外，病毒的传播是不可阻挡的，在广泛的社会层面上，我们不再需要担心这种变异，因为它决定了我们的生活方式。我知道有&#39；在这些评估中，总是有一定程度的国家偏见，但也是如此；值得一看异议。我&#39；我没有和单亲家长说过话，更不用说我们圈子里有人反对取消限制了。在我们这个相当国际化的侨民社区中，每个人都感到非常荣幸，因为他们生活在一个从未为年幼的孩子在学校戴口罩的国家，而且只有非常短暂、有限的远程学校生活。有些人甚至主动寻找感染，如果他们没有#39；我还没吃呢！这几乎和我们家人得到omicron时的反应一样。孩子们是从学校捡来的，我们没有努力与他们隔离。一部分是因为它似乎是徒劳的（omicron的传染性太强了），另一部分是因为它更方便地解决问题。确实如此！有了自然免疫证明，你可以在欧洲自由旅行5个月，而无需持续检测。例如，这与美国许多家长的愤怒沮丧形成对比。孩子们仍然被迫在学校戴口罩，这让他们感到心烦意乱和沮丧。在外面吃饭，远离社交。即使在他们&#39；重新接种！它&#39；It’真的很难过。现在情况当然会改变。Omicron可能会被更糟糕的东西取代。以前的感染所提供的自然免疫对未来的变种可能没有那么有效。有各种可能的未来，丹麦人似乎已经做好了应对这些未来的适当准备。但与此同时，他们&#39；我选择对今天的科学做出反应，不再担心奥米克龙是一种需要全社会限制的疾病，继续生活。出于对傲慢的恐惧，大流行的未来似乎已经到来。它&#39；只是分布不均匀。", "note_en": "It&#39;s been a couple of weeks now  without any form of covid restrictions in Denmark. The daily infection numbers have  remained as high as they were when the restrictions were dropped, and the positivity rate for tests is still a staggering 30%. And yet, Danish society has simply moved on.  At our kids&#39; school, it seems that virtually everyone has had omicron by now. With anecdotes ranging from no symptoms at all to the majority experiencing mild colds to a few with flu-like symptoms. The majority of teachers have now also been through an infection, so the churn of substitutes is basically over as well.  Danish health authorities are pretty excited about all of this. Omicron is basically heralded as a blessing. The ticket out of the pandemic. By infecting the majority of Danes, society will have that long-lasting natural immunity, and be much better prepared for a later, more virulent variant to emerge.  The official recommendation to vaccinate 6-11 year old kids is also  being reconsidered. In just the last two weeks, at least one out of five kids in that age bracket have contracted omicron! New infections in our kids school have slowed to a trickle after that spike.  The Danish health authorities have also  apologized for being slow to update the guidance regarding vaccines and infections. Now that it&#39;s clear that  vaccinated and unvaccinated people contract the virus in equal proportion, the pro-vaccine argument is reduced to the fact that it offers good protection for adult individuals against serious illness.  The Danes are also having  a bit of a laugh at the misreadings of the data by international commentators. While hospitalizations have indeed gone up, virtually all of the increase is amongst hospitalized-with-covid not hospitalizations-because-of-covid. ICU because-of-covid numbers have  stayed stable throughout, and the increase in deaths is also largely attributable to dead-with-covid not dead-because-of-covid.  But despite this success, and the fact that  Sweden and  Greenland have also dropped their restrictions, it seems like many other countries are acting like they did when Italy got hit hard at the start: This isn&#39;t relevant to us!  And while there are surely some differences – Danes aren&#39;t as obese as Americans, say, and vaccination rates are higher than in some other places (DK is ~80%) – the world-class data gathering capacity should help others find their way out of restrictions too.  Danes have tested more for covid than any other nation in the world. And  the facts that are emerging from that intense level of inquiry into the virus show clearly that omicron&#39;s spread is not mitigated by vaccinations, that the spread is unstoppable outside of extreme, draconian lockdowns, and that on a broad, societal level we no longer need to fear this variant to a degree that it dictates how we live.  I know that there&#39;s always a degree of national bias in these assessments, but so it&#39;s worth looking at the dissent. I&#39;ve not spoken to a single parent, let alone heard of any in our circles, who oppose the fact that restrictions have been lifted. Everyone in our rather international community of expats here feel utterly privileged to have been living a country that never imposed masks for younger kids in school, and only had very brief, limited remote-school stints. Some are even going as far as to  actively seek out infection, just to get it over with, if they haven&#39;t had it already!  That was almost the same reaction we had when our family got omicron. The kids picked it up from school, and we made no effort to quarantine from them. Partly because it seemed futile (omicron is just too infectious), partly because it was more convenient to get it over with. And it really was! With an attestation of natural immunity, you can travel freely within Europe for 5 months without a need for constant testing.  Contrast that with the furious frustration of many parents in the US, for example. Distraught and dismayed that kids are  still forced to wear masks in school.  Eat outside, socially distanced. Even after they&#39;re vaccinated! It&#39;s really sad to see.  Now things may of course change. Omicron may be replaced by something worse. The natural immunity afforded by previous infection might not be as effective against future variants. There are all sorts of possible futures, and the Danes seem  suitably prepared to tackle those as they come. But in the mean time, they&#39;ve chosen to react to  The Science of today, and have stopped fearing omicron as a disease that requires society-wide restrictions, and get on with life.  At the fear of hubris, it seems the future of the pandemic is already here. It&#39;s just not evenly distributed.", "posttime": "2022-02-13 09:25:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,新冠病毒,covid,感染", "title": "在丹麦没有新冠病毒限制的两周后", "title_en": "After two weeks with no Covid restrictions in Denmark", "transed": 1, "url": "https://world.hey.com/dhh/after-two-weeks-with-no-covid-restrictions-in-denmark-923dd9a2", "via": "", "real_tags": ["病毒", "新冠病毒", "covid", "感染"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072802, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周Facebook股价突然暴跌，原因不乏解释。Facebook母公司Meta在一份收益报告中表示，其用户增长已经停滞。作为Facebook最有价值的用户群，年轻人一直在TikTok上花费时间。TikTok是一款不可抗拒的短视频应用，多年来已成为Facebook最强大的竞争对手。\n苹果去年在iPhone上增加的新隐私功能也阻碍了Facebook的主要赚钱者之一——定向数字广告；该公司表示，苹果的改变可能会在未来一年使其损失100亿美元的收入。Meta透露，它去年花了100亿美元打造了它的新名字metaverse，Facebook押注的虚拟现实仙境将是互联网的下一个大事件——但到目前为止，它仍然是虚拟的，而不是现实的。\n投资者大吃一惊。Meta的股价上周下跌了2500多亿美元。这是一个几乎无法理解的数字——只有几十家上市公司的市值超过2500亿美元。换句话说，除了最大的公司之外，Facebook的价值下跌幅度超过了所有公司的价值。\n但在Facebook众多昂贵问题的背后，是一个更根本的问题，这个问题困扰了该公司十多年，而Facebook联合创始人马克·扎克伯格（Mark Zuckerberg）从未真正找到解决方法。\n问题在于创新：Facebook似乎做不到这一点。这家公司似乎不知道如何发明成功的新东西。它的大部分热门产品——不仅仅是它的两个主要产品Instagram和WhatsApp，还有许多最常用的功能，比如Instagram Stories——都是在别处发明的。他们要么通过收购，要么在不起作用时直接抄袭Facebook。\n但对于Facebook来说，购买和复制其他创意变得越来越困难。世界各地的监管机构都对Facebook的规模和市场实力感到担忧，因此对让它吞并更多潜在竞争对手感到不满。Facebook最大的应用程序中充斥着从其他地方克隆的功能，以至于它们变得混乱和不集中。\n与此同时，很容易理解为什么投资者可能会怀疑Facebook是一家将发明下一件大事的公司，无论是metaverse还是其他什么。Facebook已经有很长一段时间没有创造出真正具有开创性的东西了。\n多长时间扎克伯格并没有发明社交网络的概念，但Facebook的第一个十年充满了创新。也许最重要的是2006年发布的News Feed，该系统将朋友的更新组织成一个时间表，也就是Facebook应用程序的主要部分。新闻提要彻底改变了人们浏览互联网的方式。\n在Myspace等较老的社交网络上，你必须访问每个朋友的页面，看看他们发生了什么。通过将你网络中的帖子合并成一种实时摘要，新闻提要带来了人际关系中的一些深刻内容——一个实时窗口，我们任何人都可以进入我们所有人的社交生活。事实上，新闻提要——以及它所激发的许多其他提要，比如Twitter——已经以积极和相当消极的方式改变了世界，这只会突显它的重要性。至少有一次，Facebook可以提出真正可以改变世界的新想法。\n然而，十年前，Facebook上市，从那以后，它的战略更多的是通过谷歌搜索其用户群和广告业务的疯狂增长，而不是创新。它的主要技术项目变成了规模化——它将建设基础设施，为地球上的每个人服务，并可以利用这一基础设施保持领先地位。当有趣的新功能出现在网上时，你可以指望Facebook将它们带给最广泛的受众，即使这些功能不是它自己发明的。\n多年来，photostat策略一直运作良好。它甚至没有什么不光彩的地方；科技界最好的想法——或者说，生活中最好的想法——往往是许多不同想法的拼凑。正如史蒂夫·乔布斯所说：“优秀的艺术家抄袭，伟大的艺术家窃取。”Facebook的艺术性在于其卓越的运营能力，而非独创性。\n考虑Instagram。当Facebook在2012年斥资10亿美元购买照片分享应用时，Instagram只有13名员工，约3000万用户，没有收入。Facebook向该公司倾注了大量资源，同时允许其创始人凯文·伊斯特罗姆（Kevin Systrom）和迈克·克里格（Mike Krieger）拥有广阔的经营空间。增长激增。如今，每月有超过10亿人使用Instagram，2018年它的价值可能超过1000亿美元。Instagram的创始人于2018年离开了公司——据报道是在与扎克伯格的关系日益紧张之后——但他们坚持认为，此次收购最终对用户有利。\n联邦贸易委员会批准Facebook收购Instagram和WhatsApp，但在2020年，该机构对Facebook提起诉讼，称这两项交易都是维持垄断的“系统战略”的一部分。上个月，一名法官裁定，该诉讼的修订版本可以继续推进。监管机构几乎不可能允许Facebook在短期内收购另一个潜在竞争对手。这就给Facebook留下了另一个多年来一直磨练的策略——借用他人的想法。\n再看看Instagram。当应用程序启动时，它只是一个简单的照片源。多年来，Facebook在其上安装了一系列从其他地方获得的功能。Instagram现在可以播放直播流——这一功能最初由Twitch和Periscope等初创公司开创。Instagram最受欢迎的功能之一是Stories，一种用户日的照片日记。故事格式是Snapchat发明的，Snapchat在20世纪10年代初的成功似乎对Facebook的主导地位构成了威胁。扎克伯格试图收购这家公司——现在叫做Snap。没有骰子。他还尝试了几种方法来克隆它的特征。2017年，他终于大获成功；在Instagram应用程序的顶部添加了故事之后，Facebook将Snap从水里吹了出来。在克隆Snapchat的最佳功能不到一年的时间里，Instagram的故事就比Snapchat的故事要多。Facebook似乎也在Facebook应用程序和WhatsApp中添加了一个故事功能。\n现在Facebook正试图通过TikTok的克隆版本Reels做类似的事情。卷轴首次亮相Instagram在2020，并在2021卷开始滚动在脸谱网上。扎克伯格上周在与投资者的通话中表示，Reels表现良好。但他并没有透露太多细节，他提到了TikTok带来的竞争，以至于有人怀疑他对自己的克隆人在竞争中的表现并不完全满意。\n我并不惊讶。我经常使用Instagram，但我发现它越来越凌乱。这是一个狗的早餐，有很多不同的社交功能，它们都不舒服地坐在一起——一个放永久照片、短暂故事、有影响力的短视频甚至购物的地方。与此同时，Facebook应用程序感觉像是一个失败的膨胀原因；就像一家餐厅提供太多不同种类的菜肴一样，该应用试图做太多事情，结果几乎一无所获。\nFacebook似乎确实有能力创造新事物。它的虚拟现实业务是在2014年收购V.R.初创公司Oculus的基础上建立起来的，它已经创造了一些有趣的硬件，它在metaverse上的投资很可能会带来奇妙的新虚拟世界。但持怀疑态度是合理的。\nFacebook仍然是一家非常成功的公司，但它最近的困境确实让人质疑了更强有力的反垄断规则的支持者提出的理论，即它仍然比竞争对手享有不公平的竞争优势。它的市值刚刚跌至6000亿美元以下，众议院民主党人为旨在遏制“大科技”力量的新立法选择了这一门槛。正如分析师本·汤普森指出的那样，曾经几乎完全由谷歌和Facebook统治的数字广告市场最近变得更具竞争力。\nFacebook的巨额V.R.赌注的一个大问题是，它能否重新点燃公司早期的创新精神。Facebook在其他人的发明上走得太远了，现在它的油印机被卡住了，真的很难看到它的发展方向。也许是时候提出一个新的鼓舞人心的企业口号了：行动迅速，创造奇迹。\n法哈德想通过电话与读者聊天。如果你有兴趣和《纽约时报》专栏作家谈谈你的想法，请填写这张表格。法哈德将选择几个读者打电话。\n《泰晤士报》致力于出版各种写给编辑的信件。我们想听听你对这篇文章或我们的任何一篇文章的看法。这里有一些建议。这里&#39；这是我们的电子邮件：letters@nytimes.com .", "note_en": "There has been  no shortage of explanations for the sudden, spectacular swoon in Facebook’s stock value last week. Meta, Facebook’s parent company, said in an earnings report that its user growth had stalled. Young people, its most valuable demographic, keep spending time on TikTok, the irresistible short-video app that has become Facebook’s most formidable competitor in years.\n New privacy features  that Apple added to the iPhone last year are also hampering one of Facebook’s main moneymakers, targeted digital ads; the company said that Apple’s changes may cost it $10 billion in revenue in the coming year. And Meta disclosed that it had spent $10 billion last year building out its new namesake, the metaverse, the virtual-reality wonderland that Facebook is betting will be the internet’s next big thing — but that, so far, remains more virtual than reality.\n Investors reeled. Meta’s stock value  shed more than $250 billion last week. That’s a nearly incomprehensible amount — only a few dozen publicly listed companies are valued at more than $250 billion. In other words, Facebook’s value has slumped by more than what all but the largest companies are worth.\n But beneath Facebook’s many expensive problems is a single more fundamental problem, an issue that has plagued the company for more than a decade — and that Mark Zuckerberg, Facebook’s co-founder, has never really figured out how to address.\n  The problem is innovation: Facebook can’t seem to do it. The company just doesn’t appear to know how to invent successful new stuff. Most of its biggest hits — not just two of its main products, Instagram and WhatsApp, but many of its most-used features, like Instagram Stories — were invented elsewhere. They made their way to Facebook either through acquisitions or, when that didn’t work, outright copying.\n But buying and copying other ideas is becoming increasingly difficult for Facebook. Regulators around the world, wary of Facebook’s size and market power, are sour on letting it gobble up any more would-be competitors. And Facebook’s biggest apps are so overstuffed with features cloned from other places that they’re becoming chaotic and unfocused.\n Meanwhile, it’s easy to see why investors might be skeptical that Facebook is the company that will invent the next big thing, whether the metaverse or whatever else. It’s been a very long time since Facebook created something truly groundbreaking.\n How long? Zuckerberg didn’t invent the idea of a social network, but  Facebook’s first decade was nevertheless full of innovations. Perhaps the most important was the release in 2006 of  News Feed, the system that organizes updates from your friends into a timeline — also known as the main part of the Facebook app.  News Feed revolutionized how people navigated the internet.\n On older social networks, like Myspace, you had to visit each of your friends’ pages to see what was happening with them. By combining posts in your network into a kind of real-time digest, News Feed ushered in something profound in human relations — a real-time window, available to any of us, into the social lives of all of us. The fact that News Feed — and the many other feeds it inspired, like Twitter’s — has gone on to change the world in both positive and quite negative ways only underlines its importance. Once, at least, Facebook could come up with new ideas that really could change the world.\n  Ten years ago, though, Facebook went public, and ever since, its strategy has been less about innovation than about goosing wild growth both in its user base and its ad business. Its main technological project became scale — it would build out its infrastructure to serve everyone on earth, and it could leverage that infrastructure to stay on top. When interesting new features popped up online, you could count on Facebook to bring them to the widest audience, even if it didn’t itself invent those features.\n For many years, the photostat strategy  worked out just fine. There wasn’t even really anything dishonorable about it; the best ideas in tech — or, for that matter, in life — are often pastiches of lots of different ideas. As Steve Jobs  said: “Good artists copy. Great artists steal.” Facebook’s artistry lay in its operational excellence more than its originality.\n Consider Instagram. When Facebook paid $1 billion for the photo-sharing app in 2012, Instagram had only 13 employees,  about 30 million users and no revenue. Facebook showered resources on the company while allowing its founders, Kevin Systrom and Mike Krieger, wide latitude in running the place. Growth surged. Today more than  a billion people use Instagram every month, and in 2018 it may have been worth  more than $100 billion. Instagram’s founders  left the company in 2018 —  reportedly after increasing tensions with Zuckerberg — but they have  maintained that the acquisition was ultimately good for users.\n The Federal Trade Commission approved Facebook’s purchases of Instagram and WhatsApp, but in 2020, the agency  filed suit against Facebook, saying that both deals were part of a “systematic strategy” to maintain a monopoly. Last month, a judge ruled that an amended version  of the lawsuit could  move forward. There’s almost no chance that regulators will allow Facebook to buy another potential rival anytime soon. That leaves Facebook with another tactic it has honed over many years — borrowing other people’s ideas.\n Look, again, at Instagram. When the app started, it was a simple feed of photos. Over the years Facebook has loaded it up it with a slew of features picked up elsewhere. Instagram now broadcasts live streams — a feature first pioneered by start-ups like Twitch and Periscope. One of Instagram’s most popular features is  Stories, a kind of photo diary of a user’s day. The Stories format was invented by Snapchat, whose success in the early 2010s looked like it posed a threat to Facebook’s dominance. Zuckerberg tried to purchase the company — now called Snap. No dice. He also tried several ways to clone its features. In 2017, he finally hit big; after putting Stories at the top of the Instagram app, Facebook blew Snap out of the water. Within a year of cloning Snapchat’s best feature, Instagram’s Stories was  bigger than Snapchat’s. As if to rub it in,  Facebook also added a Stories feature to the Facebook app and to WhatsApp.\n Now Facebook is trying to do something similar with Reels, its TikTok clone. Reels made its debut in Instagram in 2020, and in 2021 Reels began rolling out on Facebook. On a call with investors last week, Zuckerberg said that Reels was doing well. But he didn’t go into many specifics, and he mentioned competition posed by TikTok so much that one suspects he isn’t entirely satisfied with how well his clone is competing.\n I’m not surprised. I use Instagram often, but I find it increasingly messy. It’s a dog’s breakfast of lots of different social features all sitting uncomfortably together — a place for permanent photos, for ephemeral stories, for influencers’ short videos and even for shopping. The Facebook app, meanwhile, feels like a lost cause of bloat; like a restaurant that serves too many different kinds of cuisines, the app tries to do so much it ends up doing almost nothing well.\n  Facebook does seem capable of building new things. Its virtual-reality business — built out of its 2014 acquisition of the V.R. start-up Oculus — has created some interesting hardware, and its spending on the metaverse could well lead to wondrous new virtual worlds. But it’s reasonable to be skeptical.\n Facebook remains an enormously successful company, but its recent straits do call into question the theory, offered by proponents of stronger antimonopoly rules, that it still enjoys an unfair competitive advantage over competitors. Its market value has just fallen under $600 billion,  the threshold that Democrats in the House have picked for new legislation aimed at curbing the power of “Big Tech.” As the analyst  Ben Thompson notes, the digital ad market, once ruled nearly entirely by Google and Facebook, has recently become more competitive.\n The big question about Facebook’s massive V.R. bet is whether it can rekindle the company’s early innovative spirit. Facebook has coasted so long on other people’s inventions that it’s really hard to see where it goes now that its mimeograph machine is jammed. Perhaps it’s time for a new inspirational corporate slogan: Move fast — and make things.\n  Farhad wants to   chat with readers on the phone . If you’re interested in talking to a New York Times columnist about anything that’s on your mind, please fill out this form. Farhad will select a few readers to call.\n  The Times is committed to publishing   a diversity of letters  to the editor. We’d like to hear what you think about this or any of our articles. Here are some   tips . And here&#39;s our email:   letters@nytimes.com .", "posttime": "2022-02-13 09:21:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,发明,failures", "title": "Facebook的发明失败", "title_en": "Facebook’s Failures of Invention", "transed": 1, "url": "https://www.nytimes.com/2022/02/10/opinion/facebook-stock-meta-innovation.html", "via": "", "real_tags": ["facebook", "发明", "failures"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072801, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个过程是自动的。您的浏览器将很快重定向到您请求的内容。", "note_en": "This process is automatic. Your browser will redirect to your requested content shortly.", "posttime": "2022-02-13 09:04:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,saas,acquires,请求", "title": "Cloudflare收购Vectrix以扩展零信任SaaS安全性", "title_en": "Cloudflare acquires Vectrix to expand Zero Trust SaaS security", "transed": 1, "url": "https://blog.cloudflare.com/cloudflare-acquires-vectrix-to-expand-zero-trust-saas-security/", "via": "", "real_tags": ["rust", "saas", "acquires", "请求"]}, {"category": "", "categoryclass": "", "imagename": "381e9affd9f8e9520970f87e35f6942b.jpg", "infoid": 1072800, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "https://www.covertinstruments.com", "note_en": "https://www.covertinstruments.com", "posttime": "2022-02-13 04:56:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "加密,encrypted,https", "title": "128位加密智能锁在几秒钟内失效", "title_en": "128-Bit Encrypted Smart Lock Defeated in Seconds", "transed": 1, "url": "https://www.youtube.com/watch?v=PEaIadLDLIA", "via": "", "real_tags": ["加密", "encrypted", "https"]}, {"category": "", "categoryclass": "", "imagename": "b6258ed4be622aac97f6c833be56ba50.jpg", "infoid": 1072799, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "两年前，研究人员偶然发现了互联网上最有趣的僵尸网络之一：一个以前未被发现的由500台服务器组成的网络，其中许多服务器位于世界各地的知名大学和企业，不受正常拆除方法的影响。这些研究人员说，在潜伏了16个月之后，名为FritzFrog的僵尸网络又恢复了新的功能，并拥有了更多受感染的机器。\nFritzFrog的目标几乎是任何带有SSH或安全外壳、服务器云实例、数据中心服务器、路由器等的东西，并安装一个从零开始编写的异常先进的负载。当安全公司Guardicore Labs（现为Akamai Labs）的研究人员在2020年年中报告它时，他们称它为“下一代”僵尸网络，因为它拥有全套功能和精心设计的设计。它是一种分散的对等体系结构，在许多受感染的节点之间而不是在中央服务器之间分配管理，这使得使用传统方法很难检测或关闭它。它的一些高级特征包括：\n唯一的重点是感染网络管理员用来管理机器的安全外壳服务器\n一个登录凭证组合列表，用于识别比以前出现的僵尸网络更“广泛”的弱登录密码\n到2020年8月，FritzFrog已将来自知名组织的约500台机器集中到其网络中。报告发布后，P2P减少了新感染病例的数量。Akamai研究人员周四报告称，从去年12月开始，僵尸网络&#39；美国的感染率增加了十倍，现在已经激增到1500多台机器。\n这种先进的软件每天都在更新，以修复漏洞，在过去几个月里，它实现了新的功能和更具攻击性的感染方法。它以最新形式感染的组织包括一家欧洲电视频道网络、一家俄罗斯医疗设备制造商、东亚多所大学以及医疗、高等教育和政府部门的其他机构。\nFritzFrog通过扫描互联网上的SSH服务器进行传播，当它找到一个服务器时，它会尝试使用凭据列表登录。成功后，僵尸网络软件会安装专有恶意软件，使其成为一个庞大的无头P2P网络中的无人机。每台服务器不断监听端口1234上的连接，同时扫描端口22和2222上的数千个IP地址。当它遇到其他受感染的服务器时，这些服务器会相互交换数据，以确保所有服务器都运行最新的恶意软件版本，并拥有目标和受感染机器的最新数据库。\n为了躲避防火墙和端点保护软件，FritzFrog通过SSH将命令传输到受感染机器上的netcat客户端。Netcat然后连接到一个“恶意软件服务器”，该服务器托管在受感染的机器上，而不是中央服务器。", "note_en": "Two years ago, researchers stumbled upon one of the Internet’s most intriguing botnets: a previously undiscovered network of 500 servers, many in well-known universities and businesses around the world, that was impervious to normal takedown methods. After lying low for 16 months, those researchers said, the botnet known as FritzFrog is back with new capabilities and a larger base of infected machines.\n   FritzFrog targets just about anything with an SSH, or  secure shell, server—cloud instances, data center servers, routers, and the like—and installs an unusually advanced payload that was written from scratch. When researchers from security firm Guardicore Labs (now Akamai Labs)  reported it in mid-2020, they called it a “next-generation” botnet because of its full suite of capabilities and well-engineered design. It was a decentralized, peer-to-peer architecture that distributed administration among many infected nodes rather than a central server, making it hard to detect or take it down using traditional methods. Some of its advanced traits included:\n A sole focus on infecting  secure shell servers that network administrators use to manage machines\n  A list of login credential combinations used to suss out weak login passwords that is more “extensive” than those in previously seen botnets\n    By August 2020, FritzFrog had corralled about 500 machines from well-known organizations into its network. Following the report, the P2P scaled down the number of new infections. Starting last December, Akamai researchers  reported on Thursday, the botnet&#39;s infection rate increased tenfold and has now mushroomed to more than 1,500 machines.\n  The advanced software is updated daily to fix bugs and over the past several months has implemented new functionality and more aggressive infection methods. Among the organizations it has infected in its latest form are a European television channel network, a Russian manufacturer of health care equipment, multiple universities in East Asia and others in healthcare, higher education, and government.\n  FritzFrog spreads by scanning the Internet for SSH servers, and when it finds one, it attempts to log in using a list of credentials. When successful, the botnet software installs proprietary malware that makes it a drone in a sprawling, headless P2P network. Each server constantly listens for connections on port 1234 while simultaneously scanning thousands of IP addresses over ports 22 and 2222. When it encounters other infected servers, the servers exchange data with each other to ensure all of them are running the latest malware version and have the most up-to-date database of targets and infected machines.\n To evade firewalls and endpoint protection software, FritzFrog pipes commands over SSH to a netcat client on the infected machine. Netcat then connects to a “malware server” hosted on an infected machine rather than a central server.", "posttime": "2022-02-13 04:14:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "僵尸,ssh,服务器", "title": "在躺下后，SSH僵尸网络会出现蘑菇，而且比以往任何时候都更难清除", "title_en": "After lying low, SSH botnet mushrooms and is harder than ever to take down", "transed": 1, "url": "https://arstechnica.com/information-technology/2022/02/after-lying-low-ssh-botnet-mushrooms-and-is-harder-than-ever-to-take-down/", "via": "", "real_tags": ["僵尸", "ssh", "服务器"]}, {"category": "", "categoryclass": "", "imagename": "e714ce4c5f45776a4a14c5b70022bef9.png", "infoid": 1072798, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Razer去年推出了一款广泛使用的键盘，支持8000赫兹的投票率，因此它没有#39；看到竞争对手效仿并不令人惊讶。Corsair今天发布了K70 RGB Pro机械游戏键盘，该键盘还声称每秒向PC报告8000次，而不是标准的1000次。但和其他8000赫兹的键盘一样，我们&#39；我已经看到了，这个数据可能并不是键盘上真正能说服你的东西。事实上，大多数人都赢了&#39；我没注意到8000赫兹和传统1000赫兹之间的差别。\n海盗号&#39；s宣布K70 RGB Pro不#39；不要把注意力放在键盘上#39；投票率太高了。新闻稿指出了Axon技术，该公司称其为&#34；比标准游戏键盘快8倍；但没有具体提到8000赫兹，甚至没有提到&#34；投票率&#34;\n海盗也没有&#39；t提供输入滞后声明，但约8000 Hz键盘指出输入滞后低至0.125 ms（1秒除以8000个报告=0.000125秒）。K70 RGB Pro&#39；s的产品页面确实强调了轮询率和4000 Hz键扫描率（在Corsair&#39；的网站的其他地方，该公司声称其Axon处理器可以提供低至0.25毫秒的输入延迟）。\n但在开始之前，产品页面会突出显示键盘#39；s doubleshot PBT塑料键帽及其使用Cherry MX品牌的机械开关。海盗号&#39；s的产品页面还包括键盘&#39；在提到产品之前，请先使用s铝制框架和每个关键RGB&#39；s Axon 8000赫兹功能。\n海盗号&#39；s的新闻稿还包括键盘&#39；s铝制音量滚轮和其他媒体键，以及软件或板载宏键录制。\n除了高投票率外，其他8000赫兹的键盘也试图提供额外的炫目功能。例如，你&#39；我可能会注意到华硕ROG Strix Flare II动画&#39；s mini LED动画矩阵比其他任何东西都重要。华硕也肯定会包括更高质量的键帽（也是doubleshot PBT）和其他功能，如消音泡沫、RGB腕垫和USB直通。\n它&#39；这并不像8000赫兹的键盘是毫无意义的，或者说供应商应该停止试图突破键盘速度的限制。但大多数人不&#39；我不需要这样的键盘，也不会&#39；我没注意到区别。对于典型用户来说，8000赫兹韩元&#39；这不足以使一个键盘高于另一个键盘。\n当然，像8000赫兹鼠标和360赫兹显示器这样的高投票率键盘是极端的游戏外围设备。但是，如果你的系统在某些方面可能会引入延迟，那么减少键盘延迟就可以了&#39；不要改变游戏规则。海盗号&#39；不过，除了速度之外，苹果的其他8000赫兹键盘还有其他的噱头。例如，海盗K100夸耀其光学机械开关，而该板拥有一个大型可编程RGB表盘。\n同样，Razer将其8000 Hz Huntsman V2&#39；s产品页面至产品&#39；s光机械开关、双击PBT键帽和消音泡沫。\n因此，虽然更快的键盘是一项有趣的成就，对那些对输入滞后怀恨在心的人来说是一个潜在的好处，但它&#39；It’很高兴看到键盘制造商正在提供其他功能来证明那些高价标签Corsair&#39；s K70 RGB起价为160美元。\nArs Technica可能会通过联盟计划从本文链接中获得销售报酬。", "note_en": "Razer introduced a  widely available keyboard with an 8,000 Hz polling rate last year, so it hasn&#39;t been surprising to see rivals follow suit. Corsair today released  the K70 RGB Pro mechanical gaming keyboard, which also claims to report to the PC 8,000 times per second instead of the standard 1,000. But as with other 8,000 Hz keyboards we&#39;ve seen, that stat may not be what actually sells you on the keyboard. In truth, most people won&#39;t notice the difference between 8,000 Hz and the traditional 1,000 Hz.\n Corsair&#39;s announcement of the K70 RGB Pro doesn&#39;t put a huge focus on the keyboard&#39;s overboard polling rate. The press release points to the Axon technology that the company says is &#34;up to 8x faster than standard gaming keyboards,&#34; but there is no specific mention of 8,000 Hz or even the term &#34;polling rate.&#34;\n  Corsair also didn&#39;t provide an input lag claim, but some 8,000 Hz keyboards point to an input lag of as low as 0.125 ms (1 second divided by 8,000 reports = .000125 second). The K70 RGB Pro&#39;s  product page does highlight the polling rate and 4,000 Hz key-scanning rate ( elsewhere on Corsair&#39;s website, the company claims its Axon processor can deliver input lag of as low as 0.25 ms).\n But before you get to that, the product page highlights the keyboard&#39;s doubleshot PBT plastic keycaps and its use of Cherry MX-branded mechanical switches. Corsair&#39;s product page also covers the keyboard&#39;s aluminum frame and per-key RGB before mentioning the product&#39;s Axon 8,000 Hz feature.\n     Corsair&#39;s press release also covers the keyboard&#39;s aluminum volume roller and other media keys, plus software or onboard macro key recording.\n Other 8,000 Hz keyboards have also tried to offer additional showy features besides high polling rates. For example, you&#39;ll probably notice the  Asus ROG Strix Flare II Animate&#39;s mini LED animated matrix before anything else. And Asus was also sure to include higher-quality keycaps (also doubleshot PBT) and other features, like sound dampening foam, an RGB wrist rest, and USB passthrough.\n It&#39;s not like 8,000 Hz keyboards are pointless or that vendors should stop trying to push the limits of keyboard speed. But most people don&#39;t need such a keyboard and wouldn&#39;t notice the difference. For the typical user, 8,000 Hz won&#39;t be enough to elevate one keyboard over another.\n Of course, high-polling-rate keyboards, like 8,000 Hz mice and 360 Hz monitors, are  extreme gaming peripherals. But if your system has some areas where lag may be introduced, reducing keyboard lag won&#39;t be a game changer. Corsair&#39;s other 8,000 Hz keyboards have other gimmicks besides speed, though. For example, the  Corsair K100 brags about its optical mechanical switches, and the board boasts a large programmable RGB dial.\n  Similarly, Razer dedicates most of its 8,000 Hz Huntsman V2&#39;s product page to the product&#39;s optical mechanical switches, doubleshot PBT keycaps, and sound-dampening foam.\n So while faster keyboards are an interesting achievement and a potential boon for those with a vendetta against input lag, it&#39;s nice to see that keyboard makers are offering other features to justify those high price tags—Corsair&#39;s K70 RGB starts at $160.\n Ars Technica may earn compensation for sales from links on this post through  affiliate programs.", "posttime": "2022-02-13 04:08:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "键盘,机械,mechanical", "title": "8000赫兹的机械键盘继续提供比低输入滞后更多的功能", "title_en": "8,000 Hz mechanical keyboards continue offering more than low input lag", "transed": 1, "url": "https://arstechnica.com/gadgets/2022/02/8000-hz-mechanical-keyboards-continue-offering-more-than-low-input-lag/", "via": "", "real_tags": ["键盘", "机械"]}, {"category": "", "categoryclass": "", "imagename": "b9e31cb5908b353b1a4c5e9184457d98.jpg", "infoid": 1072796, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在，我们已经知道，与我们今天所知的OLED面板相比，QD-OLED屏幕将运行多少。\nOLED已经是一种昂贵的高端显示技术，但三星&#39；s QD-OLED为这项技术注入了量子点自旋，有望实现图像增强和改善色彩覆盖。我们&#39；We’我们仍在等待了解QD-OLED电视的价格，但今年春天推出的第一款带有该技术的PC显示器将是1300美元。\n三星显示器（Samsung Display）上月宣布推出QD-OLED，即量子点有机发光二极管，预计今年将推出电视和显示器。这种新型的OLED面板应该提供同样的深黑色和丰富的对比度，使OLED在HDR用户、游戏玩家和任何想要清晰图像的人中流行。不同之处在于，这项新技术使用了一种蓝色OLED材料，这种材料穿过一层量子点。这种设置应该确保无论屏幕是什么，颜色都是鲜艳的#39；s亮度设置，加上高亮显示区域的更多细节。（要深入了解QD-OLED是什么，请查看我们的故事。）\nAlienware AW3423DW是第一款使用QD-OLED面板的电脑显示器。该屏幕占据了DCI-P3颜色空间的99.3%，在250尼特时，它占39；它的典型亮度预计低于许多现代LED显示器。不过，正如QD-OLED承诺的那样，它可以在更小的测试区域内达到1000个单位，这有助于它提供更详细的高光。该显示器还通过了VESA Display HDR 400真黑认证，要求最大黑电平为0.0005奈特。AW3423DW提供了一个3440×1440超宽OLED面板，宽高比为21:9，刷新频率为175 Hz。\nAW3423DW售价1300美元，比Alienware和#39；目前的显示器阵容。该公司&#39；目前最昂贵的AW3821DW显示屏仍有一些优势，最明显的是其更大的37.5英寸尺寸。AW3821DW还通过了VESA Display HDR 600认证，因此它的HDR内容亮度至少达到600尼特。Alienware和#39；s大屏幕显示器的分辨率也更高，为3840×1600，刷新率为144 Hz。它&#39；它目前的标价是1200美元。\n然而，AW3821DW是带有LED背光的IPS面板，市场上还有无数其他此类选项。颜色是QD-OLED和Alienware#39最大的宣传优势；s非OLED AW3821DW声称其色彩覆盖率（95%DCI-P3）比QD-OLED选项低3%。\nAW3423DWl价格昂贵，但它提供的超宽面板尺寸小于大多数OLED显示器，而OLED显示器通常仅限于类似电视的尺寸。罕见的桌面大小的选择，如32英寸LG超细OLED Pro，有针对性的专业人士，其价格标签与LG&#39；s的显示器售价4000美元。其他OLED显示器的分辨率为4K，上限刷新率为120 Hz。\n这就给我们留下了更大的OLED显示器。千兆字节&#39；这款48英寸FO48U OLED游戏显示器目前售价为1200美元（部分零售商在折扣200美元后售价为1000美元）。那&#39；它的屏幕比Alienware便宜100-300美元&#39；这是新的显示器。\n三星显示器（Samsung Display）曾表示，QD-OLED在管理老化方面应该与OLED一样好或更好。Alienware和#39；s QD-OLED显示器有三年的硬件有限保修期，该公司在1月表示，用户将获得更换显示器#34；到下一个工作日&#34；如果一个单元发生老化。\nQD-OLED将在精英电视战争中扮演重要角色，Alienware和#39；s的QD-OLED显示器的定价让我们一窥&#39；很快就要来了。\n它&#39；目前尚不清楚三星和索尼预计推出的QD-OLED电视何时能获得确定的价格和发布日期。事实上，韩国科技网站Elec本周发布的一份报告称，三星显示器（制造面板技术）和面向消费者的三星电子尚未就定价达成一致。三星没有&#39；t证实了这篇报道。\nArs Technica可能会通过联盟计划从本文链接中获得销售报酬。", "note_en": "We now have an idea of how much  QD-OLED screens will run you compared to the OLED panels we know today.\n OLED is already an expensive, high-end display technology,  but Samsung&#39;s QD-OLED puts a quantum-dot spin on the tech, promising image enhancement and improved color coverage. We&#39;re still waiting to learn how much QD-OLED TVs will cost, but the first PC monitor with the tech, coming this spring, will be $1,300.\n Samsung Display announced QD-OLED, or Quantum Dot-Organic Light Emitting Diode, last month, with TVs and monitors expected this year. The new type of OLED panel is supposed to provide the same deep blacks and rich contrast that make OLED popular among HDR users, gamers, and anyone who wants a crisp image. The difference is that the new tech uses a blue OLED material that goes through a layer of quantum dots. This setup is supposed to ensure vivid color regardless of the screen&#39;s brightness setting, plus more detail in highlighted areas. (For an in-depth look, check out our story explaining  what QD-OLED is.)\n The Alienware AW3423DW is the first computer monitor to use a QD-OLED panel.  The screen claims 99.3 percent of the DCI-P3 color space, and, at 250 nits, it&#39;s expected to have a lower typical brightness than many modern LED monitors. It  can hit 1,000 nits in a smaller test area, though, which could help it deliver more detailed highlights, as QD-OLED promises. The monitor is also certified for VESA Display HDR 400 True Black, which requires a black level of 0.0005 nits, max. The AW3423DW brings a 3440×1440 ultrawide OLED panel with a 21:9 aspect ratio and a 175 Hz refresh rate.\n  At $1,300, the AW3423DW will have a higher price tag than anything in Alienware&#39;s current monitor lineup. The company&#39;s current priciest display,  the AW3821DW, still has some advantages, the most obvious being its larger 37.5-inch size. The AW3821DW is also VESA Display HDR 600-certified, so it will hit at least 600 nits of brightness with HDR content. Alienware&#39;s large monitor also has a higher resolution, 3840×1600, with a lower 144 Hz refresh rate. It&#39;s currently listed at $1,200.\n    However, the AW3821DW is an IPS panel with an LED backlight, and there are countless other such options on the market. Color is the largest touted benefit of QD-OLED, and Alienware&#39;s non-OLED AW3821DW claims 3 percent less color coverage (95 percent DCI-P3) than the QD-OLED option.\n  The AW3423DWl is pricey, but it offers an ultra-wide panel in a smaller size than most OLED monitors, which have generally been limited to TV-like sizes. The rare desktop-sized options, like the 32-inch  LG UltraFine OLED Pro, have targeted professionals, with price tags to match—LG&#39;s monitor sells for $4,000. Other OLED monitors at 4K resolution cap refresh rates at 120 Hz.\n That leaves us with larger OLED monitors. Gigabyte&#39;s 48-inch FO48U OLED gaming monitor is currently  available for $1,200 (or $1,000 at  some retailers after a $200 rebate). That&#39;s a lot more screen for $100-$300 cheaper than Alienware&#39;s new display.\n Samsung Display has said QD-OLED should be as good as or better than OLED at managing burn-in. Alienware&#39;s QD-OLED monitor has a three-year limited hardware warranty, and the company  said in January that owners would get a replacement monitor &#34;by the next business day&#34; if a unit suffers from burn-in.\n  QD-OLED will play a big role in the elite TV wars, and Alienware&#39;s pricing for its QD-OLED monitor gives us a peek at what&#39;s to come.\n It&#39;s unclear when QD-OLED TVs expected from Samsung and Sony will get firm prices and release dates. In fact, a report from South Korean tech site  The Elec this week claimed that Samsung Display (which makes the panel technology) and the consumer-facing Samsung Electronics have yet to agree on pricing. Samsung hasn&#39;t confirmed this report.\n Ars Technica may earn compensation for sales from links on this post through  affiliate programs.", "posttime": "2022-02-13 03:55:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "价格,qd,oled", "title": "Alienware QD-OLED显示器显示三星新技术价格高昂", "title_en": "Alienware QD-OLED monitor reveals high price of Samsung’s new tech", "transed": 1, "url": "https://arstechnica.com/gadgets/2022/02/alienware-qd-oled-monitor-reveals-high-price-of-samsungs-new-tech/", "via": "", "real_tags": ["价格", "qd", "oled"]}, {"category": "", "categoryclass": "", "imagename": "67e83f3c7a76a3f338b277f9e33f520f.jpg", "infoid": 1072795, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "&#34;AirTag旨在帮助人们定位个人物品，而不是追踪他人或其他人；我们最强烈地谴责任何恶意使用我们产品的行为；苹果说。窃贼用航空标签追踪高端汽车，跟踪者用这些设备追踪女性。苹果公司&#39；该公司昨天的最新消息承认，该公司已经&#34；曾有报道称，不良行为者试图出于恶意或犯罪目的滥用AirTag&#34;\n航空标签已经有了一些安全功能，比如当它们&#39；我已经离开他们的联网设备一天了。iPhone也会收到关于附近未知标签的警告。但哔哔声可能很难听到，而且警告的时间也明显不同。一名被跟踪的人&#34；她说，在手机第一次注意到这个流氓小玩意的四个小时后，她收到了通知；而&#34；另一些人说，他们花了几天时间才意识到一个未知的标签&34；《纽约时报》12月的一篇文章说。\n苹果表示将推出&#34；精确定位&#34；那&#34；允许接收不需要的跟踪警报的收件人精确定位未知的标签。iPhone 11、iPhone 12和iPhone 13用户将能够使用精确查找功能查看未知标签在范围内时的距离和方向。当iPhone用户移动时，Precision Finding会融合来自摄像头、ARKit、加速计和陀螺仪的输入，通过声音、触觉和视觉反馈的组合引导他们找到AirTag&#34;\n苹果表示，该更新将于#34；今年晚些时候&#34；但是没有&#39；我不知道具体的时间安排。今年晚些时候计划的其他变化如下：\n向iOS设备发送更多警报：&#34；当AirTag自动发出声音提醒附近的任何人它的存在，并被检测到与iPhone、iPad或iPod touch一起移动时，我们也会在您的设备上显示一个警报，然后您可以对其采取行动，比如播放声音或使用精确查找（如果可用）；苹果说&#34;这将有助于航空标签可能位于难以听到的位置，或者航空标签扬声器被篡改的情况&#34;\n早期警报：&#34；我们不想要的跟踪警报系统使用复杂的逻辑来确定我们如何提醒用户。我们计划更新我们不想要的跟踪警报系统，以便更早地通知用户，未知的标签或查找我的网络附件可能正与他们同行，&#34；苹果说。\n声音更大：&#34；目前，iOS用户收到不需要的跟踪警报后，可以播放声音来帮助他们找到未知的标签。我们将调整音调序列，以使用更多最响亮的音调，使未知的标签更容易找到，&#34；苹果说。", "note_en": "&#34;AirTag was designed to help people locate their personal belongings, not to track people or another person&#39;s property, and we condemn in the strongest possible terms any malicious use of our products,&#34; Apple said. Thieves have used AirTags to  track high-end cars, and stalkers have used the devices to  track women. Apple&#39;s update yesterday acknowledged that the company has &#34;seen reports of bad actors attempting to misuse AirTag for malicious or criminal purposes.&#34;\n AirTags already have some safety features, such as making beeping sounds when they&#39;ve been away from their linked devices for a day. iPhones also receive warnings about unknown AirTags nearby. But the beep can be difficult to hear, and the timing of the warnings apparently varies. One person who was tracked &#34;said she was notified four hours after her phone first noticed the rogue gadget,&#34; while &#34;others said it took days before they were made aware of an unknown AirTag,&#34;  a New York Times article in December said.\n  Apple said it will roll out &#34;precision finding&#34; that &#34;allows recipients of an unwanted tracking alert to locate an unknown AirTag with precision. iPhone 11, iPhone 12, and iPhone 13 users will be able to use Precision Finding to see the distance and direction to an unknown AirTag when it is in range. As an iPhone user moves, Precision Finding fuses input from the camera, ARKit, accelerometer, and gyroscope to guide them to the AirTag through a combination of sound, haptics, and visual feedback.&#34;\n    Apple said the update will be released &#34;later this year&#34; but didn&#39;t get more specific on timing. Other changes planned for later this year are as follows:\n More alerts sent to iOS devices: &#34;When AirTag automatically emits a sound to alert anyone nearby of its presence and is detected moving with your iPhone, iPad, or iPod touch, we will also display an alert on your device that you can then take action on, like playing a sound or using Precision Finding, if available,&#34; Apple said. &#34;This will help in cases where the AirTag may be in a location where it is hard to hear or if the AirTag speaker has been tampered with.&#34;\n Earlier alerts: &#34;Our unwanted tracking alert system uses sophisticated logic to determine how we alert users. We plan to update our unwanted tracking alert system to notify users earlier that an unknown AirTag or Find My network accessory may be traveling with them,&#34; Apple said.\n Louder tones: &#34;Currently, iOS users receiving an unwanted tracking alert can play a sound to help them find the unknown AirTag. We will be adjusting the tone sequence to use more of the loudest tones to make an unknown AirTag more easily findable,&#34; Apple said.", "posttime": "2022-02-13 03:53:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,标签,combat", "title": "苹果将通过让未知的标签更容易找到来打击航空标签跟踪", "title_en": "Apple will combat AirTag stalking by making unknown AirTags easier to find", "transed": 1, "url": "https://arstechnica.com/tech-policy/2022/02/apple-plans-airtag-alert-upgrades-to-prevent-stalking-and-other-crimes/", "via": "", "real_tags": ["apple", "苹果", "标签", "combat"]}, {"category": "", "categoryclass": "", "imagename": "9def2843fff3e285b7f9f9b0431edf43.jpeg", "infoid": 1072794, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果发布了iOS/iPadOS、macOS和watchOS的更新，主要针对漏洞和安全漏洞。\n对于大多数用户来说，iOS 15.3.1在功能上是一个小的更新。它修复了盲文显示的问题，并解决了任意代码执行漏洞。\niOS 15.3.1为iPhone提供了重要的安全更新，并修复了可能导致盲文显示停止响应的问题。\n适用于：iPhone 6s及更高版本、iPad Pro（所有型号）、iPad Air 2及更高版本、iPad第五代及更高版本、iPad mini 4及更高版本和iPod touch（第七代）\n影响：处理恶意制作的web内容可能会导致执行任意代码。苹果知道一份报告称，这个问题可能已被积极利用。\n与此同时，macOS Monterey 12.2.1主要修复了一个可能导致Mac意外耗尽电池电量的漏洞。以下是更新说明：\nmacOS 12.2.1为基于英特尔的Mac电脑提供了重要的安全更新，并修复了一个问题，即当连接到蓝牙外围设备时，可能会导致电池在睡眠期间耗尽。\n几周前，这一漏洞引起了一些媒体的关注，用户称，即使笔记本电脑处于睡眠模式且没有&#39；它没有被使用。\n这种行为的发生是因为蓝牙配件反复唤醒与之同步的Mac电脑，但苹果表示，它已经通过此次更新解决了这个问题。macOS 12.2.1还解决了与iOS 15.3.1相同的WebKit问题。苹果今天也发布了Apple Watch的watchOS 8.4.2，但只是说更新修复了漏洞并提供了安全更新，没有进一步详细说明这两个方面。\n所有这些更新现在都可用于受支持的设备。两周前，苹果推出了iOS 15.3、watchOS 8.4和macOS 12.2，这三款操作系统还专注于漏洞修复和安全更新。", "note_en": "Apple has released updates for iOS/iPadOS, macOS, and watchOS that primarily address bugs and security vulnerabilities.\n iOS 15.3.1 is a minor update, feature-wise, for most users. It fixes a problem with Braille displays and addresses an arbitrary code execution vulnerability.\n  iOS 15.3.1 provides important security updates for your iPhone and fixes an issue that may cause Braille displays to stop responding.\n  Available for: iPhone 6s and later, iPad Pro (all models), iPad Air 2 and later, iPad 5th generation and later, iPad mini 4 and later, and iPod touch (7th generation)\n Impact: Processing maliciously crafted web content may lead to arbitrary code execution. Apple is aware of a report that this issue may have been actively exploited.\n Meanwhile, macOS Monterey 12.2.1 mainly fixes a bug that could cause Macs to unexpectedly drain battery. Here are the update notes:\n    macOS 12.2.1 provides important security updates and fixes an issue for Intel-based Mac computers that may cause the battery to drain during sleep when connected to Bluetooth peripherals.\n The bug received some press attention a couple of weeks back, with users claiming that their MacBook batteries would drain to zero or close to it even when the laptops were in sleep mode and weren&#39;t being used.\n  The behavior occurred because Bluetooth accessories were repeatedly waking up Macs to which they were synced, but Apple says it has fixed the issue with this update. macOS 12.2.1 also addresses the same WebKit problem that iOS 15.3.1 does. Apple also released watchOS 8.4.2 for the Apple Watch today but simply says that the update fixes bugs and provides security updates without going into further detail on either.\n All of these updates are available to supported devices right now. They come about two weeks after  Apple pushed out iOS 15.3, watchOS 8.4, and macOS 12.2, which were also focused on bug fixes and security updates.", "posttime": "2022-02-13 03:51:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,漏洞,软件,修复", "title": "苹果修复了软件更新中Mac电池耗尽、WebKit漏洞", "title_en": "Apple fixes Mac battery drain, WebKit vulnerability in software updates", "transed": 1, "url": "https://arstechnica.com/gadgets/2022/02/apple-patches-security-holes-and-bugs-with-ios-15-3-1-and-macos-12-2-1/", "via": "", "real_tags": ["apple", "苹果", "漏洞", "软件", "修复"]}]