[{"category": "", "categoryclass": "", "imagename": "bd68e91c57248cea0f5df69174baff05.jpg", "infoid": 1067292, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从我们的谈话中与战锤remembrancer丹阿克斯特在战争宇宙中未解决的奥秘，我们现在将注意力转向科幻般的财产，一点少得多，嘉宾与eIDET记忆的聚合物邀请时间旅行和事情，正如他们所说，一点卡卡。抓住你的垃圾和步骤进入成像室，因为它＆＃39;时间谈论量子飞跃。我们很幸运足以与传奇电视制作人唐纳德P.Bellisario陷入困境，他们的名字已经归于一些最具影响力和最受欢迎的电视节目的闭幕度和＃39; 80s和＆＃39; 90年代 - 包括气利夫，magnum，pi和当然的量子跳跃。虽然他现在已经退休了，但是Bellisario赌博允许ARS电影船员与道具！ - 他加州家里的家乡​​偶然地掩饰了关于什么是容易到的最佳时间旅行表演的问题。\n 这是一个特殊的电影，如果没有比量子飞跃是一个特殊的表演。今天，感觉像另一个年龄的遗物 - 一个故事序列化的年龄是例外而不是规则，其中每赛季二十二次发作代表预期的最低限度，而商业突破的频率较少。 （几乎四十八分钟的量子飞跃时钟的第一季发作 - 比当今网络电视上的大多数小时长的Dramas大约六分钟。）量子飞跃和＃39; S 97剧集最初播出1989年至1993年，展示是我初中和早期高中经验的巨大部分 - 尽管我想看到的节目的部分是最罕见的瞥见＆＃34;未来，＆＃34;展会＆＃39; 1999年的近期瞥见了景象，其中达到了项目量子飞跃。\n    还有什么未来的是 - 霓虹灯和眨眼的未来，闪烁的灯光呈彩色塑料，＆＃39; 90年代的复古的时尚感染伴随着amok，所有人都被称为ziggy的智慧的人工智能。本周的时间旅行故事很酷，但对项目量子飞跃的总体叙述是真正迷上了我 - 山姆会回家吗？\n 虽然有谣言浮动多年来围绕Quantum飞跃重启，但我想要脾气暴躁的期望有点：唐有很多整洁的东西告诉我们，但是在这次采访中你找不到的一件事是关于是否或不是量子飞跃将会回来。这是唐＆＃39;坚定的信念，即山姆仍然存在跳跃 - 山姆已经以某种方式使有意识的选择继续这样做。正如唐把它放在那样，萨姆＆＃39;工作。\n 所以闭心的结局结局仍然存在：Sam Beckett永远不会让它回到他的Retro-Neon 1999家，他仍然在某处，与Al一起工作，努力把握曾经出错的话。\n 我希望我们能够做到更多的一集＆＃34;未解决的奥秘＆＃34;与任何人，任何人吗？敬请关注！\n  从长时间的LURKER模式下滑落到评论。谢谢你的面试李！我本可以听取几个小时的谈话。希望您的面试有助于向展示介绍一项新的观众 - 伟大的故事和对我的回忆。 \n唐是如此美好，超级娱乐。 我们在他的房子里拍了这个，电影船员在那里卷起了这个巨型的Ziggy表，我们建造了（它有时候有预算！），而不是告诉我们GTFO，他说我们可以设置 我们想要的任何地方。 我们通过连接问题（制作人和我又拨入了缩放，所以当唐往下看，他看着我和亚当在iPad上询问他的问题）和Covid预防措施，以及 最终结果很棒。 他是一个很好的运动。 我超级希望我们＆＃39; LL也能回来谈话和谈话！ ", "note_en": "Fresh from our talk with Warhammer remembrancer Dan Abnett on the  unsolved mysteries of the Warhammer universe, we now turn our attention to a science fiction property with a bit less grimdark: the one where a polymath with an eidetic memory invents time travel and things go, as they say,  a little kaka. Grab your handlinks and step into the imaging chamber because it&#39;s time to talk about  Quantum Leap. We were lucky enough to snag some time with legendary TV producer  Donald P. Bellisario, whose name has graced the closing credits of some of the most influential and popular TV shows of the &#39;80s and &#39;90s—including   Airwolf,  Magnum, P.I., and of course  Quantum Leap. Though he&#39;s now retired, Bellisario gamely agreed to allow an Ars film crew—with props!—into his California home to badger him with occasionally obscure questions about what is easily the best time-travel show ever to grace television.\n This was a special episode to film, if for no other reason than that  Quantum Leap was a special show. Today it feels like a relic from another age—an age in which story serialization was the exception rather than the rule, where twenty-two episodes per season represented the expected minimum, and where commercial breaks were a bit less frequent. (The first-season episodes of  Quantum Leap clock in at almost  forty-eight minutes—that&#39;s about six minutes longer than most hour-long dramas on network TV today!)  Quantum Leap&#39;s 97 episodes originally aired from 1989 to 1993, and the show was a huge part of my junior high and early high school experience—though the parts of the show I wanted to see most were those rare glimpses into &#34;the future,&#34; the show&#39;s infrequently glimpsed vision of 1999 where Project Quantum Leap was taking place.\n    And what a future it was—a future of neon and blinking lights, of cool blue lightning arcing across colored plastic, of &#39;90s retro-future fashion sense run amok, all overseen by an intelligent and somewhat snippy artificial intelligence named Ziggy. The time travel stories of the week were cool, but the overarching narrative about Project Quantum Leap is what really hooked me—would Sam ever return home?\n Though there have been rumors floating around for years about a   Quantum Leap reboot, I want to temper expectations a bit: Don had a lot of neat stuff to tell us, but one thing you will not find in this interview is any discussion of whether or not  Quantum Leap will be coming back. It is Don&#39;s firm belief that Sam is still out there leaping—and Sam has somehow made the conscious choice to continue doing it. It is, as Don puts it, Sam&#39;s life&#39;s work.\n So the heartbreaking ending of the series finale still stands: Sam Beckett never makes it back to his retro-neon 1999 home, and he&#39;s still out there somewhere, working with Al, striving to put right what once went wrong.\n I&#39;m hopeful that we&#39;ll be able to do at least one more episode of &#34;Unsolved Mysteries&#34; with Don— Airwolf, anyone? Stay tuned!\n  Slipping out of long time lurker mode to comment. Thank you for this interview Lee! I could have listened to Don talk for hours. Hopefully your interview helps to introduce a new audience to the show -- great stories and memories for me.\n Don was so nice—and  super accommodating. We shot this at his house, and the film crew rolled up there with this giant Ziggy table that we built (it&#39;s nice having a budget sometimes!), and rather than telling us to GTFO, he said we could set up anywhere we wanted. We fought through connection issues (the producer and I were both dialed in on Zoom, so when Don is looking down and to his left, he&#39;s looking at me and Adam asking him questions on an iPad) and COVID precautions, and the end result was great. He was such a good sport.  I am super hopeful we&#39;ll get to come back and talk Airwolf, too!", "posttime": "2021-06-22 05:06:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "奥秘,mysteries,飞跃", "title": "未解决的奥秘：Quantum Leap的Don Bellisario关于Sam Beckett的命运 ", "title_en": "Unsolved Mysteries: Quantum Leap’s Don Bellisario on the fate of Sam Beckett", "transed": 1, "url": "https://arstechnica.com/gaming/2021/05/don-bellisario-talks-to-ars-about-the-unsolved-mysteries-of-quantum-leap/", "via": "", "real_tags": ["奥秘", "mysteries", "飞跃"]}, {"category": "", "categoryclass": "", "imagename": "206fce28dba96669416b7b23d34359b2.jpeg", "infoid": 1067291, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一些选择在热浪期间远程提高恒温器温度的程序的一些德克萨斯州居民令人遗憾的是上周的决定。\n 多个州的电力公司提供促销，将用户注册到服务，让公司远程调整智能恒温器＆＃39;当能量需求很高时，温度几度。这些程序显然在潮热期间的预期工作，其中德克萨斯州（ERCOT）的电力可靠性委员会要求将恒温器设定为78°F（26°C）或更高以切割电力使用。但是，一些居民们没有意识到它们的＆＃39;根据当地的新闻报道，通过惊喜而签约。\n 鹿公园居民勃兰登称他的妻子和他们的女儿，包括一个3个月大的，＆＃34;醒来出汗＆＃34;根据周四的康文故事，下午午睡后，他们的恒温器已经远程升至78°。英国人说他在发现远程操作后，从程序中未提交家庭和＃39; S恒温器。\n ＆＃34;我想和＃39想要为我控制我的东西......如果其他人可以操纵这个，我不是为了它，＆＃34;他说，据康次说。\n Galveston的Karen Rogers也显然没有意识到她的家人已经注册了远程温度变化计划。在家庭之后＆＃39;家＆＃34;变得明显炎热和不舒服，＆＃34;罗杰斯说她＆＃34;发现了一项活动日志，它表示，储蓄事件由公用事业公司发起，＆＃34;根据KPRC。 KPRC写道，她说她选择退出该计划。\n 除了由于热浪而产生远程变化外，电力公司还称为中心点能源，表示它还进行了两次举起家庭＆＃39的两次测试。一次温度三小时。中心点表示，它在上周周三进行了一个这样的测试，这恰好是在一个非常炎热的日子里。但这些计划的主要目的是在极端天气期间降低电力。\n     罗杰斯显然是由一家姓名为基础的公司经营的服务，该公司称为Energyhub，与恒温器制造商和电力公司合同。公司＆＃39; S系统可以远程将温度更改为高达4°F（2.2°C），而Energyhub估计在德克萨斯州，＆＃34;将于6月1日至9月30日将有两到八个调整事件， 2021。＆＃34; \n＆＃34;通过参加该计划，您同意允许EnergyHub，Inc。和您的恒温器提供商远程访问恒温器，以便在夏季峰值电力需求时期对恒温器温度设定进行简短的调整。您可以通过看到减少的电费，＆＃34受益。 EnergyHub网站说。客户＆＃34;可以只需将恒温器设置重置为您想要的任何温度，从恒温器，移动设备或Web应用中选择。＆＃34;\n Energyhub与巢，Ecobee和其他恒温器合作，该公司已在全国范围内达成约50家公用事业。 ＆＃34;您的实用程序可以使用智能恒温器来使用智能恒温器来创建更智能的电网。看看您所在地区是否提供了一个程序，并开始奖励奖励，＆＃34; Energyhub＆＃39; s＆＃34;注册我的恒温器＆＃34;页面说。\n 一个能量空间交易提供了5,000美元的抽奖活动，以换取注册，但这是唯一的签名客户的方法。\n ＆＃34;恒温器所有者通常通过移动应用程序或电子邮件从他们的设备制造商或能源提供商获得要约，[客户解决方案Erika的Energyhub VP]钻石表示，和＃39;每个参与者都积极同意该计划的条款，可以随时从需求 - 响应事件中选择，＆＃39;＆＃34;根据商业内幕。\n  休斯顿地区居民抱怨Reddit线程中的远程温度变化。虽然一个人写道，＆＃34;这听起来像是当你得到补贴恒温器时会发生什么，＆＃34;其他人表示，尽管他们自己购买了智能恒温器，但它发生在他们身上。 ＆＃34;我有一个巢，自购买，没有注册任何类型的节能计划或任何东西，＆＃34;一人写道。\n    ＆＃34;我从亚马逊购买的Ecobee自动注册了我们的Eco +功能集中，其中包含一个名为＆＃39;社区节能＆＃39;我们无法关闭，＆＃34;另一个人写道。 ＆＃34;它将基于埃尔思的指令随机调整我们的恒温器。它需要Ecobee几个月来从计划中取消联票。我们几乎回到了一个简单的哑铃恒温器，因为它花了很长时间才能解决它。＆＃34;\n 该线程包括一些辩论，这些辩论是否自动在不阅读细节的情况下自动注册或单独选择。运营这些计划的公司表示用户必须提供同意。 \nECOBEE与公用事业合作伙伴，为其社区节能计划进行远程温度变化。 Ecobee表示用户能够节省社区能源节省的过程包括从列表中选择用户＆＃39; S实用程序提供程序，查看提供商的报价，然后单击＆＃34; OK＆＃34;注册。\n 社区节能是ECOBEE＆＃39; S ECO +程序的一部分，包括其他几个功能。 ＆＃34;在您注册计划后，Eco +无法完全禁用。但是，您仍然可以禁用当天或一周。只有在通过联系您的实用程序或其计划管理器，＆＃34，才能永久禁用ECO +才能永久禁用; Ecobee说。\n  EnergyHub使其远程恒温器在电力公司方向上变化。 ＆＃34;当中心点能量或其他实用程序时，根据高温或高需求启动缩减事件，Energyhub然后通过招收到其程序的客户来启动能源缩减，＆＃34;中心点能量上周告诉KPRC。\n 在某些情况下，这是作为测试的一部分而不是由于极端天气事件而进行。中心点能量表示，它进行了＆＃34;测试缩减事件＆＃34;每年两次，最近发生在6月16日星期三下午5点到下午5点。中心能源表示，它通过第三方服务提供商提供能量效率计划，因为＆＃34;德克萨斯州法律可以防止我们直接向住宅客户提供计划。＆＃34;\n 同时，San Antonio的CPS能量提供了每恒温器85美元的一次性账单信用卡，当客户注册其计划时，并说明＆＃34; [D]威胁夏季峰值能源需求日，我们可能会简要调整恒温器设置通过几步......您可以通过手动调整恒温器或通过恒温器＆＃39;＆＃34来选择通过手动调整峰值需求事件。＆＃34; ", "note_en": "Some Texas residents who opted into programs that remotely raise thermostat temperatures during heat waves regretted that decision last week.\n Power companies in multiple states offer promotions to enroll users into services that let the companies remotely adjust smart thermostats&#39; temperatures by a few degrees when energy demand is high. These programs apparently worked as intended during a heat wave in which the Electric Reliability Council of Texas (ERCOT)  requested that thermostats be set at 78°F (26°C) or higher to  cut electricity use. But some residents who didn&#39;t realize what they&#39;d signed up for were taken by surprise, according to local news reports.\n Deer Park resident Brandon English said his wife and their daughters, including a 3-month-old, &#34;woke up sweating&#34; after an afternoon nap during which their thermostat had been remotely raised to 78°, according to a  KHOU story on Thursday. English said he unenrolled the family&#39;s thermostat from the program after discovering that it was being operated remotely.\n &#34;I wouldn&#39;t want anybody else controlling my things for me... If somebody else can manipulate this, I&#39;m not for it,&#34; he said, according to KHOU.\n Karen Rogers of Galveston also apparently didn&#39;t realize that her family had signed up for a remote temperature-change program. After the family&#39;s home &#34;became noticeably hot and uncomfortable,&#34; Rogers said she &#34;found an activity log, and it said that a saving event was initiated by the utility company,&#34;  according to KPRC. She said she then opted out of the program, KPRC wrote.\n In addition to making remote changes because of heat waves, a power company called CenterPoint Energy said it also conducts twice-yearly tests that raise homes&#39; temperatures for three hours at a time. CenterPoint said it conducted one such test on Wednesday last week, which happened to be during a stretch of very hot days. But the main purpose of these programs is to lower electricity use during extreme weather.\n     Rogers was apparently enrolled in a service run by a New York-based company called  EnergyHub, which contracts with thermostat makers and power companies. The company&#39;s  system can remotely change the temperature by up to 4°F (2.2°C), and EnergyHub estimates that in Texas, &#34;there will be two to eight adjustment events from June 1st through September 30, 2021.&#34;\n &#34;By participating in the Program, you agree to allow EnergyHub, Inc. and your thermostat provider to remotely access your thermostat to make brief, limited adjustments to your thermostat temperature setting at times of peak electricity demand in the summer. You may benefit by seeing a reduced electricity bill,&#34; the EnergyHub website says. Customers &#34;can opt out from your thermostat, mobile device, or web app simply by resetting your thermostat setting to any temperature that you desire.&#34;\n EnergyHub works with  Nest, Ecobee, and other thermostats, and the company has deals with about 50 utilities nationwide. &#34;Your utility may pay you for using your smart thermostat to create a smarter electric grid. See if a program is available in your area and start earning rewards today,&#34; EnergyHub&#39;s &#34;Enroll my thermostat&#34;  page says.\n One EnergyHub deal offers entries into a $5,000 sweepstakes in exchange for enrolling, but that isn&#39;t the only method for signing up customers.\n &#34;Thermostat owners typically get an offer to participate in the program from their device manufacturer or energy provider via mobile app or email, [EnergyHub VP of customer solutions Erika] Diamond said, and &#39;every participant actively agrees to the terms of the program and can opt out of a demand-response event at any time,&#39;&#34;  according to Business Insider.\n  Houston-area residents complained about the remote temperature changes in a  Reddit thread. While one person wrote, &#34;This sounds like what happens when you get the subsidized thermostat,&#34; others said it happened to them despite purchasing a smart thermostat on their own. &#34;I have a Nest, self purchased, did not sign up for any type of energy saving program or anything,&#34; one person wrote.\n    &#34;My Ecobee that I purchased from Amazon automatically enrolled us in Eco+ feature set which has a setting called &#39;Community Energy Savings&#39; which we could not turn off,&#34; another person wrote. &#34;It would randomly adjust our thermostat based on directives from ERCOT. It took Ecobee months to unenroll us from the program. We almost went back to a simple dumb thermostat because it took them so long to fix it.&#34;\n The thread included some debate over whether these users had been automatically enrolled or opted in themselves without reading the details. Companies that operate these programs say that users must provide their consent.\n Ecobee partners with utilities for its  Community Energy Savings program that does remote temperature changes. Ecobee  says the process in which a user enables Community Energy Savings includes selecting the user&#39;s utility provider from a list, viewing an offer from the provider, and then clicking &#34;OK&#34; to enroll.\n Community Energy Savings is part of Ecobee&#39;s Eco+ program, which includes several other features. &#34;Eco+ cannot be disabled entirely once you have enrolled in a program. However, you can still disable it for the day or for the week. Eco+ can be disabled permanently only if you unenroll from the program by contacting your utility or its program manager,&#34; Ecobee says.\n  EnergyHub makes its remote thermostat changes at the direction of power companies. &#34;When CenterPoint Energy, or another utility, initiates a curtailment event based on high temperatures or high demand, EnergyHub then starts the energy curtailment through the customers it has enrolled in its program,&#34;  CenterPoint Energy told KPRC last week.\n In some cases, this is conducted as part of a test rather than due to an extreme weather event. CenterPoint Energy said it conducts &#34;a test curtailment event&#34; twice per year and that the most recent occurred on Wednesday, June 16 from 2 pm to 5 pm local time. CenterPoint Energy said it offers energy-efficiency programs through third-party service providers because &#34;Texas law prevents us from offering programs directly to residential customers.&#34;\n San Antonio-based CPS Energy, meanwhile, offers a one-time bill credit of $85 per thermostat when customers enroll in its program,  saying that &#34;[d]uring summer peak energy demand days, we may briefly adjust your thermostat settings by a few degrees... You can opt out of participating in a peak demand event by manually adjusting your thermostat or through your thermostat&#39;s app.&#34;", "posttime": "2021-06-22 05:06:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "远程,regret,恒温器", "title": "德克萨斯州遗憾地选择远程提高恒温器的动力计划 ", "title_en": "Texans regret opting into power plan that remotely raises thermostat temps", "transed": 1, "url": "https://arstechnica.com/tech-policy/2021/06/texans-regret-opting-into-power-plan-that-remotely-raises-thermostat-temps/", "via": "", "real_tags": ["远程", "regret", "恒温器"]}, {"category": "", "categoryclass": "", "imagename": "cc947b66d9037b70d8bb601b4c51362e.jpeg", "infoid": 1067290, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "iOS中有一个错误，当设备加入使用笨蛋名称的网络时，禁用Wi-Fi连接，这是一个周末披露的研究员。\n 通过连接到使用SSID“％p％s％s％s％s％的Wi-Fi网络”（不包括引号），iPhone和iPad失去了加入该网络或前进的任何其他网络的能力，逆向工程师Carl Schou在Twitter上报道。\n 在将我的个人WiFi加入SSID“％p％s％s％s％s％之后”后，我的iPhone永久禁用它是WiFi功能。既不重新启动也不改变SSID修复它：〜）pic.twitter.com/2eue90jfu3\n -  Carl Schou（@VM_Call）6月18日，2021年\n    Schou是黑客资源秘密俱乐部的所有者，最初没有看到恢复Wi-Fi功能的简单方法。最终，他发现用户可以通过打开设置和gt来重置网络功能;一般＆gt;重置＆gt;重置网络设置。\n Apple代表没有回复电子邮件问题，包括如果有计划修复错误以及它是否影响了麦克斯或其他苹果产品。\n Schou在Internet消息中说，错误是由IOS Wi-Fi守护程序中的内部日志记录功能引起的，它在格式表达式中使用SSID。在某些情况下，该条件使得未经授权的格式字符串被注入到高强化苹果操作系统的敏感部分中。然而，他和其他安全专家说，恶意剥削的错误几乎没有机会。 \n“在我看来，真实世界的威胁很少，因为你被SSID的长度和格式表达自己的长度受到了限制，”他解释道。 “您可能会将其转化为记录器中的信息披露，但我认为甚至可以远程可以获得代码。”\n 快速分析外部研究人员的错误同意，可能会被利用错误来执行恶意代码。分析还发现，该错误似乎源于iOS记录组件中的漏洞，该组件使用芯点函数在将SSID字符串转换为格式字符串之前，然后在将其写入日志文件之前。\n 因为字符串未回应IOS的敏感部分，所以黑客不太可能在恶意地滥用测井功能。除此之外，漏洞利用需要一个人积极加入包含可疑名称的网络。\n “对于剥削性，它不会回声，并且其余的参数似乎似乎是可控的，”研究人员写道。 “因此，我认为这种情况不会被利用。毕竟，要触发此错误，您需要连接到该WiFi，其中SSID对受害者可见。一个网络钓鱼Wi-Fi门户网站页面也可能更有效。“\n  并非所有研究人员都达到了同样的评估。例如，安全公司Aireye的研究人员表示，该技术可用于绕过坐在网络周边的安全设备，以阻止未经授权的数据进入或退出。\n “我们发现的是，虽然最新的iPhone格式弦乐栏被认为是看似良性的，但这种漏洞的影响远远超过任何开玩笑物，”Aireye研究员Amichai Shulman写道。 “如果您对组织的安全性负责，您应该了解此漏洞，因为相关攻击可能会影响公司数据，同时绕过NAC，防火墙和DLP解决方案等共同安全控制。”\n    Shulman还表示，MacOS受到同样突发的影响。 ARS无法立即核实这一索赔。 Schou说他没有测试麦克斯，但其他人报告他们无法在操作系统上重现错误。 \nSchou告诉我，每次IOS设备连接到恶意SSID时，网络崩溃都不会发生网络崩溃。 “它的非法，有时你很幸运，无线网络上的守护程序在没有它的情况下崩溃[在] SSID，”他解释说。由于至少在3月份发布的iOS 14.4.2之前，缺陷已存在，并且可能在此之前可能。\n 他说，当他将iPhone连接到他的一个无线路由器时，他发现了这个错误。 “我所有的设备都以各种注射技术命名，以便与不消毒输入的旧设备混淆，”Schou说。 “显然，最新的ios。”\n 崩溃是由研究人员称之为不受控制的格式字符串错误引起的。当损坏的用户输入是以C和C样式语言编写的某些功能中的格式字符串参数出现漏洞。在某些情况下，使用格式令牌（例如％s和％x）可以在某些情况下打印到存储器。该错误最初被认为是无害的。最近，研究人员已经认识到使用％N格式令牌编写恶意代码的可能性。\n 这个错误最令人惊讶的是它根本存在的事实。存在广泛的编程指南，以防止这些类型的格式串漏洞。可以说是世界上最安全的消费者操作系统在2021年充分实现这些技术的故障是这里的真实故事。 ", "note_en": "There’s a bug in iOS that disables Wi-Fi connectivity when devices join a network that uses a booby-trapped name, a researcher disclosed over the weekend.\n By connecting to a Wi-Fi network that uses the  SSID “%p%s%s%s%s%n” (quotation marks not included), iPhones and iPads lose the ability to join that network or any other networks going forward, reverse engineer Carl Schou  reported on Twitter.\n After joining my personal WiFi with the SSID “%p%s%s%s%s%n”, my iPhone permanently disabled it’s WiFi functionality. Neither rebooting nor changing SSID fixes it :~)  pic.twitter.com/2eue90JFu3\n— Carl Schou (@vm_call)  June 18, 2021\n    Schou, who is the owner of hacking resource  Secret Club, initially saw no easy way to restore Wi-Fi capabilities. Eventually, he found that users could reset network functionality by opening Settings &gt; General &gt; Reset &gt; Reset Network Settings.\n Apple representatives didn’t respond to emailed questions, including if there were plans to fix the bug and whether it affected macOS or other Apple offerings.\n Schou said in an Internet message that the bug is caused by the internal logging functionality in the iOS Wi-Fi daemon, which uses the SSID inside of format expressions. The condition makes it possible in some cases for unauthorized format strings to be injected into sensitive parts of the highly fortified Apple OS. He and other security experts, however, said there was little chance of the bug being exploited maliciously.\n    “In my opinion, the real-world threat is minimal as you are quite constrained by the length of the SSID and the format expression itself,” he explained. “You could potentially turn this into an information disclosure in the logger, but I do not think it is even remotely possible to get code execution.”\n A  quick analysis of the bug by an outside researcher agreed that it isn’t likely the bug could be exploited to execute malicious code. The analysis also found that the bug appears to stem from a flaw in an iOS logging component that uses the  concat function to effectively convert the SSID string into a format string before writing it to the log file.\n Because the strings aren’t echoed to sensitive parts of the iOS, a hacker is unlikely to succeed in abusing the logging feature maliciously. Besides that, an exploit would require a person to actively join a network that contains a suspicious-looking name.\n “For the exploitability, it doesn’t echo and the rest of the parameters don’t seem to be controllable,” the researcher wrote. “Thus I don’t think this case is exploitable. After all, to trigger this bug, you need to connect to that WiFi, where the SSID is visible to the victim. A phishing Wi-Fi portal page might as well be more effective.”\n  Not all researchers reached the same assessment. Researchers from security firm AirEye, for instance,  said that the technique could be used to bypass security appliances that sit at the perimeter of a network to block unauthorized data from entering or exiting.\n “What we found was that although the latest iPhone Format String flaw is perceived as seemingly benign, the implications of this vulnerability stretch far and beyond any joking matter,” AirEye researcher Amichai Shulman wrote. “If you are responsible for the security of your organization, you should be aware of this vulnerability as a related attack can affect corporate data while bypassing common security controls such as NAC, firewalls and DLP solutions.”\n    Shulman also said that macOS is affected by the same bug. Ars couldn’t immediately verify this claim. Schou said he hasn’t tested macOS but that others have reported they were unable to reproduce the error on the OS.\n  Schou told me that the network crashes don’t happen every time an iOS device connects to a malicious SSID. “It&#39;s nondeterministic, and sometimes you are lucky enough that the Wi-Fi daemon crashes without it persisting [in] the SSID,” he explained. The flaw has existed since at least iOS 14.4.2, which was released in March, and possibly for years before that.\n He said he discovered the bug when he connected an iPhone to one of his wireless routers. “All of my devices are named after various injection techniques to mess with old devices that do not sanitize input,” Schou said. “And apparently, the latest iOS.”\n The crash is caused by what researchers call a  uncontrolled format string bug. The flaw arises when corrupted user input is the format string parameter in certain functions written in C and C-style languages. Use of format tokens such as %s and %x can in some cases print data to memory. The bug was initially considered harmless. More recently, researchers have recognized the potential for writing malicious code using the %n format token.\n The most surprising thing about this bug is the fact that it exists at all. A wide assortment of programming guidelines exists for preventing these types of format string flaws. The failure of what’s arguably the world’s most secure consumer OS to adequately implement these techniques in 2021 is the real story here.", "posttime": "2021-06-22 05:05:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "iphone,恶意,malicious,错误", "title": "连接到恶意Wi-Fi网络可以混淆您的iPhone ", "title_en": "Connecting to malicious Wi-Fi networks can mess with your iPhone", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/06/connecting-to-malicious-wi-fi-networks-can-mess-with-your-iphone/", "via": "", "real_tags": ["iphone", "恶意", "malicious", "错误"]}, {"category": "", "categoryclass": "", "imagename": "eccd891199f74db69b95f9a68e76cbf1.jpeg", "infoid": 1067289, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新的研究表明，＆＃34;第二脑和＃34;在你的肠道中至少有十几种神经元。\n   科学家们已经知道多年来，在你的长期蜿蜒的人体消化道中，是一种自主神经元的“第二大脑” - 但是在他们对所谓的腹部脑结束的地方的情况下，＆＃39;\n 现在，在新的研究中，科学家在小鼠的肠道神经系统（ENS）中已经编目了12种不同的神经元。这种“基础知识”解锁了新实验和调查结果的大量路径。\n  肠道大脑极大地影响了你身体的工作原理。您的消化系统每天都有作为新陈代谢的一部分，但它也会受到功能的波动，与您的情绪有关。\n 消化症状和焦虑可以是可融合的，你的肠道受到压力的严重影响。因此，科学家认为更好地了解您的奴役中会发生的事情可能导致更好的药物和治疗方法，以及改善ENS和中枢神经系统之间的连接知识。\n 此内容从{eMed-name}导入。您可以以另一种格式找到相同的内容，或者您​​可以在其网站上找到更多信息。\n  新的研究出现在自然神经科学中。在一个相关的评论中，科学家朱莉娅·甘泉解释了研究人员发现的以及为什么这么重要： \n“使用单细胞RNA测序来简要开发和少年奴隶，作者在奴役中发现了一种概念上新的神经元多样化模型，并基于血清的分子标记建立了肠道神经元的新分子分类。”\n  神经元多样化发生在，嗯，所有有神经元的生物。类似于干细胞，神经元首先发展为更通用的“空白”，然后成为功能性专业。人脑具有像感官和运动神经元的类型，每个类型都有亚型。事实上，有这么多的亚型，科学家们不确定如何完全目录。\n 相同浅表型的神经元在大脑中不同于脑干 - 更不用说在消化道中。因此，研究人员必须开始始于开始，并追踪这些神经元的发展方式。它们跟踪RNA，该RNA确定DNA如何在身体制造的细胞中表达，遵循Neuron在出生前后形成的神经元。有些专业在子宫中出现，部分分裂并形式。\n  为了找到这一新信息，科学家们开发了一种更精细的方式来分离和识别细胞。 Ganz解释：\n “使用与已建立的标志物的广泛共染色，它们能够将十二个神经元类与先前发现的功能性肠道神经元类型的分子特征联系起来，从而将ENC分类为兴奋性和抑制的运动神经元，中间核素和内在主要传入神经元。”\n 通过更尖锐的协议和新信息，研究人员能够在现有的ENS神经元知识的身体上确认和扩展。现在，他们可以努力找出12个ENS神经元类型的每个人都是负责的。\n 通过使用遗传信息隔离不同类型和“切换”它们，科学家可以尝试识别鼠标终止功能缺失的内容。研究这些基因可能导致使用干细胞或RNA控制有害基因表达的新治疗方法。 \n此内容由第三方创建和维护，并导入本页以帮助用户提供其电子邮件地址。 您可以在Piano.io找到有关此产品和类似内容的更多信息 ", "note_en": "New research reveals that  the &#34;second brain&#34; in your gut has at least a dozen kinds of neurons.\n   Scientists have known for years that there’s a “second brain” of autonomous neurons in your long, winding human digestive tract—but that&#39;s about where their knowledge of the so-called abdominal brain ends.\n Now, in new research, scientists have   catalogued 12 different kinds of neurons in the enteric nervous system (ENS) of mice. This “fundamental knowledge” unlocks a huge number of paths to new experiments and findings.\n  The   gut brain greatly affects on how you body works. Your digestive system has a daily job to do as part of your metabolism, but it’s also subject to fluctuations in functionality, and otherwise related to your emotions.\n Digestive symptoms and anxiety can be comorbid, and your gut is heavily affected by stress. So scientists believe having a better understanding of what happens in your ENS could lead to better medicines and treatments for a variety of conditions, as well as improved knowledge of the connection between the ENS and central nervous system.\n This content is imported from {embed-name}. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n  The   new research appears in  Nature Neuroscience. In a related commentary, scientist Julia Ganz explains what the researchers found and   why it’s so important:\n “Using single-cell RNA-sequencing to profile the developing and juvenile ENS, the authors discovered a conceptually new model of neuronal diversification in the ENS and establish a new molecular taxonomy of enteric neurons based on a plethora of molecular markers.”\n  Neuronal diversification happens in, well, all the organisms that  have neurons. Similar to stem cells, neurons develop first as more generic “blanks” and then into functional specialties. The human brain has types like sensory and motor neurons, each of which has subtypes. There are so many subtypes, in fact, that scientists   aren’t sure how to even fully catalog them yet.\n Neurons of the same superficial type are different in the brain versus the brain  stem—let alone in the digestive tract. So researchers had to start at the very beginning and trace how these neurons develop. They tracked RNA, which determines how DNA is expressed in the cells made by your body, to follow how neurons formed both before and after birth. Some specialties emerge in utero, and some split and form afterward.\n  To find this new information, the scientists developed a finer way to separate and identify cells. Ganz explains:\n “Using extensive co-staining with established markers, they were able to relate the twelve neuron classes to previously discovered molecular characteristics of functional enteric neuron types, thus classifying the ENCs into excitatory and inhibitory motor neurons, interneurons, and intrinsic primary afferent neurons.”\n With a sharper protocol and new information, the researchers were able to confirm and expand on the existing body of ENS neuron knowledge. And now they can work on finding out what each of the 12 ENS neuron types is responsible for, they say.\n By isolating different kinds and “switching” them on or off using genetic information, scientists can try to identify what’s missing from the function of the mouse ENS. And studying these genes could lead to new treatments that use stem cells or RNA to control the expression of harmful genes.\n   This content is created and maintained by a third party, and imported onto this page to help users provide their email addresses. You may be able to find more information about this and similar content at piano.io", "posttime": "2021-06-22 04:58:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,现在,brain,神经元", "title": "嘿，你的肠道里有一个第二个大脑，现在科学家知道它是如何工作的 ", "title_en": "Hey, There's a Second Brain in Your Gut And now scientists know how it works", "transed": 1, "url": "https://www.popularmechanics.com/science/health/a34934637/gut-brain-science/", "via": "", "real_tags": ["科学家", "现在", "brain", "神经元"]}, {"category": "", "categoryclass": "", "imagename": "6a8f5cfe286eb1acac59e7b2787eb3c3.jpg", "infoid": 1067288, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "HTTP://CV PR2021.挖到.vision/ ", "note_en": "http://cvpr2021.wad.vision/", "posttime": "2021-06-22 04:58:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,车辆,karpathy,cv", "title": "Andrej Karpathy（特斯拉）：CVPR 2021自动车辆研讨会[视频] ", "title_en": "Andrej Karpathy (Tesla): CVPR 2021 Workshop on Autonomous Vehicles [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=NSDTZQdo6H8", "via": "", "real_tags": ["特斯拉", "车辆", "karpathy", "cv"]}]