[{"category": "", "categoryclass": "", "imagename": "4684029729b57ca2680c9c1f77cf8b46.jpg", "infoid": 1030663, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司表示，截至季度末，总共有2870万客户有资格流媒体他们的HBO Max订阅。\n其中，2510万份来自“批发”协议--这意味着某种付费电视提供商，比如康卡斯特、Charge、Verizon[TechCrunch的母公司]，或者AT&amp；T自己的DirecTV。但只有362.5万是直接的“零售”订户。\nHBO和HBO Max加在一起，在美国的订户超过3800万，在全球的订户超过5700万。报道称，3800万人的数字使该公司领先于之前宣布的3600万人的年终目标。\n然而，仅凭AT&amp；T的数据并不能真实反映谁在看HBO Max内容。\n美国电话电报公司(AT&amp；T)吹捧其季度“活动”，但没有澄清只有一小部分客户选择每月支付15美元订阅HBO Max，从而直接注册HBO Max。更大一部分人只是通过他们现有的HBO订阅获得了观看流媒体服务的资格-但许多人还没有登录并真正流媒体。\n事实上，在这860万个新的“激活”中，有很大一部分可能甚至还不知道HBO Max的存在-特别是如果这项服务在他们最喜欢的流媒体平台上不可用，比如Roku。或者他们可能知道它的存在，但在Roku上找不到，所以他们认为它只是还没有推出。\nRoku最终将这个问题掌握在自己手中，现在正在通过在其新设备上增加对AirPlay 2的支持来绕过陷入僵局的谈判。这将为苹果客户提供一种从Roku平台本身没有推出的应用程序进行流媒体播放的方式。\nAT&amp；T还表示，它将继续投资HBO Max，第三季度在这项服务上投入了约6亿美元，使其今年迄今的投资达到13亿美元。预计到年底，该公司的投资将达到20亿美元。\n该公司还表示，新平台上的消费者参与度表现良好，比HBO Now的水平上升了近60%。但它几乎没有提供其他衡量成功的标准，除了说它的“图书馆”图书在客户群中“表现得令人难以置信地强劲”。此外，只有一两条租赁内容进入了HBO Max的前10名，但AT&amp；T承认，它本可以推出更多原创节目。\n在产品方面，美国电话电报公司(AT&amp；T)表示，它将每45天推出一次软件更新，以改善该应用的用户界面和可用性。它仍在按计划在2021年推出广告支持版的服务(AVOD)，并在国际上扩张。\nAT&amp；T首席执行官约翰·斯坦基(John Stankey)解释说：“AVOD不仅能让我们扩大服务范围(以及我们放在平台上的内容数量)，还能让我们达到不同的价位，吸引不同的细分市场。因此，我们认为这将是我们重要的市场扩张能力。”", "note_en": "In total, 28.7 million customers were eligible to stream their  HBO    Max   subscription by the end of the quarter, the company said.\n Of these, 25.1 million came from  “wholesale” agreements — meaning a pay TV provider of some kind, like Comcast, Charter, Verizon [TechCrunch’s parent], or AT&amp;T’s own DirecTV, for example. But only 3.625 million were direct “retail” subscribers.\n  Combined, both HBO and HBO  Max   topped 38 million subscribers in the U.S. and 57 million worldwide. The 38 million figure put the company ahead of its previously announced year-end target of 36 million, the report said.\n However, AT&amp;T’s numbers alone don’t paint a true picture of who’s really watching HBO Max content.\n AT&amp;T touts its quarterly “activiations” without clarifying that only a small portion of customers are choosing to sign up for HBO Max directly by paying $15 per month for a subscription. A larger portion are simply becoming eligible to watch the streaming service through their existing HBO subscriptions — but many haven’t yet signed in and actually streamed.\n In fact, some significant portion of these 8.6 million new “activations” may not yet even know that HBO Max exists — especially if the service is unavailable on their favorite streaming platform, like Roku. Or they may know it exists but can’t find it on Roku, so they think it just hasn’t launched.\n Roku finally took this issue into its own hands, and is now working around the stalled  negotiations by adding support for  AirPlay 2 on its newer devices. This will give Apple customers a way to stream from apps that haven’t launched on the Roku platform itself.\n AT&amp;T also said it’s continuing to invest in HBO Max, having poured around $600 million in the service during Q3, bringing its investment to $1.3 billion for the year so far. And it’s on track for an estimated investment of $2 billion by year-end.\n The company also said consumer engagement on the new platform was doing well, up nearly 60% from HBO Now levels. But it offered few other metrics of success, other than saying its “library” titles have been “performing incredibly strong” with its customer base. In addition, only 1 or 2 pieces of leased content have made it into the HBO Max top 10, but AT&amp;T admitted it could have launched with a stronger slate of original programs.\n On the product side, AT&amp;T said it would be pushing out software updates every 45 days to improve the user interface and usability of the app. And it’s still on track to launch an advertising-supported version of the service (AVOD)  in 2021, as planned, and expand internationally.\n “AVOD not only allows us to broaden the offering [and] the amount of content we put on the platform,” explained AT&amp;T CEO John Stankey, “it allows us to hit a different price point and attract different segments of the market and as a result of that we think that will be an important market expansion capability for us,” he said.", "posttime": "2020-10-23 04:35:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "hbo,max", "title": "\nHBO Max在第三季度达到2870万订户，但很少有人过头", "title_en": "\n\t\t\t\tHBO Max hits 28.7M subscribers in Q3, but few are over-the-top\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/22/hbo-max-hits-28-7m-subscribers-in-q3-but-few-are-over-the-top/", "via": "", "real_tags": ["hbo", "max"]}, {"category": "", "categoryclass": "", "imagename": "005b3fddbd7f34614ab10e8830043d1b.jpeg", "infoid": 1030662, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英特尔股价周四在盘后交易中下跌多达10%，此前该公司公布的第三财季获利强于分析师预期，但显示其数据中心业务出现新的疲软。\n根据Refinitiv的数据，调整后每股收益为1.11美元，而分析师预期为每股1.11美元。\n总体而言，英特尔在截至9月1日的季度中的收入。26，根据一份声明，按年率计算下降了4%。\n英特尔数据中心集团的营收为59.1亿美元，下降了7%，低于FactSet普遍预期的62.1亿美元。英特尔表示，由于冠状病毒大流行，企业和政府的收入在连续两个季度增长30%以上后下降了47%，但该季度云收入增长了15%。\n英特尔最大的业务是销售个人电脑芯片的客户计算集团(Client Computing Group)，创造了98.5亿美元的收入，同比增长1%，高于FactSet调查分析师普遍预期的90.9亿美元。本月早些时候，科技研究公司Gartner估计，第三季度个人电脑出货量增长3.6%，因为人们继续购买机器在家工作和学习。\n英特尔的非易失性存储器解决方案部门的收入为11.5亿美元，下降了约11%，低于市场普遍预期的15亿美元。周二，韩国内存制造商SK hynix表示，将以90亿美元收购该部门的一部分，即英特尔的NAND存储和存储业务。\n英特尔的营业利润率从去年同期的33.6%收窄至27.6%。数据中心集团的运营利润率从49%下降到32%。\n在指引方面，英特尔表示，预计第四财季调整后每股收益为1.10美元，营收为174亿美元。营收预估暗示下滑约14%。接受Refinitiv调查的分析师此前预计调整后每股收益为1.07美元，营收为173.6亿美元。\n在本季度，英特尔宣布工程主管Murthy Renduchintala离职，并表示麦肯锡高管Safroadu Yeboah-Amankwah将加盟，担任首席战略官。\n在本季度，英特尔没有宣布其增加女性和少数族裔担任领导职位的目标的进展情况。该公司上一次发布统计数据是在去年12月，称其全球员工中有72.6%是男性，61.2%的美国员工是白人或亚洲人。\n剔除盘后变动，英特尔股价自2020年初以来下跌了约10%，而标准普尔500指数上涨了7%。\n高管们将在下午5点开始的电话会议上与分析师讨论结果。东部时间。", "note_en": "Intel shares fell as much as 10% in extended trading on Thursday after the company reported fiscal third-quarter earnings that were stronger than analysts had expected but showed new weakness in its data center business.\n  Earnings: $1.11 per share, adjusted, vs. $1.11 per share as expected by analysts, according to Refinitiv.\n  Overall, Intel&#39;s revenue in the quarter, which ended Sept. 26, declined 4% on an annualized basis, according to a  statement.\n Intel&#39;s Data Center Group came up with $5.91 billion in revenue, down 7% and less than the FactSet consensus estimate of $6.21 billion. Intel said revenue from enterprises and governments went down 47% after two quarters of growth above 30% because of the coronavirus pandemic, but cloud revenue in the quarter grew 15%.\n Intel&#39;s largest business, the Client Computing Group that sells PC chips, produced $9.85 billion in revenue, up 1% year over year and above the $9.09 billion consensus among analysts polled by FactSet. Earlier this month technology research company Gartner estimated that PC shipments grew 3.6% in the third quarter, as people kept buying machines to work and study from home.\n Intel&#39;s Non-Volatile Memory Solutions Group had $1.15 billion in revenue, down about 11% and lower that the $1.50 billion consensus. On Tuesday South Korean memory maker SK hynix  said it would buy part of that division, Intel&#39;s NAND memory and storage business, for $9 billion.\n Intel&#39;s operating margin narrowed to 27.6% from 33.6% in the year-ago quarter. Operating margin for the Data Center Group reached 32%, down from 49%.\n  With respect to guidance, Intel said it expects $1.10 in adjusted earnings per share on $17.4 billion in revenue in the fiscal fourth quarter. The revenue forecast implies a decline of about 14%. Analysts polled by Refinitiv had been looking for $1.07 in adjusted earnings per share and $17.36 billion in revenue.\n In the quarter Intel  announced the departure of engineering leader Murthy Renduchintala and  said McKinsey executive Safroadu Yeboah-Amankwah was joining as chief strategy officer.\n During the quarter Intel did not announce progress on  its goal of increasing the ranks of women and minorities in leadership positions. The company last issued  statistics in December, saying that 72.6% of its global employees were male and that 61.2% of U.S. employees were White or Asian.\n Excluding the after-hours move, Intel share are down about 10% since the beginning of 2020, while the S&amp;P 500 is up 7%.\n  Executives will discuss the results with analysts on a conference call starting at 5 p.m. Eastern time.", "posttime": "2020-10-23 04:34:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "英特尔,下降,reports", "title": "英特尔报告第三季度营收为183亿美元，同比下降4%，而预计为182.4亿美元，数据中心集团营收为59亿美元，同比下降7%；股价盘后下跌10%以上", "title_en": "Intel reports Q3 revenue of $18.3B, down 4% YoY, vs $18.24B est., and Data Center Group revenue of $5.9B, down 7% YoY; stock is down 10%+ after hours", "transed": 1, "url": "https://www.cnbc.com/2020/10/21/intel-intc-earnings-q3-2020.html", "via": "", "real_tags": ["英特尔", "下降", "reports"]}, {"category": "", "categoryclass": "", "imagename": "d44b1b726399f3d7acc5193203635023.jpg", "infoid": 1030661, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在17世纪，随着对宇宙及其内容的认识的增加，对其他行星上生命的猜测也随之增加。休·奥尔德西-威廉姆斯(Hugh Aldersey-Williams)探索的一个这样的来源是荷兰天文学家、数学家和发明家克里斯蒂安·惠更斯(Christian Huygen)，他早期在概率方面的工作为他对外星生命可能是什么样子的非常现代的评估铺平了道路。\n当这个世界的情况看起来很黯淡时，也许很自然地会把一个人的注意力转向其他世界的情况。这就是荷兰天文学家克里斯蒂安·惠更斯在17世纪80年代末所做的事情。他曾在巴黎担任路易十四(Louis XIV)政府科学家的重要职位，后来被开除，发现自己在省会城市海牙的家中与世隔绝，经常患有抑郁症和发烧，还错过了他的兄弟康斯坦丁(Constantijn)的陪伴，康斯坦丁当时正在英国担任荷兰国王威廉三世(William III)的秘书。\n就在那时，惠更斯开始撰写“宇宙理论”(Cosmotheoros)，这是一本书长的关于其他行星上存在生命可能性的推测，也是第一部基于最近的科学知识而不是哲学猜测或宗教论点的此类作品。惠更斯担心遭到“那些无知或热心太大的人”的谴责，于是指示他的兄弟在他死后才出版这部作品，他在1698年出版了这部作品。Cosmotheoros最初是用拉丁文写的，很快就被翻译成荷兰语和其他语言。同年，一本生动活泼的英文译本以大胆的标题出现，名为“发现的天国”(The Skestial World Discover‘d)。\n当然，哲学家们一直在思考地球以外生命的存在。亚里士多德排除了这一可能性，他认为地球是独一无二的，其他天体是纯粹的几何实体。但是原子学家，其中包括德莫克里特和伊壁鸠鲁，接受了多个世界的概念，在某种程度上是基于各种粒子物质之间存在着空间的类比。中世纪的思想家们注意到了这场辩论，但只能增加他们自己对这样或那样的观点对教会教义的影响的担忧，这对推动这一点毫无帮助。\n随着伽利略在1610年发现了木星的四颗卫星，太阳系中的天体比自古以来已知的天体还要多，这一发现为这场讨论增添了一个意想不到的新维度。当惠更斯在1655年发现另一颗行星土星的第一颗卫星时，争论的天平似乎又改变了。\n惠更斯在17世纪50年代因发现土星的第一颗卫星(后来被命名为土卫六)和行星的光环(后来被视为光环)而成名，并作为第一个精确摆钟的创造者而成名。他还发明了许多其他装置，包括一种原始的幻灯片投影仪-“神灯”，并对数学，特别是几何和概率领域做出了重要贡献，并引入了数学公式，作为表示物理问题中速度和质量等量之间关系的一种手段。所有这些成就使他成为介于伽利略和牛顿之间的最伟大的科学家。\n基督徒惠更斯对物质世界的迷恋是早熟的。小时候，他制造小机器，喜欢解数学难题，以至于人们开始称他为“荷兰的阿基米德”。他拒绝了父亲和兄弟追求的朝臣和外交官的生活，很快就在物理、数学和天文学方面出类拔萃。在他在土星和时钟方面取得突破后，他对移动物体的实验使他得出结论，所有的运动都只是相对的(这一点后来赢得了爱因斯坦的钦佩)。在17世纪70年代，他设计了一个基于波的光理论，这个理论基本上是正确的，但被忽视了近150年，直到它被实验证实。\n与一些杰出的同时代人不同，他对自己选择的问题保持着系统的关注，并认识到它们的实践和理论方面的共同重要性，当这些方面被证明是相互加强的时，就像他在改进钟摆时所做的那样，他感到高兴。尽管像17世纪的任何一位自然哲学家一样，他研究了一系列对现代专家来说似乎宽泛得无可救药的问题，但他并没有像牛顿那样偏离正题，转向炼金术、神秘主义或宗教。\n惠更斯是一位真正的国际主义者。他试图调整他改进后的摆钟，目的是与苏格兰发明家合作，能够在海上计算经度。他与爱尔兰人罗伯特·博伊尔交换了关于用来研究真空特性的气泵的想法。他发现自己与英国人罗伯特·胡克(Robert Hooke)就发明平衡发条来调节便携式手表的计时问题陷入了一场丑陋的争执。他将望远镜设计和行星观测与波兰的约翰尼斯·赫维利乌斯(Johannes Hevelius)和意大利的乔瓦尼·多梅尼科·卡西尼(Giovanni Domenico Cassini)等人进行了比较。他辅导年轻的德国哲学家戈特弗里德·莱布尼茨(GottfredLeibniz)数学(在这位学生超越大师并发明微积分之前)。\n1663年，惠更斯成为第一个被选入皇家学会的外国人。更重要的是，根据一位传记作者的说法，大约在同一时间，他在建立法国科学院方面发挥了重要作用，使他成为“欧洲科学界公认的领导者”。\n惠更斯在1656年发现了土星的光环，这需要用他自己设计的望远镜耐心地观察这颗行星数年(为此，克里斯蒂安和他的兄弟康斯坦丁甚至自己磨碎了镜头)。在这段时间里，这颗行星的外观形状发生了变化，导致了对其形状的许多解释。正是惠更斯强大的光学，加上他对物理上最有可能是什么的数学见多识广的感觉，引导他做出了正确的解释。\n他对行星上生命的第一次推测可以追溯到这个时候。在他的关于土星的论文中，他写到了关于光环的内容，他冷漠地补充了一句关于“围绕着它们的光环对居住在它的人肯定会产生的影响”的好奇。从后来写给他兄弟的回忆信中可以看出，克里斯蒂安和康斯坦丁在一起看望远镜的时候自由地讨论了这些事情，尽管他的思想又过了40年才付印出来。\n到那时，卡西尼号除了发现惠更斯的泰坦和伽利略于1610年在木星轨道上探测到的四颗“美第奇星”外，还发现了土星的四颗卫星。太阳系开始看起来与古希腊人，甚至是前一两代天文学家(如伽利略或约翰尼斯·开普勒)所理解的太阳系截然不同。\n尽管原子学家预计太阳系内部以及太阳系之外都有多个世界，但他们在这些世界是什么样子的问题上意见不一。他们承认，有些可能居住着各种各样的生物，而另一些可能没有任何生命和水。例如，毕达哥拉斯认为月球上居住着比地球上更大的动物和更美丽的植物，而其他人则坚称月球是贫瘠的。\n中世纪的学者觉得有责任在上帝创造的背景下考虑这些问题。1318年至139年，奥卡姆的威廉在牛津大学发表演讲，表示他相信“上帝可以使另一个世界比这个世界更好，并在物种上与这个世界截然不同”。但是他的想法引起了极大的反对，以至于他没有被授予学位。一个世纪后，库萨的尼古拉斯更进一步地假设，其他地方至少有一些物种会优于人类，但尽管如此，这些物种的起源都要归功于“上帝，他是所有恒星区域的中心和周边”。6个。\n两个伟大的发现，它们的影响都是如此之大，以至于花了一个多世纪才被理解，这给16世纪的这些猜测带来了新的刺激。第一种是哥白尼的太阳系日心说，它把地球降格到与其他行星同等的地位。第二个是欧洲对美洲的发现，这拓宽了人们对新大陆上可能发现的物种多样性的看法。这些概念上的剧变引发了新一波流行的关于其他世界生活的想象力文学浪潮，这些文学既不依赖于学术正统观点，也不依赖于最新的天文观测。\n望远镜的出现给这些猜想带来了更清晰的焦点。月球不是一个纯粹的球体，而是像地球一样以山脉为标志的发现，这一发现鼓舞了牧师约翰·威尔金斯(John Wilkins)，例如，他推断在“月球上的世界”(Discovery Of A World In The Moone)(1638年)中也会有居民在那里居住。\n开普勒也认为，根据类似的天文观测，所有类型的天体-行星、卫星，甚至太阳-都可能有居民。他比以前的作者走得更远，他利用他对物理定律的知识(假定是普遍运作的)来考虑这些生命可能采取的形式。他写道，在月球上，由于白天的长度和极端的温度，他们“到目前为止会比我们的身体大得多，脾气也硬得多”。\n在原型科幻中篇小说“睡眠”(标题的意思是“梦”)中，主人公被妖怪绑架并带到月球上，开普勒对月球居民的性质进行了放大，根据他们是生活在黑暗面还是光照面将他们分为两组。后者自然而然地将地球视为他们的月球，开普勒给出了一个有科学根据的印象，即从卫星上看地球会是什么样子。然而，“睡眠”并不是很好的读物，因为它主要是比较两个天体的轨道周期和其他天文变量。\n惠更斯行动的主要推动力可能是作家伯纳德·勒·博维尔·德·丰特内尔(Bernard Le Bovier De Fontenelle)于1686年出版的另一部作品。他的大获成功的“蒙德斯苏拉复数”采取了幼稚的侯爵和睿智的哲学家之间的对话形式。它用朴素的法语写成，可能会吸引那些没有任何科学知识的人，特别是女性读者，它提供了当前天文学理论的入门读物，以及我们太阳系以外的月球、行星和恒星上生活的有趣景象。\n虽然不像丰特内尔的作品那样构思巧妙，但在文学方面，“宇宙论”是它的对手，同时，根据科学作家菲利普·鲍尔的说法，它也是“首次尝试在不损害”圣经“的情况下，对其他世界的生命进行严谨的科学论证”。惠更斯意图的严肃性从他认为这部作品只是一本从未实现的“行星之书”中的一卷这一事实中可见一斑。他用拉丁文写作，以吸引受过教育的读者。(它很快被翻译成口语的事实表明，它触及的目标受众远远超过了这一目标受众。)。\n惠更斯的部分目的是驳斥德国耶稣会学者阿塔纳修斯·基尔彻(Athan Asius Kircher)，他在1656年发表了自己的关于太空旅行的神秘对话--Itinerarium exstaticum，惠更斯读了这本书后发现，他省略了他认为关于其他星球的所有可能的东西，而包括了“一群闲置的不合理的东西”。9惠更斯有更多的时间给其他作家。他引用了库萨的尼古拉斯、第谷·布拉赫、乔丹诺·布鲁诺和约翰尼斯·开普勒的例子，尽管他觉得他们对外星生命可能采取的形式冒险的细节太少。\n惠更斯通过概率推理进行论证。他开始说：“一个按照哥白尼的观点，认为我们的地球是一颗行星的人，像其他行星一样，带着太阳绕着地球转一圈，给它以启发。他有时不能不认为，其他行星都有自己的服装和家具，或许还有它们的居民，这并非不可能。”10这里的关键词是“并非不可能”，这让人回想起年轻时对统计可能性的研究。因为，正如他警告他的读者的那样：“我不能假装断言任何事情都是绝对真实的(因为这是怎么可能的)，只能提出一个可能的猜测，每个人都可以自由地检验这个猜测的真相。”\n例如，他认为月球上不太可能有大气，所以他排除了开普勒和威尔金斯想象的那种生命。但他很高兴地支持在我们太阳系内的行星和其他恒星周围的太阳系中存在生命的想法。他在有生之年发现光速是有限的，这激励他走得更远，并暗示可能有太远的恒星，它们的光还没有到达我们这里。\n他对每一颗行星可能的性质的想法都是通过望远镜可以了解到的。他认为，如果一颗行星能够被证明与地球相似，那么它就会极大地增加其他行星也与地球相似的可能性-这一逻辑仍然指导着寻找地外智能(SETI)。通过利用他所掌握的证据证明一颗行星与另一颗行星的不同之处--在大小、离太阳的距离、天数和外观上--他能够丰富他展现在读者面前的外星生命景象。\n惠更斯关于植物和动物的想法是基于对当时已知的地球上存在的东西的合理预测，最近被探险家的船只带回欧洲的外来物种的消息扩大了。他惊叹于物种的丰富性和适合性“如此精确地适应”了地球上的生活，他认为，如果我们要拒绝其他星球的这种丰富性，那么“我们应该让它们在美丽和尊严上低于地球；这是非常不合理的。”\n这种生活可能采取什么形式？根据新的信息，即美洲物种是不同的，但与旧大陆的物种足够相似，惠更斯推定与陆地物种大致相似。但他确实考虑到了其他星球上可能盛行的不同物理条件。例如，大气可能会更厚，这将适合更多种类的飞行生物。引力也可能不同，尽管他没有提供对每一颗行星的相对引力的估计，而且无论如何，他拒绝接受行星大小与其动植物规模之间存在简单关联的概念。他写道：“我们可能会有一场关于青蛙和老鼠大小的俾格米人比赛，拥有整个星球，”14他写道，尽管他认为这不太可能。\n然而，对于惠更斯来说，“调查的主要和最有趣的地方是。。。把一些观众放在这些新的发现中，欣赏我们种植的这些生物，并欣赏它们的美丽和多样性“。值得注意的是，他认为这些聪明的观察者可能不是人类，而是其他类型的“具有理性的生物”。的确，有些行星可能能够容纳几种“理性生物拥有不同程度的理性和理性”。16个。\n理性和道德的本质将与地球上的一样。这些生物将是社会性的，它们会有房子来躲避天气的侵袭。不过，惠更斯为自己的外表而苦苦挣扎。他想表明他们可能不是人形，但是，他说，他们肯定有手，有脚，而且站得笔直。但也许它们会有外骨骼，比如龙虾。毕竟，“这是一种非常荒谬的观点，认为普通人中有这样一种观点，认为理性的灵魂不可能以我们以外的任何形式居住”。这样的猜想与开普勒在他的“睡梦”中的猜想相呼应，但是惠更斯对可能的物理限制的专家知识更合理地指导了他的猜想。\n惠更斯随后将注意力转向智能和技术。他的行星生物肯定会有科学，特别是天文学，因为据说这项研究是由于对日食的恐惧而产生的，日食也会发生在其他星球上。毫无疑问，他们会拥有我们的一些发明，“然而，他们应该拥有所有的发明，这是不可信的”。尤其是，惠更斯不能相信他们会拥有望远镜，因为他认为他自己用过的望远镜是如此之好，以至于其他智力无法与之匹敌。取而代之的是，他将这些行星上的居民归类为具有远超自然视力的人。\n1600年，佐丹诺·布鲁诺(Giordano Bruno)因许多异端邪说而被罗马宗教裁判所烧死在坎波德“菲奥里(Campo de”Fiori)的火刑柱上，包括他对多种潜在有人居住世界的坚持。一个世纪后，惠更斯安然无恙地摆脱了这样的命运。然而，他试图阻止来自教会的任何批评，他提出的语义点是，圣经中提到的天地必须适用于整个宇宙，而不是仅适用于地球。他拒绝给予人类在创造中的特殊地位。与一些竞争对手的作品不同，特别是那些有着乌托邦或讽刺议程的作品，宇宙论并没有提出人类在生物中要么高人一等，要么低人一等的等级制度。\n宇宙论在18世纪享有很长一段时间的流行，惠更斯关于行星和其他太阳系生命的想法对伊曼纽尔·康德来说变得重要，他在1755年的“宇宙自然历史和天堂理论”中写道。1781年威廉·赫歇尔(William Herschel)发现天王星时，人们的兴趣进一步高涨，但从那以后，天文学家开始回避这个话题，随后的观点对这部最具投机性的惠更斯作品就不那么友好了。\n然而，最近，科学史学家们重新评价了宇宙论，他们承认，正是惠更斯对不确定性的拥抱让他从一开始就有了探索这一主题的许可证。这绝不是惠更斯时代所有人共有的倾向。许多思想家，如英国牧师约瑟夫·格兰维尔(Joseph Glanvill)，认为接受不确定的东西是可以打开无神论世界的楔子的细端。苏格兰诗人威廉·德拉蒙德(“在柏树林中”)在这方面明确指出哥白尼学说和外星生命的概念，认为“科学已经变成了观点，不是错误，而是把想象力留在一千个迷宫里”。19个。\n然而，现在可以看出，惠更斯给后世科学家最大的礼物可能是他愿意在不确定的情况下工作。在阐述了概率的数学基础之后，没有人比他更适合把它的格言扩展到思考科学问题。这样做并不是向非理性投降，而是打开创造性思维的新大门。正如惠更斯在“宇宙论”中所写的那样：“以概率达到目标是一种荣耀，而寻找本身就是对痛苦的回报。”但是有很多程度的可能性，有些比另一些更接近真理，这取决于我们的主要判断。“。\n这是一种轻微的释义。梅森在给他父亲的一封信中称他为“沃斯特·阿基米德”，“你的阿基米德”，他的父亲很喜欢这个词，这句话在这个必然是泛化的版本中流行起来。默森的信是在克里斯蒂安·惠更斯主编的“基督教惠更斯全书”中写的。荷兰Maatscappij der Wetenschappen(海牙：Martinus Nijhoff，1888-1950)，1：83-6。\nC·D·安德烈斯，惠更斯，“原则背后的人”，译文。萨莉·米耶瓦(剑桥：剑桥大学出版社，2005)，第十三页。\n引用自史蒂文·J·迪克的“多元世界：从德莫克里特到康德的外星生命辩论的起源”(坎布里。\n.", "note_en": "During the 17th century, as knowledge of the Universe and its contents increased, so did speculation about life on other planets. One such source, as Hugh Aldersey-Williams explores, was Dutch astronomer, mathematician, and inventor Christiaan Huygens, whose earlier work on probability paved the way for his very modern evaluation of what alien life might look like.\n When things look bleak in this world, it is perhaps natural to turn one&#39;s mind to conditions on other worlds. This is what the Dutch astronomer Christiaan Huygens did in the late 1680s. He had been ejected from his influential post as a government scientist of Louis XIV in Paris and found himself isolated back home in the provincial town of The Hague, frequently ill with depression and fevers, and missing the companionship of his brother Constantijn, who was away serving as secretary to the Dutch King William III in England.\n It was then that Huygens began to write  Cosmotheoros, a book-length speculation on the possibility of life on other planets, and the first such work to be based on recent scientific knowledge rather than philosophical conjecture or religious argument. Fearful of censure by “those whose Ignorance or Zeal is too great”,  1 Huygens instructed his brother to publish the work only after his death, which he did in 1698. Originally written in Latin,  Cosmotheoros was quickly translated into Dutch and other languages. A lively English translation appeared that same year under the audacious title,  The Celestial Worlds Discover’d.\n Philosophers had of course always thought about the existence of life beyond the Earth. Aristotle ruled it out, believing that the Earth was unique and that other celestial bodies were pure geometrical entities. But the atomists, among them Democritus and Epicurus, accepted the notion of a plurality of worlds, somewhat on the analogy of particulate matter of various kinds existing with space in between. Medieval thinkers picked up on this debate, but could only add to it their own concerns about the implications of one view or another for church doctrine, which did nothing to advance it.\n The revelation that there were yet more bodies in the solar system than the ones that had been known since antiquity, which came with Galileo&#39;s discovery of four moons of Jupiter in 1610, added an unexpected new dimension to the discussion. And when Huygens discovered the first satellite of another planet, Saturn, in 1655, the balance of the argument seemed to change again.\n  Huygens achieved fame in the 1650s for that discovery of Saturn&#39;s first satellite (later named Titan) and the planet&#39;s ring (later seen to be rings) and as the creator of the first accurate pendulum clock. He also invented numerous other devices, including a “magic lantern”, a kind of primitive slide projector, and made important contributions to mathematics, especially the fields of geometry and probability, and introduced mathematical formulas as a means of expressing the relationship between quantities such as speed and mass in physics problems. All of these achievements make him the greatest scientist in the period between Galileo and Newton.\n Christiaan Huygens was precocious in his fascination with the physical world. As a child, he made little machines and delighted in solving mathematical puzzles, such that people began to refer to him as the “Dutch Archimedes”.  2 He rejected the life of a courtier and diplomat pursued by his father and brothers, and soon distinguished himself in physics, mathematics, and astronomy. After his breakthroughs with Saturn and clocks, his experiments with moving objects led him to the conclusion that all motion is only relative (which later earned the admiration of Einstein). In the 1670s, he devised a wave-based theory of light, which was substantially correct but was neglected for nearly 150 years until it could be confirmed by experiment.\n Unlike some illustrious contemporaries, he maintained a systematic focus on his chosen problems and recognised the joint importance of their practical and theoretical aspects, rejoicing when these were shown to reinforce one another, as they did in his improvements to the pendulum. Although, like any natural philosopher of the seventeenth century, he worked on a range of problems that would seem hopelessly broad to a modern specialist, he did not — as Newton did — become sidetracked into alchemy, occultism, or religion.\n Huygens was a true internationalist. He sought to adapt his improved pendulum clocks with the aim of being able to calculate longitude at sea in collaboration with Scottish inventors. He swapped ideas about the air pump used to investigate the properties of the vacuum with the Irish Robert Boyle. He found himself caught in an ugly dispute with the English Robert Hooke over the invention of the balance spring to regulate the timekeeping of portable watches. He compared telescope designs and planetary observations with the Polish Johannes Hevelius and the Italian Giovanni Domenico Cassini, among others. He tutored the young German philosopher Gottfried Leibniz in mathematics (before the student surpassed the master and invented calculus).\n In 1663, Huygens became the first foreigner to be elected to the Royal Society. More significantly, he was instrumental in establishing the  French Academy of Sciences around the same time, making him “the recognised leader of European science”,  3 according to a biographer.\n Huygens&#39; discovery of Saturn&#39;s ring in 1656 demanded years of patient observation of the planet using a telescope of his own design (for which Christiaan and his brother Constantijn even ground the lenses themselves). During this time, the apparent shape of the planet changed, leading to many interpretations of its form. It was Huygens&#39; powerful optics together with his mathematically informed sense of what was physically most likely that led him to the correct interpretation.\n   His first speculations about life on the planets date from this time. Writing about the ring in his treatise on Saturn, he nonchalantly added a line of wonder about “the effects that the ring that surrounds them must have on those who inhabit it”.  4 From later letters of reminiscence to his brother, it appears that Christiaan freely discussed such matters with Constantijn while they were at the telescope together, even though it took another forty years for his thoughts to appear in print.\n By that time, Cassini had discovered four moons of Saturn in addition to Huygens&#39;s Titan and the four “Medicean stars” that Galileo had detected in orbit around Jupiter in 1610. The solar system was beginning to look very different from that understood by the ancient Greeks, or even by astronomers of a generation or two before, such as Galileo or Johannes Kepler.\n Although the atomists anticipated that there was a plurality of worlds both within the solar system and perhaps also beyond it, they were divided on the question of what these worlds were like. They accepted that some might be inhabited by living creatures of various kinds, while others might be devoid of any life and water. Pythagoras, for instance, believed that the moon was inhabited by animals larger and plants more beautiful than those on Earth, while others insisted it was barren.\n Medieval scholars felt duty-bound to consider these matters in the context of God&#39;s creation. In 1318–9, William of Ockham gave lectures at Oxford stating his belief that “God could make another world better than this one and distinct in species from it”.  5 But his ideas aroused such opposition that he was not granted his degree. A century later, Nicholas of Cusa went further in supposing that at least some species elsewhere would be superior to humans, but that nevertheless all owed their origin to “God, who is the centre and circumference of all stellar regions”.  6\n Two great revelations, both so vast in their implications that it took them more than a century to sink in, gave a new stimulus to these speculations in the sixteenth century. The first was Copernicus&#39; heliocentric theory of the solar system, which demoted the Earth to a status equal with that of the other planets. The second was the European discovery of the Americas, which broadened ideas of the diversity of species that might be expected to be found on new worlds. These conceptual upheavals unleashed a popular new wave of imaginative literature about life on other worlds that depended neither on scholastic orthodoxies nor on up-to-the-minute astronomical observations.\n The advent of the telescope brought a sharper focus to these conjectures. The discovery that the Moon was not a pure sphere, but marked by mountain ranges like the Earth, encouraged the cleric John Wilkins, for example, to infer that there would also be inhabitants there in  The Discovery of a World in the Moone (1638).\n  Kepler, too, believed that all manner of celestial bodies — planets, moons, and even suns — might have inhabitants, based on similar astronomical observations. He went further than previous authors by using his knowledge of physical laws (presumed to operate universally) to consider the form that these beings might take. On the Moon, they would have “by far a larger body and hardness of temperament than ours”,  7 he wrote, because of the length of days and extremes of temperature.\n In  Somnium, a prototype science fiction novella (the title means “The Dream”) in which the protagonist is kidnapped by daemons and taken to the Moon, Kepler enlarged on the nature of the Moon&#39;s inhabitants, dividing them into two groups according to whether they lived on the dark side or the illuminated side. The latter naturally regard the Earth as their Moon, and Kepler gave a scientifically informed impression of how the Earth would look from its satellite. However,  Somnium is not great reading, concerned as it is mainly with the comparison of orbital periods and other astronomical variables on the two celestial bodies.\n Huygens&#39; main stimulus to action was probably another work, by the writer Bernard le Bovier de Fontenelle, published in 1686. His wildly successful  Entretiens sur la pluralité des mondes took the form of a dialogue between a naive marquise and a wise philosopher. Written in plain French so that it might appeal to those without any scientific knowledge, and specifically to women readers, it offered a primer to current astronomical theories, as well as an entertaining vision of life on the moon, planets, and stars beyond our solar system.\n  While not so artfully conceived as Fontenelle&#39;s work,  Cosmotheoros is its match in literary terms, while also being, according to the science writer Philip Ball, the “first attempt to mount a rigorous scientific case for life on other worlds, without doing harm to Scripture”.  8 Huygens&#39; seriousness of intent is evident from the fact that he considered the work as just one volume in a never realised “book of the planets”. He wrote in Latin in order to appeal to an educated readership. (The fact that it was quickly translated into spoken languages shows that it reached well beyond this target audience.)\n Part of Huygens&#39; purpose was to refute the German Jesuit scholar Athanasius Kircher, who had published his own mystical dialogue of space travel,  Itinerarium exstaticum, in 1656, which Huygens had read and found to omit all that he considered probable about other planets, while including “a company of idle unreasonable stuff”.  9 Huygens had more time for other writers. He cited Nicholas of Cusa, Tycho Brahe, Giordano Bruno, and Johannes Kepler, although they, he felt, had ventured too little detail as to the forms that extraterrestrial life might take.\n  Huygens made his argument by reasoning from probability. He began: “A Man that is of Copernicus&#39;s Opinion, that this Earth of ours is a Planet, carry&#39;d round and enlighten&#39;d by the Sun, like the rest of the Planets, cannot but sometimes think, that it&#39;s not improbable that the rest of the Planets have their Dress and Furniture, and perhaps their Inhabitants too.”  10 The key phrase here is “not improbable”, harking back to Huygens&#39; youthful investigations of statistical likelihoods. For, as he warned his readers: “I can”t pretend to assert any thing as positively true (for how is it possible) but only to advance a probable Guess, the truth of which every one is at his own liberty to examine.”  11\n He thought it most unlikely there was an atmosphere on the Moon, for instance, and so he ruled out the kind of life there imagined by Kepler and Wilkins. But he happily endorsed the idea of life on planets within our solar system and in the solar systems surrounding other stars. The discovery during his lifetime that the speed of light is finite encouraged him to go further and suggest that there may be stars so distant that their light has not yet reached us.\n His thoughts about the likely nature of each planet were informed by what could be learned about them through a telescope. He argued that if one planet could be shown to be Earth-like, then it greatly increased the chances that others would be too — a logic that still guides the Search for Extraterrestrial Intelligence (SETI). By using what evidence he had of one planet&#39;s distinctiveness from another — in size, distance from the sun, length of days, and appearance — he was able to enrich the vision of extraterrestrial life he laid before his readers.\n  Huygens&#39; ideas about plants and animals were based on reasonable projections of what was then known to exist on the Earth, recently expanded by news of exotic species brought back to Europe by explorers&#39; ships. Marvelling at the richness and fitness of species “so exactly adapted”  12 to life on Earth, he argued that if we were to deny this abundance to other planets, then “we should sink them below the Earth in Beauty and Dignity; a Thing very unreasonable.”  13\n What form might this life take? Based on new information that American species are different, but enough like those of the Old World, Huygens presumed a general similarity with terrestrial species. But he did give some consideration to the different physical conditions that may prevail on other planets. The atmosphere might be thicker, for example, which would suit a greater variety of flying creatures. Gravity might be different, too, although he did not provide estimates of the comparative gravitational force on each of the planets, and in any case he rejected the notion of a simple correlation between the size of a planet and the scale of its flora and fauna. “We may have a Race of Pygmies about the bigness of Frogs and Mice, possess&#39;d of the Planets,”  14 he wrote, although he thought it unlikely.\n For Huygens, though, “the main and most diverting Point of the Enquiry is . . . placing some Spectators in these new discoveries, to enjoy these Creatures we have planted them with, and to admire their Beauty and Variety”. Remarkably, he suggested that these intelligent observers might not be men, but other kinds of “Creatures endued with Reason”.  15 Some planets, indeed, might be capable of accommodating several species of “rational Creatures possess&#39;d of different degrees of Reason and Sense”.  16\n The nature of reason and morality would be the same as on Earth. These creatures would be social, and they would have houses to shelter them from the weather. Huygens struggled with their appearance, though. He wanted to indicate that they might not be humanoid, and yet, he said, surely they must have hands, and feet, and stand upright. But perhaps they would have exoskeletons, like lobsters, for example. After all, “”tis a very ridiculous opinion, that the common people have got among them, that it is impossible a rational Soul should dwell in any other shape than ours”.  17 Such conjectures echoed those of Kepler in his  Somnium, but were more soundly guided by Huygens&#39; expert knowledge of the likely physical constraints.\n Huygens then turned his attention to intelligence and technology. His planetary beings would surely have science, and especially astronomy, as this study was said to have arisen as a consequence of the fear of eclipses, which would also occur on other planets. They would doubtless have some of our inventions, “yet that they should have all of them is not credible”.  18 In particular, Huygens could not credit that they would possess telescopes, since he considered those which he had used himself as being so fine that other intelligences would not be able to equal them. Instead, he invested the denizens of the planets with far superior natural eyesight.\n  In 1600, Giordano Bruno had been burnt at the stake in the Campo de” Fiori in Rome by the Inquisition for many heresies, including his insistence on the plurality of potentially inhabited worlds. A century later, Huygens was safe from such a fate. Nevertheless, he attempted to forestall any criticism from the church by making the semantic point that the heaven and earth referred to in scripture must apply to the totality of the universe and not to the planet Earth exclusively. He refused to grant man a special place in Creation. Unlike some rival works, especially those with a utopian or a satirical agenda,  Cosmotheoros did not propose a hierarchy among the creatures in which humans would be either superior or inferior.\n Cosmotheoros enjoyed a long period of popularity through the eighteenth century, and Huygens&#39; ideas about life on the planets and in other solar systems became important for Immanuel Kant in his  Universal Natural History and Theory of the Heavens of 1755. The discovery of Uranus by William Herschel in 1781 saw a further surge of interest, but thereafter astronomers began to shun the topic, and subsequent opinion has been less kind to this most speculative of Huygens&#39; works.\n Recently, though,  Cosmotheoros has been reappraised by historians of science, who acknowledge that it was Huygens&#39; embrace of uncertainty that gave him the licence to explore the topic in the first place. This was by no means a tendency shared by all in Huygens&#39; time. Many thinkers, such as the English clergyman Joseph Glanvill, saw the acceptance of things not known for sure as the thin end of a wedge that would prise open a world of atheism. The Scottish poet William Drummond (in  A Cypress Grove) explicitly singled out both Copernicanism and the idea of extraterrestrial life in this regard, as cases where “Sciences have become opinions, nay errors, and leave the imagination in a thousand labyrinths”.  19\n Nevertheless, it can now be seen that Huygens&#39; greatest gift to later generations of scientists may have been his willingness to work with uncertainty. Having set out the mathematical foundations of probability, nobody was in a better position to extend its precepts into thinking about questions of science. Doing so was not a surrender to unreason, but a way of opening new doors to creative thought. As Huygens wrote in  Cosmotheoros: “tis a Glory to arrive at Probability, and the search itself rewards the pains. But there are many degrees of Probable, some nearer Truth than others, in the determining of which lies the chief exercise of our Judgment.”\n  This is a slight paraphrase. Mersenne called him “vostre Archimede”, “your Archimedes” in a letter to his father, his father loved it and it caught on in this necessarily generalized version. The Mersenne letter is in Christiaan Huygens,  Oeuvres Complètes de Christiaan Huygens, ed. Hollandse Maatschappij der Wetenschappen (The Hague: Martinus Nijhoff, 1888–1950), 1:83–6.\n C. D. Andriesse, Huygens,  The Man behind the Principle, trans. Sally Miedema (Cambridge: Cambridge University Press, 2005), xiii.\n  Quoted in Steven J. Dick,  Plurality of Worlds: The Origins of the Extraterrestrial Life Debate from Democritus to Kant (Cambr\n......", "posttime": "2020-10-23 04:31:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "外星,heavens,惠更斯", "title": "不确定的天堂：克里斯蒂安·惠更斯的外星生命观", "title_en": "The Uncertain Heavens: Christiaan Huygens’ Ideas of Extraterrestrial Life", "transed": 1, "url": "https://publicdomainreview.org/essay/the-uncertain-heavens/", "via": "", "real_tags": ["外星", "heavens", "惠更斯"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1030660, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此更新包括几个主要的错误修复和用户界面改进。对浏览器集成排序和处理URL的方式进行了重大改进。此外，随着MacOS主题的改进，幻影滚动条也得到了修复。\n此版本中值得注意的新增功能是“Always On Top”模式、指定配置文件位置的选项以及改进的CSV导入/导出功能。\n请在我们的GitHub问题跟踪器上报告您遇到的任何错误。如果您对新版本有任何其他问题(请参阅联系方式)，我们也可以在Matrix和IRC上找到。\nSSH代理：通过在所有平台上将“Add Key”更改为Ctrl+H来避免MacOS上的快捷键冲突[#5484]。\n修复布局问题和条目编辑屏幕顶部出现的杂乱滚动条[#5424]", "note_en": "This update includes several major bug fixes and user interface improvements. A major improvement to the waythe browser integration prioritizes and handles URLs has been introduced. Additionally, the phantom scrollbarhas been fixed along with macOS theme improvements.\n Notable additions in this release are an “Always on Top” mode, options to specify configuration file locations, and improved CSV import/export functionality.\n  Please report any bugs you encounter at our  GitHub issue tracker.We are also available on Matrix and IRC in case you have any other issues with the new release(see  Contact).\n     SSH Agent: Avoid shortcut conflict on macOS by changing “Add key” to Ctrl+H on all platforms [ #5484]\n  Fix layout issues and a stray scrollbar appearing on top of the entry edit screen [ #5424]", "posttime": "2020-10-23 04:30:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,keepassxc", "title": "KeePassXC 2.6.2发布", "title_en": "KeePassXC 2.6.2 Released", "transed": 1, "url": "https://keepassxc.org/blog/2020-10-21-2.6.2-released/", "via": "", "real_tags": ["发布", "keepassxc"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1030659, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这种感觉并没有持续多久。2016年，我用Memoriam-Mozilla写文章，到了2017年，Firefox陷入了滑坡。嗯，我是对的，从那以后，Firefox(和Mozilla)只会变得更糟。在2020年，这种他妈的文化在Mozilla中根深蒂固，很难再看到它变得更好了。\n在过去的几年里，他们参与的最有趣的事情是Rust和Servo，他们解雇了这两家公司的大部分或全部工程师。昨天，Mozilla发表了一份站在谷歌一边的反垄断声明，没有披露谷歌付钱让他们继续运营的事实。\n这是开源的明珠吗？不，不再是了。火狐是开源的耻辱，也是谷歌与万能的网络垄断之间的唯一障碍。Mozilla已经从Firefox剥离，并开始将他们的工程师工资单上剩下的钱转移到他们的高管口袋里。网络已经死了，它臭气熏天的身体只剩下谷歌在它的服务器和你的屏幕之间刮过的那层粘液，任何仍然相信Mozilla会拯救网络的人都是傻瓜。\n正如我以前说过的，多年来，网络浏览器的范围一直在以不计后果的速度增长，以至于从字面上讲，建造一个新的网络浏览器是不可能的。我们已经没有办法保护网络了。这就是我支持双子座的原因，双子座是一种比网络简单得多的新协议，你可以在周末实现它。\n忘了网络吧，这是个失败的事业。我们继续吧。\n⇒这篇文章也可以在双子座上找到。对我的一篇帖子有什么评论吗？通过发送电子邮件至~sircmpwn/public-inbox@lists.sr.ht[邮件列表礼仪]，在我的公共收件箱中开始讨论", "note_en": "This feeling didn’t last. In 2016, I wrote In Memoriam - Mozilla, and in 2017, Firefox is on a slippery slope.Well, I was right, and Firefox (and Mozilla) have only become worse since. Thefuck-up culture is so ingrained in Mozilla in 2020 that it’s hard to see it evergetting better again.\n   The most interesting things they’ve been involved in in the past few years areRust and Servo, and they fired most or all of their engineers involved in both.And, yesterday,  Mozilla published a statement siding withGoogle on anti-trust, failing to disclose the fact that Google pays to keep theirlights on.\n Is this the jewel of open source? No, not anymore. Firefox is the embarrassmentof open source, and it’s the only thing standing between Google and anall-encompassing monopoly over the web. Mozilla has divested from Firefox andstarted funnelling what money is left out of their engineering payroll and intotheir executive pockets. The web is dead, and its fetid corpse persists onlyas the layer of goop that Google scrapes between its servers and your screen.Anyone who still believes that Mozilla will save the web is a fool.\n As I have  stated before, the scope of web browsers has beenincreasing at a reckless pace for  years, to the point where it’s literallyimpossible to build a new web browser. We have no recourse left to preserve theweb. This is why I’m throwing my weight behind  Gemini, a new protocolwhich is  much simpler than the web, and which you can implement yourself in aweekend.\n Forget about the web, it’s a lost cause. Let’s move on.\n   ⇒ This article is also available  on gemini.  Have a comment on one of my posts? Start a discussion in my public inbox by sending an email to  ~sircmpwn/public-inbox@lists.sr.ht [ mailing list etiquette]", "posttime": "2020-10-23 04:30:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,firefox,jewel,mozilla", "title": "火狐：开源的明珠", "title_en": "Firefox: The Jewel^WEmbarassment of Open Source", "transed": 1, "url": "https://drewdevault.com/2020/10/22/Firefox-the-embarassment-of-FOSS.html", "via": "", "real_tags": ["开源", "firefox", "jewel", "mozilla"]}, {"category": "", "categoryclass": "", "imagename": "bca15e420017d3094b9044672abf50b1.jpg", "infoid": 1030658, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在距离11月3日总统大选的联邦投票截止日期只有不到两周的时间，基本上一切都像许多人预期的那样，一下子就击中了粉丝。现在，情报官员和议员们几乎都在恳求美国人不要轻信他们在网上的所见所闻，因为有新的指控称，来自伊朗的行为者通过电子邮件威胁个人选民的努力。\n美国国家情报总监约翰·拉特克利夫和联邦调查局局长克里斯托弗·雷在周三晚间匆忙宣布的新闻发布会上联手发出警告，称外国行为者已经采取具体行动来影响与我们选举相关的公众舆论。具体地说，拉特克利夫说，伊朗和俄罗斯的行为者分别获得了一些选民登记信息，并利用这些信息向注册选民传达虚假信息，他们希望这些信息会造成混乱，散布混乱，削弱你对美国民主的信心。\nRatcliffe指的是本周早些时候开始的一场电子邮件运动，当时佛罗里达州、亚利桑那州和阿拉斯加州的一些选民开始收到威胁信息。\n把票投给特朗普……。否则我们就会追上你，电子邮件上写着。将您的政党归属更改为共和党，让我们知道您收到了我们的信息并将遵守。我们就会知道你投给了哪位候选人。如果我是你，我会认真对待这件事。祝你好运。\n这些电子邮件据称来自骄傲男孩组织，这是一个众所周知的美国右翼极端组织，自2016年成立以来变得越来越活跃，唐纳德·特朗普总统默许了该组织的支持。然而，据报道，骄傲的男孩否认参与其中，副主板周二报告称，这些信息来自爱沙尼亚的一台服务器，很可能使用了伪造的电子邮件地址。\n一些选民还收到了带有骄傲男孩品牌的视频，视频显示了某人如何涉嫌利用收件人的个人信息进行选民欺诈。Motherboard今天发布了一份经过编辑、贴上标签的视频副本，以展示虚假信息运动可能是什么样子。\n拉特克利夫周三表示，伊朗是这些恶搞电子邮件和视频的幕后黑手，他声称这些电子邮件和视频旨在恐吓选民，煽动社会动荡，损害特朗普总统。\n雷在新闻发布会上补充道：我们不会容忍外国干涉我们的选举，也不会容忍任何威胁到你的选票的神圣或破坏公众对选举结果信心的犯罪活动，我们不会容忍外国干涉我们的选举，也不会容忍任何威胁到你的选票的神圣或破坏公众对选举结果的信心的犯罪活动。\n伊朗否认与此事有任何牵连。周三晚些时候，伊朗驻联合国代表团发言人阿里雷扎·米尔尤塞菲(Alireza Miryousefi)告诉NBC新闻，与美国不同的是，伊朗不干涉其他国家的选举。世界一直在见证美国自己不顾一切地公开试图质疑自己最高层选举的结果。这些指责不过是破坏选民对美国大选安全信心的另一种情况，是荒谬的。\nWray和Ratcliffe都没有提供证据来解释为什么情报官员认为伊朗行为者是这些电子邮件的来源。然而，一些独立研究人员以及其他政府官员支持这一说法。\n佛罗里达州共和党参议员马尔科·卢比奥(Marco Rubio)。参议院情报委员会主席和副主席马克·华纳(弗吉尼亚州民主党)今天发表了一份联合声明，证实伊朗参与其中。\n参议员们表示，很明显，伊朗现在正积极寻求播撒异见，分裂我们，就像俄罗斯在2016年所做的那样，今天也在继续这样做。向美国人民和媒体重申，我们需要对耸人听闻的、最后一刻关于选举基础设施的说法持怀疑态度。州、地方和联邦官员，以及社交媒体和科技领域的合作伙伴，应该为共同努力关闭伊朗和俄罗斯的努力而感到自豪。", "note_en": "We now have less than two weeks to go before the federal voting deadline for the presidential election on November 3, and basically everything is, as many expected, hitting the fan at once. Now, intelligence officials and lawmakers are all but begging Americans to be less credulous with what they see and hear online amid new allegations that actors from Iran emailed individual voter-intimidation efforts.\n Director of National Intelligence John Ratcliffe and FBI Director Christopher Wray joined forces at a hastily announced press conference Wednesday night to issue a warning that foreign actors &#34;have taken specific actions to influence public opinion relating to our elections.&#34; Specifically, Ratcliffe said, actors from Iran and Russia had separately obtained &#34;some voter registration information&#34; and were using it &#34;to communicate false information to registered voters that they hope will cause confusion, sow chaos, and undermine your confidence in American democracy.&#34;\n Ratcliffe was referring to an email campaign that started earlier this week, when some voters in Florida, Arizona, and Alaska  started receiving threatening messages.\n &#34;Vote for Trump... or we will come after you,&#34; the emails read. &#34;Change your party affiliation to Republican to let us know you received our message and will comply. We will know which candidate you voted for. I would take this seriously if I were you. Good luck.&#34;\n  The emails purported to come from the Proud Boys, a known US-based  right-wing extremist group that has become increasingly active since its founding in 2016 and which President Donald Trump has  tacitly supported. The Proud Boys reportedly denied involvement, however, and Vice Motherboard  reported on Tuesday that the messages originated from a server in Estonia and were likely using a spoofed email address.\n Some voters also received videos, with Proud Boys branding, that showed how someone could allegedly commit voter fraud using the recipient&#39;s personal information. Motherboard today  published a redacted, labeled copy of the video to demonstrate what a disinformation campaign can look like.\n Ratcliffe on Wednesday said that Iran was behind the spoofed emails and videos, which he claimed were &#34;designed to intimidate voters, incite social unrest, and damage President Trump.&#34;\n &#34;We&#39;re not going to tolerate foreign interference in our elections or any criminal activity that threatens the sanctity of your vote or undermines public confidence in the outcome of the election,&#34; Wray added in the press conference.\n Iran denied any involvement. &#34;Unlike the US, Iran does not interfere in other country&#39;s elections,&#34; Alireza Miryousefi, a spokesman for the Iranian Mission to the United Nations,  told NBC News late Wednesday. &#34;The world has been witnessing US&#39; own desperate public attempts to question the outcome of its own elections at the highest level. These accusations are nothing more than another scenario to undermine voter confidence in the security of the US election and are absurd.&#34;\n  Neither Wray nor Ratcliffe provided evidence explaining why intelligence officials believe Iranian actors to be the source of the emails. However, some  independent  researchers as well as other government officials are supporting the claim.\n Sens. Marco Rubio (R-Fla.) and Mark Warner (D-Va.), respectively the chairman and vice chairman of the Senate Intelligence Committee, released a  joint statement today confirming Iran&#39;s involvement.\n &#34;It is clear that Iran is now actively seeking to sow dissent and divide us, much like  Russia did in 2016 and continues to do today,&#34; the senators said. &#34;To the American people and the media, we reiterate the need to be skeptical of sensationalist, last-minute claims about election infrastructure. State, local, and federal officials, and partners in social media and tech, should be proud of joint efforts to shut down Iranian and Russian efforts.&#34;", "posttime": "2020-10-23 04:15:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "选民,supposed,美国", "title": "联邦调查局称，伊朗是所谓的“骄傲的男孩”选民恐吓电子邮件的幕后黑手", "title_en": "Iran behind supposed “Proud Boys” voter-intimidation emails, Feds allege", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/10/iran-behind-supposed-proud-boys-voter-intimidation-emails-feds-allege/", "via": "", "real_tags": ["选民", "supposed", "美国"]}, {"category": "", "categoryclass": "", "imagename": "c05557145d77fc08247aa89365c2ca59.jpg", "infoid": 1030656, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在有很多基于Linux的桌面操作系统。他们中的一些人很棒，而另一些人则从平庸到彻头彻尾的糟糕和不必要的。当Linux发行版的新版本问世时，Linux社区会注意到这一点，但在很大程度上，世界对此并不在意。当然，除非是Ubuntu。\n是的，Canonical的Ubuntu无疑是最知名的基于Linux的桌面操作系统，当一个新版本面世时，这是一件非常重要的事情--即使在主流情况下也是如此。尽管每次发布公告都没有真正的惊喜--它们一年两次出现，分别在4月和10月。\nUbuntu声名鹊起的原因是什么？当然，Ubuntu这个名字说起来朗朗上口，很有趣，但实际上，它只是一个设计良好的操作系统，易于使用，非常稳定。Linux初学者和专家都使用Ubuntu。见鬼，即使是其他Linux发行版也依赖于Ubuntu作为它们的基础-Linux Mint只是一个例子。\n如前所述，新的Ubuntu版本将在4月和10月发布，如果你不知道的话，我们正处于后者的末期。距离万圣节还有一周多一点的时间，Canonical今天发布了Ubuntu20.10。\nUbuntu的版本编号方案基于年份(YY)、句号和月份(MM)。例如，之前的稳定版本是在今年4月发布的，编号为20.04。此外，Canonical(操作系统的所有者)按顺序和字母顺序分配名称。字母数字代号总是基于两个单词，以相同的连续字母开头--形容词后跟动物名称。前面提到的20.04被命名为焦点福萨(Focus Fossa)。\n这一次，该操作系统将被命名为Ubuntu20.10&#34；Groovy Gorilla。这个新版本的桌面操作系统已经安装了修复程序、新功能，并重新聚焦于现已成为标志性的覆盆子PI。是的，朋友们，有了兼容的PI(4 GB或8 GB内存的机型)，你现在就可以拥有完整的Ubuntu桌面体验了。哇!。\nCanonical的首席执行官Mark Shuttleworth解释说，在这个版本中，我们庆祝树莓派基金会将开放计算提供给世界各地的人们的承诺。我们很荣幸通过在树莓Pi上优化Ubuntu来支持这一倡议，无论是出于个人使用、教育目的还是作为他们下一次商业冒险的基础。\n除了Raspberry Pi桌面支持之外，Ubuntu 20.10还包括GNOME 3.38，它可以调整应用程序的网格，删除“频率”选项卡，并允许按照用户的喜好对应用程序进行排序和组织。在电源设置中显示了电池百分比显示切换，可以使用唯一生成的二维码共享私人WiFi热点，并在注销/关机旁边的状态菜单中添加了重新启动选项。&#34；\n是的，Ubuntu20.10默认自带GNOME 3.38--绝对是最好的桌面环境。Groovy Gorilla也有现代的Linux内核5.8。该操作系统充满了很棒的预装软件，如Firefox81、LibreOffice7.0.2和Thunderbird 78.3.2。当然，您还可以自己安装无数其他优秀的应用程序。\n准备好尝试Ubuntu20.10 Groovy Gorilla了吗？你很快就可以在这里下载ISO版本。嘿，如果你需要一个USB驱动器来创建安装介质，你应该在这里看看这个可爱的企鹅闪存驱动器。", "note_en": "There are many Linux-based desktop operating systems these days. Some of them are great, while others range from mediocre to downright bad and unnecessary. When a new version of a Linux distro comes out, the Linux community takes notice, but largely, the world doesn&#39;t pay it any mind. That is, of course, unless it is Ubuntu.\n Yes, Canonical&#39;s Ubuntu is undoubtedly the most well-known desktop Linux-based operating system, and when a new version becomes available, it is a very big deal -- even in the mainstream. This is despite that there is no real surprise in each release announcement -- they come twice a year, in April and October.\n What is the cause for Ubuntu&#39;s renown? Sure, the name &#34;Ubuntu&#34; is catchy and fun to say, but really, it is just a well-designed OS that is easy to use and is very stable. Both Linux beginners and experts use Ubuntu. Hell, even other Linux distributions rely on Ubuntu as their base -- Linux Mint is just one example.\n    As stated earlier, new Ubuntu versions come April and October, and wouldn&#39;t you know it, we are at the end of the latter. With Halloween a bit more than a week away, Canonical today releases Ubuntu 20.10.\n Ubuntu&#39;s version numbering scheme is based on year (YY), a period, and the month (MM). For instance, the previous stable version was released this past April and it is numbered as 20.04. In addition, Canonical (the operating system&#39;s owner) assigns names -- sequentially and alphabetically. The alphanumeric code name is always based on two words starting with the same sequential letter -- an adjective followed by an animal name. The aforementioned 20.04 is named &#34;Focal Fossa.&#34;\n This time, the operating system will be called Ubuntu 20.10 &#34;Groovy Gorilla.&#34; This new version of the desktop operating system is loaded with fixes, new features, and a renewed focus on the now-iconic Raspberry Pi. Yes, folks, with a compatible Pi (models with 4GB or 8GB of RAM), you can now have the full Ubuntu desktop experience. Wow!\n Mark Shuttleworth, CEO at Canonical explains, &#34;In this release, we celebrate the Raspberry Pi Foundation’s commitment to put open computing in the hands of people all over the world. We are honored to support that initiative by optimizing Ubuntu on the Raspberry Pi, whether for personal use, educational purposes or as a foundation for their next business venture.&#34;\n Canonical shares, &#34;On top of Raspberry Pi desktop support, Ubuntu 20.10 includes GNOME 3.38, which tweaks the apps grid, removes the frequents tab and allows apps to be ordered and organised however users prefer. The battery percentage display toggle has been exposed in power settings, private WiFi hotspots can be shared using uniquely generated QR codes and a restart option has been added to the status menu next to logout/power off.&#34;\n Yeah, Ubuntu 20.10 comes with  GNOME 3.38 by default -- the absolute best desktop environment. Groovy Gorilla has the modern Linux kernel 5.8 too. The operating system is chock full of great pre-installed software, such as Firefox 81, LibreOffice 7.0.2, and Thunderbird 78.3.2. Of course, there are countless other great applications you can install yourself.\n   Ready to try Ubuntu 20.10 Groovy Gorilla? You can soon download the ISO  here. And hey, if you need a USB drive to create installation media, you should check out this cute penguin flash drive  here.", "posttime": "2020-10-23 04:11:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "raspberry-pi,ubuntu,linux,gorilla", "title": "Ubuntu Linux20.10‘Groovy Gorilla’带来了新的Raspberry PI焦点", "title_en": "Ubuntu Linux 20.10 'Groovy Gorilla' is Here With Renewed Raspberry Pi Focus", "transed": 1, "url": "https://betanews.com/2020/10/22/ubuntu-linux-2010-groovy-gorilla-2/", "via": "", "real_tags": ["ubuntu", "linux", "gorilla"]}, {"category": "", "categoryclass": "", "imagename": "3060f89cd7f3fecedd8e696686d8ff76.jpg", "infoid": 1030655, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由撰写者撰写的黑客组织通常被称为活力熊或TEMP.Isotope-由多家安全公司与俄罗斯联系起来-是最近几周国家和地方网络遭到入侵的主要嫌疑人，这已经不是什么秘密了。但现在美国联邦官员正式将这一活动归咎于黑客。\n这是美国更广泛努力的一部分，目的是在选举日之前更迅速地指责外国对手的不当行为，同时向选民保证选举受到保护。在这种情况下，联邦官员表示，这个俄罗斯组织利用新旧软件漏洞的组合，攻破了州和地方官员使用的一些IT基础设施，但坚称没有证据表明“选举数据的完整性受到了损害”。\n美国联邦调查局(FBI)和美国网络安全和基础设施安全局(U.S.CyberSecurity And Infrastructure Security Agency)周四在一份声明中表示：“俄罗斯国家支持的APT演员已经瞄准了数十个国家、地方、领土和部落的SLTT[国家、地方、领土和部落]网络和航空网络，试图入侵几个SLTT组织，成功破坏了网络基础设施，截至2020年10月1日，从至少两个受害者服务器上泄露了数据。”\n声明继续说：“到目前为止，FBI和CISA没有任何信息表明这名合适的参与者故意扰乱了任何航空、教育、选举或政府业务。”“然而，行为者可能在寻求获得未来的破坏选项，影响美国的政策和行动，或者使SLTT政府实体失去合法性。\nCyberScoop周一首次公开披露，根据安全公司FireEye的一项私人分析，TEMP.Isotope组织被怀疑是这场运动的幕后黑手。\n联邦官员此前只是暗示外国政府参与了黑客行动，同时鼓励州和地方官员更新他们的软件。这一活动影响了一些“选举支持系统”，也就是州和地方官员用于一系列职能的IT基础设施。官员们说，这不会影响选民登记数据库或其他更敏感的数据。\n据私营部门分析师称，TEMP.Isotope是一个资源丰富的间谍组织，有针对乌克兰2019年大选以及欧洲和美国各地能源公司的历史。该组织出现在美国各州和地方网络上，促使联邦官员和私人网络安全专家展开调查。据CISA一位发言人称，作为周五例行机密简报的一部分，选举官员获得了有关TMP.Isotope威胁的更多信息。\n与4年前相比，国家和地方网络的网络防御已经有所改善，当时另一组据称代表GRU军事情报机构运作的俄罗斯黑客探测了全国各地的IT系统，并侵入了伊利诺伊州的选民登记数据库。\n在公开指责TEMP.Isotope运动之前，美国情报和国家安全官员在星期三的新闻发布会上指责伊朗针对选民的一系列威胁性电子邮件。美国国家情报总监约翰·拉特克利夫(John Ratcliffe)也表示，俄罗斯和伊朗已经获得了一些美国选民的信息，但没有说明是如何获得的。许多选民登记信息都是公开的。", "note_en": "Written by        It’s no secret that the hacking group often referred to as Energetic Bear or TEMP.Isotope — linked by multiple security firms to Russia — is the prime suspect in a handful of breaches of state and local networks in recent weeks. But now U.S. federal officials are formally blaming the hackers for the activity.\n It’s part of a broader U.S effort to more swiftly accuse foreign adversaries of wrongdoing ahead of Election Day while reassuring voters that the election is being protected. In this case, federal officials said the Russian group had used a combination of old and new software vulnerabilities to breach some IT infrastructure used by state and local officials, but that there was no evidence that the “integrity of elections data has been compromised.”\n “The Russian state-sponsored APT actor has targeted dozens of SLTT [state, local, territorial and tribal] and aviation networks, attempted intrusions at several SLTT organizations, successfully compromised network infrastructure, and as of October 1, 2020, exfiltrated data from at least two victim servers,” the FBI and U.S. Cybersecurity and Infrastructure Security Agency said in a statement Thursday.\n “To date, the FBI and CISA have no information to indicate this APT actor has intentionally disrupted any aviation, education, elections, or government operations,” the statement continued. “However, the actor may be seeking access to obtain future disruption options, to influence U.S. policies and actions, or to delegitimize SLTT government entities.\n CyberScoop on Monday first  publicly revealed that the TEMP.Isotope group was suspected of being behind the campaign, based on a private analysis from security company FireEye.\n Federal officials had  previously only alluded to foreign-government involvement in the hacking campaign while encouraging state and local officials to update their software. The activity affected some “elections support systems,” or IT infrastructure that state and local officials use for a range of functions. It did not affect voter registration databases or other more sensitive data, officials said.\n TEMP.Isotope is a well-resourced espionage group with a history of targeting Ukraine’s 2019 election as well as energy firms across Europe and the U.S., according to private-sector analysts. The group’s presence on U.S. state and local networks prompted federal officials and private cybersecurity experts to investigate. Election officials were given additional information about the TEMP.Isotope threat as part of a regular classified briefing on Friday, according to a CISA spokesperson.\n The cyberdefenses of state and local networks have improved from four years ago, when another set of Russian hackers, allegedly operating on behalf of the GRU military intelligence agency, probed IT systems across the country and compromised Illinois’ voter registration database.\n The public attribution for the TEMP.Isotope campaign follows a press conference Wednesday in which U.S. intelligence and national security officials  blamed Iran for a series of threatening emails targeting voters. Director of National Intelligence John Ratcliffe also said that Russia and Iran had obtained access to some U.S. voter information, but did not say how. Much of voter registration information is available publicly.", "posttime": "2020-10-23 04:11:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,俄罗斯,表示,linked,官员", "title": "美国表示，与俄罗斯有关联的组织针对的是州和地方官员使用的IT系统，但没有证据表明“选举数据的完整性受到了损害”", "title_en": "US says Russia-linked group targeted IT systems used by state and local officials, but there was no evidence “integrity of elections data has been compromised”", "transed": 1, "url": "https://www.cyberscoop.com/temp-isotope-russia-cisa-election-security/", "via": "", "real_tags": ["美国", "俄罗斯", "表示", "linked", "官员"]}, {"category": "", "categoryclass": "", "imagename": "702ae0c924b2d2f4055fdb36942172eb.png", "infoid": 1030654, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "协作人在Linux内核中继续非常活跃，在此版本中创作了超过150个提交，主要是在硬件支持、多媒体、图形和测试方面。", "note_en": "Collaborans continue to be very active in the Linux kernel, authoring over 150 commits in this release, primarily in hardware support, multimedia, graphics and testing.", "posttime": "2020-10-23 04:07:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "内核,kernel,linux", "title": "内核5.9：更高版本和更高版本", "title_en": "Kernel 5.9: Onwards and Upwards", "transed": 1, "url": "https://www.collabora.com/news-and-blog/news-and-events/kernel-5.9.html", "via": "", "real_tags": ["内核", "kernel", "linux"]}, {"category": "", "categoryclass": "", "imagename": "51ce4d0597c92556e291d1a74d251921.png", "infoid": 1030653, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Pytest-Austin插件将Python性能测试直接带入您的CI管道。它使用奥斯汀来分析您的测试运行，而不需要任何检测。您所要做的就是简单地标记要对其执行检查以防止性能倒退的测试。\n任何失败的测试都将在会话结束时由pytest报告。所有收集到的统计数据都写在一个前缀为ASTIN_的文件中，后跟一个截断的时间戳，位于pytest rootdir内。您可以将其放到SpeedScope上，以便快速直观地表示您的测试。\n====测试会话启动====platform Linux--Python3.6.9，pytest-6.0.1，py-1.9.0，Pluggy-0.13.1--/home/gabriele/.cache/pypoetry/virtualenvs/pytest-austin-yu27Ep_e-py3.6/bin/python3.6cachedir：.pytest_cacherootdir：/tmp/pytest-of-gabriele/pytest-226/test_austin_time_checks0plugins：cov-2.10.0，奥斯汀-0.1.0收集...。已收集3项stest_austin_time_checks.py：：TEST_LINES PASSEDtest_austin_time_checks.py：：test_check_fails PASSEDtest_austin_time_checks.py：：test_check_succeeds PASSED=Austin Report=austin 2.0.0收集写入/tmp/pytest-of-gabriele/pytest-226/test_austin_time_checks0/.austin_97148135487643.aprof🕑采样时间的统计信息(最小/平均/最大)：376/3327/18019μ的🐢长采样率：87/87(100.00)个样本。花费的时间超过采样间隔💀错误率：0/87(0.00%)无效样本TEST_ASTIN_TIME_CHECKs.py：：TEST_LINES TEST_LINES：19(TEST_ASTIN_TIME_CHECKS.py)-16.0毫秒(-78.2%，共20.5ms)TEST_ASTIN_TIME_CHECKS.py：：TEST_LINES TEST_LINES：18(TEST_奥斯汀_TIME_CHECKs.py)-4.1ms(-10.1%，共40.3毫秒)TEST_奥斯汀_。Time_checks.py：：TEST_LINES斐波那契(TEST_ASTIN_TIME_CHECKs.py)-9.3ms(-18.6%，共50 ms)test_austin_time_checks.py：：test_check_fails TEST_CHECK_FAILES(TEST_奥斯汀_TIME_CHECKs.py))+99.8ms(1000.0μs)test_austin_time_checks.py：：test_check_succeeds TEST_CHECK_SUCCESS(TEST_奥斯汀_TIME_CHECKS.py)的9978.6)。-9.0 ms(110.0 ms)=1检查失败=3在0.35s=中通过的-8.1%.。\n注为了使插件正常工作，Austin二进制文件需要位于PATH环境变量中。请参阅Austin安装说明，了解如何在您的平台上轻松安装Austin。\n安装后，该插件将尝试将Austin附加到pytest进程，以便在您每次运行pytest时对其进行采样。如果你想阻止奥斯汀分析你的测试，你必须偷走它的魔力。可以使用--steal-mojo命令行参数执行此操作。\n该插件在收集的测试项目上查找TOTAL_TIME标记，该标记需要一个强制参数时间和三个可选参数时间：函数、模块和行。\n如果您只是想检查测试项目的持续时间不会超过时间，您可以用@pytest.mark.total_time(Time)标记它。这里，timeca可以是一个浮点型(以秒为单位)，也可以是datetime.timeDelta的一个实例。\n在某些情况下，您可能希望确保在测试脚本的某一行上调用的函数或方法在一定的时间内执行，比如总测试时间的5%。你可以像这样做到这一点\n导入pytest@pytest。马克。TOTAL_TIME(&#34；5%&#34；，line=7)def test_hello_default()：ome function()fast function()#&lt；-这是测试脚本中的第7行某一其他函数()。\n然而，在许多情况下，人们会想要测试测试直接或间接调用的函数或方法的运行时间是否不超过一定的总时间。这就是TOTAL_TESTMARK的剩余参数发挥作用的地方。假设您想要分析由Snafu类型的对象的foo方法调用的过程栏。要确保BAR花费的时间不会超过总测试持续时间的50%，您可以这样写。\n可以使用模块参数来解决函数名冲突。例如，如果函数/方法栏的定义出现在模块Somemodule.py和某个其他模块e.py中，但您只对Somemodule.py中定义的模块感兴趣，则可以将上述内容更改为。\n虽然您还可以指定行号，但这在测试脚本本身之外可能不是很方便和实用，除非模块的内容足够稳定，行号不需要频繁更新。\n在本例中，负数(如-16.0毫秒)表示TEST_LINES：19(test_austin_time_checks.py)上花费的总时间比TOTAL_TIME标记指定的总允许时间(在本例中为20.5毫秒)少16.0毫秒。因此，负数表示检查成功。\n这表示TEST_CHECK_FAIES(test_austin_time_checks.py)花费的总时间比所需阈值(设置为1毫秒)多99.8毫秒。\n可以使用TOTAL_MEMORY标记执行内存分配检查。第一个参数是大小，它可以是标记的测试用例的总内存分配的百分比，也可以是最大内存量的绝对度量，例如，24MB&#34；。函数、模块和行与TOTAL_TIME标记相同。可以将额外的net参数设置为True，以检查总的净内存使用量，即内存分配和释放之间的差异。\n为了执行内存检查，您需要通过--profile-mode选项指定内存或所有配置文件模式。\n报告中插件报告的负内存增量和正内存增量的行为类似于上一节中描述的时间增量。也就是说，负值内存增量表示检查成功，而正值表示检查失败。\n在All Profile模式下，您可以使用TOTAL_TIME和TOTAL_MEMORY标记执行时间和内存检查。\n如果您的测试产生了其他Python进程，您可以使用--mini选项要求pytest-austin也对它们进行概要分析。请注意，如果您的测试产生了许多非Python进程，那么采样率可能会因为Austin试图发现Python子进程的方式而受到影响。\n此插件生成有关终端的报告，并将收集到的分析统计数据转储到文件系统，以供以后分析和可视化。可以使用--austin-report选项控制终端报告的详细程度。默认情况下，它设置为最小，这意味着只报告失败的检查。使用Full查看插件检测到并执行的所有检查的结果。\n关于性能分析统计数据的转储，默认情况下生成的文件是Austin格式(这是折叠堆栈格式的推广)。如果您希望插件以pprof或speedscope格式转储数据，您可以相应地设置--profile-format选项。\n这个插件已经在Linux、MacOS和Windows上进行了测试。鉴于它依赖于奥斯汀对pytest进程的帧堆栈进行采样，其兼容性考虑因素也适用于pytest-奥斯汀。\n在Linux上，需要使用sudo，除非向Austin二进制文件授予CAP_SYS_PTRACE功能，例如。\n然后，不再需要使用sudo来允许奥斯汀附加和采样pytest。\n在MacOS上，除非调用pytest的用户属于procmod组，否则也必须使用sudo。\n如果你喜欢最热的奥斯汀，而且你觉得它很有用，有很多方法可以让你做出贡献。\n如果您想帮助开发，那么在您打开Pull请求之前，先看一看公开的问题，并看一看有助于开发的指导方针。\n你也可以通过成为asonsor和/或给我买一杯BMC咖啡，或者在PayPal.me上捐几便士，来为最火爆的奥斯汀的发展做出贡献。", "note_en": "The pytest-austin plugin for  pytest bringsPython performance testing right into your CI pipelines. It uses Austin to profile your test runs withoutany instrumentation. All you have to do is simply mark the tests on which youwant to execute checks for preventing performance regressions.\n  Any failed tests will be reported by pytest at the end of the session. All thecollected statistics are written on a file prefixed with  austin_ and followedby a truncated timestamp, inside pytest rootdir. You can drop it onto Speedscope for a quick visual representation of yourtests.\n ================================================================ test session starts ================================================================platform linux -- Python 3.6.9, pytest-6.0.1, py-1.9.0, pluggy-0.13.1 -- /home/gabriele/.cache/pypoetry/virtualenvs/pytest-austin-yu27Ep_e-py3.6/bin/python3.6cachedir: .pytest_cacherootdir: /tmp/pytest-of-gabriele/pytest-226/test_austin_time_checks0plugins: cov-2.10.0, austin-0.1.0collecting ... collected 3 itemstest_austin_time_checks.py::test_lines PASSEDtest_austin_time_checks.py::test_check_fails PASSEDtest_austin_time_checks.py::test_check_succeeds PASSED=================================================================== Austin report ===================================================================austin 2.0.0Collected stats written on /tmp/pytest-of-gabriele/pytest-226/test_austin_time_checks0/.austin_97148135487643.aprof🕑 Sampling time (min/avg/max) : 376/3327/18019 μs🐢 Long sampling rate : 87/87 (100.00 %) samples took longer than the sampling interval💀 Error rate : 0/87 (0.00 %) invalid samplestest_austin_time_checks.py::test_lines test_lines:19 (test_austin_time_checks.py) -16.0 ms (-78.2% of 20.5 ms)test_austin_time_checks.py::test_lines test_lines:18 (test_austin_time_checks.py) -4.1 ms (-10.1% of 40.3 ms)test_austin_time_checks.py::test_lines fibonacci (test_austin_time_checks.py) -9.3 ms (-18.6% of 50.0 ms)test_austin_time_checks.py::test_check_fails test_check_fails (test_austin_time_checks.py) +99.8 ms (9978.6% of 1000.0 μs)test_austin_time_checks.py::test_check_succeeds test_check_succeeds (test_austin_time_checks.py) -9.0 ms (-8.1% of 110.0 ms)================================================================== 1 check failed ==================================================================================================================================== 3 passed in 0.35s =================================================================\n    NOTE In order for the plugin to work, the Austin binary needs to be on the PATH environment variable. See  Austininstallation instructions tosee how you can easily install Austin on your platform.\n   Once installed, the plugin will try to attach Austin to the pytest process inorder to sample it every time you run pytest. If you want to prevent Austin fromprofiling your tests, you have to steal its mojo. You can do so with the --steal-mojo command line argument.\n  The plugin looks for the  total_time marker on collected test items, whichtakes a mandatory argument  time and three optional ones:  function,  moduleand  line.\n If you simply want to check that the duration of a test item doesn&#39;t take longerthan  time, you can mark it with  @pytest.mark.total_time(time). Here,  timecan either be a  float (in seconds) or an instance of  datetime.timedelta.\n  In some cases, you would want to make sure that a function or method called on acertain line in your test script executes in under a certain amount of time, say5% of the total test time. You can achieve this like so\n import  pytest @ pytest. mark. total_time( &#34;5%&#34;,  line = 7) def  test_hello_default():  somefunction()  fastfunction()  # &lt;- this is line no. 7 in the test script  someotherfunction()\n In many cases, however, one would want to test that a function or a methodcalled either directly or indirectly by a test doesn&#39;t take more than a certainoverall time to run. This is where the remaining arguments of the  total_testmarker come into play. Suppose that you want to profile the procedure  barthat is called by method  foo of an object of type  Snafu. To ensure that bar doesn&#39;t take longer than, say, 50% of the overall test duration, you canwrite\n  You can use the  module argument to resolve function name clashes. For example,if the definition of the function/method  bar occurs within the modules somemodule.py and  someothermodule.py, but you are only interested in theone defined in  somemodule.py, you can change the above into\n  And whilst you can also specify a line number, this is perhaps not very handyand practical outside of test scripts themselves, unless the content of themodule is stable enough that line numbers don&#39;t need to be updated veryfrequently.\n   In this case, a negative number, such as  -16.0 ms, indicates that the totaltime spent on  test_lines:19 (test_austin_time_checks.py) was 16.0 ms lessthan the total allowed time specified with the  total_time marker, which inthis example is 20.5 ms. Hence, negative numbers indicate a successful check.\n   This indicates that the total time spent on test_check_fails (test_austin_time_checks.py) was 99.8 ms more than therequired threshold, which was set to 1 ms.\n  One can perform memory allocation checks with the  total_memory marker. Thefirst argument is  size, which can be a percentage of the total memoryallocation of the marked test case, as well as an absolute measure of themaximum amount of memory, e.g.,  &#34;24 MB&#34;. The  function,  module and line are the same as for the  total_time marker. The extra  netargument can be set to  True to check for the total  net memory usage, thatis the difference between memory allocations and deallocations.\n  In order to perform memory checks, you need to specify either the  memory or all profile mode via the  --profile-mode option.\n The negative and positive memory deltas reported by the plugin in the reportbehave like the time deltas described in the previous section. That is, anegative memory delta indicates a successful check, whereas a positive deltaindicates a check that has failed.\n  When in the  all profile mode, you can perform both time and memory checks bystacking  total_time and  total_memory markers.\n   If your tests spawn other Python processes, you can ask pytest-austin to profilethem too with the  --minime option. Note that if your tests are spawning toomany non-Python processes, the sampling rate might be affected because of theway that Austin tries to discover Python child processes.\n  This plugins generate a report on terminal and dumps the collected profilingstatistics on the file system as well, for later analysis and visualisation. Theverbosity of the terminal report can be controlled with the  --austin-reportoption. By default, it is set to  minimal, which means that only checks thathave failed will be reported. Use  full to see the results for all the checksthat have been detected and executed by the plugin.\n Regarding the dump of the profiling statistics, the generated file is in theAustin format by default (this is a generalisation of the collapsed stackformat). If you want the plugin to dump the data in either the  pprof or speedscope format, you can set the  --profile-format option accordingly.\n  This plugin has been tested on Linux, MacOS and Windows. Given that it relies on Austin for sampling the frame stacks ofthe pytest process, its compatibility considerations apply to pytest-austin aswell.\n On Linux, the use of  sudo is required, unless the  CAP_SYS_PTRACEcapability is granted to the Austin binary with, e.g.\n  Then the use of  sudo is no longer required to allow Austin to attach andsample pytest.\n On MacOS, the use of  sudo is also mandatory, unless the user that isinvoking pytest belongs to the  procmod group.\n  If you like pytest-austin and you find it useful, there are ways for you tocontribute.\n If you want to help with the development, then have a look at the open issuesand have a look at the  contributing guidelines before youopen a pull request.\n You can also contribute to the development of the pytest-austin by becoming asponsor and/or by  buying me a coffeeon BMC or by chipping in a few pennies on PayPal.Me.", "posttime": "2020-10-23 03:46:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "性能,austin", "title": "Pytest-Austin：无指令插入的性能回归测试", "title_en": "Pytest-austin: performance regression testing with no instrumentation", "transed": 1, "url": "https://github.com/P403n1x87/pytest-austin", "via": "", "real_tags": ["性能", "austin"]}, {"category": "", "categoryclass": "", "imagename": "ef74bbac00091ecd26976f0352b629df.jpg", "infoid": 1030652, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“今日社区”的客座作者丹尼尔·佩拉诺(Daniel Perano)是“我的世界”(MyWorld)的全栈开发者和创始人。他是使用CockroachDB构建有趣项目的众多开发人员之一。如果你想客串写一篇关于你的项目的博客，请联系我们的社区闲置频道。\nMyWorld是下一代虚拟世界初创公司。当前的社交虚拟世界(如Second Life和OpenSimulator)是建立在几十年前的技术之上的，它们的设计从根本上是有限的。MMOG(大规模多人在线游戏)开发人员缺乏一个通用的、可扩展的平台，这意味着需要多年的工作和数百万美元才能为几乎每一个MMOG构建一个自定义引擎-迫使独立工作室和许多其他小型开发人员完全退出市场。在MyWorld，我们正在从头开始构建一个全新的虚拟世界平台，使用现代工具和技术创建一个快速、可伸缩和可扩展的平台，为下一代社交虚拟世界和大型多人在线游戏提供动力。\n此外，我们想要一个数据库，它遵循我们自己的哲学，即制作尽可能自我维护的软件，并且只需要最少的人工交互来操作。最后，我们需要我们使用的任何数据库都是开源或开放核心的-这种开放性是MyWorld传统和设计理念的核心，而且由于MyWorld将在alpha和beta发布之后的某个时候开放源代码，我们不能考虑关闭源代码或供应商锁定的数据库。\n在幕后，我们的技术堆栈在很大程度上建立在内部代码和一些业内最好的开源软件的组合上。数据库层基于轻量级ORM模式-Postgres JDBC驱动程序、HikariCP连接池和jNimble ORM，上面有一个薄层，用于将我们的域对象映射到SQL或从SQL映射(为了设计灵活性和性能，所有查询都是手写的-我们现在不使用jNimble的自动映射特性)。在更高的层次上，我们的物理引擎是Bullet，我们在服务器端和客户端都使用jMonkeyEngine游戏引擎。世界模拟是通过内部实体系统处理的，脚本编写是使用强大的高级内部脚本语言(使用类、一流函数、动态类型和多态性面向对象)完成的。我们使用Jetty HTTP服务器满足嵌入式HTTP需求，客户端UI使用JavaFX完成。\n在移植数据库后端以使用CockroachDB之前，我们使用的是Cassandra。最初，这很顺利，因为我们的数据模型总是被设计成在数据库表示方面尽可能简单和直接。然而，随着我们的增长和发现越来越多的查询需求，Cassandra的非规范化模式和缺乏灵活的索引开始成为一个真实且非常明显的限制，特别是因为它的范围严重受限的查询意味着在其开箱即用功能之上实现我们自己的更高级别的索引将是一项非常困难的工作。\n我们在Cassandra上坚持了尽可能长的时间-它是一个非常快速和可伸缩的数据库，并且它已经在与任何其他数据库都不同的规模上进行了试验和验证(苹果的集群超过了75k活动节点)。真正的水平可伸缩性和在节点关闭的情况下保持操作的能力对我们至关重要。然而，我们越是遇到卡桑德拉对我们数据模型的限制，我们就越意识到卡桑德拉对我们设计的影响：\n使用Cassandra过度影响了模型，限制了我们更高级别的设计选择，并迫使我们在应用程序级别而不是在数据库中维护某些区域的数据一致性。一些设计权衡总是必须在分布式环境中进行，但是Cassandra正在以数据库不应该影响的方式影响更高级别的设计选择。\n卡桑德拉很出色，但我们的需求只是超出了卡桑德拉的设计能力。此外，虽然Cassandra的“CCM”工具可以很好地管理开发中的仅限本地的数据库集群，但我们越来越担心Cassandra在生产中可能需要的运营开销水平。\n由于我们对Cassandra的投资以及对性能权衡的担忧，我们最初评估CockroachDB的速度很慢。然而，一旦我们尝试移植一些数据库代码，并尝试使用Cassandra时遇到困难的领域，几乎就会做出决定。我们可以以任何最适合每个区域的方式对数据建模，如果我们需要对几个不相关的数字列进行范围查询(这在Cassandra中很难高效完成)，我们总是可以添加一个索引，然后或多或少地忘记它。\n切换到SQL意味着我们可以按照应该建模的方式对数据建模，并依赖完全的多表事务和SQL约束来维护数据完整性。从Cassandra迁移到SQL的过程出奇地轻松-我们的数据模型已经是强类型的表格形式，而且由于我们选择将查询编写为手写CQL(Cassandra查询语言，本质上是SQL的子集)，而不是使用ORM，所以我们只需对现有查询进行最小程度的语法和类型更改，就可以有一个运行CockroachDB的功能起点。\n选择SQL意味着获得灵活的索引、完整性约束、功能齐全的事务，以及以远远超过Cassandra所允许的灵活性高效地对数据建模的能力。选择CockroachDB尤其意味着我们可以拥有SQL的强大功能，只进行最低限度的性能权衡(更重要的是，能够以Cassandra无法支持的方式进行权衡)，在我们可以处理的流量和数据规模上有效地不妥协，并且操作几乎不需要人工干预。\n对我们来说，CockroachDB与Postgres的兼容性是另一个很大的优势--这意味着用久经考验的Postgres驱动程序&amp；库来开发我们的代码，在最糟糕的情况下，如果CockroachDB出现灾难性的问题，只需很少甚至不需要修改代码就可以切换到Postgres(尽管这会对可伸缩性造成严重影响)。\n最后但并非最不重要的一点是，CockroachDB只能在开发中工作。当我第一次尝试它时，我拼凑了一个基本的3行shell脚本来启动一个3节点集群。\n初始安装和设置只花了大约30分钟，包括摆弄集群参数和内置的Web仪表板。这让我很震惊-数据库不会出现这种情况，尤其是在集群配置中。\n您不需要下载软件，然后就像这样启动并运行一个3节点群集。在我得到了我喜欢的初始配置之后，我从来没有花费任何时间来修复任何东西-它就是不会坏。Cassandra的“CCM”工具也非常有效，但是在版本升级期间每隔几个月(或者仅仅是运气不好)就会出问题，我会花费数小时将数据库集群恢复到我的开发机器上。这种情况在CockroachDB中从未发生过一次。CockroachDB微不足道的适应服务器和本地开发环境的能力对我们来说是一个巨大的好处。\n我们还没有向公众推出MyWorld平台。我们的第一个公开测试版计划在2020年第二季度发布。现在，我们在一台开发机器上运行一个轻量级的3节点集群。我们预计将在全球范围内采用，这意味着我们将需要在地理上分布我们的集群，以降低用户的延迟，并遵守GDPR和其他全球数据本地化法规。虽然我们承诺只收集对操作至关重要的个人用户数据(例如帐户的电子邮件地址和入侵检测的IP地址日志)，但我们收集的数据可能会受到数据地方性法律的约束-因此我们可能需要CockroachDB的地理分区功能来将用户数据保存在它所属的国家/地区。\n如果您正在为您自己的产品评估CockroachDB，我强烈建议您只下载它并从命令行运行几个查询-您很快就会对它在开发中的处理方式有一个很好的感觉。[编者按：CockroachCloud是另一个快速启动和运行的选择--它是我们完全托管和托管的数据库即服务。我们从这里开始。]。如果您有正在考虑移植的现有代码库，请慢慢来阅读迁移指南和功能支持页面-我发现文档全面而清晰地说明了哪些是受支持的，哪些是不受支持的，以及您应该知道的任何注意事项。\n在这篇博客文章之后，我将用一个“第2部分”来讨论在我们推出MyWorld平台并扩大用户群之后生产中的数据库性能。同时，如果您想了解更多关于“我的世界”或关注我们的进展，请访问我们的网站，在Twitter或Facebook上关注我们，或者来与我们就不和谐或在CockroachDB社区闲聊！", "note_en": "community      Today&#39;s guest author, Daniel Perano, is a Full-Stack Developer &amp; Founder of  MyWorld. He is one of many developers building interesting projects with CockroachDB. If you&#39;d like to guest author a blog about your project please reach out on our  community slack channel.\n  MyWorld  is a next-generation virtual world startup. Current social virtual worlds (like   Second Life  and   OpenSimulator ) are built on decades-old technology and are fundamentally limited in their design. MMOG (Massive Multiplayer Online Game) developers lack a common, extensible platform, meaning that multiple years of work and millions of dollars are required to build a custom engine for almost every MMOG - forcing indie studios and many other small developers out of the market entirely. At MyWorld, we’re building a brand new virtual world platform from the ground up, using modern tools and technologies to create a fast, scalable, and extensible platform to power the next generation of social virtual worlds and massive multi-player online games.\n   In addition, we want a database that follows our own philosophy of making software that self-maintains as much as possible and requires minimal human interaction to operate. Lastly, we need any database we use to be open-source or open-core - this openness is central to MyWorld’s heritage and design philosophy, and since MyWorld will be open-sourced at some point after the alpha and beta releases we could not consider closed-source or vendor-locked databases.\n Under the hood, our tech stack builds heavily on a combination of in-house code and some of the best open-source software in the industry. The database layer is based on a lightweight ORM pattern - the   Postgres JDBC driver , a   HikariCP Connection pool , and the   jNimble ORM  with a thin layer on top of it to map our domain objects to/from SQL (all queries are handwritten for design flexibility and performance - we don’t use the automatic mapping features of jNimble right now). At a higher level, our physics engine is   Bullet  and we use the   jMonkeyEngine  game engine both server side and client side. The world simulation is handled through an in-house entity system, and scripting is done in a powerful high-level in-house scripting language (object oriented with classes, first-class functions, dynamic typing, and polymorphism). We use the   Jetty HTTP  server for our embedded HTTP needs, and the client-side UI is done with   JavaFX .\n  Prior to porting our database backend to use   CockroachDB , we were using Cassandra. Initially, this went well, as our data model has always been designed to be as simple and straightforward as possible in terms of database representation. However, as we grew and discovered more and more query needs, Cassandra’s denormalization patterns and lack of flexible indexing began to be a real and very noticeable constraint, especially since its severely limited range queries meant that implementing our own higher-level indices on top of its out-of-the-box functionality would be a very difficult endeavor.\n We held out on Cassandra for as long as we could - it’s a very fast and scalable database, and it’s been tried and proven at a scale unlike any other (  Apple’s cluster surpassed 75k active nodes ). True horizontal scalability and the ability to keep operating with nodes down is critical for us. However, the more we ran into Cassandra’s limitations on our data model, the more aware we became of Cassandra&#39;s impact on our design:\n Using Cassandra was unduly influencing the model, restricting our higher-level design choices, and forcing us to maintain certain areas of data consistency at the application level instead of in the database. Some design trade-offs always have to be made in a distributed environment, but Cassandra was influencing higher-level design choices in ways a database shouldn’t.\n Cassandra is outstanding, but our needs were simply outgrowing what Cassandra was designed to handle.  Additionally, while Cassandra’s “ccm” tool worked well for managing local-only database clusters in development, we had growing concerns about the level of operational overhead Cassandra might require in production.\n  Because of our investment in Cassandra and our concerns about performance trade-offs, we were slow to initially evaluate CockroachDB. Once we tried porting some of our database code and experimenting with the areas that had been difficult with Cassandra, however, the decision almost made itself. We could model our data whichever way suited each area best, and if we needed, say, a range query over several unrelated numeric columns (which is very difficult to do efficiently in Cassandra), we could always add an index and more or less forget about it.\n Switching to SQL meant that we could model our data the way it ought to be modeled and rely on full multi-table transactions and SQL constraints to maintain data integrity. The migration from Cassandra to SQL was surprisingly painless - our data model was already in a strongly-typed tabular form, and since we had opted to write our queries as handwritten CQL (Cassandra Query Language, which is essentially a subset of SQL) instead of using an ORM, we only had to make minimal syntactic and type changes to existing queries in order to have a functional starting point running with CockroachDB.\n Choosing SQL meant gaining flexible indices, integrity constraints, full-featured transactions, and the ability to efficiently model our data with far more flexibility than Cassandra allowed. Choosing CockroachDB in particular meant that we could have the power of SQL, make only minimal performance trade-offs (and more importantly, have the ability to make trade-offs in ways that Cassandra just couldn’t support), make effectively no compromises on the scale of traffic and data we could handle, and operate with little human intervention.\n CockroachDB’s compatibility with Postgres was another big plus for us - that meant developing our code with tried-and-proven Postgres drivers &amp; libraries, and in the worst case, the ability to switch to Postgres with little to no code modifications (albeit with a punishing hit to scalability) should something go catastrophically wrong with CockroachDB.\n Last but not least, CockroachDB just works in development. When I first tried it out I tossed together a bare-bones 3 line shell script to start a 3 node cluster.\n The initial installation and setup only took about 30 minutes, including fiddling with the clustering parameters and the built-in web dashboard. This shocked me - this just doesn’t happen with databases, especially in a clustered configuration.\n You don’t download the software and then have a 3 node cluster up and running just like that. After I got an initial configuration that I liked, I’ve never had to spend any time fixing anything - it just doesn’t break. Cassandra’s “ccm” tool was also very effective, but every few months during a version upgrade (or just plain bad luck) something would go wrong and I would spend hours just getting the database cluster back up on my development machine. That hasn’t happened once with CockroachDB. CockroachDB’s trivial ability to adapt to both server and local development environments is a tremendous benefit for us.\n  We have not yet launched the MyWorld platform to the public. Our first public beta releases are scheduled to happen in Q2 of 2020. Right now, we’re running a lightweight 3 node cluster on a dev machine. We anticipate adoption around the globe, which means we’ll need to geo-distribute our clusters to keep latencies down for users and to comply with the GDPR and other data localization regulations worldwide. While we’re committed to gathering only as much personal user data as is critical for operation (such as email addresses for accounts and IP address logs for intrusion detection), the data we do collect may be subject to data locality laws - so we’ll likely need CockroachDB’s geo-partitioning feature to keep our users’ data in the countries where it belongs.\n If you’re evaluating CockroachDB for your own product, I’d highly recommend just   downloading  it and running a few queries from the command line - you’ll quickly get a good feel for how it handles in development. [  Editor&#39;s note:  CockroachCloud is another option for getting up and running quickly--it&#39;s our fully managed and hosted database-as-a-service.   Get started here.] If you have an existing codebase that you’re considering porting, take your time to go through the   migration guides  and the   feature support page  - I’ve found the documentation to be comprehensive and clear about what’s supported, what’s not, and any caveats you should be aware of.\n I’ll follow up on this blog post with a ‘part 2’ to discuss database performance in production after we’ve launched the MyWorld platform and grown our user-base. In the meantime, if you’d like to know more about MyWorld or follow our progress, check out our   website , follow us on   Twitter  or   Facebook , or come chat with us on   Discord or in the  CockroachDB community slack !", "posttime": "2020-10-23 03:46:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "cassandra,switched", "title": "为什么MyWorld从Cassandra切换到CockroachDB", "title_en": "Why MyWorld Switched from Cassandra to CockroachDB", "transed": 1, "url": "https://www.cockroachlabs.com/blog/cassandra-to-cockroachdb/", "via": "", "real_tags": ["cassandra", "switched"]}, {"category": "", "categoryclass": "", "imagename": "686ffeb23c432d1aec644a54eddfa580.jpeg", "infoid": 1030651, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "关于最新的12.9&34；iPad Pro(2020年版)的详细评论。供过去几乎不接触苹果产品的PC用户使用。\n我不是苹果的忠实粉丝；事实上，我总是避开苹果产品，坚持使用微软或Android。我甚至有Windows手机，因为我认为它们会占领市场，成为Android和苹果的竞争对手。\n直到iPhone11的发布，我才决定给苹果一个机会。我买它是为了升级我的Pixel2，因为Pixel4不是真正的升级，前后镜头上的4K视频都吸引了我去冒险。它成功了，最近我决定也试一试iPad Pro。\n我看了一下11&34；和12.9&34；之间的比较。它们之间的区别不仅仅是屏幕尺寸，还有一些硬件上的不同，在我看来，12.9&34；只是多了一点。\nIPad Pro的便携性令人难以置信。它比市面上的大多数笔记本电脑都要轻得多，即使你把它和魔法键盘搭配在一起也是如此。尺寸对我来说也很完美，既不太大也不太小，我喜欢它可以随身携带并开始写作的事实。我在我妻子的车里写这篇博客，同时我在等她照顾完她的宠物。\n如果我有笔记本电脑，我就得把它打开，打开。然后等待它引导，然后我才能登录并打开一个程序进行一些编写。现在，我可以打开我的iPad，向上滑动，打开我最喜欢的编辑器。努力的差异简直令人难以置信。\n我也喜欢从我的台式PC(它已经成为我的主工作站)走到沙发上，打开我的iPad。\n我买了苹果铅笔，因为我想尝试一下生殖。我过去有一台Surface Pro 3，在它开始变慢之前，它一直是一台很棒的机器。在我的Pro3上，我喜欢Adobe体验，你也可以在iPad上获得这种体验。然而，大多数人更喜欢使用ProCreate作为iPad的数字设计应用程序。\n现在，我无论如何都不是一个艺术家，但我一直很享受能够时不时地画画，而拥有这张额外的画是非常棒的。它帮助我做了更多的爱好，并从社交媒体中解脱出来。我没有用过铅笔做笔记或设计应用程序或类似的东西，但如果我需要的话，至少它给了我这样的选择。\n此外，将iPad与类似纸张的屏幕保护器或Bellemond保护器搭配使用，可以增加纸张般的质感，从而改善您的绘图体验。我通常不会在我的任何移动或平板设备上使用屏幕保护，但在听了它如何增加纸张的感觉并减少眩光后，这对我来说是一个巨大的卖点。\n苹果生态系统一直是我不喜欢苹果产品的地方。我不想被他们的生态系统吸进去，被他们有围墙的花园所阻碍。坦率地说，这既是一种祝福，也是一种诅咒。然而，神奇的键盘和苹果铅笔配对并一起工作，创造了一种可爱的体验。此外，我喜欢把iPhone放在附近，让它识别我的苹果个人资料，并传输任何选定的数据。\n老实说，当我同时使用微软和Android产品时，我从未见过如此卓越的体验。然而，我仍然在努力不购买一切基于苹果的产品。我还有索尼耳机和Garmin健身手表，它们与我的苹果设备连接得非常好。\n好吧。您可能无法像真正的笔记本电脑或PC那样进行多任务处理，但您仍然可以很好地进行多任务处理。现在，我打开了Google Docs，右边打开了YouTube。你可以让它作为一个浮动窗口，你可以四处移动，或者你可以把它附加到你当前的应用程序上，在那里你可以使用屏幕中央的黑条来调整应用程序的大小。您可以在下面看到这两个选项。如果你觉得自己是一个多任务之王，还有另一个选择，让两个应用程序连接起来，第三个应用程序漂浮在周围。\n这不是一个成熟的计算体验，但它工作得很好，这是我喜欢使用的东西。希望苹果在未来可以改进这一点，我们可以同时打开更多的应用程序，特别是当你觉得你同时打开的应用程序还不够多的时候。\nApple Magic键盘很适合打字，几乎不需要按键，而且打字体验舒适，不会出错。我通常喜欢完整的键盘体验，个人会在台式机上使用Corsair机械键盘，通常会带着它去工作，因为我更喜欢它而不是笔记本键盘。不过，魔法键盘很棒，我喜欢用它。我正在用键盘写这篇你们现在正在读的整篇文章，不会那么糟糕的。\n总体而言，作为一个积极避免使用苹果产品的人，我印象非常深刻。体验非常棒，我迫不及待地想看到iPad Pro在未来的发展。当然，它并不像他们试图宣传的那样是一台成熟的PC，但如果你正在寻找一款便携的、高效的设备，那么它是一个高效的小工具，你应该考虑购买。\n它帮助我创造了更多的东西，提高了生产力，我希望这种趋势在未来会继续下去。如果你在购买iPad Pro时犹豫不决，我会说，如果它是万无一失的，那么你应该冒险一试，你不会后悔的。\n您是否购买了iPad Pro？你的想法是什么？让我们知道，我很想了解您是如何变得更有生产力的。", "note_en": "A detailed review on the latest 12.9&#34; iPad Pro (2020 edition). Used by a PC user who barely touched Apple products in the past.\n   I’m not the biggest Apple fan; in fact, I always avoided Apple products and stuck with either Microsoft or Android. I even had Windows phones because I thought they were going to take over the market and become a competitor to Android and Apple.\n It wasn’t until the release of the iPhone 11 when I fina lly decided to give Apple a chance. I purchased it as an upgrade to my Pixel 2 as the Pixel 4 wasn’t a real upgrade, and the 4K video on both the front and back lenses attracted me to take my chances. It worked out, and recently I decided I wanted to give the iPad Pro a go as well.\n I took a look at comparisons between the 11&#34; and the 12.9&#34;. The differences between them weren’t just the screen sizes, but there were also a few hardware differences too, and the 12.9&#34; just had a little more going for it in my eyes.\n  The portability of the iPad Pro is incredible. It’s much more lightweight than most laptops out there, even when you pair it with the magic keyboard. The size is also perfect for me, it’s not too big and not too small, and I love the fact I can take it with me anywhere and start writing. I’m writing this blog post in my wife’s car while I wait for her to finish her pet sitting.\n If I had a laptop, I would have to open it up, turn it on. Then wait for it to boot before I could log in and open a program to do some writing. Now I can unfold my iPad, swipe up and open my favourite editor. The difference in effort is nothing short of incredible.\n I also love going from my desktop pc, which has become my main-working station to my couch and opening up my iPad.\n  I purchased the Apple Pencil because I wanted to try my hand at some ProCreate. I’ve had a Surface Pro 3 in the past, which was a great machine until it started slowing down. On my Pro 3, I loved the Adobe experience, which you can also get on the iPad. However, most people prefer to use ProCreate as the digital design app of choice for iPads.\n Now, I’m not an artist by any means, but I have always enjoyed being able to draw from time to time, and having this as an extra has been excellent. It’s helped me do more of my hobbies and unwind from social media. I haven’t used the pencil for notes or designing apps or anything like that, but at least it gives me that option if I ever need it.\n Also, pairing the iPad with a screen protector such as the Paperlike or Bellemond protector adds a paper-like texture and can improve your drawing experience. I don’t usually use a screen protector on any of my mobile or tablet devices, but after hearing how it can add a more paper feel and reduces glare which was a massive sell for me.\n  The Apple ecosystem has always been something that I disliked with Apple products. I didn’t want to get suckered into their ecosystem and be hindered by their walled garden. It is both a blessing and a curse in all honesty. However, the magic keyboard and Apple Pencil pairing and working together makes for a lovely experience. Also, I loved the fact I could place my iPhone nearby, and have it recognise my Apple profile and transfer any selected data.\n I have honestly never seen such a more superior experience when I’ve used both Microsoft and Android products. However, I am still trying not to buy everything Apple-based. I still have Sony headphones and a Garmin fitness watch which work perfectly fine connected to my Apple devices.\n  Okay. You might not be able to multitask like a real laptop or PC, but you can still multitask very well. Right now, I have Google Docs open with YouTube open to the right. You can have it as a floating window which you can move around, or you can have it attached to your current app where you can resize the apps using the black bar towards the centre of the screen. You can see both options below. There’s also another option to have two apps attached and a third app floating around if you feel like a multitasking king.\n   It’s not a full-blown computing experience, but it works well, and it’s something I enjoy using. Hopefully, Apple can improve on this in the future, and we can have many more apps open at the same time, especially if you feel you haven’t got enough apps open at the same time.\n  The Apple Magic keyboard is nice to type on, with very little key-travel, and a comfortable typing experience, you can’t go wrong. I usually favour a full-blown keyboard experience and personally use a Corsair mechanical keyboard for my desktop and typically take it with me to work because I prefer it to a laptop keyboard. However, the magic keyboard is excellent, and I enjoy using it. I’m using the keyboard to write this whole article that you’re reading right now, which can’t be that bad.\n  Overall, and after being someone who actively avoided Apple products, I’m very impressed. The experience has been fantastic, and I can’t wait to see the iPad Pro evolve in the future. Of course, it’s not a full-blown PC like they try to advertise, but it is a productive gadget that you should consider purchasing if you’re looking for a portable and productive device.\n It has helped me create more, and be more productive, and I’m hopeful this trend will continue in the future. If you were in two minds about purchasing an iPad Pro, I would say that if it’s ticking all the boxes, then you should take the plunge and you won’t regret the purchase.\n Have you purchased an iPad Pro? What are your thoughts? Let us know; I’d love to learn how you have become more productive.", "posttime": "2020-10-23 03:46:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电脑,2020,个人电脑,pc,苹果", "title": "IPad 12.9“2020年回顾(个人电脑用户视角)", "title_en": "iPad 12.9“ 2020 review (A PC user’s perspective)", "transed": 1, "url": "https://mbrooksuk.medium.com/ipad-12-9-2020-review-a-pc-users-perspective-a7fb6123542e", "via": "", "real_tags": ["电脑", "2020", "个人电脑", "pc", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "0baeede731a76152dcf05c9d1c7c58ad.png", "infoid": 1030649, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "麦当劳的冰激凌自动售货机坏了吗？", "note_en": "is the mcdonald's ice cream machine broken?", "posttime": "2020-10-23 03:24:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冰激凌,ice", "title": "麦当劳的哪台冰激凌机坏了？", "title_en": "Which McDonald’s Ice Cream Machines Are Broken?", "transed": 1, "url": "http://mcbroken.com", "via": "", "real_tags": ["冰激凌", "ice"]}, {"category": "", "categoryclass": "", "imagename": "48734b1162d4f8899b3eceba01c1b36a.png", "infoid": 1030648, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "‎是iOS上的一个类似linux的shell。您可以使用sed和cat编辑文件，移动它们，等等！https://github.com/ish-app/ish/", "note_en": "‎A Linux-like shell on iOS. You can edit files with sed and cat, move them around, and more!https://github.com/ish-app/ish/", "posttime": "2020-10-23 03:23:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "壳牌,shell,linux", "title": "ISH壳牌在App Store上推出", "title_en": "iSH Shell Launches on the App Store", "transed": 1, "url": "https://apps.apple.com/us/app/ish-shell/id1436902243", "via": "", "real_tags": ["壳牌", "shell", "linux"]}, {"category": "", "categoryclass": "", "imagename": "e2d990bc87af31832d1a85a7a4886065.jpg", "infoid": 1030647, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它们通常被组织成业务单位，每个业务单位都有自己的一组功能。因此，关键的决策者-单位领导-缺乏对所有与他们相关的领域的深刻理解。\n公司围绕职能进行组织，专业知识与决策权保持一致。领导者具有跨职能的协作性，并且对细节了如指掌。\n苹果以其在硬件、软件和服务方面的创新而闻名。多亏了他们，它从1997年史蒂夫·乔布斯回归时的约8000名员工和70亿美元的收入增长到2019年的13.7万名员工和2600亿美元的收入。鲜为人知的是组织设计和相关的领导模式，它们在公司的创新成功中发挥了关键作用。\n当乔布斯回到苹果的时候，对于像他这样规模和范围的公司来说，它有一个传统的结构。它被划分为业务部门，每个部门都有自己的盈亏责任。总经理们管理着麦金塔产品集团、信息家电事业部和服务器产品事业部等。就像分散经营的业务部门经常出现的情况一样，经理们倾向于相互争斗，特别是在转移价格上。乔布斯认为传统管理扼杀了创新，在他重新担任首席执行官的第一年，他(在一天内)解雇了所有业务部门的总经理，将整个公司置于一个损益表之下，并将业务部门中不同的职能部门合并为一个职能组织。\n对于当时苹果这样规模的公司来说，采用功能性结构可能并不令人意外。令人惊讶的是，尽管苹果的营收是1998年的近40倍，也远比1998年复杂，但苹果今天仍然保留了这一点，这一点令人惊讶。高级副总裁负责职能，而不是产品。就像他之前的乔布斯一样，首席执行官蒂姆·库克在组织结构图上占据着唯一的位置，在苹果的任何主要产品的设计、工程、运营、营销和零售方面都有交汇之处。实际上，除了首席执行官，该公司没有传统的总经理：他们控制着从产品开发到销售的整个过程，并根据宝洁的一份声明进行评判。\n商业历史和组织理论表明，随着创业型公司规模的扩大和复杂性的增加，它们必须从职能结构转变为多部门结构，以使责任和控制保持一致，并防止当无数决策沿着组织结构图向上流动到最高层时发生的拥堵。赋予业务部门领导对关键职能的完全控制权，使他们能够做最能满足各自单位客户需求并最大化其结果的事情，并使监督他们的高管能够评估他们的业绩。正如哈佛商学院(Harvard Business School)历史学家阿尔弗雷德·钱德勒(Alfred Chandler)所记录的那样，杜邦(DuPont)和通用汽车(General Motors)等美国公司在20世纪初从功能性结构转变为多部门结构。到本世纪下半叶，绝大多数大公司都效仿了这一做法。苹果证明，这种传统的方法没有必要，这种功能结构可能会让面临巨大技术变革和行业剧变的公司受益。\n苹果对一个功能性组织的承诺并不意味着它的结构一直保持不变。随着人工智能和其他新领域的重要性增加，这种结构已经改变。在这里，我们讨论苹果独特且不断发展的组织模式的创新优势和领导力挑战，对于希望更好地了解如何在快速变化的环境中取得成功的个人和公司来说，这可能是有用的。\n苹果的主要目的是创造丰富人们日常生活的产品。这不仅包括开发全新的产品类别，如iPhone和Apple Watch，还包括在这些类别中不断创新。也许没有什么产品功能比iPhone摄像头更能体现苹果对持续创新的承诺。2007年，当iPhone问世时，史蒂夫·乔布斯在一年一度的发布新产品的主旨活动中，只花了6秒的时间在相机上。从那时起，iPhone相机技术以一系列创新为摄影业做出了贡献：高动态范围成像(2010)、全景照片(2012)、真色调闪光灯(2013)、光学稳像(2015)、双镜头相机(2016)、肖像模式(2016)、肖像照明(2017)和夜间模式(2019年)只是其中的一小部分改进。\n为了创造这样的创新，苹果依赖于以功能专业知识为中心的结构。它的基本信念是，那些在某个领域拥有最多专业知识和经验的人应该拥有该领域的决策权。这是基于两种观点：首先，苹果在技术变革和颠覆率较高的市场上竞争，因此它必须依靠对导致颠覆的技术有深刻了解的人的判断和直觉。早在获得市场反馈和可靠的市场预测之前，该公司就必须押注哪些技术和设计可能在智能手机、电脑等领域取得成功。依赖技术专家而不是总经理会增加这些赌注获得回报的可能性。\n其次，如果短期利润和成本目标是评判投资和领导者的压倒一切的标准，那么苹果提供尽可能好的产品的承诺将被削弱。值得注意的是，高级研发主管的奖金是基于整个公司的业绩数据，而不是特定产品的成本或收入。因此，产品决策在某种程度上不会受到短期财务压力的影响。财务团队不参与工程团队的产品路线图会议，工程团队不参与定价决策。\n我们并不是说苹果在决定公司将追求哪些技术和功能时不考虑成本和收入目标。是的，但方式与传统组织的公司不同。研发领导者不会把总体成本和价格目标作为做出设计和工程选择的固定参数，而是应该权衡这些选择给用户带来的好处和成本考量。\n在职能组织中，个人和团队声誉在下注时起着控制机制的作用。一个很好的例子是2016年决定在iPhone 7 Plus中引入双镜头肖像模式摄像头。这是一场豪赌，认为这款相机对用户的影响将足以证明其巨大的成本是合理的。\n一位高管告诉我们，在肖像模式努力中发挥核心作用的高级领导人保罗·胡贝尔(Paul Hubel)“对他的滑雪板感到失望”，这意味着他和他的团队正在冒很大的风险：如果用户不愿意为摄像头更昂贵、更好的手机支付溢价，那么下一次团队提出昂贵的升级或功能时，他们的可信度很可能会下降。事实证明，摄像头是iPhone7 Plus的一项决定性功能，它的成功进一步提高了胡贝尔和他的团队的声誉。\n当领导者做出决策时，更容易在关注成本和增加用户体验价值之间取得平衡，因为领导者在各自领域拥有深厚的专业知识，而不是总经理主要负责实现数字目标。传统业务单位结构的基本原则是协调责任和控制，而职能组织的基本原则是协调专业知识和决策权。\n因此，苹果的组织方式和它产生的创新类型之间的联系是显而易见的。正如钱德勒的著名论断，“结构跟随战略”--尽管苹果没有使用他预期的大型跨国公司将采用的结构。\n自从史蒂夫·乔布斯(Steve Jobs)实施职能组织以来，苹果公司各级管理人员，从高级副总裁到下一级，都被期望拥有三个关键的领导特征：深厚的专业知识，使他们能够有意义地参与到各自职能范围内的所有工作中；沉浸在这些职能的细节中；愿意在集体决策期间就其他职能进行协作辩论。当管理者具备这些特质时，最有资格做出决策的人会以协调一致的方式做出决策。\n苹果不是一家总经理监督经理的公司；相反，它是一家专家带领专家的公司。我们的假设是，把一位专家培养成一名优秀的管理专家，要比把一位经理培养成一名专家容易得多。在苹果，硬件专家管理硬件，软件专家管理软件等等。(偏离这一原则的情况很少见。)。这种方法通过不断增长的专业化领域向下延伸到组织的所有级别。苹果的领导人相信，世界级的人才希望在某一专业领域为其他世界级的人才工作，并与其他世界级的人才一起工作。这就像加入了一支运动队，在那里你可以向最好的人学习，并与最好的人一起比赛。\n很早，史蒂夫·乔布斯就开始接受这样一种观点，即苹果的经理们应该成为各自管理领域的专家。在1984年的一次采访中，他说，“我们在苹果经历了那个阶段，我们走出去想，哦，我们会成为一家大公司，让我们聘请专业的管理人员。我们出去雇了一群专业的管理人员。这根本不管用，…。1.他们知道如何管理，但他们什么都不知道。如果你是一个伟大的人，为什么你想要为一个你什么都学不到的人工作呢？你知道有趣的是什么吗？你知道谁是最好的经理吗？他们是伟大的个人贡献者，他们从来没有想过要成为一名经理，但却决定必须成为…。因为没有人会去…。尽最大努力做好这件事。“。\n目前的一个例子是罗杰·罗斯纳(Roger Rosner)，他负责苹果的软件应用业务，包括Pages(文字处理)、Numbers(电子表格)和Keynote(演示)等提高工作效率的应用，以及GarageBand(音乐创作)、iMovie(电影编辑)和News(提供新闻内容的应用)。罗斯纳曾在卡内基梅隆大学(Carnegie Mellon)学习电气工程，2001年加入苹果担任高级工程经理，并晋升为iWork应用总监、生产力应用副总裁，并自2013年以来担任应用副总裁。罗斯纳从之前担任几家较小软件公司的工程总监的经验中获得了深厚的专业知识，他是专家和领军专家的典范。\n在一个职能组织中，专家领导专家意味着专家在特定的领域创造一个很深的长凳，在那里他们可以相互学习。例如，苹果公司的600多名相机硬件技术专家在一个由相机专家格雷厄姆·汤森(Graham Townsend)领导的小组中工作。由于iPhone、iPad、笔记本电脑和台式电脑都包括摄像头，如果苹果按业务部门组织，这些专家将分散在不同的产品线上。这将稀释他们的集体专业知识，降低他们解决问题、产生和完善创新的能力。\n苹果普遍遵循的一条原则是“领导者应该知道他们组织的三层以下的细节”，因为这对最高层快速有效的跨职能决策至关重要。如果经理们在没有掌握细节的情况下参加决策会议，那么要么在没有细节的情况下做出决策，要么推迟决策。经理们讲述了向高级领导做演示的战争故事，这些高级领导深入到电子表格、代码行或产品测试结果的单元格中。\n当然，许多公司的领导人坚称，他们和他们的团队都沉浸在细节中。但很少有组织能与苹果相提并论。想想它的高级领导是如何极其关注产品圆角的确切形状的。圆角的标准方法是使用圆的圆弧连接矩形对象的垂直边，这会产生从直线到曲线的有点陡峭的过渡。相比之下，苹果的领导人坚持使用连续的曲线，从而形成了设计界所熟知的“蠕动”形状：坡度开始得更快，但不那么陡峭。没有曲率突变的硬件产品的一个优点是它们会产生更柔和的高光(也就是说，沿着拐角的光反射很少跳跃，甚至没有跳跃)。差别是微妙的，在它上面执行不仅仅是一个更复杂的数学公式的问题。它要求苹果的运营领导人承诺极其精确的制造公差，以生产数百万部iPhone和其他带有蠕动的产品。这种对细节的深度沉浸不仅是下层人员关心的问题，也是领导层的核心问题。\n拥有各自领域的专家并能深入细节的领导者对苹果的运营方式有着深远的影响。领导者可以推动、调查和“嗅探”问题。他们知道哪些细节是重要的，应该把注意力集中在哪里。苹果的许多人认为，为专家工作是一种解放，甚至是令人振奋的事情，因为专家提供的指导和指导比总经理更好。团结起来，所有人都可以努力在他们选择的领域做他们一生中最好的工作。\n苹果拥有数百名专家\n当辩论陷入僵局时，就像一些人不可避免的那样，更高级别的经理会介入，成为决胜局的决胜者，有时包括首席执行官和高级副总裁。即使对于最优秀的领导者来说，要在足够关注细节的情况下快速做到这一点也是具有挑战性的，这使得该公司从副总裁队伍中填补许多高级职位变得更加重要，这些副总裁对苹果的运营方式有经验。\n然而，考虑到苹果的规模和范围，即使是高管团队也只能解决有限数量的僵局。许多水平依赖关系意味着副总裁和主管级别的无效同事关系不仅有可能破坏特定的项目，而且有可能破坏整个公司。因此，为了让人们在一个职能部门内获得并保持领导地位，他们必须是高效的合作者。\n这并不意味着人们不能表达他们的观点。人们期望领导人持有强有力的、有根据的观点，并有力地倡导这些观点，但当有证据表明其他人的观点更好时，他们也愿意改变主意。当然，这样做并不总是那么容易。领导者兼具党派和开放思想的能力得益于两件事：对公司价值观和共同目标的深刻理解和奉献，以及承诺将特定道路的正确程度与艰难程度区分开来，这样执行决策的困难就不会阻止决策被选中。\nIPhone肖像模式的发展显示了领导层对细节的狂热关注，团队之间激烈的合作辩论，以及塑造并最终解决辩论的共同目标的力量。2009年，胡贝尔有了开发iPhone功能的想法，可以让人们用bokeh拍摄肖像照片-bokeh是一个日语术语，指的是令人愉悦的背景模糊-摄影专家通常认为bokeh是质量最高的。当时只有昂贵的单镜头反光相机才能拍摄这样的照片，但胡贝尔认为，通过双镜头设计和先进的计算摄影技术，苹果可以在iPhone中添加这一功能。他的想法很好地契合了摄制组宣称的目标：“更多的人在更多的时间拍摄更好的图像。”\n当团队努力将这一想法变成现实时，出现了几个挑战。第一次尝试产生了一些令人惊叹的肖像图片，但也出现了一些“失败案例”，在这些案例中，算法无法区分清晰浮雕的中心物体(例如，一张脸)和模糊的背景。例如，如果一个人的脸是从铁丝网后面拍摄的，就不可能构建一个算法，以与前面的铁丝网一样的锐度将铁丝网捕捉到脸部的一侧。侧面的电线会和背景一样模糊。\n有人可能会说，“谁会在乎铁丝网的案子呢？这是极其罕见的。“。但对于该团队来说，回避罕见或极端的情况--工程师们称之为“拐角情况”--将违反苹果严格的工程标准，即零“人工制品”，即“通过涉及的技术和/或技术在数字过程中引入的任何不受欢迎或无意的数据更改”。负责固件和算法团队的传感器软件和UX原型副总裁迈拉·哈格蒂(Myra Haggerty)回忆说，角落案件在相机团队和其他相关团队之间引发了“许多艰难的讨论”。相机软件团队最终向其报告的副总裁塞巴斯蒂安·马里诺-梅斯(Sebastien Marineau-Mes)决定将该功能的发布推迟到次年，以便让团队有时间更好地解决失败案例--胡贝尔承认，这是“一颗难以下咽的药丸”。\n为了在质量标准上达成一致，工程团队邀请了资深设计和营销负责人会面，认为他们将提供一个新的视角。设计领导们给辩论带来了额外的艺术敏感性，他们问道：“是什么构成了一幅美丽的肖像画？”为了帮助重新评估零人工制品的标准，他们从伟大的肖像摄影师那里收集了图像。他们注意到，除了其他因素外，这些照片通常在脸部边缘模糊，但在眼睛上却很锐利。因此，他们要求算法团队实现同样的效果。当球队成功时，他们知道他们有一个可以接受的标准。\n出现的另一个问题是预览背景模糊的肖像照片的能力。摄像团队设计了这一功能，以便用户只有在拍照后才能看到照片上的效果，但人性化界面(HI)设计团队进行了反击，坚持要求用户在拍照前应该能够看到“实时预览”，并获得一些关于如何进行调整的指导。HI团队成员约翰尼·曼扎里(Johnnie Manzari)给摄制组做了演示。汤森告诉我们：“当我们看到演示时，我们意识到这就是我们需要做的。”\n如本例所示，苹果的合作。\n.", "note_en": "They are typically organized into business units, each with its own set of functions. Thus the key decision makers—the unit leaders—lack a deep understanding of all the domains that answer to them.\n    The company is organized around functions, and expertise aligns with decision rights. Leaders are cross-functionally collaborative and deeply knowledgeable about details.\n    Apple is well known for its innovations in hardware, software, and services. Thanks to them, it grew from some 8,000 employees and $7 billion in revenue in 1997, the year Steve Jobs returned, to 137,000 employees and $260 billion in revenue in 2019. Much less well known are the organizational design and the associated leadership model that have played a crucial role in the company’s innovation success.\n    When Jobs arrived back at Apple, it had a conventional structure for a company of its size and scope. It was divided into business units, each with its own P&amp;L responsibilities. General managers ran the Macintosh products group, the information appliances division, and the server products division, among others. As is often the case with decentralized business units, managers were inclined to fight with one another, over transfer prices in particular. Believing that conventional management had stifled innovation, Jobs, in his first year returning as CEO, laid off the general managers of all the business units (in a single day), put the entire company under one P&amp;L, and combined the disparate functional departments of the business units into one functional organization.\n  The adoption of a functional structure may have been unsurprising for a company of Apple’s size at the time. What  is surprising—in fact, remarkable—is that Apple retains it today, even though the company is nearly 40 times as large in terms of revenue and far more complex than it was in 1998. Senior vice presidents are in charge of functions, not products. As was the case with Jobs before him, CEO Tim Cook occupies the only position on the organizational chart where the design, engineering, operations, marketing, and retail of any of Apple’s main products meet. In effect, besides the CEO, the company operates with no conventional general managers: people who control an entire process from product development through sales and are judged according to a P&amp;L statement.\n  Business history and organizational theory make the case that as entrepreneurial firms grow large and complex, they must shift from a functional to a multidivisional structure to align accountability and control and prevent the congestion that occurs when countless decisions flow up the org chart to the very top. Giving business unit leaders full control over key functions allows them to do what is best to meet the needs of their individual units’ customers and maximize their results, and it enables the executives overseeing them to assess their performance. As the Harvard Business School historian Alfred Chandler documented, U.S. companies such as DuPont and General Motors moved from a functional to a multidivisional structure in the early 20th century. By the latter half of the century the vast majority of large corporations had followed suit. Apple proves that this conventional approach is not necessary and that the functional structure may benefit companies facing tremendous technological change and industry upheaval.\n  Apple’s commitment to a functional organization does not mean that its structure has remained static. As the importance of artificial intelligence and other new areas has increased, that structure has changed. Here we discuss the innovation benefits and leadership challenges of Apple’s distinctive and ever-evolving organizational model, which may be useful for individuals and companies wanting to better understand how to succeed in rapidly changing environments.\n    Apple’s main purpose is to create products that enrich people’s daily lives. That involves not only developing entirely new product categories such as the iPhone and the Apple Watch, but also continually innovating within those categories. Perhaps no product feature better reflects Apple’s commitment to continuous innovation than the iPhone camera. When the iPhone was introduced, in 2007, Steve Jobs devoted only six seconds to its camera in the annual keynote event for unveiling new products. Since then iPhone camera technology has contributed to the photography industry with a stream of innovations: High dynamic range imaging (2010), panorama photos (2012), True Tone flash (2013), optical image stabilization (2015), the dual-lens camera (2016), portrait mode (2016), portrait lighting (2017), and night mode (2019) are but a few of the improvements.\n    To create such innovations, Apple relies on a structure that centers on functional expertise. Its fundamental belief is that those with the most expertise and experience in a domain should have decision rights for that domain. This is based on two views: First, Apple competes in markets where the rates of technological change and disruption are high, so it must rely on the judgment and intuition of people with deep knowledge of the technologies responsible for disruption. Long before it can get market feedback and solid market forecasts, the company must make bets about which technologies and designs are likely to succeed in smartphones, computers, and so on. Relying on technical experts rather than general managers increases the odds that those bets will pay off.\n  Second, Apple’s commitment to offer the best possible products would be undercut if short-term profit and cost targets were the overriding criteria for judging investments and leaders. Significantly, the bonuses of senior R&amp;D executives are based on companywide performance numbers rather than the costs of or revenue from particular products. Thus product decisions are somewhat insulated from short-term financial pressures. The finance team is not involved in the product road map meetings of engineering teams, and engineering teams are not involved in pricing decisions.\n  We don’t mean to suggest that Apple doesn’t consider costs and revenue goals when deciding which technologies and features the company will pursue. It does, but in ways that differ from those employed by conventionally organized companies. Instead of using overall cost and price targets as fixed parameters within which to make design and engineering choices, R&amp;D leaders are expected to weigh the benefits to users of those choices against cost considerations.\n  In a functional organization, individual and team reputations act as a control mechanism in placing bets. A case in point is the decision to introduce the dual-lens camera with portrait mode in the iPhone 7 Plus in 2016. It was a big wager that the camera’s impact on users would be sufficiently great to justify its significant cost.\n  One executive told us that Paul Hubel, a senior leader who played a central role in the portrait mode effort, was “out over his skis,” meaning that he and his team were taking a big risk: If users were unwilling to pay a premium for a phone with a more costly and better camera, the team would most likely have less credibility the next time it proposed an expensive upgrade or feature. The camera turned out to be a defining feature for the iPhone 7 Plus, and its success further enhanced the reputations of Hubel and his team.\n    It’s easier to get the balance right between an attention to costs and the value added to the user experience when the leaders making decisions are those with deep expertise in their areas rather than general managers being held accountable primarily for meeting numerical targets. Whereas the fundamental principle of a conventional business unit structure is to align accountability and control, the fundamental principle of a functional organization is to align expertise and decision rights.\n  Thus the link between how Apple is organized and the type of innovations it produces is clear. As Chandler famously argued, “structure follows strategy”—even though Apple doesn’t use the structure that he anticipated large multinationals would adopt.\n      Ever since Steve Jobs implemented the functional organization, Apple’s managers at every level, from senior vice president on down, have been expected to possess three key leadership characteristics: deep expertise that allows them to meaningfully engage in all the work being done within their individual functions; immersion in the details of those functions; and a willingness to collaboratively debate other functions during collective decision-making. When managers have these attributes, decisions are made in a coordinated fashion by the people most qualified to make them.\n    Apple is not a company where general managers oversee managers; rather, it is a company where experts lead experts. The assumption is that it’s easier to train an expert to manage well than to train a manager to be an expert. At Apple, hardware experts manage hardware, software experts software, and so on. (Deviations from this principle are rare.) This approach cascades down all levels of the organization through areas of ever-increasing specialization. Apple’s leaders believe that world-class talent wants to work for and with other world-class talent in a specialty. It’s like joining a sports team where you get to learn from and play with the best.\n    Early on, Steve Jobs came to embrace the idea that managers at Apple should be experts in their area of management. In a 1984 interview he said, “We went through that stage in Apple where we went out and thought,  Oh, we’re gonna be a big company, let’s hire professional management. We went out and hired a bunch of professional management. It didn’t work at all….They knew how to manage, but they didn’t know how to  do anything. If you’re a great person, why do you want to work for somebody you can’t learn anything from? And you know what’s interesting? You know who the best managers are? They are the great individual contributors who never, ever want to be a manager but decide they have to be…because no one else is going to…do as good a job.”\n  One current example is Roger Rosner, who heads Apple’s software application business, which includes work-productivity apps such as Pages (word processing), Numbers (spreadsheets), and Keynote (presentations) along with GarageBand (music composition), iMovie (movie editing), and News (an app providing news content). Rosner, who studied electrical engineering at Carnegie Mellon, joined Apple in 2001 as a senior engineering manager and rose to become the director of iWork applications, the vice president of productivity apps, and since 2013 the VP of applications. With his deep expertise gained from previous experience as the director of engineering at several smaller software companies, Rosner exemplifies an expert leading experts.\n  In a functional organization, experts leading experts means that specialists create a deep bench in a given area, where they can learn from one another. For example, Apple’s more than 600 experts on camera hardware technology work in a group led by Graham Townsend, a camera expert. Because iPhones, iPads, laptops, and desktop computers all include cameras, these experts would be scattered across product lines if Apple were organized in business units. That would dilute their collective expertise, reducing their power to solve problems and generate and refine innovations.\n    One principle that permeates Apple is “Leaders should know the details of their organization three levels down,” because that is essential for speedy and effective cross-functional decision-making at the highest levels. If managers attend a decision-making meeting without the details at their disposal, the decision must either be made without the details or postponed. Managers tell war stories about making presentations to senior leaders who drill down into cells on a spreadsheet, lines of code, or a test result on a product.\n  Of course, the leaders of many companies insist that they and their teams are steeped in the details. But few organizations match Apple. Consider how its senior leaders pay extreme attention to the exact shape of products’ rounded corners. The standard method for rounding corners is to use an arc of a circle to connect the perpendicular sides of a rectangular object, which produces a somewhat abrupt transition from straight to curve. In contrast, Apple’s leaders insist on continuous curves, resulting in a shape known in the design community as a “squircle”: The slope starts sooner but is less abrupt.  An advantage of hardware products without abrupt changes in curvature is that they produce softer highlights (that is, little to no jump in light reflection along the corner). The difference is subtle, and executing on it isn’t simply a matter of a more complicated mathematical formula. It demands that Apple’s operations leaders commit to extremely precise manufacturing tolerances to produce millions of iPhones and other products with squircles. This deep immersion in detail isn’t just a concern that is pushed down to lower-level people; it is central at the leadership level.\n    Having leaders who are experts in their areas and can go deep into the details has profound implications for how Apple is run. Leaders can push, probe, and “smell” an issue. They know which details are important and where to focus their attention. Many people at Apple see it as liberating, even exhilarating, to work for experts, who provide better guidance and mentoring than a general manager would. Together, all can strive to do the best work of their lives in their chosen area.\n      Apple has hundreds of specialist teams across the company, dozens of which may be needed for even one key component of a new product offering. For example, the dual-lens camera with portrait mode required the collaboration of no fewer than 40 specialist teams: silicon design, camera software, reliability engineering, motion sensor hardware, video engineering, core motion, and camera sensor design, to name just a few. How on earth does Apple develop and ship products that require such coordination? The answer is collaborative debate. Because no function is responsible for a product or a service on its own, cross-functional collaboration is crucial.\n  When debates reach an impasse, as some inevitably do, higher-level managers weigh in as tiebreakers, including at times the CEO and the senior VPs. To do this at speed with sufficient attention to detail is challenging for even the best of leaders, making it all the more important that the company fill many senior positions from within the ranks of its VPs, who have experience in Apple’s way of operating.\n  However, given Apple’s size and scope, even the executive team can resolve only a limited number of stalemates. The many horizontal dependencies mean that ineffective peer relationships at the VP and director levels have the potential to undermine not only particular projects but the entire company. Consequently, for people to attain and remain in a leadership position within a function, they must be highly effective collaborators.\n  That doesn’t mean people can’t express their points of view. Leaders are expected to hold strong, well-grounded views and advocate forcefully for them, yet also be willing to change their minds when presented with evidence that others’ views are better. Doing so is not always easy, of course. A leader’s ability to be both partisan and open-minded is facilitated by two things: deep understanding of and devotion to the company’s values and common purpose, and a commitment to separating how  right from how  hard a particular path is so that the difficulty of executing a decision doesn’t prevent its being selected.\n  The development of the iPhone’s portrait mode illustrates a fanatical attention to detail at the leadership level, intense collaborative debate among teams, and the power of a shared purpose to shape and ultimately resolve debates. In 2009 Hubel had the idea of developing an iPhone feature that would allow people to take portrait photos with  bokeh—a Japanese term that refers to the pleasing blurring of a background—which photography experts generally consider to be of the highest quality. At that time only expensive single-lens reflex cameras could take such photos, but Hubel thought that with a dual-lens design and advanced computational-photography techniques, Apple could add the capability in the iPhone. His idea aligned well with the camera team’s stated purpose: “More people taking better images more of the time.”\n  As the team worked to turn this idea into reality, several challenges emerged. The first attempts produced some amazing portrait pictures but also a number of “failure cases” in which the algorithm was unable to distinguish between the central object in sharp relief (a face, for instance) and the background being blurred. For example, if a person’s face was to be photographed from behind chicken wire, it was not possible to construct an algorithm that would capture the chicken wire to the side of the face with the same sharpness as the chicken wire in front of it. The wire to the side would be as blurred as the background.\n  One might say, “Who cares about the chicken wire case? That’s exceedingly rare.” But for the team, sidestepping rare or extreme situations—what engineers call  corner cases—would violate Apple’s strict engineering standard of zero “artifacts,” meaning “any undesired or unintended alteration in data introduced in a digital process by an involved technique and/or technology.” Corner cases sparked “many tough discussions” between the camera team and other teams involved, recalls Myra Haggerty, the VP of sensor software and UX prototyping, who oversaw the firmware and algorithm teams. Sebastien Marineau-Mes, the VP to whom the camera software team ultimately reported, decided to defer the release of the feature until the following year to give the team time to better address failure cases—“a hard pill to swallow,” Hubel admits.\n  To get some agreement on quality standards, the engineering teams invited senior design and marketing leaders to meet, figuring that they would offer a new perspective. The design leaders brought an additional artistic sensibility to the debate, asking, “What makes a beautiful portrait?” To help reassess the zero-artifacts standard, they collected images from great portrait photographers. They noted, among other things, that these photos often had blurring at the edges of a face but sharpness on the eyes. So they charged the algorithm teams with achieving the same effect. When the teams succeeded, they knew they had an acceptable standard.\n  Another issue that emerged was the ability to preview a portrait photo with a blurred background. The camera team had designed the feature so that users could see its effect on their photos only  after they had been taken, but the human interface (HI) design team pushed back, insisting that users should be able to see a “live preview” and get some guidance about how to make adjustments  before taking the photo. Johnnie Manzari, a member of the HI team, gave the camera team a demo. “When we saw the demo, we realized that this is what we needed to do,” Townsend told us. The members of his camera hardware team weren’t sure they could do it, but difficulty was not an acceptable excuse for failing to deliver what would clearly be a superior user experience. After months of engineering effort, a key stakeholder, the video engineering team (responsible for the low-level software that controls sensor and camera operations) found a way, and the collaboration paid off. Portrait mode was central to Apple’s marketing of the iPhone 7 Plus. It proved a major reason for users’ choosing to buy and delighting in the use of the phone.\n  As this example shows, Apple’s collaborat\n......", "posttime": "2020-10-23 03:21:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,苹果,创新,organized", "title": "苹果是如何为创新而组织的", "title_en": "How Apple Is Organized for Innovation", "transed": 1, "url": "https://hbr.org/2020/11/how-apple-is-organized-for-innovation", "via": "", "real_tags": ["apple", "苹果", "创新", "organized"]}]