[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1067039, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Covid-19中的脑与脑相关病症有很大的证据，其中一些可能是病毒神经营养的结果。绝大多数脑成像研究到目前为止侧重于定性，中度至严重病例的定性，通常对住院患者进行。然而，它仍然未知，但是，是否可以以定量和自动的方式在升高的情况下检测Covid-19的影响，以及这是否可以揭示疾病传播的可能机制。在Covid-19大流行开始之前，英国Biobank扫描了超过40,000名参与者，使其可以邀请2021百个以前的成像参与者进行第二次成像访问。在这里，我们使用来自英国Biobank Covid-19重新成像研究的782名参与者的多模式数据研究了疾病在大脑中的影响，394名参与者在其两次扫描之间进行了SARS-COV-2感染的阳性。我们在感染前后使用结构和功能性脑扫描，比较这394个Covid-19患者和388名对照之间的纵向脑变化，他与年龄，性别，种族和间隔相匹配。我们在左半产卵疫苗中，左侧眶内皮层和左侧insula在左侧嗜疗疫苗中丢失了Covid-19在大脑中对大脑的显着影响。在查看整个皮质表面时，这些结果延伸到前铰接皮质，穗敷过渡和颞杆。我们进一步比较了与没有（n = 379）的人住院（n = 15）的Covid-19患者，而结果不显着，我们发现对Covid-19 VS对照组比较的比较相似的发现另外，施用皮质中的灰质损失，杏仁达拉和海马玉米氨基的中央核（全部| Z |＆gt; 3）中较大的灰质。我们的研究结果始终如一地涉及与主要嗅觉和味觉系统直接连接的肢体皮质区域中灰质的损失。与HOC疾病研究不同，预接种成像数据的可用性有助于避免预先存在的风险因素或临床状况被解释为疾病影响的危险。由于病毒对中枢神经系统的可能入口点可能是通过嗅觉粘膜和嗅灯泡的，因此这些脑成像结果可能是通过嗅觉和味道的疾病（或病毒本身）传播的体内标志途径。\n    这项工作主要由惠康信托协作奖215573 / z / 19 / z支持。 KLM受惠康信托高级研究奖学金202788 / z / 16 / z的支持。来自惠康信托（203139 / z / 16 / z）的中心资金支持富集的神经影像学（Win FMRIB）的惠康中心。本研究部分是在申请号8107下的英国Biobank资源进行的。\n  我确认了所有相关的道德准则所遵循，并获得了任何必要的IRB和/或伦理委员会批准。\n  提供了为所描述的研究提供批准或豁免的IRB /监督机构的细节：\n 人类主题：英国Biobank已从西北部多中心研究伦理委员会（MREC）批准，以获得和传播与会者的数据和样本（http://www.ukbiobank.ac.uk/ethics/），以及这些道德法规涵盖了本研究的工作。从所有参与者获得书面知情同意书。\n 已获得所有必要的患者/参与者同意，并已存档适当的机构表格。\n  我理解，所有临床试验和任何其他前瞻性介入研究必须在ICMJE批准的注册处登记，例如Clinicaltrials.gov。我确认已注册稿件中报告的任何此类研究并提供了审判登记ID（注：如果回顾性注册了潜在研究，请在试验ID现场提供陈述，解释为什么预先登记该研究的原因） 。 \n我遵循所有适当的研究报告指南，并将相关赤道网络研究报告报告清单和其他相关材料作为补充文件，如适用，如适用。 ", "note_en": "There is strong evidence for brain-related pathologies in COVID-19, some of which could be a consequence of viral neurotropism. The vast majority of brain imaging studies so far have focused on qualitative, gross pathology of moderate to severe cases, often carried out on hospitalised patients. It remains unknown however whether the impact of COVID-19 can be detected in milder cases, in a quantitative and automated manner, and whether this can reveal a possible mechanism for the spread of the disease. UK Biobank scanned over 40,000 participants before the start of the COVID-19 pandemic, making it possible to invite back in 2021 hundreds of previously-imaged participants for a second imaging visit. Here, we studied the effects of the disease in the brain using multimodal data from 782 participants from the UK Biobank COVID-19 re-imaging study, with 394 participants having tested positive for SARS-CoV-2 infection between their two scans. We used structural and functional brain scans from before and after infection, to compare longitudinal brain changes between these 394 COVID-19 patients and 388 controls who were matched for age, sex, ethnicity and interval between scans. We identified significant effects of COVID-19 in the brain with a loss of grey matter in the left parahippocampal gyrus, the left lateral orbitofrontal cortex and the left insula. When looking over the entire cortical surface, these results extended to the anterior cingulate cortex, supramarginal gyrus and temporal pole. We further compared COVID-19 patients who had been hospitalised (n=15) with those who had not (n=379), and while results were not significant, we found comparatively similar findings to the COVID-19 vs control group comparison, with, in addition, a greater loss of grey matter in the cingulate cortex, central nucleus of the amygdala and hippocampal cornu ammonis (all |Z|&gt;3). Our findings thus consistently relate to loss of grey matter in limbic cortical areas directly linked to the primary olfactory and gustatory system. Unlike in  post hoc disease studies, the availability of pre-infection imaging data helps avoid the danger of pre-existing risk factors or clinical conditions being mis-interpreted as disease effects. Since a possible entry point of the virus to the central nervous system might be via the olfactory mucosa and the olfactory bulb, these brain imaging results might be the  in vivo hallmark of the spread of the disease (or the virus itself) via olfactory and gustatory pathways.\n    This work was primarily supported by a Wellcome Trust Collaborative Award 215573/Z/19/Z. KLM is supported by a Wellcome Trust Senior Research Fellowship 202788/Z/16/Z. The Wellcome Centre for Integrative Neuroimaging (WIN FMRIB) is supported by centre funding from the Wellcome Trust (203139/Z/16/Z). This research has been conducted in part using the UK Biobank Resource under Application Number 8107.\n  I confirm all relevant ethical guidelines have been followed, and any necessary IRB and/or ethics committee approvals have been obtained.\n  The details of the IRB/oversight body that provided approval or exemption for the research described are given below:\n Human subjects: UK Biobank has approval from the North West Multi-centre Research Ethics Committee (MREC) to obtain and disseminate data and samples from the participants ( http://www.ukbiobank.ac.uk/ethics/), and these ethical regulations cover the work in this study. Written informed consent was obtained from all participants.\n All necessary patient/participant consent has been obtained and the appropriate institutional forms have been archived.\n  I understand that all clinical trials and any other prospective interventional studies must be registered with an ICMJE-approved registry, such as ClinicalTrials.gov. I confirm that any such study reported in the manuscript has been registered and the trial registration ID is provided (note: if posting a prospective study registered retrospectively, please provide a statement in the trial ID field explaining why the study was not registered in advance).\n  I have followed all appropriate research reporting guidelines and uploaded the relevant EQUATOR Network research reporting checklist(s) and other pertinent material as supplementary files, if applicable.", "posttime": "2021-06-20 22:29:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "biobank,imaging,研究", "title": "在英国Biobank的Covid-19之前和之后的脑成像 ", "title_en": "Brain imaging before and after Covid-19 in UK Biobank", "transed": 1, "url": "https://www.medrxiv.org/content/10.1101/2021.06.11.21258690v1", "via": "", "real_tags": ["biobank", "imaging", "研究"]}, {"category": "", "categoryclass": "", "imagename": "6f44742d801cb6abede042ac27b7f1dc.jpg", "infoid": 1067037, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Netflix＆＃39;新的幻想系列，甜食，首先看起来像2020年的粗糙虚构的版本。一种疾病，随着病人在人类中迅速传播，同时压倒性地，磨削日常生活，并撞到一个身体数数。当这个故事开始时，社会试图再次把自己放在一起。一个未命名的叙述者称之为它＆＃34;伟大的崩溃。＆＃34;\n 然而，这场灾难可以＆＃39;甚至可以包含Covid-19的程度。没有发现固化或疫苗接种，因此大多数人选择以单独的单独生活或无病群体生活。这种撤回使得本质上基本上迈出了以前只在动物园漫游之前看到的空隙动物，并且景观充分增长，以补充以前为资源被破坏的社会。\n 哦，在甜食中，下一代孩子似乎包括称为杂种的半动物/半人类个体。 a to table b的列与b的比率变化 - 有些谈话，一些唐＆＃39; t;许多看起来像传统的动物特征;所有保留能力都可以提高听力或嗅觉 - 但似乎没有人肯定会知道任何东西。为什么这种进化发生了？那里有多少？而且，最相关的，是什么，使杂种免受病人的影响？面对所有的神秘，这个新世界的一些部分看着杂交种作为一种充满希望的人类演变，一群个体社会应该保护和帮助茁壮成长。然而，其他人将杂交种视为人类的障碍，从生病和恢复正常。特别是杂交种＆＃39;对病人的免疫力有这种新世界的声音，这对他们是否可以收获他们的DNA以进行治疗或预防。\n 在这个整个混乱的中间坐着Gus，一个Deerboy Hybrid，他只是在一个孤立的黄石舱内和他的父亲身上生活了一个安静的生活，直到，嗯，你可能会看到这在哪里。幸运的是，这种可预测性并不是让旅程前进任何乐趣。\n     所以，我们的汤姆索马尔爱的德德基德必须在一个遍历他自己的国家冒险，整个冒险，整个人，他遇到了许多有未知动机的人，他们可能希望他死或可以伴随成为一个被发现的家庭各种各样的。我用青少年兄弟姐妹看了一大部分系列，不用说他们能够召唤许多个别剧集＆＃39; s曲折。甜食覆盖了很多磨损的电影和电视领域，但如果你＆＃39;喜欢任何众多的孩子 - 与世界古代冒险的任何孩子（来自哈利波特的Goonies）。\n    那说，我被系列乐于魅力。与其交叉类型的一些共同方面的独特方法（孩子冒险，后启动型）。当Gus和他的第一个新的伴侣（一位前足球运动员变成猎人/刺客被命名为Tommy Jeppard，Aka Big Man）不可避免地遇到了一群民兵，那个社区＆＃39; T for Fire Ariger Cadets或Marines。相反，这个业余军队学会了它的策略，因为他们以前是一群献身的朋友，他们播放了像透明或光环这样的游戏。和留下的科学家们留下了这种疾病乱七八糟的疾病＆＃39; t前政府实验室jockeys;他们曾经是常规的医疗服务提供者。他们非常继续抓住观看所有这些病人的创伤，因为这个新世界要求他们升级并领导，所以这些文档的人性与一些＆＃34只能运作;任何东西更大的好的＆＃34;心理。\n  对于甜食来说，非常非常容易变得过于黑暗，太情绪沉重，或者对于在过去的16个月里生活了一些这个东西的观众太烦躁了。再次又一次，当我常常追随行走的死者时，展示给了我闪回，我在几个小时和时间绝望后戒掉了。像Twd一样，甜食让我们的英雄经历了许多不同的人，他们遇到了许多不同的人，他们最初看起来很好，只有透露自己在以后的别人，往往具有悲惨的结果。 （电视和电影的人们什么时候会知道可能没有比白栅栏围栏郊区郊区的更危险，更危险的地方更加危险的地方？叹了口气。）在另一个值得注意的僵尸大脑中，糟糕的家伙（无论是＆＃39; SA疾病或分离的疯鼠）似乎比在这些前八集中更频繁地出现在上面。 \n尽管如此，甜食永远不会完全进入毁灭色情或虚无主义。主要是，因为它的中央人物，而且是＃39;与Rick Grimes（行走死亡）不同，6月（手工＆＃39; STALE），或者在世界末日的新现实中存在的许多其他人物，GUS仍然是个孩子。世界哈斯队＆＃39;而殴打他一直期待最糟糕的是，他的一般乐观和奇迹让这个故事不够轻松，尽管沿途很多肠道拳。甜牙＆＃39; S源漫画于2013年包装，并在Covid-19接管之前，这一Netflix系列的生产开始了。创意团队已经制定了一些决定，用于调整源材料的凄凉，这些选择的好处仅被上下文观众放大到夏季2021年夏季。\n    我还没有积极寻求任何与大流行相关的流行文化。也许我对它的胃口最终会改变，虽然让＆＃39;在十年中重新审视。但是，鉴于这种持续的全球局面的全部局面，当然你可以＆＃39;甚至偶然消耗一些。对我来说，到目前为止工作的东西在逆境，混乱和悲剧下面有一定程度的乐观情绪或希望。例如，如何与John Wilson如何与医院的超额杂货店和场景，但它通过强调我们对人类互动的需求以及新实现的巨大价值来结束。\n 在表面上，甜食isn＆＃39; t关于大流行。这个节目适用于青少年，并没有关于锤击家庭人类的核心观念并不是微妙的。通过气候变化和贪得无厌的渴望，在摧毁我们的星球中的角色。然而，节目＆＃39;剧情突出了全球大流行，使得无法通过这八集的镜头来考虑这一点。最终，在疾病黑暗中，甜食指向几个正消息。\n 首先，不要成为最年轻一代的混蛋。我们不知道这将如何影响它们，他们是未来会解开这种混乱并导航其持久的影响。此外，推进需要向他人延伸善意。世界的重量在情绪上对每个人都在情感上＆＃39;肩膀（如果没有身体，在很大程度上）。当它＆＃39是不可能知道你的下一个事件，旅行，家庭团聚或你期待将发生的事情时，如果你想要情绪化的任何机会，你必须存在一些其他任何一种希望心理生存。 Gus认为希望像大人一样宣布打破个人，而且它很容易想象他在S2中传播乐观的展望越来越多，因为这次悲观的方式包装。\n 传统上，夏天总是觉得像网络一样倾倒地面，以便人们度假或普遍赶上更多的东西;较大的系列头条内衬往往等待秋季返回或首演（参见Y：在2021年的最后一个人或基金会）。但近年来，春天结束时出现了惊喜，成为他们自己的关键宠儿（HBO＆＃39; S LOS Espookys）或MegaFranches（陌生人）。甜食是否可以行进与明星的同样的惊喜路径仍然可以看出，但它至少很高兴有一个值得关注的新节目，因为我们进入另一个夏天，旅行可能复杂的地方（虽然，仁慈地，并不像复杂因为它在甜食中）。 ", "note_en": "Netflix&#39;s new fantasy series,  Sweet Tooth, first looks like a crudely fictionalized version of 2020. A disease colloquially referred to as The Sick spreads rapidly among humans while overwhelming infrastructure, grinding daily life to a halt, and racking up a body count. When this story begins, society tries to put itself together again. An unnamed narrator calls it &#34;The Great Crumble.&#34;\n This disaster, however, can&#39;t be contained even to the extent of COVID-19. No cure or vaccination has been discovered, so most humans opt to live in isolation either as individuals or as disease-free groups. This withdrawal has allowed nature to essentially step into the void—animals previously only seen in a zoo roam free, and landscapes grow out in full to replenish what society previously destroyed for resources.\n Oh, and in  Sweet Tooth, the next generation of kids appears to include half-animal/half-human individuals called Hybrids. The ratio of column A to column B varies—some talk, some don&#39;t; many look like traditional kids with small animal features; all retain abilities like heightened hearing or smell—but no one seems to know anything for sure . Why did this evolution happen? How many are there? And, most pertinent, what makes Hybrids immune to The Sick? In the face of all that mystery, some portions of this new world look at Hybrids as a hopeful evolution of humanity, a group of individuals society should protect and help thrive. Others, though, see Hybrids as a hindrance to humanity getting past The Sick and returning to normalcy. In particular, Hybrids&#39; immunity to The Sick has swaths of this new world curious about whether their DNA can be harvested for treatment or prevention.\n In the middle of this whole mess sits Gus, a deerboy Hybrid who simply lived a quiet life in an isolated Yellowstone cabin with his father until, well, you can probably see where this is headed. Luckily, that predictability doesn&#39;t make the journey ahead any less fun.\n     So, our  Tom Sawyer-loving deerkid has to set off on a country-traversing adventure of his own, and throughout, he&#39;ll encounter numerous individuals with unknown motives who may want him dead or may partner up to become a  found family of sorts. I watched a large portion of the series with a teen sibling, and needless to say they were able to call out many of the individual episode&#39;s twists and turns.  Sweet Tooth covers  a lot of well-worn movie and TV territory, but it will still likely have you in for the long haul if you&#39;re fond of any of the numerous kids-versus-the-world adventures of yore (from  The Goonies to  Harry Potter).\n    That said, I was amused by the series&#39; unique approach to some common aspects of its intersecting genres (kid adventure, post-apocalypse). When Gus and his first new partymate (a former football player turned hunter/assassin named Tommy Jeppard, aka Big Man) inevitably encounter a militarized group of people, that community  isn&#39;t full of former cadets or marines. Instead, this amateur army learned its tactics because they were previously a devoted group of friends who played games like  Overwatch or  Halo. And the scientists who remain and must sort out this disease mess aren&#39;t former government lab jockeys; they used to be regular-old medical care providers. They very much continue to grapple with the trauma of watching all these patients of The Sick deteriorate as this new world asks them to step up and lead, so these docs have their humanity in tact rather than operating only with some &#34;anything for the greater good&#34; mentality.\n  It would be very, very easy for  Sweet Tooth to become too dark, too emotionally heavy, or too tiresome for viewers who have lived some of this stuff IRL in the last 16 months. Again and again, the show gave me flashbacks to when I used to follow   The Walking Dead , which I had quit watching entirely after hours and hours of despair. Like  TWD,  Sweet Tooth has our heroes going through cycles where they encounter many different groups of people who initially seem nice and helpful only to reveal themselves to be something else later on, often with tragic results. (When will people in TV and film learn that there may be no scarier, more dangerous place than white picket fence-lined suburban neighborhoods?  Sigh.) In another notable zombie-brains-show similarity, the bad guys (whether that&#39;s a disease or a disassociated lunatic military man) seem to come out on top more often than not, at least in these first eight episodes.\n Despite that,  Sweet Tooth never veers entirely into ruin porn or nihilism. Mostly, that&#39;s because of its central figure. Unlike Rick Grimes ( The Walking Dead), June (  Handmaid&#39;s Tale), or many other characters existing in an apocalyptic new reality, Gus is still a kid. The world hasn&#39;t beaten him down into expecting the worst all the time, and his general optimism and wonder keep this story feeling light enough despite many gut punches along the way.  Sweet Tooth&#39;s source comic wrapped in 2013, and production on this Netflix series  began long before COVID-19 took over. The creative team had already made a few decisions to tone down the bleakness of the source material, and the benefits of those choices are only amplified by the context viewers bring to the show in summer 2021.\n    I have yet to actively seek out any pandemic-related pop culture. Maybe my appetite for it will eventually change, though let&#39;s revisit that in a decade. But given how all-encompassing this ongoing global situation has been, of course you can&#39;t help but consume some of it, even by accident. For me, the stuff that works so far has had some degree of optimism or hope underneath the adversity, chaos, and tragedy. The risotto episode of   How to With John Wilson, for instance, includes overrun grocery stores and scenes from hospitals, but it ends by underscoring our need for human interaction and the newly realized immense value in it.\n On the surface,  Sweet Tooth isn&#39;t about the pandemic at all. This show is for teens, and it is not subtle about hammering home a central idea regarding humanity&#39;s role in destroying our planet through climate change and an insatiable thirst for more. However, the show&#39;s plot prominently features a worldwide pandemic, making it impossible to not think about that through the lens of these eight episodes. Ultimately,  Sweet Tooth points to a few positive messages amid the disease darkness.\n First, don&#39;t be jerks to the youngest generation. We don&#39;t yet know how this will impact them, and they are the future who will unravel this mess and navigate its lasting impact. Additionally, pushing forward necessitates extending kindness to others. The weight of the world is emotionally on everyone&#39;s shoulders (if not physically, to a large extent). And when it&#39;s impossible to know when your next event, trip, family reunion, or whatever thing you look forward to will happen, some other kind of hope must exist for you to believe in if you want any chance at emotional and mental survival. Gus gives that hope to admittedly broken-down individuals like Big Man, and it&#39;s easy to imagine him spreading that optimistic outlook wider in S2 given the pessimistic way things wrap this time around.\n Traditionally, summer always felt like a dumping ground for networks to try unusual things as people vacation or generally get out more; bigger series headliners tend to wait for fall returns or premieres accordingly (see   Y: The Last Man or   The Foundation in 2021). But recent years have seen surprises emerge at the end of spring and become their own critical darlings (HBO&#39;s   Los Espookys) or megafranchises (  Stranger Things). Whether  Sweet Tooth can travel the same surprise path to stardom remains to be seen, but it&#39;s at least nice to have a new show worth following as we enter another summer where travel might be complicated (though, mercifully, not as complicated as it is in  Sweet Tooth).", "posttime": "2021-06-20 21:52:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "充满希望,tooth,甜食", "title": "甜食是充满希望的后期的票价 - 但要注意它的行走的死人氛围 ", "title_en": "Sweet Tooth is hopeful post-apocalyptic fare—but beware its Walking Dead vibes", "transed": 1, "url": "https://arstechnica.com/gaming/2021/06/sweet-tooth-is-hopeful-post-apocalyptic-fare-but-beware-its-walking-dead-vibes/", "via": "", "real_tags": ["充满希望", "tooth", "甜食"]}, {"category": "", "categoryclass": "", "imagename": "616bcf9b1e3489cbb30a1f698bb931d1.png", "infoid": 1067036, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "@VM_CALL：将我的个人wifi与ssid“％p％s％s％s％s％n”加入后，我的iPhone永久禁用它是WiFi功能。既不重新启动也不改变SSID修复它：〜）\n  现在使用相同的SSID设置热点并使用我的测试设备加入，Wifid即将崩溃。\n  线程2名：调度队列：com.apple.wifid.managerQueueThread 2毁损：0 libsystem_platform.dylib 0x00000001ebcb9724 _platform_strlen + 41的CoreFoundation 0x00000001a381d84c __CFStringAppendFormatCore + 88122的CoreFoundation 0x00000001a381efa8 _CFStringCreateWithFormatAndArgumentsReturningMetadata + 1603 WiFiPolicy 0x00000001d0895f8c  -  [WFLogger WFLog：消息：] + 1924 ??? 0x000000010692C00C 0 + 44052480125 Wifid 0x0000000100f58a74 0x100e40000 + 11495566 wifid 0x0000000100f58c74 0x100e40000 + 1150068\n   v7 = j__cfstringcreatewithcstring_107（0ll，a4,0x8000100u）; //格式字符串如果（v7 ||（v7 = j__cfstringcreatewithcstring_107（0ll，a4,0））！= 0ll）{if（self-＆gt; _destination == 2）{v8 = j__cfstringcreatewithformatandarguments_26（0ll，0ll，v7，v21 ）; V18 [3] =（__int64）v8; }\n  如果（自我和gt; _destination！= 2＆amp;＆amp;（！self-＆gt; _wflrunningonwatchclassdevice || self-＆gt; _wflenabledualloggingonwatchclassdevice））{*（_qword *）＆amp; v16。 tm_sec = 0ll; *（_qword *）＆amp; v16。 tm_hour =＆amp; v16; *（_qword *）＆amp; v16。 tm_mon = 0x2020000000LL; *（_qword *）＆amp; v16。 tm_wday = 0ll; v10 = j__cfstringcreatewithformatandarguments_26（0ll，0ll，v7，v21）; //＆lt;  - 这里\n 使用LLDB调试此问题将是痛苦的，因为这种方法经常击中。相反，将Frida连接到它：Frida-Trace -U Wifid -M＆＃39;  -  [WFlogger WFLOG：消息：]＆＃39;并修改自动生成的脚本一点：\n OnEner（日志，args，州）{const msg =＆＃39;＆＃39; + args [3]。 readutf8string（）;日志（` -  [wflogger wflog：$ {args [2]}消息：$ {msg}]`）; if（msg。索引（＆＃39;％p％s％s％s％s％n＆＃39;）＆gt;  -  1）{（让我= 3; i＆lt; 10; i ++）{日志（args [i]，JSON。stryify（进程。findrangebyaddress（args [i]）））; }日志（＆＃39;从：\\ n＆＃39调用; +线程。backtrace（此。上下文，backtracer。准确）。地图（debugsymbol。fromaddress）。加入（＆＃39; \\ n＆＃39;＆＃39;） +＆＃39; \\ n＆＃39;）; }}， \nV27 = Sub_1000A25D4（V21）; v28 = objc_msgsend（＆amp; objc_class____nsstring，＆＃34; stringwithformat：＆＃34; cfstr（＆＃34;尝试apple80211associateasync到％@＆＃34;），v27）; v29 = objc_msgsend（＆amp; objc_class___nsstring，＆＃34; stringwithformat：＆＃34;，cfstr（＆＃34; {％@ +}％@＆＃34;），cfstr（＆＃34;＆＃34; assoc＆＃34;）， v28）; v30 = objc_autoreleasepoolpush（）; v31 =（void *）qword_100251888; if（qword_100251888）{v32 = objc_msgsend（v29，＆＃34; utf8string＆＃34;）; objc_msgsend（v31，＆＃34; wflog：消息：＆＃34;，3ll，v32）; } objc_autoreleasepoolpop（v30）;\n 它将SSID调匀到格式字符串并将其传递给WFLOG：消息：方法。目的地是3所以它是触发拒绝服务的CFStringCreatewithFormArgument的第二个XREF。\n 为了剥削性，它不会回显，参数的其余部分似乎不像是可控的。因此，我认为这种情况不会被利用。毕竟，要触发此错误，您需要连接到该WiFi，其中SSID对受害者可见。网络钓鱼Wi-Fi门户网站可能更有效。 ", "note_en": "@vm_call:After joining my personal WiFi with the SSID “%p%s%s%s%s%n”, my iPhone permanently disabled it’s WiFi functionality. Neither rebooting nor changing SSID fixes it :~)\n  Now set up a hotspot with the same SSID and use my test device to join, the wifid crashes soon.\n  Thread 2 name: Dispatch queue: com.apple.wifid.managerQueueThread 2 Crashed:0 libsystem_platform.dylib \t0x00000001ebcb9724 _platform_strlen + 41 CoreFoundation \t0x00000001a381d84c __CFStringAppendFormatCore + 88122 CoreFoundation \t0x00000001a381efa8 _CFStringCreateWithFormatAndArgumentsReturningMetadata + 1603 WiFiPolicy \t0x00000001d0895f8c -[WFLogger WFLog:message:] + 1924 ??? \t0x000000010692c00c 0 + 44052480125 wifid \t0x0000000100f58a74 0x100e40000 + 11495566 wifid \t0x0000000100f58c74 0x100e40000 + 1150068\n   v7  =  j__CFStringCreateWithCString_107 ( 0LL ,  a4 ,  0x8000100u );  // the format string  if  (  v7  ||  ( v7  =  j__CFStringCreateWithCString_107 ( 0LL ,  a4 ,  0 ))  !=  0LL  )  {  if  (  self -&gt; _destination  ==  2  )  {  v8  =  j__CFStringCreateWithFormatAndArguments_26 ( 0LL ,  0LL ,  v7 ,  v21 );  v18 [ 3 ]  =  ( __int64 ) v8 ;  }\n  if  (  self -&gt; _destination  !=  2  &amp;&amp;  ( ! self -&gt; _wflRunningOnWatchClassDevice  ||  self -&gt; _wflEnableDualLoggingOnWatchClassDevice )  )  {  * ( _QWORD  * ) &amp; v16 . tm_sec  =  0LL ;  * ( _QWORD  * ) &amp; v16 . tm_hour  =  &amp; v16 ;  * ( _QWORD  * ) &amp; v16 . tm_mon  =  0x2020000000LL ;  * ( _QWORD  * ) &amp; v16 . tm_wday  =  0LL ;  v10  =  j__CFStringCreateWithFormatAndArguments_26 ( 0LL ,  0LL ,  v7 ,  v21 );  // &lt;-- here\n Debugging this issue with lldb will be painful because this method hits too often. Instead, attach frida to it:  frida-trace -U wifid -m &#39;-[WFLogger WFLog:message:]&#39; and modify the auto-generated script a little:\n onEnter ( log ,  args ,  state )  {  const  msg  =  &#39;&#39;  +  args [ 3 ]. readUtf8String ();  log ( `-[WFLogger WFLog: ${ args [ 2 ]}  message: ${ msg } ]` );  if  ( msg . indexOf ( &#39; %p%s%s%s%s%n &#39; )  &gt;  - 1 )  {  for  ( let  i  =  3 ;  i  &lt;  10 ;  i ++ )  {  log ( args [ i ],  JSON . stringify ( Process . findRangeByAddress ( args [ i ])));  }  log ( &#39; called from: \\n &#39;  +  Thread . backtrace ( this . context ,  Backtracer . ACCURATE )  . map ( DebugSymbol . fromAddress ). join ( &#39; \\n &#39; )  +  &#39; \\n &#39; );  }  },\n    v27  =  sub_1000A25D4 ( v21 ); v28  =  objc_msgSend (  &amp; OBJC_CLASS___NSString ,  &#34;stringWithFormat:&#34; ,  CFSTR ( &#34;Attempting Apple80211AssociateAsync to %@&#34; ),  v27 ); v29  =  objc_msgSend ( &amp; OBJC_CLASS___NSString ,  &#34;stringWithFormat:&#34; ,  CFSTR ( &#34;{ %@+} %@&#34; ),  CFSTR ( &#34;ASSOC&#34; ),  v28 ); v30  =  objc_autoreleasePoolPush (); v31  =  ( void  * ) qword_100251888 ; if  (  qword_100251888  ) {  v32  =  objc_msgSend ( v29 ,  &#34;UTF8String&#34; );  objc_msgSend ( v31 ,  &#34;WFLog:message:&#34; ,  3LL ,  v32 ); } objc_autoreleasePoolPop ( v30 );\n It concats the SSID to a format string and pass it to  WFLog:message: method. Destination is 3 so it was the second xref of  CFStringCreateWithFormatAndArguments that triggered the denial of service.\n For the exploitability, it doesn’t echo and the rest of the parameters don’t seem like to be controllable. Thus I don’t think this case is exploitable. After all, to trigger this bug, you need to connect to that WiFi, where the SSID is visible to the victim. A phishing Wi-Fi portal page might as well be more effective.", "posttime": "2021-06-20 21:46:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "格式,analysis,objc", "title": "SSID格式字符串错误的快速分析 ", "title_en": "Quick Analysis for the SSID Format String Bug", "transed": 1, "url": "https://blog.chichou.me/2021/06/20/quick-analysis-wifid/", "via": "", "real_tags": ["格式", "analysis", "objc"]}, {"category": "", "categoryclass": "", "imagename": "423eab2adb2d3dec26b24993299dd876.png", "infoid": 1067035, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此工具的目标是使其尽可能简单地通过Python或命令行修复无效的Geojson对象。\n      修复所有类型的Geojson对象，包括FeatuleCollection和Geometry Collection。如果没有什么可以修复该对象，就会返回。\n         您还可以通过调用有效性检查Geojson对象是否有效\n     GJF将默认情况下将文件固定到文件，并输出到Invalid_fixed.geojson。如果您需要以另一种方式引导的输出，则可以使用以下方式使用 - 小图方法。也可以修复多个文件，如下所示。\n    --validate validate geojson文件，并在不试图修复它的情况下打印错误消息如果无效。\n  -o，--output-方法[覆盖| new_file | print]默认为new_file，其中gjf将通过postfix _fixed输出固定的geojson对象。 upereas将将固定的geojson对象写入源文件，覆盖进程中的原始文件。最后，打印将在终端上输出固定的Geojson对象 ", "note_en": "The goal of this tool is to make it as easy as possible to fix invalid GeoJSON objects through Python or Command Line.\n      Fix all types of GeoJSON objects, including FeatureCollection and Geometry Collection. If there is nothing to fix the object will be returned as is.\n         You can also check whether a GeoJSON object is valid or not by calling  validity\n     gjf will fix the file, and output to  invalid_fixed.geojson by default. If you need the output directed in another way you can use  --output-method as directed below. It is also possible to fix multiple files, as below.\n    --validate validate GeoJSON file, and print the error message if it is not valid, without attempting to fix it.\n  -o, --output-method [overwrite|new_file|print] Default is  new_file, where  gjf will output fixed GeoJSON object to file with the postfix  _fixed. Whereas  overwrite will write the fixed GeoJSON object to the source file, overwriting the original file in process. Lastly,  print will output the fixed GeoJSON object on the terminal", "posttime": "2021-06-20 21:46:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "修复,tool,对象", "title": "GJF  - 修复无效地Geojson对象的工具 ", "title_en": "Gjf – A tool to fix invalid GeoJSON objects", "transed": 1, "url": "https://github.com/yazeed44/gjf", "via": "", "real_tags": ["修复", "tool", "对象"]}, {"category": "", "categoryclass": "", "imagename": "752403b4e7ba55e1976a2fb4c830c28a.jpg", "infoid": 1067034, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "让您忙碌的日子与Axios Am / PM更简单。 赶上什么＆＃39;新的，为什么它只是在5分钟内重要。  订阅AXIOS更接近的洞察洞察日的商业新闻和趋势以及为何重要  订阅Axios Markets，了解最新的市场趋势和经济洞察力。 免费注册。  讨论统计数据和故事，让运动世界与Axios Sports。 免费注册。  从山谷和D.C.使用Axios登录来实现我们的智能技术。 免费注册。  通过Axios Sneak Peek获取内部内幕和第39页的新白宫指南。 免费注册。  每天摘要最重要的故事，影响你的家乡的斧头丹佛 \n获得影响您家乡的最重要故事的日常摘要\n 获得每天消化最重要的故事，影响您的家乡的Axios Twin City\n 获得影响您家乡的最重要的故事的日常摘要，Axios Tampa Bay\n 每天摘要最重要的故事，影响您的家乡的夏洛夏洛特\n 保持最新的最重要和最有趣的故事，影响NW Arkansas，由当地记者撰写\n   根据华尔街日记，在最近的职位上，主要公司在最近的职位上申请了科罗拉多州居民没有资格申请某些偏远职位，因为新的州法律要求企业披露预期的薪资或支付职位的薪酬范围，根据Wall Street Journal。\n 为什么重要：1月份生效的法律旨在帮助接近性别工资差距，并促进员工的工资透明度，但公司已表示无需申请科罗拉多人才能申请避免披露信息。 \n约翰逊＆amp; 根据期刊，Johnson，Cbre，McKesson和Conshiphor和Conshinal Health是在最近的在线列表中添加了此类警告的业务中，根据期刊。  这部大局：企业认为，工资披露法对雇主过于繁琐，而劳工处正在调查排除科罗拉多人的邮资的投诉。  科罗拉多居民仍然可以申请职位，但它＆＃39;如果公司实际认为他们作为候选人，则为未知。 ", "note_en": "Make your busy days simpler with Axios AM/PM. Catch up on what&#39;s new and why it matters in just 5 minutes.\n Subscribe to Axios Closer for insights into the day’s business news and trends and why they matter\n Subscribe to Axios Markets for the latest market trends and economic insights. Sign up for free.\n Binge on the stats and stories that drive the sports world with Axios Sports. Sign up for free.\n Get our smart take on technology from the Valley and D.C. with Axios Login. Sign up for free.\n Get an insider&#39;s guide to the new White House with Axios Sneak Peek. Sign up for free.\n Get a daily digest of the most important stories affecting your hometown with Axios Denver\n Get a daily digest of the most important stories affecting your hometown with Axios Des Moines\n Get a daily digest of the most important stories affecting your hometown with Axios Twin Cities\n Get a daily digest of the most important stories affecting your hometown with Axios Tampa Bay\n Get a daily digest of the most important stories affecting your hometown with Axios Charlotte\n Stay up-to-date on the most important and interesting stories affecting NW Arkansas, authored by local reporters\n   Major companies have said in recent job postings that Colorado residents are ineligible to apply for certain remote positions because a new state law requires businesses to disclose the expected salary or pay range for positions, according to the  Wall Street Journal.\n Why it matters: The law, which went into effect in January, is meant to help close the gender wage gap and to promote wage transparency for employees, but companies have said Coloradans need not apply to avoid disclosing the information.\n Johnson &amp; Johnson, CBRE, McKesson and Cardinal Health are among businesses that have added such caveats in recent online listings for remote positions, according to the Journal.\n The big picture: Businesses have argued that the wage disclosure law is overly burdensome for employers, while the state&#39;s labor department is investigating complaints of postings excluding Coloradans.\n Colorado residents can still apply for the positions, but it&#39;s unknown if companies would actually consider them as candidates.", "posttime": "2021-06-20 21:45:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "远程,companies,axios", "title": "主要公司要求科罗拉多居民不适用于远程职位 ", "title_en": "Major companies ask Colorado residents not to apply for remote positions", "transed": 1, "url": "https://www.axios.com/remote-jobs-colorado-salary-discloser-law-33ce8a79-1465-44c4-a311-dd1aebfe8921.html", "via": "", "real_tags": ["远程", "companies", "axios"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067032, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "升级你的编码技巧并迅速降落一份工作。 这是扩展您知识的最佳地点，并为您的下一次面试做好准备。 ", "note_en": "Level up your coding skills and quickly land a job. This is the best place to expand your knowledge and get prepared for your next interview.", "posttime": "2021-06-20 21:45:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "亚马逊,amazon,职业,joining,编码", "title": "致命的职业 - 在加入亚马逊之前思考100次 ", "title_en": "Lethal for Career – Think 100 Times Before Joining Amazon", "transed": 1, "url": "https://leetcode.com/discuss/compensation/1281540/amazon-lethal-for-career-think-100-times-before-you-join-amazon", "via": "", "real_tags": ["亚马逊", "amazon", "职业", "joining", "编码"]}, {"category": "", "categoryclass": "", "imagename": "ee31d1e4cff7e4035fa00daa901eb345.jpg", "infoid": 1067029, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "强大的显微镜已经取得了巨大的飞跃。使用灯光的量子诀窍使研究人员在未推翻细节中检查活细胞而不破坏它们，这是一种可以改善医学诊断和微生物学研究的技术。\n 通常用于检查生物系统的显微镜在其目标上闪耀一个或两个明亮的灯光，更强大的光源允许研究人员更详细地看到细胞。但这种方法对它可以实现的精度有一个基本的限制：在某些时候，鲜明的光线会破坏活细胞。\n “我们对生活的理解现在几乎完全依赖于我们的显微镜的质量，”澳大利亚昆士兰大学的Warwick Bowen说。 “我们真的受到了技术的限制，并且如何打破现有限制并不明显，因为我们已经将强度推高，因为我们可以在不破坏细胞的情况下尽可能高。”\n  Bowen和他的同事找到了一种克服这个问题的方法。它们使用了一种具有两个激光光源的显微镜，但是通过专门设计的晶体送出一个“挤压”光线。通过引入光子中的量子相关性来实现 - 激光束中的光颗粒。\n 将光子耦合到相关对中，并且它们中的任何一个具有与其他相同的能量的任何一个都被丢弃而不是被配对。该过程降低了光束的强度，同时降低其噪声，这允许更精确的成像。\n  当研究人员测试其系统时，他们发现他们能够进行比没有使用挤压光的类似装置35％的测量。\n  “为了实现这种没有量子相关的这种测量，你必须转动强度，”鲍文说。 “但如果你转过身足够的强度来匹配这些结果，你会破坏样本，所以我们能够检查以前是不可能看到的事情。” \n这些包括酵母细胞（酿酒酵母）的壁（酿酒酵母），其约为10纳米厚，以及细胞内的流体，即使是最佳的非量子显微镜，也会微弱，并且与标准显微镜完全看不见 。 观察这些小组的活面包部分可以帮助我们了解最小鳞片的生命基础知识。  “这是在光学显微镜领域的一个非常激动的进步，用于改善最先进的显微镜，以改善损坏生物样本的阈值的光强度，以便改善最先进的显微镜，”弗兰克斯·沃尔默说 英国埃克塞特大学。  鲍文说，量子显微镜也将具有实际应用。 例如，常用基于光的显微镜来确定细胞是否是癌症或诊断其他疾病，并且挤压光可以显着提高这些测试的敏感性以及加速它们。 ", "note_en": "Powerful microscopes have made a quantum leap. Using a quantum trick with light has allowed researchers to examine living cells in unprecedented detail without destroying them, a technique that could improve medical diagnoses and microbiology research.\n The microscopes that are generally used to examine living biological systems shine one or two bright lights on their targets, and more powerful light sources allow researchers to see the cells in greater detail. But this approach has  a fundamental limit to the precision it can achieve: at some point, a bright enough light will destroy a living cell.\n “Our understanding of life as it is now has relied almost entirely on the quality of our microscopes,” says  Warwick Bowen at the University of Queensland in Australia. “We’re really limited by technology, and it’s not obvious how to break the existing limits because we’ve already pushed the intensity as high as we can without destroying the cell.”\n  Bowen and his colleagues have found a way to overcome this problem. They used a type of microscope with two laser light sources, but sent one of the beams through a specially designed crystal that “squeezes” the light. It does so by introducing  quantum correlations in the photons – the particles of light in the laser beam.\n The photons were coupled into correlated pairs, and any of them that had energies unlike the others were discarded instead of being paired off. That process lowered the intensity of the beam while decreasing its noise, which allowed for more precise imaging.\n  When the researchers tested their system, they found that they were able to make measurements that were 35 per cent sharper than a similar device that didn’t use squeezed light.\n  “In order to achieve this kind of measurement without quantum correlations, you’d have to turn the intensity up,” says Bowen. “But if you turned up the intensity enough to match these results, you’d destroy the sample, so we’re able to examine things that previously would have been impossible to see.”\n These included the wall of a yeast cell ( Saccharomyces cerevisiae), which is about 10 nanometres thick, as well as the fluid within a cell, both of which would be faint even with the best non-quantum microscopes, and completely invisible with standard microscopes. Observing these  minuscule parts of living tissues could help us understand the basics of life at the smallest scales.\n “This is a very exciting advance in the field of optical microscopy that opens the door for improving how state-of-the-art microscopes can work, at light intensities that are right at the threshold of damaging biological samples,” says Frank Vollmer at the University of Exeter in the UK.\n Quantum microscopes will also have practical applications, Bowen says. For example, light-based microscopes are often used to  determine if cells are cancerous or to diagnose other diseases, and squeezed light could significantly improve the sensitivity of those tests as well as speeding them up, he says.", "posttime": "2021-06-20 21:09:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "显微镜,microscope", "title": "量子显微镜可以在前所未有的细节中检查细胞 ", "title_en": "Quantum microscope can examine cells in unprecedented detail", "transed": 1, "url": "https://www.newscientist.com/article/2280216-quantum-microscope-can-examine-cells-in-unprecedented-detail/", "via": "", "real_tags": ["显微镜"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067028, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "图1：名为makefile的文件的内容。 对于教育内容的Smidgeon，请注意使用$ EUID（有效用户ID）而不是$ UID（真实的用户ID）。 我认为它是一个设计错误，即大多数环境中的真实用户ID在大多数环境中具有较短的名称，尽管有效的用户ID几乎总是是您应该使用的。 查看维基百科关于用户标识符的公平摘要。  。前面：我是一个三明治三明治。 我是一个三明治三明治。 我是我答：@真夹芯三明治：@ test $$ euid -ne 0＆amp;＆amp;＆amp; echo＆＃34;什么？ 让它自己。＆＃34; || 回声＆＃34;好的。＆＃34; 三明治三明治：@ test $$ euid -ne 0＆amp;＆amp;＆amp; echo＆＃34;什么？ 让它自己。＆＃34; || 回声＆＃34;好的。＆＃34;  注释？ 问题？ 更正？ 如果您想与我联系此帖子中的任何内容，请在ME发送电子邮件至me@chrismorgan.info。 ", "note_en": "Figure 1: contents of a file named  Makefile. For a smidgeon of educational content, note the use of  $EUID (effective user ID) rather than  $UID (real user ID). I consider it a design mistake that real user ID has a shorter name in most environments, despite effective user ID almost always being what you should use. See  Wikipedia on user identifiers for a fair summary of the situation.\n .PHONY: me a sandwich sandwich. ME A SANDWICH SANDWICH. me a ME A:\t  @ true sandwich sandwich.:\t  @ test  $$ EUID -ne 0 &amp;&amp; echo &#34;What? Make it yourself.&#34; || echo &#34;Okay.&#34; SANDWICH SANDWICH.:\t  @ test  $$ EUID -ne 0 &amp;&amp; echo &#34;WHAT? MAKE IT YOURSELF.&#34; || echo &#34;OKAY.&#34;\n    Comments? Questions? Corrections? If you want to contact me about anything in this post, email me at  me@chrismorgan.info.", "posttime": "2021-06-20 21:02:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "三明治,sandwich,内容", "title": "给我做一个三明治 ", "title_en": "Make me a sandwich", "transed": 1, "url": "https://chrismorgan.info/blog/make-me-a-sandwich/", "via": "", "real_tags": ["三明治", "sandwich", "内容"]}, {"category": "", "categoryclass": "", "imagename": "58945f7c650e02f5c5042cc1dfef73fc.png", "infoid": 1067027, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Warning: Can only detect less than 5000 characters", "note_en": "Andy Warhol once said, “Art is what you can get away with.” I interpret the quote as a nihilistic take on “beauty is in the eye of the beholder” —  a urinal you found in the junkyard can be considered art, so long as you convince someone to buy it, or showcase it in a museum. All that matters is what other people see in it and what buyers are willing to pay.  The 2020’s equivalent of Warhol paintings are  Non-Fungible-Tokens (NFTs). In this essay I’ll explain what NFTs are by motivating them with some interesting real-world problems. Then I’ll discuss why the NFT craze for digital art generates so much ideologically contentious debate. Finally, I’ll discuss some parallels between artistic and financial nihilism, and how this might serve as a framework for thinking about wildly speculative markets.     Suppose you want to buy a Birkin bag or some other luxury brand item. An unauthorized seller — perhaps someone who needs some emergency cash — is willing to sell you a Birkin bag. They offer you a good discount, relative to the price the authorized retailer would charge you. But how can you be sure they aren’t selling you a fake? Counterfeits for these items are very high quality, and the average Birkin customer probably can’t tell the difference between a real and a fake.   One way to avoid counterfeits is to only purchase items from an authorized retailer, e.g. a trusted Hermès store. But this is not practical because it prevents people from selling or giving away their bags. If you leave your bag to someone in your will, then its authenticity is no longer guaranteed.  So we have the market need: how does a seller pass on or sell a luxury item? How does a buyer ensure that they are buying an authentic item?  One possible answer is for Hermès to print out a list of secret serial numbers, perhaps sewn inside the bag, that declare whether a bag is legit or not. Owners receive a serial number when they buy the bag. But this is not a strong deterrent. A counterfeiter could just buy a real bag and then copy its serial number into many fake bags.  What if Hermès maintains a public website of who owns which bag? Any time a bag changes ownership, this ledger needs to be updated. By recording a unique owner for each unique serial number, this solves the problem of counterfeiters simply duplicating serial numbers. The process shifts from verifying properties to verifying transactions and owners.  These approaches would work, but has a centralized point of failure: If the Hermès website goes down, nobody can trade bags anymore. Hermès is a big company and has the resources to protect their website against DDOS attacks and other cybersecurity threat vectors, but smaller luxury brands might not have a state-of-the-art security department. If they are not careful, their security could be breached by hackers or an unscrupulous sysadmin. Also, if Hermès stops operating as a company in 25 years, who will maintain the ledger of ownership? If it is a third party company, can we trust them not to abuse that power? Even in the unlikely event that the central point of failure never makes a mistake, it’s still mildly annoying to require Hermès to get involved every time a bag changes hands.   What if you could verify transactions and owners, without a centralized party? This is where Non-Fungible Tokens, or NFTs, come in. In 2009, someone  published a landmark paper on how to build a decentralized ledger of who owns what. This ledger is called a &#34;blockchain&#34;. A blockchain is a record of the consensus state of the world, following some agreed-upon protocol that is known to everyone. The remarkable thing about blockchains is that they are decentralized (no central point of failure), and resilient to malicious actors in the network.-Distributed consensus is reached by each individual contributing some resource like money, hash rate, or computer storage. So long as a large fraction of resources in the network are controlled by well-behaved actors, the integrity of the blockchain remains secure. The fraction required typically varies from one-thirds to just over a half.   There are many blockchains out there. The details of how their consensus protocols are implemented are fascinating but beyond the scope of this essay. The important thing to know is that the base technology underlying NFTs and cryptocurrencies is a formal protocol that allows people to come to an agreement on who owns what without having to involve a trusted third party (e.g. Hermès, an escrow agent, your bank, or your government). Theoretically speaking, blockchains allow shared consensus in a trustless society.  NFTs are like a paper deed of ownership, but instead of paper the certificate is digital. And unlike a paper deed an NFT cannot be forged. NFTs contain a unique “serial number” that is publicly viewable, but only one person can be said to “possess” that serial number on the blockchain, much like how home addresses are public but registered to a single owner by the recording office. To see how NFTs solve the Birkin bag counterfeit problem, let’s suppose Hermès publicly declares the following for all to hear:   “Owners of True Birkin bags will be issued a digital certificate of authenticity represented by an NFT”  As a buyer, you can be quite confident that the bag is authentic if the seller also owns the NFT, and you can verify that the NFT was indeed originally created by Hermès by looking up its public transaction history. During a transaction, the seller simply gives the buyer the bag and tells the blockchain to re-assign ownership of the NFT to the buyer’s digital identifier. If the payment is done in cryptocurrency, the escrow can even be performed  using a smart contract without a centralized party (the seller publishes contract “If a specific buyer’s wallet address sends me X USDC in 24 hours, send the NFT is sent to them and send the cash to me.”)  NFTs provide the means to implement digital scarcity, but there still needs to be a way to pair it with a real-world item in the “analog” world. A seller could still bypass the security of NFTs by selling you an NFT with a fake Birkin bag. However, for every fake bag you want to sell, you need to purchase a real NFT and the real bag that comes with it. After you sell the NFT with the fake bag, you are left with a real bag with no NFT! Subsequently, the market value of the real bag drops because buyers will be highly suspicious of a seller who says &#34;this is a real bag, I don&#39;t have the NFT because I just sold it with a fake bag.&#34; While NFTs are not sure proof of a physical Birkin bag&#39;s authenticity, they all but ruin the economic incentives of counterfeiting.   What about luxury consumable goods? You could buy NFT-certified Wagyu beef, sell the NFT with some cheaper steak, and then eat the real Wagyu beef - it doesn’t matter what other people think you&#39;re eating. However, NFT transactions are public, so a grocery shopper would be quite suspicious of a food NFT that has changed hands outside of the typical supply chain addresses. For NFTs paired with physical goods, each “unusual” transaction significantly adds to counterfeit risk, which diminishes the economic incentives to counterfeiters. This is especially true for consumable, perishable goods.  Authenticity is useful, even outside of Veblen goods. You can imagine using NFTs to implement anonymous digital identity verification ( a 30B market by 2024), or ship it with food products like meat where the customer cares a lot about the provenance of the product. In Taiwan, there is a current ongoing scandal where a bunch of US-imported pork has been passed off as “domestic pork” and nobody can trust their butchers anymore.   In the most general case, NFTs can be used to implement provenance tracking of both physical and digital assets - an increasingly important need in our modern age of disinformation. Where did this photo of a politician come from? Who originally produced this audio clip?     NFTs make a lot of sense for protecting the authenticity of luxury goods or implementing single sign-on or tracking the provenance of meat products, but that’s not what they’re primarily used for today. Rather, most people sell NFTs for digital art. Here are some early examples of art NFTs, called “Cryptopunks”. Each punk is a 24x24 RGB image.  One of these recently sold for 17M USD in an auction. At first glance, this is perplexing. The underlying digital content - some pixels stored in a file - are freely accessible to anyone. Why would anyone pay so much for a certificate of authenticity on something that anyone can enjoy for free? Is the buyer the one that gets punked?\n It’s easy to dismiss this behavior as poor taste colliding with the arbitrarily large disposable income of rich people, in particular crypto millionaires that swap crypto assets with other crypto millionaires. While this may be true, I think it’s far more interesting to ask “what worldview would cause a rational person to bet $17M on a certificate for a 24x24x3 set of pixel values”?   Historically, the lion’s share of rewards for digital content has been owned by distribution technology like Spotify or content aggregators like Facebook, and then split with the management company. The creatives themselves are paid pittances, and do not share in the financialization of their labor. The optimist case for NFT art is as follows: NFTs are decentralized, which means any artist with an internet connection can draw up financial contracts for their art on their own terms. If NFTs revolutionize the business model of digital art, and if the future of art is mostly digital, then the first art NFTs to ever be issued might accrue significant cultural relevance, and that’s why they command such high speculative prices.   Valuing art based on cultural relevance might be a bit absurd, but why is the Mona Lisa “The Mona Lisa”? da Vinci arguably made “better” paintings from a technical standpoint. It&#39;s because of intangible value. The Mona Lisa is valuable because of its cultural proximity to important events and people in history, and the mimetic desire of other humans. In fact, it was a relatively obscure painting until 1911, when it was stolen from the Louvre and became a source of national shame overnight.   All art, from your child’s first finger painting, to an antique heirloom passed down generations, to a “masterpiece” like the Mona Lisa, are valued this way. They are valuable simply because others deem it valuable.   NFTs are the digital equivalent of buying a  banana duck-taped to a wall; you are betting that in the future, that statement of ownership on some blockchain will be historically significant, which you can presumably trade in for cash or clout or both. But buyer beware: things get philosophically tricky when applying the theory of “intangible value” to digital information and artwork where the cost of replication goes to zero.   I can think of two ways to look at how one values NFTs for digital art. One perspective is that in a world full of fake Birkin bags and products sourced from ethically dubious places, the only thing of value is the certificate of authenticity. The cultural and mimetic value of content has transferred entirely to the provenance certificate, and not the pixels themselves (which can be copied for free). If art’s value is derived from the cultural relevance it represents and its proximity to important people, then the most sensible way to make high art would not be to improve one’s painting skills, but to schmooze with a lot of famous people and insert oneself into important events in history, and issue scarce status symbols for the bourgeoisie. Warhol did exactly that.   The alternate view is that if a perfect copy can be made of some pixels, then it is not really a counterfeit at all, and therefore the NFT secures nothing of actual value. Is it meaningful to ascribe a certificate of authenticity to something that can be perfectly replicated? Is “authenticity” of a stream of 0s and 1s meaningless? There is certainly utility in verifying the source of some information, but anyone can mint an NFT for the same information.  In summary, the Pro-NFT crowd values the intangible “collector’s scarcity and cultural relevance”. The anti-NFT focuses on tangible value - how much real value does this secure? Both are reasonable frameworks to value things, and you can end up with wildly different conclusions.\n  Convince enough people that a urinal is valuable, and it becomes an investment grade asset. This is no longer merely a matter of art philosophy - when you invest in an index fund, you are essentially reinforcing the market’s current belief of valuations. When people bid up the price of TSLA or GME to stratospheric valuations, the index fund must re-adjust their market-weighted holdings to reflect those prices, creating further money inflows to the asset and thus a  self-fulfilling prophecy. As it turns out, the art-of-investing is much like investing-in-art. As I have suggested in the title of this essay and borrowed from Warhol (who probably borrowed it from Marshall McLuhan),  stonks are what you can get away with.\n    We are starting to see this valuation framework being applied to the equities market today, where price movements are dominated by narratives about where the price is going and what other people are willing to pay for it, especially with meme stocks like GME and AMC. Many retail investors don’t really care about whether GME’s price is justified by their corporate earnings - they simply buy at any cost. This financial nihilism - where intrinsic value is unknowable and all that matters is what other people think - is a worldview often encountered in Gen Z retail traders and a surprising number of professional traders I know. Perhaps the  midwit meme is really true.  This is definitely a cause for some concern, but at the same time, I think value investors should keep an open mind that what first seems like irrational behavior might have a method to madness. If you have an irrational force acting in the markets, like shareholders who refuse to sell or lend their stock, a discounted cash flow model for AMC or GME starts to not become very predictive of share price. By reflexivity, that will have impacts on future cash flows! In a similar fashion, using present-day frameworks for thinking about business and value do not account for the disruptive force of technology. That’s why I find NFTs so fascinating - they are an intersection of finance, art, technology, and the nihilistic framework of valuation that is so prevalent in our society today.   What is rational behavior for an investor, anyway? Is it “standard behavior” as measured against the population average? How do you tell apart standard behavior from a collective delusion? Perhaps the luxury bag makers,  Ryan Cohens, and Andy Warhol’s of the world understand it best: Convince the world to believe in your values, and you will be the sanest person on the planet. For fifteen minutes, at least.   Thanks to  Cati Grasso,  Sam Hoffman,  Phúc Lê, Chung Kang Wang, Jerry Suh, and Ellen Jiang for comments and feedback on drafts of this post.", "posttime": "2021-06-20 21:02:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nft,nfts,warning", "title": "斯多克斯是你可以逃避的：NFT和金融虚无主义 ", "title_en": "Stonks Are What You Can Get Away With: NFTs and Financial Nihilism", "transed": 1, "url": "https://blog.evjang.com/2021/06/nft.html", "via": "", "real_tags": ["nft", "nfts", "warning"]}, {"category": "", "categoryclass": "", "imagename": "9632d30aba84c4278e8bccb4f42a0641.png", "infoid": 1067026, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当你想到章鱼或龙虾时，想到了什么？海鲜或智能海洋生物？\n 一群保守的国会议员认为它＆＃39;如后者，并认为他们应该被列入保护动物。\n 动物福利（感知）条例草案识别动物感知 - 这是动物有感情的能力，包括痛苦和痛苦。\n 它目前说，鱼类和其他感觉疼痛的脊椎动物应该尽可能地保护。\n 像龙兽人一样，像龙鱼和章鱼一样的动物是由于无脊椎动物的保护，他们的身体与我们的身体不同，所以他们认为有着这些复杂的感受，由保守的动物福利基金会（CAWF）表示报告。\n  该报告称，识别这些物种的论据侧重于这些动物和人类之间的身体差异 - 但这没有明白动物有什么意义有感情的意义。\n   它说这些物种＆＃34;无疑以极其不同的方式体验世界，＆＃34;但重要的是他们是否感到愉快和痛苦。 \n＆＃34;动物帮助我们了很多，所以我们应该回报并帮助他们，＆＃34; 海洋生物学家Emily Sullivan告诉收音机1次新闻。  这位25岁的人在海洋生物协会中管理了研究水族馆，这意味着她＆＃39; S＆＃39曾在章鱼，龙虾，螃蟹，小龙虾和墨鱼等许多无脊椎动物工作。  她觉得他们应该在账单中得到认可 - 目前在主的房子里。  在科学研究中使用动物已经存在规定，包括章鱼和鱿鱼 - 尽管不是所有物种。  ＆＃34;其目的是最大限度地减少研究中的疼痛，压力和痛苦，＆＃34; 艾米莉说。  ＆＃34;我个人认为他们可以识别和感到痛苦，所以应该受到保护更多。＆＃34;  与许多这些物种进行互动，艾米丽觉得他们是自我意识的，并了解它们周围的东西＆＃39。 \n＆＃34;物种之间肯定有各种各样地各种各样地各种各样的所有水平。但是，例如与章鱼有关的墨鱼，是非常聪明的，＆＃34;她说。\n ＆＃34;我们在这里的那些，当你走过他们的坦克时，他们会出现并看看，看看你和＃39;重复做什么，肯定回应。你可以看到他们看着你。＆＃34;\n  当他们感到痛苦或痛苦时，艾米丽觉得它＆＃39;因为他们的行为改变了很多＆＃34;\n ＆＃34;他们变得非常昏昏欲睡，它们的胃口变化。那些动物，包括螃蟹和龙虾，包括螃蟹和龙虾。＆＃34;\n  艾米丽说，在账单中包括他们将对动物自身产生很大影响，因为＆＃34;他们aren＆＃39; t真正保护或监管很多。\n 该报告发现英国捕捞舰队每年都有超过4.2亿种鱿鱼，章鱼，螃蟹和龙虾，并说明＆＃34;有这么多人在股份＆＃34;它很重要，＆＃39;很重要即使有＆＃39;没有完全确定这些动物也是谨慎的。\n  新的动物福利立法将意味着任何新的政府政策都必须考虑到脊椎动物动物可以体验包括疼痛或喜悦的感受。 \n这将由由该领域内的动物专家组成的委员会决定。  来自环境部，食品和农村事务部的发言人告诉Newsbeat英国是＆＃34;自豪地拥有世界上一些最高的动物福利标准＆＃34;  ＆＃34;我们完全致力于进一步加强他们，以确保所有动物都避免任何不必要的痛苦，痛苦或痛苦，＆＃34; 她说。  她补充说已经有关于章鱼，墨鱼和鱿鱼等物种的感受审查，政府将＆＃34;仔细考虑结果＆＃34; 这个的。 ", "note_en": "When you think of an octopus or lobster, what comes to mind? Seafood or intelligent marine life?\n A group of Conservative MPs think it&#39;s the latter and argue they should be included in a law to protect animals.\n The Animal Welfare (Sentience) Bill recognises animal sentience - which is the capacity of animals to have feelings, including pain and suffering.\n It currently says fish, and other vertebrates which feel pain, should be protected as much as possible.\n Animals like lobsters and octopus are not currently protected by the bill because as invertebrates, their body is different to ours, so they aren&#39;t thought to have those complex feelings, says a report by the  Conservative Animal Welfare Foundation (CAWF).\n  The report says arguments against recognising these species focuses on physical differences between these animals and humans - but this fails to understand what it means for an animal to have feelings.\n   It says those species &#34;undoubtedly experience the world in extremely different ways to ourselves,&#34; but what matters is whether they feel pleasure and pain.\n  &#34;Animals have helped us quite a lot, so we should return the favour and help them,&#34; marine biologist Emily Sullivan tells Radio 1 Newsbeat.\n The 25-year-old manages the research aquarium at the Marine Biological Association, which means she&#39;s worked with lots of invertebrates such as octopus, lobster, crabs, crayfish and cuttlefish.\n She feels they should be recognised in the bill - which is currently in the House of Lords.\n  There are already regulations around using animals in scientific research, including octopus and squid - though not all species.\n &#34;The aim of that is to minimise pain, stress and suffering in research,&#34; Emily says.\n  &#34;I personally do think they can recognise and feel pain, so should be protected more.&#34;\n Having interacted with lots of these species, Emily feels they are self-aware and understand what&#39;s around them.\n &#34;It definitely varies between species, and it&#39;s not the same level for all of them. But for example cuttlefish, related to octopus, are very intelligent,&#34; she says.\n &#34;The ones we have here, when you walk past their tank they come up and have a look, see what you&#39;re doing and definitely respond. You can see them watching you.&#34;\n  Emily feels it&#39;s clear when they feel pain or suffering &#34;because their behaviour changes a lot&#34;.\n &#34;They become quite lethargic and their appetite changes. That&#39;s true for a lot of the animals, including crabs and lobsters.&#34;\n  Emily says including them in the bill will have a big impact on the animals themselves because &#34;they aren&#39;t really protected or regulated much&#34;.\n The report found the UK fishing fleet lands more than 420 million of species such as squid, octopus, crabs and lobsters each year, and says &#34;with so many individuals at stake&#34;, it&#39;s important to be cautious even if there&#39;s not complete certainty these animals are sentient.\n  The new animal welfare legislation will mean any new government policy will have to take into account that vertebrate animals can experience feelings including pain or joy.\n That will be decided by a committee made up of animal experts from within the field.\n A spokeswoman from the Department of Environment, Food and Rural Affairs told Newsbeat the UK was &#34;proud to have some of the highest animal welfare standards in the world&#34;.\n &#34;We are fully committed to strengthening them further to ensure all animals avoid any unnecessary pain, distress or suffering,&#34; she said.\n She added there is already a review on the feelings of species such as octopus, cuttlefish and squid and the government will &#34;carefully consider the results&#34; of this.", "posttime": "2021-06-20 21:02:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "章鱼,octopuses,动物", "title": "MPS：章鱼感到痛苦，需要法律保护 ", "title_en": "MPs: Octopuses feel pain and need legal protection", "transed": 1, "url": "https://www.bbc.com/news/newsbeat-57528249", "via": "", "real_tags": ["章鱼", "octopuses", "动物"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067025, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "zsync是一个文件传输程序。它允许您从远程服务器下载文件，您可以在其中您的计算机上有旧版本的文件副本。 zsync仅下载文件的新部分。它使用与rsync相同的算法。但是，如果rsync被设计用于将数据与组织中的一台计算机同步到另一台计算机，则Zsync专为文件分发而设计，其中一个文件在服务器上分发到数千个下载器。 Zsync不需要特殊的服务器软件 - 只是一个Web服务器托管文件 - 并在服务器上施加额外的负载，使其成为大规模文件分发的理想选择。\n ZSYNC是开源的，分布在艺术许可证的版本下。反馈，欢迎错误报告和修补程序。\n  ZSYNC填充了可用于大规模文件分发的技术中的差距。三个关键点解释了为什么zsync为文件分发提供了真正的新技术：\n  -  zsync使用rsync算法，但在客户端运行它，从而避免与rsync相关联的高服务器负载。\n  -  Zsync提供几乎与rsync-s或cvsup有效的传输，而无需运行特殊服务器应用程序。所需要的只是一个符合HTTP / 1.1的Web服务器。因此，它通过防火墙和共享托管账户工作，并提供更少的安全担忧。\n  -  rsync对压缩文件无效，除非它们被修补版的gzip压缩。 Zsync对Gzipped文件具有特殊处理，它可以启用更新分布在压缩表单中的文件传输。\n 据我所知，压缩文件的特殊处理是ZSYNC的全新和唯一的。客户端rsync和http的组合也是zsync的唯一，据我所知。 \n我已经提出了技术论文。目前有一篇目前的论文，它反映了Zsync＆＃39;最新的发展，以及我在新的测试和比较时用新数据更新;还有较旧的技术纸张快照，包括参考和引用。\n  如果人们提供Zsync下载，Zsync只有有用。我已经故意努力使Zsync在使用中简单可靠，易于部署。\n  - 通过构建.zsync文件提供zsync下载，其中包含zsync所需的元数据。此文件包含rsync算法的预先计算;它在服务器上生成一次，然后由任何数量的下载器使用。\n  -  .zsync文件有一个简单的文本标题，因此可以使用任何好的编辑器编辑，以更改下载URL等详细信息。\n  -  .zsync包含一个相对URL到文件的完整内容，因此您可以在同一服务器上生成并将其提供完整下载（并且可以像其他任何其他文件一样分发到镜像站点上）。或者它可以包含一个或多个绝对URL（如果需要，客户端将尝试多个URL以查找内容），这意味着.zsync可以完全托管在不同的服务器上;实际上，可以由第三方生成和提供.zsync，同时仍将大部分下载留给原始分发站点。\n 由于zsync是一个文件分发方法，因为只有在人们提供的.zsyncs进行下载时，它只有用。它有点难以展示程序并因为这个而构建用户群。所以我为客户端页面上提出了许多用于Zsync的用途;这些包括一些Zsync下载，我提供下载我自己，以便立即使用该计划。\n 如果您是寻求使用Zsync进行文件分发的服务器运算符，请参阅服务器页面，这为如何创建和提供.zsync文件提供了一些指导。 \n我非常满意Zsync到目前为止如何运作，但我仍然对新的想法和优化开放。我确保格式以兼容的方式相当可扩展;我希望当前版本的Zsync的用户不会在可预见的未来与更高版本的兼容性问题。\n 我也希望冻结zsync库和thecurrent命令行客户端之间的接口;我将在某些点拆分zsync到一个动态线程，它实现格式并允许它嵌入到其他项目和客户端程序中。这在一定程度上取决于任何有兴趣将Zsync嵌入其他方案的兴趣;如果我没有听到任何人都听到了这样做，那么这可能会等到我自己用了它。\n 我有兴趣听取有关Zsync的反馈。欢迎漏洞，崩溃和功能建议。也许我都对听到Zsync的使用感兴趣：我想听到任何严肃的zsync使用，因为了解人们如何使用它会影响我工作的哪个功能。如果有特征需要启用特定使用，那么我也想听到这一点，特别是有兴趣使用Zsync作为库的任何人作为更大程序的一部分;请注意，对多个文件的支持已经存在多次，但由于缺乏时间，我不太可能在不久的将来工作。 ", "note_en": "zsync is a file transfer program. It allows you to download a file from a remote server, where you have a copy of an older version of the file on your computer already. zsync downloads only the new parts of the file. It uses the same algorithm as  rsync. However, where rsync is designed for synchronising data from one computer to another within an organisation, zsync is designed for file distribution, with one file on a server to be distributed to thousands of downloaders. zsync requires no special server software — just a web server to host the files — and imposes no extra load on the server, making it ideal for large scale file distribution.\n zsync is  open source, distributed under version 2 of the Artistic License. Feedback, bugs reports and patches are welcome.\n  zsync fills a gap in the technology available for large-scale file distribution. Three key points explain why zsync provides a genuinely new technique for file distribution:\n — zsync uses the rsync algorithm, but runs it on the client side, thus avoiding the high server load associated with rsync.\n — zsync provides transfers that are nearly as efficient as rsync -z or cvsup, without the need to run a special server application. All that is needed is an HTTP/1.1-compliant web server. So it works through firewalls and on shared hosting accounts, and gives less security worries.\n — rsync is ineffective on compressed files, unless they are compressed with a patched version of gzip. zsync has special handling for gzipped files, which enables update transfers of files which are distributed in compressed form.\n The special handling of compressed files is, as far as I know, entirely new and unique to zsync. The combination of client-side rsync and HTTP is also unique to zsync, to the best of my knowledge.\n I have put up  technical papers. There is a current paper, which reflects zsync&#39;s latest development, and which I update with new figures as I run new tests and comparisons; there are also older snapshots of the technical paper, included for reference and citation.\n  zsync is only useful if people offer zsync downloads. I have made a deliberate effort to make zsync simple and reliable in use, and easy to deploy.\n — zsync downloads are offered by building a .zsync file, which contains the meta-data needed by zsync. This file contains the precalculated checksums for the rsync algorithm; it is generated on the server, once, and is then used by any number of downloaders.\n — .zsync files have a simple text header, so they can be edited with any good editor to change details like the download URL.\n — The .zsync contains either a relative URL to the full content of the file, so you can either generate and offer it on the same server as hosts the full download (and so it can be distributed like any other file onto mirror sites). Or it can contains one or more absolute URLs (the client will try multiple URLs if necessary to find the content), meaning the .zsync can be hosted on a different server entirely; in fact, the .zsync can be generated and offered by a third party, while still leaving most of the download to the original distribution site.\n Because zsync is a file distribution method, it is useful only when people offer .zsyncs for downloads. It&#39;s a little hard to demonstrate the program and build up a user base because of this. So I am suggesting a number of uses for zsync on the  client page; these include some zsync downloads that I am offering downloads myself to give some immediate use to the program.\n If you are a server operator looking to use zsync for file distribution, see the  server page, which gives some guidance on how to create and offer .zsync files.\n  I am fairly happy with how zsync works so far, but I am still open to new ideas and optimisations. I have made sure that the format is fairly extensible in a compatible way; I expect that users of the current version of zsync will not experience compatibility problems with later versions for the foreseeable future.\n I am also looking to freeze the interface between the zsync library and thecurrent command-line client; I will at some point split zsync into a dynamiclibrary, which implements the format and allows it to be embedded into otherprograms, and the client program. This to some extent depends on whether anyoneis interested in embedding zsync into other programs; if I don&#39;t hear of anyoneintending to do so, this might wait until I have a use for it myself.\n I am interested in  hearing feedback about zsync. Bugs, crashes, and feature suggestions are welcome. Perhaps most of all I am interested in hearing about uses of zsync: I would like to hear about any serious use of zsync, because knowing how people are using it will affect which features I work on. If there are features that you need to enable a particular use, then I would like to hear about that too, particularly anyone that is interested in using zsync as a library as part of a larger program; please note that support for multiple files has already been asked about many times, but due to lack of time I am not likely to work on this in the near future.", "posttime": "2021-06-20 21:01:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,下载,differential,zsync", "title": "zsync：使用rsync算法在http上下载差分文件（2010） ", "title_en": "Zsync: Differential file downloading over HTTP using the rsync algorithm (2010)", "transed": 1, "url": "http://zsync.moria.org.uk/", "via": "", "real_tags": ["算法", "下载", "zsync"]}, {"category": "", "categoryclass": "", "imagename": "cf6f68a0d14132c82f7a2fd3ce349ff6.jpg", "infoid": 1067024, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Warning: Can only detect less than 5000 characters\n虽然非常选择的互联网用户数量可以获得他们的劳动力 - 即，影响者或流行的YouTubers  - 我们大多数人都没有。如果互联网是一家工厂，那么绝大多数人都没有得到报酬。相反，用户通常以Clout的形式互相打架 - 识别我们可以为免费提供最佳的内容。 ＆＃34;在某些季度[社会]中，这种情感货币取代了工业化的工资，特别是对于努力获得来自付费内容的结构性的专业人士以及现在传播其目的而宽阔，众所周知，这是谁的职业人士们非常宽敞地传播一个人来自名称识别的生计，＆＃34;社会学家安德鲁罗斯写道。据某种理论家称，这种自由或廉价的劳动力大幅扩大了收入不平等。我们为追随者，转发和喜欢的追求，所有人都是免费的，而平台我们＆＃39;重新获得巨大的利润。只有少数大公司正在收集这些利润;所有数字广告支出的近70％用于谷歌，Facebook或亚马逊。\n正如Yasha Levine在他的书中写的那样;监视谷，＆＃34;互联网永远不会成为普通用户友好的地方 - 它是由美国军方开发的战争期间的人民，然后习惯于间谍在家中的美国人。谷歌中的一些初始资金来自美国间谍机构的赠款。当互联网基础设施被美国政府向私营公司销售时，那些站在私有化资助杂志，广告和游说的人员将从监视工具到一个可以在文化中解放我们的人。如Levine，Louis Rossetto  - 有线杂志的创始人，最大的扩音器在20世纪90年代传播新的私有化互联网 - 是一个相信互联网将取代政府的必要性的Ayn Rand Fan。今天，我们生活在这个互联网的自由主义愿景中，公司存在在基本上不受管制的，开展的，并且能够做出他们想要的，而无需担心政府会干扰。\n 但现在，更多的人似乎通过炒作来看。所以，现在的问题是如何处理这个新的集体启示。如果互联网有点像一个工厂，也许我们应该像一个这样对待它。 2014年，艺术家Laurel Ptak创建了一个称为工资的宣言，因为她认为Facebook应该支付用户的内容：＆＃34;他们说它＆＃39;友谊。我们说它＆＃39;休苗的工作。随着每一种，聊天，标记或戳我们的主体性会让他们成为利润。他们称之为它。我们称之为窃取。＆＃34;\n 虽然ptak＆＃39;工作是一件艺术，而不是改变网络的策略，它可能是一个起点。也许我们随着互联网用户可以组织才能停止免费赠送我们的心灵和思想，以便选择少数人可以盈利。正如劳工组织者推动其他行业的剥削程度，也许我们需要一个与互联网一样的运动。\n正如Levine写道，1969年，哈佛大学的数百名学生聚集在一起抗议大学＆＃39;参与创建Arpanet，前身是现代互联网的前身。学生认为它是一种危险的技术，将用于调查整个世界。如果，在互联网的开头，技术＆＃39;危害的可能性已经明显到了一些，没有理由再次对我们来说是显而易见的。也许这只是一个足够的时间问题，我们在我们讲述＆＃34;足够，＆＃34;并抗议互联网＆＃39;综合掌握我们的劳动力和我们的生活。 ", "note_en": "This year seems to be the tipping point for social  media users&#39; feelings about the internet. Once seen as a liberatory technology that would usher in an era of creativity and new connections across the globe, many - from casual Twitter users to  professional content creators - have turned on the technology.\nYou can get a sense of the shift in mood from our media output: There&#39;s Netflix&#39;s popular, dystopian reality show &#34; The Circle,&#34; in which contestants cynically compete for money using often fake internet personas. One of the streaming site&#39;s most popular documentaries in the last year was &#34; The Social Dilemma,&#34; which captured viewers&#39; attention with its explanations of Facebook&#39;s privacy faux-pas. And even some of the most buzzed-about novels this year are about the darker sides of the internet, like Lauren Oyler&#39;s &#34; Fake Accounts,&#34; and Patricia Lockwood&#39;s &#34; No One Is Talking About This .&#34; We&#39;re all re-analyzing our relationship to the internet for good reason, but we&#39;ve misclassified what this relationship really is. It&#39;s not like a bad relationship, where you can just walk away, and it&#39;s not like junk food, where you can decide to eat less - it&#39;s an all-encompassing technology, our main economic engine, the tool we are forced to use to meet others and mediate our entire lives.    A solution to our current internet-use crisis cannot come at an individual level anymore than one person quitting their job would solve capitalism&#39;s poor working conditions. If we want any hope of making the internet less stressful, less back-breaking, and more fulfilling, content creators, gig economy workers, and even casual internet users need to push for a systemic solution.  A growing body of evidence suggests that the internet really is terrible for us. A  2018 study of college students found that limiting social media use to 10 minutes a day significantly reduced anxiety in its participants. A  2019 study found that teens who spent more time online were more likely to have mental health conditions.  Other studies find that social media users end up feeling more lonely, more isolated, and less self confident.\nA veritable cottage industry has cropped up to capitalize on people&#39;s knowledge that the internet is bad for them. The web is littered with how-tos on taking a break from social media, and self-help books have been written encouraging us to unplug. There are  several popular TED Talks from former internet engineers and executives telling people that the internet is bad for them and they should leave social media behind.  Retreats for the wealthy which forbid phones and computers have cropped up, and, perhaps most worryingly, the very people who build this technology are  sending their kids to schools where the technology is banned - a tacit admission of its potential to harm people&#39;s minds.        We&#39;re constantly reminded that the internet is bad for us and yet social media use is as high as it&#39;s ever been,  averaging 145 minutes per person per day globally. We&#39;re stuck in a cycle where we know something is bad, we want to stop, and yet, seemingly, we can&#39;t.\n We can&#39;t quit the internet because we&#39;ve conceptualized the problem all wrong. Social media is not an individual addiction that can be addressed at an individual level - it&#39;s a societal problem that needs a societal fix. We need to think of the internet less as a tool we all somehow can&#39;t stop using, and more as a factory we&#39;re required to be in. Our entire society has been reformulated around the internet, much like it was centered around the factory during the Industrial Revolution. If there&#39;s an  Amazon Web Services outage, much of our society stops functioning. Without the internet, we couldn&#39;t find jobs, or, at this point, even friends.     The &#34;gig economy&#34; - the often  underpaid and  exploitative labor performed by Uber drivers and Instacart shoppers - was enabled by the internet, and now  more than a quarter of workers in the US participate in this economy in some form. During the pandemic, office workers were only able to fulfil their required job duties through the internet, and college students forked over full tuition for the privilege of staring at Zoom for hours each day.\n We&#39;re all required to be here - online - for our livelihoods. But even when we&#39;re not required to be here, companies attempt to make sure we still are: App and game developers  use the same science that keeps people playing the slots in Las Vegas to keep us glued to our screens.\nAs culture and media theorist McKenzie Wark  writes in her book &#34;Capital is Dead: Is This Something Worse?&#34;, the internet uses our labor without us really knowing it. Unlike the broadcast era of media, during which the owners of television networks and movie studios had to at least create the content to sell to us, we now create all the content for each other, mostly without being paid.     &#34;[Social media companies like Facebook] don&#39;t even bother to provide any entertainment,&#34; Wark writes. &#34;We have to entertain each other, while they collect the rent, and they collect it on all social media time, public or private, work or leisure, and (if you keep your FitBit on) even when you sleep.&#34;\n We produce the memes, tweets, posts, and pictures that keep us tethered to the internet, and then that  content is monetized in the form of advertisements - revenue users help produce, but do not usually see a penny of.\nAlthough a very select number of internet users  can get paid for their labor - i.e.  influencers or popular YouTubers - most of us do not. If the internet is a factory, it is one in which the vast majority of people are not getting paid. Instead, users often fight with each other for non-monetary payment  in the form of clout - recognition that we can produce the most and best content for free.   &#34;In some quarters [of society], this affective currency has replaced the wages of industrialization, especially for professionals who used to earn a structured living from paid content and who now disseminate their bylines far and wide in hopes of securing a niche livelihood from name recognition,&#34; the sociologist Andrew Ross  writes. This free or cheap labor has widened income inequality massively, according to some theorists. We fight for followers, retweets, and likes, all for free, while the platforms we&#39;re on profit massively. And only a few, large companies are collecting these profits;  almost 70% of all digital ad spending goes to either Google, Facebook, or Amazon.\nAs Yasha Levine writes in his book &#34; Surveillance Valley,&#34; the internet was never meant to be a place friendly to the average user - it was developed by the US military to spy on people during wars, and then used to spy on Americans at home too. Some of Google&#39;s initial funding  came from grants from US spy agencies. When the infrastructure of the internet was sold off by the US government to private companies, the people who stood to profit off that privatization funded magazines, advertisements, and lobbying to reframe the internet from a surveillance tool to one that could liberate us culturally. As detailed by Levine, Louis Rossetto - the founder of Wired Magazine, the biggest megaphone for evangelizing the new, privatized internet in the 1990s - was an Ayn Rand fan who believed the internet would come to replace the need for a government.     Today we live in this libertarian vision of the internet in which companies exist largely unregulated, undertaxed, and able to do what they want without worry that the government will interfere.\n But now, more people seem to be seeing through the hype. So, the question now is what to do with this new, collective revelation.If the internet is somewhat like a factory, perhaps we should treat it like one. In 2014, the artist Laurel Ptak created a manifesto called  Wages for Facebook in which she argued that Facebook should pay users for their content:     &#34;They say it&#39;s friendship. We say it&#39;s unwaged work. With every like, chat, tag or poke our subjectivity turns them a profit. They call it sharing. We call it stealing.&#34;\n Though Ptak&#39;s work is a piece of art, not a  strategy for changing the web, it could be a starting point. Perhaps we as internet users can organize to stop giving away our hearts and minds for free so that a select few can profit off of them. Just as labor organizers have pushed to make other industries less exploitative, perhaps we need a movement to do the same with the internet.\nAs Levine writes, in 1969, hundreds of students at Harvard gathered to protest the university&#39;s involvement in the creation of ARPANET, the precursor to the modern internet. The students saw it as a dangerous technology that would be used to surveil the entire world. If, at the beginning of the internet, the technology&#39;s potential for harm was already obvious to some, there&#39;s no reason it cannot become obvious to us again. Perhaps it is only a matter of time before enough of us say &#34;enough,&#34; and protest the internet&#39;s totalizing grasp on our labor and our lives.", "posttime": "2021-06-20 20:25:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "互联网,internet", "title": "互联网正在摧毁我们的大脑，但我们不能戒烟。 这是一家工厂，我们被迫在没有任何薪水的情况下工作。 研究表明互联网对我们的心理健康不好，更多的人会意识到其危害。 ", "title_en": "The internet is destroying our brains, but we can't quit. It's a factory we're forced to work in without any pay. Studies show the internet is bad for our mental health, and more people are realizing its harms.", "transed": 1, "url": "https://www.businessinsider.in/tech/news/the-internet-is-destroying-our-brains-but-we-cant-quit-its-a-factory-were-forced-to-work-in-without-any-pay-/articleshow/83666612.cms", "via": "", "real_tags": ["互联网", "internet"]}, {"category": "", "categoryclass": "", "imagename": "c59b654887a4abef34ec052c8fff21bb.jpg", "infoid": 1067020, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大多数游戏失去了几年后失去相关性，但独立火箭建筑游戏Kerbal Space程序有点不同。这是一个诙谐，10岁的弱者，一个邪教，伴随程序员，工程师，宇航员候选人和你典型的划清爱好者，它拥有一个独特而活跃的莫德德社区，他们一直在修复错误，加入新功能，通常将游戏保持新近十年。\n 在游戏中，您是一个由文字小绿色男人（和心爱的小绿女人Valentina Kerman）组成的空间计划的无关总监 - 我们看到了您，拓丁片）您在您自己的设计上送Skyward。它经常感觉像观看那些火箭队的模糊旧视频推出只会在火热的Schadenfreude爆炸中直接退缩：你觉得有点吓坏了，有点虐待，你真的想再试一次。\n  其中一个最多产的Kerbal Modders是Chris Adderley，Nertea在游戏中，作为加拿大空间公司MDA的工程师，日常设计基于地面的系统，从航天器中检索数据。但在他关闭时，阿德利自己进入了飞行员。他在发布后不久，他开始玩Kerbal Space计划，并于2013年开始为游戏制造他的第一个Mod-A包装零件，包括氙气储罐和磁体上动力推进器（试图快速说三次）。\n 从那时起，他设计了几十个额外的Mods，包括Mark IV Spaceplane和空间站加载，如离心机和充气栖息地。\n “我建立了我希望将来作为某种物种在未来建造的东西，”阿德利说。\n 最近，Addlerley决定采取一些最合理的远期理论火箭发动机概念，并在游戏中建立它们的游戏玩家在模拟环境中尝试这些科幻概念，可以教导我们如何实际上在未来工作，更实用的水平。\n    阿德利梳理了几十个科学论文，这些论文概述了这些超级推进系统的理论蓝图，寻找最逼真的人。 \n“每个人都试图将他们的项目销售为未来的推进系统，”阿德利说。 “你需要批判性地思考人们挥手的话。”\n 他嘎吱作响的数字，考虑了特定发动机需要多少功率，如何处理产生的热量，以及如何利用能量进一步推动虚拟火箭。 “这是超级赛，这可能是一个超级陈述，但你知道。”\n 最后，他建造了13个不同的发动机概念，包括融合发动机 - 就像普通的epstein驱动器被理论为易变引擎，以及反物质火箭。\n 虽然我们尚未实现这些特定冲动的恶魔的技术，但是能够在低赌注环境中模拟高级发动机的一些现实世界的价值。事实上，它是一个很棒的沙箱，在Spacex和喷气机推进实验室在其演示中使用了Kerbal图形。 2018年，美国宇航局发布了一个遥测数据可视化软件，专为运营宇宙飞船而设计的遥测数据可视化软件，在Github上公开。在真正的航天器上测试这些系统是昂贵且耗时的，因此一些参与者通过Kerbal来运行他们的节目。\n 对于Sumontro Sinha，Aerospace工程师和Huntsville大学推进研究实验室的航空工程师和融合研究员，Kerbal是测试新想法和培训新工程师的转向。\n “而不是PowerPoint幻灯片和方程页，只需制作船只，看看它是如何工作的，”他说。 “如果它在Kerbal工作，那么它有很好的机会在现实生活中工作。”\n  球形Tokamak融合引擎是基于2001年的虚构宇宙飞船：一个空间奥德赛，杀手Ai患者。 Adderley在美国宇航局研究中发现了它背后的实际科学，其中纸张的领先作者Craig Williams表示，NASA资助了一些专注于开发先进推进系统的项目。威廉姆斯的团队设计了一种发动机，它使用融合反应产生的能量来产生推力。融合自然地发生在像我们的太阳一样的恒星内部，其中轻质原子被过热到它们的电子和中子去耦和中子的点，通常彼此驱动，融合在一起并产生大量的能量。在地球上产生这种能量的最大挑战之一是您需要一种局限于将所得的等离子体限制在一起。 \n这样做的一种方法是用托卡马克，一种装置，该装置产生甜甜圈形磁场，该磁场将超热等离子体保持在适当位置。在威廉姆斯的发动机原型中，这个Tokamak几乎是球形 - 更像是甜甜圈洞。所生产的废气将推动车辆超过166,000英里/小时，在4个月内将乘客带到木星。要进入视角，深空探针旅行者正在远离我们的太阳系以35,000英里/小时。\n 当威廉姆斯纸在2001年出局时，作者写道，生产这种类型发动机的能力可能是30年。现在它是2021年，威廉姆斯正在修改他的估计。 “我们可能没有更近，”他说。他的论文在高级推进时出现了热情的时代，但其中大部分地区都在最近发生过。 “当没有积极的程序继续进行时，你真的无法做出很大的进步，”他说。 “直到你再次开始时钟，那30年的投影将继续前进。” bummer。但在现在的几十年里和人类的两周土星假期的时代，你仍然可以尝试自己的数字版威廉姆斯的发动机。\n  后台裂变片段火箭发动机基于2011年的另一个美国宇航局资助的发动机概念研究，利用核反应所产生的能量来推动航天器向前推进。充满亚美的反应器，一种高放射性稀有材料，是铀驱动的核反应的副产品，产生流动腔室的裂变产物。该腔室喷射有氢气，当它与裂变片段遇到时强烈兴奋，并产生通过强大的磁性喷嘴作为推力漏斗的等离子体。\n 凭借这一突破，往返火星的旅行将需要292天，包括在地球上的60天逗留。虽然发动机总体比融合引擎更慢，但它将靠近我们技术上能够在技术上更接近。\n “核热火火箭是一种发展的技术，它已经证明，”杰森卡尼比斯说，他在亨茨维尔大学领导了阿拉巴马大学的推进研究中心。 4月，DARPA选择了三家承包商来展示核热火箭的第一阶段，美国宇航局和美国宇航局在2月份提出了类似的初步设计。 Cassibry说裂变片段和核脉冲发动机不远，但它们有额外的工程障碍，包括如何将所有能量从航天器的船体转移到，因此它不会在空间中烧毁。 ", "note_en": "Most games lose relevance after a few years, but the indie rocket-building game  Kerbal Space Program is a bit different. It’s a glitchy, 10-year-old underdog of a game with a cult following of programmers, engineers, astronaut candidates, and your typical lay explosion enthusiasts, and it has a unique and active community of modders who’ve been fixing bugs, adding new features, and generally keeping the game fresh for nearly a decade.\n In the game, you are the omniscient director of a space program composed of literal little green men (and beloved little green woman Valentina Kerman—we see you, trailblazer) that you send skyward in spacecraft of your own design. It often feels like watching those blurry old videos of rockets launching only to come straight back down in an explosion of fiery schadenfreude: you feel a little bit frightened, a little bit sadistic, and you really want to try it again.\n  One of the most prolific  Kerbal modders is Chris Adderley, Nertea in the game, who is an engineer at the Canadian space company  MDA by day, designing ground-based systems that retrieve data from spacecraft. But in his off time, Adderley gets into the pilot’s seat himself. He started playing  Kerbal Space Program soon after its release, and in 2013 started building his first mod for the game—a pack of spare parts, including a xenon fuel tank and a magnetoplasmadynamic thruster (just try saying that three times fast).\n Since then, he’s designed dozens of additional mods, including a Mark IV Spaceplane and space station add-ons like centrifuges and inflatable habitats.\n “I build stuff that I’d like to see us as a species build in the future,” says Adderley.\n Recently, Addlerley decided to take some of the most plausible far-future theoretical rocket engine concepts and build them in the game—introducing a way for gamers to try out these sci-fi  concepts in a simulated environment that can teach us how they might actually work, on a more practical level, in the future.\n    Adderley combed through dozens of scientific papers that outlined theoretical blueprints for these ultra-advanced propulsion systems, looking for those that were most realistic.\n “Everybody tries to sell their project as the propulsion system of the future,” says Adderley. “You need to kind of think a little bit critically about what people have hand waved.”\n He crunched the numbers, considered how much power a specific engine would need, how to deal with the heat produced, and how you’d harness the energy to propel the virtual rocket further. “That was superfun, which might be a supernerdy statement, but you know.”\n In the end, he built out 13 different engine concepts, including fusion engines—like   The Expanse&#39;s Epstein drive is theorized to be—fission engines, and antimatter rockets.\n Though we don’t yet have the technology to implement these specific-impulse demons, there is some real world value in being able to simulate advanced engines in a low-stakes environment. In fact, it’s such a great sandbox that engineers at SpaceX and the Jet Propulsion Laboratory have used Kerbal graphics in their presentations. In 2018,  NASA released Open MCT, a telemetry data visualization software designed for operating spacecraft, to the public on Github. It’s costly and time-consuming to test these systems on real spacecraft, so some participants ran their programs through Kerbal instead.\n For Sumontro Sinha, an aerospace engineer and fusion researcher at the Propulsion Research Lab at the University of Alabama in Huntsville, Kerbal is the go-to for testing out new ideas and training new engineers.\n “Instead of Powerpoint slides and pages of equations, just make the ship and see how it works,” he says. “If it works in Kerbal, then it has a good chance of working in real life.”\n  The  spherical tokamak fusion engine is based on the fictional spaceship in   2001: A Space Odyssey, sans HAL the killer AI. Adderley found the actual science behind it in  a NASA study, in which the paper’s lead author, Craig Williams, says NASA funded a number of projects focused on developing advanced propulsion systems. Williams’ team designed an engine that uses the energy produced by a fusion reaction to generate thrust. Fusion occurs naturally in the interior of stars like our sun, where lightweight atoms are superheated to the point where their electrons and neutrons decouple and neutrons, normally repellant to one another, fuse together and produce massive amounts of energy. One of the biggest challenges in producing this energy on Earth is that you need a way to confine the resultant plasma and harness its power.\n    One way to do this is with a tokamak, a device that generates a donut-shaped magnetic field that keeps the superheated plasma in place. In Williams’ engine prototype, this tokamak would be nearly spherical—more like a donut hole. The exhaust produced would propel the vehicle to over 166,000 mph, taking passengers to Jupiter in just under 4 months. To put that into perspective, the deep space probe Voyager is traveling away from our solar system at 35,000 mph.\n When Williams’ paper came out in 2001, the authors wrote that the capability to produce this type of engine might be 30 years out. Now that it’s 2021, Williams is revising his estimate. “We’re probably not any closer,” he says. His paper came out in an era of enthusiasm for advanced propulsion, but much of that zeal has waned until recently. “You can’t really make much progress when there’s no active program going on, “ he says. “Until you start the clock again, that 30-year projection will just keep moving forward.” Bummer. But in the decades between now and humanity’s era of two-week Saturn vacations, you can still try out your own digital version of Williams’ engine.\n  The Afterburner  fission fragment rocket engine is based on another NASA-funded engine concept study from 2011 that utilizes the energy created in nuclear reactions to propel a spacecraft forward. Reactors filled with  Americium, a highly radioactive rare material that is a byproduct of uranium-driven nuclear reactions, generate fission products that flow down a chamber. This chamber is injected with hydrogen gas, which gets intensely excited when it meets up with the fission fragments and generates a plasma that is funneled through a powerful magnetic nozzle as thrust.\n With this breakthrough, a round trip to Mars would take 292 days, including a 60-day stay on the planet. While the engine is slower overall than a fusion engine would be, it’s far closer to what we’re technologically capable of at present.\n “The nuclear thermal rocket is a technology that is getting developed, and it’s already been demonstrated,” says Jason Cassibry, who leads the Propulsion Research Center at the University of Alabama in Huntsville. In April, DARPA  selected three contractors to demonstrate the first phase of a nuclear thermal rocket, and NASA and the DOE put out  a call for similar preliminary designs in February. Cassibry says fission fragment and nuclear pulse engines are not far behind, but they have additional engineering hurdles to face, including figuring out how to divert all that energy away from the hull of the spacecraft so it doesn&#39;t burn up in space.", "posttime": "2021-06-20 19:02:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "space,kerbal", "title": "在Kerbal Space计划中测试下一个Gen Space Tech ", "title_en": "Test out next-gen space tech in Kerbal Space Program", "transed": 1, "url": "https://arstechnica.com/gaming/2021/06/test-out-next-gen-space-tech-in-kerbal-space-program/", "via": "", "real_tags": ["space", "kerbal"]}, {"category": "", "categoryclass": "", "imagename": "3b62595cb92b559ca133f5fdffc58f4b.jpg", "infoid": 1067019, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在喧嚣的时代，人类向古代世界寻求指导和灵感。这是一种动态，至少与彼得罗德一样古老，这是希腊人和罗马人的奖学金的14世纪的意大利诗人，帮助开始了复兴。\n  Paul Skallas，一位36岁的技术律师和作家，今天拿起古代的火炬。他是一个来自遥远过去的智慧的福音学家：如，说，跳过漱口水。\n “每个人都告诉你这样做。你的呼吸很干净，感觉就像是正确的事情一样，“他在法国多维尔的缩放期间说，他从去年纽约市搬到了纽约市以乘坐大流行。 “然后你读到使用它的人的更高的癌症率，以及如何破坏好的和坏细菌，你走了，'你是对的，那么没有漱口水。”\n “然后回来”是古代世界，Skallas先生从中吸取了无穷无尽的实践课程。\n “没有早餐，”他说。 “早餐在早期历史，罗马，拜占庭，古希腊，早餐并不是一件事。”他写了关于Plutarch和Thomas Aquinas的反早餐职位。\n Skallas先生为基于一个相对模糊的理论的生活方式是一个推荐人，称为Lindy效应，他从中获得了他的Twitter Hander Lindyman;他的家喻户晓，林迪通讯;他的播客，“林迪谈话”;以及他的健康，运动，饮食和消费者选择的实际哲学。\n  林迪效应可以追溯到新共和国的1964篇文章，称为“林迪法”，由历史学家艾伯特戈德曼描述了“秃头，雪茄的雪茄般的雪茄专业的一位全体林德林林迪，”然后晚餐在百老汇以其芝士蛋糕而闻名，并假设自从喜剧演员提供了疲软的良好材料供应，因此“电视喜剧演员的预期寿命与他在媒体上的暴露总量成比例。” \nNassim Nicholas Taleb，统计日和学者，在2012年的书中调整了这个想法，将这个想法变为广泛的生存性理论，“抗皱：来自紊乱的东西”。他把它命名为林迪效果：“对于易腐的，生活中的每一天都会转化为更短的额外预期寿命，”他写道。 “对于令人难步的，每一天都可能意味着更长的预期寿命。”\n 例如，在百老汇五年上运行的剧本可能会留下五个。他得出结论：“物品的稳健性与其生命成比例！”\n Taleb先生认为林迪效应有助于解释为什么这么多看似的地震新的发展最终被遗忘或被丧失。例如，许多科学家在过去十年中度过了一个关于“复制”危机的警报状态：许多发现结果在其他科学家重复研究时不会持有。\n 换句话说，不准确的科学是不断发表的。科学数据的林实意识的消费者将严重采取，只有在一段时间内举起的信息。\n 林迪，他在2017年在媒体上写道，不能被愚弄：“事情的唯一有效的判断是时候了。”\n  Skallas先生长期以来，并阅读了Taleb先生，他与古代世界共同着迷。他甚至一旦设法在托莱布先生的书中讨论了一个断言后，他甚至一直在进行学者的罕见矫正，声称古人没有针对颜色的单词。\n 虽然Taleb先生主要讨论了统计和社会科学方面的林迪效应，但Skallas先生在饮食，健康，约会，运动和几乎所有其他一切时，Skallas先生阐述了Lindy的实际应用。他已成为一位生活方式大师的东西，以数千名推特粉丝和时事通讯读者：通过青铜时代思考Goop或Joe Rogan。 \n在2020年的家喻柱概述他的想法中，他写道，“Lindy主要存在于您的保护，在现代世界中的风险/生存策略，”持续冲击“新产品，新的学科，新书，新技术，新的食物，新的生活安排，生命的新“理论”，新姿势。“\n  林迪不是淫荡：Skallas先生是一个毕竟是一个狂热的社交媒体用户。相反，他为他所谓的“有用传统”的适用掘金彻底扼杀了古老的世界，使用林德效应的老年人的启发式更好地作为“抵抗消费主义”的“舷墙”，以筛选“每天出来的大量产品”。\n “当我在商店时，我想到了，”他说。 “这是一种寻找现代商业生活怀疑的新方式。”\n Skallas先生在古代的基础上赞同实践，如间歇性禁食，这在宗教传统上出现并具有明显的健康益处（虽然也在批评者）。 “你的身体通过压力源强烈变得更强大，通过缺乏食物，它变得更加强大，”他说。\n 他遵循从希腊东正教传统中汲取的饮食，在素食主义和刺激性之间交替交替（今天有些人称呼这个连续循环）。他的帐户@lindydiet从他的账户中提供了进一步的细节：“快速每周2次（素食或从食物中弃权），每年一次直行2次。”\n Skallas先生建议避免在过去500年中避免吃任何食物或饮料的古老饮食的倡导者。这意味着没有超越牛肉，怪物能量或去咕噜声，但对羊肉，热十字面包等。\n “咖啡比较令人愉快，”他说，承认截止的武装。 “这是400岁，但这是400年的滤波，这对你来说可能并不坏。”茶度享受他的最高恭维：这是一个“深林德”饮料，有数千年的出处。 \n虽然烟草是;对于那些想要以“菩提兼容方式”吸烟的人，他建议了一个管道。\n Skallas先生避开了现代运动机器，敦促他的读者在一张通讯岗位中坚持以简单的重量升降，引用克罗顿米洛斯米洛斯，这是每天抬起小牛的希腊语健美运动员，直到他能够提升成人的公牛。\n “健美文化是一些怪异的亚文化，是现代性的产物，”他写道。 “锻炼不是肌肉，但是关于你身体中的其他系统，相互连接。”\n 同样他对瑜伽持怀疑态度，因为今天大多数美国人的形式在20世纪发明了大多数美国人的形式。 “对你来说是好还是坏的？我不知道，“他写道。 “林迪并没有说'不要这样做，'它说'我们不知道会发生什么。'\n  Skallas先生，他花了工作日阅读合同，并没有看到自己是一个自助人物或哲学家。 “这不是乔丹·彼得森的事情，”他说，参考加拿大哲学家，其书籍为年轻人提供了指导的建议。 “我没有动力，”他说。 “我就像，'哇，看这个。'”\n    时尚的Midcantury现代主义？ “随时你远离分形图案和华丽的细节，它不是林德。”\n 性玩具怎么样？ “林迪，”他说，以解释为“古埃及”。 \n杰弗里爱普斯坦丑闻？ “一些有些富人来临，做犯罪行为和虐待人？这是漂亮的林德！“\n 他指出，埃普斯坦，举例说明了林迪如何不是道德指南针;古代世界的许多常见行为今天将被认为是令人憎恶的。\n  然而，千年行为的持续存在使古代有效的教训。 “人性没有改变，”他说。古人“真的确实研究了这个人以及人们如何行动，其中一些是非常好的。”\n 例如，疗法是他相信的，但不是因为他持有Carl Jung和Sigmund Ferud的理论中的股票;相反，他争辩，治疗方法是因为治疗师体现了一个同情朋友在疏远现代世界的深层林德。\n 当然，Lindy效果在每个领域都不起作用;如果您被诊断患有癌症，Skallas先生说，寻求化疗，而不是依靠罗马医疗措施。他认为林迪在工业时代消耗品的怀疑，如漱口水或加工的种子油，以及戴克斯的迈尔斯 -  Briggs测试就像漱口药或加工的种子油一样，更有用。\n 而古老的实践可以为他们的从业者提供强大的宁静益处，即使当时可能不清楚的确切原因和效果也可能不清楚。在他的时事通讯中，Skallas先生引用了2016本书“我们成功的秘诀”，Joseph Heinrich是哈佛大学的人类进化生物学教授的Joseph Heinrich。\n 海因里希先生研究了Manioc的历史，在南美洲驯化的苦根，如果没有准备好，这可能会有毒。在亚马逊中，“土着替葫芦使用多次，多日期加工技术，涉及刮擦，光栅和最终洗涤根，”去除氰化物。 \n在17世纪葡萄牙人将Manioc运往西非，根本迅速传播，但适当的加工技巧没有。 “即使经过数百年，慢性氰化物中毒仍然是非洲的严重健康问题，”海因里希先生写道。\n  Skallas先生经常邀请新的艺术条款：他谈论“4HL，”或四小时的生活，就像现代办公室工作人员一样的空闲时间，以及“精致文化”的平滑聪明当代美学，被新车设计，品牌徽标和城市咖啡馆内饰的相似性。\n 他最重要的艰辛可能是“林迪走”，他去年提出了，寻求逃离检疫的低迷。\n “这基本上意味着漫步，”他说。 “但它也是很多古代文化，散步的繁重传统，对吧？有安息日漫步。在希腊语中，它被称为Volta。有意大利版本。它只是为了走路而行。“\n 在通讯邮报中，Skallas先生引用了希腊沃克斯“从Diogenes徘徊世界寻找一个诚实的人，在思想中丢失时磕磕绊绊的耳子磕磕绊绊。”\n Lindy散步不仅仅是来自点到点的直线;应该没有设置目的地，随机作出，以刺激心灵。 “当我走路时发生了一个有趣的事情。 “斯卡拉斯先生写道，我有兴趣进入我的脑海里。 “想法的浪潮会通过。我不是“尝试”思考甚至想出一个想法。它会出现。喜欢魔法。“\n  许多Skallas的读者先生开始在日常林迪散步并在社交媒体上发布关于他们，而该术语现在已经扩散到他的直接读者之外。 \n“基本上它只是有意识的习惯形成，但我认为有些原因的可爱名字使它更加诱人和可爱，”随着一个追随者放置它。  Skallas先生认为大流行 - 本身深林迪（“他们在500年前放在面具上，对吧？”） - 通过唤起许多人感到绝缘的古老，世界历史危险，开启了人们的眼睛。 “我想在这个大流行袭击之前，我们居住在一个时候，'嘿，男人，我们不可触碰，'”他说。 但检疫迫使许多人开始“思考稀缺，”并问自己，“林迪是什么？ 喜欢，在这一生中需要什么东西？“  疫苗接种是那些事情之一，所以下次Skallas先生被联系了这篇文章，他在芝加哥，他在那里旅行了他的射门。 他在一封电子邮件中写道，虽然他还没有放弃他的日常工作，但一本书（非常林迪）可能在作品中。 ", "note_en": "In a tumultuous time humanity looks to the ancient world for guidance and inspiration. It’s a dynamic at least as old as Petrarch, the 14th-century Italian poet whose scholarship on the Greeks and Romans helped kick-start the Renaissance.\n  Paul Skallas, a 36-year-old technology lawyer and writer, has today picked up antiquity’s torch. He’s an evangelist for wisdom derived from the distant past: like, say, skip the mouthwash.\n “Everyone tells you to do it. Your breath is clean, it feels like the right thing to do,” he said during a Zoom call from Deauville, France, where he moved from New York City last fall to ride out the pandemic. “And then you read about  higher cancer rates for people who used it, and  how it destroys good and bad bacteria, and you go, ‘You’re right, there was no mouthwash back then.’”\n “Back then” is the ancient world, from which Mr. Skallas draws an inexhaustible supply of practical lessons.\n “No breakfast,” he said. “Breakfast was unknown in early history, Rome, Byzantium, ancient Greece, breakfast wasn’t really a thing.” He’s  written about the anti-breakfast positions of Plutarch and Thomas Aquinas.\n Mr. Skallas is a proponent for a lifestyle based on a relatively obscure theory called the Lindy Effect, from which he has derived his Twitter handle, LindyMan; his Substack,  The Lindy Newsletter; his podcast, “ Lindy Talk”; and his practical philosophy of health, exercise, diet and consumer choice.\n  The Lindy Effect can be traced to a  1964 article in The New Republic called “Lindy’s Law,” by the historian Albert Goldman, who described the “bald-headed, cigar-chomping know-it-alls who foregather every night at Lindy’s,” the diner then on Broadway known for its cheesecake, and postulated that since comedians have an exhaustible supply of good material, the “life expectancy of a television comedian is proportional to the total amount of his exposure on the medium.”\n Nassim Nicholas Taleb, a statistician and scholar, tweaked this idea into a broad theory of survivability in his 2012 book, “Antifragile: Things That Gain From Disorder.” He named it the Lindy Effect: “For the perishable, every additional day in its life translates into a shorter additional life expectancy,” he wrote. “For the nonperishable, every additional day may imply a longer life expectancy.”\n For example, a play that has run on Broadway for five years will likely stick around for five more. He concluded: “The robustness of an item is proportional to its life!”\n Mr. Taleb argued that the Lindy Effect helps explain why so many seemingly earthshaking new developments end up forgotten or disproved. For example, many scientists have spent the last decade in a state of alarm about  the “replication” crisis: that many findings turn out not to hold up when other scientists repeat the studies.\n Inaccurate science, in other words, is constantly being published. The Lindy-conscious consumer of scientific data will take seriously only information that has held up over a period of time.\n Lindy, he wrote in  a 2017 post on Medium, cannot be fooled: “The only effective judge of things is time.”\n  Mr. Skallas has long followed and read Mr. Taleb, with whom he shares a fascination with the ancient world. He even once managed to elicit a rare correction from the scholar after disproving an assertion in one of Mr. Taleb’s books, which claimed the ancients did not have a word for the color blue.\n While Mr. Taleb primarily discussed the Lindy Effect as in terms of statistics and social science, Mr. Skallas has expounded at length about the practical applications of Lindy when it comes to diet, health, dating, exercise and practically everything else. He has become something of a lifestyle guru to thousands of Twitter followers and newsletter readers: think Goop or Joe Rogan by way of the Bronze Age.\n In a 2020 Substack post outlining his ideas, he wrote, “Lindy exists chiefly for your protection, for risk/survival strategies in the modern world,” with its constant onslaught of “new products, new academic disciplines, new books, new technologies, new foods, new living arrangements, new ‘theories’ on life, new postures.”\n  Lindy is not Luddism: Mr. Skallas is an avid social media user, after all. Rather, he scours the ancient world for applicable nuggets of what he calls “useful tradition,” using the Lindy Effect’s heuristic of older is better as a “bulwark against consumerism,” to sift through the “tons of products coming out every day.”\n “When I’m at the store, I think about it,” he said. “It’s a new way of looking at skepticism of modern commercial life.”\n Mr. Skallas endorses practices with a basis in antiquity, like intermittent fasting, which appears across religious traditions and has demonstrable  health benefits (though  also detractors). “Your body gets stronger through stressors, and it gets stronger through the lack of food,” he said.\n He follows a diet drawn from Greek Orthodox tradition, alternating between veganism and pescatarianism (today some call this serial cycling). A tweet from his account @LindyDiet laid out further specifics: “Fast 2 times a week (vegan or abstain from food) and a month straight 2 times a year.”\n Somewhat akin to the advocates of the paleo diet, Mr. Skallas recommends avoiding eating any foods or beverages invented in the past 500 years. This means no Beyond Beef, Monster Energy or Go-Gurt but yes to mutton, hot cross buns and the like.\n “Coffee is relatively new,” he said, acknowledging the arbitrariness of the cutoff. “It’s 400 years old, but that’s 400 years of pretty good filtering, and it’s probably not bad for you.” Tea merits his highest compliment: It’s a “deep Lindy” beverage, with thousands of years of provenance.\n Cigarettes, a 20th-century vice, are not Lindy, though tobacco is; for those who want to smoke in a “Lindy compatible way,” he suggests a pipe.\n Mr. Skallas eschews modern exercise machines, urging his readers in a newsletter post to stick with simple weight lifting, citing Milos of Croton, the mythical Greek bodybuilder who lifted a calf daily until he could hoist the adult bull.\n “Bodybuilding culture is some grotesque subculture that is a product of modernity,” he wrote. “Working out isn’t about the muscles, but about the other systems in your body, interconnected to each other.”\n Likewise he is skeptical of yoga, given that the form practiced by most Americans today was  invented in the 20th century. “Is Yoga good or bad for you? I have no idea,” he wrote. “Lindy doesn’t say ‘don’t do it,’ it says ‘we don’t know what’s going to happen.’”\n  Mr. Skallas, who spends his work day reading contracts, does not see himself as a self-help figure or a philosopher. “It’s not a Jordan Peterson thing,” he said, referring to the Canadian philosopher whose books offer advice  directed at young men. “I’m not into motivation,” he said. “I’m just like, ‘Whoa, look at this.’”\n    Sleek midcentury modernism? “Anytime you get away from fractal patterns and ornate details, it’s not Lindy.”\n How about sex toys? “Lindy,” he said, adding, by way of explanation, “ ancient Egypt.”\n The Jeffrey Epstein scandal? “Some rich guy going around and doing criminal behavior and abusing people? It’s pretty Lindy!”\n Epstein, he pointed out, exemplified how Lindy is not a moral compass; lots of common behaviors in the ancient world would be considered abhorrent today.\n  Yet the persistence of behaviors across millenniums makes the lessons of antiquity potent. “Human nature doesn’t change,” he said. The ancients “really did study the person and how people act, and some of it is quite good.”\n Therapy, for example, is something he believes in, but not because he holds stock in the theories of Carl Jung and Sigmund Freud; rather, he argued, therapy works because the therapist embodies the deep Lindy role of a sympathetic friend in the alienating modern world.\n Of course, the Lindy effect doesn’t work in every domain; if you are diagnosed with cancer, seek chemotherapy, Mr. Skallas said, rather than relying on Roman medical practices. He thinks Lindy is more useful when it comes to skepticism of industrial-age consumables, like mouthwash or processed seed oils, and faddish social science, like the  debunked Myers-Briggs test.\n And ancient practices can provide powerful inchoate benefits to their practitioners, even when the exact cause and effect may be unclear at the time. In his newsletter, Mr. Skallas cited the 2016 book “The Secret Of Our Success,” by Joseph Heinrich, a professor of human evolutionary biology at Harvard.\n Mr. Heinrich researched the history of manioc, a bitter root domesticated in South America, which can be toxic if not prepared properly. In the Amazon, “Indigenous Tukanoans use a multistep, multiday processing technique that involves scraping, grating, and finally washing the roots,” to remove cyanide.\n After the Portuguese transported manioc to West Africa in the 17th century, the root spread rapidly, but the proper processing techniques did not. “Even after hundreds of years, chronic cyanide poisoning remains a serious health problem in Africa,” Mr. Heinrich writes.\n  Mr. Skallas often invents new terms of art: He talks about “ the 4HL,” or four-hour life, as in the amount of free time available to modern office workers, and of “ refinement culture,” the smoothed-down sameness of contemporary aesthetics, exemplified by the similarity of new car designs, brand logos and urban cafe interiors.\n His most significant coinage may be “Lindy walk,” which he came up with last year, seeking an escape from the quarantine doldrums.\n “That just basically means a stroll,” he said. “But it’s also in a lot of ancient cultures, a heavy tradition of walking, right? There’s the Sabbath stroll. In Greek, it’s called Volta. There’s an Italian version of it. It’s just walking for the sake of walking.”\n In a newsletter post, Mr. Skallas cited Greek walkers “from Diogenes wandering the world looking for an honest man to Thales stumbling into a pit while lost in thought.”\n A Lindy walk isn’t just a beeline from Point A to Point B; there should be no set destination, with turns made at random to stimulate the mind. “An interesting thing happened when I walked. I had thoughts popping into my head,” Mr. Skallas wrote. “Waves of ideas would come through. I wasn’t ‘trying’ to think or even come up with an idea. It would just appear. Like magic.”\n  Many of Mr. Skallas’s readers began taking daily Lindy walks and posting about them on social media, and the term has now spread beyond his immediate readership.\n “Essentially it’s just conscious habit forming, but I think the cute name for some reason makes it more enticing and endearing,” as one follower put it.\n Mr. Skallas thinks the pandemic — itself deep Lindy (“they put on a mask 500 years ago, right?”) — opened people’s eyes to the worldview by evoking ancient, world-historical dangers that many had felt insulated from. “I think before this pandemic hit, we were living in a time of, ‘Hey, man, we’re untouchable,’” he said. But quarantine forced many to begin “thinking about scarcity,” and ask themselves, “What is Lindy? Like, what is the stuff you need in this life?”\n Vaccination was among those things, and so the next time Mr. Skallas was contacted for this article, he was in Chicago, where he’d traveled for his shot. He wrote in an email that although he wasn’t giving up his day job just yet, a book (very Lindy) might be in the works.", "posttime": "2021-06-20 18:55:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "生活,lindy,林迪", "title": "林德的生活方式 ", "title_en": "The Lindy Way of Living", "transed": 1, "url": "https://www.nytimes.com/2021/06/17/style/lindy.html", "via": "", "real_tags": ["生活", "lindy", "林迪"]}, {"category": "", "categoryclass": "", "imagename": "cbabf5f340035401db6482c5273cdb8d.jpg", "infoid": 1067018, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个最新版本的cubli可以跳起来，瓦朗，甚至“走路”。这种新版本是对电源的自我，并使用三个略微改进的自行车制动器而不是先前版本中使用的金属屏障。我们目前正在开发学习算法，允许Cubli自动学习和调整必要的参数如果由于制动器的劣化和表面的惯性，重量或斜率的变化而导致的跳跃失败。\n  我们可以建立一个15cm面的多维数据集，可以跳起来，在它的角落上平衡，并使用现成的电机，电池和电子元件在办公桌上行走？\n 有多种方法可以保持立方体的平衡，但跳起来需要突然释放能量。直观的动力车轮似乎是一个好主意，在仍然保持立方体紧凑和独立的同时存放足够的能量。\n 此外，通过在加速或减速时，通过利用立方体上的反应扭矩来实现相同的动量车轮来实现用于平衡的反应扭矩的控制算法。\n    因此，创建机器人的第一步是查看物理学来弄清楚是否可以基于动量轮跳跃。下面的图像显示了一些数学数学来弄清楚轮子的惯性矩（MOI）和全古。\n  该数学分析允许对允许提供设计选择的系统的定量理解，例如使用三个动量车轮与安装在立方体的六个内面中的每个内面上的动量轮的设计的折衷方形。\n 这种分析的另一个结果是对允许立方体跳跃所需速度的良好理解，以及保持立方体平衡所需的扭矩。这两个因素对于下一步来说至关重要：确定所需的硬件规格。 \n规格和硬件设计给出了上面确定的所需速度和扭矩，很明显，动量轮的电机和变速箱将是创建机器人的主要挑战。使用数学模型通过允许对更高速度（即，跳跃的能量更多）和更高的扭矩之间的权衡（即，在平衡时更好的稳定性）来系统地分析该问题来系统地解决该问题。\n  这种数学驱动的硬件设计导致机器人核心硬件组件的详细规格（动量轮，电机，齿轮和电池），并允许整个系统的CAD设计。\n    这一步骤的一部分是设计特殊制动器突然停止动量轮将其能量转移到整个立方体并导致它跳起来。\n  左侧的照片显示了该制动器的早期设计，由安装在动量轮上的螺钉，伺服电机（以黑色表示），将金属板（蓝色）移动到螺钉的路径（浅棕色）中移动，和一个安装支架（浅棕色），将动量轮的能量转移到立方结构。目前的设计使用硬化金属部件和橡胶的组合来减少峰值力。\n   2D原型用于验证跳跃和平衡策略的力学和电子产品，并证明整体概念的可行性建立了一维版本：\n  使用该2D版本的立方体获得的结果在IROS 2012纸上发表。\n   在使用2D版本成功测试后，最终机器人建立了一个完整的机器人。结果是Cubli，一个小型的立方体机器人，以瑞士德语小的“立方体”命名。 \n然而，首先跳跃测试表明，由于动量轮的突然制动导致动量轮和铝框架的力变形导致的应力。这使整个Cubli的重复跳跃不可能没有部分替代。因此，决定调整结构和破碎机制，以降低由跳跃引起的机械应力。\n 除了平衡外，我的同事现在正在调查使用控制的演习，跳跃，平衡和摔倒，使Cubli穿过表面。\n    关键信息系统名称：Cubli研究人员：Mohanarajah Gajamohan，Raffaello D'Andrea Mechanical Design：Igor Thommen网站：http：//www.idsc.ethz.ch/research_dandrea/cubli，http：//raffaello.name/cubli状态：正在进行研究项目上次更新：2013年12月3月\n  注1：这篇文章是我们瑞士机器人系列的一部分。如果您想向本系列提交机器人，或者为另一个国家的系列，请在信息[@] robohub.org上。\n  注2：这项工作是在瑞士·苏黎世的动态系统和控制研究所完成，部分由瑞士国家科学基金会（SNSF）提供资金，授予146717号。\n 注3：如果您有疑问，请在下面发布，我们将发布答案。\n                马克斯威贝尔\r\rMarkus Waibel是Robohub的联合创始人和机器人播客的verity Studios AG的联合创始人和Coo。 ", "note_en": "This latest version of the Cubli can jumping up, balanc, and even “walk”. This new version is self contained with respect to power and uses three slightly modified bicycle brakes instead of the metal barriers used in the previous version. We are currently developing learning algorithms that allow the Cubli to automatically learn and adjust the necessary parameters if a jump fails due to the deterioration of the brakes and changes in inertia, weight, or slope of the surface.\n  Can we build a 15cm sided cube that can jump up, balance on its corner, and walk across our desk using off-the-shelf motors, batteries, and electronic components?\n There are multiple ways to keep a cube in its balance, but jumping up requires a sudden release of energy. Intuitively momentum wheels seemed like a good idea to store enough energy while still keeping the cube compact and self-contained.\n Furthermore, the same momentum wheels can be used to implement a reaction-torque based control algorithm for balancing by exploiting the reaction torques on the cube’s body when the wheels are accelerated or decelerated.\n    The first step in creating the robot, therefore, was to look at the physics to figure out if a jump-up based on momentum wheels was possible. The image below shows some of the math to figure out the Moment of Inertia (MOI) of the wheel and full cube.\n  This mathematical analysis allowed a quantitative understanding of the system which allowed to inform design choices, such as the trade offs of using three momentum wheels vs. a design with a momentum wheel mounted on each of the six inner faces of the cube.\n Another outcome of this analysis was a good understanding of the required velocities of the momentum wheel to allow the cube to jump up, and the torques required to keep the cube in balance. Both factors were critical for the next steps: Determining the required hardware specs.\n   Specs and hardware design Given the required velocities and torques determined above, it was clear that the momentum wheel’s motor and gearbox would be a major challenge for creating the robot. Using the mathematical model allowed to systematically tackle this problem by allowing a quantitative analysis of the trade-offs between higher velocities (i.e., more energy for jump-up) and higher torques (i.e., better stability when balancing).\n  This mathematics-driven hardware design resulted in detailed specs for the robot’s core hardware components (momentum wheels, motors, gears, and batteries) and allowed a CAD design of the entire system.\n    Part of this step was the design of a special brake to suddenly stop a momentum wheel to transfer its energy to the entire cube and cause it to jump up.\n  The photo to the left shows an early design of this brake, consisting of a screw mounted on the momentum wheel, a servo motor (shown in black) to move a metal plate (in blue) into the screw’s path (in light brown), and a mounting bracket (in light brown) to transfer the momentum wheel’s energy to the cube structure. The current design uses a combination of hardened metal parts and rubber to reduce peak forces.\n   2D prototype To validate the mechanics and electronics of the jump-up and balancing strategy and prove feasibility of the overall concept a one-dimensional version was built:\n  The results obtained with this 2D version of the cube were published in an  IROS 2012 paper.\n   The  final robot Following successful tests with the 2D version, a full robot was built. The result is Cubli, a small cube-shaped robot, named after the Swiss-German diminutive for “cube”.\n   However, first jump-up tests showed that the stress resulting from a sudden braking of the momentum wheel led to mechanical deformations of the momentum wheels and aluminium frame. This made repeated jump-ups of the whole Cubli impossible without part replacement. It was therefore decided to tweak the structure and breaking mechanism to reduce the mechanical stress caused by the jump-up.\n In addition to balancing, my colleagues are now investigating the use of controlled manoeuvres of jumping up, balancing, and falling over to make the Cubli walk across a surface.\n    Key infos Robot name: Cubli Researchers:  Mohanarajah Gajamohan,  Raffaello D’Andrea Mechanical design:  Igor Thommen Websites:  http://www.idsc.ethz.ch/Research_DAndrea/Cubli,  http://raffaello.name/cubli Status: Ongoing research project Last update:  March December 2013\n  Note 1: This post is part of our  Swiss Robots Series. If you’d like to submit a robot to this series, or to a series for another country, please get in touch at info[@]robohub.org.\n  Note 2: This work was done at the  Institute for Dynamic Systems and Control, ETH Zurich, Switzerland and was funded in part by the Swiss National Science Foundation (SNSF), grant number 146717.\n Note 3: If you have questions, post them below and we’ll post answers.\n                Markus Waibel  \r\rMarkus Waibel is a Co-Founder and COO of Verity Studios AG, Co-Founder of Robohub and the ROBOTS Podcast.", "posttime": "2021-06-20 18:55:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "桌面,cube,cubli", "title": "Cubli  - 可以跳起，平衡和穿过桌面的立方体 ", "title_en": "Cubli – A cube that can jump up, balance, and walk across your desk", "transed": 1, "url": "https://robohub.org/swiss-robots-cubli-a-cube-that-can-jump-up-balance-and-walk-across-your-desk/", "via": "", "real_tags": ["桌面", "cube", "cubli"]}]