[{"category": "", "categoryclass": "", "imagename": "6ae656c2877c113cfc42dba30c5b67c5.png", "infoid": 1069966, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1945 年 7 月 16 日凌晨 5 点 30 分，美国政府在新墨西哥沙漠上空引爆了一个钚动力内爆装置（绰号“小工具”），核时代开始了。在几分之一秒内，爆炸释放了相当于 21,000 吨 TNT 的物质——足以蒸发周围的基础设施并将沙漠沙子扫成一个热的、加压的火球，喷出三聚氰胺玻璃。由于石英和长石的成分，绝大多数玻璃呈淡绿色。但在该站点的一个区域，科学家们从测试站点被摧毁的 30 米高塔和数英里长的电线中恢复了不寻常的、血红色的三位一体样本，这些样本充满了金属。隐藏在其中一个样本深处的是一种更不寻常的东西——一种被称为准晶体的“禁止”物质——但在科学家们开始寻找它之前，已经过去了近八年。在今年早些时候发表在《美国国家科学院院刊》上的一篇论文中，其发现背后的研究人员估计，准晶体在 2700 华氏度以上的温度和 5000 至 8000 帕斯卡的压力下形成。对你和我来说，感觉就像躺在火山里，而有人背着成千上万头大象（大概是垂直堆叠的）站在你的背上。在新墨西哥州阿拉莫戈多的三位一体测试中产生的蘑菇云在爆炸后仅 9 秒显示，伸展超过 7 英里高。 （图片来源：Everett Collection/Shutterstock）“这是一组非常不寻常的材料形成条件，因此[核爆炸]会产生一些非常奇怪的东西，比如准晶体，这并不奇怪，”地球化学家科洛·博纳奇 (Chloë Bonamici) 说。威斯康星大学麦迪逊分校没有参与这项研究。最新的准晶体不仅是已知最古老的人造准晶体——时间戳和起源位置已经永久地刻在历史中——而且它也可能会改变核法医学领域。像 Bonamici 这样寻求了解过去原子武器部件的科学家通常必须分析放射性碎片或气体，但这些特征相对较快地衰减。然而，准晶体是它形成的核火球内部条件的永久物理指纹。 Bonamici 希望通过开发法医工具来阻止未来的恐怖行为，使她能够“从爆炸中获取材料，了解武器的特征并快速追踪 [谁负责]。”准晶体可以成为这样的工具。长期以来，人们认为晶体——如糖、盐或钻石——需要有规律地重复图案。对于二维示例，想象一个棋盘，每个角都有一个原子。与此同时，数学家和科学家都将准晶体的想法视为纯理论，因为它们的模式不会以可预测的方式重复。\n该论文的合著者、理论物理学家保罗·斯坦哈特 (Paul Steinhardt) 说：“通过考虑使用相同的瓷砖铺设浴室地板的问题，您可以了解为什么会这样。 “大概，你想使用中间没有空格的形状。”他说，要实现这一点，您需要一个瓷砖形状，当围绕单个点排列时，其角度等于 360 度。您有多种选择：六个等边三角形、四个正方形，如果您愿意，甚至可能是三个六边形。然而，用常规五边形平铺会带来麻烦。每个内角为 108 度，三个五边形留下一个间隙，四个开始重叠。数学家罗杰·彭罗斯 (Roger Penrose) 之前发现了二维的有序、非重复模式，称为彭罗斯平铺。他的图案由两种以不同速率重复的瓷砖组成。 （来源：microvictor/Shutterstock）晶体学的基本定律表明，五重对称（或八重、十重对称和十二重对称）不应该出于这个原因——除非涉及准晶体。通过适当的极端热量和压力混合物，任何剩余的间隙都将被其他原子形状填充，以产生让人联想到 3D 马赛克的准周期性图案。 1984 年，Steinhardt 的研究小组创造了术语“准晶体”（或“准周期晶体”），并论证了原子排列中五重对称性和更高对称性的假设存在。同年晚些时候，当以色列化学家丹尼尔·谢赫特曼（Daniel Shechtman）创造出一种具有相同图案的铝锰合金时，斯坦哈特开始怀疑准晶体是否存在于自然界中。他说，职业生涯的寻宝最终将他带到了佛罗伦萨自然历史博物馆的矿物学收藏品，并从那里——在已故宝石走私者的秘密日记的帮助下——到达了俄罗斯远东地区的一条小溪。在那里，他和同事 Luca Bindi 回收了形成于 45 亿年前的陨石内部的准晶体，其历史可以追溯到我们太阳系的开端。\nSteinhardt 说，该团队表明，形成过程的一个关键部分是小行星之间的高速撞击，导致高压冲击，并补充说，所有已知的准晶体以前都是在实验室中通过缓慢冷却元素的液体组合制造的。 “我们想象准晶体也可能在其他高压冲击碰撞下形成。为什么不是原子弹？” Trinity Site 国家地标历史遗址的游客，世界上第一颗原子弹于 1945 年在此引爆。该遗址目前每年向公众开放两次。 （图片来源：Aaron Rayburn/Shutterstock）今年早些时候从红色三元岩样品的凹槽中提取的准晶体是第一个包含铁、硅、铜和钙的组合。尽管自 1984 年以来已经发现了 100 多种准晶体，但 Steinhardt 说可能存在无数种可能性——每一种都有自己的弹性、电子和光子特性，这些特性与其原子的周期性排序相关。研究表明，这些材料比由相同元素制成的晶体更硬。它们在数学上越完美，导电性就越低。 Steinhardt 自己的研究小组致力于创造“光子准晶体”，它充当光的半导体并形成近乎完美的球对称带隙。该特征在电路设计中是可取的，并且可以用于未来的计算机和通信设备中。他说，随着科学家在实验室中激发更多元素组合或在偏远的原子爆炸地点发现它们，他们可能会偶然发现一种对各种应用都有用的准晶体。", "note_en": "The nuclear age began bright and early at 5:30 a.m. on July 16, 1945, when the United States government detonated a plutonium-powered implosion device (nicknamed “Gadget”) over the New Mexico desert. In a fraction of a second, the explosion released the equivalent of 21,000 tons of TNT — enough to vaporize the surrounding infrastructure and sweep desert sand into a hot, pressurized fireball that spit out trinitite glass.\n The vast majority of the glass was a pale green color, thanks to a composition of quartz and feldspar. But in one area of the site, scientists recovered unusual, blood-red trinitite samples imbued with metals from the test site’s obliterated 30-meter-tall tower and miles of wires. Hidden deep within one of these samples was something even more unusual — a &#39;forbidden&#39; type of matter known as a   quasicrystal  — but nearly eight decades came and went before scientists began searching for it.\n In a   paper  published in  Proceedings of the National Academy of the Sciences  earlier this year, the researchers behind its discovery estimate that the quasicrystal materialized in temperatures above 2700 degrees Fahrenheit and pressures of 5000 to 8000   pascals . To you and me, it would feel similar to lying inside a   volcano  while someone carrying thousands of elephants (presumably stacked vertically) stands on your back.\n The mushroom cloud produced by the Trinity test in Alamogordo, New Mexico, shown here just nine seconds after detonation, stretched over seven miles tall. (Credit: Everett Collection/Shutterstock)\n “It&#39;s a very unusual set of conditions in which materials form, and so it&#39;s not that surprising that [nuclear explosions] produce something really weird, like a quasicrystal,” says Chloë Bonamici, a geochemist at the University of Wisconsin–Madison who was not involved in the study. The newest quasicrystal is not only the oldest known human-made quasicrystal — with a timestamp and location of origin already permanently etched into history — but it will also likely transform the field of nuclear forensics.\n Scientists like Bonamici who seek to understand the components of past atomic weapons must typically analyze radioactive debris or gases, but those signatures decay comparatively quickly. A quasicrystal, however, is a permanent physical fingerprint of the conditions inside the nuclear fireball it formed within. Bonamici hopes to deter future terrorist acts by developing forensic tools that allow her to &#34;take the materials from the explosion, understand the signature of the weapon and quickly track down [whomever is responsible].&#34; Quasicrystals could become such a tool.\n  Crystals — such as sugar, salt or diamonds — were long thought to require a regularly repeating pattern. For a two-dimensional example, imagine a checkerboard with an atom positioned at every corner. Meanwhile, mathematicians and scientists alike dismissed the idea of quasicrystals as pure theory because their patterns don&#39;t repeat in a predictable way.\n “You can get a feeling why this is so by considering the problem of tiling your bathroom floor using identical tiles,” says theoretical physicist Paul Steinhardt, co-author of the paper. “Presumably, you want to use shapes that leave no spaces in between.”\n To accomplish this, he says, you need a tile shape whose angles equal a full 360 degrees when arranged   around a single point. You have a range of options: six equilateral triangles, four squares, or maybe even three hexagons if you’re feeling daring. Tiling with regular pentagons, however, will bring   trouble. With each interior angle measuring 108 degrees, three pentagons leave a gap and four begin to overlap.\n Mathematician Roger Penrose had previously discovered ordered, non-repetitive patterns in two dimensions, called Penrose tilings. His patterns consisted of two types of tile that repeated at different rates. (Credit: microvictor/Shutterstock)\n The fundamental laws of crystallography state that five-fold symmetry (or eight-, 10- and 12-fold symmetry for that matter) shouldn&#39;t work for this reason — except when it comes to quasicrystals. With the right cocktail of extreme heat and pressure, any remaining gaps will be filled by other atomic shapes to produce a quasiperiodic pattern that&#39;s   reminiscent of a three-dimensional mosaic.\n  In 1984, Steinhardt’s research group coined the term “quasicrystals” (or “quasiperiodic crystals”) and argued for the hypothetical existence of five-fold symmetry and higher symmetries in atomic arrangements. When Israeli chemist Daniel Shechtman created an   alloy  of aluminum and manganese with the very same pattern later that year, Steinhardt began to wonder whether quasicrystals occur in nature.\n A career-long treasure hunt eventually led him to the mineralogical collection at the Natural History Museum of Florence, and from there — with the help of a deceased gem smuggler&#39;s secret diaries — to a tiny stream in   far Eastern Russia , he says.\n There, he and colleague Luca Bindi recovered quasicrystals that formed inside a 4.5-billion-year-old   meteorite , dating back to the beginning of our solar system.\n The team showed that a key part of the formation process was a high-velocity impact between asteroids that led to high-pressure shocks, says Steinhardt, adding that all known quasicrystals had previously   been manufactured in laboratories by slowly cooling liquid combinations of elements. “We imagined that quasicrystals may also form under other high-pressure shock collisions. Why not an atomic blast?”\n Visitors at the Trinity Site National Landmark Historical Site, where the world’s first atomic bomb was detonated in 1945. The site is currently open to the public twice a year. (Credit: Aaron Rayburn/Shutterstock)\n The quasicrystal plucked earlier this year from the recesses of a red trinitite sample is the first to contain a combination of iron, silicon, copper and calcium. Although more than 100 types of quasicrystals have been discovered since 1984, Steinhardt says that an infinite number of possibilities may exist — each with their own elastic, electronic, and photonic properties tied to the periodic ordering of their atoms. Already, research has shown that these materials are harder than crystals made from the same elements. And the more mathematically perfect they are, the less electrically conductive.\n Steinhardt’s own research group has worked to create “photonic quasicrystals,” which act as semiconductors for light and form nearly perfect spherical symmetric band gaps. That feature is desirable in circuit designs and could be used in future computer and communication devices.\n As scientists whip up   more   elemental combinations in a lab or uncover them in remote atomic blast sites, they may stumble across a quasicrystal useful for all sorts of applications, he says.", "posttime": "2021-07-27 14:20:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "原子弹,bomb,晶体", "title": "第一颗原子弹创造了这种“被禁止的”准晶体", "title_en": "The First Atomic Bomb Created This ‘Forbidden’ Quasicrystal", "transed": 1, "url": "https://www.discovermagazine.com/the-sciences/the-first-atomic-bomb-created-this-forbidden-quasicrystal", "via": "", "real_tags": ["原子弹", "bomb", "晶体"]}, {"category": "", "categoryclass": "", "imagename": "bc177a70ca75d99cd73723b6fcfee620.jpg", "infoid": 1069964, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有兴趣从母公司戴尔获得新的预制件的 Alienware 粉丝可能不走运，具体取决于他们所处的状态。 正如几乎每个列表中所指出的那样，戴尔无法将其大部分 Alienware 选项运送到选定的州由于这些地区采用的电力消耗规定。受影响的州包括加利福尼亚州、科罗拉多州、夏威夷州、俄勒冈州、佛蒙特州和华盛顿州。只有两种 Alienware 配置似乎符合 CEC 功耗规定，可以运往所有州：Aurora Ryzen Edition R10 游戏台式机（AMD Ryzen 5 5600X 配备 AMD Radeon RX 5600）和 Aurora R12 游戏台式机（英特尔酷睿 i5-11400F，配备NVIDIA GeForce GTX 1650 超级）。这些型号的价格分别为 1,289.99 美元和 1,179.99 美元。由于加利福尼亚州、科罗拉多州、夏威夷州、俄勒冈州、佛蒙特州或华盛顿州采用的电力消耗法规，本产品无法运送到这些州。任何针对这些州的订单都将被取消。", "note_en": "Alienware fans who are interested in getting their hands on a new prebuilt from parent company Dell might be out of luck depending on the state they’re in. As noted in practically every listing, Dell cannot ship the majority of its Alienware options to select states due to power consumption regulations that have been adopted by those areas. The states that are affected include California, Colorado, Hawaii, Oregon, Vermont, and Washington. Only two Alienware configurations appear to comply with CEC power consumption regulations and can be shipped to all states: the Aurora Ryzen Edition R10 gaming desktop (AMD Ryzen 5 5600X with AMD Radeon RX 5600) and Aurora R12 gaming desktop (Intel Core i5-11400F with NVIDIA GeForce GTX 1650 SUPER). These models cost $1,289.99 and $1,179.99, respectively.\n  This product cannot be shipped to the states of California, Colorado, Hawaii, Oregon, Vermont or Washington due to power consumption regulations adopted by those states. Any orders placed that are bound for those states will be canceled.", "posttime": "2021-07-27 13:41:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,规定,ship,alienware", "title": "由于功耗规定，戴尔无法将大部分 Alienware 游戏 PC 运送到加利福尼亚州、科罗拉多州和其他州", "title_en": "Dell Can't Ship Majority of Alienware Gaming PCs to California, Colorado, and Other States Due to Power Consumption Regulations", "transed": 1, "url": "https://www.thefpsreview.com/2021/07/26/dell-cant-ship-majority-of-alienware-gaming-pcs-to-california-colorado-and-other-states-due-to-power-consumption-regulations/", "via": "", "real_tags": ["游戏", "规定", "ship", "alienware"]}, {"category": "", "categoryclass": "", "imagename": "e37a5e1982a693f90129a2722d2dc06c.jpg", "infoid": 1069963, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家总部位于班加罗尔的初创公司表示，淡马锡和摩尔战略风险投资公司领导了新一轮投资，而未来-Naver 亚洲增长基金参与了新一轮融资（F 系列）。 TechCrunch 本月早些时候报道称，已有 6 年历史的 ShareChat 正在谈判筹集约 28 亿美元的估值。迄今为止，ShareChat 已筹集了超过 9.11 亿美元。 “对 F 系列的额外投资是对我们市场领导地位的验证，也反映了投资者对我们执行能力的信任。我们为在过去 12 个月中通过 Moj 和 ShareChat 取得的成就感到无比自豪，”视频应用程序 Moj 和 ShareChat 的联合创始人兼首席执行官 Ankush Sachdeva 说。 “我们很幸运在我们的 F 系列中吸引了一批非常优质的名字，而且随着淡马锡、MSV 和 Mirae-Naver 与我们携手，名单变得更长。”在最近接受 TechCrunch 采访时，Sachdeva 表示，这家初创公司去年在新德里以网络安全问题为由禁止 TikTok 后不久推出的短视频应用 Moj 是公司内增长最快的产品，他预计有一天它会比 ShareChat 更大. ShareChat 声称拥有超过 1.6 亿用户，以 15 种印度语言提供其社交网络应用程序，并在印度小城镇拥有大量追随者，或者 Blume Ventures 的风险投资家 Sajith Pai 将其称为“印度 2”。印度创业生态系统中很少有参与者能够触及这一群体，这要归功于来自更小的城镇和村庄的用户——称为“印度 3”——近年来上网人数有所增加。另一方面，Moj 与少数玩家竞争，包括 Times Internet 的 MX TakaTak，以及 Glance 的 Roposo 和 DailyHunt 的 Josh——两者都在去年年底获得了谷歌的资助。据 TechCrunch 早些时候报道，这家搜索巨头也在去年年底就投资 ShareChat 进行谈判。\n“凭借每月 1.6 亿的活跃用户群和 50 多万强大的创作者社区，Moj 在一年内已​​成长为印度第一的短视频应用。为了加强我们的领导地位，我们将继续投资于我们的 AI 能力，扩展我们的全球 AI 组织，构建先进的编辑工具并帮助我们的创作者在平台上获利，”Sachdeva 说，并补充说，短视频应用程序的每次观看次数为 45 亿次一天，用户通常每天使用该应用程序的时间约为 34 分钟。 TechCrunch 早些时候还报道称，Twitter 已就收购 ShareChat 的多数股权并在全球扩展 Moj 应用程序进行了谈判。 “我们很高兴与 Moj 合作，因为他们建立了印度首屈一指的短视频平台，并且对这个管理团队抓住机会的速度和敏捷性印象深刻。 MSV 高级董事总经理兼首席运营官 James McIntyre 在一份声明中表示，这一轮将有助于加速这一增长，并使 Moj 和 ShareChat 能够继续为内容创作者和消费者等开发最佳生态系统。", "note_en": "Temasek and Moore Strategic Ventures led the new tranche of investment while Mirae-Naver Asia Growth fund participated in the new financing round (Series F), the Bangalore-based startup said. TechCrunch  reported earlier this month that six-year-old ShareChat was in talks to raise at around $2.8 billion valuation. ShareChat has now raised over $911 million to date.\n “This additional investment for Series F is a validation of our market leadership and a reflection of investor trust in our execution capabilities. We are immensely proud of what we have been able to achieve with Moj and ShareChat in the last 12 months,” said Ankush Sachdeva, co-founder and chief executive of video app Moj and ShareChat.\n  “We have been very fortunate to attract a bunch of very high quality names in our series F and the list just got longer with Temasek, MSV and Mirae-Naver joining hands with us.”\n In a recent interview with TechCrunch, Sachdeva said the short video app Moj, which the startup launched last year shortly after New Delhi banned TikTok citing cybersecurity concerns, is the fastest growing product within the firm and he expects it to be bigger that ShareChat one day.\n ShareChat, which claims to have more than 160 million users, offers its social network app in 15 Indian languages and has a large following in small Indian cities and towns, or what venture capitalist Sajith Pai of Blume Ventures refers to as “India 2.”\n Very few players in the Indian startup ecosystem have a reach to this segment of this population, which thanks to users from even smaller towns and villages — called “India 3” — getting online has expanded in recent years.\n Moj, on the other hand, competes with a handful of players, including Times Internet’s MX TakaTak, as well as Glance’s Roposo and DailyHunt’s Josh — both of which  received funding from Google late last year. The search giant was also in talks to invest in ShareChat late last year, TechCrunch reported earlier.\n “With a monthly active user base of 160 million and 50+ million strong creator community, Moj in a year has grown into India’s number one short video app. To strengthen our leadership position, we will continue to invest in our AI capabilities, scaling our global AI org, building advanced editing tools and helping our creators monetize on the platform,” said Sachdeva, adding that the short video app clocks 4.5 billion views each day and a user typically spends about 34 minutes with the app daily.\n TechCrunch also reported earlier that Twitter had  held talks to acquire majority stakes in ShareChat and expand the Moj app globally.\n “We are excited to partner with Moj as they build India’s premier short form video platform, and have been impressed by this management team’s speed and agility in capturing the opportunity. This round will help to accelerate that growth and allow Moj and ShareChat to continue to develop the best ecosystem for content creators and consumers alike,” said James McIntyre, Senior Managing Director and COO at MSV, in a statement.", "posttime": "2021-07-27 13:41:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "印度,sharechat", "title": "印度的 ShareChat 在 1.45 亿美元的融资中价值 28.8 亿美元", "title_en": "\n\t\t\t\tIndia’s ShareChat valued at $2.88 billion in $145 million fundraise\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/26/india-sharechat-valued-at-3-billion-in-145-million-fundraise/", "via": "", "real_tags": ["印度", "sharechat"]}, {"category": "", "categoryclass": "", "imagename": "2d2855bf4be123781dc36beb246360fc.png", "infoid": 1069962, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "附近的 Lime 车辆将出现在 Moovit 的 20 个国家/地区的 117 个城市，包括美国、南非、澳大利亚和整个欧洲。 Lime 表示，根据涉及的城市数量，这种合作关系是迄今为止最大的应用程序中的微型移动集成，完全致力于移动即服务 (MaaS)。它计划在接下来的几个月内增加 40 个其他城市。 Lime 与 Moovit（英特尔 Mobileye 的子公司）之间的合作顺应了交通领域的趋势，即将公共交通、拼车和微型移动集成到一个优化系统中。优步是 Lime 的主要投资者之一，今年发布了一份白皮书，列出了促进这种移动模式集中化的计划。一些公共交通机构，如 St. Louis Metro Transit，经历了载客量下降的情况，希望将用户引导到提供不同移动形式的第三方应用程序最终将其带回。其他人可能只是将联合视为让通勤者摆脱汽车的一种方式，为他们提供从家到火车站最后一英里的无缝选择，而不会造成碳排放。 Moovit 联合创始人兼首席执行官 Nir ​​Erez 在一份声明中表示：“这种伙伴关系表明，出行公司认识到需要共同合作，为骑手返回时提供更便捷的公共和共享交通方式。” “提供更多可以轻松让人们到达目的地的替代选择是 MaaS 平台的关键组成部分，尤其是在世界上一些最拥挤的城市。” Lime 正在与城市打交道，毫无疑问，这将为这家微型交通巨头带来更多的许可证奖励。大流行已导致许多城市接受微型交通，并起草了强调可持续交通的恢复计划。 “Moovit 抓住了一个专门专注于规划通勤和本地旅行的市场，帮助用户在这些旅程中使用微出行，有望减少汽车出行，并进一步鼓励人们再次乘坐公共交通工具，”Lime 企业传播高级经理蒂法尼吉布森，告诉 TechCrunch。 “我们希望城市将我们视为与更广泛的交通生态系统协同工作的可持续合作伙伴。我们提供一种附加服务，可以简化和鼓励交通连接，尤其是在传统服务不足的地区。我们希望乘客在使用我们的服务的同时返回公共交通，并希望取代汽车旅行，而不是公共交通旅行。”根据 Moovit 的 COVID-19 移动性报告，公共交通在纽约、巴黎和伦敦等大城市重新兴起，这可能就是 Lime 现在想要进入市场的原因。根据该公司的数据，上个月，Lime 41% 的踏板车骑行是在高峰通勤时间进行的，该公司还表示，历史数据显示，大量的 Lime 骑行将乘客与公共交通连接起来。 Lime 还与谷歌地图集成，谷歌地图是世界上下载量最大的 MaaS 应用程序之一，但它没有说明 Lime 的车辆与该应用程序集成的城市数量。在谷歌地图上，用户可以选择通过汽车、公共交通、步行或骑自行车来路线他们的目的地。骑自行车的人可以选择 Lime 的车辆作为整个旅程的交通工具，而 Moovit 的重点是将 Lime 车辆用于公共交通的第一英里或最后一英里解决方案。\n借助谷歌地图和 Moovit，用户可以实时查看 Lime 车辆在附近的位置、步行到那里需要多长时间、估计的行程费用和剩余电池百分比。要解锁旅程，用户将在单击徽标后重定向到 Lime 应用程序。", "note_en": "Nearby Lime vehicles will show up in Moovit in 117 cities across 20 countries, including the United States, South Africa, Australia and throughout Europe. Lime says this partnership is the largest micromobility integration within an app fully dedicated to mobility as a service (MaaS) to date based on the number of cities involved. It plans to add 40 other cities in the following months.\n The partnership between Lime and Moovit, which is a subsidiary of  Intel’s Mobileye, follows a trend in the transportation world that integrates public transit, ridesharing and micromobility into one optimized system.  Uber, one of Lime’s lead investors, delivered a  whitepaper this year laying out its plans to facilitate such a centralization of mobility modes. Some public transit agencies, like  St. Louis Metro Transit, that have experienced a decline in ridership hope directing users to third-party apps that lay out different forms of mobility would eventually bring it back. Others might just see joining forces as a way to get commuters out of cars, giving them seamless options for traveling that last mile from home to the train station without contributing to carbon emissions.\n  “This partnership signifies that mobility companies recognize the need to collaborate together to offer riders more convenient modes of public and shared transportation as they return,” Nir Erez, Moovit co-founder and CEO, said in a statement. “Offering more alternative options that can easily get people to their destinations is a critical component of a MaaS platform, especially in some of the most congested cities in the world.”\n Lime is touching on a moment with cities, no doubt in a way that will lead to more permit awards for the micromobility giant. The pandemic has caused many cities to embrace micromobility and draft recovery plans that highlight sustainable mobility.\n “Moovit captures a market specifically focused on planning commutes and local travel, and helping users access micromobility as part of those journeys will hopefully reduce car travel and further encourage people to take public transit again,” Tiffani Gibson, senior manager of Lime’s corporate communications, told TechCrunch. “We want cities to view us as a sustainable partner that works in tandem with the broader transit ecosystem. We provide an additive service that eases and encourages connections to transit, especially in traditionally underserved areas. We want riders to return to transit in conjunction with our service and are looking to replace car trips, not transit trips.”\n According to Moovit’s  COVID-19 mobility report, public transit is back on the rise in big cities like New York, Paris and London, which is probably why Lime wants to tap into the market now. Last month, 41% of Lime’s scooter rides were taken during peak commuting hours, according to data from the company, which also says historical data has shown a significant amount of Lime rides connecting riders with public transit.\n Lime is also integrated with Google Maps, one of the most downloaded MaaS apps in the world, but it wouldn’t say in how many cities Lime’s vehicles are integrated with the app. On Google Maps, users can choose to route their destination via car, public transit, walking or bike. Bikers are offered Lime’s vehicles as a transport option for the whole journey, whereas with Moovit, the point is to feature Lime vehicles for first- or last-mile solutions to mass transit.\n With both Google Maps and Moovit, users can see in real-time where a Lime vehicle is nearby, how long it’ll take to walk there, an estimated trip cost and remaining battery percentage. To unlock the journey, users will be redirected to the Lime app after clicking on the logo.", "posttime": "2021-07-27 13:40:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,滑板车,integrates,lime", "title": "Moovit 将 Lime 电动滑板车、自行车、轻便摩托车集成到交通规划应用程序中", "title_en": "\n\t\t\t\tMoovit integrates Lime electric scooters, bikes, mopeds into transit planning app\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/26/moovit-integrates-lime-electric-scooters-bikes-mopeds-into-transit-planning-app/", "via": "", "real_tags": ["程序", "滑板车", "lime"]}, {"category": "", "categoryclass": "", "imagename": "37129e531c18b3953817aa4e4eb6b121.jpg", "infoid": 1069961, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家总部位于纽约和特拉维夫的初创公司已经筹集了 1 亿美元，这笔资金将用于继续开发其工具并继续扩大其客户群。迄今为止，ActiveFence 表示其客户包括社交媒体、音频和视频流、文件共享、游戏、市场和其他技术领域的公司——它尚未透露任何具体名称，但表示其工具共同覆盖“数十亿”用户。政府和品牌是它继续扩张的另外两个目标类别。它自 2018 年以来一直存在，并且每年以 100% 左右的速度增长。今天宣布的 1 亿美元实际上包括两轮：由 CRV 和 Highland Europe 领投的最新 B 轮融资，以及由 Grove Ventures 和 Norwest Venture Partners 领投的从未宣布过的 A 轮融资。 Vintage Investment Partners、Resolute Ventures 和其他未具名的支持者也参与其中。它没有披露估值，但我知道它在 3 亿至 4 亿美元之间。 （如果我们了解更多信息，我会更新这一点。）社交媒体和其他平台上在线聊天的增加使人们强烈关注不良行为者如何利用这些论坛来传播恶意内容。 ActiveFence 的特殊方法是一组利用人工智能（自然语言处理）创新并映射对话之间关系的算法。它会抓取互联网上所有明显的、不太明显的和难以触及的部分，以获取通常是许多恶意内容和活动诞生的地方——总共约 300 万个来源——然后再成为话题。更高调的问题。它既建立在大数据分析的概念上，也建立在理解在线内容的长尾如果能被有效利用就具有价值的基础上。 “我们对信任、安全和内容审核采取了完全不同的方法，”联合创始人兼首席执行官诺姆施瓦茨在接受采访时说。 “我们正在主动搜索网络的最黑暗角落并寻找不良行为者，以了解恶意内容的来源。然后我们的客户就会知道会发生什么。他们不需要等待损害，或等待内部研究团队确定下一个骗局或虚假宣传活动。我们与世界上一些最重要的公司合作，但即使是微小的超级利基平台也存在风险。” ActiveFence 收集到的见解然后被打包到一个 API 中，然后客户可以将其输入到他们用来跟踪或减轻他们自己平台上的流量的任何其他系统中。 ActiveFence 并不是唯一一家构建技术以帮助平台运营商、政府和品牌更好地了解更广泛的在线世界正在发生的事情的公司。 Factmata 构建了算法来更好地理解和跟踪在线情绪； Primer（最近也筹集了大笔资金）还使用 NLP 帮助其客户跟踪在线信息，其客户包括在竞选期间使用其技术跟踪错误信息的政府组织； Bolster（以前称为 RedMarlin）是另一个。一些较大的平台也更加积极地将跟踪技术和人才引入内部：Facebook 几年前为此收购了 Bloomsbury AI； Twitter 已经收购了 Fabula（并且正在致力于像 Birdwatch 这样更大的努力来构建更好的工具），今年早些时候 Discord 收购了另一个在线滥用跟踪器 Sentropy。在某些情况下，经常相互竞争眼球和金钱的公司甚至会联合起来共同努力。\n事实上，很可能最终会存在多种努力和多家公司在这一领域做得很好，这与安全世界的其他角落一样，可能需要不止一把锤子来解决问题。在这种特殊情况下，该初创公司迄今为止的发展及其在识别早期预警信号方面的有效性，是投资者对 ActiveFence 感兴趣的原因之一。 “我们很高兴在这一重要任务中支持 ActiveFence”，CRV 的主要投资者 Izhar Armony 在一份声明中评论道。 “我们相信他们已经为下一阶段的增长做好了准备，他们可以在充满活力和快速增长的信任和安全市场中保持领先地位。” “ActiveFence 已成为发展中的在线信任和安全类别的明显领导者。 Norwest Venture Partners 的普通合伙人 Dror Nahumi 在一份声明中表示，这一轮将帮助公司加快我们在过去几年中见证的增长势头。", "note_en": "The startup, co-headquartered in New York and Tel Aviv, has raised $100 million, funding that it will use to continue developing its tools and to continue expanding its customer base. To date, ActiveFence says that its customers include companies in social media, audio and video streaming, file sharing, gaming, marketplaces and other technologies — it has yet to disclose any specific names but says that its tools collectively cover “billions” of users. Governments and brands are two other categories that it is targeting as it continues to expand. It has been around since 2018 and is growing at around 100% annually.\n The $100 million being announced today actually covers two rounds: its most recent Series B led by CRV and Highland Europe, as well as a Series A it never announced led by Grove Ventures and Norwest Venture Partners. Vintage Investment Partners, Resolute Ventures and other unnamed backers also participated. It’s not disclosing valuation but I understand it’s between $300 million and $400 million. (I’ll update this if we learn more.)\n  The increase presence of social media and online chatter on other platforms has put a strong spotlight on how those forums are used by bad actors to spread malicious content. ActiveFence’s particular approach is a set of algorithms that tap into innovations in AI (natural language processing) and to map relationships between conversations. It crawls all of the obvious, and less obvious and harder-to-reach parts of the internet to pick up on chatter that is typically where a lot of the malicious content and campaigns are born — some 3 million sources in all — before they become higher-profile issues.  It’s built both on the concept of big data analytics as well as understanding that the long tail of content online has a value if it can be tapped effectively.\n “We take a fundamentally different approach to trust, safety and content moderation,” Noam Schwartz, the co-founder and CEO, said in an interview. “We are proactively searching the darkest corners of the web and looking for bad actors in order to understand the sources of malicious content. Our customers then know what’s coming. They don’t need to wait for the damage, or for internal research teams to identify the next scam or disinformation campaign. We work with some of the most important companies in the world, but even tiny, super niche platforms have risks.”\n The insights that ActiveFence gathers are then packaged up in an API that its customers can then feed into whatever other systems they use to track or mitigate traffic on their own platforms.\n ActiveFence is not the only company building technology to help platform operators, governments and brands to have a better picture of what is going on in the wider online world.  Factmata has built algorithms to better understand and track sentiments online;  Primer (which also recently raised a big round) also uses NLP to help its customers track online information, with its customers including government organizations that used its technology to track misinformation during election campaigns;  Bolster (formerly called RedMarlin) is another.\n Some of the bigger platforms have also gotten more proactive in bringing tracking technology and talent in-house:  Facebook acquired Bloomsbury AI several years ago for this purpose;  Twitter has acquired Fabula (and is working on a bigger efforts like  Birdwatch to build better tools), and earlier this year  Discord picked up Sentropy, another online abuse tracker. In some cases, companies that more regularly compete against each other for eyeballs and dollars are  even teaming up to collaborate on efforts.\n Indeed, may well be that ultimately there will exist multiple efforts and multiple companies doing good work in this area, not unlike other corners of the world of security, which might need more than one hammer thrown at problems to crack them. In this particular case, the growth of the startup to date, and its effectiveness in identifying early warning signs, is one reason why investors have been interested in ActiveFence.\n “We are pleased to support ActiveFence in this important mission” commented Izhar Armony, the lead investor from CRV, in a statement. “We believe they are ready for the next phase of growth and that they can maintain leadership in the dynamic and fast growing trust and safety market.”\n “ActiveFence has emerged as a clear leader in the developing online trust and safety category. This round will help the company to accelerate the growth momentum we witnessed in the past few years,” said Dror Nahumi, general partner at Norwest Venture Partners, in a statement.", "posttime": "2021-07-27 13:40:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "走出,tech", "title": "ActiveFence 凭借 1 亿美元的资金和检测网络危害的技术走出了阴影", "title_en": "\n\t\t\t\tActiveFence comes out of the shadows with $100M in funding and tech that detects online harm\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/26/activefence-comes-out-of-the-shadows-with-100m-in-funding-and-tech-that-detects-online-harm/", "via": "", "real_tags": ["走出", "tech"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069960, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天我们谈论的是ALF。对于 Nicole Express 来说，这是一个令人惊讶的举动；我们不容忍猫吃。但最终阿尔夫也没有。无论如何，我们不是在这里谈论电视节目（我从未见过）或 pogs；我们在这里讨论世嘉主系统的 ALF。按要求！这篇文章是献给我的好朋友 Near 的，他是 Higan 模拟器的作者，我的好朋友，以及教我在这篇文章中使用的调试技术的人，他在一个月前不幸去世了。你应该得到比 ALF 帖子更好的致敬。安息。世嘉大师系统的 ALF 于 1989 年发布，主角是毛茸茸的外星人，试图修理他的太空船。这是一个几乎不错的平台冒险游戏，但是哇，这很难，而且并不总是很好。该游戏具有与 Micronics 相同的“jank”（尽管它实际上是由总部位于旧金山的 Nexa 公司开发的，最终被 Spectrum Holobyte 收购），具有闪烁的字符和笨拙的碰撞检测。这是一个耻辱，因为一个雄心勃勃的头衔；几乎让我想起了ET。无论如何，我们不是在这里谈论世嘉主系统上的 ALF 有多好。我相信一些 80 年代的孩子玩得很开心，这是一个我可以尊重的奇怪头衔。它也是为数不多的仅在北美发行的 Master System 游戏之一。我猜欧洲人就是不喜欢阿尔夫？所以我完全满足于过我的生活而不关心世嘉主系统的 ALF。不过，龚贤在推特上告诉我一个有趣的错误。然后RetroRGB的Bob和天风一起直播，这个问题又出现了，现在我正在写一篇关于ALF的文章。所以我想在这里链接到我的主系统概述，但这还没有完成。所以是时候进入快速模式了。 Sega Mark III 在美国、欧洲和最终在日本被称为 Master System，它的名字来自 Sega SG-1000 控制台的第三次修订。 SG-1000 从未出现在此博客上，但其计算机版本 SC-3000 出现过。\nMark III 与 SG-1000 相比的主要特点在于其图形芯片。 SG-1000 使用 TMS9918A，这是 TI 于 1979 年为其 TI-99/4A 计算机开发的通用芯片，并被 MSX 标准和 ColecoVision 等机器使用。 Mark III 的图形处理器，被称为 VDP（视频显示处理器），看起来不像其他任何东西，它以它为核心，并在它之上构建了一个新系统。所以我不了解您，但这告诉我的是，TMS9918A 在 1979 年的功能非常强大。32 个同时出现的精灵也不容小觑，即使它们是一种颜色并且每个扫描线有 4 个限制。 （但请注意，TI-99/4 和 TI-99/4A 必须与 BASIC 程序之类的东西共享 16kiB 的视频 RAM）这种 TMS9918A 传统还带来了一项功能，该功能一度与硬件精灵同义，但在 1980 年代会变得越来越不常见：硬件碰撞检测。视频游戏中的碰撞检测可能是一个非常复杂的话题，尤其是在资源有限的控制台上。例如，想象一下玩家与敌人的碰撞。我的旧 Javascript 游戏 Aspect Legend 将每个人都视为圆圈；如果你的点在另一个圆的半径内，你就会死。但是，这在 8 位控制台上稍微复杂一些，在那里您无法访问 Math.pow 或现代 CPU 来每 1/60 秒运行一次这些计算。 （或者，在 Aspect Legend 的情况下，每 1/120 秒一次。）所以 Aspect Star “N”采用不同的方法，使用重叠框。 Space Ava 201 是基于网格的，这是一种完全不同的解决问题的方法。 （注意：当我链接到我的代码时，只是因为那是我最熟悉的代码，而不是暗示它是最好的方法）但是请注意，所有这些方法都没有将精灵与碰撞。例如，看看上面。鼠标下方的红框代表碰撞区域；请注意，它包括空白像素，但不包括鼠标的一些脚和身体。与此同时，玩家只是被视为一个点。这在 Aspect Star “N” 中并不是什么大问题，但是如果精灵和碰撞盒变得过于分散，游戏很快就会变得无法玩。硬件冲突检测解决了这个问题，解决了不得不浪费 CPU 周期的问题，只需让视频处理器来做。例如，Atari 8 位系统，包括 2600 和计算机，可以做到这一点。\n视频处理器负责绘制精灵，可能使用行缓冲区之类的东西。因此，它需要做的就是当它意识到它在某处绘制一个精灵时设置一个标志。 TMS9918A 正是如此。因此硬件碰撞检测是完美的。它只会在两个精灵实际重叠时报告，而不是在框重叠时报告。非常完美，当精灵“闪烁”时，硬件碰撞检测不会在精灵不可见时记录碰撞；这就是著名的冒险复活节彩蛋成为可能的原因。但是对于 TI 来说，存在一个问题。 TMS9918A 有 32 个精灵。每个都可以与其他 31 个精灵发生碰撞。因此，您不会只需要一个标志：您需要 992。请记住，8 位家用控制台和计算机设计中的几乎所有内容都归结为一个简单的短语：内存很贵。因此，TMS9918A 只是有一个碰撞标志。一旦他们看到这个标志被设置，程序有两个选项：“Race the beam”，在屏幕被绘制时不断检查碰撞标志并检测它何时发生。这比每帧运行一个软件例程需要更多的 CPU 时间。主系统从 TMS9918A 继承了这种单比特硬件冲突检测。这使它有点独特；任天堂娱乐系统，据我所知，雅达利 7800 都避开了这一功能。而主系统上的绝大多数游戏都没有使用它；如果您无论如何都必须进行软件碰撞检测，为什么还要麻烦呢？ ALF 的首席程序员凯文·塞盖蒂 (Kevin Seghetti) 只参与了他的第二款主机游戏，而他的第一款游戏是《大富翁》，这并不完全是一款动作游戏。另外，我的意思是，它是世嘉主系统的 ALF。我认为你没有带来 A 级游戏是可以原谅的。\n在这里，您可以看到 Alf 被蝙蝠击伤了。不幸的是，阿尔夫非常脆弱，当场死亡。但有些奇怪。阿尔夫在他的精灵和敌人之间没有任何重叠的情况下死去。在大多数游戏中，你只会说碰撞很糟糕。但我只是说硬件碰撞检测是完美的。我们可以通过打开模拟器的源代码，然后在禁用硬件碰撞检测的情况下构建它来确认它应该如何工作。例如，您可以在此处在 Higan 模拟器中执行此操作。没有真正的理由走那么远，但如果你这样做了，你会发现阿尔夫不会死。但是，这个错误有一个有趣的组成部分：我使用 Power Base 转换器在 Genesis 1 上截取了该屏幕截图。这是我拍摄 Master System 屏幕截图的首选方式，因为它具有良好的视频质量。但是，我也有一个日语大师系统。由于日本主系统输出的一些特殊性（据我所知，它的同步处于不同的电压水平），我没有高质量的电缆，而是使用廉价的 SCART 电缆来同步复合视频和给出了一个较暗的图片，带有微弱的 jailbar。所以，日本的Master System 和Mark III 一样的VDP 和初跑的美国Master System；它唯一突出的特点是它使用了 FM 声音。因此，虽然我还没有美国主系统（还），但我认为可以安全地假设它们在这方面是等效的。 Sega Genesis 向后兼容 Master System。但是，它不向后兼容 SG-1000。所有这些 TMS9918A 模式都不可用。这没什么大不了的。西方发行的唯一真正使用 SG-1000 模式的 Master System 游戏是 F-16 Fighting Falcon。 F-16 Fighting Falcon 通常被描述为“基本上是 SG-1000 游戏”，但这并不准确！即使您绕过使用主系统图形模式的标题屏幕，游戏也不会在 SG-1000 上运行（或者至少不会在 SC-3000 上运行）。这是因为它使用了主系统拥有的所有 8kiB RAM。 （相比之下，SG-1000 只有 1kiB 和 SC-3000 2kiB 内置）\nF-16 Fighting Falcon其实和ALF有点关系。虽然开发者不是同一个人（事实上，Mobygames 声称 Master System 版本是由著名的世嘉开发商 Yuji Naka 开发的），但这两款游戏都是由 Nexa 开发的。只要确保在真正的主系统上玩你的 Nexa 游戏，显然他们对 Power Base Converter 有一些反对。这基本上意味着世嘉创世纪缺少一些遗留功能。因此，您可能会假设精灵碰撞是这些遗留功能之一；事实上，我注意到如果我修改模拟器以始终检测到硬件碰撞，对象的碰撞箱会更大，这表明软件例程有点马虎。你实际上并不需要一个修改过的模拟器，或者事实上，按下一个按钮来显示 ALF 的软件碰撞检测是多么草率。这是一个让演示运行的未经修改的模拟器。这是最后一帧，在 Alf 和鱼枪潜水员之间检测到碰撞。为什么？左上角注意；一个精灵（鲶鱼）正在与氧吧发生碰撞。由于这是演示，没有播放死亡动画；相反，它会重置回标题屏幕。不！我使用一些Space Ava 201图形制作了一个简单的测试程序，并确认了Master System模式下的Sega Genesis确实支持硬件碰撞。在这种情况下，我只是更改了背景颜色。这实际上是有道理的；这一传统功能也成功地进入了 Mega Drive 模式。 Hugues Johnson 写了一篇描述它的文章，但在测试时要小心，因为即使是 Higan 模拟器也不会为 Mega Drive 游戏实现它。似乎没有商业游戏使用它，而且很容易理解为什么。因此，如果碰撞检测有效，则必须检测到碰撞。让我们来看看犯罪的两个框架。首先是大师系统游戏，阿尔夫不会死。其次，游戏运行在Genesis上，他做的框架。我试图尽可能地匹配它们。有什么不同？屏幕左侧有一只蝙蝠正在生成。我们如何判断蝙蝠在产卵时是否意外造成了碰撞？\n跟踪记录器在理论上非常简单。仿真器不断地运行一条又一条指令。在像世嘉主系统这样的系统上，用一个 CPU 控制一切，游戏状态可以在每条指令后记录下来。这可以让您逐步通过状态。在实践中，有一个问题，就是指令很多。 Sega Master System CPU 时钟运行在 3.5MHz。考虑到它有 8kiB 的 RAM 和 16kiB 的 VRAM，记录所有内容的恒定状态将占用大量磁盘空间。因此，相反，每条指令都只有这样一行：这可能看起来令人生畏！但也不算太糟。首先是正在读取的地址。然后，在那个地址有指令。 AF、BC、DE、HL、IX、IY、SP、IFF 和 IM 是 Z80 处理器内部寄存器的状态。那么，为什么我选择了位 5,a 指令？这是因为我正在寻找碰撞检测的检查。如果我们查看 SMS Power 的 Master System VDP 文档，我们会看到它是从控制端口读取时的第五位。因此，将使用检查 a 字节内的位的位指令的想法只是一个有根据的猜测。我们如何确认这是正确的地方？让我们通过查看此指令之前的指令来了解 a 的来源。所以 a 来自地址 $c009。这是在 Sega Master System 的 RAM 空间中。我们继续向后工作；最后一个触及 $c009 的代码在哪里？简单的向后搜索会告诉我们。 0074 a,($bf) AF:1010 BC:0006 DE:cfac HL:cfb9 IX:ba18 IY:c02d SP:dfec IFF:00 IM:10076 ld ($c009),a AF:8010 BC:0006 DE: cfac HL:cfb9 IX:ba18 IY:c02d SP:dfec IFF:00 IM:1\na,($bf) 使用主系统的 IO 端口；这些是 Z80 的一个方便的特性，与我更熟悉的基于 6502 的系统不同，您不需要让 IO 伪装成 RAM 并占用可用内存映射中的空间。而上面的 SMS Power 文章指出，$3f 正是 VDP 寄存器的来源。所以跟踪的一个大问题是即使很短的时间也会产生大量的指令。我去了有问题的洞穴，跑了足够长的时间让一只蝙蝠产卵，小心不要看到两个物体发生碰撞。这只是几秒钟；创建的日志是 70MB。这就是为什么我们需要能够知道要查找的内容。在这种情况下，我可以查看第 0097 行的第 5 位，然后查看接下来的几行，看看它对检查做了什么。 0097 bit 5,a AF:8053 BC:00be DE:7f80 HL:d135 IX:ba18 IY:c02d SP:dfec IFF:00 IM:10099 call nz,$377e AF:8055 BC:00be DE:7f135 IX HL: :ba18 IY:c02d SP:dfec IFF:00 IM:1009c call $083c AF:8055 BC:00be DE:7f80 HL:d135 IX:ba18 IY:c02d SP:dfec IFF:00 IM:1 call nz,$377e仅当清除零标志时才以 $377e 调用例程，这通常意味着前一条指令具有非零结果。因此，只有在检测到碰撞时才会进行跳转。由于下一行是 $009c 处的指令，我们可以意识到分支没有被采用。由于我的跟踪没有可见的对象碰撞，您会期望它不会出现采用该分支的情况。但事实并非如此。稍后，我们看到：0097 bit 5,a AF:e053 BC:00be DE:7f80 HL:d135 IX:85ed IY:c02d SP:dfec IFF:00 IM:10099 call nz,$377e AF:e031 BC:00be DE:7f80 HL:d135 IX:85ed IY:c02d SP:dfec IFF:00 IM:1377e ld a,($c254) AF:e031 BC:00be DE:7f80 HL:d135 IX:85ed IY:c02d SP:dfea :00 即时消息:1\n所以碰撞确实发生了！只有两帧（这段代码每帧运行一次；我能够将它追溯到帧中断处理程序，所以每 60Hz 一次）。您希望真正的碰撞持续超过两帧。 （当然，我通过更多的日志记录证实了这一点）这是一个更难回答的问题。我要说的是，ALF 非常注重时间。它总是在主线程上运行代码，而中断运行。事实上，我尝试使用 SMS 检查来通读代码，虽然它没有完全工作（遗憾的是它无法捕获主要的游戏逻辑，但它确实用它的位 5,a 捕获了我们的中断处理程序） ，它确实表明游戏仅在日本系统上经历了长时间的延迟循环。鉴于这款游戏甚至还没有在美国以外地区发布，人们不得不怀疑这一点，但这绝对意味着时机至关重要。如果您使用像 MEKA 这样的模拟器，您可以在 PAL 和 NTSC 计时之间切换，这比 Genesis 和 Master System 之间的差异要大得多。并且介绍演示的敌人位置差异很大！考虑上面的海底截图；在主系统上，阿尔夫被长矛手杀死。在这里，阿尔夫被长矛杀死，而不是被长矛手杀死。 （另外，猫还没有与物体发生碰撞。）我没有 PAL 主系统来检查这个。当然，在现实世界中，ALF 只在美国发行。有故障的视频游戏一点也不奇怪。但是看到即使是相对细微的差异也能被注意到，以及事件链是如何有趣的。经历了这一切之后，很难责怪 Nexa 的任何人没有注意到这一点。我的意思是，Genesis 甚至还没有在美国推出，更不用说 Power Base Converter。另外，我的意思是，它是 ALF。为什么我花了这么长时间？", "note_en": "Today we’re talking about ALF. It’s a surprising move for  Nicole Express; we do not condone cat-eating. But neither did Alf, eventually. In any case, we’re not here to talk about the television show (which I’ve never seen) or the pogs; we’re here to talk about  ALF for the Sega Master System. By request!\n This post is dedicated to the memory of my good friend Near, author of the Higan emulator, a good friend of mine, and the person who taught me debugging techniques I used in this post, who sadly passed away a month ago. You deserve a better tribute than an ALF  post. Rest in peace.\n  ALF for the Sega Master System, released in 1989, stars the furry alien on a quest to fix his space ship. It’s a platformer-adventure that would almost be good, but wow, it’s pretty hard, and not always in a good way. The game has that same “jank” people attribute to  Micronics (though it was actually developed by Nexa, a San Francisco-based company eventually bought by Spectrum Holobyte), with flickery characters and awkward collision detection. Which is a shame because an ambitious title; almost reminds me of  E.T. in that way.\n  In any case, we’re not here to talk about how great or not  ALF on the Sega Master System is. I’m sure some 80’s kids had a fun time with it, and it’s an odd-ball title that I can respect. It’s also one of the few Master System games that was only released in North America. I guess the Europeans just don’t like Alf?\n  So I was perfectly content to live my life not caring about  ALF for the Sega Master System.  Gong Xian on Twitter, though, let me know of an interesting bug. Then Bob from  RetroRGB was having a stream with  Tianfeng and the issue came up again, and now I’m writing an article about ALF.\n So I’d like to link to my Master System overview here, but that’s not done yet. So time for fast mode.\n  The Sega Mark III, known as the Master System in America, Europe, and eventually Japan, got its name from being the third revision of the Sega SG-1000 console. The SG-1000 has never shown up on this blog, but its computer version, the  SC-3000 has.\n The main feature the Mark III has over the SG-1000 is in its graphics chip. The SG-1000 used the TMS9918A, a common chip developed by TI in 1979 for its TI-99/4A computer, and used by machines like the MSX standard and the ColecoVision. The Mark III’s graphics processor, known as the VDP (Video Display Processor) and seemingly not as anything else, takes that as its core, and builds a new system on top of it.\n  So I don’t know about you, but what this tells me is that the TMS9918A was incredibly functional for 1979. 32 simultaneous sprites is nothing to sneeze at, even if they are one-color and with a 4-per-scanline limit. (Note, however, that the TI-99/4 and TI-99/4A had to share that 16kiB of video RAM with things like BASIC programs)\n This TMS9918A heritage also brought along a feature that was at one point synonymous with hardware sprites, but would become less and less common over the 1980s: hardware collision detection.\n  Collision detection in video games can be a pretty complicated topic, especially on a console with limited resources. For example, imagine player-enemy collision. My old Javascript game   Aspect Legend treats everyone as  circles; if your dot gets within another circle’s radius, you die.\n This is a little more complicated on an 8-bit console, though, where you don’t have access to  Math.pow, or a modern CPU to run those calculations every 1/60 of a second. (Or, in the case of  Aspect Legend, every 1/120 of a second.) So   Aspect Star “N” takes a  different approach, using overlapping boxes.   Space Ava 201 is grid-based, which is an entirely different way to solve the problem. (Note: when I link to my code, it’s just because that’s the code I’m most familiar with, not to imply that it’s the best way)\n  Notice, however, that all of these methods don’t have the sprite aligned with the collision. For example, take a look above. The red box over the lower mouse represents a collision area; notice that it includes blank pixels, but excludes some of the mouse’s feet and body. Meanwhile the player is just treated as a point. This isn’t a big deal in  Aspect Star “N”, but if the sprites and collision boxes get too divergent, a game can quickly become unplayable.\n Hardware collision detection solves that problem, and the problem of having to waste CPU cycles on this, by just having the video processor do it. The Atari 8-bit systems, including the 2600 and the computers, can do this, for example.\n  The video processor is in charge of drawing sprites, perhaps using something like a line buffer. Therefore, all it needs to do is when it realizes it’s drawing one sprite on top of somewhere is set a flag. And so the TMS9918A does just that.\n Hardware collision detection is therefore perfect. It will only report when two sprites actually overlap, not when a box overlaps. It’s so perfect that when a sprite “flickers”, the hardware collision detection will not register a collision when the sprite isn’t visible; this is what makes the famous  Adventure easter egg possible.\n But for TI, there was a problem. The TMS9918A has 32 sprites. Each could collide with the other 31 sprites. Therefore, you wouldn’t just need one flag: you’d need 992. And remember, pretty much everything in 8-bit home console and computer design comes down to one simple phrase: memory is expensive.\n Therefore, the TMS9918A just has a collision flag. Programs have two options once they see this flag is set:\n “Race the beam”, constantly check the collision flag while the screen is being drawn and detect when it is. This takes more CPU time than just running a software routine every frame.\n The Master System inherited this single-bit hardware collision detection from the TMS9918A. This made it a bit unique; the Nintendo Entertainment System and, as far as I can tell, the Atari 7800, both eschewed the feature. And the vast majority of games on the Master System didn’t bother using it; if you have to have software collision detection  anyway, why bother?\n   The lead programmer of  ALF, Kevin Seghetti, was only on his second game for the console, and his first was   Monopoly, which wasn’t exactly an action game. Plus, I mean, it’s  ALF for the Sega Master System. I think you can be forgiven for not bringing the A-game.\n  Here, you can see that Alf has been injured by a bat. Unfortunately, Alf is quite fragile, and dies on the spot. But something’s odd. Alf died without any overlap between his sprite and the enemy. In most games, you’d just say the collision was bad. But I just said that hardware collision detection was perfect.\n We can confirm this is how it’s supposed to work by opening up the source code of an emulator, and then building it with hardware collision detection disabled.  Here is where you’d do that in the Higan emulator, for example. There’s no real reason to go that far, but if you do, you’ll find that Alf can not die.\n   However, this bug has an interesting component: I took that screenshot running on a Genesis 1 using a Power Base converter. That’s my preferred way to take Master System screenshots, as it has a good video quality.\n However, I also have a Japanese Master System. Because of some peculiarities of the Japanese Master System’s output (its sync is at a different voltage level, as far as I know), I don’t have a high-quality cable, and use a cheap SCART cable that syncs on composite video and gives a darker picture with faint jailbars.\n    So, the Japanese Master System has the same VDP as the Mark III and the first-run American Master System; its only standout feature is its use of FM sound. So while I don’t have an American Master System ( yet), I think it’s safe to assume they’re equivalent in this regard.\n The Sega Genesis is backwards compatible with the Master System. However, it is  not backwards compatible with the SG-1000. All those TMS9918A modes are not available. This wasn’t a huge deal; the only western-released Master System game that actually used an SG-1000 mode was  F-16 Fighting Falcon.\n F-16 Fighting Falcon is often described as &#34;basically an SG-1000 game&#34;, but that&#39;s not accurate! The game will not run on an SG-1000 (or at least, not on an SC-3000) even if you bypass the title screen, which does use the Master System&#39;s graphics mode. This is because it uses all 8kiB of RAM the Master System has. (By comparison, the SG-1000 has only 1kiB and the SC-3000 2kiB built-in)\n  F-16 Fighting Falcon is actually somewhat relevant to  ALF. While the developers are not the same people (in fact, Mobygames claims the Master System version was developed by famed Sega developer Yuji Naka), both games were developed by Nexa. Just make sure to play your Nexa games on the real Master System, apparently they had something against the Power Base Converter.\n This basically means that the Sega Genesis is missing some legacy features. You might, therefore, assume that sprite collision is one of those legacy features; and indeed, I notice that if I modify the emulator to always have hardware collision detected, objects have larger hitboxes, showing that there is a software routine that’s a bit sloppy.\n  You don’t actually need a modded emulator, or in fact, to press a button to show how sloppy  ALF’s software collision detection is. Here’s an unmodified emulator letting the demo run. This is the last frame, and a collision has been detected between Alf and the speargun scuba diver. Why? Notice in the top left; a sprite (the catfish) is colliding with the oxygen bar. Since this is the demo, no death animation plays; instead, it resets back to the title screen.\n    No! I made a simple test program using some  Space Ava 201 graphics, and confirmed that the Sega Genesis in Master System mode does in fact support hardware collision. In this case, I just changed the background color.\n This actually makes sense; this legacy feature managed to make its way into the Mega Drive mode as well.  Hugues Johnson went into an article describing it, but be careful with your testing, as even the Higan emulator doesn’t bother implementing it for Mega Drive games. No commercial games used it, it seems, and it’s easy to see why.\n So if collision detection works, then there must be a collision detected. Let’s take a look at the two frames of the crime. First, the Master System game, where Alf doesn’t die. Second, the game running on a Genesis, the frame before he does. I tried to match them as close as possible.\n   What’s the difference? There’s a bat spawning off on the left side of the screen. And how can we tell if bats accidentally cause a collision when they spawn?\n   A trace logger is quite simple theoretically. An emulator is constantly running code instruction after instruction. On a system like the Sega Master System, with a single CPU that controls everything, the game state could just be logged after each instruction. This could allow you to step through the state.\n In practice, there is a problem, which is that there are a  lot of instructions. The Sega Master System CPU clock runs at 3.5MHz. Considering it has 8kiB of RAM and 16kiB of VRAM, logging the constant state of everything would take up a huge amount of disk space. So instead, each instruction just gets a line like this:\n  That might seem intimidating! But it’s not too bad. First off is the address that’s being read from. Then, there’s the instruction at that address. The AF, BC, DE, HL, IX, IY, SP, IFF, and IM are the state of the Z80 processor’s internal registers.\n So, why did I choose a  bit 5,a instruction? It’s because I’m looking for checks to collision detection. If we look at  SMS Power’s documentation of the Master System VDP, we see that it is the fifth bit when reading from the control port. So the idea that the  bit instruction, which checks a bit within the byte of  a, would be used is just an educated guess.\n How do we confirm this is the right place? Let’s look at where  a came from by looking at the instruction right before this one.\n  So  a comes from address  $c009. This is in the Sega Master System’s RAM space. We continue to work backwards; where is the last code that touches  $c009? A simple search backwards will tell us.\n 0074 in a,($bf) AF:1010 BC:0006 DE:cfac HL:cfb9 IX:ba18 IY:c02d SP:dfec IFF:00 IM:10076 ld ($c009),a AF:8010 BC:0006 DE:cfac HL:cfb9 IX:ba18 IY:c02d SP:dfec IFF:00 IM:1\n in a,($bf) uses the Master System’s IO ports; these are a convenient feature of the Z80, unlike the 6502-based systems I’m more familiar with, you don’t need to have IO pretend to be RAM and take up space in the available memory map. And the SMS Power article above points out that  $3f is exactly the source of VDP registers.\n   So the big problem with tracing is that even a short time will produce a huge number of instructions. I went to the cave in question, and ran just enough time that a bat spawned, being careful to never see two objects collide. This was only a few seconds; the log created is 70MB. That’s why we need to be able to know what to look for going in.\n In this case, I can look at the  bit 5 on line  0097, and then look at the next few lines to see what it does with that check.\n 0097 bit 5,a AF:8053 BC:00be DE:7f80 HL:d135 IX:ba18 IY:c02d SP:dfec IFF:00 IM:10099 call nz,$377e AF:8055 BC:00be DE:7f80 HL:d135 IX:ba18 IY:c02d SP:dfec IFF:00 IM:1009c call $083c AF:8055 BC:00be DE:7f80 HL:d135 IX:ba18 IY:c02d SP:dfec IFF:00 IM:1\n call nz,$377e will call the routine at  $377e only if the zero flag is clear, which generally means the prior instruction had a non-zero result. Therefore, the jump will only be taken if a collision was detected. Since the next line is the instruction at  $009c, we can realize that the branch was not taken.\n Since my trace had no visible object collisions, you’d expect that it’d have no cases where that branch is taken. But that’s not true. Later on, we see this:\n 0097 bit 5,a AF:e053 BC:00be DE:7f80 HL:d135 IX:85ed IY:c02d SP:dfec IFF:00 IM:10099 call nz,$377e AF:e031 BC:00be DE:7f80 HL:d135 IX:85ed IY:c02d SP:dfec IFF:00 IM:1377e ld a,($c254) AF:e031 BC:00be DE:7f80 HL:d135 IX:85ed IY:c02d SP:dfea IFF:00 IM:1\n So collision did happen! For just two frames (this code runs every frame; I was able to trace it back to the frame interrupt handler, so once every 60Hz). You’d expect a real collision to last more than two frames. (Of course, I confirmed this with more logging)\n   That’s a harder question to answer. What I will say is that  ALF is very timing-heavy; it’s always running code on the main thread, while the interrupt runs. In fact, I tried using  SMS Examine to read through the code, and while it didn’t fully work (sadly it wasn’t able to catch the main game logic, though it did catch our interrupt handler with its  bit 5,a), it did reveal that the game goes through a long delay loop only on Japanese systems. Given the game wasn’t even released outside of the US one has to wonder the point, but it definitely implies that timing was crucial.\n If you use an emulator like  MEKA, you can switch between PAL and NTSC timings, which are much more dramatic than the difference between a Genesis and a Master System. And the intro demo’s enemy positions differ quite a bit! Consider the undersea screenshot above; on a Master System, Alf is killed by a spearman. Here, Alf is killed by a spear, not by a spearman. (Plus, the cat hasn’t collided with the object yet.)\n  I don’t have a PAL Master System to check this. And of course, in the real world,  ALF was only released in the United States.\n  A video game having glitches is not at all surprising. But it’s fun to see how even relatively subtle differences can be noticed, and the chain of events. Having gone through all this, it’s hard to blame anyone at Nexa for not noticing this. I mean, the Genesis hadn’t even had its US launch yet, let alone the Power Base Converter.\n Plus, I mean, it’s  ALF. Why did I spend so long on this?", "posttime": "2021-07-27 13:31:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "alf,detection", "title": "碰撞检测很难：Alf 的故事", "title_en": "Collision Detection Is Hard: The Story of Alf", "transed": 1, "url": "https://nicole.express/2021/remember-alf.html", "via": "", "real_tags": ["alf", "detection"]}, {"category": "", "categoryclass": "", "imagename": "9367b35caaa43d9943d036882f8b510f.jpg", "infoid": 1069959, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "时事通讯平台似乎是一个干净、简单的工具，旨在帮助独立作家为其作品收取订阅费。但请不要炒作。 Substack 一直是 NPR、哥伦比亚新​​闻评论和纽约时报等近期报道的主题。尽管大部分报道都带有一些警告，但留下的印象是，在 COVID、谷歌和 Facebook 正在摧毁更传统的媒体形式的时候，Substack 终于创造了一个可行的商业模式来支持新闻业.今年早些时候，本·史密斯在《泰晤士报》上写道，Substack 承诺“扭转旧的自上而下的媒体公司的动态，打造更像人才机构的东西，在那里，个体记者是明星和老板，并且编辑只是随叫随到。”现在我们在哪里听说过？随着 Matt Taibbi、Glenn Greenwald、Andrew Sullivan 和 Matthew Iglesias 等名人记者放弃他们的机构演出并单独行动，Substack 已成为 2021 年的热门新媒体事物，尽管它并不新鲜，而且不太可能获得回报甚至在他们转向 Substack 之前就拥有大量观众的不止一些作家。 “Substack 模型对于一些已经有声望和追随者的人来说非常有效，”纽约大学新闻学教授梅雷迪思·布鲁萨德告诉 NPR。 “而且对其他人来说效果不佳。”早在 1980 年代我还是一名研究生时，我记得遇到过一句格言，即关于历史的展开有两种思想流派。第一个是它是一个又一个该死的事情。第二个是它一遍又一遍地重复着同样的事情。 Substack 显然是第二个例子。因为如果不重新访问博客，那么通讯模型是什么？还记得博客吗？我从 2002 年开始写一篇文章。我还在哈佛肯尼迪学院每年一次或两次教授一个关于“记者博客”的研讨会。多年来，我的信息已经从“这是一个很酷的新事物”转变为“每个人都在做，所以你也应该这样做”到“博客可能已经死了，但它仍然有很多价值。”\n我想我修改后的信息应该是“博客还活着，但现在我们称之为 Substack。”毕竟，您可以订阅我的博客并在我每次发帖时收到一封电子邮件——所以这是一份时事通讯，对吧？ Substack 将您过去的时事通讯归档在一个按时间倒序排列的有吸引力的列表中——所以它是一个博客，对吧？这听起来像是一场革命吗？有一个重要的区别：Substack 拥有比博客更好、更灵活的支付工具。我们可以在当天推出一个虚拟小费罐（我从未这样做过）或投放广告（我尝试过它们，但认为它们不值得打扰）。不过，在大多数情况下，为访问博客收取订阅费是很困难的，而且很少有博主尝试过。 Substack 使它变得简单，正如报道热情地指出的那样，少数处于堆顶部的作家赚取了六位数的收入。这相当令人印象深刻。不过，与此同时，付费订阅模式本身可能会在 2021 年的某个时候走向泡沫破灭的平流层。国家新闻机构已经通过读者收入恢复了类似财务健康的状态，经过多年的怀疑，这是一个不小的成就《纽约时报》将幸存下来。但是读者会为多少新闻订阅付费？我的猜测：一两份数字报纸；一两本杂志；仅此而已。在 Substack 上每月收取 6 美元的作家将被冻结——同样，名人除外。 “如果 Substack 成功，它将提醒新闻消费者，为好的新闻付费是值得的，”缅因大学的 Michael Socolow 为 The Conversation 写道。 “但如果 Substack 的定价妨碍了其新闻和评论的广泛传播，其作为公共服务的价值将无法完全实现。”此外，Substack 存在一些问题，听起来与您过去从博主那里听到的哀叹一模一样。例如，当安德鲁·沙利文几年前放弃了他的博客并去纽约杂志工作时，他说工作已经变得太多了。去年夏天，当他宣布他将离开杂志加入 Substack 时，他仍在抱怨工作量。 “自从我在 5 年前关闭了我的博客网站 Dish 以来，在每天写博客 15 年之后，”他写道，“我没有错过疯狂的工作时间，这几乎毁了我的健康。”\n不知何故，沙利文已经说服自己，Substack 的情况会有所不同。也许他应该与 Patrice Peck 联系一下，Patrice Peck 是一位记者，他出版了一份名为“黑人冠状病毒新闻”的 Substack 通讯，相对默默无闻。根据 Clio Chang 在哥伦比亚新​​闻评论中的一篇文章，Peck 发现过度工作和倦怠对于通讯作者和博客作者来说同样真实。 （为什么我们会有不同的想法？）“我正在 Instagram 上创建图形来推广它，发推文，做任何事情，”佩克告诉 Chang。 “这是一场单人秀。这让人筋疲力尽。我不会像我希望的那样频繁地发布它。”至于 Substack 的企业优先事项，请看下面。 Chang 指出，Substack 的大部分资金来自其 2018 年获得的 1530 万美元风险投资。除其他外，这些资金使 Substack 能够招募知名作家。但在某些时候，投资者会像往常一样坚持他们的发薪日。那时 Substack 的作者会意识到他们不是自己工作，而是其他人机器上的齿轮。在 2000 年代初到中期最初的兴奋之后，博客在数字媒体世界中占据了一个有价值但很小的利基市场。我们中的一些人仍在努力。许多其他人继续前进。 Substack 也可能如此。因为 Substack 不仅仅类似于博客。这是博客，令人惊讶的是，这么多人认为它是新的和不同的。像 Blogspot、WordPress、Medium（早期对记者的警示故事）和其他人一样，Substack 将取代它作为另一个自我发布平台——比一些更好，但具有进化性，而不是革命性。在数字时代，寻找支付新闻费用的方法的艰苦工作将继续下去。评论是开放的。请包括您的全名，名字和姓氏，并用文明的语言说话。", "note_en": "The newsletter platform seems like a clean, simple tool aimed at helping independent writers charge subscription fees for their work.\n But please spare me the hype. Substack has been the subject of recent stories by  NPR, the  Columbia Journalism Review and  The New York Times, among others. And though most of the coverage has come with a few caveats, the impression that’s left is that Substack, at long last, has created a workable business model to support journalism at a time when COVID, Google and Facebook are destroying more traditional forms of media.\n Substack,  Ben Smith wrote in the Times earlier this year, holds out the promise of “reversing the dynamic of the old top-down media company and producing something more like a talent agency, where the individual journalist is the star and the boss, and the editor is merely on call.” Now where have we heard that before?\n With celebrity journalists such as Matt Taibbi, Glenn Greenwald, Andrew Sullivan and Matthew Iglesias giving up their institutional gigs and going it alone, Substack has emerged as the hot new media thing of 2021, even though it’s not new and it’s unlikely to pay off for more than a few writers who had a substantial audience even before they switched to Substack.\n “The Substack model works really well for some people who already have prestige and a following,” New York University journalism professor  Meredith Broussard told NPR. “And it doesn’t work that well for everybody else.”\n Back when I was a graduate student in the 1980s, I remember coming across an aphorism that there are two schools of thought about the unfolding of history. The first is that it’s one damn thing after another. The second is that it’s the same damn thing over and over.\n Substack is clearly an example of the second. Because what is the newsletter model if it’s not blogging revisited? Remember blogs?  I’ve been writing one since 2002. I also teach a workshop on “Blogging for Journalists” once or twice a year at the Harvard Kennedy School. Over the years, my message has morphed from “this is a cool new thing” to “everyone is doing it, so you should too” to “blogging may be dead, but it’s still got a lot of value.”\n I guess my revised message should be “blogging is alive and well, except now we call it Substack.” After all, you can subscribe to my blog and get an email every time I post — so it’s a newsletter, right? And Substack archives your past newsletters in an attractive list kept in reverse-chronological order — so it’s a blog, right? Does this sound like a revolution to you?\n There is one important difference: Substack has better, more flexible tools for payment than blogging ever had. We could put out a virtual tip jar back in the day (I never did) or run ads (I experimented with them but decided they weren’’t worth the bother). For the most part, though, charging subscription fees for access to a blog is difficult, and very few bloggers tried it. Substack makes it simple and, as the coverage enthusiastically notes, a small number of writers at the top of the heap are earning six-figure incomes. That’s pretty impressive.\n At the same time, though, the paid-subscription model itself may be heading for the bubble-bursting stratosphere sometime in 2021. National news organizations have returned to something like financial health through reader revenue, which is no small accomplishment after years of wondering if The New York Times would survive. But how many news subscriptions are readers going to pay for? My guess: one or two digital newspapers; a magazine or two; and that’s just about it. Writers charging $6 a month on Substack are going to be frozen out — again, except for the celebrities.\n “If Substack is successful, it will remind news consumers that paying for good journalism is worth it,”  wrote the University of Maine’s Michael Socolow for The Conversation. “But if Substack’s pricing precludes widespread distribution of its news and commentary, its value as a public service won’t be fully realized.”\n Moreover, there are some problems with Substack that sound exactly like the laments you used to hear from bloggers.\n For instance, when Andrew Sullivan gave up his blog a few years ago and went to work for New York magazine, he said the grind had gotten to be too much. This past summer, when he  announced he was leaving the magazine for Substack, he was still whining about the workload.\n “Since I closed down the Dish, my bloggy website, five years ago, after 15 years of daily blogging,” he wrote, “I have not missed the insane work hours that all but broke my health.”\n Somehow Sullivan has convinced himself that things will be different at Substack. Maybe he should have checked in with Patrice Peck, a journalist who publishes a Substack newsletter in relative obscurity called  Coronavirus News for Black Folks.  According to an article by Clio Chang in the Columbia Journalism Review, Peck has discovered that overwork and burnout are just as real for newsletter writers as they are for bloggers. (And why would we think otherwise?)\n “I’m creating graphics on Instagram to promote it, tweeting it, doing everything,” Peck told Chang. “It’s a one-woman show. That gets exhausting. I don’t put it out as frequently as I’d like to.”\n As for Substack’s corporate priorities, well, look out below. Chang noted that Substack is funded in large measure through $15.3 million in venture capital that it received in 2018. Among other things, the money has enabled Substack to recruit well-known writers. But at some point the investors will insist on their payday, as they always do. That’s when Substack writers will realize they’re not working on their own but are, rather, cogs in someone else’s machine.\n After the initial excitement of the early to mid-2000s, blogging settled into a valuable but small niche in the digital media world. Some of us are still at it. Many others moved on.\n The same is likely to be true of Substack as well. Because Substack isn’t merely similar to blogging. It  is blogging, and it’s amazing that so many think that it’s new and different. Like Blogspot, WordPress, Medium (an earlier  cautionary tale for journalists) and others, Substack will take its place as just another platform for self-publishing — better than some, but evolutionary, not revolutionary.\n And the hard work of finding ways to pay for journalism in the digital age will continue.\n Comments are open. Please include your full name, first and last, and speak with a civil tongue.", "posttime": "2021-07-27 13:31:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "substack,hype", "title": "为什么 Substack 的炒作是关于很少的事情", "title_en": "Why the Substack hype is much ado about very little", "transed": 1, "url": "https://dankennedy.net/2020/12/09/blogging-is-dead-long-live-blogging-or-why-the-substack-hype-is-much-ado-about-very-little/", "via": "", "real_tags": ["substack", "hype"]}, {"category": "", "categoryclass": "", "imagename": "4f0b7dc91b1a4ac5822e0ae2e0f137fb.jpg", "infoid": 1069958, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "级别 1 我是一个机器人，这个动作是自动执行的。如果您有任何问题或疑虑，请联系此 subreddit 的版主。 level 2 他得了十年！我使用的狗会在大约一个半月后变得迟钝。级别 2 如果他一直在雕刻一棵树会更有意义，你知道，因为所有的树皮级别 2 哦，我看错了，以为他的狗也雕刻了洞穴。我不确定哪个更令人印象深刻。", "note_en": "level 1  I am a bot, and this action was performed automatically. Please   contact the moderators of this subreddit  if you have any questions or concerns.\n        level 2  He got ten years out of it! The dogs I use would have gone blunt after about a month and a half.\n level 2  It would have made more sense if he had been carving a tree, you know, because of all the bark\n    level 2  Ohhh, I read that wrong, thought his dog also carved the cave. I’m not sure which is more impressive.", "posttime": "2021-07-27 13:31:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "艺术,时间,carving,雕刻", "title": "艺术家用 10 年时间和他的狗一起雕刻洞穴", "title_en": "Artist spends 10 years carving a cave with his dog", "transed": 1, "url": "https://www.reddit.com/r/interestingasfuck/comments/os9jzb/artist_spends_10_years_carving_a_cave_with_his_dog/", "via": "", "real_tags": ["艺术", "时间", "carving", "雕刻"]}, {"category": "", "categoryclass": "", "imagename": "196c256c6c3ac7fe9eb6b229305d7b9b.jpg", "infoid": 1069957, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你的桌子由独立的、不同的原子组成，但从远处看，它的表面看起来很光滑。这个简单的想法是我们所有物理世界模型的核心。我们可以描述整体发生的事情，而不会陷入每个原子和电子之间复杂的相互作用中。因此，当发现一种新的物质理论状态时，其微观特征在所有尺度上都顽固地存在，许多物理学家拒绝相信它的存在。 “当我第一次听说分形时，我说这不可能是真的，因为它完全违背了我对系统行为方式的偏见，”新泽西州普林斯顿高等研究院的理论物理学家 Nathan Seiberg 说。 “但是我错了。我意识到我一直生活在否认之中。” 2011 年，分形的理论可能性让物理学家感到惊讶。最近，这些奇怪的物质状态一直在引导物理学家建立新的理论框架，以帮助他们解决基础物理学中一些最棘手的问题。分形是准粒子——从材料内部许多基本粒子之间复杂的相互作用中出现的粒子状实体。但是，即使与其他奇异的准粒子相比，分形也很奇怪，因为它们完全不动或只能以有限的方式移动。他们的环境中没有任何东西可以阻止分形移动；相反，这是他们的固有财产。这意味着分形的微观结构会影响它们的长距离行为。 “这完全令人震惊。对我来说，这是物质最奇怪的阶段，”加州理工学院凝聚态理论家谢晨说。 2011 年，加州理工学院的研究生 Jeongwan Haah 正在寻找异常稳定的物质相，它们可以用来保护量子存储器，即使在室温下也是如此。使用计算机算法，他发现了一个新的理论阶段，后来被称为 Haah 代码。由于构成它的奇怪的不可移动的准粒子，该相位很快引起了其他物理学家的注意。\n它们单独看起来就像是粒子的一小部分，只能组合移动。很快，更多具有相似特征的理论相被发现，因此在 2015 年 Haah 与 Sagar Vijay 和 Liang Fu 一起为奇怪的部分准粒子创造了“分形”一词。 （克劳迪奥·查蒙（Claudio Chamon）的一篇较早但被忽视的论文现在被认为是对分形行为的最初发现。）要了解分形相的特殊之处，请考虑一个更典型的粒子，例如电子，在材料中自由移动。某些物理学家理解这种运动的奇怪但习惯的方式是，电子之所以运动，是因为空间充满了电子-正电子对，瞬间突然出现和消失。这样一对的出现使得正电子（电子的带相反电荷的反粒子）位于原始电子的顶部，然后它们就会湮灭。这留下了电子对中的电子，从原始电子中移位。由于无法区分两个电子，我们只能看到一个电子在运动。现在相反，想象成对的粒子和反粒子不能从真空中出现，而只能是它们的平方。在这种情况下，可能会出现一个正方形，因此一个反粒子位于原始粒子的顶部，消灭了那个角。然后第二个正方形从真空中弹出，这样它的一个边与第一个正方形的一个边湮灭。这留下了第二个正方形的另一边，也由一个粒子和一个反粒子组成。由此产生的运动是粒子-反粒子对沿直线横向运动。在这个世界中——一个分形相的例子——单个粒子的运动受到限制，但一对粒子可以很容易地运动。 Haah 代码将这种现象发挥到了极致：只有当新粒子以称为分形的永无止境的重复模式被召唤时，粒子才能移动。假设您将四个粒子排列在一个正方形中，但是当您放大到每个角时，您会发现另一个由四个粒子组成的正方形，它们彼此靠近。再次放大角落，您会发现另一个正方形，依此类推。要在真空中实现这样的结构需要如此多的能量，以至于不可能移动这种类型的碎片。这允许非常稳定的量子位（量子计算的位）存储在系统中，因为环境无法破坏量子位的微妙状态。分形的不可移动性使得从远处将它们描述为平滑的连续体变得非常具有挑战性。因为粒子通常可以自由移动，如果你等待足够长的时间，它们会推挤进入平衡状态，平衡状态由温度或压力等整体属性定义。粒子的初始位置不再重要。但是分形被卡在特定的点上，或者只能沿着某些线或平面组合移动。描述这种运动需要跟踪分形的不同位置，因此相不能摆脱它们的微观特征或服从通常的连续描述。加州大学圣巴巴拉分校的理论家维杰 (Vijay) 说，它们坚决的微观行为使得“想象分形的例子并深入思考可能发生的事情是一项挑战”。 “没有连续的描述，我们如何定义这些物质状态？” “我们遗漏了很多东西，”陈说。 “我们不知道如何描述它们以及它们的含义。”\n分片还没有在实验室中制造出来，但这可能会改变。某些具有不可移动缺陷的晶体已被证明在数学上类似于分形。理论上的分形景观已经超出了任何人的预期，每个月都会出现新的模型。俄亥俄州立大学凝聚态物理学家布莱恩·斯金纳 (Brian Skinner) 说：“可能在不久的将来，有人会采纳其中一项提议，然后说，‘好吧，让我们对冷原子进行一些英勇的实验，并准确地实现其中的一个分形模型。谁设计了分形模型。即使没有他们的实验实现，分形的单纯理论可能性也为塞伯格敲响了警钟，塞伯格是量子场论的领先专家，目前几乎所有物理现象都在该理论框架中被描述。量子场论将离散粒子描述为跨越时空的连续场中的激发。这是迄今为止发现的最成功的物理理论，它包含粒子物理学的标准模型——控制所有已知基本粒子的极其精确的方程。 “分形不适合这个框架。所以我认为这个框架是不完整的，”塞伯格说。认为量子场论不完整还有其他充分的理由——一方面，它迄今为止未能解释引力。如果他们能弄清楚如何在量子场论框架中描述分形，塞伯格和其他理论家就可以预见到可行的量子引力理论的新线索。 “Fractons 的离散性具有潜在危险，因为它会破坏我们已有的整个结构，”Seiberg 说。 “但要么你说这是一个问题，要么你说这是一个机会。”\n他和他的同事正在开发新颖的量子场理论，试图通过允许在连续时空的基岩上发生一些离散行为来涵盖分形的怪异性。 “量子场论是一个非常微妙的结构，所以我们希望尽可能少地改变规则，”他说。 “我们走在薄冰上，希望能到达彼岸。”", "note_en": "Your desk is made up of individual, distinct atoms, but from far away its surface appears smooth. This simple idea is at the core of all our models of the physical world. We can describe what’s happening overall without getting bogged down in the complicated interactions between every atom and electron.\n So when a new theoretical state of matter was discovered whose microscopic features stubbornly persist at all scales, many physicists refused to believe in its existence.\n “When I first heard about fractons, I said there’s no way this could be true, because it completely defies my prejudice of how systems behave,” said  Nathan Seiberg, a theoretical physicist at the Institute for Advanced Study in Princeton, New Jersey. “But I was wrong. I realized I had been living in denial.”\n The theoretical possibility of fractons  surprised physicists in 2011. Recently, these strange states of matter have been leading physicists toward new theoretical frameworks that could help them tackle some of the grittiest problems in fundamental physics.\n  Fractons are quasiparticles — particle-like entities that emerge out of complicated interactions between many elementary particles inside a material. But fractons are bizarre even compared to  other exotic quasiparticles, because they are totally immobile or able to move only in a limited way. There’s nothing in their environment that stops fractons from moving; rather it’s an inherent property of theirs. It means fractons’ microscopic structure influences their behavior over long distances.\n “That’s totally shocking. For me it is the weirdest phase of matter,” said  Xie Chen, a condensed matter theorist at the California Institute of Technology.\n  In 2011,  Jeongwan Haah, then a graduate student at Caltech, was searching for unusual phases of matter that were so stable they  could be used to secure quantum memory, even at room temperature. Using a computer algorithm, he turned up a new theoretical phase that came to be called the Haah code. The phase quickly caught the attention of other physicists because of the strangely immovable quasiparticles that make it up.\n They seemed, individually, like mere fractions of particles, only able to move in combination. Soon, more theoretical phases were found with similar characteristics, and so in 2015 Haah — along with  Sagar Vijay and  Liang Fu —  coined the term “fractons” for the strange partial quasiparticles. (An earlier but overlooked  paper by Claudio Chamon is now credited with the original discovery of fracton behavior.)\n To see what’s so exceptional about fracton phases, consider a more typical particle, such as an electron, moving freely through a material. The odd but customary way certain physicists understand this movement is that the electron moves because space is filled with electron-positron pairs momentarily popping into and out of existence. One such pair appears so that the positron (the electron’s oppositely charged antiparticle) is on top of the original electron, and they annihilate. This leaves behind the electron from the pair, displaced from the original electron. As there’s no way of distinguishing between the two electrons, all we perceive is a single electron moving.\n  Now instead imagine that pairs of particles and antiparticles can’t arise out of the vacuum but only squares of them. In this case, a square might arise so that one antiparticle lies on top of the original particle, annihilating that corner. A second square then pops out of the vacuum so that one of its sides annihilates with a side from the first square. This leaves behind the second square’s opposite side, also consisting of a particle and an antiparticle. The resultant movement is that of a particle-antiparticle pair moving sideways in a straight line. In this world — an example of a fracton phase — a single particle’s movement is restricted, but a pair can move easily.\n The Haah code takes the phenomenon to the extreme: Particles can only move when new particles are summoned in never-ending repeating patterns called fractals. Say you have four particles arranged in a square, but when you zoom in to each corner you find another square of four particles that are close together. Zoom in on a corner again and you find another square, and so on. For such a structure to materialize in the vacuum requires so much energy that it’s impossible to move this type of fracton. This allows very stable qubits — the bits of quantum computing — to be stored in the system, as the environment can’t disrupt the qubits’ delicate state.\n The immovability of fractons makes it very challenging to describe them as a smooth continuum from far away. Because particles can usually move freely, if you wait long enough they’ll jostle into a state of equilibrium, defined by bulk properties such as temperature or pressure. Particles’ initial locations cease to matter. But fractons are stuck at specific points or can only move in combination along certain lines or planes. Describing this motion requires keeping track of fractons’ distinct locations, and so the phases cannot shake off their microscopic character or submit to the usual continuum description.\n Their resolute microscopic behavior makes it “a challenge to imagine examples of fractons and to think deeply about what is possible,” said Vijay, a theorist at the University of California, Santa Barbara. “Without a continuous description, how do we define these states of matter?”\n “We’re missing a big chunk of things,” said Chen. “We have no idea how to describe them and what they mean.”\n  Fractons have yet to be made in the lab, but that will probably change. Certain crystals with immovable defects have been  shown to be mathematically similar to fractons. And the theoretical fracton landscape has unfurled beyond what anyone anticipated, with new models popping up every month.\n “Probably in the near future someone will take one of these proposals and say, ‘OK, let’s do some heroic experiment with cold atoms and exactly realize one of these fracton models,’” said  Brian Skinner, a condensed matter physicist at Ohio State University who has devised fracton models.\n  Even without their experimental realization, the mere theoretical possibility of fractons rang alarm bells for Seiberg, a leading expert in quantum field theory, the theoretical framework in which almost all physical phenomena are currently described.\n Quantum field theory depicts discrete particles as excitations in continuous fields that stretch across space and time. It’s the most successful physical theory ever discovered, and it encompasses the  Standard Model of particle physics — the impressively accurate equation governing all known elementary particles.\n “Fractons do not fit into this framework. So my take is that the framework is incomplete,” said Seiberg.\n There are other good reasons for thinking that quantum field theory is incomplete — for one thing, it so far fails to account for the force of gravity. If they can figure out how to describe fractons in the quantum field theory framework, Seiberg and other theorists foresee new clues toward a viable quantum gravity theory.\n  “Fractons’ discreteness is potentially dangerous, as it can ruin the whole structure that we already have,” said Seiberg. “But either you say it’s a problem, or you say it’s an opportunity.”\n He and his colleagues are  developing novel quantum field theories that try to encompass the weirdness of fractons by allowing some discrete behavior on top of a bedrock of continuous space-time.\n “Quantum field theory is a very delicate structure, so we would like to change the rules as little as possible,” he said. “We are walking on very thin ice, hoping to get to the other side.”", "posttime": "2021-07-27 13:30:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "物质,matter,分形", "title": "“最奇怪”的物质，由部分粒子组成，无法描述", "title_en": "The ‘Weirdest’ Matter, Made of Partial Particles, Defies Description", "transed": 1, "url": "https://www.quantamagazine.org/fractons-the-weirdest-matter-could-yield-quantum-clues-20210726/", "via": "", "real_tags": ["物质", "matter", "分形"]}, {"category": "", "categoryclass": "", "imagename": "9219df7771b3b6bd5bd2688d45ea0664.jpg", "infoid": 1069956, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "得益于工程师 Venk Mutalik 的深夜灵感，Comcast 已经找到了如何在 90 秒内查明其整个网络中的光纤电缆断裂的方法。这使公司能够立即向光纤断裂处派遣维修人员，并为康卡斯特提供了一些防御措施，以抵御其最大的敌人：可能会意外切断埋藏电缆的施工反铲挖土机。在大流行期间恢复服务的能力尤为重要，因为当时宽带连接对几乎每个人都至关重要。随着未来几年网络承载的数据量增加 10 倍，快速修复电缆将变得更加重要。 Comcast 计划最终升级到 10G，这将使其能够为其网络上的 20 多万用户家庭提供每秒 10 Gb 的上行和下行速度。下一代接入团队高级副总裁 Elad Nafshi 在接受 VentureBeat 采访时表示：“我们一直专注于连接性，因为它从未如此重要。” “COVID 确实突出了连通性的重要性。我们正在不断发展我们的网络。我们认为我们的网络是最智能、最快和最可靠的。但你总是可以做得更好。” Mutalik 是 Next Generation Access 团队的一名工程师，Comcast 采纳了他的想法并在整个公司的网络中实施了它，以此来保持一切顺利进行。 Mutalik 想出了一种方法来重新利用上一代技术来监控互联网流量。康卡斯特现在可以轻松地通过光纤网络发送光信号，光束到达目的地并反弹回来。如果网络正常，工程师可以测量执行此操作所需的时间。如果线路有中断，光线会更快地反弹回来，他们使用时间差异来计算到中断的精确距离以及它的确切位置。最重要的是，他们可以使用相同的测试来确定光纤线路是否磨损或以其他方式失去传输数据的能力。 Nafshi 说，这使公司能够深入了解其网络上的数据流量，而不是我们通过消息等方式相互发送的实际数据。连接美国各地城镇的长途光纤网络设备依赖于数千个称为 ROADM（可重构分插复用器）的高度专业化设备，以确保数万亿字节的信息到达预定目的地。 ROADM 包含“光谱分析仪”芯片，这些芯片本质上是超智能棱镜，可将光纤激光分成越来越小的光束，并在几毫秒内将它们可靠地指向正确的目的地。\n每年左右，制造商都会发布更强大、更高分辨率的新一代光谱分析仪芯片，网络运营商在其网络中更换以前版本的设备。其他组件也是如此，例如光时域反射计、类似光学声纳的组件，它们使用“光回波”来查明光纤缺陷。这就是穆塔利克的想法。他知道上一代光谱分析仪和其他此类组件是功能强大的设备，旨在管理数千英里的光纤流量。如果康卡斯特将这些成熟的光电芯片重新用于监控数千英尺的交通，会发生什么？ “我们的光纤资产将增加 10 倍，或者类似的增长，随着时间的推移呈指数级增长，因为我们需要做的一切都将通过光纤连接，”Mutalik 说。 “因此，我们拥有大量的光纤资产，这些资产遍布整个海岸。我们连接到头端的节点中有 1/4 百万个节点，而且所有节点的距离都很短。问题是&#39;我们知道所有这些光纤在做什么吗？&#39;”他补充说，“&#39;我们知道这些光纤上的波长是多少吗？有多少波长下降？有多少波长出现？如果发生任何形式的中断，我们如何知道中断是光纤卡还是某人撞到电线杆然后将节点取出？&#39;”康卡斯特在城市、城镇和社区的本地光纤网络覆盖的距离更短而不是连接城市的长途网络。 Mutalik 推断，设计用于在数千英里范围内执行精确测量的光谱分析仪等光学组件在管理为单个社区供电的光网络时会更有效。 Mutalik 的团队聚集在一起，为名为 XMF 的系统构建了一个原型。通过在本地光纤网络中安装这些光谱分析仪并开发软件以新的方式利用设备的功能，该团队能够在这些网络的每一毫米处获得前所未有的性能可见性。 “洞察力是，如果您回顾该技术的后缘，您会发现我们拥有三代更快、分辨率更高的光谱分析仪。但是老一代的芯片是可用的，它们非常适合我们需要做的事情，将信号路径中的内容迁移到监控路径，”Mutalik 说。 “而且由于他们没有通过信令，我们在我们的网络上创建了这些新的测试点，在那里可以自动、普遍、持续地监控光，而不影响信号路径。”\nMutalik 补充说：“然后我们有光谱分析仪和时域反射计发送光脉冲。然后我们等待回声。然后根据回波的信号处理，我们可以确定光在被反射和返回之前传播了多长时间。”由于 XMF 将上一代技术用于新目的，因此在整个本地光纤网络的许多点安装超精密光纤诊断工具变得更具成本效益，从而为技术团队创造了更多的可见性。 XMF 平台每分钟持续监控 Comcast 网络中的数十万条本地宽带光链路，测量光谱并测试光纤链路的长度和质量。实际上，这意味着安装 XMF 后，网络工程师现在可以精确定位本地光纤网络出现问题的确切位置，并与本地技术人员共享精确的地理位置。 Comcast 现在可以确定发生光纤切断的确切时刻。然后它可以将其与其他事件相关联，例如施工或恶劣天气。重要的是要知道是光纤切断、断电还是故障。 “这些是非常难以诊断的事情，因为它们需要技术人员采取不同的行动，”穆塔利克说。 “如果是光纤切割，您需要一名光学技术人员。如果一个节点出现故障，您需要一名射频 (RF) 技术人员。有时您需要数小时进行三角测量并找出发生了什么。”安装后，XMF 将技术人员查找和隔离光纤切割所需的时间从两个小时减少到一分半钟。这有助于公司更快地让客户重新上线。它还用于在客户注意到之前发现和修复退化的光纤性能。该团队使用机器学习来查看链接如何随时间退化以及维护如何保持网络运行。 “这是康卡斯特创新的一个极好的例子，”Nafshi 说。 “当您退后一步时，网络中发生的事情的可见性从未如此重要。我们如何从网络中获得相同级别的可见性？这确实是一个挑战，让 Venk 有理由研究代表我们接入网络的数十万英里的光纤。”\nXMF 团队现在正在推出 XMF 平台的手持版本，技术人员可以在现场使用该平台在几秒钟内识别光纤链路问题，甚至可以现场诊断和修复这些问题。随着团队努力改进手持平台，他们开始在 Comcast 网络中更广泛地扩展机架安装的原始版本。 Nafshi 说，这是向 10G 迈出的一大步，因为即使在行业加快速度和容量的情况下，继续提高可靠性也很重要。 XMF 和 Comcast Octave 等技术有助于确保即使网络达到新的速度和容量高度，对于依赖它的客户来说，它也将比以往任何时候都更加安全和可靠。 “在我们对技术的投资和向 10G 的发展过程中，我们不仅增加了速度，”他说。 “在过去的 12 个月里，我们也达到了关键的里程碑。去年，在大流行最严重的时候，我们宣布了 1.25 Gb/s 对称服务，这是对我们分布式接入网络的一项试验。 4 月，我们宣布了 DOCSIS 4.0 FDX 的首次实验室试验，我们在其中演示了 4 Gb/s 对称服务。因此，大量的网络创新用于使我们的网络面向未来。”与此同时，康卡斯特必须照顾好网络。 Nafshi 说，本周早些时候，一辆卡车撞到了休斯顿的一根电线杆，它取出了一条服务于 75 个节点的光纤。该系统启动并将切割位置精确定位到距枢纽站点约 5 公里处。一个团队被立即派出并迅速恢复服务，将此类中断的标准时间缩短了几个小时。该公司试图与使用反铲的施工团队进行沟通，以降低纤维切割的风险。但事情发生了。在伦敦，一名钻探人员在光纤主干上打了一个洞，导致伦敦的部分互联网接入中断了三天。我不知道你。但如果我的互联网断网三天，我会搬进旅馆。 VentureBeat 的使命是成为技术决策者的数字城镇广场，以获取有关变革性技术和交易的知识。我们的网站提供有关数据技术和策略的重要信息，以指导您领导您的组织。我们邀请您成为我们社区的一员，以访问：封闭的思想领袖内容和我们珍贵活动的折扣访问权限，例如 Transform 2021：了解更多 成为会员", "note_en": "Thanks to the late-night inspiration of engineer Venk Mutalik,  Comcast has  figured out how to pinpoint breaks in its fiber optic cables throughout its network within 90 seconds.\n This enables the company to dispatch repair crews to the fiber breaks immediately, and it gives Comcast some defense against its greatest enemy: construction backhoes that might accidentally sever buried cables.\n  The ability to restore service is particularly important during the  pandemic, when broadband connectivity has been critical for just about everybody. Fixing cables quickly is going to become even more important as the networks carry 10 times more data in the coming years. Comcast plans to eventually upgrade to 10G, which will allow it to deliver 10 gigabits a second both upstream and downstream to the 20-plus million subscriber homes on its network.\n “We have a relentless focus on connectivity, as it has never been more important,” Elad Nafshi, senior VP of the Next Generation Access team, said in an interview with VentureBeat. “COVID really highlighted the significance of connectivity. And we’re continuously evolving our network. We see our network as the smartest, fastest, and most reliable. But you can always do better.”\n Mutalik is an engineer on the Next Generation Access team, and Comcast has taken his idea and implemented it across the company’s network as a way to keep things running smoothly. Mutalik figured out a way to repurpose previous-generation technology to monitor internet traffic. Comcast can now easily send light signals out through the fiber-optic network, and the light beams hit their destination and bounce back. The engineers can measure how long it takes to do this if the network is normal. The light bounces back more quickly if there is a break in the line, and they use the difference in timing to calculate the precise distance to the break and exactly where it is.\n On top of that, they can use the same tests to figure out whether the fiber lines are fraying or otherwise losing their capacity to transmit data. This gives the company insight into the data traffic on its networks but not the actual data we’re sending to each other in messages and such, Nafshi said.\n   The long-haul fiber optic network equipment that connects cities and towns across the United States relies on thousands of highly specialized devices called ROADMs (reconfigurable add-drop multiplexers) that ensure trillions of bytes of information get to their intended destinations. ROADMs contain “optical spectrum analyzer” chips that are essentially ultra-smart prisms, splitting fiber optic laser light into smaller and smaller beams and pointing them reliably at the right destinations, all in milliseconds.\n Every year or so, manufacturers release a newer generation of more powerful and higher-resolution optical spectrum analyzer chips, and network operators replace the previous versions of the devices in their networks. The same is true for other components, like the optical time domain reflectometers, optical sonar-like components that use “optical echoes” to pinpoint fiber imperfections.\n   That’s what got Mutalik thinking. He knew previous-generation optical spectrum analyzers and other such components were powerful devices designed to manage fiber optic traffic over thousands of miles. What would happen if Comcast repurposed these mature optoelectronic chips to monitor traffic traveling thousands of feet?\n “We’re going to have our fiber assets increase 10 times, or something like that, exponentially increasing over time because everything that we need to do is going to be connected by fiber,” Mutalik said. “And so we have a huge amount of fiber assets that go coast to coast. There are a quarter of a million nodes that we have connected to the headends, and all of them are short distances. The question was ‘Do we know what all those fibers are doing?&#39;”\n He added, “‘Do we know what wavelengths on those fibers are? How many wavelengths are going down? How many wavelengths are coming up? And if there was an outage of any kind, how do we know the outage is a fiber card versus somebody hitting a telephone pole and then taking the node out?&#39;”\n Comcast’s local fiber optic networks in cities, towns, and neighborhoods cover shorter distances than the long-haul networks connecting cities. Mutalik reasoned that optical components such as optical spectrum analyzers, which are designed to perform pinpoint measurements over thousands of miles, would be that much more effective in managing an optical network that powers a single neighborhood.\n   Mutalik’s team got together and built a prototype for a system called the XMF. By installing these optical spectrum analyzers in the local fiber networks and developing software to leverage the devices’ capabilities in new ways, the team was able to gain unprecedented visibility into performance along every millimeter of those networks.\n “The insight was that if you go back and look at the trailing edge of the technology, you see we have three generations faster and more finer-resolution optical spectrum analyzers. But the older-generation chips are available, and they’re perfectly fine for what we need to do in taking what was in the signal path and migrating it to the monitoring path,” Mutalik said. “And because they’re not going through the signaling, we have created these new test points on our network where the light can get monitored automatically, pervasively, continuously, not affecting the signal path.”\n Mutalik added, “And then we have optical spectrum analyzers and the time domain reflectometer send a pulse of light. And then we wait for the echo. And then based on the signal processing of the echo, we can determine how long the light travels before getting reflected and coming back.”\n Since XMF leverages previous-generation technology for a new purpose, it makes it more cost-effective to install ultra-precise fiber diagnostic tools at many points throughout local fiber networks, creating significantly more visibility for technical teams.\n The XMF platform continuously monitors hundreds of thousands of local broadband optical links every minute across the Comcast network, measuring the optical spectrum and testing the length and quality of the fiber links. In practical terms, this means with XMF installed, network engineers can now pinpoint the exact point at which a local fiber network is experiencing an issue and share the precise geolocation with local technicians.\n Comcast can now figure out the exact moment when a fiber cut happens. Then it can correlate this to other events, like construction or bad weather. It’s important to know if it is a fiber cut or a power outage or a malfunction.\n “Those are very difficult things to diagnose because they require different actions from technicians,” Mutalik said. “If it is a fiber cut, you have an optical technician go. If a node is malfunctioning, you have a radio frequency (RF) technician go. Sometimes you need hours to triangulate and find out what happened.”\n  When installed, XMF reduces the amount of time it takes for a technician to find and isolate a fiber cut from two hours down to one-and-a-half minutes. That helps the company get customers back online faster. It’s also used to discover and repair degraded fiber performance before customers notice. The team uses machine learning to see how the links degrade over time and how maintenance can keep the network going.\n “This is a fantastic example of Comcast innovation,” said Nafshi. “And when you take a step back, visibility of what goes on in a network has never been more important. How do we get that same level of visibility from the network? And that’s really a challenge that gave Venk the reason to look at the hundreds of thousands of miles of fiber that represents our access network.”\n   The XMF team is now rolling out a handheld version of the XMF platform that technicians can use in the field to identify fiber link issues in seconds and even diagnose and repair those issues on the spot. As the team works to refine the handheld platform, they are beginning to scale the rack-mounted original version more broadly across the Comcast network.\n This is a big step toward 10G since it will be important to continue increasing reliability even as the industry accelerates speed and capacity, Nafshi said. Technologies like XMF and Comcast Octave have helped ensure that even as the network reaches new heights of speed and capacity, it will be more secure and reliable than ever for the customers who depend on it.\n “In the investments that we’re making in technology and the progression towards 10G,  we’re adding not only more speed,” he said. “We also hit key milestones over the last 12 months. Last year, at the height of the pandemic, we  announced 1.25-gigabit-per-second symmetrical services, a trial over our distributed access network. In April, we announced the first lab trial of DOCSIS 4.0 FDX, where  we demoed 4 gigabit-per-second symmetrical services. So a ton of network innovation goes into future-proofing our network.”\n In the meantime, Comcast has to take care of the network. Nafshi said that earlier this week, a truck hit a telephone pole in Houston, and it took out a fiber that served 75 nodes. The system kicked in and pinpointed the cut location to about five kilometers from the hub site. A team was sent out right away and restored the service quickly, shaving hours off the standard length of an outage like that.\n The company tries to communicate with construction teams that use backhoes to reduce the risk of fiber cuts. But stuff happens. In London, a crew drilling a hole hit a fiber backbone and took down a  part of London’s internet access for three days. I don’t know about you. But if my internet was down for three days, I’d move into a hotel.\n VentureBeat&#39;s mission is to be a digital town square for technical decision-makers to gain knowledge about transformative technology and transact.Our site delivers essential information on data technologies and strategies to guide you as you lead your organizations. We invite you to become a member of our community, to access: gated thought-leader content and discounted access to our prized events, such as   Transform 2021: Learn More\n Become a member", "posttime": "2021-07-27 13:30:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "查明,pinpoint,光纤", "title": "康卡斯特现在可以在几分钟内查明光纤电缆断裂", "title_en": "Comcast can now pinpoint fiber optic cable breaks within minutes", "transed": 1, "url": "https://venturebeat.com/2021/07/22/comcast-can-now-pinpoint-fiber-optic-cable-breaks-within-minutes/", "via": "", "real_tags": ["查明", "pinpoint", "光纤"]}, {"category": "", "categoryclass": "", "imagename": "ab52d4912798046ffde2ff70499ed2b6.jpg", "infoid": 1069955, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家初创公司今天宣布，它已经筹集了 250 万美元的 Pre-A 轮融资，由 Nordic Eye Venture Capital 领投，Tradeworks VC、Venture Catalysts、9Unicorns 和 Blume Funders Fund 跟投。该轮融资还包括回归投资者 Vinod Kumar Talreja。 Freightify 目前为 10 个国家的客户提供服务，并计划使用其部分资金扩展到美国和欧洲。其客户是货运代理，规模从每年处理 250 批货物到超过 100,000 批货物不等。该公司由其首席执行官 Raghavendran Viswanathan 于 2016 年创立。在其技术演变为 Freightify 的自动费率管理系统之前，Freightify 最初是货运市场 FreightBro。 Freightify 表示，该平台已为客户处理了超过 4 亿美元的货运收入，相应的商品总额为 20 亿美元。 Freightify 可以与货运代理现有的运输管理系统集成，跟踪货物的移动。一旦货运代理通过 Freightify 建立在线商店，他们的客户就可以使用它来比较费率、询问报价、在线预订和跟踪发货。 Freightify 从 Maersk、CMA-CGM 和 Evergreen 等海运承运商的 API 中提取定价数据，或者自动从没有 API 的承运商处输入离线合同费率。 Viswanathan 告诉 TechCrunch，在 COVID-19 大流行之前，运费相对稳定，因此货运代理能够通过电子表格与客户共享。但这场大流行带来了许多新的挑战。 “海运业现在正在经历一个变化，”维斯瓦纳坦说。 “自大流行开始以来，该行业陷入了螺旋式下降。运费已连续四个季度创下历史新高，”自 2020 年初以来，运费上涨了 500%。\n此外，其他因素，例如 Ever Given 造成的苏伊士运河阻塞和与大流行相关的港口延误，使供应链更加难以预测。 Freightify 为货运代理及其客户提供了一个实时定价平台，就像旅行者用来比较机票的平台一样，在单个屏幕上显示实时费率，从而解决了其中一些挑战。 “货运代理就像全球贸易的旅行社，”维斯瓦纳坦说。 “然而，航空旅行并不像全球贸易那么复杂。供应链需要专家在整个生命周期内管理货物，货运代理在润滑车轮方面发挥着至关重要的作用。” Freightify 正在开发一种新产品，其客户可以在其中相互共享数据，从而更轻松地跨时区进行通信，同时减少他们需要发送的电子邮件数量。封闭式集团产品试点预计将在今年年底进行。在关于这笔资金的声明中，Nordic Eye 投资经理 Ib Drachmann 表示，“关注一个充满活力和雄心勃勃的组织，很高兴能够在国际货运代理领域产生巨大的数字影响。”", "note_en": "The startup announced today it has raised $2.5 million in pre-Series A funding led by Nordic Eye Venture Capital, with participation from Tradeworks VC, Venture Catalysts, 9Unicorns and Blume Funders Fund. The round also included returning investor Vinod Kumar Talreja.\n Freightify currently serves customers in 10 countries and plans to use part of its funding to expand into the United States and Europe. Its customers are freight forwarders who range in size from handling 250 shipments a year to more than 100,000.\n   The company was founded in 2016 by Raghavendran Viswanathan, its chief executive officer. Freightify started out as FreightBro, a freight marketplace, before its technology evolved into Freightify’s automated rate management system.\n Freightify says the platform has handled more than $400 million in freight revenue for customers and corresponding gross merchandise volume of $2 billion.\n Freightify can be integrated with freight forwarders’ existing transport management systems, which track the movement of cargo. Once freight forwarders set up an online store with Freightify, their customers use it to compare rates, ask for quotes, book online and track shipments. Freightify draws pricing data from the APIs of ocean carriers like Maersk, CMA-CGM and Evergreen or automates the entry of offline contract rates from carriers without APIs.\n Viswanathan told TechCrunch that before the COVID-19 pandemic, freight rates were relatively static, so freight forwarders were able to share them with customers through spreadsheets. But the pandemic created a host of new challenges.\n “The ocean freight transportation industry is going through a flux right now,” Viswanathan said. “The industry went into a downward spiral since the start of the pandemic. Freight rates have been hitting record numbers for four straight quarters,” with rates up 500% since the beginning of 2020.\n Furthermore, other factors, like the Suez Canal blockage by the Ever Given and pandemic-related port delays, have made supply chains even less predictable.\n Freightify solves some of these challenges by giving freight forwarders and their customers a live pricing platform like the ones used by travelers to compare airfares, showing real-time rates on a single screen.\n “Freight forwarders are like the travel agents for the global trade,” Viswanathan said. “However, air travel is not as complicated as global trade. Supply chains require experts to manage cargo throughout the entire lifecycle and freight forwarders play a vital role in greasing the wheels.”\n Freightify is working on a new product where its customers can share data with one another, making it easier to communicate across timezones while reducing the amount of emails they need to send. A closed group product pilot is expected to happen at the end of this year.\n In a statement about the funding, Nordic Eye investment manager Ib Drachmann said it’s “exciting to follow a dynamic and ambitious organization that has great chances of making a huge digital impact in international freight forwarding.”", "posttime": "2021-07-27 12:51:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "货运,management,freightify", "title": "Freightify 获得 250 万美元，使货运代理更容易管理费率", "title_en": "\n\t\t\t\tFreightify lands $2.5M to make rate management easier for freight forwarders\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/26/freightify-lands-2-5m-to-make-rate-management-easier-for-freight-forwarders/", "via": "", "real_tags": ["货运"]}, {"category": "", "categoryclass": "", "imagename": "3eef5059b31483ee3b0605e2a3da01f1.png", "infoid": 1069954, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Internet Explorer 现在已成为过去，取而代之的是更好的 Microsoft Edge。为什么开发人员和软件工程师如此讨厌 IE？因为 IE 已经严重过时，缺乏对支持我们今天使用的现代网站和 Web 应用程序的尖端 Web API 和技术的支持。随着 IE 的出现，“最讨厌的浏览器”的区别就归于 Apple 的 Safari——它一直紧随 IE 之后。同样，Safari 在支持现代 Web API 和功能方面一直落后于竞争浏览器，这给希望创建在所有主要浏览器（Chrome、Edge、Firefox 和 Safari）上一致工作的产品的开发人员带来了相当大的挑战。然而，Safari 的烦恼变得更深、更微妙，我将在下面进一步解释。您是否知道今天可以为您的浏览器创建一些像您设备上的本机应用程序一样工作的东西？这是通过所谓的渐进式网络应用程序 (PWA) 实现的，这是一组现代浏览器技术，可让您创建一个外观、感觉和执行类似于智能手机、平板电脑或台式机上的本机应用程序的网站。\n渐进式 Web 应用程序真的很酷，因为它们可以为您提供以下功能，您通常希望使用本机应用程序：PWA 不需要编译，也不需要提交到应用程序商店进行审批。当今使用的渐进式网络应用程序的一些示例：星巴克、Twitter 和优步。 Apple 在 Safari 中添加对 PWA 的支持方面拖延了脚步，当他们最终这样做时，限制了 PWA 的功能，因此无法实现类似本机的应用程序功能，例如通知或主屏幕图标快捷方式——仅举一个例子苹果施加的众多限制中的一小部分。但它不止于此。在 iOS 上，唯一允许的 Web 渲染引擎是 Apple 自己的 WebKit，它运行 Safari。第三方 iOS 浏览器（例如 Chrome）只能使用 WebKit，而不能使用它们自己的引擎（在 Windows、Android 或 macOS 中是允许的）。它是管理 PWA 功能的 WebKit。 Apple 对 PWA 相关的 Web API 自我施加限制的原因是什么？他们会告诉您这是出于用户隐私原因，这在某些情况下可能是有效的。但我们大多数人都知道主要原因是因为功能齐全的 PWA 将与 iOS App Store 竞争——在购买应用程序或执行应用程序内购买时，Apple 会从它的收入中减少 30%。直到最近，关于 Apple 停止支持 PWA 的争议还仅限于 Web 开发者社区。但现在，由于 Epic 诉 Apple 案以及反垄断监管行动的可能性，它已经向公众公开。\n苹果最终可能被迫全面扩展 PWA 或第三方 iOS 浏览器支持，作为满足政府监管机构的让步。我们会看看会发生什么。 Web 开发人员和工程师长期以来一直抱怨其他浏览器通常可用的关键 Web API 和 CSS 功能缓慢或缺乏支持。 ... Apple 不会对任何现代 API 表示担忧。 PWA，流，谁他妈的需要那个？好吧，亲爱的 Apple，现在很多 Web 开发人员都需要它。以 WebRTC 为例。 WebRTC 主要用于网络上的视频和音频通信。它还用于发送文件和共享屏幕内容。 Apple 花了数年时间终于为 Safari 添加了 WebRTC 支持，远远落后于 Chrome 和 Firefox，以至于它几乎成为开发人员甚至行业观察者之间的一个笑话。尽管现在提供支持，但众所周知，与其他浏览器相比，WebRTC 在 Safari 桌面上存在更多问题。开发人员发现在 iOS 中支持它是一团糟，实际上甚至不值得付出努力。过去曾有人批评 Safari 不支持 VP9 视频编解码器或 WebP 图像压缩格式。一些好消息：截至 2020 年末，它们现在得到支持——尽管它们已经与其他浏览器一起使用多年并且已经证明非常受欢迎，但它毫无价值。\n现在，Apple 只需要齐心协力，支持 AV1 视频编解码器和相关的 AVIF 图像格式。不过，这可能是一项艰巨的任务，因为 Apple 为与之竞争的 HEVC 编解码器收取版税，并且是 HEIC 图像格式的大力支持者。我经常读到开发人员对 Safari 实现 Web API 和 CSS 功能中的许多错误感到沮丧，尤其是看到它们解决的速度很慢。我们应该如何跟上这个节奏？苹果不是世界上最富有的公司之一吗？投资你他妈的浏览器。更令人沮丧的是，与 Chrome 或 Firefox 不同的是，Safari 更新不是定期自动进行的。它们仅与对整个操作系统的不频繁更新一起提供。严重地！ Microsoft 对 Edge 浏览器采用自动更新。可以肯定的是，Apple 也可以找到*勇气*这样做。不要误会我的意思，Safari 是非常好的网络浏览器，提供快速的性能和可靠的隐私功能。但与此同时，缺乏对关键 Web 技术和 API 的支持既令人困惑又令人烦恼。\niOS 的巨大普及让 Apple 继续阻碍开发人员通过网络创建适用于所有平台的出色体验，这一点更加令人恼火。但也不完全令人惊讶，因为 Apple 将其未来押注于基于服务的收入，其中包括来自 App Store 的销售额。众所周知，苹果公司在面对公众压力时会退缩。也许会有足够的内容导致 Safari 发生一些严重的变化。", "note_en": "Internet Explorer is now a thing of the past, replaced by the far-better Microsoft Edge.\n Why did developers and software engineers hate IE so much? Because IE was seriously outdated, lacking support for cutting-edge web APIs and technologies enabling the modern websites and web apps we use today.\n With IE now out of the way, the distinction of ‘most-hated browser’ goes to Apple’s Safari – which all along had been a close second to IE.\n In a similar vein, Safari has consistently lagged behind competing browsers in supporting modern web APIs and features, presenting considerable challenges for developers wanting to create products that work consistently across all the major browsers (Chrome, Edge, Firefox, and Safari).\n However, the annoyance with Safari gets deeper and more nuanced, which I’ll explain further below.\n  Did you know that it’s possible today to create something for your browser that works like a native app on your device?\n This is enabled through what’s known as  progressive web apps (PWAs) – a collection of modern browser technologies that together let you create a site that looks, feels, and performs similar to a native app on your smartphone, tablet, or desktop.\n Progressive web apps are really cool, because they can give you the following capabilities that you would normally expect with a native app:\n  PWAs don’t require compiling, nor submission to app stores for approval. A few examples of progressive web apps in use today:  Starbucks,  Twitter, and  Uber.\n Apple dragged their feet in adding support for PWAs in Safari, and when they finally did, limited the capabilities of a PWA so that native-like app functionality wouldn’t be possible, like notifications or a home screen icon shortcut – to name just a few of the many restrictions imposed by Apple.\n But it goes beyond that. On iOS, the only web rendering engine allowed is Apple’s own WebKit, which runs Safari. Third-party iOS browsers such as Chrome can only use WebKit, not their own engines (as would be permitted in Windows, Android, or macOS). And it’s WebKit that governs PWA capabilities.\n The reason for Apple’s self-imposed limitations on PWA-related web APIs? They’ll tell you  they’re for user privacy reasons, which may be valid in certain cases.\n But most of us know the  dominant reason is because fully-capable PWAs would compete against the iOS App Store – robbing Apple of 30% cut in revenue it rakes in when an app is purchased, or an in-app purchase is executed.\n Until recently, the controversy over Apple’s halting PWA support was fairly confined to the web developer community. But now,  it’s been laid bare to the public, thanks to the Epic vs. Apple case, and the possibility of anti-trust regulatory actions.\n Apple may ultimately be compelled to fully expand PWA or third-party iOS browser support as a concession to satisfy government regulators. We’ll see what happens.\n  Web developers and engineers have long lamented about slow or lack of support of key web APIs and CSS features that are commonly available with other browsers.\n … Apple don’t give a f**k about any modern APIs. PWA, streams, who the f**k needs that? Well, dear Apple, a f**king lot of web devs need that nowadays.\n Take WebRTC, for example. WebRTC is prominently used in video and audio communications over the web. It’s also used to send files, and share screen content.\n Apple took  years to finally add WebRTC support to Safari, far enough behind Chrome and Firefox that it practically became a running joke among developers and even industry observers.\n Despite the support now available, WebRTC is known to be buggier on Safari desktop compared to other browsers. Developers have found it a mess to support in iOS that it’s practically  not even worth the effort.\n There’s been past criticism for Safari not supporting the VP9 video codec or the WebP image compression format. Some good news: as of late 2020 they’re now supported – though it’s worth nothing they’ve been around for years with other browsers and have proven very popular.\n Now, Apple just needs to get its act together and support the AV1 video codec and related AVIF image format. This may be a tall order, though, since Apple collects royalties for the competing HEVC codec, and is a big proponent of the HEIC image format.\n  I often read about developers frustrated with the many bugs in Safari’s implementation of web APIs and CSS features, and in particular, the slowness of seeing them addressed.\n How are we supposed to keep up with this? Isn’t Apple one of the richest company in the world? Invest in your f**king browser.\n Further contributing to the frustration is the fact that unlike Chrome or Firefox, Safari updates are not automatic on regular basis. They’re only shipped together with the infrequent updates to the entire OS.\n Seriously! Microsoft employs automatic updates to the Edge browser. So surely, Apple can find the * courage* to do so as well.\n  Don’t get me wrong, Safari is very good web browser, delivering fast performance and solid privacy features.\n But at the same time, the lack of support for key web technologies and APIs has been both perplexing and annoying at the same time.\n The enormous popularity of iOS makes it all the more annoying that Apple continues to hold back developers from being able to create great experiences over the web that work across all platforms.\n But not exactly surprising either, given that Apple has staked its future on service-based revenue that includes sales generated from the App Store.\n Apple has been known to stand down in the face of public pressure. Maybe there will be enough of it to lead to some serious changes to Safari.", "posttime": "2021-07-27 12:42:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,开发,safari", "title": "对于开发人员来说，Apple 的 Safari 是垃圾和过时的", "title_en": "For developers, Apple’s Safari is crap and outdated", "transed": 1, "url": "https://blog.perrysun.com/2021/07/15/for-developers-safari-is-crap-and-outdated/", "via": "", "real_tags": ["apple", "开发", "safari"]}, {"category": "", "categoryclass": "", "imagename": "01f93f6ca0a50f76fbe47043bf583f66.jpg", "infoid": 1069952, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司现在总部位于新加坡，但正在转移到湾区，将这笔投资吹捧为“东南亚第一家 B2B 支付独角兽”。 Riverwood Capital 领投了这轮融资，淡马锡、Visa、Vertex Ventures、Atinum Capital、Beacon Venture Capital 和 Rocket Capital Investment 以及DoorDash 的 Gokul Rajaram、FIS 的 Vicky Bindra 和 Tribe Capital 的 Arjun Sethi 等一批天使投资人参与了该轮融资。包括新资金在内，Nium 迄今已筹集了 3 亿美元，联合创始人兼首席执行官 Prajit Nanu 告诉 TechCrunch。一些专家表示，B2B 支付行业已经很火爆，但渗透率不足。 Nanu 说，Nium 正在为其 D 轮融资寻求 1.5 亿美元，从热切的投资者那里获得了 3 亿美元的承诺，并最终以 2 亿美元的价格成交。 “这是我们的第四次或第五次筹款，但我们以前从未有过这种兴趣——我们甚至在五天内就有了我们的条款清单，”他补充道。 “我相信这种兴趣是因为我们成功地创建了一个受到严格监管的全球平台，这使我们能够访问许多网络。这是一个支付可见的环境，我们的核心是推动无摩擦的商业，让任何人都可以使用我们的平台。” Nium 的新一轮融资助长了许多公司的共同火力，这些公司都在追逐每年价值 120 万亿美元的全球 B2B 支付市场：上周，Paystand 在 C 轮融资中筹集了 5000 万美元，使 B2B 支付无现金化，而 Dwolla 筹集了 2100 万美元其 API 允许公司构建和促进快速支付。 3 月，Higo 带来了 330 万美元在拉丁美洲做同样的事情，而 Balance 则开发了一个 B2B 支付平台，允许商家提供多种支付方式。 2 月份筹集了 550 万美元。 Nium 的方法是通过单一 API 提供对全球支付基础设施的访问，包括发卡、应收账款和应付账款以及银行即服务。纳努说，该公司的网络使客户能够将资金发送到 100 多个国家/地区，以 60 多种货币支付，以 7 种货币接受资金并在 40 多个国家/地区发行卡。该公司还在 11 个司法管辖区拥有汇款、发卡和银行牌照。 Riverwood 的联合创始合伙人兼管理合伙人弗朗西斯科·阿尔瓦雷斯-德马尔德 (Francisco Alvarez-Demalde) 在一封电子邮件中表示，软件和监管许可证的结合以及代表新银行和企业运营金融科技基础设施平台是一种全球趋势，正在经历高速增长。\nRiverwood 跟随 Nium 多年，它的未来愿景使该公司有兴趣参与这一轮。 Alvarez-Demalde 表示：“Nium 拥有巨大的市场机会、才华横溢的创始人和团队的令人难以置信的组合，我们相信该公司已准备好基于潜在的长期技术趋势（如提高实时支付能力和跨境贸易。 “作为一个 API 中的中央支付基础设施，Nium 是一种催化剂，通过本地市场许可证、合作伙伴和银行关系网络，解锁跨境支付、本地账户和卡发行，以促进资金在世界各地的转移，”他补充道。 “各种类型的企业都将金融服务作为其消费者体验的一部分，而 Nium 是这一趋势的关键全球推动者。” Nanu 表示，新的资金使公司能够搬到美国，这占 Nium 收入的 3%。他希望在接下来的 18 个月内将这一比例提高到 20%，并在拉丁美洲进行扩张。这项投资还为公司提供了 12 到 18 个月的时间进行进一步的并购活动。 6 月，Nium 收购了虚拟卡发行公司 Ixaris，并于 7 月收购了 Wirecard Forex India，以将其暴露于印度市场。他还计划扩展公司的支付网络基础设施，投资产品开发并增加 Nium 的 700 人员工人数。 Nium 已经将数百家企业公司视为客户，并计划在明年再加入数千家公司。该公司每年处理 80 亿美元的付款，自 2015 年以来已发行超过 3000 万张虚拟卡。与此同时，收入同比增长超过 280%。纳努说，所有这些增长都使公司走上了首次公开募股的轨道。他已经与将帮助公司在 2022 年第一季度正式开始这一旅程的人进行了交谈。“与其他为新产品筹集资金的公司不同，我们的目标是扩大我们现有的业务范围，”纳努说. “美国是一个新的市场，但我们有一个很好的品牌，将利用新一轮为客户提供更好的体验。”", "note_en": "The company, now Singapore-based but shifting to the Bay Area, touted the investment as making it “the first B2B payments unicorn from Southeast Asia.”\n Riverwood Capital led the round, in which Temasek, Visa, Vertex Ventures, Atinum Capital, Beacon Venture Capital and Rocket Capital Investment participated, along with a group of angel investors like DoorDash’s Gokul Rajaram, FIS’ Vicky Bindra and Tribe Capital’s Arjun Sethi. Including the new funding, Nium has raised $300 million to date, Prajit Nanu, co-founder and CEO, told TechCrunch.\n  The B2B payments sector is already hot,  yet underpenetrated, according to some experts. To give an idea just how hot, Nium was seeking $150 million for its Series D round, received commitments of $300 million from eager investors and settled on $200 million, Nanu said.\n “This is our fourth or fifth fundraise, but we have never had this kind of interest before — we even had our term sheets in five days,” he added. “I believe this interest is because we’ve successfully managed to create a global platform that is heavily regulated, which gives us access to a lot of networks. This is an environment where payment is visible, and our core is powering frictionless commerce and enabling anyone to use our platform.”\n Nium’s new round adds fuel to a fire shared by a number of companies all going after a  global B2B payments market valued at $120 trillion annually: last week, Paystand raised  $50 million in Series C funding to make B2B payments cashless, while Dwolla  raised $21 million for its API that allows companies to build and facilitate fast payments. In March, Higo  brought in $3.3 million to do the same in Latin America, while Balance, developing a B2B payments platform that allows merchants to offer a variety of payment methods.  raised $5.5 million in February.\n  Nium’s approach is to provide access to a global payment infrastructure, including card issuance, accounts receivable and payable, and banking-as-a-service through a single API. The company’s network enables customers to then send funds to more than 100 countries, pay out in more than 60 currencies, accept funds in seven currencies and issue cards in more than 40 countries, Nanu said. The company also boasts money transfer, card issuances and banking licenses in 11 jurisdictions.\n Francisco Alvarez-Demalde, co-founding partner and managing partner at Riverwood, said in an email that the combination of software — plus regulatory licenses — and operating a fintech infrastructure platform on behalf of neobanks and corporates is a global trend experiencing hyper-growth.\n Riverwood followed Nium for many years, and its future vision was what got the firm interested in being a part of this round. Alvarez-Demalde said that “Nium has the incredible combination of a great market opportunity, a talented founder and team, and we believe the company is poised for global growth based on underlying secular technology trends like increasing real-time payment capabilities and the proliferation of cross border commerce.\n “As a central payment infrastructure in one API, Nium is a catalyst that unlocks cross-border payments, local accounts and card issuance with a network of local market licenses, partners and banking relationships to facilitate moving money across the world,” he added. “Enterprises of all types are embedding financial services as part of their consumer experience, and Nium is a key global enabler of this trend.”\n Nanu said the new funding enables the company to move to the United States, which represents 3% of Nium’s revenue. He wants to increase that to 20% over the next 18 months, as well as expand in Latin America. The investment also gives the company a 12- to 18-month runway for further M&amp;A activity.  In June, Nium  acquired virtual card issuance company Ixaris, and in July  acquired Wirecard Forex India to expose it to India’s market. He also plans to expand the company’s payments network infrastructure, invest in product development and add to Nium’s 700-person headcount.\n Nium already counts hundreds of enterprise companies as clients and plans to onboard thousands more in the next year. The company processes $8 billion in payments annually and has issued more than 30 million virtual cards since 2015. Meanwhile, revenue grew by over 280% year over year.\n All of this growth puts the company on a trajectory for an initial public offering, Nanu said. He has already spoken to people who will help the company formally kick off that journey in the first quarter of 2022.\n “Unlike other companies that raise money for new products, we aim to expand in the existing sets of what we do,” Nanu said. “The U.S. is a new market, but we have a good brand and will use the new round to provide a better experience to the customer.”", "posttime": "2021-07-27 11:56:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "singapore", "title": "Nium 是一家总部位于新加坡的 B2B 支付公司，以 1B 美元以上的估值筹集了 2 亿美元的 D 轮融资，由 Riverwood Capital 领投，淡马锡、Visa 和其他公司参与其中", "title_en": "Nium, a Singapore-based B2B payments company, raises $200M Series D at a $1B+ valuation led by Riverwood Capital, with Temasek, Visa, and others participating", "transed": 1, "url": "https://techcrunch.com/2021/07/26/nium-crosses-1b-valuation-with-200m-riverwood-capital-led-round/", "via": "", "real_tags": ["singapore"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069949, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Outline 是一项用于阅读和注释新闻文章的免费服务。我们消除了混乱，以便您可以分析和评论内容。", "note_en": "Outline is a free service for reading and annotating news articles. We remove the clutter so you can analyze and comment on the content.", "posttime": "2021-07-27 11:18:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "特斯拉,前所未有,tops,评论", "title": "特斯拉利润突破 10 亿美元； “公众对电动汽车的情绪和支持似乎处于前所未有的拐点，”", "title_en": "Tesla tops $1 billion in profit; “Public sentiment and support for electric vehicles seems to be at a never-before-seen inflection point,”", "transed": 1, "url": "https://outline.com/jpHEk7", "via": "", "real_tags": ["特斯拉", "前所未有", "tops", "评论"]}, {"category": "", "categoryclass": "", "imagename": "134f1a00823e4c1e52e34bc3f66f9317.jpg", "infoid": 1069948, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我一直想赚很多钱，让人们关注我，做很多令人兴奋的事情。我只是不知道怎么做。我的许多创办自己公司的朋友告诉我，他们小时候是如何表现出企业家精神的——他们从背包里卖糖果，在夏天做园艺生意等等。他们创造了价值，学习了努力的美德。早点工作。但那不是我。我在曼哈顿海滩中学的电脑教室用 Applesoft BASIC 创建了一个赛马模拟游戏，并经营了一个小型赌博业务。我的意思是，谁能怪我？老师们在课间休息和午餐时完全无人看管，好像他们无法理解任何孩子怎么会在玩那些大型计算型打字机时遇到麻烦。然而，花几美元购买源源不断的 Atari 游戏并学习如何从更大的 8 年级学生那里收集并没有教会我任何关于建立一家科技公司的知识。当我决定搬到旧金山时，我已经完全无能为力了。同样糟糕的是我的时间感。当我进入就业市场时，互联网泡沫已经破灭，数十名聪明人失业，一波风险投资公司破产。很多人离开湾区回到他们来自的地方，但我太愚蠢了，不知道人们做出的合乎逻辑的决定。我所在的折扣经纪公司为我们提供了为期两周的培训，内容是如何在他们位于圣地亚哥的呼叫中心进行在线股票交易。那时我有了我的绝妙主意（除非我更改了几次才证明它很出色）。负责监督我们培训的呼叫中心经理已经 20 多岁了，他的脸上每天都挂着得意的笑容。 “我教你的这个呼叫中心系统每人要花费 30,000 美元，”他多次提到。他笑得很开心，我很鄙视他。\n我突然想到，如果我能开发出更便宜的呼叫中心软件，我就可以创建自己的软件公司——并报复 The Smirker。星星一定是在为我对齐，因为此后不久，我的大学室友，我昵称他为“The Fro”（我给所有我深爱的人都起了昵称），打电话告诉我（吹嘘）呼叫中心软件他工作的初创公司被思科收购。他承认，作为一名后期员工，他并没有赚到多少，但他对可能的东西有所了解，并鼓励我飞往波士顿讨论创建我们自己的创业公司。 “毕竟，”他说，“你很擅长卖狗屎。”我不确定这是恭维，但我买了机票。经过一个周末讨论梦想和男人的感觉后，我们彼此都很兴奋，决定在下周一辞去工作。我给了我两周的通知。然后奇怪的事情发生了。那个星期一一整天都不接我电话。星期三，他终于给我打电话，害羞地说：“Boooo。你知道什么兄弟吗？我决定现在辞职对我来说不是一个好主意。严重地。我很抱歉。”我的银行账户里有 5,000 美元，我认真地想过花 1,000 美元只是为了飞回波士顿打他的脸。相反，我挂了电话，敲了敲墙。也许几次。\n然后我给他回电，尽可能冷静地问他，他是否知道他新收购的初创公司中还有其他人可能想和我一起创建一家软件公司。我提醒他我很擅长卖狗屎。他向我介绍了“Tooter”，结果证明他正带我去 Tahoe 去滑雪。当我们在天堂滑雪胜地见面时，我发现了一个明显聪明的家伙，他不喜欢公司生活，并且对在加利福尼亚州可能不完全合法的活动有着肆无忌惮的感情。但是，嘿，我们都有问题。他向我解释说，他和 The Fro 曾在一家为呼叫中心开发软件的初创公司工作，他们通过在公司名称中添加 .com 彻底改变了这个古老的行业。因为我现在是一名企业家（失业），我告诉他我们应该重新创建那种软件，他同意了。值得称赞的是，让我有些惊讶的是，他给他的老板发了一封电子邮件，并在那天晚上辞职了。几周后，他卖掉了他在波士顿的房子，并在湾区买了一套新的。但让他成为如此冒险者和出色程序员的原因有时也让他成为了一个超级混蛋。对软件公司一无所知，我的许多问题都遇到了他自己的问题，他最喜欢的是，“你他妈的白痴吗？”独自度过了那么多令人沮丧的夜晚，我经常会无意识地一遍又一遍地看我最喜欢的电影《肖申克的救赎》。也许看到 Andy Dufresne 忍受如此多的痛苦让我对自己的处境感觉更好。显然，我需要帮助（治疗），所以我问我在折扣经纪公司的前老板是否知道任何天使投资人。\n谢天谢地，他向我介绍了他最喜欢的日间交易客户，并向他解释说我是一个很有前途的企业家，图特是一位了不起的工程师，他绝对是。我尽可能热情地向投资者解释说，我要么建立一家成功的软件公司，要么尝试死亡，而且我要自我保护，所以…… 日内交易员指着他办公室墙上的一架小型喷气式飞机的照片说：“我要你帮我买这个。”然后他当场给我们开了一张 15 万美元的支票，我们得到了正式的资助。然后我们聘请了“机器”（工程师 #2），我和他一起搬进了旧金山双峰附近的一间公寓，主要是为了我可以日夜骚扰他编程。当我的两个工程师构建了我们的呼叫中心软件的测试版时，我开始拨通电话，向呼叫中心所有者推销更便宜的东西。在打了 2000 多个电话之后，我终于在另一条线路上听到了一个接听的声音。乔在犹他州普罗沃拥有一家规模虽小但很成功的呼叫中心。他说我虚张声势，说他知道我们还没有任何坚固的东西，但他相信我们可以建造它——但它必须是我给他报价的一半。这就是我学到的关于创业的早期教训，或者它可能是美国本身的教训。在被拒绝了这么多次之后，我想拒绝自己，但后来找到了一个即使在经济衰退期间也会给我寄一张 40,000 美元支票的人，因为他们本身就是冒险的企业主。这让我意识到美国对企业家来说是一个神奇的地方。甚至是无知的人。有了那张 40,000 美元的支票，我们从折扣经纪公司聘请了我的前任老板，从被思科收购的呼叫中心初创公司聘请了一名销售代表，我们五个人去核桃溪的一个小办公室工作。\n我们开始运送装有 Dialogic 电话板的戴尔机器，里面装有我们的呼叫中心软件。它并不性感，但足以支撑我们雇用更多人并开始发展。与其构建软件加载到廉价服务器上并像其他人一样销售，为什么不构建一个我们自己托管的“大型服务器”，让人们通过网络租用功能？我的前老板告诉我，“不，那太愚蠢了，这是在杀死金鹅。”工程师告诉我，“不，这会很麻烦。”他们向我发送了来自知名分析师的各种研究，表明“ASP”（被“SaaS”取代之前的流行语）毕竟不是一种有利可图的商业模式。我说：“伙计们，还有什么选择？你想在你的余生中成为这些垃圾箱的低成本领导者吗？”我指着我们小办公室里越来越多的戴尔盒子。与他们激烈争论了一个月，我意识到按需软件服务没有利润，因为每个人都只是试图采用传统的客户端 - 服务器软件并自己托管它。他们没有想过要构建真正的多租户的东西，这意味着构建专门用于将多个客户和帐户作为服务处理的软件。如果我们能够实现它，那对我们来说将是一个关键优势，因为它需要购买的硬件显着减少，并且更容易管理客户帐户。\n但还有另一个问题。与我们的 150,000 美元相比，该领域的少数其他初创公司总共筹集了超过 1 亿美元，而且他们正在领先。就像，前进的道路。然后有一天 The Machine 给了我一个 IP 语音电话盒让我玩。我们都喜欢小工具，我们只是觉得能够通过互联网免费拨打长途电话真是太酷了。就在那时，我遇到了 Eureka 2.0 时刻——我们的竞争对手拥有需要大量硬件和运营支持来大规模服务客户的单租户解决方案，但他们也不得不将客户的长途话费翻倍。由于 SaaS 呼叫中心产品必须为每个呼叫中​​心座席提供三个持续的电话连接（而在内部部署模型中则是传统的两个），因此它消耗了客户迁移到 SaaS 时所节省的大部分成本。基于 IP 语音的服务将为我们带来另一个巨大的市场优势，因为客户实际上可以降低他们的电话费。很少有人考虑多租户和 IP 语音，但我终于开始寻找线索。我有幸获得了图特、机器和我的前任老板的好运，他们最终以他们可观的超能力团结在我的愿景周围。直到今天，我都非常感谢他们每个人。对我来说，那个“决定性的一天”是在 Safeway 杂货店（我经常担心借记卡被退回），当时 The Machine 用我的黑莓手机给我打电话。 “伙计，伙计，伙计。猜猜我从哪里打来的电话？”机器问道。\n“呃，我们的公寓？”我开始在收银台阅读《人物》杂志的封面。布列塔尼斯皮尔斯正在和一个新人约会。 “是的，”机器兴奋地说，“但这是我从我们的 IP 语音堆栈中进行的第一个调用。听起来不错，对吧？”我双膝跪地，简直是被打倒了。我们仍然面临着如此多的障碍，我知道这一点，但在那一刻，也是有史以来第一次，我对我们将粉碎它充满信心。竞争者，怀疑者，每个人。我们打算摧毁这个行业，然后以我们自己的形象重塑它。这就是我们曲棍球棒曲线的真正开始。我们终于找到了一种方法来提供一种更好 10 倍且便宜 5 倍的产品。我接到第一个 IP 语音电话的 Safeway Express Checkout 线路让我想起了《肖申克的救赎》中的那个场景，主角爬过数英里的污水管，然后终于能够挣脱了。不久之后，我们正式上线（新建网站）“虚拟呼叫中心”，业务持续高速增长。我们的竞争对手大多没有回复我之前的电子邮件，询问我是否可以在城里给他们买午餐，他们突然对我们的价格如此之低感到震惊。具有讽刺意味的是，我们最终成为了低成本的领导者，这是我们可以做到的，因为我们的内在成本要低得多。我们从信任我们的大公司那里获得了大量风险投资，最后，一个伟大的办公空间给所有人留下了深刻的印象，除了我父亲——他一直问我为什么还不是医生。\n第一年我们的收入为 0 美元，第二年为 90 万美元，第二年为 300 万美元。在我离开之前，我带领公司每年的经常性收入达到了 1000 万美元。事实是，公司已经成为自己的实体，不再需要我了。今天，我命名为 Five9 的公司在纳斯达克股票市场交易，雇佣了数百名加州湾区人，首次公开募股使该公司在开业当天的估值达到 3.5 亿美元。每当我致电使用我的软件的公司呼叫中心时，我都会忍不住微笑。直到我被搁置超过两分钟。我不确定我是否对其他企业家有任何明智的建议，但从这次经历中我确实学到了一个重要的真理。也就是说，您不必是常春藤盟校毕业生（我不是）或有很多钱（我们没有）。你只需要相信自己反对所有合理的逻辑，尽管听起来很陈腐。相信即使你做了一些愚蠢的事情，比如毫无头绪地辞职，但无论如何你都会弄清楚的。相信在经历了多年监狱般的辛劳创业生活之后，你会从数英里的污水管道中冒出来，感受雨水冲刷掉你脸上的垃圾。你会带着一袋钱消失在墨西哥的海滩上，与你的同谋见面并喝玛格丽塔酒。", "note_en": "I’ve always wanted to make a lot of money, have people pay a lot of attention to me and do a lot of exciting things. I just never knew how.\n Many of my friends who are founders of their own companies tell me how they exhibited the entrepreneurial spirit as a kid — they sold candy out of their backpacks, had a landscaping business during the summer, etc. They  created value and learned the virtues of hard work early on.\n But that wasn’t me. I  created a horse-racing simulation game in Applesoft BASIC in Manhattan Beach Middle School’s computer classroom and ran a small gambling operation. I mean, who could blame me? The teachers left that class completely unattended during recess and lunch, as if they couldn’t fathom how any kid could get into trouble playing with those large calculating typewriters.\n However, making a few dollars to buy an endless stream of Atari games and learning how to collect from the bigger 8th graders didn’t teach me anything about building a tech  company. By the time I decided to move to San Francisco, I was completely and totally clueless.\n Just as bad was my sense of timing. By the time I entered the job market the dot-com bubble had burst, leaving scores of smart people unemployed and a wave of VC firms bust. A lot of people were leaving the Bay Area to go back to wherever they had come from, but I was too stupid to know anything about the logical decisions people made.\n The discount brokerage firm where I clerked gave us all two weeks of training in how to execute online stock trades at one of their call centers in San Diego. That’s when I had my brilliant idea (except it didn’t turn out to be brilliant until I changed it a few times).\n The call center manager who monitored our training was in his late twenties and had a smug grin on his face all day, every day. “This call center system I’m teaching you costs $30,000 a person,” he mentioned, several times. He smirked a lot and I despised him.\n It struck me that if I could build cheaper call center  software, I could make my own  software  company — and have revenge on The Smirker.\n The stars must have been aligning for me because shortly thereafter, my college roommate, who I nicknamed “The Fro” (I give nicknames to everyone for whom I have a deep affection), called to tell me (brag) that the call center  software startup he worked for had been acquired by Cisco.\n He hadn’t made much as a late-stage employee, he admitted, but he had a taste for what could be, and encouraged me to fly to Boston to discuss creating our own startup. “After all,” he said, “you’re good at selling shit.”\n I wasn’t sure that was a compliment, but I bought the plane ticket.\n After a weekend of discussing dreams and man-feelings, we got each other excited enough to decide to quit our jobs the following Monday. I gave my two weeks notice.\n  Then something odd happened. The Fro wouldn’t answer my calls all day that Monday.   On Wednesday he finally called me and said sheepishly, “Brooo. You know what Bro? I decided that it’s not a good idea for me to quit my job right now. Seriously. I’m so sorry.”\n I had $5,000 in my bank account, and I seriously thought of spending $1,000 of it just to fly back to Boston to punch him in the face. Instead, I hung up the phone and punched the wall. Maybe a few times.\n Then I called him back and asked him, as calmly as I could, if he knew of anyone else at his newly acquired startup that might want to create a  software  company with me. I reminded him that I was good at selling shit. He introduced me to “Tooter,” who, it turned out, was heading my way to go snowboarding in Tahoe.\n When we met at Heavenly Ski Resort I discovered an obviously brilliant guy who disliked corporate life and had an unbridled affection for activities that may not have been fully legal in the state of California. But hey, we all had issues.\n He explained to me that he and The Fro had worked at a startup that  created  software for call centers, an ages-old industry they had revolutionized by adding a .com to the name of the  company.\n Because I was an entrepreneur (unemployed) now, I told him that we should just recreate that class of  software, and he agreed. To his credit, and somewhat to my amazement, he sent an email to his boss and quit that night. A few weeks later he sold his house in Boston and bought a new one in the Bay Area.\n But what made him such a risk taker and brilliant programmer also made him a supreme asshole at times.  Knowing  nothing about  software companies, many of my questions were met with a question of his own, his favorite being, “Are you a fucking idiot?”\n There were so many depressing nights alone that often I would watch my favorite movie, The Shawshank Redemption, over and over, mindlessly. Maybe seeing Andy Dufresne enduring so much shit made me feel better about my own situation.\n Clearly, I needed help (therapy), so I asked my former boss at the discount brokerage firm if he knew of any angel investors.\n Thankfully, he introduced me to his favorite day-trader client and explained to him that I was a promising entrepreneur and that Tooter was an amazing engineer, which he absolutely was. I explained to the investor as passionately as I could that I was going to build a successful  software  company or die trying, and that I was into self-preservation, so…\n The day trader pointed to a picture of a small jet on his office wall and said, “I want you to help me buy this.” He then wrote us a check for $150,000 on the spot, and we were officially funded.\n We then hired “The Machine” (Engineer #2) and I moved in with him into an apartment in the Twin Peaks neighborhood of San Francisco, mostly so I could harass him into programming day and night. And as my two engineers built a beta version of our call center  software, I started dialing for dollars and calling call center owners with the pitch and promise of something cheaper.\n  After what must have been more than 2,000 cold calls, I finally reached a receptive voice on the other line. Joe owned a small but successful call center in Provo, Utah. He called my bluff and said that he knew we didn’t have anything solid yet, but he trusted we could get it built — but it had to be half the price I quoted him.\n And that’s the early lesson I learned about entrepreneurship, or maybe it was a lesson in America itself. That after so many rejections, I wanted to reject myself, but then found someone who would mail me a check for $40,000, even during a recession, because they were risk-taking business owners themselves.\n It made me realize that America was a magical place for entrepreneurs. Even the clueless ones.\n With that $40,000 check we hired my former boss from the discount brokerage firm, hired a sales rep from the call center startup that had been acquired by Cisco and the five of us went to work in a small office in Walnut Creek.\n We started shipping Dell machines with a Dialogic telephony board inside loaded with our call center  software. It wasn’t sexy, but it sustained us enough to hire a few more people and start growing.\n  Instead of building  software to load on cheap servers to sell like everyone else, why not build one “mega-server” that we host ourselves and let people rent the functionality over the web?\n My former boss told me, “No, that’s stupid, that’s killing the Golden Goose.”\n The engineers told me, “No, that’s going to be a pain in the ass to build.” They sent me all sorts of studies from reputable analysts showing that “ASPs” (the buzzword before it was replaced by “SaaS”) was not a profitable business model after all.\n I said, “Guys, what’s the alternative? You want to be the low-cost leader for the rest of your lives hustling these shit-boxes?” I pointed to the growing pile of Dell boxes accumulating in our small office.\n Arguing vehemently with them for a month, I realized that on-demand  software services weren’t profitable because everyone had just tried to take traditional client-server  software and host it themselves.\n  They hadn’t thought to build something that was truly multi-tenant, meaning building  software that was solely designed to handle multiple clients and accounts as a service. That would be a critical advantage for us, if we could pull it off, as it was significantly less hardware to purchase and much easier to manage customer accounts.\n But there was another problem. A handful of other startups in this space had collectively raised more than $100  million dollars, compared to our $150,000, and they were pulling ahead. Like, way ahead.\n Then one day The Machine gave me a Voice Over IP telephony box to play with. We both loved gadgets and we just thought it was so cool to be able to make long distance calls for free over the Internet.\n And that’s when my Eureka 2.0 moment hit me — our competitors had single-tenant solutions requiring massive amounts of hardware and operational support to service customers at scale, but they also had to double their customers’ long distance bills.\n Because a SaaS call center product has to have three phone connections ongoing per each call center agent (versus the traditional two in an on-premise model), it ate into much of the cost savings a customer would experience moving to SaaS. A service based on Voice Over IP would give us another tremendous advantage in the marketplace, as customers could actually lower their phone bills.\n Few others were thinking about multi-tenancy and Voice Over IP, but I was finally starting to buy clues. And I had the good fortune of Tooter, The Machine and my former boss eventually rallying around my vision with their considerable super powers. To this day, I’m so thankful for each of them.\n That “fateful day” for me was at a Safeway grocery store (where I would often worry about my debit card bouncing) when The Machine called me on my BlackBerry.\n “Dude, dude, dude. Guess where I’m calling from?” The Machine asked.\n “Uh, our apartment?” I started reading the cover of People magazine in the checkout line. Brittany Spears was dating someone new.\n “Yeah,” said The Machine excitedly, “but this is the first call I’m making from our Voice Over IP stack. Sounds fucking good, right?”\n I dropped to my knees, literally floored. We faced so many obstacles still, I knew that, but at that moment, and for the first time ever, I felt supremely confident that we were going to crush it. The competitors, the doubters, everyone. We were going to destroy the industry, then reinvent it in our own image.\n And that’s really how the curve in our hockey stick began. We finally figured out a way to deliver a product that was 10x better and 5x cheaper.\n That Safeway Express Checkout line where I got our first Voice Over IP call reminded me of that scene in The Shawshank Redemption where the main character crawls through miles of sewage pipe before finally being able to break free.\n Shortly afterwards, we officially launched (built a new website) “The Virtual Call Center” and our business kept growing at an increasingly rapid pace. Our competitors, most of whom had not replied to my previous emails asking if I could buy them lunch in the city, were suddenly stunned at how low our prices were.\n  Ironically, we did end up being the low-cost leader, something we could do because our intrinsic costs were so much lower. We got substantial VC funding from great firms who believed in us and, finally, a great office space that impressed everyone except my father  — who kept asking me why I wasn’t a doctor yet.\n The first year we had done $0 in revenues, the next year $900,000 and the next year $3 million. I led the  company to $10 million in annually recurring revenues before I departed.  The truth was, the  company had become its own entity and didn’t need me anymore.\n Today, the  company I named  Five9 is traded on the NASDAQ stock market and employs hundreds of Bay Area Californians, with an IPO that gave the  company an opening day valuation of  $350  million dollars. Whenever I call into a corporation’s call center that’s using my  software, I can’t help but smile. Until I’m on hold for longer than two minutes.\n I’m not sure if I have any sage advice for other entrepreneurs, but out of this experience I did learn one important truth. Namely, you don’t have to be an Ivy League graduate (I’m not) or have a lot of money (we didn’t). You just have to believe in yourself against all reasonable logic, as trite as that sounds.\n Believe that even if you do something stupid like quit your job without a clue, somehow you’re going to figure it out. Believe that after enduring years of the prison-like toil entrepreneurial life can be, you will emerge from miles of sewage pipes to feel the rain wash the crap off your face.\n And that you will disappear to a beach in Mexico with a bag full of money, meet up with your co-conspirators and have margaritas.", "posttime": "2021-07-27 11:08:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,software", "title": "我创建了一家价值 3.5 亿美元的软件公司，对软件一无所知", "title_en": "I Created a $350M Software Company Knowing Nothing About Software", "transed": 1, "url": "https://techcrunch.com/2015/12/26/how-i-created-a-350m-software-company-knowing-nothing-about-software/", "via": "", "real_tags": ["软件", "software"]}]