[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1004365, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "任何新的冒险都是有风险的。不幸的是，我们已经建立了一套关于创办公司的规范，这意味着创始人不参与这个游戏是很常见的。通过筹集风投资金，创始人们在游戏中牺牲了自己的皮肤，换取了跑道。这使得做出好的决策变得更加困难，导致公司失败(通常是缓慢的)。我并不是说从来没有理由接受外部投资。显然是有的。但是，我们应该认识到，这样做会带来重大的权衡和困难，这意味着这不一定是违约。\n新的企业(由于是新的)基于一系列未经检验的假设，这些假设使它们变得脆弱。当你开始做某事时，你的首要任务应该是要么消除这种脆弱性(通过消除风险)，要么迅速失败1。最有效的方法是参与其中(即在做出重大决策时要有可衡量的风险)。\n我们通过修修补补，通过试错，通过经验，以及时间的运转，换句话说，与地球接触而获得的知识，比通过推理…获得的知识要好得多。2个。\n通过筹集资金，你会觉得你的公司不那么脆弱了。你现在可以给你的员工发工资了，也付得起一间漂亮办公室的房租了。然而，你真正拥有的是在你真正建立公司之前拥有一家公司的奢侈(和责任)。这使得做决定变得更加困难，因为你和你的团队不再“与地球接触”。你已经放松了对一个特别重要的约束的控制：时间。时间起着强迫我们做出更好的决定和更实际的权衡的作用。现在你有时间了，你可能更难像本来可以做到的那样无情地安排优先事项了。归根结底，更容易失去重点，因为你已经在你自己和现实之间制造了距离，你(还没有)拥有一个可持续的商业模式。\n由游戏中没有皮肤的人设计的东西往往会变得更加复杂(在他们最终崩溃之前)3。\n另一种选择是放弃筹集资金，从一开始就创建一个可持续的企业，随着为你的产品提供资金的人数的增加而线性增长。这确保了你成长的唯一途径是解决客户问题，他们会给你钱来解决这些问题。这意味着你的激励与你客户的激励是完全一致的4。不仅如此，而且因为你没有资金池的安全网，你被迫寻找实现可持续增长的最快途径。你现在别无选择，只能无情地专注于影响你底线的事情(即付账)。当你实际上只是在原地踏步时，常常会觉得你在降低风险方面取得了进展。5.当你再也付不起账单的时候，有份参与这个游戏就非常清楚地表明了这一点。\n这一模式更加清晰地反映了现实。事实是，你的生意只会和愿意付钱给你的客户数量一样好。为什么不把这作为你决策的基础呢？\n如果您的激励措施与您的客户保持一致，则有助于确保在您成长的过程中，无论您创建什么，都会对您的客户保持公平。\n↩", "note_en": "Any new venture is risky. Unfortunately, we have created a set of norms around starting a company that mean it is common for founders not to have skin in the game. By raising VC capital, founders trade their skin in the game for runway. This makes it more difficult to make good decisions, leading companies to fail (often slowly). I’m not suggesting that there are never reasons to take outside investment. Obviously there are. But, we should recognise that doing so comes with significant trade-offs and difficulties that mean it shouldn’t necessarily be the default.\n New ventures are (by virtue of being new) based on a set of untested assumptions that make them fragile. When starting something, your highest priotity should be to either remove this fragility (by removing risks), or to fail fast  1. The most effective way to do this is by having skin in the game (i.e. to have measurable risk when making a major decision).\n The knowledge we get by tinkering, via trial and error, experience, and the workings of time, in other words, contact with the earth, is vastly superior to that obtained through reasoning…   2\n By raising money, it can feel as though you’re making your company less fragile. You can now pay your employees a salary and afford to pay the rent on a nice office. However, what you actually have is the luxury (and responsibility) of having a company before you’ve actually built it. This makes it more difficult to make decisions because you and your team are no longer in  “contact with the earth”. You’ve loosened the grip of a particularly important constraint: time. Time acts as a forcing function for us to make better decisions and more practical trade offs. Now that you have time, it can be harder to prioritise as ruthlessly as it otherwise could have been. Ultimately, it’s easier to lose focus because you’ve created distance between yourself and the reality that you don’t (yet) have a sustainable business model.\n Things designed by people without skin in the game tend to grow in complication (before their final collapse)   3\n The alternative is to forgo raising money and creating a sustainable business from the beginning, growing linearly with the number of people that give you money for your product. This ensures that the only way for you to grow is by solving customer problems that they will give you money to solve. It means that your incentives are squarely aligned with that of your customers  4. Not only that, but because you don’t have the safety net of a pool of money, you are forced to find the fastest path to sustainable growth. You now have no choice but to be ruthlessly focused on the things that impact your bottom line (i.e. pay the bills). It can often feel like you’re making progress de-risking something when you’re actually just treading water  5. Having skin in the game makes it abundantly clear when this is the case because you can no longer pay the bills.\n This model more clearly reflects reality. The truth is, you only ever have a business that is as good as the number of customers willing to pay you. Why not make this the foundation of your decision making?\n If your incentives are aligned with your customer it helps to ensure that whatever you create remains fair to your customers as you grow.\n ↩", "posttime": "2020-05-30 13:33:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "初创,shouldn,客户", "title": "初创企业不应该筹集资金", "title_en": "Startups Shouldn't Raise Money", "transed": 1, "url": "https://ensorial.com/2020/dont-raise-money/", "via": "", "real_tags": ["初创", "shouldn", "客户"]}, {"category": "", "categoryclass": "", "imagename": "c8a32a007dac50b545994ead72cf2ea3.jpg", "infoid": 1004364, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "薛定谔的猫并不是一个真正的实验，因此没有任何科学证明。薛定谔的猫甚至不是任何科学理论的一部分。薛定谔的猫只是一个教学工具，薛定谔用它来说明一些人是如何曲解量子理论的。薛定谔用猫构建了他的想象实验，以证明对量子理论的简单误解可能会导致与现实世界不符的荒谬结果。不幸的是，我们这个时代的许多科普工作者都欣然接受了薛定谔的猫的荒谬之处，并声称这才是世界真正运转的方式。\n在量子理论中，量子粒子可以同时存在于多个态的叠加态中，并在与其他粒子相互作用时塌陷为单一态。在量子理论正在发展的时候(1930年)，一些科学家从科学漂移到哲学领域，并声称量子粒子只有在有意识的观察者看来才会坍塌到单一的状态。薛定谔认为这个概念是荒谬的，并设计了他的思想实验，以阐明这种主张的荒谬而合乎逻辑的结果。\n在薛定谔的想象实验中，你把一只猫放在一个装有少量放射性物质的盒子里。当放射性物质衰变时，它会触发盖革计数器，导致毒物或爆炸释放出来，导致猫死亡。现在，放射性物质的衰变受量子力学定律的支配。这意味着原子开始于&#34；将要衰变和&#34；不会衰变的组合状态。如果我们将观察者驱动的想法应用到这种情况下，就没有有意识的观察者在场(一切都在一个密封的盒子里)，所以整个系统停留在这两种可能性的组合上。这只猫最终在同一时间既死了又活了。因为一只同时死亡和活着的猫的存在是荒谬的，在现实世界中不会发生，这个思维实验表明波函数崩溃不仅仅是由有意识的观察者驱动的。\n爱因斯坦在观察者驱动的想法中看到了同样的问题，并祝贺薛定谔的巧妙说明，他说，然而，这种解释被你们的放射性原子+盖革计数器+放大器+火药电荷+盒子里的猫的系统驳斥得最优雅，在这个系统的psi功能中，猫既活着，又被炸成了碎片。猫的状态是不是只有当物理学家在某个确定的时间调查情况时才会被创造出来？&#34；\n从那时起，有充分的证据表明波函数崩溃不仅仅是由有意识的观察者推动的。事实上，量子粒子产生的每一次相互作用都会使其状态崩塌。仔细分析表明，薛定谔猫实验在现实世界中的表现如下：一旦放射性原子与盖革计数器相互作用，它就会从非衰变/衰变状态崩塌成一个确定的状态。盖革计数器肯定被触发了，猫肯定被杀了。否则盖革计数器肯定不会被触发，猫肯定还活着。但这两种情况都不会发生。\n总而言之，量子态崩溃不仅仅是由有意识的观察者推动的，薛定谔的猫只是一种发明的教学工具，试图通过将观察者驱动的概念降为荒谬来使这一事实变得更加明显。不幸的是，我们这个时代的许多科普作家继续传播这样一种误解，即量子态(因此现实本身)是由有意识的观察者决定的。他们利用这个错误的主张作为跳板，进入关于现实、意识甚至东方神秘主义本质的非实质性和非科学的讨论。对他们来说，薛定谔的猫并不是一个令人尴尬的迹象，表明他们的说法是错误的，而是证明世界像他们所说的那样荒谬。这些作家要么误解了薛定谔的“猫”，要么故意歪曲它来卖书。", "note_en": "&#34;Schrodinger&#39;s Cat&#34; was not a real experiment and therefore did not scientifically prove anything. Schrodinger&#39;s Cat is not even part of any scientific theory. Schrodinger&#39;s Cat was simply a teaching tool that Schrodinger used to illustrate how some people were misinterpreting quantum theory. Schrodinger constructed his imaginary experiment with the cat to demonstrate that simple misinterpretations of quantum theory can lead to absurd results which do not match the real world. Unfortunately, many popularizers of science in our day have embraced the absurdity of Schrodinger&#39;s Cat and claim that this is how the world really works.\n  In quantum theory, quantum particles can exist in a superposition of states at the same time and collapse down to a single state upon interaction with other particles. Some scientists at the time that quantum theory was being developed (1930&#39;s) drifted from science into the realm of philosophy, and stated that quantum particles only collapse to a single state when viewed by a conscious observer. Schrodinger found this concept absurd and devised his thought experiment to make plain the absurd yet logical outcome of such claims.\n  In Schrodinger&#39;s imaginary experiment, you place a cat in a box with a tiny bit of radioactive substance. When the radioactive substance decays, it triggers a Geiger counter which causes a poison or explosion to be released that kills the cat. Now, the decay of the radioactive substance is governed by the laws of quantum mechanics. This means that the atom starts in a combined state of &#34;going to decay&#34; and &#34;not going to decay&#34;. If we apply the observer-driven idea to this case, there is no conscious observer present (everything is in a sealed box), so the whole system stays as a combination of the two possibilities. The cat ends up both dead and alive at the same time. Because the existence of a cat that is both dead and alive at the same time is absurd and does not happen in the real world, this thought experiment shows that wavefunction collapses are not just driven by conscious observers.\n  Einstein saw the same problem with the observer-driven idea and congratulated Schrodinger for his clever illustration,  saying, &#34;this interpretation is, however, refuted, most elegantly by your system of radioactive atom + Geiger counter + amplifier + charge of gun powder + cat in a box, in which the psi-function of the system contains the cat both alive and blown to bits. Is the state of the cat to be created only when a physicist investigates the situation at some definite time?&#34;\n  Since that time, there has been ample evidence that wavefunction collapse is not driven by conscious observers alone. In fact, every interaction a quantum particle makes can collapse its state. Careful analysis reveals that the Schrodinger Cat &#34;experiment&#34; would play out in the real world as follows: as soon as the radioactive atom interacts with the Geiger counter, it collapses from its non-decayed/decayed state into one definite state. The Geiger counter gets definitely triggered and the Cat gets definitely killed. Or the Geiger counter gets definitely not triggered and the cat is definitely alive. But both don&#39;t happen.\n  In summary, quantum state collapse is not driven just by conscious observers, and &#34;Schrodinger&#39;s Cat&#34; was just a teaching tool invented to try to make this fact more obvious by reducing the observer-driven notion to absurdity. Unfortunately, many popular science writers in our day continue to propagate the misconception that a quantum state (and therefore reality itself) is determined by conscious observers. They use this erroneous claim as a springboard into unsubstantial and non-scientific discussions about the nature of reality, consciousness, and even Eastern mysticism. To them, &#34;Schrodinger&#39;s Cat&#34; is not an embarrassing indication that their claims are wrong, but proof that the world is as absurd as they claim. Such authors either misunderstand Schrodinger&#39;s Cat, or purposely twist it to sell books.", "posttime": "2020-05-30 13:03:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "实验,cat,薛定谔", "title": "薛定谔的猫实验证明了什么？(2013)", "title_en": "What did Schrodinger's Cat experiment prove? (2013)", "transed": 1, "url": "https://wtamu.edu/~cbaird/sq/2013/07/30/what-did-schrodingers-cat-experiment-prove/", "via": "", "real_tags": ["实验", "cat", "薛定谔"]}, {"category": "", "categoryclass": "", "imagename": "68b4dd911b595496270c894e48dbaf09.jpeg", "infoid": 1004362, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近两项不相关的研究提出了同样的可能性：物理定律可能并不适用于所有地方，如果这是真的，将颠覆支撑了几个世纪的科学的思想。", "note_en": "Two unrelated studies recently raised the same possibility: the laws of physics might not apply everywhere, which, if true, would upend an idea underpinning centuries of science.", "posttime": "2020-05-30 13:02:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "无法解释,phenomena,研究", "title": "无法解释的现象不断表明宇宙不是我们想的那样", "title_en": "Unexplained phenomena keep suggesting the universe isn’t what we thought", "transed": 1, "url": "https://www.vice.com/en_uk/article/3azqq3/unexplained-phenomena-keep-suggesting-the-universe-isnt-what-we-thought", "via": "", "real_tags": ["无法解释", "phenomena", "研究"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004361, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "贡献者可以从两种软件许可中进行选择，一种是开放的、类似共享的许可，另一种是繁荣、非商业性许可，然后通过licsezero.com出售私有许可，用于封闭源代码或盈利。Licensezero.com将收益直接打入开发商的Strike账户。", "note_en": "Contributors can choose from two software licenses,  Parity, an open, share-alike license, and  Prosperity, noncommercial license, then sell private licenses through licensezero.com for use in closed source or for profit. licensezero.com sends the proceeds directly to developers’  Stripe accounts.", "posttime": "2020-05-30 13:02:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,货币化,monetizing,许可", "title": "许可证零货币化开源", "title_en": "License Zero – Monetizing Open Source", "transed": 1, "url": "https://licensezero.com/", "via": "", "real_tags": ["开源", "货币化", "许可"]}, {"category": "", "categoryclass": "", "imagename": "791b75687b7963f964cf8bbf32c530df.jpeg", "infoid": 1004359, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": ".bigTop__review{不透明度：0；}.bigTop__VideoPlayerBox{位置：绝对；}.bigTop__VideoPlayerBox--被动{宽度：100%；高度：100%；顶部：0；左侧：0；不透明度：0；/*z索引：-1；*/}.bigTop__VideoPlayerBox--回退{位置：相对；z索引：0；}.bigTop__VideoPlayerBox--。不透明度：1；z-index：1；}.bigTop__VideoPlayer{位置：相对；填充-底部：56.25%；}.bigTop__codeholder{显示：无；}.bigTop__幻灯片显示{光标：指针；位置：绝对；底部：0；右侧：0；背景色：#FFF；填充：10px；宽度：300px；}.bigTop__button{边框宽度：2px；边框样式：实心；font。文本转换：大写；字体大小：12px；字母间距：1px；光标：指针；页边距：0；填充：6px 15px；框大小：边框；过渡：颜色300ms，背景颜色300ms；}.bigTop_button--嵌入{背景：透明；颜色：#FFF；边距：30px自动20px；最小宽度：175px；边框颜色：#FFF；}.bigTop_button--嵌入：ho.。边框颜色：#333；背景颜色：#fff；}.bigTop__button--黑色：悬停{color：#fff；back-color：#333；}.bigTop__Button--内联{空边距：15px 0；}.bigTop__Atmotional{填充：0；边距：0；背景大小：1px 1px；背景位置：-1px-1px；}.bigTop__atomalic：空{paddingBottom：0；背景大小：1px 1px；背景位置：-1px-1px；}.bigTop__atumular：空{paddingBottom：}.bigTop__大气视频，.bigTop__大气img{宽度：100%；显示：块；填充：0；页边距：0；}/*终端媒体css*//*caption/credit*/.bigTop__captioncredit{显示：块；字体系列：&#34；视网膜&#34；，Helvetica，宋体，无衬线；颜色：#666；边距：5px auto 0；填充：0 10px；框大小：边框；}.bigTop__Caption{font-size：14px；line-high：20px；font-weight：300；display：inline；}.bigTop_Credit{font-size：14px；line-high：20px；font-weight：300；text-change：uppercase；display：inline；}/*结束字幕/信用*//*视频播放按钮*/.bigTop__play{宽度：50px；高度：50px；光标：指针；边框：1px#999实心；背景颜色：RGBA(0，0，0，0.7)；边框半径：50%；文本缩进：-9999px；显示：块；框大小调整。.bigTop__play，.bigTop__VideoPlayerBox：HOVER+.bigTop__PLAY--独立，.bigTop__PLAY--HOVER{背景颜色：#0080c3；边框颜色：#0080c3；}.bigTop__PLAY：之前{宽度：0；高度：0；边框-顶部：11px纯色透明；边框-底部：12px纯色透明；边框-左边：18px实体#fff；内容：&#34；}.bigTop__VideoTrigger{光标：指针；宽度：100%；高度：100%；位置：绝对；顶部：0；左侧：0；}.bigTop__play--独立{位置：绝对；顶部：50%；左侧：50%；Transform：TranslateY(-50%)TranslateX(-50%)；-webkit-Transform：TranslateY(-50%)TranslateX(-50%)；Pointer-Events：None；}/*视频按钮*//*/.bigTopPage_Grid{padding：0 10px；框大小：边框大小：边框；左页边距：自动；右页边距：自动；}/*结束页面网格**/*/.plitTop.bigTop__rel{背景颜色：#222；}.plitTop.bigTop__text，.plitTop.bigTop__flash，.plitTop.bigTop__flash：link，.plitTop.。}.plitTop.bigTop--lightTheme.bigTop__rel{Background-color：#fff；}.plitTop.bigTop--lightTheme.bigTop__text，.plitTop.bigTop--lightTheme.bigTop_flash，.plitTop.bigTop--lightTheme.bigTop__flash：link，.plitTop.bigTop--lightTheme.bigTop_hed，.plitTop.bigTop。}.拆分顶部.bigTop__overlay--Bottom，.plitTop.bigTop__overlay--顶部{背景：初始；}.拆分顶部.bigTop__media{浮动：右；宽度：50%；}.拆分顶部.bigTop__captionCredit{文本对齐：右；颜色：#666；}.拆分顶部.bigTop__text.bigTop__text--底部，.plitTop.bigTop__text.bigTop_text--变换：平移(-50%，-50%)；-webkit-Transform：翻译(-50%，-50%)；宽度：50%；最小高度：初始；填充：0 30px；}.edit-Japan.plitTop.bigTop__hed，.edit-Japan.plitTop.bigTop__dek{text-align：Left；}/*仅限4个单元*/@媒体(最大宽度：639px){.plitTop.bigTop__rel{paddingTop：15px；}.plititOnly(最大宽度：639px){.plitTop.bigTop__rel{padd-Bottom：15px；}.plititOnly。}.plitTop.bigTop__captionCredit{text-align：Left；color：#f4f4f4；}.plitTop.bigTop--lightTheme.bigTop__captionCredit{color：#666；}.plitTop.bigTop__text.bigTop__text--Bottom，.plitTop.bigTop__text.bigTop__text--Bottom{positi", "note_en": ".bigTop__preview { opacity: 0;}.bigTop__videoPlayerBox { position: absolute;}.bigTop__videoPlayerBox--passive { width: 100%; height: 100%; top: 0; left: 0; opacity: 0; /*z-index: -1;*/}.bigTop__videoPlayerBox--fallback { position: relative; z-index: 0;}.bigTop__videoPlayerBox--fallback .videoHint { display: none !important;}.bigTop__videoPlayerBox--active { width: 100%; height: 100%; top: 0; left: 0; opacity: 1; z-index: 1;}.bigTop__videoPlayer { position: relative; padding-bottom: 56.25%;}.bigTop__codeholder { display: none;}.bigTop__slideshow { cursor: pointer; position: absolute; bottom: 0; right: 0; background-color: #fff; padding: 10px; width: 300px;}.bigTop__button { border-width: 2px; border-style: solid; font-family: &#39;Retina&#39;, Helvetica, Arial, sans-serif; font-weight: 600; text-transform: uppercase; font-size: 12px; letter-spacing: 1px; cursor: pointer; margin: 0; padding: 6px 15px; box-sizing: border-box; transition: color 300ms, background-color 300ms;}.bigTop_button--embedded { background: transparent; color: #fff; margin: 30px auto 20px; min-width: 175px; border-color: #fff;}.bigTop_button--embedded:hover { color: #333; background-color: #fff;}.bigTop__button--black { color: #333; border-color: #333; background-color: #fff;}.bigTop__button--black:hover { color: #fff; background-color: #333;}.bigTop__button--inline { margin: 15px 0 0;}.bigTop__atmospheric { padding: 0; margin: 0; background-size: 1px 1px; background-position: -1px -1px;}.bigTop__atmospheric:empty { padding-bottom: 56.25%; background-color: #000; background-size: cover; background-repeat: no-repeat;}.bigTop__atmospheric video,.bigTop__atmospheric img { width: 100%; display: block; padding: 0; margin: 0;}/******** end media CSS *******//******************caption/credit********************/.bigTop__captioncredit { display: block; font-family: &#34;Retina&#34;, Helvetica, Arial, sans-serif; color: #666; margin: 5px auto 0; padding: 0 10px; box-sizing: border-box;}.bigTop__caption { font-size: 14px; line-height: 20px; font-weight: 300; display: inline;}.bigTop__credit { font-size: 14px; line-height: 20px; font-weight: 300; text-transform: uppercase; display: inline;}/******** end caption/credit ******//******** Video Play Button *********/.bigTop__play { width: 50px; height: 50px; cursor: pointer; border: 1px #999 solid; background-color: rgba(0, 0, 0, 0.7); border-radius: 50%; text-indent: -9999px; display: block; box-sizing: border-box;}.bigTop__videoPlayerBox:hover + .bigTop__text &gt; .bigTop__play,.bigTop__videoPlayerBox:hover + .bigTop__play--standalone,.bigTop__play--hover { background-color: #0080c3; border-color: #0080c3;}.bigTop__play:before { width: 0; height: 0; border-top: 11px solid transparent; border-bottom: 12px solid transparent; border-left: 18px solid #fff; content: &#34; &#34;; position: absolute; display: block; margin-top: 13px; margin-left: 18px;}.bigTop__videoTrigger { cursor: pointer; width: 100%; height: 100%; position: absolute; top: 0; left: 0;}.bigTop__play--standalone { position: absolute; top: 50%; left: 50%; transform: translateY(-50%) translateX(-50%); -webkit-transform: translateY(-50%) translateX(-50%); pointer-events: none;}/***** Video Button *****//********************Make bigTop align to page grid***********************/.bigTopPage__grid { padding: 0 10px; box-sizing: border-box; margin-left: auto; margin-right: auto;}/*** end page grid **//********************splitTop styling***********************/.splitTop .bigTop__rel { background-color: #222;}.splitTop .bigTop__text,.splitTop .bigTop__flash,.splitTop .bigTop__flash:link,.splitTop .bigTop__hed,.splitTop .bigTop__dek { color: #fff;}.splitTop.bigTop--lightTheme .bigTop__rel { background-color: #fff;}.splitTop.bigTop--lightTheme .bigTop__text,.splitTop.bigTop--lightTheme .bigTop__flash,.splitTop.bigTop--lightTheme .bigTop__flash:link,.splitTop.bigTop--lightTheme .bigTop__hed,.splitTop.bigTop--lightTheme .bigTop__dek { color: #000;}.splitTop .bigTop__overlay { background-color: transparent;}.splitTop .bigTop__overlay--bottom,.splitTop .bigTop__overlay--top { background: initial;}.splitTop .bigTop__media { float: right; width: 50%;}.splitTop .bigTop__captioncredit { text-align: right; color: #666;}.splitTop .bigTop__text.bigTop__text--bottom,.splitTop .bigTop__text.bigTop__text--top { position: absolute; top: 50%; bottom: auto; left: 25%; transform: translate(-50%, -50%); -webkit-transform: translate(-50%, -50%); width: 50%; min-height: initial; padding: 0 30px;}.edition-japan .splitTop .bigTop__hed,.edition-japan .splitTop .bigTop__dek { text-align: left;}/* 4 unit only */@media (max-width: 639px) { .splitTop .bigTop__rel { padding-bottom: 15px; } .splitTop .bigTop__media { float: none; width: 100%; } .splitTop .bigTop__captioncredit { text-align: left; color: #f4f4f4; } .splitTop.bigTop--lightTheme .bigTop__captioncredit { color: #666; } .splitTop .bigTop__text.bigTop__text--bottom, .splitTop .bigTop__text.bigTop__text--bottom { position: relative; width: auto; top: auto; left: auto; margin: 40px 20px; padding: 0; transform: none; -webkit-transform: none; } .bigTop__flash.flashlineSVG { margin-left: 0; }}/* 4, 8 unit splitTop font styling */@media (max-width: 979px) { .splitTop .bigTop__text .bigTop__hed { font-size: 32px; line-height: 1.12; } .wsj-modern span.bigTop__flash.flashlineSVG { text-indent: 215px; } .splitTop .bigTop__text .bigTop__dek { font-size: 16px; line-height: 1.38; }}/* 12, 16 unit splitTop font styling */@media (min-width: 980px) { .splitTop .bigTop__text .bigTop__hed { font-size: 52px; line-height: 1; } .splitTop .bigTop__text .bigTop__dek { font-size: 20px; line-height: 1.3; }}/*** end splitTop styling **//*****SECTION SPECIFIC STYLING***/.magazine .bigTop__flash,.magazine .bigTop__flash:link,.magazine .bigTop__flash:visited,.magazine .bigTop__flash:active { font-family: &#39;Retina Wide&#39;, &#39;Retina Narrow&#39;, &#39;Retina&#39;, &#39;Arial&#39;, sans-serif;}.magazine .bigTop__hed { font-weight: 400;}.magazine .bigTop__dek { font-family: &#39;Exchange&#39;, &#39;Chronicle SSm&#39;, Georgia, serif;}/***************Set via media query and not via classesto prevent page jump/rerenderPreviously set via CSS classes, e.g. bigTop__text--static, bigTop__hed-s,but it took too long for the page to &#34;settle&#34;**//* 4 unit only */@media (max-width: 639px) { .bigTopHide--4, .bigTop__flash.bigTopHide--4 { display: none; } .bigTop { margin: 0 0 20px; } .bigTop__overlay { display: none; } .bigTop__media--image { padding-bottom: 66.77%; } .bigTop__text { position: static; margin-top: 15px; text-align: left; margin-left: 10px; margin-right: 10px; width: auto; } .bigTop__overlay { display: none; } .bigTop__flash, .bigTop__flash:link, .bigTop__flash:active, .bigTop__flash:visited { color: #0080c3; text-align: left; } .bigTop__hed { font-size: 32px; line-height: 1.125; color: #000; text-align: left; } .bigTop__dek { font-size: 17px; line-height: 24px; color: #666; text-align: left; } .bigTop__flash + .bigTop__hed { margin-top: 4px; } .bigTop__hed + .bigTop__dek { margin-top: 1px; } .bigTop__dek:last-child { margin-bottom: 15px; } .bigTop__hed:last-child { margin-bottom: 14px; } .bigTop_button--embedded { margin: 15px 0 10px; color: #000; border-color: #000; min-width: 150px; } .bigTop_button--embedded:hover { background-color: #000; color: #fff; } .bigTop__text--flex &gt; .bigTop__play, .bigTop__play--standalone { position: absolute; top: 28vw; /* half of bottom padding of video elem */ left: 50%; transform: translateY(-50%) translateX(-50%); -webkit-transform: translateY(-50%) translateX(-50%); pointer-events: none; } .bigTop__videoTrigger { height: 0; padding-bottom: 56.25%; } .bigTop__flash.flashlineSVG { background-size: contain; } .wsj-modern .bigTop__text span:before { margin-left: 10px; }}/* 8 unit */@media (min-width: 640px) and (max-width: 979px) { .bigTop__captioncredit, .bigTop__text { max-width: 640px; } .wsj-modern .splitTop span.bigTop .bigTop__flash.flashlineSVG { min-width: 282px; } .bigTop__text.bigTop__text--bottom { box-sizing: border-box; min-height: 40%; top: auto; bottom: 0; padding-bottom: 10px; transform: translateY(0) translateX(-50%); -webkit-transform: translateY(0) translateX(-50%); box-sizing: border-box; } .wsj-modern .bigTop span.bigTop__flash.flashlineSVG { max-width: 239px; min-height: 15px; max-height: 15px; min-width: 350px; } .wsj-modern .splitTop.bigTop span.bigTop__flash.flashlineSVG { min-width: 279px; } .bigTop__text.bigTop__text--top { top: auto; bottom:60%; max-height: 40%; padding-top: 10px; box-sizing: border-box; transform: translateY(0) translateX(-50%); -webkit-transform: translateY(0) translateX(-50%); } .bigTop__hed { font-size: 42px; line-height: 1.095; } .bigTop__hed + .bigTop__dek { margin-top: 9px; } .bigTop__flash + .bigTop__hed { margin-top: 5px; } .bigTop_button--embedded { margin: 20px auto; } .bigTop__text--bottom.bigTop__text--flex &gt; .bigTop__play { position: static; } .bigTop__text--center.bigTop__text--flex &gt; .bigTop__play { margin-top: 15px; } .bigTop__text--flex &gt; .bigTop__play + .bigTop__flash { margin-top: 15px; } .wsj-modern .splitTop .bigTop__text span:before { margin-left: 10px; }}/* 8, 12, 16 unit */@media (min-width: 640px) { .bigTopHide--8, .bigTopHide--12, .bigTopHide--16, .bigTop__flash.bigTopHide--8, .bigTop__flash.bigTopHide--12, .bigTop__flash.bigTopHide--16 { display: none; } .bigTop__rel { overflow: hidden; /* fix horizontal scroll in IE11 */ } .bigTop__media--image { padding-bottom: 51.3%; } .bigTop__media--image &gt; .bigTop__preview--forceblur { --webkit-filter: blur(20px); filter: blur(20px); } .bigTop__text { position: absolute; top: 50%; left: 50%; transform: translateY(-50%) translateX(-50%); -webkit-transform: translateY(-50%) translateX(-50%); } .bigTop__dek { font-size: 20px; line-height: 28px; } .bigTop__text--static.bigTop__text { color: #000; position: static; transform: none; margin-left: auto; margin-right: auto; } .bigTop__text--inactive.bigTop__text--bottom, .bigTop__text--inactive.bigTop__text--center { opacity: 0; } .bigTop__text.bigTop__text--flex { flex-direction: column; display: flex; justify-content: flex-end; align-items: center; height: 100%; } .bigTop__text--clickthrough { pointer-events: none; } .bigTop__text--clickthrough &gt; .bigTop__flash, .bigTop__text--clickthrough &gt; .bigTop__hed, .bigTop__text--clickthrough &gt; .bigTop__dek { pointer-events: auto; } .bigTop__text.bigTop__text--flex.bigTop__text--center { justify-content: center; } .bigTop__text--center.bigTop__text--flex &gt; .bigTop__play { order: 2; }}/* 12 unit */@media (min-width: 980px) and (max-width: 1299px) { .bigTop__captioncredit { max-width: 960px; } .splitTop .bigTop__captioncredit { max-width: none; } .bigTop__play { width: 70px; height: 70px; } .bigTop__play:before { border-top-width: 16px; border-bottom-width: 17px; border-left-width: 26px; margin-top: 18px; margin-left: 25px; }}/* 12, 16 unit */@media (min-width: 980px) { .splitTop .bigTop__captioncredit { margin: 0; padding: 5px 5px 0 0; width: 50%; float: right; } .bigTop__hed { font-size: 52px; line-height: 1.077; } .edition-japan .bigTop__hed { font-size: 45px; } .bigTop__text { max-width: 960px; } .bigTop__text.bigTop__text--bottom { box-sizing: border-box; min-height: 30%; top: auto; bottom: 0; box-sizing: border-box; padding-bottom: 30px; transform: translateY(0) translateX(-50%); -webkit-transform: translateY(0) translateX(-50%); } .bigTop__text.bigTop__text--top { top: auto; bottom: 70%; max-height: 30%; padding-top: 10px; box-sizing: border-box; transform: translateY(0) translateX(-50%); -webkit-transform: translateY(0) translateX(-50%); } .bigTop__hed + .bigTop__dek { margin-top: 8px; } .bigTop__flash + .bigTop__hed { margin-top: 5px; } .bigTop__text--bottom.bigTop__text--flex &gt; .bigTop__play { /* need to do this because of IE11 */ position: absolute; top: 50%; left: 50%; transform: translateY(0) translateX(-50%); -webkit-transform: translateY(0) translateX(-50%); } .bigTop__text--bottom.bigTop__text--flex &gt; .bigTop__play + .bigTop__flash, .bigTop__text--bottom.bigTop__text--flex &gt; .bigTop__play + .bigTop__hed { margin-top: 50px; } .bigTop__text--bottom.bigTop__text--flex &gt; .bigTop__play { margin-top: -45px; } .bigTop__text--center.bigTop__text--flex &gt; .bigTop__play { margin-top: 20px; } .bigTop__text--flex &gt; .bigTop__play + .bigTop__flash { margin-top: 15px; }}/* 16 unit */@media (min-width: 1300px) { .bigTop__captioncredit { max-width: 1280px; } .splitTop .bigTop__captioncredit { max-width: none; } .bigTop__play { width: 90px; height: 90px; } .bigTop__play:before { border-top-width: 20px; border-bottom-width: 22px; border-left-width: 33px; margin-top: 24px; margin-left: 33px; }}", "posttime": "2020-05-30 12:47:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "肺炎,recovered,bigtop", "title": "新冠肺炎康复患者的血液正在成为炙手可热的商品", "title_en": "Blood of Recovered Covid-19 Patients Is Becoming a Hot Commodity", "transed": 1, "url": "https://www.wsj.com/articles/blood-of-recovered-covid-19-patients-is-becoming-a-hot-commodity-11590744600", "via": "", "real_tags": ["肺炎", "recovered", "bigtop"]}, {"category": "", "categoryclass": "", "imagename": "091ddde8af63f4b2fda5d4c6494a7e67.jpg", "infoid": 1004358, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们最新的SATA电缆用于高端计算机音频系统，旨在提高媒体库的音质。\n带有媒体库(音乐文件)的SATA硬盘从电缆中获益最多。\n电缆是定向的，安装时必须使箭头指向主板上的SATA端口。", "note_en": "Our latest SATA cable for high-end computer audio systems designed to improve sound quality of media library.\n   A SATA hard drive with media library (music files) on it benefits the most from the cable\n The cable is directional and must be installed with arrows facing SATA port on a motherboard.", "posttime": "2020-05-30 12:46:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "音频,definition,媒体库", "title": "用于音频的高清SATA电缆", "title_en": "High Definition SATA Cable for Audio", "transed": 1, "url": "https://jcat.eu/product/hd-sata-cable/", "via": "", "real_tags": ["音频", "媒体库"]}, {"category": "", "categoryclass": "", "imagename": "160a1fb4bc7d9ec61e6519bfee54affc.jpg", "infoid": 1004357, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "木星在一个奇怪的轨道上捕获了一颗来自太阳系外的冰彗星，这将使它在2063年回到距离这颗巨大行星300万公里的范围内。已知的唯一靠近太阳轨道的物体是苏梅克-利维9号彗星的碎片，它于1994年7月坠入木星云层。\n一年前，美国国家航空航天局(NASA)在夏威夷的小行星搜索ATLAS项目发现了2019年的LD2，进一步的观察表明它是一颗彗星。今年春天的新观测证实了它是一颗周期性彗星，并将其轨道置于木星附近，导致拉里·德诺(夏威夷大学)于5月20日宣布，P/2019年LD2是特洛伊木马中的第一颗彗星。这个由数千颗小行星组成的家族与木星的轨道相同，但稳定地保持在木星前方或后方约60°的位置。在特洛伊小行星中发现一颗彗星是令人惊讶的，因为它们中的大多数被认为是在太阳系早期捕获的-任何冰都应该在很久以前就已经蒸发了。\n然而，当业余天文学家山姆·迪恩使用喷气推进实验室太阳系动力学网站上的软件计算该彗星的轨道时，他发现P/2019 LD2最近与木星发生了近距离接触，导致其轨道不稳定。该模型显示，这颗彗星很可能是半人马彗星，属于太阳系外小行星家族的一员，其轨道延伸到土星。然后，在2017年2月17日，它经过了距离木星约1400万公里的地方，这次相遇让这颗彗星进行了一次疯狂的旅行，并将它插入了一个奇怪的类木星轨道。\n然而，尽管经过木星的摆动将P/2019年LD2推入了类似木星的轨道，但它并没有移动到两个拉格朗日点中的一个附近，在这两个拉格朗日点中，木星和太阳的引力组合持有特洛伊小行星。P/2019LD2距离木星不是60°，也就是这颗巨行星轨道的六分之一，而是仅比木星高出21°。该模型预测，在两颗彗星再次开始汇聚之前，彗星将漂移到前方不超过30°。\n然后，彗星将于2028年5月13日经过约1800万公里范围内。这将再次改变轨道，迪恩在小行星邮件列表上写道。这使得P/2019年LD2成为木星家族的彗星-但不是木星特洛伊木马，正如夏威夷小组现在承认的那样。冥王星项目的find_orb模型与JPL的模型给出了类似的结果。\n另一位业余爱好者托尼·邓恩(Tony Dunn)也发现了类似的结果。他用自己的模型说明了轨道，显示了从木星上看到的物体的路径。\n2028年的遭遇将使彗星从接近与木星1：1共振的轨道转变为接近2：3共振的轨道。但是这个轨道不会持久，因为它将使P/2019LD2走上更近距离的行星相遇的轨道。\n迪恩说，从木星的角度来看，彗星在返回之前似乎会缓慢地绕太阳运行。2063年1月，它将经过距离木星约300万公里的地方，恰好在伽利略卫星的轨道之外--距离足够近，足以引起这颗彗星轨道的重大改变。\nP/2019年LD2将从那里走向何方尚不清楚。冥王星计划的比尔·格雷(Bill Gray)说，轨道的不确定性足够大，使得那次相遇的结果很难预测。他说，它可能会被抛到几乎任何地方，这取决于它离木星有多近。相遇的距离越近，结果可能越戏剧性。\n格雷说，另一个未知数是彗星从其表面的不同点喷出气体，很难对由此产生的非引力效应对其轨道的影响进行建模。这种效应可能会增强或减弱木星引力的影响，并可能使其转向意想不到的方向。强大的力量也可以粉碎一颗彗星，就像Shoemaker-Levy 9号在撞击之前所发生的那样。\n2063年的方法应该会对一个帮助塑造太阳系的过程产生新的洞察力：小行星和太阳系的引力巨人之间的强烈相互作用。迪恩说，这一事件应该会让我们详细了解将半人马和长周期彗星转化为短周期彗星的动力学过程。到那时，我们很可能会有一些围绕木星运行的宇宙飞船，能够近距离拜访行星际访问者。这将比我们在休梅克-利维9号上看到的更好，当时碰撞本身就发生在木星一侧，地球观察者和宇宙飞船都看不见。", "note_en": "Jupiter has captured an icy comet from the outer solar system in a bizarre orbit that will bring it back to within 3 million kilometers of the giant planet in 2063. The only Sun-orbiting objects known to come closer were the fragments of Comet Shoemaker-Levy 9, which plunged into the Jovian cloud deck in July 1994.\n   A year ago, NASA&#39;s  asteroid-hunting ATLAS project in Hawai&#39;i discovered 2019 LD2, and further observations showed it was a comet. New observations this spring confirmed it as a periodic comet and placed its orbit near Jupiter, leading Larry Denneau (University of Hawaii) to  announce May 20th that P/2019 LD2 was the first comet among the Trojans. This family of several thousand asteroids shares Jupiter&#39;s orbit but stays steady at about 60° ahead or behind of the planet. The discovery of a comet among Trojan asteroids was surprising because most of them are thought to have been captured in the solar system’s early years — any ices ought to have evaporated long ago.\n However, when amateur astronomer Sam Deen used software on the  Jet Propulsion Laboratory&#39;s solar-system dynamics website to calculate the object’s orbit, he found P/2019 LD2 recently had a close encounter with Jupiter that left its orbit unstable.  The model showed that the comet had likely been a Centaur, part of a family of outer solar system asteroids, with an orbit reaching out to Saturn. Then, on February 17, 2017, it passed about 14 million kilometers from Jupiter, an encounter that sent the comet on a wild ride and inserted it into an odd Jupiter-like orbit.\n Yet although the swing past Jupiter put P/2019 LD2 into a Jupiter-like orbit, it didn’t move it near to one of the two Lagrange points where the combination of gravitational forces from Jupiter and the Sun hold Trojan asteroids. Instead of being 60° — one-sixth of the giant planet&#39;s orbit — from Jupiter, P/2019 LD2 is only 21° ahead of Jupiter. The model predicts the comet will drift to no more than 30° ahead before the two begin converging again.\n  The comet will then pass within about 18 million km on May 13, 2028. That will alter the orbit again, Deen wrote on the  Minor Planet Mailing List. That makes P/2019 LD2 a Jupiter-family comet — but not a Jupiter Trojan,  as the Hawaii group now acknowledges.  Project Pluto&#39;s Find_Orb model gives similar results to JPL’s model.\n Another amateur, Tony Dunn, also found similar results. He illustrated the orbit using his own model to shows the path of the object as seen from Jupiter.\n  The 2028 encounter will shift the comet from an orbit close to a 1:1 resonance with Jupiter to one near a 2:3 resonance. But that orbit won&#39;t last, because it will put P/2019 LD2 on course for a much closer planetary encounter.\n &#34;From Jupiter&#39;s perspective the comet will appear to slowly move around the Sun before coming back,&#34; Deen says. In January 2063, it will pass some 3 million kilometers from Jupiter, just outside the orbits of its Galilean satellites — close enough to cause a major redirection of the comet&#39;s orbit.\n  Where P/2019 LD2 will go from there is unclear. The orbital uncertainties are large enough to make the results of that encounter difficult to predict, says Bill Gray of Project Pluto. &#34;It could get tossed almost anywhere,&#34; he says, depending on how close it comes to Jupiter. The closer the encounter, the more dramatic the results could be.\n Another wild card, Gray says, is that comets eject gas from various points on their surfaces, and it is very hard to model the impact of the resulting non-gravitational effects on their orbits. Such effects could enhance or diminish the effect of Jupiter’s gravitational force and could send it veering off in an unexpected direction. Strong forces can also fragment a comet, as happened to Shoemaker-Levy 9 before its impact.\n The 2063 approach should yield new insight into a process that has helped shape the solar system: intense interactions between planetesimals and the gravitational giant of the solar system. The event should give us &#34;a detailed look at the dynamics that convert Centaurs and long-period comets into short-period comets,&#34; says Deen. &#34;Odds are that we&#39;ll have some spacecraft orbiting Jupiter by then that will be able to visit the interplanetary visitor up close.&#34; That would give a much better view of the action than we had for Shoemaker-Levy 9, when the collision itself happened on the side of Jupiter hidden from terrestrial observers and spacecraft.", "posttime": "2020-05-30 12:31:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,彗星,trapped,木星", "title": "木星将一颗彗星困在一个奇怪的轨道上", "title_en": "Jupiter Has Trapped a Comet in a Bizarre Orbit", "transed": 1, "url": "https://skyandtelescope.org/astronomy-news/jupiter-has-trapped-a-comet-in-a-bizarre-orbit/", "via": "", "real_tags": ["app", "彗星", "trapped", "木星"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004356, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无框架运动是一群对开发没有框架的应用程序感兴趣的开发人员。我们并不憎恨框架，也不会发起反对框架的运动，但是我们认为滥用框架是因为我们缺乏关于技术债务的知识，以及缺乏由普通语言或专用库提供的替代方案的知识。\n团队每次使用框架时，都要承担一定的风险。风险在于，经过一段时间后，团队最终得到的工具不再提供任何类型的价值，而且大多数时间都是更改的主要障碍。最重要的是，一个框架可能在软件使用它之前就夭折了，给开发人员留下了沉重的负担。\n如果技术决策、业务目标和用户体验之间没有牢固的联系，这种风险就会放大。相反，非功能性需求(如截止日期、生命周期、预算、可用性、未来的业务场景和特定于领域的约束)应该成为架构选择和实现路线图的主要决策驱动因素。\n正如我们上面所说的，我们不认为框架是邪恶的。它们是非常强大的工具，用普通的语言和非常通用的方式编写，这一事实使它们成为很好的学习工具，可以帮助任何人学习如何在没有它们的情况下编写代码。为了知道您应该如何以及何时使用特定的框架，您必须了解框架是如何工作的。了解每个框架的优点和限制将使您能够做出正确的框架选择。更重要的是，当你根本不需要的时候，这一点就会变得非常清楚。掌握框架在幕后如何工作的概念将加深您对语言本身的了解。了解该框架的基本原理将使您能够针对遇到的每个特定问题编写更好的代码。\n尽管如此，我们认为在选择框架时，应该在项目的整个生命周期中负责任地使用该框架。不断提醒自己，每个工具都有某种权衡。\n无框架意味着您必须对技术决策给予正确的重视，并且认识到选择开发一个项目或单个功能而不依赖于框架是真正有可能的！\n无框架还意味着，您必须考虑软件必须诞生和上线的整个上下文环境。？包括必须开发软件的开发人员，他们决定是否可以从框架中获得帮助，同时牢记支持这一选择的原因及其权衡。\n最后，无框架意味着您不应该认为编写软件是您可以委派到其他地方并依赖其他软件(例如库)来解决特定问题的责任。当你并不真正需要的时候，你可以避免把手和脚绑在整个框架上。\n我们的宣言发布在我们的Github存储库。我们坚信，为了使这份宣言有用，我们应该根据我们社会将要进行的对话，在这段时间内对其进行修改。因此，不可能签署这份宣言。如果您觉得本宣言对您的工作有用，请将其与您的网络共享。共享是我们希望人们签署此文档的方式。\n因为用户研究、设计活动和业务目标是那些更能阐明非功能性需求的内容，所以我们认为将参与项目的每个人都包括在我们的讨论中是很重要的，包括非开发人员。每一个技术决策，包括框架的选择，都应该考虑到软件所处环境的各个方面。\n我们正在收集这个令人敬畏的列表中关于无框架方法的所有资源。请随意添加您认为对我们的社区有用的任何资源。\n我们接受任何形式的反馈，因此，如果您想与我们讨论此处所述的任何主题，只需打开一个问题或请求即可。如果您对该项目有任何疑问，可以发电子邮件至info@frameworkless movement.org。", "note_en": "The  Frameworkless Movement is a group of developers interested in developing applications without frameworks.  We don&#39;t hate frameworks, nor we will ever create campaigns against frameworks, but we perceive the  misuse of frameworks as a lack of knowledge regarding technical debt and the availability of alternatives given by the vanilla language or by dedicated libraries.\n    Every time a team uses a framework, it also takes a  risk. The risk is that after some time has passed the team ends up with a tool that does not provide any kind of value anymore and that most of the times represents a major roadblock to change. Most importantly a framework could &#34;die&#34; way before the software uses it, leaving the developers with a heavy burden.\n  This risk is amplified without the presence of a strong bond between technical decision making, business goals, and user experience. Instead, the non-functional requirements like deadline, lifespan, budget, usability, future business scenarios and domain-specific constraints should be the primary decision drivers for the architectural choices as well as for the implementation roadmap.\n    Like we stated above,  we don&#39;t think that frameworks are evil. They are very powerful tools, written in plain vanilla language and in a very generic way, a fact that makes them great learning tools which can help anyone learn how to code  without them. In order to know how and when you should use a particular framework you have to understand how frameworks work. Understanding the strengths and the constraints of each framework will enable you to make the right choice of a framework. Even more, it will be very clear when you don&#39;t need one at all. Grasping the concepts of how frameworks work behind the scenes will deepen your knowledge about the language itself. Knowing the framework&#39;s rationale will enable you to write better code for each specific problem you encounter.\n  Nonetheless, we believe that a framework, when chosen, should be used responsibly throughout the life of the project. Continuously remind yourself that every tool has some kind of tradeoff.\n  Frameworkless means that you must give the right importance to the technological decision making and realize that the choice to develop a project or a single feature with no dependence on a framework is a real possibility!\n  Frameworkless also means that you must take into account the entire context where the software will have to &#34;be born&#34; and &#34;live&#34;. Including the developers&#39; skills who have to develop the software, deciding if they can get help from a framework keeping in mind the reasons that support this choice and its tradeoffs.\n  Finally, Frameworkless means that you should not assume that writing software is a responsibility you can afford to delegate elsewhere and depend on other software (a library for example) to solve a specific problem you have. You can avoid binding hand and foot to a whole framework when you don&#39;t really need it.\n    Our manifesto is published on our  Github repository.  We firmly believe that to be useful this manifesto should be modified during the time as a result of the conversations that our community will have. Thus, it will not be possible to sign this Manifesto. If you find this Manifesto useful for your work please share it with your network.  Sharing is how we would like people to sign this document.\n    Because user research, design activities and business goals are those that more clarify the non-functional requirements we think it&#39;s important to put everyone who works on the project in our discussion, non-developers included. Every technical decision, including the choice of a framework, should be made considering every aspect of the context the software &#34;lives&#34;.\n    We are gathering all the resources about the Frameworkless approach on this  awesome list.  Feel free to add any resource that you feel would be useful for our community.\n  We accept any kind of feedback, so if you want to discuss with us about any of the topics stated here just open an  Issue or a  Pull Request. For any inquires about the project you can write an email at  info@frameworklessmovement.org.", "posttime": "2020-05-30 12:00:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "框架,frameworkless", "title": "无框架运动", "title_en": "The Frameworkless Movement", "transed": 1, "url": "http://frameworklessmovement.org/", "via": "", "real_tags": ["框架"]}, {"category": "", "categoryclass": "", "imagename": "c0da7cb537102b123275787b14be7906.jpg", "infoid": 1004355, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "挪威正在对封锁前发生的事情进行拼凑，其最新发现意义重大。它正在使用观察到的数据-医院数字、感染人数等-来构建3月份发生的事情的图景。当时，没有人真正知道。人们担心病毒很猖獗，每个人都会感染另外两到三个人-只有封锁才能将这种指数增长率(所谓的R数)降到安全水平1。这是伦敦帝国理工学院(Imperial College London)在英国、挪威和几个欧洲国家提出的各种图表中提出的假设。\n但挪威公共卫生当局发布了一份报告，得出了一个惊人的结论：病毒的传播速度从来没有人们担心的那么快，当下令封锁时，病毒已经在离开的路上了。看起来，当最全面的措施在3月12日实施时，有效生育率似乎已经下降到1.1%左右，而且不会有太多事情把它压低到1…以下。我们回过头来看，感染是在下降的过程中。这是一个图表，右手边是R-数字：\n这就提出了一个尴尬的问题：有必要封锁吗？它有什么成就是自愿的社会疏远无法实现的？挪威公共卫生机构主任卡米拉·斯托尔滕贝格在接受采访时坦率地谈到了这一发现的影响。“我们现在的评估，我发现，关于重新开放有一个广泛的共识，那就是，如果不关闭，可能会达到同样的效果，并避免部分不幸的后果。”但是，取而代之的是，采取预防措施保持开放，以阻止传播。她说，承认这一点很重要，因为如果感染水平再次上升-或者第二波在冬天来袭-你需要残酷地诚实地说明封锁是否被证明是有效的。\n挪威统计局也是世界上第一个计算学校关闭造成的永久性损害的机构：它发现，学生每周得不到课堂教育，就会阻碍生活机会，永久性地降低收入潜力。因此，只有在确定禁闭的学术基础稳固的情况下，一个国家才应该执行这一严厉的措施。在斯托尔滕贝格看来，这一次“学术基础还不够好”。\n明天出版的“新旁观者”的头版文章认为，英国人理应得到同样的坦率。有丰富的英国数据可供参考：999个电话、感染、医院数据、每周呼吸道感染数据和约3.7万名Covid死亡人数。由此，英国政府不难效仿挪威和瑞典当局的做法：提供一份追溯到2月或3月的R数字估计值。并使用观察到的数据-而不是假设和模型-来衡量锁定效应。这样的研究结果可能会让仍在要求警方实施封锁的政府感到不舒服。但这些事情有一个最终会公之于众的习惯。\n可能会有一个很有说服力的故事要讲。英国的数据汇总后很可能会显示，如果没有封锁，数十万人可能会死亡-尽管残酷，但这是至关重要的。但如果数据表明了一些不同的东西，就像在挪威一样，那么这是一个值得讨论的问题。我们的主要文章以这一点结束：\n“现在是时候恢复自由，转向一个自愿的系统了：要求继续保持谨慎，但要求人们使用常识。这个国家已经做好了值得信任的准备。问题是首相是否觉得准备好信任我们了。", "note_en": "Norway is assembling a picture of what happened before lockdown and its latest discovery is pretty significant. It is using observed data – hospital figures, infection numbers and so on – to construct a picture of what was happening in March. At the time, no one really knew. It was feared that virus was rampant with each person infecting two or three others – and only lockdown could get this exponential growth rate (the so-called R number) down to a safe level of 1. This was the hypothesis  advanced in various graphs by Imperial College London for Britain, Norway and several European countries.\n But the Norwegian public health authority has published a  report with a striking conclusion: the virus was never spreading as fast as had been feared and was already on the way out when lockdown was ordered. ‘It looks as if the effective reproduction rate had already dropped to around 1.1 when the most comprehensive measures were implemented on 12 March, and that there would not be much to push it down below 1… We have seen in retrospect that the infection was on its way down.’ Here’s the graph, with the R-number on the right-hand scale:\n  This raises an awkward question: was lockdown necessary? What did it achieve that could not have been achieved by voluntary social distancing? Camilla Stoltenberg, director of Norway’s public health agency, has  given an interview where she is candid about the implications of this discovery. ‘Our assessment now, and I find that there is a broad consensus in relation to the reopening, was that one could probably achieve the same effect – and avoid part of the unfortunate repercussions – by not closing. But, instead, staying open with precautions to stop the spread.’ This is important to admit, she says, because if the infection levels rise again – or a second wave hits in the winter – you need to be brutally honest about whether lockdown proved effective.\n Norway’s statistics agency was also the first in the world to calculate the permanent damage inflicted by school closures: every week of classroom education denied to students, it found, stymies life chances and permanently lowers earnings potential. So a country should only enforce this draconian measure if it is sure that the academic foundation for lockdown was sound. And in Stoltenberg’s opinion, ‘the academic foundation was not good enough’ for lockdown this time.\n The leading article in the new  Spectator, out tomorrow, argues that Brits deserve the same candour. There is a wealth of UK data to draw from: 999 calls, infections, hospital data, weekly figures on respiratory infections and some 37,000 Covid deaths. And from this it’s not hard for the UK government to do what the Norwegian and  Swedish authorities have done: produce an estimate of the R number dating back to February or March. And use observed data – rather than assumptions and models – to measure the lockdown effect. The results of such a study might make for uncomfortable reading for a government still asking police to enforce lockdown. But these things have a habit of becoming public eventually.\n There might be a strong story to tell. The UK data, when assembled, might well show that hundreds of thousands would have died without lockdown – and that, while brutal, it was vital. But if the data points to something different, as it has in Norway, then this is a discussion worth having. Our leading article concludes with this point:\n “ It is time to restore liberty and move to a voluntary system: to ask for continued caution but ask people to use common sense. The country is ready to be trusted. The question is whether the Prime Minister feels ready to trust us.", "posttime": "2020-05-30 12:00:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "卫生部长,health,感染", "title": "挪威卫生部长：驯服Covid不需要封锁", "title_en": "Norway health chief: Lockdown was not needed to tame Covid", "transed": 1, "url": "https://www.spectator.co.uk/article/norway-health-chief-lockdown-was-not-needed-to-tame-covid", "via": "", "real_tags": ["卫生部长", "health", "感染"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004354, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据欧洲环境监督机构的一份新报告，2018年欧盟的温室气体排放量继续下降，这是可以获得全面数据的最新年份。\n与2017年相比，排放量下降了2.1%，比1990年低23%，1990年是欧盟根据联合国气候协议减排的基线。如果剔除英国，自1990年以来的降幅较小，为20.7%。\n欧洲环境署(European Environment Agency)在一份报告中透露，排放量的持续下降是欧盟范围内和各国政策的结果，随着煤炭的进一步淘汰和可再生能源的增加，能源发电量显示出最大的排放降幅。\n交通运输的二氧化碳排放量在经历了前四年的上升后，在2018年趋于平稳，这给了这一主要排放来源可能得到控制的希望。\n然而，活动人士表示，必须进一步、更快地降低排放，以履行欧盟在巴黎协议下的义务。据估计，要将全球供暖保持在比工业化前水平高出2摄氏度的巴黎上限内，每年的降幅约为7%。\n冠状病毒造成的经济动荡和破坏可能会导致排放量的短期下降，就像今年到目前为止在世界各地所做的那样，但长期影响尚不清楚。\n随着人们重返工作岗位，各国政府试图刺激经济，排放量可能会再次上升，如果不采取措施加以控制，一些行为改变--比如避免使用公共交通和恢复乘坐更空的飞机进行航空旅行--可能会使排放量超过近几年的水平。\n本周，联合国决定将关于气候危机的重要会谈推迟一年，从今年11月推迟到2021年11月。中断的时间比许多国家希望的要长，但考虑到封锁造成的干扰，人们认为有必要这样做。\n绿色组织敦促各国政府在Cop26谈判之前，将从冠状病毒中恢复与减少碳排放的需要联系起来，并表示绝不能让今年的拖延减缓应对气候危机的行动。\n“减少2.1%的排放量远远不足以避免大规模的气候崩溃，我们绝对不能忽视这项任务的紧迫性，”地球之友的活动家亚伦·基利(Aaron Kiely)说。“气候谈判的推迟不能以国际气候行动为代价--这不会给各国政府提供逃避国际责任的条款。如果我们合作，倾听科学，停止浪费时间，就有办法摆脱(气候和冠状病毒)危机。“。\n尽管欧盟执委会本周提出了绿色复苏的初步计划，但仍不能保证随着封锁的缓解，成员国也会采取必要的行动，确保长期减排。\n绿色和平组织欧盟发言人马克·布莱迪(Mark Breddy)表示：“欧盟的冠状病毒恢复计划确实存在成为化石燃料和其他污染行业的生命线的风险。我们已经看到政府向航空公司和汽车制造商注资数十亿美元，而且没有附加真正的绿色条件。为了在明年气候峰会之前重回正轨，欧盟需要采纳到2030年减排65%的目标，与巴黎协议保持一致。“。\n欧盟的排放量随着英国成为成员国而下降，与没有英国贡献的情况下降幅较小之间的差异，也突显出英国退欧后欧盟将不得不加大力度。自1990年以来，英国减排的很大一部分来自于提前从煤炭转向天然气，但最近的下降来自于可再生能源发电量的增加。", "note_en": "Greenhouse gas emissions in the EU continued their fall in 2018, the latest year for which comprehensive data is available, according to a  new report from Europe’s environment watchdog.\n Emissions fell by 2.1% compared with 2017, to a level 23% lower than in 1990, the baseline for the bloc’s emission cuts under the UN’s climate agreements. If the UK is excluded, the decline since 1990 was smaller, standing at 20.7%.\n The continuing fall, revealed in a  report by the European Environment Agency, came as the result of EU-wide and country-specific policies, with energy generation showing the biggest decline in emissions as coal was phased out further and renewable power increased.\n Carbon dioxide emissions from transport flattened off in 2018, after rising for the previous four years, giving hope that this  major source of emissions may be brought under control.\n However, emissions must be brought down much further and faster to satisfy the EU’s obligations under the Paris agreement, campaigners said. Annual falls of about 7% are estimated to be  needed to keep global heating within the Paris upper limit of 2C above pre-industrial levels.\n The economic turmoil and disruption caused by the coronavirus is likely to result in a short-term drop in emissions, as it has so far this year across the world, but the longer-term impact is unknown.\n As people return to work, and governments try to stimulate the economy, emissions are likely to rise again, and some behavioural changes – such as avoiding public transport and the resumption of air travel on emptier planes – may increase emissions beyond the level of recent years if  measures are not taken to rein them in.\n This week, the UN decided to  postpone vital talks on the climate crisis by a year, from this November to November 2021. The hiatus is longer than many countries had wished, but was deemed necessary given the disruption caused by lockdowns.\n Green groups urged governments to  link the recovery from the coronavirus with the need to reduce carbon, ahead of the Cop26 talks, and said the year’s delay must not be allowed to slow down action on the climate crisis.\n “A 2.1% emissions drop isn’t nearly enough to avert massive climate breakdown, and we absolutely cannot lose sight of the urgency of this task,” said Aaron Kiely, a campaigner at Friends of the Earth. “Postponement of the climate talks cannot come at the cost of international climate action – it doesn’t give governments a get-out clause from their international responsibilities. There is a way out of both [the climate and coronavirus] crises if we collaborate, listen to the science, and stop losing time.”\n Although the European commission set out its  initial plans for a green recovery this week, there is still no guarantee that member states will also take the actions needed to ensure long-term emissions reduction as the lockdowns ease.\n Mark Breddy, Greenpeace’s EU spokesman, said: “There is a real risk that the EU’s coronavirus recovery plan will be a lifeline for fossil fuels and other polluting sectors. We’re already seeing governments pump billions into airlines and carmakers with no real green strings attached. To get back on track ahead of next year’s climate summit, the EU needs to adopt a target to cut emissions by 65% by 2030, in line with the Paris agreement.”\n The difference between the EU’s emissions fall with the UK as a member state and the smaller decline without the UK’s contribution also highlights how the EU will have to step up its efforts after Brexit. A large part of the UK’s emissions cuts since 1990 came from an early switch away from coal to gas, but more recent falls have come from an increase in renewable electricity generation.", "posttime": "2020-05-30 11:31:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "温室,greenhouse,排放量", "title": "欧盟温室气体排放量继续下降，煤炭被抛弃", "title_en": "EU's Greenhouse Gas Emissions Continue To Fall As Coal Ditched", "transed": 1, "url": "https://www.theguardian.com/world/2020/may/29/eus-greenhouse-gas-emissions-continue-to-fall-as-coal-ditched", "via": "", "real_tags": ["温室", "排放量"]}, {"category": "", "categoryclass": "", "imagename": "51c263139e11b8e52ed7e8627d017984.jpeg", "infoid": 1004353, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SaaS订阅模式是B2B初创企业的事实标准，也是风险投资家的潜台词。\n从表面上看，订阅模式对初创公司来说是有意义的。根据定义，即使没有获得新客户(或者如果净流失为零)，它也可以为原本不稳定的业务提供持续的收入。而且，更容易接近的成本会增加转化率，并有助于提高生命周期价值。随着业务的发展，订阅也是对其产品为客户服务程度的极好测试。\n然而，对于新公司来说，订阅模式伴随着隐藏的风险，因为深入了解他们的客户比快速盈利要重要得多。这种风险可以分为两个方面：业务及其客户关系。\n成熟的企业和初创企业都已经接受了软件即服务的模式。订阅的广泛采用使得人们很容易认为许可证本质上是劣质的；它们的定价不那么平易近人，而且它们需要持续的销售才能获得可持续的收入。\n然而，这些明显的缺点正是为什么许可模型对于处于早期阶段的公司来说是一个极其有价值的工具。在产品优化阶段，许可是快速改进产品以有效满足客户需求的绝佳方式。它们提高了反馈数量和质量，支持更大的执行自由度，并密切协调业务和客户激励。\n初创公司在为许可证定价时必须仔细考虑单位经济性，但不断下降的基础设施成本意味着它们在许可证期限内仍能保持可观的利润率(我应该知道，我向云存储出售许可证)。考虑周到的定价甚至可以使许可证成为一项非常有吸引力的投资。\n前期资本可加速迭代并支持重大产品发展，而无需担心失去订户。\n不同意产品更改的客户很快就会解释原因，而不是简单地取消订阅。\n最终，随着产品的成熟，大多数B2B初创企业将采用订阅模式。对于能够可靠预测当前CAC和LTV的企业来说，更高的转换率和经常性收入是巨大的好处。然而，对于没有历史数据的产品上市前匹配的初创公司来说，快速迭代和强大的客户关系要重要得多，因为他们为自己的市场开发了尽可能好的产品。\n硅谷对经常性收入的指数化程度过高。太多的创始人和投资者认为，大型软件企业的标准收入模式将很好地转化为小型企业。及早出售许可证有助于新公司专注于数百万用户的长期优化，而不是为几千美元的经常性收入进行短期优化。", "note_en": "The SaaS subscription model is the de facto standard for business-to-business startups and the unspoken expectation of venture capitalists.\n Superficially, a subscription model makes sense for early stage companies. By definition, it provides consistent revenue for an otherwise volatile business, even if no new customers are acquired (or if net churn is zero). And, a more approachable cost increases conversion and can help boost lifetime value. As businesses grow, subscriptions are also an excellent test of how well their product serves customers.\n However, a subscription model comes with hidden risks for new companies at a time when developing a deep understanding of their customers is vastly more important than quick revenue. This risk can be separated into two buckets: the business and its customer relationships.\n       Mature businesses and startups alike have embraced the software-as-a-service model. Widespread adoption of subscriptions makes it easy to assume that licenses are inherently inferior; their pricing is less approachable and they require consistent sales for sustainable revenue.\n However, these perceived drawbacks are exactly why a license model is an extremely valuable tool for early stage companies. During the product optimization phase, licenses are an excellent way to quickly hone a product to effectively meet customer needs. They increase feedback volume and quality, support greater executional freedom, and closely align business and customer incentives.\n Startups will have to think carefully about unit economics when pricing licenses, but declining infrastructure costs mean they can still maintain significant margins over the license term (I should know, I sell licenses to cloud storage). Thoughtful pricing can even make licenses a very attractive investment.\n  Capital up front accelerates iteration and supports significant product evolution without fear of losing subscribers\n  Customers who disagree with product changes are quick to explain why instead of simply cancelling a subscription\n Ultimately, most B2B startups will adopt a subscription model as their product matures. Increased conversion and recurring revenue are significant benefits for businesses that can reliably predict their current CAC and LTV. However, for pre- product-market fit startups with no historical data, rapid iteration and strong customer relationships are much more important as they develop the best possible product for their market.\n  Silicon Valley is over-indexing on recurring revenue. Far too many founders and investors assume that the standard revenue model for large software businesses will translate well to small ones. Selling licenses early on helps new companies focus on long-term optimization for millions of users instead short-term optimization for a few thousand dollars in recurring revenue.", "posttime": "2020-05-30 11:00:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "订阅,subscription,许可证", "title": "订阅世界中的许可证", "title_en": "Licenses in a Subscription World", "transed": 1, "url": "https://wch.io/writing/startups-and-licenses", "via": "", "real_tags": ["订阅", "许可证"]}, {"category": "", "categoryclass": "", "imagename": "8e1be5b7bafc1ff6f957b0e02995e32e.jpg", "infoid": 1004351, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "圣何塞(CBS SF)-圣何塞警方周五晚间宣布，针对本周早些时候乔治·弗洛伊德(George Floyd)在明尼阿波利斯被警方拘留死亡的抗议活动是非法集会，在忙碌的下午高速公路关闭和窗户被砸碎后，警方向活动人士发射催泪瓦斯。\n最初是一场穿过市中心的和平游行，后来又蔓延到城市街道上，此前活动人士早些时候将繁忙的美国101号高速公路双向关闭了一个小时，在愤怒的抗议游行中砸碎了警车和其他车辆的窗户。\n在关闭高速公路后，越来越多的抗议者最终聚集在距离圣何塞市政厅一个街区的第七街和圣克拉拉街交叉口，在那里，一队身穿防暴装备的警察站在主要示威者的对面，一些活动人士向挥舞标语并用手机拍照的警察走近。\n可以看到警察向人群发射非致命性炮弹，人群逐渐扩大，据一些人估计，人数超过了1000人。\n至少有一名示威者与警察发生肢体冲突，在被带走之前与几名警察扭打。在另一起事件中，一名圣何塞警察被投掷的石块击昏，然后在同事的帮助下进入警车，并被从现场带走。抗议者还投掷了塑料瓶的水。\n下午5点30分过后不久，警方宣布抗议活动被宣布为非法集会，人群被命令驱散。警戒线开始沿着圣克拉拉街向市政厅推进，警察向人群发射催泪瓦斯。\n抗议者继续与警察对峙，导致更多的扭打和逮捕。可以听到抗议者高呼“举起手来，不要开枪！”当他们坚持自己的立场时，或者在某些情况下，他们在身着防暴装备的警察队伍前跪下。随着对峙的继续，至少又有五六名抗议者被拘留。\nKPIX 5的记者Len Ramirez被其中一枚非致命性的投射物击中，他称这种投射物是硬塑料圆盘，没有伤害他，但确实在他的衣服上留下了印记。\n下午6点25分左右，随着抗议者冲破围栏进入一个建筑工地，局势升级，该工地为一些活动人士提供了两乘四英寸的武器和一个灭火器。工地的建筑工人得以修复围栏，抗议者继续前进。有一次，一辆车开到了人群的边缘，卸下了12包装在玻璃瓶里的啤酒，这些啤酒被扔给了警察。\n下午6：30左右，警方开始使用似乎是闪光弹的东西，除了催泪瓦斯外，引爆时还会发出巨大的轰鸣声。在那之后不久，抗议者将一辆车移到圣克拉拉街中央，显然是为了将其用作路障，但警方很快就转移到了这个位置，以确保活动人士没有试图点燃这辆车。\n警方继续将这群抗议者推下圣克拉拉街，现在已经远远超过圣何塞市政厅，进一步向市中心推进。圣何塞警方和圣克拉拉县警局官员在圣何塞市中心的两个警察和警长辖区周围设立了警戒线，可能是为了防止抗议者再次聚集在其中一个地点，就像周四晚上在明尼阿波利斯发生的那样。\n早些时候，下午3点10分左右，一群似乎约300名抗议者开始封锁圣克拉拉街附近的所有高速公路南行车道。一些车辆设法绕过人群，但南行的交通拥堵已经延伸了几英里。\n生防护中心人员在明石路引导车辆驶离高速公路时，北行方向的交通亦被截停。出口的高速公路车流在该地区的城市街道上引发了交通拥堵。\n主要的抗议者群体封锁了南行车道大半个小时，然后穿过高速公路前往北行线，最终在下午4点15分左右离开了美国101号公路。\n然而，在最初的一组车辆能够通过后，仍然可以看到卫生防护中心和圣何塞警察单位阻碍了南行交通。截至下午4点20分左右，北行交通再次开始行驶。\n有一些报道称，抗议者和司机在高速公路上发生了冲突，包括一些打碎的车窗。在圣克拉拉街，抗议者还砸碎了圣何塞警车的窗户，压平了至少一个轮胎，并用涂鸦污损了警察的SUV。\n抗议者似乎正在返回圣何塞市政厅，距离该组织封锁高速公路的地方约半英里。\nKPIX 5记者Len Ramirez在游行蜿蜒前往圣克拉拉街高速公路坡道时正与抗议活动在一起。\n“愤怒与和平抗议将永远是对不公正的适当回应；暴力永远不会。圣何塞团结起来，对明尼阿波利斯犯下的残暴罪行感到愤怒，对乔治·弗洛伊德的可怕死亡感到悲痛，“声明中写道。SJPD将采取慎重的方式促进和平抗议，但不会容忍对我们人民的暴力或对我们城市的损害。“。\n周四，圣何塞、奥克兰和旧金山的警察工会发表了一份联合声明，谴责明尼阿波利斯警察的行为。\n声明写道：“我们在视频上看到的与我们所学到的一切不一致，与我们被教导的一切相反，不仅是作为一名学院新兵或警察，而且是作为人。”“我们同样感到不安的是，现场没有任何其他警官介入以防止这场悲剧。”\n周五早些时候，州长加文·纽瑟姆(Gavin Newsom)在他的冠状病毒应对更新中花了很大一部分时间讨论弗洛伊德的死亡及其在全国范围内引发的动乱。\n纽瑟姆呼吁该州居民“做得更好”，与种族主义和不平等作斗争，并在抗议这场可怕的悲剧时保持警惕。\n这位州长说：“我祈祷我们所有想要表达自己的人都能深思熟虑、温和而有力地表达自己，按照他们应该和必须的方式来表达自己。”", "note_en": "SAN JOSE (CBS SF) — Police in San Jose Friday evening have declared a protest over the police custody death of George Floyd in Minneapolis earlier this week an unlawful assembly, firing tear gas into the crowd of activists following a hectic afternoon of freeway shutdowns and smashed windows.\n  What began as a peaceful march through downtown, later spilled back onto city streets after activists had earlier shut down busy US Highway 101 in both directions for an hour, smashing windows of police cars and other vehicles during the angry protest march.\n After shutting down the freeway, a growing crowd of protesters ended up gathering about a block from San Jose City Hall at the intersection of Seventh and Santa Clara Streets, where a line of police in riot gear stood across from the main group of demonstrators, with some activists coming closer to the officers waving signs and taking video with cell phones.\n Police could be seen firing non-lethal projectiles into the crowd that gradually grew in size, numbering upwards of 1,000 people by some estimates.\n  At least one demonstrator got in a physical confrontation with officers, scuffling with several policemen before being taken away. In a separate incident, a San Jose police officer was knocked unconscious by a thrown rock before being helped by fellow officers into a police vehicle and taken from the scene. Protesters were also throwing plastic bottles of water.\n Shortly after 5:30 p.m., police announced that the protest had been declared an unlawful assembly and the crowd was ordered to disperse. The police line began to advance on the protesters down Santa Clara Street towards city hall with officers firing tear gas into the crowd.\n Protesters continued to confront officers, leading to additional scuffles and arrests. Protesters could be hear chanting “Hands up don’t shoot!” as they stood their ground or in some cases took a knee in front of the line of officers in riot gear. At least five or six more protesters were taken into custody as the standoff continued.\n  KPIX 5 reporter Len Ramirez was struck by one of the non-lethal projectiles which he described as a hard plastic disc that did not injure him, but did leave a mark on his clothing.\n At around 6:25 p.m., the situation escalated as protesters broke through a perimeter fence to access a construction site that provided some of the activists with two by fours to use as weapons and a fire extinguisher. Construction workers at the site were able to repair the fence and protesters moved on. At one point a car drove to the edge of the crowd and unloaded twelve-packs of beer in glass bottles that were thrown at police.\n  At around 6:30 p.m., police began using what appeared to be flash-bang grenades that made a loud booming sound when detonated in addition to tear gas. Shortly after that, protesters moved a vehicle into the middle of Santa Clara Street apparently to use it as a barricade, but police quickly moved on the position to make sure activists weren’t trying to ignite the vehicle.\n  Police continued to push the group of protesters down Santa Clara Street, now well past San Jose City Hall and further towards downtown. San Jose police and Santa Clara County Sheriff’s Department officers have set up perimeters around the two police and sheriff’s precincts in downtown San Jose, possibly to guard against the protesters reconvening around one of those sites as happened Thursday night in Minneapolis.\n Earlier, a group of what appeared to be around 300 protesters started blocking all southbound lanes of the highway near Santa Clara Street at around 3:10 p.m. Some vehicles were managing to skirt their way around the crowd, but the southbound traffic backup was already stretching for miles.\n  Traffic was also stopped in the northbound direction as CHP officers diverted cars off the freeway at Alum Rock Avenue. The exiting freeway traffic triggered gridlock on city streets in the area.\n The main group of protesters blocked southbound lanes for the better part of an hour before walking across the freeway to the northbound side and eventually getting off US 101 at about 4:15 p.m.\n However, CHP and San Jose police units could still be seen holding up southbound traffic after an initial group of vehicles was able to pass. Northbound traffic was moving again as of about 4:20 p.m.\n There were some reports of confrontations between protesters and drivers on the freeway, including some broken vehicle windows. Protesters were also seen smashing the windows of San Jose police vehicles as well as flattening at least one tire and defacing the police SUVs with graffiti at Santa Clara Street.\n  The protesters appeared to be headed back to San Jose City Hall about a half mile away from where the group had blocked the freeway.\n KPIX 5 reporter Len Ramirez was with the protest when the march wound its way to the Santa Clara Street freeway onramp.\n    “Anger and peaceful protest will always be appropriate responses to injustice; violence will never be. San Jose is united in outrage over the atrocious crime committed in Minneapolis and in sadness over George Floyd’s horrible death,” the statement read.” SJPD will take a measured approach in facilitating peaceful protest, but there will be no tolerance of violence to our people or damage to our city.”\n The police officers’ unions of San Jose, Oakland and San Francisco issued a joint statement Thursday condemning the actions of the Minneapolis officers.\n “What we saw on that video was inconsistent and contrary to everything we have been taught, not just as an academy recruit or a police officer, but as human beings,” the statement read. “We are equally disturbed by not seeing any of the other officers on scene intervene to prevent this tragedy.”\n Earlier Friday, Gov. Gavin Newsom spent a good portion of his coronavirus response update  discussing Floyd’s death and the unrest it has triggered across the country.\n Newsom called on the state’s residents to “be better as human beings” to fight racism and inequality and to be mindful in their protests over the terrible tragedy.\n “I pray that all of us that want to express ourselves do so thoughtfully and gently, but forcefully, in terms of expressing themselves as they should and as they must,” said the governor.", "posttime": "2020-05-30 10:14:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发射,valley,警察", "title": "硅谷警方宣布抗议活动为非法集会，发射催泪瓦斯", "title_en": "Silicon Valley Police Declare Protest an Unlawful Assembly, Fire Tear Gas", "transed": 1, "url": "https://sanfrancisco.cbslocal.com/2020/05/29/george-floyd-protest-in-san-jose-shuts-down-highway-101/", "via": "", "real_tags": ["发射", "valley", "警察"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004350, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在地球上形成地形是一项令人叹为观止的任务，人们经常认为这与将火星变成人类定居者的良好环境有关。但在提供庇护所以维持殖民地方面，还有其他挑战较小的选择。正如罗伯特·祖布林(Robert Zubrin)在下面的文章中解释的那样，冰盖湖泊是一种选择，可以提供所需的资源，同时保护殖民者免受辐射。祖布林是火星协会的创始人，也是几本书和许多论文的作者，他是火星直接概念的创始人，该概念设想使用当前和近期的技术进行探索。在这些页面中，我们研究了他关于星际飞行的许多想法，包括磁帆刹车和核咸水火箭概念。祖布林现在是先锋宇航公司的总裁，他的最新著作是“太空的案例：航天革命如何开启无限可能性的未来”，最近由普罗米修斯图书公司出版。\n这篇论文研究了在冰覆盖的湖泊表面下建立火星定居点的可能性。结果表明，这种聚落提供了许多优势，包括能够迅速设计出非常大的加压空间，全面的辐射防护，高效的发电，温度调节，丰富的资源可用性，户外娱乐，以及创造一个充满活力的当地生物圈，支持不断增长的人口的营养和美学需求。\n火星表面给人类住区带来了许多挑战。大气压只有地球的1%左右，这就要求人们养成加压习惯，使宇航服成为户外活动的必需品，而且对宇宙辐射的屏蔽效果也不是最好的。出于这些原因，一些人建议建造可与城市地铁系统相媲美的大型地下结构，为人类居住提供加压、防护良好的体积[1]。然而，建造这样的系统在土木工程上的挑战是相当艰巨的。此外，这类定居点的粮食必须在温室中种植，这限制了潜在的种植面积，如果放置在地下，要么要求巨大的电力需求，要么需要在地面上建造大型透明的加压结构。火星表面的水要么是冰，要么是永冻土。这些材料可以开采，产品可以运输到基地，但是这样做的后勤工作虽然比月球上任何可能的事情都要好得多，但与直接获得地球上几乎所有人类住区可用的液态水相比，要方便得多。虽然白天的温度可以接受地接近0摄氏度，但夜间的温度降到了零下90摄氏度，这给机械和地面温室带来了问题。然而，尽管夜间温度很低，但由于必须将废热排入近真空环境，核能的效率受到了影响。\n所有这些困难都可以很容易地通过对地球进行地形改造来解决[2]。然而，这是一个巨大的项目，其巨大的规模将需要认真开展已经存在的相当大规模的火星文明和工业力量。出于这个原因，一些人提出了“准地形形成”的想法[3]，即在红色星球的一个更有限的区域(如水手谷)上盖屋顶，然后就在这一部分进行地形形成。但建造这样的屋顶本身就是一项比人类历史上任何一项工程都要大得多的工程项目。\n然而，火星上的一些地方已经被盖上了屋顶。这些是地球上无数充满冰的陨石坑。\n地球的北极和南极地区有许多永久冰盖或“冰下”湖泊[4]。这些湖泊已被证明支持活跃的微生物和浮游生态系统。\n大多数亚北极和高纬度温带湖泊在冬季都被冰雪覆盖，但它们的许多水生群落成员仍然非常活跃，这是冰上渔民所熟知的事实。\n目前，似乎没有。欧空局火星快车轨道器使用探地雷达探测到火星地下深处的高盐度液态水，这种环境对通过钻探进行科学采样非常感兴趣。但是要用来定居，我们需要冰雪覆盖的湖泊，这些湖泊可以直接从地表进入。火星上有很多充满冰的陨石坑。然而，这些不是湖泊，因为虽然它们是由几乎纯净的水冰组成的，但它们从上到下都被冻结了。但这一缺陷是否可以纠正呢？\n科罗廖夫是位于火星北纬73°、东经165°的Mare Boreum四边形中的一个充满冰的撞击坑(图1)。它的直径为81.4公里，包含约2200立方公里的水冰，体积与加拿大北部的大熊湖相似。为什么不用核反应堆融化冰下的水，形成一个巨大的冰盖湖泊呢？\n图1。科罗廖夫陨石坑可以为火星上的亚雷克城提供一个家。图片由欧空局/DLR提供。\n让我们算一算吧。在0摄氏度融化冰需要334kJ/kg。假设冰的初始温度是零下100摄氏度，我们将需要提供这个外加200kJ/kg，总共534kJ/kg。冰的密度为0.92公斤/升，因此融化1立方公里的冰将需要4.9x1017J，或15.6千兆瓦-年的能量。地球上一座1千兆瓦的核电站需要大约3千兆瓦的火力发电。对于位于科罗廖夫附近的发电厂来说也是如此，因为它将使用它在陨石坑中产生的冰水作为极好的散热介质。在5个这样的装置的帮助下，利用它们的余热和电力系统的散热，我们每年可以融化一立方公里的冰。\n科罗廖夫的平均深度为500米，比我们需要的深度要深得多。因此，与其试图完全融化它，一个优化的策略可能是专注于平均深度可能为40米的沿海地区。在这种情况下，每融化一立方公里的冰就会打开25平方公里的液态湖进行沉降。或者，我们可以选择一个更小、深度更小的陨石坑，融化整个陨石坑，除了顶部的冰盖。\n在地球上，10米深的水产生一个大气层的压力。因为火星的重力只有地球的38%大，所以需要26米的水才能产生同样的压力。但没有必要施加如此大的压力。只有10米以上的水，我们仍然有0.38巴的外部压力，或5.6磅/平方英寸，允许3psi的氧气/2.6psi的氮气大气，与天空实验室空间站上使用的相当。以这种方式降低大气中的氮含量也可能是有利的，因为氮只占火星大气的一小部分，这使得火星上更难获得氮，而且限制呼吸空气中的氮含量也将有助于旅行到压力较低的环境，而不用担心弯曲。水下栖息地上方10米的水面也将提供相当于海平面上地球大气所提供的宇宙射线的屏蔽。\n建造栖息地可以使用地球上用于水下栖息地的任何方法。这些包括封闭式压力容器，如潜水艇，或开底系统，如潜水钟。后者提供了最大限度减少结构质量的优势，因为它们的内部压力几乎等于周围环境的压力，而且直接通过底门很容易到达大海，而不需要任何气闸。因此，虽然封闭式潜水艇可能更适合旅行，因为它们的居住者不会经历压力随深度的变化，但开敞式海底栖息地提供了更好的定居选择。因此，我们将把我们的兴趣集中在后者上。\n考虑一个开底沉降模块，它由一个直径100米的圆顶组成，其最高点在地表以下4米，底部在地表以下16米。因此，穹顶有四个甲板，每个甲板有3米的顶部空间。穹顶处于紧张状态，因为里面的所有空气都处于9磅/平方英寸的压力下，相当于底部的湖泊水压，而顶部的湖水压力只有2.2磅/平方英寸，因为穹顶材料在顶部附近的向外压力为6.8磅/平方英寸。圆顶的曲率半径为110米。\n其中σ是屈服应力，P是压力，R是半径，t是穹顶厚度，x是安全系数。假设穹顶由钢制成，屈服应力为100,000磅/平方英寸，x=2。在这种情况下，公式(1)表示：\n钢材的质量约为600吨。这还不错，因为它创造了一个有大约3万平方米居住空间的栖息地。\n如果我们不使用钢，而是用光谱织物做一个帐篷穹顶，它的强度是钢的4倍，密度是钢的1/9，那么穹顶的质量只需要大约17吨。然而，它需要被绑在它的圆周上。9万吨岩石的压舱物重量可以用于这一目的。否则，绳索可以锚定在深入湖底冻土的桩子上。\n这些用人造材料建造穹顶的工程方法的一个有吸引力的替代方案是，简单地将穹顶从覆盖湖泊本身的冰中融化出来。例如，假设冰盖有20米厚，我们在其中融化一个12米高、直径100米、曲率半径为110米的圆顶，填充氧气/氮气混合物将提供与上面讨论的相同大小的栖息地。20米冰(密度=0.92)下的压力为0.7巴，或10.3磅/平方英寸。穹顶的屋顶在8米厚的冰下，其质量施加0.28巴(4.1磅/平方英寸)的压缩压力，留下6.2磅/平方英寸的压力差由冰的强度来保持。冰的抗拉强度约为150磅/平方英寸，因此将这些值粘贴到公式(1)中，我们发现圆顶最薄点处的安全系数x将为：\n这个安全系数已经足够了。这种大小的圆顶网络可以融化到冰盖中，通过隧道将它们底部的厚厚材料连接起来。如果需要曲率半径大得多的圆顶，冰层可以通过冻结光谱网得到极大的加强。\n形成每个这样的圆顶所融化的冰的质量约为8万吨，需要1兆瓦年的能量来融化。它还需要大约90吨氧气才能将气体填满穹顶。这可以通过水电解产生。假设80%效率的电解装置，这将需要1950年千焦耳，或62千瓦-年的电力生产。因此，这样大的居住穹顶可以在湖泊形成之前很久就建造起来，并充满可呼吸的气体，使用的能源要少得多。\n压缩的居住结构可以在更大的冰下形成。这是因为冰的密度是水的92%，所以如果湖面下50米深的冰柱融化，就会产生42米深的水柱和8米的空隙，可以充满空气。\n所以，让我们假设我们有一个冰坑，冰坑的一部分，甚至是半径5公里，深度70米或更深的冰川。我们融化它的一部分，从冰下20米到下50米。如上所述，这将在水面上形成一个4米厚的净空。这个空隙上方的冰的重量是7磅/平方英寸，所以我们会用压力为6.999磅/平方英寸的氧气/氮气混合物来填充空隙。这将抵消几乎所有的重量，使冰盖处于极其温和的压缩状态。(温和的压缩比轻微的拉伸更可取，因为冰的压缩强度约为1500磅/平方英寸，是拉伸强度的十倍。)。在这种情况下，悬挑表面的曲率半径可以是无限的。因此，将创造一个78平方公里的有压力和充足屏蔽的宜居区。栖息地可以放在这个室内湖泊上的木筏或游艇上，或者形成一个冰架，为大部分地区的传统建筑提供坚实的地板。\n创建这个室内湖城需要融化的总水量是4立方千米。通过我们提议的5Gwe电力系统，这可以在大约4年内完成。随着时间的推移，进一步的供暖将继续横向扩大宜居区。如果湖很深，以至于水柱下面有冰，它就会逐渐融化，也会增加定居点的净空。\n亚雷克火星聚居地的生活环境不需要局限于充满空气的栖息地内部。通过融化冰层，我们为周围充满活力的水生生物圈创造了可能性，穿着普通潜水服和潜水装备的火星殖民者可以很容易地参观到那里。\n这个湖正在用陆上或漂浮的核反应堆排热产生的热水融化。如果热量被排斥在湖底附近，就会出现猛烈的上升流，使湖水获得强大的矿物质营养。\n假设冰盖减少到30米以下，白天就会有足够的自然光来支持浮游植物的生长，就像在地球北冰洋观察到的那样[5]。然而，通过添加人造光，湖泊的初级生物生产力可以得到极大的提高。\n北冰洋的生物活性高达75N，全年平均昼夜太阳照度约为50W/m2。如果以此为标准，那么我们每GW的可用电力可以用来照亮20平方公里的湖泊。再加上热上升流产生的富含矿物质的水，以及根据需要从火星大气中人工输送二氧化碳，这种照明可以在定居点周围的水域创造一个极其富有生产力的生物圈。\n最先释放到湖中的生物应该是光合作用的浮游植物和其他藻类，包括海藻等宏观形式。这些可以用来给水充氧。一旦做到这一点，就可以放生动物了，首先是浮游动物，然后是各种各样的水生大型动物，可能包括海绵、珊瑚、蠕虫、软体动物、节肢动物和鱼类。企鹅和海獭可能会紧随其后。\n随着湖泊的继续发展，它的城市将会增加，催生出人类文明的一个新分支，在一个新世界上支撑和支撑着一个充满活力的新生物圈。\n我们发现火星最适合定居的地方可能是水下。通过在冰盖的陨石坑表面下创造湖泊，我们可以创造微型世界，提供可接受的压力、温度、辐射防护、宽敞的生活空间，以及生命和文明所需的一切。火星的次级城市可以作为探索和开发这颗红色星球的基地，提供新的国家可以在其中诞生和发展的家园，直到它们能够发挥足够的力量走出去，接受火星本身的地形改造的挑战。\n1.弗兰克·克罗斯曼(Frank Crossman)，编辑，《火星殖民地：定居红色星球的计划》，火星协会，北极星图书出版社，2019年\n2.罗伯特·祖布林(Robert Zubrin)与理查德·瓦格纳(Richard Wagner)合著的“火星的案例：定居红色星球的星球和为什么我们必须”，西蒙和舒斯特，纽约，1996年，2011年。\n3.理查德·S·泰勒，“Paraterraform：the Worldhouse Concept”，“英国星际学会杂志”，第一卷。1992年8月，第45期，第8期，第341-352页。\n5.Kevin Arrigo等人，“海冰下大量浮游植物开花”，“科学”，第336卷，第1408页，2012年6月15日，https://www2.whoi.edu/staff/hsosik/wp-content/uploads/sites/11/2017/03/Arrigo_etal_Science2012.pdf.。访问时间为2020年5月15日。", "note_en": "Terraforming a world is a breathtaking task, one often thought about in relation to making Mars into a benign environment for human settlers. But there are less challenging alternatives for providing shelter to sustain a colony. As Robert Zubrin explains in the essay below, ice-covered lakes are an option that can offer needed resources while protecting colonists from radiation. The founder of the Mars Society and author of several books and numerous papers, Zubrin is the originator of the Mars Direct concept, which envisions exploration using current and near-term technologies. We’ve examined many of his ideas on interstellar flight, including magsail braking and the nuclear salt water rocket concept, in these pages. Now president of Pioneer Astronautics, Zubrin’s latest book is  The Case for Space: How the Revolution in Spaceflight Opens Up a Future of Limitless Possibility, recently published by Prometheus Books.\n   This paper examines the possibilities of establishing Martian settlements beneath the surface of ice-covered lakes. It is shown that such settlements offer many advantages, including the ability to rapidly engineer very large volumes of pressurized space, comprehensive radiation protection, highly efficient power generation, temperature regulation, copious resource availability, outdoor recreation, and the creation of a vibrant local biosphere supporting both the nutritional and aesthetic needs of a growing human population.\n   The surface of Mars offers many challenges to human settlement. Atmospheric pressure is only about 1 percent that of Earth, imposing a necessity for pressurized habits, making spacesuits necessary for outdoor activity, and providing less than optimum shielding against cosmic radiation. For these reasons some have proposed creating large subsurface structures, comparable to city subway systems, to provide pressurized well-shielded volumes for human habitation [1]. The civil engineering challenges of constructing such systems, however, are quite formidable. Moreover, food for such settlements would have to be grown in greenhouses, limiting potential acreage, and imposing either huge power requirements if placed underground, or the necessity of building large transparent pressurized structures on the surface. Water is available on the Martian surface as either ice or permafrost. These materials can be mined and the product transported to the base, but the logistics of doing so, while greatly superior to anything possible on the Moon, are considerably less convenient than the direct access to liquid water available to nearly all human settlements on Earth. While daytime temperatures are acceptably close to 0 C, nighttime temperatures drop to -90 C, imposing issues on machinery and surface greenhouses. Yet despite the cold night temperatures, the efficiency of nuclear power is impaired by the necessity of rejecting waste heat to a near-vacuum environment.\n All of these difficulties could readily be solved by terraforming the planet [2]. However, that is an enormous project whose vast scale will require an already-existing Martian civilization of considerable size and industrial power to be seriously undertaken. For this reason, some have proposed the idea of “para terraforming,” [3] that is, roofing over a more limited region of the Red Planet, such as the Valles Marineris, and terraforming just that part. But building such a roof would itself be a much larger engineering project than any yet done in human history.\n There are, however, locations on Mars that have already been roofed over. These are the planet’s numerous ice-filled craters.\n  Earth’s Arctic and Antarctic regions feature numerous permanently ice covered or “sub glacial” lakes [4]. These lakes have been shown to support active microbial and planktonic ecosystems.\n Most sub Arctic and high latitude temperate lakes are ice-covered in winter, but many members of their aquatic communities remain highly active, a fact well-known to ice fishermen.\n  At the moment, it appears that there are not. The ESA Mars Express orbiter has detected highly-saline liquid water deep underground on Mars using ground penetrating radar, and such environments are of great interest for scientific sampling via drilling. But to be of use for settlement, we need ice-covered lakes that are directly accessible from the surface. There are plenty of ice-filled craters on Mars. These are not lakes, however, as while composed of nearly pure water ice, they are frozen top to bottom. But might this shortcoming be correctable?\n  Korolev is an ice-filled impact crater in the Mare Boreum quadrangle of Mars, located at 73° north latitude and 165° east longitude (Fig. 1). It is 81.4 kilometers in diameter and contains about 2,200 cubic kilometers of water ice, similar in volume to Great Bear Lake in northern Canada. Why not use a nuclear reactor to melt the water under the ice to create a huge ice-covered lake?\n  Fig. 1. Korolev Crater could provide a home for sublake city on Mars. Photo by ESA/DLR.\n Let’s do the math. Melting ice at 0 C requires 334 kJ/kg. We will need to supply this plus another 200 kJ/kg, assuming that the ice’s initial temperature is -100 C, for 534 kJ/kg in all. Ice has a density of 0.92 kg/liter, so melting 1 cubic kilometer of ice would require 4.9 x 10 17 J, or 15.6 GW-years of energy. A 1 GWe nuclear power plant on Earth requires about 3 GWt of thermal power generation. This would also be true in the case of a power plant located adjacent to Korolev, since it would be using the ice water it was creating in the crater as an excellent heat rejection medium. With the aid of 5 such installations, using both their waste heat and the dissipation from their electric power systems, we could melt a cubic kilometer of ice every year.\n Korolev averages 500 m in depth, which is much deeper than we need. So rather than try to melt it all the way through, an optimized strategy might be to focus on coastal regions with an average depth of perhaps 40 meters. In that case, each cubic kilometer of ice melted would open 25 square kilometers of liquid lake for settlement. Alternatively, we could just choose a smaller crater with less depth, and melt the whole thing, except the ice cover at its top.\n  On Earth, 10 meters of water creates one atmosphere of pressure. Because Martian gravity is only 38 percent as great as that of Earth, 26 meters of water would be required to create the same pressure. But so much pressure is not necessary. With as little as 10 meters of water above, we would still have 0.38 bar of outside pressure, or 5.6 psi, allowing a 3 psi oxygen/2.6 psi nitrogen atmosphere comparable to that used on the Skylab space station. Reducing nitrogen atmospheric content in this way could also be advantageous because nitrogen is only a small minority constituent of the Martian atmosphere, making it harder to come by on Mars, and limiting the nitrogen fraction of breathing air would also facilitate traveling to lower pressure environments without fear of getting the bends. Ten meters of water above an underwater habitat would also provide shielding against cosmic rays equivalent to that provided by Earth’s atmosphere at sea level.\n Construction of the habitats could be done using any the methods employed for underwater habitats on Earth. These include closed pressure vessels, like submarines, or open-bottom systems, like diving bells. The latter offer the advantage of minimizing structural mass since they have an interior pressure nearly equal to that of the surrounding environment, and direct easy access to the sea via their bottom doors, without any need for airlocks. Thus, while closed submarines are probably better for travel, as their occupants do not experience pressure changes with depth, open bottom habitats offer superior options for settlement. We will therefore focus our interest on the latter.\n Consider an open-bottom settlement module consisting of a dome 100 m in diameter, whose peak is 4 meters below the surface and whose base in 16 meters below the surface. The dome thus has four decks, with 3 meters of head space for each. The dome is in tension, because all the air in it is all at a pressure of 9 psi, corresponding to the lake water pressure at its base, while the lake water pressure at its top is only about 2.2 psi, for an outward pressure on the dome material near the top of 6.8 psi. The dome has a radius of curvature of 110 m.\n   Where σ is the yield stress, P is the pressure, R is the radius, t is the dome thickness, and x is the safety factor. Let’s say the dome is made of steel with a yield stress of 100,000 psi and x=2. In that case, equation (1) says that:\n  The mass of the steel would be about 600 tons. That’s not to bad, for creating a habitat with about 30,000 square meters of living space.\n If instead of using steel, we made a tent dome from spectra fabric, which has 4 times the strength of steel and 1/9th the density, the mass of the dome would only need to be about 17 tons. It would, however, need to be tied down around its circumference. Ballast weights of 90,000 tons of rocks could be used for this purpose. Otherwise the tie down lines could be anchored to stakes driven deep into the frozen ground under the lake.\n An attractive alternative to these engineering methods for creating a dome out of manufactured materials could be to simply melt the dome out of the ice covering the lake itself. For example, let’s say the ice cover is 20 m thick, and we melt a dome into it that is 12 m tall, 100 m in diameter, and has a radius of curvature of 110 m. Filling this with an oxygen/nitrogen gas mixture would provide a habitat of equal size to that discussed above. The pressure under 20 m of ice (density = 0.92) is 0.7 bar, or 10.3 psi. The roof of the dome is under 8 m of ice, whose mass exerts of compressive pressure of 0.28 bar, or 4.1 psi, leaving a pressure difference of 6.2 psi to be held by the strength of the ice. The tensile strength of ice is about 150 psi, so sticking these values into equation (1) we find that the safety factor, x, at the dome’s thinnest point would be:\n  This safety factor is more than adequate. Networks of domes of this size could be melted into the ice cover, linked by tunnels through the thick material at their bases. If domes with a much larger radius of curvature were desired, the ice could be greatly strengthened by freezing a spectra net into it.\n The mass of ice melted to create each such dome is about 80,000 tons, requiring 1 MWt-year of energy to do the melting. It would also require about 90 tons of oxygen to fill the dome with gas. This could be generated via water electrolysis. Assuming 80% efficient electrolysis units, this would require 1950 GJ, or 62 kWe-year of electric power to produce. Such large habitation domes could therefore be constructed and filled with breathable gas well in advance of the creation of the lake using much more modest power sources.\n Compressive habitation structures can be created under ice that are much larger still. This is so because ice has 92 percent the density of water, so that if a 50 meters deep column of ice beneath the lake’s ice surface were melted, it would yield a column of water 42 meters deep and 8 meters of void, which could be filled with air.\n So, let’s say we had an ice crater, section of an ice crater, or even a glacier 5 km in radius and 70 meters or more deep. We melt a section of it starting 20 m under the top of the ice and going down 50 m. As noted, this would create a headroom space 4 m thick above the water. The ice above this void would have a weight of 7 psi, so we would fill the void with an oxygen/nitrogen gas mixture with a pressure of 6.999 psi. This would negate almost all the weight to leave the ice roof in an extremely mild state of compression. (Mild compression is preferred to mild tension, because the compressive strength of ice is about 1500 psi – ten times the tensile strength.) Under such circumstances the radius of curvature of the overhanging surface could be unlimited. As a result, a pressurized and amply shielded habitable region of 78 square kilometers would be created. Habitats could be placed on rafts or houseboats on this indoor lake, or an ice shelf formed to provide a solid floor for conventional buildings over much of it.\n The total amount of water that would need to be melted to create this indoor lake city would be 4 cubic kilometers. This could be done in about 4 years by our proposed 5 GWe power system. Further heating would continue to expand the habitable region laterally over time. If the lake were deep, so that there was ice beneath the water column, it would gradually melt, increasing the headroom over the settlement as well.\n  The living environment of the sublake Mars settlement need not be limited to the interior of the air-filled habitats. By melting the ice, we are creating the potential for a vibrant surrounding aquatic biosphere, which could be readily visited by Mars colonists wearing ordinary wet suits and SCUBA gear.\n The lake is being melted using hot water produced by the heat rejection of onshore or floating nuclear reactors. If the heat is rejected near the bottom of the lake, forceful upwelling will occur, powerfully fertilizing the lake water with mineral nutrients.\n Assuming that the ice cover is reduced to less than 30 meters, there will be enough natural light during daytime to support phytoplankton growth, as has been observed in the Earth’s Arctic ocean [5]. The lake’s primary biological productivity could be greatly augmented, however, by the addition of artificial light.\n The Arctic ocean exhibits high biological activity as far north as 75 N, where the sea receives an average day/night year-round solar illumination of about 50 W/m 2. If we take this as our standard, then each GW of our available electric power could be used to illuminate 20 square kilometers of lake. Combined with the mineral-rich water produced by thermal upwelling, and artificial delivery of CO 2 from the Martian atmosphere as required, this illumination could serve to create an extremely productive biosphere in the waters surrounding the settlement.\n The first organisms to be released into the lake should be photosynthetic phytoplankton and other algae, including macroscopic forms such as kelp. These would serve to oxygenate the water. Once that is done, animals could be released, starting with zooplankton, with a wide range of aquatic macrofauna, potentially including sponges, corals, worms, mollusks, arthropods, and fish coming next. Penguins and sea otters could follow.\n As the lake continues to grow, its cities would multiply, giving birth to a new branch of human civilization, supported by and supporting a lively new biosphere on a new world.\n  We find that the best places to settle Mars could be under water. By creating lakes beneath the surface of ice-covered craters, we can create miniature worlds, providing acceptable pressure, temperature, radiation protection, voluminous living space, and everything else needed for life and civilization. The sublake cities of Mars could serve as bases for the exploration and development of the Red Planet, providing homes within which new nations can be born and grow in size, technological ability, and industrial capacity, until such time as they can wield sufficient power to go forth and take on the challenge of terraforming Mars itself.\n  1. Frank Crossman, editor,   Mars Colonies: Plans for Settling the Red Planet, The Mars Society, Polaris Books, 2019\n 2. Robert Zubrin with Richard Wagner,   The Case for Mars: The Planet to Settle the Red Planet and Why We Must, Simon and Schuster, NY, 1996, 2011.\n 3. Richard S. Taylor, “Paraterraforming: The Worldhouse Concept,”  Journal of the British Interplanetary Society, vol. 45, no. 8, Aug. 1992, p. 341-352.\n  5. Kevin Arrigo, et al, “Massive Phytoplankton Blooms Under Sea Ice,”  Science, Vol. 336, page 1408, June 15, 2012  https://www2.whoi.edu/staff/hsosik/wp-content/uploads/sites/11/2017/03/Arrigo_etal_Science2012.pdf. Accessed May 15, 2020.", "posttime": "2020-05-30 10:14:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "火星,布莱克,settlements", "title": "火星的次布莱克定居点", "title_en": "Sublake Settlements for Mars", "transed": 1, "url": "https://www.centauri-dreams.org/2020/05/29/sublake-settlements-for-mars/", "via": "", "real_tags": ["火星", "布莱克"]}, {"category": "", "categoryclass": "", "imagename": "b8f9547eccb42c7867842b1b34d1cfca.jpg", "infoid": 1004348, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "印度洋海底的摄像机拍摄到了有史以来最深的章鱼目击记录。\n这只动物是在爪哇海沟下7000米处被发现的，几乎比之前可靠的记录深了2公里。\n研究人员在“海洋生物学”杂志上报道了这一发现，他们说这是小飞象章鱼的一个物种。\n这个名字是对这些动物眼睛上方突出的耳状鳍的认可，这些鳍让它们看起来像20世纪40年代的迪士尼卡通人物。\n贾米森博士的设备拍摄了两条章鱼--一条下降到5760米，另一条下降到6957米。动物个体长分别为43 cm和35 cm。\n在非常深的地方已经发现了章鱼的碎片和卵，但在这次发现之前，之前最深的可靠目击是在5145米以下。\n这是一张50年前在巴巴多斯海域拍摄的动物的黑白照片。\n印度洋观测的意义在于，我们现在知道，章鱼可以在全球至少99%的海底找到潜在的合适栖息地。但Jamieson博士说，那些确实生活在深海的动物显然需要一些特殊的适应。\n他们必须在牢房里做些聪明的事情。如果你想象一个细胞就像一个气球--它会想要在压力下坍塌。因此，它需要一些智能的生物化学来确保它保留那个球体，这位科学家解释说。\n贾米森博士在担任“五深探险队”首席科学家期间记录了这只新章鱼。得克萨斯州金融家维克多·韦斯科沃在这个项目中乘坐潜水器前往地球五大洋的最深处。\n当Vescovo先生创造人类潜水纪录时，Jamieson博士正在进行串联的科学调查。\n他希望他的发现能帮助消除人们对海洋最深处的一些误解。\n海洋生态学和海洋生物学的规律实际上大同小异。我们需要小飞象章鱼来模糊我们认为关心的深度和我们不关心的深度之间的界限。那种认为只有善良的维多利亚怪胎表演中的动物才生活在深度的想法是不正确的。\nJamieson博士目前是深海咨询公司Armatus Ocean的首席执行官。他也附属于纽卡斯尔大学。", "note_en": "The deepest ever sighting of an octopus has been made by cameras on the Indian Ocean floor.\n The animal was spotted 7,000m down in the Java Trench - almost 2km deeper than the previous reliable recording.\n Researchers, who report the discovery  in the journal Marine Biology, say it&#39;s a species of &#34;Dumbo&#34; octopus.\n The name is a nod to the prominent ear-like fins just above these animals&#39; eyes that make them look like the 1940s Disney cartoon character.\n          Dr Jamieson&#39;s equipment filmed two octopuses - one on a drop to 5,760m and a second to 6,957m. The individual animals were 43cm and 35cm in length.\n  Octopus fragments and eggs have been found at very great depths, but until this discovery, the previous deepest reliable sighting was at 5,145m down.\n That was a black and white photo of an animal taken 50 years ago off Barbados.\n  The significance of the Indian Ocean observations is that we now know that octopuses can find potentially suitable habitat across at least 99% of the global seafloor. But those animals that do live at depth will clearly need some special adaptations, says Dr Jamieson.\n &#34;They&#39;d have to do something clever inside their cells. If you imagine a cell is like a balloon - it&#39;s going to want to collapse under pressure. So, it will need some smart biochemistry to make sure it retains that sphere,&#34; the scientist explained.\n    Dr Jamieson recorded the new octopus while working as chief scientist on the  Five Deeps Expedition. This was the project that saw Texan financier Victor Vescovo take a submersible to the deepest sectors of the five major oceans on Earth.\n While Mr Vescovo was setting human dive records, Dr Jamieson was conducting the tandem science investigations.\n He hopes his findings can help dispel some of the misunderstandings about the deepest parts of the ocean.\n &#34;The laws of marine ecology and marine biology are actually much the same. And we need the Dumbo octopus out there to blur that line between the depths we think we care about and the depths we don&#39;t. This idea that only animals in a kind Victorian freak show live at depth isn&#39;t right.&#34;\n Dr Jamieson is currently the CEO of Armatus Oceanic, a deep-sea consultancy. He&#39;s also affiliated to Newcastle University.", "posttime": "2020-05-30 09:58:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "相机,捕捉到,deepest,动物", "title": "相机捕捉到的世界上最深的章鱼", "title_en": "World's deepest octopus captured on camera", "transed": 1, "url": "https://www.bbc.com/news/science-environment-52839678", "via": "", "real_tags": ["相机", "捕捉到", "deepest", "动物"]}, {"category": "", "categoryclass": "", "imagename": "3e9199bb3c3daeedc1dc770f857bcd92.jpg", "infoid": 1004347, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当两个针对同一现象的描述在概念上不连续时，就会发生突现。这并不意味着涌现是一种纯粹的主观现象--只是科学上的“双重报道”可能是寻找涌现现象的好去处。\n例如，在八哥咕噜声的情况下，有对单个鸟类的综合描述，也有对作为一个统一实体的群体的描述。后一种现象需要从流体动力学的概念方面进行描述，但对单个鸟类的描述，无论多么详细，通常都不会。\n在物理相变的情况下，对物质的一个相的描述，例如气体，不能完全映射到对其他相的描述上。例如，表面张力没有为气体定义，因为气体没有表面。在从气到液的转变过程中，不仅出现了一个全新的属性，而且成为后转变系统的一个重要特征。从不同的角度来看，我们可以说，正是这种突现的定性属性使我们能够首先确定转变已经发生。某些控制变量(如温度或压力)的定量读数本身不能用来标记“事件”-它们只能用来索引它们。\n一种常见的理论析取类型涉及对部分和整体的描述不匹配。从原子性质的角度描述微观成分并不能顺利地从热力学、流体力学或固态物理的角度进行描述。在物理学中，从一个理论论域到另一个论域的转换缺乏流畅性并不总是明显的，因为这两个领域通常在数学上有很好的规定，而在流行的(甚至是入门教科书级别的)解释中，能够实现转换的(通常是临时的)联系假设被忽略了。\n这种理论上的非光滑性的存在是毋庸置疑的。那么，为什么出现可能会被认为是有争议的呢？两个原因不言而喻。第一个与一般科学的本体论承诺有关，第二个与人类代理的地位有关。\n只要科学理论被理解为限制了有用领域的描述，新兴现象及其伴随的理论就不会对科学构成很大的威胁，因为在这样的框架下，科学只有一个工具性的目标。但是，科学世界观的拥护者通常会提出一个更雄心勃勃的主张：最好的理论与宇宙的基本性质同构。在这样的框架下，致力于科学理论的统一相当于致力于宇宙本身的完整性和可理解性。在科学与自然关系的同构框架中，理论之间的分离是令人不快的，因为它们似乎表明现实本身并不完全受法律管辖，因此包含一些非理性或不可言喻的成分。因此，明显浮现的例子必须理解为理论不完整或计算不足的情况。\n还原论可以理解为(1)声称宇宙的可理解性取决于科学理论的统一性，(2)认为最基本的科学理论描述了宇宙最小的物理部分。还原论也可以与特定的科学学科相关联，这样一门学科的各个部分(比如器官水平生物学中的细胞)就是另一门学科(分子生物学中的细胞)的整体。由于还原论作为一种研究方法(特别是在物理学之外)很少获得成功，它必须首先被理解为一种形而上学的承诺。尽管还原论对科学实践的指导作用有限，但它是一种强大的文化理念。我们可以称之为现实的乐高积木概念：只有乐高积木才是真实的，所以“基础”科学涉及识别积木是什么以及它们是如何相互作用的，而“应用科学”涉及发现能够解释上述现象的积木的正确组合或排列。这一观点在物理系流传的笑话中得到了体现，比如欧内斯特·卢瑟福(Ernest Rutherford)的一句话：“科学由物理和集邮组成。”\n在还原论本体论中，紧急现象总是可以理解为“真正的”还原论理论还没有被发现的情况，或者(如果它被理解为已经存在)计算过于密集而不能应用于宏观现象的情况。因此，从还原论的角度来看，涌现只能是“弱的”或“认识性的”。因此，作为一种科学立场的浮现论必须被理解为提出了一种超越表面浮现的本体论主张：即宇宙的可理解性确实存在。\n还原论和涌现论之间的本体论辩论在解释人类作用的背景下具有文化重要性。如果与生命体(人类和其他生物实体)相关的现象最终要用它们的组成部分来解释，那么因果关系能归因于一个紧急的动因吗？换句话说，是人类导致了他们的行为，还是必须在分子生物学的层面上寻找最终原因？如果采用后一种观点，那么人类代理就成为一种幻觉或附属物，因为它将因果关系限制在“基本”实体上。因此，在这一背景下的紧急情况可以被理解为试图为科学上连贯的人类代理形式创造“本体空间”。\n为了探索本体论对代理的含义，我们需要明确我们对因果关系是什么的直觉。不出所料，这个富有挑战性和争议性的话题将在未来的一篇文章中讨论。\n*假设我对未来行为的自我模型是顺利的。这是一个很大的假设。：P。\n这篇帖子起源于一个正在进行的关于“浮现”的杂志俱乐部。在这篇文章中，我没有提供任何参考，但希望在未来我会写一些简短的帖子来解释这些想法是从哪里来的。", "note_en": "Emergence occurs when there is a conceptual discontinuity between two descriptions targeting the same phenomenon. This does not mean that emergence is a purely subjective phenomenon — only that scientific ‘double coverage’ may be a good place to look for emergent phenomena.\n For example, in the case of starling  murmuration, there is an aggregate description of individual birds, and a description of the flock as a unified entity. The latter phenomenon invites description in terms of concepts from fluid dynamics, but descriptions of individual birds, however detailed, typically do not.\n In the case of  phase transitions in physics, the description of one phase of matter, such as gas, does not fully map onto descriptions of the other phases. Surface tension, for example, is not defined for gases, since gases do not have surfaces. In the transition from gas to liquid, a qualitatively new attribute not only emerges, it becomes a defining feature of the post-transition system. From a different perspective we can say that it is the emergent qualitative property that enables us to determine that the transition has occurred in the first place. Quantitative readings of some control variable (such as temperature or pressure) cannot themselves be used to mark out ‘events’ — they can only be used to index them.\n A common type of theoretical disjunction involves mismatch between descriptions of parts and wholes. A description of micro-level constituents in terms of atomic properties does not lead in any smooth way to descriptions in terms of thermodynamics, hydrodynamics, or solid state physics. In physics, the lack of smoothness in transitioning from one theoretical domain of discourse to another is not always apparent, since the two domains are often well specified mathematically, while the (often ad hoc) linking assumptions enabling the transition are neglected in popular (and even introductory textbook-level) explanations.\n   The existence of such theoretical non-smoothness is not in doubt. Why then might emergence be considered controversial? Two reasons suggest themselves. The first has to do with the ontological commitments of science in general, and the second has to do with the status of human agency.\n As long as scientific theories are understood as descriptions that have restricted domains of usefulness, emergent phenomena and their accompanying theories pose no great threat to science, which in such a framework only has an instrumental goal. But subscribers to a scientific worldview often make a more ambitious claim: that the best theories are  isomorphic with the fundamental nature of the universe. In such a framework, a commitment to the unity of scientific theories amounts to a commitment to the integrity and intelligibility of the universe as such. Disjunctions between theories are unpalatable in isomorphic framings of the science-nature relationship, since they  seem to suggest that reality itself is not fully law-governed, and therefore contains some irrational or ineffable component. Examples of apparent emergence must then be understood as cases of incomplete theorizing or insufficient computation.\n Reductionism can be understood as a combination of (1) the claim that the  intelligibility of the universe depends on the  unity of scientific theories, and (2) the idea that the most fundamental scientific theories describe the  smallest physical parts of the universe. Reductionism can also be relativized to specific scientific disciplines, so that the parts of one discipline (say, cells in the context of organ-level biology) are the wholes of another discipline (cells in the context of molecular biology). Since reductionism has had only infrequent success as a research methodology (especially outside of physics), it must be understood primarily as a metaphysical commitment. Despite its limited usefulness as a guide to scientific practice, reductionism is a powerful cultural idea. We might call it the Lego-block conception of reality: only the Lego blocks are real, so ‘fundamental’ science involves identifying what the blocks are and how they interact, while ‘applied’ science involves discovering the right combination or permutation of blocks that accounts for the phenomenon in question. This perspective is captured in jokes that circulate in physics departments, such as Ernest Rutherford’s line “Science consists of physics and stamp-collecting.”\n An emergent phenomenon can always be understood in a reductionist ontology as a situation in which the ‘true’ reductionist theory simply hasn’t been discovered yet, or (if it is understood as already existing) is too computationally intensive to be applied to macro-scale phenomena. Thus from the reductionist perspective, emergence can only ever be “weak” or “epistemic”.  Emergentism as a scientific stance must then be understood as making an ontological claim that goes beyond the mere occurrence of apparent emergence: that the intelligibility of the universe does not depend on isomorphism between the universe and the (as yet undiscovered) fully reductionist theory. Emergentism instead suggests the possibility that part-whole relationships may not be fully explainable using causal chains proceeded from parts to wholes. Emergentism therefore raises a possibility that sounds radical and perhaps even  meaningless from the reductionist perspective: that parts and wholes have ‘equal’ ontological priority, with the wholes constraining the parts just as much as the parts constrain the wholes. Along with this ontology that departs from strict hierarchy, emergentism may draw attention to the possibility that the universe is in some sense open to novel phenomena that cannot be perfectly anticipated using any scientific theory, but, once present, can still be studied using scientific methods. In other words, emergentism suggests that even our best quantitative theories cannot always tell us when qualitative changes will occur.\n The ontological debate between reductionism and emergentism takes on cultural importance in the context of explaining human agency. If phenomena associated with living agents (humans and other biological entities) are ultimately to be explained in terms of their constituent parts, then can causation be attributed to an emergent agent? In other words, do humans cause their actions, or must the ultimate causes be sought at the level of molecular biology? If the latter perspective is taken then human agency becomes a kind of illusion or epiphenomenon, as it restricts causality to ‘fundamental’ entities. Emergentism in this context can therefore be understood as an attempt to create ‘ontic space’ for scientifically coherent forms of human agency.\n To explore the implications of ontology on agency, we will need to make explicit our intuitions about what causality is. This challenging and, unsurprisingly, contested topic will* be dealt with in a future essay.\n   * Assuming my self-model of future behavior is smooth. Which is a big assumption. :P\n   This post grew out of an ongoing journal club on emergence.  In this post I haven’t really provided any references, but hopefully in future I’ll do short posts explaining where these ideas came from.", "posttime": "2020-05-30 09:43:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "浮现,emergence,科学", "title": "什么是浮现？", "title_en": "What is emergence?", "transed": 1, "url": "https://axispraxis.wordpress.com/2020/05/27/what-is-emergence-and-why-should-we-care-about-it/", "via": "", "real_tags": ["浮现", "emergence", "科学"]}]