[{"category": "", "categoryclass": "", "imagename": "908b6d9c4a4a9a98e5dca5a2a5aa0f01.jpg", "infoid": 1072337, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "OSM 地图上覆盖着数十亿条 GPS 信号轨迹。红色区域代表潜在的地图错误。由于多种原因，区域可能会出现错误的路线：缺少道路、错误的单向街道、未连接的道路等等。使用数十亿条 GPS 轨迹，MapMetrics 可以评估驾驶员离 OSM 引擎建议的路线有多近或多远。当 MapMetrics 发现驾驶员偏离 OSM 建议的路线很远的较大偏差时，MapMetrics 会以红到绿的颜色比例突出显示这些地图区域。 MapMetrics 允许您在非常大的区域内找到地图可能存在这些问题的位置，并使社区能够专注于热点。正如您在上面看到的，这是一项正在进行的工作：MapMetrics 标志，在红色、科罗拉多州滑雪区和丹佛机场。这些本身都不是坏事，但滑雪道和滑行道路线还不是一回事！随着时间的推移，MapMetrics 将过滤掉这些，只关注道路。", "note_en": "The OSM map overlaid with billions of GPS signal traces. The areas in red represent potential map errors.\n    Areas can have bad routing for a variety of reasons: missing roads, wrong one-way streets, roads that aren’t connected and so on.\n   Using billions of GPS traces, MapMetrics can assess how close or far drivers are from the route that the OSM engine suggests. When MapMetrics identifies large deviations, where drivers have strayed far from the route suggested in OSM, MapMetrics highlights those map areas with a red-to-green color scale.\n        MapMetrics allows you to find where the map may have these issues over very large areas and enables the community to focus on the hotspots. As you can see above it’s a work in progress: MapMetrics flags, in red, Colorado ski areas and the Denver Airport. Neither of these are bad per se, but ski run and taxiway routing isn’t a thing yet! Over time, MapMetrics will filter these out to focus on just the roads.", "posttime": "2021-08-10 00:11:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "生日快乐,birthday,mapmetrics", "title": "生日快乐，OpenStreetMap", "title_en": "Happy Birthday, OpenStreetMap", "transed": 1, "url": "https://www.tomtom.com/blog/maps/tomtom-openstreetmaps-mapmetrics-map-editing/", "via": "", "real_tags": ["生日快乐", "birthday"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072336, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是自有记录以来首次发生，俄罗斯气象官员警告大火正在恶化西伯利亚肆虐森林大火产生的烟雾在有记录的历史上首次到达北极，因为俄罗斯监测机构警告说，大火正在恶化。在过去的几年里，毁灭性的野火席卷西伯利亚，而且越来越频繁，俄罗斯的气象官员和环保主义者将其与气候变化和资金不足的森林服务联系起来。联合国气候专家周一发表了一份报告，该报告明确表明全球变暖的发展速度比人们担心的要快，几乎全都归咎于人类。今年西伯利亚受灾最严重的地区之一是雅库特——俄罗斯最大、最寒冷的地区，位于永久冻土层之上——这里的高温和干旱创历史新高。俄罗斯气象监测机构 Rosgidromet 周一表示，该地区（也称为萨哈）的局势“继续恶化”。据 Rosgidromet 称，该地区有近 340 万公顷（840 万英亩）的土地正在燃烧，包括难以进入和偏远的地区。周六，美国宇航局表示，其卫星图像显示野火烟雾“从雅库特到达北极超过 3,000 公里（1,800 英里）”，称其为“有记录的历史上的第一次”。它补充说，8月6日，俄罗斯大部分地区都被烟雾笼罩。\n环保人士指责当局每年都会根据一项法律允许大面积燃烧，如果灭火成本大于造成的损失或不影响居民区，他们就不得干预。根据俄罗斯林业机构的数据，今年的火灾已经摧毁了超过 1400 万公顷的土地，这是自世纪之交以来第二个最严重的火灾季节。绿色和平俄罗斯森林项目负责人阿列克谢·雅罗申科将俄罗斯野火面积不断扩大与气候变化的影响以及“国家森林管理的持续衰退”联系起来。", "note_en": "Occurrence is first since records began and comes as Russian weather officials warn blazes are worsening\n    Smoke from raging  forest fires in Siberia has reached the north pole for the first time in recorded history, as a Russian monitoring institute warned the blazes were worsening.\n Devastating wildfires have ripped across Siberia with increasing regularity over the past few years, which Russia’s weather officials and environmentalists have linked to climate change and an underfunded forest service.\n  UN climate experts on Monday published a report that unequivocally shows global heating is  unfolding more quickly than feared and humanity is almost entirely to blame.\n  One of Siberia’s hardest-hit regions this year has been Yakutia – Russia’s largest and coldest region that sits atop permafrost – which has had record high temperatures and drought.\n Russia’s weather monitoring institute Rosgidromet said on Monday the situation in the region, also known as Sakha, “continues to deteriorate”. According to Rosgidromet, close to 3.4m hectares (8.4m acres) are burning in the region, including areas that are difficult to access and remote.\n  On Saturday, the US space agency Nasa said its satellite images showed wildfire smoke travelling “more than 3,000km (1,800 miles) from Yakutia to reach the north pole”, calling it “a first in recorded history”. It added that on 6 August most of Russia was covered in smoke.\n Environmentalists blame the authorities for letting large areas burn every year under a law that allows them not to intervene if the cost of fighting fires is greater than the damage caused or if they do not affect inhabited areas.\n According to Russia’s forestry agency, this year’s fires have ravaged more than 14m hectares, making it the second-worst fire season since the turn of the century.\n The head of Greenpeace Russia’s forest programme, Alexei Yaroshenko, linked the growing area of Russia’s wildfires with the effects of climate change as well as the “continuing decline of state forest management”.", "posttime": "2021-08-10 00:11:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "西伯利亚,siberia,俄罗斯", "title": "来自西伯利亚野火的烟雾历史性地首次到达北极", "title_en": "Smoke from Siberia wildfires reaches north pole in historic first", "transed": 1, "url": "https://www.theguardian.com/world/2021/aug/09/smoke-siberia-wildfires-reaches-north-pole-historic-first", "via": "", "real_tags": ["西伯利亚", "siberia", "俄罗斯"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072335, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几个月前，我发表了一篇关于 3aHSD 的帖子。尽管该帖子迅速走红，并且围绕科学证据和理论背后提出的机制产生了一个全新的社区，但当时没有证据表明它在人类脱发/生长中起作用。好吧，最近发表了一项新研究，并显示出非常好的结果。在 18 周内适度再生 6%，使用低浓度来测试这个概念。许多人会指出该研究没有对照组，但该研究的重点是测试功效、毒性或副作用（没有）！他们表明潜在的头发再生能力是剂量依赖性的，并且他们在研究中使用了非常小的剂量。但这很重要，因为只有在 2021 年，这是第一次进行测试，而且与某些人声称如果这是一种潜在的治疗方法之前会进行测试不同的是，事实并非如此，这是第一个人类几年来人们试图将其公之于众的试验。我们体内存在的一种 DHT 降解酶可以被上调以去除 DHT 而不是阻断将睾酮转化为 DHT 的酶似乎是合乎逻辑的，现在我们有证据表明这是一种真正的可能性并且可以应用也作为局部和局部！让我们不要忘记 3aHSD 如何通过增加非那雄胺抑制的神经类固醇的产生来帮助甚至治疗一些非那雄胺副作用...... /leburgerkingretard 引起人们注意）：https://www.researchgate.net/publication/352927619_Sulforaphane_L-Menthol_and_Dexpanthenol_as_a_Novel_Active_Cosmetic_Ingredient_Composition_for_Relieving_Hair_Loss_ 之前没有引用过这些理论的原因是那些没有引用过的理论：完全理解，并提出了几种理论。在男性中，MPB 似乎是由于头皮中过量的 DHT，它限制了毛囊的血液供应，从而降低了氧气和营养物质并缩小了毛囊。在女性中，根本没有完全解释 FPHL。 DHT 有时被称为 AGA 的主要原因是因为非那雄胺在某种程度上起作用，阻止脱发但很少促进任何头发再生。\n事实上，AGA 是一种遗传病，但不明白为什么它会发展出如此已知的模式，为什么它开始于 DHT 实际上开始降低的年龄，最重要的是它为什么会发生。多年来还提出了其他理论，如头皮紧张、慢性炎症、血流量减少、毛囊对 DHT 的敏感性增加等。 目前 FDA 批准的脱发治疗只有两种：非那雄胺和米诺地尔，它们已经在30 多年的市场。没有一种对治疗 AGA 有效，事实上，非那雄胺具有阻止脱发的能力，但很少有头发再生。米诺地尔的作用时间很短，但对于大多数男性来说，它在美容方面根本没有显着改善。非那雄胺是一种 5α-还原酶抑制剂，因此是一种抗雄激素，以 Proscar 和 Propecia 等品牌出售，是一种用于治疗男性脱发和良性前列腺增生的药物。它还可用于治疗女性过度生长的毛发，并作为跨性别女性激素治疗的一部分。除 DHT 外，非那雄胺还可抑制多种抗惊厥神经类固醇的产生，包括别孕酮、雄甾烷二醇和 THDOC 非那雄胺已被发现可有效治疗女性多毛症（面部和/或体毛过度生长）。在一项针对 89 名因持续性肾上腺素分泌亢进综合征而患有雄激素过多症的女性的研究中，非那雄胺在治疗 2 年后使面部多毛症减少了 93%，身体多毛症减少了 73%。其他使用非那雄胺治疗多毛症的研究也发现它明显有效。最后一部分与最近的一项研究相关联也很重要，在该研究中，患有多毛症的女性也耗尽了 3aHSD (https://pubmed.ncbi.nlm.nih.gov/18252781/)，仅此一项就可能导致一种新的治疗方法对于 AGA。米诺地尔促进头发生长的机制尚不完全清楚。米诺地尔是一种腺苷 5&#39;-三磷酸敏感性钾通道开放剂，可引起细胞膜的超极化。理论上，通过扩张血管和打开钾通道，它可以让更多的氧气、血液和营养物质进入毛囊。此外，米诺地尔含有一氧化氮部分，可作为一氧化氮激动剂。这可能会导致处于休止期的毛囊脱落，然后在新的生长期中被较厚的毛发所取代。米诺地尔是一种前药，通过磺基转移酶 SULT1A1 的硫酸化作用转化为其活性形式，硫酸米诺地尔。\n例如，虽然毛囊对 DHT 的敏感性被毛发外科医生接受，并且与 DHT 相关联，这解释了为什么使用非那雄胺减少 DHT 的量能够阻止脱发，但它仍然是所有理论中鲜为人知的。另一方面，有许多研究支持其他理论，即头皮的慢性炎症，其中许多研究表明头皮上存在显着的炎症标志物。 DHT是一种抗炎反应（https://www.endocrine-abstracts.org/ea/0063/ea0063p1123）； （https://pubmed.ncbi.nlm.nih.gov/22562653/）； ( https://www.sciencedirect.com/science/article/pii/S0306987717310411 ) ，这可以解释我们头部的秃顶区域比头部两侧或后部（称为供体区域）的存在更高，这些区域很少有头发脱落，当这些头发移植到刀片部位时，它会生长，这是头发外科医生对可能的毛囊对 DHT 敏感的唯一论据。用于毛囊敏感性理论的另一个论点来自于医生将一个毛囊从他的秃顶移植到他的前臂 (https://pubmed.ncbi.nlm.nih.gov/87090/)，其中DHT 的存在会少得多，但毛囊仍然死亡。虽然它没有带来共识，但它是迄今为止对卵泡敏感性的唯一解释。其他研究表明秃顶区域的毛囊中雄激素受体增加（https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4174066/），但这项研究实际上提出的问题多于答案，并且未能解释是否那些受体在这个男人还是个孩子的时候就存在了，如果它是由基因编码的，并且表观遗传学实际上在以后的生活中激活了这些基因，或者如果 DHT 的增加导致正反馈导致受体增加，这更有可能，考虑到在许多其他疾病中的类似效果。这也是著名的 DHT 悖论，其中 DHT 是一种更有效的睾酮和雄激素形式，预计会将毛囊从毫毛转化为末端，而不是相反，而 DHT 浓度升高实际上会使胡须和胸毛生长。男孩开始留胡须（高 DHT 水平）的时间与他们开始脱发的时间不一致。 3α-羟基类固醇脱氢酶 (3α-HSD) 是一种在人类中已知是合成内源性神经类固醇别孕酮、THDOC 和 3α-雄甾烷二醇所必需的酶。 3 α-羟基类固醇脱氢酶 (3 alpha-HSD) 使循环中的类固醇激素失活，并在目标组织中调节类固醇激素受体的占有率。 ( https://pubmed.ncbi.nlm.nih.gov/9029723/) 二氢睾酮 (DHT) 是外周靶组织中的主要活性雄激素，由 3α-羟基类固醇脱氢酶 III (3α-HSD) 代谢，代谢为5 alpha-androstan-3 alpha,17 beta-diol (3 alpha-diol)，一种活性低得多的化合物。 ( https://pubmed.ncbi.nlm.nih.gov/11158055/); ( https://academic.oup.com/jcem/article/93/4/1298/2826512)\n在 2016 年的一项研究中发现的一个方面是萝卜硫素 (SFN) 增加了 DHT 降解酶的表达，例如 3α-羟基类固醇脱氢酶 (3α-HSD)，实际上，加速了血液 DHT 的降解，并随后阻止 DHT 对头发生长的抑制。 (https://pubmed.ncbi.nlm.nih.gov/26923074/) 2021 年发表的另一项研究表明，萝卜硫素在体外和体外试验中促进毛发生长。 ( https://pubmed.ncbi.nlm.nih.gov/33901343/ ) 事实上，萝卜硫素实际上可能会提高米诺地尔的疗效，因为它会增加转化 min 所需的磺基转移酶 (SULT1A1)到可用形式（米诺地尔硫酸盐）。 ( https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6150368/) 作为我们理论的额外证据，用于对抗痤疮的药物 Accutane 是一种强大的 3aHSD 下调剂，并且具有副作用，即脱发！因此，低 3aHSD = 脱发。在人体试验中，原花青素 B2 (PB2) 已显示出非常好的效果，可促进脱发稳定，同时还能促进头发再生。所有多酚都会增加 ARK1C2 的表达 (https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6864651/)，这一事实与研究表明，在促进 AGA 患者毛发生长方面取得了非常好的效果，加强了 3aHSD 的事实在 AGA 中扮演着非常重要的角色。 ( https://pubmed.ncbi.nlm.nih.gov/11841365/); ( https://pubmed.ncbi.nlm.nih.gov/11194183/); ( https://pubmed.ncbi.nlm.nih.gov/21226878/); ( https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5775114/ ) 在这一点上，我们不提出任何 AGA 发展的作用机制，也不会提供任何可能的原因的见解，但我们的假设应该会导致一种新的作用机制，可以对原因进行逆向工程。通过治疗症状，我们可以解决真正的原因，然后可以找到新的治疗方法或治疗方法。 ( https://pubmed.ncbi.nlm.nih.gov/16601286/ ) 另一个有趣的发现是，秃顶区的芳香化酶水平远低于供体区， ( https://www.sciencedirect.com/science/文章/pii/S0022202X15429884）。芳香酶，也称为雌激素合成酶，是一种负责雌激素生物合成的关键步骤的酶，但不知道为什么它在秃顶区域较低，但我们假设它缺乏雄烯二醇来开始通过芳香酶转化为雌二醇，由于缺乏 3aHSD，因此没有雄烯二醇，因此芳香酶也可能耗尽。\n首先，DHT直接抑制组织上的雌激素活性。它要么通过充当雌激素受体的竞争性拮抗剂，要么通过在雌激素受体结合之后减少雌激素诱导的 RNA 转录来实现这一点。其次，DHT 及其代谢物已被证明可以通过抑制芳香酶的活性直接阻止雄激素产生雌激素。在乳房组织中进行的研究表明，DHT、雄酮和 5α-雄甾酮是雄烯二酮形成雌酮的有效抑制剂。 5alpha-雄甾酮被证明是最有效的，而雄酮是最不有效的。因此，我们假设 3aHSD 在秃顶中受到损害，原因目前尚不清楚，而 DHT 水平会增加，因为它没有被代谢成雄烯二醇。这最终会导致脱发。 ( https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7432488/ ) 雄烯二醇的雄激素性低于 DHT 或睾酮，然而，所有人都有睾酮，这并不意味着每个人都有 AGA，在事实上，睾酮不会导致脱发，通过与雄烯二醇和雌二醇竞争，DHT 实际上是罪魁祸首，但不是 AGA 的原因。我们的假设是，局部增加 3aHSD 的作用与非那雄胺的作用方式相同，但仅作用于头皮局部，显着降低 DHT 水平并促进头发生长。我们推测3aHSD及其代谢物在解释AGA方面起着重要作用，最终可以解释AGA的病因和病理。迄今为止，还没有任何关于秃头头皮与非秃头头皮中 3aHSD 水平的研究。鉴于 3aHSD 是我们身体自然处理和摆脱 DHT 的方式，我们相信它是新疗法的关键，可以局部应用且无副作用。\nNADH 和 NADPH 对大多数酶促反应至关重要，其中包括 3α-羟基类固醇脱氢酶 (3α-HSD)。 3α-HSD 酶使用 NADH 和 NADPH 作为辅助因子，催化 5α-二氢睾酮 (DHT) 和 3α-雄甾烷二醇 (3α-Diol) 之间的反应。研究表明，这种酶对 NADPH 具有更高的亲和力。研究还表明，在 NADPH 的存在下，不仅还原反应是优选的，而且氧化反应也受到抑制，这是使用 NMN（烟酰胺单核苷酸）和萝卜硫素的人的轶事报道。尽管 NADPH 也用于 5 α 还原酶在将睾酮转化为 DHT 的反应中，但 DHT 的初始水平会确保适当的平衡，即使 T 以更高的速度转化为 DHT，它也会立即被 3aHSD 灭活，并且由于辅因子的存在不允许反向反应，我们不仅会减少头皮上的 DHT，而且会长期减少睾酮。如果局部使用，乳头状皮细胞将恢复其促进毛发生长的能力，鉴于将恢复正确的途径，这将有助于我们了解 AGA 的原因。有足够的证据表明 3aHSD 在 AGA 病理学中的作用很重要。 （ https://www.researchgate.net/publication/352927619_Sulforaphane_L-Menthol_and_Dexpanthenol_as_a_Novel_Active_Cosmetic_Ingredient_Composition_for_Relieving_Hair_Loss_Symptoms）尽管它从未被研究过，但最近它在脱发中的作用研究DHT 水平，表明它也可能在头皮中受到影响，并且考虑到它的作用与非那雄胺相同（减少 DHT 的量），并且考虑到不秃顶的人的睾丸激素水平大致相同作为非秃顶的头皮，我们认为这是由于 3aHSD 耗尽，或由于未知原因（可能是炎症）表达减少，而身体的反应是 3aHSD 减少以增加 DHT 作为炎症反应。由于只有头皮秃顶区域的 DHT 较高，而不是在供体（或安全）区域，而且巧合的是，秃顶区域与帽状腱膜所占据的区域相同，因此可以公平地假设这提出的 3aHSD 减少或消耗是由 galea 腱膜的潜在问题引起的，在这一点上是推测，但鉴于上述所有证据，我们建议应研究 3aHSD 的作用，首先要带来新的治疗方法，其次要了解AGA的原因。一项针对多毛症的研究表明，女性生殖器皮肤中较低的 3aHSD 表达如何增加 DHT 水平阈值。我们认为应该在男性人类头皮中进行类似的研究，比较秃顶和非秃顶男性的 DHT、3aHSD 及其代谢物的水平。此外，应该研究秃顶男性供体区和秃顶区的 3aHSD 之间的相关性，就 3aHSD 水平及其代谢物而言。 - 关于治疗的安全性，有些人担心长期接触萝卜硫素或类似物可能会导致甲状腺功能障碍或甲状腺自身免疫性疾病，但事实是指出这一点的研究样本量很小，在除了其他几个缺陷之外，例如太短而无法准确得出任何结论，当您意识到不同研究的结果大不相同时，这一点就会变得更加明显。所以他们也不一致。一项执行得更好的研究 (https://pubmed.ncbi.nlm.nih.gov/30735751/) 能够揭穿其他研究。为此，他们“在一项随机临床试验中分析了 45 名女性参与者在基线和饮用饮料 84 天后的甲状腺功能和甲状腺自身免疫的生化指标。”然后，他们分析了“促甲状腺激素、游离甲状腺素和甲状腺球蛋白的血清水平不受治疗影响，参与者的甲状腺自身免疫状态也不受影响。”这意味着“这些结果为化学预防策略的安全性提供了证据，这些策略以 Nrf2 的激活为目标，以防止环境暴露和其他与氧化应激相关的疾病。” - 在抗衰老领域，NMN 正变得越来越流行，一些知名科学家如 David Sinclair 博士领导了该领域的研究，并且有一些同时使用 NMN 和 SFN 的人报告了头发再生的案例时间，这只是为上述理论提供了更多证据。 - 最新研究使用了一种含有低浓度 SFN 的外用产品（凝胶）。我们相信在更高的浓度下，结果会更好，现在我们必须等待新的试验进行。\n- 我不鼓励任何人尝试 SFN 或 PB2 补充剂，因为大多数都是狗屎，没有任何浓度的 SFN 有任何好处。然而，种子和花椰菜芽似乎非常有效，而且便宜得他妈的。所以在有人问之前，我认为没有已知的剂量或浓度对头发再生有效，所以我认为自己尝试不应该带来任何希望，因为我们根本不知道最佳剂量。也许是 100 毫克，也许是 25 毫克，也许是 200 毫克，没人知道，我们现在所能做的就是继续研究并指出更多的证据，让科学界意识到并开始研究这一点。我希望这能很快导致一种新的治疗方法，最终我们能找到脱发的该死的原因并治愈这个狗屎！以色列的一个研究部门在 2019 年为一种直接在头皮上引入 3aHSD 和 NAD 的方法申请了专利。有什么方法可以复制或使用它吗？", "note_en": "a couple of months ago I made a post about 3aHSD. Although the post went viral and a whole new community was born around the scientific evidence and proposed mechanisms behind the theory, at the time there was no evidence of it&#39;s role in hair loss/grow in humans. Well, recently a new study has been published and showed very good results.\n A modest 6% regrowth in an 18 week períod, using a low concentration to test the concept. Many will point that the study didn&#39;t have a control group but the whole point of the study was to test efficacy, toxicity or side effects (which there weren&#39;t any)! They showed that the potential hair regrow capabilities is dose dependent, and they used a very small dose in the study. But this is important because  only in 2021 it is the first time that this has been tested, and unlike some people have claimed that if this was a potential treatment it would have been tested before, well it wasn&#39;t and this is the first human trials done in several years of people trying to bring this to the light.\n It only seems logical that a DHT degrading enzyme that is present in our bodies could be upregulated to get rid of DHT instead of blocking the enzyme that converts Testosterone into DHT, and now we have evidence that this is a real possibility and that can be appiled also as topical and locally! And let&#39;s not forget of how 3aHSD can help a or even treat some of the Finasteride side effects by increasing the production of neurosteroids that finasteride inhibits...\n But guys just read the study and give your opinions (relleased june 2021 - special thanks to  u/leburgerkingretard for bringing attention to this):  https://www.researchgate.net/publication/352927619_Sulforaphane_L-Menthol_and_Dexpanthenol_as_a_Novel_Active_Cosmetic_Ingredient_Composition_for_Relieving_Hair_Loss_Symptoms\n For those who haven&#39;t read the theory before, here is a resumed version with citations:\n  The cause of Androgentic Alopecia is not fully understood, and several theories have been presented. In men, MPB seems to be due to excess DHT in the scalp, which restricts blood supply to the follicles, thus lowering oxygen and nutrients and shrinking the follicles. In women, FPHL is simply not fully explained.\n The reason DHT is sometimes referred as the main cause of AGA is due to the fact that finasteride works to some degree, halting hair loss but rarely promoting any hair regrow.\n It is a fact that AGA is a genetic condition, however it is not understood why it develops a such known pattern, why it starts at an age where DHT is actually starting to lower, and most important why it happens at all.\n Other theories have been presented over the years, like scalp tension, chronic inflammation, reduced blood flow, follicle increased sensitivity to DHT, etc.\n  Currently there are only two treatments approved for hair loss by the FDA: finasteride and minoxidil, which have been on the market for over 30 years. None are effective at treating AGA, in fact, finasteride has the ability of halting hair loss, but very little hair is regrown. Minoxidil works for a small period of time, but for most men it has no cosmetic significant improvement at all.\n Finasteride is a 5α-reductase inhibitor and therefore an antiandrogen, sold under the brand names Proscar and Propecia among others, is a medication used to treat hair loss and benign prostatic hyperplasia in men. It can also be used to treat excessive hair growth in women and as a part of hormone therapy for transgender women.\n In addition to DHT, finasteride also inhibits the production of several anticonvulsant neurosteroids including allopregnanolone, androstanediol and THDOC\n Finasteride has been found to be effective in the treatment of hirsutism (excessive facial and/or body hair growth) in women. In a study of 89 women with hyperandrogenism due to persistent adrenarche syndrome, finasteride produced a 93% reduction in facial hirsutism and a 73% reduction bodily hirsutism after 2 years of treatment. Other studies using finasteride for hirsutism have also found it to be clearly effective. This last part is also important to correlate to a recent study, where women with hirsutism also were depleted of 3aHSD ( https://pubmed.ncbi.nlm.nih.gov/18252781/), and this alone could lead to a novel treatment for AGA.\n The mechanism by which minoxidil promotes hair growth is not fully understood. Minoxidil is an adenosine 5&#39;-triphosphate-sensitive potassium channel opener, causing hyperpolarization of cell membranes. Theoretically, by widening blood vessels and opening potassium channels, it allows more oxygen, blood, and nutrients to the follicles. Moreover, minoxidil contains a nitric oxide moiety and may act as a nitric oxide agonist. This may cause follicles in the telogen phase to shed, which are then replaced by thicker hairs in a new anagen phase. Minoxidil is a prodrug that is converted by sulfation via the sulfotransferase enzyme SULT1A1 to its active form, minoxidil sulfate.\n  While follicle sensitivity to DHT is accepted by hair surgeons, for example, and is linked to DHT which explains why reducing the amount of DHT, using finasteride, has the ability to halt hair loss, it is yet the less proven theory of all. On the other hand, there are many studies supporting the other theories, namely the chronic inflammation of the scalp, where many studies have shown the significant presence of inflammation markers on the scalp.\n DHT is an anti-inflammatory response ( https://www.endocrine-abstracts.org/ea/0063/ea0063p1123); ( https://pubmed.ncbi.nlm.nih.gov/22562653/) ; ( https://www.sciencedirect.com/science/article/pii/S0306987717310411) , which would explain the higher presence in the balding areas of our head, when compared to the sides or back of the head, known as the donor area, rarely hair is lost in these areas, and when this hair is transplanted to a blading site, it grows, and this is the only argument used by the hair surgeons on the possible follicle sensitivity to DHT.\n The other argument used for the theory of follicle sensitivity, came from the fact that a doctor has transplanted a hair follicle from his balding vertex to his forearm ( https://pubmed.ncbi.nlm.nih.gov/87090/), where the DHT presence would be much less, but the hair follicle still died. Although it does not bring consensus, it is the only explanation of follicle sensitivity so far.\n Other study has shown increased androgen receptors in balding areas follicles ( https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4174066/), but this study actually raises much more questions than answers, and failed to explain if those receptors were there since the man was a child, if it is encoded in genes and epigenetics actually activates the genes later in life, or if the increase in DHT lead to a positive feedback leading to an increase in receptors, which is more likely, having in account the similar effect in many other diseases. This also is the famous DHT paradox, where DHT, a more potent form of testosterone and androgens, is expected to convert hair follicles from vellus to terminal not the other way around, and DHT elevated concentration actually makes beard and chest hair grow. The time when boys start developing the beard (high DHT levels) does not coincide with the time where they start losing hair.\n  3α-Hydroxysteroid dehydrogenase (3α-HSD) is an enzyme that in humans is known to be necessary for the synthesis of the endogenous neurosteroids allopregnanolone, THDOC, and 3α-androstanediol.\n 3 alpha-hydroxysteroid dehydrogenases (3 alpha-HSDs) inactivate circulating steroid hormones, and in target tissues regulate the occupancy of steroid hormone receptors. ( https://pubmed.ncbi.nlm.nih.gov/9029723/)\n Dihydrotestosterone (DHT), the primary active androgen in peripheral target tissues, is metabolized by 3α-hydroxysteroid dehydrogenase type III (3α-HSD), being metabolized into 5 alpha-androstan-3 alpha,17 beta-diol (3 alpha-diol), a compound having much lower activity. ( https://pubmed.ncbi.nlm.nih.gov/11158055/); ( https://academic.oup.com/jcem/article/93/4/1298/2826512)\n One aspect that has been found in a 2016 study, was the fact that Sulforaphane (SFN) increases the expression of DHT degrading enzymes, such as 3α-hydroxysteroid dehydrogenases (3α-HSDs), and in fact, accelerates the degradation of blood DHT, and subsequently blocks the suppression of hair growth by DHT. ( https://pubmed.ncbi.nlm.nih.gov/26923074/)\n Another study, published in 2021 showed that sulforaphane promotes hair growth in in vitro and ex vivo trials. ( https://pubmed.ncbi.nlm.nih.gov/33901343/)\n In fact, sulforaphane may actually increase the efficacy of minoxidil, due to the fact that it increases the sulfotransferase (SULT1A1) that is needed for min to be converted to usable form (minoxidil sulfate). ( https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6150368/)\n As additional proof to our theory, Accutane, a drug used to combat acne is a powerfull 3aHSD downregulator, and has as side effect, hairloss! Thus, low 3aHSD = hairloss.\n In human trials, Procyanidin B2 (PB2) has shown very good results, promoting hairloss stabilization, but also hair regrow. All polyphenols increase ARK1C2 expression ( https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6864651/) and this fact combined with studies showing very good results in promoting hair growth in AGA patients, strenghtens the fact that 3aHSD has a very important role in AGA. ( https://pubmed.ncbi.nlm.nih.gov/11841365/); ( https://pubmed.ncbi.nlm.nih.gov/11194183/); ( https://pubmed.ncbi.nlm.nih.gov/21226878/); ( https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5775114/)\n At this point, we do not propose any mechanism of action for the development of AGA, nor will we  provide any insight on the possible cause, but our hypothesis should lead to a novel mechanism of action that can be reverse engineered to a cause. By treating the symptoms, we can address the real cause, and later a novel treatment or therapeutical approach can be found. ( https://pubmed.ncbi.nlm.nih.gov/16601286/)\n Another interesting finding is that aromatase levels are much lower in balding zones than in the donor area, ( https://www.sciencedirect.com/science/article/pii/S0022202X15429884). Aromatase, also called estrogen synthetase, is an enzyme responsible for a key step in the biosynthesis of estrogens, however it is not known why it is lower in balding areas, but we hypothesize that it lacks androstenediol to start the conversion by aromatase into estradiol, and since there is no androstenediol due to the lack of 3aHSD, the aromatase is possibly also depleted.\n  First of all, DHT directly inhibits estrogens activity on tissues. It either does this by acting as a competitive antagonist to the estrogen receptor or by decreasing estrogen-induced RNA transcription at a point subsequent to estrogen receptor binding.\n Second of all, DHT and its metabolites have been shown to directly block the production of estrogens from androgens by inhibiting the activity of the aromatase enzyme. The studies done in breast tissue showed that DHT, androsterone, and 5alpha-androstandione are potent inhibitors of the formation of estrone from androstenedione. 5alpha-androstandione was shown to be the most potent, while androsterone was the least.\n So we hypothethised that 3aHSD is compromised in balding scalps, for reasons unknown at this point, and DHT levels increase because it’s not being metabolized into androstenediol. This ultimately leads to hairloss. ( https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7432488/)\n Androstenediol is less androgenous than DHT or Testosterone, however, all man have testosterone, and this does not imply that every man has AGA, in fact testosterone doesn’t lead to hair loss, and by competing with androstenediol and estradiol, DHT actually is the culprit, but not the cause of AGA.\n Our hypothesis is that the local increase of 3aHSD, will work the same way finasteride works, but will act only locally on the scalp, decreasing significantly the DHT levels, and promoting hair growth.\n We theorize that 3aHSD and it&#39;s methabolites play an important role that can explain AGA, and ultimatly can explain the cause and pathology of AGA.\n To date, there hasn&#39;t been any study on the levels of 3aHSD in balding scalps vs non balding scalps. Given the fact that 3aHSD is the way our body deals and gets rid of DHT naturally, we believe that it holds the key to a new treatment, that can be applied locally and without side effects.\n NADH and NADPH are essential for most enzymatic reactions, 3α-hydroxysteroid dehydrogenase (3α-HSD) among them. 3α-HSD enzyme catalyzes the reaction between 5α-dihydrotestosterone (DHT) and 3α-androstanediol (3α-Diol) using NADH and NADPH as co-factors. Studies show that this enzyme has higher affinity to NADPH. also the studies have shown that in the presence of NADPH not only is the reduction reaction preferred, but the oxidation reaction is inhibited as well, which is something that has been annecdotally reported by people using NMN (nicotinamide mononucleotide) and also sulforaphane. Despite the fact that NADPH is also used in the reaction of 5 alpha redutase in the conversion of Testosterone to DHT, the much initial levels of DHT will ensure a proper balance, and even if T is converted to DHT at a higher pace, it will be immediatly deactivated by 3aHSD, and since the presence of cofactor won&#39;t allow the reverse reatcion, we will not only reduce DHT on the scalp but also testosterone in long term. If applied locally, the derma pappila cells will restore their ability to promote hair growth, and given that the correct pathways will be restored, this will help us understand the cause of AGA.\n  There is enough evidence that the role of 3aHSD is important in the pathology of AGA. ( https://www.researchgate.net/publication/352927619_Sulforaphane_L-Menthol_and_Dexpanthenol_as_a_Novel_Active_Cosmetic_Ingredient_Composition_for_Relieving_Hair_Loss_Symptoms) Despite the fact it has never been studied on the scalp (until very recently) and its role in hair loss, studies done in prostate, measuring it&#39;s role in the DHT levels, indicate that it can also be affected in the scalp, and given the fact that it will work the same way as finasteride (reducing the amount of DHT) and given the fact that non-balding people have approximately the same levels of testosterone as non balding scalps, we believe that this is due to a depletion of 3aHSD, or reduced expression, due to an unknown cause, probably inflamation, and the body’s response is a reduction of 3aHSD to increase DHT as an inflamatory response.\n Since only DHT is higher in the balding areas of the scalp, and not in the donor (or safe) areas, and by coincidence, the balding area is the same as the occupied by the galea aponeurotica, it is only fair to assume that this proposed reduction or depletion of 3aHSD is caused by an underlaying issue with the galea aponeurotica, which at this point is speculation, but given all the above evidence, we suggest that the role of 3aHSD should be studied, first of all to bring a novel treatment, and secondly to understand the cause of AGA.\n A study done in hirsutism has shown how lower 3aHSD expression in genital skin of women increases the DHT levels threshold. We believe that a similar study should be done in male human scalps, comparing the levels of DHT, 3aHSD and it&#39;s methabolites, between balding and non balding men. Also, there should be studies on the correlation between 3aHSD in a balding man&#39;s donor area and balding area, in terms of 3aHSD levels and it&#39;s metabolites.\n  - Regarding the safety of the treatment, some people fear that long-term exposure to sulforaphane, or similar, may lead to thyroid dysfunction or thyroid autoimmune disease, but the truth is that the studies that pointed this out had a small sample size, on top of several other flaws such as being way too short to be able to accurately draw any conclusions, and that becomes more evident when you realize that the results were quite different across different studies. so they were also inconsistent. A better executed study ( https://pubmed.ncbi.nlm.nih.gov/30735751/) was able to debunk the other ones. To do that, they &#34;analyzed biochemical measures of thyroid function and thyroid autoimmunity in 45 female participants in a randomized clinical trial at baseline and after 84 days of beverage administration.&#34; Then, they analyzed that &#34;Serum levels of thyroid-stimulating hormone, free thyroxine and thyroglobulin were not affected by the treatment, and neither was the thyroid autoimmunity status of participants.&#34; Which means that &#34;these results provide evidence in favor of the safety of chemoprevention strategies that target the activation of Nrf2 to protect against environmental exposures and other oxidative stress-related pathologies.&#34;\n - In the anti-aging comunity, NMN is becoming more and more popular, with some known scientists like Dr David Sinclair leading research in the field, and there have been a few reported cases of hair regrow by people using NMN and SFN at the same time, which just provides more evidence of the above theory.\n - The latest study used a topical product (gel) containing SFN at a low concentration. We believe that at higher concentration, the results will be even better and now we must wait for the new trial to be conducted.\n - I do not encourage anyone to try SFN or PB2 supplements, because most are shit and don&#39;t have any concentration of SFN to do any good. However, seeds and brocolli sprouts seem to be very effective and are cheap as fuck. So before anyone asks, I don&#39;t think there is a known dosage or concentration yet found effective for hair regrow, so I don&#39;t think trying on your own should bring any hope because we simply don&#39;t know the best dose. Maybe 100mg, maybe 25mg, maybe 200mg, nobody knows, all we can do now is keep researching and point more evidence that could make the scientific community aware and start studying this.\n I hope this can lead to a new treatment very soon, and in the end, we can find the damn cause of hairloss and cure this shit!\n An Isralei research department has filled a patent in 2019 for a method of introducing 3aHSD and NAD directly on the scalp. Is there any way we can replicate it or use it?", "posttime": "2021-08-10 00:10:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "硫素,provide,dht", "title": "萝卜硫素可以治疗秃顶", "title_en": "Sulforaphane may provide a treatment for Balding", "transed": 1, "url": "https://www.reddit.com/r/Biohackers/comments/p0htty/potential_biohack_using_sulforaphane_and/", "via": "", "real_tags": ["硫素", "provide", "dht"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072334, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是“Go 不好”系列中的附加帖子。 Go 确实有一些不错的特性，因此在这篇文章中是“好的”部分，但总的来说，当我们超越 API 或网络服务器（这是它的设计目的）并将其用于业务时，我发现使用它既麻烦又痛苦域逻辑。但即使对于网络编程，它的设计和实现也有很多问题，这使得它在看似简单的情况下变得危险。这篇文章的动机是我最近重新开始使用 Go 进行辅助项目。我在之前的工作中广泛使用 Go 为 SaaS 服务编写网络代理（http 和原始 tcp）。网络部分相当愉快（我也发现了语言），但随之而来的会计和计费部分很痛苦。由于我的副项目是一个简单的 API，我认为使用 Go 将是快速完成工作的正确工具，但正如我们所知，许多项目超出了最初的范围，所以我不得不编写一些数据处理来计算统计数据和痛苦Go 回来了。所以这是我对围棋困境的看法。一些背景：我喜欢静态类型语言。我的第一个重要程序是用 Pascal 编写的。当我在 90 年代初开始工作时，我使用了 Ada 和 C/C++。后来我转向 Java，最后转向 Scala（中间有一些 Go），最近开始学习 Rust。我还编写了大量 JavaScript，因为直到最近它还是 Web 浏览器中唯一可用的语言。我对动态类型语言感到不安全，并试图将它们的使用限制为简单的脚本。我对命令式、函数式和面向对象的方法很满意。这是一个事实：如果你知道任何一种编程语言，你可以通过“Go 之旅”在几个小时内学习 Go 的大部分语法，并在几天内编写你的第一个真正的程序。阅读并消化 Effective Go，在标准库中闲逛，使用像 Gorilla 或 Go kit 这样的网络工具包，你将成为一个相当不错的 Go 开发人员。这是因为 Go 的首要目标是简单。当我开始学习 Go 时，它让我想起了我第一次发现 Java：一种简单的语言和一个丰富但不臃肿的标准库。学习 Go 是一种来自当今 Java 繁重环境的令人耳目一新的体验。由于 Go 的简单性，Go 程序非常易读，即使错误处理会增加一些噪音（更多内容见下文）。但这可能是错误的简单。引用 Rob Pike 的话，简单是复杂的，我们将在下面看到它背后有很多问题在等着我们，而简单和极简主义阻止了编写 DRY 代码。 Goroutines 可能是 Go 最好的特性。它们是与操作系统线程不同的轻量级计算线程。\n当 Go 程序执行看起来像是阻塞 I/O 操作时，Go 运行时实际上会挂起 goroutine，并在事件指示某些结果可用时恢复它。与此同时，其他 goroutine 已被安排执行。因此，我们拥有异步编程与同步编程模型的可扩展性优势。 Goroutines 也是轻量级的：它们的堆栈按需增长和收缩，这意味着拥有 100 甚至 1000 个 goroutines 不是问题。我曾经在应用程序中遇到过 goroutine 泄漏：这些 goroutine 在结束之前等待关闭通道，而该通道从未关闭（一个常见问题）。该进程无缘无故地消耗了 90% 的 CPU，并且检查 expvars 显示 600k 空闲 goroutines！我猜 CPU 被 goroutine 调度程序使用了。当然，像 Akka 这样的 Actor 系统可以毫不费力地处理数百万个 Actor，部分原因是 Actor 没有堆栈，但它们远没有 goroutines 那样容易使用来编写大量并发的请求/响应应用程序（即http API）。通道是 goroutines 应该如何通信：它们提供了一个方便的编程模型来在 goroutines 之间发送和接收数据，而不必依赖脆弱的低级同步原语。频道有自己的一套使用模式。但是，必须仔细考虑通道，因为大小不正确的通道（默认情况下它们是无缓冲的）会导致死锁。他们也有大量的问题和不一致之处。我们还将在下面看到使用通道并不能防止竞争条件，因为 Go 缺乏不变性。 Go 标准库真的很棒，特别是对于与网络协议或 API 开发相关的一切：http 客户端和服务器、加密、存档格式、压缩、发送电子邮件等。甚至还有一个 html 解析器和一个相当强大的模板引擎来生成文本&amp; html 自动转义以避免 XSS（例如由 Hugo 使用）。\n各种 API 通常简单易懂。但它们有时看起来很简单：这部分是因为 goroutine 编程模型意味着我们只需要关心“看似同步”的操作。这也是因为我最近发现一些通用函数也可以代替许多专门的函数来计算时间。 Go 编译为本地可执行文件。许多 Go 用户来自 Python、Ruby 或 Node.js。对他们来说，这是一种令人兴奋的体验，因为他们看到服务器可以处理的并发请求数量大幅增加。当您来自没有并发（Node.js）或全局解释器锁的解释型语言时，这实际上很正常。结合语言的简单性，这解释了 Go 的部分兴奋。然而，与 Java 相比，原始性能基准测试中的情况并不那么清楚。 Go 击败 Java 的地方在于内存使用。除非您使用 Graal native-image 将它们放在同一范围内。 Go 的垃圾收集器旨在优先考虑延迟并避免停止世界暂停，这在服务器中尤为重要。这可能会带来更高的 CPU 成本，但在水平可扩展的架构中，这可以通过添加更多机器轻松解决。请记住，Go 是由 Google 设计的，而 Google 几乎资源匮乏！与 Java 相比，Go GC 要做的工作也更少：结构的切片是一个连续的结构数组，而不是像 Java 中的指针数组。类似地，Go 地图使用小数组作为桶用于相同的目的。这意味着 GC 的工作更少，而且 CPU 缓存位置更好。 Go 在命令行实用程序方面也优于 Java：作为本机可执行文件，Go 程序没有启动成本，而 Java 则首先必须加载和编译字节码。我职业生涯中一些最激烈的争论发生在团队代码格式的定义上。 Go 通过为 Go 代码定义规范格式来解决这个问题。 gofmt 工具重新格式化您的代码并且没有选项。\n不管你喜不喜欢，gofmt 定义了 Go 代码应该如何格式化，因此这个问题一劳永逸地解决了！ Go 在其标准库中附带了一个很棒的测试框架。它支持并行测试、基准测试，并包含许多实用程序来轻松测试网络客户端和服务器。与 Python、Ruby 或 Node.js 相比，必须安装单个可执行文件是运维工程师的梦想。随着 Docker 的使用越来越多，这越来越不是一个问题，但独立的可执行文件也意味着很小的 Docker 镜像。 Go 的 expvar 包还具有一些内置的可观察性功能，用于发布内部状态和指标，并且可以轻松添加新的状态和指标。不过要小心，因为它们会在默认的 http 请求处理程序上自动公开、不受保护。 Java 具有用于类似目的的 JMX，但它要复杂得多。 defer 语句的作用类似于 Java 中的 finally：在当前函数的末尾执行一些清理代码，无论该函数如何退出。 defer 的有趣之处在于它不链接到代码块，并且可以随时出现。这允许编写清理代码尽可能接近创建需要清理的代码： file , err := os 。 Open (fileName) if err != nil { return } defer file 。 Close() // 使用文件，我们不必再考虑关闭它 当然，Java 的 try-with-resource 不那么冗长，当资源的所有者被删除时 Rust 会自动声明资源，但是因为 Go 要求你明确资源清理，接近资源分配很好。\n我喜欢类型，而让我恼火/害怕的事情是，例如，当我们将持久对象标识符作为 string 或 long 到处传递时。我们通常在参数名称中编码 id 的类型，但是当一个函数有多个标识符作为参数并且一些调用与参数顺序不匹配时，这会导致细微的错误。 Go 对新类型有一流的支持，即采用现有类型并赋予它与原始类型不同的单独标识的类型。与包装相反，新类型没有运行时开销。这允许编译器捕获这种错误： type UserId string // &lt;-- new type type ProductId string func AddProduct ( userId UserId , productId ProductId ) {} func main () { userId := UserId ( &quot;some-user- id&quot; ) productId := ProductId ( &quot;some-product-id&quot; ) // 正确顺序：一切正常 AddProduct ( userId , productId ) // 错误顺序：将使用原始字符串编译 AddProduct ( productId , userId ) // 编译错误： // 不能在 AddProduct 的参数中使用 productId（类型 ProductId）作为类型 UserId // 不能在 AddProduct 的参数中使用 userId（类型 UserId）作为类型 ProductId } 不幸的是，缺乏泛型使得使用新类型变得很麻烦，因为要为他们需要将值转换为原始类型/从原始类型转换。在 Less 成倍增加中，Rob Pike 解释说 Go 旨在取代 Google 的 C 和 C++，它的前身是 Newsqueak，这是他在 80 年代编写的一种语言。 Go 也有很多对 Plan9 的引用，Plan9 是 Go 的作者在 80 年代在贝尔实验室开发的分布式操作系统。甚至还有一个直接受 Plan9 启发的 Go 程序集。为什么不使用可以提供各种开箱即用的目标架构的 LLVM？我也可能在这里遗漏了一些东西，但为什么需要这样做？如果您需要编写汇编以充分利用 CPU，您不应该直接使用目标 CPU 汇编语言吗？ Go 的创造者应该受到很多尊重，但看起来 Go 的设计发生在平行宇宙（或他们的 Plan9 实验室？），在那里，90 年代和 2000 年代编译器和编程语言设计中发生的大部分事情从未发生过。或者 Go 是由能够编写编译器的系统程序员设计的。\n函数式编程？没有提到它。泛型？你不需要它们，看看它们在 C++ 中产生的混乱！即使切片、贴图和通道是通用类型，我们将在下面看到。 Go 的目标是取代 C 和 C++，很明显，它的创建者并没有在其他地方寻找太多。但是他们没有达到目标，因为 Google 的 C 和 C++ 开发人员没有采用它。我的猜测是主要原因是垃圾收集器。低级 C 开发人员强烈拒绝托管内存，因为他们无法控制发生的事情和时间。他们喜欢这种控制，即使它带来了额外的复杂性并为内存泄漏和缓冲区溢出打开了大门。有趣的是，Rust 采取了一种完全不同的方法，在没有 GC 的情况下进行自动内存管理。 Go 反而在操作工具领域吸引了 Python 和 Ruby 等脚本语言的用户。他们在 Go 中发现了一种具有出色性能并减少内存/cpu/磁盘占用的方法。还有更多的静态类型，这对他们来说是新的。 Go 的杀手级应用是 Docker，这引发了它在 DevOps 领域的广泛采用。 Kubernetes 的兴起加强了这一趋势。 Go 接口类似于 Java 接口或 Scala &amp; Rust 特征：它们定义了稍后由类型实现的行为（我不会在此处称其为“类”）。不过，与 Java 接口和 Scala &amp; Rust 特征不同，类型不需要明确指定它实现了一个接口：它只需要实现接口中定义的所有函数。所以 Go 接口实际上是结构类型。我们可能认为这是为了允许其他包中的接口实现而不是它们适用的类型，例如存在于 Scala 或 Kotlin 中的类扩展，或 Rust 特征，但事实并非如此：与类型相关的所有方法都必须是在类型的包中定义。 Go 不是唯一使用结构类型的语言，但我发现它有几个缺点：\n找到实现给定接口的类型很困难，因为它依赖于函数定义匹配。我经常通过搜索实现接口的类来发现 Java 或 Scala 中有趣的实现。在向接口添加方法时，您会发现只有在用作该接口类型的值时才需要更新哪些类型。这可能会在很长一段时间内被忽视。 Go 建议使用极少方法的小接口，这是一种防止这种情况的方法。一个类型可能在不知不觉中实现了一个接口，因为它有相应的方法。但偶然的是，实现的语义可能与接口契约的预期不同。在 Go 1.13 版本之后添加。这似乎没什么大不了的，但请继续阅读。 Go 1.13 引入了方法链，为错误添加了一个新的 Unwrap 方法。由于 Go 接口不支持其方法的默认实现，因此向现有接口添加方法会破坏大量现有代码。所以这个新方法是一个“约定”而不是错误接口的一部分。正因为如此，我们不能只调用 err.Unwrap() 来获取包装的错误。我们必须使用单独的函数 errors.Unwrap(err) ，它使用动态类型测试来检查 Unwrap 是否存在于其参数上。再见编译时检查，你好，本来可以是一个简单的方法调用的繁琐语法！ Java 在 JDK8 中引入了 lambda 表达式时遇到了类似的问题，并添加了默认方法实现支持以允许接口以向后兼容的方式发展。有 iota 可以快速生成自动递增的值，但它看起来更像是一个 hack，而不是一个功能。实际上，这是一个危险的问题，因为在一系列 iota 生成的常量中插入一行会改变以下常量的值。由于生成的值是在整个代码中使用的值，这可能会导致有趣的（不是！）惊喜。\n这也意味着 Go 无法让编译器检查 switch 语句是否详尽，也无法描述类型中允许的值。 Go 提供了两种方法来声明变量并为其赋值：var x = &quot;foo&quot; 和 x := &quot;foo&quot;。这是为什么？主要区别在于 var 允许在没有初始化的情况下声明（然后您必须声明类型），就像在 var x string 中一样，而 := 需要赋值并允许混合现有变量和新变量。我的猜测是 := 的发明是为了减少错误处理的痛苦： var x , err1 = SomeFunction () if ( err1 != nil ) { return nil } var y , err2 = SomeOtherFunction () if ( err2 != nil ) { return nil } x , err := SomeFunction () if ( err != nil ) { return nil } y , err := SomeOtherFunction () if ( err != nil ) { return nil } := 语法也很容易允许不小心遮蔽了一个变量。我不止一次被这个抓住了，因为 := (declare and assign) 太接近 = (assign)，如下所示： foo := &quot;bar&quot; if someCondition { foo := &quot;baz&quot; doSomething ( foo ) } // foo == &quot;bar&quot; 即使 &quot;someCondition&quot; 为真\nGo 没有构造函数。因此，它坚持“零值”应该易于使用的事实。这是一种有趣的方法，但在我看来，它带来的简化主要是针对语言实现者的。在实践中，许多类型没有适当的初始化就不能做有用的事情。我们来看一个在 Effective Go 中作为例子的 io.File 对象： type File struct { *file // os specific}func (f *File) Name() string { return f.name}func (f *File ) Read(b []byte) (n int, err error) { if err := f.checkValid(&quot;read&quot;); err != nil { return 0, err } n, e := f.read(b) return n, f.wrapErr(&quot;read&quot;, e)}func (f *File) checkValid(op string) error { if f == nil { return ErrInvalid } return nil} Read 函数，以及几乎所有其他 File 方法，首先检查文件是否已初始化。所以基本上一个零值的文件不仅没有用，而且会导致恐慌。您必须使用其中一种构造函数，例如 Open 或 Create。检查正确的初始化是您在每次函数调用时都必须支付的开销。标准库中有无数这样的类型，有些甚至不尝试用它们的零值做一些有用的事情。在零值的 html.Template 上调用任何方法：它们都惊慌失措。还有一个严重的问题是 map 的值为零：你可以查询它，但在其中存储一些东西会导致恐慌：\nvar m1 = map [ string ] string {} // 空映射 var m0 map [ string ] string // 零映射 (nil) println ( len ( m1 )) // 输出 &#39;0&#39; println ( len ( m0 )) //输出 &#39;0&#39; println ( m1 [ &quot;foo&quot; ]) // 输出 &#39;&#39; println ( m0 [ &quot;foo&quot; ]) // 输出 &#39;&#39; m1 [ &quot;foo&quot; ] = &quot;bar&quot; // ok m0 [ &quot;foo&quot; ] = &quot;bar&quot; // 恐慌！这要求您在结构具有映射字段时要小心，因为必须在向其添加条目之前对其进行初始化。因此，作为开发人员，您必须不断检查要使用的结构是否需要调用构造函数，或者零值是否有用。由于语言的一些简化，这给代码编写者带来了很大的负担。博客文章“Why Go got exceptions right”详细解释了为什么异常是糟糕的，以及为什么 Go 方法要求返回错误更好。我同意这一点，当使用异步编程或像 Java 流这样的函数式风格时，异常很难处理（让我们抛开前者在 Go 中不是必需的，多亏了 goroutines，而后者根本不可能）。博客文章提到恐慌是“对你的程序来说总是致命的，游戏结束”，这很好。现在“延迟、恐慌和恢复”在它之前，解释了如何从恐慌中恢复（通过实际捕获它们），并说“有关恐慌和恢复的真实示例，请参阅 Go 标准库中的 json 包”。事实上，json 解码器有一个通用的错误处理函数，它只是恐慌，在顶级解组函数中恢复恐慌，该函数检查恐慌类型，如果是“本地恐慌”或重新恐慌，则将其作为错误返回否则会出错（在途中丢失原始恐慌的堆栈跟踪）。对于任何 Java 开发人员来说，这绝对看起来像一个 try / catch（DecodingException ex）。所以 Go 确实有例外，在内部使用它们但告诉你不要。\n有趣的事实：几周前，一个非谷歌用户修复了 json 解码器，以使用冒泡的常规错误。更新：自从写这篇文章以来，Go 1.11 引入了基于语义版本控制的模块支持。这解决了下面解释的大部分问题，尽管选择最低版本的依赖项解析是有争议的（见......", "note_en": "This is an additional post in the “ Go is not good” series. Go does have some nice features, hence the “The Good” part in this post, but overall I find it cumbersome and painful to use when we go beyond API or network servers (which is what it was designed for) and use it for business domain logic. But even for network programming, it has a lot of gotchas both in its design and implementation that make it dangerous under an apparent simplicity.\n What motivated this post is that I recently came back to using Go for a side project. I used Go extensively in my previous job to write a network proxy (both http and raw tcp) for a SaaS service. The network part was rather pleasant (I was also discovering the language), but the accounting and billing part that came with it was painful. As my side project was a simple API I thought using Go would be the right tool to get the job done quickly, but as we know many projects grow beyond their initial scope, so I had to write some data processing to compute statistics and the pains of Go came back. So here&#39;s my take on Go woes.\n Some background: I love statically typed languages. My first significant programs were written in  Pascal. I then used  Ada and C/C++ when I started working in the early 90&#39;s. I later moved to Java and finally Scala (with some Go in between) and recently started learning  Rust. I&#39;ve also written a substantial amount of JavaScript, because up to recently it was the only language available in web browsers. I feel insecure with dynamically typed languages and try to limit their use to simple scripting. I&#39;m comfortable with imperative, functional and object oriented approaches.\n     That&#39;s a fact: if you know any kind of programming language, you can learn most of Go&#39;s syntax in a couple of hours with the &#34; Tour of Go&#34;, and write your first real program in a couple of days. Read and digest  Effective Go, wander around in  the standard library, play with a web toolkit like  Gorilla or  Go kit and you&#39;ll be a pretty decent Go developer.\n This is because Go&#39;s overarching goal is simplicity. When I started learning Go it reminded me when I first  discovered Java: a simple language and a rich but not bloated standard library. Learning Go was a refreshing experience coming from today&#39;s Java heavy environment. Because of Go&#39;s simplicity, Go programs are very readable, even if error handling adds quite some noise (more on this below).\n But this may be false simplicity though. Quoting Rob Pike,  simplicity is complicated, and we will see below that behind it there are a lot of gotchas waiting to bite us, and that simplicity and minimalism prevent writing DRY code.\n  Goroutines are probably the best feature of Go. They&#39;re lightweight computation threads, distinct from operating system threads.\n When a Go program executes what looks like a blocking I/O operation, the Go runtime actually suspends the goroutine and resumes it when an event indicates that some result is available. In the meantime other goroutines have been scheduled for execution. We therefore have the scalability benefits of asynchronous programming with a synchronous programming model.\n Goroutines are also lightweight: their stack  grows and shrinks on demand, which means having 100s or even 1000s of goroutines is not a problem.\n I once had a goroutine leak in an application: these goroutines were waiting for a channel to be closed before ending, and that channel was never closed (a common issue). The process was eating 90% of the CPU for no reason, and inspecting  expvars showed 600k idle goroutines! I guess the CPU was used by the goroutine scheduler.\n Sure, an actor system like Akka can  handle millions of actors without a sweat, in part because actors don&#39;t have a stack, but they&#39;re far from being as easy to use as goroutines to write heavily concurrent request/response applications (i.e. http APIs).\n Channels are how goroutines should communicate: they provide a convenient programming model to send and receive data between goroutines without having to rely on fragile low level synchronization primitives. Channels come with their own set of  usage  patterns.\n Channels have to be thought out carefully though, as incorrectly sized channels (they&#39;re unbuffered by default)  can lead to deadlocks. They also have a large number of  gotchas and inconsistencies. We will also see below that using channels doesn&#39;t prevent race conditions because Go lacks immutability.\n  The Go  standard library is really great, particularly for everything related to network protocols or API development: http client and server, crypto, archive formats, compressions, sending email, etc. There&#39;s even an html parser and a rather powerful templating engine to produce text &amp; html with automatic escaping to avoid XSS (used for example by  Hugo).\n The various APIs are generally simple and easy to understand. They can sometimes look simplistic though: this is in part because the goroutine programming model means we just have to care about &#34;seemingly synchronous&#34; operations. This is also because a few versatile functions can also replace a lot of specialized ones as  I found out recently for time calculations.\n  Go compiles to a native executable. Many users of Go come from Python, Ruby or Node.js. For them, this is a mind-blowing experience as they see a huge increase in the number concurrent requests a server can handle. This is actually pretty normal when you come from interpreted languages with either no concurrency (Node.js) or a global interpreter lock. Combined to the language simplicity, this explains part of the excitement for Go.\n Compared to Java however, things are not so clear in  raw performance benchmarks. Where Go beats Java though is on memory usage. Unless you&#39;re using  Graal native-image which puts them in the same ballpark.\n Go&#39;s garbage collector is designed to  prioritize latency and avoid stop-the-world pauses, which is particularly important in servers. This may come with a higher CPU cost, but in a horizontally scalable architecture this is easily solved by adding more machines. Remember that Go was designed at Google, who are all but short on resources!\n Compared to Java, the Go GC also has less work to do: a slice of structs is a contiguous array of structures, and not an array of pointers like in Java. Similarly Go maps use  small arrays as buckets for the same purpose. This means less work for the GC, and also better CPU cache locality.\n Go also beats Java for command-line utilities: being a native executable, a Go program has no startup cost contrarily to Java that first has to load and compile bytecode.\n  Some of the most heated debates in my career happened around the definition of a code format for the team. Go solves this by defining a canonical format for Go code. The   gofmt tool reformats your code and has no options.\n Like it or not,  gofmt defines how Go code should be formatted and that problem is therefore solved once for all!\n  Go comes with a great  test framework in its standard library. It has support for parallel testing, benchmarks, and contains a lot of utilities to easily test network clients and servers.\n  Compared to Python, Ruby or Node.js, having to install a single executable file is a dream for operations engineers. This is less and less an issue with the growing use of Docker, but standalone executables also means tiny Docker images.\n Go also has some built-in observability features with the   expvar package to publish internal statuses and metrics, and makes it easy to add new ones. Be careful though, as they are  automatically exposed, unprotected, on the default http request handler. Java has JMX for a similar purposes, but it&#39;s much more complex.\n  The  defer statement serves a purpose similar to  finally in Java: execute some clean up code at the end of the current function, no matter how this function is exited. The interesting thing with  defer is that it&#39;s not linked to a block of code, and can appear at any time. This allows the clean up code to be written as close as possible to the code that creates what needs to be cleaned up:\n file ,  err  :=  os . Open ( fileName ) if  err  !=  nil  {  return } defer  file . Close () // use file, we don&#39;t have to think about closing it anymore\n Sure, Java&#39;s  try-with-resource is less verbose and Rust  automatically claims resources when their owner is dropped, but since Go  requires you to be explicit about resource clean up, having it close to resource allocation is nice.\n  I love types, and something that irritates/scares me is when for example we pass around persisted object identifiers as  string or  long everywhere. We usually encode the id&#39;s type in the parameter name, but this is a cause of subtle bugs when a function has several identifiers as parameters and some call mismatches parameter order.\n Go has first-class support for new types, i.e. types that take an existing type and give it a separate identity, distinct from the original one. Contrarily to wrapping, new types have no runtime overhead. This allows the compiler to catch this kind of mistake:\n type  UserId  string  // &lt;-- new type type  ProductId  string func  AddProduct ( userId  UserId ,  productId  ProductId )  {} func  main ()  {  userId  :=  UserId ( &#34;some-user-id&#34; )  productId  :=  ProductId ( &#34;some-product-id&#34; )  // Right order: all fine  AddProduct ( userId ,  productId )  // Wrong order: would compile with raw strings  AddProduct ( productId ,  userId )  // Compilation errors:  // cannot use productId (type ProductId) as type UserId in argument to AddProduct  // cannot use userId (type UserId) as type ProductId in argument to AddProduct }\n Unfortunately the lack of generics makes the use of new types cumbersome as writing reusable code for them requires to cast values to/from the original type.\n   In  Less is exponentially more, Rob Pike explains that Go was meant to replace C and C++ at Google, and that its precursor was  Newsqueak, a language he wrote in the 80&#39;s. Go also has a lot of references to  Plan9, a distributed operating system the authors of Go developed in the 80&#39;s at Bell Labs.\n There&#39;s even a  Go assembly directly inspired from Plan9. Why not using  LLVM that would have provided a wide range of target architectures out of the box? I may also be missing something here, but why is that needed? If you need to write assembly to get the most out of the CPU, shouldn&#39;t you use directly the target CPU assembly language?\n Go creators deserve a lot of respect, but it looks like Go&#39;s design happened in a parallel universe (or their Plan9 lab?) where most of what happened in compilers and programming language design in the 90&#39;s and 2000&#39;s never happened. Or that Go was designed by system programmers who were also able to write a compiler.\n Functional programming? No mention of it. Generics? You don&#39;t need them, look at the mess they produced in C++! Even if slice, map and channels  are generic types as we&#39;ll see below.\n Go&#39;s goal was to replace C and C++, and it&#39;s apparent that its creators didn&#39;t look much elsewhere. They missed their target though, as C and C++ developers at Google didn&#39;t adopt it. My guess is that the primary reason is the garbage collector. Low level C developers fiercely reject managed memory as they have no control on what happens and when. They like this control, even if it comes with additional complexity and opens the door to memory leaks and buffer overflows. Interestingly, Rust has taken a completely different approach with automatic memory management without a GC.\n Go instead attracted users of scripting languages like Python and Ruby in the area of operation tools. They found in Go a way to have great performance and reduced memory/cpu/disk footprint. And more static typing too, which was new to them. The killer app for Go was Docker, that triggered its wide adoption in the devops world. The rise of Kubernetes strengthens this trend.\n  Go interfaces are like Java interfaces or Scala &amp; Rust traits: they define behaviour that is later implemented by a type (I won&#39;t call it &#34;class&#34; here).\n Unlike Java interfaces and Scala &amp; Rust traits though, a type doesn&#39;t need to explicitly specify that it implements an interface: it just has to implement all functions defined in the interface. So Go interfaces are actually  structural typing.\n We may think that this is to allow interface implementations in other packages than the type they apply to, like class extensions that exist in Scala or Kotlin, or Rust traits, but this isn&#39;t the case: all methods related to a type must be defined in the type&#39;s package.\n Go isn&#39;t the only language to use structural typing, but I find it has several drawbacks:\n finding what types implement a given interface is hard as it relies on function definition matching. I often discover interesting implementations in Java or Scala by searching for classes that implement an interface.\n when adding a method to an interface, you will find what types need to be updated only when they are used as values of this interface type. This can go unnoticed for quite some time. Go recommends to have tiny interfaces with very few methods, which is a way to prevent this.\n a type may unknowingly implement an interface because it has the corresponding methods. But being accidental, the semantics of the implementation may be different from what is expected from the interface contract.\n   Added after the Go 1.13 release. That may not seem like a big deal, but read on.\n Go 1.13 introduced method chaining, adding a new  Unwrap method to errors. Since Go interfaces don&#39;t support default implementations for their methods, adding a method to an existing interface would break a lot of existing code. So  this new method is a &#34;convention&#34; rather than being part of the  error interface. And because of that we can&#39;t just call  err.Unwrap() to get the wrapped error. We have to use the separate function  errors.Unwrap(err) which uses  dynamic typing tests to check if  Unwrap exists on its parameter.\n Bye-bye compile-time checks, hello cumbersome syntax for what could have been a simple method call! Java faced a similar issue in JDK8 with the introduction of lambdas, and added  default method implementation support to allow interfaces to evolve in a backwards-compatible way.\n   There is   iota to quickly generate auto-incrementing values, but it looks more like a hack than a feature. And a dangerous one, actually, since inserting a line in a series of iota-generated constants will change the value of the following ones. Since the generated value is the one that is used throughout the code, this can lead to interesting (not!) surprises.\n This also means there is no way in Go to have the compiler check that a  switch statement is exhaustive, and no way to describe the allowed values in a type.\n  Go provides two ways to declare a variable and assign it a value:  var x = &#34;foo&#34; and  x := &#34;foo&#34;. Why is that?\n The main differences are that  var allows declaration without initialization (and you then have to declare the type), like in  var x string, whereas  := requires assignment and allows a mix of existing and new variables. My guess is that  := was invented to make error handling  a bit less painful:\n  var  x ,  err1  =  SomeFunction () if  ( err1  !=  nil )  {  return  nil } var  y ,  err2  =  SomeOtherFunction () if  ( err2  !=  nil )  {  return  nil }\n  x ,  err  :=  SomeFunction () if  ( err  !=  nil )  {  return  nil } y ,  err  :=  SomeOtherFunction () if  ( err  !=  nil )  {  return  nil }\n The  := syntax also easily allows to accidentally shadow a variable. I was caught more than once by this, as  := (declare and assign) is too close too  = (assign), as shown below:\n foo  :=  &#34;bar&#34; if  someCondition  {  foo  :=  &#34;baz&#34;  doSomething ( foo ) } // foo == &#34;bar&#34; even if &#34;someCondition&#34; is true\n  Go doesn&#39;t have constructors. Because of that, it insists on the fact that the &#34; zero value&#34; should be readily usable. This is an interesting approach, but in my opinion the simplification it brings is mostly for the language implementors.\n In practice, many types can&#39;t do useful things without proper initialization. Let&#39;s look a the  io.File object that is taken as an example in  Effective Go:\n type File struct { *file // os specific}func (f *File) Name() string { return f.name}func (f *File) Read(b []byte) (n int, err error) { if err := f.checkValid(&#34;read&#34;); err != nil { return 0, err } n, e := f.read(b) return n, f.wrapErr(&#34;read&#34;, e)}func (f *File) checkValid(op string) error { if f == nil { return ErrInvalid } return nil}\n  The  Read function, and  pretty much every other  File method, starts by checking if the file was initialized.\n So basically a zero-value  File is not only useless, but can lead to panics. You  have to use one of the constructor functions like  Open or  Create. And checking proper initialization is an overhead you have to pay at every function call.\n There are countless types like this one in the standard library, and some that don&#39;t even try to do something useful with their zero value. Call any method on a zero-value  html.Template: they all panic.\n And there is also a serious gotcha with  map&#39;s zero value: you can query it, but storing something in it will panic:\n var  m1  =  map [ string ] string {}  // empty map var  m0  map [ string ] string  // zero map (nil) println ( len ( m1 ))  // outputs &#39;0&#39; println ( len ( m0 ))  // outputs &#39;0&#39; println ( m1 [ &#34;foo&#34; ])  // outputs &#39;&#39; println ( m0 [ &#34;foo&#34; ])  // outputs &#39;&#39; m1 [ &#34;foo&#34; ]  =  &#34;bar&#34;  // ok m0 [ &#34;foo&#34; ]  =  &#34;bar&#34;  // panics!\n This requires you to be careful when a structure has a  map field, since it has to be initialized before adding entries to it.\n So, as a developer, you have to constantly check if a structure you want to use requires to call a constructor function or if the zero value is useful. This is a lot of burden put on code writers for some simplifications in the language.\n  The blog post &#34; Why Go gets exceptions right&#34; explains in detail why exceptions are bad, and why the Go approach to require returning  error is better. I can agree with that, and exceptions are hard to deal with when using asynchronous programming or a functional style like Java streams (let&#39;s put aside that the former isn&#39;t necessary in Go thanks to goroutines and the latter is simply not possible). The blog post mentions  panic as &#34;always fatal to your program, game over&#34;, which is fine.\n Now &#34; Defer, panic and recover&#34; that predates it, explains how to recover from panics (by actually catching them), and says &#34;For a real-world example of panic and recover, see the json package from the Go standard library&#34;.\n And indeed, the json decoder has a  common error handling function that just panics, the panic being recovered in the top-level  unmarshal function that  checks the panic type and returns it as an error if it&#39;s a &#34;local panic&#34; or re-panics the error otherwise (losing the original panic&#39;s stacktrace on the way).\n To any Java developer this definitely looks like a  try /  catch (DecodingException ex). So Go does have exceptions, uses them internally but tells you not to.\n Fun fact: a non-googler  fixed the json decoder a couple of weeks ago to using regular errors bubbling up.\n   Update: since this post was written, Go 1.11 has  introduced module support with resolution based on semantic versioning. This solves most of the issues explained below, although the choice of the minimum version for dependency resolution is debatable (see \n......", "posttime": "2021-08-10 00:10:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "bad", "title": "去：好的，坏的和丑的", "title_en": "Go: The Good, the Bad and the Ugly", "transed": 1, "url": "https://bluxte.net/musings/2018/04/10/go-good-bad-ugly/#the-good", "via": "", "real_tags": ["bad"]}, {"category": "", "categoryclass": "", "imagename": "79edbd7d6007864f041a009f98743283.jpg", "infoid": 1072333, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Centro Hospitalar e Universitário de Coimbra 进行的一项研究得出结论，接种 Covid-19 疫苗的人的抗体在几个月内急剧下降，“这表明需要第三剂针对 Covid-19 的疫苗”。这些信息今天被各种媒体来源复制，仅在三个月前就解释了为什么可以看到抗体在接种疫苗后数周减少 - 以及为什么这不应被视为问题（单击此处）。换句话说，这个故事看起来更像是“无论如何”推动第 3 种疫苗的发展——几天前有报告表明这里的当局认为没有必要。甚至世界卫生组织也呼吁各国“暂缓”第三次（加强）接种的决定，以让更多较贫穷的国家“赶上”并为本国公民接种疫苗。但今天的 SIC 通报对这项研究的结论提出了质疑，他说：“研究人员建议应分阶段施用第三剂。 “首先是风险病例，然后是六个月前接种疫苗的人，最后是与年龄无关的整个人群。 “这是为控制疫情和避免病毒更具侵略性的变种进化而提出的策略”。\n消息传出之际，免疫学家曼努埃尔·桑托斯·罗莎 (Manuel Santos Rosa) 一直在同一电台播出，再次强调接种疫苗的人仍然可以感染和传播病毒（单击此处）。在此基础上，必须问一个问题：“为什么需要第三剂”——除非它是一种不同的（调整过的）疫苗，不会让受试者容易再次感染或传播？如果只是重新接种与以前完全相同的疫苗，那么几个月后抗体肯定会再次下降，然后专家会发出需要第四剂的警报？ Diário de Notícias 解释了这项研究的背景：它的想法出现在 2020 年 12 月，当时科英布拉大学医院 (CHUC) 的病理科开始为其大约 4,000 名专业人员准备 Covid 疫苗接种计划，并“意识到应该收集信息”监测对疫苗的反应“以及人们对病毒保持免疫力的时间”。 “八个月后，一半参与研究的人的完整结果”已经准备就绪——根据协调研究的医生 Lucília Araújo 的说法，这表明“迟早需要第三剂”，因为在接种疫苗后六个月结束时“可能不再具有保护作用”。抗体并没有以完全相同的方式分布在不同的年龄组：“最年轻的测试对象表现出“数量更多，而老年人的反应则减少”。另一个经过验证的重要细节是，感染 Covid-19 的人的免疫力降低了（这与 5 月份发布的数据有关，Expresso 报道说，自然感染使人们比接种疫苗更容易感染，点击此处. 奇怪的是，这段文字似乎从 Expresso 的网站上消失了）。\n还发现两性对疫苗的反应也不同：例如，在这段时间内，男性记录的抗体少于女性。 “然而，专家警告说，抗体的产生只是对抗这种疾病的前线之一。但是，尽管存在针对 Covid-19 的其他防御机制，但注册抗体的减少使进行研究的人指出需要第三剂疫苗”，SIC 重复说。这就是消息“罐子”的地方。 《纽约时报》去年 11 月报道：“许多免疫学家指出，抗体水平下降是很自然的”，因为它们“只是免疫系统的一个臂膀”。难题也许是人们的免疫系统在接种疫苗后是否会以与自然感染 Covid-19（或感染 SARS-CoV-2）时的工作方式相同的方式工作？", "note_en": "A study undertaken by the Centro Hospitalar e Universitário de Coimbra has concluded that antibodies in people vaccinated against Covid-19 fall dramatically within a few months “pointing to the necessity for a third dose of vaccine against Covid-19”.\n This information is reproduced by various media sources today when only three months ago it was explained WHY antibodies can be seen to reduce weeks after vaccination – and why this should never be viewed as a problem  (click here).\n In other words, this story is looking more like a push for the 3rd vaccine ‘no matter what’ – days after reports went out suggesting authorities here saw no need for this.\n Even the World Health Organisation has appealed to countries to ‘hold back’ on decisions for 3rd (booster) inoculations to allow more of the poorer nations to ‘catch up’ and vaccinate their own citizens.\n      But SIC noticias today is charging forwards with the conclusions of this study, saying: “investigators propose that a third dose should be administered in stages.\n “In first place will be cases of risk, then those who were vaccinated more than six months ago and finally the whole population, independent of age.\n “This is the strategy proposed to control outbreaks and avoid the evolution of more aggressive variants of the virus”.\n The news comes as immunologist Manuel Santos Rosa has been on air, on the same station, reemphasising that vaccinated people can still contract and transmit the virus  (click here).\n On this basis, the question has to be asked ‘why would a third dose be needed’ – unless perhaps it was of a different (tweaked) vaccine that did not leave subjects open to reinfection or transmission?\n If it was simply a case of revaccinating with exactly the same vaccine as before, then surely a few months down the line antibodies would simply fall again, and then experts would sound the alert for the need of a fourth dose?\n Diário de Notícias explains the context of this study: the idea for it came in December 2020 when the pathology department of Coimbra’s university hospital (CHUC) started to prepare the Covid vaccination plan for its roughly 4,000 professionals and “realised that information should be gathered” to monitor response to the vaccine “and how long people remained immune to the virus”.\n “Eight months on, complete results for half the population that adhered to the study” are ready – and according to Lucília Araújo, the doctor coordinating the research, this shows that ‘sooner or later a third dose will be necessary’ as antibodies detected at the end of six months post-vaccination “may no longer be protective”.\n Antibodies didn’t fall across different age-groups in quite the same way: “the youngest test subjects showed “more elevated quantities while in the more elderly response decreased”.\n Another important detail verified was that the decrease in immunity was reduced in people who had contracted Covid-19 (this ties in with data that came out in May, reported in Expresso that natural infection leaves people better infected than if they take the vaccine  click here. This text, strangely seems to have disappeared since from Expresso’s site).\n Response to the vaccine was also seen to differ between the sexes: men for example registered less antibodies than women over the time period.\n “The specialists warn however that the production of antibodies is just one of the battlefronts against the disease. But in spite of other defence mechanisms existing against Covid-19, the reduction of antibodies registered leaves those who conducted the study pointing to the necessity of a third dose of vaccine”, repeats SIC.\n And this is where the message ‘jars’. The New York Times reported last November: “ many immunologists have noted that it is   natural for antibody levels to drop ” as these are “just one arm of the immune system”.\n The conundrum perhaps is will people’s immune systems work post vaccination in the same way as they would work if they had contracted Covid-19 (or been infected with SARS-CoV-2) naturally?", "posttime": "2021-08-10 00:09:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "表明,reveals,抗体", "title": "新研究表明，接种疫苗后 3 个月抗体会急剧下降", "title_en": "New study reveals antibodies fall dramatically 3 months after vaccination", "transed": 1, "url": "https://www.portugalresident.com/new-study-reveals-antibodies-fall-dramatically-months-after-vaccination-a-3rd-dose-is-inevitable/", "via": "", "real_tags": ["表明", "reveals", "抗体"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072332, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据 Flynn 的分类法，SIMD 是指一种计算机架构，可以用一条指令处理多个数据流（即“单指令流，多个数据流”）。有不同的分类法，并且在被归类为“SIMD”的几个不同的子类别和架构中。然而，在这篇文章中，我指的是当代消费级指令集架构中最常见的 SIMD 类型，大多数人在听到“SIMD”一词时都会想到这种类型：打包 SIMD。打包 SIMD 架构的共同特征是将多个数据元素打包到一个固定宽度的寄存器中。以下是打包的 128 位宽 SIMD 寄存器的可能配置示例：例如，128 位寄存器可以保存 16 个整数字节或 4 个单精度浮点值。自 1990 年代中期以来，这种类型的 SIMD 架构非常流行，一些打包的 SIMD ISA:s 是： 所有这些 ISA:s 的承诺是提高数据处理性能，因为每条指令并行执行多个操作。但是，这个模型存在问题。由于寄存器大小是固定的，如果不添加新指令和寄存器，就无法将 ISA 扩展到新的硬件并行级别。举个例子：MMX（64 位）vs SSE（128 位）vs AVX（256 位）vs AVX-512（512 位）。添加新的寄存器和指令有很多含义。例如，必须更新 ABI，并且必须向操作系统内核、编译器和调试器添加支持。\n另一个问题是每个新的 SIMD 生成都需要新的指令操作码和编码。在固定宽度指令集（例如 ARM）中，这可能会禁止任何新的扩展，因为可能没有足够的操作码槽来添加新指令。在可变宽度指令集（例如 x86）中，效果通常是指令变得越来越长（有效地损害了代码密度）。矛盾的是，每一代新的 SIMD 本质上都使前几代变得多余（除了支持二进制向后兼容性），因此浪费了大量指令而没有增加太多价值。最后，任何想要使用新指令集的软件都需要重写（或至少重新编译）。更糟糕的是，软件开发人员通常必须针对多个 SIMD 代，并在他们的程序中添加机制，根据支持的 SIMD 代动态选择最佳代码路径。打包的 SIMD 范例是寄存器宽度和执行单元宽度之间存在 1:1 的映射（例如，NEON 和 SSE 为 128 位）。同时，许多 SIMD 操作是流水线式的，需要几个时钟周期才能完成（例如浮点运算和内存加载指令）。这样做的副作用是一条 SIMD 指令的结果直到指令流中后面的几条指令才准备好使用。因此，必须展开循环以避免停顿并保持流水线忙碌。这可以在具有寄存器重命名和推测性乱序执行的高级（耗电）硬件实现中完成，但对于更简单（通常更节能）的硬件实现，循环必须在软件中展开。许多旨在支持有序和无序处理器的软件开发人员和编译器只是在软件中展开所有 SIMD 循环。然而，循环展开会损害代码密度（即使程序二进制文件更大），这反过来又会损害指令缓存性能（指令缓存中适合的程序段变少，从而降低了缓存命中率）。循环展开也增加了寄存器压力（即必须使用更多的寄存器以将多个循环迭代的状态保持在寄存器中），因此架构必须提供足够的 SIMD 寄存器以避免寄存器溢出。当循环中要处理的数组元素数量不是SIMD寄存器中元素数量的倍数时，需要在软件中实现特殊的循环尾部处理。例如，如果一个数组包含 99 个 32 位元素，并且 SIMD 体系结构为 128 位宽（即一个 SIMD 寄存器包含四个 32 位元素），则可以在主 SIMD 循环中处理 4*24=96 个元素，并且 99 -96=3 个元素需要在主循环后处理。\n这在处理尾部的循环之后需要额外的代码。一些架构支持屏蔽加载/存储，这使得使用 SIMD 指令处理尾部成为可能，而更常见的场景是您必须使用标量（非 SIMD）指令来实现尾部（在后一种情况下可能有如果标量和 SIMD 指令具有不同的功能和/或语义，那么问题就来了，但这不是打包 SIMD 本身的问题，只是一些 ISA:s 的设计方式）。通常在循环之前你还需要额外的控制逻辑。例如，如果数组长度小于 SIMD 寄存器宽度，则应跳过主 SIMD 循环。添加的控制逻辑和尾部处理代码损害了代码密度（再次降低了指令缓存效率），并增加了额外的开销（并且通常很难编写代码）。解决上述所有缺陷的打包 SIMD 的一种替代方法是矢量处理器。也许最著名的矢量处理器是 Cray-1（1975 年发布），它启发了新一代指令集架构，包括 ARM SVE 和 RISC-V RVV。其他几个（可能鲜为人知的）项目正在追求类似的矢量模型，包括 Agner Fog 的 ForwardCom 和我自己的 MRISC32。一个有趣的变体是 Libre-SOC（基于 OpenPOWER）及其 Simple-V 扩展，它将向量映射到标量寄存器文件（每个标量寄存器文件都包含大约 128 个寄存器）。 Mitch Alsup 的 My 66000 及其虚拟向量方法 (VVM) 采用了一种完全不同的方法，该方法借助特殊的循环修饰指令在硬件中将标量循环转换为矢量化循环。这样它甚至不必有一个向量寄存器文件。另一个有趣的架构是 Mill，它也支持没有打包 SIMD 的向量。", "note_en": "According to Flynn’s taxonomy  SIMD refers to a computer architecture that can process multiple data streams with a single instruction (i.e. “Single Instruction stream, Multiple Data streams”). There are different taxonomies, and within those several different sub-categories and architectures that classify as “SIMD”. In this post, however, I refer to the type of SIMD that is most common in contemporary consumer grade instruction set architectures, and which most people think about when they hear the term “SIMD”: packed SIMD.\n  The common trait of packed SIMD architectures is that several data elements are packed into a single register of a fixed width. Here is an example of possible configurations of a packed 128 bits wide SIMD register:\n  For instance, a 128-bit register can hold sixteen integer bytes or four single precision floating-point values.\n This type of SIMD architecture has been wildly popular since the mid 1990s, and some packed SIMD ISA:s are:\n  The promise of all those ISA:s is increased data processing performance, since each instruction executes several operations in parallel. However, there are problems with this model.\n  Since the register size is fixed there is no way to scale the ISA to new levels of hardware parallelism without adding new instructions and registers. Case in point: MMX (64 bits) vs SSE (128 bits) vs AVX (256 bits) vs AVX-512 (512 bits).\n Adding new registers and instructions has many implications. For instance, the  ABI must be updated, and support must be added to operating system kernels, compilers and debuggers.\n Another problem is that each new SIMD generation requires new instruction opcodes and encodings. In fixed width instruction sets (e.g. ARM) this may prohibit any new extensions, since there may not be enough opcode slots left for adding the new instructions. In variable width instruction sets (e.g. x86) the effect is typically that instructions get longer and longer (effectively hurting code density). Paradoxically each new SIMD generation essentially renders the previous generations redundant (except for supporting binary backwards compatibility), so a large number of instructions are wasted without adding much value.\n Finally, any software that wants to use the new instruction set needs to be rewritten (or at least recompiled). What is worse, software developers often have to target several SIMD generations, and add mechanisms to their programs that dynamically select the optimal code paths depending on which SIMD generation is supported.\n  The packed SIMD paradigm is that there is a 1:1 mapping between the register width and execution unit width (e.g. 128 bits for NEON and SSE). At the same time many SIMD operations are pipelined and require several clock cycles to complete (e.g. floating-point arithmetic and memory load instructions). The side effect of this is that the result of one SIMD instruction is not ready to be used until several instructions later in the instruction stream.\n Consequently, loops have to be  unrolled in order to avoid stalls and keep the pipeline busy. This can be done in advanced (power hungry) hardware implementations with register renaming and speculative out-of-order execution, but for simpler (usually more power efficient) hardware implementations loops have to be unrolled in software. Many software developers and compilers aiming to support both in-order and out-of-order processors simply unroll all SIMD loops in software.\n However, loop unrolling hurts code density (i.e. makes the program binary larger), which in turn hurts instruction cache performance (fewer program segments fit in the instruction cache, which reduces the cache hit ratio).\n Loop unrolling also increases  register pressure (i.e. more registers must be used in order to keep the state of multiple loop iterations in registers), so the architecture must provide enough SIMD registers to avoid  register spilling.\n  When the number of array elements that are to be processed in a loop is not a multiple of the number of elements in the SIMD register, special loop tail handling needs to be implemented in software. For instance if an array contains 99 32-bit elements, and the SIMD architecture is 128 bits wide (i.e. a SIMD register contains four 32-bit elements), 4*24=96 elements can be processed in the main SIMD loop, and 99-96=3 elements need to be processed after the main loop.\n This requires extra code after the loop for handling the tail. Some architectures support masked load/store that makes it possible to use SIMD instructions to process the tail, while a more common scenario is that you have to use scalar (non-SIMD) instructions to implement the tail (in the latter case there may be problems if scalar and SIMD instructions have different capabilities and/or semantics, but that is not an issue with packed SIMD per se, just with how some ISA:s are designed).\n Usually you also need extra control logic before the loop. For instance if the array length is less than the SIMD register width, the main SIMD loop should be skipped.\n The added control logic and tail handling code hurts code density (again reducing the instruction cache efficiency), and adds extra overhead (and is generally awkward to code).\n  One alternative to packed SIMD that addresses all of the flaws mentioned above is a  Vector Processor. Perhaps the most notable vector processor is the  Cray-1 (released 1975), and it has served as an inspiration for a new generation of instruction set architectures, including ARM  SVE and RISC-V  RVV.\n Several other (perhaps less known) projects are pursuing a similar vector model, including Agner Fog’s  ForwardCom and my own  MRISC32. An interesting variant is  Libre-SOC (based on OpenPOWER) and its  Simple-V extension that maps vectors onto the scalar register files (which are extended to include some 128 registers each).\n A completely different approach is taken by Mitch Alsup’s  My 66000 and its Virtual Vector Method (VVM), which transforms scalar loops into vectorized loops in hardware with the aid of special loop decoration instructions. That way it does not even have to have a vector register file.\n Another interesting architecture is the  Mill, which also has  support for vectors without packed SIMD.", "posttime": "2021-08-10 00:09:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "基本,flaws,simd", "title": "SIMD 的三个基本缺陷", "title_en": "Three Fundamental Flaws of SIMD", "transed": 1, "url": "https://www.bitsnbites.eu/three-fundamental-flaws-of-simd", "via": "", "real_tags": ["基本", "flaws", "simd"]}, {"category": "", "categoryclass": "", "imagename": "a9b1dd301e3b1d0adc2f22528bffd33c.jpg", "infoid": 1072331, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在 7 月 21 日的直播中，微软项目经理 Aria Carley 回答了微软技术社区用户关于升级到 Windows 11 的最终硬件要求的问题。虽然硬件要求——包括但不限于 TPM 2.0 支持——并不适用于 Windows 11 alpha 图像现在可用，Carley 确认“硬件地板”对于最终版本是真实的。 “所以我们讨论了这个新的硬件平台，哪些设备符合条件，哪些不符合条件，”Carley 说，并补充道，“我们知道有些设备不符合 Windows 11 的条件，这很糟糕。”她继续表示，微软正在实施不受欢迎的硬件层，“以保持设备的生产力、更好的体验，最重要的是拥有比以前更好的安全性，以便他们在这支新员工队伍中得到保护。”尽管承认这种情况对受影响的用户来说“糟糕透顶”，但 Carley 在回答后来的问题时加倍强调硬件层的不灵活，他说：“组策略不会让你绕过 Windows 11 的硬件强制执行。我们是仍然会阻止您升级您的设备......以确保您的设备保持受支持和安全。”不出所料，这些答案似乎并没有被观众接受——根据 Windows Central 的说法，该视频的最高评论写道，“这些答案中的很多都是超级聋子......看起来 Windows 11 将是另一个视窗 8。”其他评论（同样，根据 Windows Central 的说法）推测，看似不必要的硬件要求是推动新计算机销售的隐秘策略，相应地促进了 Windows 许可证销售。不幸的是，我们不得不接受各种博客对 Microsoft 技术社区用户不得不说的话，因为 Microsoft 只是禁用了对视频的评论 - 删除所有现有评论 - 以回应消极情绪。虽然评论消失了，但投票没有——截至今天下午，有 270 人不喜欢，只有 146 人喜欢。在我们看来，微软急于提出新的硬件要求过于激进且处理不当，不管任何人对其未指明的安全优势的合法性有何看法。一个更温和的“为 Windows 11 制造”活动——要求 OEM 硬件供应商在新的、OEM 安装的 Windows 系统上满足这些要求——可能足以在大致相同的时间范围内实现相同的目标。", "note_en": "In a July 21  livestream, Microsoft Program Manager Aria Carley answered Microsoft Tech Community users&#39; questions about the final hardware requirements to upgrade to Windows 11. Although hardware requirements—including but not limited to TPM 2.0 support—aren&#39;t enforced for the Windows 11 alpha images available now, Carley confirmed that the &#34;hardware floor&#34; would be real for final versions.\n &#34;So we talk about this new hardware floor of what devices are eligible and which aren&#39;t,&#34; Carley said, adding, &#34;We know that it sucks that some aren&#39;t going to be eligible for Windows 11.&#34; She went on to state that Microsoft is imposing the unpopular hardware floor &#34;to keep devices more productive, have a better experience, and most importantly have better security than before so they can stay protected in this new workforce.&#34;\n Despite acknowledging that the situation &#34;sucks&#34; for affected users, Carley doubled down on the inflexibility of the hardware floor in response to a later question, saying: &#34;Group policy will not enable you to get around hardware enforcement for Windows 11. We&#39;re still going to block you from upgrading your device... to make sure your devices stay supported and secure.&#34;\n    Unsurprisingly, these answers didn&#39;t seem to go over well with the audience—according to  Windows Central, the video&#39;s top comment read, &#34;A lot of these answers come off as super tone deaf... it&#39;s looking like Windows 11 will be another Windows 8.&#34; Other comments—again, according to Windows Central—speculated that the seemingly unnecessary hardware requirements are a thinly veiled ploy to push new computer sales, with corresponding boosts to Windows license sales.\n Unfortunately, we&#39;re left to take various blogs&#39; word on what the Microsoft Tech Community users had to say, because Microsoft simply disabled comments on the video—deleting all existing comments—in response to the negativity. Although the comments are gone, the voting is not—with 2.7K dislikes and only 146 likes as of this afternoon.\n In our opinion, Microsoft&#39;s rush to new hardware requirements is overly aggressive and badly handled, regardless of what anyone might think of the legitimacy of its unspecified security benefits. A much gentler &#34;made for Windows 11&#34; campaign—requiring OEM hardware vendors to meet those requirements on new, OEM-installed Windows systems—would have probably been sufficient to accomplish the same goals in roughly the same time frame.", "posttime": "2021-08-09 23:27:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,微软,windows,推广,efforts", "title": "微软的 Windows 11 推广工作进展不顺利", "title_en": "Microsoft’s Windows 11 outreach efforts aren’t going very well", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/08/microsofts-windows-11-outreach-efforts-arent-going-very-well/", "via": "", "real_tags": ["microsoft", "微软", "windows", "推广", "efforts"]}, {"category": "", "categoryclass": "", "imagename": "a8fbf1ee7e0be2d3d795036b443bc2f6.jpg", "infoid": 1072327, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Extra Crunch Live 让您有机会聆听成功筹集大量风险投资的企业家以及相信他们的投资者的现场直播。我们详细介绍了交易是如何完成的，你会听到关于向风险投资公司推销需要什么以及行业领先的风险投资公司在潜在投资组合公司中寻找什么的信息。我们很高兴 Nwankwo 和 Bell 加入我们的这一集。 Nwankwo 创立并领导了 1910 Genetics，该公司利用人工智能加速发现和开发各种疾病和病症类别的新药物疗法。她拥有博士学位。在塔夫茨大学医学院获得药理学和实验治疗学博士学位，并参与了药物发现开发，从而在她的研究生工作之前创建了 2 型糖尿病药物 Trulicity。贝尔的职业生涯包括设计和制造用于深海探索的自主机器人，以及在 Apple 为消费技术领导者设计笔记本电脑的六年时间。贝尔的风险投资工作于 2015 年在 Playground Global 开始；他专注于深度技术投资，包括航空航天、基因组学、合成生物学和人工智能辅助药物发现，例如 1910 Genetics。 Extra Crunch Live 还设有 ECL Pitch-off，观众中的初创公司几乎可以“举手”在我们的直播中直播他们的初创公司。我们的专家客人将就每个球场提供反馈。如果你想把你的帽子扔进戒指，你必须出现。 Extra Crunch Live 对所有人开放，但只有 Extra Crunch 会员才能按需访问内容。我们每周都做这些，所以 ECL 库中有很多关于各种创业领域的剧集。这只是成为 Extra Crunch 会员的众多原因之一。加入这里。", "note_en": "Extra Crunch Live gives you the chance to hear live from entrepreneurs who have successfully raised significant rounds of venture capital — and from the investors who believed in them. We go into detail about how the deal got done, and you’ll hear from both about what it takes to pitch VCs and what industry-leading VCs look for in prospective portfolio companies.\n We’re thrilled to have Nwankwo and Bell joining us for this episode. Nwankwo founded and leads 1910 Genetics, which takes advantage of AI to accelerate the discovery and development of new drug therapies across a wide range of disease and condition categories. She has a Ph.D. in pharmacology and experimental therapeutics from Tufts University School of Medicine and participated in drug discovery development that led to the creation of Type 2 diabetes drug Trulicity prior to her graduate school work.\n Bell’s career includes designing and building autonomous robots for deep-sea exploration, as well as a six-year stint at Apple designing notebooks for the consumer technology leader. Bell’s venture investment work began at Playground Global in 2015; he focuses on deep tech investments, including in aerospace, genomics, synthetic biology, and AI-assisted drug discovery, as in the case of 1910 Genetics.\n Extra Crunch Live also features the ECL Pitch-off, where startups in the audience can virtually “raise their hand” to pitch their startup live on our stream. Our expert guests will give their feedback on each pitch. If you want to throw your hat in the ring, you have to show up.\n Extra Crunch Live is accessible to everyone, but only Extra Crunch members can access the content on demand. We do these every week, so there are scores of episodes across a wide variety of startup sectors in the  ECL Library. It’s but one of many reasons to become an Extra Crunch member.  Join here.", "posttime": "2021-08-09 23:25:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "crunch,药物", "title": "1910 Genetics 的 Jen Nwankwo 和 Playground Global 的 Jory Bell 将加入我们的 Extra Crunch Live", "title_en": "\n\t\t\t\t1910 Genetics’ Jen Nwankwo and Playground Global’s Jory Bell are joining us for Extra Crunch Live\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/09/1910-genetics-jen-nwankwo-and-playground-globals-jory-bell-are-joining-us-for-extra-crunch-live/", "via": "", "real_tags": ["crunch", "药物"]}, {"category": "", "categoryclass": "", "imagename": "dc0c3ed9848d9e953d88402318ef7e39.jpg", "infoid": 1072325, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“搜索引擎？！”我听你说？嗯，是的，因为尽管现代搜索引擎能够方便地为个人定制搜索结果，但这种用户跟踪是以牺牲隐私为代价的。这种大规模监视可能是改进谷歌搜索引擎和 Facebook 广告定位的原因，仅举两个例子，但这对我们的隐私并不是很好。诚然，互联网用户可以改用美国的 DuckDuckGo，或者可能是法国的 Qwant，但他们在隐私方面获得的好处往往会因为缺乏定制而失去用户体验和搜索结果的相关性。总部位于柏林的 Xayn 提出的是个性化的，但在智能手机上进行隐私安全的网络搜索，它用现代智能手机内置的先天人工智能取代了谷歌等人采用的基于云的人工智能。结果是没有关于您的数据上传到 Xayn 的服务器。这种方法不仅适用于“隐私怪胎”。需要搜索但不需要谷歌市场主导地位的企业越来越被这种模式所吸引。今天的新证据表明，Xayn 现在已经在由日本投资者 Global Brain 和 KDDI（日本电信运营商）牵头的 A 轮融资中筹集了近 1200 万美元，之前的支持者也参与了其中，包括柏林的 Earlybird VC。迄今为止，Xayn 的总融资额已超过 2300 万美元。 Xayn 的搜索引擎、发现源和移动浏览器的融合似乎吸引了这些亚洲市场参与者，特别是因为 Xayn 可以内置到 OEM 设备中。投资的结果是 Xayn 现在还将专注于亚洲市场，从日本开始，以及欧洲。\nXayn 的联合创始人兼首席执行官 Leif-Nissen Lundbæk 说：“我们向 Xayn 证明了你可以拥有一切：通过个性化获得出色的结果，通过先进技术设计隐私，通过简洁设计获得方便的用户体验。”他补充说：“在一个以大量销售数据和投放广告为常态的行业中，我们选择以隐私为导向，并将用户满意度放在首位。”这笔资金是在欧盟的 GDPR 或加利福尼亚的 CCPA 等立法都提高了公众对在线个人数据的认识之际获得的。 Xayn 表示，自推出以来，其应用程序已在全球范围内下载了约 215,000 次，预计不久将推出其应用程序的网络版本。在电话中，Lundbæk 详细介绍了融资的 KDDI 方面：“与 KDDI 的合作意味着我们将让用户免费访问 Xayn，而企业（例如 KDDI）是实际客户，但将我们的搜索引擎提供给了我们免费。” Xayn 的核心功能包括个性化的搜索结果；整个互联网的个性化提要，从他们类似 Tinder 的滑动中学习，无需收集或共享个人数据；无广告体验。 Global Brain Corporation 合伙人 Naoki Kamimeada 表示：“私人在线搜索市场正在增长，但 Xayn 领先于其他所有人，因为他们正在重新思考在线查找信息的方式。”\nKDDI 开放创新基金负责人 Kazuhiko Chuman 表示：“这个欧洲发现引擎独特地将高效的人工智能与隐私保护重点和流畅的用户体验相结合。在 KDDI，我们一直在寻找能够利用其专业知识和技术塑造未来的公司。这就是为什么这对我们来说是一场完美的比赛。”除了三位联合创始人 Leif-Nissen Lundbæk（首席执行官）、Michael Huth 教授（首席研究官）和 Felix Hahmann（首席运营官）之外，Daniel von Heyl 博士还将担任首席财务官 Frank Pepermans 将担任首席技术官，Michael Briggs 将加入担任首席增长官。", "note_en": "“A search engine?!” I hear you say? Well, yes, because despite the convenience of modern search engines’ ability to tailor their search results to the individual, this user-tracking comes at the expense of privacy. This mass surveillance might be what improves Google’s search engine and Facebook’s ad targeting, to name just two examples, but it’s not very good for our privacy.\n Internet users are admittedly able to switch to the US-based  DuckDuckGo, or perhaps France’s  Qwant, but what they gain in privacy, they often lose in user experience and the relevance of search results, through this lack of tailoring.\n What Berlin-based Xayn has come up with is personalized, but a privacy-safe web search on smartphones, which replaces the cloud-based AI employed by Google et al with the innate AI in-built into modern smartphones. The result is that no data about you is uploaded to Xayn’s servers.\n And this approach is not just for ‘privacy freaks’. Businesses that need search but don’t need Google’s dominant market position are increasingly attracted by this model.\n And the evidence comes today with the new that Xayn has now raised almost $12 million in Series A funding led by the Japanese investors Global Brain and KDDI (a Japanese telecommunications operator), with participation from previous backers, including the Earlybird VC in Berlin. Xayn’s total financing now comes to more than $23 million to date.\n It would appear that Xayn’s fusion of a search engine, a discovery feed, and a mobile browser has appealed to these Asian market players, particularly because Xayn can be built into OEM devices.\n  The result of the investment is that Xayn will now also focus on the Asian market, starting with Japan, as well as Europe.\n Leif-Nissen Lundbæk, Co-Founder and CEO of Xayn said: “We proved with Xayn that you can have it all: great results through personalization, privacy by design through advanced technology, and a convenient user experience through clean design.”\n He added: “In an industry in which selling data and delivering ads en masse are the norm, we choose to lead with privacy instead and put user satisfaction front and center.”\n The funding comes as legislation such as the EU’s GDPR or California’s CCPA have both raised public awareness about personal data online.\n Since its launch, Xayn says its app has been downloaded around 215,000 times worldwide, and a web version of its app is expected soon.\n Over a call, Lundbæk expanded on the KDDI aspect of the fund-raising: “The partnership with KDDI means we will give users access to Xayn for free, while the corporate – such as KDDI – is the actual customer but gives our search engine away for free.”\n The core features of Xayn include personalized search results; a personalized feed of the entire Internet which learns from their Tinder-like swipes, without collecting or sharing personal data; an ad-free experience.\n Naoki Kamimeada, Partner at Global Brain Corporation said: “The market for private online search is growing, but Xayn is head and shoulders above everyone else because of the way they’re re-thinking how finding information online should be.”\n Kazuhiko Chuman, Head of KDDI Open Innovation Fund, said: “This European discovery engine uniquely combines efficient AI with a privacy-protecting focus and a smooth user experience. At KDDI, we’re constantly on the lookout for companies that can shape the future with their expertise and technology. That’s why it was a perfect match for us.”\n In addition to the three co-founders Leif-Nissen Lundbæk (Chief Executive Officer), Professor Michael Huth (Chief Research Officer), and Felix Hahmann (Chief Operations Officer), Dr Daniel von Heyl will come on board as Chief Financial Officer, Frank Pepermans will take on the role of Chief Technology Officer, and Michael Briggs will join as Chief Growth Officer.", "posttime": "2021-08-09 23:24:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "日本,支持者,backers,xayn", "title": "面向隐私的搜索应用 Xayn 从日本支持者那里筹集了 1200 万美元用于设备", "title_en": "\n\t\t\t\tPrivacy-oriented search app Xayn raises $12M from Japanese backers to go into devices\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/09/privacy-oriented-search-app-xayn-raises-12m-from-japanese-backers-to-go-into-devices/", "via": "", "real_tags": ["日本", "支持者", "backers", "xayn"]}, {"category": "", "categoryclass": "", "imagename": "dcbc60b8740eae840e8fe43495dcd435.jpg", "infoid": 1072324, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这些未发布的节目包括“Eye Candy”，一个类似“Nailed It!”的竞赛系列，由 Josh Groban 主持，灵感来自日本的“Sokkuri Sweets”； “Squeaky Clean”，Leslie Jordan 主持的一系列清洁比赛；由詹妮弗·洛佩兹 (Jennifer Lopez) 制作的付费真人秀“感谢一百万”的第 2 季；以及由玛丽娜·泽诺维奇 (Marina Zenovich) 执导的十集纪录片“好莱坞发生了什么”，详细介绍了该行业最具争议的一些秘密。现在推出的其他节目包括：“&amp;Music”、“安迪·科恩日记”、“本尼迪克特人”、“厄尔巴岛与布洛克”、“凶恶的皇后区”、“地板”、“与利奥一起疯了”、“梅普尔沃思谋杀案”、“ Memory Hole、“Nice One！”、“Nikki Fre$h”、“Run this City”、“The Sauce”、“Sex Next Door”、“Singled Out”、“Skrrt with Offset”、“The Stranger”、 “生存”和“无线”。 Roku 在上周的第二季度财报中称赞了其原始产品线的表现，称新产品目录表现出“良好的表现”，但没有分享具体指标。该公司还表示将继续投资原创节目，但在其更大的 The Roku Channel 战略中淡化了原创节目的作用，其中原创节目是 Roku 向其客户提供的内容的一小部分。 Roku 首席执行官安东尼伍德指出，Roku 频道的目录主要包含来自 Roku 与各种合作伙伴达成的许可协议的内容。 “这是一种组合方法，原件是该组合的一部分，”他说。 “内容的主要来源仍然是许可，但原创也有好处。作为产品组合的一部分，它们是一个很好的补充，”伍德补充道。他还谨慎地解释说，添加原件不会对与 Roku 频道的广告支持视频点播 (AVOD) 商业模式相关的毛利率产生任何影响。相反，对原创的扩张，其中还包括 Roku 收购“This Old House”，更多的是关于用户获取及其广告业务。 “当然，原件的另一个优点是有光环效应。因此，它对 Upfronts 有帮助，对我们的广告业务有帮助，并且有助于将新客户带入 Roku 频道，”伍德说。\n该公司解释说，原创内容推动了用户之间的更多参与，进而推动了更多广告商——包括新广告商——这让 Roku 有更多资金投资更多内容并进一步扩大业务规模。 Roku 表示，超过 42% 的广告客户是该公司的首次前期广告客户，这与其在 Roku 频道上提供原创节目的能力有很大关系。然而，总体而言，Roku 的第二季度表现喜忧参半。该公司超出华尔街预期，每股收益为 0.52 美元，而预期为 0.13 美元，收入为 6.45 亿美元，而预期为 6.18 亿美元，但报告流媒体时间有所下降。 Roku 表示，与 2021 年第一季度相比，流媒体时间减少了 10 亿，但这归因于大流行，因为越来越多的人离开家从事餐饮、娱乐和旅行等活动。尽管 Roku 报告称全球流媒体时间同比增长了 19%，但在收益报告发布后股价下跌了 8% 以上。", "note_en": "These unreleased programs include “ Eye Candy,” a “Nailed It!”-like competition series hosted by Josh Groban and inspired by Japan’s “Sokkuri Sweets;” “ Squeaky Clean,” a cleaning competition series hosted by Leslie Jordan; Season 2 of pay-it-forward reality show “Thanks a Million,” executive produced by Jennifer Lopez; and a ten-part docuseries “ What Happens in Hollywood,” directed by Marina Zenovich, which details some of the industry’s most controversial secrets.\n  Other programs now arriving include: “&amp;Music,” “The Andy Cohen Diaries,” “Benedict Men,” “Elba vs Block,” “Fierce Queens,” “Floored,” “Gone Mental with Lior,” “Mapleworth Murders,” “Memory Hole,” “Nice One!,” “Nikki Fre$h,” “Run this City,” “The Sauce,” “Sex Next Door,” “Singled Out,” “Skrrt with Offset,” “The Stranger,” “Survive,” and “Wireless.”\n Roku had praised the performance of its original lineup during its second quarter earnings last week, saying the new catalog had demonstrated “good performance,” without sharing specific metrics.\n The company also said it would continue to invest in originals, but downplayed the size of their role in its larger strategy for The Roku Channel, where original programming is a smaller fraction of the content Roku offers to its customers.\n  Noted Roku CEO Anthony Wood, The Roku Channel’s catalog consists mainly of content that comes from the licensing deals Roku strikes with various partners.\n “It’s a portfolio approach and the originals are part of that portfolio,” he said. “The primary source of content is still licensing, but originals have benefits, as well. And as part of the portfolio, they’re a great addition,” Wood added. He also was careful to explain that the addition of originals wouldn’t have any impact on the gross margins related to The Roku Channel’s ad-supported video on demand (AVOD) business model. Instead, the expansion into originals, which has also included Roku’s purchase of “This Old House,” is more about user acquisition and its ad business.\n “The other advantage of the originals is, of course, there’s a halo effect. So it’s helpful with the Upfronts, it’s helpful with our advertising business, and it’s helpful for bringing in new customers into The Roku Channel,” Wood said.\n The company explained that originals drove more engagement among users, which then drove more advertisers — including new advertisers — and that gives Roku more money to invest in more content and further scale its business. Roku said that over 42% of its advertisers were first-time upfront advertisers with the company, which had a lot do with its ability to offer original programming on The Roku Channel.\n Overall, however, Roku saw a mixed Q2. The company  beat Wall St. expectations with earnings per share of $0.52 versus estimates of $0.13, and revenue of $645 million versus estimates of $618 million, but reported a decline in streaming hours. Roku said streaming hours decreased by 1 billion from the first quarter of 2021, but attributed this to the pandemic, as more people were leaving their homes for activities like dining, entertainment, and travel. Shares fell by over 8% after the earnings report, despite Roku reporting that streaming hours had grown year-over-year by 19% worldwide.", "posttime": "2021-08-09 23:24:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "programming,节目,acquired,roku", "title": "Roku 通过从 Quibi 收购的另外 23 个节目来扩展其原始节目阵容", "title_en": "\n\t\t\t\tRoku expands its original programming lineup with 23 more shows acquired from Quibi\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/09/roku-expands-its-original-programming-lineup-with-23-more-shows-acquired-from-quibi/", "via": "", "real_tags": ["节目", "acquired", "roku"]}, {"category": "", "categoryclass": "", "imagename": "f16a6d30205d151fc2ccab21f41b8168.jpeg", "infoid": 1072323, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您正准备腾出租来的房产，却被房东告知您将无法取回押金。这是我在 90 年代末第一次租房时发生的事情。我很震惊，但最重要的是，我对不公正感到愤怒，因为我知道房东所说的不是事实。这是她反对我和我室友的话。尽管如此，我们还是把她带到了小额索赔法庭，与其说是她试图保留的 800 美元，不如说是为了证明她错了。最后，我们赢了。但这工作量很大，而且花费了很多时间。要是有某种技术可以帮助我们证明我们的情况就好了。嗯，今天有。 RentCheck 是一家旨在通过自动化财产检查平台帮助解决这些情况下“他说，她说”挑战的初创公司，最近筹集了 260 万美元的种子资金。莉迪亚·温克勒 (Lydia Winkler) 和马可·纳尔逊 (Marco Nelson) 于 2019 年年中创办了这家公司，此前 Winkler 遇到了与我类似的情况，并最终在小额索赔法庭起诉了她的房东。当时她正在杜兰大学攻读 JD/MBA。 “我不追求它是不公平的，”她告诉 TechCrunch。 “我为我公寓的搬出情况拍摄了细致的照片。整个过程历时 18 个月。但并不是每个人都有时间或知识在法庭上打架。”然后她遇到了尼尔森，他买了几处房产，最终将其出租。他也有保证金问题，但恰恰相反。他不得不解决存款纠纷，并发现自己在搬出时记录了房产状况。\n“我遇到了莉迪亚，我们意识到我们对同一个问题充满热情，”纳尔逊回忆道。美国估计有 4800 万个出租单元，平均押金为 1000 美元。 “其中很大一部分是在总体上争取的，”温克勒说。 “而且很多人需要这笔钱来存入另一个单位的押金。”为了解决这个问题，RentCheck 为物业经理构建了一个网络应用程序，他们认为这也有利于租户。该公司的数字平台通过为物业经理提供一种方式来促进和进行远程引导式物业检查。出于显而易见的原因，考虑到该平台是自动化且非接触式的，该公司在 COVID-19 大流行开始时看到了需求的增加。平台上的房产数量增长了 1,000%——主要是有机增长。 “我们所做的是，使用引导式检查过程，提示用户并逐个房间引导他们，告诉他们要拍摄什么照片，以便地板、天花板、窗户和墙壁都被考虑在内，”温克勒说。一切都在应用程序内完成，因此用户无法上传以前在其相机胶卷上的照片，“以确保检查的完整性”，并且所有内容都带有时间戳。检查完成后，无论谁进行检查，都会在上面签字，表示他们准确、诚实地完成了检查。然后物业经理也可以在上面签字，这样双方就可以就搬出条件达成一致。该公司以 SaaS 业务运营，并根据物业管理公司在 RentCheck 平台上拥有的物业数量向物业管理公司收取订阅费。然后，他们可以“根据需要进行尽可能多的检查，”尼尔森说，“无论是居民在做这些检查，还是他们的内部团队在做这些检查，还是第三方供应商做的，或者三者的混合体。”\n这家初创公司自成立以来就吸引了一些大牌投资者，首先引起了 TPG Capital 创始人 James “Jim” Coulter 的注意，当时该公司赢得了新奥尔良创业周。库尔特随后成为该公司 100 万美元种子前融资的首批投资者之一。该公司的种子轮融资包括 Cox Enterprises 和天使投资人，如之前将 MoPub 卖给 Twitter 和 MAX 卖给 AppLovin 的天使投资人，后者负责其在多户住宅领域的运营； Ken Goldman，雅虎前首席财务官，目前负责 Hillspire、Eric 和 Wendy Schmidt 的家族办公室； BCG Digital Ventures 的 Mark Zaleski 和 John Kuolt，以及之前将 TapCommerce 卖给 Twitter 的 Attentive 的创始人 Brian Long。它还包括机构投资者，如 Irongrey、Context Ventures 和 Techstars。 “我们喜欢 RentCheck 的地方在于，它使用非常聪明的技术来自动化和解决该行业在资金和时间方面对物业经理和租户来说最大的问题，”BCG Digital Ventures 前董事总经理和早期 RentCheck 的 Kuolt 说。投资者。 “押金扣除问题需要一个基于技术的解决方案，几乎每个人都有过一段时间，觉得他们的押金被房东搞砸了。当您看到并使用 RentCheck 的解决方案时，您会想：“为什么我没有想到这一点？” ”", "note_en": "You’re getting ready to vacate a property you’ve rented, only to be told by the landlord that you won’t be getting your security deposit back.\n This happened to me the first time I ever rented a place in the late 90s. I was shocked, but more than anything, I was angry at the injustice because I knew that what the landlord claimed was not true. It was her word against mine and my roommate’s. Still, we took her to small claims court, not so much over the $800 she was trying to keep but more to prove her wrong. In the end, we won.\n But it was a lot of work, and a lot of time spent. If only there was some kind of technology available to have helped us make our case.\n Well, today there is.  RentCheck, a startup that is out to help solve the “he said, she said” challenge in these situations with an automated property inspection platform, has recently raised $2.6 million in seed money.\n Lydia Winkler and Marco Nelson started the company in mid-2019 after Winkler experienced a similar situation to mine and ended up suing her landlord in small claims court. She was working on getting her JD/MBA at Tulane University at the time.\n “It was an injustice for me not to pursue it,” she told TechCrunch. “I took meticulous photos of the move-out condition of my apartment. The process took 18 months. But not everyone has the time or knowledge to fight in court.”\n  She then met Nelson, who had bought several properties that he ended up renting out. He had issues with security deposits too, but the opposite ones. He had to settle disputes over deposits, and found himself documenting properties’ condition at the time of move-out.\n “I met Lydia and we realized we were passionate about the same problem,” Nelson recalled.\n   There are an estimated 48 million rental units in the U.S., with an average deposit of $1,000.\n “A good chunk of that is being fought after on aggregate,” Winkler said. “And so many need that money to put down a deposit on another unit.”\n To address the problem, RentCheck built a web app for property managers that they believe also benefits tenants. The company’s digital platform works by providing a way for property managers to facilitate and conduct remote, guided property inspections. For obvious reasons, the company saw increased demand upon the onset of the COVID-19 pandemic, considering that the platform was automated and contactless. It saw 1,000% — mostly organic — growth in terms of the number of properties on the platform.\n “What we do is, using a guided inspection process, prompt users and guide them room by room, telling them exactly what to take photos of so that floors, ceilings, windows and walls are all accounted for,” Winkler said.\n Everything is done within the app so that users can’t upload photos that were previously on their camera roll “to ensure the integrity of the inspection” and that  everything is time stamped. Once the inspection is complete, whoever does it signs off on it that they completed it accurately and honestly. Then the property manager can also sign off on it so both parties can agree on the move-out condition.\n The company operates as a SaaS business, and charges property management companies a subscription fee based on the number of properties that they have on the RentCheck platform. They can then conduct “as many inspections as they want,” Nelson says, “whether the residents are doing them, their internal teams are doing them, or a third-party vendor, or a hybrid of the three.”\n  The startup has attracted some large-name investors since its inception, first catching the attention of James “Jim” Coulter, the founder of TPG Capital, when the company won New Orleans Entrepreneurship Week. Coulter subsequently became one of the company’s first investors in its $1 million pre-seed round.\n The company’s seed round included participation from Cox Enterprises, for its operations in the multifamily housing space, and angels such as Jim Payne, who previously sold MoPub to Twitter, and MAX to AppLovin; Ken Goldman, the former CFO of Yahoo, and who currently runs Hillspire, Eric and Wendy Schmidt’s family office; Mark Zaleski and John Kuolt of BCG Digital Ventures, and Brian Long, the founder of Attentive, who previously sold TapCommerce to Twitter. It also included institutional investors such as Irongrey, Context Ventures and Techstars.\n “What we love about RentCheck is that it’s using very clever technology to automate and solve arguably the industry’s biggest problem in terms of money and time for both property managers and tenants,” said Kuolt, former managing director at BCG Digital Ventures and an early RentCheck investor. “The deposit deduction issue needs a technology-based solution, and almost everyone, at some time, has felt like they’ve been screwed over on their deposit by a landlord. When you see and use RentCheck’s solution, it makes you think: ‘Why didn’t I think of this?’ ”", "posttime": "2021-08-09 23:24:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "资金,funding", "title": "RentCheck 筹集了 260 万美元的种子资金，以帮助租房者收回押金", "title_en": "\n\t\t\t\tRentCheck raises $2.6M in seed funding to help renters get their security deposits back\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/09/rentcheck-raises-millions/", "via": "", "real_tags": ["资金", "funding"]}, {"category": "", "categoryclass": "", "imagename": "7607c65f6a14d144ade9d61bd9a35348.jpg", "infoid": 1072321, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "数据标签平台 Snorkel AI 今天宣布，它在由 Addition 和贝莱德管理的基金和账户共同牵头的 C 轮融资中筹集了 8500 万美元，Greylock、GV、Lightspeed Venture Partners、Nepenthe Capital 和 Walden 跟投。首席执行官亚历克斯·拉特纳 (Alex Ratner) 表示，该轮融资使 Snorkel 的总融资额达到 1.35 亿美元，估值达到 10 亿美元，将用于继续扩大其工程团队的规模。机器学习模型在很大程度上已被商业化用于企业应用程序。人工智能项目的成功取决于用于训练这些模型的标记数据，其中大部分是监督或半监督的。尽管在数据标记上花费了时间和资源，但组织最终往往会得到小而低质量的数据集。数据科学家经常被迫只关注模型，这种方法可能无法提供强大的性能——并且难以适应不断变化的数据。 Snorkel 由斯坦福人工智能实验室的一个团队和来自苹果、Facebook、谷歌、微软和英伟达的工程师于 2019 年创立，使公司能够构建具有“程序化”数据标签的人工智能应用程序，目标是最大限度地减少需要手工标记模型训练数据。该公司的平台允许用户使用软件开发工具包和无代码接口、训练模型和识别模型错误模式来注释和管理数据，以对其进行迭代改进。 Snorkel 最近推出了 Application Studio，它托管常见 AI 任务的模板，例如合同智能、新闻分析、客户交互路由、文本和文档分类、命名实体识别和信息提取。除了将应用程序分解为模块化部分的工作流之外，该服务还提供打包的特定于应用程序的预处理器、程序化标签模板和可以使用私有数据进行训练的高性能开源模型。 Snorkel 在数据标签领域与 Scale AI、Appen、Labelbox 和 Cloudfactory 以及亚马逊等老牌公司竞争。但拉特纳说，Snorkel 的客户和合作伙伴中有“一些世界上最大的品牌”，包括苹果、英特尔、斯坦福医学和美国政府机构。 “我们对 Snorkel 为我们的企业客户带来的价值感到非常兴奋，让他们能够采用程序化的、以数据为中心的人工智能方法，将以前在数据上被阻止的项目在几天内转化为生产价值。这笔新的 C 轮融资将使我们能够进一步加快产品开发的步伐，并将 Snorkel 带入更多领域和用例，”他在一份声明中说。总部位于加利福尼亚州帕洛阿尔托的 Snorkel 此前在由 Lightspeed 领投的 B 轮融资中筹集了 3500 万美元。\nVentureBeat 的使命是成为技术决策者的数字城镇广场，以获取有关变革性技术和交易的知识。我们的网站提供有关数据技术和策略的基本信息，以指导您领导您的组织。我们邀请您成为我们社区的一员，以访问：封闭的思想领袖内容和我们珍贵活动的折扣，例如 Transform 2021：了解更多 成为会员", "note_en": "Data labeling platform  Snorkel AI today  announced it has raised $85 million in a series C round co-led by Addition and funds and accounts managed by BlackRock, with participation from Greylock, GV, Lightspeed Venture Partners, Nepenthe Capital, and Walden. The round, which brings Snorkel’s total raised to $135 million and its valuation to $1 billion, will be used to continue scaling its engineering team, according to CEO Alex Ratner.\n Machine learning models have largely been commoditized for enterprise applications. The success of an a AI project hinges on the labeled data used to train these models, most of which are  supervised or semi-supervised. In spite of spending time and resources on data labeling, organizations often end up with small and low-quality datasets. Data scientists are not uncommonly forced to focus on the model alone, an approach that can fail to deliver strong performance — and struggle to adapt to changing data.\n   Founded in 2019 by a team spun out of the Stanford AI Lab and engineers hailing from Apple, Facebook, Google, Microsoft, and Nvidia, Snorkel enables companies to build AI-powered apps with “programmatic” data labeling, with the goal of minimizing the need to hand-label model training data. The company’s platform lets users annotate and manage data using software development kits and no-code interfaces, training models and identifying model error modes to iteratively improve on them.\n  Snorkel recently launched Application Studio, which hosts templates for common AI tasks, like contract intelligence, news analytics, customer interaction routing, text and document classification, named entity recognition, and information extraction. The service also provides packaged app-specific preprocessors, programmatic labeling templates, and high-performance open source models that can be trained with private data, in addition to workflows that decompose apps into modular pieces.\n Snorkel competes with Scale AI, Appen, Labelbox, and Cloudfactory in the data labeling space, as well as incumbents like Amazon. But among Snorkel’s customers and partners are “some of the world’s biggest brands,” including Apple, Intel, Stanford Medicine, and U.S. government agencies, Ratner says.\n “We’re incredibly excited by the value Snorkel has driven for our enterprise customers by enabling them to adopt a programmatic, data-centric approach to AI, taking projects previously blocked on the data to production value in days. This new series C funding will enable us to accelerate the pace of our product development even further and to bring Snorkel to even more domains and use cases,” he said in a statement.\n Palo Alto, California-based Snorkel previously  raised $35 million in a series B round led by Lightspeed.\n VentureBeat&#39;s mission is to be a digital town square for technical decision-makers to gain knowledge about transformative technology and transact.Our site delivers essential information on data technologies and strategies to guide you as you lead your organizations. We invite you to become a member of our community, to access: gated thought-leader content and discounted access to our prized events, such as   Transform 2021: Learn More\n Become a member", "posttime": "2021-08-09 23:08:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "标签,labeling,数据", "title": "数据标签服务 Snorkel AI 以 1B 美元的估值筹集了 8500 万美元的 C 轮融资，由 Addition 和 BlackRock 领投，使其总融资额达到 1.35 亿美元", "title_en": "Data labeling service Snorkel AI raises $85M Series C at a $1B valuation led by Addition and BlackRock, bringing its total raised to $135M", "transed": 1, "url": "https://venturebeat.com/2021/08/09/data-labeling-platform-snorkel-ai-nabs-85m/", "via": "", "real_tags": ["标签", "labeling", "数据"]}, {"category": "", "categoryclass": "", "imagename": "944471e55080967c42772c2e81498ebe.jpeg", "infoid": 1072320, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有没有想过亚马逊上便宜的杂牌产品如何能获得数百个甚至数千个近乎完美的星级评分，而只有少数负面评论？这是一种方法：一些卖家联系不满意的买家修改或删除他们的负面评论，以换取退款或礼品卡。随着心怀不满的购物者减少，整体平均星级会上升。通过亚马逊运送产品的卖家不应该接触亚马逊官方渠道以外的客户——事实上，这违反了他们在零售平台上同意的条款。今年 3 月，纽约人凯瑟琳·斯科特 (Katherine Scott) 根据近 1,000 条亚马逊对该产品的热烈评论挑选了一款用于烹饪的喷油瓶，该产品的平均评分为 4.5 星。她说，当 10 美元的喷雾器到达时，她发现该物品并没有像宣传的那样工作：它产生的不是雾气，而是一股油流。 “这就像一把 Super Soaker 枪而不是喷漆罐，这违背了产品的目的，”她说。她留下了负面评论。一周后，Scott 女士收到一封自称来自喷油机品牌 Auxtun 客户服务团队的电子邮件——我已查看过该信件。 “我们愿意全额退款，”该代表写道。 “我们希望你能在方便的时候重新考虑删除评论，好吗？”该消息的结论是，“当我们没有收到回复时，我们会假设您没有看到它，并将继续发送电子邮件。”\n卖家不应该有她的电子邮件地址。自己履行订单的卖家会收到客户姓名和邮寄地址。但对于亚马逊自己履行的订单，客户数据应该不受卖家和品牌的影响。卖家可以通过亚马逊内置的消息平台与买家沟通，该平台隐藏了客户的电子邮件地址。亚马逊的服务条款还禁止卖家要求客户删除负面评论或发布正面评论。 “我们不会与第三方卖家共享客户电子邮件地址，”亚马逊发言人告诉我。同时，与卖家不同的品牌可能会通过亚马逊的消息服务联系不满意的客户，但也不允许要求客户删除负面评论。 Scott 女士要求退款，但不想删除她的评论。第二天，另一位代表联系并拒绝退款。 “差评对我们来说是致命的打击，”电子邮件中写道。 “你能帮我删除评论吗？如果可以的话，我想退还20美元给你，以表达我的谢意。” （这是斯科特女士支付的两倍。）几个小时后，她收到了来自同一个电子邮件地址的另一份请求。 “这太令人毛骨悚然了。他们一遍又一遍地直接给我发电子邮件，“斯科特女士说。斯科特女士就此事两次联系亚马逊。我查看了亚马逊的聊天记录和电子邮件。\n您或您认识的人是否因亚马逊上的负面评论而进退两难？与我们分享您的故事。在 4 月 16 日的客户服务聊天中，亚马逊代理告诉 Scott 女士，“我正在转发给团队，他们将在 48 小时内回复您。他们将确保卖家不再与亚马逊相关联。”她说没有人回复她。当她在 7 月收到更多不需要的电子邮件时，斯科特女士拨打了亚马逊的支持热线。一位代表通过电子邮件告诉她，此案将被调查，但亚马逊无法公布调查结果。在 Scott 女士投诉后，该列表及其正面评价仍然有效。但在我要求亚马逊评论这个专栏的情况后，listing 消失了，品牌 Auxtun 和卖家 HoHousstore 都不再出现在亚马逊上。亚马逊发言人说：“我们的内部流程发现了你强调的问题，并采取了适当的执法行动。” Auxtun 和 HoHousstore 均未回应置评请求。这不是一个孤立的事件。在这个厨具利基市场，至少有十多位其他客户在评论中表示，他们被迫修改最初的低评级。目前亚马逊“喷油”类别中的许多热门搜索结果都具有相同的设计，以不同的品牌和卖家出售。一款产品的评分超过 4,600 次，评论颇具说服力。 “产品不起作用，公司会打扰你，直到你改变评论，”一位客户写道。 “卖家提供 20 到 30 美元来删除负面评论，”另一位说。两者都给喷雾一颗星。卖家和品牌都没有通过亚马逊的内部消息系统回应置评请求。卖家和品牌有时会想方设法在远离亚马逊关注的情况下接触客户。斯科特女士认为，在油喷雾包装中插入烹饪温度计的“免费礼物”——这促使她输入她的电子邮件地址和订单 ID——是该品牌能够将负面评论与她的地址联系起来的方式。亚马逊发言人表示，该插页违反了公司政策。\n卖家可能能够在亚马逊提供的销售记录中查找她的姓名和邮寄地址，并使用该信息找到她的电子邮件地址。今年 4 月，斯科特女士购买了喷油瓶后，亚马逊停止在大多数亚马逊履行的购买记录中包含姓名和邮寄地址。卖家现在通常只能看到买家的城市、州和邮政编码。俄克拉荷马州塔尔萨市的本·亨丁（Ben Hendin）曾在我关于虚假亚马逊评论经济的报告中出现过，他说，在发布了对 17 美元手指夹板不满意的负面评论后，他四次收到卖家的来信。卖家增加了愿意为他删除评论支付的金额，最终达到了 40 美元。当亨丁先生询问这位卖家是如何得到他的联系方式时，该代表回答说：“老板是通过社交软件搜索姓名找到的。”联系亨丁先生的人没有回应我的置评请求。 James Thomson 曾是亚马逊员工，现在是品牌咨询公司 Buy Box Experts 的合伙人，他表示，一些第三方工具会获取客户的送货信息，并将其与已知的电子邮件地址进行匹配。他强调，这种做法违反了亚马逊的规定，他不会建议卖家或品牌使用这些工具。一家名为 Matic Chain 的公司为亚马逊卖家提供电子邮件提取服务。一位公司代表通过电子邮件告诉我，它使用谷歌和社交媒体将买家姓名与联系信息相匹配。当我问公司是否知道这违反了亚马逊的政策时，该代表没有回应。另一家名为 ZonBoost 的公司表示，它提供评论中的电子邮件地址，每件最多 60 美元。 ZonBoost 没有回应置评请求。 “亚马逊为卖家提供了大量帮助内容、主动指导、警告和其他帮助，以确保他们始终遵守我们明确规定的政策。我们为评论者和销售合作伙伴制定了明确的政策，禁止滥用我们的社区功能，我们将暂停、禁止和对违反这些政策的人采取法律行动，”亚马逊发言人说。 “试图滥用我们系统的不良行为者只占我们网站活动的一小部分，我们使用复杂的工具来打击他们，我们让他们越来越难以隐藏。”\n该发言人还表示，“2020 年，我们在客户看到之前阻止了 2 亿多条疑似虚假评论，99% 以上的评论执法是由我们的主动检测驱动的。” 《华尔街日报》报道了亚马逊员工被指控收受贿赂以换取有利于第三方卖家的信息的案例。亚马逊当时表示，它会对任何违反公司政策的员工进行纪律处分，并安装了系统来限制和审核员工可以访问的内容。无论卖家或品牌使用何种方法获取客户信息，结果都是一样的。很难相信评论的真实性，出于对卖家报复的恐惧，您可能不太愿意留下自己对产品的负面评论。所以，你可以做什么？不要在亚马逊评论中使用您的名字。我鼓励人们留下尽可能多的亚马逊评论。但是，如果您这样做了，请不要将您的真实姓名或姓名缩写写在文章中，以防止卖家或品牌在平台外联系您。转到您的帐户，然后在“订购和购物偏好”下，单击您的亚马逊个人资料。在那里，您可以更改您的公共名称。单击“编辑您的公开个人资料”，然后单击“编辑隐私设置”以管理个人资料上显示的内容。您还可以选择隐藏所有活动。保存您的所有通信。如果您收到任何可疑的和可能滥用的电子邮件或消息，请下载它们或制作它们的屏幕截图，以便将它们转发给亚马逊客户服务。向亚马逊报告滥用行为。亚马逊发言人表示，客户可以通过发送电子邮件至 community-help@amazon.com 举报滥用行为。提供尽可能多的细节和尽可能多的屏幕截图。在评论旁边，还有一个“报告滥用”链接。\n阻止他们的电子邮件地址。通过回复卖家或品牌，您可以确认您的电子邮件地址属于合法客户，并且它可能会继续通过不同的帐户向您发送消息。相反，在 Gmail 中，单击电子邮件右上角的三个点以阻止发件人。在 Outlook 中，选择一封邮件，然后在菜单栏中，转到“邮件”&gt;“垃圾邮件”&gt;“阻止发件人”。出现在 2021 年 8 月 9 日的印刷版中，标题为“亚马逊卖家对买家施加压力”。", "note_en": "Ever wonder how cheap, no-name products on  Amazon   can amass hundreds, sometimes thousands, of nearly perfect star ratings, with just a handful of negative reviews?\n  Here’s one way: Some sellers are reaching out to unhappy buyers to revise or delete their negative reviews, in exchange for refunds or gift cards. With fewer disgruntled shoppers, the overall average star rating rises.\n  Sellers who ship products via Amazon aren’t supposed to reach out to customers outside of Amazon’s official channel—in fact, it’s a violation of the terms they agree to on the retail platform.\n  In March, New Yorker Katherine Scott picked out an oil spray bottle for cooking, based on nearly 1,000 glowing Amazon reviews of the product, which had a 4.5-star rating average. When the $10 sprayer arrived, she found the item didn’t work as advertised: Instead of a mist, it produced a stream of oil, she said. “It was like a Super Soaker gun instead of a spray-paint can, which defeats the purpose of the product,” she said. She left a negative review.\n      A week later, Ms. Scott received an email from someone claiming to be from the customer-service team of the oil sprayer’s brand, Auxtun—correspondence which I have reviewed.\n  “We are willing to refund in full,” the representative wrote. “We hope you can reconsider deleting comments at your convenience okay?”\n  The message concluded, “When we do not receive a response, we will assume that you did not see it, and will continue to send emails.”\n  The seller shouldn’t have had her email address. Sellers who fulfill orders themselves do receive customer names and mailing addresses. But for orders that Amazon itself fulfills, customer data is supposed to be shielded from sellers and brands.\n  Sellers are permitted to communicate with buyers through Amazon’s built-in messaging platform, which hides the customer’s email address. Amazon’s terms of service also prohibit sellers from requesting that a customer remove a negative review or post a positive one.\n  “We do not share customer email addresses with third-party sellers,” an Amazon spokesman told me.\n  Meanwhile, brands, which can be distinct from sellers, may reach out to unsatisfied customers through Amazon’s messaging service, but they also aren’t allowed to ask customers to remove negative reviews.\n  Ms. Scott asked for a refund but didn’t want to delete her review. Another representative reached out the next day and declined to issue her refund. “A bad review is a fatal blow to us,” read the email. “Could you help me delete the review? If you can, I want to refund $20 to you to express my gratitude.” (This was twice what Ms. Scott paid.) A few hours later, she received another plea from the same email address.\n  “It was so creepy. They emailed me directly about it over and over,” Ms. Scott said.\n  Ms. Scott contacted Amazon twice about the matter. I reviewed Amazon’s chat transcripts and emails.\n  Have you, or someone you know, experienced a dilemma over negative reviews on Amazon? Share your stories with us.\n  In an April 16 customer-service chat, an Amazon agent told Ms. Scott, “I am forwarding to the team who will get back to you on this within 48 hours. They will make sure the seller will be no longer associated with Amazon.” She said no one got back to her.\n  When she received more unwanted emails in July, Ms. Scott called Amazon’s support hotline. A rep told her via email that the case would be investigated, but Amazon wouldn’t be able to release the outcome of the investigation.\n  The listing—and its positive reviews—remained live after Ms. Scott’s complaints. But after I asked Amazon to comment on the situation for this column, the listing disappeared, and both the brand, Auxtun, and the seller, HoHousstore, no longer appear to be on Amazon. “The issue you’re highlighting was detected by our internal processes, and the appropriate enforcement actions were taken,” the Amazon spokesman said. Neither Auxtun nor HoHousstore responded to requests for comment.\n  It wasn’t an isolated incident. In this kitchenware niche, at least a dozen other customers said in reviews that they were pressured to revise their initial low ratings.\n  Many top search results currently in Amazon’s “oil spray” category feature the same design, sold under different brands and sellers. One product, with more than 4,600 ratings, has telling reviews. “Product doesn’t work and company will bother you till you change review,” a customer wrote. “Seller offers $20-$30 to delete negative reviews,” said another. Both gave the spray one star. Neither the seller nor the brand responded to requests for comment via Amazon’s internal messaging system.\n  Sellers and brands sometimes find ways to reach customers away from Amazon’s watchful gaze. Ms. Scott thinks that a “free gift” insert for a cooking thermometer in the oil spray’s packaging—which prompted her to enter her email address and order ID—was how the brand was able to link the negative review with her address. The Amazon spokesman said the insert is a violation of company policy.\n  The seller might have been able to look up her name and mailing address in sales records provided by Amazon, and use that information to find her email address. In April, after Ms. Scott purchased the oil spray bottle,  Amazon stopped including names and mailing addresses in records of most Amazon-fulfilled purchases. Sellers now typically see only a buyer’s city, state and ZIP Code.\n  Ben Hendin of Tulsa, Okla.—who was featured in my report on the  fake Amazon-review economy—said he heard from a seller four times after posting a negative review of an unsatisfactory $17 finger splint. The seller increased the amount of money it was willing to pay for him to delete the review, eventually reaching $40.\n  When Mr. Hendin asked how this seller got his contact info, the representative replied: “Boss found it through social software search for names.” The people who reached out to Mr. Hendin didn’t respond to my requests for comment.\n  James Thomson, a former Amazon employee who is now a partner at brand consultancy Buy Box Experts, said some third-party tools take customers’ shipping information and match it to known email addresses. He emphasized that the practice violates Amazon’s rules and that he wouldn’t recommend sellers or brands use these tools.\n  One company, called Matic Chain, offers an email extraction service for Amazon sellers. A company representative told me over email that it uses  Google   and social media to match buyers’ names with contact information. When I asked if the company knew this was a violation of Amazon policy, the rep didn’t respond.\n  Another business, called ZonBoost, says it provides email addresses from reviews for up to $60 a piece. ZonBoost didn’t respond to requests for comment.\n  “Amazon provides a great deal of help content, proactive coaching, warnings and other assistance to sellers to ensure they remain compliant with our clearly stated policies. We have clear policies for both reviewers and selling partners that prohibit abuse of our community features, and we suspend, ban and take legal action against those who violate these policies,” the Amazon spokesman said. “Bad actors that attempt to abuse our system make up a tiny fraction of activity on our site and we use sophisticated tools to combat them and we make it increasingly difficult for them to hide.”\n  The spokesman also said, “In 2020, we stopped more than 200 million suspected fake reviews before they were ever seen by a customer, and more than 99% of reviews enforcement was driven by our proactive detection.”\n  The Wall Street Journal  has reported cases where  Amazon employees were accused of accepting bribes in exchange for information that benefited third-party sellers. Amazon said at the time that it disciplines any employee in violation of the company’s policies, and has installed systems to restrict and audit what employees can access.\n  No matter the method a seller or brand might use to obtain customers’ information, the result is the same. It’s hard to trust the authenticity of reviews, and you might be less inclined to leave your own negative review of a product, out of fear of seller retaliation. So, what can you do?\n  Don’t use your name in Amazon reviews. I encourage people to leave as many Amazon reviews as possible. But if you do, keep your real name or initials out of the write-up to prevent the seller or brand from contacting you off-platform.\n  Go to  Your Account and under “Ordering and shopping preferences,” click Your Amazon Profile. There, you can change your public name. Click “Edit your public profile” then “Edit privacy settings” to manage what appears on the profile. You can also choose to hide all activity.\n  Save all of your communications. If you receive any questionable and potentially abusive emails or messages, download or make screenshots of them, so you can forward them to Amazon customer service.\n  Report abuse to Amazon. An Amazon spokesman said customers can report abuse by emailing community-help@amazon.com. Provide as much detail and as many screenshots as possible. Next to reviews, there is also a “Report Abuse” link.\n  Block their email address. By replying to the seller or brand, you could be confirming your email address belongs to a legitimate customer, and it might continue to send you messages through different accounts. Instead, in Gmail, click the three dots in the top right corner of the email message to block the sender. In Outlook, select a message, then in the menu bar, go to Message &gt; Junk Mail &gt; Block Sender.\n  Appeared in the August 9, 2021, print edition as &#39;Amazon Sellers Put Pressure on Buyers.&#39;", "posttime": "2021-08-09 23:07:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,留下,卖家", "title": "当亚马逊客户留下差评时，一些卖家追着他们修改或删除评论，以换取退款或礼品卡，违反亚马逊政策", "title_en": "When Amazon customers leave negative reviews, some sellers hound them to revise or delete them, in exchange for refunds or gift cards, violating Amazon policies", "transed": 1, "url": "https://www.wsj.com/articles/when-amazon-customers-leave-negative-reviews-some-sellers-hunt-them-down-11628420400?mod=djemalertNEWS", "via": "", "real_tags": ["amazon", "亚马逊", "留下", "卖家"]}, {"category": "", "categoryclass": "", "imagename": "3c86ecb3031c753efa673b7e024bd439.jpeg", "infoid": 1072319, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "State of Repair 是 Motherboard 对 DIY 文化、设备维修、所有权以及努力锁定对您拥有的东西的访问权的探索。麦当劳的 McFlurries 很好吃，但制造它们的机器总是出故障。这个问题非常频繁，以至于有人构建了一个机器人来跟踪美国所有 14,000 家麦当劳门店的哪些机器坏了。最近这些问题不那么频繁了，部分原因是一家名为 Kytch 的独立公司制造了一种设备，可以帮助麦当劳的特许经营商修理冰淇淋机并保持 McFlurries 的流动。在 Kytch 之前，泰勒垄断了冰淇淋机的维修，并且——根据 Kytch 提起的诉讼——它试图通过告诉麦当劳的加盟商使用 Kytch 设备可能导致“严重的人身伤害”来维持这种垄断。然而，在 7 月 30 日，Kytch 赢得了一场与 Taylor 的重要法律斗争，在 Kytch 声称 Taylor 购买了 Kytch 解决方案设备以试图了解其秘密后，加利福尼亚州的一名法官对泰勒发布了临时限制令。根据临时限制令的申请，Kytch 认为泰勒让麦当劳的特许经营商和为麦当劳测试新产品的国家供应领导委员会成员为该公司购买了一台 Kytch 设备，然后可以将其开采为“商业机密信息。”根据法庭文件，泰勒的首席运营官承认，它试图获得 Kytch 设备，“以评估其对我们的软服务机器的潜在技术相关影响——例如 Kytch 设备的无线电频率是否会干扰我们的软件信号，或者 Kytch 设备是否会耗尽我们软件的电源和/或导致它出现故障”，但否认泰勒挖掘它是为了商业机密，甚至“需要此类信息”。正如《连线》杂志首次报道的那样，故事的中心是一场旷日持久的冷战，这解释了为什么您经常无法在想要时获得 McFlurry。泰勒的冰淇淋机绝对是修理的噩梦。当它们发生故障时，只有经过认证的 Taylor 维修技术人员才能修理机器，这可能导致 McFlurrys 无法在麦当劳流动数周。一些过度劳累的快餐店员工学会了各种技巧来绕过泰勒机器上的卫生和安全措施，这使得冰淇淋流动但也可能让人生病。进入 Kytch，这是一家制作诊断工具的公司，该工具可以让麦当劳的特许经营商更好地控制他们的 McFlurry 机器。它收集数据并允许他们进行简单的维修，例如更换损坏的设备或清洁机器，而无需请泰勒认证的技术人员。\n根据 Kytch 提起的诉讼，泰勒从麦当劳特许经营店获得一台 Kytch 设备后，告诉麦当劳及其特许经营商，Kytch 机器很危险，并停止使用它们。与此同时，根据法庭文件，泰勒开始开发自己版本的 Kytch 系统。 “这些人在吓跑我们所有的客户和投资者方面做得非常有效，所以我们希望公众以正义、修复权和人道的名义支持我们的案件，”联合创始人杰里米·奥沙利文 (Jeremy O&#39;Sullivan) 说。 Kytch，告诉主板。 “我们仍然有一些顽固的客户坚持使用我们。尽管与我们在麦当劳和泰勒之前所拥有的产品相比，很少有人称我们的产品为危险产品。”冰淇淋机制造商 Taylor 现在必须在法院命令后的 24 小时内交出所有不义之财的 Kytch 解决方案设备。法庭文件称：“被告不得以任何方式使用、复制、披露或以其他方式提供信息，包括他们任何人获得的公式、图案、汇编、程序、设备、方法、技术或过程。” Kytch 联合创始人梅丽莎·尼尔森 (Melissa Nelson) 告诉 Motherboard：“我们对真相将占上风感到乐观。” “令人作呕的是，他们如此努力地窃取我们的商业机密，破坏我们的业务，并阻碍厨房现代化。 Kytch 只是更广泛的维修权运动的一小部分。但我们的案例清楚地表明，现在是时候结束那些从‘认证’技术人员那里产生数亿美元不必要维修费用的阴暗商业行为了。”", "note_en": "State of Repair is Motherboard&#39;s exploration of DIY culture, device repair, ownership, and the forces fighting to lock down access to the things you own.\n  McDonald’s McFlurries are delicious, but the machine that makes them   breaks down all the time. The problem is so frequent that someone   built a bot to keep track of which machines are broken across all 14,000 McDonald&#39;s locations in the United States. The problems are less frequent recently, in part because an independent company called Kytch has made a device that helps McDonald’s franchise owners repair the ice cream machines and keep the McFlurries flowing.\n    Taylor had a monopoly on repairs of the ice cream machines before Kytch, and—according to a lawsuit filed by Kytch—it has tried to maintain that monopoly by telling McDonald&#39;s franchisees that using Kytch devices could cause &#34;  serious human injury.&#34; On July 30, however, Kytch won an important legal fight against Taylor, when a California judge issued a temporary restraining order against Taylor after Kytch claimed Taylor acquired a Kytch Solution Devices in an attempt to learn its secrets.\n  According to the application for the temporary restraining order, Kytch believes that Taylor got a McDonald&#39;s franchisee and member of the National Supply Leadership Council, which tests new products for McDonald&#39;s, to acquire a Kytch device for the company, which could then mine it for &#34;trade secret information.&#34;\n  According to the court document, Taylor&#39;s COO admits that it sought to obtain a Kytch device &#34;in order to evaluate and assess its potential technology-related impacts upon our Soft Serve Machine—such as whether the radio frequency of the Kytch device would interfere with our software signal, or whether the Kytch device would drain the power source of our software  and/or cause it malfunction,&#34; but denied that Taylor mined it for trade secrets or even &#34;need such information.&#34;\n    As first reported by WIRED, at the center of the story is a long running   cold war that explains why you often can&#39;t get a McFlurry when you want to. Taylor’s ice cream machines are an absolute   nightmare to repair. When they break down, only a certified Taylor repair technician can fix the machine, which can lead to weeks where the McFlurrys don’t flow at McDonald’s.\n  Some overworked fast food employees learned various tricks to   bypass sanitary and security measures on the Taylor machines, which made the ice cream flow but could also make people sick. Enter Kytch, a company making a diagnostic tool that gives McDonald’s franchise owners better control over their McFlurry machines. It collects data and allows them to make simple repairs, like replacing broken equipment or cleaning the machine, without having to call in a Taylor certified technician.\n  According to a lawsuit filed by Kytch, after obtaining one of the Kytch devices from a McDonald&#39;s franchise, Taylor told McDonald’s and its franchisees that the Kytch machines were dangerous and to stop using them. At the same time, Taylor began working on its   own version of the Kytch system, according to court documents.\n  “These guys did a really effective job at frightening off all of our customers and investors so we&#39;re hoping the public will support our case in the name of justice, right to repair and humanity,” Jeremy O’Sullivan, co-founder of Kytch, told Motherboard. “We still have some diehard customers sticking with us. Though few in comparison to what we once had before McDonald’s and taylor called our product dangerous.”\n  The ice cream machine maker, Taylor, now has to turn over all its ill-gotten Kytch Solution Devices  within 24 hours of the court order. “Defendants must not use, copy, disclose, or otherwise make available in any way information, including formula, pattern, compilation, program, device, method, technique, or process obtained by any of them,” the court document said.\n  “We are optimistic that the truth will prevail,” Kytch co-founder Melissa Nelson told Motherboard.  “It’s disgusting that such lengths were taken to steal our trade secrets, destroy our business, and to stand in the way of modernizing kitchens. Kytch is just a small piece of the broader right-to-repair movement. But our case makes clear that it’s past time to end shady business practices that create hundreds of millions of dollars of unnecessary repair fees from ‘certified’ technicians.”", "posttime": "2021-08-09 23:07:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机器,machine,kytch", "title": "为什么 McFlurry 机器公司刚刚受到限制令打击", "title_en": "Why the McFlurry Machine Company Just Got Hit with a Restraining Order", "transed": 1, "url": "https://www.vice.com/en/article/93ymbp/why-the-mcflurry-machine-company-just-got-hit-with-a-restraining-order", "via": "", "real_tags": ["机器", "machine", "kytch"]}, {"category": "", "categoryclass": "", "imagename": "20b31ef19931ec2ae0b463642edcf54b.png", "infoid": 1072318, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "乍一看，这似乎是一件非常小众的事情。毕竟，我们多久需要旋转或倾斜一些东西？然而，我对转换了解得越多，我就越发现自己在利用它。在我博客的代码库中，我使用了 transform 属性超过 350 次！在这篇博文中，我们将深入研究 transform 属性。我会向你展示一些你可以用它做的很酷和意想不到的事情！通过使用诸如 translate 和 skew 之类的变换函数，transform 属性可以做很多不同的事情。我们可以使用 translate 沿任一轴移动项目：x 左右移动，y 上下移动。正值向下和向右移动。负值向上和向左移动。至关重要的是，项目的流入位置不会改变。就我们的布局算法而言，从 Flow 到 Flexbox 再到 Grid，这个属性没有任何作用。例如：在这个可视化中，我们有 3 个使用 Flexbox 对齐的孩子。当我们对中间的孩子应用变换时，Flexbox 算法不会注意到，并将其他孩子保持在同一个位置：这类似于顶部/左侧/右侧/底部在定位布局中的工作方式，具有相对定位的元素.\n当我们想沿单个轴移动一个元素时，我们可以使用 translateX 和 translateY：不过，有一件事使 translate 变得非常强大。 CSS 语言中完全独一无二的东西。当我们在 translate 中使用百分比值时，该百分比指的是元素本身的大小，而不是父容器内的可用空间。设置 transform: translateY(-100%) 将框向上移动精确的高度，无论高度是多少，到像素。当我们希望一个元素正好位于另一个元素之外时，这非常方便： &lt;style&gt; .parent { position: relative; } .child { 宽度：50px;高度：50px； /* 把孩子放在右上角... */ position: absolute;顶部：0；右：0； /* ...然后把它移到外面：*/ transform: translateY(-100%); }&lt;/style&gt;&lt;div class=&quot;parent&quot;&gt; &lt;div class=&quot;child&quot;&gt;&lt;/div&gt;&lt;/div&gt; 这个技巧的一个常见用例是在对话框外添加一个“关闭”按钮：\n&lt;style&gt; .dialog-content { 位置：相对； } .close-btn { 位置：绝对；顶部：0；右：0；变换：translateY(-100%); }&lt;/style&gt;&lt;div class=&quot;dialog-wrapper&quot;&gt; &lt;div class=&quot;dialog-content&quot;&gt; &lt;button class=&quot;close-btn&quot;&gt; &lt;svg xmlns=&quot;http://www.w3.org/ 2000/svg&quot; width=&quot;24&quot; height=&quot;24&quot; viewBox=&quot;0 0 24 24&quot; fill=&quot;none&quot;stroke=&quot;currentColor&quot;stroke-width=&quot;2&quot;stroke-linecap=&quot;round&quot;stroke-linejoin= &quot;round&quot; class=&quot;feather Feather-x&quot;&gt;&lt;line x1=&quot;18&quot; y1=&quot;6&quot; x2=&quot;6&quot; y2=&quot;18&quot;&gt;&lt;/line&gt;&lt;line x1=&quot;6&quot; y1=&quot;6 &quot; x2=&quot;18&quot; y2=&quot;18&quot;&gt;&lt;/line&gt;&lt;/svg&gt; &lt;span class=&quot;visually-hidden&quot;&gt; 关闭对话框&lt;/span&gt; &lt;/button&gt; &lt;/div&gt;&lt;/div&gt; 这允许我们添加一个“缓冲区”，这样我们就可以通过它自己的大小加上一些额外的像素来翻译一些东西。 Scale 使用表示倍数的无单位值，类似于 line-height。 scale(2) 意味着元素应该是通常情况下的 2 倍大。乍一看，这似乎等同于设置宽度和高度，但有一个很大的不同。文本随元素上下缩放。我们不只是改变盒子的大小和形状，我们正在改变整个元素及其所有后代。这揭示了关于变换的一个重要事实：元素被展平为纹理。所有这些变换本质上都将我们的元素视为平面图像，像在 Photoshop 中一样对其进行扭曲和扭曲。想想当我们改变宽度之类的东西时需要做多少工作。所有的布局算法都需要重新运行，找出这个元素及其所有兄弟元素的确切位置。如果元素内部有文本，换行算法需要确定这个新宽度是否影响换行符。然后，绘制算法运行，找出每个像素需要的颜色，并填充它。\n在页面加载时执行一次就可以了，但是当我们为某些内容设置动画时，我们需要每秒多次执行所有这些计算。通过转换，我们可以跳过一堆步骤。这意味着计算运行得更快，从而导致更平滑的运动。缩放会拉伸/挤压元素的内容似乎很糟糕，但我们实际上可以利用这种效果来发挥我们的优势。例如，看看这个老式的电视电源动画：而且，如果我们真的不希望我们的文本被挤压，我们可以对孩子应用逆变换。这是一种先进的技术，远远超出了本博客文章的范围，但要知道可以使用缩放来增加元素的大小而不扭曲其子元素。像 Framer Motion 这样的库利用这一事实来构建高性能的动画而无需拉伸或挤压。我们通常使用 deg 单位表示旋转，是度数的缩写。但是我们可以使用另一个方便的单位，一个可能更容易推理的单位：转弯单位表示元素应该转多少圈。 1 转等于 360 度。它晦涩难懂，但得到了很好的支持；转向装置一直回到 IE 9！\nSkew 可用于创建对角线装饰元素 (à la Stripe)。在 calc 和一些三角函数的帮助下，它也可以用于元素而不会扭曲文本！在 Nils Binder 的精彩博客文章“像 2020 年一样创建对角线布局”中深入探讨了这种技术。顺序很重要：变换函数将按顺序应用。在上面的例子中，我们将盒子向右平移，然后就地旋转它。旋转功能不仅旋转元素，它还旋转 X 轴和 Y 轴。当我们首先应用 rotate(45deg) 时， translateX 现在将沿对角线移动元素，因为 X 轴旋转了 45 度。 &lt;style&gt; @keyframes 轨道 { from { transform: rotate(0deg) translateX(80px); } to { 变换：旋转（360度）translateX（80px）； } } @media (prefers-reduced-motion: no-preference ) { .moon { animation: 轨道 6000ms 线性无限； } }&lt;/style&gt;&lt;div class=&quot;wrapper&quot;&gt; &lt;div class=&quot;planet&quot;&gt;&lt;/div&gt; &lt;div class=&quot;moon&quot;&gt;&lt;/div&gt;&lt;/div&gt; 旋转然后变换技术允许我们将一个元素设置为围绕其自然的、未转换的位置“运行”。在这个例子中，我们首先将月球定位在行星的死点，让它围绕它旋转一定距离。某些类型的变换具有原点，即变换锚定到的点。\n这对某些类型的效果很有用（例如，一个元素“从另一个元素中生长出来”）。转换的一个常见问题是它们不适用于 Flow 布局中的内联元素。 &lt;style&gt; .inline-fella { /* 不起作用 :( */ transform: rotate(-10deg); }&lt;/style&gt;&lt;p&gt; 为什么 &lt;span class=&quot;inline-fella&quot;&gt;Hello&lt;/span&gt; &lt;/p&gt; 内联元素不喜欢被推挤。他们的目标是在尽可能少的中断的情况下环绕一些内容。转换不是他们的一杯茶。最简单的解决方法是将其切换为使用显示： inline-block，或者使用不同的布局模式（例如 Flexbox 或 Grid）。除了我们在本教程中介绍的 2D 转换之外，CSS 还可以在第三维中转换元素！3D 转换有自己的怪癖和特质. 为了公平起见，我将单独写一篇关于 3D 变换的文章。敬请期待！\n我必须承认：本教程最初不是作为博客文章编写的。它是从我即将开设的 CSS 课程移植而来的：CSS for JavaScript Developers 是一门综合性的多格式课程，其目标是改变您与 CSS 的关系。该课程是专门为使用 React、Angular 或 Vue 等 JS 框架的人创建的。我们涵盖了 CSS 的基础知识，但在现代 JS 生态系统的背景下。它比我的博客文章更深入。除了数十个练习和项目外，还有 150 多个视频。我已经全职工作一年多了。近 5000 人在早期的众筹中购买了它，他们的反馈使课程变得更好。该课程将于 9 月 27 日发布，您可以在此处了解更多信息：css-for-js.dev。", "note_en": "At first glance, it may seem like a pretty niche thing. How often do we need to rotate or skew something, after all? And yet, the more I learn about  transform, the more I find myself taking advantage of it. In my blog&#39;s codebase, I&#39;ve used the  transform property  more than 350 times!\n In this blog post, we&#39;re diving deep into the  transform property. I&#39;ll show you some of the cool and unexpected things you can do with it!\n   The  transform property can do a  whole bunch of different things, through the use of transform functions like  translate and  skew.\n     We can use  translate to shift an item along in either axis:  x moves side to side,  y moves up and down. Positive values move down and to the right. Negative values move up and to the left.\n Critically,  the item&#39;s in-flow position doesn&#39;t change. As far as our layout algorithms are concerned, from Flow to Flexbox to Grid, this property has no effect.\n For example: in this visualization, we have 3 children aligned using Flexbox. When we apply a transform to the middle child, the Flexbox algorithm doesn&#39;t notice, and keeps the other children in the same place:\n  This is similar to how  top /  left /  right /  bottom work in positioned layout, with relatively-positioned elements.\n When we want to move an element along a single axis, we can use  translateX and  translateY:\n  There&#39;s one thing that makes  translate ridiculously powerful, though. Something  totally unique in the CSS language.\n When we use a percentage value in  translate, that percentage refers to  the element&#39;s own size, not the available space within the parent container.\n   Setting  transform: translateY(-100%) moves the box up by its exact height, no matter what that height is, to the pixel.\n This is incredibly handy when we want an element to sit  just outside another one:\n &lt;style&gt; .parent { position: relative; } .child { width: 50px; height: 50px; /* Put the child in the top-right corner… */ position: absolute; top: 0; right: 0; /* …and then shift it up to sit just outside: */ transform: translateY(-100%); }&lt;/style&gt;&lt;div class=&#34;parent&#34;&gt; &lt;div class=&#34;child&#34;&gt;&lt;/div&gt;&lt;/div&gt;\n  A common usecase for this trick is to add a &#34;close&#34; button just outside a dialog box:\n &lt;style&gt; .dialog-content { position: relative; } .close-btn { position: absolute; top: 0; right: 0; transform: translateY(-100%); }&lt;/style&gt;&lt;div class=&#34;dialog-wrapper&#34;&gt; &lt;div class=&#34;dialog-content&#34;&gt; &lt;button class=&#34;close-btn&#34;&gt; &lt;svg xmlns=&#34;http://www.w3.org/2000/svg&#34; width=&#34;24&#34; height=&#34;24&#34; viewBox=&#34;0 0 24 24&#34; fill=&#34;none&#34; stroke=&#34;currentColor&#34; stroke-width=&#34;2&#34; stroke-linecap=&#34;round&#34; stroke-linejoin=&#34;round&#34; class=&#34;feather feather-x&#34;&gt;&lt;line x1=&#34;18&#34; y1=&#34;6&#34; x2=&#34;6&#34; y2=&#34;18&#34;&gt;&lt;/line&gt;&lt;line x1=&#34;6&#34; y1=&#34;6&#34; x2=&#34;18&#34; y2=&#34;18&#34;&gt;&lt;/line&gt;&lt;/svg&gt; &lt;span class=&#34;visually-hidden&#34;&gt; Dismiss dialog &lt;/span&gt; &lt;/button&gt; &lt;/div&gt;&lt;/div&gt;\n   This allows us to add a &#34;buffer&#34;, so that we can translate something by its own size  plus a few extra pixels.\n     Scale uses a unitless value that represents a  multiple, similar to  line-height.  scale(2) means that the element should be 2x as big as it would normally be.\n   At first glance, this might seem equivalent to setting  width and  height, but there&#39;s one big difference.\n   The text scales up and down with the element. We aren&#39;t just transforming the size and shape of the box, we&#39;re transforming the  entire element and all of its descendants.\n This reveals an important truth about transforms:  elements are flattened into a texture. All of these transforms essentially treat our element like a flat image, warping and contorting it as you might in Photoshop.\n  Think about how much work is required when we change something like  width. All of the layout algorithms need to re-run, figuring out exactly where this element and all of its siblings should be. If the element has text inside, the line-wrapping algorithm needs to figure out if this new width affects the line breaks. Then, the paint algorithms run, figuring out which color every pixel needs to be, and filling it in.\n It&#39;s fine to do this once when the page loads, but when we animate something, we need to do all of those calculations  many many times a second. With transforms, we can skip a bunch of steps. This means that the calculations run quicker, leading to smoother motion.\n It may seem like a bummer that  scale will stretch/squash the element&#39;s contents, but we can actually use this effect to our advantage. For example, check out this old-timey TV power animation:\n   And, if we  really don&#39;t want our text to squash, we can apply an  inverse transform to the child.\n This is an advanced technique, far beyond the scope of this blog post, but know that it&#39;s possible to use  scale to increase an element&#39;s size  without distorting its children. Libraries like  Framer Motion take advantage of this fact to build highly-performant animations without stretching or squashing.\n    We typically use the  deg unit for rotation, short for degrees. But there&#39;s another handy unit we can use, one which might be easier to reason about:\n  The  turn unit represents how many turns the element should make. 1 turn is equal to 360 degrees.\n It&#39;s obscure, but well-supported; the  turn unit goes all the way back to IE 9!\n      Skew can be useful for creating diagonal decorative elements (à la  Stripe). With the help of  calc and some trigonometry, it can also be used on elements without distorting the text! This technique is explored in depth in Nils Binder&#39;s awesome blog post, “ Create Diagonal Layouts Like It&#39;s 2020”.\n    The order is important: the transform functions will be applied sequentially. In the above example, we translate the box to the right, and then we rotate it in-place.\n   The  rotate function doesn&#39;t just rotate the element, it  also rotates the X and Y axes.\n When we apply  rotate(45deg) first,  translateX will now move the element diagonally, because the X axis is rotated by 45 degres.\n  &lt;style&gt; @keyframes orbit { from { transform: rotate(0deg) translateX(80px); } to { transform: rotate(360deg) translateX(80px); } } @media ( prefers-reduced-motion: no-preference ) { .moon { animation: orbit 6000ms linear infinite; } }&lt;/style&gt;&lt;div class=&#34;wrapper&#34;&gt; &lt;div class=&#34;planet&#34;&gt;&lt;/div&gt; &lt;div class=&#34;moon&#34;&gt;&lt;/div&gt;&lt;/div&gt;\n The rotate-then-transform technique allows us to set an element to &#34;orbit&#34; around its natural, non-transformed location. In this example, we start by positioning the moon in the dead center of the planet, and have it rotate around it, at a distance.\n    Certain types of transforms have an  origin, a point at which the transform anchors to.\n      This is useful for certain kinds of effects (for example, an element &#34;growing out of&#34; another one).\n  One common gotcha with transforms is that they don&#39;t work with inline elements in Flow layout.\n &lt;style&gt; .inline-fella { /* Doesn&#39;t work :( */ transform: rotate(-10deg); }&lt;/style&gt;&lt;p&gt; Why &lt;span class=&#34;inline-fella&#34;&gt;Hello&lt;/span&gt; there!&lt;/p&gt;\n Inline elements don&#39;t enjoy being jostled. Their goal is to wrap around some content with as little disruption as possible. Transforms aren&#39;t their cup of tea.\n The easiest fix is to switch it to use  display: inline-block, or to use a different layout mode (eg. Flexbox or Grid).\n  In addition to the 2D transforms we&#39;ve covered in this tutorial, CSS can transform elements in a third dimension!\n 3D transforms have their own quirks and idiosyncracies. In order to do them justice, I&#39;ll be writing a separate post all about 3D transforms. Stay tuned!\n  I have a confession to make: this tutorial wasn&#39;t originally written as a blog post. It&#39;s been ported from my upcoming CSS course:\n    CSS for JavaScript Developers is a comprehensive multi-format course with the goal of transforming your relationship with CSS.\n The course is specifically created for folks who work with a JS framework like React or Angular or Vue. We cover the fundamentals of CSS, but within the context of the modern JS ecosystem.\n It goes  way deeper than my blog posts. There are over 150 videos, in addition to dozens of exercises and projects.\n I&#39;ve been working on it full-time for over a year now. Almost 5000 people purchased it in an early crowdfunding round, and their feedback has made the course  so much better.\n The course will be released on  September 27th, and you can learn more here:  css-for-js.dev.", "posttime": "2021-08-09 23:06:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "转换,css,quot", "title": "CSS 转换的世界", "title_en": "The World of CSS Transforms", "transed": 1, "url": "https://www.joshwcomeau.com/css/transforms/", "via": "", "real_tags": ["转换", "css", "quot"]}]