[{"category": "", "categoryclass": "", "imagename": "fec1f60ce546452aa18febd8b75df099.jpg", "infoid": 1000802, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "011010000111010101101101011000010110111001110011001000000110111001101111011101000010000001101001011011100111011001101001011101000110010101100100001011000010000001110111011001010110110001100011011011110110110101100101001000000110001001101111011101000111001100100001", "note_en": "011010000111010101101101011000010110111001110011001000000110111001101111011101000010000001101001011011100111011001101001011101000110010101100100001011000010000001110111011001010110110001100011011011110110110101100101001000000110001001101111011101000111001100100001", "posttime": "2020-05-06 02:54:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "邀请,humans", "title": "未邀请人类", "title_en": "Humans Not Invited", "transed": 1, "url": "http://www.humansnotinvited.com/", "via": "", "real_tags": ["邀请", "humans"]}, {"category": "", "categoryclass": "", "imagename": "7a12fbe09a8a9b236c491926eb45af3e.jpg", "infoid": 1000801, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我们写完一本关于内容营销的3万多字的书时，我们并没有计划把它作为一篇不合理的长得不合理的博客帖子发布。然而，我们还是来了。\n话又说回来，当我们在2011年12月开始写公司博客时，我们从未想过要聘请5名全职作家，出版几本书，或者变成一家通过销售产品赚钱的内容公司。\n这是一篇很长的博客文章。它包含了我们所知道的关于如何制作内容并使其在互联网上传播的一切。它讲述了Priceonomics的故事，以及我们如何建立了将数据转化为内容的业务。它最初是我们给新的经济学作家的一本简短的手册，现在我们对它进行了扩展。\n如果您想要本手册的摘要，我们制作了一个6页的版本，您可以在这里找到。在接下来的几天里，我们还将出版完整手册的PDF和ePub版本。如果您感兴趣，请在这里留下您的电子邮件。\n把这本手册看作是我们上周发布的“内容跟踪器”的配套产品。内容跟踪器是我们的软件程序，用于衡量您的内容营销执行情况。它是否获得媒体提及、流量、社交分享和客户线索？\n但是，如何制作性能良好的内容，以及如何分发这些内容呢？“内容营销手册”(这篇博客文章)是我们试图分享Priceonomics博客的“秘诀”，这样当你写东西时，客户、记者和读者都会注意到。Priceonomics博客有没有其他公司可以效仿的公式？说大也大吧。这里是：\n但在我们出版它之前，我们停下来考虑一下，卖一本15美元的书是否是生产这些信息的最佳方式。我们的前两本书，一切都是胡说八道，和希普斯特商业模式，卖得相当好，但与我们向企业销售东西的收入相比，产生的钱是微不足道的。此外，我们认为避免将一本书的草稿变成一本真正的书所涉及的所有令人不快的工作是很好的！\n我们决定在我们的办公室做一个演示，在那里我们将讨论做内容营销的“经济学方法”。我们不知道是否有人想听我们花一个小时谈论如何将公司数据转化为内容并使其传播。但我们在一些创业论坛和电子邮件列表上发布了这次演讲的活动细节，希望能吸引观众。\n然而，我们这次演讲的不是很秘密的计划是提出一个“提议”，帮助参加讲座的公司实施我们书中的战略。这个“优惠”(不管它是什么)能比仅仅卖一本书带来更多的收入吗？我们关于具体提供什么的想法是模糊的，但它将涉及到通过我们的软件或服务帮助公司创建更好的内容营销，帮助公司将数据转化为内容。\n令我们惊讶的是，有200人报名参加了我们的演讲，其中大部分是初创公司的创始人和相当规模公司的营销主管。\nPriceonomics办公室不是那么大，所以我们不可能容纳200人。然而，这种大小限制有一个优势：我们必须运行10个小演示文稿，而不是一个大演示文稿，这意味着我们可以测试10个略有不同的“提议”。\n所以我们做了10次演讲，直到最后都是一样的。在演示的最后一张幻灯片上，我们就如何帮助公司制作更好的内容提出了不同的“提议”。\n首先，很明显，即使没有我们的帮助，我们的方法也可以被其他公司复制。每家公司都应该写下自己的数据！在第一次演示后的几周内，我们收到了与会者的电子邮件，他们说，他们写的关于公司数据的文章被媒体转载，登上了Reddit的榜首，表现比他们以前做过的任何事情都高出10到100倍。\n我们还通过展示Priceonomics如何帮助公司制作更好的内容的10种不同的“提议”，学到了很多。\n从一开始，我们就知道人们想要使用我们的内容跟踪器软件。人们喜欢它！虽然Tracker在幕后很复杂，但它的前端是一个简单的仪表板，可以跟踪所有内容营销的表现。如果你整天制作内容，拥有Tracker真的很有帮助，特别是如果你把它和Slake集成在一起的话。\n然而，在与公司的交谈中，我们发现了一个更大的问题，单靠软件是解决不了的。许多公司在内容上有一个巨大的“火上浇油”的问题：他们在他们的博客上花费了大量的金钱和时间，但什么都没有发生！没有交通，没有媒体提及，没有客户线索，什么都没有。他们只是不停地勾选“我们应该写一篇博客”的复选框，但是投入的时间没有任何回报。对于许多公司来说，Tracker只能向他们展示他们已经知道的东西：他们的博客是一个鬼城。\n所以，我们接下来测试了一些不同的东西。我们提出帮助公司更好地制作内容。我们将帮助他们想出主意，如何将他们的数据转化为精彩的故事，并对他们的文章进行编辑，这样他们就会变得真的很棒。这项服务我们每月收费2000美元，就像聘请Priceonomics担任贵公司博客的编辑一样。\n公司每月付给我们2000美元，我们帮助他们根据他们的数据开发想法，编辑他们的文章，并做好他们的工作。他们可以在内容跟踪器中看到结果，所以他们知道它是有效的！我们马上赚了比卖书多得多的钱。\n事实上，对于一半的顾客来说，没有问题。这些公司喜欢这项服务，并在一些指导和编辑帮助下发表了一些令人惊叹的作品。效果很好。在拥有一个无人访问的博客多年后，他们开始发布记者报道和人们分享的信息。\n但是另一半的公司从来没有发表过任何东西！我们见面，集思广益，想出一些关于他们数据中有趣的金块的想法，然后他们就去起草草稿，然后就消失了！这些公司总是太忙了，没有时间完成博客帖子或进行分析。他们一直向我们支付每月2000美元的服务费，但他们没有充分利用这项服务。这感觉并不是很可持续，即使利润率令人羡慕。\n然后，在这个过程接近尾声的时候，我们突然发现：利用我们在Priceonomics开发的知识和软件的最佳方式。一种更好的方法来生产这本手册中的知识。\n我们会根据公司的数据为他们制作内容，然后根据业绩向他们收费。\n公司想要的是性能(能产生客户、公关和流量的文章)，所以这就是我们要卖的东西！我们知道如何查看他们的数据，将其转化为内容，并使其可共享。只要公司使用content Tracker，我们就可以根据表现向他们收费。\n因此，我们提出了这个最后的报价，我们想让公司毫不犹豫地接受这个报价。\n我们提出帮助公司将他们的数据转化为令人惊叹的内容营销。我们在这件事上付出了疯狂的努力，而且我们会以成本为代价来做这件事。但是，如果内容获得5000次点击量或5次媒体提及，他们将支付额外的成功费用。而且，我们可以方便地在Tracker中测量性能。\n当你考虑到创建内容所涉及的时间和精力时，我们知道我们采访的许多公司每月在内容营销上的花费已经远远超过数千美元。但是他们没有得到任何结果。付钱让我们制作内容是一个低风险的提议，动机完全一致。\n公司开始从我们这里购买内容。一些人试了一次，然后问他们是否可以签署为期一年的协议。有一家公司从我们这里买了一条内容。第二个月他们买了4个。第二个月他们买了10个。这太疯狂了！它之所以奏效，是因为我们卖的是性能，而不是内容。公司不需要内容；当他们发布内容时，他们需要更多的事情发生。好的内容只是性能的催化剂。\n这就是我们宣布成立新的内容营销机构Priceonomics data Studio的原因。它有一半是分析公司，一半是内容公司，就像Priceonomics一样。这是一家内容营销机构，只对我们的内容跟踪软件的用户开放。(它是免费的，您应该使用它。)。\n我们将获取贵公司的数据，对其进行分析，然后将其转化为出色的内容营销，并将其发布到您的网站上。而且我们主要根据性能收费。到目前为止，我们达到成功指标的概率约为75%。\n如果您想了解更多关于我们的数据驱动型内容营销机构的信息，请给我们发个消息，我们会安排一个时间来谈论您的数据。会很有趣的。它起作用了。\n这本书里的一切都很管用。你可以让它工作，你可以雇佣我们让它工作，你可以使用我们的软件来测量它是否工作。\n在整本书中，我们敦促您将内容营销视为一场必须付出巨大努力的活动。没有什么好事是偶然发生的。你需要从伟大的想法开始，你需要有一个如何分发内容的计划，然后你需要执行这个计划。您的内容不会被媒体转载或意外传播。你必须设计出这样的结果。\n这本书讲的是三件事。如何制作内容。如何传播内容。以及如何在没有大量资源的情况下做到这一点。它完全基于我们在Priceonomics的经验。\n我们对彼得·泰尔问题的回答是，“你相信什么是其他人都不相信的？”我们相信，如果你制作了一篇好的内容，那么无论你把它发布在纽约时报的网站上还是你公司的博客上，都变得越来越无关紧要了。\n为什么人们要分享呢？主要是为了确认他们现有的偏见。(但这一点你已经知道了。)。\n要真正擅长制作内容营销，有一个诡异的诀窍：把它想象成一场活动，不要让自己失败。\n内容营销者应该感到讨厌吗？内容营销本质上是通过销售产品来货币化的内容。传统媒体是通过出售用户注意力和个人数据来货币化的内容。对我们来说，这是一个悬而未决的问题，实际上更棘手。\n我们还总结了经济案例和公司制作更好内容的机会。高质量的内容，不那么荒谬的自我推销，并且真正发挥作用的内容。\n因此，不作进一步的告别，我们将介绍“内容营销手册”的其余部分。或者，“如何写下信息并使其传播。”或者，一份“精致的内容营销手册，用来销售内容营销软件和服务。”\nPriceonomics博客几乎没有发生。今天，我们的网站每年有数以千万计的免费访问者，他们从我们这里购买书籍、数据和高价值的商业服务--但我们几乎从一开始就把事情搞砸了。\n2011年末，Priceonomics(我们公司)以在线二手物品价格指南起家。我们建立了网络爬虫，检查人们将旧iPhone、自行车和汽车卖了多少钱，分析这些物品的价格数据，然后将其发布到我们的网站上。我们每件事都像凯利蓝皮书。\n所以，我们建立并推出了一个网站--猜猜发生了什么？没什么。这不是我们的第一家互联网初创公司，所以我们预料到了。互联网是一个广阔的地方：人们不会注意到一个新的网站或应用程序，除非你想出一个聪明的方法让人们找到它。\n我们的目标是让人们通过谷歌发现Priceonomics价格指南。人们总是在谷歌上查找价格和进行产品研究，所以我们需要在那里显示我们的结果。如果你想知道一部二手iPhone的价值，必须在搜索结果中显示Priceonomics。\n要在谷歌搜索结果中排名靠前，一个网站需要两样东西：内容和从其他网站到它的链接。我们的内容策略不够理想，但这就是我们产品的本质。我们的算法为我们定价的每一种产品创建了数千个网页。它们不是谷歌喜欢的丰富的、手工制作的内容；它们是薄薄的页面，上面有产品的名称、价格和几个可以买到产品的地方的链接。\n在短期内，我们的网站有太多这样的页面，以至于我们无法真正提高它们的质量(除了改进生成页面的算法)。\n然而，我们可以控制的是入站链接。为了在谷歌的算法中排名靠前，你不仅需要好的内容，还需要其他人链接到它。这是对谷歌算法的一个信号，表明你的内容是权威的，应该出现在谷歌搜索结果中。如果《纽约时报》链接到你关于iPhone价格的页面，那就是你的内容可能信誉良好的迹象。\n所以我们决定开一个博客，把我们的定价数据写下来。大约在2011年的这个时候，约会网站OKCupid根据公司的数据写了一些非常受欢迎的关于约会的文章，我们想我们应该用我们用过的价格数据来尝试同样的事情。这是一个实验，看看我们是否可以获得链接，并提高我们在谷歌搜索结果中的排名。\n当我们计划我们的博客时，我们在创业孵化器Y组合中开始了一个为期12周的“加速器”项目。因为我们是这个项目的一部分，有影响力的技术网站TechCrunch同意就我们的发布进行报道。\nTechCrunch的工作人员告诉我们，这篇文章将于12月20日上线。这篇文章会很有帮助，因为在谷歌看来，在TechCrunch上链接到我们的网站将提高我们的可信度。我们还决定，在TechCrunch的文章上线后，我们将使用我们的数据写一篇文章，提交到Hacker News，一个在科技界很受欢迎的社交新闻网站，希望能接触到更多的潜在用户。(并从发现Priceonomics的新闻网站获得更多链接。)。\n有一段时间，我们在思考我们可以写些什么。圣诞节快到了，互联网上充斥着关于礼物创意的文章。由于Priceonomics是一个二手产品定价网站，我们决定写一些你可以买来作为圣诞礼物的二手物品。因为我们计划将这篇文章提交给黑客新闻(一个面向程序员的网站，由我们在Y Combinator的投资者运营)，所以我们写了一些“黑客”喜欢的礼物。\n我们的博客帖子--“在Craigslist上为黑客购买圣诞礼物”--当然很糟糕。谁想买二手产品作为圣诞礼物？产品是给“黑客”用的，这到底是什么意思呢？我们有没有想到“纽约时报”的撰稿人会看到这一点，然后想，“我们必须写这个有趣的网站，它将帮助人们为电脑黑客购买二手物品。”\n你可能不想在Craigslist上给你女朋友的妈妈买圣诞礼物。你的丈夫或阿姨可能会嘲笑他们树下的二手小玩意儿。出于其他人最清楚的原因，在美国为人们购买二手商品作为礼物是违反社会规范的。\n但是你知道吗，Craigslist上有很多很棒的东西，而且比买新的便宜。如果说Etsy支持“购买手工制造”运动，那么在Priceonomics，我们则支持“购买二手”运动。\n如果你买二手的话，你可以多花200%的钱。100美元的预算可以让你得到300美元的东西，如果你让别人吃折旧和在流动性不佳的市场上出售旧东西的痛苦。而对于她的麻烦，卖家会从他们不再需要的东西上得到冷冰冰的现金。这是一件美丽的事情。它甚至对环境也有好处！\n持怀疑态度？让我们带你看看黑客朋友想要的东西，但你买不起新的。与你女朋友的妈妈不同，如果你砍掉圣诞节预算，真的给他们买了一次像样的礼物，他们可能会很感激！\n我们(有点偏颇)的建议是：在Craigslist上找到这些商品。在Priceonomics上查一下，看看他们是否物有所值。买下来吧。让你的朋友开心。冲洗一下，重复一遍。\n[帖子的其余部分是你可以购买的产品清单，以及它们的新价格和二手价格的比较。]。\n这个帖子最大的问题是我们扮演营销人员的角色。我们在做我们认为营销人员做的事情。每家公司都有博客，他们都是这样写的，所以我们认为这就是我们应该做的。当时，我们既不是有经验的作家，也不是内容营销者，所以我们认为博客的意义在于谈论你的产品并销售它们。这就是营销的本质：销售和乏味。\n不过，好消息是：我们从未发表过那篇愚蠢的博客文章。12月20日来了又走，TechCrunch没有发表宣布我们推出的文章。我们关于圣诞礼物的博客文章有被忽略的风险。\n最后，在2011年12月22日晚上，TechCrunch关于Priceonomics的文章上线了。第二天，我们准备发布关于二手圣诞礼物价格的“有洞察力”的文章，但我们面临着一些纠缠不休的问题。首先，那是12月23日--圣诞节前两天，在Craigslist上买礼物的时间已经很晚了。更重要的是，我们还没有足够的数据来计算我们推荐的几种产品的价格。\n所以，我们取消了这篇博文，在最后一刻重新开始。我们可以写些什么来代替呢？\n本月早些时候，我们做了一个有趣的实验。我们利用我们的定价数据在Craigslist上找到了二手阿隆办公椅的物美价廉的交易，然后以很高的加价将它们转售给了其他初创公司。找到这些椅子，拖着它们在旧金山四处走动，然后把它们卖给我们的朋友赚取利润的过程相当有趣，有点像汤姆·索耶(Tom Sawyer)。\n我们写了一篇关于这一经历的博客文章，并将其命名为“航空座椅仲裁历险记”。以下是它的一个浓缩版本：\n这是一个关于我们在Craigslist上购买二手副翼座椅并以加价转售给我们Y Combinator同学的故事，当时我们赚了300美元。基本上，我们是在试验是否可以通过套利二手商品来做生意。简而言之，我们了解到，在旧金山湾区拖运家具似乎不是一种特别可扩展的商业模式。\n作为一个小背景故事，Priceonomics正在为所有东西建立价格指南。就像凯利蓝皮书为汽车创建价格报告一样，我们也为自行车、电脑、手机、平板电脑、汽车等做同样的事情。\n我们的第一个实验被我们称为“Craigslist套利”。要做到这一点，我们将确定需求稳定但价格差异大的产品。然后，我们可以购买以低价张贴的商品，然后再以市场价出售。此外，我们团队中的许多人都特别喜欢Craigslist的垃圾收集。\n也许是因为我们当时坐在非常不舒服的椅子上，我们决定把重点放在赫尔曼·米勒(Herman Miller)的副翼座椅上。旧金山湾区对这些椅子的需求相当稳定，特别是在网络初创公司中。副翼座椅是否是一把好椅子，或者是否物有所值，或许最好由其他人来讨论。\n我们给我们认识的其他初创公司发了一封电子邮件，表示愿意以450美元的价格卖给他们飞龙座椅，因为我们知道我们可以在Craigslist上花350美元买到它们，然后把差价100美元收入囊中。\n[这篇帖子的其余部分详细描述了我们的考验和磨难-拒付支票，拖着椅子在城市里四处走动，通常情况下都很艰难。]。\n我们在12月27日点击了“发布”，并将这篇文章提交给了黑客新闻。慢慢地，人们对这篇文章的评价越来越高，直到它成为网站上评价最高的链接。对于Priceonomics来说，这是一个巨大的成功。对我们来说，我们可以写的东西最终会出现在我们最喜欢的网站的顶部，这对我们来说似乎是令人难以置信的！我们在写作方面完全是业余的。\n我们的帖子在“黑客新闻”的头版上占据了将近24小时，影响到了科技界的一大批人。华尔街日报的科技博客写下了我们的故事，许多行业领袖在Tw上分享了它。\n..", "note_en": "When we finished writing a 30,000+ word book about content marketing, we did not plan to publish it as one, unreasonably long blog post. And yet, here we are.\n Then again, when we started writing a company blog in December of 2011, we never expected to hire 5 full-time writers, publish several books, or turn into a content company that makes money by selling products.\n This is a long blog post. It contains everything we know about how to make content and get it to spread on the Internet. It’s the story of Priceonomics, and how we built a business turning data into content. It started out as a brief handbook we gave to new Priceonomics writers; now we’ve expanded it.\n If you’d prefer a summary of the Handbook, we made a 6-page version    that you can find here. We’ll also publish a PDF and ePub version of the full Handbook in the next couple of days. If you’re interested,   leave your email here.\n Consider this Handbook a companion to our release of   Content Tracker last week. Content Tracker is our software program for measuring how well your content marketing is performing. Does it get media mentions, traffic, social shares, and customer leads?\n But how do you make content that performs, and how do you distribute it? The Content Marketing Handbook (this blog post) is our attempt to share the “secret formula” of the Priceonomics Blog so that when you write something, customers, journalists, and readers take notice. Is there a formula to the Priceonomics Blog that other companies can copy? Sort of. Here it is:\n    But before we published it, we paused to consider whether selling a $15 book was the best way to productize this information. Our first two books,   Everything is Bullshit and    Hipster Business Models, sold pretty well, but the money generated has been modest compared to our revenue from selling things to businesses. Plus we thought it would be nice to avoid all the unpleasant work involved in turning a draft of a book into an actual book!\n  We decided to put together a presentation at our office where we would talk about the “Priceonomics way” of doing content marketing. We had no idea if anyone wanted to hear us talk for an hour about how to turn company data into content and make it spread. But we posted the event details of this talk on a few startup forums and email lists with the hopes of attracting an audience.\n Our not-so-secret plan for this presentation, however, was to present an “offer” to help the companies that attended the talk implement the strategies of our book. Could that “offer” (whatever it was) generate more revenue than merely selling a book? Our ideas about what exactly to offer were vague, but it would involve helping companies create better content marketing through our software or a service that helped companies turn their data into content.\n To our surprise, 200 people, mostly startup founders and marketing executives of fairly sizable companies, signed up to attend our talk.\n The Priceonomics office isn’t that big, so we couldn’t possibly accommodate 200 people. This size constraint, however, held an advantage: We had to run 10 small presentations instead of one big one, which meant we could test 10 slightly different “offers”.\n And so we gave ten presentations that were identical until the very end. On the last slide of the presentation, we presented different “offers” for how we could help companies make better content.\n   First, it was clear that our approach was reproducible by other companies, even without our help. Every company should write about its data! Within a few weeks of the first presentation, we received emails from attendees who said that the articles they wrote about their company’s data got picked up by the media, rose to the top of Reddit, and outperformed anything they’d ever done by 10 to 100x.\n We also learned a lot by presenting 10 different “offers” of how Priceonomics could help companies make better content.\n Right off the bat, we knew people wanted to use our   Content Tracker software. People loved it! While Tracker is complex behind the scenes, its frontend is a simple dashboard that tracks the performance of all your content marketing. If you make content all day, having Tracker is really, truly helpful, especially if you integrate it with Slack.\n From talking to companies, however, we discovered a bigger problem that software alone could not solve. Many companies had a huge, “hair-on-fire” problem with content: They spent a ton of money and time on their blogs, and nothing ever happened! No traffic, no media mentions, no customer leads, nothing. They just kept checking the “we should do a blog post” box, but there was no return on that invested time. For many companies, Tracker could only show them what they already knew: their blog was a ghost town.\n So, we next tested something different. We offered to  help companies get better at making content. We would help them come up with ideas for how to turn their data into great stories and edit their pieces so they’d be really good. We charged $2,000 per month for this service, which was like hiring Priceonomics as the editor of your company blog.\n  Companies paid us $2,000 per month, and we helped them develop ideas based on their data, edit their articles, and do their best work. And they could see the results in Content Tracker, so they knew it was working! Right away we made way more money than we would have from book sales.\n  Actually, for half the customers, there was no problem. These companies loved the service and published some amazing work with a little bit of guidance and editorial assistance. It worked great. After years of having a blog that no one visited, they started publishing information that journalists covered and people shared.\n But the other half of the companies never published anything! We’d meet, brainstorm some ideas about interesting nuggets in their data, and they’d go off to work on a draft and then disappear! The companies always got too busy to finish the blog posts or run the analysis. They kept paying us $2,000 a month for the service, but they weren’t fully using it. That didn’t feel very sustainable, even if the margins were enviable.\n And then, towards the end of this process, we hit on it: The optimal way to take the knowledge and software we’ve developed at Priceonomics. A better way to productize the knowledge from this Handbook.\n We’d make content for companies based on their data and then just charge them  based on the performance.\n Companies wanted performance (articles that generated customers, PR, and traffic), so that’s what we’d sell! We knew how to look at their data, turn it into content, and make it shareable. As long as companies used Content Tracker, we could charge them based on performance.\n So we made this final offer, which we wanted to be a no-brainer for companies to accept.\n We offered to help companies turn their data into awesome content marketing. We’d put an insane amount of effort into it, and we’d do it at cost. But, if the content got 5,000 views or 5 press mentions, they’d pay an additional success fee. And, conveniently, we could measure the performance in   Tracker.\n When you consider the time and effort involved in creating content, we knew many of the companies we talked to were already spending way more than thousands dollars per month on their content marketing. But they weren’t getting results. Paying us to make content was a low-risk proposition with completely aligned incentives.\n Companies started buying content from us. Some tried it once and then asked if they could sign year-long deals. One company bought one piece of content from us. The next month they bought 4. The next month they bought 10. This was nuts! It worked because we were selling  performance, not content. Companies don’t need content; they need  things to happen when they publish content. Good content is just the catalyst for performance.\n This is why we are announcing our new content marketing agency, the Priceonomics Data Studio. It’s sort of half analysis firm, half content firm, just like Priceonomics. It’s a content marketing agency that is only available to users of our   Content Tracking software. (Which is free , and you should use it.)\n We’ll take your company’s data, analyze it, and turn it into great content marketing that you publish on your site. And we charge mostly based on performance. So far, we hit the success metrics around 75% of the time.\n If you want to learn more about our data-driven content marketing agency, just    send us a message, and we’ll set up a time to talk about your data. It’ll be fun. It works.\n  Everything in this book works. You can put it to work, you can hire us to put it to work, and you can use our software for to measure if it’s working.\n Throughout this book, we urge you to think of content marketing like a campaign that must be  waged with tremendous effort. Nothing good ever happens by accident. You need to start with great ideas, you need to have a plan for how to distribute that content, and then you need to execute that plan. Your content will not be picked up by the media or go viral by accident. You have to engineer that sort of outcome.\n The book is about three things. How to make content. How to spread content. And how to pull this off if you don’t have tons of resources. It’s based entirely on our experience at Priceonomics.\n       Our answer to Peter Thiel’s question, “What do you believe that no one else believes?” We believe that if you make a good piece of content, it increasingly doesn’t matter if you publish it on  The New York Times website or your company’s blog.\n   Why do people share? Mostly to confirm their existing biases. (But you already knew that.)\n    One weird trick to get really good at producing content marketing: think of it like a campaign, and don’t let yourself fail.\n    Should content marketers feel icky?  Content marketing is essentially content that is monetized by selling products. Traditional media is content that is monetized by selling user attention and personal data. To us, it’s an open question which is actually ickier.\n We also conclude by summarizing the economic case and the opportunity for companies to make better content. Content that is of high quality, that is less absurdly self-promotional, and that actually performs.\n  So without further adieu, we present the rest of “The Content Marketing Handbook.” Or, “How to Write about Information and Make it Spread.” Or, An “Elaborate Piece of Content Marketing to Sell Content Marketing Software and Services.”\n    The Priceonomics Blog almost didn’t happen. Today, we get tens of millions of free visitors to our site each year who buy books, data, and highly-valued business services from us -- but we almost screwed things up from the the get-go.\n In late 2011, Priceonomics (our company) started off as an online price guide for used items. We built web crawlers that checked how much people were selling their old iPhones, bikes, and cars for, analyzed the price data for these items, and then posted it on our website. We were like Kelly Blue Book for everything.\n So, we built and launched a website -- and guess what happened? Nothing. This wasn’t our first internet startup, so we expected that. The internet is a vast place: people won’t notice a new website or app unless you figure out a clever way for people to find it.\n Our goal was for people to discover the Priceonomics price guides through Google. People look up prices and conduct product research all the time on Google, so we needed our results to show up there. If you wanted to find out how much a used iPhone was worth, it was imperative that Priceonomics appeared in the search results.\n To rank well in Google Search results, a website needs two things: content and links to it from other websites. Our content strategy was less than ideal, but that was the nature of our product. Our algorithms had created thousands of web pages for every product we’d priced. They were not the rich, handmade, content that Google loves; they were thin pages with the name of the product, its price, and links to a few places where you could buy the product.\n In the short term, our website had so many of these pages that we couldn’t really improve the quality of them (outside of improving the algorithms that generated the pages).\n What we could control, however, were inbound links. In order to rank highly in Google’s algorithm, not only do you need good content, but you need other people to link to it. That’s a signal to Google’s algorithm that your content is authoritative and should show up in Google search results. If  The  New York Times links to your page about iPhone prices, that’s a sign that your content is probably reputable.\n So we decided to start a blog and write about our pricing data. Around this time, in 2011, the dating site OKCupid had written some very popular articles about dating based on the company’s data, and we figured we’d try the same thing with our used pricing data. It was an experiment to see if we could get links and improve our ranking in Google search results.\n As we planned our blog, we began a twelve week “accelerator” program in the startup incubator Y Combinator. Because we were a part of this program, TechCrunch, the influential technology website, agreed to write about our launch.\n TechCrunch staff told us the article would go live December 20. The article would be helpful, because a link to our site on TechCrunch would, in Google’s eyes, improve our credibility. We also decided that after the TechCrunch article went live, we’d write an article using our data, submit it to Hacker News, a popular social news site in the tech community, and hopefully reach more potential users. (And get more links from news sites that would discover Priceonomics.)\n For some time, we contemplated what we could write about. Christmas was coming up and the Internet was buzzing with articles about gift ideas. Since Priceonomics was a pricing site for used products, we decided to write about used things you could buy as Christmas presents. Since we planned to submit the article to Hacker News (a website geared toward programmers and run by our investors at Y Combinator) we wrote about presents that “hackers” would like.\n Our blog post -- “Buy Christmas Gifts for Hackers on Craigslist” -- was, of course, terrible. Who wants to buy used products for Christmas gifts? What does it even mean that a product is for a “hacker”? Did we think that  New York Times writers would see this and think, “We must write about this intriguing website that will tangentially help people buy used things for computer hackers”?\n  You might not want to buy a Christmas present for your girlfriend’s mom on Craigslist. Your husband or aunt might scoff at a used trinket under their tree. For reasons best expounded by others, it’s against social norms to buy used goods for people as presents in the United States.\n But you know what, there are awesome things on Craigslist and they’re cheaper than buying them new. If Etsy has championed the “buy handmade” movement, at Priceonomics, we champion the “buy used” movement.\n You can get 200% more bang for your buck if you buy used. A $100 budget can get you $300 of stuff if you let someone else eat depreciation and pain of selling their old stuff in illiquid markets. And for her trouble, the seller gets cold hard cash for things they no longer need. It’s a thing of beauty. It’s even good for the environment!\n Skeptical? Let’s walk you through items hacker friends would love to have, but you can’t afford to buy them new. Unlike your girlfriend’s mom, they might appreciate it if you hacked your Christmas budget and actually got them decent presents for once!\n Our (somewhat biased) advice: Find these items on Craigslist. Look them up on Priceonomics to make sure they’re a good deal. Buy them. Make your friend happy. Rinse, repeat.\n [The rest of the post was a list of products you could buy, along with a comparison of their new versus used prices.]\n The biggest problem with this post was that we  play-acted at being marketers. We were doing what we thought marketers did. Every company has a blog, and they all write things like this, so we figured that was what we were supposed to do. At the time, we weren’t experienced writers or content marketers, so we thought the point of a blog was to talk about your products and sell them. That’s what marketing is: salesy and boring.\n Here’s the good news, though: we never published that moronic blog post. December 20 came and went, and TechCrunch didn’t publish the article announcing our launch. Our blog post about Christmas presents ran the risk of being irrelevant.\n Finally, on the evening of December 22, 2011, the TechCrunch article about Priceonomics went live. The next day, we were set to post our “insightful” article about the price of used Christmas gifts, but we faced some nagging issues. First, it was December 23rd -- two days before Christmas and pretty late in the game to buy gifts on Craigslist. More importantly, we didn’t yet have enough data to calculate the prices of several products we were recommending.\n So, we scrapped the blog post and started fresh at the last minute. What could we write about instead?\n Earlier in the month, we had run an interesting experiment. We employed our pricing data to find good deals on used Aeron office chairs on Craigslist, and then we resold them to other startups at a substantial mark-up. The process of finding these chairs, lugging them around San Francisco, and selling them to our friends for a profit was pretty entertaining, in a Tom Sawyer sort of way.\n We wrote a blog post about this experience and called it “Adventures in Aeron Chair Arbitrage.” Here’s a condensed version of it:\n Here’s a story about the time we made $300 in profit buying used Aeron Chairs on Craigslist and reselling them to our Y Combinator classmates at marked up prices. Basically, we were experimenting if we could make a business out of arbitraging used goods. In short, we learned that lugging furniture around the Bay Area didn’t seem to be an especially scalable business model.\n For a little back story, Priceonomics is building the price guide for everything. Just like Kelly Blue Book creates price reports for cars, we do the same for bicycles, computers, phones, tablets, cars, and much more.\n Our first experiment we dubbed “Craigslist Arbitrage.” To do this, we would identify products with steady demand but high price variance. We could then buy items that were posted at bargain prices and later sell them at the market price. Also, much of our team takes particular delight in Craigslist scavenging.\n Perhaps because we were sitting on extremely uncomfortable chairs at the time, we decided to focus on Herman Miller Aeron Chairs. There’s a fairly steady demand for these chairs in the Bay Area, particularly among web startups. Whether Aeron chairs are good chairs or are worth the money is perhaps best discussed by others.\n We fired off an email to other startups we knew offering to sell them Aeron chairs for $450, knowing that we could buy them on Craigslist for $350 and pocket the $100 difference.\n [The rest of the post details our trials and tribulations -- bounced checks, lugging chairs around the city, and generally having a tough time.]\n  We hit “publish” on December 27th and submitted this post to Hacker News. Slowly, people upvoted the article until it was the most upvoted link on the site. For Priceonomics, it was a huge hit. It seemed unbelievable to us that something we could write would end up at the top of one of our favorite websites! We were complete amateurs at writing.\n  Our post was on the front page of Hacker News for almost 24 hours and reached a huge swath of the technology industry.  The Wall Street Journal’s technology blog wrote about our story, many industry leaders shared it on Tw\n......", "posttime": "2020-05-06 02:42:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "营销,marketing,内容,content", "title": "内容营销手册", "title_en": "The Content Marketing Handbook", "transed": 1, "url": "https://priceonomics.com/the-content-marketing-handbook/", "via": "", "real_tags": ["营销", "marketing", "内容", "content"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000800, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转搜索最不惊讶原则(POLA)，也称为最不惊讶原则(或者，法则34；或规则34；)[1][2]适用于用户界面和软件设计。[3]从1984年开始，该原则的一个典型表述是：如果一个必要的特征具有很高的惊喜度，则可能需要重新设计该特征。&#34；[4]。\n更广泛地说，该原则意味着系统组件的行为方式应该是大多数用户期望它的行为方式；该行为不应该让用户感到惊讶。\n教科书上的表述是：人是系统的一部分。设计应该与用户的体验、期望和心理模型相匹配。\n该原则旨在利用用户已有的知识将学习曲线降至最低，例如，通过设计大量借用您的用户可能熟悉的功能相似或类似程序的界面。[1]用户在这方面的期望可能与特定的计算平台或传统密切相关。例如，Unix命令行程序应遵循有关开关的特定约定[1]，Microsoft Windows程序的窗口小部件应遵循有关键盘快捷键的特定约定。[6]在更抽象的设置(如API)中，函数或方法名称与其行为直观匹配的期望是另一个例子。[7]这种做法还涉及合理默认值的应用。[4]。\n当界面的两个元素冲突或模棱两可时，行为应该是最不会让用户感到惊讶的行为；特别是程序员应该尝试考虑最不会让使用程序的人感到惊讶的行为，而不是从了解程序的内部工作方式中自然产生的行为。[4]。\n选择最不令人惊讶的行为可能取决于预期的受众(例如，最终用户、程序员或系统管理员)。[1]。\n网站可以有一个在页面加载后自动聚焦的输入字段[8]，例如搜索字段(例如Google Custom Search)或登录表单的用户名字段。\n提供键盘快捷键的网站通常允许按键吗？若要查看可用的快捷键，请执行以下操作。例如Gmail[9]和Jira。[10]\n在Windows操作系统和某些Linux桌面环境中，F1功能键通常会打开应用程序的帮助程序。MacOS中类似的键盘快捷键是⌘命令+⇧Shift+/。当用户按下通常的帮助快捷键时，他们期望看到帮助窗口或上下文菜单。如果软件将此快捷方式用于另一个功能，则如果没有出现帮助，很可能会引起惊讶。恶意软件可以利用用户对常规快捷键的熟悉程度。[11]。\n编程语言的标准库通常提供类似于伪代码ParseInteger(字符串，基数)的函数，它从人类可读的数字字符串创建机器可读的整数。基数通常默认为10，这意味着字符串被解释为十进制(以10为基数)。此函数通常支持其他基数，如二进制(基数2)和八进制(基数8)，但仅当它们被显式指定时才支持。与这一约定不同的是，对于以&#34；0&#34；开头的字符串，JavaScript最初默认为基数8，这会导致开发人员困惑和软件错误。[12]这在ECMAScript 3中是不鼓励的，在ECMAScript 5中删除[13]。\n埃里克·史蒂文(2003)。运用最不令人惊讶的原则。Unix编程的艺术。faqs.org。第20页。ISBN电话：978-0-13-142901-7。\n彼得·塞巴赫(2001-08-01)。最小惊讶原则。脾气暴躁的用户。IBM developerWorks。\n^a b c c Cowlishaw，M.F.(1984)。Rexx语言的设计(PDF)。IBM系统杂志。23(4)：333。doi：10.1147/sj.234.0326.。这项新功能会不会有让人大吃一惊的因素呢？如果某个功能被用户意外误用，并导致在他看来是不可预测的结果，则该功能具有很高的惊喜度，因此是不受欢迎的。如果必要的特征具有很高的惊奇系数，则可能需要重新设计该特征。\n约书亚·布洛赫(2006)。如何设计一个好的API，为什么它很重要。参加第21届ACM SIGPLAN面向对象编程系统、语言和应用研讨会。计算机械协会。第506-7.DOI页：10.1145/507。ISBN电话：1-59593-491X。\n^Keizer，G.(2010年3月1日)。Microsoft：在Windows XP中不要按F1键。计算机世界。\n^&#34；parseInt()&#34；，Mozilla Developer Network(MDN)，如果输入字符串以&#34；0&#34；(零)开头，则假定基数为8(八进制)或10(十进制)。具体选择哪个基数取决于实现。ECMAScript 5澄清应该使用10(十进制)，但并不是所有的浏览器都支持这一点。", "note_en": "Jump to navigation  Jump to search  The  principle of least astonishment ( POLA), also called the  principle of least surprise (alternatively a &#34;law&#34; or &#34;rule&#34;)  [1]  [2] applies to  user interface and  software design.  [3] A typical formulation of the principle, from 1984, is: &#34;If a necessary feature has a high astonishment factor, it may be necessary to redesign the feature.&#34;  [4]\n More generally, the principle means that a component of a system should behave in a way that most users will expect it to behave; the behavior should not astonish or surprise users.\n   A  textbook formulation is: &#34;People are part of the system. The design should match the user&#39;s experience, expectations, and  mental models.&#34;  [5]\n The principle aims to leverage the pre-existing knowledge of users to minimize the  learning curve, for instance by designing interfaces that borrow heavily from &#34;functionally similar or analogous programs with which your users are likely to be familiar&#34;.  [1] User expectations in this respect may be closely related to a particular  computing platform or  tradition. For example,  Unix command line programs are expected to follow certain conventions with respect to  switches,  [1] and  widgets of  Microsoft Windows programs are expected to follow certain conventions with respect to  keyboard shortcuts.  [6] In more abstract settings like an  API, the expectation that  function or method names intuitively match their behavior is another example.  [7] This practice also involves the application of sensible  defaults.  [4]\n When two elements of an interface conflict, or are ambiguous, the behavior should be that which will least surprise the  user; in particular a  programmer should try to think of the behavior that will least surprise someone who uses the program, rather than that behavior that is natural from knowing the inner workings of the program.  [4]\n The choice of &#34;least surprising&#34; behavior can depend on the expected audience (for example,  end users,  programmers, or  system administrators).  [1]\n  A website could have an  input field that  focuses automatically after the page loads,  [8] such as a search field (e.g.  Google Custom Search), or the  username field of a  login  form.\n Sites offering  keyboard shortcuts often allow pressing  ? to see the available shortcuts. Examples include  Gmail  [9] and  Jira.  [10]\n In  Windows operating systems and some  desktop environments for  Linux, the  F1  function key typically opens the  help program for an  application. A similar keyboard shortcut in  macOS is  ⌘  Command+ ⇧ Shift+ /. Users expect a help  window or  context menu when they press the usual help shortcut key(s). Software that instead uses this shortcut for another feature is likely to cause astonishment if no help appears.  Malware may exploit user familiarity with regular shortcuts.  [11]\n A  programming language&#39;s  standard library usually provides a  function similar to the  pseudocode  ParseInteger(string, radix), which creates a machine-readable  integer from a  string of human-readable  digits. The  radix conventionally  defaults to 10, meaning the string is interpreted as  decimal (base 10). This function usually supports other bases, like  binary (base 2) and  octal (base 8), but only when they are specified explicitly. In a departure from this convention,  JavaScript originally defaulted to base 8 for strings beginning with &#34;0&#34;, causing  developer confusion and  software bugs.  [12] This was discouraged in ECMAScript 3 and dropped in ECMAScript 5  [13]\n    ^     a     b     c     d    Raymond, Eric Steven (2003).   Applying the Rule of Least Surprise.  The Art of Unix Programming. faqs.org. p. 20.  ISBN   978-0-13-142901-7 .\n  ^   Seebach, Peter (2001-08-01).  &#34;The Principle of Least Astonishment&#34;.  The cranky user.  IBM DeveloperWorks .\n ^     a     b     c    Cowlishaw, M. F. (1984).  &#34;The design of the REXX language&#34;  (PDF).  IBM Systems Journal.  23 (4): 333.  doi: 10.1147/sj.234.0326 .  Could there be a high astonishment factor associated with the new feature? If a feature is accidentally misapplied by the user and causes what appears to him to be an unpredictable result, that feature has a high astonishment factor and is therefore undesirable. If a necessary feature has a high astonishment factor, it may be necessary to redesign the feature.\n   ^    Bloch, Joshua (2006).  &#34;How to design a good API and why it matters&#34;.  Proceeding OOPSLA &#39;06 Companion to the 21st ACM SIGPLAN symposium on Object-oriented programming systems, languages, and applications. Association for Computing Machinery. pp. 506–7.  doi: 10.1145/1176617.1176622.  ISBN   1-59593-491-X.\n    ^   Keizer, G. (1 March 2010).  &#34;Microsoft: Don&#39;t press F1 key in Windows XP&#34;.  Computerworld .\n  ^    &#34;parseInt()&#34;,  Mozilla Developer Network (MDN),  If the input string begins with &#34;0&#34; (a zero), radix is assumed to be 8 (octal) or 10 (decimal). Exactly which radix is chosen is implementation-dependent. ECMAScript 5 clarifies that 10 (decimal) should be used, but not all browsers support this yet.", "posttime": "2020-05-06 02:41:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "原则,principle,user", "title": "最小惊奇原则", "title_en": "Principle of Least Astonishment", "transed": 1, "url": "https://en.wikipedia.org/wiki/Principle_of_least_astonishment", "via": "", "real_tags": ["原则", "principle", "user"]}, {"category": "", "categoryclass": "", "imagename": "efc9c52f6509661dabbde21ceef40691.jpg", "infoid": 1000799, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "莱斯大学的研究人员已经发明了一种高效、低成本的装置，它可以将水裂解来生产氢燃料。这个平台是由水稻材料科学家Jun Lou的布朗工程学院实验室开发的，它集成了催化电极，当阳光触发时，它会产生电力。电流流向将水转化为氢和氧的催化剂，阳光转化氢的效率高达6.7%。\n这种催化并不是什么新鲜事，但实验室将一层膜和电极封装成一个模块，当它落入水中并置于阳光下时，无需进一步输入即可产生氢气。\n由楼、主要作者、赖斯博士后研究员贾亮和他们的同事在美国化学学会杂志ACS Nano上介绍的这种材料是一个自给自足的生产商，他们说，应该很容易批量生产。\n楼说，这个概念与人造叶子大致相似。我们拥有的是一个集成模块，它将太阳光转化为电能，驱动电化学反应。它利用水和阳光来获取化学燃料。\n钙钛矿是一种具有立方状晶格的晶体，众所周知，它可以收集光线。到目前为止生产的效率最高的钙钛矿可以达到25%以上的效率，但这种材料很昂贵，而且容易受到光、湿度和热的压力。\n楼说，贾跃亭已经用碳等替代品取代了钙钛矿太阳能电池中更昂贵的成分，如铂。这降低了商业收养的准入门槛。像这样的集成设备很有前途，因为它们创造了一个可持续发展的系统。这不需要任何外部电源来保持模块运行。&#34；\n梁说，关键成分可能不是钙钛矿，而是包裹它的聚合物，保护模块并允许长时间浸泡。他说，其他人已经开发出催化系统，用导线将水外的太阳能电池连接到浸没的电极上。我们将钙钛矿层用一层聚合物薄膜包裹起来，从而简化了系统。\n梁说，图案化的薄膜允许阳光到达太阳能电池，同时保护它，并作为电池和电极之间的绝缘体。\n卢说，有了一个巧妙的系统设计，你可以潜在地制造一个自我维持的循环。即使在没有阳光的情况下，你也可以用化学燃料的形式储存能量。你可以把氢气和氧气产品放在不同的油箱里，并加入另一个模块，比如燃料电池，将这些燃料重新转化为电能。\n研究人员表示，他们将继续改进封装技术以及太阳能本身，以提高模块的效率。更多信息：贾亮等，一种面向太阳能驱动的低成本和高效率的集成装置，ACS Nano(2020)。网址：10.1021/acsnano.9b09053", "note_en": "Rice University researchers have created an efficient, low-cost device that splits water to produce hydrogen fuel.    The platform developed by the Brown School of Engineering lab of Rice materials scientist Jun Lou integrates catalytic electrodes and   that, when triggered by sunlight, produce electricity. The current flows to the catalysts that turn water into hydrogen and oxygen, with a sunlight-to-hydrogen efficiency as high as 6.7%.\n  This sort of catalysis isn&#39;t new, but the lab packaged a   layer and the electrodes into a single module that, when dropped into water and placed in sunlight, produces hydrogen with no further input.\n  The   introduced by Lou, lead author and Rice postdoctoral fellow Jia Liang and their colleagues in the American Chemical Society journal  ACS Nano is a self-sustaining producer of   that, they say, should be simple to produce in bulk.\n  &#34;The concept is broadly similar to an artificial leaf,&#34; Lou said. &#34;What we have is an integrated module that turns sunlight into electricity that drives an electrochemical reaction. It utilizes water and sunlight to get chemical fuels.&#34;\n  Perovskites are crystals with cubelike lattices that are known to harvest light. The most efficient perovskite   produced so far achieve an efficiency above 25%, but the materials are expensive and tend to be stressed by light, humidity and heat.\n  &#34;Jia has replaced the more expensive components, like platinum, in perovskite solar cells with alternatives like carbon,&#34; Lou said. &#34;That lowers the entry barrier for commercial adoption. Integrated devices like this are promising because they create a system that is sustainable. This does not require any external power to keep the module running.&#34;\n  Liang said the key component may not be the perovskite but the polymer that encapsulates it, protecting the module and allowing to be immersed for long periods. &#34;Others have developed catalytic systems that connect the solar cell outside the water to immersed electrodes with a wire,&#34; he said. &#34;We simplify the system by encapsulating the perovskite layer with a Surlyn (polymer) film.&#34;\n  The patterned film allows sunlight to reach the solar cell while protecting it and serves as an insulator between the cells and the electrodes, Liang said.\n  &#34;With a clever system design, you can potentially make a self-sustaining loop,&#34; Lou said. &#34;Even when there&#39;s no sunlight, you can use stored energy in the form of chemical fuel. You can put the hydrogen and oxygen products in separate tanks and incorporate another module like a fuel cell to turn those fuels back into electricity.&#34;\n  The researchers said they will continue to improve the encapsulation technique as well as the solar   themselves to raise the efficiency of the modules.        More information:\t\t\t\t\t\t\t\t\t\t\t\tJia Liang et al, A Low-Cost and High-Efficiency Integrated Device toward Solar-Driven Water Splitting,  ACS Nano (2020).  DOI: 10.1021/acsnano.9b09053", "posttime": "2020-05-06 02:30:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "叶子,leaf,阳光,sunlight", "title": "“人造叶子”概念启发了太阳能燃料生产的研究", "title_en": "'Artificial leaf' concept inspires research into solar-powered fuel production", "transed": 1, "url": "https://phys.org/news/2020-05-water-splitting-module-source-perpetual-energy.html", "via": "", "real_tags": ["叶子", "leaf", "阳光", "sunlight"]}, {"category": "", "categoryclass": "", "imagename": "6db21dab327bbcfaf519f0c3c9d3a71b.jpg", "infoid": 1000798, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的6周里，我们看到了空前数量的人想要搬出旧金山湾区，而几乎没有人想要搬到这个地区。\n风险投资放缓，以及初创企业和科技公司的大规模裁员，可能是推动净移民模式急剧转变的一些主要因素。\n在涉及旧金山湾区的大约1200次移动搜索中，近90%是关于出境搬迁的。洛杉矶和奥斯汀是最受欢迎的目的地之一。\n相比之下，在去年同期，我们的搬家成本计算器上有980次涉及旧金山湾区的搬家搜索。在这980个请求中，57%是向外迁移，43%是向旧金山湾区迁移。这对于任何一个大城市来说都是典型的，因为在任何给定的时间都有很多人进进出出。\n但我们目前看到的是，令人难以置信的是，涉及旧金山湾区的搬家搜索中，90%是目前希望离开的居民，只有10%的人希望搬进该地区。这与去年的情况截然不同。\n旧金山湾区有着复杂的迁徙历史，所以很难说到底是什么推动了这一变化。最近，我们还观察到纽约等其他大城市的搬迁请求发生了变化。\n但该地区最终可能会经历人口减少的原因有很多：\n虽然长期净移民趋势需要数年时间才能衡量，但这一早期数据确实表明，离开旧金山湾区的居民大幅加速。这是我们一定会密切关注的趋势。", "note_en": "Over the past 6 weeks, we’ve seen an unprecedented number of people looking to relocate out of the  Bay Area, and almost no one looking to move into the region.\n  The slow down in VC funding, as well as massive layoffs at startups and tech companies, could be some of the major factors driving this sharp shift in net migration patterns.\n  Out of roughly 1,200 moving searches involving the Bay Area,  almost 90% have been for outbound relocations. Los Angeles and Austin were among the most popular destinations.\n  To put this into perspective, during the same period last year, there were 980 move searches involving the Bay Area on our  moving cost calculator. Of those 980 requests, 57% were for outbound moves and 43% were for moves into the Bay Area. This is typical for any major city that has a lot of people coming in and out at any given time.\n  But what we’re currently seeing is an incredible 90% of move searches involving the Bay Area are current residents looking to leave and only 10% are people looking to move into the region. That’s a very different picture from just last year.\n      The Bay Area has a  complicated migration history, so it’s hard to say precisely what’s driving the change. We’ve also observed changes in relocation requests out of other major cities like  New York recently.\n  But there are many reasons why the region could finally be experiencing a shrinking population:\n    While long term net migration trends take years to measure, this early data does suggest a major acceleration in residents leaving the Bay Area. This is a trend we will certainly be keeping an eye on.", "posttime": "2020-05-06 02:18:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "旧金山,速度,francisco,趋势,major", "title": "旧金山居民正以前所未有的速度离开", "title_en": "San Francisco Residents Are Leaving at an Unprecedented Rate", "transed": 1, "url": "https://www.movebuddha.com/blog/sf-outbound-surge-2020/", "via": "", "real_tags": ["旧金山", "速度", "francisco", "趋势", "major"]}, {"category": "", "categoryclass": "", "imagename": "99f2a4867840879bbc756f59cbd839ff.jpg", "infoid": 1000795, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自2019年10月以来，Facebook及其子公司WhatsApp一直与以色列间谍软件公司NSO Group在法庭上争执不下，声称该公司利用WhatsApp为间谍软件分发提供便利。虽然尚未得出结论，但此案提出了关于NSO集团和用户隐私状况的有趣概念。但没关系，这家臭名昭著的恶意软件供应商现在正在销售一款冠状病毒跟踪应用程序。想必跟间谍业务没什么关系。\n在这篇文章中，我们简要介绍了WhatsApp黑客案件以及NSO集团在其中所扮演的角色，查看了这家间谍软件公司的冠状病毒应用程序，并指出了一些对此问题的担忧。\n2019年10月29日，WhatsApp发布了一份声明，通知用户团队在2019年5月早些时候阻止了一次网络攻击。在声明中，WhatsApp将此次攻击归咎于NSO集团，这是一家向全球各国政府和“授权机构”出售间谍软件的以色列公司。这家信使及其母公司Facebook也对NSO集团提起了诉讼。\n根据WhatsApp的研究，信使的视频通话服务被利用，将恶意代码植入用户的移动设备。大约1400名用户成为这次攻击的目标。原来，这些用户中有记者、人权活动家和持不同政见者。\n在攻击过程中，这些用户收到会用间谍软件感染设备的语音电话。目标甚至不需要接电话。有问题的间谍软件是Pegasus，这是NSO集团开发和销售的旗舰解决方案。进入Android或iOS设备后，Pegasus可以发回密码、联系人、消息和日历，还可以使用相机、麦克风和GPS传感器获取更多信息。\n复杂的法庭案件仍在进行中。脸书和WhatsApp声称，NSO集团违反了“信使服务条款”、“计算机欺诈和滥用法”以及с的其他法律。作为回报，NSO集团表示，他们与此次攻击及其客户使用软件的方式无关。\n“我们的产品用于制止恐怖主义、遏制暴力犯罪和拯救生命。NSO集团并不为其客户运营Pegasus软件，“该公司告诉”卫报“(The Guardian)。\n让此案变得棘手的是，WhatsApp在技术上并没有被黑客攻击，而是被利用来侵入用户的设备。\n它变得更时髦了。2020年4月30日，Facebook请求法院取消代表NSO集团的King&amp；Spalding律师事务所的资格。他们争辩说可能存在利益冲突。由于该公司此前曾在另一起案件中代表WhatsApp，他们可能获得了一些知识，这将使他们获得不公平的优势。本案涉及司法部破解WhatsApp加密的努力，而King&amp；Spalding正在保护加密不受政府攻击。\n有趣的是，当时负责此案的King&Amp；Spalding律师事务所的律师是现任联邦调查局局长克里斯托弗·雷(Christopher Wray)。如今，他是科技公司引入的强加密的反对者。\n无论结果如何，与Facebook的法律战给NSO集团及其在间谍软件业务方面取得的成就带来了大量媒体关注。这一点恰好特别重要，因为该公司现在正在推动一项新的大产品。\n一家利用其全部技术和知识通过销售间谍软件赚取收入的公司，将处于开发冠状病毒跟踪IT解决方案的完美地位。至少在使用恶意软件提供商制造的良性跟踪应用程序的前提真正深入人心之前，情况似乎是这样的。\nNSO集团正在销售一种代号为Fleming的软件解决方案，该解决方案旨在根据手机数据监控和预测病毒的传播。该公司向世界各地的政府推销，声称一些国家已经在测试该软件。\n据报道，Fleming使用改编版本的用户界面和分析工具，旨在补充NSO集团制造的臭名昭著的恶意软件Pegasus。该公司声称，它不会访问任何信息，这款应用程序也不会收集地理位置数据。政府客户将不得不走老路，要求当地移动电话运营商分享他们的记录。\n“这是一家臭名昭著的间谍软件公司扩展到大规模监控领域的一次极其愤世嫉俗的尝试。世界上的每个公民都希望尽快恢复正常。对监控技术的淘金热很容易意味着人们对隐私的正常期望，我们将很难回到那里，“公民实验室的高级研究员约翰·斯科特-雷顿(John Scott-rayton)告诉主板。\nNSO集团参与拯救世界免于流感大流行的大胆决定引发了许多问题，可能至少也有一些人表示怀疑。需要重申的是，该公司卷入了许多争议，因为其Pegasus间谍软件已被全球各国政府广泛使用，以瞄准不想要的人。即使NSO集团说的是真的，他们的意图是好的，也没有太多理由相信他们的客户会表现出来，因为他们过去显然不会这样做。\n“上一次社区传播这种流行病的病例已经过去很久了，我担心的是，像NSO这样的无良公司正在推销的这些监控机制将继续留在我们的网络上，继续跟踪我们的手机。这是一个我们可以防止的反乌托邦结果，“约翰·斯科特-雷顿补充道。\n考虑到这种有争议的情况，NSO集团的跟踪应用程序的故事造成了一个更大的问题。\n根据研究，大约41%的美国成年人既有技术能力也有使用病毒跟踪应用的意愿。了解到其中一些应用程序是由为政府配备左右间谍软件的公司开发的，这对全球的努力没有丝毫帮助。还有一个事实是，一些政府非常渴望滥用他们强有力的监测工具，无论是否流行。\n似乎有理由认为，一个旨在跟踪大流行传播的应用程序必须被无处不在地使用才能正常工作。当一半的人口仍然是未知变量时，这种跟踪的有效性是值得怀疑的。\n然后就是一个很大的两难境地。现在看来，全世界都可以利用一切帮助来控制疫情和经济，而追踪病毒传播的手段可能会非常有帮助。但要付出巨大的代价，因为在健康危机之后很长一段时间里，额外的监测可能会继续存在。\n在Twitter和Facebook上关注我们，加入我们的电报频道，了解加密是怎么回事，为什么它很重要。", "note_en": "Since October 2019, Facebook and it’s subsidiary WhatsApp have been fighting in court with an Israeli spyware firm NSO Group, claiming that the firm used WhatsApp to facilitate spyware distribution. Although the conclusion is yet to be reached, the case brought up interesting notions about NSO Group and the situation with users’ privacy. But nevermind that, the notorious malware vendor is now selling a COVID-19 tracking app. Nothing of that spying business, presumably.\n  In this piece, we give a rundown on the WhatsApp hacking case and the role of NSO Group in it, look at the spyware firm’s COVID-19 app and point out a few concerns about it all.\n  On October 29th, 2019, WhatsApp published a  statement informing the users about a cyberattack the team stopped earlier in May 2019. In the statement, WhatsApp attributed the attack to  NSO Group, an Israeli firm that sells spyware to governments and “authorized agencies” around the globe. The messenger and its parent Facebook have also filed a  lawsuit against NSO Group.\n According to WhatsApp’s research, the messenger’s video call service was exploited to implant malicious code into the user’s mobile devices. Around 1,400 users were targeted by the attack. It  turned out that among these users were journalists, human rights activists, and dissidents.\n Over the course of the attack, these users received voice calls that would infect the device with spyware. The targets didn’t even have to pick up the call. The spyware in question is Pegasus, a flagship solution developed and sold by NSO Group. After getting onto an Android or iOS device, Pegasus was able to send back passwords, contacts, messages, and calendars, as well as use cameras, microphones, and GPS sensors to get additional information.\n The complicated court case is still unfolding. Facebook and WhatsApp  claim that NSO Group violated the messenger’s Terms of Service, the Computer Fraud and Abuse Act, and сertain other laws. In return, NSO Group  said that they had nothing to do with the attack and the ways their clients use the software.\n “Our products are used to stop terrorism, curb violent crime, and save lives. NSO Group does not operate the Pegasus software for its clients,”  the company told The Guardian.\n What makes the case tricky is the fact that WhatsApp wasn’t technically hacked, but exploited to hack into user’s devices.\n It gets funkier. On April 30th, 2020, Facebook  asked the court to disqualify the law firm King &amp; Spalding representing NSO Group. The argued that there may be a conflict of interest. Since the firm had previously represented WhatsApp in another case, they may have gained knowledge that would give them an unfair advantage. The case in question had to do with the Department of Justice’s efforts to break through WhatsApp’s encryption, and King &amp; Spalding were protecting the encryption against the government.\n Interestingly enough, at that time, the lawyer at King &amp; Spalding who worked on the case  was Christopher Wray, the current director of the FBI. Nowadays, he is an opponent of strong encryption introduced by tech companies.\n Regardless of the outcome, the legal fight with Facebook brought a lot of media attention to NSO Group and its  achievements in the spyware business. This happened to be especially important, as the company now pushes a new big product.\n  A company that makes revenue from selling spyware with all its tech and knowledge would be in a perfect position to develop an IT-solution for COVID-19 tracking. Or so it may seem until the premise of using a benign tracking app made by a malware provider really sinks in.\n NSO Group is  selling a software solution ambitiously codenamed   Fleming, which is meant to monitor and project the spread of the virus based on mobile phone data. The company pitches governments around the world claiming that some countries are already testing the software.\n Reportedly,  Fleming uses adapted versions of the user interface and analytical tool that were designed to complement Pegasus, the notorious malware made by NSO Group. The company claimed that it won’t be accessing any information and the app won’t be collecting geolocation data. The government clients will have to go the old-fashioned way and ask local mobile phone operators to share their records.\n “This is an extremely cynical attempt from a notorious spyware company to branch out into mass surveillance. Every citizen of the world wants to go back to normal as soon as possible. The gold rush to surveillance technology could easily mean that there is a normal expectation of privacy that we will have a hard time going back to,”  John Scott-Railton, a senior researcher at the Citizen Lab,   told  the Motherboard.\n NSO Group’s bold decision to take part in saving the world from the pandemic raised a lot of questions and probably at least a few eyebrows. To reiterate, the company is involved in numerous controversies, as its Pegasus spyware has been used extensively by governments around the globe to target unwanted people. Even if what NSO Group says is true and their intentions are good, there aren’t many reasons to believe that their clients will behave, as they clearly haven’t in the past.\n “Long after the last community transmitted case of this pandemic, my fear is that these surveillance mechanisms that are being pitched by unscrupulous companies like NSO will stay on our networks and continue to track our phones. This is one dystopian outcome that we can prevent,”  John Scott-Railton added.\n  Given the controversial circumstances, the story with NSO Group’s tracking app contributes to a much larger problem.\n According to  research, about 41% of American adults have both the technical capacity and the willingness to use a virus-tracking app. Learning that some of these apps are made by companies that equip governments with spyware left and right will not help the global effort in the slightest. And then there’s the fact that some governments are very eager to misuse their potent surveillance tools, pandemic or not.\n It appears reasonable to assume that an app meant to track the spread of a pandemic has to be used ubiquitously to work properly. When half of the population remains an unknown variable, the usefulness of such tracking is dubious.\n And then there’s the big dilemma. It looks like right now the world could use every bit of help to get the pandemic and the economy under control and the means to track the spread of the virus could’ve been very helpful. But there is a substantial price to pay, as extra surveillance is likely to remain in place long after the health crisis.\n Follow us on   Twitter  and   Facebook  and join our   Telegram channel  to know what’s up with crypto and why it’s important.", "posttime": "2020-05-06 02:05:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,病毒,冠状病毒,间谍,spyware", "title": "臭名昭著的间谍软件供应商推出冠状病毒跟踪解决方案", "title_en": "Notorious Spyware Vendor Pushes Covid-19 Tracking Solution", "transed": 1, "url": "https://forklog.media/notorious-spyware-vendor-pushes-covid-19-tracking-solution/", "via": "", "real_tags": ["软件", "病毒", "冠状病毒", "间谍", "spyware"]}, {"category": "", "categoryclass": "", "imagename": "c33a589f1243651c8ee9b454432af4ea.png", "infoid": 1000794, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转以搜索X窗口系统(X11，或简称X)是位图显示的窗口系统，在类Unix操作系统上很常见。\nX提供了GUI环境的基本框架：在显示设备上绘制和移动窗口，以及与鼠标和键盘交互。X不强制使用用户界面-这是由单独的程序处理的。因此，基于X的环境的视觉样式差异很大；不同的程序可能呈现完全不同的界面。\nX起源于1984年麻省理工学院(MIT)的雅典娜项目。[1][需要更好的来源]X协议自1987年9月以来一直处于版本11(因此&#34；X11&34；)。X.Org基金会领导了X项目，目前的参考实现是X.Org Server，根据麻省理工学院的许可和类似的许可许可，X.Org Server作为免费和开放源码软件提供。[2]。\nX是一个独立于体系结构的系统，用于远程图形用户界面和输入设备功能。使用联网终端的每个人都能够与任何类型的用户输入设备与显示器交互。\n在其标准发行版中，它是一个完整的、尽管简单的显示和界面解决方案，它提供了一个标准工具包和协议栈，用于在大多数类Unix操作系统和OpenVMS上构建图形用户界面，并且已经移植到许多其他当代通用操作系统上。\nX提供了用于构建这样的GUI环境的基本框架或原语：在显示器上绘制和移动窗口，以及与鼠标、键盘或触摸屏交互。X不强制使用用户界面；单个客户端程序处理这一点。程序可以在没有用户界面的情况下使用X的图形功能。因此，基于X的环境的视觉样式差异很大；不同的程序可能呈现完全不同的界面。\n与大多数早期的显示协议不同，X专门设计为在网络连接上使用，而不是在集成或连接的显示设备上使用。X具有网络透明性，这意味着在网络(如Internet)上的某台计算机上运行的X程序可以在网络上其他计算机上运行的X服务器上显示其用户界面。X服务器通常是X客户端的图形资源和键盘/鼠标事件的提供者，这意味着X服务器通常在人类用户面前运行在计算机上，而X客户端应用程序运行在网络上的任何地方，并与用户的计算机通信，以请求渲染图形内容并从包括键盘和鼠标的输入设备接收事件。\n术语服务器被应用于用户面前的软件的事实常常令习惯于他们的程序是远程计算机上的服务的客户端的用户感到惊讶。这里，不是远程数据库作为本地应用程序的资源，而是用户的图形显示和输入设备成为由本地X服务器提供给需要共享用户的图形和输入设备以与用户通信的本地和远程托管的X客户端程序的资源。\nX&#39；的网络协议基于X命令原语。此方法允许可能在不同计算机上运行的X客户端应用程序的2D和(通过GLX等扩展)3D操作仍可在X服务器的显示器上完全加速。例如，在经典的OpenGL(3.0版之前)中，包含大量对象的显示列表可以由远程X客户端程序完全构建并存储在X服务器中，然后通过在网络上发送单个glCallList(它)来呈现每个对象。\nX不提供对音频的原生支持；有几个项目可以填补这一空白，有些项目还提供透明的网络支持。\nX使用客户端-服务器模型：X服务器与各种客户端程序通信。服务器接受图形输出请求(Windows)并发回用户输入(从键盘、鼠标或触摸屏)。服务器可以作为以下功能运行：\n这种客户端-服务器术语-用户的终端是服务器，应用程序是客户端-经常会让新的X用户感到困惑，因为这两个术语看起来是相反的。但是X站在应用程序的角度，而不是从最终用户的角度：X向应用程序提供显示和I/O服务，因此它是服务器；应用程序使用这些服务，因此它们是客户端。\n服务器和客户端之间的通信协议是网络透明的：客户端和服务器可以运行在同一台机器上，也可以运行在不同的机器上，可能具有不同的体系结构和操作系统。客户端和服务器甚至可以通过在加密的网络会话上通过隧道传输连接来安全地在Internet上通信。\nX客户端本身可以通过向其他客户端提供显示服务来模拟X服务器。这称为X嵌套。Xnest和Xephyr等开源客户端支持这样的X嵌套。\n要在远程计算机上使用X客户端应用程序，用户可以执行以下操作：\n请求本地显示/输入服务(例如，如果未使用启用X转发的SSH，则导出显示=[用户的机器]：0)\n然后，远程X客户端应用程序将连接到用户的本地X服务器，为用户提供显示和输入。\n或者，本地机器可以运行连接到远程机器并启动客户端应用程序的小程序。\n使用客户端应用程序加入协作工作组中的大量其他终端用户。\n在远程计算机上运行计算密集型模拟，并在本地台式计算机上显示结果。\n在一台显示器、键盘和鼠标的控制下，同时在多台机器上运行图形软件。\n除非实现者没有新功能就无法完成真正的应用程序，否则不要添加新功能。\n决定一个制度不是什么和决定它是什么一样重要。不要满足世界上所有人的需求；相反，要使系统具有可扩展性，以便能够以向上兼容的方式满足其他需求。\n唯一比从一个例子中概括更糟糕的是从根本没有例子中概括。\n如果问题没有被完全理解，最好是根本不提供解决方案。\n如果您可以用10%的工作量获得90%的预期效果，那么使用更简单的解决方案。(另请参阅越差越好。)。\n提供机制而不是政策。特别是，将用户界面策略交到客户端手中。\n第一个原则在X11的设计过程中被修改为：不要添加新功能，除非您知道某些实际的应用程序会需要它。&#34；[3]。\nX在很大程度上遵守了这些原则。开发样本实施是为了扩展和改进实施，同时保持与原始1987年议定书的兼容。\nX主要定义协议和图形基元-它故意不包含应用程序用户界面设计的规范，如按钮、菜单或窗口标题栏样式。取而代之的是，应用软件-如窗口管理器、GUI小部件工具包和桌面环境，或者特定于应用的图形用户界面-定义并提供这样的细节。因此，没有典型的X界面，几种不同的桌面环境在用户中变得流行起来。\n窗口管理器控制应用程序窗口的位置和外观。这可能会导致桌面界面让人联想到Microsoft Windows或Apple Macintosh(示例包括GNOME 2、KDE、Xfce)，或者具有完全不同的控件(例如平铺窗口管理器，如wmii或Rattoxic)。一些界面，如Sugar或Chrome OS，完全避开了桌面的比喻，简化了专门应用程序的界面。窗口管理器的复杂性和复杂性从基本的窗口管理器(例如，TWM，随X提供的基本窗口管理器，或evilwm，一个极其轻量级的窗口管理器)到更全面的桌面环境(如启蒙)，甚至到用于垂直市场(如销售点)的特定于应用程序的窗口管理器，不一而足。\n许多用户在桌面环境中使用X，除了窗口管理器之外，桌面环境还包括使用一致用户界面的各种应用程序。流行的桌面环境包括GNOME、KDE软件编译和Xfce。UNIX 98标准环境是通用桌面环境(CDE)。freedesktop.org计划解决桌面与竞争对手X桌面所需组件之间的互操作性问题。\nX.Org实现是X的规范实现。由于自由许可，出现了许多变体，既有免费的，也有开源的，也有专有的。商业Unix供应商倾向于采用参考实现并使其适应其硬件，通常是对其进行定制并添加专有扩展。\n直到2004年，XFree86在类Unix免费系统上提供了最常见的X变体。XFree86最初是作为X到386兼容PC的端口，到20世纪90年代末，已经成为X技术创新的最大来源和X开发的事实标准。[4]然而，自2004年以来，XFree86的分支--X.Org服务器占据了主导地位。\n虽然将X与Unix相关联是很常见的，但X服务器也以本机方式存在于其他图形环境中。VMS Software Inc.的OpenVMS操作系统包括一个X版本，其标准桌面环境为通用桌面环境(CDE)，称为DECwindows。[需要引用]苹果最初以X11.app的形式将X移植到MacOS上，但为了支持XQuartz实现，这一做法遭到了抨击。在20世纪90年代苹果较旧的操作系统System7和MacOS8和9下的第三方服务器，包括苹果的MacX和白松软件(White Pine Software)的大量撤离。\nMicrosoft Windows未附带对X的支持，但存在许多第三方实现，如Cygwin/X等免费开源软件，以及Except、MKS X/Server、Reflect X、X-Win32和Xming等专有产品。\n还有X服务器的Java实现。WeirdX可以在任何支持Swing 1.1的平台上运行，并且可以作为小程序在大多数浏览器中运行。Android X Server是一个运行在Android设备上的开源Java实现。\n当具有本地窗口系统的操作系统另外托管X时，X系统可以在单独的主机窗口中使用其自己的普通桌面，或者它可以无根运行，这意味着X桌面被隐藏，并且主机窗口环境管理主机屏幕内托管的X窗口的几何形状和外观。\nX终端是只运行X服务器的瘦客户端。这种体系结构在构建便宜的终端公园方面变得流行起来，许多用户可以同时使用相同的大型计算机服务器作为每个用户的X终端的客户端来执行应用程序。这一用途非常符合麻省理工学院项目的初衷。\nX终端使用X显示管理器控制协议探索网络(本地广播域)，以生成允许作为客户端的可用主机列表。其中一台客户端主机应该运行X显示管理器。\nX终端和大多数瘦客户机的一个限制是，除了键盘、鼠标和显示器之外，它们不能进行任何输入或输出。假设所有相关数据仅存在于远程服务器上，并且X终端用户没有可用于从本地外围设备保存或加载数据的方法。\n专用(硬件)X终端已不再使用；配备X服务器的PC或现代瘦客户端通常以相同或更低的成本提供相同的功能。\nUnix-Hater手册(1994)花了整整一章来讨论X的问题。[5]Gajeska、Manasse和McCormack在1990年出版的“为什么X不是我们的理想窗口系统”详细说明了协议中存在的问题，并提出了改进建议。\n在X中缺乏设计指南导致了几个截然不同的界面，以及应用程序并不总是能很好地协同工作。客户端间通信约定手册(ICCCM)是客户端互操作性的规范，以难以正确实现而著称。进一步的标准努力，如Motif和CDE，并没有缓解问题。这让用户和程序员感到沮丧。[6]图形程序员现在通常通过编码到特定桌面环境或特定窗口小部件工具包来解决应用程序外观和通信的一致性问题，这也避免了必须直接与ICCCM打交道。\nX还缺乏对X服务器上用户定义的存储过程的本机支持，这与新闻报道的方式不同-没有图灵完整的脚本工具。因此，各种桌面环境可以提供它们自己的(通常是相互不兼容的)设施。\n基于X构建的系统可能存在可访问性问题，这会使残疾用户难以使用计算机，包括右键单击、双击、中键单击、鼠标悬停和焦点窃取。一些X11客户端比其他客户端更好地处理可访问性问题，因此有可访问性问题的人不会被排除在使用X11之外。但是，X11没有可访问性标准或可访问性指南。在X11标准过程中，没有关于可访问性的工作组，但是，软件项目正在解决可访问性需求，以便在X之上提供这些功能。\nOrca项目向X Window系统添加了可访问性支持，包括实现API(AT-SPI[7])。这与GNOME的ATK结合在一起，允许使用GNOME/GTK API在X程序中实现辅助功能。[8]KDE提供了一套不同的辅助功能软件，包括文本到语音转换器和屏幕放大镜。[9]其他主要台式机(LXDE、XFCE和启迪)都试图与ATK兼容。\nX客户机通常不能从一台服务器分离并重新连接到另一台服务器，除非它的代码专门为它提供了支持(Emacs是少数几个具有此功能的常见程序之一)。因此，将整个会话从一台X服务器移到另一台服务器通常是不可能的。然而，像虚拟网络计算(VNC)、NX和Xpra这样的方法允许从不同的X服务器到达虚拟会话(以类似于终端的GNU屏幕的方式)，并且其他应用程序和工具包提供相关的工具。[10]还存在x11vnc(VNC：0观众)、Xpra的影子模式和NX#39；的nxagent影子模式等解决办法，以使当前的X-server屏幕可用。此功能允许将正在运行的应用程序的用户界面(鼠标、键盘、监视器)从一个位置切换到另一个位置，而无需停止和重新启动该应用程序。\n默认情况下，X服务器和远程X客户端之间的网络流量不加密。拥有数据包嗅探器的攻击者可以拦截它，从而可以查看显示到用户屏幕或从用户屏幕发送的任何内容。加密X流量的最常见方法是建立用于通信的安全外壳(SSH)隧道。\n与所有瘦客户端一样，当在网络中使用X时，带宽限制可能会阻碍位图密集型应用程序的使用，这些应用程序需要以低延迟快速更新大部分屏幕，例如3D动画或照片编辑。即使是相对较小的未压缩的640x480x24Mbit 30Fps视频流(~211 Mbit/s)也可以轻松超过单个客户端100Mbit/s网络的带宽。相比之下，现代版本的X通常具有诸如MESA之类的扩展，该扩展允许本地程序的图形的本地显示被优化以绕过网络模型并直接控制视频卡，以使用全屏视频、渲染的3D应用程序和其他此类应用程序。\nX&#39；的设计要求客户端和服务器分开操作，而设备独立性和客户端和服务器的分离会产生开销。大部分开销来自客户端和服务器之间的网络往返延迟时间(延迟)，而不是协议本身：性能问题的最佳解决方案取决于高效的应用程序设计。[11]对X的一种常见批评是，如果仅在本地使用，其网络功能会导致过度复杂和性能下降。\n现代X实现使用Unix域套接字在同一主机上进行高效连接。此外，可以使用共享内存(通过MIT-SHM扩展)来实现更快的客户端-服务器通信。[12]但是，程序员仍必须显式激活和使用共享内存扩展。还需要提供后备路径，以便与较旧的实现保持兼容，并与非本地X服务器通信。\n有些人曾试图编写X的替代方案和替代方案。历史上的替代方案包括Sun的新闻和Next的Display PostScript，这两个基于PostScript的系统都支持用户可定义的显示端过程，这是X所缺乏的。目前的替代方案包括：\nMacOS(和它的移动同行iOS)实现了它的Windows系统，也就是众所周知的Quartz。当苹果公司(Apple Inc.)。购买NeXT，并使用NeXTSTEP构建MacOSX，它用Quartz取代了Display PostScript。Quartz的作者之一Mike Paquette解释说，如果苹果在X11中增加了对它想要包括的所有功能的支持，它就不会与X11有太多相似之处，也不会与其他服务器兼容。[13]。\n在Linux内核上运行的Android使用自己的系统来绘制称为SurfaceFlinger的用户界面。3D渲染由EGL处理。\nWayland正在由几个X.Org开发人员开发，作为X的潜在替代品。它通过DRI直接与GPU硬件一起工作。Wayland可以将X.org服务器作为客户端运行，这可以是无根的。[14]2013年完成了Raspberry Pi的Wayland后端的专有端口。[15]该项目于2012年达到1.0版。和Android一样，Wayland也是基于EGL的。\nMIR是Canonical Ltd.的一个项目，目标与Wayland类似。[16]MIR旨在与使用ARM芯片组的移动设备(明确的目标是与Android设备驱动程序兼容)以及x86台式机一起使用。和Android一样，Mir/UnityNext也是基于EGL的。与X客户端应用程序的向后兼容是通过Xmir实现的。\n其他替代方案试图通过直接使用硬件来避免X的开销；这样的项目包括DirectFB。[17](旨在为帧缓冲区提供可靠内核级接口的直接渲染基础设施(DRI)可能会[需要引用]使这些工作变得多余。)。\n通过图形服务的网络传输性，实现X的网络透明性功能形式的其他方式包括：\n虚拟网络计算(VNC)，这是一个非常低级的系统，它通过网络发送压缩的位图；Unix实现包括一个X服务器。\n远程桌面协议(RDP)，目的类似于VNC，但在移植到类Unix系统之前起源于Microsoft Windows；参见NX、GoToMyPC等。\n在X之前有几个位图显示系统。施乐推出了Alto(1973)和Star(1981)。阿波罗计算机公司推出了“显示经理”(1981)。苹果推出了丽莎(Lisa)(1983年)和麦金塔(Macintosh)(1984年)。Unix世界有安德鲁项目(1982)和罗伯·派克的Blit终端(1982)。\n卡内基梅隆大学制作了一款远程访问应用程序。\n..", "note_en": "Jump to navigation  Jump to search  The  X Window System ( X11, or simply  X) is a  windowing system for  bitmap displays, common on  Unix-like  operating systems.\n X provides the basic  framework for a  GUI environment: drawing and moving  windows on the  display device and interacting with a  mouse and  keyboard. X does not mandate the user interface – this is handled by individual programs. As such, the visual styling of X-based environments varies greatly; different programs may present radically different interfaces.\n X originated at the  Project Athena at  Massachusetts Institute of Technology (MIT) in 1984.  [1] [   better source needed] The  X protocol has been at version 11 (hence &#34;X11&#34;) since September 1987. The  X.Org Foundation leads the X project, with the current reference implementation,  X.Org Server, available as  free and open source software under the  MIT License and similar  permissive licenses.  [2]\n   X is an architecture-independent system for remote graphical user interfaces and input device capabilities. Each person using a networked  terminal has the ability to interact with the display with any type of user input device.\n In its standard distribution it is a complete, albeit simple, display and interface solution which delivers a standard  toolkit and  protocol stack for building graphical user interfaces on most  Unix-like operating systems and  OpenVMS, and has been  ported to many other contemporary general purpose  operating systems.\n X provides the basic  framework, or primitives, for building such GUI environments: drawing and moving  windows on the  display and interacting with a mouse, keyboard or touchscreen. X does not mandate the  user interface; individual client programs handle this. Programs may use X&#39;s graphical abilities with no user interface. As such, the visual styling of X-based environments varies greatly; different programs may present radically different interfaces.\n Unlike most earlier display protocols, X was specifically designed to be used over network connections rather than on an integral or attached display device. X features  network transparency, which means an X program running on a computer somewhere on a network (such as the Internet) can display its user interface on an X server running on some other computer on the network. The X server is typically the provider of graphics resources and keyboard/mouse events to X  clients, meaning that the X server is usually running on the computer in front of a human user, while the X client applications run anywhere on the network and communicate with the user&#39;s computer to request the rendering of graphics content and receive events from input devices including keyboards and mice.\n The fact that the term &#34;server&#34; is applied to the software in front of the user is often surprising to users accustomed to their programs being clients to services on remote computers. Here, rather than a remote database being the resource for a local app, the user&#39;s graphic display and input devices become resources made available by the local X server to both local and remotely hosted X client programs who need to share the user&#39;s graphics and input devices to communicate with the user.\n X&#39;s network protocol is based on X command primitives. This approach allows both 2D and (through extensions like GLX) 3D operations by an X client application which might be running on a different computer to still be fully accelerated on the X server&#39;s display. For example, in classic OpenGL (before version 3.0), display lists containing large numbers of objects could be constructed and stored entirely in the X server by a remote X client program, and each then rendered by sending a single glCallList(which) across the network.\n X provides no native support for audio; several projects exist to fill this niche, some also providing  transparent network support.\n    X uses a  client–server model: an X server communicates with various  client programs. The server accepts requests for graphical output (windows) and sends back user input (from keyboard, mouse, or touchscreen). The server may function as:\n  This client–server terminology – the user&#39;s terminal being the server and the applications being the clients – often confuses new X users, because the terms appear reversed. But X takes the perspective of the application, rather than that of the end-user: X provides display and I/O services to applications, so it is a server; applications use these services, thus they are clients.\n The  communication protocol between server and client operates  network-transparently: the client and server may run on the same machine or on different ones, possibly with different  architectures and  operating systems. A client and server can even communicate  securely over the Internet by  tunneling the connection over an  encrypted network session.\n An X client itself may emulate an X server by providing display services to other clients. This is known as &#34;X nesting&#34;. Open-source clients such as  Xnest and  Xephyr support such X nesting.\n To use an X client application on a remote machine, the user may do the following:\n request local display/input service (e.g.,  export DISPLAY= [user&#39;s machine]:0 if not using SSH with X forwarding enabled)\n The remote X client application will then make a connection to the user&#39;s local X server, providing display and input to the user.\n Alternatively, the local machine may run a small program that connects to the remote machine and starts the client application.\n  using a client application to join with large numbers of other terminal users in collaborative workgroups\n running a computationally intensive simulation on a remote machine and displaying the results on a local desktop machine\n running graphical software on several machines at once, controlled by a single display, keyboard and mouse\n   Do not add new functionality unless an implementor cannot complete a real application without it.\n It is as important to decide what a system is not as to decide what it is. Do not serve all the world&#39;s needs; rather, make the system  extensible so that additional needs can be met in an upwardly compatible fashion.\n The only thing worse than generalizing from one example is generalizing from no examples at all.\n If a problem is not completely understood, it is probably best to provide no solution at all.\n If you can get 90 percent of the desired effect for 10 percent of the work, use the simpler solution. (See also  worse is better.)\n  Provide  mechanism rather than policy. In particular, place user interface policy in the clients&#39; hands.\n The first principle was modified during the design of X11 to:  &#34;Do not add new functionality unless you know of some real application that will require it.&#34;  [3]\n X has largely kept to these principles. The sample implementation is developed with a view to extension and improvement of the implementation, while remaining compatible with the original 1987 protocol.\n    X primarily defines protocol and graphics primitives – it deliberately contains no specification for application  user-interface design, such as  button,  menu, or window  title-bar styles. Instead, application software – such as  window managers, GUI  widget toolkits and  desktop environments, or application-specific  graphical user interfaces – define and provide such details. As a result, there is no  typical X interface and several different desktop environments have become popular among users.\n A window manager controls the placement and appearance of application windows. This may result in desktop interfaces reminiscent of those of  Microsoft Windows or of the Apple  Macintosh (examples include  GNOME 2,  KDE,  Xfce) or have radically different controls (such as a  tiling window manager, like  wmii or  Ratpoison). Some interfaces such as  Sugar or  Chrome OS eschew the  desktop metaphor altogether, simplifying their interfaces for specialized applications. Window managers range in sophistication and complexity from the bare-bones ( e.g.,  twm, the basic window manager supplied with X, or evilwm, an extremely light window-manager) to the more comprehensive desktop environments such as  Enlightenment and even to application-specific window-managers for vertical markets such as point-of-sale.\n Many users use X with a desktop environment, which, aside from the window manager, includes various applications using a consistent user-interface. Popular desktop environments include GNOME, KDE Software Compilation and Xfce. The  UNIX 98 standard environment is the  Common Desktop Environment (CDE). The  freedesktop.org initiative addresses interoperability between desktops and the components needed for a competitive X desktop.\n  The  X.Org implementation is the  canonical implementation of X. Owing to liberal  licensing, a number of variations, both  free and open source and  proprietary, have appeared. Commercial Unix vendors have tended to take the reference implementation and adapt it for their hardware, usually customizing it and adding proprietary extensions.\n Up until 2004,  XFree86 provided the most common X variant on free  Unix-like systems. XFree86 started as a  port of X to  386-compatible PCs and, by the end of the 1990s, had become the greatest source of technical innovation in X and the  de facto standard of X development.  [4] Since 2004, however, the  X.Org Server, a  fork of XFree86, has become predominant.\n While it is common to associate X with Unix, X servers also exist natively within other graphical environments. VMS Software Inc.&#39;s  OpenVMS operating system includes a version of X with  Common Desktop Environment (CDE), known as  DECwindows, as its standard desktop environment. [   citation needed]  Apple originally ported X to  macOS in the form of X11.app, but that has been deprecated in favor of the  XQuartz implementation. Third-party servers under Apple&#39;s older operating systems in the 1990s, System 7, and Mac OS 8 and 9, included Apple&#39;s  MacX and White Pine Software&#39;s eXodus.\n Microsoft Windows is not shipped with support for X, but many third-party implementations exist, as  free and open source software such as  Cygwin/X, and proprietary products such as  Exceed,  MKS X/Server,  Reflection X,  X-Win32 and  Xming.\n There are also  Java implementations of X servers. WeirdX runs on any platform supporting  Swing 1.1, and will run as an applet within most  browsers. The  Android X Server is an open source Java implementation that runs on  Android devices.\n When an operating system with a native windowing system hosts X in addition, the X system can either use its own normal desktop in a separate host window or it can run  rootless, meaning the X desktop is hidden and the host windowing environment manages the geometry and appearance of the hosted X windows within the host screen.\n    An  X terminal is a  thin client that only runs an X server. This architecture became popular for building inexpensive terminal parks for many users to simultaneously use the same large computer server to execute application programs as clients of each user&#39;s X terminal. This use is very much aligned with the original intention of the MIT project.\n X terminals explore the network (the local  broadcast domain) using the  X Display Manager Control Protocol to generate a list of available hosts that are allowed as clients. One of the client hosts should run an  X display manager.\n A limitation of X terminals and most thin clients is that they are not capable of any input or output other than the keyboard, mouse, and display. All relevant data is assumed to exist solely on the remote server, and the X terminal user has no methods available to save or load data from a local  peripheral device.\n Dedicated (hardware) X terminals have fallen out of use; a  PC or modern  thin client with an X server typically provides the same functionality at the same, or lower, cost.\n   The Unix-Haters Handbook (1994) devoted a full chapter to the problems of X.  [5]  Why X Is Not Our Ideal Window System (1990) by Gajewska, Manasse and McCormack detailed problems in the protocol with recommendations for improvement.\n  The lack of design guidelines in X has resulted in several vastly different interfaces, and in applications that have not always worked well together. The  Inter-Client Communication Conventions Manual (ICCCM), a specification for client interoperability, has a reputation for being difficult to implement correctly. Further standards efforts such as  Motif and  CDE did not alleviate problems. This has frustrated users and programmers.  [6] Graphics programmers now generally address consistency of application  look and feel and communication by coding to a specific desktop environment or to a specific widget toolkit, which also avoids having to deal directly with the ICCCM.\n X also lacks native support for user-defined stored procedures on the X server, in the manner of  NeWS – there is no  Turing-complete scripting facility. Various desktop environments may thus offer their own (usually mutually incompatible) facilities.\n  Systems built upon X may have  accessibility issues that make utilization of a computer difficult for disabled users, including  right click,  double click,  middle click,  mouse-over, and  focus stealing. Some X11 clients deal with accessibility issues better than others, so persons with accessibility problems are not locked out of using X11. However, there is no accessibility standard or accessibility guidelines for X11. Within the X11 standards process there is no working group on accessibility, however, accessibility needs are being addressed by software projects to provide these features on top of X.\n The  Orca project adds accessibility support to the X Window System, including implementing an API ( AT-SPI  [7]). This is coupled with GNOME&#39;s  ATK to allow for accessibility features to be implemented in X programs using the GNOME/GTK APIs.  [8] KDE provides a different set of accessibility software, including a text-to-speech converter and a screen magnifier.  [9] The other major desktops (LXDE, Xfce and Enlightenment) attempt to be compatible with ATK.\n   An X client cannot generally be detached from one server and reattached to another unless its code specifically provides for it ( Emacs is one of the few common programs with this ability). As such, moving an entire session from one X server to another is generally not possible. However, approaches like  Virtual Network Computing (VNC),  NX and  Xpra allow a virtual session to be reached from different X servers (in a manner similar to  GNU Screen in relation to terminals), and other applications and toolkits provide related facilities.  [10]Workarounds like  x11vnc ( VNC :0 viewers), Xpra&#39;s shadow mode and NX&#39;s nxagent shadow mode also exist to make the current X-server screen available. This ability allows the user interface (mouse, keyboard, monitor) of a running application to be switched from one location to another without stopping and restarting the application.\n Network traffic between an X server and remote X clients is not encrypted by default. An attacker with a  packet sniffer can intercept it, making it possible to view anything displayed to or sent from the user&#39;s screen. The most common way to encrypt X traffic is to establish a  Secure Shell (SSH) tunnel for communication.\n Like all  thin clients, when using X across a network,  bandwidth limitations can impede the use of  bitmap-intensive applications that require rapidly updating large portions of the screen with low latency, such as 3D animation or photo editing. Even a relatively small  uncompressed 640x480x24 bit 30 fps video stream (~211 Mbit/s) can easily outstrip the bandwidth of a 100 Mbit/s network for a single client. In contrast, modern versions of X generally have extensions such as  MESA allowing local display of a local program&#39;s graphics to be optimized to bypass the network model and directly control the video card, for use of full-screen video, rendered 3D applications, and other such applications.\n  X&#39;s design requires the clients and server to operate separately, and device independence and the separation of client and server incur overhead. Most of the overhead comes from network  round-trip delay time between client and server ( latency) rather than from the protocol itself: the best solutions to performance issues depend on efficient application design.  [11] A common criticism of X is that its network features result in excessive complexity and decreased performance if only used locally.\n Modern X implementations use  Unix domain sockets for efficient connections on the same host. Additionally  shared memory (via the  MIT-SHM extension) can be employed for faster client–server communication.  [12] However, the programmer must still explicitly activate and use the shared memory extension. It is also necessary to provide fallback paths in order to stay compatible with older implementations, and in order to communicate with non-local X servers.\n  Some people have attempted writing alternatives to and replacements for X. Historical alternatives include  Sun&#39;s  NeWS and  NeXT&#39;s  Display PostScript, both  PostScript-based systems supporting user-definable display-side procedures, which X lacked. Current alternatives include:\n macOS (and its mobile counterpart,  iOS) implements its windows system, which is known as  Quartz. When  Apple Inc. bought NeXT, and used  NeXTSTEP to construct  Mac OS X, it replaced Display PostScript with  Quartz.  Mike Paquette, one of the authors of Quartz, explained that if Apple had added support for all the features it wanted to include into X11, it would not bear much resemblance to X11 nor be compatible with other servers anyway.  [13]\n Android, which runs on the  Linux kernel, uses its own system for drawing the user interface known as  SurfaceFlinger. 3D rendering is handled by  EGL.\n Wayland is being developed by several X.Org developers as a prospective replacement for X. It works directly with the  GPU hardware, via  DRI. Wayland can run an X.org server as a client, which can be rootless.  [14] A proprietary port of the Wayland backend to the  Raspberry Pi was completed in 2013.  [15] The project reached version 1.0 in 2012. Like Android, Wayland is EGL-based.\n Mir is a project from  Canonical Ltd. with goals similar to Wayland.  [16] Mir is intended to work with mobile devices using ARM chipsets (a stated goal is compatibility with Android device-drivers) as well as x86 desktops. Like Android, Mir/UnityNext are EGL-based. Backwards compatibility with X client-applications is accomplished via Xmir.\n Other alternatives attempt to avoid the overhead of X by working directly with the hardware; such projects include  DirectFB.  [17] (The  Direct Rendering Infrastructure (DRI), which aims to provide a reliable kernel-level interface to the  framebuffer, might [   citation needed] make these efforts redundant.)\n Additional ways to achieve a functional form of the &#34;network transparency&#34; feature of X, via network transmissibility of graphical services, include:\n Virtual Network Computing (VNC), a very low-level system which sends compressed bitmaps across the network; the Unix implementation includes an X server\n Remote Desktop Protocol (RDP), which is similar to VNC in purpose, but originated on Microsoft Windows before being ported to Unix-like systems; cf  NX,  GotoMyPc, etc.\n   Several bitmap display systems preceded X. From  Xerox came the  Alto (1973) and the  Star (1981). From  Apollo Computer came Display Manager (1981). From  Apple came the  Lisa (1983) and the  Macintosh (1984). The  Unix world had the  Andrew Project (1982) and  Rob Pike&#39;s  Blit terminal (1982).\n Carnegie Mellon University produced a remote-access app\n......", "posttime": "2020-05-06 01:53:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "system,服务器,server", "title": "X Window System：原理", "title_en": "X Window System: Principles", "transed": 1, "url": "https://en.wikipedia.org/wiki/X_Window_System#Principles", "via": "", "real_tags": ["system", "服务器", "server"]}, {"category": "", "categoryclass": "", "imagename": "cf05bee9112af8dc340f8fd1208a9269.jpeg", "infoid": 1000793, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大流行使他们的游戏重新登上排行榜榜首，现在他们正在进行更新，在那里你可以结束一场大流行，而不是导致它。", "note_en": "The pandemic brought their game back to the top of the charts, and now they're working on an update where you can end a pandemic rather than cause it.", "posttime": "2020-05-06 01:53:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,开发,expected,排行榜,pandemic", "title": "“瘟疫公司”的开发者从未想过现实会像它的视频游戏一样。", "title_en": "'Plague, Inc.’ developer never expected reality to look like its video game", "transed": 1, "url": "https://www.vice.com/en_us/article/bv8g8z/plague-inc-developer-never-expected-reality-to-look-like-its-video-game", "via": "", "real_tags": ["游戏", "开发", "expected", "排行榜", "pandemic"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000792, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转搜索硝基苯基戊二烯醛、硝基苯基戊二烯醛、NPPD或METKA(俄语意为标记)，俗称间谍尘，[1]是一种化学化合物，在冷战苏联时期被克格勃用作标签剂。莫斯科的苏联当局通过在美国人的衣服、汽车、门把手和其他物品上涂上一种几乎看不见的粉末来追踪他们。间谍尘埃的其他一些变体可能含有鲁米诺，在紫外光下会发光。[2][3][4]。\n1963年，亚历山大·克雷帕诺夫(Alexander Chrepanov)首次向莫斯科的中央情报局(Central Intelligence Agency)披露了这一消息，他是一名克格勃成员。[4]。\n1984年，克格勃官员Sergei Votontsov(代号GT/COWL)提供了该物质的样本。[4]。\n1985年夏天，这种粉末开始大量出现在莫斯科。由于担心该物质对健康的影响，美国国务院公开向苏联提出抗议。后来确定，对健康的威胁很低。[7][8][9]。\n从大约2005-2015年开始，使用NPPD开发了供执法机构使用的化学品追踪工具包。[10]为了检测NPPD，将0.1%的萘间苯二酚甲醇溶液加入到问题物品的棉签中，然后加入浓盐酸。观察到红色表示检测呈阳性。[11]在早期的有机化学研究中，经常使用间苯二酚来确定溶液中是否存在醛基，在酸性溶液中会形成红色加合物。[12]。\n首页--期刊主要分类--期刊细介绍--期刊题录与文摘--期刊详细文摘内容。5-(4-硝基苯基)-2，4-戊二烯醛(烟尘)的吸收和代谢。毒效唑，Appl，药典。87(1)：121-126。电话：90090-1，电话：10.1016/0041x(87)008x。PMID为3798448。\n高普曼G，Kalos A，Frierson M，Rosenkranz HS(1986)。据预测，NPPD(间谍粉尘)是一种诱变剂。环境诱变剂。8(4)：627-30。doi：10.1002/em.2860080413.。PMID为3525138。\n马歇尔，E.(1985)。间谍灰尘激怒了外交官。科学。229(4717)：952。DOI：10.1126/Science.229.4717.952.。PMID为17782513。\n铃木，新一；大田，Hikoto；铃木，安弘；铃田，Ritsuko；鹿松，Masaaki；森，Masahito；中岛，Hidemitsu(2005)。5-(4-硝基苯基)-2，4-戊二烯-1-醛(NPPD)在模拟犯罪现场被非科学家用作示踪剂。国际法医科学协会。152(1)：29-34。doi：10.1016/j.forScience int.2005.02.026.。PMID为15939173。", "note_en": "Jump to navigation  Jump to search  Nitrophenyl pentadienal,  nitrophenylpentadienal,  NPPD, or  METKA (Russian for &#34;mark&#34;) colloquially known as &#34;spy dust&#34;,  [1] is a chemical compound used as a tagging agent by the  KGB during the  Cold War Soviet Era.  Soviet authorities in  Moscow tracked Americans by applying an almost invisible powder to their clothing, cars, doorknobs and other objects. Some other variants of &#34;spy dust&#34; may have contained  luminol and would glow under  ultraviolet light.  [2]  [3]  [4]\n   It was first revealed to the  Central Intelligence Agency in Moscow in 1963 by  Alexander Chrepanov, a KGB walk in.  [4]\n  In 1984, KGB officer  Sergei Votontsov (Code name GT/COWL) provided a sample of the substance.  [4]\n  In the summer of 1985 the powder began to appear in Moscow in much larger quantities. Concerned about the health effects of the substance, the  United States  State Department publicly protested to the Soviets. It was later determined that the health threat was low.  [7]  [8]  [9]\n Beginning about 2005-2015, a chemical tracking kit for law enforcement agencies was developed using NPPD.  [10] To detect NPPD a 0.1%  methanol solution of  naphthoresorcinol is added to a swab of the item in question and then concentrated hydrochloric acid is added. The observation of a red color indicates a positive test.  [11] Napthoresorcinol was frequently used in early organic chemistry investigations to determine the presence of  aldehyde groups in solution, a red  adduct is formed in acidic solution.  [12]\n  ^   Burka LT, Sanders JM, Kool CP, Kim YC, Matthews HB (1987). &#34;Absorption and metabolism of 5-(4-nitrophenyl)-2,4-pentadienal (Spydust)&#34;.  Toxicol Appl Pharmacol.  87 (1): 121–126.  doi: 10.1016/0041-008x(87)90090-1.  PMID  3798448.\n       ^   Klopman G, Kalos A, Frierson M, Rosenkranz HS (1986). &#34;NPPD (spy dust) is predicted to be a mutagen&#34;.  Environ Mutagen.  8 (4): 627–30.  doi: 10.1002/em.2860080413.  PMID  3525138.\n ^   Marshall, E. (1985). &#34; &#34;Spy Dust&#34; Irritates Diplomats&#34;.  Science.  229 (4717): 952.  doi: 10.1126/science.229.4717.952.  PMID  17782513.\n  ^   Suzuki, Shinichi; Ohta, Hikoto; Suzuki, Yasuhiro; Sugita, Ritsuko; Kasamatsu, Masaaki; Mori, Masahito; Nakajima, Hidemitsu (2005). &#34;5-(4-Nitrophenyl)-2,4-pentadien-1-al (NPPD) used as a tracer by nonscientists at a simulated crime scene&#34;.  Forensic Science International.  152 (1): 29–34.  doi: 10.1016/j.forsciint.2005.02.026.  PMID  15939173.", "posttime": "2020-05-06 01:30:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "戊二烯,dust,nppd", "title": "间谍尘(硝基苯基戊二烯醛)", "title_en": "Spy Dust (Nitrophenyl Pentadienal)", "transed": 1, "url": "https://en.wikipedia.org/wiki/Nitrophenyl_pentadienal", "via": "", "real_tags": ["戊二烯", "dust", "nppd"]}, {"category": "", "categoryclass": "", "imagename": "c9fdfda44195491a8f42cd177561eafd.jpg", "infoid": 1000791, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "代码：https://github.com/Henry-E/poisson_poops推特版本：https://twitter.com/EldinhoC/status/1233407388927000580", "note_en": "Code: https://github.com/Henry-E/poisson_poops Twitter version: https://twitter.com/EldinhoC/status/1233407388927000580", "posttime": "2020-05-06 01:30:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "爆炸案,bombings,https", "title": "二战爆炸案和鸟粪有什么共同之处？(概率模拟)", "title_en": "What do WWII bombings and bird poop have in common? (probability simulation)", "transed": 1, "url": "https://www.youtube.com/watch?v=PKqUzsG9txo&feature=youtu.be", "via": "", "real_tags": ["爆炸案", "bombings", "https"]}, {"category": "", "categoryclass": "", "imagename": "0498fa6474ad6d2d18227c6c018514cb.png", "infoid": 1000789, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "通过今天的发布，Firefox加强了对您的在线帐户登录和密码的保护，并在这一关键时刻以创新的方式管理您的帐户：\n如果您的一个帐户涉及网站入侵，而您在其他网站上使用了相同的密码，现在系统将提示您更新密码。钥匙图标标识哪些帐户使用该易受攻击的密码。\n自动为更多网络上的新帐户生成安全、复杂的密码，这些密码很容易保存在浏览器中；\n您可以在主菜单的“登录”和“密码”下轻松访问和查看保存的密码。如果你的设备碰巧在你的家人或室友之间共享，最新的更新有助于防止你不经意地偷偷窥探。如果您没有为Firefox设置主密码，Windows和MacOS现在需要先登录到您的操作系统帐户，然后才能显示您保存的密码。\n画中画允许您进行多任务处理，无论您在计算机上做什么、跨不同的应用程序，甚至是跨工作空间，小视频窗口都会随之而来。现在，当您准备好将焦点放在视频上时，双击可以使小窗口进入全屏。再次双击可再次减小大小。\nFirefox现在支持Audio Worklet，这将允许更复杂的音频处理，如虚拟现实和网络游戏；并且正在被你喜欢的一些软件程序采用。\n有了这个改变，你现在可以加入Firefox上的Zoom通话，而不需要任何额外的下载。\nWebRender继续推出更多适用于Windows用户的Firefox，目前在现代Intel笔记本电脑上默认可用，小屏幕(&lt；=1920x1200)用于改进图形渲染。", "note_en": "With today’s release, Firefox strengthens protections for your online account logins and passwords, with innovative approaches to managing your accounts during this critical time:\n If one of your accounts is involved in a website breach and you&#39;ve used the same password on other websites, you will now be  prompted to update your password. A key icon identifies which accounts use that vulnerable password.\n Automatically  generate secure, complex passwords for new accounts across more of the web that are easily saved right in the browser;\n You have been able to access and see your saved passwords under Logins and Passwords easily under the main menu. If your device happens to be shared among your family or roommates, the latest update helps to prevent casual snooping over your shoulder. If you don’t have a  master password set up for Firefox, Windows and macOS now requires a  login to your operating system account before showing your saved passwords.\n  Picture-in-Picture allows you to multitask, the small video window following along no matter what you are doing on your computer, across different applications and even workspaces. Now, when you are ready to focus on the video, a double click can take the small window into full screen. Double click again to reduce the size again.\n  Firefox now supports Audio Worklets that will allow more complex audio processing like VR and gaming on the web; and is being adopted by some of your favorite software programs.\n With this change, you can now join Zoom calls on Firefox without the need for any additional downloads.\n  WebRender continues its roll out to  more Firefox for Windows users, now available by default on modern Intel laptops with a small screen (&lt;= 1920x1200) for improved graphics rendering.", "posttime": "2020-05-06 01:17:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "firefox,火狐,现在", "title": "火狐76", "title_en": "Firefox 76", "transed": 1, "url": "https://www.mozilla.org/en-US/firefox/76.0/releasenotes/", "via": "", "real_tags": ["firefox", "火狐", "现在"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000788, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "到现在为止还好。现在，如何解释数字通常用公式来解释：这通常是我翻转表的地方。也许我对数学符号过敏，但当我读到这篇文章时，我的大脑里就是有什么东西没有灵光一闪。感觉像是在学画猫头鹰。\n虽然这种解释浮点的方式是正确的，但通常会让我们中的一些人完全不知所措。我指责这个可怕的符号让大批程序员灰心丧气，把他们吓到再也不回头去理解浮点的实际工作原理的地步。幸运的是，有一种不同的方式来解释它。不是指数，而是两个整数的两个连续幂之间的窗口。考虑窗口内偏移量，而不是尾数。该窗口告诉您数字将在哪两个连续的2次幂范围内：[0.5，1]、[1，2]、[2，4]、[4，8]等等(最高可达[$2^{127}$，$2^{128}$]。偏移量将窗口划分为$2^{23}=8388608$存储桶。使用窗口和偏移量，您可以近似计算一个数字。窗户是一种很好的防止溢出的装置。一旦您在一个窗口中达到最大值(例如[2，4])，您就可以将其浮动并表示下一个窗口(例如[4，8])中的数字。因为窗口变得两倍大，所以它只需要一点精度。下图说明了数字6.1将如何编码。窗口必须从4开始，跨度到2的下一个幂8。偏移量大约是窗口的一半。\n当窗口覆盖范围较大时，精度会损失多少？让我们以窗口[1，2]为例，其中8388608个偏移量覆盖范围1，其精度为$\\frac{(2-1)}{8388608}=0.00000011920929$。在窗口[2048，4096]中，8388608个偏移量覆盖$(4096-2048)=2048$的范围，这给出了精度$\\FRAC{(4096-2048)}{8388608}=0.0002$。\n让我们举另一个例子，详细计算我们都很熟悉的一个数字的浮点表示：3.14。数字3.14是正的$\\right tarrow S=0$。数字3.14介于2和4的幂之间，因此浮动窗口必须从$2^1$$\\right tarrow E=128$开始(请参阅公式，其中窗口是$2^{(E-127)}$)。最后，有$2^{23}$偏移量可用于表示3.14在区间[2-4]内的位置。在使偏移量$M=2^{23}*0.57=4781507$的区间内，它位于$\\frac{3.14-2}{4-2}=0.57$。\n其二进制翻译为：因此，值3.14近似为3.1400001049041748046875。用难看的公式对应的值：最后是用窗口和偏移量表示的图形：希望对您有帮助：)！既然浮点单位速度如此之慢，为什么C语言以FLOAT和DOUBLE类型结束呢？毕竟，用于发明语言(PDP-11)的机器没有浮点单元！制造商(DEC)曾向丹尼斯·里奇和肯·汤普森承诺，下一款将会有一款。作为天文学爱好者，他们决定在他们的语言中加入这两种类型。琐事：1991年真正想要硬件浮点运算单元的人可以买一个。当时唯一可能想要一台的人可能是科学家(根据英特尔对市场的理解)。它们在市场上被称为数学协处理器。性能一般，价格惊人(1993年的200美元相当于2016年的350美元)。因此，销售表现平平。\n*", "note_en": "So far, so good. Now, how numbers are interpreted is usually explained with the formula:       This is usually where I flip the table. Maybe I am allergic to mathematic notation but something just doesn&#39;t click in my brain when I read this. It feels like learningto  draw a owl.\n     Although correct, this way of explaining floating point usually leaves some of us completelyclueless. I blame this dreadful notation for discouraging legions of programmers,scaring them to the point where they never looked back to understand how floating pointactually works.   Fortunately, there is a different way to explain it. Instead of Exponent, thinkof a Window between two consecutive power of two integers. Instead of a Mantissa, thinkof an Offset within that window.       The window tells within which two consecutive power-of-two the number will be: [0.5,1], [1,2], [2,4], [4,8] and so on (up to [$2^{127}$,$2^{128}$]. The offset divides the window in $ 2^{23} = 8388608 $ buckets. With the window and the offset you can approximate a number. The window is an excellent mechanism to protect from overflowing. Once you have reached the maximum in a window (e.g [2,4]), you can &#34;float&#34; it right and represent the number within the next window (e.g [4,8]). It only costs a little bit of precision since the window becomes twice as large.  The next figure illustrates how the number 6.1 would be encoded. The window must start at 4 and span to next power of two, 8. The offset is about half way down the window.\n    How much precision is lost when the window covers a wider range? Let&#39;s take an example with window [1,2] where the 8388608 offsets cover a range of 1 which gives a precision of $ \\frac{(2-1)}{8388608}=0.00000011920929$. In the window [2048,4096] the 8388608 offsets cover a range of $(4096-2048) = 2048$ which gives a precision $ \\frac{(4096-2048)}{8388608}=0.0002$.\n    Let&#39;s take an other example with the detailed calculations of the floating point representation of a number we all know well: 3.14.  The number 3.14 is positive $\\rightarrow S=0$.  The number 3.14 is between the power of two 2 and 4 so the floating window must start at $2^1$ $\\rightarrow E=128$ (see formula where window is $2^{(E-127)}$).  Finally there are $2^{23}$ offsets available to express where 3.14 falls within the interval [2-4]. It is at $\\frac{3.14 -2 }{4 - 2} = 0.57$ within the interval which makes the offset $ M = 2^{23}*0.57 = 4781507$\n Which in binary translates to:  The value 3.14 is therefore approximated to 3.1400001049041748046875. The corresponding value with the ugly formula:    And finally the graphic representation with window and offset:         I hope that helped :) !     Since floating point units were so slow, why did the C language end up with  float and  double types ? After all, the machine used to invent the language (PDP-11) did not have a floating point unit! The manufacturer (DEC) had promised to Dennis Ritchie and Ken Thompson the next model would have one. Being astronomy enthusiasts they decided to add those two types to their language.    Trivia: People who really wanted a hardware floating point unit in 1991 could buy one. The only people who could possibly want one back then would have been scientists (as per Intel understanding of the market). They were marketed as &#34;Math CoProcessor&#34;. Performance were average and price was outrageous (200 USD in 1993 equivalent to 350 USD in 2016.). As a result, sales were mediocre.\n       *", "posttime": "2020-05-06 01:06:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "解释,point,浮点,window", "title": "直观地解释浮点", "title_en": "Floating Point Visually Explained", "transed": 1, "url": "http://fabiensanglard.net/floating_point_visually_explained/index.html", "via": "", "real_tags": ["解释", "point", "浮点", "window"]}, {"category": "", "categoryclass": "", "imagename": "39ddde4c274d251badf844f3a2b613c2.png", "infoid": 1000787, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们已经开发了一条分析管道，以便于实时跟踪SARS-CoV-2中的突变，最初专注于Spike(S)蛋白，因为它介导人类细胞的感染，是大多数疫苗策略和基于抗体的治疗的目标。到目前为止，我们已经在Spike中鉴定出14个正在积累的突变。突变在更广泛的系统发育背景下、地理上和随着时间的推移被考虑，以提供一个早期预警系统，以揭示可能在传播或抵抗干预方面具有选择性优势的突变。每一个基因都被评估为正选择的证据，并通过结构建模来探索突变的含义。突变Spike D614G令人迫切关注；它于2月初开始在欧洲传播，当它被引入新的地区时，它迅速成为主导形式。此外，我们还提供了局部流行菌株之间重组的证据，这表明存在多个菌株感染。这些发现对SARS-CoV-2的传播、发病机制和免疫干预具有重要意义。\n↵谢菲尔德冠状病毒基因组组的#名成员：阿德里安·安格亚尔、丽贝卡·L·布朗、劳拉·卡里莱罗、卢克·R·格林、丹妮尔·C·格罗夫斯、凯蒂·J·约翰逊、亚历山大·J·基利、本杰明·B·林赛、保罗·J·帕森斯、穆罕默德·拉扎、莎拉·罗兰-琼斯、雷切尔·M·塔克、丹尼斯·王、马修·D·怀尔斯。", "note_en": "We have developed an analysis pipeline to facilitate real-time mutation tracking in SARS-CoV-2, focusing initially on the Spike (S) protein because it mediates infection of human cells and is the target of most vaccine strategies and antibody-based therapeutics. To date we have identified fourteen mutations in Spike that are accumulating. Mutations are considered in a broader phylogenetic context, geographically, and over time, to provide an early warning system to reveal mutations that may confer selective advantages in transmission or resistance to interventions. Each one is evaluated for evidence of positive selection, and the implications of the mutation are explored through structural modeling. The mutation Spike D614G is of urgent concern; it began spreading in Europe in early February, and when introduced to new regions it rapidly becomes the dominant form. Also, we present evidence of recombination between locally circulating strains, indicative of multiple strain infections. These finding have important implications for SARS-CoV-2 transmission, pathogenesis and immune interventions.\n   ↵ # Members of Sheffield COVID-19 Genomics Group: Adrienne Angyal, Rebecca L. Brown, Laura Carrilero, Luke R. Green, Danielle C. Groves, Katie J Johnson, Alexander J Keeley, Benjamin B Lindsey, Paul J Parsons, Mohammad Raza, Sarah Rowland-Jones, Rachel M. Tucker, Dennis Wang, Matthew D. Wyles", "posttime": "2020-05-06 01:05:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,cov,transmissible,突变,spike", "title": "一种传播性更强的SARS-CoV-2病毒的出现", "title_en": "Emergence of a more transmissible form of SARS-CoV-2", "transed": 1, "url": "https://www.biorxiv.org/content/10.1101/2020.04.29.069054v1", "via": "", "real_tags": ["病毒", "cov", "突变", "spike"]}, {"category": "", "categoryclass": "", "imagename": "ec4a7ac484cb7478d106dfebd01eb16a.jpg", "infoid": 1000786, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "了解如何使用Yahoo_FIN包使用Python下载基本面数据，包括市盈率和市盈率、股本回报率等。", "note_en": "Learn how to download fundamentals data with Python using the yahoo_fin package, including P/E and P/S ratios, return on equity, and more.", "posttime": "2020-05-06 00:42:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,fundamentals,download", "title": "如何使用Python获取股票基本面数据", "title_en": "How to get stock fundamentals data with Python", "transed": 1, "url": "http://theautomatic.net/2020/05/05/how-to-download-fundamentals-data-with-python/", "via": "", "real_tags": ["python", "download"]}, {"category": "", "categoryclass": "", "imagename": "ac38074248627e19bb32e7e8212ecd5a.jpg", "infoid": 1000785, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加利福尼亚州库比蒂诺-苹果公司(Apple)今天宣布，从6月22日开始，它将在苹果开发者应用程序和苹果开发者网站上举办一年一度的全球开发者大会(Worldwide Developers Conference)，对所有开发者免费开放。该公司还宣布了SWIFT学生挑战赛，学生开发人员可以通过创建自己的SWIFT游乐场来展示他们对编程的热爱。现在，WWDC20已经进入第31个年头，全球数百万富有创意和创新的开发人员将有机会早日接触iOS、iPadOS、MacOS、TVOS和WatchOS的未来，并向苹果工程师学习，因为他们正在努力构建丰富全球苹果客户生活的应用程序体验。\n苹果负责全球市场营销的高级副总裁菲尔·席勒(Phil Schiller)表示：“WWDC20将是我们迄今规模最大的一次，它将以前所未有的方式将我们超过2300万的全球开发者社区聚集在一起，在6月的一周时间里了解苹果平台的未来，”苹果负责全球营销的高级副总裁菲尔·席勒(Phil Schiller)说。我们迫不及待地想在6月份与全球开发者社区在线会面，与他们分享我们一直在开发的所有新工具，以帮助他们创建更令人难以置信的应用程序和服务。随着我们越来越接近这一激动人心的活动，我们期待着与大家分享有关WWDC20的更多细节。“。\n苹果负责软件工程的高级副总裁克雷格·费德里吉(Craig Federighi)说：“学生是苹果开发者社区不可或缺的一部分，去年WWDC吸引了来自37个不同国家的350多名学生开发者参加。”在我们期待WWDC20的同时，虽然我们今年的聚会将是虚拟的，但我们想要表彰和庆祝我们来自世界各地的年轻开发人员的创造性贡献。我们迫不及待地想看到这位下一代创新思想家通过斯威夫特学生挑战赛将他们的想法变成现实。“。\nSWIFT游乐场是一款适用于iPad和Mac的革命性应用程序，它使学习SWIFT编程语言变得互动和有趣。现在到晚上11点59分。PDT时间5月17日，来自世界各地的学生开发人员可以通过在SWIFT操场创建可在3分钟内体验的互动场景，提交SWIFT学生挑战赛。获奖者将获得一件独家WWDC20夹克和别针套装。欲获知更多信息，请访问网站：developer.apple.com/wwdc20/swift-student-challenge.。\n鼓励开发人员下载Apple Developer应用程序，在那里将在6月份共享其他WWDC20计划信息-包括主旨和平台国情咨文细节、会议和实验室时间表等。信息还将在苹果开发者网站和电子邮件上提供。\nApp Store目前在175个国家和地区，是世界上最安全、最具活力的应用程序市场，每周有超过5亿人访问。它是用户发现新应用程序的最佳场所，允许各种规模的开发者将他们的应用程序分发给世界各地的客户。App Store为开发者提供了许多建立业务的方式，自2008年推出以来，开发者一直在创建影响文化和改变生活的创新应用程序。\n苹果在1984年推出了麦金塔，给个人技术带来了革命性的变化。今天，苹果凭借iPhone、iPad、Mac、Apple Watch和Apple TV引领世界创新。苹果的五个软件平台-iOS、iPadOS、MacOS、WatchOS和TVOS-在所有苹果设备上提供无缝体验，并为人们提供突破性的服务，包括App Store、Apple Music、Apple Pay和iCloud。苹果公司的10万多名员工致力于制造地球上最好的产品，并致力于让世界变得比我们发现的更好。", "note_en": "Cupertino, California — Apple today announced it will host its annual Worldwide Developers Conference virtually, beginning June 22, in the  Apple Developer app and on the  Apple Developer website for free for all developers. The company also announced the Swift Student Challenge, an opportunity for student developers to showcase their love of coding by creating their own Swift playground. Now in its 31st year, WWDC20 will be an opportunity for millions of creative and innovative developers around the world to get early access to the future of iOS, iPadOS, macOS, tvOS, and watchOS, and to learn from Apple engineers as they work to build app experiences that enrich the lives of Apple customers around the globe.\n  “WWDC20 will be our biggest yet, bringing together our global developer community of more than 23 million in an unprecedented way for a week in June to learn about the future of Apple platforms,” said Phil Schiller, Apple’s senior vice president of Worldwide Marketing. “We can’t wait to meet online in June with the global developer community and share with them all of the new tools we’ve been working on to help them create even more incredible apps and services. We look forward to sharing more details about WWDC20 with everyone as we get closer to this exciting event.”\n  “Students are an integral part of the Apple developer community, and last year WWDC saw attendance from more than 350 student developers spanning 37 different countries,” said Craig Federighi, Apple’s senior vice president of Software Engineering. “As we look forward to WWDC20, although our gathering will be virtual this year, we want to recognize and celebrate the creative contributions of our young developers from around the world. We can’t wait to see this next generation of innovative thinkers turn their ideas into a reality through the Swift Student Challenge.”\n  Swift Playgrounds is a revolutionary app for iPad and Mac that makes learning the Swift programming language interactive and fun. Now through 11:59 p.m. PDT on May 17, student developers from all over the world can submit to the Swift Student Challenge by creating an interactive scene in a Swift playground that can be experienced within three minutes. Winners will receive an exclusive WWDC20 jacket and pin set. For more information, visit  developer.apple.com/wwdc20/swift-student-challenge.\n  Developers are encouraged to download the Apple Developer app where additional WWDC20 program information — including keynote and Platforms State of the Union details, session and lab schedules, and more — will be shared in June. Information will also be made available on the Apple Developer website and by email.\n  The App Store, now in 175 countries and regions, is the world’s safest and most vibrant app marketplace, with more than half a billion people visiting each week. It is the best place for users to discover new apps and allows developers of all sizes to distribute their apps to customers around the world. The App Store features many ways for developers to build their businesses, and since its launch in 2008, developers have been creating innovative apps that influence culture and change lives.\n  Apple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, Apple Watch, and Apple TV. Apple’s five software platforms — iOS, iPadOS, macOS, watchOS, and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay, and iCloud. Apple’s more than 100,000 employees are dedicated to making the best products on earth, and to leaving the world better than we found it.", "posttime": "2020-05-06 00:30:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,app,开发,apple,全球", "title": "苹果将于6月22日开始主办虚拟全球开发者大会", "title_en": "Apple to host virtual Worldwide Developers Conference beginning June 22", "transed": 1, "url": "https://www.apple.com/newsroom/2020/05/apple-to-host-virtual-worldwide-developers-conference-beginning-june-22/", "via": "", "real_tags": ["苹果", "app", "开发", "apple", "全球"]}]