[{"category": "", "categoryclass": "", "imagename": "34f57040e3991c7e98c781fbba170dbb.jpg", "infoid": 1011515, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国的制片厂、创作者和营销者比以往任何时候都更依赖于数字平台，这些平台让他们能够衡量观众喜欢什么-以及想要看到更多的东西。他们也不仅仅是在寻找测试筛选。他们希望在制作的每个阶段都能接触到潜在的观众，从剧本写出来到他们的新电视节目、电影或音乐视频首次亮相的那一刻。\n自从乔治·卢卡斯开创了无休止的续集(和前传)时代以来，好莱坞的高管们就一直试图利用……", "note_en": "America’s studios, creators and marketers are relying, more than ever, on digital platforms that allow them to gauge what audiences like—and would like to see more of. They’re not just looking for test screenings, either. They’re looking to check in with potential audiences at every stage of production, from before a script is written until the moment their new TV show, film or music video debuts.\n  Ever since George Lucas ushered in the era of endless sequels (and prequels), Hollywood executives have tried to capitalize on...", "posttime": "2020-07-13 23:02:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "内容,driven,观众", "title": "好莱坞内容工厂核心的数据驱动型技术引擎", "title_en": "The Data-Driven Tech Engine at the Heart of Hollywood's Content Factories", "transed": 1, "url": "https://www.wsj.com/articles/the-data-driven-tech-engine-at-the-heart-of-hollywoods-content-factories-11594440059", "via": "", "real_tags": ["内容", "driven", "观众"]}, {"category": "", "categoryclass": "", "imagename": "4cab3ea9bd1701c88d4a0bec113eb21b.jpg", "infoid": 1011514, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有色人种员工经常面临人力资源部的怀疑、报复甚至骚扰，当他们面临歧视时，他们没有追索权。\n瓦内萨·威廉姆斯(Vanessa Williams)在2018年8月赢得了一场职业大胜。这位前YouTube音乐团队的营销人员刚刚成功组织了一场聚焦加勒比海娱乐业的活动。演讲者包括音乐家怀克里夫·让(Wyclef Jean)以及YouTube和Oculus的高管，吸引了数百名来自旧金山湾区的以黑人为主的科技员工来到谷歌的旧金山总部，进行了一夜的讨论和交流。\n威廉姆斯计划这个晚上是她作为Black@YouTube员工资源小组负责人工作的一部分。这也与她的日常工作很好地契合，毕竟，这份工作是为了提升YouTube音乐的知名度。\n但不久之后，当威廉姆斯收到她的年度业绩评估时，她说她的经理没有提到这次活动，也没有提到威廉姆斯的任何其他营销项目。取而代之的是，这位经理使用了威廉姆斯所谓的种族编码的关于威廉姆斯个性的反馈，因为她的语气犀利而斥责她，并告诉她要友善一些。她说，这位经理唯一提到的是威廉姆斯的优势，那就是威廉姆斯是多样性的倡导者。\n威廉姆斯感到刻板印象。威廉姆斯说：我觉得自己作为一名营销者没有被认真对待，因为我对多样性和包容性感兴趣。她说，她向人力资源部门报告了她的担忧，敦促他们推动对员工考核的审计，以检查这种偏见。然而，威廉姆斯说，最终，一名人力资源代表只是与她的经理进行了交谈，让她重写了评估报告，并没有采取更广泛的行动。\nYouTube的一位发言人没有直接对威廉姆斯的账户发表评论，但表示公司会调查所有的担忧，并经常采取员工出于保密考虑而不知情的纠正行动。\n对威廉姆斯来说，这场磨难象征着人力资源部门如何让黑人和棕色员工失望，在往往更深的伤口上贴上创可贴。威廉姆斯说：这不是关于我的经理或我的评论。这种情况稍后还会发生在其他人身上。另一位经理，另一份评估。威廉姆斯在评估后不久就在谷歌换了一个新职位，并于1月份离开公司，换了一份新工作。\n她在人力资源部门的经历与整个科技行业黑人和棕色员工的说法不谋而合。在采访了十几名在科技公司工作或为科技公司提供多元化建议的人时，Protocol反复听到对种族问题悬而未决的投诉，人力资源部门的职能是保护公司免受诉讼，而不是保护面临歧视的边缘化工人。消息人士称，有色人种员工经常面临人力资源的怀疑、报复甚至骚扰，当他们在以白人和男性为主的行业面临歧视时，他们没有任何追索权。\nCode2040首席执行官卡拉·蒙特罗索(Karla Monte Roso)表示，这些问题源于这样一个事实，即人力资源通常被认为是公司的风险缓解工具。她表示，尽管这通常是员工登记骚扰和歧视投诉的唯一内部机制，但人力资源的最终目的是保护公司，激励许多人力资源部门将指控降至最低，并将举证责任转移到易受伤害的员工身上。\n在最近一个备受瞩目的例子中，Aerica Banks公开指控Pinterest的人力资源团队针对她，并在她提出多项投诉，指控她的经理、总法律顾问和副总法律顾问歧视、报复和不公平对待后，对她进行了数月的痛苦讯问。班克斯是Pinterest的公共政策和社会影响经理。\n她说，在她提出指控后不久，人力资源调查就转向了她。商业不端行为小组的调查人员--他们都在她所在的部门工作--在几个月的时间里对她进行了几个小时的讯问，通常是到深夜。她说，他们的问题变得不恰当和贬损。班克斯说，调查此事的团队一度迫使多名员工交出手机，并威胁说，如果他们不交出手机，就会进行报复。\n班克斯告诉礼宾，这完全是恐吓，指的是整个磨难。他们说，我们正在调查你的说法，但我们也在调查你。她说整个过程是不透明和秘密的。她还表示，团队没有建立任何程序，以确保她的经理在调查展开时不会对她进行报复，这让她很容易受到她指控的老板的更多骚扰。\n根据协议获得的一份总结调查结果的文件，调查最终没有发现她的经理或其他人有任何不当行为。该公司的调查人员表示，对于几乎每一项指控-包括抱怨男性总法律顾问在一次会议上贬低了女性的观点，以及女性总法律顾问因为班克斯的种族而对她与其他人不同-他们都没有发现歧视的证据。在班克斯指控她的经理发表种族贬损言论的一个案例中，调查员得出结论说，他是无罪的，因为这些言论本身并没有表明偏见，也没有违反我们的行为准则。\n这就像是在告诉我，当然，这件事发生在你身上，…。但我们不会对此适用我们自己的行为准则，因为你的感受并不重要，它对你的影响也无关紧要，我们会找到任何漏洞，让你的经理逍遥法外，她说。\n自从班克斯和她的同事Ifeoma Ozoma几周前公开他们的指控以来，Pinterest已经聘请了一名外部律师来调查他们的指控。Pinterest的一位发言人说，我们永远不希望任何人有Ifeoma和Aerica在Pinterest工作时的那种感觉。\n科技老手、瓦亚咨询公司(Vaya Consulting)首席多样性顾问妮可·桑切斯(Nicole Sanchez)表示，在她与该行业合作的多年中，她看到了类似的动态：桑切斯表示，当有色人种员工报告歧视或不平等待遇的情况时，他们的担忧往往会被忽视，他们因为直言不讳而面临长期影响。这是公司一次又一次犯下的错误之一--在人力资源部挥舞着一面旗帜，比如，嘿，有色人种，代表不足的人们，过来和我们谈谈，但是…。她说，这会让人感觉像是一个陷阱。\n亚当·托马斯(Adam Thomas)在一次会议上注意到，他在新泽西州一家电商公司的白人同事在该公司的一个公共松弛频道中使用嘲弄非裔美国人方言的口音。他说，一位同事在谈话中说，所有人都疯狂地谈论这场摇摆舞。(礼仪没有透露公司的名字，因为托马斯正在签署保密协议，不能公开谈论该公司。)。\n托马斯当时是该公司唯一的黑人员工，他说，这太无礼了。他立即将这一问题提交给人力资源部负责人，人力资源部负责人回应称，她会确保相关人员受到训斥，这种情况不会再发生。\n托马斯说，两周后，人力资源部没有介入。他从一位为他工作的人那里得到了一次道歉。托马斯说，当他与人力资源主管坐在一起时，她鼓励他克服这一点，并警告说，如果他不从这种情况中走出来，他可能不会适应公司。\n托马斯说：我不知道这会给我带来多大的社会或身体上的损失。我当时一团糟。我有生以来第一次不得不服用抗焦虑药。他说在那次事件之后，他再也不信任人力资源部了。\n当员工决定报告他们所面临的骚扰或歧视时，他们经常被要求提供大量证据，证明他们有恶意或虐待是出于种族动机。多元化咨询公司Paradigm的董事伊夫林·卡特(Evelyn Carter)表示，面对同事和经理每天的微攻击，黑人和棕色员工往往很难达到这样的高标准。\n卡特曾与包括Snap在内的科技公司合作过，他说，当涉及种族主义、偏见或不公平时，我经常看到组织将举证责任推给受影响的员工。然而，偏见往往以微妙的形式出现--一些人可能很容易解释的短暂互动，但却指向了一种持续不断的歧视模式，这对员工的福祉、健康和工作成果造成了可衡量的伤害。\n另一方面，当有色人种成为人力资源投诉的接收方时，一些科技员工表示，他们看到这些指控得到了更严肃的对待。\n在IT行业工作了20年的乔纳森·莱特福特(Jonathan Lightford)说，几年前，当他的一名白人员工向人力资源部举报他在一家IT咨询公司受到虐待时，他感觉自己立即受到了审判。莱特福特说，在他职业生涯的早期，他曾试图向人力资源部报告种族主义事件，但没有得到认真对待。但既然我是一个身居领导地位的黑人，有人投诉我，人力资源部就会调查我，他说。\n莱特福特说，在两周的时间里，他回答了人力资源部的问题，并交出了大量关于他管理团队的电子邮件和文件。他说，在调查结束时，人力资源部将莱特福特的白人同事调到了另一个办公室。\n调查结束后，莱特福特说，其他经理都是白人，他们开始主动向他提供有关领导力和管理的建议，尽管调查本应是保密的。他最终选择在六个月内离开公司，因为他觉得工作环境对他的敌意越来越大。\n桑切斯说，她已经介入了许多黑人似乎成为人力资源部目标的情况，指出投诉通常使用暗示性的语言，比如将黑人男性描述为令人生畏。(在这些情况下)有一系列问题要问人力资源部，包括，这是你处理所有指控案件的方式吗？她说。这通常会把人叫醒。\n所有这些都导致黑人和棕色员工甚至不愿意向人力资源部报告问题。一位不愿透露姓名的前Twitter员工表示，一位经理曾斥责他们花了太多时间专注于黑人的东西，这名员工认为这意味着他们在多样性和包容性方面的工作。但这名员工接受了这一评论，而不是向人力资源部提出。你认为：我还得和这个人一起工作。这位员工说，这个团队会因为对此进行调查而产生敌意吗？\n这名员工表示，他们真心相信Twitter的人力资源部门致力于打造更加多元化的员工队伍，但该公司似乎更注重招聘多元化员工，而在留住他们方面做得不够。这位员工表示：我认为Twitter在多元化方面的目标很大程度上是为了引进新人才，而不是留住现有人才。她指出，在公司新的多元化主管达拉娜·布兰德(Dalana Brand)的领导下，情况开始发生变化。\nTwitter的一位发言人表示，该公司正在迈向成为世界上最具包容性和多元化的科技公司，并指出该公司的目标是，到2025年，其员工中有25%的人不能充分代表少数族裔。这位发言人说：我们正朝着正确的方向前进，但我们有很多工作要做，进展再快也不嫌快。\nReddit前首席执行官、科技包容非营利项目Include的联合创始人鲍康如(Ellen Pao)表示，拥有一个有效和公平的人力资源部门的关键是一位致力于反种族主义的首席执行官。她说，归根结底，首席执行官必须想要让这种文化保持健康，必须想要根除他们公司可能存在的问题。2015年，鲍康如起诉风投公司凯鹏华盈(Kleiner Perkins Caufield&amp；Byers)性别歧视和报复。\n如果没有领导层的认同，即使是善意的人力资源部门也会发现自己束手无策。6月初，特斯拉员工资源小组的领导人向人力资源部发送了一份提案清单，敦促首席执行官埃隆·马斯克(Elon Musk)采取行动解决种族主义问题，此前明尼苏达州警方击毙了乔治·弗洛伊德(George Floyd)。他们已经收到了几位人力资源高管诚挚的来信，但还没有直接收到马斯克的来信。特斯拉员工资源小组的一名成员表示，他们还没有找到合适的员工。\n这位员工说：有很多人认为人力资源部门的工作不符合我们的利益。如果埃隆不关心这件事，它是不会发生的。\n6月19日，马斯克确实在推特上表示，他的两家公司特斯拉(Tesla)和SpaceX将6月19日定为美国官方假期，但人力资源部门给特斯拉员工的一封信明确表示，休息日将是无薪的。特斯拉没有回应Protocol的置评请求。\n例如，自从威廉姆斯提出投诉以来，YouTube已经对其内部调查流程进行了改变。一位发言人指出，在收到员工关于参与调查难度的反馈后，YouTube启动了一个调查关怀团队，员工可以在那里寻求额外的资源，包括咨询。他们还制定了一项政策，允许投诉的人在整个调查过程中带着谷歌内部的支持人员参加会议。\n接受“礼宾”采访的多元化顾问有一系列解决人力资源问题的想法。蒙特罗索建议将人力资源置于多元化和包容性的保护伞下，而不是法律部门，这可能会改变人力资源员工的激励结构。卡特建议将多样性和包容性作为其人力资源团队的关键核心竞争力。桑切斯表示，公司应该在科技公司内部创建一个完全独立的垂直部门，以处理人力资源以外的多样性和工作场所文化问题。前YouTube员工威廉姆斯(Williams)正在开发一种工具，帮助经理们识别并根除绩效考核中的偏见。\n鲍康如说，这是科技行业几十年来一直存在的盲点。现在我们又开始谈论这个问题了--但是我们真的要解决这个问题吗？\n这需要工作，也需要改变，她说。这需要认真审视我们自己的组织，然后说，我们没有做好这项工作。", "note_en": "People   Employees of color often face skepticism, retaliation and even harassment from HR, leaving them without recourse when they face discrimination.\n     Vanessa Williams was coming off of a big professional win in August 2018. The former marketing staffer on YouTube&#39;s music team had just organized a successful event focused on the Caribbean entertainment industry. The speakers, including musician Wyclef Jean and executives from YouTube and Oculus, drew hundreds of predominantly Black tech workers from across the Bay Area to Google&#39;s San Francisco headquarters for a night of discussion and networking.\n  Williams had planned the evening as part of her work as a leader of the Black@YouTube employee resource group. It also dovetailed nicely with her day job, which was, after all, to raise the profile of YouTube Music.\n But shortly after, when Williams received her annual performance review, she said her manager made no mention of the event — or any of Williams&#39; other marketing projects, for that matter. Instead, the manager used what Williams called &#34;racially coded feedback&#34; about Williams&#39; personality, chastising her for her &#34;sharp&#34; tone and telling her to be friendlier. The only thing the manager mentioned by way of Williams&#39; strengths, she said, was that Williams was an advocate for diversity.\n  Williams felt stereotyped. &#34;I felt like I was not being taken seriously as a marketer because of my interest in diversity and inclusion,&#34; Williams said. She says she reported her concerns to human resources, urging them to push for audits of employee reviews to check for this kind of bias. In the end, though, Williams says an HR rep just talked to her manager and got her to rewrite the review and took no broader action.\n A YouTube spokesperson did not comment on Williams&#39; account directly, but said the company investigates all concerns and often takes corrective action that employees are not privy to due to confidentiality concerns.\n For Williams, the ordeal was emblematic of how HR departments fail Black and brown workers, by slapping Band-Aids on what are often much deeper wounds. &#34;It wasn&#39;t about my manager or my review,&#34; Williams said. &#34;This is going to happen to someone else later on. Another manager, another review.&#34; Williams moved to a new role at Google shortly after the review and left the company for a new job in January.\n Her experience with HR echoes the accounts of Black and brown employees across the tech industry. In interviews with more than a dozen people who either work in tech or advise tech companies on diversity, Protocol heard repeated concerns of complaints about issues of race left unresolved and HR departments functioning to protect companies from lawsuits, rather than to protect marginalized workers facing discrimination. Sources said employees of color often face skepticism, retaliation and even harassment from HR, leaving them without any recourse when they face discrimination in the largely white and male industry.\n   Karla Monterroso, the CEO of Code 2040, said these issues stem from the fact that HR is often considered a &#34;risk mitigation tool&#34; for companies. Although it&#39;s usually the only internal mechanism through which employees can register harassment and discrimination complaints, ultimately the purpose of HR is to protect the company, she said, incentivizing many HR departments to minimize allegations and shift the burden of proof onto vulnerable employees.\n  In one recent high-profile  example, Aerica Banks publicly alleged that Pinterest&#39;s HR teams targeted her and subjected her to months of painful questioning after she filed multiple complaints alleging discrimination, retaliation and unfair treatment by her manager, the general counsel and the deputy general counsel. Banks was Pinterest&#39;s public policy and social impact manager.\n Shortly after she made the allegations, she said, the HR investigation turned on her. The investigators on the &#34;business misconduct team&#34; — all of whom worked in her department — questioned her for hours, often late into the night, over the course of several months. She said their questions became inappropriate and derogatory. At one point, the team investigating the matter compelled multiple employees to turn in their phones, threatening retaliation if they did not, Banks said.\n  &#34;It was complete intimidation,&#34; Banks told Protocol, referring to the whole ordeal. &#34;They said, &#39;We&#39;re investigating your claims, but also we&#39;re investigating you.&#39;&#34; She described the process as opaque and secretive. She also said the team did not put in place any processes to ensure her manager did not retaliate against her as the investigation unfolded, leaving her open to more harassment from the boss that she had made allegations against.\n Ultimately, the investigation did not find any wrongdoing by her manager or others, according to a document obtained by Protocol that summarized the findings. For nearly every allegation — including complaints that the male general counsel had devalued the views of women in a meeting, and that the female general counsel had treated Banks differently than others because of her race — the investigators at the company said they found no evidence of discrimination. In one instance where Banks had alleged her manager made racially derogatory comments, the investigator concluded he was not guilty because the comments did &#34;not indicate bias on their own and are not a violation of our Code of Conduct.&#34;\n &#34;It was like telling me, &#39;Sure, this happened to you … but we&#39;re not going to apply our own code of conduct to it because your feelings don&#39;t matter, its impact on you doesn&#39;t matter, and we&#39;re going to find any loophole to let your manager off the hook,&#39;&#34; she said.\n  Since Banks and her colleague Ifeoma Ozoma went public with their allegations several weeks ago, Pinterest has brought in an outside lawyer to investigate their claims. A Pinterest spokesperson said, &#34;We never want anyone to feel the way Ifeoma and Aerica did while they were working at Pinterest.&#34;\n  Nicole Sanchez, a tech veteran and top diversity consultant with Vaya Consulting, said she has watched a similar dynamic play out during her many years working with the industry: Often, according to Sanchez, when employees of color report instances of discrimination or unequal treatment, their concerns are dismissed and they face long-lasting repercussions for speaking up at all. &#34;This is one of the missteps companies have made over and over and over again — waving a flag in HR like, &#39;Hey people of color, underrepresented folks, come talk to us over here,&#39; but … it can feel like a trap,&#34; she said.\n Adam Thomas was at a conference when he noticed his white colleagues at a New Jersey-based ecommerce company were using &#34;blaccents,&#34; mocking African-American vernacular, in one of the company&#39;s public Slack channels. He said one colleague during the conversation said, &#34;Y&#39;all crazy with the &#39;jive talk.&#39;&#34; (Protocol is not naming the company because Thomas is  under an NDA and cannot speak about the firm publicly.)\n &#34;That was super offensive,&#34; Thomas, who was then the only Black employee at the company, said. He immediately brought the issue to the head of HR, who responded that she would make sure the people involved were reprimanded and it would not happen again.\n  Two weeks later, HR had not intervened, Thomas said. He received one apology from a man who worked for him. And when he sat down with the head of HR, Thomas said, she encouraged him to get over it and warned that he might not fit in at the company if he did not move past the situation.\n &#34;I didn&#39;t know how much of a toll it would take on me — socially or physically,&#34; Thomas said. &#34;I was a mess. I had to take anti-anxiety pills for the first time in my life.&#34; He said he doesn&#39;t trust HR anymore after that incident.\n When employees decide to report harassment or discrimination that they have faced, they are often asked to provide substantial evidence that there was ill intent or that the mistreatment was racially motivated. That high standard is often difficult to reach for Black and brown employees facing daily microaggressions from co-workers and managers, said Evelyn Carter, a director with diversity consulting company Paradigm.\n &#34;All too often, when it comes to racism, bias or inequities, I see organizations put the burden of proof on the impacted employee,&#34; said Carter, who has worked with tech companies including Snap. &#34;And yet, bias often emerges in subtle forms — brief interactions that may easily be explained away by some but that point to a consistent pattern of discrimination that cause measurable harm for employees&#39; well-being, health and workplace outcomes.&#34;\n   On the flip side, when people of color are on the receiving end of an HR complaint, some tech employees said they have seen the allegations taken much more seriously.\n Jonathan Lightfoot, who has worked in IT for 20 years, said he felt like he was immediately put on &#34;trial&#34; when one of his white employees reported him to HR for mistreatment several years ago at an IT consulting firm. Earlier in his career, Lightfoot said, he had tried to report instances of racism to HR but was not taken seriously. But &#34;now that I&#39;m a Black person in a leadership position and somebody makes a complaint against me, HR investigates me,&#34; he said.\n For two weeks, Lightfoot said he fielded questions from HR and turned over extensive emails and documents about his management of the team. At the end of the investigation, HR transferred Lightfoot&#39;s white co-worker to another office, he said.\n After the investigation concluded, Lightfoot said fellow managers, all of whom were white, began offering him unsolicited advice about leadership and management, even though the investigation was supposed to be confidential. He ended up choosing to leave the company within six months because he felt the working environment has become increasingly hostile toward him.\n Sanchez said she has intervened in numerous situations in which Black people were seemingly targeted by HR, pointing out that the complaints often use coded language, such as describing Black men as &#34;intimidating.&#34; &#34;There&#39;s a set of questions to ask HR [in those instances], including, &#39;Is this how you handle all cases where this is an allegation?&#39;&#34; she said. &#34;That usually wakes people up.&#34;\n  All of this contributes to a reluctance among Black and brown employees to even report issues to HR. One former Twitter employee who asked to remain anonymous said that a manager once reprimanded them for spending too much time focusing on &#34;Black stuff,&#34; which the employee took to mean work on diversity and inclusion. But the employee swallowed the comment, rather than raising it with HR. &#34;You think: I still have to work with this person. Is there going to be animosity on this team because there&#39;s an inquiry to this?&#34; the employee said.\n The employee said they genuinely believed Twitter&#39;s HR department was committed to building a more diverse workforce, but that the company appeared to focus more on recruiting diverse employees and not enough on retaining them. &#34;I think the goal with regards to diversity at Twitter was very much about bringing in new talent versus keeping the talent that was there,&#34; the employee said, noting that that&#39;s begun to change under the company&#39;s new head of diversity, Dalana Brand.\n A Twitter spokesperson said the company is &#34;on a journey to becoming the world&#39;s most inclusive and diverse tech company&#34; and pointed to the company&#39;s goal of having 25% of its workforce be underrepresented minorities by 2025. &#34;We&#39;re headed in the right direction, but we&#39;ve got a lot of work to do and progress can never be fast enough,&#34; the spokesperson said.\n   Ellen Pao, former Reddit CEO and co-founder of tech inclusion nonprofit Project Include, said the key to having an effective and fair HR department is a CEO who is dedicated to anti-racism. &#34;At the end of the day, the CEO has to want to have that culture be healthy and have to want to root out the problems that are probably in their company,&#34; she said. In 2015, Pao sued VC firm Kleiner Perkins Caufield &amp; Byers for gender discrimination and retaliation.\n Without buy-in from leadership, even well-meaning HR departments can find themselves hamstrung. In early June, the leaders of employee resource groups at Tesla  sent a list of proposals to HR, pushing CEO Elon Musk to take action to address racism, following the killing of George Floyd by Minnesota police. They&#39;d already received heartfelt notes from several HR executives, but had yet to hear from Musk directly. One member of a Tesla employee resource group says they still haven&#39;t.\n &#34;There&#39;s a lot of people who don&#39;t think HR is working in our interest,&#34; the employee said. &#34;If Elon doesn&#39;t care about it, it&#39;s not going to happen.&#34;\n On June 19, Musk did  tweet that his two companies, Tesla and SpaceX, were making Juneteenth official U.S. holidays, but a letter from HR to Tesla employees specified that the day off would be unpaid. Tesla did not respond to Protocol&#39;s request for comment.\n YouTube, for one, has made changes to its internal investigations process since Williams made her complaint. A spokesperson noted that after receiving employee feedback about the difficulty of being part of investigations, YouTube launched an Investigations Care Team, where employees can seek additional resources, including counseling. They also created a policy that allows people lodging complaints to bring a support person from within Google to meetings throughout the investigation.\n  Diversity consultants who spoke to Protocol had a range of ideas for fixing HR. Monterroso suggested placing HR under the umbrella of diversity and inclusion rather than the legal department, potentially changing the incentive structure of HR workers. Carter recommended making diversity and inclusion a &#34;critical core competency&#34; for their HR teams. Sanchez said companies should create an entirely separate vertical within tech companies to deal with diversity and workplace culture issues outside of HR. Williams, the former YouTube employee, is building a  tool to help managers identify and root out bias in their performance reviews.\n &#34;It&#39;s a blind spot that tech has had for decades,&#34; Pao said. &#34;Now we&#39;re starting to talk about it — but are we actually going to really solve the problem?&#34;\n &#34;That takes work and that takes change,&#34; she said. &#34;That takes really looking at our own organizations and saying, &#39;We have not done a good job.&#39;&#34;", "posttime": "2020-07-13 23:01:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人力资源部,company,员工", "title": "消息来源详细说明了黑色和棕色技术员工在向人力资源部门报告事件时面临的问题，人力资源部门通常只为保护公司利益而工作", "title_en": "Sources detail issues faced by Black and brown tech employees when reporting incidents to HR departments, which often work only to protect company interests", "transed": 1, "url": "https://www.protocol.com/tech-hr-failing-racism", "via": "", "real_tags": ["人力资源部", "company", "员工"]}, {"category": "", "categoryclass": "", "imagename": "17bdc5496cfc3cf999c4922b65f95bff.png", "infoid": 1011513, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人脑是生物工程的奇迹。它允许我们在几千年的时间里积累和传承许多先辈的知识，导致了一个进入太空的文明，教会了计算机看东西和说话，并不断地发现和研究宇宙的规律。\n它的复杂性令人震惊，我们还没有完全理解它。正因为如此，偶尔会有关于大脑功能的神话浮出水面。在这类传说中，最突出的就是声称我们是潜伏的天才的传说。但在分析和揭穿这一点之前，让我们先讨论一些大脑事实。\n例如，你知道大脑重约1300-1400克吗？它只占150磅或70公斤人体总体重的2%。但是，它需要：\n那是我们头骨里一个相当耗能的器官！但是，即使与儿童相比，这一点也会逐渐消失：在大约5岁的时候，人类的大脑消耗了多达50%的氧气1。\n令人惊讶的是，当你在休息时，大脑的耗氧量水平与当你做一些认知密集型工作时没有明显的差异。总体而言，对剧烈精神活动期间全脑血流变化的测量未能显示出任何变化。即使是认知任务中涉及最多的区域的局部血流变化通常也只有5%或更少。2个。\n相反，众所周知，葡萄糖是大脑的“燃料”，因此，血糖水平的提高可以对某些任务的认知表现产生积极影响。3个。\n有一个广为流传的神话，认为我们的大脑只能发挥其能力的10%，从而大胆地断言，我们有高达90%的休眠潜力，我们可以唤醒并成为天才。\n不同于其他流传甚广的谣言，这些谣言始于单个事件，或来自设计糟糕的研究的不科学主张(例如，安德鲁·韦克菲尔德和他的欺诈性研究错误地声称疫苗和自闭症之间存在联系)，人类只使用10%大脑的神话始于19世纪末，从那时起，许多人逐渐强化了这一神话。维基百科关于这一主题的文章长篇大论地解释了这个神话多年来的潜在起源和演变。\n在继续之前，我有一个启示。偶尔，我可能会买一件布料，穿一两次。如果我没记错的话，在我的经历中可能有一两件衣服我根本没有穿过。你认识有类似怪癖的人吗？\n这使得我的衣柜很像神话中描述的大脑：我使用了大约10%的大脑，如果有这样的需要，我可以“利用”我衣柜的其余部分。\n但是我们的大脑并不是布料的集合。尽管关于大脑的某些功能仍有未解之谜，但大脑图谱生理学证明，大脑的所有区域都有其用途。你不需要是神经学家来证明这一点，只需回忆一下你在解剖学课上的记忆，大脑有不同的区域，比如额叶，枕叶，小脑，每个脑叶都有自己的作用。\n如果我们只用了10%的大脑，这意味着一个人如果切除了另外90%的大脑就没问题了。1400g的平均大脑中有10%是140g-这是一只绵羊的大脑大小。4由于我怀疑羊是否有90%隐藏的潜在神话，人类仅仅使用了相当于绵羊大脑大小的一部分大脑，就已经进步到了文明的程度，这是没有道理的。\n历史上有过一些人受伤并被切除部分大脑的例子(尽管不到10%)，最突出的(也是最早记录的)是菲尼亚斯·盖奇(Phineas Gage)的案例，他在一次事故中幸存下来，当时一根大铁棒从脸颊底部穿过他的左侧头部，穿过他的左眼和额叶，一直到他的头顶。在那次事故之后，他又活了12年。人们对他的康复有不同的看法，但他花了大约10年的时间才从那次不幸的事件中恢复过来。\n另一个例子是列夫·扎塞茨基(Lev Zasetsky)。一颗子弹进入了他的左侧顶枕区，导致了长时间的昏迷。在这之后，他变得无法感知事物的正确一面。他确实看到的物体往往看起来是零散的碎片，而不是完整的物体。在受伤后生活的50年里，他没有康复。\n正如“人们如何学习--大脑基础知识”一书中提到的那样，我们的大脑可以通过一个叫做神经可塑性的过程进行重新连接，这可以帮助恢复一些因事故而失去的功能。不幸的是，情况并不总是如此。研究人员发现，只有27%的人从脑震荡中恢复过来。这意味着几乎四分之三的人没有完全康复！而这“只是”脑震荡--你的大脑不会失去任何部分。\n如果90%的大脑是不必要的，那么我们从一开始就不太可能不用无关的物质进化出这么大的大脑。造成这种情况的因素有几个：\n历史上由于头骨较大而导致分娩死亡的风险会给选择大脑较小的后代带来压力。\n自然选择偏爱那些提供某种优势的特征。如果它不是生存所必需的，那么这么大的大脑是不可能从一开始就形成的。\n如前所述，大脑需要巨大的能量。即使我们有90%的大脑闲置，突然“唤醒”它，我们也不能为我们的大脑提供足够的能量，因为它已经消耗了整个身体资源的20%-25%。\n所有这些科学证据都与这个神话背道而驰。事实上，我们在任何给定的时间都只使用大脑的部分区域，但在一天中，我们使用所有的区域，而不是只使用10%。下次你听到这个神话的时候，回想一下绵羊的大脑重量。\n如果你喜欢这篇文章，请随时订阅下面的文章，成为第一批收到未来更新的人之一，也可以在Twitter(@iuliangulea)上关注我。\n心算对脑循环和新陈代谢的影响--索科洛夫·L·曼戈尔德，R·韦克斯勒，R·肯尼迪，C&A·凯蒂，S·S·(1955年)↩︎", "note_en": "The human brain is a marvel of biological engineering. It allowed us to accumulate and pass on the knowledge of many prior generations throughout millennia, resulting in a civilization that went into space, taught computers to see and speak, and that continually discovers and investigates the laws of the Universe.\n Its complexity is astounding, and we do not fully understand it yet. And because of that, occasionally, myths about the functioning of the brain pop out. Among the most prominent such legends is the one that claims we are dormant geniuses. But before analyzing and debunking that, let’s discuss some brain facts.\n  For instance, did you know that the brain weighs around 1300-1400 grams? It represents only 2% of the total body weight of a 150 pound or 70kg human. However, it requires:\n   That is quite an energy-hungry organ inside our skull! But even that fades away when comparing to children: at around five years old, the human brain takes up as much as 50% of oxygen consumption  1.\n Surprisingly, the brain’s level of oxygen consumption does not significantly vary when you are resting vs. when you do some cognitively intense work. Overall, measures of the whole brain changes in blood flow during intense mental activity have failed to demonstrate any change. Even  local changes in blood flow of the regions involved most in a cognitive task are often 5% or less.  2\n Conversely, it is well known and demonstrated that glucose is the brain’s “fuel,” therefore increases in blood glucose levels can positively impact cognitive performance in some tasks.  3\n  There is a popular myth that we use our brains at only 10% of its capacity, thus boldly affirming that we have a whopping 90% of dormant potential that we can awaken and become geniuses.\n Unlike other widespread myths that started from a single event, or unscientific claims from poorly designed research studies (e.g.,  Andrew Wakefield and his fraudulent study than falsely claimed a link between vaccines and autism), the myth that humans use only 10% of their brains started at the end of the nineteenth century and was gradually strengthened by many people since then. The  Wikipedia article on the subject has a lengthy explanation of the potential origin and evolution of the myth throughout the years.\n  Before moving on, I have a revelation to make. Occasionally, I might buy a cloth item and wear it once or twice. If I recall correctly, there might have been one or two items in my experience that I have not worn at all. Do you know anyone with similar oddities?\n This makes my wardrobe much like the brain described in the myth: I am using around 10% of it, and I can “tap into” the rest of my wardrobe should such need arise.\n  But our brain is not a collection of cloth items. Though there are still unanswered questions regarding some brain functions, brain mapping physiology demonstrates that all its areas have a purpose. And you do not have to be a neuroscientist to prove that, simply recall from your anatomy classes that the brain has different regions, such as the frontal lobe, occipital lobe, cerebellum, and the fact that each of those lobes has its role.\n   If we are using only 10% of our brains, that means a person would be fine if the other 90% of the brain got removed. 10% of the 1400g average brain is 140g—that’s the size of a sheep’s brain.  4 Since I doubt sheep have their own 90% hidden potential myth, it makes no sense that humans have advanced so far as a civilization by using only part of their brains equivalent in size to a sheep’s brain.\n There are instances in history when people were injured and got parts of their brain removed (although not as close as even 10%), the most prominent (and among the first recorded ones) being the case of  Phineas Gage, who survived an accident where a large iron rod was driven through his left part of the head, from the bottom of the cheek, through his left eye and frontal lobe all the way to the top of his head. He lived 12 years more after that accident. There are varying opinions on his recovery, but it took him ~10 years to recover from the unfortunate event.\n Another example is the case of  Lev Zasetsky. A bullet entered his left parieto-occipital area and resulted in a long coma. Following this, he became unable to perceive the right side of things. Objects he did see often appeared as fragmented pieces rather than whole objects. He did not recover in the 50 years he lived after the injury.\n As mentioned in  How People Learn—The Brain Basics, our brains can rewire through a process called  neuroplasticity, which can help regain some of the lost functions as a result of an accident. Unfortunately, that is not always the case. Researchers have found that only 27% of people recover from a   concussion.  5 That means almost 3 out of 4 people do not fully recover! And this is “just” a concussion—your brain does not lose any of its parts.\n If 90% of the brain were unnecessary, it is highly unlikely that we would not have evolved such big brains with irrelevant matter in the first place. There are several factors for that:\n Historical risk of childbirth deaths due to the big skull size would stress out the selection of offspring with smaller brain sizes.\n Natural selection favors characteristics that offer an advantage of some sort over the other. There is no way such a big brain would have formed in the first place if it wouldn’t be necessary for survival.\n As already mentioned, the brain requires an enormous amount of energy. Even if we had 90% of the brain unused and suddenly were to “wake” it, we couldn’t provide our brains with enough power, as it already consumes 20%-25% of the entire body resources.\n All this scientific evidence works against this myth. We indeed use only some areas of the brain at any given time, but throughout the day, we use all of it, not just 10%. And next time you hear about this myth, recall the sheep brain weight.\n  If you liked this article, feel free to subscribe below to be among the first to receive future updates and follow me on twitter ( @iuliangulea) as well.\n The Effect Of Mental Arithmetic On Cerebral Circulation And Metabolism by Sokoloff L., Mangold, R., Wechsler, R., Kennedy, C. &amp; Kety, S. S. (1955)  ↩︎", "posttime": "2020-07-13 23:00:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大脑,debunking", "title": "揭穿大脑使用率为10%的神话", "title_en": "Debunking the Myth of 10% Brain Usage", "transed": 1, "url": "https://iuliangulea.com/blog/debunking-the-myth-of-ten-percent-brain-usage/", "via": "", "real_tags": ["大脑", "debunking"]}, {"category": "", "categoryclass": "", "imagename": "f0efa62e13080e5ad7f604977747ca82.jpg", "infoid": 1011512, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "变得有吸引力的好处太多了。美丽可能是你在生活中所能拥有的最大的身体优势。然而，与其他可能因种族、性别或性倾向而产生的特权相比，我们并没有太多谈论它。\n有大量证据表明，有魅力的人生活得更轻松。让我们从最明显的开始：性感的人在浪漫上更受欢迎。\n一项实验研究考察了现实生活中快速约会等场景中的浪漫选择，发现吸引力是做出约会决定的唯一最重要的因素。可能会令人惊讶的是，参与者并没有意识到他们对美丽的偏见，报告说他们对吸引力的偏好比他们实际的选择反映的要低。有趣的是，你会经常听到人们声称女性没有男性那么肤浅，但研究表明，尽管女性自我报告对外表的偏好较低，但她们对性感伴侣的实际偏好与男性持平。\n有魅力的人更有可能被认为是有能力的，并被雇佣来工作(Busetta，2013)。他们被认为更聪明，更有社交风度(Kanasawa，2010)。他们被认为具有更好的人格品质，比如值得信赖(DeWolf，2014)。他们被认为更善良(Snyder，Tanke和Berscheid 1977)。他们更有说服力。他们更有可能从陌生人的善举中获益。他们有更大的自尊(桑顿，1991)。\n这种对美的偏见可能会造成真正的伤害。在一项关于吸引力在刑事量刑中作用的荟萃分析中，研究发现，相貌平平的人比长相好的人多判120-305%的刑期。作为对比，另一项研究发现，黑人被判的刑期比白人长6-20%。是的，在刑事量刑中，相貌比种族重要10倍以上。\n名单还在继续。只需在谷歌上搜索“吸引力”和任何想要的社交结果，你就可以自己看看了。关于相貌优势的研究很多，而且始终如一。\n这些优势明显很早就开始了。被认为更有吸引力的孩子会受到成年人和同龄人的更多尊重和钦佩，也更有可能表现出他们身上投射到他们身上的积极特征，比如智力和合群，创造了一个能力和自尊的良性心理循环。这意味着，长相较好的人在成年后不仅会被认为更聪明、更有能力，而且在其他条件不变的情况下，他们实际上会成长为更聪明、更有能力的人。\n有魅力的人可能很难接受这一切。要做到这一点，至少需要将他们的部分成就降级到一些主要是不劳而获的东西上。\n我的一个朋友是一个25岁左右的漂亮女孩，她经营着一个化妆和生活方式的Instagram账户和随行的博客。她天生拥有完美、闪闪发光的焦糖皮肤，富有感染力的微笑，以及那种像斑比一样无助的大眼睛，这种大眼睛激发了大多数异性恋男人用毯子包裹他们并保护他们的本能。从哪里来的？我不知道。\n她曾在一篇文章中写道：“你的长相并不像你想的那么重要。人们对你的看法与你的外表无关，而是你给他们的感觉。“。\n我曾经把这篇文章拿给我的另一位朋友看，她指着自己张开的嘴巴，发出了一声哽咽的声音。没有什么比那些从未经历过自己建议主题的人的指导更具启发性的了，比如阅读依赖信托基金生活的人关于努力工作的优点的文章。\n没有人怀疑个性是重要的。事实恰恰相反，真的。培养真正讨人喜欢的个性通常是在缺乏非凡外表的情况下找到接受的途径。我有时会想，当你十几岁的时候，是否一个伟大的人格就是丑陋带来的安慰奖。\n所有这一切都提出了一个问题：如果美貌是一种特权，那么为什么它不是社会正义活动家更关注的焦点呢？\n一种解释是，当谈到外表美时，我们中的大多数人都有点否认。在非官方但普遍理解的长相10分标准中，我听到人们称自己为5分，但从来没有1分或2分。\n你可能会告诉朋友“你是10分”，但你最后一次告诉别人你尊敬“你很丑”是什么时候？在委婉的世界里，“平均”是低于平均水平的新词汇，而“丑陋”是一个禁忌术语，主要是为高中欺凌弱小的人或在沙盒里玩耍的孩子保留的-或者现在5岁的孩子做的任何事情。\n另一种解释是，我们对有魅力的人的偏见在我们的动物大脑中根深蒂固，以至于我们实际上无法改变它们。像种族主义、性别歧视、同性恋恐惧症这样的事情大多是社会建构的，社会习俗可以演变。过去的偏见可能会成为著名的骄傲点。Z世代的孩子对易性恐惧症更敏感，而千禧一代的孩子则不是。千禧一代的孩子对同性恋恐惧症更敏感，而X世代则不是。诸若此类。但是，当谈到外表的美丽时，有很大的变化吗？\n常见的乐观反驳是，美确实是一种社会结构，我们有能力摆脱偏爱传统上美丽的人的本能。这场争论的重点是，美的标准已经改变，仅在过去几十年里，就从历史上的欧洲标准转变为更具全球性的标准。更黑的皮肤，更宽的鼻子，弯曲的臀部，更厚的嘴唇，都比一个世纪前更美丽了。\n像多芬的“真美”活动这样的媒体活动，展示了“真实”的人，他们在电视上最难看的是，在重新训练我们的动物大脑以购买更可达到的标准方面走在了前列。\n但现实是，美的标准在边缘演变，但在核心基本保持不变。美的信条在不同的时代和文化中比你想象的要固定得多。\n以下是客观上美丽的特征列表，以及客观上丑陋的特征缺失列表。面部和身体对称；比例解剖、身高(尤其在男性中)；一套完整的、直的、白色的牙齿；浓密的头发；干净、匀称、紧绷的皮肤；健美的体格；匀称的特征；大大的眼睛。\n就像前面提到的约会实验一样，我们希望相信外表并不重要，但我们的行动却不是这样说的。我们想要变得漂亮。我们想和漂亮的人约会。我们希望我们的孩子都很漂亮。\n我总是很难调和我自己对美的不平等的理性感受和我的本能驱动力。我多么快就为一张美丽面孔的居民的可怕和粗心大意找借口。我是如何不知不觉地玩智力体操来取长补短的。\n我怀疑这些人生活在一个完全不同的现实中。一生受到关注和崇拜，必然会给别人带来一定的期望。他们习惯了素不相识的仰慕者。他们喜欢旅行，因为来自世界各地的陌生人让他们备受关注。约会是简单地说“是”的问题，而不是通过反复令人心碎的拒绝来学习追逐或被追逐的微妙之处。\n火辣不仅是一种特权，在某些方面也是终极特权。它超越了其他社会等级。炙手可热的人往往是打破偏见、推进社会事业的先锋。\n当我第一次听说珍娜·塔拉科娃(Jenna Talackova)时，我24岁，住在温哥华。她是加拿大环球小姐的竞争者，最初因为她是变性人而被取消资格。我从来不太关注选美比赛，但有几个星期，珍娜是媒体关注的中心。我记得当她的故事被曝光时，公众对她的同情之情溢于言表。即使是保守的媒体和宗教界的成员显然也开始热衷于这样的想法，即也许有些人真的出生在不同的性别，而不是他们的生物学决定的性别。珍娜的与众不同之处在于她非常漂亮。一个古板、古板、异性恋的男人，除了承认她确实是个女人外，还会如何解释对另一个男人的生理吸引力呢？\n你的答案实际上取决于你的意识形态，所以让我陈述我的观点：我相信机会平等，但不相信结果平等。\n美貌，就像智力、积极的情感或抗病能力一样，在很大程度上是生活中的一种基因优势，我们不应该加以惩罚。我们每个人的武器库里都有不同的工具，生活不是关于公平的，而是关于充分利用你所得到的东西。\n话虽如此，美貌的优势应该仅限于社交领域，而不是像刑事司法系统这样的机构。如果将来我们使用深度假冒技术使刑事被告看起来均匀美丽(或丑陋)，我不会感到惊讶。\n此外，在一个理想的社会中，美的标准不应该有利于一个种族或群体而不是另一个种族或群体。虽然我认为面部对称或牙齿整齐之类的东西被普遍认为是美丽的，但欧洲主导的美丽标准是长达一个世纪的社会工程的副产品，要重新设定这些标准，我们还有很长的路要走。\n有很多关于白人公主、白人模特和白人超级英雄如何从非常年轻的时候就向孩子们灌输欧洲至高无上的美丽标准的文章。无论如何，好莱坞似乎终于领会了这一信息，但还有很长的路要走。把一个棕色、黑色或黄色的角色放在一部白人电影的配角中是不够的，而是要把少数族裔塑造成复杂的、完全成形的主角。\n与我们被告知的不同，我们并不都是天生的(平等的)美丽--至少在古典的、生理的意义上不是这样的。这没什么大不了的。我们别再装了。因为与许多事情一样，接受真相是迈向和平和富有成效的变革的第一步。", "note_en": "The benefits of being attractive are exorbitant. Beauty might be the single greatest physical advantage you can have in life. And yet compared to other other privileges that may arise from race, gender, or sexuality, we don’t talk much about it.\n There is plenty of evidence that attractive people have it easier. Let’s start with the most obvious: hot people are more desired romantically.\n Experimental research that examined real life romantic choices from scenarios like speed dating found that attractiveness was the single most important factor in making dating decisions. What might come as a surprise is that participants were unaware of their bias for beauty, reporting a lower preference for attractiveness than what their actual choices reflected. Interestingly, you’ll hear people often claim that women are less superficial than men, but what the study showed was that while women self reported a lower preferences for looks, their actual preference for hot partners was equal to that of men.\n  Attractive people are more likely to be seen as competent and be hired for a job ( Busetta, 2013). They are perceived as smarter and having more social grace ( Kanasawa, 2010). They are perceived to have better personality qualities like trustworthiness (Dewolf 2014). They are perceived as kinder (Snyder, Tanke and Berscheid 1977). They are more persuasive. They are more likely to benefit from acts of kindness from a stranger. They have greater self esteem ( Thornton, 1991).\n This bias for beauty can cause real harm. In a meta analysis of the role of attractiveness in criminal sentencing, it was found that  unattractive people received 120–305 percent longer sentences than attractive people.  As a comparison, another study found that black people received 6–20 percent longer sentences than white people. Yes, in criminal sentencing, looks were over 10x more important than race.\n  The list goes on. Just google “attractiveness” and any desirable social outcome and see for yourself. Research pertaining to the advantages of good looks is bountiful and consistent.\n These advantages start remarkably early. Children who are perceived to be more attractive are treated with more respect and admiration from adults and peers alike, and are more likely to manifest the positive traits, like intelligence and gregariousness, projected onto them, creating a virtuous psychological loop of competence and self esteem. Meaning that into adulthood, better-looking people aren’t just perceived to be smarter and more competent, but, all things being equal, they actually develop into smarter, more competent people.\n Attractive people might have a hard time coming to terms with all of this. Doing so would require relegating at least part of their achievements to something mostly unearned.\n A friend of mine is a beautiful young girl in her mid twenties who runs a makeup and lifestyle instagram account and accompanying blog. She is blessed with naturally perfect, glowing, caramel skin, infectious smile, and the kind of large, Bambi-like, helpless eyes that stimulates in most straight men an instinct to wrap them in a blanket and protect them. From what? I don’t know.\n She wrote in an article once “The way you look doesn’t matter as much as you think. The way people perceive you has nothing to do with the way you look, but how you make them feel.”\n I once showed this article to another friend of mine and she pointed at her open mouth and made a gagging sound. There is little more triggering than instruction from someone who has never had to experience the subject of their own advice, like reading about the virtues of hard work from someone who lives off a trust fund.\n No one is doubting that personality is important. The opposite, really. Developing a genuinely likeable personality is often the path of finding acceptance in the absence of remarkable looks. I sometimes wonder wether a great personality is the consolation prize of being ugly when you’re a teenager.\n All of this raises the question: if good looks are such a privilege, then why isn’t it more of focus of social justice activists?\n One explanation is that most of us are a bit in denial when it comes to physical beauty. On the unofficial but universally-understood 10-point scale of looks, I’ve heard people call themselves a five, but never a one or a two.\n You might tell a friend “you’re a 10” but when was the last time you told someone you respect “you’re ugly.” In the world of euphemisms, “average” is the new below average and “ugly” is a taboo term reserved mostly for high school bullies or kids playing in sandboxes — or whatever it is five year olds do now.\n Another explanation is that our biases towards attractive people are so ingrained in our animal brains that we can’t actually change them. Things like racism, sexism, homophobia are mostly socially constructed, and social mores can evolve. Prejudices of the past can become celebrated points of pride. Gen Z children are more sensitive to transphobia in a way that millennial children were not. Millennial children were more sensitive to homophobia in a way that Gen X were not. And so on. But when it comes to physical beauty, has much changed?\n The common optimistic retort is that beauty is indeed a social construct and that we have the capability of shedding ourselves of the instinct favouring conventionally beautiful people. The keystone in this argument is the fact that standards of beauty have changed, and in the past few decades alone have moved from historically European standards to more global ones. Darker skin, wider noses, curvy hips, thicker lips, are all more beautiful today than they were a century ago.\n Media campaigns like Dove’s “real beauty” campaign, which showcases “real” people, who are at worst tv ugly, are at the forefront of retraining our animal brains to buy into more attainable standards.\n But the reality is that standards of beauty evolve around the margins but stay mostly constant at their core. The tenets of beauty are much more fixed across time and culture than you might think.\n Here is a list of features that are objectively beautiful, and their absence, objectively ugly. Facial and body symmetry; proportional anatomy, height (particularly among men); a full set of straight, white teeth; a full head of hair; clear, evenly-toned, taut, skin; a well-toned physique; proportional features; large eyes.\n Like the earlier-mentioned experiment on dating found, we want to believe looks are unimportant, but our actions say otherwise. We want to be beautiful. We want to date beautiful people. We want our children to be beautiful.\n I’ve always had a hard time reconciling my own rational feelings about the inequities of beauty with my instinctual drives. How quickly I make excuses for the awfulness and thoughtlessness of an inhabitant of a beautiful face. How I unconsciously play mental gymnastics to make virtues of their faults.\n I suspect these people live in an entirely different reality. A lifetime of receiving attention and adoration must create certain expectations of other people. They are accustomed to admirers they’ve never met. They love to travel, because strangers from around the world adorn them with attention. Dating is a matter of simply saying yes, not learning through repeated heartbreaking rejections the subtleties of chasing or being chased.\n Hotness isn’t just a privilege, it is in some ways the ultimate privilege. It transcends other social hierarchies. Hot people are often the pioneers in breaking prejudiced ideas and advancing social causes.\n I was 24 and living in Vancouver when I first heard of Jenna Talackova, a Miss Universe Canada contender who was initially disqualified because she was transgender. I never paid much attention to beauty pageants but for a few weeks, Jenna was the center of media attention. I recall the public outpouring of sympathy she received when her story came to light. Even conservative media outlets and members of the religious community apparently were warming to the idea that perhaps some people are genuinely born to a different gender than their biology would otherwise dictate. What set Jenna apart was that she was remarkably beautiful. How would a stodgy, old-world, straight man explain a physiological attraction to another man other than to accept that she is indeed a woman?\n    Your answer really depends on your ideology so let me state mine: I believe in equality of opportunity but not equality of outcome.\n Good looks, just like intelligence, positive affect, or disease-resistance, is a largely genetic advantage in life that we should not punish. We are all born with different tools in our arsenal and life is not about fairness but about making the best of what you’ve been given.\n Having said that, the advantages of good looks should stay confined to social arenas and not institutions like the criminal justice system. I wouldn’t be surprised if in the future we use  deepfake technology to make criminal defendants’ looks homogeneously beautiful (or ugly).\n Moreover, in an ideal society, standards of beauty should not benefit one race or group over another. While I’ve argued that things like facial symmetry or straight teeth are universally considered beautiful, European-dominated standards of beauty are a byproduct of century-long social engineering and we still have a long ways to go in resetting those standards.\n  There’s been a lot written about how white princesses, white models, and white superheroes indoctrinate children with the supremacy of European standards of beauty from a remarkably young age. For what it’s worth, Hollywood seems to have finally gotten the message, but there’s a long ways to go. It’s not enough to throw a brown, black, or yellow character into a supporting role of a white movie, but instead casting minorities as complex, fully-formed protagonists in their own right.\n Unlike what we’re told, we are not all born (equally) beautiful — at least not in the classical, physical sense. And that’s okay. Let’s just stop pretending. Because as with many things, acceptance of the truth is the first step towards peace and productive change.", "posttime": "2020-07-13 22:59:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特权,privilege,标准", "title": "我们从未谈论过的最大特权：美丽", "title_en": "The greatest privilege we never talk about: beauty", "transed": 1, "url": "https://medium.com/@sfard/the-greatest-privilege-we-hardly-talk-about-beauty-7db3f70c1116", "via": "", "real_tags": ["特权", "privilege", "标准"]}, {"category": "", "categoryclass": "", "imagename": "482bc6246fcb4ff2605c1fea8123aa24.jpg", "infoid": 1011511, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "就像为音乐家设定节奏的节拍器一样，一个基本的宇宙时钟可能会在整个宇宙中保持时间。但如果存在这样的时钟，它的滴答声就会非常快。\n在物理学中，时间通常被认为是第四维。但一些物理学家推测，时间可能是物理过程的结果，比如内置时钟的滴答作响。\n根据6月19日发表在“物理评论快报”上的一项理论研究，如果宇宙确实有一个基本钟，它的运行速度必须超过每秒10亿次。\n在粒子物理学中，微小的基本粒子可以通过与其他粒子或场的相互作用来获得性质。例如，粒子通过与希格斯场相互作用获得质量，希格斯场是一种遍及整个空间的糖蜜(SN：7/4/12)。宾夕法尼亚州立大学的物理学家马丁·博乔瓦尔德(Martin Bojowald)说，也许粒子可以通过与类似类型的场相互作用来体验时间。这个磁场可能会振荡，每个周期就像一个常规的滴答声。这项研究的合著者之一Bojowald说：“这真的就像我们对我们的时钟所做的那样。”\n时间在物理学中是一个令人费解的概念：两个关键的物理学理论在如何定义它方面存在冲突。在描述微小原子和粒子的量子力学中，“时间就在那里。已经修好了。这是一个背景，“加拿大滑铁卢周长研究所的物理学家弗拉米尼亚·贾科米尼(Flaminia Giacomini)说。但是在描述万有引力的广义相对论中，时间移动的方式是怪异的。例如，地球表面的时钟比轨道卫星上的时钟走得慢。\n没有参与这项研究的贾科米尼说，在试图将这两种理论结合成一个量子引力理论时，“时间问题实际上相当重要”。研究不同的时间机制，包括基本钟，可以帮助物理学家形成这一新理论。\n研究人员考虑了基本钟对原子钟行为的影响，原子钟是有史以来制造的最精确的钟(SN：10/5/17)。如果基本钟走得太慢，这些原子钟将不可靠，因为它们会与基本钟不同步。因此，原子钟将以不规则的间隔滴答作响，就像不能保持稳定节拍的节拍器一样。但到目前为止，原子钟一直是高度可靠的，这使得Bojowald和他的同事可以限制基本钟必须走多快，如果它存在的话。\n物理学家怀疑秒数的细微划分是有极限的。量子物理禁止任何小于10-43秒的时间段，这段时间被称为普朗克时间。如果存在基本钟，那么普朗克时间可能是它的一个合理的计时速度。\n为了验证这一想法，科学家们需要将他们目前对时钟滴答速度的限制-每秒数万亿次-增加约200亿倍。这似乎是一个巨大的差距，但对一些物理学家来说，这是出人意料的接近。“这已经出人意料地接近了普朗克体制，”没有参与这项研究的周界物理学家比安卡·迪特里奇(Bianca Dittrich)说。“通常情况下，普朗克政权与我们的所作所为真的相去甚远。”\n然而，Dittrich认为宇宙中可能没有一个基本钟，而是可能有多种过程可以用来测量时间。\nBojowald说，尽管如此，与世界上最大的粒子加速器-大型强子对撞机的实验相比，新的结果更接近普朗克制度。在未来，更精确的原子钟可以提供更多关于宇宙运转的信息。\n书名/作者Martínez and M.Bojowald.。一段基本时间的物理含义。物理评论快报。第124卷，2020年06月19日，241301页。DOI：10.1103/PhysRevLett.124.241301.", "note_en": "Like a metronome that sets the tempo for a musician, a fundamental cosmic clock may be keeping time throughout the universe. But if such a clock exists, it ticks extremely fast.\n In physics, time is typically thought of as a fourth dimension. But some physicists have speculated that time may be the result of a physical process, like the ticking of a built-in clock.\n If the universe does have a fundamental clock, it must  tick faster than a billion trillion trillion times per second, according to a theoretical study published June 19 in  Physical Review Letters.\n In particle physics, tiny fundamental particles can attain properties by interactions with other particles or fields. Particles  acquire mass, for example, by interacting with the Higgs field, a sort of molasses that pervades all of space ( SN: 7/4/12). Perhaps particles could experience time by interacting with a similar type of field, says physicist Martin Bojowald of Penn State. That field could oscillate, with each cycle serving as a regular tick. “It’s really just like what we do with our clocks,” says Bojowald, a coauthor of the study.\n  Time is a puzzling concept in physics: Two key physics theories clash on how they define it. In quantum mechanics, which describes tiny atoms and particles, “time is just there. It’s fixed. It’s a background,” says physicist Flaminia Giacomini of the Perimeter Institute in Waterloo, Canada. But in the general theory of relativity, which describes gravity, time shifts in bizarre ways. A clock on the surface of the Earth ticks more slowly than one aboard an orbiting satellite, for example.\n In attempts to combine these two theories into one theory of quantum gravity, “the problem of time is actually quite important,” says Giacomini, who was not involved with the research. Studying different mechanisms for time, including fundamental clocks, could help physicists formulate that new theory.\n The researchers considered the effect that a fundamental clock would have on the behavior of  atomic clocks, the most precise clocks ever made ( SN: 10/5/17). If the fundamental clock ticked too slowly, these atomic clocks would be unreliable because they would get out of sync with the fundamental clock. As a result, the atomic clocks would tick at irregular intervals, like a metronome that can’t keep a steady beat. But so far, atomic clocks have been highly reliable, allowing Bojowald and colleagues to constrain how fast that fundamental clock must tick, if it exists.\n Physicists suspect that there’s an ultimate limit to how finely seconds can be divided. Quantum physics prohibits any slice of time smaller than about 10 -43 seconds, a period known as the Planck time. If a fundamental clock exists, the Planck time might be a reasonable pace for it to tick.\n To test that idea, scientists would need to increase their current limit on the clock’s ticking rate — that billion trillion trillion times per second number — by a factor of about 20 billion. That seems like a huge gap, but to some physicists, it’s unexpectedly close. “This is already surprisingly near to the Planck regime,” says Perimeter physicist Bianca Dittrich, who was not involved with the research. “Usually the Planck regime is really far away from what we do.”\n However, Dittrich thinks that there’s probably not one fundamental clock in the universe, but rather there are likely a variety of processes that could be used to measure time.\n Still, the new result edges closer to the Planck regime than experiments at the world’s largest particle accelerator, the Large Hadron Collider, Bojowald says. In the future, even more precise atomic clocks could provide further information about what makes the universe tick.\n   G. Wendel, L. Martínez and M. Bojowald.  Physical implications of a fundamental period of time.  Physical Review Letters. Vol. 124, June 19, 2020, p. 241301. doi: 10.1103/PhysRevLett.124.241301.", "posttime": "2020-07-13 22:59:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "宇宙,fundamental,时间", "title": "宇宙可能有一个非常非常快的基本钟。", "title_en": "The universe might have a fundamental clock that ticks very, very fast", "transed": 1, "url": "https://www.sciencenews.org/article/time-universe-fundamental-cosmic-clock/", "via": "", "real_tags": ["宇宙", "时间"]}, {"category": "", "categoryclass": "", "imagename": "3da3e0a8f1dd67b907b87a5e884fe11d.jpg", "infoid": 1011510, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们生活在多么奇怪的时代。谁会想到我会写一篇关于微软是谷歌Chrome最好的事情的文章呢？几年前，微软参与开源项目的想法会让人又笑又怕。\n你知道…。微软是开源的敌人，他的首席执行官曾说过Linux是“一种在知识产权意义上依附于它所触及的一切东西的癌症”。这家公司不能制造一款像样的网络浏览器来挽救自己的生命。\n但是，信不信由你，我真的认为微软的参与让Chrome成为了一个更好的浏览器。\n首先，微软在很久以前就放弃了对开源的反感，现在它是Linux基金会的白金赞助商，在某些指标上，它现在也是世界上最大的开源贡献者。\n基本上，既然微软放弃了对开源的反对，不仅接受了开源，而且把钱放在了嘴边，微软参与开源项目的想法不再是噩梦。事实证明，它已经对开放源码社区做出了有价值的贡献。\n但是这对谷歌的Chrome浏览器有什么影响呢？嗯，自从微软在Edge网络浏览器中停止使用自己的网络引擎EdgeHTML，转而构建了一个基于Chromium的全新版本以来，它一直在为Chromium提供源源不断的修复和新功能-这些不仅让Edge受益，也让Chrome受益。\n最新的例子是微软终于解决了一个问题，即在Windows10中Chrome的通知加倍，点击错误的通知将无法打开用Chrome发送通知的网站。它成功地做到了既烦人又没用的令人印象深刻的壮举。\n然而，微软向Chromium项目提交了修复该问题的代码。虽然微软修复了一个影响其操作系统的问题并不太令人惊讶，但也有其他一些例子表明，由于Chrome的投入，微软让Chrome成为了一个更好的浏览器。\n我以前曾抱怨过我是多么讨厌Chrome是一个巨大的RAM占有者，微软已经找到了一种方法，通过防止用户在观看视频时进行不必要的磁盘缓存，来阻止它占用如此多的内存，同时在笔记本电脑上运行时消耗更少的电池。\n微软的一位开发人员最近还修复了Google Chrome中一个特别恼人的怪癖，它可能会导致你意外丢失当前的选项卡。还有很多其他的例子。\n好的，所有这些修复主要是为了整理Chromium Edge，但重要的是，它们也改进了人们实际使用的网络浏览器。\n对于任何对谷歌对Chrome的处理感到沮丧的人来说，微软一直在改进浏览器的事实是一个奇怪的事实-但值得欢迎的发展。\n我从来没有想过我会庆祝微软参与了一个开源项目--但在这种情况下，我很高兴能这么做。", "note_en": "What strange times we live in. Who’d have thought that I’d be writing an article on how Microsoft is the best thing to happen to Google Chrome? A few years ago the idea of Microsoft getting involved in an open source project would cause a mixture of laughter and dread.\n You know… Microsoft, the foe of open source who had a CEO that once said that Linux was “a cancer that attaches itself in an intellectual property sense to everything it touches.” The company that couldn’t make a decent web browser to save its life.\n But, believe it or not, I really do think that Microsoft’s involvement has made Chrome a much better browser.\n     First of all, Microsoft ditched its antipathy to open source a good while ago now, and it’s a now a platinum sponsor of the Linux Foundation, and in some metrics it’s also now the biggest open source contributor in the world.\n Basically, since dropping its opposition to open source, and not only embracing it, but putting its money where its mouth is, the thought of Microsoft being involved with an open source project is no longer the stuff of nightmares. It’s proved to be a valuable contributor to the open source community already.\n But how does this affect Google’s Chrome browser? Well, ever since Microsoft  stopped using its own web engine, EdgeHTML, for its Edge web browser, and instead built a brand-new version that’s based on Chromium, it’s been contributing a steady stream of fixes and new features to Chromium – and those have not just been benefitting Edge, but Chrome as well.\n The latest example of this is  Microsoft finally fixing an issue where notifications for Chrome doubled up in Windows 10, and clicking the wrong one would fail to open up the website that was sending the notification in Chrome. It managed the impressive feat of being both annoying  and useless.\n However, Microsoft submitted code to the Chromium project that fixes the issue. While Microsoft fixing an issue that affects its operating system isn’t too surprising, there have been a number of other instances where Microsoft has made Chrome a better browser thanks to its input.\n  I’ve complained before about  how sick I am of Chrome being a massive RAM hog, and  Microsoft has found a way to stop it gobbling up so much memory, while also draining less battery when run on a laptop, by preventing unnecessary disk caching when users watch videos.\n A Microsoft developer also  recently fixed a particularly annoying quirk in Google Chrome that can result in you accidentally losing your current tab. And there are many other examples.\n OK, so all these fixes were primarily aimed at sorting out Chromium Edge, but the important thing is that they also improve a web browser people actually  use.\n For anyone who’s been frustrated by Google’s handling of Chrome, the fact that Microsoft has been bringing improvements to the browser is a strange – but welcome development.\n I never thought I’d be celebrating Microsoft’s involvement in an open source project – but in this case, I’m very happy to be doing just that.", "posttime": "2020-07-13 22:58:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "chrome,微软,microsoft,happen", "title": "不知何故，微软是Chrome能遇到的最好的事情", "title_en": "Somehow, Microsoft is the best thing to happen to Chrome", "transed": 1, "url": "https://www.techradar.com/news/somehow-microsoft-is-the-best-thing-to-happen-to-chrome", "via": "", "real_tags": ["chrome", "微软", "microsoft", "happen"]}, {"category": "", "categoryclass": "", "imagename": "fd855a47ab629f14591dcb20a117ca96.jpg", "infoid": 1011508, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果公司表示，这笔资金预计将为数千名加州人提供首次购房者援助或新的、负担得起的住房单元。\n2020年启动的项目包括在整个旧金山湾区新建250套保障性住房-这是与住房信托硅谷(Housing Trust Silicon Valley)建立公私合作伙伴关系资助的第一个保障性住房开发项目。这些单元将横跨北部、东部和南湾地区，并将包括许多预留给退伍军人、无家可归或以前无家可归的人以及发育残疾居民的单元。\n苹果还提供抵押贷款和首付援助基金以及保障房投资支持计划，这两项计划都是与加州住房金融局(CalHFA)共同创建的。苹果公司表示，到目前为止，苹果已经为数百名首次购房者提供了抵押贷款和首付援助，并为教师、退伍军人和消防员保留了额外的福利。CalHFA的援助计划通常也是多样化的，超过65%的借款人认同为西班牙裔、黑人、亚洲人、太平洋岛民或美国印第安人。\n本月，苹果将与CalHFA推出一项保障性住房投资支持计划，旨在以更低的成本为开发新的、非常低收入到中等收入的住房提供资金。该计划预计将在未来五年内在加州生产一批经济适用房。\n此外，苹果正在通过与支持硅谷地区无家可归者的Destination：Home合作，支持保障性住房的建设。这一倡议将帮助资助建造1000多套新的极度负担得起的支持性住房，其中包括圣克拉拉一个为无家可归或即将无家可归的老年人实施的项目中的80套住房。\n苹果公司表示，它的支持帮助了Destination：Home每年让1500个家庭免于失去家园，比一年前增长了67%。\n苹果负责全球房地产和设施的副总裁克里斯蒂娜·拉斯佩(Kristina Raspe)在一份声明中表示：“在我们社区如此多的成员面临前所未有的挑战之际，我们认为，确保他们对未来的希望通过切实的计划和结果得到支持，这一点至关重要，”苹果负责全球房地产和设施的副总裁克里斯蒂娜·拉斯佩(Kristina Raspe)在一份声明中表示。她补充说：“在当前的公共健康危机中，各城市和各州被迫暂停了许多长期的保障性住房投资，苹果为能继续推进我们对抗加州房地产危机的全面计划而感到自豪。”\n苹果在2019年11月首次宣布了其承诺资金解决住房和无家可归危机的计划。它并不是唯一家这样做的大型科技公司。亚马逊、Facebook和谷歌也在花钱解决这些问题。但这些举动不仅仅是慈善和善举。苹果、亚马逊、Facebook和谷歌从一开始就对房地产危机负有部分责任，因为它们在该地区的扩张导致长期居民流离失所。多年来，科技公司因其对社区的负面影响而受到越来越多的批评，因为由于房价上涨，让城市发挥功能的居民-例如消防员、护士和教师-不得不搬离。\n当然，像大多数复杂因素一样，除了科技的影响之外，还有许多其他因素也导致了房地产危机。此外，还有该地区的当地法律、分区规定、反对垂直建筑的抗议活动、邻居主义、租金管制对市场的影响、住房供应受限、可用土地稀缺等等。\n额外的资金用于保障性住房之际，正值湾区一些较富有的居民和科技员工逃离该市，原因是冠状病毒大流行及其相关影响，如裁员。根据Zumper最近在7月份发布的一份报告，旧金山的一居室租金价格同比下降了11.8%，这是美国跌幅最大的，打破了前一个月的纪录。两居室的租金同比下降了近10%。\n但即使是两位数的降幅也无助于解决房地产危机，因为租金和房价已经如此之高，以至于许多城市居民都无法企及。此外，大流行对该地区房地产市场的长期影响还有待观察。例如，如果疫苗出现，公司将在多大程度上继续接受远程工作，使返回办公室变得安全，目前还不清楚。\n尽管大流行，但苹果在25亿美元承诺中的倡议保持不变。其中包括加利福尼亚州的10亿美元保障性住房投资基金，10亿美元的首次购房者抵押贷款援助基金，3亿美元的苹果所有的土地可用于保障性住房，1.5亿美元的旧金山湾区住房基金，以及5000万美元支持Destination：Home的努力。", "note_en": "The funding is expected to support thousands of Californians with first-time homebuyer assistance or new, affordable housing units, Apple says.\n Projects launching in 2020 include 250 new units of affordable housing across the Bay Area — the first affordable housing developments funded in a private-public partnership with Housing Trust Silicon Valley. The units will span the North, East, and South Bay regions, and will include many units reserved for veterans, the homeless or formerly homeless, and residents with developmental disabilities.\n    Apple is also offering a mortgage and down payment assistance fund and an affordable housing investment support program, both created in conjunction with the California Housing Finance Agency (CalHFA). Apple has provided mortgage and down payment assistance to hundreds of first-time home buyers to date, it says, with additional benefits reserved for teachers, veterans, and firefighters. The CalHFA’s assistance program is typically diverse, as well, with over 65% of borrowers identifying as Hispanic, Black, Asian, Pacific Islander, or American Indian.\n This month, Apple will launch an affordable housing investment support program with CalHFA, aimed at funding the development of new, very low to moderate-income housing at a lower costs. The program is expected to produce a number of affordable housing units in California over the next five years.\n In addition, Apple is supporting the construction of affordable housing units through a partnership with Destination: Home, which supports the homeless in the Silicon Valley area. This initiative will help fund the construction of over 1,000 new units of deeply-affordable and supportive housing, including 80 units in a project in Santa Clara for seniors who are homeless or nearing homelessness.\n Apple says its support has helped Destination: Home keep 1,500 families annually from losing their homes, up 67% over a year ago.\n  “At a time when so many members of our community are facing unprecedented challenges, we believe it’s critical to make sure that their hopes for the future are supported through tangible programs and results,” said Kristina Raspe, Apple’s vice president for Global Real Estate and Facilities, in an announcement. “As cities and states have been forced to pause many of their long-term affordable housing investments amidst the current public health crisis, Apple is proud to continue moving forward with our comprehensive plan to combat the housing crisis in California,” she added.\n Apple in November 2019  first announced its plans to commit funds to address the housing and homelessness crisis. It’s not the only major tech firm to do so. Amazon, Facebook, and Google are also spending money to address these problems. But these moves aren’t just about charity and good works. Apple, Amazon, Facebook and Google are partially  responsible for the housing crisis to begin with, as their expansions in the region have displaced long-time residents from their homes. Over the years, tech companies have been increasingly criticized for the negative impacts they’ve had on communities, as residents that make cities function — like firefighters, nurses and teachers, for example — had to move out due to rising housing prices.\n Of course, like most  complexities, a number of other factors also contributed to the housing crisis, outside of tech’s impact. There are also the area’s local laws, zoning regulations, protests against building vertically, NIMBY-ism, rental control’s impact on the market, the restricted housing supply, scarcity of available land, and more.\n The additional funds toward affordable housing arrive at a time when some of the  Bay Area’s wealthier residents and tech employees are fleeing the city, amid the coronavirus pandemic and its related impacts, such as layoffs. According to a  recently released report from Zumper in July, one-bedroom rent prices in San Francisco fell 11.8% year-over-year — the largest drop in the U.S. and beating the prior month’s record. Two-bedroom rents fell nearly 10% year-over-year.\n But even a double-digit decline won’t help solve the housing crisis, as rents and home prices were already so high as to be unattainable for many of the city’s residents. Plus, the pandemic’s longer-term impacts on the region’s housing market are yet to be seen. For example, it’s unclear to what extent companies will continue to embrace remote work if a vaccine were to emerge, making it safe to return to offices.\n Apple’s initiatives in the $2.5 billion commitment remain unchanged, despite the pandemic. They include $1 billion affordable housing investment fund with the state of California, $1 billion first-time homebuyer mortgage assistance fund, $300 million in Apple-owned land made available for affordable housing, a $150 million Bay Area housing fund, and $50 million to support Destination: Home’s efforts.", "posttime": "2020-07-13 22:27:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,解决,address,住房", "title": "\n苹果从25亿美元承诺中拨出第一笔4亿美元用于解决加州的房地产危机", "title_en": "\n\t\t\t\tApple allocates its first $400M from $2.5B commitment to address California’s housing crisis\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/13/apple-allocates-its-first-400m-from-2-5b-commitment-to-address-californias-housing-crisis/", "via": "", "real_tags": ["apple", "苹果", "解决", "address", "住房"]}, {"category": "", "categoryclass": "", "imagename": "a13fa436b014df202eb4507faaf294da.jpg", "infoid": 1011507, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌表示，它将在未来五到七年内投资超过₹75,000克劳尔(100亿美元)。该公司首席执行官桑达尔·皮查伊(Sundar Pichai)表示，资金将分为投资、股权投资、合作伙伴关系以及运营、基础设施和生态系统投资。\n今天早些时候，印度总理纳伦德拉·莫迪(Narendra Modi)与皮查伊通了电话，讨论COVID后的投资和数字转型。\n今天上午，与@sundarpichai进行了一次非常富有成效的互动。我们就广泛的话题进行了交谈，特别是利用技术的力量改变印度农民、年轻人和企业家的生活。pic.twitter.com/IS9W24zZxs。\n在我们进行这些投资的同时，我们期待着与莫迪总理和印度政府以及各种规模的印度企业合作，实现我们对数字印度的共同愿景。\n过去，谷歌的投资部门曾投资于印度初创企业，如房地产市场CommonFloor和超本地化送货初创公司Dunzo。\n就搜索、安卓和YouTube等谷歌产品的用户数量而言，印度一直处于领先地位。\n谷歌的基金是美国公司在印度的最大投资之一。今年早些时候，亚马逊表示将在2025年之前向该国的小企业投资10亿美元。今年4月，Facebook向印度的Reliance Jio平台投资57亿美元，以换取9.9%的股份。\n该公司指出，印度目前有超过5亿互联网用户。这家搜索巨头还强调了其传播与冠状病毒相关的信息的努力。\n你想每天在你的收件箱里免费获得最时髦的每日科技时事通讯吗？你当然需要：在这里注册大号午餐肉吧。", "note_en": "Google said that it’ll invest more than ₹75,000 crores ($10 billion) over the next five to seven years. The company’s CEO, Sundar Pichai, said that money will be divided into investment  equity investments, partnerships, and operational, infrastructure, and ecosystem investments.\n        Earlier today, India’s Prime Minister, Narendra Modi, had a call with Pichai to discuss post-COVID investments and digital transformation.\n This morning, had an extremely fruitful interaction with  @sundarpichai. We spoke on a wide range of subjects, particularly leveraging the power of technology to transform the lives of India’s farmers, youngsters and entrepreneurs.  pic.twitter.com/IS9W24zZxs\n   As we make these investments, we look forward to working alongside Prime Minister Modi and the Indian government, as well as Indian businesses of all sizes to realize our shared vision for a Digital India.\n In the past, Google’s investment arm has invested in Indian startups such as real-estate marketplace  Commonfloor and  hyperlocal delivery startup Dunzo.\n India has been a leading country in terms of the number of users for Google products such as Search, Android, and YouTube.\n Google’s fund is one of the biggest investment by a US-based company in India. Earlier this year, Amazon said it’ll invest  $1 billion in small business in the country by 2025. In April, Facebook invested  $5.7 billion in India’s Reliance Jio Platforms in exchange for a 9.9% stake.\n The company noted that India has now more than 500 million internet users. The search giant also highlighted its efforts to spread information related to the coronavirus.\n    Do you want to get the sassiest daily tech newsletter every day, in your inbox, for FREE? Of course you do: sign up for Big Spam  here.", "posttime": "2020-07-13 22:27:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,印度", "title": "谷歌将在印度投资100亿美元", "title_en": "Google To Invest $10B in India", "transed": 1, "url": "https://thenextweb.com/in/2020/07/13/google-promises-to-invest-10b-in-india-over-the-next-5-to-7-years/", "via": "", "real_tags": ["google", "谷歌", "印度"]}, {"category": "", "categoryclass": "", "imagename": "eeff386b6bf63f552aaa971bb10fec8b.jpg", "infoid": 1011505, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年应该是大型火箭的一年。有一段时间，多达四个大型、强大的助推器计划在今年升空。唉，我们现在可以肯定地知道，他们中没有一个人会成功。\n两年前，Ars发表了一篇文章，概述了预计将首次亮相的四枚大型强大火箭：阿丽亚娜太空公司的阿丽亚娜6号、美国国家航空航天局的太空发射系统、蓝色起源公司的新格伦火箭和联合发射联盟的火神-半人马座火箭。我们对2020年发射的这些助推器中的每一个都有信心，阿丽亚娜6的信心从中到高(哎呀！)。新格伦和火神-半人马座的航程调低。\n考虑到这些火箭实际上都不会在今年首次亮相，我们决定重新审视重型运载火箭的领域。我们还将为2021年的发射再增加三个竞争者：日本的H3火箭，诺斯罗普·格鲁曼公司的欧米茄助推器，以及SpaceX的超重型第一级。在这里，我们试着将这七款车排在最快推出的位置。请注意，这些估计是基于极不完整的信息，几乎可以肯定是错误的。\n三菱重工(Mitsubishi Heavy Industries)将其H3火箭的发射日期定在2020年已经有一段时间了，但这个日期带有一个星号，因为这意味着2020财年将持续到2021年3月。该公司一度希望在2020年东京夏季奥运会期间发射火箭，奥运会定于本月晚些时候在全球大流行之前开始。现在，我们了解到他们将在本财年年底发射升空。\n今年春天早些时候，该公司表示，新冠肺炎疫情并没有减缓其在2020年财年将火箭送上发射台的努力，目前该公司正在继续努力实现这一目标。\nH3火箭应该出现在重型火箭名单上吗？单杆版本的H3火箭不是重型升降器，但有了四个固体火箭助推器，火箭可以将8吨的重量健康地送到地球静止转移轨道。此外，日本正在计划升级后的第二阶段，可以向月球门户运送超过4吨的货物，可能还会有三个核心的重型版本，可以向月球轨道运送12吨货物。\nGTO产能：5至10吨当前发射日期：2021年春季信心：中等我们预计发射日期：2021年第3季度至第4季度。\n诺斯罗普·格鲁曼公司(Northrop Grumman)的固体燃料火箭欧米茄(Omega)继续取得进展，该公司希望美国空军选择这种火箭用于2022年至2026年的国家安全发射。预计空军将在今年夏天晚些时候决定两家供应商。\n如果诺斯罗普得不到其中一项奖励，诺斯罗普是否会继续推进还存在一些疑问--如果美国政府不支持欧米茄，欧米茄的商业理由似乎有限--但就目前而言，无论空军的决定如何，我们都会假设欧米茄至少发射一次。\n第一次欧米茄发射还没有确定的日期，但该公司希望在2021年第一季度或第二季度从发射综合体39B首次亮相火箭。这是又一枚最初不符合重型升力标准的火箭。然而，该公司计划推出一个更大的版本，将欧米茄提升到地球静止转移轨道的能力提高一倍。因此，我们暂时将其包括在内。\nGTO产能：11.5吨当前发射日期：2021年第3季度-第4季度信心：中高我们预计发射日期：2021年第4季度。\n上周，欧洲航天局证实，阿丽亚娜6号火箭的发射将从今年年底推迟到2021年。阿丽亚娜6号的处女航被确认将于2021年下半年进行，航天运输部主任丹尼尔·诺伊恩斯施万德告诉ARS。\n官员们列举了推迟的几个原因，但主要归咎于新冠肺炎的大流行。这种疾病既影响了欧洲几个地点的制造工作，也影响了法属圭亚那的发射场，法属圭亚那与受灾严重的巴西接壤。如果在2021年初对阿丽亚娜6的第一级和第二级进行综合测试，我们将对明年发射这枚大型火箭更有信心。\nGTO产能：14.4吨当前发射日期：2021年夏季信心：中低我们预计发射日期：2021年第四季度。\n7月1日，联合发射联盟(United Launch Alliance)宣布，他们已经收到了首个探路者版本的BE-4发动机，该发动机将为其火神-半人马座火箭提供动力。这将有助于进行各种测试，因为该公司正在加紧准备其新的重型火箭的首次发射。然而，寻路发动机不同于那些将在飞行中为火箭提供动力的发动机(火神第一级有两个主发动机)。\n目前，RD-180发动机(阿特拉斯V)和RS-68(德尔塔IV重型)动力联合发射联盟的两枚火箭。为了从历史的角度来看，我们考察了这些发动机的飞行版本第一次到达火箭工厂到助推器第一次飞行之间的时间。平均为19.5个月。这表明，对联合发射联盟来说，在2021年进行发射将是一个挑战，但这也不是不可能的。鉴于我们听说该公司正在为火神的首次发布而努力工作，我们目前将坚持2021年。\nGTO产能：21吨当前发射日期：ツ_/信心：中低我们预计发射日期：2021年第四季度。\nSpaceX可能很快就会开始其星际飞船运载火箭的短期试飞。虽然它很庞大，但“星际飞船”只是其下一代发射系统的上一级。第一级，被称为“超级重型”，可能由31个猛禽发动机提供动力，将用于推动“星际飞船”进入近地轨道。\n尽管SpaceX到目前为止一直专注于星际飞船的开发，但这两个阶段之间有很多共同之处-都使用相同的发动机，相似的坦克，以及相同的直径。这意味着，一旦SpaceX工程师测试了星际飞船发射所需的大量技术，他们应该有一个相当好的开发超重型的模板。\n最近，我们看到有证据表明，SpaceX公司已经开始在其南得克萨斯州发射场建造一个高湾设施。这是该公司将堆叠不锈钢环的地方，这些环将构成这枚火箭的结构。那么它什么时候可能尝试轨道飞行呢？SpaceX公司在星际飞船项目上进展很快，所以我们不排除明年飞行的可能性。请记住，这是一项具有许多不确定性的庞大工程。\nGTO产能：约20吨当前发射日期：2021年底信心：低我们估计发射日期：2022年1季度至2季度。\n美国国家航空航天局(NASA)的大型一次性SLS火箭原定于2016年底发射，因此已经晚了五年。由于每年的开发成本超过20亿美元，这是一个代价非常高昂的延误。但我们终于看到了进展，火箭的第一个核心级今年早些时候从路易斯安那州的工厂出来，并转移到密西西比州的一个试验场。\n美国国家航空航天局(NASA)和核心阶段承包商波音公司(Boeing)正在为今年秋天晚些时候火箭及其四个主要发动机的关键试射而努力。一旦这个绿色运行测试完成，我们将开始对火箭的发射日期更有信心。这将取决于测试是否显示没有问题，几个小问题，或者一些需要长时间修复的大问题。\nGTO产能：13吨当前发射日期：2021年底信心：低我们预计发射日期：2022年第3季度至第4季度\nBlue Origin在设施上花费了大量的时间和金钱-在佛罗里达州建造了一个大型组装大楼和发射场，在阿拉巴马州建造了一个火箭发动机工厂，并在华盛顿州建造了新的总部。\n我们还没有看到多少新格伦火箭的实物硬件。该公司在开发强大的BE-4发动机方面取得了重要进展，但在为New Glenn这样的大型火箭建造坦克和管道以及编写控制其飞行的软件方面存在巨大挑战。\n蓝色起源面临的另一个挑战是从一开始就重复使用助推器。当SpaceX开始捕捉猎鹰9号火箭时，它有几十次飞行的数据和实验价值。有了New Glenn，Blue Origin将寻求从一开始就赶上有价值的第一阶段，这可能需要在第一次发射之前进行额外的测试。因此，我们认为在新格伦起飞之前还需要一段时间。", "note_en": "This was  supposed to be the year of the big rocket. At one point, as many as four large, powerful boosters were slated to take flight this year. Alas, we now know for sure that none of them are going to make it.\n Two years ago,  Ars published an article outlining the four large and powerful rockets expected to make their debuts: Arianespace&#39;s Ariane 6, NASA&#39;s Space Launch System, Blue Origin&#39;s New Glenn, and United Launch Alliance&#39;s Vulcan-Centaur. Our confidence in each of these boosters launching in 2020 ranged from medium-high for the Ariane 6 (oops!) to low for New Glenn and Vulcan-Centaur.\n  Given that none of these rockets will, in fact, debut this year, we decided to revisit the realm of heavy lift. We will also add three more contenders for a 2021 launch: Japan&#39;s H3 rocket, Northrup Grumman&#39;s Omega booster, and SpaceX&#39;s Super Heavy first stage. Here, we try to rank these seven vehicles by which will launch soonest. Please note these are estimates based upon vastly incomplete information and are almost certainly wrong.\n    Mitsubishi Heavy Industries has stuck to a 2020 launch date for its H3 rocket for a while, but that comes with an asterisk because it means &#34;fiscal year 2020,&#34; which runs through March, 2021. At one point, the company had hoped to launch the rocket during the 2020 Summer Olympics in Tokyo, which were due to begin later this month before the global pandemic. Now, we understand they&#39;re running up against the end of the fiscal year for liftoff.\n  Earlier this spring,  the company said the COVID-19 pandemic had not slowed its efforts to bring the rocket to the launch pad during fiscal year 2020, and at present the company is continuing to push hard toward that goal.\n Should the H3 rocket be on a list of heavy lift rockets? The single-stick version of the H3 rocket is not a &#34;heavy lifter,&#34; but with four solid rocket boosters the rocket can deliver a healthy 8 tons to geostationary transfer orbit. Moreover, Japan is planning for an upgraded second stage that could deliver more than 4 tons to the Lunar Gateway, and possibly a &#34;heavy&#34; version with three cores that could deliver 12 tons to lunar orbit.\n  Capacity to GTO: 5 to 10 tons Current launch date: Spring 2021 Confidence: Medium Our estimated launch date: 3Q-4Q 2021\n Northrop Grumman continues to make progress on its solid-fueled rocket, Omega, which it hopes the US Air Force selects for national security launches from 2022 to 2026. The Air Force is expected to decide on two providers later this summer.\n There is some question as to whether Northrop will press ahead if it does not receive one of these awards—there seems to be a limited business case for Omega if the US government does not support it—but for now, we&#39;ll assume it launches at least once regardless of the Air Force&#39;s decision.\n The first Omega launch does not yet have a firm date, but the company is hoping to debut the rocket from Launch Complex-39B during the first or second quarter of 2021. This is another rocket that initially does not qualify as &#34;heavy lift.&#34; However, the company has plans for a larger version that would double Omega&#39;s lift capacity to geostationary transfer orbit. So we&#39;re including it for now.\n  Capacity to GTO: 11.5 tons Current launch date: 3Q-4Q 2021 Confidence: Medium-high Our estimated launch date: 4Q 2021\n This past week, the European Space Agency confirmed that the launch of the Ariane 6 rocket would slip from the end of this year into 2021. &#34;The Ariane 6 maiden flight is confirmed to take place in the 2nd half of 2021,&#34; Daniel Neuenschwander, the director of Space Transportation, told Ars.\n Officials cited several reasons for the delay but principally blamed the COVID-19 pandemic. The disease has affected both manufacturing work at several locations in Europe as well as at the launch site in French Guiana, which shares a border with hard-hit Brazil. If tests of the integrated first and second stages of the Ariane 6 are conducted by early 2021, we&#39;ll have more confidence in a launch of this large rocket next year.\n  Capacity to GTO: 14.4 tons Current launch date: Summer 2021 Confidence: Medium-low Our estimated launch date: 4Q 2021\n On July 1, United Launch Alliance announced that it had taken delivery of the first &#34;pathfinder&#34; version of the BE-4 engine that will power its Vulcan-Centaur rocket. This will help with all manner of tests as the company presses toward the first launch of its new heavy lift rocket. However, a pathfinding engine is different from the ones (Vulcan&#39;s first stage has two main engines) that will power the rocket in flight.\n Currently, the RD-180 engine (Atlas V) and RS-68 (Delta IV Heavy) power United Launch Alliance&#39;s two rockets. For some historical perspective, we looked at the time between when flight versions of those engines first arrived at the rocket factory and when the boosters first flew. It  averaged out at 19.5 months. This suggests that making a launch in 2021 will be a challenge for United Launch Alliance, but it&#39;s not impossible. Given that we&#39;ve heard the company is working hard toward Vulcan&#39;s first launch, we&#39;ll stick with 2021 for now.\n  Capacity to GTO: 21 tons Current launch date: ¯\\_(ツ)_/¯ Confidence: Medium-low Our estimated launch date: 4Q 2021\n SpaceX may soon begin short test flights of its Starship vehicle. Although it is massive, Starship is merely the upper stage of its next-generation launch system. The first stage, dubbed &#34;Super Heavy&#34; is likely to be powered by 31 Raptor engines and will be used to boost Starship into low-Earth orbit.\n Although SpaceX has focused on Starship development so far, there is a lot of commonality between the two stages—both use the same engines, similar tanks, and share the same diameter. This means that once SpaceX engineers test out a lot of the technology needed for a Starship launch, they should have a pretty good template for developing Super Heavy.\n  Recently, we have seen evidence that SpaceX has begun to build a &#34;high bay&#34; facility at its South Texas Launch Site. This is where the company will stack the rings of stainless steel that will form the structure of this rocket. So when might it attempt an orbital flight?  SpaceX has been moving quite fast on the Starship project, so we&#39;re not going to rule out a flight next year. Just bear in mind that this is huge project with many uncertainties.\n  Capacity to GTO: Approximately 20 tons Current launch date: End of 2021 Confidence: Low Our estimated launch date: 1Q-2Q 2022\n NASA&#39;s large, expendable SLS rocket was originally supposed to launch at the end of 2016, so it is already going to be five years late. With a development cost of more than $2 billion a year, that&#39;s a very costly delay. But we have finally seen progress, with the rocket&#39;s first core stage rolling out of the factory in Louisiana early this year and moving to a test site in Mississippi.\n NASA and the core stage contractor Boeing are working toward a critical test firing of the rocket and its four main engines late this fall. Once this &#34;green run&#34; test is complete, we&#39;ll begin to have more confidence in a launch date for the rocket. It will depend upon whether the test reveals no problems, a few small ones, or some major problems that necessitate a lengthy fix.\n  Capacity to GTO: 13 tons Current launch date: End of 2021 Confidence: Low Our estimated launch date: 3Q-4Q 2022\n Blue Origin has spent a lot of time and money on facilities—building a large assembly building and launch site in Florida, a rocket engine factory in Alabama, and new headquarters in Washington state.\n What we have not seen much of yet is physical hardware for the New Glenn rocket. The company has made important strides on developing the powerful BE-4 engine, but there are massive challenges in building tanks and plumbing for a large rocket like New Glenn and writing the software to control its flight.\n Another challenge Blue Origin faces is reusing the booster right from the start. When SpaceX began catching Falcon 9 rockets, it had dozens of flights worth of data and experimentation. With New Glenn, Blue Origin will seek to catch the valuable first stage from the very beginning, which will likely necessitate additional testing before the first launch. Therefore, we think it&#39;s going to be awhile before New Glenn takes flight.", "posttime": "2020-07-13 22:03:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "火箭,2020,不会,big", "title": "可悲的是，我们希望在2020年看到的大型火箭实际上都不会升空", "title_en": "Sadly, none of the big rockets we hoped to see fly in 2020 actually will", "transed": 1, "url": "https://arstechnica.com/science/2020/07/sadly-none-of-the-big-rockets-we-hoped-to-see-fly-in-2020-actually-will/", "via": "", "real_tags": ["火箭", "2020", "不会", "big"]}, {"category": "", "categoryclass": "", "imagename": "378762c8d41f667305e8b7347339e74c.jpg", "infoid": 1011504, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大家好，欢迎回到TechCrunch专注于风险投资的播客The Equity，在这里我们解开标题背后的数字。\n这是“股票星期一”，这是我们一周开始的入门读物，我们在这里回顾最新消息，挖掘未来一周的内容，谈论一些巧妙的融资轮，并深入了解创业界的最新重大新闻。(如果你愿意的话，可以在推特上关注这部剧，我也可以在这里关注！别忘了也去看看上周五的那一集。所有酷孩子都在这么做。)。\n有些周末很清闲。这个周末不是。以下是我们不得不谈到的新闻综述：\n高通向印度Reliance Jio注资，Reliance Jio过去三个月现已融资157亿美元。\n谷歌打算在未来五到七年内向印度投资100亿美元，希望通过一个新的“谷歌印度数字化基金”，通过“股权投资、合作伙伴关系以及运营、基础设施和生态系统投资的组合”来投入资金。\nWeWork可能会在2021年实现现金流为正。这距离现在还有很长一段路要走，但它确实表明，无论WeWork在2019年IPO过程中声称是什么人，在它的骨子里都有一家真正的公司。目前还不清楚一家公司有多大。\nUIPath在E系列募集了2.25亿美元，估值超过100亿美元。在过去的几年里，该公司的ARR增长了四倍，达到4亿美元。\n在未来，我们将迎来一个令人着迷的财报季，媒体预计这一季不会很顺利。在我们撰写这部剧的时候，股市正在上涨，所以看起来华尔街更多的是看涨，而不是担忧。等着瞧吧。Netflix将于本周晚些时候报道。然后，下周，我们将真正开始与Snap、IBM、Microsoft和其他公司合作。\n我们还谈到了三轮融资：向专注于癌症的人工智能初创公司Paige提供更多资金，为FitXR继续开展健身VR工作提供630万美元，以及来自俄罗斯的这一小轮融资，这轮融资提醒我们，即使在一个失败的民主国家，你也可以建立一家初创公司。\n总而言之，这个财报季是一件大事。许多科技投资者押注，加速的数字转型将把大多数科技商店推入一条增长曲线，使它们的股本具有吸引力，即使价格高企也是如此。这个想法投入了相当多的资金。我们看看数字出来后会发生什么。\n股市每周一上午7点下跌。PT和周五上午6点。PT，所以订阅我们的苹果播客，阴天，Spotify和所有的演员。", "note_en": "Hello and welcome back to  Equity, TechCrunch’s venture capital-focused podcast where we unpack the numbers behind the headlines.\n This is Equity Monday, our week-starting primer in which we go over the latest news, dig into the week ahead, talk about some neat funding rounds and dive into the latest big news from the startup world. (You can follow the show on Twitter  here, and myself  here, if you are so inclined! Don’t forget to check out  last Friday’s episode as well. All the cool kids are doing it.)\n Some weekends are slow. This weekend was not. Here’s the round-up of news that we had to talk about:\n Qualcomm  pours capital into India’s Reliance Jio, which has now raised $15.7 billion in the past three months.\n Google  intends to invest $10 billion into India over the next five to seven years, looking to put capital to work in through a mix of “a mix of equity investments, partnerships, and operational, infrastructure and ecosystem investments” via a new “Google for India Digitization Fund.”\n  WeWork might turn cash flow positive in 2021. That’s still a ways from now, but it does go to show that deep under the flesh of whatever WeWork claimed to be during its 2019 IPO process, there was a real company somewhere in its bones. How  large a company is not clear.\n UIPath raised $225 million in a Series E that values it at over $10 billion. The company’s ARR has quadrupled to $400 million in the past few years.\n Up ahead we have a fascinating earnings season, one that  the media  doesn’t expect to go very well. Stocks  were up as we wrote the show, so it appears that Wall Street is more bullish than worried. We’ll see. Netflix reports later this week. Then, next week, we really get underway with Snap, IBM, Microsoft, and others.\n We also touched on three funding rounds:  More money for cancer-focusedAI startup Paige,  $6.3 million for FitXR to keep working on its fitness VR work,  and this small round from Russia, which reminded us that you can build a startup even in a failing democracy.\n  Wrapping, this earnings season is a big deal. Lots of tech investors are betting that  an accelerated digital transformation is going to push most tech shops into a growth curve that makes their equity attractive, even at elevated prices. Quite a lot of capital has been sunk in this idea. We’ll see what happens when the numbers come in.\n Equity drops every Monday at 7:00 a.m. PT and Friday at 6:00 a.m. PT, so subscribe to us on   Apple Podcasts ,   Overcast ,   Spotify  and all the casts.", "posttime": "2020-07-13 22:02:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "股票,财报,monday,印度", "title": "\n股票周一：印度的数字经济吸引了足够的关注，三轮融资，以及财报季", "title_en": "\n\t\t\t\tEquity Monday: India’s digital economy attracts ample attention, three funding rounds, and earnings season\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/13/equity-monday-indias-digital-economy-attracts-ample-attention-three-funding-rounds-and-earnings-season/", "via": "", "real_tags": ["股票", "财报", "monday", "印度"]}, {"category": "", "categoryclass": "", "imagename": "26858de9303d971d1290d056c34089b9.png", "infoid": 1011503, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载TDF-2020Marketingplan.pdf(223KB)", "note_en": "Download tdf-2020marketingplan.pdf (223 KB)", "posttime": "2020-07-13 22:00:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,计划,plan,下载", "title": "LibreOffice 2020/2025年营销计划[pdf]", "title_en": "LibreOffice 2020/2025 Marketing Plan [pdf]", "transed": 1, "url": "https://nextcloud.documentfoundation.org/s/jzryGw7XDkJadmo#pdfviewer", "via": "", "real_tags": ["2020", "计划", "plan", "下载"]}, {"category": "", "categoryclass": "", "imagename": "802c3cba4ce78ba8a0e9364312e7f86a.png", "infoid": 1011502, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "十二要素应用程序宣言建议您将应用程序配置作为ENV变量传递。但是，如果您的应用程序需要密码、SSH私钥、TLS证书或任何其他类型的敏感数据，则不应将其与配置一起传递。\n当您将密钥存储在环境变量中时，很容易意外地暴露它们-这正是我们想要避免的。以下是ENV变量不利于保密的几个原因：\n由于环境对进程是隐式可用的，因此很难(如果不是不可能)跟踪访问以及内容是如何公开的(PS-EWW&lt；PID&&gt;T；)。\n让应用程序抓取整个环境并将其打印出来以进行调试或报告错误是很常见的。如此多的秘密被泄露给PagerDuty，以至于他们有一个很好的内部流程来将它们从基础设施中清除出去。\n环境变量向下传递给子进程，从而允许意外访问。这违反了最低特权的原则。想象一下，作为应用程序的一部分，您调用第三方工具来执行某些操作-突然之间，该第三方工具可以访问您的环境，天知道它将如何处理它。\n当应用程序崩溃时，它们通常将环境变量存储在日志文件中以供以后调试。这意味着磁盘上的纯文本机密。\n将秘密放入ENV变量很快就会变成部落知识。没有意识到特定环境变量的敏感性质的新工程师将不会适当/谨慎地处理它们(将它们过滤到子流程等)。\n总体而言，ENV变量中的机密违反了最小意外原则，是一种糟糕的做法，最终会导致机密泄露。\n在以前的工作中，我用一个非常优雅的解决方案帮助解决了这个问题：Keywhiz。在Docker，我们更进一步，直接在Docker中构建了类似的解决方案。如果您正在使用Sroom，那么现在您就有了一种简单的方式来安全地管理您的秘密：\n并让您的应用程序从/run/secrets/secure-ret下创建的内存中的TMP中读取机密内容：\n通过将秘密集成到Docker中，我们能够提供遵循以下原则的秘密管理解决方案：\n拥有一种易于使用、默认安全的秘密分发机制正是开发人员和运营者一劳永逸地解决秘密管理问题所需要的。", "note_en": "The  twelve-factor app manifesto recommends that you pass application configs as ENV variables. However, if your application requires a password, SSH private key, TLS Certificate, or any other kind of sensitive data, you shouldn&#39;t pass it alongside your configs.\n  When you store your secret keys in an environment variable, you are prone to accidentally exposing them—exactly what we want to avoid. Here are a few reasons why ENV variables are bad for secrets:\n Given that the environment is implicitly available to the process, it&#39;s hard, if not impossible, to track access and how the contents get exposed ( ps -eww &lt;PID&gt;).\n It&#39;s common to have applications grab the whole environment and print it out for debugging or error reporting. So many secrets get leaked to PagerDuty that they have a well-greased internal process to scrub them from their infrastructure.\n Environment variables are passed down to child processes, which allows for unintended access. This breaks the principle of least privilege. Imagine that as part of your application, you call to a third-party tool to perform some action—all of a sudden that third-party tool has access to your environment, and god knows what it will do with it.\n When applications crash, it&#39;s common for them to store the environment variables in log-files for later debugging. This means plain-text secrets on disk.\n Putting secrets in ENV variables quickly turns into tribal knowledge. New engineers who are not aware of the sensitive nature of specific environment variables will not handle them appropriately/with care (filtering them to sub-processes, etc).\n Overall, secrets in ENV variables break the principle of least surprise, are a bad practice, and will lead to the eventual leak of secrets.\n  At a previous job I helped solve this problem with a really elegant solution:  Keywhiz. At Docker we went a step further and built a similar solution directly into Docker itself. If you&#39;re using  swarm, you now have a trivial way to manage your secrets securely:\n    And make your application read the secret contents from the in-memory tmps that gets created under  /run/secrets/secure-secret:\n  By integrating secrets into Docker, we were able to deliver a solution for the secrets management that follows these principles:\n  Having an easy-to-use, secure-by-default secret distribution mechanism is exactly what developers and ops need to solve the secrets management problem once and for all.", "posttime": "2020-07-13 21:59:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "env,应用程序", "title": "不应将ENV变量用于机密数据(2017)", "title_en": "You shouldn't use ENV variables for secret data (2017)", "transed": 1, "url": "https://diogomonica.com/2017/03/27/why-you-shouldnt-use-env-variables-for-secret-data/", "via": "", "real_tags": ["env", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "494d99610fed7406d4b6e3852f2faf1a.jpg", "infoid": 1011501, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Mitre公司经营着一些美国政府最保密的科学和技术实验室。斗篷和匕首研发店可能是你从未听说过的最重要的机构。\n无论是隐形阿斯顿马丁还是爆炸笔，每当詹姆斯·邦德需要高科技优势时，他都会去Q和他神秘的军情六处实验室。在现实世界中，美国特工通常依赖于一个不那么秘密、但资金更充裕的组织。拥有8000名员工和10至20亿美元纳税人资金的年度预算，与政府有关联的臭鼬工厂Mitre Corp，60多年来一直在为美国机构取得尖端突破。Mitre的研究中心总部设在弗吉尼亚州麦克莱恩山顶的四座塔楼里，它雇佣了一些全国领先的计算机科学家和工程师，为美国顶尖的军事、安全和情报机构制造数字工具。\n政府更疯狂的命令包括：一款原型工具，可以侵入智能手表、健身跟踪器和家庭温度计，用于国土安全；软件，为FBI从Facebook、Instagram和Twitter等社交媒体网站收集人类指纹；支持建立FBI所称的世界上最大的人体解剖学和犯罪史数据库；以及一项研究，以确定某人的体味是否能表明他们在撒谎。\n这些价值数百万美元的各式各样的项目，通过“信息自由法”的要求以及对前Mitre高管和政府官员的采访，披露了长达数百页的合同细节，让人们得以一瞥这家庞大的承包商的秘密世界。Mitre的影响力远远超过其庞大的技术开发；它也是无数政府机构如何最好地部署技术和政策战略的主要顾问。它的最新工作是：帮助疾病控制和预防中心和国土安全部打击大规模杀伤性武器办公室制定全面计划，以遏制新冠肺炎的大流行。\n前Mitre网络安全工程师马特·埃德曼(Matt Edman)表示：“如果存在国家安全或公共利益(问题)，Mitre很可能参与其中。”秃顶、胡子和男中音的埃德曼本可以在他挑选的硅谷热门科技公司工作，但相反，他把自己的才华集中在挑战国家安全问题上。在Mitre工作期间，埃德曼与FBI合作，利用他的黑客技能帮助摧毁了臭名昭著的丝绸之路黑暗网络毒品集市。在他离开Mitre后不久，他于2013年10月获准完成这项工作，并在冰岛雷克雅未克与FBI特工Ilhwan Yum一起关闭了恐怖海盗罗伯茨(Dread Pirate Roberts)运营的网站，他的真名罗斯·乌布利赫特(Ross Ulbricht)目前正在服刑。作为鱼雷行动的一部分，埃德曼也在Mitre帮助FBI黑客攻击和监控多个儿童剥削网站的用户，当时的司法部长洛蕾塔·林奇(Loretta Lynch)称赞这是一次里程碑式的黑暗网络调查。\n“执法机构能够廉价、轻松、快速地从社交媒体上获取人们的指纹，这一前景令人不寒而栗。”\n米特里的历史上充满了这种不受称赞的公共服务。正如它的宣传材料所说：“你可能不知道，但是Mitre每天都会触动你的生活。”为了了解米特雷的影响力，“福布斯”发起了一项调查，将米特雷惊人的工作范围从阴影中拉了出来。我们发现的是一个精英机构，事实证明这是对美国政府的一大恩惠，为监视试图非法进入美国的罪犯、疾病和移民提供了工具。但其中一些相同的项目在人权组织和像美国公民自由联盟(ACLU)这样的隐私倡导者中敲响了警钟，他们担心Mitre的尖端技术的监控范围过大。尽管多次要求亲自与Mitre高管会面并参观其总部，Mitre拒绝对本文发表评论。FBI和国土安全部承认了置评请求，但没有提供任何请求。\n很少有人听说过Mitre或知道它的使命，尽管它对国家安全至关重要。即使是住在其大型办公大楼附近的当地人也往往不知道，在过去的60年里，它一直是美国国家安全和国防的坚定支持者。“它离我住的地方只有几英里远，从50年代中期开始就一直在那里，”肖恩·瓦莱(Shawn Valle)说，他在2008年第一次去校园参加工作面试。“我从来没有听说过这件事。”瓦莱在那里的五年时间里，最终为空军从事网络安全工作，并寻找谷歌Android操作系统的安全问题。\n虽然米特里走出了公众的视线，但他的历史是不同凡响的。这家非营利性公司诞生于冷战时期，从可能是世界上最著名的科技园区麻省理工学院剥离出来。(麻省理工学院的首字母缩写为Mitre提供了其名称的前半部分)。20世纪50年代末，面对苏联核打击的威胁，美国空军呼吁麻省理工学院帮助其创建防空系统，以帮助其探测来袭的轰炸机。该研究所提出了半自动地面环境(SAGE)。该系统结合了雷达、无线电和网络通信，以探测来袭的敌机，警告并不断更新附近的空军基地，这些基地将紧急出动喷气式飞机拦截。这是美国第一个此类防空系统，MITRE由麻省理工学院管理人员于1958年创建，目的是管理SAGE及其未来的发展。\n“国土安全部已要求米特雷帮助建立持久的国家能力，以遏制新冠肺炎。”\n在接下来的40年里，Mitre是现在著名的空中监视技术的幕后黑手，例如机载警告和通信系统(AWACS)和监视目标攻击雷达系统(STARS)。它还在GPS和商业航空交通防撞系统等常用技术的发展中发挥了重要作用。今天，它的职权范围更广，领导各种网络安全倡议和医疗项目，同时坚持其保护国家安全的核心作用。\n2000年至2006年担任Mitre首席执行官的马丁·费加(Martin Faga)在接受“福布斯”采访时表示：“我一直向人们解释的Mitre的特点是，当我们说我们从事信息科学时，我们远远超出了人们通常所说的IT领域。”例如，它将设计一种专门的天线，安装在军用飞机上，从通信卫星发送和接收数据，美国情报机构和承包商的白发苍苍、不起眼的长期雇员法加(Faga)说。然后，Mitre也会设计卫星通信系统，以及雷达，“所有类型的信息系统，”他补充说。\n其广泛的专业知识现在正被用来帮助美国走出新冠肺炎危机。在6月下旬与疾控中心签署的价值1,630万美元的合同中，米特雷被要求帮助建立“遏制新冠肺炎的持久国家能力”。疾控中心在2019年与Mitre在疾病监测技术和服务上花费了2000万美元，但没有回应福布斯关于这些大流行计划的更多细节的要求。与此同时，3月17日，也就是新冠肺炎引发的全国紧急状态四天后，国土安全部打击大规模杀伤性武器办公室呼吁米特里有效地充当流行病应对计划的支点，“参与、通知和指导”市长、州长和应对流行病的应急领导人。Mitre还将创建疾病模型来跟踪流行病，并确定哪些“非药物干预”(NPIs--认为关闭学校、商店和实施社会距离)可以帮助立法者“弯曲曲线”。\n政府数据显示，近年来流向Mitre的纳税人资金一直在增加，接近20亿美元。Mitre表示，其2019年的总收入为180万美元。\n这份价值20万美元的合同(以Covid支出标准衡量是微不足道的)规定：“随着疫情的进展，承包商将识别、收集和分析数据，以便州和地方领导人能够近乎实时地了解国家和地方领导人最终适当地倒退NPI实施工作。”换句话说，Mitre正在帮助美国领导人决定何时以及如何再次开放。(Mitre和国土安全部都没有解释为什么CWMD部门要管理这样的合同。)。米特雷无偿创建了一个名为Sara Alert的接触者追踪系统，该系统一直在帮助阿肯色州、宾夕法尼亚州和佛蒙特州等多个州监测疫情。该系统允许已知有新冠肺炎感染风险的人将他们的症状和体温上传到他们所在州和当地卫生机构的数据库。在阿肯色州，自4月初以来，已有12861人登记，通过短信、电话、电子邮件或网站向卫生部通报他们的情况。阿肯色州卫生部首席流行病学家Mike Cima博士说：“这个系统使我们能够更容易地识别继发性病例，真正建立起对社会聚集性的更好的处理，这一直是一个挑战，”阿肯色州卫生部首席流行病学家迈克·西马(Mike Cima)博士说。它非常成功，CIMA计划在新冠肺炎去世后继续使用SARA警报治疗其他传染病。\nMitre与其他军事和情报承包商的不同之处在于，它没有赚钱的授权。与诺斯罗普·格鲁曼(Norhorup Grumman)、雷神(Raytheon)和通用动力(General Dynamics)等商业承包商不同，它运营着其中七家臭鼬工厂，在业内被称为联邦资助的研究和开发中心(Research And Development Center)，这个平凡的名字掩盖了他们有影响力的工作。Mitre只对员工的工作时间收费，并收取少量费用，通常是总费用的3%左右。\n这让这位前首席执行官在环城公路上的竞争对手中处于不同寻常的地位。“我会去参加董事会的年度会议。我看着我的报告说，‘我们今年工作很努力。我们做到了收支平衡。他们都会欢呼。任何其他CEO都会听到，‘你被解雇了。’“。\nMitre不会将其创造的技术商业化。一旦原型建成，它就会被授权给政府、私营企业或学术机构。自2014年以来，它已经向行业和大学合作伙伴转让了670多个许可证。\n从商业压力中解脱出来，米特雷给了他自由发展一些更激进的答案来解决政府最紧迫的问题。以一个项目为例，从人们的Facebook、Twitter和其他社交媒体帖子中收集指纹。福布斯获得的一份Mitre合同的电子邮件和细节概述了一个价值50万美元的FBI“社交媒体图像指纹识别项目”，该项目始于2015年。它是由美国联邦调查局(FBI)在匡提科的黑客小组运营的，运营技术部，并由一个以前没有报道的研究资助机构TRIAD提供资金。最近退休的联邦调查局科技项目运营主管克里斯·皮埃霍塔告诉“福布斯”杂志，三合会的设计目的是资助客观外部机构的创新研究，“图像指纹”就像它听起来那样简单：试图从社交媒体图像中捕捉生物特征信息。Piehota解释说，想想那些把自己的照片放在网上，用手展示帮派标志的帮派成员。他补充说：“他们还让我们了解他们的指纹模式。”“(联邦调查局)可以从这些图像中提取你的指纹特征，他们可以为(那些)我们没有传记信息的个人建立指纹文件或指纹特征。”Piehota补充说，这对违反移民法的个人可能很有用，因为美国在另一个数据库中没有他们指纹的记录。它还可以用来识别儿童剥削视频中的某人，或者就像威尔士斯旺西的一项调查一样，用WhatsApp等工具抓获毒贩。\n“想想那些穿越美墨边境的人，以及一种可以检测智能手表并入侵它们的监控工具。”\n这项技术，如果它按照描述的那样工作，对与Mitre合作的执法和情报机构来说是潜在的有用的，并且对个人隐私有潜在的危险。美国公民自由联盟演讲、隐私和技术项目的专职律师内特·韦斯勒表示，该监控项目引发了“严重的隐私问题”，特别是在因新冠肺炎疫情和种族不平等而引发泛美内乱的时期。他说：“没有人预料到，通过在网上发布数码照片，他们会将自己独特的生物识别信息(包括指纹)暴露在执法数据库中进行收集。”“我们不仅看到了反对反黑人种族主义和警察暴行的历史性抗议活动，我们还看到媒体和执法部门…对这些抗议者的照片进行了历史性的数字记录。执法机构能够廉价、轻松、快速地从这些照片上获取人们的指纹，这一前景令人不寒而栗。“。皮埃霍塔指出，作为隐私预防措施，联邦调查局只会从目标是有效嫌疑人的社交媒体图像中提取指纹，而不会简单地在Facebook之类的网站上搜索所有可用的指纹。\nMitre有协助美国政府扩大生物特征监控的历史。另一份2014年的合同详细说明了Mitre在面部识别工具方面协助FBI的工作，甚至“通过标记感兴趣的对象来创建本地观察名单”。它还帮助联邦调查局建立下一代身份识别(NGI)系统，这是地球上最大的犯罪嫌疑人面部、指纹和其他识别身体部位的数据库之一。根据联邦调查局的说法，NGI是“世界上最大和最有效的生物特征和犯罪历史信息的电子存储库。”根据对合同记录的审查，自2007年开始实施以来，FBI至少花费了5亿美元，其中大部分流向了早期开发商洛克希德·马丁公司(Lockheed Martin)。皮埃霍塔说，从地方到联邦的各种执法机构都可以访问它，以检查罪犯的身份和背景。信息自由法的记录显示，至少自2013年以来，米特雷已经收到了数百万份合同，提供建造它的技术和指导，这是一个之前没有报道的项目的一部分，名为糖碗II(Sugar Bowl II)，代号不明。\nMitre的高科技窥探也延伸到了快速增长的互联设备世界：想想智能手表、扬声器、电视和安全摄像头。在2017年9月价值50万美元的合同中，国土安全部要求Mitre创建一个系统，该系统可以定位并侵入智能手表、健身跟踪器、家庭自动化设备或任何可以归类为互联网的东西\n侵入智能物联网设备的能力对联邦特工来说可能是非常有利的，尽管政府不会告诉“福布斯”它是在哪里部署的，是如何部署的。正如2017年9月的项目大纲所解释的那样，警方一直缺乏从这类技术中获取证据的技能和资源。美国国家安全局(NSA)前分析师、后来成为网络安全从业者的杰克·威廉姆斯(Jack Williams)表示：“物联网设备捕获了大量遥测数据，我可以想象出有很多地方可以使用这种工具。”他补充称，他对这样的工具会被用于边境检查站感到震惊。这也吓到了民权律师。“它似乎只要求使用工具的人在设备信号的范围内，而不需要实际拥有或访问，”法律援助协会数字法医部门的公设辩护人杰罗姆·格雷科(Jerome Greco)说。“执法部门的使用将令人担忧，很难追究他们如何使用法律的责任。”\nMitre不仅帮助政府审问技术，它还在人类审问方面做了一些工作。追溯到2009年，也就是国土安全部资助的MITRE实验室-国土安全系统工程与发展研究所-成立的那一年，一项名为“人类气味作为欺骗的生物特征”的研究正在进行一些更左倾的工作。在一项让人联想到更多与中央情报局(CIA)有关的左翼项目的研究中，国土安全部着手研究“我想我闻到了老鼠的味道”这句话是否有任何科学基础。其目的是调查使用“人体气味特征”作为“欺骗指示器”的可能性。志愿者在实施或没有实施某些欺骗行为之前和之后都抽取了样本，以了解是否存在差异。他们还想找到证据“支持这样的假设，即一个人的气味特征可以作为生物识别标志。”最基本的问题是：当你撒谎时，你是否有一种完全独一无二的气味？根据国土安全部的说法，答案是肯定的，国土安全部没有回应有关米特雷行动的其他询问。在他们2011年最终报告的执行摘要中，作者说，“结果表明，人类气味的可测量变化似乎确实可以区分欺骗性和非欺骗性的个人。”\n这可能是Mitre更离奇的研究的一个例子，其中大部分仍然存储在那些McLean大厦的金库里，或者被锁在政府服务器的机密印章下。但这就是它的地位，即使工作的价值受到质疑，米特里的名字也足以让它在政府大厅里受到认真对待。Faga是前CEO，目前仍在Mitre的顾问委员会任职，他回忆起最近一次去五角大楼的旅行，在那里召开了一次会议，讨论令人担忧的GPS漏洞。一名代表急于了解他们应该对安全漏洞感到多大的担忧，他问五角大楼是从哪里获得这些信息的。Faga说，当一名官员说Mitre时，房间里的气氛发生了变化。费加补充道，每个人都总结道，“好吧，那么这是真的。”", "note_en": "Mitre Corp runs some of the U.S. government&#39;s most hush-hush science and tech labs. The cloak-and-dagger R&amp;D shop might just be the most important organization you&#39;ve never heard of.\n  Whether it’s an invisible Aston Martin or an exploding pen, whenever James Bond needs a high-tech edge, he goes to Q and his secretive MI6 lab. In the real world, American agents often rely on a less clandestine, but far better funded group. Armed with 8,000 employees and an annual budget of between $1 and $2 billion of taxpayers’ money, Mitre Corp, a government-linked skunkworks, has been making bleeding-edge breakthroughs for U.S. agencies for more than six decades. With its HQ housed in four towers atop a hill in McLean, Virginia, Mitre’s research centers employ some of the nation’s leading computer scientists and engineers to build digital tools for America’s top military, security and intelligence organizations.\n Among the government’s wilder Mitre orders: a prototype tool that can hack into smartwatches, fitness trackers and home thermometers for the purposes of homeland security; software to collect human fingerprints from social media websites like Facebook, Instagram and Twitter for the FBI; support in building what the FBI calls the biggest database of human anatomy and criminal history in the world; and a study to determine whether someone’s body odor can show they’re lying.\n    These varied, multimillion dollar projects, revealed in hundreds of pages of contract details obtained via FOIA requests as well as interviews with former Mitre executives and government officials, provide just a glimpse into this sprawling contractor’s secretive world. Mitre’s influence goes far beyond its vast tech development; it’s also a major consultant for myriad government agencies on how best to deploy tech and policy strategies. Its latest gig: helping the Centers for Disease Control and Prevention (CDC) and Homeland Security&#39;s ominously-named Countering Weapons of Mass Destruction office craft sweeping plans for curtailing the Covid-19 pandemic.\n  “If there&#39;s a national security or public interest [problem], Mitre probably has a hand in it,” says former Mitre cybersecurity engineer Matt Edman. Bald, bearded and baritone-voiced, Edman could have worked at his pick of hot Silicon Valley tech companies, but instead focused his talents on challenging national security problems. During his time at Mitre, Edman partnered with the FBI, using his hacking skills to help takedown the infamous Silk Road dark web drug bazaar. Shortly after he left Mitre he was allowed to finish the job in October 2013, and was in Reykjavik, Iceland, alongside FBI agent Ilhwan Yum, to shutter the site run by the Dread Pirate Roberts, real name Ross Ulbricht, who is now serving a life sentence. Edman was also at Mitre when it helped the FBI hack and monitor users of multiple child exploitation sites as part of Operation Torpedo, in what then attorney general Loretta Lynch  hailed as a landmark dark web investigation.\n   “The prospect of law enforcement agencies being able to cheaply, easily and quickly obtain people’s fingerprints off of social media is extraordinarily chilling.”\n   Mitre’s history is full of such unlauded public service. As its promo material says: “You may not know it, but Mitre touches your life most every day.” Wanting to know the extent of Mitre’s touch,  Forbes launched an investigation to pull Mitre’s staggering range of work from the shadows. What we found is an elite institute that has proved a major boon to the U.S. government, providing tools for surveillance of criminals, diseases and immigrants illegally trying to enter the country. But some of the same projects are setting off alarm bells among human rights organizations and privacy advocates like the ACLU, who are concerned about surveillance overreach from Mitre’s sophisticated technology. Despite multiple requests to meet with Mitre executives in person and visit its headquarters, Mitre declined to provide comment for this article. The FBI and DHS acknowledged requests for comment but had not provided any.\n    Few have heard of Mitre or know its mission, despite its vital importance to the security of the nation. Even locals who live near its large office complex often have no idea it’s been such a stalwart supporter of American national security and defense over the last six decades. “It was just miles away from where I was living and had been there since the mid-50s,” says Shawn Valle, who went to the campus for the first time for a job interview in 2008. “I&#39;d never heard of it.” Valle ended up working on cybersecurity for the Air Force and looking for security issues in Google’s Android operating system during his five years there.\n    While out of the public eye, Mitre’s history is remarkable. The non-profit company was born out of the Cold War, spun out of perhaps the world’s most famous tech campus, the Massachusetts Institute of Technology. (The MIT acronym provides Mitre the first half of its name). In the late 1950s, facing the threat of a Soviet nuclear strike, the U.S. Air Force called on MIT to help it create an air defense system that would help it detect incoming bombers. The institute came up with the Semi-Automated Ground Environment (SAGE). The system combined radar, radio and network communications to detect incoming enemy aircraft, alert and continually update nearby air force bases, which would scramble jets to intercept. It was the first air defense system of its kind in America, and Mitre was founded by MIT administrators in 1958 to manage SAGE and its future development.\n   “DHS has asked Mitre to help build an enduring national capability to contain Covid-19.”\n    Over the next 40 years, Mitre was behind the scenes of now-famous air surveillance technologies such as the Airborne Warning and Communications Systems (AWACS) and the Surveillance Target Attack Radar System (STARS). It also played a significant role in the development of much-used tech like GPS and the commercial airline Traffic Collision Avoidance System. Today its remit is even wider, leading all manner of cybersecurity initiatives and healthcare projects, while sticking to its core role of protecting national security.\n “The characteristic of Mitre that I&#39;ve always explained to people is that when we say we do information sciences, we go way beyond what people would typically call IT,” Martin Faga, the Mitre CEO from 2000 to 2006, tells  Forbes. It would, for example, design a specialized antenna to go on a military aircraft to send and receive data from a communication satellite, says Faga, a white-haired, inconspicuous longtime employee of U.S. intelligence agencies and contractors. Mitre would then design the satellite communications system too, as well as the radar, “every kind of information system,” he adds.\n Its broad expertise is now being employed to help yank America out of its Covid-19 crisis. In a $16.3 million contract signed with the CDC in late June, Mitre was asked to help build “an enduring national capability to contain Covid-19.” The CDC, which spent $20 million with Mitre on disease surveillance tech and services in 2019, hadn’t responded to  Forbes’ requests for more detail on those pandemic plans. Meanwhile, on March 17, four days into the national emergency caused by Covid-19, the DHS Countering Weapons of Mass Destruction (CWMD) office called on Mitre to effectively act as a fulcrum of a pandemic response plan, to “engage, inform and guide” mayors, governors and emergency response leaders dealing with a pandemic. Mitre would also create disease models to track a pandemic and determine what “non-pharmaceutical interventions” (NPIs - think closing schools, stores and implementing social distancing) could help lawmakers “bend the curve.”\n    Government data shows taxpayer dollars directed to Mitre have been rising in recent years, heading towards $2 billion. Mitre says its overall revenue for 2019 was $1.8 million.\n  The $200,000 contract (microscopic by Covid spending standards) states: “As the pandemic progresses, the contractor will identify, collect and analyze data to enable near real-time learning to state and local leaders for the eventual appropriate retrograde of NPI implementation efforts.” In other words, Mitre is helping America’s leaders decide when and how to open up again. (Neither Mitre nor the DHS explained why the CWMD unit was managing such a contract.) And  pro bono, Mitre has created a contact tracing system called Sara Alert that’s been helping various states—Arkansas, Pennsylvania and Vermont, to name a few—monitor outbreaks. The system lets people who’re known to be at risk of Covid-19 infection to upload their symptoms and temperature to their state and local health bodies’ databases. In Arkansas, 12,861 have enrolled since early April, updating the health department via text, call, email or website on their condition. “This system allows us to more readily identify secondary cases, really establishing a better handle on social clusters, which has been a challenge,” says Dr. Mike Cima, chief epidemiologist at the Arkansas Department of Health. It’s been so successful, Cima plans to carry on using Sara Alert for other infectious diseases beyond Covid-19’s demise.\n    Mitre differs from other military and intelligence contractors in that it has no mandate to make any money. Unlike commercial contractors like Northrup Grumman, Raytheon, and General Dynamics, it runs seven of those skunkworks, known in the industry as Federally-Funded Research and Development Centers, a mundane name belying their influential work. Mitre only charges for employees’ time, with a small fee, usually around 3% of the overall cost, that supports further independent research, says Faga. “People come forward with a great idea and say, gee, if I had $100,000, I could turn this into something great. And the company can give it to them.”\n This put the former CEO in an unusual position amongst his Beltway rivals. “I’d go to the annual meeting of the board. I go to my report and say, ‘We worked hard this year. And we broke even.’ And they’d all cheer. Any other CEO would hear, ‘You’re fired.’”\n Mitre doesn’t commercialize the technology it creates. Once a prototype is built, it’s licensed to either the government, private business or academic institutions. Since 2014, it’s transferred more than 670 licenses to industry and university partners.\n  Unshackled from commercial pressures, Mitre’s given latitude to develop some of the more radical answers to the government&#39;s most pressing questions. Take a project to collect fingerprints from peoples’ Facebook, Twitter and other social media posts. Emails and details of a Mitre contract obtained by  Forbes outline a $500,000 “social media image fingerprinting project” for the FBI, which started in 2015. It was run by an FBI hacking unit in Quantico, the Operational Technology Division, and funded by a previously-unreported research funding body called TRIAD. Chris Piehota, the recently-retired chief of operations for the FBI Science and Technology Program, tells  Forbes TRIAD was designed to fund innovative research from objective outside bodies and that “image fingerprinting” is as literal as it sounds: trying to capture biometric information from social media images. Think of gang members who put up photos of themselves online, showing gang signs with their hands, explains Piehota. “They&#39;re also giving us access to their fingerprint patterns,” he adds. “[The FBI] can take your fingerprint characteristics from those images and they can build fingerprint files or fingerprint characteristics for individuals [for whom] we don&#39;t have biographic information.” This could be useful for individuals violating immigration laws where the U.S. doesn’t have a record of their fingerprint in another database, adds Piehota. It could also be used to identify someone in a child exploitation video or, as in an investigation in the Welsh city of Swansea,  catch drug dealers using tools like WhatsApp.\n   “Think of people crossing the U.S.-Mexico border and a surveillance tool that can detect smartwatches and hack them.”\n   The technology, if it works as described, is potentially useful for the law enforcement and intel agencies Mitre works with, and potentially dangerous for personal privacy. Nate Wessler, staff attorney at the ACLU Speech, Privacy and Technology Project, says the surveillance project raises “serious privacy concerns,” especially during a time of  pan-American civil unrest over the  Covid-19 pandemic and racial inequality. “Nobody expects that by posting a digital photo online, they are exposing their unique biometric identifiers including their fingerprints, to collection in a law enforcement database,” he says. “Not only are we seeing historic protests against anti-Black racism and police brutality, but we&#39;re seeing historic levels of digital recordings of those photos of those protesters by the media and by law enforcement… The prospect of law enforcement agencies being able to cheaply, easily and quickly obtain people’s fingerprints off of those photos is extraordinarily chilling.” Piehota notes that as a privacy precaution the FBI would only take fingerprints from social media images where the target was a valid suspect and it wouldn’t simply trawl the likes of Facebook for all available prints.\n Mitre has a history in assisting the U.S. government’s expansion of biometric surveillance. Another 2014 contract details Mitre’s work assisting the FBI on facial recognition tools, right down to “creating local watchlists by flagging subjects of interest.” It’s also helping the FBI build the Next Generation Identification (NGI) system, which is one of the biggest databases of criminal suspects’ faces, fingerprints and other identifying body parts on the planet. According to the FBI, the NGI is “the world&#39;s largest and most efficient electronic repository of biometric and criminal history information.” It’s cost the FBI at least $500 million since its incipience in 2007, much of it going to early developer Lockheed Martin, according to a review of contract records. Piehota says that all manner of law enforcement agencies, from local to federal, can access it to check the identity and background of a criminal. And Mitre, since at least 2013, has received millions in contracts to provide technology and guidance to build it as part of a previously-unreported project called Sugar Bowl II, an unexplained codename, FOIA records show.\n    Mitre’s high-tech snooping also extends to the fast growing world of connected devices: think smart watches, speakers, TVs and security cameras. In a $500,000 September 2017 contract, the DHS asked Mitre to create a system that could locate and hack into smartwatches, fitness trackers, home automation devices, or anything that could be classed as an Internet of Things (IoT) system. The contract says the tech could be used either by law enforcement or border officials to help them “rapidly detect and exploit for evidentiary purposes IoT devices in a security or crime scene environment,” or for use at “physical security boundaries” to hack into devices “passing through or approaching the boundary.” Think of people crossing the U.S.-Mexico border and a surveillance tool that scans every device coming through, checking which ones are smartwatches and other IoT systems. When one is worn by a criminal suspect, it could quickly be drained of data and evidence on their activities gathered, from their text messages to their previous locations.\n One source, a former police officer and surveillance industry expert who claimed knowledge of the contract, says the tech was only ever used by Customs and Border Protection (CBP). Another source, a former Mitre and government employee, says Mitre has long provided digital forensics expertise to CBP staff carrying out searches of electronic devices at the border. And FOIA-obtained contracts worth more than $13 million show Mitre has provided expansive CBP technical support since at least 2016, including a study of the efficacy of Rapid DNA technology - another controversial tool that’s led to an  outcry amongst civil rights organizations, who say the tools infringe on immigrants’ privacy. Designed to help uncover immigrants lying about being families at the border, it can quickly determine whether people entering the U.S. are related. As the government cannot legally detain migrant children for longer than 20 days, they’re typically released before an immigration court hearing and ICE has claimed this is being used as a loophole to smuggle children into the country.\n The power to hack into smart IoT devices could be hugely advantageous for federal agents, though the government wouldn’t tell  Forbes where and how it’s been deployed. As explained in the September 2017 project outline, police have been lacking in the skills and resources to acquire evidence from these kinds of technologies. “IoT devices capture a lot of telemetry and I can imagine lots of places where this is useful,” says Jake Williams, a former NSA analyst turned cybersecurity practitioner, who adds that he was shocked such a tool would be used at border checkpoints. It’s got civil rights lawyers spooked too. “It would appear to only require the person using the tools to be in range of the device signals and would not require physical possession or access,” says Jerome Greco, a public defender in the Digital Forensics Unit of the Legal Aid Society. “Law enforcement use would be troubling and it would be difficult to hold them accountable for how they use it.”\n    Mitre isn’t just helping the government interrogate tech; it’s done some work on human interrogation too. Going back to 2009, the year when the Homeland Security-funded Mitre lab—the Homeland Security Systems Engineering and Development Institute—was founded, some more leftfield work was being undertaken in a study dubbed “Human Odor as a Biometric for Deception.” In research reminiscent of the leftfield projects more often associated with the CIA, Homeland Security set out to see whether there was any scientific basis to the saying, “I think I smell a rat.” Its aim was to investigate the possibility of using the “human odor signature” as an “indicator for deception.” Samples were taken from volunteers before and after they committed or didn’t commit some deceptive act to see whether or not there was a difference. They also wanted to find evidence to “support the hypothesis that an individual’s odor signature can serve as a biometric identifier.” The essential question was: do you have an odor that is entirely unique to you when you lie? Yes, was the answer, according to Homeland Security, which hadn’t responded to other enquiries about Mitre’s operations. In the executive summary of their final report in 2011, the authors said the “results indicate that measurable variations in human odor do seem to permit differentiating between deceptive and non-deceptive individuals.”\n This may be an example of Mitre’s more outré research, much of which remains stored in the vaults of those McLean towers or locked up under classified seals in government servers. But such is its standing, even when the value of work is doubted, Mitre’s name is enough for it to be taken seriously within the halls of government. Faga, the former CEO who remains on an advisory board at Mitre, recalls a recent trip to the Pentagon where a meeting was called to discuss worrying vulnerabilities in GPS. A delegate anxious to know just how worried they should be about the security weaknesses asked where the Pentagon got the information. When an official said Mitre, the atmosphere in the room changed, says Faga. Everyone, adds Faga, concluded, “Okay, well, then it&#39;s real.”", "posttime": "2020-07-13 21:59:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,研究,america,mitre", "title": "美国神秘的20亿美元研究中心", "title_en": "America’s Secretive $2B Research Hub", "transed": 1, "url": "https://www.forbes.com/sites/thomasbrewster/2020/07/13/inside-americas-secretive-2-billion-research-hub-collecting-fingerprints-from-facebook-hacking-smartwatches-and-fighting-covid-19/", "via": "", "real_tags": ["美国", "研究", "america", "mitre"]}, {"category": "", "categoryclass": "", "imagename": "40e95666355bea2f9abe90245c66a4cc.png", "infoid": 1011500, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当同事们在与感冒作斗争时，通常很容易辨别--他们听起来很不舒服。也许他们的声音较低，或者有鼻音。感染会以各种方式改变我们的声音质量。但麻省理工学院林肯实验室的研究人员正在新冠肺炎患者身上检测到这些变化，即使这些变化太微妙，人们自己听不到，甚至注意不到。\n通过处理新冠肺炎感染者的语音录音，但尚未出现症状，这些研究人员发现了这种疾病的声音生物标记物或可测量指标的证据。这些生物标记物源于感染引起的呼吸系统、喉部和关节系统肌肉运动的中断。描述这项研究的技术信函最近发表在IEEE医学和生物学工程开放期刊上。\n虽然这项研究仍处于早期阶段，但初步的发现为更详细地研究这些声音变化奠定了框架。这项工作也可能为使用移动应用程序对人们进行疾病筛查带来希望，特别是那些没有症状的人。\n该实验室人类健康和绩效系统小组的高级工作人员托马斯·夸蒂耶里(Thomas Quatieri)说，我在看新闻的时候有了这样一个瞬间。在过去的十年里，Quatieri一直在领导该小组在声乐生物标记物方面的研究；他们的重点一直是发现神经疾病的声乐生物标记物，如肌萎缩侧索硬化症(ALS)和帕金森氏症(Parkinson‘s disease)。这些疾病和其他许多疾病改变了大脑将想法转化为文字的能力，而这些变化可以通过处理语音信号来检测。\n他和他的团队想知道新冠肺炎的发声生物标记物是否也存在。这些症状使他们这样认为。当症状显现时，一个人通常会呼吸困难。呼吸系统的炎症会影响一个人说话时呼出空气的强度。这种空气与数百块其他可能发炎的肌肉在其演讲过程中相互作用。这些相互作用会影响构成其生物标记物基础的声音可测量品质的响度、音调、稳定性和共鸣。\n在看新闻时，夸蒂耶里意识到他面前有新冠肺炎检测呈阳性的人的语音样本。他和他的同事在Youtube上搜索名人或电视主持人在新冠肺炎阳性但没有症状时接受采访的片段。他们确定了五个受试者。然后，他们下载了这些人在有新冠肺炎之前的采访，尽可能匹配音频条件。\n然后，他们使用算法从每个音频样本的声音信号中提取特征。哈佛大学言语与听觉生物科学与技术项目的博士生塔尼娅·塔卡尔(Tanya Talkar)说，这些声音特征可以代表言语产生系统的潜在运动。\n信号的幅度，或响度，是提取作为呼吸系统运动的代理。为了研究喉部的运动，他们测量了音调和音调的稳定性，这是声带稳定性的两个指标。他们提取语音共振峰作为发音器运动(如舌头、嘴唇、下巴等)运动的指标。语音共振峰是一种频率测量，它对应于嘴巴如何塑造声波，以创造一系列音素(元音和辅音)，并对特定的声音质量(例如，鼻音与暖音)做出贡献。\n他们假设新冠肺炎发炎导致这些系统中的肌肉过度耦合，导致运动不那么复杂。夸蒂耶里说，把这些语音子系统想象成熟练钢琴家的手腕和手指；通常情况下，这些动作是独立的，非常复杂。现在，想象一下，如果手腕和手指的动作粘在一起，作为一个整体移动。这种耦合将迫使钢琴家演奏一首简单得多的曲子。\n研究人员寻找他们特征之间耦合的证据，测量每个特征在受试者说话时如何以10毫秒的增量相对于另一个特征发生变化。然后将这些值绘制在本征谱上；该本征谱图的形状表示信号的复杂性。如果这些值的特征空间形成球面，则信号是复数。塔卡尔说，如果不那么复杂，它看起来可能更像一个扁平的椭圆形。\n最后，他们发现，与新冠肺炎之前的采访相比，新冠肺炎采访的动作复杂性有所降低。Talkar说，喉部和发音器运动之间的耦合不那么突出，但我们看到呼吸和喉部运动之间的复杂性有所降低。\n这些初步结果提示，发声系统协调产生的生物标志物可以指示新冠肺炎的存在。然而，研究人员指出，现在下结论还为时过早，还需要更多的数据来验证他们的发现。他们现在正在使用卡内基梅隆大学公开发布的数据集，其中包含新冠肺炎检测呈阳性的个人的音频样本。\n除了收集更多数据来推动这项研究之外，该团队还在考虑使用移动应用程序来实施这项研究。目前正在与麻省理工学院麦戈文脑研究所的萨特拉·戈什合作，将新冠肺炎的声音筛选整合到其最新的VoiceUp应用中，该应用最初是为了研究声音和抑郁症之间的联系而开发的。后续的努力可能会将这种声音筛选添加到“我们感觉如何”应用程序中。这款应用程序向用户询问他们的日常健康状况和人口统计数据，目的是利用这些数据来定位热点地区，并预测该国不同地区患有这种疾病的比例。要求用户还提交每天的语音备忘录，以筛选新冠肺炎的生物标志物，这可能有助于科学家了解疫情。\n该研究小组的负责人杰弗里·帕尔默(Jeffrey Palmer)表示，集成到移动应用程序中的传感系统可以在人们感到不适之前及早发现感染情况，特别是对这些从未感到不适或出现症状的人来说。作为新冠肺炎整体监测系统的一部分，这也是美军感兴趣的事情。即使在确诊后，这种传感能力也可以帮助医生远程监测患者的病情，或者监测疫苗或药物治疗的效果。\n随着研究小组继续他们的研究，他们计划采取更多措施来解决可能导致结果不准确的潜在混杂因素，例如不同的录音环境、受试者的情绪状态，或者其他导致声音变化的疾病。他们也在支持类似的研究。麻省总医院布里格姆创新中心已经将他们与国际科学家联系起来，这些科学家正在遵循团队的框架来分析咳嗽。\n还有很多其他有趣的领域值得一看。在这里，我们观察了对声道的生理影响。夸蒂耶里说，我们还在寻求扩大我们的生物标记物，以考虑与新冠肺炎有关的神经生理影响，比如味觉和嗅觉的丧失。这些症状也会影响说话。", "note_en": "It&#39;s often easy to tell when colleagues are struggling with a cold — they sound sick. Maybe their voices are lower or have a nasally tone. Infections change the quality of our voices in various ways. But MIT Lincoln Laboratory researchers are detecting these changes in Covid-19 patients even when these changes are too subtle for people to hear or even notice in themselves.\n By processing speech recordings of people infected with Covid-19 but not yet showing symptoms, these researchers found evidence of vocal biomarkers, or measurable indicators, of the disease. These biomarkers stem from disruptions the infection causes in the movement of muscles across the respiratory, laryngeal, and articulatory systems. A technology letter describing this research was recently  published in  IEEE Open Journal of Engineering in Medicine and Biology.\n While this research is still in its early stages, the initial findings lay a framework for studying these vocal changes in greater detail. This work may also hold promise for using mobile apps to screen people for the disease, particularly those who are asymptomatic.\n  &#34;I had this &#39;aha&#39; moment while I was watching the news,&#34; says Thomas Quatieri, a senior staff member in the laboratory&#39;s Human Health and Performance Systems Group. Quatieri has been leading the group&#39;s research in vocal biomarkers for the past decade; their focus has been on discovering vocal biomarkers of neurological disorders such as amyotrophic lateral sclerosis (ALS) and Parkinson&#39;s disease. These diseases, and many others, change the brain&#39;s ability to turn thoughts into words, and those changes can be detected by processing speech signals.\n He and his team wondered whether vocal biomarkers might also exist for Covid-19. The symptoms led them to think so. When symptoms manifest, a person typically has difficulty breathing. Inflammation in the respiratory system affects the intensity with which air is exhaled when a person talks. This air interacts with hundreds of other potentially inflamed muscles on its journey to speech production. These interactions impact the loudness, pitch, steadiness, and resonance of the voice — measurable qualities that form the basis of their biomarkers.\n While watching the news, Quatieri realized there were speech samples in front of him of people who had tested positive for Covid-19. He and his colleagues combed YouTube for clips of celebrities or TV hosts who had given interviews while they were Covid-19 positive but asymptomatic. They identified five subjects. Then, they downloaded interviews of those people from before they had Covid-19, matching audio conditions as best they could.\n They then used algorithms to extract features from the vocal signals in each audio sample. &#34;These vocal features serve as proxies for the underlying movements of the speech production systems,&#34; says Tanya Talkar, a PhD candidate in the Speech and Hearing Bioscience and Technology program at Harvard University.\n The signal&#39;s amplitude, or loudness, was extracted as a proxy for movement in the respiratory system. For studying movements in the larynx, they measured pitch and the steadiness of pitch, two indicators of how stable the vocal cords are. As a proxy for articulator movements — like those of the tongue, lips, jaw, and more — they extracted speech formants. Speech formants are frequency measurements that correspond to how the mouth shapes sound waves to create a sequence of phonemes (vowels and consonants) and to contribute to a certain vocal quality (nasally versus warm, for example).\n They hypothesized that Covid-19 inflammation causes muscles across these systems to become overly coupled, resulting in a less complex movement. &#34;Picture these speech subsystems as if they are the wrist and fingers of a skilled pianist; normally, the movements are independent and highly complex,&#34; Quatieri says. Now, picture if the wrist and finger movements were to become stuck together, moving as one. This coupling would force the pianist to play a much simpler tune.\n The researchers looked for evidence of coupling in their features, measuring how each feature changed in relation to another in 10 millisecond increments as the subject spoke. These values were then plotted on an eigenspectrum; the shape of this eigenspectrum plot indicates the complexity of the signals. &#34;If the eigenspace of the values forms a sphere, the signals are complex. If there is less complexity, it might look more like a flat oval,&#34; Talkar says.\n In the end, they found a decreased complexity of movement in the Covid-19 interviews as compared to the pre-Covid-19 interviews. &#34;The coupling was less prominent between larynx and articulator motion, but we’re seeing a reduction in complexity between respiratory and larynx motion,&#34; Talkar says.\n  These preliminary results hint that biomarkers derived from vocal system coordination can indicate the presence of Covid-19. However, the researchers note that it&#39;s still early to draw conclusions, and more data are needed to validate their findings. They’re working now with a publicly released dataset from Carnegie Mellon University that contains audio samples from individuals who have tested positive for Covid-19.\n Beyond collecting more data to fuel this research, the team is looking at using mobile apps to implement it. A partnership is underway with Satra Ghosh at the MIT McGovern Institute for Brain Research to integrate  vocal screening for Covid-19 into its  VoiceUp app, which was initially developed to study the link between voice and depression. A follow-on effort could add this vocal screening into the  How We Feel app. This app asks users questions about their daily health status and demographics, with the aim to use these data to pinpoint hotspots and predict the percentage of people who have the disease in different regions of the country. Asking users to also submit a daily voice memo to screen for biomarkers of Covid-19 could potentially help scientists catch on to an outbreak.\n &#34;A sensing system integrated into a mobile app could pick up on infections early, before people feel sick or, especially, for these subsets of people who don&#39;t ever feel sick or show symptoms,&#34; says Jeffrey Palmer, who leads the research group. &#34;This is also something the U.S. Army is interested in as part of a holistic Covid-19 monitoring system.&#34; Even after a diagnosis, this sensing ability could help doctors remotely monitor their patients’ progress or monitor the effects of a vaccine or drug treatment.\n As the team continues their research, they plan to do more to address potential confounders that could cause inaccuracies in their results, such as different recording environments, the emotional status of the subjects, or other illnesses causing vocal changes. They&#39;re also supporting similar research. The  Mass General Brigham Center for COVID Innovation has connected them to international scientists who are following the team&#39;s framework to analyze coughs.\n &#34;There are a lot of other interesting areas to look at. Here, we looked at the physiological impacts on the vocal tract. We&#39;re also looking to expand our biomarkers to consider neurophysiological impacts linked to Covid-19, like the loss of taste and smell,&#34; Quatieri says. &#34;Those symptoms can affect speaking, too.&#34;", "posttime": "2020-07-13 21:59:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "感染,covid,声音", "title": "Covid感染的迹象可能隐藏在语音信号中", "title_en": "Signs of Covid infection may be hidden in speech signals", "transed": 1, "url": "http://news.mit.edu/2020/signs-covid-19-may-be-hidden-speech-signals-0708", "via": "", "real_tags": ["感染", "covid", "声音"]}, {"category": "", "categoryclass": "", "imagename": "6e392fd44d9054cec35d65a2d5e19cd3.gif", "infoid": 1011499, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了换取亚马逊的好评，招募我的神秘Facebook账号承诺给我免费的东西。他们送来了。\n我并不打算成为一个受雇的骗子，一个在那个可怕的网站亚马逊上提供假新闻的人。但当我醒来时，我被我的谎言所笼罩，我知道我做得太过分了。我的毯子，枕头，甚至我的羽绒被都是谎言。睡衣，我的夜灯，我挂在墙上的圣诞彩灯：都是假的。\n在过去的九个月里，我一直在写亚马逊的正面评论，以换取免费商品。像大多数罪犯一样，我通过一个名为RebateKey的网站从合法起步，该网站提供5%到100%的回扣，以换取离开评论。当消费者在寻找含有法国粉色粘土和玫瑰天竺葵精油的LifeStone玫瑰石英水晶肥皂、肉类温度计或报童帽时，卖家利用这种小额退款的第三方服务来支持搜索结果。回扣支票是30天后到的，所以付款后不能退货。只有当我真正对拥有有问题的产品感兴趣时，参与才有意义。\n但在我使用Facebook Messenger联系到RebateKey客服后，社交媒体数据真空(也就是Facebook)显然将我锁定为对撰写亚马逊产品评论感兴趣的人。它给我发了一则广告，上面有一张办公椅的图片，上面写着：“点击这里，获得100%的回扣优惠。”我点击了它。突然弹出了一条严厉的私人消息：“欢迎加入SmugDesk公司的审阅者奖励计划，并参与令人敬畏的免费产品试用。每个人只有一次机会加入这个计划。有很多人想要享受我们的福利，所以在我们正式确认合作之前，我们需要确保你能接受以下几点。“。用结结巴巴的英语，我得到了一套指示。尽管令人毛骨悚然，我还是点击了“我同意。”最坏的情况是，我想我可以退还椅子并拿到退款。按照说明，我在亚马逊上输入了特定的搜索关键字，找到了椅子和单独的轮子，然后花了196.72美元买下了它们。三天后，这些物品装在一个很重的盒子里，勉强装进了我的门。\n根据Facebook Messenger的指示，我的PayPal退款只有在我离开五星级评论的情况下才会来。我不想撒太多谎，所以我在标题下面写了一份平淡无奇的文案，“我想，它们奏效了！”两个工作日后，我的贝宝账户里有196.72美元。按字面计算，这仍然是我作为作家获得的最高报酬。\n很快，亚马逊评论计划的其他广告开始在我的feed上弹出。四种标签不同的相同胡须油。一盏挂在我桌子上的自拍灯。三盎司的瓶子，用来携带液体通过机场安检。甚至还有一盏专业摄影师用的大灯。我不需要这些东西，我已经上瘾了。\n我把我复习过的冬季手套和围巾捐给了穷人，这是我作为一个网上罗宾汉的微弱尝试。我最终得到了不只一件，而是两件圣诞毛衣：一件涤纶毛衣，一只骆驼，戴着围巾，还有一件连帽衫，让我看起来像是从精灵那里偷来的。我讨厌圣诞节。我是犹太人。\n虚假的Facebook账户，上面有平淡无奇的鲜花头像，开始给我发信息。“你是美国评论家吗？”我会说是的，然后把我的亚马逊个人资料链接发给他们，这样他们就可以看到我的许多评论。电话另一端的人会给我发信息，上面有各种各样的产品图片，我会选择我想要的。他们会提供关键词，告诉我产品的确切售价和评论数量，所以我必须先搜索，然后自己选择产品，这个过程可能会提高产品的搜索排名。这是一种轻推的方式，把我偷偷地送到产品那里，而没有分享确切的链接。\n“我评论的越多，Facebook账户要求我评论的内容就越多。”\n我会搜索商品并购买，与账户分享我的屏幕截图和订单号，然后等待商品到达，这样我就可以查看它。然后，我会分享张贴评论的截图。在我的评论中，我会尽量说出真相，但我经常需要使用中立的、以事实为基础的语言。对于一套浴室挂钩，我写道，“很棒的一套挂钩。我在我的卧室和浴室里用它。粘性很好，很容易安装。“。这些话没有一句是假的。对于架子单元，我写道，“架子单元很紧凑，可以很容易地放在角落里。我喜欢它，因为它太小了。而且很容易组装！我总是害怕把东西放在一起，而这是超级简单的。你甚至可以看到我照片上的说明。“。在某种程度上，我是一个机器人，只是像实地记者一样发布事实。\n我评论的越多，Facebook账户要求我评论的内容就越多。这成了每天的例行公事。\n凌晨1点。或者说，在为第二天的课程匆匆看完一本书或塞进一张纸之后，为我提供复习机会的Facebook账户变得活跃起来。从他们没完没了的纠缠中可以明显看出他们是在催促。他们不是产品的卖家。他们没有给我寄钱。他们是招聘人员、零工，他们会跟踪我，让我做好我的工作。许多不同的账户都会提供同样的24种商品。贝宝(PayPal)的退款来自不同的普通话电子邮件账户，但没有告诉我退款是为了什么。我必须将退款金额与我购买的几十种产品相匹配。我记不清我用什么假名字买的东西。\n在我们谈话的交易性质中，我试图通过让招聘人员参与谈话来更好地了解他们。在视频聊天中，会弹出一张半亮的脸，说“看看我的产品”。我会问他们在哪里，有时他们会说一个国家，但他们有限的英语超出了剧本的范围，使细节变得最少。他们住在像孟加拉国和印度这样的国家，他们说他们每发表一篇像我这样的人的评论就会得到几美元的报酬。\n如果你考虑到亚马逊评论对平台上的卖家来说有多有价值，亚马逊评论的黑市就有一定的意义。该平台上有超过250万卖家，要让可能购买的客户看到并不是一件容易的事情。正如一位自2016年以来一直在亚马逊市场(Amazon Marketplace)上销售商品的朋友向我解释的那样，在亚马逊上，“你对一件商品的评论越多，它就越有可能出现在算法搜索中。顾客喜欢的商品越多，加上评论，亚马逊就越喜欢它。\n亚马逊到底是如何在其搜索算法中使用评论的，这是一个谜。并不是所有的评论都有相同的价值。随着时间的推移，旧的评论可能会失去价值，在其他网站上购买产品的消费者的评论-未经验证的购买-可能会变得更不值钱。亚马逊还可能会根据客户的评论数量和平均评论得分对评论进行不同的加权。亚马逊对其具体方法保密。因此，卖家总是在尝试新的方法来招募好评。\n但为什么卖家不直接在亚马逊上给我退款，跳过中介佣金和贝宝(PayPal)呢？他们两次“购买”了我的评论，一次是退款，另一次是招聘人员的佣金。为什么要不厌其烦地在Facebook上招募我，并给我发免费的东西呢？\n当我问另一位亚马逊的长期卖家这个问题时，他说这是因为亚马逊一直在打击虚假和激励性的评论。直到2016年，该公司实际上还允许卖家提供折扣和免费商品，以换取评论，只要评论员在评论中披露了这笔交易。甚至在改变这一政策之前，该公司就已经起诉了提供这项服务的网站的运营商，以及提出离开五星评论以换取使用自由撰稿人网站Fiverr的费用的个人。联邦贸易委员会去年首次对一家雇佣虚假审查员的公司提出指控。\n“当我的卧室堆满了箱子时，罪恶感慢慢地涌上来。无处不在的亚马逊符号，形状像一个微笑，嘲笑我，提醒我我正在以一种不道德的方式增加互联网上的喧嚣。\n亚马逊正在寻找可疑的评论家。招募像我这样的人会在亚马逊上用真实地址的账户进行真正的购买，而且退款是隐藏在亚马逊的平台之外的。所有这些都使评论更具说服力。\n尽管如此，这一策略似乎并不完美。我的一些评论从来没有发表过。一些物品神秘地被取了下来。有时，我会购买一件物品，收到它，然后回去查看，结果发现它被取下了。\n当我的卧室堆满了箱子时，罪恶感慢慢涌上心头。无处不在的亚马逊符号，形状像一个微笑，嘲笑我，提醒我我正在以一种不道德的方式增加互联网上的噪音。它变成了皱眉。我的父母把我培养成一个诚实的人，这是最重要的。这是骗人的，我的话影响了别人的决定。谁知道呢？我对一张不好的椅子的正面评价可能会导致某人的背部问题。我在这里，为我最终赠送的东西从事不道德的行为，就像某种强盗大亨一样。更糟糕的是，我在神学院学习宗教。认知上的不和谐堆积如山。\n一位家庭成员去世了，我在他们的记忆中停止了我的不良行为。现在我得搬家了，想想怎么处理我衣柜里的垃圾。与此同时，开启这一切的那把沉重的椅子还在盒子里，还有我的正直。\n我仍然有朋友向我伸出援手，问我一个浪漫的问题：“你是美国评论家吗？”", "note_en": "In exchange for positive Amazon reviews, the mysterious Facebook accounts who recruited me promised me free stuff. They delivered.\n  I didn’t intend to become a liar for hire, a purveyor of fake news on that terrible site, Amazon. But I knew I went too far when I woke up shrouded by my untruths. My blanket, pillows, and even my duvet were a lie. The pajamas, my night light, the Christmas lights that I hung on the wall: all falsehoods.\n For the last nine months, I’d been writing positive Amazon reviews in exchange for free merchandise. Like most criminals, I started out legit, through a site called RebateKey, which offers rebates between 5% and 100% in exchange for leaving a review. Sellers used this third-party service of small refunds to bolster the search results when consumers are looking for, say, LifeStone Rose Quartz Crystal Soap with French Pink Clay and Rose Geranium Essential Oil, a meat thermometer, or a newsboy cap. The rebate check arrived after 30 days, so I couldn’t return the product after payment. It only made sense to participate if I were truly interested in owning the product in question.\n But after I contacted RebateKey customer service using Facebook Messenger, the social media data vacuum otherwise known as Facebook apparently pegged me as someone interested in writing Amazon product reviews. It served me an ad with a picture of a desk chair that read: “Click here for 100% rebate offer.” I clicked it. A draconian private message popped up: “Welcome to Smugdesk company’s Reviewer Reward Program and participate in awesome Free product trial. Everyone only have one chance to join this program. There are lots of people want to enjoy our benefits, so before we officially confirm the cooperation, we need to make sure you can accept the following.” In halted English, I was given a set of directions. And despite the disembodied creepiness, I clicked “I agree.” Worst-case scenario, I figured I could return the chair and get a refund. Following the directions, I plugged in specific search keywords into Amazon, found the chair and separate wheels for it, and purchased them for $196.72. The items came three days later in a heavy box that barely fit through my door.\n  My PayPal refund, according to the Facebook Messenger directions, would only come if I left a five-star review. I didn’t want to lie too much, so I wrote bland copy under the title, “They work, I guess!” Two business days later, $196.72 arrived in my PayPal account. It is still the most money I was ever paid as a writer, per word.\n Soon, other ads for Amazon review schemes started popping up on my feed. Four kinds of identical beard oil with differing labels. A selfie lamp that attached to my table. Three-ounce bottles used for carrying liquid through airport security. Even a large lamp used for professional photographers. I didn’t need any of this stuff; I was addicted.\n I donated winter gloves and scarves I’d reviewed to the poor in a weak attempt at being an online Robin Hood. I ended up with not one but two Christmas sweaters: a polyester number with a llama wearing a scarf and a hoodie that made me look like I stole it from an elf. I hate Christmas. And I’m Jewish.\n Fake Facebook accounts with bland profile pictures of flowers started messaging me. “Are you a US Reviewer?” I would say yes and send them my Amazon profile link so they could see my many reviews. The person on the other end would message me a gallery of various product images, and I would choose the one I wanted. They’d offer keywords and tell me the exact amount the product sold for and the number of reviews it had, so I would have to search first and then select the product on my own, a process that might raise the item’s search ranking. It was a nudge-nudge kind of thing, sending me covertly toward the products without sharing the exact link.\n “The more I reviewed, the more the Facebook accounts asked me to review.”\n I’d search for the item and buy it, share my screenshot and order number with the account, and wait for the item to arrive so I could review it. Then, I’d share the screenshot of the posted review. In my reviews, I would try to tell the truth, but I often needed to use neutral fact-based language. For a set of bathroom hooks, I wrote, “Great set of hooks. I use it in my bedroom and my bathroom. Very adhesive and easy to set up.” None of those words were untrue. For a shelving unit, I wrote, “The shelving unit is compact and can easily fit in a corner. I like it BECAUSE it was so small. And easy to assemble! I’m always afraid of putting things together, and this was super easy. You can even see the instructions in my picture.” In a way, I was an automaton, just posting facts like a reporter from the field.\n The more I reviewed, the more the Facebook accounts asked me to review. It became a daily ritual.\n At 1 a.m. or so, after scarfing down a book or cramming in a paper for the next day’s class, the Facebook accounts that offered me reviewing opportunities came alive. It was obvious from their incessant badgering that they were hustling. They were not the products’ sellers. They did not send me money. They were recruiters, gig workers, and would follow up with me so that I did my job. Many different accounts would offer the same two dozen items. The PayPal refund, coming from different email accounts with Mandarin characters, did not tell me which refund the item was for. I would have to match the refund amount with the dozens of products I purchased. I could not keep track of what I purchased from what fake name.\n Amid the transactional nature of our conversations, I tried getting to know the recruiters better by engaging them in conversation. In a video chat, a semi-lit face would pop on and say “see my products.” I would ask them where they were, and sometimes they would say a country, but their limited English beyond the script kept details minimal. They lived in countries like Bangladesh and India and said they were paid a few American dollars for each review they got someone like me to post.\n The black market for Amazon reviews makes some sense if you consider how valuable positive reviews can be to sellers on the platform. With more than 2.5 million  sellers on the platform, getting seen by customers who might make a purchase is no easy feat. As one friend who has been selling on Amazon Marketplace since 2016 explained to me, on Amazon, “the more reviews you have on an item, the more likely for the item to come up in an algorithmic search. The more customers like the item, with reviews, the more Amazon likes it.”\n Exactly how Amazon uses reviews in its search algorithms is a mystery. Not all reviews are  worth the same. Older reviews may lose value over time, and reviews from consumers who purchased their products on other sites — unverified purchases — may be worth less. Amazon might also weigh reviews differently based on the customer’s number of reviews and average review score. Amazon keeps its exact methods secret. So sellers are always trying new methods to recruit good reviews.\n But why didn’t sellers just refund me on Amazon, and skip intermediary commissions and PayPal? They “bought” my reviews twice, once on the refund and once on the recruiters’ commissions. Why go through all this trouble to recruit me on Facebook and send me free stuff?\n When I asked another long-time Amazon seller this question, he said that it’s because Amazon has been cracking down on fake and incentivized reviews. Up  until 2016, the company actually allowed sellers to offer discounts and free merchandise in exchange for reviews, as long as the reviewer disclosed the deal in their review. Even before changing this policy, the company had  sued the operators of websites offering the service as well as  individuals who offered to leave five-star reviews in exchange for a fee using the freelancing website Fiverr. The FTC  issued its first charges against a company that hired fake reviewers last year.\n “The guilt crept in slowly as my bedroom piled up with boxes. The ubiquitous Amazon symbol, shaped like a smile, taunted me, reminding me that I was adding to the noise on the internet in an unethical manner.”\n Amazon is on the lookout for suspicious reviewers. Recruiting people like me creates real purchases on Amazon from accounts with real addresses, and the refund is hidden off of Amazon’s platform. All of which make the reviews more convincing.\n Still, the strategy didn’t seem to work perfectly. Some of my reviews were never posted. Some items mysteriously got taken down. Sometimes I would purchase an item, receive it, and go back to review it, only to find that it was taken down.\n  The guilt crept in slowly as my bedroom piled up with boxes. The ubiquitous Amazon symbol, shaped like a smile, taunted me, reminding me that I was adding to the noise on the internet in an unethical manner. It became a frown. My parents raised me to be an honest person, above all else. This was lying, and my words were influencing others’ decisions. And who knows? My positive reviews on a bad chair might cause someone back problems. Here I was, engaging in immoral behavior for things I ended up giving away, like some sort of robber baron. Worse, I was in Divinity School, studying religion. There was a pileup of cognitive dissonance.\n A family member passed away, and I stopped my bad behavior in their memory. Now I have to move and figure out what to do with all the crap in my closet. Meanwhile, the heavy chair that started it all is still in the box, along with my integrity.\n I still have friends reaching out to me, asking me the romantic question: “Are you a US Reviewer?”", "posttime": "2020-07-13 21:58:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "亚马逊,amazon,奇特,stint,评论", "title": "我作为受雇亚马逊评论员的奇特经历", "title_en": "My Bizarre Stint as an Amazon Reviewer for Hire", "transed": 1, "url": "https://onezero.medium.com/my-bizarre-stint-as-an-amazon-reviewer-for-hire-260bd6f7a8fa", "via": "", "real_tags": ["亚马逊", "amazon", "奇特", "stint", "评论"]}]