[{"category": "", "categoryclass": "", "imagename": "9bc189ba3901a5cb8bc94070cb77efd9.jpg", "infoid": 1012011, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "申请公司软件工程职位的人经常被要求在面试官的注视下，在白板上解决问题，以此作为评估解决技术问题能力的一种方式。\n但根据新的研究，最近的研究表明，白板技术测试-对求职者来说如此令人望而生畏，以至于有关于如何应对它们的书籍-往往无法评估技术技能。相反，它们都是关于压力的。\n在今年晚些时候将在ACM联合欧洲软件工程会议和软件工程基础研讨会上提交的一篇论文[PDF]中，来自北卡罗来纳州立大学(NCSU)和美国微软的研究人员认为，白板课程测试的是怯场，而不是编码能力。\n这篇论文的标题暗示了它的结论：压力会影响技术面试表现吗？NCSU的作者马纳兹·贝鲁齐(Mahnaz Behroozi)、希瓦尼·希罗卡(Shivani Shirolkar)和微软(Ttes Barik)的克里斯·帕宁(Chris Parnin)表示，几乎肯定会影响。\n通过一次愉快的事故，软件业似乎重新发明了一种粗糙而有效的工具，可以可靠地在受试者中引入压力，这通常表现为表现焦虑，该论文解释道。\n当Facebook说你不适合文化时，这意味着你不够白人或亚洲人-抱怨。\n多读。\n技术面试与特里尔社会压力测试(Trier Social Stress Test)有着惊人的相似之处，特里尔社会压力测试是心理学家使用了数十年的程序，也是最著名的唯一目的在于可靠地引发压力的黄金标准程序。\n因此，白板面试可能无法评估程序员的能力。相反，研究人员认为，他们衡量的是求职者处理焦虑的能力。\n使用48名有编程经验的研究生和本科生，研究人员进行了一项随机对照试验，以比较传统的技术面试(在观看的情况下进行)和私下评估(在没有人观察的情况下进行)。这项实验旨在通过收集眼球跟踪指标，特别是注视持续时间和瞳孔放大来衡量认知负荷和压力。\n研究人员发现，压力会阻碍面试表现，传统技术面试的参与者表现出更高的认知负荷、更低的分数和更高的压力水平。从本质上说，由于面试的情况，社交焦虑让原本符合条件的求职者退出了竞选。\n我们还观察到，没有一位女性在公共场合成功地解决了这个问题，而所有女性在私人场合都正确地解决了这个问题，该报说。\n在接受“纪事报”的电话采访时，北卡罗来纳州立大学(NC State University)助理教授、该论文的合著者之一克里斯托弗·帕宁(Christopher Parnin)表示，他没有确凿的理由解释为什么会出现这种情况。他说，在学术文献中有一些支持，表明女性比男性有更多的表现焦虑，但他强调，这种说法过于简单化，因为男性也会经历表现焦虑。\n对于帕宁来说，问题在于白板测试本身。他说，这一切都归结于这样一个事实，即这项测试旨在让几乎所有人都不及格。你基本上必须面试很多人，才能找到那些能通过考试的人。\n帕宁对该行业处理测试难度的方式提出了异议。谷歌等公司并没有想出一种公平的方式来评估软件工程师，而是建议至少举行40次练习会--这一时间承诺并不是每个人都可以选择的。他说，这相当于压力接种培训，它确实有助于人们通过白板测试，但这并不能使测试成为一种有效的技能评估工具。\n作为另一种选择，白皮书指出了devops biz Honeycomb(猎犬技术公司)-由一名女性首席执行官、首席技术官、首席营销官和工程副总裁监督的招聘方式。该公司提前提供面试问题，所以这不是特里尔社会压力测试。\n正如该公司在其网站上解释的那样，其目标是避免意外。该公司表示，研究很清楚：未知因素会导致焦虑，人们在焦虑时表现不佳。\n帕宁说，大局是提供更容易接近的替代品。有很多方法可以在不给人们施加压力的情况下测试相同的东西。\nThe Register-独立于科技界的新闻和观点。情况发布的一部分", "note_en": "People applying for software engineering positions at companies are often asked to solve problems on a whiteboard, under the watchful eye of an interviewer, as a way to assess technical problem solving skills.\n  But recent research suggests that whiteboard technical tests – so daunting to job seekers that there are  books on how to deal with them – often fail to assess technical skill, according to new research. Instead, they&#39;re all about pressure.\n  In  a paper [PDF] to be presented later this year at the ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering, researchers from North Carolina State University (NCSU) and Microsoft in the US argue that whiteboard sessions test for stage fright rather than, y&#39;know, coding competency.\n  The title of the paper hints at its conclusion: &#34;Does Stress Impact Technical Interview Performance?&#34; NCSU authors Mahnaz Behroozi, Shivani Shirolkar, and Chris Parnin, with Titus Barik from Microsoft, say it most certainly does.\n  &#34;Through a happy accident, the software industry has seemingly reinvented a crude yet effective instrument for reliably introducing stress in subjects, which typically manifests as performance anxiety,&#34; the paper explains.\n  When Facebook says you&#39;re not a good &#39;culture fit&#39;, it means you&#39;re not White or Asian enough – complaint\n  READ MORE\n  &#34;A technical interview has an uncanny resemblance to the  Trier Social Stress Test, a procedure used for decades by psychologists and is the best known &#39;gold standard&#39; procedure for the sole purpose of reliably inducing stress.&#34;\n  As a consequence, whiteboard interviews may fail to assess coder competency. Rather, the researchers argue, they measure how well job candidates handle anxiety.\n  Using 48 graduate and undergraduate students with programming experience, the researchers conducted a randomized controlled trial to compare the traditional technical interview (done while being watched) with a private session evaluation (done without being observed). The experiment was designed to measure cognitive load and stress through the collection of eye tracking metrics, specifically fixation duration and pupil dilation.\n  The researchers found that stress hinders interview performance, with participants in the traditional technical interview exhibiting higher cognitive load, lower scores, and higher stress levels. In essence, social anxiety took otherwise qualified job candidates out of the running because of the circumstances of the interview.\n      &#34;We also observed that no women successfully solved the problem in the public setting, whereas all women solved it correctly in the private setting,&#34; the paper says.\n  In a phone interview with  The Register, Christopher Parnin, assistant professor at NC State University and one of the paper&#39;s co-authors, said he doesn&#39;t have a conclusive reason why this might be the case. He said there&#39;s some support in academic literature to indicate the women have more performance anxiety than men, but he stressed that&#39;s a gross oversimplification because men experience performance anxiety too.\n  For Parnin, the problem is whiteboard tests themselves. &#34;It all comes down to the fact that the test is designed to make almost anyone fail,&#34; he said. &#34;You&#39;re basically having to interview tons of people just to find those who can pass it.&#34;\n  Parnin took issue with the way the industry has dealt with the difficulty of its tests. Rather than coming up with a fair way to evaluate software engineers, companies like Google advise at least 40 practice sessions - a time commitment that&#39;s not an option for everyone. This amounts to stress inoculation training and it does help people pass whiteboard tests, he said, but it doesn&#39;t make the tests an effective skill assessment tool.\n  As an alternative, the paper points to the way devops biz Honeycomb (Hound Technology) – overseen by a female CEO, CTO, CMO and VP of engineering – approaches hiring. The company provides interview questions in advance so it&#39;s not a Trier Social Stress Test.\n  As the company  explains on its website, its goal is to avoid surprises. &#34;The research is clear: unknowns cause anxiety, and people don’t perform well when they’re anxious,&#34; the company says.\n  &#34;The big picture is to provide more accessible alternatives,&#34; said Parnin. &#34;There are a lot of ways to test for the same thing without putting all this pressure on people.&#34; ®\n         The Register - Independent news and views for the tech community. Part of Situation Publishing", "posttime": "2020-07-15 21:07:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "面试,编码,coding,压力", "title": "白板编码面试是“反女性的心理压力测试”", "title_en": "Whiteboard coding interviews are 'anti-women psychological stress exams'", "transed": 1, "url": "https://www.theregister.com/2020/07/15/it_hiring_whiteboard/", "via": "", "real_tags": ["面试", "编码", "coding", "压力"]}, {"category": "", "categoryclass": "", "imagename": "d2c62814dafda677101ec36dd7f6ab68.jpg", "infoid": 1012009, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "M.Joshua Hendrix，MD 1；Charles Walde，MD 2；Kendra Findley，MS 3；Robin Trotman，DO 4(查看作者从属关系)。\n查看建议引用。\n为减少SARS-CoV-2的传播，建议使用一致和正确的布面覆盖物。\n接触两名确诊为新冠肺炎的有症状发型师的患者中，发型师和患者均戴口罩，无症状继发病例报告；67例SARS-CoV-2检测结果均为阴性。坚持社区和公司的遮脸政策可能会缓解SARS-CoV-2的传播。\n随着居家服务的取消，社会上的专业和社交互动将为SARS-CoV-2的传播提供更多机会。更广泛地实施遮脸政策可以减轻感染在普通人群中的传播。\n2020年5月12日(第0天)，密苏里州斯普林菲尔德A沙龙的一名发型师(发型师A)出现呼吸道症状，并继续与客户合作，直到第8天，发型师收到了导致2019年冠状病毒病的SARS-CoV-2病毒的阳性检测结果(新冠肺炎)。第二位发型师(发型师B)曾接触过发型师A，他于2020年5月15日(第3天)出现呼吸道症状，在寻求SARS-CoV-2检测之前，他与客户在甲沙龙工作到第8天，第10天结果呈阳性。共有139名客户从出现症状到请假期间接受了发型师A和B的直接服务。发型师A和B以及这139名客户遵循斯普林菲尔德市条例*和沙龙A的政策，建议发型师和客户在互动过程中使用面罩(即外科口罩、N95呼吸器、†或布质面罩)。沙龙A的其他与发型师A和B密切合作的发型师在最后一次与发型师A或B接触后，被确认、隔离并每天监测14天，这些发型师都没有报告新冠肺炎症状。发型师B在第10天收到阳性检测结果后，沙龙A关闭3天，对经常接触和污染的区域进行消毒。经公共卫生追踪和2周随访，接触者或其二次接触者均未发现新冠肺炎症状。全市的条例和公司政策可能在这些接触期间起到了防止SARS-CoV-2传播的作用。这些发现支持源头控制在预防传播中的作用，并可以为新冠肺炎大流行期间公共卫生政策的制定提供信息。随着居家服务的取消，社会上的专业和社交互动将为SARS-CoV-2的传播提供更多机会。更广泛地实施掩蔽政策可以减轻感染在普通人群中的传播。\n发型师A在接受聚合酶链反应诊断为新冠肺炎之前，从第0天一直工作到第8天，出现新冠肺炎症状。虽然在第6天的测试后建议自我隔离，但发型师A继续工作，直到测试结果呈阳性，此时发型师A被沙龙A禁止工作。在第3天，在与发型师A合作后，发型师B出现了呼吸道症状。在发型者A的症状期间，两位造型师进行互动，而在客户之间的间隔时间，两位造型师都没有戴上面具。发型师B在有症状的情况下工作了3-8天，然后自我隔离并寻求PCR检测，第10天SARS-CoV-2呈阳性结果。发型师A在有症状的情况下与客户工作了8天，发型师B在有症状的情况下工作了5天。在沙龙A与客户的所有互动中，造型师A戴着双层棉质面罩，造型师B戴着双层棉质面罩或外科口罩。\n格林县卫生局(密苏里州)对所有139名接触者进行了追踪，追溯到发型师A和B第一次出现症状的日期。这139名顾客在最后一次接触A沙龙后接受了监测，顾客被要求进行14天的自我隔离，并每天被打电话或发送短信询问任何症状，没有人报告新冠肺炎的体征或症状。所有接触者在接触后5天或接触者开始追踪前5天尽快进行检测。总体而言，67名客户(48.2%)自愿接受检测，72名客户(51.8%)拒绝；所有67份鼻咽拭子样本PCR检测SARS-CoV-2均为阴性。在最初的接触追踪后1个月尝试电话采访，以收集补充信息。在139名接触者中，格林县卫生厅约谈了104人(74.8%)。\n在139名客户中，平均年龄为52岁(范围为621-93岁)；79名客户(56.8%)为男性(表1)。沙龙预约时间从15分钟到45分钟不等(中位数=615分钟；平均=419.5分钟)。在104名受访客户中，102名(98.1%)报告他们在整个预约过程中都戴着面罩，两名(1.9%)报告在部分时间内戴着面罩(表2)。客户使用的面罩类型各不相同，49人(47.1%)戴布面罩，48人(46.1%)戴医用口罩，5人(4.8%)戴N95口罩，2人(1.9%)不知道自己戴的是什么面罩。总体而言，101名(97.1%)受访客户报告称，他们的造型师在整个预约过程中都戴着面罩；3人不知道。当被问及发型师所戴面罩的类型时，64名(61.5%)的客户报告说他们的发型师戴着布质面罩(39名；37.5%)或外科口罩(25名；24.0%)；40名(38.5%)的客户不知道或不记得发型师所戴的面罩的类型。当被问及他们在就诊前的90天内是否有呼吸道症状时，87名(83.7%)的客户报告说他们没有。在那些确实报告了以前的症状的人中，没有人报告对新冠肺炎进行了检测或诊断。\n发型师A和B在沙龙A之外的6名密切接触者被确认：4名造型师A和2名造型师B。所有4名造型师A的联系人后来都出现了症状，并对SARS-CoV-2进行了PCR检测呈阳性。这些联系人是造型师A的同居丈夫和她的女儿、女婿以及他们的室友，他们都住在另一个家庭。发型师B的所有接触者都没有出现症状。\nSARS-CoV-2主要在彼此接近(即6英尺以内)的人之间传播，一个人与感染者接触越密切，接触时间越长，传播的风险就越高(1)。在密苏里州斯普林菲尔德的A沙龙，两名有新冠肺炎症状的发型师在接受新冠肺炎的诊断之前与139名客户密切合作，他们的客户中没有一人出现新冠肺炎症状。发型师A和B以及98%的受访客户都遵循了公司政策和斯普林菲尔德市条例，要求提供个人护理服务的企业的员工和客户必须戴面罩。这项全市范围的条例将建筑物最大等候区域座位减少到正常容量的25%，并建议在无法物理距离的室内和室外公共场所使用面罩。在客户和发型师之间的这些互动中，公司和城市的政策都可能是防止SARS-CoV-2传播的重要因素。这些结果支持在对公众开放的地方使用面罩，特别是在社会距离不可能的情况下，以减少SARS-CoV-2的传播。\n虽然SARS-CoV-2主要通过病人咳嗽或打喷嚏时的呼吸道飞沫传播(1)，但数据表明，病毒开始脱落是在症状出现前的2至3天，也就是病毒载量最高的时候(2)。虽然SARS-CoV-2从无症状患者(尚未出现症状的人)和无症状的人(未出现症状的人)的传播率尚不清楚，但这些人可能导致了SARS-CoV-2的传播(3)。由于存在无症状和无症状传播的可能性，应考虑在公共场所广泛采用要求遮盖面部的政策，以减少新冠肺炎额外浪潮的影响和幅度。\n以前的研究表明，医用口罩和自制的布面罩都可以减少病毒在空气中和表面上的气雾化(4，5)。虽然还没有研究直接检查SARS-CoV-2的传播，但来自以前流行病(6，7)的数据支持使用普遍的面罩作为一种政策来减少SARS-CoV-2的传播，新冠肺炎的观察数据也是如此，该数据分析了194个国家，发现口罩或口罩政策的持续时间与人均冠状病毒相关死亡率呈负相关；在不推荐口罩和呼吸口罩的国家中，指数病例后，人均冠状病毒相关死亡率每周增加54.3%，而在那些有掩蔽政策的国家，这一比例为8.0%(CT Leffler，弗吉尼亚联邦大学，未发表的数据，2020年)。§其他呼吸道病毒暴发也观察到了类似的结果，包括2002-04年爆发严重急性呼吸系统综合症(SARS)(6例)和2007-08年流感季节(7例)。一项关于面罩对抗呼吸道病毒有效性的系统综述分析了19个随机试验，结论是口罩和口罩的使用似乎在卫生保健和社区环境中都是有保护作用的(8)。\n这份报告中的调查结果至少受到四个限制。第一，w\n所有作者都已填写并提交了国际医学期刊编辑委员会的表格，以披露潜在的利益冲突。罗宾·特罗特曼(Robin Trotman)报道了默克公司发表的作品之外的个人费用。没有披露其他潜在的利益冲突。\n*密苏里州斯普林菲尔德的一项城市法令于2020年5月6日生效，将候机区的座位限制在正常容量的25%，并建议在没有或无法遵循社交距离时，为员工和客户使用社交距离和面罩。https://www.springfieldmo.gov/5140/Masks-and-Face-Coverings外部图标。\n疾控中心。新冠肺炎的临床问题：问答。佐治亚州亚特兰大：美国卫生与公众服务部，CDC；2020年。https://www.cdc.gov/coronavirus/2019-ncov/hcp/faq.html。\n何旭，刘易喜，吴平，等。新冠肺炎病毒脱落的时间动态和传播性。NAT Med 2020；26：672-5.CrossRef外部图标PubMed外部图标。\nOran DP，Topol EJ.。无症状SARS-CoV-2感染的流行率：叙述性回顾。安实习生医院2020；M20-3012。CrossRef外部图标PubMed外部图标。\nKonda A，Prakash A，Moss GA，Schmoldt M，Grant GD，Guha S。呼吸布口罩常用织物的气溶胶过滤效率。ACS Nano 2020；14：6339-47。CrossRef外部图标PubMed外部图标。\n马金太尔(Macintyre CR)，Seale H，Dung TC等人。在医护人员中对布质口罩和医用口罩进行了一项整群随机试验。BMJ Open 2015；5：e006577。CrossRef外部图标PubMed外部图标。\n刘俊堂，徐宏，刘明，杨晓.SARS在香港的传播、危险因素及预防。“紧急感染疾病”2004；10：587-92。CrossRef外部图标PubMed外部图标\nAiello AE，Perez V，Coulborn RM，Davis BM，Uddin M，Monto As。年轻人中的口罩、手卫生和流感：一项随机干预试验。PLOS One 2012；7：e29744。CrossRef外部图标PubMed外部图标。\n麦金太尔CR，楚台AA。对社区、医护人员和病人使用口罩和口罩对抗冠状病毒和其他呼吸道传播病毒的有效性进行快速、系统的评价。InJ Nur Stud 2020年；第108：103629页。CrossRef外部图标PubMed外部图标", "note_en": "M. Joshua Hendrix, MD 1; Charles Walde, MD 2; Kendra Findley, MS 3; Robin Trotman, DO 4 ( View author affiliations)\n View suggested citation\n Consistent and correct use of cloth face coverings is recommended to reduce the spread of SARS-CoV-2.\n  Among 139 clients exposed to two symptomatic hair stylists with confirmed COVID-19 while both the stylists and the clients wore face masks, no symptomatic secondary cases were reported; among 67 clients tested for SARS-CoV-2, all test results were negative. Adherence to the community’s and company’s face-covering policy likely mitigated spread of SARS-CoV-2.\n  As stay-at-home orders are lifted, professional and social interactions in the community will present more opportunities for spread of SARS-CoV-2. Broader implementation of face covering policies could mitigate the spread of infection in the general population.\n      On May 12, 2020 (day 0), a hair stylist at salon A in Springfield, Missouri (stylist A), developed respiratory symptoms and continued working with clients until day 8, when the stylist received a positive test result for SARS-CoV-2, the virus that causes coronavirus disease 2019 (COVID-19). A second hair stylist (stylist B), who had been exposed to stylist A, developed respiratory symptoms on May 15, 2020 (day 3), and worked with clients at salon A until day 8 before seeking testing for SARS-CoV-2, which returned a positive result on day 10. A total of 139 clients were directly serviced by stylists A and B from the time they developed symptoms until they took leave from work. Stylists A and B and the 139 clients followed the City of Springfield ordinance* and salon A policy recommending the use of face coverings (i.e., surgical masks, N95 respirators, † or cloth face coverings) for both stylists and clients during their interactions. Other stylists at salon A who worked closely with stylists A and B were identified, quarantined, and monitored daily for 14 days after their last exposure to stylists A or B. None of these stylists reported COVID-19 symptoms. After stylist B received a positive test result on day 10, salon A closed for 3 days to disinfect frequently touched and contaminated areas. After public health contact tracings and 2 weeks of follow-up, no COVID-19 symptoms were identified among the 139 exposed clients or their secondary contacts. The citywide ordinance and company policy might have played a role in preventing spread of SARS-CoV-2 during these exposures. These findings support the role of source control in preventing transmission and can inform the development of public health policy during the COVID-19 pandemic. As stay-at-home orders are lifted, professional and social interactions in the community will present more opportunities for spread of SARS-CoV-2. Broader implementation of masking policies could mitigate the spread of infection in the general population.\n Stylist A worked from day 0 to day 8 with COVID-19 symptoms before receiving a diagnosis of COVID-19 by polymerase chain reaction (PCR) testing. Although self-isolation was recommended after testing on day 6, stylist A continued to work until the test returned a positive result, at which time stylist A was excluded from work by salon A. On day 3, after working with stylist A, stylist B developed respiratory symptoms. During Stylist A’s symptomatic period, the two stylists interacted while neither was masked during intervals between clients. Stylist B worked from day 3 to day 8 while symptomatic before self-isolating and seeking PCR testing, which returned a positive result for SARS-CoV-2 on day 10. Stylist A worked with clients for 8 days while symptomatic, as did stylist B for 5 days. During all interactions with clients at salon A, stylist A wore a double-layered cotton face covering, and stylist B wore a double-layered cotton face covering or a surgical mask.\n The Greene County Health Department (Missouri) conducted contact tracing for all 139 exposed clients back to the dates that stylists A and B first developed symptoms. The 139 clients were monitored after their last exposure at salon A. Clients were asked to self-quarantine for 14 days and were called or sent daily text messages to inquire about any symptoms; none reported signs or symptoms of COVID-19. Testing was offered to all clients 5 days after exposure, or as soon as possible for those exposed &gt;5 days before contact tracing began. Overall, 67 (48.2%) clients volunteered to be tested, and 72 (51.8%) refused; all 67 nasopharyngeal swab specimens tested negative for SARS-CoV-2 by PCR. Telephone interviews were attempted 1 month after initial contact tracings to collect supplementary information. Among the 139 exposed clients, the Greene County Health Department interviewed 104 (74.8%) persons.\n Among the 139 clients, the mean age was 52 years (range = 21–93 years); 79 clients (56.8%) were male (  Table 1). Salon appointments ranged from 15 to 45 minutes in length (median = 15 minutes; mean = 19.5 minutes). Among the 104 interviewed clients, 102 (98.1%) reported wearing face coverings for their entire appointment, and two (1.9%) reported wearing face coverings part of the time (  Table 2). Types of face covering used by clients varied; 49 (47.1%) wore cloth face coverings, 48 (46.1%) wore surgical masks, five (4.8%) wore N95 respirators, and two (1.9%) did not know what kind of face covering they wore. Overall, 101 (97.1%) interviewed clients reported that their stylist wore a face covering for the entire appointment; three did not know. When asked about the type of face coverings worn by the stylists, 64 (61.5%) reported that their stylist wore a cloth face covering (39; 37.5%) or surgical mask (25; 24.0%); 40 (38.5%) clients did not know or remember the type of face covering worn by stylists. When asked whether they had experienced respiratory symptoms in the 90 days preceding their appointment, 87 (83.7%) clients reported that they had not. Of those who did report previous symptoms, none reported testing for or diagnosis of COVID-19.\n Six close contacts of stylists A and B outside of salon A were identified: four of stylist A and two of stylist B. All four of stylist A’s contacts later developed symptoms and had positive PCR test results for SARS-CoV-2. These contacts were stylist A’s cohabitating husband and her daughter, son-in-law, and their roommate, all of whom lived together in another household. None of stylist B’s contacts became symptomatic.\n  SARS-CoV-2 is spread mainly between persons in close proximity to one another (i.e., within 6 feet), and the more closely a person interacts with an infected person and the longer the interaction, the higher the risk for transmission ( 1). At salon A in Springfield, Missouri, two stylists with COVID-19 symptoms worked closely with 139 clients before receiving diagnoses of COVID-19, and none of their clients developed COVID-19 symptoms. Both stylists A and B, and 98% of the interviewed clients followed posted company policy and the Springfield city ordinance requiring face coverings by employees and clients in businesses providing personal care services. The citywide ordinance reduced maximum building waiting area seating to 25% of normal capacity and recommended the use of face coverings at indoor and outdoor public places where physical distancing was not possible. Both company and city policies were likely important factors in preventing the spread of SARS-CoV-2 during these interactions between clients and stylists. These results support the use of face coverings in places open to the public, especially when social distancing is not possible, to reduce spread of SARS-CoV-2.\n Although SARS-CoV-2 is spread largely through respiratory droplets when an ill person coughs or sneezes ( 1), data suggest that viral shedding starts during the 2-to-3-day period before symptom onset, when viral loads are at their highest ( 2). Although the rate of transmission of SARS-CoV-2 from presymptomatic patients (those who have not yet developed symptoms) and asymptomatic persons (those who do not develop symptoms) is unclear, these persons likely contribute to the spread of SARS-CoV-2 ( 3). With the potential for presymptomatic and asymptomatic transmission, widespread adoption of policies requiring face coverings in public settings should be considered to reduce the impact and magnitude of additional waves of COVID-19.\n Previous studies show that both surgical masks and homemade cloth face coverings can reduce the aerosolization of virus into the air and onto surfaces ( 4, 5). Although no studies have examined SARS-CoV-2 transmission directly, data from previous epidemics ( 6, 7) support the use of universal face coverings as a policy to reduce the spread of SARS-CoV-2, as does observational data for COVID-19 in an analysis of 194 countries that found a negative association between duration of a face mask or respirator policy and per-capita coronavirus-related mortality; in countries that did not recommend face masks and respirators, the per-capita coronavirus-related mortality increased each week by 54.3% after the index case, compared with 8.0% in those countries with masking policies (CT Leffler, Virginia Commonwealth University, unpublished data, 2020). § Similar outcomes have been observed for other respiratory virus outbreaks, including the 2002–04 outbreak of Severe Acute Respiratory Syndrome (SARS) ( 6) and the 2007–08 influenza season ( 7). A systematic review on the efficacy of face coverings against respiratory viruses analyzed 19 randomized trials and concluded that use of face masks and respirators appeared to be protective in both health care and community settings ( 8).\n The findings in this report are subject to at least four limitations. First, whereas the health department monitored all exposed clients for signs and symptoms of COVID-19, and no clients developed symptoms, only a subset was tested; thus, asymptomatic clients could have been missed. Similarly, with a viral incubation period of 2–14 days, any COVID-19 PCR tests obtained from clients too early in their course of infection could return false-negative results. To help mitigate this possibility, all exposed clients were offered testing on day 5 and were contacted daily to monitor for symptoms until day 14. Second, although the health department obtained supplementary data, no information was collected regarding underlying medical conditions or use of other personal protective measures, such as gloves and hand hygiene, which could have influenced risk for infection. Third, viral shedding is at its highest during the 2 to 3 days before symptom onset; any clients who interacted with the stylists before they became symptomatic were not recruited for contact tracing. Finally, the mode of interaction between stylist and client might have limited the potential for exposure to the virus. Services at salon A were limited to haircuts, facial hair trimmings, and perms. Most stylists cut hair while clients are facing away from them, which might have also limited transmission.\n The results of this study can be used to inform public health policy during the COVID-19 pandemic. A policy mandating the use of face coverings was likely a contributing factor in preventing transmission of SARS-CoV-2 during the close-contact interactions between stylists and clients in salon A. Consistent and correct use of face coverings, when appropriate, is an important tool for minimizing spread of SARS-CoV-2 from presymptomatic, asymptomatic, and symptomatic persons. CDC recommends workplace policies regarding use of face coverings for employees and clients in addition to daily monitoring of signs and symptoms of employees, procedures for screening employees who arrive with or develop symptoms at work, and posted messages to inform and educate employees and clients ( https://www.cdc.gov/coronavirus/2019-ncov/community/organizations/businesses-employers.html).\n       1Washington University School of Medicine, St. Louis, Missouri;  2University of Kansas Medical Center, Kansas City, Missouri;  3Springfield-Greene County Health Department, Springfield, Missouri;  4CoxHealth Infection Prevention Services, Springfield, Missouri.\n  All authors have completed and submitted the International Committee of Medical Journal Editors form for disclosure of potential conflicts of interest. Robin Trotman reports personal fees from Merck outside the published work. No other potential conflicts of interest were disclosed.\n   * Springfield, Missouri, city ordinance went into effect May 6, 2020, restricted seating in waiting areas to 25% of normal capacity and recommended social distancing and use of face coverings for employees and clients when social distancing was not or could not be followed.  https://www.springfieldmo.gov/5140/Masks-and-Face-Coverings external icon .\n  CDC. Clinical questions about COVID-19: questions and answers. Atlanta, GA: US Department of Health and Human Services, CDC; 2020.  https://www.cdc.gov/coronavirus/2019-ncov/hcp/faq.html\n He X, Lau EHY, Wu P, et al. Temporal dynamics in viral shedding and transmissibility of COVID-19. Nat Med 2020;26:672–5.  CrossRef external icon   PubMed external icon\n Oran DP, Topol EJ. Prevalence of asymptomatic SARS-CoV-2 infection: a narrative review. Ann Intern Med 2020;M20–3012.  CrossRef external icon   PubMed external icon\n Konda A, Prakash A, Moss GA, Schmoldt M, Grant GD, Guha S. Aerosol filtration efficiency of common fabrics used in respiratory cloth masks. ACS Nano 2020;14:6339–47.  CrossRef external icon   PubMed external icon\n MacIntyre CR, Seale H, Dung TC, et al. A cluster randomised trial of cloth masks compared with medical masks in healthcare workers. BMJ Open 2015;5:e006577.  CrossRef external icon   PubMed external icon\n Lau JT, Tsui H, Lau M, Yang X. SARS transmission, risk factors, and prevention in Hong Kong. Emerg Infect Dis 2004;10:587–92.  CrossRef external icon   PubMed external icon\n Aiello AE, Perez V, Coulborn RM, Davis BM, Uddin M, Monto AS. Facemasks, hand hygiene, and influenza among young adults: a randomized intervention trial. PLoS One 2012;7:e29744.  CrossRef external icon   PubMed external icon\n MacIntyre CR, Chughtai AA. A rapid systematic review of the efficacy of face masks and respirators against coronaviruses and other respiratory transmissible viruses for the community, healthcare workers and sick patients. Int J Nurs Stud 2020;108:103629.  CrossRef external icon   PubMed external icon", "posttime": "2020-07-15 21:06:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "肺炎,infected,传播", "title": "两名受感染的造型师没有将新冠肺炎传染给百名客户-所有人都戴着口罩", "title_en": "No COVID-19 transmission from 2 infected stylists to 100 clients- all wore masks", "transed": 1, "url": "https://www.cdc.gov/mmwr/volumes/69/wr/mm6928e2.htm?s_cid=mm6928e2_w", "via": "", "real_tags": ["肺炎", "infected", "传播"]}, {"category": "", "categoryclass": "", "imagename": "4e5f9ec18465dde3b54437f443197288.jpg", "infoid": 1012007, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果在欧盟第二高法院赢得上诉后被告知，它将不必向爱尔兰补缴130亿欧元(116亿英镑)的税款。\n它推翻了2016年的一项裁决，该裁决发现这家科技巨头获得了都柏林的非法税收减免。\n欧盟总法院(General Court)表示，由于没有足够的证据表明苹果违反了欧盟的竞争规则，它已经宣布这一决定无效。\n然而，它有14天的时间向欧洲最高法院-欧洲法院(European Court Of Justice)上诉。\n苹果在一份声明中表示，这起案件不是关于我们交了多少税，而是我们被要求在哪里纳税。我们很自豪能成为世界上最大的纳税人，因为我们知道纳税在社会中扮演的重要角色。\n爱尔兰政府也对这一裁决提出上诉，称其一直明确表示，苹果没有受到任何特殊待遇。\n征收了正确数额的爱尔兰税……。符合爱尔兰正常的税收规则。\n提起此案的欧盟竞争事务专员玛格丽特·维斯特格(Margrethe Vestager)表示，她将研究这一判决，并反思下一步可能采取的行动。\n我怀疑很多爱尔兰人认为……。为什么会有一家公司交0.05%的税？就这一点而言，我比苹果交的税还多。很多人交的税更多。\n欧盟委员会(European Commission)提起这一诉讼之前，声称爱尔兰允许苹果将其在欧盟的几乎所有收入都归因于一家仅存在于纸面上的爱尔兰总部，从而避免了为欧盟收入缴税。\n但爱尔兰政府辩称，苹果不应该偿还补缴的税款，认为为了让该国成为大公司的吸引力之地，它的损失是值得的。\n爱尔兰是欧盟公司税率最低的国家之一，也是苹果在欧洲、中东和非洲的基地。\n在周三的裁决中，总部位于卢森堡的总法院站在了这一立场上，称没有足够的证据表明苹果接受了非法的国家援助或将其税单降至最低。\n这起案件的一个相当奇怪的特点是，如果裁决是相反的，而爱尔兰是败诉的一方，那么它因违反欧盟法律而受到的惩罚将是获得一大笔钱；欧盟委员会表示，这些税款是苹果公司(Apple)欠下的。\n但事实并非如此，因此这项裁决--可以上诉--意味着苹果在法律上不欠这笔钱，所以爱尔兰得不到这笔钱。\n在爱尔兰的一些地区，有助于鼓励苹果投资的协议在事件发生后没有被推翻，这让人松了一口气。\n但这种情绪远不是普遍的。新芬党的一位发言人称，对于爱尔兰纳税人来说，这是糟糕的一天，这将引起人们对该国国际税收声誉的负面关注。\n欧盟各地对所谓的甜蜜税收协议的批评越来越多，欧盟一直在努力打击。\n因此，这项裁决将对维斯塔格女士是一个打击，她已经将目标对准了一大批被指控的反竞争行为的大公司。\n去年，她在与星巴克的官司中败诉，星巴克被指控欠荷兰3000万欧元的税款。宜家(Ikea)和耐克(Nike)在该国的税收安排很快就会做出裁决。\n品诚梅森律师事务所(Pinsend Masons)合伙人兼税务主管杰森·柯林斯(Jason Collins)表示：苹果的胜诉表明，欧洲法院不愿称有利的税收制度为国家援助，即使这些制度旨在吸引外国投资--前提是它们始终如一地执行规则。\n对于其他一直密切关注此案的多国公民来说，这将是一个非常受欢迎的结果。\n不过，他表示，布鲁塞尔可能会上诉，欧盟解决避税问题的努力将继续下去。", "note_en": "Apple has been told it will not have to pay Ireland €13bn (£11.6bn) in back taxes after winning an appeal at the European Union&#39;s second highest court.\n It overturns a 2016 ruling which found the tech giant had been given illegal tax breaks by Dublin.\n The EU&#39;s General Court said it had annulled that decision because there was not enough evidence to show Apple broke EU competition rules.\n  However, it has 14 days to appeal the decision at Europe&#39;s top court, the European court of Justice.\n   &#34;This case was not about how much tax we pay, but where we are required to pay it,&#34; Apple said in a statement. &#34;We&#39;re proud to be the largest taxpayer in the world as we know the important role tax payments play in society.&#34;\n The Irish government - which had also appealed against the ruling - said it had &#34;always been clear&#34; Apple received no special treatment.\n &#34;The correct amount of Irish tax was charged... in line with normal Irish taxation rules.&#34;\n EU Competition Commissioner Margrethe Vestager, who brought the case, said she would &#34;study the judgment and reflect on possible next steps&#34;.\n  &#34;I suspect that many people in Ireland think... &#39;why is there a company that pays 0.05% in taxes?&#39; I pay more taxes than Apple, for that matter. Many people pay more taxes.&#34;\n   The European Commission brought the action after claiming Ireland had allowed Apple to attribute nearly all its EU earnings to an Irish head office that existed only on paper, thereby avoiding paying tax on EU revenues.\n   But the Irish government argued that Apple should not have to repay the back taxes, deeming that its loss was worth it to make the country an attractive home for large companies.\n Ireland - which has one of the lowest corporate tax rates in the EU - is Apple&#39;s base for Europe, the Middle East and Africa.\n In Wednesday&#39;s ruling, the Luxembourg-based General Court sided with that position, saying there was not enough evidence to show Apple had received illegal state aid or minimised its tax bill.\n    One rather curious feature of this case is that if the ruling had gone the other way, and Ireland had been on the losing side, its &#34;punishment&#34; for breaching EU law would have been to receive a large amount of money; taxes the Commission said were owed by Apple.\n That did not happen so the ruling - subject to any appeal - means Apple doesn&#39;t in law owe the money so Ireland won&#39;t get it.\n In some quarters of Ireland there will be relief that an agreement that helped encourage Apple to invest has not been overturned after the event.\n But the sentiment is far from universal. A Sinn Féin spokesman called it a bad day for the Irish taxpayer that would draw negative attention to the country&#39;s international tax reputation.\n   There is growing criticism of so called sweetheart tax deals across the European Union and the bloc has been trying to clamp down.\n The ruling will therefore be a blow to Ms Vestager, who has taken aim a host of big corporations over their allegedly anti-competitive practices.\n  Last year she lost a case against Starbucks, which was accused of owing €30m in back taxes to the Netherlands. Rulings on Ikea and Nike&#39;s tax arrangements in that country are due soon.\n Jason Collins, partner and head of tax at law firm Pinsent Masons, said: &#34;Apple&#39;s victory shows that European courts are unwilling to call beneficial tax regimes state aid, even when designed to attract foreign investment - provided they apply the rules consistently.\n &#34;This will be a very welcome outcome for other multi-nationals who have been watching this case closely.&#34;\n However, he said Brussels was likely to appeal and EU efforts to tackle tax avoidance would continue.", "posttime": "2020-07-15 21:04:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,苹果,爱尔兰,irish", "title": "苹果公司推翻了130亿欧元的爱尔兰税单", "title_en": "Apple has €13bn Irish tax bill overturned", "transed": 1, "url": "https://www.bbc.co.uk/news/business-53416206", "via": "", "real_tags": ["apple", "苹果", "爱尔兰", "irish"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012006, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这篇文章中，我将探索AWS中提供的简单工作流服务(SWF)。\n要了解SWF的好处，我们首先需要了解什么是工作流。维基百科对此的定义如下：\n工作流程由编排的、可重复的活动模式组成，通过将资源系统地组织成流程来转换物料、提供服务或流程信息。它可以被描述为一系列操作、个人或团体的工作、工作人员组织的工作或一个或多个简单或复杂的机制。\n在计算机系统中，我们关心的是处理信息的部分。可以将一些内容建模为工作流：\n部署管道：我们可以接收一些代码作为输入，然后在工作者机器上构建它。我们可以在不同的机器上并行运行测试。如果所有测试都通过，我们可以将二进制文件部署到另一组机器上。\n协调发货：用户在网上商店购买产品，然后在系统上下单。人工监控该系统，并负责在仓库中查找产品并将其运送到正确的地址。当发货时，信息被输入到系统中。工作流程会注意到此信息，并通过电子邮件向用户发送送货详细信息。\n异步图像处理：系统将文件上传到系统进行处理(比方说，创建缩略图)。工作流使用多个工作器来执行任务。如果任何一台机器在处理一组文件时出现故障，它们可以由另一名工人接管相同的工作。\n这些都是一些高级的例子。在这篇文章中，我将更详细地复习一个例子。\n在开始构建工作流之前，让我们先了解一下SWF的组件：\n工作流：一组活动，以及定义这些活动如何协同工作以实现某些目标的一些逻辑。\n域：工作流位于域中。一个域可以包含多个工作流。不同域中的工作流无法交互。\n活动：需要执行的任务类型，例如：调整图像大小、运行测试等。\n为了帮助我们熟悉SWF，我们将创建一个工作流来对修复机群中的故障机器的流程进行建模。它将如下所示：\n此工作流可用于运行多台机器的数据中心。我们可以使用工作流探测机来查看它们是否工作正常。如果它发现了错误，它会在数据库中将机器状态设置为Maintenance。如果它没有发现任何错误，它将完成执行。\n一旦机器耗尽，我们将做两件事。我们会派人来检查一下机器并修理它，然后我们会趁机重塑机器的形象，这样当机器回来时，我们就有了干净的机器。\n一旦修复和重映像完成，我们就可以将状态设置回Available并完成执行。\n对于我们的活动和决策者，我们将需要AWS SDK。在这一节中，我将展示如何将其准备好。\n我们将在我们的示例中使用Ruby，因为它很容易运行，并且得到了很好的支持。撰写本文时，Ruby SDK的最新版本是版本3。我们将创建一个带有依赖项的Gemfile：\nAWS SDK将需要与AWS通信，因此我们需要一些凭据，这些凭据可以在如下环境变量中设置：\n上图中的每个框都是一项活动。活动可以非常独立，所以我们将开始构建它们。\n活动通过轮询挂起任务的工作流来工作。如果它发现有可以执行的任务，它就会这样做，并返回结果。然后继续轮询，直到有更多的工作要做。\n我们的活动将与Decider共享一些代码，因此让我们创建一个将在它们之间共享的基类(Workflow_base.rb)：\n要求&#39；AWS-SDK-SWF&#39；class WorkflowBase domain_name=&#39；datacenter-domain&#39；region=&#39；ap-东南-2&#39；task_list_name=&#39；Repair-Workflow-task-list&#39；version=&#39；14&#39；def initialize@SWF=Aws：：swf：：client。new(REGION：REGION)REGISTER_DOMAIN(REGION，DOMAIN_NAME)end#为我们的工作流注册一个域(如果它不存在)def REGISTER_DOMAIN(REGION，DOMAIN_NAME)swf=Aws：：swf：：client。新建(Region：Region)开始SWF。register_domain({name：domain_name，Workflow_Execution_Retention_Period_in_Days：&#39；3&#39；})放置&#34；域#{domain_name}注册&#34；救援Aws：：SWF：：Errors：：DomainAlreadyExistsFaultPut&#34；Domain#{domain_name}已存在&#34；end。\n这个类定义了一些在决策器和活动之间共享的常量。它还初始化SWF客户端并注册域(如果域尚不存在)。\n由于SWF的工作方式，我们所有活动的代码最好由单个程序处理。此程序将轮询该域中的任何新任务。每次看到任务时，它都会执行该任务，并将结果发送回SWF。因为每个任务都是阻塞的，所以我们可以旋转此程序的多个副本，以便在需要时并行执行任务。\nRequired&#39；AWS-SDK-SWF&#39；Required_Relative&39；Workflow_base.rb&#39；课堂活动&lt；Workflow Base活动=[&#39；Probe_Machines&#39；，&#39；DRAIN_MACHINE&#39；，&#39；FIX_MACHINE&#39；，&#39；REIMAGE_MACHINE&#39；，&#39；ENABLE_MACHINE&#39；]def initialize SUPERFIZE SUPER()REGISTER_ACTIVATIONS轮询结束#用域def register_Activity()活动注册活动。每个do|Activity|Begin@swf。REGISTER_ACTIVITY_TYPE({DOMAIN：DOMAIN_NAME，NAME：ACTIVATION，VERSION：VERSION，#处理活动DEFAULT_TASK_START_TO_CLOSE_TIMEOUT：&#39；60&#39；})放置&#34；活动#{活动}注册&#34；救援Aws：：SWF：：Errors：：TypeAlreadyExistsFaults放置&#34；活动#{Activity}已存在&#34；end#在true options={domain：domain_name，task_list：{name：task_list_name}}task=@swf时轮询域以查找此活动的任务def poll。如果是任务，则为Poll_for_Activity_Task(选项)。TASK_TOKEN==对于过期的活动，无PUT&#39；轮询过期。重试&#39；下一个End If！活动。包括？(任务。activeid)提出&#34；活动#{任务.。active_id}未知&#34；end#如果EXECUTE成功，将返回结果，否则ti将#抛出PUT&#34；执行#{TASK。Activity_id}&#34；Begin#调用Activity Result=Send(TASK.。active_id、任务、任务。输入)投入&#34；完成#{任务。active_id}&#34；@swf。Response_Activity_Task_Complete({TASK_TOKEN：TASK。TASK_TOKEN，#SWF不提供知道此结果#属于哪个活动的方法，因此我们将在结果前面加上它的结果：&#34；#{task。active_id}：#{result}&#34；})救援=&gt；e放置&#34；失败#{task。active_id}&#34；@swf。Response_Activity_TASK_FAILED({TASK_TOKEN：TASK。TASK_TOKEN，原因：@FAILURE})end def探测_MACHINES(TASK，INPUT)#因为这只是一个示例，我实际上没有要测试的计算机，#i&39；我将使用一些模拟数据MACHINES=[&#39；MACHINE-A459Z&#39；，&#39；MACHINE-M3992&#39；，&#39；MACHINE-A873R&39；]计算机。如果CHECK_MACHINE(MACHINE)==&#39；FAIL&#39；#则将其设置为Maintenance。在实际情况中，我们会使用新状态更新数据库。将MACHINE#{MACHINE}设置为Maintenance&#34；RETURN MACHINE END END PUT&#34；RETURN MACHINE END PUTS&#39；未发现损坏的计算机&#39；RETURN&#39；&#39；END#随机决定是否耗尽。在真实情况下，我们将与#the机器通信，或检查数据库def drain_Machine(task，input)put&#34；DRANDER MACHINE#{INPUT}&#34；RANDOM_NUMBER=RAND(5)如果RANDOM_NUMBER==4 PUT&#39；Machine is defined&#39；return end raise&#34；#{input}没有排出&#34；end#在现实生活中，我们会检查人类是否已将任务标记为已修复。在这个#案例中，我们将只休眠并使用随机数def fix_Machine(task，input)put&#34；检查机器#{input}是否固定&#34；sleep(1)Random_number=rand(2)如果Random_number==1放置&#34；机器#{input}已经固定&#34；return end raise&#34；#{input}尚未固定&#34；end#在现实生活中，我们会在这里使用类似chef的东西来重新镜像机器#我们将只睡眠并使用随机数def reimage_Machine(task，input)put&#34；reimage#{input}&#34；sleep(1)Random_number=rand(2)如果Random_number==1放置&#34；机器已经重新镜像&#34；return end raise&#34；#{input}reimage仍在进行&#34；end#假设我们重新启用了机器def enable_machine(task，input)put&#34；将#{input}标记为可用&#34；end#如果Random_number==4 return&#39；FAIL&#39；end return&#39；SUCCESS&#39；END END ACTIONS，则返回机器def CHECK_MACHINE(MACHINE)RANDOM_NUMBER=RAND(5)的随机状态。新的。\n上述代码中最重要的部分是轮询循环。POLL_FOR_ACTIVATION_TASK方法将启动与SWF的连接，并将返回要执行的活动(如果有活动可用)。如果在60秒内没有要执行的活动，它将返回一个空的TASK_TOKEN。如果发生这种情况，我们只需再次继续投票即可。\n处理每个活动的代码只是伪代码，用来假装我们正在做一些工作。\n决定者是整个过程中最复杂的部分。\nRequired_Relative&#39；Workflow_base.rb&#39；class ExecutionStarter&lt；WorkflowBase Workflow_Name=&#39；Repair-Workflow&#39；def Initialize Super@SWF。START_WORKFORK_EXECUTION({域：域名，工作流ID：SecureRandom。uuid，工作流类型：{Name：Workflow_Name，Version：Version}，TASK_LIST：{Name：TASK_LIST_NAME}，EXECUTION_START_TO_CLOSE_TIMEOUT：&#39；36000&#39；，CHILD_POLICY：&#39；TERMINATE&#39；})结束执行启动程序。新的。\n现在我们已经准备好了，我们需要打开一个终端窗口，其中包含以下活动：\n使用SWF比我预想的要复杂得多。必须对所有事件进行解析才能确定下一个活动，这似乎很容易出错，并且使代码变得混乱。文档也不是很清楚应该如何做到这一点，所以希望这个例子能帮助感兴趣的人。\n[架构·自动化·AWS·生产力指数]", "note_en": "In this post I’m going to explore Simple Workflow Service (SWF) available in AWS.\n To understand what SWF is good for, we need to first understand what a workflow is.  Wikipedia defines it as follows:\n A workflow consists of an orchestrated and repeatable pattern of activity, enabled by the systematic organization of resources into processes that transform materials, provide services, or process information. It can be depicted as a sequence of operations, the work of a person or group, the work of an organization of staff, or one or more simple or complex mechanisms.\n In computer systems we care about the part about processing information. Some things that could be modeled as workflows:\n Deployment pipeline: We could receive some code as input and then build it in a worker machine. We can run tests in parallel in different machines. If all tests pass we can deploy the binaries to another set of machines.\n  Coordinate shipments: A user buys a product on an online store and the order is placed on a system. A human monitors this system and takes care of finding the products in a warehouse and shipping them to the correct address. When the shipment is made, the information is entered in a system. The workflow notices this information an e-mails the user the shipping details.\n  Asynchronous image processing: A system uploads files to a system for processing (let’s say, create thumbnails). A workflow uses multiple workers to execute the task. If any of the machines fails while processing a set of files, they same work can be taken over by another worker.\n Those are some high level examples. In this post I’m going to go over one example in more detail.\n  Before we start building a workflow, let’s learn a little about the components of an SWF:\n Workflow: A set of activities, and some logic that defines how these work together to achieve some objective\n  Domain: A workflow lives in a domain. A Domain can contain multiple workflows. Workflows in different domains can’t interact\n        Activity: A type of task that needs to be performed, such as: resizing images, running tests, etc\n  To help us get familiar with SWF, we are going to create a workflow to model the process for fixing a broken machine in a fleet. It will look something like this:\n  This workflow can be used in a datacenter that runs a lot of machines. We can have the workflow probe machines to see if they are working well. If it notices something wrong, it sets the machine state as  maintenance in a database. If it doesn’t find anything wrong, it finishes the execution.\n Once a machine is drained we’ll do two things. We’ll have a person take a look at the machine and fix it and we’ll take the oportunity to reimage the machine so we have clean machine when it comes back.\n Once the repair and the reimage are done, we can set the state back to  available and finish the execution.\n  For our activities and the decider, we are going to need the AWS SDK. In this section I’m going to show how to get it ready.\n We’ll use Ruby for our examples, since it’s easy to run and it’s very well supported. The latest version of the Ruby SDK at the time of this writing is version 3. We’ll create a  Gemfile with dependencies:\n    The AWS SDK will need to communicate with AWS, so we’ll need some credentials, these credentials can be set in environment variables like this:\n   Each of the boxes in the diagram above is an  activity. Activities can be pretty self contained, so we’ll start building those.\n An activity works by polling the workflow for pending tasks. If it finds that there is a task it can perform, it does so, and returns a result back. Polling then continues until there is more work to do.\n Our activities will share some code with the decider, so let’s create a base class that will be shared between them ( workflow_base.rb):\n require  &#39;aws-sdk-swf&#39; class  WorkflowBase  DOMAIN_NAME  =  &#39;datacenter-domain&#39;  REGION  =  &#39;ap-southeast-2&#39;  TASK_LIST_NAME  =  &#39;repairs-workflow-task-list&#39;  VERSION  =  &#39;14&#39;  def  initialize  @swf  =  Aws :: SWF :: Client . new ( region:  REGION )  register_domain ( REGION ,  DOMAIN_NAME )  end  # Register a domain for our workflow (if it doesn&#39;t already exist)  def  register_domain ( region ,  domain_name )  swf  =  Aws :: SWF :: Client . new ( region:  region )  begin  swf . register_domain ({  name:  domain_name ,  workflow_execution_retention_period_in_days:  &#39;3&#39;  })  puts  &#34;Domain  #{ domain_name }  registered&#34;  rescue  Aws :: SWF :: Errors :: DomainAlreadyExistsFault  puts  &#34;Domain  #{ domain_name }  already exists&#34;  end  end end\n This class defines some constants that are shared between the decider and activities. It also initializes the SWF client and register the domain if it doesn’t yet exist.\n Because of the way SWF works, it is best if the code for all our activities is handled by a single program. This program will poll for any new tasks in the domain. Every time it sees a task it will execute it and send the result back to SWF. Because each task is blocking, we could spin many copies of this program to allow tasks to be executed in parallel if we wanted to.\n  require  &#39;aws-sdk-swf&#39; require_relative  &#39;workflow_base.rb&#39; class  Activities  &lt;  WorkflowBase  ACTIVITIES  =  [  &#39;probe_machines&#39; ,  &#39;drain_machine&#39; ,  &#39;fix_machine&#39; ,  &#39;reimage_machine&#39; ,  &#39;enable_machine&#39;  ]  def  initialize  super ()  register_activities  poll  end  # Register the activities with the domain  def  register_activities ()  ACTIVITIES . each  do  | activity |  begin  @swf . register_activity_type ({  domain:  DOMAIN_NAME ,  name:  activity ,  version:  VERSION ,  # Maximum time it can take to process an activity  default_task_start_to_close_timeout:  &#39;60&#39;  })  puts  &#34;Activity  #{ activity }  registered&#34;  rescue  Aws :: SWF :: Errors :: TypeAlreadyExistsFault  puts  &#34;Activity  #{ activity }  already exists&#34;  end  end  end  # Poll the domain for tasks for this activity  def  poll  while  true  options  =  {  domain:  DOMAIN_NAME ,  task_list:  {  name:  TASK_LIST_NAME  }  }  task  =  @swf . poll_for_activity_task ( options )  if  task . task_token  ==  nil  puts  &#39;Polling expired for activities expired. Trying again&#39;  next  end  if  ! ACTIVITIES . include? ( task . activity_id )  raise  &#34;Activity  #{ task . activity_id }  unknown&#34;  end  # If execute is successfull, it will return the result, otherwise ti will  # throw  puts  &#34;Executing  #{ task . activity_id } &#34;  begin  # Call the method for the activity  result  =  send ( task . activity_id ,  task ,  task . input )  puts  &#34;Completing  #{ task . activity_id } &#34;  @swf . respond_activity_task_completed ({  task_token:  task . task_token ,  # SWF doesn&#39;t provide a way to know which activity this result  # belongs to, so we&#39;ll prepend the result with it  result:  &#34; #{ task . activity_id } : #{ result } &#34;  })  rescue  =&gt;  e  puts  e  puts  &#34;Failing  #{ task . activity_id } &#34;  @swf . respond_activity_task_failed ({  task_token:  task . task_token ,  reason:  @failure  })  end  end  end  def  probe_machines ( task ,  input )  # Because this is just an example and I don&#39;t actually have machines to test,  # I&#39;m going to use some mock data  machines  =  [  &#39;machine-A459Z&#39; ,  &#39;machine-M3992&#39; ,  &#39;machine-A873R&#39;  ]  machines . each  do  |  machine  |  # A machine is bad, set it to maintenance  if  check_machine ( machine )  ==  &#39;FAIL&#39;  # In a real scenario we would update the database with the new state  puts  &#34;Set machine  #{ machine }  to maintenance&#34;  return  machine  end  end  puts  &#39;No bad machines found&#39;  return  &#39;&#39;  end  # Randomly decide if it&#39;s drained. In a real scenario we would communicate with  # the machine, or check a database  def  drain_machine ( task ,  input )  puts  &#34;Draining machine  #{ input } &#34;  random_number  =  rand ( 5 )  if  random_number  ==  4  puts  &#39;Machine is drained&#39;  return  end  raise  &#34; #{ input }  is not drained&#34;  end  # In real life we would check if a human has marked the task as fixed. In this  # case, we&#39;ll just sleep and use a random number  def  fix_machine ( task ,  input )  puts  &#34;Check if machine  #{ input }  is fixed&#34;  sleep ( 1 )  random_number  =  rand ( 2 )  if  random_number  ==  1  puts  &#34;Machine  #{ input }  has been fixed&#34;  return  end  raise  &#34; #{ input }  is not fixed yet&#34;  end  # In real life we would use something like chef to re-image the machine here  # we&#39;ll just sleep and use a random number  def  reimage_machine ( task ,  input )  puts  &#34;Reimaging  #{ input } &#34;  sleep ( 1 )  random_number  =  rand ( 2 )  if  random_number  ==  1  puts  &#34;Machine has been reimaged&#34;  return  end  raise  &#34; #{ input }  reimage still in progress&#34;  end  # Pretend we re-enabled the machine  def  enable_machine ( task ,  input )  puts  &#34;Marking  #{ input }  as available&#34;  end  # Returns a random state for a machine  def  check_machine ( machine )  random_number  =  rand ( 5 )  if  random_number  ==  4  return  &#39;FAIL&#39;  end  return  &#39;SUCCESS&#39;  end end Activities . new\n The most important part of the code above is the polling loop. The  poll_for_activity_task method, will initiate a connection with SWF and will return an activity to execute if there is one available. If there are no activities to execute for 60 seconds, it will return an empty  task_token. If that happens we just continue polling again.\n The code to handle each of the activities is just dummy code to pretend we are doing some work.\n  The decider is the most complex part of the workflow. It takes care of making decisions on what needs to be done next. Because of the way we get data form SWF, making these decisions requires some grunt work over all the available events for the execution.\n  require  &#39;aws-sdk-swf&#39; require_relative  &#39;workflow_base.rb&#39; class  RepairsWorkflow  &lt;  WorkflowBase  WORKFLOW_NAME  =  &#39;repairs-workflow&#39;  def  initialize  super  register_workflow  poll  end  def  register_workflow  begin  @swf . register_workflow_type ({  domain:  DOMAIN_NAME ,  name:  WORKFLOW_NAME ,  version:  VERSION ,  # Maximum time the decider can take to make a decision about this task  default_task_start_to_close_timeout:  &#39;15&#39;  })  puts  &#34;Workflow  #{ WORKFLOW_NAME }  registered&#34;  rescue  Aws :: SWF :: Errors :: TypeAlreadyExistsFault  puts  &#34;Workflow  #{ WORKFLOW_NAME }  already exists&#34;  end  end  def  poll  while  true  options  =  {  domain:  DOMAIN_NAME ,  task_list:  {  name:  TASK_LIST_NAME  }  }  task  =  @swf . poll_for_decision_task ( options )  if  task . task_token  ==  nil  puts  &#34;Polling expired for decision task. Trying again&#34;  next  end  process_events ( task . workflow_execution . workflow_id ,  task . task_token ,  task . events )  end  end  def  process_events ( workflow_id ,  token ,  events )  # events contains all the event history for this workflow execution.  # The lowest indexes [0] contains the oldest events. The first event is  # always WorkflowExecutionStarted.  # `events` can span multiple pages, in which case we would need to make  # extra requests to get the other pages. We are not taking care of that  # scenario in this example  pending  =  0  in_progress  =  0  completed  =  0  results  =  {}  events . each  do  |  event  |  case  event . event_type  # This means at some point an activity was scheduled. It will either fail  # or be grabbed by a worker  when  &#39;ActivityTaskScheduled&#39;  pending  +=  1  # Activity couldn&#39;t be scheduled. This means something is wrong in the  # workflow  when  &#39;ScheduleActivityTaskFailed&#39;  puts  &#34;There was a failure scheduling an activity&#34;  # A worker grabbed the task  when  &#39;ActivityTaskStarted&#39;  pending  -=  1  in_progress  +=  1  # A task finished unsuccessfully  when  &#39;ActivityTaskFailed&#39; ,  &#39;ActivityTaskTimedOut&#39;  in_progress  -=  1  # A task completed successfully  when  &#39;ActivityTaskCompleted&#39;  if  event . activity_task_completed_event_attributes  parts  =  event . activity_task_completed_event_attributes . result . split ( &#39;:&#39; )  results [ parts [ 0 ]]  =  parts [ 1 ]  end  completed  +=  1  in_progress  -=  1  end  end  decide_task ( workflow_id ,  token ,  completed ,  pending ,  in_progress ,  results )  end  # - If there are no `pending`, `in_progress` or `completed` activities, we  # need to schedule &#39;probe_machines&#39;  # - If 1 task has completed and the result includes a machine, we need to  # schedule &#39;drain_machine&#39;. If there is no machine in the result, we can  # finish the workflow  # - If 2 tasks have completed we need to schedule both &#39;fix_machine&#39; and  # &#39;reimage_machine&#39;  # - If 3 tasks have completed, it means that one of our parallel tasks has  # completed, but not the other. If it&#39;s still in progress, or pending we  # don&#39;t need to do anything. If that&#39;s not the case, we need to reschedule  # the missing task  # - If 4 tasks have completed we need to schedule &#39;enable_machine&#39;  # - If 5 tasks have completed we need to can finish the workflow  def  decide_task ( workflow_id ,  token ,  completed ,  pending ,  in_progress ,  results )  puts  &#34;Completed:  #{ completed }  Pending:  #{ pending }  In progress:  #{ in_progress } &#34;  if  completed  ==  0  &amp;&amp;  pending  ==  0  &amp;&amp;  in_progress  ==  0  schedule_tasks ( token ,  [ &#39;probe_machines&#39; ])  return  end  if  completed  ==  1  &amp;&amp;  pending  ==  0  &amp;&amp;  in_progress  ==  0  if  ! results [ &#39;probe_machines&#39; ]  # If there are no results, we can terminate the workflow  end_execution ( workflow_id )  else  schedule_tasks ( token ,  [ &#39;drain_machine&#39; ],  results [ &#39;probe_machines&#39; ])  end  return  end  if  completed  ==  2  &amp;&amp;  pending  ==  0  &amp;&amp;  in_progress  ==  0  schedule_tasks ( token ,  [ &#39;reimage_machine&#39; ,  &#39;fix_machine&#39; ],  results [ &#39;probe_machines&#39; ])  return  end  if  completed  ==  3  &amp;&amp;  pending  ==  0  &amp;&amp;  in_progress  ==  0  # Figure out which one completed and schedule the other one  if  results . has_key? ( &#39;fix_machine&#39; )  schedule_tasks ( token ,  [ &#39;reimage_machine&#39; ],  results [ &#39;probe_machines&#39; ])  else  schedule_tasks ( token ,  [ &#39;fix_machine&#39; ],  results [ &#39;probe_machines&#39; ])  end  return  end  if  completed  ==  4  &amp;&amp;  pending  ==  0  &amp;&amp;  in_progress  ==  0  schedule_tasks ( token ,  [ &#39;enable_machine&#39; ],  results [ &#39;probe_machines&#39; ])  return  end  if  completed  ==  5  end_execution ( workflow_id )  end  end  def  schedule_tasks ( token ,  activities ,  input  =  nil )  puts  &#34;Scheduling  #{ activities . join ( &#39;,&#39; ) } &#34;  decisions  =  []  activities . each  do  | activity |  decisions . push ({  decision_type:  &#39;ScheduleActivityTask&#39; ,  schedule_activity_task_decision_attributes:  {  activity_type:  {  name:  activity ,  version:  VERSION  },  task_list:  {  name:  TASK_LIST_NAME  },  input:  input ,  activity_id:  activity ,  # Time the workflow will wait for this task to be assigned to a worker  schedule_to_start_timeout:  &#39;600&#39; ,  # Time the workflow will wait for this task to complete  schedule_to_close_timeout:  &#39;3600&#39; ,  # Used for heartbeats. This example doesn&#39;t use them, so just setting  # to the same value as schedule_to_close_timeout  heartbeat_timeout:  &#39;3600&#39;  }  })  end  @swf . respond_decision_task_completed ({  task_token:  token ,  decisions:  decisions  })  end  def  end_execution ( id )  puts  &#34;Terminating workflow&#34;  @swf . terminate_workflow_execution ({  domain:  DOMAIN_NAME ,  workflow_id:  id  })  end end RepairsWorkflow . new\n I added comments explaining how we process the events and how we decide which activity needs to be executed next.  process_events Looks through and figures out how many events have been completed and how many are in progress.  decide_task schedules the next task based on the data from  process_events.\n  The last thing we need for our workflow is the something to trigger an execution. We’ll have a little program do this ( execution_starter.rb):\n require_relative  &#39;workflow_base.rb&#39; class  ExecutionStarter  &lt;  WorkflowBase  WORKFLOW_NAME  =  &#39;repairs-workflow&#39;  def  initialize  super  @swf . start_workflow_execution ({  domain:  DOMAIN_NAME ,  workflow_id:  SecureRandom . uuid ,  workflow_type:  {  name:  WORKFLOW_NAME ,  version:  VERSION  },  task_list:  {  name:  TASK_LIST_NAME  },  execution_start_to_close_timeout:  &#39;36000&#39; ,  child_policy:  &#39;TERMINATE&#39;  })  end end ExecutionStarter . new\n  Now that we have the pieces ready, we need to open a terminal window with the activities:\n       Using SWF turned out to be a lot more complicated than I expected. Having to parse all to events to figure out which activity goes next, seems error prone and makes the code confusing. The documentation is also not very clear on how this should be done, so hopefully this example helps people interested.\n  [    architecture     automation     aws     productivity  ]", "posttime": "2020-07-15 20:43:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "swf,simple,活动", "title": "简单工作流服务(SWF)简介", "title_en": "Introduction to Simple Workflow Service (SWF)", "transed": 1, "url": "https://ncona.com/2020/07/introduction-to-aws-simple-workflow-service/", "via": "", "real_tags": ["swf", "simple", "活动"]}, {"category": "", "categoryclass": "", "imagename": "919b0c98f006a7a79e1b9aee6b64ca75.jpg", "infoid": 1012005, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "了解Common Lisp条件系统的功能和示例用法。本书通过提供关于Lisp条件系统及其控制流机制的详细信息，补充了现有的学习Common Lisp语言的材料；它还描述了一个符合ANSI的条件系统的实现示例。在“Common Lisp条件系统”的第1部分中，作者使用自下而上的方法介绍了条件系统，并逐段构建它。他使用一种讲故事的方法来传达条件系统的基础，动态地提供代码来改变现有程序的行为。稍后，在第2部分中，您将实现一个完全符合ANSI的条件系统，同时检查和测试您编写的每段代码。在整个过程中，作者将通过使用条件系统作为示例来演示如何使用Lisp本身来扩展Lisp。这是在适当关注CL重新启动子系统的同时完成的，给予它与处理程序子系统同等的关注。阅读并使用本书后，您将了解条件系统的内部功能，如何在您自己的Common Lisp代码和应用程序中使用它，以及如何从头开始实现它(如果出现这样的需要)。\n实现条件系统的所有部分：条件、重新启动、处理程序和重新启动绑定宏、信令机制、断言、调试器等等。\n这本书是为谁而写的。\nMichał&34；Phoe&34；Herda是一名程序员，他对Common Lisp生态系统的多个部分做出了贡献：CL实现、现有的和广泛使用的CL实用程序、文档，以及他慢慢推动和研究的一些新的库思想。“通用Lisp条件系统”(The Common Lisp Condition System)一书是他的第一部作品--试图创建一个关于缺少的条件系统的教程，甚至在ANSI Common Lisp标准化之后的所有年头也是如此。", "note_en": "Discover the functioning and example uses of the Common Lisp condition system. This book supplements already existing material for studying Common Lisp as a language by providing detailed information about the Lisp condition system and its control flow mechanisms; it also describes an example ANSI-conformant implementation of the condition system.   In part 1 of  The Common Lisp Condition System, the author introduces the condition system using a bottom-up approach, constructing it piece by piece. He uses a storytelling approach to convey the foundation of the condition system, dynamically providing code to alter the behavior of an existing program. Later, in part 2, you’ll implement a full and complete ANSI-conformant condition system while examining and testing each piece of code that you write.    Throughout, the author demonstrates how to extend Lisp using Lisp itself by using the condition system as an example. This is done while paying proper attention to the CL restart subsystem, giving it attention on a par with the handler subsystem. After reading and using this book, you&#39;ll have learned about the inner functioning of the condition system, how to use it in your own Common Lisp coding and applications, and how to implement it from scratch, should such a need arise.\n  Implement all parts of a condition system: conditions, restarts, handler- and restart-binding macros, signalling mechanisms, assertions, a debugger, and more\n    Who This Book Is For\n    Michał &#34;phoe&#34; Herda is a programmer with contributions to multiple parts of the Common Lisp ecosystem: CL implementations, existing and widely-used CL utilities, documentation, and some of the new library ideas that he slowly pushes forwards and works on. The book  The Common Lisp Condition System is his first work -- an attempt to create a tutorial on the condition system that was missing, even all the years after which ANSI Common Lisp was standardized.", "posttime": "2020-07-15 20:42:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "lisp", "title": "通用Lisp条件系统-即将出版的书", "title_en": "The Common Lisp Condition System – Upcoming Book", "transed": 1, "url": "https://www.apress.com/us/book/9781484261330", "via": "", "real_tags": ["lisp"]}, {"category": "", "categoryclass": "", "imagename": "950c4585fb7375d1dcebe5777e5b0762.gif", "infoid": 1012004, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这轮融资由Teamworth Ventures牵头，参与机构包括图斯克风险投资伙伴公司(Tusk Venture Partners)、指数风险投资公司(Index Ventures)、宁静资本公司(Quiet Capital)、Exor Seed公司和雨点风险公司。\n如果你不熟悉这家初创公司，它可以让任何人免费生成虚拟的、一次性的支付卡号码，允许这些用户保护他们的实际信用卡号码的安全，同时允许选择将公司从你的银行账户中切断。在这个几乎持续不断的数据泄露和信用卡掠夺者瞄准毫无戒心的网站的时代，Privacy.com让黑客更难获得你的真实信用卡详细信息。\n这是一个很受欢迎的想法。在过去的三年里，Privacy.com已经发行了500万个虚拟卡号。\nPrivacy.com首席执行官薄江告诉TechCrunch，新的资金将帮助公司推出新的发卡API-过去一年的测试版-允许企业客户在自己的后端系统中发行虚拟卡并管理员工的费用。\n他说：“我们是第一家允许开发商看到预先的、透明的收入分享，并在同一天以编程方式注册和创建卡的公司。”\n江说，Privacy.com将主要服务于处于早期阶段的企业公司，这些公司“传统上需要一个轻量级的在线支付解决方案”。“这是一个服务不足的市场，因为大多数现任者专注于每月最低限额和时间框架较长的较大企业。”\n江还表示，作为服务更多企业客户的努力的一部分，这轮融资将有助于公司“以更快的速度招聘和加快产品开发”。", "note_en": "The round was led by Teamworthy Ventures, with participation from Tusk Venture Partners, Index Ventures, Quiet Capital, Exor Seeds, and Rainfall Ventures.\n The startup, if you’re unfamiliar, lets anyone  generate virtual and disposable payment card numbers for free, allowing those users to keep their actual credit card number safe while allowing the option to cut off companies from your bank account. In an age of  near-constant data breaches and  credit card skimmers targeting unsuspecting websites, Privacy.com makes it harder for hackers to get your real credit card details.\n It’s a popular idea. In the past three years,  Privacy.com has issued 5 million virtual card numbers.\n Privacy.com’s chief executive Bo Jiang told TechCrunch that the new funds will help the company launch its new Card Issuing API — in beta testing for the past year — allowing corporate customers to issue virtual cards and manage expenses for their employees in their own back-end systems.\n “We’re the first company that allows developers to see upfront, transparent revenue sharing and sign up and create cards programmatically the same day,” he said.\n Privacy.com will primarily serve early-stage enterprise companies, which “traditionally need a lighter weight solution for their online payments,” said Jiang. “It’s an underserved market, because most incumbents focus on the larger enterprise with monthly minimums and long timeframes.”\n Jiang also said the round will help the company “hire and ramp up product development at a much faster pace” as part of its push to serve more enterprise customers.", "posttime": "2020-07-15 20:21:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "支付卡,payment", "title": "\n虚拟支付卡初创公司Privacy.com首轮融资1020万美元", "title_en": "\n\t\t\t\tPrivacy.com, a virtual payment card startup, raises $10.2M in Series A\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/15/privacy-virtual-payment-card-startup/", "via": "", "real_tags": ["支付卡", "payment"]}, {"category": "", "categoryclass": "", "imagename": "8190ac76277e92c7209f91dab466011e.png", "infoid": 1012002, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着新的泄密事件揭开了新款联想ThinkPad X1 Nano的几乎所有细节，谜团终于揭开了。即将推出的ThinkPad旗舰产品将采用英特尔虎湖CPU，这是一款重量不到1公斤的极轻机箱，以及13英寸的16：10屏幕。看起来，新款ThinkPad笔记本电脑是为了与戴尔的XPS139300竞争。\n你是会写字的技术人员吗？那就加入我们的队伍吧！特别欢迎以英语为母语的人！\n联想计划扩大其高端ThinkPadX1笔记本产品阵容，这已经不是什么秘密了。这要归功于我们的几次泄密。但到目前为止，我们并不知道这些新产品到底会是什么，因为只有ThinkPad X1钛和ThinkPad X1 Nano的名字被泄露。\n这种情况现在已经改变了，因为我们有了新的泄密事件，恕我直言，之前泄露过联想其他产品的Twitter账号WalkingCat&34；。泄露的内容包括一张幻灯片，其中包括一张联想ThinkPad X1 Nano的图片，以及新款ThinkPad笔记本电脑最重要的规格。\n根据这张图片，ThinkPad X1 Nano看起来像是著名的ThinkPad X1碳的下一次进化。黑碳纤维底盘等整体设计线索相同，但新款更小更轻，重量不到1公斤。为了实现这一目标，联想使用了略小的48瓦时电池，并大幅削减了ThinkPad X1 Carbon上的大多数端口。ThinkPad X1 Nano只有两个迅雷3端口，就像目前的戴尔XPS 13一样。\n这不是戴尔XPS的唯一相似之处：联想ThinkPad X1 Nano也是自2010年以来第一款采用16：10宽高比屏幕的ThinkPad笔记本电脑。较高的屏幕具有2K分辨率和450 cd/m²的亮度，消除了大部分下挡板。恰如其分的是，85%的屏幕与机身比例高于目前任何一款ThinkPad笔记本电脑，尽管没有戴尔XPS 13那么高。这款笔记本的屏幕也比戴尔的略小(13英寸，而不是13.4英寸)。\n与目前ThinkPad仍采用14纳米CPU Comet-Lake不同，X1 Nano采用了Intel Tiger-Lake形式的10 nm CPU，并将附带16 GB的LPDDR4X内存。这并不是第一款ThinkPad笔记本电脑，因为X1 Nano也将是第一款搭载5G功能的ThinkPad笔记本电脑。\n由于联想使用的是英特尔虎湖，我们预计联想ThinkPad X1 Nano要到2020年第四季度才能看到。", "note_en": "The mystery is finally solved, as a new leak has revealed almost all details about the new Lenovo ThinkPad X1 Nano. The upcoming ThinkPad flagship will feature Intel Tiger-Lake CPUs, a extremely lightweight chassis that weighs less than 1 kg - and a 13 inch 16:10 screen. Seemingly, the new ThinkPad laptop is made to compete with Dell&#39;s XPS 13 9300.\n Are you a techie who knows how to write? Then join our Team! Especially English native speakers welcome!\n It is no secret that Lenovo plans to expand it&#39;s premium ThinkPad X1 laptop lineup.  We have several leaks to thank for that. But until now, we did not know that much what exactly those new products would be, as only the names of the ThinkPad X1 Titanium and ThinkPad X1 Nano were leaked.\n This has changed now, as we have a new leak, curtesy to the Twitter account &#34;WalkingCat&#34; that leaked  other Lenovo products before as well. The leak includes a slide, which includes a picture of the Lenovo ThinkPad X1 Nano and the most important specifications of the new ThinkPad laptop.\n Based on the picture, the ThinkPad X1 Nano looks like the next evolution of the well-known  ThinkPad X1 Carbon. The overall design cues like the black Carbon-fiber chassis are the same, but the new model is even smaller and lighter, with a weight of less than 1 kg. To achieve this, Lenovo uses a slightly smaller 48 Wh battery and also slashes most ports that are present on the ThinkPad X1 Carbon. The ThinkPad X1 Nano just has two Thunderbolt 3 ports, like the current  Dell XPS 13.\n This is not the only similarity with the Dell XPS: The Lenovo ThinkPad X1 Nano is also the first ThinkPad laptop since 2010 with a screen in the 16:10 aspect ratio. The taller screen, which has a 2K-resolution and a brightness of 450 cd/m², eliminates most of the bottom bezel. Fittingly, the screen-to-body-ratio of 85 % is higher than any other current ThinkPad laptop, though not as high as the Dell XPS 13. The screen is also slightly smaller than Dell&#39;s (13 inch instead of 13.4 inch).\n Unlike the current ThinkPads, which still feature the 14 nm CPUs Comet-Lake, the X1 Nano adopts 10 nm CPUs in the form of Intel Tiger-Lake, which will be accompanied by 16 GB LPDDR4X memory. This is not the only &#34;first&#34; for a ThinkPad, as the X1 Nano will also be the first ThinkPad laptop to feature 5G.\n Due to the fact that Lenovo uses Intel Tiger-Lake, we are not expecting to see the Lenovo ThinkPad X1 Nano until the fourth quarter of 2020.", "posttime": "2020-07-15 20:20:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "thinkpad,lenovo", "title": "联想ThinkPad X1 Nano新泄露", "title_en": "New Leaks of the Lenovo ThinkPad X1 Nano", "transed": 1, "url": "https://www.notebookcheck.net/Leak-Lenovo-ThinkPad-X1-Nano-with-a-16-10-screen-Intel-Tiger-Lake-weighs-less-than-1-kg.481319.0.html", "via": "", "real_tags": ["thinkpad", "lenovo"]}, {"category": "", "categoryclass": "", "imagename": "b626970df2870351f37066a66fa67115.png", "infoid": 1012001, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎使用2020年6月发布的Visual Studio代码。我们希望您能喜欢此版本中的多个更新，其中一些主要亮点包括：\n查看挂起的更改并对其进行排序-以树或列表的形式查看文件，按名称、路径或状态排序。\n适用于MacOS的Java包安装程序-设置为在MacOS上使用VS代码在Java中进行开发。\n7月13日星期一，太平洋时间上午9点(伦敦时间下午5点)，请加入我们的VS Code Team现场直播，观看此次发布的最新内容演示，并向我们现场提问。\n业内人士：想尽快尝试新功能吗？您可以下载每晚的内部版本，并在最新更新可用时立即尝试。有关最新的Visual Studio代码新闻、更新和内容，请在Twitter@code上关注我们！\n在这个里程碑中，我们再次从社区收到了有用的反馈，帮助我们识别和解决了许多易访问性问题。重点：\n文件资源管理器中的压缩文件夹现在可以正确说明展开/折叠状态和ARIA级别。\n屏幕阅读器现在可以在编辑器中更新光标偏移。因此，屏幕阅读器“说出全部”命令在停止和恢复时应该会工作得更好。\n以前，Settings编辑器只能用于编辑基本类型的设置，如字符串和布尔值，对于更复杂的设置类型，您需要直接编辑settings.json。现在，可以从设置编辑器编辑非嵌套对象设置。扩展作者可以使用此功能来增加这些类型设置的可见性。\n有一个新命令list.selectAndPReserve veFocus，它允许您从列表中选择一个项目，同时将焦点保持在该列表中。如果要从列表(如文件资源管理器)中选择多个文件，而不将焦点转到文件编辑器，这会很有帮助。\n默认情况下，该命令不绑定到任何键盘快捷键，但您可以添加自己的键绑定：\nVS代码现在支持通过拖放到扩展视图来安装扩展VSIX文件。\n在搜索编辑器命令(search.action.openNewEditor、search.action.openNewEditorToSide)中添加了两个新参数，以允许键绑定配置新搜索编辑器的行为方式：\nriggerSearch-打开搜索编辑器时是否自动运行搜索。默认值为true。\nFocusResults-是将焦点放在搜索结果中，还是将焦点放在查询输入中。默认值为true。\n例如，下面的键绑定在打开搜索编辑器时运行搜索，但将焦点保留在搜索查询控件中。\n{&#34；key&#34；：&#34；ctrl+o&#34；，&#34；command&#34；：&#34；search.action.openNewEditor&#34；，&#34；args&#34；：{&#34；query&#34；：&#34；vs Code&#34；，&#34；riggerSearch&#34；：TRUE，&#34；FocusResults&#34；：FALSE}}。\nsearch.searchEditor.defaultNumberOfContextLines设置已更新为默认值1而不是0，这意味着在搜索编辑器中的每个结果行前后都会显示一个上下文行。要返回到旧行为，请将该值设置回0。\n现在可以在运行时切换以前存在的workBench.list.HorizontalScrolling设置，而无需强制您重新加载工作台。\nVS代码现在支持在编辑器中查找/替换时更改正则表达式匹配组的大小写。这是使用修饰符\\u\\u\\l\\L完成的，其中\\u和\\l将大写/小写单个字符，而\\U和\\L将大写/小写匹配组的其余部分。\n也可以堆叠修饰符-例如，\\u\\u\\u$1将大写该组的前三个字符，或者\\l\\u$1将小写第一个字符，而大写其余字符。\n目前，这些仅在编辑器的查找控件中受支持，而在全局在文件中查找中不受支持。\n我们新的JavaScript调试器，在上个月成为内部人士的默认调试器之后，现在是VS Code中JavaScript(Node.js和Chrome)的默认调试器。如果您跳过了前几篇VS代码更改日志中的“预览功能”部分，则可以了解调试器自述文件中的“What”新部分。\n您不需要更改任何设置或启动配置就可以利用新的调试器。如果您遇到任何问题，请打开一个问题！\n直到今天，VS代码调试器还没有标准的方式来显示编辑器中的文件只需单击一个按钮就可以轻松调试。有些调试扩展允许您这样做，通常使用的调试配置会提示您在编辑器中调试文件。但是，用户仍必须在调试配置下拉菜单中选择正确的配置，然后才能使用F5。其他调试扩展实现了F5的后备策略：如果不存在Launch.json，则F5将尝试调试当前在活动编辑器中打开的文件。\n由于这两种方法都不容易发现，一些调试扩展(例如，Python)已经开始在编辑器的标题区域添加一个Run按钮。\n因为我们还没有找到更好的方法，而且这个方法可以在不需要任何新API的情况下实现，所以我们写了一些关于如何以标准方式实现它的指导方针。扩展作者可以在下面的扩展编写一节中找到这些准则。\n如果一个或两个都显示在编辑器标题区域的左侧，则在编辑器中运行或调试文件只需单击一下即可。\n我们已经开始在常见情况下使调用堆栈不那么拥挤：调用堆栈视图现在支持隐藏由于技术原因而存在的调试会话节点，但不会为用户提供太多价值。\n选择使用此功能的第一个调试扩展是新的JavaScript调试器，只要只有一个子会话，它就可以消除父调试会话。\n我们希望其他调试扩展也会紧随其后。请参阅下面建议的新API。\n为了使来自Visual Studio的用户更容易发现跳转到光标命令，我们添加了命令alias set next语句。\n如果您不知道Jump to Cursor做什么：它允许您将程序执行移动到一个新位置，而无需执行中间的任何源代码。\n当将鼠标悬停在断点视图中的源断点上时，VS Code现在显示断点的绝对路径。\npnpm现在是npm.PackageManager设置以及NPM和YAR运行脚本的有效选择。\n所有存储库都呈现在单个视图中，因此您可以更好地了解整个工作区状态。此外，现在可以将源代码管理视图移动到面板中，并且可以将其他视图移动到源代码管理视图容器中。\n在使用列表视图选项时，我们添加了对源代码管理视图中的更改按名称、路径(默认)和状态进行排序的支持。我们已将视图选项(列表与树)和排序选项合并到上下文菜单中的新视图排序菜单项中。\n与通常的git merge命令类似，如果用户正在执行git merge--squash命令，SCM视图现在将使用默认消息恢复SCM输入。\nVS代码现在捆绑了TypeScript 3.9.6。这个小更新修复了一些错误，包括一个可能导致TypeScript服务器在某些源代码模式上崩溃的错误。\n现在，您可以将大型文件和文件夹上传到VS Code的Web版本，系统会准确报告进度，以便您可以跟踪已上传的字节数以及上传速度。\n在这一里程碑期间，在完全支持浏览器中的文本编码以读写文件方面做了大量工作。通过利用webpack，我们依赖于浏览器现在支持的两个库：\n预览功能尚未准备好发布，但功能足以使用。我们欢迎您在开发过程中尽早提供反馈。\n在过去的几个月里，我们一直在努力支持跨机器同步VS代码首选项，这一功能在Insiers发布版中可供预览。\n现在，您可以使用同步计算机视图中计算机条目上的关闭首选项同步上下文菜单操作来禁用其他计算机上的同步。\nTypeScript4.0测试版还带来了一个新功能，可以帮助您减少加载大型JavaScript或TypeScript项目时所花费的等待时间。要解释这是如何工作的，我们首先需要介绍一下当前版本的TypeScript是如何工作的背景知识。\n在VS代码中打开JavaScript或TypeScript文件时，TypeScript语言服务会确定该文件属于哪个项目，然后为其加载关联的项目。有时这个项目可能相当大，比如核心VS代码代码库，它由数千个打字文件组成。加载项目时，VS代码能够处理基本的语法操作，如获取文档大纲和启用代码折叠，但它当前不能提供智能感知或其他更高级的语言功能，因为它们取决于对整个项目的理解。例如，为了提供自动导入，TypeScript Language服务需要知道项目中所有导出的符号。\nTypeScript4.0中的更改使VS代码在大型项目仍在加载时提供智能感知和其他更高级的语言功能成为可能。需要注意的是，我们可以提供的IntelliSense仅限于参考当前文件，而不是整个项目。这意味着建议和转到定义等功能将起作用，但我们将仅显示当前文件中的建议，并且您只能运行转到定义来跳转到当前文件中的另一个符号。\n如果您使用大型JavaScript和TypeScript项目，我们很有兴趣听取您对此新功能的反馈。今天您可以使用TypeScript Night扩展来试用它。我们希望它允许您几乎立即开始使用您的代码，直到更完整的、项目范围内的IntelliSense变得可用。\n我们正在致力于能够撤消和重做代码操作和重构。一个突出的例子是Java类重命名重构，它进行文本更改并重命名磁盘上的文件。现在可以撤消此操作，但仍需要触发两次撤消。敬请关注，我们将进一步改进这一点，并请尽早提供反馈。\nVS代码团队继续对笔记本提供本机支持。为了帮助开发，我们创建了一个GitHub Issue笔记本扩展，可以让您搜索GitHub问题和拉取请求。此扩展仍处于预览阶段，需要使用VS Code Inside，但它可以让您第一手体验笔记本，我们欢迎您的反馈。\n我们更新了笔记本电池的视觉外观，使其设计更紧凑。我们还为选定的单元格添加了阴影轮廓，以使选择状态更加明显。\n我们在笔记本中添加了热退出支持，以允许扩展来处理备份和恢复。您未保存的本地更改现在可以通过扩展序列化，并在重新打开工作区时恢复。\n我们添加了对扩展的支持，以促进撤消/重做堆栈。扩展现在可以控制哪些操作是可撤消的。例如，在GitHub问题笔记本中，您可以选择Lock按钮将单元格内容设为只读，也可以通过普通的Undo/Redo命令撤消/重做此操作。\n我们扩展了“新建文件”命令(WindowsN(⌘，LinuxCtrl+N))，以支持创建新的无标题笔记本文件。例如，您可以使用下面的键绑定快速创建一个GitHub问题笔记本并运行查询。\nNotebook.FocusedCellEdge：当单元格被聚焦时，单元格的上边界和下边界的颜色。\n此示例说明如何基于现有的VS代码调试器扩展实现笔记本调试功能。\n此示例说明如何基于Xeus内核及其对调试适配器协议的本机支持来实现笔记本调试功能。\n如果您对为VS代码创建Notebook扩展感兴趣，有一个新的指南详细介绍了Notebook API。您将了解API以及VS代码笔记本基础设施和笔记本扩展开发最佳实践的细节。\n远程开发扩展的工作仍在继续，它允许您使用容器、远程计算机或Windows Subsystem for Linux(WSL)作为功能齐全的开发环境。\nRemote-Containers and WSL：在WSL2博客文章中查看最新的使用远程容器。\n您可以在Remote Development发行说明中了解新的扩展功能和错误修复。\n如果您是VS代码远程开发的新手，您可以从以下入门教程开始：\n最新版本的Azure帐户扩展现在公开了一个可与最新Azure SDK一起使用的凭据对象。\nGitHub Pull Requests and Issues扩展的工作仍在继续，该扩展允许您处理、创建和管理Pull请求和问题。此版本的一些更新包括：\n要了解所有新功能和更新，您可以查看0.18.0版扩展的完整更改日志。\nHexEditor扩展继续得到改进，以在VS代码中提供原生的十六进制编辑体验。此版本扩展的主要更新包括简单的编辑支持(允许用户撤消、重做、编辑现有的十六进制单元格，以及将新单元格添加到文档末尾)和大文件优化，允许用户打开18兆字节以上的文件，这在以前是不可能的。\n在自述文件中可以找到值得注意的更改的完整列表。任何反馈或遇到的问题都可以提交给vscode-十六进制编辑器存储库。\n我们已经最终确定了TreeItem、StatusBarItem和TimelineItem元素中的AccessibilityInformation以支持屏幕阅读器。AccessibilityInformation包含标签和角色。一旦物品获得焦点，屏幕阅读器就会读出标签。项的角色定义屏幕阅读器如何与其交互。该角色应在特殊情况下设置，例如，当树状元素的行为类似于复选框时。如果未指定角色，VS代码将自动选择适当的角色。\neditor.action.goToLocations命令现在可以在找不到位置时显示回退消息。这允许扩展实现像Go to Super Type这样的功能，这些功能的行为就像内置功能一样，例如，Go to Definition。下面的代码片断是调用此命令的扩展的完整示例：\nvscode。命令。ecuteCommand(&#39；editor.action.goToLocations&#39；，vscode)。窗户。activeTextEditor。文档。URI、//锚定URI和位置vscode。窗户。activeTextEditor。选择。开始，[]，//结果(vscode.Location[])&#39；转到&#39；，//模式&#39；找不到超级类型&#39；//&lt；-消息)；\n对于希望通过向编辑器添加运行和/或调试按钮来改善单文件调试体验的调试扩展，我们建议遵循以下准则以获得一致的外观：\n将命令添加到编辑器标题区域(请参阅模拟调试)：要使命令仅对特定语言可见，请使用&#34；WHEN&#34；子句，例如&#34；resourceLangId==python&#34；。\n将Run命令放入1_Run@10组，将Debug命令放入1_Run@20组。\nCodeActionProviderMetadata上的新文档属性允许扩展为它们返回的代码操作提供静态文档。当Provider返回代码操作时，此文档显示在代码操作列表的底部：\n当用户选择文档条目时执行命令。此命令可以在编辑器中显示文档，也可以在浏览器中打开文档。\n通过OpenDialogOptions和SaveDialogOptions为打开和保存文件对话框提供标题的API已经完成。请注意，并非所有操作系统都允许设置此标题，因此根据您的扩展运行位置的不同，行为可能会有所不同。\n我们引入了第二种按钮样式，可以在需要使按钮不那么突出时使用：\n现在，您可以将GitHub工作流徽章添加到已发布扩展的徽章列表中，因为github.com已添加到批准的徽章来源列表中。\nargv.json现在支持enable-proposed-api字段。这允许扩展作者在发布的版本中运行他们建议的API扩展，以便长期使用，而不需要通过命令行打开VS代码并传递--enable-proposed-api CLI标志。\n即将发布的3.16规范增加了对语义标记和完成项中附加文本编辑的延迟解析的支持。\n每个里程碑都带有新提出的API，扩展作者可以试用它们。一如既往，我们需要您的反馈。要试用建议的API，您需要执行以下操作：\n请注意，您不能发布使用建议API的扩展。在下一个版本中可能会有突破性的变化，我们永远不会想要破坏现有的扩展。\n这个新的提议window.registerLinkProvider建立在前一版本中添加的终端的新链接系统之上，它允许扩展将链接附加到终端，包括悬停时显示的工具提示标签。\n这与之前提议的(现已弃用)链接处理程序API形成对比，后者允许您的扩展可能处理有问题的链接，如果它不能处理，则会有一个后备链。这种链接肯定会被处理的新模型更符合考虑到的愿景，即链接可以有一个可能的操作列表。\nVS代码在不调试的情况下运行功能是调试的一种变体，其中现有的调试配置被重用来运行程序，而不是调试该程序。此运行模式的结果是程序不会中断到调试器，既不是因为命中断点，也不是因为任何其他原因。\n在这个里程碑中，我们为&#34；无需调试运行提供了官方扩展API：在debug.startDebuging函数的DebugSessionOptions中添加了一个新属性noDebug。noDebug控制即将启动的会话是在调试的情况下运行，还是在不调试的情况下运行。如果缺少noDebug属性，则使用父会话(如果有)中的值。如果没有父会话，则假定缺少noDebug属性的值为&#39；false&#39；。\n请注意：以前可以将noDebug标志添加到启动配置以达到相同的效果。这个非官方的API现在已被弃用(但仍受支持)，我们建议将扩展过渡到新的API。\n随着复杂的调试扩展和调试设置的到来，更多的调试会话出现在调用堆栈树视图中，使它们看起来很拥挤。在大多数情况下，调试会话对用户很有用，他们需要完全控制它们。在其他情况下，一些调试会话只是一组子会话的实现构件或分组机制。\n为了使调用堆栈视图在常见情况下不那么拥挤，我们引入了一项功能，如果父调试会话节点只有一个子会话，则隐藏该节点。此功能称为紧凑模式，可通过debug.startDebuging函数的DebugSessionOptions上的新的可选紧凑属性使用。\n如果Compact为true，则新创建的调试会话的父级将隐藏在调用堆栈VIE中。\n.", "note_en": "Welcome to the June 2020 release of Visual Studio Code. There are a number of updates in this version that we hope you will like, some of the key highlights include:\n  View and sort pending changes - View files as a tree or list, sort by name, path, or status.\n          Java Pack Installer for macOS - Get set up to develop in Java with VS Code on macOS.\n    Join us live at the  VS Code team&#39;s livestream on Monday, July 13 at 9am Pacific (5pm London), to see a demo of what&#39;s new in this release and ask us questions live.\n  Insiders: Want to try new features as soon as possible? You can download the nightly  Insiders build and try the latest updates as soon as they are available. And for the latest Visual Studio Code news, updates, and content, follow us on Twitter  @code!\n    This milestone, we again received helpful feedback from our community, which helped us identify and tackle many  accessibility issues. Highlights:\n  Compact folders in the File Explorer now properly narrate expanded/collapsed state and the ARIA level.\n  Screen readers can now update the cursor offset in the editor. As a result, the screen reader &#34;Say All&#34; command should work better when stopped and resumed.\n      Before, the Settings editor could only be used to edit the settings of primitive types, like strings and booleans, and you needed to edit  settings.json directly for more complicated settings types. Now, you can edit non-nested object settings from the Settings editor. Extension authors can use this functionality to increase the visibility of these kinds of settings.\n                    There is a new command,  list.selectAndPreserveFocus, which lets you select an item from a list, while keeping focus in that list. This can be helpful if you want to select multiple files from a list, such as the File Explorer, without having focus go to the file editor.\n  The command is not bound to any keyboard shortcut by default, but you can add your own keybinding:\n          VS Code now supports installing an extension VSIX file through drag and drop onto the Extensions view.\n    There are two new arguments added to the Search editor commands ( search.action.openNewEditor,  search.action.openNewEditorToSide) to allow keybindings to configure how a new Search editor should behave:\n  triggerSearch - Whether a search be automatically run when a Search editor is opened. Default is true.\n  focusResults - Whether to put focus in the results of a search or the query input. Default is true.\n  For example, the following keybinding runs the search when the Search editor is opened but leaves the focus in the search query control.\n  {\r   &#34;key&#34; :  &#34;ctrl+o&#34; ,\r   &#34;command&#34; :  &#34;search.action.openNewEditor&#34; ,\r   &#34;args&#34; : {  &#34;query&#34; :  &#34;VS Code&#34; ,  &#34;triggerSearch&#34; :  true ,  &#34;focusResults&#34; :  false  }\r }\n    The  search.searchEditor.defaultNumberOfContextLines setting has been updated to have a default value of 1 instead of 0, meaning one context line will be shown before and after each result line in the Search editor. To go back to the old behavior, set the value back to 0.\n    The previously existing  workbench.list.horizontalScrolling setting can now be toggled at runtime without forcing you to reload the workbench.\n      VS Code now supports changing the case of regex matching groups while doing a find/replace in the editor. This is done with the modifiers  \\u\\U\\l\\L, where  \\u and  \\l will upper/lowercase a single character, and  \\U and  \\L will upper/lowercase the rest of the matching group.\n      The modifiers can also be stacked - for example,  \\u\\u\\u$1 will uppercase the first three characters of the group, or  \\l\\U$1 will lowercase the first character, and uppercase the rest.\n  Currently, these are only supported in the editor&#39;s Find control, and not in global  Find in Files.\n      Our new JavaScript debugger, after being the default debugger on Insiders last month, is now the default debugger for JavaScript (Node.js and Chrome) in VS Code. If you skipped the &#34;Preview Features&#34; section of the last few VS Code changelogs, you can catch up on the  what&#39;s new section of the debugger README.\n  You should not need to change any settings or launch configurations to take advantage of the new debugger. If you run into any problems, please  open an issue!\n    Until today, the VS Code debugger had no standard way of showing that a file in the editor could be easily debugged with just a click of a button. Some debug extensions would allow you to do so, usually with a debug configuration that prompted you to &#34;Debug file in editor.&#34; However, users still had to select the correct configuration in the debug configuration dropdown menu before they can use  F5. Other debug extensions implement a fallback strategy for  F5: if no  launch.json exists,  F5 will try to debug the file currently open in the active editor.\n  Since both approaches are not easily discoverable, some debug extensions (for example, Python) have started to add a  Run button to the editor&#39;s title area.\n  Since we haven&#39;t found a better approach, and this method can be implemented without any need for new APIs, we wrote some guidelines for how to implement it in a standard way. Extension authors can find these guidelines below in the &#34;Extension Authoring&#34; section.\n      If one or both show up on the left-hand side of the editor&#39;s title area, then running or debugging the file in the editor is just one click away.\n    We&#39;ve started to make the CALL STACK less crowded for common cases: the CALL STACK view now supports hiding debug session nodes that exist for technical reasons, but do not provide much value to users.\n  The first debug extension that has opted into this feature is the new JavaScript debugger, which could eliminate a parent debug session whenever there is only a single child session.\n    We hope that other debug extensions will follow. Please see the new proposed API below.\n    To make the command  Jump to Cursor more discoverable for users coming from Visual Studio, we&#39;ve added the command alias  Set Next Statement.\n  If you don&#39;t know what  Jump to Cursor does: it lets you move program execution to a new location without executing any of the source code in between.\n    When hovering over a source breakpoint in the BREAKPOINTS view, VS Code now shows the absolute path of the breakpoint.\n      pnpm is now a valid choice for the  npm.packageManager setting, along with  npm and  yarn, to run your scripts.\n          All repositories are rendered in a single view, so you can get a better overview of the entire workspace status. Additionally, the Source Control view can now be moved to the panel and other views can be moved to the Source Control view container.\n    We have added support for sorting your changes in the source control view by name, path (default), and state when using the list view option. We have consolidated the view options (list vs. tree) and sort options into a new  View &amp; Sort menu item in the context menu.\n      Similar to usual  git merge command, the SCM view will now restore the SCM input with the default message if the user is in the middle of a  git merge --squash command.\n      VS Code now bundles TypeScript 3.9.6. This minor update fixes a few bugs, including one that could cause the TypeScript server to crash on certain source code patterns.\n      You can now upload large files and folders to the web version of VS Code and progress will be reported accurately so that you can track the number of bytes that have been uploaded, as well as the upload speed.\n      During this milestone, a lot of work went into full support for text encodings in the browser for reading and writing files. We rely on two libraries that are now supported in browsers by leveraging webpack:\n        Preview features are not ready for release but are functional enough to use. We welcome your early feedback while they are under development.\n    We have been working the last couple of months to support synchronizing VS Code preferences across machines and this feature is available for preview on the  Insiders release.\n  You can now disable sync on other machine using  Turn off Preferences Sync context menu action on the machine entry in  Synced Machines view.\n                The TypeScript 4.0 beta also brings a new feature that should help reduce the time you spend waiting while a large JavaScript or TypeScript project is being loading. To explain how this works, we first need to cover a little background on how current versions of TypeScript work.\n  When you open a JavaScript or TypeScript file in VS Code, the TypeScript language service determines which project that file belongs to and then loads the associated project for it. Sometimes this project can be quite large, such as with the core VS Code codebase, which consists of many thousands of TypeScript files. While a project is being loaded, VS Code able to handle basic syntax operations, such as getting the document outline and enabling code folding, but it cannot currently provide IntelliSense or other more advanced language features because they depend on understanding the entire project. In order to provide auto imports, for example, the TypeScript language service needs to know all exported symbols in a project.\n  The changes in TypeScript 4.0 make it possible for VS Code provide IntelliSense and other more advanced language features while a large project is still loading. The caveat is that the IntelliSense we can provide is limited to consulting the current file instead of the entire project. This means that features such as suggestions and  Go to Definition will work, but we will only show suggestions from the current file and you can only run  Go to Definition to jump to another symbol in the current file.\n  If you work with large JavaScript and TypeScript projects, we are interested in hearing your feedback on this new feature. You can try it today using the  TypeScript nightly extension. Our hope is that it allows you to start work with your code almost instantly until the more complete, project-wide IntelliSense becomes available.\n    We are working on being able to undo and redo Code Actions and refactorings. A prominent example is the Java class rename refactoring, which makes a textual change as well as renaming the file on disk. This can now be undone but it still requires triggering undo two times. Stay tuned as we further improve this and please provide early feedback.\n      The VS Code team is continuing on native support for Notebooks. To help with development, we&#39;ve created a  GitHub Issue Notebooks extension, which lets you search GitHub issues and pull requests. This extension is still in preview and requires using VS Code  Insiders, but it lets experience Notebooks first hand and we welcome your feedback.\n    We&#39;ve updated the visual look of Notebook cells for a more compact design. We&#39;ve also added shadow outlines to selected cells to make the selection state more obvious.\n      We have added Hot Exit support in Notebooks to allow extensions to handle backups and restoration. Your unsaved local changes can now be serialized by extensions and restored when the workspace is reopened.\n    We added support for extensions to contribute to the Undo/Redo stacks. Extensions can now control what operations are undoable. For example, in a GitHub Issue Notebook, you can select the  Lock button to make the cell content readonly, and also undo/redo this operation through the normal Undo/Redo commands.\n        We extended the  New File command (  ⌘N (Windows, Linux  Ctrl+N)) to support creating new untitled Notebook files. For example, you can use the keybinding below to quickly create a GitHub Issue Notebook and run queries.\n            notebook.focusedCellBorder: The color of the cell&#39;s top and bottom border when the cell is focused\n    This sample shows how to implement Notebook debugging functionality based on the existing VS Code debugger extensions.\n  This sample shows how to implement Notebook debugging functionality based on the xeus kernel and its native support for the  Debug Adapter Protocol.\n    If you&#39;re interested in creating Notebook extensions for VS Code, there is a new guide detailing the  Notebook API. You&#39;ll learn about the API as well as the details of the VS Code Notebook infrastructure and Notebook extension development best practices.\n    Work continues on the  Remote Development extensions, which allow you to use a container, remote machine, or the  Windows Subsystem for Linux (WSL) as a full-featured development environment.\n    Remote - Containers and WSL: Check out the recent  Using Remote Containers in WSL 2 blog post.\n  You can learn about new extension features and bug fixes in the  Remote Development release notes.\n  If you are new to VS Code Remote Development, you can get started with these introductory tutorials:\n      The newest version of the Azure Account extension now exposes a credentials object that can be used with the latest  Azure SDK.\n    Work continues on the  GitHub Pull Requests and Issues extension, which allows you to work on, create, and manage pull requests and issues. Some updates for this release include:\n    To learn about all the new features and updates, you can see the full  changelog for the 0.18.0 release of the extension.\n    The  HexEditor extension continues to be improved upon to provide a native hexadecimal editing experience within VS Code. The major updates to the extension this release include simple editing support (allowing users to undo, redo, edit existing hex cells, and add new cells to the end of the document) and large file optimization allowing users to open files above 18 megabytes, which previously wasn&#39;t possible.\n    A full list of notable changes can be found in the  README. Any feedback or issues experienced can be filed against the  vscode-hexeditor repository.\n      We have finalized the  AccessibilityInformation in the  TreeItem,  StatusBarItem, and  TimelineItem elements to support screen readers.  AccessibilityInformation contains a  label and a  role. The  label is read out by a screen reader once the item has focus.  role of the item defines how a screen reader interacts with it. The  role should be set in special cases when, for example, a tree-like element behaves like a checkbox. If  role is not specified, VS Code will pick the appropriate  role automatically.\n    The  editor.action.goToLocations command can now show a fallback message when no locations could be found. This allows extensions to implement features like  Go to Super Type that behave just like built-in features, for example  Go to Definition. The snippet below is a full sample of an extension invoking this command:\n  vscode . commands . executeCommand (\r   &#39;editor.action.goToLocations&#39; ,\r   vscode . window . activeTextEditor . document . uri ,  //anchor uri and position\r   vscode . window . activeTextEditor . selection . start ,\r  [],  // results (vscode.Location[])\r   &#39;goto&#39; ,  // mode\r   &#39;No Super Types Found&#39;   // &lt;- message\r );\n    For debug extensions that want to improve the single file debug experience by adding a &#34;Run&#34; and/or &#34;Debug&#34; button to the editor, we recommend following these guidelines for a consistent look and feel:\n  Add the commands to the editor title area ( see Mock Debug):\r To make the commands only visible for specific languages use a &#34;when&#34; clause, for example,  &#34;resourceLangId == python&#34;.\n  Put the Run command in the  1_run@10 group and the Debug command in the  1_run@20 group.\n    The new  documentation property on  CodeActionProviderMetadata lets extension provide static documentation for the code actions they return. This documentation is shown at the bottom of the list of code actions when the provide returns a code action:\n    A command is executed when the user selects the documentation entry. This command can show the documentation in the editor or open it in a browser.\n    The API for providing a  title for Open and Save file dialogs via the  OpenDialogOptions and  SaveDialogOptions has been finalized. Note that not all operating systems allow this title to be set, so the behavior may differ depending on where your extension is running.\n          We&#39;ve introduced a secondary button style to be used when needing to make a button less prominent:\n      You can now add  GitHub Workflow badges to the list of badges of a published extension, since  github.com was added to the  list of Approved Badge sources.\n      The field  enable-proposed-api is now supported in  argv.json. This allows extension authors to run their proposed API extension in released builds for long-term dogfooding, without needing to open VS Code via the command line and pass the  --enable-proposed-api CLI flag.\n            Support for  semantic tokens and lazy resolving of additional text edits in  completion items has been added to the upcoming  3.16 specification.\n    Every milestone comes with new proposed APIs and extension authors can try them out. As always, we want your feedback. This is what you have to do to try out a proposed API:\n    Note that you cannot publish an extension that uses a proposed API. There may be breaking changes in the next release and we never want to break existing extensions.\n    Building on top of  the terminal&#39;s new link system added in the previous release, this new proposal  window.registerLinkProvider allows an extension to attach links to the terminal, including a tooltip label that is displayed on hover.\n    This contrasts with the previously proposed (now deprecated)  &#34;link handler&#34; API, which would allow your extension to possibly handle the link in question, and if it doesn&#39;t, there would be a fallback chain. This new model where links will definitely be handled fits in better with the vision in mind where links could have a list of possible actions.\n    VS Code&#39;s &#34;Run without Debugging&#34; feature is a variant of debugging where an existing debug configuration is reused for running a program instead of debugging it. A consequence of this run mode is that the program does not break into the debugger, neither for hitting breakpoints nor for any other reason.\n  In this milestone we provide official extension API for &#34;Run without Debugging&#34;: a new property  noDebug has been added to the  DebugSessionOptions of the  debug.startDebugging function.  noDebug controls whether the session about to start should run with or without debugging. When the  noDebug property is missing, the value from the parent session (if there is one) is used. If there is no parent session, the value &#39;false&#39; is assumed for a missing  noDebug property.\n  Please note: Previously it was possible to add a  noDebug flag to a launch configuration to achieve the same effect. This unofficial API is now deprecated (but still supported) and we suggest that extensions transition to the new API.\n    With the arrival of sophisticated debug extensions and debug setups, more debug sessions show up in the CALL STACK tree view and make them look crowded.\rIn most cases the debug sessions are useful to users and they need to have full control over them. In other cases some debug sessions are just implementation artifacts or a grouping mechanism for a set of child sessions.\n  In order to make the CALL STACK view less crowed in common cases, we have introduced a feature to hide a parent debug session node if it only has a single child session.\rThis feature is called &#34;compact mode&#34; and is available through a new optional  compact property on the  DebugSessionOptions of the  debug.startDebugging function.\n  If  compact is true, the parent of the newly created debug session will be hidden in the CALL STACK vie\n......", "posttime": "2020-07-15 20:19:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,代码,用于,扩展", "title": "用于ARM上Windows的VS代码现在可用于稳定版本", "title_en": "VS Code for Windows on ARM is now available for the stable release", "transed": 1, "url": "https://code.visualstudio.com/updates/v1_47#_stable-windows-arm-builds", "via": "", "real_tags": ["windows", "代码", "用于", "扩展"]}, {"category": "", "categoryclass": "", "imagename": "dc0d2c9343fbc019ee44d66ae3a2b0bd.jpg", "infoid": 1011999, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Lemonade首席执行官丹尼尔·施赖伯(Daniel Schreiber)在2月份告诉TechCrunch，拥有房主或租户政策的Lemonade客户中，约70%也是宠物主人，而美国有1%至2%的宠物主人有宠物保险。\nLemonade的宠物保险将向用户收取12美元/月的费用，选择将他们的新宠物保险与房屋/租户保险捆绑在一起的现有Lemonade投保人可以获得10%的折扣。这项政策只适用于狗和猫的主人-其他宠物不在保险范围内。\n根据Lemonade网站的说法，这项政策涵盖血液测试、尿液分析、X光、核磁共振、实验室工作、CT扫描和超声波，以及门诊、专科和紧急护理程序，以及住院和手术。该公司还提供药物服务，包括注射和处方药。宠物主人还可以获得延长的事故和疾病套餐，超出了最初的意外交通事故和中毒以及各种疾病的承保范围。\n柠檬水宠物保险还提供了一项可选的健康套餐，可以节省每年的体检、心虫测试、粪便测试、年度寄生虫评估测试、血检和最多三种疫苗等日常用品。健康套餐还可以让宠物主人获得医疗建议，聊天，并提供提醒和提示，让他们的宠物保持健康。\n“宠物的健康保险可以追溯到100多年前，”Schreiber在2月份告诉TechCrunch。“它始于荷兰的马匹，而宠物保险的继承人实际上是汽车保险。马是一种交通工具，如果这种交通工具出了什么问题，保险是为了保护你。但是宠物现在是这个家庭的成员了。“。\n一般来说，保险单也相当陈旧，法律要求使用几十年前写就的语言和条款。Lemonade一直试图在美国推出其政策2.0-一项措辞简单的开源政策，允许任何人对其做出贡献或提出修改建议。保单2.0目前只在欧洲可用，但它标志着保险处理方式的巨大变化，因为该行业最大的问题之一是，投保人根本不知道什么是保险，在某些情况下也不能知道什么是保险，什么不是保险。\n此次发布正值Lemonade刚刚进入公开市场，上市首日大涨。\n除了公开募股，Lemonade还从红杉(Sequoia)、安联(Allianz)等公司筹集了4.8亿美元的机构投资，在全球拥有382名员工。\n在美国队中，35%的全职员工是有色人种，61%是女性。在全球范围内，Lemonade的女性比例为49%；研发团队中有四分之一是女性，高管团队中有33%是女性。董事会由8名成员组成，其中包括一名有色人种和一名女性。", "note_en": "Lemonade   CEO Daniel Schreiber  told TechCrunch back in February that some 70 percent of Lemonade customers with a home owners or renters policy are also pet owners, and yet between 1 and 2 percent of pet owners in the United States have pet insurance.\n   Pet insurance from Lemonade will cost users $12/month, with a 10 percent discount available to existing Lemonade policy holders who choose to bundle their new pet insurance with home/renters insurance. The policy is only available to dog and cat owners — other pets are not covered.\n The policy covers blood tests, urinalysis, x-rays, MRIs, labwork, CT scans and ultrasounds, as well as outpatient, specialty and emergency care procedures, along with hospitalization and surgery, according to the Lemonade website. The company also covers medication, including injections and prescription meds. Pet owners can also get an extended Accident and Illness Package that goes beyond the initial coverage of accidental road accidents and poisonings, and a variety illnesses.\n Lemonade Pet Insurance comes with an optional wellness package, as well, which provides savings for routine stuff like an annual physical checkup, heartworm tests, fecal tests, annual parasite evaluation tests, Bloodwork, and up to three vaccines. The wellness package also gives pet owners access to medical advice chat and offers reminders and tips to keep their pet healthy.\n “Health insurance for pets dates back to over 100 years ago,” Schreiber told TechCrunch in February. “It started with horses in the Netherlands, and the heir to that pet insurance is actually car insurance. Horses were a mode of transportation, and the insurance was meant to protect you if something happened to that mode of transportation. But pets are now members of the family.”\n  Insurance policies in general are also quite antiquated, with legal requirements to use language and clauses written decades ago. Lemonade has been trying to launch its Policy 2.0 — a simply worded policy that is open-sourced, allowing anyone to contribute or suggest changes to it — in the United States.  Policy 2.0 is currently only available in Europe, but it marks a big change in the way insurance is handled as one of the biggest issues in the industry is that policy holders simply don’t, and in some cases can’t, know what is and is not covered.\n This launch comes at a time when Lemonade has just  entered the public market, with a  big pop in its first day of trading.\n Alongside its public offering, Lemonade has raised $480 million in institutional investment from firms like Sequoia, Allianz, and others, with a team of 382 employees globally.\n On the US team, 35% of full time employees are people of color; 61% are women. Globally, Lemonade is 49% women; a quarter of the R&amp;D team are women, and the executive team is 33% women. The 8-member board includes one person of color and one woman.", "posttime": "2020-07-15 19:59:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "宠物,推出,launches,保险", "title": "\n柠檬水推出宠物保险", "title_en": "\n\t\t\t\tLemonade launches pet insurance\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/15/lemonade-launches-pet-insurance/", "via": "", "real_tags": ["宠物", "推出", "launches", "保险"]}, {"category": "", "categoryclass": "", "imagename": "9f4c1dccbb8904e2c2ab7cfb794e9b98.jpg", "infoid": 1011998, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国49个州的Revolut客户现在可以在这家数字银行的密码平台上买卖比特币(BTC)和以太(ETH)。\n英国金融科技公司3月份进入美国，直到在美国建立了核心产品，然后才推出比特币服务，Revolut密码首席执行官爱德华·库珀说。\nRevolut通过与总部位于纽约的信托公司Paxos合作，获得了监管部门的许可。\nPaxos周三还宣布将推出一项新的经纪API服务，允许客户提供买入、卖出、发送和持有选项。通过Paxos Crypto Brokerage，该公司充当其客户(如Revolut)的托管人，并管理法规遵从性方面。\nPaxos首席执行官查德·卡斯卡里拉说：“令人兴奋的是，这真的降低了公司进入密码领域的门槛。”你可以插入我们的API，我们将为你提供监管能力和技术能力，以提供用于购买或出售的密码。“。\n在美国除田纳西州以外的每个州，Revolut都允许客户四舍五入他们的交易，将多余的零钱转换为密码。Revolut还使客户能够在28种全球货币之间转换BTC和ETH，并计划在未来扩展到其他加密。\n在欧洲，Revolut支持litecoin(LTC)、比特币现金(BCH)和XRP。该公司对标准客户进行的每笔密码交易收取2.5%的费用，对优质客户收取1.5%的费用。库珀说，Revolut crypto arm在欧洲有大约100万客户使用密码交易，是银行的“利润中心”。\n他补充说，该公司的下一个目标是亚太地区：澳大利亚、新加坡和日本。\n库珀说：“我们将首先推出核心产品，然后再看看需要采取哪些步骤才能推出加密产品。”“我们可能是最快进入澳大利亚市场的公司，所以我想下一个就是澳大利亚的Crypto。”\n与其在美国的扩张无关，该银行最近改变了加密的所有权规则，使用户成为自己硬币的合法所有者。Revolut还将于7月27日暂停在欧洲进行加密卡支付的能力，并且不会在美国引入这一功能。\n库珀说：“我们从欧洲用户那里得到了一些反馈，他们正在消费，并不希望他们的密码余额被花掉。”“我们想让这一点变得更好。…。我们将推出它，可能还会有加密专用卡。“。\nCoinDesk是区块链新闻的领先者，是一家努力追求最高新闻标准并遵守一套严格的编辑政策的媒体渠道。CoinDesk是数字货币集团(Digital Currency Group)的独立运营子公司，该集团投资于加密货币和区块链初创公司。", "note_en": "Revolut customers in 49 U.S. states can now buy, hold and sell  bitcoin (BTC) and  ether (ETH) on the digital bank’s crypto platform.\n The British fintech firm  entered the U.S. in March and waited until it had already established its core products in the country before launching bitcoin services as well, said Revolut crypto chief Edward Cooper.\n Revolut gained the regulatory permission to do this by partnering with New York-based trust company Paxos.\n Paxos also announced Wednesday it was rolling out a new brokerage API service, allowing clients to provide buy, sell, send and hold options. Through the Paxos Crypto Brokerage, the firm acts as a custodian for its clients, such as Revolut, and manages the regulatory compliance aspects.\n “What’s exciting about it is really lowering the barrier of entry for firms to get into crypto,” said Paxos CEO Chad Cascarilla. “You can plug into our APIs and we’ll provide you the regulatory ability and the technological capabilities to offer crypto for buying or selling.”\n  In every U.S. state except Tennessee, Revolut allows customers to round up their transactions, converting spare change into crypto. Revolut also gives customers the ability to convert BTC and ETH among 28 global currencies, with plans to branch out into other cryptos in the future.\n In Europe, Revolut supports  litecoin (LTC),  bitcoin cash (BCH) and  XRP. The company charges 2.5% for every crypto transaction that standard customers make and 1.5% for premium costumers. With around a million customers in Europe transacting in crypto, Revolut crypto arm is a “profit center” for the bank, Cooper said.\n The company’s next targets are in the Asia-Pacific region: Australia, Singapore and Japan, he added.\n “We’ll launch the core product first and then see what steps we need to make to launch the crypto product,” Cooper said. “We’ll probably be fastest to market in the Australian market, so I’d imagine Crypto Australia is next.”\n  Unrelated to its expansion into the U.S., the bank  recently changed ownership rules for crypto, making users the legal owners of their own coins. Revolut is also suspending the ability to make crypto card payments in Europe on July 27 and isn’t introducing the feature in the U.S.\n “We have got some feedback from users in Europe that they were spending and weren’t expecting for their crypto balances to be spent,” said Cooper. “We want to make that better. … We’ll launch it and probably have crypto-specific cards.”\n    Disclosure The leader in blockchain news, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a  strict set of editorial policies. CoinDesk is an independent operating subsidiary of Digital Currency Group, which invests in cryptocurrencies and blockchain startups.", "posttime": "2020-07-15 19:58:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "rust,比特币,交易,美国,以太", "title": "英国初创公司Revolut与总部位于纽约的信托公司Paxos合作，将比特币和以太交易带给美国除田纳西州以外的每个州的客户", "title_en": "UK startup Revolut partners with New York-based trust company Paxos to bring bitcoin and ether trading to customers in every US state except Tennessee", "transed": 1, "url": "https://www.coindesk.com/uk-fintech-firm-revolut-brings-bitcoin-ether-trading-to-us-customers", "via": "", "real_tags": ["rust", "比特币", "交易", "美国", "以太"]}, {"category": "", "categoryclass": "", "imagename": "2961612d4a86a646f536632718ecca1e.jpg", "infoid": 1011997, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在动荡不安的一年里，Airbnb安抚房东和顾客的最新努力在社交媒体上遭到强烈反对。\n总部位于旧金山的在线度假租赁市场本周推出了一项功能，为客户提供向房东捐款和赠送善意卡的机会。\n今天，我们将介绍一种与您最喜爱的主机连接的新方式。现在，您可以创建个性化的善意卡片，这些卡片可以方便地发送感谢或鼓励的信息，并可以选择添加贡献。我们希望这些贺卡能让主人微笑，并为您带来些许欢乐。这是该公司致客户的一条信息。\n&#34；Airbnb已经失去了它该死的头，我为什么要捐给我的主人呢？推特用户奥伦斯凯怒气冲冲地说：我连一套房子都买不起。\nAirbnb已经失去了他妈的理智。我为什么要捐给我的主人？我连一套房子都买不起。pic.twitter.com/JZspJqyoPB。\n-Rosaleen(@olenskae)2020年7月14日。\n旧金山“纽约时报”科技记者迈克·艾萨克(Mike Isaac)在Twitter上写道，Airbnb创造了一种机制，在这种机制下，你可以……把钱捐给房东……他们中的许多人通过利用预先租出的多处房产过度扩张，现在却变得空无一人……这就像是共享经济中的抵押贷款支持证券(MBS？)一样。\n随着失业率飙升，加上在大流行期间，许多人难以每月支付租金，为经常拥有空置投资房产并从空置投资房产中获利的房东筹集资金的举措被许多人视为语气失聪。\n他们之所以创造这个，是因为他们的房东现在非常讨厌他们，因为他们的房子基本上是无人居住的，而Airbnb不会为他们的空房付钱给房东。艾萨克在推特上猜测，这是一种疯狂的局面，基本上整个平台都在攻击他们。\n和我们所有人一样，Airbnb上的主持人也受到新冠肺炎的影响，他们中的许多人都无法欢迎客人。现在比以往任何时候都更重要的是，伸出援手，相互支持--即使是在很小的方面。\n你有责任决定你的捐款是否有资格享受减税或抵免，Airbnb网站上的帖子总结道。\n我也收到了这封电子邮件。单击以将其签出-他们让您选择一张卡，在3个不同的屏幕上写下消息&amp；do Contribution。因此，你可能会错过捐款是一种选择，直到你写了一条信息--在这一点上，你已经做好了完全准备，觉得自己对此有负罪感，推特用户myGood Child写道。\n2020年本应是Airbnb辉煌的一年，预计将是最炙手可热的首次公开募股(IPO)之一。该公司此前估值超过500亿美元，但随着全球旅行几乎停滞不前，由于公司面临生死存亡的危机，其估值已降至180亿美元。\n今年4月，“华尔街日报”(Wall Street Journal)报道称，这家房屋共享巨头预计今年上半年将亏损10亿美元。\nAirbnb的一位发言人在回应这一强烈反对时告诉SFGate：“在这段充满挑战的时期，我们听到了许多Airbnb客人的来信，他们有兴趣支持过去的东道主，并与他们重新建立联系。本着重新建立联系的精神，我们开发了一项新功能，允许客人向热情好客的主人发送带有支持和鼓励信息的虚拟卡片。如果客人愿意，他们可以选择增加自愿捐款。“", "note_en": "Airbnb&#39;s latest attempt to appease hosts and customers amid a tumultuous year was met with a searing backlash on social media.\n   The online vacation rental marketplace, headquartered in San Francisco, initiated a feature this week offering customers the chance to donate money and &#34;kindness cards&#34; to hosts.\n   &#34;Today we&#39;re introducing a new way to connect with your favorite hosts. Now you can create personalized kindness cards that make it easy to send a message of appreciation or encouragement, with the option to add a contribution. We hope these cards will make hosts smile, and bring a little joy your way,&#34; a message from the company to customers read.\n      &#34;Airbnb has lost its f---ing head, why would I donate to my host? I can&#39;t even afford one house.&#34; Twitter user olenskae fumed.\n   Airbnb has lost its fucking head. Why would I donate to my host? I can&#39;t even afford one house.  pic.twitter.com/JZspJqyoPB\n— Rosaleen (@olenskae)  July 14, 2020\n    San Francisco-based New York Times tech reporter  Mike Isaac wrote on Twitter, &#34;Airbnb has created a mechanism in which you can....donate money to landlords....many of whom have overextended themselves by leveraging multiple properties which they rented out pre-covid, and are now going empty...it&#39;s like the mortgage-backed securities of the sharing economy?&#34;\n          With soaring joblessness and a struggle for many to make monthly rent payments amid the pandemic, the move to raise money for hosts who often own and profit from vacant investment properties was seen as tone deaf by many.\n       &#34;They&#39;ve created this because their hosts absolutely hate them right now, due to the fact that their homes are largely uninhabited and Airbnb won&#39;t (cant) pay the hosts for their empty houses. Crazy situation where basically the entire platform has turned on them,&#34; Isaac speculated on Twitter.\n          &#34;Like all of us, hosts on Airbnb are impacted by COVID-19, and many of them are unable to welcome guests. Now more than ever, it&#39;s important to reach out and support one another—even in small ways.\n   &#34;It’s your responsibility to determine whether your contribution is eligible for a tax deduction or credit,&#34; the posting on the Airbnb website concluded.\n      &#34;I got this email too. Clicked to check it out - they have you select a card, write the message &amp; do contribution on 3 separate screens. So you could miss that donating is an option until after writing a message - at which point you&#39;re perfectly primed to feel guilted into it,&#34; Twitter user amygoodchild wrote.\n      2020 was due to be a banner year for the Airbnb, with an expectation of one of the hottest stock-market debuts. The company was previously valued at more than $50 billion, but with global travel nearly at a standstill its valuation has since dropped to $18 billion as the company faces an existential crisis.\n   In April,  the Wall Street Journal reported that the home-sharing giant is expected to lose $1 billion through the first half of the year.\n   In response to the backlash a spokesperson from Airbnb told SFGATE, “during this challenging time we heard from many Airbnb guests who were interested in supporting and reconnecting with past hosts. In the spirit of rekindling connections, we developed a new feature that allows guests to send virtual cards with messages of support and encouragement to hosts who provided excellent hospitality. If they wish, guests have the option to add a voluntary financial contribution.”", "posttime": "2020-07-15 19:58:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "asks,airbnb", "title": "Airbnb要求人们向房东捐款，随之而来的是强烈反对", "title_en": "Airbnb asks people to donate money to landlords, backlash ensues", "transed": 1, "url": "https://www.sfgate.com/bayarea/article/Airbnb-asks-people-to-donate-money-to-hosts-15407730.php", "via": "", "real_tags": ["asks", "airbnb"]}, {"category": "", "categoryclass": "", "imagename": "4e5f9ec18465dde3b54437f443197288.jpg", "infoid": 1011996, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果在欧盟第二高法院赢得上诉后被告知，它将不必向爱尔兰补缴130亿欧元(116亿英镑)的税款。\n在此之前，欧盟委员会(European Commission)在2016年做出了针对这家美国科技巨头的创纪录裁决。\n欧盟总法院(General Court)表示，它已经宣布这一决定无效，因为欧盟委员会没有证明苹果违反了竞争规则。\n这对欧盟来说是一个打击，因为欧盟希望打击所谓的避税行为。\n然而，它有权向欧洲最高法院--欧洲法院提出上诉。\n苹果在一份声明中表示，这起案件不是关于我们交了多少税，而是我们被要求在哪里纳税。我们很自豪能成为世界上最大的纳税人，因为我们知道纳税在社会中扮演的重要角色。\n爱尔兰政府也对这一裁决提出上诉，称其一直明确表示，苹果没有受到任何特殊待遇。\n征收了正确数额的爱尔兰税……。符合爱尔兰正常的税收规则。\n提起此案的欧盟竞争事务专员玛格丽特·维斯特格(Margrethe Vestager)表示，她将研究这一判决，并反思下一步可能采取的行动。\n欧盟委员会(European Commission)提起这一诉讼之前，声称爱尔兰允许苹果将其在欧盟的几乎所有收入归因于一家仅存在于纸面上的爱尔兰总部，从而避免了为欧盟收入缴税。\n然而，爱尔兰政府辩称，苹果不应该偿还税款，认为为了让该国成为大公司的吸引力之地，它的损失是值得的。\n爱尔兰是欧盟公司税率最低的国家之一，也是苹果在欧洲、中东和非洲的基地。\n在周三的裁决中，总部位于卢森堡的总法院站在了这一立场上，称没有足够的证据表明苹果获得了优惠待遇。\n这项裁决可能会给欧盟打击其他涉嫌企业避税案件的努力带来坏消息。\n维斯特格女士在任的大部分时间都在为反对她认为是反竞争的税收计划而奔走。然而，去年她在与星巴克的官司中败诉，星巴克被指控欠荷兰3000万欧元的税款。\n品诚梅森律师事务所(Pinsend Masons)合伙人兼税务主管杰森·柯林斯(Jason Collins)表示：苹果的胜诉表明，欧洲法院不愿称有利的税收制度为国家援助，即使这些制度旨在吸引外国投资--前提是它们始终如一地执行规则。\n对于其他一直密切关注此案的多国公民来说，这将是一个非常受欢迎的结果。\n不过，他表示，布鲁塞尔可能会上诉，欧盟解决避税问题的努力将继续下去。", "note_en": "Apple has been told it will not have to pay Ireland €13bn (£11.6bn) in back taxes after winning an appeal at the European Union&#39;s second highest court.\n It follows a record ruling by the European Commission against the US tech giant in 2016.\n The EU&#39;s General Court said it had annulled that decision because the Commission had not proven Apple had broken competition rules.\n It is a blow for the EU which wants to crack down on alleged tax avoidance.\n However, it has the right to appeal the decision to Europe&#39;s highest court, the European Court of Justice.\n  &#34;This case was not about how much tax we pay, but where we are required to pay it,&#34; Apple said in a statement. &#34;We&#39;re proud to be the largest taxpayer in the world as we know the important role tax payments play in society.&#34;\n  The Irish government - which had also appealed against the ruling - said it had &#34;always been clear&#34; Apple received no special treatment.\n &#34;The correct amount of Irish tax was charged... in line with normal Irish taxation rules.&#34;\n EU Competition Commissioner Margrethe Vestager, who brought the case, said she would &#34;study the judgment and reflect on possible next steps&#34;.\n The European Commission brought the action after claiming Ireland had allowed Apple to attribute nearly all its EU earnings to an Irish head office that existed only on paper, thereby avoiding paying tax on EU revenues,\n   However, the Irish government argued that Apple should not have to repay the taxes, deeming that its loss was worth it to make the country an attractive home for large companies.\n Ireland - which has one of the lowest corporate tax rates in the EU - is Apple&#39;s base for Europe, the Middle East and Africa.\n In Wednesday&#39;s ruling, the Luxembourg-based General Court sided with that position, saying there was not enough evidence to show Apple was given preferential treatment.\n  The ruling could spell bad news for EU efforts to crack down on other cases of alleged corporate tax avoidance.\n Ms Vestager has spent much of her time in office campaigning against tax schemes she argued were anti-competitive. However, last year she lost a case against Starbucks which was accused of owing €30m in back taxes to the Netherlands.\n  Jason Collins, partner and head of tax at law firm Pinsent Masons, said: &#34;Apple&#39;s victory shows that European courts are unwilling to call beneficial tax regimes state aid, even when designed to attract foreign investment - provided they apply the rules consistently.\n &#34;This will be a very welcome outcome for other multi-nationals who have been watching this case closely.&#34;\n However, he said Brussels was likely to appeal and EU efforts to tackle tax avoidance would continue.", "posttime": "2020-07-15 19:57:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,苹果,爱尔兰,irish", "title": "苹果公司推翻了130亿欧元的爱尔兰税单", "title_en": "Apple has €13bn Irish tax bill overturned", "transed": 1, "url": "https://www.bbc.com/news/business-53416206", "via": "", "real_tags": ["apple", "苹果", "爱尔兰", "irish"]}, {"category": "", "categoryclass": "", "imagename": "c0e17bdcd1b21a7c86ad86a08b1bbd57.jpg", "infoid": 1011995, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你听说过生酮饮食，一种极低碳水化合物的饮食方式，你可能会把它与争议和另一种肥胖症治疗方法联系在一起。\n媒体上的个人轶事讲述了对抗肥胖症和2型糖尿病的惊人效果。但这项研究没有定论，我们对这种饮食的长期影响知之甚少。许多专业人士警告不要吃脂肪含量太高的饮食。\n然而，研究人员对这种极端高脂肪饮食的兴趣与日俱增。仅在2019年，就写了一千多篇关于这个话题的新研究文章。\n奥斯陆大学医院的研究员兼临床营养学家MagnHild Kverneland说，这些研究不再只关注肥胖和糖尿病。\n她说：“研究人员正在研究诸如帕金森氏症、阿尔茨海默氏症、肌萎缩侧索硬化症、脑瘤、偏头痛和多发性硬化症等疾病。”\n生酮饮食实际上从20世纪20年代就开始用于癫痫的治疗。\n已经知道，如果患者生活在非常严格的饮食中，高达90%的卡路里来自脂肪，而碳水化合物每天的摄入量不到20克，那么他们的癫痫发作通常会明显减少。\n但是，与正常饮食如此不同的饮食是很难遵循的。因此，当治疗这种疾病的有效药物开始出现时，用饮食作为治疗方法就不再流行了。\n几十年来，总共开发了25种不同的抗癫痫药物。但研究也表明，这些药物并不是对每个人都有效。\n“大约三分之一的患者从药物中得不到可接受的缓解程度。这是一个真正的挑战，“Kverneland说。\n这就是为什么研究人员和治疗师们又恢复了旧的饮食养生法。2008年，“柳叶刀神经学”杂志发表了一项突破性的研究，研究对象是那些严重癫痫不能通过药物控制的儿童。\n“研究表明，生酮饮食比继续正常治疗有更好的效果，”Kverneland说。\n现在，这种类型的治疗是挪威为患者提供的治疗的一部分，在儿童得不到足够药物帮助的情况下。这种疗法也越来越多地用于成年人。\nKverneland自己也研究了这种饮食对患有癫痫的成年人是如何起作用的。研究表明，在参与者中，生酮饮食与较少的癫痫发作有关。\n然而，影响是温和的，而且人与人之间存在很大的差异。一些患者表现出明显的改善，而一些患者实际上变得更糟了。\n这些不同结果背后的原因可能是癫痫本身是一种非常多样化的疾病，有很多可能的原因。以及Kverneland和他的同事在去年发表在Epilepsa杂志上的一项研究中发现的另一个令人着迷的事实：\n她说：我们发现生酮饮食影响了成年患者血液中抗癫痫药物的水平。\n不同药物的效果可能不同，但饮食确实似乎降低了至少其中一些药物的效果。\n她说：“对于医生来说，记住这一点很重要，因为这可能也适用于其他医学药物。”\n研究人员还不确定为什么生酮饮食会有这种效果，但她怀疑高脂肪饮食可能会影响肝脏的血液循环率，而肝脏正是药物分解的地方。\n它提醒我们，当我们从正常饮食转变为生酮饮食时，体内实际上正在发生戏剧性的变化，脂肪摄入量增加了一倍或三倍。\n当你停止进食碳水化合物-通常从面包、米饭、土豆、根茎蔬菜、水果、豆类和糖果中获得大量碳水化合物-身体就失去了主要的能量来源-葡萄糖。它是葡萄糖，也就是血糖，通常是身体细胞的燃料。\n当你摄入的碳水化合物都用完了，你的身体就像一辆行驶在高速公路中央的汽车，油箱几乎是空的。\n事实证明，大自然为这样的情况提供了条件。它的车身实际上有点像混合动力车。它有两个平行的能量系统--一个依靠葡萄糖，另一个依靠脂肪。因此，当葡萄糖系统耗尽燃料时，脂肪系统就会接手。\n当身体从食物中耗尽葡萄糖时，它开始消耗储存的脂肪。脂肪酸从体内的脂肪细胞中释放出来，转化为酮体。细胞可以用这些酮代替葡萄糖作为能源。\n“这是一种自然条件，对我们物种的生存起到了推波助澜的作用。从进化的角度看，我们已经很好地适应了这种情况，“Kverneland说。\n当我们的祖先在狩猎或采集水果或其他野生食物时运气不佳，他们不得不忍受几天，甚至几周没有食物。他们仍然需要能够进行身体和精神上的操作，这样他们才能最终获得所需的食物。\n“人体将酮体视为超级燃料。它们每单位比葡萄糖提供更多的能量，“Kverneland说。\n与此同时，身体进行了许多改变，以使这种替代能源系统发挥作用。\n从葡萄糖系统切换到脂肪系统的人在最初的几天或几周内会感到相当疲惫，这是很常见的。但之后身体就会适应新的燃料系统并正常工作。\n此外，似乎身体在这种转变中所做的改变可以对某些疾病产生积极的影响。\n我们对酮体的许多了解都是相当新的。但是人类很早就知道饥饿和禁食对你的健康有积极的影响。\n唯一的问题是，禁食并不是治疗长期疾病的一种有吸引力的方法。这就是生酮饮食的用武之地。\n当你切断身体的碳水化合物供应，而只让脂肪燃烧时，即使你没有挨饿，它也会切换到替代能源系统。\n“生酮饮食令人兴奋的是它模仿了身体对禁食的反应，”Kverneland说。\n正是这个想法导致研究人员在20世纪初将生酮饮食作为癫痫的一种治疗方法进行了试验。事实证明，这个假设是正确的。\n近年来，随着我们更多地了解到当身体以脂肪为主要燃料时会发生什么，研究人员想知道：其他疾病可以用这种特殊的饮食来治疗吗？\n研究人员对这种治疗方法越来越感兴趣的领域之一是阿尔茨海默氏病。\n先前的研究表明，阿尔茨海默氏症患者在脑细胞利用葡萄糖的过程中存在问题。继续汽车的比喻：发动机不能再正常吸收汽油了。\n但也许燃烧脂肪的能量系统还在运转呢？如果是这样的话，它能否通过替代能源系统和超级燃料酮体提供足够的能量来为脑细胞提供燃料？\n一些小规模的研究已经完成，轻度或中度阿尔茨海默病患者遵循生酮饮食或服用含有酮体的补充剂。根据2018年发表在“神经治疗学”杂志上的一篇综述，这种方法对症状显示了积极的效果。\n但这种治疗并不是对每个人都有效，可能是因为我们有不同的基因。研究人员需要做更多更大规模的研究，才能确定任何事情。\n根据神经治疗学综述，包括ALS在内的几种神经疾病也有有趣的结果。\n肌萎缩侧索硬化症，或肌萎缩侧索硬化症，与身体能量转换系统的紊乱以及大脑和神经系统对葡萄糖的吸收有关。动物研究表明，生酮饮食可以减缓或改善症状。\n其他研究表明，生酮饮食也可能有助于多发性硬化症和帕金森氏症。\n根据神经治疗学评论，几项研究表明，生酮饮食可以帮助偏头痛和丛集性头痛的人。\n然而，在这种情况下，能源供应很可能不是问题。癫痫和偏头痛同时出现症状的原因之一是神经细胞往往太容易发出信号。\n以前的研究表明，酮体似乎调节神经递质-细胞用来将信号从一个神经细胞发送到另一个神经细胞的物质。\n根据2017年发表在“神经科学”杂志上的一篇综述，一些关于人类的研究表明，生酮饮食可以对偏头痛发作产生快速效果。\n但是文档远远不够好。在这方面也需要更多的研究，以显示这种饮食是否对病人有效，以及它在身体中实际是如何起作用的。\n最近，生酮饮食被证明有效果的一个领域也是如此--癌症。\n研究人员知道，许多不同的癌细胞依赖于葡萄糖作为能源。\n从那时起，下一步是显而易见的：你能通过去除癌症的燃料来源来饿死它，同时用来自脂肪的能量保持身体健康细胞的存活吗？\n已经对细胞和动物进行了几项研究，表明生酮饮食可以有显著的效果，特别是与化疗和放射治疗等传统治疗相结合时。\n研究人员在2019年发表在《分子代谢》杂志上的一篇综述中写道，这种饮食似乎增强了一些癌症治疗的效果，并保护患者免受一些癌症患者经历的严重体重减轻的影响。\n研究人员得出结论，到目前为止的研究结果表明，生酮饮食可以帮助治疗各种癌症。\n然而，几位癌症医生此前曾警告癌症患者停止这种极端的饮食。他们担心限制饮食会使生活变得困难，患者会难以摄入足够的食物。\n我们也不知道这种饮食可能对哪些类型的癌症有帮助。也有研究表明没有任何效果，一些动物研究表明，这种饮食甚至会加剧癌症。\n总而言之，现在就断言生酮饮食在不同疾病的治疗中可能起到什么作用，以及它对身体有什么影响，还为时过早。\n例如，一些研究表明，生酮饮食可以抑制炎症，而炎症通常是各种疾病的标志。\n其他研究表明，特殊饮食会导致肠道菌群的变化。许多研究表明，肠道微生物在各种疾病中起着重要作用。\n饮食的改变可能看起来很平凡，因为它们与食物有关，而且是我们自己可以做的事情。但将生酮饮食视为一种药物可能更合适。\n这是一种有医学效果的治疗方法。但要遵循这一点可能会非常苛刻。此外，这种饮食可能有副作用，在最坏的情况下可能是危险的。\n例如，众所周知，生酮饮食会导致消化问题，增加低密度脂蛋白(LDL)胆固醇，这与心脏病的风险更高有关。\n根据2016年发表在“神经生物学老化”杂志上的一项研究，当挪威研究人员让细胞能量周转受损的小鼠接受生酮饮食时，这些动物的病情实际上在治疗后变得更糟。\n就像任何药物一样，生酮饮食的作用因人而异。\nKverneland说，生酮饮食对癫痫的影响有很大的个体差异。当挪威的患者尝试这种饮食时，他们会得到彻底的指导和随访。\n她说：“我们会验血，并监测疗效和副作用。”“有些人看到了真正令人惊叹的效果。那么每个人都很开心。但每个病人的反应是不同的。“。\n“如果我们能预测到谁会看到效果，那就太好了。我希望我们能在这方面做更多的研究。“她说。\nI.D.Meira等人：生酮饮食和癫痫：我们到目前为止所知道的，神经科学前沿，2019年1月。\nD.D.Weber等人：癌症治疗中的生酮饮食--我们的立场是什么？分子新陈代谢，2020年3月。总结。\nM.Kverneland等人：改良的阿特金斯饮食和抗癫痫药物在患有抗药性癫痫的成人中的药代动力学相互作用，癫痫，2019年11月。总结。\nM.Kverneland等人：改良阿特金斯饮食对成人耐药灶性癫痫的影响：一项随机临床试验，癫痫，2018年6月。总结。\nT.J.W.McDonald，M.C.Cervenka：成人神经疾病的生酮饮食，神经治疗学，2018年10月。总结。\nP.Barbanti等人：偏头痛的生酮饮食：理论基础、发现和前景，神经科学，2017年5月。总结。\nK.H.Lauritzen等人：生酮饮食加速小鼠的神经退化，并在前脑诱导线粒体DNA毒性，神经生物学of Aging，2016年12月。总结。", "note_en": "If you have heard of the ketogenic diet, an extreme low carb approach to eating, you may associate it with controversy and an alternative treatment for obesity.\n Personal anecdotes in the media tell about astounding effects against obesity and type 2 diabetes. But the research is inconclusive, and we know very little about long term effects of such a diet. Many professionals warn against a diet which is so high in fat.\n Nevertheless, there is a growing interest in this extreme high-fat diet among researchers. In 2019 alone, more than a thousand new research articles were written on the topic.\n And these studies are no longer solely focused on obesity and diabetes, says researcher and clinical nutritionist Magnhild Kverneland at Oslo University Hospital.\n “Researchers are looking at diseases such as Parkinson&#39;s, Alzheimer&#39;s, ALS, brain tumours, migraines and multiple sclerosis,” she said.\n    The ketogenic diet has actually been used in the treatment of epilepsy since the 1920s.\n It had been known that patients often had significantly fewer seizures if they lived on a very strict diet, where up to 90 per cent of calories came from fat and carbohydrate intake was less than 20 grams a day.\n But a diet that is so different from normal is hard to follow. So when effective medicines began to emerge for the disease, using diet as a treatment went out of fashion.\n Over the decades, a total of 25 different anti-epilepsy drugs have been developed. But research has also shown that these medicines do not work for everyone.\n “About a third of patients don’t get an acceptable level of relief from the medicines. That’s a real challenge,” Kverneland said.\n  This is why researchers and therapists have brought back the old diet regimen. In 2008, the journal The Lancet Neurology published a ground-breaking study of children whose severe epilepsy couldn’t be controlled with medication.\n “The study showed that the ketogenic diet had a much better effect than continuing with treatment as normal,” says Kverneland.\n Now this type of treatment is part of what patients are offered in Norway, in situations where children don’t get enough help from medicines. The treatment is also increasingly used in adults.\n Kverneland herself has studied how the diet works for adults with epilepsy.  The study showed that a ketogenic diet was associated with fewer seizures in participants.\n However, the impact was moderate, and there was a big difference from person to person. Some patients showed significant improvement, while some actually got worse.\n The reason behind these varied results is likely that epilepsy itself is a very varied disease, with many possible causes. As well as another fascinating fact which Kverneland and collegues discovered in a study  which was published in the journal Epilepsa last year:\n   &#34;We found that the ketogenic diet affected the level of anti-epileptic drugs in the blood of adult patients,&#34; she said.\n The effect is probably different for different drugs, but the diet did appear to reduce the effect for at least some of them.\n “It’s important for doctors to keep this in mind, because it may also be true for other medical drugs,” she said.\n The researcher is not yet sure why the ketogenic diet has this effect, but she suspects a high-fat diet is likely to affect the blood circulation rate in the liver, which is where medicines are broken down.\n And it&#39;s a reminder of the dramatic changes that are actually happening in the body when we switch from a normal diet to a ketogenic diet, where fat intake is doubled or tripled.\n  When you stop eating carbohydrates – which you usually get in large amounts from bread, rice, potatoes, root vegetables, fruits, beans and sweets – the body loses its main source of energy, glucose. It is glucose – blood sugar – which usually fuels your body’s cells.\n When all the carbohydrates you have consumed are gone, your body is like a car in the middle of the highway, where the fuel tank is nearly empty.\n  Turns out nature provides for situations like this. The body is actually built a bit like a hybrid car. It has two parallel energy systems – one that runs on glucose, and one that runs on fat. So when the glucose system runs out of fuel, the fat system takes over.\n   As the body runs out of glucose from food, it begins to consume its fat stores. Fatty acids are released from the fat cells in the body and are converted into ketone bodies. Cells can use these ketones as an energy source, instead of glucose.\n “This is a natural condition that has contributed to the survival of our species. Evolutionally, we are well adapted to it,” says Kverneland.\n When our ancestors had bad luck hunting or gathering fruits or other wild foods, they had to endure days, maybe weeks without food. They still needed to be able to operate both physically and mentally so that they could eventually get the food they needed.\n   “The body sees ketone bodies like a super fuel. They provide more energy per unit than glucose,” says Kverneland.\n At the same time, the body makes many changes to allow this alternative energy system to work.\n It is common for people who switch from the glucose system to the fat system to feel quite tired during the first days or weeks. But then the body gets used to the new fuel system and works normally.\n In addition, it appears that the changes the body makes during this shift can have positive effects on some diseases.\n   Much of what we know about ketone bodies is quite new. But humans have long known that hunger and fasting can have a positive effect on your health.\n  The only problem is that fasting is not an attractive way to treat a long-term illness. That’s where the ketogenic diet comes in.\n When you turn off the body’s supply of carbohydrates and instead only give it fat to burn, it will switch over to the alternative energy system, even if you aren’t starving.\n “What’s exciting about the ketogenic diet is that it mimics the body&#39;s reaction to fasting,” says Kverneland.\n It was precisely this idea that led researchers to test the ketogenic diet as a treatment for epilepsy, in the early 1900s. And it turned out that the hypothesis was correct.\n And in recent years, as we have learned more about what happens when the body uses fat as its primary fuel, researchers have wondered: Can other diseases be treated with this special diet?\n  One of the areas where researchers are increasingly interested in this approach to treatment is Alzheimer&#39;s disease.\n  Previous research has suggested that people with Alzheimer&#39;s have problems with the processes that allow glucose to be used by brain cells. To continue with the car analogy: The engine can no longer take in gasoline properly.\n But maybe the energy system that burns fat still works? If so, could it provide enough energy to fuel brain cells via the alternative energy system and the super-fuel ketone bodies?\n A few small studies have been done where people with mild or moderate Alzheimer&#39;s have followed a ketogenic diet or taken supplements containing ketone bodies. The approach has shown positive effects on symptoms, according to  a review published in the journal Neurotherapeutics in 2018.\n But the treatment did not work for everyone, perhaps because we have different genes. Researchers need to do more and larger studies before they can say anything for sure.\n  There have also been interesting results for several neurological disorders, including ALS, according to the Neurotherapeutics review.\n ALS, or amyotrophic lateral sclerosis, is linked to disorders in the body’s energy conversion system and uptake of glucose by the brain and nervous system. Animal studies have suggested that a ketogenic diet may slow down or improve symptoms.\n Other studies have suggested that a ketogenic diet might also help with multiple sclerosis and Parkinson&#39;s disease.\n   According to the Neurotherapeutics review, several studies have shown that a ketogenic diet can help people who get migraines and cluster headaches.\n In this situation, however, it’s likely that energy supply isn’t the problem. One of the reasons for symptoms in both epilepsy and migraines is that nerve cells tend to send signals too easily.\n Previous studies have shown that ketone bodies appear to regulate neurotransmitters — the substances that cells use to send signals from one nerve cell to the next.\n Some studies on humans suggest that the ketogenic diet can have a rapid effect on migraine attacks, according to a  2017 review published in the journal Neurological Sciences.\n But the documentation is far from good enough. Here too, more studies are needed, to both show whether the diet actually works on sick people, and how it actually works in the body.\n The same is true of a recent area where ketogenic diets have been shown to have an effect — cancer.\n  Researchers know that a number of different cancer cells depend on glucose as an energy source.\n From there, the next step is obvious: Could you starve a cancerous tumour by taking away its fuel source, while keeping the body’s healthy cells alive with energy from fats?\n Several studies have been done on cells and animals suggesting that a ketogenic diet can have a significant effect, especially in combination with traditional treatments such as chemotherapy and radiation therapy.\n  The diet appears to enhance the effect of some cancer treatments, as well as protect patients from the severe weight loss that some cancer patients experience, researchers wrote in a  review published in Molecular Metabolism in 2019.\n The researchers concluded that the findings to date suggest the ketogenic diet can help with a variety of cancers.\n However, several cancer doctors have previously warned cancer patients to stop with this extreme diet. They are concerned that the restrictive diet will make life difficult, and that patients will have trouble consuming enough food.\n We also do not know which types of cancer the diet might help with. There are also studies that show no effect, and some studies in animals have indicated that the diet can even aggravate cancer.\n  All in all, it&#39;s too early to say for sure what role the ketogenic diet could play in the treatment of different diseases, and what effects it has on the body.\n  For example, some studies have shown that a ketogenic diet can curb inflammation, which is often a hallmark of a variety of diseases.\n Other studies show that the special diet leads to changes in the gut flora. Much research has suggested that the gut microorganisms play an important role in various diseases.\n  Dietary changes can seem mundane, because they concern food and are something we can do on our own. But it may be more appropriate to think of the ketogenic diet as a drug.\n It’s a treatment that has medical effects. But it can be very demanding to follow. In addition, the diet can have side effects that in the worst case can be dangerous.\n For example, it is known that the ketogenic diet can cause digestive problems and increase LDL cholesterol, which is linked to a higher risk of heart disease.\n And when Norwegian researchers put mice, whose cells&#39; energy turnover had been damaged, on a ketogenic diet, the animals actually got worse from the treatment,  according to a 2016 study in the journal Neurobiological Aging.\n And much like any drug, the ketogenic diet will work differently from person to person.\n Kverneland says there are large individual differences in the effect of the ketogenic diet on epilepsy. When patients in Norway try the diet, they receive thorough guidance and follow-up.\n “We take blood tests and monitor the effects and side effects,” she said. “Some see a truly amazing effect. Then everyone is happy. But the response is different from patient to patient.”\n “What would be nice would be if we could predict who is going to see an effect. It&#39;s something I hope we can do more research on,” she said.\n   I. D. Meira, et al:  Ketogenic Diet and Epilepsy: What We Know So Far, Frontiers in Neuroscience, January 2019.\n D. D. Weber, et al: Ketogenic diet in the treatment of cancer – Where do we stand? Molecular Metabolism, March 2020.  Summary.\n M. Kverneland et al: Pharmacokinetic Interaction Between Modified Atkins Diet and Antiepileptic Drugs in Adults With Drug-Resistant Epilepsy, Epilepsia, November 2019.  Summary.\n M. Kverneland, et al: Effect of Modified Atkins Diet in Adults With Drug-Resistant Focal Epilepsy: A Randomized Clinical Trial, Epilepsia, June 2018.  Summary.\n T. J. W. McDonald, M. C. Cervenka: Ketogenic Diets for Adult Neurological Disorders, Neurotherapeutics, October 2018.  Summary.\n P. Barbanti et al: Ketogenic Diet in Migraine: Rationale, Findings and Perspectives, Neurological Science, May 2017. Summary.\n K. H. Lauritzen, et al: A ketogenic diet accelerates neurodegeneration in mice with induced mitochondrial DNA toxicity in the forebrain, Neurobiology of Aging, December 2016.  Summary.", "posttime": "2020-07-15 19:34:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "饮食,carb", "title": "极低碳水化合物饮食可以当药吃吗？", "title_en": "Can an extreme low carb diet be used as medicine?", "transed": 1, "url": "https://sciencenorway.no/diseases-food-and-diet/can-an-extreme-low-carb-diet-be-used-as-medicine/1708291", "via": "", "real_tags": ["饮食", "carb"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1011994, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当您在网站中导航时，此网站使用Cookie来改善您的体验。在这些cookie中，被归类为必要的cookie存储在您的浏览器上，因为它们对于网站的基本功能的工作至关重要。我们还使用第三方cookie来帮助我们分析和了解您如何使用本网站。只有经过您的同意，这些Cookie才会存储在您的浏览器中。您还可以选择退出这些cookie。但是选择不使用这些cookie可能会对您的浏览体验产生影响。", "note_en": "This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience.", "posttime": "2020-07-15 19:34:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "iphone,apple,苹果,durov,cookie", "title": "Pavel Durov想要一项法律，让苹果允许iPhone用户安装其他应用商店", "title_en": "Pavel Durov wants a law to make Apple allow iPhone users install other app store", "transed": 1, "url": "https://androidrookies.com/telegram-developer-wants-a-law-to-make-apple-allow-iphone-users-to-install-apps-from-other-app-stores/", "via": "", "real_tags": ["iphone", "apple", "苹果", "durov", "cookie"]}, {"category": "", "categoryclass": "", "imagename": "3724017f78745d3a2d7ab1ed1ec9ae9d.jpg", "infoid": 1011993, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "像任何其他软件开发人员一样，阿尔瓦罗·贾斯滕过去醒着的大部分时间都是在屏幕前度过的，他坐在椅子上四处走动，同时编写代码，处理数据库和处理电子表格。但自从第一批新冠肺炎病例在他的祖国巴西萌芽以来，贾斯滕的日常生活发生了重大变化。他现在全职工作，没有报酬，这曾经是一个小的附带项目，现在已经成为衡量大流行对他国家影响的全面来源。\n同事和推特追随者都知道@turicas在2018年创立了他的非营利性组织Brasil.IO，旨在让巴西的公共数据更容易获得。现在，他正专注于关于该国这种新型冠状病毒的信息(或缺乏信息)，该国是大流行的中心之一。\n“如果我醒着，很可能是在工地上工作。周六、周日、节假日，“他告诉世界其他地区。他以一种用户友好的格式发布名单-该国公职或企业主的候选人-开始了他的网站。\n目前，该网站的新冠肺炎系列以独立的每日监测州和市的细分案例为特色。40多名志愿开发人员和数据爱好者参与该项目，收集更新、识别模式并创建数据集。\n收集数据可能是一项困难的手动任务。志愿者们的工作范围覆盖了巴西5000多个城市。贾斯滕解释说：“有时候，数据只在内部系统中可用，我们必须请求它。”或者数据可用，但格式不容易处理。挑战在于如何将这些海量的信息--可以是大的电子表格或松散的PDF格式--转换成更轻便的文件或用户友好的表格和图形。\n到2018年，数据透明度在巴西已经走过了很长一段路。自1985年军事统治结束以来，该国见证了一些突破，比如2011年批准了类似于美国信息自由法(Freedom Of Information Act)的《信息获取法》(Access Of Information Law)。\n但像巴西开放知识组织(Open Knowledge Brasil)执行董事费尔南达·坎帕努奇(Fernanda Campagnucci)这样的专家表示，数据透明度并不是博尔索纳罗政府的优先事项。相反，它似乎更喜欢一种不言而喻的政策，隐藏、质疑或删除任何与其叙述不符的数据。她告诉世界其他地区：“一种限制获取[信息]的姿态正在取得进展，这不是巴西的典型做法。”\n这些努力是从去年开始的。2019年4月，博尔索纳罗政府在毒品信息网站上关闭了巴西观察站，该网站显示了人口中非法使用毒品的数量。后来，在8月份，巴西国家空间研究所所长因显示亚马逊7月前两周的森林砍伐与去年同期相比增加了68%而受到抨击而被解雇。今年早些时候，政府削减了全国人口普查的预算，这导致了一项将人口调查问题减少近三分之一的提议。\n冠状病毒大流行将这一非正式政策公之于众。根据贾斯滕的说法，解决这一差距成了“生存问题”。一旦他注意到巴西政府的网站下线了几个小时，然后又拿到了不完整的数据集，他就对巴西政府的数据产生了怀疑。该网站还花了大约两个月的时间才发布了按城市分类的数据。\n贾斯滕的怀疑被证明是正确的。随着新冠肺炎感染人数呈指数级增长，新冠肺炎统计官方网站于2020年6月5日下线。当一个新版本上线时，它只显示了过去24小时的数字，累积的数据也不见了。三天后，该部被迫在最高法院的命令下恢复网站。\n随着新冠肺炎数据中断的消息传开，巴西.IO的每日独立访问量从4,000人飙升至30,000人。与此同时，卫生部的紧张局势沸腾起来：与博尔索纳罗的分歧导致两名前任部长离职；反过来，总统任命了一名军队将领担任临时部长。政府还将新冠肺炎的每日新闻发布会从下午5点推迟。至晚上10点。以康复患者人数为首的保密新闻稿，被广泛认为是试图阻止他们出现在黄金时段的新闻广播和纸质报纸上。\n随着戏剧性事件牵涉到行政部门，独立的数据收集者继续他们的工作。他们使用了一个信息网络，该网络将巴西的全民医疗系统与其流行病学监测部门整合在一起。当当地的医生从包括新冠肺炎在内的一系列疾病中发现一个病例时，他们会向卫生部的监测人员报告。然后，每个州都会整合这些数据，并发布每日向公众开放的流行病学公告。坎帕努奇说：“如果各州停止这样做，像巴西.IO的新冠肺炎项目这样的倡议将无法存在。”\n当按预期运行时，该集成系统可对地方和联邦一级的卫生紧急情况做出快速反应。在2015年寨卡病毒流行期间，这一点至关重要，当时它发现了小头畸形症病例最初的激增，这是一种婴儿出生时头部比正常情况下更小的情况。这使得巴西的研究人员能够及早确定寨卡病毒感染和新生儿小头畸形症之间的联系。“小头畸形症只是冰山一角。巴西流行病学家韦纳·维埃拉(Wayner Vieira)说。\n在开发Brasil.IO时，Justen和他的团队将这个集成系统融入到他们的工作中。在当地卫生部门的帮助下，志愿者小组覆盖了特定的州。每天，机器人都会向志愿者发送最新消息。志愿者单独工作，将最新信息上传到Brasil.IO的平台上。如果它们的数量不匹配，系统就会发出警报。在巴西这样的国家，官方统计数据中的这种差异相对常见。各国在一天中的不同时间发布流行病学公告，甚至使用不同的方法。“有时(地方政府)发布PDF文件或图片，或者数字是新闻稿的一部分，”贾斯滕告诉“世界其他地方”。“将这一过程自动化是非常困难的。”\n巴西IO团队对新冠肺炎的数据封锁感到震惊，于是在推特上发布了他们的综合报告，作为联邦公告的替代方案。第一份报告是在6月6日，也就是停电后不久发布的，当时还不清楚联邦政府是否会恢复对新冠肺炎迄今收集的累积数据的访问。“我们的工作是倡导各国政府开放数据，因为这是他们的责任。独立的倡议(如Brasil.IO)之所以出现，只是因为政府未能做到这一点，“Campagnucci说。\n在机器人和数十名志愿者的帮助下，截至7月11日，Brasil.IO到目前为止已经发布了36份公告。他们加入了其他组织要求提高透明度的呼声。\n随着巴西新冠肺炎病例的数量继续上升-截至7月8日，已有超过170万人-甚至连总统博尔索纳罗的新冠肺炎检测也呈阳性，独立的数据收集人员还有很长的路要走。Brasil.IO继续建立数据集，现在计划研究大流行对该国的经济影响。贾斯滕说：“许多可用的信息仍然不容易被外行管理，除非他们是数据分析方面的专家。”在这种情况下，就好像数据根本不可用一样。\n喜欢我们的故事吗？在Facebook、Twitter(@RestofWorld)和Instagram上关注世界其他地区，让我们知道我们在做什么。\n我们每周的时事通讯为您提供第一时间访问我们的最新故事、趋势预测和对来自世界各地的技术的分析。今天就报名吧。", "note_en": "Like any other software developer, Álvaro Justen used to spend most of his waking hours in front of a screen, moving around in his chair, while writing code, working with databases, and processing spreadsheets. But since the first Covid-19 cases sprouted in his native Brazil, Justen’s routine changed significantly. He now works full time, without pay, on what was once a small side project that has become the comprehensive source for measurements of the pandemic’s impact in his country.\n @turicas, as colleagues and  Twitter followers know Justen, founded his nonprofit  Brasil.IO in 2018 as an initiative to make public data in Brazil more accessible. Now, he is focusing on information — or lack thereof — about the novel coronavirus in the country, one of the pandemic’s epicenters.\n “If I’m awake, I’m probably working on the site. On Saturdays, Sundays, holidays,” he told  Rest of World. He started his site by publishing lists —  candidates for public office or  business owners in the country — in a user-friendly format.\n Currently, the site’s  Covid-19 series features an independent daily monitor of cases with breakdowns by state and city. More than 40 volunteer developers and data enthusiasts work on the project, gathering updates, identifying patterns, and creating datasets.\n  Collecting data can be a difficult, manual task. The volunteers work to cover more than 5,000 Brazilian cities. “Sometimes, data is only available in internal systems, and we have to request it,” Justen explained. “Or the data is available, but not in an easy format to work with.” The challenge is to turn these massive tranches of information — which can come in large spreadsheets or loose PDFs — into lighter files or user-friendly tables and graphics.\n By 2018, data transparency had come a long way in Brazil. Since the military rule ended in 1985, the country has witnessed breakthroughs like the 2011 approval of the  Access to Information Law, akin to the U.S. Freedom of Information Act.\n But experts, like Fernanda Campagnucci, executive director of  Open Knowledge Brasil, say that data transparency is not a priority for the Bolsonaro administration. Instead, it seems to prefer an unspoken policy to conceal, question, or take down any data that doesn’t agree with its narrative. “A posture toward restraining access [to information] is gaining ground, which was not typical of Brazil,” she told  Rest of World.\n These efforts began last year. In April 2019, the Bolsonaro administration took down the Brazilian Observatory on Drug Information’s website, which showed the number of illicit drug use among the population. Later, in August, the director of the  Brazilian National Institute for Space Research was fired after  coming under attack for showing that Amazon deforestation increased 68% in the first two weeks of July when compared to the same time period in the previous year. Earlier in the year, the government  cut the national census’ budget, which led to a proposal to reduce population survey questions by almost a third.\n  The coronavirus pandemic threw this informal policy out in the open. Addressing this gap became a “matter of survival,” according to Justen. He grew skeptical of the numbers from the Brazilian government, once he noticed its site going offline for a few hours and coming back up with incomplete datasets. The site also took about two months to publish breakdowns by city.\n Justen’s suspicions turned out to be right. As the number of Covid-19 infections grew exponentially, the  official government website for Covid-19 statistics went offline on June 5, 2020. When a new version went live, it featured only numbers from the past 24 hours, and the cumulative data were gone. Three days later, the ministry was forced to restore the website on the orders of the Supreme Court.\n    As news of the Covid-19 data  blackout spread, the number of unique daily visitors to Brasil.IO skyrocketed from 4,000 to 30,000. Meanwhile, tensions at the Ministry of Health boiled over: Disagreements with Bolsonaro had led two  previous ministers to leave their posts; the president, in turn, appointed an army general as interim minister. The government also pushed back its daily Covid-19 press briefing from 5 p.m. to 10 p.m. hush-hush  press releases that led with the numbers of recovered patients, which was widely suggested to be an attempt to stop them from being  featured in prime-time news broadcasts and print newspapers.\n As drama embroiled the executive branch, independent data collectors continued their work. They did so using an information network  that integrates Brazil’s universal healthcare system with its epidemiological surveillance department. When doctors on the ground identify a case from a list of diseases, including Covid-19, they report it to a monitor at the Ministry of Health. Each state then consolidates the data and publishes daily epidemiological bulletins that are open to the public. “If states stopped doing that, an initiative like Brasil.IO’s Covid-19 project would not be able to exist,” Campagnucci said.\n When operating as intended, this integrated system responds quickly to local- and federal-level health emergencies. It was crucial during the 2015 Zika epidemic, when it uncovered the initial surge in cases of microcephaly, a condition in which a baby is born with a smaller head than normal. That allowed researchers in Brazil to identify, early on, the link between Zika infection and microcephaly among newborns. “Microcephaly was only the tip of the iceberg. And the response to it was praiseworthy,” said Wayner Vieira, a Brazilian epidemiologist.\n While developing Brasil.IO, Justen and his team incorporated this integrated system into their work. Groups of volunteers covered specific states, with the help of local health departments. Every day, a bot sends the volunteers updates. Volunteers work separately to upload the most recent information into Brasil.IO’s platform. If their numbers don’t match, the system sends out an alert. In a country like Brazil, such differences in official statistics are relatively common. States publish epidemiological bulletins at different times of the day or even use different methodologies. “Sometimes [local governments] publish a PDF file or an image, or the numbers are part of a press release,” Justen told  Rest of World. “Automatizing this process is very hard.”\n Alarmed by the Covid-19 data blackout, the Brasil.IO team posted its consolidated reports on Twitter as an alternative to the federal bulletins. Its  first one came out on June 6, immediately after the blackout, when it was still unclear whether the federal government would restore access to the cumulative data gathered for Covid-19 thus far. “Our work is to advocate for governments to open data because this is their responsibility. Independent initiatives [like Brasil.IO] emerge only because the government fails to do so,” Campagnucci said.\n With the help of bots and dozens of volunteers, as of July 11, Brasil.IO has published 36 bulletins so far. They have joined other organizations’ calls for better transparency.\n As the number of Covid-19 cases in Brazil continues to rise — as of July 8, it was over 1,700,000 people  —  and even president Bolsonaro  tested positive for Covid-19,  independent data collectors have a long way to go. Brasil.IO continues to build datasets and now plans to research the pandemic’s economic impact in the country. “A lot of the available information still cannot be easily managed by laypeople, unless they are experts in data analysis,” Justen said. “In this case, it is as if the data was not available at all.”\n Like our stories? Follow Rest of World on  Facebook,  Twitter (@RestofWorld) and  Instagram,  and let us know how we’re doing.\n  Our weekly newsletter offers you first access to our latest stories, trend-spotting, and analysis on tech from around the world. Sign up today.", "posttime": "2020-07-15 19:13:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,开发商,blackout,数据", "title": "在巴西政府封锁了新冠肺炎的官方数据后，数十名志愿者开发商正在努力确保这些信息是公开的", "title_en": "After a data blackout of official COVID-19 figures by the Brazilian government, dozens of volunteer developers are working to ensure the information is public", "transed": 1, "url": "https://restofworld.org/2020/brazil-data-transparency-covid19/", "via": "", "real_tags": ["开发", "开发商", "blackout", "数据"]}]