[{"category": "", "categoryclass": "", "imagename": "e0b4fd931c95e3b0a2d9b194d4041539.jpg", "infoid": 1029161, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有关微软和GameStop合作的细节已经浮出水面，该零售商将从其门店销售的游戏机产生的所有数字收入中分得一杯羹。\n这项协议一直有传言，但投资顾问DOMO Capital Management通过Twitter声称，它已经收到GameStop的确认：该连锁店将为这一代人带来的Xbox生态系统的客户获得所有下游收入的一部分。\n从本质上说，如果客户从GameStop的任何分支机构购买了他们的Xbox Series X或S，零售商将从用户购买的每一次数字购买中分得一杯羹，无论是完整游戏下载还是可下载内容。\nDomo甚至声称，如果DLC是从Xbox商店购买的，那么DLC就适用于从另一家零售商购买的实体基础游戏。\n这也延伸到二手Xbox Series X和S游戏机，GameStop向微软报告其销售的每一台游戏机。\n目前还不清楚索尼是否存在类似的安排。Biz已经联系了GameStop以获取更多信息。\n本月早些时候，GameStop宣布与微软建立多年战略合作伙伴关系。虽然协议的大部分集中在后端服务上，比如将帮助运营商店的基于云的商业应用程序，但也有一行暗示了这一数字收入份额。\n公告写道，GameStop和微软都将从Xbox生态系统中每位游戏玩家的客户获取和终身收入价值中受益。\n对于这家苦苦挣扎的零售商来说，这可能是一条宝贵的生命线，它在向数字分销的转变和当前游戏机生命周期的长度下遭受了打击。大流行也对这项业务产生了影响。\n上个月，该公司将计划在本财年结束前关闭的门店数量增加到400至450家之间。", "note_en": "Details have emerged about a partnership between Microsoft and GameStop that will see the retailer receive a share of all digital revenues generated by a console sold in their stores.\n The agreement has been rumoured, but investment advisor DOMO Capital Management claimed  via Twitter that it had received confirmation from GameStop: the chain will get a share of all downstream revenue for customers it brings into the Xbox ecosystem this generation.\n Essentially, if a customer has purchased their Xbox Series X or S from any GameStop branch, the retailer will get a share of each digital purchase the user makes, whether its full-game downloads or downloadable content.\n DOMO even claims this applies when the DLC is being purchased for a  physical base game that was bought at another retailer, providing the DLC is being bought from the Xbox store.\n This also  extends to pre-owned Xbox Series X and S consoles, with GameStop reporting to Microsoft every unit that it sells.\n It&#39;s unclear whether a similar arrangement exists with Sony.  GamesIndustry.biz has reached out to GameStop for more information.\n Earlier this month, GameStop announced a  multi-year strategic partnership with Microsoft. While the bulk of the agreement focuses on back-end services, such as cloud-based business applications that will help run the stores, there was a line hinting at this digital revenue share.\n &#34;GameStop and Microsoft will both benefit from the customer acquisition and lifetime revenue value of each gamer brought into the Xbox ecosystem,&#34; the announcement reads.\n It could be a valuable lifeline to the struggling retailer, which has suffered under the shift towards digital distribution and the length of the current console lifecycle. The pandemic has also had an impact on the business.\n Last month, it  increased the number of stores it planned to close by the end of the fiscal year to between 400 and 450.", "posttime": "2020-10-16 08:46:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,微软,分享,share,gamestop", "title": "微软将在其销售的每台Xbox上与GameStop分享数字收入", "title_en": "Microsoft Will Share Digital Revenues With GameStop On Every Xbox It Sells", "transed": 1, "url": "https://www.gamesindustry.biz/articles/2020-10-15-microsoft-will-share-digital-revenues-with-gamestop-on-every-xbox-it-sells", "via": "", "real_tags": ["microsoft", "微软", "分享", "share", "gamestop"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029160, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Svelte是一种全新的构建用户界面的方法。传统框架(如Reaction和Vue)的大部分工作都是在浏览器中完成的，而Svelte则将这些工作转移到编译步骤中，该步骤在构建应用程序时会发生。\nSvelte不使用虚拟DOM区分等技术，而是编写代码，当应用程序的状态发生变化时，这些代码会自动更新DOM。\nNpx desit sveltejs/template my-svelte-project#或下载并解压缩此.zip文件cd my-svelte-project npm install npm run dev。\n默认情况下，CSS是组件作用域-不再有样式冲突或专用性之战。或者，您可以使用您最喜欢的CSS-in-JS库。", "note_en": "Svelte is a radical new approach to building user interfaces. Whereas traditional frameworks like React and Vue do the bulk of their work in the  browser, Svelte shifts that work into a  compile step that happens when you build your app.\n  Instead of using techniques like virtual DOM diffing, Svelte writes code that surgically updates the DOM when the state of your app changes.\n  npx degit  sveltejs/template my-svelte-project\t # or download and extract  this .zip file\tcd my-svelte-project\tnpm install\tnpm run dev\n  CSS is component-scoped by default — no more style collisions or specificity wars. Or you can  use your favourite CSS-in-JS library.", "posttime": "2020-10-16 08:41:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "控制论,cybernetically,svelte", "title": "Svelte：控制论增强的Web应用", "title_en": "Svelte: Cybernetically Enhanced Web Apps", "transed": 1, "url": "https://svelte.dev/", "via": "", "real_tags": ["控制论", "svelte"]}, {"category": "", "categoryclass": "", "imagename": "56c463053863ea0809699188cc9c9707.jpg", "infoid": 1029159, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "马斯洛想要了解人们的动机是什么，为了实现这一目标，他研究了人们的各种需求，并根据这些需求创建了一个层次结构。当时的想法是，属于金字塔末端的需求是赤字需求/基本需求(生理、安全、爱/归属感、尊重)，而属于金字塔顶端的需求是增长需求(自我实现)。\n一个人必须先满足较低层次的基本需求，然后才能继续满足较高层次的增长需求。一旦这些需求得到合理的满足，一个人就可以达到被称为自我实现的最高水平。\n对这一理论最强烈的批评是基于这一理论的形成方式。为了给自我实现下一个定义，马斯洛确定了18个人为自我实现者，并研究了他们的特点，这是一个非常小的比例。其次，还有一些艺术家、哲学家没有满足基本的需要，却表现出自我实现的迹象。\n我在课堂上学到的一个有趣的理论是，一个人的位置和身份如何影响他/她所做的工作。马斯洛来自资本主义国家美国，因此他的模型从不考虑群体动力或社会方面。\n受访者回答了与马斯洛模型非常相似的六个需求：基本需求(食物、住所)、安全、社会需求(爱、支持)、尊重、掌握和自主。他们还通过三个不同的衡量标准对自己的幸福感进行了评级：生活评价(一个人对自己生活的整体看法)，积极的感觉(每天的快乐或快乐)，以及消极的感觉(每天的悲伤、愤怒或压力)。\n这项研究的结果支持了这样的观点，即无论文化差异如何，普遍的人类需求似乎都是存在的。然而，层次结构内的需求排序不正确。\n“虽然最基本的需求在你没有的时候可能会得到最多的关注，”迪纳解释说，“但你不需要为了[从其他人]得到好处而去满足它们。”例如，即使我们饿了，我们和朋友在一起也可以很开心。“它们就像维生素，”迪纳在谈到这些需求是如何独立发挥作用时说。“我们需要他们所有人。”\n曼弗雷德·马克斯-尼夫(Manfred Max-Neef)是智利经济学家。他将该模型定义为对人类需求的分类，以及社区可以根据这些需求被满足的方式来确定他们的“财富”和“贫穷”的过程。\n他将需求描述为在所有文化和历史时期都是恒定的。随时间和跨文化变化的是满足这些需求的方式。根据该模型，人类需要被理解为一个系统，即它们是相互关联和相互作用的。\n违规者：声称满足了需求，但实际上却使满足需求变得更加困难。\n伪满足者：声称满足了一种需求，但实际上对真正满足这种需求几乎没有效果。\n压抑满足者：那些过度满足某一特定需求的人，这反过来又严重抑制了满足其他需求的可能性。\n单一满足者：只满足一种特殊需求。这些在满足其他需求方面是中性的。\n协同满足者：满足特定需求的同时，有助于满足其他需求。\n有趣的是，马克斯-尼夫来自智利，这是一个社会主义国家，因此他的模型在考虑整个社会时更具包容性。\n嗨，这篇文章是我在斯里什蒂艺术、设计与技术学院学习设计引领创新时写的一系列文章的一部分。它们是对我在这段时间里学习或读到的东西的反思，我期待着您能提供的任何反馈或批评。：)", "note_en": "Maslow wanted to understand what motivated people , in order to accomplish that he studied the various needs of people and created a hierarchy out of those needs. The idea was that the needs that belong towards the end of the Pyramid are Deficit Needs/ Basic Needs (Physiological, safety, love/belonging, esteem) and the ones that belong to the top of the pyramid are Growth Needs (Self Actualization).\n One must satisfy lower level basi c needs before progressing on to meet higher level growth needs. Once these needs have been reasonably satisfied, one may be able to reach the highest level called self-actualization.\n  The strongest criticism of this theory is based on the way this theory was formed. In order to create a definition of Self Actualization, Maslow identified 18 people as Self Actualizers and studied their characteristics, this is a very small percentage of people. Secondly there are artists, philosophers who do not meet the basic needs but show signs of Self Actualization.\n One of the interesting ways of looking at theories that I learned in class was how a person’s place and identity impacts the work he/ she does. Maslow was from US, a capitalist nation, therefore his model never looks at group dynamics or the social aspect.\n  Respondents answered questions about six needs that closely resemble those in Maslow’s model: basic needs (food, shelter); safety; social needs (love, support); respect; mastery; and autonomy. They also rated their well-being across three discrete measures: life evaluation (a person’s view of his or her life as a whole), positive feelings (day-to-day instances of joy or pleasure), and negative feelings (everyday experiences of sorrow, anger, or stress).\n The results of the study support the view that universal human needs appear to exist regardless of cultural differences. However, the ordering of the needs within the hierarchy was not correct.\n “Although the most basic needs might get the most attention when you don’t have them,” Diener explains, “you don’t need to fulfill them in order to get benefits [from the others].” Even when we are hungry, for instance, we can be happy with our friends. “They’re like vitamins,” Diener says about how the needs work independently. “We need them all.”\n    Manfred max- Neef is a Chilean Economist. He defines the model as a taxonomy of human needs and a process by which communities can identify their “wealths” and “poverties” according to how these needs are satisfied.\n He describes needs as being constant through all cultures and across historical time periods. The thing that changes with time and across cultures is the way that these needs are satisfied. According to the model human needs are to be understood as a system i.e. they are interrelated and interactive.\n     Violators: claim to be satisfying needs, yet in fact make it more difficult to satisfy a need.\n Pseudo Satisfiers: claim to be satisfying a need, yet in fact have little to no effect on really meeting such a need.\n Inhibiting Satisfiers: those which over-satisfy a given need, which in turn seriously inhibits the possibility of satisfaction of other needs.\n Singular Satisfiers: satisfy one particular need only. These are neutral in regard to the satisfaction of other needs.\n Synergistic Satisfiers: satisfy a given need, while simultaneously contributing to the satisfaction of other needs.\n It is interesting to note that Max-Neef came from Chile which was a socialist nation and therefore his model was more inclusive by considering society at large.\n Hi, this article is a part of a series of articles I am writing while studying Design Led Innovation at Srishti Institute of Art, Design &amp; Technology. They are meant to be reflections on things I learn or read about during this time.I look forward to any feedback or crit that you can provide. :)", "posttime": "2020-10-16 08:40:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "规模,neef,需求", "title": "马斯洛的需要层次与人类规模发展的最大尼夫模型(2016)", "title_en": "Maslow’s Hierarchy of Needs vs. the Max Neef Model of Human Scale Development (2016)", "transed": 1, "url": "https://medium.com/@hwabtnoname/maslow-s-hierarchy-of-needs-vs-the-max-neef-model-of-human-scale-development-9ebebeabb215", "via": "", "real_tags": ["规模", "neef", "需求"]}, {"category": "", "categoryclass": "", "imagename": "77414f8e4c89b93a400b50248d9c36b5.jpeg", "infoid": 1029158, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这些规则规定了对火箭发射操作员的许可，以及对个别发射和再入计划的批准等。正如你可以想象的那样，这样的规则首先一定很复杂，当它们多年零敲碎打地组装起来，以适应一个快速发展的行业时，情况会更复杂。\n美国交通部长赵小兰(Elaine Chao)称这些修订是“历史性的、全面的更新”。它们整合了四套法规，并将许可和安全规则统一在一个保护伞下，同时允许不同类型的运营商或运营的灵活性。\n可用于支持从潜在的多个发射场位置进行多次发射或重返大气层的单一操作员执照。\n申请人可以通过许可证申请申请安全要素批准，而不需要单独提交申请。\n地面安全监督的范围，以更好地适应安全风险，并减少重复的要求，当在联邦站点操作时。\n在与商业航天行业的领导人交谈时，一个共同的主题是监管的负担。任何简化和统一的改革都可能会受到社会的欢迎。\n实际的规定长达数百页，所以拿到执照并开始发射火箭仍然不是一件简单的事情。但至少您不必同时容纳几组500页的文档。\n新规则已经提交联邦登记册，并将在90天后生效。此外，美国联邦航空局将发布咨询通知征求公众意见-该机构表示，明年可能会有多达24项规则的补充和详细说明。你可以跟上这里的人。", "note_en": "The rules provide for licensing of rocket launch operators and approval of individual launches and reentry plans, among other things. As you can imagine, such rules must be complex in the first place, more so when they’ve been assembled piecemeal for years to accommodate a quickly moving industry.\n U.S. Transportation Secretary Elaine Chao called the revisions a “historic, comprehensive update.” They consolidate four sets of regulations and unify licensing and safety rules under a single umbrella, while allowing flexibility for different types of operators or operations.\n   A single operator’s license that can be used to support multiple launches or reentries from potentially multiple launch site locations.\n   Applicants to apply for a safety element approval with a license application, instead of needing to submit a separate application.\n   Ground safety oversight to be scoped to better fit the safety risks and reduce duplicative requirements when operating at a federal site.\n  In speaking with leaders in the commercial space industry, a common theme is the burden of regulation. Any reform that simplifies and unifies will likely be welcomed by the community.\n The actual regulations are hundreds of pages long, so it’s still hardly a simple task to get a license and start launching rockets. But at least it isn’t several sets of 500-page documents that you have to accommodate simultaneously.\n The new rules have been submitted for entry in the Federal Register, and will take effect 90 days after that happens. In addition, the FAA will be putting out Advisory Circulars for public comment — additions and elaborations on the rules that the agency says there may be as many as two dozen of in the next year.  You can keep up with those here.", "posttime": "2020-10-16 08:22:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "火箭,商业,美国,航空局,streamlines", "title": "\n美国联邦航空局精简商业发射规则以保持火箭飞行", "title_en": "\n\t\t\t\tFAA streamlines commercial launch rules to keep the rockets flying\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/15/faa-streamlines-commercial-launch-rules-to-keep-the-rockets-flying/", "via": "", "real_tags": ["火箭", "商业", "美国", "航空局"]}, {"category": "", "categoryclass": "", "imagename": "eff9ccd9133d3bd1ad2972bbec97b5f5.gif", "infoid": 1029156, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "氢、氘和氦气体分别循环通过约翰逊-马泰净化器，其中包含盘绕的钯银合金管：Pd25Ag(75%Pd和25%Ag)。在D2气体循环过程中，观察到异常产热的证据。然而，在H2和He的循环过程中，很少观察到(H2)或没有(He)异常热事件。在D2气体通过连续管循环数月后，Pd25Ag样品中的铜和铁含量比未暴露的Pd25Ag样品中的铜和铁含量有所增加。在气体循环的Pd25Ag样品中检测到铬、锰和锌，而在未暴露的Pd25Ag样品中没有检测到它们。特别是，在气体循环的Pd25Ag材料中，Zn的存在数量比Cr或Mn都要多。虽然在D2气体循环前，Pd2 5Ag线圈中有少量的铜存在，但在循环后，铜的含量是D2 5Ag线圈的7倍。采用多种材料表征技术获得了试验前和试验后的元素组成。结果表明，新的试验后元素，主要在表面，是在低能下由未知的核机制产生的。\n查看全文", "note_en": "Hydrogen, deuterium, and helium gases were separately cycled through a Johnson-Matthey purifier containing coiled palladium silver alloy tubing: Pd25Ag (75 wt% Pd and 25 wt% Ag). During the cycling of D 2 gas, evidence of anomalous heat production was observed. However, during the cycling of H 2 and He, very little (H 2) or no (He) unusual heat events were observed. After cycling the D 2 gas through the coiled tubing for several months, Pd25Ag samples showed an increase in Cu and Fe compared with the amounts in unexposed Pd25Ag. Chromium, manganese, and zinc were detected in gas-cycled Pd25Ag samples, whereas they were not detected in unexposed Pd25Ag samples. In particular, Zn was present in the gas-cycled Pd25Ag material in larger quantities than either Cr or Mn. Although a small amount of Cu was present in the Pd25Ag coil before the D 2 gas cycling, 7 times more was present after the cycling. Multiple material characterization techniques were used to obtain both pre-test and post-test elemental composition. The results indicate that novel post-test elements, primarily on the surface, were created by unknown nuclear mechanisms at low energy.\n     View full text", "posttime": "2020-10-16 08:17:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "压力,observed,pd25ag", "title": "从压力循环钯观察到的嬗变", "title_en": "Transmutations observed from pressure cycling palladium", "transed": 1, "url": "https://www.sciencedirect.com/science/article/abs/pii/S0360319920333462", "via": "", "real_tags": ["压力", "observed", "pd25ag"]}, {"category": "", "categoryclass": "", "imagename": "4b6eab0adaaa55a0141c870b8c3dc7aa.png", "infoid": 1029155, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "合成生物学是本世纪最受炒作的研究课题之一，2010年它进入了青少年时期。但是，与其说这是一个有问题的时代，不如说我们看到了合成生物学的蓬勃发展，并带来了许多新技术和里程碑式的成就。\n2020年，合成生物学迎来了20岁生日。它的第一个十年见证了一些令人印象深刻的研究论文，许多有远见的思考和前所未有的兴奋，但它的第二个十年-从2010年到2020年-是真正需要用一些真正的成就来取代炒作的时候。那么它是如何做到的呢？\n这十年有了一个很好的开端。回顾2010年，今年最大的合成生物学故事是J·克雷格·文特尔研究所(J.Craig Venter Institute，JCVI)的一个团队1完成了工作细菌基因组的合成。这一里程碑式的成就表明，DNA合成和DNA组装可以扩大到兆基大小，实现了本世纪初的一些最大雄心壮志。然而，仅仅扩大DNA建设并不足以实现该领域的许多其他雄心壮志。2010年，“合成生物学的五个硬真相”(Five Hard Truths For Syntheal Biology)发表，这篇评论文章探讨了工程野心的缺乏如何阻碍了实现可靠性、标准化和自动化设计承诺的努力2。这些确实是该领域面临的问题，“自然通讯”(Nature Communications)首批合成生物学论文之一也强调了这一点。这篇论文显示，当转移到不同的大肠杆菌菌株3中时，一个强大的基因逻辑门失败了。环境、噪音、负担和交叉反应等棘手的生物学问题真的能得到解决，让我们能够像布线电子电路一样设计细胞吗？\n多亏了该领域许多人从事的具有挑战性的技术生物学和生物工程工作，尤其是麻省理工学院的克里斯·沃格特，答案是肯定的。2016年，尼尔森等人发表了Cello，这是一个了不起的端到端计算机辅助设计系统，用于在大肠杆菌4中构建逻辑电路。在过去十年的所有论文中，这可能是最让铁杆合成生物学家满意的，因为它实现了许诺的生物学工程，并通过标准化、特征化和自动化设计实现了这一点。在这篇论文之前的几年里，Voigt的团队不知疲倦地发表了这么多关于大肠杆菌合成生物学的其他基础论文，给我们提供了遗传部件的算法设计，以及部件库的专业特征，这并不是巧合。虽然关注合成生物学的许多具有里程碑意义的重大成就很容易(图1)，但真正帮助该领域实现这一炒作的是大量艰苦的技术工作，以提高我们对基因部分的设计和理解，同时创新和发现新技术，使我们能够比以往任何时候都更好地编写、构建、编辑和共享DNA代码(图2)。\n表中列出了这十年的时间表，并简要总结了每年出版的一些关键研究里程碑。\n图中显示了合成生物学中使用的工程周期，并用卡通说明了一些关键技术和工作方式，这些技术和工作方式现在有助于加速周期的每个阶段。\n事实上，回顾10年来，最令人震惊的是，在那些工程生活中，方法和工具发生了怎样的变化。许多团体仍然依赖于iGEM竞争来交换他们的DNA部分。这些部件只能通过BioBrick克隆进行串行组装，而且这些部件的性能数据很少可靠。构建基因构建是一项缓慢的实验室工作，通常在添加到细胞中时会导致失败。在细胞内一次固定DNA结构的方法严重缺乏，而且需求量很大。因此，合成生物学小组在2011年和2012年首次突袭CRISPR等基因编辑技术也就不足为奇了。自2006年以来，乔治·丘奇的实验室一直在进行一个项目，将大肠杆菌中的每个标签终止密码子突变为TAA，以释放一个密码子，以获得额外的氨基酸5。因此，他们对开发任何可以精确改变细胞内DNA的技术非常感兴趣，这也就不足为奇了。他的团队和他的前博士后在2013年发表了前两篇论文，显示CRISPR被用于真核细胞，并在接下来的几年里开发了CRISPR的许多进一步创新，包括基于CRISPR的基因驱动。加利福尼亚州的合成生物学小组也迅速将CRISPR转变为不仅仅是一种切割工具，发明了现在无处不在的dCas9作为DNA的可编程绑定器，以实现可定制的基因调控6。\n虽然CRISPR无疑是生物科学十年来的突破，但它的前身TALENs(TAL-Effector Nucleases)在改变合成生物学在过去10年中的变化方面可能值得更多赞扬。任何DNA序列和I的模块化、可编程绑定的承诺\n基因合成成本的下降在很大程度上要归功于新的方法，即在芯片上并行打印数千个寡核苷酸，形成“寡核苷酸池”，并将其与下一代测序(NGS)相结合，成为验证组装dna的一种更具成本效益的方法。这两项技术还为人们在合成生物学领域的工作方式打开了一扇门，突然之间，在一次实验7中并行设计、建造和测量数十万个基因设计变得经济高效。如果你能将基因设计的输出与NGS兼容的测量(例如条形码RNAseq)联系起来，那么数据分析就成为你的新瓶颈，而不是像以前那样设计和组装。这导致合成生物学中数学方法和生物学之间的关系在过去十年中发生了重大转变。在本世纪头十年，当制造和测试DNA结构缓慢且昂贵时，数学建模对于预测成败和缩小设计空间是有价值的。现在很少需要这种方法，取而代之的是数学分析在大型数据集的统计分析中找到了价值，并用它来学习如何设计DNA。\n在过去10年中，高功率计算还开辟了可以建模和预测的新领域。在大卫·贝克(David Baker)团队的带领下，蛋白质的合理设计突飞猛进，结束了这十年，成为活酵母细胞基因电路的一部分8。有史以来第一个完整的细胞模型--生殖支原体模型发布，能够模拟数百个基因在一个细胞周期9中的影响。这有助于JCVI的最小基因组项目。2016年，JCVI令人印象深刻地设计出了一种合成基因组10最小化的细菌，这进一步奠定了一个里程碑。\n合成基因组学也进入了真核细胞，国际Sc2.0联盟构建了经过高度修饰但功能齐全的贝克酵母第11号染色体的合成版本。大肠杆菌也以合成基因组结束了这十年，重新设计和构建的基因组去掉了遗传密码12的64个密码子中的3个。这样的重新编码使细胞能够根据需要容易地将非标准氨基酸插入蛋白质中。这是由教会实验室基于突变的方法首创的，该方法在本世纪初将大肠杆菌的使用减少到只使用63个密码子，证明了遗传密码5的扩展。在大肠杆菌中，这种密码的扩展也是通过增加DNA碱基来实现的，而不仅仅是A、T、C和G碱基。\nDNA也成为了一种存储数据的方式，最初只是通过化学合成在体外存储数据，然后也通过“分子记录器”基因系统在细胞生长、分裂和改变基因表达时使用重组酶或CRISPR来修改DNA。细胞中的感应和记录甚至进入了人体，肠道细菌也感应和报告了老鼠体内的事件。基因工程益生菌被制造出来，可以检测尿液中的癌症，而其他细菌则将它们转化为治疗方法，纠正新陈代谢紊乱，感知和摧毁病原体。制药业最热门的基于细胞的疗法，针对癌症的CAR-T细胞，也开始配备合成生物学的传感和逻辑设备。合成生物学的传感和逻辑还发现了更多的医疗应用，包括纸基生物传感器，可以快速设计成检测埃博拉和寨卡病毒13等病原体的RNA。这些传感器和其他最近的应用一样，通过新的模块化方法来设计复杂的核酸相互作用，如脚趾开关，以及通过一种新的“无细胞”方法来进行合成生物学研究，使用细胞裂解物作为细胞内工程14的可定制和可访问的替代方案。\n医疗保健现在可以说已经取代代谢工程成为合成生物学应用的首选，但这也没有阻止这一领域的进展。学术成就包括设计细胞来固定二氧化碳和氮，以及让酵母制造类阿片和大麻素。许多研究所已经建立了生物实验室，它们可以展示细胞的快速工程，以用于数十种不同分子的生物合成15。当然，利用合成生物学进行代谢工程的大部分工作现在都在像Amyris、Genomatica、Ginkgo和Zymergen这样的公司进行。\n回顾这十年，合成生物学的许多研究里程碑和新方向确实令人印象深刻，但作为合成生物学研究人员，最令我们兴奋的是使能技术的进步，因为这些进步揭开了未来的序幕。然而，如果我们要寻找十年来最大的成就，证明2010年该领域的炒作是合理的，那么我们只能看到世界各地数百家合成生物公司的激增和估值。现在存在着一个价值数十亿美元的行业，生产化学品、药物、蛋白质、探针\n5.Lajoie，M.J.等人。基因重新编码的生物体扩展了生物功能。科学342,357-360(2013)。\n6.齐，L.S.等人。将CRISPR重新定位为RNA引导的平台，用于基因表达的序列特异性控制。152号，1173-1183号(2013)。\n7.Cambray，G.，Guimaraes，J.C.&amp；Arkin，A.P.对244,000条合成序列的评估揭示了在大肠杆菌中优化翻译的设计原则。纳特。生物技术。36,1005-1015(2018)。\n8.Ng，A.H.等人。使用从头蛋白开关的模块化和可调生物反馈控制。自然572,265-269(2019年)。\n9.Karr，J.R.等人。全细胞计算模型根据基因型预测表型。电话150,389-401(2012)。\n10.Hutchison，C.A.3.等人。最小细菌基因组的设计和合成。科学351，公元6253(2016)。\n11.Richardson，S.M.等人。一种合成酵母基因组的设计。科学355,1040-1044(2017)。\n12.Fredens，J.等人。具有重新编码基因组的大肠杆菌的全合成。自然569,514-518(2019年)。\n14.Tinafar，A.，Jaenes，K.&amp；Pardee，K.合成生物学无细胞。BMC Biol 17，64(2019年)。\n15.Casini，A.等人。90天内制造10个分子的压力测试：生物工程方法的外部评估。杰姆。化学。SoC。140、4302-4316(2018)。\n我们要感谢每一位在2020年7月参与Twitter讨论的人，他们讨论了过去10年来合成生物学最重要的成就，这些成就帮助形成了这篇文章。此处有指向此对话的链接：https://twitter.com/ProfTomEllis/status/1280982288797446144.。\n开放访问本文按照知识共享署名4.0国际许可进行许可，该许可允许以任何媒介或格式使用、共享、改编、分发和复制，只要您对原始作者和来源给予适当的信任，提供到知识共享许可的链接，并指明是否进行了更改。本文中的图片或其他第三方材料包括在文章的CreativeCommonsLicense中，除非在材料的信用额度中另有说明。如果材料未包含在文章的“知识共享许可”中，并且您的预期用途未得到法定法规的允许或超出了允许的用途，则您将需要直接获得版权所有者的许可。要查看此许可证的副本，请访问http://creativecommons.org/licenses/by/4.0/.。\n提交评论即表示您同意遵守我们的条款和社区指南。如果您发现一些滥用或不符合我们的条款或指导方针，请标记为不适当。", "note_en": "Synthetic biology is among the most hyped research topics this century, and in 2010 it entered its teenage years. But rather than these being a problematic time, we’ve seen synthetic biology blossom and deliver many new technologies and landmark achievements.\n     In 2020 synthetic biology turned 20 years old. It’s first decade saw some impressive research papers, lots of visionary thinking and unprecedented excitement, but its second decade—from 2010 to 2020—was when the hype really needed to be replaced by some real achievements. So how has it done?\n The decade got off to a great start. Looking back at 2010, the biggest synthetic biology story of the year was the complete synthesis of a working bacterial genome by a team at the J. Craig Venter Institute (JCVI)  1. A landmark achievement that showed that DNA synthesis and DNA assembly could be scaled to megabase size, delivering on some of the biggest ambitions from the start of the century. However, just scaling DNA construction would not be enough to deliver the field’s many other ambitions. 2010 also saw the publication of ‘ Five Hard Truths for Synthetic Biology’ a critical article that examined how the lack of progress on engineering ambitions was slowing efforts to deliver on promises of reliability, standardisation and automated design  2. These were indeed problems for the field, and were highlighted in one of the first synthetic biology papers in  Nature Communications which showed a robust genetic logic gate failing when moved into different  E. coli strains  3. Could hard biological problems such as context, noise, burden and cross-reactivity really be solved to allow us to engineer cells like we wire-up electronic circuits?\n Well thanks to a lot of challenging technical biology and biological engineering work undertaken by many in the field, but especially MIT’s Chris Voigt, the answer to this was yes. In 2016 Nielsen et al., published Cello, a remarkable end-to-end computer aided design system for logic circuit construction in  E. coli  4. Of all the papers in the last decade, this is probably the most satisfying for hardcore synthetic biologists as it realises so much of the promised engineering of biology and does so through standardisation, characterisation and automated design. It’s no coincidence that in the years preceding this paper Voigt’s team worked tirelessly on delivering so many other foundational papers on  E. coli synthetic biology, giving us algorithmic design of genetic parts, and professional characterisation of part libraries. While it is easy to focus on the many big landmark achievements of synthetic biology (Fig.  1), what has really helped the field deliver on the hype more than anything else has been a lot of hard technical work to improve our design and understanding of genetic parts alongside innovation and the discovery of new technologies that let us write, build, edit and share DNA code better than ever (Fig.  2).\n A timeline is shown for the decade with brief summaries of some of the key research milestones published for each year.\n Diagram shows the engineering cycle used in synthetic biology (centre) with cartoons illustrating some of the key technologies and ways of working that now help accelerate each phase of the cycle.\n Indeed, looking back 10 years what is most striking is how the methods and tools have changed for those engineering life. Many groups were still reliant on the iGEM competition for exchanging their DNA parts. These could only be assembled serially by BioBrick cloning, and performance data on these parts was rarely reliable. Building a genetic construct was slow lab work and typically resulted in failure when added into a cell. Methods to fix a DNA construct once inside a cell were severely lacking and in high demand. It’s no surprise therefore, that synthetic biology groups were the first to pounce on gene editing technologies like CRISPR as they appeared in 2011 and 2012. Since 2006, George Church’s lab had been pursuing a project to mutate every TAG stop codon to TAA in  E. coli to free up a codon for an extra amino acid  5, and so unsurprisingly they were very interested in developing any technology that can precisely alter DNA inside a cell. His group and his former postdoc published the first two papers in 2013 showing CRISPR being used in eukaryotic cells and developed many further innovations of CRISPR in the following years, including CRISPR-based gene drives. Synthetic biology groups in California were also quick to turn CRISPR into more than just a cutting tool, inventing the now ubiquitous  dCas9 as a programmable binder of DNA to enable customisable gene regulation  6.\n While there’s no doubt that CRISPR was the breakthrough of the decade in biosciences, it’s perhaps its forerunner TALENs (TAL-Effector Nucleases) that deserve more credit in revolutionizing how synthetic biology changed in the past 10 years. The promise of modular, programmable binding of any DNA sequence and an in vivo gene editing method lured many towards this new technology in 2011. But the large highly-repetitive nature of TALENs was a slap in the face for anyone used to standard DNA cloning methods, PCR or even Gibson Assembly. If you wanted to work with TALENs you needed to either buy a lot of synthesised DNA, become an expert in robot-based DNA assembly automation, or get your hands on a Golden Gate Assembly TALEN cloning toolkit from Addgene. Fortunately for synthetic biology, many people in the field tried one, two, or even all three of these things and soon began to see how much faster DNA assembly can proceed. Golden Gate DNA Assembly now rightly dominates the field and the many modular cloning (MoClo) toolkits and genetic part libraries shared via Addgene have transformed the way people work and build upon each other’s findings. Companies and academic institutions have set up dedicated facilities for automated DNA cloning and perhaps most importantly, DNA synthesis costs have fallen to the point where ordering a custom-made gene is now often more cost-efficient than trying to clone it. Such an enabling drop in price cannot be underestimated for how it changes people’s way of working for the better.\n The drop in cost for gene synthesis can mostly be attributed to new methods for printing thousands of oligonucleotides in parallel on chips to make ‘oligo pools’ and teaming this with next generation sequencing (NGS) as a much more cost-effective method for validating assembled DNA. These two technologies also opened the door to a major change in the way people worked in synthetic biology, suddenly making it cost effective to design, build and measure in parallel hundreds of thousands of genetic designs in one experiment  7. If you can tie the output of your genetic design to an NGS-compatible measurement (e.g. barcoded RNAseq) then data analysis becomes your new bottleneck, not design and assembly as before. This has led to a major shift in the relationship between mathematical approaches and biology in synthetic biology over the decade. When making and testing DNA constructs was slow and expensive in the 2000s, mathematical modelling was valuable to predict successes and failures, and to narrow down the design space. Now this approach is rarely needed, and mathematical analysis instead finds its value in statistical analysis of large data sets and using this to learn how to design DNA.\n High-power computation also opened up new frontiers in what can be modelled and predicted in the last 10 years. Rational design of proteins, spearheaded by David Baker’s group, came on leaps and bound, and ended the decade as part of gene circuitry in living yeast cells  8. The first ever whole cell model, for  Mycoplasma genitalium, was released, enabling simulation of the effects of hundreds of genes through a cell cycle  9. This helped inform JCVI’s project towards a minimal genome, which delivered a further landmark in 2016 with the impressive engineering of a bacteria with a minimized synthetic genome  10.\n Synthetic genomics also moved into eukaryotes with the international Sc2.0 consortium constructing highly-modified, yet fully-functional synthetic versions of Baker’s yeast chromosomes  11.  E. coli also ended the decade with a synthetic genome, redesigned and constructed to remove all use of 3 of the 64 codons of the genetic code  12. Such recoding enables cells to be engineered to readily insert non-standard amino acids into proteins as desired. This was pioneered by the Church lab’s mutation-based approach that reduced  E. coli to using only 63 codons earlier in the decade, demonstrating expansion of the genetic code  5. Expansion of this code was also achieved in  E. coli by addition of bases of DNA beyond just A, T, C and G.\n DNA also became a way to store data, initially just in vitro via chemical synthesis, but then also in cells via ‘molecular recorder’ genetic systems that use recombinases or CRISPR to modify DNA as cells grow, divide and change their gene expression. Sensing and recording in cells even went into the body, with gut bacteria sensing and reporting on events inside mice. Engineered probiotic bacteria were made that detect cancer in urine and others turned them into therapies, correcting metabolic disorders and sensing and destroying pathogens. The hottest cell-based therapies in the pharma industry, cancer-targeting CAR-T cells, also started to be equipped with sensing and logic devices from synthetic biology. Sensing and logic with synthetic biology also found further healthcare applications, including paper-based biosensors that could be rapidly designed to detect RNA from pathogens like Ebola and Zika  13. These sensors, along with other recent applications, were enabled by new modular ways to design complex nucleic acid interactions, such as toehold switches, and by a new ‘cell-free’ way to do synthetic biology, using lysates from cells as customisable and accessible alternatives to in-cell engineering  14.\n Healthcare has now arguably replaced metabolic engineering as the go-to for synthetic biology applications, but that has not stopped progress in this area too. Academic achievements include engineering cells to fix CO 2 and nitrogen, and getting yeast to make opioids and cannabinoids. Biofoundries have been established at many institutes and can demonstrate rapid engineering of cells for biosynthesis of dozens of different molecules  15. Of course, much of the work in using synthetic biology for metabolic engineering now happens at companies like Amyris, Genomatica, Ginkgo and Zymergen.\n Looking back on the decade, the many research landmarks and new directions for synthetic biology are indeed very impressive, but as synthetic biology researchers it’s the advances in enabling technologies that excite us the most as these unlock what can come next. However, if we’re to look for the single biggest achievement of the decade that justifies the hype of the field back in 2010, then we can look no further than the proliferation and valuations of the hundreds of synthetic biology companies around the world. A multibillion dollar industry now exists that makes chemicals, drugs, proteins, probiotics, sensors, fertilisers, textiles, food and many other things from engineered cells. And these are not existing companies just buying into synthetic biology, but companies founded, led and grown by the postdocs, PhDs and iGEM students who researched at the bench and in most cases have worked in this field their entire adult lives.\n  1. Gibson, D. G. et al. Creation of a bacterial cell controlled by a chemically synthesized genome.  Science  329, 52–56 (2010).\n  3. Wang, B., Kitney, R. I., Joly, N. &amp; Buck, M. Engineering modular and orthogonal genetic logic gates for robust digital-like synthetic biology.  Nat. Commun.  2, 508 (2011).\n  5. Lajoie, M. J. et al. Genomically recoded organisms expand biological functions.  Science  342, 357–360 (2013).\n 6. Qi, L. S. et al. Repurposing CRISPR as an RNA-guided platform for sequence-specific control of gene expression.  Cell  152, 1173–1183 (2013).\n 7. Cambray, G., Guimaraes, J. C. &amp; Arkin, A. P. Evaluation of 244,000 synthetic sequences reveals design principles to optimize translation in  Escherichia coli.  Nat. Biotechnol.  36, 1005–1015 (2018).\n 8. Ng, A. H. et al. Modular and tunable biological feedback control using a de novo protein switch.  Nature  572, 265–269 (2019).\n 9. Karr, J. R. et al. A whole-cell computational model predicts phenotype from genotype.  Cell  150, 389–401 (2012).\n 10. Hutchison, C. A. 3rd et al. Design and synthesis of a minimal bacterial genome.  Science  351, aad6253 (2016).\n 11. Richardson, S. M. et al. Design of a synthetic yeast genome.  Science  355, 1040–1044 (2017).\n 12. Fredens, J. et al. Total synthesis of  Escherichia coli with a recoded genome.  Nature  569, 514–518 (2019).\n  14. Tinafar, A., Jaenes, K. &amp; Pardee, K. Synthetic biology goes cell-free.  BMC Biol  17, 64 (2019).\n 15. Casini, A. et al. A pressure test to make 10 molecules in 90 days: external evaluation of methods to engineer biology.  J. Am. Chem. Soc.  140, 4302–4316 (2018).\n We wish to thank everyone who engaged with a July 2020 Twitter conversation on the most important achievements in synthetic biology from the last 10 years which helped to shape this article. A link to this conversation is here:  https://twitter.com/ProfTomEllis/status/1280982288797446144.\n    Open Access This article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons license, and indicate if changes were made. The images or other third party material in this article are included in the article’s Creative Commons license, unless indicated otherwise in a credit line to the material. If material is not included in the article’s Creative Commons license and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this license, visit  http://creativecommons.org/licenses/by/4.0/.\n   By submitting a comment you agree to abide by our  Terms and  Community Guidelines. If you find something abusive or that does not comply with our terms or guidelines please flag it as inappropriate.", "posttime": "2020-10-16 08:17:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,合成,synthetic,设计", "title": "合成生物学第二个十年：2010-2020", "title_en": "The second decade of synthetic biology: 2010–2020", "transed": 1, "url": "https://www.nature.com/articles/s41467-020-19092-2", "via": "", "real_tags": ["2020", "合成", "synthetic", "设计"]}, {"category": "", "categoryclass": "", "imagename": "2caa8de92d8e2fa2c3fb3be416af06db.jpg", "infoid": 1029154, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿：今天下午，堪萨斯州威奇托州立大学的航空和导弹司令部司令告诉记者，该大学正在将一架陆军黑鹰直升机一块一块地拆解，扫描每个部件，创建一个详细的三维模型，可以用于3D打印。\n“我们有一架UH-60利马，我们目前正在拆解，”AMCOM首席少将托德·罗亚尔解释说。“(对于每个)部件，他们都在扫描它，制作它的3D模型，并将其放入计算机辅助设计(CAD[Computer-aid Design])文件…中。我们将在几个月后开始收回这些东西。“。\n黑鹰的UH-60L型号到底有多少不同的部件？\n罗亚尔说：“我们预计可能会从中获得大约2万个结构部件。”“我们会看一看，评估每一款”，看看3D打印版本能否安全、经济地取代它。\n陆军物资司令部的其他部门正在进行更大规模的努力。负责维护地面车辆的坦克汽车司令部(TACOM)正在评估大约4.8万个部件是否适合3D打印。通信-电子司令部(CECOM)正在评估大约9.8万人。\nCECOM的指挥官米切尔·基尔戈少将(Mitchell Kilgo)说，CECOM还没有走到三分之一。他说，到目前为止，他们已经评估了31%的部件-超过3万个项目-发现了252个“潜在的加法制造候选者”。这还不到百分之一。\n这为什么这么难呢？3D打印机可以做得足够简单，供小学生使用。但是，如果你试图打印一个在战斗或飞行中可以支撑住的部件，你不能只盯着原件看，然后猜测尺寸进入打印机。即使是详细的蓝图也可能没有包含足够的详细信息，无法将2D图形转换为3D模型以进行打印。\n现在，使用现代数字设计技术的公司理所当然地生产新零件的3D模型，他们经常与政府共享这些模型。例如，TACOM为新的步兵小队车辆提供了这样的数据文件，并计划3D打印一些部件作为概念验证。但是，对于大量的旧零件库存来说，数字模型根本不存在，其中一些可以追溯到几十年前。\n要制作一个没有模型的模型，你需要使用专门的扫描仪-一些是手持的，另一些安装在机械臂上-在三维中绘制每个零件的地图，创建一个CAD文件。\n这只是一个复杂过程中的一个步骤，TACOM的指挥官Darren Werner准将解释道，TACOM负责监督位于罗克岛兵工厂的陆军新的先进制造中心。\n你必须研究和分析部件，以确定哪些部件可能适合3D打印，因为并不是所有的部件都适合。例如，有些部件可能承受了太大的压力，因此最好用单一的实心金属块进行加工，使用传统的“减法”制造，而不是用加法制造，即一层又一层地建立物体。它们可能需要由特殊材料制成，或者经过特殊处理，这是3D打印机还无法处理的。沃纳说，他们可能太大了，现有的打印机无法生产：在岩岛，他们可以打印的最大的东西大约是酒店迷你冰箱的大小。其他部分可能可以打印，但用老式的方式制作更便宜-所以分析中有经济因素，而不仅仅是工程因素。\n一旦您确定了合适的部件，您需要证明3D打印版本将是安全可靠的。将军们在今天的新闻发布会上一致认为，这是这一过程中要求最高、最耗时的部分之一，特别是对于零部件必须符合陆军和联邦航空局飞行安全标准的飞机。\n“一旦你有了3D模型，打印一些东西就相对容易了，”陆军适航认证机构罗亚尔(Royar)说，“但要确保它符合资格标准，那就很难了。”\n一旦你认证了零件，你就可以开始批量3D打印-并进行质量控制，以确保每个副本都符合规格。当您在该特定打印机中打印该特定型号时，输出是否满足所有适当的公差？它每次都会始终如一地这样做吗？看似细微的改变，如给打印机喂入不同批次的金属粉末，会不会造成最终产品的显著差异？\n只有在你满意地回答了所有这些问题之后，你才能将打印的部分发放给维修部队、承包商和陆军仓库，以便与实际的军事装备一起使用。\n尽管存在所有这些障碍，但所有的武装部队，不仅仅是军队，都看到了3D打印的巨大潜力，这使得这一努力是值得的。军方在生产线关闭很久之后，在许多情况下是在原始制造商和他们的供应商倒闭之后，几十年来一直持有设备，所以没有人可以制造特定的部件：军队将不得不资助某人重新制造工具和技术。在其他情况下，一个武器系统运行的一个部件可能是绝对关键的，但每年只有一小部分需要更换，所以工业界以传统方式制造和销售它们的利润率太低了。\n在军事后勤人员最兴奋的情况下，一支处于战斗状态的部队，其补给线受到攻击或完全被切断，可能会按需3D打印自己的维修部件。与其运输堆积如山的不同备件，不知道部队实际需要哪些备件，它可以部署一个3D模型档案，几台打印机，以及用于打印的粉末原料供应。这种战场附加制造有可能将前线部队从漫长的补给线中解放出来，使它们在未来战争设想的快速面向全领域作战中更具机动性。\n联合反小型无人机系统办公室负责人Sean Gainey少将说，建议10月30日向业界简要介绍一份平行的联合需求文件。", "note_en": "WASHINGTON:  Wichita State University in Kansas is taking an Army Black Hawk helicopter apart piece by piece, scanning each component to create a detailed three-dimensional model that could be be used for 3D printing, the head of  Aviation &amp; Missile Command told reporters this afternoon.\n “We have a UH-60 Lima [that] we are currently disassembling,” AMCOM chief  Maj. Gen. Todd Royar explained. “[For each] component, they’re scanning it, making a 3D model of it, putting it in a CAD [Computer-Aided Design] file… We’ll start to get those back in a couple of months.”\n Just how many different components are there in the  UH-60L model of the Black Hawk?\n  “We expect to probably get about 20,000 structural parts, -ish, out of that,” Royar said. “We’ll take a look at it and evaluate every one” to see whether it can be safely and economically replaced with a 3D-printed version.\n Other  branches of Army Materiel Command are conducting even more massive efforts.  Tank-Automotive Command (TACOM), which sustains and maintains ground vehicles is assessing about 48,000 parts for their suitability to be 3D-printed.  Communications-Electronics Command (CECOM) is assessing roughly  98,000.\n   CECOM is not quite one-third of the way through, said its commander,  Maj. Gen. Mitchell Kilgo. So far, he said, they’ve evaluated 31 percent of the parts – over 30,000 items – and found 252 that are “potential candidates for additive manufacturing.” That’s less than one percent.\n Why is this so hard? 3D printers can be made simple enough for schoolkids to use. But if you’re trying to print a part that’ll hold up in battle or in flight, you can’t just eyeball the original and guesstimate the dimensions to enter into the printer. Even a detailed blueprint might not include enough detail to turn the 2D drawing into a 3D model accurate enough for printing.\n    Now, companies that use modern digital design techniques produce 3D models of their  new parts as a matter of course, and they often share these with the government. TACOM has such data files for  the new Infantry Squad Vehicle, for instance, and plans to 3D print some parts as a proof of concept. But digital models simply don’t exist for vast inventories of older parts, some dating back decades.\n To make a model where none exists, you need to use a specialized scanner – some are handheld, others mounted on robotic arms – to map each part in three dimensions, creating a CAD file.\n That’s just one step in a complex process, explained  Brig. Gen. Darren Werner, commander of TACOM, which oversees the Army’s new  Advanced Manufacturing Center of Excellence at Rock Island Arsenal.\n You have to study and analyze parts to identify which might be suitable for 3D printing, because not everything is. For example, some components might come under so much stress that they’re best machined from a single, solid block of metal, using traditional “subtractive” manufacturing, instead of additive manufacturing that builds objects up layer by printed layer. They might need to be made of special materials, or specially treated, in ways that 3D printers can’t yet handle. They might be just too big for the available printers to produce: At Rock Island, Werner said, the largest item they can 3D-print is about the size of a hotel mini-fridge. Other parts might be  possible to print but cheaper to make the old-fashioned way – so there’s an economic element of the analysis, not just an engineering one.\n Once you’ve identified a suitable part, you need to certify that the 3D-printed version will be safe and reliable. That’s one of the most demanding and time-consuming parts of the process, the generals at today’s press conference agreed, especially for aircraft where components must meet Army and FAA  flight-safety standards.\n “It’s relatively easy, once you have a 3D model, to print something,” said Royar, who’s the Army’s airworthiness certification authority, “but to ensure that it meets the qualification standards, that’s hard.”\n Once you’ve certified the part, you can start 3D printing it in bulk – and doing quality control to ensure each individual copy is up to spec. When you print that specific model in that specific printer, does the output meet all the proper tolerances? Does it do so consistently every time? Does a seemingly slight change, like feeding the printer a different batch of powdered metal, cause a significant difference in the final product?\n Only once you’ve answered all these questions satisfactorily can you issue the printed part to maintenance troops, contractors, and Army depots for use with actual military equipment.\n Despite all these hurdles,  all the armed  services, not just the Army, see tremendous potential in 3D printing that makes it worth this effort. The military holds onto equipment for decades, long after the production line has shut down, in many cases after the original manufacturer and their suppliers have gone out of business, so there’s no one out there who  can make a particular part: The Army would have to fund someone to recreate the tooling and techniques. In other cases, a part may be absolutely critical to a weapons system working, but only a handful need replacement every year, so the profit margin for industry to make and sell them the traditional way would be too slim.\n In the scenario that has military logisticians most excited, a unit in combat, its supply lines under attack or cut off altogether, could potentially 3D-print its own repair parts on demand. Instead of transporting an  “iron mountain” of different spares, not knowing which ones the unit will actually need, it could deploy with an archive of 3D models, a few printers, and a supply of powdered feedstock for printing. This kind of battlefield additive manufacturing has the potential to liberate frontline units from long supply lines and make them much more maneuverable in the fast-faced  all-domain operations envisioned for future wars.\n  Recommended  A parallel joint requirements document will be briefed to industry Oct. 30, Maj. Gen. Sean Gainey, head of the Joint Counter Small Unmanned Aerial Systems office, says.", "posttime": "2020-10-16 08:17:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "打印,解剖,scans,部件", "title": "军队解剖黑鹰直升机，扫描零部件进行3D打印", "title_en": "Army Dissects Black Hawk Helicopter, Scans Parts for 3D Printing", "transed": 1, "url": "https://breakingdefense.com/2020/10/army-dissects-black-hawk-helo-scans-parts-for-3d-printing/", "via": "", "real_tags": ["打印", "解剖", "scans", "部件"]}, {"category": "", "categoryclass": "", "imagename": "2b14c051c920016e6225408501338b83.png", "infoid": 1029153, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "全新的闪亮Postgres 13已经发布，现在正是对“Postgres可观测性”图表进行一些更新的时候了。\n新版本包括许多与监视相关的改进，比如新的统计视图和在现有视图中添加的新字段。让我们仔细看看这些。\n进度视图列表已扩展为两个新视图。第一个视图是“PG_STAT_PROGRESS_basebackup”，它帮助观察正在运行的基本备份，并估计它们的进度、ETA和其他属性；第二个视图是“PG_STAT_PROGRESS_ANALYZE”，顾名思义，它监视EXECUTE/ANALYSE操作。\n第三个新视图名为pg_shmem_allocations，应该用于更深入地检查共享缓冲区的使用情况。\n第四个，也是最后一个新视图是与SLRU缓存检查相关的“pgstatslru”。这两个最近添加的视图都有助于回答“Postgres如何使用其分配的内存”这个问题。\n添加了与时间计划相关的新字段，因此，现有的“时间”字段已重命名为“执行时间”。因此，所有依赖pg_stat_语句的监控工具都应该进行相应的调整。\n添加了与WAL相关的新字段-现在可以了解每条语句生成了多少WAL。\n还添加了WAL使用统计信息来解释(添加了WAL关键字)、AUTO_EXPLAIN和AUTOVAUM。WAL使用情况统计信息将附加到日志中(即，如果启用了LOG_AUTOVUPUM_MIN_DURATION)。\nPG_STAT_ACTIVITY有一个新列“LEADER_PID”，它显示并行组领导者的PID，并帮助显式标识后台工作者与其领导者。\n非常感谢为这个新版本做出贡献的许多人，其中包括我的同事Victor Yegorov和Sergei Kornilov，以及那些帮助将Postgres的信息传播到其他社区和地区的人。\n在此浏览器中保存我的姓名、电子邮件和网站，以便下次我发表评论时使用。", "note_en": "New shiny Postgres 13 has been   released  and now it’s the  time for making some updates to “Postgres Observability” diagram.\n  New release includes many improvements related to monitoring, such as new stats views and new added fields to existing views. Let’s take a closer look at these.\n List of progress views has been extended with two new views. The first one is the “  pg_stat_progress_basebackup ” which helps to observe running base backups and estimate their progress, ETA and other properties.  The second view is the “  pg_stat_progress_analyze ” as the name suggests, it watches over execute/analyze operations.\n The third new view is called   pg_shmem_allocations  which is supposed to be used for deeper inspection of how shared buffers are used.\n The fourth, and the last new view is “  pg_stat_slru ” related to the inspection of SLRU caches. Both recently added views are help to answer the question “How Postgres spends its allocated memory”\n   New fields related to time planning have been added, and due to this the existing “time” fields have been renamed to executing time. So all monitoring tools that rely on pg_stat_statements should be adjusted accordingly.\n New fields related to WAL have been added – now it’s possible to understand how much WAL has been generated by each statement.\n WAL usage statistics have also been added to EXPLAIN (added WAL keyword), auto_explain and autovacuum. WAL usage stats are appended to the logs (that is if log_autovacuum_min_duration  is enabled)\n Pg_stat_activity  has a new column “leader_pid”, which shows the PID of the  parallel group leader  and helps to explicitly identify background workers with their leader.\n A huge thank you goes to many who contributed to this new release, among which are my colleagues   Victor Yegorov  and   Sergei Kornilov  and also those who help to spread the word about Postgres to other communities and across geographies.\n    Save my name, email, and website in this browser for the next time I comment.", "posttime": "2020-10-16 08:16:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "观测,observability,相关", "title": "Postgres 13可观测性更新", "title_en": "Postgres 13 Observability Updates", "transed": 1, "url": "https://dataegret.com/2020/10/postgres-13-observability-updates/", "via": "", "real_tags": ["观测", "相关"]}, {"category": "", "categoryclass": "", "imagename": "dea63caa8f1e117a957479e6e763fb93.jpg", "infoid": 1029152, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加拿大前总理贾斯汀·特鲁多周三在接受采访时表示，加拿大致力于保持边境关闭，直到美国控制新冠肺炎。\n他对加拿大全球电视网播出的“聪明启动”节目的主持人说，美国现在不是一个让我们重新开放边境感到舒服的地方。“我们将继续确保加拿大的安全是我们前进的首要任务。我们看到美国和世界其他地方的情况，我们需要继续保持这些边境管制。\n在过去的一周里，13个州-包括与加拿大接壤的阿拉斯加、明尼苏达州、蒙大拿州和北达科他州-在七天的时间里打破了自己的新病例记录。北达科他州与其北部邻国共享310英里长的边境线，报告的病例报告速度比美国任何一个州在春季或夏季最严重的激增时期都快三分之一。\n一名原本健康的25岁内华达州男子成为第一个两次感染新冠肺炎的美国人，这让人进一步怀疑白宫拥护的群体免疫策略的可行性。但在他的案例中，第二次感染引发的症状比第一次更强烈。全球已有20多例确诊的再感染病例。\n虽然加拿大的新冠肺炎感染率远低于美国，但加拿大也未能幸免于第二波病例。\n据加拿大政府称，该国在过去两周报告了近3.1万例新病例和372例死亡。累计起来，它已经有超过19.3万例病例和近9750例死亡。根据《纽约时报》的数据，魁北克省和安大略省的情况最糟糕，魁北克省在过去一周报告了7000多例新病例，安大略省有近5500例。\n特鲁多承认：“我认为第二波浪潮真的让人精疲力竭。”每个人都不得不不断地经历这件事，这是令人沮丧的。我们展示了我们可以齐心协力度过难关，就像我们在春天所做的那样。然后人们习惯了夏天的缓慢燃烧。现在病例再次激增-随着冬天的临近，随着流感季节的临近-我们需要让事情重新得到控制。\n他说，好的一面是，我们现在知道如何比春季更有针对性地做这件事。“我们知道什么样的企业更有可能传播新冠肺炎，什么样的活动。”\n他说，这种方法可以让我们在医学上做正确的事情，保证我们的安全，同时又不会完全破坏人们的经济。\n特鲁多警告加拿大雪鸟要抵制向南旅行寻找更温暖气候的冲动。\n他说：我知道，在佛罗里达州、亚利桑那州、加利福尼亚州和其他一些病毒没有得到控制或没有我们得到控制的地方，有很多人担心边境以南正在发生的事情。围绕着那里超负荷的医疗保健系统和获得医疗保险的挑战-确保你有保险以防发生什么事情-要困难得多。\n他说，旅行建议是政府愿意做的最远的事情。\n最终，如果有人选择旅行，我们不会把他们囚禁在加拿大。他说，这个国家有行动自由，但人们还是必须认识到，他们是在把自己置于危险之中，把亲人置于危险之中。而且，如果他们选择离开这个国家，他们可能不会像我们早先那样拥有合适的医疗保险或遣返航班。", "note_en": "In an interview Wednesday, Canadian Prime Minister Justin Trudeau said his country is committed to keeping the border closed until the United States gets control of COVID-19.\n &#34;The U.S. is not in a place where we would feel comfortable reopening those borders,&#34; he told the hosts of &#34;Smart Start,&#34; which airs on Canada&#39;s Global Television Network. “We will continue to make sure that Canadian safety is top of mind when we move forward. We see the cases in the United States and elsewhere around the world, and we need to continue to keep these border controls in place.&#34;\n   In the past week, 13 states – including Alaska, Minnesota, Montana and North Dakota, which border Canada –  topped their own records for new cases in a seven-day period. North Dakota, which shares a 310-mile-long border with its northern neighbor,  reports cases at a speed one-third faster on a per capita basis than any U.S. state experienced in the worst of the spring or summer surges.\n  An otherwise healthy 25-year-old Nevada man became the first American to  contract COVID-19 twice, casting further doubt on the  viability of the herd immunity strategy espoused by the White House. In his case, the second infection prompted stronger symptoms than the first. There have been more than 20 confirmed cases of reinfection worldwide.\n Although its COVID-19 infection rate is far lower than that of the USA, Canada has not been immune from a second wave of cases.\n  According to the Canadian government, the country reported nearly 31,000 new cases and 372 deaths in the past two weeks. Cumulatively, it has had more than 193,000 cases and almost 9,750 deaths. The provinces of Quebec, which reported more than 7,000 new cases in the past week, and Ontario, which counted nearly 5,500, are in the worst shape,  according to New York Times data.\n &#34;I think this second wave is really exhausting,&#34; Trudeau acknowledged. &#34;It&#39;s frustrating for everyone to have to keep going through this. We showed that we can pull together and get through this, as we did in the spring. Then people got used to the slow burn in the summer. Now that cases are spiking again – with the approach of winter, with the approach of flu season – we need to get things back under control.&#34;\n The upside, he said, is that &#34;we know how to do it in a more targeted way now than in the spring. We know what kinds of businesses are more likely to spread COVID-19, what kinds of activities.&#34;\n That approach, he said, &#34;allows us to do the right things medically and keep us safe while not totally ruining people&#39;s economies.&#34;\n Trudeau warned Canadian snowbirds to resist the urge to travel south in search of warmer climes.\n &#34;I know there&#39;s a lot of people worried about what&#39;s happening south of the border in Florida, Arizona, California and other places where the virus is not under control or less under control than we are here,&#34; he said. &#34;The challenges around the health care system being overloaded down there and access to health insurance – making sure you have coverage in case something does happen – are a lot more difficult.&#34;\n  He said a travel advisory is as far as the government is willing to go.\n &#34;Ultimately, if someone chooses to travel, we&#39;re not going to keep them imprisoned in Canada. There&#39;s freedom of movement in this country,&#34; he said. &#34;Still, people have to recognize they&#39;re putting themselves at risk, putting their loved ones at risk. And they may not have the right kind of health insurance or repatriation flights that we did early on if they choose to leave the country.&#34;", "posttime": "2020-10-16 08:16:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,border,加拿大", "title": "加拿大和美国边境将保持关闭，直到美国控制新冠肺炎", "title_en": "Canada-US border will stay closed until USA gets Covid-19 under control", "transed": 1, "url": "https://www.usatoday.com/story/travel/news/2020/10/15/justin-trudeau-canada-us-border-not-reopening-covid-19/3661758001/", "via": "", "real_tags": ["美国", "border", "加拿大"]}, {"category": "", "categoryclass": "", "imagename": "cbfc7095d2738eb1ffa04e4b56ed769d.jpg", "infoid": 1029151, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "ProPublica是一个调查滥用权力的非营利性新闻编辑室。注册后即可收到我们最重要的新闻。\n上午7点47分。在阵亡将士纪念日周末的周日，杰伊·巴特勒(Jay Butler)博士向亚特兰大疾病控制和预防中心(Centers For Disease Control And Prevention)的同事们发出了一封严厉的电子邮件。\n巴特勒当时是该机构冠状病毒应对项目的负责人，他和他的团队一直在努力制定指导意见，帮助美国人安全地返回礼拜场所，因为他们担心，祈祷和唱赞美诗这两种最大的安慰可能会在每一次呼吸中向空气中排放一种致命的病毒。\n一周前，疾控中心公布了对阿肯色州一座教堂爆发疫情的调查，这起疫情导致4人死亡。该机构的科学期刊最近详细介绍了一场超级传播者活动，在两个半小时的合唱团练习中，61名歌手中有52名发展了新冠肺炎。两人死亡。\n巴特勒是一位有30多年经验的传染病专家，他似乎是领导这项努力的理想人选。作为疾控中心精英疾病侦探之一，他曾帮助联邦调查局调查炭疽袭击事件，并在H1N1流感大流行期间领导疫苗分发，当时供不应求。", "note_en": "ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive  our biggest stories as soon as they’re published.\n  At 7:47 a.m. on the Sunday of Memorial Day weekend, Dr. Jay Butler pounded out a grim email to colleagues at the Centers for Disease Control and Prevention in Atlanta.\n  Butler, then the head of the agency’s coronavirus response, and his team had been trying to craft guidance to help Americans return safely to worship amid worries that two of its greatest comforts — the chanting of prayers and singing of hymns — could launch a deadly virus into the air with each breath.\n  The week before, the CDC had published its investigation of an outbreak at an Arkansas church that had resulted in four deaths. The agency’s scientific journal recently had detailed a superspreader event in which 52 of the 61 singers at a 2½-hour choir practice developed COVID-19. Two died.\n  Butler, an infectious disease specialist with more than three decades of experience, seemed the ideal person to lead the effort. Trained as one of the CDC’s elite disease detectives, he’d helped the FBI investigate the anthrax attacks, and he’d led the distribution of vaccines during the H1N1 flu pandemic when demand far outstripped supply.", "posttime": "2020-10-16 08:16:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "疾控中心,fall,当时", "title": "疾控中心的垮台", "title_en": "The Fall of the CDC", "transed": 1, "url": "https://www.propublica.org/article/inside-the-fall-of-the-cdc/", "via": "", "real_tags": ["疾控中心", "fall", "当时"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029150, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在本文中，我想讲述如何在基于Linux的系统中验证指针。有时候，我们中的任何人都可能偶然发现SIGSEGV[1]：)但是，如果我告诉您可以检查指针是否有效呢？验证指针的技术很少，但在我看来，这一种技术是最好的。让我向您介绍msync()[2]系统调用！这个系统调用是在Linux内核中，从1.3.21开始，在Linux 2.4.19之后，它符合POSIX标准[3]。\n因此，在这个小老手的帮助下，验证指针成为可能。让我们看看这个系统调用的描述。此系统调用旨在将文件与内存映射同步，即使用mmap()[4]系统调用映射的内存。在munmap()[4]系统调用之前调用它，以便在内核分配的内存页释放之前同步文件和内存，这可能很有用。\n让我们看看Linux v5.8[5]中msync()的实际代码：\nUNSIGNED LONG END；struct mm_struct*mm=current-&gt；mm；struct VM_Area_struct*vma；int unmap_error=0；int error=-EINVAL；start=untagged_addr(Start)；IF(FLAGS&amp；~(MS_ASYNC|MS_INVALIDATE|MS_SYNC))转到输出；IF(OFFSET_IN_PAGE(START))转到OUT；IF((FLAGS&amp；MS_ASYNC)&amp；&amp；(FLAGS&AMP；MS_ASYNC)&amp；&amp；(FLAGS&amp；MS_ASYNC)&amp；(FLAGS&amp；MS_ASYNC)&amp；Ms_sync))转出；错误=-ENOMEM；len=(len+~page_ask)&amp；page_ask；end=start+len；if(end&lt；start)转出；error=0；if(end==start)转出；\n在这段代码中，它测试传递给函数的标志是否正常，以及起始地址是否按页面大小对齐。如果其中一个条件为假，则它将返回EINVAL[6]错误。接下来，它根据LEN计算内存块的末尾。基本上，它是从start到start+len分配给内存区的最后一页的最后一个字节之后的地址。之后，它计算结束地址并对其执行基本的健全性检查。值得一提的是，就我们的目的而言，唯一有用的标志是MS_ASYNC。此标志指定对mSync()的调用立即返回并计划更新。现在，让我们继续。\nMmap_read_lock(Mm)；vma=find_vma(mm，start)；for(；；){struct file*file；loff_t fstart，fend；/*仍然开始&lt；结束。*/ERROR=-ENOMEM；IF(！VMA)GOTO OUT_UNLOCK；IF(START&lt；VMA-&gt；VM_START){START=VMA-&gt；VM_START；IF(START&gT；=END)GOTO OUT_UNLOCK；UNMAPHED_ERROR=-ENOMEM；}//...START=VMA-&gt；VM_END；IF((标志&amp；MS_SYNC)&amp；&amp；文件&amp；&amp；(vma-&gt；VM_FLAGS&amp；VM_SHARED){//...}Else{if(start&gt；=end){error=0；goto out_unlock；}vma=vma-&gt；vm_next；}}out_unlock：mmap_read_unlock(Mm)；out：返回错误？：unmap_error；\n这段代码相当复杂，但不需要讨论此代码中的所有分支。开始时，它锁定mm_struct并搜索应该包含起始地址(start&lt；vma-&gt；vm_end)的第一个虚拟内存区(VMA)。在循环中，它将遍历VMA区域，直到它验证该区域从头到尾都在VMA区域内。基本上，这意味着它检查此范围是否在分配的虚拟内存区域中。\n有了我们刚刚获得的所有知识，让我们编写一个函数来检查进程是否分配了内存区。基本上，在此函数中，我们需要根据页面大小对齐指针地址，并调用mSync()系统调用。下面是一个简单的实现：\nInt VALID_POINTER(void*p，size_t len){//获取页面大小并计算页面掩码size_t pagesz=sysconf(_SC_PageSize)；size_t pagemask=~(pagesz-1)；//计算基址void*base=(void*)((Size_T)p)&amp；pagemask)；返回msync(base，len，MS_ASYNC)==0；}。\n下面是VALIDATE_POINTER()函数使用的示例。就是这样！如果您想反馈或讨论这篇文章，欢迎发送电子邮件给我：)。\n#include&lt；sys/mman.h&gt；#include&lt；unistd.h&gt；#include&lt；stdio.h&gt；//检查指针int有效指针(void*p，size_t len){//获取页面大小并计算页面掩码size_t pagesz=sysconf(_SC_PageSize)；size_t pagemask=~(pagesz-1)；//计算基址void*base=(void*)((Size_T)p)&amp；Pagemask)；return mSync(base，len，MS_ASYNC)==0；}int main(){//Map Memory int*p=(int*)mmap(null，sizeof(Int)，prot_read|prot_write，map_private|map_匿名，-1，0)；//如果((void*)p==map_ailed){put(&#34；mmap失败&#34；)；返回1；}//在取消映射内存printf之前检查指针(&#34；在munmap之前检查指针...。&#34；)；if(VALID_POINTER((void*)p，sizeof(P)printf(&#34；Valid\\n&#34；)；Else printf(&#34；无效\\n&#34；)；*p=0x00c0ffee；//如果(munmap((void*)p，sizeof(Int){put(&#34；munmap失败&#34；)；返回1；}//取消映射内存printf后检查指针(&#34；检查munmap后的指针...。&#34；)；if(VALID_POINTER((void*)p，sizeof(*p)printf(&#34；Valid\\n&#34；)；Else printf(&#34；无效\\n&#34；)；//产生SIGSEGV：)*p=0xbaaaaaaad；返回0；}", "note_en": "In this article I want to tell about how to validate the pointer in the Linux based system. Sometimes, any of us could stumble upon the  SIGSEGV  [1] :) But, what if I tell you that it is possible to check whether the pointer is valid or not? There are few techniques to validate a pointer but in my opinion this particular one is the best one. Let me introduce to you the  msync()  [2] system call! This system call is in the the Linux kernel since 1.3.21 and after Linux 2.4.19 it conforms to the POSIX standard  [3] .\n  So, with the help of this little old-timer it becomes possible to validate a pointer. Let&#39;s see the description of this system call. This system call was designed to synchronize a file with a memory map, i.e. memory mapped with the  mmap()  [4] system call. It could be useful to invoke it before the  munmap()  [4] system call, to synchronize the file and memory before the memory page allocated by the kernel would be free.\n  Let&#39;s take a look to the actual code of the  msync() from the Linux v5.8  [5] :\n  unsigned  long end;\t struct mm_struct  *mm  = current - &gt;mm;\t struct vm_area_struct  *vma;\t int unmapped_error  =  0;\t int error  =  -EINVAL;\tstart  = untagged_addr(start);\t if (flags  &amp;  ~(MS_ASYNC  | MS_INVALIDATE  | MS_SYNC))\t\t goto out;\t if (offset_in_page(start))\t\t goto out;\t if ((flags  &amp; MS_ASYNC)  &amp; &amp; (flags  &amp; MS_SYNC))\t\t goto out;\terror  =  -ENOMEM;\tlen  = (len  +  ~PAGE_MASK)  &amp; PAGE_MASK;\tend  = start  + len;\t if (end  &lt; start)\t\t goto out;\terror  =  0;\t if (end  = = start)\t\t goto out;\n  In this snippet it tests whether the flags, which was passed to the function, are fine and that  start address is aligned by the page size. If one of the conditions is false then it will return with  EINVAL  [6] error. Next, it calculates the  end of the memory chunk from the  len. Basically, it is the address after the last byte of the last page allocated for the memory region from  start to  start + len. After that it calculates the  end address and performs the basic sanity checks with it. It would be worth to mention that for our purposes the only useful flag would be  MS_ASYNC. This flag specifies that call to the  msync() returns immediately and an update will be scheduled. Now, let&#39;s continue.\n  mmap_read_lock(mm);\tvma  = find_vma(mm, start);\t for (;;) {\t\t struct file  *file;\t\tloff_t fstart, fend;\t\t /* Still start &lt; end. */\t\terror  =  -ENOMEM;\t\t if ( !vma)\t\t\t goto out_unlock;\t\t if (start  &lt; vma - &gt;vm_start) {\t\t\tstart  = vma - &gt;vm_start;\t\t\t if (start  &gt; = end)\t\t\t\t goto out_unlock;\t\t\tunmapped_error  =  -ENOMEM;\t\t}\t\t // ... \t\tstart  = vma - &gt;vm_end;\t\t if ((flags  &amp; MS_SYNC)  &amp; &amp; file  &amp; &amp;\t\t\t\t(vma - &gt;vm_flags  &amp; VM_SHARED)) {\t\t // ... \t\t}  else {\t\t\t if (start  &gt; = end) {\t\t\t\terror  =  0;\t\t\t\t goto out_unlock;\t\t\t}\t\t\tvma  = vma - &gt;vm_next;\t\t}\t} out_unlock:\tmmap_read_unlock(mm); out:\t return error  ?  : unmapped_error;\n  This snippet is a quite complex, but there is no need to discuss all the branches in this code. At the beginning it locks the  mm_struct and searches the first Virtual Memory Area (VMA) which should contain the start address ( start &lt; vma-&gt;vm_end). In the loop it will iterate over VMA regions until it validate that region from the  start to the  end is inside the VMA regions. Basically, it means that it checks whether this range is in the allocated virtual memory region.\n  With all that knowledge we just got there let&#39;s write a function that will check whether the memory area is allocated by the process or not. Basically, in this function we need to align the pointer address by the page size and call the  msync() system call. Here is a simple implementation:\n  int valid_pointer( void  *p, size_t len){  // Get page size and calculate page mask  size_t pagesz  = sysconf(_SC_PAGESIZE); size_t pagemask  =  ~(pagesz  -  1);  // Calculate base address   void  *base  = ( void  *)(((size_t)p)  &amp; pagemask);  return msync(base, len, MS_ASYNC)  = =  0;}\n  Below is an example of the  validate_pointer() function use. That&#39;s it! If you would like to give feedback or discuss the article you are welcome to  email me :)\n  # include  &lt;sys/mman.h&gt;   # include  &lt;unistd.h&gt;   # include  &lt;stdio.h&gt;   // Check the pointer  int valid_pointer( void  *p, size_t len){  // Get page size and calculate page mask  size_t pagesz  = sysconf(_SC_PAGESIZE); size_t pagemask  =  ~(pagesz  -  1);  // Calculate base address   void  *base  = ( void  *)(((size_t)p)  &amp; pagemask);  return msync(base, len, MS_ASYNC)  = =  0;} int main(){  // Map memory   int  *p  = ( int  *)mmap( NULL,  sizeof( int), PROT_READ  | PROT_WRITE, MAP_PRIVATE  | MAP_ANONYMOUS,  - 1,  0);  // Check whether the mapping was successful   if (( void  *)p  = = MAP_FAILED) { puts(  &#34; mmap failed &#34;);  return  1; }  // Check the pointer before we unmap the memory  printf(  &#34; check pointer before munmap...  &#34;);  if (valid_pointer(( void  *)p,  sizeof(p))) printf(  &#34; valid \\n &#34;);  else printf(  &#34; NOT valid \\n &#34;);  *p  =  0x00c0ffee;  // Unmap the memory   if (munmap(( void  *)p,  sizeof( int))) { puts(  &#34; munmap failed &#34;);  return  1; }  // Check the pointer after we unmap the memory  printf(  &#34; check pointer after munmap...  &#34;);  if (valid_pointer(( void  *)p,  sizeof( *p))) printf(  &#34; valid \\n &#34;);  else printf(  &#34; NOT valid \\n &#34;);  // Produce SIGSEGV :)   *p  =  0xbaaaaaad;  return  0;}", "posttime": "2020-10-16 07:54:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,msync,pointers,start", "title": "使用mSync()Linux系统调用验证指针", "title_en": "Validate pointers with the msync() Linux system call", "transed": 1, "url": "http://si-head.nl/articles/msync", "via": "", "real_tags": ["linux", "msync", "pointers", "start"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029149, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "注册以通过电子邮件接收个性化研究和资源", "note_en": "Register to receive personalised research and resources by email", "posttime": "2020-10-16 07:54:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电子表格,organization,电子邮件", "title": "电子表格中的数据组织(2018)", "title_en": "Data Organization in Spreadsheets (2018)", "transed": 1, "url": "https://www.tandfonline.com/doi/full/10.1080/00031305.2017.1375989", "via": "", "real_tags": ["电子表格", "电子邮件"]}, {"category": "", "categoryclass": "", "imagename": "87f3b328963e2942121498d68a8efe69.png", "infoid": 1029148, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "CRDT扩展为无冲突复制数据类型，它指的是知道如何无冲突合并的一族结构。CRDT有两个主要的亚家族：CvRDT和CmRDT。它们的复制方式不同。CvRDT是基于状态的，这意味着您将通过网络将整个CRDT状态发送给您的同行。相反，CmRDT通过将所有编辑(称为操作)分发到系统中的每个节点来进行复制。\n在这里，我们将快速浏览一下CRDT，为了清晰和简洁，我们将只关注CvRDT(所有的想法仍然适用于CmRDT)。CvRDT结构定义了使状态a和b产生合并状态的合并(a，b)操作。一个简单的例子是GSet(仅增长集)，它的合并是两个集的并集。\nCRDT&#39；都是关于偏序的，要将结构变成CRDT，必须首先在结构的状态空间上定义一种特殊的偏序。您必须小心执行此操作，因为部分顺序还定义了合并的行为方式。例如，让我们看一下在两个插槽中存储多维数据集的类似2元组的结构的状态空间，它的状态空间如下所示：\n要使此结构成为CRDT，我们需要状态空间上满足以下约束的偏序：\n∀s⊆S其中S是状态空间的任何子集的状态空间#...∃lub s和lub s∈S#。集合的最小上界也在状态空间中。\nLub是最小上界操作，它取状态空间的一个子集，并产生大于或等于该子集中所有状态的唯一状态。这里是满足以下约束的部分订单：\n现在假设我们想要合并这个结构的两个实例，那么事实证明我们已经完成了困难的部分，因为偏序告诉我们最终的合并状态是什么。\n合并(a，b)操作与计算集合{a，b}的最小上界完全相同。\n通过1.合并是幂等的，因为以前的状态将低于或等于当前状态，重新合并过时的状态将不起作用。\n使用CRDT与您可能习惯的数据结构略有不同。由于我们可能正在对其他人同时编辑的数据进行操作，因此我们需要确保您的本地编辑仅影响您看到的数据。\n例如，如果您清除地图，我们希望能够说明此清除操作只会影响您知道的地图中的条目。如果您没有正确跟踪编辑的此因果历史记录，最终可能会删除您不知道的数据。例如，丢失数据的一个好方法是这样做：\n您将收到地图CRDT的更新版本，但用户尚未刷新其视图。\n用户选择清除映射的值。所以在CRDT上调用Map：：Clear()。\n此时，您可能已经清除了用户不想清除的数据。要解决此问题，我们需要在Clear操作中包含因果上下文。这个因果上下文是一个矢量时钟(VClock)，它存储用户在决定Map：：Clear()时看到的Map版本。\n首先创建CRDT的一个实例，在本例中我们将使用MVReg(多值寄存器)CRDT。它允许我们存储一个值，并通过保留这两个值来解析并发设置的值。\n要在CRDT中设置值，您需要提供上下文(即使是初始值)，获取上下文的唯一方法是首先从CRDT读取。\n从CRDT读取任何状态都将生成ReadCtx。要从ReadCtx访问值，请使用.val字段。从上面的示例中，我们可以看到寄存器当前没有存储任何值(空VEC)。\n现在，要对注册表进行编辑，您将为要进行的编辑派生相应的上下文，对于删除数据的编辑，您将需要使用.duced_rm_ctx()添加所需的新数据。其中&lt；act_id&gt；是CRDT上正在操作的任何内容的唯一标识符。\n让add_ctx=read_ctx。派生_添加_ctx(123)；设rm_ctx=read_ctx。派生_rm_ctx()；reg.。设置(&#34；值&#34；。To_string()，add_ctx)；//我们使用add conttreg设置寄存器的值。清除(Rm_Ctx)；//我们使用(陈旧的)RM上下文ASSERT_eq！(注册表。Read().val，vec！[&#34；value&#34；。To_string()])//并且我们看到MVReg：：Clear()没有删除新值。\n现在您可能会想，为什么我们在清除寄存器之后会有一个&#34；值。&#34；值&#34；字符串添加了一个AddContext，其中包含一个标记，表示存在来自参与者123的新信息。清除操作使用从读取派生的RmCtx，其中我们没有来自参与者123的此信息，仅删除在读取时看到的从中派生RmCtx的数据。\n您可能落入的另一个陷阱是重用从CRDT的一个部分派生的上下文来编辑CRDT的另一个部分。丢失数据的步骤：\n现在您正在使用从另一个密钥派生的RmCtx，此RmCtx应该只用于删除它读取的相同数据。AddCtx也是如此，它应该只用于覆盖派生它的数据。\n如果您想了解CRDT是如何工作的，我建议您先从HASTRMENGIRLS报告中的自述文件开始。然后，根据您是喜欢阅读论文还是直接跳到源代码示例，查看Riak DT源代码或全面研究CRDT。", "note_en": "CRDT expands to  Conflict Free  Replicated  Data  Type, it refers to a family of structures that know how to  merge without conflicts. There are two main sub-families of CRDT&#39;s: CvRDT and CmRDT. They differ in how they replicate. CvRDT&#39;s are state based, meaning you would ship the entire CRDT state across the network to your peers. CmRDT&#39;s instead replicate by distributing all edits (called Op&#39;s) to each node in your system.\n Here we&#39;ll take a quick look at CRDT&#39;s, for the sake of clarity and brevity, we&#39;ll focusing only on CvRDT (all ideas still apply to CmRDT&#39;s). CvRDT structures define a  merge(a, b) operation which takes states  a and  b produces a merged state. A simple example is the  GSet (grow-only set), it&#39;s  merge is the union of the two sets.\n  CRDT&#39;s are all about partial orders, to turn a structure into a CRDT, you must first define a special kind of partial order over the state space of your structure. You must do this carefully as the partial order also defines how your merge behaves. For example lets take a look at the state space of a 2-tuple like structure that stores cubes in two slots, it&#39;s state space looks like so:\n  To make this structure a CRDT, we need a partial order over the state space that satisfies the folowing constraint:\n ∀ s ⊆ S where S is your state space # for any subset of the state space ...∃ lub s and lub s ∈ S # .. the least-upper-bound of the set is also in the state space\n lub is the Least Upper Bound operation, it takes a subset of the state space and produces a  unique state that is greater than or equal to all states in the subset. Here&#39;s a partial order that satisfies the constraints:\n  Now say we want to merge two instances of this structure, well turns out we&#39;ve already done the hard part as the partial order tells us what the final merged state will be.\n  The  merge(a, b) operation is exactly the same as computing the least-upper-bound of the set  {a, b}.\n   By 1. merge&#39;s are idempotent, since a previous state will be below or equal to the current state, remerging stale states will have no effect.\n   Working with a CRDT is a bit different from datastructures you may be used to. Since we may be acting on data that is concurrently being edited by others, we need to make sure that your local edits only effect the data that you&#39;ve seen.\n  For example, if you clear a  Map, we want to be able to say that this clear operation will only effect entries in the map that you are aware of. If you are not tracking this causal history of your edits correctly, you could end up deleting data that you are not aware of. e.g. a good way to lose data would be to do something like this:\n you receive an updated version of the  Map CRDT but the user has not refreshed their view.\n The user chooses to clear the values of the  Map. So you call  Map::clear() on your CRDT.\n At this point you&#39;ve potentially cleared data that the user didn&#39;t want to clear. To fix this, we need to include a  Causal context with the clear operation. This causal context is a vector clock (VClock) that stores the version of the  Map that was seen by this user when they decided to  Map::clear().\n   First create an instance of the CRDT, we&#39;ll use the MVReg (Multi-Value Register) CRDT for this example. It allows us to store a value and resolves concurrently set values by keeping both values.\n  To set a value in your CRDT, you&#39;ll need to provide a context (even for the initial value), the only way to get a context is to first read from the CRDT.\n  Reading any state from a CRDT will produces a  ReadCtx.to access the value from the  ReadCtx, use the  .val field. From the example above we see the register is currently not storing any values (empty  Vec).\n Now to make your edit to the  reg, you&#39;ll derive the appropriate context for the edit you want to make, for edits that remove data, you&#39;ll need to use  .derive_rm_ctx(), for adding new data you&#39;ll need  .derive_add_ctx(&lt;actor_id&gt;) where  &lt;actor_id&gt; is a unique identifier of whatever is acting on the CRDT.\n let add_ctx  = read_ctx. derive_add_ctx( 123); let rm_ctx  = read_ctx. derive_rm_ctx();reg. set( &#34;Value&#34;. to_string(), add_ctx);  // We set the value of the register using the Add contextreg. clear(rm_ctx);  // We remove using the (stale) Rm context assert_eq!(reg. read().val,  vec![ &#34;Value&#34;. to_string()])  // and we see that the MVReg::clear() did not remove the new value\n Now you may be wondering why we have a  &#34;Value&#34; after we&#39;ve cleared the register. The  &#34;Value&#34; string was added with an  AddContext that included a marker showing that new information from actor  123 was present. The clear operation used an  RmCtx that was derived from a read where we did not have this information from actor  123, only data that was seen at the time of the  read that the  RmCtx was derived from is removed.\n Another trap you may fall into is reusing a context derived from one part of the CRDT to edit another part of the CRDT.Steps to lose data:\n  Now you&#39;re using an  RmCtx derived from another key, this  RmCtx should only be used to remove the same data that it read. Same goes for the  AddCtx, it should only be used to overwrite data that it had been derived from.\n   If you want to learn about how CRDTs work, I suggest starting with the readme from  aphyr&#39;s meangirls repo.Afterwards, either check out the  riak dt source code or  A comprehensive study of CRDTs depending on if you like to read papers or jump straight to source code examples.", "posttime": "2020-10-16 07:54:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,复制,crdt", "title": "一种同时支持状态复制和基于操作复制的锈病CRDT家族", "title_en": "A family of CRDT's supporting both State and Op based replication in Rust", "transed": 1, "url": "https://github.com/rust-crdt/rust-crdt", "via": "", "real_tags": ["rust", "复制", "crdt"]}, {"category": "", "categoryclass": "", "imagename": "f180a9cb5d3aa484eb3195fa218bb7f8.png", "infoid": 1029147, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该方法发表在预印服务器MedRxiv上，能够高精度地从阴性的临床样本以及其他常见的呼吸道病原体(如流感和季节性人类冠状病毒)中区分导致新冠肺炎的SARS-CoV-2病毒。\n该方法直接对新冠肺炎患者的咽拭子进行操作，不需要提取基因组、纯化或扩增病毒，首先用短荧光dna链快速标记样本中的病毒颗粒。然后使用显微镜收集样本的图像，每个图像包含数百种荧光标记的病毒。\n机器学习软件可以快速、自动地识别样本中存在的病毒。这种方法利用了这样一个事实，即不同类型的病毒由于其表面化学成分、大小和形状的不同，其荧光标记也有所不同。\n科学家们与牛津约翰·拉德克利夫医院的临床合作者合作，在新冠肺炎患者样本上验证了这种分析，这些样本通过传统的RTPCR方法得到了确认。\n牛津大学物理系的阿喀琉斯·卡帕尼迪斯教授说：“与其他检测抗体反应延迟或需要昂贵、繁琐和耗时的样本制备技术不同，我们的方法能快速检测出完整的病毒颗粒；这意味着这种检测方法简单、极其快速，而且性价比高。”\n牛津大学的DPhil学生Nicolas Shiaelis说：“我们的检测比其他现有的诊断技术要快得多；不到5分钟的病毒诊断可以使大规模检测成为现实，为控制病毒爆发提供了一种主动的手段。”\n牛津大学皇家学会正式研究员、现供职于华威医学院的尼科尔·罗布博士说：“即将到来的冬季几个月，一个重要的担忧是SARS-CoV-2与其他季节性呼吸道病毒共循环带来的不可预测的影响；我们已经证明，我们的检测方法可以可靠地区分临床样本中的不同病毒，这一进展在下一阶段的疫情中提供了至关重要的优势。”\n研究人员的目标是开发一种集成设备，最终将用于商业、音乐场地、机场等场所的测试，以建立和维护新冠肺炎的自由空间。\n他们目前正在与牛津大学创新中心(OUI)和两名外部商业/财务顾问合作建立一个分支机构，并正在寻求投资，以加速将测试转换为完全集成的设备，以部署为能够检测多个病毒威胁的实时诊断平台。\n他们希望在今年年底前将该公司合并，在2021年初开始产品开发，并在6个月内推出经批准的设备。", "note_en": "The method,  published on the preprint server MedRxiv, is able to differentiate with high accuracy SARS-CoV-2, the virus responsible for COVID-19, from negative clinical samples, as well as from other common respiratory pathogens such as influenza and seasonal human coronaviruses.\n Working directly on throat swabs from COVID-19 patients, without the need for genome extraction, purification or amplification of the viruses, the method starts with the rapid labelling of virus particles in the sample with short fluorescent DNA strands. A microscope is then used to collect images of the sample, with each image containing hundreds of fluorescently-labelled viruses.\n Machine-learning software quickly and automatically identifies the virus present in the sample. This approach exploits the fact that distinct virus types have differences in their fluorescence labeling due to differences in their surface chemistry, size, and shape.\n  The scientists have worked with clinical collaborators at the John Radcliffe Hospital in Oxford to validate the assay on COVID-19 patient samples which were confirmed by conventional RT-PCR methods.\n Professor Achilles Kapanidis, at Oxford’s  Department of Physics, says: ‘Unlike other technologies that detect a delayed antibody response or that require expensive, tedious and time-consuming sample preparation, our method quickly detects intact virus particles; meaning the assay is simple, extremely rapid, and cost-effective.’\n DPhil student  Nicolas Shiaelis, at the University of Oxford, says: ‘Our test is much faster than other existing diagnostic technologies; viral diagnosis in less than 5 minutes can make mass testing a reality, providing a proactive means to control viral outbreaks.’\n Dr Nicole Robb, formally a Royal Society Fellow at the University of Oxford and now at Warwick Medical School, says: ‘A significant concern for the upcoming winter months is the unpredictable effects of co-circulation of SARS-CoV-2 with other seasonal respiratory viruses; we have shown that our assay can reliably distinguish between different viruses in clinical samples, a development that offers a crucial advantage in the next phase of the pandemic.’\n The researchers aim to develop an integrated device that will eventually be used for testing in sites such as businesses, music venues, airports etc., to establish and safeguard COVID-19-free spaces.\n They are currently working with Oxford University Innovation (OUI) and two external business/finance advisors to set up a spinout, and are seeking investment to accelerate the translation of the test into a fully integrated device to be deployed as a real-time diagnostic platform capable of detecting multiple virus threats.\n They hope to incorporate the company by the end of the year, start product development in early 2021, and have an approved device available within 6 months of that time.", "posttime": "2020-10-16 07:53:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,开发,scientists,病毒", "title": "牛津科学家为新冠肺炎开发出极快的诊断测试", "title_en": "Oxford scientists develop extremely rapid diagnostic test for Covid-19", "transed": 1, "url": "https://www.ox.ac.uk/news/2020-10-15-oxford-scientists-develop-extremely-rapid-diagnostic-test-covid-19", "via": "", "real_tags": ["科学家", "开发", "病毒"]}, {"category": "", "categoryclass": "", "imagename": "f8ee9fadf5be6f040bcbae3e2e491473.jpg", "infoid": 1029146, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有报道称，洛杉矶国际机场(LAX)附近有一名身份不明的人乘坐喷气背包飞行-这是两个月内发生的第二起此类事件。\n美国联邦航空管理局(Federal Aviation Administration)表示，周三，在洛杉矶国际机场西北6,000英尺(1,829米)，7英里(11公里)的高空，华航的一名机组人员表示，他们看到似乎有人在喷气背包里。\n喷气背包是一种通常绑在人的背部的装置，它利用气体或液体的喷射推动穿戴者在空中飞行。\n据专家称，它们曾经是科幻小说的领域，近年来已经成为现实。\n美国联邦航空局表示，周三当地时间13：45(格林威治时间20：45)，华航航班报告称，据信有人在喷气背包中飞行。\n美国媒体援引联邦调查局洛杉矶分局发言人劳拉·艾米勒的话说，联邦调查局正在与联邦航空局保持联系，并正在调查多起报道，据目击者称，洛杉矶联邦调查局洛杉矶分局附近的喷气背包中似乎有个人。\n在过去的十年里，世界各地的发明家建造了喷气背包，英国布莱顿的一名男子最近以每小时85.06英里(136.89公里/小时)的速度打破了速度纪录。\n它们还被用来在迪拜和纽约市的自由女神像周围飞行。", "note_en": "There are reports of an unidentified person flying in a jetpack near Los Angeles International Airport (LAX) - the second such incident in two months.\n A China Airlines crew said it saw what appeared to be someone in a jetpack on Wednesday at 6,000ft (1,829m), seven miles (11km) north-west of LAX, the Federal Aviation Administration said.\n    A jetpack is a device usually strapped to a person&#39;s back, which uses jets of gas or liquid to propel the wearer through the air.\n Once the realm of science fiction, they have become a thing of reality in recent years, according to experts.\n  The China Airlines flight reported what it believed to be a person flying in a jetpack at 13:45 local time (20:45 GMT) on Wednesday, the FAA said.\n  &#34;The FBI is in contact with the FAA and is investigating multiple reports of what, according to witnesses, appeared to be an individual in a jetpack near LAX,&#34; FBI Los Angeles Field Office spokeswoman Laura Eimiller was quoted as saying by US media.\n   Inventors around the world have constructed jetpacks in the past decade, with one man in Brighton, in the UK, recently breaking the speed record after travelling at a rate of 85.06 mph (136.89km/h).\n They have also been used to fly around Dubai and the Statue of Liberty in New York City.", "posttime": "2020-10-16 07:36:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "喷气,jetpack,表示", "title": "“穿着喷气背包的人”在洛杉矶机场附近再次发现飞行", "title_en": "'Person In Jetpack' Spotted Flying Again Near LA Airport", "transed": 1, "url": "https://www.bbc.com/news/world-us-canada-54552380", "via": "", "real_tags": ["喷气", "jetpack", "表示"]}]