[{"category": "", "categoryclass": "", "imagename": "49ffc0a2f0a78b54918d6b705f0348c8.jpg", "infoid": 1004662, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Joomla刚刚报告了一起数据泄露事件。这次入侵发生在Joomla Resources Directory的一名成员在亚马逊Web Services S3存储桶上留下了JRD网站resource ces.joomla.org的完整备份之后。\n该文件不仅没有加密，而且还包含至少2700名在JRD网站上注册了个人资料的用户的详细信息。至于JRD网站，它主要由专业人士使用，他们使用它来宣传他们与Joomla相关的技能。\nJRD全站点备份(未加密)存储在第三方公司Amazon Web Services S3存储桶中。这家第三方公司的所有者是一名前团队负责人，在入侵事件发生时，他仍是JRD团队的成员。官方公告称，在入侵事件发生时，现任组长知道这一点。\nJoomla目前正在调查这起入侵事件，目前还不清楚是否有人从AWS S3存储桶服务器下载了数据。在进一步利用漏洞的情况下，可能被滥用的暴露数据包括敏感细节，例如：\n好消息是，数据泄露的影响被认为是低的，因为大多数被泄露的信息已经公之于众。但是，这对于散列密码和IP地址无效，因为它们在入侵之前不是公开的。\nJoomla建议受影响的JRD用户立即更改他们在门户上的密码。如果此密码已在其他服务上重复使用，则这些服务也应更改此密码。后者是作为预防措施，防止黑客使用破解的用户密码进行凭据填充攻击。\n事件发生后，Joomla团队对JRD门户进行了全面的安全审计。\nJoomla的建议写道：“即使我们没有任何有关数据访问的证据，我们也强烈建议在Joomla Resources Directory上拥有账户，并在其他服务上使用相同密码(或电子邮件地址和密码的组合)的人，出于安全原因立即更改密码。”\nJoomla被认为是WordPress的一个很好的替代品。它是一个完全可定制的内容管理系统，全世界数以百万计的企业、组织和个人都在使用它。它的下载量超过200万次。", "note_en": "Joomla has just reported a data breach. The breach occurred after a member of Joomla Resources Directory left a full backup of the JRD site, resources.joomla.org, on an Amazon Web Services S3 bucket.\n Not only was the file not encrypted but it also contained details for at least 2,700 users with registered profiles on the JRD sites. As for the JRD site, it is mainly used by professionals who use it to advertise their Joomla-related skills.\n JRD full site backups (unencrypted) were stored in a third-party company Amazon Web Services S3 bucket. The third-party company is owned by a former Team Leader, still Member of the JRD team at the time of the breach. Known to the current Team Leader at the time of the breach, the official announcement says.\n Joomla is currently investigating the breach, and it’s still unknown whether someone downloaded the data from the AWS S3 bucket server. In case of further exploits, exposed data that can be abused includes sensitive details, such as:\n  The good news is that the impact of the data breach is considered low, as most of the breached information was already publicly known. However, this is not valid for hashed passwords and IP addresses, which were not public prior to the breach.\n  Joomla recommends impacted JRD users change their passwords on the portal immediately. In case this password has been reused on other services, it should be changed for these services as well. The latter is done as a precautionary measure against credential stuffing attacks where hackers use cracked user passwords.\n Following the incident, the Joomla team carried out a full security audit of the JRD portal.\n “ Even if we don’t have any evidence about data access, we highly recommend people who have an account on the Joomla Resources Directory and use the same password (or combination of email address and password) on other services to immediately change their password for security reasons,” Joomla’s  advisory reads.\n Joomla is considered a  great alternative to WordPress. It is a fully customizable content management system used by millions of businesses, organizations, and individuals all over the world. It has over 2 millions downloads.", "posttime": "2020-06-01 22:52:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "joomla", "title": "Joomla数据泄露：Joomla Resources Directory用户曝光", "title_en": "Joomla Data Breach: Joomla Resources Directory Users Exposed", "transed": 1, "url": "https://howtohosting.guide/joomla-data-breach/", "via": "", "real_tags": ["joomla"]}, {"category": "", "categoryclass": "", "imagename": "3232060e9cf952433d37135e43514f83.jpeg", "infoid": 1004661, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周三晚上，挪威首相埃尔娜·索尔伯格(Erna Solberg)在挪威电视上做出了令人震惊的承认：她惊慌失措。一些，甚至大多数，在挪威的封锁中实施的严厉措施现在看起来都走得太远了。有必要关闭学校吗？她若有所思地说。&#34；也许不是。&#34；\n这是一个先发制人的步骤，只有像索尔伯格这样平易近人、脚踏实地的领导人才能逃脱惩罚。她承认，我可能是出于恐惧做出了许多决定，提醒观众那些可怕的画面，然后从意大利涌向他们的屏幕。\n她并不是第一个在挪威得出结论的人，认为关闭学校和幼儿园，让每个人都在家工作，或者将聚会限制在最多五人以内可能是过分的。\n早在5月5日，挪威公共卫生研究所(NIPH)就发布了一份简报，报告称，在3月12日实施封锁时，挪威的繁殖数量-每个感染者平均感染的人数-已经下降到1.1人。3月19日，该指数下滑至1以下。\nNIPH总干事(北约领导人延斯·斯托尔滕贝格的妹妹)卡米拉·斯托尔滕贝格(Camilla Stoltenberg)本月早些时候在接受电视采访时表示：我们现在的评估是，如果不封锁，而是保持开放，但采取感染控制措施，我们本可以达到同样的效果，避免一些不幸的影响。\n没有人怀疑挪威在控制大流行方面的成功。周五，只有30人感染冠状病毒住院，5人使用呼吸机。整个星期只有一人死亡。现在人均死亡人数为每百万人44人，略高于邻国瑞典的十分之一，瑞典已有4971人死亡。\n但这种成功是以令人望而却步的社会和经济代价为代价的。4月份，一个负责对封锁措施进行成本效益分析的专家委员会估计，这些措施每月总共花费挪威270亿克朗(23亿英镑)。根据NIPH的估计，由于只有0.7%的挪威人被感染，人口中几乎没有免疫力。\n专家委员会上周五的结论是，如果出现第二波感染，该国应该避免封锁。\n奥斯陆大学(Oslo University)经济学教授斯泰纳·霍尔登(Steina Holden)告诉“星期日电讯报”(The星期日Telegraph)，委员会主席斯泰纳尔·霍尔登(Steiner Holden)告诉“星期日电讯报”，我们建议采取一种温和得多的方法。我们应该从个人层面的措施开始--我们现在就是这样--如果出现第二波，我们应该在发生这种情况的地方采取措施，如果可能的话，避免在国家层面采取措施。\n报告总结说，挪威目前的策略--使用检测、接触者追踪和家庭隔离来降低感染水平，而不受严格限制--将是最好的。但如果这种压低传播率的策略无法阻止病例激增，那么旨在抑制传播率而不是将其降至1以下的刹车策略将比封锁更可取。\n霍尔登告诉“每日电讯报”，如果有必要在很长一段时间内实行非常严格的限制，那么成本就会比让感染在人群中传播的成本更高。因为那将是非常昂贵的。\n根据这份报告，如果你假设感染者获得免疫力，并且在2023年之前不会开发出疫苗，那么刹车策略的成本将比不稳定的遏制情景低2340亿克朗(200亿英镑)。但这也会导致略高于3000人的死亡。\n霍尔登的委员会在4月份估计，这项措施每月花费67亿克朗(5.2亿英镑)，充其量对感染传播的影响微乎其微。NIPH走得更远，并暗示学校关闭甚至可能增加了传播。\nNIPH的学校感染专家玛格丽特·格雷夫·伊斯达尔(Margrethe Greve-Isdahl)医生告诉“每日电讯报”，如果学校没有关闭，他们可能会在向移民社区的人们宣传卫生和社会距离规则方面发挥作用-移民社区受到的打击不成比例。\n他们可以在学校里学习这些措施，并教导他们的父母和祖父母，所以至少对于这些难以接触到的少数族裔来说，让孩子留在学校可能会有积极的影响。\n3月下旬和4月也有人担心，青少年在学校外传播病毒的次数比他们在学校里传播的时间更多。Greve-Isdahl说，有一大群青少年在一起闲逛，不一定要采取任何预防措施。\n但也许挪威不太可能再次关闭学校的主要原因，无论在未来的感染浪潮中发生什么，都是因为认识到了对最脆弱的学生的影响。\n现在有很多关于它如何对经济和弱势儿童产生负面影响的信息。Greve-Isdahl说，他们的整个护理系统已经有点崩溃了。我认为很难再施加严格的限制。\n挪威似乎已经决定，无论感染再次爆发，第二次封锁都不是可行的。但这并不意味着它的总理有任何遗憾。\n她说：我认为这在当时是正确的。根据我们掌握的信息，我们采取了预防策略。\n她补充说，可能永远不可能知道，挪威实施的哪些封锁措施导致感染人数如此急剧下降(如果有的话)。\n每日电讯报重视您的评论，但恳请所有帖子都是主题、建设性和尊重的。请检查我们的评论政策。", "note_en": "On Wednesday night, Norway&#39;s prime minister Erna Solberg went on Norwegian television to make a startling admission: she had panicked. Some, even most, of the tough measures imposed in  Norway&#39;s lockdown now looked like steps too far. &#34;Was it necessary to close schools?&#34; she mused. &#34;Perhaps not.&#34;\n It was a preemptive step only a leader with Solberg&#39;s folksy, down-to-earth style could get away with. &#34;I probably took many of the decisions out of fear,&#34; she admitted, reminding viewers of the terrifying images then flooding their screens from Italy.\n She is not the first in Norway to conclude that closing schools and kindergartens, making everyone work from home, or limiting gatherings to a maximum of five people might have been excessive.\n As far back as May 5, the Norwegian Institute of Public Health (NIPH) published a briefing note reporting that at the time the lockdown was imposed on March 12, Norway&#39;s reproduction number - the number of people each infected person on average infects - had already fallen to 1.1. It slipped under 1 on March 19.\n &#34;Our assessment now....is that we could possibly have achieved the same effects and avoided some of the unfortunate impacts by not locking down, but by instead keeping open but with infection control measures,&#34; Camilla Stoltenberg, NIPH&#39;s Director General (and the sister of Nato head Jens Stoltenberg) said in a TV interview earlier this month.\n  No one doubts  Norway&#39;s success in bringing the pandemic under control. On Friday, there were just 30 people in hospital with coronavirus and five on a ventilator. Only one person had died all week. The per capita death toll is now 44 per million people, just over a tenth of that seen in neighbouring Sweden, where 4,971 people have died.\n But this success has come at a prohibitive social and economic cost. An expert committee charged with carrying out a cost-benefit analysis into the lockdown measures in April estimated that they had together cost Norway 27bn kroner (£2.3) every month. With only 0.7 per cent of Norwegians infected, according to NIPH estimates, there is almost no immunity in the population.\n The expert committee concluded last Friday that the country should avoid lockdown if there is a second wave of infections.\n &#34;We recommend a much lighter approach,&#34; the committee&#39;s head, Steinar Holden, an Oslo University economics professor, told the Sunday Telegraph.  &#34;We should start with measures at an individual level -- which is what we have now -- and if there’s a second wave, we should have measures in the local area where this occurs, and avoid measures at a national level if that is possible.&#34;\n  Norway&#39;s current strategy -- using testing, contact tracing, and home isolation to keep the level of infections down without heavy restrictions -- would be best, the report concluded. But if this &#39;keep down&#39; strategy fails to prevent a surge in cases, a &#39;brake strategy&#39; which aims to suppress the rate of transmission but not bring it below 1, would be preferable to a lockdown.\n &#34;If it’s necessary to have very strict restrictions for a long time, then the costs are higher than letting the infection go through the population,&#34; Holden told the Telegraph. &#34;Because that would be immensely costly.&#34;\n According to the report, a brake strategy would cost as much as 234bn kroner (£20bn) less than an &#34;unstable keep-down&#34; scenario, if you assume that those infected gain immunity and that no vaccine is developed until 2023. But it would also lead to a little over 3,000 additional deaths.\n  Holden&#39;s committee estimated in April that the measure had cost 6.7 bn kroner (£520m) a month, while at best having &#34;little impact&#34; on the spread of infection. NIPH has gone further, and suggested that school closures may have even increased the spread.\n Margrethe Greve-Isdahl, the doctor who is NIPH&#39;s expert on infections in schools, told the Telegraph that if schools hadn&#39;t been closed, they could have played a role in informing people in immigrant communities - which were hit disproportionately hard by the epidemic - of hygiene and social distancing rules.\n &#34;They can learn these measures in school and teach their parents and grandparents, so at least for some of these hard-to-reach minorities, there might be a positive effect from keeping kids in school.&#34;\n There were also fears in late March and April that adolescents were spreading the virus more out of schools than they would have been in them. &#34;There were large groups of adolescents that were hanging out together and not necessarily following any preventive measures,&#34; Greve-Isdahl said.\n But perhaps the main reason Norway is unlikely to close schools again, whatever happens in future waves of infection, is the recognition of the impact on the most vulnerable pupils.\n &#34;There&#39;s now a lot of information available on how it has impacted negatively on the economy and on vulnerable children. Their whole care system has kind of collapsed,&#34; Greve-Isdahl says. &#34;I think there would be it would be difficult to impose heavy restrictions again.&#34;\n Norway, it seems, has already decided a second lockdown is not the way to go, however much the infection flares up again. But that does not mean its prime minister has any regrets.\n &#34;I think it was the right to do at the time,&#34; she said. &#34;Based on the information we had, we took a precautionary strategy.&#34;\n It will probably never be possible to know, she added, which of the lockdown measures Norway imposed caused the number of infections to drop away so sharply, if any.\n  The Telegraph values your comments but kindly requests all posts are on topic, constructive and respectful. Please review our commenting policy.", "posttime": "2020-06-01 22:51:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,冠状病毒,挪威,norway", "title": "冠状病毒：挪威想知道它是否应该更像瑞典", "title_en": "Coronavirus: Norway wonders if it should have been more like Sweden", "transed": 1, "url": "https://www.telegraph.co.uk/news/2020/05/30/coronavirus-norway-wonders-should-have-like-sweden/", "via": "", "real_tags": ["病毒", "冠状病毒", "挪威", "norway"]}, {"category": "", "categoryclass": "", "imagename": "4e36b9c6fae6db37c6ee573b4f682c46.jpg", "infoid": 1004660, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "澳大利亚政府宣布，将向近40万因算法错误而不公正地背负债务的福利接受者退还7.2亿美元(3.91亿英镑)。由Centrelink(政府提供社会服务福利的机构)运营的自动福利系统，绰号为“机器人债务”，让福利领取者与卡夫卡式的官僚机器对抗，目的是不正当地敲诈他们的现金。\n数千名福利申领人被告知，由于过度申领福利补贴，他们欠政府高达数万美元。然而，在许多情况下，这些“债务”的确定是错误的。他们是基于受助人全年的平均收入，而不是他们在有资格享受福利的那段时间里赚了多少钱。\n机器人债务系统于2016年推出，使用与Centrelink记录匹配的澳大利亚税务局数据和一种算法，以确定福利支付在哪里过高。它被誉为一种“打击失业救济金和福利抢劫者”的方式，并追回了“数十亿”的超额补偿。“我们的目标是确保人民得到他们应得的东西-不多也不少，”当时的一份政府新闻稿这样写道。“当人们故意欺骗系统时，要严厉打击。”\n此前，人类曾逐一检查收入支票和福利支票之间的差异。但在2016年，该系统完全自动化。福利受助人只是在邮局收到信，声称他们欠了钱，而且必须支付。如果澳大利亚人想要反对，那么他们有责任收集过去几年的所有工资支票，以证明这一制度是错误的。在一个人的案例中，对非法债务的质疑导致金额从20,000美元增加到30,000美元。\n收回这些债务的任务经常外包给私人收债人，他们无情地纠缠着人们签署偿还计划，并威胁要从他们的工资中扣除。被Centrelink贴上债务人标签的澳大利亚人不被允许离开澳大利亚，除非他们要么还清了全部债务，要么同意了偿还计划。\n在人工系统每年发出2万封信的地方，新系统在早期每周发出2万封信。然而，每五封信中就有一封是基于错误的信息。在运行了大约六个月后，债务的真实性开始受到质疑。Centrelink的工作人员被对系统的投诉淹没-2016年有2900万个致电Centrelink的电话无人接听。\n一些死亡事件在一定程度上归因于错误的债务通知造成的压力。在2016年7月至2018年10月期间收到债务通知后死亡的2000人中，有三分之一被归类为“脆弱”，这意味着他们在心理健康、成瘾问题或家庭暴力等领域有复杂的需求。\n2017年，政府被警告机器人债务系统存在问题，当时行政上诉法庭的一名高级成员五次裁定，根据该计划收回的债务不合法。去年，该系统作为一个整体被认为是非法的，联邦法院裁定，Centrelink不可能对指控是正确的感到满意。\n超过1.3万澳大利亚人正在进行的集体诉讼中，政府可能会在7.2亿美元退款之外收取额外的损害赔偿和利息费用。", "note_en": "The Australian government has announced it will refund $720 million (£391m) to the almost 400,000 welfare recipients who were unjustly saddled with debt by a faulty algorithm. Run by Centrelink (the government’s agency for delivering social service benefits), the automated welfare system, nicknamed ‘robodebt’, pitted welfare recipients against a Kafkaesque bureaucratic machine intent on wrongfully extorting them of cash.\n Thousands of benefits claimants were told they owed the government up to tens of thousands of dollars due to over-claiming welfare subsidies. However, in many cases these ‘debts’ were incorrectly determined. They were based on the recipient’s average income for the entire year, instead of how much they were earning during the period in which they qualified for benefits.\n The robodebt system, launched in 2016, used Australian Taxation Office data matched to Centrelink records, and an algorithm, to ascertain where welfare payments had been too high. It was hailed as a way to “crack down on dole bludgers and welfare rorters”, and recoup “billions” in over-compensation. “Our aim is to ensure that people get what they are entitled to—no more and no less,”  a government press release read at the time. “And to crack down hard when people deliberately defraud the system.”\n Humans had previously checked the discrepancies between income and welfare cheques on a case-by-case basis. But in 2016, the system was entirely automated. Welfare recipients simply received letters in the post claiming they owed money and had to pay it. If Australians wanted to object, the onus was on them to collect together all of their paycheques for the last several years in order to prove the system wrong. In one person’s case, questioning the illegitimate debt resulted in the sum being   increased from $20,000 to $30,000 .\n The task of recouping these debts was often outsourced to private debt collectors, which hounded people mercilessly about signing up to repayment plans, as well as threatening deductions from their salaries. Australians labelled as debtors by Centrelink were not   allowed to leave Australia,  unless they had either paid off the entire debt or agreed to a repayment plan.\n Where the human-ran system had issued 20,000 letters per year, the new system sent 20,000 per week in its early days. However, one in five letters sent   were based on false information.  After about six months of being in operation, the veracity of the debts began to be called into question. Centrelink staff were inundated with complaints about the system – twenty-nine million calls to Centrelink  went unanswered in 2016.\n A number of deaths have been attributed in part to the stress caused by the erroneous debt notices.   A third of the 2000 people  who died after being given a debt notice between July 2016 and October 2018 were classed as ‘vulnerable’, meaning they had complex needs in areas such as mental health, addiction problems, or domestic abuse.\n The government was   warned about problems with the robodebt system in 2017 , when a senior member of the Administrative Appeals Tribunal ruled five times that debts recouped under the scheme were not lawful. The system as a whole was deemed unlawful last year, with the Federal Court judging that Centrelink could not have been satisfied that the charges were correct.\n An ongoing class action lawsuit by more than 13,000 Australians could see the government charged additional costs in damages and interest beyond the $720m refund.", "posttime": "2020-06-01 22:34:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,澳大利亚,debts,福利", "title": "澳大利亚将退还按非法算法计算的7.2亿美元CentrelLink“债务”", "title_en": "Australia to refund $720m in Centrelink ‘debts’ calculated by unlawful algorithm", "transed": 1, "url": "https://tech.newstatesman.com/public-sector/australia-to-refund-centrelink-debts", "via": "", "real_tags": ["算法", "澳大利亚", "debts", "福利"]}, {"category": "", "categoryclass": "", "imagename": "5b9df95ecaabeb7839271ac5f920e3d5.png", "infoid": 1004658, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如何在没有同意横幅的情况下运行分析？这很简单；不要使用cookie，也不要收集个人信息。\n坦率地说，我们的设备提供的信息量是可怕的。在其他地方，它最终会出现在一家公司的分析应用程序的仪表盘上。对于像我们这样的产品人员来说，这些数据点中的许多在做出重要的产品或营销决策时都被证明是无关紧要的。\n就连谷歌洞察与分析部门的负责人詹妮克·范·吉恩斯(Janneke Van Geuns)也表示，最大的误解是认为需要捕捉和衡量一切事物。一种普遍的信念是，如果你捕捉到每一种指标，它就会神奇地告诉你什么管用，什么不管用。不幸的是，这不是我们获得洞察力的途径，这就好比大海捞针。\n因此，无意间获取数据不仅会侵犯您的用户隐私，而且会使您的工作更具挑战性。他们说，要简单化！\n分析/跟踪从未包含在我们的应用程序(mail.missiveapp.com、iOS、Mac等)中。这篇文章是关于我们的主页和在https://missiveapp.com.托管的营销网站的独家内容。\n我们问自己，是否是时候换一款比谷歌分析(Google Analytics)更不具侵入性的分析应用了；在这种应用中，冗长的隐私政策不需要了解它们是否符合各国的隐私法(GDPR、CCPA或PECR)。\n我们意识到答案是肯定的，需要做出改变。以下是几个原因：\n作为电子邮件协作工具，透明度和用户隐私对我们至关重要。即使我们只将Google Analytics包括在我们的营销网站上，我们也不得不在我们的隐私政策中引用它，这使得它变得更长、更可怕，而没有明显的好处。\n我们讨厌那些恼人的cookie横幅，要求在欧洲合法使用Google Analytics。滚动并不表示同意。因此，需要一个名副其实的同意墙才能让它合规。我们不喜欢使用免费产品；总会有长期的隐性成本。\n经过一些尽职调查后，我们决定使用Simple Analytics，这是一款由荷兰一个小型独立团队运营的产品。\n他们是唯一一家没有使用指纹来跟踪页面浏览之间的用户的公司。优点是更好的隐私保护，缺点是唯一访问者指标不能真正信任。\n但是，正如Rafael(我们的首席技术官)和Fathom Analytics团队之间的这段对话中所看到的那样，即使使用指纹识别，唯一的指标也不是那么可靠：\n在使用了几天的Simple Analytics之后，我很高兴地说，它的体验远没有Google Analytics仪表板那么令人应接不暇。您将得到一个简单的单页仪表板，其中包含它们提供的所有指标。\n他们有一种有趣的方式来检测独特的访问，同样，没有cookie或IP地址。他们根据页面推荐人的主机名执行此操作。他们这样解释：当用户从一个域来到另一个域时，他们的浏览器与下一个域共享前一个域。如果当前页面的域名与推荐人的域名相同，我们就知道这不是一次独特的访问。虽然不完美，但已经足够好了。\n它们确实收集和存储时间戳，但这些时间戳是完全无害的，并且对它们生成的图形至关重要。\n用户代理。他们只使用它们来计算操作系统、设备大小和浏览器。他们不使用用户代理进行指纹识别。\nSimple Analytics从不跟踪用户，默认情况下，它们会忽略启用了Do Not Track(DNT)的访问。\nSimple Analytics目前提供以下指标：页面浏览量、访问量、推荐量、首页、屏幕宽度、浏览器和国家。7个指标，而常规分析应用程序中有数十个指标。这是一种劣势吗？目前对我们来说不是。\n因为我们不打算在短期内投放广告，所以我们不需要介绍我们的受众，了解他们的人口统计数据、喜好、兴趣、行为模式等。\n此外，它们不会为您处理任何数据，因此您需要手动计算流量指标的比率和百分比。不过，再说一遍，这对我们来说不是问题。\n他们刚刚推出了无Cookie的事件跟踪，我们将使用它来手动跟踪一些事件，比如下载。\n另一方面，他们似乎相当投入，不断开发新功能。您可以看到整个路线图。\n我们把一个“免费”、无隐私、复杂的分析仪表盘换成了一个付费的、隐私优先的、简单的仪表盘。我们高兴得不能再开心了。\n此外，多亏了这一变化，我们的DuckDuckGo隐私评级从C+升级到B+\n我们已经向TOS组织提交了我们的隐私政策；DuckDuckGo博士与他们合作提供这些隐私等级。我们希望很快就能拿到A级。", "note_en": "How to run analytics without a consent banner? It is simple; don&#39;t use cookies nor collect personal information.\n Frankly, the amount of information our devices give away is scary. Amongst other places, it ends up in the dashboard of a company&#39;s analytics app. For product people like us, many of these data points turn out to be irrelevant when making important product or marketing decisions anyway.\n Even Google&#39;s Head of Insights &amp; Analytics, Janneke van Geuns,  said that &#34;The biggest misconception is the perceived need to capture and measure everything and anything.&#34; &#34;A common belief is that if you capture every type of metric, it will tell you magically what works and what doesn&#39;t. Unfortunately, that is not how we get to insights, and would be comparable to having to find a needle in a haystack.&#34;\n So, not only does harvesting data without intent can invade your users&#39; privacy, but it can make your work more challenging. Keep it simple they say!\n Analytics/tracking  were never included in our apps ( mail.missiveapp.com, iOS, Mac, etc). This post is exclusively about our homepage and marketing site hosted at  https://missiveapp.com.\n  We asked ourselves if it was time to switch to a less invasive analytics app than Google Analytics; one where lengthy privacy policies weren&#39;t needed to figure out their compliance with privacy laws of various countries (GDPR, CCPA, or PECR).\n We realized that the answer was yes, a change was needed. Here are a few reasons why:\n As an email collaboration tool, transparency and our users&#39; privacy are paramount to us. Even if we were only including Google Analytics on our marketing site, we had to reference it in our privacy policy, which made it longer and scarier without a clear upside.\n  We hate those annoying cookie banners required to use Google Analytics legally in Europe. To scroll is not to give consent. So a veritable &#34;consent-wall&#34; is needed for it to be compliant.We are not fans of using free products; there is always a long-term hidden cost.\n  After some due diligence, we decided to go with  Simple Analytics, a product run by a small independent team from the Netherlands.\n They were the only one not using fingerprinting to track users in between page views. The upside is better privacy protection, the downside is the unique visitor metric can’t really be trusted.\n But as seen here in this exchange between Rafael (our CTO) and the Fathom Analytics team, even with fingerprinting, the unique metric is not so reliable:\n  After a few days of using Simple Analytics, I&#39;m happy to say it’s a far less overwhelming experience than the Google Analytics dashboard. You get a straightforward  single-page dashboard with all the metrics they offer.\n    They have an interesting way to detect unique visits, again, without cookies or IP addresses. They do it based on the hostname of the referrer of the page. They explain it like this: &#34;When a user comes from one domain to another, their browser shares the previous domain with the next. If the current page&#39;s domain is the same as the one in the referrer, we know it&#39;s a non-unique visit.&#34; Not perfect, but good enough.\n They do collect and store timestamps, but those are entirely harmless and crucial for the graphs they generate.\n User Agents. They use them only for counting operating systems, device sizes, and browsers. They don&#39;t use User Agents for fingerprinting.\n Simple Analytics never tracks users, and by default, they ignore visits with Do Not Track (DNT) enabled.\n  Simple Analytics currently offers these metrics: page view count, visitor count, referrals, top pages, screen widths, browsers, and countries. Seven metrics versus dozens in regular analytics apps. Is that a disadvantage? Not for us at the moment.\n Since we don&#39;t plan to run ads anytime soon, we don&#39;t need to profile our audience, get their demographics, likes, interests, behavior patterns, etc.\n Also, they don&#39;t crunch any data for you, so you will need to calculate ratios and percentages for traffic metrics manually. But again, not a problem for us.\n They just rolled out cookie-less event tracking, which we will use to manually track some events like downloads.\n On the other hand, they seem pretty engaged and are continually developing new features. You can see the whole  roadmap.\n    We traded a ‘free’, privacy-less, and complex analytic dashboard to a paid, privacy-first &amp; simple one. We couldn’t be happier.\n Also, thanks to this change our DuckDuckGo privacy rating was upgraded from  C+ to  B+\n We have submited our Privacy Policy to the organization  ToS;DR. DuckDuckGo works with them to provide these privacy grades. We will hopefully get the A grade soon.", "posttime": "2020-06-01 22:33:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google", "title": "我们抛弃了Google Analytics", "title_en": "We ditched Google Analytics", "transed": 1, "url": "https://missiveapp.com/blog/privacy-first-analytics", "via": "", "real_tags": ["google"]}, {"category": "", "categoryclass": "", "imagename": "7cf484ceeae6bc7fc2161eddc603cd15.jpg", "infoid": 1004657, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这里是制造区。如果你认为“制造东西”是唯一的出路，我很乐意带你在这里转转。工厂停车场的满座率在30%到80%之间，但最可怕的是卡车：在封锁期间，卡车的数量实际上更多。我完全预计破产将在今年夏天认真开始：到目前为止，只有零售商受到影响，但工业破产总是复杂的事情，特别是考虑到债务负担。在宝马(BMW)和VAG代表的甜言蜜语的诱惑下，这里太多的人借入了巨额贷款，以扩张到利润率最低的最艰难的行业之一(汽车零部件)，现在，随着一个本已衰落的行业面临清算的时刻，他们只能背黑锅。低成交量和巨额债务不能很好地混合在一起。", "note_en": "Manufacturing district here. If you think “making stuff” is the only way forward I would be happy to show you around here. Factory parking lots are anything between 30 and 80% filled but the scariest thing are the lorries: there were actually more of them around during the lockdown. I fully expect the bankruptcies to start in their earnest this Summer: so far only retailers have been affected but industrial bankruptcies are always complicated affairs, especially given debt loads. Too many folks here took out huge loans to expand into one of the toughest sector with thinnest margins (automotive components), tempted by the honeyed words from representitives from BMW and VAG, and now are left holding the bag as an already declining sector faces the hour of reckoning. Low volumes and huge debts don’t mix well.", "posttime": "2020-06-01 22:16:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "旧金山,泡沫,francisco,制造", "title": "旧金山，“一切泡沫”的缩影，面临财政混乱", "title_en": "San Francisco, Epitome of the “Everything Bubble,” Faces Fiscal Chaos", "transed": 1, "url": "https://wolfstreet.com/2020/05/31/san-francisco-epitome-of-everything-bubble-faces-fiscal-chaos-boom-and-bust-always/", "via": "", "real_tags": ["旧金山", "泡沫", "francisco", "制造"]}, {"category": "", "categoryclass": "", "imagename": "4e40b2b4253d6a95a6ca144bec8ea3d4.png", "infoid": 1004656, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在是2020年了，很多浏览器仍然允许从所谓的安全环境(如沙盒iFrame)下载Driver-by-Download(Driver by-Download)。\n对于那些不熟悉这个术语的人来说，Driver-by-Download是指用户访问网站时，在没有用户交互的情况下启动文件下载。\n此技术可用于分发不需要的软件和恶意程序，希望用户意外或错误地执行下载并受到感染。\n广告安全公司confiant的最新研究表明，沙盒iframe等安全上下文可能会在访问网站时被滥用，从而允许下载。\n由于大多数广告都是通过IFRAME显示在网页上的，恶意广告商可以利用它们来投放不需要的应用程序，从而感染您的计算机。\n2020年1月，Boing Boing网站的访问者开始看到假冒的Google Play Protect覆盖，促使用户下载在Android设备上安装Anubis银行特洛伊木马的恶意APK。\n对于Windows用户，它会显示一个分发其他恶意程序的假Adobe Flash安装页面。\n最初被认为是一场恶意宣传活动，后来被发现波音的CMS被黑客入侵，并注入了一个脚本，将这些覆盖显示给访问者。\n在调查了这次攻击后，Truant研究员Eliya Stein注意到，Driver-by-Download是由嵌入页面的JavaScript发起的。\n此脚本将在页面上创建一个链接并单击此链接，而无需用户任何提示即可启动下载。\n虽然事实证明这次攻击并不是恶意广告，但斯坦想知道是否可以通过使用沙盒IFRAMES进行恶意广告攻击来发起类似的攻击。\n如前所述，大多数广告使用沙盒IFRAMES将广告嵌入网页。\n由于广告处于第三方的控制之下，这些框架通常与沙盒参数一起使用，以提高安全性并限制第三方页面可以执行的操作。\n为了查看上面描述的相同脚本是否会导致沙盒跨源iframe中APK的驱动下载，这是从不同主机名加载的iframe，Stein创建了一个概念验证页面来测试各种浏览器。\n在创建这个沙盒IFRAME时，Stein使用了广告常用的以下限制。\n随着Chrome 83的发布，沙盒跨源IFRAME中的下载被屏蔽，下载驱动技术也不起作用。要允许下载，开发人员必须将Allow-Downloads添加到沙盒的值中。\n基于Chrome83的Microsoft Edge也包括这一新功能，并阻止下载。\nMozilla Firefox不阻止跨源iframe中的下载，系统会提示用户下载该文件。\nSafari的行为非常奇怪，因为它会尝试下载APK文件，但最终无法完成。\nAndroid浏览器会提示您下载该文件，但会警告您APK文件是危险的。\n正如您所看到的，允许脚本在预计是安全的上下文中启动下载是有问题的，因为它可能会通过恶意广告传播恶意软件。\n虽然Chrome83和Microsoft Edge83都屏蔽了沙盒iframe中的下载，但Brave和Firefox仍然允许下载。\n在Mozilla Firefox的一篇bug帖子中，Firefox的开发人员已经完成了阻止沙盒iframe中下载的代码，并将很快将其添加到浏览器中。\n目前还不清楚Brave、Safari和受影响的移动浏览器将来是否会解决这个问题。", "note_en": "It&#39;s 2020, and numerous browsers still allow drive-by-downloads from what is meant to be secure contexts such as sandboxed iframes.\n For those unfamiliar with the term, a drive-by-download is when a user visits a site, and a file download is initiated without the user&#39;s interaction.\n This technique can be used to distribute unwanted software and malicious programs in the hopes that users will accidentally or mistakenly execute the downloads and get infected.\n New research from  ad security firm Confiant shows that secure contexts such as sandboxed iframes can be abused to allow drive-by-downloads when visiting a website.\n As most advertisements are displayed on a web page via iframes, malicious advertisers can use them to deliver unwanted applications that infect your computer.\n  In January 2020, visitors to the Boing Boing site began seeing fake Google Play Protect overlay that prompted users to download a malicious APK that installed the Anubis banking Trojan on Android devices.\n  For Windows users, it would instead display a fake Adobe Flash installation page that was distributing other malicious programs.\n  Originally thought to be a malvertising campaign, it was later discovered that  Boing Boing&#39;s CMS was hacked, and a script was injected that displayed these overlays to visitors.\n After investigating this attack, Confiant researcher Eliya Stein noticed that the drive-by-downloads were being initiated by the JavaScript embedded into the page.\n This script would create a link on the page and click this link, without any prompt from the user, to initiate the download.\n  While it turned out that this attack was not malvertising, Stein wondered if a similar attack could be initiated via malvertising using sandboxed iframes.\n  As previously stated, most advertisements use  sandboxed iframes to embed the ad on a web page.\n As the advertisements are under a third-party&#39;s control, these iframes are commonly used with the sandboxed argument to increase security and restrict what actions the third-party page can perform.\n To see if the same script described above would cause a drive-by-download of an APK in sandboxed cross-origin iframes, which is an iframe loaded from a different hostname, Stein created a proof-of-concept page to test various browsers.\n  When creating this sandboxed iframe, Stein used the following restrictions that are commonly used by advertisements.\n   With the release of Chrome 83, downloads are  blocked in sandboxed cross-origin iframes, and the drive-by-download technique did not work. To allow downloads, a developer has to add &#39;allow-downloads&#39; to the sandbox value.\n  Microsoft Edge, which is based on Chrome 83, also includes this new feature and blocks the drive-by-download.\n  Mozilla Firefox does not prevent downloads in cross-origin iframes, and the user was prompted to download the file.\n    Safari&#39;s behavior was strange as it would attempt to download the APK file but ultimately never complete it.\n   Android browsers would prompt you to download the file, but would warn that the APK file is dangerous.\n   As you can see, allowing scripts to initiate downloads in what is expected to be a secure context, is problematic as it could enable the distribution of malware through malicious advertisements.\n While Chrome 83 and Microsoft Edge 83 both block downloads in sandboxed iframes, Brave and Firefox still allow it.\n In a  Mozilla Firefox bug post, the Firefox developers have already completed the code to block downloads in sandboxed iframes and will add it to the browser soon.\n It is not known if Brave, Safari, and affected mobile browsers will resolve it in the future.", "posttime": "2020-06-01 22:15:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,下载,browsers", "title": "Web浏览器在2020年仍允许下载Driver-by-Download", "title_en": "Web Browsers still allow drive-by-downloads in 2020", "transed": 1, "url": "https://www.bleepingcomputer.com/news/security/web-browsers-still-allow-drive-by-downloads-in-2020/", "via": "", "real_tags": ["2020", "下载", "browsers"]}, {"category": "", "categoryclass": "", "imagename": "254fa6e8ca7614905a23c236dc8283a1.jpg", "infoid": 1004655, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在原子水平上，一杯水和一勺结晶盐看起来截然不同。水原子自由而随机地移动，而盐晶体则被锁定在晶格中的适当位置。但是，美国能源部阿贡国家实验室的研究人员最近对一些新材料进行了研究，这些材料显示出一种耐人寻味的倾向，有时像水，有时像盐，赋予它们有趣的传输特性，并为制药行业的混合和输送等应用提供了潜在的前景。这些所谓的活性材料包含小的磁性颗粒，它们自组织成粒子链或旋转体的短链，并在施加A时形成晶格状结构。这项研究的作者之一、阿贡材料科学家阿列克谢·斯内日科说，活性材料需要外部能源来维持其结构。\n与以前涉及活性物质的实验中不同的是，这些新的微调器观察的是表现出线性运动的粒子，这些新的微调器获得了一种左撇子或右撇子一样的惯用手，使它们沿着特定的方向旋转。\n悬浮的自组装镍旋转器的旋转产生了类似漩涡的效果，不同的粒子可以被吸入到它们的邻居创造的漩涡中。斯奈日科说，这些颗粒不会自行移动，但它们可以被拖来拖去。有趣的是，你可以拥有这些快速旋转的结构，它们给人一个更大的系统的外观，这个系统是静止的，但它仍然相当活跃。\n当粒子开始聚集在一起时，旋转运动产生的漩涡-连同磁相互作用-将它们拉得更近，创造出一种固定的晶状材料，即使旋转器仍在旋转。\n阿贡的研究人员想知道非自旋粒子是如何通过活动晶格传输的。根据Snezhko的说法，旋转器的快速旋转创造了这些其他货物粒子在晶格中移动的能力，比它们在正常材料中移动的速度要快得多。他说，在规则扩散中，粒子从材料的一边到另一边的过程与温度有关，需要更长的时间。\n非微调器粒子的传输还取决于微调器之间的间距。如果旋转器的距离足够远，非旋转器粒子将在不同的旋转器之间杂乱无章地移动，就像沿着一系列激流急流漂流的木筏一样。如果晶格中的粒子靠得更近，则非微旋粒子可能会被困在晶格的单个单元中。\nSnezhko说，一旦粒子通过自身的混沌运动进入细胞内，我们就可以修改磁场，使晶格轻微收缩，使粒子离开晶格中那个位置的可能性非常低。\n这种材料还显示出进行自我修复的能力，类似于生物组织。当研究人员在格子上打了一个洞时，它们进行了改造。\n通过观察纯旋转运动的系统，Snezhko和他的同事们相信他们可以设计出具有特定运输特性的系统。他说，从A点到B点，有许多不同的方法可以将物体放入材料中，这种类型的自组装可以为不同的动力学量身定做。\n3月20日出版的“科学进展”杂志上发表了一篇基于这项研究的论文，题为“同步主动旋转材料中的可重构结构和可调谐传输”(Refigurable Structure And Tunable Transport In Synchronized Active Spinder Material)。更多信息：Koohee han等人，同步主动旋转材料中的可重构结构和可调传输，科学进展(2020)。doi：10.1126/scrisAdv.aaz8535", "note_en": "At the atomic level, a glass of water and a spoonful of crystalline salt couldn&#39;t look more different. Water atoms move around freely and randomly, while salt crystals are locked in place in a lattice. But some new materials, recently investigated by researchers at the U.S. Department of Energy&#39;s (DOE) Argonne National Laboratory, show an intriguing propensity to sometimes behave like water and sometimes like salt, giving them interesting transport properties and holding potential promise for applications like mixing and delivery in the pharmaceutical industry.    These so-called active materials contain small magnetic particles that self-organize into short chains of particles, or spinners, and form a lattice-like structure when a   is applied. &#34;Active materials need an external energy source to maintain their structure,&#34; said Argonne materials scientist Alexey Snezhko, an author of the study.\n  Unlike in previous experiments involving active materials, which looked at particles that demonstrated linear motion, these new spinners acquire a handedness—like right- or left-handedness—that causes them to rotate in a specific direction.\n  This twirling rotation of the suspended self-assembled nickel spinners creates a whirlpool-like effect, in which different particles can get sucked in to the vortices created by their neighbors. &#34;The particles don&#39;t move on their own, but they can be dragged around,&#34; Snezhko said. &#34;The interesting thing is that you can have these very quickly rotating structures that give the appearance of a yet larger system that is still, but it remains quite active.&#34;\n  As the particles start to come together, the whirlpools created by the spinning motion—in conjunction with the magnetic interactions—pull them even closer, creating a fixed crystalline-like material, even as the spinners still rotate.\n  The Argonne researchers wanted to know how a non-spinner particle would be transported through the active lattice. According to Snezhko, the rapid whirling of the spinners creates the ability for these other cargo particles to move through the lattice much more quickly than they would through a normal material. &#34;In regular diffusion, the process of getting a particle from one side of the material to the other is temperature-dependent and takes a much longer period of time,&#34; he said.\n  The transport of a non-spinner particle is also dependent upon the spacing between the spinners. If the spinners are located sufficiently far apart, the non-spinner particle will travel chaotically between different spinners, like a raft traveling down a series of whitewater rapids. If the particles in the lattice come closer together, the non-spinner particle can become trapped in an individual cell of the lattice.\n  &#34;Once the particle comes within a cell through its own chaotic motion, we can modify the field so that the lattice slightly shrinks, making the probability of the particle to leave that location in the lattice very low,&#34; Snezhko said.\n  The material also showed the ability to undergo self-repair, similar to a biological tissue. When the researchers made a hole in the lattice, the   reformed.\n  By looking at systems with purely rotational motion, Snezhko and his colleagues believe that they can design systems with specific transport characteristics. &#34;There are many different ways for getting an object in a material from point A to point B, and this type of self-assembly could be tailored for different dynamics,&#34; he said.\n  A paper based on the study, &#34;Reconfigurable structure and tunable transport in synchronized active spinner materials,&#34; appeared in the March 20 issue of  Science Advances.        More information:\t\t\t\t\t\t\t\t\t\t\t\tKoohee Han et al, Reconfigurable structure and tunable transport in synchronized active spinner materials,  Science Advances (2020).  DOI: 10.1126/sciadv.aaz8535", "posttime": "2020-06-01 22:15:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "活性,create,粒子", "title": "研究人员从微观旋转的颗粒中创造出活性物质", "title_en": "Researchers create active material out of microscopic spinning particles", "transed": 1, "url": "https://phys.org/news/2020-05-material-microscopic-particles.html", "via": "", "real_tags": ["活性", "create", "粒子"]}, {"category": "", "categoryclass": "", "imagename": "abde2941cb1b480399c6da88de448740.jpg", "infoid": 1004652, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软现在承认，它没有给予加拿大开发者Keivan Beigi应有的信任，因为他在新的Winget Windows10软件包管理器中扮演的角色。\n上周，为Windows开发了开源的AppGet软件包管理器的Beigi指责微软抄袭了他为Winget所做的工作，而没有承认他的产品的影响力。\nWindows软件包经理Beigi在Microsoft Build 2020上宣布，微软复制了AppGet的大部分内容来交付Winget。上周，他详细介绍了他与微软一位名叫安德鲁的高级经理的讨论，这位经理在2019年7月找到他，邀请他见面并讨论我们如何让您的生活更轻松地构建AppGet&34；。\n安德鲁·克林克(Andrew Clinick)是负责应用程序在Windows上安装的团队的一名小组项目经理，他现在承认，微软未能就AppGet对Winget的影响给予Beigi应有的评价。\n克林克写道：我们的目标是为我们的客户和社区提供一个伟大的产品，让每个人都能做出贡献并获得认可。\n我们最不想做的事就是疏远这个过程中的任何人。这就是为什么我们把它构建在开放的GitHub上，每个人都可以贡献自己的力量。\n在过去的几天里，我们从我们的社区倾听并学习，显然我们没有达到这个目标。更具体地说，我们在Keivan和AppGet上没有做到这一点。这是我们最不想要的。\n贝吉表示，他并不介意微软抄袭他的开源Windows软件包管理器，但他认为，微软至少应该正确地将Winget的设计归功于AppGet，而不是用贝吉的话说，它只是另一个恰好存在的软件包管理器。\n在微软的Winget声明中，AppGet得到了一个顺带的提及，此前微软称竞争对手Windows软件包经理巧克力公司拥有一个充满活力的社区，拥有大量的应用程序，并且拥有支持开源和企业客户的丰富历史。在此之前，微软发布了一份声明，称竞争对手Windows软件包经理巧克力公司拥有一个充满活力的社区，拥有大量的应用程序，并拥有支持开源和企业客户的丰富历史。\n微软补充说，还有许多其他的软件，比如AppGet、Npack和基于PowerShell的OneGet包管理器。\n尽管功劳姗姗来迟，但根据贝吉的说法，微软对AppGet和Winget的处理一直是笨拙、麻木不仁的，而且被缓慢而可怕的通信速度所宠坏。\n有些人会争辩说，微软应该在开发者一开始就没有提出这个问题的情况下给予Beigi适当的信任-特别是考虑到微软一直在努力摆脱其邪恶公司的形象，发动了对开源的战争，而且它曾经遵循着拥抱、延伸和消灭的口头禅。\n有时微软会收购开发人员的辅助项目，比如VisualZip实用程序，它是从上世纪90年代在自己的书房里创建Windows任务管理器的同一名微软工程师手中收购的。\n对AppGet的略过提及是北木的另一个痛点，他在2018年写道，巧克力问题是如何激励他重启微软最终会感兴趣的AppGet项目的。AppGet目前有800多个软件包可以安装在Windows上。\n这位加拿大开发者说，安德鲁在他们第一次会面一周后给他发了一封电子邮件，告诉贝吉，他有机会帮助定义整个Azure/Microsoft 365/34；的Windows和应用程序分发的未来，可能是作为一名员工，他将加入微软，微软将获得AppGet。\n去年12月，他前往微软雷蒙德总部参加面试，面试显然进行得很顺利，但安德鲁直到6个月后--也就是Winget预览版将在Build 2020上亮相的前一天--才告诉他他不会得到微软的这份工作。\n安德鲁告诉Beigi，我们在博客中也向AppGet发出了呼吁，因为我们相信Windows上会有不同的软件包管理器的空间。\n&#34；你会看到我们的包管理器也是基于GitHub的，但显然是基于我们自己的实现等。我们的包管理器也将是开源的，所以很明显，我们欢迎您的任何贡献。&#34；\n对北吉来说，幸运的是，他不确定自己是否想为这么大的公司工作，他对从加拿大搬到美国的前景也并不兴奋。然而，由于微软Winget的存在，Beigi已经决定该产品和项目将于8月1日退役。\n克林克的帖子并不是道歉，它证实了贝吉的说法，并详细说明了AppGet如何帮助微软为Winget实现了更好的产品方向：\n安装过程中没有脚本-这是我们完全同意的，也是MSIX不允许的。\nGitHub中丰富的清单定义--开放的力量与关于应用程序的丰富声明性元数据相结合，对于实现第一个目标是非常重要的。", "note_en": "Microsoft has now admitted it failed to give due credit to Canadian developer Keivan Beigi for his role in the new WinGet Windows 10 package manager.\n Last week, Beigi, who built the open-source  AppGet package manager for Windows, accused Microsoft of copying his work for WinGet without acknowledging his product&#39;s influence.\n    Beigi says Microsoft copied large parts of AppGet to deliver  WinGet, the Windows package manager announced at Microsoft Build 2020. Last week,  he detailed his discussions with a senior manager at Microsoft named Andrew who approached him in July 2019 with an invitation to meet and discuss &#34;how we can make your life easier building AppGet&#34;.\n Andrew Clinick, a group program manager on the team responsible for how apps install on Windows, has now admitted Microsoft failed to give Beigi proper credit for AppGet&#39;s influence on WinGet.\n &#34;Our goal is to provide a great product to our customers and community where everyone can contribute and receive recognition,&#34;  wrote Clinick.\n   &#34;The last thing that we want to do is alienate anyone in the process. That is why we are building it on GitHub in the open where everyone can contribute.\n &#34;Over the past couple of days we&#39;ve listened and learned from our community and clearly we did not live up to this goal. More specifically, we failed to live up to this with Keivan and AppGet. This was the last thing that we wanted.&#34;\n   Beigi said he didn&#39;t mind that Microsoft copied his open-source Windows package manager but argued that Microsoft should have at least properly attributed WinGet&#39;s design to AppGet, rather than describing it in Beigi&#39;s words as only &#34;another package manager that just happened to exist&#34;.\n AppGet got one passing mention in  Microsoft&#39;s WinGet announcement after Microsoft described rival Windows package manager Chocolatey as having a &#34;vibrant community with a massive collection of applications, and a rich history supporting both open-source and enterprise customers&#34;.\n &#34;There are many others like AppGet, Npackd and the PowerShell based OneGet package manager-manager,&#34; Microsoft added.\n Despite the belated credit, Microsoft&#39;s handling of AppGet and WinGet has been clumsy, insensitive and spoiled by &#34;slow and dreadful communication speed&#34;, per Beigi&#39;s account.\n Some would argue that Microsoft should have given Beigi proper credit without the developer raising the issue in the first place – especially given Microsoft&#39;s  efforts to shed its image as an evil company that waged war on open source and which once  followed the mantra &#34;embrace, extend, and extinguish&#34;.\n Sometimes Microsoft buys developers&#39; side projects, like the VisualZip utility, which was acquired from  the same Microsoft engineer who also created Windows Task Manager in his den back in the 1990s.\n The passing mention of AppGet was another sore point for Beigi, who in 2018 wrote how problems with Chocolatey  inspired him to revive the AppGet project that Microsoft would eventually be interested in. AppGet currently has over  800 packages that it can install on Windows.\n The Canadian developer says Andrew emailed him a week after their first meeting and told Beigi he had &#34;an opportunity to help define the future of Windows and app distribution throughout Azure/Microsoft 365&#34;, potentially as an employee where he would join Microsoft and it would get AppGet.\n He went for an interview at Microsoft&#39;s Redmond headquarters in December, which apparently &#34;went well&#34;,  but Andrew didn&#39;t inform him he would not get the job at Microsoft until six months later – on the day before the WinGet preview would be unveiled at Build 2020.\n &#34;We give AppGet a call out in our blog post too since we believe there will be space for different package managers on windows,&#34; Andrew told Beigi.\n &#34;You will see our package manager is based on GitHub too but obviously with our own implementation etc. Our package manager will be open source too so obviously we would welcome any contribution from you.&#34;\n Fortunately for Beigi, he wasn&#39;t sure he wanted to work for such a big company and he wasn&#39;t excited about the prospect of moving from Canada to the US. However, Beigi has decided the product and project will now be retired on August 1 because of the existence of Microsoft&#39;s WinGet.\n Clinick&#39;s post, which isn&#39;t an apology, confirms Beigi&#39;s account and details how AppGet helped Microsoft achieve a &#34;better product direction&#34; for WinGet:\n No scripts during install – something that we completely agreed with and don&#39;t allow with MSIX.\n Rich manifest definition within GitHub – the power of being open combined with rich declarative meta data about the app is so important to meet goal #1.", "posttime": "2020-06-01 21:41:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,微软,microsoft,软件包,credits", "title": "微软称其为软件包管理器的制造商，但没有道歉", "title_en": "Microsoft credits maker of package manager it 'copied', but offers no apology", "transed": 1, "url": "https://www.zdnet.com/article/microsoft-credits-maker-of-package-manager-it-copied-for-windows-10-but-offers-no-apology/", "via": "", "real_tags": ["软件", "微软", "microsoft", "软件包", "credits"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004651, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "出发地：Linus Torvalds日期：美国东部夏令时2020年5月29日周五15：19：32 David Laight&lt；David.Laight@xxxxxxxxx&gt；写道：&gt；&gt；宽屏显示器是用来查看大量文件的。不一定。过多的换行符是不好的。它们造成了现实的和日常的问题。它们会在模式和输出中给像grep&34；这样的东西带来问题，因为grep(和许多其他非常基本的Unix实用程序)基本上是基于行的。因此，事实是，我们中的许多人很久以前就跳过了整个80列终端模型，原因与我们一次可见的行比25行多得多。老实说，我不想看到补丁使内核阅读体验对我来说更糟，可能对绝大多数人来说也是如此，因为有些怪人的终端窗口很小。如果您或Christoph有80个字符行，您可能会得到难看的换行输出。硬汉。那是你的选择。您的硬件限制应该不会给我们其他人带来痛苦。更长的队伍基本上是有用的。我的显示器不仅比它高得多，而且我的字体普遍都比它高得窄。排长队是很自然的。当我在显示器上平铺终端窗口时，我一次可以看到6个终端，这是因为我有三个宽的终端。我还可以并排放进第四个的80%。你猜怎么着？这就是我的默认终端窗口(转到GNOME终端设置，您会发现80x25只是一个可以更改的初始默认设置)，而不是一些80x25。这是一种具有抗锯齿功能的字体，而且不是一些像素化的乱七八糟的东西。实际上，我的大多数航站楼最终都被拖得更宽更高。我检查了一下，我的主要终端现在是142x76个字符，因为事实证明，更宽(和更高)的终端不仅对源代码有用。您最近有没有看过PS AX的产量？还是用过&#34；top&#34；？或者做完--Stat&34；或者任何数量的事情，结果证明80x25真的是非常有限的，只是对我们大多数人来说已经不再相关了，或者是做了一些事情，结果证明80x25真的很有限，而且对我们大多数人来说已经不再是那么重要了。所以不是。我不关心有80x25终端窗口的人换行。出于完全相同的原因，如果有人说他们的内核编译需要10个小时，因为他们是在内存为4 GB的Raspberry PI上进行内核开发，我发现这完全无关紧要。硬件受限的人不应该给拥有更好资源的人带来更多不便。是的，我们会在合理的范围内处理。但事实并非如此，就我而言，2020年的80列航站楼再也不合理了。早在80年代，人们就普遍使用132柱端子，看在上帝的份上，不要试图把80柱定为不可移动的标准。如果选择使用80列端子，您可以忍受换行。事情就是这么简单。而且，更长的队伍非常有用。部分原因是我们不再是80年代的编程人员，我们的源代码也因此从根本上变得更加宽泛。是的，局部迭代变量仍然被称为“局部迭代变量”，因为更多的上下文对某些匿名计数器没有帮助。简洁明了仍然是一件好事，过于冗长的名字本质上并不是更好的。但是，使用10-15个字符的变量名是完全合理的，而且它使代码更易读。把东西写出来，而不是使用缩写等。是的，我们确实使用宽制表符，因为这使得缩进是你可以在结构中一目了然地看到的，而且是在整个功能的基础上，而不是你必须在视觉上将东西排成一行或计算空格的东西。在这方面，我们确实使用了宽制表符，因为这使得你可以在结构中一目了然地看到整个功能，而不是试图在视觉上排列或计算空格。因此，我们有很多相当基本的问题，在许多情况下，这些问题很容易造成更长的队伍。是的，我们在某些时候会换行。但真的没有任何理由让这一点再长达80栏了。莱纳斯", "note_en": "From: Linus Torvalds  Date:  Fri May 29 2020 - 15:19:32 EST On Fri, May 29, 2020 at 6:08 AM David Laight &lt;David.Laight@xxxxxxxxxx&gt; wrote: &gt;  &gt;  A wide monitor is for looking at lots of files.  Not necessarily.  Excessive line breaks are BAD. They cause real and every-day problems.  They cause problems for things like &#34;grep&#34; both in the patterns and in the output, since grep (and a lot of other very basic unix utilities) is fundamentally line-based.  So the fact is, many of us have long long since skipped the whole &#34;80-column terminal&#34; model, for the same reason that we have many more lines than 25 lines visible at a time.  And honestly, I don&#39;t want to see patches that make the kernel reading experience worse for me and likely for the vast majority of people, based on the argument that some odd people have small terminal windows.  If you or Christoph have 80 character lines, you&#39;ll get possibly ugly wrapped output. Tough. That&#39;s _your_ choice. Your hardware limitations shouldn&#39;t be a pain for the rest of us.  Longer lines are fundamentally useful. My monitor is not only a lot wider than it is tall, my fonts are universally narrower than they are tall. Long lines are natural.  When I tile my terminal windows on my display, I can have 6 terminals visible at one time, and that&#39;s because I have them three wide. And I could still fit 80% of a fourth one side-by-side.  And guess what? That&#39;s with my default &#34;100x50&#34; terminal window (go to your gnome terminal settings, you&#39;ll find that the 80x25 thing is just an initial default that you can change), not with some 80x25 one. And that&#39;s with a font that has anti-aliasing and isn&#39;t some pixelated mess.  And most of my terminals actually end up being dragged wider and taller than that. I checked, and my main one is 142x76 characters right now, because it turns out that wider (and taller) terminals are useful not just for source code.  Have you looked at &#34;ps ax&#34; output lately? Or used &#34;top&#34;? Or done &#34;git diff --stat&#34; or any number of things where it turns out that 80x25 is really really limiting, and is simply NO LONGER RELEVANT to most of us.  So no. I do not care about somebody with a 80x25 terminal window getting line wrapping.  For exactly the same reason I find it completely irrelevant if somebody says that their kernel compile takes 10 hours because they are doing kernel development on a Raspberry PI with 4GB of RAM.  People with restrictive hardware shouldn&#39;t make it more inconvenient for people who have better resources. Yes, we&#39;ll accommodate things to within reasonable limits. But no, 80-column terminals in 2020 isn&#39;t &#34;reasonable&#34; any more as far as I&#39;m concerned. People commonly used 132-column terminals even back in the 80&#39;s, for chrissake, don&#39;t try to make 80 columns some immovable standard.  If you choose to use a 80-column terminal, you can live with the line wrapping. It&#39;s just that simple.  And longer lines are simply useful. Part of that is that we aren&#39;t programming in the 80&#39;s any more, and our source code is fundamentally wider as a result.  Yes, local iteration variables are still called &#39;i&#39;, because more context just isn&#39;t helpful for some anonymous counter. Being concise is still a good thing, and overly verbose names are not inherently better.  But still - it&#39;s entirely reasonable to have variable names that are 10-15 characters and it makes the code more legible. Writing things out instead of using abbreviations etc.  And yes, we do use wide tabs, because that makes indentation something you can visually see in the structure at a glance and on a whole-function basis, rather than something you have to try to visually &#34;line up&#34; things for or count spaces.  So we have lots of fairly fundamental issues that fairly easily make for longer lines in many circumstances.  And yes, we do line breaks at some point. But there really isn&#39;t any reason to make that point be 80 columns any more.   Linus", "posttime": "2020-06-01 21:24:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "托瓦尔,torvalds,终端", "title": "莱纳斯·托瓦尔兹：过度换行是不好的", "title_en": "Linus Torvalds: Excessive line breaks are bad", "transed": 1, "url": "http://lkml.iu.edu/hypermail/linux/kernel/2005.3/08168.html", "via": "", "real_tags": ["托瓦尔", "torvalds", "终端"]}, {"category": "", "categoryclass": "", "imagename": "6c34c99e82199c5e3acd44e94a29fe6b.jpeg", "infoid": 1004650, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-Facebook员工批评首席执行官马克·扎克伯格(Mark Zuckerberg)决定不删除美国总统唐纳德·特朗普(Donald Trump)的煽动性评论，周末在Twitter上公开了他们的异议，称赞这家竞争对手社交媒体公司采取了行动，并谴责了自己的雇主。\n近年来，Facebook、谷歌(Google)和亚马逊(Amazon)等公司的许多科技工作者在社会正义问题上变得活跃起来，并敦促他们的雇主采取行动，改变政策。\n尽管如此，对扎克伯格的批评标志着高层员工公开指责自己的首席执行官的罕见案例，路透社看到的七个关键职位中，至少有三个来自自称是高级管理人员的人。\n“马克错了，我会尽最大努力改变他的想法，”瑞安·弗雷塔斯(Ryan Freitas)写道，他的Twitter账户表明他是Facebook新闻馈送的产品设计总监。他补充说，他已经动员了“50多名志同道合的人”为内部改革游说。\n杰森·托夫(Jason Toff)是产品管理总监，他写道：“我在Facebook工作，我并不为我们的表现感到自豪。我采访过的大多数同事都有同样的感受。我们正在发出我们的声音。“。\n周五，推特上隐藏了一条来自特朗普的推文，其中包括一句话：“当抢劫开始时，枪击就开始了”。它解释说，这条推文违反了Twitter禁止“美化暴力”的规定，但被列为“公共服务例外”。\nFacebook拒绝对同样的信息采取行动，扎克伯格在周五的Facebook帖子中表示，尽管他认为这些言论“极具冒犯性”，但该公司认为这些言论并未违反其反对“煽动暴力”的政策。\n“尊重@Twitter的诚信团队做出的执法呼吁，”大卫·吉利斯(David Gillis)写道，他是一名产品设计总监。在一条很长的推特帖子中，他表示，他理解Facebook决定的逻辑，但他表示：“我认为，我们制定一个‘政策精神’例外，将更多的背景考虑在内，这是正确的。”\n托夫是Facebook的几名员工之一，他们正在为帮助明尼苏达州抗议者的非营利组织组织筹款活动。扎克伯格周一早些时候在Facebook上发帖称，该公司将为社会正义事业额外贡献1000万美元。\n“给出一个煽动暴力和散布虚假信息的平台是不可接受的，无论你是谁，或者它是否有新闻价值，”另一位Facebook经理，门户产品的设计主管安德鲁·克罗(Andrew Crow)写道。“我不同意马克的立场，将努力促成变革。”", "note_en": "(Reuters) - Facebook employees critical of CEO Mark Zuckerberg’s decision not to remove an inflammatory comment from U.S. President Donald Trump took their dissent public over the weekend on Twitter, praising the rival social media firm for taking action and rebuking their own employer.\n  Many tech workers at companies including Facebook, Google and Amazon have become active on social justice issues in recent years and urged their employers take action and change policies.\n Still, the criticism of Zuckerberg marked a rare case of high-level employees publicly taking their own CEO to task, with at least three of the seven critical posts seen by Reuters coming from people who identified themselves as senior managers.\n “Mark is wrong, and I will endeavor in the loudest possible way to change his mind,” wrote Ryan Freitas, whose Twitter account identifies him as director of product design for Facebook’s News Feed. He added he had mobilized “50+ likeminded folks” to lobby for internal change.\n Jason Toff, identified as director of product management, wrote: “I work at Facebook and I am not proud of how we’re showing up. The majority of coworkers I’ve spoken to feel the same way. We are making our voice heard.”\n  Twitter on Friday hid a tweet from Trump that included the phrase “when the looting starts, the shooting starts” behind a warning label. It explained the tweet violated Twitter’s rules against “glorifying violence” but was being left up as a “public service exception.”\n Facebook declined to take action on the same message, with Zuckerberg saying in a Facebook post on Friday that while he found the remarks “deeply offensive,” the company decided they did not violate its policy against “incitements to violence.”\n  “Respect to @Twitter’s integrity team for making the enforcement call,” wrote David Gillis, identified as a director of product design. In a long Twitter thread he said he understood the logic of Facebook’s decision, but said: “I think it would have been right for us to make a ‘spirit of the policy’ exception that took more context into account.”\n Toff was one of several Facebook employees who were organizing fundraisers for non-profit groups assisting protesters in Minnesota. Zuckerberg said in a Facebook post early Monday that the company would contribute an additional $10 million to social justice causes.\n “Giving a platform to incite violence and spread disinformation is unacceptable, regardless who you are or if it’s newsworthy,” wrote another Facebook manager, Andrew Crow, head of design for the Portal product. “I disagree with Mark’s position and will work to make change happen.”", "posttime": "2020-06-01 21:08:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,员工,zuckerberg", "title": "Facebook的扎克伯格因裁决特朗普的言论而面临员工反弹", "title_en": "Facebook's Zuckerberg faces employee blowback over ruling on Trump comments", "transed": 1, "url": "https://www.reuters.com/article/us-facebook-trump-employee-criticism/facebooks-zuckerberg-faces-employee-blowback-over-ruling-on-trump-comments-idUSKBN2382D0", "via": "", "real_tags": ["facebook", "员工"]}, {"category": "", "categoryclass": "", "imagename": "250a285deaf97b34e3b7170ab4591439.jpeg", "infoid": 1004649, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "休闲游戏公司Zynga周一宣布，将以18亿美元现金加股票的方式收购土耳其手机游戏开发商Peak。\n这笔交易使匹克的100多人团队以及两款成功的益智游戏--卡通爆炸(Toon Blast)和玩具爆炸(Toy Blast)--进入了Zynga的花名册。Zynga在其声明中表示，在过去的两年里，这两个游戏特许经营权一直位居App Store上票房收入前10名或前20名的游戏之列。\nZynga表示，这笔交易包括9亿美元的现金和9亿美元的Zynga股票，收购预计将在2020年第三季度完成。该公司表示，此次收购将提高利润率，并完善其游戏产品。\n这笔交易达成之际，由于冠状病毒大流行，Zynga正在经历财务提振。该公司表示，截至3月底，该公司经历了其历史上最好的第一季度收益，报告称营收同比增长52%，至4.04亿美元。该公司将2020年全年营收指引上调至17亿美元。该公司的股价也在攀升，周五收盘时达到了2020年的最高点9.15美元。\nZynga预计，此次收购将使其日均移动活跃用户增加60%以上，匹克的两款游戏日均用户总数将达到1200万。\nZynga首席执行官弗兰克·吉博(Frank Gibeau)在一份声明中表示：匹克是世界上最好的益智游戏制造商之一，能够为我们的公司增添如此富有创造力和激情的人才，我们感到无比兴奋。\n匹克首席执行官Sidar Sachin在一份声明中说：这不仅对Zynga和匹克来说是一次不朽的合作，而且对整个移动游戏行业都是如此。\n两家公司都有一个共同的愿景--通过游戏让人们走到一起。匹克的文化植根于不懈的学习和进步，因此，当我们与Zynga一起踏上这段旅程的新篇章时，我们将一如既往地致力于我们独特的文化。萨钦补充说：我们对我们共同的未来以及我们将共同取得的成就感到非常兴奋。", "note_en": "Casual gaming firm Zynga will buy Turkish mobile game developer Peak for $1.8 billion in a cash-and-share deal, the firm announced Monday.\n The deal brings Peak&#39;s 100-strong team plus two successful puzzle games, &#34;Toon Blast&#34; and &#34;Toy Blast,&#34; to Zynga&#39;s roster. Zynga stated in its announcement that the two game franchises have consistently ranked in the top 10 or 20 grossing games on the App Store over the past two years.\n Zynga stated that the deal comprised $900 million in cash, and $900 million in Zynga stock, with the acquisition expected to close in the third quarter of 2020. The company said the acquisition will boost its margins and round out its games offering.\n The deal comes as Zynga experiences a financial boost thanks to the coronavirus pandemic. The company said it had experienced its best first-quarter earnings in its history at the end of March, reporting that revenue was up 52% year on year to $404 million. The firm raised its full-year 2020 guidance to $1.7 billion in revenue. The company&#39;s stock price has also climbed, hitting a 2020 high of $9.15 at close on Friday.\n   Zynga expects the acquisition to bolster its average mobile daily active users by more than 60%, with Peak&#39;s two games collectively averaging 12 million daily users.\n Frank Gibeau, chief executive of Zynga, said in a statement: &#34;Peak is one of the world&#39;s best puzzle game makers and we could not be more excited to add such creative and passionate talent to our company.&#34;\n Peak CEO Sidar Sachin said in a statement: &#34;This is a monumental partnership not only for Zynga and Peak, but for the whole mobile gaming industry.&#34;\n &#34;Both companies share a common vision — to bring people together through games. Peak&#39;s culture is rooted in relentless learning and progress, so as we embark on this new chapter in our journey together with Zynga, we remain as committed as ever to our unique culture. We&#39;re very excited for our combined future and what we will accomplish together,&#34; added Sachin.", "posttime": "2020-06-01 20:49:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "peak,buy,zynga", "title": "Zynga将以18亿美元收购Peak Games", "title_en": "Zynga to buy Peak Games for $1.8B", "transed": 1, "url": "https://www.businessinsider.com/zynga-acquires-peak-gaming-1-8-billion-2020-6", "via": "", "real_tags": ["peak", "buy", "zynga"]}, {"category": "", "categoryclass": "", "imagename": "06144e64293d85f9a89bf76e3c3ee3de.jpg", "infoid": 1004648, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "抱怨冬天是为数不多的可靠安全的闲聊堡垒之一。有些人抗议-我绝对喜欢冰冻-但大多数人会很高兴地进行冬季狂欢。除了广泛使用取暖的家庭、办公室和车辆外，新的行业也在不断涌现，因为它们有望与冬天作斗争。保湿护肤法被认为是保持皮肤完好无损的唯一方法，而大型羽绒服甚至被认为是在户外度过几分钟所必需的。模仿太阳的灯和维生素承诺帮助我们保持生存的意志。\n看着这场斗争，随着冬季的循环深渊吸走了整个城市的活力，我开始怀疑更全面的选择。也许我们的思想和身体在告诉我们，我们不应该这么拼命地战斗。也许关闭自己会更容易、更有效率--为更好的月份储备能源。随着白天变短变暗，纽约地铁上的眼睛变得空荡荡的，我变得激进起来：我们不冬眠绝对是荒谬的。\n除了社会和经济上不可能一次休憩几个月之外，冬眠在身体上的可能性比我想象的要小。一小群科学家非常认真地对待人类的冬眠。他们正在研究基本机制，着眼于各种应用，例如在修复危重伤害时保留无脉搏的创伤受害者，深空旅行，以及改变代谢率以帮助人们减肥。\n“人类很有可能冬眠，”阿拉斯加大学北极生物学研究所教授凯利·德鲁(Kelly Drew)说。德鲁研究北极地松鼠，这种矮胖的小动物一年中有八个月消失在洞穴里。当她和我交谈时，下午2点(就在日落前)，她在费尔班克斯的实验室里的温度是零下35华氏度(没有寒风)。突然间，我冬眠的理由变得微不足道了。\n德鲁解释说，冬眠的本质是体温调节。降低身体核心温度会导致低代谢状态的“麻木”，在这种状态下动物几乎不需要食物。我们“温血”动物燃烧的大部分卡路里都用于维持我们的体温--我们的基础代谢率。例如，德鲁研究的松鼠蜷缩成小球，然后从99度骤降到27度。这会使他们的基础代谢率下降约99%。\n即使是像我们这样的灵长类矮狐猴，也同样可以通过降低体温将它们的卡路里需求减少到2%。不幸的是，人类似乎有一个顽固的固定设定点：98.6度。除了与睡眠时间一致的夜间下降等微小的日常波动外，我们的体温变化只是作为危险发烧或体温过低的迹象。仅仅几度的温度就可能意味着健康和迫在眉睫的死亡之间的区别。\n长期以来，人们一直认为这个设定点是一成不变的，但事实可能并非如此。尽管人类通常不会进入自我意志的麻木状态--我们的身体通常通过颤抖来阻止--但德鲁解释说，没有一个人类缺乏的“冬眠分子”或器官。事实上，在极端情况下，医生可以诱发麻木。例如，外科医生在心脏必须长时间停止的手术中使用低温-允许大脑和其他器官在缺乏燃料的情况下存活更长时间。降温也用于心脏骤停后的紧急情况。用循环冷水的毯子覆盖服用镇静剂的患者被认为具有类似于将冰袋放在扭伤的脚踝上的效果，减少炎症过程，将对心脏和中枢神经系统的持久损害降至最低。\n冷却现在在医院里被广泛使用，一些医生开始相信这一原则可以进一步发展-本质上是让人在死后继续活着。在马里兰大学，外科医生塞缪尔·蒂舍曼(Samuel Tisherman)正在研究他所说的“紧急保存和复苏”(EPR)，这是一种实验方案，医生可以迅速为心脏停止跳动的创伤患者降温。这可以为紧急手术争取时间。现在，在严重创伤的情况下，病人可能只有几分钟的生命了-不足以活到手术台上。例如，Tisherman描述了一个主动脉受枪伤的人，他内出血非常快。如果那个人的心脏停止跳动，Tisherman的团队将通过手术打开胸部并按摩心脏，使其在试图修复主动脉时保持跳动。这只需要几分钟，但当病人失血过多时，就结束了。由于缺氧，大脑在几分钟内就会死亡。\n冷却可以延长这一关键窗口。Tisherman解释说，即使心脏停止跳动，大脑也可以在足够低的温度下存活大约两个小时。在这种情况下诱导麻木将意味着降温必须非常迅速-需要一个由麻醉师、外科医生和心脏病学家组成的团队在几乎没有事先通知的情况下同步工作。但是科学就在那里。“这些损伤在技术上是可以修复的，”Tisherman说。“这些限制与其说是生理上的，不如说是后勤上的。”\n这就引出了这样一个问题，即这种生理可能会以其他方式改变，无论是治疗上的还是其他方面的。如果致命的伤者可以活下来，那么在不那么极端的情况下，温度是否可以用来减缓新陈代谢过程呢？一个人能在健康的状态下“冬眠”多久？\n这个问题正受到美国国家航空航天局(NASA)的认真对待。从2014年开始，该机构资助了关于长期冬眠的研究，以此作为促进长期太空旅行的一种方式。例如，前往火星受到宇航员吃饭和四处走动等顽固需求的限制。但是，如果他们的新陈代谢过程可以减慢到几乎为零，理论上他们可以旅行得更远。“明显的好处是需要更少的食物，”约翰·布拉德福德(John Bradford)说，他是一名航空工程师，曾与该机构合作制定人类冬眠协议。一名机组人员将保持清醒，而其他人将冬眠两周。它们可以保存在小吊舱中，最大限度地减少船内需要包裹在辐射阻挡罩中的空间量，因为辐射阻挡罩非常重，而且燃料效率很低。\n尽管他的协议尚未实际执行，但布拉德福德对此持乐观态度。他说：“我们找不到任何令人惊叹的东西，任何理由都不可能做到这一点。”尽管如此，医疗并发症的风险并不是零。因为我们的身体不储存食物，宇航员将不得不通过管子进食(通过外科手术将腹部前部钻一个洞插入胃中)。布拉德福德说，最大的挑战将是降低人们的温度，而不会导致他们发抖和消耗能量。在医院里，可以用镇静剂来克服颤抖，但布拉德福德的团队对让一组宇航员连续几周或几个月服用大量镇静剂持谨慎态度。\n我们真正需要的是一种可以安全地降低人体核心体温的药物，它可以引发许多其他物种享受的那种麻木。Bradford和Tisherman都指出这种药物是一种潜在的突破-一种解决他们工作中最明显的限制因素的方法。事实上，北极松鼠生物学家德鲁有一种药物，她相信可以做到这一点。她将其功能描述为“调低你的恒温器”。它在老鼠身上可靠地发挥作用，这是一种非冬眠动物，一直是她的实验模型，德鲁正在与美国食品和药物管理局(U.S.Food and Drug Administration)就人体测试进行谈判。2019年，美国国立卫生研究院(National Institutes Of Health)为她的工作提供了1180万美元的拨款，这表明这种疗法对人类的吸引力并不局限于那些技术上已经死亡或正在前往火星的人。\n德鲁说，降温有可能在治疗许多炎症性疾病方面发挥作用。她还对体温调节在失眠中的作用感兴趣。在某些情况下，这种紊乱似乎是由于人体每晚标准的周期性降温存在缺陷，因此调温药物可能有助于诱导睡眠。与此同时，其他研究人员正在研究温度依赖的代谢途径在肥胖和糖尿病中是如何受到影响的，以及它们是否可以被重置。正如德鲁所说，“认为体温是我们可以控制的，这是医学重大变革的开始。”\n至于在1月到3月期间使用这种药物选择性冬眠，我现在肯定那会要了我的命。除了大脑温度设定点的问题外，人类还有解剖学上的障碍。例如，德鲁说，她的老鼠只能被诱导冬眠大约两周，然后才会出现脓毒症，显然是因为肠壁的破裂。与我们的不同，许多冬眠动物的肠道在解剖学上是适应这种做法的。黑熊的内脏确实与人类更相似，它们通过循环通过一定范围的体温来维持冬眠，而不是整整几个月都在直线下降。人类的冬眠很可能需要类似的循环，这将比简单地用药片关闭身体的恒温器要复杂得多。\n我的冬季冬眠计划(显然已经是致命的)的最后一个缺陷是冬眠不同于sle EP，也没有明显的恢复功能。布拉德福德解释说，即使我设法保持昏迷而没有肠子破裂，我出来时也不一定会感到休息。他说：“我相信有些人会喜欢在周末或一周内打卡外出。”\n我们想听听您对这篇文章的看法。向编辑提交一封信，或写信给letters@theatlantic.com。\n医学博士，是“大西洋月刊”的特约撰稿人。他也是耶鲁大学公共卫生学院的讲师，也是即将出版的“清洁”一书的作者。", "note_en": "Complaining about winter is one of the few remaining bastions of reliably safe small talk. Some people protest— I absolutely love freezing—but most will happily engage in winter bashing. In addition to widespread access to heated homes, offices, and vehicles, new industries continue to emerge on the promise of combatting winter. Moisturizing skin-care regimens are sold as the only way to keep our skin in one piece, and massive down coats are deemed necessary for spending even a few minutes outside. Sun-imitating lamps and vitamins promise to help us maintain a will to live.\n   Watching the struggle, as the cyclic abyss of winter sucks the vitality out of entire cities, I started to wonder about more comprehensive options. Maybe our minds and bodies are telling us we’re not supposed to be fighting so hard. Maybe it would be easier and more efficient to just shut ourselves down—to stock up energy for the better months. As the days grew shorter and darker, the eyes on New York’s subway emptier, I grew radicalized: It is absolutely ridiculous that we don’t hibernate.\n Aside from the social and financial impossibility of recreationally detaching for months at a time, hibernation turns out to be less physically impossible than I imagined. A small group of scientists is taking human hibernation extremely seriously. They are studying the basic mechanisms with an eye to all kinds of applications, such as preserving pulseless trauma victims while critical injuries are repaired, deep-space travel, and altering metabolic rates to help people lose weight.\n    “It’s very possible that humans could hibernate,” says Kelly Drew, a professor at the University of Alaska’s Institute of Arctic Biology. Drew studies arctic ground squirrels, chunky little creatures that disappear into burrows for eight months of the year. When she and I spoke, it was 35 degrees Fahrenheit below zero (without wind chill) at her lab in Fairbanks, at 2:00 in the afternoon (just before sunset). Suddenly my case for hibernation felt trivial.\n  The essence of hibernation, Drew explains, is body-temperature regulation. Dropping the body’s core temperature induces a low-metabolic state of “torpor,” in which animals require almost no food. Most of the calories we “warm-blooded” animals burn go into maintaining  our body temperatures—our basal metabolic rate. The squirrels Drew studies, for example, curl up into little balls and plummet from 99 degrees to 27. This drops their basal metabolic rate by about  99 percent.\n Even dwarf lemurs, primates like us, can similarly reduce their caloric needs to 2 percent by dropping their temperatures. Humans unfortunately seem to have a stubbornly fixed set point: 98.6 degrees. Apart from minuscule daily fluctuations like a night-time drop that coincides with sleep, our temperatures only change as an indication of peril—fever or hypothermia. Just a few degrees can mean the difference between health and imminent death.\n  This set point was long thought to be immutable, but it may not be. Even though humans don’t typically go into torpor of their own volition—and our bodies typically prevent it by shivering—Drew explains that there’s no single “hibernation molecule” or organ that humans lack. In fact, torpor can be induced by doctors in extreme circumstances. Surgeons, for example, use hypothermia during procedures in which the heart must be stopped for a prolonged period—allowing the brain and other organs to survive longer while deprived of fuel. Cooling is also used in emergency cases after cardiac arrest. Covering sedated patients in blankets that circulate cool water is believed to have a similar effect to putting an ice pack on a sprained ankle, decreasing the inflammatory process to minimize lasting damage to the heart and central nervous system.\n Cooling is now widely practiced in hospitals, and some doctors have come to believe the principle could be taken further—essentially keeping people alive after they die. At the University of Maryland, the surgeon Samuel Tisherman is studying what he calls “emergency preservation and resuscitation,” or EPR, an  experimental protocol in which doctors rapidly cool trauma victims whose heart stops beating. This could buy time for emergency surgery. Right now, in a severe trauma case, a patient may only have a matter of minutes to live—not enough to make it to the operating table. For example, Tisherman describes a person with a gunshot wound to the aorta who’s bleeding internally, very quickly. If that person’s heart stops, Tisherman’s team will surgically open the chest and massage the heart to keep it pumping as they try to repair the aorta. This only takes a few minutes, but when the patient loses too much blood, it’s over. Deprived of oxygen, the brain dies within minutes.\n    Cooling could extend that crucial window. Even with the heart stopped, the brain can survive for roughly two hours at a low enough temperature, Tisherman explains. Inducing torpor in such circumstances would mean cooling would have to happen very quickly—requiring a team of anesthesiologists, surgeons, and cardiologists all working in step with almost no advance notice. But the science is there. “These injuries are technically fixable,” Tisherman says. “The limitations are more logistical than physiological.”\n This raises the question of other ways this physiology could be altered, therapeutically or otherwise. If a fatally wounded person could be kept alive, could temperature be used to slow metabolic processes in less extreme scenarios? How long could a person stay “hibernating” in good health?\n This question is being treated seriously by NASA. Beginning in 2014, the agency  funded research on long-term hibernation as a way to facilitate long-term space travel. Going to Mars, for example, is limited by the stubborn needs of astronauts to do things like eat and move around. But if their metabolic processes could be slowed to almost zero, they could theoretically travel much farther. “The obvious benefit is needing less food,” says John Bradford, an aerospace engineer who worked with the agency to develop a  human-hibernation protocol. One crew member would stay conscious while the others hibernated for two-week periods. They could be kept in small pods, minimizing the amount of space in the ship that needs to be encased in radiation-blocking shields, which are extremely heavy and fuel-inefficient.\n  Though his protocol hasn’t actually been executed, Bradford is optimistic. “We couldn’t find any showstoppers, any reason it wouldn’t be possible,” he says. Still, the risk of medical complications is not zero. Because our bodies don’t store food reserves, the astronauts would have to be fed through a tube (surgically inserted by boring a hole through the front of the abdomen into the stomach). Bradford says the biggest challenge would be dropping people’s temperatures without causing them to shiver and burn up energy. In hospitals, shivering is overcome with sedative medications, but Bradford’s team is wary of having a team of astronauts take heavy sedatives for weeks or months.\n  What’s really needed is a drug that could drop a person’s core temperature safely, inducing torpor of the sort that so many other species enjoy. Bradford and Tisherman both point to this sort of drug as a potential breakthrough—a way to address the clearest limiting factors in their work. And, in fact, the arctic-squirrel biologist Drew has a drug that she believes could do exactly this. She describes its function as “turning down your thermostat.” It works reliably  in rats, a nonhibernating animal that has served as her experimental model, and Drew is in talks with the U.S. Food and Drug Administration about human testing. In 2019, the National Institutes of Health  funded her work with an $11.8 million grant, suggesting the appeal of such therapies for humans is not limited to those who are technically deceased or en route to Mars.\n    Cooling has the potential to play a part in treating many inflammatory diseases, says Drew. She is also interested in the role of  thermoregulation in insomnia. In some cases, the disorder seems to be due to a flaw in the human body’s standard cyclic dip in temperature each evening, so temperature-modulating drugs could help induce sleep. Other researchers, meanwhile,  are studying how temperature-dependent metabolic pathways are affected in obesity and diabetes, and whether they could be reset. As Drew puts it, “Thinking about body temperature as something we can control is the beginning of a major change in medicine.”\n  As for using such a drug to electively hibernate from January to March, I’m now certain that would kill me. Beyond the issue of the brain’s thermal set point, there are anatomical barriers for humans. For example, Drew says that her rats can only be induced into hibernation for about two weeks before they develop sepsis, apparently because of a breakdown of the bowel wall. Many hibernating animals have guts that are anatomically adapted to the practice, unlike ours. Black bears do have guts more similar to humans’, and they sustain hibernation by cycling through a range of body temperatures instead of plummeting for entire months. Human hibernation would likely require similar cycling, which would be more complicated than simply switching off the body’s thermostat with a pill.\n A final flaw in my (already apparently fatal) winter hibernation plan is that hibernation is  different from sle ep, and doesn’t clearly have the same restorative benefits. Even if I managed to stay unconscious without having my bowels rupture, Bradford explained, I wouldn’t necessarily come out feeling rested. “I’m sure there are people who would love to kind of punch out for a weekend or a week,” he said, “but we don’t know if there’s any therapeutic benefit to doing that.”\n  We want to hear what you think about this article.  Submit a letter to the editor or write to letters@theatlantic.com.\n            , M.D., is a staff writer at  The Atlantic. He is also a lecturer at Yale School of Public Health and author of the forthcoming book   Clean.", "posttime": "2020-06-01 20:31:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冬眠,hibernate", "title": "你也许可以冬眠", "title_en": "You Could Probably Hibernate", "transed": 1, "url": "https://www.theatlantic.com/health/archive/2020/01/human-hibernation-real-possibility/605071/", "via": "", "real_tags": ["冬眠", "hibernate"]}, {"category": "", "categoryclass": "", "imagename": "939f0bfc6a698a00ec9e5288fc3f6021.jpg", "infoid": 1004647, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当苹果在2019年6月的全球开发者大会上宣布登录苹果时，它称这是一种更私密的方式，可以简单、快速地登录应用程序和网站。这个想法过去是，现在仍然是一个好主意：用一个安全的身份验证系统取代可以用来收集个人数据的社交登录帐户，该系统得到了苹果承诺不会分析用户或他们的应用程序活动的支持。\n当时获得大量关注的一个优点是，用户可以在不需要透露他们的Apple ID电子邮件地址的情况下注册第三方应用程序和服务。不出所料，它被认为是一种比使用Facebook或Google账户更注重隐私的选择。\n快进到2020年4月，德里的一名安全研究人员发现了一个带有苹果漏洞的关键登录，可能会让攻击者只用一个电子邮件ID就能控制一个账户。这个关键漏洞被认为足够重要，以至于苹果通过其漏洞赏金计划向他支付了10万美元(约合8.1万英镑)作为奖励。\n由于苹果现在已经在服务器端修补了这个漏洞，Bhavuk Jain在5月30日公布了他披露的这个令人震惊的安全漏洞。虽然这个漏洞只与使用苹果登录的第三方应用程序有关，但没有采取任何进一步的安全措施，但它令人震惊的原因有两个。\n首先，因为它可以允许完全接管这些应用程序的用户账户，而不管受害者是否使用了有效的Apple ID电子邮件。\n其次，可能更令人震惊的是，因为苹果在开发过程中自己没有发现这个关键的安全漏洞。\n坦率地说，我不会深入讨论这个漏洞是如何在这里被利用的技术细节，因为除了最书呆子的读者之外，所有人都不会理解它。如果你想深入了解这一切，请看一看全部披露的内容。简而言之，贾恩发现他可以向苹果申请任何电子邮件ID的认证令牌，然后使用苹果的公钥进行验证，并因此确定为有效。\n因此，攻击者可以伪造链接到任何电子邮件ID的令牌，并使用该令牌访问受害者的帐户。向第三方应用程序隐藏您的电子邮件ID并不能阻止此攻击。\n这就是说，重要的是要注意到，贾恩说，苹果公司进行了内部调查，并确定在漏洞修复之前没有发生任何账户泄露或滥用事件。\n我与ImmersiveLabs的中小企业应用安全主管肖恩·赖特(Sean Wright)谈到了这个漏洞，他称这个漏洞是一个重大缺陷。赖特还表示，他原本希望苹果这样的公司能在这个问题上进行更好的测试，尤其是在苹果试图树立注重隐私的声誉的情况下。\n我已经要求苹果就这一问题发表声明，如果有即将发布的声明，我将更新文章。", "note_en": "When Apple announced Sign in with Apple at the June 2019 worldwide developers conference, it called it a &#34; more private way to simply and quickly sign into apps and websites.&#34; The idea was, and still is, a good one: replace social logins that can be used to collect personal data with a secure authentication system backed by Apple&#39;s promise not to profile users or their app activity.\n  One of the plus points that got a lot of attention at the time was the ability for a user to sign up with third-party apps and services without needing to disclose their Apple ID email address. Unsurprisingly, it has been pushed as being a more privacy-oriented option than using your Facebook or Google account.\n  Fast forward to April 2020, and a security researcher from Delhi uncovered a critical Sign in with Apple vulnerability that could allow an attacker to potentially take over an account with just an email ID. A critical vulnerability that was deemed important enough that Apple paid him $100,000 (£81,000) through its  bug bounty program by way of a reward.\n          With the vulnerability already now patched by Apple on the server-side,  Bhavuk Jain published his disclosure of the security shocker on May 30. Although the vulnerability related only to third-party apps which used Sign in with Apple without taking any further security measures, it&#39;s shocking for two reasons.\n    Firstly as it could have allowed a full takeover of the user accounts of those applications regardless of the victim using a valid Apple ID email or not.\n  Secondly, and potentially even more of a shocker, because Apple didn&#39;t catch this critical security flaw itself during development.\n       I&#39;m not going to go into the technical detail of how this vulnerability could have been exploited here as, frankly, it will go over the heads of all but the geekiest of readers. Take a look at the full disclosure if you want a deep dive into it all. The long and short of it being that Jain found he could request authentication tokens for any email ID from Apple, which would then be verified using Apple&#39;s public key and, as such, determined as being valid.\n  An attacker could, therefore, forge a token linked to any email ID and gain access to the victim&#39;s account using it. Hiding your email ID from the third-party app wouldn&#39;t have prevented this exploit.\n  That said, it&#39;s important to note that Jain said Apple carried out an internal investigation and determined that no account compromises or misuse had occurred before the vulnerability was fixed.\n       I spoke to Sean Wright, SME application security lead at ImmersiveLabs, regarding the vulnerability which he describes as being &#34;a significant flaw.&#34; Wright also says that he &#34;would have expected better testing around this from a company such as Apple, especially when it is trying to set itself a reputation as privacy-focused.&#34;\n  I have asked Apple for a statement regarding this issue and will update the article if one is forthcoming.", "posttime": "2020-06-01 19:43:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,漏洞,app,apple,研究", "title": "安全研究人员发现严肃的“与苹果签到”Hole获得10万美元的漏洞赏金", "title_en": "Finding Serious 'Sign In with Apple' Hole Earns Security Researcher a $100,000 Bug Bounty", "transed": 1, "url": "https://www.forbes.com/sites/daveywinder/2020/05/31/apple-pays-hacker-100000-for-sign-in-with-apple-security-shocker/", "via": "", "real_tags": ["苹果", "漏洞", "app", "apple", "研究"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004646, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我13岁开始上高中时，我读到了ESR的博客文章：如何成为黑客。我很兴奋地了解到程序员社区一起在互联网上构建东西，这让我尝试安装Fedora Core4，并最终安装Ubuntu 6.06，通过它，我学到了很多关于自己排除故障并试图让事情真正正常工作的知识。这最终对培养技能至关重要，这些技能帮助我获得了现在的工作。我读了关于Python的书，写了一些琐碎的程序，于是决定学习计算机科学，了解计算机的实际工作原理。在我不确定自己想做什么的时候，这是一个很有影响力的帖子。\n在布法罗郊区长大的纽约可能相当与世隔绝-虽然我很幸运，我父亲在大学里编写了一台Apple II作为娱乐(所以有一些背景/黑客精神)，但他对更现代的软件开发知之甚少。我喜欢电脑，也喜欢玩电脑，但我不太知道什么是可能的，甚至不知道到哪里去了解更多。当搜索空间如此之大，有许多未知的未知因素时，甚至很难找到好的信息来源来学习。能够选择好的信息源需要一些现有的知识，如果没有经验丰富的人的指导，这可能是困难的。我认为现在情况可能更好了，因为互联网更发达了，但在某些方面，现在比那时有更多的选择可供选择。\n16年后，我觉得写一本自己版本的“如何成为黑客”来补充ESR的原著会很有趣：这本书我在13岁的时候就想读一读，集中在其他一些我也会觉得有帮助的方面。许多关于编程和相关话题的帖子都在鼓噪，试图说服你采用一种特定的编程语言、框架、操作系统或特定的做事方式。这篇文章做得较少，虽然我提出了一些建议，但它是一个更温和的观点。它的目标是填补我想在ESR的原始帖子之后读到的利基(所以你应该先读那篇)。\n一开始，我记得我读过一些文章和书籍，但不懂很多行话--这是很正常的。起初看起来难以理解的事情，随着你接触到更多的东西，慢慢地变得可以理解，并深入了解每一件你不理解的事情。保持阅读和精力充沛地阅读是很好的，在你不理解的时候查找它们，当你可以的时候问问题(ESR也有一个关于如何问好问题的很好的帖子)。\n每个人都会在某个时候第一次学到一些东西，然后事情就会慢慢积累起来，直到你对基础知识更加熟悉。我记得我不理解一些小细节(比如不知道在终端中输入命令来运行它们，或者CD代表“更改目录”)。你从暴露中学到了这些东西，你玩得越多，你接触到的东西就越多，积累的经验也就越多。如果您足够幸运地住在一个有一群人对软件感兴趣的地区，您将能够更快地学习。\n学习复杂的新东西一开始往往感觉很困难--如果感觉很容易，那可能是你已经知道的东西，或者你可能并不是真的在测试你的知识(读到如何解决物理问题并认为“这是有意义的”要比用你刚刚读到的工具自己解决问题容易得多)。挣扎可能是个好兆头--这意味着你真的在学习，通过专注于做类似类型的事情，当你变得更好的时候，事情就会变得更容易。\n我认为完全陌生的人甚至还有一点优势：当我积累了一点经验后，只做我已经知道怎么做的事情就会变得容易和舒适，而不是学习新的东西。这可能会导致你陷入一种停滞不前的状态，在那里你只能重复做你已经知道怎么做的事情，就像一个人只能用吉他弹一首歌，而且总是只弹这一首歌。对于一个新人来说，每件事都很难，所以这不是一个真正的选择。\n第一次学习复杂的东西应该会觉得有点痛苦--你应该习惯这种感觉，因为这是一件好事，意味着你在成长。别让它把你吓跑了，因为你认为自己不够聪明。因为有这么多东西要学，有很多不同的途径可供学习(仅在计算机中就有计算机图形学、安全、机器学习、算法、移动、网络、基础设施等)，拥有一种允许自己成长并走出舒适区学习新事物的心态是至关重要的。\n仅仅通过阅读一本关于编程的书来学习编程就像只通过阅读一本关于跳伞的书来学习跳伞一样。您可能需要阅读这本书(在开始时，您将需要从它开始)-但它不会坚持下去，除非您同时还在编写小程序。木匠通过造东西变得更好，作家通过写东西变得更好，程序员通过编程变得更好。这并不是说你不应该读书，或者好书不是特别有价值(它们是非常有价值的)，而是很容易落入这样的陷阱，你读关于编程的书却没有实际做任何事情，因为读起来比做起来更容易，而且当你刚开始的时候，很难想出一些可以在真空中编程的东西。\n我同意ESR的观点，即Python是一种很好的入门语言，有一个很好的在线网站，名为“艰难地学习Python”，它主要面向初学者，并在教学过程中使用练习。\n刚开始的时候，语法很难理解，当你学习的时候，很多时间都花在了这一点上。因为每种编程语言都有不同的语法，所以它们看起来非常不同。然后，您将开始掌握语法，更多的是关于如何解决问题以及使用什么数据结构的一般结构。最终，您会熟悉常见的数据结构，然后讨论转向更高级别的抽象和更通用的设计或基础设施，这些设计或基础设施使事情更易于大规模管理或在未来更容易更改。\n在掌握一门语言的语法并能够编写简单的程序之后，学习数据结构是最重要的下一步。有几个核心数据结构在破解编码访谈书(以及示例问题)中有相当详细的描述。令人困惑的是，对于相同数据结构的实现，语言往往有不同的名称(例如，Python将哈希表称为“字典”)，但是大多数语言都会有一些核心数据结构的实现，即使它们有唯一的名称。\n故障排除或调试也是一项核心编程技能-大多数编程实际上都是在调试，所以如果您喜欢调试问题，这可能是一个好兆头。当您不得不四处搜索以尝试和理解某些东西时，或者当您正在阅读的文档不起作用时，或者当您在环境中遇到一些意外错误时，不要灰心丧气-这是正常的(这不是您能力的反映)。\n大多数软件都不能工作，而且经常有未记录在案的错误、错误和很难纠正的小细节。例如，Github上的大多数开放源码项目都会有某种构建系统来处理软件配置以运行的问题。这将做一些事情，比如拉入依赖项(它工作所需的其他代码)，以及执行任何必要的命令以实际使其运行。如果您要在Github上下载一个有趣的项目并尝试运行它，您可能会在此过程中遇到意外错误，这些错误通常没有文档记录。\n运行这些错误并解决问题是正常的，也是有经验的程序员必须处理的事情(如果幸运的话，我们以前刚刚看到过这种类型的问题)。我见过人们犯这样的错误，认为他们做错了什么，但这不是你的错--事情就是这样。围绕构建系统和试图使它们变得更好(这可能会使初学者更加困惑，因为没有真正的标准化，配置软件运行的正确方式取决于编程环境和语言)，有很多竞争工具甚至行业。\n我记得当时很沮丧，因为很难找到关于计算机实际工作原理的信息。我寻找的每一件事都只是用无用的过于简单化的类比谈论计算机(磁盘是“存放文件的文件柜”)，但我实际上读不到任何东西来理解事物的真正工作原理，所以如果被转移到过去，我将能够真正解释如何建造一个计算机。具体地说，这更多的是电气或计算机工程，而不是软件，但了解硬件方面仍然有很大的价值(而且很有趣！)\n我推荐的最好的书是查尔斯·佩佐德的“密码”。它将带您了解基础知识，从电比特开始，一直到布尔逻辑和电路设计的历史--使用简单电路的实际图纸，以及如何在内存中存储比特。这是建立在发现的历史上下文中的，直到您构建了一个小型CPU。他还从事一些组装和基本的计算机制图工作。作者是一位非常清晰的作家和教师，所以这本书的细节可读性令人惊讶。\n如果想了解更多的历史背景，我会推荐M·米切尔·沃尔德普的“梦幻机器”和史蒂文·利维的“黑客”。叙事性故事使学习和记忆事物变得更容易，我认为这些发现的背景有助于了解事物的实际运作方式。\n工具很有趣，了解您的工具也很好，但是您可能永远都在定制东西和争论不太重要的小细节。当您刚开始学习时，定制工具可能是一种有趣的学习方式，但是我看到人们在这上面花费了大量的时间，因为与实际编写解决问题的程序或者只是更多地了解一般的编程技巧相比，它产生的价值相对较少(目前设计数据密集型应用程序是一本很好的样例书)，但是我看到人们在这方面花费了大量的时间，因为与实际编写程序来解决问题或只是更多地了解编程技巧相比，它产生的价值相对较少。我认为过于专注于定制工具可能会阻碍您的发展。\n不要过于担心Vim或Emacs，或者你使用的是哪种操作系统--你可以在任何地方学习到核心技能(这是我与ESR的帖子最大的不同之处)。尽管如此，玩Linux对我来说是一个非常有价值的学习故障排除的方式-很大程度上是因为它工作得不是很好，我不得不花几个小时做一些事情，比如试图让无线互联网正常工作，让笔记本电脑成功挂起，甚至让UI显示出来(现在情况有点好了)。\n我从尝试安装Gentoo开始(实际上从未成功)。这种故障排除技能对我得到现在的工作真的很有帮助，所以如果你玩不同的操作系统很有趣，我肯定会鼓励你这样做，我只是不认为这是一种要求。不过，在MacOS或Linux上学习可能更容易，因为大多数现有工具都是针对这些环境的，并且大多数程序员都在使用这两种环境中的一种。\n值得一提的是版本控制，特别是git。花一些时间熟悉基础知识是值得的，但在您进行了一段时间的编程之前，可能不会专注于此。\n在开始一个项目之前，通过永远“研究”选项来拖延是很容易的-阅读和探索哪些是可用的是很有趣的，这样做一点也是好的，但你也可能永远被困在这一点上。当有疑问时，只需选择最受欢迎的已存在一段时间的项目，并使用该项目即可。如果它很受欢迎，它可能有一个体面的社区可以让你学习，如果它存在了一段时间，它可能会更稳定(或者至少它会更充实，不太可能被抛弃)。\n我真的很喜欢学习计算机科学，我认为这可能仍然是获得最多机会的最好方式(特别是如果你像我一样住在郊区，周围没有很多软件人员)。如果可能的话，我认为尝试参加你能参加的最好的CS课程可能是件好事。网上也有很多好的课程，但如果你的生活就像我的高中生活一样，在家里就很难真正利用这一点。\n如果学习是获得好成绩的天真解决方案，那么从事酷的编程项目就是在编程面试中取得好成绩的天真解决方案。要在竞争激烈的公司安排面试，你需要非常熟悉leetcode和破解编码面试手册上的问题。编程面试需要大量的练习，这是一项需要自身和自身发展的独特技能。\n你可以通过整个CS学位，但仍然不知道如何编程-你也可以获得CS学位，但仍然不能进行编程面试(这两种情况可能都是默认情况)。学会编程，学会在编程面试中做得很好，需要你自己集中时间。CS在一些方向和集中的项目上提供帮助(Lambda School可能在编程方面做得更好，而且可能在总体上会做得更好)，但您必须自己掌握大量这些知识。\n除了“软件工程师”，还有很多不同类型的角色。SRE(Site Reliability Engineer，站点可靠性工程师)更多地关注运行代码的基础设施，并为此编写软件。有一些内部工具和devops-devs专注于自动化软件构建和测试所需的所有工具(阅读Phoenix Project可以获得一个有趣的故事来说明这一点)。还有一些角色更多地与用户交互，比如开发人员支持工程师(帮助用户处理API并处理错误或配置问题)。有些人专注于游戏引擎，有些人专注于VR或计算机图形学。有些人编写新的计算机语言和新的编译器。\n根据所使用的产品和为解决新问题而创建的新工具，这些角色中的每一个都有更多的专门化。计算机安全也是一个有趣的领域，我对此了解不多，我认为ESR在他的帖子中对此过于不屑一顾，但这也是一个很难开始的地方，因为它需要对事物如何工作的大量现有理解才能知道事物如何被打破。我记得我很早就拿起了这本书，但当时我知道的还不够多，无法真正理解它：黑客：剥削的艺术。\n当然，你也可以创办自己的公司，以这种方式打造自己作为创始人的角色。\n一生是一段很长的时间，而专业不是永远的，所以潜心于不同的事情--尝试许多新事物，并在此过程中享受乐趣。\nESR谈到要加入当地的Linux用户组，但至少对我来说，当我读到他的帖子时，这是不现实的，因为他们真的不是很多，而且我自己也不能那么容易到达任何地方，因为我太小了，不能开车。现在有一些我觉得有趣的在线社区，我想那时我也会觉得有趣。\n黑客新闻：YCombinator的新闻网站(旧金山湾区的创业孵化器)。评论可能会被击中或错过，但好的评论真的很好，很多业内人士都在那里闲逛。保罗·格雷厄姆(Paul Graham)和杰西卡·利文斯顿(Jessica Livingston)是YComposator的创始人，保罗写了很多有趣的文章。\nTwitter：这在很大程度上取决于你关注的是谁，但如果你想成为一个很棒的地方，它也可以是一个很棒的地方。开始时很难知道该追随谁，但你可以看看我关注的每一个人。\n不那么错误：不是专注于编程，但是在理性社区和编程社区之间有相当多的重叠，我喜欢那里的很多文章，这绝对是我在发现如何成为黑客的同时就想找到的东西。这里有一个我很喜欢的例子帖子：定义之争。\n我记得大约在我读到理查德·斯塔尔曼的帖子的时候，ESR回复了我发送的一些关于让iPod在Fedora Core4中工作的电子邮件，我非常肯定理查德·斯塔尔曼也回复了我在那个时候发送的一些电子邮件。我觉得那很不错。本着继续这样做的精神，如果你愿意，请随时向我提出具体的问题。", "note_en": "When I was thirteen and starting high school I read  ESR’s blog post:  How To Become A Hacker. I was excited to learn about the community of programmers working together to build things across the internet and it led me to try installing Fedora Core 4 and eventually Ubuntu 6.06, through which I learned a lot about troubleshooting on my own and trying to get things to actually work. This ended up being critical in developing the skills that helped me get the job I have now. I read about Python and wrote trivial programs, and decided I wanted to study computer science and understand how computers actually work. It was a pretty influential post for me at a time when I wasn’t sure what I wanted to do.\n Growing up in the suburbs of Buffalo, NY can be pretty isolating - and while I was lucky that my dad programmed an Apple II in college for fun (so had some background / hacker spirit), he didn’t know a lot about more modern software development. I liked computers and played with them, but I didn’t know much about what was possible or where to even look to understand more. When the search space is so large and there are a lot of unknown unknowns it can be hard to even find good sources of information to learn from. Being able to select good sources of information requires some existing knowledge and without the guidance of an experienced person it can be difficult. I think things are probably better now that the internet is more developed, but in some ways there are even more options to sift through now than there were then.\n Sixteen years later, I thought it’d be fun to write my own version of How to Become a Hacker to supplement ESR’s original: something I would have liked to have read myself at thirteen that focuses on some other aspects I would have found helpful too. A lot of posts about programming and related topics are rallying cries, trying to persuade you to adopt a specific programming language, framework, operating system, or specific way of doing things. This post does less of that and while I make some suggestions, it’s a more tempered view. Its goal is to fill the niche of what I think I would have liked to have read after ESR’s original post (so you should read that one first).\n  In the beginning I remember reading articles and books, but not understanding a lot of the jargon - this is normal. Things that at first seem incomprehensible slowly become understandable as you’re exposed to more of it and dig into each thing you don’t understand. It’s good to just keep reading and powering through, looking things up as you don’t understand them and  asking questions when you can (ESR also has a good post about  how to ask good questions).\n Everyone learns something for the first time at some point and things will slowly build until you’re more comfortable with the basics. I remember not understanding little details (like not knowing to enter commands in the terminal to run them, or that cd stood for ‘change directory’). You pick up on these things from exposure and the more you play with them, the more you’re exposed to and the more experience you’ll accumulate. If you’re lucky enough to live in an area that has a community of people interested in software you’ll be able to learn faster.\n  Learning something new that’s complicated often feels difficult at first - if it feels easy it may be something you already know or you may not really be testing your knowledge (it’s a lot easier to read about how to solve a physics problem and think ‘this makes sense’ than it is to solve a problem yourself with the tools you just read about). The struggle can be a good sign - it means you’re really learning and by focusing on doing similar types of things it’ll become easier as you get better.\n I think there’s even a bit of advantage that completely new people can have with this: when I develop a little bit of experience it becomes easy and comfortable to just do the thing I already know how to do rather than learn something new. This can lead to getting stuck in a plateau where you just repeatedly do the thing you already know how to do, like a person that can only play one song on guitar and always just plays that one song. To a new person everything is hard so that’s not really an option.\n Learning something complicated for the first time should feel a little painful - you should get used to that feeling since it’s a good thing and means you’re growing. Don’t let it scare you away because you don’t think you’re smart enough. Since there’s so much to learn and a lot of different avenues to go down (just in computers there are things like computer graphics, security, machine learning, algorithms, mobile, web, infrastructure, etc.), having a mindset where you allow yourself to grow and get out of your comfort zone to learn new things is critical.\n  Learning to program by just reading a book about programming is like learning to sky-dive by only reading a book about sky-diving. You probably need to read the book (and in the beginning you’ll need it as a place to start) - but it won’t stick unless you’re also writing little programs alongside it. A carpenter gets better by building things, a writer gets better by writing things, and a programmer gets better by programming things. This doesn’t mean you shouldn’t read books or that good books aren’t extremely valuable (they are), but that it’s easy to fall into a trap where you read books about programming without actually doing anything yourself because it’s easier to read about it then it is to do it, and it can be difficult to come up with something to program in a vacuum when you’re starting out.\n I agree with ESR that Python is a good language to start with, and there’s a nice site online called  learn Python the hard way that is focused on beginners and uses exercises along the way to teach.\n In the beginning the syntax is hard to understand and a lot of time is spent focused on that when you’re learning. Since every programming language has different syntax, they seem very different. Then you start to get a handle on syntax and it’s more about the general structure of how problems are being solved and what data structures are used. Eventually you get comfortable with common data structures and then the discussion turns to higher levels of abstraction and more general designs or infrastructure that make things easier to manage at scale or easier to change in the future.\n Learning about data structures is the most important next step after getting a handle on a the syntax of a language and being able to write simple programs. There are a few core data structures that are pretty well detailed in the  Cracking the Coding Interview book (along with example problems). Confusingly, languages tend to have different names for their implementation of the same data structures (Python calls hash tables ‘dictionaries’ for example), but most languages will have some implementation of the core data structures even if they have a unique name.\n Troubleshooting or debugging is also a core programming skill - most of programming is actually debugging, so if you like debugging problems this is a probably a good sign. Don’t get discouraged when you have to search around a lot to try and understand something or when the documentation you’re reading doesn’t work, or when you’re hitting some unexpected error in your environment - this is normal (it isn’t a reflection of your ability).\n Most software doesn’t work and there are constantly undocumented errors, bugs, and little details that are hard to get right. For example, most open source projects on Github will have some sort of build system which handles getting the software configured to run. This will do things like pulling in dependencies (other code it requires to work), along with executing any necessary commands to actually get the thing running. If you were to download an interesting project on Github and try to run it you’d probably hit unexpected errors with this process that are often not documented.\n Running these errors down and working through problems is normal and something experienced programmers have to deal with too (if we’re lucky we’ve just seen that type of problem before). I’ve seen people hit errors like this and think they’re doing something wrong, but it’s not you - it’s just how things are. There are a lot of competing tools and even industries around build systems and trying to make them better (which can make things more confusing for beginners since there’s no real standardization, and the right way to configure software to run varies depending on programming environment and language).\n  I remember being frustrated that it was hard to find information about how a computer actually worked. Everything I looked for just talked about computers in unhelpful oversimplified analogies (the disk being the ‘filing cabinet for files’), but nothing I could actually read to understand how things  really worked so if transported into the past I would be able to actually explain how to build one. This is more electrical or computer engineering than software specifically, but there’s still a lot of value in understanding the hardware aspects (and it’s interesting!).\n The best book I’d recommend for this is  Code by Charles Petzold. It walks you through the basics starting with electrical bits all the way up through the history of Boolean logic and circuit design - with actual drawings of simple circuits and how you can store bits in memory. This builds on itself in the historical context of the discoveries until you’ve built a small CPU. He also goes into some assembly and basic computer graphics. The author is a really clear writer and teacher so the book is surprisingly readable for the amount of detail.\n For more historical context I’d recommend  The Dream Machine by M. Mitchell Waldrop and  Hackers by Steven Levy. Narrative stories make it easier to learn and remember things and I think the context of the discoveries helps in learning how things actually work.\n  Tools are fun and it’s good to know your tools, but you can spend forever customizing things and arguing over little details that don’t really matter that much.Customizing tools can be a fun way to learn when you’re starting out, but I’ve seen people spend enormous amounts of time on this when it generates relatively little value compared to actually writing programs to solve problems or just learning more about the craft of programming in general (a good example book for this currently is  Designing Data Intensive Applications). I think focusing on customizing tools too much can hold you back.\n Don’t worry too much about things like Vim or Emacs or which OS you’re using - you can learn the core skills anywhere (this is my biggest disagreement with ESR’s post). That said, playing with Linux was a really valuable way for me to learn a lot about troubleshooting - largely because it didn’t work very well and I had to spend hours on things like trying to get wireless internet to function, getting the laptop to suspend successfully, even getting the UI to show up at all (things are a little better now).\n I started with trying to install Gentoo (which never actually succeeded). This troubleshooting skill was really instrumental in allowing me to get the job I have now, so if it’s fun for you to play with a different OS I’d definitely encourage it, I just don’t think it’s a requirement. It is probably easier to learn on macOS or Linux though since most of the existing tooling targets those environments and most programmers are using one of those two.\n One specific tool worth mentioning is version control, specifically git. It’s worth spending some time getting comfortable with the basics, but probably isn’t something to focus on until after you’ve been programming for a bit.\n  It’s easy to procrastinate by ‘researching’ options forever before starting a project - it can be fun to read about and explore what’s available and it’s good to do a little of this, but you can also get stuck doing this forever. When in doubt just pick the most popular project that’s been around for a while and use that one. If it’s popular it probably has a decent community you can learn from and if it’s been around for a while it’ll probably be more stable (or at least it’ll be more substantial and less likely to be abandoned).\n  I really enjoyed studying computer science and think it’s still probably the best way to go for the most opportunity (particularly if you live in a suburban area like I did without a lot of software people around). If possible I think it’s probably good to try and get into the best CS program you can. There are also a lot of classes available from good programs online, but if your life was like mine was in high school it’ll be hard to actually take advantage of this at home.\n  If learning is the naive solution to getting good grades, then working on cool programming projects is the naive solution to doing well in programming interviews. To be in a good position for programming interviews at competitive companies you need to get very comfortable with the problems on  leetcode and the  Cracking the Coding Interview book. Programming interviews require a lot of practice and are a distinct skill to develop in and of themselves.\n You can go through an entire CS degree and still not know how to program - you can also get a CS degree and still not be able to do programming interviews (both of these are probably the default case). Learning to program and learning to do well in programming interviews takes focused time on your own. CS helps with some direction and focused projects (Lambda School is probably better at this on the programming side and maybe will end up better overall), but you’ll have to own a lot of this learning yourself.\n  There are lots of different kinds of roles other than ‘software engineer’. There’s SRE (Site Reliability Engineer) focused more on infrastructure the code is running on and writing software focused for that. There’s internal tools and devops - devs that focus on all of the tooling required to automate how the software is built and tested (read  The Phoenix Project for a fun narrative story illustrating this). There are roles that interact more with users like developer support engineer (helping users with APIs and running down bugs or configuration issues). There are people that focus on game engines, people that focus on VR or computer graphics. There are people that write new computer languages and new compilers.\n In each of these roles there is even more specialization depending on what products are being used and new tools that are being created to solve new problems. Computer security is also an interesting area that I don’t know too much about that I think ESR is too dismissive of in his post, but it’s also a hard place to start because it requires a lot of existing understanding of how things work to know how things can be broken. I remember picking up this book early on, but I didn’t know enough at the time to really understand it:  Hacking: The Art of Exploitation\n Of course there’s also starting your own company and building your own role that way too as a founder.\n  A lifetime is a long time and a specialization isn’t forever, so dive into different things - play with a lot of new things and have fun along the way.\n  ESR talks about joining a local Linux users group, but at least for me that was not realistic when I read his post, both because there aren’t really that many of them and because I couldn’t get anywhere myself that easily since I was too young to drive. There are some online communities that I find interesting now that I think I would have found interesting then too.\n Hacker News: Ycombinator’s news site (startup incubator in the bay area). Comments can be hit or miss, but the good ones are really good and a lot of people in the industry hang out there. Paul Graham and Jessica Livingston were the founders of Ycombinator and Paul writes a lot of interesting  essays.\n Twitter: Largely dependent on who you’re following, but can be a great place if you want it to be. It can be hard to know who to follow starting out, but you can look at everyone I follow for a start.\n Less Wrong: Not programming focused, but there’s a decent amount of overlap between the rationality community and the programming community and I like a lot of the writing there, it’s definitely something I would have liked to have found around the same time I found How to Become a Hacker. Here’s an example post I like a lot:  Disputing Definitions\n   I remember ESR responding to some email I sent about getting an iPod to work in Fedora Core 4 around the time I read his post and I’m pretty sure Richard Stallman responded to some email I sent around that time too. I thought that was nice. In the spirit of continuing that, feel free to reach out to me with specific questions if you like.", "posttime": "2020-06-01 19:41:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,成为,hacker,学习", "title": "如何成为黑客", "title_en": "How to Become a Hacker", "transed": 1, "url": "https://zalberico.com/essay/2020/04/19/how-to-become-a-hacker.html", "via": "", "real_tags": ["黑客", "成为", "hacker", "学习"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004645, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "/COLOR/Atom feed linux 5.7@2020-06-01 0：44 Linus Torvalds 0兄弟，0回复；仅线程中的消息发件人：Linus Torvalds@2020-06-01 0：44 UTC(permalink/raw)收件人：Linux内核邮寄列表上周我们过得相当平静，没有什么真正的尖叫，让我们再推迟一个RC&34；吧。敲敲木头-让我们希望这一次我们不会有任何愚蠢的事情潜伏着，就像我们在5.6的最后一分钟WiFi倒退一样……但尽管上次出现了令人尴尬的倒退，一切看起来都很好。过去一两周我看到的大部分讨论都是关于即将到来的功能，所以合并窗口现在是打开的，我明天会像往常一样开始处理拉取请求。但在此期间，请试一试。我们5.7版像往常一样有很多变化(所有的统计数据看起来都很正常--但对我们来说，正常显然相当大，意味着几乎14,000个非合并提交，从接近2,000个开发人员到现在的近2,000个开发人员)，这意味着我们在5.7版本中进行了很多更改(所有的统计数据看起来都很正常--但对我们来说，这显然是正常的)，意味着将近14,000个非合并提交。)，所以附加的简短日志只是自rc7以来这一周来的小东西。Go test，Linus-Adrian Hunter(1)：mmc：sdhci：fix SDHCI_Quirk_Breaked_CQEAl Viro(1)：copy_xstate_to_kernel()：don&#39；t保留目标的某些部分未初始化Alexander Dahl(1)：x86/dma：修复32位系统上的最大PFN算法溢出Alexander Potapenko(1)：fs/binfmt_elf.c：在ill_thread_core_info()Alexei Starovoitov(1)中分配初始化内存：bpf：修复fmod_ret checkAmir Goldstein(1)中的释放后使用：fan otify：关闭对FAN_DIR_MON的支持。Antony Antony(1)：xfrm：修复注释中的错误Aric Cyr(1)：drm/amd/display：修复导致挂起的潜在整数环绕Arnd Bergmann(2)：桥：多播：解决clang错误包括/asm-Generic/topology.h：Guard cumask_of_node()宏参数Axel Lin(1)：gpio：mlxbf2：修复持有自旋锁时的睡眠Aya Levin(1)：net/m。存储到u32Brendan Shanks(1)：input：evdev-在Release()上调用input_flush_device()，不刷新()刘昌明(1)：alsa：hwdep：将左移1修复为31 UB错误Chris Chiu(1)：alsa：usb-audio：Mixer：ESS Technology Asus USB DAC的音量异常Chris Lew(1)：net：qrtr：在kernel_bindChris Packham(1)之前分配工作队列：net：sctp：修复Kconfig帮助Christophe Jaillet中的拼写(1)：input：dlink-dir。：禁用C系统调用/中断进入/退出代码的杀毒程序Daniel Xu(1)参数：xattr：修复未初始化的输出-paramDaniele Palma(1)：NET：USB：QMI_WWAN：添加Telit LE910C1-eux组成David Ahern(4)：nexthops：将代码从Remove_nexthop_from_Groups移动到Remove_nh_GRP_Entry nexthop：展开nexthop_is_multipath in。FQ_PieDennis Kadioglu(1)：输入：Synaptics-为联想T470sDennis YC Hsieh(1)：soc：MediaTek：cmdq：return发送消息错误码Dmitry Torokhov(1)：REVERT&#34；输入：i8042-将ThinkPad S230u添加到i8042 noux列表&#34；张冬立(1)：nvme-pci：避免nvme_reap_ending_cqes()和nvme_poll()Edwin Peer(1)之间的竞争：bnxt_en：固定固件消息长度字符顺序Enric Balletbo I Serra(1)：输入：CROS_EC_KEYB-使用CROS_EC_CMM。lsndtime net：对来自用户的愚蠢GSO请求更加温和L2TP：请勿使用inet_hash()/inet_unhash()L2TP：将SK_FAMILY检查添加到L2TP_VALIDATE_SocketEric W.Biederman(1)：exec：始终在cap_bprm_set_redsEvan Green(1)中设置cap_Ambient Evan Green(1)：input：synaptics-rmi4-real fix attn_data use-After-fredrik Strupe(1)：input：synaptics-rmi4-real fix attn_data use-After-fredrik Strupe。dwmac v5.10aGeert Uytterhoven(1)：ARM：8973/1：将缺少的换行终止符添加到内核消息Grygorii Strashko(2)：ARM：dts：am57xx：修复带有ksz9031的主板上的网络ARM：dts：am437x：修复带有ksz9031物理的主板上的网络郭仁(4)：csky：fix up config_preempt Panic csky：fix up abiv2 SysC。A5 csky：条目中的编码约定。S csky：fixup CONFIG_DEBUG_RSEQGustavo A.R.Silva(1)：input：applespi-将零长度数组替换为灵活数组Hamish Martin(1)：arm：dts：bcm：hr2：fix PPI中断类型刘航斌(1)：neigh：修复ARP重新传输计时器保护Hans de Goeed(1)：input：axp20x-pek-Always寄存器中断", "note_en": "/  color /  Atom feed    Linux 5.7 @ 2020-06-01 0:44 Linus Torvalds  0 siblings, 0 replies; only message in threadFrom: Linus Torvalds @ 2020-06-01 0:44 UTC ( permalink /  raw) To: Linux Kernel Mailing ListSo we had a fairly calm last week, with nothing really screaming&#34;let&#39;s delay one more rc&#34;. Knock wood - let&#39;s hope we don&#39;t haveanything silly lurking this time, like the last-minute wifi regressionwe had in 5.6..But embarrassing regressions last time notwithstanding, it all looksfine. And most of the discussion I&#39;ve seen the last week or two hasbeen about upcoming features, so the merge window is now open and I&#39;llstart processing pull requests tomorrow as usual. But in the meantime,please give this a whirl.We&#39;ve got a lot of changes in 5.7 as usual (all the stats look normal- but &#34;normal&#34; for us obviously pretty big and means &#34;almost 14thousand non-merge commits all over, from close to two thousanddevelopers&#34;), So the appended shortlog is only the small stuff thatcame in this last week since rc7.Go test, Linus---Adrian Hunter (1): mmc: sdhci: Fix SDHCI_QUIRK_BROKEN_CQEAl Viro (1): copy_xstate_to_kernel(): don&#39;t leave parts of destination uninitializedAlexander Dahl (1): x86/dma: Fix max PFN arithmetic overflow on 32 bit systemsAlexander Potapenko (1): fs/binfmt_elf.c: allocate initialized memory in fill_thread_core_info()Alexei Starovoitov (1): bpf: Fix use-after-free in fmod_ret checkAmir Goldstein (1): fanotify: turn off support for FAN_DIR_MODIFYAndreas Gruenbacher (1): gfs2: Even more gfs2_find_jhead fixesAndy Lutomirski (1): x86/syscalls: Revert &#34;x86/syscalls: Make __X32_SYSCALL_BIT beunsigned long&#34;Antony Antony (1): xfrm: fix error in commentAric Cyr (1): drm/amd/display: Fix potential integer wraparound resulting in a hangArnd Bergmann (2): bridge: multicast: work around clang bug include/asm-generic/topology.h: guard cpumask_of_node() macro argumentAxel Lin (1): gpio: mlxbf2: Fix sleeping while holding spinlockAya Levin (1): net/mlx5e: Fix arch depending casting issue in FECBartosz Golaszewski (1): gpiolib: notify user-space about line status changes after flags are setBjörn Töpel (1): xsk: Add overflow check for u64 division, stored into u32Brendan Shanks (1): Input: evdev - call input_flush_device() on release(), not flush()Changming Liu (1): ALSA: hwdep: fix a left shifting 1 by 31 UB bugChris Chiu (1): ALSA: usb-audio: mixer: volume quirk for ESS Technology Asus USB DACChris Lew (1): net: qrtr: Allocate workqueue before kernel_bindChris Packham (1): net: sctp: Fix spelling in Kconfig helpChristophe JAILLET (1): Input: dlink-dir685-touchkeys - fix a typo in driver nameChuhong Yuan (1): NFC: st21nfca: add missed kfree_skb() in an error pathDaniel Axtens (1): powerpc/64s: Disable sanitisers for C syscall/interrupt entry/exit codeDaniel Xu (1): xattr: fix uninitialized out-paramDaniele Palmas (1): net: usb: qmi_wwan: add Telit LE910C1-EUX compositionDavid Ahern (4): nexthops: Move code from remove_nexthop_from_groups to remove_nh_grp_entry nexthop: Expand nexthop_is_multipath in a few places ipv4: Refactor nhc evaluation in fib_table_lookup ipv4: nexthop version of fib_info_nh_uses_devDavide Caratti (1): net/sched: fix infinite loop in sch_fq_pieDennis Kadioglu (1): Input: synaptics - add a second working PNP_ID for Lenovo T470sDennis YC Hsieh (1): soc: mediatek: cmdq: return send msg error codeDmitry Torokhov (1): Revert &#34;Input: i8042 - add ThinkPad S230u to i8042 nomux list&#34;Dongli Zhang (1): nvme-pci: avoid race between nvme_reap_pending_cqes() and nvme_poll()Edwin Peer (1): bnxt_en: fix firmware message length endiannessEnric Balletbo i Serra (1): Input: cros_ec_keyb - use cros_ec_cmd_xfer_status helperEric Dumazet (4): crypto: chelsio/chtls: properly set tp-&gt;lsndtime net: be more gentle about silly gso requests coming from user l2tp: do not use inet_hash()/inet_unhash() l2tp: add sk_family checks to l2tp_validate_socketEric W. Biederman (1): exec: Always set cap_ambient in cap_bprm_set_credsEvan Green (1): Input: synaptics-rmi4 - really fix attn_data use-after-freeFredrik Strupe (1): ARM: 8977/1: ptrace: Fix mask for thumb breakpoint hookFugang Duan (1): net: stmmac: enable timestamp snapshot for required PTP packetsin dwmac v5.10aGeert Uytterhoeven (1): ARM: 8973/1: Add missing newline terminator to kernel messageGrygorii Strashko (2): ARM: dts: am57xx: fix networking on boards with ksz9031 phy ARM: dts: am437x: fix networking on boards with ksz9031 phyGuo Ren (4): csky: Fixup CONFIG_PREEMPT panic csky: Fixup abiv2 syscall_trace break a4 &amp; a5 csky: Coding convention in entry.S csky: Fixup CONFIG_DEBUG_RSEQGustavo A. R. Silva (1): Input: applespi - replace zero-length array with flexible-arrayHamish Martin (1): ARM: dts: bcm: HR2: Fix PPI interrupt typesHangbin Liu (1): neigh: fix ARP retransmit timer guardHans de Goede (1): Input: axp20x-pek - always register interrupt handlersHeinrich Kuhn (1): nfp: flower: fix used time of merge flow statisticsHelge Deller (1): parisc: Fix kernel panic in mem_init()Hsin-Yi Wang (1): arm64: dts: mt8173: fix vcodec-enc clockHugh Dickins (1): mm,thp: stop leaking unreleased file pagesJames Hilliard (1): Input: usbtouchscreen - add support for BonXeon TPJason Gunthorpe (1): RDMA/core: Fix double destruction of uobjectJay Lang (1): x86/ioperm: Prevent a memory leak when fork failsJeff Layton (1): ceph: flush release queue when handling caps for unknown inodeJens Axboe (2): sched/fair: Don&#39;t NUMA balance for kthreads Revert &#34;block: end bio with BLK_STS_AGAIN in case of non-mq devsand REQ_NOWAIT&#34;Jerry Lee (1): libceph: ignore pool overlay and cache logic on redirectsJia He (1): virtio_vsock: Fix race condition in virtio_transport_recv_pktJoe Perches (1): checkpatch/coding-style: deprecate 80-column warningJohannes Berg (1): cfg80211: fix debugfs rename crashJohn Fastabend (3): bpf: Fix a verifier issue when assigning 32bit reg states to 64bit ones bpf, selftests: Verifier bounds tests need to be updated bpf, selftests: Add a verifier test for assigning 32bit regstates to 64bit onesJohnny Chuang (1): Input: elants_i2c - support palm detectionJonas Falkevik (1): sctp: check assoc before SCTP_ADDR_{MADE_PRIM, ADDED} eventJonathan Marek (1): clk: qcom: sm8250 gcc depends on QCOM_GDSCKaike Wan (1): IB/qib: Call kobject_put() when kobject_init_and_add() failsKailang Yang (1): ALSA: hda/realtek - Add new codec supported for ALC287Kevin Locke (2): Input: i8042 - add ThinkPad S230u to i8042 nomux list Input: i8042 - add ThinkPad S230u to i8042 reset listKonstantin Khlebnikov (1): mm: remove VM_BUG_ON(PageSlab()) from page_mapcount()Krzysztof Kozlowski (2): ia64: Hide the archdata.iommu field behind generic IOMMU_API x86: Hide the archdata.iommu field behind generic IOMMU_APILinus Lüssing (1): mac80211: mesh: fix discovery timer re-arming issue / crashLinus Torvalds (1): Linux 5.7Linus Walleij (1): gpio: fix locking open drain IRQ linesLubomir Rintel (3): ARM: dts: mmp3: Use the MMP3 compatible string for /clocks ARM: dts: mmp3-dell-ariel: Fix the SPI devices ARM: dts: mmp3: Drop usb-nop-xceiv from HSIC phyMaor Dickman (1): net/mlx5e: Remove warning &#34;devices are not on same switch HW&#34;Maor Gottlieb (1): RDMA/mlx5: Fix NULL pointer dereference in destroy_prefetch_workMark Bloch (1): net/mlx5: Fix crash upon suspend/resumeMichael Braun (1): netfilter: nft_reject_bridge: enable reject with bridge vlanMichael Chan (1): bnxt_en: Fix accumulation of bp-&gt;net_stats_prev.Michael Ellerman (1): powerpc/64s: Fix restore of NV GPRs after facility unavailable exceptionNathan Chancellor (1): netfilter: conntrack: Pass value of ctinfo to __nf_conntrack_updateNicolas Dichtel (1): xfrm interface: fix oops when deleting a x-netns interfaceNikolay Aleksandrov (1): nexthops: don&#39;t modify published nexthop groupsNobuhiro Iwamatsu (1): arm64/kernel: Fix return value when cpu_online() fails in __cpu_up()Odin Ugedal (1): device_cgroup: Cleanup cgroup eBPF device filter codePablo Neira Ayuso (6): netfilter: nf_conntrack_pptp: prevent buffer overflows in debug code netfilter: conntrack: make conntrack userspace helpers work again netfilter: nfnetlink_cthelper: unbreak userspace helper support netfilter: conntrack: comparison of unsigned in cthelper confirmation netfilter: nf_conntrack_pptp: fix compilation warning with W=1 build net/mlx5e: replace EINVAL in mlx5e_flower_parse_meta()Paolo Abeni (4): mptcp: avoid NULL-ptr derefence on fallback mptcp: fix unblocking connect() mptcp: fix race between MP_JOIN and close mptcp: remove msk from the token container at destruction time.Paul Cercueil (2): gpu/drm: ingenic: Fix bogus crtc_atomic_check callback gpu/drm: Ingenic: Fix opaque pointer casted to wrong typePeng Hao (1): mmc: block: Fix use-after-free issue for rpmbPetr Mladek (1): powerpc/bpf: Enable bpf_probe_read{, str}() on powerpc againPhil Sutter (1): netfilter: ipset: Fix subcounter update skipPradeep Kumar Chitrapu (1): ieee80211: Fix incorrect mask for default PE durationQian Cai (1): mm/z3fold: silence kmemleak false positives of slotsQiushi Wu (4): RDMA/pvrdma: Fix missing pci disable in pvrdma_pci_probe() qlcnic: fix missing release in qlcnic_83xx_interrupt_test. bonding: Fix reference count leak in bond_sysfs_slave_add. iommu: Fix reference count leak in iommu_group_alloc.Robert Beckett (1): ARM: dts/imx6q-bx50v3: Set display interface clock parentsRoi Dayan (1): net/mlx5e: Fix stats update for matchall classifierRussell King (3): ARM: uaccess: consolidate uaccess asm to asm/uaccess-asm.h ARM: uaccess: integrate uaccess_save and uaccess_restore ARM: uaccess: fix DACR mismatch with nested exceptionsSabrina Dubroca (1): xfrm: espintcp: save and call old -&gt;sk_destructSascha Hauer (1): gpio: mvebu: Fix probing for chips without PWMSimon Ser (1): drm/amd/display: drop cursor position check in atomic testStefano Garzarella (1): vsock: fix timeout in vsock_accept()Stephan Gerhold (1): Input: mms114 - fix handling of mms345lTakashi Iwai (3): gpio: exar: Fix bad handling for ida_simple_get error path ALSA: hda/realtek - Add a model for Thinkpad T570 without DAC workaround ALSA: usb-audio: Quirks for Gigabyte TRX40 Aorus Master onboard audioTal Gilboa (1): net/mlx5e: Properly set default values when disabling adaptive moderationTejun Heo (1): Revert &#34;cgroup: Add memory barriers to plugcgroup_rstat_updated() race window&#34;Thomas Falcon (1): drivers/net/ibmvnic: Update VNIC protocol version reportingTiezhu Yang (2): gpio: pxa: Fix return value of pxa_gpio_probe() gpio: bcm-kona: Fix return value of bcm_kona_gpio_probe()Tony Lindgren (1): ARM: dts: Fix wrong mdio clock for dm814xValentine Fatiev (1): IB/ipoib: Fix double free of skb in case of multicast traffic in CM modeVasundhara Volam (1): bnxt_en: Fix return code to &#34;flash_device&#34;.Vinay Kumar Yadav (1): net/tls: fix race condition causing kernel panicVincent Stehlé (1): ARM: dts: bcm2835-rpi-zero-w: Fix led polarityVinod Koul (1): clk: qcom: gcc: Fix parent for gpll0_out_evenVlad Buslov (1): net/mlx5e: Fix MLX5_TC_CT dependenciesVladimir Oltean (3): dpaa_eth: fix usage as DSA master, try 3 net: dsa: felix: send VLANs on CPU port as egress-tagged net: dsa: declare lockless TX feature for slave portsWei Yongjun (1): Input: synaptics-rmi4 - fix error return code in rmi_driver_probe()Willem de Bruijn (1): net: check untrusted gso_size at kernel entryWolfram Sang (1): Input: lm8333 - update contact emailXin Long (12): xfrm: allow to accept packets with ipv6 NEXTHDR_HOP in xfrm_input xfrm: do pskb_pull properly in __xfrm_transport_prep esp6: get the right proto for transport mode in esp6_gso_encap xfrm: remove the xfrm_state_put call becofe going to out_reset esp6: support ipv6 nexthdrs process for beet gso segment esp4: support ipv6 nexthdrs process for beet gso segment xfrm: call xfrm_output_gso when inner_protocol is set in xfrm_output ip_vti: receive ipip packet by calling ip_tunnel_rcv esp6: calculate transport_header correctly when sel.family != AF_INET6 esp4: improve xfrm4_beet_gso_segment() to be more readable xfrm: fix a warning in xfrm_policy_insert_list xfrm: fix a NULL-ptr deref in xfrm_local_errorYang Yingliang (1): devinet: fix memleak in inetdev_init()wenxu (1): net/sched: act_ct: add nat mangle action only for NAT-conntrackŁukasz Patron (1): Input: xpad - add custom init packet for Xbox One S controllersŁukasz Stelmach (1): ARM: 8970/1: decompressor: increase tag size ^  permalink  raw  reply\t[  flat| nested]  only message in thread   Thread overview: (only message) (download:  mbox.gz / follow:  Atom feed)-- links below jump to the message on this page --2020-06-01 0:44  Linux 5.7 Linus Torvalds  LKML Archive on lore.kernel.orgArchives are clonable:\tgit clone --mirror https://lore.kernel.org/lkml/0 lkml/git/0.git\tgit clone --mirror https://lore.kernel.org/lkml/1 lkml/git/1.git\tgit clone --mirror https://lore.kernel.org/lkml/2 lkml/git/2.git\tgit clone --mirror https://lore.kernel.org/lkml/3 lkml/git/3.git\tgit clone --mirror https://lore.kernel.org/lkml/4 lkml/git/4.git\tgit clone --mirror https://lore.kernel.org/lkml/5 lkml/git/5.git\tgit clone --mirror https://lore.kernel.org/lkml/6 lkml/git/6.git\tgit clone --mirror https://lore.kernel.org/lkml/7 lkml/git/7.git\tgit clone --mirror https://lore.kernel.org/lkml/8 lkml/git/8.git\t# If you have public-inbox 1.1+ installed, you may\t# initialize and index your mirror using the following commands:\tpublic-inbox-init -V2 lkml lkml/ https://lore.kernel.org/lkml \\\t\tlinux-kernel@vger.kernel.org\tpublic-inbox-index lkmlExample  config snippet\n for mirrorsNewsgroup available over NNTP:\t nntp://nntp.lore.kernel.org/org.kernel.vger.linux-kernelAGPL code for this site: git clone  https://public-inbox.org/public-inbox.git", "posttime": "2020-06-01 19:08:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,修复", "title": "Linux 5.7", "title_en": "Linux 5.7", "transed": 1, "url": "https://lore.kernel.org/lkml/CAHk-=wiZGrCkiBB1V7bxp8NZH6yWi9mPM4ptMW16OzOiNprBFA@mail.gmail.com/T/#u", "via": "", "real_tags": ["linux", "修复"]}]