[{"category": "", "categoryclass": "", "imagename": "b8027d74da693b3965919283f0a9934e.jpg", "infoid": 1032226, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人工智能这门学科激发了我的兴趣，我在这个领域不断学习和尝试新事物。\n与自然语言处理、计算机视觉等相关的技术是如何出现并演变成每天被数百万用户使用的解决方案的，这是臭名昭著的。\n尽管人们使用“人工智能”这个词，但我们离“终结者”电影中的天网还很遥远。\n今天使用的人工智能最常见的子领域是一个叫做机器学习的子领域，反过来，深度学习作为子领域在相当长的一段时间里每天都在急剧增长。\n在本指南中，我的目标是描述一条可供软件工程师开始了解机器学习如何工作以及如何将其应用到您的项目中的路径。\n是的，你可以去Google API‘s或Amazon，挑选一些神奇的API为你做语音识别，但是知道它是如何工作的，为什么它工作，甚至更多，如何制作你自己的API即服务，并根据你的特定需求进行调整，这是令人难以置信的。\n我一直阅读、观看和浏览所有这些资源，直到最后，甚至为一些人拿到了付费认证，尽管没有必要学习，但我发现当我有一些最后期限和评估来证明我确实学到了材料时，我会更投入地完成。\n也许您从未有机会学习一些大学水平的数学，或者您确实学过，但是您记不住大部分内容，因为JavaScript和CSS带走了这些主题的所有记忆。\n有3个主题你必须事先知道，或者至少有一个像样的掌握，才能了解ML和DL的任何好材料：线性代数，微积分和统计学。\n如果你想深入学习ML和DL所需的数学知识，你可以去找麻省理工学院的开放式课程，比如斯特朗教授著名的线性代数课程。\n我在大学里和平时的班级一起看过这部电影，非常好。\n但是，让我们面对现实吧，大多数人没有时间这样做，也没有耐心。\n就内容而言，它与斯特朗教授的相比是非常遥远的，但首先，这已经足够了，随着你在ML和DL方面的进步，你可以继续其他的主题。\n3Blue1Brown在YouTube上也有一个关于微积分的完整系列供你免费观看：微积分的精髓。\n再说一次，他非常善于给你直觉，告诉你为什么和怎么做，而不是只是往你脸上扔一些随机的方程式。\n这是一个完整的领域，在我看来，你可以根据需要学习，一个很好的参考是数据科学家的实用统计：50个基本概念。\n正如书名所暗示的那样，它更适合数据科学家，但理解一些统计学的基础知识总是很好的，这就是本书的目的。\n你不会在读完之后成为一名统计员，但你会学到一些好东西。\n每个人都想直接跳入深度学习，成为在12 GB GPU上培训单一模型一周的酷家伙。\n概念、思路、对事物如何工作的感受都是从这里开始的，没有人比安德鲁·吴教授在他的机器学习课程中更有能力教授这些概念了。\n你可能会认为这门课既陈旧又过时，嗯，也许是从技术上讲，但从概念上讲，它比其他任何课程都要好。\n吴教授让你很容易理解他教授的每一种技术中应用的数学，并让你在一个非常简短和简洁的课程中对下面发生的事情有一个坚实的理解。\n所有的练习都是在Octave中完成的，Octave是Matlab的一个免费版本，你可以完成实现你自己的神经网络的课程！\nOctave中的语法对于任何程序员来说都很容易掌握，所以不要让它成为您的障碍。\n完成课程后，您将实现所有主要算法，并将能够解决几个预测问题。\n事实上，安德鲁·吴的课程只有一个缺陷，他没有涵盖随机森林。\n对他的课程有一个很棒的补充，那就是FAST。AI为程序员提供的机器学习入门。\n杰里米·霍华德(Jeremy Howard)对吴昌俊课程中缺失的部分进行了超级实用的讲解，涵盖了一个主题，对于许多经典问题来说，这是最好的解决方案。\nFast.ai的方法是所谓的自上而下，意思是他们向你展示如何解决问题，然后解释为什么它有效，这与我们在学校习惯的完全相反。\nJeremy还使用真实的工具和库，因此您可以通过在经过行业测试的解决方案中编码来学习。\n再说一次，最好的资源是吴教授的课程，实际上是一系列的课程。\n深度学习专业化认证由5门课程组成，从基础开始，围绕特定主题(如语言、图像和时间序列数据)不断发展。\n一件好事是，他从他的经典机器学习课程的最后继续，所以感觉就像是第一门课程的延伸。\n数学，概念，如何和为什么工作的概念，他都非常简洁，这是我见过的少数几个人所见过的。\n唯一的缺点是他在这门课中使用了TensorFlow1.x(Google的DL框架)，但在我看来，这是最少的细节，因为解释和练习都很好地传达了。\n您可以相对容易地获得该框架的最新版本，为此，您可以阅读本指南的最后一部分，即一本书。\n这本书可能是您唯一需要开始的书，它是Aurélien Géron的实践机器学习与Scikit-学习、Kera和TensorFlow：构建智能系统的概念、工具和技术“(Learning，Kera，and TensorFlow：Concept，Tools，and TensorFlow to Building Intelligence Systems)。\n它涵盖了很多内容，从经典的机器学习到最新的深度学习主题。使用工业级框架和库的很好的示例和练习。\n我敢说，如果你真的很着急，你可以跳过我以前说的一切，直接去看书。\n您可能会错过所提到的其他资源中包含的大量信息，但是从热隆的书中获得的实用和可操作的知识足以为您的下一个项目提供很多想法。\n如果你只读了这本书就觉得受限了，那就回去研究一下剩下的材料，它会填补你可能有的空白，让你有一个更坚实的理解。\n嘿，我听说过PyTorch和大家都在谈论的另一个框架或库X。\n不要为此而疯狂，在学习了本指南中的基础知识之后，您可以很容易地使用PyTorch文档或任何其他库或框架，并在一两周内学习如何使用它。\n技术和概念都是一样的，这只是一个语法和应用问题，甚至是你对任何给定工具的品味问题。\n作为总结，我想说，尽管这看起来可能很多，但我试图消除所有的噪音，在这个过程的最后，你会感到有信心，你会理解幕后发生的事情，行话，甚至能够阅读一些在该领域发表的论文，以跟上最新的进展。", "note_en": "The subject of Artificial Intelligence picks my interest and I’m constantly studying and trying new things in this field.\n It is notorious how the technologies related to Natural Language Processing, Computer Vision and such have emerged and evolved into solutions used by millions of users every day.\n Even though people use the term &#34;Artificial Intelligence&#34;, we are still far away from something as advanced as a Skynet from the Terminator movies.\n The most common subfield of AI used today is the one called Machine Learning, which, in its turn, has Deep Learning as subfield steeply growing every day for quite some time now.\n In this guide, I aim to describe a path to follow for software engineers to begin understanding how Machine Learning works and how to apply it to your projects.\n Yeah, you can just go to Google API’s or Amazon and pick some magical API to do Speech Recognition for you, but the value of knowing how it works, why it works and even more, how to make your own API as a Service and tune it to your specific needs is incredible.\n  I’ve read, watched and gone through all these resources until the end, even got a paid certification for some, even though it is not necessary to learn, I find myself more engaged to finish when I have some deadline and assessment to prove I actually learned the material.\n   Maybe you never had the chance to study some college-level math, or you did study it but you can’t remember most of the stuff because JavaScript and CSS took all the memory of those topics away.\n There are 3 topics you must know beforehand, or at least have a decent grasp of to follow any good material on ML and DL: Linear Algebra, Calculus and Statistics.\n If you’d like to go deep in learning the math needed to ML and DL, you can look for MIT OpenCourseWare classes like Professor Strang’s renowned  Linear Algebra class.\n I’ve watched it in college in parallel with my regular class and it is very good.\n But, let’s face it, most people have no time for that or the patience.\n     It is very far in terms of content compared to Professor Strang’s, but it’s enough, to begin with, and you can go after other topics as you advance in ML and DL.\n   3Blue1Brown also has a whole series on Calculus on Youtube for you to watch for free:  Essence of Calculus.\n Again, he is very good at giving you the intuition of why and how rather than just throw some random equations on your face.\n  This is a whole field that, in my opinion, you can learn as needed, a good reference is  Practical Statistics for Data Scientists: 50 Essential Concepts.\n   As the title implies, it is more suitable for Data Scientists, but understanding some basics of statistics is always good and this is what this is book is for.\n You won’t become a statistician after reading it, but you will learn some good stuff.\n  Everybody wants to jump straight into Deep Learning and be the cool guy training a single model for a week on a 12GB GPU.\n   The concepts, the train of thought, the &#34;feeling&#34; of how things work start here and there is no one else more capable of teaching those concepts than Professor Andrew Ng in his course  Machine Learning.\n You may think this course is old and outdated, well, technology-wise, maybe, but conceptually-wise, it is better than anything else out there.\n Professor Ng makes it easy to understand the math applied in every technique he teaches and gives you a solid understanding of what happens underneath in a very short and concise course.\n All the exercises are made in Octave, a free version of Matlab of sorts, and you finish the course implementing your own Neural Network!\n The syntax in Octave is easy to grasp for any programmer, so don’t let that be a barrier for you.\n Once you finish the course, you will have implemented all the major algorithms and will be able to solve several prediction problems.\n   Actually, there is but one flaw in Andrew Ng’s course, he doesn’t cover Random Forests.\n An awesome complement to his course is fast.ai’s  Introduction to Machine Learning for Coders.\n Jeremy Howard goes super practical on the missing piece in Ng’s course covering a topic that is, for many classical problems, the best solution out there.\n Fast.ai’s approach is what is called Top-Down, meaning they show you how to solve the problem and then explain why it worked, which is the total opposite of what we are used to in school.\n Jeremy also uses real-world tools and libraries, so you learn by coding in industry-tested solutions.\n    Again, the best resource for it is Professor Ng’s course, actually, a series of courses.\n The  Deep Learning Specialization is composed of 5 courses total going from the basics and evolving on specific topics such as language, images, and time-series data.\n One nice thing is that he continues from the very end of his classical Machine Learning course, so it just feels like an extension of the first course.\n The math, the concepts, the notion of how and why it works, he delivers it all very concisely like few I’ve seen.\n The only drawback is that he uses  Tensorflow 1.x (Google’s DL Framework) in this course, but that’s minimal detail in my opinion since the explanations and exercises are so well delivered.\n You can pick up the most recent version of the framework relatively easy and to do so there is the final piece of this guide, a book.\n  This book might be the only thing you need to start, it is Aurélien Géron’s  Hands-On Machine Learning with Scikit-Learn, Keras, and TensorFlow: Concepts, Tools, and Techniques to Build Intelligent Systems.\n It covers a lot, from classical Machine Learning to the most recent Deep Learning topics. Good examples and exercises using industry-grade frameworks and libraries.\n I dare say that, if you are really in a rush, you can skip everything I said before and just go for the book.\n You will miss a good amount of information contained on the other resources mentioned, but the practical and actionable knowledge from Géron’s book is enough to work on many ideas for your next project.\n If you feel limited after only reading the book, go back and study the rest of the material, it will fill in the gaps you might have and give you a more solid understanding.\n  &#34;Hey, I’ve heard about PyTorch and that other framework or library X everybody talks about&#34;.\n  Don’t go crazy for that, after you learn the basics in this guide, you can easily go, for instance, on  PyTorch documentation or any other library or framework of sorts and learn how to use it in a week or two.\n The techniques, the concepts, are all the same, it is only a matter of syntax and application or even tastes that you might have for any given tool.\n  To wrap it up, I want to say that, even though it might seem a lot, I tried to remove all the noise and at the end of the process, you will feel confident that you understand what is happening behind the curtains, the jargons and even be able to read some papers published in the field to keep up with the latest advances.", "posttime": "2020-10-30 12:02:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "深度学习,软件工程师,软件,学习,learning", "title": "如何学习机器学习和深度学习：软件工程师指南", "title_en": "How to Learn Machine Learning and Deep Learning: A Guide for Software Engineers", "transed": 1, "url": "https://renanmf.com/machine-learning-and-deep-learning-software-engineers/", "via": "", "real_tags": ["深度学习", "软件工程师", "软件", "学习", "learning"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032225, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "订阅世界商业科技与科学文化新闻极客运动健康辩论Vantage天气早在1983年，我在堪萨斯州的多佛市偶然发现了一处不同寻常的房产，我迫不及待地想看看它。我有历史学学位，这个地方当然具有历史意义。现在是一座三层楼高的房子，其中两层在地下，最初是一个阿特拉斯E导弹基地。\n20世纪60年代，这里储存了一枚400万吨的热核弹。在1961-65年间，包括1962年古巴导弹危机期间，它是一个拥有导弹的活跃地点。\n当我看到这个遗址时，我被它弄糊涂了，因为它被洪水淹没了，已经成了一片废墟，但仍然非常有趣。我就是忘不了这件事。我们最终从一家打捞公司手中买下了这处房产，这家公司已经致力于剥离任何与政府活动直接相关的东西，所以政府基本上不在考虑范围之内。建造它非常昂贵，而且我花了一个像样的价格买到了它，但一开始我真的不确定我要用它做什么。\n马修·富尔克森“新闻周刊”提供订阅优惠，然而，从那以后，它就成了我们的冒险。它仍然是一个坚固的建筑，从它的强度来看，它有一种军事感觉，它有150英尺长的地下入口隧道，有11000平方英尺的地下车库空间和6500英尺的生活空间。\n但我和妻子花了大约十年才能住在这里，因为这里完全被洪水淹没了。以前的柴油发电机房，也就是我们现在称为“大房间”的地方，有8.5英尺深的水需要排干，留下了真正的烂摊子需要清理。直到1993年我们才搬进来。\n马修·富尔克森整个房地产有三层，我们在地下有两层，在地面上有一个结构，那就是温室。地下结构原来的天花板有15英尺高，所以我们可以创造两层，我们在中间有一个很大的空间，我们保留了原来的天花板高度。除了四间卧室，我们还有三个睡觉的角落，多年来一次最多可以睡26个人。\n新闻周刊订阅优惠&gt；一楼有卧室、商业厨房和大房间，二楼有更多的卧室和厨房，因为我们的地下住宅总共有三个厨房。温室和种植植物和食物的区域在我们上方的地面。\n它宽敞有趣，我们喜欢住在这里。你永远不会感到幽闭恐惧症，多年来我们有很多朋友住在这里。我们过去在这里有二三十个人的聚会，我们在我们的大房间里有110个人的聚会。这是很好的选择，这里有这么大的地下空间。\n我们将这处房产命名为Subterra城堡，因为Subterra的意思是埋在地下，而且因为它是为了军事和防御目的而建造的，在很多方面都让人感觉它像20世纪的传统欧洲城堡。大多数家庭没有我们大房间那么大的房间。因此，这处房产的规模几乎就像城堡一样。\n我们拥有35英亩的土地，我们有一条飞机可以降落的跑道。1992年，我们在外面的土地上建立了一个果园，1996年，我们又增加了一个养鱼的池塘。事实上，我们过去在户外有一个汗水小屋，而在陆地上也有一个可以居住的小屋。这处房产甚至有一个军用安装的污水系统，可以容纳多达40人！\n我们目前的电力来自电网，但我们有发电机和太阳能电池板，我们这里的照明使用的是发电机和太阳能电池板。所以我们可以在没有电网的情况下做得很好。\n这也是当地最坚固的建筑。阿尔马的瓦邦西县法院可能是下一个最强大的。它更漂亮，但不那么结实，而且很明显它不在地下。\n现在存在的技术是，所有的表面结构都可以倒塌和报废，而这种特性仍然存在。我们的地下掩体可以承受当地的核打击和堪萨斯州的龙卷风。这是一个独特的家，水泥墙非常坚固，我们头顶上有泥土，上面有泥土隔热，温度很容易控制。\n马修·富尔克森我们一直认为，历史上可能会有这样一个时期，人们会想要来到这里，在这里经历一段艰难的时期。现在的世界当然看起来有点疯狂，我们周围发生了前所未有的事件，比如新冠肺炎。因此，身处乡村、地下，感觉非常安全，这真是太好了。\n我们现在经常呆在家里，因为我们只需要偶尔进城买些杂货。在过去的一年里，我们实际上接到了三个不同的人打来的电话，他们希望留在这里更安全，但我们还没有准备好接受我们不太了解的新人。\n我们现在正在考虑出售这处房产。我今年73岁了，跟不上这个地方的维护工作。五年前我中风了，我的身体也不像以前那么健康了，所以现在也许是时候让这个大房子落入别人的手中了。\n我们可能会留在堪萨斯州，买一处地面上的房产，因为我的家人在这里，我不想搬到离他们太远的地方。但我会怀念身处地下以及由此带来的安全保障。\n我想几乎所有经历过这个地方的人都会非常喜欢它。我在这个地方工作了38年，大半生都在工作，我相信它是一处出色而独特的房产。我们希望将来能找到能欣赏它的人。\n爱德华·佩登(Edward Peden)和他的妻子戴安娜(Dianna)自1993年以来一直住在苏特拉城堡(Subterra Castle)，并将这个曾经的导弹掩体改造成了一处三层高的可居住房产。有关信息，请访问subterracastle.com。\n。有关购买房产的信息，请联系马修·富尔克森(Matthew Fulkerson)，电子邮件为missilebase@gmail.com。请求转载和授权，提交更正或查看编辑指南由威尔·张伯伦VS马修·费尼与我们的前5篇文章开始您的一天，不限30天广告免费试用订阅现在注册到我们的每日时事通讯，获得更多像这样的文章+访问5篇额外的文章，不需要订阅。选择您的订阅订阅获得您的免费试用时事通讯©2020年新闻周刊数字有限责任公司版本：U.S.Edition日本巴基斯坦Polska România关于我们更正联系我们联系我们编辑指南广告版权条款和条件隐私政策饼干政策销售条款档案公告", "note_en": "Subscribe                World  Business  Tech &amp; Science  Culture  Newsgeek  Sports  Health  The Debate  Vantage  Weather                                         My Turn  Way back in 1983 I came upon an unusual property here in Dover, Kansas and I was eager to see it. I have a degree in history and this site is certainly of historic significance. What is now a three storey home, two of which are underground, was originally an Atlas E Missile site.\n There was a four megaton thermonuclear bomb stored here in the 1960s. It was an active site with a missile between 1961-65, including during the Cuban missile crisis in 1962.\n When I saw the site I was perplexed by it because it was flooded and in ruin, but still very interesting. I just could not forget about it. We ended up buying the property from a salvage company who had already worked on stripping out anything directly related to government activity, so the government was pretty much out of the picture. It was very expensive to build and I got it for a decent price, but I really wasn&#39;t sure what I was going to do with it at the outset.\n                Matthew Fulkerson  Newsweek subscription offers &gt; However, it&#39;s been our adventure ever since. It&#39;s still a hardened structure that has a military feel from the strength of it, it has 150 feet of underground entry tunnels, there&#39;s an 11,000 square feet underground garage space and 6,500 feet of living space.\n But it took about ten years before my wife and I could live here because the place was completely flooded. The former diesel generator room, which we now call the &#34;great room&#34; had 8.5ft of water that had to be drained and that left a real mess to be cleaned up. It wasn&#39;t until 1993 that we were able to move in.\n                Matthew Fulkerson The whole property is three storeys, we have two storeys underground and we have a structure above ground which is a greenhouse. The original ceilings of the underground structure were 15 feet high, so we were able to create two storeys, and we have the great room in the middle where we have retained the original ceiling height. As well as four bedrooms, we have three sleeping nooks and have been able to sleep up to 26 people at one time over the years.\n  Newsweek subscription offers &gt; The first storey has bedrooms and commercial kitchen and the great room, and the second storey has more bedrooms and kitchens, as we have a total of three kitchens in our underground home. The greenhouse and growing area for plants and food is on the ground level above us.\n It&#39;s spacious, interesting and we love living here. You never feel claustrophobic and we&#39;ve had a lot of friends to stay over the years. We used to have gatherings of 20 or 30 people here and we&#39;ve had gatherings of 110 people in our great room. It&#39;s nice to have that option with so much space underground here.\n We named the property &#34;Subterra Castle&#34; because subterra means &#34;under the earth&#34; and because it was built for military, defensive purposes, in many ways it feels like a 20th Century counterpart to traditional European castles. Most homes do not have a room the size of our great room. So the property is almost castle-like in its scale.\n                   We own 35 acres and we have a landing strip where aircraft can land. In 1992 we installed an orchard on the land outside and in 1996 we added a pond with fish. We actually used to have a sweat lodge outdoors and there is a cabin that can be inhabited on the land, too. The property even has a military installed sewage system that can cope with up to 40 people!\n We currently get electrical power from the grid, but we have a generator and solar panels that we used for the lighting here. So we could do pretty well off the grid.\n This is also the strongest structure in the local area. The Wabaunsee County Courthouse in Alma would likely be the next strongest. It&#39;s prettier but not as strong, and obviously it&#39;s not underground.\n The technology exists now whereby all the surface structures could be down and in waste and this property would still exist. Our underground bunker could withstand a local nuclear strike and Kansas tornados. It&#39;s a unique home, the concrete walls are very strong, we have earth over the top of us and temperatures are very easy to manage with the insulation of the earth above.\n                Matthew Fulkerson We&#39;ve always thought there may be a time in history where people would want to come here and go through a difficult period above ground here. And the world certainly seems a little bit crazy right now, there are unprecedented events happening around us, like COVID-19. So it&#39;s been nice to be in the countryside, underground and feeling very safe.\n We are staying at home a lot at the moment as we only have to go into town for some groceries now and then. In the past year we have actually had three calls from different people who wanted to be safer by staying here, but we weren&#39;t ready to take on new people who we didn&#39;t know very well.\n We are now looking to sell the property. I am 73-years-old and I am having trouble keeping up with the maintenance of the place. I had a stroke five years ago and I&#39;m not as healthy as I used to be, so it&#39;s maybe time to let this big place go into someone else&#39;s hands.\n We&#39;ll probably stay in Kansas and buy an above ground property, as my family is here and I wouldn&#39;t want to move too far away from them. But I would miss being underground and the safety and security you get from that.\n I think almost anyone who experienced this place would come to enjoy it quite well. I&#39;ve been working on the place for 38 years, more than half my life, and I believe it&#39;s an excellent and unique property. We hope to find someone who can appreciate it in the future.\n Edward Peden and his wife Dianna have lived in Subterra Castle since 1993 and converted the former missile bunker into a three-storey inhabitable property. For information visit  subterracastle.com\n. For information on purchasing the property, please contact Matthew Fulkerson on missilebases@gmail.com.       Request Reprint &amp; Licensing,   Submit Correction or  view Editorial Guidelines                                ByWill Chamberlain  VS           ByMatthew Feeney     Start your day with our top 5 articles          Unlimited 30 Day Ad Free Trial Subscribe Now   Sign-up to our daily newsletter for more articles like this + access to 5 extra articles       No subscription required.                                             Choose your subscription         SUBSCRIBE        Get your free trial  Newsletter                          © 2020 NEWSWEEK DIGITAL LLC         Editions:   U.S. Edition  日本  Pakistan  Polska  România    About Us  Corrections  Contact Us  Editorial Guidelines  Advertise  Copyright  Terms &amp; Conditions  Privacy Policy  Cookie Policy  Terms of Sale  Archive  Announcements", "posttime": "2020-10-30 12:02:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "地下掩体,storey,房产", "title": "“我们住在一个两层的地下掩体里”", "title_en": "'We Live in a Two Storey Underground Bunker'", "transed": 1, "url": "https://www.newsweek.com/we-live-two-storey-underground-bunker-1535335", "via": "", "real_tags": ["地下掩体", "storey", "房产"]}, {"category": "", "categoryclass": "", "imagename": "ad33f31189dd01732da48b10945e5f71.jpg", "infoid": 1032224, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英特尔今天宣布，它将收购总部位于旧金山的初创公司SigOpt，该公司开发一个优化人工智能软件模型的平台。预计将于本季度完成的这笔交易的条款没有披露，但英特尔表示，计划在其硬件产品中使用SigOpt的技术，为开发人员加速、扩大和扩展人工智能软件工具。\n此次收购正值英特尔为应对挫折，在预计到2024年价值超过250亿美元的人工智能硅市场上加倍下注。在10纳米处理器硬件推迟后，英特尔宣布将推迟7纳米的制造工艺。今年2月，该公司在斥资20亿美元收购芯片制造商哈瓦那实验室(Habana Labs)后，结束了Nervana AI模型培训技术的开发。\nSigOpt专注于人工智能和机器学习的软件方面。在康奈尔大学(Cornell University)获得博士学位后，首席执行官斯科特·克拉克(Scott Clark)在Yelp工作期间开发了这个框架，该框架后来成为SigOpt的产品，他在Yelp用它来优化模型和A/B测试。2014年，斯科特与首席技术官帕特里克·海耶斯(Patrick Hayes)共同创立了SigOpt，海耶斯曾在黑莓(BlackBerry)、Foursquare、彭博社(Bloomberg)和Facebook担任软件工程师。两人创办了这家公司，想法是将这项技术带到其他领域。\nSigOpt的平台和API优化了超参数-其值用于控制AI模型培训过程的参数-以在生产中生成高性能的模型。它支持100个超参数和100倍并行，融合了一系列功能-包括多参数优化、多任务优化和条件参数-并利用贝叶斯和全局优化算法。\n只需几行代码，团队就可以将SigOpt嵌入到工作流中，而无需考虑AI平台、模型管理解决方案、云基础架构、客户端库或模型类型。SigOpt利用一个可创建多达数万个并发实验的库，帮助将模型参数化并运行优化循环，跟踪实验元数据，并在Web Insight仪表板中提供可视化效果。\nSigOpt声称与“领先的”算法交易员和政府组织以及麻省理工学院、加州大学伯克利分校、卡内基梅隆大学和斯坦福大学等学术用户合作过。这家初创公司总共从投资者那里筹集了870万美元的风险资本，其中包括安德森·霍洛维茨(Andreesen Horowitz)、SV Angel、美国情报机构附属机构In-Q-tel和Blumberg Capital。\nSigOpt的团队，包括克拉克和海耶斯，将在收购后加入英特尔的机器学习性能部门。英特尔表示，SigOpt的软件技术将补充其现有的AI软件组合，其中包括2018年发布的帮助开发人员在边缘和云设备上加速AI推理的工具包OpenVINO。\n英特尔最近报告称，其人工智能解决方案推动了“有意义的收入”-2019年总收入超过38亿美元。今年5月，该公司宣布其全球投资组织英特尔资本(Intel Capital)已承诺向11家专注于人工智能翻译服务、医疗自动化、大数据分析和芯片组设计的初创企业提供总计1.32亿美元的资金。英特尔资本(Intel Capital)声称，它正在向专门从事人工智能的初创公司投资3亿至5亿美元，重点是智能边缘设备和网络转型。", "note_en": "Intel today announced it will acquire  SigOpt, a San Francisco-based startup developing a platform to optimize AI software models. Terms of the deal, which is expected to close this quarter, weren’t disclosed, but Intel says it plans to use SigOpt’s technologies across its hardware products to accelerate, amplify, and scale AI software tools for developers.\n The acquisition comes as Intel responds to setbacks by doubling down on an AI silicon market it expects to be worth over $25 billion by 2024. Following a delay with its 10-nanometer processor hardware, Intel announced it would  push back its 7-nanometer manufacturing process. In February, the company ended development on its Nervana AI model training technology after spending $2 billion acquiring chipmaker Habana Labs.\n  SigOpt focuses on the software side of AI and machine learning. After completing his Ph.D. at Cornell University, CEO Scott Clark developed the framework that would become SigOpt’s product while working at Yelp, where he used it to optimize models and A/B tests. In 2014, Scott founded SigOpt with CTO Patrick Hayes, who had worked as a software engineer at BlackBerry, Foursquare, Bloomberg, and Facebook. The duo launched the company with the idea of bringing the technology to other fields.\n SigOpt’s platform and API optimizes hyperparameters — parameters whose values are used to control the AI model training process — to generate high-performing models in production. It supports 100 hyperparameters and 100 times parallelism, incorporating a range of features — including multimetric optimization, multitask optimization, and conditional parameters — and leveraging Bayesian and global optimization algorithms.\n  With a few lines of code, teams can embed SigOpt into workflows, regardless of the type of AI platform, model management solution, cloud infrastructure, client library, or model type. Tapping a library that can create up to tens of thousands of concurrent experiments, SigOpt helps parametize models and run optimization loops, tracking experiment metadata and providing visualizations in a web insights dashboard.\n SigOpt claims to have worked with “leading” algorithmic traders and government organizations, as well as academic users like MIT; the University of California, Berkeley; Carnegie Mellon; and Stanford. The startup raised a total of $8.7 million in venture capital from investors that include Andreesen Horowitz, SV Angel, U.S intelligence agency affiliate In-Q-Tel, and Blumberg Capital.\n SigOpt’s team, including Clark and Hayes, will join Intel’s machine learning performance division post-acquisition. Intel says SigOpt’s software technologies will complement its existing AI software portfolio, which includes  OpenVINO, a toolkit released in 2018 to help developers accelerate AI inference on edge and cloud devices.\n Intel recently reported that its AI solutions drive “meaningful revenue” — totaling over $3.8 billion in 2019. In May, the company announced its global investment organization  Intel Capital had committed a total of $132 million to 11 startups focused on AI translation services, health care automation, big data analytics, and chipset design. Intel Capital claims it is on track to invest between $300 million and $500 million in startups specializing in AI, with a particular focus on intelligent edge devices and network transformation.", "posttime": "2020-10-30 11:46:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "英特尔,性能,intel,sigopt", "title": "英特尔宣布将收购SigOpt，这是一家建立优化AI模型平台的初创公司；SigOpt将加入英特尔的机器学习性能部门", "title_en": "Intel announces it will acquire SigOpt, a startup building a platform to optimize AI models; SigOpt will join Intel's machine learning performance division", "transed": 1, "url": "https://venturebeat.com/2020/10/29/intel-acquires-ai-software-optimization-platform-sigopt/", "via": "", "real_tags": ["英特尔", "性能", "intel", "sigopt"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032221, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "选举对医疗技术和医疗服务类股的影响可能不仅取决于谁赢得总统大选，还取决于共和党人是否保持对参议院的控制。\n如果民主党人同时赢得白宫和参议院(并保持对众议院的控制)，你将看到重振“平价医疗法案”(Affordable Care Act)的努力，并继续改革美国的医疗体系。这种转变很可能是以牺牲私营医疗保健公司的利润为代价的。\n另一方面，共和党人保持对白宫和/或参议院的控制可能会导致政府分裂，没有关于医疗保健的重大立法获得通过。\n不足为奇的是，大多数主要大麻库存的特朗普贝塔指数都非常低，这意味着如果拜登当选，它们可能会表现良好。\nCanopy Growth Corp($CGC)的Trump Beta为-0.20，GW制药($GWPH)为-0.29，Cronos Group($Cron)的Trump Beta为-0.31。\n尽管拜登在20世纪80年代和90年代对联邦控制的物质采取了强硬立场，但他最近支持了大麻合法化的纲领。此外，竞选伙伴卡马拉·哈里斯(Kamala Harris)被认为是合法化的倡导者。作为加利福尼亚州的一名初级参议员，她发起了大麻机会再投资和消除(更多)法案，民主党控制的众议院司法委员会去年11月通过了该法案。这项法案目前还没有取得任何进展，但许多人认为，今年11月的民主党大获全胜可能会导致大麻合法化。\n另一方面，大麻立法在特朗普执政期间并不是优先事项，目前没有理由相信这种情况会在第二个任期内改变。\n科技服务和电子技术领域的企业平均特朗普贝塔指数分别为0.12和0.15。这主要是由主导其行业的大型科技公司推动的，微软、谷歌、苹果和Adobe都显示出与特朗普连任的强烈正相关。", "note_en": "The effect of the election on health technology and health services stocks will likely depend not only on who wins the Presidency but also on whether or not Republicans maintain control of the Senate.\n  If Democrats win both the White House and the Senate (and maintain control of the House) you’ll see revived efforts to pick up the pieces of the Affordable Care Act and continue to transform the U.S. healthcare system. This transformation is likely to come at the expense of private healthcare companies&#39; bottom lines.\n  On the other hand, Republicans maintaining control of the White House and/or Senate would likely result in a divided government, with no significant legislation on healthcare being passed.\n   Not surprisingly, most major cannabis stocks have a very low Trump Beta, meaning they are likely to perform well if Biden is elected.\n  Canopy Growth Corp ($CGC) has a Trump Beta of -0.20,  GW Pharmaceuticals ($GWPH) comes in at -0.29, and  Cronos Group ($CRON) has a Trump Beta of -0.31.\n  Though Biden took a tough stance on federally controlled substances back in the 1980s and 1990s, he has recently embraced a platform of decriminalizing marijuana. Additionally, running mate Kamala Harris is known as an advocate for legalization. As a junior senator in California, she sponsored the Marijuana Opportunity Reinvestment and Expungement (MORE) Act, which the Democrat-controlled House Judiciary Committee passed last November. The bill hasn’t gotten anywhere yet, but many suppose that a democratic sweep this November could lead to marijuana legalization.\n  On the other hand, cannabis legislation has not been a priority under Trump, and there is no reason right now to believe that this will change during a second term.\n   Companies in the technology services and electronic technology sectors have an average Trump Beta of 0.12 and 0.15, respectively. This is primarily driven by the large-cap tech companies that dominate their industries, with Microsoft, Google, Apple, and Adobe all showing strong positive correlations with a Trump re-election.", "posttime": "2020-10-30 11:41:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "股市,总统,stock,医疗", "title": "预测总统选举结果对股市的影响", "title_en": "Predicting the stock market impact of the Presidential election outcome", "transed": 1, "url": "https://www.quiverquant.com/blog/092420", "via": "", "real_tags": ["股市", "总统", "stock", "医疗"]}, {"category": "", "categoryclass": "", "imagename": "74b080e3ca08fd6336ea82018bea49a9.png", "infoid": 1032219, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "代谢综合征的特征是中心性肥胖、胰岛素抵抗、血压升高和血脂异常。代谢综合征是几种常见癌症(如肝癌、结直肠癌、乳腺癌、胰腺癌)的重要危险因素。代谢综合征各组成部分的药物治疗似乎不足以控制代谢综合征受试者的癌症发展。小鼠模型显示，在日常活动阶段没有进食时，癌症的进展最慢。从黎明到日落的间歇性禁食是人类活动时间内的一种禁食形式。为了验证代谢综合征患者黎明至日落间歇禁食的抗癌效果，我们对14例代谢综合征患者进行了一项初步研究，这些患者每天从黎明到日落禁食(禁食或喝水)超过14h，连续4周。分别于禁食前4周、禁食4周时、禁食4周后1周采集血清标本。采用纳米超高效液相色谱-串联质谱法进行血清蛋白质组学分析。我们发现间歇禁食4周时(CALU、INTS6、KIT、CROCC、PIGR)和间歇禁食后1周(CALU、CALR、IGFBP4、SEMA4B)的几种抑癌基因和DNA修复基因蛋白产物(GP)的水平在间歇禁食4周时(CALU、INTS6、KIT、CROCC、PIGR)明显高于禁食4周前(P&lt;0.01)。间歇禁食4周时(POLK、CD109、cAMP、NIFK、SRGN)和间歇禁食后1周(cAMP、PLAC1)肿瘤促进剂GPs水平较4周间歇禁食前显著降低(P&lt;0.0 5)，而间歇禁食4周(POLK、CD10 9、cAMP、NIFK、SRGN)和间歇禁食后1周(cAMP、PLAC1)明显降低。从黎明到日落禁食4周还通过上调4周间歇禁食4周末和4周间歇禁食后1周胰岛素信号关键调控蛋白(VPS8、POLRMT、IGFBP-5)和4周间歇禁食后1周H2B组蛋白上调来诱导抗衰老蛋白质组反应。在4周间歇禁食后4周，胰岛素信号关键调控蛋白VPS8、POLRMT、IGFBP-5上调，4周间歇禁食后1周通过上调H2B组蛋白表达而诱导抗衰老蛋白质组反应，4周间歇禁食后4周胰岛素信号关键调控蛋白VPS8、POLRMT、IGFBP-5和PRKCSH均上调。受试者的体重指数、腰围和血压的改善与抗癌、抗糖尿病和抗衰老血清蛋白质组反应同时发生。这些发现表明，从黎明到日落的间歇性禁食可以积极调节各自的基因，可以作为代谢综合征的辅助治疗。需要进一步的研究来测试从黎明到日落的间歇性禁食在预防和治疗代谢综合征诱导的癌症中的作用。", "note_en": "Metabolic syndrome is characterized by central obesity, insulin resistance, elevated blood pressure, and dyslipidemia. Metabolic syndrome is a significant risk factor for several common cancers (e.g., liver, colorectal, breast, pancreas). Pharmacologic treatments used for the components of the metabolic syndrome appear to be insufficient to control cancer development in subjects with metabolic syndrome. Murine models showed that cancer has the slowest progression when there is no food consumption during the daily activity phase. Intermittent fasting from dawn to sunset is a form of fasting practiced during human activity hours. To test the anticancer effect of intermittent fasting from dawn to sunset in metabolic syndrome, we conducted a pilot study in 14 subjects with metabolic syndrome who fasted (no eating or drinking) from dawn to sunset for more than 14 h daily for four consecutive weeks. We collected serum samples before 4-week intermittent fasting, at the end of 4th week during 4-week intermittent fasting and 1 week after 4-week intermittent fasting. We performed serum proteomic analysis using nano ultra-high performance liquid chromatography-tandem mass spectrometry. We found a significant fold increase in the levels of several tumor suppressor and DNA repair gene protein products (GP)s at the end of 4th week during 4-week intermittent fasting (CALU, INTS6, KIT, CROCC, PIGR), and 1 week after 4-week intermittent fasting (CALU, CALR, IGFBP4, SEMA4B) compared with the levels before 4-week intermittent fasting. We also found a significant reduction in the levels of tumor promoter GPs at the end of 4th week during 4-week intermittent fasting (POLK, CD109, CAMP, NIFK, SRGN), and 1 week after 4-week intermittent fasting (CAMP, PLAC1) compared with the levels before 4-week intermittent fasting. Fasting from dawn to sunset for four weeks also induced an anti-diabetes proteome response by upregulating the key regulatory proteins of insulin signaling at the end of 4th week during 4-week intermittent fasting (VPS8, POLRMT, IGFBP-5) and 1 week after 4-week intermittent fasting (PRKCSH), and an anti-aging proteome response by upregulating H2B histone proteins 1 week after 4-week intermittent fasting. Subjects had a significant reduction in body mass index, waist circumference, and improvement in blood pressure that co-occurred with the anticancer, anti-diabetes, and anti-aging serum proteome response. These findings suggest that intermittent fasting from dawn to sunset actively modulates the respective genes and can be an adjunct treatment in metabolic syndrome. Further studies are needed to test the intermittent fasting from dawn to sunset in the prevention and treatment of metabolic syndrome-induced cancers.", "posttime": "2020-10-30 11:16:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "诱导,fasting,禁食", "title": "从黎明到日落的间歇性禁食诱导抗癌反应", "title_en": "Intermittent fasting from dawn to sunset induces anticancer response", "transed": 1, "url": "https://pubmed.ncbi.nlm.nih.gov/33110154/", "via": "", "real_tags": ["诱导", "fasting", "禁食"]}, {"category": "", "categoryclass": "", "imagename": "ffee61781d614014f3adf393126c1084.jpg", "infoid": 1032218, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌母公司Alphabet第三季度营收较上年同期增长14%，主要得益于谷歌和YouTube广告收入的反弹。YouTube在2020年第三季度带来了50亿美元的广告收入-这一迹象表明，今年早些时候因冠状病毒而缩减支出的广告商可能正在恢复到类似正常的状态。\nYouTube现在有3000多万音乐和付费订户-3500万，包括免费试用-YouTube TV有300多万订户。这一点尤其强劲，因为YouTube TV在6月份宣布月度价格从50美元上涨到64.99美元。谷歌首席执行官桑达尔·皮查伊(Sundar Pichai)在与投资者讨论收益结果的电话会议上表示，自3月份以来，YouTube上引导冥想视频的浏览量增长了40%，DIY面膜教程的浏览量已超过10亿次，这可能是这个时代的迹象。\nAlphabet和谷歌首席财务官露丝·波拉特(Ruth Porat)在与投资者的电话会议上表示：“我们对广告商在第三季度真正重新激活预算的程度感到高兴。”她补充说，这是消费者在几乎所有垂直领域都表现出强劲需求的证据。“YouTube的观看时间增长强劲，使广告商能够接触到他们在电视上无法接触到的观众。”波拉特说，该公司已经在内容审核方面进行了投资，以确保YouTube上的创作者和用户都有积极的体验。\n今年，包括本季度，显示了谷歌的创始产品-搜索-对人们来说是多么有价值。\n谷歌的广告部门带来了371亿美元的收入，比去年的340亿美元有所增加。YouTube广告收入比2019年第三季度的38亿美元增长了30%。\n皮查伊在电话会议上说：“今年，包括本季度，显示了谷歌的创始产品--搜索--对人们来说是多么有价值。”\n这个季度与令人失望的2020年第二季度形成鲜明对比，当时谷歌的营收有史以来首次出现下滑。本季度，谷歌恢复增长，第三季度营收462亿美元，高于去年同期的400亿美元；净利润为112.4亿美元，高于去年的70.6亿美元。\n谷歌的“其他”部门，包括硬件、云服务和Play Store，收入从40亿美元增加到54亿美元。它的“其他押注”部门-包括Waymo和Verely-有1.78亿美元的收入，但对公司来说仍然是亏损的，达到11亿美元。这比去年这个时候还糟糕。\n未来的工作正在为谷歌的云产品创造“显著增长的需求”\n谷歌云部门营收为34.4亿美元，高于一年前的23亿美元，搜索部门营收为263亿美元，高于上年同期的247亿美元。皮查伊说，客户越来越多地转向云，“以提高效率和降低IT成本”，并补充说，未来的工作正在创造对谷歌云产品的“显著增长的需求”。他补充说，下个季度，谷歌将把其云部门分离出来，作为一个单独的报告部门。\n皮查伊说，该公司的视频会议平台Google Meet每天有2.35亿次会议和超过75亿次视频通话。\n皮查伊还表示，该公司正准备迎接司法部上周提起的诉讼，司法部指控这家互联网巨头非法垄断搜索和广告市场。他说：“我们相信我们的产品正在创造显著的效益，我们会有信心地证明我们的观点。”我们公司的重点仍然是继续我们的工作，打造人们喜爱和珍视的搜索产品。“", "note_en": "Google parent company Alphabet’s  third quarter revenue increased 14 percent from the year before, led by a rebound in advertising revenue for both Google and YouTube. YouTube brought in $5 billion in advertising revenue in the third quarter of 2020 — a sign that advertisers who pulled back on their spending because of the coronavirus earlier in the year may be returning to something resembling normal.\n YouTube now has more than 30 million music and premium paid subscribers — 35 million, including free trials — and YouTube TV has more than 3 million subscribers. That’s  especially strong, since YouTube TV announced a  monthly price increase from $50 to $64.99 in June. And in what may be a sign of the times, views for guided meditation videos on YouTube were up 40 percent since March, and DIY face mask tutorials have been viewed over 1 billion times, Google CEO Sundar Pichai said on a call with investors to discuss the earnings results.\n “We’re pleased at the degree to which advertisers really reactivated their budgets in the third quarter,” said Ruth Porat, CFO of Alphabet and Google, on a call with investors. She added that it was evidence that consumers are showing strong demand across nearly all verticals. “YouTube’s strong watch time growth enables advertisers to reach audiences they can’t reach on TV.” The company had made investments in content moderation to ensure both creators and users on YouTube have a positive experience, Porat said.\n “This year, including this quarter, showed how valuable Google’s founding product — search — has been to people”\n Google’s advertising division brought in revenue of $37.1 billion, an increase from $34 billion last year. YouTube ads revenue increased 30 percent from $3.8 billion in the third quarter of 2019.\n “This year, including this quarter, showed how valuable Google’s founding product — search — has been to people,” Pichai said on the call.\n This quarter was a sharp contrast to the disappointing second quarter of 2020, where Google’s  revenue declined for the first time ever. This quarter, Google returned to growth, with revenue of $46.2 billion in the third quarter, up from $40 billion a year ago, and net income of $11.24 billion, up from $7.06 billion last year.\n Google’s “other” department, which includes hardware, cloud services, and the Play Store, had revenue of $5.4 billion, up from $4 billion. Its “other bets” segment — which includes Waymo and Verily— had revenue of $178 million, but remained money-losers for the company, to the tune of $1.1 billion. That’s worse than this time last year.\n The future of work is creating “significant growth in demand” for Google’s cloud products\n Google’s Cloud division had revenue of $3.44 billion, up from $2.3 billion a year ago, and its Search segment had revenue of $26.3 billion, up from $24.7 billion. Pichai said customers are increasingly moving to the cloud, “to drive efficiency and lower IT costs,” adding that the future of work is creating “significant growth in demand” for Google’s cloud products. He added that next quarter, Google will break out its cloud division as a separate reporting segment.\n The company’s videoconferencing platform Google Meet had 235 million daily meetings and more than 7.5 billion daily video calls, Pichai said.\n Pichai also said the company was prepared for a  lawsuit filed last week by the Department of Justice, which alleges the internet giant has an illegal monopoly on search and advertising markets. “We believe that our products are creating significant benefits and we’ll confidently make our case,” he said. “Our company’s focus remains on continuing our work to build a search product that people love and value.”", "posttime": "2020-10-30 10:54:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "边缘,verge,谷歌", "title": "边缘", "title_en": "The Verge", "transed": 1, "url": "https://www.theverge.com/2020/10/29/21531711/google-alphabet-ad-revenue-youtube-waymo-cloud-search?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["边缘", "verge", "谷歌"]}, {"category": "", "categoryclass": "", "imagename": "8b3e5650259b6cd426fa35cb099cbe5b.jpg", "infoid": 1032217, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Instagram宣布将暂时从标签页面上删除最近的标签，以减少美国大选前错误信息的传播。\nFacebook旗下的Instagram周四宣布，将暂时删除标签页面上的“最近”标签，以减少11月3日美国大选前错误信息的传播。\n这家社交网络在一条推文中表示，我们这样做是为了减少选举前后可能出现的潜在有害内容的实时传播。\n当人们在Instagram上点击或搜索标签时，该应用程序会向他们显示最热门的结果和最近的结果。“最近”选项卡显示带有该标签的最新内容，而不管它是否与主题相关。\n在Facebook首席执行官马克·扎克伯格周四表示，他担心美国大选导致内乱风险上升后，决定禁用Instagram标签最近的标签。\n扎克伯格在一次讨论Facebook第三季度收益的电话中表示：我担心，随着我们的国家如此分裂，选举结果可能需要几天或几周的时间才能敲定，全国可能会出现内乱。有鉴于此，像我们这样的公司需要远远超越我们以前做过的事情。\n该公司采取的其他措施包括帮助用户注册投票，提供准确的选举信息，以及禁止有问题的内容，包括否认大屠杀。", "note_en": "Instagram announced it will temporarily remove the recent tab from hashtag pages to reduce the spread of misinformation in the lead up to the U.S. election.\n Facebook-owned Instagram on Thursday announced it will temporarily remove the &#34;Recent&#34; tab from hashtag pages in an effort to reduce the spread of misinformation in the run-up to the Nov. 3 U.S. election.\n &#34;We&#39;re doing this to reduce the real-time spread of potentially harmful content that could pop up around the election,&#34; the social network said  in a tweet.\n  When people tap on or search for a hashtag on Instagram, the app shows them top results and recent results. The recent tab shows the latest content labeled with that hashtag, regardless of whether it&#39;s relevant to the topic.\n The decision to disable the recent tab for Instagram hashtags comes after Facebook CEO Mark Zuckerberg on Thursday said he was worried about the elevated risk for civil unrest in the U.S. due to the election.\n &#34;I&#39;m worried that with our nation so divided and election results potentially taking days or weeks to be finalized, there is a risk of civil unrest across the country,&#34; Zuckerberg said on a call discussing  Facebook&#39;s third-quarter earnings. &#34;Given this, companies like ours need to go well beyond what we&#39;ve done before.&#34;\n Other steps the company has taken includes  helping users register to vote, providing  accurate election information, and banning problematic content, including  Holocaust denialism.", "posttime": "2020-10-30 10:54:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,标签,leading,instagram", "title": "Instagram表示，将暂时删除标签页面中的“最近”标签，以减少导致美国大选的错误信息的传播", "title_en": "Instagram says it will temporarily remove the “Recent” tab from hashtag pages to reduce the spread of misinformation leading up to the US election", "transed": 1, "url": "https://www.cnbc.com/2020/10/29/instagram-disables-recent-hashtag-tab-to-reduce-election-misinfo.html", "via": "", "real_tags": ["美国", "标签", "leading", "instagram"]}, {"category": "", "categoryclass": "", "imagename": "214ddb9e62c2e1dcecbd6047d7e900df.jpg", "infoid": 1032216, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "结果是：亚马逊计划让COVID在今年年底之前一直是一个不受欢迎的伙伴，成本高于上一季度。\n该公司周四在第三季度收益电话会议上表示，自今年早些时候这种疾病扎根以来，它记录了75亿美元的COVID相关成本。亚马逊此前表示，其第一季度的COVID成本约为6亿美元，第二季度超过40亿美元。首席财务官布莱恩·奥尔萨夫斯基(Brian Olsavsky)在财报电话会议上告诉一位分析师，该公司第三季度的COVID成本约为25亿美元。虽然亚马逊能够在第三季度降低成本，但由于效率的提高，这一数字在下个季度将会上升。\n奥尔萨夫斯基表示，成本增加的大部分原因是其业务的扩大。亚马逊在10月份雇佣了10万名新员工。\n新冠肺炎以及与经济、假日销售甚至天气模式相关的其他不确定性拖累了该公司第四季度的营业收入指引。亚马逊第四季提供的广泛指引介于10-45亿美元的营业收入，上年同期为39亿美元，而这一指引假设与新冠肺炎相关的成本约为40-30亿美元。\n但最能说明问题的是，即使在提供了第四季度可能存在的不确定性的长长清单之后，奥尔萨夫斯基指出，COVID仍然胜过所有不确定性。\n奥尔萨夫斯基说：“因此，第四季度通常会出现一系列问题。”我认为COVID使所有这些都相形见绌的事实给我们的营收范围带来了很大的不确定性。“。\n奥尔萨夫斯基表示，成本与改变运营方式造成的生产率损失有关，以及与个人防护设备和其他前期成本相关的费用。\n奥尔萨夫斯基在周四的财报电话会议上表示：“这些成本的最大部分与我们工厂持续的生产率逆风有关，包括修改流程，以允许社会距离和增加新设施的成本，而为支持强劲的客户需求而聘请的大量新员工还包括对员工个人防护设备的投资，以及加强我们设施的清洁。”\n亚马逊周四表示，它还将继续加大新冠肺炎内部测试计划的力度，到11月，其测试能力将达到每天50,000次，覆盖650个站点。", "note_en": "The upshot: Amazon is planning for COVID to remain an unwelcome companion through the end of the year with costs higher than the previous quarter.\n The company said Thursday in its third-quarter earnings call that it logged $7.5 billion in COVID-related costs since the disease took root earlier this year. Amazon previously said its COVID costs were about $600 million in the first quarter and more than $4 billion in the second. The company’s COVID costs in the third quarter were about $2.5 billion, CFO Brian Olsavsky told an analyst during an earnings call. While Amazon was able to lower its costs in the third quarter due to efficiencies that number is on rise for next quarter.\n  Olsavsky said the majority of the increase in costs is due to the expansion of its operations. Amazon has hired 100,000 new workers in October.\n  COVID-19 along with other uncertainties related to the economy, holiday sales and even weather patterns weighed on its guidance for operating income in the fourth quarter. Amazon provided a wide-ranging guidance of between $1 billion and $4.5 billion in operating income in the fourth quarter compared with $3.9 billion in the same period last year.  This guidance assumes about $4 billion of costs related to COVID-19.\n But what is most telling is that even after providing a lengthy list of possible uncertainties in the fourth quarter, Olsavsky noted that COVID still trumps them all.\n “So there’s a whole host of issues that generally come to bear in Q4,” Olsavsky said. “I think the fact that COVID is dwarfing all of those is causing us a lot of uncertainty on our top line range.”\n Olsavsky said costs were related to productivity losses caused by changing how it operates as well as expenses related to personal protective equipment and other upfront costs.\n “The largest portion of these costs relate to continuing productivity headwinds in our facilities, including process revisions to allow for social distancing and incremental costs to ramp up new facilities, and the large influx of new employees hired to support strong customer demand also includes investments in PPE for employees and enhanced cleaning of our facilities,” Olsavsky said during Thursday’s earnings call.\n Amazon said Thursday it also continues to ramp up its in-house COVID-19 testing program with capacity reaching 50,000 tests a day across 650 sites by November.", "posttime": "2020-10-30 10:30:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,新冠,pegs,covid", "title": "\n亚马逊预计新冠肺炎下个季度的成本约为40亿美元", "title_en": "\n\t\t\t\tAmazon pegs COVID-19 costs at an estimated $4 billion next quarter\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/29/amazon-pegs-covid-19-costs-at-an-estimated-4-billion-next-quarter/", "via": "", "real_tags": ["amazon", "亚马逊", "新冠", "pegs", "covid"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032215, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英特尔的开源开发者已经开始发布他们的补丁，使他们的Vulkan Linux驱动程序能够支持Vulkan光线跟踪！这是在为明年的Xe HPG显卡做准备，它将采用硬件加速的光线跟踪功能。\r最初开发英特尔ANV驱动程序的首席开发人员Jason Ekstrand今天发布了ANV的初始光线跟踪代码，以便为其即将推出的硬件支持VK_KHR_RAY_TRACKING。今天是英特尔第一次批准发布这种开放源码，还有更多的开放源码正在发布中。今天的代码还不足以进行Vulkan光线跟踪，但是更多的代码正在开发中，并且基于最新的Khronos内部光线跟踪规范。目前，他们没有集中在以前的NVIDIA特定的光线跟踪扩展，但可能会在未来处理它，如果游戏供应商继续瞄准它，而不是即将推出的最终的KHR版本。\r编译器端的初始核心光线跟踪位现在已经发布以供审查，另外还有一些实现它们所需的支持补丁。在近期仍将推出的其他重要项目中，包括扩展ANV驱动程序以支持编译和分派OpenCL内核、新的SPIR-V功能和通用指针支持。还需要对编译射线跟踪管道、管理加速结构、调度射线和平台支持的实际支持。只有在Khronos集团巩固了他们的VK_KHR_RAY_TRACKING扩展之后，才会真正公开支持。\r某些英特尔特定的Vulkan光线跟踪代码可能对Mesa&#39；的Radeon Vulkan&34；RADV#34；驱动程序也很有用。英特尔工程师一直在Xe HPG内部测试他们对ANV的最新光线跟踪支持。\r可以通过此合并请求找到用于光线跟踪处理的初始英特尔编译器补丁。目前形式的编译器补丁只有不到5000行代码，而之前的NIR/SPIR-V补丁还有600行，正如所说的，在英特尔Xe HPG硬件于2021年首次亮相之前，还有更多的代码即将发布。", "note_en": "Intel&#39;s open-source developers have begun publishing their patches enabling their &#34;ANV&#34; Vulkan Linux driver to support Vulkan ray-tracing! This is in preparation for next year&#39;s Xe HPG graphics card that will feature hardware-accelerated ray-tracing.\r   Jason Ekstrand as the lead developer originally on the Intel ANV driver has posted today the initial ray-tracing code for ANV in order to support  VK_KHR_ray_tracing for their forthcoming hardware. Today is the first time Intel has approved of this open-source code being published and more is on the way. The code today isn&#39;t enough for Vulkan ray-tracing but more is on the way and based against the latest internal Khronos ray-tracing specification. At the moment they are not focusing on the former NVIDIA-specific ray-tracing extension but may handle it in the future if game vendors continue targeting it rather than the forthcoming finalized KHR version.\r   There are the initial core ray-tracing bits on the compiler side now out for review plus a number of support patches needed for their implementation.  Among other big ticket items still to come in the near-term includes extending the ANV driver to support compiling and dispatching OpenCL kernels, new SPIR-V capabilities, and generic pointer support. Also needed is the actual support for compiling ray-tracing pipelines, managing acceleration structures, dispatching rays, and the platform support. The actual exposing of the support won&#39;t come until after The Khronos Group has firmed up their VK_KHR_ray_tracing extension.\r   Some of this Intel-specific Vulkan ray-tracing code may prove useful to Mesa&#39;s Radeon Vulkan &#34;RADV&#34; driver as well. Intel engineers have been testing their latest ray-tracing support with ANV internally on Xe HPG.\r   The initial Intel compiler patches for their ray-tracing handling can be found via  this merge request. The compiler patches in their current form is just under five thousand lines of code while the previous NIR/SPIR-V patches are another six hundred lines and as said a lot more code is forthcoming ahead of the Intel Xe HPG hardware debut in 2021.", "posttime": "2020-10-30 10:29:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "英特尔,程序,开源,驱动程序,xe", "title": "英特尔开始使用Xe HPG提供对Vulkan光线跟踪的开源驱动程序支持", "title_en": "Intel Begins Their Open-Source Driver Support For Vulkan Ray-Tracing With Xe HPG", "transed": 1, "url": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Vulkan-Ray-Tracing-Xe-HPG", "via": "", "real_tags": ["英特尔", "程序", "开源", "驱动程序", "xe"]}, {"category": "", "categoryclass": "", "imagename": "eb48f530623e8930f9a90ec5877d00d6.jpg", "infoid": 1032214, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为农业企业开发联网设备的初创公司ARABLE今天完成了一轮2000万美元的融资。该公司表示，所得资金将用于加速Arable的增长，并打造其下一款数据驱动型产品。\n根据2018年发表在“农业与粮食安全”杂志上的一项研究，在中美洲接受调查的860名小农中，几乎所有人(95%)都观察到了气候变化，大多数人都在经历气温上升、不可预测的降雨和极端天气事件的影响。与此同时，联合国预测，到2050年，世界人口将达到97亿，这将导致全球农业产量在2010年至2050年期间增长69%。\nArable由亚当·沃尔夫、本·西格弗里德和凯利·凯勒于2014年创立，旨在提供测量、见解和预测，使种植者能够应对这些风险。沃尔夫和凯勒一起在普林斯顿大学教过一门课，这让他们与当时的学生齐格弗里德取得了联系。\nARABLE销售ARABLE Mark，这是一种灌溉管理工具，通过LTE-M、2G和3G连接，并综合气候、植物和土壤数据以产生可视化效果。从网络仪表盘和智能手机应用程序中，太阳能供电的Mark暴露了从第三方传感器收集的降水量、作物水分亏缺、土壤湿度、低温时数和其他指标。\n这是一种类似于微软的FarmBeats平台的方法-尽管没有那么全面。农业预测分析领域的另一个竞争对手是IBM的沃森农业决策平台，这是一个由人工智能、物联网和云解决方案组成的平台，这些解决方案共同产生基于证据的洞察力。CropX吸引了埃里克·施密特(Eric Schmidt)创新努力的投资，它提供了一款移动应用程序，可以使用农场周围的传感器收集有关地形、土壤结构和水分水平的数据，并确定每块农田所需的确切水量。\n至于Mark，设备内的热传感器和声波传感器测量降雨量和读数，同时进行特定于植物的计算，以提出灌溉计划建议。(马克使用一套麦克风，将雨滴落下的声音转换为雨量和雨强。)。Mark提供每小时的表面湿度读数、叶绿素指数、天空和露水温度读数，以及表面上有助于跟踪光合作用等情况的辐射报告。\nARABLE将历史数据与观测条件(通过每小时和每天的树冠数据)相结合，以支持人工智能和机器学习驱动的预测。该公司声称，通过让Mark充当气象站和作物监测器，能够提前30小时到10天进行预测，在微气候中执行基准，为规划提供背景。\n首席执行官吉姆·埃辛顿(Jim Ethington)通过电子邮件告诉VentureBeat：“我们已经投入巨资从我们的校准验证网络收集大量培训数据，这是一个地理上多样化的受控研究站网络，提供金标田地和作物条件数据。”“我们在传感器与卫星图像的融合方面做了很多工作，所以机器学习被用来创建干净、连续、充满空白的图像，这些图像利用了我们收集的地面事实。我们正在围绕着生机勃勃的敌对网络，为种植者创造合成的、看似合理的季节，特别是为他们最近可能获得或开始工作的土地制定管理时间表。我们当然正在使用EDGE深度学习和音频，因为我们在Mark上的麦克风用于降雨监测，我们正在利用许多不同的业务预报和我们当地的天气进行一些超本地天气预报。“\nArable已经在39个不同国家的数万英亩土地上部署了Mark和它的继任者Mark 2，种植了37种作物。该公司的200多家客户包括弗朗西斯·福特·科波拉(Francis Ford Coppola)、Treasury Wine EStates和休伊特(Hewitt)等酿酒商；玛氏(Mars)、拜耳(Bayer)、嘉吉(Cargill)、Driscoll‘s和蓝瓶咖啡(Blue Bottle Coffee)等种植者；包括美国能源部在内的政府机构；以及世界银行(World Bank)和一英亩基金(One Are Fund)等非营利组织。\n在经历了2020年第三季度略高于300%的销售增长后，Arable专注于在巴西的扩张，主要是通过与电信公司Claro的合作。该公司还在学术界加倍努力，在斯坦福大学(Stanford)、加州大学戴维斯分校(University of California，Davis)、内布拉斯加大学(University Of Nebraska)和卡内基梅隆大学(Carnegie Mellon)等30多个研究地点部署了服务。\n“虽然这场流行病震惊了农业供应链，并引发了深刻的劳动力不确定性，但人们仍在吃东西，种植者仍在种植养活我们所有人的食物。如果说有什么不同的话，那就是这场大流行明确了可靠和有用的现场数据对于经营一家成功的农业公司是多么重要，我们提供的数据使我们处于有利地位，能够在我们都适应新常态的过程中满足这一需求。“帮助缓解和适应气候变化是我们耕地每天早上起床努力工作的核心驱动力。我真的相信，世界上没有比通过使用技术和数据来帮助促进农业发展更重要的努力了。“。\nPrelude Ventures领导了Arable的B轮融资，新投资者M20、拿骚街风险投资公司和Tridon(农业设备巨头Grupo Jacto的风险投资部门)以及包括S2G Ventures、Middleland Capital和Chase Field在内的现有投资者都参与了这轮融资。这使得这家总部位于旧金山的初创公司在2017年7月进行了400万美元的风险投资后，融资总额超过3800万美元。", "note_en": "Arable, a startup developing connected devices for agricultural businesses, today closed a $20 million funding round. The company says the proceeds will be used to accelerate Arable’s growth and build out the next of its data-driven products.\n According to a  2018 study published in the journal  Agriculture &amp; Food Security, almost all (95%) of 860 surveyed smallholder farmers across Central America have observed climate change, and most are experiencing the impacts of rising temperatures, unpredictable rainfall, and extreme weather events. At the same time, the United Nations projects that the world’s population will reach 9.7 billion by 2050, causing global agricultural production to rise 69% between 2010 and 2050.\n  Arable, which was founded in 2014 by Adam Wolf, Ben Siegfried, and Kelly Caylor, aims to provide measurements, insights, and predictions that enable growers to address these risks. Wolf and Caylor taught a class together at Princeton University, which brought them in touch with then-student Siegfried.\n Arable sells the Arable Mark, an irrigation management tool that connects via LTE-M, 2G, and 3G and synthesizes climate, plant, and soil data to produce visualizations. From a web dashboard and a smartphone app, the solar-powered Mark exposes precipitation, crop water deficit, soil moisture, chilling hours, and other metrics gathered from third-party sensors.\n It’s an approach akin to — albeit less holistic than — Microsoft’s  FarmBeats platform. Another rival in the agricultural predictive analytics space is IBM’s  Watson Decision Platform for Agriculture, a platform comprising AI, internet of things, and cloud solutions that together generate evidence-based insights.  CropX, which has attracted investment from Eric Schmidt’s Innovation Endeavors, offers a mobile app that uses sensors around a farm to collect data about topography, soil structure, and moisture levels and determine the exact amount of water needed for each crop field.\n  As for the Mark, thermal and acoustic sensors within the device measure rainfall and readings while plant-specific calculations are taken to make irrigation plan recommendations. (Using a suite of microphones, the Mark translates the sounds made by falling raindrops into the amount and intensity of rain.) The Mark delivers hourly surface wetness readings, chlorophyll indexes, and sky and dew temperature readings, as well as radiation reports that ostensibly help track things like photosynthesis.\n Arable combines historical data with observed conditions (via hourly and daily canopy data) to power AI- and machine learning-driven forecasts. The company claims to be able to project 30 hours to 10 days ahead by having the Mark act as a weather station and crop monitor, performing benchmarking across microclimates to provide context for planning.\n “We have invested heavily in collecting vast amounts of training data from our calibration-validation network, a geographically diverse network of controlled research stations that provide gold-standard field and crop conditions data,” CEO Jim Ethington told VentureBeat via email. “We’re doing a lot with sensor fusion with satellite imagery, so machine learning is used to create clean continuous gap-filled imagery that makes use of the ground truth we collect. We’re wrapping our head around  generative adversarial networks to generate synthetic, plausible seasons for growers, particularly the management schedule, for land that they may have recently acquired or started working. We’re of course working with edge deep learning with audio, given our microphone on the Mark used for rainfall monitoring, and we’re doing a bit of hyperlocal weather forecasting leveraging the many different operational forecasts and our local weather.”\n Arable has deployed the Mark and its successor, the Mark 2, to 37 crops across tens of thousands of acres in 39 different countries. The company’s over 200 customers include winemakers like Francis Ford Coppola, Treasury Wine Estates, and Hewitt; growers like Mars, Bayer, Cargill, Driscoll’s, and Blue Bottle Coffee; government agencies including the U.S. Department of Energy; and nonprofits such as The World Bank and One Acre Fund.\n  After experiencing just over 300% sales growth through the third quarter of 2020, Arable focused on expansion in Brazil, largely through a partnership with telecom Claro. The company also doubled down on academia, with deployments in over 30 research sites overseen by Stanford; the University of California, Davis; the University of Nebraska; and Carnegie Mellon, among others.\n “While the pandemic shocked the agricultural supply chain and induced deep labor uncertainty, people are still eating, and growers are still growing the food that feeds us all. If anything, the pandemic has crystallized just how essential reliable and useful field data are to running a successful ag company, and the data we offer makes us well positioned to fill this need as we all adjust to the new normal,” Ethington said. “Helping to mitigate and adapt to climate change is a core driver of what we at Arable get out of bed every morning to work so hard on. I truly believe that there is no more important endeavor in the world than helping to advance agriculture through the use of technology and data.”\n Prelude Ventures led Arable’s series B round with participation from new investors M20, Nassau Street Ventures, and Tridon (the venture capital arm of the agricultural equipment giant Grupo Jacto) and existing investors including S2G Ventures, Middleland Capital, and Chase Field. It brings the San Francisco-based startup’s  total raised to over $38 million following a $4 million venture round in July 2017.", "posttime": "2020-10-30 10:29:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "提供,led,农业", "title": "Arable是一家为农民提供农业洞察和预测的互联设备公司，在Prelude Ventures的带领下筹集了2000万美元的B系列资金", "title_en": "Arable, which makes connected devices for agricultural insights and predictions for farmers, raises $20M Series B led by Prelude Ventures", "transed": 1, "url": "https://venturebeat.com/2020/10/29/arable-raises-20-million-to-make-connected-devices-for-farmers/", "via": "", "real_tags": ["提供", "led", "农业"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032213, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这不是关于理解TCP的所有内容或阅读TCP/IP插图。它是关于一点TCP知识是如何至关重要的。原因如下。\n当我在递归中心时，我用Python编写了一个TCP堆栈(还写了如果用Python编写TCP堆栈会发生什么)。这是一次有趣的学习经历，我想仅此而已。\n一年后，在工作中，有人在Slake上提到“嘿，我在向NSQ发布消息，每次需要40毫秒。”我断断续续地思考这个问题已经有一个星期了，但毫无进展。\n稍微介绍一下背景知识：NSQ是一个队列，您可以将消息发送到该队列。发布消息的方式是在localhost上发出HTTP请求。向localhost发送HTTP请求确实不应该花费40毫秒。有些事出了很大的问题。NSQ守护进程没有处于高CPU负载下，它没有使用大量内存，这似乎不是垃圾收集暂停。帮助。\n然后，我想起了一周前我读到的一篇文章--我们如何将每个帖子请求减少了200毫秒。在那篇文章中，他们谈到了为什么他们的每个POST请求都多花了200毫秒。那是..。怪怪的。以下是帖子中的关键段落。\nRuby的net：：HTTP将POST请求分成两个TCP包-一个用于头，另一个用于正文。相比之下，Curl将两者结合在一起，如果它们可以放在一个包中的话。更糟糕的是，Net：：HTTP没有在它打开的TCP套接字上设置TCP_NODELAY，因此它在发送第二个数据包之前等待对第一个数据包的确认。这种行为是纳格尔算法的结果。\n移动到连接的另一端，HAProxy必须选择如何确认这两个数据包。在版本1.4.18(我们使用的版本)中，它选择使用TCP延迟确认。延迟确认与Nagle的算法相互作用严重，并导致请求暂停，直到服务器达到延迟确认超时。\n申请：嗨！这是数据包1.HAProxy：&lt；静默，等待第二个数据包&gt；HAProxy：&lt；嗯，我最终还是会确认的，但是NBD&gt；应用程序：&lt；静默&gt；应用程序：&lt；嗯，我在等待ACK，可能是网络拥塞。&lt；HAProxy：好的，我很无聊。这是一个ACK应用程序：太棒了，这是第二个数据包！HAProxy：太好了。我们这里说完了\n应用程序和HAProxy都处于被动-主动等待对方发送信息的阶段？这是额外的200ms。应用程序之所以这么做是因为Nagle的算法，而HAProxy是因为延迟的ACK。\n据我所知，每个Linux系统默认都会发生延迟的ACK，所以这不是边缘情况，也不是异常情况--如果您以超过1个TCP数据包的形式发送数据，那么这种情况可能会发生在您身上。\n所以我读了这篇文章，然后就忘了。但是我还在为我额外的40毫秒发愁，然后我就想起来了。\n我想-那不会是我的问题，对吧？可以吗？我给我的团队发了一封电子邮件，说“我想我可能疯了，但这可能是TCP的问题”。\n快速侧栏-我刚刚通过@alicemazzy的这条很棒的tweet读到了John Nagle(Nagle的算法)对Hacker News的这条评论。\n真正的问题是ACK延迟。200ms的“ACK Delay”计时器是一个糟糕的主意，伯克利的一些人在1985年左右陷入了BSD，因为他们没有真正理解这个问题。延迟的ACK打赌在200ms内会有来自应用程序级别的回复。TCP继续使用延迟的ACK，即使它每次都会输掉这个赌注。\n他接着评论说，ACK很小而且便宜，而且延迟ACK在实践中引起的问题可能比它们解决的问题严重得多。\n我过去常常认为TCP是非常低级的，我不需要理解它。这几乎是真的！但在现实生活中，有时您会有一个bug，而这个bug是由于TCP算法中的某些东西造成的。因此，了解TCP是很重要的。(正如我们经常在本博客上讨论的那样，事实证明，这在很多事情上都是正确的，比如系统调用和操作系统：)：)\n这种延迟的ACKS/TCP_NODELAY交互特别糟糕-它可能会影响任何使用任何编程语言编写发出HTTP请求的代码的人。您不必是系统编程向导就能遇到这种情况。稍微了解一下TCP是如何工作的确实帮助我解决了这个问题，并认识到博客文章描述的东西也可能是我的问题。不过，我也用了strace。永不停歇。", "note_en": "This isn’t about understanding  everything about TCP or reading through  TCP/IP Illustrated. It’s about how a little bit of TCP knowledge is essential. Here’s why.\n When I was at the  Recurse Center, I wrote a TCP stack in Python ( and wrote about what happens if you write a TCP stack in Python). This was a fun learning experience, and I thought that was all.\n A year later, at work, someone mentioned on Slack “hey I’m publishing messages to NSQ and it’s taking 40ms each time”. I’d already been thinking about this problem on and off for a week, and hadn’t gotten anywhere.\n A little background: NSQ is a queue that you send to messages to. The way you publish a message is to make an HTTP request on localhost. It really should not take  40 milliseconds to send a HTTP request to localhost. Something was terribly wrong. The NSQ daemon wasn’t under high CPU load, it wasn’t using a lot of memory, it didn’t seem to be a garbage collection pause. Help.\n Then I remembered an article I’d read a week before called  In search of performance - how we shaved 200ms off every POST request. In that article, they talk about why every one of their POST requests were taking 200 extra milliseconds. That’s.. weird. Here’s the key paragraph from the post\n  Ruby’s Net::HTTP splits POST requests across two TCP packets - one for theheaders, and another for the body. curl, by contrast, combines the two ifthey’ll fit in a single packet. To make things worse, Net::HTTP doesn’t setTCP_NODELAY on the TCP socket it opens, so it waits for acknowledgement of thefirst packet before sending the second. This behaviour is a consequence ofNagle’s algorithm.\n Moving to the other end of the connection, HAProxy has to choose how toacknowledge those two packets. In version 1.4.18 (the one we were using), itopted to use TCP delayed acknowledgement. Delayed acknowledgement interactsbadly with Nagle’s algorithm, and causes the request to pause until the serverreaches its delayed acknowledgement timeout..\n    application: hi! Here’s packet 1.  HAProxy: &lt;silence, waiting for the second packet&gt; HAProxy: &lt;well I’ll ack eventually but nbd&gt; application: &lt;silence&gt; application: &lt;well I’m waiting for an ACK maybe there’s network congestion&gt; HAProxy: ok i’m bored. here’s an ack application: great here’s the second packet!!!! HAProxy: sweet. we’re done here\n That period where the application and HAProxy are both passive-aggressivelywaiting for the other to send information? That’s the extra 200ms. The application is doing it because of Nagle’s algorithm, and HAProxy because of delayed ACKs.\n Delayed ACKs happen, as far as I understand, by default on  every Linux system.So this isn’t an edge case or an anomaly – if you send your data in more than 1TCP packet, it can happen to you.\n  So I read this article, and forgot about it. But I was stewing about my extra 40ms, and then I remembered.\n And I thought – that can’t be my problem, can it? can it??? And I sent an email to my team saying “I think I might be crazy but this might be a TCP problem”.\n    A quick sidebar – I just read  this comment on Hacker News from John Nagle (of Nagle’s algorithm) via  this awesome tweet by @alicemazzy.\n The real problem is ACK delays. The 200ms “ACK delay” timer is a bad idea thatsomeone at Berkeley stuck into BSD around 1985 because they didn’t reallyunderstand the problem. A delayed ACK is a bet that there will be a reply fromthe application level within 200ms. TCP continues to use delayed ACKs even ifit’s losing that bet every time.\n He goes on to comment that ACKs are small and inexpensive, and that the problemscaused in practice by delayed ACKs are probably much worse than the problemsthey solve.\n  I used to think that TCP was really low-level and that I did not need to understand it. Which is mostly true! But sometimes in real life you have a bug and that bug is because of something in the TCP algorithm. So it turns out that understanding TCP is important. (as we frequently discuss on this blog, this turns out to be true for a lot of things, like, system calls &amp; operating systems :) :))\n This delayed ACKs / TCP_NODELAY interaction is particularly bad – it could affect anyone writing code that makes HTTP requests, in any programming language. You don’t have to be a systems programming wizard to run into this. Understanding a tiny bit about how TCP worked really helped me work through this and recognize that that thing the blog post was describing also might be my problem. I also used strace, though. strace forever.", "posttime": "2020-10-30 10:25:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "了解,understand,tcp", "title": "(稍微)了解TCP(2015)", "title_en": "Understand (a little) about TCP (2015)", "transed": 1, "url": "https://jvns.ca/blog/2015/11/21/why-you-should-understand-a-little-about-tcp/", "via": "", "real_tags": ["了解", "tcp"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032210, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创造\r帐目", "note_en": "Create\r\t\t\t\t\t\t\t\t\t\t\tAccount", "posttime": "2020-10-30 10:24:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "听说,vacuum,创造", "title": "你从未听说过的最棒的真空管", "title_en": "Greatest Vacuum Tubes You’ve Never Heard Of", "transed": 1, "url": "https://spectrum.ieee.org/tech-history/space-age/the-11-greatest-vacuum-tubes-youve-never-heard-of", "via": "", "real_tags": ["听说", "vacuum", "创造"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032209, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Vega-Lite是交互式图形的高级语法。它提供了一种简洁的声明性JSON语法，为数据分析和表示创建了一系列富有表现力的可视化。\nVega-Lite规范将可视化描述为编码从数据到图形标记(例如，点或条)属性的映射。Vega-Lite编译器自动生成可视化组件，包括轴、图例和比例。它根据一组精心设计的规则确定这些组件的默认属性。这种方法允许Vega-Lite规范简明扼要地进行快速可视化创作，同时允许用户控制覆盖默认值和自定义可视化的各个部分。由于我们还设计了Vega-Lite来支持数据分析，Vega-Lite既支持数据转换(例如，聚合、入库、过滤、排序)，也支持可视化转换(例如，堆叠和分面)。此外，Vega-Lite规范可以组合成分层和多视图显示，并与选择进行交互。开始在线试用。\n与Vega相比，Vega-Lite提供了一种更简洁、更方便的形式来创作常见的可视化效果。由于Vega-Lite可以将其规范编译为Vega规范，因此用户可以使用Vega-Lite作为主要的可视化工具，如果需要，可以过渡到将较低级别的Vega用于高级用例。\n要了解更多信息，请阅读Medium上关于Vega-Litev2的介绍文章，观看我们的OpenVis会议谈论Vega-Litev2中的新功能，查看文档并查看我们的示例库。在Twitter上关注我们@Vega_vis，随时了解最新情况。\n有了Vega-Lite，我们可以从西雅图的a开始，并让它代表。\n我们的OpenVis会议获奖研究论文和视频谈Vega-Lite的设计。\nVega-Lite被许多组织中数以千计的数据爱好者、开发人员、记者、数据科学家、教师和研究人员使用。这是其中的一些。在我们的生态系统页面上了解有关集成的信息。\nVega-Lite的开发由华盛顿大学交互数据实验室(UW IDL)的校友和成员领导，包括Kanit“Ham”Wongsuphasawat(现供职于苹果公司)、Dominik Moritz(现供职于CMU/Apple)、Arvind Satyanarayan(现供职于麻省理工学院)和Jeffrey Heer(现供职于UW IDL)。\nVega-Lite从其社区获得了重大贡献-特别是Will Strimling，Yuhan(Zoe)Lu，Souvik Sen，Chanwut Kittivorawong，Matthew Chun，Akshat Shriastava，Saba Noorassa，Sira Horradarn，Donho Ren和Halden Lin。有关投稿人的完整列表，请参阅投稿人页面。", "note_en": "Vega-Lite is a high-level grammar of interactive graphics. It provides a concise, declarative JSON syntax to create an expressive range of visualizations for data analysis and presentation.\n Vega-Lite specifications describe visualizations as encoding mappings from data to  properties of graphical marks (e.g., points or bars). The Vega-Lite compiler  automatically produces visualization components including axes, legends, and scales. It determines default properties of these components based on a set of  carefully designed rules. This approach allows Vega-Lite specifications to be concise for quick visualization authoring, while giving user control to override defaults and customize various parts of a visualization. As we also designed Vega-Lite to support data analysis, Vega-Lite supports both  data transformations (e.g., aggregation, binning, filtering, sorting) and  visual transformations (e.g., stacking and faceting). Moreover, Vega-Lite specifications can be  composed into layered and multi-view displays, and made  interactive with selections.     Get started    Try online\n Compared to  Vega, Vega-Lite provides a more concise and convenient form to author common visualizations. As Vega-Lite can compile its specifications to Vega specifications, users may use Vega-Lite as the  primary visualization tool and, if needed, transition to use the lower-level Vega for advanced use cases.\n For more information, read our  introduction article to Vega-Lite v2 on Medium, watch our  OpenVis Conf talk about the new features in Vega-Lite v2, see the  documentation and take a look at our  example gallery. Follow us on  Twitter at @vega_vis to stay informed about updates.\n  With Vega-Lite, we can start with a   in Seattle,  , and have it represent  .\n  Award winning  research paper and  video of our OpenVis Conf talk on the design of Vega-Lite\n  Vega-Lite is used by thousands of data enthusiasts, developers, journalists, data scientists, teachers, and researchers across many organizations. Here are some of them. Learn about integrations on our  ecosystem page.\n   The development of Vega-Lite is led by the alumni and members of the  University of Washington Interactive Data Lab (UW IDL), including  Kanit “Ham” Wongsuphasawat (now at Apple),  Dominik Moritz (now at CMU / Apple),  Arvind Satyanarayan (now at MIT), and  Jeffrey Heer (UW IDL).\n Vega-Lite gets significant contributions from its community–in particular  Will Strimling,  Yuhan (Zoe) Lu,  Souvik Sen,  Chanwut Kittivorawong,  Matthew Chun,  Akshat Shrivastava,  Saba Noorassa,  Sira Horradarn,  Donghao Ren, and  Halden Lin. Please see the  contributors page for the full list of contributors.", "posttime": "2020-10-30 09:59:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "图形,lite,vega", "title": "Vega-Lite：一种交互式图形语法", "title_en": "Vega-Lite: A Grammar of Interactive Graphics", "transed": 1, "url": "https://vega.github.io/vega-lite/", "via": "", "real_tags": ["图形", "lite", "vega"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032206, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尝试全数字访问，了解为什么有100多万读者订阅英国“金融时报”\n选择以1.00美元购买试用订阅，为期4周，试用结束后，您每月将收到89.00美元的账单。\n4周内可无限制享受英国“金融时报”值得信赖、屡获殊荣的商业新闻的无限量高级数字访问。\n礼品-每月与家人、朋友和同事分享多达10篇文章", "note_en": "Try full digital access and see why over 1 million readers subscribe to the FT\n  Select  Purchase a Trial subscription for $1.00 for 4 weeks   You will be billed $89.00 per month after the trial ends\n  For 4 weeks receive unlimited Premium digital access to the FT&#39;s trusted, award-winning business news\n  Gift Article – share up to 10 articles a month with family, friends and colleagues", "posttime": "2020-10-30 09:34:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,科学家,冠状病毒,变异", "title": "科学家警告新的冠状病毒变异在欧洲蔓延", "title_en": "Scientists warn of new coronavirus variant spreading across Europe", "transed": 1, "url": "https://www.ft.com/content/2782655a-0441-4d38-bb03-5c4e67ead110", "via": "", "real_tags": ["病毒", "科学家", "冠状病毒", "变异"]}, {"category": "", "categoryclass": "", "imagename": "2aeb48d1061bf4c3ddce6c40e22f6ac2.jpg", "infoid": 1032205, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌的研究人员表示，他们正在开发一种人工智能系统，可以自动将网页转换为短视频。它从HTML源中提取文本和图像等资源及其设计样式(包括字体、颜色和图形布局)，并将资源组织到一系列快照中，同时保持与源页面相似的外观和感觉。\n谷歌预计，该系统可能会对托管网站的企业有用，这些网站包含关于他们的服务或产品的丰富视觉表现。该公司表示，这些资产可以重新用于视频，有可能使那些没有大量资源的人能够接触到更广泛的受众。一段典型的视频价格在880美元到1200美元之间，制作起来可能需要几天到几周的时间。\nURL2Video是在2020用户界面软件和技术研讨会上展示的，它自动从页面中选择关键内容，并决定每项资产的时间和视觉呈现方式。这些演示来自一组通过与设计师的研究确定的启发式方法，它们捕捉视频编辑风格，包括内容层次结构，限制镜头中的信息量及其持续时间，同时为品牌提供一致的颜色和风格。使用这些信息，URL2Video解析网页，分析内容，选择视觉上突出的文本或图像，并保留根据用户规范组织的设计样式。\nURL2Video以每个网页为基础提取文档对象模型信息和多媒体材料，将视觉上可区分的元素标识为包含标题、产品图像、描述和行动号召按钮的资产组候选列表。系统捕获每个元素的原始资产(即文本和多媒体文件)和详细设计规范(HTML标签、CSS样式和呈现位置)，然后通过根据资产组的视觉外观和注释为每个资产组分配优先级分数来对资产组进行排名。这样，在页面顶部占据较大区域的资产组将获得更高的分数。\nURL2Video自动选择并排序资产组，以优化总优先级分数。为了使视频简洁，系统只显示页面中的主要元素，如标题和一些多媒体资产，并限制元素的持续时间。给出基于DOM层次结构的资产排序列表，URL2Video遵循从设计研究中获得的启发式方法来做出关于时间和空间安排的决策。系统将元素的布局转换为视频的纵横比，并应用包括字体和颜色在内的样式选择，调整资源的呈现时间，并将内容渲染为MPEG-4视频。\n谷歌表示，在与谷歌设计师进行的一项用户研究中，URL2Video有效地从网页中提取了元素，并通过引导视频创建过程来支持设计师。谷歌研究科学家Peggy Chi和Irfan Essa在一篇博客文章中写道：“虽然目前的研究集中在视觉展示上，但我们正在开发新的技术，以支持视频编辑中的音轨和画外音。”总而言之，我们展望了这样一个未来：创作者专注于做出高层决策，ML模型交互地建议对多个平台上的最终视频创作进行详细的时间和图形编辑。“。\n初创企业如何扩展通信：\r\r这场流行病让初创企业密切关注如何提升他们的通信解决方案。学习如何", "note_en": "Researchers at Google say they’ve developing an  AI system that can automatically convert webpages into short videos. It extracts assets like text and images and their design styles including fonts, colors, and graphical layouts from HTML sources and organizes the assets into a sequence of shots, maintaining a look and feel similar to the source page as it does so.\n Google envisions the system could be useful to businesses that host websites containing rich visual representations about their services or products. These assets, the company says, could be repurposed for videos, potentially enabling those without extensive resources to reach a broader audience. A typical video costs  between $880 and $1,200 and can take days to weeks to produce.\n  URL2Video, which was presented at the 2020 User Interface Software and Technology Symposium, automatically selects key content from a page and decides the temporal and visual presentation of each asset. These presentations come from a set of heuristics identified through a study with designers, and they capture video editing styles including content hierarchy, constraining the amount of information in a shot and its time duration while providing consistent color and style for branding. Using this information, URL2Video parses a webpage, analyzes the content, selects visually salient text or images, and preserves design styles, which it organizes according to a user’s specifications.\n  URL2Video extracts document object model information and multimedia materials on a per-webpage basis, identifying visually distinguishable elements as a candidate list of asset groups containing headings, product images, descriptions, and call-to-action buttons. The system captures both the raw assets (i.e., text and multimedia files) and detailed design specifications (HTML tags, CSS styles, and rendered locations) for each element and then ranks the asset groups by assigning each a priority score based on their visual appearance and annotations. In this way, an asset group that occupies a larger area at the top of the page receives a higher score.\n URL2Video automatically selects and orders the asset groups to optimize the total priority score. To make the videos concise, the system presents only dominant elements from a page, such as a headline and a few multimedia assets, and constrains the duration of elements. Given an ordered list of assets based on the DOM hierarchy, URL2Video follows the heuristics obtained from the design study to make decisions about both the temporal and spatial arrangement. The system transfers the layout of elements into the video’s aspect ratio and applies the style choices including fonts and colors, adjusting the presentation timing of assets and rendering the content into an MPEG-4 video.\n  Google says that in a user study with designers at Google, URL2Video effectively extracted elements from a webpage and supported the designers by bootstrapping the video creation process. “While this current research focuses on the visual presentation, we are developing new techniques that support the audio track and a voiceover in video editing,” Google research scientists Peggy Chi and Irfan Essa wrote in a  blog post. “All in all, we envision a future where creators focus on making high-level decisions and an ML model interactively suggests detailed temporal and graphical edits for a final video creation on multiple platforms.”\n How startups are scaling communication:\r\rThe pandemic is making startups take a close look at ramping up their communication solutions.  Learn how", "posttime": "2020-10-30 09:14:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,人工智能,ai,视频", "title": "谷歌的人工智能将网页转换为视频", "title_en": "Google's AI Converts Webpages Into Videos", "transed": 1, "url": "https://venturebeat.com/2020/10/29/googles-ai-converts-webpages-into-videos/", "via": "", "real_tags": ["google", "谷歌", "人工智能", "ai", "视频"]}]