[{"category": "", "categoryclass": "", "imagename": "48218a854d21c55d106e8b5b8674bbab.jpeg", "infoid": 1034419, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尽管冠状病毒疫情仍然是Lyft Inc.的一个问题，但该公司第三季度的业绩超出了分析师的预期。\nLyft股价周二在盘后交易中上涨近1.5%，常规交易时段收盘报36.05美元，跌幅为4.35%。\nLyft Lyft第三季度营收4.997亿美元，亏损4.595亿美元，合每股1.46美元，低于去年同期的9.556亿美元。经股票薪酬和其他影响调整后，Lyft报告每股亏损89美分。\nFactSet调查的分析师平均预期Lyft每股亏损93美分，营收为4.874亿美元。\n第三季度活跃乘客增长44%，至1,250万人次，而第二季度为870万人次。第二季度，在与冠状病毒相关的严格封锁解除后，网约车开始复苏。分析师平均预计，该季度活跃乘客为1,190万人次，总乘车人次为1.063亿人次。尽管如此，活跃乘客比去年同期下降了44%。\nLyft的股价受到零工公司上周在加州的22号提案胜利的提振，今年到目前为止已经下跌了12%以上。", "note_en": "Although the coronavirus pandemic continued to be a problem for Lyft Inc., its third-quarter results beat analysts’ expectations.\n  Shares of Lyft rose nearly 1.5% in extended trading Tuesday after closing at $36.05 in regular trading, a 4.35% decline.\n  Lyft  LYFT,  -4.35% posted a third-quarter loss of $459.5 million, or $1.46 a share, on revenue of $499.7 million, down from $955.6 million a year ago. After adjusting for stock-based compensation and other effects, Lyft reported a loss of 89 cents a share.\n  Analysts surveyed by FactSet on average expected Lyft to post a loss of 93 cents a share on revenue of $487.4 million.\n  Active riders grew 44% to 12.5 million in the third quarter compared with 8.7 million in the second quarter, when the ride-hailing recovery began after strict coronavirus-related lockdowns were eased. Analysts on average had expected 11.9 million active riders and 106.3 million total rides in the quarter. Still, active riders were down 44% from the year-ago quarter.\n  Lyft shares, which have gotten a boost from the gig companies’  Proposition 22 victory in California last week, are down more than 12% so far this year.", "posttime": "2020-11-11 06:41:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "活跃,reports,lyft", "title": "Lyft报告第三季度营收为4.997亿美元，高于预期的4.866亿美元，净亏损4.6亿美元，同比几乎持平，活跃乘客季度增长44%，至1250万人，但仍同比下降44%。", "title_en": "Lyft reports Q3 revenue of $499.7M vs. estimates of $486.6M, net loss of $460M, nearly flat YoY, active riders grew 44% QoQ to 12.5M but are still down 44% YoY", "transed": 1, "url": "https://www.marketwatch.com/story/lyft-beats-earnings-expectations-as-ride-hailing-recovery-continues-11605044676?mod=mw_latestnews", "via": "", "real_tags": ["活跃", "reports", "lyft"]}, {"category": "", "categoryclass": "", "imagename": "3c68df3618293a1eadc326be5049c670.jpg", "infoid": 1034418, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "向私有网络上的设备和服务器发出请求的恶意网站长期以来一直是一种威胁。例如，攻击者可能会更改无线路由器的配置，以启用中间人攻击。CORS-RFC1918建议在浏览器上默认阻止此类请求，并要求内部设备选择加入来自公共互联网的请求。\n为了了解这一变化对网络生态系统的影响，Chrome团队正在寻找为私有网络构建服务器的开发人员的反馈。\n许多Web服务器在专用网络中运行-无线路由器、打印机、Intranet网站、企业服务和物联网(IoT)设备只是其中的一部分。它们似乎比暴露在公众面前的环境更安全，但这些服务器可能会被使用网页作为代理的攻击者滥用。例如，恶意网站可以嵌入一个URL，当受害者(在启用了JavaScript的浏览器上)简单地查看该URL时，它会试图更改受害者家庭宽带路由器上的DNS服务器设置。这种类型的攻击被称为Drive-ByPharming，发生在2014年。超过30万台易受攻击的无线路由器被利用，他们的DNA设置被更改，攻击者可以将用户重定向到恶意服务器。\n为了减轻类似攻击的威胁，网络社区正在引入专门针对RFC1918中定义的专用网络的CORS-RFC1918-跨域资源共享(CORS)。\n实现CORS的浏览器会检查目标资源是否可以从不同的来源加载。这可以通过内联描述访问的额外标头来实现，也可以通过使用称为印前检查请求的机制来实现，具体取决于复杂性。阅读跨地域资源共享了解更多信息。\n使用CORS-RFC1918，默认情况下，浏览器将阻止私有网络上的资源加载，但服务器使用CORS和HTTPS明确允许的资源除外。对这些资源的网站制作请求将需要发送CORS报头，服务器将需要明确声明它通过使用相应的CORS报头响应来接受跨源请求。(确切的CORS头仍在开发中。)。\n专用网络解析为IPv4中RFC1918第3节中定义的专用地址空间的目的地、IPv4映射的IPv6地址(其中映射的IPv4地址本身是专用的)，或者是位于：：1/128、2000：：/3和ff00：：/8子网之外的IPv6地址。\n本地网络解析为IPv4 RFC1122第3.2.1.3节中定义的环回空间(127.0.0.0/8)、IPv4 RFC3927中定义的链路本地空间(169.254.0.0/16)、IPv6 RFC4193第3节中定义的唯一本地地址前缀(fc00：：/7)的目的地。在IPv6的RFC4291的2.5.6节中定义的前缀(fe80：：/10)。\n第一步：只允许来自HTTPS网页的内网资源请求#。\nChrome87增加了一个标志，要求公共网站请求私有网络资源时必须使用HTTPS。您可以访问chrome://flags#block-insecure-private-network-requests来启用它。打开此标志后，任何来自HTTP网站的对专用网络资源的请求都将被阻止。\n从Chrome 88开始，CORS-RFC1918错误将在控制台上报为CORS策略错误。\n在Chrome DevTools的网络面板中，您可以启用被阻止的请求复选框以专注于被阻止的请求：\n将来，当一个公共网站试图从个人或本地网络获取资源时，Chrome会在实际请求之前发送一个印前检查请求。\n除了其他CORS请求头之外，该请求还将包括Access-Control-Request-Private-Network：TrueHeader。其中，这些eHeader标识发出请求的来源，从而允许细粒度的访问控制。服务器可以使用Access-Control-Allow-Private-Network：True标头进行响应，以明确指示它授予对资源的访问权限。\n这些标头仍在开发中，未来可能会发生变化。目前不需要采取任何行动。\n如果您在私有网络中托管一个网站，而该网站需要来自公共网络的请求，Chrome团队会对您的反馈和使用案例感兴趣。您可以做两件事来帮助您：\n转到chrome://flags#block-insecure-private-network-requests，，打开旗帜，看看您的网站是否按预期向内网资源发送请求。\n如果您遇到任何问题或有反馈，请在crbug.com上提交问题，并将组件设置为Blink&gt；SecurityFeature&&gt;CORS&gT；RFC1918。\n我们的无线路由器通过HTTP为同一私有网络的管理网站提供服务。如果嵌入管理网站的网站需要HTTPS，它将是混合内容。我们应该在封闭网络中的管理网站上启用HTTPS吗？\n这正是Chrome正在寻找的反馈类型。请将您的具体用例问题提交到crbug.com。Chrome会很高兴听到你的消息。", "note_en": "Malicious websites making requests to devices and servers hosted on a privatenetwork have long been a threat. Attackers may, for example, change a wirelessrouter&#39;s configuration to enable Man-in-the-Middleattacks. CORS-RFC1918 is a proposal to block such requests by default on thebrowser and require internal devices to opt-in to requests from the publicinternet.\n To understand how this change impacts the web ecosystem, the Chrome team islooking for feedback from developers who build servers for private networks.\n  Many web servers run within a private network—wireless routers, printers,intranet websites, enterprise services, and Internet of Things (IoT) devices are only part of them.They might seem to be in a safer environment than the ones exposed to the publicbut those servers can be abused by attackers using a web page as a proxy. Forexample, malicious websites can embed a URL that, when simply viewed by thevictim (on a JavaScript-enabled browser), attempts to change the DNS serversettings on the victim&#39;s home broadband router. This type of attack is called&#34; Drive-ByPharming&#34; and it happened in2014.More than 300,000 vulnerable wireless routers were exploited by having their DNSsettings changed and allowing attackers to redirect users to malicious servers.\n  To mitigate the threat of similar attacks, the web community is bringing CORS-RFC1918— Cross Origin ResourceSharing (CORS) specializedfor private networks defined in  RFC1918.\n Browsers that implement CORS check with targetresources whether they are okay being loaded from a different origin. This isaccomplished either with extra headers inline describing the access or by usinga mechanism called preflight requests, depending on the complexity. Read  CrossOrigin Resource Sharingto learn more.\n With  CORS-RFC1918 the browser will blockloading resources over the private network by default except ones that areexplicitly allowed by the server using CORS and through HTTPS. The websitemaking requests to those resources will need to send CORS headers and the serverwill need to explicitly state that it accepts the cross-origin request byresponding with corresponding CORS headers. (The exact  CORSheaders are still under development.)\n      A private network A destination that resolves to the private address space defined in Section 3 of RFC1918 in IPv4, an IPv4-mapped IPv6address where the mapped IPv4 address is itself private, or an IPv6 addressoutside the  ::1/128,  2000::/3 and  ff00::/8 subnets.\n A local network A destination that resolves to the &#34;loopback&#34; space ( 127.0.0.0/8) defined insection 3.2.1.3 of  RFC1122 of IPv4, the&#34;link-local&#34; space ( 169.254.0.0/16) defined in RFC3927 of IPv4, the &#34;Unique LocalAddress&#34; prefix ( fc00::/7) defined in Section 3 of RFC4193 of IPv6, or the &#34;link-local&#34;prefix ( fe80::/10) defined in section 2.5.6 of RFC4291 of IPv6.\n     Step 1: Requests to private network resources will be allowed only from HTTPS web pages  #\n Chrome 87 adds a flag that mandates public websites making requests to privatenetwork resources to be on HTTPS. You can go to chrome://flags#block-insecure-private-network-requests to enable it. With thisflag turned on, any requests to a private network resource from an HTTP websitewill be blocked.\n Starting from Chrome 88, CORS-RFC1918 errors will be reported as CORS policyerrors in the console.\n  In the  Network panel of Chrome DevTools you can enable the  Blocked Requestscheckbox to focus in on blocked requests:\n     In the future, whenever a public website is trying to fetch resources from aprivate or a local network, Chrome will send a preflight request before theactual request.\n The request will include an  Access-Control-Request-Private-Network: trueheader in addition to other CORS request headers. Among other things, theseheaders identify the origin making the request, allowing for fine-grained accesscontrol. The server can respond with an  Access-Control-Allow-Private-Network: true header to explicitly indicate that it grants access to the resource.\n These headers are still under development and may change in the future. No action iscurrently required.\n  If you are hosting a website within a private network that expects requests frompublic networks, the Chrome team is interested in your feedback and use cases. Thereare two things you can do to help:\n Go to  chrome://flags#block-insecure-private-network-requests, turn on theflag and see if your website sends requests to the private network resource asexpected.\n If you encounter any issues or have feedback, file an issue at crbug.comand set the component to  Blink&gt;SecurityFeature&gt;CORS&gt;RFC1918.\n  Our wireless router serves an admin website for the same private network butthrough HTTP. If HTTPS is required for websites that embed the admin website,it will be mixed content. Should we enable HTTPS on the admin website in aclosed network?\n This is exactly the type of feedback Chrome is looking for. Please file an issuewith your concrete use case at  crbug.com. Chrome would love to hear from you.", "posttime": "2020-11-11 06:37:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "反馈,wanted,网站", "title": "需要反馈：专用网络的CORS(RFC1918)", "title_en": "Feedback wanted: CORS for private networks (RFC1918)", "transed": 1, "url": "https://web.dev/cors-rfc1918-feedback/", "via": "", "real_tags": ["反馈", "wanted", "网站"]}, {"category": "", "categoryclass": "", "imagename": "58c623303603182ef2e85f5a5b67981d.png", "infoid": 1034417, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Firejar是一个SUID沙盒程序，通过使用Linux命名空间、seccomp-bpf和Linux功能限制不可信应用程序的运行环境，从而降低安全漏洞的风险。它允许进程及其所有后代拥有自己的私有视图，可以查看全局共享的内核资源，如网络堆栈、进程表、挂载表。Firejar可以在SELinux或AppArmor环境下工作，并与Linux Control Groups集成。\n该软件是用C语言编写的，几乎没有依赖关系，可以在任何3.x内核版本或更高版本的Linux计算机上运行。它可以用沙箱保护任何类型的进程：服务器、图形应用程序，甚至用户登录会话。该软件包括一些更常见的Linux程序的沙箱配置文件，如Mozilla Firefox、Chromium、VLC、Transport等。\n沙箱重量轻，开销低。没有复杂的配置文件需要编辑，没有打开套接字连接，也没有后台运行的守护程序。所有安全功能都直接在Linux内核中实现，并可在任何Linux计算机上使用。\n我们非常重视安全漏洞。如果您认为找到了一个，请发电子邮件给我们，地址为netBlue30@protonmail.com。\n请先尝试从您的系统包安装Firejagle。Firejarar包括在阿尔卑斯、Alt Linux、Arch、Chakra、Debian、Deepin、Devuan、Fedora、Gentoo、Manjaro、Mint、NixOS、Parbola、Parrota、PCLinuxOS、ROSA、Solus、Slackware/SlackBuilds、Trisquel、Ubuntu、VOID和其他软件中。\n已弃用FireJolar 0.9.52-LTS版本。在Ubuntu 18.04上，建议LTS用户使用PPA。在Debian Buster上，我们推荐使用Backports包。\n您也可以安装一个已发布的包，或者从我们的Git存储库中克隆Firejar的源代码并手动编译：\n在debian/ubuntu上，你需要安装git和GCC编译器。使用--apapmor./configure选项时需要AppArmorDevelopment库和pkg-config：\n$Firejar Firefox#启动Mozilla Firefox$Firejar传输-GTK#启动传输BitTorrent$Firejar VLC#启动VideoLAN客户端$sudo Firejar/etc/init.d/nginx start。\n第一个命令解决了版本9之前的PulseAudio软件中的一些共享内存/PID名称空间错误。第二个命令将Firejar集成到您的桌面中。您需要注销并重新登录才能应用PulseAudio更改。\n以您习惯的方式启动您的程序：桌面管理器菜单、文件管理器、桌面启动器。该集成适用于Firejear默认支持的任何程序。在当前的Firejar版本中，大约有250个默认应用程序，而且随着每个新版本的发布，这个数字都会增加。我们将应用程序列表保存在/usr/lib/Firejar/firecfg.config文件中。\n大多数Firejar命令行选项都可以使用配置文件传递到沙箱中。您可以在/etc/fire jill目录中找到所有受支持应用程序的配置文件。\n如果您在公共存储库中保留其他Firejar安全配置文件，请给我们一个链接：\n您还可以使用此工具获取程序所需的syscall列表：contrib/syscalls.sh。\n我们还在ETC-FIXS目录中保存了以前发布版本的配置文件修复列表。\n$sudo cp src/Profstats/Profstats/etc/Firejarge/.$cd/etc/Firejarge$./Profstats*.profileWarning：传输守护程序中的多个大写.profileStats：配置文件1031包括本地配置文件1031(包括配置文件名称.local)包括全局配置文件1031(包括global)黑名单~/.ssh 1007(包括Disable-Common.inc)seccomp 976功能1030 noexec 901(785白名单主目录474白名单var 699(包括Whitelist-var-Common.inc)白名单run/user 336(。包括白名单-Runuser-Common.inc或黑名单${RUNUSER})白名单USR/Share 359(包括白名单-USR-Share-Common.inc Net None 333 Dbus-User None 523 Dbus-System None 632##新配置文件：壮观，铬浏览器-隐私", "note_en": "Firejail is a SUID sandbox program that reduces the risk of security breaches by restrictingthe running environment of untrusted applications using Linux namespaces, seccomp-bpfand Linux capabilities. It allows a process and all its descendants to have their own privateview of the globally shared kernel resources, such as the network stack, process table, mount table.Firejail can work in a SELinux or AppArmor environment, and it is integrated with Linux Control Groups.\n Written in C with virtually no dependencies, the software runs on any Linux computer with a 3.x kernelversion or newer. It can sandbox any type of processes: servers, graphical applications, and evenuser login sessions. The software includes sandbox profiles for a number of more common Linux programs,such as Mozilla Firefox, Chromium, VLC, Transmission etc.\n The sandbox is lightweight, the overhead is low. There are no complicated configuration files to edit,no socket connections open, no daemons running in the background. All security features areimplemented directly in Linux kernel and available on any Linux computer.\n          We take security bugs very seriously. If you believe you have found one, please report it by emailing us at  netblue30@protonmail.com\n  Try installing Firejail from your system packages first. Firejail is included in Alpine, ALT Linux, Arch, Chakra, Debian, Deepin, Devuan, Fedora, Gentoo, Manjaro, Mint, NixOS, Parabola, Parrot, PCLinuxOS, ROSA, Solus, Slackware/SlackBuilds, Trisquel, Ubuntu, Void and possibly others.\n The firejail 0.9.52-LTS version is deprecated. On Ubuntu 18.04 LTS users are advised to use the  PPA. On Debian buster we recommend to use the  backports package.\n You can also install one of the  released packages, or clone Firejail’s source code from our Git repository and compile manually:\n  On Debian/Ubuntu you will need to install git and gcc compiler. AppArmordevelopment libraries and pkg-config are required when using --apparmor./configure option:\n      $ firejail firefox # starting Mozilla Firefox$ firejail transmission-gtk # starting Transmission BitTorrent$ firejail vlc # starting VideoLAN Client$ sudo firejail /etc/init.d/nginx start\n      The first command solves some shared memory/PID namespace bugs in PulseAudio software prior to version 9.The second command integrates Firejail into your desktop. You would need to logout and login back to applyPulseAudio changes.\n Start your programs the way you are used to: desktop manager menus, file manager, desktop launchers.The integration applies to any program supported by default by Firejail. There are about 250 default applicationsin current Firejail version, and the number goes up with every new release.We keep the application list in  /usr/lib/firejail/firecfg.config file.\n  Most Firejail command line options can be passed to the sandbox using profile files.You can find the profiles for all supported applications in  /etc/firejail directory.\n If you keep additional Firejail security profiles in a public repository, please give us a link:\n   You can also use this tool to get a list of syscalls needed by a program:  contrib/syscalls.sh.\n We also keep a list of profile fixes for previous released versions in  etc-fixes directory.\n       $ sudo cp src/profstats/profstats /etc/firejail/.$ cd /etc/firejail$ ./profstats *.profileWarning: multiple caps in transmission-daemon.profileStats: profiles\t\t\t1031 include local profile\t1031 (include profile-name.local) include globals\t\t1031 (include globals.local) blacklist ~/.ssh\t\t1007 (include disable-common.inc) seccomp\t\t\t976 capabilities\t\t1030 noexec\t\t\t901 (include disable-exec.inc) memory-deny-write-execute\t221 apparmor\t\t\t555 private-bin\t\t\t544 private-dev\t\t\t897 private-etc\t\t\t435 private-tmp\t\t\t785 whitelist home directory\t474 whitelist var\t\t699 (include whitelist-var-common.inc) whitelist run/user\t\t336 (include whitelist-runuser-common.inc\t\t\t\t\tor blacklist ${RUNUSER}) whitelist usr/share\t\t359 (include whitelist-usr-share-common.inc net none\t\t\t333 dbus-user none \t\t523 dbus-system none \t\t632### New profiles:spectacle, chromium-browser-privacy", "posttime": "2020-11-11 06:36:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,linux,沙盒,sandbox,firejar", "title": "Firejear-沙盒Linux应用程序", "title_en": "Firejail – Sandbox Linux Applications", "transed": 1, "url": "https://github.com/netblue30/firejail", "via": "", "real_tags": ["程序", "linux", "沙盒", "sandbox", "firejar"]}, {"category": "", "categoryclass": "", "imagename": "3e571706468544e8b7be72388946e163.jpg", "infoid": 1034416, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果公司告诉TechCrunch，苹果第一批基于自主开发的SoC的Mac电脑不支持电子图形处理器(EGPU)。目前还不清楚这种不兼容到底是从哪里开始的；M1芯片本身是否与eGPU不友好，或者是今天宣布的三款新Mac的其他方面？\n长期以来，消费者一直求助于这些外置显卡，以大幅提升电脑的内存密集型任务。EGPU让笔记本电脑或动力不足的台式机可以超重工作。特别值得一提的是，苹果过去的笔记本电脑以拥有可观的RAM和处理能力而闻名，但缺乏图形处理能力。同样，用户发现上一代的Mac Mini配备了额外的RAM和eGPU，其性能可以与Mac Pro匹敌，而价格只有Mac Pro的一小部分--这在刚刚发布的Mac电脑上是不可能的。\n今天，在M1的揭幕仪式上，该公司的发言人一再赞扬该芯片的集成GPU，但没有透露详细的技术规格。今天发布的M1版本配备了7或8个内核，苹果公司表示，与PC GPU相比，它的性能是GPU的两倍，而功耗是PC GPU的33%。如果这是真的--我们将在芯片基准测试后看到--M1在移动芯片上有很高的GPU性能，但它不能与专用外部显卡相比，这会让一些用户感到被遗弃。", "note_en": "Apple’s first Macs built around its self-developed SoC do not support eGPUs, Apple tells TechCrunch. It’s unclear exactly where the incompatibility begins; does the M1 chip itself not play friendly with eGPUs, or is it something else about the three new Macs announced today?\n Consumers have long turned to these external graphics cards to give computers a dramatic boost in memory-intensive tasks. eGPUs allow laptops or underpowered desktops to punch out of their weight class. In particular, Apple’s past laptops were known for having substantial RAM and processing power but lacking in graphical processing power. Likewise, users have found that a past-generation Mac Mini with extra RAM and an eGPU can match a Mac Pro’s performance for a fraction of the price — that’s not currently possible with the just-announced Macs.\n  Today during the M1’s unveiling, the company’s spokespersons repeatedly praised the chip’s integrated GPU though failed to reveal detailed technical specifications. The version of the M1 announced today features 7 or 8 cores, and Apple says it’s capable of twice the GPU performance while using 33% of the power compared to a PC GPU when matching performance. If true — and we’ll see after benchmarking the chip — the M1 has serious GPU performance in a mobile chip, but it will not compare to a dedicated external graphics card, and that will leave some users feeling abandoned.", "posttime": "2020-11-11 06:19:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "芯片,m1,mac", "title": "\n配备M1芯片的Mac不支持eGPU", "title_en": "\n\t\t\t\tMacs with the M1 chip do not support eGPUs\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/10/macs-with-the-m1-chip-do-not-support-egpus/", "via": "", "real_tags": ["芯片", "m1", "mac"]}, {"category": "", "categoryclass": "", "imagename": "fb54156cda37b7a70fde519d4750a4b5.jpg", "infoid": 1034415, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Ubuntu开发人员修复了一系列漏洞，这些漏洞使得标准用户很容易获得梦寐以求的超级用户权限。\nGitHub的研究员凯文·贝克豪斯(Kevin Backhouse)在周二发表的一篇文章中写道：“这篇博文是关于以一种惊人的直截了当的方式提升Ubuntu上的特权的。”标准用户只需在终端中使用几个简单的命令，然后点击几下鼠标，就可以为自己创建管理员帐户。\n第一系列命令触发了一个名为Accounting tsservice的守护程序中的拒绝服务错误，顾名思义，该守护程序用于管理计算机上的用户帐户。为此，Backhouse创建了一个符号链接，该符号链接将名为.pam_Environment的文件链接到/dev/ero，更改了区域语言设置，并向帐户服务发送了SIGSTOP。在几个额外命令的帮助下，巴克豪斯能够设置一个计时器，让他在账户服务崩溃之前有足够的时间注销账户。\n如果操作正确，Ubuntu将重新启动并打开一个窗口，允许用户创建一个新帐户--你猜对了--拥有超级用户权限。这是一段Backhouse攻击行动的视频。\nBackhouse表示，Ubuntu使用了修改后的Account Service版本，该版本包含上游版本中未包含的代码。额外的代码在主目录中查找.pam_Environment文件。通过将该文件设置为指向/dev/ero的符号链接，.pam_Environment会陷入无限循环。\n黑客攻击中涉及的第二个漏洞存在于GNOME显示管理器中，该管理器管理用户会话和登录屏幕。通常缩写为gdm3的显示管理器还会在检测到当前不存在用户时触发操作系统的初始设置。\n“gdm3如何检查系统上有多少用户？”贝克豪斯反问道。“你可能已经猜到了：通过询问账户-守护进程！那么，如果帐户守护程序没有响应，会发生什么呢？相关代码在这里。“。\n只有当有人拥有易受攻击的计算机的物理访问权限和有效帐户时，才会触发这些漏洞。它只能在桌面版本的Ubuntu上运行。开源操作系统的维护人员上周修补了这些漏洞。Backhouse说，他是偶然发现这些漏洞的，在上面链接的博客文章中有更多的技术细节。", "note_en": "Ubuntu developers have fixed a series of vulnerabilities that made it easy for standard users to gain coveted root privileges.\n “This blog post is about an astonishingly straightforward way to escalate privileges on Ubuntu,” Kevin Backhouse, a researcher at GitHub, wrote in a  post published on Tuesday. “With a few simple commands in the terminal, and a few mouse clicks, a standard user can create an administrator account for themselves.”\n The first series of commands triggered a denial-of-service bug in a daemon called accountsservice, which as its name suggests, is used to manage user accounts on the computer. To do this, Backhouse created a  Symlink that linked a file named .pam_environment to /dev/zero, changed the regional language setting, and sent accountsservice a  SIGSTOP. With the help of a few extra commands, Backhouse was able to set a timer that gave him just enough time to log out of the account before accountsservice crashed.\n When done correctly, Ubuntu would restart and open a window that allowed the user to create a new account that—you guessed it—had root privileges. Here’s a video of Backhouse’s attack in action.\n  Backhouse said that Ubuntu uses a modified version of accountsservice that contains code that’s not included in the upstream version. The extra code looks for the .pam_environment file in the home directory. By making the file a symlink to /dev/zero, .pam_environment gets stuck in an infinite loop.\n The second bug involved in the hack resided in the  GNOME display manager, which among other things manages user sessions and the login screen. The display manager, which is often abbreviated as gdm3, also triggers the initial setup of the OS when it detects no users currently exist.\n “How does gdm3 check how many users there are on the system?” Backhouse asked rhetorically. “You probably already guessed it: by asking accounts-daemon! So what happens if accounts-daemon is unresponsive? The relevant code is  here.”\n The vulnerabilities could be triggered only when someone had physical access to, and a valid account on, a vulnerable machine. It worked only on desktop versions of Ubuntu. Maintainers of the open source OS  patched the bugs last week. Backhouse, who said he found the vulnerabilities by accident, has many more technical details in the above-linked blog post.", "posttime": "2020-11-11 06:01:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ubuntu,fixes", "title": "Ubuntu修复了标准用户可以用来成为超级用户的错误", "title_en": "Ubuntu fixes bugs that standard users could use to become root", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/11/ubuntu-fixes-bugs-that-standard-users-could-use-to-become-root/", "via": "", "real_tags": ["ubuntu", "fixes"]}, {"category": "", "categoryclass": "", "imagename": "61657aa0efa48be87d4e7a82e6fe2d8c.jpeg", "infoid": 1034412, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果在过渡到苹果硅处理器的同时，对MacBook Air键盘做了一个小但值得注意的调整。MacBook Air键盘上的功能行现在有了请勿打扰、听写和聚光灯的专用按键。\n这三个新键取代了功能行中的Launchpad和键盘亮度控件。取而代之的是，你现在必须依靠MacOS Big Sur的新控制中心来调节键盘背光亮度。移除LaunchPad键不太可能影响很多用户，但键盘亮度的改变可能需要一些时间来适应。\n你会注意到MacBook Air键盘的另一个变化是，在左下角的功能键上有一个专用的表情包地球仪图标。\n当然，新的Apple Silicon MacBook Pro没有这些新的功能键，因为它包括一个触摸栏，而不是一个功能行。然而，新的MacBook Pro确实在功能键上添加了表情符号地球图标。\n新款MacBook Air采用苹果M1处理器，其设计与上一代采用英特尔(Intel)处理器的机型大体相同。它的起价为999美元，今天可以从苹果公司订购，第一批订单将于下周11月17日送达。\n你打算订购新的苹果硅谷MacBook Air吗？你觉得这个键盘设计的小调整怎么样？请在评论中让我们知道！\n新款MacBook Air更新了键盘功能键，增加了聚光灯、听写和免打扰功能键-取代了Launchpad和键盘亮度。Pic.twitter.com/1BM6wTWQZh。\n你正在阅读朝九晚五的Mac--日复一日发布苹果及其周边生态系统新闻的专家。请务必查看我们的主页以获取所有最新消息，并在Twitter、Facebook和LinkedIn上关注9to5Mac以保持最新消息。不知从何说起？查看我们的独家报道、评论、操作指南，并订阅我们的YouTube频道", "note_en": "Apple has made a small but notable tweak to the MacBook Air keyboard alongside its  transition to Apple Silicon processors. The function row on the MacBook Air keyboard now features dedicated keys for Do Not Disturb, Dictation, and Spotlight.\n  The three new keys replace Launchpad and keyboard brightness controls in the function row. Instead, you’ll now have to rely on the new Control Center in macOS Big Sur to adjust keyboard backlighting brightness. The removal of the Launchpad key is unlikely to affect many users, but the keyboard brightness change could take some getting used to.\n Another change you’ll notice on the MacBook Air keyboard is that there is a dedicated emoji globe icon on the function key in the bottom left.\n Of course, the new Apple Silicon MacBook Pro does not have these new function keys because it includes a Touch Bar instead of a function row. The new MacBook Pro does, however, add the emoji globe icon to the function key.\n The new MacBook Air is powered by Apple’s M1 processor and features largely the same design as the previous Intel-powered machine. It starts at $999 and is available to order from Apple today, with the first orders arriving next week on November 17.\n Are you planning to order the new Apple Silicon MacBook Air? What do you think of this small tweak to the keyboard design? Let us know down in the comments!\n The new MacBook Air has updated keyboard function keys, adding Spotlight, Dictation, and Do Not Disturb – replaces Launchpad and Keyboard brightness.  pic.twitter.com/1BM6wTWQZh\n  You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Mac on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2020-11-11 05:55:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "键盘,macbook-air,macbook,keyboard", "title": "新MacBook Air的键盘取代了Launchpad的按键和背光键盘的亮度，代之以免打扰、听写和聚光灯的专用按键", "title_en": "The new MacBook Air's keyboard replaces keys for Launchpad and brightness of backlit keyboard with dedicated keys for Do Not Disturb, Dictation, and Spotlight", "transed": 1, "url": "https://9to5mac.com/2020/11/10/macbook-air-function-row-keyboard/", "via": "", "real_tags": ["键盘", "macbook", "keyboard"]}, {"category": "", "categoryclass": "", "imagename": "5e68623c667904c0e3ca4940674d39b7.jpg", "infoid": 1034411, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "10月23日，距离美国总统大选还有11天，《纽约时报》的影评人之一马诺拉·达吉斯(Manohla Dargis)突然进入该公司Slack的#新闻编辑室反馈频道，提出了一个关乎存亡的问题。达吉斯在给2000多名同事的信中写道：“这是一个友好的问题。”“现在这个频道是什么？”\n在《纽约时报》发表了阿肯色州参议员汤姆·科顿(Tom Cotton)的一篇评论文章后，#新闻编辑室反馈频道于今年6月成立，文章主张部署军队平息因警察击毙乔治·弗洛伊德(George Floyd)而引发的全国性抗议活动引发的骚乱。该专栏很快遭到了猛烈抨击：因为事实错误，一个煽动性的标题--“派遣军队”--以及一种感觉，即时报不应该发表使用美国军队镇压美国公民的论据。对此，该报数十名员工在推特上异口同声地写道：“这样做会让纽约时报的Black@nyTimes员工处于危险之中。”\n这打破了Timesian的传统，即禁止员工向更广泛的世界表达他们对该报的愤怒。于是，工作人员转向Slake，首先瞄准了专栏(“这很像专栏的博尔索纳罗(Bolsonaro)主持这篇文章”)；然后是专栏编辑詹姆斯·贝内特(James Bennet)(“我们正踮着脚尖绕着房间里的大象走来走去，试图不去注意它刚刚倾倒的一大堆垃圾发出的臭味。”)。JB应该被撤换吗？“)；最终，在《纽约时报》本身。有色人种的员工感觉没人听过--“我们爱这个机构，尽管有时感觉它不爱我们”--尽管科技记者担心时报以公开考虑广泛意见的名义为专栏辩护，让该报看起来像是它的报道受到指责的公司：“听到一些相同的借口令人沮丧(我们只是一个思想的平台！)。我们的记者和专栏作家批评科技公司的首席执行官们做出了这样的举动。\n在Cotton专栏发表后的几周里，#新闻编辑室反馈就像是大流行时代的办公室饮水机。这是相当健康的--尽管这是一种明显不符合时代精神的处理异见的方式。《纽约时报》一直是员工在自助餐厅发牢骚的地方，抱怨可能会慢慢传到新闻编辑室顶部的编辑阴谋集团，在那里，任何决定都会悄悄下达。现在，该报执行主编迪恩·巴奎(Dean Baquet)进入了#新闻编辑室--反馈，回答的不仅是他的记者，还有该报的软件开发人员和数据科学家对《纽约时报》新闻报道的批评。\n谈话可能会变得紧张。员工们会将批评该报的推文粘贴到频道上；记者们会变得防御性；有人会将观点泄露给拥有Twitter账户的朋友；而自我批评的喧嚣又会占用该报的尾巴和每个人的时间。“伙计们，如果能改变讨论的语气，那就太棒了，”巴奎在一场争论中说。争论的焦点是，“观点”栏目的煽动者巴里·韦斯(Bari Weiss)对“纽约时报”内部“沃克斯(Wokes)派(主要是年轻人)和自由派(大多是40多岁)之间的内战”的描述是一种简化的争论、一种错误的描述--或者可能是一种带有些许真相的不受欢迎的评估。\n这场骚乱暴露了一个对时报来说越来越棘手的分歧：该报的很大一部分读者、许多员工，以及总统本人都认为它与#抵抗运动是一致的。这一划分令老卫士们感到恐惧，但它似乎有利于做好生意。“真相可以改变我们看待世界的方式，”纽约时报在去年奥斯卡颁奖典礼上播放的一则广告中宣称，将自己定位为一个错误信息时代的堡垒。\n在选举之夜，由于时报的民调似乎高估了民主党的反应，订阅者部分重演了2016年的痛苦，他们是否生活在泡沫中。四年的动乱和一个夏天的动荡，以及随后特朗普政府迫在眉睫的下台，让报纸内部的一些人对同样的事情产生了怀疑。在特朗普时代，一切可能失去的东西都一去不复返了吗？\n《纽约时报》与自我反省的关系时断时续。在早期的杰森·布莱尔(Jayson Blair)抄袭丑闻之后，它设立了一个公共编辑职位，回答读者的问题和批评，但在2017年放弃了这个职位，部分原因是Twitter可以做同样的工作。该报还设立了一个标准部门，负责确保每天在越来越多的媒体上发表的数百篇新闻文章保持适当的时效性。该部门现在有了自己的松弛频道，编辑和记者可以在报道中询问在新冠肺炎的粪便检测中使用大便这个词是否可以接受(判决：“最好避免”)，以及如何礼貌地描述娱乐节目。\n特朗普时代迫使人们匆忙进行反思。“当我们第一次描述特朗普在头版撒谎时，我是和迪恩讨论的一部分，”时报的14名头版编辑之一卡罗琳·瑞安(Carolyn Ryan)最近告诉我。“花了45分钟。”这起事件发生在2016年9月，当时特朗普宣布放弃自己的出生论，然后错误地指责希拉里·克林顿(Hillary Clinton)开启了阴谋论。瑞安在谈到这一决定时说：“这感觉有点奇怪。”“但在当时，这是一次令人震惊的离开。”\n2016年特朗普胜选后，《纽约时报》记者走进新闻编辑室，发现他们的同事在流泪，这也是一次令人震惊的离开。长期以来，中立的客观性一直是该报看待自身、其公共使命和商业利益的核心(传奇的时报人阿贝·罗森塔尔(Abe Rosenthal)在他的墓碑上刻着这样的话)，尽管《纽约时报》是由沿海自由派出版的，而且是为沿海自由派出版的，这是一个公开的秘密。2004年，该报的第一位公共编辑丹尼尔·奥克伦特(Daniel Okrent)在他的一篇专栏文章的第一句话中回答了他的一个专栏--“纽约时报是一份自由派报纸吗？”--的标题：“当然是。”\n在2016年大选后不久的一次全体员工会议上，巴奎告诉该报的员工，该报不能成为特朗普的“忠诚反对党”的一部分。时报会积极报道特朗普--该报拨出额外500万美元用于报道2017年的政府--但也是公平的，这样该报才能保持其“新闻武器”，正如该报的一位明星撰稿人对我所说的那样，这意味着有能力发表像特朗普的纳税申报单这样的东西，并让它们被视为不偏不倚的真相。“有些人读了之后很喜欢。理查德·尼克松在谈到《泰晤士报》时说：“有些人读了之后就不喜欢了。”“但每个人都会读这本书。”\n特朗普向新闻编辑部提出了一系列史无前例的问题。你有没有在头条上大骂他的种族主义？简而言之，报头的回答是：是的，尽管谨慎而有目的。\n但随着该报工作人员开始迎合日益两极分化的受众，该报保持独立中心的主张已经在下滑。记者们进退两难，一方面希望对右倾读者和消息来源表现出客观的态度--同时避免左倾读者的反弹--另一方面又希望自己能回到自己认为已经签约的工作岗位上。成为忠诚的反对党的大部分压力来自外部：皮尤(Pew)的一项民意调查发现，在认为时报是他们的主要新闻来源的人中，91%的人认为自己是民主党人，这与福克斯新闻频道(Fox News)的观众认为自己是共和党人的比例大致相同。2019年8月，该报在头版刊登了一篇题为《特朗普敦促团结对抗种族主义》(Trump Urges Unity vs种族主义)的文章。这篇文章在左翼人士中引起了足够的轩然大波，内容是代表总统洗牌，最终改成了“抨击仇恨但不抨击枪手”，总统本人也加入了这场争斗。“ ‘Trump敦促团结VS。他在推特上写道：“种族主义，‘是失败的”纽约时报“第一个标题的正确描述。”“假新闻--这就是我们要面对的。”\n但是，时间主义追求某种客观性的冲动忽略了一个事实，那就是从无处可见的视角实际上太多地来自上西区和新泽西州的蒙特克莱尔(Montclair)。“该报的白度有时是个问题，因为它让一群非白人像卡桑德拉一样到处跑--这就是2015年和2016年的感觉，”该报的自由批评者韦斯利·莫里斯(Wesley Morris)最近告诉我。他指出，该报最初不愿指责特朗普最肆无忌惮地表达威权主义和种族主义，这让很多有色人种员工感到困惑。莫里斯说：“看着这一意识在四年内发生变化真的很有趣。”\n正如一位黑人员工对我说的那样，当《棉花》专栏在6月份出版时，《纽约时报》已经是一个“火药桶”了。每个人都被困在里面三个月了，黑色生命也是抗议活动现在正在全国范围内滚动。《白人的脆弱》和《如何成为反种族主义者》登上了《纽约时报》畅销书排行榜的榜首。500多名时报员工报名参加了被组织者之一称为“勇敢空间”(Brave Space)的活动--这是对“安全空间”(Safe Space)一词的重新演绎--由Black@NYT员工资源小组设立，目的是在对许多人来说压力极大的时候谈论公平、友情和自我照顾。\n科顿的专栏点燃了一根火柴。两天后，在一家公司的市政厅里，当贝内特含泪回答问题时，员工们再次在Slack上表达了他们对公司似乎没有采取行动纠正这种情况的失望之情。贝内特于2016年加入时报，明确授权扩大社论版的声音，超越该报大多数专栏作家所认同的中左翼共识。《观点》栏目遭遇了许多争议，新闻编辑部对另一套似乎是另一套标准感到沮丧。电磁脉冲\n谈话变成了不止一名时报员工对我所说的“食物之争”。在见面会期间，《观点》专栏作家伊丽莎白·布鲁尼格上传了约翰·罗尔斯关于公共理性的论文的PDF文档，试图提升讨论的层次。布鲁尼格写道：“我们正在进行的是一场真正的哲学对话，它关系到自由主义的未竟事业。”“我认为，所有人都是天生的哲学家，也就是说，我们都有一种与生俱来的愿望，想要了解我们的世界意味着什么，我们对彼此有什么亏欠，以及如何过上美好的生活。”\n《泰晤士报》的一位研究人员写道，他的Slack头像是汉堡连锁店Jack in the Box的标识。他说：“我们正处在我们历史上的一个关卡时刻。你来决定：你站在哪一边？“。\n到了周一早上，贝内特已经出局了。对于那些认为这篇评论文章是一系列混乱中的一个的人来说，贝内特的下台来得太久了。对于那些认为他努力提出偶尔有争议的观点以供公众考虑是时报使命的核心的人来说，这一决定是对原则的一种倒退。“我称之为他妈的耻辱，”前公共编辑丹尼尔·奥克伦特(Daniel Okrent)说。“我认为詹姆斯被解雇对人们对该报的看法和杰森·布莱尔一样有意义。”\n在接下来的几周里，一位《观点》杂志的员工告诉我，《纽约时报》好像没有人完成任何工作。有焦点小组-38个，而且还在增加-还有工作组和无数关于报纸应该是什么，看起来是什么样子，以及它是为谁而写的讨论。正如一位黑人员工对我说的那样，报头开始举行“黑人会议”，报头成员与有色人种员工一对一地交谈，找出为什么他们觉得时报是一个不受欢迎的地方。在#新闻编辑室反馈中，有很多天有几个人在打字。\n制度变革的齿轮正在缓慢转动，就像以前一样。长期以来，《纽约时报》一直是一种相对单一的文化：毕业于常春藤盟校的白人为他们的同龄人写作。一些人将这种泡沫归咎于2016年该报对特朗普的解雇--并不是说其他主流媒体做得更好。从那时起，随着业务在特朗普时代蓬勃发展，新闻编辑部掀起了招聘狂潮，尤其注重于努力实现队伍多元化：自2016年以来，新闻编辑部40%的员工都是有色人种。\n几名黑人员工告诉我，时报是他们工作过的最多元化的新闻编辑部，但简单地雇佣更多年轻的黑人记者并不是万灵丹。“管道有问题，”一位黑人员工告诉我。一位记者说，新闻编辑部的一个笑话是，报头把多样性和包容性融入了报纸较温和的版面--“Styles”、“Arts&Amp；休闲”、“纽约时报杂志”(New York Times Magazine)--这样“他们就可以在华盛顿雇佣任何他们想要的白人”。该报较高级别的职位没有那么多样化；它似乎存在结构性问题，限制了黑人员工的晋升。新建立的绩效评估流程给每一位纽约时报员工打出了六分中的一分；最低的是没有达到预期的员工，其余五分按升序排列，从“部分达到预期”到“大大超出预期”。纽约时报编辑工会成员进行的一项研究发现，2019年，黑人和西班牙裔员工获得了前一次评分的33%，尽管只占员工总数的16%，但获得的最高评分还不到5%。\n我在时报采访的每个人都认为这个地方需要多元化：更多的黑人记者，更多的福音派基督徒，更多的古巴移民，更多的“在牧场长大的人，他们不是尼克·克里斯托夫(Nick Kristof)，”其中一人说。今年夏天震惊全国的种族正义清算给这项努力带来了新的紧迫性。经理们被要求参加无意识偏见培训。正如一位工作人员所说，“时代杂志”委托进行了一项关于署名和主题的多样性研究，“以量化每个人已经知道的内容”。《泰晤士报》在6月19日给员工放假，这标志着美国奴隶的解放。这些努力看起来是真诚的，但每个人都知道，真正的变革之路将是漫长的。当一位报头编辑在一次市政厅会议上解释说，该报的多样性研究由常春藤规划集团(Ivy Planning Group)领导时，员工们只能叹息。常春藤规划集团是一家咨询公司，以其三名创始人都曾就读常春藤盟校的事实命名。\n事实上，这份报纸确实拥有越来越多的人，他们带着一套不同的价值观来到这份报纸。他们更年轻，这就产生了一些部门。一位自称“年轻的X世代”的记者警告我要提防“有毒的千禧一代职场价值观”，而另一位千禧一代则抱怨这位报头与社交媒体的关系过于曲折，认为“婴儿潮一代是一种思维定势”。\n但在新闻编辑部，最有意义的分歧似乎是性情。一位认同后者的记者告诉我：“纽约时报的根本分歧是制度主义者与起义者。”(就这篇报道与我交谈的数十名时报员工几乎都要求匿名；其中一人告诉我，“你可以称我为‘觉醒的千禧一代记者’或其他什么。”)。制度主义者愿意玩登上报头所需的内部权力游戏，因为他们从来不想在其他地方工作。与此同时，叛乱分子往往来自数字媒体、科技公司或倡导团体，他们可以想象随时离开这个地方。(新闻编辑部注意到，时报编辑部门最具资本主义色彩的《连线》杂志(Wirecutter)的一些员工似乎是《松弛》杂志上最具社会主义者的人。)。“我热爱我的工作。我和我的同事一样 。但从12岁起，为《纽约时报》工作并不是我的目标。“这位《觉醒的千禧一代记者》告诉我。“我不会因为这个地方有多棒而被蒙蔽了双眼，所以我不会忽视这些问题。”\n许多起义者来自《纽约时报》传统上不会招聘的地方，比如新的数字媒体公司和从事宣传性新闻的媒体，其中一个挑战是让这些员工融入《纽约时报》的运营方式。“按照时报的标准，时报有一代人是被狼养大的，”一位机构主义者告诉我。这些新员工的加入是为了帮助公司推进新闻运营现代化的努力，但时报并不完全理解在大楼里拥有一名新一代的记者意味着什么。“我们打算让新闻编辑部多元化，但没有说，‘下一步不是要采取这些新声音必须带来的东西吗？’”巴奎今年夏天在长篇播客上说。“我们开始从BuzzFeed招聘；我们开始从其他地方招聘，几乎就像我们想的那样，好吧，现在他们会变得和我们一样。”\n在《纽约时报》被推动变革的所有战线中，最强烈的反叛能量来自与编辑部相邻的大批从事数字工作的员工，而这些工作在十年前还不存在。过去负责发行《泰晤士报》的员工--排字工人、报社记者和送货司机--从未被鼓励公开谈论该报新闻报道的核心伦理问题。但是，向世界传递《纽约时报》新闻的应用程序开发人员和软件工程师在常春藤盟校的研讨会上举手的次数与他们的编辑同行一样多。他们可能太害羞了，不敢走到报头编辑面前，抱怨一个笨拙的标题，但#新闻编辑室的反馈已经为批评打开了一扇数字大门。记者们发现，突然间，批评他们工作的是时报的程序员和开发人员，而不是他们的编辑。在市政厅讨论Cotton专栏时，一位数据工程师在Slack上说，“科技行业能容忍多少这样的流程失败？”\n许多技术专家来自Facebook、优步(Uber)或亚马逊(Amazon)，出于使命感加入了时报，离开了科技行业的伦理困境，去了他们认为更有道德的地方。“我加入公司只有一个原因，那就是我觉得有责任成为我所信奉的使命的一部分，”一位曾在苹果工作的产品经理在#Cotton专栏之后的#新闻编辑部反馈中写道。“这给人的感觉就像是从我们手中拔出了地毯--不仅是因为发表这篇文章的决定严重损害了我们的使命，更是因为我们正在开发的产品就是用来做这件事的。”\n“这就像做电线杆一样，”一位软件工程师补充道，“结果发现电线杆被用作撞击锤。”\n新闻编辑部的每个人都意识到，他们受惠于技术专家，他们似乎不理解时报新闻报道中的杂乱无章的人性，但他们确实掌握着时报商业未来的关键。卡罗琳·瑞安告诉我：“我们正在与谷歌和Facebook争夺人才，我们要为这些聪明、有才华的人提供的是我们的使命。”“现在，我们正处在一个转折点上，我们说过‘来参与这项使命’的人们也想举起手来。”\n.", "note_en": "On October 23, eleven days before the presidential election, Manohla Dargis, one of the movie critics at the New York  Times, popped in to the #newsroom-feedback channel on the company’s Slack to pose an existential query. “Friendly question,” Dargis wrote to more than 2,000 of her colleagues. “What is this channel now?”\n  The #newsroom-feedback channel had been created in June, after the  Times  published an op-ed by Senator Tom Cotton of Arkansas arguing for the  deployment of the military to quell unrest stemming from nationwide protests in response to the police killing of George Floyd. The column was quickly lambasted: for factual errors, an inflammatory headline — “Send in the Troops” — and a feeling that the  Times should not be in the business of publishing arguments for the use of American troops to crack down on American citizens.  In response, dozens of the paper’s employees took to Twitter, writing in unison, “Running this puts Black @nytimes staffers in danger.”\n  This was a break from  Timesian tradition, which prohibited employees from expressing their anger at the paper to the broader world. So the staff turned to Slack, taking aim first at the column (“It’s very Bolsonaro of Op-Ed to run this”); then at the op-ed section’s editor, James Bennet (“We’re tiptoeing around the elephant in the room, trying not to notice the stink of the huge pile of crap it’s just dumped. Should JB be replaced?”); and, eventually, at the  Times itself. Employees of color felt unheard — “We love this institution, even though sometimes it feels like it doesn’t love us back” — while tech reporters worried the  Times’ defense of the column, in the name of an open consideration of a wide range of opinion, was making the paper  look like the companies its reporting was taking to task: “It is frustrating to hear some of the same excuses (we’re just a platform for ideas!) that our journalists and columnists have criticized tech CEOs for making.”\n  In the weeks after the Cotton op-ed, #newsroom-feedback served as a heated pandemic-era office watercooler. This was healthy enough — albeit a distinctly un- Timesian way of handling dissent. The  Times had always been a place where employees grumbled in the cafeteria, and complaints might slowly wind their way to the editorial cabal atop the newsroom known as “the masthead,” at which point any decisions would be handed down quietly. Now, Dean Baquet, the paper’s executive editor, was in #newsroom-feedback, answering critiques about the  Times’ journalism from not only his reporters but also the paper’s software developers and data scientists.\n  The conversations could become tense. Employees would paste tweets criticizing the paper into the channel; the journalists would get defensive; someone would leak the argument to friends with Twitter accounts; and the ouroboros of self-criticism would take another bite out of its tail and everyone’s time. “Gang, it would be great to shift the tone of this discussion,” Baquet jumped in to say during a fight about whether  “Opinion”-section provocateur Bari Weiss’s description of a “civil war inside The New York  Times between the (mostly young) wokes [and] the (mostly 40+) liberals” was a reductive argument, a mischaracterization — or perhaps an unwelcome assessment with a modicum of truth.\n  The dustup laid bare a divide that had become increasingly tricky for the  Times: a large portion of the paper’s audience, a number of its employees, and the president himself saw it as aligned with the #resistance. This demarcation horrified the Old Guard, but it seemed to make for good business. “The truth can change how we see the world,” the  Times declared in an advertisement broadcast at last year’s Academy Awards, positioning itself as a bulwark in an era of misinformation.\n  On Election Night, as the  Times’ polling appeared to have overestimated Democratic response, subscribers experienced a partial repeat of 2016’s anguish about whether they were living in a bubble. Four years of upheaval and a summer of unrest, followed by the looming end of the Trump administration, had some inside the paper wondering the same thing. Was whatever might have been lost in the course of the Trump era gone for good — and good riddance?\n    The  Times has a fitful relationship to self-examination. After the Jayson Blair plagiarism scandal of the early aughts, it created a public-editor position to answer questions and critiques from readers, only to discard it in 2017, partly with the idea that Twitter could do the same job. The paper also created a standards department responsible for making sure the hundreds of pieces of journalism it publishes every day, in an increasing range of mediums, remain appropriately  Timesian. The department now has its own Slack channel, where editors and reporters can ask whether it’s acceptable to use the word  poop in a story about feces being tested for COVID-19 (verdict: “Best to avoid”) and how to decorously describe a recent Zoom incident at  The New Yorker (“Less is more in display type”).\n  The Trump era forced a rushed period of reflection. “I was part of the discussion with Dean when we first described Trump as lying on the front page,” Carolyn Ryan, one of 14 masthead editors at the  Times, told me recently. “It took 45 minutes.” The incident happened in September 2016, when Trump renounced his own birtherism, then falsely accused Hillary Clinton of starting the conspiracy theory. “It feels kind of quaint,” Ryan said of the decision. “But at the time, it was a shattering departure.”\n  It was also a shattering departure for  Times journalists to walk into the newsroom after Trump’s 2016 victory and find their colleagues in tears. A neutral objectivity had long been core to the way the paper saw itself, its public mission, and its business interests (Abe Rosenthal, a legendary  Timesman, had the words HE KEPT THE PAPER STRAIGHT carved on his tombstone), even if it was an open secret that the  Times was published by and for coastal liberals. In 2004, the paper’s first public editor, Daniel Okrent, answered the headline above one of his columns — “Is the New York Times a Liberal Newspaper?” — in the first sentence of his story: “Of course it is.”\n    At an all-staff meeting shortly after the 2016 election, Baquet told the paper’s staff that it could not become part of the “loyal opposition” to Trump. The  Times would report on Trump aggressively — the paper earmarked an extra $5 million to cover the administration in 2017 — but fairly, so that the paper could maintain its “journalistic weapon,” as one of its star writers put it to me, meaning the ability to publish something like Trump’s tax returns and have them be viewed as unbiased truth. “Some read it and like it. Some read it and don’t like it,” Richard Nixon said of the  Times. “But  everybody reads it.”\n  Trump presented the newsroom with a series of unprecedented questions. Do you call out his racism in a headline? The masthead’s answer was, in short: Yes, albeit sparingly and with purpose.\n  But the paper’s claim to holding the independent center was already slipping, as the staff came to grips with an increasingly polarized audience. Journalists were caught between the desire to appear objective to right-leaning readers and sources — while avoiding backlash from left-leaning ones — and wishing they could get back to the job they thought they had signed up for. Most of the pressure to serve as the loyal opposition was coming from the outside: A Pew poll found that 91 percent of people who consider the  Times their primary news source identify as Democrats, roughly the same as the percentage of Fox News viewers who identify as Republicans. In August 2019, the paper ran a front-page headline — “Trump Urges Unity vs. Racism” — that caused enough uproar on the left about reputation laundering on the president’s behalf that it was eventually changed to “Assailing Hate But Not Guns,” at which point the president himself joined the fray. “ ‘Trump Urges Unity Vs. Racism,’ was the correct description in the first headline by the Failing New York Times,” he tweeted. “Fake News - That’s what we’re up against.”\n  But the  Timesian impulse toward some kind of objectivity ignored the fact that the view from nowhere was actually too often a view from the Upper West Side and Montclair, New Jersey. “The whiteness of the paper has sometimes been a problem because it makes a bunch of nonwhite people run around like Cassandras — that’s what 2015 and 2016 felt like,” Wesley Morris, the paper’s critic-at-large, told me recently, noting that many employees of color were perplexed by the paper’s initial reluctance to call out Trump for his most brazen expressions of authoritarianism and racism. “Watching that awareness change in four years has been really interesting,” said Morris.\n    When the Cotton op-ed was published in June, the  Times was already “a tinderbox,” as one Black employee said to me. Everyone had been stuck inside for three months, and Black Lives Matter protests were now rolling across the country.  White Fragility and  How to Be an Antiracist were surging toward the top of the  Times’ best-seller list. More than 500  Times employees signed up for what one of the organizers called “Brave Space” events — a recasting of the phrase “safe space” — set up by the Black@NYT employee-resource group to talk about equity, allyship, and self-care in an incredibly stressful time for many.\n  Cotton’s column lit a match. During a company town hall two days later, while Bennet got teary answering questions, employees took to Slack again to express their frustration at the company’s seeming lack of action to rectify the situation. Bennet had joined the  Times in 2016 with an explicit mandate to expand the voices in the op-ed pages beyond the center-left consensus in which most of its columnists fit. The “Opinion” section had suffered a number of controversies, and the newsroom had become frustrated with what seemed to be an alternate set of standards. Employees were galled to find out that Bennet had not read the column before it was published — while a Black photo editor had done so and objected to no avail. A development editor connected Cotton’s op-ed with a profile of Adolf Hitler from 1922, while an employee in brand marketing asked why  Alison Roman, the food writer who had recently been suspended for disparaging comments she made about Chrissy Teigen and Marie Kondo, was seemingly being treated more severely than Bennet.\n    The conversation turned into what more than one  Times employee described to me as a “food fight.” During the mêlée, “Opinion” columnist Elizabeth Bruenig uploaded a PDF of John Rawls’s treatise on public reason, in an attempt to elevate the discussion. “What we’re having is really a philosophical conversation, and it concerns the unfinished business of liberalism,” Bruenig wrote. “I think that all human beings are born philosophers, that is, that we all have an innate desire to understand what our world means and what we owe to one another and how to live good lives.”\n  “Philosophy schmosiphy,” wrote a researcher at the  Times whose Slack avatar was the logo for the hamburger chain Jack in the Box. “We’re at a barricades moment in our history. You decide: which side are you on?”\n  By Monday morning,  Bennet was out. To those who saw the op-ed as one in a series of screwups, Bennet’s ouster was a long time coming. To those who believed his effort to present occasionally controversial views for public consideration was core to the  Times’ mission, the decision was a retreat from principle. “I call it a fucking disgrace,” said Daniel Okrent, the former public editor. “I think that James’s firing was as meaningful for how the paper is perceived as Jayson Blair was.”\n    In the weeks that followed, one “Opinion” staffer told me it felt like no one at the  Times got any work done at all. There were focus groups — 38 of them and counting — and working groups and innumerable conversations about what the paper should be and look like and who it was for. The masthead started holding “Black-people meetings,” as one Black employee put it to me, in which members of the masthead talked one-on-one with employees of color to sort out why they felt the  Times was an unwelcoming place. In #newsroom-feedback, there were many days in which several people were typing.\n  The gears of institutional change were slowly churning, as they had before. The  Times had long been a relative monoculture: Ivy League–educated white people writing for their cohort. Some blamed this bubble on the paper’s dismissal of Trump in 2016 — not that any other mainstream media outlets had done any better. Since then, as business boomed in the Trump era, it had gone on a newsroom hiring spree, with a particular focus on trying to diversify its ranks: 40 percent of newsroom employees hired since 2016 have been people of color.\n  Several Black employees told me that the  Times was the most diverse newsroom they had ever worked in, but simply hiring more young Black reporters wasn’t a cure-all. “There’s a pipeline problem,” one Black staffer told me. The newsroom joke, one reporter said, was that the masthead farmed diversity and inclusion to the softer sections of the paper — “Styles,” “Arts &amp; Leisure,”  The New York Times  Magazine — so that “they could hire any white guy they wanted in D.C.” The paper’s more senior ranks were less diverse; it seemed to have structural problems that were limiting the promotion of Black employees. A newly instituted performance-review process gives every  Times employee one of six ratings; the lowest is reserved for employees who don’t meet expectations, with the other five in ascending order, from “Partially Meets Expectations” to “Substantially Surpasses Expectations.” A study conducted by members of the  Times’ editorial union found that in 2019 Black and Hispanic employees received 33 percent of the former rating, despite making up only 16 percent of the staff, while receiving less than 5 percent of the highest rating.\n  Everyone I spoke to at the  Times thought the place needed to diversify: more Black journalists, more Evangelical Christians, more Cuban émigrés, more “people who grew up on ranches who aren’t Nick Kristof,” as one put it. The racial-justice reckoning that shook the nation this summer brought a new urgency to the effort. Managers were required to attend unconscious-bias training. The  Times Magazine commissioned a diversity study of bylines and subject matter “to quantify what everyone already knows,” as one staffer put it. The  Times gave employees the day off on Juneteenth, which marks the emancipation of America’s slaves. The efforts felt sincere, but everyone knew the road to real change would be long. All employees could do was sigh when one masthead editor explained, in a town-hall meeting, that the paper’s diversity study was being led by Ivy Planning Group, a consulting firm named for the fact that its three founders all went to Ivy League schools.\n  What the paper did have — in increasing numbers in fact — was a growing cohort of people who came to the paper with a different set of values. They were younger, which produced some of the division. A reporter who identified as “young Gen X” warned me about “toxic millennial workplace values,” while a millennial complained about the masthead’s tortured relationship to social media by arguing that “boomer is a mind-set.”\n  But the most meaningful divide in the newsroom seemed to be by temperament. “The fundamental schism at the  Times is institutionalist versus insurrectionist,” a reporter  who identified with the latter group told me. (Almost all of the dozens of  Times employees I spoke to for this story requested varying degrees of anonymity; one told me, “You can refer to me as a ‘woke millennial reporter’ or whatever.”) The institutionalists were willing to play the internal  Game of Thrones required to ascend the masthead because they never wanted to work anywhere else. The insurrectionists, meanwhile, had often come from digital outlets or tech companies or advocacy groups and could imagine leaving the place at any time. (The newsroom noticed that some employees of “Wirecutter,” the most capitalist arm of the  Times’ editorial operation, appeared to be the most socialist on Slack.) “I love my job. I  like my co-workers. But it has not been my goal since I was 12 to work for the New York  Times,” the “woke millennial reporter” told me. “I’m not so blinded by how great the place is that I’m going to ignore the problems.”\n  Many of the insurrectionists were coming from places the  Times didn’t traditionally recruit from, like new digital-media companies and outlets that practiced advocacy journalism, and part of the challenge had become integrating those employees into the  Timesian way of operating. “There’s a generation at the  Times that’s kind of been raised by wolves, by  Times standards,” one institutionalist told me. The new recruits were brought in to help supercharge the company’s efforts at modernizing its news operation, but the  Times hadn’t fully understand what it would mean to have a new breed of journalist inside the building. “We set out to diversify the newsroom, but didn’t say, ‘Isn’t the next step to take what these new voices have to bring?’” Baquet said on the  Longform podcast this summer. “We started hiring from BuzzFeed; we started hiring from other places, and it was almost like we thought,  Okay, now they’re just going to become just like us.”\n  Of all the fronts on which the  Times was being pushed to change, the strongest insurrectionary energy was coming from legions of newsroom-adjacent employees in digital jobs that didn’t exist a decade ago. The employees responsible for distributing the  Times in the past — typesetters, pressmen, delivery drivers — had never been encouraged to speak up about the ethical questions at the heart of the paper’s journalism. But the app developers and software engineers who deliver the  Times’ journalism to the world have held their hands up in just as many Ivy League seminars as their editorial peers. They might be too shy to march over to a masthead editor and complain about a clumsy headline, but #newsroom-feedback had opened a digital door to criticism. Reporters found that suddenly it was the  Times’ programmers and developers, rather than their editors, who were critiquing their work. During the town hall about the Cotton op-ed, one data engineer said on Slack, “How many such process failures would be tolerated in tech?”\n  Many of the techsurrectionists had come from Facebook or Uber or Amazon to join the  Times out of a sense of mission, leaving the ethical quandaries of the tech industry for what they thought were more virtuous pastures. “I joined the company for one reason, and it’s because I feel a responsibility to be a part of a mission that I believe in,” a product manager who previously worked at Apple wrote in #newsroom-feedback after the Cotton op-ed. “This feels like the rug’s been pulled out from under us — not just because it feels like that mission [has] been severely compromised by the decision to publish this piece, but even more so because the products we’re building were used to do it.”\n  “It’s like making telephone poles,” one software engineer added, “and finding out they’re being used as battering rams.”\n  Everyone in the newsroom recognized that they were beholden to the techsurrectionists, who didn’t seem to understand the messy humanness that went into the  Times’ journalism, but did hold the keys to its business future. “We are competing for talent with the Googles and Facebooks, and what we have to offer these smart, talented people is our mission,” Carolyn Ryan told me. “Now, we’re at this inflection point where people to whom we have said ‘Come be part of this mission’ also want to raise their hand w\n......", "posttime": "2020-11-11 05:50:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "变迁,times,员工", "title": "时代变迁：《纽约时报》内部激烈的自我清算", "title_en": "Times Change: Inside the New York Times’ Heated Reckoning With Itself", "transed": 1, "url": "https://nymag.com/intelligencer/2020/11/inside-the-new-york-times-heated-reckoning-with-itself.html", "via": "", "real_tags": ["变迁", "times", "员工"]}, {"category": "", "categoryclass": "", "imagename": "c3c9efae39d7ebcf5fe1d3f84f835c39.jpg", "infoid": 1034410, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇文章介绍了Morello在内存模型工具中的实现。读者应该对该工具有一些了解，该工具已在前面的文章中介绍：如何使用herd7 Memory Model工具以及如何使用diy7工具自动生成石蕊测试的工作示例。\nMorello是ARM开发的基于功能硬件增强型RISC指令(CHERI)的安全架构。更多信息可以在ARM Morello计划中找到。\n扩展内存模型工具以包括Morello指令集增加了工具的覆盖范围。在Morello评估板及其上运行的代码的原型制作过程中，这对硬件开发人员和软件开发人员都有好处。在Memory Model Tool中实现Morello有几个方面令人感兴趣，即添加：\n在我们开始讨论Morello之前，让我们先简要介绍一下ARM内存标记扩展(MTE)，因为它在本文后面会很有用。MTE实现对内存的锁定和密钥访问。更多信息可在ARMv8-A安全功能中找到。\nMTE作为内存模型工具的一部分已经有一段时间了(与https://github.com/herd/herdtools7/commit/6378f2fb0ce9a489d76544dd07bfcb32116d6e76).一起引入。\nMTE和Morello都有称为“标签”的对象。在MTE和Morello中，标签的目标都是作为附加在其余数据上的标签。因此，该工具中MTE和Morello标记的实现有一些相似之处。因此，我们在这里简要描述MTE变体的工作方式，以支持Morello变体的呈现。\n在内存模型工具中，MTE标签可以采用的不同值用颜色表示：“绿色”、“红色”、“蓝色”、“…。它们可以用“LDG”指令读取，用“STG”指令写入。\n&gt；diyone7-ARCH AArch64-Variant Memtag PodWWTT RFE PodRRTT Fre-name MP-MTE\rAArch64 MP-MTE\r\r{\r\r0：x0=x：红色；0：x1=x：绿色；0：x2=y：红色；0：x3=y：绿色；\r\r1：x1=y：红色；1：x3=x：绿色；\r\r}\r\rP0|P1；\r\rSTG X0，[X1]|MOV X0，X1；\r\rSTG X2，[X3]|LDG X0，[X1]；\r\r|MOV X2、X3；\r\r|LDG X2，[X3]；\r\r存在(1：x0=y：红色/\\1：x2=x：绿色)\n请注意，使用了新的“memtag”变体和新的“T”注释来生成在MTE标记(而不是数据)上操作的MTE指令。\n&gt；herd7-Variant memtag MP-MTE.litmus\r\r测试MP-允许的MTE\r\r州4\r\r1：x0=y：绿色；1：x2=x：绿色；\r\r1：x0=y：绿色；1：x2=x：红色；\r\r1：x0=y：红色；1：x2=x：绿色；\r\r1：x0=y：red；1：x2=x：red；\r\r好的\r\r证人\r\r阳性：1阴性：3\r\r存在条件(1：x0=y：红色/\\1：x2=x：绿色)\r\r观测MP-MTE有时为1 3\r\rTime MP-MTE 0.03\r\r散列=8955f3049e5ad93e9d858b99d7d6ef22。\nMorello有两个指令集：A64和C64。这两者之间的区别在于对某些指令中的操作数的解释。以加载指令为例：\n在A64中，“LDR X0，[X1]”检查系统寄存器中是否允许加载。\n在C64中，“LDR X0，[C1]”检查“C1”能力寄存器中是否允许加载。\n在没有扩展的ARMv8中，地址和数值是无法区分的。选择将寄存器视为保存地址还是数值取决于程序员的意图。\n但在Memory Model工具中情况并非如此，在Memory Model工具中，内存位置与数值不同：内存位置用字符串表示。这使得在内存中读取或写入的内容以及它们发生的位置之间有了明确的区别。那么，诸如“wx=1”这样的符号显然意味着值1被写入内存位置“x”，而“rx=1”意味着相同的内存位置是用值1读取的。换句话说，该工具在符号内存位置上工作，而不是在字节内存位置上工作。\n在处理混合内存访问大小(例如，对同一内存位置的32位和64位访问)时，能够仅引用内存位置的一部分非常重要。根据Litmus测试，该工具确定“最小访问大小”，并将和内存位置划分为该大小的子块。可以将偏移量添加到基本存储器位置以访问其他子块。如果混合大小的石蕊测试包含W和X大小的内存访问，那么一个64位的“x”位置将被分成两个32位的子块：“x”和“x+4”。\n但是不可能通过添加任何数量的偏移量来从另一个符号存储器位置“x”引用符号存储器位置“y”。这是对该工具的设计选择，我们将在本文的其余部分提到这一点。这使我们能够解释在实现Morello变体时所做的某些选择，以及在处理数值和地址的方式上的区别。\nMorello引入了一种新的数据类型，即功能。此数据类型保存在容量寄存器中，寄存器为129位宽。这些寄存器由以下字段组成：\n对象类型，确定有效功能是密封(对象类型≠0)还是解封(对象类型=0)。\n标记，确定功能是否有效(标记=1)或无效(标记=0)。\n标志和能力界限的低位与能力值共享编码。\n下面的图表显示了功能中的字段组织，摘自ARM架构参考手册附录-Morello，A.F版，第58页：\n能力寄存器存储在能力标记存储器中，其中每16字节位置存在一个能力标记位置。\n在启用Morello变量的情况下使用内存模型工具时，这必须反映在内存模型工具中：\nHerd7的内存表示需要考虑到这个额外的功能标签位置。\n这是通过添加包含CAPABILITY标签的内存子区块来实现的，类似于对MTE标签所做的操作。一个显著的区别在于，访问特定存储器位置的MTE标签独立于保存在该位置中的值。但莫雷洛的情况并非如此。对于Morello来说，这种额外的内存子区块的处理方式更接近于混合大小变量，因为它们在内存中被一起访问。\n出于性能原因以及实现的简单性，在编写本文时，在工具中使用Morello变量会触发混合变量的使用。对于用户来说，这意味着读取执行图表可能会显示出比Litmus测试所建议的更小的“最小访问大小”(如3.1个内存位置中所述)。\nMorello架构确保某些检查保护每次内存访问。这些检查检查是否允许访问。如果检查失败，则会生成同步数据中止，具体故障取决于原因。实现的错误有能力标签错误、能力密封错误和能力许可错误。由于目前无法在内存模型工具中表示边界，因此未实现功能边界错误。\n为了不出错，存储器访问需要使用有效且未密封的功能，该功能具有执行相关类型的访问(加载或存储)所需的权限。\nMorello引入的其他类型的故障不会在工具中实现。这些故障是：\nMorello指令集扩展了“经典”内存指令(str、ldr、swp、cas、…)。使用功能寄存器，创建128位对齐访问。请注意，功能寄存器是129位宽，但虚拟地址是128位对齐的。\n它还添加了两条专门操作功能标签的新指令：STCT(存储功能标签)和LDCT(加载功能标签)。它们与内存有独特的交互作用，因此对该工具特别感兴趣。也正是由于这个原因，他们在DIY工具中获得了自己的注释(稍后将详细介绍)。理论上，指令STCT和LDCT在存储器中的4个连续能力位置上操作。但是，该工具不能引用内存位置“x”中的内存位置“y”(参见3.1中的内存位置)。因此，这些指令只在指定位置运行。这一限制将转化为变量是512位对齐的实际系统。\n在幕后，DIY工具使用不同的“库”来管理它创建的周期中写入和读取的值。存储体对于每个存储位置都是唯一的。当没有指定变量时，只使用一个银行：“ORD”。\n当发生写入时，该工具将内存位置的存储体加1，并根据期望值生成周期的最终状态。在上面的例子中，读取“y”发生在值为1的y写入之后，因此读取y的期望值为1。读取“x”发生在写入x之前，因此读取x的期望值为0。\n该工具的memtag变体添加了第二个库：“tag”，独立于Ord库存储MTE标记值。读取和写入标签库是通过使用DIY工具的“T”注释来完成的。\n本着同样的精神，Morello变体引入了新的银行来处理不同的功能字段，“CapaTag”用于功能标记，“CapaSeal”用于对象类型。\n在这里，您可以看到，写入同一内存位置的不同存储体(这里后跟“Wy.seal”)会将所有写入的值保存在内存中，而从其中一个存储体(标记为“Ry.Seal”)读取只会检索指定存储体的值：\n与MTE标签库不同的是，能力库与ORD一起作为一个值的元组。原因在于，为了不丢失信息，将能力标签或对象类型写入寄存器需要与其余存储体相关联。这可能会在石蕊测试中产生更多的说明。\n&gt；diyone7拱AArch64变种Morello PodWW Cs PosWW RFE Cs PodRR Fre\r\rAArch64 A\r\r{\r\rUint128_t y；uint128_t x；\r\r\r\r0：x1=0xffffc0000：x：1；0：x2=0xffffc0000：y：1；\r\r1：x1=0xffffc0000：Y：1；1：x3=0xffffc0000：x：1；\r\r}\r\rP0|P1；\r\rMOV X0，#1|LDR C0，[C1]；\r\r字符串X0，[C1]|GCTYPE X0，C0；\r\rMOV X3，#0|LDR X2，[C3]；\r\rMOV X4，#1|；\r\rSCVALUE C3、C2、X3|；\r\r密封C3、C3、C4|；\r\r字符串C3，[C2]|；\r\rMOV X5，#1|；\r\r字符串X5，[C2]|；\r\r存在(1：x0=1/\\1：x2=0)。\n使用“-Variant Morello”时，保存非存储位置的值的功能寄存器表示为：\n其中C是表示能力的比特127：0的整数，T是标签(比特128)。当“T”为0时，只显示“C”。\n标签与其他字段分开，以便在使用专注于标签的循环时简化阅读。例如，值为2的标记功能表示为“0x2：1”，而不是更经典的“0x1000000000000000000000000000002”。\n请注意，使用“-HEXA TRUE”可以更容易理解地读取功能寄存器的权限和对象类型字段，这可能很有用。例如，所有权限和值为3的标记功能表示为：\n“340281068846723829756467474807685906435：1”，带“-HEXA FALSE”(或无六进制标志，因为FALSE是缺省值)。\n内存位置表示工具中的符号：“x”、“y”、…。(参见3.1：内存位置)。存储位置的容量的位&lt；91：0和gt；合并为代表该位置的字母。这就是该工具使用以下表示形式的原因：\n“C”是一个整数，表示容量的位127：92。这些位是：\n当“C”和“T”都为0时，只显示“m”。\n在上例中，“0xffffc0000：x：1”表示具有完全权限的标记和解封能力，包含内存位置“x”。\n请注意，在本例中，“C”始终表示为十六进制值，忽略“-HEXA”标志。\n石蕊测试的初始化部分包含每个处理元件的寄存器的初始状态。输入格式与前面描述的输出格式匹配。\n例如，使用DIY工具获得带有“-Variant Morello”的消息传递循环会带来以下试金石：\n&gt；diyone7拱AArch64变种Morello PodWW RFE PodRR Fre\r\rAArch64 MP\r\r{\r\rUint128_t y；uint128_t x；\r\r\r\r0：x1=0xffffc0000：x：1；0：x3=0xffffc0000：y：1；\r\r1：x1=0xffffc0000：Y：1；1：x3=0xffffc0000：x：1；\r\r}\r\rP0|P1；\r\rMOV X0，#1|LDR X0，[C1]；\r\r字符串X0，[C1]|LDR X2，[C3]；\r\rMOV X2，#1|；\r\r字符串X2，[C3]|；\r\r存在(1：x0=1/\\1：x2=0)。\n与之前的MP-MTE石蕊测试相比，此周期不包含额外的注释。与消息通过石蕊测试的无变化版本相比，存储器访问没有变化。使用“-Variant Morello”只是对地址进行了初始化，以便它们在Morello环境中执行时不会出错。\n观察同一程序中混合Morello和非Morello指令的行为可能很有趣。经典的“P”、“L”、“A”和“Q”批注正在接收可选的修饰符来反映这一点。它们可以以小写的“c”作为后缀，以生成指定访问的Morello变体。\n&gt；diyone7拱AArch64变种Morello PodRW L RFE A PodRW L RFE A\r\rAArch64 A\r\r{\r\rUint128_t y；uint128_t x；\r\r\r\r0：x1=0xffffc0000：x：1；0：x3=0xffffc0000：y：1；\r\r1：x1=0xffffc0000：Y：1；1：x3=0xffffc0000：x：1；\r\r}\r\rP0|P1；\r\r激光雷达X0，[C1]|激光雷达X0，[C1]；\r\rMOV X2，#1|MOV X2，#1；\r\rSTLR X2，[C3]|STLR X2，[C3]；\r\r存在(0：x0=1/\\1：x0=1)\r\r\r\r&gt；Diyone7拱AArch64变种Morello PodRW L RFE ac PodRW LC RFE A\r\rAArch64 A\r\r{\r\rUint128_t y；uint128_t x；\r\r\r\r0：x1=0xffffc0000：x：1；0：x3=0xffffc0000：y：1；\r\r1：x1=0xffffc0000：Y：1；1：x3=0xffffc0000：x：1；\r\r}\r\rP0|P1；\r\r激光雷达X0，[C1]|激光雷达C0，[C1]；\r\rMOV X2，#1|GCVALUE X0，C0；\r\rSTLR X2，[C3]|MOV X2，#1；\r\r|STLR C2，[C3]；\r\r存在(0：x0=1/\\1：x0=1)。\n请注意，在第二个示例中使用了P1中的功能寄存器，并将“GCVALUE”添加到加载中以从功能中提取功能值字段。\n还有一些新的注释作用于功能的特定字段：“ct”和“cs”。这些注释是第3.5段中提出的银行概念的用户端：介绍新银行。它们分别对应于“CapaTag”和“CapaSeal”银行。“CT”以修改标签的存储器访问为特征。“Cs”表示修改ObjectType的内存访问。请注意，因为功能标签要么是0，要么是1，所以每个内存位置只能执行一次“CT”写入。\n&gt；diyone7拱AArch64-Variant Morello PodWWCtCt RFE PodRRCtCt Fre\r\rAArch64 A\r\r{\r\rUint128_t y；uint128_t x；\r\r\r\r0：x1=0xffffc0000：x：1；0：x3=0xffffc0000：y：1；\r\r1：x1=0xffffc0000：Y：1；1：x3=0xffffc0000：x：1；\r\r}\r\rP0|P1；\r\rMOV X0，#1|LDCT X0，[C1]；\r\rSTCT X0，[C1]|LDCT X2，[C3]；\r\rMOV X2，#1|；\r\rSTCT X2，[C3]|；\r\r存在(1：x0=1/\\1：x2=0)。\n当没有选择变量时，DIY工具会创建内存位置(或地址)和值是两个完全独立的实体的循环。包含内存位置的寄存器用表示该位置的字符串(“x”，“y”，...)初始化一次；它们的内容在Litmus测试执行期间不会改变。另一方面，值是每次写入相同内存位置时递增的数字。\nMorello以检查每次内存访问的形式提供内存保护。如果这些检查失败，则会导致功能故障(参见3.3功能内存保护)。我们在工具中处理此行为。\n但是，创建根据执行顺序显示故障可能性的DIY周期需要摆脱值和内存位置的分离。\n当没有选择变量时，DIY工具使用“异或”操作创建依赖项。这样，地址不会改变，但寄存器值确实取决于前一次加载。\nMorello变体构建在地址依赖之上，以引入可能发生故障的场景。当与新的“Ct”或“Cs”批注一起使用时，DpAddr的依赖项仍然存在，但形式不同。在这种情况下，用于第二次存储器访问的能力的内容仍然取决于在第一次访问期间读取的值。然而，周期中读取的值与期望值之间的差值用于填充地址的指定能力字段：指定“DpAddr(s|d)(R|W)Ct”时的标记，指定“DpAddr(s|d)(R|W)Cs”时的对象类型。在工具中可以通过以下方式观察到这一点：\nAArch64 A\r\r&#34；DpAddrdWPC RfeCsP PodRW RFE&#34；\r\r生成器=diyone7(版本7.56+02~dev)\r\r预取=0：X=F、0：Y=W、1：Y=F、1：X=W\r\rCOM=射频射频\r\rORIG=DpAddrdWPCS RfeCsP PodRW RFE\r\r{\r\rUint128_t y；uint128_t x；\r\r\r\r0：x1=0xffffc0000：x：1；0：x3=0xffffc0000：y：1；\r\r1：x1=0xffffc0000：Y：1；1：x3=0xffffc0000：x：1；\r\r}\r\rP0|P1；\r\rLDR X0，[X1]|LDR X0，[X1]；\r\rSubs X4，X0，#1|MOV X2，#1；\r\r和X4、X4、#4095|STR X2、[X3]；\r\rSCVALUE C4、C3、X4|；\r\rCSEAL C4、C3、C4|；\r\rMOV X5，#0|；\r\rMOV X6，#1|；\r\rSCVALUE C5、C3、X5|；\r\r密封C5、C5、C6|；\r\r字符串C5，[X4]|；\r\r存在(0：x0=1/\\1：x0=0)/\\~故障(P0，y)\n例如，由于与普通写入相比，需要考虑的字段要多得多，因此创建该功能需要几条指令。\nAArch64 A\r\r{\r\rUint128_t y；uint128_t x；\r\r\r\r0：x1=0xffffc0000：x：1；0：x3=0xffffc0000：y：1；\r\r1：x1=0xffffc0000：Y：1；1：x3=0xffffc0000：x：1；\r\r}\r\rP0|P1；\r\rLDR X0，[C1]|LDR C0，[C1]；\r\rSubs X4，X0，#1|GCTYPE X0，C0；\r\r和X4、X4、#4095|MOV X2、#1；\r\rSCVALUE C4，C3，X4|STR X2，[C3]；\r\rCSEAL C4、C3、C4|；\r\rMOV X5，#0|；\r\rMOV X6，#1|；\r\rSCVALUE C5、C3、X5|；\r\r密封C5、C5、C6|；\r\r字符串C5，[C4]|；\r\r存在(0：x0=1/\\1：x0=1)/\\~故障(P0，y)", "note_en": "This post presents the implementation of Morello in the Memory Model Tool. The reader is expected to have some understanding of the tool, which is documented in previous posts:  A working example of how to use the herd7 Memory Model Tool and  How to generate litmus tests automatically with the diy7 tool.\n  Morello is a security architecture developed by Arm, based on Capability Hardware Enhanced RISC Instructions (CHERI). More information can be found in the  Arm Morello program.\n   Extending the Memory Model Tools to include the Morello instruction set increases the coverage of the tools. This benefits hardware developers and software developers during the prototyping of Morello evaluation boards and the code that runs on them. There are several aspects that are of interest in the implementation of Morello in the Memory Model Tool, namely the addition of:\n   Before we dive into Morello, let us have a brief introduction about the Arm Memory Tagging Extension (MTE), since it is useful later in this post. MTE implements lock and key access to memory. More information can be found in the  Armv8-A security features.\n MTE has been part of the Memory Model Tools for some time now (introduced with  https://github.com/herd/herdtools7/commit/6378f2fb0ce9a489d76544dd07bfcb32116d6e76).\n Both MTE and Morello have objects called “tags”. In both MTE and Morello, the goal of tags is to act as labels attached to the rest of the data . As a consequence, the implementation of the MTE and Morello tags in the tool have some similarities. Therefore we briefly describe the way the MTE variant works here, to support the presentation of the Morello variant.\n In the Memory Model Tool, the different values the MTE tag can take are represented as colors: “green”, “red”, “blue”, … They can be read with the “LDG” instruction, and written with the “STG” instruction.\n  &gt; diyone7 -arch AArch64 -variant memtag PodWWTT Rfe PodRRTT Fre -name MP-MTE\rAArch64 MP-MTE\r\r{\r\r0:X0=x:red; 0:X1=x:green; 0:X2=y:red; 0:X3=y:green;\r\r1:X1=y:red; 1:X3=x:green;\r\r}\r\r P0 | P1 ;\r\r STG X0,[X1] | MOV X0,X1 ;\r\r STG X2,[X3] | LDG X0,[X1] ;\r\r | MOV X2,X3 ;\r\r | LDG X2,[X3] ;\r\rexists (1:X0=y:red /\\ 1:X2=x:green)\n Note the use of the new “memtag” variant and the new “T” annotation to generate MTE instructions operating on the MTE tags instead of the data.\n  &gt; herd7 -variant memtag MP-MTE.litmus\r\rTest MP-MTE Allowed\r\rStates 4\r\r1:X0=y:green; 1:X2=x:green;\r\r1:X0=y:green; 1:X2=x:red;\r\r1:X0=y:red; 1:X2=x:green;\r\r1:X0=y:red; 1:X2=x:red;\r\rOk\r\rWitnesses\r\rPositive: 1 Negative: 3\r\rCondition exists (1:X0=y:red /\\ 1:X2=x:green)\r\rObservation MP-MTE Sometimes 1 3\r\rTime MP-MTE 0.03\r\rHash=8955f3049e5ad93e9d858b99d7d6ef22\n  Morello has two instruction sets: A64 and C64. The difference between the two is the interpretation of the operands in some instructions. Take the example of a load instruction:\n In A64, “LDR X0,[X1]” checks whether the load is permitted in a System register\n In C64, “LDR X0,[C1 ]” checks whether the load is permitted in the “C1” capability register.\n   In Armv8 without extensions, an address and a numeric value are indistinguishable. The choice to see a register as holding an address or a numeric value depends on the programmer’s intent.\n That is not the case in the Memory Model Tool, where memory locations are distinguished from numeric values: memory locations are represented as strings. This allows for a clear distinction between  what is read or written  in memory and  where that happens. Notations such as “Wx=1” then clearly means that the value 1 is written to memory location “x”, and “Rx=1” that the same memory location was read with value 1. In other words, the tool works on symbolic rather than byte memory locations.\n When dealing with mixed memory access sizes (for example, 32-bit and 64-bit accesses to the same memory location), it is important to be able to refer to only part of a memory location . Depending on the litmus test, the tool identifies a “smallest access size”, and divides and memory locations into sublocations of that size. An offset can be added to the base memory location to access the other sublocations. If a mixed-size litmus test containing W and X sized memory accesses, what would have been a single 64-bit “x” location gets divided in two 32-bit sublocations: “x” and “x+4”.\n But it is impossible to reference a symbolic memory location “y” from another symbolic memory location “x” by adding any amount of offset. This is a design choice of the tool, which we refer to in the remainder of this post. This allows us to explain certain choices made in the implementation of the Morello variant, as well as distinctions in the way numeric values and addresses are handled .\n  Morello introduces a new data type, the capability. This data type is held in Capability registers, which are 129-bit wide. Those registers are composed of the following fields:\n ObjectType, determines whether a valid capability is sealed (ObjectType  ≠  0) or unsealed (ObjectType = 0)\n  Tag, determines whether a capability is valid (Tag = 1) or not (Tag = 0)\n The Flags  and the lower bits of the Capability Bounds share encoding with the Capability Value.\n Here is a graph showing the organization of the fields in a capability, from the  Arm Architecture Reference Manual Supplement - Morello, version A.f, page 58:\n The capability registers are stored in a capability-tagged memory, where a capability tag location exists for every 16 byte locations.\n This has to be reflected in the Memory Model Tool when using it with the Morello variant enabled:\n   herd7’s representation of memory needs to account for this additional capability tag location.\n This is implemented by adding a memory sublocation containing the capability tag, similarly to what has been done for the MTE tag. A significant difference being that the MTE tag of a particular memory location is accessed independently from the value held in this location. That is not the case for Morello. For Morello, this additional memory sublocation is treated in a way that is closer to the mixed-size variant, in that they are accessed together in memory .\n For performance reasons, as well as simplicity of implementation, at the time of writing using the Morello variant in the tool triggers the use of the mixed variant. For the user, it means that reading graphs of the execution can potentially show a “smallest access size” (as described in 3.1  Memory locations ) smaller than what the litmus test would suggest.\n  The Morello architecture ensures that certain checks guard every memory access. Those checks check whether the access is permitted or not. If a check fails, a synchronous Data Abort is generated, with a specific fault depending on what caused it. The implemented faults are the  capability tag fault, the  capability sealed fault and the  capability permission fault. The  capability bounds fault is not implemented because bounds cannot be represented in the Memory Model Tool at the moment.\n In order not to fault, memory accesses need to use a valid and unsealed capability that has the necessary permissions to perform the relevant type of access (load or store).\n The other types of faults introduced by Morello are not implemented in the tool. Those faults are:\n   The Morello instruction set expands the “classic” memory instructions (STR, LDR, SWP, CAS, …) to use capability registers, creating 128-bit aligned accesses. Note that capability registers are 129-bit wide, but that virtual addresses are 128-bit aligned.\n It also adds two new instructions that operate specifically on capability tags: STCT (store capability tags) and LDCT (load capability tags). They have a unique interaction with memory and are therefore  of special interest for the tool. It is also for that reason that they get their own annotation in the diy tool (more later). The instructions STCT and LDCT theoretically operate on 4 consecutive capability locations in memory. However the tool cannot reference a memory location “y” from a memory location “x” (see 3.1  Memory locations ). Therefore those instructions only operate on the specified location . This limitation would translate to a real system where variables are 512-bit aligned.\n  Behind the scene, the diy tool uses different “banks” to manage the values written and read in the cycles it creates. Banks are unique to each memory location. There is only one bank used when no variant is specified: “Ord”.\n The tool increments the bank of a memory location by  1 when a write occurs, and the final state of the cycle is generated from the expected values. In the example above, the read of “y” happens after the write of y with value 1, so the expected value of the read of y is 1. The read of “x” happens before the write of x with value, so the expected value of the read of x is 0.\n The memtag variant of the tool added a second bank: “Tag”, storing the value of the MTE tag independently from the Ord bank. Reading and writing from and to the Tag bank is done by using the “T” annotation with the diy tool.\n In the same spirit, the Morello variant introduces new banks to handle the different fields of capabilities, “CapaTag” for the capability tag and “CapaSeal” for the object type.\n Here you can see that writing to different banks of a same memory location (here with “Wy.seal” followed by “Wy”) keeps all the written values in memory, and that reading from one of the banks (noted as “Ry.Seal”) only retrieves the value of the specified bank:\n Unlike the MTE Tag bank, the capability banks act, along with Ord, as a tuple of values. The reason being that writing a capability tag or an object type to a register needs to be associated with the rest of the banks in order not to lose information. That can result in many more instructions in litmus tests.\n  &gt; diyone7 -arch AArch64 -variant morello PodWW Cs PosWW Rfe Cs PodRR Fre\r\rAArch64 A\r\r{\r\ruint128_t y; uint128_t x;\r\r \r\r0:X1=0xffffc0000:x:1; 0:X2=0xffffc0000:y:1;\r\r1:X1=0xffffc0000:y:1; 1:X3=0xffffc0000:x:1;\r\r}\r\r P0 | P1 ;\r\r MOV X0,#1 | LDR C0,[C1] ;\r\r STR X0,[C1] | GCTYPE X0,C0 ;\r\r MOV X3,#0 | LDR X2,[C3] ;\r\r MOV X4,#1 | ;\r\r SCVALUE C3,C2,X3 | ;\r\r SEAL C3,C3,C4 | ;\r\r STR C3,[C2] | ;\r\r MOV X5,#1 | ;\r\r STR X5,[C2] | ;\r\rexists (1:X0=1 /\\ 1:X2=0)\n      When using “-variant morello”, capability registers holding values that are not memory locations are represented as:\n  Where C is an integer representing bits &lt;127:0&gt; of the capability and T is the tag (bit &lt;128&gt;). When “T” is 0, only “C” is displayed.\n The tag is separated from the rest of the fields to simplify the reading when using cycles focused on tags. For example, a tagged capability with value 2 is represented as “0x2:1” instead of a more classical “0x100000000000000000000000000000002”.\n  Note that it might be useful to use “-hexa true” to get a more intelligible reading of the permission and object type fields of capability registers. For example, a tagged capability with all permissions and value 3 is represented as:\n “340281068846723829756467474807685906435:1” with “-hexa false” (or no hexa flag, since false is the default value)\n  Memory locations represents a symbol in the tool: “x”, “y”, … (see 3.1  Memory locations ). Bits &lt;91:0&gt; of capabilities holding a memory location are amalgamated as the letter representing this location. This is why the tool uses the following representation:\n   “C” is an integer representing bits &lt;127:92&gt; of the capability. Those bits are:\n When both “C” and “T” are 0, only “m” is displayed.\n In the previous example, “0xffffc0000:x:1” denotes a tagged and unsealed capability with full permissions, containing the memory location “x”.\n Note that in this case “C” is always represented as a hexadecimal value, ignoring the “-hexa” flag.\n  The initialization section of the litmus tests contains the initial state of the registers for each processing element. The input format matches the output format previously described.\n For example, using the diy tool to get a message-passing cycle with “-variant morello” gives the following litmus:\n &gt; diyone7 -arch AArch64 -variant morello PodWW Rfe PodRR Fre\r\rAArch64 MP\r\r{\r\ruint128_t y; uint128_t x;\r\r \r\r0:X1=0xffffc0000:x:1; 0:X3=0xffffc0000:y:1;\r\r1:X1=0xffffc0000:y:1; 1:X3=0xffffc0000:x:1;\r\r}\r\r P0 | P1 ;\r\r MOV X0,#1 | LDR X0,[C1] ;\r\r STR X0,[C1] | LDR X2,[C3] ;\r\r MOV X2,#1 | ;\r\r STR X2,[C3] | ;\r\rexists (1:X0=1 /\\ 1:X2=0)\n Compared to the previous MP-MTE litmus test, this cycle does not contain additional annotations. The memory accesses are unchanged compared to the no-variant version of the message passing litmus test. Using “-variant morello” merely initializes the addresses so that they do not fault when executed in a Morello environment.\n  It may be interesting to observe the behavior of mixed Morello and non-Morello instructions in the same program. Classic “P”, “L”, “A” and “Q” annotations are receiving optional modifiers to reflect this. They can be suffixed with a lower-cased “c” to generate a Morello variation of the specified access.\n      &gt; diyone7 -arch AArch64 -variant morello PodRW L Rfe A PodRW L Rfe A\r\rAArch64 A\r\r{\r\ruint128_t y; uint128_t x;\r\r \r\r0:X1=0xffffc0000:x:1; 0:X3=0xffffc0000:y:1;\r\r1:X1=0xffffc0000:y:1; 1:X3=0xffffc0000:x:1;\r\r}\r\r P0 | P1 ;\r\r LDAR X0,[C1] | LDAR X0,[C1] ;\r\r MOV X2,#1 | MOV X2,#1 ;\r\r STLR X2,[C3] | STLR X2,[C3] ;\r\rexists (0:X0=1 /\\ 1:X0=1)\r\r \r\r&gt; diyone7 -arch AArch64 -variant morello PodRW L Rfe Ac PodRW Lc Rfe A\r\rAArch64 A\r\r{\r\ruint128_t y; uint128_t x;\r\r \r\r0:X1=0xffffc0000:x:1; 0:X3=0xffffc0000:y:1;\r\r1:X1=0xffffc0000:y:1; 1:X3=0xffffc0000:x:1;\r\r}\r\r P0 | P1 ;\r\r LDAR X0,[C1] | LDAR C0,[C1] ;\r\r MOV X2,#1 | GCVALUE X0,C0 ;\r\r STLR X2,[C3] | MOV X2,#1 ;\r\r | STLR C2,[C3] ;\r\rexists (0:X0=1 /\\ 1:X0=1)\n Notice the use of capability registers in P1 in the second example, and that “GCVALUE” is added to the load to extract the Capability Value field from the capability.\n There are also new annotations that act on specific fields of a capability: “Ct” and “Cs”. Those annotations are the user-side of the banks concept developed in paragraph 3.5:  Introducing new Banks . They correspond respectively to the “CapaTag” and “CapaSeal” banks. “Ct” to feature memory accesses modifying the Tag. “Cs” to feature memory accesses modifying the ObjectType. Note that because a capability tag is either 0 or 1, a “Ct” write can only be performed once per memory location.\n &gt; diyone7 -arch AArch64 -variant morello PodWWCtCt Rfe PodRRCtCt Fre\r\rAArch64 A\r\r{\r\ruint128_t y; uint128_t x;\r\r \r\r0:X1=0xffffc0000:x:1; 0:X3=0xffffc0000:y:1;\r\r1:X1=0xffffc0000:y:1; 1:X3=0xffffc0000:x:1;\r\r}\r\r P0 | P1 ;\r\r MOV X0,#1 | LDCT X0,[C1] ;\r\r STCT X0,[C1] | LDCT X2,[C3] ;\r\r MOV X2,#1 | ;\r\r STCT X2,[C3] | ;\r\rexists (1:X0=1 /\\ 1:X2=0)\n  When no variant is selected, the diy tool creates cycles where the memory locations (or addresses) and the values are two completely separate entities. The registers containing memory locations are initialized once with the string representing that location (“x”, “y”, ...); their content does not change during the execution of the litmus test. On the other hand, values are numbers that are incremented for each write to the same memory location.\n Morello offers a memory protection in the form of checks on every memory access. If those checks fail, this results in a capability fault (see 3.3  Capability memory protection ). We handle this behavior in the tool .\n But creating diy cycles that display a possibility of fault depending on the execution order requires to move away from the separation of values and memory locations.\n When no variant is selected, the diy tool creates a dependency using an “exclusive or” operation. That way the address is unchanged, but the register value does depend on the previous load.\n   The Morello variant builds on the address dependency to introduce scenarios where a fault can happen. When used with one of the new “Ct” or “Cs” annotations, the dependency of DpAddr still exists but under a different form. In this context, the content of the capability used for the second memory access still depends on the value read during the first access . However, the difference between the value read and the expected value in the cycle is used to fill the specified capability field of the address: the tag when specifying “DpAddr(s|d)(R|W)Ct”, the object type when specifying “DpAddr(s|d)(R|W)Cs”.   This can be observed in the tool with:\n   AArch64 A\r\r&#34;DpAddrdWPCs RfeCsP PodRW Rfe&#34;\r\rGenerator=diyone7 (version 7.56+02~dev)\r\rPrefetch=0:x=F,0:y=W,1:y=F,1:x=W\r\rCom=Rf Rf\r\rOrig=DpAddrdWPCs RfeCsP PodRW Rfe\r\r{\r\ruint128_t y; uint128_t x;\r\r \r\r0:X1=0xffffc0000:x:1; 0:X3=0xffffc0000:y:1;\r\r1:X1=0xffffc0000:y:1; 1:X3=0xffffc0000:x:1;\r\r}\r\r P0 | P1 ;\r\r LDR X0,[X1] | LDR X0,[X1] ;\r\r SUBS X4,X0,#1 | MOV X2,#1 ;\r\r AND X4,X4,#4095 | STR X2,[X3] ;\r\r SCVALUE C4,C3,X4 | ;\r\r CSEAL C4,C3,C4 | ;\r\r MOV X5,#0 | ;\r\r MOV X6,#1 | ;\r\r SCVALUE C5,C3,X5 | ;\r\r SEAL C5,C5,C6 | ;\r\r STR C5,[X4] | ;\r\rexists (0:X0=1 /\\ 1:X0=0) /\\ ~fault(P0,y)\n Because there are many more fields to consider as compared to, for example, a plain write, the creation of the capability requires several instructions.\n    AArch64 A\r\r{\r\ruint128_t y; uint128_t x;\r\r \r\r0:X1=0xffffc0000:x:1; 0:X3=0xffffc0000:y:1;\r\r1:X1=0xffffc0000:y:1; 1:X3=0xffffc0000:x:1;\r\r}\r\r P0 | P1 ;\r\r LDR X0,[C1] | LDR C0,[C1] ;\r\r SUBS X4,X0,#1 | GCTYPE X0,C0 ;\r\r AND X4,X4,#4095 | MOV X2,#1 ;\r\r SCVALUE C4,C3,X4 | STR X2,[C3] ;\r\r CSEAL C4,C3,C4 | ;\r\r MOV X5,#0 | ;\r\r MOV X6,#1 | ;\r\r SCVALUE C5,C3,X5 | ;\r\r SEAL C5,C5,C6 | ;\r\r STR C5,[C4] | ;\r\rexists (0:X0=1 /\\ 1:X0=1) /\\ ~fault(P0,y)", "posttime": "2020-11-11 05:50:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "内存,memory,morello", "title": "ARM内存模型工具：Morello(和一些内存标记)", "title_en": "ARM Memory Model Tool: Morello (and Some Memory Tagging)", "transed": 1, "url": "https://community.arm.com/developer/ip-products/processors/b/processors-ip-blog/posts/memory-model-tool-morello-and-some-memory-tagging", "via": "", "real_tags": ["内存", "memory", "morello"]}, {"category": "", "categoryclass": "", "imagename": "db0682856a67e4811931dc34a3166e2e.jpeg", "infoid": 1034409, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Taara项目正在与Econet Group及其子公司合作，从肯尼亚开始在其网络中铺设无线光纤通信链路。\n互联互通比以往任何时候都更加重要。这场流行病引发了我们工作、学习以及与家人和朋友保持联系的方式的戏剧性转变，并突显了快速且负担得起的互联网对我们的日常生活有多么重要。研究表明，有意义的互联互通对于经济增长和快速获取机遇至关重要，但全球仍有近40亿人没有联网。与此同时，更多的人仍然负担不起连接速度足够快的视频通话，更不用说上学或远程工作了。\n在Taara项目(前身为FSOC项目)中，我们认为弥合数字鸿沟的关键是找到新的方法来提供负担得起的高速互联网连接。Taara正在开发无线光通信技术，利用光束提供远距离的高速、大容量连接。在过去的几年里，我们一直在与世界各地的合作伙伴合作，更多地了解Taara的技术如何被用来帮助扩展和增强现有的光纤网络，并将宽带的好处带给尚未接入宽带的社区。\n今天，我很高兴地告诉大家，Project Taara现在正在与Econet及其子公司Liquid Telecom和Econet Group合作，将负担得起的高速互联网扩展和增强到撒哈拉以南非洲地区的各个社区。Taara的连接将首先在Liquid Telecom在肯尼亚的网络中铺设，并将有助于在铺设光缆具有挑战性的地方，或在部署光纤可能过于昂贵或危险的地方提供高速连接-例如在河流上、跨越国家公园或在冲突后地区。这是Taara的技术首次在非洲推出，去年在肯尼亚进行了一系列试点。\n与传统光纤使用光通过地下电缆传输数据的方式相同，Taara使用光作为非常窄的不可见光束以非常高的速度传输信息。该波束在两个小Taara终端之间发送以创建链路。一条Taara链接可以覆盖20公里的距离，传输带宽高达20Gbps+-这足以让成千上万的人同时观看YouTube。\n通过创建从我们合作伙伴的地面光纤网络到服务不足地区的一系列链路，Taara的链路可以为人们提供高速、高质量的互联网，而不需要花费时间、成本，也不会遇到沿着电线杆挖掘战壕或架设电缆的麻烦。重要的是，塔拉终端之间的信号不会中断，所以塔拉的设备被高高地放置在塔楼、电线杆或屋顶上。Taara Link提供了一种经济高效且可快速部署的方式，将高速互联网接入带到偏远地区，并帮助填补主要接入点(如手机发射塔和WiFi热点)的关键缺口。\n我们期待着支持Econet Group为其网络中的客户带来网络的教育、商业和通信方面的好处。我们还邀请有兴趣在其网络中部署Taara的其他互联网服务提供商和移动网络运营商与我们联系。", "note_en": "Project Taara is working with Econet Group and its subsidiaries to roll out wireless optical communication links across their network starting in Kenya\n Connectivity is more important than ever. The pandemic sparked a dramatic shift in how we work, learn, and stay in touch with family and friends, and underscored just how important fast and affordable internet is to our daily lives. Studies show that  meaningful connectivity is essential for  economic growth and to fast track access to opportunity, yet almost  4 billion people around the world remain unconnected. Meanwhile, many more people still can’t afford a connection that is fast enough to join a video call, let alone attend school or work remotely.\n At  Project Taara, formerly known  as The FSOC Project, we believe that the key to bridging the digital divide is to find new ways to deliver affordable high-speed internet connectivity. Taara is developing wireless optical communication technology that delivers high-speed, high-capacity connectivity over long distances using beams of light. Over the last few years we’ve been  working with partners around the world to learn more about how Taara’s technology can be used to help expand and augment existing fiber networks and bring the benefits of broadband to communities that don’t yet have access to it.\n  Today I’m pleased to share that Project Taara is now working with Econet and its subsidiaries,  Liquid Telecom and Econet Group, to expand and enhance affordable, high-speed internet to communities across their networks in Sub-Saharan Africa. Taara’s links will begin rolling out across Liquid Telecom’s networks in Kenya first, and will help provide high speed connectivity in places where it’s challenging to lay fiber cables, or where deploying fiber might be too costly or dangerous — for example over rivers, across national parks, or in post-conflict zones. This is the first roll-out of Taara’s technology in Africa and follows a series of pilots in Kenya last year.\n  In the same way traditional fiber uses light to carry data through cables in the ground, Taara uses light to transmit information at very high speeds as a very narrow, invisible beam. This beam is sent between two small Taara terminals to create a link. A single Taara link can cover distances up to 20 km and can transmit bandwidth of up to 20 Gbps+ — that’s enough connectivity for thousands of people to be watching YouTube at the same time.\n  By creating a series of links from our partner’s fiber optic network over ground to underserved areas, Taara’s links can relay high speed, high quality internet to people without the time, cost, and hassle involved in digging trenches or stringing cables along poles. It’s important that the signal between Taara’s terminals isn’t interrupted, so Taara’s units are placed high up on towers, poles or rooftops. Taara links offer a cost-effective and quickly deployable way to bring high-speed internet access to remote areas and help plug critical gaps to major access points, like cell towers and WiFi hotspots.\n We look forward to supporting Econet Group as they bring the educational, business, and communication benefits of the web to customers in their networks. We also invite other internet service providers and mobile network operators who are interested in deploying Taara across their network to  get in touch.", "posttime": "2020-11-11 05:49:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "非洲,带来,light,taara", "title": "为撒哈拉以南非洲地区带来光速互联网", "title_en": "Bringing light-speed internet to Sub-Saharan Africa", "transed": 1, "url": "https://blog.x.company/bringing-light-speed-internet-to-sub-saharan-africa-4e022e1154ca", "via": "", "real_tags": ["非洲", "带来", "light", "taara"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1034408, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "应美国贸易代表办公室(USTR)的要求，RIAA和MPA提交了他们对“恶名市场”名单的年度建议。\n这些意见书确定了线上和线下盗版中心，以帮助指导美国政府在版权执法方面对外国的立场。\n传统上，版权持有者会向美国贸易代表办公室报告典型的盗版网站。今年的情况没有什么不同，海盗湾、YTS、RARBG、1337x、爆米花时间、Leakthis、RapidGator和Anonfile都在显著位置。\n音乐行业还列出了各种YouTube下载网站，而该电影集团则强调了非法的IPTV服务。然而，今年的建议不仅仅是网站，RIAA和MPA还特别提到了各种第三方中介机构，包括域名注册机构。\n在其最新提交的文件中，MPA指出，这些域名公司处于关键地位，因为它们可以帮助关闭明显有问题的盗版网站。\nMPA写道：“注册机构直接或通过与注册商的合同关系，有能力撤回或禁用从事大规模侵犯版权行为的网站使用的域名。”\n虽然一些注册商和注册商确实在版权所有者投诉后将网站下线，但并不是所有的注册商和注册商都这样做。例如，MPA将.is、.ru、.to和.tv注册表列为臭名昭著的市场名单的候选者。\n这些注册处为盗版网站提供服务，包括torrentz2.is、rlsbb.ru、fmovies.to和lostFilm.tv，据报道，它们没有对版权所有者的报告和/或执法请求采取任何行动。\n没有提到的是，这些公司遵守当地法律。例如，.is注册处确实会响应冰岛法院的命令，.to注册处也会遵守美国法院的命令。不过，他们并不是自愿与权利人合作的。\nMPA和RIAA也将域名隐私服务Njalla列入了各自的推荐名单。这项服务由海盗湾联合创始人彼得·桑德(Peter Sunde)在几年前推出，充当注册商和域名所有者之间的隐私盾牌。\n这两个版权组织都指出，Njalla为许多盗版网站提供服务，他们也强调了Sunde的参与。\n他说：“很多侵犯版权的服务机构都使用这项服务，以防止版权持有人辨认盗版网站的营运者。”RIAA写道，事实上，该公司在其网站上公开广告称，它的一些运营商“也参与了海盗湾和海盗湾等项目”。\nRIAA还怀疑Njalla的公司名称1337 LLC，该名称与盗版网站1337x.to几乎一模一样。\n这项服务由总部设在加勒比海内维斯的1337 LLC运营，由彼得·桑德(海盗湾的联合创始人之一)创立。此外，1337 LLC与1337x.to同名，这是一家臭名昭著的Torrent索引网站，也列在本意见书中。\n最后的评论表明，该组织可能不知道“1337”代表什么。这也适用于RIAA对Njalla引用的提到“互联网”一词的更正。\n互联网(原文如此)通过列出几家域名公司和服务，RIAA和MPA继续强调更多的第三方中介机构是臭名昭著的市场。\n他们的建议还提到了防弹主机提供商、包括Telegram在内的通信工具、Cloudflare等CDN服务，以及与盗版网站合作的广告商。\nTorrentFreak采访了Njalla的联合创始人Peter Sunde，后者强烈否认了这些指控。他认为隐私是一件很好的事情，并认为保护用户是他的职责。\n“在此之前，MPA和RIAA都没有费心与我们联系。我们猜测这是因为我们的所作所为不仅非常合法和必要，而且还与大多数进步民主国家的理解相辅相成；保护用户数据非常重要。\nSunde说，RIAA和MPA还抱怨欧盟新的隐私法GDPR，这促使许多域名注册机构保护WHOIS数据。\n“GDPR是一个Njalla-Light，这对RIAA和MPA来说可能是一个更大的问题。但他们最大的威胁是他们自己。他们仍然对自己没有控制互联网感到愤怒。\n“Njalla是人权组织和隐私专家推荐的必备品，以保护你的网络隐私。”比如杀毒软件、安全电子邮件、防火墙和VPN。\n批评njalla并不是什么新鲜事。该公司曾多次因“保护”盗版网站而受到批评。然而，该公司对自己的看法不同。它并没有被法律威胁打动，而是更喜欢强调它对猫的爱。\n桑德已经多年没有涉足海盗湾了，他说他也没有在Njalla的股份。然而，他是公司的公众形象。虽然版权持有者认为这是一件坏事，但Sunde对此有不同的定义。\n“虽然MPA和RIAA认为我的参与是一件负面的事情，但这也是Njalla获得人民信任的主要原因之一，因为我显然是站在诚信这一边的，而这正是MPA的对立面。”\n根据Sunde的说法，RIAA似乎不知道“互联网”或广为人知的术语“1337”的历史意义，这充分说明了他们的技术专长。\n“如果1337这个名字让他们担心，那是因为他们自己显然不是1337，”他指出。\nRIAA和MPA的最新建议试图对第三方中介机构施加更大压力。虽然其中许多肯定不是典型的“盗版”组织，但这些组织希望激励他们采取更多行动来遏制侵犯版权的行为。\nRIAA提交给美国贸易代表办公室(USTR)的一份副本可以在这里找到，而MPA的副本可以在这里找到。美国政府将审查这些建议，并将在几个月内发布恶名市场的最终名单。以下是RIAA和/或MPA命名的所有在线网站和服务的概述。\n盗版网站(&amp；云/社交主机)：ytmp3.cc，mp3juices.cc，flvto.biz and 2v.com，y2mate.com，saveFrom.net，mp3-youtube.download，newalumeleases.net，rnbxclusive.vip，leakth.is，intmusic.net，plusPremieres.to，ak47full.com，kingland-leaks.com，720pichle.org&amp。Dizilla.com，Bs.to，Cda.pl，Cinecalidad.to，Dytt8.net，Dy2018.com，Dygod.net和Ygdy8.com，Egy.Best，Fmovies.to，Gimyvod.com，“Indo 21”，Mr Piracy.top，ThePirateBay.org，1337x.to，rarbg.to，torrentz2.eu，rutracker.org，Tamilrockers.ws，Yts.mx。Vivo.sx、vk.com、zippyshare.com、rapidgator.net、turbobit.net、chomikuj.pl、dbree.org、fileccrypt.cc、wi.to、ddownload.com、AnonFiles.com、mp3fiesta.com。", "note_en": "Responding to a request from the Office of the US Trade Representative ( USTR), the RIAA and MPA have submitted their annual recommendations for the “notorious markets” list.\n The submissions identify online and offline piracy hubs to help guide the U.S. Government’s position towards foreign countries when it comes to copyright enforcement.\n Traditionally, copyright holders have reported typical pirate sites to the USTR. The position is no different this year, as The Pirate Bay, YTS, Rarbg, 1337x, Popcorn Time, Leakthis, Rapidgator, and Anonfiles are prominently listed.\n The music industry also lists various YouTube download sites while the movie group highlights illegal IPTV services. However, this year’s recommendations go much further than just websites, with the RIAA and MPA singling out various third-party intermediaries as well, including domain name registries.\n  In its latest submission, the MPA points out that these domain name companies are in a pivotal position, since they can help to shut off pirate sites that are clearly problematic.\n “The registry, directly or via its contractual relationship with registrars, has the ability to withdraw or disable domain names used by websites engaged in massive copyright infringement,” the MPA writes.\n While some registrars and registries do indeed take sites offline following copyright holder complaints, not all do. The MPA, for example, highlights the .IS, .RU, .TO and .TV registries as candidates for the notorious market list.\n These registries provide services to pirate sites including torrentz2.is, rlsbb.ru, fmovies.to and lostfilm.tv and are reportedly taking no action in response to copyright holder reports and/or law enforcement requests.\n What isn’t mentioned is that these companies abide by local laws. The .IS registry, for example, does respond to Icelandic court orders and the .TO registry complies with US court orders. They don’t work with rightsholders voluntarily though.\n  The MPA and RIAA have also put the domain privacy service  Njalla on their respective recommendation lists. The service, which was launched by Pirate Bay co-founder Peter Sunde a few years ago, acts as a privacy shield between the registrar and the domain owner.\n Both copyright groups note that Njalla provides its service to many pirate sites and they also highlight Sunde’s involvement.\n “Many copyright infringing services are using this service to prevent right holders from identifying the operators of pirate sites. In fact, the service openly advertises on its website that some of its operators ‘have also been involved in projects like The Pirate Bay and Piratbyrån’,” the RIAA writes.\n  The RIAA is also suspicious of Njalla’s corporate name, 1337 LLC, which is almost identical to the pirate site 1337x.to.\n “The service is run by 1337 LLC based in Nevis in the Caribbean and was established by Peter Sunde (one of the co-founders of The Pirate Bay). Furthermore, 1337 LLC shares its name with 1337x.to which is a notorious torrent index website also listed in this submission.”\n That last comment suggests that the group may not be aware of what  “1337” stands for. That also applies to the RIAA’s correction of a Njalla quote that mentions the term  “internets.”\n Internets (sic)   By listing several domain name companies and services, the RIAA and MPA continue to highlight more third-party intermediaries as notorious markets.\n Their recommendations also call out bulletproof hosting providers, communication tools including Telegram, CDN services such as Cloudflare, and advertisers that work with pirate sites.\n  TorrentFreak spoke to Njalla co-founder Peter Sunde who fiercely rejects the accusations. He believes that privacy is a great good and sees it as his duty to protect users.\n “Neither MPA nor RIAA has bothered to contact us before this. We’re guessing it’s because what we do is not only extremely legit and needed, but it’s also going hand in hand with what most progressive democracies have understood; it’s important to protect user data,” Sunde says.\n The RIAA and MPA also complained about the GDPR, the EU’s new privacy law, which prompted many domain registries to shield WHOIS data, Sunde says.\n “GDPR is a Njalla-Light and this is probably a much bigger problem for the RIAA and MPA. But their biggest threat is themselves. They’re still angry that they’re not in control of the internets.\n “Njalla is recommended by human rights groups and privacy experts as a must-have in order to protect your privacy online. Like antivirus software, secure email, a firewall, and a VPN,” he adds.\n  Njalla isn’t new to critique. The company has been repeatedly criticized for ‘protecting’ pirate sites. However, the company views itself differently. It’s  not impressed by legal threats and prefers to highlight its  love for cats instead.\n  Sunde hasn’t been involved in The Pirate Bay for many years and says he doesn’t own a stake in Njalla either. However, he is the public face of the company. While copyright holders see this as a bad thing, Sunde frames it differently.\n “While MPA and RIAA see it as a negative thing that I’m involved, it’s one of the main reasons why Njalla has the trust of the people, just because I’m obviously on the side of integrity, the opposite of MPA.”\n That the RIAA doesn’t appear to know the historical significance of the “internets” reference or the widely known term ‘1337’ says enough about their technological expertise, according to Sunde.\n “If the name 1337 has them worried, it’s because they’re obviously not 1337 themselves,” he notes.\n The most recent recommendations from the RIAA and MPA try to put even more pressure on third-party intermediaries. While many of these are certainly not typical ‘pirate’ outfits, the groups hope to motivate them to do more to curb copyright infringement.\n  A copy of RIAA’s submission to the USTR is  available here and the MPA’s copy can be  found here. The US Government will review these recommendations and will issue its final list of notorious markets in a few months. Below is an overview of all ‘online’ sites and services which are named by the RIAA and/or MPA.\n        Pirate sites (&amp;cloud/social hosting): ytmp3.cc, mp3juices.cc, flvto.biz and 2conv.com, y2mate.com, savefrom.net, mp3-youtube.download, newalbumreleases.net, rnbxclusive.vip, leakth.is, intmusic.net, pluspremieres.to, ak47full.com, kingdom-leaks.com, 720pizle.org &amp; Dizilla.com, Bs.to, Cda.pl, Cinecalidad.to, Dytt8.net, Dy2018.com, Dygod.net and Ygdy8.com, Egy.best, Fmovies.to, Gimyvod.com, “Indo 21”, MrPiracy.top, thepiratebay.org, 1337x.to, rarbg.to, torrentz2.eu, Rutracker.org, Tamilrockers.ws, Yts.mx, Pelisplus.me, Phimmoi, Rezka.ag, Superflix.net, Topflix.tv, Zt-za.com, Baidu Pan, Baidu Pan, Collaps.org, Gounlimited.to, Mixdrop.co, Uploaded.net, Uptobox.com, Vivo.sx, VK.com, zippyshare.com, rapidgator.net, turbobit.net, chomikuj.pl, dbree.org, filecrypt.cc, wi.to, ddownload.com, anonfiles.com, mp3fiesta.com.", "posttime": "2020-11-11 05:49:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "域名,美国,mpa,网站", "title": "RIAA和MPA希望在美国盗版观察名单上注册域名", "title_en": "RIAA and MPA Want Domain Registries on US Piracy Watchlist", "transed": 1, "url": "https://torrentfreak.com/riaa-and-mpa-want-domain-registries-and-njalla-on-us-piracy-watchlist-201110/", "via": "", "real_tags": ["域名", "美国", "mpa", "网站"]}, {"category": "", "categoryclass": "", "imagename": "86b94a8aacc4158817722b402fa22ca8.jpg", "infoid": 1034407, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "让我们面对现实吧：对于电影爱好者来说，这将是一个令人沮丧的假日季节，在可预见的未来，大多数电影院都会关闭，只有一部主要影片--神奇女侠1984--在电影公司将所有大片都转移到明年后仍然屹立不倒。即使是1984年的神奇女侠，也很可能从目前计划的圣诞节上映日期推迟到明年，除非我们能迅速控制住这场肆虐的流行病。\n好的一面是，流媒体平台和视频点播正在尽最大努力填补这一空白，而大型新片的缺乏给了许多规模较小的独立电影更好的机会找到观众。此外，HBO Max刚刚取消了由梅丽莎·麦卡锡(Melissa McCarthy)主演、丈夫本·法尔科内(Ben Falcon)执导的动作喜剧《超级智能》(SuperIntelligence)的官方预告片，该片将取消感恩节周末。\n但跳过通常的大院线上映，转而选择流媒体平台的决定是在去年做出的-在疫情来袭之前。这使得这部电影成为一个耐人寻味的潜在先驱，预示着未来电影的媒体生态系统可能会是什么样子，特别是对中等预算的电影来说。对于5月份正式推出的HBO Max来说，这是一笔巨大的收购。\n麦卡锡当时告诉Deadline好莱坞，我们有一个上映日期，一个完整的营销计划，我所有的媒体都排好了队。我们真的准备好出发了。当宣布HBO Max真的要上映的消息传来时，本有了这个想法。我们想，这是不是更好？不同并不意味着更糟，我们自己又是怎么看电影的呢？我们仍然去剧院，我们喜欢去剧院。如果这一切都消失了，我会哭的。但是我们在家里看了很多电影，很多人都是这样做的。这似乎是一个令人兴奋的新方式，让它出现在很多人面前。\n考虑到麦卡锡的电影在票房回报方面往往参差不齐，这也可能是将风险降至最低的明智方式。对于每一个间谍或热火(我个人最喜欢的麦卡锡汽车之一)，都有一个像欢乐时光谋杀案那样的彻头彻尾的炸弹。法尔科内在去年的最后期限前也默认了这一点。老实说，你可以发行一部中等预算的电影，如果我们留在影院，我们会取得令人难以置信的好成绩，他说。像这样的电影仍然有这样的例子。但对于这部电影，在这个时候，我们觉得这是最好的选择。\n麦卡锡饰演的卡罗尔·彼得斯是世界上最普通的人：她单身，失业，并迷恋上了詹姆斯·科登。当她的电视、电话、微波炉和其他电子设备开始与她交谈时，她起初认为这是个笑话-或者她可能只是疯了。事实上，她已经被选为世界上第一个超级智能(当然是由詹姆斯·科登配音)的观察者，这是一个正在思考是应该接管世界还是让人类继续存在的人工智能。地球的命运掌握在卡罗尔的平均肩上。\n麦卡锡在上个月告诉《人物》杂志说，麦卡锡最初并没有出演主角，编剧史蒂夫·马洛里原本打算让男主角出演，但她非常喜欢这个剧本，所以我把自己挤进了这部电影。从主题上讲，这部电影讲述的是科技在我们生活中的主导地位，但也是一个可爱的提醒，人们可能会有缺陷，但他们仍然值得拯救。\n除了麦卡锡和科登，鲍比·坎纳瓦莱饰演她的爱人，乔治，布莱恩·泰瑞·亨利饰演她最好的朋友丹尼斯，法尔科内饰演一个较小的政府特工角色。演员阵容还包括萨姆·理查森、迈克尔·比奇、乌斯曼·艾丽、卡兰·索尼(在《死侍》系列电影中又名多宾德)、让·斯马特和达蒙·琼斯。\n法尔科内押注转向流媒体平台会有回报吗？我们拭目以待。这部预告片看起来很有趣--尽管《欢乐时光谋杀案》的预告片也很有趣--它可能会吸引那些想要在感恩节周末找到好的PG节目的家庭。\n《超级智能》将于2020年11月26日在HBO Max首播。HBO Max还开展了一项为期20天的慈善活动，作为这部电影的营销推广活动的一部分，在这场活动中，流媒体用户每天将向不同的慈善事业捐赠2万美元，并鼓励其他人也这样做。据报道，美国电话电报公司(AT&amp；T)已经加入进来，向编程女孩捐赠了100万美元。", "note_en": "Let&#39;s face it: this is going to a dismal holiday season for film lovers, with most movie theaters shuttered for the foreseeable future and just one major release—  Wonder Woman 1984—left standing after studios shifted all their blockbusters to next year. And even  Wonder Woman 1984 is likely to end up  getting bumped to next year from its currently planned Christmas Day release date unless we can get this raging pandemic in check quickly.\n On the bright side, streaming platforms and VOD are doing their best to fill in the gap, and the dearth of major new releases is giving a lot of smaller indie films a better chance to find an audience. Plus, HBO Max just dropped the official trailer for   Superintelligence, an action comedy starring Melissa McCarthy—and directed by her husband, Ben Falcone—that will drop Thanksgiving Weekend.\n But the decision to skip the usual broad theatrical release in favor of the streaming platform was  made last year—before the pandemic hit. That makes this film an intriguing potential harbinger of what the media ecosystem for films might look like in the future, especially for midbudget films. It was a big marquee acquisition for the fledgling HBO Max, which officially launched in May.\n  &#34;We had a release date, a full marketing plan, and I had all my press lined up,&#34;  McCarthy told Deadline Hollywood at the time. &#34;We were really ready to go. When the announcement came that HBO Max was really happening, Ben had this idea. And we thought, is this better? Different doesn&#39;t mean worse, and how are  we watching films ourselves? We still go to the theater, and we love going to the theater. I would cry if that ever went away. But we watch a lot of movies at home, and a lot of people do. This just seemed like an exciting new way to get it in front of a lot of people.&#34;\n It may also be a smart way to minimize the risk, given that McCarthy&#39;s films tend to be uneven in terms of box-office returns. For every   Spy or   The Heat (one of my personal favorite McCarthy vehicles), there&#39;s an outright bomb like   The Happytime Murders. Falcone  tacitly acknowledged as much to Deadline last year. &#34;Honestly, you can release a mid-budget movie, and if we&#39;d stayed in the theaters, we could have done incredibly well,&#34; he said. &#34;There still are those examples of movies like this one that do. But for this movie, at this time, we felt like it was the best way to go.&#34;\n    McCarthy plays Carol Peters, the most average person on Earth: she&#39;s single, unemployed, and has a celebrity crush on James Corden. When her TV, phone, microwave, and other electronic devices start talking to her, she initially thinks it&#39;s a joke—or perhaps she&#39;s just going mad. In fact, she has been selected for observation by the world&#39;s first Super Intelligence (voiced by James Corden, of course), an AI who is pondering whether it should take over the world or allow humanity to continue to exist. The fate of the Earth rests on Carol&#39;s average shoulders.\n McCarthy wasn&#39;t initially cast in the lead role, which writer Steve Mallory originally intended to be male, but she loved the script so much, &#34;I pushed my way into the movie,&#34;  McCarthy told People last month. Thematically, the film is about &#34;technology&#39;s dominance over our lives, but also is a lovely reminder that people may be flawed, but they&#39;re still worth saving.&#34;\n In addition to McCarthy and Corden, Bobby Cannavale plays her love interest, George, Brian Tyree Henry plays her best friend, Dennis, and Falcone appears in a smaller role as a government agent. The cast also includes Sam Richardson, Michael Beach, Usman Ally, Karan Soni (aka Dopinder in the Deadpool films), Jean Smart, and Damon Jones.\n Will Falcone&#39;s bet on moving to a streaming platform pay off? We&#39;ll see. The trailer looks fun—although so did the trailer for  The Happytime Murders—and it might prove to be appealing to families looking for some good PG fare Thanksgiving weekend.\n Superintelligence debuts November 26, 2020, on HBO Max. HBO Max is also running a  &#34;20 Days of Kindness&#34; campaign as part of the film&#39;s marketing rollout, in which the streamer will donate $20,000 to a different good cause daily and encourage others to do the same. AT&amp;T  has reportedly already joined in with a $1 million contribution to  Girls Who Code.", "posttime": "2020-11-11 05:34:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,可能,corden,电影", "title": "詹姆斯·科登(James Corden)是一个尖刻的人工智能，可能会在超级智能中消灭人性", "title_en": "James Corden is a snarky AI that might take out humanity in Superintelligence", "transed": 1, "url": "https://arstechnica.com/gaming/2020/11/james-corden-is-a-snarky-ai-that-might-take-out-humanity-in-superintelligence/", "via": "", "real_tags": ["人工智能", "可能", "corden", "电影"]}, {"category": "", "categoryclass": "", "imagename": "77f76d4397e90bbc09083a731d7334d9.jpg", "infoid": 1034406, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司表示，它正在与连锁酒店、度假租赁提供商和其他行业协会合作，以获取这些健康和安全数据。\n个别酒店业主将可以通过谷歌我的业务中的一个新工具，直接向谷歌提供新冠肺炎的健康和安全程序，该工具可以让他们在业务简介中添加健康和安全信息。\n谷歌告诉TechCrunch，几家领先的连锁酒店在推出这一新举措时也与谷歌合作，包括万豪、希尔顿、Comfort Inn(精选酒店)、假日酒店(IHG)、最佳西方酒店、凯悦酒店、雷迪森酒店和四季酒店。\n在度假租赁方面，谷歌正在与一系列合作伙伴合作，包括大型度假租赁提供商、中型分销商和在线旅行社，他们能够直接提供这种健康和安全信息。\nVRBO是这些合作伙伴之一，但谷歌表示，目前没有与个人业主合作。它也不会像酒店那样，从Google my Business的条目中获取任何这些数据--只提供合作伙伴直接分享的数据。\n目前，这种新的与COVID相关的健康和安全信息只在用户在google.com/Travel上搜索住宿时才能获得--而不是在其他谷歌服务上，比如谷歌地图(Google Maps)。\n这次更新是在谷歌今年早些时候为应对冠状病毒大流行所做的其他更新之后进行的。如今，该公司允许用户在谷歌旅游(Google Travel)上找到可退款的酒店和度假租赁服务，并追踪特定地区的酒店和航班供应情况。\n今年9月，谷歌还在谷歌地图上添加了新冠肺炎图层，但它提供了特定地图区域每10万例病例的数据。早些时候，它还在地图上添加了新冠肺炎检查站和其他交通数据，以及帮助企业挺过政府关门的功能。", "note_en": "The company said it’s working in partnership with hotel chains, vacation rental providers, and other industry associations to source this health and safety data.\n Individual hotel owners will be able to directly provide Google with their COVID-19 health and safety procedures via a new tool in Google My Business that lets them  add health and safety information to their Business Profile.\n  At launch, several leading hotel chains are also partnering with Google on the new effort, including  Marriott,  Hilton,  Comfort Inn (Choice Hotels),  Holiday Inn (IHG),  Best Western,  Hyatt,  Radisson, and  Four Seasons, the company tells TechCrunch.\n  On the vacation rental side, Google is working with a range of partners, including large vacation rental providers, medium sized distributors, and online travel agents, who are able to provide this health and safety information directly.\n VRBO is among those partners, but Google says it’s not working with individual property owners at this time. It’s also not sourcing any of this data from entries in Google My Business, as it is with hotels — only what’s directly shared by partners.\n Currently, this new COVID-related health and safety information is only available when users search for accommodations on  google.com/travel — and not on other Google services, like Google Maps.\n This updates follows others Google made earlier this year in response to the coronavirus pandemic. Today, the company allows users to to find hotels and vacation rentals with refundable rates on Google Travel, as well as track hotel and flight availability in a given area.\n In September, Google also added  a COVID-19 layer to Google Maps, but this provides data about the number of cases per 100,000 across a given map area. Earlier, it had  added COVID-19 checkpoints and other transit data to Maps, as well, as well as  features to help businesses survive government shutdowns.", "posttime": "2020-11-11 05:29:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,covid", "title": "\n谷歌在谷歌旅游中添加了与COVID相关的健康和安全信息", "title_en": "\n\t\t\t\tGoogle adds COVID-related health and safety info to Google Travel\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/10/google-adds-covid-related-health-and-safety-info-to-google-travel/", "via": "", "real_tags": ["google", "谷歌", "covid"]}, {"category": "", "categoryclass": "", "imagename": "7fd4d24d08f0652362f5b2ea2d8d6d1f.jpg", "infoid": 1034404, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，苹果发布了全新的MacBook系列产品。这不是一次普通的发布--如果说有什么不同的话，那就是苹果今天迈出的这一步是15年来从未发生过的：整个Mac消费者产品线的CPU架构过渡的开始。\n由于该公司跨硬件和软件的垂直整合，这是一个除了苹果之外没有人能如此迅速地带来的巨大变化。苹果上一次涉足此类业务是在2006年，当时该公司抛弃了IBM的PowerPC ISA和处理器，转而采用Intel x86设计。如今，英特尔正在被抛弃，取而代之的是该公司自己的内部处理器和基于ARM ISA的CPU微架构。\n这款新处理器被称为Apple M1，这是苹果公司为Mac电脑设计的第一款SoC处理器。它拥有四个大型性能核心、四个能效核心和一个8-GPU核心GPU，在新的5纳米工艺节点上配备了160亿个晶体管。苹果正在为这一新的处理器家族开始一个新的SoC命名方案，但至少在纸面上看起来很像A14X。\n今天的活动包含了一大堆新的官方声明，但也缺乏(典型的苹果风格)细节。今天，我们将在已经发布的Apple A14 SoC的基础上，深入剖析Apple M1的最新消息，并对其微架构进行深入研究。\n新的苹果M1真的是苹果新的重大旅程的开始。在苹果的演示中，该公司并没有透露太多的设计细节，但有一张幻灯片告诉了我们很多关于芯片封装和设计的信息：\n这种将DRAM嵌入到有机包装中的包装风格对新的M1芯片来说并不是什么固有的新东西，因为我们已经在A12X上看到了这样的设计。苹果可能会使用这种包装，而不是通常的智能手机POP(包装上的包装)，因为这些芯片的设计考虑到了更高的TDPS，确保人们能够在新设计中有效地冷却设计是至关重要的。\n这可能意味着，我们还将在新芯片上看到128位DRAM总线，与上一代A-X芯片非常相似。\n在同一张幻灯片上，苹果看起来也使用了新的M1芯片的实际模具。它完全符合苹果描述的芯片特征，看起来就像是芯片的真实照片。Queue可能是我做过的最快的模具注释：\n我们可以在左侧看到新的M1的四个FireStorm CPU内核。请注意超大容量的高速缓存--这是此次活动的惊喜之一，因为A14仍然只有8MB的二级高速缓存。这里的新缓存看起来被分成了3个更大的块，考虑到苹果在这种新配置下从8MB过渡到12MB，这是有意义的，毕竟现在是由4个核心使用，而不是现在的2个核心。\n这4个IceStorm效率核心位于SoC的中央，在此之上，我们发现SoC的系统级高速缓存在所有IP块之间共享。\n最后，8核GPU占据了相当大的芯片空间，可以在这张骰子的上部找到。\n这里，M1最有趣的地方在于它与英特尔和AMD的其他CPU设计相比有何不同。所有上述模块仍然只覆盖了整个管芯的一部分，具有大量的辅助IP。苹果公司提到M1是真正的SoC，包括之前Mac笔记本电脑内的几个独立芯片的功能。\n新的CPU核心是苹果声称的世界上最快的。这将是今天文章的中心，因为我们将更深入地研究FireStorm内核的微体系结构，并向您展示Apple A14 SoC的性能数据。\n我们预计M1内核将比我们今天将展示的A14更快，所以苹果声称拥有世界上最快的CPU内核似乎是非常可信的。\n整个SoC拥有160亿个巨大的晶体管，比最新款iPhone内部的A14多35%。如果苹果保持两款芯片的晶体管密度相近，那么芯片尺寸应该在120 mm²左右，这比Macbook内部的上一代英特尔芯片要小得多。\n这并不是苹果第一次为其Mac电脑更换CPU架构。这家长期经营PowerPC的公司在本世纪头十年中期左右走到了十字路口，当时负责PowerPC开发的苹果-IBM-摩托罗拉(AIM)联盟越来越难以进一步开发芯片。IBM的PowerPC970(G5)芯片在台式机上有不错的性能指标，但它的功耗很大。这使得该芯片无法用于不断增长的笔记本电脑领域，苹果仍在使用摩托罗拉的PowerPC 7400系列(G4)芯片，该芯片的功耗确实更高，但其性能无法与英特尔的Core系列处理器相匹敌。\n因此，苹果打出了他们预留的一张牌：马克拉项目(Project Marklar)。利用Mac OS X及其底层达尔文内核的灵活性(与其他操作系统一样，达尔文内核被设计为可移植的)，苹果一直在维护Mac OS X的x86版本。尽管最初被认为是良好编码实践的一次练习--确保苹果编写的操作系统代码不会不必要地与PowerPC及其大端内存模型捆绑在一起--Marklar却成为苹果从停滞不前的PowerPC生态系统中退出的战略。该公司将改用x86处理器，特别是英特尔的x86处理器，这将颠覆其软件生态系统，但也为更好的性能和新的客户机会打开了大门。\n从所有标准来看，转用x86对苹果来说都是一大胜利。英特尔的处理器提供了比苹果留下的PowerPC处理器更好的性能功耗比，特别是在2006年底英特尔推出酷睿2(Conroe)系列处理器后，英特尔牢牢确立了自己在PC处理器领域的主导地位。这最终确立了苹果在未来几年的发展轨迹，使其成为一家专注于笔记本电脑的公司，推出了原型超极本(MacBook Air)和非常受欢迎的MacBook Pro。类似地，x86带来了与Windows的兼容性，引入了直接引导Windows的能力，或者在开销非常低的虚拟机上运行它。\n然而，这种转变的代价来自软件方面的问题。开发人员需要开始使用苹果最新的工具链来生成可以在PPC和x86 Mac上运行的通用二进制文件--而且并不是所有苹果以前的API都能跳转到x86。开发人员当然实现了跳跃，但这是一个没有真正先例的过渡。\n弥补这一差距的是Rosetta，这是苹果公司针对x86的PowerPC转换层。Rosetta将允许大多数PPC Mac OS X应用程序在x86 Mac上运行，尽管性能参差不齐(x86上的PPC并非易事)，但Intel CPU的较高性能有助于支持大多数非密集型应用程序。归根结底，Rosetta是苹果的一块创可贴，苹果在2011年推出Mac OS X 10.7(Lion)时就已经放弃了Rosetta。因此，即使有了Rosetta，苹果也向开发者明确表示，如果他们想继续销售x86应用程序并让用户满意，他们希望他们更新x86应用程序。\n最终，PowerPC向x86的过渡为现代、灵活的苹果定下了基调。从那时起，苹果创建了一套完整的开发哲学，围绕着快速发展和按自己认为合适的方式改变事物，只考虑了向后兼容性。这让用户和开发者别无选择，只能享受这一过程，跟上苹果的发展趋势。但它也让苹果有能力提早引入新技术，并在必要时打破旧应用程序，这样新功能就不会受到向后兼容性问题的阻碍。\n这一切以前都发生过，从下周苹果发布第一批基于苹果M1的Mac电脑开始，这一切都将再次发生。通用二进制程序回来了，Rosetta回来了，苹果推动开发者在ARM上安装和运行他们的应用程序的努力正在全面展开。从PPC到x86的转变为苹果的ISA改变创造了模板，在那次成功的转变之后，随着苹果成为自己的芯片供应商，他们将在接下来的几年里从头再来一次。\n发表评论说，FireStorm内核能承受的空中装载和存储数量实在是太疯狂了。回覆。\nZen3的数据看起来很不错。ARM X1也应该与FireStorm展开竞争。话虽如此，M1平台的关键优势将是它更先进的协处理器，再加上主流的采用，应该会推动开发人员构建高度优化的应用程序，这些应用程序可以围绕任何CPU限制的工作负载运行……。NVIDIA当然有Cuda，但它不像M1那样普及，也不像M1那样高效。如果操作得当，您就可以告别CPU优先计算了。回覆\n伙计们，我喜欢你们网站的主要原因是你们在市场营销注解中钻研过，我不知道你们是否已经读过了(显然没有)，但他们已经过时了，苹果声称，最强大的芯片或最省电的芯片是与他们自己2018年推出的MacBook对抗的，这是一款配备LPDDR3的14纳米i7 Skylake，甚至不是针对他们上一款Ice Lake机型，更不用说雷诺阿(是的，我知道苹果没有ryzen产品)。不会太过分了吧？是的，能源效率是不是很高，但是忽略掉所有的性能损失有那么大的区别吗？回覆。\n而单一核心的说法是基于领导力行业基准中的单一核心峰值表现，无论这意味着什么，以及JavaScript测试和速度计的组合(这是我从你那里听到的最后一个接近苹果的测试)，所以，无论如何，我们都会等待BASE。回覆。\n这些基准测试的是性能功耗比，效率非常高是的，这并不意味着功能非常强大，MacBook Pro应该适用于繁重的工作负载，但阿佩尔将这款芯片与i7 Skylake U进行了比较，后者给我的感觉不是很好，但我们将不得不等待它们的出现。回覆。\n不是的。他们不是在说苹果的数字。我不是在说苹果的数字。我在这篇文章的第四页谈的是Anandtech的数据，这是基于他们自己在A14上进行的测试，测试显示A14总体上超过了老虎湖圣帕夫(Tiger Lake St Perf)。回覆。\n他们的表现丝毫没有下降。M1显然比英特尔在Macbook Air或Macbook Pro上推出的任何产品都要快。A14被困在一部手机上，它给处理器提供了更高的TDP，以便与他们的钱竞争。回覆", "note_en": "Today, Apple has unveiled their brand-new MacBook line-up. This isn’t an ordinary release – if anything, the step that Apple is making today is something that hasn’t happened in 15 years: The start of a CPU architecture transition across their whole consumer Mac line-up.\n Thanks to the company’s vertical integration across hardware and software, this is a monumental change that nobody but Apple can so swiftly usher in. The last time Apple ventured into such an undertaking in 2006, the company had ditched IBM’s PowerPC ISA and processors in favour of Intel x86 designs. Today, Intel is being ditched in favour of the company’s own in-house processors and CPU microarchitectures, built upon the ARM ISA.\n The new processor is called the Apple M1, the company’s first SoC design for Macs. With four large performance cores, four efficiency cores, and an 8-GPU core GPU it features 16 billion transistors on the new 5nm process node. Apple’s is starting a new SoC naming scheme for this new family of processors, but at least on paper it does look at lot like an A14X.\n Today’s event contained a whole ton of new official announcement, but also lacked (in typical Apple fashion) in detail. Today, we’re doing to be dissecting the new Apple M1 news, as well as doing an microarchitectural deep dive based on the already released Apple A14 SoC.\n  The new Apple M1 is really the start of a new major journey for Apple. During Apple’s presentation the company didn’t really divulge much details of the design, however there was one slide that told us a lot about the chip’s packaging and design:\n  This packaging style with DRAM embedded within the organic packaging is something that isn’t inherent new to the new M1 chip as we’ve already seen such a design featured on the A12X. Apple uses likely uses this kind of packaging instead of your usual smartphone POP (package on package) because these chips are designed with higher TDPs in mind, and making sure one can cool the design down efficiently in the new designs is paramount.\n What this likely means is that we’ll also be seeing a 128-bit DRAM bus on the new chip, much alike that of previous generation A-X chips.\n On the very same slide, Apple also looks to have used an actual die shot of the new M1 chip. It exactly matches Apple’s described characteristics of the chip and looks like a real photograph of the die. Queue probably the quickest die annotation I’ve ever made:\n  We can see the new M1’s four Firestorm CPU cores on the left side. Notice the extremely large amount of cache – this was one of the surprises reveals of the event as the A14 still only features 8MB of L2 cache. The new cache here looks to be portioned into 3 larger blocks, which makes sense given Apple’s transition from 8MB to 12MB for this new configuration, it’s after all being used by 4 cores instead of 2 cores now.\n The 4 Icestorm efficiency cores are found central on the SoC, above which we find the SoC’s system level cache shared across all IP blocks.\n Finally, the 8-core GPU takes up a significant amount of die space and is found in the upper part of this die shot.\n What’s most interesting about the M1 here is how it compares to other CPU designs by Intel and AMD. All the aforementioned blocks still only cover up part of the whole die, with a significant amount of auxiliary IP. Apple made mention that the M1 is a true SoC, including the functionality of what previously was several discrete chips inside of Mac laptops.\n  The new CPU cores is what Apple claims to be the world’s fastest. This is going to be a centre-point of today’s article as we dwell deeper into the microarchitecture of the Firestorm cores as well present you performance figures of the Apple A14 SoC.\n We expect the M1 core to be faster than what we’re going to be presenting today with the A14, so Apple’s claim of having the fastest CPU core in the world certainly seems extremely plausible.\n  The whole SoC features a massive 16 billion transistors which is 35% more than the A14 inside of the newest iPhones. If Apple kept the transistor density similar between the two chip, we should count with a die size of around 120mm², which is considerably smaller than past generation of Intel chips inside of Macbooks.\n   This is not Apple’s first-time switching CPU architectures for their Mac computers. The long-time PowerPC company came to a crossroads around the middle of the 2000s when the Apple-IBM-Motorola (AIM) alliance, responsible for PowerPC development, increasingly struggled with further chip development. IBM’s PowerPC 970 (G5) chip put up respectable performance numbers in desktops, but its power consumption was significant. This left the chip non-viable for use in the growing laptop segment, where Apple was still using Motorola’s PowerPC 7400 series (G4) chips, which did have better power consumption, but not the performance needed to rival what Intel would eventually achieve with its Core series of processors.\n And thus, Apple played a card that they held in reserve: Project Marklar. Leveraging the flexibility of the Mac OS X and its underlying Darwin kernel, which like other Unixes is designed to be portable, Apple had been maintaining an x86 version of Mac OS X. Though largely considered to initially have been an exercise in good coding practices – making sure Apple was writing OS code that wasn’t unnecessarily bound to PowerPC and its big-endian memory model – Marklar became Apple’s exit strategy from a stagnating PowerPC ecosystem. The company would switch to x86 processors – specifically, Intel’s x86 processors – upending its software ecosystem, but also opening the door to much better performance and new customer opportunities.\n The switch to x86 was by all metrics a big win for Apple. Intel’s processors delivered better performance-per-watt than the PowerPC processors that Apple left behind, and especially once Intel launched the Core 2 (Conroe) series of processors in late 2006, Intel firmly established itself as the dominant force for PC processors. This ultimately setup Apple’s trajectory over the coming years, allowing them to become a laptop-focused company with proto-ultrabooks (MacBook Air) and their incredibly popular MacBook Pros. Similarly, x86 brought with it Windows compatibility, introducing the ability to directly boot Windows, or alternatively run it in a very low overhead virtual machine.\n  The cost of this transition, however, came on the software side of matters. Developers would need to start using Apple’s newest toolchains to produce universal binaries that could work on PPC and x86 Macs – and not all of Apple’s previous APIs would make the jump to x86. Developers of course made the jump, but it was a transition without a true precedent.\n Bridging the gap, at least for a bit, was Rosetta, Apple’s PowerPC translation layer for x86. Rosetta would allow most PPC Mac OS X applications to run on the x86 Macs, and though performance was a bit hit-and-miss (PPC on x86 isn’t the easiest thing), the higher performance of the Intel CPUs helped to carry things for most non-intensive applications. Ultimately Rosetta was a band-aid for Apple, and one Apple ripped off relatively quickly; Apple already dropped Rosetta by the time of Mac OS X 10.7 (Lion) in 2011. So even with Rosetta, Apple made it clear to developers that they expected them to update their applications for x86 if they wanted to keeping selling them and to keep users happy.\n Ultimately, the PowerPC to x86 transitions set the tone for the modern, agile Apple. Since then, Apple has created a whole development philosophy around going fast and changing things as they see fit, with only limited regard to backwards compatibility. This has given users and developers few options but to enjoy the ride and keep up with Apple’s development trends. But it has also given Apple the ability to introduce new technologies early, and if necessary, break old applications so that new features aren’t held back by backwards compatibility woes.\n All of this has happened before, and it will all happen again starting next week, when Apple launches their first Apple M1-based Macs. Universal binaries are back, Rosetta is back, and Apple’s push to developers to get their applications up and running on Arm is in full force. The PPC to x86 transition created the template for Apple for an ISA change, and following that successful transition, they are going to do it all over again over the next few years as Apple becomes their own chip supplier.\n  POST A COMMENT      The number of in-flight loads and stores the Firestorm core can sustain is just crazy.  Reply\n  Numbers are looking great for Zen3. ARM X1 should also give Firestorm a run for its money. That being said, the key advantage of the M1 platform will be its more advanced co-processors, coupled with mainstream adoption, should drive devs to build highly optimized apps that run circles around any CPU bound workload... Sure NVidia has Cuda, but it won&#39;t be nearly as wide-spread as the M1, and not nearly as efficient. If done right, you can saw bye-bye to CPU-first compute.  Reply\n  Guys, the main reason why I loved your website is because you dig in marketing footnotes, I don&#39;t know if you already read it (Aparrently no) but they are out and Apple claims that &#34;the most powerful chip or the most power-efficient&#34; is against their own 2018 MacBook, an 14nm i7 SkyLake with LPDDR3, no even against their last Ice Lake model, let alone Renoir (yes I know Apple doesn&#39;t have ryzen products) I don&#39;t know know if I missing something but I think that you ARM destroying x86 isn&#39;t going too far? Yes is power efficiency but it is that big difference to ignore all the performance lost?   Reply\n  And the single core claims are based in single core peak performance in &#34;leadership industry benchmarks&#34; whatever that means and an combination of JavaScript test and Speedometer (this last one I heard from you that was close to Apple) so, anyways we will wait for bench.  Reply\n    Those benchmarks are for performance per watt, are very efficiency yes, it doesn&#39;t mean very powerful, the MacBook Pro is supposed to be for heavy workloads but Appel compare this chips against a i7 SkyLake U, that don&#39;t give me a lot of good vibe, but we will have to wait for the bechmarks.  Reply\n  No. They aren&#39;t. I&#39;m not talking about Apple&#39;s numbers. I&#39;m talking about Anandtech&#39;s numbers, on the fourth page of this very article, based on tests they ran themselves on the A14, which show the A14 generally exceeding Tiger Lake ST perf.  Reply\n    There&#39;s no performance lost at all. The M1 is obviously faster than anything Intel can put on a Macbook Air or Macbook Pro. The A14 is stuck on a phone and its giving processors with a much higher TDP to work with a run for their money.  Reply", "posttime": "2020-11-11 05:24:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,发布,苹果", "title": "苹果发布Apple Silicon M1--基于A14的预期", "title_en": "Apple Announces the Apple Silicon M1 – What to Expect, Based on A14", "transed": 1, "url": "https://www.anandtech.com/show/16226/apple-silicon-m1-a14-deep-dive", "via": "", "real_tags": ["apple", "发布", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "e423f5f3553289bec9057dae1c601eb3.jpg", "infoid": 1034403, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着保守派人士在美国大选后蜂拥至这款自封的言论自由应用，Twitter Alternative Parker成为美国下载量最大的应用。\n在此之前，Twitter和Facebook最近几天对选举错误信息的传播进行了打击。\n该服务的所有者丹·邦吉诺(Dan Bongino)表示，周日，该服务每分钟的用户数量增加了数千英镑。\n一些人报告说，在服务器试图应对大量涌入的情况下，注册出现了问题，应用程序的运行速度变慢了。\nParler创始人约翰·马茨(John Matze)表示，该应用程序在一天内增加了200万新用户，周末期间其日活跃用户增加了四倍。\n尽管特朗普本人不是用户，但在今年早些时候的增长之后，该平台已经有几位知名贡献者。\n德克萨斯州参议员特德·克鲁兹在该平台上拥有260万粉丝，而福克斯新闻的主持人马克·莱文和肖恩·汉尼蒂各有200多万粉丝。\n与此同时，倾向于保守派的新闻媒体Newsmax也在排行榜上爬升至接近榜首的位置。\nParler于2018年推出，事实证明，它在特朗普的支持者和右翼保守派中特别受欢迎。这类团体经常指责Twitter和Facebook不公平地审查他们的观点。\n它是少数几家初创社交网络之一，比如Mewe或Gab，它们试图吸引最大平台上心怀不满的用户。\n特朗普一直是Twitter上最直言不讳的批评者之一，在选举期间，他的许多推文都被隐藏起来，并被贴上了误导性的标签。\n这款应用以法语动词命名，功能与Twitter非常相似。帖子可以用评论来回复，以类似于转发的方式回响，并且可以获得好评，而不是点赞。\n然而，帕勒确实禁止了一些东西，包括色情、暴力威胁和支持恐怖主义。\n在乔·拜登(Joe Biden)预计将在总统大选中获胜，以及特朗普未经证实的舞弊指控之后，许多保守派人士相互鼓励离开Twitter和Facebook，转而与人谈判。\n在Facebook上，有数千名成员的多个活动和小组正在鼓励从11月13日星期五开始从Facebook大规模退出谈判者。\n左倾推特用户嘲笑这一计划中的外逃是为了逃离一个没有挑战和批评的安全空间。\n对内容审核的轻描淡写意味着，与那些规则更严格的平台相比，虚假信息更容易在平台上传播。\n第一次右翼用户从主要社交网络转向谈判者的大规模迁移发生在6月份，此前一些发布关于新冠肺炎和乔治·弗洛伊德(George Floyd)抗议活动的误导性内容的账户在较大的社交媒体网站上被封。\n在Facebook、Instagram和YouTube于10月初对QAnon阴谋论采取全面行动后，数千名QAnon阴谋论的支持者在过去几周加入了进来。追随者认为，特朗普总统正在对崇拜撒旦的恋童癖精英发动一场秘密战争。\nFacebook对宣扬暴力的组织的禁令也迫使骄傲男孩和Boogaloo Bois等组织在谈判桌上重建。\n然而，像parler这样的平台已经成为相对有限的志同道合的用户的回音室。这就是为什么许多迁移到parler的用户反复尝试创建新账户以重返主流网络的原因--因为他们知道，他们的内容在这一点上可以获得广泛的吸引力。\n虽然parler上发布的内容通常不像Gab和Mewe等其他自称言论自由的平台那样极端，但它是许多帖子的发源地，这些帖子要么被标记为误导性，要么被主要平台删除--话题包括选举、新冠肺炎、拐卖儿童和疫苗。\n参议员克鲁兹最近在国会委员会听证会上猛烈抨击推特老板杰克·多尔西，他在6月份表示，他之所以加入Parler，是因为社交网络利用他们的权力让保守派保持沉默，并推动他们激进的左翼议程。\n周日，莱文在Twitter上鼓励他的追随者赶紧加入讨论小组，因为如果他们继续审查我，我可能就不会留在Facebook或Twitter了。\n有多少特朗普核心选民现在会认为福克斯太左翼，Twitter或Facebook太受控制？他说。\n即使人数众多，这些人会坚持下去吗？或者主流网络的规模效应会把他们拉回来吗？", "note_en": "Twitter alternative Parler has become the most-downloaded app in the United States as conservatives flock to the self-styled &#34;free speech&#34; app after the US election.\n It follows a clampdown on the spread of election misinformation by Twitter and Facebook in recent days.\n Owner Dan Bongino said the service was adding &#34;thousands to users per minute&#34; on Sunday.\n  Some reported problems registering and a slowdown of the app as its servers attempted to deal with the influx.\n Parler founder John Matze said the app had added two million new users in a day, and increased its daily active users four-fold over the weekend.\n   While Mr Trump himself is not a user, the platform already features several high-profile contributors following earlier bursts of growth this year.\n Texas Senator Ted Cruz boasts 2.6 million followers on the platform, while Fox News hosts Mark Levin and Sean Hannity each have more than two million.\n Newsmax, a conservative-leaning news outlet, also crept near the top of the charts at the same time.\n  Launched in 2018, Parler has proved particularly popular among Trump supporters and right-wing conservatives. Such groups have frequently accused Twitter and Facebook of unfairly censoring their views.\n It is one of a handful of start-up social networks - such as MeWe or Gab - trying to appeal to disgruntled users of the biggest platforms.\n  Mr Trump has been among Twitter&#39;s most vocal critics and has seen  many of his tweets hidden and labelled as misleading during the election period.\n Named after the French verb &#34;to speak&#34;, the app has very similar functions to Twitter. Posts can be replied to with comments, &#34;echoed&#34; in a way similar to retweeting, and upvoted instead of liked.\n   Parler does, however, ban some things, including pornography, threats of violence, and support for terrorism.\n  Following Joe Biden&#39;s projected win in the presidential election - and Mr Trump&#39;s unsubstantiated claims of fraud - many conservatives encouraged each other to leave Twitter and Facebook for Parler.\n On Facebook, multiple events and groups with thousands of members are encouraging a &#34;mass exit&#34; from Facebook to Parler from Friday 13 November.\n The planned exodus has been mocked by left-leaning Twitter users as an escape to a &#34;safe space&#34; devoid of challenge or criticism.\n The light-touch approach to content moderation means that misinformation can spread more easily on the platform than on those with stricter rules.\n    The first &#34;mass migration&#34; of right-wing users from major social networks to Parler happened in June, after a number of accounts that posted misleading content about Covid-19 and George Floyd protests got banned from the bigger social media sites.\n Thousands of supporters of the QAnon conspiracy theory have joined in in the last few weeks, after Facebook, Instagram and YouTube took sweeping action against them in early October. Followers believe President Trump is waging a secret war against a &#34;deep state&#34; elite of Satan-worshipping paedophiles.\n Facebook&#39;s ban on organisations that promote violence has also forced groups such as the Proud Boys and Boogaloo Bois to rebuild on Parler.\n  However, platforms like Parler have become an echo-chamber for a relatively limited group of like-minded users. That&#39;s why many users who have migrated to Parler make repeated attempts to create new accounts to return to major networks - as they know that&#39;s where their content can get widespread traction.\n While the content posted on Parler is usually not as extreme as other self-proclaimed &#34;free speech&#34; platforms like Gab and MeWe, it is the home of many posts that would either be flagged as misleading or removed by major platforms - on topics like the election, Covid-19, child trafficking and vaccines.\n  Senator Cruz,  who recently lambasted Twitter boss Jack Dorsey at a congressional committee hearing,  said in June that he had joined Parler because social networks use their power &#34;to silence conservatives and promote their radical left-wing agenda&#34;.\n  Tweeting on Sunday, Mr Levin encouraged his followers to &#34;hurry&#34; and join Parler because &#34;I may not stay at Facebook or Twitter if they continue censoring me&#34;.\n  &#34;How many core Trump voters will now think that Fox is too left-wing and Twitter or Facebook too controlled?&#34; he said.\n &#34;And even if that&#39;s a lot of people, will these stick - or will the scale effect of the mainstream networks pull them back?&#34;", "posttime": "2020-11-11 05:23:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,言论自由,free", "title": "特朗普落败后，谈话者的“言论自由”应用程序荣登排行榜榜首", "title_en": "Parler 'free speech' app tops charts in wake of Trump defeat", "transed": 1, "url": "https://www.bbc.com/news/technology-54873800", "via": "", "real_tags": ["程序", "言论自由", "free"]}, {"category": "", "categoryclass": "", "imagename": "62e3925bc13ca1b430f25f2eb7f06ae9.jpg", "infoid": 1034402, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无论是工具、玩具还是镜子倒影，外部物体都会暂时成为我们的一部分。\n当你手中的工具“成为你的一部分”时，这不仅仅是一个比喻。这不仅仅是对你身体运动和工具运动的统计描述。这是真的。你的大脑把它变成了现实。\n值得注意的是，对你手中触手可及的物体做出特殊反应的神经元，也会对接近你手中工具的物体做出反应。认知心理学家杰西卡·维特(Jessica Witt)和丹尼斯·普罗菲特(Dennis Proffitt)发现，当他们要求人们使用伸手工具(15英寸的管弦乐队指挥棒)到达刚刚超出射程的目标时，目标看起来比他们打算不使用工具伸手的时候更近。\n在他们的研究中，他们在桌子上短暂地闪烁了一点光，然后让人们触摸或指出这个点曾经在哪里。在这些触摸/点击试验中，有一些试验只要求受试者估计出斑点有多远(以英寸为单位)。他们的猜测有相当大的差异，但平均来说，他们非常接近准确，除了他们手持指挥棒的时候。当他们拿着警棍准备使用时，39英寸远的地方被认为只有35英寸远--仅仅因为他们手里拿着工具，感知距离就减少了10%。\nWitt和Proffitt的理论是，这种效应是大脑产生到达运动的心理模拟的结果，从而欺骗自己认为当拿着到达工具时，物体更近，因此更容易接近。为了测试这个想法，他们做了一个后续实验，他们向参与者展示了指挥棒，并告诉他们仅仅想象用它来伸手够到光点。当这些参与者报告光斑的感知距离时，这一估计距离再次大幅压缩。他们手中甚至连一件工具都没有。他们只是想象着用指挥棒到达现场，而这种运动模拟导致他们低估了现场的距离。即使大脑只是假装工具是身体的一部分，那么工具也是身体的一部分。\n20年前，认知科学家马修·博特维尼克(Matthew Botvinick)和乔纳森·科恩(Jonathan Cohen)证明，你可以欺骗大脑，让他们认为橡皮手是身体的一部分。他们让人们把右手手掌朝下放在桌子下面，然后把一只橡胶手放在桌面上，放在真正的手上方。然后，他们抚摸和轻敲橡皮手的指节和手指，与看不见桌子下面的真手的抚摸和轻敲同步。当实验参与者看到橡皮手的触摸，并感觉到他们的真手触摸的位置和时间相同时，他们开始感觉到橡皮手似乎是他们身体的一部分。\n事实上，在这种情况下，当人们被要求指出他们看不见的真手的位置时，他们的估计往往几乎一半地被转移到橡皮手的位置。心理学家弗兰克·杜金(Frank Durin)表示，它甚至不需要真正接触到手。当一面镜子恰到好处地对齐，使橡胶手看起来就像是真正(隐藏)的手所在的位置时，激光笔沿着橡胶手移动的光线就足以给人一种温暖甚至触摸真手的错觉。\n这一不同寻常的观察结果实际上具有医学应用价值。大约在同一时间，神经科医生维拉亚努尔·拉马钱德兰(Vilayanur Ramachandran)正在体验幻肢疼痛的截肢者身上探索这种现象。幻肢痛是指截肢者在被截肢的肢体感到极度疼痛的时候。这看起来可能是不可能的，但当你思考大脑是如何为那条肢体编码的，以及失去那条肢体后大脑是如何自我重组的，这就说得通了。\n例如，如果一只手臂在肘部正下方被截肢，以前为这只手编码的神经元组显然不再从那只手的机械感受器接收到感觉输入。随着时间的推移，这些神经元中的一些逐渐与附近的神经元建立联系，这些神经元一直在为肘部编码，肘部仍在接受感觉输入。\n有时，这些连接可能会让大脑认为手不知何故在肘部附近向上移动。你的大脑很清楚，如果你的右手蜷曲到接近你的右肘，那将是非常痛苦的。(不要在家里尝试。)。因此，大脑自然会产生疼痛反应。如果失去的肢体还在那里，它的一些动作会很快让大脑发现手根本不是那样蜷曲的。由于肢体缺失，大脑无法使用本体感觉来解决这一问题。然而，有了视觉输入，它就可以了。\n拉马钱德兰想出了一个天才的主意，在截肢者完整的肢体旁边放了一面镜子。当患者坐在正确的位置，镜子设置在适当的角度时，完整肢体的反射在患者看来就像是缺失肢体的副本，并且位于缺失肢体自然会出现的位置。患者大脑对完整肢体的动作进行视觉处理，就像模仿缺失肢体的动作一样。因此，如果患者的幻觉右臂感到疼痛，观看他们左手紧握和松开拳头的镜像反射可以训练他们的大脑意识到(缺失的)右臂根本没有扭曲到应该会引起疼痛的程度。对于幻肢抽筋和其他肌肉疼痛，拉马钱德兰的手术非常有效。\n无论是工具、玩具还是镜子倒影，外部物体都会暂时成为我们的一部分。当我戴上眼镜时，我是一个视力为20/20的人，这不是因为我的身体可以做到这一点--它不能--而是因为我的具有增强视力的身体硬件可以做到这一点。所以这就是我戴眼镜时的样子：一个拥有20/20视力的硬件增强型人类。\n如果你对一件乐器进行了数千小时的练习，当你用它演奏音乐时，它感觉就像是你身体的延伸--因为它确实是。当你把智能手机拿在手里时，不仅仅是皮肤表面发生的形态计算成为了你的一部分。只要你有Wi-Fi或手机信号，互联网上的所有信息(无论是真实还是虚假的信息，真实的新闻和捏造的谎言)都在你的指尖上。即使你不是直接访问它，这个巨大的信息漩涡的即时可获得性也使它成为你是谁的一部分，谎言和一切。小心点。\n迈克尔·J·斯皮维(Michael J.Spivey)是加州大学默塞德分校(University of California，Merced)的认知科学教授，著有“心灵的连续性”(The Continuity Of Mind)和“你是谁”(Who You Are)，本文节选自这两本书。", "note_en": "Whether they are tools, toys, or mirror reflections, external objects temporarily become part of who we are all the time.\n   When a tool in your hand “becomes part of you,” it’s not just a metaphor. And it’s not just a statistical description of the motions of your body and the motions of the tool. It’s real. Your brain makes it real.\n Remarkably, neurons that respond specifically to objects that are within reach of your hand will also respond to objects that are close to a  tool that’s in your hand. Cognitive psychologists Jessica Witt and Dennis Proffitt found that when they asked people to use a reaching tool (a 15-inch orchestra conductor’s baton) to reach targets that were just out of range, the targets looked closer than when they intended to reach without the tool.\n  For their  study, they briefly flashed a spot of light on a table and then asked people to touch or point to where the spot had been. Interspersed among those touch/point trials were some trials where the person was simply asked to estimate how far away the spot was (in inches). There was a fair bit of variation in their guesses, but on average they were pretty close to accurate, except when they were holding the baton. When they were holding the baton and prepared to use it, a spot that had been 39 inches away was perceived as having been only 35 inches away — a 10 percent reduction in perceived distance just because they were holding a tool in their hand.\n Witt and Proffitt theorized that this effect was a result of the brain generating a mental simulation of the reaching movement and thus tricking itself into thinking the object was closer and therefore more accessible when a reaching tool was held. To test this idea, they did a follow-up experiment where they showed the baton to participants and told them to merely  imagine using it to reach for the spot of light. When these participants reported the perceived distance of the spot of light, once again there was a substantial compression of that estimated distance. They didn’t even have a tool in their hands. They merely imagined reaching toward the spot with the baton, and that motor simulation caused them to underestimate the distance of the spot. Even if the brain just  pretends that the tool is part of its body, then the tool is part of its body.\n  Twenty years ago, cognitive scientists Matthew Botvinick and Jonathan Cohen  demonstrated that you can trick the brain into thinking a rubber hand is part of its body. They had people place their right hand palm-down underneath a table and then placed a rubber hand on the tabletop above the real hand. Then they stroked and tapped the knuckles and fingers of the rubber hand in synchrony with the stroking and tapping of the real hand, invisible under the table. When the experiment’s participants  saw the touching of the rubber hand and  felt the same places and timing of touching on their real hand, they began to feel a bit as if the rubber hand was part of their body.\n In fact, when people are asked to indicate the location of their unseen real hand under these circumstances, their estimates are often shifted almost halfway to the location of the rubber hand. Psychologist Frank Durgin showed that it doesn’t even have to be actual touch on the hands. When a mirror is aligned just right to make the rubber hand look like it’s exactly where the real (hidden) hand is located, the light from a laser pointer traveling along the rubber hand is enough to give people an illusory sensation of warmth, and even touch, on their real hand.\n This unusual observation actually has medical applications. Around that same time, neurologist Vilayanur Ramachandran was exploring this kind of phenomenon with amputees who experience phantom limb pain. Phantom limb pain is when an amputee feels excruciating pain in the limb that has been amputated. It might seem impossible, but it makes sense when you think about how the brain codes for that limb and how the brain reorganizes itself upon losing that limb.\n For instance, if an arm is amputated just below the elbow, groups of neurons that used to code for the hand obviously no longer receive sensory input from the mechanoreceptors in that hand. Over time, some of those neurons gradually develop connections to nearby neurons that have been coding for the elbow, which is still receiving sensory input.\n Sometimes those connections can cause the brain to think that the hand has somehow moved up right next to the elbow. Your brain knows full well that if your right hand were curled up so much as to be close to your right elbow, it would be incredibly painful. (Don’t try this at home.) So, the brain naturally generates a pain response. If the missing limb were still there, some movement of it would quickly allow the brain to figure out that the hand is not at all curled up like that. With the limb missing, there’s no way for the brain to use proprioception to figure this out. However, with visual input, it can.\n  Ramachandran had the genius idea to place a mirror next to the amputee’s intact limb. When the patient sits in the right position and the mirror is set at the proper angle, the reflection of the intact limb looks to the patient just like a copy of the missing limb, and in a location where that missing limb would naturally be. Movements of the intact limb are visually processed by the patient’s brain as copycat movements of the missing limb as well. Thus, if a patient is feeling pain in their phantom right arm, watching a mirrored reflection of their left hand clench and unclench a fist can train their brain to realize that the (missing) right arm is not at all contorted in a manner that should cause pain. For cramping and other muscular pain in the phantom limb, Ramachandran’s procedure is remarkably effective.\n Whether they are tools, toys, or mirror reflections, external objects temporarily become part of who we are all the time. When I put my eyeglasses on, I am a being with 20/20 vision, not because my body can do that — it can’t — but because my body-with-augmented-vision-hardware can. So that’s who I am when I wear my glasses: a hardware-enhanced human with 20/20 vision.\n If you have thousands of hours of practice with a musical instrument, when you play music with that object, it feels like an extension of your body — because it is. When you hold your smartphone in your hand, it’s not just the morphological computation happening at the surface of your skin that becomes part of who you are. As long as you have Wi-Fi or a phone signal, the information available all over the internet (both true and false information, real news and fabricated lies) is literally at your fingertips. Even when you’re not directly accessing it, the immediate availability of that vast maelstrom of information makes it part of who you are, lies and all. Be careful with that.\n  Michael J. Spivey is Professor of Cognitive Science at the University of California, Merced, and the author of “ The Continuity of Mind” and “ Who You Are,” from which this article is excerpted.", "posttime": "2020-11-11 05:23:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "成为,objects,大脑", "title": "当物体成为你的延伸时", "title_en": "When Objects Become Extensions of You", "transed": 1, "url": "https://thereader.mitpress.mit.edu/when-objects-become-extensions-of-you/", "via": "", "real_tags": ["成为", "objects", "大脑"]}]