[{"category": "", "categoryclass": "", "imagename": "460117b2cd6699cd46d6390fe77b2d7e.png", "infoid": 1068863, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "近 50 年前，英特尔创造了世界上第一个商业生产的微处理器 - 4004（参考文献 1），这是一种适度的 4 位 CPU（中央处理单元），具有 2,300 个晶体管，使用 10 μm 硅工艺技术制造，只能进行简单的算术运算计算。自从取得这一突破性成就以来，技术不断发展，越来越复杂，目前最先进的硅 64 位微处理器现在拥有 300 亿个晶体管（例如 AWS Graviton2（参考文献 2）微处理器） ，使用 7 纳米工艺技术制造）。微处理器现在如此嵌入我们的文化中，以至于它已成为一项元发明——也就是说，它是一种允许其他发明得以实现的工具，最近能够进行开发 COVID-19 疫苗所需的大数据分析在创纪录的时间内。在这里，我们报告了一个 32 位 Arm（一种精简指令集计算 (RISC) 架构）微处理器，该微处理器在柔性基板（我们称为 PlasticARM）上采用金属氧化物薄膜晶体管技术开发。与主流半导体行业不同，柔性电子产品在一个通过超薄外形、一致性、极低成本和大规模生产潜力与日常物品无缝集成的领域内运行。 PlasticARM 率先将数十亿个低成本的超薄微处理器嵌入到日常用品中。与传统半导体器件不同，柔性电子器件构建在纸张、塑料或金属箔等基板上，并使用有机物或金属氧化物或非晶硅等有源薄膜半导体材料。与晶体硅相比，它们具有许多优势，包括薄度、一致性和低制造成本。薄膜晶体管 (TFT) 可以在柔性基板上制造，其加工成本比在晶体硅晶片上制造的金属氧化物半导体场效应晶体管 (MOSFET) 低得多。 TFT 技术的目标不是取代硅。随着这两种技术的不断发展，硅很可能会在性能、密度和功率效率方面保持优势。然而，TFT 使电子产品具有新颖的外形和硅无法实现的成本点，从而极大地扩展了潜在应用的范围。微处理器是每个电子设备的核心，包括智能手机、平板电脑、笔记本电脑、路由器、服务器、汽车，以及最近构成物联网的智能对象。尽管传统的硅技术已将至少一个微处理器嵌入到地球上的每一个“智能”设备中，但它面临着使日常物品变得更智能的关键挑战，例如瓶子（牛奶、果汁、酒精或香水）、食品包装、服装、可穿戴贴片、绷带等等。成本是阻碍传统硅技术在这些日常用品中可行的最重要因素。尽管硅制造的规模经济有助于显着降低单位成本，但微处理器的单位成本仍然高得令人望而却步。此外，硅芯片本身并不薄、柔韧和贴合，所有这些都是这些日常用品中嵌入式电子产品非常理想的特性。另一方面，柔性电子产品确实提供了这些理想的特性。在过去的 20 年中，柔性电子产品已经发展到提供成熟的低成本、薄型、柔性和适应性强的设备，包括传感器、存储器、电池、发光二极管、能量收集器、近场通信/射频识别和印刷电路比如天线。这些是构建任何智能集成电子设备的基本电子元件。缺少的部分是灵活的微处理器。尚无可行的柔性微处理器存在的主要原因是，需要在柔性基板上集成相对大量的 TFT 以执行任何有意义的计算。这在新兴的柔性 TFT 技术之前是不可能的，其中需要一定程度的技术成熟度才能进行大规模集成。一种中间方法是将基于硅的微处理器芯片集成到柔性基板上——也称为混合集成 3、4、5——其中硅晶圆被减薄，并将来自晶圆的芯片集成到柔性基板上。尽管薄硅芯片集成提供了一种短期解决方案，但该方法仍然依赖于传统的高成本制造工艺。因此，对于预计在未来 10 年和 6 年之后生产数十亿个日常智能对象来说，它不是可行的长期解决方案。我们的方法是使用灵活的电子制造技术在本机开发微处理器，也称为本机灵活的处理引擎 7. 我们用来构建此处描述的本机灵活的微处理器的灵活电子技术由聚酰亚胺基板上的金属氧化物 TFT 组成。金属氧化物 TFT 成本低，还可以缩小到大规模集成所需的更小的几何尺寸 8. 早期原生灵活的处理器工作基于开发 8 位 CPU（参考文献 9、10、11、12），使用低温多晶硅 TFT 技术，制造成本高，横向可扩展性差 8. 最近，基于二维材料的晶体管已被用于开发处理器，例如使用二硫化钼 (MoS 2) 的 1 位 CPU晶体管 13 和由互补碳纳米管晶体管构建的 16 位 RISC-V CPU 14。然而，这两项工作都是在传统的硅晶片上而不是在柔性基板上进行演示的。\n构建基于金属氧化物 TFT 的处理元件的第一次尝试是一个 8 位算术逻辑单元，它是 CPU 的一部分，与在聚酰亚胺 15、16 上制造的印刷可编程 ROM 相结合。 最近，Ozer 等阿尔。 7、17、18 展示了金属氧化物 TFT 中本机灵活的专用机器学习硬件。尽管机器学习硬件 18 具有最复杂的柔性集成电路 (FlexIC)，该集成电路由金属氧化物 TFT 构建，大约有 1,400 个门，但 FlexIC 不是微处理器。可编程处理器方法比机器学习硬件更通用，并支持丰富的指令集，可用于对从控制代码到数据密集型应用程序（包括机器学习算法）的各种应用程序进行编程。原生灵活的微处理器包含三个主要组件——(1) 32 位 CPU，(2) 包含 CPU 和 CPU 外围设备的 32 位处理器，以及 (3) 片上系统 (SoC)包含处理器、存储器和总线接口——所有这些都是在柔性基板上用金属氧化物 TFT 制造的。原生灵活的 32 位处理器源自支持 Armv6-M 架构 19（一组丰富的 80 多条指令）的 Arm Cortex-M0+ 处理器和用于软件开发的现有工具链（例如，编译器、调试器、链接器、集成开发环境等）。整个原生灵活的 SoC 称为 PlasticARM，能够从其内部存储器运行程序。 PlasticARM 包含 18,334 个 NAND2 等效门，这使其成为在柔性基板上使用金属氧化物 TFT 构建的最复杂的 FlexIC（至少比以前的集成电路复杂 12 倍）。 PlasticARM 的芯片架构如图 1a 所示。它是一个 SoC，包括一个源自 32 位 Arm Cortex-M0+ 处理器产品 20 的 32 位处理器、存储器、系统互连结构和接口块，以及一个外部总线接口。 a, SoC 架构，显示了内部结构、处理器和系统外设。该处理器包含一个 32 位 Arm Cortex-M CPU 和一个嵌套向量中断控制器 (NVIC)，并通过互连结构 (AHB-LITE) 连接到其内存。最后，外部总线接口提供通用输入输出 (GPIO) 接口以与测试框架进行片外通信。 b、PlasticARM 中使用的 CPU 与 Arm Cortex-M0+ CPU 的特性相比。两款 CPU 都完全支持 Armv6-M 架构，具有 32 位地址和数据能力，以及来自整个 16 位 Thumb 和 32 位 Thumb 指令集架构子集的总共 86 条指令。 CPU 微体系结构具有两级流水线。寄存器在 Cortex-M0+ 的 CPU 中，但在 PlasticARM 中，寄存器被移动到 SoC 中基于锁存器的 RAM 中，以节省 Cortex-M 的 CPU 面积。最后，两个 CPU 彼此二进制兼容，并且与同一架构系列中的其他 CPU 兼容。 c，PlasticARM 的die layout，表示Cortex-M 处理器、ROM 和RAM 等白框中的关键块。 d，PlasticARM 的模具显微照片，显示模具和核心区域的尺寸。该处理器完全支持 Armv6-M 指令集架构，这意味着为 Cortex-M0+ 处理器生成的代码也将在派生自它的处理器上运行。处理器由 CPU 和与 CPU 紧密耦合的嵌套向量中断控制器 (NVIC) 组成，用于处理来自外部设备的中断。 SoC 的其余部分由存储器（ROM/RAM）、AHB-LITE 互连结构（高级高性能总线 (AHB) 规范的一个子集）和将存储器连接到处理器的接口逻辑以及最后一个外部用于控制两个通用输入输出 (GPIO) 引脚以进行片外通信的总线接口。 ROM 包含 456 字节的系统代码和测试程序，并已实现为组合逻辑。 128 字节的 RAM 已实现为基于锁存器的寄存器文件，主要用作堆栈。图 1b 显示了 PlasticARM 中使用的 Cortex-M 和 Arm Cortex-M0+ 的比较。尽管PlasticARM中的Cortex-M处理器不是标准产品，但它实现了支持16位Thumb和32位Thumb指令集架构子集的Armv6-M架构，因此它与所有Cortex- M 类处理器，包括 Cortex-M0+，属于同一架构系列。 PlasticARM 中的 Cortex-M 和 Cortex-M0+ 之间的主要区别在于，我们将 SoC 中 RAM 的特定部分分配给 CPU 寄存器（大约 64 字节），并将它们从 CPU 移动到 Cortex-M 中的 RAM在 PlasticARM 中，而在 Cortex-M0+ 中，寄存器保留在其 CPU 中。通过从 CPU 中消除寄存器并使用现有 RAM 作为寄存器空间，CPU 面积大幅减少（约 3 倍），代价是寄存器访问速度变慢。\nPlasticARM 是使用行业标准芯片实现工具通过 PragmatIC 的 0.8-μm 工艺实现的。我们已经为此技术开发了一个工艺设计套件、一个标准单元库和设备/电路模拟，以实现 PlasticARM FlexIC。图 1c 显示了 FlexIC 布局，其中划分了 Cortex-M 处理器、RAM 和 ROM。实施方法的详细信息可以在方法中找到。 PlasticARM 是使用商业“盒装工厂”生产线 FlexLogIC 21 制造的，其芯片显微照片如图 1d 所示。该工艺使用基于氧化铟镓锌 (IGZO) 的 n 型金属氧化物 TFT 技术，并在 200 毫米直径的聚酰亚胺晶片上生成 FlexIC 设计。 IGZO TFT 电路是使用传统的半导体加工设备制成的，这些设备适用于和配置为在厚度小于 30 μm 的柔性（聚酰亚胺）基板上生产器件。它们的沟道长度为 0.8 μm，最小电源电压为 3 V。 n 型金属氧化物薄膜技术的设计面临着许多相同的挑战，这些挑战影响了第一个硅（负沟道）的复杂性和良率1970 年代和 1980 年代初期的金属氧化物半导体 (NMOS) 技术，尤其是噪声容限差、功耗高和工艺变化大（例如 V t）。制造方法的细节可以在方法中找到。我们报告了一个功能齐全的 PlasticARM FlexIC。这已经通过在制造之前运行预编程（硬连线）到 ROM 中的三个测试程序来证明。虽然测试程序是从 ROM 执行的，但这不是系统的要求；它只是简化了 PlasticARM 的测试设置。当前的 ROM 实现不允许在制造后更改或更新程序代码，尽管这在未来的实现中是可能的（例如，通过可编程 ROM）。测试程序的编写方式使得指令执行 CPU 内部的所有功能单元，例如算术逻辑单元、加载/存储单元和分支单元，并使用 armcc 编译器使用设置为“cortex-m0plus”的 CPU 标志进行编译&#39;。测试程序的流程图和详细描述如图 2 所示。当每个测试程序完成其执行时，测试程序的结果通过片外输出 GPIO 引脚传输到测试框架。 a, 一个简单的累加程序从 ROM 中读取值并将它们相加。如果总和与预期值匹配，则会向测试仪读取的 GPIO 输出引脚发送确认信号。该测试使用加载、添加、比较和分支指令。 b，一组 32 位整数值被即时写入 RAM 并在检查读取值与预期值的同时将它们读回。如果所有写入的值都被正确读取，则会向 GPIO 输出引脚发送确认信号。该测试使用加载、存储、添加、移位、逻辑、比较和分支指令。 c、从测试仪通过GPIO输入引脚连续读取一个值。该值被一个常量值屏蔽。如果屏蔽结果为 1，则计数器递增。如果为 0，则计数器复位。如果计数器值等于预期值，则会向 GPIO 输出引脚发送确认信号。该测试使用加载、存储、添加、逻辑、比较和分支指令。斜体字表示测试程序中的变量；粗体和大写的术语是引脚和记忆。众所周知，IGZO TFT 可以弯曲到 3 毫米的曲率半径而不会损坏 22，PragmatIC 还通过将其自己的电路反复弯曲到这个曲率半径来验证这一点。然而，所有 PlasticARM 测量都是在柔性晶圆保留在其玻璃载体上的情况下进行的，使用位于 Arm Ltd 的标准晶圆测试设备，在室温下进行。 PlasticARM 的测量结果与其模拟结果进行了验证。测量设置、结果及其对模拟的验证的详细信息可以在方法中找到。 PlasticARM 的实现和测量电路特性如表 1 所示，并与使用金属氧化物 TFT 7、16、18 构建的以前最好的原生柔性集成电路进行了比较。PlasticARM 的面积为 59.2 mm 2（无焊盘），并包含 56,340 个器件（n 型 TFT 加电阻器）或 18,334 个 NAND2 等效门，至少比之前最好的集成电路（即二进制神经网络 (BNN) FlexIC）高出 12 倍。微处理器的时钟频率最高可达 29 kHz，功耗仅为 21 mW，主要是 (&gt;99%) 静态功耗，其中处理器占 45%，存储器占 33%，外设占 22%。 SoC 使用 28 个引脚，包括时钟、复位、GPIO、电源和其他调试引脚。此设计中没有使用专门的静电放电缓解技术。相反，所有输入都包含 140pF 电容器，而所有输出都由带有有源上拉晶体管的输出驱动器驱动。\n任何电阻负载技术的一个关键挑战是功耗。我们预计我们正在开发的低功耗单元库将支持更高的复杂性，高达约 100,000 个门。迁移到超过 1,000,000 个门可能需要互补金属氧化物半导体 (CMOS) 技术。我们已经报道了一种原生灵活的 32 位微处理器 PlasticARM，它采用 0.8 微米金属氧化物 TFT 技术制造。我们已经演示了 SoC 的功能，该 SoC 具有在柔性基板上制造的 32 位 Arm 处理器。由于它与 Armv6-M 架构中的 Arm Cortex-M 类处理器兼容，因此它可以搭载现有的软件/工具支持（例如编译器），因此无需开发软件工具链。最后，据我们所知，它是迄今为止使用金属氧化物 TFT 构建的最复杂的柔性集成电路，包括超过 18,000 个门，至少比以前最好的集成电路高 12 倍。我们设想，PlasticARM 将率先开发低成本、完全灵活的智能集成系统，以实现“万物互联”，包括在未来十年内将超过一万亿个无生命物体集成到数字世界中。拥有用于日常物品的超薄、可整合、低成本、本机灵活的微处理器将揭示创新，从而带来各种研究和商业机会。为了充分利用现代硅集成电路设计流程提供的高度自动化、快速周转的实现和验证，我们开发了一个小型标准单元库。标准单元库是预先验证的小型构建块的集合，可以使用复杂的电子设计自动化工具（如综合、布局和布线）快速轻松地构建更大、更复杂的设计。在开始实施标准单元库之前，先进行了一些初步调查，以便在目标技术的限制下确定最适合该库的标准单元架构。单元架构是库中每个单元共有的一组特征，例如单元高度、电源带尺寸、布线网格等，它们允许单元以标准方式咬合在一起以形成更大的结构。这些共同特征主要受制造过程的设计规则支配，但也受最终设计的性能和面积要求的影响。一旦建立了单元架构，下一步就是确定单元库的内容，不仅要考虑各种逻辑功能，还要确定每个逻辑功能的驱动强度变体的数量。由于设计、实施和表征每个标准单元所涉及的工作量很大，因此决定使用小型原型库进行一些试验，然后根据需要扩展库。为了评估这个小型原型标准单元库的性能，实施、制造和测试了一些简单的代表性电路（例如环形振荡器、计数器和移位阵列）。我们从 1.0-μm 设计规则迁移到新的 FlexIC 0.8-μm 设计规则以减少面积，从而提高产量。由于这意味着用更小的晶体管重新绘制库中的每个单元，我们也借此机会更改了标准单元架构，以包括 MT1（金属跟踪 1）引脚，以便路由器更容易连接单元。电阻材料的改进（更高的薄层电阻，R s）也使电阻器的尺寸减小了 3 倍。\n晶体管和电阻器尺寸的显着减小使大多数单元的面积减少了约 50%（参见扩展数据图 1），这反过来又通过减小设计的整体尺寸提高了制造良率。然而，由于仍然存在制造良率问题，我们可以通过改变标准来进一步缓解......", "note_en": "Nearly 50 years ago, Intel created the world’s first commercially produced microprocessor—the 4004 (ref.   1), a modest 4-bit CPU (central processing unit) with 2,300 transistors fabricated using 10 μm process technology in silicon and capable only of simple arithmetic calculations. Since this ground-breaking achievement, there has been continuous technological development with increasing sophistication to the stage where state-of-the-art silicon 64-bit microprocessors now have 30 billion transistors (for example, the AWS Graviton2 (ref.   2) microprocessor, fabricated using 7 nm process technology). The microprocessor is now so embedded within our culture that it has become a meta-invention—that is, it is a tool that allows other inventions to be realized, most recently enabling the big data analysis needed for a COVID-19 vaccine to be developed in record time. Here we report a 32-bit Arm (a reduced instruction set computing (RISC) architecture) microprocessor developed with metal-oxide thin-film transistor technology on a flexible substrate (which we call the PlasticARM). Separate from the mainstream semiconductor industry, flexible electronics operate within a domain that seamlessly integrates with everyday objects through a combination of ultrathin form factor, conformability, extreme low cost and potential for mass-scale production. PlasticARM pioneers the embedding of billions of low-cost, ultrathin microprocessors into everyday objects.\n     Unlike conventional semiconductor devices, flexible electronic devices are built on substrates such as paper, plastic or metal foil, and use active thin-film semiconductor materials such as organics or metal oxides or amorphous silicon. They offer a number of advantages over crystalline silicon, including thinness, conformability and low manufacturing costs. Thin-film transistors (TFTs) can be fabricated on flexible substrates at a much lower processing cost than metal–oxide–semiconductor field-effect transistors (MOSFETs) fabricated on crystalline silicon wafers. The aim of the TFT technology is not to replace silicon. As both technologies continue to evolve, it is likely that silicon will maintain advantages in terms of performance, density and power efficiency. However, TFTs enable electronic products with novel form factors and at cost points unachievable with silicon, thereby vastly expanding the range of potential applications.\n Microprocessors are at the heart of every electronic device, including smartphones, tablets, laptops, routers, servers, cars and, more recently, smart objects that make up the Internet of Things. Although conventional silicon technology has embedded at least one microprocessor into every ‘smart’ device on Earth, it faces key challenges to make everyday objects smarter, such as bottles (milk, juice, alcohol or perfume), food packages, garments, wearable patches, bandages, and so on. Cost is the most important factor preventing conventional silicon technology from being viable in these everyday objects. Although economies of scale in silicon fabrication have helped to reduce unit costs dramatically, the unit cost of a microprocessor is still prohibitively high. In addition, silicon chips are not naturally thin, flexible and conformable, all of which are highly desirable characteristics for embedded electronics in these everyday objects.\n Flexible electronics, on the other hand, does offer these desirable characteristics. Over the past two decades, flexible electronics have progressed to offer mature low-cost, thin, flexible and conformable devices, including sensors, memories, batteries, light-emitting diodes, energy harvesters, near-field communication/radio frequency identification and printed circuitry such as antennas. These are the essential electronic components to build any smart integrated electronic device. The missing piece is the flexible microprocessor. The main reason why no viable flexible microprocessor yet exists is that a relatively large number of TFTs need to be integrated on a flexible substrate in order to perform any meaningful computation. This has not previously been possible with the emerging flexible TFT technology, in which a certain level of technology maturity is required before a large-scale integration can be done.\n A midway approach has been to integrate silicon-based microprocessor dies onto flexible substrates—also called hybrid integration  3, 4, 5—where the silicon wafer is thinned and dies from the wafer are integrated onto a flexible substrate. Although thin silicon die integration offers a short-term solution, the approach still relies on conventional high-cost manufacturing processes. It is, therefore, not a viable long-term solution for enabling the production of the billions of everyday smart objects expected over the next decade and beyond  6.\n Our approach is to develop the microprocessor natively using flexible electronic fabrication techniques, also termed a natively flexible processing engine  7. The flexible electronics technology we used to build the natively flexible microprocessor described here consists of metal-oxide TFTs on polyimide substrates. Metal-oxide TFTs are low cost and can also be scaled down to the smaller geometries required for large-scale integration  8.\n Early natively flexible processor works were based on developing 8-bit CPUs (refs.   9, 10, 11, 12) using low-temperature poly-silicon TFT technology, which has a high manufacturing cost and poor lateral scalability  8. Recently, two-dimensional material-based transistors have been used to develop processors such as a 1-bit CPU using molybdenum disulfide (MoS 2) transistors  13, and a 16-bit RISC-V CPU  14 built from complementary carbon nanotube transistors. However, both works were demonstrated on a conventional silicon wafer rather than on a flexible substrate.\n The first attempt to build a metal-oxide TFT-based processing element is an 8-bit arithmetic logic unit, which is a part of the CPU, coupled with a print-programmable ROM fabricated on polyimide  15, 16. Very recently, Ozer et al.  7, 17, 18 presented natively flexible dedicated machine learning hardware in metal-oxide TFTs. Although the machine learning hardware  18 had the most complex flexible integrated circuit (the FlexIC) built with metal-oxide TFTs at around 1,400 gates, the FlexIC was not a microprocessor. A programmable processor approach is more generic than machine learning hardware, and supports a rich set of instructions that can be used to program a wide variety of applications from control codes to data-intensive applications including machine learning algorithms.\n There are three major components of the natively flexible microprocessor—(1) a 32-bit CPU, (2) a 32-bit processor containing a CPU and CPU peripherals, and (3) a system-on-a-chip (SoC) containing the processor, memories and bus interfaces—all fabricated with metal-oxide TFTs on a flexible substrate. The natively flexible 32-bit processor is derived from the Arm Cortex-M0+ processor supporting the Armv6-M architecture  19 (a rich set of 80+ instructions) and existing toolchain for software development (for example, compilers, debuggers, linkers, integrated development environments and so on). The entire natively flexible SoC, called PlasticARM, is capable of running programs from its internal memory. PlasticARM contains 18,334 NAND2 equivalent gates, which makes it the most complex FlexIC (at least 12× more complex than previous integrated circuits) that has been ever built with metal-oxide TFTs on a flexible substrate.\n The chip architecture of PlasticARM is shown in Fig.  1a. It is a SoC comprising a 32-bit processor derived from the 32-bit Arm Cortex-M0+ processor product  20, memories, system interconnect fabric and interface blocks, and an external bus interface.\n a, The SoC architecture, showing the internal structure, the processor and system peripherals. The processor contains a 32-bit Arm Cortex-M CPU and a Nested Vector Interrupt Controller (NVIC), and is connected to its memory through the interconnect fabric (AHB-LITE). Finally, the external bus interface provides a General-Purpose Input-Output (GPIO) interface to communicate off-chip with the test framework.  b, Features of the CPU used in PlasticARM compared to those of the Arm Cortex-M0+ CPU. Both CPUs fully support Armv6-M architecture with 32-bit address and data capabilities and a total of 86 instructions from the entire 16-bit Thumb and a subset of 32-bit Thumb instruction set architecture. The CPU microarchitecture has a two-stage pipeline. The registers are in the CPU of the Cortex-M0+, but in the PlasticARM the registers are moved to the latch-based RAM in the SoC to save the CPU area of the Cortex-M. Finally, both CPUs are binary compatible with each other and to other CPUs in the same architecture family.  c, The die layout of PlasticARM, denoting the key blocks in white boxes such as the Cortex-M processor, ROM and RAM.  d, The die micrograph of PlasticARM, showing the dimensions of the die and core areas.\n This processor fully supports the Armv6-M instruction set architecture, which means that the code generated for a Cortex-M0+ processor will also run on the processor derived from it. The processor comprises the CPU and a Nested Vector Interrupt Controller (NVIC) tightly coupled to the CPU, handling interrupts from external devices.\n The rest of the SoC consists of memories (ROM/RAM), the AHB-LITE interconnect fabric (a subset of the advanced high-performance bus (AHB) specification) and interface logic to connect the memories to the processor, and finally an external bus interface that is used to control two General-Purpose Input-Output (GPIO) pins to communicate off-chip. The ROM contains 456 bytes of system code and test programs, and has been implemented as combinational logic. The 128 bytes of RAM has been implemented as a latch-based register file and is mainly used as a stack.\n Figure  1b shows the comparison of the Cortex-M used in PlasticARM and the Arm Cortex-M0+. Although the Cortex-M processor in PlasticARM is not a standard product, it implements the Armv6-M architecture supporting the 16-bit Thumb and a subset of the 32-bit Thumb instruction set architectures, and so it is binary compatible with all Cortex-M class processors, including Cortex-M0+, in the same architecture family. The key difference between the Cortex-M in PlasticARM and Cortex-M0+ is that we allocated a specific portion of the RAM in the SoC to the CPU registers (about 64 bytes), and moved them from the CPU to the RAM in Cortex-M in PlasticARM, whereas in Cortex-M0+ the registers remain within its CPU. A large reduction (about 3×) in CPU area is achieved by eliminating the registers from the CPU and using the existing RAM for register space, at the cost of slower register access.\n PlasticARM is implemented with PragmatIC’s 0.8-μm process using industry-standard chip implementation tools. We have developed a process design kit, a standard cell library and device/circuit simulations for this technology in order to implement the PlasticARM FlexIC. Figure  1c shows the FlexIC layout, where the Cortex-M processor, RAM and ROM are demarcated. The details of the implementation methodology can be found in the Methods.\n PlasticARM is fabricated using a commercial ‘fab-in-a-box’ manufacturing line, FlexLogIC  21, and its die micrograph is shown in Fig.  1d. The process uses an n-type metal-oxide TFT technology based on indium−gallium−zinc oxide (IGZO) and generates the FlexIC design on a 200-mm-diameter polyimide wafer. The IGZO TFT circuits are made using conventional semiconductor processing equipment adapted and configured to produce devices on a flexible (polyimide) substrate with a thickness of less than 30 μm. They have a channel length of 0.8 μm, and a minimum supply voltage of 3 V.\n Design in n-type metal-oxide thin-film technology is facing many of the same challenges that affected the complexity and yield of the first silicon (negative channel metal–oxide–semiconductor, NMOS) technology during the 1970s and early 1980s, in particular poor noise margin, high power consumption, and large process variation (for example,  V t). The details of the fabrication methodology can be found in the Methods.\n We report a fully functional PlasticARM FlexIC. This has been demonstrated by running the three test programs pre-programmed (hardwired) into the ROM before fabrication. Although the test programs are executed from the ROM, this is not a requirement for the system; it simply facilitates the test setup of PlasticARM. The current ROM implementation does not allow changing or updating of the program code after fabrication, although this would be possible in future implementations (for example, via programmable ROM). The test programs are written in such a way that the instructions exercise all functional units inside the CPU such as arithmetic logic units, load/store units and branch units, and are compiled with the  armcc compiler using the CPU flag set to ‘cortex-m0plus’. The flow chart and detailed description of the test programs are shown in Fig.  2. When each test program completes its execution, the result of the test program is transmitted over the output GPIO pin off-chip to the test framework.\n a, A simple accumulation program reads values from the ROM and sums them up. If the sum matches the expected value, a confirmation signal is sent to the GPIO output pin that will be read by the tester. The test uses load, add, compare and branch instructions.  b, A set of 32-bit integer values are written into the RAM on the fly and reads them back while checking the read values against expected values. If all written values are read correctly, a confirmation signal is sent to the GPIO output pin. The test uses load, store, add, shift, logic, compare and branch instructions.  c, A value is read continuously through the GPIO input pin from the tester. The value is masked with a constant value. If the masked result is 1, then a counter is incremented. If it is 0, then the counter is reset. If the counter value is equal to an expected value, then a confirmation signal is sent to the GPIO output pin. The test uses load, store, add, logic, compare and branch instructions. Terms in italics represent variables in the test programs; terms in bold and uppercase are pins and memories.\n IGZO TFTs are known to be bent to a radius of curvature of 3 mm without damage  22, which PragmatIC has also verified through repeated bending of its own circuitry to this radius of curvature. However, all PlasticARM measurements are performed while the flexible wafer remains on its glass carrier, using standard wafer test equipment located at Arm Ltd, at room temperature. The measured results of PlasticARM are validated against its simulated results. The details of the measurement setup, results and its validation against simulation can be found in the Methods.\n The implementation and measured circuit characteristics of PlasticARM are shown in Table  1, and are compared to the best previous natively flexible integrated circuits built with metal-oxide TFTs  7, 16, 18. PlasticARM has an area of 59.2 mm 2 (without pads), and contains 56,340 devices (n-type TFTs plus resistors) or 18,334 NAND2-equivalent gates, which is at least 12 times higher than the best previous integrated circuit (that is, binary neural network (BNN) FlexIC). The microprocessor can be clocked at up to 29 kHz and consumes only 21 mW, which is predominantly (&gt;99%) static power, with the processor accounting for 45%, memories 33% and peripherals 22%. The SoC uses 28 pins, which include clock, reset, GPIO, power and other debug pins. There are no dedicated electrostatic discharge mitigation techniques used in this design. Instead, all inputs contain 140-pF capacitors, whereas all outputs are driven by output drivers with active pull-up transistors.\n  A key challenge of any resistive load technology is the power consumption. We anticipate that the lower-power cell libraries we are developing will support increased complexity, up to about 100,000 gates. Moving to more than 1,000,000 gates will probably require complementary metal–oxide–semiconductor (CMOS) technology.\n We have reported a natively flexible 32-bit microprocessor, PlasticARM, fabricated with 0.8-μm metal-oxide TFT technology. We have demonstrated the functionality of a SoC that has a 32-bit Arm processor fabricated on a flexible substrate. It can piggyback on existing software/tool support (such as compilers) because of its compatibility with the Arm Cortex-M class processors in the Armv6-M architecture, so there is no need to develop a software toolchain. Finally, to our knowledge, so far it is the most complex flexible integrated circuit built with metal-oxide TFTs, comprising over 18,000 gates, which is at least 12× higher than the best previous integrated circuit.\n We envisage that PlasticARM will pioneer the development of low-cost, fully flexible smart integrated systems to enable an ‘internet of everything’ consisting of the integration of more than a trillion inanimate objects over the next decade into the digital world. Having an ultrathin, conformable, low-cost, natively flexible microprocessor for everyday objects will unravel innovations leading to a variety of research and business opportunities.\n To take full advantage of the highly automated, fast turn-around implementation and verification offered by modern silicon integrated circuit design flows, we developed a small standard cell library. A standard cell library is a collection of small pre-verified building blocks from which much larger and more complex designs can be quickly and easily built using sophisticated electronic design automation tools such as synthesis, place and route.\n Before the implementation of the standard cell library could begin, some preliminary investigations were done to determine the most suitable standard cell architecture for the library given the constraints of the target technology. The cell architecture is the set of features that are common to every cell in the library, such as cell height, power strap sizing, routeing grid and so on, which allow the cells to be snapped together in a standard way to form larger structures. These common features are largely governed by the design rules of the manufacturing process but are also influenced by the performance and area requirements of the final design.\n Once the cell architecture was established, the next step was to determine the content of the cell library not only in terms of variety of logic functions but also the number of drive strength variants of each logic function. Because the effort involved to design, implement and characterize each standard cell is substantial, it was decided to run some trials with a small prototype library and then to expand the library as required. To evaluate the performance of this small prototype standard cell library some simple representative circuits (such as ring oscillators, counters and shift arrays) were implemented, manufactured and tested.\n We migrated from 1.0-μm design rules to the new FlexIC 0.8-μm design rules to reduce area and, hence, increase yield. As this meant redrawing each cell in the library with smaller transistors, we took the opportunity also to change the standard cell architecture to include MT1 (metal-tracking 1) pins to make it easier for the router to hook up the cells. Improvements to the resistive material (higher sheet resistance,  R s) also enabled a 3× reduction in the size of the resistors.\n This dramatic reduction in both transistor and resistor size reduced the area of most cells by about 50% (see Extended Data Fig.  1), which in turn improved the manufacturing yield by bringing down the overall size of the design. However, as there were still manufacturing yield issues that we could further mitigate by changes to the standa\n......", "posttime": "2021-07-22 22:11:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "arm", "title": "原生灵活的 32 位 Arm 微处理器", "title_en": "A natively flexible 32-bit Arm microprocessor", "transed": 1, "url": "https://www.nature.com/articles/s41586-021-03625-w", "via": "", "real_tags": ["arm"]}, {"category": "", "categoryclass": "", "imagename": "51fb00d71a7c11e36c2c834ff666b301.png", "infoid": 1068862, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2021 年 7 月 20 日下午 7 点 42 分，Windows Defender 定义每日更新将著名的 DeCSS DVD 加密软件的副本作为木马进行了立即隔离，然后在 60 秒后删除。这似乎是一个误报，值得注意的只是因为它错误定位的软件非常有名。根据下面的屏幕截图，它将软件识别为 Glupteba!ml 木马，将其标记为严重威胁； Windows Defender 还将 2000 年代中期的 XFX Keygen 程序误诊为高威胁。是的，他们破解了软件，但除非问题更大，否则这是一个中到低的威胁。如果你觉得勇敢，这里是有问题的文件：DeCSS.exe &lt;— 警告！这里是龙。下载此内容的风险自负。了解风险。我保证此文件的来源如下： 它是通过 DirectConnect 从 2004 年由 2600 名附属贡献者运行的文件中心获得的。它的代码签名与乔恩·莱赫·约翰森用来签署可执行文件的大卫·福库斯（David Fawcus）在 1999 年错误使用的代码签名相匹配.另外，这里是 XFX Force Keygen 被标记为误报 高威胁 这是文件：KEYGENXFORCE.exe &lt;— 警告！这里是龙。下载此内容需您自担风险。了解风险。\n卡巴斯基没有发现任何威胁。在 VirusTotal 上，72 个引擎中有 32 个将其误认为是恶意的。 -------------------------------------------------- ----------------------------------- MpCmdRun: 命令行: mpcmdrun -restore -all 开始时间: 星期二Jul 20 2021 20:10:48MpEnsureProcessMitigationPolicy: hr = 0x1ERROR: MpQuarantineRequest failed: 名称: HackTool:Win32/Keygen!MSR, GUID: {8003F52C-0000-0000-35F804000-33500000000000000000000000000000000004000000000000000同业 失败80508014）错误：MpQuarantineRequest 失败：名称：HackTool:Win32/Keygen!MSR，GUID：{8003F52C-0000-0000-B7CE-870973926357}（80508014）错误：QuarantineRestore 失败：MpQuarantineRestore 名称：Win32P3004 /Glupteba!ml，GUID：{80040956-0000-0000-D48C-06A3EB93B95A} (80508014)ERROR：QuarantineRestore 失败 (80508014)MpCmdRun.exe：hr = 0x8056-0000-0000 20080 0x805080 2008080 :10:48---------------------------------------------- --------------------------------------- 您通过打开一个提升的 CMD 窗口来转储日志文件夹 C:\\Program Files\\Windows Defender 文件夹。然后执行 mpcmdrun -restore -listall 以列出所有被隔离的项目。使用 mpcmdrun -restore -all 来恢复所有（危险！）您会注意到我上面的日志列出了每个文件的失败代码 80508014。因此，我执行 mpcmdrun -restore -all --Path D:\\temp 将其恢复到与删除它的 NAS 不同的位置。然后数据将在 D:\\temp 中处于静止状态，直到我尝试将其复制回 Defender 在 NAS 上删除它的位置。此时它会再次删除它。 NAS 上的静态数据存在于 DS920+ Synology 上，该 Synology 具有 BRTFS 格式的 4tb Raid 1 卷。这个 NAS 卷通过 SMB 作为 Z: 驱动器在房子里的所有机器上共享。 NAS 包含其他单独的卷，为面向 Internet 的 Pi 提供服务，该 Pi 运行 Traefikv2，在单独的 VLAN 上提供多服务。\n截至今天早上 7 点 42 分，MS 推出了一项更新，似乎修复了 DeCSS 的误报。截至 21 年 7 月 21 日晚上 8 点 10 分，它仍然错误地将 XFX Keygens 识别为威胁。", "note_en": "On 7/20/2021 at 7:42pm, Windows Defender definitions daily update picked up a  copy of the famous  DeCSS DVD encryption software as a Trojan and performed an immediate quarantine, followed by deletion 60 seconds later. This appears to be a false positive, notable only because the software it is incorrectly targeting is so famous.\n It picks up the software as the    Glupteba!ml Trojan per the screenshot below, marking it as a  Severe threat;\n   Windows Defender is also misdiagnosing XFX Keygen programs from the mid-2000’s as  high threats. Yes they crack software, but that’s a medium to low threat unless the concern is something bigger.\n   If you are feeling brave, here is the file in question:   DeCSS.exe &lt;—  Warning! Here be dragons. Download this at your own risk. Know the risks.\n I vouch for the provence of this file as follows: It was acquired via  DirectConnect from a file hub run by 2600 affiliated contributors in 2004. It’s code signature matches the incorrectly used 1999 code signature of David Fawcus that  Jon Lech Johansen used to sign the executable.\n     Separately, here is the XFX Force Keygen being tagged as a false positive  High threat\n Here is the file:  KEYGENXFORCE.exe &lt;—  Warning! Here be dragons. Download this at your own risk. Know the risks.\n    Kapersky finds no threat. On  VirusTotal, 32 out of 72 engines misidentify this as malicious.\n   -------------------------------------------------------------------------------------MpCmdRun: Command Line: mpcmdrun -restore -all Start Time: ‎Tue ‎Jul ‎20 ‎2021 20:10:48MpEnsureProcessMitigationPolicy: hr = 0x1ERROR: MpQuarantineRequest failed: name: HackTool:Win32/Keygen!MSR, GUID: {8003F52C-0000-0000-33A7-F7F5B974DFEF} (80508014)ERROR: QuarantineRestore failed (80508014)ERROR: MpQuarantineRequest failed: name: HackTool:Win32/Keygen!MSR, GUID: {8003F52C-0000-0000-B7CE-870973926357} (80508014)ERROR: QuarantineRestore failed (80508014)ERROR: MpQuarantineRequest failed: name: Trojan:Win32/Glupteba!ml, GUID: {80040956-0000-0000-D48C-06A3EB93B95A} (80508014)ERROR: QuarantineRestore failed (80508014)MpCmdRun.exe: hr = 0x80508014.MpCmdRun: End Time: ‎Tue ‎Jul ‎20 ‎2021 20:10:48-------------------------------------------------------------------------------------\n You dump the log by opening an elevated CMD window in the folder  C:\\Program Files\\Windows Defender folder.\n You then execute  mpcmdrun -restore -listall to list all quarantined items. Follow that with  mpcmdrun -restore -all to restore all ( Danger!)\n You’ll notice my log above lists a failed code of  80508014 for each file. So instead I execute  mpcmdrun -restore -all --Path D:\\temp to restore it to a different location than the NAS it was deleted from.\n The data will then be fine at rest in D:\\temp until I try to copy it back to where Defender Deleted it on the NAS.  At which point it deletes it again.\n    The data at rest on the NAS lives on a DS920+ Synology with a 4tb Raid 1 volume in BRTFS format. This NAS volume is shared via SMB as the Z: drive on all machines in the house. The NAS contains other separate volumes servicing an Internet facing Pi running Traefikv2 with multipule services on a separate VLAN.\n MS Has pushed out an update that appears to fix the false positive on DeCSS as of 7:42am this morning. As of 8:10pm on 7/21/21 it is still misidentifying XFX Keygens as a threat.", "posttime": "2021-07-22 22:10:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,文件", "title": "MS Windows Defender 和 DeCSS", "title_en": "MS Windows Defender and DeCSS", "transed": 1, "url": "https://www.arch13.com/ms-windows-defender-decss/", "via": "", "real_tags": ["windows", "文件"]}, {"category": "", "categoryclass": "", "imagename": "d3bf2c6c0b91b34b569e99be6d1f73fd.jpeg", "infoid": 1068861, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一组测试人员中，用户可能会继续看到“喜欢”按钮（红心），但现在会在旁边找到一个不赞成的按钮。 Twitter 表示，在这个组中，点赞将被视为“喜欢”。 Twitter 向 TechCrunch 澄清说，只有少数测试人员会看到这些选项出现在他们的 Twitter iOS 应用程序中，并且用户的投票不会公开。该公司还表示，目前尚未使用此投票信息对回复进行排名。 （但是，如果这样的系统成为公共功能，那肯定会发生变化。）测试的目标是帮助 Twitter 了解用户在对话过程中最相关的回复类型，这是 Twitter 研究过的一段时间。根据 Twitter 用户研究员 Cody Elam 的说法，过去的研究表明，用户认为信息丰富、支持性、积极和有趣的回复是“最佳”类型的回复。然而，一些最好的回复不会很快浮出水面——Twitter 希望能够通过投票和投票功能解决这个问题。今天，我们启动了在回复中投票的实验——一种向我们反馈您认为最相关的回复的方式。 Elam 表示，该功能将允许用户私下对回复质量发表意见，而不必公开羞辱其他用户。随着时间的推移，这些数据可以帮助 Twitter 改进其对话排名系统。如果 Twitter 能够根据这些信息对回复进行实际排名，那么阅读更长的 Twitter 帖子会变得更容易、更有趣——例如那些关注病毒式推文的帖子。但它也可以帮助更好地展示回复，这些回复为对话添加了一些信息或有趣的东西，甚至只是有趣的东西，同时将任何拖钓评论推到了线程中。\n今天，Twitter 允许用户通过将它们放在额外​​的点击后面来手动隐藏有损对话的回复。也许，随着时间的推移，它也可以对收到太多反对票的回复做类似的事情——就像 Reddit 一样。但需要明确的是，这些类型的功能目前都没有经过测试。这并不是 Twitter 第一次对 Like 和 Retweet 之外的其他类型的参与按钮表现出兴趣。例如，今年早些时候，有人发现 Twitter 正在调查用户对更广泛的表情符号式反应的兴趣，类似于您在 Facebook 上发现的内容。该功能似乎已被投入开发。除了表情符号反应外，同一项调查还询问了用户对“赞成”和“反对”按钮的感受。 Twitter 表示，该测试现在仅面向 iOS 上的一小部分用户推出。", "note_en": "And in one group of testers, users may continue to see the “Like” button (the red heart) but will now find a downvote button alongside it. In this group, the upvote would count as a “Like,” Twitter said.\n Twitter clarified to TechCrunch that only a small number of testers will see these options appear in their Twitter iOS app, and users’ votes will not become public.\n   The company also said it’s not currently using this vote information to rank the replies at this time. (If, however, such a system ever become a public feature, that could certainly change.)\n The goal with the test is to help Twitter to learn what sort of replies users find most relevant during their conversations, which is something Twitter has studied for some time. According to  Twitter user researcher Cody Elam, past studies determined that users believed replies that were informative, supportive, positive and funny were the “best” types of replies. However, some of the best replies wouldn’t surface quickly enough — an issue Twitter hopes to be able to address with an upvoting and downvoting feature.\n Today, we’re launching an experiment for voting within replies — a way to give us feedback on what replies you find most relevant.\n Elam says the feature would allow users to privately voice their opinion on the replies’ quality without having to publicly shame other users. Over time, this data could help Twitter to improve its conversation ranking systems.\n If Twitter were to act on this information to actually rank the replies, it could make it easier and more enjoyable to read longer Twitter threads — like those that follow viral tweets, for example. But it could also help to better showcase the replies that add something informative or interesting or even just funny to a conversation, while pushing any trolling remarks down the thread.\n Today, Twitter allows users to manually  hide the replies that detract from a conversation by placing them behind an extra click. Perhaps, in time, it could do something similar for replies that received too many downvotes, too — like Reddit does. But none of these types of features are being tested right now, to be clear.\n This isn’t the first time Twitter has shown interest in other types of engagement buttons beyond the Like and Retweet. Earlier this year, for example, Twitter was spotted surveying users about their interest in  a broader set of emoji-style reactions, similar to what you’d find on Facebook. That feature has  since been put into development, it seems.\n The same survey had also asked users how they felt about upvote and downvote buttons, in addition to emoji reactions.\n Twitter says the test is rolling out now to a small group on iOS only.", "posttime": "2021-07-22 22:07:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "测试,tests,twitter", "title": "Twitter 测试 Reddit 风格的 upvote 和 downvote 按钮", "title_en": "Twitter tests Reddit-style upvote and downvote buttons", "transed": 1, "url": "https://techcrunch.com/2021/07/21/twitter-tests-reddit-style-upvote-and-downvote-buttons/", "via": "", "real_tags": ["测试", "tests", "twitter"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068860, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "（西部土狼的踪迹，在美国犹他州珊瑚粉沙丘的早晨沙滩上）单击此处或下图获取三个参考比例的图像，发送给照相洗印机以生成常规 4&quot; x 6&quot; 照片打印，如下图所示（或在您自己的照片打印机上打印）。在相纸上进行冲印是一个不错的选择，因为它具有高对比度、抗黄变和褪色、具有出色的分辨率（没有可见的半色调网点）、相当耐用且具有一定的防水性。它也很容易和便宜。纸张或压敏纸上的激光打印效果较差；灰色补丁通常以半色调印刷“纹理”结束，纸张会随着时间的推移和阳光照射而变黄。通过将其安装在旧尺子或类似物上，使您的参考秤更耐用。我使用从铝尺上切下的 10 厘米长的尺子，并且还在五金店的一段木制油漆搅拌棒上安装了秤。我使用薄薄的 5 分钟环氧树脂来安装秤。 （避免接触水泥，我发现甲苯溶剂会导致打印染料渗色。）一个紧凑的 10 厘米参考标尺，带有用于 2D 标尺的棋盘格、用于透视测量的圆形基准标记和用于颜色校正的灰色块，可打印在照片上- 打印机或作为常规 4&quot;x6&quot; 照片打印。 1 厘米方格的棋盘图案提供有关照片二维比例的信息。高对比度的黑白图案高度可见，很容易被观众识别为参考比例。参考刻度右侧的 2 cm 中性灰色方块用于进行颜色校正。如果照亮场景的光（包括参考比例）有偏色，则中性灰色将拾取该色偏；例如，来自蓝天的光线会使不在阳光直射下的场景呈现蓝色。 Photoshop 等照片编辑工具可以通过将已知中性对象的色彩平衡调整回中性色来消除此类色偏。在 Photoshop 中，使用曲线工具的中间吸管（有关详细信息，请参阅 Photoshop 曲线帮助）。\n警告：当参考比例是照片的一小部分时，相机镜头和内部图像处理的缺陷会导致紫边、色差和其他渗入灰色块的缺陷。在这种情况下，基于灰色补丁的色彩校正可能会非常明显地关闭。当图像被高度放大时（例如，使用 Photoshop），渗色通常是可见的。在这些情况下，有时最好使用参考比例的白色部分（使用 Photoshop 曲线工具的最右侧吸管）进行颜色校正。使用吸管时，您可以通过右键单击来控制 Photoshop 在颜色采样时使用的像素数。参考标尺的黑白部分可以用来设置照片的高低点，但通常黑色方块不会像照片的其他部分那么暗（相纸的黑色不是绝对的黑色） .带有方向和中心点标记的圆形目标可用作基准并确定相机注视它的角度。如果在场景中参考比例与水平对齐，并且如果相机保持水平（尽管可能向下或向上看），就好像通常是自然的情况一样，可以推导出参考比例的旋转角度（水平和垂直）在现实世界中，以及相机指向下方或上方的角度——所有这些都来自图像中圆形目标的形状。使用这个基于浏览器的旋转角度工具来分析图像。为了尽量减少失真，通常应该努力垂直、正面地拍摄平面场景。但是，对于倾斜拍摄的平面场景，可以使用这种基于浏览器的校正工具来转换包含参考比例的图像。图1. 使用矫正工具前后的图像（广角镜头特写） 直尺形状便于携带和存放，有助于减少磨损。\n尝试将比例尺放在与感兴趣的对象相同的平面上（这样比例尺和对象将被相机以类似的方式查看），并且在相同的光线下。从远处放大以减少相机视角在照片跨度上的变化。垂直（直接）拍摄场景以最大程度地减少透视失真。如果您无法从垂直方向拍摄场景并希望能够在以后使用基准恢复真实世界的视角信息，请将比例尺定位成与地平线齐平（与感兴趣的表面齐平）并将相机水平拍摄到地平线（尽管可能指向下方或上方）。将参考刻度存放在一个小的塑料自封袋中可以减少磨损，例如，在背包中携带时。 ABFO 2 号咬痕量表。法医工作的参考量表。售价约 7 美元。印刷相当硬的 PVC。 L 形使其更容易在背包等中损坏。 IFRAO 标准比例岩画的颜色参考比例。应澳大利亚要求分发。在中等重量的纸张上打印。防止光延迟衰减。", "note_en": "(track of a Western Coyote, on morning sand at Coral Pink Sand Dunes, Utah, USA)\n Click  here or on the image below to obtain an image of three reference scales to send to a photofinisher to produce a regular 4&#34; x 6&#34; photographic print, as pictured below (or print on your own photo-printer).\n  Photofinishing on photographic paper is a good choice because it has high contrast, resistsyellowing and fading, has excellent resolution (no visible half-tone dots), and is fairly durable andsomewhat water-resistant. It&#39;s also easy and inexpensive. Laser printing on paper orpressure-sensitive paper works less well; the grey patch often ends up with a half-tone printing &#39;grain&#39;and paper can yellow with age and sun exposure.\n Make your reference scale more durable by mounting it on a piece of old ruler or similar.I use a 10cm piece cut from an aluminum ruler, and have also mounted scales on a section of awooden paint stirring stick from hardware stores. I use a thin spread of 5-minute epoxy to mount the scale. (Avoid contact cement, I found the toluene solvent caused print dye to bleed.)\n A compact 10cm reference scale with a checkerboard for 2D scale, a circular fiducial mark for perspective measurement, and a grey patch for colour correction that is printable on a photo-printer or as a regular 4&#34;x6&#34; photographic print.\n  The checkerboard pattern of 1 cm squares provides informationabout a photograph&#39;s scale in two dimensions. The high contrast black-and-whitepattern is highly visible and is easily identified by viewers as a reference scale.\n  The 2 cm neutral grey square at the right of the reference scale is intended formaking colour corrections. If light illuminating the scene (including the reference scale)has a colour cast, the neutral grey will pick up that cast; for example, light from a blue skygives a blue cast to scenes not in direct sunlight. Photo editing tools such as Photoshopcan eliminate such colour casts by adjusting the colour balance of known-neutral objectsback to neutral colour. In Photoshop, use the middle eyedropper of theCurves tool (see Photoshop Help on Curves for more information).\n Caveats: When the reference scale is a small part of a photo, shortcomings of acamera&#39;s lens and internal image processing can cause purple fringing, chromatic aberration,and other defects that bleed into the grey patch. In such cases,colour-correction based on the grey patch may be wildly and obviously off. The bleedingis usually visible when the image is highly magnified (eg., using Photoshop). In thesesituations it is sometimes better to colour-correct using the white sections of thereference scale (with the right-most eyedropper of the Photoshop Curves tool).\n You can control how many pixels Photoshop uses when colour sampling by right-clickingwhen using the eyedropper.\n The black and white sections of the reference scale can be used to set the highand low points of a photograph, but often the black squares will not be as dark asother parts of the photo (the black of the photographic paper is not an absolute black).\n  The circular target with orientation and centerpoint markings can be used as a fiducial andto determine the angle of the camera&#39;s gaze upon it. If in a scene the reference scale was aligned tohorizontal, and if the camera was held horizontal (though possibly looking down or up), as if often naturallythe case, it&#39;s possible to deduce the angles of rotation (horizontal and vertical)of the reference scale in the real world, and the angle by which the camera was pointing down or up --all that from just the shape of the circular target in your image. Use this browser-based  angles of rotation tool to analyse an image.\n To minimize distortion, normally one should strive to photograph planar scenes perpendicularly, face-on. However,for planar scenes photographed obliquely, this browser-based   rectification tool can be usedto transform an image containing the reference scale.\n Fig 1. Image (close-up with wide angle lens) before and after use of rectification tool\n  The straight-rule shape makes it easy to carry and stow, and helps reduce wear and tear.\n  Try to put the scale into the same plane as the object(s) of interest (so that thescale and the objects will be viewed similarly by the camera), and in the same light. Zoom in from a distance to reduce variations in the camera&#39;s angle of view across the span of the photograph. Photograph perpendicularly (straight on) to a scene to minimize perspective distortion. If you can&#39;t photograph the scene from the perpendicular and want to be able to laterrecover real-world angle-of-gaze information using the fudicial, position the scale so that it is levelwith the horizon (flush with the surface of interest) and shootwith the camera level to the horizon (though possibly pointing down or up). Storing the reference scale in a small plastic ziplock bag reduces abrasion, eg., when carryingit in a backpack.\n     ABFO No 2 Bite Mark Scale. A reference scale for forensic work. Sold for about US$7. Printed onfairly stiff PVC. L-shape makes it more susceptible to damage in backpacks, etc.\n IFRAO Standard ScaleA colour reference scale for rock art. Distributed upon request from Australia. Printed onmedium-weight paper. Protection from light delays fading.", "posttime": "2021-07-22 22:07:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "摄影,参考,reference", "title": "摄影参考量表（2019）", "title_en": "Photographic Reference Scale (2019)", "transed": 1, "url": "https://smallpond.ca/jim/scale/", "via": "", "real_tags": ["摄影", "参考", "reference"]}, {"category": "", "categoryclass": "", "imagename": "4f3c84b1cbb5f8081dcc0cf3aa43629b.png", "infoid": 1068859, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "用法：更聪明的 [OPTION...] --image path-to-kernel-imagewiser - 非常小的 2 型 Linux 管理程序。总有一天会启动你的unikernel/linux。 -c, --vcpu 虚拟机的 CPU 数量 -i, --image=IMAGE linux 内核 bzImage -r, --memory 虚拟机的内存大小 -v, --verbose 生成详细输出 - ?, --help Give此帮助列表 --usage 给出简短的使用消息 -V, --version 打印程序版本的强制或可选参数对于任何相应的短选项，长选项的强制或可选参数也是强制性的或可选的。更明智的/问题。 linux 内核 bzImage 的路径。 bzImage 文件采用特定格式。它包含连接的 bootsect.o + setup.o + misc.o + piggy.o。", "note_en": "Usage: wiser [OPTION...] --image path-to-kernel-imagewiser - Extremely tiny type-2 hypervisor  for linux. Will boot yourunikernel/linux someday. -c, --vcpu Number of cpu  for your vm -i, --image=IMAGE linux kernel bzImage -r, --memory Ram size  for your vm -v, --verbose Produce verbose output - ?, --help Give this  help list --usage Give a short usage message -V, --version Print program versionMandatory or optional arguments to long options are also mandatory or optional for any corresponding short options.Report bugs to https://github.com/flouthoc/wiser/issues.\n  Path to linux kernel bzImage. The bzImage file is in a specific format. It contains concatenated  bootsect.o + setup.o + misc.o + piggy.o.", "posttime": "2021-07-22 22:07:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,程序,虚拟机,启动,minimal", "title": "Wiser – 最小的虚拟机管理程序启动 Linux VM。用 C 写的", "title_en": "Wiser – minimal hypervisor boots Linux VM. Written in C", "transed": 1, "url": "https://github.com/flouthoc/wiser", "via": "", "real_tags": ["linux", "程序", "虚拟机", "启动", "minimal"]}, {"category": "", "categoryclass": "", "imagename": "09688fc1b52ff447707452bb5b0217ef.jpg", "infoid": 1068857, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航 跳转到搜索 术语 Pfeilstorch（德语中的“箭鹳”）指的是在非洲越冬时被箭伤的鹳，然后返回欧洲时箭插在身体上。迄今为止，已记录了大约 25 个 Pfeilstörche。第一个也是最著名的 Pfeilstorch 是 1822 年在德国梅克伦堡-前波美拉尼亚州克吕茨村附近发现的白鹳。它的脖子上挂着一根来自中非的 30 英寸（76 厘米）长矛。 [1] 标本被塞满，今天可以在罗斯托克大学的动物收藏中看到。因此，它被称为 Rostocker Pfeilstorch。 [2] [3] [4] 这种 Pfeilstorch 对了解欧洲鸟类的迁徙至关重要。在了解迁徙之前，人们一直在努力解释白鹳和家燕等鸟类每年突然消失的原因。除了迁徙，当时的一些理论认为，它们在冬天会变成其他种类的鸟、老鼠或在水下冬眠，这种理论甚至被当时的动物学家所传播。 [5] [6] [7] Rostocker Pfeilstorch 特别证明了鸟类长距离迁徙到越冬地。 [8] ^ Fone, Martin（2020 年 1 月 11 日）。 “好奇的问题：一只脖子上插着长矛的鹳是如何解开鸟类迁徙之谜的？”。 countrylife.co.uk. ^ “Zoologische Sammlung der Universität Rostock”（德语）。原始档案于 2011 年 10 月 2 日存档。^“罗斯托克大学动物收藏传单”(PDF)。 2012 年 3 月 22 日从原始文件 (PDF) 存档。^ &quot;Der Sproessling 3&quot; (PDF)（德语）。 2014 年 11 月 25 日从原件 (PDF) 存档。\n^ 考克，马克；梅比，理查德（2005 年）。鸟大不列颠。查托和温达斯。页。 315. ISBN 0-7011-6907-9。哈根，H. (1975)。 “Beobachtung eines Pfeilstorches in Ost-Afrika” [白鹳 (Ciconia ciconia)，在东非看到它的身体伸出箭头]。 Ornithologische Mitteilungen（德语）。 27 (5): 111–112。", "note_en": "Jump to navigation  Jump to search  The term    Pfeilstorch (German for &#34;arrow stork&#34;) is given to  storks injured by an  arrow while wintering in  Africa, before returning to  Europe with the arrow stuck in their bodies. To date, around 25   Pfeilstörche have been documented.\n The first and most famous   Pfeilstorch was a  white stork found in 1822 near the  German village of  Klütz, in the state of  Mecklenburg-Vorpommern. It was carrying a 30-inch (76 cm) spear from  central Africa in its neck.  [1] The specimen was stuffed and can be seen today in the  zoological collection of the  University of Rostock. It is therefore referred to as the   Rostocker Pfeilstorch.  [2]  [3]  [4]\n This   Pfeilstorch was crucial in understanding the  migration of European birds. Before migration was understood, people struggled to explain the sudden annual disappearance of birds like the white stork and  barn swallow. Besides migration, some theories of the time held that they turned into other kinds of birds, mice, or hibernated underwater during the winter, and such theories were even propagated by  zoologists of the time.  [5]  [6]  [7] The   Rostocker Pfeilstorch in particular proved that birds migrate long distances to wintering grounds.  [8]\n  ^   Fone, Martin (11 January 2020).  &#34;Curious Questions: How did a stork with a spear through its neck solve the mystery of the migration of birds?&#34;.  countrylife.co.uk .\n ^     &#34;Zoologische Sammlung der Universität Rostock&#34; (in German). Archived from  the original on 2 October 2011.\n ^     &#34;Flyer for the Rostock University Zoological Collection&#34;  (PDF). Archived from  the original  (PDF) on 22 March 2012.\n ^     &#34;Der Sproessling 3&#34;  (PDF) (in German). Archived from  the original  (PDF) on 25 November 2014.\n ^    Cocker, Mark;  Mabey, Richard (2005).  Birds Britannica. Chatto &amp; Windus. p. 315.  ISBN   0-7011-6907-9.\n  Hagen, H. (1975). &#34;Beobachtung eines Pfeilstorches in Ost-Afrika&#34; [White Stork (Ciconia ciconia) with arrow protruding from its body seen in East Africa].  Ornithologische Mitteilungen (in German).  27 (5): 111–112.", "posttime": "2021-07-22 22:06:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "pfeilstorch,迁徙", "title": "箭鹳", "title_en": "Pfeilstorch", "transed": 1, "url": "https://en.wikipedia.org/wiki/Pfeilstorch", "via": "", "real_tags": ["迁徙"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068856, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每年左右，有些事情迫使我重新开始一个新的操作系统映像。最近，那是一起不幸的水瓶事件。再一次，我需要从互联网上撤下我的数字生活。该博客的代码和资产目前位于一个 500 MB 的 Git 存储库中，该存储库托管在 Bitbucket 上直到今天早些时候。让我们尝试克隆它！ evantodd@HW-0063 ~ % git clone git@bitbucket.org:etodd/etodd.io.gitCloning 到 &#39;etodd.io&#39;...remote: 枚举对象: 2237, done.remote: 计数对象: 100% (2237/ 2237 ), done.remote: Compressing objects: 99% (1885/1903 ) # hang git clone https://etodd@bitbucket.org/etodd/etodd.io.gitCloning into &#39;etodd.io&#39;... &#39;的密码https://etodd@bitbucket.org&#39;：远程：枚举对象：2237，done.remote：计数对象：100%（2237/2237），done.remote：压缩对象：100%（1903/1903），完成。接收对象：22% (507/2237), 20.75 MiB | 278.00 KiB/s # hang evantodd@HW-0063 ~ % git clone --depth 1 git@bitbucket.org:etodd/etodd.io.gitCloning into &#39;etodd.io&#39;...remote：枚举对象：928，完成。 remote：计数对象：100% (928/928)，done.remote：压缩对象：100% (895/895)，完成。 # hang evantodd@HW-0063 ~ % git clone --depth 1 https://etodd@bitbucket.org/etodd/etodd.io.gitCloning into &#39;etodd.io&#39;...remote：枚举对象：928，完成。远程：计数对象：100％（928/928），done.remote：压缩对象：100％（895/895），done.error：RPC失败； curl 56 LibreSSL SSL_read: SSL_ERROR_SYSCALL, errno 54fetch-pack: 读取边带数据包时意外断开连接fatal: early EOFfatal: index-pack failed 好吧，Bitbucket，我明白是怎么回事了。是时候点击“提供反馈”按钮了。但这是什么？\n50 分钟免费构建时间？？我敢打赌，那段时间我可以搞点恶作剧。我想知道他们有哪些可用的模板... Jackpot。至关重要的是，用于设置我的第一个管道的小型 Web 安装程序让我可以直接在浏览器中编辑管道 YAML 文件并直接提交。好东西，因为我无法克隆它存储库能够提交给它。删除一堆 npm 废话后，我留下了这个管道 YAML: image: node:10.15.3 pipelines: default: - step: name: Exfiltrate!!脚本：-管道：atlassian/aws-s3-deploy：0.4.4 变量：S3_BUCKET：&#39;etodd.io&#39; LOCAL_PATH：&#39;.&#39; 5 分钟后，我有了一个 S3 存储桶和一个新的 AWS IAM 用户。将该宝贝插入存储库设置。 evantodd@HW-0063 ~ % mkdir etodd.ioevantodd@HW-0063 ~ % AWS_ACCESS_KEY_ID =xxx AWS_REGION =us-west-1 AWS_SECRET_ACCESS_KEY =xxx aws s3 cp s3://etodd.io/ ./etodd@HW-0063 HW-0063 ~ % cd etodd.ioevantodd@HW-0063 etodd.io % git statusRefresh index: 100% (899/899 ), done.On 分支 master 你的分支是最新的，&#39;origin/master&#39;。没有什么可提交的，工作树清洁 evantodd@HW-0063 etodd.io % git remote rm originevantodd@HW-0063 etodd.io % git remote add origin git@github.com:etodd/etodd.io.gitevantodd@HW-0063 etodd.io % git push --set-upstream origin mainEnumering objects: 1353, done.Counting objects: 100% (1353/1353 ), done.Delta 压缩使用最多 12 个线程压缩对象: 100% (976/976 ), done.Writing objects: 100 % (1353/1353), 324.57 MiB | 1.17 MiB/s, done.Total 1353 (delta 340 ), reused 1353 (delta 340 ), pack-reused 0remote: Resolving deltas: 100% (340/340 ), done.To github.com:etodd/etodd.io。混蛋！ [远程拒绝] main -&gt; main（不允许浅更新）错误：无法将一些引用推送到“github.com:etodd/etodd.io.git” 当然！ Bitbucket 构建代理使用 --depth 50 克隆了 repo，因此它没有完整的 Git 历史记录。但也许现在我已经下载了大部分 repo，我可以从 Bitbucket 获取其余部分？\nevantodd@HW-0063 etodd.io % git fetch --unshallow https://etodd@bitbucket.org/etodd/etodd.io.gitPassword for &#39;https://etodd@bitbucket.org&#39;：远程：枚举对象：1035 , done.remote: Counting objects: 100% (1035/1035 ), done.remote: Compressing objects: 100% (642/642), done.error: RPC failed; curl 56 LibreSSL SSL_read：SSL_ERROR_SYSCALL，errno 54fetch-pack：读取边带数据包时意外断开连接致命：早期EOFFatal：索引包失败如此接近！事实证明，您还可以加深浅层克隆，而无需一直使用 git fetch --depth N。通过反复试验，我不断增加深度，一点一点地下载 repo。最后，最后一次 git fetch --unshallow 就完成了。我写了这篇文章，提交，推送到 Github，将 Netlify 指向新的 repo，现在你已经了解了一些事情。如果您需要从 Bitbucket 中获取代码，我希望这会有所帮助。", "note_en": "Every year or so, something compels me to start over with a fresh OS image.Most recently, that something was an unfortunate water bottle incident.Once again, I need to pull down my digital life from the internet.\n The code and assets for this blog currently live in a 500 MB Git repository, which was hosted on Bitbucket until earlier today.Let&#39;s try cloning it!\n evantodd@HW-0063 ~ % git clone git@bitbucket.org:etodd/etodd.io.gitCloning into  &#39;etodd.io&#39;...remote: Enumerating objects: 2237,  done.remote: Counting objects: 100%  (2237/2237 ),  done.remote: Compressing objects: 99%  (1885/1903 ) # hang\n  git clone https://etodd@bitbucket.org/etodd/etodd.io.gitCloning into  &#39;etodd.io&#39;...Password  for  &#39;https://etodd@bitbucket.org&#39;: remote: Enumerating objects: 2237,  done.remote: Counting objects: 100%  (2237/2237 ),  done.remote: Compressing objects: 100%  (1903/1903 ),  done.Receiving objects: 22%  (507/2237 ), 20.75 MiB | 278.00 KiB/s  # hang\n  evantodd@HW-0063 ~ % git clone --depth  1 git@bitbucket.org:etodd/etodd.io.gitCloning into  &#39;etodd.io&#39;...remote: Enumerating objects: 928,  done.remote: Counting objects: 100%  (928/928 ),  done.remote: Compressing objects: 100%  (895/895 ),  done. # hang\n  evantodd@HW-0063 ~ % git clone --depth  1 https://etodd@bitbucket.org/etodd/etodd.io.gitCloning into  &#39;etodd.io&#39;...remote: Enumerating objects: 928,  done.remote: Counting objects: 100%  (928/928 ),  done.remote: Compressing objects: 100%  (895/895 ),  done.error: RPC failed; curl  56 LibreSSL SSL_read: SSL_ERROR_SYSCALL, errno  54fetch-pack: unexpected disconnect  while reading sideband packetfatal: early EOFfatal: index-pack failed\n   Alright, Bitbucket, I see how it is. Time for me to hit the &#34;Give feedback&#34; button. But what&#39;s this?\n  50 free build minutes?? I bet I could get up to some mischief in that time. I wonder what templates they have available...\n  Jackpot.Crucially, the little web installer for setting up my first pipeline lets me edit the pipeline YAML file right in the browser and commit it directly.Good thing, since I can&#39;t clone this repository to be able to commit to it.After deleting a bunch of npm nonsense, I&#39;m left with this pipeline YAML:\n image:  node:10.15.3 pipelines:  default: -  step:  name:  Exfiltrate!!  script: -  pipe:  atlassian/aws-s3-deploy:0.4.4  variables:  S3_BUCKET:  &#39;etodd.io&#39;  LOCAL_PATH:  &#39;.&#39;\n 5 minutes later I&#39;ve got an S3 bucket and a fresh AWS IAM user. Plug that baby into the repository settings.\n        evantodd@HW-0063 ~ % mkdir etodd.ioevantodd@HW-0063 ~ % AWS_ACCESS_KEY_ID =xxx AWS_REGION =us-west-1 AWS_SECRET_ACCESS_KEY =xxx aws s3 cp s3://etodd.io/ ./etodd.io --recursiveevantodd@HW-0063 ~ % cd etodd.ioevantodd@HW-0063 etodd.io % git statusRefresh index: 100%  (899/899 ),  done.On branch masterYour branch is up to date with  &#39;origin/master&#39;.nothing to commit, working tree clean\n  evantodd@HW-0063 etodd.io % git remote rm originevantodd@HW-0063 etodd.io % git remote add origin git@github.com:etodd/etodd.io.gitevantodd@HW-0063 etodd.io % git push --set-upstream origin mainEnumerating objects: 1353,  done.Counting objects: 100%  (1353/1353 ),  done.Delta compression using up to  12 threadsCompressing objects: 100%  (976/976 ),  done.Writing objects: 100%  (1353/1353 ), 324.57 MiB | 1.17 MiB/s,  done.Total  1353  (delta 340 ), reused  1353  (delta 340 ), pack-reused  0remote: Resolving deltas: 100%  (340/340 ),  done.To github.com:etodd/etodd.io.git !  [remote rejected ] main -&gt; main  (shallow update not allowed )error: failed to push some refs to  &#39;github.com:etodd/etodd.io.git&#39;\n Of course! The Bitbucket build agent cloned the repo using  --depth 50, so it doesn&#39;t have the full Git history.But maybe now that I have most of the repo downloaded, I can fetch the rest from Bitbucket?\n evantodd@HW-0063 etodd.io % git fetch --unshallow https://etodd@bitbucket.org/etodd/etodd.io.gitPassword  for  &#39;https://etodd@bitbucket.org&#39;: remote: Enumerating objects: 1035,  done.remote: Counting objects: 100%  (1035/1035 ),  done.remote: Compressing objects: 100%  (642/642 ),  done.error: RPC failed; curl  56 LibreSSL SSL_read: SSL_ERROR_SYSCALL, errno  54fetch-pack: unexpected disconnect  while reading sideband packetfatal: early EOFfatal: index-pack failed\n So close! Turns out you can also deepen a shallow clone without going all the way with  git fetch --depth N.Through trial and error I keep increasing the depth, downloading the repo bit by bit. Finally, one last  git fetch --unshallow and it&#39;s done. I write this post, commit, push to Github, point Netlify at the new repo, and now you are caught up on things.\n I hope this is helpful if you ever need to get code out of Bitbucket.", "posttime": "2021-07-22 22:06:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,提取,code,git", "title": "如何从 Bitbucket 中提取代码", "title_en": "How to Exfiltrate Code from Bitbucket", "transed": 1, "url": "https://etodd.io/2021/07/21/how-to-exfiltrate-code-from-bitbucket/", "via": "", "real_tags": ["代码", "提取", "code", "git"]}, {"category": "", "categoryclass": "", "imagename": "3673cef2e9fc088558f268243bb04abc.png", "infoid": 1068855, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "目前使用 GNU Make 构建并在 Linux、Windows 和 MacOS 系统上进行测试。将支持更多构建目标。要交叉编译，如果目标操作系统与您的主机不同，则传递 CC=target-gcc 和 OS=target-os。您可以使用使用标志配置构建 bootrom.bin 文件是用户提供的原始二进制文件，加载在它开始执行的 0x80000000 地址处，并且 device.dtb 是包含机器描述的 DTB 文件。您可以通过 -image= rootfs.img 将原始分区映像挂载为闪存驱动器。 LekKit：指令解码、RAM/MMU/TLB 实现、RV32/64ICMA ISA、中断和定时器、特权 ISA、JIT、大量修复 cerg2010cerg2010：ELF 加载、重要修复、初始 RV64 工作、PLIC、PS2、ATA、以太网、XCB窗口后端", "note_en": "Currently builds using GNU Make and tested on Linux, Windows and MacOS systems. More build targets are going to be supported.\n  To cross-compile, pass CC=target-gcc and OS=target-os if the target OS differs from your host to make. You can configure the build with use flags\n     The bootrom.bin file is a user-provided raw binary, loaded at 0x80000000 address where it starts execution, and device.dtb is a DTB file containing description of the machine.You can pass -image=rootfs.img to mount a raw partition image as a flash drive.\n  LekKit: Instruction decoding, RAM/MMU/TLB implementation, RV32/64ICMA ISA, interrupts &amp; timer, privileged ISA, JIT, lots of fixes\n  cerg2010cerg2010: ELF loading, important fixes, initial RV64 work, PLIC, PS2, ATA, Ethernet, XCB window backend", "posttime": "2021-07-22 22:06:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "虚拟机,rvvm,risc,构建", "title": "RVVM——RISC-V 虚拟机", "title_en": "RVVM – The RISC-V Virtual Machine", "transed": 1, "url": "https://github.com/lekkit/rvvm", "via": "", "real_tags": ["虚拟机", "rvvm", "risc", "构建"]}, {"category": "", "categoryclass": "", "imagename": "56269bb436fc7d022a333894dfcc12fe.jpg", "infoid": 1068854, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "寻找流行软件的开源替代品。用于商业通信、项目管理、CRM、视频会议、日程安排等的开源。", "note_en": "Find open source alternatives to popular softwares. Open Source for Business Communication, Project Management, CRM, Video Conferencing, Scheduling & more.", "posttime": "2021-07-22 22:06:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,b2b,source", "title": "流行 B2B 工具的开源替代品", "title_en": "Open Source Alternatives to Popular B2B Tools", "transed": 1, "url": "https://www.btw.so/open-source-alternatives", "via": "", "real_tags": ["开源", "b2b", "source"]}, {"category": "", "categoryclass": "", "imagename": "d6e1cb300b1318f34dd593cd24d91cc7.jpg", "infoid": 1068853, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "文字比眼睛更重要。通过缓慢而专心的阅读艺术加深您对文学的欣赏您是否想过有些人如何在他们阅读的内容中看到如此多的东西——无论他们是在阅读小说还是故事、诗歌或戏剧、散文或回忆录，还​​是完全不同的东西？阅读文学作品的一大乐趣在于，能够了解文学作品所展示和暗示的内容——以及它如何做这些事情的满足感。您可能已经喜欢文学作品娱乐您、指导您、感动您的方式。认识并理解他们是如何完成这些事情的，将使您进一步加深欣赏并获得更多回报。通过深入阅读，您可以获得经验和知识：您可以从阅读文学作品的所有独特之处中获益。你过着不同的生活，在这个世界上经历着不同的存在方式，虽然与你自己的不同，但是，你和你周围的人的情况不同。因此，在阅读文学作品的过程中，我们丰富了对他人和世界以及我们自己的理解。在某种意义上，我们变成了我们阅读的东西。您可能想知道如何增加对文学作品的欣赏，如何放大文学的价值，更充分地享受文学作品提供的语言和形式、思想和洞察力的乐趣。在下面的别墅中，我建议您如何开始。有人说，阅读的艺术并不难掌握。但我说相反；不是这样。读得好，专心致志，是不小的成就。它需要注意力和洞察力。阅读的艺术需要努力才能掌握。它需要阅读多种类型的作品，有些容易，有些则更难。读好书，读得真好\n用技巧和信心，用轻松和优雅加深理解，使人明智。学习阅读艺术——成为大师——广泛而深入地阅读，重读和大声朗读，进行观察，对你阅读的内容提出问题。读得好是不小的收获。这是一种终身学习乐趣的技能。阅读既是为了乐趣，也是为了学习——为了快乐。阅读艺术需要一些时间来掌握，无论是像素还是印刷品。慢慢来。享受。好好读书。为了从阅读文学作品中获得更大的乐趣和欣赏力，您可以做一些最重要的事情： 以洞察力和更深入的理解阅读需要密切关注，从一开始就尽可能多地注意文本。认真地参与一项工作将使您做好反思、参与和提问的准备。这就是关键——在阅读时让你的注意力集中、观察力强、质疑自我。想想列夫·托尔斯泰 (Leo Tolstoy) 的伟大小说《安娜·卡列尼娜 (Anna Karenina)》(1877 年) 的开场白，在理查德·佩维尔 (Richard Pevear) 和拉里萨·沃洛洪斯基 (Larissa Volokhonsky) 于 2000 年翻译的广受好评中：“所有幸福的家庭都是相似的；每个不幸的家庭都有自己的不幸。你可能首先注意到这句话，也许是它的平行结构。托尔斯泰的台词平衡并对比了幸福的家庭和不幸的家庭。它断言他们在体验幸福和不幸的方式上有所不同。\n行。这就是托尔斯泰在推出他的 800 页小说时所假设的。他很早就设定了他的书将是关于家庭的预期，有些家庭是幸福的，有些是不幸的。当然，我们需要阅读这本书，以了解他们的幸福和不幸是由什么组成的，以及他们如何在此过程中成为幸福和不幸的家庭。在反思托尔斯泰的句子时，你的想法可能会采取质疑其断言的形式。您可能会对其进行限定，或者暂时搁置您的同意或不同意。你甚至可以想象把句子的意思颠倒过来，这样修改：“所有不幸的家庭都是相似的；每个幸福的家庭都以自己的方式幸福。你对托尔斯泰句子的仔细观察会引发问题，这将引发反思，这说明你可以如何积极参与作家的作品。带着理解、欣赏和愉悦的心情阅读需要重新阅读。为什么会这样？重读很重要，因为一部文学作品中发生的事情太多了，你无法在一次阅读中全部掌握——没有人能做到。你需要时间去注意和反思；重新审视和重新审视那里有什么，确保你在初步旅行中通过一篇文章、诗歌或故事观察到的东西确实存在。你需要一个机会看看你可能错过了什么。在第二次及后续的作品遍历中，您会注意到更多、更多问题、更多思考、更多理解，并在此过程中加深您的阅读乐趣。老狗没有起身就向后吠叫。我记得他小时候。快速阅读这些行时，您会注意到什么？也许他们押韵；弗罗斯特的诗是对联。其次，这首诗描述了一只狗；在现在，一只老狗。看到他年迈的犬类同伴，说话者想起了他还是一只小狗的时候。而已。没有更多了。对？嗯，不完全是——尽管这就是这首诗向我们展示的要点。但是，如果您仔细观察会怎样？如果你稍微反思一下这首诗可能暗示的内容会怎样。注意包括听和看，所以试着用你的内耳听这首诗。除了韵律之外，您还会听到韵律节拍，即每行单词的节奏。你会听到并感觉到第一行的慢动作，因为前五个音节都是重读的。您会听到第一行移动困难，而第二行跳过。尽管第二行在视觉上看起来比第一行短，但它只包含少一个音节。你会如何看待这些观察结果？你可能会问自己，为什么诗人在第一行中强调关于老狗的词，为什么他使用带有难以发音的音节的词，以及为什么他在关于老狗的第二行中使用易于发音的词和音节。年轻的小狗。您可能会更仔细地注意对老狗起床困难的描述——“向后”吠叫（视觉图像）。这样做，您可能会注意到那个困难的动作与他幼年时的动作之间的对比。那个年轻的形象不是诗人给我们的，而是隐含的，以便我们可以想象。\n最后，你对这首诗的标题“生命的跨度”有什么看法？弗罗斯特是否用两行简短的文字向我们展示了一个生命周期的形象和例子——他的狗的生命周期？当然是。但他也给了我们更多的东西：他邀请我们不仅要考虑生命的跨度——狗的——还要考虑生命的跨度，其中包括诗歌的人类说话者的生命跨度。毕竟，演讲者和他的狗一起变老了。尽管狗变老得更快，说话者也会变老——“我记得，”他说。我们也是如此，尤其是当我们看到自己的宠物变老而其他人（包括我们自己）变老时。在一起看和听弗罗斯特的小诗的过程中，我们一直在观察它的文字、声音和图像。我们一直在质疑它的意义和重要性。这些观察和问题使我们看到写作的这两个方面是如何联系在一起的。正如英国诗人亚历山大·波普 (Alexander Pope) 在 1711 年所写：“声音必须似乎是对感觉的回声。”加深对文学的欣赏和愉悦的另一种方法是放慢速度。慢慢地阅读更长、更雄心勃勃的作品，你会受益，就像你在《生命的跨度》中所做的那样。花点时间和他们在一起。不急于完成；也不应该急于解释。花点时间享受作者表达他或她的想法的方式，反思一部作品对你说的话，仔细思考你收集到的见解，并享受作者的手艺和艺术。例如，当我阅读感兴趣和有价值的东西时，我通常会将自己限制在每天一章，或者可能是 20 或 30 分钟的阅读时间，然后是 5 或 10 分钟的思考、反思和记笔记和问题。我喜欢的小说我是这样读的。一个例子：当我阅读 George Eliot 的 Middlemarch (1871-72) 时，经过一整天的工作，我每天晚上给自己分配一个小时，晚上睡觉前。在这样做的过程中，我在那个 19 世纪的环境中生活了一个多月，沉浸在书中的乡村氛围中。花时间让我消化艾略特对她角色的心理分析，陶醉于她复杂的情节和她对思考的哲学挑衅。一点一点。随你轻松。扩展您的阅读乐趣。在亨利·大卫·梭罗 (Henry David Thoreau) 的《瓦尔登湖 (Walden)》(1854 年) 中，这本书对圣雄甘地产生了深远的影响，我们建议我们“有意识地”阅读——衡量和考虑我们阅读的内容。梭罗建议我们在阅读一部作品时，应该像作者在写作时所采取的那种和谨慎程度一样，在《瓦尔登湖》的情况下，他在九年的时间里写了七次草稿。 “书籍，”他写道，“必须像他们写的那样刻意而谨慎地阅读。”现在，我不是建议你花九年时间阅读瓦尔登湖。然而，我主张你给予如此精雕细琢的书在内容和风格上应有的关注。例如，考虑梭罗书中的这句著名句子，无论是怎么说的，也是怎么说的：“如果一个人跟不上他的同伴，也许是因为他听到了不同的鼓手。让他跟随他听到的音乐，无论距离多远。现在这是一个关于个人主义的挑衅性想法，表达在一对精心制作的句子中；他们按照自己庄严的节奏行进，他们的美丽使梭罗的想法令人难忘。另一种提高阅读欣赏和理解的方法是大声阅读文本的某些部分 - 一个句子甚至整页。例如，大声朗读梭罗的句子将帮助你注意到在默读时你可能会错过的东西。耳朵（和声音）促使眼睛去看，吸收更多作家的手艺和艺术。阅读的艺术和写作的技巧都归功于耳朵和眼睛。在我邀请你大声朗读一段散文小说之前，我鼓励你回到弗罗斯特的“生命的跨度”并大声朗读它的两行。为什么？因为我想让你感觉到你的身体——尤其是你的嘴——当你大声说话时，说出第一句话是多么困难：“老狗向后吠叫，没有起床。”你有没有感觉到你的舌头抵在上颚发出 Ds 和 Gs 以及坚硬的 CK 声音？你有没有感觉到前五个音节的压力，然后句子加快了？现在在你的嘴里，在你的嘴唇和舌头上感受一下你可以多么轻松地说出它的第二行：“我记得他是一只小狗的时候。”我们用嘴唇在这条线上形成辅音。对于 R 和 W 以及“他”，我们只需用嘴吹气来发音。困难与容易。老狗了年轻的小狗。因此，请重新阅读并大声朗读，以获得更大的洞察力和乐趣。\n现在让我们以我答应你的散文为例。以下段落总结了“死者”，都柏林人 (1914) 的最后一个故事，詹姆斯·乔伊斯 (James Joyce) 的相关短篇小说集： 是的，报纸是对的：整个爱尔兰都下雪了。它落在黑暗的中央平原的每一个部分，在没有树木的山丘上，轻轻地落在艾伦沼泽上，再向西，轻轻地落入黑暗的动荡的香农波浪中。它也落在了埋葬迈克尔·弗瑞 (Michael Furey) 的孤寂墓地的每一处。它厚厚地漂浮在弯曲的十字架和墓碑上，在小门的长矛上，在贫瘠的荆棘上。他的灵魂慢慢地晕了过去，他听到雪在宇宙中轻轻飘落，如同末日降临一般，降临在所有生者和死者身上。乔伊斯对整个爱尔兰下雪的描述很精致，是一首抒情散文诗。我已经与数百名学生分享了这个结局，我自己总是不可避免地屈服于它纯粹的声音和节奏之美。我希望你喜欢大声朗读这一段的经历——感受它稳定的节奏，听到它重复的“坠落”，它在“弯曲的十字架”和“灵魂慢慢晕倒”中回荡的头韵，以及乔伊斯与雪的巧妙转变，首先“轻轻落下&#39;和&#39;轻轻落下&#39;，然后&#39;淡淡落下&#39;和&#39;轻轻落下&#39;。关于乔伊斯语言的这些少数观察触及了段落的语气和质地——它在这些节奏和重复中所携带的同情心。乔伊斯精湛的散文需要大声朗读才能被充分欣赏。我希望你同意，并会在你的阅读练习中加入大声阅读，以加深你的乐趣。好好读书会加深你对文学的欣赏；您将获得新的体验并丰富您对世界和其他人的了解。阅读愉快和愉快的一个关键是放慢速度，花时间仔细阅读。重读文学作品能让你重拾第一次错过的内容，加深阅读乐趣\n大声朗读，无论是一个句子还是整个页面，都将帮助您更多地了解作家的手艺和艺术，尤其是语气和质地如何补充意义。为了进一步展示从阅读文学作品中获得的洞察力和愉悦感、理解力、经验和智慧的回报（通过应用本指南中概述的策略），我邀请您和我一起阅读最近一篇文章的开头段落美国作家莱斯利·贾米森 (Leslie Jamison) 撰写的散文《满是灿烂的陌生人的街道》 (2019)，最初发表在大西洋杂志上，并在安德烈·艾席曼 (André Aciman) 编辑的《2020 年最佳美国散文集》中重印。以下是贾米森 (Jamison) 开始散文的方式：何时我年轻时，教堂的美丽永远属于其他人：信徒。他们看到了和我看到的一样的彩色玻璃，但是当它的宝石光将他们的皮肤切割成万花筒般的颜色时，他们不知何故以一种我永远不会的方式属于那种光。他们可以感觉到赞美诗的轻快和高亢，就像真理，集体的渴望，一个将他们与上帝联系起来的铁皮电话。这就是我告诉自己的。我告诉自己，我对这种美是陌生的——我永远不会成为一个潜伏在它的优雅之外的闯入者。让我们从对作者第一句话的一些观察开始。贾米森立即把我们安置在教堂里；她建议，在教堂里对人们来说是一种令人振奋的体验——一种美好的体验——但这种体验是她无法分享的。她用最后四个字和冒号的用法强调了这一点。贾米森坚持认为，这种美的体验属于“其他人：信徒”。她觉得不知何故被拒之门外。这是快速开始一篇论文的惊人承认。你可能像我一样想知道为什么会这样。贾米森稍后回答了我们的问题，但首先她告诉我们那些“其他人”的经历是怎样的，为我们提供了生动的细节，让我们可以想象那些“信徒”在教堂里看到和听到的美丽。具有讽刺意味的是，她注意到她看到的和他们看到的一样的彩色玻璃，生动地描述了它的“宝石般的光”和“万花筒般的色彩”。然而，在这样做的过程中，她将自己与其他信徒区分开来：“他们以某种方式属于”贾米森写道，“以我永远不会的方式”。再一次，你可能想知道为什么她不属于，也许为什么她暗示她不仅现在不属于，而且她不认为自己曾经属于过，因为曾经能够体验到美丽教会像信徒一样。我们可能会推测，这与信仰有关——与信仰有关——正是宗教信仰将贾米森与信徒以及他们在教堂中体验到的美的更深刻的情感体验区分开来。当然，我们不知道这一点，但考虑到贾米森将自己与信徒会众区分开来的方式，我们可以推断出这一点。到目前为止，我们已经完成了开头段落的一半。以这种方式放慢速度去注意和思考——提出问题——可能会让你思考，不仅是关于贾米森的教会经历，还有你自己的经历。贾米森的细节——首先是视觉，然后是听觉——很可能会唤起你记忆中的教堂经历的景象和声音（也许还有味道和气味）。这样，阅读的行为与你自己的生活和过去有关。也许你分享了贾米森为她描述的信徒想象的经历，或者相反，也许你分享了贾米森自我排斥的经历。或者，也许对这段话和它提示的问题的反思已经把你完全带到了其他方向。贾米森第一段中最引人注目的句子之一是第三句，关于声音的句子，她指出其他信徒可以感受到有节奏的“赞美诗的轻快和翱翔”。她想象，赞美诗唤起了信徒的感觉、情感，虽然不是贾米森，因为她再次将自己与她假设的信徒经历的“真相”和“集体渴望”分开。然而，关于声音和它们在教堂中唤起的东西的那句话还有更多的东西——另一个细节：“将它们与上帝联系起来的电话”。您是否注意到并想知道 Jamison 使用“锡罐”一词来描述电话吗？\n她用那个形容词让人联想到什么形象？你在这个词中听到了什么语气？或许有点不屑？当我们放慢阅读速度并重读一些句子以及大声朗读时，我们会注意到文本细节并提出有关它们的问题，因此我们将在此段落中进行我们之前在本指南中所做的工作。贾米森开头段落的最后两句转向了她告诉自己的话。为了强调，她用了这句话两次。贾米森告诉自己的是，她是一个“闯入者”，一个“外星人”的存在，她没有、不能、也永远不会分享教会信徒拥有的美丽体验，并指出她潜伏在“恩典之外”。用“恩典”这个词来结束一段关于在教堂中体验到的美是多么美好。这是一个沉重的词，一个适合宗教信仰和去教堂的语境，并且很好地捕捉到了贾米森所缺少的东西，她是如何缺乏恩典的仁慈礼物。当你读到这句结束语时，当你仔细思考贾米森在她的第一段中整体建议的重要性时，你可能想知道她接下来会写到哪里。你可能想知道是否还有其他形式的恩典可供她使用。我在教堂里的那个女孩的某个版本——她的腿太长了，不能穿牛仔工作服，手掌上覆盖着半月牙，她的指甲在她的皮肤上挖到了——几年后被召唤来进行另一种狂喜，由加里·温诺格兰德拍摄。那个女孩的某个版本被告知：这就是你所属的美丽。 我第一次进入布鲁克林博物馆 2019 年他的彩色摄影展览，它的部分力量是这种直接的邀请感，好像一扇门被雕刻在墙，通向某个新世界，现在我可以穿越进去——或者也许只是更清楚地看到我一直生活在那个神奇的世界里。它只是将自己伪装成某种熟悉或平庸的东西。首先，让我们注意那个长长的开场白的精彩，生动的细节，被夹在双破折号之间的描述更加突出。让我们也观察一下贾米森如何将她和我们带到另一个地方——布鲁克林博物馆，一个不同的崇高空间，贾米森和我们可以在其中体验与教堂和宗教信仰无关的美。\n......", "note_en": "There’s more to words than meets the eye. Deepen your appreciation of literature through the art of slow, attentive reading\n Have you ever wondered how some people see so much in what they read – whether they’re reading novels or stories, poems or plays, essays or memoirs, or something entirely different? One of the pleasures of reading literature well is the satisfaction of being tuned in to what a literary work shows and suggests – and to how it does those things. You probably already enjoy the ways that literary works entertain you, instruct you, move you. Recognising and understanding how they accomplish these things will enable you to deepen your appreciation still further and gain even more reward.\n From reading deeply, you gain experience as well as knowledge: you gain from reading literary works in all their unique particularity. You live other lives, undergo other ways of being in the world that, while differing from your own, speak, nonetheless, to your condition and that of the people around you. In the process of reading literature, we therefore enrich our understanding of other people and of the world – and of ourselves. We become, in some sense, what we read.\n You might wonder how to increase your enjoyment of literary works, how you might amplify literature’s value, and savour more fully the pleasures of language and form, of idea and insight that works of literature offer. In the following villanelle, I suggest how you might begin.\n  The art of reading isn’t hard to master, some say. But I say  au contraire; not so. It is no small achievement to read well,\n with intense absorption in the text. It requires attention and discernment. The art of reading takes effort to master.\n It requires reading many kinds of works, some easy, some more difficult. To read good books and read them truly well\n with skill and confidence, with ease and grace deepens understanding, makes one wise. To learn the art of reading – to become a master –\n read widely and deeply, re-read and read aloud, make observations, ask questions of what you read. It’s no small gain to read supremely well.\n It’s a skill for lifelong learning pleasure. Read for fun as well as learning – for delight. The art of reading takes some time to master, in pixels or in print. Go slow. Enjoy. Read well.\n To reap the benefits of reading literature with greater pleasure and appreciation, here are some of the most important things you can do:\n  Reading with insight and toward deeper understanding requires paying close attention, noticing as much as you can about the text from the beginning. Attending to a work carefully will prepare you to reflect on it, engage with it and ask questions. That’s the key – bring to bear your attentive, observant, questioning self on your reading.\n Consider the opening sentence of Leo Tolstoy’s great novel  Anna Karenina (1877), in its acclaimed 2000 translation by Richard Pevear and Larissa Volokhonsky: ‘All happy families are alike; each unhappy family is unhappy in its own way.’\n What you might notice about this sentence first, perhaps, is its parallel structure. Tolstoy’s line balances and contrasts happy families with unhappy ones. It asserts that they differ in how they experience happiness and unhappiness.\n OK. So that’s what Tolstoy posits as he launches his 800-page novel. He sets up an early expectation that his book will be about families, some happy and some unhappy. We need to read the book, of course, to find out what their happiness and unhappiness consists of, and how they became happy and unhappy families along the way.\n In reflecting on Tolstoy’s sentence, your thinking might take the form of questioning its assertion. You might qualify it, or perhaps hold in abeyance your agreement or disagreement. You might even imagine a reversal of what the sentence says, revising it this way: ‘All unhappy families are alike; each happy family is happy in its own way.’ Your careful observations about Tolstoy’s sentence will lead to questions, which will lead to reflection, which illustrates how you can engage actively with a writer’s work.\n  Reading with understanding, appreciation and pleasure requires  re-reading. Why is this so? Re-reading is critical because there are so many things going on in a work of literature that you can’t grasp them all in a single reading – no one can. You need time to notice and reflect; to revisit and re-see what’s there, to ensure that what you observed in your preliminary excursion through an essay or poem or story is indeed there. And you need an opportunity to see what you might have missed. In your second and subsequent traversals of a work, you’ll notice more, question more, think more, understand more, and in the process deepen your reading pleasure.\n   The old dog barks backward without getting up. I can remember when he was a pup.\n What do you notice on a quick first reading of these lines? Perhaps that they rhyme; Frost’s poem is a couplet. Next, that the poem describes a dog; in the present, an old dog. Seeing his ageing canine companion, the speaker remembers when he was a little pup. That’s it. There’s nothing more to it. Right?\n Well, not exactly – though that’s the gist of what the poem shows us. But what if you looked more carefully; what if you were to reflect a little on what the poem might be suggesting. Noticing involves listening as well as looking, so try to hear the poem in your inner ear. In addition to rhyme, you will hear a metrical beat, a rhythm to the words in each line. You hear and feel the slow motion of the first line, as the first five syllables are all stressed. You hear the first line moving with difficulty while the second line skips along. And though the second line looks shorter than the first visually, it contains only one less syllable.\n What might you make of these observations? You might ask yourself why the poet stresses heavily the words in the first line about the old dog, why he uses words with syllables that are hard to pronounce, and why he uses words and syllables that are easy to pronounce in the second line about the young pup. You might attend more carefully to the description of the old dog having difficulty getting up – barking ‘backward’ (a visual image). Doing so, you might notice the contrast between that difficult action and his movements as a pup. That youthful image is not given us by the poet, but it’s implied so that we might imagine it.\n Finally, what do you notice about the poem’s title, ‘The Span of Life’? Has Frost given us in two brief lines an image and example of a life span – the life span of his dog? Yes, of course. But he gives us something more as well: he invites us to consider not just  a span of life – the dog’s – but  the span of life, which includes the span of life of the poem’s human speaker. After all, the speaker has aged, too, along with his dog. And though the dog ages faster, the speaker ages as well – ‘I can remember,’ he says. And so do we, especially if we have seen our own pets age and other people age, including ourselves.\n In looking at and listening to Frost’s little poem together, we’ve been making observations about its words and sounds and images. And we’ve been raising questions about its meaning and significance. Those observations and questions lead us to see how these two aspects of writing are connected. As the English poet Alexander Pope wrote in 1711: ‘The sound must seem an echo to the sense.’\n  Another way to deepen your appreciation and pleasure in literature is to  slow down. You will benefit from a slow reading of longer, more ambitious works, just as you did with ‘The Span of Life’. Take your time with them. There’s no rush to finish; and there should be no rush to interpretation either. Take time to enjoy the way the writer presents his or her thinking, to reflect on what a work is saying to you, to mull over the insights you glean and to enjoy the writer’s craft and art.\n When I’m reading something of interest and value, I will often limit myself to one chapter a day, for example, or perhaps 20 or 30 minutes of reading time followed by five or 10 minutes to think, reflect and jot notes and questions. Novels I love I read this way. An example: when I read George Eliot’s  Middlemarch (1871-72), after a long day’s work, I allotted myself one hour per evening, late at night just before bedtime. In so doing, I lived in that 19th-century milieu for more than a month, soaking up and savouring the book’s country village atmosphere. Taking my time allowed me to digest Eliot’s psychological analysis of her characters, to revel in her complex plotting and her philosophical provocations to thinking. A little at a time. Easy as you go. Stretch out your reading pleasure.\n In Henry David Thoreau’s  Walden (1854), a book that profoundly influenced Mahatma Gandhi, we’re advised to read ‘deliberately’ – weighing and considering what we read. Thoreau suggests that we give to our reading of a work the same kind and degree of care that the author took in writing it, which in the case of  Walden was seven drafts over nine years. ‘Books,’ he writes, ‘must be read as deliberately and reservedly as they were written.’ Now, I’m not suggesting you take nine years to read  Walden. I am advocating, however, that you give such a finely crafted book the attention it deserves for both its content and its style. For example, consider this well-known sentence from Thoreau’s book, both for what it says and how it says it: ‘If a man does not keep pace with his companions, perhaps it is because he hears a different drummer. Let him step to the music which he hears, however measured or far away.’ Now that’s a provocative idea about individualism, couched in a pair of elegantly crafted sentences; they march to their own stately rhythm, and their beauty makes Thoreau’s idea memorable.\n  Yet another way to heighten your reading appreciation and understanding is to  read some parts of the text aloud – a sentence or even an entire page. Reading Thoreau’s sentence aloud, for example, will help you notice things you’re likely to miss during silent reading. The ear (and voice) prompt the eye to see, absorb more of the writer’s craft and art. The art of reading and the craft of writing owe as much to the ear as to the eye. Before I invite you to read aloud a paragraph of prose fiction, I encourage you to return to Frost’s ‘The Span of Life’ and to read its two lines aloud. Why? Because I want you to feel in your body – in your mouth especially – as you speak the words aloud, how hard it is to speak the first line: ‘The old dog barks backward without getting up.’ Did you feel your tongue against your palate enunciating the Ds and Gs and hard CK sounds? Did you feel the stress on the first five syllables, and the sentence speed up afterwards?\n Now feel in your mouth and on your lips and tongue how easily you can speak its second line: ‘I can remember when he was a pup.’ We form the consonants in this line with our lips. And for the R and W and ‘he’, we simply blow air through our mouths to pronounce. Hard versus easy. Old dog. Young pup. So re-read and read aloud for greater insight and pleasure.\n Let’s now take up the prose example I promised you. The following paragraph concludes ‘The Dead’, the final story in  Dubliners (1914), a collection of linked short stories by James Joyce:\n Yes, the newspapers were right: snow was general all over Ireland. It was falling on every part of the dark central plain, on the treeless hills, falling softly upon the Bog of Allen and, farther westward, softly falling into the dark mutinous Shannon waves. It was falling, too, upon every part of the lonely churchyard where Michael Furey lay buried. It lay thickly drifted on the crooked crosses and headstones, on the spears of the little gate, on the barren thorns. His soul swooned slowly as he heard the snow falling faintly through the universe and faintly falling, like the descent of their last end, upon all the living and the dead.\n Joyce’s description of the snow falling throughout Ireland is exquisite, a lyrical prose poem. I have shared this ending with hundreds of students, always inevitably succumbing, myself, to its sheer beauty of sound and rhythm. I hope you enjoyed the experience of reading the paragraph aloud – feeling its steady rhythm, hearing its repetition of ‘falling’, its echoing alliterations in ‘crooked crosses’ and ‘soul swooned slowly’, and Joyce’s nifty shift with the snow, first ‘falling softly’ and ‘softly falling’, and then ‘falling faintly and ‘faintly falling’.\n These few observations about Joyce’s language touch on the tone and texture of the passage – the compassion it carries in those rhythms and repetitions. Joyce’s masterful prose needs to be read aloud to be fully appreciated. I hope you agree, and will add reading aloud to your repertoire of reading practices to deepen your pleasure.\n Reading well will deepen your appreciation of literature; you’ll gain new experiences and enrich your knowledge of the world and other people.\n  One key to reading well and pleasurably is to slow down, take your time and read deliberatively.\n Re-reading literary texts will allow you to pick up on what you missed the first time around and deepen your reading pleasure\n Reading aloud, whether a sentence or an entire page, will help you notice more about a writer’s craft and art, especially how the tone and texture complement the meaning.\n To further demonstrate the rewards – of insight and pleasure, of understanding, experience and wisdom – to be reaped from reading literature well (by applying the strategies outlined in this Guide), I invite you to read along with me the opening paragraphs of a recent  essay, ‘A Street Full of Splendid Strangers’ (2019), by the American writer Leslie Jamison, originally published in  The Atlantic magazine, and reprinted in André Aciman’s edited  collection  The Best American Essays  2020. Here is how Jamison begins her essay:\n When I was young, the beauty of church always belonged to other people: the believers. They saw the same stained glass I saw, but when its jewelled light cut their skin into kaleidoscopic colours, they somehow belonged in that light in a way I never would. They could feel the lilt and soar of the hymns as truth, as collective yearning, as a tin-can telephone connecting them to God. That’s what I told myself. I told myself I was alien to that beauty – I’d never be anything but an interloper lurking just outside its grace.\n Let’s begin with a few observations about the writer’s first sentence. Jamison immediately places us in church; she suggests that being in church can be uplifting for people – a beautiful experience – but that this experience is one she does not share. She emphasises this point with her last four words and her use of the colon. This experience of beauty, Jamison insists, belongs to ‘other people: the believers’. She feels somehow shut out from that experience. That’s a striking admission for jump-starting an essay. You might wonder, as I did, why that might be the case. Jamison answers our question later, but first she tells us what the experience is like for those ‘others’, providing us with vivid details so we can imagine what those ‘believers’ see and hear of beauty in church.\n Ironically, she notes that she sees the same stained glass they see, describing vividly its ‘jewelled light’ and ‘kaleidoscopic colours’. In doing so, however, she separates herself from those other believers: ‘they somehow belonged’ Jamison writes, ‘in a way I never would’. Here, again, you might wonder why she doesn’t belong, and perhaps why she suggests that she not only doesn’t belong now, but that she doesn’t see herself as ever belonging, as ever being able to experience the beauty of church as believers do. We might surmise that it has something to do with belief – with faith – and that it is religious faith that separates Jamison from the believers and their more deeply emotional experience of the beauty they experience in church. We don’t know that, of course, but we might infer it, given the way Jamison distinguishes herself from the congregation of believers.\n So far, we’re about halfway through that opening paragraph. Slowing down this way to notice and wonder – to ask questions – will likely get you thinking, not only about Jamison’s church experience, but also about your own. Jamison’s details – first visual, then aural – might well evoke the sights and sounds (and perhaps also the tastes and smells) of your own remembered church experiences. In this way, the act of reading is connected with your own life and past. Perhaps you share in the experiences Jamison imagines for the believers she describes or, conversely, perhaps you share Jamison’s experience of self-exclusion. Alternatively, maybe reflection on this passage and the questions it prompts have taken you in other directions entirely.\n One of the most striking sentences in Jamison’s first paragraph is the third, the sentence about sounds, where she notes that those other believers could feel the rhythmic ‘lilt and soar of the hymns’. The hymns, she imagines, evoke feeling, emotion, for the believers, though not for Jamison, as she once again separates herself from the ‘truth’ and the ‘collective yearning’ she presumes those believers experience. That sentence about sounds and what they evoke in church, however, has something more in it – another detail: the ‘telephone connecting them to God’. Did you notice and wonder about Jamison’s use of the word ‘tin-can’ to describe the telephone?\n What image does she conjure with that adjective? What tone do you hear in that word? A little disdain, perhaps?\n We’re undertaking here with this passage what we did earlier in this Guide, as we noticed textual details and raised questions about them, as we slowed down our reading and re-read some sentences, and as we read aloud.\n The last two sentences of Jamison’s opening paragraph pivot to what she told herself.\n She uses that phrase twice, for emphasis. And what Jamison tells herself is that she’s an ‘interloper’, an ‘alien’ presence, who does not, cannot, and will never share the experience of beauty that the church’s believers possess, noting that she lurks ‘just outside its grace’.\n And what a word that is, ‘grace’, to conclude a paragraph about the beauty experienced in church. It’s a loaded word, one appropriate in the context of religious belief and churchgoing, and one that captures well what Jamison is missing, how she lacks the benevolent gift of grace. As you read this concluding sentence, and as you mull over the significance of what Jamison is suggesting in her first paragraph overall, you might wonder where she will go next with her essay. You might wonder whether there could be some other form of grace available to her.\n  Some version of that girl I’d been in church – with legs too long for her denim overalls, and palms covered with half-moon crescents where she’d dug her nails into her skin – was summoned for a different rapture, years later, by the photography of Garry Winogrand. Some version of that girl was told:  This is beauty you belong in. The first time I entered the Brooklyn Museum’s 2019 exhibit of his colour photography, part of its force was this immediate sense of invitation, as if a door had been carved in a wall, leading to some new world, and now I could cross into it – or perhaps simply see more clearly that I’d been living in that miraculous world all along. It had only disguised itself as something familiar, or banal.\n Let’s note, first, the splendid, vivid details of that long opening sentence, the description heightened by being sandwiched between the double dashes. Let’s observe, too, how Jamison takes herself and us to another place – to the Brooklyn Museum, a different kind of sublime space, one in which Jamison, and we, can experience beauty unconnected to church and religious faith. \n......", "posttime": "2021-07-22 22:05:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "阅读,gain", "title": "如何从阅读中获得更多", "title_en": "How to gain more from your reading", "transed": 1, "url": "https://psyche.co/guides/how-to-gain-more-from-reading-by-taking-it-all-in-more-slowly", "via": "", "real_tags": ["阅读", "gain"]}, {"category": "", "categoryclass": "", "imagename": "cb897a30f2ca9b80eb8ae62281807e1f.png", "infoid": 1068852, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为一个年轻人，我想帮助制作一种新媒体，这将比数百年前古腾堡的发明向前迈进了一步。通过在数字时代建立一个万能图书馆，我认为机会不仅仅是让世界上的每个人都可以使用它，而是让它变得更好——比纸更智能。通过使用计算机，我们可以使图书馆不仅可搜索，而且可组织；使您可以浏览数百万甚至数十亿的网页。第一步是制造适用于大量富媒体的计算机。接下来是创建一个可以接入世界各地计算机的网络：成为互联网的阿帕网。接下来是增强智能，后来被称为搜索引擎。然后，我帮助建立了 WAIS——广域信息服务器——帮助出版商上网以锚定这个新的开放系统，它被万维网包围。这个图书馆将拥有人类所有已发表的作品。这个图书馆不仅适用于那些支付 LexusNexus 收费的每分钟 1 美元的人，或者只适用于最精英的大学。这将是一个可供世界上任何地方的任何人使用的图书馆。我们能不能更进一步发挥图书馆的作用，让每个人的作品都能被收录——不仅仅是那些有纽约图书合同的人？我们能否建立一个不仅包含文字，还包含歌曲、食谱、游戏和视频的多媒体档案？我们能让任何人在一百年后了解他们的祖母吗？从一开始，互联网档案馆就必须是一个非营利组织，因为它包含其他所有人的东西。它的动机必须是透明的。它必须持续很长时间。在硅谷，目标是找到一个有利可图的退出方式，无论是通过收购还是 IPO，然后去做你的下一件事。那从来都不是我的目标。互联网档案馆的目标是为网络创建一个永久的记忆，可以用来创造一个新的全球思维。随着时间的推移，在数据中寻找模式，为我们提供新的见解，远远超出您使用搜索引擎所能做到的。不仅要成为历史参考，还要成为互联网脉搏的活生生的一部分。在早期的 Web 中，我们看到人们试图建立一个更加民主的系统。人们试图使出版更具包容性。\n我们还看到了人类的其他部分：色情制作者、诈骗者、垃圾邮件发送者和巨魔。他们也看到了在这个新世界实现梦想的机会。归根结底，互联网和万维网只有我们自己。这只是人类的历史。这是一个共享和开放的实验。万维网的最佳状态是人们分享他们所知道的东西，几乎总是免费的，无论您身在何处，都可以找到自己的社区。在接下来的 25 年里，我们面临着截然不同的挑战。它正在解决我们现在看到的互联网的一些大问题。这是我们的媒介还是他们的媒介？它是用于一小群控制性组织还是一种共同利益，一种公共资源？我们中的许多人都相信网络可以找到食谱、如何修理割草机、在哪里买新鞋、约会对象。信任可能是我们拥有的最宝贵的资产，浪费这种信任将是一场全球灾难。我们可能还没有实现对所有知识的普遍访问，但我们仍然可以。再过 25 年，我们可以永远保存 10 亿人而不是 1 亿人的著作。我们可以拥有不受广告模式驱动的薪酬系统，这些模式只会丰富少数人。我们可以拥有一个拥有众多赢家的世界，人们参与其中，找到志同道合的社区，他们可以向世界各地学习。我们可以创建一个让我们感到掌控的互联网。\n我相信我们可以共同建设这个未来。您已经帮助 Internet Archive 构建了这个未来。在过去的 25 年里，我们积累了数十亿页、70 PB 的数据以提供给下一代。让我们以新的和令人兴奋的方式向他们提供它。让我们成为未来二十五年的建设者和梦想家。请在announcement.archive.org 上查看获取知识关键时刻的时间表、视频和参加我们 25 周年虚拟庆祝活动的邀请。", "note_en": "As a young man, I wanted to help make a new medium that would be a step forward from Gutenberg’s invention hundreds of years before.\n By building a Library of Everything in the digital age, I thought the opportunity was not just to make it available to everybody in the world, but to make it  better–smarter than paper. By using computers, we could make the Library not just searchable, but organizable; make it so that you could navigate your way through millions, and maybe eventually billions of web pages.\n The first step was to make computers that worked for large collections of rich media. The next was to create a network that could tap into computers all over the world: the Arpanet that became the Internet. Next came augmented intelligence, which came to be called search engines. I then helped build  WAIS–Wide Area Information Server–that helped publishers get online to anchor this new and open system, which came to be enveloped by the World Wide Web.\n  This library would have all the published works of humankind. This library would be available not only to those who could pay the $1 per minute that LexusNexus charged, or only at the most elite universities. This would be a library available to anybody, anywhere in the world. Could we take the role of a library a step further, so that everyone’s writings could be included–not only those with a New York book contract? Could we build a multimedia archive that contains not only writings, but also songs, recipes, games, and videos? Could we make it possible for anyone to learn about their grandmother in a hundred years’ time?\n   From the beginning, the Internet Archive had to be a nonprofit because it contains everybody else’s things. Its motives had to be transparent. It had to last a long time.\n In Silicon Valley, the goal is to find a profitable exit, either through acquisition or IPO, and go off to do your next thing. That was never my goal. The goal of the Internet Archive is to create a permanent memory for the Web that can be leveraged to make a new Global Mind. To find patterns in the data over time that would provide us with new insights, well beyond what you could do with a search engine.  To be not only a historical reference but a living part of the pulse of the Internet.\n    In the early Web, we saw people trying to make a more democratic system work. People tried to make publishing more inclusive.\n We also saw the other parts of humanity: the pornographers, the scammers, the spammers, and the trolls. They, too, saw the opportunity to realize their dreams in this new world. At the end of the day, the Internet and the World Wide Web–it’s just us. It’s just a history of humankind. And it has been an experiment in sharing and openness.\n The World Wide Web at its best is a mechanism for people to share what they know, almost always for free, and to find one’s community no matter where you are in the world.\n   Over the next 25 years, we have a very different challenge. It’s solving some of the big problems with the Internet that we’re seeing now. Will this be our medium or will it be theirs? Will it be for a small controlling set of organizations or will it be a common good, a public resource?\n So many of us trust the Web to find recipes, how to repair your lawnmower, where to buy new shoes, who to date. Trust is perhaps the most valuable asset we have, and squandering that trust will be a global disaster.\n We may not have achieved Universal Access to All Knowledge yet, but we still can.\n In another 25 years, we can have writings from not a hundred million people, but from a billion people, preserved forever. We can have compensation systems that aren’t driven by advertising models that enrich only a few.\n We can have a world with many winners, with people participating, finding communities of like-minded people they can learn from all over the world.  We can create an Internet where  we feel in control.\n I believe we can build this future together. You have already helped the Internet Archive build this future. Over the last 25 years, we’ve amassed billions of pages, 70 petabytes of data to offer to the next generation. Let’s offer it to them in new and exciting ways. Let’s be the builders and dreamers of the next twenty-five years.\n See a timeline of Key Moments in Access to Knowledge, videos &amp; an invitation to our 25th Anniversary Virtual Celebration at  anniversary.archive.org.", "posttime": "2021-07-22 22:05:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "互联网,internet,图书馆", "title": "互联网档案馆 25 周年的反思", "title_en": "Reflections as the Internet Archive turns 25", "transed": 1, "url": "https://blog.archive.org/2021/07/21/reflections-as-the-internet-archive-turns-25/", "via": "", "real_tags": ["互联网", "internet", "图书馆"]}, {"category": "", "categoryclass": "", "imagename": "1e8a0870c57561829093f37490f9a87e.jpg", "infoid": 1068851, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "查看即使你付钱，你仍然是Odysee上的产品", "note_en": "View Even if you’re paying, you’re still the product on Odysee", "posttime": "2021-07-22 22:05:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "付钱,paying,查看", "title": "即使你付钱，你仍然是产品", "title_en": "Even if you’re paying, you’re still the product", "transed": 1, "url": "https://odysee.com/@CyberLounge:a/even-if-youre-paying-youre-still-the-product:7", "via": "", "real_tags": ["付钱", "paying", "查看"]}, {"category": "", "categoryclass": "", "imagename": "1e0b0626b278d1f9fb79fcc0f2ab4e42.jpg", "infoid": 1068850, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由 Julia Renate Ingebrigtsen、Knut Eivind Straume 和 Simen Grytøyr 撰写、开发和呈现 出版时间：2021 年 7 月 9 日 点击获取挪威语版本", "note_en": "Skrevet, utviklet og presentert av  Julia Renate Ingebrigtsen,  Knut Eivind Straume og  Simen Grytøyr  Publisert: 9. juli 2021   Click for English version", "posttime": "2021-07-22 22:05:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "utoya,挪威语", "title": "挪威 Utoya 大屠杀 10 周年", "title_en": "10 years since the Utoya massacre in Norway", "transed": 1, "url": "https://www.vg.no/spesial/2021/22-juli/", "via": "", "real_tags": ["utoya", "挪威语"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068849, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尝试 microk8s enable --help 以获取可用服务和可选功能的列表。 microk8s disable &lt;name&gt; 关闭服务。如果您主要使用 MicroK8s，您可以使用别名 mkctl=&quot;microk8s kubectl&quot; 将我们的 kubectl 设为命令行上的默认值。由于它是标准的上游 kubectl，您还可以通过 --kubeconfig 参数指向相应的 kubeconfig 文件来驱动其他 Kubernetes 集群。 Kubernetes 是一个系统服务的集合，它们一直在相互通信。如果您不需要它们在后台运行，那么您可以通过停止它们来节省电池电量。 microk8s start 和 microk8s stop 将为您完成工作。尝试 microk8s enable --help 获取内置的可用服务列表。 microk8s disable 关闭服务。如果您主要使用 MicroK8s，则可以在命令行上运行本地 Windows 版本的 kubectl。 Kubernetes 是一个系统服务的集合，它们一直在相互通信。如果您不需要它们在后台运行，那么您可以通过停止它们来节省电池电量。 microk8s start 和 microk8s stop 将为您完成工作。尝试 microk8s enable --help 获取内置的可用服务列表。 microk8s disable 关闭服务。\n如果您主要使用 MicroK8s，则可以在命令行上运行原生 macOS 版本的 kubectl。 Kubernetes 是一个系统服务的集合，它们一直在相互通信。如果您不需要它们在后台运行，那么您可以通过停止它们来节省电池电量。 microk8s start 和 microk8s stop 将为您完成工作。 MicroK8s 会自动为 Kubernetes 数据存储选择最佳节点。当您丢失一个集群数据库节点时，会提升另一个节点。您的防弹边缘不需要管理员。 MicroK8s 很小，具有“正常工作”的合理默认值。快速安装、轻松升级和出色的安全性使其非常适合微云和边缘计算。作为 MicroK8s 的发布者，我们提供世界上最高效的多云、多架构 Kubernetes。在手机塔下。在赛车上。在卫星或日常设备上，MicroK8s 在物联网和微云上提供完整的 Kubernetes 体验。安装、集群，然后看着它飞起来。如果需要，您可以配置 MicroK8s。大多数人不会打扰。\n默认情况下，MicroK8s 会自动应用安全更新，如果您愿意，可以推迟它们。使用单个命令升级到更新版本的 Kubernetes。这真的很容易。人们喜欢 Docker 镜像，因为它们没有移动部件，以实现更好的安全性和更简单的操作。 MicroK8s 也在一个不可变的容器中运行，所以你的 Kubernetes 本身是完全容器化的。这听起来像是一个无限循环，但效果很好。 MicroK8s 默认使用最广泛使用的 Kubernetes 选项，因此它“正常工作”而无需配置。网络、存储和标准服务都是开箱即用的，具有同类最佳的默认设置。将 GPU 传递给 docker 应用程序以进行深度学习。在您的工作站上使用 Kubeflow 定义 AI 管道。我们与 Amazon、Azure、Google、Oracle 和 IBM 合作，以简化多云 GPU 支持。在 MicroK8s 上本地构建和测试，然后放心地部署到 EKS、AKS 或 GKE。 Prometheus 在指标方面很受欢迎，因此我们将其捆绑在一起。就像 Jaeger、Istio、LinkerD 和 KNative。\n仅选择稳定的安全版本，或尝试发布候选版本、测试版和每日版本。 MicroK8s 可以自动更新，失败回滚。坚持使用主要版本，或遵循最新的上游工作。顺其自然，或在企业中进行控制以完美精确地指定版本。所以你的 CI/CD 机器为每次测试运行启动一个干净的 VM？只需在脚本顶部安装 MicroK8s，即可使用清晰、干净的 K8s 来运行您的测试。 Microk8s 由 Canonical 的 Kubernetes 团队构建。我们与公共云 K8s 团队合作，也有我们自己的两个 K8s 发行版。 MicroK8s 是在轨和固执己见，用于零操作体验。我们还制作了 Charmed Kubernetes，用于完全控制 Kubernetes 组件的所有排列。", "note_en": "Try  microk8s enable --help for a list of available services and optional features.  microk8s disable &lt;name&gt; turns off a service.\n  If you mainly use MicroK8s you can make our kubectl the default one on your command-line with  alias mkctl=&#34;microk8s kubectl&#34;. Since it is a standard upstream kubectl, you can also drive other Kubernetes clusters with it by pointing to the respective kubeconfig file via the  --kubeconfig argument.\n    Kubernetes is a collection of system services that talk to each other all the time. If you don’t need them running in the background then you will save battery by stopping them.  microk8s start and  microk8s stop will do the work for you.\n  Try  microk8s enable --help for a list of available services built in. microk8s disable turns off a service.\n  If you mainly use MicroK8s you can run the native Windows version of kubectl on your command-line.\n    Kubernetes is a collection of system services that talk to each other all the time. If you don’t need them running in the background then you will save battery by stopping them.  microk8s start and  microk8s stop will do the work for you.\n  Try  microk8s enable --help for a list of available services built in.  microk8s disable turns off a service.\n  If you mainly use MicroK8s you can run the native macOS version of kubectl on your command-line.\n    Kubernetes is a collection of system services that talk to each other all the time. If you don’t need them running in the background then you will save battery by stopping them.  microk8s start and  microk8s stop will do the work for you.\n  MicroK8s automatically chooses the best nodes for the Kubernetes datastore. When you lose a cluster database node, another node is promoted. No admin needed for your bulletproof edge.\n  MicroK8s is small, with sensible defaults that ‘just work’. A quick install, easy upgrades and great security make it perfect for micro clouds and edge computing.\n    As the publishers of MicroK8s, we deliver the world’s most efficient multi-cloud, multi-arch Kubernetes.\n  Under the cell tower. On the racecar. On satellites or everyday appliances, MicroK8s delivers the full Kubernetes experience on IoT and micro clouds.\n  Install, cluster, and then just watch it fly. You can configure MicroK8s if you want. Most people don’t bother.\n  MicroK8s will apply security updates automatically by default, defer them if you want. Upgrade to a newer version of Kubernetes with a single command. It’s really that easy.\n  People love Docker images because they have no moving parts, for better security and simpler ops.\n  MicroK8s also runs in an immutable container, so your Kubernetes itself is fully containerised. It sounds like an infinite loop, but it works quite nicely.\n  MicroK8s defaults to the most widely used Kubernetes options, so it ‘just works’ with no config necessary. Networking, storage and standard services are all provided out of the box with best of breed defaults.\n  Pass GPUs to docker apps for deep learning. Define AI pipelines with Kubeflow on your workstation.\n  We work with Amazon, Azure, Google, Oracle and IBM to simplify multi-cloud GPU enablement. Build and test locally on MicroK8s, then deploy to EKS, AKS or GKE with confidence.\n  Prometheus is popular for metrics, so we bundled it. Just like Jaeger, Istio, LinkerD and KNative.\n  Choose stable security releases only, or try release candidates, betas and daily builds. MicroK8s can update automatically, with rollback on failure.\n  Stick with a major version, or follow the latest upstream work. Go with the flow, or take control in the enterprise to specify versions with perfect precision.\n  So your CI/CD machine spins up a clean VM for each test run? Just install MicroK8s at the top of your script for a crisp, clean K8s to run your tests.\n    Microk8s is built by the  Kubernetes team at Canonical. We work with public cloud K8s teams, and also have two K8s distributions of our own. MicroK8s is on-rails and opinionated, for the zero-ops experience. We also make  Charmed Kubernetes for total control of all the permutations of Kubernetes components.", "posttime": "2021-07-22 22:04:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "物联网,最小化,ops,kubernetes", "title": "MicroK8s – 低操作、最小化 Kubernetes，适用于云、集群、边缘和物联网", "title_en": "MicroK8s – Low-ops, minimal Kubernetes, for cloud, clusters, Edge and IoT", "transed": 1, "url": "https://microk8s.io/", "via": "", "real_tags": ["物联网", "最小化", "ops"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068848, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "关于各种版本的 Computer Modern 字体", "note_en": "About the various version of the Computer Modern fonts", "posttime": "2021-07-22 22:04:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "字体,font,computer", "title": "LaTeX 字体目录", "title_en": "The LaTeX Font Catalogue", "transed": 1, "url": "https://tug.org/FontCatalogue/", "via": "", "real_tags": ["字体", "font", "computer"]}]