[{"category": "", "categoryclass": "", "imagename": "2fdcee65d540adb6e8458d53170ca601.png", "infoid": 1067928, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "......或者很难写出两年前完成的项目\n      长话短说，这是一篇关于我在2019年7月在...的另一个定制机器的帖子......\n 是的，我知道......有点旧的故事，但我以前写过，机器和照片是堆叠的，而我继续前进到其他项目，这些是在队列中等待。\n 无论如何，我意识到我需要赶上我所做的所有旧工作，因为我很快就会忘记所有关于哈哈的东西！\n  在这个特定的Acorn Archimedes A3020之前，我用A3000玩了一点，即Bachoo / SaveTefloppy（旧证据警告）带来了固定。这是一个很好的机器，但我几乎没有机会用它玩它，因为一个很容易。特定的A3000不想与监视器合作，Bachoo不知道如何对其进行解决。此外，他会把它交给另一个没有clue如何使用duckduckgo.com这样的Interwebz搜索引擎的人\n 如果我记得正确，修复程序就是抑制“删除”键重置CMOS或'T'，如startdot.org.uk论坛所述\n               正如我所说，有明显的事情是必须做的，如清理套接字周围的腐蚀和rTC电池区域周围。这次我尝试过草酸，因为它是水溶性的，便宜的，轻度。它结果适度正常，因为它没有像其他酸一样创造复杂的铜化合物，但是，我将在未来寻找其他更好的解决方案。这是它的完成。 \n有一些腐蚀的痕迹必须固定，显然是强制性的覆盖那些泄漏和磨损的电解质帽。\n            键盘在符号中是固定的。实际上，它只需要脱黄，因为它是电子方式的。无论如何，这是它看起来的看法。\n           我不得不修理连接器，因为它有点疲惫不堪，并没有服务于其目的。通过切断一小位的原始膜连接器，键盘工作很容易实现。\n     对于这个特定的单位，我已经订购了RAM升级套件和RTC电池MOD，从寄射锁定标记。像往常一样，标记套件和产品很棒，具有详细的安装手册等。\n   我所要做的就是将RAM芯片放入插座并根据手动设置跳线 - 轻松\n          我想使用标准的CF2IDE适配器以及CF卡作为硬盘替代品。\n  这部分有点棘手，因为我不是橡子专家。在悲惨地失败之后，我已经开始寻找一些帮助。拯救的丁丁特论坛！耶！ \n这个mod有两个主要问题。首先，我不得不弄清楚一个正确设置CF卡的方法，所以它可以在RISC OS 3.1下工作。起初，我以为我可以轻松地在Linux（这是可行的）下进行，但事实证明还有另一种方式 -  Raspberry PI运行RISC OS 5！我从未有过这个操作系统的opprotunity，所以我就像......\n  如何在令人敬畏的Startdot论坛上详细进行伟大的教程，显然是令人敬畏的。论坛上的伙计们将我指向一个我可以刻录的图像来测试我的设置。\n  它有点努力，但无论我的努力如何，我所遇到的只是这个令人讨厌的错误弹出。\n  这就是Stardot论坛上另一个线程的地方帮助了我很多。首先，我不得不修改适配器一点。这是通过向其添加二极管并在CF2ADE适配器上连接销30和32来完成的。\n    我设法测试了四张不同的CF卡，但错误仍然存​​在，所以我又决定再试一次，最后一次和使用4GB的SanDisk超CF卡这次从Speccy Devices汲取了课程\n      一旦被整理出来，我就开始寻找一种方式来安装适配器和Archie内的卡。\n 我认为我可以3D打印一个简单的支架并将其拧在内部。遵循快速设计和3D打印会话。 （STL文件在帖子底部提供） \n我必须做的就是完成它，是为了在一个迷人的封面上为CF卡制作一个洞。  通过设计和3D打印简单适配器，容易实现该部分。 （STL文件在帖子底部提供）  我在原始软盘按钮上粘在原始软盘上，以防所有者想要返回原始状态。  Acorn Archimedes A3020已准备好玩。 在将其运送到新所有者之前，我用这台机器播放了一些。 在一些图片下方和一个短视频，显示了这台计算机的能力。  如果您想获得复古装备我正在制造或硬件模块，请访问商店 - ＆gt; https://retrohax.net/shop/  如果你想捐一台死锁，那么我会给我发一封电子邮件。 极端案例受到欢迎。 - 没有人捐赠任何东西。 所以不要打扰。 看起来只有YouTubers获得所有好吃的Lolol; P < - 这不再是真的！ 从巴西😀的家伙欢呼 ", "note_en": "… or it is seriously hard to write about a project that was finished two years ago\n      Long story short, this is a post about another custom-ordered machine that I worked on … in July of 2019 …\n Yeah, I know … a bit old story but like I’ve written before, machines and pics are piling while I move on to other projects and these are waiting in a queue.\n Anyway, I’ve realized that I need to catch up with all the older jobs that I did simply because I will soon forget what it was all about lol!\n  Before this particular Acorn Archimedes A3020, I’ve played a bit with the A3000 that Bachoo/ SaveTheFloppy (old cert warning) brought for fixing. It is a nice machine but I barely had an opportunity to play with it as a fix was very easy. That particular A3000 didn’t want to co-operate with the monitor and Bachoo didn’t know how to sort it out. Moreover, he’d give it to another guy who had no clue how to use interwebz search engines like  duckduckgo.com either 😉\n If I remember correctly the fix was about holding down either the ‘Delete’ key to reset CMOS or ‘T’ as described on  startdot.org.uk forums\n               As I said, there were obvious things that had to be done, like cleaning up the corrosion around the sockets and around the RTC battery area. This time I’ve tried Oxalic acid as it is water-soluble, cheap, and mild. It turned out moderately OK since it does not create complex copper compounds like other acids, however, I will be looking for other, better solutions in the future. Here is how it was done.\n       There were some corroded traces that had to be fixed and obviously, a mandatory recap of those leaking and worn-out electrolytic caps.\n            The keyboard was next in line to be fixed. Actually, it only needed de-yellowing as it was electronically OK. Anyway, here is how it looked.\n           I had to fix the connector as it was a bit worn out and didn’t serve its purpose. That was easily achieved by cutting off a tiny bit of an original membrane connector and the keyboard was working.\n     For this particular unit, I’ve ordered a RAM upgrade KIT and RTC battery mod from  Mark of retroclinic. As usual, Marks KITs and products are awesome with detailed installation manuals, etc.\n   All I had to do is to put RAM chips into sockets and set up jumpers according to the manual – easy\n          I wanted to use a standard CF2IDE adapter along with a CF card as a hard drive substitute.\n  That part was a bit tricky as I am not an expert in Acorns. After failing miserably to set it all up, I’ve started looking for some help. S tartdot forums to the rescue! YaY!\n There were two main issues with this mod. First, I had to figure out a way to properly set up a CF card so it could work under RISC OS 3.1. At first, I thought that I can do it easily under Linux (which is doable) but it turned out that there is another way – Raspberry PI running RISC OS 5! I’ve never had an opprotunity to play with this OS so I was like…\n  There is a great tutorial on how to do it in detail on  awesome startdot forums obviously. Guys on forums pointed me to an image that I can burn to test my setup out.\n  It kinda worked but regardless of my efforts, all I was getting was this annoying error pop-up.\n  This is where another thread on  stardot forums helped me a lot. First, I had to modify my adapter a bit. That was done by adding a diode to it and connecting pins 30 and 32 on a CF2IDE adapter.\n    I’ve managed to test four different CF cards but the error was still there so I’ve decided to test it one more, last time and used a 4GB SANDISK Ultra CF card this time – lesson learned from Speccy devices 😉\n      Once that was sorted out, I’ve started looking for a way to nicely install an adapter and a card inside Archie.\n I’ve figured that I can 3D print a simple holder for it and screw it inside. Quick designing and 3D printing session followed. ( STL file is available at the bottom of the post)\n     All I had to do to finish it, was to make a hole in a dummy cover for a CF card.\n        That part was easily achieved by designing and 3D printing a simple adapter. ( STL file is available at the bottom of the post)\n     I’ve glued on an original floppy button just in case the owner want’s to return to an original state.\n       Acorn Archimedes A3020 was ready to play with. Before shipping it to a new owner, I’ve played a bit with this great machine. Below some pics and a short video showing what this computer is capable of.\n        If you want to get the retro gear I am manufacturing or hardware modules, please visit  shop -&gt; https://retrohax.net/shop/\n  If you want to donate a dead computer then  drop me an email. Extreme cases are welcome. –  Nobody donates anything. so don’t bother. Looks like only Youtubers get all goodies LOLOL ;P  &lt;– THIS IS NO LONGER TRUE!  Cheers to guys from Brasil 😀", "posttime": "2021-06-24 17:56:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "archimedes,原始", "title": "Acorn Archimedes A3020  -  Refurm和Mods ", "title_en": "Acorn Archimedes A3020 – Refurb and Mods", "transed": 1, "url": "https://retrohax.net/acorn-archimedes-a3020-refurb-and-mods/", "via": "", "real_tags": ["原始"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067927, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在日常新闻中脱落 ", "note_en": "Shedding Light On Daily News", "posttime": "2021-06-24 17:56:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "男人,buses,新闻", "title": "男人埋设了42辆上学的地下，他建造的是辉煌的 ", "title_en": "Man Buries 42 School-Buses Underground and What He Built Is Brilliant", "transed": 1, "url": "https://www.illumeably.com/news/man-buries-42-school-buses-underground-vsparks-de/2/3/", "via": "", "real_tags": ["男人", "buses", "新闻"]}, {"category": "", "categoryclass": "", "imagename": "dfc17c386e8b2cc233b091ab46b7fc00.jpeg", "infoid": 1067926, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伦敦 - 签证同意周四收购瑞典金融技术启动思考18亿欧元（21亿美元），旨在展望巨头巨头和数字野心。\n 这笔交易是在签证签证之后，并在购买格子上的竞标后，美国竞争对手的竞争对手被美国监管机构鱼腥草。格子花呢披肩选择单独作为独立公司独自，并被投资者私下重视，134亿美元。\n  格子和TIN思都在称为开放银行的新生空间中运作，这呼吁贷方提供第三方公司，该公司提供了令人垂涎的消费银行数据的访问，提供了它们＆＃39所同意。由于新条例，开放银行在英国和欧盟蓬勃发展。\n ＆＃34;签证致力于尽我们所能促进创新和赋予消费者支持欧洲的开放银行目标，＆＃34;在一份声明中表示，签证＆＃39;首席执行官。\n  ＆＃34;通过携带网络和叮当作用的网络和TINK和＃39;开放银行能力，我们将以更简单，可靠和安全的工具为欧洲消费者和企业提供增加的价值。＆＃ 34;\n 2012年由瑞典企业家DanielKjellén和Fredrik Hedberg成立，最初是作为财务管理应用程序的TINK，但后来旨在重点，专注于为其他企业提供技术。\n TINK＆＃39; S技术让银行和FINTECH公司访问银行数据以创造新的金融产品。基于斯德哥尔摩的公司私人价值6.8亿欧元。它从投资者筹集了超过3亿美元，包括PayPal，SEB和ABN AMRO。 \n＆＃34;正如我们了解签证，它明确地分享了一个共同的使命 - 联系金融世界，加快数字金融服务的增长和采用，＆＃34; Tink＆＃39;在星期四的博客文章中说道。\n  ＆＃34;与签证合作意味着我们＆＃39; LL现在能够比以往任何时候都更快，达到，我们知道签证是我们旅程的下一阶段的完美合作伙伴。＆＃34;\n 签证＆＃39;收购TINK是大规模支付行业巩固努力的最新潮流。该公司去年试图购买格子，但最终在美国司法部后抛弃了收购，该公司起诉挡住了反托拉斯地面。\n 签证所说，处理Tink的交易受到监管批准和其他习惯性关闭条件的约束，加入它将仅限于现金和赢得影响公司＆＃39;股票回购计划或股息政策。\n 签证说，TINK将保持其品牌和管理团队，签证，而公司＆＃39;总部也将留在斯德哥尔摩。 ", "note_en": "LONDON —  Visa agreed Thursday to acquire Swedish financial technology start-up Tink for 1.8 billion euros ($2.1 billion), in a deal aimed at bolstering the payment giant&#39;s digital ambitions.\n The deal comes after Visa&#39;s bid to buy Plaid, an American rival to Tink, was  torpedoed by U.S. regulators. Plaid has since opted to go it alone as an independent company, and was  last privately valued by investors at $13.4 billion.\n  Both Plaid and Tink operate in a nascent space known as  opening banking, which calls on lenders to provide third-party firms with access to coveted consumer banking data, provided they&#39;ve got consent. Open banking has flourished in Britain and the EU thanks to  new regulation.\n &#34;Visa is committed to doing all we can to foster innovation and empower consumers in support of Europe&#39;s open banking goals,&#34; Al Kelly, Visa&#39;s CEO, said in a  statement.\n  &#34;By bringing together Visa&#39;s network of networks and Tink&#39;s open banking capabilities we will deliver increased value to European consumers and businesses with tools to make their financial lives more simple, reliable and secure.&#34;\n Founded by Swedish entrepreneurs Daniel Kjellén and Fredrik Hedberg in 2012, Tink initially started out as a financial management app but later pivoted to focus on providing its technology to other businesses instead.\n Tink&#39;s technology lets banks and fintech firms access banking data to create new financial products. The Stockholm-based company was last privately valued at 680 million euros. It has raised more than $300 million from investors including  PayPal,  SEB and  ABN AMRO.\n  &#34;As we got to know Visa, it became clear that we share a common mission – to connect the financial world and accelerate the growth and adoption of digital financial services,&#34; Tink&#39;s founders said in a  blog post Thursday.\n  &#34;Teaming up with Visa means we&#39;ll now be able to move faster and reach further than ever before, and we know that Visa is the perfect partner for the next stage of our journey.&#34;\n Visa&#39;s acquisition of Tink is the latest in a  wave of consolidation efforts in the massive payments industry. The company  had tried to buy Plaid last year, but ultimately  abandoned the takeover after the U.S. Department of Justice sued to block it on antitrust grounds.\n The deal with Tink is subject to regulatory approvals and other customary closing conditions, Visa said, adding it will be financed solely with cash and won&#39;t impact the company&#39;s stock buyback program or dividend policy.\n Tink will keep its branding and management team after the deal, Visa said, while the company&#39;s headquarters will also remain in Stockholm.", "posttime": "2021-06-24 17:08:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "购买,buy,签证", "title": "签证购买瑞典金公司启动TINK ", "title_en": "Visa to buy Swedish fintech startup Tink", "transed": 1, "url": "https://www.cnbc.com/2021/06/24/visa-to-buy-swedish-fintech-start-up-tink.html", "via": "", "real_tags": ["购买", "buy", "签证"]}, {"category": "", "categoryclass": "", "imagename": "d135b4a30ccbc4876226facc467284ea.png", "infoid": 1067925, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "CloudFlare上的静态WordPress托管将为您的网站提供最快的页面加载速度 - 它完全免费！\n  是和否。如果您有一个简单的WordPress网站，您可以使用它来显示内容，那么这将很好。如果您使用评论，电子商务，任何导致Post Request的内容，那么这将无法正常工作。\n CloudFlare作为缓存代理开始生活，但在某些点发布的页面上允许您部署GitHub项目并在CloudFlare上托管它。它与静态内容确实很好，并将在没有服务器侧处理的情况下快速提供您的内容。\n 相比之下的WordPress是一个在PHP和MySQL上运行的服务器端应用程序。每个请求由PHP处理，该PHP查询DB并使用页面响应。页面性能根据插件/主题复杂性/服务器拥塞等的数量而下降。\n 因此，为了在CloudFlare上“主机”WordPress，您需要在本地运行WordPress，编写您的帖子，然后将您的网站导出为将部署到CloudFlare的静态内容集。\n  如果您已经在Web上运行WordPress，则可以跳过（如果要仍需支付托管），只需将您的网站移动到像https://edit.myblog.com这样的子域。\n 如果您不想支付托管，那么每次想要制作博客文章或选择新主题时，您需要在本地运行WordPress。这是静态WordPress托管的主要缺点 - 您无法避免在进行更改时在某处运行堆栈。 \n我将使用Docker演示这一点，因为它更容易获得这种方式运行的WordPress环境。如果您已在本地计算机上运行WordPress，您仍然可以执行此操作。它假设您的主站点使用HTTPS（您完全总是这样做，对吧？）\n  这需要进行调整，以便可以正确地从WordPress正确转储文件。首先是nginx override，以便该网站在端口8000上内部运行。这应该\n  为此工作，您还需要一个端口定义，因此Apache知道要倾听它：\n  这些文件应将这些文件安装在docker-compose.yml文件中的WordPress容器中，因此您应该最终以这样的完整文件：\n 版本：＆＃34; 3＆＃34;服务：db：container_name：site_mysql图片：5.7卷： -  ./db_data：/var/lib/mysql #persist mysql数据当地重新启动：始终环境：mysql_root_password：password mysql_database：site_wp mysql_user：site_wp mysql_password：password wordpress：contain_name ：site_wordpress indeds_on： -  dB图像：wordpress：最新卷： -  ./ wordpress_data：/var/www/html＃持续WordPress文件在本地 -  ./ports.conf:/etc/apache2/ports.conf＃完成允许静态站点生成工作 -  ./000-default.conf:/etc/apache2/sites-enabled/000-default.conf端口： - ＆＃34; 8000：8000＆＃34;重启：始终环境：wordpress_db_host：db：3306 wordpress_db_user：site_wp wordpress_db_password：password wordpress_db_name：site_wp\n     此时，您将编写要发布的任何博客文章，设置主题，插件等，直到您已准备好部署到Web。\n  您需要安装简单的静态插件以将您的网站导出为静态集HTML。 \n转到“生成”菜单，然后单击“生成静态文件”。等待完成过程，您应该最终与您的WordPress网站导出到./wordpress_data/static。\n   CloudFlare要求您从Github Repo推送它。这是免费的，因此您只需要登录GitHub并创建一个新的私人回购：\n    这将忽略MySQL和WordPress创建的所有文件，除了简单静态的静态HTML文件。\n       选择您将代码推入并继续的存储库。设置构建配置时选择：\n  这将告诉CloudFlare只是抓取静态输出，该静态输出被推到主分支并曝光。\n 完成后，请让Build运行和您的网站在yoursite.pages.dev中可见。如果要使用自定义域，请立即设置CNAME记录并将其指向该URL。\n  WordPress很棒，但由于其成为服务器端呈现的网站的性质，可以缓慢。如果您没有一个主要只是内容的复杂网站，您可以通过在本地写入博客并将其发布到CloudFlare来实现大量增长并为静态WordPress托管付款。 ", "note_en": "Static WordPress hosting on CloudFlare will give you the fastest possible page load speed for your site – and it’s completely free!\n  Yes and no. If you have a simple WordPress site you use to just display content then this will be fine.  If you use comments, ecommerce, anything that causes a  POST request then this won’t work.\n CloudFlare started life as a cache proxy but at some point released  pages that lets you deploy a github project and host it on CloudFlare. It does really well with static content and will deliver your content quickly as there is no server side processing.\n WordPress in contrast is a server-side app that runs on PHP and MySql. Each request is processed by PHP that queries the DB and responds with a page. Page performance drops off a cliff depending on the number of plugins/theme complexity/server congestion etc.\n So in order to “host” WordPress on CloudFlare, you need to run WordPress locally, write your posts and then export your site as a static set of content that gets deployed into CloudFlare.\n  If you already have WordPress running on the web, you can skip (if you want to still pay for hosting) and just move your site to a subdomain like  https://edit.myblog.com.\n If you don’t want to pay for hosting, then you’ll need to run WordPress locally each time you want to make a change like writing a blog post or choosing a new theme. This is main downside to static WordPress hosting – you can’t avoid running the stack somewhere when making changes.\n I’ll be demonstrating this using Docker since it’s just easier to get the WordPress environment running this way. You can still do this if you already have WordPress running on your local machine. It assumes your main site runs using HTTPS (you’re totally always doing this already, right?)\n  This needs to be tweaked so that the files can be correctly dumped from WordPress. First up is an  nginx override so that the site runs internally on port  8000. This should\n  For this to work, you’ll also needs a ports definition so apache knows to listen on it:\n  These files should be mounted into the WordPress container in the  docker-compose.yml file, so you should end up with a complete file like this:\n version: &#34;3&#34; services: db: container_name: site_mysql image: mysql:5.7 volumes: - ./db_data:/var/lib/mysql # Persist mysql data locally restart: always environment: MYSQL_ROOT_PASSWORD: password MYSQL_DATABASE: site_wp MYSQL_USER: site_wp MYSQL_PASSWORD: password wordpress: container_name: site_wordpress depends_on: - db image: wordpress:latest volumes: - ./wordpress_data:/var/www/html # Persist wordpress files locally - ./ports.conf:/etc/apache2/ports.conf # Done to allow static site generation to work - ./000-default.conf:/etc/apache2/sites-enabled/000-default.conf ports: - &#34;8000:8000&#34; restart: always environment: WORDPRESS_DB_HOST: db:3306 WORDPRESS_DB_USER: site_wp WORDPRESS_DB_PASSWORD: password WORDPRESS_DB_NAME: site_wp\n     At this point you’d write any blog posts you want to publish, set themes, plugins etc until you’re ready to deploy to the web.\n  You’ll need to install the  Simply Static plugin to export your site as a static set of HTML.\n       Go to the  Generate menu and click  Generate Static Files. Wait for the process to complete and you should end up with your WordPress site exported to  ./wordpress_data/static.\n   CloudFlare requires that you push to it from a GitHub repo. This is free, so you just need to log into GitHub and create a  new Private Repo:\n    This will ignore all of the files that get created by MySql and WordPress, except for the static html files from Simply Static.\n       Choose the repository you pushed your code into and continue. When setting up the build configuration choose:\n  This will tell CloudFlare to simply grab the static output that got pushed up to the master branch and expose it.\n Once complete, let the build run and your site should be visible at   yoursite.pages.dev. If you want to use your custom domain, just setup a  CNAME record and point it at that url.\n  WordPress is great, but can be slow due to its nature of being a server-side rendered website. If you don’t have a complicated site that’s mainly just content, you can achieve a big speed increase and pay nothing for static WordPress hosting by writing your blog locally and publishing it up to CloudFlare.", "posttime": "2021-06-24 17:07:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,wordpress", "title": "免费的“主持人”WordPress免费 ", "title_en": "“Host” WordPress on Cloudflare for Free", "transed": 1, "url": "https://blogabout.dev/how-to-get-static-wordpress-hosting-on-cloudflare-for-free", "via": "", "real_tags": ["免费", "wordpress"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067924, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们很激动到宣布签证正在获取思考。这是开放银行新章的开头，我们对员工，客户和金融服务未来的意义不可能更兴奋。\n 与签证合作将允许TININ进一步发展其组织，产品和服务，以更好地为现有和未来的客户提供服务。\n TINK和VISA分享了联系金融世界的共同任务，加快了数字金融服务的增长和采用。\n  差不多十年前，我们创立了对所有人的想法来实现的，应该是每个人的想法。从那一天起，我们的每一个同事都是无情地建立技术，使人们能够将银行账户与新一代金融服务联系起来。直观，轻松和愉快的服务。多年来删除障碍障碍的服务。\n 从联系瑞典的前10个银行，居住在18个市场，支持超过3,400多个金融机构的金融机构 - 我们为我们所实现的所有达成而感到骄傲。今天，我们正在向开拓者提供推动 - 从数千名初创公司到世界上最大，最渐进的金融机构。各种各样的每个人的集体努力工作即将永远改变金融服务业的形状。\n 很明显，我们在TINK的根本上建立了真正令人难以置信的东西，这对我们的客户有巨大影响，对消费者和大量的社会产生了巨大的影响。但也很清楚，我们只划伤了表面，我们刚刚开始。\n 这就是为什么我们兴奋地分享TINK正在加入签证的消息。 \n正如我们要了解签证，很明显，我们分享了一个共同的使命 - 联系金融世界，加快数字金融服务的增长和采用。与签证合作意味着我们现在可以比以往任何时候都更快，更加达到，我们知道Visa是我们旅程的下一阶段的完美伴侣。\n 对于所有同事，客户和财务未来，我们对下一阶段意味着什么更令人兴奋。这种合作伙伴关系反映了在过去十年中造成的每个人都制定了各个人的贡献，而我们的客户则为我们提供的信任。与签证合作将使我们进一步发展我们的组织，产品和服务，以更好地为我们现有的和未来客户提供服务 - 同时继续作为独立品牌运营，并建立在令人难以置信的扭动优势。\n 我们最温暖，最衷心的感谢谢谢你们每一个修补师，他们都努力让我们到达我们今天的地方，以及我们的投资者，客户和其他支持者在多年来相信我们。\n 对于TINK的下一章，我们无法更加兴奋。让我们出去为新的金融世界推出权力！ ", "note_en": "We are thrilled to announce Visa is acquiring Tink. This is the beginning of a new chapter in open banking, and we couldn’t be more excited about what this means for our employees, our customers and the future of financial services.\n Partnering with Visa will allow Tink to further grow its organisation, products and services, to better serve existing and future customers.\n Tink and Visa share a common mission to connect the financial world and accelerate the growth and adoption of digital financial services.\n  Almost ten years ago we founded Tink on the idea that access to financial infrastructure should be for everyone. Since that day, each and every one of our colleagues has worked relentlessly to build technology that makes it easy for people to connect their bank accounts to a new generation of financial services. Services that are intuitive, effortless and enjoyable. Services that remove barriers that have stood in the way of innovation for years.\n From connecting the first 10 banks in Sweden, to being live in 18 markets supporting more than 3,400 financial institutions across Europe – we are so proud of what we all have achieved. Today, we are powering the pioneers – from thousands of startups to the largest and most progressive financial institutions in the world. The collective hard work of everyone at Tink is about to change the shape of the financial services industry forever.\n It is clear that we have all built something truly incredible at Tink, which has had a tremendous impact on our customers, on consumers and on society at large. But it’s also clear that we’ve only scratched the surface and that we’ve just gotten started.\n This is why we are thrilled to share the news that Tink is joining Visa.\n As we got to know Visa, it became clear that we share a common mission – to connect the financial world and accelerate the growth and adoption of digital financial services. Teaming up with Visa means we’ll now be able to move faster and reach further than ever before, and we know that Visa is the perfect partner for the next stage of our journey.\n We couldn’t be more excited for what this next phase means, for all of our colleagues, our customers and for the future of finance. This partnership reflects the contribution that every person at Tink has made over the past ten years, and the trust our customers have placed in us. Partnering with Visa will allow us to further grow our organisation, products and services, to better serve our existing as well as future customers - while continuing to operate as an independent brand and build on the incredible strengths of Tink.\n Our warmest, most heartfelt thank you goes to every Tinker, who has worked so hard to get us to where we are today, as well as to our investors, customers and other supporters for believing in us over the years.\n We couldn’t be more excited about this next chapter for Tink. Let’s go out and power the new world of finance!", "posttime": "2021-06-24 17:07:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "joining,客户", "title": "tink正在加入签证 ", "title_en": "Tink Is Joining Visa", "transed": 1, "url": "https://tink.com/blog/news/visa-acquires-tink/", "via": "", "real_tags": ["joining", "客户"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067923, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几天前刚刚宣布，如果您在加利福尼亚接种疫苗，您可以通过转到数字Covid-19疫苗记录门户网站以QR码的形式获得疫苗接种录制的数字副本。 QR码如下所示：\n  但如果您尝试使用iOS相机扫描它，它只是说“找不到可用的数据”。 iOS 15将支持阅读智能保健卡，但直到下降至下降，直到那么我们拥有这些大多数无用的QR码。所以让我们和他们一起做点什么！\n 首先，它是一个巨大的QR码。那是因为它包含很多信息，包括：\n  基本上它拥有您在物理COVID-19疫苗接种卡上看到的一切，以及一些可以核实的东西。\n 当您扫描QR码时，您将留下一串数字：\n  您可以拍摄这些数字并通过将它们分成对成对将它们转换为Base64字符串，将每个对ASCII十进制添加到（45），并采用十进制总和的ASCII字符。例如，前两对是56和76.所以我们加入45 + 56 = 101，它表示为e和45 + 76 = 121，其表示为y并继续这样做，直到所有对完成，我们都有另一个长弦：\n  花费太多时间调试JWTS或OpenID Connect的读者将识别JWT的Telltale Ey前缀。事实上，将此投入JWT.IO将吐出我们的标题： \n有效载荷看起来有点古怪。那是因为它是一个Base64URL编码。我们可以解码此编码以获取一堆字节，然后使用膨胀算法向JSON字符串解压缩这些字节。\n  常量PAKO =需要（＆＃39; PAKO＆＃39）; VAR有效载荷=＆＃39; 3ZLLbtswEEV_JZhuZYkSVKfWLknRx6YokLSbwAuaGlsM-BD4MOIG-vfOyApaFEFWXYXQhpyZw3sv9QQ6RuhgSGmMXVXFEVUZrQxpQGnSUCoZ-ljho7SjwVhRd8YABbjdHrp63bStEJu2LtfvPxRwVNA9QTqNCN39H-a_uHfnzYo3sC1ABezRJS3Nbd49oEpM2Q86_MQQtXekry1FWdO1fHqdXW-QewJGn4PCu_lGWArFogCUN4ZoTCiALggnkkXkbMyPYKjheb4T1PC8eQH8XSZN82xbWjxDpNWGePBJZqWpctBHdGz7yqXBuxMd3ZawncjfTpP_jzIxqt6sNyvRrhoB01S8KKZ-XcxXa7PTv-TiKyaZcpzd8hMl7OnwKJXSDm98PxOU77U7zLrjKSa0y4vT4wzmsvThUHGwVdR9pY6PBFDzJDTiEqbtVMC4JDDL2WNAx9r-DpCavFI5zCU2e6ftGdHUK8EfYUcMex8s_UGsRarkAyN7HUcjOc2r65uLz-gwSHPxxcdRJ2koKArR-PQt2x2PgqDVvpJg8yYTbDb_N0Gx3nBhovUb＆＃39 ;; VAR字节= Buffer.from（有效载荷，＆＃39; base64＆＃39;）; var incollat​​edpayload = pako.inflateaw（bytes，{to：＆＃39; string＆＃39; string＆＃39;}）; console.log（充气般的覆盖）;\n  {＆＃34; ISS＆＃34 ;:＆＃34; https：//spec.smarthealth.cards/examples/issuer&&#34;＆＃34; nbf＆＃34 ;:1624400941.658，＆＃34; vc＆＃34; ：{＆＃34;类型＆＃34 ;: [＆＃34; https：//smarthealth.cards#health-card&#34; ]，＆＃34; credentialsubject＆＃34 ;: {＆＃34; fhirversion＆＃34 ;:＆＃34; 4.0.1＆＃34;＆＃34; fhirbundle＆＃34 ;: {＆＃34; resourcetype＆＃34; ：＆＃34;捆绑＆＃34 ;,＃34;类型＆＃34 ;:＆＃34;集合＆＃34;＆＃34;条目＆＃34 ;: [{＆＃34; fullull＆＃34 ;:＆＃ 34;资源：0＆＃34;＆＃34;资源＆＃34 ;: {＆＃34; resourceType＆＃34 ;:＆＃34;患者＆＃34;＆＃34;名称＆＃34 ;: [{＆＃ 34;家庭＆＃34 ;:＆＃34; fauci＆＃34 ;,＃34;给定＆＃34 ;: [＆＃34;安东尼＆＃34;＆＃34; s。＆＃34; ]}]，＆＃34;出生日胎＆＃34 ;:＆＃34; 1969-04-20＆＃34; }}，{＆＃34; fullul＆＃34 ;:＆＃34;资源：1＆＃34 ;,＆＃34;资源＆＃34 ;: {＆＃34; resourceType＆＃34 ;:＆＃34;免疫免疫＆＃34 ;，＆＃34;状态＆＃34 ;:＆＃34;完成＆＃34;＆＃34; vaccinecode＆＃34 ;: {＆＃34;编码＆＃34 ;: [{＆＃34;系统＆＃34 ;: ＆＃34; http：//hl7.org/fhir/sid/cvx&#34 ;,＆＃34;代码＆＃34 ;:＆＃34; 207＆＃34; }]}，＆＃34;患者＆＃34 ;: {＆＃34;参考＆＃34 ;:＆＃34;资源：0＆＃34; }，＆＃34;发生attencedateme＆＃34 ;:＆＃34; 2021-01-01＆＃34;，＆＃34;执行者＆＃34 ;: [{＆＃34;演员＆＃34 ;: {＆＃34;显示＆ ＃34 ;:＆＃34; ABC综合医院＆＃34; }}]，＆＃34; Lotnumber＆＃34 ;:＆＃34; 0000420＆＃34; }}，{＆＃34 ;:＆＃34;资源：2＆＃34;＆＃34;资源＆＃34 ;: {＆＃34; resourceType＆＃34 ;:＆＃34;免疫免疫＆＃34 ;，＆＃34;状态＆＃34 ;:＆＃34;完成＆＃34;＆＃34; vaccinecode＆＃34 ;: {＆＃34;编码＆＃34 ;: [{＆＃34;系统＆＃34 ;: ＆＃34; http：//hl7.org/fhir/sid/cvx&#34 ;,＆＃34;代码＆＃34 ;:＆＃34; 207＆＃34; }]}，＆＃34;患者＆＃34 ;: {＆＃34;参考＆＃34 ;:＆＃34;资源：0＆＃34; }，＆＃34;发生＆＃34 ;:＆＃34; 2021-01-29＆＃34;＆＃34;执行者＆＃34 ;: [{＆＃34;演员＆＃34 ;: {＆＃34;显示＆ ＃34 ;:＆＃34; ABC综合医院＆＃34; }}]，＆＃34; lotnumber＆＃34 ;:＆＃34; 0000069＆＃34; }}]}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}\n 关键是发行人。在这种情况下，发行人是https://spec.smarthealth.cards/examples/issuer。发行者在ISS值+ /.WELL-KNOWN/JWKS.JSON发布他们的公钥，所以我们应该能够转到https://spec.smarthealth.cards/examples/issuer/.well-known/jwks.json和下载他们：\n {＆＃34; keys＆＃34 ;: [{＆＃34; kty＆＃34 ;:＆＃34; ec＆＃34;＆＃34;孩子＆＃34 ;:＆＃34; 3kfdg-xwp-7gxyywtufuadwbumdopkmqx-iell11w9s＆ ＃34 ;,＆＃34;使用＆＃34 ;:＆＃34; sig＆＃34 ;,＆＃34; alg＆＃34 ;:＆＃34; es256＆＃34 ;,＆＃34; crv＆＃34 ;:＆ ＃34; p-256＆＃34 ;,＆＃34; x＆＃34 ;:＆＃34; 11xvrwy1i2s0eyjlyf_bwfw_tq5cjjnlw78bhxnxcgw＆＃34;＆＃34; y＆＃34 ;:＆＃34; ezxwxvo1hvcy0kucrpfko7yaymt6ajc3n7okab6vyy8＆＃34; }，......]}\n 不出所料，孩子匹配我们JWT标题中发现的孩子。通过使用公钥，我们可以验证此卡来自发行人，因为只有他们拥有签名所需的私钥。\n 当您从数字COVID-19疫苗记录门户中获取QR码时，这些是由https://myvaccinerecord.cdph.ca.gov/creeds发出的，因此可以在https：//myvaccinerecord.cdph中找到他们的公钥。 ca.gov/creds/.well-known/jwks.json。由于任何人都可以通过生成公共/私钥对来成为发行人，因此重要的是您确定您实际信任的发行人是重要的。 \n如果我们可以采取QR码，提取疫苗接种记录，并验证它是由国家发出的，我们可以将其整合到几乎任何内容！听我说。\n 如果我们阻止人们根据其疫苗接种状态访问内容怎么办？如果你无法阅读reddit，观看YouTube，或在Instagram上发布的情况怎么办，而无需首先证明您已被疫苗接种？我觉得我们很快就把数字相当快。\n 作为概念验证，我建立了一个疫苗接种PayWall，提供了如何完成的例子。在这个例子中，伟大的盖茨比的书的内容受疫苗接种付费墙保护。要阅读它，您只需从数字Covid-19疫苗记录门户中获取您的数字疫苗接种记录，按扫描数字Covid-19疫苗接种录制按钮并扫描。\n     尚未询问任何问题，因此下面的此常见问题解答部分代表经常预期的问题。\n      你认为一个不会接种疫苗的人甚至想读伟大的盖茨比吗？\n  我不是加利福尼亚州的居民，所以我无法测试这种疫苗接种付费墙。\n 此博客帖子顶部的QR码可用于测试PayWall。 \n这不是一个问题。加利福尼亚州建议您可以要求将扫描数码Covid-19疫苗中的QR码扫描QR码的组织记录它们将如何使用您的数据或者他们将保留它。只有您可以决定如何以及何时分享您的记录。\n  这些数据仅用于验证您的疫苗接种状态并在笑话的情况下显示它，以上伟大的盖茨比的文本。\n  不可以。您可以查看源代码，但您无法验证网站是否使用相同的代码，以便我不知道还有什么要告诉您的方式。\n  我不。如果您可以接种疫苗，并且您可以使用疫苗，并且您没有获得一个，您应该感到差。\n  在物理设置中，数字疫苗接种卡应该与另一个识别证明一起使用，如驾驶执照。这是棘手的在线。防止滥用的一种方法是只允许与一个帐户相关联的疫苗接种记录。您可以存储有效载荷的哈希值并检查它是否已被使用，而不是存储整个有效载荷。\n  不是真的，但我可以看到它被用作促销，比如作为在线服务的折扣或信用。如果Dunkin'甜甜圈和Krispy Kreme可以有疫苗激励计划，也许在线服务也可以？坦率地说，我真的没有得到疫苗激励计划，或彩票，或给人们接种疫苗。如果没有染色是不够的动力来获得疫苗，我不确定会有什么。 ", "note_en": "It was  just announced a few days ago that if you were vaccinated in California, you can get a digital copy of your vaccination record in the form of a QR code by going to the  Digital COVID-19 Vaccine Record portal. The QR code looks like this:\n  But if you try to scan it in with the iOS Camera, it just says “No usable data found”. iOS 15 will  support reading Smart Health cards but it won’t be released until the fall, so until then we have these mostly useless QR codes. So let’s do something with them!\n First of all, it’s a giant QR code. That’s because it contains a lot of information including:\n  Basically it has everything you see on your physical COVID-19 Vaccination card, as well as some stuff to make it verifiable.\n When you scan in the QR code, you’re left with a long string of numbers:\n  You can take those numbers and convert them to a base64 string by splitting them into pairs, adding each of those pairs to the ASCII decimal of  - (45), and taking the ASCII character of the decimal sum. For example, the first two pairs are 56 and 76. So we add 45 + 56 = 101 which is represented as  e and 45 + 76 = 121 which is represented as  y and keep doing that until all the pairs are done and we have another long string:\n  Readers that have spent too much time debugging JWTs or OpenID Connect will recognize the telltale  ey prefix of a JWT. In fact, throwing this into  jwt.io will spit out the header for us:\n  The payload looks a little wacky though. That’s because it’s a  base64url encoding. We can decode this encoding to get a bunch of bytes and then decompress those bytes using the INFLATE algorithm to a JSON string.\n  const pako = require(&#39;pako&#39;);var payload = &#39;3ZLLbtswEEV_JZhuZYkSVKfWLknRx6YokLSbwAuaGlsM-BD4MOIG-vfOyApaFEFWXYXQhpyZw3sv9QQ6RuhgSGmMXVXFEVUZrQxpQGnSUCoZ-ljho7SjwVhRd8YABbjdHrp63bStEJu2LtfvPxRwVNA9QTqNCN39H-a_uHfnzYo3sC1ABezRJS3Nbd49oEpM2Q86_MQQtXekry1FWdO1fHqdXW-QewJGn4PCu_lGWArFogCUN4ZoTCiALggnkkXkbMyPYKjheb4T1PC8eQH8XSZN82xbWjxDpNWGePBJZqWpctBHdGz7yqXBuxMd3ZawncjfTpP_jzIxqt6sNyvRrhoB01S8KKZ-XcxXa7PTv-TiKyaZcpzd8hMl7OnwKJXSDm98PxOU77U7zLrjKSa0y4vT4wzmsvThUHGwVdR9pY6PBFDzJDTiEqbtVMC4JDDL2WNAx9r-DpCavFI5zCU2e6ftGdHUK8EfYUcMex8s_UGsRarkAyN7HUcjOc2r65uLz-gwSHPxxcdRJ2koKArR-PQt2x2PgqDVvpJg8yYTbDb_N0Gx3nBhovUb&#39;;var bytes = Buffer.from(payload, &#39;base64&#39;);var inflatedPayload = pako.inflateRaw(bytes, { to: &#39;string&#39; });console.log(inflatedPayload);\n  { &#34;iss&#34;: &#34;https://spec.smarthealth.cards/examples/issuer&#34;, &#34;nbf&#34;: 1624400941.658, &#34;vc&#34;: { &#34;type&#34;: [ &#34;https://smarthealth.cards#health-card&#34; ], &#34;credentialSubject&#34;: { &#34;fhirVersion&#34;: &#34;4.0.1&#34;, &#34;fhirBundle&#34;: { &#34;resourceType&#34;: &#34;Bundle&#34;, &#34;type&#34;: &#34;collection&#34;, &#34;entry&#34;: [ { &#34;fullUrl&#34;: &#34;resource:0&#34;, &#34;resource&#34;: { &#34;resourceType&#34;: &#34;Patient&#34;, &#34;name&#34;: [ { &#34;family&#34;: &#34;Fauci&#34;, &#34;given&#34;: [ &#34;Anthony&#34;, &#34;S.&#34; ] } ], &#34;birthDate&#34;: &#34;1969-04-20&#34; } }, { &#34;fullUrl&#34;: &#34;resource:1&#34;, &#34;resource&#34;: { &#34;resourceType&#34;: &#34;Immunization&#34;, &#34;status&#34;: &#34;completed&#34;, &#34;vaccineCode&#34;: { &#34;coding&#34;: [ { &#34;system&#34;: &#34;http://hl7.org/fhir/sid/cvx&#34;, &#34;code&#34;: &#34;207&#34; } ] }, &#34;patient&#34;: { &#34;reference&#34;: &#34;resource:0&#34; }, &#34;occurrenceDateTime&#34;: &#34;2021-01-01&#34;, &#34;performer&#34;: [ { &#34;actor&#34;: { &#34;display&#34;: &#34;ABC General Hospital&#34; } } ], &#34;lotNumber&#34;: &#34;0000420&#34; } }, { &#34;fullUrl&#34;: &#34;resource:2&#34;, &#34;resource&#34;: { &#34;resourceType&#34;: &#34;Immunization&#34;, &#34;status&#34;: &#34;completed&#34;, &#34;vaccineCode&#34;: { &#34;coding&#34;: [ { &#34;system&#34;: &#34;http://hl7.org/fhir/sid/cvx&#34;, &#34;code&#34;: &#34;207&#34; } ] }, &#34;patient&#34;: { &#34;reference&#34;: &#34;resource:0&#34; }, &#34;occurrenceDateTime&#34;: &#34;2021-01-29&#34;, &#34;performer&#34;: [ { &#34;actor&#34;: { &#34;display&#34;: &#34;ABC General Hospital&#34; } } ], &#34;lotNumber&#34;: &#34;0000069&#34; } } ] } } }}\n The key  iss is the issuer. In this case, the issuer is  https://spec.smarthealth.cards/examples/issuer. Issuers publish their public keys at  iss value +  /.well-known/jwks.json so we should be able to go to   https://spec.smarthealth.cards/examples/issuer/.well-known/jwks.json and download them:\n { &#34;keys&#34;: [ { &#34;kty&#34;: &#34;EC&#34;, &#34;kid&#34;: &#34;3Kfdg-XwP-7gXyywtUfUADwBumDOPKMQx-iELL11W9s&#34;, &#34;use&#34;: &#34;sig&#34;, &#34;alg&#34;: &#34;ES256&#34;, &#34;crv&#34;: &#34;P-256&#34;, &#34;x&#34;: &#34;11XvRWy1I2S0EyJlyf_bWfw_TQ5CJJNLw78bHXNxcgw&#34;, &#34;y&#34;: &#34;eZXwxvO1hvCY0KucrPfKo7yAyMT6Ajc3N7OkAB6VYy8&#34; }, ... ]}\n Unsurprisingly, the  kid matches the  kid found in the header of our JWT. By using the public key, we can verify that this card came from the issuer because only they have the private key necessary to sign it.\n When you get a QR code from the  Digital COVID-19 Vaccine Record portal, these are issued by  https://myvaccinerecord.cdph.ca.gov/creds and thus their public keys can be found at   https://myvaccinerecord.cdph.ca.gov/creds/.well-known/jwks.json. Since anyone can be an issuer by generating public/private key pairs, it’s important that you identify which issuers you actually trust.\n If we can take a QR code, extract the vaccination record, and verify that it was issued by the state, we can integrate that into almost anything! Hear me out.\n What if we prevented people from accessing content based on their vaccination status? What if you couldn’t read Reddit, watch Youtube, or post on Instagram without first proving that you’ve been vaccinated? I think we’d up our numbers pretty quick.\n As a proof-of-concept, I’ve built a  vaccination paywall to provide an example of how this can be done. In this example, the contents of the book  The Great Gatsby are protected by a vaccination paywall. In order to read it, you simply have to get your digital vaccination record from  Digital COVID-19 Vaccine Record portal, press the  Scan Digital COVID-19 Vaccination Record button and scan it in.\n     No one has asked any questions yet, so this FAQ section below stands for Frequently Anticipated Questions.\n      Do you think that a person that won’t get vaccinated even wants to read  The Great Gatsby?\n  I’m not a resident of California so I have no way of testing this vaccination paywall.\n The QR code at the top of this blog post may be used to test the paywall.\n  That’s not a question. The  State of California suggests that you can ask organizations that will scan the QR code in your Digital COVID-19 Vaccine Record how they will use your data or if they will keep it. Only you can decide how and when to share your record.\n  The data is only used to verify your vaccination status and display it, in a joking matter, above the text of  The Great Gatsby.\n  No. You can look at the  source code but there’s no way for you to verify that the website is using the same code so I don’t know what else to tell you.\n  I do not. If you can be vaccinated and a vaccine is available to you and you’re not getting one,  you should feel bad.\n  In a physical setting, the digital vaccination card is supposed to be used in conjunction with another proof of identification, like a driver’s license. This is trickier online. One way to prevent abuse would be to only allow a vaccination record to be associated with a single account. Instead of storing the entire payload, you could store a hash of the payload and check if it’s already been used.\n  Not really, but I could see it being used as a promotion, like as a discount or credit for an online service. If Dunkin’ Donuts and Krispy Kreme can have vaccine incentive programs, maybe online services could too? Frankly, I don’t really get vaccine incentive programs, or lotteries, or giving people guns for getting vaccinated. If not dying is not enough of an incentive to get the vaccine, I’m not sure what will be.", "posttime": "2021-06-24 17:07:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "接种,paywalls,疫苗", "title": "疫苗接种PayWalls  -  Bertrand Fan ", "title_en": "Vaccination Paywalls – Bertrand Fan", "transed": 1, "url": "https://bert.org/2021/06/23/vaccination-paywalls/", "via": "", "real_tags": ["接种", "paywalls", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "2b1a1b60c4655670f9cc4940866db43c.jpg", "infoid": 1067922, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "26年后关闭在其领导作家国家安全法下的早晨逮捕，在最新的警察署在小号报纸上。 ", "note_en": "Shutdown after 26 years follows morning arrest under national security law of its lead editorial writer, in the latest police swoop on the tabloid-style newspaper.", "posttime": "2021-06-24 17:02:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,停止,daily,小号", "title": "苹果每日，香港的亲民主报纸停止出版 ", "title_en": "Apple Daily, Hong Kong's Pro-Democracy Newspaper to Stop Publishing", "transed": 1, "url": "https://www.scmp.com/news/hong-kong/law-and-crime/article/3138399/national-security-law-apple-dailys-main-editorial", "via": "", "real_tags": ["苹果", "apple", "停止", "daily", "小号"]}, {"category": "", "categoryclass": "", "imagename": "8b8af62cebe28a94fa496bbd2aee25ca.jpg", "infoid": 1067921, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伦敦 - 英国立法者要求在苏格兰仓库调查后与科技巨头亚马逊国家经理会面，揭示了数千名未售出或退回的物品 - 包括电视，书籍，密封面罩和笔记本电脑 - 被公司摧毁。\n  ITV新闻在苏格兰镇的仓库仓库中的卧底调查，也显示了无人机，耳机，珠宝和无数其他高价值产品被放入标有“毁灭”之前的盒子，然后在巨大的卡车遵循填埋面填埋场之前网站和回收中心。调查表明，每年占数百万产品的破坏。\n 一位前员工告诉ITV消息，员工预计每周都会摆脱估计的130,000件物品。广播公司将练习描述为“浪费在令人惊讶的水平”。\n   随着社交媒体的愤怒，鲍里斯约翰·约翰逊总理答应了他会调查他说的指控“令人难以置信”。气候活动家Greta Thunberg抨击Twitter上的镜头。\n  “这只是一个仓库。如果您有一个可能的系统 - 甚至有利可图 - 这是一个明确的迹象，即某些东西是根本错误的，“Thunberg写道。\n 亚马逊在全球范围内运营175个中心，跨越超过1.5亿平方英尺的空间，员工准备装运物品并送到时钟的客户。\n  在一份声明的声明上，在周三向华盛顿邮报，亚马逊发言人矛盾的是ITV的指控，即该公司将物品送到垃圾填埋场，并补充说该位置也是回收站。 \n“我们正在努力实现零产品处置的目标，我们的优先事项是转售，捐赠给慈善组织或回收任何未售出的产品，＆＃34;声明说。 “没有物品在英国垃圾填埋场。作为最后的手段，我们将把物品寄给能源恢复，但我们努力推动它发生在零的次数。“\n 根据ITV，John Boumphrey，亚马逊的英国国家经理表示，该公司被摧毁的物品数量“非常小”。\n 自从原始调查分享以来，该公司以前在英国赫特福德郡的一家大型仓库雇用的另一名举报人表示，“从全新的iPhone到Playstations的很多东西”被摧毁，以及从未阅读过的书籍。\n  尚未确定的人还报告说，在全国各地的其他亚马逊中心工作的人面临着浪费的可用产品的类似账户。\n  ITV新闻指出，销毁货物的原因可能归因于亚马逊的商业模式。全球公司在网上购物巨头拥有的仓库商店。但是，如果物品未能出售，则收取一些费用的费用，有些人可能会努力支付，导致需要储存的堆积或倾销 - 其他地方。\n 反对派劳动党的立法者Siobhain McDonagh表示，该公司已摧毁了可能会使许多儿童遍布全国各地的物品 - 特别是在冠状病毒大流行中摧毁了物品。许多家庭在爆发期间努力向孩子们从家里教育，通常是不充分或有限的数字设备。\n  冠状病毒已经蹂躏英国，造成超过128,000人死亡，三个全国锁定，在全国范围内迫使学校关闭。 \n许多英国人，也关注调查，要求知道为什么当脆弱的人或慈善机构使用货物时倾倒出良好状态的物品。  最近联合国儿童基金（儿童基金会）的报告呼吁英国政府阻止英国年轻人所谓的“数字排除”。 它表示，数字访问是“不再是奢侈品”，但必须是“必须被视为基石，以确保每个孩子的社会正义和公平的生活机会”。  2019年，法国报纸Le Monde报道，亚马逊于2018年摧毁了估计的320万未售出的产品。“亚马逊，大规模毁灭性销售商”，标题读。  当天最重要的新闻故事，由邮政编辑策划并每天早上交付。 ", "note_en": "LONDON — British lawmakers are demanding a meeting with tech giant Amazon’s country manager after an investigation at a warehouse in Scotland revealed that thousands of unsold or returned items — including televisions, books, sealed face masks and laptops — were being destroyed by the company.\n  Footage from the undercover  investigation by ITV News at a warehouse in the Scottish town of Dunfermline, also showed drones, headphones, jewelry and countless other high-value products being placed into boxes labeled “destroy” before huge trucks were followed carrying the stock to landfill sites and recycling centers. The investigation said it amounted to the destruction of millions of products each year.\n One ex-employee told ITV News that workers were expected to get rid of an estimated 130,000 items a week. The broadcaster described the practice as “waste on an astonishing level.”\n   As outrage grew on social media, Prime Minister Boris Johnson promised that he would look into the allegations, which he said were “incredible.” Climate activist Greta Thunberg slammed the footage on Twitter.\n  “This is just ONE warehouse. If you have a system where this possible — and even profitable — that’s a clear sign that something is fundamentally wrong,” Thunberg  wrote.\n Amazon operates 175 centers worldwide, spanning more than 150 million square feet of space where employees prepare items to be shipped and delivered to customers around-the-clock.\n  In a statement emailed to The Washington Post on Wednesday, an Amazon spokesperson contradicted ITV’s allegation that the company was sending items to landfill sites, adding that the location was also a recycling site.\n   “We are working towards a goal of zero product disposal and our priority is to resell, donate to charitable organisations or recycle any unsold products,&#34; the statement said. “No items are sent to landfill in the UK. As a last resort, we will send items to energy recovery, but we’re working hard to drive the number of times this happens down to zero.”\n According to ITV, John Boumphrey, Amazon’s country manager for the United Kingdom, said the number of items being destroyed by the company was “extremely small.”\n Since the original investigation was shared,  another whistleblower who was previously employed by the company at a large warehouse in Hertfordshire, England, said that “lots of things from brand new iPhones to PlayStations” were destroyed, along with books that had never been read.\n  The man, who has not been identified, also reported that people working at other Amazon centers across the country had similar accounts of usable products going to waste.\n  ITV News noted that the reason for the destruction of the goods may be attributable to Amazon’s business model. Companies worldwide store items in warehouses owned by the online shopping giant. However, if the items fail to sell, they are charged rising fees that some may struggle to pay, leading to piles of goods that need to be stored — or dumped — elsewhere.\n Lawmaker Siobhain McDonagh of the opposition Labour Party  said it was “appalling” that the company had destroyed items that could have benefited many children across the country — especially amid the  coronavirus pandemic. Many families struggle to educate their children from home during the outbreak, often with inadequate or limited digital equipment.\n  The coronavirus has ravaged Britain, causing more than 128,000 deaths and three nationwide lockdowns that forced schools across the country to close.\n  Many Britons, also concerned by the investigation, demanded to know why items that appeared to be in good condition were being dumped when vulnerable people or charities could have used the goods.\n A recent  report from the United Nations Children’s Fund (UNICEF) called on the British government to stop what it called “digital exclusion” of young people in Britain. It said digital access was “no longer a luxury” but a necessity that “must be seen as the cornerstone to ensuring social justice and equitable life chances for every child.”\n   In 2019, the French newspaper Le Monde reported that Amazon destroyed an estimated 3.2 million unsold products in 2018. “Amazon, seller of mass destruction,” the headline at the time  read.\n     The most important news stories of the day, curated by Post editors and delivered every morning.", "posttime": "2021-06-24 16:25:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,摧毁,official,物品", "title": "亚马逊的镜头摧毁英国数千个未售出的物品提示呼吁官方调查 ", "title_en": "Footage of Amazon destroying thousands of unsold items in Britain prompts calls for official investigation", "transed": 1, "url": "https://www.washingtonpost.com/world/2021/06/23/amazon-uk-warehouses-destroy-items/", "via": "", "real_tags": ["amazon", "亚马逊", "摧毁", "official", "物品"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067920, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载 ：\r\r  作为一个展望，\r 或来自您的包裹经理（例如\r  Ubuntu或\r  pkgs.org）或直接从本网站\r  64bit 32bit.\n  A＆＃34;分层电子表格＆＃34;这是电子表格的大替代品，铭记映射器，outliners，pims，\r 文本编辑器和小型数据库。\n  适用于任何类型的数据组织，例如todo列表，日历，\r 项目管理，头脑风暴，组织理念，规划，要求\r 收集，呈现信息等\n  它像电子表格一样＆＃39;立即熟悉，但更适合\r 对于复杂数据，因为它＆＃39; s等级。\r   它和＃39; s喜欢映射器，但更具组织和紧凑。\r   它和＃39; s喜欢在一起，但在一个以上的维度。\r   它和＃39; s喜欢文本编辑器，但具有结构。\n  快速查看应用程序的样子\r  屏幕截图页面，看看它是多么容易\r  教程，然后给它一个下载（上面）。\r 有人制作的视频（在Linux上）\n  Treesheets非常小＆amp;快，所以可以坐在你的系统中\r 托盘始终：加载了几个文件，代表等效\r 几乎100页的文本，它仅在Windows上使用5MB内存\r 7（！）\n    加入\r  不和谐或\r  谷歌小组讨论。\r 抓取源代码\r  github或文件错误在那里报告/功能请求。\r 过去的捐款页面。\r  请亲自联系作者（Wouter Van Oortmerssen）。 ", "note_en": "D O W N L O A D :\r\r  As an  AppImage,\r or from your package manager (e.g.\r  Ubuntu or\r  pkgs.org) or directly from this site\r  64bit  32bit\n  A &#34;hierarchical spreadsheet&#34; that is a great replacement for spreadsheets, mind mappers, outliners, PIMs,\r text editors and small databases.\n  Suitable for any kind of data organization, such as todo lists, calendars,\r project management, brainstorming, organizing ideas, planning, requirements\r gathering, presentation of information, etc.\n  It&#39;s like a spreadsheet, immediately familiar, but much more suitable\r for complex data because it&#39;s hierarchical.\r   It&#39;s like a mind mapper, but more organized and compact.\r   It&#39;s like an outliner, but in more than one dimension.\r   It&#39;s like a text editor, but with structure.\n  Have a quick look at what the application looks like on the\r  screenshots page, see how easy it is to use in the\r  tutorial, then give it a download (above).\r A  video someone made (on Linux)\n  TreeSheets is exceptionally small &amp; fast, so can sit in your system\r tray at all times: with several documents loaded representing the equivalent\r of almost 100 pages of text, it uses only 5MB of memory on Windows\r 7 (!)\n    Join the\r  Discord or\r  google group for discussion.\r Grab the source code from\r  GitHub, or file bug reports there / feature requests there.\r The past  donations page.\r  contact the author (Wouter van Oortmerssen) personally.", "posttime": "2021-06-24 16:17:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,数据,cross,映射器", "title": "Treesheets：跨平台，自由形式数据管理器应用程序 ", "title_en": "Treesheets: cross-platform, free-form data organizer app", "transed": 1, "url": "http://strlen.com/treesheets/", "via": "", "real_tags": ["程序", "数据", "cross", "映射器"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067919, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "关于694经典和当代小说的一个新的计算研究表明，语言的使用方式反映了男女之间的已知心理差异。\n  结果还表明，正如认知神经科学所预测的那样，同性恋男性作者用语言与直男性不同，实际上更接近妇女的写作，而女同性恋的女性的写作略微转向直男。\n 奥克兰大学博士博士使用了计算机化的文本分析，解剖了在19世纪初从19世纪初到现今的小说中番茄素质的妇女的写作方式。\n 他分析了6690万字，从主要由英国，美国和爱尔兰作者写的小说中。\n 异性恋作者的样本包括典当线的作品，如詹姆斯乔伊斯的尤利西斯，简奥斯汀的感觉和敏感，以及赫曼梅尔维尔的莫比迪克，以及当代畅销作者的作品。\n 同性恋样本包括1963年John Reghy's Nought的经典，1928年的Radclyffe Hall的孤独井，以及来自大量当代同性恋作者的小说。\n 在研究中，罗托博士说，与直男性相比，女性使用更多的社会词语，个人代词，积极的情感词和与悲伤和焦虑有关的词语。 \n“异性恋男性，相比之下，使用更多的文章，数字，空间词，死亡和愤怒相关的词，发誓词和反映分析思维的词语。”\n  只需通过分析特定小说中的个人代词，文章和数字的频率（由异性恋作者编写），他表示可以猜测作者的性别约72％的准确性。\n 他说，调查结果很大程度上与已知的心理性别差异相一致，如男性更高的系统性认知风格，朝着＆＃39的更高的定位;事物＆＃39;而不是人，更加明显的空间认知风格和能力 - 以及女性更明显的同情认知风格，情感和人们的定位。\n 他说，同性恋男性作者有一个女性典型的写作风格，其特点是认知过程词，社会词，个人代词，动词和与积极情绪，悲伤和焦虑有关的词语。\n “就像异性恋女性一样，同性恋者的文章频率较低，分析思维词，空间词，数字和死亡相关的词语而不是异性恋男性。通过男性作者分析个人代词，文章和数量的频率，可以猜测它们是否是异性恋或同性恋，精度大约69％。\n “同性恋的性别转变假设表明，同性恋男性是女性化的，同时在某些神经行为和心理特征上阳性妇女阳性。这种假设通常在心理学和认知神经科学中得到支持，但目前的研究为来自文学提供了新的支持，＆＃34为此提供了新的支持;他说。\n 罗托博士表示，整体结果表明，之前的语言使用的性别差异估计可能已经低估了。 \n“本研究介绍了比以前的语言使用性别差异的研究，包括出版年份，作者年龄，作者的性取向和书面领域，只有小说。 通过控制这些因素，这项研究的性别差异大得多比早先报道。“  他说，这个大型语料库的调查结果为66.9万字，表明了心理群体的基础是基于性别和性定向在语言使用中的两段文学中的语言用途。  “性取向的新发现对心理和语言学做出了特别重要的贡献，”他说。 ", "note_en": "A new computational study on 694 classic and contemporary novels suggests that how language is used reflects known psychological differences between men and women.\n  The findings also showed that, as predicted by cognitive neuroscience, gay male authors used language differently to straight men, in fact being closer to how straight women write, and lesbian women’s writing was slightly shifted towards that of straight men.\n Dr Severi Luoto from the University of Auckland used computerised text analysis to dissect the writing styles of men and women of differing sexual orientation in an electronic sample of novels spanning from the beginning of the 19th century to the present day.\n He analysed 66.9 million words in all, from novels that were written mainly by British, American and Irish authors.\n The sample by heterosexual authors included canonical works such as James Joyce’s  Ulysses, Jane Austen’s  Sense and Sensibility, and Herman Melville’s  Moby Dick, as well as works by contemporary bestselling authors.\n The homosexual samples included classics like John Rechy’s  City of Night from 1963 and Radclyffe Hall’s  The Well of Loneliness  from 1928, as well as novels from a large number of contemporary gay and lesbian authors.\n In the study Dr Luoto says that compared with straight men, women used more social words, personal pronouns, positive emotion words and words related to sadness and anxiety.\n “Heterosexual men, by contrast, used more articles, numbers, spatial words, death and anger-related words, swear words, and words that reflect analytical thinking.”\n  Simply by analysing the frequencies of personal pronouns, articles, and numbers in a given novel (written by a heterosexual author), he says it would be possible to guess the sex of the author with about 72 percent accuracy.\n He says the findings largely aligned with known psychological sex differences such as men’s higher systemising cognitive style, higher orientation towards &#39;things&#39; rather than people, and more pronounced spatial cognitive styles and abilities – as well as women’s more pronounced empathising cognitive style, emotionality, and people orientation.\n Fascinatingly, he says gay male authors had a female-typical writing style, characterised by high frequencies of cognitive process words, social words, personal pronouns, verbs, and words related to positive emotions, sadness, and anxiety.\n “Like heterosexual women, gay men had lower frequencies of articles, analytical thinking words, spatial words, numbers, and death-related words than heterosexual men. By analysing the frequencies of personal pronouns, articles, and numbers in a given novel by a male author, it would be possible to guess whether they are heterosexual or homosexual with approximately 69 percent accuracy.\n “The gender shift hypothesis of homosexuality suggests that homosexual men are feminised while homosexual women are masculinised on certain neuro-behavioural and psychological traits. This hypothesis is generally supported in psychology and cognitive neuroscience, but the current study provides new support for it from literature,&#34; he says.\n Dr Luoto says the overall results suggest that previous estimates about the magnitude of sex differences in language use may have been underestimated.\n “This study introduced stricter controls than previous studies on sex differences in language use, including publication year, authors’ age, authors’ sexual orientation, and domain of writing, with only novels included. With these factors controlled for, the magnitude of sex differences was much larger in this study than has been reported earlier.”\n He says the findings on this large corpus of 66.9 million words indicate how psychological group differences based on sex and sexual orientation manifest in language use across two centuries of literature.\n “The new findings on sexual orientation make a particularly important contribution to psychology and linguistics,” he says.", "posttime": "2021-06-24 16:17:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "语言,centuries,作者", "title": "跨越几个世纪的语言揭示性定位 ", "title_en": "Language use across centuries reveals sexual orientation", "transed": 1, "url": "https://www.auckland.ac.nz/en/news/2021/06/15/language-use-across-centuries-reveals-sexual-orientation.html", "via": "", "real_tags": ["语言", "centuries", "作者"]}, {"category": "", "categoryclass": "", "imagename": "4ca010f8975fce44de34a88d5ccc4683.jpg", "infoid": 1067918, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "（总体而言，明智的建立了双层股份结构，有两种阶段的股票，股票和B级股票，为了支持明智的关注其在公共市场转向公共市场的使命注意到。B级股票不是可交易的。）\n “该公司不会在A级股份上设定价格，或者提供与直接上市的任何阶级股份，”在声明中指出。 “股份的开盘价将在入场日期开放拍卖中确定。”虽然直接列表有点被取得了一条用于技术公司在美国公开的路线 - 另一个欧洲Juggernaut，Spotify的趋势 - 这是LSE的新转向，它在此过程中公布了自己的新规则聪明的日子宣布了它的计划。\n  与此同时，我们可以观看周围的更多详细信息，并在未来几天和几周内出现在招股说明书和其他相关陈述中。\n 绕过大型投资银行和更多传统上市的相关路线可以是一个大胆的举措，一个想要避免对该过程的波动和承诺的公司可能会选择他们觉得他们有足够的势头直接击中市场。今天明智的陈述暗示，基于其股份为智慧的客户提供了一些早期利息。\n “我很高兴地确认我们在伦敦直接上市的计划。这一过程将扩大明智的所有权，以支持我们的使命，以便在世界各地搬到世界各地的款项，“明智的主席和联合创始人在声明中的一个注释中。 “自从上周宣布预期的浮标意图，我们在我们的客户股东方案上有超过60,000个表达，其目的是旨在奖励购买明智股票并与我们坚持长期的客户。这个直接列表是关于我们的使命和我们的股东基地进一步调整，我非常自豪地为客户成为其中的一部分。“\n Wise是Fintech出来的欧洲巨大成功案例之一，而伦敦 - 公司成立于爱沙尼亚人Käärmann和塔韦特Hinrikus，即使通过Brexit的所有金融动荡，也陷入了困境。其1000万客户目前每月在跨境交易中处理大约70亿美元（50亿英镑），这仍然是其主要业务，即使它在新的财务服务的新相关领域多样化。在最近的财政年度，智慧的收入增长了5.86亿美元，高于4220万美元。税前代表5700万美元（4.1亿英镑），公司表示自2017年以来一直是有利可图的。\n B级股票将持有9票每股投票，严格不可转让，在其他投票权取消活动中，该公司确认的任何上市五周年过期。威斯威斯的股东和归属期权的持有人纳入2021年5月23日有权选择在1：1基础上获得额外的相应B股股份持有50％的股份持有股份持有股份（保存为KristoKäärmann，首席执行官和公司） - 它补充说，明智的明智者有权选择获得100％的班级持有本公司的股份持有额外的班级B股。 \n“凭借某些监管批准，凭借某些监管批准，凭借他们持有的B级股票，凭借股东，持有的股东不能持续超过35％的符合条件投票 任何股东决定（为kristoKäärmann保存），因为他的公司首席执行官，将在少于50％的符合条件的票据决定和 如果在任何时候，他不是公司的首席执行官，他将在任何股东决定的符合条件的投票的35％的人中覆盖。 B级股票是非可交易的，不会列出。“ ", "note_en": "(Overall,  Wise has put in place a dual-class share structure in place with two classes of shares in issue, class A shares and class B shares, in order to support Wise’s focus on its mission as it transitions into the public markets, it noted. Class B shares are not tradeable.)\n “The Company will not set a price in respect of the class A shares or offer any class A shares in connection with the direct listing,” it noted in the statement. “The opening price of the class A shares will be determined in the opening auction on the date of Admission.” While direct listings have somewhat taken off as a route for tech companies to go public in the U.S. — a trend spearheaded by another European juggernaut, Spotify — this is a new turn for the LSE, which  published its own new rules on the process the same day that Wise announced its plans.\n  In the meantime, we can watch for more details around the public offering, and updates about the company’s business, will be coming out in a prospectus and other related statements in the coming days and weeks.\n Bypassing the big investment banks and the related roadshow of a more conventional listing can be a bold move, one that companies who want to avoid the volatility and commitment of that process might opt to take if they feel they have enough momentum to hit the market directly. Wise in its statement today hinted that there has been some early interest, based on its share  offering to Wise customers.\n “I am pleased to confirm our plans for a direct listing in London. This process will broaden the ownership of Wise, in support of our mission to move money around the world faster, cheaper and more conveniently,” said Kristo Käärmann, CEO and co-founder of Wise, in a note in the statement. “Since announcing our expected intention to float last week, we’ve had over 60,000 expressions of interest in our customer shareholder programme, OwnWise, which is designed to reward customers who buy Wise shares and stick with us for the longer-term. This direct listing is about further aligning our mission and our shareholder base and I’m enormously proud that customers want to be a part of that.”\n Wise has been one of the huge success stories for fintech coming out of Europe, and London — founded by Estonians Käärmann and Taavet Hinrikus, the company’s been based out of London and has stuck with that even through all the financial turmoil of Brexit. Its 10 million customers currently process around $7 billion (£5 billion) in cross-border transactions every month, which remains its primary business even as it diversifies into newer, related areas of financial services. In its most recent financial year, Wise’s revenue grew to $586 million, up from $422 million. That represents $57 million (£41 million) in profit before tax, and the company says it has been profitable since 2017.\n Class B shares will hold 9 votes per share, are strictly non-transferable and, amongst other voting right cancellation events, expire on the fifth anniversary of any listing, the company confirmed. Wise’s shareholders and holders of vested options as at 23 May 2021 are entitled to elect to receive 50% of their class A share holding in the Company with additional corresponding class B shares on a 1:1 basis (save for Kristo Käärmann, CEO and co-founder of Wise, who is entitled to elect to receive 100% of his class A share holding in the Company with additional corresponding class B shares on a 1:1 basis), it added.\n “The voting rights attaching to the class B shares are, subject to certain regulatory approvals, capped so that no shareholder can, by virtue of the class B shares they hold, cast more than one vote less than 35% of the eligible votes in respect of any shareholder decision (save for Kristo Käärmann who, for so long as he is CEO of the Company, will be capped in respect of his class B shares at one vote less than 50% of the eligible votes in respect of any shareholder decision and if, at any time, he is not CEO of the Company he will be capped at one below 35% of the eligible votes in respect of any shareholder decision). The class B shares are non-tradeable and will not be listed.”", "posttime": "2021-06-24 15:35:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "报道,transferwise", "title": "智典（以前转移）在7月初的LSE上证实直接上市，据报道，估值为6B-$ 7B ", "title_en": "\n\t\t\t\tWise (formerly TransferWise) confirms direct listing on the LSE in early July, reportedly at a $6B-$7B valuation\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/23/wise-formerly-transferwise-confirms-direct-listing-on-the-lse-in-early-july-reportedly-at-a-6b-7b-valuation/", "via": "", "real_tags": ["报道"]}, {"category": "", "categoryclass": "", "imagename": "58a8034eb6528ae6cb9cb2ac66ec89cb.jpg", "infoid": 1067917, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Sorbet表示，它从雇主中消除了PTO的负担，让员工在提供的优惠和其他类型的优惠中“花费”，让雇主对整个过程进行更远的控制和预测的能力。它通过从员工购买PTO负债并在预付信用卡上加载PTO的现金价值来实现这一目标。然后，它为雇主融化了这些负债，因此预测优势。\n veetahl eilat-raichel，创始人兼首席执行官说：“很明显，我们在雇主 - 员工动态的构造转变中，累计全球利益超出了我们最疯狂的期望，我有很大的挑选和选择最佳投资者帮助我们扩大和加速。我可以想到没有比DOVI和整个第11队加入我们的更好的合作伙伴，并且很激动，谦卑地让他们和我们已经恒星的投资者群体一起。“\n  第11组创始合作伙伴的Dovi Frances表示：“在第11组，我们以我们独特地揭开明天unicorns的独特能力来骄傲。 Veetahl和团队做了一些非常困难的事情，这是揭示掩盖掩盖的大量市场效率。凭借270亿美元的市场机会，这是我的晶体对我来说是时候推进而不是回头看。“ ", "note_en": "Sorbet says it removes the burden of PTO from employers, allowing employees to ‘spend’ it in offers and other types of deals, giving employers far more control over the whole process and the ability to forecast ahead. It does this by buying out PTO liabilities from employees and loading the cash value of the PTO on prepaid Credit Cards. It then refinances these liabilities for employers, hence the forecasting advantage.\n Veetahl Eilat-Raichel, founder and CEO, said: “It’s clear that we’re in the midst of a tectonic shift in employer-employee dynamics and with inbound global interest exceeding our wildest expectations, I had the great privilege of picking and choosing the best investors to help us expand and accelerate. I can think of no better partner than Dovi and the entire Group 11 team to join us, and am thrilled and humbled to have them alongside our already stellar group of investors.”\n  Dovi Frances, Founding Partner, Group 11 said: “At Group 11 we pride ourselves in our unique ability to uncover the unicorns of tomorrow. Veetahl and the team did something exceedingly difficult which is to uncover a massive market inefficiency hiding in plain sight. With a $270B market opportunity, it was crystal clear to me this was the time to push forward and not look back.”", "posttime": "2021-06-24 15:35:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "时间,pto", "title": "有偿时间脱离冰糕卷轴 - 在三个月内在另外1500万美元 ", "title_en": "\n\t\t\t\tPaid Time Off startup Sorbet reels-in another $15M inside three months\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/paid-time-off-startup-sorbet-reels-in-another-15m-inside-three-months/", "via": "", "real_tags": ["时间", "pto"]}, {"category": "", "categoryclass": "", "imagename": "5f2e96248ec134df2e4fa62eeeb0021a.jpeg", "infoid": 1067916, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“静止”在量子和真实世界的鳞片上具有非常不同的含义 - 一个看起来完美留在我们的物体实际上由嗡嗡声和反弹的原子组成。现在，科学家们已经设法减慢了原子，几乎在最大的宏观规模对象中完成了完整的停止。\n 给定物体的温度直接绑定到其原子的运动 - 基本上，它的原子越热，周围的原子越多。通过延伸，物体如此寒冷的点，即其原子变得完全静止，一种被称为绝对零（-273.15°C，-459.67°F）的温度。\n 科学家们已经能够将原子和一组原子陷入绝对零的分数，几十年来，诱导称为动机地面状态。这是一个伟大的起点，然后创造异国情调的物质状态，例如过多的物质或似乎具有阴性质量的流体。\n 可以理解的是，与较大的物体更难做，因为它们由更多的原子组成，这些原子都与周围环境互动。但现在，一个大型的国际科学家团队已经破坏了最大的物体的记录，以诱导运动地位（或者非常接近一个，无论如何）。\n 大多数情况下，这些实验是用数百万原子云进行的，但在10kg（22磅）的物体上进行新试验，该物体几乎含有几乎八月原子。奇怪的是，“对象”不仅仅是一个东西本身，而是四种不同物体的组合运动，每个物质为40公斤（88磅）。\n 研究人员在Ligo进行了实验，这是一个巨大的设施，该设施，用于检测在地球上的引力波。它通过将激光射击两个4公里（2.5英里）的隧道，并用镜子弹回镜子 - 这些镜子是新研究冷却到动机地面状态的物体。\n 冷却原子原则上很简单 - 您只需用相等且相反的力抵抗其运动。但这需要极其精确地测量运动，并进一步复杂化，测量它们的行为可以对它们产生新的力量。 \n有趣的是，新的研究用它来到球队的优势。在Ligo的激光器中的光照光子在反弹时在镜子上施加微小的凸起，并且可以在以后的光子中测量这些干扰。由于光束是恒定的，科学家们有足够的数据关于镜子中原子的动作的数据 - 这意味着它们可以设计完美的抵消力。\n 为此，研究人员将电磁铁连接到每个镜子的后部，这几乎将它们的集体运动降低到动机地位。镜子移动的宽度小于一个质子的宽度，基本上冷却到清晰的77 nanokelvins  - 绝对零的毛发。\n “这与温度原子物理学家酷酷的原子可以达到其基地，这是一百万个原子的小云，称重皮科科技，”项目主任Vivishek Sudhir说。 “所以，这很值得注意的是，你可以冷却一些更重的东西到同一个温度。”\n 该团队表示，这种突破可以在宏观尺度上实现新的量子实验。\n “没有人曾经观察到重力在大规模的量子州的作用，”Sudhir说。 “我们已经证明了如何在量子状态中准备千克级对象。这最终打开了对重力可能影响大量子物体的实验研究的实验研究，迄今为止只有梦想。“ ", "note_en": "“Stationary” has very different meanings at quantum and real-world scales – an object that looks perfectly still to us is actually made up of atoms that are buzzing and bouncing around. Now, scientists have managed to slow down the atoms almost to a complete stop in the largest macro-scale object yet.\n The temperature of a given object is directly tied to the motion of its atoms – basically, the hotter something is, the more its atoms jiggle around. By extension, there’s a point where the object is so cold that its atoms come to a complete standstill, a temperature known as absolute zero (-273.15 °C, -459.67 °F).\n Scientists have been able to  chill atoms and groups of atoms to a fraction above absolute zero for decades now, inducing what’s called the motional ground state. This is a great starting point to then create exotic states of matter, such as  supersolids, or fluids that seem to have  negative mass.\n Understandably, it’s much harder to do with larger objects, because they’re made up of more atoms which are all interacting with their surroundings. But now, a large international team of scientists has broken the record for largest object to be induced into a motional ground state (or extremely closely to one, anyway).\n Most of the time, these experiments are done with clouds of millions of atoms, but the new test was performed on a 10-kg (22-lb) object that contains almost an  octillion atoms. Strangely enough, that “object” isn’t just one thing itself but the combined motion of four different objects, with a mass of 40 kg (88 lb) each.\n The researchers conducted the experiment at  LIGO, a huge facility famous for detecting gravitational waves as they wash over Earth. It does this by beaming lasers down two 4-km (2.5-mile) tunnels, and bouncing them back with mirrors – and those mirrors were the objects that the new study cooled to a motional ground state.\n Cooling atoms is simple in principle – you just have to counter their motion with an equal and opposite force. But that requires measuring their motion extremely precisely, and complicating things even further, the very act of measuring them can exert a new force on them.\n Intriguingly, the new study used this to the team’s advantage. The photons of light in LIGO’s lasers exert tiny bumps on the mirrors as they bounce off, and these disturbances can be measured in later photons. Since the beams are constant, the scientists have plenty of data about the motions of the atoms in the mirrors – meaning they can then design the perfect counteracting forces.\n To do so, the researchers attached electromagnets to the back of each mirror, which reduced their collective motion almost to the motional ground state. The mirrors moved less than one-thousandth the width of a proton, essentially cooling down to a crisp 77 nanokelvins – a hair above absolute zero.\n “This is comparable to the temperature atomic physicists cool their atoms to get to their ground state, and that’s with a small cloud of maybe a million atoms, weighing picograms,” says Vivishek Sudhir, director of the project. “So, it’s remarkable that you can cool something so much heavier, to the same temperature.”\n The team says that this breakthrough could enable new quantum experiments on the macro scale.\n “Nobody has ever observed how gravity acts on massive quantum states,” says Sudhir. “We’ve demonstrated how to prepare kilogram-scale objects in quantum states. This finally opens the door to an experimental study of how gravity might affect large quantum objects, something hitherto only dreamed of.”", "posttime": "2021-06-24 15:28:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "一动不动,induce,原子", "title": "物理学家在最大的物体中诱导一动不动的量子状态 ", "title_en": "Physicists Induce Motionless Quantum State In Largest Object Yet", "transed": 1, "url": "https://newatlas.com/physics/quantum-motional-ground-state-macro-object/", "via": "", "real_tags": ["一动不动", "induce", "原子"]}, {"category": "", "categoryclass": "", "imagename": "07fceb2227c245f6b5c2c09bec8685b9.jpg", "infoid": 1067914, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "那个肥皂的酒吧你这么严格地用一天多次擦洗你的手是你使用的最古老的消费产品之一，一个警告：很多现代肥皂根本不是肥皂。\n 肥皂可能起源于一个长期露水的副产品：肉，在火上烤;脂肪的球，滴落到灰烬中。结果是一种制造一种化学反应，它产生了一种光滑的物质，原来是抬起皮肤的污垢并让它被冲走。\n 书面食谱为肥皂约会近5000年，埃及别墅，埃及，古希腊和罗马的变化。这是一项来自炼金术师手册的方法发布了第八世纪之间的一段时间（甚至曾经花过大部分时间的巫师，他们试图将导致导致的金子变成洁净，明显地）。\n “从编织的柳条工程中从良好的日志中铺平灰烬的烧烤......并轻轻倒入它们上的热水，以便通过下降掉落。......澄清后，让它做饭。...添加足够的油并搅拌得很好。”古老的肥皂配方来自一个令人惊讶的方式，称为Mappae Clavicula，它大致从拉丁语翻译为“一点点对一切的关键”。炼金工的肥皂的配方要求橄榄油或牛肉脂肪。牛皮纸或动物脂肪以及Lye仍然是肥皂的基本成分。脂肪与Lye-一种在灰烬中制造的物质反应，这可能是含糊的毒性，这就是为什么SOAP制造商需要佩戴保护齿轮 - 在一个叫做皂化的过程中。可能来自原始德国Saipo，这意味着“疲劳”;拉丁皮脂，转化为“油脂”;或者来自Sapo山，这是一个意大利山，其位置现在失去了历史。 （故事是，来自众神的厨师火灾的滴滴和灰烬滚到山丘上，被污秽的罗马人发现了。）\n 现代化的肥皂制造商 - 至少工作的小型工匠操作 - 使用相同的技术。皂化过程产生浓稠的浆料。凝固时，脂肪中和苛性碱。 “48小时后，你有肥皂，”不列颠哥伦比亚省的Pep Soap温哥华娜塔莉·王说，该肥皂水皂，提供基于蔬菜和动物脂肪的酒吧。\n 肥皂的光滑降低了您将其混合的水的表面张力。在洗涤时摩擦你的手允许污垢暂时与水和肥皂粘合并被洗掉。大多数病毒和细菌可能发生相同的过程，这些病毒可能会在你手上挥之不去。肥皂不会杀死这些虫子 - 它将它们倒在上面，从皮肤上抬起它们，用水混合它们，并将它们沿排水管送到排水管。这种化学和机械反应使肥皂和水更有效，通常比无水消毒凝胶更有效。\n 如何选择和使用（并制造）喷涂，擦拭物和基于漂白剂的脱离式液体。 \n在美国，肥皂行业因培根和蜡烛而入门。照明是商业清洁剂历史的一个组成部分，因为两者都传统上是由动物副产品制成的。由于美国的工业化，人们搬走了养殖自己的动物进行屠宰，而是从屠夫购买。 1837年，辛辛那提烛光制造商威廉·重视人将注意力扩大到肥皂的照明，形成一家最终会发展的公司詹姆斯赌博进入世界上最大的消费品公司。 （一个良好的举动，由于煤气灯变得流行，而托马斯爱迪生和其他人使用电力将在几十年中贬低蜡烛到宗教仪式和洗澡时间场景。）\n 获得国家分配的第一个肥皂之一是Procter＆amp;赌博的象牙。最初被介绍为普通的白色肥皂，并旨在与西班牙卡斯蒂利肥皂（传统上由橄榄油制成）竞争，象牙的主要属性 - 在1870年代通过了一个圣经通道 - 它漂浮，它浮动公司声称是纯洁的指标。正式的创造神话是为本一个产品制造的，从根本上制造了屠宰牲畜的渲染;该故事涉及留下搅拌机，延长午休，额外的空气不小心泵入粘糊糊的集聚。 2004年，公司档案馆揭开了由詹姆斯赌博撰写的1863年的日记入口，似乎消除了浮力事故的传说：“我今天做了浮动肥皂，”赌博写道。 “我认为我们将以那种方式制作所有的库存。”\n 在19世纪的大部分时间到20世纪初，肥皂公司制造了真正的肥皂。但在20世纪初，德国工程师发现了一个备用清洁产品：一种称为“洗涤剂”的合成（粗糙拉丁翻译：擦除）。洗涤剂没有含有肥皂。相反，它们使用酶脱掉衣服和皮肤的酶。美国公司采用和精制洗涤剂，混合成分制造表面活性剂，如肥皂，允许污垢和润滑脂被拉出清洁物体并进入水中。 Greg McCoy，Procter＆amp说，远离肥皂的原因很简单。赌博公司档案馆：“洗涤剂清洁更好。”\n 结果是你今天所说的肥皂可能不是。至少没有完全。 “大多数液体清洁剂，既有液体和固体，实际上是合成洗涤剂产品，”出色的食物＆amp;药物管理局提供肥皂的法律定义。 “洗涤剂清洁剂很受欢迎，因为它们在水中轻松制造泡沫，而不是形成胶粘的沉积物。这些洗涤剂产品中的一些实际上被销售为“肥皂”，但根据该词的监管定义并非真正的肥皂。“\n 现代清洁剂还可含有额外的成分，包括含酒精，苯甲磺酸和氯氧基等含酒精，水软化剂和抗菌剂/抗病毒药物。 （Triclosan是美国最有效的细菌的添加剂之一，不再发现美国消费品;它在2016年禁止在2016年，鉴于医疗和环境问题。）这些现代清洁条可以含有一些与肥皂相同的成分动物脂肪出现在成分列表中作为牛油钠和脂肪酸钠，或植物脂肪如棕榈酸钠和椰子钠 - 但它们不是在法律/化学/炼金术意义上，真正肥皂。\n 中世纪的人面临疾病和疾病，就像人们今天一样。在古老的炼金术手册中，作为卫生用品的物体少描述肥皂，更像是成分（金焊料可以由皂，铜和染色剂的混合物制成，称为Calcothar）。尽管如此，来自价格挖出的手动消毒剂的财富是今天的件好事，即当今更复杂的清洁剂提供更实用和紧急的目的。\n 酒吧或液体？抗菌与否？大规模生产或“自然”？为了减缓冠状病毒的蔓延，只要你正确使用它就会做任何类型的肥皂。 \n经过65多小时的研究和测试28个洗涤剂，我们发现第七代菜液体对大多数人来说都是最好的。 你无法击败第七代的清洁能力。 此外，该公司在其产品中不使用染料或合成香料，并不能对动物进行测试。  最佳电缆和充电器将填充iPhone 11的电池，而不是框中包含的电池。  大多数性爱玩具只需要肥皂和水来保持清洁。 但是你可以使用其他简单方法消毒甚至消毒一些玩具。 ", "note_en": "That bar of soap you’re so rigorously scrubbing your hands with multiple times a day is one of the most ancient consumer products you use, with one caveat: A lot of modern soap isn’t soap at all.\n Soap likely originated as a by-product of a long-ago cookout: meat, roasting over a fire; globs of fat, dripping into ashes. The result was a chemical reaction that created a slippery substance that turned out to be great at lifting dirt off skin and allowing it to be washed away.\n Written recipes for soap date back nearly 5,000 years, with variations from Mesopotamia, Egypt, ancient Greece, and Rome. Here’s a method from an  alchemist’s manual published sometime between the eighth and 10th centuries (even wizards who supposedly spent most of their time trying to turn lead into gold needed to do so with clean hands, apparently).\n “Spread well burnt ashes from good logs over woven wickerwork … and gently pour hot water on them so it goes through drop by drop.… After it is clarified well, let it cook.… Add enough oil and stir very well.” The age-old soap recipe comes from an astonishing how-to guide called the  Mappae Clavicula, which roughly translates from Latin as “A Little Key to Everything.” The alchemist’s recipe for soap calls for either olive oil or beef tallow. Tallow, or animal fat, along with lye, remains a basic ingredient of soap. Fat reacts with lye—a substance made in ashes that can be pretty toxic, which is why soap makers need to wear protective gear—in a process called  saponification. The word possibly comes from the proto-German  saipo, which means “to strain”; the Latin  sebum, which translates as “grease”; or from Mount Sapo, an Italian mountain whose location is now lost to history. (The story is that the drippings and ashes from the cook fires of the gods rolled down the hill and were discovered by filth-encrusted Romans.)\n Modern soap makers—at least those working in small, artisanal operations—use the same techniques. The saponification process yields a thick slurry. As it solidifies, fat neutralizes the caustic lye. “After 48 hours, you’ve got soap,” says Natalie Wong, of Vancouver, British Columbia’s Pep Soap, which offers both vegetable- and animal-fat-based bars.\n The slipperiness of soap  lowers the surface tension of the water you’re mixing it with. Rubbing your hands together while washing allows dirt to temporarily bond with the water and soap and get washed away. The same process occurs with most viruses and bacteria that might be lingering on your hands. Soap doesn’t kill these bugs—it slips them up, lifting them from your skin, mixing them with water, and sending them down the drain. This chemical and mechanical reaction makes soap and water more effective, in general, than waterless sanitizing gels.\n How to choose and use (and make) sprays, wipes, and a bleach-based solution to disinfect surfaces.\n In America, the soap industry got started because of bacon—and candles. Lighting is an integral part of the history of commercial cleansers, because both have traditionally been made from animal by-products. As the United States industrialized, people moved away from raising their own animals for slaughter, instead purchasing from butchers. In 1837, Cincinnati candlemaker William Procter expanded his attentions from lighting to soap, forming a company that would ultimately evolve—with partner James Gamble—into the world’s largest consumer products company. (A good move, since gas lamps were  becoming popular, and Thomas Edison and others working with electricity would in a few short decades relegate candles to religious ceremonies and bathtime scene-setting.)\n One of the first soaps to gain national distribution was Procter &amp; Gamble’s Ivory. Originally introduced as a plain white soap, and designed to compete with Spanish castile soap (traditionally made from olive oil), the primary attribute of Ivory—the name was adopted in the 1870s, after a biblical passage—was that it floated, which the company claimed was an indicator of purity. A formal creation myth was manufactured for a product that was fundamentally the renderings of slaughtered livestock; the tale involved a mixing machine left on, an extended lunch break, and extra air accidentally pumped into a gooey agglomeration. In 2004, company archivists uncovered an 1863 diary entry, written by James Gamble, that seemed to dispel the legend of the buoyant accident: “I made floating soap today,” Gamble wrote. “I think we’ll make all of our stock that way.”\n For most of the 19th century and into the early 20th century, soap companies made real soap. But in the early 1900s, German engineers discovered an alternate cleaning product: a synthetic called “detergent” (rough Latin translation: to wipe away). Detergents didn’t contain soap. Instead, they used enzymes that lifted stains off clothing and skin. American companies adopted and refined detergents, mixing ingredients to create surfactants, which, like soap, allowed dirt and grease to be pulled off the object being cleaned and into water. The reason for the move away from soap was simple, says Greg McCoy, Procter &amp; Gamble’s corporate archivist: “Detergents clean better.”\n The result is that what you’re calling soap today probably isn’t. At least not completely. “Most body cleansers, both liquid and solid, are actually synthetic detergent products,” states a Food &amp; Drug Administration  handout that provides the legal definition of soap. “Detergent cleansers are popular because they make suds easily in water and don&#39;t form gummy deposits. Some of these detergent products are actually marketed as ‘soap’ but are not true soap according to the regulatory definition of the word.”\n Modern cleansers can also contain additional ingredients, including brighteners, water softeners, and antibacterials/antivirals like alcohol, benzalkonium chloride, and chloroxylenol. (Triclosan, one of the most effective bacteria-fighting additives, is no longer found in US consumer products; it was banned in 2016 in light of medical and environmental concerns.) These modern cleaning bars can contain some of the same ingredients as soap—animal fats, which appear on ingredient lists as sodium tallowate and sodium lardate, or vegetable fats like sodium palmitate and sodium cocoate—but they are not, in the legal/chemical/alchemical sense, really soap.\n People in the Middle Ages faced disease and sickness, just as people do today. In the ancient alchemy manual, soap is described less as an object used in sanitation and more as an ingredient (gold solder can be made from a mixture of soap, copper, and a dyeing agent called calcothar). Riches from price-gouged bottles of hand sanitizers notwithstanding, it’s a good thing that today’s more complicated cleansers serve a more practical and urgent purpose.\n Bar or liquid? Antibacterial or not? Mass-produced or “natural”? To slow the spread of the coronavirus, any kind of soap will do—as long as you use it correctly.\n After more than 65 hours of research and testing 28 detergents, we found the  Seventh Generation Dish Liquid is the best for most people. You can’t beat the cleaning power of Seventh Generation. Plus, the company doesn’t use dyes or synthetic fragrances in its product, and it doesn’t test on animals.\n The best cables and chargers will fill an iPhone 11’s battery faster than the ones included in the box.\n Most sex toys require nothing more than soap and water to keep clean. But you can sanitize and even sterilize some toys using other simple methods.", "posttime": "2021-06-24 15:26:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,肥皂,history", "title": "肥皂的历史（2020） ", "title_en": "The History of Soap (2020)", "transed": 1, "url": "https://thewirecutter.com/blog/history-of-soap/", "via": "", "real_tags": ["2020", "肥皂", "history"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067913, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "位置敏感散列（LSH）是一组技术，可大大加速邻居搜索或近复制检测数据。例如，可以使用这些技术以令人印象深刻的速度过滤刮出刮网页的重复，或者从地理空间数据集执行附近点的近常数时间查找。\n    让我们快速看看其他类型的哈希函数，以获得作为哈希函数的鸟瞰图，以及LSH如何适合该世界。传统用于哈希函数的用途是哈希表。作为提醒，散列表中使用的散列函数旨在将一条数据映射到整数，该整数可以用于在哈希表中查找特定存储桶以检索或删除该元素。许多包含字符串键的容器，例如JavaScript对象或Python词典，基于哈希表。虽然哈希表可能无法保证恒定时间查找，但实际上它们有效地提供了它们。\n  还有其他类别的哈希功能。例如，SHA-1加密散列函数难以反转，如果您希望将某人的密码作为散列值将某人的密码存储为有用。像这些这样的散列函数称为加密散列函数。\n    它们将某种类型的输入（例如字符串或浮点）映射到离散值，例如整数。\n  它们的设计使得两个输入将导致基于输入的关键属性的散列输出。\n  以下是LSH的适合：位置敏感散列函数专门设计，使得哈希值冲突更有可能靠近一起的两个输入值，而不是对于相距远的输入。正如不同用例的安全散列函数的不同实现一样，对于不同数据类型的LSH函数的不同实现以及用于靠近的不同定义。我将使用条款邻居或附近地将我们认为“足够近”的积分在一起，以至于我们要注意到他们的相似性。在这篇文章中，我将简要概述LSH背后的关键想法，并通过称为随机投影的想法来查看一个简单的示例，我将在下面的第2节中定义。\n    掌握LSH后面的主要想法可能会更容易，与您可以联系的示例。这样我们就可以在潜入那些我们在下一节中使用的那些随机投影之前建立一些直觉。 \n假设你有一百万人来自美国的所有人都站在一个巨大的房间里。让你的工作让人在一起靠近自己的群体。想象一下，走到每个人的时间，要求他们的街道地址，将其映射到拉特/长对，然后写代码以找到地理集群，然后再次走到每个人并告诉他们如何找到他们的其余部分。我只是思考时间复杂性。\n  以下是解决此问题的更好方法：在海报板上写下每个美国邮政编码，并将其中的邮政编码从天花板上悬挂。然后告诉大家在他们居住的邮政编码下站在邮政编码下。\n  瞧！这更容易，对吗？这也是LSH背后的主要想法。我们正在采取任意数据类型（一个人，我们可以将其视为包括他们的街道地址的吨数据），并将数据映射到一组离散值（邮政编码）中，使得可能靠近在一起的人哈希相同的价值。换句话说，群集（具有相同邮政编码的人）很可能是邻居的组。\n  邮政编码方法的一个很好的好处是它是并行友好的。而不是要求沟通中心，每个人都可以直接向目的地行走，而无需进一步协调。鉴于结果（邻居集群）完全基于输入之间的关系，这有点令人惊讶。\n  此示例的另一个属性是它是近似的：有些人可能会彼此住在街上，但恰好具有不同的邮政编码，在这种情况下，它们在此处不会聚集在一起。正如我们将在下面那样看到的，即使它们相距很远，数据点也可以聚集在一起，虽然精心设计的LSH至少可以给出一些数学证据，这将是一个罕见的事件，以及一些实现设法保证这永远不会发生。\n    在本节中，我将究竟解释一个相对简单的LSH方法的工作原理，探索该LSH系统的一些关键参数，并查看原因这项技术比其他一些方法更快的数量级。\n  让我们从一个令人难以置信的简单数学函数开始，我们可以作为LSH对待。点定义\\（h_1：{\\ mathbb {r}} ^ 2 \\ to {\\ mathbb {z}} \\ point \\（x =（x_1，x_2）\\中{\\ mathbb {r}} ^ 2 \\）经过 \n也就是说，\\（h_1（x）\\）是其中\\（a \\ le x_1. \\）的最大整数\\（a \\），例如，\\（h_1（（3.2，-1.2））= 3. \\）\n  让我们假设我们通过用半径4统一地采样来统一采样，随机选择点：\n  \\ [\\ mathcal c：= \\ {（x，y）：x ^ 2 + y ^ 2 \\ le 4 ^ 2 \\}。 \\\n  假设我们想找到\\（\\ Mathcal C \\）中的哪些点在一起。我们可以通过考虑点\\（a，b \\ in \\ mathcal c \\）来估计这种关系，当\\（h_1（a）= h_1（b）中聚集在一起。\\）介绍介绍的表示法\\（a \\ SIM b \\）表示\\（a \\）和\\（b \\）位于同一群集中。用那个表示法，我们可以写下我们当前的哈希设置\n        你可以立即看到一些点距离但是聚集在一起，而其他点则相对较近但未陷入困境。也有一种感觉，任意选择该特定哈希函数\\（H_1 \\）以聚焦在X轴上。如果我们使用的话，则发生了相同的数据？（H_2（x）：= \\ lfloor x_2 \\ rfloor？\\）结果是图3。\n    虽然两者群体都是惊人的，但如果我们同时使用它们都可以更好地工作。也就是说，我们可以通过重新定义我们的聚类\n  \\ [a \\ sim b \\ iff \\ begin {is} h_1（a）= h_1（b），\\ text {} \\\\ h_2（a）= h_2（b）。 \\\\ \\结束{案例} {\\ class {smallscrneg} {}} \\ qquad（1）\\] \n这使得避免与分数相距远远有所了解的更好的工作，虽然我们在下面看到，我们仍然可以改进。\n    到目前为止，我们已经确定了确定性散列函数。让我们通过选择随机旋转矩阵\\（u \\）以及随机偏移\\（b \\在[0,1）中的随机偏移\\（b \\）来改变它。给定这样一个随机\\（u \\）和\\ （b，\\）我们可以通过以下方式定义新的哈希函数\n    在哪里我使用的符号\\（（\\ textit {vec}）_1 \\）来指示矢量值Vec的第一个坐标。 （即，符号\\（（UX）_1 \\）表示向量\\（UX \\）的第一坐标。）此功能是我提到的随机投影。\n  它似乎只使用这里的第一个坐标而不是任何其他坐标，但是我们采用随机旋转的事实是指我们具有相同的可能性，具有相同的概率分布，正如我们当时拔出任何其他单个坐标值。\n  使用随机散列函数的一个关键优势是我们想要制作关于性能的任何概率陈述（例如，“99％这个算法将为我们提供正确的答案”）同样适用于所有数据，而不是应用于某些数据数据集但不是别人。作为对比，考虑Quicksort通常快速的方式，但是讽刺地使用\\（O（n ^ 2）\\）时间来排序预先排序的列表;这是一种性能取决于数据的情况，我们想避免这种情况。如果我们使用的是确定性哈希函数，那么有人可以为我们的哈希函数选择最坏情况的数据，我们将陷入困难的性能（例如，选择最大限度地分开的点仍然被我们的\\仍集中在一起（h_1）上面的函数）。通过使用随机选择的散列函数，我们可以确保我们的散列函数的任何平均行为同样适用于所有数据。相同的透视对于以通用散列形式的哈希表而言。\n  让我们重新审视我们上面使用的示例点，但现在应用一些随机散列函数。在图4中，如果两个散列值（来自\\（h_1（x）\\）和\\（h_2（x）\\））碰撞，则群集点是群集的。我们将使用同样的想法，但这次选择四个旋转\\（u_1，\\ ldots，u_4 \\）以及四个偏移\\（b_1，\\ ldots，b_4 \\）来定义\\（h_1（），\\ ldots， H_4（）\\）通过\n    图5显示了结果的聚类。这一次，有100分，自从使用更多散列函数有效地使群集区域变小。我们需要更高的点密度来查看现在聚集在一起的点。 \n我们实际上想要使用我们所有四个哈希函数并不明显。问题是我们的集群变得非常小。有几种方法可以解决这个问题。一个是简单地增加散列函数的规模;例如，设置：\n    其中\\（s \\）是一个比例因子。在此设置中，较大的\\（s \\）值将导致更大的群集。\n  但是，我们可以看一些更细微的一些细微差别，这是为了允许我们所要求的哈希碰撞的一些适应性。换句话说，假设我们有\\（k \\）总哈希函数（刚刚上面，我们有\\（k = 4 \\））。在我们说两点在同一群集中之前，我们可以匹配所有\\（k \\ \\ \\）哈希值，而不是坚持全部\\（k \\）哈希值，我们可以查看其中的一些数字\\（j \\ le k \\）匹配的情况。要在数学上说明这一点，我们将重写等式（1）\n    这里发生了有趣的事情，这是\\（a \\ sim b \\）关系不再是群集，而是变得更像是在图中的邻接（即共享边缘）。不同之处在于，在群集中，如果\\（a \\ sim b \\）和\\（b \\ sim c，\\）那么我们也必须具有\\（a \\ sim c \\）;这被称为过境关闭。图表不需要拥有此属性。同样，我们的相似关系\\（a \\ sim b \\）是过境关闭的。\n  它可能有助于您的直觉在图5中查看同一100点的\\（a \\ sim b \\）的新定义。这次，在图6中，有20个随机哈希，我们看到了图表由等式（3）生成，使用截止值（\\（j \\）的值）为6,7,8和9.图6中的左上图具有在两个点（a \\）之间绘制的边缘。 （b \\）每当有至少6个哈希函数\\（h_i（）\\）时，\\（h_i（a）= h_i（b），\\）出可能的20个使用的散列函数。\n    事实上，我们可以可视化所有可能的截止值6或更高 - 这些是等式（3）中的\\（j \\）的值 - 使用具有加权边缘的单个图像，如图7所示。记住我们避风港'T明确地计算了任何成对距离到达此数据。\n    有另一种有趣的方式来构建我们散列提供的信息的直觉。让我们来看看圆的区域，其中所有点与给定查询点具有相同数量的哈希冲突。我们可以通过显示一个示例查询点\\（q \\），并根据区域点具有\\（q \\）的哈希冲突的数量阴影每个区域;这如图8所示。每个阴影区域中的每个点都具有所用散列函数的所有散列值。图8的第一部分显示了双哈希系统的缩放版本（使用\\（h_1（）\\）和\\（h_2（）\\），类似于我们之前看到的图4）;第二部分使用5个随机哈希。最黑暗的区域包含点\\（p \\），其中所有哈希值碰撞，所以\\（h_i（p）= h_i（q）\\）所有\\（i \\）。在一个轻微阴影的区域中，方程式将仅适用于散列函数的较小子集\\（h_i（）。\\） \n图8的第二部分（5个哈希）显示了更好的行为，我会尝试解释原因。想象一下，我们正在为某些理论上完美的LSH设置绘制相同的图像，以便以某种程度地设法将点\\（Q \\）匹配，其中一些点\\（|| pq || \\ le r \\）匹配（r \\）;所有其他点都不匹配。对于该完美的LSH设置，像图8这样的图像将显示一个带有\\（Q \\）的固定大小的圆，与\\（q \\）一起移动。考虑到这一点是完美的LSH结果，请注意，图8中的第二部分比第一部分更接近这种理想。请记住，阴影区域内的查找不再通过数据线性搜索，而是\\（k）哈希表查找的交点 - 即附近点的查找明显更快。\n    它可能进一步帮助您的直觉来了解加权的边缘如何如何与图7中的邻居连接到其邻居，作为单个查询点Memives的变化。这是图9背后的想法，其中加权边缘在移动查询点和100个随机点之间绘制。请注意，边缘加权做出直观的感觉：它们倾向于强烈地连接到非常靠近的邻居，弱到更远的邻居，并根本不超过一定距离。\n      到目前为止，我们已经看到，我们可以使用哈希查找来查找附近的查询点的邻居，并且使用\\（k \\）不同的随机散列函数使我们比我们使用单个哈希函数更准确的查找。图7和图9的有趣属性是我们使用不同数量的哈希冲突 - 通过变量\\（j \\） - 发现点之间的不同程度。在许多应用程序中，例如查找附近的重复或关闭地理空间点，我们只想要二进制输出，因此我们必须为\\（j \\）选择特定的值。让我们讨论如何选择良好的值\\（j。\\）\n    为了回答这个问题，让我们暂时考虑一个完美的功能会为我们做些什么。我们将调用此功能搜索（Q）。在理想的世界中，此函数返回查询点的固定距离内的所有点。我们可以在查询点\\（q \\）周围以\\（n  -  \\）尺寸球体可视化。呼叫搜索（q）应该返回在此领域内生活的所有索引点\\（p \\）。\n  让我们从那种理想化的算法转到我们的快速但近似的地方敏感哈希世界。通过这种方法，没有确切的截止距离，尽管我们保持了附近邻居在返回的列表中的财产，并且很可能被排除在返回的列表中。由于我们的哈希函数是随机的，我们可以考虑邻居关系\\（p \\ sim q \\）作为一个随机变量，一旦我们的所有参数都是固定的（作为提醒，我们的主要）参数是\\（j \\）和\\（k））。\n  现在考虑在这个随机变量的上下文中的表现很好。理想情况下，有一些距离\\（d \\）这样\n  \\ [|| p-q || ＆lt; D- \\ varepsilon {\\四{\\ {类smallscr} {\\ hskip -0.8em}}} \\ RIGHTARROW {\\四{\\ {类smallscr} {\\ hskip -0.8em}}} p（P \\ SIM Q）＆GT ; 1  -  \\ delta; \\] \\ [|| p-q || ＆gt; d + varepsilon {\\ quad {\\ class {smallscr} {smallscr} {\\ hskip -0.8em}}}}}} \\ lightarrow {\\ quad {\\ class {smallscr} {\\ hskip -0.8em}} p（p \\ sim q）＆lt; \\三角洲。\\] \n换句话说，这个距离\\（d \\）就像我们近似搜索功能的截止一样。返回比距离\\（d \\）更接近查询点\\（q \\），而较进一步的点不是。\n  我写了一个Python脚本来计算特定参数\\（k = 10 \\）的一些概率，\\（d = 2 \\）（\\（d \\）是点的维度的维度），以及各种值（j \\）。特别是，我将输入点限制为某些距离，并测量它们至少具有不同\\（j \\）值的哈希冲突的概率。如果您熟悉有条件概率，则该值可以写为：\n    我写的那里（p \\ sim_j q \\）表示点\\（p \\）和\\（q）至少具有\\（j \\）哈希冲突。\n  使用此Python脚本，我可以在图10中可视化\\（p \\ sim_j q \\）的碰撞行为，如图10所示的\\（j \\）更详细地详细介绍盒子图上的每个刻度表明，但直觉是，较短的盒子图更好，因为在这个可视化中，较短的盒子曲线表明较小的不确定性范围。\n    该图最有趣的元素是\\（j \\）的最佳值似乎是\\（j = 6. \\）您可能猜到了您最好的LSH方法是坚持以前必须碰撞所有的随机哈希您认为两个要点是邻居，但这种测量表明直觉是假的。\n  那么我们在图10中究竟究竟究竟是什么？传统盒子绘图可视化一组标量数据点的第25和第75百分位数作为框的边界。中位数（50百分位数）也在框内显示，但我们不包括图10中的类似标记。在任一端的“晶须”可以指示最小值和最大值，或类似的东西，例如极值删除异常值后。\n  在我们的情况下，我们为\\（j \\）的每个值有一个盒子图，每个绘图都被归一化，以便底部晶须都以值为1对齐。（我将解释为什么在片刻中为什么这是有用的。）底部晶须表示\\（p \\）和\\（q \\）之间的距离，因此\\（p \\ sim_j q \\）是真正的99％的时间。盒子的底部是\\（p \\ sim_j q \\）的相对距离是真正的75％的时间。继续在这种模式中，盒顶对应于我们在25％的时间内获得冲突的距离，顶部晶须是我们在1％的时间内发生冲突的距离。由于盒子图全部归一化（意味着每个\\（j \\）值全部被最小的距离分开），因此很容易看出每个盒子绘图位置与其最小距离的比率。换句话说，很容易看到哪个距离范围最小。 \n因为我喜欢数学和精度，我将提供最后一个定义来形式化图10的想法。给定值\\（s \\ in（0,1）\\），定义距离\\（d_s \\）作为满足给定等式的价值：\n    其中\\（p \\ sim_j q \\）意味着\\（\\＃\\ {i：h_i（p）= h_i（q）\\} \\ ge \\）直观地，如果\\（\\ varepsilon \\）接近零，然后距离\\（d_ \\ varepsilon \\）很大，因为\\（p \\ sim_j q \\）的概率很小。 \\（d_ {1/2} \\）的值是完美的距离，以便\\（p \\ sim_j q \\）发生一半的时间，\\（d_ {1- \\ varepsilon}}是一个小距离\\（p \\ sim_j q \\）几乎一直发生。使用此定义，从底部到顶部的每个盒子图中显示的四个值，是：\n  \\ [d _ {。99} / d _ {。99}，{\\; \\; {\\ class {smallscr} {\\ hskip -0.3em}} d _ {。75} / d _ {。99}，{\\; ; {\\ class {smallscr} {\\ hskip -0.3em}} d _ {。25} / d _ {。99}，{\\; \\; {\\ class {smallscr} {\\ hskip -0.3em}} d_ { .01} / d _ {。99}。\\]\n    到目前为止，我们一直坚持二维数据，因为这更容易在文章中可视化。但是，如果您认为每二维点计算10个哈希值，以便找到邻居，可能觉得您可以通过您的点进行线性搜索的简单解决方案。让我们查看使用LSH的案例比查找附近积分的其他方法更有效。\n  LSH有两种方式可以加快速度：通过帮助您处理大量的积分，或通过帮助您处理诸如图像或视频数据的高维空间中的点。\n    如果您想找到靠近查询点的所有点\\（q，\\），您可以执行完整的线性搜索。单个哈希LSH可以在不断的时间内给您导致导致结果。这更快了。\n  如果您保留\\（j = k，\\），那么您的LSH结果是\\（j = k，\\）的\\（k。\\）值稍微复杂。然后，您的LSH结果是\\（k）不同列表的简单交点列出作为给定随机散列函数\\（h_i（）。\\）找到此交叉点返回的哈希碰撞点集 \n...... ", "note_en": "Locality-sensitive hashing (LSH) is a set of techniques that dramatically speed up search-for-neighbors or near-duplication detection on data. These techniques can be used, for example, to filter out duplicates of scraped web pages at an impressive speed, or to perform near-constant-time lookups of nearby points from a geospatial data set.\n    Let’s take a quick look at other types of hash functions to get a bird’s-eye view of what counts as a  hash function, and how LSH fits into that world. A traditional use for hash functions is in  hash tables. As a reminder, the hash functions used in a hash table are designed to map a piece of data to an integer that can be used to look in a particular  bucket within the hash table to retrieve or delete that element. Many containers with string keys, such as JavaScript objects or Python dictionaries, are based on hash tables. Although hash tables might not  guarantee constant-time lookups, in practice they effectively provide them.\n  There are other classes of hash functions as well. For example, the  SHA-1 cryptographic hash function is designed to be  difficult to reverse, which is useful if you want to store someone’s password as a hashed value. Hash functions like these are called   cryptographic hash functions.\n    They map some type of input, such as strings or floats, to discrete values, such as integers.\n  They’re designed so that two inputs will result in hash outputs that are either different or the same based on key properties of the inputs.\n  Here’s how LSH fits in: Locality-sensitive hash functions are specifically designed so that hash value collisions are  more likely for two input values that are  close together than for inputs that are far apart. Just as there are different implementations of secure hash functions for different use cases, there are different implementations of LSH functions for different data types and for different definitions of being  close together. I’ll use the terms  neighbors or  being nearby to refer to points that we deem “close enough” together that we’d want to notice their similarity. In this post, I’ll give a brief overview of the key ideas behind LSH and take a look at a simple example based on an idea called  random projections, which I’ll define in section 2 below.\n    It will probably be much easier to grasp the main idea behind LSH with an example you can relate to. This way we can build some intuition before diving into those random projections that we’ll use in the next section.\n  Suppose you have a million people from across the United States all standing in a huge room. It’s your job to get people who live close together to stand in their own groups. Imagine how much time it would take to walk up to each person, ask for their street address, map that to a lat/long pair, then write code to find geographic clusters, and walk up to every person again and tell them how to find the rest of their cluster. I cringe just thinking about the time complexity.\n  Here’s a much better way to solve this problem: Write every U.S. zip code on poster boards and hang those from the ceiling. Then tell everyone to go stand under the zip code where they live.\n  Voila! That’s much easier, right? That’s also the main idea behind LSH. We’re taking an arbitrary data type (a person, who we can think of as a ton of data including their street address), and mapping that data into a set of discrete values (zip codes) such that people who live close together probably hash to the same value. In other words, the clusters (people with the same zip code) are very likely to be groups of neighbors.\n  A nice benefit of the zip code approach is that it’s  parallel-friendly. Instead of requiring a center of communication, every person can walk directly to their destination without further coordination. This is a bit surprising in light of the fact that the result (clusters of neighbors) is based entirely on the  relationships between the inputs.\n  Another property of this example is that it is  approximate: some people may live across the street from each other, but happen to have different zip codes, in which case they would not be clustered together here. As we’ll see below, it’s also possible for data points to be clustered together even when they’re very far apart, although a well-designed LSH can at least give some mathematical evidence that this will be a rare event, and some implementations manage to guarantee this can never happen.\n    In this section, I’ll explain exactly how a relatively straightforward LSH approach works, explore some key parameters for this LSH system, and review why this technique is an order of magnitude faster than some other approaches.\n  Let’s start with an incredibly simple mathematical function that we can treat as an LSH. Define  \\(h_1:{\\mathbb{R}}^2 \\to {\\mathbb{Z}}\\) for a point  \\(x=(x_1, x_2)\\in{\\mathbb{R}}^2\\) by\n    that is,  \\(h_1(x)\\) is the largest integer  \\(a\\) for which  \\(a\\le x_1.\\) For example,  \\(h_1((3.2, -1.2)) = 3.\\)\n  Let’s suppose we choose points at random by uniformly sampling from the origin-centered circle  \\(\\mathcal C\\) with radius 4:\n  \\[ \\mathcal C := \\{ (x, y) : x^2 + y^2 \\le 4^2 \\}. \\]\n  Suppose we want to find which of our points in  \\(\\mathcal C\\) are close together. We can estimate this relationship by considering points  \\(a, b \\in \\mathcal C\\) to be clustered together when  \\(h_1(a) = h_1(b).\\) It will be handy to introduce the notation  \\(a \\sim b\\) to indicate that  \\(a\\) and  \\(b\\) are in the same cluster. With that notation, we can write our current hash setup as\n        You can immediately see that some points are far apart yet clustered, while others are relatively close yet unclustered. There’s also a sense that this particular hash function  \\(h_1\\) was arbitrarily chosen to focus on the x-axis. What would have happened with the same data if we had used instead  \\(h_2(x) := \\lfloor x_2 \\rfloor?\\) The result is figure 3.\n    While neither clustering alone is amazing, things start to work better if we use both of them simultaneously. That is, we can redefine our clustering via\n  \\[ a \\sim b \\iff \\begin{cases} h_1(a) = h_1(b), \\text{and} \\\\ h_2(a) = h_2(b). \\\\ \\end{cases} {\\class{smallscrneg}{ }}\\qquad(1)\\]\n      This does a much better job of avoiding clusters with points far apart, although, as we’ll see below, we can still make some improvements.\n    So far we’ve defined deterministic hash functions. Let’s change that by choosing a random rotation matrix  \\(U\\) (a rotation around the origin) along with a random offset  \\(b \\in [0, 1).\\) Given such a random  \\(U\\) and  \\(b,\\) we could define a new hash function via\n    where I’m using the notation  \\(( \\textit{vec} )_1\\) to indicate the first coordinate of the vector value  vec. (That is, the notation  \\((Ux)_1\\) means the first coordinate of the vector  \\(Ux\\).) This function is the  random projection I referred to earlier.\n  It may seem a tad arbitrary to use only the first coordinate here rather than any other, but the fact that we’re taking a random rotation first means that we have the same set of possibilities, with the same probability distribution, as we would when pulling out any other single coordinate value.\n  A key advantage of using randomized hash functions is that any probabilistic statements we want to make about performance (e.g., “99% of the time this algorithms will give us the correct answer”) applies equally to all data, as opposed to applying to some data sets but not to others. As a counterpoint, consider the way quicksort is typically fast, but ironically uses  \\(O(n^2)\\) time to sort a pre-sorted list; this is a case where performance depends on the data, and we’d like to avoid that. If we were using deterministic hash functions, then someone could choose the worst-case data for our hash function, and we’d be stuck with that poor performance (for example, choosing maximally-far apart points that are still clustered together by our  \\(h_1\\) function above). By using randomly chosen hash functions, we can ensure that any average-case behavior of our hash functions applies equally well to all data. This same perspective is useful for hash tables in the form of   universal hashing.\n  Let’s revisit the example points we used above, but now apply some randomized hash functions. In figure 4, points are clustered if and only if both of their hash values (from  \\(h_1(x)\\) and  \\(h_2(x)\\)) collide. We’ll use that same idea, but this time choose four rotations  \\(U_1, \\ldots, U_4\\) as well as four offsets  \\(b_1, \\ldots, b_4\\) to define  \\(h_1(), \\ldots, h_4()\\) via\n    Figure 5 shows the resulting clustering. This time, there are 100 points since using more hash functions has effectively made the cluster areas smaller. We need higher point density to see points that are clustered together now.\n    It’s not obvious that we actually want to use all four of our hash functions. The issue is that our clusters have become quite small. There are a couple ways to address this. One is to simply increase the scale of the hash functions; for example, set:\n    where  \\(s\\) is a scale factor. In this setup, larger  \\(s\\) values will result in larger clusters.\n  However, there is something a bit more nuanced we can look at, which is to allow some adaptability in terms of  how many hash collisions we require. In other words, suppose we have  \\(k\\) total hash functions (just above, we had  \\(k=4\\)). Instead of insisting that all  \\(k\\) hash values must match before we say two points are in the same cluster, we could look at cases where some number  \\(j \\le k\\) of them matches. To state this mathematically, we would rewrite equation (1) as\n    Something interesting happens here, which is that the  \\(a \\sim b\\) relationship is no longer a clustering, but becomes more like adjacency (that is, sharing an edge) in a graph. The difference is that, in a clustering, if  \\(a\\sim b\\) and  \\(b\\sim c,\\) then we must have  \\(a\\sim c\\) as well; this is called being  transitively closed. Graphs don’t need to have this property. Similarly, it’s no longer true that our similarity relationship  \\(a\\sim b\\) is transitively closed.\n  It may help your intuition to see this new definition of  \\(a\\sim b\\) in action on the same 100 points from figure 5. This time, in figure 6, there are twenty random hashes, and we’re seeing the graphs generated by equation (3) using cutoff values (values of  \\(j\\)) of 6, 7, 8, and 9. The top-left graph in figure 6 has an edge drawn between two points  \\(a\\) and  \\(b\\) whenever there are at least 6 hash functions  \\(h_i()\\) with  \\(h_i(a) = h_i(b),\\) out of a possible 20 used hash functions.\n    In fact, we can visualize all possible cutoff values of 6 or higher — these are values of  \\(j\\) in equation (3) — using a single image with weighted edges, as seen in figure 7. Keep in mind that we haven’t explicitly computed  any pairwise distances to arrive at this data.\n    There’s another fun way to build intuition for what information our hashes provide. Let’s visualize regions of the circle where all points have the same number of hash collisions with a given query point. We can do this by showing an example query point  \\(q\\), and shading each region based on the number of hash collisions the region’s points have with  \\(q\\); this is shown in figure 8. Every point in each shaded region has the same hash values for all the hash functions used. The first part of figure 8 shows a scaled version of the two-hash system (using  \\(h_1()\\) and  \\(h_2()\\), similar to figure 4) that we saw before; the second part uses 5 random hashes. The darkest region contains points  \\(p\\) where all hash values collide, so  \\(h_i(p) = h_i(q)\\) for all  \\(i\\). In a lightly shaded region that equation will only hold true for a smaller subset of the hash functions  \\(h_i().\\)\n  The second part of figure 8 (with 5 hashes) shows nicer behavior, and I’ll try to explain why. Imagine that we were drawing these same images for some theoretically perfect LSH setup that somehow managed to match point  \\(q\\) to every point  \\(p\\) with  \\(||p-q||\\le r\\) for some radius  \\(r\\); all other points were not matched. For that perfect LSH setup, images like figure 8 would show a fixed-size circle with center at  \\(q\\) that moved along with  \\(q\\). With that in mind as the perfect LSH result, notice that the second part in figure 8 is much closer to this ideal than the first part. Keep in mind that lookups within the shaded regions are no longer linear searches through data, but rather the intersection of  \\(k\\) hash table lookups — that is, lookups of nearby points are significantly faster.\n    It may further help your intuition to see how weighted edges connecting a point to its neighbors, like those in figure 7, change as a single query point moives. This is the idea behind figure 9, where weighted edges are drawn between a moving query point and 100 random points. Notice that the edge weightings make intuitive sense: they tend to connect strongly to very close neighbors, weakly to farther neighbors, and not at all to points beyond a certain distance.\n      So far, we’ve seen that we can use hash lookups to find nearby neighbors of a query point, and that using  \\(k\\) different randomized hash functions gives us much more accurate lookups than if we used a single hash function. An interesting property of figure 7 and figure 9 is that we used different numbers of hash collisions — via the variable  \\(j\\) — to discover different degrees of similarity between points. In many applications, such as finding near duplicates or close geospatial points, we only want a binary output, so we have to choose a particular value for  \\(j\\). Let’s discuss how to choose good values for  \\(j.\\)\n    To answer this question, let’s temporarily consider what a perfect function would do for us. We’ll call this function  search(q). In an ideal world this function returns all points within a fixed distance of the query point. We could visualize this as an  \\(n-\\)dimensional sphere around the query point  \\(q\\). A call to  search(q) ought to return all the indexed points  \\(p\\) that live within this sphere.\n  Let’s move from that idealized algorithm into our fast-but-approximate world of locality-sensitive hashes. With this approach, there is no exact cutoff distance, although we keep the property that nearby neighbors are very likely to be in the returned list and distant points are very likely to be excluded. Since our hash functions are randomized, we can think of the neighbor relationship  \\(p\\sim q\\) as being a  random variable that has a certain probability of being true or false once all our parameters are fixed (as a reminder, our main parameters are  \\(j\\) and  \\(k\\)).\n  Now consider what great performance looks like in the context of this random variable. Ideally, there is some distance  \\(D\\) such that\n  \\[||p-q|| &lt; D-\\varepsilon {\\quad{\\class{smallscr}{\\hskip -0.8em}}}\\Rightarrow{\\quad{\\class{smallscr}{\\hskip -0.8em}}}P(p\\sim q) &gt; 1 - \\delta;\\]  \\[||p-q|| &gt; D+\\varepsilon {\\quad{\\class{smallscr}{\\hskip -0.8em}}}\\Rightarrow{\\quad{\\class{smallscr}{\\hskip -0.8em}}}P(p\\sim q) &lt; \\delta.\\]\n  In other words, this distance  \\(D\\) acts like a cutoff for our approximate search function. Points closer than distance  \\(D\\) to query point  \\(q\\) are returned, while points farther are not.\n  I wrote a Python script to calculate some of these probabilities for the particular parameters  \\(k=10\\) and  \\(d=2\\) ( \\(d\\) is the dimensionality of the points), and for various values of  \\(j\\). In particular, I restricted my input points to certain distances and measured the probability that they had at least  \\(j\\) hash collisions for different  \\(j\\) values. If you’re familiar with conditional probabilities, then this value can be written as:\n    where I’ve written  \\(p\\sim_j q\\) to denote that points  \\(p\\) and  \\(q\\) have at least  \\(j\\) hash collisions.\n  Using this Python script, I’ve visualized the collision behavior of  \\(p\\sim_j q\\) for various  \\(j\\) in figure 10. I’ll go into more detail about what each tick on the box plot indicates, but the intuition is that shorter box plots are better because in this visualization a shorter box plot indicates a smaller range of uncertainty.\n    The most interesting element of this graph is that the best value of  \\(j\\) appears to be  \\(j=6.\\) You might have guessed that your best LSH approach is to insist that  all of your random hashes must collide before you consider two points to be neighbors, but this measurement shows that intuition to be false.\n  So what exactly did we measure in figure 10? A traditional box plot visualizes the 25th and 75th percentiles of a set of scalar data points as the boundaries of the box. Often the median (50th percentile) is also shown within the box, but we don’t include an analogous mark in figure 10. The “whiskers” at either end may indicate the minimum and maximum values, or something similar such as the extreme values after removing outliers.\n  In our case, we have one box plot for each value of  \\(j\\), and each plot has been normalized so that the bottom whiskers all align at value 1. (I’ll explain why this is useful in a moment.) The bottom whisker indicates the distance between  \\(p\\) and  \\(q\\) so that  \\(p\\sim_j q\\) is true 99% of the time. The bottom of the box is the relative distance at which  \\(p\\sim_j q\\) is true 75% of the time. Continuing in this pattern, the box top corresponds to the distance at which we get collisions 25% of the time, and the top whisker is the distance at which we get collisions 1% of the time. Since the box plots are all normalized (meaning that the distances per  \\(j\\) value have all been divided through by the smallest distance), it’s easy to visually see the ratio of each box plot position versus its smallest distance. In other words, it’s easy to see which distance range is smallest.\n  Because I love math and precision, I’m going to provide one last definition to formalize the idea of figure 10. Given a value  \\(s \\in (0, 1)\\), define the distance  \\(D_s\\) as the value satisfying the given equation:\n    where  \\(p\\sim_j q\\) means that  \\(\\#\\{i : h_i(p) = h_i(q)\\} \\ge j.\\) Intuitively, if  \\(\\varepsilon\\) is close to zero, then the distance  \\(D_\\varepsilon\\) is large because the probability of  \\(p\\sim_j q\\) is small. The value of  \\(D_{1/2}\\) is the perfect distance so that  \\(p \\sim_j q\\) happens half of the time, and  \\(D_{1-\\varepsilon}\\) is a small distance where  \\(p \\sim_j q\\) happens almost all the time. Using this definition, the four values shown in each box plot of figure 10, from bottom to top, are:\n  \\[D_{.99} / D_{.99} ,{\\;\\;{\\class{smallscr}{\\hskip -0.3em}}}D_{.75} / D_{.99} ,{\\;\\;{\\class{smallscr}{\\hskip -0.3em}}}D_{.25} / D_{.99} ,{\\;\\;{\\class{smallscr}{\\hskip -0.3em}}}D_{.01} / D_{.99}.\\]\n    So far we’ve been sticking to 2-dimensional data because that’s easier to visualize in an article. However, if you think about computing 10 hashes for every 2-dimensional point in order to find neighbors, it may feel like you’re doing more work than the simple solution of a linear search through your points. Let’s review cases where using an LSH is more efficient than other methods of finding nearby points.\n  There are two ways an LSH can speed things up: by helping you deal with a huge number of points, or by helping you deal with points in a high-dimensional space such as image or video data.\n    If you want to find all points close to a query point  \\(q,\\) you could execute a full linear search. A single-hash LSH can give you results in constant time. That’s faster.\n  Things are slightly more complex for higher values of  \\(j\\) and  \\(k.\\) If you keep  \\(j=k,\\) then your LSH result is a simple intersection of  \\(k\\) different lists, each list being the set of hash collision points returned by a given randomized hash function  \\(h_i().\\) Finding this intersect\n......", "posttime": "2021-06-24 14:37:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "散列,locality", "title": "地区敏感散列简介 ", "title_en": "Introduction to Locality-Sensitive Hashing", "transed": 1, "url": "http://tylerneylon.com/a/lsh1/", "via": "", "real_tags": ["散列", "locality"]}]