[{"category": "", "categoryclass": "", "imagename": "b146ba9d16d8b0298f646fd1add63296.jpg", "infoid": 1072202, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(CNN Business) 今年早些时候，汤姆克鲁斯的视频开始在 TikTok 上出现，该演员做了一些令人惊讶的与汤姆克鲁斯类似的事情：在高档男装店里闲逛；炫耀硬币技巧；在 Dave Matthews Band 的“Crash Into Me”的简短演绎中，他调皮地咆哮着。在一段视频中，他咬了一口棒棒糖，惊讶地发现中间有口香糖。 “嗯，”他对着镜头说。 “太不可思议了。怎么没人告诉我有泡泡糖？太不可思议了！”尽管有着电影明星的头发、眯着眼睛和标志性的露齿笑，但这并不是真正的克鲁斯。在 2 月至 6 月期间发布的 10 个视频中，有一个人工智能生成的分身，旨在看起来和听起来像他。 Deepfakes 是“深度学习”和“伪造”这两个术语的组合，由视觉和 AI 效果艺术家 Chris Umé 在 Cruise 替身演员迈尔斯·费舍尔 (Miles Fisher) 的帮助下创建。这条假冒的 Cruise 非常受欢迎，在 TikTok 上获得了数千万的浏览量，这促使 Umé 在 6 月份与其他人联手创办了一家名为 Metaphysic 的公司。它使用相同的 deepfake 技术制作原本不可能的广告并修复旧电影。 Metaphysic 为客户设计的 deepfake 项目包括吉列剃须刀广告系列，该广告系列重现了年轻的 Deion Sanders 以及他 1989 年选秀日的样子，以及比利时足球协会的广告系列，该广告系列让两名已故的比利时球队经理起死回生。人们非常关注将深度伪造用于恶意目的的可能性，并且有充分的理由。 2017 年在 Reddit 上发布的第一个已知的 Deepfake 视频示例将名人的脸与色情明星的脸互换。从那时起，该技术经常被用于制作未经同意的色情内容。立法者还警告说，深度伪造可能会被用来误导美国公众。然而，越来越多的人相信，这项技术也可以很有趣，并且可以为电影、广告和其他形式的媒体实现令人难以置信的壮举，而这在以前即使是最好的特效也是不可想象的。 Metaphysic 的创始人设想使用 deepfakes 做任何事情，从让年长的艺人看起来更年轻，到创建可用于制作广告或任何类型内容的名人视频替身，而无需他们亲自到场。但正如最近关于使用已故厨师和电视名人 Anthony Bourdain 的人工智能生成声音的争议所表明的那样，即使是娱乐性使用这种有争议的技术也会引起人们的注意和道德问题。 “这项技术正在向前发展，无论有人喜欢它，真的，”Metaphysic 联合创始人汤姆格雷厄姆是一位总部位于伦敦的科技企业家，他告诉 CNN Business。他说，该公司的目标是“真正地、真正地专注于尝试以某种方式开发我们的产品”，以避免增加其他人已经创建的有害深度伪造。\n曾参与过 Deepfake 网络剧集“Sassy Justice”（来自“南方公园”的创作者）的试播集的 Umé 认为该技术的未来实际上是光明的。 “这是一个你拥有更多自由和更多创造性可能性的未来，”他说。在网上找到 deepfakes 变得很容易。一些智能手机应用程序甚至可以让您自己制作。但通常可以看出生成的视频已被篡改。 Umé 和 Metaphysic 所做的工作是不同的，更不用说困难和耗时。他们不只是试图制造深度伪造——制造商告诉 CNN Business 需要付出很多努力才能看起来像样——而且要尽可能地完美无瑕。对于 Umé 制作的 Cruise 视频，他说他首先花了大约两个半月的时间来训练一个关于这位好莱坞明星的视频和图像的 AI 模型，试图从尽可能多的角度和尽可能多的光照条件下捕捉他。根据 Umé 的说法，这可以让 AI 模型学习演员的皮肤在不同镜头中应该如何反应。乌梅说，因为目标是制作克鲁斯看似坦率的 deepfake 视频，而不是戏剧性的动作镜头，所以培训材料还包括克鲁斯的许多公开采访。 Umé 还需要为 deepfake 拍摄基础视频。根据 Umé 的说法，Fisher 是 Cruise 的身体（和声音）替身，提出了视频的概念。然后，Umé 花了两到三天的时间生成了一个将 Fisher 的镜头和 Cruise 的面部相结合的 Deepfake 视频，再加上大约 24 小时使用 AI 工具来做一些事情，比如提高视频质量。有时，Umé 会添加棘手的 AI 驱动的繁荣。例如，这个声称是大胡子克鲁斯炫耀他的 CD 收藏的 Deepfake 视频实际上是费舍尔、克鲁斯和第三个人（小胡子来自荷兰 DJ Bram Krikke）的组合。他认为，这些细节表明 AI 可以很好地用于改变演员的外貌——而不是使用传统的视觉效果来一次一帧地煞费苦心地改变视频。\n由于这项技术有多新，关于如何制作和共享深度伪造并没有明确的规则。例如，目前尚不清楚是否或何时应告知观众他们正在查看深度伪造，或者应制定哪些准则来管理深度伪造主题的同意流程。西北大学传播研究和计算机科学副教授 Nick Diakopoulos 认为我们可以从现有媒体中寻找一些线索。如果您在电影院看一部轰动一时的大片，您就会习惯于看到现实与特效的混合，并且您明白广告——比如 Metaphysic 为吉列工作的广告——是高度操纵性的。但他指出，深度伪造也可以个性化以吸引不同人口群体的人，或者您在深度伪造广告中看到的支持产品的名人可能会被选择来满足您的兴趣。在这些情况下，他认为披露可能是必要的，这样观众就不会感到被操纵。 “我认为这些道德问题真的很棘手，因为没有硬性规定，你可以划出一条明线，然后说，‘我们永远不会越过这条线’，”迪亚科普洛斯说。居住在曼谷的 Umé 和他在 Metaphysic 的联合创始人——Umé 的兄弟，在比利时的 Kevin 和 Graham——强调他们正在努力注意这种人工智能驱动技术对护栏的需求。也就是说，他们希望确保它的使用符合道德和适当。 Graham 说，该公司正在直接与想要深度伪造并使用自己的技术的客户合作，因此它知道自己对输出有一定的控制权。此外，商业项目还需征得主体同意。这些担忧是及时的，因为一部关于 Bourdain 的新纪录片包含三段 AI 生成的对话，这些对话似乎是他在说话。最初并没有向观众明确使用人工智能，Bourdain 分居的妻子后来在 Twitter 上表示反对。 （CNN 与 HBO Max 共同制作了这部纪录片；两者都有相同的母公司 WarnerMedia。）Umé 没有听到 Cruise 或他使用 AI 模仿的其他名人的任何抱怨。他说他确实联系了克鲁斯的管理层，提出如果克鲁斯不同意他们所做的事情，他会删除视频并交出对 TikTok 帐户的控制权。 Umé 说他只是得到了一个回复，表明消息已经收到。 Cruise 尚未公开评论深度造假，Cruise 的代表也没有回应 CNN Business 的评论请求。\n由于克鲁斯作为公众人物的身份，以及这些视频是轻松模仿的事实，它们似乎并没有违反 TikTok 规则，该规则禁止“合成或操纵的内容，通过扭曲事件真相的方式误导用户造成伤害。” “如果这些名人中的任何一个对我所做的事情感到难过，我会第一个将其删除，因为这不是我的本意，”乌梅说。 “但我喜欢让人着迷。”与此同时，在 TikTok 上，deeptomcruise 帐户添加了其他名人的 Deepfake，包括 7 月下旬歌手玛丽亚凯莉的视频。她穿着黑色皮革，坐在摩托车上，头戴黑色猫耳头盔。 “打赌你从没想过你会看到这个，是吧？”她笑着说，然后离开停车场。", "note_en": "(CNN Business)Earlier this year, videos of Tom Cruise started popping up on TikTok of the actor doing some surprisingly un-Tom-Cruise-like stuff:  goofing around in an upscale men&#39;s clothing store;  showing off a coin trick;  growling playfully during a short rendition of Dave Matthews Band&#39;s &#34;Crash Into Me.&#34;\n In one video,  he bites into a lollipop and is amazed to find gum in the center. &#34;Mmmmm,&#34; he says to the camera. &#34;That is incredible. How come nobody ever told me there&#39;s bubblegum? Incredible!&#34;\n  Despite the movie star hair, the eye-squinting and that trademark teeth-baring cackle, it wasn&#39;t really Cruise. The 10 videos, which were posted between February and June, featured an artificial intelligence-generated doppelganger meant to look and sound like him. The deepfakes — a combination of the terms &#34;deep learning&#34; and &#34;fake&#34; — were created by visual and AI effects artist Chris Umé with the help of a Cruise stand-in, actor  Miles Fisher.\n     This ersatz Cruise was so popular, racking up tens of millions of views on TikTok, that it inspired Umé to join up with others to launch a company called  Metaphysic in June. It uses the same deepfake technology to make otherwise impossible ads and restore old film. Metaphysic&#39;s deepfake projects for clients have included a  Gillette razor campaign that recreated a young Deion Sanders along with his 1989 draft-day look and a campaign for the  Belgian Football Association that brought two deceased Belgium team managers back to life.\n    Much attention has been placed on the potential for using deepfakes  for nefarious purposes, and for good reason. The first-known examples of deepfake videos, posted to Reddit in 2017, featured celebrities&#39; faces swapped with those of porn stars. Since then, the technology  has often been used for creating non-consenual pornography. Lawmakers have also  warned that deepfakes could be used to mislead the American public.\n  Yet Umé and his cofounders are among a  growing number of people who are convinced that the technology can also be fun and accomplish incredible feats for movies, ads, and other forms of media that were previously unthinkable even with the best special effects. The Metaphysic founders envision using deepfakes to do everything from making older entertainers appear younger to creating video doubles of famous people that can be used to make commercials — or any type of content — without needing them to be physically on set. But as a  recent controversy over the use of an AI-generated voice of the late chef and TV personality Anthony Bourdain shows, even entertainment uses of such controversial technology can raise eyebrows and ethical concerns.\n &#34;The technology is moving forward, whether anybody likes it, really,&#34; Metaphysic cofounder Tom Graham, a tech entrepreneur who&#39;s based in London, told CNN Business. The company&#39;s goal, he said, is to &#34;really, really focus on trying to develop our product in a way&#34; that avoids adding to the harmful deepfakes already being created by others.\n Umé, who previously worked on the pilot episode of deepfake web series &#34;Sassy Justice&#34; (from the creators of &#34;South Park&#34;), thinks the technology&#39;s future is actually bright. &#34;It&#39;s a future where you have more freedom and more creative possibilities,&#34; he said.\n    It&#39;s become easy to find deepfakes online.  Some smartphone apps even let you make them yourself. But it&#39;s often possible to tell that the resulting videos have been manipulated.\n The kind of work Umé and Metaphysic do is different, not to mention difficult and time consuming. They&#39;re not just trying to create deepfakes — which makers have told CNN Business require a lot of effort simply to look presentable — but ones that look as flawless as possible.\n For the Cruise videos that Umé made, he said he first spent about two and a half months just training an AI model on videos and images of the Hollywood star, trying to capture him from as many angles and in as many lighting conditions as possible. According to Umé, this lets the AI model learn how the actor&#39;s skin should react in different shots. Because the goal was to make seemingly candid deepfake videos of Cruise, rather than dramatic action shots, the training material also included lots of Cruise&#39;s public interviews, Umé said.\n  Umé also needed to shoot base videos for the deepfake. Fisher, the Cruise body (and voice) double, came up with the concepts for the videos, according to Umé. Then it took Umé two to three days to generate a deepfake video combining footage of Fisher with Cruise&#39;s face, plus about another 24 hours using AI tools to do things like enhance video quality.\n Sometimes, Umé adds tricky AI-driven flourishes. For instance,  this deepfake video purporting to be of a mustachioed Cruise showing off his CD collection is actually a combination of Fisher, Cruise, and a third guy (the mustache comes from Dutch  DJ Bram Krikke).\n Such details, he thinks, show how well AI can be used to change an actor&#39;s appearance — rather than using traditional visual effects to painstakingly alter a video one frame at a time.\n  Due to how new this technology is, there aren&#39;t clear rules about how deepfakes should be made and shared. It&#39;s not yet clear, for instance, if or when viewers should be informed that they&#39;re looking at a deepfake, or what guidelines should govern the consent process for the subject of a deepfake.\n  Nick Diakopoulos, an associate professor in communication studies and computer science at Northwestern University, thinks we can look to existing media for some hints. If you&#39;re watching a blockbuster hit at a movie theater, you&#39;re used to seeing reality blended with special effects, and you understand that ads — such as the one that Metaphysic worked on for Gillette — are meant to be highly manipulative. But deepfakes could also be personalized to appeal to people in different demographic groups, he pointed out, or a celebrity you see endorsing a product in a deepfake ad may be chosen to match your interests. In these situations, he thinks a disclosure might be necessary so the viewer doesn&#39;t feel manipulated.\n &#34;I think these ethics questions are really tricky because there aren&#39;t hard and fast rules where you can draw a bright line and say, &#39;We&#39;re never going to cross this line&#39;,&#34; Diakopoulos said.\n  Umé, who&#39;s based in Bangkok, and his cofounders at Metaphysic — Umé&#39;s brother, Kevin, who&#39;s in Belgium, and Graham — stressed that they&#39;re trying to be mindful of the need for guardrails on this AI-driven technology. That is, they want to make sure it&#39;s used ethically and appropriately.\n The company is working directly with clients who want deepfakes and using its own technology so it knows it has some control over the output, Graham said. Additionally, it requires consent of the subject for commercial projects.\n The concerns are timely, following  the revelation that a new documentary about Bourdain contained three bits of AI-generated dialogue that appeared to be of him speaking. The use of AI was not initially made clear to viewers and Bourdain&#39;s separated wife later spoke out against it  on Twitter. (CNN co-produced the documentary with HBO Max; both have the same parent company, WarnerMedia.)\n Umé hasn&#39;t heard any complaints from Cruise or the other celebrities he has parodied using AI. He said he did reach out to Cruise&#39;s management, offering to take down the videos and hand over control of the TikTok account if Cruise didn&#39;t approve of what they were doing. Umé said he simply got a response indicating the message had been received. Cruise hasn&#39;t publicly commented on the deepfakes, and representatives for Cruise did not respond to CNN Business&#39; requests for comment.\n Due to Cruise&#39;s status as a public figure, and the fact that the videos are lighthearted parodies, they appear not to run afoul of a TikTok rule that  prohibits &#34;synthetic or manipulated content that misleads users by distorting the truth of events in a way that could cause harm.&#34;\n &#34;If any of these celebrities would ever feel bad about what I&#39;m making, I&#39;ll be the first one to take it down because that&#39;s not my intent,&#34; Umé said. &#34;But I like to mesmerize people.&#34;\n   Meanwhile, on TikTok, the deeptomcruise account has added deepfakes of other celebrities, including, a video of singer Mariah Carey in late July. Clad in black leather while sitting on a motorcycle, she dons a black helmet with cat ears.\n &#34;Bet you never thought you&#39;d see this, huh?&#34; she says with a smile, before peeling out of a parking lot.", "posttime": "2021-08-09 07:09:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "电影,广告,深造,viral,视频", "title": "看看 Metaphysic，一家使用 deepfake 技术制作广告和修复旧电影的公司；其创始人因深造汤姆克鲁斯而在 TikTok 上走红", "title_en": "A look at Metaphysic, a company which uses deepfake tech to create ads and restore old film; its founder went viral on TikTok for deepfaking Tom Cruise", "transed": 1, "url": "https://www.cnn.com/2021/08/06/tech/tom-cruise-deepfake-tiktok-company/", "via": "", "real_tags": ["电影", "广告", "深造", "viral", "视频"]}, {"category": "", "categoryclass": "", "imagename": "c1b9f4d00ad13bb393286b8194f8612a.jpg", "infoid": 1072200, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为具有社会意识和环保意识的年轻大学生，我们都在努力让世界变得更绿色。但尽我们所能，我们也不总是有可支配收入来将这样一个可持续的目标变成现实。结果？嗯，我经常发现自己买了一瓶塑料水，然后重新装满同一瓶水大约一个星期。我不扔掉它不仅环保，而且我也为自己节省了几美元。对？一个食物神话目前正在盘旋，它阻止了我重新装水：重新装满塑料水瓶可能会杀了你。有人声称，重新装满塑料水瓶会使有害化学物质慢慢泄漏到饮用水中。我不了解您，但我不想在 SmartWater 中饮用致癌化学物质。这些可恶的水瓶谣言从何而来？美国食品和药物管理局声称它们来自一个病毒式的电子邮件骗局。声称这种化学品泄漏的信息来自爱达荷大学一名学生的硕士论文。本论文未经同行评审、FDA 审查或发表在科学期刊上。 FDA 讲述了一个不同的故事。美国的大多数饮料瓶都是由聚对苯二甲酸乙二醇酯 (PET) 制成的，FDA 已经确定使用 PET 对单次和重复使用都是安全的。没错，重复使用。看来我要给水瓶加水一个多星期了。美国食品和药物管理局确实指出，在不清洗的情况下重复使用塑料水瓶可能会滋生一些细菌。塑料本质上是一种卫生材料，但 FDA 建议您在两次使用之间用热肥皂水清洗瓶子。听起来很容易。判决？神话已经破灭，但请记住，新的和现有的研究正在不断审查中。现在，继续使用那个瓶子连续第十天。没有致癌化学物质泄漏到你的水中，如果你不洗一两次，我不会叫你出去。", "note_en": "As young socially aware and environmentally friendly college students, we all try to do our part in making the world a greener place. But try as we might, we also don’t always have the disposable income to turn such a sustainable goal into a reality. The result? Well I often find myself buying a plastic bottle of water and refilling that same bottle for about a week. Not only am I being environmentally friendly by not throwing it out, but I am also saving myself a few bucks. Right?\n A food myth is currently circling that has stopped me mid-refill: refilling plastic water bottles could be killing you.\n There are claims that refilling plastic water bottles slowly leaks harmful chemicals into the drinking water. I don’t know about you, but cancer-causing chemicals are not what I want to be drinking in my SmartWater. Where did these nasty water bottle rumors come from? The FDA claims they came from an e-mail hoax that went viral. The information claiming this chemical leakage stemmed from a University of Idaho student’s masters thesis. This thesis was not subject to peer review, FDA review or published in a scientific journal.\n The FDA told a different story. Most beverage bottles in the U.S. are made from polyethylene terephthalate (PET), and the FDA has determined that the use of PET is safe for both single  and repeated use. That’s right, REPEATED USE. Looks like I will be refilling water bottles for longer than a week.\n The FDA does note that reusing plastic water bottles  without washing them could possibly harbor some bacteria. Plastics are by nature a sanitary material, but the FDA recommends that you wash the bottle out with hot soapy water between uses. Sounds easy enough.\n The verdict? The myth has been busted, but do keep in mind that new and existing research is constantly under review. For now, go ahead and use that bottle for the tenth day in a row. No cancerous chemicals are leaking into your water, and if you skip washing it out once or twice, I won’t call you out on it.", "posttime": "2021-08-09 07:08:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "塑料,reuse,水瓶", "title": "重复使用塑料水瓶有害吗？", "title_en": "Is it bad to reuse plastic water bottles?", "transed": 1, "url": "https://spoonuniversity.com/lifestyle/reuse-water-bottles-not-bad-for-you", "via": "", "real_tags": ["塑料", "reuse", "水瓶"]}, {"category": "", "categoryclass": "", "imagename": "029841c68afd2f2202cb8d8ad63d1c8e.jpeg", "infoid": 1072199, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "戴口罩能减少儿童的 Covid 传播吗？信不信由你，我们只能找到一个关于这个问题的回顾性研究，其结果尚无定论。然而两周前，美国疾病控制和预防中心严厉颁布法令，无论社区感染率如何，5600 万美国儿童和青少年，无论是否接种疫苗，都应该遮住脸。许多地方的当局根据口罩不会造成任何伤害的理论，在学校和其他地方强加规定。那不是真的。有些孩子戴口罩没问题，但有些孩子却很挣扎。患有近视的人可能难以看清，因为面罩会使他们的眼镜起雾。 （这一直是手术室医学生的问题。）口罩会导致严重的粉刺和其他皮肤问题。戴口罩的不适会分散一些孩子的学习注意力。通过在呼气过程中增加气道阻力，面罩会导致血液中二氧化碳含量增加。如果口罩变湿或使用时间过长，口罩可能成为病原体的载体。今年 3 月，爱尔兰卫生部宣布学校不再要求戴口罩，因为它们“可能会加剧某些学生的焦虑或呼吸困难”。有些孩子通过嘴呼吸来弥补这种困难。慢性和长时间的口呼吸会改变面部发育。有充分证据表明，因为腺样体阻塞鼻气道而用嘴呼吸的儿童会出现嘴巴畸形和拉长的脸。广泛掩饰可能带来的心理伤害更令人担忧。面部表情是人际关系不可或缺的一部分，特别是对于年幼的孩子，他们只是在学习如何表达恐惧、困惑和快乐。遮住孩子的脸会削弱这些非语言形式的交流，并可能导致机器人和无情绪的互动、焦虑和抑郁。看到人们说话是语音发展的基石。这对听力障碍等残疾儿童尤其重要。需要戴口罩几周对发育的不利影响可能很小。当练习持续数月或数年时，我们不能有任何信心地说。 《华尔街日报》将向您收取 $ + 税款（如果适用）。您可以随时在客户中心更改您的计费偏好或致电客户服务。如果费率或条款发生任何变化，您将提前收到通知。您可以随时致电客户服务部取消订阅。", "note_en": "Do masks reduce Covid transmission in children? Believe it or not, we could find only a single retrospective study on the question, and its results were inconclusive. Yet two weeks ago the Centers for Disease Control and Prevention sternly decreed that 56 million U.S. children and adolescents, vaccinated or not, should cover their faces regardless of the prevalence of infection in their community. Authorities in many places took the cue to impose mandates in schools and elsewhere, on the theory that masks can’t do any harm.\n  That isn’t true. Some children are fine wearing a mask, but others struggle. Those who have myopia can have difficulty seeing because the mask fogs their glasses. (This has long been a problem for medical students in the operating room.) Masks can cause severe acne and other skin problems. The discomfort of a mask distracts some children from learning. By increasing airway resistance during exhalation, masks can lead to increased levels of carbon dioxide in the blood. And masks can be  vectors for pathogens if they become moist or are used for too long.\n  In March, Ireland’s Department of Health announced that it won’t require masks in schools because they “may exacerbate anxiety or breathing difficulties for some students.” Some children compensate for such difficulties by breathing through their mouths. Chronic and prolonged mouth breathing can alter facial development. It is  well-documented that children who mouth-breathe because adenoids block their nasal airways can develop a mouth deformity and elongated face.\n  The possible psychological harm of widespread masking is an even greater worry. Facial expressions are integral to human connection, particularly for young children, who are only learning how to signal fear, confusion and happiness. Covering a child’s face mutes these nonverbal forms of communication and can result in robotic and emotionless interactions, anxiety and depression. Seeing people speak is a building block of phonetic development. It is especially important for children with disabilities such as hearing impairment.\n  The adverse developmental effects of requiring masks for a few weeks are probably minor. We can’t say that with any confidence when the practice stretches on for months or years.\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2021-08-09 07:08:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "口罩,masks,可能", "title": "反对儿童戴口罩的案例", "title_en": "The Case Against Masks for Children", "transed": 1, "url": "https://www.wsj.com/articles/masks-children-parenting-schools-mandates-covid-19-coronavirus-pandemic-biden-administration-cdc-11628432716", "via": "", "real_tags": ["口罩", "masks", "可能"]}, {"category": "", "categoryclass": "", "imagename": "6a647d35ec22e4fba42a401455584012.png", "infoid": 1072198, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "包豪斯是20世纪最著名、最具影响力的艺术与设计学院。大多数经典形式用于包豪斯。通过使用我们的包豪斯艺术生成器，您可以创建您独特的设计。您可以轻松更改设置，例如形状和调色板，以创建您的独特风格！", "note_en": "The Bauhaus is the most famous and influential school of art and design in the 20th century. Mostly classical forms are used for the Bauhaus. By using our Bauhaus Art Generator, you can create your unique design. You can easily change settings, for example, shapes and palettes, to create your unique style!", "posttime": "2021-08-09 07:08:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "海报,poster,艺术", "title": "包豪斯海报生成器", "title_en": "Bauhaus Poster Generator", "transed": 1, "url": "https://tool.graphics/bauhaus", "via": "", "real_tags": ["海报", "poster", "艺术"]}, {"category": "", "categoryclass": "", "imagename": "f3a94aaf69d51eea05a5ba75dc9d8804.jpg", "infoid": 1072197, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着去年 11 月 Google 相册取消了其无限照片备份政策，照片备份和同步应用程序市场大大开放。我们在一月份审查了一个强有力的竞争者 - 亚马逊照片 - 自由职业者 Alex Kretzschmar 在 6 月份向我们介绍了几个自托管的替代方案。今天，我们正在寻找一个新的竞争者——Stingle Photos——它打破了差异，提供了一个与托管云同步的 FOSS 移动应用程序。可以说，加密是 Stingle Photos 最重要的功能。尽管该应用程序会将您的照片上传到 Stingle 的云服务，但该服务的运营商无法查看您的照片。这是因为在您的手机或平板电脑上运行的应用程序使用钠密码术对它们进行安全加密。由于照片在离开您的手机之前已经过加密（使用 Stingle 操作员永远无法使用的密钥），因此您可以避免攻击者从 Stingle 的云中获取照片转储。您也可以免受 Stingle 自己的运营商对您施加 LOVEINT 或被某个声音可信的人乞求取回您的照片的社会工程的影响。由于 Stingle 无法对照片的加密云备份做任何有用的事情，因此您也不必担心因将照片输入机器学习算法而发生的奇怪事情——它们只是垃圾，没有您的私钥的任何人。 Stingle 已经竭尽全力让关注安全和隐私的用户尽可能清楚地了解它的工作方式。该公司发布了一份详细的白皮书，概述了其安全实践，并对服务的运作方式进行了出色的概述。对于真正的偏执狂来说，访问应用程序的源代码可以在剩下的过程中缩小差距。访问源代码尤其有助于弥补 Stingle 可以和不能对您的照片做什么的潜在漏洞。由于云存储对除用户之外的任何人都没有用处，因此在照片被加密并发送到云之前（或在它们下载和解密之后），移动应用程序本身是唯一可以进行任何欺骗的地方.\n我们没有尝试对 Stingle Photos 应用程序进行完整的代码审核，但我们确实对代码进行了足够深入的研究，以便对它的功能和方式有一个很好的了解。没有明显的陷阱向我们扑来。默认情况下，Stingle Photos 将用户私钥的备份上传到 Stingle 云（该云在 Digital Ocean 上冗余托管，使用冗余的 Wasabi 存储桶）。这允许应用程序在新设备上运行，而无需用户自己手动繁琐地备份和恢复私钥。精明的用户可能会眉头一皱——如果 Stingle 有我的私钥，我怎么知道公司没有使用它？答案是密钥也被加密，然后将其捆绑并发送到云进行备份。 Stingle Photos 在本地对密码或密码进行散列并将散列上传到后端 Stingle Photos 将公钥和私钥捆绑在一起，然后使用用户的完整密码或密码对捆绑包进行加密 我们省略了相当多的繁琐细节，例如特定的算法、salt 等等——有兴趣且精通加密的人应该查看原始白皮书，看看我们在这里以可读性的名义跳过的部分。这里的关键是，Stingle 根本无法访问用户的真实密码或密码——只有它的散列。由于用户使用哈希来验证自己，但需要完整的密码——不仅仅是它的哈希——来解密密钥包，因此密钥包可以安全地远程存储。\n如果用户选择不备份密钥包，他们需要自己备份他们的私钥——Stingle 以 24 字 Diceware 式密码短语的形式提供。在第二台设备上安装 Stingle 应用程序后，用户需要手动将“备份短语”——这实际上是他们的私钥——导入第二台设备。另一方面，如果用户允许 Stingle Photos 备份密钥包，他们只需要密码即可访问第二台设备上的照片。登录后，第二台设备下载加密的密钥包，使用用户的完整密码或密码（请记住，永远不会离开设备）对其进行解密，一切都立即准备就绪。 Stingle 照片还支持可选的生物识别身份验证——如果您想访问备份的照片和视频而无需每次都输入密码，您可以注册指纹并使用它更快地解锁应用程序。我们在两款 Android 设备（Pixel 2XL 和华为 MediaPad M5 Pro）上测试了 Stingle Photos。对 iPhone 和 iPad 的支持即将到来，但尚未到来——以及对 Linux、Windows 和 Mac PC 的支持。该应用程序采用与 Google 照片、亚马逊照片或 Apple 照片截然不同的方法。这三个科技巨头的应用程序都试图在阳光下提供一切：机器学习对照片进行分类并将它们分类到画廊和相册中，打印和赃物创建服务等等。相比之下，Stingle 照片是鲜明而简约的。它导入照片（自动或手动，由用户决定），同步它们，并允许您将它们组织到相册中。除了典型的Android“共享”选项将（解密的）照片直接转储到另一个应用程序之外，几乎就是这样。例如，我们通过 Textra SMS 应用分享了一张照片，方法是点击该照片的分享图标，然后选择一个 Textra 联系人。自动或手动导入照片时，Stingle 提供在成功导入后删除它们的选项。如果您打开自动删除功能，就可以确保窃贼无法翻阅您的照片，即使他们解锁了手机本身——但这确实意味着 Stingle 不再是“备份”。相反，自动删除会将 Stingle 变成您照片的唯一存储库，如果 Stingle 丢失，所有照片都会丢失。\n没有可用于 Stingle 照片的 Web 客户端。所以现在，您需要一台 Android 设备来查看任何 Stingle 存储的照片。由于 Web 客户端不在 Stingle 已发布的路线图中的任何位置，我们预计即使 Windows、Linux 和 Mac 客户端可用，您仍然需要安装应用程序来查看照片，而不仅仅是使用您喜欢的网站登录浏览器。虽然我们主要指的是照片，但 Stingle Photos 可以交替管理视频和照片——就像大多数其他移动相机和备份应用程序一样。 Stingle 照片应用程序是免费的，您的第一个 1GiB 云存储也是免费的。 Stingle 的商业模式围绕那些需要超过 1GB 存储空间的人展开——我们相当有信心现在这意味着“每个人”，特别是因为 Stingle 以全分辨率存储您的照片和视频。甚至没有在加密和上传之前进行下采样的选项——您在本地存储的媒体就是您要备份的媒体。第一个付费级别是 100GiB，您需要每月支付 2.99 美元，或者您可以预先支付 29.90 美元一年的费用，从而节省两个月的费用。 300GiB 的费用为 4.99 美元/月，1TiB 的费用为 11.99 美元/月，3TiB 的费用为 35.99 美元/月，同样可以免费节省两个月的前期年度购买费用。 （更大的计划也适用于需要它们的人。）", "note_en": "With Google Photos  killing off its Unlimited photo backup policy last November, the market for photo backup and sync applications opened up considerably. We  reviewed one strong contender—Amazon Photos—in January, and freelancer Alex Kretzschmar walked us through several self-hosted  alternatives in June.\n Today, we&#39;re looking at a new contender— Stingle Photos—which splits the difference, offering a FOSS mobile application which syncs to a managed cloud.\n  Arguably, encryption is Stingle Photos&#39; most important feature. Although the app uploads your photos to Stingle&#39;s cloud service, the service&#39;s operators can&#39;t look at your photos. That&#39;s because the app, which runs on your phone or tablet, encrypts them securely using  Sodium cryptography.\n Since the photos are encrypted before ever leaving your phone—using a key that isn&#39;t ever available to Stingle&#39;s operators—you&#39;re safe from attackers getting a photo dump from Stingle&#39;s cloud. You&#39;re also safe from Stingle&#39;s own operators pulling a  LOVEINT on you or getting socially engineered by someone with a believable voice begging to get your photos back.\n Since Stingle can&#39;t do anything useful with the encrypted cloud backups of your photos, you also don&#39;t need to worry about strange things happening as a result of your photos being fed to machine-learning algorithms—they&#39;re just garbage bits, to anyone without your private key.\n  Stingle has gone out of its way to make the way it works as clear as possible to security- and privacy-focused users. The company put out a detailed  white paper outlining its security practices and giving an excellent overview as to how the service works. And for the truly paranoid, access to the application&#39;s  source code closes the gap the rest of the way.\n Having access to the source code especially helps close potential loopholes in what Stingle can and can&#39;t do with your photos. Since the cloud storage is effectively useless to anyone but the user, that leaves the mobile app itself as the only place to get up to any chicanery,  before the photos are encrypted and sent to the cloud (or after they&#39;re downloaded and decrypted).\n We did not attempt anything like a full code audit of the Stingle Photos app, but we did walk through the code far enough to have a good idea of what it&#39;s doing and how. No glaringly obvious gotchas leapt out at us.\n     By default, Stingle Photos uploads a backup of the user&#39;s private key to the Stingle cloud (which is hosted redundantly at Digital Ocean, using redundant  Wasabi buckets). This allows the app to function on a new device without the user having to manually and cumbersomely back up and restore the private key themselves.\n Astute users&#39; eyebrows likely just shot through the roof—if Stingle has my private key, how do I know the company isn&#39;t using it? The answer is that the key is also encrypted, before bundling it up and sending it to the cloud for backup.\n  Stingle Photos hashes the password or passphrase locally and uploads the hash to the back end\n  Stingle Photos bundles up the pubkey and privkey, then it encrypts the bundle using the user&#39;s full password or passphrase\n We&#39;re leaving out a fair amount of the hairy details, such as specific algorithms, salts, and so forth—interested and crypto-fluent folks should check out the original  white paper to see the bits we skipped over in the name of readability here.\n The key here is that Stingle never has access to the user&#39;s real password or passphrase at all—only a hash of it. Since the user authenticates themselves using the hash but needs the full password—not just its hash—to decrypt the key bundle, the key bundle is therefore safe to store remotely.\n If the user elects  not to back up the key bundle, they instead need to back up their private key themselves—which Stingle delivers in the form of a 24-word Diceware-style passphrase. After installing the Stingle app on a second device, the user would then need to manually import the &#34;backup phrase&#34;—which is really their private key—onto the second device.\n On the other hand, if the user allows Stingle Photos to back up the key bundle, they only need their password to access photos on a second device. After logging in, the second device downloads the encrypted key bundle, decrypts it with the user&#39;s full password or passphrase (which, remember, never leaves the device) and everything&#39;s instantly ready to go.\n Stingle Photos also supports optional biometric authentication—if you want access to your backed-up photos and videos without having to type in a passphrase every time, you can enroll your fingerprint and use it to unlock the app more quickly.\n        We tested Stingle Photos on two Android devices, a Pixel 2XL and a Huawei MediaPad M5 Pro. Support for iPhones and iPads is on the way but has not arrived yet—along with support for Linux, Windows, and Mac PCs.\n The app takes a very different approach than Google Photos, Amazon Photos, or Apple Photos. All three of the tech giants&#39; apps try to offer everything under the Sun: machine learning to categorize photos and sort them into galleries and albums, print- and swag-creation services, and more.\n Stingle Photos is stark and minimalist by comparison. It imports photos (automatically or manually, at the user&#39;s discretion), syncs them, and allows you to organize them into albums. That&#39;s pretty much it, apart from the typical Android &#34;sharing&#34; options which dump a (decrypted) photo into another app directly. We shared, for example, one photo via the Textra SMS app by tapping the share icon for that photo then selecting a Textra contact.\n When importing photos either automatically or manually, Stingle offers the option to delete them after successfully importing them. If you turn automatic deletion on, you ensure that a phone thief can&#39;t thumb through your photos, even if they unlock the phone itself—but it does mean Stingle is no longer a &#34;backup.&#34; Instead, auto-deletion turns Stingle into the sole repository for your photos, with all lost if Stingle is lost.\n No web client is available for Stingle Photos. So for right now, you&#39;ll need an Android device to view any Stingle-stored photos. Since a web client isn&#39;t anywhere on Stingle&#39;s published roadmap, we expect that even as Windows, Linux, and Mac clients become available, you&#39;ll still need to install an application to view photos—not just log into a website with your favorite browser.\n Although we&#39;ve referred mostly to photos, Stingle Photos manages videos and photos interchangeably—just like most other mobile camera and backup apps do.\n  The Stingle Photos app is free—as is your first 1GiB of cloud storage. Stingle&#39;s business model revolves around those who need more than that first gibibyte of storage—which we&#39;re fairly confident means &#34;everyone&#34; now, especially since Stingle stores your photos and videos at full resolution. There isn&#39;t even an option to downsample before encryption and uploading—the media you store locally is the media you&#39;re backing up, period.\n The first paid tier is 100GiB, for which you&#39;ll pay $2.99 per month—or you can pay $29.90 for a year up front, saving yourself the cost of two months. 300GiB costs $4.99/mo, 1TiB costs $11.99/mo, and 3TiB costs $35.99/mo, with the same two-months-free savings for upfront annual purchases. (Larger plans are also available for those who need them.)", "posttime": "2021-08-09 06:26:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,开源,照片,privacy", "title": "Stingle 是一个注重隐私的开源照片备份应用程序", "title_en": "Stingle is a privacy-focused, open source photo backup application", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/08/foss-mobile-app-stingle-wants-to-privately-securely-back-up-your-photos/", "via": "", "real_tags": ["程序", "开源", "照片", "privacy"]}, {"category": "", "categoryclass": "", "imagename": "e5ca962a16e147bf5bb359215ea21614.jpg", "infoid": 1072195, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在向紧急服务部门发出可能致命的跌落警报后，Apple Watch 被认为挽救了另一条生命。据《人物》报道，7 月 12 日，长岛 25 岁的布兰登·施奈德 (Brandon Schneider) 在腹痛和肾结石误诊后去了急诊室。施耐德要求使用洗手间，在那里他失去了知觉并倒在了地上。施耐德在接受 ABC 当地一家子公司的采访时说：“我记得洗手后心里想，肯定会发生一些事情。” “我不记得摔倒在地，或撞到我的头，或随后发生的任何事情。”幸运的是，施耐德戴着 Apple Watch。该设备的跌倒检测功能可以识别出这一事件，并向紧急服务部门以及当时与他在一起的父亲发出警报。 “我的 Apple Watch 检测到严重跌落，我没有响应需要响应和 45 秒的类似触觉消息，”施耐德说。随后的 CT 扫描显示颅骨骨折和多个越来越大的血肿。他接受了脑部手术，四天后醒来。\n虽然他不太记得事件或周围的日子，但他正在好转，并将他的幸存归功于 Apple Watch 和积极的生活方式。 Schneider 是 Peloton 销售专家和 I 级认证跑步教练。 “那些拥有 Apple Watch 的人可能能够设置他们的紧急联系人，我不知道是什么在发生这件事之前的某个时候激发了我的想法，以确保我有这样的设置，但我想鼓励人们这样做，”他说。 Apple Watch Series 4 引入了跌倒检测，是生物识别监测套件的一部分，涵盖心脏健康、血氧水平、活动能力、健康等。 AppleInsider 拥有附属合作伙伴关系，并且可以通过附属链接购买的产品赚取佣金。这些合作伙伴关系不会影响我们的编辑内容。", "note_en": "Apple Watch has been credited with saving yet another life after alerting emergency services to what could have been a fatal fall.\n  On July 12, 25-year-old Brandon Schneider of Long Island  visited the emergency room after suffering abdominal pain and a misdiagnosed kidney stone, reports  People.\n Schneider asked to use the bathroom, where he lost consciousness and fell to the ground.\n  &#34;I remember washing my hands and thinking to myself, is something going to happen,&#34; Schneider said in an  interview with a local ABC affiliate. &#34;I don&#39;t remember falling to the ground, or hitting my head, or anything of the events that followed.&#34;\n Luckily, Schneider was wearing an Apple Watch. The device&#39;s fall detection feature recognized the event and alerted emergency services, as well as his father who was with him at the time.\n &#34;My Apple Watch detected a hard fall, and I did not respond to the like haptic message that requires a response and 45 seconds,&#34; Schneider said.\n Subsequent CT scans revealed a fractured skull and multiple hematomas that were growing in size. He underwent brain surgery and woke up four days later.\n Though he doesn&#39;t remember much about the incident or surrounding days, he is on the mend and credits his survival to Apple Watch and an active lifestyle. Schneider is a Peloton Sales Specialist and a Level I certified running coach.\n &#34;Those who have an Apple watch, may be able to set up their emergency contacts, which I don&#39;t know what sparked the idea in me sometime before this incident occurred to make sure I had that setup, but I want to encourage people to do that,&#34; he said.\n Fall detection was introduced with  Apple Watch Series 4 and is part of a biometric monitoring suite that covers heart health, blood oxygen levels, mobility, fitness and more.\n    AppleInsider has affiliate partnerships and may earn commission on products purchased through affiliate links. These partnerships do not influence our editorial content.", "posttime": "2021-08-09 06:10:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,apple-watch,watch,施耐德", "title": "Apple Watch 因在跌倒后挽救了人类的生命而受到赞誉", "title_en": "Apple Watch Credited with Saving Man's Life After Fall", "transed": 1, "url": "https://appleinsider.com/articles/21/08/07/apple-watch-credited-with-saving-mans-life-after-fall", "via": "", "real_tags": ["apple", "watch", "施耐德"]}, {"category": "", "categoryclass": "", "imagename": "f30d8fbd998b70557ca6ce7dd295385c.jpg", "infoid": 1072194, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你的父母必须让你熬夜到 1981 年 8 月 1 日星期五/星期六午夜才能看到这个。这可能看起来完全古怪和拱...", "note_en": "Your parents had to have let you stay up till midnight Friday/Saturday August 1, 1981 to have ever seen this. This probably all seems totally quaint and arch...", "posttime": "2021-08-09 06:04:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "小时,hours,星期六", "title": "MTV (1981) 的前两个小时 [视频]", "title_en": "The first two hours of MTV (1981) [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=PJtiPRDIqtI", "via": "", "real_tags": ["小时", "hours", "星期六"]}, {"category": "", "categoryclass": "", "imagename": "828885d3ddfdc0495cd09016ded2f853.jpg", "infoid": 1072191, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "法国阿尔卑斯山上越来越多的彩色雪块可能是气候变化对山区产生影响的一个迹象。在宁静的山腰上遇到这种景象令人震惊，令人眼花缭乱。在春末夏初，在法国阿尔卑斯山徒步足够高，您很有可能会在灰色的石灰岩和矮小的植被丛中遇到一些相当奇怪的雪块。这雪不是白的，而是血红色的。这种奇特的现象——有时被称为血雪——是生长在高山雪中的微小藻类产生的防御机制的结果。通常，这些微藻呈绿色，因为它们含有叶绿素，这是大多数植物产生的色素家族，可帮助它们从阳光中吸收能量。然而，当雪藻大量生长并暴露在强烈的太阳辐射下时，它们会产生被称为类胡萝卜素的红色色素分子，作为遮阳板来保护它们的叶绿素。虽然红雪藻早已为人所知（在 1819 年出版的一本书中提到它是在 1818 年的北极探险中发现的），但它仍然沉浸在科学家们试图解开的谜团中。就在两年前，捷克共和国布拉格查尔斯大学的植物学家发现了一种全新的微藻属，它是导致世界不同地区出现红色和橙色雪的原因，他们将其命名为“Sanguina”，以参考它们产生的血红色。研究人员在欧洲、北美、南美以及两个极地地区发现了导致红色雪样的血红藻形式。在斯瓦尔巴群岛还发现了一种导致不寻常的橙色雪的 Sanguina 物种。不过，它并不是唯一一种导致红雪的微藻。其他几种类型，例如雪花衣藻和一种生长在南极企鹅群落附近的藻类，称为多翅目绿单胞菌，也会产生色素以产生红色和粉红色的雪。但是，更多地了解红雪藻的意义远大于简单地解释阿尔卑斯山和两极附近存在奇怪颜色的斑块。它的出现和消失是气候变化以及它如何影响发现藻类的脆弱生态系统的重要标志。\n根据位于波茨坦的德国地球科学研究中心界面地球化学教授 Liane G Benning 的说法，由于全球变暖，红雪变得越来越普遍。 “大气中二氧化碳含量的上升会提高温度，从而导致更多的雪融化，”她说。 “雪上有液态水的那一刻，藻类就开始生长。”越来越多的红雪藻也可能导致气候变化。红色颜料使雪面变暗，减少了它反射回太空的光和热量——这就是所谓的反照率效应。通过吸收更多的太阳热量，雪融化得更快，使藻类进一步增殖。 “有一种失控的效果，藻类融化了它们喜欢的栖息地，”本宁说。 “就好像他们在摧毁自己的房子一样。”在更广泛的范围内，有色雪吸收的额外热量可以改变更广泛环境的温度，加速积雪和冰川的融化。一项研究估计，在一个融化的季节里，红色藻华可以将积雪反照率降低 13%，这表明它在气候变化的影响如何在山区环境中被放大方面发挥着重要作用。研究表明，从南极洲到喜马拉雅山再到北极，世界各地的冰川上都会出现红藻大量繁殖。因此，像 Benning 和法国格勒诺布尔细胞与植物生理学实验室主任 Eric Maréchal 等科学家急切地想要回答的一个问题是，红雪藻华是否正在变得更加普遍和发生得更加频繁。这样做的一种方法是使用卫星图像来研究红雪的反照率降低效果。一项使用卫星图像的研究显示，2017 年 1 月，26% 的雪因藻类而变暗。尽管几乎没有广泛的数据表明红藻是否在全球范围内变得越来越普遍，但 Benning 和 Maréchal 都认为，随着地球变暖，它们会更频繁地发生，在科学家们试图估计这些影响时，需要考虑到这一点是。但即使抛开它们在气候变化中的作用，科学家们也在揭开围绕红雪的其他谜团。\nMaréchal 和他的同事最近发现，红雪藻似乎只在法国阿尔卑斯山 2,000m（6,562 英尺）以上的海拔处生长，并且在 2,400m（7,874 英尺）附近特别繁盛。根据 Maréchal 的说法，由于这些高度存在的积雪的数量、质量和寿命，在高海拔地区发现了 Sanguina 藻类。令人费解的是，迄今为止，科学家们未能在实验室中在真正的雪上种植这些藻类。 “正是出于这个原因，研究人员需要收集尽可能多的样本以进行更精细的研究，”Maréchal 说。今年 6 月，在最近对法国东南部上阿尔卑斯的劳塔雷山口进行的为期两天的探险中，Maréchal 和他的同事在由五个致力于研究山地藻类的法国研究所组成的 ALPALGA 财团中收集了他们 2021 年的第一批样本。然而，与往年不同的是，雪没有典型的红色。相反，它以赭黄色为主。他们认为，黄色是由于雪上的沙子干扰了藻类赋予的颜色。虽然不是一个不寻常的现象，但今年很特别，因为强风将大量的撒哈拉沙带到了阿尔卑斯山的高地。 “这为我们提供了一个很好的机会来评估沙子与雪藻生长之间的关系，”Maréchal 说。 “通过分析这些颗粒，我们将尝试确定沙子是否提供养分、金属或任何可能对藻类生长产生积极或消极干扰的特定元素。”该团队希望扩大他们的理解范围，以了解雪中的铁含量和酸度水平如何影响红藻的生长。他们还在研究与雪藻一起生活的其他微生物和动物是否可能发挥作用。\n根据 Maréchal 的说法，对 6 月份收集的新样本进行的首次测试表明，存在带有藻类细胞的单细胞动物，称为浮游动物。虽然通常与海洋和湖泊联系在一起，它们构成了食物链的关键元素，但浮游动物也可以在冰川和积雪的融水中生存。他们的研究正在帮助构建一幅图景，尽管雪可能看起来是惰性的，但实际上它充满了生命。 “当降雪时，它经常会捕获人为和自然产生的矿物质和元素，如氮和磷，”本宁说。然后雪藻可以以这些为食，而雪中的细菌也与藻类形成营养关系。 “在这个生态系统中，雪藻是主要生产者，”本宁说。 “当它们开花时，它们进行光合作用，消耗营养，同时产生糖和其他成分等废物，这些废物可能成为细菌和其他微生物的食物。”根据 Maréchal 的说法，藻类只需要二氧化碳和光，似乎构成了一个更复杂和成熟的生态系统的基础，该生态系统涉及细菌、真菌和单细胞动物细胞，如浮游动物。但是，虽然这些彩色雪块随着生命而蓬勃发展——但它们的寿命也很短，一年中只出现几周。当天气再次变冷时，颜色就会消失，雪又恢复到通常的白色。这提出了一个有趣的问题——红藻在冬天究竟发生了什么？\n“一种理论是它们进入休眠状态，并在冻结时变得几乎透明，”本宁说。 “当不再需要它时，它们会失去色素沉着，因为这是一个消耗能量的过程。”虽然红色素每年都会随着春末夏初的阳光和炎热而回归，但本宁和她的科学家们将密切关注雪上的污渍，看看它们还能教给我们什么。通过在 Facebook 上点赞我们，或在 Twitter 或 Instagram 上关注我们，加入一百万未来的粉丝。如果您喜欢这个故事，请注册每周 bbc.com 专题通讯，称为“基本清单”。从 BBC 未来、文化、工作生活和旅行中精心挑选的故事，每周五发送到您的收件箱。", "note_en": "Growing patches of coloured snow in the French Alps could be a sign of the impact climate change is having in the mountains.\n It is a shocking, garish sight to come across on a peaceful mountainside. Hike high enough in the French alps during the late spring and early summer, and there is a good chance that you will come across some rather strange patches of snow among the grey limestone and stunted clumps of vegetation. This snow isn&#39;t white – it&#39;s blood red.\n The peculiar phenomenon – sometimes known as blood snow – is the result of a defence mechanism produced by microscopic algae that grow in the Alpine snow. Normally these microalgae have a green colour as they contain chlorophyll, the family of pigments produced by most plants to help them absorb energy from sunlight. However, when the snow algae grow prolifically and are exposed to strong solar radiation, they produce red-coloured pigment molecules known as carotenoids, which act as a sunshield to protect their chlorophyll.\n While red snow algae has been known for a long time (it is mentioned in a book published in  1819 as having been discovered during an expedition to the Arctic in 1818) it is still steeped in mysteries that scientists are attempting to unravel.\n Just two years ago, botanists at Charles University, Prague, in the Czech Republic,  identified an entirely new genus of microalgae that is responsible for causing red and orange snow in different parts of the world, which they named &#34;Sanguina&#34; in reference to the blood-red colour they produce. The researchers found forms of Sanguina algae that cause red snow samples from Europe, North America, South America along with both polar regions. A species of Sanguina that causes an unusual orange snow was also found in Svalbard.\n  It isn&#39;t the only type of microalgae responsible for red snow though. Several other types, such as   Chlamydomonas nivalis and an  algae found growing close to Antarctic penguin colonies called   Chloromonas polyptera, also produce pigments to create red and pink stained snow.\n But understanding more about red snow algae carries a significance far greater than simply explaining the existence of strange-coloured patches in the Alps and near the poles. Its appearance and disappearance are important markers of climate change and how it is affecting the delicate ecosystems where the algae are found.\n According to Liane G Benning, professor of interface geochemistry at the German Research Centre for Geosciences in Potsdam, red snow is becoming more common due to global warming. &#34; The rise in the atmospheric carbon dioxide levels increases the temperature, which leads to more snow melting,&#34; she says. &#34;The moment there is liquid water on the snow, the algae start growing.&#34;\n This increasing abundance of red snow algae may also be contributing to climate change too. The red pigment turns the snow surface dark, reducing the amount of light and heat it reflects back into space – something known as the albedo effect. By trapping more of the Sun&#39;s heat, the snow melts even faster, allowing the algae to proliferate further. &#34;There is a runaway effect in which the algae melt their preferred habitat,&#34; says Benning. &#34;It’s as if they are destroying their own house.&#34;\n On a wider scale, the extra heat absorbed by the tinted snow can alter the temperature in the wider environment, speeding up the melting of snow packs and glaciers. One study estimated that over a single melt season, red pigmented algal blooms could  reduce the snow albedo by 13%, suggesting it plays an important role in how the effects of climate change can be amplified within mountain environments.\n  Studies have shown red algal blooms occur on glaciers all over the world, from  Antarctica to  the Himalayas and  in the Arctic. So one question that scientists like Benning and Eric Maréchal, director of the Cell and Plant Physiology Laboratory in Grenoble, France, are keen to answer is whether red snow algal blooms are becoming more widespread and occurring more often.\n One way of doing this would be to use satellite imagery to study the albedo-reducing effect of the red snow. A study using satellite imagery of snow fields on Fildes Peninsula on King George Island, off the coast of Antarctica, revealed that in January 2017,  26% of the snow was darkened by algae.\n Although there is little widespread data to show if red algae are becoming more common globally, both Benning and Maréchal believe they will occur more often as our planet warms, and this will need to be taken into account as scientists try to estimate what the impacts will be.\n But even laying aside their role in climate change, scientists are unpicking other mysteries surrounding red snow.\n   Maréchal and his colleagues recently found that red snow algae appear to only grow  at elevations above 2,000m (6,562ft) in the French Alps, and particularly flourish at around 2,400m (7,874ft). According to Maréchal, the Sanguina algae is found at high elevations because of the quantity, quality and longevity of the snowpacks present at these heights.\n Puzzlingly, scientists have so far failed to grow these algae on real snow in a laboratory.\n &#34;It is for this reason that researchers need to collect as many samples as possible for a more refined study,&#34; Maréchal says.\n  During a recent two-day expedition to the Lautaret pass in Hautes-Alpes, southeastern France, in June this year Maréchal and his colleagues in the  ALPALGA consortium of five French institutes dedicated to the study of mountain algae, collected their first samples of 2021. Unlike previous years, however, the snow didn&#39;t have its typical red hue. Instead, it was dominated by ochre yellow.\n The yellow tinge, they believe, was due to the presence of sand on the snow that interfered with the colour imparted by the algae. While not an unusual phenomenon, this year was exceptional as strong winds carried plenty of Saharan sand to the Alpine heights.\n &#34;This has provided us a great opportunity to evaluate the relationship between sand and the growth of snow algae,&#34; says Maréchal. &#34;By analysing these particles, we will try to determine if sand provides nutrients, metals or any specific elements that may interfere, positively or negatively, with the algae growth.&#34;\n The team hopes to increase the ambit of their understanding to see how iron levels in the snow and acidity levels affect the red algae growth. They are also studying whether other microorganisms and animals living alongside the snow algae may play a role.\n  According to Maréchal, the first tests on the new samples collected in June have revealed the presence of unicellular animals, called zooplankton, with the algae cells. Although more normally associated with oceans and lakes, where they form a key element of the food chain, zooplankton can also survive in the meltwaters from glaciers and snow packs.\n Their research is helping to build a picture that although snow might appear to be inert, it is in fact teeming with life.\n &#34;As snow falls, quite often it traps minerals and elements like nitrogen and phosphorus, both anthropogenic and naturally occurring,&#34; Benning says. The snow algae can then feed on these while bacteria in the snow also form a trophic relationship with the algae.\n &#34;In this ecosystem, the snow algae are primary producers,&#34; says Benning. &#34;When they bloom, they photosynthesise, consume nutrients while producing waste products such as sugars and other components, which serve as possible food for bacteria and other microorganisms.&#34;\n  According to Maréchal, the algae, which need just carbon dioxide and light, appear to form the basis of a more complex and mature ecosystem that involves bacteria, fungi and unicellular animal cells such as the zooplankton.\n But while these patches of coloured snow flourish with life – they are also short lived, appearing only for a few weeks of the year. When the weather turns cold again, the colour disappears and the snow returns to its usual white colour.\n It raises an intriguing question – what actually happens to the red algae over the winter?\n &#34;One theory is that they go dormant and become almost transparent as they freeze in,&#34; says Benning. &#34;When it&#39;s no longer needed, they lose the pigmentation as it is an energy consuming process.&#34;\n While the red pigment returns each year with the sunshine and heat of the late spring and early summer, Benning and her fellow scientists will be watching the stains in the snow closely for what else they can teach us.\n  Join one million Future fans by liking us on    Facebook , or follow us on    Twitter  or    Instagram .\n If you liked this story,    sign up for the weekly bbc.com features newsletter , called &#34;The Essential List&#34;. A handpicked selection of stories from    BBC Future ,    Culture ,   Worklife, and    Travel , delivered to your inbox every Friday.", "posttime": "2021-08-09 06:03:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "阿尔卑斯山,alps,藻类", "title": "为什么阿尔卑斯山的雪变红了", "title_en": "Why Snow in the Alps Is Turning Red", "transed": 1, "url": "https://www.bbc.com/future/article/20210729-why-snow-in-the-alps-is-turning-red", "via": "", "real_tags": ["阿尔卑斯山", "alps", "藻类"]}, {"category": "", "categoryclass": "", "imagename": "f1652b5e3202f62a36a3343aeb4fe94e.jpg", "infoid": 1072189, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "NBC News 的一项调查发现，哥伦比亚呼叫中心的工作人员向该国一些最大的公司提供外包客户服务，他们正被迫签署一份合同，让他们的雇主在家中安装摄像头以监控工作绩效。 Teleperformance 是全球最大的呼叫中心公司之一，总部位于哥伦比亚的六名员工表示，他们对 3 月份首次发布的新合同感到担忧。该公司的客户包括苹果、亚马逊和优步。该合同允许通过工人家中的人工智能摄像头进行监控、语音分析和存储从工人家庭成员（包括未成年人）收集的数据。 Teleperformance 在全球拥有超过 380,000 名员工，其中哥伦比亚有 39,000 名员工。 “合同允许对我们正在做的事情以及我们的家人进行持续监控，”苹果账户上的一名波哥大工作人员说，他没有被授权对新闻媒体发言。 “我认为这真的很糟糕。我们不在办公室工作。我在我的卧室工作。我不想在卧室里放相机。”这名工人说她签署了这份合同，NBC 新闻已经审查了一份合同，因为她害怕失去工作。她说，她的主管告诉她，如果她拒绝签署文件，她将被从苹果账户中删除。她说，尚未安装额外的监控技术。由于无权对媒体发言而要求匿名的工人们的担忧凸显了一种与流行病相关的趋势，令隐私和劳工专家感到震惊：由于许多工人已转向在家中履行职责，一些公司正在推动提高对其员工的数字监控水平，以重建对家庭办公室的监督。这个问题并不仅仅发生在哥伦比亚的 Teleperformance 员工身上。该公司在其网站上表示，它通过其 TP Cloud Campus 产品提供类似的监控，该软件使员工能够在超过 19 个市场进行远程工作。 2021 年 1 月的 TP Cloud Campus 官方 Teleperformance 宣传视频描述了它如何通过分析摄像头反馈，在远程员工中使用“人工智能来监控清洁桌面政策和欺诈”。在 6 月份发布的最新财报中，Teleperformance 表示，由于 TP Cloud Campus 产品，它已将其约 380,000 名员工中的 240,000 人转移到在家工作。 2020 年底，阿尔巴尼亚 Teleperformance 的员工，包括在 Apple UK 账户上工作的员工，向该国的信息和数据保护专员投诉该公司在其家中引入视频监控的提议。专员后来裁定 Teleperformance 不能使用网络摄像头来监控家中的阿尔巴尼亚工人。\n加州大学黑斯廷斯分校劳动法教授维娜·杜巴尔 (Veena Dubal) 说：“在大流行的背景下，在家中的监控确实已经正常化了。” “公司看到安装软件进行各种监控的好处很多，否则他们原本希望他们的人工经理会这样做，但现实情况是，它比老板进行的监控更具侵入性。” Teleperformance 发言人马克·菲佛 (Mark Pfeiffer) 表示，该公司“一直在寻找方法来增强我们的员工和客户的 Teleperformance 哥伦比亚体验，隐私和尊重是我们所做的一切的关键因素。” “我们致力于公平实践、平等、包容、多样性、非歧视、劳工可持续性、道德和透明度，”Pfeiffer 说，“我们将继续尽一切努力为我们的团队和所有人维护这些价值观。我们的主要利益相关者。”他说，该合同寻求对各种可能情况的同意，以确保 Teleperformance 在继续开发工具以优化员工和客户在家中的长期工作时遵守数据隐私法。他补充说，Teleperformance 刚刚在哥伦比亚被认证为最佳工作场所，这是一项基于对数千名员工的保密调查的第三方认证，连续第四年，他说，“证实了我们的绝大多数尽管我们都生活在充满挑战的时代，但哥伦比亚的员工认为我们是一个公平、有爱心和值得信赖的雇主。”但这种压力似乎并不是直接来自苹果等一些公司。 Apple 发言人 Nick Leahy 表示，该公司“禁止我们的供应商使用视频或摄影监控，并确认 Teleperformance 不会对其与 Apple 合作的任何团队使用视频监控。” Leahy 表示，苹果今年在哥伦比亚对 Teleperformance 进行了审计，并没有发现任何“违反我们严格标准的核心行为”。 “我们调查所有索赔，并将继续确保我们供应链中的每个人都得到尊严和尊重，”他补充说。\n在大流行期间，Teleperformance 与许多其他公司一样，将其全球大部分员工转移到在家工作。起初，该公司在菲律宾的一些员工的照片被泄露给新闻媒体后面临工会的国际审查 - 菲律宾是 Teleperformance 员工人数最多的国家 - 在工作中睡觉，以便他们可以在办公室做出回应给美国时区的 Amazon Ring 客户。当时，一些工人抱怨办公室的条件，并表示他们想要在家工作的方便和安全。没有迹象表明哥伦比亚工人在办公室睡觉。然而，工作人员表示，这种便利和安全似乎伴随着侵犯隐私的问题。员工说，今年 3 月，Teleperformance 的全球员工（包括其 39,000 名远程工作的哥伦比亚员工中的 95%）收到了一份 8 页的现有雇佣合同附录，要求他们同意新的家庭监控规则。工人们说，管理层告诉他们，客户要求进行额外的监控，以提高安全性并防止他们在家工作时因大流行而发生任何数据泄露。该文件要求工人同意在他们的家中或计算机上安装摄像机，指向他们的工作区，实时记录和监控工人。它还指出，工作人员同意使用基于人工智能的视频分析工具进行 Teleperformance，该工具可以识别工作区周围的物体，包括手机、纸张和其他受 Teleperformance 安全策略限制的物品。他们还必须同意共享与他们所拥有的任何 18 岁以下儿童相关的数据和图像——他们可能会被视频和音频监控工具发现——并共享生物识别数据，包括指纹和照片。还有一个条款要求工人根据要求进行测谎测试。 Teleperformance 发言人 Pfeiffer 表示，摄像头用于抽查公司的清洁办公桌政策，偶尔还用于确保遵守数据安全流程，并且不会记录员工的任何数据。他说，目前仅在 Teleperformance 的三个市场中测试了基于人工智能的视频分析。他说，员工同意共享生物识别数据，并且在员工同意的情况下，测谎仪用于特定的安全研究。该公司承认要求员工同意共享与未成年人有关的数据，但表示不会在 Teleperformance 之外共享这些数据。与苹果不同的是，优步表示，它要求监控员工，而不是整个员工。优步发言人 Lois Van Der Laan 表示，其客户服务代理可以访问私人和敏感的用户信息，包括信用卡详细信息和行程数据，而保护这些信息是优步的首要任务。因此，优步要求 Teleperformance 监控在其帐户上工作的员工，以验证只有受雇的员工才能访问数据；外包员工没有在手机等其他设备上记录屏幕数据；并且没有未经授权的人靠近计算机。她说，除此之外，优步不需要任何额外的监控。合同中详细说明的家庭监控水平的前景，当呼叫已经被软件密切监控时，让 Teleperformance 的一些客户服务代理感到震惊。亚马逊账户上的一名员工在哥伦比亚上夜班，以便为西班牙的客户提供服务。她公寓里唯一安静到可以接听客户电话的房间是她和丈夫共用的卧室。当他睡在床上时，她从办公桌上接听电话。她告诉 NBC 新闻，她担心麦克风可能会听到他打鼾的声音。\n她被要求在训练期间保持电脑的摄像头打开，但表示 Teleperformance 尚未在她家中安装额外的摄像头或监控。 “这侵犯了我的隐私权，以及与我同住的丈夫和岳母的权利，”她说。亚马逊发言人 Alyssa Bronikowski 表示，亚马逊没有要求对在家工作的员工进行任何额外监控。 “说我们要求或要求采取这些措施是不真实的，”她说，并补充说亚马逊“不容忍”违反其供应商行为准则的行为，该准则规定承包商必须尊重劳工权利，包括建立或加入工会，“我们会定期审核供应商的合规性。”一些 Teleperformance 员工非常担心同意全面监控的压力，以至于他们开始组织起来改善他们的工作条件。周一，他们向 Utraclaro y TIC 工会提交了一系列要求，该工会通常组织 IT 部门的工人，并且已经在呼叫中心巨头 Atento（Teleperformance 的竞争对手）的哥伦比亚业务中创建了一个工会。这些要求包括享有集会自由而不必担心遭到报复的权利、较少的侵入性监视、加班费、通话间隔 30 秒、更明确的纪律程序以及支付用于在家工作的设备的费用，包括椅子和桌子，作为以及可靠的互联网连接。 “我们希望 Teleperformance 的员工可以自由加入工会，而不必担心失去工作，”工会主席 Yuli Higuera 说，该工会在哥伦比亚拥有约 1,200 名成员。她说，到目前为止，大约有 100 名 Teleperformance 员工加入了工会。发言人 Pfeiffer 表示，工会提出的要求“并非全部基于惯例或事实”，公司打算直接与工会解决每一个问题。 “我们重视我们的员工及其福祉、安全和幸福，”他说。 “我们是一家以人为本的企业，我们将继续在集体谈判的各个方面真诚地行事。”哥伦比亚的组织者面临的风险尤其高，因为针对工会成员的暴力行为很普遍，而且劳工保护措施薄弱。根据国际工会联合会的 2021 年全球权利指数，从 2020 年 3 月到 4 月，哥伦比亚有 22 名工会成员被杀。电视表演与任何此类暴力事件都没有关联。\n“由于我的组织，我自己曾两次受到死亡威胁，”伊格拉说。 “在哥伦比亚成立工会并不容易，但这是我必须做的工作，我们有信心、性格和信念，我们将通过 Teleperformance 取得良好的结果。” Higuera 的主要重点是让 Teleperformance 认可工会并同意允许工人组织起来而不会面临报复。 7 月，经济合作与发展组织的法国国家联络点代表经合组织作为负责任的跨国企业的监督机构，向总部位于巴黎的 Teleperformance 发布了一系列建议，其中包括该公司应该“尊重工人的结社自由和集体谈判的权利”。这些建议是在 Teleperformance 在大流行期间开始组织后于 2020 年终止了几名哥伦比亚工人组织者之后提出的。法国国家联络点（NCP）将解雇描述为“类似于反工会做法”。 Teleperformance 的 Pfeiffer 表示，NCP 流程仅涉及近 39,000 名员工中的 9 个案例，并且没有发现任何证据表明 Teleperformance 参与了系统的反工会活动。他说，Teleperformance 哥伦比亚遵守当地劳动法和国际劳工准则。 “我们欢迎 NCP 提出的改进我们方法的建议，”Pfeiffer 说。 “我们完全致力于维护工人的组织权。”工人们对监控的担忧建立在《卫报》的报道之上，该报道根据发送给员工的文件详细说明了 Teleperformance 计划如何使用连接到人工智能系统的专业网络摄像头，该系统将在轮班期间扫描实时视频是否违反工作规则并且，如果检测到，将违规的静态照片发送给经理。根据该报告，如果员工想离开办公桌，必须在公司应用程序中单击“休息模式”并添加解释，例如“取水”，以确保系统不会报告他们。系统还会检测工作人员是否在此期间没有输入或点击鼠标并将工作人员标记为空闲。 Teleperformance 表示，英国不会使用远程扫描违规行为，网络摄像头只会用于会议和培训。该公司表示，其他国家的远程监控水平会有所不同。该公司表示，监控已推广到印度、墨西哥和菲律宾。\nUNI Global 的全球秘书 Christy Hoffman 支持世界各地工人的工会权利，并一直在与 Teleperformance 的组织者进行协调，她说，在大流行期间呼叫中心行业一直在蓬勃发展。这是因为越来越多的工作已经转移到网上，美国的大型公司越来越依赖于像 Teleperformance 这样的公司的外包工人，这些公司总部位于哥伦比亚和菲律宾等劳动力更便宜的国家。 “工作人员从呼叫中心转移到人们的家中，并且因此增加了监控和数据采集，这确实降低了他们的工作条件，”她说。霍夫曼呼吁苹果和亚马逊等 Teleperformance 的客户利用他们的影响力来改善外包工人的工作条件。 “从哥伦比亚法律的角度来看，他们不直接负责，”她说。 “但他们有影响力，他们最终控制着为他们的业务履行职责的工人的条件。”", "note_en": "Colombia-based call center workers who provide outsourced customer service to some of the nation’s largest companies are being pressured to sign a contract that lets their employer install cameras in their homes to monitor work performance, an NBC News investigation has found.\n Six workers based in Colombia for Teleperformance, one of the world’s largest call center companies, which counts Apple, Amazon and Uber among its clients, said that they are concerned about the new contract, first issued in March. The contract allows monitoring by AI-powered cameras in workers’ homes, voice analytics and storage of data collected from the worker’s family members, including minors. Teleperformance employs more than 380,000 workers globally, including 39,000 workers in Colombia.\n   “The contract allows constant monitoring of what we are doing, but also our family,” said a Bogota-based worker on the Apple account who was not authorized to speak to the news media. “I think it’s really bad. We don’t work in an office. I work in my bedroom. I don’t want to have a camera in my bedroom.”\n The worker said that she signed the contract, a copy of which NBC News has reviewed, because she feared losing her job. She said that she was told by her supervisor that she would be moved off the Apple account if she refused to sign the document. She said the additional surveillance technology has not yet been installed.\n The concerns of the workers, who all spoke on the condition of anonymity because they were not authorized to speak to the media, highlight a pandemic-related trend that has alarmed privacy and labor experts: As many workers have shifted to performing their duties at home, some companies are pushing for increasing levels of digital monitoring of their staff in an effort to recreate the oversight of the office at home.\n The issue is not isolated to Teleperformance’s workers in Colombia. The company states on its website that it offers similar monitoring through its  TP Cloud Campus product, the software it uses to enable staff to work remotely in more than 19 markets. An official Teleperformance  promotional video for TP Cloud Campus from January 2021 describes how it uses “AI to monitor clean desk policy and fraud” among its remote workers by analyzing camera feeds. And in its  latest earnings statement, released in June, Teleperformance said it has shifted 240,000 of its approximately 380,000 employees to working from home thanks to the TP Cloud Campus product.\n  At the end of 2020, workers at Teleperformance in Albania, including those working on the Apple U.K. account, complained to the country’s Information and Data Protection Commissioner about the company’s proposal to introduce video monitoring in their homes. The commissioner  later ruled that Teleperformance could not use webcams to monitor Albanian workers in their homes.\n “Surveillance at home has really been normalized in the context of the pandemic,” said Veena Dubal, a labor law professor at the University of California, Hastings. “Companies see a lot of benefit in putting in software to do all kinds of monitoring they would have otherwise expected their human managers to do, but the reality is that it’s much more intrusive than surveillance conducted by a boss.”\n Teleperformance spokesman Mark Pfeiffer said that the company is “constantly looking for ways to enhance the Teleperformance Colombia experience for both our employees and our customers, with privacy and respect as key factors in everything we do.”\n “We are committed to fair practices, equality, inclusion, diversity, non-discrimination, labor sustainability, ethics, and transparency,&#34; Pfeiffer said, &#34;and we will continue to do everything we can to uphold these values for both our teams and all our key stakeholders.”\n  The contract seeks consent for a wide range of possible scenarios to ensure that Teleperformance complies with data privacy laws as it continues to develop tools to optimize long-term work from home for employees and clients, he said.\n He added Teleperformance has just been certified in Colombia as a  Great Place to Work, a third-party certification that’s based on confidential surveys of thousands of employees, for the fourth consecutive year, which, he said, “validated that the vast majority of our employees in Colombia view us favorably as a fair, caring and trustworthy employer, despite the challenging times we are all living in.”\n But it does not appear that this pressure is directly coming from some companies like Apple. Apple spokesperson Nick Leahy said that the company “prohibits the use of video or photographic monitoring by our suppliers and have confirmed Teleperformance does not use video monitoring for any of their teams working with Apple.” Leahy said that Apple had audited Teleperformance in Colombia this year and did not find any “core violations of our strict standards.”\n “We investigate all claims and will continue to ensure everyone across our supply chain is treated with dignity and respect,” he added.\n   During the pandemic, Teleperformance, like many other companies, shifted the majority of its employees globally to working from home. At the start, the company faced  international scrutiny from  labor unions after photos were leaked to news outlets of some of its staff in the Philippines — the country with the highest number of Teleperformance workers — sleeping at work so they could be in the office to respond to Amazon Ring customers in U.S. time zones. At the time,  some workers complained about the office conditions and said they wanted the convenience and safety of working at home. There are no signs that workers from Colombia slept at the office.\n  However, that convenience and safety appears to have come with a privacy infringing catch, said workers. In March, members of Teleperformance’s global workforce, including 95 percent of its 39,000 Colombian employees who were working remotely, were sent an eight-page addendum to their existing employment contracts that asked them to agree to new home surveillance rules, workers said. Workers said that management told them clients requested the additional monitoring to improve security and prevent any data breaches while they were working from home because of the pandemic.\n The document asks workers to agree to having video cameras installed in their home or on their computers, pointing at their workspace, to record and monitor workers in real time. It also states that workers agree to Teleperformance using AI-powered video analysis tools that can identify objects around the workspace, including mobile phones, paper and other items that are restricted by Teleperformance’s security policies. They must also agree to sharing data and images related to any children they have under the age of 18 — who might get picked up by video and audio monitoring tools — and to sharing biometric data including fingerprints and photos. There is also a clause that requires workers to take polygraph tests if requested.\n Pfeiffer, the Teleperformance spokesperson, said that cameras were used for spot checks of the company’s clean desk policy and occasionally to ensure compliance with data security processes and that no data is recorded from employees. He said that the AI-powered video analysis was currently being tested in just three of Teleperformance’s markets. He said that employees consented to sharing biometric data and that polygraphs are used in specific security studies with employees’ consent. The company acknowledged asking workers to consent to sharing data relating to minors, but said that it did not share this data outside of Teleperformance.\n Unlike Apple, Uber said that it requested monitoring for its workers, but not the entire workforce. Uber spokesperson Lois Van Der Laan said that its customer service agents have access to private and sensitive user information, including credit card details and trip data, and that protecting that information is a priority for Uber. As a result, Uber requested Teleperformance to monitor staff working on its accounts to verify that only a hired employee is accessing the data; that outsourced staff weren’t recording screen data on another device such as a phone; and that no unauthorized person was near the computer. Uber does not require any additional monitoring beyond that, she said.\n   The prospect of the level of surveillance at home detailed in the contract, when calls are already closely monitored by software, alarmed some of Teleperformance’s customer service agents.\n  One worker on the Amazon account works night shifts from Colombia so she can serve customers in Spain. The only room in her apartment that is quiet enough to take customer calls is the bedroom she shares with her husband. She takes calls from a desk while he sleeps on the bed. She’s worried the microphones might pick up the sound of him snoring, she told NBC News.\n   She was required to keep her computer’s camera on during training, but said Teleperformance has not yet installed additional cameras or monitoring in her home.\n “It’s a violation of my privacy rights, and the rights of my husband and mother-in-law who live with me,” she said.\n Amazon spokesperson Alyssa Bronikowski said that Amazon did not request any additional monitoring for at-home workers. “It is not true to say we required or asked for these measures,” she said, adding that Amazon “does not tolerate violations” of its  vendor code of conduct, which stipulates that contractors must respect labor rights, including the right to establish or join a union, “and we routinely audit our vendors for compliance.”\n   Some Teleperformance workers have become so concerned about the pressure to agree to sweeping surveillance that they have started to organize to improve their working conditions. On Monday they submitted a set of demands to their employer with the Utraclaro y TIC union, which typically organizes workers in the IT sector and has already created a union within the Colombian operations of call center giant Atento, a Teleperformance competitor. The demands include the right to freedom of assembly without fear of retaliation, less intrusive surveillance, overtime pay, 30-second breaks between calls, clearer disciplinary processes and covering the cost of equipment used to work from home, including a chair and desk, as well as a reliable internet connection.\n  “We want workers at Teleperformance to have the freedom to join a trade union without fear of losing their jobs,” said Yuli Higuera, president of the union, which has about 1,200 members in Colombia. So far, about 100 Teleperformance workers have joined the union, she said.\n Pfeiffer, the spokesperson, said that the demands submitted by the union were “not all based on practice or facts” and that the company intends to address each one with the union directly. “We value our people and their well being, safety and happiness,” he said. “We are a people-centric business and we will continue to act in good faith regarding all aspects of collective bargaining.”\n The stakes for organizers in Colombia are particularly high, as violence against trade unionists is common and labor protections are weak. From March 2020 to April, 22 trade unionists were killed in Colombia, according to the International Trade Union Confederation’s Global Rights Index 2021. Teleperformance has not been linked to any of this violence.\n “I myself have been threatened with death twice because of my organizing,” said Higuera. “Making a union in Colombia is not easy, but it’s work I have to do and we have the confidence, disposition and faith that we are going to achieve a good outcome with Teleperformance.”\n  Higuera’s primary focus is to get Teleperformance to recognize the union and agree to allow workers to organize without facing retaliation. In July, the French National Contact Point to the Organization for Economic Cooperation and Development, which acts as a watchdog for responsible multinational businesses on behalf of the OECD,  issued a set of recommendations to Teleperformance, which is based in Paris, including that the company should have “respect for the right of freedom of association and collective bargaining of workers.”\n The recommendations came after Teleperformance  terminated several Colombian worker organizers in 2020 after they started to organize during the pandemic. The French National Contact Point, or NCP, described the dismissals as  “akin to anti-union practices.”\n Teleperformance’s Pfeiffer said that the NCP process referred to just 9 cases out of almost 39,000 employees and that it found no evidence that Teleperformance was engaging in systematic anti-union activities. Teleperformance Colombia complies with local labor law and international labor guidelines, he said. “We welcome the NCP’s recommendations for enhancing our approach,” Pfeiffer said. “We are fully committed to the workers’ right to organize.”\n The workers’ concerns over surveillance builds on  reporting by The Guardian, which detailed, based on documents sent to staff, how Teleperformance planned to use specialist webcams connected to an artificial intelligence system that would scan live video for breaches of work rules during the work shift and, if detected, send a still photo of the infraction to a manager.\n  According to the report, workers would have to click “break mode” in a company app if they wanted to leave their desks and add an explanation, such as “getting water,” to ensure the system didn’t report them. The system would also detect if the worker had not typed or clicked the mouse and mark the worker as idle during that time.\n Teleperformance said that the remote scans for infractions would not be used in the U.K. and that webcams would only be used for meetings and training. Levels of remote monitoring would be different in other countries, the company said. The company said that the monitoring had been rolled out to India, Mexico and the Philippines.\n   Christy Hoffman, global secretary of UNI Global, which supports workers’ rights to unionize across the world and has been coordinating with organizers at Teleperformance, said that the call center industry has been booming during the pandemic. That’s because more work has shifted online and large, U.S.-based companies are increasingly relying on outsourced workers at companies like Teleperformance based in countries like Colombia and the Philippines where labor is cheaper.\n  “The shift of workers out of call centers and into people’s homes and the increased monitoring and data capture as a result has really degraded their working conditions,” she said.\n Hoffman called on Teleperformance’s clients such as Apple and Amazon to use their influence to improve the working conditions of their outsourced workers.\n “They are not directly responsible from the point of view of Colombian laws,” she said. “But they have leverage and they ultimately control the conditions for workers who perform duties for their operations.”", "posttime": "2021-08-09 05:04:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,amazon,苹果,亚马逊,apple", "title": "以苹果、亚马逊和优步为客户的呼叫中心运营商 Teleperformance 希望通过人工智能摄像头监控在哥伦比亚在家工作的员工", "title_en": "Call center operator Teleperformance, which counts Apple, Amazon, and Uber as clients, wants to monitor staff working from home in Colombia, via AI-powered cams", "transed": 1, "url": "https://www.nbcnews.com/tech/tech-news/big-tech-call-center-workers-face-pressure-accept-home-surveillance-n1276227", "via": "", "real_tags": ["人工智能", "amazon", "苹果", "亚马逊", "apple"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072186, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "注意：这篇文章已更新为适用于 Julia 1.x（原始版本使用 Julia 0.1 语法）。在之前的一篇文章中，我谈到了为什么通过中间 shell 生成外部程序管道是导致错误、安全漏洞、不必要的开销和静默故障的常见原因。但是实在是太方便了！为什么运行外部程序的管道不能方便和安全？好吧，实际上没有真正的原因。 shell 本身能够很好地构建和执行管道。原则上，没有什么能阻止高级语言至少像 shell 那样做——普通的只是默认情况下不会这样做，而是要求用户付出额外的努力来安全正确地使用外部程序。有两个主要障碍： 使用管道、dup2、fork、close 和 exec 系统调用的一些中等棘手的低级 UNIX 管道；这篇文章描述了我们为 Julia 设计和实现的系统，以及它如何避免其他语言的主要缺陷。首先，我将展示上一篇文章示例的 Julia 版本——计算给定目录中包含字符串“foo”的行数。当管道出现故障时，Julia 会提供完整、具体的诊断错误消息这一事实证明了一个令人惊讶且微妙的错误，潜伏在一个看似完全无害的 UNIX 管道中。修复此错误后，我们将详细介绍 Julia 的外部命令执行和管道构建系统的实际工作方式，以及为什么它比使用中间壳来完成所有繁重工作的传统方法提供更大的灵活性和安全性。以下是如何编写在 Julia 中计算包含字符串“foo”的目录中的行数的示例（如果您从源代码安装了 Julia，则可以通过将目录更改为 Julia 源目录并执行 cp -a src &quot;source code&quot;; mkdir tmp 然后启动 Julia repl): julia&gt; dir = &quot;src&quot;; # 在 Juliajulia 的 git repo 中工作&gt; parse(Int, readchomp(pipeline( `find $dir -type f -print0`, `xargs -0 grep foo`, `wc -l`, )))5 这个 Julia 命令看起来可疑地类似于我们在上一篇文章中开始的原始 Ruby 版本：\njulia&gt; dir = &quot;source code&quot;;julia&gt; parse(Int, readchomp(pipeline(`find $dir -type f -print0`, `xargs -0 grep foo`, `wc -l`, )))5julia&gt; dir = &quot;不存在&quot;;julia&gt; parse(Int, readchomp(pipeline(`find $dir -type f -print0`, `xargs -0 grep foo`, `wc -l`, )))find: &#39;nonexistent&#39;: No此类文件或目录错误：进程失败：进程（`find nonexistent -type f -print0`, ProcessExited(1)) [1] Process(`xargs -0 grep foo`, ProcessExited(123)) [123]julia&gt; dir = &quot;foo&#39;; echo 恶意攻击; echo &#39;&quot;;julia&gt; parse(Int, readchomp(pipeline(`find $dir -type f -print0`, `xargs -0 grep foo`, `wc -l`, )))找到：&#39;富&#39;;回声恶意攻击； echo &#39;&#39;：没有这样的文件或目录错误：进程失败：进程（`find &quot;foo&#39;; echo 恶意攻击; echo &#39;&quot; -type f -print0`, ProcessExited(1)) [1] Process(`xargs -0 grep foo`, ProcessExited(123)) [123] 在上面的例子中，我们可以看到，即使 dir 包含空格或引号，表达式的行为仍然完全符合预期——dir 的值作为单个参数插入到 find 命令中.当 dir 不是存在的目录的名称时， find 失败 - 应该如此 - 并且会检测到此失败并自动转换为信息异常，包括失败的完全展开的命令行。在上一篇文章中，我们观察到对 Bash 使用 pipefail 选项可以检测管道故障，例如在管道中的最后一个进程之前发生的管道故障。然而，它只允许我们检测到管道中至少有一件事情失败了。我们仍然需要猜测管道的哪些部分实际上失败了。另一方面，在 Julia 示例中，不需要猜测：当给出一个不存在的目录时，我们可以看到 find 和 xargs 都失败了。虽然在这种情况下 find 失败并不奇怪，但出乎意料的是 xargs 也失败了。为什么 xargs 失败？检查的一种可能性是 xargs 程序在没有输入的情况下失败。我们可以使用 Julia 的成功谓词来尝试一下：好的，所以 xargs 在没有输入的情况下似乎非常满意。也许 grep 不喜欢没有任何输入？啊哈！当 grep 没有得到任何输入时，它返回一个非零状态。很高兴知道。事实证明，grep 指示它是否与返回状态匹配任何内容。大多数程序使用它们的返回状态来指示成功或失败，但有些程序，如 grep，使用它来指示其他一些布尔条件——在这种情况下，“找到了一些东西”与“没有找到任何东西”：现在我们知道为什么 grep 是“失败” – 和 xargs 也是如此，因为如果它运行的程序返回非零，它会返回一个非零状态。这意味着当我们搜索一个现有目录时，我们的 Julia 管道和“负责任的”Ruby 版本都容易受到虚假故障的影响，而该目录碰巧在任何地方都不包含字符串“flippity”：\njulia&gt; dir = &quot;src&quot;;julia&gt; parse(Int, readchomp(pipeline(`find $dir -type f -print0`, `xargs -0 grep flippity`, `wc -l`, ))) 错误：进程失败: Process(`xargs -0 grep flippity`, ProcessExited(123)) [123] 由于 grep 使用非零返回状态指示未找到任何内容，因此 readchomp 函数得出结论，其管道失败并引发相应的错误。在这种情况下，这种默认行为是不可取的：我们希望表达式只返回 0 而不会引发错误。 Julia 中的简单修复是这样的： julia&gt; parse(Int, readchomp(pipeline( `find $dir -type f -print0`, ignorestatus(`xargs -0 grep flippity`), `wc -l`, )))0这在所有情况下都能正常工作。接下来，我将解释所有这些是如何工作的，但现在只需注意，当我们的管道失败时提供的详细错误消息暴露了一个相当微妙的错误，最终会在生产中使用时导致微妙且难以调试的问题。如果没有如此详细的错误报告，这个错误将很难追踪。 Julia 从 Perl 和 Ruby 借用了外部命令的反引号语法，而这两者又是从 shell 中获得的。然而，与这些前辈不同的是，在 Julia 中反引号不会立即运行命令，也不一定表明您想要捕获命令的输出。相反，反引号只是构造一个表示命令的对象：（在 Julia repl 中， ans 自动绑定到最后一个评估输入的值。）为了实际运行命令，您必须对命令对象执行某些操作。要运行命令并将其输出捕获到字符串中 - 其他语言会自动使用反引号 - 您可以应用带有 String 作为第二个参数的 read 函数，指示您想要一个字符串而不是字节数组：因为想要丢弃命令输出末尾的尾随换行符，Julia 提供了 readchomp(x) 命令，它等效于编写 chomp(read(x, String))：\n要在不捕获其输出的情况下运行命令，让它只打印到与主进程相同的 stdout 流 - 即当将命令作为其他语言的字符串给出时系统函数会做什么 - 使用运行函数：“Hello”之后readchomp 命令是一个返回值，而 run 命令后的 Hello 是打印输出。 Process(`echo Hello`, ProcessExited(0)) 是 run 返回的值。 （如果您的终端支持颜色，则它们的颜色不同，以便您可以轻松地在视觉上区分它们。）如果出现问题，则会引发异常：julia&gt; run(`false`)ERROR: failed process: Process(`false`, ProcessExited(1)) [1]julia&gt; run(`notaprogram`)ERROR: IOError: could not spawn `notaprogram`: no such file or directory (ENOENT) 与上面的 xargs 和 grep 一样，这可能并不总是可取的。在这种情况下，您可以使用 ignorestatus 来指示不应将返回非零值的命令视为错误： julia&gt; run(ignorestatus(`false`))Process(`false`, ProcessExited(1))julia&gt; run(ignorestatus(`notaprogram`))ERROR: IOError: could not spawn `notaprogram`: no such file or directory (ENOENT) 在后一种情况下，父进程中仍然会引发错误，因为问题是可执行文件没有&#39;甚至不存在，而不仅仅是它运行并返回非零状态。尽管 Julia 的反引号语法有意尽可能地模仿 shell，但有一个重要的区别：命令字符串永远不会传递给 shell 以供解释和执行；相反，它在 Julia 代码中被解析，使用与 shell 用来确定命令和参数是什么相同的规则。命令对象看起来有点像字符串，但它们实际上更像是一个字符串数组，如果你收集一个命令就可以看到：\njulia&gt; cmd = `perl -e &#39;print &quot;Hello\\n&quot;&#39;``perl -e &#39;print &quot;Hello\\n&quot;&#39;`julia&gt; collect(cmd)3-element Array{String,1}: &quot;perl&quot; &quot; -e&quot; &quot;print \\&quot;Hello\\\\n\\&quot;&quot; 所以命令只是一种有趣的字符串数组。如果您的终端支持下划线，命令中的单个单词将带有下划线，帮助您轻松查看单词之间的中断位置。 Julia 中反引号的目的是提供一种熟悉的、类似于 shell 的语法，用于使对象表示带有参数的命令。为此，引号和空格的作用与它们在 shell 中的作用一样。然而，在我们开始以编程方式构建命令之前，反引号语法的真正威力不会显现。就像在 shell 中（以及在 Julia 字符串中）一样，您可以使用美元符号 ($) 将值插入到命令中：然而，与在 shell 中不同的是，插入到命令中的 Julia 值被插入为单个逐字参数 - 里面没有字符值被插入后被解释为特殊值： julia&gt; dir = &quot;two words&quot;;julia&gt; collect(`find $dir -type f`)4-element Array{String,1}: &quot;find&quot; &quot;two words &quot; &quot;-type&quot; &quot;f&quot;julia&gt; dir = &quot;foo&#39;bar&quot;;julia&gt; collect(`find $dir -type f`)4-element Array{String,1}: &quot;find&quot; &quot;foo&#39;bar&quot; &quot; -type&quot; &quot;f&quot; 无论内插值的内容是什么，这都有效，允许对即使在 shell 中也很难作为命令行参数的一部分传递的字符进行简单内插（对于以下示例，tmp/a .tsv 和 tmp/b.tsv 可以在 shell 中使用 echo -e &quot;foo\\tbar\\nbaz\\tqux&quot; &gt; tmp/a.tsv; echo -e &quot;foo\\t1\\nbaz\\t2&quot; &gt; tmp/b 创建.tsv): julia&gt; tab = &quot;\\t&quot;;julia&gt; cmd = `join -t$tab tmp/a.tsv tmp/b.tsv`;julia&gt; c ollect(cmd)4-element Array{String,1}: &quot;join&quot; &quot;-t\\t&quot; &quot;tmp/a.tsv&quot; &quot;tmp/b.tsv&quot;julia&gt; run(cmd)foo bar 1baz qux 2Process(`加入&#39;-t&#39; tmp/a.tsv tmp/b.tsv`, ProcessExited(0))\n此外，$ 后面的内容实际上可以是任何有效的 Julia 表达式，而不仅仅是变量名：制表符在 shell 中有点难以传递，需要命令插值和一些棘手的引用：同时用空格和其他奇怪的字符插值值非常适合命令的非脆弱构造，shell 首先在空格上拆分值是有原因的：允许插入多个参数。大多数现代 shell 都具有一流的数组类型，但较旧的 shell 使用空格分隔来模拟数组。因此，如果您将“foo bar”之类的值插入到 shell 中的命令中，默认情况下它会被视为两个单独的单词。但是，在具有一流数组类型的语言中，有一个更好的选择：始终将单个值作为单个参数进行插值，并将数组作为多个值进行插值。这正是 Julia 的反引号插值所做的： julia&gt; dirs = [&quot;foo&quot;, &quot;bar&quot;, &quot;baz&quot;];julia&gt; collect(`find $dirs -type f`)6-element Array{String,1}： &quot;find&quot; &quot;foo&quot; &quot;bar&quot; &quot;baz&quot; &quot;-type&quot; &quot;f&quot; 当然，无论包含在内插数组中的字符串多么奇怪，它们都会成为逐字参数，无需任何 shell 解释。朱莉娅的反引号还有一个花哨的技巧。我们之前看到（没有真正评论它）您可以将单个值插入到更大的参数中：Julia 执行 shell 会执行的操作，如果您编写了 echo foo{bar,baz}。这甚至适用于插入到同一个 shell 单词中的多个值：如果在同一个单词中使用多个 {...} 表达式，这与 shell 所做的笛卡尔积扩展相同。\n您可以在 Julia 的在线手册中阅读更多内容，包括如何构建复杂的管道，以及 Julia 反引号语法中与 shell 兼容的引用和插值规则如何使将 shell 命令剪切并粘贴到 Julia 代码中变得既简单又安全。整个系统的设计原则是最简单的事情也应该是正确的事情。最终结果是在 Julia 中启动和与外部进程交互既方便又安全。", "note_en": "Note: This post has been updated to work with Julia 1.x (the original version used Julia 0.1 syntax).\n  In a  previous post, I talked about why &#34;shelling out&#34; to spawn a pipeline of external programs via an intermediate shell is a common cause of bugs, security holes, unnecessary overhead, and silent failures. But it&#39;s so convenient! Why can&#39;t running pipelines of external programs be convenient  and safe? Well, there&#39;s no real reason, actually. The shell itself manages to construct and execute pipelines quite well. In principle, there&#39;s nothing stopping high-level languages from doing it at least as well as shells do – the common ones just don&#39;t by default, instead requiring users to make the extra effort to use external programs safely and correctly. There are two major impediments:\n  Some moderately tricky low-level UNIX plumbing using the   pipe,   dup2,   fork,   close, and   exec system calls;\n  This post describes the system we designed and implemented for Julia, and how it avoids the major flaws of shelling out in other languages. First, I&#39;ll present the Julia version of the previous post&#39;s example – counting the number of lines in a given directory containing the string &#34;foo&#34;. The fact that Julia provides complete, specific diagnostic error messages when pipelines fail turns out to reveal a surprising and subtle bug, lurking in what appears to be a perfectly innocuous UNIX pipeline. After fixing this bug, we go into details of how Julia&#39;s external command execution and pipeline construction system actually works, and why it provides greater flexibility and safety than the traditional approach of using an intermediate shell to do all the heavy lifting.\n    Here&#39;s how you write the example of counting the number of lines in a directory containing the string &#34;foo&#34; in Julia (you can follow along at home if you have Julia installed from source by changing directories into the Julia source directory and doing  cp -a src &#34;source code&#34;; mkdir tmp and then firing up the Julia repl):\n  julia&gt; dir = &#34;src&#34;; # works in the git repo for Juliajulia&gt; parse(Int, readchomp(pipeline( `find $dir -type f -print0`, `xargs -0 grep foo`, `wc -l`, )))5\n  This Julia command looks suspiciously similar to the naïve Ruby version we started with in the previous post:\n    julia&gt; dir = &#34;source code&#34;;julia&gt; parse(Int, readchomp(pipeline( `find $dir -type f -print0`, `xargs -0 grep foo`, `wc -l`, )))5julia&gt; dir = &#34;nonexistent&#34;;julia&gt; parse(Int, readchomp(pipeline( `find $dir -type f -print0`, `xargs -0 grep foo`, `wc -l`, )))find: ‘nonexistent’: No such file or directoryERROR: failed processes: Process(`find nonexistent -type f -print0`, ProcessExited(1)) [1] Process(`xargs -0 grep foo`, ProcessExited(123)) [123]julia&gt; dir = &#34;foo&#39;; echo MALICIOUS ATTACK; echo &#39;&#34;;julia&gt; parse(Int, readchomp(pipeline( `find $dir -type f -print0`, `xargs -0 grep foo`, `wc -l`, )))find: ‘foo&#39;; echo MALICIOUS ATTACK; echo &#39;’: No such file or directoryERROR: failed processes: Process(`find &#34;foo&#39;; echo MALICIOUS ATTACK; echo &#39;&#34; -type f -print0`, ProcessExited(1)) [1] Process(`xargs -0 grep foo`, ProcessExited(123)) [123]\n   In the above examples, we can see that even when  dir contains spaces or quotes, the expression still behaves exactly as intended – the value of  dir is interpolated as a single argument to the  find command. When  dir is not the name of a directory that exists,  find fails – as it should – and this failure is detected and automatically converted into an informative exception, including the fully expanded command-lines that failed.\n In the previous post, we observed that using the  pipefail option for Bash allows detection of pipeline failures, like this one, occurring before the last process in the pipeline. However, it only allows us to detect that at least one thing in the pipeline failed. We still have to guess at what parts of the pipeline actually failed. In the Julia example, on the other hand, there is no guessing required: when a non-existent directory is given, we can see that both  find and  xargs fail. While it is unsurprising that  find fails in this case, it is unexpected that  xargs also fails. Why  does  xargs fail?\n One possibility to check for is that the  xargs program fails with no input. We can use Julia&#39;s  success predicate to try it out:\n  Ok, so  xargs seems perfectly happy with no input. Maybe grep doesn&#39;t like not getting any input?\n  Aha!  grep returns a non-zero status when it doesn&#39;t get any input. Good to know. It turns out that  grep indicates whether it matched anything or not with its return status. Most programs use their return status to indicate success or failure, but some, like  grep, use it to indicate some other boolean condition – in this case &#34;found something&#34; versus &#34;didn&#39;t find anything&#34;:\n  Now we know why  grep is &#34;failing&#34; – and  xargs too, since it returns a non-zero status if the program it runs returns non-zero. This means that our Julia pipeline and the &#34;responsible&#34; Ruby version are both susceptible to bogus failures when we search an existing directory that happens not to contain the string &#34;flippity&#34; anywhere:\n julia&gt; dir = &#34;src&#34;;julia&gt; parse(Int, readchomp(pipeline( `find $dir -type f -print0`, `xargs -0 grep flippity`, `wc -l`, )))ERROR: failed process: Process(`xargs -0 grep flippity`, ProcessExited(123)) [123]\n Since  grep indicates not finding anything using a non-zero return status, the  readchomp function concludes that its pipeline failed and raises an error to that effect. In this case, this default behavior is undesirable: we want the expression to just return  0 without raising an error. The simple fix in Julia is this:\n julia&gt; parse(Int, readchomp(pipeline( `find $dir -type f -print0`, ignorestatus(`xargs -0 grep flippity`), `wc -l`, )))0\n This works correctly in all cases. Next I&#39;ll explain  how all of this works, but for now it&#39;s enough to note that the detailed error message provided when our pipeline failed exposed a rather subtle bug that would eventually cause subtle and hard-to-debug problems when used in production. Without such detailed error reporting, this bug would be pretty difficult to track down.\n  Julia borrows the backtick syntax for external commands from Perl and Ruby, both of which in turn got it from the shell. Unlike in these predecessors, however, in Julia backticks don&#39;t immediately run commands, nor do they necessarily indicate that you want to capture the output of the command. Instead, backticks just construct an object representing a command:\n  (In the Julia repl,  ans is automatically bound to the value of the last evaluated input.) In order to actually run a command, you have to  do something with a command object. To run a command and capture its output into a string – what other languages do with backticks automatically – you can apply the  read function with  String as the second argument indicating that you want a string not a byte array:\n  Since it&#39;s very common to want to discard the trailing line break at the end of a command&#39;s output, Julia provides the  readchomp(x) command which is equivalent to writing  chomp(read(x, String)):\n  To run a command without capturing its output, letting it just print to the same  stdout stream as the main process – i.e. what the  system function does when given a command as a string in other languages – use the  run function:\n  The  &#34;Hello&#34; after the  readchomp command is a returned value, whereas the  Hello after the  run command is printed output. The  Process(`echo Hello`, ProcessExited(0)) is the value returned by  run. (If your terminal supports color, these are colored differently so that you can easily distinguish them visually.) If something goes wrong, an exception is raised:\n julia&gt; run(`false`)ERROR: failed process: Process(`false`, ProcessExited(1)) [1]julia&gt; run(`notaprogram`)ERROR: IOError: could not spawn `notaprogram`: no such file or directory (ENOENT)\n As with  xargs and  grep above, this may not always be desirable. In such cases, you can use  ignorestatus to indicate that the command returning a non-zero value should not be considered an error:\n julia&gt; run(ignorestatus(`false`))Process(`false`, ProcessExited(1))julia&gt; run(ignorestatus(`notaprogram`))ERROR: IOError: could not spawn `notaprogram`: no such file or directory (ENOENT)\n In the latter case, an error is still raised in the parent process since the problem is that the executable doesn&#39;t even exist, rather than merely that it ran and returned a non-zero status.\n Although Julia&#39;s backtick syntax intentionally mimics the shell as closely as possible, there is an important distinction: the command string is never passed to a shell to be interpreted and executed; instead it is parsed in Julia code, using the same rules the shell uses to determine what the command and arguments are. Command objects look a bit like strings, but they&#39;re actually more like an array of strings, which can be seen if you collect a command:\n julia&gt; cmd = `perl -e &#39;print &#34;Hello\\n&#34;&#39;``perl -e &#39;print &#34;Hello\\n&#34;&#39;`julia&gt; collect(cmd)3-element Array{String,1}: &#34;perl&#34; &#34;-e&#34; &#34;print \\&#34;Hello\\\\n\\&#34;&#34;\n   So commands are very much just a funny kind of string array. If your terminal supports underlines, the individual words in the command will be underlined, helping you to easily see where the breaks between words are.\n  The purpose of the backtick notation in Julia is to provide a familiar, shell-like syntax for making objects representing commands with arguments. To that end, quotes and spaces work just as they do in the shell. The real power of backtick syntax doesn&#39;t emerge, however, until we begin constructing commands programmatically. Just as in the shell (and in Julia strings), you can interpolate values into commands using the dollar sign ( $):\n  Unlike in the shell, however, Julia values interpolated into commands are interpolated as a single verbatim argument – no characters inside the value are interpreted as special after the value has been interpolated:\n julia&gt; dir = &#34;two words&#34;;julia&gt; collect(`find $dir -type f`)4-element Array{String,1}: &#34;find&#34; &#34;two words&#34; &#34;-type&#34; &#34;f&#34;julia&gt; dir = &#34;foo&#39;bar&#34;;julia&gt; collect(`find $dir -type f`)4-element Array{String,1}: &#34;find&#34; &#34;foo&#39;bar&#34; &#34;-type&#34; &#34;f&#34;\n This works no matter what the contents of the interpolated value is, allowing simple interpolation of characters that are quite difficult to pass as parts of command-line arguments even in the shell (for the following examples,  tmp/a.tsv and  tmp/b.tsv can be created in the shell with  echo -e &#34;foo\\tbar\\nbaz\\tqux&#34; &gt; tmp/a.tsv; echo -e &#34;foo\\t1\\nbaz\\t2&#34; &gt; tmp/b.tsv):\n julia&gt; tab = &#34;\\t&#34;;julia&gt; cmd = `join -t$tab tmp/a.tsv tmp/b.tsv`;julia&gt; collect(cmd)4-element Array{String,1}: &#34;join&#34; &#34;-t\\t&#34; &#34;tmp/a.tsv&#34; &#34;tmp/b.tsv&#34;julia&gt; run(cmd)foo bar 1baz qux 2Process(`join &#39;-t &#39; tmp/a.tsv tmp/b.tsv`, ProcessExited(0))\n Moreover, what comes after the  $ can actually be any valid Julia expression, not just a variable name:\n  A tab character is somewhat harder to pass in the shell, requiring command interpolation and some tricky quoting:\n  While interpolating values with spaces and other strange characters is great for non-brittle construction of commands, there was a reason why the shell split values on spaces in the first place: to allow interpolation of multiple arguments. Most modern shells have first-class array types, but older shells used space-separation to simulate arrays. Thus, if you interpolate a value like &#34;foo bar&#34; into a command in the shell, it&#39;s treated as two separate words by default. In languages with first-class array types, however, there&#39;s a much better option: consistently interpolate single values as single arguments and interpolate arrays as multiple values. This is precisely what Julia&#39;s backtick interpolation does:\n julia&gt; dirs = [&#34;foo&#34;, &#34;bar&#34;, &#34;baz&#34;];julia&gt; collect(`find $dirs -type f`)6-element Array{String,1}: &#34;find&#34; &#34;foo&#34; &#34;bar&#34; &#34;baz&#34; &#34;-type&#34; &#34;f&#34;\n And of course, no matter how strange the strings contained in an interpolated array are, they become verbatim arguments, without any shell interpretation. Julia&#39;s backticks have one more fancy trick up their sleeve. We saw earlier (without really remarking on it) that you could interpolate single values into a larger argument:\n    Julia does what the shell would do if you wrote  echo foo{bar,baz}. This even works correctly for multiple values interpolated into the same shell word:\n  This is the same Cartesian product expansion that the shell does if multiple  {...} expressions are used in the same word.\n  You can read more in Julia&#39;s  online manual, including how to construct complex pipelines, and how shell-compatible quoting and interpolation rules in Julia&#39;s backtick syntax make it both simple and safe to cut-and-paste shell commands into Julia code. The whole system is designed on the principle that the easiest thing to do should also be the right thing. The end result is that starting and interacting with external processes in Julia is both convenient and safe.", "posttime": "2021-08-09 05:03:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "放进,put,julia", "title": "把它放进你的烟斗 (2013)", "title_en": "Put This In Your Pipe (2013)", "transed": 1, "url": "https://julialang.org/blog/2013/04/put-this-in-your-pipe/", "via": "", "real_tags": ["放进", "put", "julia"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072185, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载 PDF 摘要：与井字棋或跳棋不同，最佳玩法会导致平局，目前尚不清楚国际象棋中的最佳玩法是以白方获胜、黑方获胜还是平局告终。但是在国际象棋中，在白方先走之后，如果黑方先双步，然后白方双步，然后交替下棋，则下棋会更加平衡，因为白方并不总是走平或领先。象征性地，平衡交替给出以下移动顺序：在白（W）的初始移动之后，首先黑（B）然后白各有连续两步（BBWW），然后是交替顺序，以W开始，它们总共可以是写成 WB/BW/WB/WB/WB...（斜线分隔成对的交替移动）。除了将第 3 步和第 4 步从 WB 反转为 BW 之外，这是标准的国际象棋顺序。因为平衡交替在有利于白棋的标准序列和有利于黑棋的可比较序列之间，极有可能产生具有最佳玩法的平局，从而使国际象棋更加公平。这一结论得到了对国际象棋开局及其在平衡交替下如何发挥作用的计算机分析的支持。", "note_en": "Download PDF  Abstract: Unlike tic-tac-toe or checkers, in which optimal play leads to a draw, it isnot known whether optimal play in chess ends in a win for White, a win forBlack, or a draw. But after White moves first in chess, if Black has a doublemove followed by a double move of White and then alternating play, play is morebalanced because White does not always tie or lead in moves. Symbolically,Balanced Alternation gives the following move sequence: After White&#39;s (W)initial move, first Black (B) and then White each have two moves in a row(BBWW), followed by the alternating sequence, beginning with W, whichaltogether can be written as WB/BW/WB/WB/WB... (the slashes separatealternating pairs of moves). Except for reversal of the 3rd and 4th moves fromWB to BW, this is the standard chess sequence. Because Balanced Alternationlies between the standard sequence, which favors White, and a comparablesequence that favors Black, it is highly likely to produce a draw with optimalplay, rendering chess fairer. This conclusion is supported by a computeranalysis of chess openings and how they would play out under BalancedAlternation.", "posttime": "2021-08-09 05:02:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "动作,chess,交替", "title": "更公平的国际象棋：国际象棋中两个开局动作的逆转创造平衡", "title_en": "Fairer Chess: A Reversal of Two Opening Moves in Chess Creates Balance", "transed": 1, "url": "https://arxiv.org/abs/2108.02547", "via": "", "real_tags": ["动作", "chess", "交替"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072184, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个流行的消费者应用程序经常出乎意料地变得更糟：一些难以使用、缺少功能和速度较慢的组合。在历史上软件正在大量吞噬世界的时代，这是荒谬的。这也会损害依赖这些产品的人们的生活。首先，举几个例子来澄清我正在谈论的事情。这些只是我亲身经历的那些。在 iMovie &#39;08 推出多年后，您仍然可以获取和使用 &#39;06 版本，而且很多人都这样做了，因为它简单明了，而且您需要做的显而易见的事情总是触手可及。那时我正在使用该程序，因为我是一个技术极客，更新到了最新最好的，然后在 08 年沦为早期的愤怒尖叫。我无法弄清楚如何做很多显而易见的事情，一切都很笨拙。没有哪个维度比 &#39;08 更好。至于 iPhoto，我从来没有用过它，但我八十多岁的妈妈用过它，用我放弃袖珍相机时送给她的 Sony RX100 拍了很多很棒的照片。她不是极客，但拥有科学学士学位，而且非常聪明。在某些时候，他们破坏了 iPhoto，所以她无法弄清楚如何做任何事情，当她向我寻求帮助时，她的眼里含着泪水。我试图让她修好，但她不再拍照了。我想念他们。经济学家的痛苦·当《经济学人》发布他们的应用程序时，我仍然是 Android 小组的一名开发者倡导者。我认为它拥有有史以来最好的用户体验之一。您从当前问题的开头开始，将一篇文章向下滑动到底部，然后切换以从右侧引入下一篇文章。它会记住你要去哪里，这支持了《经济学人》成为周报的愿景；一次通过，你就在那一周赶上了世界。总有一个进入目录的手势，但我发现我通常不需要它，只是刷过我不关心的东西。我当时对它赞不绝口，并且（无可否认）后来批评了它的“后退”可供性，但这只是一个小小的抱怨。最新版本已被幻想和残废。首先，当您打开应用程序时，它不会将您带到上次阅读的位置。它坚持从“每日新闻”开始（有很多其他网站可以提供这些内容），您必须按“周”才能返回实际出版物。当你这样做时，即使它知道你读过哪些文章（在目录中用复选标记标记它们）它也不会带你到上次阅读的地方。因此，您必须浏览目录才能重新启动。当你到达一篇文章的底部时，它不会停止，它会让你进入一些奇怪的混蛋部分特定的目录表。我想要的只是向下翻转然后向右翻转，直到我到达该死的杂志的末尾。为什么？！\nMLB · 我多年来一直使用 Roku/MLB 组合在我们的大电视上观看球赛。多年来，该应用程序不断发展，而且大多变得更好。我发现 Roku 上的事情往往有点迟钝，但 MLB 还不错；它会很快让你进入一个包含棒球场漂亮图片的屏幕，然后覆盖一个正在进行的比赛网格；选择你想要的，然后离开。突然间，它变得非常慢，显然是在花时间尝试使用一些 AI 巫术来确定我想看哪个游戏。在无休止的延迟之后，您会看到它认为您想观看的游戏的实时视频，并在边缘覆盖了一些其他游戏和菜单选项。它相当擅长猜测我想看哪场比赛，但比以前更慢了。当它（经常）出错时，有两个（缓慢的）菜单转换可以返回到所有游戏的网格。此外，他们搞砸了 Android Auto 应用程序——我发现听游戏是在路上打发时间的好方法。它总是有一个缺陷，它试图猜测你想看哪场比赛并开始玩——猜测很糟糕，我经常以西班牙语的迈阿密马林鱼队结束。但是，您距离提供的所有内容的清单仅一步之遥。最近，启动屏幕正在尝试变得更智能，因此在呈现您可能想听到的内容时要慢得多，并提供了其他一些（不是全部）选项。所以我必须永远等待这一点出现，然后点击一个很小的“更多……”目标来获得所有提供的游戏的实际列表。为什么会发生这种情况？ · 很明显。每个高科技公司都有被称为“产品经理”（PM）的人，他们的工作是与客户、管理层和工程师合作，定义产品应该做什么。历史上没有一位总理说过“这似乎运作得很好，让我们保持现状。”因为这并不大胆。这不是有远见的。那不会让你升职。提出一个大胆的 UX 创新并获得赞誉是每个 PM 的梦想，许多人相信软件比客户更擅长弄清楚客户想要什么的福音。这些天你会因为使用机器学习而获得加分。此外，每当您对流行产品进行任何更改时，您都会对其用户进行再培训。不幸的是，在他们的评估中，PM 认为客户再培训时间的成本为零。\n如何解决这个问题？好吧，在我在 Amazon Web Services 的日子里，我看到主要服务发布的实例恰好为零，在客户看来，这些实例使产品瘫痪或损坏。我不会声称我们的用户体验总体上非常出色，因为事实并非如此；大多数用户都是极客这一事实让我们有些措手不及。为什么没有破损？因为这些是企业产品，所以客户数量比 iAnything 少几个数量级，所以 PM 可以与他们交谈并从他们那里获得改进的想法。客户非常善于发现正在形成的 UX 错误。证据表明，对于大约 10 7 人使用的大众市场产品，真的很难预测哪些变化会被认为是愚蠢的、破碎的和侮辱性的。也许我们应该开始提拔那些愿意忍受偶尔发布一三个版本的 PM。也许我们应该解雇所有消费品 PM。也许我们应该开始在我们的产品规划过程中包括现实的客户再培训成本估算。", "note_en": "Too often, a popular consumer app unexpectedly gets worse: Some combination of harder to use, missing features, and slower. At a time in history where software is significantly eating the world, this is nonsensical. It’s also damaging to the lives of the people who depend on these products.\n First, a few examples to clarify the kind of thing I’m talking about. These are just the ones I’ve had personal experience with.\n  For years after the introduction of iMovie ’08, you could still get and use the ’06 version and lots of people did, because it was simple, straightforward, and the obvious things you needed to do were always within reach. I was using the program back then and since I’m a tech geek updated to the newest and greatest, then was reduced to inchoate screams of rage by ’08. I couldn’t figure out how to do lots of obvious things, everything was klunky. There wasn’t a single dimension along which ’08 was better.\n As for iPhoto, I never used it much, but my eighty-something mother did, and took lots of great photos with the Sony RX100 I gave her when I gave up on pocket cams. She’s not geeky but has a Bachelor’s in the sciences and is really smart. At some point they broke iPhoto so she couldn’t figure out how to do anything, and when she asked me for help she had tears in her eyes. I tried to get her fixed up, but she doesn’t take pictures much any more. I miss them.\n Economist pain · I was still a Developer Advocate in the Android group when  The Economist shipped their app. I thought it had one of the best user experiences ever. You started at the beginning of the current issue, swiped down through an article to the bottom, then swapped to bring the next article in from the right. It remembered where you’d got to, which supports  The Economist’s vision of being a weekly newspaper; one pass through and you’re caught up on the world that week. There was always a gesture to get to the Table of Contents, but I found I usually didn’t need it much, just swiped over the things I didn’t care about. I  praised it to the skies at the time, and (admittedly) since  criticized its “Back” affordance, but that was a minor gripe.\n The most recent version has been fancified and crippled. First of all, when you open the app, it doesn’t take you to where you were last reading. It insists on starting with “news of the day” (there are lots of other sites for that stuff) and you have to press “week” to get back into the actual publication. When you do that, even though it knows which articles you’ve read (marking them with a check-mark in the table of contents) it maddeningly doesn’t take you to where you were last. So you have to hunt through the table of contents to get yourself restarted.\n And when you get to the bottom of an article, it doesn’t stop, it drops you into some weird bastardized section-specific table of contents thingie. All I want is to flip down then flip right until I get to the damn end of the damn magazine.  Why?!\n MLB · I’ve used the Roku/MLB combo for years to watch ball games on our big TV. The app has evolved over the years and mostly gotten better. I find things on Roku tend to be a little sluggish, but MLB wasn’t too bad; it’d drop you, pretty quickly, into a screen containing a nice picture of a baseball stadium, then overlay a grid of games that were on; pick the one you want and away you go.\n Suddenly, it’s become immensely slower, and apparently is spending that time trying to use some AI voodoo to figure out which game I’d like to watch. After an endless delay, you get live video of the game it thinks you want to watch, with a few other games and menu choices overlaid around the edge. It’s reasonably good at guessing which game I want to watch, but way slower at getting me there than it used to be. When’s it’s (regularly) wrong, there are two (slow) menu transitions to get back to the grid of all the games.\n Also, they screwed up the Android Auto app  — I find listening to a game a good way to pass the time on the road. It’s always had a flaw in that it tries to guess which game you want to watch and starts playing that  — the guesses are laughably bad and I often end up with something like Miami Marlins in Spanish. But, you were one tap away from a nice list of everything on offer.\n Recently, the startup screen is trying be smarter, thus much slower, in presenting its guess as to what you might want to hear, with a few others (not all) offered as options. So I have to wait forever for this to manifest then hit a teeny little “More…” target to get the actual list of all the games on offer.\n Why does this happen? · It’s obvious. Every high-tech company has people called “Product Managers” (PMs) whose job it is to work with customers and management and engineers to define what products should do. No PM in history has ever said “This seems to be working pretty well, let’s leave it the way it is.” Because that’s not bold. That’s not visionary. That doesn’t get you promoted.\n It is the dream of every PM to come up with a bold UX innovation that gets praise, and many believe the gospel that the software is better at figuring out what the customer wants than the customer is. And you get extra points these days for using ML.\n Also, any time you make any change to a popular product, you’ve imposed a retraining cost on its users. Unfortunately, in their evaluations, PMs consider the cost of customer retraining time to be zero.\n How to fix this? Well, in my days at Amazon Web Services, I saw exactly zero instances of major service releases that, in the opinion of customers, crippled or broke the product. I’m not going to claim that our UX was generally excellent because it wasn’t; the fact that most users were geeks let us somewhat off the hook.\n Why no breakage? Because these were Enterprise products, so the number of customers was orders of magnitude smaller than iAnything, so the PM could go talk to them and bounce improvement ideas off them. Customers are pretty good at spotting UX goofs in the making.\n The evidence suggests that for mass-market products used by on the order of 10 7 people, it’s really difficult to predict which changes will be experienced as stupid, broken, and insulting.\n Maybe we ought to start promoting PMs who are willing to stand pat for an occasional release or three. Maybe we ought to fire all the consumer-product PMs. Maybe we ought to start including realistic customer-retraining-cost estimates in our product planning process.", "posttime": "2021-08-09 05:02:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,apps,产品", "title": "应用程序变得更糟", "title_en": "Apps Getting Worse", "transed": 1, "url": "https://www.tbray.org/ongoing/When/202x/2021/08/07/Apps-Get-Worse", "via": "", "real_tags": ["程序", "apps", "产品"]}, {"category": "", "categoryclass": "", "imagename": "7ee8051cee40a9bd36c93eba68cd506b.png", "infoid": 1072183, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在本文中，我们将开始解决通过智能手机摄像头制作可点击的印刷链接（即书籍或杂志中的链接）的问题。我们将使用 TensorFlow 2 对象检测 API 来训练自定义对象检测器模型，以在文本图像（即智能手机相机流）中查找子字符串（如 https://）的位置和边界框。每个链接的文本（https:// 边界框的右侧延续）将使用 Tesseract 库进行识别。本文不会涉及识别部分，但您可以在 links-detector 存储库中找到该应用程序的完整代码示例。 📝 在 GitHub 上打开 links-detector 存储库以查看应用程序的完整源代码。 ⚠️ 目前该应用程序处于实验 Alpha 阶段，存在许多问题和限制。所以在这些问题得到解决之前，不要把你的期望值提高得太高🤷🏻‍。此外，本文的目的更多是关于学习如何使用 TensorFlow 2 对象检测 API，而不是想出一个生产就绪的模型。如果本文中的 Python 代码块在此平台上缺乏正确的格式，请随时阅读 GitHub 上的文章我是一名软件工程师，在我自己的时间里，我将学习机器学习作为一种爱好。但这还不是问题。\n我最近买了一本关于机器学习的印刷书，当我阅读前几章时，我在文本中遇到了许多看起来像 https://tensorflow.org/ 或 https://some-url.com 的印刷链接/which/may/be/even/longer?and_with_params=true。我看到了所有这些链接，但由于它们被打印出来，我无法点击它们（谢谢，帽子！）。要访问这些链接，我需要在浏览器的地址栏中逐个字符地键入它们，这非常烦人且容易出错。所以，我在想，如果类似于二维码检测，我们会尝试“教”智能手机（1）检测和（2）为我们识别打印的链接并使它们可点击？这样，您只需单击一次，而不是多次击键。 “点击”打印链接的操作复杂度从 O(N) 到 O(1)。正如我之前提到的，我只是将机器学习作为一种爱好来学习。因此，本文的目的更多是关于学习如何使用 TensorFlow 2 对象检测 API，而不是想出一个生产就绪的应用程序。在 iPhone X 这样的设备上，检测和识别过程应该具有接近实时的性能（即每秒 0.5-1 帧）。这意味着整个检测 + 识别过程最多需要 2 秒（相当可以忍受）至于业余项目）。仅应支持浅色背景（即白色或浅灰色）上的深色文本（即黑色或深灰色）。目前只支持 https:// 链接（如果我们的模型无法识别 http://、ftp://、tcp:// 或其他类型的链接，也可以）。\n在后端进行链接检测和识别，并将响应发送回客户端。 💚 检测性能不受客户端设备限制。我们可以通过水平（添加更多实例）和垂直（添加更多内核/GPU）扩展服务来加快检测速度。 💚 模型可能更大，因为不需要上传到客户端。在客户端下载 ~10Mb 模型可能没问题，但加载 ~100Mb 模型对于客户端的网络和应用程序 UX（用户体验）来说可能是一个大问题。 💚 可以控制谁在使用模型。模型受 API 保护，因此我们可以完全控制其调用方/客户端。 💔 系统复杂性增长。应用程序技术堆栈从 JavaScript 发展到 JavaScript + Python。我们需要注意自动缩放。 💔 应用程序的离线模式是不可能的，因为它需要互联网连接才能工作。 💔 客户端和服务器之间过多的 HTTP 请求可能会在某个时候成为瓶颈。想象一下，如果我们想要提高检测的性能，比方说，从每秒 1 帧到 10+ 帧。这意味着每个客户端每秒将发送 10 个以上的请求。对于 10 个并发客户端，每秒已经有 100 多个请求。在这种情况下，HTTP/2 双向流和 gRPC 可能很有用，但我们将回到这里增加的系统复杂性。\n💔 系统变得更加昂贵。几乎所有来自 Pros 部分的积分都需要支付。 💚 系统不那么复杂。我们不需要设置服务器、构建 API 以及向系统引入额外的 Python 堆栈。 💚 离线模式是可能的。该应用程序不需要互联网连接即可工作，因为模型已完全加载到设备上。因此，可能会构建渐进式 Web 应用程序 (PWA) 来支持这一点。 💚 系统“有点”自动缩放。您拥有的客户端越多，它们带来的内核和 GPU 就越多。但这不是一个合适的缩放解决方案（更多关于下面的缺点部分）。 💚 系统更便宜。我们只需要一个用于静态资产（HTML、JS、CSS、模型文件等）的服务器。这可能是免费的，比方说，在 GitHub 上。 💚 每秒发送到服务器端的 HTTP 请求数量不断增加，这没有问题。 💔 只能进行水平缩放（每个客户端都有自己的 CPU/GPU）。垂直缩放是不可能的，因为我们无法影响客户端的设备性能。因此，我们无法保证对低性能设备进行快速检测。\n💔 无法保护模型的使用并控制模型的调用者/客户端。每个人都可以下载模型并重新使用它。 💔 客户端设备的电池消耗可能会成为一个问题。为了使模型工作，它需要计算资源。因此，当应用程序运行时，客户可能不满意他们的 iPhone 越来越热。由于该项目的目的更多是关于学习而不是提出生产就绪的解决方案，因此我决定采用从客户端为模型提供服务的第二种选择。这使整个项目的成本大大降低（实际上，使用 GitHub 可以免费托管它），而且我可以将更多精力放在机器学习上，而不是自动缩放后端基础设施上。好的，所以我们决定采用无服务器解决方案。现在我们有一个来自相机流的图像作为输入，看起来像这样：第一个也是最明显的方法是通过使用识别图像的整个文本来解决光学字符识别 (OCR) 任务，比方说, Tesseract.js 库。它返回段落、文本行和文本块的边界框以及识别的文本。然后我们可以尝试使用这样的正则表达式从识别的文本行或文本块中提取链接（示例在 TypeScript 上）： const URL_REG_EXP = / https?:\\/\\/(www\\.)?[-a -zA-Z0-9@:%._+~#=]{2,256}\\.[az]{2,4}\\b([-a-zA-Z0-9@:%_+.~#? &amp;/=]*) / gi ; const extractLinkFromText = (text : string ) : string | null =&gt; { const urls : string [] |空 = 文本。匹配 ( URL_REG_EXP ) ; if ( !urls || !urls .length ) { return null ; } 返回网址 [ 0 ] ; };\n💔 问题是识别+检测时间可能会从 2 秒到 20+ 秒不等，具体取决于文本的大小、图像上“看起来像文本的东西”的数量、图像质量和其他因素.因此，要达到每秒 0.5-1 帧以让用户体验至少接近实时将非常困难。 💔 此外，如果我们考虑一下，我们要求图书馆为我们识别图像中的整个文本，即使它可能只包含一两个链接（即只有约 10% 的文本可能对我们有用）我们），或者它甚至可能根本不包含链接。在这种情况下，这听起来像是在浪费计算资源。如果我们在链接文本识别之前使用一些额外的“顾问”算法，我们可以使 Tesseract 工作得更快。这个“顾问”算法应该检测但不识别图像上每个链接的最左边位置（如果有的话）。这将使我们能够通过遵循以下规则来加速识别部分：如果图像不包含任何链接，我们根本不应调用 Tesseract 检测/识别。如果图像确实有链接，那么我们需要让 Tesseract 仅识别图像中包含链接的那些部分。我们不想花时间识别不包含链接的不相关文本。将在 Tesseract 之前发生的“顾问”算法应该以恒定的时间工作，无论图像质量如何，或者图像上是否存在文本。它也应该非常快，并且在不到 1 秒的时间内检测到链接最左边的位置，以便我们能够满足“接近实时”的要求（即在 iPhone X 上）。 💡 那么，如果我们使用另一个对象检测模型来帮助我们找到图像中所有出现的 https:// 子字符串（每个安全链接都有这个前缀，不是吗）怎么办？然后，在文本中有这些 https:// 边界框，我们可以提取它们的右侧延续并将它们发送到 Tesseract 进行文本识别。\n您可能会注意到 Tesseract 需要做的工作要少得多，以防万一它有一些关于链接可能位于何处的提示（请参阅两张图片上的蓝色框的数量）。所以现在的问题是我们应该选择哪种对象检测模型以及如何重新训练它以支持自定义 https:// 对象的检测。训练一个新的对象检测模型在我们的上下文中不是一个合理的选择，因为以下原因：💔我们很可能无法收集数十万张带有链接的书籍的标记图像（我们可能会虽然生成它们，但稍后会详细介绍）。因此，与其创建新模型，不如教一个现有的对象检测模型为我们进行自定义对象检测（进行迁移学习）。在我们的例子中，“自定义对象”将是带有 https:// 文本的图像。这种方法有以下好处： 💚 数据集可能要小得多。我们不需要收集成千上万的标记图像。相反，我们可能会做大约 100 张图片并手动标记它们。这是因为模型已经在 COCO 数据集等通用数据集上进行了预训练，并且已经学会了如何提取通用图像特征。 💚 训练过程会更快（GPU 上的分钟/小时而不是几天/几周）。同样，这是因为较小的数据集（较小的批次）和较少的可训练参数。\n我们可以从 TensorFlow 2 Detection Model Zoo 中选择现有模型，该模型提供了一系列在 COCO 2017 数据集上预训练的检测模型。现在它包含大约 40 个模型变体可供选择。为了在自定义数据集上重新训练和微调模型，我们将使用 TensorFlow 2 对象检测 API。 TensorFlow 对象检测 API 是一个构建在 TensorFlow 之上的开源框架，可以轻松构建、训练和部署对象检测模型。如果您点击 Model Zoo 链接，您将找到每个模型的检测速度和准确度。当然，我们希望在选择模型时在检测速度和准确性之间找到适当的平衡。但是在我们的例子中可能更重要的是模型的大小，因为它将被加载到客户端。存档模型的大小可能在 ~20Mb 到 ~1Gb 之间变化很大。以下是几个例子： 💚 它使用 MobileNet v2 网络作为特征提取器，该网络针对移动设备的使用进行了优化，以降低能耗。 💚 无论图像内容如何，​​它都会一次性对整个图像和其中的所有对象进行对象检测（不涉及区域提议步骤，这使得检测速度更快）。\n💔 虽然它不是最准确的模型（一切都是权衡⚖️）。模型名称编码了一些重要特征，如果需要，您可以阅读更多相关信息： 在本文中，我们将把 Tensorflow 2 对象检测 API 作为 Python 包安装。如果您在 Google Colab（推荐）或 Jupyter 中进行试验，这会很方便。对于这两种情况，都不需要本地安装，您可以直接在浏览器中进行试验。如果您更喜欢通过 Docker 安装对象检测 API，您也可以遵循官方文档。如果您在 API 安装或数据集准备期间遇到问题，请尝试通读 TensorFlow 2 对象检测 API 教程，其中为该过程添加了许多有用的细节。克隆到“模型”...远程：枚举对象：2301，done.remote：计数对象：100%（2301/2301），done.remote：压缩对象：100%（2000/2000），done.remote：总计2301 (delta 561), 重用 922 (delta 278), 打包重用 0Receiving objects: 100% (2301/2301), 30.60 MiB | 13.90 MiB/s，完成。解析增量：100% (561/561)，完成。由于某些依赖项错误，最后一步可能会失败。在这种情况下，您可能需要运行 pip install 。 ——再安静一次。\nTensorFlow 对象检测 API 已安装！您现在可以使用 API 提供的脚本进行模型推理、训练或微调。让我们从 TensorFlow Model Zoo 下载我们选择的 ssd_mobilenet_v2_fpnlite_640x640_coco17_tpu-8 模型，并检查它如何进行一般对象检测（从 COCO 数据集中检测类的对象，如“猫”、“狗”、“汽车”等）。我们将使用 get_file() TensorFlow 帮助程序从 URL 下载存档模型并将其解压缩。将张量流导入为 tf 导入路径libMODEL_NAME = &#39;ssd_mobilenet_v2_fpnlite_640x640_coco17_tpu-8&#39;TF_MODELS_BASE_PATH = &#39;http://download.tensorflow.org/models/object_detection/tf2/202007111/202007111/202007111/202007111/20200711_model_cache_model_cache_model_cache_model_cache_model_fpnlite_640x640_coco17_tpu-8&#39;TF_MODELS_BASE_PATH = &#39;http://download.tensorflow.org/models/object_detection/tf2 = TF_MODELS_BASE_PATH + model_name + &#39;.tar.gz&#39; model_dir = tf .keras .utils .get_file ( fname =model_name , origin =model_url , untar = True , cache_dir =pathlib .Path (cache_folder ) .absolute ( ) ) return model_dir #开始模型 download.model_dir = download_tf_model (MODEL_NAME , CACHE_FOLDER ) 打印 (model_dir ) pipeline.config 文件包含模型的检测设置。当我们需要微调模型时，我们稍后会回到这个文件。目前，该模型可以检测 90 个 COCO 数据集类的对象，如汽车、鸟、热狗等。让我们看看模型在包含这些类对象的一些通用图像上的表现如何。\nObject Detection API 已经为我们定义了一套完整的 COCO 标签（类）。 import os # 导入对象检测 API 助手。 from object_detection .utils import label_map_util # 加载 COCO 标签数据（类名和索引关系）。 def load_coco_labels() : # Object Detection API 已经为我们定义了一套完整的 COCO 类。 label_map_path = os .path .join ( &#39;models/research/object_detection/data&#39; , &#39;mscoco_complete_label_map.pbtxt&#39; ) label_map = label_map_util .load_labelmap (label_map_path ) # 类 ID 到类名的映射。 category = label_map_util .convert_label_map_to_categories ( label_map , max_num_classes =label_map_util .get_max_label_map_index (label_map ) , use_display_name = True ) category_index = label_map_util .create_category_index (categories) #Class Name to Class ID mapping label_map_dict = label_map_util .get_label_map_dict (label_map , use_display_name = True ) return category_index , label_map_dict # 加载 COCO 标签.coco_category_index , coco_label_map_dict = load_coco_labels ( ) print ( &#39;coco_category_index :&#39;coco_category_index :&#39;coco_category_index_codict_index:&#39;coco_category_index_codict_map_index:&#39;coco_categ_c : {&#39;id&#39;: 1, &#39;name&#39;: &#39;person&#39;}, 2: {&#39;id&#39;: 2, &#39;name&#39;: &#39;bicycle&#39;}, ... 90: {&#39;id&#39;: 90, &#39;name&#39; : &#39;toothbrush&#39;},}coco_label_map_dict:{ &#39;background&#39;: 0, &#39;person&#39;: 1, &#39;bicycle&#39;: 2, &#39;car&#39;: 3, ... &#39;toothbrush&#39;: 90,} 我们需要创建一个检测该函数将使用我们下载的预训练模型进行对象检测。 import tensorflow as tf # 导入对象检测 API 助手。 from object_detection .utils import config_util from object_detection .builders import model_builder # 为特定模型和特定模型的检查点生成检测函数 def detection_fn_from_checkpoint (config_path , checkpoint_path ) : # 构建模型。 pipeline_config = config_util .get_configs_from_pipeline_file (config_path) model_config = pipeline_config [ &#39;model&#39; ] model = model_builder .build ( model_config =model_config , is_training = False , ) # 恢复检查点。 ckpt = tf .compat .v2 .train .Checkpoint (model =model ) ckpt .restore (checkpoint_path ) .expect_partial ( ) # 这是一个进行检测的函数。 @tf .function def detect_fn（图像）：图像，形状=模型.预处理（图像）预测_dict=模型.预测（图像，形状）检测=模型.后处理（预测_dict，形状）返回检测，预测_dict，tf .reshape（形状） , [ - 1 ] ) return detect_fninference_detect_fn = detection_fn_from_checkpoint ( config_path =os .path .join ( &#39;cache&#39; , &#39;datasets&#39; , MODEL_NAME , &#39;pipeline.config&#39; ) , checkpoint_path =os .path .join (&#39;datasets&#39; , &#39;datasets&#39; &#39; , MODEL_NAME , &#39;checkpoint&#39; , &#39;ckpt-0&#39; ) , ) 为此，让我们将图像保存到我们项目的 inference/test/ 文件夹中。如果您使用的是 Google Colab，则可以创建此文件夹并手动上传图像。 import matplotlib .pyplot as plt %matplotlib inline # 创建一个只有一个 image.inference_ds = tf .keras .p​​reprocessing .image_dataset_from_directory ( directory = &#39;inference&#39; , image_size = ( 640 , 640 ) , batch_size = 1 , False shuffle 的 TensorFlow 数据集, label_mode = None ) # Numpy 版本的数据集.inference_ds_numpy = list (inference_ds .as_numpy_iterator() ) # 你可以像这样预览数据集中的图像.plt .figure (figsize = ( 14 , 14 ) ) for i , image in枚举（inference_ds_numpy）：plt.subplot（2,2,i+1）plt.imshow（image[0].astype（“uint8”））plt.axis（“off”）plt.show（）\n现在我们已准备好运行检测。 inference_ds_numpy[0] 数组以 Numpy 格式存储第一张图像的像素数据。 box = detections [&#39;detection_boxes&#39;] .numpy ()scores = detections [&#39;detection_scores&#39;] .numpy()classes = detections [&#39;detection_classes&#39;] .numpy()num_detections = detections [&#39;num_detections&#39;] .numpy() [0 ] 打印（&#39;boxes.shape：&#39;，boxes .shape）打印（&#39;scores.shape：&#39;，scores.shape）打印（&#39;classes.shape：&#39;，classes.shape）打印（&#39;num_detections：&#39;，num_detections）模型为我们做了 100 次检测。但这并不意味着它在图像上找到了 100 个对象。这意味着该模型有 100 个槽，并且它最多可以在单个图像上检测 100 个对象。每个检测都有一个分数，代表模型对其的置信度。每个检测的边界框都存储在 box 数组中。模型关于每次检测的分数或置信度是......", "note_en": "In this article we will start solving the issue of making the printed links (i.e. in a book or in a magazine) clickable via your smartphone camera.\n We will use  TensorFlow 2 Object Detection API to train a custom object detector model to find positions and bounding boxes of the sub-strings like  https:// in the text image (i.e. in smartphone camera stream).\n The text of each link (right continuation of  https:// bounding box) will be recognized by using  Tesseract library. The recognition part will not be covered in this article, but you may find the complete code example of the application in  links-detector repository.\n  📝  Open links-detector repository on GitHub to see the complete source code of the application.\n   ⚠️ Currently the application is in  experimental  Alpha stage and has  many issues and limitations. So don&#39;t raise your expectations level too high until these issues are resolved 🤷🏻‍. Also, the purpose of this article is more about learning how to work with TensorFlow 2 Object Detection API rather than coming up with a production-ready model.\n In case if Python code blocks in this article will lack proper formatting on this platform feel free to  to read the article on GitHub\n  I work as a software engineer and in my own time, I learn Machine Learning as a hobby. But this is not the problem yet.\n I bought a printed book about Machine Learning recently and while I was reading through the first several chapters I&#39;ve encountered many printed links in the text that looked like  https://tensorflow.org/ or  https://some-url.com/which/may/be/even/longer?and_with_params=true.\n  I saw all these links, but I couldn&#39;t click on them since they were printed (thanks, cap!). To visit these links I needed to start typing them character by character in the browser&#39;s address bar, which was pretty annoying and error-prone.\n  So, I was thinking, what if, similarly to QR-code detection, we will try to &#34;teach&#34; the smartphone to  (1)  detect and  (2)  recognize printed links for us and to make them  clickable? This way you would do just one click instead of multiple keystrokes. The operational complexity of &#34;clicking&#34; the printed links goes from  O(N) to  O(1).\n    As I&#39;ve mentioned earlier I&#39;m just studying Machine Learning as a hobby. Thus, the purpose of this article is more about  learning how to work with TensorFlow 2 Object Detection API rather than coming up with a production-ready application.\n  The detection and recognition processes should have a  close-to-real-time performance (i.e.  0.5-1 frames per second) on a device like iPhone X. It means that the whole  detection + recognition process should take up to  2 seconds (pretty bearable as for the amateur project).\n  Only  dark text (i.e. black or dark-grey) on  light background (i.e. white or light-grey) should be supported.\n Only  https:// links should be supported for now (it is ok if our model will not recognize the  http://,  ftp://,  tcp:// or other types of links).\n      Do link detection and recognition on the back-end and send the response back to the client.\n   💚 The detection performance is not limited by the client&#39;s device. We may speed the detection up by scaling the service horizontally (adding more instances) and vertically (adding more cores/GPUs).\n 💚 The model might be bigger since there is no need to upload it to the client-side. Downloading the  ~10Mb model on the client-side may be ok, but loading the  ~100Mb model might be a big issue for the client&#39;s network and application UX (user experience) otherwise.\n 💚 It is possible to control who is using the model. Model is guarded behind the API, so we would have complete control over its callers/clients.\n  💔 System complexity growth. The application tech stack grew from just  JavaScript to, let&#39;s say,  JavaScript + Python. We need to take care of the autoscaling.\n 💔 Offline mode for the app is not possible since it needs an internet connection to work.\n 💔 Too many HTTP requests between the client and the server may become a bottleneck at some point. Imagine if we would want to improve the performance of the detection, let&#39;s say, from  1 to  10+ frames per second. This means that each client will send  10+ requests per second. For  10 simultaneous clients it is already  100+ requests per second. The  HTTP/2 bidirectional streaming and  gRPC might be useful in this case, but we&#39;re going back to the increased system complexity here.\n 💔 System becomes more expensive. Almost all points from the Pros section need to be paid for.\n      💚 System is less complex. We don&#39;t need to set up the servers, build the API, and introduce an additional Python stack to the system.\n 💚 Offline mode is possible. The app doesn&#39;t need an internet connection to work since the model is fully loaded to the device. So the Progressive Web Application ( PWA) might be built to support that.\n 💚 System is &#34;kind of&#34; scaling automatically. The more clients you have, the more cores and GPUs they bring. This is not a proper scaling solution though (more about that in a Cons section below).\n 💚 System is cheaper. We only need a server for static assets ( HTML,  JS,  CSS, model files, etc.). This may be done for free, let&#39;s say, on GitHub.\n 💚 No issue with the growing number of HTTP requests per second to the server-side.\n  💔 Only horizontal scaling is possible (each client will have its own CPU/GPU). Vertical scaling is not possible since we can&#39;t influence the client&#39;s device performance. As a result, we can&#39;t guarantee fast detection for low performant devices.\n 💔 It is not possible to guard the model usage and control the callers/clients of the model. Everyone could download the model and re-use it.\n 💔 Battery consumption of the client&#39;s device might become an issue. For the model to work it needs computational resources. So clients might not be happy with their iPhone getting warmer and warmer while the app is working.\n  Since the purpose of the project was more about learning and not coming up with a production-ready solution  I decided to go with the second option of serving the model from the client side. This made the whole project much cheaper (actually with GitHub it was free to host it), and I could focus more on Machine Learning than on the autoscaling back-end infrastructure.\n  Ok, so we&#39;ve decided to go with the serverless solution. Now we have an image from the camera stream as an input that looks something like this:\n     The first and the most obvious approach would be to solve the  Optical Character Recognition ( OCR) task by recognizing the whole text of the image by using, let&#39;s say,  Tesseract.js library. It returns the bounding boxes of the paragraphs, text lines, and text blocks along with the recognized text.\n  We may try then to extract the links from the recognized text lines or text blocks with a regular expression like  this one (example is on TypeScript):\n const  URL_REG_EXP  =   / https?:\\/\\/(www\\.)?[-a-zA-Z0-9@:%._+~#=]{2,256}\\.[a-z]{2,4}\\b([-a-zA-Z0-9@:%_+.~#?&amp;/=]*) / gi ; const extractLinkFromText  =  (text :  string ) :  string  |  null  =&gt;  {  const urls :  string [ ]  |  null  = text . match ( URL_REG_EXP ) ;  if  ( !urls  ||  !urls .length )  {  return  null ;  }  return urls [ 0 ] ; } ;\n   💔 The thing is that the  recognition + detection time may vary from  2 to  20+ seconds depending on the size of the text, on the amount of &#34;something that looks like a text&#34; on the image, on the image quality and on other factors. So it will be really hard to achieve those  0.5-1 frames per second to make the user experience at least  close to real-time.\n 💔 Also if we would think about it, we&#39;re asking the library to recognize the  whole text from the image for us even though it might contain only one or two links in it (i.e. only ~10% of the text might be useful for us), or it may even not contain the links at all. In this case, it sounds like a waste of computational resources.\n  We could make Tesseract work faster if we used some  additional &#34;adviser&#34; algorithm prior to the links text recognition. This &#34;adviser&#34; algorithm should detect, but not recognize,  the leftmost position of each link on the image if there are any. This will allow us to speed up the recognition part by following these rules:\n If the image does not contain any link we should not call Tesseract detection/recognition at all.\n If the image does have the links then we need to ask Tesseract to recognize only those parts of the image that contains the links. We&#39;re not interested in spending the time for recognition of the irrelevant text that does not contain the links.\n The &#34;adviser&#34; algorithm that will take place before the Tesseract should work with a constant time regardless of the image quality, or the presence/absence of the text on the image. It also should be pretty fast and detect the leftmost positions of the links for less than  1s so that we could satisfy the &#34;close-to-real-time&#34; requirement (i.e. on iPhone X).\n 💡 So what if we will use another object detection model to help us find all occurrences of the  https:// substrings (every secure link has this prefix, doesn&#39;t it) in the image? Then, having these  https:// bounding boxes in the text we may extract the right-side continuation of them and send them to the Tesseract for text recognition.\n   You may notice that Tesseract needs to do  much less work in case if it would have some hints about where are the links might be located (see the number of blue boxes on both pictures).\n So the question now is which object detection model we should choose and how to re-train it to support the detection of the custom  https:// objects.\n   Training a new object detection model is not a reasonable option in our context because of the following reasons:\n 💔 We most probably won&#39;t be able to collect hundreds of thousands of  labeled images of the books that have links in them (we might try to generate them though, but more about that later).\n So instead of creating a new model, we should better teach an existing object detection model to do the custom object detection for us (to do the  transfer learning). In our case, the &#34;custom objects&#34; would be the images with  https:// text drawn in them. This approach has the following benefits:\n 💚 The dataset might be much smaller. We don&#39;t need to collect hundreds of thousands of the labeled images. Instead, we may do  ~100 pictures and label them manually. This is because the model is already pre-trained on the general dataset like  COCO dataset and already learned how to extract general image features.\n 💚 The training process will be much faster (minutes/hours on GPU instead of days/weeks). Again, this is because of a smaller dataset (smaller batches) and because of fewer trainable parameters.\n We may choose the existing model from  TensorFlow 2 Detection Model Zoo which provides a collection of detection models pre-trained on the  COCO 2017 dataset. Now it contains  ~40 model variations to choose from.\n To re-train and fine-tune the model on the custom dataset we will use a  TensorFlow 2 Object Detection API. The TensorFlow Object Detection API is an open-source framework built on top of  TensorFlow that makes it easy to construct, train, and deploy object detection models.\n If you follow the  Model Zoo link you will find the  detection speed and  accuracy for each model.\n   Of course, we would want to find the right balance between the detection  speed and  accuracy while picking the model. But what might be even more important in our case is the  size of the model since it will be loaded to the client-side.\n The size of the archived model might vary drastically from  ~20Mb to  ~1Gb. Here are several examples:\n   💚 It uses the MobileNet v2 network as a feature extractor which is optimized for usage on mobile devices to reduce energy consumption.\n 💚 It does the object detection for the whole image and for all objects in it  in one go regardless of the image content (no  regions proposal step is involved which makes the detection faster).\n 💔 It is not the most accurate model though (everything is a tradeoff ⚖️).\n The model name encodes some several important characteristics that you may read more about if you want:\n   In this article, we&#39;re going to install the Tensorflow 2 Object Detection API  as a Python package. It is convenient in case if you&#39;re experimenting in  Google Colab (recommended) or in  Jupyter. For both cases no local installation is needed, you may experiment right in your browser.\n You may also follow the  official documentation if you would prefer to install Object Detection API via Docker.\n If you stuck with something during the API installation or during the dataset preparation try to read through the  TensorFlow 2 Object Detection API tutorial which adds a lot of useful details to this process.\n    Cloning into &#39;models&#39;...remote: Enumerating objects: 2301, done.remote: Counting objects: 100% (2301/2301), done.remote: Compressing objects: 100% (2000/2000), done.remote: Total 2301 (delta 561), reused 922 (delta 278), pack-reused 0Receiving objects: 100% (2301/2301), 30.60 MiB | 13.90 MiB/s, done.Resolving deltas: 100% (561/561), done.\n     It is possible that the last step will fail because of some dependency errors. In this case, you might want to run  pip install . --quiet one more time.\n     The TensorFlow Object Detection API is installed! You may now use the scripts that API provides for doing the model  inference,  training or  fine-tuning.\n  Let&#39;s download our selected  ssd_mobilenet_v2_fpnlite_640x640_coco17_tpu-8 model from the TensorFlow Model Zoo and check how it does the general object detection (detection of the objects of classes from COCO dataset like &#34;cat&#34;, &#34;dog&#34;, &#34;car&#34;, etc.).\n We will use the  get_file() TensorFlow helper to download the archived model from the URL and unpack it.\n import tensorflow  as tf import pathlibMODEL_NAME  =  &#39;ssd_mobilenet_v2_fpnlite_640x640_coco17_tpu-8&#39;TF_MODELS_BASE_PATH  =  &#39;http://download.tensorflow.org/models/object_detection/tf2/20200711/&#39;CACHE_FOLDER  =  &#39;./cache&#39; def  download_tf_model (model_name , cache_folder ) : model_url  = TF_MODELS_BASE_PATH  + model_name  +  &#39;.tar.gz&#39; model_dir  = tf .keras .utils .get_file ( fname =model_name , origin =model_url , untar = True , cache_dir =pathlib .Path (cache_folder ) .absolute ( )  )  return model_dir # Start the model download.model_dir  = download_tf_model (MODEL_NAME , CACHE_FOLDER ) print (model_dir )\n      The  pipeline.config file contains the detection settings of the model. We&#39;ll come back to this file later when we will need to fine-tune the model.\n  For now, the model can detect the object of  90 COCO dataset classes like a  car,  bird,  hot dog etc.\n   Let&#39;s see how the model performs on some general images that contain the objects of these classes.\n  Object Detection API already has a complete set of COCO labels (classes) defined for us.\n import os # Import Object Detection API helpers. from object_detection .utils  import label_map_util # Loads the COCO labels data (class names and indices relations). def  load_coco_labels ( ) :  # Object Detection API already has a complete set of COCO classes defined for us. label_map_path  = os .path .join (  &#39;models/research/object_detection/data&#39; ,  &#39;mscoco_complete_label_map.pbtxt&#39;  ) label_map  = label_map_util .load_labelmap (label_map_path )  # Class ID to Class Name mapping. categories  = label_map_util .convert_label_map_to_categories ( label_map , max_num_classes =label_map_util .get_max_label_map_index (label_map ) , use_display_name = True  ) category_index  = label_map_util .create_category_index (categories )  # Class Name to Class ID mapping. label_map_dict  = label_map_util .get_label_map_dict (label_map , use_display_name = True )  return category_index , label_map_dict # Load COCO labels.coco_category_index , coco_label_map_dict  = load_coco_labels ( ) print ( &#39;coco_category_index:&#39; , coco_category_index ) print ( &#39;coco_label_map_dict:&#39; , coco_label_map_dict )\n  coco_category_index:{ 1: {&#39;id&#39;: 1, &#39;name&#39;: &#39;person&#39;}, 2: {&#39;id&#39;: 2, &#39;name&#39;: &#39;bicycle&#39;}, ... 90: {&#39;id&#39;: 90, &#39;name&#39;: &#39;toothbrush&#39;},}coco_label_map_dict:{ &#39;background&#39;: 0, &#39;person&#39;: 1, &#39;bicycle&#39;: 2, &#39;car&#39;: 3, ... &#39;toothbrush&#39;: 90,}\n  We need to create a detection function that will use the pre-trained model we&#39;ve downloaded to do the object detection.\n import tensorflow  as tf # Import Object Detection API helpers. from object_detection .utils  import config_util from object_detection .builders  import model_builder # Generates the detection function for specific model and specific model&#39;s checkpoint def  detection_fn_from_checkpoint (config_path , checkpoint_path ) :  # Build the model. pipeline_config  = config_util .get_configs_from_pipeline_file (config_path ) model_config  = pipeline_config [ &#39;model&#39; ] model  = model_builder .build ( model_config =model_config , is_training = False ,  )  # Restore checkpoints. ckpt  = tf .compat .v2 .train .Checkpoint (model =model ) ckpt .restore (checkpoint_path ) .expect_partial ( )  # This is a function that will do the detection.  @tf .function  def  detect_fn (image ) : image , shapes  = model .preprocess (image ) prediction_dict  = model .predict (image , shapes ) detections  = model .postprocess (prediction_dict , shapes )  return detections , prediction_dict , tf .reshape (shapes ,  [ - 1 ] )  return detect_fninference_detect_fn  = detection_fn_from_checkpoint ( config_path =os .path .join ( &#39;cache&#39; ,  &#39;datasets&#39; , MODEL_NAME ,  &#39;pipeline.config&#39; ) , checkpoint_path =os .path .join ( &#39;cache&#39; ,  &#39;datasets&#39; , MODEL_NAME ,  &#39;checkpoint&#39; ,  &#39;ckpt-0&#39; ) , )\n      To do that let&#39;s save the image to the  inference/test/ folder of our project. If you&#39;re using Google Colab you may create this folder and upload the image manually.\n   import matplotlib .pyplot  as plt %matplotlib inline # Creating a TensorFlow dataset of just one image.inference_ds  = tf .keras .preprocessing .image_dataset_from_directory ( directory = &#39;inference&#39; , image_size = ( 640 ,  640 ) , batch_size = 1 , shuffle = False , label_mode = None ) # Numpy version of the dataset.inference_ds_numpy  =  list (inference_ds .as_numpy_iterator ( ) ) # You may preview the images in dataset like this.plt .figure (figsize = ( 14 ,  14 ) ) for i , image  in  enumerate (inference_ds_numpy ) : plt .subplot ( 2 ,  2 , i  +  1 ) plt .imshow (image [ 0 ] .astype ( &#34;uint8&#34; ) ) plt .axis ( &#34;off&#34; )plt .show ( )\n  Now we&#39;re ready to run the detection. The  inference_ds_numpy[0] array stores the pixel data for the first image in  Numpy format.\n   boxes  = detections [ &#39;detection_boxes&#39; ] .numpy ( )scores  = detections [ &#39;detection_scores&#39; ] .numpy ( )classes  = detections [ &#39;detection_classes&#39; ] .numpy ( )num_detections  = detections [ &#39;num_detections&#39; ] .numpy ( ) [ 0 ] print ( &#39;boxes.shape: &#39; , boxes .shape ) print ( &#39;scores.shape: &#39; , scores .shape ) print ( &#39;classes.shape: &#39; , classes .shape ) print ( &#39;num_detections:&#39; , num_detections )\n   The model has made a  100 detections for us. It doesn&#39;t mean that it found  100 objects on the image though. It means that the model has  100 slots, and it can detect  100 objects at max on a single image. Each detection has a score that represents the confidence of the model about it. The bounding boxes for each detection are stored in the  boxes array. The scores or confidences of the model about each detection are\n......", "posttime": "2021-08-09 04:59:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "打印,链接,printed,模型", "title": "尝试使打印的链接可点击", "title_en": "Attempt to make printed links clickable", "transed": 1, "url": "https://trekhleb.dev/blog/2020/printed-links-detection/", "via": "", "real_tags": ["打印", "链接", "printed", "模型"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072181, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Microsoft Windows 98/98 SP1/98 SE Shell Unchecked BufferArbitrary Code Execution SHELL32.DLL 4.72.3812.600 安全漏洞修复：直接下载 [834 KB，英文]。更多信息。 BUG：此SHELL32.DLL 修复破坏了从桌面快捷方式图标中删除恼人箭头的能力！修复：请参阅“PATCHED SHELL32.DLL BUG + FIX”，也在 TIPS98.TXT（W95-11D.EXE 的一部分）中了解完整的细节。", "note_en": "Microsoft Windows 98/98 SP1/98 SE Shell Unchecked BufferArbitrary Code Execution SHELL32.DLL 4.72.3812.600 Security Vulnerability Fix:  Direct download [834 KB,English].  More info.   BUG: ThisSHELL32.DLL fix breaks the ability of removing annoying arrows from Desktop shortcut icons!  FIX:See &#34; PATCHED SHELL32.DLL BUG + FIX&#34;, also in TIPS98.TXT (part of  W95-11D.EXE), for complete details.", "posttime": "2021-08-09 04:58:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,windows,免费,free,修复", "title": "MDGx 免费 Windows 软件精华", "title_en": "MDGx Free WinDOwS Software Essentials", "transed": 1, "url": "https://web.archive.org/web/20210723001556/http://www.mdgx.com/web.htm", "via": "", "real_tags": ["软件", "windows", "免费", "free", "修复"]}, {"category": "", "categoryclass": "", "imagename": "5008ae44d7cdb4cb32b734f11e026b4e.jpg", "infoid": 1072179, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "底特律历来是美国连接最少的城市之一，大约 40% 的底特律居民根本没有任何家庭互联网接入。然而，事情正在发生变化，这在很大程度上要归功于公平互联网倡议 (EII) 等项目，这是底特律社区技术项目和社区组织网络之间的合作。 EII 有一个雄心勃勃的目标：通过为底特律服务欠缺的社区建设低成本、高速的互联网来加强社区，提高数字素养，并培训居民成为“数字管家”。排除万难，他们取得了成功。在过去的六年中，EII 在底特律的大片土地上建立并维护了令人印象深刻的互联网网络，培训来自社区的数字管理员设置和安装无线接入点、光纤连接和热点，并教育居民如何安全有效地使用互联网。 COVID-19 的冲击以及随后在全国范围内的封锁加剧了数十年来普遍存在的问题：数字鸿沟。当许多美国人登录 Zoom 开展业务、与家人聊天和观看 Netflix 时，数以百万计的人处于离线状态，无法连接，努力寻找有关 COVID-19 的信息、安排疫苗预约和申请失业。这就是数字鸿沟：拥有数字连接的人和没有数字连接的人之间的差距。这种差异在有色人种社区以及低收入社区中尤为明显。根据底特律西南部 Grace in Action 网络经理 Nyasia Valdez 的说法，底特律数字鸿沟背后的一个问题是居民的负担能力。 “在西南的某些地区，只有一个互联网提供商，而在其他地区则有三四个。因此，如果他们唯一的选择是每月 100 美元，那么这就是他们必须支付的费用。”公平互联网倡议服务的领域主要是有色人种社区，EII 培训和雇用的数字管理员来自这些社区。 “让社区成员成为技术人员比让技术人员成为社区成员更容易，”数字管家 Shiva Shahmir 表示。管理员帮助安装和维护 EII 的高速网络，该网络是无线的、点对点的并提供 25mbps 的上下速度。它利用来自企业 ISP 的 123Net 捐赠的连接，从底特律最高点文艺复兴中心的顶部向三个主要组织合作伙伴传送千兆连接：Grace in Action、Church of the Messiah 和 North End Woodward社区联盟。从那里，管理员创建无线分配网络到社区中心，然后到住宅。\n现在，EII 正在制定未来的弹性计划。首先是太阳能充电站，它建在底特律周围，提供免费的高速互联网接入以及设备充电。 EII 还开发了便携式网络套件，这些套件是电池供电的机箱，可向半径四个街区提供无线信号，可在网络中断的情况下使用。最后，EII 正在开发一个内部网，一个用于离线且仅通过其网络进行通信的系统。这允许人们私下和离线交流。 “执法机构经常问我，他们能否成为我们网络的一部分，”EII 项目经理沃利吉尔伯特牧师说。 “我说不，我们保证用户对我们网络的隐私，我们不做任何数据收集。我们希望社区在交流时感到安全。” “获取信息就像自由。每当为了资本主义而受到限制或限制时，它就是压迫的象征，因为人们无法下定决心，”沙米尔说。 “当他们没有这些信息时，他们真的可以为自己做出最好的决定吗？”", "note_en": "Detroit has historically been one of the least connected cities in America, with about 40 percent of Detroit residents lacking any home internet access at all. Things are changing, though, thanks in large part to projects like the Equitable Internet Initiative (EII), a collaboration between the Detroit Community Technology Project and a network of community organizations.\n EII has an ambitious goal: to strengthen neighborhoods by building low-cost, high-speed internet for the underserved communities of Detroit, to increase digital literacy, and to train residents to be “digital stewards.” And against all odds, they are succeeding.\n Over the past six years, EII has built and maintained an impressive internet network across large swaths of Detroit, training digital stewards from the community to set up and install wireless access points, fiber hookups and hotspots, and educating residents on how to safely and effectively use the internet.\n The onslaught of COVID-19 and the subsequent lockdowns around the country exacerbated an issue that has been pervasive for decades: the digital divide. As many Americans logged into Zoom to conduct business, chat with their family and watch Netflix, millions of others were offline and disconnected, struggling to find information about COVID-19, schedule vaccine appointments and apply for unemployment. This is the digital divide: the gap between those who have digital connectivity, and those who do not. This disparity is especially pronounced in communities of color, as well as low income communities.\n According to Nyasia Valdez, network manager for Grace in Action in Southwest Detroit, one issue behind the digital divide in Detroit is affordability for residents. “In some areas of Southwest, there is only one internet provider, versus in other areas where there are three or four. So if their only option is $100 a month, then that’s what they have to pay.”\n The areas that the Equitable Internet Initiative serves are predominantly communities of color, and the digital stewards that EII train and employ come from these communities. “It’s easier to make a community member a technician than a technician a community member,” according to digital steward Shiva Shahmir.\n The stewards help install and maintain EII’s high speed network, which is wireless, point-to-point and provides a 25mbps up and down speed. It utilizes donated connections from 123Net, an enterprise ISP, who beams a gigabit connection from the top of the Renaissance Center, the highest point in Detroit, to the three anchor organization partners: Grace in Action, Church of the Messiah, and North End Woodward Community Coalition. From there, the stewards create wireless distribution networks to community hubs, and then to residential homes.\n Now, EII is working on resilience plans for the future. First are solar charging stations, which are set up around Detroit and provide free, high speed internet access, as well as device-charging.\n EII is also creating portable network kits, which are battery-powered cases that provide wireless signal to a four block radius, and can be used in situations where there is a network outage.\n Finally, EII is developing an intranet, a system for communicating offline and solely via their network. This allows people to communicate privately and offline. “Law enforcement agencies are often asking me, can they become a part of our network,” says the Rev. Wally Gilbert, project manager for EII. “I say no, we guarantee the users of our network privacy, we don’t do any data collection. We want the community to feel safe communicating.”\n “Access to information is like liberty. Whenever that is restricted or limited for the sake of capitalism, it’s so symbolic of oppression because people can’t make up their own minds,” says Shahmir. “When they don’t have that information, can they really make the best decisions for themselves?”", "posttime": "2021-08-09 04:58:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "居民,residents,社区", "title": "底特律居民如何建立自己的互联网", "title_en": "How Detroit residents are building their own internet", "transed": 1, "url": "https://thehill.com/changing-america/video/555961-how-detroit-residents-are-building-their-own-internet", "via": "", "real_tags": ["居民", "residents", "社区"]}]