[{"category": "", "categoryclass": "", "imagename": "54c0552ac11105775d05e5c9f4f0c7f4.jpg", "infoid": 1034870, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "就在美国大选结束一周后，推特(Twitter)公布了其为误导性推文贴标签的一些努力的细目。该网站表示，从10月27日到11月11日，它将大约30万条推文标记为其公民诚信政策的一部分。这相当于这两周期间与选举相关的推文总数的0.2%左右。\n当然，并不是所有的Twitter警告都是一样的。其中只有456条包含警告，覆盖了文本和有限的用户参与度，禁止转发、回复和点赞。这一具体的警告确实在一定程度上导致了有限的参与，大约四分之三的人在看到推文时看到了模糊的文本(通过点击警告)。根据Twitter的数据，那些被贴上标签的推文减少了约29%。\n正如《纽约时报》指出的那样，特朗普在11月3日至6日期间发布的推文中，略多于三分之一受到了这样的警告，这让美国总统收到了不成比例的标签。选举的结束(我想，就选举实际上已经结束而言)似乎在一定程度上减缓了该网站的反应时间，尽管特朗普继续受到关注，因为他继续把大部分时间用在质疑几乎所有主要新闻机构证实的选举结果上。\n在特朗普重申对投票机制造商Dominion的指控之际，他的最新推文被贴上了有争议的标签，但并未被隐藏起来。法律、政策、信托和安全部门负责人维贾亚·加德和产品部门负责人凯文·贝克普尔写道：“我们也想非常清楚地表明，我们认为我们的工作还没有完成。”“我们在这里的工作还在继续，我们的团队正在学习和改进我们如何应对这些挑战。”\n2016年大选后，Twitter和其他社交媒体网站因其平台在传播虚假信息中所扮演的角色而受到严格审查。Twitter试图通过调整建议和转发，以及对违反其政策的推文单独贴上标签来解决这个问题。\n今天早些时候，YouTube为保留备受争议的选举相关视频的决定进行了辩护，指出：“和其他公司一样，我们允许播放这些视频，因为YT允许讨论选举结果和计票过程。”这些视频并没有以任何突出的方式出现或推荐。“", "note_en": "Just over a week after the U.S. elections,  Twitter   has  offered a breakdown of some of its efforts to label misleading tweets. The site says that from October 27 to November 11, it labeled some 300,000 tweets as part of its Civic Integrity Policy. That amounts to around 0.2% of the total number of election-related tweets sent during that two-week period.\n Of course, not all Twitter warnings are created equal. Only 456 of those included a warning that covered the text and limited user engagement, disabling retweets, replies and likes. That specific warning did go a ways toward limited engagement, with around three-fourths of those who encountered the tweets seeing the obscured texts (by clicking through the warning). Quote tweets for those so labeled decreased by around 29%, according to Twitter’s figures.\n The president of the United States received a disproportionate number of those labels, as  The New York Times notes that just over a third of Trump’s tweets between November 3 and 6 were hit with such a warning. The end of the election (insofar as the election has actually ended, I suppose) appears to have slowed the site’s response time somewhat, though Trump continues to get flagged, as he continues to devote a majority of his feed to disputing the election results confirmed by nearly every major news outlet.\n  His latest tweet as of this writing has been labeled disputed, but not hidden, as Trump repeats claims against voting machine maker, Dominion. “We also want to be very clear that we do not see our job as done,” Legal, Policy and Trust &amp; Safety Lead Vijaya Gadde and Product Lead Kayvon Beykpour wrote. “Our work here continues and our teams are learning and improving how we address these challenges.”\n  Twitter and other social media sites were subject to intense scrutiny following the 2016 election for the roles the platforms played in the spread of misinformation. Twitter sought to address the issue by tweaking recommendations and retweets, as well as individually labeling tweets that violate its policies.\n Earlier today,  YouTube defended  its decision to keep controversial election-related videos, noting, “Like other companies, we’re allowing these videos because discussion of election results &amp; the process of counting votes is allowed on YT. These videos are not being surfaced or recommended in any prominent way.”", "posttime": "2020-11-13 19:06:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,推特,大选,twitter,推文", "title": "\n推特贴上30万条美国大选推文的标签--约0.2%", "title_en": "\n\t\t\t\tTwitter labeled 300,000 US election tweets — around 0.2%\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/12/twitter-labeled-300000-us-election-tweets-around-0-2/", "via": "", "real_tags": ["美国", "推特", "大选", "twitter", "推文"]}, {"category": "", "categoryclass": "", "imagename": "b5c4485adeaef8c4c6de1a4e8f31f726.jpg", "infoid": 1034869, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这一更新于五个月前在WWDC上首次公布，其中包括一些设计上的变化，这些变化继续模糊了MacOS和iOS之间的界限。\n最大的新增功能之一是控制中心(Control Center)，这是iOS/iPadOS的一项功能，它在屏幕的右侧显示一个半透明的窗格。同时，Safari还增加了内置翻译等功能。应用程序的图标和声音也一直在更新。\n布莱恩·海特自6月以来一直在使用测试版，他总结道，Big Sur“对应用程序和整个系统进行了一些关键升级，但更重要的是，从苹果的角度来看，它为第一轮基于ARM的Mac奠定了基础，并继续朝着公司两个主要操作系统之间的统一迈进。”\nFacebook类似Snapchat的“消失模式”功能出现在Messenger和Instagram上，该功能旨在进行更随意的对话，允许用户设置聊天内容，在看到消息并关闭聊天后自动删除。\n亚马逊面临诉讼，指控其在疫情爆发期间未能向工人提供个人防护用品--这起集体诉讼指控亚马逊未能妥善保护其仓库工人，并违反了纽约市人权法的规定。\nMenlo Security宣布E系列投资1亿美元，估值为8亿美元-首席执行官兼联合创始人阿米尔·本-埃夫拉姆(Amir Ben-Efraim)告诉我们，这家初创公司仍然专注于网络和电子邮件作为主要攻击媒介。\nLivestorm为其基于浏览器的会议和网络研讨会平台筹集了3000万美元--但它纯粹是基于浏览器的，不需要演讲者或与会者安装任何软件。\nNana斥资600万美元创办了一个致力于家电维修的在线学院和市场--Nana经营着一个免费的学院，教人们如何修理家电，然后让他们可以选择成为其维修市场的一部分。\n订阅服务是金融科技的未来吗？-随着订阅成为一种越来越诱人的商业模式，金融科技公司将不得不考虑这一战略是否值得冒险。\n加州商业保密法在客户名单上的冲突造成了不确定性--在你跳槽或雇佣已经这样做的销售人员之前，先阅读这篇文章。\n随着公众投资者对edtech的押注重新定价，炙手可热的初创行业将面临什么？-在疫苗消息传出后抛售edtech(正如投资者所做的那样)，是在押注该行业的增长将受到回归正常的限制。\n(提醒：Extra Crunch是我们的会员计划，旨在使初创企业的信息大众化。您可以在这里注册。)。\n迪士尼+拥有逾7300万订户--包括一年前的今天推出的流媒体服务。\n欧莱雅在2018年收购了一家名为ModiFaces的增强现实滤镜公司后，又推出了一系列“虚拟化妆”--这是建立在欧莱雅2018年收购一家名为ModiFaces的增强现实滤镜公司的基础上的。\nThe Daily Crunch是TechCrunch对我们最重大、最重要的新闻的综合报道。如果你想在太平洋时间每天下午3点左右把它送到你的收件箱，你可以在这里订阅。", "note_en": "This update, which was first announced five months ago at WWDC, includes a number of design changes that continue to blur the line between macOS and iOS.\n  One of the big additions is the Control Center, an iOS/iPadOS feature that presents a translucent pane down the right side of the screen. Meanwhile, Safari added features like built-in translation. And app icons and sounds have been updated throughout.\n Brian Heater has been using the beta since June, and he concluded that Big Sur “boasts some key upgrades to apps and the system at large, but more importantly from Apple’s perspective, it lays the groundwork for the first round of Arm-powered Macs and continues its march toward a uniformity between the company’s two primary operating systems.”\n  Facebook’s Snapchat-like ‘Vanish Mode’ feature arrives on Messenger and Instagram — The feature, meant for more casual conversations, allows users to set chats to automatically delete after the message is seen and the chat is closed.\n Amazon faces lawsuit alleging failure to provide PPE to workers during pandemic — The class action suit alleges Amazon failed to properly protect its warehouse workers and violated elements of New York City’s human rights law.\n   Menlo Security announces $100M Series E on $800M valuation — CEO and co-founder Amir Ben-Efraim told us the startup remains focused on web and email as major attack vectors.\n Livestorm raises $30M for its browser-based meeting and webinar platform — It’s purely browser based, without requiring presenters or attendees to install any software.\n Nana nabs $6M for an online academy and marketplace dedicated to appliance repair — Nana runs a free academy to teach people how to fix appliances, then gives them the option to become a part of its repair marketplace.\n  Are subscription services the future of fintech? — As subscriptions become an increasingly alluring business model, fintechs will have to consider whether this strategy is worth the risk.\n Conflicts in California’s trade secret laws on customer lists create uncertainty — Read this before you jump ship or hire a salesperson who already has.\n As public investors reprice edtech bets, what’s ahead for the hot startup sector? — Selling edtech on the vaccine news (as investors did) was a bet that growth in the sector would be constrained by a return to normalcy.\n (Reminder: Extra Crunch is our membership program, which aims to democratize information about startups.  You can sign up here.)\n  Disney+ has more than 73M subscribers — The streaming service launched one year ago today.\n L’Oréal rolls out a line of ‘virtual makeup’ — This builds on L’Oréal’s 2018 acquisition of an augmented reality filter company called Modiface.\n The Daily Crunch is TechCrunch’s roundup of our biggest and most important stories. If you’d like to get this delivered to your inbox every day at around 3pm Pacific, you can  subscribe here.", "posttime": "2020-11-13 19:06:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,发布,苹果,crunch,功能", "title": "\n《每日新闻》：苹果发布MacOS Big Sur", "title_en": "\n\t\t\t\tDaily Crunch: Apple releases macOS Big Sur\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/12/daily-crunch-apple-releases-macos-big-sur/", "via": "", "real_tags": ["apple", "发布", "苹果", "crunch", "功能"]}, {"category": "", "categoryclass": "", "imagename": "b71c1b1b4b4807e307cb29ac49640d79.jpg", "infoid": 1034868, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周四上午，特朗普在推特上发帖称，选举舞弊是毫无根据的，他引用了右翼新闻机构OANN的数据，该媒体本身似乎在支持特朗普的Reddit抄袭thedonald.win的帖子中找到了自己的数据。(这条推文很快就被包装成了一条警告，内容存在争议。)。\n这位在网上发帖的匿名者声称，他将爱迪生研究公司(Edison Research)的数据与Dominion公司的数据进行了比较，得出的数字截然不同。爱迪生研究公司是一家从事出口民调和其他选举相关措施的公司。这些方法没有得到很好的解释，结果也没有得到很好的解释。目前还不清楚被比作什么和为什么，也不清楚据称实施欺诈的公司公开发布这起欺诈的原因。没有人以任何方式证实(如果这就是这么说的话)这一分析。\n爱迪生总裁拉里·罗辛(Larry Rosin)在接受PolitiFact采访时写道，“我们没有任何选民欺诈的证据”，而且爱迪生几乎不知道所谓的分析指的是什么。\n本周早些时候，多米尼恩引起了人们的注意，当时似乎是一个小故障导致一些选票登记给了当选总统乔·拜登(Joe Biden)，而不是特朗普。但错误的统计立即被发现，并被发现是人为错误的结果。该公司专门用了一个页面来打击围绕其软件的错误信息。\nPolitiFact将特朗普的言论评为“裤子着火”，称其为“荒谬的”。值得注意的是，这条推文甚至没有正确陈述所谓的欺诈数字。\n这种“分析”似乎没有任何可取之处，但它提供了一个很好的例子，说明那些不熟悉投票设备工作原理的人--也就是说，几乎所有没有直接参与的人--倾向于发现软件部分本质上是不值得信任的。\n然而，没有办法在选举后的几个小时或几天内清点、制表和核实数百万张选票，而这些选票不是严重依赖私人软件工具的，而且实际上是高度可靠和安全的。选举过程是两党合作的，并受到极其密切的监督。\n考虑到在大流行期间举行选举的困难，选举委员会和州领导层一致宣布选举出人意料地顺利，而且无论是当面还是通过邮件都有极高的投票率。\n美国网络安全和基础设施安全局下属的一个主要联邦委员会今天称上周的选举是“美国历史上最安全的一次…。没有证据表明任何投票系统删除或丢失了选票，改变了选票，或以任何方式受到了损害。我们可以向你们保证，我们对我们选举的安全和诚信有最大的信心，你们也应该这样做。“。\n尽管越来越少的政府高层人士提出指控，但没有证据表明上周的选举中存在任何重大的选民欺诈或其他违规行为，这导致前副总统、现任当选总统拜登(Joe Biden)获胜。", "note_en": "Tweeting Thursday morning about baseless claims of election fraud, Trump cited OANN, a right-wing news outlet, which itself seemed to have found its numbers in a thread on pro-Trump Reddit knock-off thedonald.win. (The tweet was quickly wrapped in a warning that the contents are disputed.)\n The anonymous person posting there claimed to have compared numbers from Edison Research, a company that does exit polls and other election-related measures, to those from Dominion, and come up with very different sums. The methods are not very well explained, nor are the results. It’s not really clear what is being compared to what and why, or for what reason this alleged fraud was published publicly by the company supposedly perpetrating it. No one has verified (if that’s the word) this analysis in any way.\n  In a comment to Politifact, Edison President Larry Rosin wrote that “we have no evidence of any voter fraud,” and that it pretty much has no idea what the purported analysis is referring to.\n  Dominion attracted attention earlier in the week when it seemed that a glitch had caused a number of votes to be registered for President-elect Joe Biden instead of Trump. But the miscount was immediately caught and found to be the result of human error. The company has  dedicated a page to combating the misinformation around its software.\n Politifact rated Trump’s claim “Pants on Fire,” calling it “ridiculous” for good measure. It’s worth noting that the tweet didn’t even state the numbers of the supposed fraud correctly.\n There doesn’t seem to be any merit to the “analysis” at all, but it provides an excellent example of how people who are unfamiliar with how the voting apparatus works — which is to say almost everyone not directly involved — tend to find the software portion inherently untrustworthy.\n Yet there is no way to count, tabulate and verify millions of ballots in hours or days after an election that does not rely heavily on private software tools, and it is in fact highly reliable and secure. The process of elections is bipartisan and extremely closely monitored.\n Elections commissioners and state leadership have been unanimous in declaring the election a surprisingly smooth one considering the difficulties of holding one during a pandemic and with extremely high turnout both in person and by mail.\n A major federal committee under the Cybersecurity and Infrastructure Security agency  today called last week’s election “the most secure in American history… There is no evidence that any voting system deleted or lost votes, changed votes, or was in any way compromised. We can assure you we have the utmost confidence in the security and integrity of our elections, and you should too.”\n Despite accusations from a dwindling number of highly placed individuals in the government, there has been no evidence presented that there was any significant voter fraud or other irregularities in last week’s election, which resulted in the victory of former vice president, now President-elect Joe Biden.", "posttime": "2020-11-13 19:06:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,强调,software,选举", "title": "\n特朗普强调可疑数据后，更多投票软件FUD持平", "title_en": "\n\t\t\t\tMore voting software FUD falls flat after Trump highlights dubious data\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/12/more-voting-software-fud-falls-flat-after-trump-highlights-dubious-data/", "via": "", "real_tags": ["软件", "强调", "software", "选举"]}, {"category": "", "categoryclass": "", "imagename": "a98622ee44f2ef187949225ea7d6a201.jpeg", "infoid": 1034866, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尽管如此，曾是金融科技500创业基金普通合伙人的谢尔·莫霍特和个人金融初创公司NerdWallet的联合创始人杰克·吉布森，还是对投资者对他们专注于金融科技的早期风险投资公司Better Tomorrow Ventures(简称BTV)的兴趣感到有点惊讶。\n该基金刚刚以7500万美元的资本承诺结束了其首只基金，超过了最初的6000万美元目标，就连他们最早的投资者之一、Cendana Capital的迈克尔·金(Michael Kim)也表示惊讶。“值得注意的是，他们在Covid期间筹集了大量资金，”Kim说。\n我们昨天采访了这两个人，他们已经用这笔基金的资金投资了13家初创公司，他们说，他们领导了其中的9笔交易。\nTC：好消息是你现在关注的是金融科技。坏消息是，金融科技的估值正在飙升。你是如何竞争的？\nSM：这是真的。每个人都认为，我们一直在谈论的事情也符合他们的信仰，在像格子花纹和信用因果报应这样的退出之后。大家都成了金融科技的投资人。你说得对，这导致了估值的上升。不过，从某种程度上来说，这是件好事。这意味着我们的一家公司已经有了相当大的加价，部分原因就是这一现象。\n我还认为，我们发现我们能够以更优惠的价格赢得交易，因为我们都是创始人。[Mohnot将一家名为FeeFinders的公司卖给了Groupon 2012]。而我们所做的就是金融科技。因此，我们往往比多面手投资者更了解创始人在建设什么。\nJG：我确实认为(这些事情)引起了共鸣，因为我们能够支付我们认为合理的价格，并获得我们想要的所有权。这不是其他公司正在玩的4赔16的游戏(风投们以投资前估值投资400万美元，因此拥有公司20%的股份)。我认为，除了一两项投资外，我们所有的投资都涉及重复创始人，他们看到了与我们这样的合作伙伴合作的价值。\nTC：如果某些公司开始获得吸引力，你会转向(特殊目的载体)来维持持股吗？\nJG：是的，我过去做过相当多的SPV。作为天使投资人，我已经投资了90家公司，我认为，在BTV问世之前的五年里，我们两人之间可能已经投入了超过4000万美元，包括在天使投资之外的SPV。[编者按：之前的交易包括Chipper Cash、Albert、Clear Cover和河马。]。\nSM：没有人再宣布他们的种子轮了。当我创办我的公司时，我想要尽可能多的报道。我认为这对公司来说是件好事。现在创始人们不这么认为了，很少有人想要宣布这一消息。\nTC：但招募和关注后期投资者也是有好处的。为什么要完全避开它呢？\nJG：某种程度上的竞争。他们不想让人们知道他们在做什么，因为一旦你看到一轮竞争激烈的种子期，你就会看到很多其他初创公司也在做同样的事情。我还认为，宣布这一消息不再有太大的好处，所以当你看到大多数创始人的种子融资时，这是因为他们即将提高自己的首轮融资。你在Pitchbook上看到的数据通常是六个月后才会公布的。\nSM：我们有金融科技独角兽的创始人。我们有几只金融科技风投基金、几家后期基金专注于金融科技的全科医生、几家保险公司，还有一些华尔街人士，他们也帮助我们跟踪这方面的市场。\nJG：我们还得到了一些名流基金的支持：Cendana、Industry Ventures、Vintage[Investment Partners]、景顺(Invesco)。\nTC：在大流行关闭一切之前，你认识很多这样的投资者吗？\nJG：有一些，但我们不得不在Zoom上低价卖出很多。去年12月，我们举行了第一次交易--资本来自Cendana和个人。那时，我们已经开始与其他机构进行谈判，但每个人都表示，这需要一段时间，在你筹集第二笔资金之前，机构是不会来的，所以我们对吸引很多机构加入并不抱太大希望。\n事实上，当3月和4月来临时，我们认为我们必须募集一只规模较小的基金。但后来一切重新开始，人们重新开始工作，我们能够关闭与我们开始对话的机构。然后，人们突然冒了出来，因为科技行业迅速火爆起来，尤其是金融科技，有大量的首次公开募股(IPO)和并购活动。这些人说，我们现在想要金融科技的敞口，我们想投资一只专注于金融科技的基金，而你是镇上唯一的玩家。\nJG：我们的主题是一切都是金融科技，所以我们全面投资：支付、贷款、银行、房地产、保险、B2B、消费者-任何表面上是金融科技的东西。我们认为，随着越来越多的科技平台进入金融服务业，许多今天不是典型的金融科技的公司以后会看起来像金融科技。我们在种子前和种子阶段进行投资，但也会在创意阶段与创始人会面，有时会说服他们不要创办另一家新银行。[笑]。\nTC：是吗？每次我想知道这个世界上有多少新银行是有意义的，一位投资者告诉我，只要他们的初创公司能获得0.00001%的市场份额，他们手中就会有一家数十亿美元的公司。\nJG：没有。大多数人永远也想不出如何盈利。许多投资者喜欢辩称，有了新银行，你在每笔交易中都会赔钱，但你会在交易量上弥补损失。然而，很少有人能找到一条通往正向经济学的道路。你需要巨大的规模才能实现盈利，这意味着你必须在营销上投入大量风险资本。更重要的是，很多人瞄准的是已经被传统金融产品过度服务的受众。\nSM：同样的道理也适用于“X格子”类型的公司。在宣布了Playe的退出--或者说我们都认为是Playe的退出--之后，我们考察了五家公司，其中许多公司都有同样的想法，并为同样的客户展开了较量。\nTC：美国司法部以Visa的垄断权为由，起诉阻止Playy出售给Visa，这一事实会不会产生寒蝉效应？\nJG：我们还没有看到这一点。很多人对这种抱怨不屑一顾，认为它最终会通过SPAC解决这个问题。这家公司的营收超过1亿美元，考虑到这些业务的交易领域，Playy可能会上市，并看到一个令人惊叹的成功结果。\n顺便说一句，这不仅仅是格子呢。现在有40个专门关注金融科技的SPAC。只要想想未来两年必须发生的结果就知道了。", "note_en": "Still, Sheel Mohnot, who was formerly a general partner at the fintech fund of 500 Startups, and Jake Gibson, co-founder of personal finance startup NerdWallet, were a little taken aback by investor interest in their fintech-focused early-stage venture firm,  Better Tomorrow Ventures, or BTV.\n The outfit just closed its debut fund with $75 million in capital commitments, exceeding their original $60 million target, and even one of their earliest investors, Michael Kim of Cendana Capital, expresses surprise. “Remarkably, they raised a lot of it during Covid,” says Kim.\n  We talked yesterday with the pair, who have already invested in 13 startups with the fund’s capital and, they say, led nine of those deals.\n TC: The good news is you’re focused on fintech. The bad news is that fintech valuations are going through the roof. How do you compete?\n SM: It’s true. Everybody decided that what we’ve been talking about all along is in line with their beliefs too, after exits like  Plaid and  Credit Karma. Everybody became a fintech investor. And you’re right that that has led to an increase in valuations. To some extent that’s good, though. It’s meant that one of our companies has already had a pretty massive markup in part because of this phenomenon.\n I also think we’re finding we’re able to win deals at better prices because we’re both founders. [Mohnot sold a company, FeeFinders, to Groupon 2012]. And all we do is fintech. So we tend to understand better what founders are building than generalist investors.\n JG: I do think [these things] resonate in that we’ve been able to pay prices that we think make sense and to get the ownership we want. This isn’t the 4 on 16 game that others are playing (where VCs invest $4 million at a pre-money valuation and so own 20% of the company). I think all but one or two of our investments involve repeat founders who see the value of working with partners like us.\n   TC: And will you turn to [special purpose vehicles] to maintain your stake if certain companies begin to gain traction?\n JG: Yes, I’ve done quite a bit of SPVs in the past. I’ve invested in 90 companies as an angel investor and I think we’ve probably deployed more than $40 million between the two of us over the last five years leading up to BTV, including SPVs on top of angel investments. [Editor’s note: some of those earlier deals include  Chipper Cash,  Albert,  Clear Cover, and  Hippo.]\n    SM: Nobody announces their seed rounds anymore. When I started my company, I wanted as much coverage as possible. I thought that was great for the company. Now founders don’t feel that way, with very few wanting to announce.\n TC: But there are benefits to recruiting and getting on the radar or later-stage investors. Why eschew it altogether?\n JG: Competition to some extent. They don’t want people to know what they’re working on because once you see a competitive seed round, you see a lot of other startups pop up to do the same thing. I also just think there’s not as much upside anymore to announcing, so most founders, when you’re seeing their seed round, it’s because they’re about to raise their Series A. The data you’re seeing in Pitchbook is typically six months [behind].\n  SM: We have founders of fintech unicorns. We have a couple of fintech venture funds, fintech-focused GPs from later-stage funds, a few insurance companies, and Wall Street people who help us keep track on that side of the market, as well.\n JG: We’re also backed by kind of a who’s who of fund of funds that back emerging managers: Cendana, Industry Ventures, Vintage [Investment Partners], Invesco.\n TC: Did you know a lot of these investors before the pandemic shut down everything?\n JG: Some, but we had to sell a lot of them cold over Zoom. We held a first close last December — that capital was from Cendana and individuals. We’d started conversations with other institutions at that point but everyone said it would take a while and that institutions won’t come until you raise your second fund, so we didn’t have high hopes that we’d get a lot of them on board.\n In fact, when March and April hit, we figured we’d have to raise a smaller fund. But then things re-opened, people got back to work, and we were able to close institutions we’d started conversations with. Then people came out of the woodwork, because tech got hot fast but especially fintech, with all the IPO and M&amp;A activity.  People said, ‘We want fintech exposure  now, and we want to invest in a fintech-focused fund, and you’re the only game in town.’\n  JG: Our thesis is that everything is fintech, so we invest across the board: payments, lending, banking, real estate, insurance, b2b, consumer — anything that’s ostensibly fintech. We think a lot of companies that aren’t typically fintech today will look like fintech later, with more and more tech platforms that get into financial services. We’re investing at the pre-seed and seed stage but also meeting with founders at the idea stage, sometimes to talk them out of starting another neobank. [Laughs.]\n TC: Do you? Every time I wonder how many neobanks make sense in this world, an investor tells me that if only their startup can get .00001% of the market, they’ll have a multibillion company on their hands.\n JG: No. Most will never figure out how to get profitable. A lot of investors like to argue that with neobanks, you lose money on every trade but you make it up in volume. Yet very few have a path to getting to positive economics. You need huge scale to get to profitability, and that means you have to spend a ton of venture capital on marketing. More, a lot are going after audiences that are already over-served by traditional financial products.\n SM: The same is true for “Plaid for X” type companies. After the announcement of Plaid’s exit — or what we all  thought was Plaid’s exit — we looked at five companies, many of them hitting on the same ideas and duking it out for the same customers.\n TC: Will the fact that the DOJ is suing to block Plaid’s sale to Visa, citing Visa’s monopoly power, have a chilling effect?\n JG: We haven’t seen that. A lot of people are discounting that complaint and thinking it will get out of this in the end via SPAC. The company was doing north of $100 million in revenue, and given where these businesses trade, Plaid could go public and see an amazingly successful outcome.\n It’s not just Plaid, by the way. There are now 40 SPACs that are focused on fintech alone. Just think about the outcomes that have to happen in the next two years.", "posttime": "2020-11-13 19:05:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "金融,debut", "title": "\n这家专注于金融科技的风投公司刚刚完成了一只7,500万美元的首只基金；投资人“突然冒了出来”。", "title_en": "\n\t\t\t\tThis fintech-focused VC firm just closed a $75 million debut fund; backers “came out of the woodwork”\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/12/this-fintech-focused-vc-firm-just-closed-a-75-million-debut-fund-backers-came-out-of-the-woodwork/", "via": "", "real_tags": ["金融", "debut"]}, {"category": "", "categoryclass": "", "imagename": "f693d8845006fceb55cc9ac22a7bb516.jpg", "infoid": 1034865, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "已经有很多关于Hero 9的评论了，所以我想做一些不同的事情。我决定在我1970年的Chevelle上拥抱转弯的同时，测试一下GoPro的最新款。\n我最近把它的自动变速器换成了Tremec Magnum 6速手动变速器，以便做一件我以前从未做过的事情：与我的减速档相匹配。换句话说，我想要一个平稳的旅程。还有什么比用Hero 9记录我的进度更好的方式来监控我的进度呢？\n这款相机的特点是前置屏幕，可拆卸镜头盖，网络摄像头和流媒体功能，Hypersmooth 3.0，以及最长30秒的预录后视功能。GoPro赠送了宙斯迷你，我很高兴他们这么做了。\n可充电LED灯在一级亮度下的总运行时间为6小时。总共有四个级别，最大为2000流明。它防水高达33英尺，有一个360度旋转的夹子，也是有磁性的。还有一个闪光灯模式，用于紧急信号或聚会。作为一名视频制作人，我总是可以使用不同类型的光源。\n多亏了这段视频，安装宙斯迷你车变得又快又简单。它很好地照亮了我的踏板。我把亮度调到了4级，试图与从窗户进来的光线相匹配。我不得不说，灯光的实用性给我留下了非常深刻的印象。它不仅可以安装在媒体模型的冰冷的鞋子上，你还可以把它夹在你的帽子上露营，或者点亮遮光罩下面隐藏在光线下的一部分。这很方便。\n我试着把英雄9装在几个地方以捕捉道路，同时在同一帧中换挡--一个戴着头盔，另一个戴在我的胸口上。两个人都不能很好地捕捉到这两种情况，但胸部的坐姿绝对比我头上的要好。我还安装了大疆的竞争对手Osmo Action，作为一个b-cam进行比较。\n我用库存设置拍摄了两台相机。与Osmo相比，Hero 9的阴影噪音更少，色彩更鲜艳，对比度更高。我喜欢把我的大部分作品拍成平面图，所以我可以选择创造我想要的外观，而不是烘焙它，但在这种情况下，我真的不介意保留GoPro的传统外观。\n看着你的车以5000公里的速度疾驰而过，听着你的排气音符呼啸而过，这也是一件令人惊叹的事情。英雄9的音质也比Osmo好得多，特别是在较低的频率下。大疆的相机似乎有一个高通滤光片或额外的风滤镜，即使在可选的风噪降噪功能已经关闭的情况下也是如此。Hero 9也有一些明显的风噪过滤功能，但它看起来并不像是侵入性的。\n关于Hero9，我不喜欢的一个地方是两个屏幕同时打开。我知道很多人喜欢这个功能，我明白为什么它会有用，但我只是认为你应该能够独立地关闭和打开它们。也许是双击模式按钮或其他什么，因为，你知道，电池续航时间。\n电池在Hero 8的基础上有所改进，但当与Osmo并排录制进行连续录制时，Hero 9在Osmo还在50%左右的时候就耗尽了。\n另一种批评是：超级平滑实际上工作得太好了。从后面并排看，英雄9在转弯时从左或右漂移，以保持平稳，而奥斯莫漂移了一些，但设法保持了大部分的冲刺在画面内。\n这两款摄像头都有一个常见的功能，那就是前置触摸屏。但增加这一功能很可能意味着进一步增加整体尺寸。\n看着自己的速度匹配5k绝对是有帮助的，我变得更好只是个时间问题。英雄9是对前几代的重大改进。如果你有一部Hero8，而且不需要前置屏幕、5k或可拆卸镜头，那么你可能就不需要升级了。对我来说，英雄9不是动作摄像头的灵丹妙药，但对我的收藏来说是一个受欢迎的补充。", "note_en": "There are plenty of reviews out there for  the Hero 9 already, so I wanted to do something a little different. I decided to put GoPro’s latest to the test while hugging turns in my 1970 Chevelle.\n I recently swapped the automatic transmission in it for a Tremec Magnum 6-speed manual in order to do something I’ve never done before: rev-match my downshifts. In other words, I wanted a smooth ride. And what better way to monitor my progress than record it with the Hero 9?\n  The camera features a front-facing screen, removable lens cap, webcam and streaming capabilities, Hypersmooth 3.0, and Hindsight with up to 30 seconds of pre-recording.  GoPro   threw in the Zeus Mini, and I’m glad they did.\n The rechargeable LED light has a 6-hour total runtime at level one brightness. There are four levels in all, at a max of 2000 lumens. It’s waterproof up to 33 feet and has a 360 rotating clip that’s also magnetic. There’s also a strobe mode for emergency signaling or partying. As a video producer I can always use different types of light sources.\n  Mounting the Zeus Mini was quick and simple thanks to the clip. It lit my pedals well. I set the brightness on level four to try and match the light coming in from the windows. I have to say I’m very impressed with the utility of the light. Not only can it mount onto the cold shoe of a media mod, you can clip it on your hat for camping, or light up a section under the hood that’s tucked away from light. It’s handy.\n I tried mounting the Hero 9 a couple of places to capture the road, as well as my shifting in the same frame – one with a head mount and the other on my chest. Neither one could capture both really well, but the chest mount was definitely better than on my head. I also mounted DJI’s competitor, the  Osmo Action, as a b-cam to cut between for comparison.\n I shot both cameras with stock settings. Of the two, the Hero 9 generally had less noise in the shadows, more vibrant colors and a high-contrast image quality compared to the Osmo. I like to shoot most of my work flat so I have the option to create the look that I want instead of having it baked in, but in this case I really didn’t mind having that stock GoPro look.\n  Seeing your ride blast down the road in 5k is awesome and hearing your exhaust note roaring by can be just as good. The sound quality is also much better on the Hero 9 than the the Osmo, especially at lower frequencies. DJI’s camera seemed to have a high pass filter or additional wind filtering baked in even when the optional wind noise reduction was already turned off. The Hero 9 also has some wind noise filtering that was noticeable but it didn’t seem as intrusive.\n One tjomg I didn’t like about the Hero 9 is how both screens are simultaneously on. I know a lot of folks love this feature, and I see why it can be useful, but I just think you should be able to turn them off and on independently. Maybe a double tap on the mode button or something, because, you know, battery life.\n The battery is improved from the Hero 8, but when recording side-by-side with the Osmo for continuous recording, the Hero 9 depleted when the Osmo was still around 50%.\n  Another critique: the hypersmooth actually worked  too well. A side-by-side from the rear shows the Hero 9 drift from left or right in the turns to keep things smooth, whereas the Osmo drifted some but managed to keep most of the dash in frame.\n A common nice-to-have feature on either action cam would be a front touch screen. But adding that functionality would likely mean increasing the overall size even more.\n Watching myself rev matching in 5k is definitely helpful and it’s only a matter of time before I get better. The Hero 9 is a significant improvement on previous generations. If you own a Hero 8 and don’t have a need for a front facing screen, 5k, or a removable lens then you probably don’t need to upgrade. For me, the Hero 9 isn’t the silver bullet of action cams but is a welcome addition to my collection.", "posttime": "2020-11-13 19:05:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "gopro,hero,功能", "title": "\n使用GoPro Hero 9 Black和Zeus Mini提高我的手动驾驶技能", "title_en": "\n\t\t\t\tUsing the GoPro Hero 9 Black and Zeus Mini to improve my manual driving skills\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/13/using-the-gopro-hero-9-black-and-zeus-mini-to-improve-my-manual-driving-skills/", "via": "", "real_tags": ["gopro", "hero", "功能"]}, {"category": "", "categoryclass": "", "imagename": "e7fa5354adf22d376651e5278acff558.jpg", "infoid": 1034864, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据周四发布的一项有争议的模型研究，即使人类明天停止排放温室气体，未来几个世纪地球仍将变暖，海平面将上升数米。挪威研究人员在《自然·科学报告》杂志上报道，全球变暖的自然驱动力--更多吸热的云层、融化的永冻土和不断缩小的海冰--已经由碳污染引发，它们将呈现出自己的势头。\n主要作者、BI挪威商学院气候战略荣休教授约尔根·兰德斯告诉法新社，根据我们的模型，在将温室气体减排作为单一工具来阻止永久冻土融化方面，人类已经走到了无可挽回的地步。\n如果我们想要阻止这一融化过程，我们必须做一些额外的事情--例如，从大气中吸收二氧化碳并将其储存在地下，让地球表面更加明亮。\n利用简化的气候模型，兰德斯和他的同事乌尔里希·戈卢克(Ulrich Goluke)预测了两种情况下到2500年的变化：立即停止排放，以及到2100年逐步将全球变暖气体减少到零。\n在一个碳污染随着拨动开关而停止的想象世界里，地球在接下来的50年里变暖，比工业化前的水平高出约2.3摄氏度--比2015年《巴黎协定》(Paris Agreement)设定的目标高出大约0.5摄氏度--之后略有降温。\n今天的地球表面比19世纪中叶的温度高1.2摄氏度，当时气温开始上升。\n但从2150年开始，这个模型让地球再次开始逐渐变暖，在接下来的350年里，平均气温又上升了一个摄氏度，海平面上升了至少3米。\n在第二种情况下，地球升温到会以更快的速度撕裂文明结构的水平，但到2500年，最终会达到大致相同的水平。\n一项核心发现--受到顶尖气候科学家的质疑--是，地球气候系统的几个临界点(即临界点)已经被越过，引发了一个自我延续的变暖过程，就像过去数百万年发生的那样。\n自20世纪末以来，数百万平方公里的冰雪--将太阳辐射力的80%反射回太空--在夏季被开阔的海洋所取代，而开阔的海洋吸收了同样比例的能量。\n另一个来源是永久冻土的融化，它含有的碳是大气中碳含量的两倍。第三是水蒸气的增加，这也有变暖的作用。\n六位顶尖的气候科学家对这项研究--作者承认这是一项概念性的--的反应截然不同，一些人表示，这一发现值得后续研究，另一些人则立即予以拒绝。\n这里使用的模型是...。埃克塞特大学(University Of Exeter)气候影响研究负责人理查德·贝茨(Richard Betts)表示，这并不能被证明是真实气候系统的可信代表。\n伦敦大学学院(University College London)气候学教授马克·马斯林(Mark Maslin)也指出了这种名为ESCIMO的模型的缺陷，他将这项研究描述为一项思维实验。\n这项研究确实引起了人们的注意，那就是到2050年将全球碳排放降至零--这是联合国倡导并得到越来越多国家支持的目标--只是我们应对气候变化行动的开始。\n即使是在联合国科学咨询机构--政府间气候变化专门委员会(IPCC)的预测中使用的更复杂的模型也表明，除非从大气中去除大量二氧化碳，否则巴黎气候协议的温度目标是无法实现的。\n要做到这一点，一种方法是种植数十亿棵树。实验技术表明，从空气中吸收二氧化碳是可以机械完成的，但到目前为止还没有达到所需的规模。更多信息：《科学报告》(2020)称，一个地球系统模型显示，即使所有人为温室气体排放在2020年停止，永久冻土也会自我融化。网址：10.1038/s41598-020-75481-z，网址：www.nature.com/ws/s41598-020-75481-z", "note_en": "Even if humanity stopped emitting greenhouse gases tomorrow, Earth will warm for centuries to come and oceans will rise by metres, according to a controversial modelling study published Thursday.    Natural drivers of global warming—more heat-trapping clouds, thawing permafrost, and shrinking sea ice—already set in motion by carbon pollution will take on their own momentum, researchers from Norway reported in the Nature journal  Scientific Reports.\n  &#34;According to our models, humanity is beyond the point-of-no-return when it comes to halting the melting of permafrost using greenhouse gas cuts as the single tool,&#34; lead author Jorgen Randers, a professor emeritus of climate strategy at the BI Norwegian Business School, told AFP.\n  &#34;If we want to stop this melting process we must do something in addition—for example, suck CO 2 out of the atmosphere and store it underground, and make Earth&#39;s surface brighter.&#34;\n  Using a stripped-down climate model, Randers and colleague Ulrich Goluke projected changes out to the year 2500 under two scenarios: the instant cessation of emissions, and the gradual reduction of planet warming gases to zero by 2100.\n  In an imaginary world where carbon pollution stops with a flip of the switch, the planet warms over the next 50 years to about 2.3 degrees Celsius above pre-industrial levels—roughly half-a-degree above the target set in the 2015 Paris Agreement—and cools slightly after that.\n  Earth&#39;s surface today is 1.2C hotter than it was in the mid-19th century, when temperatures began to rise.\n  But starting in 2150, the model has the planet beginning to gradually warm again, with average temperatures climbing another degree over the following 350 years, and sea levels going up by at least three metres.\n  Under the second scenario, Earth heats up to levels that would tear at the fabric of civilisation far more quickly, but ends up at roughly the same point by 2500.\n    The core finding—contested by leading climate scientists—is that several thresholds, or &#34;tipping points&#34;, in Earth&#39;s climate system have already been crossed, triggering a self-perpetuating process of warming, as has happened millions of years in the past.\n    Since the late 20th century, millions of square kilometres of snow and ice—which reflects about 80 percent of the Sun&#39;s radiative force back into space—have been replaced in summer by open ocean, which absorbs the same percentage instead.\n  Another source is the thawing of permafrost, which holds twice as much carbon as there is in the atmosphere. The third is increasing amounts of water vapour, which also has a warming effect.\n  Reactions from half-a-dozen leading climate scientists to the study—which the authors acknowledge is schematic—varied sharply, with some saying the findings merit follow-up research, and others rejecting it out of hand.\n  &#34;The model used here is ... not shown to be a credible representation of the real climate system,&#34; said Richard Betts, head of climate impacts research at the University of Exeter.\n    Mark Maslin, a professor of climatology at University College London, also pointed to shortcomings in the model, known as ESCIMO, describing the study as a &#34;thought experiment.&#34;\n  &#34;What the study does draw attention to is that reducing global carbon emissions to zero by 2050&#34;—a goal championed by the UN and embraced by a growing number of countries—&#34;is just the start of our actions to deal with climate change.&#34;\n  Even the more sophisticated models used in the projections of the UN&#39;s scientific advisory body, the IPCC, show that the Paris climate pact temperature goals cannot be reached unless massive amounts of CO 2 are removed from the atmosphere.\n  One way to do that is planting billions of trees. Experimental technologies have shown that sucking CO 2 out of the air can be done mechanically, but so far not at the scale required.        More information:\t\t\t\t\t\t\t\t\t\t\t\tAn earth system model shows self-sustained melting of permafrost even if all man-made GHG emissions stop in 2020,  Scientific Reports (2020).  DOI: 10.1038/s41598-020-75481-z ,  www.nature.com/articles/s41598-020-75481-z", "posttime": "2020-11-13 19:05:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "全球,gas,模型", "title": "研究称，停止温室气体排放可能无法阻止全球变暖", "title_en": "Ending Greenhouse Gas Emissions May Not Stop Global Warming, Study Says", "transed": 1, "url": "https://phys.org/news/2020-11-greenhouse-gas-emissions-global.html", "via": "", "real_tags": ["全球", "gas", "模型"]}, {"category": "", "categoryclass": "", "imagename": "e401f9f7b7cd3ed0d6260e1af5387313.jpg", "infoid": 1034862, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "贝宝(PayPal)表示，将取消密码服务等待名单，并向所有符合条件的美国用户开放此类服务。", "note_en": "PayPal said it's doing away with its crypto services wait list and opening up such services to all eligible U.S. users.", "posttime": "2020-11-13 19:04:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,货币,cryptocurrency", "title": "贝宝(PayPal)表示，将向所有符合条件的美国用户开放加密货币服务，并将每周加密货币购买限额从1万美元提高到2万美元", "title_en": "PayPal says it is opening up cryptocurrency services to all eligible US users and increased its weekly cryptocurrency purchase limit from $10,000 to $20,000", "transed": 1, "url": "https://www.theblockcrypto.com/linked/84398/paypal-opening-up-app-crypto-users", "via": "", "real_tags": ["美国", "货币"]}, {"category": "", "categoryclass": "", "imagename": "0635f0bfe5ad72ab7f903c142275133f.jpeg", "infoid": 1034861, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "YouTube的年度年终回放活动将不会在今年举行，该活动旨在向定义了该平台的创作者、趋势和朋友圈致敬。\n该公司发表了一份声明，承认“2020年是不同的”，并补充说，“如果不是这样继续下去，感觉是不对的。”这标志着自2010年YouTube开始举办年度庆典以来，首次没有倒带。尽管近些年来，倒带在创作者圈子里已经成了一个笑话--2018年，它成了有史以来最不受欢迎的视频--但它仍然是YouTube文化的一部分，即使人们只是用它来浸泡自己的视频。公平地说，就连首席执行官苏珊·沃西基也承认，它们有点让人畏缩。\nYouTube的声明中写道：“我们知道，2020年发生的很多好事都是你们所有人创造的。”“你已经找到了让人们振作起来的方法，帮助他们应对，让他们开怀大笑。”你让艰难的一年真的变得更好了。“。\n虽然许多人因为疫情而滞留在家中，但随着越来越多的人花时间在网上播放视频，YouTube的使用量激增。据该公司称，截至3月底，以“和我一起”为中心的风格化内容(和我一起准备，和我一起健身，和我一起学习)的视频浏览量出现了大幅增长。直播也在YouTube以及Twitch和Facebook等其他平台上流行起来。\nYouTube没有透露是否会在2021年回归。就像现在的一切一样，我想这一切都取决于未来会带来什么。我只知道，我会怀念YouTube一年一度试图在其平台上颂扬好的东西(特别是当有这么多不好的东西的时候)，以及创作者们不可避免的反应视频，他们详细解释了YouTube是如何又一次搞错了这一点。", "note_en": "YouTube Rewind, the company’s annual end-of-year tribute to creators, trends, and moments that defined the platform, will not happen this year.\n The company  issued a statement acknowledging that “2020 has been different,” adding that “it doesn’t feel right to carry on as if it weren’t.” This marks the first time Rewind won’t happen since YouTube started the annual celebration in 2010. Although Rewind has become somewhat of a joke to the  creator community in recent years — it became the most  disliked video of all time in 2018 — it’s still a staple of YouTube’s culture, even if people are just using it to dunk on their own videos. To be fair, even CEO Susan Wojcicki admitted  they’re a little cringe-inducing.\n “We know that so much of the good that did happen in 2020 was created by all of you,” YouTube’s statement reads. “You’ve found ways to lift people up, help them cope, and make them laugh. You made a hard year genuinely better.”\n While many people were stuck at home because of the pandemic, YouTube saw surges in usage as more people spent time streaming video online. By the end of March, views on videos that  centered on “with me”-stylized content (get ready with me, work out with me, study with me) saw massive increases in viewership, according to the company. Live-streaming  also picked up on YouTube as well as on other platforms like Twitch and Facebook.\n YouTube did not say if Rewind will return for 2021. Like everything right now, I imagine it all depends on what the future brings. All I know is I’ll miss YouTube’s annual attempt to try to celebrate the good on its platform (especially when there’s so much bad), and the inevitable reaction videos from creators explaining in detail just  how wrong YouTube got it again.", "posttime": "2020-11-13 19:04:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "youtube,2020,回放,rewind", "title": "YouTube取消了2020年的年终回放活动，这是自2010年开始回放以来的首次取消", "title_en": "YouTube cancels Rewind, its annual end-of-year tribute to creators, trends, and moments, for 2020, the first cancellation since Rewind began in 2010", "transed": 1, "url": "https://www.theverge.com/2020/11/12/21562697/youtube-rewind-canceled-2020-pandemic-creators-community?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["youtube", "2020", "回放", "rewind"]}, {"category": "", "categoryclass": "", "imagename": "92596828686868165fe83245d099acd8.png", "infoid": 1034860, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌有限责任公司(Google LLC)的安卓(Android)团队今天增加了对一项新原型功能的支持，开发者可以使用PyTorch的人工智能框架在移动设备上执行“硬件加速推理”。\n谷歌表示，增加对最先由Facebook Inc.开发的PyTorch的支持，意味着将有数千名开发人员能够利用Android神经网络应用编程接口的能力，在设备上运行计算密集型人工智能模型。\n产品经理Oli Gaymond在一篇博客文章中表示，神经网络API是由谷歌开发的，目的是让Android设备能够自己进行推理，而不是将数据传输到远程服务器进行处理。盖蒙德说，在设备上处理数据有很大的好处，比如更低的延迟，更多的隐私，以及某些功能能够在没有互联网连接的情况下工作。\n盖蒙德说，设备上处理能力最常见的用例是计算机视觉和音频增强等任务。一个例子可能是在用户进行视频呼叫时将其与后台分开。这类任务显然对延迟非常敏感，所以最好能用设备自己的硬件来完成，而不是在遥远的数据中心。这就是Android神经网络API的用武之地。\n盖蒙德说，它已经可以与谷歌自己的人工智能框架TensorFlow和TensorFlow Lite合作，但增加对PyTorch Mobile的支持，让成千上万更有经验的开发人员可以使用它。\nFacebook已经使用了Android神经网络API的原型，该API支持PyTorch，在Messenger视频通话中支持身临其境的360度背景。盖蒙德说，结果相当令人印象深刻，Facebook的速度提高了两倍，电量减少了两倍，同时也减轻了手机中央处理器的部分处理工作，并将其腾出用于其他关键任务。\n盖蒙德说：“今天的初始版本包括在安卓10和更高版本上支持众所周知的线性卷积和多层感知器模型。”使用MobileNetV2模型进行的性能测试显示，与单线程CPU相比，速度提高了10倍。作为向完全稳定版本发展的一部分，未来的更新将包括对更多操作员和模型架构的支持，其中包括一种流行的目标检测和实例分割模型--MASK R-CNN。“。\n通过一键订阅我们的YouTube频道(如下所示)，显示您对我们使命的支持。我们的订阅者越多，YouTube向您推荐的相关企业和新兴技术内容就越多。谢谢!\n…。我们还想告诉你们我们的使命，以及你们如何帮助我们完成这一使命。SiliconANGLE Media Inc.的商业模式是基于内容的内在价值，而不是广告。与许多在线出版物不同的是，我们没有付费墙或横幅广告，因为我们想让我们的新闻保持开放，不受影响，也不需要追逐流量。关于硅谷的新闻、报道和评论-以及我们硅谷演播室和CUBE的环球旅行视频团队提供的现场无脚本视频-需要大量的辛勤工作、时间和金钱。要保持高质量，需要赞助商的支持，这些赞助商与我们对无广告新闻内容的愿景保持一致。\n如果你喜欢这里的报道、视频采访和其他无广告内容，请花一点时间查看一下我们赞助商支持的视频内容样本，然后发推文表示支持，然后继续回到SiliconANGLE。", "note_en": "Google LLC’s Android team today added support for a new prototype feature that makes it possible for developers to perform “hardware accelerated inference” on mobile devices using the  PyTorch artificial intelligence framework.\n The addition of  support for PyTorch, first built by Facebook Inc., means that thousands more developers will be able to leverage the  Android Neural Network application programming interface’s ability to run computationally intensive AI models on-device, Google said.\n In a blog post, product manager Oli Gaymond said the Neural Network API was built by Google to give Android devices a way to perform inference themselves, instead of transmitting data to be processed at a remote server. There are big benefits from processing data on-device, Gaymond said, such as lower latency, more privacy and the ability for certain features to work without internet connectivity.\n The most common use cases for on-device processing are tasks such as computer vision and audio enhancement, Gaymond said. One example might be segmenting a user from the background when they make a video call. This kind of task is obviously very sensitive to latency, so it’s better if it can be done using the device’s own hardware rather than at a faraway data center. That’s where the Android Neural Network API comes in.\n It already works with Google’s own AI frameworks, TensorFlow and TensorFlow Lite, but adding support for  PyTorch Mobile opens it up to the thousands of developers who are more experienced with that framework, Gaymond said.\n Facebook has already used a prototype of the Android Neural Network API that supports PyTorch to enable  immersive 360-degree backgrounds on Messenger video calls. Gaymond said the results were pretty impressive, with Facebook seeing a two-times speedup and two-times reduction in power, while also offloading some of the processing work from the phone’s central processing unit and freeing it up for other critical tasks.\n “Today’s initial release includes support for well-known linear convolutional and multilayer perceptron models on Android 10 and above,” Gaymond said. “Performance testing using the MobileNetV2 model shows up to a 10x speedup compared to single-threaded CPU. As part of the development towards a full stable release, future updates will include support for additional operators and model architectures including Mask R-CNN, a popular object detection and instance segmentation model.”\n  Show your support for our mission with our one-click subscription to our YouTube channel (below). The more subscribers we have, the more YouTube will suggest relevant enterprise and emerging technology content to you. Thanks!\n  … We’d also like to tell you about our mission and how you can help us fulfill it. SiliconANGLE Media Inc.’s business model is based on the intrinsic value of the content, not advertising. Unlike many online publications, we don’t have a paywall or run banner advertising, because we want to keep our journalism open, without influence or the need to chase traffic. The journalism, reporting and commentary on  SiliconANGLE — along with live, unscripted video from our Silicon Valley studio and globe-trotting video teams at   theCUBE — take a lot of hard work, time and money. Keeping the quality high requires the support of sponsors who are aligned with our vision of ad-free journalism content.\n If you like the reporting, video interviews and other ad-free content here, please take a moment to check out a sample of the video content supported by our sponsors,   tweet your support, and keep coming back to   SiliconANGLE.", "posttime": "2020-11-13 19:04:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,开发,android,神经网络", "title": "谷歌在Android的神经网络API中添加了对PyTorch的支持，这将使开发人员能够在设备上运行计算密集型AI模型", "title_en": "Google adds support for PyTorch to Android's Neural Networks API, which would enable developers to run computationally intensive AI models on-device", "transed": 1, "url": "https://siliconangle.com/2020/11/12/androids-neural-networks-api-adds-support-pytorch-enable-device-ai-processing/", "via": "", "real_tags": ["google", "谷歌", "开发", "android", "神经网络"]}, {"category": "", "categoryclass": "", "imagename": "7fc439c0a733cb49345c40716da2f257.jpeg", "infoid": 1034859, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在美国律师协会(American Bar Association)秋季论坛(Fall Forum)的虚拟主题演讲中，明尼苏达州民主党参议员艾米·克洛布查尔(Amy Klobuchar)称赞美国司法部(Justice Department)在最近针对谷歌(Google)的反垄断诉讼中保留了所谓结构性补救措施的选择余地。\n据CNBC周二报道，克洛布查尔的名字已经被提名为当选总统乔·拜登(Joe Biden)任司法部长的可能人选。\n即使克洛布查尔继续留在参议院，她也将成为科技公司必须面对的一股力量，特别是如果民主党人赢得参议院多数席位的话。\n当谈到所谓的科技垄断时，明尼苏达州民主党参议员艾米·克洛布查尔(Amy Klobuchar)毫不避讳地讨论分拆。\n在美国律师协会秋季论坛(American Bar Association‘s Fall Forum)的虚拟主题演讲中，克洛布查尔称赞美国司法部(Justice Department)在最近针对谷歌(Google)的反垄断诉讼中保留了所谓结构性补救措施的选择权。\n她说：在这种严重的垄断行动中，重要的是要有分手补救措施摆在桌面上。\nCNBC周二援引知情人士的话报道，克洛布查尔的名字已被提名为当选总统乔·拜登(Joe Biden)任司法部长的可能人选。在今年早些时候结束自己的总统竞选后，她是拜登的早期支持者。拜登没有宣布大多数内阁职位的具体人选，但在周三宣布了罗恩·克莱恩(Ron Klain)担任他的幕僚长。\n但即使克洛布查尔继续留在参议院，她也将继续成为科技公司必须面对的一股力量。克洛布查尔已经是参议院反垄断小组委员会的最高民主党人，在该委员会中，她一直批评科技巨头，并提出了旨在重振反垄断执法的立法。\n如果民主党在佐治亚州赢得两场决选，赢得参议院控制权，克洛布查尔可能会拥有更多权力。这一结果将使参议院各占一半，副总统当选人卡玛拉·哈里斯(Kamala Harris)将成为决胜局的一票。这样的分裂可能会给克洛布查尔和民主党人更多的权力来制定议程和推动立法。\n克洛布查尔表示，谷歌一案是一个重要的开端，但他指出，各州总检察长仍可以加入并扩大该案的范围，这将很快落到即将上任的拜登政府手中。\n她还明确表示，国会需要采取行动，确保强有力的反垄断执法。她说，最高法院的一些案件增加了政府在反垄断挑战中获胜的难度，让立法者重新设定法院的期望。\n克洛布查尔说：如果有人等待法院来解决我们的垄断问题，那将需要很长时间。我们需要更新我们的法律。除了加大执法力度，我们真的别无选择。", "note_en": "During a virtual keynote speech for the American Bar Association&#39;s Fall Forum, Sen. Amy Klobuchar, D-Minn., praised the Justice Department for leaving open the option of so-called structural remedies in its recent antitrust lawsuit against Google.\n Klobuchar&#39;s name has been floated as a possible attorney general under President-elect Joe Biden, CNBC reported on Tuesday.\n Even if she remains in the Senate, Klobuchar will be a force for tech companies to reckon with, especially if Democrats win the majority in the chamber.\n Sen. Amy Klobuchar, D-Minn., is not shy about discussing breakups when it comes to alleged tech monopolies.\n During a virtual keynote speech for the American Bar Association&#39;s Fall Forum, Klobuchar praised the Justice Department for leaving open the option of so-called structural remedies in its recent antitrust lawsuit against  Google.\n  &#34;In a serious monopolization action like this one, it&#39;s important that a breakup remedy be on the table,&#34; she said.\n Klobuchar&#39;s  name has been floated as a possible attorney general under President-elect Joe Biden, CNBC reported on Tuesday, citing people familiar with the matter. She was an  early Biden endorser after ending her own presidential bid earlier this year. Biden has announced no specific names for most cabinet positions, but did announce  Ron Klain as his chief of staff on Wednesday.\n But even if she remains in the Senate, Klobuchar will continue to be a force for tech companies to reckon with. Klobuchar already serves as the top Democrat on the Senate antitrust subcommittee, where she has been critical of the tech giants and introduced legislation aiming to reinvigorate antitrust enforcement.\n Klobuchar could have more power if the Democrats win control of the Senate by winning two run-off races in Georgia. That outcome would split the Senate 50-50, with Vice President-elect Kamala Harris acting as the tiebreaker vote. Such a split could give Klobuchar and Democrats more power to set the agenda and push through legislation.\n Klobuchar said the  Google case was an &#34;important start&#34; but noted that state attorneys general could still join and broaden the case, which will soon fall to the incoming Biden administration.\n  She also made clear that Congress needs to take action to ensure robust antitrust enforcement. She said a number of Supreme Court cases have made it more difficult for the government to succeed in antitrust challenges, leaving it up to lawmakers to reset expectations in the courts.\n &#34;If anyone&#39;s waiting on the courts to solve our monopoly problem, that&#39;s going to take a really long time,&#34; Klobuchar said. &#34;We need to update our laws. We really don&#39;t have another choice besides increasing enforcement.&#34;", "posttime": "2020-11-13 19:04:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,rust,谷歌,美国,反垄断", "title": "参议员艾米·克洛布查尔(Amy Klobuchar)可能成为拜登的AG人选，他表示，谷歌的“分手补救措施”应该“摆在桌面上”，并赞扬了美国司法部对谷歌的反垄断诉讼", "title_en": "Sen. Amy Klobuchar, a possible Biden pick for AG, says a “breakup remedy” for Google should be “on the table” and praises DOJ's antitrust suit against Google", "transed": 1, "url": "https://www.cnbc.com/2020/11/12/klobuchar-potential-ag-pick-google-breakup-should-be-on-the-table.html", "via": "", "real_tags": ["google", "rust", "谷歌", "美国", "反垄断"]}, {"category": "", "categoryclass": "", "imagename": "99794ca5406ab0777a9d97409ab24c9d.jpeg", "infoid": 1034858, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家软件和分析公司在彼得·泰尔、首席执行官亚历克斯·卡普等人共同创立17年后于9月份上市。\n在延长的交易时间里，股市出现了反弹。截至收盘，该股较上市首日上涨46%。\nPalantir表示，它的客户集中度正在下降，而且它现在从顶级客户那里获得的收入比例变小了。\nPalantir是一家为国防工业和大型企业提供软件和分析工具的公司，该公司在9月份上市以来的首次财报中公布了52%的营收增长。\n该股在盘后交易中反弹，跌幅超过8%，随后反弹，涨幅超过1%。在常规交易日暴跌8.7%。\n收益：每股亏损94美分，而去年同期亏损24美分。\n第三季度，该公司报告运营亏损8.47亿美元，原因是8.47亿美元的股票薪酬费用。\nPalantir将全年营收指引上调至10.7亿至10.72亿美元，同比增长44%。该公司此前表示，今年的销售额将达到10.6亿美元。预计2020年调整后的营业收入将在1.3亿美元至1.36亿美元之间。\nPalantir由科技投资者彼得·泰尔(Peter Thiel)和乔·朗斯代尔(Joe Lonsdale)以及首席执行官亚历克斯·卡普(Alex Karp)等人于2003年共同创立，为包括国防部、美国食品和药物管理局(FDA)和情报界在内的政府机构提供数据分析软件和服务。它还向飞机制造商空中客车(Airbus)和能源生产商英国石油(BP)等公司销售产品。\nPalantir&#39；的股票在9月9日直接上市，开盘价为10美元。30美元，此后攀升46%，周四收于14.58美元。投资者正密切关注该公司的客户群。2020年上半年，该公司的客户群仅为125人。随着该公司更多地关注软件，而不是更少地关注服务，它正试图让客户更容易开始使用该产品，这样它就可以扩大覆盖范围，降低销售成本。\n我们的客户集中度正在下降，该公司在新闻稿中表示。Palantir表示，今年前9个月61%的收入来自前20名客户，低于2019年同期的68%。该公司没有提供最新的客户数量。\n该公司还表示，第三季度的新合同包括与美国陆军签订的价值9100万美元的合同，与美国国立卫生研究院(National Institutes Of Health)签订的价值3600万美元的合同，以及与一家航空航天客户价值3亿美元的续签合同。\nPalantir在财报电话会议上说，商业收入增长了35%，达到1.27亿美元，而对政府机构的销售额增长了68%，达到1.63亿美元。这意味着来自政府客户的收入占总收入的比例从上半年的54%增至56%。", "note_en": "The software and analytics company went public in September, 17 years after it was co-founded by Peter Thiel, CEO Alex Karp and others.\n The bounced around in extended trading. As of the close, it was up 46% from its debut.\n Palantir said that its &#34;customer concentration is decreasing,&#34; and that it now gets a smaller percentage of revenue from its top clients.\n Palantir, the maker of software and analytics tools for the defense industry and large corporations,  reported 52% revenue growth in its first earnings announcement since going public in September.\n The stock bounced around in extended trading, falling more than 8% before bouncing back and gaining more than 1%. It plunged 8.7% during the regular trading day.\n   Earnings: Loss of  94 cents per share vs loss of 24 cents a year earlier.\n For the third quarter, the company reported an operating loss of $847.8 million due to an $847 million charge for stock-based compensation.\n Palantir raised its full-year revenue guidance to between $1.07 billion and $1.072 billion, which would represent 44% growth from a year earlier. The company previously said sales for the year would reach $1.06 billion. Adjusted operating income in 2020 is expected to be between $130 million and $136 million.\n Co-founded in 2003 by tech investors Peter Thiel and Joe Lonsdale, CEO Alex Karp and others, Palantir provides data analytics software and services to government agencies, including the Defense Department, the U.S. Food and Drug Administration and the intelligence community. It also sells to companies like aircraft manufacturer  Airbus and energy producer  BP.\n Palantir&#39;s stock opened at $10 in its  direct listing on Sept. 30, and has since climbed 46% to close at $14.58 on Thursday. Investors are paying close attention to the company&#39;s customer base, which was limited to  125 in the first half of 2020. As the company focuses more on software and less on services, it&#39;s trying to make it easier for clients to start using the product so it can expand its reach and bring down sales costs.\n  &#34;Our customer concentration is decreasing,&#34; the company said in the release. Palantir said that 61% of its revenue for the first nine months of the year came from its top 20 customers, down from 68% over the same stretch in 2019. The company didn&#39;t provided an updated customer count.\n The company also said that new contracts in third quarter included a $91 million deal with the U.S. Army, a $36 million contract with the National Institutes of Health $36 million and a $300 million renewal with an aerospace customer.\n In the earnings call, Palantir said that commercial revenue 35% to $127 million, while sales to government agencies rose 68% to $163 million. That means revenue from government clients increased to 56% of total revenue from 54% in the first half of the year.", "posttime": "2020-11-13 19:03:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,研究院,secured", "title": "Palantir公布了IPO后收益，第三季度营收为2.894亿美元，而EST为2.894亿美元。2.794亿美元，同比增长52%，并表示已与美国陆军和美国国立卫生研究院(NIH)签订了新合同", "title_en": "Palantir reports post-IPO earnings with Q3 revenue of $289.4M vs est. of $279.4M, up 52% YoY, and says it has secured new contracts with the US Army and NIH", "transed": 1, "url": "https://www.cnbc.com/2020/11/12/palantir-reports-t.html", "via": "", "real_tags": ["美国", "研究院", "secured"]}, {"category": "", "categoryclass": "", "imagename": "79c35b0069d5675b1e3bb4138693a468.jpeg", "infoid": 1034857, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "思科股价周四在盘后交易中上涨9%，此前该公司公布了第一财季收益和超出分析师预期的乐观预期。\n根据Refinitiv的数据，调整后每股收益为76美分，而分析师预期为每股70美分。\n在指引方面，思科表示，预计第二财季调整后每股收益为74美分至76美分，营收下降2%，营收持平。接受Refinitiv调查的分析师此前预计，调整后的每股收益为73美分，营收为116.3亿美元，这意味着该季度营收将下降3%。\n根据一份声明，总的来说，思科本季度营收按年率计算下降了9%，与上一季度9%的降幅持平。营收现在已经连续四个季度下降。冠状病毒疫情和经济衰退继续对思科构成挑战，因为该公司的大部分收入仍来自企业和政府数据中心和办公室的设备销售，而随着人们在家工作，云服务的支出有所增加。\n思科本季度公共部门订单同比增长5%，而企业、商业和服务提供商领域的订单下降。思科首席执行官查克·罗宾斯(Chuck Robbins)在电话会议上告诉分析师，刺激性支出提振了美国和海外的政府订单。\n罗宾斯说：我有点希望这件事会发生，我认为我们确实看到了这一点，我们的客户非常注重让员工在家正常工作，并设置安全措施。我认为每个人都在争先恐后地这么做，然后我想他们停顿了一下，这就是我们在上个季度的订单中所感受到的，然后我认为他们重新安排了他们要花钱的事情的优先顺序，我想我们开始看到一些钱回来了。\n思科基础设施平台部门(包括数据中心网络交换机)实现营收63.4亿美元，同比下降16%，低于FactSet调查分析师64.5亿美元的共识。按营收计算，它是思科业务中最大的一部分，也是受该病毒影响最大的业务。\n应用业务，包括Webex视频通话服务和AppDynamics监控软件，贡献了13.8亿美元的收入，下降了8%，略低于FactSet共识的14亿美元。\n思科表示，过去6年担任欧特克首席财务官的斯科特·赫伦(Scott Herren)将接替8月份宣布退休的思科首席财务官凯利·克莱默(Kelly Kramer)。罗宾斯说，克莱默非常支持斯科特的决定。\n在本季度，思科宣布了到2023年将高管中黑人代表人数增加75%的目标。同样在本季度，思科收购了BabbleLabs，这是一家拥有可以提高通话质量的软件的公司，并宣布了Webex软件的增强。\n截至周四收盘，思科股价今年迄今下跌了约20%，而同期标准普尔500指数上涨了9%。", "note_en": "Cisco shares moved as much as 9% higher in extended trading on Thursday after the company reported fiscal first-quarter earnings and an upbeat forecast that exceeded analysts&#39; expectations.\n  Earnings: 76 cents per share, adjusted, vs. 70 cents per share as expected by analysts, according to Refinitiv.\n  With respect to guidance, Cisco said it sees 74 cents to 76 cents in adjusted per share and a 2% revenue decline to flat revenue in the fiscal second quarter. Analysts polled by Refinitiv had expected 73 cents in adjusted earnings per share and $11.63 billion in revenue, which implies a 3% revenue decline for the period.\n Overall, Cisco&#39;s revenue declined 9% on an annualized basis in the quarter, according to a  statement, in line with the 9% decline in  the previous quarter. Revenue has now fallen four quarters in a row. The coronavirus pandemic and recession continued to challenge Cisco as much of its revenue still comes from sales of equipment for corporate and government data centers and offices, while spending on cloud services has increased as people work from home.\n Cisco saw a 5% increase in public sector orders year over year in the quarter, while orders were down in enterprise, commercial and service provider segments. Stimulus spending boosted government orders in the U.S. and abroad, Cisco CEO Chuck Robbins told analysts on a conference call.\n &#34;What I kind of was hopeful was going to happen which I think we did see this is that we had customers who were super focused on getting their employees working from home properly and getting their security set up,&#34; Robbins said. &#34;I think everyone raced to do that, and then I think they took a pause, which is what we felt in our last quarter in orders, and then I think they reprioritized what they were going to be spending money on, and I think we started seeing some of that come back.&#34;\n Cisco&#39;s Infrastructure Platforms segment, which includes data center networking switches, delivered $6.34 billion in revenue, down 16% year over year and below the consensus of $6.45 billion among analysts polled by FactSet. It&#39;s the largest part of Cisco&#39;s business by revenue, and it&#39;s the one that&#39;s most impacted by the virus.\n  The Applications business, which contains the Webex video-calling service and the AppDynamics monitoring software, contributed $1.38 billion in revenue, which is down 8% and slightly less than the FactSet consensus of $1.40 billion.\n Cisco said Scott Herren, chief financial officer of  Autodesk for the past six years, will be the replacement for Kelly Kramer, Cisco&#39;s chief financial officer, whose retirement was announced in August. Kramer &#34;was very supportive on the decision for Scott,&#34; Robbins said.\n In the quarter Cisco  announced a goal of increasing Black representation among executive ranks by 75% by 2023. Also in the quarter Cisco  acquired BabbleLabs, a company with software that can improve call quality and  announced Webex software enhancements.\n As of Thursday&#39;s close, Cisco shares had fallen about 20% so far this year, while the S&amp;P 500 had gone up 9% over the same period.", "posttime": "2020-11-13 19:03:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "下降,infrastructure,思科", "title": "思科第一季度营收为119.3亿美元，而Est为118.5亿美元，同比下降9%，基础设施平台营收为63.4亿美元，同比下降16%；盘后股价上涨8%以上", "title_en": "Cisco beats with Q1 revenue of $11.93B vs. $11.85B est., down 9% YoY, and Infrastructure Platforms revenue of $6.34B, down 16% YoY; stock up 8%+ after hours", "transed": 1, "url": "https://www.cnbc.com/2020/11/12/cisco-csco-earnings-q1-2021.html", "via": "", "real_tags": ["下降", "思科"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1034856, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本文由《现代零售》杂志的Digiday兄弟杂志报道并首次发表。\n上周，GameStop鼓励商店员工提交自己在工作中跳舞的视频，参加#红酒挑战赛(#RedWineChallest)。获胜者将获得礼品卡，并在黑色星期五期间获得更多工作时间。在员工批评将更多时间用于舞蹈挑战的冷酷无情后，该公司拒绝了这一提议，但GameStop并不是唯一一家急于推动员工成为活跃TikTokers的公司。越来越多的零售商将员工TikTok视为其营销策略的未来。\n丝芙兰有一个预先批准的员工影响力小组，他们活跃在TikTok上，Vox将其称为“丝芙兰团队”。温迪的一名员工里奇·费德里奇(Ricky Federici)通过他的培根教程已经积累了7万名粉丝。今年夏天，Dunkin‘推出了Crew Ambadors计划，这是一个员工影响力网络，到目前为止，包括四名Dunkin’咖啡师和零售业工人，他们已经在TikTok上拥有了相当大的粉丝。\n多年来，公司一直在投资招聘员工影响力人物，这些人可以为品牌树立形象，并提供(有利的)幕后一瞥他们的公司。像Zappos，华为和戴尔这样的公司都鼓励他们的员工发布关于他们工作的积极信息，主要是通过Instagram和Twitter。公司相信，他们的员工可以比一个不知名的品牌账户更深入地传播他们的信息。但是，虽然员工倡导营销策略已经存在了几年，但它正在越来越多地进入TikTok--这在很大程度上是因为TikTok非常善于营造与观众的亲切感。\n最大的员工权益倡导平台之一DSMN8的营销经理乔迪·利昂(Jody Leon)说，“你不想在社交网站上，只想不断收到很多品牌的消息。”“你不会想一直听到电力公司或天然气公司的消息。然而，如果他们的员工有什么要说的，你更有可能倾听，而不是品牌对你大喊大叫的广告。\n这一策略最近愈演愈烈。里昂说：“尽管现在世界处于一个有点疯狂的地方，我们还是注意到了增长。”随着零售商撕毁他们以前的营销手册，他们对这些新的传播信息的方式更加开放。\n这其中有一个数学因素：根据另一家大型员工权益倡导平台EveryoneSocial的托德·昆斯曼的说法，平均每个员工在所有渠道都有大约1000名粉丝。假设你是一家有1万名员工的公司--即使你的员工中有十分之一签约成为有影响力的人，他们的社会影响力也会比公司本身更大。\n在员工影响力的世界里，TikTok仍然是一个新来者。EveryoneSocial和DSMN8都集成了Instagram、Twitter、Facebook和LinkedIn，但都还没有TikTok功能。但双方都认为TikTok正变得越来越重要，DSMN8告诉现代零售，它正在为明年初建立TikTok整合。\n在DSMN8这样的平台上，员工可以从预先批准的由项目经理设置的可能发布的帖子中进行选择。但DSMN8也提供了帮助员工创建原创内容的工具。有时公司会在DSMN8上发出一份“简报”--基本上就是它希望员工推广什么的概述，比如一种新的甜甜圈口味或者一份工作清单。管理者必须先批准一篇帖子，然后员工才能发布它；当员工在DSMN8平台上提交内容时，员工也同意放弃对该内容的权利。\n为了补偿工人，零售商依赖于员工权益倡导平台内置的排行榜。谁发布的帖子最多，谁的排名就会更高。排名最高的员工会得到一些小津贴，比如礼品卡、免费午餐或(在过去)体育门票。这种奖励制度本身就提出了一个问题：员工倡导的帖子是否应该作为广告披露？答案尚不清楚，但为了掩饰他们的基础，一些公司要求员工在公司批准的帖子上贴上标签。戴尔采用#IWorkForDell。\nTikTok之所以特别有效，是因为它能够将无关紧要的视频迅速推向病毒式传播。TikTok的算法甚至帮助最普通的小企业迅速走红。例如，景观公司通过提供乏味的日常工作一瞥，在TikTok上积累了数十万粉丝。\n产品在TikTok上也有自己的病毒生命周期。最近，一名男子一边大口喝着蔓越莓汁一边滑板，海洋喷雾登上了新闻头条，但从草莓连衣裙到鱼肉馅饼等新产品也在该平台上疯传。例如，星巴克直到去年才开始认真鼓励员工在TikTok上发帖，当时有一波顾客开始进来点“TikTok饮料”--一种混合了草莓刺梨、黑莓和柠檬水的饮料，在平台上炸开了。\n这就是为什么像邓肯这样的公司越来越看好TikTok。所有的船员大使都会发布他们工作中的视频片段，通常是邓肯的新产品。在真正的TikTok形式下，他们一些最平凡的视频--比如关于员工如何做抹茶拿铁的逐步指南--获得了最大的吸引力。邓肯在一封电子邮件中说，“参与船员大使项目的每一名船员都会因他们的工作和内容而获得补偿”，但该公司没有评论这种补偿是以什么形式进行的。\n虽然这些员工影响力现在被用来获得有机的影响力，但它们也可能成为危机管理工具。专家们越来越多地可以想象这样一个世界，在这个世界里，员工维权变成了抵御不良公关的盾牌。\n根据昆斯曼的说法，这不仅仅是理论上的：“我知道，如果有一些负面的事情被曝光，那肯定会带来一些积极的消息，”他说。\n记者注：如果你是TikTok上的一名零售业员工，现代零售会很乐意听到你的消息。\n尽管疫情导致对在线课程的需求增加，但欧贝仍在继续构建其合作战略。\n右手边没有路。惨淡的一年给广告商留下了一个棘手的问题：如何制作好冠状病毒时代的圣诞广告？\n营销人员希望能够灵活应对当前的气候，无论是新的冠状病毒病例激增还是日益恶化的经济衰退。\n对于数字营销者来说，需求方平台是一个日益复杂的空间。Nexstar Inc.首席数据科学官布莱恩·马龙(Brian Malone)表示，选择的数量已经显著增加，作为回应，广告商和代理机构经常对不断扩大的数字信号处理器生态系统做出反应，将人们扔到问题上。我们来自于这个[…]。\n一些民主党人以及广告公司高管质疑数字广告是否得到了足够的关注。\n由于Facebook广告管理器的持续问题，一些买家正在改变他们的行为，以应对不确定性。", "note_en": "This article was reported on — and first published by — Digiday sibling  Modern Retail.\n  Last week, GameStop  encouraged store workers to submit videos of themselves — at work — dancing to the #RedWineChallenge. The winning group would get gift cards plus access to more work hours during Black Friday. The company took down the offer after workers criticized the callousness of pinning more hours to a dance challenge, but GameStop isn’t alone in its eagerness to push its workers to become active TikTokers. An increasing number of retailers see employee TikToks as the future of their marketing strategies.\n Sephora has a pre-approved group of employee influencers who are active on TikTok, which Vox  called the “Sephora Squad.” One Wendy’s employee, Ricky Federici, has  built up 70,000 followers thanks to his Baconator tutorials. And over the summer, Dunkin’ launched its  Crew Ambassadors program, an employee influencer network that so far includes a group of four Dunkin’ baristas and retail workers who already had sizable TikTok followings.\n For years, companies have invested in recruiting employee influencers who can put a face to the brand and offer a (favorable) behind-the-scenes glimpse into their companies. Businesses like Zappos, Huawei and Dell  have all encouraged their employees to post positive messages about their jobs, mostly across Instagram and Twitter. Companies believe that their employees can carry their message much further than a faceless brand account. But while the employee advocacy marketing tactic has existed for a few years, it is increasingly moving into TikTok — in large part because TikTok is so good at creating a sense of intimacy with viewers.\n “You don’t want to go on social and just keep hearing from lots of brands,” said Jody Leon, the marketing manager at DSMN8, one of the largest employee advocacy platforms. “You don’t want to keep hearing from the electric company or the gas company. However, if their employees have something to say, you’re more likely to listen than a brand shouting advertising at you.”\n The tactic has been gaining steam of late. “We’ve noticed growth despite the world being in a bit of a crazy place right now,” said Leon. As retailers tear up their previous marketing playbooks, they’re more open to these newer ways to get their message out.\n There’s an element of math involved: the average employee has something like 1,000 followers across all channels, according to Todd Kunsman of EveryoneSocial, another major employee advocacy platform. Say you’re a company of 10,000 employees — if even a tenth of your workers sign up to become influencers, they’ll collectively have more social reach than the company itself.\n Within the world of employee influencing, TikTok is still a newcomer. EveryoneSocial and DSMN8 are integrated with Instagram, Twitter, Facebook and LinkedIn, but neither has a TikTok feature yet. But both agree that TikTok is becoming increasingly important, and DSMN8 told Modern Retail it is building a TikTok integration for early next year.\n On a platform like DSMN8, employees might choose from a pre-approved feed of possible posts set by their project managers. But DSMN8 also offers tools that help employees create original content. Sometimes the company will send out a “brief” on DSMN8 — basically, an overview of what it wants its employees to promote, such as a new doughnut flavor or a job listing. Managers have to approve a post before the employee can publish it; when an employee submits content on the DSMN8 platform, the employee also agrees to give up their rights to the content.\n To compensate workers, retailers rely on leaderboards built into the employee advocacy platforms. Whoever posts most often gets ranked higher. The highest-ranked employees get small perks, like gift cards, free lunches or (in the olden days) sports tickets. That rewards system raises its own question: should employee advocacy posts be disclosed as ads? The answer is unclear, but, to cover their bases, some companies ask employees to denote company-approved posts with hashtags. Dell goes with #IWorkForDell.\n What makes TikTok in particular so effective is its ability to catapult inconsequential videos to viral status. TikTok’s algorithm has helped  even the most mundane small businesses go viral. Landscaping companies, for instance, have amassed hundreds of thousands of followers on TikTok by offering tedious glimpses of their everyday work.\n  Products also have their own viral life cycles on TikTok.  Ocean Spray recently grabbed the headlines when a man skateboarded while gulping down cranberry juice, but new products — ranging from a strawberry dress to  fish flops — have also gone viral on the platform. Starbucks, for example, didn’t get serious about encouraging its employees to post on TikTok until last year, when  a wave of customers started coming in to request the “TikTok drink” — a blend of strawberry acai, blackberries and lemonade that had blown up on the platform.\n That’s why companies like Dunkin’ are becoming more bullish on TikTok. All of the Crew Ambassadors post clips from their jobs, often featuring new Dunkin’ products. In true TikTok form, some of their most mundane videos — like a step-by-step guide for  how employees make a matcha latte — have gained the most traction. Dunkin’ said in an email that “each crew member who participates in the crew ambassador program is compensated for their work and content,” but it wouldn’t comment on what form that compensation takes.\n While these employee influencers are being used now to garner organic reach, they may also become crisis management tools. Increasingly, experts could imagine a world in which employee advocacy becomes a shield against bad PR.\n According to Kunsman, that isn’t just theoretical: “I know that’s for sure happening to get some positive news out there if there is some negative thing that comes to light,” he said.\n Reporter’s note: If you are a retail employee on TikTok, Modern Retail would love to  hear from you.\n   Even with the increased demand for online classes due to the pandemic, Obé has continued to build out its partnership strategy.\n There&#39;s no &#34;right&#34; way. The bleak year has left advertisers with a tricky question: how do you make good coronavirus-era Christmas ads?\n Marketers want the ability to be flexible and reactive to the current climate, be it a new surge of coronavirus cases or a worsening recession.\n For digital marketers, the demand-side platform is an increasingly complex space. The number of options has grown significantly, and in response, advertisers and agencies are often reacting to the expanding DSP ecosystem by “throwing people at the problem,” said Brian Malone, Chief Data Science Officer at Nexstar Inc.  “Where we came from was this very […]\n Some Democrats as well as ad agency execs have questioned whether or not there was enough of a focus on digital advertising.\n With on-going issues with Facebook&#39;s Ads Manager, some buyers are changing their behavior to manage for uncertainty.", "posttime": "2020-11-13 19:03:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "员工,employee", "title": "零售商正在利用TikTok上的员工影响力来获得有机的影响，并根据员工倡导平台中内置的排行榜对他们进行补偿", "title_en": "Retailers are using employee influencers on TikTok to garner organic reach, compensating them according to leaderboards built into employee advocacy platforms", "transed": 1, "url": "https://digiday.com/marketing/retailers-are-pushing-their-employees-to-become-tiktok-influencers/", "via": "", "real_tags": ["员工", "employee"]}, {"category": "", "categoryclass": "", "imagename": "c8efd1db0ac6eb8ac638056c9608ac45.jpg", "infoid": 1034855, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "YouTube驳斥了有关其平台帮助宣传和传播有关2020年美国大选的错误信息的说法，称其最受欢迎的选举相关视频来自“权威”来源。YouTube还声称，它采取措施阻止含有虚假或误导性声明的视频的传播，不将其显示在搜索结果中或通过其推荐引擎。\n“和其他公司一样，我们允许播放这些视频，因为YT允许讨论选举结果和计票过程。”YouTube在YouTube的YouTubeInsider账户上写道，回应彭博社记者马克·伯根的一条推文，他批评该公司对选举内容的审核缓慢且前后不一致。他说：“有关选举的最受欢迎的视频来自权威新闻机构。平均而言，当人们搜索与选举相关的内容时，美国排名前十的视频中有88%来自高质量的来源。\n最受欢迎的选举视频来自权威新闻机构。平均而言，当人们搜索与选举相关的内容时，美国排名前十的视频中有88%来自高质量的来源。\n-YouTubeInsider(@YouTubeInsider)2020年11月12日。\nYouTube没有透露它认为什么是权威的，也没有细分选举内容的浏览量有多大比例来自于用户在搜索框中输入短语，而不是关注某些频道，搜索这些频道，或者通过Facebook、Reddit或其他社交网络找到这些频道。尽管YouTube的选举内容排名前十的结果可能包含主流媒体来源，但它似乎并没有承认用户经常从不可靠的来源查找视频，或者通过其他方式在网上找到它们。\nYouTube在选举日前后一直受到抨击，因为它允许One America News Network等组织发布视频，谎称唐纳德·特朗普(Donald Trump)总统赢得连任，并认为大规模选民欺诈是他输给候任总统乔·拜登(Joe Biden)的罪魁祸首。\nFacebook和Twitter一直在积极地标记和删除散布有关选举的虚假信息的链接和帖子，但YouTube表示，它允许人们讨论选举结果和计票等过程，即使他们这样做的方式散布了未经证实的阴谋，或者兜售虚假或误导性的说法。YouTube声称，它通过限制这些视频使用搜索和其推荐引擎的可发现性来抵消这类内容的传播。\n然而，YouTube似乎在努力控制上传到Facebook等其他社交网络平台上的视频的传播，在Facebook等其他社交网络上，视频往往传播得太快，两家公司都无法减缓传播速度。\n在一个展示YouTube帮助放大错误信息的过程中，Innoce报道了一项虚假指控，声称RealClearPolitics取消了其在宾夕法尼亚州的通话，转而支持拜登。随后，特朗普的律师鲁迪·朱利安尼(Rudy Giuliani)传播了这一说法，直到右翼YouTube频道The Next News Network发布了一段视频，重复了这一说法。这段视频随后主要通过发布给私人团体的链接在Facebook上传播，这使得Facebook版主很难遏制其传播。据副主席报道，一直以来，Next News Network都在通过这段视频获得点击量，甚至出售商品，其中的收入被削减到了YouTube上。\nYouTube表示，它正在使用一个位于选举相关搜索顶部的选举面板，将用户引导到其谷歌网页上，上面有经过核实的选举结果。据《纽约时报》报道，YouTube还删除了某些视频中的广告，这些视频“明显带有虚假信息，削弱了人们对选举的信心”，但YouTube并没有直接删除这些视频。", "note_en": "YouTube is pushing back against claims its platform is helping promote and spread misinformation surrounding the 2020 US election, saying its most popular videos related to the election are from “authoritative” sources. YouTube also claims it takes measures to stop the spread of videos containing false or misleading claims by not surfacing them in search results or through its recommendation engine.\n “Like other companies, we’re allowing these videos because discussion of election results &amp; the process of counting votes is allowed on YT. These videos are not being surfaced or recommended in any prominent way,” YouTube wrote from its YouTubeInsider account in response to a  tweet from  Bloomberg journalist Mark Bergen, who criticized the company’s slow and inconsistent moderation of election content. “The most popular videos about the election are from authoritative news organizations. On average, 88 percent of the videos in top-10 results in the U.S. come from high-auth sources when people search for election-related content.”\n The most popular videos about the election are from authoritative news organizations. On average, 88% of the videos in top-10 results in the U.S. come from high-auth sources when people search for election-related content.\n— YouTubeInsider (@YouTubeInsider)  November 12, 2020\n YouTube did not disclose what it considers authoritative, nor did it break down what percentage of views of election content come from users typing in phrases into the search box instead of following certain channels, seeking out those channels, or finding them via Facebook, Reddit, or other social networks. Even though its top-10 results for election content may contain mainstream media sources, YouTube does not appear to be acknowledging how often users seek out videos from untrustworthy sources or find them online through other means.\n YouTube has  come under fire in the run-up to and after Election Day for allowing videos from organizations like One America News Network that falsely say President Donald Trump won reelection and that mass voter fraud is responsible for his loss to President-elect Joe Biden.\n Unlike Facebook and Twitter, which have been aggressively labeling and removing links and posts that spread false information surrounding the election, YouTube says it  allows people to discuss the outcome of the election and processes like vote counting, even if they do so in ways that spread unproven conspiracies or peddle false or misleading claims. YouTube claims it counteracts the spread of such content by limiting how discoverable these videos are using search and its recommendation engine.\n  However, YouTube appears to be struggling with how to contain the spread of videos uploaded to its platform on other social networks like Facebook, where the videos often go viral too fast before either company is able to slow down their spread.\n In an example displaying the process by which YouTube helps amplify misinformation,   Vice reported on a false claim alleging that RealClearPolitics had rescinded its Pennsylvania call in favor of Biden, which was then circulated by Trump lawyer Rudy Giuliani until right-wing YouTube channel The Next News Network published a video repeating the claim. The video was then circulated on Facebook mainly through links posted to private groups, which makes it hard for Facebook moderators to clamp down on its spread. All the while, The Next News Network is racking up views and even selling merchandise under the video, revenue cuts of which go to YouTube,  Vice reports.\n YouTube says it’s using an election panel pinned to the top of election-related searches pointing users toward its Google webpage with verified election results. It’s also removing advertising from certain videos that undermine “confidence in elections with demonstrably false information,”  according to  The New York Times, but YouTube is not removing the videos outright.", "posttime": "2020-11-13 19:03:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "youtube,视频,videos", "title": "YouTube为放弃选举虚假信息视频的选择进行了辩护，称这样的视频“没有以任何突出的方式浮出水面或得到推荐”", "title_en": "YouTube defends choice to leave up election misinformation videos, saying such videos are “not being surfaced or recommended in any prominent way”", "transed": 1, "url": "https://www.theverge.com/2020/11/12/21562910/youtube-2020-election-trump-misinformation-fake-news-recommendations?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["youtube", "视频", "videos"]}, {"category": "", "categoryclass": "", "imagename": "9d1320a1ea6cb95ae24f77f491c18a11.jpg", "infoid": 1034854, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "迪士尼+今天报道称，截至9月底，迪士尼+的订户已达7370万。这比上一季度增长了1620万，当时他们报告称，到2020年6月第三季度末，他们的订户达到5750万，但截至8月3日，订户为6050万。\n在财报电话会议上，他们宣布，在迪士尼+、Hulu和ESPN+上，他们现在拥有超过1.2亿的流媒体订阅。\n迪士尼分享说，大部分增长来自迪士尼+Hotstar，它是印度IPL板球比赛的独家总部。迪士尼+Hotstar现在占迪士尼+订户的25%多一点，这意味着印度以外的订户约有5500万。\n今年4月，迪士尼宣布，在印度和八个西欧国家推出后，该公司在全球的付费订户已超过5000万。\n在4月份的5000万订户中，大约有4200万是印度以外的订户。\n今年9月，在影院仍在关门的情况下，迪士尼以29.99美元的价格发行了名为《花木兰》(Premier Access)的《花木兰》。它们还在葡萄牙、比利时和北欧国家推出。就在两周前，迪士尼在10月30日迎来了他们的热门剧集《曼达洛人》(The Mandalorian)的回归。\n今年10月，竞争对手Netflix宣布，到2020年第三季度，他们的全球订户达到1.9515亿，其中美国和加拿大的订户超过7300万。然而，该公司本季度在全球仅增加了220万部(而去年同期为680万部)，这是该公司所说的“我们创纪录的上半年业绩和拉动效应”的结果。\n几周前，HBO和HBO Max公布了截至2020年第三季度的3800万订阅用户，比上一季度增加了170万。孔雀没有透露订户，自7月份上线以来，该公司宣布注册了2200万人。\n圣诞节当天，迪士尼+将首映皮克斯的《灵魂》(Soul)，该片将跳过影院上映，但与花木兰不同的是，它不会向订阅者收取额外费用。然后，在1月15日，他们宣布将推出漫威原创系列WandaVision。", "note_en": "Disney+ reported today that they have now reached 73.7 million subscribers at the end of September. This is a 16.2 million climb from last quarter, when they reported they reached 57.5 million subscribers at the end of the third quarter in June 2020, but were at 60.5 million subscribers as of August 3rd.\n On their earnings call, they announced that across Disney+,  Hulu, and  ESPN+, they now have more than 120 million streaming subscriptions.\n Disney shared that most of the growth came from Disney+ Hotstar, which is the exclusive home of IPL cricket matches in India. Disney+ Hotstar now makes up just over 25% of Disney+ subscribers, meaning that there are ~55 million outside of India.\n In April, Disney announced the company had surpassed 50 million paid subscribers globally, following their launch in India and eight Western European countries.\n Of the 50 million subscribers in April, approximately 42 million of those were outside of India.\n In September, with theaters still closed, Disney  released “Mulan” as a “Premier Access” offering for $29.99. They also launched in Portugal, Belgium, and the Nordics. Just two weeks ago, Disney saw the return of their hit show “The Mandalorian” on October 30th.\n In October, competing service  Netflix announced they reached 195.15 million global subscribers in Q3 2020, with over 73 million in U.S. and Canada. However, the company added just 2.2 million worldwide this quarter (compared to 6.8 million in the same quarter last year), as a result of what the company says is “our record first half result and the pull-toward effect.”\n A few weeks ago, HBO and HBO Max  announced 38 million subscribers as of Q3 2020, up 1.7 million from last quarter. Peacock, which hasn’t disclosed subscribers,  announced 22 million sign-ups since launch in July.\n On Christmas Day, Disney+ will premiere Pixar’s “Soul”, which will skip theaters, but unlike Mulan will be no extra charge for subscribers. Then, on January 15th, they  announced they will debut the Marvel original series, WandaVision.", "posttime": "2020-11-13 19:03:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "月底,subscribers,迪士尼", "title": "迪士尼表示，截至9月底，迪士尼+的付费用户超过7300万，高于6月底的5750万和8月初的6050万", "title_en": "Disney says Disney+ had 73M+ paid subscribers at the end of September, up from 57.5M at end of June and 60.5M in early August", "transed": 1, "url": "https://thestreamable.com/news/disney-plus-hits-73-million-subscribers-as-they-reach-their-one-year-anniversary", "via": "", "real_tags": ["月底", "迪士尼"]}]