[{"category": "", "categoryclass": "", "imagename": "6a9f3376a78af12d6299201baa15b86f.jpg", "infoid": 1068297, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我喜欢建立东西，但我什么都不知道让人们使用它们。我是如何建造并在24hourhomepage.com建造和长大的实验...... ", "note_en": "I like building things but I know nothing about getting people to use them.Here is how I built and grew 24hourhomepage.com as an experiment in strengthening ...", "posttime": "2021-06-26 03:26:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "销售,sales,建立", "title": "10k小时？ 86,400秒，销售和营销作为一个SWE ", "title_en": "10K hours? 86,400 seconds to get better at sales and marketing as a SWE", "transed": 1, "url": "https://www.youtube.com/watch?v=v8WFZ4b7s4Y", "via": "", "real_tags": ["销售", "sales", "建立"]}, {"category": "", "categoryclass": "", "imagename": "0f1023bb19fad4888d38b9ccfb0f7f14.jpg", "infoid": 1068296, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您可能已经试图削减塑料使用量，因为材料不会生物降解，它可以污染数百年的地球。但是还有一个可能留下的原因。\n   一项新的研究发现，塑料在整个生命周期中释放了更多毒性化学物质，而不是以前认为，对人类和地球构成重大风险。到目前为止，只有少数这些化学品进行了妥善研究。但新文发表在环境科学＆amp杂志上;技术为塑料提供最全面的化学品数据库，并提供了一种可怕的材料，只有如何有害。\n 由瑞士大学Eth苏黎世的生态系统设计教授LED，由Stefanie Hellweg领导的研究人员在他们学习的塑料中确定了10,500个化学物质。该团队花了两年半，研究了各种各样的塑料制品，使用科学，监管和行业数据库来确定其中包含的所有化学品。然后，他们用科学数据库交叉引用这些化学品，该数据库确定了化学品是否有害，良性，或不充分研究。\n 在这些化学品中，大约2,480季度 - 是“潜在关注的物质”，这意味着有一些证据表明它们有害。在一些情况下，已知化学物质对水生寿命，癌症引起或损害特定器官有毒。在其他方面，化学物质可以积聚在人类和动物中，导致随着时间的推移等内存损耗等问题。\n   该研究的主要作者和Eth苏黎世的博士生威伯林格表示，即使小剂量也可能有害的至少1,000名被认为的化学品。 “如果某些东西是一种致癌物，它就在科学界同意的是，没有安全的曝光程度，”她告诉快速公司。 “即使在非常低的水平下，这些也可以导致癌症，显然[它]高剂量变得更糟。对于内分泌破坏剂，小剂量可能是有问题的。用这些化学品，使用任何一个问题是一个问题。“\n 研究人员无法妥善分类39％-4,100-化学品，因为没有明确的证据是是否危险。科学家同意的塑料中有许多成分不害处，但本研究表明，有许多刚刚研究的化学物质。 “我们的研究旨在轻推科学界致力于研究这些化学品的更多资源，”威伯格说。 “到目前为止，科学家们专注于塑料中有限数量的危险化学品，但我们不知道很多。”\n 塑料是我们周围的。每年全球生产超过3.5亿公吨，增加了数十亿美元的公吨，这是堵塞我们的垃圾填埋场和海洋。有害化学品发现的研究人员在我们每天使用的许多塑料物体中发现，包括玩具，医疗设备，面具，食品包装和纺织品。 \n他们也最终侵犯了我们的生态系统，在那里他们可以伤害人和动物。一些塑料最终在海洋中，海洋动物将它们误认为食物，最终成为人类食物链的一部分。化学品也可以在回收过程中释放，这意味着它们可以使再生塑料不安全。\n 那么为什么塑料如此卡纸用化学品包装？塑料是一种廉价物质，可以将几乎任何材料转化为您可以想象的材料，从丝绸的合成织物到坚固的家具。为了创造这些不同的材料，工厂使用添加剂来给予塑料，使其所需的性质，例如抗氧化剂，以防止降解，阻燃剂和增塑剂减少脆性。在生产中，催化剂，溶剂和其他化学物质用于帮助加工材料。\n 研究人员已知一些这些化学品是危险的。美国消费者产品安全委员会关于邻苯二甲酸酯（使材料更加灵活）的研究发现，它们引起哮喘，乳腺癌，2型糖尿病，繁殖健康的破坏，以及其他健康问题的扭转。环境保护署还确定家具，房屋粉尘和室内空气中发现的溴化阻燃剂与儿童的激素中断和发育问题有关。但这种最新研究确定了塑料中的其他化学品，研究人员没有足够的重视。已知一种常用作为着色剂中溶剂的丙醇可以造成对生殖系统的损害。已知一种用于控制聚合的苯会导致皮肤敏感性和水生寿命。\n  甚至监管机构也没有跟踪这些化学品。完整的53％的化学品的研究人员在美国，欧洲联盟或日本没有监管。事实上，已知有901种具有危险的化学物质实际上被批准用于与这些地区的食物接触。\n 研究人员所说的问题是，没有一个中央数据库，提供有关这些不同化学品的所有信息及其潜在风险的信息。实际上，研究人员通过190个公开的数据来源花了两年半，以弄清楚是什么构成了潜在关注的物质。塑料行业缺乏缺乏透明度，这些化学品进入其产品。在研究中，研究人员呼吁监管机构强迫塑料制造商，以披露其产品中的所有成分。\n 什么是消费者要做的？我们可以尽可能选择有机材料，但几乎不可能完全从我们的生活中消除塑料。现代世界与塑料饱和，从我们的木材家具上的涂料到填充我们壁橱的衣服上的衣服上的衣服。对于威伯格，ONU是在公司上更好地跟踪和消除这些化学品。\n  “通过选择正确的塑料，要求消费者负责将消费者负责保持环境的压倒性负担，”威伯格说。 “这是一个需要由行业和监管机构解决的问题，而不是由消费者自己解决。但每个公民可以做的是，从生产塑料的公司需要更多的透明度。“ ", "note_en": "You may already be trying to cut down on your plastic usage because the material doesn’t biodegrade and it can pollute the planet for hundreds of years. But there’s another reason you might want to stay away.\n   A  new study finds that plastics release many more toxic chemicals throughout their life cycle than previously thought, posing significant risks to both people and the planet. Until now, only a small number of these chemicals have been properly studied. But the new paper published in the journal  Environmental Science &amp; Technology provides the most comprehensive database of chemicals in plastic, and offers a terrifying look into just how harmful the material may be.\n The team of researchers, led by Stefanie Hellweg, a professor of ecological systems design at the Swiss university ETH Zurich, identified a whopping 10,500 chemicals in the plastics they studied. The team spent two and a half years studying a wide variety of plastic products, using scientific, regulatory, and industry databases to identify all the chemicals contained within them. They then cross-referenced these chemicals with scientific databases that identified whether the chemicals were hazardous, benign, or not adequately studied.\n Of these chemicals, about a quarter—2,480—were “substances of potential concern,” which means there is some evidence to indicate they are harmful. In some cases, the chemicals are known to be toxic to aquatic life, cancer-causing, or damaging to specific organs. In others, the chemicals can accumulate in humans and animals, causing problems such as memory loss over time.\n   Helene Wiesinger, lead author of the study and a doctoral student at ETH Zurich, says that at least 1,000 of the chemicals identified as substances of concern can be harmful even in small doses. “If something is a carcinogen, it is agreed upon in the scientific community that there is no safe level of exposure,” she tells  Fast Company. “Even at very low levels, these can lead to cancer, and obviously [it] gets worse with high doses. With endocrine disruptors, small doses can be problematic. With these chemicals, using any at all is a problem.”\n The researchers could not properly categorize a further 39%—4,100—of the chemicals, because there is no clear evidence about whether or not they are hazardous. There are many ingredients in plastic that scientists agree are not harmful, but this study reveals that there are many chemicals that have just not been adequately studied. “Our research was designed to nudge the scientific community to devote more resources to studying these chemicals,” Wiesinger says. “So far, scientists have focused on a limited number of dangerous chemicals in plastic, but there’s a lot we don’t know.”\n Plastics are all around us. More than 350 million metric tonnes are produced worldwide every year, adding to the billions of metric tonnes that are clogging up our landfills and oceans. The harmful chemicals the researchers identified were found in many plastic objects we use everyday, including toys, medical devices, masks, food packaging, and textiles.\n  They also eventually invade our ecosystems, where they can harm both people and animals. Some plastics end up in the ocean, where sea animals mistake them for food, and eventually become part of the human food chain. Chemicals can also be released in recycling processes, which means they can make recycled plastic unsafe.\n So why are plastics so jam-packed with chemicals? Plastic is a cheap substance that can be transformed into almost any material you can imagine, from silk-like synthetic fabrics to sturdy furniture. To create these different materials, factories use additives to give the plastic its desired properties, such as antioxidants to prevent degradation, flame retardants, and plasticizers to reduce brittleness. During production, catalysts, solvents, and other chemicals are used to help process the material.\n Researchers have known that some of these chemicals are dangerous. A study by the U.S. Consumer Product Safety Commission about  phthalates (which make materials more flexible) found that they cause asthma, breast cancer, type 2 diabetes, disruption to reproductive health, and a slew of other health problems. The Environmental Protection Agency also determined that  brominated flame retardants found on furniture, in house dust, and indoor air have been linked to hormone disruption and development problems in children. But this latest study identified other chemicals in plastics that researchers aren’t paying enough attention to. A propanol commonly used as a solvent in colorants is known to cause damage to the reproductive system. A benzene used in controlling polymerization is known to cause skin sensitivity and harm aquatic life.\n  Even regulators aren’t keeping track of these chemicals. A full 53% of chemicals the researchers identified as potentially concerning are not regulated in the United States, the European Union, or Japan. In fact, 901 chemicals known to be hazardous are actually approved for use in contact with food in these regions.\n A big part of the problem, the researchers say, is that there isn’t a central database that offers information about all of these different chemicals and their potential risks. Indeed, the researchers spent two and a half years combing through 190 publicly available data sources to figure out what constituted a substance of potential concern. There is also a lack of transparency in the plastics industry about the chemicals that go into their products. In the study, the researchers call on regulators to compel plastics manufacturers to disclose all the ingredients in their products.\n What’s a consumer to do? We can opt for organic materials whenever possible, but it is virtually impossible to eradicate plastic from our lives completely. The modern world is saturated with plastic, from the coatings on our wood furniture to the garments that fill our closets to the paints that cover our walls. To Wiesinger, the onus is on companies to better track and eliminate these chemicals.\n  “It’s an overwhelming burden to ask consumers to be responsible for keeping the environment they live in safe by choosing the right kinds of plastics,” Wiesinger says. “This is a problem that needs to be tackled by the industry and regulators, rather than by the consumers themselves. But what every citizen can do is demand more transparency from companies that produce plastic.”", "posttime": "2021-06-26 03:26:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "塑料,toxic", "title": "塑料比我们想象的要多得多 ", "title_en": "Plastic Is Far More Toxic than We Thought", "transed": 1, "url": "https://www.fastcompany.com/90649480/there-are-thousands-more-toxic-chemicals-in-plastic-than-we-thought", "via": "", "real_tags": ["塑料", "toxic"]}, {"category": "", "categoryclass": "", "imagename": "c0010da447b92de65ec662d91572294a.jpg", "infoid": 1068293, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近俄罗斯与英国的海军争端在黑海中可能涉及网络内人以及传统武器，发现了船舶跟踪数据的分析。  昨天，俄罗斯声称在英国皇家海军驱逐舰HMS后卫中解雇了“警告镜头”，虽然英国国防部否认任何镜头在后卫或船舶在这样的水域中被解雇。 事件 … ", "note_en": "The recent naval dispute between Russia and the UK in the Black Sea may have involved a cyberattack as well as conventional weaponry, an analysis of vessel tracking data has found.\n Yesterday, Russia claimed to have fired “ warning shots” at the UK Royal Navy destroyer HMS Defender for being inside “Russian waters”, although the UK Ministry of Defence  denies any shots were fired at the Defender or that the ship was in such waters. The event …", "posttime": "2021-06-26 03:25:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "俄罗斯,cyberattack,船舶", "title": "GPS Cyberattack错误地放置了俄罗斯海军基地附近的英国军舰 ", "title_en": "GPS cyberattack falsely placed UK warship near Russian naval base", "transed": 1, "url": "https://www.newscientist.com/article/2282149-gps-cyberattack-falsely-placed-uk-warship-near-russian-naval-base/", "via": "", "real_tags": ["俄罗斯", "船舶"]}, {"category": "", "categoryclass": "", "imagename": "23783096ddc3a7a4a9941dd656f1fec5.jpeg", "infoid": 1068292, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Microsoft股东提出了一项规定，该公司认真考虑使其产品更易于修复。当您播种时，专门从事股东宣传的非营利性，周四举行了股东决议。\n  根据你播种的，对微软股东非常重要，因为丢弃的电子产品正在摧毁世界的环境，微软已经承诺帮助它停止。\n    “微软是承诺采取实质性行动以减少气候排放的企业领袖;然而，我公司积极限制消费者对设备的可修复性，通过未能认识到电子可持续性的基本原则，破坏了我们的可持续性承诺：整体设备环境影响主要由其有用寿命的长度“股东”。决议说。\n  微软表示，在2020年博客文章中，它将投资气候创新并消除单用塑料，但维修一直很安静。\n  “微软将自己作为气候和环境的领导者，但通过限制消费者的可追溯性，”凯莉麦克巴斯，废物计划协调员在播种时表示，促进其设备的过早填埋，在新闻稿中表示。 “对可持续性和缓解有限资源提取的可持续性和缓解压力，通过促进广泛的修复，公司必须延长其设备的使用寿命。”\n    2020年，微软声称它将是2030年的碳中性公司。麦克比说，为了做到这一点，它必须制造其设备更容易修复。 “对于微软来说，在2030年之前真实地追求其承诺的碳负数，它必须使消费者更容易修复他们的设备而不是购买新的设备，”她在新闻稿中说。 “重要的第一步将是考虑公众提供维修工具，零件和指示的公司，作为本决议和现行联邦立法概述。”\n  股东决议要求董事会“以合理的成本和省略专有信息编写报告，以便制定公司设备的环境和社会效益，这些设备更容易被消费者和独立维修店修理。” \n股东希望本报告评估我们更容易获得的“为我们的产品提供指示，零件和/或工具的福利或危害”以及“潜在状态和联邦立法的影响，要求所有电子公司改善维修和可修复性。 “  股东决议介绍了美国房屋提交的国家权威立法的紧跟，并在纽约州参议院清除了类似的法律。 现在，全国各州的一半以上正在考虑某种形式的法律，这将使人们更容易解决自己的东西。 随着运动的构建，公司将不得不改变他们做生意的方式。 该股东解决方案是正确方向的另一步。 ", "note_en": "Microsoft shareholders have   filed a resolution demanding the company seriously consider making its products easier to repair. As You Sow, a non-profit that specializes in shareholder advocacy, delivered the shareholder resolution on Thursday.\n  According to   As You Sow, the right-to-repair is important to Microsoft’s shareholders because discarded electronics are destroying the   world’s environment, and Microsoft has   pledged to help it stop.\n    “Microsoft is a corporate leader in pledging to take substantial action to reduce climate emissions; yet our Company actively restricts consumer access to device repairability, undermining our sustainability commitments by failing to recognize a fundamental principle of electronics sustainability: that overall device environmental impact is principally determined by the length of its useful lifetime,” the shareholders&#39;   resolution said.\n  In a 2020   blog post, Microsoft said it will invest in climate innovation and eliminate single-use plastics, but it’s been quiet about repair.\n  “Microsoft positions itself as a leader on climate and the environment, yet facilitates premature landfilling of its devices by restricting consumer access to device reparability,” Kelly McBee, waste program coordinator for As You Sow, said in a   press release. “To take genuine action on sustainability and ease pressure on extraction of limited resources including precious metals, the company must extend the useful life of its devices by facilitating widespread access to repair.”\n    In 2020, Microsoft claimed it would be a carbon neutral company by 2030. McBee said that, in order to do that, it would have to manufacture its devices to be more easily repaired. “For Microsoft to authentically pursue its commitment to be carbon negative by 2030, it must make it easier for consumers to repair their device than to buy a new one,” she said in the   press release. “An important first step will be the company considering the public provision of repair tools, parts, and instructions, as this resolution and current federal legislation outline.”\n  The shareholder resolution is demanding that the Board “prepare a report, at reasonable cost and omitting proprietary information, on the environmental and social benefits of making Company devices more easily repairable by consumers and independent repair shops.”\n  Shareholders want this report to assess the “benefits or harms of making instructions, parts, and/or tools for our products more readily available” and “the impact of potential state and federal legislation that requires all electronics companies to improve repair access and repairability.”\n  The shareholder resolution comes on the heels of the national right-to-repair legislation filed in the   U.S. house and a similar law clearing the New York   state senate. More than half the states in the country are now considering some form of a law that would make it easier for people to fix their own stuff. As the movement builds, companies will have to change the way they do business. This shareholder resolution is another step in the right direction.", "posttime": "2021-06-26 02:48:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "微软,microsoft,股东,shareholders,设备", "title": "微软的股东需求正确维修 - 计算机巨头的股东要求调查如何建立更可持续的世界。 ", "title_en": "Microsoft’s Shareholders Demand Right-to-Repair - The computer giant’s shareholders are demanding it investigate how right-to-repair can build a more sustainable world.", "transed": 1, "url": "https://www.vice.com/en/article/g5gd53/microsofts-shareholders-demand-right-to-repair", "via": "", "real_tags": ["微软", "microsoft", "股东", "设备"]}, {"category": "", "categoryclass": "", "imagename": "3d55e6449247f3f4094fde1185ce2e34.jpg", "infoid": 1068291, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周我们有许多条目，旨在识别或确认机器学习系统中的偏见或作弊行为，或支持它们的数据中的失败。但首先是华盛顿大学的纯粹视觉上吸引人的项目在计算机愿景和模式识别会议上展示。\n 他们培训了一个系统，识别和预测照片中的水，云，烟雾和其他流体特征的流动，从单个静止图像动画。结果非常酷：\n  为什么？好吧，对于一件事，摄影的未来是代码，更好的相机了解他们所指出的世界，他们可以容纳或重新创造它。假河流不需要高，但准确地预测运动和常见照片特征的行为是。\n 在创建和应用程序的创建和应用中回答任何机器学习系统的重要问题是它是否实际上正在执行你想要的东西。 “ai”的历史与模型的例子串行，发现一种看起来像他们在没有实际做的事情的情况下表演任务 - 就像一个孩子在他们应该清洁房间时踢在床下的一切。\n 这是医学领域的一个严重问题，其中一个伪造它可能会产生可怕的后果。还有一个研究，也来自UW，发现文献中提出的模型有趋势，研究人员称之为“快捷学习”。这些快捷方式可能很简单 - 基于患者人口统计数据的风险，而不是图像中的数据，例如 - 或者更独特，例如依赖于医院的条件，其数据来自，使其无法概括到其他。\n 该团队发现，在与他们的培训不同的数据集上使用时，许多模型基本失败。他们希望机器学习透明度的进步（打开“黑匣子”）将使这些系统拖动规则时更容易。 ", "note_en": "This week we have a number of entries aimed at identifying or confirming bias or cheating behaviors in machine learning systems, or failures in the data that support them. But first a purely  visually appealing project from the University of Washington being presented at the Conference on Computer Vision and Pattern Recognition.\n They trained a system that recognizes and predicts the flow of water, clouds, smoke and other fluid features in photos, animating them from a single still image. The result is quite cool:\n  Why, though? Well, for one thing,  the future of photography is code, and the better our cameras understand the world they’re pointed at, the better they can accommodate or recreate it. Fake river flow isn’t in high demand, but accurately predicting movement and the behavior of common photo features is.\n An important question to answer in the creation and application of any machine learning system is whether it’s actually doing the thing you want it to. The history of “AI” is riddled with examples of models that found a way to look like they’re performing a task without actually doing it — sort of like a kid kicking everything under the bed when they’re supposed to clean their room.\n This is a serious problem in the medical field, where a system that’s faking it could have dire consequences.  And a study, also from UW, finds models proposed in the literature have a tendency to do this, in what the researchers call “shortcut learning.” These shortcuts could be simple — basing an X-ray’s risk on the patient’s demographics rather than the data in the image, for instance — or more unique, like relying heavily on conditions in the hospital its data is from, making it impossible to generalize to others.\n The team found that many models basically failed when used on datasets that differed from their training ones. They hope that advances in machine learning transparency (opening the “black box”) will make it easier to tell when these systems are skirting the rules.", "posttime": "2021-06-26 02:48:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "深渊,science,发现", "title": "深受深渊：保持AI诚实的医学，气候科学和愿景 ", "title_en": "\n\t\t\t\tDeep Science: Keeping AI honest in medicine, climate science and vision\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/25/deep-science-keeping-ai-honest-in-medicine-climate-science-and-vision/", "via": "", "real_tags": ["深渊", "science", "发现"]}, {"category": "", "categoryclass": "", "imagename": "f2ef4629753a22cae5db412f8f8aaaa7.jpg", "infoid": 1068289, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据美国官员的说法，美国情报界准备的高度预期的UFO报告预计将于周五向国会委员会提交国会委员会，但官员告诉ABC新闻该报告不会为美国报告的数十个遭遇提供明确的解释军事有身份不明的空中现象，或者UAP。\n 在一个发展中令我们希望报告可能已经找到了与外星宇宙飞船的联系的令人失望的UFO爱好者，该报告据三位官员表示，该报告尚未发现任何证据表明与该等理论的任何联系。\n  由国会通过去年年底通过的情报授权法案要求国家情报（DNI）编写的报告。美国情报界约有180天，以制定关于美国政府关于UAP的内容的未分类和分类报告。\n   该报告，A根据美国官员的说法，可以预期概述可能或可能表明可能的解释的一些可能的场景。\n 如果报告的未分类版本将公开，但由于分类要求，仍然不明确，但由于分类要求将不公开。\n   近年来美国军事人员报告的数十名UAP事件的审查并没有发现任何证据表明他们与外星航天器相关联，也不是在多年来解释美国军事飞行员在遭遇中遇到的遇到的态度一位美国官员说。\n  其中一名官员告诉ABC消息，即涉及UAP的一些事件，例如作为天气气球或大气条件，但无法解释许多其他事件。 \n第四个官员表示，调查人员还规定了与任何秘密美国军事技术，或所谓的＆＃34有关的可能性。＆＃34;  五角大楼一直向DNI提交了关于即将到来的报告的问题，注意办事处正在准备该报告，选择不评论尚未完成的报告。 ", "note_en": "A highly anticipated UFO report prepared by the U.S. intelligence community is expected to be presented to congressional committees on Friday, according to a U.S. official, but officials have told ABC News the  report will not provide definitive explanations for the dozens of encounters reported by the U.S. military with unidentified aerial phenomena, or UAPs.\n And in a development certain to disappoint UFO enthusiasts who have hoped that the report may have found links to alien spacecraft, the report has not found any evidence to suggest any links to such theories, according to three officials.\n  The report prepared by the Director of National Intelligence (DNI) was required by the Intelligence Authorization Act passed by Congress late last year. The U.S. intelligence community was given 180 days to prepare an unclassified and classified report on what the U.S. government knew about UAP&#39;s.\n   The report, a according to a U.S. official, can be expected to outline some possible scenarios that might or could indicate possible explanations for UAPs.\n It remains unclear if the unclassified version of the report will be made public, but due to classification requirements the classified version will not be made public.\n   The review of dozens of UAP incidents reported by U.S. military personnel in recent years did not find any evidence to suggest they are linked to alien spacecraft, nor are they in a position to explain what has been reported by U.S. military pilots in encounters over the years, three U.S. officials said.\n  One of the officials told ABC News that some of the dozens of incidents involving UAPs were able to be explained, for example as weather balloons or as atmospheric conditions, but many other incidents could not be explained.\n A fourth official said that investigators have also ruled out the possibility that UAPs are related to any secret U.S. military technology, or so-called &#34;black programs.&#34;\n The Pentagon has consistently referred questions about the upcoming report to the DNI, noting that office was preparing the report, choosing not to comment on a report not yet completed.", "posttime": "2021-06-26 02:42:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "预期,anticipated,报告", "title": "高度预期的UFO报告预计将于今天以后提交给国会 ", "title_en": "Highly Anticipated UFO Report Expected To Be Presented To Congress Later Today", "transed": 1, "url": "https://abcnews.go.com/Politics/highly-anticipated-ufo-report-expected-presented-congress-friday/story?id=78486423", "via": "", "real_tags": ["预期", "报告"]}, {"category": "", "categoryclass": "", "imagename": "0aee342873d689ef1bfa8defc6ec7c48.png", "infoid": 1068287, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "C＃了您所知，但使用Go-Inspired工具，可以在框中产生小型，自我和本机可执行文件。\n $ echo＆＃39; system.console.writeline（＆＃34;你好世界＆＃34;）; ＆＃39; ＆gt; hello.cs $ bflat build hello.cs $ ./hello hello world $ bflat build hello.cs -os：windows $ file ./hello.exe hello.exe：pe32 +可执行（控制台）x86-64，适用于MS Windows\n  BFLAT是罗斯林的混合物 - ＆＃34;官方＆＃34; C＃编译器，用于生成.NET可执行文件 - 和NAÉECORERT） - 基于Coreclr＆＃39; s crossgen2的时间编译器前提前的实验。由于此，您可以使用高性能Coreclr GC和本机代码生成器（Ryujit）访问最新的C＃功能。\n BFLAT将两个组件在一起将两个组件融合到时间交叉杂志和运行时为C＃。\n   它可以生成本机可执行文件，或通过FFI从其他语言调用的本机共享库。\n  查看此次储存的“版本”选项卡，然后下载与主机系统匹配的编译器。这些都是交叉口杂志，可以针对任何支持的OSS /架构。\n 将存档解压缩到一个方便的位置，并将根添加到路径中。所有＆＃39;重新设置。有关耦合样本的示例目录。 \n源代码位于相应的ROSLYN / NativeAOS存储库中。我＆＃39;虽然没有准备好人看到（或接受拉杆的拉出请求）。如果你认为BFLAT很有用，你可以把尖端留在我的提示罐中，并在一个注释中包含你的github用户名，以便我可以在i＆＃39准备时向您提供私人回购。\n    默认情况下，BFLAT会产生2 MB和3 MB的可执行文件，即使是最简单的应用程序也是如此。有多种原因：\n BFLAT包括关于所有已编译方法的堆栈跟踪数据，以便它可以打印漂亮的异常堆栈迹线\n 即使是最简单的应用程序可能最终会调用反射（至e.g.获取OutofMemoryException类的名称），全球化等。\n ＆＃34;更大＆＃34;为友好性和便利选择默认值。要获得更紧密地匹配低级编程语言的经验，请指定 - 不反映，--no-stacktrace-data， - 全球化和 -  nf-exception-messages的参数到bflat构建。\n  使用系统。诊断;使用静态系统。安慰;写道（$＆＃34; nullreferenceException消息是：{new nullreferenceException（）。消息}＆＃34;）;写道（$＆＃34; int的运行时类型名为：{typeof（int）}＆＃34;）;写道（$＆＃34;盒装整数的类型是{（123.Gettype（）== typeof（int）？＆＃34;＆＃34;：＆＃34;不是＆＃34;）}等于typeof（ int）＆＃34;）;写入线（$＆＃34;盒装整数的类型是{（123. gettype（）== typeof（byte）？＆＃34;＆＃34;：＆＃34;不是＆＃34;）}等于typeof（字节）＆＃34;）;写道（$＆＃34;大写＆＃39;Вторник＆＃39;＆＃39; {＆＃34;Вторник＆＃34; toupper（）}＆＃39;＆＃34;）;写道（$＆＃34;当前堆栈帧是{new stacktrace（）。GetFrame（0）}＆＃34;）;\n  nullReferenceException消息是：对象引用未设置为对象的实例。int的运行时类型名为：system.int32type框整数等于typeof（int）盒装整数的类型不等于typeof（字节）大写＆＃39;Вторник＆＃39;是＆＃39;Вторник＆＃39;当前堆栈帧是＆lt; program＆gt; $。＆lt; main＆gt; $（String []）+ 0x154在文件中的偏移量340：line：列＆lt;文件名未知＆gt;：0：0 \nnullReferenceException消息是：arg_nullreferenceException int的运行时类型为命名：zetperva：0x00048bd0type框整数等于typeof（int）盒式整数的类型不等于Typeof（字节）大写的大写字母和＃39;Вторник＆＃39;是＆＃39;Вторник＆＃39;当前堆栈帧是MS！＆lt; baseaeaddress＆gt; + 0xb82d4在文件中的偏移量340：line：列＆lt;文件名未知＆gt;：0：0\n 所有选项打开，可以舒适地舒适地符合1 MB以下的有用程序。上面的程序在撰写本文时为735 kB。输出可执行文件是任何其他的可执行文件。您可以使用像UPX这样的工具进一步压缩（到〜300 KB范围）。\n 如果您＆＃39;在类似UNIX的系统上，您可能希望运行Strip工具以从可执行文件中删除调试信息。 Windows将调试信息放在单独的PDB文件中，不需要条带。\n  除了命令行提供的预处理器定义外，BFLAT还定义了几个其他符号：BFLAT（始终定义），调试（未优化时定义），Windows / Linux / MacOS（当目标是目标时），x86 / x64 / ARM / ARM64（当相应的架构是针对性的时）。\n  使用bflat调试与任何其他本机代码相同的应用程序。在您喜欢的调试器（Linux上的GDB或LLDB或Windows上的Visual Studio或Windbg上）启动生成的可执行文件和您＆＃39; ll能够设置断点，步骤并查看本地变量。\n  michalstrehovsky / bflat＃3  - 依赖libssl don＆＃39; t上Linux的工作 - 这包括很多加密。我们需要静态链接到libssl，但框架代码非常适合那个。需要一点工作。\n Michalstrehovsky / Bflat＃3  - 全球化在Linux上无条件禁用 - 我们需要与ICU链接。需要一点工作。 \nmichalstrehovsky / bflat＃4  - 无Linux主机BFLAT编译器。 这是来自Libssl的突出终止的退缩。 显然C＃编译器坚持计算文件的SHA Hashes，我们需要一个工作libssl。 ", "note_en": "C# as you know it but with Go-inspired tooling that produces small, selfcontained, and native executables out of the box.\n $   echo   &#39;System.Console.WriteLine(&#34;Hello World&#34;); &#39;  &gt; hello.cs$  bflat build hello.cs$  ./hello Hello World$  bflat build hello.cs --os:windows$  file ./hello.exe hello.exe: PE32+ executable (console) x86-64, for MS Windows\n  bflat is a concoction of Roslyn - the &#34;official&#34; C# compiler that produces .NET executables - and NativeAOT (née CoreRT) - the experimental ahead of time compiler for .NET based on CoreCLR&#39;s crossgen2. Thanks to this, you get access to the latest C# features using the high performance CoreCLR GC and native code generator (RyuJIT).\n bflat merges the two components together into a single ahead of time crosscompiler and runtime for C#.\n   It can either produce native executables, or native shared libraries that can be called from other languages through FFI.\n  Look at the  Releases tab of this repo and download a compiler that matches your host system. These are all crosscompilers and can target any of the supported OSes/architectures.\n Unzip the archive to a convenient location and add the root to your PATH. You&#39;re all set. See the samples directory for a couple samples.\n    The source code is in the respective Roslyn/NativeAOT repositories. I&#39;m not ready for people to see (or to accept pull requests) things that are specific to bflat. If you think bflat is useful, you can leave me a tip in my  tip jar and include your GitHub user name in a note so that I can give you access to a private repo when I&#39;m ready.\n    By default, bflat produces executables that are between 2 MB and 3 MB in size, even for the simplest apps. There are multiple reasons for this:\n bflat includes stack trace data about all compiled methods so that it can print pretty exception stack traces\n even the simplest apps might end up calling into reflection (to e.g. get the name of the  OutOfMemoryException class), globalization, etc.\n The &#34;bigger&#34; defaults are chosen for friendliness and convenience. To get an experience that more closely matches low level programming languages, specify  --no-reflection,  --no-stacktrace-data,  --no-globalization, and  --no-exception-messages arguments to  bflat build.\n  using  System. Diagnostics; using  static  System. Console; WriteLine(  $&#34;NullReferenceException message is: { new  NullReferenceException(). Message} &#34;); WriteLine(  $&#34;The runtime type of int is named: { typeof( int)} &#34;); WriteLine(  $&#34;Type of boxed integer is{( 123. GetType()  ==  typeof( int)  ?   &#34; &#34;  :   &#34; not &#34;)} equal to typeof(int) &#34;); WriteLine(  $&#34;Type of boxed integer is{( 123. GetType()  ==  typeof( byte)  ?   &#34; &#34;  :   &#34; not &#34;)} equal to typeof(byte) &#34;); WriteLine(  $&#34;Upper case of &#39;Вторник&#39; is &#39;{  &#34;Вторник &#34;. ToUpper()}&#39; &#34;); WriteLine(  $&#34;Current stack frame is { new  StackTrace(). GetFrame( 0)} &#34;);\n  NullReferenceException message is: Object reference not set to an instance of an object.The runtime type of int is named: System.Int32Type of boxed integer is equal to typeof(int)Type of boxed integer is not equal to typeof(byte)Upper case of &#39;Вторник&#39; is &#39;ВТОРНИК&#39;Current stack frame is &lt;Program&gt;$.&lt;Main&gt;$(String[]) + 0x154 at offset 340 in file:line:column &lt;filename unknown&gt;:0:0\n  NullReferenceException message is: Arg_NullReferenceExceptionThe runtime type of int is named: EETypeRva:0x00048BD0Type of boxed integer is equal to typeof(int)Type of boxed integer is not equal to typeof(byte)Upper case of &#39;Вторник&#39; is &#39;Вторник&#39;Current stack frame is ms!&lt;BaseAddress&gt;+0xb82d4 at offset 340 in file:line:column &lt;filename unknown&gt;:0:0\n With all options turned on, one can comfortably fit useful programs under 1 MB. The above program is 735 kB on Windows at the time of writing this. The output executables are executables like any other. You can use a tool like UPX to compress them further (to ~300 kB range).\n If you&#39;re on a Unix-like system, you might want to run  strip tool to remove debug information from the executable. Windows places the debug information in a separate PDB file and  strip is not needed.\n  Besides the preprocessor definitions provided at the command line, bflat defines several other symbols:  BFLAT (defined always),  DEBUG (defined when not optimizing),  WINDOWS/ LINUX/ MACOS (when the corresponding operating system is the target),  X86/ X64/ ARM/ ARM64 (when the corresponding architecture is targeted).\n  Apps compiled with bflat debug same as any other native code. Launch the produced executable under your favorite debugger (gdb or lldb on Linux, or Visual Studio or WinDbg on Windows) and you&#39;ll be able to set breakpoints, step, and see local variables.\n  MichalStrehovsky/bflat#3 - Things that depend on libssl don&#39;t work on Linux - this includes a lot of crypto. We need to link to libssl statically but the framework code is structured very much against that. Needs a bit work.\n MichalStrehovsky/bflat#3 - Globalization is uncondionally disabled on Linux - we need to link with ICU. Needs a bit work.\n MichalStrehovsky/bflat#4 - No Linux host of the bflat compiler. This is unforunate fallout from libssl. Apparently the C# compiler insists on calculating SHA hashes of files and we need a working libssl for that.", "posttime": "2021-06-26 02:40:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "c#,本机,tooling,bflat", "title": "C＃，如您所知，但使用Go样的工具（小型，自信，本机Exes） ", "title_en": "C# as you know it but with Go-like tooling (small, selfcontained, native exes)", "transed": 1, "url": "https://github.com/MichalStrehovsky/bflat", "via": "", "real_tags": ["c#", "本机", "tooling", "bflat"]}, {"category": "", "categoryclass": "", "imagename": "8d48e269eed2485c58b12e4edc610f03.jpg", "infoid": 1068286, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "卫生部长证实，所有国内限制，如面具要求，限制公共集会，打开时间限制，将被取消。\n 经过近16个月的各种限制，冰岛达成了那些可能被称为历史的地步。近90％的居民接受至少一剂的巢穴疫苗，170.000个完全接种疫苗，可能是可能的。\n  7月1日关于该国进入该国的规则也将放松。那些可以呈现完全疫苗接种或以前的Covid-19感染的人将免于PCR测试要求。同样适用于2005年及以后出生的儿童。完全接种疫苗的人被认为是在旅行前两周收到第二周的人，以及接受Janssen疫苗的时间一周。\n 另一方面，那些没有接种疫苗的人将不得不提出阴性PCR测试，在边界进行测试，在隔离中花5天，并显示第二次测试的负面结果。\n 这些边界规则设定为7月1日至8月15日的有效期。 ", "note_en": "Minister of Health confirmed that all domestic restrictions, such as masks requirement, limit on public gatherings, restrictions of opening hours, will be abolished.\n After nearly 16 months of various restrictions, Iceland reached a point where those may be called a history. With nearly 90% of residents who received at least one dose of a COVID vaccine, and 170.000 fully vaccinated, such measures are possible.\n  On the 1st of July rules on the entry to the country will also be relaxed. Those who can present a confirmation of full vaccination, or of a previous COVID-19 infection, will be exempt from PCR test requirement. Same applies to children born in 2005 and later. Fully vaccinated are considered those who received a second does not later than two weeks before travel, and one week for those receiving Janssen vaccine.\n On the other hand, those who have not been vaccinated will have to present a negative PCR test, undergo testing at the borders, spend 5 days in quarantine and show a negative result of a second test.\n Those border rules are set to be valid from 1st of July until 15th of August.", "posttime": "2021-06-26 02:40:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "限制,covid,测试", "title": "所有国内Covid限制在冰岛举起 ", "title_en": "All domestic Covid restrictions lifted in Iceland", "transed": 1, "url": "https://www.ruv.is/frett/2021/06/25/big-announcement-relaxation-of-domestic-restrictions", "via": "", "real_tags": ["限制", "covid", "测试"]}, {"category": "", "categoryclass": "", "imagename": "124b9b499c63f7db9922330a92ab0a85.png", "infoid": 1068285, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据FCC文件周五公布的，载体正在准备基于Amazon＆＃39; alexa语音助理的智能显示器。\n  具有型号LVD1的设备，具有8英寸1280×800像素显示器，并配有4GB的RAM和16GB的内部存储器。除了Wi-Fi和蓝牙之外，它还支持4G连接，这应该使其在没有Wi-Fi的情况下操作它 - 它将与现有智能显示器分开的东西。\n  显示屏具有一款前置摄像头，可以使用硬件快门禁用，并包含在文件中的手册表明它支持Verizon＆＃39; s bluejeans视频会议服务。手册不包括智能显示器的任何图像＆＃39; s用户界面，但它提到它由Amazon＆＃39; S Alexa Assistant提供支持。\n消费者能够用唤醒词短语，＆＃34查询该助手;嗨Verizon。＆＃34;这意味着Verizon正在参加亚马逊＆＃39; alexa自定义助理程序。该计划于1月宣布，该计划允许公司为自己的设备有效地进行白色标签Alexa。除了自定义唤醒词外，公司还可以使用该程序释放仅在自己的设备上提供的技能。 ", "note_en": "The carrier is getting ready to sell a smart display based on Amazon&#39;s Alexa voice assistant, according to  FCC filings published Friday.\n  The device, which bears the model name LVD1, features an 8-inch 1280×800 pixel display, and comes with 4GB of RAM and 16GB of internal storage. In addition to Wi-Fi and Bluetooth, it also supports 4G connectivity, which should make it possible to operate it without Wi-Fi — something that would set the device apart from existing smart displays.\n  The display has a front-facing camera that can be disabled with a hardware shutter, and a manual included in the filings suggest that it supports Verizon&#39;s BlueJeans video-conferencing service. The manual does not include any images of the smart display&#39;s user interface, but it mentions that it is being powered by Amazon&#39;s Alexa assistant.\nConsumers will be able to query that assistant with the wake word phrase, &#34;Hi Verizon.&#34; This means that Verizon is taking part in Amazon&#39;s Alexa Custom Assistant program.  Announced in January, the program allows companies to effectively white-label Alexa for their own devices. In addition to custom wake words, companies can also use the program to release skills that are only available on their own devices.", "posttime": "2021-06-26 01:58:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,自定义,custom,显示器", "title": "FCC备案显示Verizon的8英寸1280×800智能显示器，带有4G连接和自定义“Hi Verizon”唤醒词，作为Alexa自定义助手程序的一部分 ", "title_en": "FCC filings reveal Verizon's 8-inch 1280×800 smart display with 4G connectivity and a custom “Hi Verizon” wake word, as part of Alexa Custom Assistant program", "transed": 1, "url": "https://www.protocol.com/bulletins/verizon-smart-display-alexa", "via": "", "real_tags": ["程序", "自定义", "custom", "显示器"]}, {"category": "", "categoryclass": "", "imagename": "2f916a83c476df47cda9457635b4e8a5.jpg", "infoid": 1068283, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一年龙澳大利亚人口研究发现，组织雇用的全职工作人员未能优先考虑其员工＆＃39;心理健康有三倍增加被诊断患有抑郁症的风险。\n  研究人员发现，虽然长时间工作长时间是从心血管疾病中死亡或中风的危险因素，但贫困的管理措施对抑郁症具有更大的抑郁风险。\n  南澳大利亚大学在今天的英国医学期刊上发表的学习，由UNISA＆＃39; SCENTIONocial Safety Mational Deventory，世界探索工作场所心理健康和安全性的第一个研究平台领导。\n  心理社会安全气候（PSC）是用于描述保护工人＆＃39的管理实践和沟通和参与系统的术语;心理健康和安全。\n  领导作者艾米·萨德罗博士表示，差的工作场所心理健康可以追溯到差的管理实践，优先事项和价值观，然后流入高工作需求和低资源。\n  ＆＃34;证据表明，未能奖励或承认员工努力工作的公司对工人施加不合理的要求，并没有给予他们的自主权，使其员工更大的抑郁风险，＆＃34; Zadow博士说。\n  国际知名的工作场所心理健康专家，玛卢斯·莫拉德教授玛卢斯·莫加尔德（Maureen Dollard）表示，这项研究发现，虽然热情和忠诚的工人受到重视，但长时间工作会导致抑郁症。如果他们的工作场所对他们的心理健康有所关注，男人也更有可能变得沮丧。 \n由于全球抑郁症负担，这影响全世界的300万人，并且尽管有可用的治疗，但仍然没有贬低的迹象，现在正在为运作良好的工作环境支付更多的关注，这可能会有助于问题。\n  高水平的倦怠和工作场所欺凌也与公司＆＃39联系;未能支持工人＆＃39;精神健康。\n  本月早些时候在欧洲工作和组织心理学杂志上公布的第二份文件，发现低PSC是欺凌和情绪疲惫的重要预测因素。\n  ＆＃34;与员工和工会缺乏磋商，在工作场所健康和安全问题，以及对压力预防的几乎没有支持，与公司的低PSC相关联。\n  ＆＃34;我们还发现在工作单位中欺凌行为不仅会对受害者产生负面影响，而且犯罪者和团队成员也可以证明这种行为。同一个单位中的每个人都没有常见，因为结果是经历倦怠。\n  ＆＃34;在这项研究中，我们在组背景下调查了欺凌，以及它发生的原因。有时压力是欺凌和最糟糕的情况下，它可以设置一个＆＃39;可接受的＆＃39;团队其他成员的行为程度。但最重要的是，所有欺凌都可以从公司的承诺预测到心理健康的承诺，因此可以防止它，＆＃34;折腾专业说。\n  工作场所欺凌和工人倦怠的全球成本都是显着的，表现出缺勤，工作差，压力休假和生产力低。 \n问题的程度是在2019年承认的，国际劳工组织（国际劳工组织）在未来工作和呼吁＆＃34致电的全球委员会;一种以人为本的方法，将人员和他们在中心所做的工作 经济和社会政策和商业实践＆＃34;  ＆＃34;这项研究的实际意义是远远达到的。 高水平的工人倦怠对组织和它来说是非常昂贵的，而且清楚地区＆＃39;首先，需要顶级组织变革来解决问题，＆＃34; 折腾专业说。  免责声明：AAAS和Eurekalert！ 对于发布给EurekAlert的新闻发布的准确性，不对责任！ 通过赋予机构或通过eurekalert系统使用任何信息。 ", "note_en": "A year-long Australian population study has found that full time workers employed by organisations that fail to prioritise their employees&#39; mental health have a threefold increased risk of being diagnosed with depression.\n  And while working long hours is a risk factor for dying from cardiovascular disease or having a stroke, poor management practices pose a greater risk for depression, the researchers found.\n  The University of South Australia study, published in the  British Medical Journal today, is led by UniSA&#39;s Psychosocial Safety Climate Observatory, the world&#39;s first research platform exploring workplace psychological health and safety.\n  Psychosocial safety climate (PSC) is the term used to describe management practices and communication and participation systems that protect workers&#39; mental health and safety.\n  Lead author, Dr Amy Zadow, says that poor workplace mental health can be traced back to poor management practices, priorities and values, which then flows through to high job demands and low resources.\n  &#34;Evidence shows that companies who fail to reward or acknowledge their employees for hard work, impose unreasonable demands on workers, and do not give them autonomy, are placing their staff at a much greater risk of depression,&#34; says Dr Zadow.\n  Internationally renowned expert on workplace mental health, ARC Laureate Professor Maureen Dollard, says the study found that while enthusiastic and committed workers are valued, working long hours can lead to depression. Men are also more likely to become depressed if their workplace pays scant attention to their psychological health.\n  Due to the global burden of depression, which affects an estimated 300 million people worldwide and shows no sign of abating despite available treatments, more attention is now being paid to poorly functioning work environments which could contribute to the problem.\n  High levels of burnout and workplace bullying are also linked to corporations&#39; failure to support workers&#39; mental health.\n  A second paper co-authored by Professor Dollard and published in the  European Journal of Work and Organizational Psychology earlier this month, found that low PSC was an important predictor of bullying and emotional exhaustion.\n  &#34;Lack of consultation with employees and unions over workplace health and safety issues, and little support for stress prevention, is linked to low PSC in companies.\n  &#34;We also found that bullying in a work unit can not only negatively affect the victim, but also the perpetrator and team members who witness that behaviour. It is not uncommon for everyone in the same unit to experience burnout as a result.\n  &#34;In this study we investigated bullying in a group context and why it occurs. Sometimes stress is a trigger for bullying and in the worst cases it can set an &#39;acceptable&#39; level of behaviour for other members of the team. But above all bullying can be predicted from a company&#39;s commitment to mental health, so it can be prevented,&#34; Prof Dollard says.\n  The global costs of workplace bullying and worker burnout are significant, manifested in absenteeism, poor work engagement, stress leave and low productivity.\n  The extent of the problem was recognised in 2019 with the International Labour Organization (ILO) implementing a Global Commission on the Future of Work and calling for &#34;a human-centred approach, putting people and the work they do at the centre of economic and social policy and business practice&#34;.\n  &#34;The practical implications of this research are far reaching. High levels of worker burnout are extremely costly to organisations and it&#39;s clear that top-level organisational change is needed to address the issue,&#34; Prof Dollard says.\n  Disclaimer: AAAS and EurekAlert! are not responsible for the accuracy of news releases posted to EurekAlert! by contributing institutions or for the use of any information through the EurekAlert system.", "posttime": "2021-06-26 01:57:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "workplaces", "title": "有毒工作场所增加了300％的抑郁风险 ", "title_en": "Toxic workplaces increase risk of depression by 300%", "transed": 1, "url": "https://www.eurekalert.org/pub_releases/2021-06/uosa-twi062221.php", "via": "", "real_tags": []}, {"category": "", "categoryclass": "", "imagename": "e46e8b29842d84203a82086fc7d34633.jpg", "infoid": 1068280, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "道歉，前3分钟内有一个粉碎的粉丝。 它变得更好了！ ", "note_en": "Apologies that there's a fan blowing on the mic for the first 3 minutes. It gets better!", "posttime": "2021-06-26 01:56:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "job,粉碎", "title": "你的工作没有宣传（2017） ", "title_en": "Your Job Is Not Advertised (2017)", "transed": 1, "url": "https://www.youtube.com/watch?v=AqbfYxBEQyY", "via": "", "real_tags": ["job", "粉碎"]}, {"category": "", "categoryclass": "", "imagename": "2654e0a537295a50e703dec4b52f0e59.jpg", "infoid": 1068279, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "她说，在一个世纪前的回应促使介入医学的兴起 - 通过手术或药物治疗疾病，只有在症状表现出来。如今，介入医学是西方医疗保健中的主要心态。而且，梅尔顿，卫生科技初创公司的领先投资者，包括Livongo，Tia和Calibrate，说护理途径很好。\n “我们社会发生了什么？慢性病，慢性疼痛，糖尿病和肥胖，“她说。 “这不需要魔药，而且没有手术。通常，有治疗组件，行为变化和可移动的接触点。“\n 进入个性化医学。狂欢而强大的框架在硅谷初创公司中越来越受欢迎。它是一种递送系统，其中患者接受更加全面的整体护理，以考虑多种症状或共同生命。例如，在荷尔蒙健康中，个性化医学可以增加更多的数据和特异性，患有某人的避孕，而不是通常的试验过程。基本上，它与介入医学相反。\n “我们不只是一条胳膊或腿，我们不仅仅是肥胖或糖尿病或疼痛患者，”梅尔顿说。 “我们如何将你视为一个整个人？”\n 许多公司正在使用这种方法来重新注意肌肉骨骼（MSK）病症和慢性疼痛的患者。这些条件通常用上瘾的阿片类药物治疗，这是一个主要的公共卫生问题。据估计，5000万美国人患有慢性疼痛，企业家正在研究不像饼干现状的解决方案。金钱市场肯定存在：2017年，全球MSK医疗市场价值为574亿美元;慢性疼痛市场与MSK医学重叠，预计将于2030年达到1517亿美元的价值。\n “常时不是新的想法，它与允许指数变化的一刻延时混淆了许多因素，”这使得启动工作“，”梅尔顿说，在MSK医学中的繁荣和最近的活动。今天，我们将专注于三项初创公司采取不同的方法，以帮助患有慢性疼痛和联系相关条件的人：清除，Peerwell和铰链健康。\n  Avi Dorfman表示，将指导到消费者是治疗慢性疼痛的最有效的方法，所以他创立了清算。数字健康初创公司与来自哈佛，John Hopkins和NYC医院的医生和研究人员的医疗咨询委员会，为特殊的手术制作了一个可爱的无面型解决方案，让人们陷入困境。 \n上个月，清算由Bessemer和创始人基金筹集了2000万美元的种子轮。 梅尔顿还代表门槛投资。  清算提供四种产品：处方复合霜，包括FDA批准的成分，CBD霜，用于局部不适，营养保健品，补充联合健康，以及预先记录，在家庭锻炼目录。 它目前可用于加利福尼亚州，佛罗里达州，格鲁吉亚，伊利诺伊州，纽约，北卡罗来纳州，俄亥俄州，宾夕法尼亚州，田纳西州和德克萨斯州的患者。 ", "note_en": "She says the response just over a century ago prompted the rise of interventional medicine — treating illness through surgery or medicine only after symptoms manifest. Today, interventional medicine is the dominant mindset in Western healthcare. And, Melton, a lead investor in health tech startups including Livongo, Tia, and Calibrate, says the care pathway ages well.\n “What’s happening in our society? Chronic diseases, chronic pain, diabetes, and obesity,” she said. “That doesn’t require a magic pill and there’s not just a surgery. Oftentimes, there’s therapeutic components, behavior changes, and movable touchpoints.”\n Enter personalized medicine. The buzzy yet powerful framing is growing in popularity among Silicon Valley startups. It’s a delivery system in which patients receive more holistic care that takes into account multiple symptoms or co-morbidities. In hormonal health, for example,  personalized medicine could add more data and specificity to which birth control someone takes, instead of the usual process of trial and error. Essentially, it’s the opposite of interventional medicine.\n “We’re not just an arm or a leg, we’re not just obese or a diabetic or a pain sufferer,” Melton said. “How do we treat you as a whole person?”\n A number of companies are using this approach to reinvent care for patients with musculoskeletal (MSK) medical conditions and chronic pain. These conditions are commonly treated with addictive opioids, a major public health concern. As an estimated 50 million Americans suffer from chronic pain, entrepreneurs are working on solutions that don’t resemble the cookie-cutter status quo. And the money market is certainly there: in 2017, the global MSK medical market  was valued at $57.4 billion; the market for chronic pain, which overlaps with MSK medicine, is expected to  hit $151.7 billion in value by 2030.\n “Oftentimes it’s not new ideas, it’s conflating a number of factors that come together at one moment in time that allow exponential change,” that makes a startup work,” Melton said, of the boom and recent activity in MSK medicine. Today, we’ll focus on three startups taking different approaches to help people suffering from chronic pain and MSK-related conditions: Clearing, Peerwell, and Hinge Health.\n  Avi Dorfman says going direct to consumers is the most effective way to treat chronic pain, so he founded  Clearing. The digital health startup worked with a medical advisory board of physicians and researchers from Harvard, John Hopkins, and NYC’s Hospital for Special Surgery to create an opioid-free solution for people struggling with pain.\n Last month, Clearing raised a $20 million seed round led by Bessemer and Founders Fund. Melton also invested in the round on behalf of Threshold.\n Clearing offers four products: prescription compound cream that includes FDA-approved ingredients, CBD cream for topical discomfort, nutraceuticals to supplement joint health, and a directory of pre-recorded, at-home exercises. It currently is available to patients in California, Florida, Georgia, Illinois, New York, North Carolina, Ohio, Pennsylvania, Tennessee and Texas.", "posttime": "2021-06-26 01:20:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "骨骼,medical,医学", "title": "肌肉骨骼医学初创公司进入个性化健康技术市场 ", "title_en": "\n\t\t\t\tMusculoskeletal medical startups race to enter personalized health tech market\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/25/musculoskeletal-medical-startups-race-to-enter-personalized-healthtech-market/", "via": "", "real_tags": ["骨骼", "medical", "医学"]}, {"category": "", "categoryclass": "", "imagename": "58c1369cf5da636bb58740d2fc141c8e.jpg", "infoid": 1068278, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "基于伦敦的公司将自己描述为“Crypto基础设施公司”，旨在通过其“数字资产支付网关”为企业制造区块链。具体而言，它汇总了各种支付解决方案，并为企业提供了菲亚特和加密付款和支出。\n 更简单地说，Mercuryo旨在使用加密货币作为推进举措的工具，以便在下一步跨境转移或使其成为允许任何企业成为Fintech公司，而无需跟上其并发症。“\n  “对企业的快速和高效的国际支付的需要与以往任何一致，”佩尔朗托·联合创始人兼首席执行官佩特尔·科兹亚科夫说。虽然没有跨境支付公司的公司不足，但是启动强调加密是一种差异化因素。\n “我们的团队通过促进廉价和简单的交易使加密普遍提供了明确的计划，”Kozyakov说。 “然后可以使用加密货币来处理全球资金转移，大规模支出，并促进在其他事项中获取服务。”\n Mercuryo在2019年初开始船上客户，并且在4月份超过5000万美元的年度经常性收入（Arr）以来，已经看到了令人印象深刻的增长。其客户群正在接近100万，公司拥有伙伴关系，其中一些大型加密玩家，包括二明团，Bitfinex，Trezor，信任钱包，壁虎和横布。 2020年，该公司表示，其营业额飙升了50次，而税率营业额在2021年4月越过25亿美元。\n 为了构建这种势头，Mercuryo已经开始扩大到包括美国在内的新市场，在此，今年早些时候推出了所有国家的B2B客户的加密支付。它还计划“逐步”扩展到非洲，南美洲和东南亚。\n 目标全球LED Mercuryo的A系列A，其中还包括一群天使投资者的参与，并带来了自2018年成立以来以超过1000万美元的成立以来提出的初创公司的总数。 \n该公司计划利用其新资本推出加密货币借记卡（直接从钱包的加密平衡中全球支出），并继续扩大到新市场，如拉丁美洲和亚太地区。\n Mercuryo的各种产品包括带内置的加密交换和数字资产购买功能，小部件和大批量加密货币获取和OTC服务的多币钱包。\n Kozyakov表示，该公司不收取货币转换，并没有其他“隐藏费”。\n “我们为合作伙伴及其客户启用即时和轻松的跨境交易，”他说。 “此外，缺款服务缺乏中介机构，不需要额外的步骤来完成交易。相反，该过程仅缩小到两个操作：在收到资金时发送转移和加密到菲亚特转换时，菲亚特到加密交换。“\n Mercuryo还提供Crypto SaaS产品，为客户提供通过其菲亚特账户购买加密的方式，同时将数字资产管理委托给公司。\n “无论是虚拟账户还是第三方客户钱包，公司都处理银行大多数相关的加密货币流程，因此他们可以更多地关注其核心运营，”Kozyakov说。\n Mike Lobanov，Target Global的联合创始人表示，作为一个实验，他的公司测试了许多购买比特币的解决方案。 \n“做我们的勤奋，我们测量了”时间来加密“ - 去App商店需要多长时间，直到数字资产到达钱包之前，”他说。  根据洛巴托夫的说法，Mercuryo先到了6分钟，包括来自KYC和获得加密货币的资金的一切。  “第二次最佳结果是20分钟，而一些应用程序将永远采取处理我们的交易，”他补充道。 “这家公司是该领域的一个游戏变更者，自早期以来，我们很高兴成为他们的支持者。”  展望未来，启动计划释放一个产品，这些产品将为业务提供一种方式，以便同时向多个客户和演出工人发送即时批量支付，无论接收者所在吗？ ", "note_en": "The London-based company describes itself as “a crypto infrastructure company” that aims to make blockchain useful for businesses via its “digital asset payment gateway.” Specifically, it aggregates various payment solutions and provides fiat and crypto payments and payouts for businesses.\n Put more simply,  Mercuryo aims to use  cryptocurrencies as a tool for putting in motion next-gen cross-border transfers or as it puts it,  “to allow any business to become a fintech company without the need to keep up with its complications.”\n  “The need for fast and efficient international payments, especially for businesses, is as relevant as ever,” said Petr Kozyakov, Mercuryo’s co-founder and CEO. While there is no shortage of companies enabling cross-border payments, the startup’s emphasis on crypto is a differentiator.\n “Our team has a clear plan on making crypto universally available by enabling cheap and straightforward transactions,” Kozyakov said. “Cryptocurrency assets can then be used to process global money transfers, mass payouts and facilitate acquiring services, among other things.”\n Mercuryo began onboarding customers at the beginning of 2019, and has seen impressive growth since with annual recurring revenue (ARR) in April surpassing over $50 million. Its customer base is approaching 1 million, and the company has partnerships with a number of large crypto players including Binance, Bitfinex, Trezor, Trust Wallet, Bithumb and Bybit.  In 2020, the company said its turnover spiked by 50 times while run-rate turnover crossed $2.5 billion in April 2021.\n To build on that momentum, Mercuryo has begun expanding to new markets, including the United States, where it launched its crypto payments offering for B2B customers in all states earlier this year. It also plans to “gradually” expand to Africa, South America and Southeast Asia.\n Target Global led Mercuryo’s Series A, which also included  participation from a group of angel investors and brings the startup’s total raised since its 2018 inception to over $10 million.\n  The company plans to use its new capital to launch a  cryptocurrency debit card (spending globally directly from the crypto balance in the wallet) and continuing to expand to new markets, such as Latin America and Asia-Pacific.\n Mercuryo’s various products include a multicurrency wallet with a built-in crypto exchange and digital asset purchasing functionality, a widget and high-volume cryptocurrency acquiring and OTC services.\n Kozyakov says the company doesn’t charge for currency conversion and has no other “hidden fees.”\n “We enable instant and easy cross-border transactions for our partners and their customers,” he said. “Also, the money transfer services lack intermediaries and require no additional steps to finalize transactions. Instead, the process narrows down to only two operations: a fiat-to-crypto exchange when sending a transfer and a crypto-to-fiat conversion when receiving funds.”\n Mercuryo also offers crypto SaaS products, giving customers a way to buy crypto via their fiat accounts while delegating digital asset management to the company.\n “Whether it be virtual accounts or third-party customer wallets, the company handles most cryptocurrency-related processes for banks, so they can focus more on their core operations,” Kozyakov said.\n Mike Lobanov, Target Global’s co-founder, said that as an experiment, his firm tested numerous solutions to buy Bitcoin.\n “Doing our diligence, we measured ‘time to crypto’ – how long it takes from going to the App Store and downloading the app until the digital assets arrive in the wallet,” he said.\n Mercuryo came first with 6 minutes, including everything from KYC and funding to getting the cryptocurrency, according to Lobanov.\n “The second-best result was 20 minutes, while some apps took forever to process our transaction,” he added. “This company is a game-changer in the field, and we are delighted to have been their supporters since the early days.”\n Looking ahead, the startup plans to release a product that will give businesses a way to send instant mass payments to multiple customers and gig workers simultaneously, no matter where the receiver is located.", "posttime": "2021-06-26 01:20:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "密码,跨境,payments", "title": "MercuySo在沿着50米的价格越过越过的密码跨境付款提高了7.5米 ", "title_en": "\n\t\t\t\tMercuryo raises $7.5M for crypto-focused cross-border payments after crossing $50M in ARR\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/25/mercuryo-raises-7-5m-for-crypto-focused-cross-border-payments-after-crossing-50m-in-arr/", "via": "", "real_tags": ["密码", "跨境", "payments"]}, {"category": "", "categoryclass": "", "imagename": "3c039aa2326c56d4766bba35777c9890.jpg", "infoid": 1068277, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "探险队植根于玻璃葡萄酒索德尔的评论，他在美国说丰富的种子资本允许创始人在筹集一系列A的筹码之前进行了很多工作，有效推迟这些轮。但是，在那些创始人提高了一个后，由于在早期的阶段交易中表现出了持续的公司，他们的第B轮迅速迅速地遵循普遍的公司。\n  与Seseri聊天后更多和一些其他风险资本家关于该概念，第二个动态出现了。即“典型的”早期资金循环，正如Seseri所描述的那样，是“成为非典型的，因为先发制人的循环[其中]对窗外的典型期望走出窗外。”\n  交易所探索初创公司，市场和金钱。每天早上都在额外的紧缩或每周六获得交换时事通讯。\n  Series，她说，在种子交易后，可能会在几个月后来，B型队伍看到预期的收入阈值，部分地点是“已经下跌的大型多资产球员，并提供不同的产品而不是典型的VCS的不同产品 - 非常快速的术语床单，没有积极参与投资后，大量投资数额和高估值。“\n 专注于系列动态，旧拇指的初步初步持续到每年重复收入（ARR）的达到100万美元，现在经常发生实际意义。有些初创公司延迟了他们的一轮，直到他们达到2亿美元的ARR，归功于足够的种子资本。\n 虽然有些初创公司延迟了他们的一轮，但其他人早些时候提高了危急投资，也许甚至在arr中的几十万。\n 两组之间有什么不同？具有“精英状态”的初创公司能够向他们的系列展开A，而其他创始人花更多的时间将充足的种子资本汇集在一起​​以获得足够的规模来吸引A. \n动态不仅仅是美国现象。双层风险投资市场也在拉丁美洲出现，这是一个全球重要的，迅速扩大的启动地区。 （例如，巴西Fintech Startup Nubank，只是关闭了7.5亿美元。）\n 今天早上，我们潜入拉丁美洲风险投资市场及其早期动态。我们还有关于欧洲现场的票据，因此在下周期待该主题更多。我们走吧！\n  巨型队不再是拉丁美洲的例外;事实上，他们已经成为一个趋势，在过去几个月里宣布了一系列的趋势。\n 该公告本身经常强调圆形规模：例如，近期1亿美元的B次转向哥伦比亚的Proptech启动Habi被宣传为“最大的Birts Bersted在哥伦比亚。”这遵循其他2021条记录，如“墨西哥最大的系列” - 在线杂货店jüsto为6500万美元 - 并“由拉丁美洲金融金属筹集的最大系列” -  4300万美元用于拉丁美洲的格子“Belvo。 ", "note_en": "The expedition was rooted in commentary from  Rudina Seseri of Glasswing Ventures, who said abundant seed capital in the United States allows founders to get a lot done before they raise a Series A, effectively delaying these rounds. But that after those founders did raise that A, their Series B round could rapidly follow thanks to later-stage money showing up in earlier-stage deals in hopes of snagging ownership in hot companies.\n  After chatting with Seseri more and a number of other venture capitalists about the concept, a second dynamic emerged. Namely that the “typical” early-stage funding round, as Seseri described it, was “becoming the atypical because of the rise of preemptive rounds [in which] typical expectations on metrics go out the window.”\n  The Exchange explores startups, markets and money.   Read it  every morning on Extra Crunch or get  The Exchange newsletter every Saturday.\n  Series As, she said, could come mere months after a seed deal, and Series B rounds were seeing expected revenue thresholds tumble in part to “large, multi-asset players that have come down market and are offering a different product than typical VCs — very fast term sheets, no active involvement post-investment, large investments amounts and high valuations.”\n Focusing on just the Series A dynamic, the old rule of thumb that a startup would need to reach $1 million in annual recurring revenue (ARR) is now often moot. Some startups are delaying their A rounds until they reach $2 million in ARR thanks to ample seed capital.\n While some startups delay their A rounds, others raise the critical investment earlier and earlier, perhaps with even a few hundred thousand in ARR.\n What’s different between the two groups? Startups with “elite status” are able to jump ahead to their Series A, while other founders spend more time cobbling together adequate seed capital to get to sufficient scale to attract an A.\n The dynamic is not merely a United States phenomenon. The two-tier venture capital market is also showing up in Latin America, a globally important and rapidly expanding startup region. (Brazilian fintech startup Nubank, for example,  just closed a $750 million round.)\n This morning, we’re diving into the Latin American venture capital market and its early-stage dynamics. We also have notes on the European scene, so expect more on the topic next week. Let’s go!\n  Mega-rounds are no longer an exception in Latin America; in fact, they have become a trend, with ever-larger rounds being announced over the last few months.\n The announcements themselves often emphasize round size: For instance, the recent $100 million Series B round into Colombian proptech startup Habi was  touted as “the largest Series B for a startup headquartered in Colombia.” This follows other 2021 records such as “the largest Series A for Mexico ” —  $65 million for online grocer Jüsto — and “the largest Series A ever raised by a Latin American fintech” —   $43 million for  “Plaid for Latin America” Belvo.", "posttime": "2021-06-26 01:20:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "风险投资,美国,venture,拉丁美洲", "title": "像美国一样，一个双层风险投资市场正在拉丁美洲出现 ", "title_en": "\n\t\t\t\tLike the US, a two-tier venture capital market is emerging in Latin America\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/25/like-the-us-a-two-tier-venture-capital-market-is-emerging-in-latin-america/", "via": "", "real_tags": ["风险投资", "美国", "venture", "拉丁美洲"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068276, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新消息警告结果，结果是“快速变化”，可能还不包括可靠的来源\n    谷歌在搜索可能具有较差结果的主题时，谷歌已启动警告用户，作为其努力解决搜索引擎上的“数据空白”的一部分。\n 新的警告是由Renee Diresta发现的，这是一个在斯坦福大学误导的学术界。 “它看起来像这些结果正在快速变化，”谷歌现在小心用户。 “如果这个主题是新的，它有时需要花时间以通过可靠的来源添加结果。”\n  “我第一次看到谷歌搜索的这种回复，”Diresta说。 “沟通某事的积极步骤是新闻/突破（我的搜索是为了打破文化战争故事），并突出这个事实并非所有已知或与发生的事情共识。”\n 虽然社交媒体经常与错误信息相关联，但研究人员长期以来一直注意到搜索引擎可以成为传播虚假的强大工具。数据空白，搜索引擎查询几乎没有结果，通常可能导致偏出过度的突出 - 打破新闻的特别关注。\n 在一个Blogpost，Danny Sullivan，谷歌搜索的公共联络人说：“我们已经训练过我们的系统来检测一个主题快速发展的话，尚未称重。我们现在将显示通知表示可以最好地回顾一下从更广泛的来源范围的信息。“\n 警告往往会出现有很多最近点击的搜索，但很少有信誉良好的网站。例如，最近关于在威尔士的不明飞行物瞄准的报告迅速在阴谋理论家中迅速传播，但没有少的主流关注。这意味着搜索“UFO 106英里/小时”术语短暂提出警告，Sullivan告诉Tech网站重新汇编。 \n“有人在威尔士释放出来的警察报告视频，它有一点点新闻报道。 但它仍然没有很多关于它的事情，“沙利文说。 “但是人们可能正在寻找它，他们可能会在社交媒体上进行解决 - 所以我们可以告诉它开始趋势。 我们也可以告诉那里的东西并没有很多必然的东西。 我们也认为可能是新的东西会出现。“ ", "note_en": "New message warns that results are ‘changing quickly’ and may not yet include reliable sources\n    Google has started warning users when they search for a topic that is likely to have poor results, as part of its effort to tackle “data voids” on the search engine.\n The new warning was spotted by  Renee DiResta, an academic who studies misinformation at Stanford University. “It looks like these results are changing quickly,” Google will now caution users. “If this topic is new, it can sometimes take time for results to be added by reliable sources.”\n  “First time I’ve seen this response from Google Search,” DiResta said. “Positive step to communicating that something is newsy/breaking (my search was for a breaking culture war story), and highlighting that facts are not all known or consensus on what happened is still being formed.”\n While social media is regularly linked with misinformation, researchers have long cautioned that search engines can be powerful tools for spreading falsehoods.  Data voids, search engine queries that have little to no results, can often lead to fringe claims being given undue prominence – a particular concern for breaking news.\n In a blogpost, Danny Sullivan, public liaison for search at Google, said: “We’ve trained our systems to detect when a topic is rapidly evolving and a range of sources hasn’t yet weighed in. We’ll now show a notice indicating that it may be best to check back later when more information from a wider range of sources might be available.”\n The warning tends to appear for searches with a lot of recent hits, but few from reputable sites. For instance, a recent report of a UFO sighting in Wales had spread rapidly among conspiracy theorists, but had little mainstream attention. That meant that a search for the terms “ufo 106 mph” briefly brought up the warning, Sullivan  told the tech site Recode.\n “Someone had gotten this police report video released out in Wales, and it’s had a little bit of press coverage. But there’s still not a lot about it,” Sullivan said. “But people are probably searching for it, they may be going around on social media – so we can tell it’s starting to trend. And we can also tell that there’s not a lot of necessarily great stuff that’s out there. And we also think that maybe new stuff will come along.”", "posttime": "2021-06-26 01:14:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,警告,starts,可能", "title": "如果搜索结果可能很差，谷歌开始警告用户 ", "title_en": "Google Starts Warning Users If Search Results Are Likely To Be Poor", "transed": 1, "url": "https://www.theguardian.com/technology/2021/jun/25/google-starts-warning-users-if-search-results-are-likely-to-be-poor", "via": "", "real_tags": ["google", "谷歌", "警告", "starts", "可能"]}]