[{"category": "", "categoryclass": "", "imagename": "d62f3c754e0578efee4d35fb94139b65.jpg", "infoid": 1069024, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这里的顶级功能是自适应降噪，它使用三个板载麦克风过滤掉高达 40 dB 的环境声音。该公司表示，该技术与更标准的主动降噪相比具有优势，后者提供了一定程度的过滤。耳机由一对 11 毫米动态驱动器供电，并支持杜比全景声 (Dolby Atmos)。总而言之，耳机的电池寿命长达 10 小时（无降噪），而外壳的电池寿命长达 38 小时（同上）。该外壳将使用第三方 Qi 垫为无线充电，或者系统可以在插入 10 分钟的情况下获得 10 小时的续航时间。 150 美元，它们比 AirPods 便宜 100 美元，尽管每个人在这里看到的数字几乎可以肯定99 美元的价格标签 没有宣布即将推出的 Ear (1) 耳机。然而，OnePlus 确实设法将其联合创始人的新公司击败了整整一周。巧合？你是法官。 （老实说，这可能是巧合，因为 Ear (1) 被推迟了，但我离题了。）价格标签使它们更直接地与最近宣布的 Beats Studio Buds 以及 Google 的 Pixel Buds 和三星的 Galaxy Buds Pro 保持一致——也就是说，在包中间的某个地方。在设计方面，它们看起来与 AirPods Pro 最相似，尽管金属杆从黑色或白色芽的底部弹出。我对公司的第一款完全无线的设备 OnePlus Buds 相当失望。值得公司称赞的是，它们的定价非常激进，为 70 美元，与原始 Nord 手机的发布保持一致。 OnePlus Buds Pro 将于 9 月 1 日抵达美国和加拿大。", "note_en": "The top-line feature here is adaptive noise canceling, which uses a trio of on-board mics to filter out ambient sound up to 40 dBs. The company says the tech compares favorably to more standard active noise cancelling, which offers a set level of filtering. The buds are powered by a pair of 11mm dynamic drivers, with support for Dolby Atmos.\n All told, battery life is up to 10 hours on the buds (sans noise cancelling) and 38 with the case (ditto). The case will charge wireless with third-party Qi pads, or the system can get 10 hours of life with 10 minutes plugged in.\n   At $150, they’re $100 cheaper than the AirPods, though the number everyone is looking at here is almost certainly the  $99 price tag Nothing announced for its upcoming Ear (1) buds. OnePlus did manage, however, to beat its co-founder’s new company to the punch by a full week.\n Coincidence? You be the judge. (Honestly, it’s probably a coincide, given that the Ear (1) were delayed, but I digress.)\n The price tag puts them more directly in line with the recently announced Beats Studio Buds, along with Google’s Pixel Buds and Samsung’s Galaxy Buds Pro — that is to say, somewhere in the middle of the pack. Design-wise, they appear most similar to the AirPods Pro, albeit with a metallic stem popping out from the bottom of the black or white buds.\n I was fairly underwhelmed by the company’s first fully wireless set,  the OnePlus Buds. To the company’s credit, they were extremely aggressively priced, at $70, in keeping with the release of the original Nord handset. The OnePlus Buds Pro will arrive in the U.S. and Canada on September 1.", "posttime": "2021-07-22 23:38:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推出,noise,buds", "title": "OnePlus 推出售价 150 美元的 Pro 降噪耳塞", "title_en": "\n\t\t\t\tOnePlus announces $150 Pro noise cancelling earbuds\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/oneplus-announces-150-pro-noise-cancelling-earbuds/", "via": "", "real_tags": ["推出", "noise", "buds"]}, {"category": "", "categoryclass": "", "imagename": "8c66d4be659a77e6aa6c148217e29639.jpg", "infoid": 1069023, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "马鲁尼知道她在说什么：在硅谷的整个过程中，她帮助 Salesforce、亚马逊、Facebook 等公司推出产品并维护消息传递。 2019 年，她离开 Facebook，担任技术传播副总裁，加入 Coatue Management 担任普通合伙人。演示文稿总结如下，并为可读性进行了轻微编辑。 Marooney 将她的方法分解为 RIBS 的首字母缩写词：相关性、必然性、可信性并保持简单。下面还嵌入了她的演示视​​频，其中包含 20 分钟的问答环节，她回答观众的问题并涵盖了很多领域。 Marooney 为 TechCrunch 撰写了大量关于这个主题的文章，包括这篇文章，她在其中详细描述了她的 RIBS 方法。上个月，她通过围绕打造汉堡包的上市策略扩展了这个话题。为什么有人要关心？有人关心吗？这就是马鲁尼在这里提出的观点。信息必须首先与受众相关。首先是为什么任何人都应该关心。重要的是要记住，作为一家初创公司，您正处于无人认识您的境地。没有人会想，“哦，我真的应该关心这个。因此，您需要非常具体地说明您的受众是谁，为什么他们应该关心以及为什么这对他们很重要。还早呢。相关性通常只针对很小的受众，而您每天都有权利扩大该受众。因此，例如，当我第一次与 Salesforce 合作时，销售人员的范围非常小，对于中小型企业来说，总有一种感觉，即它会成为各种规模公司的云提供商，但你必须从某个地方开始。当你从某个地方开始时，你可以描绘更大的图景。但是您必须具体说明对较小受众的好处。 (Timestamp: 1:48) 除了谈特斯拉，Marooney 还用了 Segway 的反例，这说明光有伟大的想法是不够的。尽管赛格威是作为一种改变世界的交通方式而推出的，但在 2021 年，赛格威主要只供商场警察和游客使用。", "note_en": "Marooney knows what she’s talking about: Throughout her time in Silicon Valley, she helped companies like Salesforce, Amazon, Facebook and more launch products and maintain messaging. In 2019, she left Facebook, where she was VP of technology communication, and joined Coatue Management as a general partner.\n The presentation is summarized below and lightly edited for readability. Marooney breaks down her method into the acronym of RIBS: Relevance, Inevitability, Believability and keeping it Simple. A video of her presentation is also embedded below and contains 20 minutes of Q&amp;A where she answers audience questions and covers a lot of ground.\n Marooney has  written extensively on this subject for TechCrunch, including  this article, where she describes her RIBS method in detail. Last month, she expanded on this topic with her  go-to-market strategy around building a hamburger.\n   Why should anyone care? Does anyone care? That’s the point Marooney is making here. The message must be relevant to the audience before anything else.\n The very first thing is why anyone should care. And it’s important to remember that as a startup, you’re in a situation where nobody knows you. And nobody thinks, “Oh, I should really care about this. So you need to be very specific about who your audiences are and why they should care and why it matters to them. Early on, too. Relevance is usually to a very small audience, and you earn the right every day to expand that audience.\n So, for example, when I was first working with Salesforce, it was a very narrow set of salespeople, for small- and medium-sized businesses, there was always the sense that it was going to be a cloud provider for companies of every size, but you have to start somewhere. And when you’re starting somewhere, you can paint the bigger picture. But you have to be specific about the benefits to your smaller audience.   (Timestamp: 1:48)\n  In addition to talking about Tesla, Marooney uses the counter-example of the Segway, which shows a great idea alone is not enough. Even though Segways were introduced as a world-changing mode of transportation, in 2021, Segways are mainly only used by mall cops and tourists.", "posttime": "2021-07-22 23:37:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "通信,valley", "title": "硅谷通信专家 Caryn Marooney 分享了如何确定叙事", "title_en": "\n\t\t\t\tSilicon Valley comms expert Caryn Marooney shares how to nail the narrative\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/silicon-valley-comms-expert-caryn-marooney-shares-how-to-nail-the-narrative/", "via": "", "real_tags": ["通信", "valley"]}, {"category": "", "categoryclass": "", "imagename": "8a1ad8536e31eaabdb99202fbcb69405.png", "infoid": 1069022, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "AlphaFold 蛋白质结构数据库是 DeepMind、欧洲生物信息学研究所和其他机构之间的合作，由数十万个蛋白质序列组成，其结构由 AlphaFold 预测——并且计划增加数百万个以创建“蛋白质年鉴”。世界。” DeepMind 创始人兼首席执行官 Demis Hassabis 表示：“我们相信，这项工作代表了人工智能迄今为止为推进科学知识水平所做的最重要贡献，并且是人工智能可以为社会带来的好处的一个很好的例子。”如果您一般不熟悉蛋白质组学——如果是这种情况，这很自然——考虑这一点的最佳方式可能是另一项重大工作：对人类基因组进行测序。您可能还记得 90 年代末和 00 年代初，这是全球众多科学家和组织多年来进行的一项巨大努力。最终完成的基因组有助于诊断和了解无数疾病，并有助于开发药物和治疗方法。然而，这只是该领域工作的开始——就像完成一个巨大拼图的所有边缘部分。那些年每个人都将目光投向的下一个重大项目之一是了解人类蛋白质组——也就是说，人体使用的所有蛋白质并编码到基因组中。蛋白质组的问题在于它要复杂得多。蛋白质，如 DNA，是已知分子的序列；在 DNA 中，这些是少数熟悉的碱基（腺嘌呤、鸟嘌呤等），但在蛋白质中，它们是 20 个氨基酸（每个氨基酸由基因中的多个碱基编码）。这本身就造成了更多的复杂性，但这只是开始。这些序列不是简单的“代码”，而是实际上扭曲并折叠成微小的分子折纸机器，在我们体内完成各种任务。这就像从二进制代码转变为一种在现实世界中显示对象的复杂语言。实际上，这意味着蛋白质组不仅由 20,000 个序列组成，每个序列都有数百个酸，而且这些序列中的每一个都具有物理结构和功能。理解它们最难的部分之一是弄清楚给定序列形成了什么形状。这通常是使用 X 射线晶体学之类的实验来完成的，这是一个漫长而复杂的过程，可能需要数月或更长时间才能找出单个蛋白质——如果您碰巧拥有最好的实验室和技术可供您使用。结构也可以通过计算来预测，尽管这个过程从来没有足够好到实际依赖——直到 AlphaFold 出现。没有深入研究计算蛋白质组学的整个历史（尽管我很想），我们基本上从 15 年前的分布式蛮力策略开始——还记得 Folding@home 吗？ - 在过去十年中更加磨练的过程。然后基于人工智能的方法出现了，在 2019 年引起了轰动，当时 DeepMind 的 AlphaFold 超越了世界上所有其他系统——然后在 2020 年又一次飞跃，达到了足够高和足够可靠的准确度水平，这促使一些专家宣布了这个问题将任意序列转换为已解决的 3D 结构。\n我只是将这段漫长的历史压缩成一段，因为当时它被广泛覆盖，但很难夸大这一进展是多么突然和完整。几十年来，这个问题一直困扰着世界上最优秀的人才，它从“我们可能有一种有效的方法，但速度极其缓慢且成本高昂”到“准确、可靠，并且可以在关闭的情况下完成”。架式计算机”在一年的时间里。 DeepMind 进展的具体细节以及它是如何实现这些进展的，我将留给计算生物学和蛋白质组学领域的专家，他们无疑将在未来几个月和几年内对这项工作进行分解和迭代。今天我们关注的是实际结果，因为该公司利用自 AlphaFold 2（2020 年显示的版本）发布以来的时间，不仅调整模型，而且运行它......在他们可以获得的每一个蛋白质序列上。结果是人类蛋白质组的 98.5% 现在被“折叠”，正如他们所说，这意味着有一个预测结构，人工智能模型有足够的信心（重要的是，我们对它的信心有足够的信心）代表真实的东西。哦，他们还折叠了 20 种其他生物的蛋白质组，如酵母和大肠杆菌，总计约 350,000 个蛋白质结构。到目前为止，它是这个绝对重要信息的最大和最好的集合——按数量级计算。所有这些都将作为一个可自由浏览的数据库提供，任何研究人员都可以简单地将序列或蛋白质名称插入其中，并立即获得 3D 结构。该过程和数据库的详细信息可以在今天发表在《自然》杂志上的一篇论文中找到。 Hassabis 在接受 TechCrunch 采访时说：“明天你将看到的数据库，它是一个搜索栏，几乎就像谷歌搜索蛋白质结构一样。”你可以在 3D 可视化器中查看它，放大它，询问基因序列……使用 EMBL-EBI 进行的好处是它与所有其他数据库相关联。所以你可以立即去查看相关基因，它与所有其他数据库相关联，你可以看到相关基因，与其他生物体相关，其他具有相关功能的蛋白质，等等。” “作为一名科学家，研究一种几乎深不可测的蛋白质，”EMBL-EBI 的 Edith Heard 说（她没有具体说明是什么蛋白质），“知道你可以找出蛋白质的商业目的是什么真的很令人兴奋现在，在如此短的时间内——这将需要数年时间。因此，能够访问该结构并说“啊哈，这是业务端”，然后您就可以专注于尝试弄清楚该业务端的作用。而且我认为这正在逐步加速科学发展，有点像几十年前能够对基因组进行测序。”能够做到这一点的想法非常新颖，Hassabis 说他完全期望整个领域发生变化——并随之改变数据库。\n“结构生物学家还不习惯这样的想法，即他们可以在几秒钟内查找任何东西，而不是花费数年时间来实验确定这些东西，”他说。 “而且我认为这应该会带来全新的方法来解决可以提出的问题和可以进行的实验。一旦我们开始了解这一点，我们可能会开始构建其他工具来满足这种偶然性：如果我想查看以特定方式相关的 10,000 种蛋白质怎么办？没有真正的正常方法可以做到这一点，因为这不是目前任何人都会问的正常问题。所以我想我们将不得不开始生产新工具，一旦我们开始看到人们如何与之互动，就会有这种需求。”这包括软件本身的衍生版本和增量改进版本，这些版本已经以开源方式发布，并且具有大量的开发历史。我们已经看到了华盛顿大学贝克实验室研究人员独立开发的系统 RoseTTAFold，该系统从 AlphaFold 去年的性能推断，创造出类似但更高效的东西——尽管 DeepMind 似乎在其最新版本中再次领先。但重点是秘密酱汁可供所有人使用。尽管结构生物信息学家实现他们最美好的梦想的前景令人欣慰，但重要的是要注意，DeepMind 和 EMBL-EBI 所做的工作实际上有直接和真实的好处。在他们与被忽视疾病药物研究所的合作中可能最容易看到。正如您可能猜到的那样，DNDI 专注于非常罕见的疾病，它们不值得主要制药公司和医学研究机构给予可能导致发现治疗方法的那种关注和投资。 “这是临床遗传学中一个非常实际的问题，你有一系列可疑的突变，受影响的孩子的变化，你想尝试找出哪个可能是我们的孩子患有特定疾病的原因。遗传病。 DNDI 的 Ewan Birney 在发布前的新闻发布会上说，拥有广泛的结构信息，我几乎肯定会改进我们的做法。通常检查被怀疑是给定问题根源的蛋白质既昂贵又耗时，而对于影响相对较少的人的疾病，当它们可以应用于更常见的问题（如癌症或癌症）时，资金和时间都短缺。痴呆相关疾病。但是能够简单地调用十种健康蛋白质的结构和相同的十种突变版本，洞察力可能会在几秒钟内出现，否则可能需要多年艰苦的实验工作。 （药物发现和测试过程仍然需要数年时间，但也许现在可以从明天开始，而不是在 2025 年开始。）以免您认为过多依赖于计算机对未经实验验证的结果的预测，在另一个完全不同的情况下，一些艰苦的工作已经完成。朴茨茅斯大学的 John McGeehan 与 DeepMind 合作开发了另一个潜在用例，他解释了这如何影响他的团队在塑料分解方面的工作。\n“当我们第一次将我们的七个序列发送给 DeepMind 团队时，其中两个我们已经有了实验结构。因此，当他们回来时，我们能够对其进行测试，老实说，这是其中一个时刻，当我脖子后面的头发竖起来时，”麦吉汉说。 “因为他们生产的结构与我们的晶体结构相同。事实上，在某些情况下，它们包含的信息甚至比晶体结构所能提供的还要多。我们能够直接使用这些信息来开发更快的酶来分解塑料。这些实验已经立即进行。因此，我想说，我们这里项目的加速需要数​​年时间。”计划是在接下来的一两年内，对每一种已知和已测序的蛋白质进行预测——大约在一亿左右。在大多数情况下（少数不受这种方法影响的结构似乎很快就会被人知道）生物学家应该能够对结果充满信心。在某些情况下，AlphaFold 用于预测结构的过程比实验选项更好。尽管任何 AI 模型如何实现其结果都存在很多不确定性，但 Hassabis 很清楚这不仅仅是一个黑匣子。 “对于这种特殊情况，我认为可解释性不仅仅是机器学习中经常出现的好东西，而且考虑到我们希望将其用于的严肃性，它是必须的，”他说。 “所以我认为我们已经在特定系统上做了我们做过的最多的事情，以使案例具有可解释性。因此，在算法的粒度级别上既有可解释性，也有输出方面的可解释性，以及预测和结构，以及您应该或不应该信任它们的程度，以及哪些区域是可靠的区域的预测。”尽管如此，他对系统“神奇”的描述吸引了我对潜在标题词的特殊感觉。哈萨比斯说，这个过程本身并没有什么神奇之处，但他有点惊讶他们所有的工作都产生了如此强大的东西。 “这是迄今为止我们做过的最艰难的项目，”他说。 “而且，你知道，即使我们知道代码如何工作的每一个细节，系统如何工作，我们可以看到所有的输出，当你看到它在做什么时，它仍然有点神奇……它正在接受这个，这条 1D 氨基酸链并创造出这些美丽的 3D 结构，其中很多在美学上都非常漂亮，而且在科学和功能上都很有价值。所以这更像是一种奇迹的陈述。” AlphaFold 和蛋白质组数据库的影响在一段时间内不会被普遍感受到，但几乎可以肯定——正如早期合作伙伴所证明的那样——会导致一些严重的短期和长期突破。但这并不意味着蛋白质组的奥秘就完全解开了。不是由一个长镜头。\n如上所述，基因组的复杂性与基本水平的蛋白质组相比微不足道，但即使有了这一重大进展，我们也只是触及了后者的表面。 AlphaFold 解决了一个非常具体但非常重要的问题：给定一个氨基酸序列，预测该序列在现实中的 3D 形状。但是蛋白质并不是在真空中存在的。它们是一个复杂的动态系统的一部分，在这个系统中它们正在改变自己的构象，被分解和重组，对条件、元素或其他蛋白质的存在做出反应，然后围绕这些重新塑造自己。事实上，很多人类蛋白质 AlphaFold 对其预测的可信度只有中等水平，因为它们可能是根本上“无序”的蛋白质，这些蛋白质变化太大，无法确定更静态的蛋白质的方式（在这种情况下，预测将被验证为该类型蛋白质的高度准确预测因子）。因此，该团队已经为它完成了工作。 “是时候开始研究新问题了，”哈萨比斯说。 “当然，还有很多很多新的挑战。但是你提到的那些，蛋白质相互作用，蛋白质复合物，配体结合，我们实际上正在研究所有这些事情，我们有关于所有这些主题的早期项目。但我确实认为值得花一点时间来谈谈迈出这重要的一步……这是计算生物学界已经研究了 20、30 年的事情，我确实认为我们现在已经打破了这一局面问题。”", "note_en": "The  AlphaFold Protein Structure Database is a collaboration between DeepMind, the  European Bioinformatics Institute, and others, and consists of hundreds of thousands of protein sequences with their structures predicted by AlphaFold — and the plan is to add millions more to create a “protein almanac of the world.”\n “We believe that this work represents the most significant contribution AI has made to advancing the state of scientific knowledge to date, and is a great example of the kind of benefits AI can bring to society,” said DeepMind founder and CEO Demis Hassabis.\n  If you’re not familiar with proteomics in general — and it’s quite natural if that’s the case — the best way to think about this is perhaps in terms of another major effort: that of sequencing the human genome. As you may recall from the late ’90s and early ’00s, this was a huge endeavor undertaken by a large group of scientists and organizations across the globe and over many years. The genome, finished at last, has been instrumental to the diagnosis and understanding of countless conditions, and in the development of drugs and treatments for them.\n It was, however, just the beginning of the work in that field — like finishing all the edge pieces of a giant puzzle. And one of the next big projects everyone turned their eyes toward in those years was understanding the human  proteome — which is to say all the proteins used by the human body and encoded into the genome.\n The problem with the proteome is that it’s much,  much more complex. Proteins, like DNA, are sequences of known molecules; in DNA these are the handful of familiar bases (adenine, guanine, etc), but in proteins they are the 20 amino acids (each of which is coded by multiple bases in genes). This in itself creates a great deal more complexity, but it’s only the start. The sequences aren’t simply “code” but actually twist and fold into tiny molecular origami machines that accomplish all kinds of tasks within our body. It’s like going from binary code to a complex language that manifests objects in the real world.\n Practically speaking this means that the proteome is made up of not just 20,000 sequences of hundreds of acids each, but that each one of those sequences has a physical structure and function. And one of the hardest parts of understanding them is figuring out what shape is made from a given sequence. This is generally done experimentally using something like x-ray crystallography, a long, complex process that may take months or longer to figure out a single protein — if you happen to have the best labs and techniques at your disposal. The structure can also be predicted computationally, though the process has never been good enough to actually rely on — until AlphaFold came along.\n   Without going into the whole history of computational proteomics (as much as I’d like to), we essentially went from distributed brute-force tactics 15 years ago — remember Folding@home? — to more honed processes in the last decade. Then AI-based approaches came on the scene, making a splash in 2019 when DeepMind’s AlphaFold leapfrogged every other system in the world — then made another jump in 2020, achieving accuracy levels high enough and reliable enough that it prompted some experts to declare the problem of turning an arbitrary sequence into a 3D structure solved.\n I’m only compressing this long history into one paragraph because it was  extensively covered at the time, but it’s hard to overstate how sudden and complete this advance was. This was a problem that stumped the best minds in the world for decades, and it went from “we maybe have an approach that kind of works, but extremely slowly and at great cost” to “accurate, reliable, and can be done with off the shelf computers” in the space of a year.\n  The specifics of DeepMind’s advances and how it achieved them I will leave to specialists in the fields of computational biology and proteomics, who will no doubt be picking apart and iterating on this work over the coming months and years. It’s the practical results that concern us today, as the company employed its time since the publication of AlphaFold 2 (the version shown in 2020) not just tweaking the model, but running it… on every single protein sequence they could get their hands on.\n The result is that 98.5 percent of the human proteome is now “folded,” as they say, meaning there is a predicted structure that the AI model is confident enough (and importantly,  we are confident enough in  its confidence) represents the real thing. Oh, and they also folded the proteome for 20 other organisms, like yeast and E. coli, amounting to about 350,000 protein structures total. It’s by far — by orders of magnitude — the largest and best collection of this absolutely crucial information.\n All that will be made available as a freely browsable database that any researcher can simply plug a sequence or protein name into and immediately be provided the 3D structure. The details of the process and database can be found in a paper  published today in the journal Nature.\n “The database as you’ll see it tomorrow, it’s a search bar, it’s almost like Google search for protein structures,” said Hassabis in an interview with TechCrunch.”You can view it in the 3D visualizer, zoom around it, interrogate the genetic sequence… and the nice thing about doing it with EMBL-EBI is it’s linked to all their other databases. So you can immediately go and see related genes, And it’s linked to all these other databases, you can see related genes, related in other organisms, other proteins that have related functions, and so on.”\n  “As a scientist myself, who works on an almost unfathomable protein,” said EMBL-EBI’s Edith Heard (she didn’t specify what protein), “it’s really exciting to know that you can find out what the business end of a protein is now, in such a short time — it would have taken years. So being able to access the structure and say ‘aha,  this is the business end,’ you can then focus on trying to work out what that business end does. And I think this is accelerating science by steps of years, a bit like being able to sequence genomes did decades ago.”\n So new is the very idea of being able to do this that Hassabis said he fully expects the entire field to change — and change the database along with it.\n “Structural biologists are not yet used to the idea that they can just look up anything in a matter of seconds, rather than take years to experimentally determine these things,” he said. “And I think that should lead to whole new types of approaches to questions that can be asked and experiments that can be done. Once we start getting wind of that, we may start building other tools that cater to this sort of serendipity: What if I want to look at 10,000 proteins related in a particular way? There isn’t really a normal way of doing that, because that isn’t really a normal question anyone would ask currently. So I imagine we’ll have to start producing new tools, and there’ll be demand for that once we start seeing how people interact with this.”\n That includes derivative and incrementally improved versions of the software itself, which has been released in open source along with a great deal of development history. Already we have seen an independently developed system,  RoseTTAFold, from researchers at the University of Washington’s Baker Lab, which extrapolated from AlphaFold’s performance last year to create something similar yet more efficient — though DeepMind seems to have taken the lead again with its latest version. But the point was made that the secret sauce is out there for all to use.\n   Although the prospect of structural bioinformaticians attaining their fondest dreams is heartwarming, it is important to note that there are in fact immediate and real benefits to the work DeepMind and EMBL-EBI have done. It is perhaps easiest to see in their partnership with the Drugs for Neglected Diseases Institute.\n The DNDI focuses, as you might guess, on diseases that are rare enough that they don’t warrant the kind of attention and investment from major pharmaceutical companies and medical research outfits that would potentially result in discovering a treatment.\n “This is a very practical problem in clinical genetics, where you have a suspected series of mutations, of changes in an affected child, and you want to try and work out which one is likely to be the reason why our child has got a particular genetic disease. And having widespread structural information, I am almost certain will improve the way we can do that,” said DNDI’s Ewan Birney in a press call ahead of the release.\n Ordinarily examining the proteins suspected of being at the root of a given problem would be expensive and time-consuming, and for diseases that affect relatively few people, money and time are in short supply when they can be applied to more common problems like cancers or dementia-related diseases. But being able to simply call up the structures of ten healthy proteins and ten mutated versions of the same, insights may appear in  seconds that might otherwise have taken years of painstaking experimental work. (The drug discovery and testing process still takes years, but maybe now it can start tomorrow for Chagas disease instead of in 2025.)\n  Lest you think too much is resting on a computer’s prediction of experimentally unverified results, in another, totally different case, some of the painstaking work had already been done.  John McGeehan of the University of Portsmouth, with whom DeepMind partnered for another potential use case, explained how this affected his team’s work on plastic decomposition.\n “When we first sent our seven sequences to the DeepMind team, for two of those we already had experimental structures. So we were able to test those when they came back, and it was one of those moments, to be honest, when the hairs stood up on the back of my neck,” said McGeehan. “Because the structures that they produced were identical to our crystal structures. In fact, they contained even more information than the crystal structures were able to provide in certain cases. We were able to use that information directly to develop faster enzymes for breaking down plastics. And those experiments are already underway, immediately. So the acceleration to our project here is, I would say, multiple years.”\n The plan is to, over the next year or two, make predictions for every single known and sequenced protein — somewhere in the neighborhood of a hundred million. And for the most part (the few structures not susceptible to this approach seem to make themselves known quickly) biologists should be able to have great confidence in the results.\n  The process AlphaFold uses to predict structures is, in some cases, better than experimental options. And although there is an amount of uncertainty in how any AI model achieves its results, Hassabis was clear that this is not just a black box.\n “For this particular case, I think explainability was not just a nice-to-have, which often is the case in machine learning, but it was a must-have, given the seriousness of what we wanted it to be used for,” he said. “So I think we’ve done the most we’ve ever done on a particular system to make the case with explainability. So there’s both explainability on a granular level on the algorithm, and then explainability in terms of the outputs, as well the predictions and the structures, and how much you should or shouldn’t trust them, and which of the regions are the reliable areas of prediction.”\n Nevertheless his description of the system as “miraculous” attracted my special sense for potential headline words. Hassabis said that there’s nothing miraculous about the process itself, but rather that he’s a bit amazed that all their work has produced something so powerful.\n “This was by far the hardest project we’ve ever done,” he said. “And, you know, even when we know every detail of how the code works, and the system works, and we can see all the outputs, it’s still just still a bit miraculous when you see what it’s doing… that it’s taking this, this 1D amino acid chain and creating these beautiful 3D structures, a lot of them aesthetically incredibly beautiful, as well as scientifically and functionally valuable. So it was more a statement of a sort of wonder.”\n  The impact of AlphaFold and the proteome database won’t be felt for some time at large, but it will almost certainly — as early partners have testified — lead to some serious short-term and long-term breakthroughs. But that doesn’t mean that the mystery of the proteome is solved completely. Not by a long shot.\n As noted above, the complexity of the genome is nothing compared to that of the proteome at a fundamental level, but even with this major advance we have only scratched the surface of the latter. AlphaFold solves a very specific, though very important problem: given a sequence of amino acids, predict the 3D shape that sequence takes in reality. But proteins don’t exist in a vacuum; they’re part of a complex, dynamic system in which they are changing their conformation, being broken up and reformed, responding to conditions, the presence of elements or other proteins, and indeed then reshaping themselves around  those.\n In fact a great deal of the human proteins AlphaFold gave only a middling level of confidence to its predictions for may be fundamentally “disordered” proteins that are too variable to pin down the way a more static one can be (in which case the prediction would be validated as a highly accurate predictor for that type of protein). So the team has its work cut out for it.\n “It’s time to start looking at new problems,” said Hassabis. “Of course, there are many, many new challenges. But the ones you mentioned, protein interaction, protein complexes, ligand binding, we’re working actually on all these things, and we have early, early stage projects on all those topics. But I do think it’s worth taking, you know, a moment to just talk about delivering this big step… it’s something that the computational biology community’s been working on for 20, 30 years, and I do think we have now broken the back of that problem.”", "posttime": "2021-07-22 23:37:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人类,puts,蛋白质", "title": "DeepMind 将整个人类蛋白质组放在网上，由 AlphaFold 折叠", "title_en": "\n\t\t\t\tDeepMind puts the entire human proteome online, as folded by AlphaFold\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/deepmind-puts-the-entire-human-proteome-online-as-folded-by-alphafold/", "via": "", "real_tags": ["人类", "puts", "蛋白质"]}, {"category": "", "categoryclass": "", "imagename": "b385d8c08fbf4600381915ca2ad6e4d2.jpg", "infoid": 1069021, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司已经采取行动，周四宣布收购英国电机公司 YASA，并确定将需要超过 200 吉瓦时的电池容量。为了满足这些需求，梅赛德斯计划与合作伙伴建立八家电池工厂来生产电池。新工厂（其中之一将位于美国）位于该公司已计划的九家工厂网络之上，这些工厂将致力于建造电池系统。该公司表示将与新的欧洲合作伙伴合作开发和高效生产未来的电池和模块。 “欧洲合作伙伴”的指定具有战略意义，梅赛德斯表示将确保该地区“仍然是汽车行业的核心”。梅赛德斯表示，它已与硅谷电池材料初创公司 Sila Nano 合作，后者于今年早些时候筹集了 5.9 亿美元，以帮助其改进下一代电池。具体来说，SilaNano 正在通过在阳极中使用硅碳复合材料来帮助梅赛德斯提高能量密度，这应该可以提高续航里程并缩短充电时间。梅赛德斯也在研究固态电池技术，并表示正在与合作伙伴进行谈判，以开发具有更高能量密度和安全性的电池。该计划周四公布了之前的目标，即制造和销售更多电动汽车。早在 2017 年，梅赛德斯就表示将在 2022 年实现其整个产品线的电气化——这意味着混合动力、插电式混合动力或电池电动。这家德国汽车制造商周四表示，到明年它将在每个细分市场提供电池电动汽车。它服务。它的纯电动汽车计划将从那里加速。该公司表示，到 2025 年，其三款新推出的汽车架构将仅采用电动汽车。该公司表示，预计全电动和混合动力车将占其销售额的 50%，高于之前的 25%。客户还将为公司生产的每种型号选择全电动替代品。戴姆勒股份公司和梅赛德斯-奔驰股份公司首席执行官 Ola Källenius 表示，该公司的目标标志着“资本的深刻重新分配”。他强调，尽管进行了巨额投资并从内燃机转向，公司的盈利目标将得到保障和实现。\n为了实现这一目标，梅赛德斯推出了三种纯电动架构，这些架构将构成其所有新车的基础。所谓的 MB.EA 平台将用于其中大型乘用车，而 AMG.EA 将支持其性能梅赛德斯-AMG 汽车，而 VAN.EA 将成为电动乘用小型货车和轻型商用车的专用架构。该公司已经宣布其“电动优先”紧凑型汽车架构，即 MMA，将于 2024 年在汽车中推出。", "note_en": "The company has already taken action, announcing Thursday it acquired UK-based electric motor company YASA and has determined it will need battery capacity of more than 200 gigawatt hours. To hit meet those needs, Mercedes plans to set up eight battery factories with partners to produce cells.\n The new plants, one of which will be located in the United States, is on top of the company’s already planned network of nine factories that will be dedicated to building battery systems. The company said it will team up with new European partners to develop and efficiently produce future cells and modules. That “European partners” designation is strategic and one that Mercedes says will ensure the region “remains at the heart of the auto industry.”\n  Mercedes said it has partnered with Sila Nano, the Silicon Valley battery materials startup that  raised $590 million earlier this year, to help it improve its next generation of batteries. Specifically, SilaNano is helping Mercedes  increase energy density by using silicon-carbon composite in the anode, which should boost range and allow for shorter charging times.\n Mercedes is also looking into solid-state battery technology and said it is in talks with partners to develop batteries with even higher energy density and safety.\n The plan unveiled Thursday piggybacks on previous goals to build and sell more EVs. Back in 2017, Mercedes said it would electrify — which means gas-hybrid, plug-in hybrid or battery electric — its  entire lineup by 2022. The German automaker said Thursday that by next year it will offer battery-electric vehicles in every segment that it serves.\n Its EV-only plan will accelerate from there. By 2025, the company said its three newly launched vehicle architectures will be electric-only. The company said it expects that all-electric and hybrids will make up 50% of its sales that’s up from its previous guidance of 25%. Customers will also be to choose an all-electric alternative for every model the company makes.\n Daimler AG and Mercedes-Benz AG CEO Ola Källenius said the company’s goal marks a “profound reallocation of capital.” He stressed that the company’s profitability targets would be safeguarded and met despite this hefty investment and shift away from the internal combustion engine.\n To meet this target, Mercedes is launching three electric-only architectures which will form the basis of all of its new vehicles. It’s so-called MB.EA platform will be used for its medium to large passenger cars, while AMG.EA will underpin its performance Mercedes-AMG cars and the VAN.EA will be dedicated architecture for electric passenger minivans and light commercial vehicles. The company has already announced its “electric first” compact car architecture, known as MMA, will launch in vehicles by 2024.", "posttime": "2021-07-22 23:37:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "工厂,benz,电池", "title": "梅赛德斯-奔驰将建设八家电池工厂，力争到 2030 年成为纯电动汽车制造商", "title_en": "\n\t\t\t\tMercedes-Benz to build eight battery factories in push to become electric-only automaker by 2030\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/mercedes-benz-to-build-eight-battery-factories-in-push-to-become-electric-only-automaker-by-2030/", "via": "", "real_tags": ["工厂", "benz", "电池"]}, {"category": "", "categoryclass": "", "imagename": "7bd0175e885ce8afb1c909a986e6287a.jpg", "infoid": 1069020, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“先发制人”的 C 轮融资使其总资金达到 171 美元，并跃居资金最雄厚的建筑机器人公司之首。当然，这里有很多空间。全球建筑市场每年达数十万亿美元。而这个行业的魅力之一正是有多少侧翼可以攻击它。 Path 的特殊资金……嗯，path，指向焊接之外的野心。但这是一个很好的起点，到 2024 年仅在美国就会出现约 40 万个工作岗位的大规模劳动力短缺。 Tiger Global 合伙人 Griffin Schroeder 拉开帷幕，指出：Path 的计算机视觉创新方法和专有 AI 软件允许机器人感知、理解和适应每个独特焊接项目的挑战。我们相信这项突破性技术可用于焊接以外的许多其他应用和产品，以全面服务于他们的客户。我确实认为对于一家初创公司来说，承担太多太快的风险是有风险的——即使是像 Path 这样资金充足的公司。 Verve Motion 的一轮融资几乎没有错过上周的综合纳入截止日期。当你的首轮融资是 1 亿美元时，这很困难，但 1500 万美元肯定没什么值得嘲笑的。 Verve Motion 是哈佛大学 Wyss 研究所 Conor Walsh 实验室和约翰·A·保尔森工程与应用科学学院的一些非常有趣的工作的衍生，是外骨骼/外装类别中的众多初创公司之一。这项技术有两种截然不同的受众：有流动性问题的人和蓝领劳动力。至少就目前而言，Verve 的目标是后者，其柔软的外装套装旨在帮助减少重复举重等活动造成的工作场所伤害。老实说，它非常适合沉闷、肮脏、危险的范式。来自 OpenAI 的不那么有趣的消息，它悄悄地解散了其机器人团队。此举实际上是在去年 10 月进行的，但 Venture Beat 上周对此进行了报道。该团队最出名的可能是它的魔方解决机器人手——一个迷人的项目，但显然有点死胡同。引用一位发言人的话：\n在通过我们的魔方项目和其他举措推进强化学习的最新技术之后，去年 10 月，我们决定不进行进一步的机器人研究，而是将团队重新集中在其他项目上。由于 AI 及其功能的快速进步，我们发现其他方法，例如带有人类反馈的强化学习，可以加快我们强化学习研究的进展。在可怕屠杀马克吐温曾经说过的一件有趣的事情的部门中，关于佩珀之死的报道……如果不是夸大其词，至少在消息来源方面是有争议的。仍然清楚的是，软银的机器人面孔并没有按照公司的希望行事，至少，它已经决定重新开始。除了继续翻新销售带有标牌的人形机器人外，软银机器人公司首席营销官 Kazutaka Hasumi 告诉路透社，“我们将在五年内继续销售 Pepper。”很难知道该怎么做。就这些事情而言，Pepper 并不是一个特别有用的机器人，尽管由于软银收购了法国公司 Aldebaran，它有着坚实的血统。至少，该公司正在考虑某种重新设计。仅此一项似乎不太可能大有作为。", "note_en": "The “pre-emptive” Series C brings its total funding to $171 and leapfrogs it toward the top of the most well-funded construction robotics companies. There’s a lot of room here, of course. The global construction market is in the tens of trillions of dollars, annually. And one of the beauties of the industry is precisely how many flanks there are to attack it from.\n   Path’s particular funding…well, path, points to ambitions beyond welding. But that’s a good place to start, with a massive labor shortage of around 400,000 jobs in the U.S. alone by 2024. Tiger Global partner Griffin Schroeder pulls the curtain back a touch, stating:\n Path’s innovative approach to computer vision and proprietary AI software allows robots to sense, understand and adapt to the challenges of each unique welding project. We believe this breakthrough technology can be adopted for many other applications and products beyond just welding, to serve their customers holistically.\n  I do think there’s a risk of taking on too much too fast for a startup — even one as well-funded as Path.\n  Verve Motion’s funding round just barely missed the cutoff for roundup inclusion last week. It’s tough when your lead-in is a $100 million round, but $15 million’s certainly nothing to scoff at. A spinout of some of the really interesting work being done at Conor Walsh’s lab at Harvard’s Wyss Institute and the John A. Paulson School of Engineering and Applied Sciences, Verve Motion is one of a number of startups in the exoskeleton/exosuit category.\n  There are two largely distinct audiences for this tech: people with mobility issues and the blue-collar labor force. For now, at least, Verve is targeting the latter, with its soft exosuits designed to help reduce workplace injuries from activities like repetitive lifting. Honestly, it fits the dull, dirty, dangerous paradigm pretty well.\n  Less fun news out of OpenAI, which quietly disbanded its robotics team. The move actually came last October, but  Venture Beat reported on it last week. The team was probably best known for its Rubik’s Cube-solving robotics hand — a fascinating project, but apparently a bit of a dead end. Quoting a spokesperson:\n After advancing the state of the art in reinforcement learning through our Rubik’s Cube project and other initiatives, last October we decided not to pursue further robotics research and instead refocus the team on other projects. Because of the rapid progress in AI and its capabilities, we’ve found that other approaches, such as reinforcement learning with human feedback, lead to faster progress in our reinforcement learning research.\n  And in the department of horribly butchering a funny thing Mark Twain once said, reports of Pepper’s death are…if not exaggerated, than at least disputed by the source. What remains clear is that the robotic face of Softbank wasn’t doing what the firm had hoped, and at the very least, it has decided to go back to the drawing board.\n In addition to continuing refurbished sales of the signage-holding humanoid bot, Softbank Robotics CMO Kazutaka Hasumi  told Reuters, “We will still be selling Pepper in five years.” It’s hard to know what to make of that. As far as these things go, Pepper wasn’t a particularly useful robot, in spite of it having a solid pedigree owing to Softbank’s acquisition of French firm, Aldebaran.\n At the very least, the company is mulling over some kind of redesign. That alone seems unlikely to move the needle much.", "posttime": "2021-07-22 23:37:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "leaving,机器人", "title": "离开立方体", "title_en": "\n\t\t\t\tLeaving the cube\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/robotics-roundup-21/", "via": "", "real_tags": ["leaving", "机器人"]}, {"category": "", "categoryclass": "", "imagename": "2fcb6bf33b6acd6607ec9e43523e7c6d.jpg", "infoid": 1069019, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用 Axios AM/PM 让您忙碌的日子变得更简单。在短短 5 分钟内了解新功能及其重要性。订阅 Axios Closer 以深入了解当天的商业新闻和趋势以及它们为何如此重要订阅 Axios Markets 以获取最新的市场趋势和经济见解。免费注册。通过 Axios Sports 尽情享受推动体育世界发展的统计数据和故事。免费注册。使用 Axios Login 从硅谷和 DC 获取我们对技术的明智看法。免费注册。通过 Axios Sneak Peek 获取新白宫的内幕指南。免费注册。通过 Axios Denver 获取影响您家乡的最重要故事的每日摘要\n通过 Axios Des Moines 获取影响您家乡的最重要故事的每日摘要 通过 Axios Twin Cities 获取影响您家乡的最重要故事的每日摘要 通过 Axios Tampa Bay 获取影响您家乡的最重要故事的每日摘要 获取每日摘要与 Axios Charlotte 一起了解影响您家乡的最重要故事 及时了解由当地记者撰写的影响阿肯色州西北部的最重要和最有趣的故事 华尔街日报的一项新视频调查发现 TikTok 成功的关键短视频分享应用如何监控观看时间。重要性：TikTok 以其极其有效的方式而闻名，它根据每个用户的喜好选择视频流。这种个性化背后的算法是公司的奖励资产——而且，就像那些为谷歌和 Facebook 提供动力的算法一样，这是一个秘密。\n他们是如何做到的：《华尔街日报》创建了一批个性化的虚拟账户来投放 TikTok 并测试它如何适应每个虚假角色的特征。他们的发现：TikTok 对单个信号的反应最为敏感——用户在视频上停留的时间。它首先向新用户展示非常受欢迎的商品，然后看看哪些商品能吸引他们的眼球。是的，但是：调查还发现，TikTok 就像 YouTube 一样，可以将用户引向越来越极端内容的兔子洞。", "note_en": "Make your busy days simpler with Axios AM/PM. Catch up on what&#39;s new and why it matters in just 5 minutes.\n Subscribe to Axios Closer for insights into the day’s business news and trends and why they matter\n Subscribe to Axios Markets for the latest market trends and economic insights. Sign up for free.\n Binge on the stats and stories that drive the sports world with Axios Sports. Sign up for free.\n Get our smart take on technology from the Valley and D.C. with Axios Login. Sign up for free.\n Get an insider&#39;s guide to the new White House with Axios Sneak Peek. Sign up for free.\n Get a daily digest of the most important stories affecting your hometown with Axios Denver\n Get a daily digest of the most important stories affecting your hometown with Axios Des Moines\n Get a daily digest of the most important stories affecting your hometown with Axios Twin Cities\n Get a daily digest of the most important stories affecting your hometown with Axios Tampa Bay\n Get a daily digest of the most important stories affecting your hometown with Axios Charlotte\n Stay up-to-date on the most important and interesting stories affecting NW Arkansas, authored by local reporters\n   A new  video investigation by the Wall Street Journal finds the key to TikTok&#39;s success in how the short-video sharing app monitors viewing times.\n Why it matters: TikTok is known for the fiendishly effective way that it selects streams of videos tailored to each user&#39;s taste. The algorithm behind this personalization is the company&#39;s prize asset — and, like those that power Google and Facebook, it&#39;s a secret.\n How they did it: WSJ created a batch of individualized dummy accounts to throw at TikTok and test how it homed in on each fake persona&#39;s traits.\n What they found: TikTok responds most sensitively to a single signal — how long a user lingers over a video. It starts by showing new users very popular items, and sees which catch their eyes.\n  Yes, but: The investigation also found that TikTok — like YouTube — can lure users deep into rabbit holes of increasingly extreme content.", "posttime": "2021-07-22 23:33:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "看待,sees,axios", "title": "TikTok 如何看待你的大脑", "title_en": "How TikTok Sees Inside Your Brain", "transed": 1, "url": "https://www.axios.com/tiktok-video-algorithm-addictive-4db395ec-ef5b-48dc-9fa0-10a3b954b980.html", "via": "", "real_tags": ["看待", "sees", "axios"]}, {"category": "", "categoryclass": "", "imagename": "c78a3c3d012c5156d2274388e11d0fdb.jpg", "infoid": 1069018, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "六月即将结束时，Facebook 首席执行官马克·扎克伯格 (Mark Zuckerberg) 向他的员工介绍了一项雄心勃勃的新计划。该公司的未来将远远超出其当前构建一组联网社交应用程序和一些支持它们的硬件的项目。相反，他说，Facebook 将努力直接从科幻小说中建立一个最大化的、相互关联的体验集——一个被称为元宇宙的世界。他在对员工的远程致辞中说，该公司专注于社区、创作者、商业和虚拟现实产品的部门将越来越多地努力实现这一愿景。扎克伯格说：“我认为最有趣的是这些主题将如何组合成一个更大的想法。” “我们所有这些举措的总体目标是帮助将元宇宙带入生活。”元节有一个时刻。在尼尔·斯蒂芬森 1992 年的科幻小说《雪崩》中创造，该术语指的是物理、增强和虚拟现实在共享在线空间中的融合。本月早些时候，《纽约时报》探讨了包括 Epic Games 的 Fortnite、Roblox 甚至动物之森：新视野在内的公司和产品如何越来越多地具有类似元节的元素。 （Epic Games 首席执行官蒂姆·斯威尼 (Tim Sweeney) 数月以来一直在讨论他希望为 Metaverse 做出贡献的愿望。）“我们将有效地从人们认为我们主要是一家社交媒体公司转变为一家 Metaverse 公司” 2020 年 1 月，一位有影响力的风险投资家马修·鲍尔 (Matthew Ball) 的文章着手确定元宇宙的关键特征。其中：它必须跨越物理世界和虚拟世界；包含一个完全成熟的经济体；并提供“前所未有的互操作性”——用户必须能够将他们的化身和商品从 Metaverse 中的一个地方带到另一个地方，无论谁运行该特定部分。至关重要的是，没有一家公司会运营元宇宙——它将是一个“实体互联网”，扎克伯格说，由许多不同的参与者以去中心化的方式运营。看着扎克伯格的演讲，我无法决定哪个更大胆：他的愿景本身还是他的时机。扎克伯格宣布打算打造一个更加极致的 Facebook 版本，涵盖社交存在、办公室工作和娱乐，正值美国政府试图拆分他目前的公司之际。国会通过的一揽子法案可能会迫使该公司剥离 Instagram 和 WhatsApp，并限制 Facebook 进行未来收购或提供与其硬件产品相关的服务的能力。即使技术监管在美国停滞不前——从历史上看，这不是一个坏赌注——一个蓬勃发展的元宇宙也会引发一些熟悉和陌生的问题，比如虚拟空间是如何管理的，它的内容将如何被管理，以及它的存在会对我们的生活产生什么影响。共同的现实感。我们仍在拥抱二维版本的社交平台；争论 3D 版本的难度可能会成倍增加。\n同时，扎克伯格表示，元宇宙将为个人创作者和艺术家带来巨大的机会；想要在远离当今城市中心的地方工作并拥有房屋的个人；以及生活在教育或娱乐机会更加有限的地方的人们。他说，一个实现的元宇宙可能是一个工作传送设备的下一个最好的东西。 Facebook 正试图通过该公司的 Oculus 部门生产 Quest 耳机来开发一款产品。 “我不认为这主要是为了更多地参与互联网。我认为这是为了更自然地参与。”看完他的演讲后，我和扎克伯格进行了交谈。 （截至发稿时我们无法使用 Metaverse，我们使用了 Zoom。）我们讨论了他对实体互联网的愿景、管理它的挑战以及当今虚拟现实中的性别失衡。由于拜登总统猛烈批评 Facebook 在头条新闻中删除反疫苗内容的失败，我也向他询问了这一点。 “这有点像在城市中打击犯罪，”他告诉我。 “没有人期望你能彻底解决城市中的犯罪问题。”谢谢，凯西。很高兴来到这里。我们有很多事情要经历。与往常一样，有很多事情要与您讨论——白宫要求 Facebook 采取更多措施消除疫苗错误信息，我知道现在很多人都在想这件事。我想开始，但我想从你几周前在 Facebook 内部进行的这个演讲开始，我最近有机会观看。你告诉你的员工，你对 Facebook 的未来愿景不是我们今天使用的二维版本，而是一种叫做元宇宙的东西。那么什么是元节，Facebook 计划构建它的哪些部分？这是一个很大的话题。元节是一个跨越许多公司——整个行业的愿景。您可以将其视为移动互联网的继承者。这当然不是任何一家公司都会建立的东西，但我认为我们下一章的很大一部分有望与许多其他公司、创作者和开发者合作，为建立它做出贡献。但是您可以将元宇宙视为一个实体化的互联网，您不仅可以在其中查看内容，还可以置身其中。并且您感觉与其他人在一起就好像您在其他地方一样，拥有在 2D 应用程序或网页上不一定能获得的不同体验，例如跳舞，或不同类型的健身。\n“我们基本上是通过这些发光的小矩形来调解我们的生活和我们的交流。我认为这并不是人们互动的真正方式。”我认为很多人，当他们想到元宇宙时，他们只会想到虚拟现实——我认为这将是其中的一个重要组成部分。这显然是我们非常投入的一部分，因为它是提供最清晰存在形式的技术。但元宇宙不仅仅是虚拟现实。它将可以在我们所有不同的计算平台上访问； VR 和 AR，还有 PC，还有移动设备和游戏机。说到这一点，很多人还认为元宇宙主要是关于游戏的。我认为娱乐显然将成为其中的重要组成部分，但我不认为这只是游戏。我认为这是一个持久的、同步的环境，我们可以在一起，我认为这可能类似于我们今天看到的社交平台之间的某种混合，但是你在其中体现的环境。所以它可以是 3D 的——它不一定是。您或许可以通过手机进入体验，例如 3D 音乐会或其他内容，因此您可以获得 2D 元素或 3D 元素。我很想更详细地介绍一堆用例，但总的来说，我认为这将成为技术行业下一章的重要组成部分，这是我们非常兴奋的事情关于。它只是涉及我们正在研究的许多最大的主题。将社区和创作者视为一个整体，将数字商务视为第二个，或者构建下一组计算平台（如虚拟和增强现实），为人们提供存在感。我认为我们今天在 Facebook 拥有的所有这些不同的举措基本上都会一起提升，以帮助构建这个元宇宙愿景。 “从我上中学开始，我就一直在考虑这些东西，刚开始编码”我希望，如果我们做得好，我想在接下来的五年左右，在我们公司的下一个篇章，我认为我们将有效地从人们认为我们主要是一家社交媒体公司转变为一家元界公司。显然，我们在人们今天使用的应用程序中所做的所有工作都直接为构建社区和创作者的愿景做出了贡献。所以有很多东西要跳到这里。我很好奇你想把它往哪个方向发展。但这是我花了很多时间，想了很多，我们正在做大量的工作。我认为这只是我们将在整个行业中开展的工作的下一章的重要组成部分。这感觉像是一个相当遥远的未来愿景，即使它的一部分现在是可见的并且正在融合在一起。我认为总的来说，它感觉就像互联网可能是什么的一个非常极端的版本。你和员工谈论，“从我们醒来的那一刻起，到我们上床睡觉的那一刻，能够跳入元宇宙做几乎任何你能想象到的事情。”可能我们中的一些人已经在以这种方式使用互联网。\n但这种描述感觉更像是我们可能从《玩家一号》或《雪崩》等书中熟悉的元宇宙，或者可能像今天的 Fortnite，我们生活中一些最重要的方面，包括我们的工作，正在生活和完成在这些虚拟空间中。这些是你所说的那种世界的好类比吗？嗯，让我感到兴奋的是帮助人们与他们关心的人、与他们一起工作的人、他们想去的地方提供并体验更强烈的存在感。现实情况是，今天有了移动互联网，我们已经拥有很多人从醒来到睡觉时都可以访问的东西。我不了解你，但很多早晨，我什至在戴上眼镜之前就在床边拿起手机，只是为了确保收到我在半夜收到的任何短信，并确保没有任何问题，我需要在醒来后立即跳进去。所以我不认为这主要是为了更多地参与互联网。我认为这是关于更自然地参与。今天，我想到了我们拥有的计算平台。我们有这些电话。它们相对较小。我们花费的很多时间，基本上都是通过这些发光的小矩形来调解我们的生活和我们的交流。我认为这并不是人们互动的真正方式。我们今天举行的许多会议，你都在看屏幕上的面孔网格。这也不是我们处理事情的方式。我们习惯于与人共处一室并拥有空间感，如果你坐在我的右边，那么这意味着我也坐在你的左边，所以我们有一些共同的空间感。当你说话时，它来自我的右边。这不仅仅是来自我面前的同一个地方。我不知道你有多少这样的经历，但在去年的工作会议上，我有时很难记住某人在什么会议上说了些什么，因为他们看起来都一样，而且他们全部融合在一起。我认为部分原因是因为我们在太空中没有这种存在感。虚拟现实和增强现实可以做什么，以及 Metaverse 广泛地帮助人们体验的是一种存在感，我认为这种存在感在我们互动的方式中更加自然。而且我认为它会更舒服。我们的互动会更加丰富，他们会感觉真实。未来，你可以像全息图一样坐在我的沙发上，而不是仅仅通过电话来做这件事，或者我可以像全息图一样坐在你的沙发上，实际上感觉就像我们在同一个地方，即使我们在不同的州或相距数百英里。所以我认为这真的很强大。我从中学开始就一直在考虑这些东西，并且刚刚开始编码。我记得当我在数学课上时，我会有我的笔记本，我基本上只是坐在那里写代码和想法，当我那天放学回家时我想编写代码。其中一些我当时能够做到，但我真正想要建立的一件事基本上是一种实体化互联网的感觉，你可以在环境中传送到不同的地方并与朋友在一起。我认为我当时可能没有足够的数学知识来完成它，而且技术距离真正准备好以一种好的方式做到这一点还有几十年的时间——这不是我所吸引的方向在最初，在建立不同的社交体验方面。但这是我一直兴奋的事情。早在我创立 Facebook 之前，我就认为这将是社交互动的圣杯。现在下一组平台将能够做到这一点，这对我来说真的很令人兴奋。 “人们并不打算按照应用程序网格来导航”\n我们在增强现实和虚拟现实方面投入如此多的原因之一是手机与 Facebook 是同时出现的，所以我们并没有真正在塑造这些平台的发展方面发挥重要作用。所以从我的角度来看，它们并没有真正以非常自然的方式发展。人们并不打算按照应用程序网格来导航。我认为当我们考虑与其他人在一起时，我们会更自然地互动。我们通过人以及我们与人的互动以及我们对他们所做的事情来定位自己并思考世界。我认为，如果我们能够以一种更自然的方式帮助构建下一组计算平台和体验，让我们与人有更多的联系，我认为这将是一件非常积极的事情。我不确定人们是否一定会觉得整天戴着 VR 头盔工作更自然，但也许我们已经习惯了。但我真的对你所说的一些关于元宇宙如何创造今天不存在的就业机会的事情很感兴趣，比如整个经济体在这个元宇宙中涌现。您认为在这个您想要建立的世界中发生了哪些新颖的工作形式？所以，让我稍后再说。但是回到你关于人们没有整天戴着 [VR 头盔] 工作的评论——很明显，在技术上有一个或多个进化需要成为可能，这需要在此之前发生人们工作的主要方式。但我认为我们将在这个十年结束时到达那里。今天，VR 头显仍然有点笨重，它们可能比您理想中的要重一些。需要在能够表达自己、拥有更高的分辨率、能够更好地阅读文本等方面取得进步。但我们已经到了那里，每个版本都越来越好。就人们使用它的方式而言，Quest 2 到目前为止一直是一个真正的热门。我很惊讶。我们计划将其主要用于游戏，并认为很多这些社交互动或工作相关的事情要等到以后才会出现，但是人们在其中花费最多时间的 Quest 2 上的许多最大体验已经只是在社交上闲逛。围绕工作和生产力有很多事情。甚至还有一些我真的没有想过的体验，比如健身。像 Supernatural 和 FitXR 这样的应用程序，你可以像 Peloton 一样思考它，但它不是自行车或跑步机，而是你的 VR 耳机，你基本上是在那里上课，在那里你正在拳击或跳舞。这真的很有趣。我想如果你还没有尝试过，这是很多人都喜欢的东西。但回到你关于工作的观点，以及这将如何运作，我也不认为这将是所有的 VR。我认为这也将是 AR。 VR 可用的部分原因，以及为什么你在拥有 AR 眼镜之前 2 年就拥有像 Quest 这样的东西是因为在你自己舒适的环境中佩戴 VR 耳机之类的东西更能被社会接受家。但我认为要获得我们一整天都戴着的 AR 眼镜，它们必须是看起来正常的眼镜，对吧？所以你基本上把所有这些材料都塞进了 10 年前我们认为是超级计算机的框架中，大约 5 毫米厚——你有计算机芯片、网络芯片和全息波导，以及用于感知和绘制世界的东西，电池和扬声器，所有这些东西，它只需要适合这些眼镜——所以这是一个真正的挑战。我实际上甚至会说，我认为这可能是我们行业在未来十年将面临的最大技术挑战之一，如果不是的话。我们真的很喜欢庆祝大事，对吧？但实际上，我认为将事物小型化并将超级计算机装入一副眼镜实际上是更大的挑战之一。但是一旦你有了它，所以你有了那些眼镜，你有了你的 VR 耳机，我认为这将实现一系列非常有趣的用例。因此，一个是您将能够，基本上只需弹指一挥，即可拉起您完美的工作站。所以无论你走到哪里，你都可以走进星巴克，你可以坐下来，你可以喝咖啡，挥挥手，基本上你可以拥有任意数量的显示器，全部设置，无论你想要什么尺寸一切都按照您以前在家时的方式进行了预先配置。你可以随身携带它。\n如果你想和某人交谈，你正在解决一个问题，而不是仅仅通过电话给他们打电话，他们可以传送进来，然后他们可以看到你拥有的所有上下文。他们可以看到您的五台显示器，或者其他任何东西，以及您拥有的文档或所有代码窗口，或者您正在处理的 3D 模型。他们可以站在你旁边并进行互动，然后眨眼间他们就可以传送回原来的位置，并在一个不同的地方。所以我认为对于专注时间和个人生产力，我认为能够拥有理想的设置，我们称之为“无限办公室”。我们已经为我们的 VR 头显提供了这个版本，而且它的改进非常快。我认为这对于多任务处理和在任何地方设置环境都非常有用。有很多研究表明，当人们可以同时提取多个彼此相关的事情时，他们会更有效率。如果您正在编码，打开多个窗口而不是单任务处理，这很重要。所以我认为这将是一个。我认为另一个非常令人兴奋的领域基本上是召开会议。我已经在 VR 中进行了很多会议。尽管今天的化身不像几年后那么逼真，但在很多方面它已经感觉几乎更真实，更像是你有一种空间感，而不是 Zoom 通话，因为你有共享空间感。所以如果有人坐在你的右边，你就坐在他们的左边。如果你围成一圈，每个人都可以记住人们的顺序。有空间音频。你看向桌子的头，那里可能有一个屏幕，那些不能使用 VR 或 AR 的人可以在那里进行视频会议，并从外面参加你的会议。您可以进行投影，不同的人可以根据需要共享任意数量的文档。所以不再是“哦，我一次只能共享一个文档”，因为您认为每个人都只有一个屏幕。在 VR 中，人们可以根据需要调出任意数量的屏幕，这样您就可以在会议期间分享任意数量的上下文。你有一个白板，人们可以画画。它很狂野。而我们显然才刚刚开始。所以我认为这将是非常令人兴奋的，人们可以定制他们的办公空间，并有它的感觉......", "note_en": "As June came to an end, Facebook CEO Mark Zuckerberg told his employees about an ambitious new initiative. The future of the company would go far beyond its current project of building a set of connected social apps and some hardware to support them. Instead, he said, Facebook would strive to build a maximalist, interconnected set of experiences straight out of sci-fi — a world known as the metaverse.\n The company’s divisions focused on products for communities, creators, commerce, and virtual reality would increasingly work to realize this vision, he said in a remote address to employees. “What I think is most interesting is how these themes will come together into a bigger idea,” Zuckerberg said. “Our overarching goal across all of these initiatives is to help bring the metaverse to life.”\n The metaverse is having a moment. Coined in  Snow Crash, Neal Stephenson’s 1992 sci-fi novel, the term refers to a convergence of physical, augmented, and virtual reality in a shared online space. Earlier this month,   The  New York Times explored how companies and products including Epic Games’  Fortnite,  Roblox, and even  Animal Crossing: New Horizons increasingly had metaverse-like elements. (Epic Games CEO Tim Sweeney has been discussing his desire to contribute to a metaverse for  many months now.)\n “we will effectively transition from people seeing us as primarily being a social media company to being a metaverse company”\n In January 2020, an influential essay by the venture capitalist Matthew Ball  set out to identify key characteristics of a metaverse. Among them: it has to span the physical and virtual worlds; contain a fully fledged economy; and offer “unprecedented interoperability” — users have to be able to take their avatars and goods from one place in the metaverse to another, no matter who runs that particular part of it. Critically, no one company will run the metaverse — it will be an “embodied internet,” Zuckerberg said, operated by many different players in a decentralized way.\n Watching Zuckerberg’s presentation, I couldn’t decide which was more audacious: his vision itself or his timing. Zuckerberg’s announced intention to build a more maximalist version of Facebook, spanning social presence, office work, and entertainment, comes at a time when the US government is attempting to break his current company up. A package of bills making its way through Congress would potentially force the company to spin out Instagram and WhatsApp, and limit Facebook’s ability to make future acquisitions — or offer services connected to its hardware products.\n And even if tech regulation stalls in the United States — historically not a bad bet — a thriving metaverse would raise questions both familiar and strange about how the virtual space is governed, how its contents would be moderated, and what its existence would do to our shared sense of reality. We’re still getting our arms wrapped around the two-dimensional version of social platforms; wrangling the 3D version could be exponentially harder.\n At the same time, Zuckerberg said, the metaverse will bring enormous opportunity to individual creators and artists; to individuals who want to work and own homes far from today’s urban centers; and to people who live in places where opportunities for education or recreation are more limited. A realized metaverse could be the next best thing to a working teleportation device, he says. With the company’s Oculus division, which produces the Quest headset, Facebook is trying to develop one.\n “I don’t think that this is primarily about being engaged with the internet more. I think it’s about being engaged more naturally.”\n After I watched his speech, Zuckerberg and I had a conversation. (The metaverse being unavailable to us at press time, we used Zoom.) We discussed his vision for an embodied internet, the challenges of governing it, and gender imbalance in virtual reality today. And with President Biden’s fierce criticism of Facebook’s failures in removing anti-vaccine content in the headlines, I asked him about that, too.\n “It’s a little bit like fighting crime in a city,” he told me. “No one expects that you’re ever going to fully solve crime in a city.”\n     Thanks, Casey. It’s good to be here. We’ve got a lot to go through.\n As always, there’s a lot to discuss with you — and the White House is demanding Facebook do more to remove vaccine misinformation, which I know is on a lot of people’s minds right now. I want to get to that, but I want to start with this talk you gave internally at Facebook a few weeks ago, which I recently had a chance to watch. You told your employees that your future vision of Facebook is not the two-dimensional version of it that we’re using today, but something called the metaverse. So what is a metaverse and what parts of it does Facebook plan to build?\n This is a big topic. The metaverse is a vision that spans many companies — the whole industry. You can think about it as the successor to the mobile internet. And it’s certainly not something that any one company is going to build, but I think a big part of our next chapter is going to hopefully be contributing to building that, in partnership with a lot of other companies and creators and developers. But you can think about the metaverse as an embodied internet, where instead of just viewing content — you are in it. And you feel present with other people as if you were in other places, having different experiences that you couldn’t necessarily do on a 2D app or webpage, like dancing, for example, or different types of fitness.\n “we’re basically mediating our lives and our communication through these small, glowing rectangles. I think that that’s not really how people are made to interact.”\n I think a lot of people, when they think about the metaverse, they think about just virtual reality — which I think is going to be an important part of that. And that’s clearly a part that we’re very invested in, because it’s the technology that delivers the clearest form of presence. But the metaverse isn’t just virtual reality. It’s going to be accessible across all of our different computing platforms; VR and AR, but also PC, and also mobile devices and game consoles. Speaking of which, a lot of people also think about the metaverse as primarily something that’s about gaming. And I think entertainment is clearly going to be a big part of it, but I don’t think that this is just gaming. I think that this is a persistent, synchronous environment where we can be together, which I think is probably going to resemble some kind of a hybrid between the social platforms that we see today, but an environment where you’re embodied in it.\n So that  can be 3D — it doesn’t have to be. You might be able to jump into an experience, like a 3D concert or something, from your phone, so you can get elements that are 2D or elements that are 3D. I’d love to go through a bunch of the use cases in more detail, but overall, I think that this is going to be a really big part of the next chapter for the technology industry, and it’s something that we’re very excited about.\n It just touches a lot of the biggest themes that we’re working on. Think about things like community and creators as one, or digital commerce as a second, or building out the next set of computing platforms, like virtual and augmented reality, to give people that sense of presence. I think all of these different initiatives that we have at Facebook today will basically ladder up together to contribute to helping to build this metaverse vision.\n “I’ve been thinking about some of this stuff since I was in middle school and just starting to code”\n And my hope, if we do this well, I think over the next five years or so, in this next chapter of our company, I think we will effectively transition from people seeing us as primarily being a social media company to being a metaverse company. And obviously, all of the work that we’re doing across the apps that people use today contribute directly to this vision in terms of building community and creators. So there’s a lot to jump into here. I’m curious what direction you want to take this in. But this is something that I’m spending a lot of time on, thinking a lot about, we’re working on a ton. And I think it’s just a big part of the next chapter for the work that we’re going to do in the whole industry.\n This feels like a fairly far-future vision, even though parts of it are visible now and coming together. I think overall, it feels like a very maximalist version of what the internet could be. You talk to employees about, “from the moment we wake up to the moment we go to bed, being able to jump into the metaverse to do almost anything you can imagine.” And probably some of us are using the internet that way already.\n But this description feels more like the metaverse that might be familiar to us from books like   Ready Player One  or   Snow Crash , or maybe like   Fortnite  today, where some of the most important aspects of our lives, including our work, are being lived and done inside these virtual spaces. Are those good analogs for the kind of world that you’re talking about?\n Well, what I’m excited about is helping people deliver and experience a much stronger sense of presence with the people they care about, the people they work with, the places they want to be. And the reality is that today with the mobile internet, we already have something that a lot of people access from the moment they wake up to when they go to bed. I don’t know about you, but a lot of mornings, I reach for my phone by my bedside before I even put on my glasses, just to make sure, get whatever text messages I got during the middle of the night and make sure that nothing has gone wrong that I need to jump into immediately upon waking up. So I don’t think that this is primarily about being engaged with the internet more. I think it’s about being engaged more naturally.\n And today, I think about the computing platforms that we have. We have these phones. They’re relatively small. A lot of the time that we’re spending, we’re basically mediating our lives and our communication through these small, glowing rectangles. I think that that’s not really how people are made to interact. A lot of the meetings that we have today, you’re looking at a grid of faces on a screen. That’s not how we process things either. We’re used to being in a room with people and having a sense of space where if you’re sitting to my right, then that means I’m also sitting to your left, so we have some shared sense of space in common. When you speak, it’s coming from my right. It’s not just all coming from the same place in front of me.\n I don’t know how much you’ve had this experience, but I have a bunch, in work meetings over the last year, where I sometimes find it hard to remember what meeting someone said something in because they all look the same and they all blend together. And I think part of that is because we don’t have this sense of presence in space. What virtual and augmented reality can do, and what the metaverse broadly is going to help people experience, is a sense of presence that I think is just much more natural in the way that we’re made to interact. And I think it will be more comfortable. The interactions that we have will be a lot richer, they’ll feel real. In the future, instead of just doing this over a phone call, you’ll be able to sit as a hologram on my couch, or I’ll be able to sit as a hologram on your couch, and it’ll actually feel like we’re in the same place, even if we’re in different states or hundreds of miles apart. So I think that that is really powerful.\n I’ve been thinking about some of this stuff since I was in middle school and just starting to code. I remember when I was in math class, I would have my notebook and I’d basically just sit there and write code and ideas for things I wanted to go code when I got home from school that day. And some of them I was able to do back then, but one of the things that I really wanted to build was basically the sense of an embodied internet where you could be in the environment and teleport to different places and be with friends.\n I think some combination of the fact that I probably didn’t know enough math to pull it off then, and just the technology was decades away from really being ready to do that in a good way — that wasn’t the direction that I gravitated in originally, in terms of building different social experiences. But this is something that I’ve been excited about. I’ve thought that this would be the holy grail of social interactions from well before when I started Facebook. And it’s really exciting to me that now the next set of platforms are going to be able to do this.\n “People aren’t meant to navigate things in terms of a grid of apps”\n One of the reasons why we’re investing so much in augmented and virtual reality is mobile phones kind of came around at the same time as Facebook, so we didn’t really get to play a big role in shaping the development of those platforms. So they didn’t really develop in a very natural way, from my perspective. People aren’t meant to navigate things in terms of a grid of apps. I think we interact much more naturally when we think about being present with other people. We orient ourselves and think about the world through people and the interactions we have with people and what we do with them. And I think if we can help build the next set of computing platforms and experiences across that in a way that’s more natural and lets us feel more present with people, I think that’ll be a very positive thing.\n I’m not sure that people would necessarily find it more natural to work all day wearing a VR helmet, but maybe it’s something we get used to. But I am really interested in some of the things that you’ve said about the way a metaverse could create jobs that don’t exist today, like whole economies springing up inside of this metaverse. What novel new forms of work do you see happening in this world you want to build?\n So, let me get to that in a second. But just to go back to your comment about people not working in  [a VR helmet] all day long — there’s clearly an evolution, or multiple, in the technology that are going to need to be possible, that will need to happen before this is the main way that people work. But I think we’re going to be there by the end of this decade. Today, the VR headsets, they’re still kind of a bit clunky, they may be a bit heavier than you would ideally like them to be. There need to be advances in being able to express yourself and having higher resolution, being able to read text better, a number of things like that. But we’re getting there, and each version is better and better. And Quest 2 has been a real hit so far in terms of how people are using it. I’ve been surprised.\n  We planned on it mostly being used for games and thought that a lot of these social interactions or things around work wouldn’t come until later, but a lot of the biggest experiences on Quest 2, that people spend the most time in, are already just hanging out socially. And there are a number of things around work and productivity. There are even experiences that I really hadn’t thought about, things like fitness. These apps like  Supernatural and FitXR, which you can kind of think about it like Peloton, but instead of having a bike or a treadmill, the device is your VR headset and you’re basically taking a class in there, where you’re boxing or dancing. And it’s really fun. I think if you haven’t tried it out, it’s something that a lot of people are enjoying.\n But going back to your point about work, and how this is going to work, I also don’t think this is going to be all VR. I think it’s going to be AR too. And part of the reason why VR is available, and why you have things like the Quest 2 years before you’re going to have AR glasses is because it’s a little more socially acceptable to wear something like a VR headset in the comfort of your own home. But I think to get AR glasses that we wear around throughout the day, they have to be normal-looking glasses, right? So you’re basically cramming all of these materials to build what we would’ve thought of as a supercomputer 10 years ago into the frame of glasses that are about five millimeters thick — you have computer chips, and networking chips, and holographic wave guides, and things for sensing and mapping out the world, and batteries and speakers, all this stuff, and it just needs to fit into these glasses — so that is a real challenge.\n And I actually would go so far as to say that I think that might be one of, if not the biggest technological challenge that our industry will face in the next decade. We tend to really celebrate things that are big, right? But I actually think miniaturizing things and getting a supercomputer to fit into a pair of glasses is actually one of the bigger challenges. But once you have that, so you have those glasses and you have your VR headset, I think that’s going to enable a bunch of really interesting use cases.\n So, one is you will be able to, with basically a snap of your fingers, pull up your perfect workstation. So anywhere you go, you can walk into a Starbucks, you can sit down, you can be drinking your coffee and kind of wave your hands and you can have basically as many monitors as you want, all set up, whatever size you want them to be, all preconfigured to the way you had it when you were at your home before. And you can just bring that with you wherever you want.\n  If you want to talk to someone, you’re working through a problem, instead of just calling them on the phone, they can teleport in, and then they can see all the context that you have. They can see your five monitors, or whatever it is, and the documents or all the windows of code that you have, or a 3D model that you’re working on. And they can stand next to you and interact, and then in a blink they can teleport back to where they were and kind of be in a separate place.\n So I think for focus time and individual productivity, I think being able to have your ideal setup, we call this “infinite office.” We already have a version of this for our VR headsets, and it’s improving very quickly. I think it’s going to be great for multitasking and for getting your environment set up everywhere. There’ve been a lot of studies that show that people are more effective when they can pull up multiple of the things that they’re working on that are related to each other at once. If you’re coding, having multiple windows open rather than single-tasking, that’s a big deal. So I think that that’s going to be one.\n The other area that I think is going to be pretty exciting is basically doing meetings. And I already do a bunch of meetings in VR. Even though the avatars aren’t as realistic today as they will be in a few years, in a lot of ways it already feels almost more real, and more like you have a sense of space, than a Zoom call, because you have the shared sense of space. So if someone is sitting to your right, you’re sitting to their left. If you’re sitting in a circle, everyone can kind of remember what order people were in. There’s spatial audio. You look over to the head of the table and there could be a screen there, where people who can’t be in VR or AR can videoconference in and be a part of your meeting from outside. You can project and different people can share as many documents as they want. So it’s no more of this, “Oh, I can only share one document at a time,” because everyone, you presume, only has one screen. And in VR, people can pull up as many screens as they want so you can share as much context as you want during a meeting. You have a whiteboard, people can draw. It’s pretty wild.\n And we’re clearly just at the beginning of this. So I think that that’s going to be very exciting and people can customize their office space, and have it feel li\n......", "posttime": "2021-07-22 23:32:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,共享,comments,认为", "title": "与扎克伯格就他对元宇宙的愿景及其进一步分裂我们共享现实感的潜力进行问答，拜登对 Facebook 的评论，更多", "title_en": "Q&A with Zuckerberg about his vision for the metaverse and its potential to further splinter our sense of shared reality, Biden's comments about Facebook, more", "transed": 1, "url": "https://www.theverge.com/22588022/mark-zuckerberg-facebook-ceo-metaverse-interview?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["facebook", "共享", "comments", "认为"]}, {"category": "", "categoryclass": "", "imagename": "24aab3ae9691ce77410eedccf1f6e1c2.png", "infoid": 1069017, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国天主教主教会议的最高管理者在一家天主教媒体网站告诉会议后辞职，该网站可以访问手机数据，这些数据似乎表明他是酷儿约会应用程序 Grindr 的常客，并经常光顾同性恋酒吧。一些隐私专家表示，他们不记得电话数据被去匿名化和公开报告的其他实例，但这并不违法，而且随着人们开始了解其他人的哪些数据可用，这种情况可能会发生更多。从去年秋天开始，杰弗里·伯里尔 (Jeffrey Burrill) 主教一直担任 USCCB 的秘书长，该职位负责协调该会议的所有行政工作和规划，该会议是该国天主教主教的网络。作为一名牧师，他发誓要独身。天主教教义反对异性婚姻以外的性活动。周二早上，《全国天主教记者》第一个报道了伯里尔辞职的消息，理由是 USCCB 主席何塞·戈麦斯大主教给其他主教的备忘录。周二的备忘录称，戈麦斯“悲伤地”宣布伯里尔辞职，并称前一天，USCCB 工作人员获悉“即将发生的媒体报道称可能存在不当行为”。 Burrill 是来自威斯康星州拉克罗斯教区的神父，在 2016 年加入 USCCB 的行政人员之前，他是一名教区神父和教授。 USCCB 的一些工作人员和前工作人员表示，他们感到震惊和震惊。 USCCB 女发言人 Chieko Noguchi 周二下午告诉《华盛顿邮报》，这是 Burrill 的辞职决定，并且是在天主教新闻网站 Pillar 向 USCCB 提出他“不当行为”的指控之后发生的。 “然而，为了避免分散会议的运作和正在进行的工作，Monsignor 已立即辞职，”戈麦斯在声明中写道。 “会议认真对待所有不当行为的指控，并将采取一切适当措施来解决这些问题。”\n目前尚不清楚谁收集了有关 Burrill 的信息。 USCCB 发言人周二拒绝回答有关其对信息收集的了解以及其领导层对此有何看法的问题，只是表示 USCCB 并未参与其中。他们还拒绝评论他们是否知道 Burrill 所谓的行为是通过私人电话还是教会拥有的电话进行跟踪的。辞职源于Pillar的报道，这是一份报道天主教会的在线通讯。周二下午，在 Burrill 的辞职公之于众后，Pillar 报告说，它已根据 Grindr 从其用户收集的数据获取信息，并聘请了一家独立公司对其进行验证。 “在 2018 年、2019 年和 2020 年的部分时间里，与 Burrill 相关的移动设备几乎每天都从基于位置的连接应用程序 Grindr 发出应用程序数据信号——在他的 USCCB 办公室和他在 USCCB 拥有的住所，以及在 USCCB 会议和其他城市的活动期间，“支柱报道。 “The Pillar 获取和分析的数据在两个 26 周期间传达了移动应用程序日期信号，第一个是 2018 年，第二个是 2019 年和 2020 年。这些数据是从数据供应商那里获得的，并由签约的独立数据咨询公司进行验证由 The Pillar 提供，”该网站报道。它没有确定供应商是谁，也没有确定该网站是购买信息还是从第三方获得信息。 Pillar 的故事说，与 Burrill 的手机“相关”的应用程序数据显示，这位牧师访问了同性恋酒吧，包括在为 USCCB 旅行时。 Grindr 的一位女发言人将 Pillar 的故事描述为“恐同”，并否认其中描述的数据可以公开访问。 “从技术角度来看，那篇未署名的博客文章中列出的所谓活动是不可行的，而且极不可能发生，”她在周二晚些时候的一份声明中说。 “绝对没有证据支持与 Grindr 应用程序有关的不当数据收集或使用指控。”\n长期以来，隐私专家一直对应用程序收集并出售给聚合商和营销公司或与聚合商和营销公司共享的“匿名”数据表示担忧。虽然信息通常没有明显的识别字段，例如用户的姓名或电话号码，但它可以包含从年龄和性别到设备 ID 的所有内容。专家可以对其中一些数据进行去匿名化并将其与真人联系起来。斯坦福大学以人为中心的人工智能研究所的隐私和数据政策研究员詹妮弗·金说，没有联邦法律禁止购买这些数据。虽然一些州法律可能会规范此类信息的使用，但她表示，这些法律往往侧重于跟踪场景。 King 表示，Burrill 手机位置数据的发布提醒人们，任何拥有打开位置数据的手机的人都不是真正的匿名者。隐私保护公司 Disconnect 的首席技术官帕特里克杰克逊表示，他不知道其他电话数据被去匿名化和公开报告的情况，但预计这种情况会更频繁地发生。 “它释放了一条用户无法停止的链条，因为他们甚至不知道它是从一开始就被收集的，而且他们不知道这些数据实际上在哪里，”杰克逊说。 “但它就在那里，而且可以出售。”周一，天主教通讯社（Pillar 记者的前任雇主）发表了一篇无来源的故事，在教会内部引发了关于隐私和据称有人跟踪神职人员以捕捉使用诸如 Grindr 等联播应用程序的人的问题。报道称，“一名关心改革天主教神职人员的人从 2018 年开始与包括 CNA 在内的一些教会个人和组织接洽”。该报道与《华盛顿邮报》和其他组织报道的军事级间谍软件通常租借给政府以追踪恐怖分子的同一周犯罪分子曾试图成功入侵属于记者、人权活动家、企业高管和其他人的 37 部智能手机，揭示了围绕技术、隐私和民主的新担忧和问题。当天最重要的新闻报道，由邮政编辑策划，每天早上发布。", "note_en": "The top administrator of the U.S. Conference of Catholic Bishops resigned after a Catholic media site told the conference it had access to cellphone data that appeared to show he was a regular user of Grindr, the queer dating app, and frequented gay bars.\n   Some privacy experts said that they couldn’t recall other instances of phone data being de-anonymized and reported publicly, but that it’s not illegal and will likely happen more as people come to understand what data is available about others.\n Monsignor Jeffrey Burrill has since last fall been the general secretary of the USCCB, a position that coordinates all administrative work and planning for the conference, which is the country’s network for Catholic bishops. As a priest, he takes a vow of celibacy. Catholic teaching opposes sexual activity outside heterosexual marriage.\n    The  National Catholic Reporter was the first to report Tuesday morning that Burrill had resigned, citing a memo from Archbishop José Gomez, the USCCB president, to other bishops. The Tuesday memo said it was “with sadness” that Gomez announced Burrill’s resignation, saying the day before, the USCCB staff learned of “impending media reports alleging possible improper behavior.”\n Burrill is a priest from the La Crosse, Wis., diocese and was a parish priest and a professor before joining the administrative staff of the USCCB in 2016. Some USCCB staff and former staff said they were reeling and shocked.\n  USCCB spokeswoman Chieko Noguchi told The Washington Post on Tuesday afternoon it was Burrill’s decision to resign, and came after allegations of his “improper behavior” were brought to the USCCB by the Pillar, a Catholic news site.\n   “However, to avoid becoming a distraction to the operations and ongoing work of the Conference, Monsignor has resigned effective immediately,” read the statement from Gomez. “The Conference takes all allegations of misconduct seriously and will pursue all appropriate steps to address them.”\n It wasn’t clear who had collected the information about Burrill. USCCB spokespeople declined to answer questions Tuesday about what it knew about the information-gathering and what its leadership feels about it, except to say the USCCB wasn’t involved. They also declined to comment on whether they knew if Burrill’s alleged actions were tracked on a private or church-owned phone.\n The resignation stemmed from reporting in  the Pillar, an online newsletter that reports on the Catholic Church. Tuesday afternoon, after Burrill’s resignation became public, the Pillar reported that it had obtained information based  on the data Grindr collects from its users, and hired an independent firm to authenticate it.\n   “A mobile device correlated to Burrill emitted app data signals from the location-based hookup app Grindr on a near-daily basis during parts of 2018, 2019, and 2020 — at both his USCCB office and his USCCB-owned residence, as well as during USCCB meetings and events in other cities,” the Pillar reported.\n “The data obtained and analyzed by The Pillar  conveys mobile app date signals during two 26-week periods, the first in 2018 and the second in 2019 and 2020. The data was obtained from a data vendor and authenticated by an independent data consulting firm contracted by The Pillar,” the site reported. It did not identify who the vendor was or if the site bought the information or got it from a third party.\n The Pillar story says app data “correlated” to Burrill’s phone shows the priest visited gay bars, including while traveling for the USCCB.\n     A spokeswoman for Grindr described the Pillar’s story as “homophobic” and denied that the data described in it could be publicly accessed.\n “The alleged activities listed in that unattributed blog post are infeasible from a technical standpoint and incredibly unlikely to occur,” she said late Tuesday in a statement. “There is absolutely no evidence supporting the allegations of improper data collection or usage related to the Grindr app as purported.”\n Privacy experts have long raised concerns about “anonymized” data collected by apps and sold to or shared with aggregators and marketing companies. While the information is typically stripped of obviously identifying fields, like a user’s name or phone number, it can contain everything from age and gender to a device ID. It’s possible for experts to de-anonymize some of this data and connect it to real people.\n   No federal laws prohibit buying this data, said Jennifer King, a privacy and data policy fellow at the Stanford University Institute for Human-Centered Artificial Intelligence. While some state laws may regulate the use of this kind of information, she said those tend to focus on stalking scenarios. King said the publication of location data from Burrill’s phone serves as a reminder that anyone with a cellphone whose location data is turned on is not truly anonymous.\n Patrick Jackson, chief technology officer of the privacy-protection firm Disconnect, said he was unaware of other instances of phone data being de-anonymized and reported publicly but expects it to happen more frequently.\n “It unleashes this chain that a user cannot stop because they don’t even know that it was collected in the first place and they have no idea where this data actually lives,” Jackson said. “But it’s out there, and it’s for sale.”\n   On Monday,  the Catholic News Agency — the previous employer of Pillar journalists — published an unsourced story raising issues within the church about privacy and people allegedly tracking members of the clergy to catch those who use hookup apps such as Grindr. The story said “a person concerned with reforming the Catholic clergy approached some Church individuals and organizations” including CNA starting in 2018.\n The report comes the same week as The Post and other organizations reported that military-grade spyware normally leased to governments for tracking terrorists and criminals  was used in attempted and successful hacks of 37 smartphones belonging to journalists, human rights activists, business executives and others, revealing new concerns and issues around technology and privacy and democracy.\n    The most important news stories of the day, curated by Post editors and delivered every morning.", "posttime": "2021-07-22 23:32:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,美国,数据,catholic,usccb", "title": "美国天主教会高级官员在一家天主教媒体网站从一家未公开的数据经纪人那里获得他所谓的 Grindr 应用程序和电话位置数据后辞职", "title_en": "Top US Catholic Church official resigns after a Catholic media site obtained his alleged Grindr app and phone location data from an undisclosed data broker", "transed": 1, "url": "https://www.washingtonpost.com/religion/2021/07/20/bishop-misconduct-resign-burrill/", "via": "", "real_tags": ["程序", "美国", "数据", "catholic", "usccb"]}, {"category": "", "categoryclass": "", "imagename": "928dd585679d6f5abd6c098674702fb5.jpg", "infoid": 1069015, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(CNN) 根据丹麦的一项新研究，在过去 25 年中，与滥用大麻有关的精神分裂症病例比例有所增加。 1995 年，该国 2% 的精神分裂症诊断与大麻使用障碍有关。 2000 年，它增加到 4% 左右。研究发现，自 2010 年以来，这一数字增加到 8%。 “我认为利用我们的研究和其他研究来强调和强调大麻的使用并非无害是非常重要的，”哥本哈根心理健康研究中心副教授、该研究的作者 Carsten Hjorthøj 说。医学杂志 JAMA Psychiatry，通过电子邮件。 “不幸的是，有证据表明大麻越来越多地被视为一种无害的物质。这很不幸，因为我们发现它与精神分裂症、认知功能较差、物质使用障碍等有关，”Hjorthøj 写道。先前的研究表明，使用大麻的人患精神分裂症的风险更高，而这种关联尤其是由于大量使用这种药物。许多研究人员假设大麻的使用可能是一个“组成部分”，它与其他风险因素相互作用，导致这种情况。 “当然，我们的发现必须在其他地方复制才能得出确切的结论，”Hjorthøj 继续说道。 “但我确实相当有信心，我们会在有问题的大麻使用增加或大麻效力增加的地方看到类似的模式，因为许多研究表明，高效大麻可能是与精神分裂症相关的驱动因素.”全世界有数千万人使用大麻。在美国 19 个州和加拿大用于娱乐用途是合法的。在这些地方和其他一些地方，它还被批准用于治疗某些疾病。\n该研究称，丹麦的大麻使用和大麻使用障碍一直在增加——这种模式在全球范围内也有出现。娱乐性杂草在丹麦是非法的，但允许用于医疗目的。大麻使用障碍通常被定义为药物使用有问题：产生对杂草的耐受性；使用大麻的数量或时间比预期的要长；无法减少使用；花费大量时间获取、使用或从大麻的影响中恢复；放弃有利于大麻的重要活动和义务；尽管有负面后果，但仍继续使用该药物。精神分裂症是一种慢性、严重和致残的精神障碍。其症状可能包括妄想、思维障碍和幻觉。在世界范围内，精神分裂症影响着 2000 万人。没有治愈方法，因此医生会尝试通过药物和治疗来控制症状。 Hjorthøj 说，虽然一项研究表明丹麦的精神分裂症正在增加，但在其他国家，情况还不确定。在美国，美国国家心理健康研究所表示，很难准确估计精神分裂症的患病率，因为诊断很复杂，而且与其他疾病重叠。 “许多精神病学教科书都指出，精神分裂症的发病率……随着时间的推移是恒定的，与地理位置无关，”Hjorthøj 说。 “这经常被用作反对大麻可能导致精神分裂症的假设的论据，”他补充道。 “然而，事实证明，支持这一观点的研究很少。”这项新研究基于丹麦国家健康登记处的数据，包括所有在 2000 年 12 月 31 日之前出生的丹麦人，他们在 1972 年 1 月 1 日至 2016 年 12 月 31 日的某个时间点年满 16 岁。\n该研究结果可能有助于解释“近年来观察到的精神分裂症发病率普遍增加”，并提供了一些支持，即“长期观察到的大麻与精神分裂症之间的关联可能在本质上是部分因果关系”，该研究称。伦敦国王学院精神病学、心理学和神经科学研究所社会行为与发展教授兼主席 Terrie Moffitt 指出，该研究评估了临床诊断为大麻治疗障碍的人，而不是一般使用该药物的人。 “这项对全国医疗记录的研究增加了重要的证据，表明被诊断出大麻使用障碍的患者现在比过去更容易患精神病，”研究大麻使用对婴儿潮一代心理健康影响的莫菲特，告诉伦敦科学媒体中心。然而，莫菲特说，大多数大麻使用者，即使是那些依赖它的人，也从不寻求治疗，而且许多人只是为了消遣而使用它而不会出现问题。在此处注册，每周二与 CNN 健康团队的 Sanjay Gupta 博士一起获取结果。 “众所周知，寻求治疗的人往往有多种心理健康问题，而不仅仅是大麻问题，”莫菲特说。 “并且有更多的休闲大麻使用者能够很好地管理大麻，而不是无法管理大麻的依赖大麻的使用者。”哈佛大学公共卫生学院流行病学和生物统计学系教授 Tyler J. VanderWeele 在与该研究同时发表的一篇社论中说，由于对大麻使用障碍的诊断不足，该研究中的估计可能是保守的.\n“大麻使用障碍不是大多数精神分裂症病例的原因，但它造成的比例不可忽视且不断增加。在讨论大麻使用合法化和监管时应该考虑到这一点，”VanderWeele 在评论中写道。", "note_en": "(CNN)The proportion of schizophrenia cases linked with problematic use of marijuana has increased over the past 25 years, according to a new study from Denmark.\n In 1995, 2% of schizophrenia diagnoses in the country were associated with cannabis use disorder. In 2000, it increased to around 4%. Since 2010, that figure increased to 8%, the study found.\n &#34;I think it is highly important to use both our study and other studies to highlight and emphasize that cannabis use is not harmless,&#34; said Carsten Hjorthøj, an associate professor at the Copenhagen Research Center for Mental Health and an author of the study published in the medical journal JAMA Psychiatry, via email.\n     &#34;There is, unfortunately, evidence to suggest that cannabis is increasingly seen as a somewhat harmless substance. This is unfortunate, since we see links with schizophrenia, poorer cognitive function, substance use disorders, etc,&#34; Hjorthøj wrote.\n    Previous research has suggested that the risk of schizophrenia is heightened for people who use cannabis, and the association is particularly driven by heavy use of the drug. Many  researchers hypothesize that cannabis use may be a &#34;component cause,&#34; which interacts with other risk factors, to cause the condition.\n  &#34;Of course, our findings will have to be replicated elsewhere before firm conclusions can be drawn,&#34; Hjorthøj continued. &#34;But I do feel fairly confident that we will see similar patterns in places where problematic use of cannabis has increased, or where the potency of cannabis has increased, since many studies suggest that high-potency cannabis is probably the driver of the association with schizophrenia.&#34;\n Around the world tens of millions of people use cannabis. It&#39;s legal for recreational use in  19 US states and Canada. In these and some other places, it&#39;s also approved to treat some medical conditions.\n  Cannabis use and cannabis use disorder have been increasing in Denmark, the study said --  a pattern that&#39;s also seen globally.  Recreational weed use is illegal in Denmark but is allowed for medicinal purposes.\n Cannabis use disorder is usually defined as a problematic use of the drug: developing tolerance to weed; using cannabis in larger amounts or over a longer period than intended; being unable to reduce use; spending a lot of time obtaining, using or recovering from the effects of cannabis; giving up important activities and obligations in favor of cannabis; and continued use of the drug despite negative consequences.\n  Schizophrenia is a chronic, severe and disabling mental disorder. Its symptoms may include delusions, thought disorder and hallucinations. Worldwide,  schizophrenia affects 20 million people. No cure exists, so doctors try to manage the symptoms with medications and therapy.\n While one study has suggested that schizophrenia is increasing in Denmark, in other countries the picture is uncertain, said Hjorthøj. In the US, the  National Institute of Mental Health said it&#39;s hard to obtain accurate estimates of the prevalence of schizophrenia because diagnosis is complex and it overlaps with other disorders.\n &#34;Many textbooks in psychiatry state that the incidence... of schizophrenia is constant over time and independent of geographical location,&#34; Hjorthøj said.\n &#34;And this has often been used as an argument against the hypothesis that cannabis could cause schizophrenia,&#34; he added. &#34;However, it turns out that there is very little research that would support this notion.&#34;\n  The new study was based on data from Denmark&#39;s national health registry and included all people in Denmark born before December 31, 2000, who were 16 years or older at some point from January 1, 1972, to December 31, 2016.\n The findings could help explain the &#34;general increase in the incidence of schizophrenia that has been observed in recent years&#34; and provides some support that the &#34;long-observed association between cannabis and schizophrenia is likely partially causal in nature,&#34; the study said.\n  The study assessed people who had a clinical diagnosis for cannabis treatment disorder, not general use of the drug, noted Terrie Moffitt, a professor and chair in Social Behaviour &amp; Development of the Institute of Psychiatry, Psychology, and Neuroscience at King&#39;s College London.\n &#34;This study of nationwide medical records adds important evidence that patients with diagnosed cannabis use disorder are more at risk for psychosis now than they used to be,&#34; Moffitt, who studies the effects of cannabis use on the mental health of the baby boomer generation, told the Science Media Centre in London.\n However, Moffitt said that most cannabis users, even those who are dependent on it, never seek treatment and many people use it recreationally without developing problems.\n Sign up here to get  The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\n &#34;It is known that people who seek treatment tend to have multiple mental health problems, not solely cannabis problems,&#34; Moffitt said. &#34;And there are far more recreational cannabis users who manage cannabis well than cannabis-dependent users who cannot manage it.&#34;\n   In an editorial that accompanied the study, Tyler J. VanderWeele, a professor in the Departments of Epidemiology and Biostatistics at the Harvard T. H. Chan School of Public Health, said that the that estimates in the study could be conservative because of underdiagnosis of cannabis use disorder.\n &#34;Cannabis use disorder is not responsible for most schizophrenia cases, but it is responsible for a nonnegligible and increasing proportion. This should be considered in discussions regarding legalization and regulation of the use of cannabis,&#34; VanderWeele wrote in the commentary.", "posttime": "2021-07-22 23:31:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linked,研究", "title": "与大麻使用障碍有关的精神分裂症呈上升趋势，研究", "title_en": "Schizophrenia linked to marijuana use disorder is on the rise, study", "transed": 1, "url": "https://www.cnn.com/2021/07/22/health/marijuana-schizophrenia-study-wellness/index.html", "via": "", "real_tags": ["linked", "研究"]}, {"category": "", "categoryclass": "", "imagename": "c5c912da1c934d0310b2916689a31a9a.png", "infoid": 1069014, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "DuckDuckGo 正在推出电子邮件保护测试版，这是我们应用程序中的一项新功能，可在不切换电子邮件服务的情况下保护您的电子邮件隐私。加入私人候补名单！获取免费的个人 @duck.com 电子邮件地址。发送到它的电子邮件将转发到您的常规收件箱，删除令人毛骨悚然的电子邮件跟踪器。在 DuckDuckGo 应用程序和扩展程序中生成唯一的私人电子邮件地址，这样您的电子邮件地址就不会被跟踪。阅读您的电子邮件应该是一项私人活动。您可能会惊讶地发现，70% 的电子邮件包含跟踪器，可以检测您何时打开邮件、打开邮件时您所在的位置以及您使用的设备。如果这还不够令人毛骨悚然，这些电子邮件数据可用于对您进行分析，包括向您投放广告，并影响您在网上看到的内容。曾经打开电子邮件并在此后不久看到有关它的相关广告吗？是的，责怪电子邮件跟踪器。这些关于您的数据通常也会直接发送给第三方，很可能未经您的同意。我们很高兴地宣布 DuckDuckGo 的电子邮件保护测试版。我们的免费电子邮件转发服务可删除电子邮件跟踪器并保护您个人电子邮件地址的隐私，而无需您更改电子邮件服务或应用程序。大多数现有的电子邮件隐私解决方案都有重要的权衡。您要么必须完全切换电子邮件服务或应用程序，要么通过隐藏所有图像来降低您的电子邮件体验。我们认为保护您的个人信息免于泄露给第三方应该是简单而无缝的，就像 DuckDuckGo 隐私保护包的其余部分一样。选择您的 Duck 电子邮件地址 (you@duck.com) 并开始分发。我们从发送到此地址的传入电子邮件中删除隐藏的跟踪器，然后将它们转发到您的常规收件箱，以便更安全地阅读。这意味着如果您使用 Gmail 或 Yahoo 等电子邮件服务，那没问题！发送到您的个人鸭子地址的电子邮件将照常到达那里，因此您可以像往常一样在任何应用程序或网络上阅读您的电子邮件，无忧无虑。在应用程序中获得自动电子邮件保护。 DuckDuckGo 应用程序和扩展程序可在浏览网页时轻松访问您的个人鸭子地址，还为您提供按需生成新的私人鸭子地址的选项。\n在您认为可能会向您发送垃圾邮件或共享您的电子邮件地址的网站上，私人鸭子地址将保护您。由于网站通常会将您的电子邮件地址上传到 Google 和 Facebook 以进行广告定位，或者您的电子邮件在数据泄露中被泄露，因此不幸的是，这种额外级别的身份保护现在是必要的。您可以将其视为类似于不在任何地方重复使用相同的密码。我们还使 Private Duck Addresses 易于停用，因此如果您开始收到太多垃圾邮件，也不会感到压力。我们相信您的电子邮件内容与我们无关，因此 DuckDuckGo 绝不会为这项服务保存您的电子邮件。我们不需要！当我们收到电子邮件时，我们会立即从中删除跟踪器，然后将其转发给您，绝不会将其保存在我们的系统中。我们甚至不保存标题（例如，to/from）。在我们的隐私保证中了解更多信息。我们将在消除问题的同时将电子邮件保护功能发布为测试版。要获得测试版，只需加入私人候补名单！我们每天都让新人加入，但您越早加入，您就能越早保护您的电子邮件隐私。您无需分享任何个人信息即可加入候补名单。您将根据仅存在于您设备上的时间戳来确保您的位置，当我们准备好让您加入时，我们会通知您。一旦您拥有个人鸭子地址，您就可以期待 DuckDuckGo 长期支持它，以便您从第一天起就可以自信地分享它。控制您的隐私不应该很复杂或需要权衡。我们的使命是让电子邮件和您在网上所做的一切变得简单和无压力。这是隐私，简化。", "note_en": "DuckDuckGo is launching  Email Protection into beta, a new feature in our apps that will protect your email privacy without switching email services. Join the private waitlist!\n Get a free,  personal @duck.com email address. Emails sent to it will forward to your regular inbox, with creepy  email trackers removed.\n Generate  unique private email addresses in the DuckDuckGo app and extension so you can’t be tracked by your email address.\n Reading your email should be a private activity. You may be surprised to learn that  70% of emails contain trackers that can detect  when you’ve opened a message,  where you were when you opened it, and  what device you were using. If that isn’t creepy enough, this email data can be used to  profile you, including to target you with ads, and influence the content you see online. Ever open an email and see a related ad about it soon thereafter? Yup, blame email trackers. This data about you is also usually sent directly to third parties, most likely without your consent.\n   We’re excited to announce the beta release of DuckDuckGo’s Email Protection. Our free email forwarding service removes email trackers and protects the privacy of your personal email address without asking you to change email services or apps. Most existing email privacy solutions come with significant tradeoffs. You either have to switch email services or apps entirely, or degrade your email experience by hiding all images. We believe protecting your personal information from leaking to third parties should be simple and seamless, like the rest of DuckDuckGo’s privacy protection bundle.\n  Choose your Duck Email Address (you@duck.com) and start giving it out. We remove hidden trackers from incoming emails sent to this address, then forward them to your regular inbox for safer reading. This means if you use an email service like Gmail or Yahoo, it’s no problem!  Emails sent to your Personal Duck Address will arrive there as usual so you can read your email like normal, in any app or on the web, worry-free.\n  Get automatic Email Protection in the app. The DuckDuckGo app and extension provide easy access to your Personal Duck Address when browsing the web and also give you the option to generate new Private Duck Addresses on demand.\n On sites you think could spam you or share your email address, a Private Duck Address will protect you. Since it’s common for sites to upload your email address to Google and Facebook for ad targeting, or for your email to be leaked in a data breach, this extra level of identity protection is now unfortunately necessary. You can think of it as similar to not reusing the same password everywhere. We’ve also made Private Duck Addresses easy to deactivate, so there’s no stress if you start receiving too much spam.\n   We believe the content of your emails is none of our business, so DuckDuckGo will never save your emails for this service. We don&#39;t need to! When we receive an email, we immediately remove trackers from it and then forward it to you, never saving it on our systems. We don’t even save the headers (e.g., to/from). Read more in our  Privacy Guarantees.\n  We’re releasing our Email Protection feature into beta while we’re ironing out the wrinkles. To get access to the beta, just join the private waitlist! We&#39;re letting new people in every day, but the sooner you join, the sooner you&#39;ll be protecting your email privacy.\n You won’t need to share any personal information to join the waitlist. You’ll secure your place in line with a timestamp that exists solely on your device, and we’ll notify you when we’re ready for you to join. Once you have a Personal Duck Address, you can expect DuckDuckGo to support it long-term so you can confidently share it from day one.\n   Having control over your privacy shouldn&#39;t be complicated or require tradeoffs. Our mission is to make it simple and stress free, for email and everything else you do online. It’s privacy, simplified.", "posttime": "2021-07-22 23:31:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电子邮件,email", "title": "DuckDuckGo 电子邮件保护", "title_en": "DuckDuckGo Email Protection", "transed": 1, "url": "https://spreadprivacy.com/introducing-email-protection-beta/", "via": "", "real_tags": ["电子邮件", "email"]}, {"category": "", "categoryclass": "", "imagename": "b39c735fef9adfee96966cd2c7bd8649.jpg", "infoid": 1069013, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加利福尼亚州圣拉蒙市——Pacific Gas &amp; Electric 计划掩埋 10,000 英里的电力线，以防止其磨损的电网在电气设备与遭受干旱的加利福尼亚州的数百万棵树木和其他植被相撞时引发野火。周三宣布的令人生畏的项目旨在掩埋 PG&amp;E 约 10% 的配电和输电线路，预计成本为 150 亿美元至 300 亿美元，根据该过程目前的成本计算。该公用事业公司相信它会找到方法将最终账单保持在这些估计的低端。大部分成本可能由 PG&amp;E 客户承担，他们的电价已经是美国最高的 PG&amp;E 在通知监管机构几天后加强了其安全承诺，一棵 70 英尺高的松树倒在其一根电线上点燃了位于旧金山东北约 145 英里的同一个农村地区比尤特县发生了重大火灾，2018 年其设备引发的另一场火灾造成 80 多人死亡，数千所房屋被毁。自 7 月 13 日在比尤特县的一个偏远地区开始以来，迪克西大火已经向东北方向蔓延，穿过内华达山脉。到周三，大火蔓延到 133 平方英里的区域，迫使普卢马斯县治安官周三下令沿受欢迎的阿尔马诺湖西岸撤离。 PG&amp;E 对 Dixie Fire 的潜在责任的强烈反对促使该公司最近聘用的首席执行官 Patricia “Patti” Poppe 比她所说的计划提前几个月公布了地下线路的计划。由于涉及巨额费用，以前的 PG&amp;E 政权坚决反对掩埋长长的电力线的计划。但波普周三告诉记者，她在 1 月份加入 PG&amp;E 后很快意识到，将线路移至地下是保护公用事业和 1600 万依靠它获得电力的人的最佳方式。 “不这样做太贵了。生命危在旦夕，”波普告诉记者。 PG&amp;E 仅表示，掩埋生产线需要数年时间。然而，在未来十年内完成这项工作将需要一个巨大的飞跃。在 PG&amp;E 已经埋设电力线的少数地区，它每年完成大约 70 英里（123 公里）。 PG&amp;E 的首席运营官亚当·赖特 (Adam Wright) 表示，PG&amp;E 预计最终每年能够掩埋超过 1,600 公里（1,000 英里）的电力线。赖特将这个项目比作二战后帮助重建欧洲的马歇尔计划，波普则援引了约翰·肯尼迪总统 1962 年让美国登上月球的承诺。 PG&amp;E 的道路已经布满死亡和破坏。在前任领导人为了提高利润和管理奖金而允许其设备年久失修后，该公用事业的电网被指责在 2017 年和 2018 年引发了一系列毁灭性的野火，导致该公司在 2019 年申请破产。巴特县的火灾摧毁了整个天堂镇，并导致 PG&amp;E 去年在美国历史上最复杂的案件之一出现前几周承认了 84 项非自愿过失杀人重罪。作为破产的一部分，PG&amp;E 设立了一个 135 亿美元的信托来支付过去野火的受害者，但该基金面临大约 20 亿美元的缺口，因为它的一半资金应该来自市场落后的公司股票。自从破产后，PG&amp;E 还受到加州电力监管机构和一名联邦法官的指责，后者负责监督其违反减少电力线附近树木构成的危险的承诺的刑事缓刑。该公用事业公司还被指控犯有另一轮与火灾有关的罪行，但否认犯下。 Poppe 坚称，根据一项要求 PG&amp;E 斥资 14 亿美元移除超过 30 万棵树木并再修剪 110 万棵树的计划，今年情况会好转。但她承认该公用事业“没有取得足够的进展”，因为它只是电力线附近800万棵树中的一小部分。但她也为 PG&amp;E 对可能导致 Dixie 火灾的树木的处理及其反应进行了辩护。她说，这棵树看起来很健康，距离电线大约 40 英尺（12 米），这使它成为低风险的危险。当 PG&amp;E 故障排除人员被派去检查潜在问题时，他注意到这棵树已经倒下，并且可能在他试图在消防员到达之前扑灭的危险区域引起了火灾。 “他的努力堪称英勇，”波普说。", "note_en": "SAN RAMON, Calif. — Pacific Gas &amp; Electric plans to bury 10,000 miles of its power lines in an effort to prevent its fraying grid from sparking wildfires when electrical equipment collides with millions of trees and other vegetation  across drought-stricken California.  The daunting project announced Wednesday aims to bury about 10% of PG&amp;E&#39;s  distribution and transmission lines at a projected cost of $15 billion to as much as $30 billion, based on how much the process currently costs. The utility believes it will find ways to keep the final bill at the lower end of those estimates. Most of the costs will likely be shouldered by PG&amp;E customers, whose electricity rates are already among the highest in the U.S.\n        PG&amp;E stepped up its safety commitment just days after informing regulators a 70-foot pine tree that toppled on one of its power lines ignited a major fire in Butte County, the same rural area about 145 miles northeast of San Francisco where another fire sparked by its equipment in 2018 killed more than 80 people and destroyed thousands of homes.  Since it started July 13 in a remote area of Butte County, the Dixie Fire has churned northeast through the Sierra Nevada. By Wednesday, the fire spanned a 133-square-mile area, forcing the Plumas County sheriff on Wednesday to order evacuations along the west shore of popular Lake Almanor.\n    The backlash to PG&amp;E&#39;s potential liability for the Dixie Fire prompted the company&#39;s recently hired CEO, Patricia &#34;Patti&#34; Poppe, to unveil the plan for underground lines several months earlier than she said she planned.  Previous PG&amp;E regimes have staunchly resisted plans to bury long stretches of power lines because of the massive expense involved.  But Poppe told reporters on Wednesday that she quickly realized after she joined PG&amp;E in January that moving lines underground is the best way to protect both the utility and the 16 million people who rely on it for power.  &#34;It&#39;s too expensive not to do it. Lives are on the line,&#34; Poppe told reporters.\n    PG&amp;E said only that burying the lines will take several years.  However, getting the job done within the next decade will require a quantum leap. In the few areas where PG&amp;E has already been burying power lines, it has been completing about 70 miles (123 kilometers) annually.   PG&amp;E expects to eventually be able to bury more than 1,000 miles (1,600 kilometers) of power lines annually, said its chief operating officer, Adam Wright. While Wright likened the project to the Marshall Plan that helped rebuild Europe after World War II, Poppe invoked President John F. Kennedy&#39;s 1962 pledge for the U.S. to land on the moon.  PG&amp;E&#39;s path to this point has been strewn with death and destruction.   After previous leaders allowed its equipment to fall into disrepair in a apparent attempt to boost profits and management bonuses, the utility&#39;s grid was blamed for igniting a series of devastating wildfires in 2017 and 2018 that prompted the company to file for bankruptcy in 2019.\n    The biggest fire, in Butte County, wiped out the entire town of Paradise and resulted in PG&amp;E pleading guilty to 84 felony counts of involuntary manslaughter last year just weeks before it emerged from one of the most complex cases in U.S. history.  As part of its bankruptcy, PG&amp;E set up a $13.5 billion trust to pay victims of its past wildfires, but that fund is facing a roughly $2 billion shortfall because half its money is supposed to come from company stock that has been a market laggard.  Since getting out of bankruptcy, PG&amp;E also has been rebuked by California power regulators and a federal judge overseeing its criminal probation for breaking promises to reduce the dangers posed by trees near its power lines. The utility has also been charged with another round of fire-related crimes that it denies committing.   Poppe insisted things are getting better this year under a plan that calls for PG&amp;E to spend $1.4 billion removing more than 300,000 trees and trimming another 1.1 million. But she conceded the utility is &#34;not making enough progress&#34; since it&#39;s only a fraction of that 8 million trees within striking distance of its power lines.  But she also defended PG&amp;E&#39;s handling of the tree that may have caused the Dixie Fire and its response. The tree looked healthy and was about 40 feet (12 meters) from power lines, she said, making it a low-risk danger.   When a PG&amp;E troubleshooter was sent out to inspect a potential problem, he noticed the tree had fallen and may have started a fire in a treacherous area that he tried to put out before firefighters arrived.  &#34;His efforts can be called nothing less than heroic,&#34; Poppe said.", "posttime": "2021-07-22 23:31:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "引发,power,计划", "title": "PG&amp;E 将掩埋 10,000 英里长的电线，以免引发野火", "title_en": "PG&E will bury 10k miles of power lines so they don't spark wildfires", "transed": 1, "url": "https://www.npr.org/2021/07/21/1019058925/utility-bury-power-lines-wildfires-california", "via": "", "real_tags": ["引发", "power", "计划"]}, {"category": "", "categoryclass": "", "imagename": "e9d3a0dfd6badad61e495976f1ac84f7.jpg", "infoid": 1069011, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "TL;DR：如果您正在参与这个 Sci-Hub 备份项目，或者您正在播种 lib-gen scimag 档案，我需要您的帮助，使这个 lib-gen scimag 数据块中的论文可以通过 DOI 和 ipfs 访问。我启动了一个名为 sci-hub-p2p 的项目，通过 bittorrent 网络获取纸张，这需要为每个 torrent 及其数据生成索引。种子及其数据被索引后，该种子的论文可以通过 BitTorrent 网络下载，而无需下载总 zip 文件（通常为 1GB，包含 5k 论文）。如果您有任何数据块并希望帮助生成索引，请查看此 wiki 页面：索引生成和收集。在长期计划中，这将能够成为 ipfs 对等点，将文件从 lib-gen 存档提供给 ipfs 网络。", "note_en": "TL;DR: If you are participating in  this Sci-Hub backup project or you are seeding lib-gen scimag archive, I need your help to make papers in this lib-gen scimag data block accessible with DOI and ipfs.\n I start a project called   sci-hub-p2p to fetch paper via the bittorrent network, which requires a index generation of every torrent and its data.\n After a torrent and its data is indexed, papers of this torrent can be downloaded via BitTorrent network without the need to download the total zip file (usually 1GB, contains 5k papers).\n  If you have any data block and want to help with index generation, check out this wiki page:  index generating and collecting .\n In a long-term plan, this will be able to be an ipfs peer to serve paper from lib-gen archive to ipfs network.", "posttime": "2021-07-22 23:30:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "需要,hub,ipfs", "title": "Sci-hub-p2p 需要在 IPFS 上建立索引和播种方面的帮助", "title_en": "Sci-hub-p2p needs help with indexing & seeding on IPFS", "transed": 1, "url": "https://www.reddit.com/r/libgen/comments/ompcvk/need_help_from_libgen_scimag_archive_data_holder/", "via": "", "real_tags": ["需要", "hub", "ipfs"]}, {"category": "", "categoryclass": "", "imagename": "6f8a69fa54283e1959d7c30d4f212f9b.jpg", "infoid": 1069009, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "WebAssembly 线程支持是 WebAssembly 最重要的性能补充之一。它允许您在单独的内核上并行运行部分代码，或者在输入数据的独立部分上运行相同的代码，将其扩展到与用户拥有的内核数量一样多，并显着减少整体执行时间。在本文中，您将学习如何使用 WebAssembly 线程将用 C、C++ 和 Rust 等语言编写的多线程应用程序带到 Web。 WebAssembly 线程不是一个单独的功能，而是多个组件的组合，允许 WebAssembly 应用程序在网络上使用传统的多线程范例。第一个组件是您从 JavaScript 中了解和喜爱的常规 Worker。 WebAssembly 线程使用新的 Worker 构造函数来创建新的底层线程。每个线程加载一个 JavaScript 胶水，然后主线程使用 Worker#postMessage 方法与其他线程共享已编译的 WebAssembly.Module 以及共享的 WebAssembly.Memory（见下文）。这建立了通信并允许所有这些线程在相同的共享内存上运行相同的 WebAssembly 代码，而无需再次通过 JavaScript。 Web Workers 已经存在十多年了，得到了广泛的支持，并且不需要任何特殊的标志。 WebAssembly 内存由 JavaScript API 中的 WebAssembly.Memory 对象表示。默认情况下，WebAssembly.Memory 是 ArrayBuffer 的包装器——一个只能由单个线程访问的原始字节缓冲区。为了支持多线程，WebAssembly.Memory 也获得了一个共享变体。当通过 JavaScript API 或由 WebAssembly 二进制文件本身使用共享标志创建时，它变成了 SharedArrayBuffer 的包装器。它是 ArrayBuffer 的一种变体，可以与其他线程共享并从任何一方同时读取或修改。\n与 postMessage 不同，通常用于主线程和 Web Workers 之间的通信，SharedArrayBuffer 不需要复制数据，甚至不需要等待事件循环发送和接收消息。相反，所有线程几乎可以立即看到任何更改，这使其成为传统同步原语更好的编译目标。 SharedArrayBuffer 有着复杂的历史。它最初在 2017 年中期在多个浏览器中发布，但由于发现了 Spectre 漏洞而不得不在 2018 年初被禁用。特殊原因是 Spectre 中的数据提取依赖于计时攻击——测量特定代码段的执行时间。为了使这种攻击更加困难，浏览器降低了 Date.now 和 performance.now 等标准计时 API 的精度。然而，共享内存与在单独线程中运行的简单计数器循环相结合也是获得高精度计时的一种非常可靠的方法，并且在不显着限制运行时性能的情况下更难缓解。取而代之的是，Chrome 68（2018 年中）通过利用站点隔离再次重新启用 SharedArrayBuffer，该功能将不同的网站置于不同的进程中，并使使用像 Spectre 这样的旁道攻击变得更加困难。但是，这种缓解措施仍然仅限于 Chrome 桌面，因为站点隔离是一项相当昂贵的功能，并且无法默认为低内存移动设备上的所有站点启用，其他供应商也尚未实施。快进到 2020 年，Chrome 和 Firefox 都实现了站点隔离，并且是网站通过 COOP 和 COEP 标头选择加入该功能的标准方式。选择加入机制允许在低功率设备上使用站点隔离，因为为所有网站启用它的成本太高。要选择加入，请在服务器配置的主文档中添加以下标头：一旦选择加入，您就可以访问 SharedArrayBuffer（包括由 SharedArrayBuffer 支持的 WebAssembly.Memory）、精确计时器、内存测量和其他需要的 API出于安全原因，一个孤立的来源。查看使用 COOP 和 COEP 使您的网站“跨域隔离”了解更多详细信息。虽然 SharedArrayBuffer 允许每个线程读取和写入相同的内存，但为了正确通信，您需要确保它们不会同时执行冲突操作。例如，一个线程可能开始从共享地址读取数据，而另一个线程正在写入数据，因此第一个线程现在将获得损坏的结果。此类错误称为竞争条件。为了防止竞争条件，您需要以某种方式同步这些访问。这就是原子操作的用武之地。 WebAssembly 原子是 WebAssembly 指令集的扩展，它允许“原子地”读取和写入小型数据单元（通常是 32 位和 64 位整数）。也就是说，以某种方式保证没有两个线程同时读取或写入同一个单元格，从而在低级别防止此类冲突。此外，WebAssembly 原子包含另外两种指令类型——“wait”和“notify”——它们允许一个线程在共享内存中的给定地址上休眠（“wait”），直到另一个线程通过“notify”将其唤醒。\n所有更高级别的同步原语，包括通道、互斥锁和读写锁都建立在这些指令之上。 WebAssembly 原子和 SharedArrayBuffer 是相对较新的功能，尚未在所有支持 WebAssembly 的浏览器中可用。您可以在 webassembly.org 路线图上找到哪些浏览器支持新的 WebAssembly 功能。为了确保所有用户都可以加载您的应用程序，您需要通过构建两个不同版本的 Wasm 来实现渐进式增强——一个支持多线程，一个不支持多线程。然后根据特征检测结果加载支持的版本。要在运行时检测 WebAssembly 线程支持，请使用 wasm-feature-detect 库并像这样加载模块： import { threads } from &#39;wasm-feature-detect&#39; ; const hasThreads = 等待线程（）； const module = await ( hasThreads ? import ( &#39;./module-with-threads.js&#39; ) : import ( &#39;./module-without-threads.js&#39; ) ) ; // ...现在像往常一样使用`module` 现在让我们看看如何构建WebAssembly 模块的多线程版本。在 C 中，尤其是在类 Unix 系统上，使用线程的常用方法是通过 pthread 库提供的 POSIX 线程。 Emscripten 提供了构建在 Web Workers、共享内存和原子之上的 pthread 库的 API 兼容实现，因此相同的代码可以在 Web 上运行而无需更改。 #include &lt;stdio.h&gt; #include &lt;unistd.h&gt; #include &lt;pthread.h&gt; void * thread_callback ( void *arg ) { sleep ( 1 ) ; printf ( &quot;线程内部：%d\\n&quot; , * ( int * )arg ) ;返回 NULL ; } int main() { puts (&quot;线程前&quot;);线程 ID ;整数 arg = 42 ； pthread_create ( &amp;thread_id , NULL , thread_callback , &amp;arg ) ; pthread_join (thread_id , NULL ) ; puts(&quot;线程之后&quot;);返回 0 ; }\n此处通过 pthread.h 包含 pthread 库的头文件。您还可以看到几个处理线程的关键函数。 pthread_create 将创建一个后台线程。它需要一个目标来存储线程句柄、一些线程创建属性（这里没有传递任何属性，所以它只是 NULL）、要在新线程中执行的回调（这里是 thread_callback），以及一个可选的参数指针来传递给它回调以防您想从主线程共享一些数据——在这个例子中，我们共享一个指向变量 arg 的指针。稍后可以随时调用 pthread_join 等待线程完成执行，并获取回调返回的结果。它接受先前分配的线程句柄以及存储结果的指针。在这种情况下，没有任何结果，因此该函数将 NULL 作为参数。要使用 Emscripten 使用线程编译代码，您需要调用 emcc 并传递一个 -pthread 参数，就像在其他平台上使用 Clang 或 GCC 编译相同的代码一样：但是，当您尝试在浏览器或 Node.js 中运行它时，您将看到一个警告，然后程序将挂起：在线程之前尝试生成一个新线程，但线程池已耗尽。这可能会导致死锁，除非某些线程最终退出或代码明确跳出到事件循环。如果要增加池大小，请使用设置`-s PTHREAD_POOL_SIZE=...`。如果你想抛出一个明确的错误而不是在这些情况下死锁的风险，使用设置`-s PTHREAD_POOL_SIZE_STRICT=2`。 [……挂在这里……] 发生了什么事？问题是，Web 上大部分耗时的 API 都是异步的，并且依赖于事件循环来执行。与传统环境相比，这种限制是一个重要的区别，在传统环境中，应用程序通常以同步、阻塞的方式运行 I/O。如果您想了解更多信息，请查看关于使用来自 WebAssembly 的异步 Web API 的博客文章。\n在这种情况下，代码同步调用 pthread_create 来创建后台线程，然后同步调用 pthread_join 以等待后台线程完成执行。但是，使用 Emscripten 编译此代码时在幕后使用的 Web Workers 是异步的。所以发生的事情是， pthread_create 只安排一个新的 Worker 线程在下一次事件循环运行时创建，但是 pthread_join 立即阻塞事件循环以等待该 Worker，并且这样做可以防止它被创建。这是死锁的典型例子。解决这个问题的一种方法是在程序开始之前提前创建一个工人池。当 pthread_create 被调用时，它可以从池中取出一个随时可用的 Worker，在其后台线程上运行提供的回调，并将 Worker 返回到池中。所有这些都可以同步完成，所以只要池足够大就不会出现任何死锁。这正是 Emscripten 通过 -s PTHREAD_POOL_SIZE=... 选项所允许的。它允许指定多个线程 - 一个固定的数量，或者像 navigator.hardwareConcurrency 这样的 JavaScript 表达式来创建与 CPU 上的内核一样多的线程。当您的代码可以扩展到任意数量的线程时，后一个选项很有用。在上面的示例中，只创建了一个线程，因此不必保留所有内核，而是使用 -s PTHREAD_POOL_SIZE=1 就足够了： 但是还有另一个问题：在代码示例中看到 sleep(1) 了吗？它在线程回调中执行，意味着脱离主线程，所以应该没问题，对吧？好吧，它不是。当 pthread_join 被调用时，它必须等待线程执行完成，这意味着如果创建的线程正在执行长时间运行的任务——在这种情况下，休眠 1 秒——那么主线程也将不得不阻塞相同的数量直到结果回来的时间。在浏览器中执行此 JS 时，它将阻塞 UI 线程 1 秒，直到线程回调返回。这会导致糟糕的用户体验。首先，如果你只需要在主线程之外运行一些任务，而不需要等待结果，你可以使用 pthread_detach 而不是 pthread_join。这将使线程回调在后台运行。如果您使用此选项，您可以使用 -s PTHREAD_POOL_SIZE_STRICT=0 关闭警告。\n其次，如果您正在编译 C 应用程序而不是库，则可以使用 -s PROXY_TO_PTHREAD 选项，除了应用程序本身创建的任何嵌套线程之外，该选项还将主应用程序代码卸载到单独的线程。这样，主代码可以随时安全地阻塞，而不会冻结 UI。顺便说一下，当使用这个选项时，你也不必预先创建线程池——相反，Emscripten 可以利用主线程来创建新的底层 Worker，然后在 pthread_join 中阻塞辅助线程而不会死锁。第三，如果您正在处理一个库并且仍然需要阻塞，您可以创建自己的 Worker，导入 Emscripten 生成的代码并使用 Comlink 将其公开给主线程。主线程将能够调用任何导出的方法作为异步函数，这样也可以避免阻塞 UI。在像前面的示例这样的简单应用程序中，-s PROXY_TO_PTHREAD 是最佳选择：所有相同的警告和逻辑都以相同的方式应用于 C++。您获得的唯一新东西是访问更高级别的 API，例如 std::thread 和 std::async，它们在后台使用了前面讨论过的 pthread 库。 #include &lt;iostream&gt; #include &lt;thread&gt; #include &lt;chrono&gt; int main ( ) { puts ( &quot;Before the thread&quot; ) ;整数 arg = 42 ； std ::thread thread ( [ &amp; ] ( ) { std ::this_thread :: sleep_for (std ::chrono :: seconds ( 1 ) ) ; std ::cout &lt;&lt; &quot;线程内部：&quot; &lt;&lt; arg &lt;&lt; std ::结束; } ) ;线 。加入 （ ） ; std::cout &lt;&lt; &quot;线程之后&quot; &lt;&lt; std ::endl ;返回 0 ; } 使用类似参数编译和执行时，它的行为方式与 C 示例相同： Before the thread 线程内部：42 Pthread 0xc06190 exited。在线程代理主线程 0xa05c18 完成后返回代码 0. EXIT_RUNTIME=0 设置，因此保持主线程处于活动状态以进行异步事件操作。线程 0xa05c18 退出。\n与 Emscripten 不同，Rust 没有专门的端到端 Web 目标，而是为通用 WebAssembly 输出提供通用的 wasm32-unknown-unknown 目标。如果 Wasm 旨在用于 Web 环境，则与 JavaScript API 的任何交互都留给外部库和工具，如 wasm-bindgen 和 wasm-pack。不幸的是，这意味着标准库不知道 Web Workers 和标准 API，例如 std::thread 在编译为 WebAssembly 时将无法工作。幸运的是，生态系统的大部分都依赖于更高级别的库来处理多线程。在那个级别，抽象出所有平台差异要容易得多。特别是，Rayon 是 Rust 中最流行的数据并行选择。它允许您在常规迭代器上采用方法链，并且通常只需更改一行，就可以在所有可用线程上并行运行而不是按顺序运行的方式转换它们。例如： pub fn sum_of_squares (numbers : &amp; [ i32 ] ) -&gt; i32 { numbers .迭代 ( ) 。 par_iter()。地图 ( |x | x * x ) 。 sum ( ) } 有了这个小改动，代码将拆分输入数据，在并行线程中计算 x * x 和部分和，最后将这些部分结果加在一起。为了适应没有工作 std::thread 的平台，Rayon 提供了允许定义用于生成和退出线程的自定义逻辑的钩子。\nwasm-bindgen-rayon 利用这些钩子来生成 WebAssembly 线程作为 Web Workers。要使用它，您需要将其添加为依赖项并按照文档中描述的配置步骤进行操作。上面的例子最终看起来像这样： pub use init_thread_pool ; pub fn sum_of_squares (numbers : &amp; [ i32 ] ) -&gt; i32 { numbers . par_iter()。地图 ( |x | x * x ) 。 sum ( ) } 完成后，生成的 JavaScript 将导出一个额外的 initThreadPool 函数。此函数将创建一个Worker 池，并在程序的整个生命周期中为 Rayon 完成的任何多线程操作重用它们。这种池机制类似于前面解释过的 Emscripten 中的 -s PTHREAD_POOL_SIZE=... 选项，也需要在主代码之前进行初始化以避免死锁： import init , { initThreadPool , sum_of_squares } from &#39;./pkg/index. js&#39;; // 常规 wasm-bindgen 初始化。等待初始化（）； // 使用给定线程数初始化线程池 //（如果要使用所有内核，请通过 `navigator.hardwareConcurrency`）。等待 initThreadPool (navigator .hardwareConcurrency ) ; // ...现在您可以像往常一样调用任何导出的函数。 log(sum_of_squares(new([1,2,3]))); // 14 请注意，关于阻塞主线程的相同警告也适用于此。即使 sum_of_squares 示例仍然需要阻塞主线程以等待来自其他线程的部分结果。根据迭代器的复杂性和可用线程的数量，它可能是一个很短的等待或一个很长的等待，但是，为了安全起见，浏览器引擎会主动防止完全阻塞主线程，这样的代码会抛出错误。相反，您应该创建一个 Worker，在那里导入 wasm-bindgen 生成的代码，并使用 Comlink 之类的库将其 API 暴露给主线程。\n我们在 Squoosh.app 中积极使用 WebAssembly 线程进行客户端图像压缩——特别是对于 AVIF (C++)、JPEG-XL (C++)、OxiPNG (Rust) 和 WebP v2 (C++) 等格式。多亏了多线程，我们已经看到了一致的 1.5x-3x 加速（每个编解码器的确切比率不同），并且能够通过将 WebAssembly 线程与 WebAssembly SIMD 结合来进一步推动这些数字！ FFMPEG.WASM 是流行的 FFmpeg 多媒体工具链的 WebAssembly 版本，它使用 WebAssembly 线程直接在浏览器中有效地编码视频。还有更多令人兴奋的使用 WebAssembly 线程的示例。请务必查看演示并将您自己的多线程应用程序和库带到网络上！", "note_en": "WebAssembly threads support is one of the most important performance additions to WebAssembly. It allows you to either run parts of your code in parallel on separate cores, or the same code over independent parts of the input data, scaling it to as many cores as the user has and significantly reducing the overall execution time.\n In this article you will learn how to use WebAssembly threads to bring multithreaded applications written in languages like C, C++, and Rust to the web.\n  WebAssembly threads is not a separate feature, but a combination of several components that allows WebAssembly apps to use traditional multithreading paradigms on the web.\n  First component is the regular  Workers you know and love from JavaScript. WebAssembly threads use the  new Worker constructor to create new underlying threads. Each thread loads a JavaScript glue, and then the main thread uses   Worker#postMessage method to share the compiled   WebAssembly.Module as well as a shared   WebAssembly.Memory (see below) with those other threads. This establishes communication and allows all those threads to run the same WebAssembly code on the same shared memory without going through JavaScript again.\n Web Workers have been around for over a decade now, are widely supported, and don&#39;t require any special flags.\n  WebAssembly memory is represented by a   WebAssembly.Memory object in the JavaScript API. By default  WebAssembly.Memory is a wrapper around an   ArrayBuffer—a raw byte buffer that can be accessed only by a single thread.\n   To support multithreading,  WebAssembly.Memory gained a shared variant too. When created with a  shared flag via the JavaScript API, or by the WebAssembly binary itself, it becomes a wrapper around a   SharedArrayBuffer instead. It&#39;s a variation of  ArrayBuffer that can be shared with other threads and read or modified simultaneously from either side.\n   Unlike   postMessage, normally used for communication between main thread and Web Workers,   SharedArrayBuffer doesn&#39;t require copying data or even waiting for the event loop to send and receive messages. Instead, any changes are seen by all threads nearly instantly, which makes it a much better compilation target for traditional synchronisation primitives.\n SharedArrayBuffer has a complicated history. It was initially shipped in several browsers mid-2017, but had to be disabled in the beginning of 2018 due to discovery of  Spectre vulnerabilities. The particular reason was that data extraction in Spectre relies on timing attacks—measuring execution time of a particular piece of code. To make this kind of attack harder, browsers reduced precision of standard timing APIs like  Date.now and  performance.now. However, shared memory, combined with a simple counter loop running in a separate thread  is also a very reliable way to get high-precision timing, and it&#39;s much harder to mitigate without significantly throttling runtime performance.\n Instead, Chrome 68 (mid-2018) re-enabled  SharedArrayBuffer again by leveraging  Site Isolation—a feature that puts different websites into different processes and makes it much more difficult to use side-channel attacks like Spectre. However, this mitigation was still limited only to Chrome desktop, as Site Isolation is a fairly expensive feature, and couldn&#39;t be enabled by default for all sites on low-memory mobile devices nor was it yet implemented by other vendors.\n Fast-forward to 2020, Chrome and Firefox both have implementations of Site Isolation, and a standard way for websites to opt-in to the feature with  COOP and COEP headers. An opt-in mechanism allows to use Site Isolation even on low-powered devices where enabling it for all the websites would be too expensive. To opt-in, add the following headers to the main document in your server configuration:\n   Once you opt-in, you get access to  SharedArrayBuffer (including  WebAssembly.Memory backed by a  SharedArrayBuffer), precise timers, memory measurement and other APIs that require an isolated origin for security reasons. Check out the  Making your website &#34;cross-origin isolated&#34; using COOP and COEP for more details.\n  While  SharedArrayBuffer allows each thread to read and write to the same memory, for correct communication you want to make sure they don&#39;t perform conflicting operations at the same time. For example, it&#39;s possible for one thread to start reading data from a shared address, while another thread is writing to it, so the first thread will now get a corrupted result. This category of bugs is known as race conditions. In order to prevent race conditions, you need to somehow synchronize those accesses. This is where atomic operations come in.\n WebAssembly atomics is an extension to the WebAssembly instruction set that allow to read and write small cells of data (usually 32- and 64-bit integers) &#34;atomically&#34;. That is, in a way that guarantees that no two threads are reading or writing to the same cell at the same time, preventing such conflicts at a low level. Additionally, WebAssembly atomics contain two more instruction kinds—&#34;wait&#34; and &#34;notify&#34;—that allow one thread to sleep (&#34;wait&#34;) on a given address in a shared memory until another thread wakes it up via &#34;notify&#34;.\n All the higher-level synchronisation primitives, including channels, mutexes, and read-write locks build upon those instructions.\n   WebAssembly atomics and  SharedArrayBuffer are relatively new features and aren&#39;t yet available in all browsers with WebAssembly support. You can find which browsers support new WebAssembly features on the  webassembly.org roadmap.\n To ensure that all users can load your application, you&#39;ll need to implement progressive enhancement by building two different versions of Wasm—one with multithreading support and one without it. Then load the supported version depending on feature detection results. To detect WebAssembly threads support at runtime, use  wasm-feature-detect library and load the module like this:\n  import  { threads  }  from  &#39;wasm-feature-detect&#39; ;   const hasThreads  =  await  threads ( ) ;   const module  =  await  (  hasThreads   ?  import ( &#39;./module-with-threads.js&#39; )   :  import ( &#39;./module-without-threads.js&#39; )  ) ;   // …now use `module` as you normally would\n Now let&#39;s take a look at how to build a multithreaded version of the WebAssembly module.\n  In C, particularly on Unix-like systems, the common way to use threads is via  POSIX Threads provided by the  pthread library. Emscripten  provides an API-compatible implementation of the  pthread library built atop Web Workers, shared memory and atomics, so that the same code can work on the web without changes.\n    # include  &lt;stdio.h&gt;    # include  &lt;unistd.h&gt;    # include  &lt;pthread.h&gt;     void  * thread_callback ( void  *arg )   {    sleep ( 1 ) ;    printf ( &#34;Inside the thread: %d\\n&#34; ,  * ( int  * )arg ) ;    return  NULL ;   }     int  main ( )   {    puts ( &#34;Before the thread&#34; ) ;       thread_id ;    int arg  =  42 ;    pthread_create ( &amp;thread_id ,  NULL , thread_callback ,  &amp;arg ) ;      pthread_join (thread_id ,  NULL ) ;      puts ( &#34;After the thread&#34; ) ;      return  0 ;   }\n Here the headers for the  pthread library are included via  pthread.h. You can also see a couple of crucial functions for dealing with threads.\n pthread_create will create a background thread. It takes a destination to store a thread handle in, some thread creation attributes (here not passing any, so it&#39;s just  NULL), the callback to be executed in the new thread (here  thread_callback), and an optional argument pointer to pass to that callback in case you want to share some data from the main thread—in this example we&#39;re sharing a pointer to a variable  arg.\n pthread_join can be called later at any time to wait for the thread to finish the execution, and get the result returned from the callback. It accepts the earlier assigned thread handle as well as a pointer to store the result. In this case, there aren&#39;t any results so the function takes a  NULL as an argument.\n To compile code using threads with Emscripten, you need to invoke  emcc and pass a  -pthread parameter, as when compiling the same code with Clang or GCC on other platforms:\n   However, when you try to run it in a browser or Node.js, you&#39;ll see a warning and then the program will hang:\n  Before the thread Tried to spawn a new thread, but the thread pool is exhausted. This might result in a deadlock unless some threads eventually exit or the code explicitly breaks out to the event loop. If you want to increase the pool size, use setting `-s PTHREAD_POOL_SIZE=...`. If you want to throw an explicit error instead of the risk of deadlocking in those cases, use setting `-s PTHREAD_POOL_SIZE_STRICT=2`. […hangs here…]\n What happened? The problem is, most of the time-consuming APIs on the web are asynchronous and rely on the event loop to execute. This limitation is an important distinction compared to traditional environments, where applications normally run I/O in synchronous, blocking manner. Check out the blog post about  Using asynchronous web APIs from WebAssembly if you&#39;d like to learn more.\n In this case, the code synchronously invokes  pthread_create to create a background thread, and follows up by another synchronous call to  pthread_join that waits for the background thread to finish execution. However, Web Workers, that are used behind the scenes when this code is compiled with Emscripten, are asynchronous. So what happens is,  pthread_create only  schedules a new Worker thread to be created on the next event loop run, but then  pthread_join immediately blocks the event loop to wait for that Worker, and by doing so prevents it from ever being created. It&#39;s a classic example of a  deadlock.\n One way to solve this problem is to create a pool of Workers ahead of time, before the program has even started. When  pthread_create is invoked, it can take a ready-to-use Worker from the pool, run the provided callback on its background thread, and return the Worker back to the pool. All of this can be done synchronously, so there won&#39;t be any deadlocks as long as the pool is sufficiently large.\n This is exactly what Emscripten allows with the   -s PTHREAD_POOL_SIZE=... option. It allows to specify a number of threads—either a fixed number, or a JavaScript expression like   navigator.hardwareConcurrency to create as many threads as there are cores on the CPU. The latter option is helpful when your code can scale to an arbitrary number of threads.\n In the example above, there is only one thread being created, so instead of reserving all cores it&#39;s sufficient to use  -s PTHREAD_POOL_SIZE=1:\n      There is another problem though: see that  sleep(1) in the code example? It executes in the thread callback, meaning off the main thread, so it should be fine, right? Well, it isn&#39;t.\n When  pthread_join is called, it has to wait for the thread execution to finish, meaning that if the created thread is performing long-running tasks—in this case, sleeping 1 second—then the main thread will also have to block for the same amount of time till the results are back. When this JS is executed in the browser, it will block the UI thread for 1 second until the thread callback returns. This leads to poor user experience.\n    First, if you only need to run some tasks off the main thread, but don&#39;t need to wait for the results, you can use   pthread_detach instead of  pthread_join. This will leave the thread callback running in the background. If you&#39;re using this option, you can switch off the warning with   -s PTHREAD_POOL_SIZE_STRICT=0.\n  Second, if you&#39;re compiling a C application rather than a library, you can use   -s PROXY_TO_PTHREAD option, which will offload the main application code to a separate thread in addition to any nested threads created by the application itself. This way, main code can block safely at any time without freezing the UI. Incidentally, when using this option, you don&#39;t have to precreate the thread pool either—instead, Emscripten can leverage the main thread for creating new underlying Workers, and then block the helper thread in  pthread_join without deadlocking.\n  Third, if you&#39;re working on a library and still need to block, you can create your own Worker, import the Emscripten-generated code and expose it with  Comlink to the main thread. Main thread will be able to invoke any exported methods as asynchronous functions, and that way will also avoid blocking the UI.\n In a simple application such as the previous example  -s PROXY_TO_PTHREAD is the best option:\n    All the same caveats and logic apply in the same way to C++. The only new thing you gain is access to higher-level APIs like   std::thread and   std::async, which use the previously discussed  pthread library under the hood.\n    # include  &lt;iostream&gt;    # include  &lt;thread&gt;    # include  &lt;chrono&gt;     int  main ( )   {    puts ( &#34;Before the thread&#34; ) ;      int arg  =  42 ;   std ::thread  thread ( [ &amp; ] ( )  {   std ::this_thread :: sleep_for (std ::chrono :: seconds ( 1 ) ) ;   std ::cout  &lt;&lt;  &#34;Inside the thread: &#34;  &lt;&lt; arg  &lt;&lt; std ::endl ;    } ) ;     thread . join ( ) ;     std ::cout  &lt;&lt;  &#34;After the thread&#34;  &lt;&lt; std ::endl ;      return  0 ;   }\n When compiled and executed with similar parameters, it will behave in the same way as the C example:\n     Before the thread Inside the thread: 42 Pthread 0xc06190 exited. After the thread Proxied main thread 0xa05c18 finished with return code 0. EXIT_RUNTIME=0 set, so keeping main thread alive for asynchronous event operations. Pthread 0xa05c18 exited.\n  Unlike Emscripten, Rust doesn&#39;t have a specialized end-to-end web target, but instead provides a generic  wasm32-unknown-unknown target for generic WebAssembly output.\n If Wasm is intended to be used in a web environment, any interaction with JavaScript APIs is left to external libraries and tooling like  wasm-bindgen and  wasm-pack. Unfortunately, this means that the standard library is not aware of Web Workers and standard APIs such as   std::thread won&#39;t work when compiled to WebAssembly.\n Luckily, the majority of the ecosystem depends on higher-level libraries to take care of multithreading. At that level it&#39;s much easier to abstract away all the platform differences.\n In particular,  Rayon is the most popular choice for data-parallelism in Rust. It allows you to take method chains on regular iterators and, usually with a single line change, convert them in a way where they&#39;d run in parallel on all available threads instead of sequentially. For example:\n  pub  fn  sum_of_squares (numbers :  &amp; [ i32 ] )  -&gt;  i32  {   numbers    . iter ( )    . par_iter ( )    . map (  |x | x  * x )    . sum ( )   }\n With this small change, the code will split up the input data, calculate  x * x and partial sums in parallel threads, and in the end add up those partial results together.\n To accommodate for platforms without working  std::thread, Rayon provides hooks that allow to define custom logic for spawning and exiting threads.\n wasm-bindgen-rayon taps into those hooks to spawn WebAssembly threads as Web Workers. To use it, you need to add it as a dependency and follow the configuration steps described in the  docs. The example above will end up looking like this:\n  pub  use  init_thread_pool ;        pub  fn  sum_of_squares (numbers :  &amp; [ i32 ] )  -&gt;  i32  {   numbers    . par_iter ( )    . map (  |x | x  * x )    . sum ( )   }\n Once done, the generated JavaScript will export an extra  initThreadPool function. This function will create a pool of Workers and reuse them throughout the lifetime of the program for any multithreaded operations done by Rayon.\n This pool mechanism is similar to the  -s PTHREAD_POOL_SIZE=... option in Emscripten explained earlier, and also needs to be initialized before the main code to avoid deadlocks:\n  import init ,  { initThreadPool , sum_of_squares  }  from  &#39;./pkg/index.js&#39; ;     // Regular wasm-bindgen initialization.   await  init ( ) ;     // Thread pool initialization with the given number of threads   // (pass `navigator.hardwareConcurrency` if you want to use all cores).   await  initThreadPool (navigator .hardwareConcurrency ) ;     // ...now you can invoke any exported functions as you normally would  console . log ( sum_of_squares ( new   ( [ 1 ,  2 ,  3 ] ) ) ) ;  // 14\n Note that the same  caveats about blocking the main thread apply here too. Even the  sum_of_squares example still needs to block the main thread to wait for the partial results from other threads.\n It might be a very short wait or a long one, depending on the complexity of iterators and number of available threads, but, to be on the safe side, browser engines actively prevent blocking the main thread altogether and such code will throw an error. Instead, you should create a Worker, import the  wasm-bindgen-generated code there, and expose its API with a library like  Comlink to the main thread.\n    We actively use WebAssembly threads in  Squoosh.app for client-side image compression—in particular, for formats like AVIF (C++), JPEG-XL (C++), OxiPNG (Rust) and WebP v2 (C++). Thanks to the multithreading alone, we&#39;ve seen consistent 1.5x-3x speed-ups (exact ratio differs per codec), and were able to push those numbers even further by combining WebAssembly threads with  WebAssembly SIMD!\n  FFMPEG.WASM is a WebAssembly version of a popular  FFmpeg multimedia toolchain that uses WebAssembly threads to efficiently encode videos directly in the browser.\n There are many more exciting examples using WebAssembly threads out there. Be sure to check out the demos and bring your own multithreaded applications and libraries to the web!", "posttime": "2021-07-22 23:29:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "c++,webassembly,线程,rust,来自", "title": "使用来自 C、C++ 和 Rust 的 WebAssembly 线程", "title_en": "Using WebAssembly threads from C, C++ and Rust", "transed": 1, "url": "https://web.dev/webassembly-threads/", "via": "", "real_tags": ["c++", "线程", "rust", "来自"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069008, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个故事发生在 2009 年 Flash 去世之前。让我在开始之前布置项目。该应用程序会自动将 20,000 个发音 mp3 连接到任何文本中的单词。然后用户可以单击任何单词来听到发音。我回应了一个程序员的在线广告并得到了回应！我通过电话和电子邮件与这位新客户详细讨论了该项目。最终她向我透露，她已经花了 2 年多的时间尝试与另一位开发人员构建此应用程序。哇... 2 年，呵呵。这不应该需要 2 年。所以，我深入研究并试图找出为什么他们一直在这方面工作这么长时间。她需要能够对 2 万个单词中的每个单词的每个字母进行风格化。她和之前的开发人员决定他们将为每个单词使用单独的 .fla，然后她可以通过编辑相应的 .fla 来风格化单词。此项目的 20k .fla 文件。你能想象维护 20k .fla 文件吗？即使只有 50 个字，这种架构也行不通。我解释说它应该是数据库驱动的并使用单个 .fla。我想我在 1 个月内构建了它，比她支付给其他开发人员的费用低 20 倍。相对于其他开发人员，我是这里的 10 倍开发人员，因为我发现了我客户的架构错误并说了一些话。", "note_en": "This story takes place in 2009 before Flash died.  Let me layout the project before I begin. The app automatically connects 20,000 pronunciation mp3s to words in any text. Then a user can click any word to hear the pronunciation.  I responded to an online ad for a programmer and got a response! I discussed the project at length via phone and email with this new client. Eventually she reveals to me that she&#39;s already spent over 2 years trying to build this app with another developer.  Woah...2 years, heh. This should not take 2 years.  So, I dig in and try to find out why they have been working on this for so long. She needed the ability to stylize each letter of each of the 20k words. She and the previous developer decided that they would use a separate .fla for each word and then she could stylize a word by editing the respective .fla.  20k .fla files for this project. Could you imagine maintaining 20k .fla files? Even if there were only 50 words this architecture would not work. I explain that it should be database driven and use a single .fla.  I think I built it in 1 month for 20x less than she paid the other developer. I was a 10x developer here relative to the other developer because I identified my client’s architectural mistake and said something.", "posttime": "2021-07-22 23:29:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,开发者,developer,开发人员", "title": "一个 10 倍的开发者故事", "title_en": "A 10x Developer Story", "transed": 1, "url": "https://www.peachesnstink.com/p/ne8LTpi9zMDG8WKJlf2nzR", "via": "", "real_tags": ["开发", "开发者", "developer", "开发人员"]}, {"category": "", "categoryclass": "", "imagename": "437aa99ac9839f9793e11ff881fba7bd.jpg", "infoid": 1069007, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "更新，2021 年 7 月 17 日：就 NASA 的历史而言，7 月 21 日的意义可能与 7 月 20 日不同，即巴兹奥尔德林和尼尔阿姆斯特朗于 1969 年登陆月球的日期。但回到 1961 年 7 月 21 日，另一个当 Gus Grissom 在一个小型水星太空舱内溅入大西洋时，人类太空飞行进化的关键时刻发生了——在这个过程中几乎淹死了。美国宇航局当天和接下来几周吸取的教训无疑改变了载人航天的进程。这个被忽视的事件将于下周三迎来 60 周年纪念日，因此我们正在重新展示太空编辑埃里克·伯杰 (Eric Berger) 从 Ars 档案中对 Grissom 着陆的检查。这个故事于 2016 年 11 月 8 日首次发布，它在下面看起来没有变化。 Gus Grissom 刚刚进入历史书籍。在艾伦·谢泼德 (Alan Shepard) 进行美国第一次载人航天飞行后仅 10 周，格里索姆就进行了第二次飞行，15 分钟的亚轨道跳跃将他带到了这颗蓝色星球上空 189 公里的高度。在水星小型太空舱的降落伞展开后，格里索姆飞溅到大西洋中，似乎结束了一次完美的任务。只是它不是完美无缺的，也不是封闭的。那一刻，Gus Grissom 差点淹死。那是 1961 年 7 月 21 日，在第二次水星任务即将结束时，Grissom 的航天器的舱门很早就爆炸了。海洋淹没了。宇航员的反应是跳出自由钟 7 号太空舱。他挣扎了五分钟，以保持在翻腾的海浪之上，即使他的宇航服在干燥时已经 22 磅，装满水。这件事在争议中载入史册。它的一些演绎，包括著名的《正确的东西》小说和汤姆·沃尔夫的电影，将 Grissom 描绘成“搞砸了狗”。这样的说法认为，宇航员在时间到来之前惊慌失措并开火，基本上是在邀请水进入。 但是作者乔治·利奥波德（George Leopold）的一本关于格里森生活的新书——计算风险：格斯·格里森的超音速生活和时代——以及最近的一次采访与美国宇航局水星计划恢复选项的负责人鲍勃汤普森一起消除了这种虚构。从这些经过深思熟虑的叙述中，Grissom 成为一个思维敏捷的英雄。他在不确定的情况下做出了果断的反应，否则这次任务就会以死亡告终。在美国严重落后于苏联的情况下，美国宇航局太空计划早期发生的此类事故可能会让肯尼迪总统暂停该国新生的登月雄心。半个多世纪后，Grissom 的名字已经从记忆中消失了。谢泼德获得了美国首次太空飞行的荣誉，约翰·格伦进行了首次轨道飞行，尼尔·阿姆斯特朗登上了月球。然而，在 1967 年阿波罗 1 号火灾中悲惨地结束了一段过于短暂的职业生涯之后，格里索姆值得认可，而不是作为一个不幸的注脚，而是一个真正的英雄。对于今天的宇航员来说，Grissom 在大西洋的濒死体验重新变得重要，它提醒人们注意海洋的危险，因为 NASA 计划通过海洋再次从深空返回其猎户座太空舱。\n“水是着陆的好地方，但着陆后它是一个地狱，”汤普森告诉 Ars。 “让我告诉你，你在海里会伤到自己。” Virgil Ivan &quot;Gus&quot; Grissom 是美国宇航局于 1959 年 4 月 9 日向世界宣布的水星七名宇航员中第二年轻的。他们都是炙手可热的试飞员，决心成为第一个在太空飞行的人。在团队中，Grissom 以努力工作（和努力参加派对）而著称。到 1961 年初，他、谢泼德和格伦已经成为梦寐以求的首飞的领跑者。最终所有的美国人都输给了尤里·加加林，但谢泼德声称获得了美国的荣誉。 Grissom 担任后备飞行员。然而，美国的第二次太空任务去了 Grissom。他将在很大程度上重复第一次水星飞行，并进行两个关键修改——自由钟 7 号太空舱将有一个梯形窗口，一个新的爆炸舱口将允许格里森自己离开航天器。为了炸开舱门，Grissom 必须从雷管上取下一个盖子，拉出一个安全销，然后按下一个柱塞。飞行本身很精彩。当格里森成为第一个从太空直接观察地球的美国人时，他惊叹于他的家乡星球。 “随着地平线进入视野，透过窗户的景色变得非常壮观，”他在飞行报告中说。 “那景象真是令人叹为观止。地球很亮，天空很黑，地球的曲率相当突出。”在“轻微震动”的情况下降落在水中后，Grissom 准备继续执行任务的最后阶段。 “我觉得此时我的状态很好，并开始为外出做准备，”他说。在打开舱门之前，Grissom 应该等待一架救援直升机飞过来，钩入太空舱顶部的起重环，然后将其从水中升起。一旦清除，他就要从雷管上取下盖子，拉动安全销，并启动点火装置。然后他可以踏上舱口的门槛，爬上从直升机上放下的马项圈，然后被拉到安全的地方而不会被淋湿。然而，Grissom 并没有等到直升机到达并钩住太空舱。当航天器在四英尺深的海面上漂浮时，他从雷管上取下盖子并拉动安全销。他没有推动柱塞，这需要五磅的力才能压下，但片刻之后，舱盖还是爆炸了。在《我们七个人》一书中（基于宇航员对水星计划的第一手资料），格里森写道：“引爆螺栓的柱塞太远了，我必须故意伸手去碰它。这不是我做的。”", "note_en": "Update, July 17, 2021: When it comes to NASA history, July 21 may not have the same significance as July 20, the date when  Buzz Aldrin and Neil Armstrong landed on the moon in 1969. But back on July 21, 1961, another pivotal moment in the evolution of human spaceflight took place when Gus Grissom splashed down in the Atlantic Ocean within a small Mercury capsule—almost drowning in the process. The lessons NASA learned that day and in the following weeks undoubtedly changed the course of human spaceflight. This overlooked event has its 60th anniversary next Wednesday, and as such we&#39;re resurfacing Space Editor Eric Berger&#39;s examination of Grissom&#39;s landing from the Ars archives. This story first published on November 8, 2016, and it appears unchanged below.\n  Gus Grissom had just entered the history books. A mere 10 weeks after Alan Shepard made America’s first human flight into space, Grissom followed with the second one, a 15-minute suborbital hop that took him to an altitude of 189km above the blue planet. After the small Mercury capsule’s parachutes deployed, Grissom splashed down in the Atlantic Ocean, seemingly bringing a flawless mission to a close.\n Only it wasn&#39;t flawless, nor was it closed. At that moment, Gus Grissom almost drowned.\n  It was July 21, 1961, toward the end of the second Mercury mission, and the hatch to Grissom&#39;s spacecraft blew early. The ocean flooded in. The astronaut responded by jumping free of the Liberty Bell 7 capsule. He struggled for five minutes to remain above the churning waves even as his spacesuit, already 22 pounds when dry, filled with water.\n This incident has gone down in history amid controversy. Some renditions of it, including the famous  The Right Stuff novel and movie from Tom Wolfe, portray Grissom as “screwing the pooch.” Such accounts argue that the astronaut panicked and fired his hatch before it was time, essentially inviting the water in.\n But a new book by author George Leopold about Grissom’s life— Calculated Risk: The Supersonic Life and Times of Gus Grissom—and a recent interview with the head of NASA’s recovery options for the Mercury program, Bob Thompson, dispels that fiction. From these measured accounts, Grissom emerges as a quick-thinking hero. He reacted decisively in an uncertain situation when otherwise this mission would have ended in death. Such an accident early in NASA&#39;s space program could have given  President Kennedy pause over the country’s nascent Moon-landing ambitions at a time when the US lagged badly behind the Soviet Union.\n    More than half a century later, Grissom’s name has faded from memory. Shepard has the honor of the first US spaceflight, John Glenn made the first orbital flight, and Neil Armstrong stepped on the Moon. Yet after an all-too-brief career that ended tragically in the 1967 Apollo 1 fire, Grissom deserves recognition not as an unlucky footnote but as a genuine hero. And for today’s astronauts, Grissom&#39;s near-death experience in the Atlantic Ocean has renewed importance, offering a sobering reminder of the sea&#39;s peril as NASA plans to return its Orion capsule from deep space again by way of the ocean.\n “Water is a great place to land in, but it’s a hell of a place post-landing,” Thompson told Ars. “Let me tell you, you can hurt yourself in the ocean.”\n  Virgil Ivan &#34;Gus&#34; Grissom was the second youngest of the Mercury Seven astronauts NASA announced to the world on April 9, 1959. They were all hotshot test pilots, determined to become the first human to fly in space. Among the group, Grissom distinguished himself by working hard (and  partying hard). By early 1961 he, Shepard, and Glenn had emerged as the frontrunners for the coveted first flight. Ultimately all of the Americans lost out to Yuri Gagarin, but Shepard claimed the US honor. Grissom served as the back-up pilot.\n The second US mission to space went to Grissom, however. He would largely repeat the first Mercury flight with two key modifications—the Liberty Bell 7 capsule would have a trapezoid-shaped window, and a new explosive hatch would allow Grissom to exit the spacecraft on his own. To blow the hatch, Grissom had to remove a cap from the detonator, pull out a safety pin, and push down on a plunger.\n The flight itself was splendid. As Grissom became the first American to directly view the Earth from space, he marveled at his home planet. “The view through the window became quite spectacular as the horizon came into view,” he said in  his flight report. “The sight was truly breathtaking. The Earth was very bright, the sky was black, and the curvature of the Earth was quite prominent.”\n    After landing in the water with a “mild jolt,” Grissom was ready to press ahead with the final stage of his mission. “I felt that I was in good condition at this point and started to prepare myself for egress,” he said. Before firing the hatch, Grissom was supposed to wait for a rescue helicopter to fly over, hook into the lifting loop on top of the capsule, and raise it out of the water. Once clear, he was to remove the cap from the detonator, pull the safety pin, and activate the firing mechanism. Then he could step onto the sill of the hatch, climb into a horse collar lowered from the helicopter, and be pulled to safety without ever getting wet.\n    Grissom didn’t wait for the helicopter to arrive and hook the capsule, however. As the spacecraft bobbed in four-foot seas, he removed the cap from the detonator and pulled the safety pin. He did not push the plunger, which required five pounds of force to depress, but a few moments later, the hatch blew anyway. In the book  We Seven (based on firsthand accounts of the Mercury program from the astronauts), Grissom wrote, “The plunger that detonates the bolts is so far out of the way that I would have to reach for it on purpose to hit it. This I did not do.”", "posttime": "2021-07-22 23:29:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nasa,grissom", "title": "Gus Grissom 给 NASA 上了惨痛的一课：“你可以在海洋中伤害自己”（2016 年）", "title_en": "Gus Grissom taught NASA a hard lesson: “You can hurt yourself in the ocean” (2016)", "transed": 1, "url": "https://arstechnica.com/science/2021/07/with-every-splashdown-nasa-embraces-the-legacy-of-gus-grissom/", "via": "", "real_tags": ["nasa", "grissom"]}]