[{"category": "", "categoryclass": "", "imagename": "f52851c9ba095fd20eeca3004c1ab3aa.png", "infoid": 1016156, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "集锦、新闻稿和演讲", "note_en": "Highlights, press releases and speeches", "posttime": "2020-08-04 22:09:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,新闻稿", "title": "欧盟执委会对谷歌拟收购Fitbit展开深入调查因担心谷歌可能使用的海量数据", "title_en": "The European Commission opens an in-depth investigation into Google's proposed acquisition of Fitbit over concerns about vast amounts of data Google could use", "transed": 1, "url": "https://ec.europa.eu/commission/presscorner/detail/en/ip_20_1446", "via": "", "real_tags": ["谷歌", "google", "新闻稿"]}, {"category": "", "categoryclass": "", "imagename": "2559bda071917900e207e5e9d995daea.jpg", "infoid": 1016155, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软将于9月15日在Android设备上独家推出名为Project XCloud的游戏流媒体服务。Project XCloud将作为Xbox Game Pass旗舰版订阅的一部分捆绑在一起，价格为每月14.99美元，并承诺在Android平板电脑和手机上提供100多款游戏。游戏流媒体最初将仅限于Android；iPhone和iPad用户将不得不等待。\n微软一位发言人在给The Verge的一份声明中表示：“我们的雄心是通过Xbox Game Pass在所有设备上扩展云游戏，但目前我们没有更多关于iOS的信息可供分享。”IPhone和iPad用户在发布时缺乏对iOS的支持，这会让他们感到失望，但这并不完全令人惊讶。虽然微软一直在iOS上测试XCloud，但该公司此前透露，由于苹果应用商店的政策，其测试是有限的。\n微软没有透露哪些苹果政策阻止XCloud在iOS上推出，但谷歌的Stadia服务也不能在iPhone或iPad上使用。Valve的Steam Link应用程序花了近一年的时间才获得苹果的批准，尽管它主要是从你的家用PC上播放游戏。作为科技反垄断听证会的一部分，苹果最近还面临着众议院司法委员会(House Judiciary Committee)对其30%的应用内购买削减和严格的App Store政策的质疑。\n微软现在正不顾一切地在9月15日推出XCloud，尽管该公司似乎将其称为Xbox Game Pass旗舰版的“云游戏”功能。它将于下个月在22个国家推出，包括奥地利、比利时、加拿大、捷克、丹麦、芬兰、法国、德国、匈牙利、爱尔兰、意大利、荷兰、挪威、波兰、葡萄牙、斯洛伐克、西班牙、韩国、瑞典、瑞士、英国和美国。\n云游戏功能，也就是我们今天所知的XCloud，也将以测试版的形式推出，而微软正在努力将其扩展到它预计将在世界各地使用这项服务的数百万人。微软将于9月11日结束免费的XCloud预览版，该公司正计划在9月15日推出更新后的Xbox Game Pass应用程序，提供游戏流媒体功能。有趣的是，据微软称，将在韩国One Store和面向三星全球用户的Galaxy Store上发布的版本都将包括“应用内购买功能”，这表明Google Play Store版本不会。\n微软还与Razer、PowerA、8BitDo和Nacon合作，开发可用于XCloud的配件和控制器。你还可以使用现有的Xbox One控制器，甚至索尼的DualShock4控制器在XCloud上玩游戏。微软目前还没有详细说明将在游戏流媒体上推出的所有100多款游戏，但该公司提供了一份即将推出的36款游戏的清单：", "note_en": "Microsoft will launch its game streaming service, known as Project xCloud, on September 15th exclusively on Android devices. Project xCloud will be  bundled as part of the Xbox Game Pass Ultimate subscription, priced at $14.99 per month, with a promise of more than 100 games available on Android tablets and phones. Game streaming will be limited initially to Android; iPhone and iPad users will have to wait.\n “It’s our ambition to scale cloud gaming through Xbox Game Pass available on all devices, but we have nothing further to share at this time regarding iOS,” says a Microsoft spokesperson in a statement to  The Verge. The lack of iOS support at launch will be disappointing to iPhone and iPad owners but not exactly surprising. While  Microsoft has been testing xCloud on iOS, the company previously revealed its testing was limited due to Apple’s App Store policies.\n Microsoft hasn’t revealed which Apple policies are preventing xCloud from launching on iOS, but Google’s Stadia service is also not available on iPhones or iPads.  Valve’s Steam Link app took nearly a year for Apple to approve even though it primarily streams games from your home PC. Apple has also faced questions over its  30 percent cut of in-app purchases and strict App Store policies from the House Judiciary Committee recently as part of a  tech antitrust hearing.\n   Microsoft is now pushing ahead with its xCloud launch on September 15th regardless, although it appears the company is referring to it as the “cloud gaming” feature of Xbox Game Pass Ultimate. It’s launching in 22 countries next month, including Austria, Belgium, Canada, Czech Republic, Denmark, Finland, France, Germany, Hungary, Ireland, Italy, Netherlands, Norway, Poland, Portugal, Slovakia, Spain, South Korea, Sweden, Switzerland, the United Kingdom, and the United States.\n The Cloud gaming feature, or xCloud as we know it today, will also launch as a beta while Microsoft works to scale it to the millions it expects to use the service around the world. Microsoft will end its free xCloud preview on September 11th, and the company is planning to launch an updated Xbox Game Pass app with game streaming on September 15th. Interestingly, the versions that will be published on the One Store in Korea and Galaxy Store for Samsung users globally will both include “in-app purchase capabilities,” according to Microsoft, suggesting that the Google Play Store version will not.\n Microsoft is also partnering with Razer, PowerA,  8BitDo, and Nacon to create accessories and controllers that are ready for xCloud. You’ll also be able to use existing Xbox One controllers or even Sony’s DualShock 4 controllers to play games on xCloud. Microsoft isn’t detailing all 100-plus games that will be available for game streaming just yet, but the company is providing a list of 36 titles that are coming:", "posttime": "2020-08-04 22:08:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "android,microsoft,微软,游戏,xcloud", "title": "微软的XCloud游戏流媒体服务将于9月15日在22个国家的Android上推出，并与Xbox Games Pass Ultimate订阅捆绑在一起", "title_en": "Microsoft's xCloud game streaming service will launch on September 15 on Android in 22 countries, bundled with the Xbox Games Pass Ultimate subscription", "transed": 1, "url": "https://www.theverge.com/2020/8/4/21353814/microsoft-xcloud-date-launch-android-xbox-game-pass-ultimate?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["android", "microsoft", "微软", "游戏", "xcloud"]}, {"category": "", "categoryclass": "", "imagename": "c78926f402fdd6012b9ca523d42272b1.jpg", "infoid": 1016154, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现代顶尖公司的领导人一度都是初创企业家，他们只梦想建立一家有利可图的企业。每个领导都必须学习如何管理人员，如何经营企业，如何处理错误，他们必须向他们学习。这些人的真实经历对商业新手和有经验的企业家都很有价值，他们不仅想让自己的公司生存下去，还想让公司成为市场领导者。\n我们已经创建了一份销售、财务、商业和管理方面的优秀书籍清单，每一本书都可以成为任何级别的企业家的强大动力。\n以下是创业者必读的最佳商业书籍清单。从那些持续获得高额利润的人的成功中吸取的经验教训会让你思考未来，以及你如何现在就开始把它变得更好。\n这本书是用简单的语言写的，但它揭示了几个有趣、复杂和令人兴奋的想法。沃伦·巴菲特(Warren Buffett)--美国最著名的投资者--的独特之处在于，他的数十亿美元不是通过公司的发展获得的，而是通过投资其他公司获得的。读这本书你能学到什么？巴菲特的投资决策，他的战术，战略，他如何选择正确的投资，他如何工作，以及一个伟大的投资者的思维方式。\n“巴比伦首富”是一部经典之作，但书中勾勒出的成功秘诀适用于任何活动领域。想学习如何赚钱吗？阅读这本书会让你更接近于理解金融的核心和不变的规律，理解进行有利可图的投资的秘诀，以及积累、保存和增加你的资本。\n书：首先，打破所有规则：世界上最伟大的经理人有什么不同的做法。\n对于学习销售和人事管理书籍的实习经理来说，这本书应该是你办公桌上的必需品。您如何发现员工的优势？你如何展示他们的才华，并最大限度地投入到他们的工作中？知识、能力、技能、经验、成就--这些概念不能混淆，也不能替换。你不能要求员工做不到的事情，但是有办法在团队中创造一个理想的工作氛围，从而确保你的公司又快又有效地发展。\n新书：重温电子迷思：为什么大多数小企业行不通？该怎么办？\n对于那些打算白手起家创业的人来说，这本书是天赐之物。即使没有创始人，什么样的商业模式也能顺利运作？小企业发展的秘诀是什么？您如何组织、发展和改进您的业务？所有这些你都会以一种简单易懂的形式学习。\n这本书显然从其他传统商业小说中脱颖而出。它教你控制你的生活，深入分析新出现的问题，它向读者介绍限制理论，它谈论爱和风险。作者的非标准思维使“目标”这本书成为寻找常识和理性生活方式的真正教程。\n最好的商业书籍不是每天都写的。几十年后，它们都必须通过时间的考验来证明它们的相关性。注意从经商权威毋庸置疑的作者那里选书。\n这本来自管理大师本人的书可以作为经验丰富的管理者和初学者的一本圣经。这本书，连同它的许多实用技巧，给出了关于世界经济和人类总体发展的全球预测。“21世纪的管理任务”不是枯燥的理论，而是积极的行动号召。是落实新任务、解决紧迫问题的准备。\n这本奇妙的书值得一读，它可以帮助你理解，没有一本书能解决你的问题，不管它是不是关于商业和创业的最好的书。成功的关键是这本发行量超过1000万册的畅销书的作者在成功的公司中看到的：对责任的理解，对正确事物的理解，对建设性思维的理解，以及对出人意料的大胆决定的理解。\n史蒂夫·乔布斯的传记不仅在销量上大获成功，而且是一本超级畅销书。它是建立在与苹果创始人本人以及他的亲戚、朋友和敌人、祝福者和竞争对手的大量对话的基础上的。史蒂夫·乔布斯的生平故事令人兴奋，富有启发性，令人惊讶，更重要的是，它激励并促使你思考、适应和奋斗。\n这本书的原名是亨利·福特，他改变了我们今天生活的世界，书名是“我的生活和工作”。它享誉世界，有一百多个版本。许多人认为这本书是亨利·福特本人的传记，但更确切地说，这是他一生工作的传记。公司发展和业务创建的原则，起伏，风险和错误，胜利和突破-一切都在这里突显通往巨大成功和全球认可的道路是多么复杂、漫长和艰难。\n与纸质媒体脱节的年轻企业家经常在文学和有声读物中寻找答案，以回答一个紧迫的问题：“你如何才能从头开始创业？”--但他们这样做是徒劳的。商业想法、小贴士、理论、方法论以及真正的成功故事往往比承诺揭示全球经济秘密的昂贵的长期课程更有效。\n想出一个商业点子并付诸实施并不是最困难的事情。推广一种产品，将其推向市场，并释放出螺旋式的增长和发展，难度要大得多。在真实消费者身上快速测试新产品，即时调整业务发展策略，是本书作者向大家展示的建议之一，可以让你免于无尽的陷阱和大规模的损失。\n书：辞去工作前的富爸爸：每个企业家都应该知道的关于建立数百万美元企业的10个现实生活中的教训。\n你在这本书中为商人和企业家找到了什么？在商业上取得成功的十种有效且经过验证的方法。这些将不是理论计算，而是对世界市场资源的令人印象深刻的分析。作者谈到了他的成功，承认了他的错误和失败。剩下的就是得出通往成功和繁荣的结论和教训。\n“创业者指南”这本书是为那些即将开始创业或已经朝这个方向迈出了第一步的人准备的。Bill Oleta描述了创建创新产品和启动创业的所有阶段，为读者提供了几乎一步步的指导。你能学习创业精神吗？是的，你只需要一本合适的商业书籍。\n书：你的初创企业：适应未来，投资于自己，改变你的职业生涯。\n商业成功的秘诀之一是思维的灵活性和适应环境的能力。不断寻找新想法、新市场、新产品、新机会--企业家的本能总是引领商人走向成功。你对发展像英特尔、苹果或谷歌这样的初创企业的秘诀感兴趣吗？“创业人生”一定会符合你的兴趣。\n理查德·布兰森(Richard Branson)认为，对于商业初学者和企业家来说，最重要的是自力更生、勇气、勇气和奉献精神。如果你准备打破刻板印象，战斗，克服障碍，而不是等待你的一生找到有利的条件，这本书将是你发展自己的巨大动力。\n这本书的书名似乎太有看头了，但它的内容不会让你失望的。你是否对“延期生活”和“办公室奴役”条件太熟悉了？那么你肯定需要知道什么是“每周4小时工作制”。了解新的生活方式和成功的新理念！\n这位最著名的年轻现代商人之一令人印象深刻的精彩传记令人难以置信地鼓舞人心。Zappos从零到数十亿的道路只用了不到10年的时间。你可以获得关于这是如何发生的第一手信息-关于它所需要的所有计划，关于所有的错误，以及让Zappos成功的环境。\n这本书完全致力于理查德·布兰森爵士真正的成功故事。他的写作非常坦率。在商人和企业家眼中，对这个故事特别有价值的是维珍集团创始人这本笔记本中的语录和摘录。\n市场营销文献是实验想法的取之不尽的源泉。这是一个面向初学者和高级营销人员的报头。\n读完这本书后，神秘的营销术语将不再让你感到害怕。作者(顺便说一句，是诺贝尔奖获得者)将告诉你什么是“慢”和“快”思维，以及它们如何影响我们行为和决策的合理性。\n根据传奇人物杰克·特劳特的权威观点，差异化是现代营销成功的基础。面对激烈的竞争，生存本身并不是目的。制定强有力的促销策略，击败竞争对手，打造品牌，在全球营销中取得成功，这是你应该努力的方向。\n对于仔细分析目标受众需求的营销者和广告商来说，这本出版物将是一本最有价值的读物。你将能够从一个新的角度来看待消费者的世界，这种观点必然会导致原创营销理念的出现。许多实用资料会给你提供发人深省的食粮。\n没有比口碑更好的产品广告了。但是你是怎么得到它的呢？你需要成为一名出色的营销员吗？还是在广告上投入巨资？不用谢。你可以让每个人都谈论你的品牌，并在通俗易懂的实用指南的帮助下，将这些对话转化为有效的推广策略。\n商学院没有教授突破性思维，事实上，它与分析思维和固有的灵活性相结合，创造了独特的创造力。对于一个优秀的营销者来说，掌握这些技能是至关重要的。\n这本书总是希望手头有定期重读和更新的记忆，它包含了分析机制，相关的投资技巧，以及关于金钱科学的方法论。试图理解这一科学并将其应用于实践，是未来金融福祉的关键。\n许多现代交易员和金融分析师将他们的成就归功于艾略特波原理。作者制定的方法可以让读者对证券交易所的变化做出准确的预测，对于任何进行证券交易的人来说都是不可或缺的。\n这本关于管理和财务的书将是自我发展的极好工具。它将清除你大脑中“金融负面”的旧刻板印象，并重新配置它的“金钱浪潮”。\n财务管理书籍顶部的最后一条是区块链指南，以一种迷人的方式揭示了这项巧妙发明的精髓。\n给商人和企业家的好文学作品会给你很多实用的建议和建议，告诉你如何逃离危急关头，教你新知识，如何改变坏习惯，如何形成通向真正成功的思维。", "note_en": "The leaders of the top modern companies were, at one time, startup entrepreneurs who only dreamed of building a profitable business. Each leader had to learn how to manage personnel, how to run a business, how to handle mistakes, and they had to learn from them. The real experiences of these people are of great value for both business newcomers and the experienced entrepreneurs who want to not only keep their company afloat but also bring it to market leadership.\n We’ve created a list of great books on sales, finance, business, and management, each of which is ready to serve as a powerful motivator for entrepreneurs of any level.\n   Here is a list of the best business books that are required reading for entrepreneurs. Lessons from the successes of people who have achieved consistently high profits will make you think about the future and how you can start changing it for the better right now.\n   This book is written in simple language, but it reveals several interesting, complex, and exciting ideas. The uniqueness of Warren Buffett – the most famous investor in America – is that his billions were acquired not by the development of his company, but by investing in others. What can you learn by reading this book? Buffett’s investment decisions, his tactics, strategies, how he chose the right investments, how he works, and the way a great investor thinks.\n   The Richest Man in Babylon is a classic piece of economic literature, but the secrets of success outlined in it apply to any field of activity. Want to learn how to make money? Reading this book will bring you closer to understanding the central and unchanging laws of finance, to comprehending the secret of making profitable investments, and to accumulating, preserving, and increasing your capital.\n Book: First, Break All the Rules: What the World’s Greatest Managers Do Differently\n  For practicing managers who study books on sales and personnel management, this book should be a staple on your desk. How do you discover the strengths of your employees? How do you reveal their talents and achieve maximum commitment to their work? Knowledge, abilities, skills, experience, achievements – these concepts should not be confused nor replaced. You cannot demand from people what they are not capable of, but there are ways of creating an ideal working atmosphere on a team, thus ensuring the effective and rapid development of your company.\n Book: The E-Myth Revisited: Why Most Small Businesses Don’t Work and What to Do About It\n  This book is a godsend for those who are going to build their business from scratch. What business model will work smoothly, even without its founder? What are the secrets of the development of small enterprises? How do you organize, develop, and improve your business? All of this you will learn in an easy and understandable form.\n   This book clearly stands out from other traditional business novels. It teaches you to control your life and deeply analyze emerging problems, it introduces readers to the theory of limitations, and it talks about love and risk. The author’s non-standard thinking has made the book “The Goal” a real tutorial in the search for common sense and a rational approach to life.\n   The best books on business are not written every day. All of them have had to pass the test of time to prove their relevance after decades. Pay attention to the selection of books from authors whose authority in business is beyond doubt.\n   This book from the management guru himself can be used as a kind of bible for experienced managers and beginners alike. The book, along with its many practical tips, gives global forecasts regarding the development of the world economy and humanity in general. “Management Tasks in the 21st Century” is not dry theory, but an active call to action. It is preparation for the implementation of new tasks and the solution to urgent problems.\n   This fantastic book is worth reading to help you understand that not one book, regardless of whether it’s the very best book on business and entrepreneurship, will solve your problems. The key to success is what the author of the bestseller, which has a circulation of more than 10 million copies, sees in successful companies: the understanding of responsibility, in what is right, in constructive thinking, and in unexpected and bold decisions.\n   The biography of Steve Jobs was not only a sales hit, but a mega-bestseller. It is based on a huge number of conversations with the creator of Apple himself, along with his relatives, friends and enemies, well-wishers, and competitors. The life story of Steve Jobs is exciting and instructive, surprising, and more importantly, it inspires and makes you think, adapt, and fight.\n   The original title of the book by Henry Ford, who changed the world we live in today, is My Life And Work. It is famous all over the world and has more than one hundred editions. Many consider the book to be the biography of Henry Ford himself, but rather, this is the biography of his life’s work. Principles of company development and business creation, ups and downs, risks and mistakes, victories and breakthroughs – everything is here to highlight how complicated, lengthy, and thorny the road to enormous success and global recognition can be.\n   Disconnected from print media, young entrepreneurs often look for answers in literature and audio books to the burning question: “How can you start a business from scratch?” – And they do so in vain. Business ideas, tips, doctrines, methodologies, as well as real success stories are often more effective than long, expensive courses that promise to reveal global economic secrets.\n   To come up with a business idea and implement it is not the most difficult thing. It is much more difficult to promote a product, get it to the market, and unleash a spiral of growth and development. The rapid testing of new products on real consumers to instantly adjust business development strategies is one of the proposals the author of this book shows you, which can save you from endless pitfalls and large-scale losses.\n Book: Rich Dad’s Before You Quit Your Job: 10 Real-Life Lessons Every Entrepreneur Should Know About Building a Multimillion-Dollar Business\n  What do you find in this book for businessmen and entrepreneurs? Ten effective and proven ways to achieve success in business. These will not be theoretical calculations, but an impressive analysis of the resources of the world market. The author talks about his successes and admits his mistakes and failures. All that is left is to draw conclusions and lessons that lead to success and prosperity.\n   The “Guide for Entrepreneurs” book is intended for those who are on the verge of starting their own business or who have already taken the first steps in this direction. Bill Oleta describes all the stages of creating an innovative product and launching a startup, offering the reader almost step-by-step instructions. Can you learn entrepreneurship? Yes, you just need the right business literature.\n Book: The Start-Up of You: Adapt to the Future, Invest in Yourself, and Transform Your Career\n  One of the secrets to business success is flexibility of thinking and the ability to adapt to circumstances. The constant search for new ideas, markets, products, opportunities – the entrepreneurial instinct always leads businessman to success. Are you interested in the secrets of developing startups like Intel, Apple, or Google? “Life as a Startup” will definitely match your interests.\n     For business beginners and entrepreneurs, the most important thing, according to Richard Branson, is self-reliance, courage, boldness, and dedication. If you are ready to break stereotypes, fight, and overcome obstacles instead of waiting for your whole life to find favorable conditions, this book will be a great incentive for you to develop yourself.\n   The title of the book seems too promising, but its contents will not disappoint you. Are “deferred life” and “office slavery” conditions that you’re all too familiar with? Then you definitely need to know what “The 4-Hour Work Week” is. Get to know the new lifestyle and new philosophy of success!\n   The impressively brilliant biography of one of the most famous young modern businessmen is incredibly inspiring. Zappos’ path from zero to billions took less than 10 years. You can get first-hand information about how this happened – about all the planning it took, about all the mistakes, and circumstance that made Zappos a success.\n   This book is entirely devoted to the real success story of Sir Richard Branson. He is remarkably frank in his writing. Of particular value to the story in the eyes of businessmen and entrepreneurs are the quotes and excerpts from this notebook of the founder of the Virgin Group.\n   Marketing literature is an inexhaustible source of ideas for experimentation. Here is a paper masthead for beginners and advanced marketers.\n   Mysterious marketing terms will stop scaring you after reading this book. The author (a Nobel laureate, by the way) will tell you what “slow” and “fast” thinking is, and how they affect the rationality of our behavior and decision making.\n   According to the authoritative opinion of the legendary Jack Trout, differentiation is the basis of successful modern marketing. In the face of fierce competition, survival is not an end in itself. Developing a powerful promotional strategy, beating competitors, creating a brand, and achieving success in global marketing is what you should strive for.\n   For marketers and advertisers who meticulously analyze the needs of their target audience, this publication will be a most valuable read. You will be able to look at the consumer’s world from a new angle, and this view will invariably lead to the emergence of original marketing ideas. A lot of practical material will provide you with food for thought.\n   There is no better advertising for a product than word of mouth. But how do you get it? Do you need to be a brilliant marketer? Or invest heavily in advertising? Not at all. You can make everyone talk about your brand and turn these conversations into an effective promotion strategy with the help of an accessible and practical guide.\n   Breakthrough thinking is not taught in business schools, and in fact, it, in combination with an analytical mindset and inherent flexibility, creates unique creativity. It is vital for a good marketer to master these skills.\n     This book, which is always desirable to have on hand to periodically re-read and update in your memory, contain mechanisms for analysis, relevant techniques for investing, and methodologies about the science of money. Attempts to comprehend this science and apply it in practice is the key to financial well-being in the future.\n   Many modern traders and financial analysts owe their achievements to Elliott wave principle. The methods formulated by the author allow readers to make accurate predictions about changes on the stock exchanges and are indispensable for anyone who is going to trade in securities.\n   This book on management and finance will be an excellent tool for self-development. It will clear your brain of old stereotypes of “financial negative” and reconfigure its “money wave.”\n   The last item in the top of the books on financial management is a guide to the blockchain, revealing the very essence of this ingenious invention in a fascinating way.\n Good works of literature for businessmen and entrepreneurs will give you a lot of practical advice and recommendations, show you how to escape critical situations, teach you new knowledge, how to change bad habits, and how to form the thinking that leads to real success.", "posttime": "2020-08-04 22:07:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "商业,书籍,企业家,books,理解", "title": "最适合企业家的商业书籍", "title_en": "Best Business Books for Entrepreneurs", "transed": 1, "url": "https://www.plerdy.com/blog/26-best-business-books/", "via": "", "real_tags": ["商业", "书籍", "企业家", "books", "理解"]}, {"category": "", "categoryclass": "", "imagename": "3cf11483891a9fc23a4c96f0bf5dd58c.png", "infoid": 1016153, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "$\\BEGINGROUP$QUICE最终更新：只想感谢MO用户的所有支持。特别感谢你的快速回答，我已经接受了第一个，感谢它带给我的清晰。我已经用${\\rmcr}(G)$更新了我的圆环算法。在我的完整测试集上运行良好，即圆环上的${\\rmcr}(G)={\\rmPCR}(G)$的证据。关于这一点的更多信息，稍后还将从上一个答案开始测试更清晰的界限。我会及时提交的！再次感谢MO用户的帮助！\n原帖：如果“危机”这个词用得太重，我道歉，但我现在处于恐慌状态，如果这个词是正确的话：两周后，我应该提交我的博士论文，但我刚刚收到了坏消息，或者我应该说一些让我非常担心的信息。这真的是一种紧急情况：\n我的论文是计算机科学，与球面和环面上的图形绘制相关的算法。我依赖的一个重要数学结果是图的边交叉引理(或边交叉不等式)。它给出了图$G$的任意图$G$具有$n$顶点和$e$边${\\rmcr}(G)\\geq\\frac{e^3}{64n^2}$$的最小边交数${\\rmcr}(G)$的下界。\n问题：我在Pach and Tóth的文章中读到，关于交叉数的数学试卷有可能有不同的定义。有交叉数${\\Rmcr}(G)$($G$的最小边交叉数)，也有${\\RmPcr}(G)$的对交叉数，即$G$的图中的最小边对交叉数。我仔细检查了我的算法，根据这个定义，我清楚地应用了配对交叉数${\\rMPCR}(G)$。\n关键问题：你能向我证实边交叉引理在球面和环面上对交叉数${\\rMPCR}(G)$也是有效的吗？\n参考文献：János Pach和Géza Tóth。不管怎么说，它是哪个十字路口的号码？J·康宾。理论系列。B，80(2)：225-246,2000。\n$\\结束组$。\n我真的对穿越号码一无所知，但我能理解这对你来说压力有多大。我希望你能及时修补！$\\endgroup$-卡尔-弗雷德里克·尼伯格·布罗达(Carl-Fredrik Nyberg Brodda)\n$\\Begingroup$@PerAlexandersson-据我所知，两条边可能相交多次；此多重数计入cr，但不计入PCR，因此PCR$\\leq$cr。$\\endgroup$-Carlo Beenakker。\n$\\Beginggroup$我想投下一票的人在写博士论文时从来没有感觉到任何压力…。$\\endgroup$-1 EFinat-S。\n弗雷格曾经不得不写一篇文章，科学家很难遇到比工作刚结束就让基础让路更令人不快的事了。当这部作品即将付诸报刊时，伯特兰·罗素先生的一封信把我推到了这个位置。&#34；...$\\endgroup$-1 Toffomat。\n$\\BEGINGROUP$也许您可以接受这里的答案，然后在您成功答辩论文后添加您自己的答案。绝大多数阅读这个问题的人都支持你。$\\endgroup$-约翰·科尔曼。\n$\\Beginggroup$$\\DeclareMathOperator\\cr{cr}\\DeclareMathOperator\\pcr{pcr}$For对交叉数$\\Pcr(G)$，简短的回答是肯定的，交叉引理对球面上的图成立，但不知道它是否也在环面上成立。\n对你来说，最好也是最新的参考资料可能是谢弗的调查文章，该文章于2020年更新：“图形交叉数及其变种：调查”(The Graph Crossing Number and It Variables：A Survey)，来自电子组合学杂志(https://doi.org/10.37236/2713).)。\n为您提供的相关页面是第5页和第6页，其中引用了Schaefer的以下内容：\n“由于哈纳尼-图特定理对环面不成立，这意味着我们目前没有关于环面上的$\\pcr$或$\\pcr_−$的交叉引理的证明。”\n通常，$\\PCR(G)\\leq\\cr(G)$。他们是否相等仍是一个悬而未决的问题。交叉引理的第一个证明没有做出区分。第一个提出这种模棱两可的是莫哈尔(1995)在一次会议演讲中。\n你提到的Pach和Tóth(2000)论文确实区分了$\\PCR(G)$和$\\cr(G)$，并将Hanani-Tutte应用于交叉引理的证明中，从而确保它也适用于$\\PCR(G)$。\n问题是您可以将Hanani-Tutte应用于球体(和投影平面)，但不能将其应用于圆环。对于亏格$\\geq4$的曲面，已知是假的，请参见Fulek和Kynčl(2019年)。这意味着圆环真的是“介于两者之间”。\nBojan Mohar(1995)：在拓扑图论特别会议上提到的问题，Mathfest，Burlington，Vermont，Mathfest，Vermont。(引用自：L.A.SZékely(2016)：图兰的砖厂问题：Zarankiewicz和Hill猜想的现状。见：R.Gera等人。(编著)(2016)：图论-最受欢迎的猜想和公开问题。1)。\nRadola v Fulek和Jan Kynčl(2019年)：推广的HANANI-TUTE定理在属4表面的反例。组合，39(6)：1267-1279。\n$\\结束组$。\n$\\egingroup$顺便说一下，作者的名字叫托斯，不是索特·哈哈。$\\endgroup$-1霍利斯·威廉姆斯。\n$\\Begingroup$从OP&#39；的观点来看，这可以被视为玻璃杯半满，而不是玻璃杯半空。他们的论文结果明确地保持在球面上，并可能保持在环面上，尽管如果他们这样做了，这是一个悬而未决的问题。研究从给定的猜想是否为真得出的结论当然是合法的。它甚至可以被当作论文的一个特写，而不是一个错误。如果环面上的结果实际上失败了，那么你就知道这个猜想一定是错误的。潜在地，它可能会开辟一条卓有成效的攻击途径。$\\endgroup$-约翰·科尔曼\n$\\BEGINGROUP$我认为在代数拓扑学文献中，Hanani-Tutte被认为是Flores-Van Kampen型定理的一个版本，如果这是一个有用的链接。\n$\\BEGINGROUP$添加我的评论，这里是来自A.Skopenkov arxiv.org/pdf/1805.10237.pdf$\\endgroup$-mat的2019年平面图形不变量参考。\n$\\Begingroup$@ClausDollinger。这种清晰度是有帮助的。谢谢你的快速帮助。非常感谢。我很高兴我能保留我的球面算法。我正在检查是否可以在接下来的5天内将我的环面算法调整为${\\rmcr}(G)$$\\endgroup$-.user161819。\n$\\Begingroup$假设Robertson和Seymour关于Kuratowski未成年人的Ramsey型结果[FK18，权利要求5]未发表[FK18，权利要求5]，在图-次要社区中，交叉引理的一个渐近变体$\\Operatorname{cr}(G)\\ge\\omega(e^3/n^2)$，即使对于固定曲面(如环面)上的对交叉数也成立。\n利用Radola v Fulek[FK18，推论9]，我们已经证明了[FK18，权利要求5]蕴含了可定向曲面上的Hanani-Tutte定理的一个近似版本。特别地，[FK18，权利要求5]暗示存在一个常数$g$，使得对于可以绘制在环面上且每对独立边相交偶数次的每个图$G$，都可以在亏格为$g$的可定向曲面上绘制$G$而没有十字。这就是说，[FK18，权利要求5]意味着对于可以绘制在环面上且每对独立边相交偶数次的图$G$，可以在亏格为$g$的可定向曲面上绘制$G$。正如马库斯·谢弗(Marcus Schaefer&#39)第5-6页所述；的调查[S20]，在克劳斯·多林格的回答中提到。另见[SSSV96，定理4.1]。\nHttps://dx.doi.org/10.4230/LIPIcs.SoCG.2018.40，https://arxiv.org/abs/1803.05085-R.Fulek和J Kynčl，库拉托夫斯基未成年人的$\\mathbb Z_2$-亏格。\n[https://doi.org/10.1007/BF02086611-F.Shahrokhi，L.A.Székely，O.S y.kora和I.VRT&#39；o，具有较少交叉的曲面上的图形的绘图，算法16,118131(1996)][Székely，O.S.Motikora and I.VRT&#39；o]，算法16，第118-131页(1996年)。\n[S20]https://doi.org/10.37236/2713-M.Schaefer，图形交叉数及其变体：调查，组合学电子期刊，DS21：2020年2月14日。\n$\\结束组$。\n$\\BEGINGROUP$是Schaefer的调查Hanani-Tutte及相关结果(MSN)？$\\endgroup$-.LSpice。\n我指的是克劳斯·多林格(Claus Dollinger)答案中提到的关于穿越人数的调查。我将进行编辑并添加引用以使其清楚。$\\endgroup$-Jan Kyncl。\n$\\BEGINGROUP$顺便说一下，您知道您的用户名中允许使用像ˇ这样的变音符号，对吧？$\\EndGroup$-.lspice。\n$\\Begingroup$@JanKyncl也感谢您的帮助，非常感谢。我的导师说教员不会接受渐近性。我正在检查是否可以将${\\rmcr}(G)$放入我的环面算法$\\endgroup$-.user161819。\n$\\BEGINGROUP$@user161819我想发表评论，但评论太长了，所以把它作为答案。但是，请将其作为稍后的评论，一旦一切都完成了：\n如果我正确理解了您对我答案的评论，您的目标是更改圆环的算法，使其与${\\rmcr}(G)$一起工作。我想整个MO社区都在祈祷，希望你能按时成功地完成所有的事情！\n看着远处的地平线，我想给你一个建议。一旦您更改了环面算法并完成了论文，您手中将有效地掌握两个环面算法：基于${\\rmPCR}(G)$的旧算法和基于${\\rmcr}(G)$的新算法。我在这里说的是显而易见的，把它们都保留下来，它们真的可以为未来的研究带来丰硕的成果。\n(1)显然，您的两个算法可以支持对${\\rMPCR}(G)\\stackrel{\\rm？}{=}{\\rmcr}(G)$这一大的公开问题的研究。他们可以为未来的平等证明或实际反例提供实验证据、想法和见解。(再一次，我在这里说的是显而易见的事情。)。\n(2)要真正在环面上对${\\rmPCR}(G)\\stackrel{\\rm？}{=}{\\rmcr}(G)${\\rmcr}(G)$\\frac{1}{29}\\frac{e^3}{n^2}$$进行压力测试，也可以尝试$e&gt；7n$的图的迄今最好的下界。这个下限来自于EYAL AKERMAN(2019年)：关于每条边至多有四个交叉的拓扑图&#34；，计算几何，85：101574，31，doi：10.1016/j.comGeo.2019.101574(您可能从您引用的维基百科文章中知道了这一点)。\n我认为你的问题和整个话题真的很重要。LászlóSzékely称其为基础性问题之一，并在他的文章“图兰的砖厂问题：Zarankiewicz和Hill猜想的现状”中用了整整一节的篇幅来讨论这一问题。见：R.Gera等人。(编著)(2016)：图论-最受欢迎的猜想和公开问题。1)。\n$\\结束组$。\n$\\Beginggroup$感谢您的评论！！非常感谢。再次感谢您的帮助。我对这个Ackermann界限非常感兴趣，我会看看它$\\endgroup$-1user161819。\n$\\BEGINGROUP$一件好事，我更新的环面算法的原型：在我的测试集中的前2个图上进行测试，结果是正常的$\\endgroup$-.user161819。\n$\\Begingroup$术语Ackermann Bound通常指的是比这里给出的类型严重得多的边界：en.wikipedia.org/wiki/Ackermann_function$\\endgroup$-*Terry陶渊源。\n$\\BEGINGROUP$@TerryTao Terry你说得很对。你提到的威廉·阿克曼界限和我在这里引用的埃亚尔·阿克曼界限有很大的不同！很高兴能做出区分。$\\endgroup$-1克劳斯·多林格\n点击“发布您的答案”，即表示您同意我们的服务条款、隐私政策和Cookie政策。\n不是你想要的答案吗？浏览标记的其他问题或提出您自己的问题。", "note_en": "$\\begingroup$  QUICK FINAL UPDATE: Just wanted to thank you MO users for all your support. Special thanks for the fast answers, I&#39;ve accepted first one, appreciated the clarity it gave me. I&#39;ve updated my torus algorithm with  ${\\rm cr}(G)$. Works fine on my full test set, i.e. evidence for  ${\\rm cr}(G)={\\rm pcr}(G)$ on torus. More on this later, will test sharper bound from last answer as well.  I&#39;m going to submit in time! Thanks again MO users for all your help!\n Original post: I apologize if „crisis“ is too strong a word, but I am in a mode of panic, if that&#39;s the right word: In two weeks, I should be submitting my Ph.D. Thesis, but I have just received bad news, or I should say information that makes me very concerned. It is really an emergency situation:\n My thesis is in computer science, algorithms related to graph drawings on the sphere and the torus. One of the cornerstone mathematical results I am relying on is the graph edge crossing lemma (or edge crossing inequality). It gives a lower bound for the minimum number of edge crossings  ${\\rm cr}(G)$ for any drawing of the graph  $G$ with  $n$ vertices and  $e$ edges $${\\rm cr}(G)\\geq \\frac{e^3}{64n^2}$$for  $e&gt;4n$.\n PROBLEM: I am reading in the article of Pach and Tóth that there is a possibility that mathematics papers on crossing numbers operate with different definitions. There is the crossing number  ${\\rm cr}(G)$ (minimum of edge crossings in a drawing of  $G$), but also the  pair crossing number ${\\rm pcr}(G)$, the minimum number of edge pairs crossing in a drawing of  $G$. I double-checked my algorithms and, based on this definition, I clearly apply the pair crossing number  ${\\rm pcr}(G)$\n CRITICAL QUESTION: Can you confirm to me that the edge crossing lemma remains valid on the sphere and the torus also for the pair crossing number  ${\\rm pcr}(G)$?\n Reference: János Pach and Géza Tóth.  Which crossing number is it anyway? J. Combin. Theory Ser. B, 80(2): 225–246, 2000.\n      $\\endgroup$\n  $\\begingroup$  I don&#39;t really know anything about crossing numbers, but I can appreciate how stressful this must be for you. I hope that you are able to patch things up in time!  $\\endgroup$\r–  Carl-Fredrik Nyberg Brodda\n  $\\begingroup$  @PerAlexandersson --- as I understand it two edges may intersect multiple times; this multiplicity is counted in cr but not in pcr, hence pcr $\\leq$ cr.  $\\endgroup$\r–  Carlo Beenakker\n  $\\begingroup$  I suppose that the downvoter never felt any stress while doing his/her Ph.D Thesis...  $\\endgroup$\r–  EFinat-S\n  $\\begingroup$  Frege once had to write &#34;A scientist can hardly meet with anything more undesirable than to have the foundations give way just as the work is finished. I was put in this position by a letter from Mr. Bertrand Russell when the work was nearly through the press. &#34;...  $\\endgroup$\r–  Toffomat\n  $\\begingroup$  Maybe you could accept the answer that is here, and then add your own answer after you successfully defend your dissertation. The vast majority of people who read this question are rooting for you.  $\\endgroup$\r–  John Coleman\n  $\\begingroup$  $\\DeclareMathOperator\\cr{cr}\\DeclareMathOperator\\pcr{pcr}$For the pair crossing number  $\\pcr(G)$, the short answer is  yes the crossing lemma holds for drawings on the sphere, but it is  not known whether it also holds on the torus.\n The best and most current reference for you could be the survey article from Schaefer, updated in February 2020: “The Graph Crossing Number and its Variants: A Survey” from the Electronic Journal of Combinatorics( https://doi.org/10.37236/2713).\n The relevant pages for you are pages 5 and 6 with the following quote from Schaefer:\n “Since the Hanani–Tutte theorem is not known to be true for the torus, this means that we do not currently have a proof of the crossing lemma for  $\\pcr$ or  $\\pcr_−$ on the torus.”\n Generally,  $\\pcr(G)\\leq \\cr(G)$. It is still an open problem whether they are equal or not. The first proofs of the crossing lemma did not make the distinction. The first one to raise the ambiguity was Mohar (1995) in a conference talk.\n The  Pach and Tóth (2000) paper that you mention does make the distinction between  $\\pcr(G)$ and  $\\cr(G)$, and applies Hanani–Tutte in the proof of the crossing lemma, which ensures that it also holds for  $\\pcr(G)$.\n The issue is that you can apply Hanani–Tutte for the sphere (and the projective plane), but you cannot apply it for the torus. For surfaces of genus  $\\geq4$ it is known to be false, see Fulek and Kynčl (2019). This means the torus is really “in-between”.\n  Bojan Mohar (1995): Problem mentioned at the special session on Topological Graph Theory, Mathfest, Burlington, Vermont. (cited from: L.A. Székely (2016):  Turán’s Brick Factory Problem: The Status of the Conjectures of Zarankiewicz and Hill. In: R. Gera et al. (eds.)(2016): Graph Theory—favorite conjectures and open problems. 1.)\n  Radoslav Fulek and Jan Kynčl (2019):  Counterexample to an Extension of the Hanani–Tutte Theorem on the Surface of Genus 4. Combinatorica, 39(6):1267–1279\n    $\\endgroup$\n  $\\begingroup$  The author&#39;s name is Toth by the way, not Thot lol.  $\\endgroup$\r–  Hollis Williams\n  $\\begingroup$  From OP&#39;s point of view this could be viewed as glass half-full rather than glass half-empty. Their dissertation results hold unequivocally on the sphere and  might hold on the torus, though it is an open problem if they do. It is certainly legitimate to study what follows from a given conjecture being true. It could even be spun as a feature rather than a bug of the dissertation.  If the results in fact fail on the torus then you know that the conjecture must be false. Potentially, it could open up a fruitful avenue of attack.  $\\endgroup$\r–  John Coleman\n  $\\begingroup$  I think in algebraic topology literature, Hanani-Tutte is known as a version of the Flores-Van Kampen theorem, if that&#39;s a helpful link  $\\endgroup$\r–  Matt\n  $\\begingroup$  Adding to my comment, here is a 2019 reference &#34;Invariants of graph drawings in the plane&#34; from A. Skopenkov  arxiv.org/pdf/1805.10237.pdf  $\\endgroup$\r–  Matt\n  $\\begingroup$  @ClausDollinger . The clarity is helpful. Thanks for your fast help. Much appreciated. I&#39;m glad I can keep my sphere algorithm. I&#39;m checking whether I can adapt my torus algorithm to ${\\rm cr}(G)$ within the next 5 days  $\\endgroup$\r–  user161819\n    $\\begingroup$  Assuming an unpublished Ramsey-type result by Robertson and Seymour about Kuratowski minors [FK18, Claim 5], which is now &#34;folklore&#34; in the graph-minor community,an asymptotic variant of the crossing lemma,  $\\operatorname{cr}(G)\\ge \\Omega(e^3/n^2)$, is true even for the pair crossing number on a fixed surface, such as a torus.\n With Radoslav Fulek [FK18, Corollary 9] we have shown that [FK18, Claim 5] implies an approximate version of the Hanani–Tutte theorem on orientable surfaces.In particular, [FK18, Claim 5] implies that there is a constant  $g$ such that for every graph  $G$ that can be drawn on the torus with every pair of independent edges crossing an even number of times,  $G$ can be drawn on the orientable surface of genus  $g$ without crossings.This gives an upper bound  $3n + O(g)$ on the number of edges of every such graph  $G$, and this can be used in the probabilistic proof of the crossing lemma, as described on p. 5-6 of Marcus Schaefer&#39;s survey [S20], mentioned in Claus Dollinger&#39;s answer. See also [SSSV96, Theorem 4.1].\n  [FK18]  https://dx.doi.org/10.4230/LIPIcs.SoCG.2018.40,  https://arxiv.org/abs/1803.05085 - R. Fulek and J Kynčl, The  $\\mathbb Z_2$-genus of Kuratowski minors\n [SSSV96]  https://doi.org/10.1007/BF02086611 - F. Shahrokhi, L. A. Székely, O. Sýkora and I. Vrt&#39;o, Drawings of graphs on surfaces with few crossings, Algorithmica 16, 118-131 (1996)\n [S20]  https://doi.org/10.37236/2713 - M. Schaefer, The Graph Crossing Number and its Variants: A Survey, The Electronic Journal of Combinatorics, DS21: Feb 14, 2020.\n    $\\endgroup$\n  $\\begingroup$  Is Schaefer&#39;s survey  Hanani–Tutte and related results ( MSN)?  $\\endgroup$\r–  LSpice\n  $\\begingroup$  I meant the survey about crossing numbers, mentioned in Claus Dollinger&#39;s answer. I will make an edit and add the reference to make it clear.  $\\endgroup$\r–  Jan Kyncl\n  $\\begingroup$  By the way, you know that diacrits like ˇ are allowed in your username if you want, right?  $\\endgroup$\r–  LSpice\n  $\\begingroup$  @JanKyncl Thank you for your help as well, much appreciated. My advisor says the faculty will not accept asymptotics. I&#39;m checking whether I can put ${\\rm cr}(G)$ into my torus algorithm  $\\endgroup$\r–  user161819\n    $\\begingroup$  @user161819 I wanted to make a comment but it got too long, so putting it as an answer. But please take it just as a comment for later, once everything is finished:\n If I understand your comment to my answer correctly, you are aiming to change your algorithm for the torus so it works with  ${\\rm cr}(G)$. I think the whole MO community is keeping their fingers crossed, wishing you that you can successfully complete everything in time!\n Looking at the far horizon, I wanted to make a suggestion to you. Once you have changed your torus algorithm and completed your thesis, you will have effectively two algorithms in your hands for the torus: The old one based on  ${\\rm pcr}(G)$ and the new one based on  ${\\rm cr}(G)$. I am saying the obvious here,  keep both of them, they can really be fruitful for future research.\n (1) Obviously, your two algorithms could support research on the big open question whether  ${\\rm pcr}(G)\\stackrel{\\rm ?}{=}{\\rm cr}(G)$ or not. Theycould produce experimental evidence, ideas, and insights for afuture proof of equality, or an actual counterexample. (Again, I amsaying the obvious here.)\n (2) To really pressure-test  ${\\rm pcr}(G)\\stackrel{\\rm ?}{=}{\\rm cr}(G)$ on the torus, it would be interesting to also try thebest known to date lower bound for  ${\\rm cr}(G)$ $$\\frac{1}{29}\\frac{e^3}{n^2}$$ for graphs with  $e&gt;7n$. This lower bound is fromEyal Ackerman (2019): &#34;On topological graphs with at most fourcrossings per edge&#34;, Computational Geometry, 85: 101574, 31,doi:10.1016/j.comgeo.2019.101574 (probably you are aware of it fromthe Wikipedia article that you quoted).\n I think your question and this whole topic are really important. László Székely calls it one of the &#34;foundational problems&#34; and devotes a whole section to it in his article  Turán’s Brick Factory Problem: The Status of the Conjectures of Zarankiewicz and Hill. In: R. Gera et al. (eds.)(2016): Graph Theory—favorite conjectures and open problems. 1.)\n    $\\endgroup$\n  $\\begingroup$  Thanks for your comment!! Much appreciated. And thanks again for your help. I&#39;m very interested in this Ackermann bound, will take a look at it  $\\endgroup$\r–  user161819\n  $\\begingroup$  One good thing, my prototype for updated torus algorithm: tested on on first 2 graphs from my test set, and went ok  $\\endgroup$\r–  user161819\n  $\\begingroup$  The term &#34;Ackermann bound&#34; generally refers to a bound of a type far, far worse than the one given here:  en.wikipedia.org/wiki/Ackermann_function  $\\endgroup$\r–  Terry Tao\n  $\\begingroup$  @TerryTao Terry you are very right. Huge difference between the Wilhelm Ackermann bound that you mention and the Eyal Ackerman bound I am quoting here! Good to make the distinction.  $\\endgroup$\r–  Claus Dollinger\n    By clicking “Post Your Answer”, you agree to our  terms of service,  privacy policy and  cookie policy\n  Not the answer you&#39;re looking for? Browse other questions tagged           or  ask your own question.", "posttime": "2020-08-04 22:06:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "论文,溢出,overflow", "title": "数学溢出用户解决博士论文危机", "title_en": "Math Overflow users resolve PhD thesis crisis", "transed": 1, "url": "https://mathoverflow.net/questions/366765/issue-update-in-graph-theory-different-definitions-of-edge-crossing-numbers", "via": "", "real_tags": ["论文", "溢出", "overflow"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1016152, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我最近偶然看到玛丽·K·盖拉德(Mary K.Gaillard)最近的一次采访，这鼓励我再次查看AIP的口述历史网站。有关她的自传体书籍的评论，请参见此处。\n你认为理论物理学的未来是什么？田野的方向是什么？\n嗯，我认为它本身就在走向疯狂[笑]。我的意思是，不，如果我们没有实验，人们可以让他们的想象力肆无忌惮，在没有经过验证或反驳的情况下发明任何东西。所以我认为-我的意思是，如果我们想更多地了解更高能量下发生的事情，我们必须拥有更高能量的对撞机。我不认为-嗯，宇宙学与粒子物理有关，这可能是因为-我的意思是，有很多数据来自宇宙学。有一些数据将来自非常低能量的精确物理。但我不认为这个理论本身--它需要通过(笑)实验来保持一致。\n那么，对于全球范围内进入该领域的人们，关于他们应该学习什么类型的东西，以及他们应该研究这些东西的方式，你有什么建议呢？\n这是个[笑]--事实上，我经常建议人们去研究天体粒子物理学，因为我认为它更有希望获得数据，因为我没有-我的意思是，我坚信没有好的数据你就不能前进，除非-嗯，当然，如果他们真的有另一代对撞机，那就太好了。我只是不知道这是否会发生…。\n我发现最近另一次有趣的采访是维普尔·佩里瓦尔(Vipul Periwal)。Periwal在我离开的时候来到普林斯顿大学攻读博士学位，他的职业生涯恰好是在1984年末弦理论出现的时候开始的。他作为弦理论家工作了好几年，最终在普林斯顿大学获得了终身教职，但后来完全离开了HEP领域，开始了新的生物学职业生涯。以下是他接受采访的一些摘录：\n大卫(格罗斯)在这一点上的研究是什么？他在追求什么？\n弦理论。他对弦理论只有百分之百的了解。对吗？他们只是做杂交弦，所以每个人都做了-，当时普林斯顿的所有研讨会都是弦理论。这都是弦理论。科特在努力，大卫也在努力。爱德华正在做这件事。拉里·亚菲可能是唯一一个人--不，有两个人，拉里·亚菲和伊恩·阿弗莱克没有研究弦理论。不是说他们不能，而是他们就是不愿意这么做。\n那么，你的意思是，尽管在这一点上所有关于弦理论的工作，仍然有关于什么是弦理论的存在主义问题，有待回答？\n从来没有人弄清楚什么是弦理论。我的意思是，如果你去问所有著名的弦理论家，他们都不能为你回答这个简单的问题。你能给我展示一个一致的弦理论吗，在这个理论中超对称性被破坏了？\n这对你的研究有好处吗？对你(他在IAS的博士后)来说，这段时间愉快吗？\n我不认为我做了特别有趣的研究。我做了-我的意思是，我做得不错，但我并不特别为我在那里做的任何事情感到自豪，除了我写的一篇小论文，其中[笑]-看，这被称为反向部分-是我展示的-人们对大N极限非常兴奋，所以我拿了这个玩具模型，我展示了在大N极限下，它实际上产生了一些非解析的东西，比如，你不能在任何顺序的1/a展开中，看到答案是什么，在N等于无穷大的时候。因此，换句话说，这对我来说是一个警示故事。比如，你认为你做的是大N，然后得到了有限N的直觉。但是这是一个非常简单的模型，你可以精确地进行计算，你可以把所有的1/N展开到你想做的程度，它永远不会告诉你，当N等于无穷大时会发生什么(大笑)。但是你知道，在这一点上，弦理论在当时已经是一种社会学的东西了。\n所以，这是我逐渐认识到的，没有实验证据。比如，你是个好物理学家还是坏物理学家？谁会告诉你呢？怎么又知道了？对吗？\n我的意思是，我会去某个地方做演讲，这一点我记得很清楚。我去纽约州立大学石溪分校做了一次演讲，我想现在叫它石溪大学。演讲结束时，我正在和一位邀请我的教职员工交谈。他说，“那么，XYZ对这项工作有什么看法？”我只是大吃一惊。我想，等等，你是个物理学家。我是个物理学家。为什么我们需要知道XYZ对此的看法？\n我明白了。它更多的是关于某一组同龄人对这一理论的看法。\n是啊，这真的让我心烦意乱。就我而言，弦微扰理论发散之后，我对做微扰计算不感兴趣。所以，人们所做的解决方案是：好的，我们将研究各种超对称理论，在没有更大贡献的情况下，在假设存在超对称的情况下，你可以用全纯来从超对称的事实的结构中推断出东西。这真的让我很困扰，就像在“好吧”里，这里有一个非常漂亮的结构，有很多非常漂亮的数学结果出来了--由这些相关性得出的数学结果。但我就是不明白--作为一名物理学家，我不想担心，“XYZ对我正在做的事情有什么想法？”\n是啊，因为你在追求一个真理，它要么是真的，要么不是。其他人怎么想并不重要。\n正确的。我真的不在乎。我的意思是，不管我有多尊重爱德华、大卫或其他人，我真的不需要知道他们对我的作品有什么看法。对吗？我只是-不管怎么说-。\n这种态度在终身制等方面对你有什么影响？\n是的，所以当我-不，所以我实际上-我是说，当我-嗯，我没有-我在社会学上真的很愚蠢，比如，我没有自我保护的本能。所以，我可以看到，在我面前有一些榜样，告诉我拥有终身教职的人(Term…)是如何。\n…。成功，不仅在普林斯顿获得终身教职，而且在普林斯顿之后的非常好的地方也获得了终身教职。我对这一切毫不在意。所以，当我在普林斯顿的时候，我试着做一些格点规范理论。\n在这种态度下，佩里瓦尔没有在普林斯顿获得终身教职也就不足为奇了。他没有很快得到HEP理论中其他领域的工作邀请，并在2001年决定更好地尝试另一个领域，而不是继续他所从事的领域。采访以以下内容结束：\n好的。所以，真的，最后一个问题。对你来说，重大突破时刻是什么样子？你如何将这一切放在一起来概念化？这一重大突破看起来是什么样子的？\n如果我能做出一个临床上可以检验的预测，那会让我非常高兴。\n你认为你能到那里吗？这是激励你的东西。\n嗯。我想-你知道，我说过一次。有一次，我作为助理教授在普林斯顿管理物理研讨会时，我们有一个来访的人。所以，这个人问我，“那么，维普尔，你在做什么？”当时我对做出预测感到非常胆怯。所以，我说，“好吧，格点规范理论，”你知道，普林斯顿没有人做过格点规范理论。你们都应该学弦理论的。我说，“是的，我想在死前得到一个号码。”[笑]人们看我的眼神就像，“这是什么疯子？”但是你知道，一个数字。那就太好了。\n翻阅过去的采访，我发现了一个非常个人感兴趣的人，那就是杰拉尔德·皮尔森(Gerald Pearson)，他曾与我的祖父盖伦·福特(Gaylon Ford)一起在贝尔实验室工作。他的一些故事提到了20世纪30年代与我祖父(他的主要专长是真空管的设计和建造)在贝尔实验室的工作。在此期间，两人都就读于哥伦比亚大学，我的祖父在那里获得了物理学硕士学位。\n盖隆·福特曾与约翰逊共事。当凯利担任管道部部长时，他在那个地区工作。然后他们进行了一次大调整，之后这份工作就再也找不到了。他很不情愿地来和我们一起工作。\n1938年，你从约翰逊的团队转到了贝克尔的团队。事实上，你和西尔斯似乎已经互换了位置。\n在那之前，我记得有一天约翰逊把我叫到他的办公室，他想知道我是否愿意在…上工作。巴克利寄来了一份备忘录，要求温度调节器安装埋设在地下的电缆。约翰逊想知道我是否愿意在这个领域工作。当然，没有人喜欢换工作，但我说，“好的”，我们同意我会花一部分时间在这个问题上，这就是热敏电阻的由来。这种情况还在继续，而且非常成功。然后决定这项工作更适合贝克的领域，而不是约翰逊的领域。而且，你问我福特的情况。他就是那个从管子店被叫来做这件事的人。后来他又开始做其他的事情。\n让我们看看我们能不能确定那个时间。福特还没和你合作呢。福特在1934年和你们在一起。但这一举动直到38年才发生。\n是的，我就是这个意思。他首先来研究电阻随温度的变化。他在研究一种硫化物化合物。然后，让我们看看，他发生了什么事。他去了其他地方，约翰逊把我叫进他的办公室，问我是否愿意继续福特的工作，我们同意我应该做兼职，仍然从事噪音方面的工作。但我说我不想和硫磺打交道，它闻起来太难闻了。我说如果我在那个地区工作，我会用一些其他的材料。所以我对此进行了研究。我先是研究硼，然后研究氧化物的组合。我的很多专利都在这样的材料和设备上。这些设备今天仍在埋地电缆系统中用作音量调节器。", "note_en": "I recently ran across  a recent interview with Mary K. Gaillard, which encouraged me to look again at the  AIP’s oral histories site. For a review of her autobiographical book, see  here.\n  What do you see as the future of theoretical physics? Where is the field headed?\n  Well, I think it’s headed towards insanity [laugh] by itself. I mean, no, if we don’t have experiments, people can let their imaginations run wild, and invent anything without it being verified or disproven. So I think it—I mean, if we want to understand more about what happens at higher energies, we have to have higher energy colliders. I don’t think—well, cosmology is tied to particle physics, and that’s probably something from—I mean, there is a lot of data coming from cosmology. And there is some data that will be coming from very low energy precision physics. But I don’t think that theory by itself—it needs to be kept in line by [laugh] experiments.\n   And so what advice do you have sort of globally for people entering the field in terms of the kinds of things they should study, and the way they should study those things?\n  That’s a [laugh]—actually, I often advise people to go into astro-particle physics just because I think that it has more promise of getting data because I don’t—I mean, I strongly believe you can’t go forward without good data, and unless—well, of course, if they do have another generation of colliders, that would be great. I just don’t know if that’s going to happen…\n Another very recent interview I found interesting was  that of Vipul Periwal. Periwal arrived as a Ph.D. student at Princeton around the time I was on my way out, starting his career right about when string theory hit in late 1984. He worked as a string theorist for quite a few years, ending up in a tenure-track faculty position at Princeton, but then left the HEP field completely, starting a new career in biology. Here are some extracts from his interview:\n And what was David [Gross]’s research at this point? What was he pursuing?\n  String theory. He was just 100 percent in string theory. Right? They just did the heterotic string, and so everyone was — every seminar at Princeton at that time was all string theory. It was all string theory. Curt was working on it, David was working on it. Edward was working on it. Larry Yaffe was probably the only person — no, two people, Larry Yaffe and Ian Affleck were not doing string theory. Not that they couldn’t, but they just would not do it.\n   So you mean, despite at this point all of the work on string theory, there were still existential questions about what string theory was, that remained to be answered?\n      No one has ever figured out what is string theory. I mean, if you go ask all the eminent string theorists, none of them can answer for you this one simple question. Can you show me a consistent string theory, where supersymmetry is broken?\n   Was it good for your research? Was it a good time for you [ his postdoc at the IAS]?\n  I don’t think I did particularly interesting research. I did — I mean, I did okay, but I’m not particularly proud of anything I did there, except for one little paper I wrote, in which [laughs] — see, this is called the contrarian part — is I showed — people were very excited about the large N limit, so I took this toy model, and I showed that in the large N limit, it actually produced something nonanalytic, as in like, you could not, in any order of 1 over an expansions, ever see what the answer was that was exact at N equals infinity. So, in other words, it was to me a cautionary tale. Like, you think you’re doing large N and then getting an intuition for finite N. But here’s this very simple model where you can do the calculation exactly, and you can do all your 1 over N expansion as far as you want, and it’ll never tell you [laughs] about what’s going to happen at N equals infinity. But you know, it’s a — at this point, string theory was already at that time pretty much a sociological thing.\n    So, it’s something that was borne home to me gradually, that there’s no experimental proof. Like, are you a good physicist or a bad physicist? Who’s going to tell? How do you know? Right?\n    I mean, I’d go and give a talk somewhere, and I remember this very clearly. I went and gave a talk at SUNY Stony Brook, what’s now called, I guess, Stony Brook University. And at the end of the talk, I was talking to one of the faculty there who’d invited me. And he said, “So, what does XYZ think of this work?” And I was just taken aback. I was like, wait, you’re a physicist. I’m a physicist. Why do we need to know what XYZ thinks of this?\n      I see. It’s as much about what a certain group of peers thinks about the theory.\n  Yeah, and this really perturbed me. As far as I was concerned, after the string perturbation theory diverges thing, I was not interested in doing perturbative calculations. So, what the solution was that people did was: okay, we’ll work on various supersymmetric theories where there is no higher contribution, and under the assumption that there is supersymmetry, you can use holomorphicity to deduce things from the structure of the fact that there’s so much supersymmetry. And this really bothered me, as in okay, there’s this really amazingly beautiful structure, and lots of very pretty mathematical results that are coming out — mathematical results that are suggested by these correlations. But I just don’t get — as a physicist, I don’t to want to have to worry about, “What does XYZ think about what I’m doing?”\n  Yeah, because you’re pursuing a truth, and it’s either true or it’s not. It doesn’t really matter what other people think about it.\n  Right. I really don’t care. I mean, no matter how much I respect — and I do — Edward, or David, or whoever, I really don’t need to know what they think about my work. Right? I just — anyhow —\n      How does that attitude affect you in terms of tenure considerations and things like that?\n  Yeah, so when I was — no, so I actually — I mean, when I was — well, I have no — I’m really stupid sociologically, as in, I have no instinct for self-preservation. So, I could see I had role models in front of me of how people with tenure…\n    …succeed, not just getting tenure at Princeton, but getting tenure at very good places after Princeton, too. And I paid zero attention to all this. So, while I was at Princeton, I tried doing some lattice gauge theory.\n With this attitude, it’s not surprising that in Periwal didn’t get tenure at Princeton. He didn’t soon get job offers elsewhere in HEP theory, and decided in 2001 better to try another field than keep going in the one he was in. The interview ends with:\n Alright. So, really, the last question. What does the big breakthrough moment look like for you? How would you conceptualize this in terms of putting all of this together? What does that big breakthrough look like?\n  If I could make a prediction that was clinically testable, that would make me very happy.\n  Do you think you’ll get there? It’s the thing that motivates you.\n  Yeah. I want — you know, I said this once. We had someone visiting when I was managing the physics seminar at Princeton once, as an assistant professor. So, this guy asked me, “So, Vipul, what are you working on?” And I was very jaundiced at that time about making a prediction. So, I said, “Well, lattice gauge theory,” which, you know, nobody at Princeton did lattice gauge theory. You were all supposed to be doing string theory. I said, “Yeah, I want a number before I die.” [laughs] People are looking at me like, “What kind of lunatic is this?” But you know, a number. That would be nice.\n Looking through the old interviews, I found one of very personal interest, that of  Gerald Pearson, who worked with my grandfather Gaylon Ford at Bell Labs. Some of his stories mentioned work with my grandfather (whose main expertise was in the design and construction of vacuum tubes) at Bell Labs during the 1930s. During this period both studied at Columbia, where my grandfather got a master’s degree in physics.\n Gaylon Ford worked with Johnson. When Kelly was head of the tube department, he worked in that area. And then they had a big shakeup after which the job was no longer available. Much against his desires, he came over to work with us.\n   In 1938 you were moved over from Johnson’s group into Becker’s. In fact, you and Sears seem to have changed places.\n  Before that took place, I remember Johnson called me into his office one day and he wanted to know if I would like to work on… well, Buckley had sent a memorandum asking for temperature regulators for buried cable. Johnson wanted to know if I would like to work in this area. Of course, no one likes to change their jobs but I said, “Fine” and we agreed that I would spend a portion of my time on this problem and that’s where thermistors came from. This continued on and it was very successful. Then it was decided that the work fit in better with Becker’s area than it did with Johnson’s. And, well you asked me about Ford. He was the one who was brought from the tube shop to work on this. And then he later went to work on something else.\n  Let’s see if we can date that time. Ford wasn’t working with you yet. Ford is here with you in 1934. But this move didn’t take place until ’38.\n  Yes, that’s what I was saying. He first came over to work on change of resistance with temperature. And he was working with a sulfide compound. And then, let’s see, what happened to him. He went someplace else and Johnson called me into his office and asked me if I would like to carry on Ford’s work and we agreed that I should do it part time and still work on noise. But I said I didn’t want to work with sulphur, it smelled too bad. I said if I work in that area, I’m going to use some other materials. So I made a study of that. First I worked on boron and then on a combination of oxides. A lot of my patents are on such materials and devices. These devices are still used today in the buried cable system as volume regulators.", "posttime": "2020-08-04 22:00:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "口述,oral,理论", "title": "口述历史", "title_en": "Oral Histories", "transed": 1, "url": "https://www.math.columbia.edu/~woit/wordpress/?p=11762", "via": "", "real_tags": ["口述", "oral", "理论"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1016150, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "-这是一个旋转矩阵，我回答。右手，z向前穿过鼻子，x穿过左耳。我们刚毕业的年轻同事点点头。\n-哦，不！你打开维基百科了吗？你不是吗？我从办公桌上绝望地回答。\n偶尔会有刚毕业的工程师(或暑期实习生)问我这个问题。几乎总是在屏幕上打开维基百科页面，我认为这很可怕(或者更糟糕的是，一些“学习OpenGL”教程)。\n我偷偷地坐在那个人旁边的椅子上。这需要几分钟的时间，我们要做一些比学习更难的事情：我们要忘却学习。\n有趣的是，我没有得到任何问题，或者只是很短的问题，关于欧拉天使，罗德里格斯旋转，实际上只有一个关于四元数的反复出现的问题。但我经常会被问到关于旋转矩阵的问题。我认为这有点奇怪，因为与许多其他旋转表示法相比，旋转矩阵非常简单。我认为一个很大的原因是维基百科的页面。它看起来像这样：\n\\[r_x(\\theta)=\\Begin{bMatrix}1&amp；0&amp；0\\\\0&amp；\\cos\\theta&amp；-\\sin\\theta\\\\0&amp；\\sin\\theta&amp；\\cos\\theta\\end{bMatrix}\\]\\[R_y(\\theta)=\\Begin{bMatrix}\\cos\\theta&amp；0&amp；\\sin\\theta\\\\。\\cos\\theta\\end{bMatrix}\\]\\[R_z(\\theta)=\\Begin{bMatrix}\\cos\\theta&amp；-\\sin\\theta&amp；0\\sin\\theta&amp；\\cos\\theta&amp；0\\\\0&amp；0&amp；1\\end{bMatrix}\\]\\[R=\\Begin{bMatrix}\\cos\\alpha\\cos\\beta&amp；\\cos\\alpha\\sin\\beta\\cos\\Gamma+\\sin\\alpha\\sin\\\\sin\\alpha\\cos\\beta&amp；\\sin\\alpha\\sin\\beta\\sin\\Gamma+\\cos\\alpha\\cos\\Gamma&amp；\\sin\\alpha\\sin\\beta\\cos\\Gamma-\\cos\\alpha\\sin\\sin\\beta&amp；\\cos\\beta\\sin\\Gamma&amp；\\cos\\beta\\cos\\Gamma\\\\。\n它谈到了旋转。绕不同轴旋转及其与欧拉角的关系。例如，在处理头部姿势时，这可能会有点令人困惑。当然，您可以考虑旋转矩阵，就好像头部围绕不同的轴以不同的顺序旋转，但这变得有点难以解释：\n\\[\\BEGIN{bMatrix}-0.9987820&amp；0.0348782&amp；-0.0348995\\\\0.0283128&amp；0.9844193&amp；0.1735424\\\\0.0404086&amp；0.1723429&amp；-0.9842078\\end{bMatrix}\\]\n然后我们得到一个“本征旋转，它的塔特-布莱恩角是α，β，γ，绕z，y，x轴”，在我们的脑海中可视化。\n这是可悲的，因为我认为旋转矩阵是最容易解释的表示之一。\n不要把它们看作旋转，而要把它们看作是一个新坐标系的单位矢量。\n我们描述坐标系相对于另一个坐标系的位置(我们从哪里旋转)，例如从相机的坐标系角度(z向前，y向上)。旋转矩阵的第一列是用旧坐标系表示的新x轴，第二列是y轴，依此类推。单位矩阵不会旋转，因为所有单位向量都与前一个坐标系相同。\n\\[r=\\Begin{bMatrix}X_x&amp；Y_x&amp；Z_x\\\\X_y&amp；Y_y&amp；Z_y\\\\X_z&amp；Y_z&amp；Z_z\\end{bMatrix}\\]。\n让我们回到以相机坐标系表示头部的示例，并假设头部位置在相机的前面。因此，通过解释前面的矩阵，我们可以查看新的z轴：\n我们很快就可以看到，z轴的z部分几乎是-1。这意味着鼻子指向与相机相反的方向，例如。如果有人坐在摄像机前面，请将镜头对准摄像机。\n我们还可以看到人的头部稍微向上旋转(z轴的正y分量)，并且稍微指向摄像机右侧(负x分量)。\n就这样！旋转矩阵只是描述新坐标系的单位矢量。", "note_en": "– It is a rotation matrix, I answer. Right handed, z forward through the nose and x through the left ear. Our young newly graduated colleague nods his/her head.\n   – Oh no! You have opened Wikipedia? Haven’t you? I answer in despair from my desk.\n It happens time to time that a newly graduated engineer (or summer intern) asks me exactly this question. Almost always with the Wikipedia page open at the screen, which I think is horrible (or even worse, some “Learn OpenGL” tutorial).\n I  steal take a chair to sit down beside the person. This will take a few minutes, we are going to do something that is harder than learning: we are going to unlearn.\n It is interesting, I get no questions, or only very short questions, on Euler angels, Rodriguez rotations and actually only one recurrent question on quaternions. But very often I get questions on rotation matrices. I think it is a bit odd since rotation matrices are very simple in comparison to many other rotation representations. I think a big reason for this is the Wikipedia page. It looks something like this:\n \\[R_x(\\theta) =\\begin{bmatrix}1 &amp; 0 &amp; 0 \\\\0 &amp; \\cos \\theta &amp; -\\sin \\theta \\\\0 &amp; \\sin \\theta &amp; \\cos \\theta\\end{bmatrix}\\]\\[R_y(\\theta) =\\begin{bmatrix}\\cos \\theta &amp; 0 &amp; \\sin \\theta \\\\0 &amp; 1 &amp; 0 \\\\-\\sin \\theta &amp; 0 &amp; \\cos \\theta\\end{bmatrix}\\]\\[R_z(\\theta) =\\begin{bmatrix}\\cos \\theta &amp; -\\sin \\theta &amp; 0 \\\\\\sin \\theta &amp; \\cos \\theta &amp; 0\\\\0 &amp; 0 &amp; 1\\\\\\end{bmatrix}\\]\\[R =\\begin{bmatrix}\\cos\\alpha\\cos\\beta &amp; \\cos\\alpha\\sin\\beta\\sin\\gamma - \\sin\\alpha\\cos\\gamma &amp; \\cos\\alpha\\sin\\beta\\cos\\gamma + \\sin\\alpha\\sin\\gamma \\\\\\sin\\alpha\\cos\\beta &amp; \\sin\\alpha\\sin\\beta\\sin\\gamma + \\cos\\alpha\\cos\\gamma &amp; \\sin\\alpha\\sin\\beta\\cos\\gamma - \\cos\\alpha\\sin\\gamma \\\\-\\sin\\beta &amp; \\cos\\beta\\sin\\gamma &amp; \\cos\\beta\\cos\\gamma \\\\\\end{bmatrix}\\]\n It talks about rotations. Rotation around different axes and their relation to Euler angles. This can be a bit confusing when working with for example a head pose. You can of course think about rotation matrices as if the head rotates around different axes in different order, but it becomes kind of hard to interpret:\n \\[\\begin{bmatrix} -0.9987820 &amp; 0.0348782 &amp; -0.0348995 \\\\ 0.0283128 &amp; 0.9844193 &amp; 0.1735424 \\\\ 0.0404086 &amp; 0.1723429 &amp; -0.9842078\\end{bmatrix}\\]\n   and then we get an  “intrinsic rotation whose Tait–Bryan angles are α, β, γ, about axes z, y, x” to visualize in our head.\n Its sad because I think rotation matrices are one of the easiest representation to interpret.\n Don’t think of them as rotations, think of them as a unit vectors of a new coordinate systems.\n  We describe where the coordinate system is located related to another coordinate system (where we rotate from), for example from the camera’s coordinate system perspective (z forward, y upwards). The first column of the rotation matrix is the new x-axis expressed in the old coordinate system, the second column is the y-axis and so on. An identity matrix would yield in no rotation since all unit vectors would be the same as the previous coordinate system.\n \\[R =\\begin{bmatrix} X_x &amp; Y_x &amp; Z_x \\\\ X_y &amp; Y_y &amp; Z_y \\\\ X_z &amp; Y_z &amp; Z_z\\end{bmatrix}\\]\n  Lets go back to the example with the head expressed in the camera coordinate system and assume the head position is atfront of the camera. So by interpret the previous matrix, we can look at the new z-axis:\n   We can quickly see that z-part of the z-axis is almost -1. This means the nose is pointing at the opposite direction as the camera, eg. towards the camera if the person is sitting at front of it.\n We can also se that the persons head is rotated a little bit up (positive y component of the z-axis) and is pointing a little bit to the right of the camera right (negative x component).\n And that’s it! Rotation matrices just describe the unit vectors of a new coordinate system.", "posttime": "2020-08-04 21:59:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "旋转,rotation", "title": "将旋转矩阵取消学习为旋转", "title_en": "Unlearn Rotation Matrices as Rotations", "transed": 1, "url": "https://kodkodgames.gitlab.io/rotation_matrices/", "via": "", "real_tags": ["旋转", "rotation"]}, {"category": "", "categoryclass": "", "imagename": "448ccfbb73efdc7a400a2672d7ce0c28.jpg", "infoid": 1016149, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Yotpo提供了一套工具来帮助直接面向消费者和其他电商与客户建立更好的关系，该公司今天宣布，它已经筹集了7500万美元的资金，这笔资金将用于继续发展其产品套件，以及获得更多客户和建立更多整合合作伙伴关系。\nE系列包括Yotpo的一些现有投资者，即Bessemer Venture Partners、Access Industries(华纳音乐集团(Warner Music Group)的所有者，以及其他一些控股公司)和Vertex Ventures(淡马锡的子公司)，新投资者Hanaco(专注于以色列初创企业-Yotpo的联合总部设在特拉维夫和纽约)，以及其他未具名的投资者。\n这使得这家初创公司筹集的资金总额达到1.76亿美元，虽然没有披露估值，但其首席执行官托默·塔格林(Tomer Tagrin)-他与首席运营官欧姆里·科恩(Omri Cohen)共同创立了该公司-将其描述为“几乎是一只独角兽”。\n他在一次采访中说，“我喜欢把我们正在建造的火烈鸟称为火烈鸟，这也是一种稀有而美丽的动物，但也是一种真实的东西，我们是一家合适的企业。”他补充说，Yotpo的目标是明年的营业收入达到1亿美元。\n该公司最初是Shopify的App Store中的一款应用程序，通过用户生成的内容向Shopify客户提供工具，帮助客户参与，虽然它已经超过了这种单一的关系-它现在还有大约500个额外的战略合作伙伴，包括Salesforce、Adobe、BigCommerce和其他公司-Yotpo的首席执行官仍然喜欢用Shopify式的术语来描述他的公司。\n“就像Shopify管理您的业务一样，我们管理您的客户，”Tagrin说。他说，虽然看到围绕营销云进行整合的更大趋势是很棒的，但这不是一个万能的问题。他认为，Yotpo针对电子商务的方法与众不同，因为它解决了D2C和其他电子商务公司特有的问题。\nYotpo今天的服务包括短信和视觉营销、忠诚度和推荐服务，以及评论和评级，这些服务被一系列电商公司使用，从Third Love和Away这样更新的直接面向消费者的品牌，到更成熟的品牌，比如巴塔哥尼亚和1800Flowers。其中一些是内部建造的，一些是通过收购的方式建造的-最近的一次是在1月份，SMSBump。该计划还将利用部分资金继续实施这一收购战略。\nBVP合伙人亚当·费舍尔在一份声明中表示：“自从我们三年多前进行第一笔投资以来，Tomer和Omri一直执行得天衣无缝，扩大了产品系列，服务了更广泛的客户，并在整个组织内不断招聘强大的人才。”Yotpo特别专注于帮助直接面向消费者的电子商务品牌解决吸引消费者和增加收入的双重挑战，凭借其多产品战略和创新优势，它们处于独特的地位，可以在未来几年主导电子商务行业。“\nYotpo是一个免费增值平台，约有9000名客户为服务付费，另有28万名客户在其免费使用级别上。Tagrin说，去年客户数量增长了250%。\n新冠肺炎疫情对互联网使用，特别是电子商务产生了有据可查的影响，因为人们在遵守就地避难所订单的同时转向数字渠道采购物品，或者试图增加社会距离，以减缓冠状病毒的传播。\n根据数字营销机构Common Thread Collective的研究，电子商务多年来一直在增长，但自2月份以来，这一趋势的加速速度一直很快，过去几个月的收入和支出都经常超过基线数字。\n这反过来又对帮助这些电子商务企业以更直接和更有人情味的方式运营的公司产生了重大影响。Yotpo是直接受益者：该公司表示，新客户的签约激增，其中许多人接受付费服务，同比增长170%，客户流失率较低。\n当然，更大的前景并不是完全乐观的，整个技术服务部门都有数千人裁员，大量实体企业倒闭。这些经济指标最终也可能产生连锁反应，不仅是更多的企业转移到网上，而且还会导致整体支出放缓。\n这也将不可避免地对Yotpo这样的初创企业产生影响，Yotpo目前肯定在上升，但将继续考虑更长期的影响，以及如何继续使产品多样化，以满足更广泛的客户使用案例。\n例如，今天，该公司通过与Zendesk等公司整合来解决客户服务需求，但从长远来看，它可能会考虑如何引入这样的服务，以继续建立D2C品牌与客户之间的接触点，特别是通过Yotpo平台上描述的客户的更大图景来运行这些服务。\n在我们的会议和辩论中，这是我们产品的一大部分，“Tagrin在谈到产品扩展时说。\n他表示：“我确实认为，对增长和融资的任何庆祝，对我来说都是另一回事：我们需要更多地内化正在发生的事情。”“世界还没有恢复正常，我们不应该表现得像这样。”", "note_en": "Yotpo, which provides a suite of tool to help direct-to-comsumer and other e-commerce players build better relationships with customers, is today announcing that it has raised $75 million in funding, money it will use to continue growing its suite of products, as well as to acquire more customers and build out more integration partnerships.\n The Series E included a number of  Yotpo’s   existing investors, namely Bessemer Venture Partners, Access industries (the owner of Warner Music Group, among a number of other holdings) and Vertex Ventures (a subsidiary of Temasek), new investor Hanaco (which focuses on Israeli startups — Yotpo is co-headquartered in Tel Aviv and New York), and other unnamed investors.\n  It brings the total raised by the startup to $176 million, and while it’s not disclosing valuation, its CEO Tomer Tagrin — who co-founded the company with COO Omri Cohen — describes it as “nearly a unicorn.”\n “I like to call what we’re building a flamingo, which is also a rare and beautiful animal but also a real thing, and we are a proper business,” he said in an interview, adding that Yotpo is on target for ARR next year to be $100 million.\n The company had its start as an app in  Shopify’s App Store, providing tools to Shopify customers to help with customer engagement by way of user-generated content, and while it has outgrown that single relationship — it now has some 500 additional strategic partners, including Salesforce, Adobe, BigCommerce and others — Yotpo’s CEO still likes to describe his company in Shopify-ish terms.\n “Just as Shopify manages your business, we manage your customers end to end,” Tagrin said. He said that while it’s great to see the bigger trend of consolidation around marketing clouds, it’s not a one-size-fits-all problem. He believes Yotpo’s e-commerce-specific approach to that stands apart from the pack because it addresses issues unique to D2C and other e-commerce companies.\n Yotpo’s services today include SMS and visual marketing, loyalty and referral services, and reviews and ratings, which are used by a range of e-commerce companies, spanning from newer direct-to-consumer brands like Third Love and Away, to more established names like Patagonia and 1800flowers. Some of these have been built in-house, and some by way of acquisition — most recently,  SMSBump, in January. The plan is to use some of the funding also to continue that acquisition strategy.\n “Since our first investment more than three years ago, Tomer and Omri have executed flawlessly, expanding the product suite, serving a wider range of customers, and continually hiring strong talent across the organization,” says Adam Fisher, a Partner at BVP, in a statement. “Yotpo is singularly focused on helping direct-to-consumer eCommerce brands solve the dual challenge of engaging consumers and increasing revenue, and with their multi-product strategy and innovative edge, they are uniquely positioned to dominate the eCommerce industry for years to come.”\n Yotpo is built as a freemium platform, with some 9,000 customers paying for services, and a further 280,000 customers on its free usage tier. Customer count grew by 250% in the last year, Tagrin said.\n The COVID-19 pandemic has had a well-documented impact on internet use, and specifically e-commerce, as people turned to digital channels in record numbers to procure things while complying with shelter-in-place orders, or trying to increase social distancing to slow down the spread of the coronavirus.\n E-commerce has been on the rise for years, but the acceleration of that trend has been drastic since February, with revenue and spend both  regularly exceeding baseline figures over the last several months, according to research from digital marketing agency Common Thread Collective.\n That, in turn, had a big impact on companies that help enable those e-commerce enterprises operate in more direct and personable ways. Yotpo was a direct beneficiary: it said it had a surge of sign-ups of new customers, many taking paid services, working out to a 170% year-on-year ARR and lower customer churn.\n The bigger picture, of course, is not completely rosy, with thousands of layoffs across the whole tech service, and a huge number of brick-and-mortar business closures. Those economic indicators could ultimately also have a knock-on effect not just in more business moving online, but also a slowdown in spending overall.\n That will inevitably have an impact on startups like Yotpo, too, which is definitely on a rise now but will continue to think longer term about the impact and how it can continue to diversify its products to meet a wider set of customer use cases.\n For example, today, the company addresses customer care needs by way of integrations with companies like Zendesk, but longer term it might consider how it can bring in services like this to continue to build out the touchpoints between D2C brands and their customers, and specifically running those through a bigger picture of the customer as profiled on Yotpo’s platform.\n This is a big part of our product in our meetings and debates,” Tagrin said about product expansions.\n “I do think any celebration of growth and funding comes to me with something else: we need to be internalising more what is going on,” he said. “The world is not back to normal and we shouldn’t act like it is.”", "posttime": "2020-08-04 21:23:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "电子商务,marketing,客户", "title": "\nYotpo为其电子商务营销云筹集7500万美元", "title_en": "\n\t\t\t\tYotpo raises $75M for its e-commerce marketing cloud\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/04/yotpo-raises-75m-for-its-e-commerce-marketing-cloud/", "via": "", "real_tags": ["电子商务", "marketing", "客户"]}, {"category": "", "categoryclass": "", "imagename": "0e0c3229f5287a5f2a86a9a757a74b99.jpg", "infoid": 1016148, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "早在2019年10月之前，微软就宣布将把为Xbox设计的图章批准扩展到一系列移动配件。这一举动相当明显：该公司正试图通过其自己的Project XCloud流媒体服务的后门方式，认真对待智能手机游戏。\n由于今年夏天没有大型的面对面游戏会议，微软今天上午以博客的方式宣布了该系列的一些新功能。该系列将获得五款获得批准的设备，这些设备的名字应该会被证明是任何对游戏配件感兴趣的人都熟悉的。在9月15日Xbox游戏通行证终极版发布之前，所有这些都将在今天接受预订。\n不出所料，大多数附带的配件都是控制器。除了延迟，此类技术的最大障碍是控制。毕竟，我们谈论的是在触摸屏手机上玩游戏机游戏。如果没有足够的配件，绝大多数的游戏都不会在这里飞起来。\n值得庆幸的是，Razer、PowerA和8bitdo都有专为XCloud流媒体设计的即将推出的控制器。可扩展的Razer Kishi和PowerA Moga XP7-X Plus蓝牙控制器的售价均为100美元，而智能迷你8bitdo的售价为50美元。PowerA和8bitdo还提供用于无线Xbox控制器的智能手机夹，售价15美元。\n同样获得Xbox赞许的还有SteelSeries售价100美元的Arctis 1。这款耳机是专门为在游戏机游戏和移动设备之间来回切换而设计的。", "note_en": "Way back in the before times of October 2019,  Microsoft announced that it would be expanding its Designed for Xbox stamp of approval to a line of mobile accessories. The play was pretty obvious: The company is trying to get serious about smartphone gaming through the backdoor approach of its own Project xCloud streaming service.\n Without a major in-person gaming conference this summer, Microsoft is announcing a number of new additions to the line this morning, by way of blog post. The line is getting five approved devices from names that should prove familiar to anyone with a passing interest in gaming accessories. All of them go up for pre-order today, ahead of the September 15 launch of the Xbox Game Pass Ultimate.\n Most of the included accessories are, unsurprisingly, controllers. Aside from latency, the biggest hurdle to this type of technology is control. After all, we’re talking about playing console games on a touchscreen handset. Without a sufficient accessory, the vast majority of titles just aren’t going to fly here.\n  Thankfully, Razer, PowerA and 8bitdo all have forthcoming controllers designed expressly for the purpose of xCloud streaming. Both the expandable Razer Kishi and PowerA MOGA XP7-X Plus Bluetooth controllers run $100, while the clever mini 8bitdo is $50. PowerA and 8bitdo also offer smartphone clips for wireless Xbox controllers, priced at $15.\n Also getting the Xbox thumbs-up are the $100 Arctis 1 from SteelSeries. The headphones are designed specifically to switch back and forth between console games and mobile devices.", "posttime": "2020-08-04 21:23:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,微软,设计,游戏,手机", "title": "\n微软展示专为Xbox云游戏设计的手机游戏配件", "title_en": "\n\t\t\t\tMicrosoft showcases mobile gaming accessories designed to work with Xbox cloud gaming\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/04/microsoft-showcases-mobile-gaming-accessories-designed-to-work-with-xbox-cloud-gaming/", "via": "", "real_tags": ["microsoft", "微软", "设计", "游戏", "手机"]}, {"category": "", "categoryclass": "", "imagename": "a4bff4a464395ec6b45cfecb457b5168.png", "infoid": 1016147, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Syntiant是一家为语音和传感器解决方案开发人工智能边缘硬件的初创公司，今天完成了一轮3500万美元的融资。首席执行官库尔特·布希(Kurt Busch)表示，这笔资金将用于在2020年剩余时间内提高产量。\n根据《细致研究》发布的一份报告，到2025年，语音和语音识别硬件市场预计将达到268亿美元。这是因为智能扬声器、智能显示器、电话、耳机、助听器和笔记本电脑等设备需要低功耗芯片来处理语音。虽然一些片上系统产品采用协处理器来处理语音识别，但它们通常无法适应多种外形规格。\nSyntiant成立三年，总部位于加利福尼亚州欧文，提供将机器学习与半导体设计相结合的硬件，用于永远在线的语音应用。该公司的神经决策处理器与Alexa语音服务固件一起提供唤醒字、命令字和事件检测封装，声称功耗为“近零”。事实上，Syntiant表示，其处理器提供的吞吐量是竞争对手微控制器的20倍，从而使设备的效率提高了大约200倍。\nSyntiant的N100和N101处理器的尺寸约为1.4毫米乘1.8毫米，可以运行具有超过50万个参数的模型。这些芯片采用通用ARM Cortex-M0处理器，配以128KB RAM，功耗不到140微瓦，可实现板载固件安全和身份验证、关键字训练以及最多64个输出分类。\nN100和N101-最初的目标是每瓦20top(万亿次浮点运算)左右的性能-使用数十万个闪存或单元，每次读写一个字或一个字节的数据。内存中处理器架构是由夏洛特北卡罗来纳大学(University Of North Carolina)研究员CTO杰里米·霍尔曼(Jeremy Holleman)提出的，早在2014年国际固态电路大会(International Solid-State Circuit Conference)上就提出了。Syntiant断言，该架构非常适合在低功耗的深度学习中执行大规模并行操作。\nSyntiant于2018年在英飞凌的啤酒业大会上首次展示了一款原型。该公司于当年晚些时候开始发货客户样品，并于2019年9月发货第一批产品，也就是获得Amazon Alexa硬件认证一个月后。\nSyntiant的神经决策处理器附带软件开发工具包(SDK)和“培训开发工具包”(TDK)，软件开发工具包可与几乎任何集成开发环境集成，而“培训开发工具包”可让开发人员使用Google的TensorFlow机器学习框架和其他机器学习工具包。(TDK支持神经判决处理器的独特硬件特性。开发人员在谷歌的AI云服务上训练AI模型，并通过TDK将结果下载到芯片上。)。SDK和TDK包括一个可以集成到培训管道中的硬件模型，以及服务器配置和Alexa唤醒字神经网络模型的分步说明。\nM12(前身为微软风险投资公司)和应用材料公司的应用风险投资公司领导了本周的C系列融资，新投资者大西洋桥资本公司、阿尔法·爱迪生公司和Miramar Digital Ventures公司都参与了这轮融资。这使得该公司筹集的资金总额超过6000万美元。作为这轮融资的一部分，应用风险投资公司的投资总监迈克尔·斯图尔特与大西洋桥资本公司的大卫·林一起加入了Syntiant的董事会，后者将担任董事会观察员。", "note_en": "Syntiant, a startup developing AI edge hardware for voice and sensor solutions, today closed a $35 million round. CEO Kurt Busch says the funds will be used to ramp up production throughout the remainder of 2020.\n According to a  report published by Meticulous Research, the speech and voice recognition hardware market is expected to reach $26.8 billion by 2025. That’s because devices like smart speakers, smart displays, phones, headphones, hearing aids, and laptops require low-power chips to process utterances. While some system-on-chip offerings sport coprocessors to handle voice recognition, they’re often not able to accommodate multiple form factors.\n  Three-year-old Syntiant, which is headquartered in Irvine, California, provides hardware that merges machine learning with semiconductor design for always-on voice applications. The company’s Neural Decision Processors with  Alexa Voice Service firmware offer wake word, command word, and event detection in a package with a claimed “near-zero” power consumption. In fact, Syntiant says its processors make devices approximately 200 times more efficient by providing 20 times the throughput of competing microcontrollers.\n Syntiant’s N100 and N101 processors measure about 1.4 millimeters by 1.8 millimeters and can run models with over half a million parameters. Packing a general-purpose ARM Cortex-M0 processor paired with 128KB of RAM, the chips consume less than 140 microwatts and enable onboard firmware security and authentication, keyword training, and up to 64 output classifications.\n  The N100 and N101 — which initially targeted performance of around 20 TOPS (trillion floating-point operations) per watt — use hundreds of thousands of flash memory NOR cells that read and write data one word or byte at a time. The processor-in-memory architecture was proposed by CTO Jeremy Holleman, a researcher at the University of North Carolina in Charlotte, as far back as the 2014 International Solid-State Circuits Conference. Syntiant asserts that the architecture is ideal for executing massively parallel operations in deep learning at low power.\n Syntiant first demonstrated a prototype at Infineon’s OktoberTech conference in 2018. The company began shipping customer samples later that year and shipped its first products in September 2019, a month after receiving Amazon Alexa hardware certification.\n Syntiant’s Neural Decision Processors ship with a software development kit (SDK) that integrates with virtually any integrated development environment and a “training development kit” (TDK) that lets developers use Google’s TensorFlow machine learning framework and other machine learning toolsets. (The TDK supports the Neural Decision Processors’ unique hardware characteristics. Developers train AI models on Google’s AI cloud service and download the results to the chip via the TDK.) The SDK and TDK include a hardware model that can be integrated into a training pipeline, along with step-by-step instructions for server configurations and Alexa wake word neural network models.\n M12 (formerly Microsoft Ventures) and Applied Materials’ Applied Ventures led this week’s series C funding round, with participation from new investors Atlantic Bridge Capital, Alpha Edison, and Miramar Digital Ventures. This brings the company’s total raised to over $60 million. As part of the round, Applied Ventures investment director Michael Stewart joined Syntiant’s board, alongside Atlantic Bridge Capital’s David Lam, who will serve as a board observer.", "posttime": "2020-08-04 21:22:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,芯片,人工智能,总额,develops", "title": "开发人工智能语音处理边缘芯片的Syntiant在M12和Application Ventures的带领下筹集了3500万美元的C系列资金，使其筹资总额达到6000万美元以上", "title_en": "Syntiant, which develops AI speech-processing edge chips, raises $35M Series C led by M12 and Applied Ventures, bringing its total raised to $60M+", "transed": 1, "url": "https://venturebeat.com/2020/08/04/syntiant-raises-35-million-for-ai-speech-processing-edge-chips/", "via": "", "real_tags": ["开发", "芯片", "人工智能", "总额", "develops"]}, {"category": "", "categoryclass": "", "imagename": "0c3ccb1564baa36535b05ce4b1238934.png", "infoid": 1016146, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "让我们从Lambda表达式开始本周。我们的计划是编写一组简明的文章，介绍lambda表达式的核心元素。今天，您可以看到自C++11以来语法是如何演变的，以及C++20中的最新变化是什么。\n()-参数列表，与常规函数一样，如果说明符/异常列表为空，则为可选。\nRET结尾的返回类型，大多数情况下不需要，因为编译器可以推导出该类型。\n您可以阅读位于N3337-C++11的最终草案：[expr.prim.lambda]下的规范。\n//1.最简单的lambda：[]{}；//2.带两个参数：[](Float f，int a){return a*f；}；[](int a，int b){return a&lt；b；}；//3.尾随返回类型：[](MyClass T)-&gt；int{auto a=t.computer()；print(A)；return a；}；//4.其他说明符：[X](int a，int b)可变{++x；return a&lt；b；}；[](浮动参数)noExcept{return param*param；}；[x](int a，int b)可变noExcept{++x；return a&lt；b；}；//5.可选()[x]{std：：cout&lt；&lt；x；}；//no()是否需要[x。//Won&39；t编译！[X]()可变的{++x；}；//在可变的[]noExcept{}；//Won&#39；t COMPILE！[]()NoExcept{}；//FINE之前需要FINE-()。\n在C++14中，“高级”语法没有太大改变，但是CAPTURE子句允许您执行“使用初始化器捕获”，并且参数列表可以接受自动参数(这意味着泛型lambdas)。\n此外，lambda表达式的返回类型遵循常规函数返回类型演绎(AUTO)的规则，因此简而言之，编译器现在更聪明了。\n#include&lt；iostream&gt；int main(){int x=30；int y=12；const auto foo=[z=x+y](){std：：cout&lt；&lt；z&lt；&#39；\\n&#39；；}；x=0；y=0；foo()；}\n正如您在上面看到的，编译器现在可以从z=x+y这样的表达式创建闭包类型的成员变量。\n()-参数列表，与常规函数一样，如果说明符/异常列表为空，则为可选。\nConexpr auto Square=[](Int N){return n*n；}；//隐式conexpr static_assert(Square(2)==4)；\nStruct Baz{auto foo(){return[*this]{std：：cout&lt；&lt；s&lt；&lt；std：：Endl；}；}std：：String s；}；\n另一件要记住的事情是，在C++17中删除了动态异常规范，因此在实践中，您只能使用noexclude来标记函数和lambdas。\n从C++20开始，您现在可以使用consteval作为lambda的附加说明符，而且，您还可以指定模板尾部！\n()-参数列表，与常规函数一样，如果说明符/异常列表为空，则为可选。\nInt main(){const int x=10；auto lam=[](Int X)consteval{return x+x；}；return lam(X)；}\n在下一篇文章中，您将了解如何从外部作用域捕获内容。请看这里：TODO，明天：)。\n如果你想知道更多，你可以看我关于λ的书！以下是如何获得它并加入1000名读者的选择：\n与我的C++17一起购买图书购买C++17详细信息和C++Lambda故事一起购买", "note_en": "Let’s start the week with Lambda Expressions. The plan is to have a set of concise articles presenting core elements of lambda expressions. Today you can see how the syntax has evolved since C++11 and what the latest changes in C++20 are.\n            () - the list of arguments, like in a regular function, optional if specifiers/exception list is empty\n  ret - trailing return type, in most cases not needed as the compiler can deduce the type\n You can read the spec located under  N3337 - the final draft of C++11:  [expr.prim.lambda].\n  // 1. the simplest lambda:[]{}; // 2. with two params:[]( float f,  int a) {  return a * f; };[]( int a,  int b) {  return a &lt; b; }; // 3. trailing return type:[](MyClass t) -&gt;  int {  auto a = t.compute(); print(a);  return a; }; // 4. additional specifiers:[x]( int a,  int b)  mutable { ++x;  return a &lt; b; };[]( float param)  noexcept {  return param*param; };[x]( int a,  int b)  mutable  noexcept { ++x;  return a &lt; b; }; // 5. optional ()[x] {  std:: cout &lt;&lt; x; };  // no () needed[x]  mutable { ++x; };  // won&#39;t compile![x]()  mutable { ++x; };  // fine - () required before mutable[]  noexcept { };  // won&#39;t compile![]()  noexcept { };  // fine\n  In C++14 the “high level” syntax hasn’t changed much, but the capture clause allows you perform “capture with initialiser”, and the parameter list can take  auto arguments (it means generic lambdas).\n Additionally, the return type of a lambda expression follows the rules of a regular function return type deduction ( auto), so in short, compilers are smarter now.\n    #include &lt;iostream&gt; int main() {  int x =  30;  int y =  12;  const  auto foo = [z = x + y]() {  std:: cout &lt;&lt; z &lt;&lt;  &#39;\\n&#39;; }; x =  0; y =  0; foo();}\n As you can see above the compiler can now create member variables for closure type from expressions like  z = x + y.\n      () - the list of arguments, like in a regular function, optional if specifiers/exception list is empty\n  constexpr  auto Square = []( int n) {  return n * n; };  // implicit constexpr static_assert(Square( 2) ==  4);\n  struct Baz {  auto foo() {  return [* this] {  std:: cout &lt;&lt; s &lt;&lt;  std::endl; }; }  std:: string s;};\n Another thing to have in mind is that in C++17 the dynamic exception specification is removed so in practice you can only use  noexcept to mark functions and lambdas.\n  Since C++20 you can now use  consteval as an additional specifier for the lambda, and what’s more, you can specify a template tail!\n  () - the list of arguments, like in a regular function, optional if specifiers/exception list is empty\n  int main() {  const  int x =  10;  auto lam = []( int x) consteval {  return x + x; };  return lam(x);}\n    In the next article, you’ll see how to capture things from the external scope. See here: todo, tomorrow :)\n  If you like to know more, you can see my book on Lambdas! Here are the options on how to get it and join 1000 of readers:\n Buy together with my C++17 Book  Buy C++17 in Detail AND C++ Lambda Story Together", "posttime": "2020-08-04 21:21:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "c++,int", "title": "C++Lambda Week：语法更改，C++11到C++20", "title_en": "C++ Lambda Week: Syntax changes, C++11 to C++20", "transed": 1, "url": "https://www.bfilipek.com/2020/08/lambda-syntax.html", "via": "", "real_tags": ["c++", "int"]}, {"category": "", "categoryclass": "", "imagename": "0ef273f977b824e5693a11a26b0c78c7.png", "infoid": 1016145, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，我们很兴奋地宣布Cloudflare网络互连(CNI)。CNI允许我们的客户将分支机构和总部位置直接与Cloudflare互连，无论他们身在何处，将Cloudflare的全套网络功能带到他们的物理网络边缘。与使用公共互联网连接到Cloudflare相比，使用CNI互连可提供安全性、可靠性和性能优势。而且，由于Cloudflare的全球网络覆盖范围，无论您的基础设施和员工在地球上的哪个位置，连接到我们的网络都很简单。\n在最基本的级别上，互连是两个网络之间的链路。今天，我们为客户提供以下与Cloudflare网络互联的选项：\n通过专用网络互连(PNI)。连接两个网络的物理电缆(或虚拟“pseduo-wire”；稍后将详细介绍)。\n通过Internet交换(IX)。一种通用交换结构，多个Internet服务提供商(ISP)和Internet网络可以在其中相互连接。\n举个真实世界的比喻：CloudFlare多年来在互联网上建立了一个高速公路网，以处理我们所有的客户流量。我们现在正在为我们客户的本地网络提供专用的入口匝道，以进入这些高速公路。\nCNI可在您的基础架构和Cloudflare之间提供更可靠、更快速、更专用的连接。这为我们的产品套件带来了优势。以下是一些具体产品的示例，以及如何将它们与CNI相结合：\nCloudFlare访问：CloudFlare访问将企业VPN替换为CloudFlare的网络。团队不会将内部工具放在专用网络上，而是将它们部署在任何环境中，包括混合或多云模型，并使用Cloudflare的网络一致地保护它们。CNI允许您携带您自己的MPLS网络与我们的MPLS网络相遇，让您的员工无论身在何处都能安全快速地连接到您的网络。\nCDN：CloudFlare的CDN将内容放置在离访问者更近的地方，在提高站点速度的同时将源负载降至最低。CNI提高了缓存填充性能并降低了成本。\nMagic Transfer：Magic Transfer可保护数据中心和分支机构网络免受不必要的攻击和恶意流量。将Magic Transport与CNI配合使用可降低抖动并提高吞吐量，并进一步加强基础设施免受攻击。\nCloudFlare Worker：Worker是CloudFlare的无服务器计算平台。通过与CNI集成，可以安全地连接到不会遍历公共互联网的无服务器云计算，从而使客户能够使用Cloudflare独特的Worker服务集，并具有更严格的网络性能容差。\nCNI是提高许多现有Cloudflare产品性能的好方法。通过利用CNI并在客户原始基础设施所在的任何位置与Cloudflare建立互连，客户可以比使用公共交通提供商更低的成本获得更高的性能和安全性。\n作为网络互连可以为Cloudflare客户提供的性能改进的示例，考虑流经Cloudflare的CDN和WAF的HTTP应用程序工作负载。我们的很多客户都依赖我们的CDN来提高他们的HTTP应用程序的响应速度。\nCloudFlare将内容缓存到非常接近最终用户的位置，以提供尽可能最佳的性能。但是，如果内容不在缓存中，Cloudflare边缘POP必须联系源服务器才能检索可缓存的内容。这可能会很慢，并且与直接从缓存提供服务相比，会给源服务器带来更多负载。\n通过CNI，这些回源可以在专用链路上完成，提高了吞吐量，减少了回源所需的整体时间。使用Argo Tiered Cache，客户可以管理分层缓存拓扑，并指定与网络互连位置相对应的上游缓存层。以这种方式使用分层缓存可降低源负载并提高缓存命中率，从而提高性能并降低源基础架构成本。\n这是一个真实的Cloudflare客户的匿名和采样数据，该客户最近在我们的网络和他们的网络之间提供了互连，以进一步提高性能。作为CDN的重度用户，通过在多个位置添加PNIS，他们能够将原始往返时间(RTT)缩短为宝贵的毫秒。\n例如，他们在波兰华沙的第90个百分位数往返时间减少了6.5ms，因为提供了专用网络互连(从7.5ms减少到1ms)，这是87%的性能优势！链路上的抖动(收到数据包的延迟变化)从82.9减少到0.3，这说明了链路的专用、可靠的性质。CNI有助于为您的客户和员工提供可靠、高性能的网络连接。\n拥有大型内部网络的客户希望迁移到云：更便宜、更少麻烦、更少的开销和维护。但是，客户还希望保留其现有的安全和威胁模型。\n传统上，CIO尝试将其IP网络连接到互联网分两步进行：\n购买、操作和维护特定于网络功能的硬件设备。请考虑硬件负载均衡器、防火墙、DDoS缓解设备、WAN优化等。\nCNI允许CIO在Cloudflare上提供安全服务，并以绕过公共互联网的方式将其现有网络连接到Cloudflare。*由于Cloudflare与内部网络和云集成，因此客户可以跨两个网络实施安全策略，并创建一致、安全的边界。\nCNI通过提供到Cloudflare网络的专用专用链路来提高云和网络安全性。由于此链路是专为调配该链路的客户保留的，因此该客户的流量是隔离的和私有的。\n举一个特定于产品的例子：通过CNI与Magic Transportation的集成，客户可以利用专用连接将其网络暴露在公共互联网上的风险降至最低。\nMagic Transport通过BGP从我们的边缘广告客户的IP地址，从而将客户的IP流量吸引到我们的数据中心。当流量到达时，它会被过滤并发送到客户的数据中心。在CNI之前，所有Magic Transport流量都是通过Internet上的通用路由封装(GRE)隧道从Cloudflare发送到客户的。因为GRE端点是可公开路由的，所以这些端点可能会被发现和攻击，从而绕过Cloudflare的DDoS缓解和安全工具。\n使用CNI消除了这种接触互联网的风险。将CNI与Magic Transition配合使用的优势包括：\n减少威胁暴露。虽然公司可以采取许多措施来提高网络安全性，但一些对风险敏感的组织根本不愿将终端暴露给公共Internet。CNI允许Cloudflare吸收该风险，并通过真正的私有接口仅转发干净的流量(通过Magic Transfer)。\n提高了可靠性。通过公共Internet传输的流量会受到您无法控制的因素的影响，包括中间网络上的延迟和数据包丢失。删除Cloudflare网络和您的网络之间的步骤意味着，在Magic Transition处理流量之后，它将直接可靠地转发到您的网络。\n简化配置。很快，Magic Transportation+CNI客户将可以选择在入网时跳过更改MSS(最大分段大小)，这是GRE-over-Internet所要求的步骤，对于需要考虑其下游客户的MSS的客户来说可能很有挑战性(例如。服务提供商)。\n部署示例：企鹅公司使用Cloudflare for Team、Magic Transport和CNI来保护分支机构和核心网络以及员工。\n想象一下，假设企鹅公司(Penguin Corp)拥有一个完全连接的专用MPLS网络。*维护他们的网络很困难，他们有一支专门的网络工程师团队来做这件事。他们目前花了一大笔钱来运行自己的私有云。为了最大限度地降低成本，他们将全球范围内的网络出口点限制在两个。这给他们的用户带来了一个重大的性能问题，他们的比特必须走很长的路才能完成基本任务，同时仍然要穿越企鹅的网络边界。\nSAE(Secure Access Service Edge，安全接入服务边缘)模型对他们来说很有吸引力，因为从理论上讲，它们可以脱离传统的MPLS网络，转向云计算。*SASE部署在网络边缘提供防火墙、DDoS缓解和加密服务，并为任何云部署带来安全即服务，如下图所示：\nCNI允许企鹅使用Cloudflare作为其真正的网络边缘，将其分支机构位置和数据中心与互联网完全隔离。企鹅可以适应类似SASE的模式，同时保持对公共互联网的接触为零。企鹅与Cloudflare建立了PNIS，从他们在圣何塞的分支机构到Cloudflare的圣何塞地点，以利用Cloudflare为团队提供的优势，以及从他们在奥斯汀的核心托管设施到Cloudflare的达拉斯地点，以使用Magic Transition来保护他们的核心网络。\n与Magic Transition一样，Cloudflare for Teams也用Cloudflare的全球网络取代了传统的内部安全硬件。依赖VPN设备访问内部应用程序的客户可以通过Cloudflare访问进行安全连接。维护物理Web网关盒的组织可以将与互联网绑定的流量发送到Cloudflare网关进行过滤和日志记录。\nCloudFlare for Teams服务在每个CloudFlare数据中心运行，使过滤和身份验证更接近您的用户和位置，从而避免影响性能。通过从您的办公室直接连接到Cloudflare，CNI进一步改进了这一点。通过简单的配置更改，所有分支流量都会到达Cloudflare的边缘，在那里可以应用Cloudflare for Teams策略。该链路提高了用户的速度和可靠性，并取代了将流量回程到集中式过滤设备的需要。\n他们可以使用Cloudflare的全套安全服务，而不必配置昂贵的集中式物理或虚拟网络设备。\n他们的安全和性能服务在200多个城市的Cloudflare全球网络中运行。这使安全功能更贴近用户，从而提高了用户的性能和可用性。\nCNI为客户提供了很大的好处，因为它允许客户利用我们覆盖200多个城市的全球覆盖范围：他们的分支机构和数据中心基础设施可以随时随地连接到Cloudflare。\n这一点很重要，原因有两个：我们的全球分布式网络使本地互联变得更容易，无论客户的分支机构和核心基础设施在哪里，并且允许全球分布的员工以低延迟和更高的性能与我们的边缘网络进行交互。\n客户不必担心安全地扩展他们的网络覆盖范围：这是我们的工作。\n要做到这一点，全球企业需要在全球多个点实现互联互通。CloudFlare网络互连按全球网络规模定价：CloudFlare不向企业客户收取任何调配CNI的费用。客户可能需要为访问互联平台或数据中心交叉连接付费。我们将与您和任何其他相关各方合作，使订购和供应过程尽可能顺利。\n换言之，CNI的定价旨在适应复杂的企业网络拓扑和现代IT预算。\n客户可以通过以下三种方式之一与Cloudflare互连：通过专用网络互连(PNI)、通过IX或通过我们的互连平台合作伙伴之一。我们与全球合作伙伴密切合作，以满足客户的需求。\n内网互连可在我们列出的任何内网对等设施中使用。获得到Cloudflare的物理连接很简单：指定要连接的位置、端口速度和目标VLAN。从那里开始，我们会授权，你会下订单，剩下的让我们来做。如果客户希望获得比虚拟连接或IX上的连接更高的吞吐量，或者希望从互连中消除尽可能多的中介，则应选择PNI作为其连接选项。\n想要使用现有互联网交易所的客户可以在我们参与的235+个互联网交易所中的任何一个与我们互联。要通过Internet Exchange与Cloudflare连接，请按照IX的说明进行连接，Cloudflare将启动我们这一端的连接。如果客户已经盯上了IX，或者他们想要在没有互联平台的地方互联，那么他们应该选择互联网交换机作为他们的连接选项。\nCloudFlare很荣幸能与Equinix、Megaport、电讯盈科ConsoleConnect、PacketFabric和Zayo合作，为您提供在任何合作伙伴支持的位置与我们进行虚拟连接的便捷方式。如果客户已经在使用这些提供商，或者希望快速轻松地加入到安全的云体验中，则应选择使用互联平台进行连接。\n如果您有兴趣了解更多信息，请参阅这篇关于您可以互联的所有不同方式的博客文章。对于上述所有互连方法，BGP会话建立和IP路由是相同的。唯一不同的是我们与其他网络互连的物理方式。\n我们的CNI产品页面包括一些工具，可以更好地了解您的网络与我们的网络互连的正确位置。客户可以使用这些数据帮助找出互联的最佳位置，以便与其他云提供商和其他ISP实现最大程度的连接。\n多年来，我们对任何网络都实行开放的对等政策，并将继续遵守这一政策：它允许我们通过将网络互联在一起，帮助为每个人建立更好的互联网，使互联网更可靠。传统网络使用互连/对等来为其客户和连接带来更好的性能，同时降低成本。有了CNI，我们将开放我们的基础设施，将同样的好处扩展到我们的客户。\n与使用公共互联网相比，CNI为客户提供了更好的性能、可靠性、可扩展性和安全性。客户现在可以在我们的任何物理位置与CloudFlare互连，获得到CloudFlare的专用链路，从而通过每个互连点提供安全优势以及更稳定的延迟、抖动和可用带宽。\nCNI产品新闻网", "note_en": "Today we’re excited to announce  Cloudflare Network Interconnect (CNI). CNI allows our customers to interconnect branch and HQ locations directly with Cloudflare wherever they are, bringing Cloudflare’s full suite of network functions to their physical network edge. Using CNI to interconnect provides security, reliability, and performance benefits vs. using the public Internet to connect to Cloudflare. And because of Cloudflare’s global network reach, connecting to our network is straightforward no matter where on the planet your infrastructure and employees are.\n At its most basic level, an interconnect is a link between two networks. Today, we’re offering customers the following options to interconnect with Cloudflare’s network:\n Via a private network interconnect (PNI). A physical cable (or a virtual “pseduo-wire”; more on that later) that connects two networks.\n Over an Internet Exchange (IX). A common switch fabric where multiple Internet Service Providers (ISPs) and Internet networks can interconnect with each other.\n To use a real world analogy: Cloudflare over the years has built a network of highways across the Internet to handle all our customers&#39; traffic. We’re now providing dedicated on-ramps for our customers’ on-prem networks to get onto those highways.\n  CNI provides more reliable, faster, and more private connectivity between your infrastructure and Cloudflare’s. This delivers benefits across our product suite. Here are some examples of specific products and how you can combine them with CNI:\n Cloudflare Access: Cloudflare Access replaces corporate VPNs with Cloudflare’s network. Instead of placing internal tools on a private network, teams deploy them in any environment, including hybrid or multi-cloud models, and secure them consistently with Cloudflare’s network. CNI allows you to bring your own MPLS network to meet ours, allowing your employees to connect to your network securely and quickly no matter where they are.\n CDN: Cloudflare’s CDN places content closer to visitors, improving site speed while minimizing origin load. CNI improves cache fill performance and reduces costs.\n Magic Transit: Magic Transit protects datacenter and branch networks from unwanted attack and malicious traffic. Pairing Magic Transit with CNI decreases jitter and drives throughput improvements, and further hardens infrastructure from attack.\n Cloudflare Workers: Workers is Cloudflare’s serverless compute platform. Integrating with CNI provides a secure connection to serverless cloud compute that does not traverse the public Internet, allowing customers to use Cloudflare’s unique set of Workers services with tighter network performance tolerances.\n   CNI is a great way to boost performance for many existing Cloudflare products. By utilizing CNI and setting up interconnection with Cloudflare wherever a customer’s origin infrastructure is, customers can get increased performance and security at lower cost than using public transit providers.\n  As an example of the performance improvements network interconnects can deliver for Cloudflare customers, consider an HTTP application workload which flows through Cloudflare’s CDN and WAF. Many of our customers rely on our CDN to make their HTTP applications more responsive.\n Cloudflare caches content very close to end users to provide the best performance possible. But, if content is not in cache, Cloudflare edge PoPs must contact the origin server to retrieve cacheable content. This can be slow, and places more load on an origin server compared to serving directly from cache.\n With CNI, these origin pulls can be completed over a dedicated link, improving throughput and reducing overall time needed for origin pulls. Using Argo Tiered Cache, customers can manage tiered cache topologies and specify upstream cache tiers that correspond with locations where network interconnects are in place. Using Tiered Cache in this fashion lowers origin loads and increases cache hit rates, thereby improving performance and reducing origin infrastructures costs.\n Here’s anonymized and sampled data from a real Cloudflare customer who recently provisioned interconnections between our network and theirs to further improve performance. Heavy users of our CDN, they were able to shave off precious milliseconds from their origin round trip time (RTT) by adding PNIs in multiple locations.\n  As an example, their 90th percentile round trip time in Warsaw, Poland decreased by 6.5ms as a result of provisioning a private network interconnect (from 7.5ms to 1ms), which is a performance win of 87%!  The jitter (variation in delay in received packets) on the link decreased from 82.9 to 0.3, which speaks to the dedicated, reliable nature of the link. CNI helps deliver reliable and performant network connectivity to your customers and employees.\n   Customers with large on-premise networks want to move to the cloud: it’s cheaper, less hassle, and less overhead and maintenance.  However, customers want to also preserve their existing security and threat models.\n Traditionally, CIOs trying to connect their IP networks to the Internet do so in two steps:\n Purchase, operate, and maintain network function specific hardware appliances. Think hardware load balancers, firewalls, DDoS mitigation equipment, WAN optimization, and more.\n CNI allows CIOs to provision security services on Cloudflare and connect their existing networks to Cloudflare in a way that bypasses the public Internet.  Because Cloudflare integrates with on-premise networks and the cloud, customers can enforce security policies across both networks and create a consistent, secure boundary.\n CNI increases cloud and network security by providing a private, dedicated link to the Cloudflare network. Since this link is reserved exclusively for the customer that provisions it, the customer’s traffic is isolated and private.\n  To use a product-specific example: through CNI’s integration with Magic Transit, customers can take advantage of private connectivity to minimize exposure of their network to the public Internet.\n Magic Transit attracts customers’ IP traffic to our data centers by advertising their IP addresses from our edge via BGP. When traffic arrives, it’s filtered and sent along to customers’ data centers. Before CNI, all Magic Transit traffic was sent from Cloudflare to customers via Generic Routing Encapsulation (GRE) tunnels over the Internet. Because GRE endpoints are publicly routable, there is some risk these endpoints could be discovered and attacked, bypassing Cloudflare’s DDoS mitigation and security tools.\n Using CNI removes this exposure to the Internet. Advantages of using CNI with Magic Transit include:\n Reduced threat exposure. Although there are many steps companies can take to increase network security, some risk-sensitive organizations prefer not to expose endpoints to the public Internet at all. CNI allows Cloudflare to absorb that risk and forward only clean traffic (via Magic Transit) through a truly private interface.\n Increased reliability. Traffic traveling over the public Internet is subject to factors outside of your control, including latency and packet loss on intermediate networks. Removing steps between Cloudflare’s network and yours means that after Magic Transit processes traffic, it’s forwarded directly and reliably to your network.\n Simplified configuration. Soon, Magic Transit + CNI customers will have the option to skip making MSS (maximum segment size) changes when onboarding, a step that’s required for GRE-over-Internet and can be challenging for customers who need to consider their downstream customers’ MSS as well (eg.  service providers).\n Example deployment: Penguin Corp uses Cloudflare for Teams, Magic Transit, and CNI to protect branch and core networks, and employees.\n Imagine Penguin Corp, a hypothetical company, has a fully connected private MPLS network.  Maintaining their network is difficult and they have a dedicated team of network engineers to do this.  They are currently paying a lot of money to run their own private cloud. To minimize costs, they limit their network egress points to two worldwide.  This creates a major performance problem for their users, whose bits have to travel a long way to accomplish basic tasks while still traversing Penguin’s network boundary.\n  SASE (Secure Access Service Edge) models look attractive to them, because they can, in theory, move away from their traditional MPLS network and move towards the cloud.  SASE deployments provide firewall, DDoS mitigation, and encryption services at the network edge, and bring security as a service to any cloud deployment, as seen in the diagram below:\n  CNI allows Penguin to use Cloudflare as their true network edge, hermetically sealing their branch office locations and datacenters from the Internet. Penguin can adapt to a SASE-like model while keeping exposure to the public Internet at zero. Penguin establishes PNIs with Cloudflare from their branch office in San Jose to Cloudflare’s San Jose location to take advantage of Cloudflare for Teams, and from their core colocation facility in Austin to Cloudflare’s Dallas location to use Magic Transit to protect their core networks.\n Like Magic Transit, Cloudflare for Teams replaces traditional security hardware on-premise with Cloudflare’s global network. Customers who relied on VPN appliances to reach internal applications can instead connect securely through Cloudflare Access. Organizations maintaining physical web gateway boxes can send Internet-bound traffic to Cloudflare Gateway for filtering and logging.\n Cloudflare for Teams services run in every Cloudflare data center, bringing filtering and authentication closer to your users and locations to avoid compromising performance. CNI improves that even further with a direct connection from your offices to Cloudflare. With a simple configuration change, all branch traffic reaches Cloudflare’s edge where Cloudflare for Teams policies can be applied. The link improves speed and reliability for users and replaces the need to backhaul traffic to centralized filtering appliances.\n  They get to use Cloudflare’s full set of security services without having to provision expensive and centralized physical or virtualized network appliances.\n Their security and performance services are running across Cloudflare’s global network in over 200 cities. This brings performance and usability improvements for users by putting security functions closer to them.\n   CNI offers a big benefit to customers because it allows them to take advantage of our global footprint spanning 200+ cities: their branch office and datacenter infrastructure can connect to Cloudflare wherever they are.\n This matters for two reasons: our globally distributed network makes it easier to interconnect locally, no matter where a customer’s branches and core infrastructure is, and allows for a globally distributed workforce to interact with our edge network with low latency and improved performance.\n Customers don’t have to worry about securely expanding their network footprint: that’s our job.\n To this point, global companies need to interconnect at  many points around the world. Cloudflare Network Interconnect is priced for global network scale:  Cloudflare doesn&#39;t charge anything for enterprise customers to provision CNI. Customers may need to pay for access to an interconnection platform or a datacenter cross-connect. We’ll work with you and any other parties involved to make the ordering and provisioning process as smooth as possible.\n In other words, CNI’s pricing is designed to accommodate complicated enterprise network topologies  and modern IT budgets.\n  Customers can interconnect with Cloudflare in one of three ways: over a private network interconnect (PNI), over an IX, or through one of our interconnection platform partners. We have worked closely with our global partners to meet our customers where they are and how they want.\n  Private Network Interconnects are available at  any of our listed private peering facilities. Getting a physical connection to Cloudflare is easy: specify where you want to connect, port speeds, and target VLANs. From there, we’ll authorize it, you’ll place the order, and let us do the rest.  Customers should choose PNI as their connectivity option if they want higher throughput than a virtual connection or connection over an IX, or want to eliminate as many intermediaries from an interconnect as possible.\n  Customers who want to use existing Internet Exchanges can interconnect with us  at any of the 235+ Internet Exchanges we participate in. To connect with Cloudflare via an Internet Exchange, follow the IX’s instructions to connect, and Cloudflare will spin up our side of the connection.  Customers should choose Internet Exchanges as their connectivity option if they are either already peered at an IX, or they want to interconnect in a place where an interconnection platform isn’t present.\n  Cloudflare is proud to be  partnering with Equinix, Megaport, PCCW ConsoleConnect, PacketFabric, and Zayo to provide you with easy ways to virtually connect with us in any of the partner-supported locations. Customers should choose to connect with an interconnection platform if they are already using these providers or want a quick and easy way to onboard onto a secure cloud experience.\n  If you’re interested in learning more, please see  this blog post about all the different ways you can interconnect. For all of the interconnect methodologies described above, the BGP session establishment and IP routing are the same. The only thing that is different is the physical way in which we interconnect with other networks.\n  Our  product page for CNI includes tools to better understand the right places for your network to interconnect with ours.  Customers can use this data to help figure out the optimal place to interconnect to have the most connectivity with other cloud providers and other ISPs in general.\n   We have had an open peering policy for years with any network and will continue to abide by that policy: it allows us to help build a better Internet for everyone by interconnecting networks together, making the Internet more reliable. Traditional networks use interconnect/peering to drive better performance for their customers and connectivity while driving down costs. With CNI, we are opening up our infrastructure to extend the same benefits to our customers as well.\n  CNI provides customers with better performance, reliability, scalability, and security than using the public Internet. A customer can interconnect with Cloudflare in any of our physical locations today, getting dedicated links to Cloudflare that deliver security benefits and more stable latency, jitter, and available bandwidth through each interconnection point.\n  Product News  CNI  Network", "posttime": "2020-08-04 21:20:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "网络,network,cloudflare", "title": "CloudFlare网络互联", "title_en": "Cloudflare Network Interconnect", "transed": 1, "url": "https://blog.cloudflare.com/cloudflare-network-interconnect/", "via": "", "real_tags": ["网络", "network"]}, {"category": "", "categoryclass": "", "imagename": "c2682a370bff5fc5cdd81d07de81403f.png", "infoid": 1016144, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "CRUX是一个具有双临时图形查询…的开源文档数据库。SQLSQL目前是Alpha版，不支持​，但是您可以使用Datalog query接口来读取和遍历关系。\n我们是Datalog和它所赋予的力量的粉丝。尽管它不是直接兼容的并且可能会进一步漂移，但是我们已经将我们的Datalog query API建立在Datomic的基础上，在Datalogis中，Datalogis表示为模式匹配的声明性数据结构。\nDatalog易于构造和解析，并且很自然地将自定义谓词和规则用作逻辑模式匹配的一部分。\n我们喜欢Datalog，但公平地说，相当大一部分潜在用户会想要使用SQL。无论是想要在不需要了解Datalog的情况下运行即席SQL查询的用户，还是想要在以SQL为通用语言的系统之间进行集成的用户，我们都支持它，这一点很重要。\n我们在Crux中创建了一个新的CRUX-SQL模块，它使用Apache calcite SQL查询计划引擎。Calcite是一个强大的库，用于针对任意数据源公开SQL查询，并已与各种DBMS(如Cassandra、Mongo和Elastic)以及大数据系统(如Have、Drill、Flink和Dremio)集成。\n方解石已经存在很长一段时间了，而且仍然非常活跃。我们感谢方解石团队在这个工具上所做的工作和它所提供的力量，以及围绕它建立起来的友好社区。\n我们将方解石进程内作为Crux节点的一部分运行，因此不需要设置任何额外的基础设施。相反，您只需要添加CRUX-SQL模块依赖项：\n我们集成了方解石，以便将SQL查询转换为高效的Datalog查询，包括排序和内部联接。\n请访问模块自述，了解如何开始一些简单的步骤，或观看此视频：\nCRUX-SQL模块允许使用Avatica进行进程内SQL查询和远程JDBC查询。这在文件里都有报道。", "note_en": "Crux is an open-source document database with bitemporal graphqueries…​ it’s currently in alpha and lacks SQL support, but you canuse a Datalog query interface for reading and traversingrelationships.\n We are fans of  Datalog and thepower it gives. Although it’s not directly compatible and may driftout further, we’ve based our Datalog query API on Datomic’s, where Datalogis represented as a pattern-matching declarative data-structure.\n Datalog is easy to construct and parse and it is natural to make useof custom predicates and rules as part of the logical patternmatching.\n We love Datalog, but it’s also fair to say that a sizeable chunk ofpotential users will want to use SQL. Be it for users who want to runad-hoc SQL queries without needing to know Datalog, or for integrationbetween systems where SQL is the lingua franca, it’s important that wesupport it.\n We have created a new  crux-sql module in Crux which makes use of the Apache Calcite SQL query planning engine. Calciteis a powerful library for exposing SQL queries against arbitrary data-sourcesand has been integrated with a variety of DBMSs such as Cassandra, Mongo andElastic, as well as Big Data systems like Hive, Drill, Flink and Dremio.\n Calcite has been around for a long while and is still veryactive. We’re grateful for the work the Calcite team have put intothis tool and the power it gives, as well as the friendly community thathas built up around it.\n We run Calcite in-process as part of a Crux node, so there’s no needto set up any additional infrastructure. Rather you just need to addthe  crux-sql module dependency:\n  We have integrated Calcite such that SQL queries are translated toefficient Datalog queries, including sorts and inner joins.\n  Please visit the moduleREADME for how to get going with some simple steps, or please watchthis video:\n  The  crux-sql module allows for both in-process SQL queries and forremote JDBC queries using Avatica. This is covered in thedocs.", "posttime": "2020-08-04 21:19:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "database,数据库,datalog", "title": "除数据日志外，CRUX数据库引擎还添加了SQL支持", "title_en": "Crux database engine adds SQL support in addition to Datalog", "transed": 1, "url": "https://juxt.pro/blog/crux-sql", "via": "", "real_tags": ["database", "数据库", "datalog"]}, {"category": "", "categoryclass": "", "imagename": "6d0f1daa2dc3a4565c535ee72166e9e7.jpg", "infoid": 1016142, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该工具一直是法律挑战的目标。移民福利联合委员会(JCWI)和活动律师事务所Foxglove要求法院宣布签证申请流式算法非法，并下令停止使用，等待司法审查。\n这一法律行动并没有走完全程，但似乎已经迫使内政部采取行动，因为它承诺重新设计系统。\n内政部发言人向我们证实，从8月7日起，该算法将暂停使用，并通过电子邮件向我们发送了这样一份声明：“我们一直在审查签证申请流工具的运作方式，并将重新设计我们的流程，使其更加精简和安全。”\n尽管政府没有接受有关偏见的指控，但在给律师事务所的一封信中写道：“重新设计的事实并不意味着(国务卿)接受你索赔表格中的指控(即围绕无意识的偏见和在分流过程中使用国籍作为标准)。”\n内政部的信还声称，该部门已经“在许多应用程序类型”中不再使用流媒体工具。但它补充说，它将“以开放的心态考虑您提出的关切”来重新设计。\n重新设计计划在秋季完成，内政部表示，在此期间将实施临时程序，排除使用国籍作为分类标准。\n大新闻。从本周五开始，内政部的种族主义签证算法将不复存在！💃🎉多亏了我们(与@jcwi_uk)对这个神秘的、电脑驱动的签证申请筛选系统提起的诉讼，内政部同意“停止使用流媒体工具”。\nJCWI在其网站上写道：“今天的胜利代表着英国法庭对算法判决系统的首次成功挑战。”JCWI称自己胜诉的对象是“神秘的、由计算机驱动的”筛选系统的人，他们在自己的网站上写道：“今天的胜利代表着英国首次在法庭上成功挑战了算法决策系统。我们已经要求法院宣布流媒体算法是非法的，并下令停止使用它来评估签证申请，等待审查。内政部的决定实际上承认了这一说法。“\n该部门没有回应我们就算法及其设计过程向其提出的一些问题-包括在实施该技术之前是否征求了法律意见，以确定它是否符合英国的平等法案。\n内政部的声明补充说：“我们不接受移民福利联合委员会在他们的司法审查索赔中提出的指控，虽然诉讼仍在进行中，但该部不宜进一步置评。”\nJCWI的投诉集中在自2015年以来，使用了一种带有“红绿灯系统”的算法来对每一份前往英国的入境签证申请进行评分。\n“这个被内政部描述为数字‘流媒体工具’的工具，给申请者分配了红色、琥珀色或绿色的风险评级。一旦被算法分配，这一评级在决定签证申请结果方面发挥着重要作用。“它写道，鉴于其对待某些国籍的方式，这项技术被称为”种族主义“和设计上的歧视性。\n“签证算法以国籍为基础进行歧视--这是经过设计的。持有“可疑”国籍的人提出的申请获得了更高的风险分数。他们的申请受到内政部官员的严格审查，受到更多的怀疑，需要更长的时间才能确定，而且更有可能被拒绝。\n“我们认为这是种族歧视，违反了2010年”平等法案“，”它补充道，“流媒体工具是不透明的。”除了承认存在一份可疑国籍的秘密名单外，内政部拒绝提供有关该算法的有意义的信息。目前还不清楚还有哪些其他因素被用来对申请进行评分。“。\n自2012年以来，内政部公开实施了一项被称为“敌对环境”的移民政策--实施行政和立法程序，目的是让人们尽可能地难以留在英国。\n这一政策导致了多起人权丑闻。(我们还讲述了去年一家英国初创公司签证噩梦的故事，报道了对当地科技行业的影响。)。因此，在一项已经存在很大问题的政策上应用自动化，看起来确实像是一种被告上法庭的公式。\nJCWI对流媒体工具的担忧恰恰是它被用来自动化种族主义和歧视，许多人认为这是内政部“敌对环境”政策的基础。换句话说，如果政策本身是种族主义的，任何算法都会拾取并反映这一点。\nJCWI的法律政策主管柴帕特尔(Chai Patel)在一份声明中表示：“内政部自己对Windrush丑闻进行的独立审查发现，它对自己操作的种族主义假设和制度视而不见。”“这个流媒体工具经历了几十年的制度性种族主义做法，比如针对特定国家的移民突袭，并将其转变为软件。移民系统需要从头开始重建，以监控这种偏见，并将其根除。“。\n“我们很高兴内政部看到了道理，取消了流媒体工具。种族主义反馈循环意味着，本应是公平的移民过程，实际上只是“白人的快速登机”。我们需要的是民主，而不是靠算法治理，“Foxglove创始人兼董事科里·克里德(Cori Crider)补充道。“在进一步推出任何系统之前，让我们问问专家和公众，自动化是否合适，以及如何从根源上发现和挖掘历史偏见。”\n在写给Foxglove的信中，政府承诺对将于8月7日切换到的临时流程进行平等影响评估和数据保护影响评估-届时政府写道，将使用“以人为中心的属性(如以前旅行的证据)”来帮助筛选一些签证申请，并进一步承诺“不会使用国籍”。\n在此期间，一些类型的申请将完全从筛选过程中删除。\n“我们的意图是，重新设计将尽快完成，最迟在2020年10月30日之前完成，”它补充道。\n当被问及法律上可以接受的签证分流算法可能是什么样子时，互联网法律专家莉莲·爱德华兹告诉Techcrch：“这是一个很难的…。作为一名移民律师，我不足以知道最初应用的重新可疑国籍标准是否在司法审查标准下是非法的，即使没有在分类算法中实施。如果是，那么很明显，下一代算法应该只追求基于法律上可接受的理由进行歧视。\n“我们都知道，问题是机器学习可以重建非法标准--尽管现在有众所周知的技术可以规避这一点。”\n“你可以说，这个算法系统帮了我们一个忙，因为它直面所使用的非法标准，而这些标准本可以隐藏在移民局官员个人的非正式层面上。”事实上，过去支持这种制度的一个论点是“一致性和非任意性”。这是一个艰难的问题，“她补充说。\n今年早些时候，荷兰政府被勒令停止使用算法风险评分系统来预测社保申领人实施福利或税务欺诈的可能性-此前当地一家法院发现该系统违反了人权法。\n在另一个有趣的案例中，一群英国优步司机正在挑战GIG平台在欧洲数据保护框架下对它们进行算法管理的合法性-该框架增加了数据访问权，包括与重大法律意义的自动决策相关的条款。", "note_en": "The tool had been the target of a legal challenge. The  Joint Council for the Welfare of Immigrants (JCWI) and campaigning law firm Foxglove had asked a court to declare the visa application streaming algorithm unlawful and order a halt to its use, pending a judicial review.\n The legal action had not run its full course but appears to have forced the Home Office’s hand as it has committed to a redesign of the system.\n  A Home Office spokesperson confirmed to us that from August 7 the algorithm’s use will be suspended, sending us this statement via email: “We have been reviewing how the visa application streaming tool operates and will be redesigning our processes to make them even more streamlined and secure.”\n Although the government has not accepted the allegations of bias, writing in a letter to the law firm: “The fact of the redesign does not mean that the [Secretary of State] accepts the allegations in your claim form [i.e. around unconscious bias and the use of nationality as a criteria in the streaming process].”\n The Home Office letter also claims the department had already moved away from use of the streaming tool “in many application types”. But it adds that it will approach the redesign “with an open mind in considering the concerns you have raised”.\n The redesign is slated to be completed by the autumn, and the Home Office says an interim process will be put in place in the meanwhile, excluding the use of nationality as a sorting criteria.\n HUGE news. From this Friday, the Home Office&#39;s racist visa algorithm is no more! 💃🎉 Thanks to our lawsuit (with  @JCWI_UK) against this shadowy, computer-driven system for sifting visa applications, the Home Office have agreed to “discontinue the use of the Streaming Tool”.\n The JCWI has claimed a win against what it describes as a “shadowy, computer-driven” people sifting system — writing on its  website: “Today’s win represents the UK’s first successful court challenge to an algorithmic decision system. We had asked the Court to declare the streaming algorithm unlawful, and to order a halt to its use to assess visa applications, pending a review. The Home Office’s decision effectively concedes the claim.”\n The department did not respond to a number of questions we put to it regarding the algorithm and its design processes — including whether or not it sought legal advice ahead of implementing the technology in order to determine whether it complied with the UK’s Equality Act.\n “We do not accept the allegations Joint Council for the Welfare of Immigrants made in their Judicial Review claim and whilst litigation is still on-going it would not be appropriate for the Department to comment any further,” the Home Office statement added.\n The JCWI’s complaint centered on the use, since 2015, of an algorithm with a “traffic-light system” to grade every entry visa application to the UK.\n “The tool, which the Home Office described as a digital ‘streaming tool’, assigns a Red, Amber or Green risk rating to applicants. Once assigned by the algorithm, this rating plays a major role in determining the outcome of the visa application,” it  writes, dubbing the technology “racist” and discriminatory by design, given its treatment of certain nationalities.\n “The visa algorithm discriminated on the basis of nationality — by design. Applications made by people holding ‘suspect’ nationalities received a higher risk score. Their applications received intensive scrutiny by Home Office officials, were approached with more scepticism, took longer to determine, and were much more likely to be refused.\n “We argued this was racial discrimination and breached the Equality Act 2010,” it adds. “The streaming tool was opaque. Aside from admitting the existence of a secret list of suspect nationalities, the Home Office refused to provide meaningful information about the algorithm. It remains unclear what other factors were used to grade applications.”\n Since 2012 the Home Office has openly operated an immigration policy known as the ‘hostile environment’ — applying administrative and legislative processes that are intended to make it as hard as possible for people to stay in the UK.\n The policy has led to a number of  human rights scandals. (We also covered the impact on the local tech sector by telling the story of  one UK startup’s visa nightmare last year.) So applying automation atop an already highly problematic policy does look like a formula for being taken to court.\n The JCWI’s concern around the streaming tool was exactly that it was being used to automate the racism and discrimination many argue underpin the Home Office’s ‘hostile environment’ policy. In other words, if the policy itself is racist any algorithm is going to pick up and reflect that.\n “The Home Office’s own independent review of the Windrush scandal, found that it was oblivious to the racist assumptions and systems it operates,” said Chai Patel, legal policy director of the JCWI, in a statement. “This streaming tool took decades of institutionally racist practices, such as targeting particular nationalities for immigration raids, and turned them into software. The immigration system needs to be rebuilt from the ground up to monitor for such bias and to root it out.”\n “We’re delighted the Home Office has seen sense and scrapped the streaming tool. Racist feedback loops meant that what should have been a fair migration process was, in practice, just ‘speedy boarding for white people.’ What we need is democracy, not government by algorithm,” added Cori Crider, founder and director of Foxglove. “Before any further systems get rolled out, let’s ask experts and the public whether automation is appropriate at all, and how historic biases can be spotted and dug out at the roots.”\n In its  letter to Foxglove, the government has committed to undertaking Equality Impact Assessments and Data Protection Impact Assessments for the interim process it will switch to from August 7 — when it writes that it will use “person-centric attributes (such as evidence of previous travel”, to help sift some visa applications, further committing that “nationality will not be used”.\n Some types of applications will be removed from the sifting process altogether, during this period.\n “The intent is that the redesign will be completed as quickly as possible and at the latest by October 30, 2020,” it adds.\n Asked for thoughts on what a legally acceptable visa streaming algorithm might look like, Internet law expert  Lilian Edwards told TechCrunch: “It’s a tough one… I am not enough of an immigration lawyer to know if the original criteria applied re suspect nationalities would have been illegal by judicial review standard anyway even if  not implemented in a sorting algorithm. If yes then clearly a next generation algorithm should aspire only to discriminate on legally acceptable grounds.\n “The problem as we all know is that machine learning can reconstruct illegal criteria — though there are now well known techniques for evading that.”\n “You could say the algorithmic system did us a favour by confronting illegal criteria being used which could have remained buried at individual immigration officer informal level. And indeed one argument for such systems used to be ‘consistency and non-arbitrary’ nature. It’s a tough one,” she added.\n Earlier this year the Dutch government was ordered to halt use of an algorithmic risk scoring system for predicting the likelihood social security claimants would commit benefits or tax fraud — after a local court found it breached human rights law.\n In another  interesting case, a group of UK Uber drives are challenging the legality of the gig platform’s algorithmic management of them under Europe’s data protection framework — which bakes in data access rights, including provisions attached to legally significant automated decisions.", "posttime": "2020-08-04 20:29:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "算法,设计,分流,commits", "title": "\n英国承诺在挑战“种族主义”工具后重新设计签证分流算法", "title_en": "\n\t\t\t\tUK commits to redesign visa streaming algorithm after challenge to ‘racist’ tool\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/04/uk-commits-to-redesign-visa-streaming-algorithm-after-challenge-to-racist-tool/", "via": "", "real_tags": ["算法", "设计", "分流", "commits"]}, {"category": "", "categoryclass": "", "imagename": "a1a3018dad74350d9dc467103a70dfa4.jpeg", "infoid": 1016141, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英国竞争监管机构已经给亚马逊的少数股权投资--亚马逊将持有Deliveroo 16%的股份--开了绿灯。\n亚马逊已获准收购英国外卖初创公司Deliveroo的少数股权，结束了两家公司为说服监管机构相信这笔交易不会损害竞争而进行的旷日持久的斗争。\n2019年5月，Deliveroo宣布已经筹集了由亚马逊牵头的5.75亿美元融资。仅仅两个月后，英国竞争和市场管理局就阻止了这笔交易。然后，在12月，CMA启动了一项正式调查，以审查潜在的反竞争影响。\n周二，竞争监管机构发布了关于这笔投资的最终决定，确认亚马逊的少数股权投资--将获得Deliveroo 16%的股份--可以继续进行。这一举动支持了之前的两个临时调查结果，即这笔交易应该获得批准。\nDeliveroo的一位发言人周二表示，我们很高兴CMA已经结束了15个月的调查，亚马逊的少数股权投资现在可以继续进行。\n这对英国顾客和餐馆以及英国经济来说都是极好的消息。英国出生的Deliveroo将利用这笔投资为顾客增加选择和价值，为餐厅提供支持，并将能够随着公司的扩张为更多的乘客提供他们重视的灵活工作。", "note_en": "The U.K.&#39;s competition watchdog has given Amazon&#39;s minority investment — which would see it take a 16% stake in Deliveroo — the green light.\n Amazon has been given approval to buy a minority stake in U.K. food delivery start-up Deliveroo, ending a lengthy battle by the firms to convince regulators the deal would not harm competition.\n In May 2019, Deliveroo  announced it had raised a $575 million funding round led by Amazon. Just two months later, the U.K.&#39;s Competition and Markets Authority  put the brakes on the deal. Then, in December, the CMA launched a formal probe to examine potential anti-competitive implications.\n  On Tuesday, the competition watchdog issued its final decision on the investment confirming that Amazon&#39;s minority investment — which would see it take a 16% stake in Deliveroo — can go ahead. That move upheld two previous  provisional findings that the deal should be approved.\n &#34;We are delighted that the CMA has concluded its 15 month investigation and that the Amazon minority investment can now go ahead,&#34; a Deliveroo spokesperson said Tuesday.\n &#34;This is fantastic news for U.K. customers and restaurants, and for the British economy. British born Deliveroo will use the investment to increase choice and value for customers, support for restaurants and will be able to offer more riders the flexible work they value as the company expands.&#34;", "posttime": "2020-08-04 20:28:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,交易,亚马逊,监管,competition", "title": "英国竞争监管机构批准亚马逊投资收购Deliveroo 16%的股份，结束了两家公司为说服监管机构批准这笔交易而进行的旷日持久的斗争", "title_en": "UK's competition watchdog approves Amazon's investment for a 16% stake in Deliveroo, ending a long battle by the firms to convince regulators to clear the deal", "transed": 1, "url": "https://www.cnbc.com/2020/08/04/amazon-gets-approval-to-buy-stake-in-uk-food-delivery-firm-deliveroo.html", "via": "", "real_tags": ["amazon", "交易", "亚马逊", "监管"]}, {"category": "", "categoryclass": "", "imagename": "b2d25173e870d018cf9a417b4f30e698.jpeg", "infoid": 1016140, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Edalize是一个Python库，用于与EDA工具交互。它可以为支持的工具创建项目文件，并在批处理或GUI模式(支持的情况下)下运行它们。\n所有EDA工具，如Icarus、Yosys、ModelSim、Vivado、Verilator、GHDL、Quartus等都会获得输入HDL文件(Verilog和VHDL)和一些特定于工具的文件(约束文件、内存初始化文件、IP描述文件等)。与这些文件一起设置的可能还有几个Verilog“定义”、一些顶级参数/泛型或一些特定于工具的选项。一旦配置完成，就会构建仿真模型、网表或FPGA映像，在仿真的情况下，也会执行该模型，可能会使用一些额外的运行时参数。\n问题是，所有这些工具都是以完全不同的方式来做这件事，而且通常没有办法将配置从一个模拟器导入到另一个模拟器。\n别害怕！埃德莱兹会帮你处理这件事的。通过告诉Edalize您拥有哪些文件，以及一些信息，在编译和运行时使用哪些参数化(例如，plusargs、定义、泛型、参数)、VPI库源(如果适用)和任何其他尚未提及的特定于工具的选项，它将创建必要的项目文件，并为您提供构建和运行它。\n这将使您不必亲自处理与EDA工具接口的枯燥工作，同时仍然有相当大的能力以您想要的方式设置项目。\n它允许您快速切换工具，至少在模拟器方面是这样。这对于消除特定于工具的错误非常有用，或者只是让您使用您选择的武器。\n它还可以用来只获取一个快速模板，如果有的话，您可以在工具的GUI中打开该模板，然后从那里继续工作。\n它可以直接集成为您现有的Python驱动的HDL项目的库，也可以独立使用(无论如何很快)来为用其他语言编写的项目提供Edalize。\nEdalize是一个Python模块。下载后，我们可以使用以下Python命令进行安装：\n假设我们有一个项目，其中包含一个名为blinky.v.的Verilog源文件，然后还有一个名为blinky_tb.v的测试台和一个名为constraints.sdc的合成约束文件。您可以从blinky和orpsoc-cores中的vlog_tb_utils.v获取这些文件。\n对于模拟，我们希望使用这两个Verilog文件，在名为build的子目录中构建它，然后使用一个参数运行它以控制模拟的时钟频率。\nEdalize是一个Python工具，我们可以在Python脚本文件中运行它，也可以直接在Python控制台中运行它。\nWork_root=&#39；build&#39；files=[{&#39；name&#39；：os.path.relpath(&#39；blinky.v&#39；，work_root)，&#39；file_type&#39；：&#39；verilogSource&#39；}，{&#39；name&#39；：os.path.relpath(&#39；blinky_tb.v&#39；，work_root)，&#。：&#39；verilogSource&#39；}，{&#39；name&#39；：os.path.relpath(&#39；vlog_TB_utils.v&#39；，work_root)，&#39；file_type&#39；：&#39；verilogSource&#39；}]。\n该设计有一个名为clk_freq_hz的TopLevel Verilog参数，它接受整数。我们将其默认值设置为1000。测试台还可以通过设置一个名为VCD的加号来启用波形转储：\n参数={&#39；clk_freq_hz&#39；：{&#39；datatype&#39；：&#39；int&#39；，&#39；default&#39；：1000，&#39；paramtype&#39；：&#39；vlogparam&#39；}，&#39；vcd&#39；：{&#39；datatype&#39；：&#39；bool&#39；，&#39；paramtype。：&#39；plusarg&#39；}}。\n并将其全部放入单个数据结构中，以及有关项目的顶层和名称的一些信息：\nEDAM={&#39；FILES&#39；：：&#39；FILES，&#39；NAME&#39；：&#39；BLINKY_PROJECT&#39；，&#39；参数&#39；：参数，&#39；顶层&#39；：&#39；BLINKY_TB&#39；}。\n在这一点上，我们仍然没有运行实际的EDA工具，如果愿意的话，可以在没有Edalize的情况下使用WORK_ROOT目录中的文件。但是让我们用Edalize继续这个例子。\n最后用我们的论据来运行它。某些类型的参数(例如plusargs)是在运行时定义的，此时我们可以通过将名称和新值传递给run()来更改它们的值。或者我们可以完全跳过它，并使用配置阶段的默认值。让&#39；在启用VCD日志记录的情况下运行：\n多田！我们已经模拟了。作为练习，试着只将工具变量更改为Modelsim、xsim或Edalize支持的任何其他模拟器，看看它是否可以在没有任何更改的情况下工作。", "note_en": "Edalize is a Python Library for interacting with EDA tools. It can create project files for supported tools and run them in batch or GUI mode (where supported).\n All EDA tools such as Icarus, Yosys, ModelSim, Vivado, Verilator, GHDL, Quartus etc get input HDL files (Verilog and VHDL) and some tool-specific files (constraint files, memory initialization files, IP description files etc). Together with the files, perhaps a couple of Verilog `defines, some top-level parameters/generics or some tool-specific options are set. Once the configuration is done, a simulation model, netlist or FPGA image is built, and in the case of simulations, the model is also executed, maybe with some extra run-time parameters.\n The thing is, all these tools are doing this in completely different ways and there&#39;s generally no way to import configurations from one simulator to another.\n Dread not! Edalize takes care of this for you. By telling Edalize what files you have, together with some info, what parametrization to use at compile- and run-time (e.g. plusargs, defines, generics, parameters), VPI library sources (when applicable) and any other tool-specific options not already mentioned, it will create the necessary project files and offer to build and run it for you.\n This will save you from having to deal with the boring stuff of interfacing the EDA tools yourself, while still have pretty much full power to set up the project the way you want.\n It allows you to quickly switch tools, at least when it comes to simulators. This is highly useful to shake out tool-specific bugs, or just to let you work with your weapon of choice.\n It can also be used to just get a quick template that you can open up in the tool&#39;s GUI if there is such, and continue working from there.\n It can be directly integrated as a library for your existing Python-powered HDL project, or can be used stand-alone (soon anyway) to feed Edalize from projects written in other languages.\n   Edalize is a Python module. Then once downloaded we can install it withfollowing Python command:\n     Assume we have a project that consists of a Verilog source file called  blinky.v.Then there&#39;s also a testbench called  blinky_tb.v and a constraints file for synthesis called  constraints.sdc.You can get those files from  blinky and for vlog_tb_utils.v in  orpsoc-cores.\n For a simulation, we want to use the two Verilog files, build it in a subdirectory called  build, and then run it with a parameter to control simulated clock frequency.\n Edalize is a Python tool, then we can run it inside a Python script file ordirectly in the Python console.\n      work_root = &#39;build&#39;files = [ {&#39;name&#39; : os.path.relpath(&#39;blinky.v&#39;, work_root), &#39;file_type&#39; : &#39;verilogSource&#39;}, {&#39;name&#39; : os.path.relpath(&#39;blinky_tb.v&#39;, work_root), &#39;file_type&#39; : &#39;verilogSource&#39;}, {&#39;name&#39; : os.path.relpath(&#39;vlog_tb_utils.v&#39;, work_root), &#39;file_type&#39; : &#39;verilogSource&#39;}]\n The design has a toplevel Verilog parameter with the name  clk_freq_hzthat accepts integers. We set its default value to  1000. The testbench alsohas an option to enable waveform dumping by setting a plusarg called  vcd:\n parameters = {&#39;clk_freq_hz&#39; : {&#39;datatype&#39; : &#39;int&#39;, &#39;default&#39; : 1000, &#39;paramtype&#39; : &#39;vlogparam&#39;}, &#39;vcd&#39; : {&#39;datatype&#39; : &#39;bool&#39;, &#39;paramtype&#39; : &#39;plusarg&#39;}}\n   And put it all into a single data structure together with some info about the toplevel and name for the project:\n edam = { &#39;files&#39; : files, &#39;name&#39; : &#39;blinky_project&#39;, &#39;parameters&#39; : parameters, &#39;toplevel&#39; : &#39;blinky_tb&#39;}\n     At this point, we still haven&#39;t run the actual EDA tool and the files in the  work_root directory can be used without Edalize if that is preferred. But let&#39;s continue the example with Edalize.\n   And finally run it, with our arguments. Some types of parameters (e.g. plusargs) are defined aat runtime, and at this point we can change their value by passing the name and new value to  run(). Or we could skip it altogether, and the default value from the configure stage would be used. Let&#39;s run with VCD logging enabled:\n  Tada! We have simulated. As an exercise, try to just change the tool variable to e.g. modelsim, xsim or any of the other simulators supported by Edalize and see if it works without any changes.", "posttime": "2020-08-04 20:27:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "eda,library,工具", "title": "一个接口EDA工具的抽象库", "title_en": "An abstraction library for interfacing EDA tools", "transed": 1, "url": "https://github.com/olofk/edalize", "via": "", "real_tags": ["eda", "library", "工具"]}]