[{"category": "", "categoryclass": "", "imagename": "c1f340a20cfeb04c674a10ce1a5c369e.jpg", "infoid": 1030559, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大疆有一个用于大疆RS2的3D对焦附件，允许您使用所谓的飞行时间技术，使用LiDAR自动对焦任何手动镜头。这项技术有一些限制，比如它不能自动对焦超过4米(22英尺)，因为在这个距离上没有足够的光子反弹，而且系统必须针对每个镜头进行校准。该系统也不能与没有硬停止的镜头一起工作。\n这个系统目前相当基础，是哑区AF，但这可能会随着时间的推移而改进。从测试和校准程序(在校准过程中检查两个距离)来看，以下焦点似乎在1米到4米之间工作得最好。万向节可以存储3个镜头的配置文件，因此您不必每次都重复校准。自动对焦是完全独立于相机操作的，镜头通过齿轮对焦，因此即使在相机关闭的情况下也能对焦，而且由于它使用LiDAR，它甚至可以在黑暗中对焦。大疆还制作了一个配件，为你的手动对焦镜头增加齿轮。\n3D Focus模块目前还没有上市，但它将在几周内推出，售价169美元，它需要Focus马达和RS2，但不是视频中使用的乌鸦眼无线发射器。如果您希望设置跟踪您，那么您将需要乌鸦眼无线发射器。这个系统还能让自动对焦较差的老式相机再次发挥作用，这是一个不错的奖励。\n此条目发布在“附件”中。为固定链接添加书签。Trackback已关闭，但您可以发表评论。", "note_en": "DJI has a 3D focus accessory for the  DJI RS 2 that allows you to autofocus any manual lens using LiDAR using what is called time of flight technology. The technology has a few limitations like it won’t autofocus beyond 4m (22ft) because there aren’t enough photons bouncing back at that distance and the system has to be calibrated for each lens. The system also won’t work with lenses that do not have a hard stop.\n The system is pretty basic at this time and it is dumb zone AF, but this might be improved with time. The follow focus seems to work best between 1m and 4m from testing and the calibration program, which checks two distances during calibration. The gimbal can store profiles for 3 lenses so you do not have to repeat calibration every time. AF is handled completely independently of the camera and the lens is focused via  gears so it will focus even with the camera off and since it uses LiDAR it will even focus in the dark. DJI also makes an accessory to  add gears to your manual focus lenses.\n The 3D focus module isn’t available yet, but it will be in a few weeks for $169 and it requires the  focus motors and RS2, but not the Ravens Eye wireless transmitter that was used in the video. If you want the setup to track you then you will need the Ravens Eye wireless transmitter. This system also makes older cameras with poor AF relevant again, which is a nice bonus.\n  This entry was posted in  Accessories . Bookmark the  permalink. Trackbacks are closed, but you can  post a comment.", "posttime": "2020-10-22 22:35:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "激光雷达,add,镜头", "title": "使用激光雷达将自动对焦添加到手动调焦镜头", "title_en": "Using Lidar to Add Autofocus to a Manual Focus Lens", "transed": 1, "url": "http://sonyaddict.com/2020/10/20/f-0-95-autofocus-on-any-camera-with-lidar/", "via": "", "real_tags": ["激光雷达", "add", "镜头"]}, {"category": "", "categoryclass": "", "imagename": "226909a987358eeeb00419f78440fdde.jpg", "infoid": 1030558, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1912年，纽约市一位名叫约瑟夫·W·琼斯(Joseph W.Jones)的发明家申请了一项“道路地图和里程表相结合”的专利，这可以说是今天仪表板GPS导航系统的先驱。\n琼斯的发明是为了一种复杂的设备(见上面画廊中的第一张幻灯片)，当汽车在两个特定点之间行驶时，它可以显示路线方向和地标。上面专利图中的圆盘描述了从曼哈顿的哥伦布环岛到康涅狄格州沃特伯里的路线。\n这只是锡拉丘兹大学麦克斯韦尔学院的地理学家马克·莫尼耶发现的300多项与地图有关的发明中的一项。莫莫尼尔的新书“专利和制图发明”对一个半世纪以来聪明和不那么聪明的想法及其背后的发明者进行了引人入胜的审视。这些专利涵盖从内部照明的地球仪到有轨电车换乘票再到复杂的地图折叠方案等方方面面。\nMonmonier说，专利通常被地图历史学家忽视，但它们揭示了人们多年来是如何使用地图的。他发现，就像许多发现和发明一样，类似想法的专利似乎在大约同一时间独立涌现-这种现象被称为多重发现理论。\n这就是20世纪初几项发明专利的情况，其中包括琼斯的设备，旨在帮助司机指路。当时，汽车刚刚开始流行，但良好的道路、像样的指示牌和准确的道路地图仍然很少。发明家们提出了各种各样的解决方案。“我认为他们中的一些人非常聪明，”莫莫尼尔说。\n1916年，宾夕法尼亚州波特斯敦的李·谢尔曼·查德威克(Lee Sherman Chadwick)申请了查德威克自动道路指南(Chadwick Automatic Road Guide)的专利，该指南使用一个连接到速度计上的旋转圆盘来帮助司机沿着预定的路线指路，这与琼斯的系统类似。但查德威克的发明可能是受到当时流行的播放器钢琴的启发，增加了警告声音来提醒司机即将到来的转弯或危险，并显示符号来指示前方是什么。\n曼哈顿的乔治·博伊登(George Boyden)早在近一个世纪前就预见到了GPS语音导航，他在1916年申请了一项“车辆信号系统”的专利，该系统包括一个留声机和一个扩音器(用上图中的数字22表示)，用来通知司机应遵循的方向。博伊登显然从未想过这个想法，尽管琼斯和查德威克曾短暂地制造和销售他们相互竞争的设备。\nMonmonier发现的许多专利都是不切实际的，有些是彻头彻尾的荒谬。受1957年Sputnik成功发射进入轨道的启发，几位发明家设计了有卫星环绕的机械地球仪。莫莫尼尔写道，其中最疯狂的想法是1963年的一项专利，“可能会让漫画家(鲁布)戈德堡挠头。”这项专利由宾夕法尼亚州布朗斯维尔的托马斯·诺瓦克(Thomas Novak)和弗兰克·诺瓦克(Frank Novak)兄弟获得，描述了一种带有旋转风管的静止地球仪，该风管将利用“向上的空气喷射”将围绕地球旋转的球体保持在高空(上图)。你不需要是一名工程师就知道这永远不会奏效。\nMonmonier从美国专利局记录中挖掘的304份申请中，有92份是关于地图折叠计划的。他指出，“彼得·潘”(Peter Pan)一书的作者詹姆斯·M·巴里(James M.Barrie)对重新折叠地图的挫折感进行了最好的描述。巴里在1889年写道：“在文明的诅咒中，突出的是‘方便口袋’折叠起来的地图。”除了合上地图，有些人几乎什么都能做。据计算，每年在他们面前谴责这些地图所浪费的精力，将在13周内建成埃菲尔铁塔。“。\nMonmonier说，地图折叠是一个很少受到历史学家关注的类别。这看起来可能很平凡，“但当涉及到让地图信息变得可访问时，如何折叠是非常重要的，”他说。\n从19世纪末到21世纪初，许多发明家用越来越复杂的方案解决了地图折叠问题。其中最有趣的想法之一是1925年由怀俄明州卡斯珀市的斯泰西·博耶(Stacy Boyer)申请专利的“折叠书地图”(Book Fold Map)。它花了9张图来解释这个方案，其中涉及到无数的折叠和切割，以形成一个手风琴折叠，将地图分割成48个面板。然后，这些嵌板将附着在封面上，就像一本书(图2)。9)。\n用户可以通过像书页一样从左到右翻阅面板，或者上下翻转来在地图上移动。莫莫尼耶发现了博耶和他的专利审查员之间的通信，在信中，审查员声称他曾试图根据博耶的图纸制作他的书的工作版本，但没有成功，得出的结论是“地图不起作用”。他要求发明家提交一个工作模型。\n莫莫尼尔对此很感兴趣，他试图自己做一个。即使对于一位著名的地图专家来说，这也是一场斗争，但最终他通过仔细研究图1和图9，进行规定的切割和折叠，并将地图贴到卡片上，从而能够对工作模型进行逆向工程(如果你想试一试，这是美国专利1,531,065)。总而言之，博耶花了27个月的修改和拒绝才最终让他的专利获得批准。\n通过搜索包括人口普查记录、报纸、政府雇佣记录、服兵役记录和城市名录在内的文件，莫莫尼尔得以洞察专利背后人的生活。\n他的书重点讲述了科罗拉多州的约翰·拜伦·柏拉图(John Byron Plato)的故事，他是一名高中毕业的奶农，拥有几项专利，包括一种阻止马带着马车逃跑的装置。他的与地图相关的专利是一种聪明的“时钟系统”，用于在没有常规街道编号系统的地区为农村住宅分配地址(上图)。\n正是出售牛的一次失败的尝试激发了柏拉图设计时钟系统的灵感。他安排了一些外地买家来科罗拉多州的布卢姆菲尔德乡村检查他的牛，但由于柏拉图唯一的地址是一个邮政信箱，他们去邮局打听去他的农场的路。店员不认识柏拉图，说他们需要等邮递员，邮递员要到第二天才会回来。买家恼火地离开了，正如柏拉图在1917年告诉“画报世界”杂志的那样，“这扼杀了一笔非常有利可图的交易。”\n与书中的大多数发明者不同，柏拉图成功地推销了他的时钟系统，将许可证卖给了纽约的几个县。他的生意似乎在大萧条期间倒闭了，但柏拉图却卷土重来。他成为华盛顿特区政府的地图专家，娶了一个比他小24岁的女人，为一个女童子军营地捐赠了50英亩的林地财产，并活到了89岁。\n莫莫尼尔对其中一些发明家生活细节的着迷，部分是受到了他自己一个有趣的传记细节的发现的启发：他的外祖父是一位发明家，拥有几项像牛奶瓶盖这样的东西的专利。Monmonier希望他书中的发明者和发明能激励其他对地图历史感兴趣的人更仔细地研究地图被忽视的这一方面。", "note_en": "In 1912 an inventor in New York City named Joseph W. Jones filed a patent for a “Combined Road-Map and Odometer” that is arguably the forerunner to today’s dashboard GPS navigation systems.\n Jones’ invention was for a complex apparatus (see first slide in gallery above) that would display route directions and landmarks as a car travels between two specific points. The disc in the patent drawing above describes the route from Columbus Circle in Manhattan to Waterbury, Connecticut.\n This is just one of the more than 300 map-related inventions uncovered by  Mark Monmonier, a geographer at Syracuse University’s  Maxwell School. Monmonier’s new book   Patents and Cartographic Inventions is a fascinating look at more than a century and a half of clever—and not-so-clever—ideas, and the inventors behind them. The patents cover everything from internally illuminated globes to streetcar transfer tickets to complicated map-folding schemes.\n Patents have generally been ignored by map historians, Monmonier says, but they reveal a lot about how people have used maps over the years. He found that like many discoveries and inventions, patents for similar ideas seemed to spring up independently around the same time—a phenomenon known as the theory of  multiple discoveries.\n   Such was the case for several patents for inventions, including Jones’ apparatus, intended to help drivers find their way around at the beginning of the 20th century. At the time,  automobiles were just starting to become popular, but good roads, decent signposting, and accurate road maps were still scarce. Inventors responded with a variety of solutions. “Some of them I think were extremely clever,” Monmonier says.\n The Chadwick Automatic Road Guide,  patented in 1916 by Lee Sherman Chadwick of Pottstown, Pennsylvania used a rotating disc connected to the speedometer to help drivers find their way along a predetermined route, similar to Jones’ system. But Chadwick’s invention, possibly inspired by the  player pianos that were popular at the time, added a warning sound to alert drivers of impending turns or hazards and displayed symbols to indicate what was ahead.\n Anticipating  GPS voice navigation by almost a century, George Boyden of Manhattan patented a “ Vehicle Signaling System” in 1916 that included a phonograph and a megaphone (indicated by number 22 in the drawing above) to announce directions for the driver to follow. Boyden apparently never developed the idea, though Jones and Chadwick briefly manufactured and marketed their competing devices.\n  Many of the patents Monmonier discovered were impractical and some were downright ridiculous. Several inventors inspired by  Sputnik’s successful launch into orbit in 1957 designed mechanical globes with satellites circling them. The wildest of these ideas was a 1963 patent that, Monmonier writes, “might have made made cartoonist  [Rube] Goldberg scratch his head.” The patent, by brothers Thomas and Frank Novak of Brownsville, Pennsylvania, described a stationary globe with a rotating air duct that would use an “upward air blast” to hold a sphere aloft as it orbited the Earth (above). You don’t need to be an engineer to know this would have never worked.\n  Ninety-two of the 304 filings Monmonier mined from  U.S. Patent Office records were for map-folding schemes. The frustration of refolding maps, he notes, is perhaps best described by  James M. Barrie, the author of “Peter Pan.” Barrie wrote in 1889: “Prominent among the curses of civilisation is the map that folds up ‘convenient for the pocket.’ There are men who can do almost anything except shut a map. It is calculated that the energy wasted yearly in denouncing these maps to their face would build the Eiffel Tower in thirteen weeks.”\n Map-folding is a category that has received scant attention from historians, Monmonier says. It may seem mundane, “but when it comes down to making map information accessible, how one folds is very important,” he says.\n  From the late 19th century into the early 21st century, a number of inventors tackled the problem of map folding with increasingly complex schemes. One of the most interesting ideas is a “ Book Fold Map” patented by Stacy Boyer of Casper, Wyoming in 1925. It took nine drawings to explain the scheme, which involved numerous folds and cuts to fashion an accordion fold partitioning a map into 48 panels. Those panels would then be attached to a cover, like a book (fig. 9 above).\n Users would move around the map by leafing through the panels like book pages from left to right, or by flipping them up and down. Monmonier found correspondence between Boyer and his  patent examiner in which the examiner claimed he had unsuccessfully tried to make a working version of Boyer’s book based on his drawings, concluding that the “map fails to function.” He asked the inventor to submit a working model.\n Intrigued, Monmonier attempted to make one himself. It was a struggle, even for a noted map expert, but eventually he was able to reverse engineer a working model by carefully studying figures 1 and 9, making the prescribed cuts and folds, and taping the map to a card (If you want to give it a go, it’s  US Patent 1,531,065). In all, it took Boyer 27 months of revisions and rejections to finally get his patent approved.\n   By scouring documents including census records, newspapers, government employment records, military service records, and city directories, Monmonier was able to gain insight into the lives of the people  behind the patents.\n His book highlights the story of John Byron Plato of Colorado, a high school-educated dairy farmer with several patents to his name, including a device to stop a horse from running away with a wagon attached to it. His map-related patent was for  a clever “clock system” for assigning addresses to rural residences in areas that lacked a regular street numbering system (above).\n It was a failed attempt to sell cattle that inspired Plato to devise the clock system. He had lined up some out-of-town buyers to come to rural Bloomfield, Colorado, to inspect his cattle, but since Plato’s only address was a P.O Box, they went to the post office to ask for directions to his farm. The clerk didn’t know Plato and said they would need to wait for the mail carrier, who would not return until the next day. Annoyed, the buyers left, and as Plato told the magazine   Illustrated World in 1917, “that killed a mighty profitable bargain.”\n Unlike most of the inventors in the book, Plato managed to successfully market his clock system, selling licenses to several counties in New York. His business appears to have foundered during the  Great Depression, but Plato bounced back. He became a map expert for the government in Washington D.C., married a woman 24 years his junior, donated 50 acres of woodland property for a Girl Scout camp, and lived to be 89.\n Monmonier’s fascination with the details of some of these inventors’ lives was partly inspired by the discovery of an interesting biographical detail of his own: His maternal grandfather was an inventor, with several patents for things like milk bottle caps. Monmonier hopes the inventors and inventions in his book will inspire others with an interest in map history to take a closer look at this neglected side of maps.", "posttime": "2020-10-22 22:34:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "获得,weirdest,地图", "title": "有史以来获得专利的最聪明、最古怪的地图想法(2017)", "title_en": "The Cleverest, Weirdest Mapping Ideas Ever Patented (2017)", "transed": 1, "url": "https://www.nationalgeographic.com/news/2017/08/maps-inventions-history-patents-monmonier-cartography/", "via": "", "real_tags": ["获得", "weirdest", "地图"]}, {"category": "", "categoryclass": "", "imagename": "22639abd7aecff3d0d1b8987017e21a9.png", "infoid": 1030557, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在x86裸机上运行单个围棋应用程序，完全用Go编写(只有少量的C和一些汇编语言)，支持围棋的大多数功能(如GC、Goroutine)和标准库，还附带一个可以运行大多数基于Net的库的网络堆栈。\nGo的运行时提供了一些基本的操作系统抽象。Goroutine对应于进程，通道对应于进程间通信。此外，围棋有自己的虚拟内存管理，因此在裸机上运行围棋程序的想法就诞生了。\n事实证明，得益于Go可控的内存布局、无需虚拟机直接翻译硬件指令的能力以及类似C的语法，Go具有操纵硬件资源的能力。这些都使围棋有可能编写在裸露金属上运行的程序，但也存在一些挑战。GO堆积了许多指令来执行协同程序调度和内存GC，这在某些地方带来了一些无法重入的麻烦，比如中断处理和系统调用。\n一般来说，使用围棋操作硬件是一种乐趣。一方面，它让我对围棋的运行时间有了深刻的了解。另一方面，除了C语言之外，它还提供了在裸机上编写操作系统内核的尝试。\n首先您需要安装gdb，如果您使用的是MacOS，请执行以下命令。\n首先执行make qemu-debug命令让QEMU启动gdb服务器，然后使用vscode的debug功能启动调试会话。Vscode的调试配置文件内置于项目中。\n如果您希望eggos在裸机上运行，建议使用GRUB作为引导加载程序。\n执行make命令后生成的multiboot.elf是符合multiboot规范的内核映像，可以被GRUB直接识别并在裸机上引导。示例配置文件引用boot/grub.cfg。\n该程序仍然有很多错误，并且经常失去响应或恐慌。如果您愿意投稿，请提交公关，谢谢！\n我小女儿的出生给这个家庭带来了很多欢乐。这个项目是以她的名字小丹丹命名的。我的妻子和母亲也给了我很大的支持，让我在业余时间更新这个项目。❤️", "note_en": "Run a single Go applications on x86 bare metal, written entirely in Go (only a small amount of C and some assembly), support most features of Go (like GC, goroutine) and standard libraries, also come with a network stack that can run most  net based libraries.\n  Go&#39;s runtime provides some basic operating system abstractions. Goroutine corresponds to processes and channel corresponds to inter-process communication. In addition, go has its own virtual memory management, so the idea of running Go programs on bare metal was born.\n It turns out that Go has the ability to manipulate hardware resources, thanks to Go&#39;s controllable memory layout, the ability to directly translate hardware instructions without a virtual machine, and C-like syntax. These all make it possible for Go to write programs that run on bare metal.However, there are also some challenges. Go piling in many instructions to perform coroutine scheduling and memory GC, which brings some troubles in some places that cannot be reentrant, such as interrupt handling and system calls.\n In general, using Go to operate hardware is a pleasure. On the one hand, it gave me a deep understanding of Go&#39;s runtime. On the other hand, it also provided an attempt to write the operating system kernel on bare metal in addition to the C language.\n               First you need to install gdb, if you are under macos, execute the following command\n   First execute the  make qemu-debug command to let qemu start the gdb server, and then use the debug function of vscode to start a debug session. The debug configuration file of vscode is built into the project.\n    If you want eggos to run on bare metal, it is recommended to use grub as the bootloader.\n The multiboot.elf generated after executing the make command is a kernel image conforming to the multiboot specification, which can be directly recognized by grub and booted on a bare metal. The sample configuration file refer to  boot/grub.cfg\n      The program still has a lot of bugs, and often loses response or panic. If you are willing to contribute, please submit a PR, thank you!\n  The birth of my little daughter brought a lot of joy to the family. This project was named after her name  xiao dan dan. My wife and mother also gave me a lot of support and let me update this project in my spare time.  ❤️  ❤️  ❤️", "posttime": "2020-10-22 22:34:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "运行,running,围棋", "title": "在x86裸机上运行的GO单核", "title_en": "A Go unikernel running on x86 bare metal", "transed": 1, "url": "https://github.com/icexin/eggos", "via": "", "real_tags": ["运行", "running", "围棋"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1030556, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "直到最近，我还一直使用Ansible来管理这台机器(或机器)。我想要在该机器上进行配置管理，这样，如果某个磁盘、VM或整个主机提供商消失，我会有一个神奇的按钮，可以从无到有开始重建，抓起一杯咖啡，然后让一切恢复原样。我想要Ansible来完成这项任务，因为它相当容易和容易接近，只需要从主机系统访问SSH就可以了，而且是用Python编写的。不像Pupet、Chef、CFEngine和SaltStack-或者我是这么认为的--我想要Ansible来完成这项任务，只需要从主机系统访问SSH就可以了，而且是用Python编写的。不像Pupet、Chef、CFEngine和SaltStack-或者我是这么认为的。\n随着使用Ansible的时间的推移，我注意到当我对剧本进行更改时，我反复面临着相同的挑战：要么我运行整个剧本并等待许多事实上的无操作任务，要么我投资于使用标签进行注释，节省了一些运行时间，但需要解决标签在Ansible中存在的缺点。\nAnsible中的标记有两个困扰我的问题。首先，您需要手动将相同的标记传播到所有依赖项任务，特别是在When-Condition中引用的任务，否则您将遇到未定义变量的问题，因为应注册该变量的任务尚未执行。因此，这是我必须手动处理的问题。\n其次，标签和循环在Ansible中不能很好地协同工作。我想做的是将迭代项用作标签，如下所示：\n-hosts：所有任务：-name：安装发行版软件包Package：name：&#34；{{item}}&#34；state：Present with_list：-git-htop标记：#NOTE NOT WORK！#GETS OUT OUT：ERROR！&#39；Item&#39；未定义-&#34；{{Item}}&#34；\n不幸的是，这会导致错误！&#39；项目&#39；未定义，因为标签不支持Ansible中那样的循环。撇开引入新变量不谈，从概念上讲，我唯一的选择是将项目列表复制到标签中：\n-hosts：所有任务：-name：安装发行版软件包：name：&#34；{{item}}&#34；state：Present with_list：-git-htop标记：#works，但不是Cool-git-htop。\n如果我现在请求这些标记中的任何一个，我也需要允许整个循环运行，这意味着在没有任何附加值的情况下等待。我正在请求Ansible安装大约20个软件包，所以这里在运行时会有相当大的浪费。\n我不想在大多数时间里解决标签的这些缺点，所以我在那段时间里开始了多任务处理，执行了整个剧本，当有结果的时候，我又回到了它的位置上。\n然而，我很难接受另一件事：当我连续两次运行剧本时，对于第二次运行，Ansible将需要大约4分钟的时间来确认所有的工作都已经完成。为什么？我必须接受它是那么慢吗？\n所以我开始寻找提高Ansible速度的方法，以及SSH流水线，禁用事实收集，Mitgen有所帮助，但不会使运行时间低于3分钟，所以我不是很高兴。顺便说一句，Mitogen在撰写本文时不支持Ansible&gt；=2.10，因此速度的提高将以在过去使用Ansible 2.9的时间更长为代价，这也不是很理想。(这也不是很理想)。\n所以我接受了3分钟作为该攻略的最短运行时间，并开始考虑到其他地方寻找。\n也许Salt有办法摆脱那些奴才、主人、守护程序和代理，这些似乎是我几年前在上一份工作中与SaltStack做过的事情。让我高兴的是，这一次我确实发现了salssh。saltssh是在2013-09-26发布的Salt 0.17.0中引入的，它实际上并不是新的。\n我可以把我现有的Ansible攻略移植到Salt-ssh上吗？它会有趣并且工作得很好吗？当它实际上不需要做任何事情的时候，它会比3分钟更快吗？\n为基于Caddy的SSL反向代理创建特定的Docker网络以与网站容器对话。\n配置并激活DNF-Automatic，以便在Tracer检测到需要时自动更新软件包、重新启动过时的服务并重新启动虚拟机\n调整systemd解析的配置以不再向世界公开LLMNR端口5355，而无需。\n通过调整内核命令行并重新创建GRUB配置以使更改生效，将Docker的cgroup降级为v1。\n克隆一些包含docker-compose网站项目的Git存储库，并使它们与上游保持最新。\n启动多个基于docker-compose的服务，并在其底层Git克隆更改时让它们进行重建和重新启动。\n我开始阅读官方的无代理Salt：入门指南，但很快就卡住了。我想以非特权用户的身份执行，但是尽管详细遵守了教程，我还是收到了无法写入/var/cache/的错误-出于很好的原因-如下所示：\n#salt-ssh&#39；*&#39；test.ping[错误]无法呈现花名册文件：traceback(最近一次调用)：[..]。权限错误：[错误13]权限被拒绝：&#39；/var/cache/salt/master/roots/mtime_map&#39；\n虽然文档使用的是绝对路径，如/home/volant/salt-ssh/Everywhere，但我希望在任何地方都能与Git存储库一起使用的相对路径，更不用说教程中的log_file需要是ssh_log_file。\n过了一段时间之后，所有这些都解决了，这个最小的设置就满足了所有这些要求：以非特权用户身份执行、在root_dir：.帮助下的相对路径、通过state_output_diff：true显著降低噪音的输出，以及开始添加类似剧本的内容的位置。鸟瞰：\n#树。├──Master├──Column│：├──data.sls│：└──top.sls├──花名册├──SALT│：└──setup.sls└──saltfile。\n有了它作为基础，我现在可以将剧本移植到一个新文件salt/setup.sls中。\n例如，让调整Open SSH服务器配置以了解我的公钥(我将存储在salt/ssh/files/Authorized-key-root.txt)，禁用基于密码的登录(以防止暴力登录尝试)，并确保服务器使用调整后的配置：\nSsh-daemon：#为根ssh_auth.Present设置SSH公钥：-user：root-source：salt：//ssh/files/Authorized-key-root.txt#禁用基于密码的SSH文件登录。keyvalue：-name：/etc/ssh/sshd_config-key：PasswordAuthentication-value：&#34；no&#34；-分隔符：&#34；&#34；-unComment：&#34；#&#34；-要求：-ssh_auth：ssh-daemon#重新启动sshd服务以应用配置服务中的更改。运行：-name：sshd-reload：true-watch：-file：ssh-daemon。\n#sal.ssh&#39；*&#39；test.ping#salt-ssh&#39；*&#39；grains.item#salt-ssh&#39；*&#39；state.Apply setup test=True#salt-ssh&#39；*&#39；state.Apply setup。\n我大概花了一天半的时间把整本剧本搬到盐湖，并对结果充满信心。它给我带来了什么？\n显著缩短运行时间：从使用Ansible的3-4分钟降至使用salt-ssh的约1分钟。\n在状态依赖关系和执行顺序方面有更大的灵活性(但也有一定的责任\n能够在攻略(状态文件)中正确使用JJJA模板，这与Ansible不同。\n我认为这是公平的说，我现在认为我自己是一个盐-ssh的皈依者：新的设置不再是我所能接受的，而是salt-ssh。\n我真正希望的是SaltStack在修复错误方面做得更好。我在3001.1版本中遇到的所有问题和限制都与我认为足够主流的功能有关，考虑到社区的规模，我甚至不应该看到这些功能。\n我希望这些不是SaltStack结构性问题的迹象。VMware在2020年9月收购了SaltStack，所以我希望这会是最好的结果。一旦我确信我不会浪费时间，我很高兴能帮上忙。\n有关使用Salt-ssh取代Ansible的更多信息，您可能会对Duncan Mac-Vicar P.；的文章“像Ansible一样使用Salt”感兴趣。", "note_en": "There is this machine (or &#34;box&#34;) that I used to manage using Ansibleuntil recently.I wanted configuration management on thatbox so that if ever disk or VM or the entire hosting provider would go away,I would have a magic button to start a rebuild from nothing,grab a coffee, and have things work the same again.I wanted Ansible for that task becauseit&#39;s fairly easy and approachable,requires nothing but working SSH access from the host system,and is written in Python.Unlike Puppet, Chef, CFEngine and SaltStack — or so I thought.\n Over time using Ansible I noticed that when I made changes to a playbookI was repeatedly facing the same challenge:Either I run the whole playbook and wait for many de-facto no-op tasks or I invest in annotation with tags, save some runtimebut need to deal with the shortcomings that tags have in Ansible.\n  Tags in Ansible have two problems that bug me.First, you&#39;ll need to manually propagate the same tag to all dependency tasks,especially those referenced in  when-conditionalsor else you&#39;ll run into undefined-variable issuesbecause the task due to  register that variable has not been executed.So that&#39;s something I would have to take good care of manually.\n Secondly,tags and  loopsdo not work well together in Ansible.What I  would like to do is use the iteration item as a tag like this:\n -  hosts :  all  tasks :  -  name :  Install distro packages  package :  name :  &#34;{{   item   }}&#34;  state :  present  with_list :  -  git  -  htop  tags :  # NOTE Does not work!  # Gets us: ERROR! &#39;item&#39; is undefined  -  &#34;{{   item   }}&#34;\n Unfortunately, this gets me  ERROR! &#39;item&#39; is undefined becausetags do not support loops like that in Ansible.Leaving aside the introduction of a new variable,conceptually my only option is to duplicate the items list into  tags:\n -  hosts :  all  tasks :  -  name :  Install distro packages  package :  name :  &#34;{{   item   }}&#34;  state :  present  with_list :  -  git  -  htop  tags :  # Works, but not cool  -  git  -  htop\n I&#39;ll also need to be okay with  the whole loop being run if I ask for anyof those tags now, which means waiting without any added value.I&#39;m asking Ansible for ~20 packages to be installed sothere is quite a bit of waste in runtime here.\n I didn&#39;t feel like I wanted to deal with these shortcomings of tagsmost of the time so I instead started multi-tasking during that time,ran the whole playbook, and got back to it when there were results.\n It was hard to accept one other thing though:When I ran the playbook two times in a row, for the second runAnsible would take about 4 minutes to do nothing but confirmingthat all the work was already done. Why?Would I have to accept that it was that slow?\n  So I started looking for ways to improve Ansible speed, and SSH pipelining,disabling fact gathering,and  Mitogenhelped but wouldn&#39;t get runtime below 3 minutes, so I was not very happy.On a sidenote Mitogen doesn&#39;t support Ansible &gt;=2.10as of this writing so that boost in speedwould come at the cost of being stuck with Ansible 2.9 in the past for longer,which is not ideal either.\n So I accepted 3 minutes as the minimum runtime of that playbook.And started wondering about looking elsewhere.\n  Maybe Salt had some way without all those minions, masters, daemons, agentsthat seemed like a given to mewhen I last had a few bits to do with SaltStackat a previous job a few years ago.To me delight, I did find salt-ssh this time.salt-ssh was introduced with the release of Salt 0.17.0 on 2013-09-26, it&#39;s not actually new.\n  Can I port my existing Ansible playbook to salt-ssh,will it be fun and work well, andwill it be faster than 3 minutes for when it doesn&#39;t actually need to do anything?\n    Create a specific Docker network for a  Caddy-based SSL reverse proxy to talk to website containers\n Configures and activates dnf-automatic so that it updates packages by itself, restarts outdated services and reboots the VM when  tracer detects need to\n Adjusts systemd-resolved config to no longer expose LLMNR port 5355 to the world without need to\n   Downgrade cgroup to v1 for Docker by adjusting the kernel command line and re-creating the GRUB config for the change to have actual effect\n   Clone some Git repositories containing docker-compose website projects and keep them up to date with upstream\n Spin up multiple docker-compose based service and have them do rebuilds and restarts whenever their underlying Git clone changed\n   I started making my way through the official Agentless Salt: Get Started Tutorialand got stuck quickly.I wanted execution as an unprivileged user butdespite obeying the tutorial in detailI got errors about not being able to write to  /var/cache/ — for good reasons — like these:\n # salt-ssh  &#39;*&#39; test.ping [ERROR ] Unable to render roster file: Traceback (most recent call last): [..] PermissionError: [Errno 13] Permission denied: &#39;/var/cache/salt/master/roots/mtime_map&#39;\n And while the docs used absolute paths like  /home/vagrant/salt-ssh/ everywhere,I wanted relative paths that would work with a Git repository checked out anywhere.Not to mention that  log_file needs to be  ssh_log_filein the tutorial.\n So with all of that figured out after a while, this  minimal setup satisfied all of that:execution as an unprivileged user,relative paths with the help of  root_dir: .,significantly less noisy output through  state_output_diff: True,and a place to start adding playbook-like things to. For a bird&#39;s eye view:\n # tree . ├── master ├── pillar │   ├── data.sls │   └── top.sls ├── roster ├── salt │   └── setup.sls └── Saltfile\n          With that as a base I can now port the playbook over in a new file  salt/setup.sls.\n For example, let&#39;s adjust the Open SSH server configto know my public key (that I&#39;ll store at  salt/ssh/files/authorized-keys-root.txt),to disable password-based log-in (to protect against brute-force log-in attempts)and be sure that the server makes use of the adjusted configuration:\n ssh-daemon :  # Set SSH public keys for root  ssh_auth.present :  -  user :  root  -  source :  salt://ssh/files/authorized-keys-root.txt  # Disable password-based log-ins to SSH  file.keyvalue :  -  name :  /etc/ssh/sshd_config  -  key :  PasswordAuthentication  -  value :  &#34;no&#34;  -  separator :  &#34;   &#34;  -  uncomment :  &#34;#&#34;  -  require :  -  ssh_auth :  ssh-daemon  # Restart sshd service to apply changes in configuration  service.running :  -  name :  sshd  -  reload :  True  -  watch :  -  file :  ssh-daemon\n   # salt-ssh  &#39;*&#39; test.ping # salt-ssh  &#39;*&#39; grains.items # salt-ssh  &#39;*&#39; state.apply setup  test =True # salt-ssh  &#39;*&#39; state.apply setup\n It took me maybe one and a half day to port the whole playbook to salt-sshand be confident with the result. What did it get me?\n Significant reduction of runtime: Down from 3-4 minutes with Ansible to about 1 minute with salt-ssh\n   More flexibility (but also some duty) with regard to state dependencies and order of execution\n Being able to use Jinja templating right in the playbook (&#34;state file&#34;) unlike with Ansible\n I think it&#39;s fair to sayI consider myself an salt-ssh convert by now:new setups won&#39;t be Ansible with me anymore, but salt-ssh.\n What I do hope is that SaltStack gets better at fixing bugs.All the hiccups and limitations I ran into with version 3001.1were related to features that I consider mainstream enough thatI shouldn&#39;t even have seen them, given the size of the community.\n   I hope those are not a sign of structural issues with SaltStack. VMWare bought SaltStack in September 2020so I&#39;m hoping that it turns out for the best.I&#39;m happy to help out with pull request once I&#39;m convinced that I won&#39;t be wasting my time.\n For more about using salt-ssh to replace Ansible, maybeDuncan Mac-Vicar P.&#39;s article &#34; Using Salt like Ansible&#34;is of interest to you.", "posttime": "2020-10-22 22:34:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "替换,ansible,ssh", "title": "用saltssh替换ansible", "title_en": "Replacing Ansible with salt-ssh", "transed": 1, "url": "https://blog.hartwork.org/posts/replacing-ansible-with-salt-ssh-for-speed-and-for-good/", "via": "", "real_tags": ["替换", "ansible", "ssh"]}, {"category": "", "categoryclass": "", "imagename": "66677dbb1fb90331051acf350be81b57.png", "infoid": 1030555, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有一件事真正提高了我的工作效率(也让我头脑清醒)，那就是学会了如何接受一项大任务，并将其分解成更小、更容易管理的步骤。大任务可能会令人恐惧和不堪重负，但如果我只是继续做小任务的清单，那么不知何故，就像变魔术一样，大任务完成了。\n在编程时，我对这种分解采取了非常具体的方法。我确保每个步骤都是编译、运行、通过所有测试并为代码库增加价值的步骤。确切地说，“增加价值”的意思是故意保持模糊的，但它可以是添加一个小功能，修复一个错误，或者朝着将代码重构为更好的形状迈出一步(即，减少技术债务)。\n没有增加价值的一个例子是添加了一个新功能，但也引入了十个新的bug。目前还不清楚这一功能的价值是否超过了漏洞的成本，因此可能是净亏损。\n另一个没有增值的例子是让UI更美观，但也让应用程序的运行速度降低了10倍。再说一次，还不清楚更漂亮的外观是否值得性能上的打击，所以这可能是一个净损失。\n当然，我不能总是确信我没有引入bug，而且“值”本身就是主观的(新特性的性能值有多高)。重要的部分是意图。我的意图是始终通过每一次提交来增加价值。\n基本上，我想要避免的是“必须先变得更糟，然后才会变得更好”的态度。也被称为：“新系统是做这件事的现代方式。当然，它现在有一些漏洞，运行速度有点慢，但一旦我们修复了这一点，它将比以前好得多。“。我见过太多的案例，这些所谓的修复从来没有发生过，而新的系统本来应该更好，但只会让事情变得更糟。\n另外，你知道，增加价值的感觉很好。如果我每天都能做出承诺，而这个承诺在某种程度上让引擎变得更好，那我就会很高兴。\n除了通过一系列小提交实现更改之外，我还将这些小提交中的每一个都推回主分支。\n请注意，这与功能分支工作流正好相反，相反，它是一种基于干线的开发形式：\n在功能分支工作流中，开发人员在独立的、独立的代码分支中处理新功能，并且在它们“完成”之前不会将它们合并回主功能：完全工作、调试、记录、代码审查等。\n在基于主干的方法中，功能被实现为对主分支本身的一系列小的个体提交。必须小心，以便即使在功能仅“部分实现”的情况下也能正常工作：\n功能分支方法的支持者声称，这是一种更安全的工作方式，因为对功能分支的更改不会扰乱主程序并导致错误。就我个人而言，我认为这种安全性是虚幻的，特性分支中的bug只是被隐藏起来，直到它被合并回master，这时我们突然得到了所有的bug。\n特性分支也违背了我的理念，即每次提交都应该增加价值。功能分支背后的整个想法是：“我们会在这里打破一堆狗屎，但别担心，我们会在合并回主站之前把它修好的。”最好一开始就不要弄坏东西。\n合并冲突更少。随着功能分支的长时间运行，分支中的代码会越来越远离master中的代码，导致越来越多的合并冲突。处理这些对于程序员来说是一项非常忙碌的工作，而且还有引入错误的风险。其中一些错误在分支合并之前是看不到的。\n减少了释放日的混乱。通常，为某个版本安排的所有功能都有相同的截止日期。这会导致所有功能分支恰好在截止日期之前合并。这意味着就在发布日期之前，我们同时得到了所有的合并和集成错误。同时得到很多错误比让它们均匀分布要糟糕得多。而在发布日期前拿到它们绝对是最糟糕的时机。\n不用担心合并的合适时机。因为每个人都知道合并一个功能分支往往会导致不稳定，这会导致人们担心合并的“合适时机”。您希望避免在发布之前进行合并(除非该功能是发布所必需的)，以避免在发布中引入错误。那么也许就在发布之后？但是如果我们需要一个补丁来发布呢？在进行合并的同时，程序员宝贵的时间也被浪费了。\n不急于合并。在处理功能分支时，我经常感到急于合并分支。有时是因为特定版本需要分支。但也经常是因为开发人员厌倦了处理合并冲突，想要结束它，然后转到下一件事上。因此，仅在功能分支“完成”时才合并它们的目标经常会受到影响。(当然，没有什么是真正“完整”的。)。\n更容易还原。如果在功能分支合并后发现重大问题(通常会发生)，通常会有很多人不愿意恢复合并。另一个大的功能分支可能已经在其上面合并了(因为很多功能分支经常同时合并，就在发布之前)，恢复它会导致完全的合并混乱。因此，团队必须在发布之前拼命修复问题，而不是冷静、明智地回滚。使用基于主干的开发，很可能已经发现了任何重大问题。使新特性“上线”的最终提交通常是一个简单的单行更改，恢复起来很容易。\n部分工作是共享的。在基于主干的开发中，所有开发人员(在主分支中)都可以看到在特性上所做的部分工作。因此，每个人都对发动机的去向了如指掌。错误、设计缺陷和其他问题可以及早发现。其他人也更容易修改他们的代码来使用新功能。当每个人都能看到它已经进展到什么程度时，也更容易估计完成一项功能需要做多少工作。\n稍后更容易暂停和接听。有时，由于各种原因，某个功能的工作可能不得不暂停。可能还有更关键的问题需要解决。或者该功能的主要开发人员可能会生病，或者即将休假。对于功能分支来说，这是一个问题，因为随着代码库漂移得越来越远，它们往往会随着时间的推移而“腐烂”，从而导致越来越多的与分支的合并冲突。签入到MASTER中的代码不会以同样的方式“腐烂”。\n更容易同时解决其他错误/重构。在处理特性或问题时，经常会发现您正在做的工作暴露出的其他相关问题。在基于主干的方法中，这不是问题。您只需向主干提交一个或多个单独的命令即可解决这些问题。使用功能分支方法，就会更加棘手。我想正确的做法应该是从master中分离出一个新的单独的bug修复分支，修复该分支中的问题，将该分支合并到您当前正在处理的分支中，然后(一旦通过代码审查)合并到master中(这样其他人就可以在合并您的功能分支之前获得bug修复，因为谁知道什么时候会发生这种情况)。但是谁有时间做这些狗屎呢？取而代之的是，人们只需在功能分支中修复问题，如果他们今天过得不错，也许可以将其挑选到主功能中。因此，现在，特性分支不再是单个孤立的特性，而是不同特性、错误修复和重构的混杂在一起。\n基于主干的方法的主要挑战是如何将大任务分解为单独的任务。特别是要求每件作品都要编译好、运行好、增值好，随时可以推入大师手中。我们如何才能推送部分工作，而不会让用户接触到不成熟、还没有完全工作的功能呢？\n适用于新功能的一种方法是使用标志来控制功能对最终用户是否可见。\n让我们看一个例子。我最近添加到引擎中的一个功能是一个下载选项卡，它允许用户从引擎内部下载新的引擎版本和示例项目：\n有很多不同的方法可以将其分解为更小的步骤。这里有一个例子：\n将下载选项卡添加到菜单中，并在打开时显示一个新的空白选项卡。\n通常情况下，我不会像这样预先做一个全面的分析。取而代之的是，我只是边走边想出下一个合乎逻辑的步骤。我只有在任务特别棘手的情况下才会坐下来认真地做计划，而且像这样的增量步骤不是自然而然的。\n为了防止最终用户在选项卡实际工作之前看到它，我将其隐藏在一面旗帜后面。这可以简单到如下所示：\n要获得显示下载选项卡的菜单选项，必须将download_tab_enabledflag更改为true并重新编译。\n我们称这些标志为功能标志，因为它们选择性地启用或禁用应用程序的各个功能。一旦功能完成，我们就可以删除该标志，只留下真正的代码路径。\n通过从配置文件、菜单选项或内部调试控制台初始化的动态布尔变量。\n在这些选择中，我认为第三个是最好的。您希望向尽可能多的人公开您的新代码。这样，他们就可以发现你代码中的错误，如果他们重构了代码库，他们就会把你的代码考虑在内，等等。\n如果您使用#DEFINE标志，您团队中的其他人甚至不会编译您的代码。因此，它们的某个更改很容易破坏您的代码。常量标志更好，因为您的代码仍将被编译，但是由于人们不能在不重新编译您的代码的情况下尝试新功能，所以大多数人不会费心。\n有了动态标志，不想为应用程序重建而烦恼的艺术家、制作人或最终用户只需修改配置文件，然后对您的新功能进行测试运行即可。\n到了发布特性的时候，您只需将特性标志的默认值从false反转为true，每个人都会看到新特性。如果有问题，您需要恢复，您只需将旗帜翻转回来。稍后，当特性看起来稳定时，您可以去掉标志，只保留代码中的真实路径。\n您甚至可以进行部分、分阶段的推出。例如，您可以将1%的用户的标志设置为true，然后在监控崩溃日志和论坛中的任何问题的同时缓慢增加该标志。这样，如果遇到问题，只会影响一小部分用户，您可以快速恢复。\n上述方法适用于新功能，但是如果您主要是重写现有系统，您应该怎么做呢？\n在这种情况下，可能更难找到一种逐步递增的方法，因为您可能需要拆除旧系统的大部分，并且需要一段时间才能使替换的代码缓存具有相同的功能。\n在这种情况下，使用功能分支方法可能很有诱惑力，但同样，我认为这不是正确的策略。一个大问题是你会有两个相互冲突的目标。一方面，您希望尽早合并，这样人们就可以看到改进后的代码，而您可以对重写代码进行一些测试；另一方面，您希望尽可能地推迟合并，这样您就可以达到特性一致性并消除所有错误。通常情况下，这两者的结合并不令人满意。\n更好的方法是进行并行实现，让引擎拥有同一系统的两个副本。\n如果您正在进行大修，您可以从只将整个系统代码复制到新文件夹开始。如果您要从头开始重写，您可以从一个空文件夹开始。\n根据您要更换的系统的性质，您可以让两个系统(旧系统和新系统)并行运行，也可以有一个功能标志来选择哪个系统应该是默认系统。例如，如果要重写物理模拟，可能需要一个标志来选择是使用旧的还是使用新的，因为您希望所有物理对象都位于同一模拟中(否则它们不会交互)。另一方面，如果您正在重写粒子效果系统，您可能会同时运行两个系统，并且只需为每个播放的效果选择在旧系统还是新系统中播放。\n拥有并行实现可以让您更顺利地从旧系统过渡到新系统。团队中的每个人都可以很容易地测试新系统。您可以将其与旧系统进行功能完整性、稳定性、性能等方面的比较。如果适用，您甚至可以运行自动测试来验证新系统产生的输出是否与旧系统完全相同。一旦彻底验证了新系统，您就可以更改标志并开始将其用作默认值。\n并行实现还为最终用户提供了更为温和的升级途径。您可以只将系统选择标志暴露给最终用户，而不是将每个人都绑定到相同的“合并日期”。渴望在新系统中试用改进功能的用户可以提前打开旗帜，而喜欢稳定性或依赖旧系统某些怪癖的用户可以决定继续使用它，即使在新系统成为默认系统之后也是如此。\n而且，一旦新系统成为默认系统，就不会立即急于淘汰旧系统，一旦维护它的负担超过了保留它的价值，你最终可以反对并逐步淘汰它。\n对于我们的最后一个问题，让我们考虑一些更棘手的问题-对整个代码库进行重大重构更改。可能是这样的：\n更改常用类型，例如从std：：string类型切换到内部字符串类型。\n它们往往会触及大量代码，从而增加合并冲突的风险。\n要了解如何渐进地完成它们通常是很棘手的。例如，如果更改函数的参数，则必须更新所有调用点。否则，代码根本无法编译。\n在某些情况下，如何逐步解决问题可能相当简单。例如，当我们添加一个新的警告(如-WShadow)时，当编译没有警告的代码时，我们为使带有警告的协反编译所做的修复不会导致任何问题。因此，我们只需打开警告，修复我们收到的一大堆错误(无论多少错误都会进行适当大小的提交)，再次关闭警告，然后提交结果。冲洗并重复，直到所有警告都已修复，然后执行最后一次提交，将-Wdow标志打开为Everybody。\n在其他情况下，我们可以采用并行实现策略。假设我们有一个在整个代码中用于分配内存的函数：\n现在我们要添加一个系统参数，以便可以将所有内存分配标记为属于特定系统(游戏、图形、声音、动画等)：\n如果我们像这样添加参数，直到我们修复了所有调用点，代码才会编译。也就是说，渐进式的方法不会奏效。\n现在，我们可以增量地将所有代码转换为使用mem_alloc_new()，而不是mem_alloc()。一旦我们转换了所有代码，就可以删除mem_alloc()，然后执行全局搜索并替换，将mem_alloc_new()重命名为mem_alloc()→mem_alloc()。\n最后一个挑战是最棘手的挑战之一--改变代码库中的一个基本类型。\n事实上，我最近与此发生了冲突，这就是促使我写整篇博客文章的原因。在我的例子中，我想重构我们的代码库，引入一种新的类型来表示Truth中的对象的ID。这是我们在机器上的主要数据存储。编辑器处理的所有数据都存储在Truth中，Truth中的每个对象都由其ID引用。\n我们过去只用uint64_t来表示Truth ID，但是因为我们有很多其他的值也由uint64_ts来表示，这就造成了越来越多的混乱。为了更好地记录Truth ID的预期位置，以及防止传递其他uint64_t值的一些类型安全性，我们决定从使用普通uint64_t切换到将其包装在struct中：\n请注意，由于到处都使用Truth ID，因此此更改会影响代码中的数千行。\n有点傲慢的是，我仍然开始将这种重构作为一次集中的推动。我知道我应该循序渐进，这就是这篇博客的全部意义所在，但有时我会搞砸。\n当我工作的时候，我意识到这个变化比我原来想象的要大得多，我不可能一下子就能完成它。我开始有一种情绪低落的感觉，觉得事情正在失控。我更改了数千行代码。我真的确定我没有在任何地方引入打字错误吗？\n取而代之？运行一些测试会增加我的信心，但是因为代码只有在我修复了所有东西之后才会编译，所以我不能运行任何测试。\n然后，我开始与其他人的更改发生合并冲突，我必须手动解决这些冲突，希望我对他们的代码理解得足够好，不会破坏任何东西。描绘所有这些变化的后果变得越来越难。我引入了多少个错误？\n在过去，我经常试图通过“强力克服”来应对这些“恐慌”情绪。开始进行长时间的深夜编码会议，试图摆脱这件正在我掌控中的事情。在其他人有机会推送任何东西之前，让我的所有更改生效，这样我就不必处理合并冲突了。(当然，这仅仅意味着他们必须改为处理合并冲突。哈哈！)。\n但这几天我可能更聪明了一点？我意识到，这些感觉是一个迹象，表明我已经吃了太多东西，正确的反应不是向前推进，而是后退一步，反思并尝试重新阐述问题，这样就可以通过一系列较小的步骤来解决问题。根据我给自己带来了多大的麻烦，我可能能够挽救一些更改，也可能干脆把它们全部扔掉，用迭代的方法重新开始。即使当我不得不扔掉所有东西的时候，我也从来没有后悔过。最后，在一系列小的、可控的步骤中工作效率要高得多，以至于我觉得我总是能找回我“失去的”时间。\n回到手头的问题上来。我知道我想逐步改变类型。也就是说，在一些文件中更改它，而不是在其他文件中更改，并且仍然能够编译和测试代码。但是，当一切都依赖于其他一切的时候，我怎么可能做到这一点呢？一旦我将一些参数更改为使用tm_tt_id_t，任何使用uint64_t调用它的操作都将产生错误。\n我的主要见解是，这种情况与Enabling-Wdow非常相似。这种转换很容易完成，因为我们将代码从仅在-WNO-SHADOW下编译改为在-WNO-SHADOW和-WNO-SHADOW下编译。我们可以递增地进行此更改，直到我们最终准备好打开-wdow。\n让我们在这里做同样的事情。我们将ID对象的类型称为ID_TYPE。现在，我们的代码在ID_TYPE为uint64_t时进行编译。我们的目标是重写该代码，以便在ID_TYPE为uint64_t时和为tm_tt_id_t时都编译。如果我们可以增量地转换到该状态，那么一旦ID_TYPE为tm_tt_id_t时所有代码都编译完毕，我们就可以将其设为默认值。\nUint64_t get_data(uint64_t资产){const tm_the_true_object_o*Asset_r=tm_tt_read(TT，ASSET)；uint64_t data=api-&gt；get_subbobject(TT，ASSET_r，TM_TT_PROP__ASSET_OBJECT)；返回数据；}。\nID_TYPE GET_DATA(ID_TYPE ASSET){const tm_the_true_object_o*ASSET_r=tm_tt_read(TT，ASSET)；ID_TYPE DATA=api-&g。\n.", "note_en": "One thing that has really benefited my productivity (and also my general sanity), has been learninghow to take a big task and break it down into smaller, more manageable steps. Big tasks can befrightening and overwhelming, but if I just keep working on the list of smaller tasks, then somehow,as if by magic, the big task gets completed.\n   When programming, I take a very specific approach to this breakdown. I make sure that each step issomething that  compiles, runs, passes all the tests , and  adds value to the codebase . Exactlywhat “adds value” means is purposefully left vague, but it can be things like adding a smallfeature, fixing a bug, or taking a step towards refactoring the code into better shape (i.e.,reducing  technicaldebt).\n An example of  not adding value is adding a new feature, but also introducing ten new bugs. It’snot clear that the value of the feature outweighs the cost of the bugs, so it might be a net loss.\n Another example of not adding value is making the UI prettier, but also make the app run ten timesslower. Again, it’s not clear that the prettier look is worth the performance hit, so it might be anet loss.\n Of course, I can’t always be sure that I’m not introducing bugs, and “value” is inherentlysubjective (how much performance is a new feature worth). The important part is the  intention. My intention is to always add value with every single commit.\n Basically, what I want to avoid is the “It has to get worse before it gets better”-attitude. Alsoknown as: “The new system is the modern way to do it. Sure, it has some bugs and runs kind of slowright now, but once we’ve fixed that, it’s going to be way better than what we had before.” I’veseen too many cases where these supposed fixes never happen and the new system, which was supposedto be better, just made things worse.\n Plus, you know, it feels good to add value. If every day I can make a commit and that commit makesthe engine better in some way, that makes me happy.\n  In addition to implementing changes through a series of small commits, I also  push every one ofthose small commits back to the master branch.\n Note that this is the exact opposite of a  featurebranch workflow, instead, it is a form of trunk-baseddevelopment:\n In a feature branch workflow developers work on new features in isolated, separate branches of thecode and don’t merge them back to master until they’re “complete”: fully working, debugged,documented, code reviewed, etc.\n In the trunk-based approach, features are implemented as a series of small individual commits tothe master branch itself. Care must be taken so that everything works even when the features areonly “partially implemented”:\n  Proponents of the feature branch approach claim that it is a safer way to work since changes to thefeature branch don’t disrupt the master and cause bugs. Personally, I think this safety is illusory.Bugs in the feature branch just get hidden until it’s merged back to master when we suddenly get all the bugs.\n Feature branches also go against my philosophy that every commit should add value. The whole ideabehind a feature branch is: “we’re going to break a bunch of shit over here, but don’t worry, we’llfix it before we merge back to master”. Better not to break stuff in the first place.\n  Fewer merge conflicts. With long-running feature branches, the code in the branch driftsfurther and further away from the code in master, causing more and more merge conflicts. Dealingwith these is a lot of busy work for programmers and it also risks introducing bugs. Some of thesebugs won’t be seen until the branch is merged.\n Less release-day chaos. Typically, all features scheduled for a certain release have the samedeadline. This leads to all feature branches being merged just before the deadline. This meansthat we get all the merge and integration bugs at the same time, just before the release date.Getting a lot of bugs at the same time is a lot worse than having them spread out evenly. Andgetting them just before a release is due is the absolute worst time to get them.\n No worry about the right time to merge. Since everybody knows that merging a feature branchtends to cause instability, this leads to worry about the “right time” to merge. You want to avoidmerging right before a release (unless the feature is required for the release) to avoidintroducing bugs in the release. So maybe just after the release has been made? But what if weneed a hotfix for the release? While the merge is being held, valuable programmer time is beingwasted.\n No rush to merge. When working with feature branches, I often felt a hurriedness about gettingthe branches merged. Sometimes because a branch was needed for a specific release. But also oftenbecause the developer was tired of dealing with merge conflicts, wanted to get it over with, andmove on to the next thing. Thus, the goal of only merging feature branches when they are“complete” was often compromised. (And of course, nothing is ever really “complete”.)\n Easier to revert. If major issues are discovered after the merge of a feature branch (whichoften happens), there is often a lot of reluctance to revert the merge. Another big feature branchmight already have been merged on top of it (since lots of feature branches often get merged atthe same time, just before a release), and reverting it would cause total merge chaos. So insteadof doing a calm, sensible rollback, the team has to scramble desperately to fix the issues beforethe release. With trunk-based development, any major issues would most likely have already beendiscovered. The final commit that makes the new feature “go live” is typically a simple one-linechange that is painless to revert.\n Partial work is shared. In trunk-based development, the partial work done on a feature is seenby all developers (in the master branch). Thus, everybody has a good idea of where the engine isgoing. Bugs, design flaws, and other issues can be discovered early. And it is easier for othersto adapt their code to work with the new feature. It’s also easier to get an estimate of how muchwork is needed to complete a feature when everybody can see how far it has progressed.\n Easier to pause and pick up later. Sometimes, work on a feature might have to be paused for avariety of reasons. There might be more critical issues that need to be addressed. Or the maindeveloper of the feature might get sick, or have vacation coming up. This is a problem for featurebranches because they tend to “rot” over time, as the code base drifts further and further away,causing more and more merge conflicts with the branch. Code that is checked into master does not“rot” in the same way.\n Easier to address other bugs/refactors at the same time. When working on a feature or aproblem, it is pretty common to find other, related problems, exposed by the work you are doing.In the trunk-based approach, this is not an issue. You would just make one or more separatecommits to the trunk to fix those issues. With the feature branch approach, it is more tricky. Iguess the  right thing to do would be to branch off a new separate bug fix branch from master,fix the issue in that branch, merge  that branch into the branch you are currently working on,and (once it passes code review) into master (so that other people get the bug fix before yourfeature branch is merged, because who knows when that will happen). But who has time for all thatshit? So instead, people just fix the problem in their feature branch, and maybe cherry-pick itinto master if they’re having a good day. So now, instead of being about a single isolatedfeature, the feature branch becomes a tangled mix of different features, bug fixes, and refactors.\n The main challenge of the trunk-based approach is how to break a big task down into individualpieces. Especially, with the requirement that each piece should compile, run, add value, and beready to be pushed into master. How can we push partial work without exposing users to half-baked,not yet fully working features?\n   An approach that works well for new features is to use a flag to control whether a feature isvisible to end-users or not.\n Let’s look at an example. A feature that I recently added to the engine was a  Download tab thatlets the users download new engine versions and sample projects from within the engine itself:\n  There are lots of different ways this could be broken down into smaller steps. Here’s an example:\n Add the  Download tab to the menus and show a new blank tab when it’s opened.\n Normally, I don’t do a full breakdown like this upfront. Instead, I just kind of figure out the nextlogical step as I go along. I only sit down and do a serious planning session if the task isparticularly tricky and incremental steps like this don’t come naturally.\n To prevent end-users from seeing the tab before it’s actually working, I hide it behind a flag. Thiscan be as simple as:\n  To get the menu option to show the  Download tab, you have to change the  download_tab_enabledflag to  true and recompile.\n We call these flags   feature flags since theyselectively enable or disable individual features of the application. Once the feature is complete,we can remove the flag and just leave the  true code path.\n  Through a dynamic  bool variable that is initialized from a config file, a menu option or aninternal debug console.\n Out of these options, I think the third one is the best. You want to expose your new code to  asmany people as possible. That way, they can find bugs in your code, if they refactor the codebase,they take your code into account, etc.\n If you use a  #define flag, other people on your team won’t even compile your code. Thus, one oftheir changes could easily end up breaking your code. A  const flag is better, because your codewill still be compiled, but since people can’t try the new feature without recompiling your code,most people won’t bother.\n With a dynamic flag, artists, producers, or end-users who don’t want to be bothered with rebuildingthe application can just modify the config file and then give your new feature a test run.\n When the time comes to release a feature, you simply flip the default value of the feature flag from false to  true and everybody will see the new feature. If there are issues and you need torevert, you simply flip the flag back. Later, when the feature seems stable, you can get rid of theflag and just keep the  true path in the code.\n You can even do a partial, staged rollout. E.g., you could set the flag to  true for 1 % of theusers and then slowly ramp that up while monitoring the crash logs and the forums for any issues.That way, if a problem is encountered, it will only affect a small number of users and you canquickly revert.\n  The above approach works well for new features, but what should you do if you are doing a majorrewrite of an existing system?\n In this case, it might be trickier to find an incremental step-by-step approach, because you mightwant to rip out large parts of the old system and it will take a while until the replacement codereaches feature parity.\n It might be tempting to reach for the feature branch approach in this case, but again, I don’t thinkit’s the right strategy. A big problem is you will have two conflicting goals. On the one hand, youwant to merge early so that people see the improved code and you get some testing on the rewrites.On the other hand, you want to delay it as long as possible, so that you can reach feature parityand iron out all the bugs. What usually happens is an unsatisfying mix of the two.\n A better approach is to make a parallel implementation and let the engine have two copies of thesame system.\n If you are doing a major overhaul, you could start by just copying the entire system code to a newfolder. If you are rewriting from the ground up, you could start with an empty folder.\n Depending on the nature of the system you are replacing, you could either have both systems (the oldand the new one) running in parallel, or you could have a feature flag that selects which of thesystems should be the default. For example, if you are rewriting the physics simulation, youprobably need a flag to select if you are using the old or the new one since you want all physicsobjects to live in the same simulation (otherwise they won’t interact). On the other hand, if youare rewriting the particle effect system, you could potentially have both systems running and justselect for each played effect whether it should play in the old or the new system.\n Having parallel implementations lets you do a much smoother transition from the old to the newsystem. Everyone on the team can easily test out the new system. You can compare it to the old onefor feature completeness, stability, performance, etc. If applicable, you could even run automatedtests to verify that the new system produces the exact same output as the old one. Once the newsystem has been thoroughly verified, you can change the flag and start using it as the default.\n The parallel implementations also provide a much gentler upgrade path for end-users. Instead oftying everyone to the same “merge date”, you can just expose the system selection flag to theend-users. Users who are eager to try out the improved features in the new system can turn the flagon early, while users who favor stability or depend on certain quirks in the old system can decideto stay on it, even after the new one has become the default.\n And there is no immediate rush to retire the old system once the new one has become the default, youcan eventually deprecate and phase it out once the burden of maintaining it outweighs the value ofhaving it around.\n  For our final problem, let’s consider something even trickier — making a big refactoring change tothe entire codebase. It could be things like:\n Changing a commonly used type, such as switching from  std::string to an internal string type.\n  They tend to touch a lot of the code, increasing the risk of merge conflicts.\n It’s often tricky to see how to do them incrementally. For example, if you change the parametersof a function, you must update all the call sites. Otherwise, the code simply won’t compile.\n In some cases, it can be pretty straightforward how to approach the problem incrementally. Forexample, when we add a new warning such as  -Wshadow, the fixes we do in order to make the codecompile  with the warning do not cause any problems when compiling the code  without the warning.So we can simply turn on the warning, fix a bunch of the errors we get (however many makes asuitably sized commit), turn the warning off again, and then commit the result. Rinse and repeatuntil all the warnings are fixed and then do a final commit that turns the  -Wshadow flag on foreverybody.\n In other cases, we can employ the parallel implementation strategy. Suppose we have a function thatis used all over the code to allocate memory:\n  Now we want to add a  system parameter so that all memory allocations can be tagged as belonging to a particular system (gameplay, graphics, sound, animation, etc):\n  If we just added the parameter like this, the code wouldn’t compile until we fixed  all the callsites. I.e., the incremental approach would not work.\n   Now we can incrementally transition all of the code to use  mem_alloc_new() instead of mem_alloc(). Once we have transitioned all of the code, we can remove  mem_alloc() and then do aglobal search-and-replace that renames  mem_alloc_new() →  mem_alloc().\n The final challenge is the trickiest one of them all — changing one of the fundamental types in thecodebase.\n In fact, I recently had a run-in with this, which is what prompted me to write this whole blog post.In my case, I wanted to refactor our codebase to introduce a new type to represent the IDs ofobjects in The Truth.  TheTruth is our maindata store in The Machinery. All the data that the editor works on is stored in The Truth, and everyobject in The Truth is referenced by its ID.\n We used to represent Truth IDs with just an  uint64_t, but since we have lots of other values thatare also represented by  uint64_ts this was causing increasing confusion. In order to providebetter documentation of where a Truth ID is expected and some type-safety against passing other uint64_t values, we decided to switch from using a plain  uint64_t to wrapping it in a struct:\n  Note that since Truth IDs are used  everywhere, this change impacts thousands of lines in the code.\n Somewhat arrogantly, I still set out to do this refactor as a single concentrated push. I  know Ishould do things incrementally, that’s what this whole blog post is about, but sometimes I mess up.\n As I worked on it, I realized this change was a lot bigger than I had originally thought and therewas no way I was going to be able to finish it in a single sitting. I started to get that sinkingfeeling that things were spiraling out of control. I was changing  thousands of lines of code. WasI really sure that I wasn’t introducing typos anywhere?\n       instead? Running some tests would have increased my confidence, but since the code wouldn’t compileuntil I had fixed  everything, I couldn’t run any tests.\n Then I started to get merge conflicts with other people’s changes which I had to resolve by hand,hoping that I understood their code well enough not to break anything. It became harder and harderto picture the consequences of all the changes. How many bugs was I introducing?\n In the past, I’ve often tried to deal with these “panicky” feelings by “powering through”. Startingto pull long late-night coding sessions to try to wrestle this thing that is slipping away from meback under control. Get all my changes in before someone else has a chance to push anything so thatI don’t have to deal with the merge conflicts. (Which of course just means that  they have to dealwith the merge conflicts instead. Ha ha!)\n But these days I’m maybe a little bit wiser? I realize that these feelings are a sign that I havebitten off more than I could chew and that the right response is not to push forward, but insteadtake a step back, reflect and try to reformulate the problem so it can be approached in a series ofsmaller steps instead. Depending on how much trouble I’ve gotten myself into, I might be able tosalvage some of the changes or I might just throw it all away and start over with an iterativeapproach. Even when I’ve had to throw everything away, I’ve never regretted it. In the end, workingin a series of small, controlled steps is so much more productive that I feel like I always gainedback the time I “lost”.\n Back to the problem at hand. I knew I wanted to change the type  incrementally. I.e., change it insome files, but not in others, and still be able to compile and test the code. But how could Ipossibly do that, when everything depends on everything else? Once I change some parameters to use tm_tt_id_t, anything that calls it with  uint64_t will produce an error.\n My key insight was that this situation is very similar to the one of enabling  -Wshadow. Thattransition was easy to do because we changed the code from compiling just under  -Wno-shadow sothat it compiles under  both  -Wshadow and  -Wno-shadow. We can do this change incrementallyuntil we’re finally ready to turn on  -Wshadow.\n Let’s do the same thing here. We’ll call the type of the ID objects  ID_TYPE. Right now, our codecompiles when  ID_TYPE is  uint64_t. Our goal is to rewrite that code so that it compiles  bothwhen  ID_TYPE is  uint64_t and when it is  tm_tt_id_t. If we can incrementally transition to thatstate, then once all the code compiles when  ID_TYPE is  tm_tt_id_t we can make that the default.\n  uint64_t get_data(uint64_t asset){ const tm_the_truth_object_o *asset_r = tm_tt_read(tt, asset); uint64_t data = api-&gt;get_subobject(tt, asset_r, TM_TT_PROP__ASSET__OBJECT); return data;}\n  ID_TYPE get_data(ID_TYPE asset){ const tm_the_truth_object_o *asset_r = tm_tt_read(tt, asset); ID_TYPE data = api-&g\n......", "posttime": "2020-10-22 22:33:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,增量,代码", "title": "循序渐进：增量编程", "title_en": "Step-by-Step: Programming Incrementally", "transed": 1, "url": "https://ourmachinery.com/post/step-by-step-programming-incrementally/", "via": "", "real_tags": ["编程", "增量", "代码"]}, {"category": "", "categoryclass": "", "imagename": "01ec91d152691d902ee7dbd241755dc1.png", "infoid": 1030552, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这一切都是为了让人们有机会创建个人的、可共享的和灵活的视频聊天室。博耶斯和哈里斯和我们其他人一样，在大流行来袭时搬到了Zoom进行合作，他们觉得有几个缺点。\n哈里斯解释说，与他的联合创始人兼好友切换到演示模式感觉非常客观和正式，当会议结束时，那些会议中的笔记和其他内容就消失了，“就像一个虫洞”。\n“沟通有四个主要组成部分，”哈里斯说。“你在说什么，你在哪里，你在做什么，你是怎么走的。我们今天使用的所有东西几乎都集中在你说的话上，而很少关注你做什么。ZOOM是一个带有图片的电话。“。\n相比之下，这里是一个完全可定制的房间，上面建立了视频聊天，让用户能够用虚拟项目、gif、背景、笔记、图片等来装饰自己的房间。当然，这些用户还可以自定义自己和其他人的视频聊天窗口，按照他们喜欢的大小和形状在房间中排列它们。\nHarris和Boyes还没有准备好致力于某一特定的商业模式甚至用例，而是更愿意看看用户是如何接近这个平台的。一些人建造了产品战略室，而另一些人则建立了自己的虚拟蓝瓶店，互相喝咖啡。其他人开设了普拉提课程，看起来和感觉上都更像一个真正的普拉提工作室，而不是Zoom Call。\n这并不是说他们根本没有开始考虑收入。这里有可能为举办课程或付费活动的人提供支付处理，也可以选择付费墙持久保存房间和里面的物品，甚至可以对优质虚拟对象或商品收费。\n这里在两个月前推出，自那以来已经创建了数千个房间，平均用户会话时间为41分钟。\n这一领域的竞争正在升温。MMHMM提供了类似的工具来定制视频聊天室，但更侧重于展示而不是闲逛。宏是一种位于Zoom Call之上的工具，可帮助确保会议富有成效和效率。此外，还有数十家(如果不是更多的话)初创公司在疫情爆发时涌现出来，以打造下一代视频聊天。\n但博耶斯和哈里斯并不认为竞争是公司面临的最大挑战。\n“这是一个产品问题，而不是执行问题，”哈里斯说。“这是为了在我们的用户进入时在他们中产生非常强烈的情感反应。”", "note_en": "Here is all about giving people the chance to create personal, shareable and flexible video chat rooms. Boyes and Harris, like the rest of us, moved to Zoom to collaborate when the pandemic hit and felt that there were several shortcomings.\n Harris explained that it felt very impersonal and formal to switch into presentation mode with his cofounder and buddy, and that notes and other content in those meetings disappeared when the meeting ended, “like a wormhole.”\n   “There are four main components to communication,” said Harris. “What you’re saying, where you are, what you’re doing, and how you move. Everything we use today almost exclusively focuses on what you say, and very little on what you do. Zoom is a phone call with pictures.”\n Here, in contrast, is a fully customizable room with video chat built on top of it, giving users the ability to decorate their room with virtual items, gifs, backgrounds, notes, pictures, etc. And, of course, these users can also customize their own video chat window and those of others, arranging them in the room in the size and shape that they prefer.\n   Harris and Boyes aren’t ready to commit to a certain business model or even use case, but would rather prefer to see how users approach the platform. Some have built out product war rooms, while others have set up their own virtual Blue Bottle shop to have coffee with each other. Others have set up Pilates classes that look and feel more like an actual Pilates studio than a Zoom call would.\n That’s not to say they haven’t started thinking about revenue at all. There is potential here to offer payments processing for folks hosting classes or paid events, and there are also options to paywall persistence of the room and the items inside it, or even to charge for premium virtual objects or goods.\n Here launched two months ago and thousands of rooms have been created since, with the average user session being 41 minutes.\n  Competition in this space is heating up. Mmhmm offers similar tools to customize the video chat room, but focuses more on presenting than hanging out.  Macro is a tool that sits on top of a Zoom call to help ensure meetings are productive and efficient. And then there are the dozens (if not more) startups that sprung to action at the onset of the pandemic to build out the next-generation of video chat.\n  But Boyes and Harris don’t see competition as the greatest challenge to the company.\n “Here is a product problem, it is not an execution problem,” said Harris. “It is about generating a very strong emotional response in our users when they come in.”", "posttime": "2020-10-22 22:15:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "视频,reimagine", "title": "\nHere.fm筹集290万美元重新想象视频聊天", "title_en": "\n\t\t\t\tHere.fm raises $2.9 million to reimagine video chat\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/22/here-fm-raises-2-9-million-to-reimagine-video-chat/", "via": "", "real_tags": ["视频", "reimagine"]}, {"category": "", "categoryclass": "", "imagename": "56582b7b2a4c2bf398b16882af8c0e8f.jpg", "infoid": 1030551, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周，由Facebook前首席信息官蒂姆·坎波斯创立的日历初创公司Wven正在对其高级日程安排软件进行重组，希望专注于工作效率的用户能够付费进一步优化日历体验，就像他们已经付费购买了超人和笔记应用程序等订阅电子邮件服务一样。\n有相当大的投资者资金涌入生产力领域，这在企业内部自下而上的规模方面显示出很大的希望，首先是将他们的产品销售给个人。到目前为止，Weven已经通过Battery Ventures、Felicis Ventures和Tiny Capital等公司的投资筹集了约500万美元。\n“时间是我们拥有的最宝贵的资产，”坎波斯告诉TechCrunch。“我们认为这是一个真正的机会，可以在日程表上做更多的事情。”\n他们的新产品将帮助确定对专业日历的需求到底有多大，这种日历旨在让专业人士的生活比谷歌日历(Google Calendar)或Outlook日历所关心的更容易。这款新产品的月费为20美元(如果你支付一年的话，早期使用期为10美元)，它建立在该公司的免费分级产品基础上，为用户提供了几个新功能。自由层仍然有相当多的功能，这些功能仍然存在，但缺乏对多账户的支持是那里的一大限制。\nWeven的核心价值可能在于其类似日历的日程安排链接，允许单个用户快速显示他们什么时候有空，或者让团队在安排会议时通过扫描每个人的空闲时间并建议统一可用的时间来完全消除来回奔波的情况。在最新的更新中，这家初创公司还推出了一项名为Open Invite的新功能，允许用户弹出链接加入收件人可以快速注册的网络研讨会。\nWoven的最大功能之一可能是Smart Templates，它旨在从您的习惯中学习，并减少组织会议所需的时间。选择模板可以自动为您设置一次性缩放链接，ping参与者是否可以使用Wven的其他日程安排链接，并处理平凡的细节。现在，标题也会根据参与者、位置或公司信息自动更新。虽然大量的生产力发生在台式机上，但这家初创公司也试图在移动设备上挑战极限。他们增加了iMessage集成，让人们可以在聊天中快速分享他们的可用性和安排会议。\n产品更新是在该公司的Zoom“Zapp”发布后不久发布的，Zapp将该应用程序的功能推入了Zoom，可能会向新用户出售一些。", "note_en": "This week,  Woven, a calendar startup founded by former Facebook CIO Tim Campos is shaking up the premium tier of their scheduling software, hoping that productivity-focused users will pay to further optimize the calendar experience just as they have paid up for subscription email services like Superhuman and note-taking apps like Notion.\n There’s been a pretty huge influx of investor dollars into the productivity space which has shown a lot of promise in bottoms-up scaling inside enterprises by first aiming to sell their products to individuals. Woven has raised about $5 million to date with investments from  Battery Ventures,    Felicis Ventures   and Tiny Capital, among others.\n  “Time is the most valuable asset that we have,” Campos told TechCrunch. “We think there’s a real opportunity to do much more with the calendar.”\n Their new product will help determine just how much demand there is for a pro-tier calendar that aims to make life easier for professionals than Google Calendar or Outlook Calendar cares to. The new product, which is $20 per month ($10 during an early access period if you pay for a year), builds on the company’s free tier product giving users a handful of new features. There’s still quite a bit of functionality in the free tier still, which is sticking around, but the lack of multi-account support is one of the big limitations there.\n  The core of Woven’s value is likely its  Calendly-like scheduling links which allow single users to quickly show when they’re free, or give teams the ability to eliminate back-in-forth entirely when scheduling meetings by scanning everyone’s availability and suggesting times that are uniformly available. In this latest update, the startup has also launched a new feature called Open Invite which allows users to blast out links to join webinars that recipients can quickly register for.\n One of Woven’s top features is probably Smart Templates which aims to learn from your habits and strip down the amount of time it takes to organize a meeting. Selecting the template can automatically set you up with a one-time  Zoom   link, ping participants for their availability with Woven’s scheduling links and take care of mundane details. Now, the titles automatically update depending on participants, location or company information as well. While plenty of productivity happens on the desktop, the startup is trying to push the envelope on mobile as well. They’ve added an iMessage integration to quickly allow people to share their availability and schedule meetings inside chat.\n The product updates arrive soon after the announcement of the company’s Zoom “Zapp,” which shoves the app’s functionality inside Zoom and will likely be a bit sell to new users.", "posttime": "2020-10-22 22:14:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,增加,premium,日历", "title": "\nWoven增加了其日历应用程序的20美元/月溢价计划", "title_en": "\n\t\t\t\tWoven adds to its calendar app’s $20/mo premium plan\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/22/woven-adds-to-its-20-mo-premium-tier-calendar-app/", "via": "", "real_tags": ["程序", "增加", "premium", "日历"]}, {"category": "", "categoryclass": "", "imagename": "179ff81ef3938337f5ad57f189760350.png", "infoid": 1030549, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在Insta的案例中，这一选项是与Aldi合作提供的，这将为SNAP EBT参与者提供使用在线服务获得新鲜食品和其他主食的能力。\n购物时，Insta用户可以将Aldi的符合EBT SNAP标准的商品添加到购物车中，然后选择他们想要在结账前将多少福利分配给他们的订单。\n该计划将在新的几周内推出，并将首先到达阿尔迪在佐治亚州的60多家门店，然后在未来几个月扩大到伊利诺伊州、加利福尼亚州、佛罗里达州和宾夕法尼亚州的570多家门店。\nInsta表示，它在亚特兰大运营其客户和购物者关怀团队，这是它选择佐治亚州作为第一个市场的原因之一-并补充说，首先支持其员工生活和工作的社区很重要。\n今天，网上杂货购物通常被视为一种奢侈品服务，但事实并非如此。通常，网上购物和实体店购物一样实惠(至少如果使用提货选项)，因为顾客可以更容易地与其他在线零售商进行价格比较。对于一些低收入客户来说，当他们在工作和家庭承诺之间捉襟见肘时，网购也可以节省时间。\n大流行现在使那些领取SNAP救济金的人，特别是高危个人获得食物的机会变得更加复杂。这些顾客现在不得不冒着生命和健康的风险在店内购物，这使得在线杂货变得更加必要。\nInsta在其公告中表示：“引入Insta的EBT SNAP付款正值美国的粮食不安全状况恶化之际，因为美国继续受到新冠肺炎的影响。”“根据”喂养美国“的说法，由于大流行的影响，2020年可能会有超过5400万人经历粮食不安全，其中包括潜在的1800万儿童。特别是在佐治亚州，粮食不安全影响了12.5%的人口，而且对有色人种社区的影响不成比例。\n在冠状病毒爆发之前，美国国务院。农业部一直在努力通过一项在线购买试点计划，在亚马逊、沃尔玛、ShopRite等零售商的支持下，使SNAP收件人更容易获得在线食品杂货。试点零售商已经使在网上购物，然后使用SNAP EBT支付成为可能。\n然而，在美国农业部的网站上，Aldi和Insta并没有被列为项目参与者。", "note_en": "In Instacart’s case, the option is being made available in partnership with ALDI, which will offer the ability for SNAP EBT participants to access fresh food and other staples using the online service.\n When shopping, Instacart users will be able to add ALDI’s EBT SNAP-eligible items to their cart, then select how much of their benefits they want to allocate to their order before checking out.\n   The program will launch over the new few weeks, and will first arrive at ALDI’s over 60 Georgia stores before expanding to over 570 stores across Illinois, California, Florida and Pennsylvania in the months ahead.\n Instacart says it runs its Customer and Shopper Care team from Atlanta, which one reason why it selected Georgia as the debut market — adding it was important to first support the communities where its own employees live and work.\n Today, online grocery shopping is often seen as a luxury service, but that should not be the case. Often, it’s just as affordable to shop online than in-store (if using the pickup option, at least), as customers can more easily compare prices with other retailers online. For some lower-income customers, online shopping can also save time when they’re stretched between jobs and family commitments.\n The pandemic has now further  complicated access to food for those on SNAP benefits, and in particular, for high-risk individuals. These customers now have to take risks with their lives and health to shop in-store, making online grocery more of a necessity.\n “The introduction of Instacart’s EBT SNAP payments comes at a time when food insecurity in the U.S. has compounded as the nation continues to be impacted by COVID-19,” Instacart stated in its  announcement. “According to Feeding America, due to the effects of the pandemic, more than 54 million people may experience food insecurity in 2020, which includes a potential 18 million children. In Georgia specifically, food insecurity impacts 12.5% of the population and disproportionately affects communities of color,” it noted.\n  Before the coronavirus outbreak, the U.S. Dept. of Agriculture had been working to make online grocery more accessible to SNAP recipients through  an online purchasing pilot program with support of retailers including Amazon, Walmart, ShopRite, and others. The pilot retailers  have made it possible to shop for groceries online, then pay using SNAP EBT.\n ALDI and Instacart are not listed on the USDA’s website as program participants, however.", "posttime": "2020-10-22 22:14:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "aldi,partnership,insta", "title": "\nInsta将与Aldi合作，支持在线食品杂货的SNAP EBT", "title_en": "\n\t\t\t\tInstacart, in partnership with ALDI, will support SNAP EBT for online groceries\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/22/instacart-in-partnership-with-aldi-will-support-snap-ebt-for-online-groceries/", "via": "", "real_tags": ["aldi", "insta"]}, {"category": "", "categoryclass": "", "imagename": "7eb6abe71bd8075f70a406149e52958f.jpg", "infoid": 1030547, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳到主要内容如果您从Verge链接购买内容，Vox Media可能会赚取佣金。请参阅我们的道德声明。\n今年的智能扬声器大赛是有史以来最热门的一次。谷歌终于更新了其中档智能扬声器，推出了令人印象深刻的Good Nest Audio。苹果已经看到了其HomePod方式的错误，并将推出更方便的HomePod mini。\n当然，亚马逊并没有停滞不前。它拥有全新的Echo，自2014年第一款Echo令世界惊讶以来，它在设计和音质方面进行了最大规模的改革。而且它们的价格都与去年的第三代Echo、Nest Audio和HomePod mini的价格相同，为99.99美元。\n亚马逊还有一个全新的Echo Dot阵容，它呼应了更大型号的设计，缩小了尺寸，并将其价格降至更低的价位。我将单独报道Echo Dot，但如果它像更大的Echo，那将是令人印象深刻的。\nEcho的设计已经完全翻新了--圆柱形的形状已经过时，现在一切都是关于球体的。新的Echo本质上是一个5英寸的球，底部是平边，所以它不会滚出桌子。它看起来有点像甜瓜，尽管我也不能否认它所投射出的死星氛围。\n根据亚马逊的说法，球的形状是为了改善扬声器的声学性能，并允许在内部放置驱动器时有更大的灵活性。它还在低音扬声器后面提供了一个更饱满的腔体，以获得更好的低音响应。\n果然，Echo在物理上比Nest Audio要深一些，后者稍高一点。这个深度允许亚马逊使用两个高音扬声器(每个0.8英寸)，而不是Nest的一个高音扬声器，同时仍然可以安装一个3英寸的低音扬声器，并有足够的空间让它辐射低音。\n净效果是Echo拥有比Nest更大的音响舞台，让更大的房间更好地充满声音。它也有明显更好的低音-你可以在地板上感觉到它，就像听到它一样。这是我以前从100美元的智能扬声器上没有经历过的事情。\n球的上半部分覆盖着布料，你可以把它弄成深灰色、浅灰色或新的浅蓝色。最顶端有四个按钮：提高音量、降低音量、麦克风静音和“动作”按钮，无需说“Alexa”即可使扬声器进入收听模式。在后面，你会发现电源端口和相同的3.5毫米插孔，在所有其他Echo扬声器上，可以将其连接到更大的音响系统。还有一个内置的蓝牙收音机，可以直接连接到设备上，播放任何你想要的音频源。\n这种新的形状需要移动标志性的LED灯环，当Alexa正在收听语音命令时，当它被静音时，当您收到通知时，或者扬声器的音量水平时，它会让您知道。现在它在底部，从远处可能更难看到。但在我的经验中，这不是问题：无论你戴上Echo，光环的光芒都会从表面反射出来，而且它足够亮，可以从房间的另一边看到。\n最后，设计也比以往的模型更具方向性。Echo的低音扬声器没有试图向各个方向发出飞溅的声音，而是以45度的向上角度指向前方，而两个高音扬声器位于其下方，分别面向略左和略右。很明显，当你听它的时候，你应该面对说话者，而且它不应该放在房间的中央。\n总而言之，对于亚马逊和我们共同期待的智能扬声器来说，这一设计都是一个彻底的背离。我喜欢它。\n我也真的很喜欢新的Echo发出的声音。如前所述，它听起来比Nest Audio更好，这要归功于它更大的物理尺寸和独特的形状。它还使用了与Sonos、苹果、谷歌甚至亚马逊自己的更昂贵扬声器上典型的相同类型的主动房间调谐。\n新的Echo将使用内置的麦克风来监听房间，并不断测量其大小和形状。然后，它将相应地调整其音频输出。这是以前这个价格的扬声器上没有的一个功能--Nest Audio和HomePod mini都没有。\n很难量化这种房间调谐带来的不同，特别是因为我不能随意打开或关闭它。但将三个驱动器和更大的尺寸结合在一起，Echo会产生令人印象深刻的饱满声音。亚马逊似乎是为稍微大一点的房间设计的-该公司建议坐在距离它10英尺(不超过6英尺)的地方，以获得最佳体验。如果你在一个较小的空间，Echo Dot更紧凑，但设计相似，可能更适合你。\n亚马逊还声称Echo受益于杜比音频调谐，但它没有支持更大、更昂贵的Echo Studio能够支持的3D Atmos音频(那里没有大的损失)。\n总体而言，Echo有一个宽广的音响舞台，比这个价格的扬声器通常有更深的低音，而且由于这两个高音扬声器，还有一些立体声分离。它的声音也很大-当我将它与Sonos One进行并排比较时，Sonos One的价格是Sonos的两倍，Echo在输出方面可以与Sonos不相上下。\nEcho在音质上不能与Sonos相提并论，我确实更喜欢Sonos的整体音质。但差别很小：Echo有时听起来更“加工”，而且它缺乏Sono如此擅长的中音温暖。\n然而，这些不同并没有阻止我欣赏回声乐队发出的音乐，无论是最近重新发行的汤姆·佩蒂(Tom Petty)“野花”的家庭原声录音，还是精神漂流的“永恒的启迪”(Enlight In Eternity)中驾驭、和谐的吉他即兴段，还是我通常在工作时听的环境中的第谷节拍。(我使用Spotify进行测试，但Echo支持除YouTube音乐以外的所有主要音乐服务。)。Echo擅长让混音中的每一种乐器发光，这是以前的型号非常糟糕的，而不会淹没人声或低音过多的中音。我不会称高音为“闪闪发光”，但它们令人愉悦，而且从来不会发出刺耳的声音，即使是在高音量的情况下也是如此。\n我已经开始对智能扬声器的低音不抱太高的期望，特别是在这个价格下，所以我能感觉到地板上的低音鼓是一个很好的惊喜。它不会取代家庭聚会上的低音扬声器，但它肯定比Nest Audio提供的低音更低，尽管它和Echo的低音扬声器大小相同。\n可以将两个Echo扬声器配对成立体声配置，这样做会产生一堵声音墙，你预计会来自更大或更昂贵的扬声器。它还提供了比单个Echo中的两个高音扬声器能够单独管理的立体声分离明显得多的立体声分离。\n但我不认为大多数人会觉得有必要买两个并在立体声中使用-一个Echo本身就足够响了，即使在我的开放式客厅里，天花板很高，倾斜的天花板也是如此。(如果你将立体声中的两个Echo扬声器与FireTV配对，以实现家庭影院设置，那么它们肯定会更有意义。)。\nEcho听起来也很适合语音音频，无论是通过Pocket Cast播放的播客还是可听的有声读物。它仍然是一款用途广泛的多功能扬声器。\n作为一款智能扬声器，新款Echo能够完成Echo扬声器多年来一直在做的所有事情。你可以要求Alexa控制智能家居设备，设置定时器，提供天气预报，向购物清单添加东西，等等。Alexa可以做的事情的清单每天都在继续增加，但大多数人仍然使用智能扬声器作为基本功能-音乐、闹钟、定时器等-而Echo在所有这些方面都非常出色。\n它还非常善于识别“Alexa”的唤醒词，即使在播放音乐的时候，我也不需要提高音量就能让它听到我的声音。这不是我可以对Nest Audio说的话，在Nest Audio中，我必须有意识地通过音乐说话来跳过一首曲目或调节音量。当我们能够测试时，我们将不得不看看HomePod mini在这方面的表现。\n亚马逊在新的Echo中使用了新的AZ1神经边缘处理器，这款处理器旨在加快语音识别速度。不幸的是，这要到今年晚些时候才能启用，所以我还没能对其进行测试。总体而言，Echo上的Alexa的响应速度比谷歌在Nest Audio上的反应要快得多。传统上，Siri的反应速度比Alexa或最初HomePod上的谷歌助手更快--同样，当我们有机会测试HomePod mini时，我们还得看看它的表现。\n亚马逊似乎没有在新的Echo中堆积足够的内容，使其成为对抗竞争的一个引人注目的选择，它还包括了一个完整的智能家居中心。您可以将Zigbee设备(如灯泡、门传感器等)直接连接到Echo，而不需要辅助集线器，然后通过语音命令或Alexa智能手机应用程序对其进行管理和控制。Echo中甚至有一个温度传感器，可以用来触发Alexa例程，比如打开风扇或空调。\nEcho还支持亚马逊的新人行道网络，但在它真正推出之前，很难说它将意味着什么，也很难说它有多重要。\n亚马逊主流Echo扬声器的发展经历了一段漫长的旅程，从一个奇怪的普林格扬声器(Pringles)，到看起来更好看、听起来也更好的圆柱体，再到我们现在的球形扬声器，这是一个合理地听起来很好的球形扬声器。很长一段时间以来，如果你想要一个智能扬声器，但又一点也不关心音质，你的选择就是花更多的钱买Sonos One、HomePod或亚马逊更大的Echo Studio。\n但现在，亚马逊带来了出色的音质和大量的功能，价格也更容易接受。一旦亚马逊为新款Echo提供频繁且激进的折扣，这个价格可能会变得更好。如果你家里已经有Alexa扬声器了，无论是便宜的Echo Dot还是旧的Echo型号，新的Echo都是一个引人注目的升级。\n如果你在过去的五年里一直关注智能扬声器世界，但还没有投身其中，那么新的Echo是一个很好的起点。这是一个听起来很棒的演讲者，而且碰巧还做了一百万件其他的事情。", "note_en": "Skip to main content                                                                                                                If you buy something from a Verge link, Vox Media may earn a commission. See our  ethics statement.\n    The smart speaker competition this year is the hottest it’s ever been. Google has finally refreshed its midrange smart speaker with the  impressively good Nest Audio. Apple has seen the error of its HomePod ways and is coming out with the  much more accessible HomePod mini.\n And Amazon, naturally, is not standing still. It has a brand-new Echo with the biggest overhaul in design and sound quality since the first Echo surprised the world back in 2014. And it’s all for the same $99.99 price as  last year’s 3rd  Gen Echo, the Nest Audio, and the HomePod mini.\n Amazon also has a  brand-new Echo Dot lineup that, well, echoes the design of the larger model, shrinking it down and bringing it to an even lower price point. I’ll be covering the Echo Dot in a separate piece, but if it’s anything like the larger Echo, it’s going to be impressive.\n   The Echo’s design has been completely overhauled — the cylindrical shape is out, everything is about spheres now. The new Echo is essentially a 5-inch ball with a flat side on the bottom, so it doesn’t roll off the table. It’s vaguely melon-like in appearance, though I also can’t deny the Death Star vibes it projects.\n According to Amazon, the ball shape is meant to improve the speaker’s acoustic properties and allows for more flexibility with the placement of the drivers inside. It also offers a fuller cavity behind the woofer for better bass response.\n And sure enough, the Echo is physically deeper than the Nest Audio, which is a little bit taller. That depth allows Amazon to use two tweeters (each 0.8-inch) compared to the Nest’s single one, while still fitting in a 3-inch woofer and enough space for it to radiate bass.\n The net effect is the Echo has a greater sound stage than the Nest and fills larger rooms better with sound. It also has noticeably better bass — you can feel it in the floor as well as just hearing it. That’s something I haven’t experienced from a $100 smart speaker before.\n  The top half of the ball is covered in fabric, and you can get it in dark gray, light gray, or a new light blue. At the very apex are four buttons: volume up, volume down, microphone mute, and the “action” button, which puts the speaker into listening mode without you having to say “Alexa”. Around back you’ll find the power port and the same 3.5mm jack that’s on all of the other Echo speakers for hooking it up to a larger sound system. There’s also a built-in Bluetooth radio for connecting directly to a device and playing whatever audio source you want.\n  This new shape necessitates moving the signature LED light ring that lets you know when Alexa is listening for a voice command, when it’s muted, when you have a notification, or the volume level of the speaker. It’s now on the bottom, which might be harder to see from a distance. But in my experience that was a non-issue: the light ring’s glow reflects off the surface of whatever you put the Echo on and it’s bright enough to see from across the room.\n Lastly, the design is also much more directional than the prior models. Instead of trying to splash sound in all directions, the Echo’s woofer is pointed towards the front at a 45-degree upwards angle, while the two tweeters are below it, facing slightly left and slightly right. It’s clear that you are meant to face the speaker when listening to it, and it isn’t expected to be placed in the center of a room.\n In all, the design is a radical departure for both Amazon and what we’ve collectively come to expect a smart speaker to look like. I like it.\n   I also really like the sound that comes out of the new Echo. As mentioned, it sounds better than the Nest Audio thanks to its larger physical size and unique shape. It also utilizes the same kind of active room tuning that is typically found on more expensive speakers from Sonos, Apple, Google, and even Amazon itself.\n The new Echo will use the mics built into it to listen to the room and continuously gauge its size and shape. It will then adjust its audio output accordingly. This isn’t a feature that’s been available on speakers at this price before — neither the Nest Audio nor the HomePod mini have it.\n  It’s hard to quantify the difference this room tuning makes, especially since I can’t turn it on or off at will. But in combination with the three drivers and larger size, the Echo produces an impressively full sound. It appears that Amazon designed it for slightly larger rooms — the company recommends sitting ten feet away (and no closer than six feet) from it for the best experience. If you’re in a smaller space, the Echo Dot’s more compact, yet similar, design is likely a better fit.\n Amazon also claims that the Echo benefits from Dolby Audio tuning, but it stops short of supporting the 3D Atmos audio that the larger and more expensive Echo Studio is capable of (no big loss there).\n In general, the Echo has a wide soundstage, deeper bass than typically found on speakers at this price, and some stereo separation thanks to those two tweeters. It also gets loud — when I compared it side by side with the Sonos One, a speaker that’s twice as expensive, the Echo was able to go toe-to-toe with the Sonos in terms of output.\n The Echo isn’t quite able to match the Sonos on sound quality, and I do prefer the sound of the Sonos overall. But the differences are small: the Echo can sound more “processed” at times and it lacks the warmth in the midrange that the Sonos is so good at.\n Those differences did not stop me from enjoying the music coming out of the Echo, however, whether that was the acoustic home recordings on the recent rerelease of Tom Petty’s  Wildflowers; the driving, harmonized guitar riffs on Spirit Adrift’s  Enlightened In Eternity; or the ambient Tycho beats I typically listen to while working. (I used Spotify for my testing, but the Echo supports all of the major music services, save for YouTube Music.) The Echo is good at allowing each instrument in the mix to shine, something prior models were horribly poor at, without drowning out vocals or mids with too much bass. I wouldn’t call the trebles “sparkly”, but they are pleasant and never grating, even at high volumes.\n I’ve come to not expect much bass from smart speakers, especially at this price, so the fact that I could feel the bass drum in the floor was a nice surprise. It’s not going to replace a subwoofer at a house party, but it’s definitely more bass than the Nest Audio provides, even though both it and the Echo have the same size woofer.\n It’s possible to pair two Echo speakers into a stereo configuration, and doing so produces a wall of sound that you’d expect to come from much larger or more expensive speakers. It also provides a much more obvious stereo separation than the two tweeters in a single Echo are able to manage on their own.\n But I don’t think most people will find it necessary to buy two and use them in stereo — a single Echo gets plenty loud enough on its own, even in my open-concept living room with a high, sloped ceiling. (Two Echo speakers in stereo definitely makes more sense if you pair them with a FireTV for a home theater setup.)\n The Echo also sounds good for spoken word audio, whether that’s a podcast playing through Pocket Casts or an Audible audio book. It remains a versatile speaker for a wide variety of uses.\n  As a smart speaker, the new Echo is capable of all the things that Echo speakers have been doing for years. You can ask Alexa to control smart home gadgets, set timers, give weather reports, add things to a shopping list, and so on. The list of things that Alexa can do continues to grow by the day, but most people still use smart speakers for the basics — music, alarms, timers, etc — and the Echo is very good at all of those.\n It’s also very good at picking up the “Alexa” wake word, and I don’t have to raise my voice for it to hear me even when music is playing. That’s not something I can say about the Nest Audio, where I have to consciously speak over the music to skip a track or adjust volumes. We’ll have to see how the HomePod mini fares in this regard when we’re able to test it.\n  Amazon is using its new AZ1 Neural Edge processor in the new Echo, which is designed to speed up voice recognition. Unfortunately, that won’t be enabled until later this year, so I haven’t been able to test it. In general, Alexa on the Echo responds relatively quickly and faster than Google tends to on the Nest Audio. Siri has traditionally responded quicker than either Alexa or the Google Assistant on the original HomePod — again, we’ll have to see how the HomePod mini does when we get a chance to test it.\n As if Amazon didn’t stack enough into the new Echo to make it a compelling option against the competition, it’s also included a full smart home hub inside of it. You can connect Zigbee devices such as lightbulbs, door sensors, and more right to the Echo without the need for a secondary hub, and then manage and control them through voice commands or via the Alexa smartphone app. There’s even a temperature sensor in the Echo, which can be used to trigger Alexa routines such as turning on a fan or air conditioner.\n The Echo also supports  Amazon’s new Sidewalk network, but until that actually launches, it’s hard to say what it will mean or how important it will be.\n  The progression of Amazon’s mainstream Echo speaker has been a long journey, from an odd, Pringles-can shape with admittedly terrible sound, to better-looking and sounding cylinders, to what we have now, a spherical speaker that legitimately sounds good. For a long time, if you wanted a smart speaker but cared even a little about sound quality, your choices have been to pay more for a Sonos One, a HomePod, or Amazon’s larger Echo Studio.\n  But now Amazon has brought excellent sound quality and a ton of features to a price that’s much more accessible. That price is likely to get better once Amazon’s frequent and aggressive discounts are available for the new Echo. If you already have Alexa speakers in your home, whether that’s a cheap Echo Dot or an older Echo model, the new Echo is a noticeable upgrade to throw into the mix.\n And if you have been eyeing the smart speaker world for the past half-decade but haven’t jumped in yet, the new Echo is an excellent place to start. It’s a great-sounding speaker that also happens to do a million other things.", "posttime": "2020-10-22 22:12:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,2020,声音,sound,echo", "title": "Amazon Echo(2020)评论：声音响亮，充满房间的低音，你可以听到和感觉到，以及良好的声音响应，但音乐有时听起来可能会被过度处理", "title_en": "Amazon Echo (2020) review: has loud, room-filling sound with bass you can hear and feel and good voice response, but music can sometimes sound overly processed", "transed": 1, "url": "https://www.theverge.com/21527664/amazon-echo-2020-alexa-fourth-gen-review?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["amazon", "2020", "声音", "sound", "echo"]}, {"category": "", "categoryclass": "", "imagename": "bbed075d70ebfd4e294c851d94ee307c.png", "infoid": 1030546, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上个月，谷歌购物(Google Shopping)增加了一些功能，通过提供有关可用性和路边提货选项的新信息，让本地购物变得更容易。鉴于即将到来的假日季，这家搜索公司现在宣布，它将增加价格洞察、交易提醒和更全面的商店比较工具。\n你在假日促销期间看到的许多交易可能没有你想象的那么好，今年，谷歌购物将帮助你把小麦和谷壳分开。当你在谷歌上搜索一种产品并进入购物中心选项卡时，一个新的图表会显示一种产品的当前价格与网络上典型价格的对比，这样你就可以知道什么时候你可能想要等待更长时间才能买到东西。\n这就是第二个新功能的用武之地：你可以激活价格跟踪来接收你考虑购买的任何东西的交易提醒。你需要一个谷歌帐户才能正常工作。要查看您正在跟踪的所有产品的列表，请转到您的Google帐户的我的活动概述。\n在产品的购物页面上，您可以查看和比较来自许多商店的产品价格和购买选项。本地选项和在线商店都列出了。谷歌还将在未来几天推出路边提货和店内提货。\n新的购物功能现在开始向美国的每个人开放。让我们希望谷歌的商店选择足够大，可以进行全面的概述。如果你想确定你真的得到了很划算的交易，你可能还想偶尔去看看安卓警察的“精心策划的交易”栏目。", "note_en": "Last month, Google Shopping  added features to make local shopping easier with new information on availability and curbside pickup options. In light of the upcoming holiday season, the search company has now announced that it will add price insights, deal alerts, and more comprehensive shop comparison tools.\n   Many deals you see during the holiday sales may not be as great as you think they are, and this year, Google Shopping will help you separate the wheat from the chaff. When you search for a product on Google and head to the  Shopping tab, a new graph will show you a product&#39;s current price compared to typical prices around the web, so you know when you might want to wait a little longer before you buy something.\n  That&#39;s where the second new feature comes in: You can activate price tracking to receive deal alerts for anything you consider buying. You&#39;ll need a Google account for this to work. To view a list of all products you&#39;re tracking, head to your Google account&#39;s  My Activity overview.\n  On a product&#39;s Shopping page, you can view and compare a product&#39;s prices and purchasing options from many stores. Both local options and online shops are listed. Google will also roll out curbside and in-store pickup over the next few days.\n  The new Shopping features are now starting to become available to everyone in the US. Let&#39;s hope that Google&#39;s store selection is big enough to allow for a comprehensive overview. If you want to be sure you&#39;re really getting great deals, you might also want to visit Android Police&#39;s curated  Deals section every once in a while.", "posttime": "2020-10-22 22:12:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,google,价格,购物", "title": "Google增加了价格洞察力，用于与典型价格进行比较，并向Google Shopping发送交易提醒", "title_en": "Google adds price insights for comparisons with typical prices and deal alerts to Google Shopping", "transed": 1, "url": "https://www.androidpolice.com/2020/10/22/google-shopping-will-tell-you-if-you-found-a-good-price-this-holiday-season/?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["交易", "google", "价格", "购物"]}, {"category": "", "categoryclass": "", "imagename": "a62291d4590d1fd0bee058f8a5f13899.png", "infoid": 1030545, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "间隔复制是一种传统的高效操作和操作的技术--一种古老的虚拟日志技术。在这种技术中，操作可以更高效地完成，而不是试图通过“死记硬背”来完成，而不是把每一篇评论都放在空格中，随着人们学习项目的进行，持续时间会增加，这样就可以更高效地完成操作了，而不是尝试通过“死记硬背”来完成操作。在学习项目的过程中，随着学习时间的增加，操作可以通过软件来完成，而不是尝试通过“死记硬背”来完成操作，而不是将每一篇评论都放在空格中，随着学习项目的进行，持续的时间会增加，而不是试图通过“死记硬背”来完成操作的效率要高得多，而且随着学习项目的进行，持续时间会不断增加，而日程安排则由软件来完成，效率要高得多。由于其缓慢而稳定的方法效率更高，Spaced Rep­e­tition可以扩大规模，以适应各种物品的堆积(而拥挤的物品几乎是立即获得的)，特别适用于外语和医学研究。(译者注：英语学习和医学研究都很有用)，因为它的缓慢而稳定的方法效率更高，可以扩展到各种物品的堆积如山(而拥挤的物品几乎是立即获得的)，特别适用于外语和医学研究。\n我回顾了这项技术的用处，一些关于它的大型研究成果和测试效果(主要是到2013年)，可用的软件工具和使用方式，以及对它的错误想法和观察。\n计算机最有成效的领域之一是弥补人类的弱点。他们做得很好，因为我们不能1。他们记住更多的字节，因为我们会。他们是最好的应召人员，因为他们总是检查今天要做的事情。即使我们记不清，仅仅记住参考文献也是一样好的，就像从头到尾阅读一本手册或课本一样：不是为了以后记住书中的每一件事，而是后来记住书中的一些东西(浏览它们，当你确实需要更多地了解一本顶级书籍时，你会学到要搜索的正确单词)。(如果你真的需要更多地了解一本顶级书籍，你就可以学习合适的词来搜索)，就像从头到尾阅读一本手册或课本一样：不是为了以后记住里面的每一件事，而是为了以后记住里面的一些东西。(当你确实需要更多地了解一本顶级书籍的时候，你可以学习合适的词来搜索。)。\n我们使用任何数量的s2，但总是有更多的数字需要分发。它们值得一看，因为它们非常有价值：一把铲子比你的手有效得多，但一份大订单比两者都要好-即使它需要培训和实验才能使用。\n“你可以从排练中得到很好的回报，如果排练的位置合适的话。”你只会是个笨蛋，如果一起去做，你的记忆会变得非常糟糕。“。\n我目前最喜欢的专业是一类软件，它利用计算机心理学中的一种古老的观察手段，在研究或测试方面取得比传统研究技术好得多的结果；可惜，它是默默无闻的。\n空间效应本质上说，如果你有一个问题(“你学到的这个随机序列中的第五个字母是什么？”)，而你只能学习它，比如说，5次，那么如果你把5次尝试分散在很长的一段时间里--比如几天、几周、几个月--你对答案(E)的记忆将会最强烈。你能做的最糟糕的事情之一就是在一两天内搞砸你的5次尝试。你可以把“”想象成一张放射物质的图表：比方说，每一次评论都会使你的记忆在图表中的强度提升50%，但在早期，评论不会起到什么作用，因为记忆并没有衰退太多！(译者注：这句话的意思是：“每一次评论都会让你的记忆力提高50%，但在早期，评论不会起到多大作用，因为记忆并没有衰退太多！)”(为什么空间效应会在生物对数水平上起作用？在常规模式下，集中和间隔之间有明显的化学差异，空间(&gt；1小时)增加，但不是集中5，而是为什么和在哪里-这是一个开放的问题；参见睡眠研究的概念或睡眠研究。)。形成曲线的图形表示：\n更好的是，众所周知，这是一种比简单地暴露在信息中要好得多的学习方法。6空间还可以扩展到巨大的信息量；赌徒兼金融家在物理研究生时代就接受了“空间学习”，“以便能够更长时间、更努力地工作”7，并在2010-2011年的智力竞赛节目中创造了多项纪录，这在一定程度上要归功于使用Anki记录了20万道过去的问题8；后来的获胜者阿瑟·朱(Arthur Chu)也使用了间隔代表9。医学院的学生(由于需要在医学院学习大量的实际材料而成为主要的演示对象)通常都有一堆纸牌，特别是如果使用预制的纸牌(因为相当标准的定制卡片制作时间太少，医学电影更容易做到)。对于外语学习者来说，很容易就能拿到10-30,000张卡片；一位Anki用户报告说，有一副&gt；765k自动生成的卡片，里面装满了来自许多来源(“YouTube视频、视频游戏、电视节目等”)的日本音频样本。\n一张图表可能会有帮助；在这里，人们可以负担得起多次查看一条给定的信息(一个人是一个忙碌的人)。通过观察我们能记住这件物品的几率，我们可以看到，临时抱佛脚在短期内获胜，但未经改造的物品腐烂得如此之快，以至于在不太长的时间内就会变得更好：\n如果我们看一段视频，用随机评论VS最新评论VS间隔评论来查看一堆记忆库的腐烂，那就更有意义了。\n当然，后一种策略(死记硬背)是学生要做的事情。他们在考试前一晚临时抱佛脚，一个月后就什么都记不起来了。那么人们为什么要这么做呢？(我自己并不知情。)。为什么间隔的代表如此可怕地不流行，即使在试过一次的人中也是如此？11。\n因为它确实起作用了。说大也大吧。死记硬背是一种权衡：你现在用强大的记忆来换取以后的弱记忆。(非常弱的12。)。而且测试通常是所有新伙伴的测试，偶尔会有老问题，所以这个策略是值得的！。这就是它的致命之处--总的来说，它的记忆寿命和质量不如间隔复制，但现在填鸭式交付它的产品有13种。因此，填鸭式是一种比率，即使是短视的话，它的反应，甚至是软件重组，都会在一定程度上支持它的实用和支持14。(但正如人们可能预期的那样，如果考试是持续和递增的，那么学习往往也会很长15；我不知道这是因为那种考试是一个分散的、分散的、分散的代表系统，还是学生/受试者在应对简单的考试时学习/行为不同。)。除了这一短期优势之外，还有一点就是空间的优势，以及一种潜在的错觉，即收益将持续16 17(参见。Son&amp；Simon 2012 18，Mul­li­gan&amp；Peter­son 2014，Bjork等人，2013)；摘自Kor­Nell 2009年的词汇研究(增加了EMPHAIS)：\n纵观实验，对于90%的受试者来说，空置比质量更有效，然而在第一次研究选择之后，72%的受试者认为质量比空置…更有效。.当他们确实考虑空间时，他们经常表现出一种错觉，即集体研究比间隔研究更有效，即使相反的情况也是如此(Dun­losky&amp；Nel­son，1994；Kor­nell&amp；Bjork，2008a；Simon&amp；Bjork 2001；Zech-Meis­ter&amp；Shaugh­nessy，1980)。\n正如人们预期的那样，如果考试和空间效应是真实存在的，那些不进行自我测试并在考试前提前学习的学生往往得分更高。19如果我们将问题解释为测试，我们并不意外地看到一对一辅导比常规教学有效，而且被辅导的学生回答了更多问题20的命令。\n当然，从长远来看，这种短期预期并不是一件好事。知识是建立在知识的基础上的；我们不是在学习独立的琐碎知识。在以下位置召回：\n你可以观察到，大多数伟大的科学工作者都有令人敬畏的钻研精神。我在AT工作了十年。他已经喝得酩酊大醉了。在我加入约三四年后的一天，我发现约翰·图基比我年轻一点。约翰是个天才，而我显然不是。我怒气冲冲地走进他的办公室，说：“我这个年纪的人怎么可能像约翰·图基那样知道这么多呢？”他向后靠在椅子上，双手放在脑后，微微地笑着说：“你会吃惊的，如果你像他那样努力工作那么多年，你会知道多少。”我会悄悄溜出办公室！\n波德说的是这样的：“知识和生产力是一样的。”如果两个人的能力大致相同，而一个人的工作能力比另一个人多10%，那么后者的产量将是前者的两倍以上。你知道的越多，你学的越多；你学的越多，你能做的越多；你能做的越多，机会就越多--这很像是一种利益。我不想给你一个费率，但这是一个非常高的费率。假设两个人拥有完全相同的能力，一个人日复一日地花时间多思考一个小时，那么他一生中的工作效率会高得多。(编者注：这句话的意思是：“如果两个人有完全相同的能力，那么一个人日复一日地花时间多思考一个小时的话，他一生的工作效率会高得多。)”我把博德的话放在心上；几年来，我花了更多的时间努力工作，我发现，事实上，我可以完成更多的工作。\n知识需要积累，而带有间隔代表的抽认卡就可以帮助实现这种积累，即使卡的数量和智能要求越来越多，也能进行稳定的审查。“”。\n这种长期关注或许可以解释为什么明确间隔的代表是一种不常见的研究技术：回报是分散的&与之相反，自我控制的成本几乎是生动的，这可能就解释了为什么这是一种不常见的研究技术：回报是分散的，而自我控制的成本几乎是生动的，这可能就解释了为什么显式间隔的代表是一种不常见的研究技术：回报是分散的，而自我控制的成本几乎是生动的。(请参见。)。很难确定什么时候应该复习，这一点也无济于事--最佳点是在你正要开始复习的时候，但那才是关键：如果你正要开始复习，你应该如何记住复习它呢？这对你来说没有什么帮助，但这才是最重要的：如果你正要开始复习，你应该如何记住复习它呢？这也是无济于事的，因为它很难确定一个人应该在什么时候复习--最佳点是在你刚刚要开始复习的时候。你只记得复习你记得的，已经记住的不是你需要复习的！\n解决办法是让一台计算机处理所有的计算。我们可以感谢她Mann Ebding Haus在如此繁琐的细节上的投入，事实上，我们无法编写计算机来计算形成曲线和最佳评论集22。这就是软件背后的洞察力：一遍又一遍地问同样的问题，但会随着时间的推移而增加。你开始每隔几天问它一次，很快人类就能很好地记住它。然后，你将间隔时间扩大到几周，然后是几个月，然后是几年。一旦记忆形成并转移到长期记忆中，它只需要偶尔的锻炼就能保持23岁的精力充沛-我清楚地记得我第4天或第5天用纸板做的大恐龙，或者用盒子做的管子，尽管我一年最多收集一两次它们。\n但是不要相信我的话--用动词来说就是NULL­lius！我们可以看看科学。当然，如果你真的相信我的话，你可能只是想看看如何使用它，以及你能做的所有漂亮的事情，所以我建议你跳过这一节。其他人，我们从头开始：\n“如果你把一篇课文读了二十遍，你就不会把它背得那么容易，就像你时不时地试着背诵十遍，当你记不住的时候就把课文背出来一样。”--，\n这是一种已经建立起来的心理证据，即仅仅是测试某人的记忆就会加强记忆(不管是否有反馈)。既然只是在正常的日子里测试，我们应该确定测试比定期复习或学习更有效，而且它在他的工作中也是有效的。要涵盖几篇论文，请执行以下操作：\n艾伦、G.A.、马勒、W.A.和Amp；Estes，W.K.(1969)。“回忆测试对配对亲属长期保留的影响”。Ver­bal学习与Ver­bal Behavior学报，8,463-470\n1个测试结果在一天后的强度相当于研究的5倍；与集中预读相比，间歇测试提高了保留率。\n在学习斯瓦希里语词汇时，给了学生不同的测试或学习，或者测试和学习；这导致了学习阶段的分数很接近。学生们被要求预测他们能记住的百分比(平均：所有组的50%)。一周后，考生对非考生的词汇记忆率约为80%~35%。有些学生接受了比其他学生更多的测试或研究；一旦记忆形成，第一天就会很快产生模糊的结果。据报道，学生很少测试自己，也很少测试已经学过的东西。\n在5分钟、2天和1周的时间里，对学生进行了阅读能力测试(没有反馈)。学习胜过了5分钟的测试，但没有别的；学生们认为学习比测试所有的时间都要好。在1周时，测试分数为60%，而不是40%。\n教训：与学习相比，测试提高了记忆力。每个人(老师和学生)都“知道”这个网站。\n来自Roedi­ger&amp；Karpicke 2006b的综合科学散文：“两天后，初步测试比重新学习有更好的保留效果(68%比54%)，一周后测试比再学习有更多优势(56%比42%)。”(罗迪格与卡派克出版社2006b)：“两天后，初步测试比再学习有更好的保留效果(68%比54%)，而且在一周后也观察到了测试比再学习更有优势(56%比42%)。”这句话出自Roedi­ger；amp；Karpicke 2006b。\n图片回顾；1941年之前的7项研究改善了保留率，而1941年之后的6项研究则提高了保留率。另请参阅评论“随着时间的推移为学习事件提供空间：研究说了些什么”&amp；“使用空间增强各种形式的学习：最近研究的回顾和对教学的启示”，Car-Pen­ter等人，2012年出版的“Spac­ing Learing Events Over Time：What the Research to Enhanced Format of Learning­：Review of Recent Research and Implitions for Instructions”。\n与#2一样，从长远来看，更纯粹的测试形式(在这种情况下，开卷测试比闭卷测试)确实更好，学生们被欺骗了，认为哪种测试效果最好。\n对35名在校学生(1929-1989年)不同测试的荟萃分析。29个发现错误；5个发现否定；1个结果为空。Meta-s­tudy找到了需要测试的大本领，哪怕只有一次，然后就会返回。\n库克2006，“自我评估问题和学习风格在基于网络的学习中的影响：随机、对照、交叉试验”；当医生(受访者)通过问题学习时，最终分数更高。\nJohn­son&amp；Kiviniemi 2009，(“这项研究测试了每周以考试为基础的计算机阅读测验作为提高考试和课程成绩的一种手段的有效性。阅读测验的完成既与更好的考试有关，也与课程成绩有关。“)；另见McDaniel等人2012年。\nMeyer&amp；Logan 2013，“将测试效应带到大学新生之外：适合终身学习”(Tak­ing the Test­ing Effect Beyond the Colge First­man：Benefits for Life Life Learning)；VERIFIIES测试效应在老年人中的影响程度与年轻人相似。\n(人们可能会忍不住反对测试适用于某些(可能是普通的)风格。这是一种不受支持的说法，因为关于学习风格的实验说明很差，现有的证据混杂在一起，认为存在学习风格这样的东西。24)。\n上述研究人员经常自己使用成对的词或词。测试效果的生成情况如何？\n用于外国语词汇(例如。Karpicke&amp；Roedi­ger 2003，Cepeda等人2009，Fritz等人2007 25，de la Rouviere 2012)。\nMate­als(如Workab，Kor­nell 2009)；通用科学顶级文章(Karpicke&amp；Roedi­ger，2006a；Pash­ler et al，2003)的散文短文(Karpicke&amp；Roedi­ger，2006a；Pash­ler et al，2003)。\n开设生物图学、材料和科学等科目的电子中学课程(盖茨1917；斯皮策1939 26；Vlach&amp；Sand­Hofer 2012 27，分别为：盖茨1917；斯皮策1939 26；Vlach&amp；Sand­Hofer 2012 27)\n他的历史教科书；保留更好的是初始的短答测验，而不是多项选择(Nungester&Amp；Duchas­tel 1982)。\nDuchas­tel(1981)：自由回忆决定性地击败了Short-Answer&amp；阅读历史短文摘要的多重选择。\n格洛弗(1989)：自由召回自测节拍识别；主题垫是部分流动体的标签。\nKang，McDer­Mott和Roedi­ger(2007)：散文通过；3天后在多项选择题和简答题测试中产生高级结果的初始简答测试。\nLeem­ing(2002)：2门心理学课程的测试，入门和记忆/学习；“入门心理学课程的80%比74%，学习和记忆课程的89%比80%”28。\n这涵盖了相当广泛的范围，人们可以称之为“衰落性”知识。将测试扩展到其他领域则更加困难，可能会简化为“写很多频繁的分析，而不是大的”，或者“做很多小练习”，无论这些在这些领域中意味着什么：\n与第二个问题有关的第三个问题是，我们的测试比例是否真的适用于带有复杂主题的课程，比如Spin­Oza的哲学、Shake Speare的来龙去脉或创造性写作。可以肯定的是，我们同意大多数形式的客观测试在这类课程中都是不同的，但我们确实相信测试(广义地说)的一般理论是成立的-学生应该由学科测试人员持续参与和改革，而不应该只有期中和期末考试(即使是作文考试也不应该这样做)，这一点我们是同意的，但我们也同意，大多数形式的客观测试在这类课程中都是不同的，但我们确实认为，测试(广义地说)的总体理论是成立的--学生应该由主题测试人员持续参与和延长考试时间，而不应该只有期中和期末考试(即使是作文考试)。一门关于Spin­Oza的课程的学生可能会被指派每周完成特定的阅读和思考作文问题。这将是一种每周“考试”(也就是带回家的考试)的转换形式。连续考试要求学生不断地投入到一门课程中；直到期中考试和期末考试临近，他们才能顺利完成学业，只有到那时才能开始学习。(这句话的意思是：“连续考试”要求学生持续投入到一门课程中；直到期中考试和期末考试临近时，他们才能顺利完成考试，然后才能开始学习。)。29个。\n记忆测试项目的回忆能力的差异使其能够记忆较小的未测试的项目，从而提高了记忆测试项目的能力，提高了对测试项目的记忆能力，提高了对测试项目的记忆能力，提高了对测试项目的记忆能力，提高了对较小未测试项目的记忆能力\n总而言之，尽管各种类型的回忆干预相当真实(也相当有趣)，但我们不认为它们符合测试强化学习的概念。在最坏的情况下，这种干扰可能会削弱一些积极的测试效果。然而，测试的正面影响通常是如此之大，以至于在大多数情况下，它们会压倒相对最先进的相互影响。\n多项选择测试可能会导致“负面建议效应”，即以前在测试中将错误视为一个项目会让人更容易相信它。\n当有关于正确答案的快速反馈时，这是麻省理工学院或省略的(参见Buter&amp；Roedi­ger 2008“反馈增强多项选择测试的正面影响和减少负面影响”)。(请参阅Buter&amp；Roedi­ger 2008“反馈增强多项选择测试的正面影响和减少负面影响”)。(请参阅BUTER&AMP；ROEDI­ger 2008“反馈增强多项选择测试的正面影响和减少负面影响”)。解决方案：不要使用多项选择；无论如何都要参与测试自由回忆或简短答案的能力。\n这在很大程度上取决于你什么时候做所有的测试。在上面，我们看到了一些适合在你学到一些东西的时候进行大量测试的地方，但同样数量的测试可以随着时间的推移而分散，以给我们带来空间效应或间隔的代表。有很多研究涉及到空间效应：\n几乎不出所料的是，他们发现，当最终测试/测量在30天或30年后进行时，分散测试要优于集中测试，尽管机制尚不清楚31。除了所有以前由男性参与的研究，我们还可以加入：\n彼得森，L.R.，万普勒，R.，柯克帕特里克，M.，&&萨尔茨曼，D.(1963)。“间隔预留对短间隔内配对伴生保留的影响”。“实践心理学学报”，66(2)，206-209。\nGlen­berg，A.M.(1977)。“自由回忆中提取过程对空间效应的影响”。“实验心理学学报：人类的学习与记忆”，第3卷第3期，第282-294页。\nBalota等人\n.", "note_en": "Spaced rep­e­ti­tion is a cen­turies-old psy­cho­log­i­cal tech­nique for effi­cient mem­o­riza­tion &amp; prac­tice of skills where instead of attempt­ing to mem­o­rize by ‘cram­ming’, mem­o­riza­tion can be done far more effi­ciently by instead spac­ing out each review, with increas­ing dura­tions as one learns the item, with the sched­ul­ing done by soft­ware. Because of the greater effi­ciency of its slow but steady approach, spaced rep­e­ti­tion can scale to mem­o­riz­ing hun­dreds of thou­sands of items (while crammed items are almost imme­di­ately for­got­ten) and is espe­cially use­ful for for­eign lan­guages &amp; med­ical stud­ies.\n I review what this tech­nique is use­ful for, some of the large research lit­er­a­ture on it and the test­ing effect (up to ~2013, pri­mar­i­ly), the avail­able soft­ware tools and use pat­terns, and mis­cel­la­neous ideas &amp; obser­va­tions on it.\n One of the most fruit­ful areas of com­put­ing is mak­ing up for human frail­ties. They do arith­metic per­fectly because we can’t  1. They remem­ber ter­abytes because we’d for­get. They make the best cal­en­dars, because they always check what there is to do today. Even if we do not remem­ber exact­ly, merely remem­ber­ing a ref­er­ence can be just as good, like the point of read­ing a man­ual or text­book all the way through: it is not to remem­ber every­thing that is in it for later but to later remem­ber  that some­thing is in it (and skim­ming them, you learn the right words to search for when you actu­ally need to know more about a par­tic­u­lar top­ic).\n We use any num­ber of such  s  2, but there are always more to be dis­cov­ered. They’re worth look­ing for because they are so valu­able: a shovel is much more effec­tive than your hand, but a   is orders of mag­ni­tude bet­ter than both - even if it requires train­ing and exper­tise to use.\n “You can get a good deal from rehearsal, If it just has the proper dis­per­sal. You would just be an ass, To do it  en masse, Your remem­ber­ing would turn out much wor­sal.”\n My cur­rent favorite pros­the­sis is the class of soft­ware that exploits the  , a cen­turies-old obser­va­tion in cog­ni­tive psy­chol­o­gy, to achieve results in study­ing or mem­o­riza­tion much bet­ter than con­ven­tional stu­dent tech­niques; it is, alas, obscure  4.\n The spac­ing effect essen­tially says that if you have a ques­tion (“What is the fifth let­ter in this ran­dom sequence you learned?”), and you can only study it, say, 5 times, then your mem­ory of the answer (‘e’) will be strongest if you spread your 5 tries out over a long period of time - days, weeks, and months. One of the worst things you can do is blow your 5 tries within a day or two. You can think of the ‘ ’ as being like a chart of a radioac­tive  : each review bumps your mem­ory up in strength 50% of the chart, say, but review does­n’t do much in the early days because the mem­ory sim­ply has­n’t decayed much! ( Why does the spac­ing effect work, on a bio­log­i­cal lev­el? There are clear neu­ro­chem­i­cal dif­fer­ences between massed and spaced  in ani­mal mod­els with spac­ing (&gt;1 hour) enhanc­ing   but not massed  5, but the why and where­fore - that’s an open ques­tion; see the con­cept of   or the  sleep stud­ies.) A graph­i­cal rep­re­sen­ta­tion of the for­get­ting curve:\n  Even bet­ter, it’s known that   is a far supe­rior method of learn­ing than sim­ply pas­sively being exposed to infor­ma­tion.  6 Spac­ing also scales to huge quan­ti­ties of infor­ma­tion; gambler/ financier   har­nessed “spaced learn­ing” when he was a physics grad stu­dent “in order to be able to work longer and harder”  7, and   set mul­ti­ple records on the quiz show    2010–2011 in part thanks to  using Anki to mem­o­rize chunks of a col­lec­tion of  &gt;200,000 past ques­tions  8; a later Jeop­ardy win­ner, Arthur Chu, also used spaced rep­e­ti­tion  9. Med school stu­dents (who have become a major demo­graphic for   due to the extremely large amounts of fac­tual mate­r­ial they are expected to mem­o­rize dur­ing med­ical school) usu­ally have thou­sands of cards, espe­cially if using pre-­made decks (more fea­si­ble for med­i­cine due to fairly stan­dard­ized cur­ricu­lums &amp; gen­eral lack of time to make cus­tom card­s). For­eign-lan­guage learn­ers can eas­ily reach 10-30,000 cards;  one Anki user reports a deck of &gt;765k  auto­mat­i­cal­ly-­gen­er­ated cards filled with Japan­ese audio sam­ples from many sources (“Youtube videos, video games, TV shows, etc”).\n A graphic might help; imag­ine here one can afford to review a given piece of infor­ma­tion a few times (one is a busy per­son). By look­ing at the odds we can remem­ber the item, we can see that cram­ming wins in the short term, but unex­er­cised mem­o­ries decay so fast that after not too long spac­ing is much supe­ri­or:\n  It’s more dra­matic if we look at a video visu­al­iz­ing decay of a cor­pus of mem­ory with  ran­dom review vs most-re­cent review vs spaced review.\n Of course, the lat­ter strat­egy (cram­ming) is pre­cisely what stu­dents do. They cram the night before the test, and a month later can’t remem­ber any­thing. So why do peo­ple do it? (I’m not inno­cent myself.) Why is spaced rep­e­ti­tion so dread­fully unpop­u­lar, even among the peo­ple who try it once?  11\n  Because it does work. Sort of. Cram­ming is a trade-off: you trade a strong mem­ory now for weak mem­ory lat­er. (Very weak  12.) And tests are usu­ally of all the new mate­ri­al, with occa­sional old ques­tions, so this strat­egy pays off! That’s the damnable thing about it - its mem­ory longevity &amp; qual­ity are, in sum, less than that of spaced rep­e­ti­tion, but cram­ming deliv­ers its goods  now  13. So cram­ming is a ratio­nal, if short­-sight­ed, respon­se, and even   soft­ware rec­og­nize its util­ity &amp; sup­port it to some degree  14. (But as one might expect, if the test­ing is con­tin­u­ous and incre­men­tal, then the learn­ing tends to also be long-lived  15; I do not know if this is because that kind of test­ing is a dis­guised acci­den­tal spaced rep­e­ti­tion sys­tem, or the students/ subjects sim­ply studying/ acting dif­fer­ently in response to smal­l­-s­takes exam­s.) In addi­tion to this short­-term advan­tage, there’s  an igno­rance of the advan­tages of spac­ing and a sub­jec­tive  illu­sion that the gains per­sist  16  17 (cf. Son &amp; Simon 2012  18,  Mul­li­gan &amp; Peter­son 2014,  Bjork et al 2013,  ); from  Kor­nell 2009’s study of   vocab (em­pha­sis added):\n Across exper­i­ments,  spac­ing was more effec­tive than mass­ing for 90% of the par­tic­i­pants, yet after the first study ses­sion, 72% of the par­tic­i­pants believed that  mass­ing had been more effec­tive than spac­ing….When they do con­sider spac­ing, they often exhibit the illu­sion that massed study is more effec­tive than spaced study, even when the reverse is true ( Dun­losky &amp; Nel­son, 1994; Kor­nell &amp; Bjork, 2008a;  Simon &amp; Bjork 2001;  Zech­meis­ter &amp; Shaugh­nessy, 1980).\n As one would expect if the test­ing and spac­ing effects are real things, stu­dents who nat­u­rally test them­selves and study well in advance of exams tend to have higher  s.  19 If we inter­pret ques­tions as tests, we are not sur­prised to see that 1-on-1 tutor­ing works   than reg­u­lar teach­ing and that tutored stu­dents answer orders of mag­ni­tude more ques­tions  20.\n This short­-term per­spec­tive is not a good thing in the long term, of course. Knowl­edge builds on knowl­edge; one is not learn­ing inde­pen­dent bits of triv­ia.   recalls in  :\n You observe that most great sci­en­tists have tremen­dous dri­ve. I worked for ten years with   at  . He had tremen­dous dri­ve. One day about three or four years after I joined, I dis­cov­ered that John Tukey was slightly younger than I was. John was a genius and I clearly was not. Well I went storm­ing into  ’s office and said, “How can any­body my age know as much as John Tukey does?” He leaned back in his chair, put his hands behind his head, grinned slight­ly, and said, “You would be sur­prised Ham­ming, how much you would know if you worked as hard as he did that many years.” I sim­ply slunk out of the office!\n What Bode was say­ing was this: “Knowl­edge and pro­duc­tiv­ity are like  .” Given two peo­ple of approx­i­mately the same abil­ity and one per­son who works 10% more than the oth­er, the lat­ter will more than twice out­pro­duce the for­mer. The more you know, the more you learn; the more you learn, the more you can do; the more you can do, the more the oppor­tu­nity - it is very much like com­pound inter­est. I don’t want to give you a rate, but it is a very high rate. Given two peo­ple with exactly the same abil­i­ty, the one per­son who man­ages day in and day out to get in one more hour of think­ing will be tremen­dously more pro­duc­tive over a life­time. I took Bode’s remark to heart; I spent a good deal more of my time for some years try­ing to work a bit harder and I found, in fact, I could get more work done.\n Knowl­edge needs to accu­mu­late, and flash­cards with spaced rep­e­ti­tion can aid in just that accu­mu­la­tion, fos­ter­ing steady review even as the num­ber of cards and intel­lec­tual pre­req­ui­sites mounts into the  thou­sands.\n This long term focus may explain why explicit spaced rep­e­ti­tion is an uncom­mon study­ing tech­nique: the pay-off is dis­tant &amp; coun­ter­in­tu­itive, the cost of self­-­con­trol near &amp; vivid. (See  .) It does­n’t help that it’s pretty dif­fi­cult to fig­ure out  when one should review - the opti­mal point is when you’re just about to for­get about it, but that’s the kick­er: if you’re just about to for­get about it, how are you sup­posed to remem­ber to review it? You only remem­ber to review what you remem­ber, and what you already remem­ber isn’t what you need to review!  21\n The para­dox is resolved by let­ting a com­puter han­dle all the cal­cu­la­tions. We can thank  Her­mann Ebbing­haus for inves­ti­gat­ing in such tedious detail than we can, in fact, pro­gram a com­puter to cal­cu­late both the for­get­ting curve and opti­mal set of reviews  22. This is the insight behind   soft­ware: ask the same ques­tion over and over, but over increas­ing spans of time. You start with ask­ing it once every few days, and soon the human remem­bers it rea­son­ably well. Then you expand inter­vals out to weeks, then months, and then years. Once the mem­ory is formed and dis­patched to long-term mem­o­ry, it needs but occa­sional exer­cise to remain hale and hearty  23 - I remem­ber well the large dinosaurs made of card­board for my 4 th or 5 th birth­day, or the tun­nel made out of box­es, even though I rec­ol­lect them once or twice a year at most.\n But don’t take my word for it -  Nul­lius in verba! We can look at the sci­ence. Of course, if you do take my word for it, you prob­a­bly just want to read about how to use it and all the nifty things you can do, so I sug­gest you  skip all the way down to that sec­tion. Every­one else, we start at the begin­ning:\n “If you read a piece of text through twenty times, you will not learn it by heart so eas­ily as if you read it ten times while attempt­ing to recite from time to time and con­sult­ing the text when your mem­ory fails.” –  ,\n The   is the estab­lished psy­cho­log­i­cal obser­va­tion that the mere act of test­ing some­one’s mem­ory will strengthen the mem­ory (re­gard­less of whether there is feed­back). Since   is just test­ing on par­tic­u­lar days, we ought to estab­lish that test­ing works bet­ter than reg­u­lar review or study, and that it works out­side of mem­o­riz­ing ran­dom dates in his­to­ry. To cover a few papers:\n Allen, G.A., Mahler, W.A., &amp; Estes, W.K. (1969).  “Effects of recall tests on long-term reten­tion of paired asso­ciates”.  Jour­nal of Ver­bal Learn­ing and Ver­bal Behav­ior, 8, 463-470\n 1 test results in mem­o­ries as strong a day later as study­ing 5 times; inter­vals improve reten­tion com­pared to massed pre­sen­ta­tion.\n In learn­ing Swahili vocab­u­lary, stu­dents were given vary­ing rou­tines of test­ing or study­ing or test­ing and study­ing; this resulted in sim­i­lar scores dur­ing the learn­ing phase. Stu­dents were asked to pre­dict what per­cent­age they’d remem­ber (av­er­age: 50% over all group­s). One week lat­er, the stu­dents who tested remem­bered ~80% of the vocab­u­lary ver­sus ~35% for non-test­ing stu­dents. Some stu­dents were tested or stud­ied more than oth­ers; dimin­ish­ing returns set in quickly once the mem­ory had formed the first day. Stu­dents reported rarely test­ing them­selves and not test­ing already learned items.\n Stu­dents were tested (with no feed­back) on read­ing com­pre­hen­sion of a pas­sage over 5 min­utes, 2 days, and 1 week. Study­ing beat test­ing over 5 min­utes, but nowhere else; stu­dents believed study­ing supe­rior to test­ing over all inter­vals. At 1 week, test­ing scores were ~60% ver­sus ~40%.\n Lesson: test­ing improves mem­ory com­pared to study­ing. Every­one (teach­ers &amp; stu­dents) ‘knows’ the oppo­site.\n Gen­eral sci­en­tific prose com­pre­hen­sion; from Roedi­ger &amp; Karpicke 2006b: “After 2 days, ini­tial test­ing pro­duced bet­ter reten­tion than restudy­ing (68% vs. 54%), and an advan­tage of test­ing over restudy­ing was also observed after 1 week (56% vs. 42%).”\n Lit­er­a­ture review; 7 stud­ies before 1941 demon­strat­ing test­ing improves reten­tion, and 6 after­wards. See also the reviews  “Spac­ing Learn­ing Events Over Time: What the Research Says” &amp;  “Using spac­ing to enhance diverse forms of learn­ing: Review of recent research and impli­ca­tions for instruc­tion”, Car­pen­ter et al 2012.\n As with #2, the purer forms of test­ing (in this case, open-­book ver­sus closed-­book test­ing) did bet­ter over the long run, and stu­dents were deluded about what worked best.\n Meta-­analy­sis of 35 stud­ies (1929-1989) vary­ing tests dur­ing school semes­ters. 29 found ben­e­fits; 5 found neg­a­tives; 1 null result. Meta-s­tudy found large ben­e­fits to test­ing even once, then dimin­ish­ing returns.\n Cook 2006,  “Impact of self­-assess­ment ques­tions and learn­ing styles in Web-based learn­ing: a ran­dom­ized, con­trolled, crossover trial”; final scores were higher when the doc­tors (res­i­dents) learned with ques­tions.\n John­son &amp; Kiviniemi 2009,   (“This study exam­ined the effec­tive­ness of com­pul­so­ry, mas­tery-based, weekly read­ing quizzes as a means of improv­ing exam and course per­for­mance. Com­ple­tion of read­ing quizzes was related to both bet­ter exam and course per­for­mance.”); see also  McDaniel et al 2012.\n  Meyer &amp; Logan 2013,  “Tak­ing the Test­ing Effect Beyond the Col­lege Fresh­man: Ben­e­fits for Life­long Learn­ing”; ver­i­fies test­ing effect in older adults has sim­i­lar effect size as younger\n (One might be tempted to object that test­ing works for  some  , per­haps ver­bal styles. This is an unsup­ported asser­tion inas­much as the exper­i­men­tal lit­er­a­ture on learn­ing styles is poor and the exist­ing evi­dence mixed that there are such things as learn­ing styles.  24)\n The above stud­ies often used pairs of words or words them­selves. How well does the test­ing effect gen­er­al­ize?\n  for­eign vocab­u­lary (eg. Karpicke &amp; Roedi­ger 2003,  Cepeda et al 2009, Fritz et al 2007  25,  de la Rou­viere 2012)\n mate­ri­als (like vocab,  Kor­nell 2009); prose pas­sages on gen­eral sci­en­tific top­ics (Karpicke &amp; Roedi­ger, 2006a; Pash­ler et al, 2003)\n  ele­men­tary &amp; mid­dle school lessons with sub­jects such as bio­graph­i­cal mate­r­ial and sci­ence ( Gates 1917;  Spitzer 1939  26 and Vlach &amp; Sand­hofer 2012  27, respec­tive­ly)\n  his­tory text­books; reten­tion bet­ter with ini­tial short­-an­swer test rather than mul­ti­ple choice ( Nungester &amp; Duchas­tel 1982)\n   Duchas­tel (1981): free recall deci­sively beat short­-an­swer &amp; mul­ti­ple choice for read­ing com­pre­hen­sion of a his­tory pas­sage\n Glover (1989): free recall self­-test beat recog­ni­tion or  ; sub­ject mat­ter was the labels for parts of flow­ers\n Kang, McDer­mott, and Roedi­ger (2007): prose pas­sages; ini­tial short answer test­ing pro­duced supe­rior results 3 days later on both mul­ti­ple choice and short answer tests\n Leem­ing (2002): tests in 2 psy­chol­ogy cours­es, intro­duc­tory &amp; memory/ learning; “80% vs. 74% for the intro­duc­tory psy­chol­ogy course and 89% vs. 80% for the learn­ing and mem­ory course”  28\n This cov­ers a pretty broad range of what one might call ‘declar­a­tive’ knowl­edge. Extend­ing test­ing to other fields is more dif­fi­cult and may reduce to ‘write many fre­quent analy­ses, not large ones’ or ‘do lots of small exer­cises’, what­ever those might mean in those fields:\n A third issue, which relates to the sec­ond, is whether our pro­posal of test­ing is really appro­pri­ate for courses with com­plex sub­ject mat­ters, such as the phi­los­o­phy of Spin­oza, Shake­speare’s come­dies, or cre­ative writ­ing. Cer­tain­ly, we agree that most forms of objec­tive test­ing would be dif­fi­cult in these sorts of cours­es, but we do believe the gen­eral phi­los­o­phy of test­ing (broadly speak­ing) would hold-s­tu­dents should be con­tin­u­ally engaged and chal­lenged by the sub­ject mat­ter, and there should not be merely a midterm and final exam (even if they are essay exam­s). Stu­dents in a course on Spin­oza might be assigned spe­cific read­ings and thought-pro­vok­ing essay ques­tions to com­plete every week. This would be a trans­fer­-ap­pro­pri­ate form of weekly ‘test­ing’ (al­beit with take-home exam­s). Con­tin­u­ous test­ing requires stu­dents to con­tin­u­ously engage them­selves in a course; they can­not coast until near a midterm exam and a final exam and begin study­ing only then.  29\n inter­fer­ence in recall - abil­ity to remem­ber tested items dri­ves out abil­ity to remem­ber sim­i­lar untested items\n  In sum, although var­i­ous types of recall inter­fer­ence are quite real (and quite inter­est­ing) phe­nom­e­na, we do not believe that they com­pro­mise the notion of test-en­hanced learn­ing. At worst, inter­fer­ence of this sort might dampen pos­i­tive test­ing effects some­what. How­ev­er, the pos­i­tive effects of test­ing are often so large that in most cir­cum­stances they will over­whelm the rel­a­tively mod­est inter­fer­ence effects.\n mul­ti­ple choice tests can acci­den­tally lead to ‘neg­a­tive sug­ges­tion effects’ where hav­ing pre­vi­ously seen a false­hood as an item on the test makes one more likely to believe it.\n This is mit­i­gated or elim­i­nated when there’s quick feed­back about the right answer (see But­ler &amp; Roedi­ger 2008  “Feed­back enhances the pos­i­tive effects and reduces the neg­a­tive effects of mul­ti­ple-­choice test­ing”). Solu­tion: don’t use mul­ti­ple choice; infe­rior in test­ing abil­ity to free recall or short answers, any­way.\n A lot depends on  when you do all your test­ing. Above we saw some ben­e­fits to test­ing a lot the moment you learn some­thing, but the same num­ber of tests could be spread out over time, to give us the  spac­ing effect or  spaced rep­e­ti­tion. There are hun­dreds of stud­ies involv­ing the spac­ing effect:\n  Almost unan­i­mously they find spac­ing out tests is supe­rior to massed test­ing when the final test/ measurement is con­ducted days or years later  30, although the mech­a­nism isn’t clear  31. Besides all the pre­vi­ously men­tioned stud­ies, we can throw in:\n Peter­son, L. R., Wampler, R., Kirk­patrick, M., &amp; Saltz­man, D. (1963).  “Effect of spac­ing pre­sen­ta­tions on reten­tion of a paired asso­ciate over short inter­vals”.  Jour­nal of Exper­i­men­tal Psy­chol­ogy, 66(2), 206-209\n Glen­berg, A. M. (1977).  “Influ­ences of retrieval processes on the spac­ing effect in free recall”.  Jour­nal of Exper­i­men­tal Psy­chol­o­gy: Human Learn­ing and Mem­ory, 3(3), 282-294\n Balota et al \n......", "posttime": "2020-10-22 22:07:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "间隔,spaced,测试", "title": "间隔重复", "title_en": "Spaced Repetition", "transed": 1, "url": "https://www.gwern.net/Spaced-repetition", "via": "", "real_tags": ["间隔", "spaced", "测试"]}, {"category": "", "categoryclass": "", "imagename": "1f9f2be92911cd9fe0d94baa8bf0ffba.jpg", "infoid": 1030544, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "推特账号@realDonaldTrump van de amerikaanse总统唐纳德·特朗普甚至是荷兰人。“让美国再次变得伟大”(Make America Again Great)--让美国再次变得伟大。(Make America At Great America)--让美国再次变得伟大！(Make America At Great America)--再一次让美国变得更伟大！(注：让美国再次变得伟大)，让美国再次伟大。\nDe Nederlander是黑客Victor Gevers的ethisch，die al Vele duizenden和datalekken en and ere kmitsbaarheden op het internet heeft geed。他在荷兰担任主席拉登、苏斯泰尔特和弗里杰·尼德兰的主席，他的名字叫ZESTTE HEM Zven pogingen om het wachtwoord van de amerikaanse总裁拉登(Zo Stelt Hij Tegen And Vrij Nederland)。\n哦，天哪，我的小游艇真是太棒了，维特尔特·吉弗斯和泰根·RTL Nieuws也是如此。(译者注：原文为“Tegen Rtl Nieuws”，“Tegen RTL Nieuws”，“Vertelt Gevers”我会把我的钱从你的账户里拿出来，我会把你的钱从你的账户里拿出来，然后我会把你的钱放在你的账户上，我会把你的钱从你的账户里拿出来，然后我就会把你的账户换成你想要的东西，我会把你的钱从你的账户里拿出来。\nGevers Toegang不得不使用推特账号van Trump in ezien Door RTL Nieuws en Vrij Nederland(荷兰的推特账号van Trump is inezien door rtl nieuws en Vrij Nederland)。特朗普有更多的机会获得额外的支持，他的代码很重要，但是他并没有参与到这项工作中来，他说：“这是一件非常重要的事情。”(译注：这句话的意思是：“我不知道你的名字是什么意思，我不知道你的名字是不是真的，但是我不会把它放在你的名字里。)”\nGevers heeft niet namens Trump get weet of zijn privéberichten ingezien，maar beed wel kunnen doen.。道德黑客warschuwt hij Personen of op kattsbaarheden in de hoop die te verhelp en.。格弗斯是尼德兰的黑客，他的名字是“吉利夫”和“民族”，他说：“这是一件很有意义的事。”(这句话的意思是：“我是尼德兰的黑客。)”\n通讯员Erik Mouthaan zegt dat Trumps推特账号zijn belangrijkste Communatiemiddel is。Het Witte Huis Heeft gezegd dat alle tweet Gelden ALS Offiële Verklaringen van de总裁。业务部门的话不能在加滕的地窖里做帐，要找的是业务基础和业务基础，而不是在业务基础上的业务基础上的业务，所以我们需要一个新的业务平台，以满足客户的需求和需求，并为您提供更好的服务和更好的服务。Zo kondigde hij通过推特甚至言语OP变性人在她的Leger aan，在Plats van en persbericht of Even weetsvoorstel。&#34；\n推特上的内容是“人民的呼喊”、“特朗普的声音”、“我爱你”、“我爱你”。他说：“我不会把所有的钱都给我，我会把你的钱花在巨大的钱上，然后把它整合到你的世界里去。”&#34；。\n莫格里克让特朗普在推特上建立了omdat zijn Campagneteam ook toegang Moet hebben to tot zijn推特账户。Zo&#n‘n额外的Beveiliging Met LasTiger Het Account de Delen遇见了Anderen。Gevers Heeft Via-Via联系人Gekregen会见了de Het Lek Gemeld的美国特勤局。\n这是他的推特账号范·特朗普的推特账号。2016年，Lukte het hm om Samen遇到了twee vrienden toegang te krijgen。你被炒了鱿鱼，盖弗斯·萨门遇到了zijn twee hackervrienden vond tussen de gelekte LinkedIn-wachtwoorden。\n特朗普的体重在两个月前就开始了，这是一种可信度很高的进攻性思维方式。(编者注：这句话的意思是：“我不知道怎么回事。)”(这句话的意思是)。您的位置：我也知道&gt;生活在#34；，谢克尔在#34；，Zegt hij的脚趾：&#34；Alsjeblieft mensen，Schakel tweestapsverificatie in&#34；，zegt hij.。Zelfs ALS je en slecht wachtwoord gebroikt，zoals&#39；，dan nog blijf je beschermd tegen dit soort simpele aanvallen.&#34；dan nog blijf je beschermd tegen dit soort simpele aanvallen；", "note_en": "Het Twitteraccount @realDonaldTrump van de Amerikaanse president Donald Trump is gehackt door een Nederlander. Trump gebruikte het wachtwoord &#39;maga2020!&#39; (make america great again) en zou geen extra beveiliging hebben ingesteld.\n  De Nederlander is ethisch hacker  Victor Gevers, die al vele duizenden datalekken en andere kwetsbaarheden op het internet heeft gemeld. Het kostte hem zeven pogingen om het wachtwoord van de Amerikaanse president te raden, zo stelt hij tegen  Vrij Nederland.\n &#34;Ik dacht &#39;oh god&#39; toen ik was ingelogd&#34;, vertelt Gevers tegen RTL Nieuws. &#34;Ik wil juist dat het me niet lukt om binnen te komen, en al helemaal niet bij zo&#39;n belangrijk account.&#34;\n    Het bewijs dat Gevers toegang had tot het Twitter-account van Trump is ingezien door RTL Nieuws en Vrij Nederland. Trump had volgens Gevers ook geen extra beveiliging ingesteld, zoals de code die je soms na het inloggen moet invoeren - ook wel  tweestapsverificatie genoemd.\n Gevers heeft niet namens Trump getweet of zijn privéberichten ingezien, maar had beide wel kunnen doen. Als ethisch hacker waarschuwt hij personen of organisaties op kwetsbaarheden in de hoop die te verhelpen. Gevers is binnen de Nederlandse hackerwereld bekend en geliefd om zijn ethische werkwijze.\n    Correspondent Erik Mouthaan zegt dat Trumps Twitteraccount zijn belangrijkste communicatiemiddel is. &#34;Het Witte Huis heeft gezegd dat alle tweets gelden als officiële verklaringen van de president. Op ministeries wordt het account scherp in de gaten gehouden, want vaak moet er beleid gemaakt worden op basis van Trumps gedachten. Zo kondigde hij via Twitter een verbod op transgenders in het leger aan, in plaats van een persbericht of een wetsvoorstel.&#34;\n &#34;Twitter is de plek waar Trump zijn woede en trots ventileert, je krijgt echt mee hoe hij zich van moment tot moment voelt. Als een kwaadwillende partij vlak voor de verkiezingen het account zou kapen, kan dat immense gevolgen hebben voor de integriteit van de verkiezingen en de veiligheid van het land.&#34;\n  Mogelijk had Trump geen tweestapsverificatie omdat zijn campagneteam ook toegang moet hebben tot zijn Twitteraccount. Zo&#39;n extra beveiliging maakt het lastiger om een account te delen met anderen. Gevers heeft via-via contact gekregen met de United States Secret Service en het lek gemeld.\n Het is niet de eerste keer dat Gevers toegang had tot het Twitteraccount van Trump. In 2016 lukte het hem om samen met twee vrienden toegang te krijgen. Toen was het wachtwoord &#39;yourefired&#39;, dat Gevers samen met zijn twee hackervrienden vond tussen de gelekte LinkedIn-wachtwoorden.\n      Trump heeft inmiddels zijn wachtwoord aangepast en tweestapsverificatie ingeschakeld. Dat juicht Gevers toe: &#34;Alsjeblieft mensen, schakel tweestapsverificatie in&#34;, zegt hij. &#34;Zelfs als je een slecht wachtwoord gebruikt, zoals &#39;maga2020!&#39;, dan nog blijf je beschermd tegen dit soort simpele aanvallen.&#34;", "posttime": "2020-10-22 22:07:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,2020,密码,人员,researcher", "title": "荷兰一名研究人员使用密码“maga2020”访问特朗普的推特账户", "title_en": "Dutch researcher accesses Trump's Twitter account using password “maga2020 ”", "transed": 1, "url": "https://www.rtlnieuws.nl/nieuws/buitenland/artikel/5191916/donald-trump-twitter-gehackt-nederlandse-hacker-victor-gevers", "via": "", "real_tags": ["推特", "2020", "密码", "人员"]}, {"category": "", "categoryclass": "", "imagename": "20e360775fea3646eb01a0d4118005ef.webp", "infoid": 1030543, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "10月13日，苹果发布了四款新iPhone，包括iPhone12 Mini，iPhone12，iPhone12 Pro和iPhone12Pro Max。\nIPhone12 Mini、iPhone12、iPhone12 Pro和iPhone12 Pro Max于10月13日发布。", "note_en": "Apple had launched four new iPhones including the iPhone 12 Mini, iPhone 12, iPhone 12 Pro, and iPhone 12 Pro Max on October 13.\n  iPhone 12 Mini, iPhone 12, iPhone 12 Pro, and iPhone 12 Pro Max were launched on October 13.", "posttime": "2020-10-22 22:06:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "iphone,pro,costly,iphone12", "title": "IPhone12 Pro在印度太贵了，你可以飞到迪拜去买，还能省钱", "title_en": "iPhone 12 Pro so costly in India, you can fly to Dubai to buy it and save money", "transed": 1, "url": "https://www.indiatoday.in/technology/features/story/iphone-12-pro-so-expensive-in-india-that-you-can-fly-to-dubai-to-buy-it-come-back-and-still-save-money-1733722-2020-10-21", "via": "", "real_tags": ["iphone", "pro", "costly", "iphone12"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1030542, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "除了我们每周的战术洞察力之外，我们还展示了令人惊叹的新工具、商业案例研究、心理模型和新闻，以帮助您的初创企业保持快速发展。", "note_en": "Along with our weekly tactical insights, we also show off awesome new tools, business case studies, mental models and news to help keep your startup chugging along.", "posttime": "2020-10-22 22:06:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "启动,startup,令人惊叹", "title": "无聊的启动内容", "title_en": "Boring Startup Stuff", "transed": 1, "url": "http://boringstartupstuff.com/", "via": "", "real_tags": ["启动", "startup", "令人惊叹"]}, {"category": "", "categoryclass": "", "imagename": "6bf9cebbc2021ad96a9fb3c404513efb.jpeg", "infoid": 1030540, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "知情的州和地方卫生官员说，数据挖掘公司Palantir Technologies正在帮助联邦政府建立一个系统，该系统将跟踪新冠肺炎疫苗的生产、分销和管理。\n根据卫生官员和《华尔街日报》(The Wall Street Journal)查阅的材料，Palantir一直在开发软件，联邦卫生官员将使用这些软件来管理各种疫苗数据，并找出任何可能阻止美国人接种疫苗的问题。\n这个名为提比略的系统标志着利用尖端数据科学来帮助联邦政府管理保护美国人免受新冠肺炎伤害的工作的一次尝试。\n它将在Palantir为追踪冠状病毒住院的联邦卫生官员所做的工作的基础上再接再厉。Palantir被认为帮助美军追捕奥萨马·本·拉登(Osama Bin Laden)，并开发了移民当局用来寻找非法移民的软件。\n正在为居民制定疫苗接种计划的州和地方卫生官员表示，泰比略系统可以进一步努力，例如，识别高优先级人群，然后为医护人员、老年人和其他感染风险最高的人分配疫苗。\n然而，Palantir的参与可能会招致一些民主党人和隐私倡导者的抨击，他们之前曾对该公司获得敏感的个人健康信息表示担忧。\n另一款名为HHS Protect的Palantir数据收集和分析工具，在范围上与泰比略相似，由美国卫生与公众服务部用来跟踪医院的新冠肺炎数据，因其复杂性而受到一些人的批评。\n州和地方卫生官员说，在最近的一次联邦同行的简报会上，他们被告知Palantir参与了这一努力。卫生与公众服务部的一位女发言人说，Tiberius使用Palantir技术，Palantir担任分包商。\n免疫管理者协会(Association Of Immunization Managers)的执行董事克莱尔·汉南(Claire Hannan)说，泰比略系统将无法获得个人健康信息，该协会的成员管理州和地方政府的疫苗接种计划。HHS的一位女发言人说，不会将个人身份信息带到提比略。\n疫苗数据系统的开发正值几个领先的候选疫苗进入最后测试阶段，并接近有效性和安全性的结果，这可能会促使美国食品和药物管理局(U.S.Food and Drug Administration)授权广泛使用。\n在准备过程中，联邦卫生官员已经要求州卫生官员最早在11月开始计划分发任何授权的疫苗剂量，这可能会成为美国几十年来规模最大的疫苗接种活动之一，也是允许学校、企业和其他机构全面重新开放的关键。\n州官员已经起草了计划，并定于10月16日之前提交给疾病控制和预防中心(Centers For Disease Control And Prevention)。\n根据HHS发言人的说法，Tiberius使用与HHS Protect相同的软件，这是Palantir的铸造工具。联合国世界粮食计划署(World Food Program)也使用Foundry收集和分析数据，将食物引导到需要的地方，类似于它将被用于引导泰比略的疫苗。\n根据Palantir准备的描述“华尔街日报”审查的系统的文件，泰比略平台将从联邦机构、州和地方政府，以及制药商、分销商和其他与新冠肺炎疫苗有关的人那里获取数据。\n文件称，该系统将允许卫生当局“整合广泛的人口、就业和公共卫生数据集，以确定优先人群的位置”，并“支持分配决策”。\n这些材料说，这些信息的目的是让联邦官员实时查看有关疫苗的数据，从疫苗的测试到库存水平，最后是对人的管理。\n文件显示，卫生官员可以使用数据系统创建的分析和地图来规划疫苗剂量的分发和分配决定，并跟踪向医院、诊所和其他注射地点交付疫苗的情况。\n这些材料包括阿拉巴马州按县显示新冠肺炎病例趋势的地图的示例。第二张地图覆盖了疫苗分配情景，看看它与该州的病例趋势如何比较。\n文件说，一旦疫苗剂量可用，泰比略系统就被设计成允许官员“主动识别关键人群中的分配瓶颈、库存限制和管理缺口”。\n费城卫生部发言人詹姆斯·加罗(James Garrow)说，Tiberius可能是一个有用的工具，可以用来确定有多少人在费城的医疗保健或疗养院工作，并为高优先级群体分配初始剂量。\n犹他州卫生部健康信息学经理乔恩·里德(Jon Reid)表示，犹他州卫生部的目标是帮助计划向医院、诊所和医生办公室发送多少疫苗，以针对特定的危急人群，并看看其疫苗接种活动与其他州的疫苗接种活动相比如何。\n北卡罗来纳州和怀俄明州的计划也要求使用提比略帮助分配剂量。\nHHS的一位女发言人说，“提比略”的名字取自虚构的“星际迷航”中角色詹姆斯·T·柯克(James T.Kirk)的中间名。寻找新冠肺炎疫苗的多机构倡议被称为“曲速行动”，也是对“星际迷航”的认可。\n总部位于丹佛的Palantir是由担任董事长的亿万富翁科技投资者彼得·蒂尔(Peter Thiel)联合创立的。该公司于9月份上市，上市首日估值净值210亿美元。\nPalantir通常向客户提供定制软件，以帮助他们管理自己的数据，而不是获得数据本身的所有权。\n该公司长期以来一直为国防部工作，并为美国卫生与公众服务部及其监督的机构工作，如疾病控制和预防中心(Centers For Disease Control And Prevention)和FDA。\nPalantir的首席执行官去年在接受采访时说，Palantir与移民和海关执法局签订了一份合同，后者使用Palantir软件在美国寻找非法移民。\n根据一个关于政府支出的在线联邦数据库，Palantir的联邦医疗相关工作包括两份合同，总价值近2,500万美元，以建立名为HHS Protect的系统，按年龄组跟踪新冠肺炎患者的医院数据，可用床位和手头的防护装备。根据文件，泰比略系统正在“利用与HHS保护相同的技术”。\n一些卫生当局和民主党人批评HHS Protect和一个相关的数据收集工具，因为它们取代了他们熟悉的长期使用的CDC工具，而且这些工具并不总是最新的，也不能提供有用的分析。批评人士表示，特朗普政府可能会利用对数据的控制来减少美国报告的新冠肺炎病例的范围。HHS Protection的支持者表示，与旧的疾控中心工具相比，它更现代，更容易更新，以处理新类型的数据。\n今年7月，参议员伊丽莎白·沃伦(Elizabeth Warren)和其他民主党议员致信卫生与公共服务部部长亚历克斯·阿扎尔(Alex Azar)，对Palantir没有披露计划如何处理通过HHS Protect收集的任何个人健康信息以及是否有任何隐私保护措施表示担忧。议员们还要求HHS提供与Palantir的所有现行合同的副本。", "note_en": "Data-mining company  Palantir Technologies    PLTR  2.12%  is helping the federal government set up a system that will track the manufacture, distribution and administration of  Covid-19 vaccines, state and local health officials briefed on the effort said.\n  Palantir has been developing software that federal health officials would use to manage the various vaccine data and identify any issues that could prevent Americans from getting the shots, according to the health officials and materials reviewed by The Wall Street Journal.\n  The system, Tiberius, marks an attempt to use cutting-edge data science to help the federal government manage the work of protecting Americans against  Covid-19.\n    It would build on work that Palantir, which was credited with helping the U.S. military track down Osama bin Laden and developed the software that immigration authorities have used to find illegal immigrants, has been doing for federal health officials  tracking coronavirus hospitalizations.\n    State and local health officials who are setting up programs for vaccinating residents said the Tiberius system could further their efforts by, for example, identifying high-priority populations and then allocating shots to health-care workers, the elderly and others at highest risk of infection.\n  Yet Palantir’s involvement could draw fire from some Democrats and privacy advocates who have previously expressed concerns about the company gaining access to sensitive personal health information.\n  Another Palantir data collection and analysis tool, called HHS Protect, which is similar in scope to Tiberius and used by the U.S. Health and Human Services Department to track hospitals’ Covid-19 data, has been criticized by some for its complexity.\n  The state and local health officials said they were told during a recent briefing by federal counterparts that Palantir was involved in the effort. A spokeswoman for the Department of Health and Human Services said Tiberius uses Palantir technology, with Palantir serving as a subcontractor.\n  The Tiberius system won’t have access to personal health information, said Claire Hannan, executive director of the Association of Immunization Managers, whose members manage state and local government vaccination programs. An HHS spokeswoman said no personally identifiable information will be brought into Tiberius.\n    Development of the vaccine data system comes as several leading candidates are in the final stage of testing and nearing results about effectiveness and safety that could prompt the U.S. Food and Drug Administration to authorize wide use.\n  In preparation, federal health officials have asked state counterparts to begin planning for the  distribution of any authorized vaccine doses as early as November, in what may become one of the biggest U.S. vaccination campaigns in decades and a key to allowing schools, businesses and other establishments to fully reopen.\n  State officials have drafted plans and were due to submit them to the Centers for Disease Control and Prevention by Oct. 16.\n  Tiberius uses the same software as HHS Protect, according to an HHS spokeswoman, which is Palantir’s Foundry tool. Foundry, which collects and analyzes data, is also used by the United Nations World Food Program to  direct food where it is needed, similar to how it will be used to direct vaccines for Tiberius.\n  The Tiberius platform would take data from federal agencies, state and local governments, and drugmakers, distributors and others involved with Covid-19 vaccines, according to documents prepared by Palantir describing the system that the Journal reviewed.\n  The system would allow health authorities “to integrate a wide range of demographic, employment and public health data sets to identify the location of priority populations” and to “support allocation decision making,” the documents said.\n  The information is aimed at giving federal officials a real-time view of data about vaccines, from their testing to inventory levels and finally administration to people, the materials said.\n  Health officials can use analyses and maps created by the data system to plan distribution and make allocation decisions about vaccine doses, and to track delivery of vaccines to hospitals, clinics and other places giving the shots, according to the documents.\n  The materials include an example of a map of Alabama showing Covid-19 case trends by county. A second map overlays a vaccine-allocation scenario to see how it compares with case trends in the state.\n  Once vaccine doses become available, the Tiberius system is designed to allow officials “to proactively identify distribution bottlenecks, inventory constraints, and gaps in administration across key populations,” the documents said.\n  Tiberius could be a helpful tool for determining how many people work in health-care or nursing homes in Philadelphia and allocating initial doses to the high-priority groups, said Philadelphia Department of Health spokesman James Garrow.\n  Utah’s health department aims to use Tiberius to help plan how much vaccine to send to hospitals, clinics and doctors’ offices to target specific critical populations, and see how its vaccination campaign compares with those in other states, said Jon Reid, health informatics manager with the department.\n  North Carolina’s and Wyoming’s plans also call for using Tiberius to help allocate doses.\n  Tiberius takes its name from the middle name of fictional “Star Trek” character James T. Kirk, an HHS spokeswoman said. The multiagency initiative to find a Covid-19 vaccine is dubbed “Operation Warp Speed,” also a nod to “Star Trek.”\n  Palantir, based in Denver, was co-founded by billionaire tech investor Peter Thiel, who serves as chairman. The company  went public in September and netted a $21 billion valuation on the first day of trading.\n  Palantir typically provides custom software to clients to help them manage their own data, rather than taking ownership of the data itself.\n  The firm has long done work for the Defense Department and has  worked for the U.S. Department of Health and Human Services and the agencies it oversees, such as the Centers for Disease Control and Prevention and the FDA.\n  Palantir has a contract with the Immigration and Customs Enforcement agency, which has used Palantir software to find undocumented immigrants in the U.S., its chief executive said in an interview last year.\n  Palantir’s federal health-related work includes two contracts worth a total of nearly $25 million to set up the system known as HHS Protect to track hospital data such as Covid-19 patients by age group, available beds, and protective gear on hand, according to an online federal database of government spending. The Tiberius system is “leveraging the same technologies” as HHS Protect, according to the documents.\n  Some health authorities and Democrats have  criticized HHS Protect and a related data-collection tool, because they replaced a long-used CDC tool they knew well and because the tools haven’t always been up-to-date or provided useful analysis. The critics said the Trump administration could use control of the data to diminish the extent of reported Covid-19 cases in the U.S.  Supporters of HHS Protect say it is more modern and easier to update to handle new types of data compared with the old CDC tool.\n  In July, Sen. Elizabeth Warren and other Democratic lawmakers sent a letter to Secretary of Health and Human Services Alex Azar raising concerns that Palantir hadn’t disclosed what it planned to do with any personal health information collected through HHS Protect and whether any privacy safeguards were in place. The lawmakers also asked HHS for copies of all active contracts with Palantir.", "posttime": "2020-10-22 21:46:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,palantir,疫苗", "title": "消息来源：Palantir正在帮助美国政府追踪新冠肺炎疫苗的生产、分销和管理", "title_en": "Sources: Palantir is helping the US government track the manufacture, distribution, and administration of COVID-19 vaccines", "transed": 1, "url": "https://www.wsj.com/articles/palantir-to-help-u-s-track-covid-19-vaccines-11603367276?mod=djemalertNEWS", "via": "", "real_tags": ["美国", "palantir", "疫苗"]}]