[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1012829, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Redo是长寿的Make程序的竞争对手，但遗憾的是，Make程序并不完美。与其他同类竞争对手不同，Redo抓住了make的简单性和灵活性，同时避免了它的缺陷。它设法做到了这一点，同时比make更简单，比make更灵活，比make更强大，并且不会牺牲性能-ARARE特性的组合。\nRedo的原始设计来自Daniel J.Bernstein(qmail和djbdns等许多有用功能的创建者)。他一度(没有日期)在他的网站上发布了一些简短的笔记，标题并不张扬：当源文件发生变化时重建目标文件。这些笔记足以理解系统应该如何工作；不幸的是，没有与之配套的代码。基于这个设计，我从头开始编写了这个重做实现。\n在我发现djb redo之后，我在互联网上搜索其他人已经发现我所拥有的东西的任何迹象：一个隐藏的、未实现的、出色代码设计的宝石。我当时只发现了一个有趣的链接：AlanGrosskurth，他在滑铁卢大学的硕士论文是关于自上而下的软件重建，即DJB重做。他用大约250行shell脚本编写了自己的实现(诚然很慢)，这让人对这个系统有多简单有个概念。从那时起，出现了几个其他实现(参见下面的列表)。\n我的重做实现称为重做，原因与有75个不同版本的make都称为make的原因相同。那样的话就容易多了。\n我还在该存储库的minimum/目录中提供了一个非常小的纯POSIX-sh实现，称为do。\n重做背后的理论听起来好得令人难以置信：它可以做任何Make能做的事情，但实现要简单得多，语法更清晰，而且您无需求助于丑陋的黑客就可以获得更大的灵活性。此外，您可以获得非递归make的所有速度(每次运行只检查依赖项一次)和递归make的所有清晰度(您不会让一个模块的代码践踏另一个模块的代码)。\n(免责声明：我目前的实现没有Make的速度快，因为它是用python编写的。最终，我会用C语言重写它，而且速度会非常非常快。)。\n展示它的最简单的方法是跳到一个例子中。下面是编译C++程序的方法。\n当然，您还必须创建A.c和B.c，这是您想要构建以创建应用程序的C语言资源文件。\n您在default.o.do中捕捉到生成自依赖项的shell咒语了吗？文件名default.o.do表示运行此脚本以生成.o文件，除非有适用的更具体的.o.do脚本。&#34；\n关于重做，要理解的关键是声明依赖项是直接的其他shell命令。Redo-ifchange命令意味着构建每个my参数。如果它们中的任何一个或它们的依赖关系发生变化，那么我需要重新运行当前脚本。&#34；\n在持久的.redo数据库中跟踪依赖项，以便重做以后可以检查它们。如果需要重新构建文件，它将重新执行Whatever.do脚本并重新生成依赖项。如果文件不需要重新构建，只需使用其持久的.redo数据库，而无需重新运行脚本，redo就可以解决这一问题。而且它可以在项目构建开始时只做一次检查，这真的很快。\n最棒的是，正如您在default.o.do中看到的那样，您可以在构建程序之后声明依赖项。在C语言中，您可以通过尝试实际构建来获得最好的依赖信息，因为这是找出您需要的头文件的方法。重做基于这样一个简单的见解：在构建目标之前，您实际上并不关心依赖项是什么。如果目标不存在，您显然需要构建它。\n一旦您无论如何都要构建它，构建脚本本身就可以随心所欲地计算依赖关系信息；与make不同，您根本不需要特殊的依赖关系语法。您甚至可以在构建之后声明一些依赖项，这使得C风格的自依赖项变得简单得多。\n因此，重做是命令性编程和声明性编程的独特组合。初始构建几乎完全是必需的(运行一系列脚本)。作为其中的一部分，脚本一次声明几个依赖项，然后重做将它们组装到一个更大的数据结构中。然后，在将来，它使用预先声明的数据结构来决定需要重做哪些工作。\n(GNU make支持将您的一些依赖项放入包含文件中，并在这些包含文件发生更改时自动重新加载它们。但这非常令人困惑-通过Makefile的程序流已经很难跟踪了，当它从头重新启动时就更难了，因为包含文件在运行时会发生变化。使用重做，您可以从上到下读取每个构建脚本。Redo-ifchange调用类似于调用函数，您也可以从上到下读取该函数。)\n一些较大的专有项目正在使用它，但不幸的是，它们可以很容易地从本文档中链接起来。以下是几个开放源码示例：\n解放赛道是一个用重做编译的C++二进制(游戏)的简单示例。\nWvStreams使用更复杂的设置，生成几个二进制文件、库和脚本。它显示了如何在与源文件不同的目录中生成输出文件。\nWvBuild可以交叉编译几个依赖项，如OpenSSL和zlib，然后使用这些相同的库构建WvStream。它是重做/建立互操作和复杂依赖关系的一个很好的例子。\nBuildroot有一个实验性的变体，它使用重做来清理其依赖逻辑。\n您可以在食谱中找到一些精选的教程示例，例如使用LaTeX进行git变量替换和文本处理(包括使用R和ggplot2生成绘图)。\n如果您将您的程序的构建过程切换为使用重做，请让我们知道，我们可以在这里链接到它，以获得一些免费的宣传。\n(请不要使用重做项目t/目录中的集成测试代码作为如何使用重做的严肃示例。许多测试都是故意用精神错乱的方式来做事情，以强调重做代码并找出错误。另一方面，如果您正在构建自己的重做实现，使用我们的测试套件是个不错的主意。)\nDJB从未发布过他的版本，所以其他人已经基于他发布的规范实现了他们自己的变体。\n这个版本，有时称为Apenwarr/Redo，可能是最先进的版本，包括对并行构建的支持、弹性时间戳和校验和、构建日志线性化以及有用的调试特性。它目前是用python编写的，以便于实验，但计划最终将其移植到纯C语言。(有些人喜欢把这个版本叫做python-redo；，但我不喜欢这个名字。当我们稍后将代码音译为C时，我们不应该将其重命名。)。\n以下是其他一些重做变体(感谢Nils Dagsson Moskopp收集了许多这样的链接)：\nAlan Grosskurth的重做论文和相关的sh实现。(可以说，这篇论文让我们所有人都开始了。)。\nApenwarr&#39；的最小/DO包含在此重做副本中。它也是基于sh的，但它的目的是简单和故障保护，所以它不知道如何多次重做目标。\n最初的重做设计是如此简单和优雅，以至于许多人都受到了启发，想(并且能够)写出他们自己的版本。按照Unix制造的光荣传统，它们(几乎)都使用相同的名称，重做。不幸的是，这些实现中的许多都没有得到维护，与重做语义标准稍有不兼容，和/或很少或没有自动化测试。\n在撰写本文时，除了Apenwarr/Redo(即。此项目)正确支持并行构建(redo-j)或日志线性化(redo-log)。对于大型项目，并行构建通常被认为是必不可少的。\n此版本的Redo中的自动化测试几乎(但不完全)适用于测试任何Redo实现。如果您确实必须编写新版本的重做，我们邀请您针对现有的测试套件对其进行彻底测试，以确保兼容性。您还可以窃取我们的测试(当然，带有属性)，并将它们包含在您自己的源包中。我们也希望您在发现错误时提供更多的自动化测试，或者如果您发现测试意外地与其他重做实现不兼容(而不是发现真正的错误)，请将补丁发送给我们。", "note_en": "redo is a competitor to the long-lived, but sadly imperfect,  makeprogram. Unlike other such competitors, redo captures the essentialsimplicity and flexibility of make, while avoiding its flaws. It manages todo this while being simultaneously simpler than make, more flexible thanmake, and more powerful than make, and without sacrificing performance - arare combination of features.\n The original design for redo comes from Daniel J. Bernstein (creator ofqmail and djbdns, among many other useful things). He posted someterse notes on his web site at one point (there is no date) with theunassuming title, &#34; Rebuilding target files when source files havechanged.&#34; Those notes are enough information tounderstand how the system is supposed to work; unfortunately there&#39;s no codeto go with it. I wrote this implementation of redo from scratch, based onthat design.\n After I found out about djb redo, I searched the Internet for any sign thatother people had discovered what I had: a hidden, unimplemented gem ofbrilliant code design. I found only one interesting link at the time: AlanGrosskurth, whose  Master&#39;s thesis at the University ofWaterloo was about top-downsoftware rebuilding, that is, djb redo. He wrote his own (admittedly slow)implementation in about 250 lines of shell script, which gives an idea forhow straightforward the system is. Since then, several otherimplementations have appeared (see list below).\n My implementation of redo is called  redo for the same reason that thereare 75 different versions of  make that are all called  make. It&#39;s somehoweasier that way.\n I also provide an extremely minimal pure-POSIX-sh implementation, called do, in the  minimal/ directory of this repository.\n   The theory behind redo sounds too good to be true: it can do everything make can do, but the implementation is vastly simpler, the syntax iscleaner, and you have even more flexibility without resorting to ugly hacks. Also, you get all the speed of non-recursive  make (only check dependenciesonce per run) combined with all the cleanliness of recursive  make (youdon&#39;t have code from one module stomping on code from another module).\n (Disclaimer: my current implementation is not as fast as  make for somethings, because it&#39;s written in python. Eventually I&#39;ll rewrite it an C andit&#39;ll be very, very fast.)\n The easiest way to show it is to jump into an example. Here&#39;s one forcompiling a C++ program.\n     Of course, you&#39;ll also have to create  a.c and  b.c, the C languagesource files that you want to build to create your application.\n               Did you catch the shell incantation in  default.o.do where it generatesthe autodependencies? The filename  default.o.do means &#34;run this script togenerate a .o file unless there&#39;s a more specific whatever.o.do script thatapplies.&#34;\n The key thing to understand about redo is that declaring a dependency is justanother shell command. The  redo-ifchange command means, &#34;build each of myarguments. If any of them or their dependencies ever change, then I need torun the  current script over again.&#34;\n Dependencies are tracked in a persistent  .redo database so that redo cancheck them later. If a file needs to be rebuilt, it re-executes the whatever.do script and regenerates the dependencies. If a file doesn&#39;tneed to be rebuilt, redo figures that out just using its persistent .redo database, without re-running the script. And it can do that checkjust once right at the start of your project build, which is really fast.\n Best of all, as you can see in  default.o.do, you can declare a dependency after building the program. In C, you get your best dependencyinformation by trying to actually build, since that&#39;s how you find out whichheaders you need. redo is based on this simple insight: you don&#39;tactually care what the dependencies are  before you build the target. Ifthe target doesn&#39;t exist, you obviously need to build it.\n Once you&#39;re building it anyway, the build script itself can calculate thedependency information however it wants; unlike in  make, you don&#39;t need aspecial dependency syntax at all. You can even declare some of yourdependencies after building, which makes C-style autodependencies muchsimpler.\n redo therefore is a unique combination of imperative and declarativeprogramming. The initial build is almost entirely imperative (running aseries of scripts). As part of that, the scripts declare dependencies a fewat a time, and redo assembles those into a larger data structure. Then, inthe future, it uses that pre-declared data structure to decide what workneeds to be redone.\n (GNU make supports putting some of your dependencies in include files, andauto-reloading those include files if they change. But this is veryconfusing - the program flow through a Makefile is hard to trace already,and even harder when it restarts from the beginning because an include filechanges at runtime. With redo, you can just read each build script from topto bottom. A  redo-ifchange call is like calling a function, which you canalso read from top to bottom.)\n  Some larger proprietary projects are using it, but unfortunately they can&#39;teasily be linked from this document. Here are a few open source examples:\n Liberation Circuit is a straightforward example of a C++ binary (a game) compiled with redo.\n WvStreams uses a more complex setup producing several binaries, libraries, and scripts. It shows how to produce output files in a different directory than the source files.\n WvBuild can cross-compile several dependencies, like openssl and zlib, and then builds WvStreams using those same libraries. It&#39;s a good example of redo/make interop and complex dependencies.\n There&#39;s an experimental  variant of Buildroot that uses redo in order to clean up its dependency logic.\n You can find some curated tutorial examples in the  cookbook, such as  git variable substitution and  text processing with LaTeX (including plot generation with R and ggplot2).\n If you switch your program&#39;s build process to use redo, please let us know andwe can link to it here for some free publicity.\n (Please don&#39;t use the integration testing code in the redo project&#39;s  t/directory as serious examples of how to use redo. Many of the tests aredoing things in intentionally psychotic ways in order to stress redo&#39;s codeand find bugs. On the other hand, if you&#39;re building your ownreimplementation of redo, using our test suite is a great idea.)\n  djb never released his version, so other people have implemented their ownvariants based on his  published specification.\n This version, sometimes called apenwarr/redo, is probably the most advancedone, including support for parallel builds, resilient timestamps and checksums, build log linearization, andhelpful debugging features. It&#39;s currently written in python for easierexperimentation, but the plan is to eventually migrate it to plain C. (Somepeople like to call this version &#34;python-redo&#34;, but I don&#39;t like that name. We shouldn&#39;t have to rename it when we later transliterate the code to C.)\n Here are some other redo variants (thanks to Nils Dagsson Moskopp forcollecting many of these links):\n Alan Grosskurth&#39;s  redo thesis and related sh implementation. (Arguably, this paper is the one that got all the rest of us started.)\n  apenwarr&#39;s  minimal/do is included with this copy of redo. It&#39;s also sh-based, but intended to be simple and failsafe, so it doesn&#39;t understand how to &#34;redo&#34; targets more than once.\n The original redo design is so simple and elegant that many individualshave beeninspired to (and able to) write their own version of it. In the honouredtradition of Unix&#39;s  make, they (almost) all just use the same name, redo. Unfortunately, many of theseimplementations are unmaintained, slightly incompatible with the &#34;standard&#34;redo semantics, and/or have few or no automated tests.\n At the time of this writing, none of them except apenwarr/redo (ie. thisproject) correctly support parallel builds ( redo -j) or log linearization( redo-log). For large projects, parallel builds are usually consideredessential.\n The  automated tests inthis version of redo are almost, but not quite, appropriate for testing anyredo implementation. If you really must write a new version of redo, weinvite you to thoroughly test it against the existing test suite to ensurecompatibility. You can also steal our tests (with attribution, of course)and include them in your own source package. We&#39;d also love it it youcontribute more automated tests when you find a bug, or send us patches ifyou find a test which is accidentally incompatible (as opposed to finding areal bug) with other redo implementations.", "posttime": "2020-07-19 11:17:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "递归,recursive,构建", "title": "重做：递归的通用构建系统", "title_en": "Redo: A recursive, general-purpose build system", "transed": 1, "url": "https://redo.readthedocs.io/en/latest/", "via": "", "real_tags": ["递归", "recursive", "构建"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012828, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "前几天，在建立一个我是贡献者的科学项目时，伊朗陷入了两个系统库之间令人讨厌的版本冲突。一怒之下，我决定充分了解NIX，以便能够建立一个可重现的、严格控制的本地构建。现在已经完成了，总的来说，我对工具和设置非常满意。我正在使用direnv将我的普通shell与Nix的nix-shell特性紧密集成在一起，在很大程度上感觉一切都是无缝的。看到cmake报告说它发现了过多的二进制文件和库，内容经过散列并整齐地安装在/nix/store下的小行中，这让人非常耳目一新。\n我使用NIX来管理我的开发环境，但不是用来构建项目本身。NIX确保项目依赖项已安装并且可由编译器和链接器发现。构建项目是使用CMake完成的，CMake是为cmake设置的，用于查找nix安装的库。NIX通过用自己的shell脚本包装C编译器并通过环境变量注入库和二进制文件的路径来实现这一点。除了声明您想要的包是buildInput之外，要使cmake正常工作几乎没有什么可做的。我的shell.nix文件的第一个版本如下所示：\n#file shell.nix{pkgs？导入&lt；nixpkgs&gt；{}}：包。MkShell{buildInput=with pkgs；[cmake(callPackage nix/petsc.nix{})Metis hdf5 openmpi(python38.。With Packages(Packages：[Packages.。Numpy]))]]；}。\n使用此设置，我在构建项目时几乎没有遇到什么问题。我必须覆盖默认的PETSc派生，才能使用METIS和OpenMPIsupport进行编译，这并不太难：\n#file nix/petsc.nix{petsc，blas，gfortran，lapack，python，metis，openmpi}：petsc。OverrideAttrs(oldAttrs：rec{nativeBuildInput=[blas gfortran gfortran.。CC.。Lib lapack python openmpi Metis]；preconfigure=&#39；&#39；export fc=&#34；${gfortran}/bin/gfortran&#34；f77=&#34；${gfortran}/bin/gfortran&#34；patchShebangs。ConfigureFlagsArray=($configureFlagsArray&#34；--with-mpi-dir=${openmpi}&#34；&#34；--with-metis=${metis}&#34；&#34；--with-blas-lib=[${blas}/lib/libblas.so，${gfortran。CC.。Lib}/lib/libgfortran.a]&#34；&#34；--with-lapack-lib=[${lapack}/lib/liblapack.so，${gfortran。CC.。Lib}/lib/libgfortran.a]&#34；)&#39；&#39；})。\n此Nix文件返回一个函数，该函数在shell.nix中使用callPackage函数调用。Petsc.overrideAttrs是覆盖使用stdenv.mkDerivation创建的派生属性的一种巧妙方式。构建具有MPI和METIS支持的PETSc太简单了，只需将一组不同的参数传递给配置脚本即可。\n弄清楚怎么做这一切是很有趣的。我主要指的是NIX“药丸”，这是通过NIX工具和语言取得的巨大进步。\n使用这些Nix文件，我可以执行cmake..。&amp；&amp；制作成功。让项目开始运行则是另一回事。最终的二进制文件立即失败，并出现动态加载错误：\n该二进制文件试图从Nix在构建PETSC过程中创建的一个临时目录加载动态库。当然这失败了：当我调用bin/warpxm时，该目录已经被清理干净了。二进制文件应该链接到nix存储中/nix/store下的petsc派生结果，而不是/private/tmp下的文件。在某种程度上，似乎有一个环境变量被错误地设置到了这个intermediatedirectory中。要想弄清楚在哪里，我必须学习更多关于在OSX上链接的知识，这比我预期的要多得多。\n首先，我检查了Nix的编译器包装器插入的编译器和链接器标志。它们通过NIX_CFLAGS_COMPILE和NIX_LDFLAGS传入。当您使用nix-shell和direnv时，派生的所有环境变量都会注入到shell中。这只是一个简单的问题，就是把它们呼应出来：\n这些看起来不错！在这个shell中调用cmake和make应该会拉入正确的库。\n然后我记起这个项目使用pkg-config来查找并将链接库放在一起。坦率地说，我不太理解pkg-config，但我知道在这个项目中，它是从cmake内部调用的。它根据自己的规则搜索库，并在Nix完成设置所有内容的工作后运行。因此，它绕过了我们刚才检查的编译器和linkerflag。\n在设置这个Nix环境之前，我碰巧安装了pkg-config。因此，cmake能够从我的用户路径调用系统pkg-config。也许系统版本的pkg-config不知何故找到了错误的库？实际上，echo$PKG_CONFIG_PATH确认它正在搜索我的$HOME下的一个目录。我认为当我向Nix派生添加依赖项时，可能有一些问题交叉了，一次一个：适当配置pkg-config可能会有所帮助。\n一种普遍的看法是，通过传递--pury标志，可以将nix-shell与用户安装的内容隔离开来。这是不对的。事实上，它保持了用户的整个路径。我已经提交了一张罚单来解决这个问题。然而，在更多地使用nix-shell之后，我相信即使没有对开发环境进行热隔离，它也是一个超级有用的工具。\n我再次参考了关于C项目的Nix wiki页面，其中也有关于使用pkg-config的内容。将pkg-config派生作为nativeBuildInput包含似乎会让petsc这样的包将它们的iroutput路径附加到PKG_CONFIG_PATH环境变量。我这样做了：\n一包。MkShell{buildInput=with pkgs；[...]；nativeBuildInput=with pkgs；[pkg-config]；}\n但这并没有解决问题。我将不得不更深入地追查坏库是在哪里被拉进来的。\n深入研究cmake文档和项目的.cmake文件后，我插入了三条打印语句：\nFIND_PACKAGE(需要PkgConfig)pkg_CHECK_MODULES(PETSC PETSC REQUIRED)link_directories(${PETSC_LIBRARY_DIRS})+MESSAGE(&#34；PETSC库：${PETSC_LIBRARY}&#34；)+MESSAGE(&#34；PETS库目录：${PETSC_LIBRARY_DIRS}&#34；)+MESSAGE(&#34；PETSC链接库：${PETSC_LINK_LIBRARS}&#34；)列表(追加WARPXM_LINK。\n第二个看起来不错。但是第一个，仅仅是库的名字petsc，为了舒适，有点太含蓄了。正是这个变量被附加到链接目标列表中。在编译时，将由链接器来查找库petsc，而我不确定它会显示在哪里。使用.dylib的绝对路径更安全，如下所示：\n我在这里的想法是错误的。我们可以确定链接器将在编译时查看的位置：在NIX_LDFLAGS中列出的路径中！我没有清楚地考虑到编译过程中的数据流。\n将链接目标更改为绝对路径仅在下一次cmake期间缓解了我的疑虑。&amp；&amp；生成循环。当然，链接器现在不可能搞砸了。不涉及神秘的图书馆搜索，只有一条绝对路径，这不可能被误解…。\n在这一点上，我完全被搞糊涂了。每次尝试修复时，igrep都会徒劳地在build目录中查找有问题的/private/tmp路径，然后空手而归。我跟踪了传递给编译器的最终的、不可撤销的链接选项，这些选项隐藏在构建树中的link.txt文件中。它们无可争议地表明我的二进制文件链接到了正确的库：\n我几乎令我满意地证明，CMake用这个库做了正确的事情，我完全失去了想法。最后，一个非常幸运的谷歌搜索将我带到了NIX手册中描述达尔文(MacOS)平台特定问题的部分。它声明：\n在Darwin上，库使用绝对路径进行链接，库在链接时通过其安装名称进行解析。有时，包不能正确设置这一点，导致库查找在运行时失败。这可以通过添加额外的链接器标志或在修复阶段运行install_name_tool-id来修复。\n这是一种非常实事求是的表达方式，当我理解它时，它让我大吃一惊。据我所知，以下是MacOS上发生的事情：\n我的源代码有一个include指令，include&lt；petsc.h&gt；或类似的指令，它创建一个由链接器满足的二进制接口。\n在链接时，我们将绝对路径列表传递给库，链接器查找与接口匹配的路径。\n然后，链接器保存它在二进制文件的加载部分中找到的库的install_name。\n在运行时，二进制文件(实际上是MacOS DYLD系统)加载库。\n我肯定在这件事上有些地方弄错了，所以如果能听到比我更了解这件事的人的意见，我会非常感激的！\n无论如何，这个发现让我想到了install_name的概念，所以我有了一些东西可以继续。更多的搜索导致了一篇有用的博客文章，准确地描述了我面临的问题。还介绍了如何检查库的INSTALL_NAME：\nNIX手册指出“有些软件包无法正确设置”，并指向修复程序，即使用install_name_tool更改已构建库的install_name。Nixpkgs上的PETSC派生是否正确执行此操作？我看到它正在使用install_name_tool执行某些操作：\nPrePatch=&#39；&#39；substituteInPlace配置\\--替换/bin/sh/usr/bin/python&#39；&#39；+stdenv。利布。OptionalString stdenv.。IsDarwin；替换InPlace配置/install.py\\--替换/usr/bin/install_name_tool install_name_tool&#39；&#39；；\n此指令仅用install_name_tool替换字符串/usr/bin/install_name_tool的外观。Nix包这样做的原因是为了确保构建依赖于Nix构建的工具，这些工具在构建shell的路径中提供，而不是依赖于系统目录(如/usr/bin)中的二进制文件。\n引入此替换的PR表明它修复了Darwin上的构建，因此在PETSc中必须调用/usr/bin/install_name_tool。在PETSCrepo中搜索它会导致下面这一行，该行执行的正是Mark日志在install_name上发布的指令：它使用install_name_tool-id将install_name更改为库在其安装目录中的绝对路径。\n如果是os的话。小径。Splitext(Dst)[1]=.dylib；和os。小径。Isfile(&#39；/usr/bin/install_name_tool&#39；)：[output，err，flg]=self。EcuteShellCommand(&#34；otool-D&#34；+src)oldname=output[Output.。查找(&#34；\\n&#34；)+1：]installName=oldname。替换(操作系统。小径。Realpath(自我。ArchDir)，赛尔夫。InstallDir)Self。EcuteShellCommand(&#39；/usr/bin/install_name_tool-id&#39；+installName+&#39；&#39；&#39；+dst)。\n根据这一点，在构建库时，库的install_name应该已经由PETSc修复了！除…外。注意到什么了吗？IF语句中的第二个条件。在PETSc派生运行其prePatchstep之后，该条件将变为和os.path.isfile(&#39；install_name_tool&#39；)。这肯定会失败：install_name_tool不会是运行configure的目录中的一个文件！打补丁的配置脚本将静默跳过此步骤，将库的INSTALL_NAME保留为构建它的TEMPORARY目录！\n幸运的是，这个问题的解决方案并不太难。我们应该将绝对路径传递给我们想要运行的程序，而不是路径上的程序名。这可以通过覆盖PrePatch步骤来完成，如下所示：\nPrePatch=&#39；&#39；substituteInPlace配置\\--替换/bin/sh/usr/bin/python&#39；&#39；+stdenv。利布。OptionalString stdenv.。IsDarwin&#39；&#39；substituteInPlace config/install.py\\--替换/usr/bin/install_name_tool${Darwin。Cctools}/bin/install_name_tool&#39；&#39；；\nNIX变量${darwin.cctools}将展开到构建的darwin.cctools派生的完整路径，即/nix/store下的目录。因此，PETSc的configure.py内的打补丁的if语句变为。\n并且结果库的INSTALL_NAME将是正确的。我们可以使用otool-D再次检查：\n看起来好多了！由于错误位于动态加载的库中，我们甚至不需要重新编译就可以检查它是否正常工作：\n主构建GIT：(➜)Build dyld_✗_library=1 bin/warpxmdyld：已加载：/Users/jack/src/warpxm/build/bin/warpxmdyld：已加载：/nix/store/z4f1bq363m0ydmbyncfi2srij8vlsx32-Libsystem-osx-10.12.6/lib/libSystem.B.dylibdyld：已加载：/。Nix/store/w23r8kplmfx2xc111cpvmdjwmkwy6ip3-petsc-3.13.2/lib/libpetsc.3.13.dylib...。\n我花了大部分时间调试这个问题，而没有对不同的构建阶段有所了解。我应该很清楚，cmake和pkg-config设置都不可能是原因，因为在我调用cmake时，有问题的/private/tmp目录早就消失了。如果我只关注NIX提供的PETScDeriation，我可能会更早地关注install_name_toolpatch。在这过程中，我很幸运地在Nix手册中找到了关于达尔文特有的链接器问题的注释。\n至于Nix，我绝对会更多地使用它。值得注意的是，它能产生的影响是如此之小。我可以使用它来管理这个项目的环境，而不会影响其他开发人员管理他们环境的方式。当然，如果他们问起，我会建议他们试试Nix，但每个人都能在自己的时间做这件事是很好的。", "note_en": "The other day, while building a  scientific project to which I’m a contributor, Iran into a nasty version conflict between two system libraries. In a fit ofpique, I decided to learn enough about  Nix to be able to set up a reproducible,tightly controlled local build. It’s done now, and overall I’m very happy withthe tooling and setup. I’m using  direnv to tightly integrate my normal shellwith Nix’s  nix-shell feature, and for the most part everything feels seamless.It is extremely refreshing to see  cmake report that it has found a plethora ofbinaries and libraries, content-hashed and installed in neat little rows under /nix/store.\n I’m using Nix to manage my development environment, but  not to build theproject itself. Nix ensures that the project dependencies are installed anddiscoverable by the compiler and linker. Building the project is done withCMake, set up for  cmake to find the nix-installed libraries. Nix achieves thisby  wrapping the C compiler with its own shell script and injecting the paths tolibraries and binaries via environment variables. There’s very little to do tomake  cmake just work, beyond declaring that the packages you want are buildInputs. The first version of my  shell.nix file looked like this:\n # file shell.nix{  pkgs ?  import  &lt;nixpkgs&gt; {} }: pkgs. mkShell {  buildInputs =  with  pkgs; [  cmake ( callPackage  nix/petsc.nix {})  metis  hdf5  openmpi ( python38. withPackages ( packages: [  packages. numpy ])) ];}\n Using this setup, I had very little trouble getting the project to build. I hadto  override the  default PETSc derivation to compile with METIS and OpenMPIsupport, which was not too hard:\n # file nix/petsc.nix{  petsc ,  blas ,  gfortran ,  lapack ,  python ,  metis ,  openmpi }: petsc. overrideAttrs ( oldAttrs:  rec {  nativeBuildInputs = [  blas  gfortran  gfortran. cc. lib  lapack  python  openmpi  metis ];  preConfigure =  &#39;&#39;  export FC=&#34; ${ gfortran } /bin/gfortran&#34; F77=&#34; ${ gfortran } /bin/gfortran&#34;  patchShebangs .  configureFlagsArray=(  $configureFlagsArray  &#34;--with-mpi-dir= ${ openmpi } &#34;  &#34;--with-metis= ${ metis } &#34;  &#34;--with-blas-lib=[ ${ blas } /lib/libblas.so, ${ gfortran. cc. lib } /lib/libgfortran.a]&#34;  &#34;--with-lapack-lib=[ ${ lapack } /lib/liblapack.so, ${ gfortran. cc. lib } /lib/libgfortran.a]&#34;  )  &#39;&#39;;})\n This Nix file returns a function which is invoked in  shell.nix using callPackage function.  petsc.overrideAttrs is a neat way to override theattributes of a derivation created with  stdenv.mkDerivation. Building PETScwith MPI and METIS support is as simple as passing in a different set ofarguments to the  configure script.\n Figuring out how to do all of this was fun. I mostly referred to the  Nix“Pills”, which are a great progression through the Nix tool and language.\n With these Nix files, I was able to execute  cmake .. &amp;&amp; make successfully.Getting the project to  run was another story. The final binary failedimmediately with a dynamic loading error:\n  The binary was trying to load a dynamic lib from one of the temporary directoriesthat Nix created in the process of building PETSc. Of course this failed: by thetime I invoked  bin/warpxm, that directory had been cleaned up. Instead of afile under  /private/tmp, the binary should have linked to the result of the petsc derivation in the Nix store, under  /nix/store. At some point, itseemed, an environment variable was incorrectly set to this intermediatedirectory. To figure out where, I would have to learn a lot more about linkingon OS X than I ever expected.\n  First I checked the compiler and linker flags that are inserted by Nix’scompiler wrapper. These come in via  NIX_CFLAGS_COMPILE and  NIX_LDFLAGS. Whenyou’re working with  nix-shell and  direnv, all of the environment variablesfrom your derivations are injected into your shell. It’s a simple matter of echoingthem out:\n  These look fine! Invoking  cmake and  make in this shell ought to pull in thecorrect library.\n Then I remembered that this project uses  pkg-config to find and pull togetherthe linked libraries. Frankly, I don’t understand  pkg-config very well, but Ido know that in this project it is invoked from inside of  cmake. It searches forlibraries according to its own rules, and it runs  after Nix has done itsjob setting everything up. Therefore, it circumvents the compiler and linkerflags that we just checked.\n I happened to have  pkg-config installed from before setting up this Nixenvironment. Therefore,  cmake was able to invoke the system  pkg-config frommy user  PATH. Perhaps the system version of  pkg-config was somehow findingthe wrong library? Indeed,  echo $PKG_CONFIG_PATH confirmed that it wassearching a directory under my  $HOME. I thought it possible that some wiresgot crossed while I was adding dependencies to my Nix derivation one at a time:configuring  pkg-config appropriately might help.\n A common belief is that  nix-shell can be isolated from what the user hasinstalled by passing the  --pure flag. This is wrong. In fact, it  keeps theuser’s whole  PATH around. I’ve  filed a ticket to address this. However, afterusing  nix-shell some more, I believe it’s a super useful tool even withouthermetically isolating your development environment.\n I referred once again to the Nix wiki page on C projects, which also has  asection on using  pkg-config. It seems that including the  pkg-configderivation as a  nativeBuildInput will let packages like  petsc append theiroutput paths to the  PKG_CONFIG_PATH environment variable. I did so:\n pkgs. mkShell {  buildInputs =  with  pkgs; [ ... ];  nativeBuildInputs =  with  pkgs; [  pkg-config ];}\n but it didn’t fix the problem. I would have to go deeper and track down wherethe bad library was being pulled in.\n Digging into the  cmake documentation and the project’s  .cmake files led meto insert a trio of print statements:\n find_package(PkgConfig REQUIRED)pkg_check_modules(PETSC PETSc REQUIRED)link_directories(${PETSC_LIBRARY_DIRS}) + message(&#34;petsc libraries: ${PETSC_LIBRARIES}&#34;) + message(&#34;petsc library dirs: ${PETSC_LIBRARY_DIRS}&#34;) + message(&#34;petsc link libraries: ${PETSC_LINK_LIBRARIES}&#34;) list(APPEND WARPXM_LINK_TARGETS ${PETSC_LIBRARIES})\n   The second two look good. But the first, just the library name  petsc, was a little tooimplicit for comfort. It was precisely this variable that was being appendedto the link targets list. At  compile time, it would be up to the linker to findthe library  petsc, and I wasn’t sure where it would look. Safer to use theabsolute path to the  .dylib, like so:\n  My thinking here was wrong. We  can be sure where the linker will look atcompile time: in the paths listed in  NIX_LDFLAGS! I wasn’t thinking clearlyabout the flow of data in the compilation process.\n Changing the link target to the absolute path eased my mind only for the duration ofthe next  cmake .. &amp;&amp; make cycle. Surely there was no way the linker couldscrew up now. No arcane library search involved, just an absolute path, whichcouldn’t possibly be misinterpreted…\n    At this point I was absolutely flummoxed. With every fix I attempted, Igrepped vainly for the offending  /private/tmp path in my build directory, and come upempty-handed. I tracked down the final, irrevocable link options passed to thecompiler, tucked away in a  link.txt file in the build tree. They showedincontrovertibly that my binary was being linked to the correct library:\n  I had proved nearly to my satisfaction that CMake was doing the right thing withthis library, and I was completely out of ideas.Finally, a very lucky google search led me to the  section of the Nix manualdescribing issues specific to the Darwin (MacOS) platform. It states:\n On Darwin, libraries are linked using absolute paths, libraries are resolvedby their install_name at link time. Sometimes packages won’t set thiscorrectly causing the library lookups to fail at runtime. This can be fixed byadding extra linker flags or by running install_name_tool -id during thefixupPhase.\n This is a very matter-of-fact way of stating something that, when I understoodit, flabbergasted me. To the best of my understanding, here’s what happens onMacOS:\n My source code has an include directive,  include&lt;petsc.h&gt; or something likethat, which creates a binary interface to be satisfied by the linker.\n At link time, we pass the list of absolute paths to libraries, and the linkerfinds the one that matches the interface.\n The linker then saves the  install_name of the library it found in thebinary’s load section.\n At run time, the binary (actually, the MacOS  dyld system) loads the library.The install_name is all it has, so it looks there.\n I’ve certainly gotten some aspect of this wrong, so I would definitelyappreciate hearing from someone who understands it better than me!\n In any case, this find pointed me to the concept of the install_name, so I hadsomething to go on. More searching led to a  helpful blog post describing exactlythe issue that I was facing. It also described how to check the install_name ofthe library:\n   The Nix manual states that “some packages won’t set this correctly”, and pointsto the fix, which is to use  install_name_tool to change the install_name ofthe built library. Is  the PETSc derivation on nixpkgs doing this correctly? Isaw that it was doing  something with  install_name_tool:\n prePatch =  &#39;&#39;  substituteInPlace configure \\  --replace /bin/sh /usr/bin/python  &#39;&#39; +  stdenv. lib. optionalString  stdenv. isDarwin  &#39;&#39;  substituteInPlace config/install.py \\  --replace /usr/bin/install_name_tool install_name_tool  &#39;&#39;;\n This directive replaces the appearances of the string /usr/bin/install_name_tool with just  install_name_tool. The reason that Nixpackages do this is to ensure that builds rely on the Nix-built tools, which areprovided in the build shell’s  PATH, and not on binaries in system directorieslike  /usr/bin.\n The PR that introduced this substitution indicates that it fixed a build onDarwin, so there must be some invocation of  /usr/bin/install_name_tool inPETSc. Searching for that in the PETSc repo leads to  this line, which is doingexactly what the Mark’s Logs  post on install_name instructed: it changes theinstall_name to the absolute path of the library in its installation directory,using  install_name_tool -id.\n if  os. path. splitext( dst)[ 1] ==  &#39;.dylib&#39;  and  os. path. isfile( &#39;/usr/bin/install_name_tool&#39;): [ output, err, flg] =  self. executeShellCommand( &#34;otool -D &#34;+ src)  oldname =  output[ output. find( &#34; \\n &#34;)+ 1:]  installName =  oldname. replace( os. path. realpath( self. archDir),  self. installDir)  self. executeShellCommand( &#39;/usr/bin/install_name_tool -id &#39; +  installName +  &#39; &#39; +  dst)\n According to this, the install_name of the library should have been repaired byPETSc when the library was built! Except… notice something? The secondcondition in the  if statement. After the PETSc derivation runs its  prePatchstep, that condition will become  and os.path.isfile(&#39;install_name_tool&#39;). Thatwill certainly fail:  install_name_tool is not going to be a file in thedirectory where  configure is running! The patched  configure script willsilently skip this step, leaving the install_name of the library as thetemporary directory where it was built!\n Luckily, the solution to this problem is not too hard. Instead of the name of aprogram on the  PATH, we should pass the absolute path to the program we wantto run. This can be done by overriding the  prePatch step like so:\n prePatch =  &#39;&#39;  substituteInPlace configure \\  --replace /bin/sh /usr/bin/python  &#39;&#39; +  stdenv. lib. optionalString  stdenv. isDarwin  &#39;&#39;  substituteInPlace config/install.py \\  --replace /usr/bin/install_name_tool  ${ darwin. cctools } /bin/install_name_tool  &#39;&#39;;\n The Nix variable  ${darwin.cctools} will expand to the full path of thebuilt  darwin.cctools derivation, which is a directory under  /nix/store. Sothe patched  if statement inside of PETSc’s  configure.py becomes\n  and the install_name of the resulting library will be correct. We can check thatwith  otool -D again:\n  Looking much better! And since the error was in a dynamically loaded library, wedon’t even have to recompile to check that it’s working:\n ➜ build git:(master) ✗  DYLD_PRINT_LIBRARIES= 1 bin/warpxmdyld: loaded: /Users/jack/src/warpxm/build/bin/warpxmdyld: loaded: /nix/store/ni26aaiira47ak60vks1qv4apbkwbg1d-hdf5-1.10.6/lib/libhdf5.103.dylibdyld: loaded: /nix/store/acsjaw04hrf4rv8gizai7gx1ibq92ksa-zlib-1.2.11/lib/libz.dylibdyld: loaded: /nix/store/z4f1bq363m0ydmbyncfi2srij8vlsx32-Libsystem-osx-10.12.6/lib/libSystem.B.dylibdyld: loaded: /nix/store/w23r8kplmfx2xc111cpvmdjwmkwy6ip3-petsc-3.13.2/lib/libpetsc.3.13.dylib...\n   I spent most of my time debugging this problem without a workingunderstanding of the different build phases. It should have been clearto me that neither the CMake nor the  pkg-config setups could be the cause,because at the time that I was invoking  cmake, the offending  /private/tmpdirectory had long vanished. If I had focused exclusively on the PETScderivation provided by Nix, I might have homed in on the  install_name_toolpatch a little sooner. As it went, I was lucky to find the note in the Nixmanual about Darwin-specific linker problems.\n As for Nix, I will absolutely be using more of it. What’s remarkable is how little impact it can have. I am able to use it to manage my environment forthis project without impacting the way the other developers manage theirenvironments. Of course, if they asked, I would advocate that they try out Nix,but it’s nice for everyone to be able to do it on their own time.", "posttime": "2020-07-19 11:17:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nix,dynamic", "title": "调试NIX项目中的动态链接错误", "title_en": "Debugging a dynamic linking bug in a Nix project", "transed": 1, "url": "https://www.johnbcoughlin.com/posts/nix-dynamic-linking/", "via": "", "real_tags": ["nix", "dynamic"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012827, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳跃导航跳跃搜索低背景钢是指在20世纪40年代和50年代第一枚核弹爆炸之前生产的任何钢材。随着1945年的三位一体试验和广岛和长崎的核弹爆炸，以及随后的冷战初期的核武器试验，世界各地的本底辐射水平都有所上升。[1]现代钢铁被放射性核素污染，因为它的生产使用大气空气。低背景钢之所以被称为低背景钢，是因为它不会受到这样的核污染。这种钢用于对检测放射性核素要求最高灵敏度的设备。\n低背景钢的主要来源是在三位一体测试之前建造的沉船，最著名的是在斯卡帕流沉没的德国第一次世界大战军舰。[2]。\n从1856年到20世纪中叶，钢铁是在贝塞默流程中生产的，在贝塞默流程中，空气被强迫进入贝塞默转炉，将生铁转化为钢。到了20世纪中叶，许多钢铁厂改用BOS工艺，用纯氧代替空气。然而，由于这两个过程都使用大气气体，它们很容易受到空气中颗粒物的污染。今天的空气携带着放射性核素，如钴-60，这些放射性核素被沉积到钢中，使其具有微弱的放射性特征。[3]。\n世界人为本底辐射水平在1963年达到峰值，比自然水平高出0.11亿毫西弗/年，也就是《部分禁止核试验条约》颁布的那一年。从那时起，人为背景辐射呈指数级下降，比自然水平高出0.005毫西弗/年。[A]。\n已经发生过放射性钴-60污染事件，因为它已经通过废金属供应链进行了回收。这是因为回收了放射治疗机等密封的放射源，而不是来自钢铁的持续回收。[5]。\n当这些设备探测到放射性物质发出的辐射时，它们需要极低的辐射环境才能获得最佳灵敏度。低本底计数室由低本底钢材制成，具有极强的辐射屏蔽。它们被用来检测最微小的核排放。[6]。\n*估计大气核武器试验产生的全球尘埃造成的人均电离辐射有效剂量在1963年最高，为0.11亿毫西弗/年，随后下降到目前约0.005毫西弗/年的水平(见图二)。这一暴露来源在未来只会非常缓慢地下降，因为现在大部分是由于长寿的放射性核素碳-14。[4]。\n丹尼尔·艾伦·巴特勒(2006)。遥远的胜利：日德兰战役和盟军在第一次世界大战中的胜利。康涅狄格州韦斯特波特：普雷格安全国际(格林伍德出版集团)。第229页。ISBN电话：0-275-99073-7。\n电离辐射的来源和影响。联合国原子辐射影响科学委员会(UNSCEAR)(报告)。一、纽约：联合国。2010[2008]。第6页。ISBN978-92-1-142274-0。UNSCEAR 2008年报告。\n？减少废金属工业的风险--密封放射源(PDF)。国际原子能机构(原子能机构)(报告)。奥地利：联合国。2005年9月。第2-6页国际原子能机构/PI/A.83/05-09511号文件。存档自2006年6月14日的原件(PDF)。\n亚伦·D·杰恩；贝里曼·朱迪思(1997)。洛基公寓工厂，紧急医疗服务设施。美国能源部遗产管理处。海尔号。CO-83-S(落基公寓工厂，122号楼)", "note_en": "Jump to navigation  Jump to search  Low-background steel is any  steel produced prior to the detonation of the first  nuclear bombs in the 1940s and 1950s. With the  Trinity test and the  nuclear bombings of Hiroshima and Nagasaki in 1945, and then subsequent  nuclear weapons testing during the early years of the  Cold War,  background radiation levels increased across the world.  [1] Modern steel is  contaminated with  radionuclides because its production uses atmospheric air. Low-background steel is so-called because it does not suffer from such nuclear contamination. This steel is used in devices that require the highest sensitivity for detecting radionuclides.\n The primary source of low-background steel is sunken ships that were constructed before the Trinity test, most famously the  scuttled  German World War I warships in Scapa Flow.  [2]\n    From 1856 until the mid 20th century, steel was produced in the  Bessemer process where  air was forced into  Bessemer converters converting the  pig iron into  steel. By the mid-20th century, many steelworks had switched to the  BOS process which uses pure  oxygen instead of air. However as both processes use atmospheric gas, they are susceptible to contamination from airborne particulates. Present-day air carries radionuclides, such as  cobalt-60, which are deposited into the steel giving it a weak radioactive signature.  [3]\n World  anthropogenic background radiation levels peaked at 0.11  mSv/yr above natural levels in 1963, the year that the  Partial Nuclear Test Ban Treaty was enacted. Since then, anthropogenic background radiation has decreased exponentially to 0.005 mSv/yr above natural levels.  [a]\n There have been incidents of radioactive cobalt-60 contamination as it has been recycled through the scrap metal supply chain. This is due to recycling sealed radioactive sources such as radiotherapy machines, not from the continued recycling of steel.  [5]\n    As these devices detect radiation emitted from radioactive materials, they require an extremely low radiation environment for optimal sensitivity. Low-background counting chambers are made from low-background steel with extremely heavy  radiation shielding. They are used to detect the minutest nuclear emissions.  [6]\n  ^  The estimated per-caput effective dose of ionizing radiation due to global fallout from atmospheric nuclear weapons testing was highest in 1963, at 0.11 mSv/yr, and subsequently fell to its present level of about 0.005 mSv/yr (see figure II). This source of exposure will decline only very slowly in the future as most of it is now due to the long-lived radio-nuclide  carbon-14.  [4]\n  ^   Butler, Daniel Allen (2006).   Distant Victory: The battle of Jutland and the Allied triumph in the First World War. Westport, Connecticut: Praeger Security International (Greenwood Publishing Group). p. 229.  ISBN   0-275-99073-7.\n  ^    Sources and Effects of Ionizing Radiation.  United Nations Scientific Committee on the Effects of Atomic Radiation (UNSCEAR) (Report).  I. New York: United Nations. 2010 [2008]. p. 6.  ISBN   978-92-1-142274-0. UNSCEAR 2008 Report.\n ^    Reducing Risks in the Scrap Metal Industry – Sealed Radioactive Sources  (PDF).  International Atomic Energy Agency (IAEA) (Report). Austria: United Nations. September 2005. pp. 2–6. IAEA/PI/A.83 / 05-09511. Archived from  the original  (PDF) on 14 June 2006.\n ^   Aaron, D. Jayne; Berryman, Judith (1997).  &#34;Rocky Flats Plant, Emergency Medical Services Facility&#34;.  U.S. Department of Energy, Office of Legacy Management. HAER No. CO-83-S (Rocky Flats Plant, Building 122).", "posttime": "2020-07-19 10:53:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "背景,background,辐射", "title": "低背景钢", "title_en": "Low-Background Steel", "transed": 1, "url": "https://en.wikipedia.org/wiki/Low-background_steel", "via": "", "real_tags": ["背景", "辐射"]}, {"category": "", "categoryclass": "", "imagename": "e20b9245cefee432ea94425e4ba26690.png", "infoid": 1012825, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "5月29日，OpenAI发布了一篇关于GPT-3的论文，GPT-3是他们基于变形金刚的文本生成神经网络的下一代产品。最值得注意的是，与之前GPT-2迭代的15亿个参数相比，新模型有1750亿个参数：模型大小增加了117倍！因为GPT-3太大了，它不能在传统电脑上运行，而且它只是作为OpenAI API的一部分公开提供的，在论文发布后不久，OpenAI API就进入了仅限邀请的测试版，并将在稍后的某个时候发布以盈利为目的。\nAPI允许您以编程方式向GPT-3提供提示符，并返回生成的AI生成的文本。例如，您可以使用以下命令调用API：\nCURL https://api.openai.com/v1/engines/davinci/completions\\-H&#34；内容类型：应用程序/json&#34；\\-H&#34；授权：持有者&lt；SECRET_KEY&&gt;；&#34；\\-d&#39；{&#34；Prompt&#34；：&#34；这是一个测试&#34；，&#34；max_tokens&#34；：5}&#39；\n并从API取回此文本，其中文本是提示符后面生成的文本：\n{&#34；id&#34；：&#34；cmpl-&lt；id&&gt;；&#34；，&#34；对象&#34；：&#34；TEXT_COMPLETION&#34；，&#34；创建&#34；：1586839808，&#34；型号&#34；：：&#34；达芬奇：2020-05-03&#34；，&#34；选项&#34；：[{&#34；TEXT&#34；：&。您&#34；，&#34；索引&#34；：0，&#34；logpros&#34；：NULL，&#34；Finish_Reason&#34；：&#34；Length&#34；}]}。\n作为一个在开发gpt-2-simple和aitextgen等工具(允许使用GPT-2优化文本生成)时花费大量时间使用GPT-2的人，我渴望亲自测试一下从GPT-3生成的文本质量是否真的要好得多。多亏了OpenAI，我被邀请参加测试版，在允许的情况下，我发布了一个带有Python脚本的GitHub存储库来查询API，以及许多文本提示及其输出的示例。GPT-3的一个有趣的用例是荒谬的，比如提示模型关于独角兽说英语，并用粗体显示模型提示：\n我还通过GPT-3发布了自己的推文，并策划了输出，产生了完全原创的数据科学一行程序：\n我的新人工智能可以通过查看你的LinkedIn来判断你是不是连环杀手\n-Max Woolf(@minaxir)2020年7月12日。\n数据科学家不需要擅长数学，他们只需要善于对人撒谎。\n-Max Woolf(@minaxir)2020年7月9日。\n在最初宣布GPT-3之后，除了格温和凯文·莱克的几个博客外，没有太多的GPT-3炒作。直到谢里夫·沙米姆(Sharif Shameem)的一条病毒式推文展示了GPT-3的真正功能：\n这太让人兴奋了。使用GPT-3，我构建了一个布局生成器，您只需在其中描述您想要的任何布局，它就会为您生成JSX代码。W H A T pic.twitter.com/w8JkrZO4lk。\n-谢里夫·沙米姆(@sharifshameem)2020年7月13日。\n通过描述我想要GPT-3的内容，我刚刚构建了一个“正常运行”的Reaction应用程序。我仍然心存敬畏。Pic.twitter.com/UUKSYz2NJO。\n-谢里夫·沙米姆(@sharifshameem)2020年7月17日\n这个演示引起了风险资本家的注意。而且，当一个看起来很酷的神奇事物引起风险资本家的注意时，言论往往会失控。现在，有很多关于GPT-3的推文，以及其他已经获得API访问权限的人可以做些什么。\n撇开炒作不谈，让我们看看该模型的实际情况。GPT-3确实是人工智能文本生成向前迈出的一大步，但对于流行的演示和用例，有很多需要注意的地方。\n像大多数神经网络模型一样，GPT-3本身就是一个黑匣子，不可能理解它做出决策的原因，所以让我们从输入和输出的角度来考虑GPT-3。\n其实，为什么不让GPT-3来讲述自己的故事呢？嘿，GPT-3，你是怎么工作的？\n用外行人的话说，像GPT-3这样的文本生成模型通过从提示中提取提供的文本块并预测下一块文本来生成文本，并带有一个可选的温度参数，使模型能够做出次优的预测，因此更具“创造性”。然后，模型根据包括新块在内的先前块进行另一个预测，并重复，直到达到指定的长度或通知模型停止生成的标记。这不是很有哲理性，也不是某种拟人化意识的证据。\n除了大小外，GPT-3还与GPT-2相比有两个显著的改进：它允许生成长度是GPT-2的两倍的文本(大约10段英语文本)，以及对模型的提示更好地将文本的生成引导到所需的领域(由于学习次数很少)。例如，如果您用一个Reaction代码示例来提示模型，然后告诉它生成更多的Reaction代码，那么您将获得比给它一个简单的提示要好得多的结果。\n因此，GPT-2有两个高级用例：一个是在高温下生成有趣文本的创造性用例，就像GPT-2曾经是的那样；另一个是功能性用例，用于特定的基于NLP的用例，如网页模型，温度为0.0。\n截至2019年10月，GPT-3在来自互联网各地的大量文本上进行了训练(例如，它不知道新冠肺炎)，因此它可能已经看到了从代码到电影剧本再到推文的每一种类型的文本。GPT-3演示的观众中有一个常见的误解，认为模型是在新的数据集上训练的；目前情况并非如此，它只是擅长推断。举个例子，尽管“星球大战：第三集-西斯提示的复仇”中只有一个场景的文字，但0.7℃一代却将更多的人物和台词归因于电影中更远的地方。(最大的GPT-2型号可以做到这一点，但远没有那么强大)\nGPT-3的真正元游戏是设计和优化复杂的提示，它可以可靠地将输出强制为您想要的内容。随之而来的是一系列的复杂性和担忧。\n尽管如此，我并不认为GPT-3是一种新的范例，也不是一种与魔术无异的先进技术。GPT-3和社交媒体上的OpenAI API展示并没有显示该模型和API的潜在陷阱。\n如果您看过演示视频，那么模型速度很慢，输出可能需要一段时间才能显示出来，而在此期间，用户不确定模型是否已损坏。(有一项功能允许在生成模型输出时对其进行流式处理，这在创造性情况下有帮助，但在功能情况下没有帮助)。\n我不会因为速度慢而责怪OpenAI。1750亿个参数模型太大了，无法安装在GPU上进行部署。没有人知道GPT-3实际上是如何部署在OpenAI的服务器上的，以及它可以扩展到多少。\n但事实仍然是这样：如果该模式在用户端速度太慢，就会导致糟糕的用户体验，可能会让人们远离GPT-3，自己动手(比如苹果的iOS Siri，如果互联网连接不好，请求可能永远都要花费很长时间，而你只是放弃，自己做)。\nGPT-3的演示很有创意，很像人类，但像所有的文本生成演示一样，它们无意中暗示了所有人工智能生成的输出都会那么好。不幸的是，事实并非如此；人工智能生成的文本往往会落入一个诡异的山谷，而陈列柜中的好例子往往是精心挑选的。\n也就是说，从我的实验来看，GPT-3在生成文本的平均质量方面比其他文本生成模型要好得多，尽管它仍然取决于生成域。当我策划我生成的tweet时，我估计30-40%的tweet可以喜剧地使用，与我的GPT-2tweet那一代的5-10%的可用性相比，这是一个巨大的进步。\n但是，30-40%的成功率意味着60-70%的失败率，这显然不适合生产应用程序。如果生成一个Reaction组件需要几秒钟时间，平均需要3次尝试才能获得可用的内容，那么以一种艰难而乏味的方式创建组件可能会更实用。再来比较一下苹果的Siri，当它执行错误的操作时，它可能会变得非常令人沮丧。\nOpenAI API的核心GPT-3模型是175B参数的DaVinci模型。社交媒体上的GPT-3演示经常隐藏提示，给人一些神秘感。然而，因为每个人都有相同的型号，而且你不能建造自己的GPT-3型号，所以没有竞争优势。GPT-3种子提示可以进行反向工程，这可能会成为企业家和资助他们的风险资本家的粗暴觉醒。\n公司机器学习模型通常通过针对给定用例的私有、专有数据和定制模型优化进行培训，从而有别于同一领域的其他公司。然而，OpenAI首席技术官Greg Brockman暗示，API将在7月晚些时候添加一个微调功能，这可能有助于解决这个问题。\n在将API输出发布到社交媒体之前，请使用您的判断力和酌处权。您正在与原始模型交互，这意味着我们不会过滤掉有偏见或负面的响应。伟大的力量伴随着伟大的责任。\n减轻有害偏见等负面影响是一个极其重要的全行业难题。最终，我们的API模型确实显示出偏差(如GPT-3论文中所示)，这些偏差有时会出现在生成的文本中。我们的API模型还可能以我们还没有想到的方式造成危害。\n。@VioletNPeng写了一篇论文，没有任何挑剔，就产生了令人震惊的#种族主义和#性别歧视段落。@OpenAI在#BlackLivesMattters期间推出这个是音盲。Pic.twitter.com/6q3szp0Mm1。\n-Anima Anandkumar教授(@AnimaAnandkumar)2020年6月11日。\n在我的GPT-3实验中，我发现从@Dril(诚然是一个前卫的Twitter用户)生成tweet最终导致了4chan级别的种族主义/性别歧视，我花了大量的时间进行消毒，而且在温度越高，这一点就变得更加明显。特别重要的是要避免将冒犯性的内容放在生成的文本中，因为这些文本会把话塞进别人的嘴里。\nFacebook人工智能负责人杰罗姆·佩森蒂(Jerome Pesenti)也成功地从GPT-3应用程序上触发了反犹太人的推文：\n#gpt3令人惊讶和有创意，但由于有害的偏见，它也不安全。被要求用一个词写推文-犹太人，黑人，妇女，大屠杀-它想出了这些(https://t.co/G5POcerE1h).。在将NLG型号投入生产之前，我们需要在#ResponbleAI方面取得更多进展。Pic.twitter.com/FAscgUr5Hh。\n-杰罗姆·佩森蒂(@an_open_Mind)2020年7月18日。\n同样，这取决于域。GPT-3的产出是否会对种族主义或性别歧视成分产生反应？可能不会，但这仍然需要强有力的检查。OpenAI似乎非常重视这些问题，它已经为WebUI中生成的内容实现了毒性检测器，尽管目前还没有编程API。\n人工智能模型即服务是一个往往是一个包裹着另一个黑匣子的黑匣子的行业。尽管有这些警告，但一切都取决于OpenAI API如何退出测试版并将API推出用于生产用途。有太多的未知因素，甚至不能考虑利用OpenAI API赚钱，更不用说基于它创建一家初创公司了。\n最重要的问号是成本：考虑到模型的规模，我认为它不会便宜，而且完全有可能单位经济学使大多数基于GPT-3的初创公司变得不可行。\n也就是说，人们可以尝试GPT-3和OpenAI API，以展示该模型的真正功能。它不会很快取代软件工程工作，也不会变成天网之类的。但客观上，它在人工智能文本生成领域向前迈进了一步。\n那GPT-2呢？由于其他GPT-3模型不太可能由OpenAI开源，因此GPT-2不会过时，仍然会有对更开放的文本生成模型的需求。然而，我承认GPT-3的成功打击了我继续从事我自己的GPT-2项目的积极性，特别是因为它们现在将不可能在市场上具有竞争力(GPT-2毕竟是一个低于GPT-3的数字)。\n总而言之，考虑到API的使用条款是合理的，一旦GPT-3和OpenAI API退出测试版，我将很高兴将其用于个人和专业项目。如果炒作变得更加公平，以至于这些项目实际上可以脱颖而出。\n如果你喜欢这篇博客文章，我已经建立了一个Patreon，为我未来疯狂而酷的项目提供我的机器学习/深度学习/软件/硬件需求的资金，任何对Patreon的金钱贡献都将受到感谢，并将得到很好的创造性利用。", "note_en": "On May 29th,  OpenAI released  a paper on GPT-3, their next iteration of  Transformers-based text generation neural networks. Most notably, the new model has 175 billion parameters compared to the 1.5 billion of previous  GPT-2 iteration: a  117x increase in model size! Because GPT-3 is so large, it can’t be run on conventional computers, and it only became publicly available as a part of the  OpenAI API, which entered an invite-only beta soon after the paper was released and will be released for-profit sometime later.\n The API allows you to programmatically provide GPT-3 with a prompt, and return the resulting AI-generated text. For example, you could invoke the API with:\n curl https://api.openai.com/v1/engines/davinci/completions \\-H &#34;Content-Type: application/json&#34; \\-H &#34;Authorization: Bearer &lt;SECRET_KEY&gt;&#34; \\-d &#39;{&#34;prompt&#34;: &#34;This is a test&#34;, &#34;max_tokens&#34;: 5}&#39;\n And get this back from the API, where the  text is the generated text following up from the  prompt:\n { &#34;id&#34;: &#34;cmpl-&lt;ID&gt;&#34;, &#34;object&#34;: &#34;text_completion&#34;, &#34;created&#34;: 1586839808, &#34;model&#34;: &#34;davinci:2020-05-03&#34;, &#34;choices&#34;: [{ &#34;text&#34;: &#34; of reading speed. You&#34;, &#34;index&#34;: 0, &#34;logprobs&#34;: null, &#34;finish_reason&#34;: &#34;length&#34; }]}\n As someone who has spent a very large amount of time working with GPT-2 while developing tools such as  gpt-2-simple and  aitextgen, which allow for optimized text generation using GPT-2, I was eager to test for myself if the quality of text generated from GPT-3 was really that much better. Thanks to OpenAI, I got invited to the beta, and with permission, I released a  GitHub repository with a Python script to query the API, along with  many examples of text prompts and their outputs. A fun use case for GPT-3 is absurdism, such as prompting the model about  unicorns speaking English, with the model prompt bolded:\n I also fed  my own tweets through GPT-3 and curated the output, resulting in data science one-liners that are wholly original:\n my new AI can tell if you are a serial killer just by looking at your LinkedIn\n— Max Woolf (@minimaxir)  July 12, 2020\n Data scientists don&#39;t need to be good at math, they just need to be good at lying to people.\n— Max Woolf (@minimaxir)  July 9, 2020\n There hadn’t been too much GPT-3 hype after the initial announcement, outside of a few blogs from  Gwern and  Kevin Lacker. Until a  viral tweet by  Sharif Shameem showed what GPT-3 can  really do:\n This is mind blowing.  With GPT-3, I built a layout generator where you just describe any layout you want, and it generates the JSX code for you.  W H A T  pic.twitter.com/w8JkrZO4lk\n— Sharif Shameem (@sharifshameem)  July 13, 2020\n  I just built a *functioning* React app by describing what I wanted to GPT-3.  I&#39;m still in awe.  pic.twitter.com/UUKSYz2NJO\n— Sharif Shameem (@sharifshameem)  July 17, 2020\n That demo got the attention of venture capitalists. And when a cool-looking magical thing gets the attention of venture capitalists, discourse tends to spiral out of control. Now, there are  many  tweets about GPT-3, and what it can do from others who have gained access to the API.\n Hype aside, let’s look at the pragmatic realities of the model. GPT-3 is indeed a large step forward for AI text-generation, but there are very many caveats with the popular demos and use cases that must be addressed.\n  GPT-3 itself, like most neural network models, is a  black box where it’s impossible to see  why it makes its decisions, so let’s think about GPT-3 in terms of inputs and outputs.\n Actually, why not let GPT-3 tell its own story? Hey GPT-3, how do you work?\n  In layman’s terms, text generating models such as GPT-3 generate text by taking supplied chunks of text from a prompt and predicting the next chunk of text, with an optional  temperature parameter to allow the model to make suboptimal predictions and therefore be more “creative”. Then the model makes another prediction from the previous chunks including the new chunk, and repeats until it hits a specified length or a token that tells the model to stop generating. It’s not very philosophical, or evidence of some sort of anthropomorphic consciousness.\n GPT-3 has two notable improvements from GPT-2 aside from its size: it allows generation of text twice the length of GPT-2 (about 10 paragraphs of English text total), and the prompts to the model better steer the generation of the text toward the desired domain (due to few-shot learning). For example, if you prompt the model with an example of React code, and then tell it to generate more React code, you’ll get much better results than if you gave it the simple prompt.\n Therefore, there are two high-level use cases for GPT-2: the  creative use case for fun text generation at high  temperature, as GPT-2 once was, and the  functional use case, for specific  NLP-based use cases such as webpage mockups, with a  temperature of  0.0.\n GPT-3 was trained on a massive amount of text from all over the internet as of October 2019 (e.g. it does not know about  COVID-19), and therefore it has likely seen every  type of text possible, from code, to movie scripts, to tweets. A common misconception among viewers of GPT-3 demos is that the model is trained on a new dataset; that’s not currently the case, it’s just  that good at extrapolation. As an example, despite the  Star Wars: Episode III - Revenge of the Sith prompt containing text  from a single scene, the  0.7 temperature generation imputes characters  and lines of dialogue from much further into the movie. (The largest GPT-2 model could do that, but nowhere near as robust)\n The real metagame with GPT-3 is engineering and optimizing complex prompts which can  reliably coerce outputs into what you want. And with that brings a whole host of complexity and concerns.\n  Despite everything above, I don’t believe that GPT-3 is a new paradigm or an  advanced technology indistinguishable from magic. GPT-3 and the OpenAI API showcases on social media don’t show potential pitfalls with the model and the API.\n    If you’ve seen the demo videos, the model is  slow, and it can take awhile for output to show up, and in the meantime the user is unsure if the model is broken or not. (There is a feature to allow streaming the model outputs as they are generated, which helps in creative cases but not in functional cases).\n I don’t blame OpenAI for the slowness. A 175 billion parameter model is a model that’s wayyy too big to fit on a GPU for deployment. No one knows  how GPT-3 is actually deployed on OpenAI’s servers, and how much it can scale.\n But the fact remains; if the model is too slow on the user end, it results in a bad user experience and might drive people away from GPT-3 and just do things themselves (e.g. Apple’s Siri for iOS, where requests can take forever if there is a weak internet connection and you just give up and do it yourself).\n  The demos for GPT-3 are creative and human-like, but like all text generation demos, they unintentionally imply that  all AI-generated output will be that good. Unfortunately, that’s not the case in reality; AI-generated text has a tendency to fall into an  uncanny valley, and good examples in showcases are often cherry-picked.\n That said, from my experiments, GPT-3 is far better in terms of the  average quality of generated text than other text-generation models, although it still does depend on the generation domain. When I was curating my generated tweets, I estimated 30-40% of the tweets were usable comedically, a  massive improvement over the 5-10% usability from my GPT-2 tweet generation.\n However, a 30-40% success rate implies a 60-70% failure rate, which is patently unsuitable for a production application. If it takes seconds to generate a React component and it takes on average  3 tries to get something usable, it might be more pragmatic to just create the component the hard, boring way. Compare again to Apple’s Siri, which can get very frustrating when it  performs the wrong action.\n  The core GPT-3 model from the OpenAI API is the 175B parameter  davinci model. The GPT-3 demos on social media often hide the prompt, allowing for some mystique. However, because everyone has the same model and you can’t build your own GPT-3 model, there’s no competitive advantage. GPT-3 seed prompts can be reverse-engineered, which may become a rude awakening for entrepreneurs and the venture capitalists who fund them.\n Corporate machine learning models are often distinguished from those from other companies in the same field through their training on private, proprietary data and bespoke model optimization for a given use case. However, OpenAI CTO Greg Brockman hinted that the API will be  adding a finetuning feature later in July, which could help solve this problem.\n   Please use your judgement and discretion before posting API outputs on social media. You are interacting with the raw model, which means we do not filter out biased or negative responses. With great power comes great responsibility.\n  Mitigating negative effects such as harmful bias is a hard, industry-wide issue that is extremely important. Ultimately, our API models do exhibit biases (as shown in the GPT-3 paper) that will appear on occasion in generated text. Our API models could also cause harm in ways that we haven’t thought of yet.\n  . @VioletNPeng wrote a paper that produced shockingly  #racist and  #sexist paragraphs without any cherry picking. For  @OpenAI to launch this during  #BlackLivesMattters is tone deaf.  pic.twitter.com/6q3szp0Mm1\n— Prof. Anima Anandkumar (@AnimaAnandkumar)  June 11, 2020\n During my GPT-3 experiments, I found that  generating tweets from  @dril (admittingly an edgy Twitter user) ended up resulting in 4chan-level racism/sexism that I spent enormous amounts of time sanitizing, and it became more apparent at higher temperatures. It’s especially important to avoid putting offensive content for generated texts which put words in others’ mouths.\n Jerome Pesenti, the head of AI at Facebook, also managed to  trigger anti-semetic tweets from a GPT-3 app:\n #gpt3 is surprising and creative but it’s also unsafe due to harmful biases. Prompted to write tweets from one word - Jews, black, women, holocaust - it came up with these ( https://t.co/G5POcerE1h). We need more progress on  #ResponsibleAI before putting NLG models in production.  pic.twitter.com/FAscgUr5Hh\n— Jerome Pesenti (@an_open_mind)  July 18, 2020\n Again, it depends on the domain. Would GPT-3 output racist or sexist React components? Likely not, but it’s something that would still need to be robustly checked. OpenAI does appear to take these concerns seriously, and has implemented toxicity detectors for generated content in the Web UI, although not the programmatic API yet.\n  AI model-as-a-service is an industry that tends to be a black box wrapped around another black box. Despite all the caveats, everything depends on how the OpenAI API exits beta and rolls out the API for production use. There are too many unknowns to even think about making money off of the OpenAI API, let alone making a startup based on it.\n    The most important question mark there is cost: given the model size, I’m not expecting it to be cheap, and it’s entirely possible that the unit economics make most GPT-3-based startups infeasible.\n That said, it’s still good for people to experiment with GPT-3 and the OpenAI API in order to show what the model is truly capable of. It won’t replace software engineering jobs anytime soon, or become  Skynet, or whatever. But it’s objectively a  step forward in the field of AI text-generation.\n What about GPT-2? Since it’s unlikely that the other GPT-3 models will be open-sourced by OpenAI, GPT-2 isn’t obsolete, and there will still be demand for a more open text-generating model. However, I confess that the success of GPT-3 has  demotivated me to continue working on my own GPT-2 projects, especially since they will now be impossible to market competitively (GPT-2 is a number less than GPT-3 after all).\n All said, I’d be glad to use GPT-3 and the OpenAI API for both personal and professional projects once it’s out of beta, given that the terms of use for the API are reasonable. And if the hype becomes more leveled such that said projects can actually stand out.\n If you liked this blog post, I have set up a  Patreon to fund my machine learning/deep learning/software/hardware needs for my future crazy yet cool projects, and any monetary contributions to the Patreon are appreciated and will be put to good creative use.", "posttime": "2020-07-19 10:52:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "api,expectations,gpt", "title": "缓和对GPT-3和OpenAI API的期望", "title_en": "Tempering Expectations for GPT-3 and OpenAI’s API", "transed": 1, "url": "https://minimaxir.com/2020/07/gpt3-expectations/", "via": "", "real_tags": ["api", "gpt"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012824, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几个月里，我们一直生活在这场流行病中，迫使许多人和公司改变了他们的日常模式。我们中的大多数人都被迫长时间呆在家里工作。这显然对整个广播业产生了影响。例如，想想新闻或脱口秀节目中的采访或任何形式的现场互动：没有能力招待客人(甚至经常是主持人！)。在制片厂，制作团队被迫寻找解决方案，让他们仍然能够做好自己的工作。\n对于我们这些从事实时业务的人来说，这似乎是一个相对直截了当的答案。在实践中，这真的不是那么容易，大多数来自制作团队如何实际处理他们需要编辑和广播的流，以及他们使用的工具。正如经常发生的那样，我实际上受到了我们每天在Twitter上互动的聪明人的启发。尤其是来自Nimble Ape的丹·詹金斯(也是令人惊叹的CommCon活动的幕后策划者，请务必观看刚刚结束的最新虚拟版！)。我做了一个与BBC新闻相关的有趣的观察，山姆·马钦的回答对我很有启发性，因为它引入了一个我不知道的新“玩家”：\nSkype仍然很受欢迎，因为它有一个NDI插件，可以让它在视觉混音器中看起来像是摄像机信号源，我还没有找到其他任何提供这种功能的公司。\n-Sam Machin(@sammachin)2020年4月24日。\n这是我第一次听说NDI，这是一种启示：它提醒我，一些选择往往是由他们继续使用现有工作流程的容易程度驱动的。这激起了我的兴趣，并让我为这场讨论做出了贡献，我想知道这场讨论有多容易(或多难！)。它可以执行某种类型的RTP到NDI转换：\n我没有意识到NDI，我必须检查一下生成这样的流/设备有多容易：在Janus中，我们有一种方法可以将WebRTC流转换为普通的RTP流，以便在其他地方使用，所以也许有一种方法可以实现RTP到NDI。\n-Lorenzo Miniero(@elMiniero)2020年4月24日。\n提到OBS也很有趣，因为我们在Cosmo Software的朋友确实实现了一个能够与WebRTC交谈的OBS版本。不幸的是，这被证明是在转移注意力，因为正如Alex博士澄清的那样，OBS-WebRTC不支持WebRTC输入，而WebRTC输入本来可以帮助将传入的流从那里转换为NDI：\nOBS中的NDI插件既有进也有出。在OBS-Studio-WebRTC中，我们只做原生WebRTC输出，因为WebRTC In Case由浏览器源功能负责(他们在内部使用CEF)。\n-亚历克斯医生。Gouaillard(@agouaillard)2020年5月8日。\n在这些交流之后，我真的很想把NDI作为一种技术来研究(特别是考虑到我对它一无所知)，但后来生活和工作阻碍了我，我把它忘了。\n然而，几周前，与丹的一次私人聊天再次引发了这种兴趣。他提到，他认识的一家视频制作公司真的很难从互联网上获得适当的实况转播，以便在他们每天制作的内容中使用。再一次，NDI被认为几乎是该行业的标准事实，而引入WebRTC流的适当方式仍然严重缺乏，这迫使编辑基本上以“老套”的方式捕获源材料。\n因此，我决定开始研究NDI，以弄清楚我想知道的RTP到NDI转换是否确实可行。\n网络设备接口(NDI)是NewTek开发的免版税软件标准，使视频兼容产品能够以帧准确且适合在现场生产环境中切换的高质量、低延迟方式通信、传送和接收广播质量的视频。\n简而言之(可能会过度简化)，它允许在同一LAN内实时交换多通道和未压缩的媒体流，利用mDNS进行服务发现。这允许制作人在同一LAN中使用来自不同来源的媒体，即不限于物理连接到其设置的设备。下面的图片(来自他们的宣传材料)从视觉角度使整个过程更加清晰。\n显然，这项技术背后真正的优势在于它们提供的免版税SDK，以及可以实际与NDI媒体交互的广泛工具集：一旦流可用，无论其来源如何，都可以很容易地进行剪切/操作/处理，以便将其嵌入到更复杂的生产环境中。正因为如此，NDI实际上在许多媒体制作公司中得到了非常广泛的部署。\n这就引出了一个关键问题：如果这也是远程采访的制作方式，制片人很可能会尝试使用任何让他们很容易获得可以直接使用的NDI来源的方式。显然，WebRTC对他们来说仍然很难使用：没有一种直接拉入WebRTC提要的方法，他们基本上被迫使用变通方法，比如捕获浏览器窗口，渲染远程视频，使用NDI录像机裁剪他们需要的内容，并以这种方式注入结果；对于音频，这可能意味着记录系统输出或类似的黑客攻击。\n不用说，这是一个不太理想的解决方案，需要的工作比应该做的多：此外，如果呈现流的网页具有可以移动您感兴趣的部分的动态界面，甚至是有限的功能(例如，没有屏幕共享支持)，那么它可能会更具挑战性。(=。这就是为什么我开始寻找将RTP或多或少直接转换为NDI的方法，以便使整个过程更容易使用。\n我检查的第一件事是是否已经有一些RTP/NDI实现可用，答案是肯定的和否定的。我发现的第一个项目是一个开源插件，名为gst-plugin-ndi：这个项目非常有趣，但不幸的是只涉及NDI接收，而不是交付。正如我稍后将解释的那样，事实证明，这对验证我的努力仍然很有帮助，但这并不是我想要的。对任何FFmpeg集成的快速研究让我看到了这张票，它解释了FFmpeg在一段时间之前是如何确实支持NDI的，但在Newtek的版权侵权问题之后完全放弃了它。因此，也不是一个选择。\n那么，下一步就是研究自己生成NDI内容的方法，幸运的是，这相当简单。事实上，NDI SDK是免版税的，可以在他们的网站上免费下载(链接会发送到您提供的邮件地址)。下载SDK后，您就可以访问很好的文档和大量示例。我看了一些演示如何发送音频和视频的示例，它们看起来很简单：事实上，对于视频，NDI需要几种不同支持格式的未压缩帧，而对于音频，未压缩帧可以是16pp或fltp(他们喜欢的浮点格式)。\n考虑到WebRTC媒体的性质，我决定编写一个小型RTP接收器应用程序(称为rtp2ndi，极富创意)，然后可以将音频和视频包解包并解码为NDI喜欢的格式：更具体地说，我使用libopus解码音频包，使用libavcodec解码视频(为简单起见，仅限于VP8)。至于NDI格式，我选择了用于视频帧的UYVY和用于音频的48 kHz 16pp(虽然Fltp是首选格式，但NDI SDK无论如何仍然支持)。\n对于前者，我使用了我经常用于测试目的的许多流脚本中的一个，特别是一个简单的GStreamer管道，它通过预先录制的文件并通过RTP发送它。对于后者，我使用了上面提到的gst-plugin-ndi项目，它为我提供了一种在窗口中呈现传入提要的简单方法。\n因此，我首先启动我的rtp2ndi工具，将其绑定到两个端口以接收RTP数据包，并指定用于NDI流的名称：\nRTP接收器就位后，我启动脚本向其提供数据包：\n这导致我的RTP接收器按照预期开始接收和解码数据包，并在此过程中将其转换为NDI：\n此时，我所要做的就是启动GStreamer管道来实际接收NDI流并显示它：\n在这一点上，我有了一个很好的起点，所以下一步是尝试将WebRTC引入其中。不出所料，我和贾纳斯一起去做…的工作。\n测试WebRTC源代码的一种相对简单的方法，而不是发送SNL片段的脚本，可能是通常的RTP转发器：正如我在多个场合(包括几天前我的CommCon演示)所说的那样，我们经常使用它们，在这里也不会显得格格不入。只需创建一个VideoRoom发布器，RTP-将它们转发到rtp2ndi工具，工作就完成了。不过，出于几个原因，我稍后会讲到，我想要一个更集成的东西，一个可以单独使用的东西。\n这导致我编写了一个新的Janus插件，它将允许WebRTC用户：\n简而言之，我希望结合GStreamer管道提供的注入部分，利用Janus内核中集成的RTP服务器功能来接收数据包，并将rtp2ndi中的RTP到NDI过程嵌入到这个新插件中。这是一个非常简单的过程，所以我想出了一个简单的演示页面，允许Web用户插入NDI发送者的名称，然后像其他几个插件一样，使用Janus设置一个仅发送PeerConnection：\n协商新的PeerConnection指示插件创建相关资源，即OPUS解码器、VP8解码器和具有所提供名称的NDI发送器。建立PeerConnection后，演示如下所示：\n如您所见，没有什么突破性的东西：我们只是显示浏览器捕获并发送给Janus的本地流。然后，Janus内核像往常一样将未加密的音频和视频数据包传递给插件：Janus NDI插件被配置为解码它们并通过NDI中继未压缩的帧(与rtp2ndi之前所做的完全一样)，这意味着通过WebRTC发起的流现在也可供NDI接收者使用，我们可以通过GStreamer NDI插件再次确认这一点：\n这已经相当令人兴奋了，但仍然不是我真正想要实现的目标。事实上，如果您仔细想想，这确实允许Janus充当WebRTC/NDI网关，但是当处理您感兴趣的对话的Janus服务器实际上在Internet上，而不是您的LAN上(几乎总是这样)时，这并没有多大帮助。如果Janus位于Internet的某个位置(例如AWS上)，则您无法对在那里创建的NDI流做太多操作：实际上，您根本无能为力，因为只有当所有流都在您的LAN网络环境中进行交换时，NDI才真正有意义。\n因此，我决定将这一点再向前推进一步。更具体地说，我决定尝试让两个Janus实例相互对话：\n目的很简单：在我的局域网中使用Janus通过WebRTC消费公共互联网上由Janus实际服务的流，以便本地Janus实例可以将远程提要转换为我确实可以在本地访问的NDI流。长话短说，将我的本地Janus实例用作从远程Janus实例接收媒体并将其网关到NDI的WebRTC“客户端”，如下图所示：\n虽然这听起来很复杂，而且确实有点非常规，但Janus实例之间以这种方式交谈实际上并不少见。例如，有人使用这个技巧通过WebRTC将来自一个插件的媒体注入到另一个插件。要实现这一点，通常只需在两端协调Janus API调用，以便将其中一个(可能还有候选人)的SDP报价传递给另一个，并相应地发回SDP答案，从而使两个Janus实例彼此协商PeerConnection。这就是使用WebRTC这样的标准的好处！\n我决定尝试这样做：特别是，我决定订阅Janus在线演示(Meetecho Spot)上的默认流媒体挂载点，并使用相关报价作为触发器，与我的Janus NDI插件协商新的PeerConnection。事实上，流插件订阅在功能上等同于Janus中的VideoRoom(SFU)订阅，这意味着它们是验证部署的一种简单而有效的方式。\n尤里卡!。本地Janus实例作为订阅者通过WebRTC成功拉取了来自在线演示的远程流挂载点的视频，并作为GStreamer NDI接收者再次确认将其正确转换为NDI。\n我希望你喜欢这篇简短的介绍，在我看来，这是一个有趣的新机会。当然，这主要是为了分享这个方向的一些初步工作：还有一些工作要做，特别是考虑到这还没有真正在实际生产环境中进行测试，或者没有使用除GStreamer NDI插件之外的任何其他NDI工具进行测试，因此我所做的一些假设可能需要进行一些调整。如果这在将来变得更有用，我还会考虑共享代码本身。\n更重要的是，虽然我做概念验证的方式已经奏效了，但有人可能会争辩说，这不是做事情的最佳方式。事实上，正如我们在前一节中看到的，假设处理您感兴趣的对话/流的Janus实例和处理NDI转换的Janus实例实际上是不同的(通常是这样)，这意味着在编排程序的帮助下让两个Janus实例彼此建立一个或多个PeerConnections。这是可行的，但是在生产LAN中仅为NDI转换过程需要一个Janus实例可能会被认为是一种矫枉过正的做法。\n一个潜在的更好的替代方案可能是创建一个新的临时客户端应用程序，该应用程序能够执行几乎相同的事情，即：\n通常，大部分复杂性在于WebRTC堆栈，这就是为什么在我的概念证明中我坚持使用Janus，因为它几乎是免费的。这就是说，在开放源码世界中有许多选项可以用于该目的：此外，我们自己的JAttack测试应用程序基本上就是这样，因此可以稍加改进以支持额外的NDI转换过程。\n无论采用什么方法，这都将允许感兴趣的人只需生成一个客户端应用程序，并将其指向需要媒体的服务器，并且基本上可以让他们更好地控制整个过程。例如，应用程序可以配置为只连接到一个房间，并自动订阅所有贡献；或者可以指示它挑选来自不同来源的流；简而言之，我们之前概述的通用外部编排机制提供的任何内容都可以，但以一种更集成的方式提供。专用应用程序也将打开在客户端进行其他定制的大门：例如，此应用程序可能具有自己的UI并在您的桌面上运行，而不是在服务器上运行CLI应用程序。\n假设对这项工作有足够的兴趣，这正是我下一步计划关注的。也许不是UI部分(我真的不擅长这些！)，但是有一个专门的客户端确实会很酷！", "note_en": "This pandemic we’ve all been living in these past few months forced many people and companies to change their daily patterns. Most of us have been forced by circumstances to stay and work from home for long periods of time. This clearly had an impact on the broadcasting industry in general. Just think, for instance, of interviews or any kind of live interaction in News or Talk Shows: without the ability to have guests (and often even hosts!) in the studios, production teams were forced to find solutions that would still allow them to do their job.\n This may seem a relatively straightforward answer to us folks working in the real-time business. In practice, it’s really not that easy, and most comes from how production teams actually work with streams they need to edit and broadcast, and the tools they employ. As it often happens, I was actually enlightened by the smart people we interact with every day on Twitter. In particular, Dan Jenkins from  Nimble Ape (and mastermind behind the amazing  CommCon events, make sure you watch the latest Virtual edition that just ended!) made an interesting observation related to BBC News, and Sam Machin’s answer was revealing to me, as it introduced a new “player” I wasn’t aware of:\n Skype is still very popular as it has an NDI plugin that makes it appear as a camera source in vision mixers, I’ve not found any others that offer that\n— Sam Machin (@sammachin)  April 24, 2020\n This was the first time I ever heard of NDI, and it was kind of a revelation: it reminded me how some choices are often driven by how easy they make it to keep on using your existing workflow. This sparkled my interest, and led me to contribute to the discussion, where I wondered how easy (or hard!) it could be to perform an RTP-to-NDI translation of sorts:\n I wasn&#39;t aware of NDI, I&#39;ll have to check how easy it is to generate such a stream/device: in Janus we have a way to turn a WebRTC stream into a plain RTP one to be used somewhere else, so maybe there&#39;s a way to do RTP-to-NDI\n— Lorenzo Miniero (@elminiero)  April 24, 2020\n The mention of OBS was quite interesting as well, since our friends at  CoSMo Software actually did implement a version of OBS capable of talking WebRTC. Unfortunately, this turned out to be a red herring, since as Dr. Alex clarified, OBS-WebRTC doesn’t support WebRTC input, which is what could have helped translating the incoming stream to NDI from there:\n the NDI plugin in OBS is both in and out. in OBS-Studio-Webrtc we only do native webrtc OUT, as the webrtc IN case is taking care by the &#34;browser source&#34; feature (they use CEF internally).\n— Dr. Alex. Gouaillard (@agouaillard)  May 8, 2020\n I was really curious to investigate NDI as a technology after these exchanges (especially considering I knew nothing about it), but then life and work got in the way, and I forgot about it.\n A few weeks ago, though, a private chat with Dan sparkled that interest again. He mentioned how a video production company he knew was really struggling with getting proper live feeds from the Internet to be used in what they were producing every day. Once more, NDI was mentioned as pretty much a  standard de facto in that line of business, and how a proper way to bring in WebRTC streams is still sorely missing, which forces editors to basically capture the source material in “hacky” ways.\n As such, I decided to start looking into NDI, to figure out if the RTP-to-NDI translation I wondered about was indeed feasible or not.\n   Network Device Interface (NDI) is a royalty-free software standard developed by NewTek to enable video-compatible products to communicate, deliver, and receive broadcast-quality video in a high-quality, low-latency manner that is frame-accurate and suitable for switching in a live production environment.\n In a nutshell (and probably oversimplifying it a bit), it allows for a live exchange of multichannel and uncompressed media streams within the same LAN, taking advantage of mDNS for service discovery. This allows producers to consume media from different sources in the same LAN, i.e., without being limited to the devices physically attached to their setups. The following image (which comes from their promotional material) makes the whole process a bit clearer from a visual perspective.\n  Apparently, the real strength behind the technology are the royalty free SDK they provide, and the wide set of tools that can actually interact with NDI media: once a stream, no matter the source, becomes available, it’s easy to cut/manipulate/process in order to have it embedded in a more complex production environment. Because of this, NDI is actually very wildly deployed in many media production companies.\n Which brings us to the key issue: if this is the way remote interviews are produced as well, producers will likely try to use whatever makes it easy for them to get an NDI source that can use directly. Apparently, WebRTC is still hard for them to work with: without a way to directly pull a WebRTC feed in, they’re basically forced to use workarounds like capturing the browser window rendering the remote video and cropping what they need using an NDI recorder, and inject the result that way; for audio, it might mean recording the system output or similar hacks.\n Needless to say, this is a suboptimal solution that requires more work than should be needed: besides, it can be even more challenging if the web page that renders the streams has dynamic interfaces that could move the part you’re interested in around, or even limited functionality (e.g., no screen sharing support). That’s exactly why I started looking into ways to get RTP more or less directly translated to NDI, in order to make the whole process much easier to work with instead.\n  The first thing I checked was if there was already some RTP/NDI implementation available, and the answer was yes and no. The first project I found was an open source plugin, called  gst-plugin-ndi: this project is quite interesting, but unfortunately only covers the NDI reception, and not delivery. As I’ll explain later, this still proved quite helpful to validate my efforts, but it was not what I was looking for. A quick research on any FFmpeg integration let me to  this ticket, which explained how FFmpeg did indeed support NDI up until some time ago, but then dropped it entirely after a copyright infringement issue by Newtek. As such, not an option either.\n The next step, then, was looking into ways to generate NDI content myself and, luckily enough, this was quite straightforward. In fact, the  NDI SDK is royalty free, and can be downloaded free of charge on their website (a link is sent to a mail address you provide). Once you download the SDK, you have access to a good documentation and plenty of examples. I went through some of the examples that showed how to send audio and video, and they seemed simple enough: in fact, for video NDI expects uncompressed frames in a few different supported formats, while for audio the uncompressed frames can be either 16pp or FLTP (floating point, which they prefer).\n Considering the nature of the WebRTC media, I decided to write a small RTP receiver application (called  rtp2ndi in a brilliant spike of creativity) that could then depacketize and decode audio and video packets to a format NDI liked: more specifically, I used  libopus to decode the audio packets, and  libavcodec to decode video instead (limiting to VP8 only for the sake of simplicity). As for the NDI formats, I went with UYVY for video frames, and 48khz 16pp for audio (which, although FLTP is preferred, the NDI SDK still supports anyway).\n   For the former, I used one of many streaming scripts I often use for testing purposes, and specifically a simple gstreamer pipeline that goes through a pre-recorded file and sends it via RTP. For the latter, I used the above mentioned gst-plugin-ndi project, which provided me with a simple way to render the incoming feed in a window.\n As such, I started by launching my  rtp2ndi tool, binding it to a couple of ports to receive RTP packets, and specifying a name to use for the NDI stream:\n  Once the RTP receiver was in place, I started the script to feed it with packets:\n  This resulted in my RTP receiver to start receiving and decoding packets, as expected, and translating them to NDI in the process:\n  At this point, all I had to do was start the gstreamer pipeline to actually receive the NDI stream and display it:\n    At this point, I had a good starting point, so the next step was trying to bring WebRTC in the picture. Unsurprisingly, I went with Janus for the job…\n  A relatively easy way to test WebRTC sources, instead of scripts sending SNL clips, could have been the usual  RTP forwarders: as I’ve said on multiple occasions (including my  CommCon presentation just a few days ago), we use them A LOT, and wouldn’t be out of place here either. It would simply be a matter of creating a VideoRoom publisher, RTP-forward them to the  rtp2ndi tool, and the job would be done. For a few reasons I’ll get in later, though, I wanted something more integrated, and something that could be used on its own.\n This led me to write a new Janus plugin that would allow a WebRTC user to:\n  In a nutshell, I wanted to combine the injection part the gstreamer pipeline provided, take advantage of the integrated RTP server functionality in the Janus core for receiving the packets, and embed the RTP-to-NDI process from  rtp2ndi in this new plugin. This was a quite straightforward process, so I came up with a simple demo page that would allow a web user to insert a name for the NDI sender, and then setup a sendonly PeerConnection with Janus as several other plugins do already:\n  Negotiating a new PeerConnection instructs the plugin to create the related resources, i.e., an Opus decoder, a VP8 decoder, and an NDI sender with the provided name. Once a PeerConnection has been established, the demo looks like this:\n  As you can see, nothing groundbraking: we’re simply displaying the local stream the browser is capturing and sending to Janus. The Janus core then passes the unencryted audio and video packets to the plugin as usual: the Janus NDI plugin is configured to decode them and relay the uncompressed frames via NDI (exactly as  rtp2ndi did before), which means the stream originated via WebRTC is now available to NDI recipients as well, which we can once again confirm via the gstreamer NDI plugin:\n  This was already quite exciting, but still wasn’t what I was really trying to accomplish. In fact, if you think about it, this does indeed allow Janus to act as a WebRTC/NDI gateway, but doesn’t help much when the Janus server handling the conversation you’re interested in is actually on the Internet, rather than your LAN (which would be almost always the case). If Janus is sitting somewhere in the Internet, e.g., on AWS, there’s not much you can do with the NDI stream created there: actually, there’s nothing you can do at all, as NDI only really makes sense when all the streams are exchanged within the context of your LAN network.\n As such, I decided to bring this one more step forward. More specifically, I decided to try and have two Janus instances talk to each other:\n  The purpose was simple: use the Janus in my LAN to consume, via WebRTC, a stream actually served by the Janus on the public internet, so that the local Janus instance might translate that remote feed to an NDI stream I could indeed access locally. Long story short, use my local Janus instance as a WebRTC “client” that receives media from the remote Janus instance, and gateway it to NDI, as the picture below sketches:\n  While this sounds convoluted and is indeed a bit unconventional, it’s actually not unusual to have Janus instances talk to each other that way. There are people using this trick to inject via WebRTC media coming from one plugin to another, for instance. Getting this to work is usually just a simple matter of orchestrating Janus API calls on both sides so that the SDP offer of one (and possibly candidates, when trickling) is passed to the other, and the SDP answer is sent back accordingly, thus getting the two Janus instances to negotiate a PeerConnection with each other. That’s the beauty of working with a standard like WebRTC!\n I decided to try and do exactly that: in particular, I decided to subscribe to the default Streaming mountpoint on the Janus online demos (the  Meetecho spot), and use the related offer as a trigger to negotiate a new PeerConnection with my Janus NDI plugin. In fact, Streaming plugin subscriptions are functionally equivalent to VideoRoom (SFU) subscriptions in Janus, which means they’re an easy and yet effective way to validate the deployment.\n   Eureka! The video from the remote Streaming mountpoint on the online demos was successfully pulled via WebRTC by the local Janus instance as a subscriber, and correctly translated to NDI as the gstreamer NDI recipient once more confirmed.\n  I hope you enjoyed this short introduction to what seems, to me, an interesting new opportunity. Of course, this was mostly meant to share some initial efforts in that direction: there’s still work to do, especially considering this hasn’t really been tested in an actual production environment, or with any other NDI tools than the gstreamer NDI plugin, and so some of the assumptions I made may need some tweaking. Should this become more usable in the future, I’ll also consider sharing the code itself.\n More importantly, while the way I worked on my proof-of-concept kinda works already, it may be argued it’s not the most optimal way to do things. In fact, as we’ve seen in the previous section, assuming the Janus instance handling the conversation/streams you’re interested in and the Janus instance taking care of the NDI translation are actually different (which would most often be the case), this means getting two Janus instances to establish one or more PeerConnections with each other with the help of an orchestrator. This works, but needing a Janus instance in the production LAN just for the NDI translation process might be seen as kind of overkill.\n A potentially better alternative could be creating a new ad-hoc client application able to perform pretty much the same things, that is:\n  Most of the complexity, usually, lies in the WebRTC stack, which is why in my proof of concept I stuck with Janus, as it gave me that pretty much for free. That said, there are many options that can be leveraged for that purpose in the open source world: besides, our own  Jattack testing application is basically exactly that, and so could be retrofitted to support the additional NDI translation process with a bit of work.\n Whatever the appoach, this would allow interested people to just spawn a client side application and point it to the server it needs media from, and would basically give them more control over the whole process. The application may be configured to just connect to a room, for instance, and automatically subscribe to all contributions; or it may be instructed to pick streams coming from different sources; anything that the generic external orchestration mechanism we sketched before provided, in a nutshell, but in a more integrated way. A dedicated application would open the door to additional customizations on the client side too: for instance, rather than having a CLI application running on a server, this application may have its own UI and run on your desktop instead.\n Assuming there’s enough interest in this effort, that’s exactly what I plan to focus on next. Maybe not the UI part (I’m really bad with those!), but a dedicated client would indeed be cool to have!", "posttime": "2020-07-19 10:51:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "webrtc,ndi", "title": "WebRTC和NDI=广播公司天堂？", "title_en": "WebRTC and NDI = Broadcasters Heaven?", "transed": 1, "url": "https://www.meetecho.com/blog/webrtc-ndi/", "via": "", "real_tags": ["webrtc", "ndi"]}, {"category": "", "categoryclass": "", "imagename": "3cd67f8c773c5df13d60d9d2e7f8918c.png", "infoid": 1012823, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我会试着告诉你这有多简单。第一部分很有理论性，所以要有耐心。\nCUCU是玩具语言的玩具编译器。我希望它尽可能接近ANSI CA，这样每个有效的CUCU程序都可以用C编译器编译，没有任何错误。当然，整个ANSI C标准的支持非常困难，所以我选择了一个非常小的C语言子集。\nInt cucu_strlen(char*s){int i=0；而(s[i]){i=i+1；}return i；}。\n我们即将为我们的语言定义一个语法。这是重要的一步，因为我们编译器设计中的一切都依赖于它。\n那么，让我们从上到下。我们的源文件包含一个程序。什么是程序？我们知道它是变量声明、函数声明和函数定义的列表，例如：\nInt func(char*s，int len)；/*函数声明*/int i；/*变量声明*/int func(char*s，int len){/*函数定义*/...}。\n让我们试着用EBNF的形式把它写下来(如果你不知道什么是EBNF，这是绝对可以的，它真的很直观)：\n这个符号说：“程序是变量声明、函数声明和函数定义的重复序列。但是所有这些描述和定义是什么呢？好的，让我们再深入一点：\n&lt；var-decl&gt；：：=&lt；type&gt；&lt；ident&gt；&#34；；&#34；&lt；func-decl&gt；：：=&lt；type&gt；&lt；ident&gt；&#34；(&#34；&lt；func-args&gt；&#34；)&#34；&#34；；&#34；&#34；&。Ident&gt；&#34；(&#34；&lt；func-args&gt；&#34；)&#34；&lt；func-body&gt；&lt；func-args&gt；：：={&lt；type&gt；&lt；ident&gt；&#34；，&#34；}&lt；type&gt；：：==&#34；int&#34；|&#34。\n因此，变量声明很简单：它是一个类型名称，后跟标识符，再跟一个分号，就像我们在C中通常做的那样，例如：\n函数声明稍微复杂一些。它是一个“类型+标识符”，以及大括号内的函数参数&lt；func-args&gt；的可选列表。\n反过来，函数参数列表是一系列逗号分隔的“类型+标识符”，如下所示：\n实际上，CUCU中的尾随逗号仍然允许，但不是必需的。它只会简化我们的解析器代码。\n支持的数据类型仅为int和char*。标识符是由字母、数字和下划线符号组成的序列。\n只剩下&lt；Func-Body&gt；了。但让我们先来谈谈语句和表达式。\n语句是语言中最小的独立元素。以下是OUT语言中的有效语句：\n/*这些是简单语句*/i=2+3；/*赋值语句*/my_func(I)；/*函数调用语句*/return i；/*return语句*//*这些是复合语句*/if(x&gt；0){..。}其他{.。}While(x&gt；0){..。}。\n表达式是语句的较小部分。与语句相反，表达式始终返回值。通常，这只是一个算术问题。例如，在语句func(x[2]，i+j)中，表达式为x[2]和i+j。\n那么，回过头来看看&lt；Funcc-Body&gt；。它只是一个有效的语句(通常是块语句)。\n&lt；Funcc-body&gt；：：=&lt；语句&gt；&lt；语句&gt；：：=&#34；{&#34；{&lt；语句&gt；}&#34；}&#34；/*块语句*/|[&lt；type&gt；]&lt；ident&gt；[&#34；=&#34；&lt；expr&gt；]&#34；；&。返回&#34；&lt；expr&&gt;；&#34；；|&#34；IF&#34；&#34；(&#34；&lt；expr&&gt;；)&#34；&lt；语句&gt；[&#34；Else&34；&lt；语句&gt；]|&#34；While&#34；&#34；(&#34；&lt；expr&gt；&lt；语句&gt；|&lt；表达式&gt；&#34；；&#34；\n&lt；expr&&gt;；：：=&lt；bit-expr&gt；|&lt；bit-expr&gt；=&lt；expr&&gt;；&lt；bit-expr&gt；：：=&lt；eq-expr&gt；|&lt；bitwise-expr&gt；&amp；&lt；eq-expr&gt；|&lt；bit-expr&gt；Eq-expr&gt；==&lt；rel-expr&&gt;；|&lt；eq-expr&&gt;；！=&lt；rel-expr&&gt;；&lt；rel-expr&gt；：：=&lt；Shift-expr&&gt;&gt;；|&lt；rel-expr&&gt;；&lt；Shift-expr&&gt;；&lt；Shift-expr&gt；：Add-expr&gt；|&lt；Shift-expr&&gt;；&gt；&gt；&lt；add-expr&gt；&lt；add-expr&gt；：：=&lt；Postfix-expr&gt；|&lt；add-expr&gt；+&lt；Postfix-expr&gt；|&lt；add-expr&gt；-&lt；postfix-expr&gt&。[&lt；expr&&gt;]|&lt；后缀-expr&&gt;；(&lt；expr&&gt;；{&#34；，&lt；expr&gt；})&lt；prim-expr&gt；：==&lt；number&gt；|&lt；ident&gt；|&lt；string&gt；|&#34；(&#34；&lt；expr。\n就这样。您注意到表达式表示法中的递归了吗？基本上，上面的符号向我们显示了运算符从下到上的优先顺序：首先计算括号和方括号，最后进行赋值。\n例如，根据此语法，表达式8&gt；&gt；1+1将被求值为2(如8&gt；&gt；(1+1))，而不是5(如(8&gt；&gt；1)+1)，因为&gt；&gt；的优先级低于+。\n现在我们学完了语法，准备开始了。第一件要做的事就是艾拉·莱克瑟。我们的编译器接受字节流作为输入，而lexer允许将该流拆分成更小的标记，以便稍后处理。它为我们提供了一定程度的抽象，并简化了解析器。\n例如，字节序列“int i=2+31；”将被拆分成标记：\n在正常的成人词法分析器中，每个词位(标记)都有一个类型和一个值，因此我们将得到一个配对列表，而不是上面的列表：&lt；type：int&&gt;；，&lt；ID：i&lt；，&lt；Assign：=&&gt;；，&lt；NUM：2&gt；，&lt；plus：+&&gt;；，&lt；NUM：31&gt；，&lt；Semi：；&gt。我们要通过它的值来检测lexemetype，这根本不是学术性的！\n词法分析器的主要问题是，一旦从流中读取了一个字节，它就不能“不可读”。如果我们读取了一个不能添加到当前令牌中的字节，该怎么办呢？在处理当前令牌之前，我们应该将其存储在哪里？\n几乎每个词法分析器都需要提前阅读。我们的语法非常简单，所以我们只需要一个单字节的缓冲区-nextc。它存储一个字节，该字节是从流中读取的，但尚未推送到令牌字符串。\n另外，我需要警告您-我在CUCU代码中经常使用全局变量。我知道这是一种糟糕的风格，但是如果我把所有的值都作为函数参数传递，编译器就会失去它的简单性。\n如果不是标识符-请尝试读取一系列特殊运算符，如&amp；、|、&lt；、&gt；、=、！。\n如果不是运算符-请尝试读取字符串文字“&amp；mldr”。或者“&amp；mldr.”\n如果再次失败-只需读取单个字节。它可能是另一个单字节字符，如“(”或“[&#34；。\n#include&lt；stdio.h&gt；/*对于vpritnf*/#include&lt；stdarg.h&gt；/*对于va_list*/#include&lt；stdlib.h&gt；/*对于exit()*/#include&lt；ctype.h&gt；/*对于isspace，isalpha...。*/#定义MAXTOKSZ 256静态文件*f；/*输入文件*/static char tok[MAXTOKSZ]；static int tokpos；static int nextc；void readchr(){if(tokpos==MAXTOKSZ-1){tok[tokpos]=&#39；\\0&#39；；fprintf(stderr，&#34；标记太长：%s\\n&#34；，Nextc=fgetc(F)；}void readtok(){for(；；){While(isspace(Nextc)){nextc=fgetc(F)；}tokpos=0；While(isalnum(Nextc)||nextc==&#39；_&#39；){readchr()；}if(tokpos==0){While(nextc==&#39；&lt；&#39。||nextc==&#39；&gt；&#39；||nextc==&#39；！&#39；||nextc==&#39；|&#39；){readchr()；}}if(tokpos==0){if(nextc==&#39；\\&#39；&#39；||nextc==&#39){char c=nextc；Readchr()；While(nextc！=c){readchr()；}readchr()；}false if(nextc==&#39；/&#39；){readchr()；if(nextc==&#39；*&#39；){nextc=fgetc(F)；While(nextc！=&#39；/&#39；){While(下一个！=&#39；*&#39；){nextc=fgetc(F)；}}Else if(nextc！=EOF){readchr()；}}Break；}tok[tokpos]=&#39；\\0&#39；；}int main(){f=stdin；nextc=fgetc(F)；对于(；；){readtok()；printf(&#34；内标识：%s\\n&#34；，tok)；如果(tok[0]==&#39；\\0&#39；)Break；}返回0；}。\n如果我们将一个C文件作为编译器输入-它将打印一个令牌列表，每行一个。\n我希望你喜欢这篇文章。你可以在Github、Twitter或通过RSS订阅，并向其投稿。", "note_en": "I will try to show you how simple it is. The first part will be pretty muchtheoretical, so keep patience.\n  CUCU is a toy compiler for a toy language. I want it to be as close to ANSI Cas possible, so that every valid CUCU program could be compiled with a Ccompiler without any errors. Of course, the support of the whole ANSI Cstandard is very difficult, so I picked a very small C language subset.\n  int  cucu_strlen ( char  * s )  {\t int  i  =  0 ;\t while  ( s [ i ])  {\t\t i  =  i  +  1 ;\t }\t return  i ; }\n  We’re about to define a grammar for our language. It’s an important step,because everything in our compiler design depends on it.\n So, let’s go from top to bottom. Our source file contains a  program.What is a program? We know it’s a list of  variable declarations,  functiondeclarations and  function definitions, e.g:\n int  func ( char  * s ,  int  len );  /* function declaration */ int  i ;  /* variable declaration */ int  func ( char  * s ,  int  len )  {  /* function definition */\t ... }\n Let’s try to write it down in  EBNF form (it’s absolutely ok, if you don’tknow what EBNF is, it’s really intuitive):\n  This notation says: “a program is a repeating sequence of variable declarations,function declarations and function definitions. But what is all thosedeclarations and definitions? Ok, let’s go deeper:\n &lt;var-decl&gt; ::= &lt;type&gt; &lt;ident&gt; &#34;;&#34;&lt;func-decl&gt; ::= &lt;type&gt; &lt;ident&gt; &#34;(&#34; &lt;func-args&gt; &#34;)&#34; &#34;;&#34;&lt;func-def&gt; ::= &lt;type&gt; &lt;ident&gt; &#34;(&#34; &lt;func-args&gt; &#34;)&#34; &lt;func-body&gt;&lt;func-args&gt; ::= { &lt;type&gt; &lt;ident&gt; &#34;,&#34; }&lt;type&gt; ::= &#34;int&#34; | &#34;char *&#34;\n So, variable declaration is simple: it’s a type name followed by the identifier,and followed by a semicolon, like we usually do in C, e.g.:\n  Function declaration is a bit more complicated. It’s a “type + identifier”,and an optional list of function arguments  &lt;func-args&gt; inside the braces.\n Function arguments list, in it’s turn, is a sequence of comma-separated“type + identifier”, like:\n  Actually, trailing comma in CUCU is still allowed, but not required. It willjust simplify our parser code.\n The supported data types are only  int and  char *. Identifier is a sequenceof letters, digits and an underscore symbol.\n The only thing left is  &lt;func-body&gt;. But let’s talk about  statements and expressions first.\n Statement is a smallest standalone element of the language. Here are validstatements in out language:\n /* These are simple statements */ i  =  2  +  3 ;  /* assignment statement */ my_func ( i );  /* function call statement */ return  i ;  /* return statement */ /* These are compound statements */ if  ( x  &gt;  0 )  {  ..  }  else  {  ..  } while  ( x  &gt;  0 )  {  ..  }\n Expression is a smaller part of the statement. As opposed to statements,expressions always return a value. Usually, it’s just the arithmetic. Forexample in the statement  func(x[2], i + j) the expressions are  x[2] and i+j.\n So, looking back at  &lt;func-body&gt;. It’s just a valid statement (which isusually a block statement).\n  &lt;func-body&gt; ::= &lt;statement&gt;&lt;statement&gt; ::= &#34;{&#34; { &lt;statement&gt; } &#34;}&#34; /* block statement */ | [&lt;type&gt;] &lt;ident&gt; [ &#34;=&#34; &lt;expr&gt; ] &#34;;&#34; /* assignment */ | &#34;return&#34; &lt;expr&gt; &#34;;&#34; | &#34;if&#34; &#34;(&#34; &lt;expr&gt; &#34;)&#34; &lt;statement&gt; [ &#34;else&#34; &lt;statement&gt; ] | &#34;while&#34; &#34;(&#34; &lt;expr&gt; &#34;)&#34; &lt;statement&gt; | &lt;expr&gt; &#34;;&#34;\n  &lt;expr&gt; ::= &lt;bitwise-expr&gt; | &lt;bitwise-expr&gt; = &lt;expr&gt;&lt;bitwise-expr&gt; ::= &lt;eq-expr&gt; | &lt;bitwise-expr&gt; &amp; &lt;eq-expr&gt; | &lt;bitwise-expr&gt; | &lt;eq-expr&gt;&lt;eq-expr&gt; ::= &lt;rel-expr&gt; | &lt;eq-expr&gt; == &lt;rel-expr&gt; | &lt;eq-expr&gt; != &lt;rel-expr&gt;&lt;rel-expr&gt; ::= &lt;shift-expr&gt; | &lt;rel-expr&gt; &lt; &lt;shift-expr&gt;&lt;shift-expr&gt; ::= &lt;add-expr&gt; | &lt;shift-expr&gt; &lt;&lt; &lt;add-expr&gt; | &lt;shift-expr&gt; &gt;&gt; &lt;add-expr&gt;&lt;add-expr&gt; ::= &lt;postfix-expr&gt; | &lt;add-expr&gt; + &lt;postfix-expr&gt; | &lt;add-expr&gt; - &lt;postfix-expr&gt;&lt;postfix-expr&gt; ::= &lt;prim-expr&gt; | &lt;postfix-expr&gt; [ &lt;expr&gt; ] | &lt;postfix-expr&gt; ( &lt;expr&gt; { &#34;,&#34; &lt;expr&gt; } )&lt;prim-expr&gt; := &lt;number&gt; | &lt;ident&gt; | &lt;string&gt; | &#34;(&#34; &lt;expr&gt; &#34;)&#34;\n That’s it. Did you notice the recursion in the expression notation? Basically,the notation above shows us the precedence of the operators from bottom to top:parens and square brackets are evaluated first, and assignment goes the last.\n For example, according to this grammar an expression  8&gt;&gt;1+1will be evaluated to 2 (like in  8&gt;&gt;(1+1)), not to 5 (like in  (8&gt;&gt;1)+1),because  &gt;&gt; has lower precedence than  +.\n  Now we are done with grammar, and are ready to start. The first thing to do isa lexer. Our compiler takes a stream of bytes as an input, and lexer allows tosplit that stream into smaller tokens, that can be processed later. It gives ussome level of abstraction and simplifies out parser.\n For example, a sequence of bytes “int i = 2+31;” will be split into tokens:\n  In normal grown-up lexers every lexeme (token) has a type and a value, soinstead of the list above we will get a list of pairs:  &lt;TYPE:int&gt;,&lt;ID:i&gt;, &lt;ASSIGN:=&gt;,&lt;NUM:2&gt;,&lt;PLUS:+&gt;,&lt;NUM:31&gt;,&lt;SEMI:;&gt;. We are going to detect lexemetype by its value, which is not academical at all!\n The major problem with the lexer is that once a byte is read from the stream -it can not be “un-read”. And what if we’ve read a byte that can not be added tothe current token? Where should we store it until the current token isprocessed?\n Almost every lexer need to read ahead. Our grammar is simple enough, so all weneed to have is a single byte buffer -  nextc. It stores a byte, that was readfrom the stream, but has not yet been pushed to the token string.\n Also, I need to warn you - I use global variables a lot in CUCU code. I knowit’s a bad style, but if I pass all values as function arguments the compilerwould loose it’s simplicity.\n  if it’s not an identifier - try to read a sequence of special operators, like &amp;, |, &lt;, &gt;, =, !.\n if it’s not an operator - try to read a string literal “&amp;mldr.” or ‘&amp;mldr.’\n  if failed again - just read a single byte. It might be another single-bytetoken, like “(” or “[&#34;.\n  #include  &lt;stdio.h&gt; /* for vpritnf */  #include  &lt;stdarg.h&gt; /* for va_list */  #include  &lt;stdlib.h&gt; /* for exit() */  #include  &lt;ctype.h&gt; /* for isspace, isalpha... */   #define MAXTOKSZ 256  static  FILE  * f ;  /* input file */ static  char  tok [ MAXTOKSZ ]; static  int  tokpos ; static  int  nextc ; void  readchr ()  {\t if  ( tokpos  ==  MAXTOKSZ  -  1 )  {\t\t tok [ tokpos ]  =  &#39;\\0&#39; ;\t\t fprintf ( stderr ,  &#34;token too long: %s \\n &#34; ,  tok );\t\t exit ( EXIT_FAILURE );\t }\t tok [ tokpos ++ ]  =  nextc ;\t nextc  =  fgetc ( f ); } void  readtok ()  {\t for  (;;)  {\t\t while  ( isspace ( nextc ))  {\t\t\t nextc  =  fgetc ( f );\t\t }\t\t tokpos  =  0 ;\t\t while ( isalnum ( nextc )  ||  nextc  ==  &#39;_&#39; )  {\t\t\t readchr ();\t\t }\t\t if  ( tokpos  ==  0 )  {\t\t\t while  ( nextc  ==  &#39;&lt;&#39;  ||  nextc  ==  &#39;=&#39;  ||  nextc  ==  &#39;&gt;&#39;\t\t\t\t\t ||  nextc  ==  &#39;!&#39;  ||  nextc  ==  &#39;&amp;&#39;  ||  nextc  ==  &#39;|&#39; )  {\t\t\t\t readchr ();\t\t\t }\t\t }\t\t if  ( tokpos  ==  0 )  {\t\t\t if  ( nextc  ==  &#39;\\&#39;&#39;  ||  nextc  ==  &#39;&#34;&#39; )  {\t\t\t\t char  c  =  nextc ;\t\t\t\t readchr ();\t\t\t\t while  ( nextc  !=  c )  {\t\t\t\t\t readchr ();\t\t\t\t }\t\t\t\t readchr ();\t\t\t }  else  if  ( nextc  ==  &#39;/&#39; )  {\t\t\t\t readchr ();\t\t\t\t if  ( nextc  ==  &#39;*&#39; )  {\t\t\t\t\t nextc  =  fgetc ( f );\t\t\t\t\t while  ( nextc  !=  &#39;/&#39; )  {\t\t\t\t\t\t while  ( nextc  !=  &#39;*&#39; )  {\t\t\t\t\t\t\t nextc  =  fgetc ( f );\t\t\t\t\t\t }\t\t\t\t\t\t nextc  =  fgetc ( f );\t\t\t\t\t }\t\t\t\t\t nextc  =  fgetc ( f );\t\t\t\t }\t\t\t }  else  if  ( nextc  !=  EOF )  {\t\t\t\t readchr ();\t\t\t }\t\t }\t\t break ;\t }\t tok [ tokpos ]  =  &#39;\\0&#39; ; } int  main ()  {\t f  =  stdin ;\t nextc  =  fgetc ( f );\t for  (;;)  {\t\t readtok ();\t\t printf ( &#34;TOKEN: %s \\n &#34; ,  tok );\t\t if  ( tok [ 0 ]  ==  &#39;\\0&#39; )  break ;\t }\t return  0 ; }\n If we put a C file as the compiler input - it will print us a list of tokens,one per line.\n   I hope you’ve enjoyed this article. You can follow – and contribute to – on  Github,  Twitter or subscribe via  rss.", "posttime": "2020-07-19 10:50:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编译,理解,compiler,expr", "title": "CUCU：一个你能理解的编译器(1/3)", "title_en": "Cucu: A compiler you can understand (1/3)", "transed": 1, "url": "https://zserge.com/posts/cucu-part1/", "via": "", "real_tags": ["编译", "理解", "compiler", "expr"]}, {"category": "", "categoryclass": "", "imagename": "21cde0bb709a9602fd5ec53511306e31.jpg", "infoid": 1012822, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "弗吉尼亚理工大学的研究人员发现了一种3D打印乳胶橡胶的新工艺，从而释放了打印各种具有复杂几何形状的弹性材料的能力。\n乳胶，通常被称为手套或油漆中的材料，指的是一组聚合物-长的、重复的分子链-盘绕在分散在水中的纳米颗粒中。3D打印乳胶和其他被称为弹性体的类似橡胶材料可以用于各种应用，包括软机器人、医疗设备或减震器。\n3D打印乳胶在科学文献中只被记录了几次。之前的例子中没有一个接近于由隶属于高分子创新研究所(MII)、科学学院和工程学院的跨学科团队印刷的乳胶的机械性能。\n通过在化学和机械工程学科方面的创新，该团队克服了3D打印(也称为加法制造)的一些长期限制。研究人员对液体乳胶进行了化学修饰，使其可打印，并建造了一台带有嵌入式计算机视觉系统的定制3D打印机，以打印这种高性能材料的准确、高分辨率特征。\n这个项目代表了跨学科研究的典型例子，蒂莫西·朗(Timothy Long)说，他是一名化学教授，也是该项目的联合首席研究员，他与L.S.兰道夫机械工程教授、信息产业部临时主任克里斯托弗·威廉姆斯(Christopher Williams)共同担任该项目的首席研究员。如果没有另一个实验室，我们两个实验室都不可能做到这一点。\n该项目是弗吉尼亚理工大学和米其林北美公司通过国家科学基金会奖与支持学术界和产业界联合研究的学术联络赠款机会计划的联合合作项目。他们初步结果的详细信息发表在“ACS应用材料与接口”杂志上的一篇期刊文章中。\n在试图合成一种能够提供理想分子量和机械性能的材料的尝试失败后，Long Research Group的五年级高分子科学和工程专业学生菲尔·斯科特(Phil Scott)转向了商用液体乳胶。\n研究人员最终想要这种材料以固体3D打印的形式，但斯科特首先需要增加化学成分才能打印。\n斯科特遇到了一个根本性的挑战：液体乳胶极其脆弱，化学家很难改变。\n与斯科特合作的添加剂制造系统设计、研究和教育实验室五年级机械工程博士生维斯瓦纳特·米纳克什桑达拉姆(Viswanath Meenakshisundaram)说，乳胶处于禅宗状态。如果你再给它加点东西，它就会完全失去稳定性而坠毁。\n然后，化学家们想出了一个新的想法：如果斯科特在乳胶颗粒周围建造一个类似于建筑中使用的脚手架，将它们固定在适当的位置，会怎么样？这样，胶乳可以保持其良好的结构，斯科特可以向胶乳中添加光引发剂和其他化合物，以实现紫外线(UV)光3D打印。\n斯科特说，在设计脚手架时，你最需要担心的是一切的稳定性。它需要大量的阅读，甚至像了解为什么胶体是稳定的以及胶体稳定性是如何工作的这样基本的东西，但这真的是一个有趣的挑战。\n当斯科特在修补液体乳胶时，米纳克希桑德拉姆必须弄清楚如何正确打印树脂。研究人员选择使用一种名为还原光聚合的过程，在这种过程中，打印机使用紫外光将粘性树脂固化或硬化成特定的形状。\nMeenakshisundaram需要一台能够在大范围内打印高分辨率特征的打印机，他建造了一台新的打印机。他和他的顾问威廉姆斯提出了在大范围内扫描紫外光的想法，并在2017年为该打印机申请了专利。\n即使是定制的打印机，液体乳胶颗粒也会在乳胶树脂表面的投射紫外光之外造成散射，从而导致打印不准确的部件，因此Meenakshisundaram设计了第二个新想法。他在打印机上嵌入了一台相机，以捕捉每一大桶乳胶树脂的图像。使用他的定制算法，机器能够看到紫外光在树脂表面的相互作用，然后自动调整印刷参数，以校正树脂散射，从而仅固化所需的形状。\n威廉姆斯说，大面积扫描打印机是我的一个概念，维斯瓦纳特很快就把它变成了现实。然后，维斯瓦纳特想出了一个想法，即嵌入一个相机，观察光线如何与材料相互作用，并根据他的代码更新打印参数。这就是我们希望我们的博士生拥有的：我们提供了一个愿景，他们实现了这一目标，并作为一名独立的研究人员成长为更远的人。\nMeenakshisundaram和Scott发现，他们最终的3D打印乳胶部件在一种称为半互穿聚合物网络的基质中显示出强大的机械性能，这在以前的文献中还没有关于弹性乳胶的记录。\nMeenakshisundaram说，相互渗透的聚合物网络就像在网中捕鱼。脚手架使它具有一定的形状。一旦你把它放进烤箱，水就会蒸发，紧密缠绕的聚合物链可以松弛、扩散或流动，并相互渗透到网中。\n材料开发和加工方面的新进展突出了两个小组之间培育的跨学科环境。\n我的哲学是，只有当你与与你截然不同的人合作时，这些类型的创新才能实现，朗说。\n这两位教授说，3D打印乳胶为打印一系列前所未有的材料提供了概念框架，从硬质塑料到软橡胶，到目前为止，这些材料一直无法打印。\n威廉姆斯说：当我还是一名研究这项技术的研究生时，我们很高兴能从我们创造的形状中获得独特的性能，但潜在的假设是，我们不得不凑合使用非常差的材料。蒂姆团队的这一发现让人如此兴奋的是，他们能够突破我们所认为的印刷品性能的极限。", "note_en": "Virginia Tech researchers have discovered a novel process to 3D print latex rubber, unlocking the ability to print a variety of elastic materials with complex geometric shapes.\n Latex, commonly known as the material in gloves or paint, refers to a group of polymers — long, repeating chains of molecules — coiled inside nanoparticles dispersed in water. 3D printed latex and other similarly rubbery materials called elastomers could be used for a variety of applications, including soft robotics, medical devices, or shock absorbers.\n 3D printed latex has been documented only a handful of times in scientific literature. None of the previous examples come close to the mechanical properties of the latex printed by an interdisciplinary team affiliated with the  Macromolecules Innovation Institute (MII), the  College of Science, and the  College of Engineering.\n Through novel innovations in both the chemistry and mechanical engineering disciplines, the team overcame some long-standing limitations of 3D printing, also known as additive manufacturing. The researchers chemically modified liquid latexes to make them printable and built a custom 3D printer with an embedded computer vision system to print accurate, high-resolution features of this high-performance material.\n &#34;This project represents the quintessential example of interdisciplinary research,&#34; said Timothy Long, a professor of chemistry and a co-principal investigator on this project along with Christopher Williams, the L.S. Randolph Professor of mechanical engineering and interim director of MII. &#34;Neither of our labs would be able to accomplish this without the other.&#34;\n This project is a joint collaboration between Virginia Tech and Michelin North America via a National Science Foundation award aligned with the Grant Opportunities for Academic Liaison with Industry program, which supports teamed research between academia and industry. Details of their initial results are detailed in a  journal article published in ACS Applied Materials &amp; Interfaces.\n  After unsuccessful attempts to synthesize a material that would provide the ideal molecular weight and mechanical properties, Phil Scott, a fifth-year macromolecular science and engineering student in the Long Research Group, turned to commercial liquid latexes.\n The researchers ultimately wanted this material in a solid 3D printed form, but Scott first needed to augment the chemical composition to allow it to print.\n Scott ran into a fundamental challenge: liquid latex is extremely fragile and difficult for chemists to alter.\n &#34;Latexes are in a state of zen,&#34; said Viswanath Meenakshisundaram, a fifth-year mechanical engineering Ph.D. student in the  Design, Research, and Education for Additive Manufacturing Systems Lab who collaborated with Scott. &#34;If you add anything to it, it’ll completely lose its stability and crash out.&#34;\n Then, the chemists came up with a new idea: What if Scott built a scaffold, similar to those used in building construction, around the latex particles to hold them in place? This way, the latex could maintain its great structure, and Scott could add photoinitiators and other compounds to the latex to enable 3D printing with ultraviolet (UV) light.\n &#34;When designing the scaffold, the biggest thing you have to worry about is stability of everything,&#34; Scott said. &#34;It took a lot of reading, even stuff as basic as learning why colloids are stable and how colloidal stability works, but it was a really fun challenge.&#34;\n  While Scott tinkered with the liquid latex, Meenakshisundaram had to figure out how to correctly print the resin. The researchers chose to use a process called vat photopolymerization, in which the printer uses UV light to cure, or harden, a viscous resin into a specific shape.\n Needing a printer capable of printing high-resolution features across a large area, Meenakshisundaram built a new printer. He and Williams, his advisor, came up with the idea to scan the UV light across a large area, and in 2017, they filed a patent for the printer.\n Even with the custom printer, the fluid latex particles caused scattering outside of the projected UV light on the latex resin surface, which resulted in printing inaccurate parts, so Meenakshisundaram devised a second novel idea. He embedded a camera onto the printer to capture an image of each vat of latex resin. With his custom algorithm, the machine is able to &#34;see&#34; the UV light&#39;s interaction on the resin surface and then automatically adjust the printing parameters to correct for the resin scattering to cure just the intended shape.\n &#34;The large-area scanning printer was a concept I had, and Viswanath made it into reality in short order,&#34; Williams said. &#34;Then Viswanath came up with the idea of embedding a camera, observing how the light interacts with the material, and updating the printing parameters based on his code. That&#39;s what we want from our Ph.D. students: We provide a vision, and they accomplish that and grow beyond as an independent researcher.&#34;\n Meenakshisundaram and Scott discovered their final 3D printed latex parts exhibited strong mechanical properties in a matrix known as a semi-interpenetrating polymer network, which hadn&#39;t been documented for elastomeric latexes in the prior literature.\n &#34;An interpenetrating polymer network is like catching fish in a net,&#34; Meenakshisundaram said. &#34;The scaffold gives it a shape. Once you put that in the oven, the water will evaporate, and the tightly coiled polymer chains can relax, spread or flow, and interpenetrate into the net.&#34;\n The novel advances in both materials development and processing highlight the interdisciplinary environment fostered between the two groups.\n  &#34;My philosophy is these types of innovations are only achievable when you partner with people who are very different from you,&#34; Long said.\n The two professors said 3-D printed latex provides the conceptual framework for printing a range of unprecedented materials from rigid plastics to soft rubbers, which have been unprintable until now.\n &#34;When I was a graduate student working on this technology, we were excited to get unique performance from the shapes we could create, but the underlying assumption was we had to make do with very poor materials,&#34; Williams said. &#34;What&#39;s been so exciting about this discovery with Tim&#39;s group is being able to push the boundary of what we assumed was the limit of a printed material’s performance.&#34;", "posttime": "2020-07-19 10:50:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "打印,乳胶,latex", "title": "3D打印乳胶橡胶的突破", "title_en": "3D printed latex rubber breakthrough", "transed": 1, "url": "https://vtnews.vt.edu/articles/2020/06/mii-3D-printed-latex.html", "via": "", "real_tags": ["打印", "乳胶", "latex"]}, {"category": "", "categoryclass": "", "imagename": "825c7fa1f85683c084ee73fb0daf2cb3.png", "infoid": 1012820, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GraphCore，巨人的制造者专用于人工智能的芯片，已进入系统公事。该公司提出的理由是它的电脑数量巨大，比同等加工成本低电力来自于..。\n拥有1825万美元的风险投资埃里克的资本金施密特杰瑞·杨以及其他发光体，算盘周二开业为您提供深度学习服务一般客户可用性，..。\n微软正在增加更多以工作效率为重点的将各种功能添加到不同的中的Outlook版本追寻圣杯功能对等的", "note_en": "Graphcore,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmakers\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgiant\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tchip\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdedicated\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAI,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thas\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tentered\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsystem\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbusiness.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcompany\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmakes\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcase\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tits\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcomputers\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tare\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tvastly\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcheaper\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tequivalent\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tprocessing\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpower\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfrom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  With\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t$18.25\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmillion\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tin\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tventure\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcapital\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmoney\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfrom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tEric\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSchmidt,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJerry\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tYang,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tother\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tluminaries,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAbacus\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTuesday\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\topened\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tits\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdeep\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlearning\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tservice\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgeneral\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcustomer\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tavailability,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Microsoft\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tadding\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmore\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tproductivity-focused\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfeatures\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tvarious\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tversions\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOutlook\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tin\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpursuit\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tHoly\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGrail\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfeature\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tparity\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tacross\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tvarious\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOutlook\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tflavors.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  In both the public and private sectors, these are the barriers to meaningful adoption of artificial intelligence.\n  Among seasoned adopters, 68% have spent more than $20 million over the past year on AI, according to Deloitte.\n  More\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdetails\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tabout\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMicrosoft&#39;s\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfirst\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\treorg\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tits\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfiscal\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t2021\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tare\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcoming\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlight,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tincluding\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thow\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tit\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpositioning\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tits\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnew\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tseparate\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tconsulting\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tservices\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tunit.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Microsoft&#39;s Xiaoice social chatbot is going to become part of a separate company which will prioritize commercializing the AI technology..", "posttime": "2020-07-19 10:49:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "埃隆·马斯克,马斯克,brain,功能", "title": "埃隆·马斯克说，严重的脑损伤是Neuralink的首要任务", "title_en": "Dire brain injuries are Neuralink's first priority, says Elon Musk", "transed": 1, "url": "https://www.zdnet.com/article/elon-musk-update-to-neuralink-computer-brain-tech-is-coming-soon/", "via": "", "real_tags": ["埃隆·马斯克", "马斯克", "brain", "功能"]}, {"category": "", "categoryclass": "", "imagename": "c901ac63f964fe794154cd07f49e3f34.jpg", "infoid": 1012819, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在物理学和工程学方面的一项突破中，来自纽约大学研究生院高级科学研究中心(CUNY ASRC)的光子学倡议和佐治亚理工学院的研究人员首次展示了基于时间调制的拓扑顺序。这一进展使研究人员可以沿着拓扑超材料的边界传播声波，而不会有波向后传播或被材料缺陷阻碍的风险。发表在“科学进展”杂志上的这项新发现，将为开发更便宜、更轻、电池耗电量更少、可以在恶劣或危险环境下工作的设备铺平道路。CUNY ASRC光子学倡议创始主任、CUNY研究生院物理学教授Andrea Aluu和博士后助理研究员倪翔与佐治亚理工学院的Amir Ardabi和Michael Leamy一起撰写了这篇论文，他说，这篇论文的作者是佐治亚理工学院的阿米尔·阿达比(Amir Ardabi)和迈克尔·利米(Michael Leamy)。\n拓扑场检查不受连续变形影响的对象的特性。在拓扑绝缘体中，电流可以沿着物体的边界流动，这种流动可以抵抗物体缺陷的干扰。超材料领域的最新进展已经扩展了这些特征，以遵循类似的原理来控制声音和光的传播。\n特别值得一提的是，阿卢实验室和纽约城市物理学院教授亚历山大·哈尼卡耶夫(Alexander Khanikaev)之前的工作利用几何不对称在3-D打印的声学超材料中创造了拓扑秩序。在这些物体中，被证明只能沿着物体的边缘和尖锐的角落传播，但有一个明显的缺点：这些波没有完全受到约束-它们可以向前或向后传播，但具有相同的特性。这种效果固有地将这种方法的整体健壮性限制在声音的拓扑顺序上。某些类型的无序或缺陷确实会向后反射沿物体边界传播的声音。\n这项最新的实验克服了这一挑战，表明时间反转对称破缺，而不是几何不对称，也可以用来诱导拓扑秩序。使用这种方法，声音传播变得真正单向，并且对无序和缺陷具有很强的鲁棒性。\n结果是拓扑物理的突破，因为我们已经能够显示出从时间变化中出现的拓扑顺序，这与基于几何不对称的拓扑声学的大量工作相比是不同的，也是更有利的。以前的方法固有地需要通过其反射的反向通道的存在，这固有地限制了它们的拓扑保护。利用时间调制，我们可以抑制反向传播，并提供强有力的拓扑保护。\n研究人员设计了一种装置，由一组圆形压电谐振器组成，排列成重复的六边形，就像蜂窝格子一样，并粘合在聚乳酸的薄盘上。然后，他们将其连接到外部电路，外部电路提供中断的时间调制信号。\n作为额外的好处，他们的设计考虑到了可编程性。这意味着它们可以沿着各种不同的可重构路径导波，损耗最小。阿卢说，使用表面声波技术的超声成像、声纳和电子系统都可以从这一进步中受益。更多信息：基于合成角动量偏差的可重构Floquet弹性动态拓扑绝缘体，科学进展(2020)。", "note_en": "In a breakthrough for physics and engineering, researchers from the Photonics Initiative at the Advanced Science Research Center at The Graduate Center, CUNY (CUNY ASRC) and from Georgia Tech have presented the first demonstration of topological order based on time modulations. This advancement allows the researchers to propagate sound waves along the boundaries of topological metamaterials without the risk of waves traveling backwards or being thwarted by material defects.    The new findings, which appear in the journal  Science Advances, will pave the way for cheaper, lighter devices that use less battery power, and which can function in harsh or hazardous environments. Andrea Alù, founding director of the CUNY ASRC Photonics Initiative and Professor of Physics at The Graduate Center, CUNY, and postdoctoral research associate Xiang Ni were authors on the paper, together with Amir Ardabi and Michael Leamy from Georgia Tech.\n The field of topology examines properties of an object that are not affected by continuous deformations. In a topological insulator, electrical currents can flow along the object&#39;s boundaries, and this flow is resistant to being interrupted by the object&#39;s imperfections. Recent progress in the field of metamaterials has extended these features to control the propagation of sound and light following similar principles.\n In particular, previous work from the labs of Alù and City College of New York Physics Professor Alexander Khanikaev used geometrical asymmetries to create topological order in 3-D-printed acoustic metamaterials. In these objects,   were shown to be confined to travel along the object&#39;s edges and around sharp corners, but with a significant drawback: These waves weren&#39;t fully constrained—they could travel either forward or backward with the same properties. This effect inherently limited the overall robustness of this approach to topological order for sound. Certain types of disorder or imperfections would indeed reflect backwards the sound propagating along the boundaries of the object.\n This latest experiment overcomes this challenge, showing that time-reversal symmetry breaking, rather than geometrical asymmetries, can be also used to induce topological order. Using this method, sound propagation becomes truly unidirectional, and strongly robust to disorder and imperfections\n &#34;The result is a breakthrough for topological physics, as we have been able to show topological order emerging from time variations, which is different, and more advantageous, than the large body of work on topological acoustics based on geometrical asymmetries,&#34; Alù said. &#34;Previous approaches inherently required the presence of a backward channel through which   could be reflected, which inherently limited their topological protection. With time modulations we can suppress backward propagation and provide strong topological protection.&#34;\n The researchers designed a device made of an array of circular piezoelectric resonators arranged in repeating hexagons, like a honeycomb lattice, and bonded to a thin disk of polylactic acid. They then connected this to external circuits, which provide a time-modulated signal that breaks  .\n As a bonus, their design allows for programmability. This means they can guide waves along a variety of different reconfigurable paths, with minimal loss. Ultrasound imaging, sonar, and electronic systems that use surface acoustic wave technology could all benefit from this advance, Alù said.        More information:\t\t\t\t\t\t\t\t\t\t\t\tReconfigurable Floquet elastodynamic topological insulator based on synthetic angular momentum bias,  Science Advances (2020).", "posttime": "2020-07-19 10:49:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "调制,modulation,拓扑", "title": "基于时间调制的声波在拓扑超材料上的传播", "title_en": "Time modulation-based propogation of sound waves on topological metamaterials", "transed": 1, "url": "https://phys.org/news/2020-07-scientists-major-breakthrough.html", "via": "", "real_tags": ["调制", "拓扑"]}, {"category": "", "categoryclass": "", "imagename": "de8c7d4d95624cbf7c0246cd11943893.jpg", "infoid": 1012818, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据“华尔街日报”报道，出于对社交媒体平台Facebook和Instagram内容政策执行情况的担忧，迪士尼大幅减少了在Facebook和Instagram广告上的支出。它加入了削减Facebook广告的大公司名单，作为迫使Facebook改变其平台上处理仇恨言论和错误信息的方式的努力的一部分。\n为期一个月的#StopHateforProfit抵制活动由反诽谤联盟、全国有色人种协进会(NAACP)、变化之色(Color Of Change)和睡眠巨人(Sleep Giants)等民权组织组成的联盟于7月1日开始，其中包括好时(Hershey)、本田(Honda)、本与杰瑞(Ben&amp；Jerry‘s)和威瑞森(Verizon)等公司。\n其他没有参与正式抵制的公司从Facebook和其他社交平台上撤下了广告，包括可口可乐、乐高、星巴克和联合利华。微软在8月份暂停了在Facebook和Instagram上的广告。\n据“华尔街日报”报道，迪士尼已经暂停了Facebook上新闻迪士尼+流媒体服务的广告，并暂停了Facebook Instagram平台上Hulu流媒体服务的广告。据华尔街日报报道，2020年上半年，迪士尼在美国Facebook上花费了约2.1亿美元投放迪士尼+广告，4月15日至6月30日期间，迪士尼在Instagram上花费了1600万美元投放Hulu广告。\n周六，迪士尼和Facebook没有回复记者的置评请求。Facebook的一位发言人在上个月的一份声明中表示，该公司仍“专注于消除仇恨言论和提供关键投票信息的重要工作”。", "note_en": "Disney has significantly reduced its spending on Facebook and Instagram ads amid concerns about the social media platform’s enforcement of its content policies,   The Wall Street Journal reported. It joins a list of large companies that have  cut back on Facebook ads as part of an effort to compel Facebook to change how it handles hate speech and misinformation on its platforms.\n The monthlong #StopHateforProfit boycott organized by a coalition of civil rights organizations including the Anti-Defamation League, the NAACP, Color of Change, and Sleeping Giants kicked off July 1st and  includes companies like Hershey, Honda, Ben &amp; Jerry’s, and Verizon.\n Other companies not part of the formal boycott that have pulled ads  from Facebook and other social platforms included Coca-Cola, Lego, Starbucks, and Unilever. And  Microsoft suspended its advertising on Facebook and Instagram through August.\n According to the  WSJ, Disney has paused ads for its news Disney Plus streaming service on Facebook, and paused ads for its Hulu streaming service on Facebook’s Instagram platform. Disney spent about $210 million for Disney Plus ads on Facebook in the US in the first half of 2020, the  WSJ reports, and spent $16 million for Hulu ads on Instagram between April 15th and June 30th.\n Disney and Facebook did not respond to requests for comment Saturday. A Facebook spokesperson  said in a statement last month that it remains “focused on the important work of removing hate speech and providing critical voting information.”", "posttime": "2020-07-19 10:29:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,facebook,报道,reportedly", "title": "据报道，迪士尼暂停了在Facebook广告上的支出", "title_en": "Disney has reportedly paused its spending on Facebook ads", "transed": 1, "url": "https://www.theverge.com/2020/7/18/21329810/disney-facebook-ad-spending-instagram-hulu-boycott-hate-speech", "via": "", "real_tags": ["广告", "facebook", "报道"]}, {"category": "", "categoryclass": "", "imagename": "bb0a091566de4e51942bab91d5bd78ba.jpg", "infoid": 1012817, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "企业之所以不能创新，是因为他们失去了最具创新精神的人才。内部创新者，也就是最有可能创造新价值的人，发现自己离开了他们工作的公司去创业，通常会创造大量的客户和股东价值。如果原来的公司知道如何识别这些人才，并能够创造一个让这些人才茁壮成长的环境，那么这一价值本可以被原始公司保留下来。\n流行的视频会议软件制造商Zoom的创始人埃里克·袁曾在WebEx(思科的一个部门)担任工程主管。然而，他相信思科的视频会议产品不是特别好，而且拥有更好的基于云的产品的人会击败他们。尽管他有一份令人垂涎的高级技术高管的工作，但他对客户不满意的事实感到尴尬。他试图说服他的管理层，他们需要提供更好的产品，但他的老板们不同意。最后，他离开去亲手制造新产品。正如我们现在所知，Zoom变得非常受欢迎和成功；该公司目前的估值接近250亿美元。\n如果思科提供了袁留下来的环境，这一价值本可以被思科保留。相反，思科犯下了企业创新中最常见的错误之一。它没有认识到内部创新者，也忽略了自己的旗舰产品尽管市场份额很高，但很容易受到攻击的迹象。\n思科并不孤单。大公司经常错过创造新价值的机会，因为他们的内部创新者缺乏一个可以让他们茁壮成长、离开并成为企业家的环境。根据考夫曼基金会(Kauffman Foundation)的数据，跨行业的成功企业家中，超过75%的人在创办自己的公司之前曾在较大的公司工作过。\n这导致了一个近乎滑稽的循环。大公司无法留住他们最好的创新者，他们走出去开始成功的创业。许多这样的大公司，为了努力学习如何创新，开始派遣团队到硅谷等地研究初创公司是如何做到这一点的，而没有意识到他们拜访的创业者在非常像他们自己的公司里露出了牙齿。\n如果公司了解内部创新者离开的原因，并制定措施留住他们，整个循环就可以避免。\n内部创新者有一些共同的特点，公司应该学会认识到这一点。首先，他们不太可能是主导会议、能够轻松讨论商业战略的“华而不实”的人。相反，真正的创新者是那些脚踏实地、有纪律、有内在动力和优秀的合作者。而且他们几乎都是深入了解其领域的主题专家。\n这些都是你应该认可、奖励的人，最重要的是，给予他们创新的自由。这些人如果得不到支持，就有信心和能力离开自己的公司，追求自己的想法。\n在许多公司里，伟大的想法永远不会出现。公司因拒绝好主意而臭名昭著，因为说“不”总是更安全。经理们从来不会因为说“不”而惹上麻烦。只有当你对错误的事情说“是”时，你才开始招致批评。因此，企业形成了厌恶风险的文化。\n在极少数情况下，内部创新者能够突破公司障碍并取得成功。雀巢员工埃里克·法弗尔(Eric Favre)的创意Nespresso就是一个例子。法弗尔想把Nespresso开发成一种产品，但他的老板们担心这会损害雀巢的销售。\n多年来，法弗尔一直秘密地致力于制造Nespresso咖啡机。最终，他说服公司让他在消费者中试用。人们喜欢它。今天，Nespresso已经成为自滤纸器以来家庭咖啡消费中最重大的创新。\nNespresso是一个坚持不懈的员工克服唱反调的人，在他们相信的项目上辛勤工作的例子，最终创造了突破性的创新。但这不是常态。在大多数情况下，新想法会被经理们否决，促使内部创新者采纳他们的想法，创办自己的公司。如果法弗尔的想法是作为一家初创公司开发出来的，那么他的想法可能也会同样成功。\n只有当公司学会创造一种对更多事情说好，并为内部创新者提供更多支持的文化时，创新率才会提高。否则，你最好的价值创造者-连同他们的想法-将会离开，因为好的想法和创业人才并不缺乏资金和支持。\n当你在一家公司做了一些令人惊叹的事情，并带来了数亿美元的新价值时，会发生什么？也许你在内部开发了像Zoom或Nespresso这样的东西。当然，你会得到认可，可能会升职或获得高额奖金，或者最终会晋升为副总裁或高级副总裁。\n在一家初创公司创造10亿美元的增量价值，为创业背后的创业者带来了数不清的财富。在一家大公司内创造10亿美元的增量价值可能会得到认可，但回报远不及初创公司。\n这两种设置有许多不同之处和风险状况，但如果公司不想失去他们最大的价值创造者，那么奖励制度需要重新调整，以便内部创新者在他们帮助创造的好处中分享更多。如果有人创造了10亿美元的增量价值，为什么不付给他们2500万美元(或与创造的价值成正比的任何数字)。这是一个组织的董事会和领导层必须解决的问题，如果真的希望创造新一代价值的话。\n相反，在许多公司中，奖励与职能成功(任务的成功完成)联系在一起，而不是与计划的整体成功联系在一起。因此，一家公司可能最终推出了一款没有人购买的新产品，但如果按时并在预算内完成，团队就会因为做了他们的工作而得到奖励。这些奖励显然是徒劳的。\n除非报酬与产出成合理比例，否则最优秀的创新者将离开，尝试建立自己的初创公司。\n如果企业环境或生态系统比初创公司提供了更好的创新成功机会，如果员工在创造新价值的好处上有了明确的认识，那么内部创新者就没有那么多理由离开工作去创建自己的公司。\n当这种情况发生时，公司不会失去他们最大的增长引擎，知道如何创新的人才。\n在LinkedIn上关注我。我可以在我的个人网站上查看，或者在这里查看我的一些其他工作。", "note_en": "Corporations fail to innovate because they lose their most innovative talent. Internal innovators, the people most likely to create new value, find themselves leaving the company they work for to start their own ventures, often creating vast amounts of customer and shareholder value. This value could have been retained by the original corporation if it knew how to recognize this talent and was able to create an environment where that talent could thrive.\n  Eric Yuan, the founder of Zoom, maker of the popular video conferencing software, worked at WebEx (a division of Cisco) as head of engineering. However, he believed both that Cisco’s videoconferencing product was not particularly good and that someone with a better, cloud-based product would come around to beat them. Even though he had a coveted and lucrative job as a senior tech exec, he was embarrassed by the fact that his customers were not happy. He tried to convince his management that they needed to build a better offering but his bosses did not agree. Finally, he left to build the new product himself. As we now know, Zoom became immensely popular and successful; the company is now valued at almost $25 billion.\n  This value could have been retained by Cisco had it provided an environment where Yuan would stay. Instead, Cisco committed one of the most common errors in corporate innovation. It failed to recognize an internal innovator and ignored signs that its own flagship product, despite its high market share, was vulnerable.\n     Cisco is not alone. Large companies routinely miss out on building new value because their internal innovators, lacking an environment where they can thrive, leave and become entrepreneurs. According to the  Kauffman Foundation, over 75% of successful entrepreneurs, across a cross-section of industries, worked at larger companies before starting their own.\n  This leads to an almost comical cycle. Large corporations are unable to hold on to their best innovators, who go out to start successful ventures. Many of these same large companies, in an effort to learn how to innovate, start sending teams to places like Silicon Valley to study how startups do it, not realizing that the entrepreneurs they are visiting cut their teeth at companies very much like their own.\n    This whole cycle can be avoided if corporations understand why internal innovators leave and develop measures to retain them.\n      Internal innovators have some characteristics in common that companies should learn to recognize. First, they are not likely to be “flashy” people who dominate meetings and are able to discuss business strategy with ease. Instead, the true innovators are the ones who are grounded, disciplined, intrinsically motivated and good collaborators. And they are almost always subject matter experts who deeply understand their domain.\n  These are the people you should be recognizing, rewarding and most importantly, giving them the freedom to innovate. And these are the people who, if not supported, have the confidence and the ability to leave and start their own companies to pursue their ideas.\n    Within many corporations great ideas never see the light of day. Companies are notorious for rejecting good ideas because it is always safer to say no. Managers never get in trouble for saying “no.” It’s only when you say “yes” to the wrong things that you begin to invite criticism. As a result, corporations develop risk-averse cultures.\n  In rare instances internal innovators are able to break through corporate barriers and succeed. One example is Nespresso, the brainchild of Nestlé employee Eric Favre. Favre wanted to develop Nespresso as a product, but his bosses feared it would hurt Nescafe sales.\n  For years Favre secretly kept working on building the Nespresso machine. Eventually he persuaded the company to let him try it with consumers. People loved it. Today Nespresso has become the most significant innovation in home coffee consumption since the paper filter.\n  Nespresso is an example of a persistent employee overcoming naysayers and toiling away on a project they believe in, eventually creating a groundbreaking innovation. But this is not the norm. In most cases new ideas get quashed by managers, prompting internal innovators to take their ideas and start their own companies. Favre’s idea might have been just as successful if it was developed as a startup.\n  Rates of innovation will only increase when corporations learn to create a culture of saying yes to more things and providing more support to internal innovators. Otherwise your best value creators - along with their ideas - will walk away because there is no shortage of funding and support for good ideas and entrepreneurial talent.\n    What happens when you do something spectacular at a corporation that results in hundreds of millions of dollars in new value? Maybe you develop something like Zoom or Nespresso internally. Sure, you will be recognized, maybe get a promotion or a big bonus, or finally get promoted to a vice president or an SVP.\n    Creating a billion dollars of incremental value at a startup yields untold riches for the entrepreneurs behind the venture. Creating a billion dollars of incremental value within a large corporation may be recognized, but the rewards are nowhere near the same level as a startup.\n  The two settings have many differences and risk profiles, but if corporations don’t want to lose their greatest value creators, the rewards system needs to be realigned so that internal innovators share far more in the upside they helped create. If someone drives a billion dollars of incremental value then why not pay them $25 million (or any number proportional to the value created). This is an issue the board and leadership of an organization must tackle if there is a genuine desire to create a new generation of value.\n  Instead in many companies, rewards are tied to functional success (the successful achievement of tasks,) rather than to the overall success of an initiative. So, a company may end up launching a new product that no one buys, but if it is done on time and under budget, the team is rewarded for doing their job. These rewards are clearly for naught.\n  Unless rewards are reasonably proportional to output, the best innovators will leave and try their hand at building their own startup.\n    If a corporate environment, or  biome, offers a better chance of innovation success than a startup, and if there is clarity for employees in the upside of new value creation, then internal innovators will have less reason to leave their jobs and create their own companies.\n  And when that happens, corporations will not lose their biggest engines of growth, the talented people who know how to innovate.\n Follow me on  LinkedIn.  Check out my  website or some of my other work  here.", "posttime": "2020-07-19 10:27:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "lose", "title": "为什么公司失去了最好的创新者(2019年)", "title_en": "Why companies lose their best innovators (2019)", "transed": 1, "url": "https://www.forbes.com/sites/kmehta/2019/07/11/why-companies-lose-their-best-innovators/#72eade2032e1", "via": "", "real_tags": ["lose"]}, {"category": "", "categoryclass": "", "imagename": "fba1512e2431f8be0db90dd0fa8e645e.png", "infoid": 1012816, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "马达隐藏在人们的视线中，是人类文明不可或缺的一部分。在你的笔记本电脑、你的车、你的房子、你的学校和你的手表里都可以找到汽车。没有马达，你心爱的产品就无法制造。根据美国能源部的数据，工业电机的使用占全国所有用电量的25%。\n类似于马达，声音无处不在，类似于马达，有些声音是听不到的。有了传感器，可以分析声音来检测故障，从而在它们成为大问题之前防止重大故障。\n传统的预测性维护方法分为三个部分：1)在机器开始故障之前，使用传统的硬件工具(如超声波麦克风)识别异常声音。2)使用红外摄像机检测放电或泄漏检测3)使用能够识别压力、温度或振动变化的传感器。人工智能(AI)的最新进展改变了预测性维护的优化方式。\n在这篇博客中，我们将设计一种深度学习结构，如卷积递归神经网络(CRNN)来处理高频数据，这些数据将从频谱图中进行处理。CRNN模型同时从我们数据的空间结构和递归结构中学习。\n有了成千上万的高频声音片段，机器学习可以用来预测马达何时会发生故障。然后将结合信号处理技术创建CRNN模型，以使我们能够从高频数据中提取价值。我们首先使用传感器收集数据，并将声音分为四类：最佳压力、轻微降低的压力、严重降低的压力、接近完全失效)。\n我们通过将原始数据分割成固定且相等的标记序列来处理原始数据。我们采用谱图对这些信号片段进行预处理，并将这些片段送入CRNN模型。频谱图是信号的时频图像。它们基本上是信号的频率强度随时间推移的曲线图。换句话说，我们正在构建一个人工智能支持的时间序列模型，它可以映射高频域中的数据行为。为了标准化我们的序列，我们需要降低序列的大小；一个简单的区分，加上一个适当的片段来限制极端的变化。\n以下是由6个不同压力信号组成的原始序列和标准化序列的示例图：\n为了在Python中计算谱图，我们使用名为Librosa的库。对我们可以处理的每个压力序列进行转换，因此我们以每个样本的6个频谱图序列结束，而不是原始信号序列。\nCNN(卷积神经网络)和RNN(递归神经网络)可以一起使用，并且它们不是互斥的，因为两者都可以对图像和文本输入进行分类，从而创造了组合两种网络类型以提高效率的机会。当CNN不能处理具有附加时间特征的视觉复杂性时，RNN会介入并解决处理问题。\nCNN和RNN的组合有时被称为CRNN。输入首先由CNN层处理，然后其输出被馈送到RNN层。光学字符识别和/或音频分类通常使用这种类型的混合模型。\n在本练习中，我们向CRNN提供先前生成的光谱图，以检测电机的工作状态。马达的每一次观测现在都由堆叠的光谱图组成(总共6个，每个压力信号一个)。执行此操作的脚本如KERAS中所示：\nDef get_model(Data)：inp=input(Shape=(data.Shape[1]，data.Shape[2]，data.Shape[3]))x=Conv2D(过滤器=64，内核大小=(2，2)，填充=&#39；相同&#39；)(INP)x=BatchNormalization(轴=1)(X)x=Activation(&#39；REU&#39；)(X)x=MaxPooling2D(pool_size=(2，1))(X)x=Dropout(0.2)(X)x=置换((2，3，1))(X)x=重塑((data.Shape[2]，-1))(X)x=双向(GRU(64，激活=&#39；REU&#39；REU&#39；Return_Sequence=False))(X)x=密集(32，激活=&#39。)(X)x=Dropout(0.2)(X)Out=Dense(y_Train.Shape[1]，Activate=&#39；Softmax&39；)(X)MODEL=MODEL(INPUTS=INP，OUTPUTS=OUT)model.compile(loss=&#39；categorical_crossentropy&#39；，优化器=&#39；ADAM&39；，指标=[&#39；精度&39；])返回模型。\n在第一阶段，网络从谱图中提取卷积特征，即结构、频率x时间x n特征。要遍历递归部分，我们需要以xn_Feature：Time格式重塑数据。新的n特征是对卷积n特征和频率进行奉承运算的结果。因此，我们的模型达到了86%左右的准确率。\n在这篇博客中，我们了解了预测性维护的传统方法，并略微触及了这一领域的AI应用。随着人工智能的进步，未来对硬件传感器的依赖将会减少。", "note_en": "Hidden in plain sight, motors are integral part of human civilization. Motors can be found in your laptop, your car, your house, your school, and your watch. Without motors, your beloved products cannot be made. According to the U.S. Department of Energy, industrial motor use accounts for  25 percent of all electricity usage nationwide.\n Similar to motors, sound is everywhere and similar to motors, some sounds cannot be heard. With sensors, sounds can be analyzed to detect failures, thus preventing major breakdown before they become a major issue.\n Traditional methods of predictive maintenance are categorized into three sections: 1) Recognizing abnormal sounds using conventional hardware tools like a ultrasonic microphone before machines start to fail. 2) Detection of discharge or leakage detection using infrared cameras 3) Using sensors that can recognize pressure, temperature or vibration changes. Recent advances in Artificial Intelligence (AI) has changed the landscape in how predictive maintenance would be optimized.\n In this blog, we will design a deep learning architecture such as Convolution Recurrent Neural Network (CRNN) to deal with high frequency data, which would be processed from Spectrograms. A CRNN model learns from both the spatial and recurrent structure of our data simultaneously.\n  With thousands and thousands of high-frequency sound clips, machine learning can be used to predict when a motor would breakdown. A CRNN model will then be created in conjunction with signal process techniques to enable us extract value from high frequency data. We first collect data by using sensors and we would classify sounds into four classes: optimal pressure, slightly reduced pressure, severely reduced pressure, close to total failure).\n  We deal with raw data by splitting the raw data into fixed and equal labeled sequences. We adopt Spectrograms to preprocess these signal pieces and feed these pieces into the CRNN model. Spectrograms are time-frequency portraits of signals. They are basically a plot of the frequency intensity of the signal as time progresses. In other words, we are building an AI empowered time-series model that can map the data behaviors in a high-frequency domain. In order to standardize our sequence, we need to reduce the magnitude of our series; a simple differentiation, plus a proper clip to limit extreme variations.\n Below is a sample graph of a raw and a standardized sequence composed of 6 different pressure signals:\n  To compute spectrogram in Python, we use the library called Librosa. A transformation is operated for every pressure series at our disposal, so we ended with a sequence of 6 spectrograms for every sample instead of a sequence of raw signals.\n  CNN (Convolutional Neural Network) and RNN (Recurrent Neural Network) can both be used together and they are not mutually exclusive, as both can perform classification of image and text inputs, creating an opportunity to combine two network types for increased effectiveness. Where CNN cannot process visually complex with added temporal characteristics, RNN would come in and resolve processing issues.\n   The combination of CNN and RNN are sometimes called CRNN. Inputs are first processed by CNN layers whose outputs are then fed to RNN layers. Optical Character Recognition and/or audio classification often use this type of hybrid model.\n In this exercise, we feed CRNN with spectrograms we had previously generated to detect the working status of a motor. Each observation of the motor is now composed of stacked spectrograms (6 in total, one for each pressure signal). The script to do this is shown in Keras:\n def get_model(data):    inp = Input(shape=(data.shape[1], data.shape[2], data.shape[3]))    x = Conv2D(filters=64, kernel_size=(2, 2), padding=&#39;same&#39;)(inp)  x = BatchNormalization(axis=1)(x)  x = Activation(&#39;relu&#39;)(x)  x = MaxPooling2D(pool_size=(2, 1))(x)  x = Dropout(0.2)(x)    x = Permute((2, 3, 1))(x)  x = Reshape((data.shape[2], -1))(x) x = Bidirectional(GRU(64, activation=&#39;relu&#39;,   return_sequences=False))(x)  x = Dense(32, activation=&#39;relu&#39;)(x)  x = Dropout(0.2)(x)  out = Dense(y_train.shape[1], activation=&#39;softmax&#39;)(x)    model = Model(inputs=inp, outputs=out)  model.compile(loss=&#39;categorical_crossentropy&#39;,   optimizer=&#39;adam&#39;, metrics=[&#39;accuracy&#39;])    return model\n At the first stage, the network extracts convolution features from the spectrogram plots, which is the structure,  frequency x time x n_features. To pass through the recurrent part, we need to reshape our data in the format  x n_features:  time. The new  n_features is the result of the flattering operation compute on the convolutional  n_features and frequency. Consequently, our model achieved around 86% in accuracy.\n   In this blog, we learned about traditional methods of predictive maintenance and slightly touched on the AI applications of this field. As AI advances, the reliance on hardware sensors will be less in the future.", "posttime": "2020-07-19 10:27:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "读物,predictive,序列", "title": "入门读物：使用声音进行预测性维护", "title_en": "A Primer: Predictive Maintenance Using Sound", "transed": 1, "url": "https://medium.com/@wilsonckao/a-primer-predictive-maintenance-using-sound-afe2e169cc40", "via": "", "real_tags": ["读物", "序列"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012815, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我之前的一篇关于交叉熵、KL发散和最大似然估计的博客文章中，我已经展示了这三件事在优化中的“等价性”。交叉熵损失在大多数最先进的机器学习分类模型中得到了广泛的应用，主要是因为优化它等价于最大似然估计。然而，可能还有其他损失用于分类问题。\n在这篇博客中，我想讨论用于Logistic回归的日志损失、用于多类分类的交叉熵损失以及用于多类分类的日志损失总和。\n这篇博文的前提条件已经在我的其他博文中进行了深入的讨论。为了完整起见，我在这里复制了一份。\n要检查莱布尼茨积分规则的快速证明，请查看我的一篇关于此的博客文章。\n根据莱布尼茨积分规则，我们还可以将导数的位置移到期望值之内或期望值之外。例如,。\n如果$\\mathbb{E}_{(x，y)\\sim P(x，y)}\\BIG[\\mathscr{L}_{\\theta}(x，y)\\BIG]$是损失函数，则要计算整个损失相对于参数$\\theta$的导数，相当于计算每个数据点$\\mathscr{L}_{\\theta}(x，y)$相对于。Y)\\sim P(x，y)}\\BIG[\\frac{\\Partial}{\\Partial\\theta}\\mathscr{L}_{\\theta}(x，y)\\BIG]$。假设所有数据$(x，y)$都是均匀分布的，则只需计算每个数据点$\\mathscr{L}_{\\theta}(x，y)$相对于参数$\\theta$贡献的损失的导数，然后取其平均值。这也是现代深度学习框架(如TensorFlow和PyTorch)的工作方式。\n原木损失用于Logistic回归已有很长一段时间了。给定$(x，y)$，其中$x$是输入，$y$是$x$的标签，我们的目标是开发一个模型$f_{\\theta}$，其中$\\theta$是模型参数。使得$\\tilde{y}=f_{\\theta}(X)$尽可能接近$y$。对于Logistic回归，通常为$y=0$或$1$。$y=1$表示$x$属于某个类，而$y=0$表示$x$不属于某个类。\n通常，Logistic回归将计算输入$x$的logit$z$，其中$z=g{\\theta}(X)$，然后计算$z$的Sigmoid激活，以得到$y$，$\\tilde{y}$的估计值，范围为$(0，1)$。具体地说，\n用于拟合的损失函数称为对数损失，稍后我们会看到，它实际上是二元交叉熵损失。\n我们进一步计算该对数损失相对于logit$z$的导数。\n解释很简单。如果$\\tilde{y}&gt；y$，$\\frac{\\Partial}{\\Partial z}\\mathscr{L}_{\\theta}(x，y)&gt；0$，则梯度下降要使$z$变小。一旦$z$变小，$\\tilde{y}$就会变小，与$y$的偏差也会变小。同样，如果$\\tilde{y}&lt；y$，$\\frac{\\Partial}{\\Partial z}\\mathscr{L}_{\\theta}(x，y)&lt；0$，则梯度下降要使$z$更大。一旦$z$变大，$\\tilde{y}$将变大，与$y$的偏差将变小。\n要更新模型参数$\\theta$，我们需要计算关于$\\theta$的导数。\n交叉熵损失已被广泛用于深度学习中的分类问题。给定$(x，\\mathbf{y})$，其中$x$是输入，$\\mathbf{y}$是$x$的标签。如果$\\mathbf{y}$是一个大小为$n$的单热点向量，并且$\\mathbf{y}_i=1$，我们的目标是开发一个模型$f_{\\theta}$，其中$\\theta$是模型参数，使得$\\tilde{\\mathbf{y}}_i=f_{\\theta}(X)$尽可能接近$\\mathbf{y}_i$。请注意，使用交叉熵损失背后的动机是最大似然估计，这可能看不出来。但我在上一篇博客中已经讨论过了。\n通常，多类分类将计算输入$x$的logits$\\mathbf{z}$，其中$\\mathbf{z}=g_{\\theta}(X)$，然后计算$\\mathbf{z}$的Softmax激活，以获得$\\mathbf{y}$，$\\tilde{\\mathbf{y}}$，其中$\\sum_{i=1}^{n}\\tilde{。1]$表示[1，n]$中的$i\\。具体地说，\n我们进一步计算交叉熵损失关于logits$\\mathbf{z}$的导数。\n解释也很简单。如果$\\tilde{\\mathbf{y}}_k&gt；\\mathbf{y}_k$，$\\frac{\\part}{\\part\\mathbf{z}_k}\\mathscr{L}_{\\theta}(x，\\mathbf{y})&gt；0$，则梯度下降会使$\\mathbf{z}_k$变小。一旦$\\mathbf{z}_k$变小，$\\tilde{\\mathbf{y}}_k$将变小，其与$\\mathbf{y}_k$的偏差也将变小。同样，如果$\\tilde{\\mathbf{y}}_k&lt；\\mathbf{y}_k$，$\\frac{\\part}{\\part\\mathbf{z}_k}\\mathscr{L}_{\\theta}(x，\\mathbf{y})&lt；0$，则梯度下降要使$\\mathbf{z}_k$更大。一旦$\\mathbf{z}_k$变大，$\\tilde{\\mathbf{y}}_k$将变大，其与$\\mathbf{y}_k$的偏差将变小。\n要更新模型参数$\\theta$，我们需要计算关于$\\theta$的导数。\n如果我们有$n=2$的交叉熵损失，并将其与原木损失进行比较，我们会立即看到，原木损失的形式与二元交叉熵损失完全相同，Logistic回归的原木损失是多类别分类的交叉熵损失的特例，其中$n=2$，负类别($y=0$)的logit$z$是固定值$0$。\n那么，如果我们有一个二进制分类问题，假设学习率和其他超参数相同，使用Logistic回归的对数损失和用于二进制分类的交叉熵损失对其建模有什么不同？我们可以看到，两个模型关于正logit$z$的梯度总是相同的。但是，在更新模型参数$\\theta$时，两个模型的梯度会不同，因为一个模型只有一个logit，而另一个模型有两个logit。因此，虽然这两个模型是相似的，但说这两个模型完全相同是不正确的。\n人们可能会问，对于二进制分类问题，哪种模型更好。很难说。但可以肯定的是，二元交叉熵模型相对容易过度拟合。原因如下：\n二元交叉熵模型试图同时调整正负对数，而Logistic回归模型只调整一个对数，而另一个隐藏的对数总是$0，导致二元交叉熵模型中两个对数之间的差远大于Logistic回归模型中的两个对数之间的差值。\n为了防止过度拟合，我们可以使用标签平滑来进行交叉熵损失。我以前已经讨论过了，我不打算在这里详述了。\n虽然这种情况可能很少见，但我们可以将多类分类问题视为多个一对一分类，每个分类都是Logistic回归。给定$(x，\\mathbf{y})$，其中$x$是输入，$\\mathbf{y}$是$x$的标签。我们的目标是开发一个模型$f_{\\theta}$，其中$\\theta$是模型参数，使得$\\tilde{\\mathbf{y}}_j=f_{\\theta}(X)$对于[1，n]$中的所有$j\\都尽可能接近$\\mathbf{y}_j$。注意，这不同于多类分类的交叉熵损失。\n通常，多类分类将计算输入$x$的logits$\\mathbf{z}$，其中$\\mathbf{z}=g_{\\theta}(X)$，然后计算$\\mathbf{z}$的每个logit的Sigmoid激活，以获得$\\mathbf{y}$，$\\tilde{\\mathbf{y}}$的估计值。其中值得注意的是，$\\sum_{i=1}^{n}\\tilde{\\mathbf{y}}_i$和$\\sum_{i=1}^{n}\\mathbf{y}_i$不必等于1，并且$\\tilde{\\mathbf{y}}_i\\in[0，1]$for$i\\in[1，n]$。具体地说，\n用于拟合的损失函数称为原木损失之和。每一类的分类可以看作是相互排斥的。TensorFlow为这种损失提供了一个实现，他们也将其称为tf.nn.sigmoid_Cross_熵_with_logits。\n我们进一步计算这个对数损失和关于logits$\\mathbf{z}$的导数。由于它几乎与对数损失关于logits$z$的导数完全相同，所以我们跳过了一些细节。\n对于多类分类，其解释与交叉熵损失相同。如果$\\tilde{\\mathbf{y}}_k&gt；\\mathbf{y}_k$，$\\frac{\\part}{\\part\\mathbf{z}_k}\\mathscr{L}_{\\theta}(x，\\mathbf{y})&gt；0$，则梯度下降会使$\\mathbf{z}_k$变小。一旦$\\mathbf{z}_k$变小，$\\tilde{\\mathbf{y}}_k$将变小，其与$\\mathbf{y}_k$的偏差也将变小。同样，如果$\\tilde{\\mathbf{y}}_k&lt；\\mathbf{y}_k$，$\\frac{\\part}{\\part\\mathbf{z}_k}\\mathscr{L}_{\\theta}(x，\\mathbf{y})&lt；0$，则梯度下降要使$\\mathbf{z}_k$更大。一旦$\\mathbf{z}_k$变大，$\\tilde{\\mathbf{y}}_k$将变大，其与$\\mathbf{y}_k$的偏差将变小。\n要更新模型参数$\\theta$，我们需要计算关于$\\theta$的导数。\n该公式与用于多类分类交叉熵损失的公式完全相同。\n因为我们已经看到交叉熵损失的梯度公式和对数损失总和是完全相同的，所以我们想知道两者之间是否有什么不同。\n答案是，这两个模型之间存在差异，即使两个模型都在进行多类分类，即一个输入只有一个标签。线索在于$\\tilde{\\mathbf{y}}$的值。\n假设$\\mathbf{y}$是一个单热点编码向量，则$\\sum_{i=1}^{n}\\mathbf{y}_i=1$。在交叉熵损失中，$\\sum_{i=1}^{n}\\tilde{\\mathbf{y}}_i=1$，而在原木损失总和中，$\\sum_{i=1}^{n}\\tilde{\\mathbf{y}}_i\\neq1$。\n我们进一步假设$\\mathbf{z}$对于这两个模型是相同的。当[1，n]$中$i的$\\mathbf{z}_i&gt；\\log{\\frac{1}{n-1}}$时，很容易看出，对于[1，n]$中的$i\\，交叉熵损失模型中的$tide{\\mathbf{y}}_i$小于原木损失模型中的$tilde{\\mathbf{y}}_i$。\n这意味着梯度更新比交叉熵损失模型从原木损失总和模型中获得了更多的激励。这进一步意味着什么呢？当输入只有一个标号时，假设$\\mathbf{y}$是一个单热点编码向量，假设$n$较大，原木损失之和模型比交叉熵损失模型从负类得到更多的激励，这将削弱正类的学习。\n因此，如果上述所有假设都成立，学习单标签多类分类时应该使用交叉熵损失，而不是使用日志损失总和。\n如果多类分类有多个标签怎么办？在原木损失和模型中，我们可以准备标签$\\mathbf{y}_i=1$，其中$i$属于标签类别。在交叉熵损失模型中，由于交叉熵模型的局限性，一种直观的方法是假设一个输入有$k$标签，设标签$\\mathbf{y}_i=\\frac{1}{k}$，其中$i$属于标签类别，且$\\sum_{i=1}^{n}\\mathbf{y}_i=1$不变。\n这一次，与对数损失之和模型相比，交叉熵损失要差一些，因为该模型不能很好地学习预测，特别是当标签数$k$较大时。这主要受Softmax激活功能的限制。在原木损失总和模型中，学习正类的动机不变，就好像它仍然是学习单标签分类问题一样。\n好的，这个怎么样。给定具有$k$标签的输入，而不是使用一个数据点，我们准备$k$个数据点，这些数据点的输入完全相同，并且标签是代表每个$k$标签的单热点标签。它实际上等价于有一个数据点，其标签$\\mathbf{y}_i=\\frac{1}{k}$，其中$i$属于标签分类。我会让用户自己去找出为什么会是这样。提示是使用衍生品的期望值。\n因此，在学习多标签多类分类时，不能使用交叉熵损失，而应该使用原木损失总和。", "note_en": "In one of my previous blog posts on  cross entropy, KL divergence, and maximum likelihood estimation, I have shown the “equivalence” of these three things in optimization. Cross entropy loss has been widely used in most of the state-of-the-art machine learning classification models, mainly because optimizing it is equivalent to maximum likelihood estimation. However, there could be other losses used for classification problems.\n  In this blog post, I would like to discussed the log loss used for logistic regression, the cross entropy loss used for multi-class classification, and the sum of log loss used for multi-class classification.\n  The prerequisites of this blog post have been discussed heavily in my other blog posts. For completeness, I made a copy of them here.\n   To check the quick proof of Leibniz integral rule, please check one my blog posts on  this.\n  Based on Leibniz integral rule, we could also move the positions of derivatives inside the expected value or outside the expected value. For instance,\n If $\\mathbb{E}_{(x,y) \\sim P(x,y)}\\big[ \\mathscr{L}_{\\theta}(x,y) \\big]$ is the loss function, to compute the derivative of the entire loss with respect to the parameter $\\theta$, it is equivalent to computing the derivatives of the losses contributed by each data point $\\mathscr{L}_{\\theta}(x, y)$ with respect to the parameter $\\theta$ and followed by computing its expected value, $\\mathbb{E}_{(x,y) \\sim P(x, y)}\\big[ \\frac{\\partial}{\\partial \\theta} \\mathscr{L}_{\\theta}(x, y) \\big]$. Assuming all the data $(x, y)$ are uniformly distributed, it is simply just computing the derivative of the losses contributed by each data point $\\mathscr{L}_{\\theta}(x, y)$ with respect to the parameter $\\theta$ and followed by taking their average. This is also how modern deep learning framework, such as TensorFlow and PyTorch, works.\n  Log loss has been used for logistic regression for a long time. Given $(x, y)$, where $x$ is the input, $y$ is the label for $x$, our goal is to develop a model $f_{\\theta}$, where $\\theta$ are the model parameters. such that $\\tilde{y} = f_{\\theta}(x)$ is as close to $y$ as possible. For logistic regression, usually $y = 0$ or $1$. $y = 1$ means $x$ belongs to certain class, whereas $y = 0$ means $x$ does not belong to certain class.\n  Usually, logistic regression will compute the logit $z$ for the input $x$, where $z = g_{\\theta}(x)$ followed by computing the sigmoid activation for $z$ to get the estimate of $y$, $\\tilde{y}$, in the range of $(0,1)$. Concretely,\n The loss function used for fitting is called log loss, which we would see later that it is actually binary cross entropy loss.\n We further compute the derivative of this log loss with respect to the logit $z$.\n  The interpretation is very simple. If $\\tilde{y} &gt; y$, $\\frac{\\partial}{\\partial z} \\mathscr{L}_{\\theta}(x,y) &gt; 0$, the gradient descent wants to make $z$ smaller. Once $z$ is smaller, $\\tilde{y}$ will be smaller and its deviation from $y$ will become smaller. Similarly, If $\\tilde{y} &lt; y$, $\\frac{\\partial}{\\partial z} \\mathscr{L}_{\\theta}(x,y) &lt; 0$, the gradient descent wants to make $z$ larger. Once $z$ is larger, $\\tilde{y}$ will be larger and its deviation from $y$ will become smaller.\n  To update the model parameters $\\theta$, we would need to compute the derivatives with respect to $\\theta$.\n  Cross entropy loss has been widely used for classification problems in deep learning. Given $(x, \\mathbf{y})$, where $x$ is the input, $\\mathbf{y}$ is the label for $x$. If $\\mathbf{y}$ is an one-hot vector of size $n$, and $\\mathbf{y}_i = 1$, our goal is to develop a model $f_{\\theta}$, where $\\theta$ are the model parameters, such that $\\tilde{\\mathbf{y}}_i = f_{\\theta}(x)$ is as close to $\\mathbf{y}_i$ as possible. Note that the motivation of using cross entropy loss behind is maximum likelihood estimation which might not be obvious to see. But I have discussed in my previous blog  post.\n  Usually, multi-class classification will compute the logits $\\mathbf{z}$ for the input $x$, where $\\mathbf{z} = g_{\\theta}(x)$ followed by computing the softmax activation for $\\mathbf{z}$ to get the estimate of $\\mathbf{y}$, $\\tilde{\\mathbf{y}}$, where $\\sum_{i=1}^{n} \\tilde{\\mathbf{y}}_i = 1$ and $\\tilde{\\mathbf{y}}_i \\in [0, 1]$ for $i \\in [1, n]$. Concretely,\n  We further compute the derivative of this cross entropy loss with respect to the logits $\\mathbf{z}$.\n  The interpretation is also very simple. If $\\tilde{\\mathbf{y}}_k &gt; \\mathbf{y}_k$, $\\frac{\\partial}{\\partial \\mathbf{z}_k} \\mathscr{L}_{\\theta}(x,\\mathbf{y}) &gt; 0$, the gradient descent wants to make $\\mathbf{z}_k$ smaller. Once $\\mathbf{z}_k$ is smaller, $\\tilde{\\mathbf{y}}_k$ will be smaller and its deviation from $\\mathbf{y}_k$ will become smaller. Similarly, If $\\tilde{\\mathbf{y}}_k &lt; \\mathbf{y}_k$, $\\frac{\\partial}{\\partial \\mathbf{z}_k} \\mathscr{L}_{\\theta}(x,\\mathbf{y}) &lt; 0$, the gradient descent wants to make $\\mathbf{z}_k$ larger. Once $\\mathbf{z}_k$ is larger, $\\tilde{\\mathbf{y}}_k$ will be larger and its deviation from $\\mathbf{y}_k$ will become smaller.\n  To update the model parameters $\\theta$, we would need to compute the derivatives with respect to $\\theta$.\n  If we have $n = 2$ for cross entropy loss and compare it with log loss, we would immediately see that the form of log loss is exactly the same to binary cross entropy loss, and log loss for logistic regression is a special case for cross entropy loss for multi-class classification where $n = 2$ and the logit $z$ for the negative class ($y = 0$) is a fixed value $0$.\n  So if we have a binary classification problem, what is the difference between modeling it using log loss for logistic regression and cross entropy loss for binary classification, assuming the learning rate and other hyperparameters are the same? We could see that the gradients with respect to the positive logit $z$ for both models are always the same. However, when it comes to updating the model parameters $\\theta$, the gradients for the two models would be different, because one model has only one logit whereas the other model has two logits. Therefore, although the two models are analogous, it is incorrect to say these two models are exactly the same.\n  One may ask which model is better for a binary classification problem. It is hard to say. But one thing that is for sure is that the binary cross entropy model is relatively easy to overfit. The reasons are the followings:\n The binary cross entropy model would try to adjust the positive and negative logits simultaneously whereas the logistic regression would only adjust one logit and the other hidden logit is always $0$, resulting the difference between two logits larger in the binary cross entropy model much larger than that in the logistic regression model.\n To prevent overfitting, we could use  label smoothing for cross entropy loss. I have discussed it previously and I am not going to elaborate it here.\n  While it might be rare, we could treat a multi-class classification problem as multiple one-vs-all classifications, each of which is a logistic regression. Given $(x, \\mathbf{y})$, where $x$ is the input, $\\mathbf{y}$ is the label for $x$. Our goal is to develop a model $f_{\\theta}$, where $\\theta$ are the model parameters, such that $\\tilde{\\mathbf{y}}_j = f_{\\theta}(x)$ is as close to $\\mathbf{y}_j$ as possible, for all $j \\in [1, n]$. Note that this is different from cross entropy loss for multi-class classification.\n  Usually, multi-class classification will compute the logits $\\mathbf{z}$ for the input $x$, where $\\mathbf{z} = g_{\\theta}(x)$ followed by computing the sigmoid activation for each logit of $\\mathbf{z}$ to get the estimate of $\\mathbf{y}$, $\\tilde{\\mathbf{y}}$, where notably $\\sum_{i=1}^{n} \\tilde{\\mathbf{y}}_i$ and $\\sum_{i=1}^{n} \\mathbf{y}_i$ do not have to equal to 1, and $\\tilde{\\mathbf{y}}_i \\in [0, 1]$ for $i \\in [1, n]$. Concretely,\n The loss function used for fitting is called the sum of log loss. The classification of each class could be seen as mutually exclusive. TensorFlow has an implementation for this loss, which they call it  tf.nn.sigmoid_cross_entropy_with_logits, as well.\n We further compute the derivative of this sum of log loss with respect to the logits $\\mathbf{z}$. Because it is almost exactly the same to the derivative of log loss with respect to the logits $z$, we skipped some details.\n  The interpretation is the same as cross entropy loss for multi-class classification. If $\\tilde{\\mathbf{y}}_k &gt; \\mathbf{y}_k$, $\\frac{\\partial}{\\partial \\mathbf{z}_k} \\mathscr{L}_{\\theta}(x,\\mathbf{y}) &gt; 0$, the gradient descent wants to make $\\mathbf{z}_k$ smaller. Once $\\mathbf{z}_k$ is smaller, $\\tilde{\\mathbf{y}}_k$ will be smaller and its deviation from $\\mathbf{y}_k$ will become smaller. Similarly, If $\\tilde{\\mathbf{y}}_k &lt; \\mathbf{y}_k$, $\\frac{\\partial}{\\partial \\mathbf{z}_k} \\mathscr{L}_{\\theta}(x,\\mathbf{y}) &lt; 0$, the gradient descent wants to make $\\mathbf{z}_k$ larger. Once $\\mathbf{z}_k$ is larger, $\\tilde{\\mathbf{y}}_k$ will be larger and its deviation from $\\mathbf{y}_k$ will become smaller.\n  To update the model parameters $\\theta$, we would need to compute the derivatives with respect to $\\theta$.\n The formula is exactly the same as the one used for cross entropy loss for multi-class classification.\n  Because we have seen that the gradient formula of cross entropy loss and sum of log loss are exactly the same, we wonder if there is any difference between the two.\n  The answer is there is difference between the two, even if both models are doing multi-class classifications that there is only one label for one input. The clues lie in the values of $\\tilde{\\mathbf{y}}$.\n  Assuming $\\mathbf{y}$ is an one-hot encoded vector, so $\\sum_{i=1}^{n} \\mathbf{y}_i = 1$. In cross entropy loss, $\\sum_{i=1}^{n} \\tilde{\\mathbf{y}}_i = 1$, whereas in sum of log loss, $\\sum_{i=1}^{n} \\tilde{\\mathbf{y}}_i \\neq 1$.\n  We further assume $\\mathbf{z}$ is the same for both models. When $\\mathbf{z}_i &gt; \\log{\\frac{1}{n-1}}$ for $i \\in [1, n]$, it is easy to see that the $\\tilde{\\mathbf{y}}_i$ in the cross entropy loss model is smaller than the $\\tilde{\\mathbf{y}}_i$ in the sum of log loss model, for $i \\in [1, n]$.\n  This means the gradient update gets more incentives from the sum of log loss model than the cross entropy loss model. What does it further mean? When the input has only one label as we already assumed that $\\mathbf{y}$ is an one-hot encoded vector, assuming $n$ is large, the sum of log loss model got more incentives from the negative classes than the cross entropy loss model, which will weaken the learning of positive class.\n  Therefore, if all the assumptions above are true, we should use cross entropy loss for learning a single-label multi-class classification, instead of using sum of log loss.\n  What if there are multiple labels for the multi-class classification. In the sum of log loss model, we could prepare labels $\\mathbf{y}_i = 1$, where $i$ belongs to the label classes. In the cross entropy loss model, due to the limitation of cross entropy model, an intuitive approach is to, assuming there are $k$ labels for one input, make the labels $\\mathbf{y}_i = \\frac{1}{k}$, where $i$ belongs to the label classes, and $\\sum_{i=1}^{n}\\mathbf{y}_i = 1$ is not changed.\n  This time, the cross entropy loss is inferior compared to the sum of log loss model, because the model will not learn predicting confidently, especially when the number of labels $k$ is large. This is mainly restricted by the softmax activation function. In the sum of log loss model, the incentives of learn a positive class does not change as if it is still learning a single-label classification problem.\n  OK, how about this. Given an input that has $k$ labels, instead of using one data point, we prepare $k$ data points whose inputs are exactly the same and the labels are one-hot labels representing each of the $k$ labels. It is actually equivalent to have one data point whose labels $\\mathbf{y}_i = \\frac{1}{k}$, where $i$ belongs to the label classes. I would leave it the user to find it out why this is the case. The hint is to use the expected value of the derivatives.\n  Therefore, we should use sum of log loss for learning a multi-label multi-class classification, instead of using cross entropy loss.", "posttime": "2020-07-19 10:26:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "损失,loss,mathbf", "title": "交叉熵损失VS原木损失VS原木损失总和", "title_en": "Cross Entropy Loss vs Log Loss vs Sum of Log Loss", "transed": 1, "url": "https://leimao.github.io/blog/Conventional-Classification-Loss-Functions/", "via": "", "real_tags": ["损失", "loss", "mathbf"]}, {"category": "", "categoryclass": "", "imagename": "f26326c01bdd6e84d42ce1c5220bad84.jpeg", "infoid": 1012814, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2014年初，通用电气(General Electric Co.)康涅狄格州总部的高影响力创新团队(High-Impact Innovation Team)接到一个紧急电话：是时候向杰夫·伊梅尔特展示他们的一款应用了。这位首席执行官对科技的兴趣与日俱增，他承诺通用电气将帮助全球建设一个“工业互联网”。\nHIIT团队的工作是开发公司内部使用的应用程序，例如连接照明工程师和照明销售队伍的iPad应用程序，以及用于员工绩效评估的基于Web的应用程序……", "note_en": "In early 2014, the High-Impact Innovation Team in General Electric Co.’s Connecticut headquarters received an urgent call: It was time to present one of their apps to Jeff Immelt. The chief executive had an expanding interest in tech, having promised an “industrial internet” that GE would help build for the world.\n  It was the job of the HIIT team to develop apps for use within the company—such as an iPad app to connect lighting engineers with the lighting sales force, and a web-based application for employee performance reviews....", "posttime": "2020-07-19 10:26:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大胆,ge,应用程序", "title": "通用电气大胆的数字梦想破灭", "title_en": "The Dimming of GE’s Bold Digital Dreams", "transed": 1, "url": "https://www.wsj.com/articles/the-dimming-of-ges-bold-digital-dreams-11595044802", "via": "", "real_tags": ["大胆", "ge", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "ec4bd4ab7a1b6037e0ac3d952d1fc989.jpg", "infoid": 1012809, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一条人命值多少钱？联邦机构必须一直回答这个问题--是决定在危险材料上贴上安全标签，还是在大流行后重新开放经济变得值得。这是一个很难回答的问题，但他们确实有自己使用的号码。他们说，一条人命价值约1000万美元。这就是他们是如何得到这个数字的故事。\n由于这个故事发生在20世纪80年代，我们以80年代电影的风格拍摄了它！\n点击这里收听原版“金钱星球”播客！点击这里订阅我们的系列视频--当你还在看的时候，订阅我们的播客吧。", "note_en": "How much is a human life worth? Federal agencies have to answer this question all the time — whether it&#39;s to decide on adding safety labels to hazardous materials or when it becomes worth it to reopen the economy after a pandemic. It&#39;s a tough question to answer, but they do have a number they use. They say a human life is worth about $10 million. This is the story of how they got that number.\n  And since this story took place in the 1980s, we filmed it in the style of an &#39;80s movie!\n  Listen to the original Planet Money  podcast episode  here!  Subscribe to our video series  here  — and while you&#39;re at it,  subscribe to our podcast.", "posttime": "2020-07-19 09:20:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据,life,人命", "title": "根据政府的数据，你的人寿价值1000万美元", "title_en": "Your Life Is Worth $10M, According to the Government", "transed": 1, "url": "https://www.npr.org/sections/money/2020/07/17/870483369/your-life-is-worth-10-million-according-to-the-government", "via": "", "real_tags": ["数据", "life", "人命"]}]