[{"category": "", "categoryclass": "", "imagename": "7c286b222d2288b4a1ff60a9b92d468c.jpg", "infoid": 1001246, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我还是个孩子的时候(1989年)，我很荣幸地收到了一台二手辛克莱ZX-81，它启发了我上面的画。它是首批8位家用计算机之一。它没有应用商店。它与一台黑白电视相连。当我拿到它的时候，它已经过时了，但那无关紧要。软件以声波的形式记录在盒式录音机上。有一本书解释了如何用BASIC编程这个设备，它也有ZX-81的电路图。对我来说，熟悉这台机器并让移动的符号出现在屏幕上是一件神奇的事情。这让我在90年代与电脑(特别是Amiga)建立了真正亲密的关系。计算机是一种工具，可以单独或与朋友一起将文本、图形、音频和程序塑造成形状。\n当微软Windows和后来的MacOSX开始占据主导地位时，这种情况发生了变化。随着Office和Web的出现，计算机成为知识工作和媒体消费的设备。除了与IBM兼容的模块化PC外，它们变得越来越专有，越来越受到限制。在一台现代电脑上，你绝对仍然可以有创造力。但是你会很难找到一台感觉像是你自己的、你真正理解的电脑。尤其是对于手机、平板电脑和笔记本电脑，主要参与者希望控制您数字体验的方方面面，直到您使用的大多数代码将在保留您个人数据的专有云中运行。驱动你的设备的芯片和驱动程序都是商业机密。\n大约三年前，我与工业设计师安娜·丹塔斯(Ana Dantas)合作设计了一款开放式硬件笔记本电脑。我们受到了加法制造、小规模PCB生产和早期开放硬件运动的可能性的启发，以及越来越多的人意识到，我们目前生产快速淘汰硬件的过程不能持续下去。我们想出了一个计划，带回一台比现状更能让你理解和信任的电脑。我们围绕i.MX6处理器制作了这款笔记本电脑的原型-MNT改革(类似于Bunnie和Xobs之前对Novena所做的事情)。时装设计师格里塔·梅尔尼克(Greta Melnik)和我们一起在家里组装了13台Beta笔记本电脑，其中大部分卖给了早期的支持者(谢谢！)。Greta现在全职为MNT Research工作，确保我们运送的每一件东西都有高水平的质量。\n2018年底，我很幸运地能够出售我参与的一家网络技术公司的股票。我用这笔钱购买了一些制造设备，并在柏林弗里德瑙现已拆除的诺克铸造厂的剩余部分租了一个真正的工作空间。凭借我们早期测试版测试人员的反馈，以及CCC和许多其他活动的无数讨论，我们在过去一年半的时间里自筹资金，致力于新的MNT改革。\n今天，我们将发起众筹，推出一款笔记本电脑，它没有粘合电池，没有焊接存储，也没有安全芯片，这些都会阻止你行使维修权。MNT改革是一个大胆的设计，它是我们所能做到的最开放和可修复的。它厚实结实(黑色阳极处理，磨铝)，有一个机械键盘和一个光学跟踪球(如果你愿意，也可以是一个多点触摸板)。虽然CPU+RAM模块最初是现成的部件(边界设备公司的Nitrogen8M)，但系统中的所有电路板都是由我们定制设计和开源的，包括轨迹球的SLA可打印机械部件。\n系统控制器、输入设备固件和所有驱动程序，包括3D图形(由etNaviv提供支持)也都是开源的。改革的初始CPU恩智浦i.MX8M在引导时使用专有(非ARM)例程来校准LPDDR4内存，您必须容忍类似的代码才能使用可选的HDMI输出。但是i.MX8M是我们能找到的最开放、记录最好的芯片，而且它没有焊接进去。\n如果一个更开放的版本出现(想想RISC-V)，任何人都可以制作一个针对改革格式的升级模块。CPU+RAM模块使用带有开放引脚的标准200针SO-DIMM连接器，因此我们或任何第三方都可以制造具有不同特性的更换模块。\n我们站在无数人的肩膀上，他们创建了自由软件生态系统，允许我们从第一天起就在改革上发布许多高质量的应用程序和游戏，包括LibreOffice、Inkscape 1.0、Blender 2.79、Aredour 5、Emacs和Vim或Firefox。我们通过数月的日常工作测试，确保您可以使用NVMe固态硬盘、mPCIe Wi-Fi卡和USB3.0外围设备。\n默认情况下，这台计算机附带Debian GNU/Linux(Bullseye)操作系统，我们正在与Genode实验室合作，为改革提供Genode。我们也希望看到所有的BSD和其他免费的、可替代的操作系统。我们是一家小公司，所以我们需要你的帮助。\nMNT改革不仅仅是开放。其高度模块化的方法旨在使其更具可持续性。希望你永远不需要扔掉一个。取而代之的是，您将能够对其进行10年以上的维护和升级。我们邀请每个人提供兼容的和可选的部件，我们发布我们的设计文件，并提供支持以使这一点变得容易。\nMNT改革DIY：我们极力要求将其控制在1000美元以下。这是一个套件，所有的电路板和机箱部件，你可以用它来建造你自己的笔记本电脑，宜家风格。不需要焊接。\nMNT REGATION MAX：满载版，配备1 TB NVMe固态硬盘和Atheros ath9k兼容Wi-Fi卡。在顶部，您将得到我们定制的黑色Piñatex素食皮袖和一本签名的手册。\nMNT改革主板：适用于为改革平台开发软件或围绕改革构建自己的硬件和/或机箱。\n我们只能梦想你会想出什么创造性的用途和修改。", "note_en": "When I was a kid (in ~1989), I was privileged to receive a second-hand Sinclair ZX-81 that inspired my drawing above. It was one of the first 8-bit home computers. It didn’t have an App Store. It connected to a black-and-white TV. It was already outdated when I got it, but that didn’t matter. Software was recorded as sound waves on a cassette recorder. There was a book that explained how to program this device in BASIC, and it had circuit diagrams of the ZX-81, too. It was magical for me to become familiar with this machine and make moving symbols appear on screen. This led to a really intimate relationship with computers (especially the Amiga) for me in the 90s. The computer was a tool to mold text, graphics, audio, programs into shape, alone or with friends.\n This changed when Microsoft Windows, and later Mac OS X, started to dominate. With Office and the Web, computers became devices for knowledge work and media consumption. With the exception of the modular IBM-compatible PC, they became more and more proprietary and locked down. You absolutely still can be creative on a modern computer. But you will have trouble finding a computer that feels like it’s really yours, that you really understand. Especially with phones, tablets, and laptops, the major players want to dictate every aspect of your digital experience, up until the point where most code that you use will run in proprietary clouds that keep your personal data. The chips and the drivers powering your devices are trade secrets.\n Almost three years ago, I teamed up with industrial designer Ana Dantas to design an open hardware laptop. We were inspired by the possibilites of additive manufacturing, small-scale PCB production, and the early open hardware movement, as well as the growing realization that our current course of producing quickly obsoleted hardware cannot be sustained. We came up with the plan to bring back a computer that you can understand and trust a lot more than the status quo. We made a prototype of this laptop — MNT Reform — around the i.MX6 processor (similar to what bunnie and xobs had done with the Novena before). Fashion designer Greta Melnik joined us in assembling 13 beta laptops at home, most of which we sold to early supporters (thank you!). Greta is now working full-time for MNT Research, making sure that everything that we ship has a high level of quality.\n   In the end of 2018, I was in the lucky position to be able to sell off shares of a web technology company I had been involved in. I took this money to buy some manufacturing equipment and rent a real working space in the remaining part of the now-demolished Noack foundry in Berlin Friedenau. Armed with feedback from our early beta testers and countless discussions at CCC and many other events, we worked the last one and a half years, self funded, on the new MNT Reform.\n   Today, we’re launching the crowdfunding of a laptop that doesn’t have glued-in batteries, soldered-in storage or &#34;security&#34; chips that prevent you from exercising your right to repair. MNT Reform is a daring design that is as open and repairable as we could make it. It’s chunky, robust (black anodized, milled aluminum), has a mechanical keyboard and an optical trackball (or a multitouch trackpad if you want). While the CPU+RAM module is initially an off-the-shelf part (Boundary Devices Nitrogen8M), all circuit boards in the system are custom designed and open-sourced by us, including the SLA-printable mechanical parts of the trackball.\n  The system controller, input device firmware and all drivers, including 3D graphics (powered by etnaviv) are open source, too. The initial CPU of Reform, NXP i.MX8M, uses a proprietary (non-ARM) routine to calibrate the LPDDR4 memory at boot, and you have to tolerate a similar piece of code to use the optional HDMI output. But i.MX8M is the most open and best documented chip we could find for Reform, and it is not soldered in.\n Should an even more open one appear (think RISC-V), anyone can make an upgrade module for the Reform format. The CPU+RAM module uses a standard 200-pin SO-DIMM connector with an open pinout, so we or any third party can make replacement modules that give Reform different characteristics.\n We’re standing on the shoulders of the countless people who have created the free software ecosystem that allows us to ship many high-quality applications and games on Reform from day one, including Libreoffice, Inkscape 1.0, Blender 2.79, Ardour 5, Emacs, and Vim, or Firefox. We’ve made sure you can use NVMe SSDs, mPCIe Wi-Fi cards, and USB3.0 peripherals — by months of testing them for daily work.\n This computer ships with the Debian GNU/Linux (Bullseye) operating system by default, and we’re collaborating with Genode Labs to ship Genode for Reform. We would like to see all the BSDs and other free and alternative operating systems on it, too. We’re a tiny company, so we’ll need your help with that.\n  MNT Reform is not only about being open. Its highly modular approach is meant to make it more sustainable. Hopefully you’ll never need to throw one away. Instead, you’ll be able to maintain and upgrade it for more than 10 years. We invite everyone to offer compatible and alternative parts, and we publish our design files and offer support to make this easy.\n  MNT Reform DIY: which we pressed hard to keep under $1000. This is a kit of all boards and case parts that you can build your own laptop from, IKEA-style. No soldering required.\n  MNT Reform Max: the fully-loaded version with 1 TB NVMe SSD and Atheros ath9k compatible Wi-Fi card. On top, you&#39;ll get our custom black Piñatex vegan leather sleeve and a signed copy of the handbook.\n MNT Reform Motherboard: for if you want to develop software for the Reform platform or if you want to build your own hardware and/or enclosure around the Reform.\n     We can only dream about what creative uses and modifications you will come up with.", "posttime": "2020-05-08 19:59:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "mnt,reform,设备", "title": "MNT改革：这场运动是现场直播的", "title_en": "MNT Reform: The Campaign Is Live", "transed": 1, "url": "https://www.crowdsupply.com/mnt/reform/updates/the-campaign-is-live", "via": "", "real_tags": ["mnt", "reform", "设备"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001245, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "孩子，当你的“我要离开这里”的文章在网上疯传的时候，你有没有得到很多意见。一些回复经常出现，值得分享。这是通过电子邮件、Twitter DM、博客评论和LinkedIn消息实现的。所有的一切都变得一团糟。\n谢谢你的好话！·我不知道世界会对一个脾气暴躁、薪水过高的极客在公共场合发脾气作何反应。世界变得令人惊讶地温暖和友好。显然我按了一个我不知道存在的热键。地球上最古怪的极客不可能不让他们的心暖和起来。因此，在许多情况下，简单地说“谢谢你的善意的话”是正确的。\n亲爱的读者：是的，这篇文章中描述的一些答案保存在编辑器缓冲区中，并通过剪切和粘贴的方式提供。但我确实读了很多信息，以及我实际回复的所有信息。\n“你能来我们的电视节目吗？”·你可以说出它的名字：ABC、BBC、彭博、CBC、CBS、CTV、CNBC、CNN、NBC、NPR，以及一大堆很酷的博客和印度。还有安德森·库珀的人！\n“我们能通个电话吗，这样我就可以问你几个问题了？”·这个主题的变体，来自非广播组织。\n他们得到的答案都是一样的：“嗯，我没那么有趣，只是个脾气暴躁的老白种人工程师，在社交媒体上占有一席之地。如果你想要报道这个故事，你应该与被解雇的真实人群一起生活，他们年轻、面容鲜艳、充满激情，而且真的是新闻故事的中心人物。我建议联系艾米丽·坎宁安(联系人信息经过编辑)或马伦·科斯塔(同样的)或克里斯·斯莫尔斯(同样的)。\n“好的，我们和他们谈过了。现在你愿意和我们现场对话吗？“·这些人很好，只是想做好他们的工作。我同意在几个案例中回答几个电子邮件问题，但大多数时候只是说，“由于复杂的原因，我不想成为这个故事的公众代言人。对不起。“。\n“复杂的原因？”·是的，这是关于解雇举报人的故事，而不是关于一位随机的加拿大杰出工程师对此的反应。因此，新闻机构应该遵循主要消息来源，而不是我。\n还有更多。我在我应该说的话上花了很多心思，然后真的花了大量的工作来写那篇博客文章。我在风格和事实核查方面得到了帮助。(谢谢，劳伦。谢谢你，艾米丽。)。我在电话或电视采访中即兴创作的任何东西都不太可能会更好。我对盖尔曼健忘症效应也有过苦涩的亲身体验。\n我想它起作用了。新闻报道缺乏其他选择，大量引用了博客中的内容，我认为基本上所有的报道都是公平和准确的。让我们承认，这种策略只适用于那些接近新闻故事中心、是一个有能力的作家，并且有一个好的发表地点的人。\n我没有兴趣成为某种全职的反亚马逊积极分子。我只是不想为解雇举报人的组织工作。我是这么说的。看起来这条信息已经传达出去了。\n“你期望得到什么样的回应？”·我有17年的博客生涯，所以我根据经验说：不知道。我有一些博客，我认为这些博客非常重要，几天来一直在苦苦钻研，就像石头一样沉了下去，没有任何踪迹。然后，我会扔掉我在看电视和喝杜松子酒时写的三段哑剧，它就会变得白热化。这两个结果都不会让我感到惊讶。\n“你想实现什么？”·我是个博客写手。十七年来，我一直在写我在这里生活的故事。有足够多的人阅读它，并做出回应，这让我希望它至少是间歇性的有趣的，甚至可能是有用的。我是个作家，我不能不写作。这是我人生中的一个重大转折点。我完全不能不写。就这样。这就是为什么。\n“布拉德的文章怎么样？”·他们问的是人们对布拉德·波特(Brad Porter)离开蒂姆·布雷(Tim Bray)的反应。因为他有和我一样的“副总裁/杰出工程师”头衔，你会认为他是同龄人。实际上，他比我过去更重要、更有影响力，部分原因是他从早期就在那里，直接参与零售运营。\n我相信(正如布拉德所说)亚马逊零售业正在紧张而明智地努力使仓库变得更安全。但我也相信工人们。不管怎么说，解雇告密者是非常非常不受限制的。\n虽然这在某种程度上是对真正问题(解雇举报人)的杂耍，但布拉德也写道：\n不过，蒂姆·布雷(Tim Bray)说的“亚马逊将仓库中的人类视为可替代的拣选和打包单元”的说法最终是完全错误的。我发现这深深地冒犯了核心。\n我们必须同意不同意见。如果您管理的组织有数十万名生产线工人和数万名经理，并且人员流失率通常很高，那么您需要员工可替换的流程。有两件事可以同时成为事实：你努力工作以保护员工的健康，而你的管理文化将他们视为可替代的单位。\n事实上，我发现对布拉德文章的回复中出现的模式比他最初的帖子更具文化趣味性。\n嘿，奖金：在对话中还有另一个亚马逊的声音：安东·奥克米安斯基，他是一名“首席工程师”，也就是说被认为是一名世界级的技术专家，蒂姆·布雷写道，他离开了亚马逊。我的想法..。它包含了一句引人注目的话：“亚马逊应该成为社会正义问题上的领导者，从而在愤怒驱动的监管执法中保持领先地位。”\n如果再有几个亚马逊人的声音参与进来，那就太好了。但我不会屏息以待。\n“有遗憾吗？”·是的，我非常后悔没有链接到艾米丽·坎宁安(Emily Cunningham)原创的“亚马逊解雇我”推文，这条推文非常精美(你必须点击“显示这个帖子”)。\n最喜欢的回答？·注意，标题不要用引号引起来，因为没有人问，但无论如何我都会回答的。我可以抛出十几个媒体重量级人物的预兆，是的，每个人都很好地发表了意见。但这并不接近，我最喜欢的是Wonkette：亚马逊副总裁蒂姆·布雷·奎特菲尔斯(Tim Bray Quitfire Self Over&#39；Chickensh*t&t&#39；Active Quitfirings)。上面写着，你那卑微的抄写员，“革命来了，让我们记住不要吃这个”和“今日班级叛徒”。这些都寄托在我认为是完全清醒和精力充沛的情况下。", "note_en": "Boy, when your  I’m-outta-here essay goes viral, do you ever get a lot of input. A few responses came up often enough to be worth sharing. This was via email, Twitter DMs, blog comments, and LinkedIn messages. All of which went completely batshit.\n  Thanks for the kind words! · I had no notion how the world might react to a cranky old overpaid geek’s public temper tantrum. The world’s been astonishingly warm and welcoming. Apparently I hit a hot button I didn’t know existed. The crankiest geek on the planet couldn’t fail to have their heart warmed. So in a huge number of cases, simply “Thanks for the kind words” was the right thing to say.\n Dear readers: Yes, some of the answers described in this piece were kept handy in editor buffers and delivered by cut-and-paste. But I did read a lot of the messages, and all the ones I actually responded to.\n “Can you come on our TV show?” · You name it: ABC, BBC, Bloomberg, CBC, CBS, CTV, CNBC, CNN, NBC, NPR, and a whole lot of cool blogs and indies. Also Anderson Cooper’s people!\n “Can we get on the phone so I can ask you some questions?” · A variation on the theme, from non-broadcast organizations.\n They all got the same answer: “Hmm, I&#39;m not that interesting, just a grumpy old one-percenter white-guy engineer with a social media presence. If you want to go live with this story you should do it with the actual people who got fired, who are young, fresh-faced, passionate, and really at the center of the news story. I recommend reaching out to Emily Cunningham (contact info redacted) or Maren Costa (same) or Chris Smalls (same).”\n “OK, we talked to them. Now will you talk to us live?” · These people were nice and just trying to do their job. I agreed to answer a couple of email questions in a couple of cases, but mostly just said “For complicated reasons, I don’t want to be the public face of this story. Sorry.”\n “Complicated reasons?” · Yeah, the story is about firing whistleblowers, not about a random Canadian Distinguished Engineer’s reaction to it. So news organizations should follow the primary sources, not me.\n There’s more. I put a lot of thought into what I should say, and then really a whole lot of work into writing that blog piece. I had help with style and fact-checking. (Thanks, Lauren. Thanks, Emily.) It is very, very, unlikely that anything I’d improvise on a phone-call or TV interview would be better. I’ve also had bitter first-hand experience with the  Gell-Mann amnesia effect.\n I think it worked. The news coverage, lacking alternatives, quoted heavily from the blog, and I thought basically all of it came out fair and accurate. Let’s acknowledge that this tactic is only available to someone who’s near the center of a news story, is a competent writer, and has a good place to publish.\n I’ve no interest in becoming some sort of full-time anti-Amazon activist. I just don’t want to work for an organization that fires whistleblowers. I said so. It looks like the message got through.\n “What response did you expect?” · I have seventeen years of blogging scars, so I speak from experience in saying: No idea. I’ve had blogs that I considered mightily important and labored over for days sink like a stone with no trace. Then I’ll toss off some three-paragraph squib that I wrote while watching TV and drinking gin, and it goes white-hot. Neither outcome would have surprised me.\n “What were you trying to accomplish?” · I’m a blogger. I’ve been writing the story of my life here for seventeen years. Enough people read it and respond to give me hope that it’s at least intermittently interesting, and perhaps even useful. I’m a writer, I can’t not write. This is a major turning point in my life. I totally couldn’t not write it. That’s all. That’s  really, really why.\n “What about Brad’s piece?” · They’re asking about  Response to Tim Bray’s departure by  Brad Porter. Since he has the same “VP/Distinguished Engineer” title I did you’d think he’d be a peer. Actually he’s way more important and influential than I used to be, partly because he’s been there since the early days and is directly involved with the retail operation.\n I believe that (as Brad says) Amazon retail is working intensely and intelligently to make the warehouses safer. But I also believe the workers. And anyhow, firing whistleblowers is just way, way out of bounds.\n While it’s sort of a sideshow to the real issue here (firing whistleblowers), Brad also wrote:\n Ultimately though, Tim Bray is simply wrong when he says “It’s that Amazon treats the humans in the warehouses as fungible units of pick-and-pack potential.” I find that deeply offensive to the core.\n We’ll have to agree to disagree. If you run an organization with hundreds of thousands of line workers and tens of thousands of managers, and where turnover is typically significant, you need processes where the staff are fungible. Two things can be true at once: You work hard to preserve your employees’ health, and your administrative culture treats them as fungible units.\n I actually found the patterns emerging in the responses to Brad’s piece more culturally interesting than his original post.\n And hey, bonus: There’s another Amazon voice in the conversation:  Anton Okmyanskiy, who’s a “Principal Engineer”, which is to say regarded as a world-class technologist, wrote  Tim Bray quit Amazon. My thoughts.... It contains the remarkable sentence “Amazon should stay ahead of anger-driven regulatory enforcement by becoming a leader on social justice issues.”\n It’d be great if a few more Amazonian voices weighed in. But I’m not holding my breath.\n “Any regrets?” · Yes, I regret intensely that I didn’t link to Emily Cunningham’s original  “Amazon fired me” tweet thread, which is exquisite (you have to click “show this thread”).\n Favorite response? · Note, header not in quotes because nobody asked, but I’ll answer anyhow. I could drop a dozen portentous media-heavyweight names and yeah, pretty well everyone weighed in. But it’s not close, my fave was Wonkette:  Amazon VP VIP Tim Bray Quitfires Self Over &#39;Chickensh*t&#39; Activist Quitfirings. It says, of yr humble scrivener, “Come the revolution, let&#39;s remember not to eat this one” and “Class Traitor of the Day”. These lodged in what I thought was a thoroughly lucid and spirited take on the situation.", "posttime": "2020-05-08 19:59:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "亚马逊,amazon,再见,bye,博客", "title": "论对“再见，亚马逊”的回应", "title_en": "On responses to “Bye, Amazon”", "transed": 1, "url": "https://www.tbray.org/ongoing/When/202x/2020/05/06/Answers", "via": "", "real_tags": ["亚马逊", "amazon", "再见", "bye", "博客"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001244, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Web应用程序的架构在很大程度上受到框架开发人员所做的设计决策的影响，无论是隐式的还是显式的。有时，人们会有意识地接受这些决策，认为它们符合预期的整体系统架构。不过，更多情况下，它们之所以被接受，仅仅是因为开发人员认为它们体现了开发实践的最新水平。\nROCA试图定义一组独立于任何特定框架、编程语言或工具的建议，这些建议体现了我们所认为的好的Web应用程序架构的原则。它的目的是作为参考，可以按原样实现，也可以与其他方法进行比较，以突出不同的设计决策。\nROCA分为两部分：服务器端和客户端架构。服务器端由REST风格的后端组成，提供人类可读的内容以及用于机器到机器通信的服务，无论是公共的还是内部的。客户端侧重于基于渐进式增强原则的JavaScript和CSS的可持续且可维护的使用。几乎每一种基本的网络技术，例如HTML或HTTP，都在追求这种技术。客户端和服务器在很大程度上相互独立，但又相辅相成。服务器应用程序遵循REST原则，即它公开一组对坐在浏览器前面的用户有意义的资源，每个资源都有自己的URI，处理请求所需的所有信息都包含在请求本身中，HTTP方法按照其定义使用，资源状态由服务器维护(无状态通信)。休息。\n用户必须能够链接到特定的信息，例如，通过从浏览器的地址栏复制地址并将其粘贴到电子邮件中、创建书签或使用任何更时髦的方式共享URI。链环。\n必须能够通过浏览器以外的用户代理(例如命令行客户端，如cURL或wget)使用服务器的逻辑。非浏览器。\n所有经过身份验证的通信都依赖于HTTP基本身份验证或摘要身份验证，通常与SSL结合使用，也可能与客户端证书结合使用。或者，由于浏览器本地身份验证的限制(例如，不注销、不设置样式)，可以将基于表单的身份验证与cookie结合使用。如果使用Cookie，它们应该包括服务器处理它们所需的所有状态，并且应该支持另一种身份验证机制用于非浏览器访问。身份验证。\nCookie不得用于身份验证、用户跟踪或安全目的(如CSRF保护)以外的其他目的。曲奇饼。\n除了对身份验证信息进行简单算法验证所需的状态之外，可能没有任何会话状态。会话\n浏览器控件(如“后退”、“前进”和“刷新”按钮)必须按预期工作。即，后退按钮应该将用户带到他们期望被带到的地方(他们使用的最后一个有意义的资源)。浏览器刷新不应该导致重新呈现登录或主页，而不是用户正在查看的页面，或者(对用户而言)希望再次提交相同数据的意外问题(当用户不记得提交任何数据时，表明错误使用了POST动词)。浏览器控件。\n服务器返回与布局信息和客户端行为无关的结构化语义HTML标记。华贵。\n它必须能够访问每个页面的信息和功能通过使用辅助工具，如屏幕阅读器。无障碍。\nCSS用于格式化和布局。这遵循渐进增强的原则，例如，允许不具备CSS3特征的浏览器仍然使用基于CSS3的站点。惯用语-CSS。\n按照渐进式增强的原则，如果禁用JavaScript，则JavaScript的使用不会引起注意，应用程序仍可用(尽管可用性和便利性会降低)。不引人注目-javascript。\n相同的功能不能在客户端(JavaScript)和服务器上冗余实现。因此，由于应用程序逻辑要求，应用程序逻辑不能驻留在客户端。无重复。\n服务器代码可能不知道客户端代码生成的HTML结构(超越CSS)，反之亦然。例外情况是服务器为初始化上述客户端功能而生成的一些定义良好的HTML结构。知识结构。\n所有JavaScript代码和CSS代码都必须是静态的，并且不能由服务器以特定于请求的资源的形式动态生成。(请注意，这并不禁止使用CoffeeScript或更低的预处理器，因为相应的代码通常是作为发布过程的一部分预编译的。)。静态资产\n客户端上由JavaScript触发的任何动态路由或URI状态修改都应该使用HTML5 History API。历史雅皮人", "note_en": "A Web application&#39;s architecture is heavily influenced by the\tdesign decisions, both implicit and explicit, that have been\tmade by framework developers. Sometimes these decisions are\tconsciously accepted as being in line with the intended overall\tsystem architecture. More often, though, they are accepted\tsimply because developers assume they embody the state of the\tart of development practices.\n ROCA is an attempt to define a set of recommendations —\tindependent of any particular framework, programming language,\tor tooling — that embodies the principles of what we consider to\tbe good web application architecture. Its purpose is to serve as\ta reference, one that can be implemented as-is or be compared to\tother approaches to highlight diverging design\tdecisions.\n ROCA splits into two parts: The  server-side and the  client-side architecture. The server-side consists of RESTful backends, serving human-readable content as well as services for machine-to-machine communication, either public or internal. The client-side focuses on a sustainable and maintainable usage of JavaScript and CSS, based on the principle of Progressive Enhancement. This technique is pursued by nearly every basic web technology, e.g. HTML or HTTP. Client and server are largely independent from, yet complement each other.  The server application adheres to\t\tREST principles, i.e. it exposes a set of\t\tresources that are meaningful to a user sitting in\t\tfront of a browser, each resource has its own URI, all\t\tof the information necessary for handling a request is\t\tcontained within the request itself, HTTP methods are used\t\tin line with their definition, and the resource state\t\tis maintained by the server (stateless\t\tcommunication).  rest\n      A user must be able to link to a specific\t\tpiece of information, e.g. by copying the address from the\t\tbrowser&#39;s address bar and pasting it into an e-mail,\t\tcreating a bookmark, or using any of the fancier ways to\t\tshare URIs.  link\n  It must be possible to use\t\tthe server&#39;s logic through user agents other than a browser,\t\te.g. a command-line client such as curl or\t\twget.  non-browser\n    All authenticated communication relies on HTTP\t\tBasic or Digest Authentication, typically combined\t\twith SSL, possibly with client\t\tcertificates. Alternatively, because of the limits of\t\tbrowser-native authentication (e.g. no logout, no\t\tstyling), form-based authentication in conjunction\t\twith cookies can be used. If cookies are used, they\t\tshould include all of the state needed for the server\t\tto process them, and another authentication mechanism\t\tshould be supported for non-browser\t\taccess.  auth\n  Cookies may not be used for purposes other than\t\tauthentication, user tracking or security purposes like CSRF protection.  cookies\n  There may not be any session state beyond\t\twhat’s needed for simple algorithmic validation of\t\tauthentication information.  session\n  The browser controls like the back, forward\t and refresh buttons must work as expected.\t I.e. the back button should take the users where they\t\texpect to be taken to (the last meaningful resource they\t\tworked with).\t\tA browser refresh should not cause a re-rendering of the login or\t\thome page instead of the page the user was looking at, or a\t\t(to the user) unexpected question about wanting to\t\tsubmit the same data again (when the user doesn&#39;t recall\t\tsubmitting any data, indicating a mis-use of the POST verb).\t\t browser-controls\n  The server returns structured semantic HTML markup that is\t\tindependent of layout information and client behavior.\t\t posh\n  It must be possible to access each page&#39;s information\t and functionality by using accessibility tools like screen readers.\t  accessibility\n  CSS is used for formatting and layout. This is done following the\t principles of  progressive enhancement, e.g. to allow\t\ta browser not capable of CSS3 features still to use a CSS3-based site.\t\t idiomatic-css\n  In line with the principles\t\tof  progressive enhancement, JavaScript is\t\tused  unobtrusively\t\tand the application remains usable (albeit with a\t\tdecrease in usability and convenience) if JavaScript is\t\tdisabled.  unobtrusive-javascript\n  The same functionality must not be implemented\t\tredundantly on both the client (JavaScript) and the server.\t\tThus, due to the  application logic\t\trequirement, application logic must not reside on the client-side.\t\t no-duplication\n  The server code may not &#34;know&#34; the\t\tHTML structures the client code generates (beyond CSS) or\t\tvice versa. Exceptions are some well defined HTML structures the server\t\tgenerates to initialize the client functionality above.\t\t know-structure\n  All JavaScript code and CSS code must be static,\t\tand must not be dynamically generated by the server in\t\ta form specific to the resource requested.\t\t(Note that this does not prohibit the use of preprocessors\t\tlike  CoffeeScript or\t\t LESS,\t\tas the respective code is usually pre-compiled as part of the release\t\tprocess.)  static-assets\n  Any dynamic routing or URI state\t\tmodification triggered by JavaScript on the client\t\tside should use the HTML5 History API.\t\t historyapi", "posttime": "2020-05-08 19:58:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "资源,oriented", "title": "面向资源的客户端体系结构", "title_en": "Resource-Oriented Client Architecture", "transed": 1, "url": "https://roca-style.org/?hnx", "via": "", "real_tags": ["资源", "oriented"]}, {"category": "", "categoryclass": "", "imagename": "c0ac95e07e86c680dd4d4838cad76b22.png", "infoid": 1001243, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，数字转换机构向公众发布了COVIDSafe应用程序的源代码。任何公众都可以查看托管在GitHub存储库中的源代码。\n保护下载和使用COVIDSafe的澳大利亚人的隐私是最重要的。在推出应用程序之前，源代码经过了政府安全机构、学者和行业专家的审查。“我们正在发布应用程序代码，但为了确保个人隐私和整个系统的完整性，与COVIDSafe国家信息存储系统相关的代码将不会发布。\n现在，研究人员、开发人员、学者和公众也可以详细查看源代码。\n您可以通过电子邮件support@covidsafe.gov.au提供有关应用程序源代码的反馈。我们欢迎在应用程序发布后已经提供的反馈。\n虽然我们可能无法回复每个提供反馈的人，但请注意，您的反馈将根据其对安全性和可用性的影响进行审查和分类。\n在某些情况下，DTA可能会联系您以更深入地了解所提出的问题。\n根据标准开发和软件实践，我们正在推出应用程序的更新版本，并将根据其优先级实施设计更改。\n本周，我们推出了第一个更新，解决了社区提出的一些最常见的问题，包括：\n内容进行了更改，使该应用程序更具用户友好性。注册过程和帮助主题之间更好地协调就是一个例子。\n内容更改，以便更好地向用户解释在用户检测出病毒呈阳性时上传数据的过程。\n更改以解决该应用程序对少数Android用户造成的操作系统问题。\n像所有的应用程序一样，我们计划反复增强CoVIDSafe，我们已经有了下几个版本的计划。这些版本将侧重于进一步加强应用程序的安全性，并提高其可用性和可访问性。我们的下一次更新将在2020年5月11日开始的一周内进行。\n我们还在与苹果和谷歌合作，因为他们正在开发可以增强COVIDSafe应用程序的技术。\n有关详细信息，请访问COVIDSafe网站或访问COVIDSafe应用程序的源代码。", "note_en": "Today the Digital Transformation Agency released to the public the source code for the COVIDSafe application. Any member of the public can view the source code, which is hosted on a  GitHub repository.\n  Protecting the privacy of Australians downloading and using COVIDSafe is paramount. Prior to launching the application, the source code was reviewed by government security agencies, academics and industry specialists. We are releasing the app code, but to ensure the privacy of individuals and integrity of the overall system, the code that relates to the COVIDSafe National Information Storage System will not be released.\n  Now researchers, developers, academics and members of the public can also review the source code in detail.\n You can provide feedback about the application’s source code by emailing  support@covidsafe.gov.au. We welcome the feedback that has already been provided following the app’s launch.\n While we may be unable to reply to every individual who provides feedback, please know that your feedback will be reviewed and triaged depending on its impact to security and usability.\n In some instances, the DTA may contact you to gain a deeper understanding about the issues raised.\n  In line with standard development and software practices, we are rolling out updated releases of the application and we will implement design changes based on their priority.\n This week we rolled out the first update, which addressed some of the most common issues raised by the community, including:\n Content changes to make the app more user friendly. An example is better alignment between the registration process and help topics.\n Content changes to better explain to the user the process to upload data if a user tests positive to the virus.\n   Changes to address the app causing issues with the operating system for a small number of Android users.\n  Like all apps, we plan to iteratively enhance COVIDSafe and we already have a plan for the next couple of releases. These releases will focus on further strengthening the security of the application and improve its usability and accessibility. Our next update will occur during the week commencing 11 May 2020.\n We are also working with Apple and Google as they develop technology that could enhance the COVIDSafe application.\n Visit the  COVIDSafe website for more information or to access the source code for the COVIDSafe application.", "posttime": "2020-05-08 19:58:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,代码,app,公布,government", "title": "澳大利亚政府公布COVIDSafe应用程序源代码", "title_en": "Australian Government releases COVIDSafe application source code", "transed": 1, "url": "https://www.dta.gov.au/news/dta-publicly-releases-covidsafe-application-source-code", "via": "", "real_tags": ["程序", "代码", "app", "公布"]}, {"category": "", "categoryclass": "", "imagename": "67ecb7d1a2ee79b82258d9331e112c49.png", "infoid": 1001242, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们关切地听取了错误地认为群体免疫可能“很快减缓”冠状病毒传播的声音。例如，拉什·林堡2号最近声称“加州发生了群体免疫”。作为传染病流行病学家，我们希望清楚表明，除非发生公共卫生灾难，否则2020年不会在人口水平上实现对冠状病毒的群体免疫。\n尽管全球报告了250多万例冠状病毒确诊病例，但研究表明(截至2020年4月初)任何国家人口中感染SARS-CoV-2(导致冠状病毒的冠状病毒)的比例不超过2-4%、3-5%。即使是在像纽约市这样受疫情影响最严重的热点地区，初步研究表明，到目前为止，可能有15%-21%的6.7%的人接触过这种病毒。在达到这个暴露水平的过程中，纽约市840万人中已有超过17500人死亡(约每500名纽约人中就有一人死亡)，该市的总体死亡率表明，死亡人数可能被低估了，死亡率可能会更高。8个。\n一些人接受了“控制的自愿感染”的想法，类似于20世纪80年代的“水痘聚会”。然而，冠状病毒的致死性是水痘的100倍。例如，在钻石公主号游轮上，感染SARS-CoV-2的人的死亡率为1%。参加“冠状病毒聚会”感染的人不仅会大大增加自己在下个月死亡的机会，还会让家人和朋友处于危险之中。冠状病毒现在是美国的头号死因，每天有近2000名美国人死于冠状病毒。8水痘在一年内从未导致超过150名美国人死亡。9个。\n为了达到对冠状病毒的群体免疫力，可能70%或更多的人口需要免疫。如果没有疫苗，在我们达到这一门槛之前，将有超过2亿美国人受到感染。换句话说，即使美国目前冠状病毒大流行的速度继续下去-每天有超过2.5万例确诊病例-我们也要到2021年才能达到群体免疫力。如果目前的每日死亡率继续下去，到那时将有超过50万美国人死于冠状病毒。\n当我们讨论何时以及如何分阶段重新开放时，10重要的是要了解我们仍然是多么脆弱。增加检测将有助于我们更好地了解感染范围，但很明显，这场大流行才刚刚开始。\n麦凯·H·“群体免疫力”会对冠状病毒起作用吗？福克斯新闻。https://www.foxnews.com/health/will-heard-immunity-work-against-coronavirus.。发表于2020年3月23日。访问时间为2020年4月23日。\nFlaxman S，Mishra S，Gandy A等人。报告13：估计11个欧洲国家的感染人数和非药物干预措施对冠状病毒的影响。DOI：10.25561/77731。\nBendavid E，Mulaney B，Sood N等人。加利福尼亚州圣克拉拉县冠状病毒抗体血清阳性率。MedRxiv.。2020年4月：2020.04.14.20062463。DOI：10.1101/2020.04.14.20062463\n路透社。荷兰的一项研究表明，3%的人口有冠状病毒抗体。在线邮件。https://www.dailymail.co.uk/health/article-8224915/Dutch-study-suggests-3-population-coronavirus-antibodies.html.。发表于2020年4月16日。访问时间为2020年4月23日。\n8天前RR-SW。纽约市医院有数量惊人的孕妇冠状病毒检测呈阳性。生活科学网。https://www.livescience.com/coronavirus-in-pregnant-woman-high-nyc.html.。访问时间为2020年4月23日。\n幸运的是，21%的纽约人在早期检测中发现了L.Coronavirus抗体。MarketWatch。https://www.marketwatch.com/story/early-antibody-tests-find-21-of-new-yorkers-have-had-covid-19-2020-04-23.。访问时间为2020年4月28日。\n死亡人数达到正常水平的6倍，远远超过冠状病毒计数显示的水平。纽约时报。https://www.nytimes.com/interactive/2020/04/27/upshot/coronavirus-deaths-new-york-city.html.。发表于2020年4月27日。访问时间为2020年4月28日。\n“水痘聚会”如何扭转武汉病毒的风潮。https://thefederalist.com/2020/03/25/how-medical-chickenpox-parties-could-turn-the-tide-of-the-wuhan-virus/.。访问时间为2020年4月23日。", "note_en": "We have listened with concern to voices erroneously suggesting that herd immunity may “soon slow the spread” 1 of COVID-19. For example, Rush Limbaugh 2 recently claimed that “herd immunity has occurred in California.” As infectious disease epidemiologists, we wish to state clearly that herd immunity against COVID-19 will not be achieved at a population level in 2020, barring a public health catastrophe.\n Although more than 2.5 million confirmed cases of COVID-19 have been reported worldwide, studies suggest that (as of early April 2020) no more than 2-4% 3–5 of any country’s population has been infected with SARS-CoV-2 (the coronavirus that causes COVID-19). Even in hotspots like New York City that have been hit hardest by the pandemic, initial studies suggest that perhaps 15-21% 6,7 of people have been exposed so far. In getting to that level of exposure, more than 17,500 of the 8.4 million people in New York City (about 1 in every 500 New Yorkers) have died, with the overall death rate in the city suggesting deaths may be undercounted and mortality may be even higher. 8\n Some have entertained the idea of “controlled voluntary infection,” 9 akin to the “chickenpox parties” of the 1980s. However, COVID-19 is 100 times more lethal than the chickenpox. For example, on the Diamond Princess cruise ship, the mortality rate among those infected with SARS-CoV-2 was 1%. Someone who goes to a “coronavirus party” to get infected would not only be substantially increasing their own chance of dying in the next month, they would also be putting their families and friends at risk. COVID-19 is now the leading cause of death in the United States, killing almost 2,000 Americans every day.8 Chickenpox never killed more than 150 Americans in a year. 9\n To reach herd immunity for COVID-19, likely 70% or more of the population would need to be immune. Without a vaccine, over 200 million Americans would have to get infected before we reach this threshold. Put another way, even if the current pace of the COVID-19 pandemic continues in the United States – with over 25,000 confirmed cases a day – it will be well into 2021 before we reach herd immunity. If current daily death rates continue, over half a million Americans would be dead from COVID-19 by that time.\n As we discuss when and how to phase in re-opening, 10 it is important to understand how vulnerable we remain. Increased testing will help us better understand the scope of infection, but it is clear this pandemic is still only beginning to unfold.\n  McKay H. Will “herd immunity” work against coronavirus? Fox News.  https://www.foxnews.com/health/will-heard-immunity-work-against-coronavirus. Published March 23, 2020. Accessed April 23, 2020.\n  Flaxman S, Mishra S, Gandy A, et al. Report 13: Estimating the Number of Infections and the Impact of Non-Pharmaceutical Interventions on COVID-19 in 11 European Countries.; 2020. doi:10.25561/77731\n Bendavid E, Mulaney B, Sood N, et al. COVID-19 Antibody Seroprevalence in Santa Clara County, California. medRxiv. April 2020:2020.04.14.20062463. doi:10.1101/2020.04.14.20062463\n Reuters. Dutch study suggests 3% of the population has coronavirus antibodies. Mail Online.  https://www.dailymail.co.uk/health/article-8224915/Dutch-study-suggests-3-population-coronavirus-antibodies.html. Published April 16, 2020. Accessed April 23, 2020.\n ago RR-SW 8 days. Surprising number of pregnant women at NYC hospitals test positive for COVID-19. livescience.com.  https://www.livescience.com/coronavirus-in-pregnant-woman-high-nyc.html. Accessed April 23, 2020.\n Lucking L. Coronavirus antibodies found in 21% of New Yorkers in early testing. MarketWatch.  https://www.marketwatch.com/story/early-antibody-tests-find-21-of-new-yorkers-have-had-covid-19-2020-04-23. Accessed April 28, 2020.\n Katz J, Sanger-Katz M. N.Y.C. Deaths Reach 6 Times the Normal Level, Far More Than Coronavirus Count Suggests. The New York Times.  https://www.nytimes.com/interactive/2020/04/27/upshot/coronavirus-deaths-new-york-city.html. Published April 27, 2020. Accessed April 28, 2020.\n How “Chickenpox Parties” Could Turn The Tide Of The Wuhan Virus.  https://thefederalist.com/2020/03/25/how-medical-chickenpox-parties-could-turn-the-tide-of-the-wuhan-virus/. Accessed April 23, 2020.", "posttime": "2020-05-08 19:43:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,人口,immunity,冠状病毒", "title": "2020年不会在人口水平上实现对Covid的羊群免疫", "title_en": "Herd immunity against Covid will not be achieved at a population level in 2020", "transed": 1, "url": "https://coronavirus.jhu.edu/from-our-experts/early-herd-immunity-against-covid-19-a-dangerous-misconception", "via": "", "real_tags": ["2020", "人口", "immunity", "冠状病毒"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001241, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "软件保护扩展(SGX)代表了英特尔在可信计算领域的最新进军。最初的目的是作为一种保护云计算的手段，后来它被用于生产系统中的DRM和安全密钥存储。SGX与TrustZone等竞争对手的不同之处在于，它专注于减少其“安全世界”中的可信代码量。用SGX的话说，这些安全世界被称为Enclaves，并通过内存加密引擎和一组新的CPU指令的组合来保护不受信任的代码，以强制分离。\n从第六代英特尔酷睿(Skylake)开始，几乎所有英特尔处理器上都可以使用SGX。从那以后，它经历了一段有点坎坷的旅程。在其发布后，有人对SGX被用作传播恶意软件的媒介表示担忧。还出版了一份概念证明，证明了这一做法的有效性。然后，人们对发布生产中的飞地代码所需的强制性协议感到担忧。要使用英特尔的认证服务，这是构建在SGX上的任何远程应用程序的关键支持因素，开发人员必须获得英特尔的商业许可证。这种锁定引起了相当多的恐慌，到目前为止，英特尔还没有完全解决这一问题。然后就出现了漏洞。SGX被发现容易受到缓存计时攻击、投机性执行漏洞和加载值注入攻击。这进一步侵蚀了该平台的公信力。\n这就是说，已经有相当多的项目利用SGX来强化现有的解决方案或提出迄今未见过的应用程序。在这篇文章中，我们将看三个这样的提案，看看他们是如何利用SGX的，尽管它的属性令人担忧。在适用的情况下，我们还将讨论已发现的漏洞如何影响其生存能力。\n1.英特尔公司经过时间的证明，2016年(正在积极开发中)英特尔的锯齿是Hyperledger基金会的首批项目之一，Hyperledger基金会是Linux基金会的子公司，致力于开源许可的区块链项目。与未经许可的区块链(如比特币)相比，有许可的区块链的主要吸引力之一是它们承诺更高的能源效率。由于许可网络由一组封闭的已知合作者组成，因此可以使用比工作证明更有效的协商一致机制。最初允许的项目求助于使用标准的共识算法，如PBFT和RAFT，然而，由于可伸缩性的限制，这些算法最终不适合更大的网络。\n为了克服这些限制，英特尔设计了流逝时间证明(POET)，并将其作为锯齿图的默认共识算法发布。PEET是一个基于领导者的共识算法，它依赖于SGX的安全保证。该算法相当简单，在每个块时间，每个节点执行以下步骤：\n1.每个节点使用可信功能从其SGX飞地请求超时。2.节点休眠，直到超时返回。3.返回时，可信函数随后验证超时实际上已经到期。4.节点向网络广播其验证的超时值。具有最低超时的节点被选择为引导者。\nPEET的目标是创建一种类似于工作证明的领导人选举算法，但与计算工作不同的是，这里一个实体的“投票权”与该实体控制的SGX芯片的数量成正比。原则上，这会带来巨大的运行时效率提升，因为在领导人选举过程中不会执行密集的工作。不幸的是，这项提议受到一个关键的安全经济问题的影响：这里的节点维护人员有强烈的动机闯入他们自己的SGX芯片。如果对手设法妥协他们的SGX，他们可以通过将超时设置为0在每一轮的领导人选举中获胜。网络越有价值，危害您自己平台的动机就越强。\n这不仅仅是一个理论上的问题，因为在过去的几年里，SGX已经证明了一系列的漏洞。为了在一定程度上缓解这一问题，锯齿图现在包括z-test，以检查特定节点是否过于频繁地赢得选举。当然，这并不能完全否定对手的优势，而且已经表明，尽管存在z-test，但即使只有几个被攻破的节点，对手也可以危害网络。正因为如此，我认为PEET只有在没有有动机的对手的崩溃容错设置中才有用；从锯齿图上的论坛帖子来看，这似乎也是开发人员的普遍共识。\n2.不要挖掘排队等待：公平高效的区块链共识与鲁棒轮询，Mansoor Ahmed-Rengers和Kari Kostiainen，2019年著。本文直接源于前面的讨论，旨在创建一个基于SGX的共识算法，该算法不会受到同样的安全经济问题的困扰。由于很快就会明显的原因，我们将此算法称为鲁棒轮询算法(RRR)。我们首先断言，将可信计算设备掌握在对手手中意味着我们不能依赖于飞地不会受到危害。因此，我们不依赖Enclaves来提供运行时安全保证，而只是将它们用作用于一致性(即Sybil攻击预防)的身份的门控机制。\n我们唯一依赖的SGX原语是使用英特尔证明服务(IAS)执行的远程证明。此服务使用依赖硬件密钥的报价机制来向IAS证明它是SGX平台。现在，如果对手使用非SGX系统进行尝试，尝试将会失败，因为他们将无法访问必要的密钥。另一方面，如果对手确实拥有SGX系统，则他们不会通过损害其系统而获得任何好处，因为授予的密钥和身份之间存在1对1的关系。\n一旦为节点分配了身份，它就会将其身份广播给网络上所有注册的节点。当接收到该身份时，该身份加入事件被添加到区块链中，然后该节点被认为已注册。所有节点都维护按其“挖掘年龄”排序的注册身份列表。挖掘年龄是自身份上次挖掘某个块以来经过的块数。挖掘年龄最高的10个左右的节点被认为是候选矿工。然后，所有候选挖掘器向随机抽样的对数组投票节点发送候选消息。选民选择年龄最大的候选人作为矿工，然后他将广播下一个街区。因此，在没有离线节点的情况下，我们遵循确定性的轮询领袖选择，以确保奖励的公平性。\n该协议不会遭受与POTE相同的漏洞，但它容易受到集中式IAS的危害。如果英特尔是恶意的，或者如果IAS服务器受到威胁，则不能信任门控机制。因此，本文还提出了另一种形式的门控机制，它依赖于通过工作证明的初始自举阶段。然而，这一替代版本面临着与股权证明系统相同的一些问题(最终形成垄断，新参与者不容易进入)。\n3.EnclaveDB：A Secure Database Using SGX，Christian Piebe，Kapil Vaswani和Manuel Costa在本文中，作者介绍了SGX的另一个用例：保护数据库。他们提出了EnclaveDB，这是一个使用SGX Enclaves来阻止恶意数据库管理员的数据库引擎。他们设想EnclaveDB在云计算环境中很有用，因为在云计算环境中，用户可能不信任主机来处理敏感数据。\n作者考虑了一个威胁模型，其中对手控制服务器上运行的除Enclave之外的所有代码。这包括磁盘和网络I/O。它们不允许物理攻击，并假定SGX的内存保护保证有效。他们的目标是提供一个内存中的数据库，保证机密性、完整性和新鲜性，同时对性能影响很小。他们通过将数据库系统拆分成客户端和服务器端组件来实现这一目标。客户端负责存储数据库加密密钥以及建立到服务器端飞地的可信连接的密钥管理服务。\n在服务器端，EnclaveDB有两个组件：不受信任的SQL服务器和受信任的Enclave。SQL服务器可以对公共的、非敏感的数据执行查询。它还负责代表Enclave接收请求并调用Enclave内的存储过程。Enclave包含一个Hekaton内存数据库以及一组编译的查询。这些查询在客户端编译，然后加载到Enclave上，从而通过不需要将通用查询处理器加载到Enclave来减少攻击面。不幸的是，这还需要数据库模式中的任何更改都需要重新部署Enclave代码。实际的事务处理遵循Hekaton和主机之间相当简单的两阶段提交协议。\n系统设计的问题之一是在事务处理协议中使用SGX的单调计数器来防止回滚攻击。已经证明，在永久烧毁之前，这些设备仅支持有限数量的写入。这使他们的解决方案的有效性受到质疑，因为数据库维护人员可能希望从他们的服务器获得长时间的运行时间。作者建议采取部分缓解措施。", "note_en": "Software Guard eXtensions (SGX) represents Intel’s latest foray into trusted computing. Initially intended as a means to secure cloud computation, it has since been employed for DRM and secure key storage in production systems. SGX differs from its competitors such as TrustZone in its focus on reducing the volume of trusted code in its “secure world”. These secure worlds are called enclaves in SGX parlance and are protected from untrusted code by a combination of a memory encryption engine and a set of new CPU instructions to enforce separation.\n SGX has been available on almost every Intel processor since the sixth generation of Intel Core (Skylake). It has had a bit of a rocky journey since. Upon its release, there were concerns expressed about SGX being used as a medium for malware dissemination. A proof of concept demonstrating the effectiveness of this was also  published. Then there were concerns about the mandatory agreements required to publish enclave code in production. In order to use Intel’s attestation service, a key enabler for any remote application built on SGX, developers have to obtain a commercial license from Intel. This lock-in raised a fair bit of consternation and to date hasn’t been  fully addressed by Intel. Then came the vulnerabilities. SGX was found to be vulnerable to  cache timing attacks,   speculative execution vulnerabilities and to  Load Value Injection attacks. This has further eroded the credibility of the platform.\n That said, there have been a fair few projects that have utilized SGX either to harden existing solutions or to come up with hitherto unseen applications. In this post, we’ll look at three such proposals to see how they utilize SGX despite its concerning attributes. Where applicable, we will also talk about how the discovered vulnerabilities have affected their viability.\n  1.   Proof of Elapsed Time by Intel Corporation, 2016 (and under active development) Intel’s Sawtooth was one of the first projects in the Hyperledger Foundation, a Linux Foundation subsidiary dedicated to open source permissioned blockchain projects. One of the main appeals of permissioned blockchains versus permissionless blockchains (such as Bitcoin) is their promise of better energy efficiency. Since permissioned networks consist of a closed set of known collaborators, it is possible to use more efficient consensus mechanisms than Proof of Work. Initial permissioned projects resorted to using standard consensus algorithms such as PBFT and Raft, however, these turned out to be unsuitable for larger networks due to scalability restrictions.\n To overcome these restrictions, Intel designed Proof of Elapsed Time (PoET) and released it as the default consensus algorithm for Sawtooth. PoET is a leader-based consensus algorithm that relies on SGX for its security guarantees. The algorithm is fairly simple, at each block time every node performs the following steps:\n 1. Each node requests a timeout from its SGX enclave using a trusted function. 2. Node sleeps until the timeout returns. 3. Upon return, a trusted function then verifies that the timeout has actually expired. 4. Node broadcasts its verified timeout value to the network. The node with the lowest timeout is selected as the leader.\n The goal of PoET was to create a leader election algorithm akin to Proof of Work but instead of computational work, the “voting power” of an entity here is proportional to the number of SGX chips that that entity controls. In principle, this leads to massive runtime efficiency gains since no intensive work is performed as part of the leader election. Unfortunately, this proposal suffers from a critical security economics issue: node maintainers here have a strong incentive to break into their own SGX chips. If an adversary managed to compromise their SGX, they could win the leader election at every round by setting the timeout to 0. The more valuable the network, the stronger the incentive to compromise your own platform.\n This isn’t just a theoretical concern since a whole host of vulnerabilities have been demonstrated for SGX in the last couple of years. In order to mitigate this to some degree, Sawtooth now includes z-test to check if a particular node is winning elections too frequently. Of course, this doesn’t negate the adversary’s advantage completely and it  has been shown that even with a handful of compromised nodes the adversary can compromise a network, z-test notwithstanding. Because of this, I would consider PoET to only be useful in crash fault tolerant settings where there are no motivated adversaries; this also seems to be the general consensus among developers judging by forum posts on Sawtooth.\n 2.   Don’t Mine Wait In Line: Fair and Efficient Blockchain Consensus with Robust Round Robin by Mansoor Ahmed-Rengers and Kari Kostiainen, 2019 This paper follows directly from the preceding discussion and aims to create an SGX-based consensus algorithm that doesn’t suffer from the same security economics issues.  For reasons that will be obvious soon, we call this algorithm Robust Round Robin (RRR). We start off by asserting that having the trusted computing device in the adversary’s possession implies that we cannot rely on the enclaves not being compromised. Thus, we do not rely on the enclaves for runtime security guarantees, rather we only use them as a gating mechanism for identities used for consensus (i.e.,  sybil attack prevention).\n The only SGX primitive we rely on is the remote attestation performed with the Intel Attestation Service (IAS). This service uses a quoting mechanism that relies on a hardware key to prove to the IAS that it is an SGX platform. Now, if an adversary uses a non-SGX system to attempt this, the attempt will fail since they will not have access to the requisite key. On the other hand, if the adversary does have possession of an SGX system, they do not gain anything by compromising their system since there is 1-to-1 relation between keys and identities granted.\n Once a node is assigned an identity, it broadcasts its identity to all the enrolled nodes on the network. Upon receipt of this identity, this identity joining event is added to the blockchain and the node is then said to be enrolled. All nodes maintain the list of enrolled identities ordered by their “mining age”. The mining age is the number of blocks that have elapsed since an identity last mined a block. The ten or so nodes with the highest mining ages are considered to be candidate miners. All the candidate miners then send a candidate message to a logarithmic set of randomly sampled voting nodes. The voters pick the oldest candidate as the miner who then broadcasts the next block. Thus, in the absence of offline nodes we follow a deterministic round robin leader selection which ensure fairness of rewards.\n This protocol does not suffer the same vulnerabilities as PoET but it is susceptible to a compromise of the centralized IAS. If Intel is malicious or if the IAS servers are compromised then the gating mechanism cannot be trusted. An alternative version of the gating mechanism that relies on an initial bootstrapping phase via Proof of Work is therefore also presented in the paper. This alternative version, however, suffers from some of the same problems that Proof of Stake systems suffer from (eventual monopolies and lack of easy entry for new participants).\n 3.   EnclaveDB: A Secure Database Using SGX by Christian Piebe, Kapil Vaswani and Manuel Costa In this paper, the authors present a different use case for SGX: securing databases. They propose EnclaveDB, a database engine that uses SGX enclaves to thwart malicious database administrators. They envision EnclaveDB being useful in cloud computing settings where users may not trust the host with sensitive data.\n The authors consider a threat model where the adversary controls all code running on the server except for the enclave. This includes disk and network I/O. They do not allow physical attacks and assume that SGX’s memory protection guarantees hold. Their goal is to provide an in-memory database that guarantees confidentiality, integrity and freshness with a small performance impact. They achieve this goal by splitting the database system into client-side and server-side components. The client side is responsible for storing a database encryption key as well as a key management service that establishes trusted connections to the server side enclave.\n On the server side, EnclaveDB has two components: the untrusted SQL server and a trusted Enclave. The SQL server can perform queries on public, non-sensitive data. It is also responsible for receiving requests on behalf of the enclave and invoking stored procedures within the enclave. The enclave contains a Hekaton in-memory database along with a set of compiled queries.  These queries are compiled on the client side and then loaded on to the enclave thus reducing the attack surface by not requiring a general query processor to be loaded into the enclave. Unfortunately this also entails that any changes in the database schema would require redeploying the enclave code. The actual transaction processing follows a fairly simple two-phase commit protocol between Hekaton and the host.\n One of the issues with the system design is the use of SGX’s monotonic counters in the transaction processing protocol to prevent rollback attacks. These have been shown to support only a limitted number of writes before  permanently burning out. This calls into question the validity of their solution since database maintainers would presumably expect long run-times from their servers. The authors suggest a partial mitigation for this but this does not fully address the concern. More seriously, it appears to me that EnclaveDB is vulnerable to the aforementioned cache timing attacks revealed on SGX. It also appears that there isn’t much that can be done about this by way of implementation mitigations either without upstream fixes to SGX. Proposals such as  Varys have, however, provided promising avenues for these fixes.    Conclusion Intel SGX has its issues: vulnerabilities and archaic lock-in policies by Intel being the foremost ones. That said, it is the most accessible, widely deployed trusted computing framework for desktop and server-side developers. This wide availability is a key contributor to the large amounts of research being done on SGX. Moreover, as RRR demonstrates, it is possible to use SGX to gain integrity assurances despite the discovered vulnerabilites. Lastly, I expect SGX to see more widespread adoption as a relatively low cost defense-in-depth mechanism. Yes, there are vulnerabilities but using SGX nevertheless represents an additional hurdle for any potential adversary. If security economics has taught us anything, it is that introducing that hurdle can only be a good thing.", "posttime": "2020-05-08 19:43:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "英特尔,sgx", "title": "英特尔SGX有什么好处？", "title_en": "What's Intel SGX Good For?", "transed": 1, "url": "https://www.lightbluetouchpaper.org/2020/05/07/three-paper-thursday-whats-intel-sgx-good-for/", "via": "", "real_tags": ["英特尔", "sgx"]}, {"category": "", "categoryclass": "", "imagename": "10c030b2429f801a5aed8756bdece9d2.jpg", "infoid": 1001240, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Rust团队发布了Rust的新版本1.43.1。Rust是一种编程语言，它使每个人都能够构建可靠而高效的软件。\n如果您通过Rustup安装了以前版本的Rust，则获取Rust 1.43.1与以下操作一样简单：\n如果您还没有，您可以从我们网站的相应页面获取概要信息，并在GitHub上查看1.43.1的详细发行说明。\nRust1.43.1解决了1.43.0稳定版本中引入的两个回归问题，并更新了Cargo使用的OpenSSL版本。\nRust 1.27.0引入了对在标准库中检测x86CPU特性的支持，这要归功于IS_x86_FEATURE_DETECTED！宏。由于内部重构，Rust1.43.0阻止了对还不能在稳定(如AVX-512)上使用的功能的检测，即使在过去允许检测它们。Ruust 1.43.1修复了这种回归。有关回归的更多信息，请参见71473期。\nRust 1.43.0打破了对列出随Cargo一起发布的包中文件的支持，当这些文件位于具有路径依赖关系或未发布版本的工作区中时。该问题的修复包含在Rust 1.43.1中。有关该漏洞的更多信息可在货物问题#8151中获得。\n货物的依赖之一OpenSSL最近发布了一份安全建议。不幸的是，我们没有及时包含Rust1.43.0的补丁，所以我们在Rust1.43.1中升级了OpenSSL。我们没有证据表明此漏洞会危及货运用户的安全(如果有，请遵循我们的安全策略)。\n许多人聚集在一起创造了铁锈1.43.1。如果没有你们所有人，我们不可能做到这一点。谢谢!", "note_en": "The Rust team has published a new point release of Rust, 1.43.1.Rust is a programming language that is empowering everyone to build reliable and efficient software.\n If you have a previous version of Rust installed via rustup, getting Rust 1.43.1 is as easy as:\n  If you don&#39;t have it already, you can  get  rustup from theappropriate page on our website, and check out the  detailed release notes for1.43.1 on GitHub.\n  Rust 1.43.1 addresses two regressions introduced in the 1.43.0 stable release, and updates the OpenSSL version used by Cargo.\n  Rust 1.27.0 introduced support for detecting x86 CPU features in the standard library, thanks to the   is_x86_feature_detected! macro. Due to an internal refactoring, Rust 1.43.0 prevented the detection of features that can&#39;t be used on stable yet (such as AVX-512), even though detecting them was allowed in the past. Rust 1.43.1 fixes this regression. More information on the regression in available in  issue #71473.\n  Rust 1.43.0 broke support for listing the files included in packages published with Cargo, when inside a workspace with path dependencies or unpublished versions. A fix for the issue is included in Rust 1.43.1. More information on the bug is available in  Cargo issue #8151.\n  OpenSSL, one of the dependencies of Cargo, recently released a  security advisory. Unfortunately we were not able to include the fix in time for Rust 1.43.0, so we upgraded OpenSSL in Rust 1.43.1. We have no evidence this vulnerability could compromise the security of Cargo users (if you do,  please follow our security policy).\n  Many people came together to create Rust 1.43.1.We couldn&#39;t have done it without all of you.  Thanks!", "posttime": "2020-05-08 19:43:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,铁锈", "title": "铁锈1.43.1", "title_en": "Rust 1.43.1", "transed": 1, "url": "https://blog.rust-lang.org/2020/05/07/Rust.1.43.1.html", "via": "", "real_tags": ["rust", "铁锈"]}, {"category": "", "categoryclass": "", "imagename": "161f2a05438d8c7fe517e97346722453.png", "infoid": 1001239, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GitHub是5000多万开发人员共同工作的家园。加入他们，发展您自己的开发团队，管理权限，并在项目中进行协作。\n报名", "note_en": "GitHub is home to over 50 million developers working together. Join them to grow your own development teams, manage permissions, and collaborate on projects.\n  Sign up", "posttime": "2020-05-08 19:28:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "covidsafe,发展", "title": "CoVIDSafe", "title_en": "COVIDSafe", "transed": 1, "url": "https://github.com/AU-COVIDSafe", "via": "", "real_tags": ["covidsafe", "发展"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001238, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国能源部科技信息办公室", "note_en": "The U.S. Department of Energy's Office of Scientific and Technical Information", "posttime": "2020-05-08 19:28:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,电子产品,electronics,科技", "title": "老式电子产品，可进行可靠的辐射测量", "title_en": "Vintage electronics for trusted radiation measurements", "transed": 1, "url": "https://www.osti.gov/servlets/purl/1616454", "via": "", "real_tags": ["rust", "电子产品", "科技"]}, {"category": "", "categoryclass": "", "imagename": "ee9eaba91da8cf4be9d3c909b1046c5b.jpg", "infoid": 1001237, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一个科技发达、资讯易得的年代，我们的学校仍然期望我们从书本上知道一切，而不考虑这是否我们在专业发展方面真正需要的。\n有多少次，你想知道你是否需要因为课程规定而需要学习的科目？芬兰已经决定改变他们教育系统中的这一点，引入一些适合21世纪的东西。\n到2020年，芬兰将通过教育引入一种不同的生活方式，而不是物理、数学、文学、历史或地理课程。欢迎来到基于现象的学习！\n正如现象教育在其网站上所说，“在基于现象的学习(PhenoBL)和教学中，整体的现实世界现象提供了学习的起点。这些现象是作为完整的实体，在它们的真实背景下研究的，与它们相关的信息和技能是通过跨越学科之间的边界来研究的。“。\n这意味着，学生将有机会从他们真实环境和世界的现象中选择，而不是为了学习而学习物理(或任何其他学科)，如媒体和技术，或欧盟。\n这些现象将通过跨学科的方法进行研究，这意味着学科将被包括在内，但只包括那些(而且只是其中的一部分)有助于在该主题中出类拔萃的学科。\n例如，想要学习职业课程的学生可以参加“自助餐厅服务”，并将通过数学、语言、写作和沟通技能等元素来研究这一现象。另一个例子是欧盟，它将包括经济、语言、地理和相关国家的历史。\n现在以你的职业为例，想一想你需要知道的所有与之相关的信息--你现在正在以PhenoBL的方式思考！\n这种学习将包括面对面和在线会议，强调通过电子学习过程对技术和互联网的有益利用。你可以在这里阅读更多关于它的信息。\n在学习过程中，学生将能够通过共享信息和集体探索和实施新信息作为构建工具，与他们的同龄人和老师合作。\n传统的以教师为中心的学习方式，学生坐在桌子后面，记录老师的每一节课，这种方法将改变为整体的水平。这意味着，每一种现象都将以最合适和最自然的方式来处理。\n然而，正如现象学习所说的那样，“基于现象的教学的出发点是建构主义，在建构主义中，学习者被视为积极的知识建构者，信息被视为解决问题的结果，从‘小块’构建成适合当时使用情况的整体。”\n这种教育系统倾向于在协作环境中学习(例如团队合作)，他们希望看到信息是在社会环境中形成的，而不是仅仅被视为个人的内部要素。\n这种方法将支持基于探究的学习、问题解决以及项目和档案袋学习。最后一步将是实际执行，被视为整个过程的结果。\n这项改革将需要不同学科的教师之间的大量合作，这就是为什么教师们已经在接受密集的培训。\n事实上，赫尔辛基70%的教师已经参与了符合新制度的准备工作。\n合作教学是课程创建的基础，来自多个学科专家的意见，接受这种新教学方式的教师将获得小幅加薪，以示认可。\n从教学的角度来看，这种风格对教师来说也是非常有价值的。一些已经在工作中实施了这种作风的教师表示，他们不能走回头路。\n这实在不足为奇，因为这种教学方式的互动是每个老师梦寐以求的。\n目前，学校有义务每年至少引入一段时间的基于现象的学习。计划是到2020年完全实施PhenoBL方法。\n学前教育部门正在使用一种类似的方法，称为游戏性学习中心，它将作为基于现象的学习的起点。\n一位拥有十多年不间断写作技巧的专业作家。她感兴趣的话题和专业知识范围从心理学到各种学科，如科学和新闻。", "note_en": "In an era of technology and easily accessible information, our schools still expect from us to know everything from the books, without considering whether this is going to be what we will actually need in our professional development.\n How many times have you wondered if you were going to need subjects you were made to learn because the curriculum said so? Finland has decided to change this in their educational system and introduce something which is suitable for the 21st century.\n  By 2020, instead of classes in physics, math, literature, history or geography, Finland is going to introduce a different approach to life through education. Welcome to the phenomenon based learning!\n As  Phenomenal Education states on their website, “In Phenomenon Based Learning (PhenoBL) and teaching, holistic real-world phenomena provide the starting point for learning. The phenomena are studied as complete entities, in their real context, and the information and skills related to them are studied by crossing the boundaries between subjects.”\n This means that instead of learning physics (or any other subject) for the sake of learning it, the students will be given the opportunity to choose from phenomena from their real surroundings and the world, such as Media and Technology, or the European Union.\n These phenomena will be studied through an interdisciplinary approach, which means subjects will be included, but only those (and only parts of them) that contribute to excelling in the topic.\n For example, a student who wants to study a vocational course can take “cafeteria services” and the phenomenon will be studied through elements of maths, languages, writing and communication skills. Another example is the European Union, which would include economics, languages, geography and the history of the countries involved.\n Now take your profession as an example and think of all the information you need to know connected to it – you are now thinking the PhenoBL way!\n This kind of learning will include both face-to-face and online sessions, with a strong emphasis on the beneficial use of technology and the Internet through the process of eLearning. You can read more about it  here.\n In the learning process, the students will be able to collaborate with their peers and teachers through sharing information and collectively exploring and implementing new information as a building tool.\n   Instead of the traditional style of teacher-centered learning, with students sitting behind their desks and recording every instruction given by the teacher, the approach is going to change to a holistic level. This means that every phenomenon will be approached in the most suitable and natural way possible.\n However, as Phenomenal Learning states, “The starting point of phenomenal-based teaching is constructivism, in which learners are seen as active knowledge builders and information is seen as being constructed as a result of problem-solving, constructed out of ‘little pieces’ into a whole that suits the situation in which it is used at the time.”\n This educational system tends to include leaning in a collaborative setting (e.g. teamwork), where they would like to see information being formed in a social context, instead of it being seen only as an internal element of an individual.\n This approach is going to support inquiry-based learning, problem-solution and project and portfolio learning. The last step is going to be practical implementation, being seen as the outcome of the whole process.\n This reform is going to require a lot of cooperation between teachers of different subjects and this is why the teachers are already undergoing an intense training.\n In fact, 70% of the teachers in Helsinki are already involved in the preparatory work in line with the new system.\n Co-teaching is at the base of the curriculum creation, with input from more than one subject specialist and teachers who embrace this new teaching style will receive a small increase in their salary as a sign of recognition.\n From a teaching perspective, this style is very rewarding and worthwhile for the teachers too. Some teachers, who have already implemented this style in their work, say that they cannot go back to the old style.\n This is indeed not surprising at all, as the interaction in this teaching style is something every teacher has always dreamed of.\n Currently, schools are obliged to introduce a period of phenomenal-based learning at least once a year. The plan is to completely implement the PhenoBL approach by 2020.\n A similar approach called the Playful Learning Centre is being used in the pre-school sector and it is going to serve as a starting point for the phenomenal-based learning.\n     A professional writer with over a decade of incessant writing skills. Her topics of interest and expertise range from psychology, to all sorts of disciplines such as science and news.", "posttime": "2020-05-08 18:58:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "放弃,abandons,学习", "title": "芬兰放弃学校科目，转而支持基于现象的学习", "title_en": "Finland abandons school subjects in favour of phenomenon based learning", "transed": 1, "url": "https://curiousmindmagazine.com/goodbye-subjects-finland-taking-revolution-education-step/", "via": "", "real_tags": ["放弃", "abandons", "学习"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001236, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在特里·A·戴维斯去世后，他的家人请求他的支持者向大脑与行为研究基金会和全国精神疾病联盟等致力于减轻精神疾病带来的痛苦的组织捐款。", "note_en": "In the wake of Terry A. Davis&#39; passing his family has requested supporters of his donate to &#34;organizations working to ease the pain and suffering caused by mental illness&#34; such as  The Brain &amp; Behavior Research Foundation and  National Alliance on Mental Illness.", "posttime": "2020-05-08 18:29:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "templeos,精神疾病", "title": "TempleOS", "title_en": "TempleOS", "transed": 1, "url": "https://templeos.org/", "via": "", "real_tags": ["templeos", "精神疾病"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001235, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "祝贺你!。独立的应用研究给人的感觉与许多其他论文截然不同，可能是因为缺乏通常的“要么发表要么灭亡”的压力或类似的强有力的限制。", "note_en": "Congratulations! Independent applied research feels refreshingly different from many other papers, probably due to the lack of the usual “publish or perish” pressure or similar strong constraints.", "posttime": "2020-05-08 18:14:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "论文,2020,paper,截然不同", "title": "SIGGRAPH 2020技术论文：n维刚体动力学", "title_en": "SIGGRAPH 2020 Technical Paper: N-Dimensional Rigid Body Dynamics", "transed": 1, "url": "https://marctenbosch.com/news/2020/05/siggraph-2020-technical-paper-n-dimensional-rigid-body-dynamics/", "via": "", "real_tags": ["论文", "2020", "paper", "截然不同"]}, {"category": "", "categoryclass": "", "imagename": "94a32d3e443d8519b932d4a86b6316de.jpg", "infoid": 1001234, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该医疗服务目前只针对怀特岛，但它表示，这只是该应用程序推出的第一阶段，而不是一次测试。\n代表BBC新闻进行的测试证实，开发者已经找到了一种方法，可以绕过苹果对iPhone使用蓝牙的限制。\n在一个相关的进展中，卫生部长马特·汉考克(Matt Hancock)宣布，迪多·哈丁男爵夫人(Baroness Dido Harding)将领导更广泛的测试、跟踪和追踪计划。\n这一任命让一些人感到意外，因为在她担任TalkTalk首席执行官期间，这家互联网提供商遭遇了一次重大的数据泄露，未能正确通知受影响的客户。\nNHS冠状病毒应用程序的设计目的是通过发送无线蓝牙信号，使用人们的智能手机来跟踪他们何时走近以及走近多长时间。\n如果其中一个人生病了，他们可以匿名触发记录的上传，这样警报就可以级联到他们可能感染的其他人身上，要求他们在认为必要时进行自我隔离，可能是在他们出现任何症状但仍具有高度传染性之前。\n与其他措施(包括手动接触者追踪)一起，这可能会放松锁定措施，而不会导致病例的另一次激增。\n医疗服务机构NHSX的数字创新部门NHSX选择了一个中央系统来驱动这款应用，因此联系人配对过程在英国的计算机服务器上进行，而不是在个人智能手机上进行。\n有很多人猜测，这一决定意味着这款应用注定会在iPhone上运行不佳。\n苹果限制了第三方应用在屏幕外、在后台运行时可以使用蓝牙的程度，尽管该公司已承诺放宽这一规定，适用于使用其与谷歌(Google)共同开发的去中心化系统的联系人追踪应用。\n出于这个原因，新加坡和澳大利亚已经发出信号，他们将从集中式应用程序转变为分散式应用程序。\nPEN Test Partners在几部越狱iPhone上安装了这款应用--经过修改后，他们可以监控通常对用户隐藏的活动。\n联合创始人肯·门罗(Ken Munro)说，当手机第一次靠在一起时，手机会开始以8秒或16秒的间隔通过蓝牙传输信号。\n我们的测试表明，这似乎不会影响信标，无论这些电话是第一次相遇，还是随后被物理地移出，然后又回到了范围内。&#34；\n另一家名为“再孵化”的公司发现，当这款应用在后台运行超过90分钟不受干扰时，有时会变得安静，但他们表示，在现实世界中，这不应该是一个太大的问题。\n许多合理的因素可能会导致这一窗口被延长，包括蓝牙的其他使用、Android设备的存在以及通知(要求用户重新打开应用程序)的有效性。它在博客上写道。\n在我们的测试中，我们运行该应用程序的iOS设备继续让后台服务保持通宵运行。\n既然源代码已经发布给Github，那么将对这款应用程序进行进一步的审查，让其他人看到解决办法是如何实现的。\n本周早些时候，联合人权委员会(Joint Human Rights Committee)听取了证据，表明尽管APP匿名了用户的身份，但理论上他们可以被重新识别，这可能会让当局-甚至黑客-出于其他目的泄露人们的社交圈。\n该委员会表示，应该创建一个新的监督机构，以监督该应用程序的使用以及为确保数据安全而采取的措施。\n该委员会主席哈丽特·哈曼(Harriet Harman)表示：部长们对隐私的保证是不够的。\n必须为个人提供强有力的法律保护，让他们知道这些数据将被用来做什么，谁将有权访问它，以及如何保护它不受黑客攻击。\n批评人士说，分散化的方法--在手机上进行联系人匹配--将更好地保护用户的隐私。\nBBC新闻被告知，在这款应用上为NHSX提供建议的道德团体的成员呼吁NHSX更好地解释中央系统的优势。\n为NHSX提供建议的流行病学家克里斯托夫·弗雷泽教授告诉BBC新闻，这两个主要好处是：\n这使得让人们自我诊断而不是等待检测结果成为可能，因为任何大规模滥用这一过程的尝试都可以被检测到。\n收集的数据可用于微调系统，以根据计算的风险分数发送不同类型的警报。\n对这款应用在怀特岛的使用情况进行分析，将为如何最好地继续进行提供决策依据。\n在这个阶段，找出我们如何才能找到折衷这些不同需求的最佳系统有点悬而未决。", "note_en": "The health service is targeting the Isle of Wight only, at this stage, but it says this is the first stage of the app&#39;s rollout - not a test.\n Tests carried out on behalf of BBC News confirm the developers have found a way to work round restrictions Apple places on the use of Bluetooth in iPhones.\n In a related development, Health Secretary Matt Hancock has announced that Baroness Dido Harding will head up the wider test, track and trace programme.\n  The appointment has surprised some given that when she was chief executive of TalkTalk, the internet provider suffered a major data breach and failed to properly notify affected customers.\n  The NHS Covid-19 app is designed to use people&#39;s smartphones to keep track of when they come close to each other and for how long, by sending wireless Bluetooth signals.\n  If one of them falls ill, they can anonymously trigger an upload of the records so alerts can be cascaded to others they might have infected, asking them to self-isolate, if deemed necessary, potentially before they have any symptoms but are still highly contagious.\n Along with other measures, including manual contact tracing, this may allow lockdown measures to be eased without causing another spike in cases.\n NHSX, the health service&#39;s digital innovation unit, has opted for a centralised system to power the app, so the contact-matching process happens on a UK-based computer server rather than individuals&#39; smartphones.\n  And there has been a lot of speculation this decision would mean the app was doomed to work badly on iPhones.\n Apple limits the extent to which third-party apps can use Bluetooth when they are off-screen and running in the background, although it has promised to relax this rule for contact-tracing apps that use a decentralised system it is co-developing with Google.\n And Singapore and Australia  have signalled they will switch from centralised to decentralised apps, for that reason.\n   Pen Test Partners installed the app on a handful of &#34;jailbroken&#34; iPhones - altered to allow them to monitor activity normally hidden from users.\n  &#34;When first placed in proximity to each other, the phones would start to &#39;beacon&#39; over Bluetooth at either eight- or 16-second intervals,&#34; co-founder Ken Munro said.\n  &#34;Our tests showed that this did not appear to affect the beaconing, whether the phones had encountered each other for the first time or subsequently been physically moved out and then back into range.&#34;\n A second company, Reincubate, found the app would sometimes &#34;go quiet&#34; when run undisturbed in the background for more than 90 minutes but suggested this should not be too big an issue in real-world conditions.\n &#34;A number of reasonable factors can trigger this window being extended, including other use of Bluetooth, the presence of Android devices and the effectiveness of notifications [asking the user to reopen the app],&#34;  it blogged.\n &#34;In our tests, the iOS devices we&#39;ve run the app on have continued to keep the background service running overnight.&#34;\n There will be further scrutiny of the app now  the source code has been published to Github, allowing others to see how the workarounds were achieved.\n     Earlier this week, the Joint Human Rights Committee heard evidence that despite the app anonymising users&#39; identities, they could in theory be re-identified, which might allow the authorities - or even hackers - to reveal people&#39;s social circles for other purposes.\n And the committee said a new watchdog should be created to oversee use of the app and the measures taken to keep the data safe.\n  Harriet Harman, who chairs the committee, said: &#34;Assurances from ministers about privacy are not enough.\n &#34;There must be robust legal protection for individuals about what that data will be used for, who will have access to it, and how it will be safeguarded from hacking.&#34;\n Critics say a decentralised approach - where contact-matching happens on handsets - would better protect users&#39; privacy.\n And BBC News has been told members of an ethics group advising NHSX on the app are calling for it to better explain the advantages of a centralised system.\n  Prof Christophe Fraser- an epidemiologist advising NHSX - told BBC News the two main benefits were:\n it made it possible to ask people to self-diagnose rather than wait for test results, because any mass attempt to abuse the process could be detected\n the collected data could be used to fine-tune the system to deliver different kinds of alerts depending on the risk scores calculated\n  And analysis of how the app was being used in the Isle of Wight would inform decisions on how best to proceed.\n    &#34;Figuring out how we can find the optimal system that trades off these different requirements is a bit of an open question at this stage.&#34;", "posttime": "2020-05-08 18:00:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "代码,冠状病毒,coronavirus,app,病毒", "title": "冠状病毒：NHS公布接触者追踪应用背后的源代码", "title_en": "Coronavirus: NHS Reveals Source Code Behind Contact-Tracing App", "transed": 1, "url": "https://www.bbc.com/news/technology-52579547", "via": "", "real_tags": ["代码", "冠状病毒", "app", "病毒"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001233, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "网络工作组S.BradnerRequest征求意见：2119哈佛大学BCP：1997年3月14日类别：RFC中用于指示要求级别的最佳当前实践关键字本备忘录的状态本文档指定了Internet社区的Internet最佳当前实践，并请求讨论和提出改进建议。这份备忘录的分发是不受限制的。在许多标准跟踪文件中，使用了几个词来表示规范中的要求。这些词通常是大写的。本文档定义了这些词，因为它们应该在IETF文档中解释。遵循这些准则的作者应在其文档开头附近加入此短语：关键词&#34；必须&#34；，&#34；不得要求&#34；，&#34；不得&#34；，&#34；不得&#34；，&#34；不应&#34；，&#34；不应&#34；，&#34；推荐&#34；，&#34；和&#34；，&#34；和&#34；，&#34；和&#34；，&#34；不应&#34；，&#34；不应&#34；，&#34；推荐&#34；，&#34；和&#34；，&#34；和&#34；，&#34；本文档中的内容将按照RFC 2119中所述进行解释。请注意，这些单词的力度会根据使用它们的文档的要求级别进行修改。此词或所要求的术语或术语是否意味着该定义是本规范的绝对要求。该短语或短语不应意味着该定义是对该规范的绝对禁止。3.这一短语或短语不应意味着该定义是对该规范的绝对禁止。3.这一短语或短语不应意味着该定义是对该规范的绝对禁止。如果这个词或形容词推荐的意思是，在特定情况下可能存在合理的理由忽略某一特定项目，但在选择不同的路线之前，必须理解并仔细权衡其全部含义。这个短语或短语“不推荐”是否意味着在特定情况下，当特定行为是可接受的甚至是有用的时，可能存在合理的理由，但是在实施任何使用此标签描述的行为之前，应该理解全部含义并仔细权衡案例。布拉德纳最佳当前实践[第1页]RFC2119RFC关键词19975。也许这个词或形容词“可选”表示某一项目确实是可选的。一个供应商可能选择包含该项目，因为特定的市场需要它，或者因为该供应商认为它增强了产品，而另一个供应商可能省略了相同的项目。不包括特定选项的实现必须准备好与包含该选项的另一个实现进行互操作，尽管功能可能有所减少。同样，包含特定选项的实现必须准备好与不包括该选项的另一个实现进行互操作(当然，该选项提供的功能除外)。6.使用本备忘录中定义的类型的这些强制性命令的指导必须谨慎而谨慎地使用。具体地说，它们只能在互操作实际需要的地方使用，或者限制可能造成伤害的行为(例如，限制再传输)，例如，在互操作性不需要特定方法的情况下，它们不能被用来试图将特定方法强加给实施者。安全注意事项这些术语通常用于指定具有安全隐患的行为。不实现必须或应该实现的内容，或者做规范中规定不能或不应该做的事情，对安全性的影响可能非常微妙。文档作者应该花时间详细说明不遵循建议或要求的安全影响，因为大多数实现者不会从产生规范的经验和讨论中获益。8.文档作者应该花时间详细说明不遵循建议或要求的安全影响，因为大多数实现人员不会从产生规范的经验和讨论中获益。这些术语的定义是取自多个RFC的定义的混合体。此外，包括罗伯特·乌尔曼、托马斯·纳滕、尼尔·麦克伯内特和罗伯特·埃尔兹在内的一些人的建议也被纳入其中。布拉德纳最佳当前实践[第2页]RFC2119RFC关键词19979。作者地址斯科特·布拉德纳，哈佛大学，马萨诸塞州1350。艾夫。马萨诸塞州剑桥市02138电话：+1 6174953864电子邮件：sob@atherard.eduBradner最佳当前实践[第3页]", "note_en": "Network Working Group S. BradnerRequest for Comments: 2119 Harvard UniversityBCP: 14 March 1997Category: Best Current Practice Key words for use in RFCs to Indicate Requirement LevelsStatus of this Memo This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements. Distribution of this memo is unlimited.Abstract In many standards track documents several words are used to signify the requirements in the specification. These words are often capitalized. This document defines these words as they should be interpreted in IETF documents. Authors who follow these guidelines should incorporate this phrase near the beginning of their document: The key words &#34;MUST&#34;, &#34;MUST NOT&#34;, &#34;REQUIRED&#34;, &#34;SHALL&#34;, &#34;SHALL NOT&#34;, &#34;SHOULD&#34;, &#34;SHOULD NOT&#34;, &#34;RECOMMENDED&#34;, &#34;MAY&#34;, and &#34;OPTIONAL&#34; in this document are to be interpreted as described in RFC 2119. Note that the force of these words is modified by the requirement level of the document in which they are used.1. MUST This word, or the terms &#34;REQUIRED&#34; or &#34;SHALL&#34;, mean that the definition is an absolute requirement of the specification.2. MUST NOT This phrase, or the phrase &#34;SHALL NOT&#34;, mean that the definition is an absolute prohibition of the specification.3. SHOULD This word, or the adjective &#34;RECOMMENDED&#34;, mean that there may exist valid reasons in particular circumstances to ignore a particular item, but the full implications must be understood and carefully weighed before choosing a different course.4. SHOULD NOT This phrase, or the phrase &#34;NOT RECOMMENDED&#34; mean that there may exist valid reasons in particular circumstances when the particular behavior is acceptable or even useful, but the full implications should be understood and the case carefully weighed before implementing any behavior described with this label.Bradner Best Current Practice [Page 1]\fRFC 2119 RFC Key Words March 19975. MAY This word, or the adjective &#34;OPTIONAL&#34;, mean that an item is truly optional. One vendor may choose to include the item because a particular marketplace requires it or because the vendor feels that it enhances the product while another vendor may omit the same item. An implementation which does not include a particular option MUST be prepared to interoperate with another implementation which does include the option, though perhaps with reduced functionality. In the same vein an implementation which does include a particular option MUST be prepared to interoperate with another implementation which does not include the option (except, of course, for the feature the option provides.)6. Guidance in the use of these Imperatives Imperatives of the type defined in this memo must be used with care and sparingly. In particular, they MUST only be used where it is actually required for interoperation or to limit behavior which has potential for causing harm (e.g., limiting retransmisssions) For example, they must not be used to try to impose a particular method on implementors where the method is not required for interoperability.7. Security Considerations These terms are frequently used to specify behavior with security implications. The effects on security of not implementing a MUST or SHOULD, or doing something the specification says MUST NOT or SHOULD NOT be done may be very subtle. Document authors should take the time to elaborate the security implications of not following recommendations or requirements as most implementors will not have had the benefit of the experience and discussion that produced the specification.8. Acknowledgments The definitions of these terms are an amalgam of definitions taken from a number of RFCs. In addition, suggestions have been incorporated from a number of people including Robert Ullmann, Thomas Narten, Neal McBurnett, and Robert Elz.Bradner Best Current Practice [Page 2]\fRFC 2119 RFC Key Words March 19979. Author&#39;s Address Scott Bradner Harvard University 1350 Mass. Ave. Cambridge, MA 02138 phone - +1 617 495 3864 email - sob@harvard.eduBradner Best Current Practice [Page 3]", "posttime": "2020-05-08 17:15:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "级别,words,可能", "title": "RFC中用于指示需求级别的关键字", "title_en": "Key Words for Use in RFCs to Indicate Requirement Levels", "transed": 1, "url": "https://www.ietf.org/rfc/rfc2119.txt", "via": "", "real_tags": ["级别", "words", "可能"]}, {"category": "", "categoryclass": "", "imagename": "519cc4b75613b33725722b8dd3f77661.jpg", "infoid": 1001232, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "。使用NoSQL和半结构化数据库有很好的理由。而且也有很多错误和迷思。如果人们因为错误的原因从RDBMS迁移到NoSQL，他们会有一个糟糕的体验，这最终是当之无愧的NoSQL声誉。这些神话被一些没有学习SQL和关系数据库的数据库新手打破了。而且，他们并没有学习数据建模的基础知识，也没有学习SQL语言处理数据集的能力，而是认为他们发明了下一代持久性…。当他们真正回到RDBMS发明之前的东西时：分层的半结构化数据模型。现在遇到了关系数据库40年前解决的同样问题。这篇博文是关于其中一个神话的。\n这句话我已经读过和听过太多次了。像这样的想法：RDBMS和SQL不能灵活地跟随数据领域的发展。或者：NoSQL数据存储，因为它们在数据结构上很松散，所以更容易添加新属性。错误但不幸的是，向SQL表添加新列是一项代价高昂的操作，因为所有行都必须更新。这里有一些例子(随便举几个例子来说明这个想法是如何在聪明的专家和良好的声誉论坛上广泛传播的)：\nTwitter上的一条评论是：“向JSON添加KVS比更改RDBMS表(尤其是大表)添加新列要容易得多。”\n是的，但他们更多指的是能够将KV添加到JSON中，这比更改RDBMS表(尤其是大型表)来添加新列要容易得多。如果您选择创建一个新的数据库并将数据移动到它上面，那将会以不同的方式影响您的体验。\n关于StackOverflow的一个问题：“与MySQL这样的关系型数据库相比，‘列添加’(模式修改)是NoSQLMongoDB数据库的主要优势吗？”https://stackoverflow.com/questions/17117294/is-column-adding-schema-modification-a-key-advantage-of-a-nosql-mongodb-da/17118853.。他们说这次行动要花几个月的时间！\nMedium上的一篇文章：“在RDBMS中添加新列的迁移不需要DynamoDB的这种扫描和更新风格的迁移”https://medium.com/serverless-transformation/how-to-remain-agile-with-dynamodb-eca44ff9817.。\n这些只是一些例子。人们都听到了。人们会重复它。人们相信这一点。而且他们不做测试。而且他们不会学习。它们不会与文档交叉核对。他们不使用当前数据库进行测试。当这件事这么容易做到的时候。\n实际上，在主要的现代关系数据库中，添加列是一种快速操作。我会创建一张桌子。检查一下尺寸。然后在没有默认值的情况下添加一个可以为空的列。检查一下尺寸。然后添加具有默认值的列。再检查一下尺寸。大小保持不变意味着不更新任何行。当然，您可以进一步测试：查看大型表上运行的时间、读取的数量以及生成的重做/WAL，…。您将在当前主要的RDBMS中看不到任何内容。然后实际更新所有行并进行比较。在那里，您将看到大小、时间、读取和写入，并了解使用显式UPDATE时，行实际上是更新的。但不是用DDL来添加一列。\n@PostgreSQL在添加列方面也非常聪明：不接触元组。即使向现有元组添加值，大小也不会改变：pic.twitter.com/FT2H7KuLIp。\n您的甲骨文体验是什么时候？添加一个可为空的列一直是(至少从24年前的Oracle7开始)。与12c(7年前)以来的NOT NULL列(默认)相同：pic.twitter.com/pmoPFX9Q7o。\n是的，我甚至在Oracle7中进行了测试，当时，添加一个带有默认值的非空列实际上扫描了表。有了视图，解决方法很容易。添加一个可为空的列(这就是您在NoSQL中所做的)已经是一项快速的操作，那是40年前的事了！\n看起来我使用的表对于dbfiddle来说太大了，但是我已经在我的笔记本电脑上运行了同样的表：\n1&gt；Set Statistics time on；2&gt；go 1&gt；create table demo(X Numeric)；2&gt；go SQL Server解析和编译时间：CPU时间=0毫秒，运行时间=0毫秒。SQL Server执行时间：CPU时间=2毫秒，运行时间=2毫秒。1&gt；，Q为(选择42 x联合全部选择42)2&gt；插入到演示3中&gt；s Join Qj交叉联接Qk交叉联接Ql交叉联接Qm交叉联接Qn交叉联接Qo交叉联接Qp交叉联接Qr交叉联接Qs交叉联接Qt交叉联接Qu；4&gt；Go SQL Server解析和编译时间：CPU时间=11ms，运行时间=12ms。SQL Server执行时间：CPU时间=2374毫秒，运行时间=2148毫秒。(1048576行受影响)1&gt；ALTER TABLE DEMO ADD B NUMBERIC；2&gt；执行SQL Server解析和编译时间：CPU时间=0毫秒，运行时间=0毫秒。SQL Server执行时间：CPU时间=0毫秒，运行时间=3毫秒。1&gt；ALTER TABLE DEMO ADD C NUMBERIC DEFAULT 42 NOT NULL；2&gT；GO SQL Server解析和编译时间：CPU时间=0毫秒，运行时间=0毫秒。SQL Server执行时间：CPU时间=1毫秒，运行时间=2毫秒。2&gt；执行SQL Server解析和编译时间：CPU时间=0毫秒，运行时间=0毫秒。x b c-42 null 42(3行受影响)SQL Server执行时间：CPU时间=0毫秒，运行时间=0毫秒。3&gt；执行SQL Server解析和编译时间：CPU时间=0毫秒，运行时间=0毫秒。SQL Server执行时间：CPU时间=3768毫秒，运行时间=3826毫秒。(1048576行受影响)。\n2毫秒，用于添加在所有百万行上都可见的具有值的列(并且可能更多)。\n在分布式数据库中，必须在所有节点中更新元数据，但无论表大小如何，这仍以毫秒为单位：\n我没有使用非空值和默认值显示测试，因为我遇到了一个问题(添加列速度很快，但是没有选择默认值)。我没有最新版本(YuaByte DB是开源的，正在积极开发中)，这个问题可能会被修复。\nTibero是一个与Oracle具有非常高兼容性的数据库。我运行过相同的SQL。但此版本6似乎与Oracle 11兼容，在Oracle 11中，使用DEFAULT添加非空列必须更新所有行：\n--CTAS CTE交叉连接是我发现创建一百万行CREATE TABLE DEMO的最好方法(选择42 x Union ALL SELECT 42)从Q中选择42 x a交叉连接Q b交叉连接Q c交叉连接Q d交叉连接Q e交叉连接Q f交叉连接Q g交叉连接Q h交叉连接Q i交叉连接Q j交叉连接Q k交叉连接Q l交叉连接Q m交叉连接Q n交叉连接Q o交叉连接Q p交叉连接Q r交叉连接Q s交叉。--检查添加一列的时间ALTER TABLE DEMO ADD ADD b NUMBERIC；--检查具有为所有现有行设置的值的列的时间ALTER TABLE DEMO ADD C NUMERIC DEFAULT 42 NOT NULL；--检查所有行是否显示此值SELECT*FROM DORDER BY x FETCH前3行；--与真正更新所有行更新演示集c=42的时间进行比较；\n请不要犹豫评论这篇博客文章或下面的推文和你的结果：\n如果我再一次听说NoSQL半结构化数据存储比RDBMS更敏捷，我会写一篇关于SQL add column和Codd规则#9的博客文章。\n这个神话来自一些数据库的旧版本，它们没有实现ALTER TABLE。以最佳方式添加。而NoSQL的发明者可能只知道MySQL，它在这一领域起步较晚。谁说MySQL EVERVATION因被甲骨文收购而蒙受损失？它们缩小了与其他数据库的差距，比如本专栏增加了优化。\n如果您继续使用这些过时的知识，您可能会认为使用半结构化集合的NoSQL更敏捷，对吗？是的，当然，您可以在插入新项目时添加新属性。它是零成本的，而且你不需要向任何人申报。但是，对于我在所有这些SQL数据库中测试的第二种情况，您也希望为现有行定义一个值，那该怎么办呢？正如我们已经看到的，SQL通过DEFAULT子句允许这样做。在NoSQL中，您必须扫描和更新所有项目。或者您需要在应用程序中实现一些逻辑，比如“If null则value”。这根本不是敏捷的：作为新功能的副作用，您需要更改所有数据或所有代码。\n关系数据库使用逻辑视图封装物理存储。除此之外，当现有应用程序代码演变时，此逻辑视图可保护现有应用程序代码。这条E.F代码规则编号9：逻辑数据独立性。您可以向结构传递声明性更改，而无需修改任何过程代码或存储的数据。现在，谁是敏捷的呢？\n它怎麽工作?。RDBMS字典保存有关行结构的信息，这不仅仅是简单的列名和数据类型。此处定义了默认值，这就是添加列是立即列的原因。这只是元数据的更新。它不涉及任何现有数据：性能。它向应用程序展示了一个虚拟视图：敏捷性。使用Oracle，您甚至可以将这些视图版本化并无中断地将它们交付给应用程序。这称为基于版本的重定义。\n在RDBMS字典中还有其他聪明的东西。例如，当我添加一个具有NOT NULL属性的列时，这个断言是可以保证的。我不需要任何代码来检查值是否已设置。约束也是如此：中央字典中的一个声明使所有代码都更安全、更简单，因为断言不需要额外的测试就能得到保证。无需检查数据质量，因为它是由设计强制执行的。如果没有它，您需要在代码中添加多少理智假设，以确保错误数据不会破坏周围的一切？我们已经看到添加一个列，但是想一想更简单的事情。在IT领域，命名是最重要的。允许自己认识到自己犯了一个错误，或者某些业务概念发生了变化，并将列的名称修改为更有意义的名称。这很容易做到，即使是为了保持与以前代码的兼容性。更改大型JSON项集合中的属性名并不那么容易。\n让我引用CERN在1982年决定将Oracle用于LEP(大型强子对撞机的祖先)的原因：Oracle是LEP的数据库管理系统：“关系系统将复杂的数据结构转换为易于可视化的简单二维表。这些系统是为预先计划困难的应用而设计的(…)。“。\n不需要预先计划…。这不就是20世纪词语对敏捷的定义吗？\n另一本澄清某些谬论的好读物：E.F.Codd著的“关系数据库：生产力的实用基础”关系数据库解决的一些问题是“程序员对数据的(逻辑)视图和(存储中的)数据的(物理)表示之间缺乏区别”，“数据描述中的后续更改”迫使代码更改，以及由于缺乏集合处理，“程序员被迫按照迭代循环进行思考和编码”。谁说SQL和连接很慢？您的迭代循环是否比散列连接、嵌套循环和排序合并连接更智能？\n我不是说NoSQL是好是坏，是好是坏。只有当决定是基于神话而不是事实时，这才是糟糕的。如果您想要数据域结构上的敏捷性，请保持关系。如果您希望允许任何未来的查询模式，请保持关系。但是，也有一些用例可以放在关系数据库中，但也可能受益于另一个在键值查找中具有最佳性能的引擎。我看到过充满会话状态的表，其中有一个主键(用户或会话ID)和一个包含一些数据的原始列，这些数据只对一个应用程序模块(登录服务)有意义，没有持久的目的。如果您处理物理模型(您不希望在具有许多并发登录的上下文中聚集这些行)，那么它们在SQL表中是可以接受的。但是键值可能更合适。我们仍然看到具有LONG数据类型的Oracle表。如果您喜欢这样，您可能需要一个键值NoSQL。数据库可以存储文档，但这是奢侈品。他们受益于一致的备份和高可用性，但代价是运行一个非常大且不断增长的数据库。时间序列或图表不容易存储在关系表中。像AWS DynamoDB这样的NoSQL数据库对于这些特定的使用案例非常有效。但这是从设计中知道所有访问模式的时候。如果您了解您的数据结构，并且无法预测所有查询，那么关系数据库系统(这意味着不仅仅是一个简单的数据存储)和SQL(按集合操作数据的第四代声明性语言)仍然是敏捷性的最佳选择。", "note_en": ". There are good reasons for NoSQL and semi-structured databases. And there are also many mistakes and myths. If people move from RDBMS to NoSQL because of wrong reasons, they will have a bad experience and this finally deserves NoSQL reputation. Those myths were settled by some database newbies who didn’t learn SQL and relational databases. And, rather than learning the basics of data modeling, and capabilities of SQL for data sets processing, they thought they had invented the next generation of persistence… when they actually came back to what was there before the invention of RDBMS: a hierarchical semi-structured data model. And now encountering the same problem that the relational database solved 40 years ago. This blog post is about one of those myths.\n  I have read and heard that too many times. Ideas like: RDBMS and SQL are not agile to follow with the evolution of the data domain. Or: NoSQL data stores, because they are loose on the data structure, makes it easier to add new attributes. The wrong, but unfortunately common, idea is that adding a new column to a SQL table is an expensive operation because all rows must be updated. Here are some examples (just taking random examples to show how this idea is widely spread even with smart experts and good reputation forums):\n A comment on twitter: “add KVs to JSON is so dramatically easier than altering an RDBMS table, especially a large one, to add a new column”\n Right, but what they are more referring to is being able to add KVs to JSON is so dramatically easier than altering an RDBMS table, especially a large one, to add a new column. If you choose to create a new one and move the data over that sucks in a different way.\n  A question on StackOverflow: “Is ‘column-adding’ (schema modification) a key advantage of a NoSQL (mongodb) database over a RDBMS like MySQL”  https://stackoverflow.com/questions/17117294/is-column-adding-schema-modification-a-key-advantage-of-a-nosql-mongodb-da/17118853. They are talking about months for this operation!\n An article on Medium: “A migration which would add a new column in RDBMS doesn’t require this Scan and Update style migration for DynamoDB”  https://medium.com/serverless-transformation/how-to-remain-agile-with-dynamodb-eca44ff9817.\n Those are just examples. People hear it. People repeat it. People believe it. And they don’t test. And they don’t learn. They do not crosscheck with documentation. They do not test with their current database. When it is so easy to do.\n  Actually, adding a column is a fast operation in the major modern relational databases. I’ll create a table. Check the size. Then add a nullable column without default. Check the size. Then add a column with a default value. Check the size again. Size staying the same means no rows updated. Of course, you can test further: look at the elapsed time on a large table, and the amount of reads, and the redo/WAL generated,… You will see nothing in the major current RDBMS. Then you actually update all rows and compare. There you will see the size, the time, the reads, and the writes and understand that, with an explicit update the rows are actually updated. But not with the DDL to add a column.\n    And  @postgresql is also very smart about adding columns: does not touch the tuples. size doesn&#39;t change even when adding a value to existing tuples:  pic.twitter.com/FT2H7KuLIp\n     When was your Oracle experience? It has always (at least since Oracle7, 24 years ago) been immediate to add a nullable column. Same with not null columns (with default) since 12c (7 years ago):  pic.twitter.com/pmoPFX9Q7o\n  Yes, I even tested in Oracle7 where, at that time, adding a not null column with a default value actually scanned the table. The workaround is easy with a view. Adding a nullable column (which is what you do in NoSQL) was already a fast operation, and that’s 40 years ago!\n     It seems that the table I use is too large for dbfiddle but I’ve run the same on my laptop:\n 1&gt; set statistics time on;\r2&gt; go\r\r1&gt; create table demo (x numeric);\r2&gt; go\rSQL Server parse and compile time:\r CPU time = 0 ms, elapsed time = 0 ms.\r\r SQL Server Execution Times:\r CPU time = 2 ms, elapsed time = 2 ms.\r\r1&gt; with q as (select 42 x union all select 42)\r2&gt; insert into demo\r3&gt; s join q j cross join q k cross join q l cross join q m cross join q n cross join q o cross join q p cross join q r cross join q s cross join q t cross join q u;\r4&gt; go\rSQL Server parse and compile time:\r CPU time = 11 ms, elapsed time = 12 ms.\r\r SQL Server Execution Times:\r CPU time = 2374 ms, elapsed time = 2148 ms.\r\r(1048576 rows affected)\r\r1&gt; alter table demo add b numeric ;\r2&gt; go\rSQL Server parse and compile time:\r CPU time = 0 ms, elapsed time = 0 ms.\r\r SQL Server Execution Times:\r CPU time = 0 ms, elapsed time = 3 ms.\r\r1&gt; alter table demo add c numeric default 42 not null;\r2&gt; go\rSQL Server parse and compile time:\r CPU time = 0 ms, elapsed time = 0 ms.\r\r SQL Server Execution Times:\r CPU time = 1 ms, elapsed time = 2 ms.\r\r2&gt; go\rSQL Server parse and compile time:\r CPU time = 0 ms, elapsed time = 0 ms.\rx b c\r-------------------- -------------------- --------------------\r 42 NULL 42\r 42 NULL 42\r 42 NULL 42\r\r(3 rows affected)\r\r SQL Server Execution Times:\r CPU time = 0 ms, elapsed time = 0 ms.\r\r3&gt; go\rSQL Server parse and compile time:\r CPU time = 0 ms, elapsed time = 0 ms.\r\r SQL Server Execution Times:\r CPU time = 3768 ms, elapsed time = 3826 ms.\r\r(1048576 rows affected)\n 2 milliseconds for adding a column with a value, visible on all those million rows (and it can be more).\n  In a distributed database, metadata must be updated in all nodes, but this is still in milliseconds whatever the table size is:\n I didn’t show the test with not null and default value as I encountered an issue (adding column is fast but default value not selected). I don’t have the latest version (YugaByte DB is open source and in very active development) and this is probably an issue going to be fixed.\n  Tibero is a database with very high compatibility with Oracle. I’ve run the same SQL. But this version 6 seems to be compatible with Oracle 11 where adding a non null column with default had to update all rows:\n  -- CTAS CTE Cross Join is the most cross-RDBMS I&#39;ve found to create one million rows\rcreate table demo as with q as (select 42 x union all select 42) select 42 x from q a cross join q b cross join q c cross join q d cross join q e cross join q f cross join q g cross join q h cross join q i cross join q j cross join q k cross join q l cross join q m cross join q n cross join q o cross join q p cross join q r cross join q s cross join q t cross join q u;\r-- check the time to add a column\ralter table demo add b numeric ;\r-- check the time for a column with a value set for all existing rows\ralter table demo add c numeric default 42 not null;\r-- check that all rows show this value\rselect * from demo order by x fetch first 3 rows only;\r-- compare with the time to really update all rows\rupdate demo set c=42;\n and please don’t hesitate to comment this blog post or the following tweet with you results:\n If I hear one more time that NoSQL semi-structured data stores are more agile than RDBMS I write a blog post about SQL add column and Codd rule #9.\n   The myth comes from old versions of some databases that did no implement the ALTER TABLE .. ADD in an optimal way. And the NoSQL inventors probably knew only MySQL which was late in this area. Who said that MySQL evolution suffered from its acquisition by Oracle? They reduce the gap with other databases, like with this column adding optimisation.\n If you stay with this outdated knowledge, you may think that NoSQL with semi-structured collections is more Agile, right? Yes, of course, you can add a new attribute when inserting a new item. It has zero cost and you don’t have to declare it to anyone. But what about the second case I tested in all those SQL databases, where you want to define a value for the existing rows as well? As we have seen, SQL allows that with a DEFAULT clause. In NoSQL you have to scan and update all items. Or you need to implement some logic in the application, like “if null then value”. That is not agile at all: as a side effect of a new feature, you need to change all data or all code.\n Relational databases encapsulate the physical storage with a logical view. And in addition to that this logical view protects the existing application code when it evolves. This E.F Codd rule number 9: Logical Data Independence. You can deliver declarative changes to your structures without modifying any procedural code or stored data. Now, who is agile?\n  How does it work? The RDBMS dictionary holds information about the structure of the rows, and this goes beyond a simple column name and datatype. The default value is defined here, which is why the ADD column was immediate. This is just an update of metadata. It doesn’t touch any existing data: performance. It exposes a virtual view to the application: agility. With Oracle, you can even version those views and deliver them to the application without interruption. This is called Edition Based Redefinition.\n There are other smart things in the RDBMS dictionary. For example, when I add a column with the NOT NULL attribute, this assertion is guaranteed. I don’t need any code to check whether the value is set or not. Same with constraints: one declaration in a central dictionary makes all code safe and simpler because the assertion is guaranteed without additional testing. No need to check for data quality as it is enforced by design. Without it, how many sanity assumptions do you need to add in your code to ensure that erroneous data will not corrupt everything around? We have seen adding a column, but think about something even simple. Naming things is the most important in IT. Allow yourself to realize you made a mistake, or some business concepts change, and modify the name of a column for a more meaningful one. That can be done easily, even with a view to keep compatibility with previous code. Changing an attribute name in a large collection of JSON items is not so easy.\n  Let me quote the reason why CERN decided to use Oracle in 1982 for the LEP – the ancestor of the LHC:  Oracle The Database Management System For LEP: “Relational systems transform complex data structures into simple two-dimensional tables which are easy to visualize. These systems are intended for applications where preplanning is difficult…”\n Preplanning not needed… isn’t that the definition of Agility with 20th century words?\n Another good read to clear some myth:  Relational Database: A Practical Foundation for Productivity by E.F. Codd Some problems that are solved by relational databases are the lack of distinction between “the programmer’s (logical) view of the data and the (physical) representation of data in storage”, the “subsequent changes in data description” forcing code changes, and “programmers were forced to think and code in terms of iterative loops” because of the lack of set processing. Who says that SQL and joins are slow? Are your iterative loops smarter than hash joins, nested loops and sort merge joins?\n  I’m not saying that NoSQL is good or bad or better or worse. It is bad only when the decision is based on myths rather than facts. If you want agility on your data domain structures, stay relational. If you want to allow any future query pattern, stay relational. However, there are also some use cases that can fit in a relational database but may also benefit from another engine with optimal performance in key-value lookups. I have seen tables full of session state with a PRIMARY KEY (user or session ID) and a RAW column containing some data meaningful only for one application module (login service) and without durable purpose. They are acceptable in a SQL table if you take care of the physical model (you don’t want to cluster those rows in a context with many concurrent logins). But a Key-Value may be more suitable. We still see Oracle tables with LONG datatypes. If you like that you probably need a key-value NoSQL. Databases can store documents, but that’s luxury. They benefit from consistent backups and HA but at the prize of operating a very large and growing database. Timeseries, or graphs, are not easy to store in relational tables. NoSQL databases like AWS DynamoDB are very efficient for those specific use cases. But this is when all access patterns are known from design. If you know your data structure and cannot anticipate all queries, then relational databases systems (which means more than a simple data store) and SQL (the 4th generation declarative language to manipulate data by sets) are still the best choice for agility.", "posttime": "2020-05-08 17:14:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rdbms,myth,数据", "title": "NoSQL(与RDBMS)敏捷性的神话", "title_en": "The myth of NoSQL (vs. RDBMS) agility", "transed": 1, "url": "https://blog.dbi-services.com/the-myth-of-nosql-vs-rdbms-agility-adding-attributes/", "via": "", "real_tags": ["rdbms", "myth", "数据"]}]