[{"category": "", "categoryclass": "", "imagename": "9fd6286abe7526a3b5300e46203f7c88.jpg", "infoid": 1008564, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据Crunchbase的数据，上周全球有23轮融资，价值5000万美元。这几轮融资总额为37.2亿美元，中位数为8000万美元，平均规模为1.619亿美元。因此，如果你认为后期资金受到威胁，那就不是了。\n不难看出其中的原因；随着公开市场逼近历史新高，后期初创公司能够在强劲的竞争对手的支持下筹集资金。较高的公开估值有助于后期初创企业捍卫自己的价格，就像不断上涨的股票可以帮助风险投资引导风险投资到初创企业的早期阶段的某些行业一样。\n这也是一种可能导致大量IPO的情况，我们即将看到这种情况。随着Agora本周大获全胜，加上柠檬水(Lemonade)与Acolade、nCino和GoHealth并驾齐驱，一切都在升温。\n本周，交易所和TechCrunch试图更广泛地处理此事，询问有关Lemonade即将进行的公开募股的问题，尽最大努力研究nCino和GoHealth(两家IPO不是来自加州和纽约)的S-1文件，分析Acolade重新启动公开市场后提出的IPO估值，并努力摸索Agora相当稳健的IPO定价。\n但还有更多的事情在发生。在本周的Extra Crunch和TechCrunch节目中，我们还讨论了Lemonade首次公开募股(IPO)的定价(低于之前的估值)和好处(比我们预期的要好)，并讨论了我们很高兴看到未来几个季度和几年上市的众多公司。\n有理由预计，在IPO密度方面，未来会出现更多相同的情况。展望第三季度-现在只有几天了-一些风投预计会有一波软件IPO浪潮，因为许多独角兽公司试图在大选前上市，而估值却超级火爆。\n买方正在为SaaS铺开红地毯！如果第三季度SaaS IPO如潮水般涌现，我不会感到震惊。ZoomInfo是今年的第一次发行，而且只发生在6月份。疯狂地看到6个月的中断(https://t.co/Bg1I3WxgBa是在Zi之前的最后一次)很多被压抑的需求！\n你可以认为今天的公开市场是对去年应该上市、但推迟了的独角兽公司的重做。或者用赛车的术语来说，这是对犯了错误的汽车的免费进站。但是，如果你不出去的时候，得到的是这么好，你还在等什么该死的？这是一个价值数十亿美元的问题。\n让我们来了解一下本周最大的市场消息以及我们对此的感受。一如既往，我们将倾向于私募市场，但当上市科技公司对初创公司至关重要时，我们会谈论它们。\n本周晚些时候，在Snap、Facebook和Twitter交易结束后，社交公司受到了打击，宝洁、联合利华(Unilever)和Verizon*等主要广告商决定，他们实际上可能会关心他们的广告针对的是哪种内容。请记住，这种靠广告赚钱的做法并不新鲜；出版商与这种事情打交道已经有很长一段时间了。然而，随着时间的推移，社交科技公司并没有受到如此多的打击。欢迎来到现实世界，各位。对于初创企业？Facebook和Twitter受到非常公开的打击，这对社交初创公司来说并不是件好事。如果他们这些初创公司想要筹集新的资本，那就是。\nSaaS初创公司-无论是早期还是后期-应该振作起来，因为最近上市的SaaS收益相当不错。有一些失火，但情况本可以更糟。随着SaaS股价再次上涨，现在是成为一家SaaS公司的好时机。对它进行衡量，你可以找到十几家上市的SaaS公司，它们的价值超过了下一年销售额的25倍。这太疯狂了。\n我们正在跟踪的是2020年SaaS投资的速度。到目前为止，从2020年到2020年6月26日，Crunchbase已经为标记为SaaS的公司进行了648轮融资。再看去年同期，是一千一百三十五点。美元从去年同期的121.5亿美元下降到今年的93.6亿美元。现在，那里的风险数据确实滞后了，但尽管如此，这并不完全是我们预期的。也许中端SaaS初创公司正在苦苦挣扎？\nZoox与亚马逊的交易表明，私募市场的自动驾驶在多大程度上超越了现实，对初创企业进行了估值。自动驾驶工程师一度是劳动力市场的摇篮。现在，我们想知道。不过，10亿美元的交易对任何一家公司来说都不是世界末日。对于自动驾驶初创公司来说，这可能标志着该行业繁荣时期的结束，如果我们还没有跨过顶峰，开始长途跋涉走向最低点的话。\n网络安全仍然是炙手可热的热门话题，因为本周Salesforce向安全初创公司Tatil投入了大量资金。钛矿现在价值90亿美元。2019年IPO CrowdStrike作为一家上市公司一直表现优异，同时也让其行业看起来很乐观。其中一些善举可能在这里发挥作用。\n金融科技是个硬汉。优步似乎正在退出金融科技的努力。当然，每家公司迟早都会成为金融科技的公司，但显然不是这样的。CHINE等人，放心吧，优步从之前疯狂的金融科技之战中减速，表明并不是每一家大公司都能在这块特殊的消费者蛋糕上分得一杯羹。\n最后，优秀的凯特·克拉克谈到了初创公司的估值趋势：“根据研究公司PitchBook向The Information提供的数据，今年上半年，C系列或后期融资的估值中值从2019年的8,000万美元升至1.2亿美元的新高。”我们想，现在仍然是个好日子。\n在初创企业、资金和市场领域，有太多可以谈论的东西，但我们不得不到此为止。一旦我们把所有的管道连接起来，这份时事通讯将在每周五出版。所以，继续在这里订阅(100%免费)，这样你就正好错过了零个条目。快点聊吧！", "note_en": "In the last week there were 23 rounds worth $50 million in the world, according to  Crunchbase data. The rounds were worth a total of $3.72 billion, with a median value of $80 million and an average size of $161.9 million. So in case you were under the impression that late-stage money was under threat, it’s not.\n And it’s not hard to see why; with the public markets flirting with new record highs, late-stage startups are able to raise on the back of strong comps. High public valuations help late-stage startups defend their own prices as much as rising stocks can help direct venture investment to certain sectors at the earlier-stages of startup land.\n  It’s also a situation that  can lead to a rash of IPOs, which we’re on the cusp of seeing. With Agora out this week to good effect, and Lemonade in the wings alongside Accolade, nCino, and GoHealth, things are heating up.\n This week The Exchange and TechCrunch more broadly tried to take on the matter,  asking questions about Lemonade’s impending public offering, trying our best  to explore the S-1 filings of nCino and GoHealth (two IPOs  not from California or New York), parsing  Accolade’s proposed IPO valuation after it reignited its march to the public markets, and working to grok Agora’s pretty solid IPO pricing.\n But there was still more going on. Over on Extra Crunch and TechCrunch this week, we also chewed over Lemonade’s first whack at IPO pricing (down from its prior valuation) and what’s good about it (better than we’d expected), and  talked about the host of companies that we are excited about seeing go public over the next few quarters and years.\n  There are reasons to expect more of the same going forward in terms of IPO density. Looking into Q3 — now just days away — there are some VCs who anticipate a tide of software IPOs as many unicorns try to get public before the election, and while valuations are super hot.\n  Buy side is rolling out the red carpet for SaaS! Wouldn&#39;t shock me to see a flood of SaaS IPOs in Q3. Zoominfo was the first offering of the year and it only happened in June. Crazy to see a 6 month hiatus ( https://t.co/Bg1I3WxgBa was last before ZI) Lots of pent up demand!\n You can think of today’s public markets as a do-over for unicorns that should have gone public last year, but put it off. Or in racing terms, it’s a free pit stop for cars that made an error. But if you don’t get out while the getting is this good, what the hell were you waiting for? That’s the multi-billion-dollar question.\n  Let’s catch up on the week’s biggest market news and how we feel about it. As always, we’ll lean toward the private markets but talk about public tech companies when they matter to the startup world.\n Social companies took a hit late in the week after Snap, Facebook, and Twitter fell sharply was trading came to a close, after  major advertisers like P&amp;G, Unilever, and Verizon* decided that they might actually care what sort of content their ads are shown against. Bear in mind that this sort of ad-dollar yanking is  not new; publishers have dealt with this sort of thing for ages. However, social tech companies haven’t taken as many hits from this as they might have over time. Welcome to reality, y’all.  For startups? It’s not great for social startups that Facebook and Twitter are taking very public knocks. If they the startups wanted to raise new capital, that is.\n SaaS startups — early and late-stage alike — should take heart that the  recent spate of public SaaS earnings went pretty ok. There were some misfires, but it could have been worse. And with SaaS shares on the rise again, it’s a lovely time to be a SaaS company. Putting metrics on it, you can find over a dozen public SaaS companies that are worth more than 25x their next year’s sales. That’s insane.\n Something we’re tracking is the pace of SaaS investing in 2020. So far,  Crunchbase has 648 rounds for companies tagged as SaaS in 2020 through June 26, 2020. Looking at the same interval last year, it was 1,135. Dollars are down from $12.15 billion in the year-ago period, to $9.36 billion this year. Now, there  is venture data lag there, but, all the same, it’s not precisely what we expected to see. Perhaps middle-tier SaaS startups are struggling?\n The  Zoox deal with Amazon shows how far private-market self-driving rounds valued startups ahead of reality. At one point self-driving engineers were the unobtanium of the labor market. Now, we wonder.  Still, a $1 billion deal isn’t the end of the world for any company. For self-driving startups, it could mark the end of the good times in the sector, if we hadn’t already crossed the zenith and began a trudge towards its nadir.\n Cybersecurity is still hot hot hot, as this week  Salesforce poured capital into security startup Tanium.  Tanium is now worth $9 billion. 2019 IPO CrowdStrike has been outperforming as a public company, making its sector look rosy at the same time. Some of that beneficence could be at play here.\n Fintech is hard. Uber is  backing out of its fintech push, it appears. Sure, every company is going to be a fintech company of sorts in time, but not, apparently, like this. Chime et al, rest easy,  Uber’s downshift from its formerly frenetic fintech fight indicates that not every major company is going to be able to take a slice of this particular consumer pie.\n And, finally,  the excellent Kate Clark has notes on startup valuation trends: “ The median valuation for Series C or later-stage financings increased to a new high of $120 million in the first half of this year, from $80 million for 2019, according to data provided to The Information by research firm PitchBook.” It’s still good times, we suppose.\n There’s so much more to talk about in the worlds of startups, money and markets, but we have to stop here. This newsletter will come out every Friday once we get all the pipes linked up. So,  go ahead and subscribe here (it’s 100% free) so that you miss precisely zero entries. Chat soon!", "posttime": "2020-06-27 16:20:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,科技,ipo", "title": "\n交易所：首次公开募股季、自动驾驶失火和金融科技的失望", "title_en": "\n\t\t\t\tThe Exchange: IPO season, self-driving misfires and a fintech letdown\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/the-exchange-ipo-season-self-driving-misfires-and-a-fintech-letdown/", "via": "", "real_tags": ["交易", "科技", "ipo"]}, {"category": "", "categoryclass": "", "imagename": "56c30e539bcea85801f02cd3a9512684.jpg", "infoid": 1008562, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "重要的是，这些数据不包括游戏内广告收入(根据Unity的数据，在新冠肺炎停摆期间，游戏广告收入飙升了59%)和消费者之间交易的游戏数字资产市场。对于许多手机游戏公司来说，游戏内的广告是一个有意义的收入来源。根据eMarketer的数据，仅在美国，游戏内广告去年就为行业带来了约30亿美元的收入。\n音乐：2017年620亿美元(300亿美元唱片，60亿美元音乐出版，260亿美元现场音乐)。\n播客：2020年广告收入8.63亿美元(没有关于播客订阅和现场活动收入的良好数据，但可以公平地估计它只占总广告收入的一小部分)。\n在地球上78亿人中，有42亿人(53.6%)有互联网连接，今年将有26.9亿人玩视频游戏，Newzoo预测这一数字将在2023年达到30亿。它将目前游戏玩家的地理分布细分为：", "note_en": "Importantly, the data excludes in-game advertising revenue (which  surged +59% during COVID-19 lockdowns, according to Unity) and the market of gaming digital assets traded between consumers. Advertising within games is a meaningful source of revenue for many mobile gaming companies. In-game ads in just the U.S. drove roughly  $3 billion in industry revenue last year, according to eMarketer.\n  Music:  $62 billion in 2017 ($30 billion recorded music, $6 billion music publishing, $26 billion live music)\n  Podcasting:  $863 million 2020 advertising revenue (there is no good data on subscription and live events revenue in podcasting, but it is fair to estimate it at a fraction of the total ad revenue figure)\n  Of  7.8 billion people on the planet, 4.2 billion ( 53.6%) of whom have internet connectivity, 2.69 billion will play video games this year, and Newzoo predicts that number to reach three billion in 2023. It broke down the current geographic distribution of gamers as:", "posttime": "2020-06-27 16:19:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,游戏,games", "title": "\nNewzoo预测2020年全球游戏产业将达到1590亿美元", "title_en": "\n\t\t\t\tNewzoo forecasts 2020 global games industry will reach $159 billion\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/newzoo-forecasts-2020-global-games-industry-will-reach-159-billion/", "via": "", "real_tags": ["2020", "游戏", "games"]}, {"category": "", "categoryclass": "", "imagename": "ea067ff2db6ee6aee1e84e3322219b07.jpg", "infoid": 1008561, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "首席执行官兼联合创始人纳达夫·肖瓦尔(Nadav Shoval)告诉我，新名称反映的愿景比公司最初的产品-基于位置的消息服务-要宏伟得多，也更雄心勃勃。\n肖瓦尔说：“我们都觉得，现在是为我们实际做的事情感到自豪的时候了。”“这关系到拯救开放的网络。”\n具体地说，Shoval希望将更多的在线对话从Facebook等大型社交平台转移回独立出版商。为了说明这一点，他指出了最近关于重新审查或修改通信正当法第230条的讨论，这是对大型在线平台的关键法律保护。\n虽然你不必把唐纳德·特朗普(Donald Trump)总统对Twitter审查制度的抱怨当真，但肖瓦尔表示，关键是“任何一家大型科技公司都不应该控制对话。”\n为此，该公司还推出了其平台的升级版，包括对特定出版商的整体对话质量进行评分，通过允许用户赚取声誉积分来激励高质量的评论，甚至在评论似乎违反出版商的标准时要求用户重新考虑-openWeb将这些警告描述为“轻推”，因此如果你愿意，你仍然可以继续发布评论。\nOpenWeb产品高级副总裁伊多·戈德伯格(Ido Goldberg)说：“我们不再只专注于算法来识别不良行为，这是我们多年来一直在做的，已经成为商品。”“我们在这里做的是，我们花了很多时间来理解我们应该如何看待数百万次对话的质量和规模。”\n我们谈话和演示的一个重要主题是礼貌--例如，Goldberg向我展示了openWeb的轻推是如何说服一些用户采用不那么煽动性的语言的。但我认为，礼貌并不总是能带来高质量的对话。毕竟，种族主义(以及性别歧视、仇视同性恋和其他令人憎恶的)思想可以用表面上礼貌的语言表达出来。\n“对我们来说，礼貌是底线，”戈德伯格回答说。“当事情变得不文明时，那些想要(进行富有成效的对话)的人就不想去那里了。”\n肖瓦尔补充说，“高质量的对话没有灵丹妙药。”他辩称，openWeb正试图鼓励高质量的对话，而不是被视为“东海岸的左撇子在审查互联网”-它试图通过与每一家出版商合作，并意识到不同地区的不同标准来找到一种平衡。“我们想做的是一段永无止境的旅程。”", "note_en": "CEO and co-founder Nadav Shoval told me that the new name reflects a vision that’s far grander and more ambitious than the company’s initial product, a location-based messaging service.\n “We all felt that this is the time to be proud of what we actually do,” Shoval said. “It’s about saving the open web.”\n  Specifically, Shoval is hoping to move more online conversations away from the big social platforms like Facebook and back to independent publishers. To illustrate this, he pointed to  recent discussions about reexamining or revising Section 230 of the Communications Decency Act, a crucial legal protection for the big online platforms.\n While you don’t have to take  President Donald Trump’s complaints of Twitter censorship at face value, Shoval said the key is that “no one big tech company should control the conversation.”\n To that end, the company has also unveiled an upgraded version of its platform, which includes features like scoring the overall quality of conversation for a specific publisher, incentivizing quality comments by allowing users to earn reputation points and even asking users to reconsider their comment if it appears to violate a publisher’s standards —  OpenWeb   describes these warnings as “nudges,” so you can still go ahead and post that comment if you want.\n  “We stopped focusing only on algorithms to identify bad behavior, which we’ve done for years and have become commodity,” said Ido Goldberg,  OpenWeb’s   senior vice president of product. “What we did here is, we put a lot of time into understanding how we should look at quality and scale in millions of conversations.”\n A big theme in our conversation and demonstration was civility — for example, Goldberg showed me how OpenWeb’s nudges had convinced some users to adopt less incendiary language. But I argued that civility doesn’t always lead to quality conversations. After all, racist (and sexist and homophobic and otherwise hateful) ideas can be  expressed in ostensibly polite language.\n “For us, civility is the baseline,” Goldberg replied. “When things become incivil folks that want to [have a productive conversation] don’t want to be there.”\n Shoval added, “There is no silver bullet for quality conversations.” He argued that OpenWeb is trying to encourage quality conversations without being seen as “East Coast lefties who are censoring the internet” — a balance it tries to find by working with each of its publishers and being aware of different standards in different geographies. “What we want to do is a never-ending journey.”", "posttime": "2020-06-27 16:19:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "平台,platform,对话", "title": "\n评论平台Spot.IM成为OpenWeb", "title_en": "\n\t\t\t\tCommenting platform Spot.IM becomes OpenWeb\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/spot-im-openweb/", "via": "", "real_tags": ["平台", "platform", "对话"]}, {"category": "", "categoryclass": "", "imagename": "5e0a4c47096812912eded55efede5500.png", "infoid": 1008559, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这项和解协议结束了该公司与监管机构之间长达数月的法律战。2019年10月，SEC对Telegram提起诉讼，指控该公司通过出售29亿克筹集资金，为其业务提供资金。SEC试图禁止Telegram交付其出售的克，监管机构声称这些克是证券。今年3月，美国纽约南区地区法院同意SEC的观点，并发布了初步禁令。\n在结束这篇文章时，我想祝所有那些在世界上为权力下放、平衡和平等而奋斗的人好运。你打的是对的仗。这场战斗很可能是我们这一代人中最重要的一场战斗。我们希望你在我们失败的地方取得成功。\n在自己宣布的和解协议中，SEC与杜罗夫对其行动的评估不同。\nSEC执法部网络部门负责人克里斯蒂娜·利特曼(Kristina Littman)在一份声明中表示：“欢迎新的和创新的企业参与我们的资本市场，但它们不能违反联邦证券法的注册要求。”这项和解协议要求Telegram将资金返还给投资者，并施加重大处罚，并要求Telegram就未来的数字发行发出通知。“。\n监管机构的论点是Telegram没有遵守规则。SEC表示，如果它与监管机构合作，而不是在没有任何监督的情况下推出象征性发行，结果可能会有所不同。\n纽约地区办事处(New York Region Office)副地区主任拉拉·沙洛夫·梅拉班(Lara Shalov Mehraban)表示：“我们的紧急行动保护了散户投资者，使其免受Telegram试图在没有提供有关他们项目的全面披露的情况下，以未经注册的方式向市场出售证券的企图。”我们获得的补救措施大大减轻了投资者的负担，并保护散户投资者不受Telegram公司未来非法发售的影响。“", "note_en": "The settlement ends a months long legal battle between the company and the regulator. In October 2019 the SEC  filed a complaint against Telegram alleging the company had raised capital through the sale of 2.9 billion Grams to finance its business. The SEC sought to enjoin Telegram from delivering the Grams it sold, which the regulator alleged were securities. In March, the U.S. District Court for the Southern District of New York agreed with the SEC and issued a preliminary injunction.\n     I want to conclude this post by wishing luck to all those striving for decentralization, balance and equality in the world. You are fighting the right battle. This battle may well be the most important battle of our generation. We hope that you succeed where we have failed.\n In its own announcement of the settlement, the SEC differed with Durov’s assessment of its actions.\n “New and innovative businesses are welcome to participate in our capital markets but they cannot do so in violation of the registration requirements of the federal securities laws,” said Kristina Littman, chief of the SEC Enforcement Division’s Cyber Unit, in a statement. “This settlement requires Telegram to return funds to investors, imposes a significant penalty, and requires Telegram to give notice of future digital offerings.”\n The argument from the regulator is that Telegram didn’t follow the rules. Had it worked with the regulator instead of launching the token offering without any oversight, the outcome might have been different, according to the SEC.\n “Our emergency action protected retail investors from Telegram’s attempt to flood the markets with securities sold in an unregistered offering without providing full disclosures concerning their project,” said Lara Shalov Mehraban, associate regional director of the New York Regional Office. “The remedies we obtained provide significant relief to investors and protect retail investors from future illegal offerings by Telegram.”", "posttime": "2020-06-27 16:18:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "sec,pay,telegram", "title": "\nTelegram将向SEC支付1850万美元的罚款，并在解散Ton时向投资者返还12亿美元", "title_en": "\n\t\t\t\tTelegram to pay SEC fine of $18.5 million and return $1.2 billion to investors as it dissolves TON\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/telegram-to-pay-sec-fine-of-18-5-million-and-return-1-2-billion-to-investors-as-it-dissolves-ton/", "via": "", "real_tags": ["sec", "pay", "telegram"]}, {"category": "", "categoryclass": "", "imagename": "f47d28de4471475e1151d7c12a90157c.jpg", "infoid": 1008558, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Ohanian早在2011年就推出了Initialized Capital，当时有一个700万美元的投资工具。从那时起，这家总部位于旧金山的公司发展迅速，并对Flexport、Insta、Cruise、Coinbase和Codecademy等公司进行了早期押注。最近，它在2018年关闭了一只2.25亿美元的投资工具，这是它迄今的第四只基金。\nOhanian在给TechCrunch的一份声明中表示，Ohanian将离开Initialized Capital，从事“一个新项目，该项目将支持科技界和其他领域的一代创始人”。根据Axios的报道，Ohanian将离开Initialized，以便在种子前的工作中更紧密地合作。在其网站上，初始化了细节，许多与其交谈的团队已经推出了产品，并有赚取收入的计划。\n该公司写道：“我们理解产品和商业模式的演变，但以非常具体的方式看到团队如何能够发货和合作是件好事。”如果奥哈尼安募集到一个预种子基金，看看他将如何改变这一方法将是一件有趣的事情。\n值得一提的是，风险投资领域的合伙人离职很少是明目张胆的分手。正如初始确认的那样，由于法律关系，Ohanian将继续参与公司现有的投资工具和投资组合公司。目前还不清楚奥哈尼安是否会继续留在他所在的任何董事会。Ohanian拥有董事会席位的Ro公司没有立即回复记者的置评请求。\n一个大问题是，奥哈尼安的离开是否会触发该公司有限合伙协议中的关键人物条款。“关键人”条款是有限合伙人协议中的典型条款，它要求某些指定的人(通常是公司的主要合伙人)必须继续受雇于公司，并成为活跃的投资者。当触发关键人条款时，有限合伙人通常有各种工具，从控制新招聘到彻底结束对基金的投资，以保护他们对基金的投资。\n在这种情况下，如果亚历克西斯·奥哈尼安(Alexis Ohanian)不是关键人物，那就太令人惊讶了，因为他是公司的主要普通合伙人之一，也是公司的创始人之一。\n奥哈尼安在2018年放弃了参与Reddit的日常工作，最近在抗议警察暴行后辞去了他在该公司的董事会席位。这位联合创始人敦促Reddit用一名黑人董事会成员填补这个席位。Reddit最终选择了Y Combinator首席执行官迈克尔·塞贝尔来填补这一职位。\n谭恩美是Initialized的另一位创始合伙人，他帮助YC在早期成长，并帮助建立了这家著名的加速器的内部软件系统和后期融资计划。该公司在给TechCrunch的一份声明中写道：“(谭恩美)将继续领导Initialized Capital走向未来，寻找并资助伟大的企业家，就像他近十年来所做的那样。”加里和亚历克西斯作为长期的朋友和商业伙伴保持着彼此的忠诚。公司全力支持亚历克西斯未来的追求。“\nInitialized Capital目前管理着5亿美元的资产，到目前为止已经投资了200多家公司。", "note_en": "Ohanian launched  Initialized Capital   back in 2011 with a $7 million investment vehicle. Since then, the San Francisco-based firm has grown immensely and made early-stage bets in companies like Flexport, Instacart, Cruise, Coinbase and Codecademy. Most recently, it closed a  $225 million investment vehicle in 2018, its fourth fund to date.\n Ohanian is leaving Initialized Capital to work on “a new project that will support a generation of founders in tech and beyond,” the firm said in a statement to TechCrunch. According to the  Axios story, Ohanian is leaving Initialized to work more closely on pre-seed efforts. On its website, Initialized details that many teams it talks to already have launched products and have a plan to earn revenue.\n  “We understand that products and business models evolve, but it’s good to see in a very concrete way how teams are able to ship products and work together,”  the firm wrote. If Ohanian raises a pre-seed fund, it will be interesting to see how he changes this methodology.\n  It’s worth mentioning that partner departures in venture capital are rarely crystal clear break-ups. As Initialized confirmed, Ohanian will remain involved in the firm’s existing investment vehicles and portfolio companies due to legal ties. It is unclear if Ohanian will remain on any board he is on.  Ro,   a company in which Ohanian has a board seat, did not immediately respond to a request for comment.\n One big question is whether Ohanian’s departure would trigger a key-man clause in the firm’s limited partnership agreement. “Key-man” clauses, which are typical in limited partner agreements, require that certain designated people (typically the main partners in a firm) must stay continuously employed at a firm and be active investors. When a key-man clause is triggered, limited partners often have a variety of tools, ranging from control over new hiring to outright ending the investing at a fund, in order to protect their investment in a fund.\n In this case, it would be surprising if  Alexis Ohanian   wasn’t a key man, as he is one of the leading general partners and a founder of the firm.\n Ohanian stepped away from being involved in the day to day of Reddit in 2018, and recently left his board seat at the company following protests against police brutality. The co-founder urged Reddit to fill the seat with a Black board member. Reddit ultimately selected  Y Combinator   CEO Michael Seibel to fill the position.\n Tan, the other founding partner of Initialized, helped YC grow in its early days and helped build the famed accelerator’s internal software system and late-stage funding program. “[Tan] will continue to lead Initialized Capital into the future, finding and funding great entrepreneurs as he has done for nearly a decade,” the firm wrote in a statement to TechCrunch. “Garry and Alexis remain committed to each other as long-standing friends and business partners. The firm fully supports Alexis in his future pursuits.”\n Initialized Capital currently has $500 million assets under management and has backed over 200 companies to date.", "posttime": "2020-06-27 16:18:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "西斯,ohanian", "title": "\n亚历克西斯·奥哈尼安将离开初始化的首都", "title_en": "\n\t\t\t\tAlexis Ohanian is leaving Initialized Capital\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/alexis-ohanian-reddit-co-founder-is-leaving-initialized-capital/", "via": "", "real_tags": ["西斯", "ohanian"]}, {"category": "", "categoryclass": "", "imagename": "f40c997d66ced4bb501d9b8a1fb42c1e.jpg", "infoid": 1008557, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国有线电视新闻网(CNN)众议院民主党人周五批准了一项法案，承认华盛顿特区为一个州，这标志着国会参众两院首次提出了华盛顿特区州地位的措施。\n这项法案是由华盛顿的无投票权的众议院议员德尔提出的。埃莉诺·霍姆斯·诺顿(Eleanor Holmes Norton)将把联邦首都缩小到一小块区域，包括白宫、国会大厦、最高法院和国家广场沿线的其他联邦建筑。这座城市的其余部分将成为第51个州，以废奴主义者弗雷德里克·道格拉斯(Frederick Douglas)的名字命名为华盛顿道格拉斯联邦(Washington，Douglas Federal)。\n该法案以232票对180票获得通过。明尼苏达州众议员科林·彼得森(Collin Peterson)是唯一与共和党人一起投票反对该法案的民主党人。密歇根州独立众议员贾斯汀·阿玛什(Justin Amash)也投了反对票。\n该法案将授予华盛顿两名参议员，并使现有的唯一众议院代表成为有投票权的成员。\n然而，这不太可能在共和党控制的参议院获得支持，白宫本周表示，如果该法案提交给唐纳德·特朗普(Donald Trump)总统，他将否决该法案。\n特朗普在上个月接受“纽约邮报”采访时表示，除非我们有一些非常、非常愚蠢的共和党人，否则华盛顿特区的州地位永远不会发生。\n特朗普在采访中说，华盛顿永远不会是一个州。你是说哥伦比亚特区，一个州？为什么？所以我们可以再有两名民主党参议员和五名国会议员？不用了谢谢。这永远不会发生。\n最近几周，民主党人辩称，在特朗普政府动员联邦执法部门回应有关警察系统种族主义的抗议活动后，建州的必要性从未像现在这样明确。他们对本月早些时候强行驱赶白宫外和平抗议者的决定表示愤怒，这是为了让特朗普在圣约翰教堂拍照。\n华盛顿市长穆里尔·鲍瑟(Muriel Bowser)周四表示，我们不仅没有有投票权的参议员，我们的女众议员也没有投票权，联邦政府的突发奇想甚至可以侵犯我们有限的自治权，而且它可以通过威胁美国各州和所有美国人民的方式做到这一点。让我们反击这样的呼声：我们太自由了，或者我们太黑人了，或者民主党人太多了。我们选谁是我们的事，美国的事是确保每个人在美利坚合众国的众议院和参议院都有充分的代表。\n华盛顿特区成为一个州的支持者还指出，该地区人口众多，超过了怀俄明州和佛蒙特州的人口。据美国人口普查局估计，截至2019年6月，华盛顿有超过70.5万居民。\n该法案的支持者认为，要成为法律，它只需国会参众两院以简单多数通过，然后由总统签署即可。他们说，这项立法调整首都地区大小的战略将绕过宪法关于将华盛顿其他地区变成一个州的问题。但反对华盛顿特区建州的共和党人坚持认为，将该地区添加为一个州将需要修改宪法。\n在众议院就该法案进行辩论期间，北卡罗来纳州共和党众议员格雷戈里·墨菲(Gregory Murphy)主张国会将土地割让回马里兰州，而不是让华盛顿成为自己的州。\n墨菲说，当把华盛顿特区割让回马里兰州是一个可行的、具有成本效益的常识选择时，这一举动根本没有必要。\n佐治亚州共和党众议员乔迪·海斯(Jody Hice)表示，华盛顿特区的建州与公众舆论和宪法背道而驰。\n他声称，这一切实际上都是为了试图再争取两名民主党参议员。\n众议院议长南希·佩洛西(Nancy Pelosi)在她的发言中予以回击：她表示，该地区的州地位关乎对我们民主的尊重。这不仅仅是关于这个地区。它关系到美国人民的民主和我们的美国宪法。", "note_en": "(CNN)House Democrats approved a bill to admit Washington, DC, as a state on Friday, marking the first time either chamber of Congress has advanced a DC statehood measure.\n The bill, introduced by DC&#39;s nonvoting House member, Del. Eleanor Holmes Norton, would shrink the federal capital to a small area encompassing the White House, Capitol building, Supreme Court, and other federal buildings along the National Mall. The rest of the city would become the 51st state, named the Washington, Douglass Commonwealth after abolitionist Frederick Douglass.\n The bill passed with a vote of 232-180. Rep. Collin Peterson of Minnesota was the only Democrat to join Republicans in voting against it. Independent Rep. Justin Amash of Michigan also voted no.\n   The bill would grant DC two senators and make the existing sole House representative a voting member.\n It is unlikely to gain traction in the Republican-held Senate, however, and the White House  said this week that President Donald Trump would veto the bill if it came to his desk.\n  Trump told the New York Post  in an interview last month that DC statehood will &#34;never happen unless we have some very, very stupid Republicans.&#34;\n &#34;DC will never be a state,&#34; Trump said in the interview. &#34;You mean District of Columbia, a state? Why? So we can have two more Democratic -- Democrat senators and five more congressmen? No thank you. That&#39;ll never happen.&#34;\n Democrats in recent weeks have argued the necessity for statehood has never been clearer, after the Trump administration mobilized federal law enforcement to respond to protests about systemic racism in policing. They expressed outrage with the decision to forcibly clear peaceful protesters from outside the White House earlier this month, which was done to allow Trump&#39;s  photo op at St. John&#39;s church.\n &#34;Not only do we not have voting senators and our congresswoman not have the right to vote, the whims of the federal government can encroach on our even limited autonomy, and it can do so in ways that are threats to all of the American states and all of the American people,&#34; Washington Mayor Muriel Bowser said Thursday. &#34;Let&#39;s fight back against the cries that we&#39;re too liberal or we&#39;re too black or there are too many Democrats. Who we elect is our business, and the business of America is to make sure that each person is represented fully in this House and in the Senate of the United States of America.&#34;\n Proponents of making DC a state also point to the area&#39;s large population, which surpasses the populations of Wyoming and Vermont. As of June 2019, DC had more than 705,000 residents, according to estimates from the US  Census Bureau.\n To become law, the bill&#39;s supporters argue it would only have to pass both chambers of Congress with a simple majority and then be signed by the President. They say the legislation&#39;s strategy of resizing the capital area would sidestep constitutional questions about making the rest of DC a state. But Republicans who oppose DC statehood maintain that adding the district as a state would require a constitutional amendment.\n During House floor debate on the bill, Republican Rep. Gregory Murphy of North Carolina argued for Congress to cede the land back to Maryland instead of making DC its own state.\n &#34;The move is simply unnecessary when ceding DC back to Maryland is a viable, cost-effective and common sense option,&#34; Murphy said.\n And Georgia Republican Rep. Jody Hice said DC statehood goes against public opinion and the Constitution.\n &#34;What this is really all about is an attempt to get two more Democratic senators,&#34; he claimed.\n   House Speaker Nancy Pelosi pushed back in her floor remarks: &#34;Statehood for the district is about showing respect for our democracy,&#34; she said. &#34;It&#39;s not just about the district. It&#39;s about democracy for the American people and for our US Constitution.&#34;", "posttime": "2020-06-27 16:17:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "民主党人,democrats,华盛顿", "title": "众议院民主党人通过华盛顿特区建州法案", "title_en": "House Democrats Pass DC Statehood Bill", "transed": 1, "url": "https://www.cnn.com/2020/06/26/politics/dc-statehood-vote-house/index.html", "via": "", "real_tags": ["民主党人", "democrats", "华盛顿"]}, {"category": "", "categoryclass": "", "imagename": "77a6c985df1f5c32d1f56bf832335513.jpeg", "infoid": 1008556, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Lyft已经与司法部就该公司歧视残疾客户的诉讼达成和解。现在，司机将被要求帮助客户折叠和存放轮椅和助行器。拼车公司还被勒令教育司机，并向投诉人支付费用，并处以4万美元的民事罚款。\n司法部的一份声明称，在一名使用可折叠轮椅的原告J.H.报告受到洛杉矶地区Lyft司机的歧视后，司法部开始了调查。J.H.在2015年至2017年期间向Lyft提出了12起投诉，原因是司机拒绝他搭车，称他们要么无法或不愿容纳他的轮椅。和解协议中列出的另外三名投诉人报告了类似的经历。\nLyft将向投诉人支付各种金额的损害赔偿金，其中包括向J.H.支付的3万美元。Lyft已被勒令修改其轮椅政策，规定“司机必须协助存放残疾人使用的可折叠或可折叠的移动设备，如轮椅、滑板车和助行器。”该公司将做出一些改变，以更好地教育司机有关轮椅政策的知识，比如每季度向司机发送有关该政策的提醒，并制作一段关于该政策的新教育视频。在接下来的三年里，Lyft将向司法部提交一年两次的书面报告，说明它为遵守“美国残疾人法案”所做的工作。\n拼车的可及性一直是一个持续关注的问题，也是许多法律斗争的主题。优步因未能容纳残疾乘客而多次被起诉。纽约公共利益律师会(New York Lawers For Public Interest)在2018年进行的一项研究发现，在70%的情况下，优步和Lyft未能在纽约市提供轮椅上可以到达的车辆。", "note_en": "Lyft has  settled with the Justice Department in a lawsuit alleging the company discriminated against customers with disabilities. Now, drivers will be required to help fold and stow wheelchairs and walkers for customers. The rideshare company has also been ordered to educate its drivers as well as pay complainants and a $40,000 civil penalty.\n The Justice Department began an investigation after a complainant identified as J.H. who uses a collapsible wheelchair reported discrimination from Los Angeles-area Lyft drivers, according to a Justice Department  statement. J.H. filed 12 complaints with Lyft between 2015 and 2017 after drivers refused him rides, saying they either could not or would not accommodate his wheelchair. Three other complainants listed in the settlement reported similar experiences.\n  Lyft will pay various amounts in damages to the complainants, including $30,000 to J.H. It’s been ordered to modify its wheelchair policy to specify that “drivers are required to assist with the stowing of foldable or collapsible mobility devices used by individuals with disabilities, such as wheelchairs, scooters, and walkers.” The company will make a few changes to better educate drivers on the wheelchair policy, like sending quarterly reminders of the policy to drivers and creating a new educational video about the policy. For the next three years, Lyft will give the Justice Department biannual written reports on what it’s doing to comply with the Americans with Disabilities Act.\n Accessibility of rideshares has been an ongoing concern and the subject of many legal battles. Uber has been  sued  multiple times for failing to accommodate passengers with disabilities. A 2018  study conducted by the New York Lawyers for Public Interest found that 70 percent of the time, Uber and Lyft failed to provide wheelchair accessible vehicles in New York City.", "posttime": "2020-06-27 16:17:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "司法部,settles,司机", "title": "Lyft与司法部就残疾诉讼达成和解", "title_en": "Lyft Settles With Justice Department Over Disability Lawsuit", "transed": 1, "url": "https://www.engadget.com/lyft-settles-justice-department-disability-lawsuit-172555790.html", "via": "", "real_tags": ["司法部", "settles", "司机"]}, {"category": "", "categoryclass": "", "imagename": "fc7d0e235b5277b1453fea881a85cd2a.jpg", "infoid": 1008555, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然谷歌眼镜作为一种企业产品继续存在，但它从未接近实现谷歌雄心勃勃的取代智能手机的愿景。自那以后，其他公司也进入了智能眼镜领域，诺斯是其中比较引人注目的参与者之一。现在有传言说，在Focals销售不佳后，Alphabet将收购North。\n“环球邮报”今晚报道说，北欧已经进入从Alphabet收购的“最后阶段”。据说谷歌的母公司将支付1.8亿美元收购这家加拿大公司。\n在此之前，North在去年12月停止销售Focals，专注于在2020年的某个时候推出第二代智能眼镜。在过去的几个月里，“Focals 2.0”一直被调侃，诺斯声称它们将是“到目前为止该类别中最重要的产品介绍”。\n“更轻”和“更时尚”的设计将拥有“10倍显示屏”，同时将技术微型化40%。\n在今天的报告中，第一代设备的销量被描述为“微不足道”：\n一位接近销售业务的人士说，北方的销量不太可能超过1000双。它唯一的零售店，位于多伦多和纽约州布鲁克林，经常几天都卖不出去。\n诺斯在2019年初进行了大规模的销售推广，价格从999美元降至599美元。购买Focals需要一个试衣过程，在这个过程中你的脸是3D模型。这个抓取平台最初只在两家实体零售店出售，但North后来转向弹出式位置并通过iPhone扫描。\n在结束销售方面，North一直没有带来任何收入，即使在每月支出削减一半至300万美元后，该公司的资金也在耗尽。尽管承担了额外的投资和贷款，但据说North今年早些时候已经开始寻找买家。\n今天的报道确认Alphabet是收购者。目前还不清楚这是否真的是这样，因为与作为一家独立的Alphabet公司相比，在谷歌的AR&amp；VR部门内，North和Focals更有意义。\n你正在阅读朝九晚五的谷歌新闻，这些专家日复一日地发布关于谷歌及其周边生态系统的新闻。请务必查看我们的主页以获取所有最新新闻，并关注Twitter、Facebook和LinkedIn上的朝九晚五谷歌，随时了解最新消息。不知道从何说起？查看我们的独家故事、评论、操作指南，并订阅我们的YouTube频道", "note_en": "While Glass lives on as an  enterprise product, it never came close to reaching Google’s wildly ambitious vision of replacing the smartphone. Others have since entered the smart glasses space, with North being one of the more notable players. Alphabet is now rumored to be acquiring North after Focals sold poorly.\n  The Globe and Mail this evening reports that North is in the “final stages” of an acquisition from Alphabet. Google’s parent company is said to be paying $180 million for the Canadian company.\n This comes after North in December  stopped selling Focals to focus on launching second-generation smart glasses sometime in 2020. “Focals 2.0” has been teased over the past several months with North claiming that they would be the “most significant product introduction to date in the category.”\n A “lighter” and “sleeker” design would have a “ 10x display,” while miniaturizing the technology by 40%.\n  Sales of the first-generation device are described as “minuscule” in today’s report:\n One person close to the sales operations says it’s unlikely North sold many more than 1,000 pairs. Its only retail stores, in Toronto and Brooklyn, N.Y., often went days without a single sale.\n North made a  major sales push at the start of 2019 with a price cut from $999 to $599. Buying Focals required a fitting process where a 3D model of your face is made. This capture rig was originally only available at two physical retail stores, but North later turned to pop-up locations and scanning via iPhones.\n In ending sales, North has not been bringing in any revenue, and the company is running out of money even after slashing monthly spending in half to $3 million. Despite taking on additional investment and loans, North is said to have started looking for a buyer earlier this year.\n Today’s report identifies Alphabet as the acquirer. It’s not clear if that’s actually the case as North and Focals would make more sense within Google’s AR &amp; VR division rather than as a standalone Alphabet company.\n  You’re reading 9to5Google — experts who break news about Google and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Google on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2020-06-27 16:16:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "alphabet,reportedly,north", "title": "据报道，Alphabet收购了智能眼镜制造商North", "title_en": "Alphabet Reportedly Buying Smart Glasses Maker North", "transed": 1, "url": "https://9to5google.com/2020/06/25/alphabet-north-focals/", "via": "", "real_tags": ["alphabet", "north"]}, {"category": "", "categoryclass": "", "imagename": "aa7f97fe9aa1bcfe83fc7273c752a394.jpeg", "infoid": 1008554, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新冠肺炎摧毁了航空业，各国关闭了边境，禁止除必要旅行外的所有旅行。一个人们可以从一个国家跳到另一个国家的世界，现在是一个空飞机旅行以维护合同义务的世界。包括美国航空(American)、国际航空集团(IAG)、达美航空(Delta)和汉莎航空(Lufthansa)在内的主要航空公司都要求政府救助。\n法航-荷航(Air France-KLM)是一家将获得大量纳税人现金的航空公司，它将获得价值约170亿美元的帮助。这一数字是有条件的，包括这家法国-荷兰企业集团减少二氧化碳排放，并从法国空客(Airbus)购买设备。\n当然，空客是世界上两大飞机制造商之一，另一家是总部位于美国的波音公司。但即使是现在，也不清楚任何数量的现金是否足以看到飞行恢复到2019年的水平。无论我们习惯了什么，在成本、便利性和体验方面，它都会在一段时间内变得不一样。就在上周，国际航空运输协会(IATA)表示，只有45%的被问及的旅行者打算在大流行消退后的几个月内乘坐飞机。\n到目前为止，新冠肺炎最大的受害者可能是空客A380及其所代表的飞行。这架与波音747竞争的“超大型”喷气式飞机旨在提供空中公共交通服务，在其双层客舱内运送来自世界各地的大量乘客，潜在载客量超过850人。这架飞机是波音747的竞争对手，旨在提供空中公共交通服务，在其双层客舱内运送世界各地的大量乘客，潜在容量超过850人。\nA380的研制工作始于90年代初，第一艘船于2007年投入使用，一眼就能辨认出来。与其说是飞机，不如说是公交车，它在主要枢纽机场之间运送人们，在那里他们可以乘坐单通道的飞机到达目的地。航空旅行的想法，追溯到A380的起源，就是你飞到，比如说肯尼迪机场，然后乘坐A380到开普敦，巴黎或上海。\n许多航空公司都有A380，但它已经成为阿联酋航空公司的代名词，阿联酋航空公司的机队中有令人震惊的115架A380飞机。但是，尽管这架飞机相对年轻，刚刚在十多年前发射，但病毒加速了A380的灭亡。空客去年宣布将停止制造这款飞机，据彭博社(Bloomberg)报道，即使是其最大的推动者阿联酋航空公司也不再想要剩余的交付。\n其他航空公司也在砍掉他们的A380，包括法航-荷航(Air France-KLM)，该公司将A380业务的“最终结束”提前了两年。在一份声明中，该航空公司表示，这样做将使其机队更具竞争力，并“显著减少环境足迹”。取而代之的是较小的飞机，如空客A350和波音787梦幻客机。\nBusiness Traveler表示，汉莎航空正在加快淘汰自己的A380飞机，将其超大型客机机队减少一半。同样，澳航也表示，至少在9月份之前，它将在其长途航线上使用较小的单通道飞机-在此之前，其10架A380中有8架将停飞。\n从适航性的角度来看，A380的退役还为时过早-非常为时过早。相比之下，波音公司2013年的一份文件称，其商用飞机的运营寿命约为30年。为飞机提供售后支持的AerSale公司说，“从购买到退役”，一架飞机应该“使用20到36年”。如果A380在2022年之前从天空中消失，它的总寿命甚至不到其潜在寿命的一半。\nA380的问题在于，空客曾寄望于国际旅行的“中心辐射式”模式，但未能发现该计划中的缺陷。从一个枢纽机场跳到一个短途机场，然后再到世界另一端的另一个机场，总会增加旅行的时间。竞争对手波音公司确实注意到了这一点。它朝相反的方向走去。\n早在2002年，波音公司(Boeing)的彼得·拉姆西(Peter Rumsey)，当时的新飞机开发负责人，曾写道，乘客“表现出对耗时较短的航班的偏好”。他补充说，把人们“带到他们想去的地方”是“常识”，而乘客最想要的是更直达的航班。\n当时，拉姆齐正在宣传波音公司的音速巡洋舰概念，这是一种新飞机，具有三角翼编队，巡航速度为0.95马赫(约729MPH)。音速巡洋舰将比现有飞机飞得更高，湍流减少，速度更快。而且，至关重要的是，波音公司的音速巡洋舰不是试图制造一架能容纳800多名乘客的飞机，而是可以运送200到250名乘客。\n音速巡洋舰项目没有幸存下来，9·11事件后的低迷导致人们对该项目的兴趣枯竭。但它的最初精神，以及一些想法，都渗透到了波音的下一款大型新飞机上，尽管远没有那么激进：787梦幻客机(787 Dreamliner)。波音787由轻质复合材料制成，具有更高的内部压力(为了乘客舒适性)，而且比同等大小的竞争对手运行成本低得多。\nA380还存在其他问题。它的巨大规模意味着机场必须对登机口进行特殊改造才能容纳这样一架飞机。这也意味着它需要更大的机组人员和更多的发动机，增加了每次飞行的成本。福布斯的一份报告称，这架A380每小时的飞行成本在2.6万美元至2.9万美元之间。相比之下，梦幻客机的飞行成本接近每小时11,000美元。\n航空公司可能会用空客(Airbus)和波音(Boeing)的较小飞机取代A380，以减少排放，并应对预期乘客数量的下降。在至少一位航空专家的眼中，我们不会看到的是不久的将来会有下一代飞机的消息。\n比尔·布莱恩(Bill Blain)是Shard Capital的市场策略师，专注于飞行业务。他觉得航空业严重误判了市场。“这真是一团糟，”他说，两家公司都在痴迷于制造更大、更宽敞的飞机。布莱恩说，虽然梦幻客机是一架“很棒的飞机”，但更好的选择是一架更小的飞机。\n他认为，航空公司总是想要比更大的747更接近波音737的飞机。波音737是一种窄体飞机，容量在200左右。“如果你(作为一家航空公司)能买到一架能让200人乘坐的经济的小型飞机，”那么你就是黄金航空公司。布莱恩说，波音公司未能妥善地用一架全新的飞机取代波音737飞机导致了悲剧。波音737 Max修改了现有的737设计，导致两起坠机事件，造成346人死亡。\n航空公司将需要为这些提前退休买单，但布莱恩表示，他们不能简单地提高机票价格。后COVID时代的经济可能会陷入衰退，或者至少会受到足够的打击，以至于每个人的资金都很紧张。他说：“(经济中)不会有足够的资金来提高航空公司的价格，航空公司需要座位上的流浪汉。”\n然而，缺少的是能够真正推动航空市场向前发展的下一代进步。布莱恩说，航空公司将购买的飞机，如空客的A320/321和波音的737 Max，使用“旧技术”，燃油效率不是很高，这两样东西都是航空公司渴望的。他补充说，这两家公司都忽视了投资培训新工程师，以取代即将达到退休年龄的有经验的工程师。\n空客和波音拒绝对这篇报道发表评论，但两家公司都有新飞机正在建设中。后者正在研发一种“新型中型飞机”，据报道，该飞机可容纳220至270名乘客。然而，路透社(Reuters)在4月份报道称，在该公司争先恐后地修复波音737 Max的崩溃时，该计划暂停了。\n空客的下一代飞机可能是与劳斯莱斯共同开发的混合动力E-Fan X。但这一倡议在4月份夭折，也就是飞机预计升空的一年前。该公司还在开发三角翼概念车Maveric，机舱更大，但燃料消耗减少了20%。但这还需要几十年的时间才能准备好，如果有的话，而且仍然需要能够在COVID留下的崎岖天空中飞行的飞机。", "note_en": "COVID-19 has shattered the aviation industry, with nations closing their borders and banning all but essential travel. A world where people could hop from country to country is now one where empty planes travel to maintain contractual obligations. Major carriers, including American, IAG, Delta and Lufthansa have all asked for government bailouts.\n One airline that will receive a substantial amount of taxpayer cash is Air France-KLM, which will get around $17 billion worth of help. That figure comes with conditions, including that the Franco-Dutch conglomerate cuts its CO2 emissions and buys gear from the France-based Airbus.\n  Airbus is, of course, one of the world’s two major aircraft manufacturers, the other being the US-based Boeing. But, even now, it’s not clear that any quantity of cash will be enough to see flying return to the levels seen in 2019. Whatever we were used to, in terms of cost, convenience and experience, it’s not going to be the same for a while. Just last week, the International Air Transport Association (IATA) said  that only 45 percent of travelers asked intended to fly “within a few months of the pandemic subsiding.”\n Perhaps the biggest casualty of COVID-19 so far has been the Airbus A380 and the flying it represented. This “superjumbo” jet, competition for the Boeing 747, was designed to offer mass transit in the skies, to convey huge volumes of people around the world in its double-decker cabin and a potential capacity of more than 850.\n Work on the A380 began in the early ‘90s, with the first vessel entering service in 2007, and it’s instantly recognizable. Less a plane and more like a bus, it hauls people between major hub airports, where they get a single-aisle craft to their destination. The idea of air travel, back at the A380’s genesis, was that you’d fly to, say, JFK, and then get an A380 to Cape Town, Paris or Shanghai.\n A number of carriers have A380s, but it’s become synonymous with Emirates, which has a staggering 115 of the craft in its fleet. But despite the plane’s relative youth, launching just over a decade ago, the virus has hastened the A380’s demise. Airbus announced last year it would stop manufacturing the plane, and according to   Bloomberg , even Emirates, its biggest booster, no longer wants its remaining deliveries.\n Other carriers are also swinging the axe on their A380s, including Air France-KLM, which brought forward the “definitive end” of A380 operations by two years. In a statement, the airline said that doing so would make its fleet more competitive, with a “significantly reduced environmental footprint.” In its place would be smaller planes, like Airbus A350s and Boeing 787 Dreamliners.\n Business Traveler said that Lufthansa is speeding up the phase-out of its own A380s, reducing its fleet of the superjumbo by half.  Qantas, similarly, has said it will use smaller single-aisle planes on its long-haul routes until at least September — with eight of its 10 A380s grounded until then.\n From an airworthiness perspective, the A380’s retirement is premature — very premature. For comparison, a Boeing  document from 2013 says the operational lifespan of its commercial aircraft is around 30 years.  AerSale, a company offering aftermarket support for planes, says that “from purchase to retirement,” a plane should last “between 20 and 36 years.” If the A380 disappears from the skies by 2022, it will have lived — in total — for not even half of its potential lifespan.\n The problem with the A380 is that Airbus had banked on a “hub and spoke” model for international travel, but failed to spot the flaw in that plan. Taking a short hop to a hub airport and then on to another on the other side of the world will always add hours to a journey. It’s something that rival Boeing did pick up on. And it went in the opposite direction.\n  Back in 2002, Boeing’s Peter Rumsey, then head of new airplane development,  wrote that passengers “demonstrated a preference for flights that take less time.” He added that it was “common sense” to take people “where they want to go,” and what passengers wanted more than anything else was more direct flights.\n At the time, Rumsey was hyping Boeing’s Sonic Cruiser concept, a new plane with a delta wing formation that would cruise at Mach 0.95 (around 729MPH). The Sonic Cruiser would fly higher than existing planes, with reduced turbulence and faster speeds. And, crucially, rather than trying to build a plane to cater for 800-plus passengers, Boeing’s Sonic Cruiser would transport between 200 and 250.\n The Sonic Cruiser project did not survive, with a post-9/11 slump causing interest in the project to dry up. But its original spirit, and some of the ideas, trickled down to Boeing’s next big, albeit far less radical, new aircraft:  the 787 Dreamliner. The 787 is made of lightweight composite materials, has a higher internal pressure (for passenger comfort) and is far cheaper to run than similarly sized rivals.\n The A380 had other problems, too. Its sheer size meant that airports had to make special alterations to their gates to accommodate such a plane. It also meant that it required larger crews and more engines, increasing the cost of each flight. One   Forbes report said that every hour the A380 was in flight cost between $26,000 and $29,000. A Dreamliner, by comparison, costs closer to $11,000 an hour to fly.\n Airlines will likely replace the A380 with smaller aircraft from Airbus and Boeing to reduce emissions and to deal with a drop in expected passenger numbers. What we won’t see, in the eyes of at least one aviation expert, is news of a next-generation airplane in the near future.\n Bill Blain is a market strategist at Shard Capital with a focus on the business of flying. He feels the aviation industry has badly misjudged the market. “It’s a right bloody mess,” he said, with both companies obsessing over making bigger, more capacious aircraft. Blain said that, while the Dreamliner is a “wonderful plane,” a better bet would have been a smaller plane.\n He believes that airlines were always going to want planes closer to the 737 — a narrow-body plane with a capacity around 200 — than the bigger 747. “If you [as an airline] can get a small plane that you can make economical with 200 people on board,” then you’re golden. Blain said that Boeing’s failure to properly replace the 737 with a brand new aircraft has led to tragedy. The  737 Max, which modified the existing  737 design, led to two crashes that claimed 346 lives.\n Airlines will need to pay for these early retirements, but Blain said they can’t simply raise ticket prices. The post-COVID economy is likely to be in recession or at least stricken enough that money is tight for everyone. “There’s not going to be the money available [in the economy] to hike airline prices, and airlines need bums on seats,” he said.\n What’s missing, however, is a next-generation advance that could really move the aviation market forward. Blain said the planes airlines will buy, like Airbus’ A320/321 and Boeing’s 737 Max, use “old tech” and aren’t very fuel efficient, both things airlines crave. He adds that both companies have neglected to invest in training new engineers to replace the experienced ones who are reaching retirement age.\n Airbus and Boeing declined to comment for this story, but both companies have new aircraft in the works. The latter is working on a “New Midsize Airplane,” which will reportedly seat between 220 and 270  passengers. However,   Reuters reported in April that the program halted while the company scrambles to fix the 737 Max debacle.\n Airbus’ next-generation craft could have been the  hybrid-electric E-Fan X, co-developed with Rolls Royce. But that initiative died in April, a year before the aircraft was expected to take to the skies. The company is also working on a delta-wing concept,  MAVERIC, with a bigger cabin but with a 20 percent reduction in fuel burn. But that won’t be ready for decades, if ever, and there’s still a need for aircraft that can ride the rough skies that COVID leaves behind.", "posttime": "2020-06-27 16:16:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "肺炎,era,飞机", "title": "新冠肺炎扼杀了“大”飞的时代", "title_en": "Covid-19 Killed the Era of 'Big' Flying", "transed": 1, "url": "https://www.engadget.com/covid-19-airplane-design-140024672.html", "via": "", "real_tags": ["肺炎", "era", "飞机"]}, {"category": "", "categoryclass": "", "imagename": "5ab46a42d71d19d2545fe07bcd17232a.jpg", "infoid": 1008553, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周早些时候，在蒂姆·库克所说的“历史性的一天”，苹果公司宣布将Mac电脑从英特尔处理器转移到自己的硅芯片上。第一款搭载苹果芯片的Mac将于2020年底问世，但苹果预计整个过渡过程需要两年时间。\n新的Mac将使用ARM64，这与最近的iOS设备使用的CPU架构相同(基于英特尔的Mac使用一种称为x86-64的架构)。这是一个令人兴奋的举动，因为这意味着他们将能够与为MacOS开发的应用程序一起运行iOS和iPadOS应用程序。但这也意味着，最初为英特尔架构开发的应用程序不能在苹果即将推出的硬件上本地运行。\n这就是Rosetta2的用武之地：它是MacOS Big Sur内置的仿真器，将使ARM Mac能够运行旧的英特尔应用程序。“罗塞塔2”本质上是将为英特尔处理器编写的指令“翻译”成苹果芯片可以理解的命令。开发人员将不需要对他们的旧应用程序进行任何更改；它们只需工作即可。(最初的Rosetta是在2006年发布的，目的是促进苹果从PowerPC向英特尔的过渡。苹果还表示，就操作系统更新而言，它将“在未来几年”支持x86 Mac。该公司在2006年从PowerPC转向英特尔芯片，但在2009年放弃了对前者的支持；OS X Snow Leopard只支持英特尔。)。\n作为用户，您不需要与Rosetta交互；它在幕后工作。软件开发学校App Brewery的创始人安吉拉·于(Angela Yu)表示：“Rosetta 2主要是为了将最终用户购买苹果硅片新Mac时对他们体验的影响降至最低。”如果Rosetta 2完成了它的工作，普通用户应该不会注意到它的存在。\n不过，你可能会感觉到一个不同之处：速度。在原始的Rosetta下运行的程序通常比在Intel上本地运行的程序运行得慢，因为翻译人员需要时间来解释代码。早期的基准测试发现，流行的PowerPC应用程序，如Photoshop和Office，在Intel系统上的运行速度还不到其本机速度的一半。\n我们将拭目以待，看看Rosetta2下的应用程序是否会受到类似的性能影响。但有几个理由值得乐观。首先，原始的Rosetta在执行指令时实时转换每条指令。Rosetta2可以在安装时正确转换应用程序，有效地在打开之前创建应用程序的ARM优化版本。(对于不能提前翻译的应用程序，例如浏览器、Java和Javascript进程，或者如果它在安装时遇到其他未翻译的新代码，它还可以动态翻译。)。有了Rosetta2的前置工作，我们可能会看到翻译后的应用程序有更好的性能。\n演示看起来也很有希望。苹果使用动画软件Maya和1080p版的游戏“古墓丽影”展示了罗塞塔；这两款游戏在主旨演讲中看起来都很实用。\n首先，罗塞塔2并不是一个长期的解决方案。苹果还没有说它会存在多久；与OS X Tiger一起发布的Rosetta在三个版本之后才在OS X Lion上停产。这是一个可以让苹果的过渡期变得更容易的工具，但苹果肯定打算让它的开发者尽早开始使用他们的x86应用程序的ARM原生端口。苹果自己的应用程序，包括Final Cut Pro和Logic，已经在ARM上本地运行。该公司已经发布了内置ARM处理器的开发人员过渡工具包，以帮助应用程序制造商更新和测试他们的软件-该公司在主旨中指出，微软已经在开发Office，Adobe正在开发Creative Cloud。苹果在WWDC主题演讲中展示了原生版本的Word、Excel、PowerPoint、Lightroom CC和Photoshop，以及自己的Final Cut Pro。\n苹果鼓励开发者创建原生应用程序；Rosetta 2被设计为临时解决方案。\n这就是说，苹果公司清楚地知道，并不是所有的开发者都会为第一次ARM发布准备好端口-而且在秋季购买第一款ARM系统的客户将希望立即使用他们最喜欢的程序。罗塞塔2还意味着开发者在第一代ARM Mac问世时不需要争先恐后地重新优化他们的产品。(将MacOS应用程序移植到Apple Silicon的过程超出了本指南的范围，但您可以在Apple开发者网站上找到详细说明。)。\n“改变CPU的语言是一件大事，”Pocket Prep的联合创始人兼首席技术官肯·吉列(Ken Gillette)说。Pocket Prep是一家移动备考公司，已经为苹果的生态系统开发了100多个应用程序。他说：“如果在新电脑投入使用前，每一个应用程序都需要更新，这将是非常困难的。要在短时间内做出改变，需要付出很大的努力。“。\n“(罗塞塔)将使终端用户无缝地购买新的Mac，”吉列说。“如果苹果不这样做，这个过程将痛苦得多，因为消费者每天使用的许多应用程序将从他们全新的机器中消失。”\n另一件需要注意的事情是，引擎也不能支持所有内容。它与一些程序不兼容，包括虚拟机应用程序，你可能会使用这些程序在Mac上运行Windows或其他操作系统，或者在不影响系统其余部分的情况下测试新软件。(您也不能在ARM Mac电脑的Boot Camp模式下运行Windows。微软只授权PC制造商使用ARM版本的Windows 10。)。Rosetta2也不能翻译内核扩展，一些程序利用内核扩展来执行MacOS没有原生功能的任务(类似于Windows中的驱动程序)。\nRosetta 2应该会帮助苹果避免微软在自己的ARM过渡中看到的一些令人头疼的问题。\n第三，即使Rosetta 2功能齐全，ARM Mac可能工作得多好仍是一个悬而未决的问题。在其主题演讲中，苹果强调了其新芯片的效率，声称它们将“为Mac提供业界领先的每瓦性能”。该公司还承诺提供更好的图形体验、机器学习能力和电池续航时间。但它回避了原始功率的问题-因此，尽管ARM Mac可能比它们的英特尔前身更有效率，但它们的功能也可能不那么强大。苹果也没有澄清它是否计划生产自己的新GPU，或者它的CPU是否会与第三方GPU接口。\n在电池续航时间和LTE兼容性方面，我们在Surface Pro X等Windows PC上看到的ARM处理器的表现优于他们的英特尔竞争对手。但我们也遇到了一些ARM PC的性能问题，尽管这至少部分是因为微软用来在ARM上运行x86应用程序的仿真层只能运行32位Windows应用程序(而不是现代的64位x86应用程序)，而且许多32位程序明显比64位程序慢。\n如果一切都像苹果承诺的那样运行，罗塞塔2意味着希望MacOS不会出现这样的混乱局面。", "note_en": "Earlier this week, on what Tim Cook called a “historic day,” Apple announced that it’s moving Macs away from Intel processors to its own silicon chips. The first Mac with Apple silicon is coming by the end of 2020, but Apple expects the full transition process to take two years.\n The new Macs will use arm64, the same CPU architecture that recent iOS devices use (Intel-based Macs use an architecture called x86-64). That’s an exciting move, because it means that they’ll be able to run iOS and iPadOS apps alongside those made for macOS. But it also means that apps that were developed for Intel’s architecture originally won’t run natively on Apple’s upcoming hardware.\n That’s where Rosetta 2 comes in: It’s an emulator built into macOS Big Sur that will enable ARM Macs to run old Intel apps. Rosetta 2 essentially “translates” instructions that were written for Intel processors into commands that Apple’s chips can understand. Developers won’t need to make any changes to their old apps; they’ll just work. (The original Rosetta was released in 2006 to facilitate Apple’s transition from PowerPC to Intel. Apple has also stated that it will support x86 Macs “for years to come,” as far as OS updates are concerned. The company shifted from PowerPC to Intel chips in 2006, but ditched support for the former in 2009; OS X Snow Leopard was Intel-only.)\n   You don’t, as a user, interact with Rosetta; it does its work behind-the-scenes. “Rosetta 2 is mostly there to minimize the impact on end-users and their experience when they buy a new Mac with Apple Silicon,” says Angela Yu, founder of the software-development school App Brewery. “If Rosetta 2 does its job, your average user should not notice its existence.”\n There’s one difference you might perceive, though: speed. Programs that ran under the original Rosetta typically ran slower than those running natively on Intel, since the translator needed time to interpret the code.  Early benchmarks found that popular PowerPC applications, such as Photoshop and Office, were running at less than half their native speed on the Intel systems.\n We’ll have to wait and see if apps under Rosetta 2 take similar performance hits. But there are a couple reasons to be optimistic. First, the original Rosetta converted every instruction in real-time, as it executed them. Rosetta 2 can convert an application right at installation time, effectively creating an ARM-optimized version of the app before you’ve opened it. (It can also translate on the fly for apps that can’t be translated ahead of time, such as browser, Java, and Javascript processes, or if it encounters other new code that wasn’t translated at install time.) With Rosetta 2 frontloading a bulk of the work, we may see better performance from translated apps.\n   Demos have also looked promising. Apple showed off Rosetta using the animation software Maya and the game  Shadow of the Tomb Raider in 1080p; both looked functional in the keynote.\n  First, Rosetta 2 isn’t intended to be a long-term solution. Apple hasn’t said how long it will be around; Rosetta, released with OS X Tiger, was only discontinued with OS X Lion three versions later. It’s a tool that will make Apple’s transition period easier, but Apple certainly intends for its developers to get started on native ARM ports of their x86 apps sooner rather than later. Apple’s own apps, including Final Cut Pro and Logic, already run natively on ARM. The company has already announced  Developer Transition Kits with an ARM processor inside to help app makers update and test their software — and it noted in the keynote that Microsoft is already working on Office, and Adobe is working on Creative Cloud. Apple showed off native versions of Word, Excel, PowerPoint, Lightroom CC, and Photoshop, as well as its own Final Cut Pro in the WWDC keynote.\n Apple is encouraging developers to create native apps; Rosetta 2 is designed to be an interim solution\n That said, Apple clearly understands that not all developers will have ports ready for the first ARM launch — and customers who buy the first ARM systems in the fall will want to use their favorite programs immediately. Rosetta 2 also means developers don’t need to scramble to re-optimize their products by the time the first ARM Macs come out. (The process of porting macOS apps to Apple silicon is beyond the scope of this guide, but you’ll find  detailed instructions on  Apple’s developer website.)\n “Changing the language that the CPU speaks is a huge deal,” says Ken Gillette, co-founder and CTO of Pocket Prep, a mobile test-prep company that has developed over 100 applications for Apple’s ecosystem. “It would be very difficult if every application needed to be updated before the new computers were available. It would result in a large effort to make changes in a short period of time.”\n “[Rosetta] will make the process of purchasing a new Mac seamless for end users,” Gillette says. “If Apple didn’t do this, the process would be much more painful, as many apps consumers use on a daily basis would be missing from their brand-new machines.”\n   Another thing to note is that the engine also won’t support everything. It’s not compatible with some programs, including virtual machine apps, which you might use to run Windows or another operating system on your Mac, or to test out new software without impacting the rest of your system. (You also won’t be able to run Windows in Boot Camp mode on ARM Macs.  Microsoft only licenses the ARM version of Windows 10 to PC manufacturers.) Rosetta 2 also can’t translate  kernel extensions, which some programs leverage to perform tasks that macOS doesn’t have a native feature for (similar to drivers in Windows).\n Rosetta 2 should help Apple avoid some of the headaches Microsoft has seen with its own ARM transition\n Third, even if Rosetta 2 is fully functional, there are still open questions about how well ARM Macs might work. In its keynote, Apple emphasized the efficiency of its new chips, claiming that they will “give the Mac industry-leading performance per watt.” The company also promised better graphic experience, machine-learning capabilities, and battery life. But it  skirted around the issue of raw power — so while ARM Macs may be more efficient than their Intel predecessors, they may also be less powerful. Apple also didn’t clarify whether it plans to produce new GPUs of its own, or whether its CPUs will interface with third-party GPUs.\n ARM processors that we’ve seen on  Windows PCs like the Surface Pro X have outperformed their Intel competitors when it comes to battery life and LTE compatibility. But we have also encountered some performance issues with ARM PCs, though that’s at least partially due to the fact that the emulation layer Microsoft uses to run x86 apps on ARM can only run 32-bit Windows apps (not modern 64-bit x86 apps) and many 32-bit programs are discernibly slower than 64-bit programs.\n If everything works as Apple has promised, Rosetta 2 means that hopefully none of that mess will happen with macOS.", "posttime": "2020-06-27 16:15:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,apple,减少", "title": "罗塞塔2是苹果减少手臂过渡痛苦的关键", "title_en": "Rosetta 2 is Apple's Key To Making the ARM Transition Less Painful", "transed": 1, "url": "https://www.theverge.com/21304182/apple-arm-mac-rosetta-2-emulation-app-converter-explainer", "via": "", "real_tags": ["苹果", "apple", "减少"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008552, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年前三个月，可再生能源几乎占英国发电量的一半，风力发电的激增帮助创造了清洁能源的新纪录。\n政府的官方数据显示，今年前三个月，可再生能源占英国发电量的47%，打破了去年创下的39%的前一季度纪录。\n政府的可再生能源数据包括来自英国风电场、太阳能电池板和水电站的电力，以及燃烧木片而不是煤炭产生的生物能源。\n英国政府的能源分析师表示，英国可再生能源总产量的“大幅增长”，主要是由太阳能电池板和风电场发电量的增长推动的，这些发电量比去年攀升了三分之一以上。\n报告补充说，新风电场的启动，加上英国年初异常潮湿和多风的天气-特别是暴风雨Ciara、Dennis和Jorge-帮助产生了创纪录的风力发电。\n今年第一季度，海上风电场为可再生能源提供了最大的增长，与去年相比攀升了53%，而陆上风力发电量增长了五分之一。\n总体而言，第一季度风电发电量占英国发电量的30%，打破了之前在2019年最后几个月创下的22.3%的纪录。\n英国可再生能源公司(Renewable UK)的丽贝卡·威廉姆斯(Rebecca Williams)表示，随着政府致力于“大规模扩张可再生能源，作为英国绿色经济复苏的一部分”，可再生能源行业的纪录在未来几年肯定会再次被打破。\n上周，英国创下了自工业革命期间开始燃煤发电以来首次超过两个月的无煤新纪录，此前由于新冠肺炎封锁期间晴朗微风的天气和需求低迷，可再生能源激增。\n威廉姆斯说，政府创纪录的季度数据显示，清洁能源转型“写得非常大”，因为纪录是在一年中最冷的时候“我们最需要它的时候”创造的。\n可再生能源的崛起，加上占英国发电结构约15%的核电供应稳定，推动化石燃料发电厂在第一季度创下历史新低。\n今年第一季度，燃气发电厂占英国发电量的不到三分之一，而2019年前几个月超过40%，燃煤发电占英国发电量的3.8%。", "note_en": "Renewable energy made up almost half of Britain’s electricity generation in the first three months of the year, with a surge in wind power helping to set a new record for clean energy.\n The government’s official data has revealed that  renewable energy made up 47% of the UK’s electricity generation in the first three months of the year, smashing the previous quarterly record of 39% set last year.\n  The government’s renewable energy data includes electricity from the UK’s windfarms, solar panels and hydro power plants  as well as bioenergy generated by burning wood chips instead of coal.\n The “substantial increase” in the UK’s total renewable energy output was chiefly driven by a growth in  electricity generated by solar panels and windfarms which climbed by more than a third over the last year, according to the government’s energy analysts.\n The report added that  the start up of new windfarms combined with the UK’s unusually wet and windy weather at the start of the year – particularly storms Ciara, Dennis and Jorge – helped to generate record wind power generation.\n Offshore windfarms powered the largest increase in renewable energy in the first quarter of the year, climbing by 53% compared with the previous year, while onshore wind generation grew by a fifth.\n In total, wind power generated 30% of the UK’s electricity in the first quarter, beating the previous record of 22.3% set in the final months of 2019.\n Rebecca Williams, of Renewable UK, said the renewable energy industry’s records were bound to be broken again in the years ahead as the government worked on “a massive expansion of renewables as part of the UK’s green economic recovery”.\n Britain last week  set a new coal-free record of more than two months for the first time since coal-fired power generation began during the Industrial Revolution, following a surge in renewable energy due to bright, breezy weather and low demand during the Covid-19 lockdown.\n  Williams said the government’s record quarterly data showed the clean energy transition “written very large indeed” because the records had been set at the coldest time of year “when we need it most”.\n The rise of renewable energy combined with a steady supply of nuclear power, which made up about 15% of the UK generation mix, drove fossil fuel power plants to a new record low in the first quarter.\n Gas-fired power plants made up less than a third of UK generation in the first quarter compared with over 40% in the first months of 2019, and coal-fired power made up 3.8% of electricity generated in the UK.", "posttime": "2020-06-27 16:15:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,打破,energy,再生能源", "title": "可再生能源在2020年第一季度打破英国纪录", "title_en": "Renewable Energy Breaks UK Record In First Quarter of 2020", "transed": 1, "url": "https://www.theguardian.com/business/2020/jun/25/renewable-energy-breaks-uk-record-in-first-quarter-of-2020", "via": "", "real_tags": ["2020", "打破", "energy", "再生能源"]}, {"category": "", "categoryclass": "", "imagename": "0706df52723428f0c2c9be8d42baa46f.jpg", "infoid": 1008551, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正如我们在6月3日披露的那样，加州大学旧金山分校的IT人员在6月1日检测到在加州大学旧金山分校医学院IT环境的有限部分发生了一起安全事件。\n作为一项安全措施，我们隔离了医学院内的几个IT系统，并成功地将事件与加州大学旧金山分校的核心网络隔离开来。重要的是，这件事并没有影响到我们的送病员业务，没有影响到整个校园网，也没有影响到新冠肺炎的工作。\n当我们在攻击发生时阻止了攻击，演员们启动了恶意软件，加密了医学院内的有限数量的服务器，使它们暂时无法访问。从那时起，我们一直在与一家领先的网络安全顾问和其他外部专家合作调查这起事件，并加强我们IT系统的防御。我们预计很快就能完全恢复受影响的服务器。\n我们的调查正在进行中，但目前，我们认为恶意软件对我们的服务器进行了机会主义的加密，没有特定的目标区域。袭击者获得了一些数据，作为他们行动的证据，用于他们要求支付赎金。我们正在继续调查，但我们目前不认为患者的医疗记录被泄露。随着更多事实的了解，我们将提供进一步的更新。\n作为一所服务于公共利益的大学，加密的数据对我们从事的一些学术工作很重要。因此，我们做出了艰难的决定，向恶意软件攻击背后的个人支付了大约114万美元的部分赎金，以换取一个工具来解锁加密的数据，并归还他们获得的数据。\n这起事件反映了世界各地寻求金钱利益的网络犯罪分子越来越多地使用恶意软件，包括最近对高等教育机构的几次攻击。我们继续与执法部门合作，我们感谢大家的理解，即我们在继续调查期间所能分享的信息有限。", "note_en": "As we disclosed on June 3, UCSF IT staff detected a security incident that occurred in a limited part of the UCSF School of Medicine’s IT environment on June 1.\n We quarantined several IT systems within the School of Medicine as a safety measure, and we successfully isolated the incident from the core UCSF network. Importantly, this incident did not affect our patient care delivery operations, overall campus network, or COVID-19 work.\n While we stopped the attack as it was occurring, the actors launched malware that encrypted a limited number of servers within the School of Medicine, making them temporarily inaccessible. Since that time, we have been working with a leading cyber-security consultant and other outside experts to investigate the incident and reinforce our IT systems’ defenses. We expect to fully restore the affected servers soon.\n Our investigation is ongoing but, at this time, we believe that the malware encrypted our servers opportunistically, with no particular area being targeted. The attackers obtained some data as proof of their action, to use in their demand for a ransom payment. We are continuing our investigation, but we do not currently believe patient medical records were exposed. As additional facts become known, we will provide further updates.\n The data that was encrypted is important to some of the academic work we pursue as a university serving the public good. We therefore made the difficult decision to pay some portion of the ransom, approximately $1.14 million, to the individuals behind the malware attack in exchange for a tool to unlock the encrypted data and the return of the data they obtained.\n This incident reflects the growing use of malware by cyber-criminals around the world seeking monetary gain, including several recent attacks on institutions of higher education. We continue to cooperate with law enforcement, and we appreciate everyone’s understanding that we are limited in what we can share while we continue with our investigation.", "posttime": "2020-06-27 16:14:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "旧金山,大学,security,恶意软件", "title": "加州大学旧金山分校IT安全事件的最新情况", "title_en": "Update on IT Security Incident at UCSF", "transed": 1, "url": "https://www.ucsf.edu/news/2020/06/417911/update-it-security-incident-ucsf", "via": "", "real_tags": ["旧金山", "大学", "security", "恶意软件"]}, {"category": "", "categoryclass": "", "imagename": "d8df7465d9ca0788add57af95b11b1d2.jpg", "infoid": 1008550, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "洛桑联邦理工学院的科学家们已经将一种新材料与单光子水平的光相耦合。这一成果为更好地控制和理解量子关联系统的性质开辟了前景，在这些系统中，理论计算是困难的。有一大群物理学家称之为强相关的材料，其中包括绝缘体，它们在中子星中具有不寻常的电子和(甚至)中子。它们的性质是因为它们的成分相互作用非常强：新的特征出现在集体层面，而这些新特征并不存在于孤立的粒子中。\n强关联材料通常在技术上是有用的，因此被用于磁存储技术，但也用于新兴的量子技术。\n现在，由EPFL物理研究所的Jean-Philippe Brantut领导的科学家们已经发现了第一种复杂的、强关联的材料，其成分在单光子水平上与光强烈耦合。这种材料就是研究人员所说的费米气体，它基本上是一种冷却到接近绝对零度的中性原子气体。在那里，与电子或中子属于同一粒子族的原子表现出类似的强关联效应。\n通过将这种费米气体放在两个高反射的光学镜面之间，即一个光的盒子，研究人员发现，与光的相互作用可以变得前所未有的强烈。布兰图特说，我们现在将利用这一点来更好地控制和理解量子关联系统的性质，这方面的理论计算很困难。相反，这可能允许进一步将强关联物质用于量子技术应用，其中与光的接口是前提条件。更多信息：凯文·鲁克斯等人(Kevin Roux et al.)。强关联费米子与光的强耦合，“自然通讯”(2020)。电话：10.1038/s4146720-16767-8", "note_en": "Ecole Polytechnique Federale de Lausanne scientists have coupled a new material with light at the level of a single photon. The achievement opens up prospects for better controlling and understanding the properties of quantum-correlated systems, where theoretical calculations are difficult.    There is a large group of materials that physicists refer to as &#34;strongly correlated,&#34; which include insulators and   that have unusual electronic and  , or even neutrons in neutron stars. Their properties result from the fact that their constituents interact very strongly with each other: new features appear at the collective level, that are not present in isolated particles.\n  The   of strongly correlated materials are often technologically useful, and are thus used in   and magnetic storage technology, but also in the emerging &#34;quantum technologies.&#34;\n  Now, scientists led by Jean-Philippe Brantut at EPFL&#39;s Institute of Physics, have discovered the first complex, strongly correlated material whose constituents are strongly coupled to light at the single-photon level. The material is what the researchers call a &#34;Fermi gas,&#34; which is basically a gas of neutral atoms cooled down very close to absolute zero. There, atoms which belong to that same family of particles than electrons or neutrons display similar strong correlation effects.\n  By placing this Fermi gas between two highly reflective optical mirrors, a &#34;box for light,&#34; the researchers discovered that interactions with light can be made unprecedentedly strong. &#34;We will now use this to better control and understand the properties of quantum correlated systems, where theoretical calculations are difficult,&#34; says Brantut. &#34;Conversely, this could allow to further use strongly correlated matter for quantum technologies applications, where interfacing with light is a prerequisite.&#34;        More information:\t\t\t\t\t\t\t\t\t\t\t\tKevin Roux et al. Strongly correlated Fermions strongly coupled to light,  Nature Communications (2020).  DOI: 10.1038/s41467-020-16767-8", "posttime": "2020-06-27 16:14:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "物质,light,材料", "title": "一种用于光-物质相互作用的新材料", "title_en": "A new material for light-matter interactions", "transed": 1, "url": "https://phys.org/news/2020-06-material-light-matter-interactions.html", "via": "", "real_tags": ["物质", "light", "材料"]}, {"category": "", "categoryclass": "", "imagename": "4c9e2630a0407de8806294e2d2939935.png", "infoid": 1008549, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "29%的智能手机被破解。我们把它们修好。Crack It是一家屡获殊荣的手机维修服务公司，由年轻罪犯提供服务。", "note_en": "29% of smartphones are cracked. We fix them. Cracked It is an award-winning phone repair service staffed by young offenders.", "posttime": "2020-06-27 16:13:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "手机,social,提供", "title": "Crack It，一家修理手机的社会企业", "title_en": "Cracked It, a social enterprise that repairs phones", "transed": 1, "url": "https://www.crackedit.org/", "via": "", "real_tags": ["手机", "social", "提供"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008548, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Micronaut是一个现代的、基于JVM的全栈Java框架，旨在构建模块化的、易于测试的JVM应用程序，并支持Java、Kotlin和Groovy语言。\nMicronaut是由Grails框架的创建者开发的，它的灵感来自于多年来使用Spring、Spring Boot和Grails构建从单块到微服务的真实世界应用程序的经验教训。\n使用Micronaut，您可以构建消息驱动应用程序、命令行应用程序、HTTP服务器等，而对于Microservices，Micronaut还提供：\n同时，Micronaut的目标是通过提供以下功能来避免Spring、Spring Boot和Grails等框架的缺点：\n从历史上看，Spring和Grails等框架不适合在无服务器功能、Android应用程序或低内存占用微服务等场景中运行。相比之下，Micronaut被设计成适用于所有这些场景。\n这一目标是通过使用Java的注释处理器(可在任何支持它们的JVM语言上使用)以及构建在Netty上的HTTP服务器和客户端来实现的。为了提供与Spring和Grails类似的编程模型，这些批注处理器预编译必要的元数据，以便执行DI、定义AOP代理并将应用程序配置为在低内存环境中运行。\nMicronaut中的许多API在很大程度上受到Spring和Grails的启发。这是经过设计的，有助于让开发人员快速掌握最新情况。\n在此版本中，启动时间得到了进一步改进，新应用程序的典型启动时间缩短了约20%。\nBean自省已得到改进，可以支持静态创建器方法、接口和枚举。这意味着您可以使用私有实现在接口上定义Bean自检，例如：\n导入返回示例{string getName()；@创建者静态示例Create(String Name){io.micronaut.core.annotation.Creator；@io.micronaut.core.annotation.Introspectedinterface()-&gt；Name；}}。\nMicronaut的依赖项注入实现已得到改进，现在您可以接收任何@Factory方法的InjectionPoint实例。这使得定制如何在注入Bean时基于注释元数据创建Bean成为可能。\n工厂方法可以接收注入点并根据值创建客户端：\n@BeanProtected DefaultHttpClient httpClient(InjectionPoint&lt；？&gt；InjectionPoint){String url=metadata.stringValue(Client.class).orElse(null)；if(url！=NULL){返回新的DefaultHttpClient(URL)；}Else{返回新的DefaultHttpClient()；}}。\nBean的急切初始化在某些情况下很有用，例如在AWS Lambda上，分配给Lamdba构造的CPU资源多于执行的CPU资源。因此，对于Micronaut 2.0，您可以使用ApplicationContextBuilder接口指定是要急于初始化配置还是所有单例：\n公共类应用程序{public static void main(String[]args){Micronaut.build(Args).agerInitSingletons(True)(1).mainClass(Application.class).start()；}}。\n还可以使用ageerInitConfiguration来初始化所有的@ConfigurationProperties bean，从而只急切地进行初始化配置。\n在Micronaut1.x中，Google分布式JSR-305注释库(com.google.code.findbugs：jsr305)用于使用javax.notation包中包含的注释在Micronaut API的接口上指定@Nullable和@NonNull。\n由于JSR-305已被取消，并且此依赖项存在潜在的许可问题(通过使用javax名称空间)，以及Java9+上的交叉包与模块系统存在问题，Micronaut2.x切换到SpotBugs项目提供的SpotBugs-Annotation模块。\n建议Micronaut用户改用此API(尽管继续支持javax.nottation.Nullable和javax.nottation.NotNull注释)。\nMicronaut用于CLI的mn命令已经用Micronaut本身重写，现在编译成Linux、MacOSX和Windows上可用的本机映像。\n运行curlopapi获取更多关于如何使用https://launch.micronaut.io的说明，或者访问openapi文档。\n从另一个Micronaut项目的根运行mn Feature-diff--Feature=[Feature Name]，以创建启用该功能所需应用的更改的差异。例如：\n$MN FEATURE-DIFF--FEATURES=azure-Function-Micronaut-cli.yml+Micronaut-cli.yml@@-3，4+3，4@@testFramework：junit源语言：Java buildTool：Gradle-Feature：[app-name，application，gradle，http-client，java，junit，logback，netty-server，shade，yaml]+Feature：[app-name，application，azure-function，azure。：&#34；2.0&#34；，+&#34；扩展包&#34；：{+&#34；id&#34；：&#34；Microsoft.Azure.Functions.ExtensionBundle&#34；，+&#34；版本&#34；：&#34；[1.*，2.0.0)&#34；+}+}。\nMicroronaut对GraalVM本机映像的支持已脱离实验状态，这巩固了我们继续改善对本机映像支持的承诺。\n不再需要为您的本机映像构建配置静态资源。对于src/main/resources中的所有资源，Micronaut-graal注释处理器将自动为您执行此操作。\n通过JDBC或Hibernate/JPA连接到数据库不再需要提供额外的GraalVM相关配置。Micronaut通过GraalVM本机映像自动支持以下驱动程序：\nMicronaut Flyway模块已更新为GraalVM本机映像支持，因此您现在可以在本机映像中运行数据库迁移。\nMicronaut AWS模块2.0版包括对大多数v2 AWS API(包括S3、Dynamo DB、SES、SNS和SQS)的本机映像支持，这将有助于使用Micronaut+GraalVM开发本机AWS Lambda函数。\nMicronaut jOOQ模块包括对Native Image的支持，并且可以将其与SimpleFlatMapper一起使用。\nMicronaut Redis模块包括对本机映像的支持。由于生菜驱动程序的工作方式，仍然有一些未决的用例无法工作。确保您阅读了文档。\nMicronaut现在提供了一个新的父POM，可以在Maven项目中使用它来快速设置：\n上面提到的父POM包括一个新的Micronaut Maven插件，该插件支持在开发过程中自动重启应用程序。只需运行以下命令：\n对于创建新应用程序的Gradle用户，使用的是与JDK14兼容的Gradle 6.5。\n由于改进了对Gradle增量注释处理的支持，针对Java和Kotlin的Micronaut2构建Gradle的速度应该会大大加快。\nMicronaut 2.0将新的共享默认Netty EventLoopGroup用于服务器工作线程和客户端请求线程。这减少了上下文切换并提高了资源利用率。\n有关如何配置默认EventLoopGroup和添加每个客户端配置的其他‘EventLoopGroup’的信息，请参阅HTTP客户端配置部分。\n此外，从Micronaut2.0开始，默认情况下所有操作都在EventLoop上执行，用户可以选择使用新的@ExecuteOn注释来指定指定的执行器，以便在需要时在其上执行操作(例如，将阻塞操作(如与JPA/JDBC的交互)卸载到特定的线程池)。\n现在可以使用@RequestBean注释将POJO参数的属性绑定到@Controller以请求参数、标头等。\nMicronaut现在支持创建Servlet应用程序，用户可以使用命令行创建以流行的Servlet容器为目标的应用程序：\n$Mn create-app myapp--功能jetty-server#for Jetty$Mn create-app myapp--功能tomcat-server#for Tomcat$Mn create-app myapp--功能Undertow-server#\nMicronaut现在将正确处理HTTP Accept报头，并使用服务器端内容协商为指定的接受媒体类型挑选最合适的路由。\n这也适用于@Error路由，从而可以针对不同的内容类型发送不同的错误响应。\nMicroronaut现在将处理VCAP_APPLICATION和VCAP_SERVICES环境变量，并将其视为属性源。\n不再需要使用@Client(..)。若要注入默认RxHttpClient实例，请执行以下操作。现在，您只需使用以下命令即可注入默认客户端：\n如果在请求时没有提供主机，将抛出NoHostException。\n新增了用于编写API网关和代理请求的API。有关详细信息，请参阅ProxyHttpClient上的文档。\n现在可以控制各个端点方法的灵敏度。@Sensitive注释可以应用于端点方法，以允许某些方法具有与提供给端点注释的值不同的敏感度。\nRxJava2的规范机制已经过改进，可以解决MDC的问题并减小反应性堆栈跟踪的大小。感谢丹尼斯·斯捷潘诺夫和拉霍斯·盖西在这方面的贡献。\n您可以从Micronaut启动或通过命令行生成Micronaut+KTOR应用程序。\n新的Kotlin扩展功能可以让Kotlin+Micronaut体验更好一点。\n您现在可以使用Micronaut编写针对Google Cloud函数的无服务器函数。有关更多信息，请参阅Micronaut GCP文档和示例应用程序。\n您现在可以使用Microronaut编写面向Microsoft Azure的无服务器函数。有关更多信息，请参阅Micronaut Azure文档和示例应用程序。\nMicronaut AWS 2.0.0在支持AWS Lambda和AWS方面进行了大量改进，包括针对AWS SDK 2.0的新客户端模块、对Lambda的冷启动改进以及对Amazon Alexa支持的改进。\nMicronaut比以往任何时候都更加模块化，现在有几个组件可以在单独的模块中使用，并对这些模块进行升级。\n缓存已经移到了一个单独的模块中，并脱离了Micronaut-Runtime。如果您需要缓存(包括io.micronaut.cache.notation中的注释)，您只需要为您感兴趣的缓存提供者添加单独的模块(例如，Caffeine、Redis、Hazelcast等)。\nMicronaut SQL已改进为默认使用Micronaut事务管理(使Spring管理成为可选的)，并包括对Jdbi的支持(感谢Dan Maas提供的这一贡献)。\n此外，还添加了对Oracle Universal Connection Pool的支持。感谢托德·夏普的这一贡献。\n安全模块进行了许多更改，以改进API并引入新功能以支持更广泛的用例。\n虽然RxJava2仍然是默认的，但是已经为其他反应库添加了单独的模块。\n新的RxJava3和反应器模块中包括RxHttpClient的变体，分别称为Rx3HttpClient和ReactorHttpClient。\n本节介绍将Micronaut 1.x应用程序升级到Micronaut 2.x所需的步骤。\n如果您的应用程序确实阻塞了I/O，比如通过JDBC或JPA进行通信，那么您应该使用@ExecuteOn注释来注释所有与这些阻塞资源交互的控制器，指定默认的I/O线程池或您配置的管理器来处理这些阻塞交互的线程池。例如：\n导入io.micronaut.http.notation.*；import io.micronaut.Scheduling.TaskExecutors；导入io.micronaut.scheduling.annotation.ExecuteOn；@Controller(&#34；/executeOn/people&#34；)public类PersonController{Private Final PersonService PersonService；PersonController(PersonService PersonService){this.sonService=PersonService；}@Get(&#34；/{Name}&#34；)@ExecuteOn(TaskExecutors.IO)(1)Person ByName(String Name){Return PersonService.findByName(Name)。\nimport io.micronaut.http.notation.*import io.micronaut.Scheduling.TaskExecutorsimport io.micronaut.scheduling.annotation.ExecuteOn@Controller(&#34；/executeOn/people&#34；)class PersonController{Private Final PersonService Person Service PersonService PersonController(PersonService PersonService){this.sonService=PersonService}@Get(&#34；/{Name}&#34；)@ExecuteOn(TaskExecutors.IO)(1)Person ByName(String Name){Return PersonService.findByName(Name)}}\nimport io.micronaut.http.notation.*import io.micronaut.Scheduling.TaskExecutorsimport io.micronaut.scheduling.annotation.ExecuteOn@Controller(&#34；/executeOn/people&#34；)class个人控制器(私有ValPersonService：PersonService){@GET(&#34；/{Name}&#34；)@ExecuteOn(TaskExecutors.IO)(1)FUN ByName(Name：String)：Person{Return PersonService.findByName(Name)}}。\n如果您希望返回到Micronaut1.x中定义的前一行为，您可以在配置中将micronaut.server.thread-select设置为auto。\n如果您的应用程序由于io.micronaut.cache中缺少类而无法编译，则需要添加对缓存实现的依赖项，例如，默认的缓存实现是Caffeine，这可以使用以下依赖项进行恢复：\n如果您的应用程序无法编译javax.Annotation包中的引用类(如@Nullable和@Nonnull)，则应该更新您的项目，以从Spot Bugs导入edu.umd.cs.findbugs.Annotation。\n一些依赖项具有新的Maven组ID，因此您可能需要更新您的依赖项。下表汇总了对组ID的更改：\nAWS功能(包括对AWS ParameterStore、AWS Route53和AWS Lambda Function Client的支持)已移出Micronaut核心，因此，如果您需要AWS相关功能，则应使用必要的模块。\n在Micronaut1.2中不推荐使用的类io.micronaut.discovery.kubernetes.KubernetesDiscoveryClient，现在已从Micronaut2.0中删除。取而代之的是新的Micronaut Kubernetes模块，它改进了对在Kubernetes集群中运行Micronaut应用程序的支持，包括对Kubernetes配置地图、密码等的支持。\n对于Micronaut2.0，我们建议您使用基于Micronaut的本地事务管理，而不是其他替代方案，如Spring Transaction Management。\n您将使用JavaEE7javax.transaction.Transaction注释和io.micronaut.transaction.nottation.ReadOnly来标记您的事务分界。\n要使用这些批注，您必须在批注处理器配置中包括Micronaut-Data-Processor相关性：\n导入io.micronaut.spring.tx.annotation.Transactional；.@Singletonpublic类GenreRepositoryImpl实现了GenRepository{.。@Transaction(readOnly=true)public可选&lt；genre&gt；findById(@NotNull Long ID){.。}@事务性公共类型保存(@NotBlank字符串名称){.。}}。\nimport javax.transaction.Transaction；import io.micronaut.transaction.annotation.ReadOnly；.@Singletonpublic类GenreRepositoryImpl实现GenRepository{.。@ReadOnly public可选&lt；genre&gt；findById(@NotNull Long ID){.。}@事务性公共类型保存(@NotBlank字符串名称){.。}}。\nMicronaut2默认使用Groovy3和Spock 2，这两个版本都在语言和测试框架级别进行了重大更改。\n面向Groovy用户的Micronaut2的一些特性目前处于预览状态，包括GORM7.1和Spock 2支持，因为这些框架还没有稳定的版本。\n对于Spock 2，最重要的变化是Spock 2不再支持JUnit4和相关的JUnit4测试运行程序，取而代之的是JUnit5平台。\n在Gradle构建的情况下，此更改意味着当使用Spock 2升级到Micronaut2时，您可能会发现您的测试根本不执行，这会给您一种错误的安全感，即升级是成功的。\n要确保您的Spock 2测试在Micronaut 2 Gradle版本中运行，您必须将以下配置添加到您的版本中。gradle以启用JUnit 5平台：\n如果上面的用例不包括您的用例，请参阅破坏更改一节，以获得在此版本中被视为破坏的其他更改的列表。\n以下各节将带您快速入门，了解如何使用Micronaut设置基本的Hello World应用程序。\n在开始之前，请确保您安装了Java8或更高版本的SDK，并且建议您安装合适的IDE，如IntelliJ IDEA。\n要按照快速入门操作，还建议您安装Micronaut CLI。\n在Unix系统上安装Micronaut的最佳方式是使用SDKMAN，它极大地简化了多个Micronaut版本的安装和管理。\n$MN|正在启动交互模式.|输入要运行的命令名。使用TAB完成：MN&GT；\n$MN|正在启动交互模式.|输入要运行的命令名。使用TAB完成：MN&GT；\n$MN|正在启动交互模式.|输入要运行的命令名。使用TAB完成：MN&GT；\n您现在应该能够从命令提示符运行Micronaut CLI，如下所示：\n$MN|正在启动交互模式.|输入要运行的命令名。使用TAB完成：MN&GT；\n在您的shell配置文件(如果您使用的是Bash shell，则为~/.bash_profile)中，导出MICRONOT_HOME目录并将CLI路径添加到您的路径中：\n$MN|正在启动交互模式.|输入要运行的命令名。使用TAB完成：MN&GT；\n您还可以使用以下命令SDK install Micronaut dev/path/to/checkout/cli/build将SDKMAN指向本地安装以进行开发。\n虽然不需要使用Micronaut，但Micronaut CLI是创建新服务器应用程序的最快方式。\n使用CLI，您可以在Groovy、Java或Kotlin(缺省为Java)中创建新的Micronaut应用程序。\n以下命令使用带有Gradle版本的Java创建一个新的&#34；Hello World&#34；服务器应用程序：\n如果您希望创建基于Maven的构建，则可以提供--build maven。\n前面的命令将在一个名为hello-world的目录中创建一个新的Java应用程序，其中包含Gradle版本。该应用程序可以使用./gradlew run：\n$./gradlew运行&gt；任务：运行[Main]info io.micronaut.runtime.Micronaut-启动在972ms内完成。正在运行的服务器：http://localhost:28933。\n默认情况下，Micronaut HTTP服务器配置为在端口8080上运行。有关更多选项，请参阅用户指南中的在特定端口上运行服务器一节。\n为了创建响应Hello World的服务，您首先需要一个控制器。以下是控制器的示例：\nimport io.micronaut.http.MediaType；import io.micronaut.http.annotation.Controller；import io.micronaut.http.annotation.Get；@Controller(&#34；/hello&#34；)(1)公共类HelloController{@Get(Products=MediaType.TEXT_PLAN)(2)公共字符串索引(){Return&#34；Hello World；(3)}}。\nimport io.micronaut.http.MediaTypeimport io.micronaut.http.注解.Controllerimport io.micronaut.http.annotation.Get@Controller(&#39；/hello&#39；)(1)class HelloController{@GET(Products=MediaType.TEXT_PLAN)(2)String index(){&#39；Hello World&#39；(3)}}\nimport io.micronaut.http.MediaTypeimport io.micronaut.http.注解.Controllerimport io.micronaut.http.annotation.Get@Controller(&#34；/hello&#34；)(1)class HelloController{@GET(Products=[MediaType.TEXT_PLAN])(2)FUN index()：String{Return&#34；Hello World&#34；(3)}}。\n该类被定义为控制器，并将@Controller注释映射到路径/hello。\n@GET注释用于将索引方法映射到使用HTTP GET的所有请求。\n如果您使用的是Java，请将前面的f。\n..", "note_en": "Micronaut is a modern, JVM-based, full stack Java framework designed for building modular, easily testable JVM applications with support for Java, Kotlin and the Groovy language.\n Micronaut is developed by the creators of the Grails framework and takes inspiration from lessons learnt over the years building real-world applications from monoliths to microservices using Spring, Spring Boot and Grails.\n   With Micronaut you can build Message-Driven Applications, Command Line Applications, HTTP Servers and more whilst for Microservices in particular Micronaut also provides:\n  At the same time Micronaut aims to avoid the downsides of frameworks like Spring, Spring Boot and Grails by providing:\n  Historically, frameworks such as Spring and Grails were not designed to run in scenarios such as server-less functions, Android apps, or low memory-footprint microservices. In contrast, Micronaut is designed to be suitable for all of these scenarios.\n This goal is achieved through the use of Java’s  annotation processors, which are usable on any JVM language that supports them, as well as an HTTP Server and Client built on  Netty. In order to provide a similar programming model to Spring and Grails, these annotation processors precompile the necessary metadata in order to perform DI, define AOP proxies and configure your application to run in a low-memory environment.\n Many of the APIs within Micronaut are heavily inspired by Spring and Grails. This is by design, and aids in bringing developers up to speed quickly.\n    Startup time has been further improved in this release with typical startup time for a new application around 20% faster.\n Bean introspections have been improved to support static creator methods, interfaces and enums. This means you can define a bean introspection on an interface with a private implementation such as:\n import io.micronaut.core.annotation.Creator;@io.micronaut.core.annotation.Introspectedinterface Example { String getName(); @Creator static Example create(String name) { return () -&gt; name; }}\n Micronaut’s Dependency Injection implementation has been improved such that you can now receive an  InjectionPoint instance to any  @Factory method. This makes it possible to customize how the bean is created based on the annotation metadata at the point at which the bean is injected.\n   A factory method can receive the injection point and create a client based off of the value:\n @Beanprotected DefaultHttpClient httpClient(InjectionPoint&lt;?&gt; injectionPoint) { String url = metadata.stringValue(Client.class).orElse(null); if (url != null) { return new DefaultHttpClient(url); } else { return new DefaultHttpClient(); }}\n Eager initialization of beans is useful in certain cases, such as on AWS Lambda where more CPU resources are assigned to Lamdba construction than execution. Therefore as for Micronaut 2.0, you can specify whether you want to eager initialization configuration or all singletons using the  ApplicationContextBuilder interface:\n public class Application { public static void main(String[] args) { Micronaut.build(args) .eagerInitSingletons(true)   (1) .mainClass(Application.class) .start(); }}\n  It is also possible to just eager init configuration using  eagerInitConfiguration which will initialize all  @ConfigurationProperties beans.\n In Micronaut 1.x the Google distributed JSR-305 annotations library ( com.google.code.findbugs:jsr305) was used to specify  @Nullable and  @NonNull on interfaces of the Micronaut API using the annotations contained within the  javax.annotation package.\n Due to the fact that JSR-305 has been cancelled and that this dependency has potential licensing issues (by using the  javax namespace) as well as problems with the cross packages on Java 9+ with the module system Micronaut 2.x switches to the  spotbugs-annotations module provided by the  SpotBugs project.\n It is recommended users of Micronaut use this API instead (although the  javax.annotation.Nullable and  javax.annotation.NotNull annotations continue to be supported).\n Micronaut’s  mn command for the CLI has been rewritten in Micronaut itself and is now compiled into a native image  available on Linux, MacOS X and Windows.\n Run  curl  https://launch.micronaut.io for more instructions on how to use the API or visit the  OpenAPI documentation.\n Run  mn feature-diff --features=[FEATURE NAME] from the root of another Micronaut project to create a diff of the changes that need to be applied to enable the feature. For example:\n $ mn feature-diff --features=azure-function--- micronaut-cli.yml+++ micronaut-cli.yml@@ -3,4 +3,4 @@ testFramework: junit sourceLanguage: java buildTool: gradle-features: [app-name, application, gradle, http-client, java, junit, logback, netty-server, shade, yaml]+features: [app-name, application, azure-function, azure-function-http, gradle, java, junit, logback, yaml]--- host.json+++ host.json@@ -1,0 +1,7 @@+{+ &#34;version&#34;: &#34;2.0&#34;,+ &#34;extensionBundle&#34;: {+ &#34;id&#34;: &#34;Microsoft.Azure.Functions.ExtensionBundle&#34;,+ &#34;version&#34;: &#34;[1.*, 2.0.0)&#34;+ }+}\n Micronaut’s support for GraalVM Native Image has been moved out of experimental status, which solidifies our commitment to continue improving support for native images.\n It is not longer necessary to configure static resources for your Native Immage builds. The  micronaut-graal annotation processor will automatically do this for you for all resources found in  src/main/resources.\n It is no longer necessary to provide additional GraalVM related configuration to connect to databases via JDBC or Hibernate/JPA. Micronaut includes automatic support for the following drivers with GraalVM Native Image:\n The Micronaut Flyway module has been  updated with GraalVM Native Image support so you can now run database migrations in Native Image.\n Version 2.0 of the Micronaut AWS module  includes support for Native Image for the majority of the v2 AWS APIs including S3, Dynamo DB, SES, SNS, and SQS which will be helpful for those developing native AWS Lambda functions with Micronaut + GraalVM.\n The Micronaut jOOQ module  includes support for Native Image and it’s possible to use it with  SimpleFlatMapper.\n The Micronaut Redis module  includes support for Native Image. There are still some pending uses cases that won’t work because of how Lettuce driver works. Make sure you read the documentation.\n Micronaut now provides a new parent POM that can be used in Maven projects to get setup quickly:\n The parent POM mentioned above includes a new Micronaut Maven Plugin that enables automatic application restart during development. Just run the following:\n For Gradle users who create new applications Gradle 6.5 is used which is compatible with JDK 14.\n Gradle builds with Micronaut 2 for both Java and Kotlin should be significantly faster thanks to improved support for  Gradle incremental annotation processing.\n Micronaut 2.0 uses a new shared default Netty  EventLoopGroup for server worker threads and client request threads. This reduces context switching and improves resource utilization.\n See the  HTTP Client Configuration section for information on how to configure the default  EventLoopGroup and add additional `EventLoopGroup’s that are configured per client.\n In addition, as of Micronaut 2.0 all operations are by default executed on the  EventLoop and users can optionally use the new  @ExecuteOn annotation to specify a named executor to execute an operation on if required (for example to offload blocking operations such as interactions with JPA/JDBC to a specific thread pool).\n It is now possible to bind the properties of a POJO argument to a  @Controller to request parameters, headers and so on using the  @RequestBean annotation.\n Micronaut now includes support for creating  Servlet applications and users can use the command line to create an application that targets popular Servlet containers:\n $ mn create-app myapp --features jetty-server # for Jetty$ mn create-app myapp --features tomcat-server # for Tomcat$ mn create-app myapp --features undertow-server # for Undertow\n Micronaut will now correctly handle the HTTP  Accept header and pick the most appropriate route for the specified accepted media types using  Server-Side Content Negotiation.\n This also applies to  @Error routes making it possible to send different error responses for different content types\n Micronaut will now process the  VCAP_APPLICATION and  VCAP_SERVICES environment variables and treat them as property sources.\n It is no longer necessary to use  @Client(..) to inject a default  RxHttpClient instance. You can now inject the default client simply with:\n  If no host is provided at the time of a request, a  NoHostException will be thrown.\n A new API for writing API gateways and proxying requests has been added. See the documentation on the  ProxyHttpClient for more information.\n It is now possible to control the sensitivity of individual endpoint methods. The  @Sensitive annotation can be applied to endpoint methods to allow for some methods to have a different sensitivity than the value supplied to the endpoint annotation.\n The Instrumentation mechanism for RxJava 2 has been improved to address issues with MDC and reduce the size of reactive stack traces. Thanks to  Denis Stepanov and  Lajos Gathy for their contributions in this area.\n You can generate a Micronaut +  Ktor application from  Micronaut Launch or via the command line.\n New  Kotlin Extension Functions are available that make the Kotlin + Micronaut experience that little bit better.\n You can now write Serverless functions that target Google Cloud Function using Micronaut. See the  Micronaut GCP documentation and  example application for more information.\n You can now write Serverless functions that target Microsoft Azure using Micronaut. See the  Micronaut Azure documentation and  example application for more information.\n Micronaut AWS 2.0.0 includes a number of improvements to support for AWS Lambda and AWS in general including new client modules for AWS SDK 2.0, cold start improvements on Lambda and improvements to the support for Amazon Alexa.\n Micronaut is more modular than ever, with several components now available in separate modules and upgrades to those modules.\n Caching has been moved into a separate module and out of  micronaut-runtime. If you need caching (including the annotations within  io.micronaut.cache.annotation) you just need to add the individual module for the cache provider you are interested (for example Caffeine, Redis, Hazelcast etc.).\n Micronaut SQL has been improved to default to Micronaut transaction management (making Spring management optional) and includes  support for Jdbi (Thanks to  Dan Maas for this contribution).\n In addition, support has been added for  Oracle Universal Connection Pool. Thanks to  Todd Sharp for this contribution.\n The security module has seen many changes to improve the API and introduce new features to support a wider array of use cases.\n Whilst RxJava 2 remains the default, individual modules for other reactive libraries have been added.\n       Included within the new RxJava 3 and Reactor modules are variants of  RxHttpClient called  Rx3HttpClient and  ReactorHttpClient respectively.\n   This section covers the steps required to upgrade a Micronaut 1.x application to Micronaut 2.x.\n If your application does blocking I/O such as communication via JDBC or JPA you should annotate all controllers that interact with these blocking resources with the  @ExecuteOn annotation specifying either the default I/O thread pool or a thread pool that you configure an manage to deal with these blocking interactions. For example:\n import io.micronaut.http.annotation.*;import io.micronaut.scheduling.TaskExecutors;import io.micronaut.scheduling.annotation.ExecuteOn;@Controller(&#34;/executeOn/people&#34;)public class PersonController { private final PersonService personService; PersonController( PersonService personService) { this.personService = personService; } @Get(&#34;/{name}&#34;) @ExecuteOn(TaskExecutors.IO)  (1) Person byName(String name) { return personService.findByName(name); }}\n import io.micronaut.http.annotation.*import io.micronaut.scheduling.TaskExecutorsimport io.micronaut.scheduling.annotation.ExecuteOn@Controller(&#34;/executeOn/people&#34;)class PersonController { private final PersonService personService PersonController( PersonService personService) { this.personService = personService } @Get(&#34;/{name}&#34;) @ExecuteOn(TaskExecutors.IO)  (1) Person byName(String name) { return personService.findByName(name) }}\n import io.micronaut.http.annotation.*import io.micronaut.scheduling.TaskExecutorsimport io.micronaut.scheduling.annotation.ExecuteOn@Controller(&#34;/executeOn/people&#34;)class PersonController (private val personService: PersonService) { @Get(&#34;/{name}&#34;) @ExecuteOn(TaskExecutors.IO)  (1) fun byName(name: String): Person { return personService.findByName(name) }}\n  If you wish to return to the previous behaviour as defined in Micronaut 1.x you can set  micronaut.server.thread-selection to  AUTO in configuration.\n If your application fails to compile due to missing classes in the  io.micronaut.cache you need to add a dependency on a cache implementation, for example the default cache implementation was Caffeine and this can be restored with the following dependency:\n If you application fails to compile referencing classes in the  javax.annotation package such as  @Nullable and  @Nonnull you should update your project to instead import  edu.umd.cs.findbugs.annotations from Spot Bugs.\n Some dependencies have new Maven Group IDs so you may need to update your dependency. The following table summarizes changes to group IDs:\n The AWS functionality (including support for AWS ParameterStore, AWS Route53 and AWS Lambda Function Client) has been moved out of the Micronaut core therefore if you need AWS related functionality you should use the necessary module.\n The class  io.micronaut.discovery.kubernetes.KubernetesDiscoveryClient, that was deprecated in Micronaut 1.2, has now been removed from Micronaut 2.0. The replacement is the new  Micronaut Kubernetes module, with an improved support for running Micronaut applications in a Kubernetes cluster, including support for Kubernetes&#39;  ConfigMaps,  Secrets and more.\n For Micronaut 2.0, we recommend you to use the native Micronaut-based transaction management instead of other alternatives such as Spring Transaction Management.\n You will use  Java EE 7 javax.transaction.Transactional annotation and  io.micronaut.transaction.annotation.ReadOnly to mark your transaction demarcations.\n To use those annotations, you have to include the  micronaut-data-processor dependency in your annotation processor configuration:\n     import io.micronaut.spring.tx.annotation.Transactional;......@Singletonpublic class GenreRepositoryImpl implements GenreRepository {...... @Transactional(readOnly = true) public Optional&lt;Genre&gt; findById(@NotNull Long id) {..... } @Transactional public Genre save(@NotBlank String name) { ... .. }}\n  import javax.transaction.Transactional;import io.micronaut.transaction.annotation.ReadOnly;......@Singletonpublic class GenreRepositoryImpl implements GenreRepository {...... @ReadOnly public Optional&lt;Genre&gt; findById(@NotNull Long id) {..... } @Transactional public Genre save(@NotBlank String name) { ... .. }}\n Micronaut 2 defaults to Groovy 3 and Spock 2 both of which include significant changes at the language and testing framework level.\n Some features of Micronaut 2 for Groovy users are currently in preview status including GORM 7.1 and Spock 2 support as these frameworks do not yet have stable releases.\n In the case of Spock 2 the most important change is that Spock 2 deprecates support for JUnit 4 and the associated JUnit 4 test runner and replaces it with JUnit 5 Platform.\n In the case of a Gradle build this change means that when upgrading to Micronaut 2 with Spock 2 you may find your tests don’t execute at all which can give you the false sense of security that the upgrade was successful.\n To ensure your Spock 2 tests run in a Micronaut 2 Gradle build you must add the following configuration to your  build.gradle to enable JUnit 5 platform:\n If the above cases don’t cover your use case see the section on  Breaking Changes for a list of other changes that are regarded as breaking in this release.\n   The following sections will walk you through a Quick start on how to use Micronaut to setup a basic &#34;Hello World&#34; application.\n Before getting started ensure you have a Java 8 or above SDK installed and it is recommended having a suitable IDE such as IntelliJ IDEA.\n To follow the Quick Start it is also recommended that you have the Micronaut CLI installed.\n   The best way to install Micronaut on Unix systems is with  SDKMAN which greatly simplifies installing and managing multiple Micronaut versions.\n           $ mn| Starting interactive mode...| Enter a command name to run. Use TAB for completion:mn&gt;\n         $ mn| Starting interactive mode...| Enter a command name to run. Use TAB for completion:mn&gt;\n         $ mn| Starting interactive mode...| Enter a command name to run. Use TAB for completion:mn&gt;\n    You should now be able to run the Micronaut CLI from the command prompt as follows:\n $ mn| Starting interactive mode...| Enter a command name to run. Use TAB for completion:mn&gt;\n        In your shell profile ( ~/.bash_profile if you are using the Bash shell), export the  MICRONAUT_HOME directory and add the CLI path to your  PATH:\n     $ mn| Starting interactive mode...| Enter a command name to run. Use TAB for completion:mn&gt;\n You can also point SDKMAN to local installation for dev purpose using following command  sdk install micronaut dev /path/to/checkout/cli/build\n   Although not required to use Micronaut, the Micronaut CLI is the quickest way to create a new server application.\n Using the CLI you can create a new Micronaut application in either Groovy, Java or Kotlin (the default is Java).\n The following command creates a new &#34;Hello World&#34; server application in Java with a Gradle build:\n  You can supply  --build maven if you wish to create a Maven based build instead\n The previous command will create a new Java application in a directory called  hello-world featuring a Gradle build. The application can be run with  ./gradlew run:\n $ ./gradlew run&gt; Task :run[main] INFO io.micronaut.runtime.Micronaut - Startup completed in 972ms. Server Running: http://localhost:28933\n   By default the Micronaut HTTP server is configured to run on port 8080. See the section  Running Server on a Specific Port in the user guide for more options.\n In order to create a service that responds to &#34;Hello World&#34; you first need a controller. The following is an example of a controller:\n import io.micronaut.http.MediaType;import io.micronaut.http.annotation.Controller;import io.micronaut.http.annotation.Get;@Controller(&#34;/hello&#34;)  (1)public class HelloController { @Get(produces = MediaType.TEXT_PLAIN)  (2) public String index() { return &#34;Hello World&#34;;  (3) }}\n import io.micronaut.http.MediaTypeimport io.micronaut.http.annotation.Controllerimport io.micronaut.http.annotation.Get@Controller(&#39;/hello&#39;)  (1)class HelloController { @Get(produces = MediaType.TEXT_PLAIN)  (2) String index() { &#39;Hello World&#39;  (3) }}\n import io.micronaut.http.MediaTypeimport io.micronaut.http.annotation.Controllerimport io.micronaut.http.annotation.Get@Controller(&#34;/hello&#34;)  (1)class HelloController { @Get(produces = [MediaType.TEXT_PLAIN])  (2) fun index(): String { return &#34;Hello World&#34;  (3) }}\n The class is defined as a controller with the  @Controller annotation mapped to the path  /hello\n The  @Get annotation is used to map the  index method to all requests that use an HTTP  GET\n If you are using Java, place the previous f\n......", "posttime": "2020-06-27 16:12:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,全栈,java,testable,micronaut", "title": "Micronaut2.0：面向模块化、可测试应用程序的全栈Java框架", "title_en": "Micronaut 2.0: a full stack Java framework for modular, testable applications", "transed": 1, "url": "https://docs.micronaut.io/2.0.0/guide/index.html", "via": "", "real_tags": ["程序", "全栈", "java", "testable", "micronaut"]}]