[{"category": "", "categoryclass": "", "imagename": "1bb021aec3bde5a387250d63026c85bc.jpg", "infoid": 1014068, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你想知道你在国会的代表是否支持联邦政府对面部识别的禁令，你可以看看一份由隐私权倡导者联盟编制的计分表。\n周三，潘基文面部识别组织推出了国会记分板计划，以追踪那些已经和没有支持面部识别和生物识别技术暂停法案的议员。\n为我们的编辑订阅CNET Now时事通讯，精选当天最重要的新闻。\n该法案是由众议员Ayanna Pressley和Pramila Jayapal以及参议员Ed Markey和Jeff Merkley在6月份提出的。它呼吁在国会通过立法解除禁令之前，全面禁止执法部门使用面部识别。在美国，隐私和其他组织要求在美国所有城市禁止面部识别的呼声越来越高，同时提供该技术的公司也对人权问题表示担忧。\n周三，参议员伯尼·桑德斯(Bernie Sanders)、伊丽莎白·沃伦(Elizabeth Warren)和罗恩·怀登(Ron Wyden)与其他八名议员作为共同发起人加入了该法案。\n参议员马基在一份声明中说，我为能为一个没有侵入性和种族主义监控工具的未来而战感到自豪，我感谢我在参众两院的同事，以及全国各地的团体，他们加入了阻止政府使用生物识别技术的努力中来，参议员马基在一份声明中说，我为能为一个没有侵入性和种族主义的监控工具而战感到自豪，我感谢我在参众两院的同事以及全国各地的团体加入到阻止政府使用生物识别技术的努力中来。\n面部识别的担忧源于这项技术在种族偏见方面的记录，研究人员发现，它经常误认有色人种和女性。这导致了黑人男子因为这项技术而被错误逮捕的案件，促使要求阻止警察使用面部识别的呼声越来越高。\n虽然亚马逊和微软等公司呼吁对面部识别进行全国性监管，但他们并没有支持这项法案。\n禁止面部识别是由42个反对这项技术的组织组成的联盟，其中包括争取未来、电子隐私信息中心、颜色变化、雅典娜和需求进步。\n记分卡在每位议员的名单下面都有一条提示，鼓励访问者在推特上向当地议员发帖，敦促他们支持这项法案。\n争取未来运动副主任埃文·格里尔(Evan Greer)在一份声明中表示，如果立法者不支持这项常识性立法，阻止使用与核武器或生物武器一样危险的有偏见和侵入性的监控技术，他们就不能声称关心公民自由、自由、民主、种族正义或人权。\n尊重他人，保持文明礼貌，不离题。我们删除违反我们政策的评论，我们鼓励您阅读这些评论。我们可以随时关闭讨论线程。", "note_en": "If you&#39;re wondering whether your representatives in Congress support a federal ban on facial recognition, you can check out a score sheet put together by a coalition of privacy advocates.\n On Wednesday, the Ban Facial Recognition group launched its  Congressional Scoreboard for keeping track of lawmakers who have and haven&#39;t endorsed the  Facial Recognition and Biometric Technology Moratorium Act.\n  Subscribe to the CNET Now newsletter for our editors&#39; picks of the most important stories of the day.\n The bill was introduced in June by Reps. Ayanna Pressley and Pramila Jayapal and Sens. Ed Markey and Jeff Merkley. It calls for a complete ban on facial recognition use by law enforcement until Congress passes legislation to lift the moratorium. The US has seen a growing call from privacy and other groups to   ban facial recognition across  its cities, as well as concern about human rights issues from companies that provide the technology.\n On Wednesday, senators Bernie Sanders, Elizabeth Warren and Ron Wyden joined the bill as co-sponsors, along with eight other lawmakers.\n &#34;I&#39;m proud to be fighting for a future that is free of invasive and racist surveillance tools, and I thank my colleagues in the Senate and House of Representatives as well as the groups across the country who have joined the effort to stop government use of biometric technologies,&#34; Sen. Markey said in a statement.\n Facial recognition concerns stem from the  technology&#39;s track record of racial bias, with researchers finding that it frequently  misidentifies people of color, and women. That&#39;s led to cases where  Black men were wrongfully arrested because of the technology, prompting a rising call to stop police from using facial recognition.\n                                             Though companies like  Amazon and  Microsoft have called for national regulations on facial recognition,  they haven&#39;t backed this bill.\n Ban Facial Recognition is a coalition of 42 organizations that are against the technology, including Fight for the Future, the Electronic Privacy Information Center, Color of Change, Athena and Demand Progress.\n   The scorecard includes a prompt beneath each lawmaker&#39;s listing that encourages visitors to tweet at their local legislator to urge support of the bill.\n &#34;Lawmakers can&#39;t claim to care about civil liberties, freedom, democracy, racial justice or human rights if they aren&#39;t supporting this common sense legislation to stop the use of biased and invasive surveillance technology that&#39;s as dangerous as nuclear or biological weapons,&#34; Evan Greer, deputy director of Fight for the Future, said in a statement.\n  Be respectful, keep it civil and stay on topic. We delete comments that violate  our policy, which we encourage you to read. Discussion threads can be closed at any time at our discretion.", "posttime": "2020-07-25 09:27:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "禁令,warren,技术", "title": "桑德斯、沃伦和怀登支持国家面部识别禁令法案", "title_en": "Sanders, Warren, and Wyden back national facial recognition ban bill", "transed": 1, "url": "https://www.cnet.com/news/senators-bernie-sanders-elizabeth-warren-and-ron-wyden-back-national-facial-recognition-ban-bill/", "via": "", "real_tags": ["禁令", "warren", "技术"]}, {"category": "", "categoryclass": "", "imagename": "21f57469bbd86d18e1fee863ef730067.jpeg", "infoid": 1014067, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "科技透明度项目(Tech Transparency Project)通过公开记录请求获得的一份文件显示，德克萨斯州是司法部长正在调查苹果公司(Apple)潜在违反消费者保护法的几个州之一。\nAxios最先报道的这份文件称，德克萨斯州总检察长办公室预计会就此事提起诉讼。\n该文件没有详细说明调查的范围，德克萨斯州欺骗行为法案涵盖了广泛的潜在危害。\n科技透明度项目(Tech Transparency Project)通过公开记录请求获得并与CNBC分享的一份文件显示，德克萨斯州是司法部长正在调查苹果可能违反消费者保护法的几个州之一。\n这份文件于3月份发出，最先由Axios报道。文件称，德克萨斯州总检察长办公室消费者保护部(Consumer Protection Department)正在参与一项针对苹果公司的多州调查，调查可能违反了“德克萨斯州欺骗性贸易行为法”(Texas Deceptive Trade Practices Act)。文件称，调查是出于执法目的而启动的，该办公室预计会就此事提起诉讼。\n该文件没有详细说明调查的范围，德克萨斯州欺骗行为法案涵盖了广泛的潜在危害。苹果股价周四下跌超过4%。\n苹果正面临美国和海外的反垄断审查，其首席执行官将于周一与大型科技公司的同行一起面对国会。\n德克萨斯州总检察长办公室的一位发言人表示，由于其内部政策，我们不能对任何潜在的或正在进行的调查发表评论、确认或否认。", "note_en": "Texas is among a group of states whose attorneys general are probing Apple over a potential consumer protection law violation, according to a document obtained by the Tech Transparency Project through an open records request.\n The document, first reported by Axios, says Texas&#39; attorney general office &#34;anticipates litigation in this matter.&#34;\n The document does not detail the scope of the investigation, and the Texas Deceptive Practices Act covers a wide range of potential harms.\n Texas is among a group of states whose attorneys general are probing  Apple over potential violations of a consumer protection law, according to a  document obtained by the Tech Transparency Project through an open records request and shared with CNBC.\n The document, sent in March and first reported by  Axios, states that the Consumer Protection Division of Texas&#39; attorney general office &#34;is involved in a multistate investigation into Apple for potential violations of the Texas Deceptive Trade Practices Act.&#34; It says the investigation was started &#34;for enforcement purposes&#34; and the office &#34;anticipates litigation in this matter.&#34;\n  The document does not detail the scope of the investigation and the  Texas Deceptive Practices Act covers a wide range of potential harms. Apple shares were down more than 4% Thursday.\n Apple is facing antitrust scrutiny in the U.S. and abroad and its CEO will face Congress on Monday alongside Big Tech peers.\n A spokesperson for the Texas Attorney General&#39;s office said that due to its internal policy, &#34;we cannot comment on, confirm or deny any potential or ongoing investigations.&#34;", "posttime": "2020-07-25 09:06:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,美国,apple,调查,probe", "title": "美国调查苹果可能违反消费者保护规定", "title_en": "States Probe Apple For Potential Consumer Protection Violation", "transed": 1, "url": "https://www.cnbc.com/2020/07/23/states-probe-apple-for-potential-consumer-protection-violation.html", "via": "", "real_tags": ["苹果", "美国", "apple", "调查", "probe"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014066, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我必须告诉你们卡尔曼滤波器，因为它的功能非常惊人。\n令人惊讶的是，似乎很少有软件工程师和科学家知道它，这让我感到难过，因为它是一个在存在不确定性的情况下组合信息的如此通用和强大的工具。有时，它提取准确信息的能力似乎近乎神奇-如果听起来我夸大其词了，那么看看之前发布的这段视频，我演示了卡尔曼滤波器通过观察自由漂浮体的速度来计算其方向。非常整洁！\n你可以在任何你有关于某个动态系统的不确定信息的地方使用卡尔曼滤波器，并且你可以对系统下一步要做什么做出一个有根据的猜测。即使混乱的现实出现，干扰了你猜测的干净运动，卡尔曼滤波器通常也能很好地弄清楚实际发生了什么。它可以利用疯狂现象之间的相互关系，这可能是你可能没有想过要利用的！\n卡尔曼滤波器是不断变化的系统的理想选择。它们的优点是内存很少(除了以前的状态不需要保存任何历史记录)，而且速度非常快，这使得它们非常适合实时问题和嵌入式系统。\n在谷歌上的大多数地方，实现卡尔曼滤波器的数学看起来都相当可怕和不透明。这是一种糟糕的情况，因为如果你正确地看待卡尔曼滤波器，它实际上是超级简单和容易理解的。因此，它是一个很棒的文章主题，我会尝试用很多清晰、漂亮的图片和颜色来说明它。前提条件很简单，您只需要对概率和矩阵有基本的了解。\n我将从一个卡尔曼滤波器可以解决的松散的例子开始，但是如果您想要直接进入闪亮的图片和数学，请随意跳到前面。\n让我们来做一个玩具例子：你已经建造了一个可以在树林里漫步的小机器人，机器人需要确切地知道它的位置，这样它才能导航。\n我们假设我们的机器人有一个状态\\(\\vec{x_k}\\)，它只是一个位置和一个速度：\n请注意，状态只是关于系统底层配置的数字列表；它可以是任何东西。在我们的示例中，它是位置和速度，但它可以是关于油箱中的液量、汽车引擎的温度、用户手指在触摸板上的位置或需要跟踪的任何数量的数据。\n我们的机器人还有一个GPS传感器，可以精确到10米左右，这很好，但是它需要知道它的位置比10米更精确。这些树林里有很多沟壑和悬崖，如果机器人错了几英尺以上，它可能会掉下悬崖。所以GPS本身还不够好。\n我们可能也知道机器人是如何移动的：它知道发送给车轮马达的命令，它知道如果它朝一个方向前进，没有任何干扰，下一刻它很可能会沿着这个方向走得更远。但当然，它并不完全了解它的运动：它可能会受到风的冲击，轮子可能会稍微打滑，或者在崎岖的地形上滚动；所以轮子转动的量可能不能准确地代表机器人实际行驶了多远，预测也不会很完美。\nGPS传感器告诉我们一些关于这个州的信息，但只是间接的，而且有一些不确定或不准确的地方。我们的预测告诉了我们一些关于机器人如何移动的信息，但只是间接的，而且有一些不确定性或不准确性。\n但是，如果我们使用所有可用的信息，我们能得到一个比这两个估计本身给我们的更好的答案吗？答案当然是肯定的，这就是卡尔曼滤波器的作用。\n让我们来看看我们试图诠释的风景。我们将继续简单的状态，只有位置和速度。$$\\vec{x}=\\BEGIN{bMatrix}p\\\\v\\end{bMatrix}$$。\n我们不知道实际的位置和速度是什么；有一系列可能的位置和速度的组合可能是真的，但其中一些比另一些更有可能：\n卡尔曼滤波器假设两个变量(在我们的情况下，位置和速度)都是随机的，并且是高斯分布的。每个变量都有一个平均值\\(\\µ\\)和一个方差\\(\\sigma^2\\)，前者是随机分布(及其最可能的状态)的中心，后者是不确定性：\n在上图中，位置和速度是不相关的，这意味着一个变量的状态不会告诉您另一个变量可能是什么。\n下面的例子显示了一些更有趣的东西：位置和速度是相关的。观察特定位置的可能性取决于你的速度：\n例如，如果我们根据旧的仓位估计新的仓位，可能会出现这种情况。如果我们的速度高，我们可能会移动得更远，所以我们的位置会更远。如果我们走得慢，我们就没走那么远。\n跟踪这种关系真的很重要，因为它给了我们更多的信息：一种测量告诉我们其他的可能是什么。这就是卡尔曼滤波器的目标，我们想要从我们不确定的测量中尽可能多地压缩信息！\n这种相关性被称为协方差矩阵的东西捕获。简而言之，矩阵\\(\\sigma_{ij}\\)的每个元素是第i个状态变量和第j个状态变量之间的相关度。(您可能会猜到协方差矩阵是对称的，这意味着即使您交换i和j也无关紧要)。协方差矩阵通常被标记为“\\(\\mathbf{\\sigma}\\)”，因此我们称其元素为“\\(\\sigma_{ij}\\)”。\n我们将关于状态的知识建模为高斯斑点，因此在时间\\(K)需要两条信息：我们将最佳估计称为\\(\\mathbf{\\hat{x}_k}\\)(平均值，别处称为\\(\\µ\\))，以及它的协方差矩阵\\(\\mathbf{P_k}\\)。$$\\BEGIN{公式}\\LABEL{eq：statevars}\\BEGIN{Aligned}\\mathbf{\\hat{x}}_k&amp；=\\Begin{bMatrix}\\text{position}\\text{ocity}\\end{bMatrix}\\mathbf{P}_k&amp；=\\Begin{bMatrix}\\Sigma_{pp}&amp；\\Sigma_{pv}\\Sigma_{VP}&amp；\\Sigma_{vv}\\End{bMatrix}\\End{Alignment}\\End{公式}$$。\n(当然，我们在这里只使用位置和速度，但请记住，状态可以包含任意数量的变量，并且可以表示您想要的任何内容，这一点很有用)。\n接下来，我们需要一些方法来查看当前状态(在时间k-1)并预测在时间k的下一个状态。记住，我们不知道哪个状态是“真实的”状态，但是我们的预测函数并不关心。它只适用于所有这些组件，并为我们提供了一个新的分布：\n它获取原始估计中的每个点，并将其移动到新的预测位置，如果原始估计是正确的，则系统将移动到该位置。\n让我们把这个贴上。我们如何使用矩阵来预测未来下一个时刻的位置和速度？我们将使用一个非常基本的运动学公式：$$\\BEGIN{SPLIT}\\COLOR{深粉色}{p_k}&amp；=\\color{royalBlue}{p_{k-1}}+\\Delta t&amp；\\color{royalBlue}{v_{k-1}}\\color{深粉色}{v_k}&amp；=&amp；\\color{royalBlue}{v_{k-1}}\\end{plit}$$换言之：$$\\BEGIN{ALIGN}\\COLOR{深粉红色}{\\mathbf{\\hat{x}}_k}&amp；=\\Begin{bMatrix}1&amp；\\Delta t\\\\0&amp；1\\end{bMatrix}\\color{royalBlue}{\\mathbf{\\hat{x}}_{k-1}}\\\\&amp；=\\mathbf{F}_k\\color{royalBlue}{\\mathbf{\\hat{x}}_{k-1}}\\Label{statevars}\\end{Align}$$。\n我们现在有了一个预测矩阵，它给出了我们的下一个状态，但我们仍然不知道如何更新协方差矩阵。\n这就是我们需要另一个公式的地方。如果我们将分布中的每个点乘以一个矩阵\\(\\color{Firerick}{\\mathbf{A}}\\)，那么它的协方差矩阵\\(\\sigma\\)会发生什么？\n嗯，这很简单。我只给您提供身份：$$\\BEGIN{SPLIT}CoV(X)&amp；=\\Sigma\\\\CoV(\\color{Firerick}{\\mathbf{A}}x)&amp；=\\color{Firerick}{\\mathbf{A}}\\Sigma\\color{Firerick}{\\mathbf{A}}^T\\end{Split}\\Label{covident}\\end{equence}$$。\n不过，我们并没有捕捉到所有的东西。可能会有一些与国家本身无关的变化--外部世界可能正在影响系统。\n例如，如果国家模拟火车的运动，火车操作员可能会推油门，导致火车加速。类似地，在我们的机器人示例中，导航软件可能会发出转动轮子或停止的命令。如果我们知道这些关于世界上正在发生的事情的额外信息，我们可以把它塞进一个叫做\\(\\color{暗橙色}{\\vec{\\mathbf{u}_k}}\\)的向量中，对它做些什么，然后把它作为修正添加到我们的预测中。\n假设我们知道由于油门设置或控制命令而产生的预期加速度\\(\\color{暗橙色}{a}\\)。从基本运动学出发，我们得到：$$\\BEGIN{SPLIT}\\COLOR{深红}{p_k}&amp；=\\color{royalBlue}{p_{k-1}}+{\\Delta t}&amp；\\color{royalBlue}{v_{k-1}}+&amp；\\frac{1}{2}\\color{深橙}{a}{\\Delta t}^2\\color{深红}{v_k}&amp；=&。\\color{royalBlue}{v_{k-1}}+&amp；\\color{深橙色}{a}{\\Delta t}\\end{Split}$$矩阵形式：$$\\BEGIN{等式}\\BEGIN{SPLIT}\\COLOR{深粉色}{\\mathbf{\\hat{x}}_k}&amp；=\\mathbf{F}_k\\color{royalBlue}{\\mathbf{\\hat{x}}_{k-1}}+\\Begin{bMatrix}\\frac{\\Delta t^2}{2}\\Delta t\\end{bMatrix}\\color{深橙色}{a}\\\\&amp；=\\mathbf{F}_k\\color{royalBlue}{\\mathbf{\\hat{x}}_{k-1}}+\\mathbf{B}_k\\color{暗橙色}{\\vec{\\mathbf{u}_k}}\\end{分割}\\end{等式}$$\n\\(\\mathbf{B}_k\\)称为控制矩阵，\\(\\color{暗橙色}{\\vec{\\mathbf{u}_k}}\\)称为控制向量。(对于没有外部影响的非常简单的系统，您可以省略这些参数)。\n让我们再增加一个细节。如果我们的预测对实际发生的事情不是100%准确的模型，会发生什么呢？\n如果国家根据自己的属性发展，一切都很好。只要我们知道那些外力是什么，如果国家是基于外力发展的，一切都是好的。\n但是我们不知道的力量呢？例如，如果我们正在跟踪一架四轴飞行器，它可能会受到风的冲击。如果我们追踪轮式机器人，轮子可能会打滑，或者地面上的颠簸可能会减慢它的速度。我们无法跟踪这些事情，如果这些事情发生了，我们的预测可能会出错，因为我们没有考虑到这些额外的力量。\n通过在每个预测步骤之后添加一些新的不确定性，我们可以对与“世界”(即我们没有跟踪的东西)相关的不确定性进行建模：\n在我们最初的估计中，每个州都可以转移到一个范围内的州。因为我们非常喜欢高斯斑点，所以我们会说\\(\\color{royalBlue}{\\mathbf{\\hat{x}}_{k-1}}\\)中的每个点都被移动到具有协方差的高斯斑点\\(\\color{mediumaquamarine}{\\mathbf{q}_k}\\)中的某个位置。另一种说法是，我们将未跟踪的影响视为具有协方差的噪声\\(\\color{mediumaquamarine}{\\mathbf{q}_k}\\)。\n我们通过简单地添加\\({\\color{mediumaquamarine}{\\mathbf{q}_k}}\\)来获得扩展的协方差，给出预测步骤的完整表达式：$$\\BEGIN{等式}\\BEGIN{SPLIT}\\COLOR{深粉}{\\mathbf{\\hat{x}}_k}&amp；=\\mathbf{F}_k\\color{royalBlue}{\\mathbf{\\hat{x}}_{k-1}}+\\mathbf{B}_k\\color{暗橙色}{\\vec{\\mathbf{u}_k}}\\color{深粉色}{\\mathbf{P}_k}&amp；=\\mathbf{F_k}\\color{royalBlue}{\\mathbf{P}_{k-1}}\\mathbf{F}_k^T+\\color{mediumaquamarine}{\\mathbf{q}_k}\\end{Split}\\Label{kalrectfull}\\end{等式}$$。\n换句话说，新的最佳估计是根据先前的最佳估计作出的预测，加上对已知外部影响的修正。\n新的不确定性是从旧的不确定性中预测出来的，另外还有一些来自环境的不确定性。\n好了，这已经很简单了。我们对我们的系统可能所在的位置有一个模糊估计，由\\(\\color{深粉}{\\mathbf{\\hat{x}}_k}\\)和\\(\\color{深粉}{\\mathbf{P}_k}\\)给出。当我们从传感器获得一些数据时会发生什么？\n我们可能有几个传感器，它们可以给我们提供有关系统状态的信息。就目前而言，他们测量什么并不重要；也许一个人读取位置，另一个人读取速度。每个传感器都间接地告诉我们一些关于状态的信息--换句话说，传感器对一个状态进行操作，并产生一组读数。\n请注意，读数的单位和比例可能与我们跟踪的州的单位和比例不同。您可能会猜到这是怎么回事：我们将使用矩阵\\(\\mathbf{H}_k\\)为传感器建模。\n我们可以用通常的方式计算出我们期望看到的传感器读数的分布：$$\\BEGIN{公式}\\BEGIN{ALIGNED}\\vec{\\mu}_{\\text{Expect}}&amp；=\\mathbf{H}_k\\color{深粉红色}{\\mathbf{\\hat{x}}_k}\\mathbf{\\Sigma}_{\\text{Expect}}&amp；=\\mathbf{H}_k\\color{深粉红色}{\\mathbf{P}_k}\\mathbf{H}_k^T\\end{aligned}\\end{等式}$$。\n卡尔曼滤波器最擅长的一件事就是处理传感器噪声。换句话说，我们的传感器至少在某种程度上是不可靠的，我们最初估计的每个状态都可能导致一定范围的传感器读数。\n从我们观察到的每一个读数，我们可能会猜测我们的系统处于一种特定的状态。但由于存在不确定性，一些州比其他州更有可能产生我们看到的读数：\n我们将这种不确定性的协方差(即传感器噪声的协方差)称为\\(\\color{mediumaquamarine}{\\mathbf{R}_k}\\)。分布的平均值等于我们观察到的读数，我们称之为\\(\\color{Yellowgreen}{\\vec{\\mathbf{z}_k}}\\)。\n所以现在我们有两个高斯斑点：一个围绕着我们变换后的预测平均值，另一个围绕着我们得到的实际传感器读数。\n我们必须尝试使我们对基于预测状态(粉色)看到的读数的猜测与基于我们实际观察到的传感器读数(绿色)的不同猜测相一致。\n那么我们最有可能的新州是什么？对于任何可能的读数\\((z_1，z_2)\\)，我们有两个相关的概率：(1)我们的传感器读数\\(\\color{Yellowgreen}{\\vec{\\mathbf{z}_k}}\\)是\\(z_1，z_2)\\的(误)测量的概率，以及(2)我们先前估计认为\\(z_1，z_2)\\是我们应该看到的读数的概率。\n如果我们有两个概率，我们想知道这两个概率都为真的概率，我们就把它们相乘。因此，我们将这两个高斯斑点相乘：\n我们剩下的就是重叠部分，也就是两个斑点都很明亮/可能的区域。而且它比我们之前的任何一个估计都要精确得多。这个分布的平均值是两个估计值都最有可能的配置，因此，在我们拥有所有信息的情况下，它是对真实配置的最佳猜测。\n结果是，当您用独立的均值和协方差矩阵乘以两个高斯斑点时，就会得到一个具有其自己的均值和协方差矩阵的新的高斯斑点！也许您可以看到这是怎么回事：一定有一个公式可以从旧参数中获得这些新参数！\n让我们找出那个公式。首先从一个维度来看这是最容易的。具有方差和均值的一维高斯钟形曲线定义为：$$开始{方程}\\标签{高斯公式}\\数学{N}(x，\\µ，\\sigma)=\\frac{1}{\\sigma\\sqrt{2\\pi}}e^{-\\frac{(x-\\µ)^2}{2\\sigma^2}}\\end{方程}$$。\n我们想知道当你把两条高斯曲线相乘时会发生什么。下面的蓝色曲线表示两个高斯总体的(未规格化)交集：\n$$\\BEGIN{公式}\\LABEL{gausequiv}\\Mathcal{N}(x，\\color{紫红色}{\\MU_0}，\\color{深粉红色}{\\sigma_0})\\cdot\\Mathcal{N}(x，\\color{Yellowgreen}{\\Mu_1}，\\color{mediumaquamarine}{\\sigma_1})\\stackrel{？}{=}\\Mathcal{N}(x，\\。\\color{mediumBlue}{\\sigma‘})\\end{公式}$$。\n您可以将公式\\(\\eqref{gaussform}\\)代入公式\\(\\eqref{gausequiv}\\)，然后做一些代数运算(注意重新正规化，使总概率为1)，得到：$$\\BEGIN{公式}\\LABEL{FusionFormal}\\BEGIN{ALIGNED}\\COLOR{royalBlue}{\\mu‘}&amp；=\\MU_0+\\FRAC{\\sigma_0^2(\\MU_1-\\MU_0)}{\\sigma_0^2+\\sigma_1^2}\\\\color{mediumBlue}{\\sigma‘}^2&amp；=\\sigma_0^2-\\frac{\\sigma_0^4}{\\sigma_0^2+\\sigma_1^2}\\end{aligned}\\end{公式}$。\n我们可以通过分解一小块并将其命名为\\(\\color{紫色}{\\mathbf{k}}\\)来简化：$$\\BEGIN{公式}\\Label{增益公式}\\color{紫色}{\\mathbf{k}}=\\frac{\\sigma_0^2}{\\sigma_0^2+\\sigma_1^2}\\end{公式}$\\Begin{公式}\\Begin{Split}\\color{royalBlue}{。\\COLOR{紫色}{\\mathbf{k}}(\\MU_1-\\MU_0)\\COLOR{mediumBlue}{\\sigma‘}^2&amp；=\\sigma_0^2-&amp；\\color{紫色}{\\mathbf{k}}\\sigma_0^2\\end{Split}\\Label{更新}\\end{等式}$$。\n记下你如何才能接受你以前的估计，并添加一些东西来做出新的估计。看看这个公式是多么简单！\n但是矩阵版本呢？好，让我们用矩阵形式重写公式\\(\\eqref{收益公式}\\)和\\(\\eqref{update}\\)。如果\\(\\Sigma\\)是高斯斑点的协方差矩阵，且\\(\\vec{\\µ}\\)其沿每个轴的平均值，则：$$\\BEGIN{公式}\\LABEL{矩阵增益}\\COLOR{紫色}{\\mathbf{K}}=\\SIGMA_0(\\SIGMA_0+\\SIGMA_1)^{-1}\\END{等式}$\\BEGIN{等式}\\BEGIN{SPLIT}\\COLOR{roc。\\COLOR{紫色}{\\mathbf{K}}(\\vec{\\MU_1}-\\VEC{\\MU_0})\\COLOR{mediumBlue}{\\Sigma‘}&amp；=\\Sigma_0-&amp；\\COLOR{紫色}{\\mathbf{K}}\\Sigma_0\\End{Split}\\Label{matrixupdate}\\end{公式}$$。\n\\(颜色{紫色}{\\mathbf{K}}\\)是一个称为卡尔曼增益的矩阵，我们稍后会用到它。\n我们有两个分布：预测测量值为\\((\\color{FUHSIA}{\\MU_0}，\\COLOR{深粉红色}{\\Sigma_0})=(\\COLOR{FUHHIA}{\\mathbf{H}_k\\mathbf{\\hat{x}}_k}，\\color{深粉红色}{\\mathbf{H}_k\\mathbf{P}_k\\mathbf{H}_k^T})\\)。Color{mediumaquamarine}{\\sigma_1})=(color{yellowgreen}{\\vec{\\mathbf{z}_k}}，\\color{mediumaquamarine}{\\mathbf{R}_k})\\)。我们只需将它们插入公式\\(\\eqref{matrixupdate}\\)中即可找到它们的重叠部分：$$\\BEGIN{EQREQUDE}\\BEGIN{ALIGNED}\\mathbf{H}_k\\color{royalBlue}{\\mathbf{\\hat{x}}_k‘}&amp；=\\color{FUHSIA}{\\mathbf{H}_k\\mathbf{\\hat{x}}_k}&amp；\\color{紫色}{\\mathbf{K}}(\\color{Yellowgreen}{\\vec{\\mathbf{z}_k}}-\\color{紫红色}{\\mathbf{H}_k\\mathbf{\\hat{x}}_k})\\mathbf{H}_k\\color{royalBlue}{\\mathbf{P}_k‘}\\mathbf{H}_k^。=\\color{深粉红色}{\\mathbf{H}_k\\mathbf{P}_k\\mathbf{H}_k^T}&amp；-&amp；\\color{紫色}{\\mathbf{K}}\\color{深粉色}{\\mathbf{H}_k\\mathbf{P}_k\\mathbf{H}_k^T}\\end{aligned}\\label{kalunsimplify}\\end{等式}$$和来自\\(\\eqref{matrixain}\\)，卡尔曼增益为：$$\\BEGIN{等式}\\LABEL{eq：kalgainunimplify}\\color{紫色}{\\mathbf{K}}=\\color{深粉}{\\mathbf{H}_k\\mathbf{P}_k\\mathbf{H}_k^T}(\\color{深粉}{\\mathbf{H}_k\\mathbf{P}_k\\mathbf{H}_k^。我们可以将\\(\\eqref{kalunsimplfied}\\)和\\(\\eqref{eq：kalgainunsimplfied}\\)中的每个项的前面去掉\\(\\mathbf{H}_k\\)(请注意，其中一个隐藏在\\(\\color{紫色}{\\mathbf{K}}\\)中)，和公式中所有项末尾的{\\mathbf{P}_k‘}}(\\color{royalBlue}{\\mathbf{P}_k’}\\)之间的一个\\(\\mathbf{H}_k^T\\)。$$\\BEGIN{公式}\\BEGIN{SPLIT}\\COLOR{royalBlue}{\\mathbf{\\hat{x}}_k‘}&amp；=\\color{Firhsia}{\\mathbf{\\hat{x}}_k}&amp；+&amp；\\color{紫色}{\\mathbf{K}‘}(\\color{Yellowgreen}{\\vec{\\mathbf{z}_k}}-\\color{紫红色}{\\mathbf{H}_k\\mathbf{\\hat{x}}_k})\\color{ro。\n.", "note_en": "I have to tell you about the Kalman filter, because what it does is pretty damn amazing.\n Surprisingly few software engineers and scientists seem to know about it, and that makes me sad because it is such a general and powerful tool for  combining information in the presence of uncertainty. At times its ability to extract accurate information seems almost magical— and if it sounds like I’m talking this up too much, then take a look at  this previously posted video where I demonstrate a Kalman filter figuring out the  orientation of a free-floating body by looking at its  velocity. Totally neat!\n  You can use a Kalman filter in any place where you have  uncertain information about some dynamic system, and you can make an  educated guess about what the system is going to do next. Even if messy reality comes along and interferes with the clean motion you guessed about, the Kalman filter will often do a very good job of figuring out what actually happened. And it can take advantage of correlations between crazy phenomena that you maybe wouldn’t have thought to exploit!\n Kalman filters are ideal for systems which are  continuously changing. They have the  advantage that they are light on memory (they don’t need to keep any history other than the previous state), and they are very fast, making them well suited for real time problems and embedded systems.\n The math for implementing the Kalman filter appears pretty scary and opaque in most places you find on Google. That’s a bad state of affairs, because the Kalman filter is actually super simple and easy to understand if you look at it in the right way. Thus it makes a great article topic, and I will attempt to illuminate it with lots of clear, pretty pictures and colors. The prerequisites are simple; all you need is a basic understanding of probability and matrices.\n I’ll start with a loose example of the kind of thing a Kalman filter can solve, but if you want to get right to the shiny pictures and math, feel free to  jump ahead.\n  Let’s make a toy example: You’ve built a little robot that can wander around in the woods, and the robot needs to know exactly where it is so that it can navigate.\n  We’ll say our robot has a state \\( \\vec{x_k} \\), which is just a position and a velocity:\n  Note that the state is just a list of numbers about the underlying configuration of your system; it could be anything. In our example it’s position and velocity, but it could be data about the amount of fluid in a tank, the temperature of a car engine, the position of a user’s finger on a touchpad, or any number of things you need to keep track of.\n Our robot also has a GPS sensor, which is accurate to about 10 meters, which is good, but it needs to know its location more precisely than 10 meters. There are lots of gullies and cliffs in these woods, and if the robot is wrong by more than a few feet, it could fall off a cliff. So GPS by itself is not good enough.\n  We might also know something about how the robot moves: It knows the commands sent to the wheel motors, and its knows that if it’s headed in one direction and nothing interferes, at the next instant it will likely be further along that same direction. But of course it doesn’t know everything about its motion: It might be buffeted by the wind, the wheels might slip a little bit, or roll over bumpy terrain; so the amount the wheels have turned might not exactly represent how far the robot has actually traveled, and the prediction won’t be perfect.\n The GPS  sensor tells us something about the state, but only indirectly, and with some uncertainty or inaccuracy. Our  prediction tells us something about how the robot is moving, but only indirectly, and with some uncertainty or inaccuracy.\n But if we use all the information available to us, can we get a better answer than  either estimate would give us by itself? Of course the answer is yes, and that’s what a Kalman filter is for.\n   Let’s look at the landscape we’re trying to interpret. We’ll continue with a simple state having only position and velocity. $$ \\vec{x} = \\begin{bmatrix} p\\\\ v \\end{bmatrix}$$\n We don’t know what the  actual position and velocity are; there are a whole range of possible combinations of position and velocity that might be true, but some of them are more likely than others:\n  The Kalman filter assumes that both variables (postion and velocity, in our case) are random and  Gaussian distributed. Each variable has a  mean value \\(\\mu\\), which is the center of the random distribution (and its most likely state), and a  variance \\(\\sigma^2\\), which is the uncertainty:\n  In the above picture, position and velocity are  uncorrelated, which means that the state of one variable tells you nothing about what the other might be.\n The example below shows something more interesting: Position and velocity are  correlated. The likelihood of observing a particular position depends on what velocity you have:\n This kind of situation might arise if, for example, we are estimating a new position based on an old one. If our velocity was high, we probably moved farther, so our position will be more distant. If we’re moving slowly, we didn’t get as far.\n This kind of relationship is really important to keep track of, because it gives us  more information: One measurement tells us something about what the others could be. And that’s the goal of the Kalman filter, we want to squeeze as much information from our uncertain measurements as we possibly can!\n This correlation is captured by something called a  covariance matrix. In short, each element of the matrix \\(\\Sigma_{ij}\\) is the degree of correlation between the  ith state variable and the  jth state variable. (You might be able to guess that the covariance matrix is  symmetric, which means that it doesn’t matter if you swap  i and  j). Covariance matrices are often labelled “\\(\\mathbf{\\Sigma}\\)”, so we call their elements “\\(\\Sigma_{ij}\\)”.\n   We’re modeling our knowledge about the state as a Gaussian blob, so we need two pieces of information at time \\(k\\): We’ll call our best estimate \\(\\mathbf{\\hat{x}_k}\\) (the mean, elsewhere named \\(\\mu\\) ), and its covariance matrix \\(\\mathbf{P_k}\\). $$ \\begin{equation} \\label{eq:statevars} \\begin{aligned} \\mathbf{\\hat{x}}_k &amp;= \\begin{bmatrix} \\text{position}\\\\ \\text{velocity} \\end{bmatrix}\\\\ \\mathbf{P}_k &amp;= \\begin{bmatrix} \\Sigma_{pp} &amp; \\Sigma_{pv} \\\\ \\Sigma_{vp} &amp; \\Sigma_{vv} \\\\ \\end{bmatrix} \\end{aligned} \\end{equation} $$\n (Of course we are using only position and velocity here, but it’s useful to remember that the state can contain any number of variables, and represent anything you want).\n Next, we need some way to look at the   current state (at time   k-1) and  predict the  next state at time   k. Remember, we don’t know which state is the “real” one, but our prediction function doesn’t care. It just works on  all of them, and gives us a new distribution:\n  It takes  every point in our original estimate and moves it to a new predicted location, which is where the system would move if that original estimate was the right one.\n Let’s apply this. How would we use a matrix to predict the position and velocity at the next moment in the future? We’ll use a really basic kinematic formula:$$ \\begin{split} \\color{deeppink}{p_k} &amp;= \\color{royalblue}{p_{k-1}} + \\Delta t &amp;\\color{royalblue}{v_{k-1}} \\\\ \\color{deeppink}{v_k} &amp;= &amp;\\color{royalblue}{v_{k-1}} \\end{split} $$ In other words: $$ \\begin{align} \\color{deeppink}{\\mathbf{\\hat{x}}_k} &amp;= \\begin{bmatrix} 1 &amp; \\Delta t \\\\ 0 &amp; 1 \\end{bmatrix} \\color{royalblue}{\\mathbf{\\hat{x}}_{k-1}} \\\\ &amp;= \\mathbf{F}_k \\color{royalblue}{\\mathbf{\\hat{x}}_{k-1}} \\label{statevars} \\end{align} $$\n We now have a  prediction matrix which gives us our next state, but we still don’t know how to update the covariance matrix.\n This is where we need another formula. If we multiply every point in a distribution by a matrix \\(\\color{firebrick}{\\mathbf{A}}\\), then what happens to its covariance matrix \\(\\Sigma\\)?\n Well, it’s easy. I’ll just give you the identity:$$ \\begin{equation} \\begin{split} Cov(x) &amp;= \\Sigma\\\\ Cov(\\color{firebrick}{\\mathbf{A}}x) &amp;= \\color{firebrick}{\\mathbf{A}} \\Sigma \\color{firebrick}{\\mathbf{A}}^T \\end{split} \\label{covident} \\end{equation} $$\n   We haven’t captured everything, though. There might be some changes that  aren’t related to the state itself— the outside world could be affecting the system.\n For example, if the state models the motion of a train, the train operator might push on the throttle, causing the train to accelerate. Similarly, in our robot example, the navigation software might issue a command to turn the wheels or stop. If we know this additional information about what’s going on in the world, we could stuff it into a vector called \\(\\color{darkorange}{\\vec{\\mathbf{u}_k}}\\), do something with it, and add it to our prediction as a correction.\n Let’s say we know the expected acceleration \\(\\color{darkorange}{a}\\) due to the throttle setting or control commands. From basic kinematics we get: $$ \\begin{split} \\color{deeppink}{p_k} &amp;= \\color{royalblue}{p_{k-1}} + {\\Delta t} &amp;\\color{royalblue}{v_{k-1}} + &amp;\\frac{1}{2} \\color{darkorange}{a} {\\Delta t}^2 \\\\ \\color{deeppink}{v_k} &amp;= &amp;\\color{royalblue}{v_{k-1}} + &amp; \\color{darkorange}{a} {\\Delta t} \\end{split} $$ In matrix form: $$ \\begin{equation} \\begin{split} \\color{deeppink}{\\mathbf{\\hat{x}}_k} &amp;= \\mathbf{F}_k \\color{royalblue}{\\mathbf{\\hat{x}}_{k-1}} + \\begin{bmatrix} \\frac{\\Delta t^2}{2} \\\\ \\Delta t \\end{bmatrix} \\color{darkorange}{a} \\\\ &amp;= \\mathbf{F}_k \\color{royalblue}{\\mathbf{\\hat{x}}_{k-1}} + \\mathbf{B}_k \\color{darkorange}{\\vec{\\mathbf{u}_k}} \\end{split} \\end{equation} $$\n \\(\\mathbf{B}_k\\) is called the  control matrix and \\(\\color{darkorange}{\\vec{\\mathbf{u}_k}}\\) the  control vector. (For very simple systems with no external influence, you could omit these).\n Let’s add one more detail. What happens if our prediction is not a 100% accurate model of what’s actually going on?\n  Everything is fine if the state evolves based on its own properties. Everything is  still fine if the state evolves based on external forces, so long as we know what those external forces are.\n But what about forces that we  don’t know about? If we’re tracking a quadcopter, for example, it could be buffeted around by wind. If we’re tracking a wheeled robot, the wheels could slip, or bumps on the ground could slow it down. We can’t keep track of these things, and if any of this happens, our prediction could be off because we didn’t account for those extra forces.\n We can model the uncertainty associated with the “world” (i.e. things we aren’t keeping track of) by adding some new uncertainty after every prediction step:\n  Every state in our original estimate could have moved to a  range of states. Because we like Gaussian blobs so much, we’ll say that each point in \\(\\color{royalblue}{\\mathbf{\\hat{x}}_{k-1}}\\) is moved to somewhere inside a Gaussian blob with covariance \\(\\color{mediumaquamarine}{\\mathbf{Q}_k}\\). Another way to say this is that we are treating the untracked influences as  noise with covariance \\(\\color{mediumaquamarine}{\\mathbf{Q}_k}\\).\n   We get the expanded covariance by simply  adding \\({\\color{mediumaquamarine}{\\mathbf{Q}_k}}\\), giving our complete expression for the  prediction step: $$ \\begin{equation} \\begin{split} \\color{deeppink}{\\mathbf{\\hat{x}}_k} &amp;= \\mathbf{F}_k \\color{royalblue}{\\mathbf{\\hat{x}}_{k-1}} + \\mathbf{B}_k \\color{darkorange}{\\vec{\\mathbf{u}_k}} \\\\ \\color{deeppink}{\\mathbf{P}_k} &amp;= \\mathbf{F_k} \\color{royalblue}{\\mathbf{P}_{k-1}} \\mathbf{F}_k^T + \\color{mediumaquamarine}{\\mathbf{Q}_k} \\end{split} \\label{kalpredictfull} \\end{equation} $$\n In other words, the   new best estimate is a  prediction made from   previous best estimate, plus a  correction for   known external influences.\n And the   new uncertainty is  predicted from the   old uncertainty, with some   additional uncertainty from the environment.\n All right, so that’s easy enough. We have a fuzzy estimate of where our system might be, given by \\(\\color{deeppink}{\\mathbf{\\hat{x}}_k}\\) and \\(\\color{deeppink}{\\mathbf{P}_k}\\). What happens when we get some data from our sensors?\n  We might have several sensors which give us information about the state of our system. For the time being it doesn’t matter what they measure; perhaps one reads position and the other reads velocity. Each sensor tells us something  indirect about the state— in other words, the sensors operate on a state and produce a set of  readings.\n Notice that the units and scale of the reading might not be the same as the units and scale of the state we’re keeping track of. You might be able to guess where this is going: We’ll model the sensors with a matrix, \\(\\mathbf{H}_k\\).\n  We can figure out the distribution of sensor readings we’d expect to see in the usual way: $$ \\begin{equation} \\begin{aligned} \\vec{\\mu}_{\\text{expected}} &amp;= \\mathbf{H}_k \\color{deeppink}{\\mathbf{\\hat{x}}_k} \\\\ \\mathbf{\\Sigma}_{\\text{expected}} &amp;= \\mathbf{H}_k \\color{deeppink}{\\mathbf{P}_k} \\mathbf{H}_k^T \\end{aligned} \\end{equation} $$\n One thing that Kalman filters are great for is dealing with  sensor noise. In other words, our sensors are at least somewhat unreliable, and every state in our original estimate might result in a  range of sensor readings.\n From each reading we observe, we might guess that our system was in a particular state. But because there is uncertainty,  some states are more likely than others to have have produced the reading we saw:\n We’ll call the  covariance of this uncertainty (i.e. of the sensor noise) \\(\\color{mediumaquamarine}{\\mathbf{R}_k}\\). The distribution has a  mean equal to the reading we observed, which we’ll call \\(\\color{yellowgreen}{\\vec{\\mathbf{z}_k}}\\).\n So now we have two Gaussian blobs: One surrounding the mean of our transformed prediction, and one surrounding the actual sensor reading we got.\n  We must try to reconcile our guess about the readings we’d see based on the  predicted state (  pink) with a  different guess based on our  sensor readings (  green) that we actually observed.\n So what’s our new most likely state? For any possible reading \\((z_1,z_2)\\), we have two associated probabilities:  (1) The probability that our sensor reading \\(\\color{yellowgreen}{\\vec{\\mathbf{z}_k}}\\) is a (mis-)measurement of \\((z_1,z_2)\\), and  (2) the probability that our previous estimate thinks \\((z_1,z_2)\\) is the reading we should see.\n If we have two probabilities and we want to know the chance that  both are true, we just multiply them together. So, we take the two Gaussian blobs and multiply them:\n  What we’re left with is the  overlap, the region where  both blobs are bright/likely. And it’s a lot more precise than either of our previous estimates. The mean of this distribution is the configuration for which  both estimates are most likely, and is therefore the  best guess of the true configuration given all the information we have.\n   As it turns out, when you multiply two Gaussian blobs with separate means and covariance matrices, you get a  new Gaussian blob with its  own mean and covariance matrix! Maybe you can see where this is going: There’s got to be a formula to get those new parameters from the old ones!\n  Let’s find that formula. It’s easiest to look at this first in  one dimension. A 1D Gaussian bell curve with variance \\(\\sigma^2\\) and mean \\(\\mu\\) is defined as: $$ \\begin{equation} \\label{gaussformula} \\mathcal{N}(x, \\mu,\\sigma) = \\frac{1}{ \\sigma \\sqrt{ 2\\pi } } e^{ -\\frac{ (x – \\mu)^2 }{ 2\\sigma^2 } } \\end{equation} $$\n We want to know what happens when you multiply two Gaussian curves together. The blue curve below represents the (unnormalized) intersection of the two Gaussian populations:\n  $$\\begin{equation} \\label{gaussequiv} \\mathcal{N}(x, \\color{fuchsia}{\\mu_0}, \\color{deeppink}{\\sigma_0}) \\cdot \\mathcal{N}(x, \\color{yellowgreen}{\\mu_1}, \\color{mediumaquamarine}{\\sigma_1}) \\stackrel{?}{=} \\mathcal{N}(x, \\color{royalblue}{\\mu’}, \\color{mediumblue}{\\sigma’}) \\end{equation}$$\n You can substitute equation \\(\\eqref{gaussformula}\\) into equation \\(\\eqref{gaussequiv}\\) and do some algebra (being careful to renormalize, so that the total probability is 1) to obtain: $$ \\begin{equation} \\label{fusionformula} \\begin{aligned} \\color{royalblue}{\\mu’} &amp;= \\mu_0 + \\frac{\\sigma_0^2 (\\mu_1 – \\mu_0)} {\\sigma_0^2 + \\sigma_1^2}\\\\ \\color{mediumblue}{\\sigma’}^2 &amp;= \\sigma_0^2 – \\frac{\\sigma_0^4} {\\sigma_0^2 + \\sigma_1^2} \\end{aligned} \\end{equation}$$\n We can simplify by factoring out a little piece and calling it \\(\\color{purple}{\\mathbf{k}}\\): $$ \\begin{equation} \\label{gainformula} \\color{purple}{\\mathbf{k}} = \\frac{\\sigma_0^2}{\\sigma_0^2 + \\sigma_1^2} \\end{equation} $$ $$ \\begin{equation} \\begin{split} \\color{royalblue}{\\mu’} &amp;= \\mu_0 + &amp;\\color{purple}{\\mathbf{k}} (\\mu_1 – \\mu_0)\\\\ \\color{mediumblue}{\\sigma’}^2 &amp;= \\sigma_0^2 – &amp;\\color{purple}{\\mathbf{k}} \\sigma_0^2 \\end{split} \\label{update} \\end{equation} $$\n Take note of how you can take your previous estimate and  add something to make a new estimate. And look at how simple that formula is!\n But what about a matrix version? Well, let’s just re-write equations \\(\\eqref{gainformula}\\) and \\(\\eqref{update}\\) in matrix form. If \\(\\Sigma\\) is the covariance matrix of a Gaussian blob, and \\(\\vec{\\mu}\\) its mean along each axis, then: $$ \\begin{equation} \\label{matrixgain} \\color{purple}{\\mathbf{K}} = \\Sigma_0 (\\Sigma_0 + \\Sigma_1)^{-1} \\end{equation} $$ $$ \\begin{equation} \\begin{split} \\color{royalblue}{\\vec{\\mu}’} &amp;= \\vec{\\mu_0} + &amp;\\color{purple}{\\mathbf{K}} (\\vec{\\mu_1} – \\vec{\\mu_0})\\\\ \\color{mediumblue}{\\Sigma’} &amp;= \\Sigma_0 – &amp;\\color{purple}{\\mathbf{K}} \\Sigma_0 \\end{split} \\label{matrixupdate} \\end{equation} $$\n \\(\\color{purple}{\\mathbf{K}}\\) is a matrix called the  Kalman gain, and we’ll use it in just a moment.\n   We have two distributions: The predicted measurement with \\( (\\color{fuchsia}{\\mu_0}, \\color{deeppink}{\\Sigma_0}) = (\\color{fuchsia}{\\mathbf{H}_k \\mathbf{\\hat{x}}_k}, \\color{deeppink}{\\mathbf{H}_k \\mathbf{P}_k \\mathbf{H}_k^T}) \\), and the observed measurement with \\( (\\color{yellowgreen}{\\mu_1}, \\color{mediumaquamarine}{\\Sigma_1}) = (\\color{yellowgreen}{\\vec{\\mathbf{z}_k}}, \\color{mediumaquamarine}{\\mathbf{R}_k})\\). We can just plug these into equation \\(\\eqref{matrixupdate}\\) to find their overlap: $$ \\begin{equation} \\begin{aligned} \\mathbf{H}_k \\color{royalblue}{\\mathbf{\\hat{x}}_k’} &amp;= \\color{fuchsia}{\\mathbf{H}_k \\mathbf{\\hat{x}}_k} &amp; + &amp; \\color{purple}{\\mathbf{K}} ( \\color{yellowgreen}{\\vec{\\mathbf{z}_k}} – \\color{fuchsia}{\\mathbf{H}_k \\mathbf{\\hat{x}}_k} ) \\\\ \\mathbf{H}_k \\color{royalblue}{\\mathbf{P}_k’} \\mathbf{H}_k^T &amp;= \\color{deeppink}{\\mathbf{H}_k \\mathbf{P}_k \\mathbf{H}_k^T} &amp; – &amp; \\color{purple}{\\mathbf{K}} \\color{deeppink}{\\mathbf{H}_k \\mathbf{P}_k \\mathbf{H}_k^T} \\end{aligned} \\label {kalunsimplified} \\end{equation} $$ And from \\(\\eqref{matrixgain}\\), the Kalman gain is: $$ \\begin{equation} \\label{eq:kalgainunsimplified} \\color{purple}{\\mathbf{K}} = \\color{deeppink}{\\mathbf{H}_k \\mathbf{P}_k \\mathbf{H}_k^T} ( \\color{deeppink}{\\mathbf{H}_k \\mathbf{P}_k \\mathbf{H}_k^T} + \\color{mediumaquamarine}{\\mathbf{R}_k})^{-1} \\end{equation} $$ We can knock an \\(\\mathbf{H}_k\\) off the front of every term in \\(\\eqref{kalunsimplified}\\) and \\(\\eqref{eq:kalgainunsimplified}\\) (note that one is hiding inside \\(\\color{purple}{\\mathbf{K}}\\) ), and an \\(\\mathbf{H}_k^T\\) off the end of all terms in the equation for \\(\\color{royalblue}{\\mathbf{P}_k’}\\). $$ \\begin{equation} \\begin{split} \\color{royalblue}{\\mathbf{\\hat{x}}_k’} &amp;= \\color{fuchsia}{\\mathbf{\\hat{x}}_k} &amp; + &amp; \\color{purple}{\\mathbf{K}’} ( \\color{yellowgreen}{\\vec{\\mathbf{z}_k}} – \\color{fuchsia}{\\mathbf{H}_k \\mathbf{\\hat{x}}_k} ) \\\\ \\color{ro\n......", "posttime": "2020-07-25 09:04:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "原理,filter,color", "title": "卡尔曼滤波器的工作原理，图片", "title_en": "How a Kalman filter works, in pictures", "transed": 1, "url": "https://www.bzarg.com/p/how-a-kalman-filter-works-in-pictures/", "via": "", "real_tags": ["原理", "filter", "color"]}, {"category": "", "categoryclass": "", "imagename": "3bd043a15f9c1440d561097ac0126c67.jpg", "infoid": 1014065, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们在成立公司时做的第一件事之一就是创建了一个回收单，这个回收单包含了我们的讨论请求。布莱恩在网上调侃了这件事。\n就这篇文章而言，我们在@OxecComputer实际构建的第一件事是用于设计文档和讨论的基础设施--就像许多问题一样，这比看起来更麻烦！Https://t.co/w8ecNNUN0I。\n-布莱恩·坎特里尔(@bcantrill)2020年7月22日。\n描述RFD的最佳方式是使用RFD 1请求进行讨论。下面是RFD。\n写下想法很重要：它允许严格地制定(即使是在刚刚起步的时候)、坦率地讨论和透明地分享。我们在请求讨论(RFD)中捕获了想法的书面表达，这是一个遵循IETF征求意见请求的原始精神的文档，如RFC 3所表达的：\n笔记的内容可以是与软件或网络其他方面有关的任何想法、建议等。笔记被鼓励是及时的，而不是润色的。没有例子或其他细节的哲学立场，没有引言或背景说明的具体建议或实施技术，以及没有任何尝试回答的诱导性问题都是可以接受的。笔记的最小长度是一句话。\n清楚说明这些标准(或没有标准)有两个原因：第一，有一种倾向，认为书面声明本身具有权威性，我们希望促进不那么权威的想法的交流和讨论；第二，对于不完善的东西，人们自然会犹豫不决，我们希望减轻这种抑制。\n与RFC类似，我们的RFD的理念是允许及时讨论新的想法，同时仍然成为更多已建立想法的永久存储库。根据RFD的状态，RFD可以在分支机构中快速迭代，作为待合并的Pull请求的一部分进行积极讨论，或者在发布后进行评论。的RFD过程的工作流基于Golang Proposal Process、Joyent RFD Process、Rust RFC Process和Kubernetes Proposal Process的工作流。的RFD过程的工作流基于Golang Proposal Process、Joyent RFD Process、Rust RFC Process和Kubernetes Proposal Process的工作流。\n以下是适用于RFD的示例，这些示例应该是宽泛的：\nRFD不仅适用于技术想法，也适用于整个公司的想法和流程。如果你有一个想法来改善公司做某事的方式，你就有能力通过增加讨论来发出自己的声音。\n在每个RFD文档的开头，我们希望包含少量元数据。元数据格式基于python-markdown2元数据格式。它如下所示：\n作者：RFD的作者(因此也是所有者)。应该列出他们的姓名和电子邮件地址。\n讨论：对于处于或超出讨论状态的RFD，这应该是到PR的链接，以集成RFD；有关详细信息，请参见下面的内容。\n处于预讨论状态的文档表示该工作尚未准备好进行讨论，但RFD实际上是一个占位符。预讨论状态表示为了将RFD推进到讨论状态，正在其分支中的RFD上立即进行工作迭代。\n处于构思状态的文件只包含对RFD将涵盖的主题的描述，提供了对最终RFD范围的指示。与预讨论状态不同，不存在正在进行积极修改的期望。这样的文档是相关想法的草稿纸。团队中的任何成员都鼓励在有或没有原作者参与的情况下开始积极开发这样的RFD(将其移动到预先讨论状态)。至关重要的是，处于构思状态的RFD清晰且定义狭隘。\n正在积极讨论的文档应该处于讨论状态。此时，正在对拉入请求中的RFD进行讨论。\n一旦(或如果)讨论已收敛，且拉入请求已准备好合并，则应在合并前将其更新为已发布状态。请注意，仅因为某些内容处于已发布状态并不意味着它无法更新和更正。有关详细信息，请参阅对RFD部分进行更改。\n讨论前状态本质上应被视为工程师笔记本的协作扩展，讨论状态应在积极讨论某个想法时使用。这些状态不应用于组织上或其他方面已承诺的想法；当某个想法代表共识或方向时，它应处于已发布状态。\n一旦一个想法完全实现，它就应该处于已提交状态。对处于已提交状态的想法的评论通常应该作为问题提出--但如果该评论表示要求从扩展到已承诺的功能发生重大差异，则可能需要一个新的RFD；就像在所有事情中一样，请使用您最好的判断力。\n最后，如果一个想法被发现是不可行的(即故意从未实现)，或者如果一个RFD应该以其他方式指示它应该被忽略，那么它可以进入放弃状态。\n我们将更详细地讨论这一点。让我们一起来看看RFD的生活吧。\n如果您希望手动创建新的RFD，或者更详细地了解该过程，请继续阅读。\n注意：在整个过程中，任何时候都不能直接推送到最大的分支。一旦您的分支机构包含RFD的拉取请求(PR)合并到MASTER中，则RFD将出现在主分支机构中。\n您将首先需要为您的RFC预留您想要使用的号码。从当前的git Branch-r输出来看，该号码应该是下一个可用的RFD号码。\n现在，您将需要创建一个新的GIT分支，以您要保留的RFD编号命名。如果小于4位，则此数字应具有前导零。在创建分支之前，请验证它是否尚不存在：\n如果您在那里看到分支(但不是RFD inmaster中的相应子目录)，则可能是当前正在创建RFD；在继续操作之前，请停止并与同事核实！一旦您确认分支不存在，请在本地创建并切换到该分支：\n$mkdir-p RFD/0042$cp PRODUTIES/Prototype.md RFD/0042/readme.md#或者如果您更喜欢asciidoc$cp Prototype/Prototype.adoc RFD/0042/readme.adoc。\n在新文档中填写RFD编号和标题占位符，并添加您的姓名作为作者。此时RFD的状态应为预讨论。\n如果您的首选是使用asciidoc，这也是可以接受的，但是此流程中的示例将假定为降价。\n$git add RFD/0042/readme.md$git Commit-m&#39；0042：添加RFD&lt；标题&gt；&#39；$git推送原点0042的占位符。\n推送分支后，主分支上的自述文件中的表将使用新的RFD自动更新。如果将来更改RFD的名称，该表也会更新。每当有关RFID状态的信息更改时，这也会更新该表。关于RFD的信息的单一真值来源来自分支机构中的RFD，直到它被合并。\n现在，您可以收集您的想法，使您的RFD达到您希望获得反馈并与他人讨论的状态。建议远程推送您的分支，以确保您所做的更改与遥控器保持同步，以防您的本地损坏。\n在公开征求反馈意见之前，你是否愿意把所有承诺压成一份，还是为了历史而保留共有权，这由你自己说了算。这取决于你是否愿意在公开征求反馈意见之前把所有承诺都压成一个字，或者你是否愿意为了历史的缘故而保留共有权。\n当您准备好获取有关RFD的反馈时，请确保您的所有本地更改都已推送到远程分支。此时，您可能需要将RFD的状态从预先讨论更改为完全成形的RFD的讨论，或者更改为仅指定主题的RFD的构思。在您的分支中执行此操作。\n与您的RFD内容一起，在您的分支机构中将RFD的状态更新为讨论，然后：\n在giHub上打开拉取请求，将您的分支(在本例中为0042)合并到主分支。\n如果您提出您的RFD讨论，但未能打开一个拉取请求，一个友好的机器人将为您做这件事。如果您打开拉取请求，但未能将RFD的状态更新为讨论，则机器人将通过将其移动到讨论来自动更正该状态。机器人还将清理拉取请求的标题为RFD{num}{title}。机器人会自动将指向PULLREQUEST的链接添加到DRANSPOSION：METADATA。\n拉取请求打开后，订阅回购的任何人都会收到通知，告知您已打开一个请求，并且可以阅读您的RFD并提供任何反馈。\n您选择接受讨论中的意见取决于您作为RFD的所有者，但是您应该对您参与讨论的方式保持同理心。\n对于那些对拉请求提供反馈的人，请确保所有反馈都是建设性的。设身处地为他人着想，如果你要发表的评论不是你希望别人评论你的RFD，那么就不要发表评论。\n在人们有时间留下评论之后，RFD可以合并为主文件，并从讨论状态更改为已发布状态。时间由您自行决定：您决定何时打开拉取请求，并决定何时合并它。作为指导原则，在合并之前有3-5个工作日对您的RFD发表评论似乎是合理的-但情况(例如，时区、特定专家的可用性、RFD的长度)可能会规定不同的时间线，您应该使用您的最佳判断。一般说来，您应该使用您的最佳判断。一般来说，在合并之前有3-5个工作日对您的RFD发表评论似乎是合理的-但情况(例如，时区、特定专家的可用性、RFD的长度)可能会决定不同的时间线，您应该使用您的最佳判断。一般来说，您应该使用您的最佳判断。如果没有人在读你的RFD，那就是时候明确要求别人给它做广告了！\n讨论可以在发布的RFD上继续！讨论：元数据中的链接应该保留，允许继续讨论原来的拉请求。如果一个问题值得更多关注或本身有更大的讨论，可以打开一个问题，由概要指导讨论。\n中关于RFD的任何讨论仍可以在原始拉式请求上进行，以将蔓延控制在最小限度。或者，如果您觉得合并后的评论需要更大的讨论，可以就其打开一个问题--但一定要在问题概要中反映讨论的焦点(例如，RISC-V&34；RFD 42：添加对RISC-V&34；的考虑)，并确保链接回问题描述中的原始PR，以便一个问题可以完成另一个问题。\n在您的RFD合并后，始终有机会进行更改。更改RFD的最简单方法是使用您想要进行的更改进行Pull请求。如果您不是RFD的原始作者，请以RFD编号(例如0001)命名您的分支，并确保@您的Pull请求中的原始作者以确保他们看到并批准这些更改。\n对RFD的更改将经过与上述相同的讨论和合并过程。\n一旦实现了RFD--也就是说，一旦它不是某个未来状态的想法，而是一个系统如何工作的解释--它的状态就应该被提交。这种状态本质上与已发布的状态没有什么不同，但它代表了已经得到更充分发展的想法。虽然关于已提交的RFD的讨论是允许的(并且允许进行更改)，但预计它们不会经常出现。\n关于RFD流程最好的部分是它本身在这个RFD中表达；如果您想要更改流程本身，您可以将RFD流程应用于它自己的RFD：加入讨论链接，或者按照当前状态的指示打开一个问题！\n因为RFD是我们所做的一切的核心，所以我们自动更新所有RFD的CSV文件，以及它们的状态、链接和repo中的其他信息，以便于解析。然后，我们在RUST中有了一些功能，使我们可以轻松地获取这些信息，并使用RFD数据实现自动化或编程加工。\n正如您可以想象的那样，跟踪RFD及其链接的规模太大了。为了帮助您，我们提供了简短的URL。您可以使用{num}.rfd.oxide.computer链接到GitHub上的任何RFD。例如，12.rfd.oxide.computer。路径也可以：rfd.oxide.computer/12(如果愿意的话)。\n在聊天中，您可以使用！rfd{任何文本}|{rfd number}返回有关该rfd的信息。例如，！RFD%1返回指向RFD%1的链接、其讨论(如果它正在讨论中)以及有关其状态的信息。记住RFD的数字通常很困难，所以你传递给机器人的任何字符串都将在RFD标题之间进行模糊匹配。！RFD用户API将返回标题与文本匹配的RFD。在本例中，它是RFD 4。\n作为与潜在客户、合作伙伴和公司朋友等其他各方共享某些RFD的方式，我们创建了一个网站，将RFD降价或asciidoc以良好的格式呈现为HTML。这是一种很好的GetFeedback方式，无需将每个人都添加到repo中(也可以很好地格式化内容)。\n这就是总结！如果您曾经考虑在内部执行相同类型的流程，希望这会对您有所帮助！", "note_en": "One of the first things we did in setting up the company was create a reponamed &#34;rfd.&#34; This repo houses our requests for discussion. Bryan teased this tothe internet...\n To the point of this piece, the first thing we actually built at  @oxidecomputer was infrastructure for design documentation and discussion -- which, like many problems, is peskier than it might seem!  https://t.co/w8ecNNUN0I\n— Bryan Cantrill (@bcantrill)  July 22, 2020\n   The best way todescribe RFDs is with &#34;RFD 1 Requests for Discussion.&#34; Below is that RFD.\n     Writing down ideas is important: it allows them to be rigorously formulated(even while nascent), candidly discussed and transparently shared.We capture the written expression of an idea in a  Request for Discussion(RFD), a document in the original spirit of the IETF Request for Comments,as expressed by  RFC 3:\n The content of a note may be any thought, suggestion, etc.related to the software or other aspect of the network.Notes are encouraged to be timely rather than polished.Philosophical positions without examples or other specifics, specific suggestionsor implementation techniques without introductory or background explication, andexplicit questions without any attempted answers are all acceptable.The minimum length for a note is one sentence.\n These standards (or lack of them) are stated explicitly for two reasons.First, there is a tendency to view a written statement as ipso facto authoritative,and we hope to promote the exchange and discussion of considerably less thanauthoritative ideas.Second, there is a natural hesitancy to publish something unpolished,and we hope to ease this inhibition.\n Similar to RFCs, our philosophy of RFDs is to allow both timely discussion ofrough ideas, while still becoming a permanent repository for more established ones.Depending on their state, RFDs may be quickly iterated on in a branch,discussed actively as part of a pull request to be merged, or commented uponafter having been published.The workflow for the RFD process for is based upon those of the Golangproposal process, Joyent RFD process, Rust RFC process, and Kubernetesproposal process.\n  The following are examples of when an RFD is appropriate, these are intended tobe broad:\n  RFDs not only apply to technical ideas but overall company ideas and processesas well.If you have an idea to improve the way something is being done as a company,you have the power to make your voice heard by adding to discussion.\n  At the start of every RFD document, we&#39;d like to include a brief amount of metadata.The metadata format is based on the python-markdown2 metadata format.It&#39;d look like:\n   authors: The authors (and therefore owners) of an RFD.They should be listed with their name and e-mail address.\n  discussion: For RFDs that are in or beyond the  discussion state, this should be a link to the PR to integrate the RFD;see below for details.\n   A document in the  prediscussion state indicates that the work is not yetready for discussion, but that the RFD is effectively a placeholder.The  prediscussion state signifies that work iterations are being donequickly on the RFD in its branch in order to advance the RFD to the  discussion state.\n A document in the  ideation state contains only a description of the topicthat the RFD will cover, providing an indication of the scope of the eventualRFD. Unlike the  prediscussion state, there is no expectation that isundergoing active revision. Such a document is scratchpad for related ideas.Any member of the team is encouraging to start active development of such anRFD (moving it to the prediscussion state) with or without the participationof the original author. It is critical that RFDs in the  ideation state areclear and narrowly defined.\n Documents under active discussion should be in the  discussion state.At this point a discussion is being had for the RFD in a Pull Request.\n Once (or if) discussion has converged and the Pull Request is ready to be merged,it should be updated to the  published state before merge.Note that just because something is in the  published state does not mean thatit cannot be updated and corrected.See the  Making changes to an RFD section for moreinformation.\n The  prediscussion state should be viewed as essentially a collaborativeextension of an engineer&#39;s notebook, and the  discussion state should be usedwhen an idea is being actively discussed.These states shouldn&#39;t be used for ideas that have been committed to,organizationally or otherwise;by the time an idea represents the consensus or direction, it should be inthe  published state.\n Once an idea has been entirely implemented, it should be in the  committed state.Comments on ideas in the  committed state should generally be raised as issues --but if the comment represents a call for a significant divergence from orextension to committed functionality, a new RFD may be called for;as in all things, use your best judgment.\n Finally, if an idea is found to be non-viable (that is, deliberately neverimplemented) or if an RFD should be otherwise indicated that it should beignored, it can be moved into the  abandoned state.\n We will go over this in more detail.Let&#39;s walk through the life of a RFD.\n    If you wish to create a new RFD by hand, or understand the process in greaterdetail, read on.\n NOTE: Never at anytime through the process do you push directly to themaster branch. Once your pull request (PR) with your RFD in your branch ismerged into master, then the RFD will appear in the master branch.\n  You will first need to reserve the number you wish to use for your RFC.This number should be the next available RFD number from looking at thecurrent  git branch -r output.\n  Now you will need to create a new git branch, named after the RFD number you wish to reserve.This number should have leading zeros if less than 4 digits.Before creating the branch, verify that it does not already exist:\n  If you see a branch there (but not a corresponding sub-directory in  rfd inmaster), it is possible that the RFD is currently being created;stop and check with co-workers before proceeding!Once you have verified that the branch doesn&#39;t exist, create it locally andswitch to it:\n    $ mkdir -p rfd/0042$ cp prototypes/prototype.md rfd/0042/README.md# OR IF YOU PREFER asciidoc$ cp prototypes/prototype.adoc rfd/0042/README.adoc\n Fill in the RFD number and title placeholders in the new doc and add your name as an author.The status of the RFD at this point should be  prediscussion.\n If your preference is to use asciidoc, that is acceptable as well, however the examples in this flow will assume markdown.\n   $ git add rfd/0042/README.md$ git commit -m &#39;0042: Adding placeholder for RFD &lt;Title&gt;&#39;$ git push origin 0042\n After your branch is pushed, the table in the README on the master branch willupdate automatically with the new RFD. If you ever change the name of the RFD in the future,the table will update as well. Whenever information about the state of the RFDchanges, this updates the table as well. The single source of truth forinformation about the RFD comes from the RFD in the branch until it is merged.\n    Now you can gather your thoughts and get your RFD to a state where you wouldlike to get feedback and discuss with others.It&#39;s recommended to push your branch remotely to make sure the changes you makestay in sync with the remote in case your local gets damaged.\n It is up to you as to whether you would like to squash all your commits down toone before opening up for feedback, or if you would like to keep the commithistory for the sake of history.\n  When you are ready to get feedback on your RFD, make sure all your localchanges are pushed to the remote branch.At this point you are likely at the stage where you will want to change thestatus of the RFD from  prediscussion to  discussion for a fully formedRFD or to  ideation for one where only the topic is specified.Do this in your branch.\n  Along with your RFD content, update the RFD&#39;s state to  discussion in your branch, then:\n   Open a pull request on GitHub to merge your branch, in this case  0042 into the master branch.\n If you move your RFD into  discussion but fail to open a pull request, a friendlybot will do it for you. If you open a pull request but fail to update the stateof the RFD to  discussion, the bot will automatically correct the state by movingit into  discussion. The bot will also cleanup the title of the pull request tobe  RFD {num} {title}. The bot will automatically add the link to the pullrequest to the  discussion: metadata.\n After the pull request is opened, anyone subscribed to the repo will get anotification that you have opened apull request and can read your RFD and give any feedback.\n  The comments you choose to accept from the discussion are up to you as the ownerof the RFD, but you should remain empathetic in the way you engage in the discussion.\n For those giving feedback on the pull request, be sure that all feedback is constructive.Put yourself in the other person&#39;s shoes and if the comment you are about tomake is not something you would want someone commenting on an RFD of yours,then do not make the comment.\n  After there has been time for folks to leave comments, the RFD can be mergedinto master and changed from the  discussion state to the  published state.The timing is left to your discretion: you decide when to open the pull request,and you decide when to merge it.As a guideline, 3-5 business days to comment on your RFD before merging seemsreasonable -- but circumstances (e.g., time zones, availability of particularexpertise, length of RFD) may dictate a different timeline, and you should useyour best judgment.In general, RFDs shouldn&#39;t be merged if no one else has read or commented on it;if no one is reading your RFD, it&#39;s time to explicitly ask someone to give it aread!\n Discussion can continue on  published RFDs!The  discussion: link in the metadata should be retained, allowing discussionto continue on the original pull request.If an issue merits more attention or a larger discussion of its own, an issuemay be opened, with the synopsis directing the discussion.\n Any discussion on an RFD in the can still be made on the original pull requestto keep the sprawl to a minimum.Or if you feel your comment post-merge requires a larger discussion, an issuemay be opened on it -- but be sure to reflect the focus of the discussion inthe issue synopsis (e.g., &#34;RFD 42: add consideration of RISC-V&#34;), and be sureto link back to the original PR in the issue description so that one may findone from the other.\n  After your RFD has been merged, there is always opportunity to make changes.The easiest way to make a change to an RFD is to make a pull request with thechange you would like to make.If you are not the original author of the RFD name your branch after the RFD #(e.g.  0001) and be sure to  @ the original authors on your pull request tomake sure they see and approve of the changes.\n Changes to an RFD will go through the same discussion and merge process asdescribed above.\n  Once an RFD has become implemented -- that is, once it is not an idea ofsome future state but rather an explanation of how a system works -- its stateshould be moved to be  committed.This state is essentially no different from  published, but represents ideasthat have been more fully developed.While discussion on  committed RFDs is permitted (and changes allowed), theywould be expected to be infrequent.\n  The best part about the RFD process is that it itself is expressed in this RFD;if you want to change the process itself, you can apply the RFD process toits own RFD: chime in on the discussion link or open an issue as dictated byits current state!\n   Because RFDs are so core to everything we do, we automatically update a CSV file of all theRFDs along with their state, links, and other information in the repo for easyparsing. We then have functions in rust that allow us to easily get thisinformation and automate or program tooling with RFD data.\n  As you can imagine, keeping track of RFDs and their links is unweidly at scale.To help, we have short URLs. You can link to any RFD on GitHub with {num}.rfd.oxide.computer. So for example,  12.rfd.oxide.computer. The pathalso works:  rfd.oxide.computer/12 if that is preferred.\n    In chat you can use  !rfd {any text} | {rfd number} to return information aboutthat RFD. For example,  !rfd 1 returns the links to RFD 1, its discussion (if it is indiscussion), and information about its state. Remembering the number for anRFD is often hard so any strings you pass to the bot will be fuzzy matchedacross RFD titles.  !rfd user api will return the RFD that title matches thetext. Inthis example, it is RFD 4.\n  As a way to share certain RFDs with other parties like potential customers,partners, and friends of the company, we have created a website that renders theRFD markdown or asciidoc into HTML in a nice format. This is a nice way to getfeedback without adding everyone to the repo (as well as nicely formatting thecontent).\n And that&#39;s a wrap! Hopefully, this is helpful if you ever think about doing thesame type of process internally!", "posttime": "2020-07-25 08:41:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "请求,requests,rfd", "title": "RFD 1请求讨论", "title_en": "RFD 1 Requests for Discussion", "transed": 1, "url": "https://oxide.computer/blog/rfd-1-requests-for-discussion/", "via": "", "real_tags": ["请求", "requests", "rfd"]}, {"category": "", "categoryclass": "", "imagename": "b0d793a41ca4b5c43d11cbdef96e5379.png", "infoid": 1014062, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "三年前，查马斯在一次社会资本全体员工会议上让我们所有人都坐了下来，告诉我们要做的这件伟大的新事情。它被称为SPAC。\n他告诉我们，SPAC(“特殊目的收购公司”，或“空白支票公司”)是我们帮助大型科技公司上市的一种新方式。上市是公司生命中的重要时刻。这是一个从一个州到另一个州的过渡，这是一个充满压力但意义重大的过渡，而我们目前的做法-首次公开募股(IPO)-很糟糕。人们认为，我们的SPAC将为科技公司的上市开辟一条新的道路，可以与IPO竞争，并取得胜利。\n这花了几年的时间，但查马斯这次做得非常正确。当时，硅谷几乎没有人听说过SPAC。但现在，他们迎来了属于自己的时刻，从华尔街(比尔·阿克曼因寻找一只“成熟的独角兽”获得了40亿美元的SPAC，呵呵；大卫·乌本和尼古拉的股票甚至让埃隆都脸红了)，到沙山路(Ribbit Capital刚刚为金融科技的SPAC筹集了6亿美元，查马斯还在做另外两个，我肯定还会有更多)。\nSPAC并不新鲜；它们只是传统上是一种肮脏的、非百老汇式的融资。我有一些美好的回忆，我回到加拿大的家，然后和这些21岁的大学生交谈，他们就像是，“SPAC？哦，对了，我们知道那是什么。我在合作社学期里做过一件事，试图让一家假矿业公司上市。(顺便说一句：你知道加拿大有专门针对诈骗的证券交易所吗？)。\n那么这些是什么东西呢？他们是做什么的，为什么人们都为他们而激动，为什么他们可能会留在这里？\n当你IPO时，银行服务对你不起作用-它对生态系统起作用。\n当你首次公开募股时，你会经历一个过渡：你的公司的股票从一天不公开交易，到第二天有公开交易的价格。你们的价格有些不确定！所以这涉及到一个风险，这个风险是由你股票的初始公众买家特别承担的，第一批人说，是的，我会以一定的数量购买这个公开发行的股票，希望这个数字不会太高。IPO过程减轻了这种风险，但不是免费的。\nIPO的运作方式是，你聘请一家投资银行，说“我们认为我们想上市，我们需要筹集大约X美元的资金，你认为你能帮助我们吗？”银行说，“是的，我们就是这么做的，我们会为你的股票找到买家。”所以你去参加路演，向全国各地的买家推销你的股票，然后几个月后，根据展会的进展情况，你和银行敲定了一个初始发行价的数字，银行承诺以这个价格向投资者出售一定数量的你的股票。该行的工作是确保这一过程顺利进行。该行还将坚持一些细微之处，比如禁闭期，以防止员工在第一天抛售太多股票，以帮助过程保持有序和干净。\nIPO当天，你出现在纽约证券交易所(New York Stock Exchange)，敲响钟声，你的股票就开始交易。而且，在大多数情况下，股票开盘时会比你通过银行卖出的价格高出很多。这就是所谓的“爆发点”，这也是企业抱怨IPO的核心部分：他们觉得自己把钱留在了桌上。\n当然，你实际上应该预料到流行会发生，这是有道理的。最初的投资者正在承担风险，他们购买了一只全新的、尚未定价的股票！因此，平均而言，他们应该因承担这种风险而获得报酬。银行认识到了这一点，这就是为什么他们会相应地为IPO定价：他们希望IPO发生，因为这会让他们的客户满意，而且会回来进行更多的IPO。\n不过，有时股票不会暴涨。不时(例如，去年与优步(Uber))，如果银行出于任何原因误判了公众的购买胃口，该股将从开盘钟声中直接下滑。世行的工作是帮助稳定这一局面。他们通过一种叫做“绿鞋”的东西来做到这一点。绿鞋的运作方式是，银行实际上承诺出售的股票多于公司发行的股票；换句话说，它在发行时超卖，因此实际上在第一天就做空了股票。为了弥补这笔空头，银行还(免费！)。以IPO价格从该公司购买更多股票的抵消性看涨期权数量。\n这是一种“正面我赢，反面你输”的交易。如果股票像往常一样在第一天暴涨，那么银行只需行使其以IPO价格购买更多股票的自由选择权，就可以弥补其空头头寸。因此，银行从差额中赚钱，公司抱怨说，因为它不得不以低于市价的价格支付更多股票。另一方面，如果股票下滑，那么银行可以在公开市场上买入全部股票。无论哪种方式，绿鞋对银行来说几乎是零风险的，公司以任何一种方式买单，实际上都看不到任何直接的好处。\n我为什么要告诉你这些？因为这是了解IPO的一个重要教训的窗口：公司可能会聘请银行，但银行并不真正为公司工作。银行为生态系统工作。银行的工作在某种程度上是为了让公司高兴，但实际上它是为了确保这次IPO按预期进行，并让每个人都能获利。银行不仅仅关心这次IPO；他们一般关心的是获得IPO业务。\n在我看来，这在很大程度上是一件好事：它有助于避免公地问题的悲剧。如果IPO对所有人来说都是完全免费的，没有标准的规则，而银行明确支持企业试图实现收益最大化(以潜在的购买公众为代价)，那么IPO将迅速发展一个柠檬型情况的市场：不良行为可能会驱逐好的东西，上市将以更未知、更可怕的方式变得风险更高。\n因此，我们没有通过繁琐的监管来解决这个问题，而是通过本质上指定投资银行作为系统完整性的守门人来解决它。他们收取高额费用，他们强加不友好的条款，他们不会给你报价，直到你从你的路演中筋疲力尽。但作为交换，它们有效地保证了流程的一定基础水平的完整性。\n这里有一种明显的紧张气氛。如果你能以某种方式在没有银行的情况下上市，理论上你可以避免所有这些，这对你是有好处的。这也许是自私的举动，但没关系！你的责任不是世世代代保持IPO过程的完整性，在这里尽可能地自私，这符合你的股东的利益，符合你的员工的利益，也符合你所在世界的每个人的利益。\n虽然正常的IPO过程始于想要上市的私营企业，但SPAC正好相反：它始于上市企业，这不算什么。当Chaath或Bill Ackman等知名发起人通过以下招股说明书在IPO中筹集资金时，SPAC就开始了：\n“我正在筹集资金让一家公司上市。我还不知道是哪一个，在我找到钱之前，我会把钱装进袋子里的。当我这样做时，我的公开交易的钱袋将与私人企业合并，并在这样做的过程中，使它们上市。你，投资者，将你的SPAC股票转换成新业务的股票，以一个有吸引力的谈判价格，加上购买更多的权证，这样你就可以从上行中获利。\n因为我很聪明，所以我会选择一家令人惊叹的、你会想要拥有的企业。如果你不同意，你将有机会拿回你的钱。但如果我是对的，你会赚很多钱。“。(我用第一人称写这篇文章，而不是用更传统的商业第三人称，因为SPAC高度集中在赞助商的个人崇拜上。)。\n因此，查马斯或比尔·阿克曼或任何参加路演的人，都会为空白支票公司筹集资金。一旦全部认购完毕，他们将收取SPAC 20%的股权作为完成这项工作的报酬。然后他们开始寻找一家公司进行合并。钱袋子坐在那里，赚取货币市场利息，投资者至少可以在此期间赚取(减去20%，但啊好吧)。\n在这一点上，SPAC作为上市途径具有一些有趣的优势。第一个优势是确定性：与IPO路演不同，在IPO路演中，你参与到这个过程中，然后才知道你要筹集多少资金，价格是什么，与你谈判一次的SPAC相比，你有一个价格，然后就完成了。(正如马特·莱文指出的那样，WeWork是一个应该使用SPAC的企业的完美例子。想象一下！)。\n第二个优势是速度：IPO过程需要一年多的时间，而SPAC已经提前完成了大量工作(他们已经公开了！)。而且可以让你上市的速度比这快得多。(伯恩·霍巴特(Byrne Hobart)称它为“流动性事件的拉斯维加斯婚礼教堂”，这个词太完美了。)。在Social Capital，我们非常有趣地思考如何在2017年泡沫不可避免地破裂之前利用SPAC让一家密码公司上市。现在，这本来是增值的。\n第三个优势是品牌光环：如果SPAC有一个特别有魅力的赞助商，他们可以为你的企业注入某种特殊的魅力和阴谋，也许会让你的估值倍数更高。它不会永远持续，但在短期内，这可能就是你需要的。正如Byrne雄辩地说的那样，(转述)：“在宣布与维珍银河的交易之前，我是Long Social Capital的SPAC，基于一个简单的理论，即Chaath Palihapitiya是聪明的，以及b)更重要的是，非常愿意在电视上说一些疯狂的事情。”\n当然，所有这些事情的陷阱是SPAC会大量敲诈你。首先，如果你看看SPAC提供的条款和他们的所有权目标是什么，他们在让你上市时会寻求相当大的折扣，而不是你可能认为自己的价值。其次，SPAC赞助商收取20%的巨额利息作为推广费。理论上，这笔费用是向SPAC的投资者收取的，而不是目标企业。在实践中，这笔费用被传递回与目标谈判的价格。最终的结果是，你不会因为投资银行以太低的价格出售股票而感到被你的投资银行敲诈，而是直接把你业务的1%作为贡品直接交给赞助商，然后直接上市。\n但是后来一些很酷的事情发生了。企业和赞助商过去坐在谈判桌的对立面，现在是同一个团队。赞助商甚至可能成为新合并的公共业务的董事长，就像查马斯对维珍银河所做的那样。这与银行的动态非常不同：这是并购，而不是咨询。你的谈判更残酷，但一旦谈判完成，你就会合并。\n与银行不同，他们从来没有真正为你工作过；SPAC赞助商不仅仅为你工作，他们就是你。因此，他们没有理由遵守所有这些生态系统规则，这是企业讨厌的，但生态系统集体想要的。不能被关起来！没有绿鞋！别做那些蠢事！最重要的是，全面的价格透明度。没有一家银行会给你这个。但是SPAC可以。\n直接上市是另一种规避所有IPO税的方式，最近也迎来了一个时髦的时刻。但有一个小问题，那就是你不能通过直接上市筹集任何资金；你只能开始交易。通常，钱，以及围绕上市那一刻的动力和精力(这样你就可以获得更多的钱)才是真正的重点。SPAC就像是两全其美的高价。你拿到了钱，你就能感觉到从投资银行模糊的承诺和沉重的税收中解脱出来。你只需要把事情搞得很糟，就一次。但要按你的条件！\n因此，真正的SPAC问题实际上在这里显露出来：你愿意花多少钱让真正为你工作的人将其公之于众？目前，答案是“一大堆，对大多数人来说可能不值得。”这有点像“你会付给Facebook多少钱来去掉广告”，答案可能是“无论如何都不能选择”。但现在要付出代价了！\n现在你可以看到SPAC的真正吸引力了：它们是一种自私地公开的方式。在SPAC的思维模式下，IPO生态系统-由一群舒适的投资银行看门人管理-知道如何让好事持续下去。他们知道如何制定规则，如何给每个人发工资，以及如何维护和平。他们通过在公司上市时对其征税，自己承担零风险，并不断将所产生的所有努力的账单转嫁给公司，来支付这笔费用。这些公司别无选择，所以就顺从了。\nSPAC为您提供了一种选择退出此系统的方法。如果你愿意向SPAC赞助商支付巨额的、预付的、一次性的费用，那么他们会把你作为你的最大股东，彼此之间最大限度地结盟，并且没有义务与生态系统中的其他任何人一起做正确的事情。我认为这是真正的吸引力的一部分，不仅对企业，对短期投机者也是如此。SPAC很有趣。看到一些东西如此故意地从生态系统的其余部分剥离，这是一件很有趣的事情。\n我认为思考SPAC的正确方式是，从公共部门向私人部门的过渡总是会带来声誉风险；问题是哪一个更重要：银行和内部人士的声誉，还是散户公众和公司本身之间的直接声誉。在过去，第二个问题实际上不是问题，因为1)IPO过程总是如此中间，你永远无法检验这一理论，2)公司通常不会两次上市。现在我们有办法看了！\n如果查马斯能因成功完成这些事情而赢得声誉，他是否会变得和投资银行的IPO业务一样有价值？如果我们可以反复地直接到零售大众那里去卖这些东西，如果他把他的20%的费用降低，比方说10%，会发生什么？一旦你真的完成了这个过程，SPAC能开始在成本上竞争吗？传统的答案是否定的：你仍在支付上市的空白支票费用，交易本身的并购费用，更不用说发起人费用了。但你会感到惊讶的是，在一个没有僵化到普遍接受的利润率的新的、饥渴的行业里，哪里可以找到节省成本的地方。更不用说它们是创造零售买家FOMO的绝佳工具，这可能会带来所有的不同，如果你愿意掷骰子的话，还有一些。\n无论如何，我迫不及待地想看看这一切的发展方向，特别是我迫不及待地想要合成生物学SPAC进入主流，这样我们就可以让一些绝对没有人理解的公司凭借赞助商的纯粹品牌实力上市。我们将要学习很多关于一些几年前没有人想过要问的问题！还要密切关注那些加拿大初级投资银行家。如果你在寻找目标，他们会在这里提供帮助。\n喜欢这个帖子吗？我每周都会把它放到你的收件箱里，带着两个真相和一个镜头，我的每周时事通讯每周有2万人喜欢。", "note_en": "Three years ago, Chamath sat us all down at a Social Capital all hands meeting and told us about this  great new thing we were gonna do. It was called a SPAC.\n A SPAC (“ Special Purpose Acquisition Company”, or “blank check company”), he told us, was a new way we were going to help take big tech companies public. Going public is an important moment in a company’s life. It’s a transition from one state to another, it’s a stressful but monumental transition, and the current way we do it – the Initial Public Offering – stinks. Our SPAC, the thinking went, would create a new path for tech companies to go public that could compete with the IPO, and win.\n It took a few years, but Chamath got this one really right. At the time, hardly anyone in Silicon Valley had ever heard of SPACs before. But now they’re having their moment, from Wall Street ( Bill Ackman’s $4 billion SPAC for finding a “mature unicorn”, lol; David Ubben and Nikola stock making even Elon blush) to Sand Hill Road ( Ribbit Capital just raised $600m for a fintech SPAC, and Chamath is doing two more, with more to follow I’m sure.)\n SPACs aren’t new; they’ve just traditionally been a grimy, off-Broadway kind of financing. I have some fond memories of heading home to Canada and then talking to these 21 year old university students who were like, “SPACs? Oh yeah, we know what those are. I worked on one during my co-op semester, trying to take a fake mining company public.” (As an aside: did you know that  Canada has a stock exchange specially for scams?)\n So what are these things? What do they do, why are people all worked up about them, and why might they be here to stay?\n When you IPO, the bank doesn’t work for you – it works for the ecosystem\n When you IPO, you go through a transition: your company’s shares go from one day being not publicly traded, to the next day having a publicly traded price. There’s some uncertainty as to what your price will be! So there’s a risk involved, and that risk is specifically assumed by the initial public buyer of your stock – the first group of people to say, yes, I will buy this public stock at a certain number, and hope that number doesn’t turn out to be way too high. The IPO process mitigates this risk, but not for free.\n The way an IPO works is you hire an investment bank, and say “we think we’d like to go public, we need to raise around X many dollars, do you think you could help us with that” and the bank says “why yes, that’s what we do, we will find buyers for your stock.” And so you go on a road show and pitch your stock to buyers all around the country, and then a few months later, depending on how the show went, you and the bank settle on a number for your initial offering price, and the bank makes a commitment to sell a certain number of shares of you to investors, at that price. The bank’s job is to make sure that this process will go smoothly. The bank will also insist on a number of fine points, like lockup periods to prevent employees from dumping too many shares on day one, to help the process remain orderly and clean.\n On the day of the IPO, you show up at the New York Stock Exchange, you ring the bell, and your stock starts trading. And, most of the time, the stock will open quite a bit higher than the price you sold it for via the bank. This is called the “pop”, and it’s really the core part of why businesses grumble about IPOs: they feel like they’ve left money on the table.\n Of course, there’s a sensible reason why you should actually  expect a pop to happen. The initial investors are taking on risk, by buying a brand new, not-yet-priced stock! So, on average, they should get paid for taking that risk. Banks recognize this, and that’s why they price their IPOs accordingly: they want the pop to happen, because it keeps their clients happy, and coming back for more IPOs.\n Sometimes stocks don’t pop, though. From time to time (with Uber last year, for instance) the stock will slide right from the opening bell, if for whatever reason the bank misjudged the public buying appetite. The bank’s job is to help stabilize this. And they do it via something called a greenshoe. The way a greenshoe works is that the bank actually commits to sell more shares than the company issues; in other words, it oversells the offering, and is therefore effectively short the stock on day one. In order to cover that short, the bank also gets (for free!) an offsetting number of call options to buy more stock from the company at the IPO price.\n This is a “heads I win, tails you lose” kind of deal. If the stock pops on day one, as it normally does, then the bank covers its short position by simply exercising its free option to buy more stock at the IPO price. So the bank makes money on the difference, and the company grumbles because it has to cough up even more shares at below-market value. If the stock slides, on the other hand, then the bank can buy up shares on the open market. Either way, the greenshoe is nearly risk-free for the bank, the company foots the bill either way, without actually seeing any direct benefit.\n Why am I telling you this? Because it’s a window into an important lesson about IPOs: the company might hire the bank, but  the bank doesn’t really work for the company.  The bank works for the ecosystem. The bank’s job is sort of to make the company happy, but really it’s to make sure that this IPO goes predictably and boringly, and let everyone take their profits. Banks don’t just care about  this IPO; they care about getting IPO business  generally.\n This is largely a good thing, in my opinion: it helps avoid the tragedy of the commons problem. If IPOs were a complete free for all and had no standard rules, and banks worked  explicitly for the business to try to maximize their gains (at the potential expense of the buying public), then the IPO would quickly develop a market for lemons-type situation: bad behaviour would potentially drive out the good, and going public would become riskier in more unknown, scary ways.\n So rather than solve this problem with cumbersome regulation, we instead solve it by essentially assigning the investment banks as gatekeepers of the integrity of the system. They take their hefty take rates, they impose their unfriendly provisions, and they won’t quote you a price until you’re worn out from your road show. But in exchange they effectively guarantee a certain base level of integrity to the process.\n There is an obvious tension here. If you could somehow go public  without the banks, you can theoretically avoid all of this, and that’s good  for you. It is the selfish move, perhaps, but that’s fine! Your responsibility is not to preserve the integrity of the IPO process for generations hence.It’s in your shareholders’ interest, and your employees’ interest, and everyone in your world’s interest, to be as selfish as possible here.\n   While the normal IPO process starts with a private business who wants to go public, a SPAC is the opposite: it starts with a  public business, that is nothing. A SPAC begins its life when a well-known promoter, like Chamath or Bill Ackman, raises money in an IPO with the following prospectus:\n “I am raising money to take a company public. I don’t know which one yet; the money is going to go in a bag until I find one. When I do, my publicly traded bag of money will merge with the private business, and in doing so, take them public. You, the investors, will have your SPAC shares convert to shares in the new business, at an attractively negotiated price, plus warrants to buy more so you can profit on the upside.\n Because I’m so smart, I’m going to pick a business that’s amazing and that you’ll want to own. If you disagree, you’ll have a chance to get your money back. But if I’m right, you’ll make a ton on the upside.” (I wrote this in the first person, rather than in a more business-conventional third person, because SPACs are highly centred around the cult of personality of the sponsor.)\n So Chamath or Bill Ackman or whoever goes on a roadshow, raising money for the blank check company. Once it’s fully subscribed, they take a 20% equity interest in the SPAC as payment for doing the work. And then they set out to go find a company to merge with. The bag of money sits there, earning money market interest, and the investors can at least earn that in the meantime (minus 20%, but ah well.)\n At this point, the SPAC has some interesting advantages as a route to go public. The first advantage is  certainty: in contrast to the IPO road show, where you engage with the process and then only figure out later how much you’re going to raise and at what price, with the SPAC you negotiate one time, you have a price, and it is done. (As Matt Levine pointed out, WeWork is the perfect example of a business who should’ve used a SPAC. Imagine!)\n The second advantage is speed: the IPO process takes well over a year, while a SPAC has already done a lot of the work up front (they’re already public!) and can take you public a lot faster than that. (Byrne Hobart calls it “the Vegas Wedding Chapel of liquidity events”, which is perfect.) At Social Capital, we had some serious fun thinking about how to use the SPAC to take a crypto company public before the 2017 bubble inevitably burst. Now  that would have been value-add.\n The third advantage is brand halo: if a SPAC has an especially charismatic sponsor, they can imbue your business with a certain special kind of charm and intrigue, and maybe vault you into a higher valuation multiple. It won’t last forever, but in the short term, that may be what you need. As Byrne eloquently put it, (paraphrased):  “I was long Social Capital’s SPAC before the Virgin Galactic deal was announced, on the simple theory that Chamath Palihapitiya is a) smart, and b) more importantly, very willing to say crazy things on TV.”\n The catch to all of these things, of course, is that the SPAC will massively rip you off. First of all, if you look at the terms that the SPAC is offering and what their ownership targets are, they’re seeking a pretty substantial discount as they take you public relative to what you probably feel you’re worth. Second of all, the SPAC sponsor is taking that enormous 20% vig as a promotion fee. In theory, that fee is charged to the investors of the SPAC, not the target business. In practice, that fee gets passed back to the negotiated price with the target. The net result is that instead of going public and feeling ripped off by your investment bank for having sold them shares too cheaply, instead you just directly give the sponsor something like 1% of your business as a tribute offering and go straight to being public.\n But then something cool happens. The business and the sponsor, who used to be on opposite sides of the table negotiating against each other, are now on the same team. The sponsor might even become the chairperson of the newly merged public business, like Chamath did with Virgin Galactic. This is  very different than the dynamic with banks: it’s M&amp;A, rather than consulting. Your negotiation is more brutal, but then once it’s done, you merge.\n Unlike the bank, who never really worked for you anyway; the SPAC sponsor doesn’t just work for you; they ARE you. So there’s no reason for them to keep all of those ecosystem rules, which the businesses hate but the ecosystem collectively wants. No lockups! No greenshoe! None of those stupid things! Most importantly,  total price transparency, up front. No bank will  ever give you that. But a SPAC can.\n Direct listing, which also had its trendy moment recently, is another way you might get around all of those IPO taxes. But there’s a small problem, which is you can’t raise any money in a direct listing; you just start trading. And often the money, and the momentum and energy around that moment of going public (so you can get more money) is really the point. SPACs are like paying up for the best of both. You get the money,  and you get to feel freed from the vague promises and oppressive taxation from the investment banks. You just have to get screwed really badly, one time. But on your terms!\n So the real SPAC question actually reveals itself here:  how much would you pay to be taken public by someone who  actually works for you? Currently, the answer is “a whole lot, and probably not worth it for most people.” It’s a bit like “How much would you pay Facebook to get rid of ads”, the answer is probably “not an option at any price”. But now there is a price!\n Now you can see the real appeal of SPACs: they’re a way to go public selfishly. In the SPAC mindset, the IPO ecosystem – managed by a cozy group of investment bank gatekeepers – knew how to keep a good thing going. They knew how to write the rules, how to get everybody paid, and how to keep the peace. They paid for it by taxing the companies as they went public, taking zero risk of their own, and continually passing the bill back to the company for all effort incurred. And those companies didn’t have any other option, so they went along with it.\n SPACs give you a way to opt out of this system. If you’re willing to pay a massive, up-front, one-time fee to the SPAC sponsor, then they will take you public as your biggest shareholder, with maximal alignment between one another, and zero obligations to do right by  anybody else in the ecosystem. I think that’s a real part of the appeal, not only for the business, but for short term speculators too. SPACs are  fun. It’s fun to see something that’s just such a deliberate flipping off of the rest of the ecosystem.\n I think the right way to think about SPACs is to say, the transition from public to private will always entail reputational risk; the question is which is more important: reputation among the banks and insiders, or reputation directly between the retail buying public and the company itself. In the past, the second one wasn’t really an issue, because 1) the IPO process was always so intermediated you could never test this theory, and 2) companies typically don’t go public twice. Now we have a way to see!\n If Chamath can earn a reputation for pulling these things off, does he become as valuable as the investment banks’ IPO businesses? If we can repeatedly go directly to the retail public and sell these things, what happens if he  lowers his 20% fee, to say, 10? Once you really have this process down, could a SPAC start to compete on cost? The conventional answer would say no: you’re still paying the blank check fee to go public, M&amp;A fees for the deal itself, not to mention the promoter fee. But you’d be surprised where cost savings can get found in a new, hungry industry that hasn’t ossified into its Generally Accepted Margins. Not to mention how excellent a vehicle they are for creating retail buyer FOMO, which might make all the difference and then some, if you’re willing to roll the dice a little bit.\n Anyway, I can’t wait to see where this all goes, and I especially can’t wait for synthetic biology SPACs to hit the mainstream so we can have some companies that absolutely no one understands get taken public on the pure brand strength of a sponsor. We’re about to learn a whole lot about some questions no one ever thought to ask about only a few years ago! And also keep an eye out for those Canadian junior I-bankers. If you’re looking for targets, they are here to help.\n Like this post?  Get it in your inbox every week with Two Truths and a Take, my weekly newsletter enjoyed by 20,000 people each week.", "posttime": "2020-07-25 07:58:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "spac,man", "title": "Spac Man开始", "title_en": "SPAC Man Begins", "transed": 1, "url": "https://alexdanco.com/2020/07/24/spac-man-begins/", "via": "", "real_tags": ["spac", "man"]}, {"category": "", "categoryclass": "", "imagename": "7c0ae6826cceb3d3a43306eb13fe9c7d.jpeg", "infoid": 1014061, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据副主席周三报道，纽约州民主党众议员亚历山德里亚·奥卡西奥-科尔特斯(Alexandria Ocasio-Cortez)提出了一项措施，将防止军方将视频游戏和体育运动作为招募工具。\n在此之前，美国陆军体育团队引发了一波争议，该团队向Insider证实，它已经暂停了Twitch上的流媒体视频游戏，以评估内部政策和程序，以及所有平台特定的政策。\nOcasio-Cortez的措施于7月22日提交，作为众议院拨款法案的修正案，该法案将禁止使用资金通过视频游戏和电子竞技平台征兵。副主席报道，该措施将阻止军方使用法案拨付的任何资金来维持在Twitch或任何游戏直播平台上的存在。这项措施将禁止军方使用该法案拨付的任何资金来维持在Twitch或任何游戏直播平台上的存在。\n奥卡西奥-科尔特斯告诉“副”杂志，陆军和海军通过直播平台招募易受影响的年轻人和儿童是令人难以置信的不负责任。\n美国陆军运动队最近发现自己陷入了争议之中。最初在网上批评使用电子游戏作为招聘工具的做法，现在已经演变成一系列小丑闻。《国家报》7月15日报道称，该团队在其Twitch频道上发布了赠品，导致了一份招募表格。该团队在禁止在团队的Twitch频道或不和谐频道上提到美国战争罪的用户后，引发了更多言论自由倡导者的批评。\n“纽约时报”报道，骑士第一修正案研究所已经代表活动家乔丹·乌尔给陆军和海军征兵人员(海军也有Twitch存在)发了一封信，乔丹·乌尔因问你最喜欢的美国节目是什么而被禁止进入陆军的Twitch频道。信中辩称，禁止提到战争罪的用户违反了第一修正案。\n正如副总统指出的那样，要使奥卡西奥-科尔特斯修正案成为法律，还需要几个步骤。它必须首先通过众议院拨款委员会的规则，该委员会将决定哪些悬而未决的修正案将推进。预算在提交参议院和总统办公桌之前，还必须通过多个委员会和众议院全体议员。", "note_en": "Democratic Representative Alexandria Ocasio-Cortez of New York has introduced a measure that would prevent the military from using video games and esports as a recruitment tool,  Vice reported on Wednesday.\n The move comes after a wave of controversy surrounding the US Army esports team, which  confirmed to Insider that it has &#34;paused streaming&#34; video games on Twitch in order to &#34;evaluate internal policies and procedures, as well as all platform-specific policies.&#34;\n Ocasio-Cortez&#39;s  measure was filed on July 22 as an amendment to the House Appropriations bill, and would prohibit &#34;the use of funds for recruiting via video gaming and e-sports platforms.&#34;  Vice reported that the measure would prevent the military from using any funds appropriated by the bill for maintaining a presence on Twitch or any gaming livestreaming platform.\n &#34;It&#39;s incredibly irresponsible for the Army and the Navy to be recruiting impressionable young people and children via live streaming platforms,&#34; Ocasio-Cortez  told Vice.\n   The US Army esports team has recently found itself mired in controversy. What started as online criticism of the practice of using video games as a recruitment tool has spiraled into a series of mini-scandals.  The Nation reported on July 15 that the team posted giveaways on its Twitch channel that led to a recruitment form. The team instigated more criticism from free speech advocates after it banned users who brought up United States war crimes on the team&#39;s Twitch channel or Discord.\n The New York Times reported that the  Knight First Amendment Institute had sent a letter to Army and Navy recruiters (the Navy maintains a Twitch presence as well) on the behalf of activist Jordan Uhl, who  had been banned from the Army&#39;s Twitch channel for asking &#34;what&#39;s your favorite U.S. w4r cr1me.&#34; The letter argued that banning users who mention war crimes violates the First Amendment.\n As Vice noted, it&#39;ll take more than a few steps for Ocasio-Cortez&#39;s amendment to become law. It must first pass through the House Appropriations Committee on Rules, which will decide which pending amendments will advance. The budget must also pass through multiple committees and the full House itself before moving on to the Senate and then the president&#39;s desk.", "posttime": "2020-07-25 07:36:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,阻止,recruitment,禁止", "title": "亚历山德里亚·奥卡西奥-科尔特斯介绍了一项措施，以阻止军方将视频游戏用作招募工具", "title_en": "Alexandria Ocasio-Cortez introduced a measure to stop the military from using video games as a recruitment tool", "transed": 1, "url": "https://www.insider.com/aoc-alexandria-ocasio-cortez-military-recruitment-video-games-twitch-2020-7", "via": "", "real_tags": ["游戏", "阻止", "禁止"]}, {"category": "", "categoryclass": "", "imagename": "ac1556871f72b7c1b749166b78767009.jpg", "infoid": 1014060, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国移民和海关执法局周五发布了一份新闻稿，禁止新的国际学生进入美国参加秋季学期，如果他们的课程完全是在线的。\n重要原因：由于冠状病毒大流行，几所美国学院和大学已经宣布计划在网上举办大部分或所有课程。\n许多大学依赖国际学生的学费，该指令可能会劝阻一些外国学生在下个学期入学。\n这项规定不会影响已经在美国学院和大学注册的国际学生。\n他们的意思是：ICE周五表示，根据2020年3月的指导方针，3月9日之后，具有新身份或初始身份的非移民学生将不能以非移民学生的身份进入美国学校学习秋季学期的全部在线课程。\n此外，指定的学校官员不应向美国以外的新移民或初始身份的非移民学生发放I-20表格，这些学生计划在[学生和交流访客计划]认证的教育机构完全在线上课。\n大局：ICE在7月初引入并撤回了指导意见，如果他们的大学今年秋天完全将课程转移到网上，这些指导意见将迫使国际学生离开美国或转学。\n特朗普政府因本月早些时候发布的这项指令而面临反弹和诉讼，这些反对和诉讼得到了200多所大学和18个州的支持。", "note_en": "U.S. Immigration and Customs Enforcement issued  a release on Friday barring new international students from entering the U.S. for their fall terms if their courses are entirely online.\n Why it matters: Several U.S. colleges and universities have announced plans to hold  most or all classes online because of the coronavirus pandemic.\n Many universities  rely on tuition from international students, and the directive could dissuade some foreign students from enrolling this coming semester.\n The rule won’t affect international students already enrolled at American colleges and universities.\n What they&#39;re saying: &#34;In accordance with March 2020 guidance, nonimmigrant students in new or initial status after March 9 will not be able to enter the U.S. to enroll in a U.S. school as a nonimmigrant student for the fall term to pursue a full course of study that is 100 percent online,&#34; ICE said Friday.\n &#34;Additionally, designated school officials should not issue a Form I-20 to a nonimmigrant student in new or initial status who is outside of the U.S. and plans to take classes at an [Student and Exchange Visitor Program]-certified educational institution fully online.&#34;\n The big picture: ICE  introduced and  withdrew guidance earlier in July that would have forced international students to leave the U.S. or transfer schools if their universities moved classes entirely online this fall.\n The Trump administration has faced backlash and lawsuits supported by more than  200 universities and 18 states over the directive released earlier this month.", "posttime": "2020-07-25 07:36:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,外国,bars,学生", "title": "如果课程完全在线，ICE禁止来自美国的新外国学生", "title_en": "ICE Bars New Foreign Students From US If Classes Are Fully Online", "transed": 1, "url": "https://www.axios.com/ice-bars-international-students-universities-coronavirus-7eabf01f-3e8f-44ff-8540-061288acc9b8.html", "via": "", "real_tags": ["美国", "外国", "bars", "学生"]}, {"category": "", "categoryclass": "", "imagename": "b696e65684c84ae1114863088db50450.jpg", "infoid": 1014058, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年春季卡内基梅隆大学(CMU)教授研究生课程15-751的“CS理论工具包”的讲座录像。涵盖了大量的数学知识。", "note_en": "Lecture videos for \"CS Theory Toolkit\" -- graduate course 15-751 taught at Carnegie Mellon University (CMU) in Spring 2020. Covers a large number of the math...", "posttime": "2020-07-25 07:34:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,donnell,大量", "title": "Ryan O‘Donnell的CS理论工具包(CMU 15-751,2020年春季)", "title_en": "Ryan O'Donnell's CS Theory Toolkit (CMU 15-751, Spring 2020)", "transed": 1, "url": "https://www.youtube.com/playlist?list=PLm3J0oaFux3ZYpFLwwrlv_EHH9wtH6pnX", "via": "", "real_tags": ["2020", "donnell", "大量"]}, {"category": "", "categoryclass": "", "imagename": "fd4831d9ab623654be2afd03108f186a.jpg", "infoid": 1014057, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎回到“工作中的科技”，每两周一次的劳动力综述和分析，以及科技领域的多样性和包容性。本周，我们将关注优步的反种族主义承诺，Shipt购物者罢工，Facebook的多样性报告，以及黑人零工组织起来反对科技公司。此外，听取CODE2040首席执行官卡拉·蒙特罗索关于科技公司对[…]的回应", "note_en": "Welcome back to Tech at Work, a bi-weekly roundup and analysis of labor, and diversity and inclusion in tech.  This week, we’re looking at Uber’s anti-racism commitment, Shipt shoppers walking off the job, Facebook’s diversity report and Black gig workers organizing against tech companies. Also, hear from CODE2040 CEO Karla Monterroso on tech’s response to […]", "posttime": "2020-07-25 07:13:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,黑人,work,多样性", "title": "\n工作中的科技：黑人零工畅所欲言，看看优步反种族主义的承诺和Facebook的多元化报告", "title_en": "\n\t\t\t\tTech at Work: Black gig workers speak out, and a look at Uber commitment to being anti-racist and Facebook’s diversity report\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/24/tech-at-work-black-gig-workers-speak-out-and-a-look-at-uber-commitment-to-being-anti-racist-and-facebooks-diversity-report/", "via": "", "real_tags": ["facebook", "黑人", "work", "多样性"]}, {"category": "", "categoryclass": "", "imagename": "6546b10e51e1e1e6cd91a3c94333830f.png", "infoid": 1014053, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "[7-2-2020]FDA警告消费者和医疗保健提供者，该机构看到贴着含有乙醇(也称为乙醇)标签，但甲醇污染检测呈阳性的洗手液产品数量急剧增加。甲醇，或木醇，是一种物质，当通过皮肤吸收或摄入时可能是有毒的，当摄入时可能会危及生命。\n该机构意识到成人和儿童摄入被甲醇污染的洗手液产品，这导致了最近的不良事件，包括失明，住院和死亡。\n甲醇不是可接受的洗手液活性成分，由于其毒性作用，不能使用。FDA正在对某些洗手液中的甲醇进行调查。该机构将在获得更多信息时提供这些信息。\n接触过含有甲醇的洗手液并出现症状的消费者应立即寻求治疗，以期潜在地逆转甲醇中毒的毒性影响。大量接触甲醇会导致恶心、呕吐、头痛、视力模糊、永久性失明、癫痫发作、昏迷、神经系统永久性损伤或死亡。尽管所有在手上使用这些产品的人都有甲醇中毒的风险，但意外摄入这些产品的幼儿和将这些产品作为酒精(乙醇)替代品饮用的青少年和成年人风险最大。\nFDA提醒消费者经常用肥皂和水洗手至少20秒，特别是在上厕所后，吃饭前，以及咳嗽、打喷嚏或流鼻涕之后。如果肥皂和水不容易获得，疾病控制和预防中心(CDC)建议消费者使用含有至少60%乙醇(也称为乙醇)的酒精类洗手液。\nFDA保持警惕，当洗手液出现质量问题时，将继续采取行动。该机构特别关注：\n在任何情况下饮用任何洗手液的危险。虽然可能受到甲醇污染的洗手液比那些没有受到污染的洗手液更具生命威胁，但FDA敦促消费者不要饮用这些产品中的任何一种。\n某些可能不含足量乙醇或异丙醇的洗手液。\n销售或提供销售的洗手液，带有虚假和误导性的未经证实的声称可以防止新冠肺炎等病毒传播的行为，包括声称可以提供长期保护(例如，最长可达24小时)的洗手液。\n被欺诈性地标榜为“FDA批准”的产品，因为没有FDA批准的洗手液。\n包装成饮料、糖果或酒瓶的产品，以及作为饮料或鸡尾酒销售的产品，因为它们的外观可能会导致意外摄入或鼓励摄入。儿童使用这些产品的风险尤其大，因为只摄入少量的洗手液对幼儿可能是致命的。\nFDA知道与洗手液产品相关的不良事件报告。FDA鼓励医疗保健专业人员、消费者和患者向FDA的MedWatch不良事件报告计划报告使用洗手液时遇到的不良事件或质量问题(请向该机构提供尽可能多的信息以识别产品)：\n下表概述了消费者用来识别产品的洗手液标签上的信息：\n据称，这与FDA测试并发现含有甲醇的产品是在同一工厂生产的。\nFDA建议消费者不要使用这些公司的洗手液，也不要使用带有这些名称或NDC编号的产品。\nFDA检测的产品；含有甲醇；FDA建议在2020年7月6日召回；添加到进口警告中，以阻止产品于2020年7月16日进入美国\nFDA检测的产品；含有甲醇；FDA建议在2020年7月6日召回；添加到进口警告中，以阻止产品于2020年7月16日进入美国。\nFDA检测的产品；含有甲醇；FDA建议在2020年7月6日召回；产品于2020年7月11日自愿召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\nFDA检测的产品；含有甲醇；FDA建议在2020年7月6日召回；添加到进口警告中，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；产品于2020年7月11日自愿召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；产品于2020年7月11日自愿召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；产品于2020年7月11日自愿召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；产品于2020年7月11日自愿召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国\n声称在同一工厂生产的产品；FDA建议在2020年7月6日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\nFDA检测的产品；含有甲醇；FDA建议在2020年7月2日召回；在2020年7月7日加入进口警示，停止产品进入美国；2020年7月14日自愿召回产品。\n声称在同一工厂生产的产品；FDA建议在2020年7月2日召回；添加到进口警告，以阻止产品于2020年7月7日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月2日召回；添加到进口警告，以阻止产品于2020年7月7日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月2日召回；添加到进口警告，以阻止产品于2020年7月7日进入美国。\nFDA检测的产品；含有甲醇；产品保留在边境；FDA建议于2020年6月29日召回市场上所有其他潜在的产品；于2020年7月13日增加进口警示，以阻止产品进入美国。\nFDA测试的产品；含有甲醇；FDA建议在2020年6月29日召回市场上其他所有潜在的产品；在2020年7月13日增加进口警示，以阻止产品进入美国。\n据称是在同一家工厂生产的产品；FDA建议于2020年6月29日召回市场上所有其他潜在的产品；2020年7月13日增加进口警示，以阻止产品进入美国\n声称在同一工厂生产的产品；iTech 361于2020年7月6日自愿召回的产品；添加到进口警报，以阻止产品于2020年7月15日进入美国。\n声称在同一工厂生产的产品；添加到进口警报中，以阻止产品于2020年7月15日进入美国。\nFDA测试的产品；含有甲醇；添加到进口警告中，以阻止产品于2020年7月15日进入美国。\n声称在同一工厂生产的产品；添加到进口警报中，以阻止产品于2020年7月15日进入美国。\n声称在同一工厂生产的产品；添加到进口警报中，以阻止产品于2020年7月15日进入美国。\nFDA测试的产品；含有甲醇；添加到进口警告中，以阻止产品于2020年7月15日进入美国。\n声称在同一工厂生产的产品；添加到进口警报中，以阻止产品于2020年7月15日进入美国。\n声称在同一工厂生产的产品；Saniderm Products和UVT Inc.于2020年6月26日自愿召回的产品。2020年6月29日；添加到进口警报，以阻止产品于2020年7月15日进入美国\nFDA测试的产品；不含甲醇；FDA建议在2020年7月1日召回；添加到进口警告，以阻止产品于2020年7月10日进入美国。\nFDA检测的产品；含有甲醇；FDA建议在2020年7月8日召回；添加到进口警告中，以阻止产品于2020年7月15日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月8日召回；添加到进口警告中，以阻止产品于2020年7月15日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月8日召回；添加到进口警告中，以阻止产品于2020年7月15日进入美国。\nFDA测试的产品；乙醇水平为次要水平；FDA建议在2020年7月8日召回；添加到进口警告，以阻止产品于2020年7月15日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月8日召回；添加到进口警告中，以阻止产品于2020年7月15日进入美国。\nFDA测试的产品；含有甲醇；FDA建议在2020年7月7日召回；公司没有在FDA注册；其他产品可能在市场上；添加到进口警告中，以阻止产品在2020年7月15日进入美国。\nFDA检测的产品；含有甲醇；FDA建议在2020年7月7日召回；在2020年7月15日加入进口警示，停止产品进入美国；2020年7月20日自愿召回产品\n声称在同一工厂生产的产品；FDA建议在2020年7月7日召回；在2020年7月15日加入进口警示，以阻止产品进入美国；2020年7月20日自愿召回产品。\nFDA检测的产品；含有甲醇；FDA建议在2020年7月9日召回；添加到进口警告中，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月9日召回；添加到进口警告，以阻止产品于2020年7月16日进入美国。\n洗手液消毒剂凝胶70%乙醇漱口免洗洗手液(贴有资源回收与贸易有限责任公司标签)。\n声称在同一工厂生产的产品；FDA建议在2020年7月14日召回。\nFDA检测的产品；含有甲醇；FDA建议在2020年7月14日召回；添加到进口警告中，以阻止产品在2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月14日召回；添加到进口警告中，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月14日召回；添加到进口警告中，以阻止产品于2020年7月16日进入美国\n声称在同一工厂生产的产品；FDA建议在2020年7月14日召回；添加到进口警告中，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月14日召回；添加到进口警告中，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月14日召回；添加到进口警告中，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月14日召回；添加到进口警告中，以阻止产品于2020年7月16日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月14日召回；添加到进口警告中，以阻止产品于2020年7月16日进入美国。\nFDA检测的产品；含有甲醇；FDA建议在2020年7月1日召回；在2020年7月10日加入进口警示，停止产品进入美国；2020年7月14日自愿召回产品。\nFDA检测的产品；含有甲醇；FDA建议在2020年7月1日召回；添加到进口警告中，以阻止产品于2020年7月10日进入美国。\n声称在同一工厂生产的产品；FDA建议在2020年7月1日召回；添加到进口警告中，以阻止产品于2020年7月10日进入美国\nFDA测试的产品；不含甲醇；FDA建议在2020年7月1日召回；添加到进口警告，以阻止产品于2020年7月10日进入美国。\nFDA检测的产品；含有甲醇；FDA建议在2020年7月10日召回；添加到进口警告中，以阻止产品在2020年7月17日进入美国", "note_en": "[7-2-2020] FDA is warning consumers and health care providers that the agency has seen a sharp increase in  hand sanitizer products that are labeled to contain ethanol (also known as ethyl alcohol) but that have tested positive for methanol contamination. Methanol, or wood alcohol, is a substance that can be toxic when absorbed through the skin or ingested and can be life-threatening when ingested.\n The agency is aware of adults and children ingesting hand sanitizer products contaminated with methanol that has led to recent adverse events including blindness, hospitalizations and death.\n Methanol is not an acceptable active ingredient for hand sanitizers and must not be used due to its toxic effects. FDA’s investigation of methanol in certain hand sanitizers is ongoing. The agency will provide additional information as it becomes available.\n Consumers who have been exposed to hand sanitizer containing methanol and are experiencing symptoms should seek immediate treatment for potential reversal of toxic effects of methanol poisoning. Substantial methanol exposure can result in nausea, vomiting, headache, blurred vision, permanent blindness, seizures, coma, permanent damage to the nervous system or death. Although all persons using these products on their hands are at risk for methanol poisoning, young children who accidently ingest these products and adolescents and adults who drink these products as an alcohol (ethanol) substitute, are most at risk.\n FDA reminds  consumers to wash their hands often with soap and water for at least 20 seconds, especially after going to the bathroom; before eating; and after coughing, sneezing, or blowing one’s nose. If soap and water are not readily available, the  Centers for Disease Control and Prevention (CDC) recommend consumers use an alcohol-based hand sanitizer that contains at least 60 percent ethanol (also referred to as ethyl alcohol).\n FDA remains vigilant and will continue to take action when quality issues arise with hand sanitizers. The agency is especially concerned with:\n The dangers of drinking any hand sanitizer under any conditions. While hand sanitizers with possible methanol contamination are more life-threatening than those that are not contaminated, FDA urges consumers not to drink any of these products.\n  Certain hand sanitizers that may not contain a sufficient amount of ethyl alcohol or isopropyl alcohol.\n  Hand sanitizers that are sold or offered for sale with false and misleading, unproven claims that they can prevent the spread of viruses such as COVID-19, including claims that they can provide prolonged protection (e.g., for up to 24-hours).\n  Products that are fraudulently marketed as “FDA-approved” since there are no hand sanitizers approved by FDA.\n  Products packaged to appear as drinks, candy or liquor bottles, as well as products marketed as drinks or cocktails because their appearance could result in accidental ingestion or encourage ingestion. Children are particularly at risk with these products since ingesting only a small amount of hand sanitizer may be lethal in a young child.\n FDA is aware of reports of adverse events associated with hand sanitizer products. FDA encourages health care professionals, consumers and patients to report adverse events or quality problems experienced with the use of hand sanitizers to FDA’s  MedWatch Adverse Event Reporting program (please provide the agency with as much information as possible to identify the product):\n   The following chart outlines the information on hand sanitizer labels for consumers to use to identify a product:\n That is purportedly made at the same facility as products that have been tested by FDA and found to contain methanol.\n FDA advises consumers not to use hand sanitizers from these companies, or products with these names or NDC numbers.\n FDA tested product; contains methanol; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n FDA tested product; contains methanol; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n FDA tested product; contains methanol; FDA recommended a recall on 07/06/2020; product voluntarily  recalled on 7/11/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n FDA tested product; contains methanol; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; product voluntarily  recalled on 7/11/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; product voluntarily  recalled on 7/11/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; product voluntarily  recalled on 7/11/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; product voluntarily  on 7/11/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/06/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n FDA tested product; contains methanol; FDA recommended a recall on 07/02/2020; added to  import alert to stop products from entering the U.S. on 7/7/2020; product voluntarily  recalled on 7/14/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/02/2020; added to  import alert to stop products from entering the U.S. on 7/7/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/02/2020; added to  import alert to stop products from entering the U.S. on 7/7/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/02/2020; added to  import alert to stop products from entering the U.S. on 7/7/2020\n FDA tested product; contains methanol; product retained at the border; FDA recommended a recall on all other potential products on the market on 6/29/2020; added to  import alert to stop products from entering the U.S. on 7/13/2020\n FDA tested product; contains methanol; FDA recommended a recall on other all potential products on the market on 6/29/2020; added to  import alert to stop products from entering the U.S. on 7/13/2020\n Product purported to be made at the same facility; FDA recommended a recall on all other potential products on the market on 6/29/2020; added to  import alert to stop products from entering the U.S. on 7/13/2020\n Product purported to be made at the same facility; product voluntarily recalled by  ITECH 361 on 7/6/2020; added to  import alert to stop products from entering the U.S. on 7/15/2020\n Product purported to be made at the same facility; added to  import alert to stop products from entering the U.S. on 7/15/2020\n FDA tested product; contains methanol; added to  import alert to stop products from entering the U.S. on 7/15/2020\n Product purported to be made at the same facility; added to  import alert to stop products from entering the U.S. on 7/15/2020\n Product purported to be made at the same facility; added to  import alert to stop products from entering the U.S. on 7/15/2020\n FDA tested product; contains methanol; added to  import alert to stop products from entering the U.S. on 7/15/2020\n Product purported to be made at the same facility; added to  import alert to stop products from entering the U.S. on 7/15/2020\n Product purported to be made at the same facility; product voluntarily recalled by  Saniderm Products on 6/26/2020 and  UVT Inc. on 6/29/2020; added to  import alert to stop products from entering the U.S. on 7/15/2020\n FDA tested product; contains  methanol; FDA recommended a recall on 07/01/2020; added to  import alert to stop products from entering the U.S. on 7/10/2020\n FDA tested product; contains methanol; FDA recommended a recall on 07/08/2020; added to  import alert to stop products from entering the U.S. on 7/15/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/08/2020; added to  import alert to stop products from entering the U.S. on 7/15/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/08/2020; added to  import alert to stop products from entering the U.S. on 7/15/2020\n FDA tested product; ethanol level was subpotent; FDA recommended a recall on 07/08/2020; added to  import alert to stop products from entering the U.S. on 7/15/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/08/2020; added to  import alert to stop products from entering the U.S. on 7/15/2020\n FDA tested product; contains methanol; FDA recommended a recall on 07/07/2020; company is not registered with FDA; additional products may be on the market; added to  import alert to stop products from entering the U.S. on 7/15/2020\n FDA tested product; contains methanol; FDA recommended a recall on 07/07/2020; added to  import alert to stop products from entering the U.S. on 7/15/2020; product voluntarily  recalled on 7/20/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/07/2020; added to  import alert to stop products from entering the U.S. on 7/15/2020; product voluntarily  recalled on 7/20/2020\n FDA tested product; contains methanol; FDA recommended a recall on 07/09/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/09/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n  Hand Sanitizer Disinfectant Gel 70% Ethyl Alcohol Rinse Free Hand Rub (labeled with Resource Recovery &amp; Trading LLC)\n    Product purported to be made at the same facility; FDA recommended a recall on 07/14/2020\n  FDA tested product; contains methanol; FDA recommended a recall on 07/14/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/14/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/14/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/14/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/14/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/14/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/14/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/14/2020; added to  import alert to stop products from entering the U.S. on 7/16/2020\n FDA tested product; contains  methanol; FDA recommended a recall on 07/01/2020; added to  import alert to stop products from entering the U.S. on 7/10/2020; product voluntarily  recalled on 7/14/2020\n FDA tested product; contains methanol; FDA recommended a recall on 07/01/2020; added to  import alert to stop products from entering the U.S. on 7/10/2020\n Product purported to be made at the same facility; FDA recommended a recall on 07/01/2020; added to  import alert to stop products from entering the U.S. on 7/10/2020\n FDA tested product; contains  methanol; FDA recommended a recall on 07/01/2020; added to  import alert to stop products from entering the U.S. on 7/10/2020\n FDA tested product; contains methanol; FDA recommended a recall on 07/10/2020; added to  import alert to stop products from entering the U.S. on 7/17/2020", "posttime": "2020-07-25 06:49:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "甲醇,updates,产品", "title": "FDA更新含甲醇的洗手液", "title_en": "FDA Updates on Hand Sanitizers with Methanol", "transed": 1, "url": "https://www.fda.gov/drugs/drug-safety-and-availability/fda-updates-hand-sanitizers-methanol", "via": "", "real_tags": ["甲醇", "updates", "产品"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014051, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果公司正在赞助第43届信息检索特别兴趣小组(SIGIR)会议，该会议实际上将于7月25日至30日举行。SIGIR是一个领先的国际论坛，专注于展示信息检索领域的新研究。\n查看活动详细信息。\n苹果公司赞助了第37届国际机器学习会议(ICML)，该会议于7月12日至18日举行。ICML是致力于推进机器学习领域的全球领先会议。\n查看活动详细信息", "note_en": "Apple is sponsoring the forty-third Special Interest Group on Information Retrieval (SIGIR) Conference, which will be held virtually from July 25 to 30. SIGIR is a leading international forum focused on presenting new research in the informational retrieval field.\n See event details\n Apple sponsored the thirty-seventh International Conference on Machine Learning (ICML), which was held virtually from July 12 to 18. ICML is a leading global gathering dedicated to advancing the machine learning field.\n See event details", "posttime": "2020-07-25 06:26:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,机器,learning,会议", "title": "苹果公司的机器学习研究", "title_en": "Machine Learning Research at Apple", "transed": 1, "url": "https://machinelearning.apple.com", "via": "", "real_tags": ["苹果", "apple", "机器", "learning", "会议"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014050, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我已经有一段时间没有在这个博客上写东西了。你们中的一些人认为这个项目已经死了，但显然不是这样的！我继续发布许多更新，大约每隔一周发布一次，带来新功能和错误修复。\n最近，苹果公司宣布为Macintosh产品线过渡到新的架构。这是一个非常令人振奋的举动，我真的希望这是最好的。当时我有一台装有摩托罗拉CPU的Macintosh，之后是PowerPC G3，之后是许多基于英特尔的Macintoshes。大部分过渡都进行得很顺利，我毫不怀疑苹果会很好地过渡到ARM/Apple Silicon架构。\n对于大多数应用程序，即使代码是为英特尔架构编写的，过渡也是透明的。但就Hopper而言，其运行所在的架构意义重大！当然，主要问题是调试器，它严重依赖于底层架构。\n几周前，我收到了苹果提供的开发人员过渡工具包，我已经开始致力于支持ARM架构。今天，我很高兴地宣布，Hopper将全面支持MacOS Big Sur和苹果的Silicon CPU！\nMacOS Big Sur在引擎盖下改变了很多东西。例如，有一种在可执行元数据中引用Objective-C选择器的新方法，这迫使我重写了很多东西。此外，系统框架的存储方式与以前不同，而是存储在几乎与IOS相同的共享缓存中。其中一些更改现在由Hopper处理，但还不是全部。我希望发布当前版本的更新，其中包括对这些修改的处理。\n总而言之，仍然有很多工作要做，但主要的构建块已经在那里了！不幸的是，为了完全接受这个新的操作系统，我不得不提高Hopper能够在其上运行的最低版本。在不久的将来，我需要放弃对MacOS10.9到10.12的支持。", "note_en": "It has been a while since I last wrote something on this blog. Some of you thought that the project was dead, but this is clearly not the case! I continued to release many updates, approximately every other week, bringing new features and bug fixes.\n Recently, Apple announced their transition to a new architecture for the Macintosh product line. This is a very exiting move and I really hope that it will be for the best. I owned a Macintosh with a Motorola CPU back in the day, and after that a PowerPC G3, followed by many Intel based Macintoshes. Most transition went fine and I’ve no doubt that Apple will provide a nice transition to the ARM / Apple Silicon architecture.\n For most applications, the transition will be transparent, even if the code has been wrote for the Intel architecture. But in the case of Hopper, the architecture on which it runs means a lot! The main issue is of course the debugger which heavily depends on the underlying architecture.\n I have received a Developer Transition Kit from Apple a few weeks ago, and I’ve started to work on supporting the ARM architecture. Today, I’m happy to announce that  Hopper will fully support macOS Big Sur and Apple Silicon CPU!\n  macOS Big Sur changes a lot of things under the hood. For instance, there is a new way of referencing Objective-C selectors in the executable metadata which forces me to rewrite a lot of things. Also, the system frameworks are not stored the same way as before, but rather in a shared cache almost like iOS. Some of these changes are now handled by Hopper but not all of them yet. I expect to release an update of the current version which includes the handling of these modifications.\n To sum it up, there is still a lot of work to do but the main building blocks are there! Unfortunately, in order to fully embrace this new OS, I had to raise the minimal version on which Hopper is able to run.  In a near future, I’ll need to drop the support for macOS 10.9 to 10.12.", "posttime": "2020-07-25 06:26:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,料斗,silicon,hopper", "title": "苹果硅在料斗拆装机中的支撑", "title_en": "Apple Silicon Support in Hopper Disassembler", "transed": 1, "url": "https://www.hopperapp.com/blog/?p=254", "via": "", "real_tags": ["苹果", "apple", "料斗", "silicon", "hopper"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014049, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我参加了GMTK 2020年的游戏即兴表演，那是一次灵魂崩溃的经历。我在机制和编程上投入了如此多的精力，我在社交媒体上就此发表了帖子。我在这件事上付出的努力比我过去做的所有事情都要多得多，但我没有得到任何反馈，我落在了名单的底部。这是到目前为止我做过的收视率最差的游戏。就像我甚至没有被告知这个游戏出了什么问题一样；人们只是给了它一个不好的评价，然后就离开了，没有留下任何批评。\n我唯一能得出的结论就是我的游戏太难看了。无可否认，这就是事实。\n马克在他的视频中只谈到了机械学，但我马上看到的是，他视频中的每一场比赛看起来都有些令人愉快。我的意思是，人们假装机械是最重要的事情，然而每个人都通过它的图形来评判你的游戏，他们甚至不玩它，无论你的机械师有多有创造力或多好。\n编辑：我想这比我的游戏更复杂，我的游戏很难看。但是，很难说你什么时候开始没有得到任何反馈。我很高兴我终于得到了一些意见。谢谢各位，我真的很感激：)", "note_en": "I participated in the GMTK Game Jam 2020 and it was a soul crushing experience. I put so much effort into the mechanics and programming, I made posts on social media about it. I put so much more effort into this than in all the jams I&#39;ve made in the past, and yet I got zero feedback and I landed at the bottom of the list. It&#39;s the worst rated game I have made so far. Like I didn&#39;t even got told what&#39;s wrong with the game; people just gave it a bad rating and left, without leaving any criticism.\n The only thing I can conclude is that my game is just ugly. Which admittedly, it is.\n Mark talked only about mechanics in his video, but what jumped into my eye right immediately is, how every game in his video was somewhat pleasing to look at. I mean people pretend that mechanics are the most important thing, and yet everyone judges your game by it&#39;s graphics and they don&#39;t even play it, no matter how creative or good your mechanic is.\n   EDIT: I guess it&#39;s a whole more complicated than just &#34;my game is ugly&#34;. But it&#39;s hard to tell when you initially get no feedback whatsoever. I am so glad that I finally get some input. Thanks guys, I really appreciate it :)", "posttime": "2020-07-25 06:26:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,game", "title": "如果你的游戏很难看，人们会喜欢吗？", "title_en": "Will people like your game if it's ugly?", "transed": 1, "url": "https://www.reddit.com/r/gamedev/comments/hwmmbr/people_wont_like_your_game_if_its_ugly/", "via": "", "real_tags": ["游戏", "game"]}, {"category": "", "categoryclass": "", "imagename": "11a77bb238cff3b4275860b71b6ca3dc.jpg", "infoid": 1014048, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国联邦航空管理局已下令航空公司检查其737飞机的引擎，此前有四份单引擎停机报告。\n由于冠状病毒大流行抑制了航空旅行的需求，许多737飞机已经在机库里停了几个星期。随着航空公司恢复运营，他们发现一个钥匙阀在几周未使用后往往会卡住。美国联邦航空局估计，大约2000架飞机可能会受到影响。\n联邦航空局的指令警告说，如果这个阀门在起飞动力时正常开启，在飞行过程中可能会卡住在打开位置，当下降顶部的动力减少时，它可能无法关闭。这可能会导致压缩机无法恢复失速，无法重新启动发动机。\n最近几周，这种情况已经发生了四次。阿拉斯加航空公司承认，它的一架飞机在从西雅图飞往奥斯汀的航班上遇到了这个问题。航空公司表示，尽管飞机的一个发动机意外关闭，但飞机仍能够安全着陆，没有人受伤。\n值得庆幸的是，其他三起事故也是如此：只有一台发动机关闭，没有造成人员伤亡。但美国联邦航空局担心，一架飞机的两个引擎可能会同时出现同样的故障，这可能会导致飞机被迫在机场外降落。\n因此，美国联邦航空局命令航空公司仔细检查任何737飞机的发动机，这些飞机已经连续停飞7天或更长时间，而且从那以后就没有飞行过10次。如果发现粘性阀门，必须先更换，然后飞机才能重新投入使用。大多数航空公司表示，强制性检查不会对他们的航班时刻表产生重大影响。\n订单涉及737的较老型号-从737-300线到737-900线。波音公司较新的737-MAX系列仍然停飞，因为该公司正在努力解决设计和软件问题。", "note_en": "The Federal Aviation Administration has  ordered airlines to inspect the engines of their 737 airplanes after four reports of &#34;single-engine shutdowns.&#34;\n Many 737 aircraft have been sitting in hangars for weeks as the coronavirus pandemic suppressed demand for air travel. As airlines have resumed operations, they&#39;ve discovered that a key valve has a tendency to get stuck after weeks without being used. The FAA  estimates that around 2,000 aircraft could be affected.\n &#34;If this valve opens normally at takeoff power, it may become stuck in the open position during flight and fail to close when power is reduced at the top of descent,&#34; the FAA&#39;s directive warns. That could result in &#34;an unrecoverable compressor stall and the inability to restart the engine.&#34;\n This has happened on four occasions in recent weeks. Alaska Airlines has  acknowledged that one of its airplanes suffered from the problem during a flight from Seattle to Austin. The airplane was able to land safely despite the unexpected shutdown of one of its engines and no one was injured, the airline says.\n Thankfully, the same was true of the other three incidents: only one engine shut down and no injuries occurred as a result. But the FAA worries that an aircraft could suffer the same malfunction in both engines simultaneously, which could &#34;result in a forced off-airport landing.&#34;\n So the FAA is ordering airlines to carefully inspect the engines of any 737 aircraft that has been out of service for seven or more days in a row—and hasn&#39;t flown 10 times since then. If a sticky valve is discovered, it must be replaced before the airplane can be put back into service. Most airlines said that the mandatory inspections would not significantly impact their flight schedules.\n The order relates to older models of the 737—from the 737-300 line through the 737-900 line. Boeing&#39;s newer 737-MAX line is still grounded as the company  struggles to remedy design and software problems.", "posttime": "2020-07-25 06:05:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,发动机,orders,飞机", "title": "美国联邦航空局在四次非致命的发动机关闭后下令检查波音737", "title_en": "FAA orders inspections of 737s after four non-fatal engine shutdowns", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/07/faa-orders-inspections-of-737s-after-four-non-fatal-engine-shutdowns/", "via": "", "real_tags": ["美国", "发动机", "orders", "飞机"]}, {"category": "", "categoryclass": "", "imagename": "87df6a90a2122a80af8664736c0326b0.jpeg", "infoid": 1014047, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一名研究人员发明了一种算法，该算法利用人工智能创建新的歌词，与现有歌曲的押韵和音节模式相匹配，根据周四发布的一份副刊报道。\n佐治亚理工学院的研究人员马克·里德尔(Mark Riedl)告诉“副刊”，他创造了他的怪异A.I.Yancovic算法，这是一个个人项目。该算法的名字灵感来自恶搞歌手怪异·阿尔·扬科维奇(Weird Al Yankovic)，他做了类似的事情，利用现有的歌曲，用新歌词创建了自己的衍生版本。他最受欢迎的恶搞之一是说唱歌手“超级富豪”和“克莱兹·伯恩”模仿的“怀特和书呆子”(#34；White&Amp；Nerdy，&34；Ridin&34；Ridin&Krayzie bone)。\n然而，正如副总统指出的那样，据报道，扬科维奇在创作他对一首给定歌曲的恶搞之前，曾征得原创艺术家的许可。里德尔没有--这让他陷入了困境。\n5月15日，Riedl在推特上发布了一段视频，视频中有人工智能创作的歌词和迈克尔·杰克逊(Michael Jackson)乐队的器乐部分。据报道，7月14日，在国际唱片业联合会(International Federation Of The Phonography Industry)向推特提交版权撤销通知后，推特将其撤下。国际唱片业联合会是唱片业一些最大的公司的联盟。巧合的是，恶搞歌手怪异·阿尔·扬科维奇(Weird Al Yankovic)也在2010年创作了这首热门歌曲的一个版本，名为“吃吧”(&#34；Eat It，&#34；)。\nRiedl在Twitter上发布的其他类似的人工智能生成的视频也一直流传至今，比如萨姆·史密斯(Sam Smith)和诺曼尼(Normani)的衍生剧“与陌生人共舞”(Dance With A Stranger)。\nRiedl告诉媒体，他认为他的视频受到合理使用的保护，这是版权法的一个漏洞，允许人们在某些情况下在没有事先获得许可的情况下使用受版权保护的作品。在其他规定中，该原则涵盖了恶搞作品。\n我会争辩说，我的系统正在生成恶搞歌词，我不需要版权所有者的许可就可以发布恶搞内容，里德尔告诉“新闻周刊”。然而，我不是一名律师。副总统采访了科罗拉多博尔德大学的信息科学教授凯西·菲斯勒，他同意里德尔的视频应该受到合理使用的保护。\n随着副主席的探索，这场溃败引发了一系列与技术和版权使用的交集有关的问题，包括算法生成的作品应该如何在合理使用的情况下进行情境分析，以及版权法可以或应该如何演变，以适应人工智能等技术的进步。\n据报道，里德尔正在反击推特撤下他的“击败它”视频，目前还没有收到该公司的回复。\n点击“注册”，即表示您同意接收来自Business Insider的营销电子邮件以及其他合作伙伴优惠，并接受我们的服务条款和隐私政策。", "note_en": "A researcher has created an algorithm that uses artificial intelligence to create new lyrics &#34;that match the rhyme and syllables schemes of existing songs,&#34; per a  Vice report published Thursday.\n Mark Riedl, a researcher at Georgia Tech, told Vice he created his &#34;Weird A.I. Yancovic&#34; algorithm as a personal project. The algorithm&#39;s name is inspired by the parody singer Weird Al Yankovic, who does something similar, taking existing songs and creating his own spinoff version with new lyrics. One of his most popular parodies is  &#34;White &amp; Nerdy,&#34; a take on &#34;Ridin&#34; by rappers Chamillionaire and Krayzie Bone.\n As Vice notes, however, Yankovic reportedly asks the original artist for permission before creating his parody of a given song. Riedl does not — and it&#39;s landed him in hot water.\n Riedl posted a video to Twitter on May 15 with AI-generated lyrics and the instrumental part of Michael Jackson&#39;s &#34;Beat It.&#34; On July 14, Twitter took it down after the International Federation of the Phonographic Industry, a coalition of some of the record industry&#39;s biggest companies, submitted a copyright takedown notice to Twitter, per the report. Coincidentally, Weird Al Yankovic, the parody singer, also created a version of the hit track, entitled  &#34;Eat It,&#34; in 2010.\n   Other similar AI-generated videos that Riedl has posted to Twitter have stayed up, like a  spinoff of Sam Smith and Normani&#39;s &#34;Dancing With a Stranger.&#34;\n Riedl told the outlet he thinks his videos are protected by fair use, which is a loophole in copyright laws that allow people to use copyrighted work without obtaining permission beforehand in certain circumstances. The doctrine covers parody work,  among other stipulations.\n &#34;I would argue that my system is generating parody lyrics and that I do not require permission from the copyright holder to publish parody content,&#34; Riedl told Vice. &#34;I am not a lawyer, however.&#34; Vice spoke with Casey Fiesler, an Information Science professor at the University of Colorado Boulder, who agreed that Riedl&#39;s video should be protected under fair use.\n As Vice explores, the debacle has raised a host of questions pertaining to the intersection of technology and copyright usage, including how algorithm-generated work should be contextualized under fair use and how copyright laws could, or should, evolve to adapt to advancements in technology, like AI.\n   Per the report, Riedl is pushing back against Twitter&#39;s takedown of his &#34;Beat It&#34; video and hasn&#39;t heard back from the company yet.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.", "posttime": "2020-07-25 06:04:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "算法,人员,created,里德尔", "title": "一名研究人员创造了一种“怪异的A.I.扬科维奇”算法，该算法可以模仿现有歌曲，现在唱片行业指控他侵犯版权", "title_en": "A researcher created a 'Weird A.I. Yancovic' algorithm that generates parodies of existing songs, and now the record industry is accusing him of copyright violations", "transed": 1, "url": "https://www.businessinsider.com/weird-ai-yancovic-algorithm-parody-song-fair-use-2020-7", "via": "", "real_tags": ["算法", "人员", "created", "里德尔"]}]