[{"category": "", "categoryclass": "", "imagename": "97511e88750ae8a6cb17654529848100.png", "infoid": 1029295, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天开始预订三款主要的苹果新产品：iPhone12，iPhone12Pro和iPad Air。所有这些设备都可以在苹果网站上订购，但都不会马上发货。\n所有这些设备的计划发货日期都是10月23日，但其中一些已经推迟到11月。在某些情况下，这取决于您选择的配置。在撰写本文时，一些iPhone12和iPad Air配置的发货时间较晚，但其他配置的发货日期仍为10月23日。另一方面，我们看到的每一种iPhone12Pro配置都承诺在10月晚些时候或11月的某个时候发货。\n此外，在美国电话电报公司(AT&amp；T)和威瑞森公司(Verizon)宣布iPhone价格略低后，苹果公司似乎已经将所有运营商的iPhone价格正常化。此前，这款手机最初宣布的价格略低，引发了轩然大波。", "note_en": "Pre-orders began today for three major new Apple products: the  iPhone 12,  iPhone 12 Pro, and  iPad Air. All these devices are available for order on Apple&#39;s website, but none are shipping right away.\n The planned ship dates for all of these devices was October 23, but some are already backed up into November. In some cases, it depends on the configuration that you choose. At the time of this writing, some iPhone 12 and iPad Air configurations are shipping later, but others are still listing October 23 as the ship date. On the other hand, every iPhone 12 Pro configuration we looked at promises to ship either later in October or sometime in November.\n Additionally, Apple seems to have normalized the cost of the iPhone across all carriers after an initial uproar about the phone being announced at a slightly cheaper price point on AT&amp;T and Verizon.", "posttime": "2020-10-17 02:34:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "iphone,ipad,发货", "title": "IPhone 12、iPhone 12 Pro和iPad Air的订单已经开始", "title_en": "iPhone 12, iPhone 12 Pro, and iPad Air orders have begun", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/10/iphone-12-iphone-12-pro-and-ipad-air-orders-have-begun/", "via": "", "real_tags": ["iphone", "ipad", "发货"]}, {"category": "", "categoryclass": "", "imagename": "998bbcfbe9a2f6d810121ec5d98f39d6.jpg", "infoid": 1029294, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然该公司曾讨论过IPO，但到了2016年，它开始试探买家。Vista Equity Partners出价6亿美元，并承诺继续建设公司，这是企业买家不会保证的。Ping首席执行官兼联合创始人安德烈·杜兰德(Andre Durand)接受了Vista的报价，认为这是一种付清投资者和员工的钱，并以正确的方式退出的方式。更好的是，他的公司没有像典型的并购交易那样被并入一个大实体。\n事实证明，IPO或收购的问题并不是一个非此即彼的命题。Vista继续对该公司进行投资，使用Unbound ID和Elastic Beam等小型收购来填补其路线图，平安去年上市。该公司的经验表明，私募股权为成熟的初创企业提供了一种合理的方式-就像100%或更多的风险投资公司往往青睐的那样，为成长良好但并不异常的初创企业提供了一种退出、支付投资者、奖励员工并继续建设公司的方式。\n但并不是每个走这条路的人都会像平那样有好的结果。一些公司被带进市盈率领域，更换高管团队，忍受大规模裁员，或者出售有利可图的部门，停止对产品的投资。但我们采访的三家私募股权公司-Vista Equity，Thoma Bravo和Scaleworks-都希望看到他们的收购成功，即使他们各自的做法不同。", "note_en": "While the company had  once discussed an IPO, by 2016 it began putting out feelers for buyers. Vista Equity Partners  made a $600 million offer and promised to keep building the company, something that corporate buyers wouldn’t guarantee. Ping CEO and co-founder Andre Durand accepted Vista’s offer, seeing it as a way to pay off his investors and employees and exit the right way. Even better, his company wasn’t subsumed into a large entity as likely would have happened with a typical M&amp;A transaction.\n  As it turned out, the IPO-or-acquisition question wasn’t an either/or proposition. Vista continued to invest in the company, using small acquisitions  like UnboundID and  Elastic Beam to fill in its roadmap, and  Ping went public last year. The company’s experience shows that private equity offers a reasonable way for mature enterprise startups with decent but not exceptional growth — like the 100% or more venture firms tend to favor — to exit, pay off investors, reward employees and still keep building the company.\n But not everyone that goes this route has a tidy outcome like Ping’s. Some companies get brought into the P/E universe where they replace the executive team, endure big layoffs or sell off profitable pieces and stop investing in the product. But the three private equity firms we spoke to — Vista Equity,  Thoma Bravo   and Scaleworks — all wanted to see their acquisitions succeed, even if they each go about it differently.", "posttime": "2020-10-17 02:31:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "equity", "title": "\n私募股权公司可以为初创企业提供可行的退出选择", "title_en": "\n\t\t\t\tPrivate equity firms can offer enterprise startups a viable exit option\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/16/private-equity-firms-can-offer-enterprise-startups-a-viable-exit-option/", "via": "", "real_tags": ["equity"]}, {"category": "", "categoryclass": "", "imagename": "cd377374e86c73346a33f0b2d7c9be3e.jpg", "infoid": 1029293, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司的前提很简单。允许粉丝竞标与他们最喜欢的TikTok名人分享屏幕时间，这一点吸引了该平台上拥有数百万粉丝的几位明星的注意。\n该公司创始人科尔·梅森(Cole Mason)表示，TikTok明星安娜·舒马特(Anna Shumate)的一篇帖子就吸引了3000名用户。舒马特是TikTok的明星，拥有650万粉丝，网名为“annabananaxdddd”。\nPearPop的平台通过让TikTok名人设定分享屏幕时间的价格来运作。他们可以接受投标，并预览要批准的内容，以确保内容与他们在平台上的角色一致。付款是通过条纹进行的，软件会对付款进行验证。一旦付费，这位名人就会发布共享屏幕视频。\n“我们是为有影响力的人建造的，”梅森说。“如果你是一个粉丝，想要访问你最喜欢的TikTok明星，那么他们可以通过PearPop访问他们，而不是试图联系经理并支付法律费用。”你可以简化这一点，而且非常容易做到这一点。“。\n梅森认为，公司可以在未来三个月内吸引10万用户，一旦达到这一里程碑，他将着手筹集一轮种子融资。据梅森称，该服务的Android和iOS版本预计将于11月推出。\n创立PearPop的旅程始于纽约市一间公寓的地板上。梅森是一位有抱负的模特和连续创业者，小时候挨家挨户卖自制的木制十字架，高中时毕业为游戏玩家卖手套，当他与福特模特签约时，梅森已经搬到了纽约。\n在曼哈顿东村圣马克斯广场(St.Marks Place)一位朋友公寓的地板上睡了一觉后，梅森试图获得模特演出机会，但作为模特公寓(年轻、漂亮的人可以免费住在那里，以换取在纽约附近的几家俱乐部露面)的推广人和经理，他获得了更大的成功。\n“我讨厌它，”梅森说。“我一直想涉足科技领域。”\n梅森从他的推广工作中拿到了现金，不久之后就把注意力转向了科技行业。作为一名在社交媒体上建立朋友网的苦苦挣扎的模特，他意识到平台的问题正在突围。\n他最初的解决方案是建立一个名为GramEnvy的平台，该平台试图找到一种增长方式来黑客攻击Instagram。\n“发展你自己Instagram的唯一方法就是让人们在你身边或关于你的帖子上发帖，并利用他们的大量追随者。”梅森说。这是一件说起来容易做起来难的事情，最终迫使GramEnvy关闭的算法改变使其变得更加困难。\n但梅森受到了创业错误的影响，并受到客串日益成功的启发，想出了另一种方式，让社交媒体平台上受欢迎的次要名人(他们的工作级别低于一线明星，拥有数千万粉丝)在各种平台上的表现货币化。\n虽然客串是名人将他们的追随者货币化的一种方式，但它并没有创造出潜在的社交媒体明星所期待的曝光率。这就是梅森认为他已经用PearPop解决的问题。\n其他企业家，如总部位于洛杉矶的童装和娱乐品牌CubCoats的董事长斯宾塞·马克尔(Spencer Markel)也这么认为。\n马克尔是由纽约的一位共同的朋友介绍给梅森的，自从梅森大约10个月前开始为该公司工作以来，马克尔一直担任该公司的顾问。对于马克尔来说，通过TikTok平台分享屏幕的潜力使PearPop成为名人们潜在的更有利可图的选择。\n马克尔说：“有很多不同的方式来解决市场上的一个缺口。”他认为，对于TikTok明星来说，这项服务应该是一个强大的货币化机会，他们发现自己比拥有数千万粉丝的高瓦数同行低了一个级别。", "note_en": "The company’s premise is simple. Allow fans to bid for shared screen time with their favorite  TikTok   celebrities, and it’s one that’s attracted the attention of a few of the platform’s stars with several million followers.\n The company was able to hook 3,000 users with one post from  Anna Shumate, a TikTok star with 6.5 million followers who goes by the handle of “annabananaxdddd,” according to the company’s founder, Cole Mason.\n  PearPop’s platform works by letting TikTok celebrities set a price for sharing screen time. They can accept bids and preview the content to approve to make sure it’s aligned with their persona on the platform. The payment is made through Stripe and the software verifies payment. Once paid, the celebrity posts the shared screen video.\n “We built it for the influencer,” said Mason. “If you’re a fan trying to access your favorite TikTok star, then they can access them through PearPop instead of trying to contact a manager and pay for legal fees. You can simplify that and do that super easily.”\n  Mason thinks the company can rack up 100,000 users over the next three months and will head out to raise a seed round once he reaches that milestone. An Android and iOS version of the service is expected to launch in November, according to Mason\n The journey to founding PearPop began on the floor of an apartment in New York City. Mason was an aspiring model and serial entrepreneur who sold homemade wooden crosses door-to-door as a child and graduated to selling gloves for gamers in high school, Mason had moved to New York when he was signed to Ford Models.\n After sleeping on the floor of a friend’s apartment on St. Marks Place in Manhattan’s East Village, Mason tried to land modeling gigs but found more success as a promoter and manager of model apartments (places where young, pretty people can stay for free in exchange for making appearances at a few clubs around New York).\n “ I hated it,” Mason said. “I always wanted to get into stuff in tech.”\n Mason took the cash from his promotion work and turned his attention to the tech industry soon after. As a struggling model who was building a network of friends in social media, he realized that the problem with the platform was breaking through.\n His initial solution was to build a platform called  GramEnvy, which tried to find a way to growth hack Instagram.\n “The only way to grow your own Instagram was to have people post with you or about you and leverage their huge following.” Mason said. It was something easier said than done, and it was made harder by algorithmic changes that ultimately forced GramEnvy to close.\n But Mason was bitten by the entrepreneurial bug, and was inspired by the growing success of  Cameo to come up with another way that would enable popular minor celebrities on social media platforms (who were working a tier below the A-listers with tens of millions of followers) to monetize their performance on various platforms.\n And while Cameo is a way for celebrities to monetize their following, it doesn’t create the exposure that would-be social media stars are looking for. That’s the problem that Mason thinks he’s solved with PearPop.\n Other entrepreneurs, like Spencer Markel, the chairman of the Los Angeles-based children’s clothing and entertainment brand, CubCoats, think so too.\n Markel was introduced to Mason by a mutual friend from New York and has come on as an adviser to the company since Mason began working on it roughly 10 months ago. For Markel, the potential to actually share screens via TikTok’s platform makes PearPop a potentially more lucrative option for celebrities.\n “ There’s a lot of different ways that this is going to address a gap in the market,” said Markel. He believes that the service should be a strong monetization opportunity for the TikTok stars who find themselves one level down from their higher-wattage peers with tens of millions of fans.", "posttime": "2020-10-17 02:30:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "tiktok,lets,梅森", "title": "\nPearPop让TikTok名人通过与粉丝分享大喊和屏幕来赚钱", "title_en": "\n\t\t\t\tPearPop lets TikTok celebrities monetize by sharing shoutouts and screentime with fans\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/16/pearpop-lets-tiktok-celebrities-monetize-by-sharing-shoutouts-and-screentime-with-fans/", "via": "", "real_tags": ["tiktok", "lets", "梅森"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029292, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转搜索皮亚马拉杜(也拼写为Piyama-Radu，Piyama Radu，Piyamaradus，Piyamaraduš)是一个好战的人物，他的名字出现在公元前13世纪中晚期位于西安纳托利亚的赫梯档案中。他的历史特别令人感兴趣，因为它似乎与特洛伊战争的历史交织在一起。一些学者认为他的名字与特洛伊国王普里阿摩斯同源。\n这个名字似乎是一个以Luwian piyama；Gift作为第一部分的院落。包含相同单词的其他卢维亚语名称会得到证明，例如Piyama-Kurunta。\n这个词的第二部分早些时候被认为是一个未知的名称*Radu，[1]，但由于卢维亚语的单词不是以r开头的，它必须是aradu，这可能是一个名词，意思是奉献者，派生于*arada-&#39；宗教社区(vel sim.)&#39；本身就是*ara-&#39；Associate&#39；的派生(参见。赫梯族人(Ara-&#39；id.&#39；)。[2]。\n皮亚马拉杜的叛变活动持续了至少35年，在此期间，他对三位赫梯国王：穆瓦塔利二世、哈图西里三世和图达利亚四世构成了相当大的威胁。\n大众猜测皮亚马拉杜是乌哈-齐提的合法继承人，乌哈-齐提是阿尔扎瓦的前任国王，被赫梯国王穆尔西里二世赶下台，很可能是他儿子皮亚山-库伦塔的儿子[4]，尽管这完全是猜测，他没有被称为王子。布莱斯和萨默斯更愿意把他描述为一个叛逆的赫梯权贵。[5]他对西安纳托利亚阿尔扎瓦、塞哈、拉兹帕(莱斯博斯)和威卢萨(特洛伊)等赫梯诸侯国的攻击和袭击活动被一些学者解读为试图重申他自己的王朝主张。他这么做很可能是与他向伟大的哈蒂国王[6]申请接受赫梯的附庸地位为次国王的申请同时进行的。\n当他的申请被否决时，他反抗了，希望维护他所谓的王朝权利。哈蒂的伟大国王通过另一个值得信任的附庸玛纳帕-塔伦塔的代理来镇压他。另一方面，皮亚马拉杜与伟大的阿希亚瓦国王(阿契亚，即希腊迈锡尼人)结盟，并将他的女儿嫁给了米拉安达(米利都)的附庸统治者阿特帕(ATPA)。\n因为他反对哈蒂大王，并与阿希亚瓦大王结盟，他在赫梯档案中的形象就是麻烦制造者、冒险家、自由人或雇佣兵。从他自己的角度来看，他可能认为自己仅仅是在维护自己的合法(世袭？)。(注：哈提大王是哈蒂大王，阿希亚瓦大王是阿希亚瓦大王)，因此他在赫梯档案中的形象是麻烦制造者、冒险家、自由主义者或雇佣兵，从他自己的角度来看，他可能认为自己仅仅是在维护自己的合法(世袭？)。状况。他在记录中突出的功绩，加上他的名字和主张，使王朝参数看起来是可信的，但仍然完全是推测的。\n皮亚马拉都被一些人猜测，与“伊利亚特”中史诗/传奇人物特洛伊的普里阿姆所体现的原型相对应。[7]史诗般的普里阿摩斯之子帕里斯/亚历山大与阿拉克桑杜相提并论，阿拉克桑杜是众所周知的曾与赫梯君主穆瓦塔利二世签订条约的威鲁桑国王，他的身份不那么具有投机性。[8]\n在许多现代资料中，皮亚马拉杜经常被指定为威卢萨的国王。[9][10]。\n马纳帕-塔洪塔信……臭名昭著的当地麻烦制造者皮亚马拉杜正在骚扰威卢西亚，这是阿苏瓦联邦与赫梯帝国松散结盟的一块土地。赫梯国王显然已经命令马纳帕-塔伦达亲自驱逐皮亚马拉杜，但马纳帕-塔伦达的尝试失败了，因此现在派出了一支赫梯部队来处理这个问题。\n米拉瓦塔的信和塔瓦加拉瓦的信和马纳帕-塔伦塔的信一样，米拉瓦塔的信提到了臭名昭著的冒险家皮亚玛-拉杜，但这是一个过去的人物。\n哈提王的信(哈图西里三世？)。献给另一位伟大的国王。包括提到Piyamaradu和Ahhiyawa国王，但文本太零散，无法解释。[11]。\n哈图西里三世的配偶和首席女祭司普杜赫帕的祈祷文。追溯到公元前13世纪中叶，普杜赫帕前往大海供奉祭品，以换取海神介入逮捕皮亚马拉杜。另一个神被呼吁，但提到的神的名字是支离破碎的。[12]。\n^Arzawa页在Wayback机器上存档于2004-02-02；参见神谕名称，并与希伯来语形式乔纳森(#34；耶和华礼)进行比较(&#34；Gift of Jehova&#34；)。\n加里·M·贝克曼(Gary M.Beckman)、特雷弗·R·布莱斯(Trevor R.Bryce)和埃里克·H·克莱恩(Eric H.Cline The Ahhijawa Text 2011)，亚特兰大，圣经文学学会，第251页。\n^F.斯塔克，#34；Troia im Kontext des HisTORisch-Poltischen and Sprachlichen Umfield des Kleinasiens im 2.Jahrtausend&#34；Studia Troica 7(1997)，第450-454页；J.D.Hawkins，&#34；Tarkasnawa King of Mira&#34；Tarkasnawa King of Mira&#34；，W.-D.Niemeier，“Westkleinasien und Augäis von den ANFängen bis zur Ionischen Wanderung”，in：Frühees Ionien，2007，第79页。\n哈里·A·霍夫纳(Harry A.Hoffner)和加里·M·贝克曼(Gary M.Beckman)，“来自赫梯王国的信函”，2009年，亚特兰大，圣经文学协会，第300页。\n“双城记”，“美国考古杂志”第93期(1989)，第532页。\n保险公司de la loyautéde l&#39；Incertaine Arzawa et du roi Piyamaradu。[1]。\n加里·M·贝克曼(Gary M.Beckman)、特雷弗·R·布莱斯(Trevor R.Bryce)和埃里克·H·克莱恩(Eric H.Cline)“阿希贾瓦文本2011”，亚特兰大，圣经文学协会，第168-171页。\n加里·M·贝克曼(Gary M.Beckman)、特雷弗·R·布莱斯(Trevor R.Bryce)和埃里克·H·克莱恩(Eric H.Cline)“阿希贾瓦文本2011”，亚特兰大，圣经文学协会，第248-252页。\n格尼，奥利弗，2002年。Tawagalais Letter的作者。&#34；席尔瓦·安纳托利察2002年卷，第133-141页。\n贝克曼，加里·M，布莱斯，特雷弗·R，克莱恩，埃里克·H·阿希贾瓦文本2011，亚特兰大，圣经文学学会。\n哈里·霍夫纳·霍夫纳和加里·M·贝克曼，“赫梯王国信函2009”，亚特兰大，圣经文学学会，", "note_en": "Jump to navigation  Jump to search  Piyamaradu (also spelled  Piyama-Radu,  Piyama Radu,  Piyamaradus,  Piyamaraduš) was a warlike personage whose name figures prominently in the  Hittite archives of the middle and late 13th century BC in western  Anatolia. His history is of particular interest because it appears to intertwine with that of the  Trojan War. Some scholars assume that his name is cognate to that of  King Priam of Troy.\n   The name appears to be a compound with  Luwian  piyama &#34;gift&#34; as its first part. Other Luwian names containing the same word are attested, such as  Piyama-Kurunta.\n The second part of the word was earlier believed to be an unknown  theonym * Radu,  [1] but since Luwian words do not start with an  r, it must be  aradu, which may be a noun meaning &#34;devotee&#34;, derived &#34;from * arada- &#39;religious community (vel sim.)&#39;, itself a derivative of * ara- &#39;associate&#39; (cf.  Hittite  ara- &#39;id.&#39;).  [2]\n  Piyamaradu&#39;s renegade activities are remarkable for their duration, having spanned at least 35 years,  [3] during which time he posed a considerable threat to three Hittite kings:  Muwatalli II,  Hattusili III, and  Tudhaliya IV.\n Popular conjecture proposes that Piyamaradu was the legitimate heir of  Uhha-Ziti, a previous king of  Arzawa who was dethroned by the Hittite king  Mursili II, and probably the son of his son  Piyama-Kurunta,  [4] although this is entirely speculative, and he is nowhere referred to as a prince. Bryce and Sommers prefer to describe him as a &#34;rebellious Hittite dignitary&#34;.  [5] His attacks and raiding activities on the Hittite vassal states in Western Anatolia of  Arzawa,  Seha, Lazpa ( Lesbos) and  Wilusa ( Troy) have been interpreted by some scholars as an attempt to reassert his own dynastic claim. This he probably did in concert with an application to the  Great King of  Hatti  [6] to be accepted into  Hittite vassal status as a sub-king.\n When his application was deprecated, he rebelled, wishing to assert his putative dynastic rights. The Great King of Hatti suppressed him through the agency of a certain other trusted vassal,  Manapa-Tarhunta. Piyamaradu, on the other hand, allied with the Great King of  Ahhiyawa ( Achaea, i.e.  Mycenean Greece), and married his daughter to  Atpa, the vassal ruler of Millawanda ( Miletus).\n Because he had asserted himself against the  Great King of  Hatti, and allied himself with the  Great King of  Ahhiyawa, his characterization in the Hittite archives is that of &#34;troublemaker&#34;, &#34;adventurer&#34;, &#34;freebooter&#34;, or &#34;mercenary&#34;; from his own point of view he may have considered himself merely to be asserting his own rightful (hereditary?) status. The salience of his exploits in the record, together with his name and claim, render dynastic parameters plausible, but still entirely speculative.\n  Piyamaradu has been conjectured by some, to correspond to the archetype embodied in the epic/legendary  Priam of  Troy in the  Iliad.  [7] The epic Priam&#39;s son  Paris/Alexandros, identified with  Alaksandu, a Wilusan king known to have made a treaty with the Hittite monarch  Muwatalli II, has a less speculative identification.  [8]\n Piyamaradu is often designated as a &#34;king&#34; of Wilusa in a number of modern sources.  [9]  [10]\n   Manapa-Tarhunta letter &#34;...a notorious local troublemaker called Piyamaradu is harrying Wilusiya, a land of the  Assuwa federation loosely allied with the Hittite Empire. The Hittite king has apparently ordered Manapa-Tarhunda to drive out Piyamaradu himself, but Manapa-Tarhunda&#39;s attempt has failed, so that a Hittite force is now sent out to deal with the problem.&#34;\n  Milawata letter &#34;Like the Tawagalawa letter and also the Manapa-Tarhunta letter, the Milawata letter mentions the infamous adventurer Piyama-Radu; but as a figure of the past.&#34;\n Letter from a King of Hatti (Hattusili III?) to another Great King. Includes a reference to Piyamaradu along with the King of  Ahhiyawa, but the text is too fragmentary for interpretation.  [11]\n Votive Prayer of  Puduhepa, consort of  Hattusili III and chief priestess. Dated to the mid-thirteenth century B.C.E.,  Puduhepa has traveled to the sea to make an offering in return for the sea god&#39;s intervention in apprehending Piyamaradu. One other god is appealed to, but the reference to the god&#39;s name is fragmentary.  [12]\n  ^   Arzawa Pages  Archived 2004-02-02 at the  Wayback Machine; see  Theophoric names, and compare to the Hebrew form  Jonathan (&#34;Gift of  Jehova&#34;).\n  ^  Gary M. Beckman, Trevor R. Bryce, and Eric H. Cline  The Ahhijawa Texts 2011, Atlanta, Society of Biblical Literature, p.251.\n ^  F. Starke, &#34;Troia im Kontext des historisch-politischen und sprachlichen Umfeldes Kleinasiens im 2. Jahrtausend&#34;,  Studia Troica 7 (1997), p. 450-454; J.D. Hawkins, &#34;Tarkasnawa King of Mira&#34;,  Anatolian Studies 48 (1998), p. 17; W.-D. Niemeier, ”Westkleinasien und Ägäis von den Anfängen bis zur Ionischen Wanderung”, in:  Frühes Ionien, 2007, p. 79.\n ^  Harry A. Hoffner and Gary M. Beckman,  Letters from the Hittite Kingdom 2009, Atlanta, Society of Biblical Literature, p. 300.\n  ^  S.P. Morris, &#34;A Tale of Two Cities&#34;,  American Journal of Archaeology 93 (1989), p. 532.\n  ^  &#34;Une rapide campagne est nécessaire pour s&#39;assurer de la loyauté de l&#39;incertaine Arzawa et du roi Piyamaradu.&#34; [1]\n  ^  Gary M. Beckman, Trevor R. Bryce, and Eric H. Cline  The Ahhijawa Texts 2011, Atlanta, Society of Biblical Literature, pp.168-171.\n ^  Gary M. Beckman, Trevor R. Bryce, and Eric H. Cline  The Ahhijawa Texts 2011, Atlanta, Society of Biblical Literature, pp.248-252.\n   Gurney, Oliver 2002. &#34;The authorship of the Tawagalawas Letter.&#34;  Silva Anatolica Vol. 2002, pp. 133–141.\n Beckman, Gary M., Bryce, Trevor R., Cline, Eric H.  The Ahhijawa Texts 2011, Atlanta, Society of Biblical Literature.\n Hoffner, Harry A., and Beckman, Gary M.,  Letters from the Hittite Kingdom 2009, Atlanta, Society of Biblical Literature,", "posttime": "2020-10-17 02:26:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "亚马,piyama,赫梯", "title": "皮亚马-拉杜(Piyama-Radu)", "title_en": "Piyama-Radu", "transed": 1, "url": "https://en.wikipedia.org/wiki/Piyama-Radu", "via": "", "real_tags": ["亚马", "piyama", "赫梯"]}, {"category": "", "categoryclass": "", "imagename": "cdc56ec6813c1a5969264a4028df77cd.jpg", "infoid": 1029291, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Tl；dr和一些背景情况：uBlock Origin开发人员Gorhill对此进行了研究。它似乎在每个网络连接上发送信息，目的不明。甚至没有人真正知道这些开发人员是谁。他建议删除扩展，因为它现在可以被认为是恶意软件。\n看起来Firefox派生维护器将不再更新派生：Issuecomment-707445124 https://github.com/LiCybora/NanoDefenderFirefox/issues/187#issue-718878286。\n作为一个平台，1级火狐没有受到影响，因为Nano扩展一直是由第三方维护的，一位名叫LiCybora的人也对该操作相关的问题发表了评论。\n也就是说，由于这次可疑的销售，LiCybora已经停止了他们在Firefox端口上的工作，所以也没有理由继续使用它。\n无论你认为我的建议有什么价值，我都建议改用uBlock Origin。内容拦截器缺乏信任-因为市场上有太多的坏苹果-戈尔希尔是我唯一能指名道姓的人，他一直表明，他的工作只是为了提高用户隐私和安全。\n第二级他也总是愿意在reddit和gihub上进行讨论，尽管在uBlock gihub页面上有大量与过滤列表无关的问题。戈尔希尔是个好人。\n高山受到这么多人的高度评价也就不足为奇了。将多年的无偿辛勤工作倾注到软件中，让每个人都可以免费使用，并仍然有道德罗盘拒绝巨额资金，不出卖用户的开发人员数量少得惊人。\n级别2，这是一个例子，有多少开发人员通过交易他们的Chrome附加组件或一点现金来出卖他们的用户群？绝对不是第一次了\n级别1，Firefox扩展的维护者(谢天谢地)不会成为现在Chrome版扩展的恶意计划的一部分。\n我援引戈尔希尔的评论报道了针对恶意软件的Chrome扩展。诚然，我对这里发生的事情感到非常不安。JSPenguin完全将他的用户直接卖给了恶意软件，以快速获利。\n级别2脑海中浮现的包括Waterfox、CCleaner、MalwareBytes等……。一旦有大笔钱进来，所有的人都变成了狗屎。\n我从来不相信纳诺。戈尔希尔已经有了一件好事。为什么要用那些废话把事情搞得更复杂呢。现在，Nano&#39；的狗屎击中了风扇，现在已经公开了。我并不感到非常惊讶。\n级别2我在今天早些时候卸载NanDefender时也做了同样的事情。得到的报道越多，它就会越早从商店下架。\n第一级，谢谢您的提醒！那么，有没有其他方法可以使uBlock Origin不被检测到？\n级别2是的，通过报告反广告阻止检测，因此可以添加修复程序，就像Nano QuickReporter所做的那样。\n级别2如果您还没有，请转到uBlock Origin Preferences-&gt；过滤器列表选项卡-&gt；选中烦恼复选框，然后单击更新过滤器列表/顶部的橙黄色刷新按钮\n在火狐上，Nano Defender的级别2已经独立，并将很快更名。它是由LiCybora维护的，他既不隶属于jspenguin，也不隶属于新的可疑开发者，他和我们一样愤怒。\n火狐的一级Nano Defender已经脱离Nano Defender，并将由叉子守护者LiCybora独立于上游进行维护，并且没有恶意软件。她计划很快重新命名这个扩展名。\n级别2感谢您的链接。我使用Defender来提供额外的保护；很高兴知道Firefox端口将继续运行。\n2级，但如果您同时使用NanDefender和uBlock Origin，您必须订阅Adblock警告删除列表、Nano Defender集成过滤器列表和Nano广告阻止程序资源列表。那么，我认为过滤器列表和资源列表可以由新的开发人员更新，这样安全吗？\n第一级，虽然我对这样的发展感到难过。如果不是来自LiCybora，我想我是不会升级Firefox的。我将只考虑类似于uMatrix休眠状态的扩展。\n各方分叉开放源码软件，然后，当他们从这些软件中获利的时候就会到来，从其他人的长期而艰苦的工作中获利。\n甚至没有宣布计划中的出售，只是在它已经被出售和收购之后，甚至让项目的亲密人士都感到惊讶。", "note_en": "tl;dr with a bit of context: The uBlock Origin developer, gorhill, looked into it. It seems to send information on every network connect, purpose is unknown. Nobody even knows really who those developers are. He suggests removing the extension as it can be considered malware now\n Looks like the Firefox fork maintainer will no longer update the fork anymore:   issuecomment-707445124  https://github.com/LiCybora/NanoDefenderFirefox/issues/187#issue-718878286\n    level 1  Firefox as a platform is not affected, because the Nano extensions have always been maintained by a third party, a person called LiCybora who also commented on the issue the OP linked.\n That said, because LiCybora has stopped their work on the Firefox port as a consequence of this shady sale, there&#39;s no reason to keep using it either.\n Whatever you think my advice is worth, I suggest switching to uBlock Origin. Content blockers have a trust deficit - because there are so many bad apples out there - and gorhill is the only person I could name who has consistently shown that his work is only intended to advance user privacy and security.\n level 2  He&#39;s also always willing to engage in discussion on reddit and github, despite the enormous amount of irrelevant issues relating to filter lists on the uBlock github page. Gorhill is a good egg.\n level 2  There&#39;s no surprise why gorhill is held in such high regard by so many people. The number of developers who have poured years of unpaid, hard work into software for everyone to freely use and still have the moral compass to reject huge sums of money and not sell out their users is astonishingly small.\n  level 2  And this is example how many of some dev selling out their userbase by trading away their Chrome add-on or a bit of cash? Definitely not the first time\n    level 1  The maintainer of the Firefox extension is (thankfully) not going to become part of the malicious scheme now going on with the Chrome version of the extension.\n I reported the Chrome extension for malware, citing gorhill&#39;s comment. Admittedly, I am very upset at what has transpired here. JSPenguin completely sold his users straight into malware for a quick buck.\n level 2  Those that come to mind include Waterfox, CCleaner, Malwarebytes, etc... all have turned to shit once the big bucks come in.\n I never trusted Nano. Gorhill already had a good thing going. Why complicate it even more with that bullshit. And now Nano&#39;s shit has hit the fan and is now public. I&#39;m not terribly surprised.\n  level 2  I did the same when I uninstalled nanodefender earlier today. The more reports this gets the sooner it&#39;ll be yanked from the store.\n level 1  Thanks for the heads up! So are there any alternatives to make uBlock Origin undetected?\n level 2  Yes, by reporting anti-adblock detections, so fixes can be added, just like how Nano QuickReporter was doing.\n  level 2  If you haven&#39;t already, go to the Ublock Origin preferences -&gt; Filter Lists tab -&gt; check the &#34;Annoyances&#34; checkboxes, and click Update Filter Lists/the yellow-orange refresh button at the top\n  level 2  On Firefox, Nano Defender  has become independent and  will change names shortly. It is maintained by LiCybora, who has no affiliation either to jspenguin or to the new shady developers and who is as indignant as we all are.\n  level 1  Nano Defender for Firefox has detached itself from Nano Defender and will be maintained independently from upstream and free of malware by the fork keeper, LiCybora. She plans to  rename the extension shortly.\n level 2  Thanks for linking. I was using Defender for the extra protection part; good to know the Firefox port will continue.\n level 2  But if you are using nano defender along with ublock origin you have to subscribe to Adblock Warning Removal List, Nano defender integration filter list and Nano adblocker resources list. So is it safe as I think the filter list and resources list can be updated by the new developers?\n  level 1  Though I&#39;m saddened with such development. Guess I won&#39;t upgrade the Firefox counterpart if not coming from LiCybora. I&#39;ll just consider the extension similar to uMatrix&#39; dormant state.\n Parties fork open source software then a time comes when they profit from it, from other people&#39;s long and hard work.\n Didn&#39;t even announce the planned sale, only after it was already sold,  acquired, to the surprise even of the close people of the project.", "posttime": "2020-10-17 02:26:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,nanodefender,licybora", "title": "NanoAdbloker/NanoDefender现在是恶意软件", "title_en": "NanoAdblocker / NanoDefender is malware now", "transed": 1, "url": "https://www.reddit.com/r/firefox/comments/jbua53/nanoadblocker_nanodefender_is_malware_now/", "via": "", "real_tags": ["软件", "licybora"]}, {"category": "", "categoryclass": "", "imagename": "becf4061a9e688485f2ceee28486be6d.jpeg", "infoid": 1029290, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "东京(路透社)-媒体周五报道称，在福岛核灾难发生近十年后，日本政府决定向大海排放超过100万吨受污染的水，预计本月晚些时候将正式宣布。\n这一决定预计会激怒韩国等邻国，韩国已经加强了对来自日本的食品的辐射检测，并进一步摧毁了福岛的渔业，该行业多年来一直在与这样的举动作斗争。\n福岛第一核电站(Fukushima Daiichi)受污染的水的处理一直是日本面临的一个长期问题，因为日本正在进行一个长达数十年的退役项目。近120万吨受污染的水目前储存在该设施的巨大水箱中。\n该核电站由东京电力公司控股公司9501.T运营，在2011年的地震和海啸后遭受了多起核熔毁。\n周五，日本产业大臣鹿山博史(Hiroshi Kajiyama)表示，目前还没有就水的处置做出决定，但政府的目标是尽快做出决定。\n“为了防止退役过程中出现任何延误，我们需要迅速做出决定，”他在新闻发布会上表示。\n朝日新闻报道说，任何这样的释放预计都需要大约两年的准备时间，因为现场的辐射水首先需要经过过滤过程，然后才能用海水进一步稀释，最后释放到海洋中。\n2018年，东京电力公司(Tokyo Electric)在承认其过滤系统没有去除水中的所有危险物质后道歉，这些水是从冷却管道收集的，这些冷却管道是在核电站瘫痪时用来防止燃料芯融化的。\n该公司曾表示，计划从水中去除除氚以外的所有放射性颗粒。氚是一种氢的同位素，很难分离，被认为是相对无害的。\n向海洋中排放含有微量氚的水是世界各地核电站的普遍做法。\n今年4月，国际原子能机构(International IAEA Agency)派出的一个小组审查福岛核电站的受污染水问题，该小组表示，日本一个顾问委员会概述的水处理选项-蒸汽释放和排放到海洋-在技术上都是可行的。国际原子能机构表示，运营核电站都使用了这两种选择。\n上周，日本渔业代表敦促政府不要允许从福岛核电站向大海排放受污染的水，称这将使他们多年来为恢复声誉所做的努力化为乌有。\n韩国保留了核灾难后实施的禁止从福岛地区进口海鲜的禁令，并于去年召见了一名日本大使馆高级官员，解释东京计划如何处理福岛供水问题。\n在2013年东京申办奥运会期间，时任首相安倍晋三向国际奥委会成员表示，福岛核设施已“得到控制”。\n由于大流行，奥运会被推迟到2021年，一些赛事将在距离受损核电站60公里(35英里)的地方举行。", "note_en": "TOKYO (Reuters) - Nearly a decade after the Fukushima nuclear disaster, Japan’s government has decided to release over one million tonnes of contaminated water into the sea, media reports said on Friday, with a formal announcement expected to be made later this month.\n  The decision is expected to rankle neighbouring countries like South Korea, which has already stepped up radiation tests of food from Japan, and further devastate the fishing industry in Fukushima that has battled against such a move for years.\n The disposal of contaminated water at the Fukushima Daiichi plant has been a longstanding problem for Japan as it proceeds with an decades-long decommissioning project. Nearly 1.2 million tonnes of contaminated water are currently stored in huge tanks at the facility.\n The plant, run by Tokyo Electric Power Company Holdings Inc   9501.T , suffered multiple nuclear meltdowns after a 2011 earthquake and tsunami.\n  On Friday, Japan’s industry minister Hiroshi Kajiyama said no decision had been made on the disposal of the water yet, but the government aims to make one quickly.\n “To prevent any delays in the decommissioning process, we need to make a decision quickly,” he told a news conference.\n   The Asahi newspaper reported that any such release is expected to take at around two years to prepare, as the site’s irradiated water first needs to pass through a filtration process before it can be further diluted with seawater and finally released into the ocean.\n In 2018, Tokyo Electric apologised after admitting its filtration systems had not removed all dangerous material from the water, collected from the cooling pipes used to keep fuel cores from melting when the plant was crippled.\n It has said it plans to remove all radioactive particles from the water except tritium, an isotope of hydrogen that is hard to separate and is considered to be relatively harmless.\n  It is common practice for nuclear plants around the world to release water that contain traces of tritium into the ocean.\n In April, a team sent by the International Atomic Energy Agency to review contaminated water issues at the Fukushima site said the options for water disposal outlined by an advisory committee in Japan - vapour release and discharges to the sea – were both technically feasible. The IAEA said both options were used by operating nuclear plants.\n Last week, Japanese fish industry representatives urged the government to not allow the release of contaminated water from the Fukushima plant into the sea, saying it would undo years of work to restore their reputation.\n  South Korea has retained a ban on imports of seafood from the Fukushima region that was imposed after the nuclear disaster and summoned a senior Japanese embassy official last year to explain how Tokyo planned to deal with the Fukushima water problem.\n During Tokyo’s bid to host the Olympic Games in 2013, then-prime minister Shinzo Abe told members of the International Olympic Committee that the Fukushima facility was “under control”.\n The Games have been delayed to 2021 because of the pandemic and some events are due to be held as close as 60 km (35 miles) from the wrecked plant.", "posttime": "2020-10-17 02:26:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "日本,福岛,release", "title": "日本将把福岛受污染的水排放到大海：报道", "title_en": "Japan to release Fukushima's contaminated water into sea: reports", "transed": 1, "url": "https://uk.reuters.com/article/uk-japan-disaster-water/japan-has-decided-to-release-fukushima-contaminated-water-into-sea-reports-idUKKBN27036W", "via": "", "real_tags": ["日本", "福岛", "release"]}, {"category": "", "categoryclass": "", "imagename": "fe4996a9210e3709a23bb1471f37a809.jpg", "infoid": 1029288, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这两个人，就像模拟的设备被称为，是以TurboGrafx-16的较新版本命名的，其中包括昂贵的CD-ROM插件-实际上，新的二人组同时支持游戏卡和CD，前提是它们一直存活下来，没有被划伤。\n和其他类似的游戏机一样，与任天堂流行的SNES和NES经典版不同(实际上还有新的TurboGrafx-16 Mini)，这两款游戏机没有以任何方式使用仿真。取而代之的是，它是对原有硬件的艰苦重塑，并对其进行了微调，引入了现代便利功能，如高清视频、无线控制器，以及可靠性等方面的改进。\n作为一个额外的好处，这一切都是在FPGA中完成的，这意味着这种硬件确实是一种准确地改造控制台的服务。游戏应该完全像它们在原始硬件上一样玩，直到那个游戏机时代令人恼火的故障和速度变慢。\n还有什么游戏！实际上，他们中很少有人在美国的任天堂和世嘉游戏机上达到竞争对手的地位，而TurboGrafx-16在美国的销量很差。但是像“邦克历险记”、“炸弹人93”、“忍者精神”、“飞溅屋”和“魔鬼暗恋”这样的游戏应该玩得更多。像我这样的垫子迷被原装和街机端口所宠爱，比如R-Type和Blaze Lazer。Ys系列(也是从PC引擎开始的(如果你买得起CD附件的话)。这是一个很好的回顾展。\nAnalogue的游戏机是为收藏家设计的，他们不想让自己的原始硬件变得幼稚，或者想要升级信号和无线播放，而不想太大惊小怪。我还保留着我原来的SNES，但240p看起来不像90年代用15英寸CRT时那么清爽了。\n199美元的售价比在车库大甩卖中买到的要贵，不过祝你好运。原版和CD附件都花了一大笔钱，所以如果你从这个角度来考虑，这真的很划算。Analogue表示，目前供应数量有限，将于2021年发货。", "note_en": "The Duo, as Analogue’s device is called, is named after a later version of the TurboGrafx-16 that included its expensive CD-ROM add-on — and indeed the new Duo supports both game cards and CDs, provided they have survived all this time without getting scratched.\n Like the rest of Analogue’s consoles, and unlike the popular SNES and NES Classic Editions from Nintendo (and indeed the new TurboGrafx-16 Mini), the Duo does not use emulation in any way. Instead, it’s a painstaking recreation of the original hardware, with tweaks to introduce modern conveniences like high-definition video, wireless controllers, and improvements to reliability and so on.\n  As a bonus, it’s all done in FPGA, which implies that this hardware is truly one of a kind in service of remaking the console accurately. Games should play exactly as they would have on the original hardware down to the annoying glitches and slowdowns of that era of consoles.\n And what games! Well, actually, few of them ever reached the status of their competitors on Nintendo and Sega consoles here in the U.S., where the TurboGrafx-16 sold poorly. But titles like Bonk’s Adventure, Bomberman ’93, Ninja Spirit, Splatterhouse, and Devil’s Crush should be played more widely. Shmup fans like myself were spoiled with originals and arcade ports like R-Type and Blazing Lazers. The Ys series ( also got its start on the PC Engine (if you could afford the CD attachment).  Here’s a good retrospective.\n  Analogue’s consoles are made for collectors who would prefer not to have to baby their original hardware, or want to upscale the signal and play wirelessly without too much fuss. I still have my original SNES, but 240p just doesn’t look as crisp as it did on a 15-inch CRT in the ’90s.\n At $199, it’s more expensive than finding one at a garage sale, but good luck with that. The original and its CD add-on cost a fortune, so if you think about it from that perspective, this is a real bargain. Analogue says limited quantities are available, and will be shipping in 2021.", "posttime": "2020-10-17 02:08:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "复古,takes,游戏机", "title": "\n模拟与TurboGrafx-16的双复古控制台", "title_en": "\n\t\t\t\tAnalogue takes on the TurboGrafx-16 with its Duo retro console\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/16/analogue-takes-on-the-turbografx-16-with-its-duo-retro-console/", "via": "", "real_tags": ["复古", "takes", "游戏机"]}, {"category": "", "categoryclass": "", "imagename": "2e853217c940e448a8c33d93933e6add.jpg", "infoid": 1029287, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "信息专员办公室(ICO)对英国航空公司(British Airways)处以2000万英镑(约合2600万美元)的罚款，原因是一起数据泄露事件影响了40多万名客户。\n这笔罚款比ICO最初表示打算在2019年开出的1.83亿GB要小得多。\n这起事件发生时，英航的系统被攻击者攻破，然后在输入客户详细信息时进行修改，以获取他们的详细信息。\n两个月后，一名安全研究人员让英国航空公司知道了这一点，然后通知了ICO。\n被盗资料包括登入资料、支付卡及旅游预订资料，以及姓名和地址资料。\n随后的调查得出结论，当时没有采取足够的安全措施，如多因素身份验证。\nICO指出，其中一些措施可以在英航当时使用的微软操作系统上使用。\n当组织机构围绕人们的个人数据做出糟糕的决定时，这可能会对人们的生活产生真正的影响。信息专员伊丽莎白·德曼(Elizabeth Denman)说，法律现在给了我们鼓励企业对数据做出更好决定的工具，包括投资于最新的安全措施。\n英国航空公司(British Airways)表示，一旦发现其系统受到攻击，就立即通知了客户。\n一位发言人表示：我们很高兴ICO认识到，自袭击发生以来，我们已经对 的系统安全做出了相当大的改善，我们完全配合了ICO的调查。\n数据保护官员卡尔·戈特利布(Carl Gottlieb)表示，在目前的气候下，2000万GB是一个很大的数字。\n这表明ICO是认真的，没有让苦苦挣扎的公司因数据保护失败而逍遥法外，他说。\n英航花了两年多的时间才直面这起极其严重的事件的后果。\n该公司违反了数据保护法，未能保护自己免受可预防的网络攻击。然后，它未能检测到黑客攻击，直到对数十万客户造成了损害。\n事件和罚款之间的滞后已经引起了隐私圈的关注，但我了解到信息专员办公室一直在有条不紊地工作，以求做到这一点。这是这位专员根据欧盟数据法规GDPR支付的第一笔巨额罚款，受到欧洲其他国家的密切关注，认为这可能是一项里程碑式的决定。\n2000万GB的最终数字让许多人感到震惊，他们原本预计它会更接近最初提出的令人眼花缭乱的183M，但对于数据隐私和GDPR来说，这仍然是一个重要的时刻。如果其他公司也未能保护客户，他们将把罚款视为未来的一种形式。", "note_en": "British Airways has been fined £20m ($26m) by the Information Commissioner&#39;s Office (ICO) for a data breach which affected more than 400,000 customers.\n  The fine is considerably smaller than the £183m that the ICO originally said it intended to issue back in 2019.\n   The incident took place when BA&#39;s systems were compromised by its attackers, and then modified to harvest customers&#39; details as they were input.\n It was two months before BA was made aware of it by a security researcher, and then notified the ICO.\n  The data stolen included log in, payment card and travel booking details as well name and address information.\n A subsequent investigation concluded that sufficient security measures, such as multi-factor authentication, were not in place at the time.\n The ICO noted that some of these measures were available on the Microsoft operating system that BA was using at the time.\n &#34;When organisations take poor decisions around people&#39;s personal data, that can have a real impact on people&#39;s lives. The law now gives us the tools to encourage businesses to make better decisions about data, including investing in up-to-date security,&#34; said Information Commissioner Elizabeth Denman.\n British Airways said it had alerted customers as soon as it had found out about the attack on its systems.\n &#34;We are pleased the ICO recognises that we have made considerable improvements to the security of our systems since the attack and that we fully co-operated with its investigation,&#34; said a spokesman.\n Data protection officer Carl Gottlieb said that in the current climate, £20m was a &#34;massive&#34; fine.\n &#34;It shows the ICO means business and is not letting struggling companies off the hook for their data protection failures,&#34; he said.\n   It&#39;s taken more than two years for BA to face the music over this extremely serious incident.\n The company breached data protection law and failed to protect themselves from preventable cyber attack. It then failed to detect the hack until the damage was done to hundreds of thousands of customers.\n The lag between incident and fine has raised eyebrows in privacy circles but I understand the Information Commissioner&#39;s Office has been working methodically to get it right. This is the commissioner&#39;s first major fine under the EU data regulation GDPR and was being watched closely by the rest of Europe as a potential landmark decision.\n The final figure of £20m has come as a shock to many who were expecting it to be closer to the eye-watering £183m initially proposed but it is still a significant moment for data privacy and GDPR. Other companies will look at the fine as a shape of things to come if they also fail to protect customers.", "posttime": "2020-10-17 02:08:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "数据,airways,ico", "title": "英国航空公司因数据泄露被罚款2600万美元", "title_en": "British Airways Fined $26 Million Over Data Breach", "transed": 1, "url": "https://www.bbc.com/news/technology-54568784", "via": "", "real_tags": ["数据", "airways", "ico"]}, {"category": "", "categoryclass": "", "imagename": "855d3a9cfe360303de2176141ce85450.jpg", "infoid": 1029286, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果今年宣布的最有趣的Apple Watch产品不是新的旗舰产品Series6或新的低成本Watch SE。它不是WatchOS7，它有几个新的手表表盘，可以跟踪你的睡眠，或者检测你何时洗手来斥责你，如果你没有完成整个20秒的洗手。\n最有趣的是苹果新的家庭设置服务，它允许父母为他们的孩子提供Apple Watch来使用。他们可以选择他们的孩子可以访问哪些应用程序和服务，可以向谁打电话或发送消息，以及通过GPS跟踪他们的位置。即使你不是父母，新的家庭设置服务也很有趣，因为它让我们了解了什么是真正独立的Apple Watch。\n在过去的几周里，我把Apple Watch SE绑在我8岁的孩子身上，看看新的家庭设置服务在现实世界中会是什么样子(或者至少是在大流行封锁期间能获得的最真实的体验)。这是我了解到的情况。\n考虑家庭设置的最简单方式是苹果对过去几年运营商销售的儿童GPS跟踪智能手表的看法。家长们喜欢这些设备，因为它们能够在任何给定的时间看到孩子的位置，并通过短信或电话与他们联系。除此之外，基本款手表可能会追踪一些简单的健康指标并报时，但它们远远不是成熟的智能手表。他们的设计通常是胖乎乎的，对孩子们很友好，他们的用户界面通过大按钮和五颜六色的图形得到了简化。智能手机上的家长管理应用程序也同样基础，使用起来不是特别舒服。还可能存在数据隐私问题，因为有时制造这些手表的公司没有苹果那么安全，或者数据政策比苹果更差。\n家庭设置略有不同。它不是专为儿童设计的专用设备，而是一种模式，可以在支持手机功能的Apple Watch上启用。你需要一部iPhone来配置它，但除此之外，这款手表并不与任何特定的设备配对，不像标准系统要求你将Apple Watch与iPhone链接起来。\n家庭设置Apple Watch拥有您或我可能购买和使用的Apple Watch的大部分功能。它拥有所有相同的手表面板，包括深度定制；附带许多相同的预装应用程序；可以使用苹果的iMessage、Music、Siri等服务；甚至可以安装手表本身的应用程序商店(App Store)中的应用程序。\n当你把一块家庭设置的Apple Watch递给你的孩子时，你就是给了他们一块功能齐全的智能手表。\n这意味着当你把一款家庭设置Apple Watch递给你的孩子时，你就是在递给他们一块功能齐全、责任齐全的智能手表。它并不比其他任何一款Apple Watch更耐用，它需要每天充电，而且它的功能可以是开放的，也可以是有限的，这取决于你的决定。界面与WatchOS7没有什么不同，这意味着当你按下表冠时，仍然会看到繁琐的应用程序图标，TAP元素相当小，还有大量的文本需要阅读。根据你孩子的年龄不同，这个界面既可以很好使用，也可以很难使用-至少，我建议将应用程序启动程序切换到列表视图，以便更容易访问。\n它也和其他任何一款苹果手表一样贵。要使用家庭设置，您需要有一款带蜂窝连接的手表，然后通过您的运营商注册服务计划，费用约为每月10美元。搭载LTE的Apple Watch SE是苹果销售的价格最低、兼容的新机型，起价329美元。你可以将Family Setup与Series 4一样古老的产品一起使用，但由于绝大多数人都不会购买手机版的Apple Watch，所以你不太可能有一款可以传给孩子或在二手市场上买到很多东西的产品。\n这个价格是你能买到的基本GPS跟踪手表的两到三倍，而且不可否认，花在一个你要绑在孩子手腕上的小玩意儿上的钱是很大的。正如我在评论Apple Watch SE时了解到的那样，弄坏一块Apple Watch并不需要太多费用，而且修理它也不便宜。你可以像其他任何苹果设备一样将AppleCare添加到手表中，以提供一些破损保险，但这需要更多的前期支出。\n对于许多家长来说，最重要的功能可能是GPS跟踪功能，该功能巧妙地集成到苹果现有的Find My应用程序中。你可以看到你的孩子在哪里，设置他们何时到达或离开特定位置的通知，甚至可以在他们在特定时间没有到达预期位置时收到警报。\n在我们目前正处于与流行病相关的封锁期间，测试这一功能一直是具有挑战性的，因为我的孩子很少离开我们的家，当他们离开时，我通常会和他们在一起。我可以收到他们到达学校的提醒，我可以检查Find My应用程序来确认他们确实在应该在学校的时候到了学校。但由于现在没有课外活动，也没有朋友家的游戏约会，这一功能的实用性有限。\n在系列设置下工作的功能列表比不能工作的功能列表要长得多。\n带有家庭设置的Apple Watch上可以使用的功能列表远远超过了不支持的功能，包括播客、遥控器、Apple News、主页和快捷方式。信息、电话、对讲机、手表、定时器、闹钟、秒表、提醒、日历、呼吸、地图、天气和语音备忘录在家庭设置中功能齐全。你的孩子可以向Siri索要天气报告、设置定时器、发送消息，以及执行除控制智能家居设备之外的大多数其他任务。\n一项独特的家庭设置功能是新的学校时间模式，这是一种极端的停机时间功能，有效地锁定了手表除报时之外的所有功能。启用学校时间后，将显示特殊的校车黄色表盘，仅显示时间和日期。苹果公司表示，这样做的目的是为了让老师们很容易看到手表是否被锁在远处。\n家长可以根据孩子的学校时间表规划启用和禁用学校时间的时间。由于学校时间锁定了一切，包括发送消息或接收通知的能力，如果孩子需要使用手表做什么，他们可以解锁。每次解锁都会在父母的Apple Watch应用程序中报告。\nApple Watch还将跟踪您孩子的健身活动，尽管这里有一些限制。高和低心率通知仅限于13岁及以上，跌倒检测仅适用于18岁以上的人，而不规则心律通知、心电图、周期跟踪、睡眠跟踪和血氧感知在家庭设置下根本不可用。这些限制使得Family Setup不太适合老年人护理用途，在这种情况下，您可能想要监测心律不齐或跌倒等情况，并有能力抽查EKG读数。\n如果苹果手表的佩戴者年龄在13岁以下，Activity应用程序将跟踪他们移动的分钟数，而不是像成年人那样跟踪活动卡路里。这是为了防止孩子们专注于卡路里消耗，但我认为，如果苹果从计算卡路里消耗的句号过渡到不再计算卡路里消耗，这对每个人都是有利的。锻炼跟踪仍然可用，因此孩子可以跟踪跑步和其他活动。我的孩子特别喜欢用自行车追踪功能测量骑车的距离，不出所料，他喜欢在一天结束前合上戒指，这是许多苹果手表佩戴者都熟悉的感觉。\n最后，Apple Watch上的家庭设置也支持Apple Cash，因此佩戴者可以在接受Apple Pay的地方使用Apple Cash购买商品。家长可以在手机上设置苹果现金卡，然后将其连接到孩子的手表上。可以通过向手表发送短信来添加资金，孩子点击短信就可以添加到他们的卡中。父母还可以在消费或从卡上汇款时收到通知，限制孩子可以向谁汇款，在iPhone上的钱包应用程序中查看交易记录，并在手表上远程锁定使用苹果现金卡的能力。\n在Apple Watch上设置家庭设置与为您自己设置Apple Watch没有什么不同。主要的区别在于，在这个过程中，你需要为你的孩子创建一个苹果ID，iPhone上的Watch应用程序会引导你完成这一过程。该设置还将引导您完成App Store购买审批、设置必要的蜂窝连接并通过运营商订阅计划、设置健身跟踪目标、打开消息等操作。\n系统还会提示您设置哪些联系人将显示在Watch上，以及允许您的孩子使用Watch与哪些人通信。这是重要的一步。当我最初为我的孩子设置手表时，我没有正确设置就轻而易举地完成了这项工作，不到一天的时间，垃圾短信和电话就开始出现在他们的手表上。\n由于设置手机连接需要将实际的电话号码附加到手表上，因此您的孩子可以访问该电话号码所在的任何数据库。限制他们可以联系的人，更重要的是，限制谁可以联系他们，以防止垃圾邮件发送者和随机人员向他们发送消息或打电话给Watch。来自未经批准的联系人发送给Watch的消息仍将显示在Messages应用程序中，尽管您无法阅读其内容。我希望苹果能完全屏蔽它们，这样我的孩子就不必定期删除它们了。\n除了最初的设置之外，父母这边的情况变得有点不确定。与你可能想象的那样，家庭设置中的一些功能是在手表应用程序中管理的，其他功能是在屏幕时间设置页面中管理的，而其他功能仍然是通过苹果健康应用程序访问的，而不是像你想象的那样，所有事情都是通过Apple Watch应用程序完成的。追踪孩子的位置和设置位置提醒是通过Find My应用程序完成的，这是一个与前面提到的三个应用程序完全不同的应用程序。这让人困惑，也很难记住什么背景在哪里；所有这些的统一位置会让它变得容易得多。\n屏幕时间设置是最重要的。一旦您设置好手表并将您的孩子添加到您的家庭中，您就可以在iPhone上的设置应用程序的屏幕时间部分访问您孩子的屏幕时间页面。从那里，你可以启用停机时间安排，打开正常和停机时间的通信限制，管理允许在Watch上使用的应用程序，以及控制内容和隐私功能。这允许您启用或禁用App Store和iTunes购买，限制显性内容，并进一步控制您的孩子可以通过游戏中心等功能与谁互动。这是相当全面的，尽管它确实需要相当多的时间来浏览所有的选项，了解它们做了什么，以及它们将如何影响您孩子的体验。\n在我的测试过程中，我遇到了一个错误，我根本无法打开内容和隐私限制。解决方案并不明显--我不得不注销iPhone上的iCloud，然后重新登录，这就解决了问题。\n你iPhone上的Apple Watch应用程序中唯一管理的功能是学校时间时间表，在那里你可以为它编制时间表，并看到你的孩子绕过锁的次数的报告。\n在过去的几周里，我们一直在测试“家庭设置”(Family Setup)，我的孩子大部分时间都在使用Memoji手表，并定制了一些他们自己和他们的兄弟姐妹的Memoji。他们喜欢使用自行车锻炼功能来查看他们骑自行车有多长时间，早上穿衣服时向Siri询问天气报告，并给他们的父母或祖父母发信息。他们也喜欢每天都能关闭活动环。电池续航时间一直在苹果公司预测的14小时左右：我的孩子从早上7：30到晚上7：30佩戴这款手表，当他们摘下它时，通常有15%-20%的电池续航时间。\n除此之外，家庭设置的局限性，以及手表没有与特定手机配对的事实，都削弱了它的实用性。由于手表实际上没有与手机配对，因此很难获得像日历活动这样的东西，这在管理远程教育、在手表上同步时非常有用。学校时间锁定模式是如此咄咄逼人，以至于我无法向我的孩子发送紧急消息，他们也无法在不绕过锁的情况下看到任何提醒或日历条目。学校时间锁甚至阻止了我每次孩子离开学校时收到通知，因为它阻止了手表上要求他们批准重复提醒的通知。(这是一项隐私功能。一次性位置提醒不需要批准，但手表会在每次向父母的手机发送提醒时通知佩戴者。)。\n很明显，苹果为正常的学校时间表设计了School Time，学生从早上到下午三点左右上学，不应该真的需要任何智能手表功能。但是，在我们目前的远程和在校混合学习的情况下，学校时间模式的限制太大了。苹果公司建议定制一种特殊的停机模式，允许某些应用程序和通知通过，但这是父母的另一个工作和管理层面。\n其他功能也让人感觉是为不同的时代设计的。正如前面提到的，我的孩子现在并不经常去多个地方旅行，所以追踪他们的下落的需要并不是特别有价值。Apple Cash Support在我们的日常生活中没有任何用处，因为再说一次，没有我和我的配偶，我的孩子实际上哪里也不会去。只有极少数情况下，他们需要自己买东西，并且没有为此目的提供一些现金。\n我不能为此责怪苹果。很明显，早在大流行扰乱我们生活的一切之前，家庭设置就已经在进行中了，很可能当事情真的恢复正常时，这些功能就是我想要利用的。也有可能随着我的孩子长大和更加独立，某些功能的价值会变得更加明显。但现在，在我8岁的孩子手腕上佩戴一块智能手表的价值并不是特别高。\n价值当然是主观的，但不可否认，带有家庭设置的Apple Watch成本很高。对于你的孩子来说，这也是一种保质期有限的东西。苹果公司说，这项服务是为5岁及以上的儿童设计的，但如前所述，即使是我8岁的孩子也不够独立，无法真正利用它提供的大部分服务。年龄较大的孩子可以更多地利用这一点，但用不了多久，他们就会对爸爸妈妈管理的手表不满意，只想要一部自己的iPhone。这就留下了一个相当窄的年龄范围，家庭设置为其提供了与其成本相关的适量的实用程序。\n作为一名家长，在不久的将来，将有多个孩子达到想要一部智能手机的年龄，我真的很希望看到家庭设置中的父母控制和内容限制扩展到可以在成熟的iPhone上使用的账户。目前，许多家长依赖第三方应用程序和设备管理服务来锁定和跟踪孩子拥有的设备。如果苹果本身就支持这一切，情况会好得多。也许这就在公司的路线图上。当然，这感觉像是家庭设置的明显演变。\n但目前，家庭设置仅限于Apple Watch，它与智能手机不太一样。对于我的家人来说，它没有提供足够的效用来证明成本是合理的，无论大流行是否封锁。对于其他人来说，如果你一直在关注一款GPS跟踪手表，但你要么不信任制造商，要么觉得它们不是好产品，Family Setup确实提供了一种来自一家在支持和隐私方面广受信任的公司的已知体验。这种信任和经历是有代价的。\n更正：本文较早版本将Apple Cash功能称为Apple Pay或Apple Card，这是不正确的。我们已经更新了提及的内容，以确保其准确性，并对此错误表示歉意。", "note_en": "The most interesting Apple Watch product Apple announced this year wasn’t the new  flagship Series 6 or the new  lower-cost Watch SE. It wasn’t  watchOS 7 with its handful of new watchfaces, the ability to track your sleep, or detect when you’re washing your hands to reprimand you if you don’t go the full 20 seconds either.\n The most interesting thing is Apple’s new Family Setup service, which lets parents provision an Apple Watch for their kids to use. They can choose what apps and services their kids can access, who they can call or send messages to, and track their location through GPS. Even if you’re not a parent, the new Family Setup service is interesting because it gives us an idea of what a truly standalone Apple Watch could be.\n For the past few weeks, I’ve strapped an Apple Watch SE to my eight-year-old child to see what the new Family Setup service is like to use in the real world (or at least as real of an experience as I can get in the middle of pandemic lockdown). Here’s what I’ve learned.\n  The easiest way to think of Family Setup is it’s Apple’s take on the  GPS tracking smartwatches for kids that have been sold by carriers for the past few years. Parents like those devices for their ability to see where their child’s location is at any given time and check in with them via text message or calls. Beyond that, the basic watches might track some simple fitness metrics and tell the time, but they are far from full-fledged smartwatches. Their designs are often chunky and kid-friendly, and their user interfaces are simplified down with big buttons and colorful graphics. The parental management apps for smartphones are similarly basic and not especially pleasant to use. There may also be data privacy concerns, as sometimes the companies that make these watches aren’t as secure or have worse data policies than Apple.\n Family Setup is slightly different. Instead of being a dedicated device solely designed for kids, it is just a mode that you enable on a cellular-enabled Apple Watch. You need an iPhone to configure it, but beyond that, the Watch isn’t paired to any specific device, unlike the standard system that requires you to link an Apple Watch with an iPhone.\n A Family Setup Apple Watch has a majority of the capabilities of the Apple Watch that you or I might purchase and use. It has all of the same watchfaces, including their deep levels of customization; comes with many of the same preinstalled apps; can use Apple’s services like iMessage, Music, Siri, and more; and can even install apps from the App Store that’s on the Watch itself.\n When you hand a Family Setup Apple Watch to your kid, you are giving them a full-fledged smartwatch\n That means when you are handing a Family Setup Apple Watch to your kid, you are handing them a full-fledged smartwatch with all of the capabilities and responsibilities associated with it. It is no more durable than any other Apple Watch, it needs to be charged every day, and it can be as open or as limited in capabilities as you decide. The interface is no different from watchOS 7, which means there’s still the fiddly constellation of app icons when you press the crown, tap elements are rather small, and there’s a lot of text to read. Depending on the age of your child, this interface can either be just fine or a challenge to use — at the very least, I recommend switching the app launcher to the list view for easier access.\n  It’s also just as expensive as any other Apple Watch. To use Family Setup, you need to have a Watch  with cellular connectivity and then sign up for a service plan through your carrier, which runs about $10 per month. The Apple Watch SE with LTE is the lowest-cost new model that Apple sells that’s compatible, and it starts at $329. You can use Family Setup with something as old as a Series 4, but since the vast majority of people do not buy the cellular versions of the Apple Watch, it’s unlikely that you’ll have one to pass down to a kid or find a great deal on the secondhand market.\n That cost is two to three times as much as what you can get a basic GPS tracking watch for, and it’s undeniably a lot of money to spend on a gadget that you’re going to strap to a kid’s wrist. As I learned when  reviewing the Apple Watch SE, it doesn’t take much to break an Apple Watch, and fixing it isn’t cheap. You can add AppleCare to the Watch just like any other Apple device to provide some insurance against breakage, but that’s even more to spend up front.\n  The highlight feature for a lot of parents will likely be the GPS tracking capabilities, which neatly integrate into Apple’s existing Find My app. You can see where your child is, set up notifications for when they arrive or leave a specific location, and even get an alert if they aren’t at an expected location at a specific time.\n Testing that feature has been challenging during the pandemic-related lockdown we’re currently in since my kid rarely leaves our home, and when they do, I’m generally with them. I was able to get an alert for when they arrived at school, and I can check the Find My app to confirm that they are indeed at school when they are supposed to be. But with no extracurriculars and no play dates at friends’ houses happening now, this feature has had limited utility.\n The list of features that do work under Family Setup is far longer than what doesn’t\n The list of features that do work on the Apple Watch with Family Setup is far longer than what’s not supported, which includes Podcasts, Remote, Apple News, Home, and Shortcuts. Messages, phone calls, walkie talkie, watchfaces, timers, alarms, stopwatch, Reminders, Calendar, Breathe, Maps, weather, and Voice Memos are all fully functional in Family Setup. Your child can ask Siri for weather reports, to set timers, send messages, and perform most other tasks short of controlling smart home gadgets.\n A unique Family Setup feature is the new Schooltime mode, which is an extreme downtime feature that effectively locks out every capability of the Watch outside of telling the time. When Schooltime is enabled, a special school bus-yellow watchface is displayed that only shows the time and date. Apple says this is designed to make it easy for teachers to see if the Watch is locked from a distance.\n Parents can program what time Schooltime is enabled and disabled based on the school schedule of their child. Since Schooltime locks out everything, including the ability to send messages or receive notifications, the child can unlock it if they need to use the Watch for something. Each unlock is reported in the parent’s Apple Watch app.\n The Apple Watch will also track your child’s fitness activity, though there are some limitations here. High and low heart rate notifications are limited to ages 13 and up, fall detection is only available for those over the age of 18, and irregular heart rhythm notifications, EKG, cycle tracking, sleep tracking, and blood oxygen sensing aren’t available at all under Family Setup. Those limitations make Family Setup less ideal for elder care uses, where you’d likely want to monitor for things like irregular heart rhythm or falls and have the ability to spot-check EKG readings.\n  If the Apple Watch wearer is under the age of 13, the Activity app will track the number of minutes they’ve moved as opposed to active calories, as it does for adults. This is designed to keep kids from focusing on calorie consumption, but I think it would be beneficial for everyone if Apple transitioned away from counting calorie burn full stop. Workout tracking is still available, so a child can track runs and other activities. My kid has particularly enjoyed measuring the distance of their bike rides using the cycling tracking feature and has unsurprisingly gotten attached to closing their rings by the end of the day, a feeling many Apple Watch wearers are familiar with.\n Lastly, Family Setup on an Apple Watch also supports Apple Cash, so a wearer can purchase items using it where Apple Pay is accepted. Parents can set up an Apple Cash card on their phone and then link it to the child’s Watch. Funds can be added by sending a text message to the Watch, which the child taps to add to their card. Parents can also get notifications when money is spent or sent from the card, limit who a child can send money to, see a record of transactions in the Wallet app on their iPhone, and remotely lock the ability to use the Apple Cash card on the Watch.\n  Setting up Family Setup on an Apple Watch is not unlike setting up an Apple Watch for yourself. The main difference is that you need to create an Apple ID for your child during the process, which the Watch app on the iPhone walks you through. The setup also walks you through enabling approval for App Store purchases; setting up the necessary cellular connection and subscribing to a plan through your carrier; setting fitness tracking goals; turning on Messages; and more.\n You are also prompted to set up which contacts will show up on the Watch and who your child will be allowed to communicate with using the Watch. This is an important step. When I initially set up the Watch for my child, I breezed through this without setting it up properly, and it took less than a day for spam texts and calls to start showing up on their Watch.\n Since setting up a cellular connection requires attaching an actual phone number to the Watch, your child is open to whatever database that phone number has been in. Limiting who they can contact and, more importantly, who can contact them prevents spammers and randoms from sending them messages or calling the Watch. Messages from unapproved contacts that are sent to the Watch will still show up in the Messages app, though you aren’t able to read their contents. I wish Apple would just block them entirely so my kid doesn’t have to deal with periodically deleting them.\n Beyond the initial setup, things get a bit wonkier from the parent’s side. Instead of doing everything through the Apple Watch app, as you might expect, some features in Family Setup are managed in the Watch app, others are managed in the Screen Time settings page, while others still are accessed through the Apple Health app. Tracking your child’s location and setting up location alerts is done via the Find My app, an entirely different app from the three already mentioned. It’s confusing and hard to remember what setting is where; a consolidated place for all of this would make it a lot easier.\n  The Screen Time settings are the most important. Once you’ve set up the Watch and added your child to your family, you will be able to access your child’s Screen Time page in the Screen Time section of the Settings app on your iPhone. From there, you can enable downtime schedules, turn on communication limits for both normal and downtime periods, manage which apps are allowed to be used on the Watch, and control the content and privacy features. This allows you to enable or disable App Store and iTunes purchases, limit explicit content, and further control who your child can interact with through features like Game Center. It’s quite comprehensive, though it does take a fair amount of time to go through all of the options and understand what they do and how they will impact the experience for your child.\n During my testing, I ran into a bug where I was unable to turn on the content and privacy restrictions at all. The solution wasn’t obvious – I had to sign out of iCloud on my iPhone and sign back in, which resolved it.\n The only feature that’s managed in the Apple Watch app on your iPhone is the Schooltime schedule, where you can program schedules for it and see a report of how many times your child bypassed the lock.\n   In the few weeks we’ve been testing Family Setup, my kid has mostly used the Memoji watchface and customized a bunch of Memoji of themselves and their siblings. They have liked using the cycling workout feature to see how long their bike rides are, asking Siri for weather reports when getting dressed in the morning, and sending messages to their parents or grandparents. They also like being able to close their Activity rings each day. Battery life has been right around Apple’s prediction of 14 hours: my kid wears the Watch from about 7:30AM to 7:30PM, and there’s typically 15–20 percent battery life when they take it off.\n  Beyond that, the limitations of Family Setup and the fact that the Watch is not paired to a specific phone have diminished its usefulness. It’s extremely difficult to get things like calendar events, which are very useful when managing remote schooling, syncing on the Watch, due to the fact that it’s not actually paired to a phone. The Schooltime lockout mode is so aggressive that I can’t send emergency messages to my child, nor can they see any reminders or calendar entries without bypassing the lock. The Schooltime lock even prevented me from getting a notification each time my child leaves school because it blocked the notification on the Watch that requires them to approve the recurring alert. (It’s a privacy feature. One-time location alerts do not need approval, but the Watch does inform the wearer each time an alert is sent to the parent’s phone.)\n It’s clear that Apple designed the Schooltime for a normal school schedule, where a student goes to school from the morning to the mid-afternoon and shouldn’t really have a need for any smartwatch features. But in our current situation of hybrid remote and in-school learning, the Schooltime mode is too restrictive. Apple suggests customizing a special downtime mode that allows certain apps and notifications through instead, but that’s another level of work and management for the parent.\n The other features also feel designed for a different time. As mentioned, my kid isn’t exactly traveling to multiple places much right now, so the need to track their whereabouts isn’t especially valuable. The Apple Cash support has not had any utility for us in our daily life because, again, my kid isn’t actually going anywhere without me or my spouse. There are just very few instances where they’d need to buy something on their own and didn’t have some cash provided to them for that purpose.\n I can’t fault Apple for this. It’s obvious that Family Setup was in the works well before the pandemic disrupted everything about our lives, and it’s possible that when things do return to normal, these are features that I’d be looking to utilize. It’s also possible that the value of certain features will become more apparent as my kid gets older and more independent. But right now, the value of having a smartwatch on my eight-year-old’s wrist is not especially high.\n  Value is certainly subjective, but there’s no denying that an Apple Watch with Family Setup has a high cost. It’s also something that has a limited shelf life with your kid. Apple says it designed the service for kids ages five and up, but as mentioned, even my eight-year-old isn’t independent enough to really make use of most of what it offers. Older kids can take more advantage of it, but it won’t be long before they will not be satisfied with a watch managed by mommy and daddy and will just want an iPhone of their own. That leaves a rather narrow band of age ranges for which Family Setup provides an appropriate amount of utility relative to its cost.\n As a parent who will have multiple kids hitting the age where they will want a smartphone in their lives in the near future, I’d really like to see the parental controls and content restrictions available in Family Setup extended to accounts that can be used on a full-fledged iPhone. Right now, many parents rely on third-party apps and device management services to lock down and track the devices their children have. It’d be a lot better if Apple just supported all of this natively. Perhaps that’s on the company’s roadmap. It certainly feels like an obvious evolution of Family Setup.\n But for now, Family Setup is limited to the Apple Watch, and it’s not quite the same as a smartphone. For my family, it doesn’t provide enough utility to justify the cost, pandemic lockdown or not. For others, if you’ve been eyeing one of the GPS tracking watches but either didn’t trust the manufacturer or didn’t feel like they are good products, Family Setup does provide a known experience from a company that’s widely trusted when it comes to support and privacy. That trust and experience just come at a cost.\n  Correction:  An earlier version of this article referred to the Apple Cash feature as Apple Pay or Apple Card, which is incorrect. We’ve updated the mentions to be accurate and regret the error.", "posttime": "2020-10-17 02:07:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,手表,family,孩子", "title": "带家庭设置(Family Setup)的手表是苹果针对儿童推出的GPS跟踪智能手表，它具有学校时间模式等功能，同时提供了良好的隐私保护，但价格非常昂贵", "title_en": "Watch with Family Setup, Apple's take on GPS tracking smartwatches for kids, has features like Schooltime mode while offering good privacy, but is very costly", "transed": 1, "url": "https://www.theverge.com/21518711/apple-watch-family-setup-test-review-features-explainer?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["apple", "苹果", "手表", "family", "孩子"]}, {"category": "", "categoryclass": "", "imagename": "f0eb2b5f009ea1e803bf98d4996a141e.jpg", "infoid": 1029285, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "理解耳鸣耳鸣是指在没有外部噪声源的情况下对声音的感知。耳鸣的可能原因和类型很多，这使得寻找耳鸣的治疗方法变得困难。\n耳鸣体验耳鸣的经历因人而异；听起来像什么，会有多不舒服，以及耳鸣对日常生活的影响有多大。\n到目前为止，几乎没有什么选择。人们常说耳鸣没有治愈的办法，但这并不意味着什么都做不了。在爱尔兰和德国的大型临床试验中，Lenire已被证明可以缓解和缓解耳鸣。\nLenire是一种非侵入性家用医疗设备，在适当资格的医疗保健专业人员的监督下，获得了用于治疗耳鸣的CE标志认证。\n您的临床医生会评估您的耳鸣，并确定Lenire是否适合您。如果Lenire被推荐，您的临床医生将开出一个治疗计划，通常包括每天30分钟的疗程和在三个月内至少两次随访，届时您的临床医生可能会调整设备设置，以优化缓解的可能性。\n这是一种专有的口腔内设备，符合人体工程学的设计，可以舒适地坐在闭着的嘴里。舌尖上的微小电极通过舌尖表面向三叉神经传递温和而安全的能量脉冲。\nAKG是Harman International-Harman International(harman.com)的注册商标，是三星电子有限公司的全资子公司。AKG耳机随Lenire设备一起提供。\n定制的声音通过Bluetooth®耳机播放，以激活与听力相关的神经(听觉神经)。\n温和而安全的能量脉冲被传送到舌尖的表面，以激活触摸神经(主要是三叉神经)。\n被激活的神经将声音和能量脉冲转换成信号，然后传递到大脑，随着时间的推移，独特的信号模式会减少和缓解感知到的耳鸣体验。", "note_en": "UNDERSTANDING TINNITUS Tinnitus is the perception of a sound when there is no external source of noise. There are many possible causes and types of tinnitus, which makes finding a cure for tinnitus difficult.\n  The Tinnitus Experience The experience of tinnitus varies greatly from person to person; what it sounds like, how unpleasant it can be and how much tinnitus intrudes on daily life.\n  Few Options Until Now It is often said that there is no cure for tinnitus, but that does not mean that there is nothing that can be done. Lenire has been shown to soothe and relieve tinnitus in large clinical trials in Ireland and Germany.\n Lenire is a non-invasive home-use medical device that has CE-mark certification for the treatment of tinnitus under the supervision of an appropriately qualified healthcare professional.\n Your clinician will evaluate your tinnitus and determine if Lenire is right for you. If Lenire is recommended, your clinician will prescribe a treatment plan that will typically include daily 30 minute sessions and at least two follow up visits over the course of three months, when your clinician may adjust device settings to optimise the potential for relief.\n This is a proprietary intra-oral device, ergonomically designed to sit comfortably in the closed mouth. Tiny electrodes on the tonguetip deliver mild and safe energy pulses to the trigeminal nerves via the surface of the tip of the tongue.\n  AKG is a registered trademark of Harman International - Harman International ( harman.com), is a wholly-owned subsidiary of Samsung Electronics Co, LTD. AKG Headphones are supplied with the Lenire device.\n Customised sounds are played through Bluetooth® headphones to activate the nerve involved in hearing (the auditory nerve)\n  Mild and safe energy pulses are delivered to the surface of the tip of the tongue to activate touch nerves (mainly the trigeminal nerve)\n  The activated nerves convert the sound and the energy pulses into signals that are relayed to the brain, where over time the unique signal patterns work to reduce and soothe the perceived tinnitus experience", "posttime": "2020-10-17 01:44:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "耳鸣,treatment", "title": "神经症耳鸣的治疗", "title_en": "Tinnitus Treatment from Neuromod", "transed": 1, "url": "https://www.lenire.com/", "via": "", "real_tags": ["耳鸣", "treatment"]}, {"category": "", "categoryclass": "", "imagename": "22c1816326f2199b7622325241bf5855.jpeg", "infoid": 1029284, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "科学家称，一名妇女在躲避剑齿猫和巨型树懒时抱着一个蹒跚学步的孩子的史前脚印是迄今发现的最长的一组人类指纹化石。\n这些指纹绵延近一英里，是在美国新墨西哥州的白沙国家公园发现的，可以追溯到1.3万年前。\n伯恩茅斯大学的马修·班尼特教授说，在他们发现之前，位于坦桑尼亚北部的最长的轨道只有200米长。\n科学家们表示，新发现的轨道以及它揭示的故事，可能会继续深入荒野-但公园附近的美军导弹射程意味着他们无法沿着这条小径一直走到尽头。\n我们就是不知道他们走了多远，贝内特教授说。他是“第四纪科学评论”(Quaternary Science Reviews)上发表的一项关于这条足迹的研究的合著者。如果我们将来有机会进入这些山脉，进一步追踪它，那将是非常美好的一件事。\n由于只有在特定的天气条件下才能看到，当地人称之为幽灵足迹，成人足迹第一次被发现是在2017年，紧随其后的是儿童足迹。\n这些照片讲述了一个令人惊叹的故事，一个女人和一个小孩子穿过泥滩时，大型捕食者横穿了他们的道路。\n一项分析发现，这名女子移动速度很快，断断续续地抱着孩子，然后放下孩子。\n在外出的旅途中，她的指纹显示她正在滑落，这表明情况很潮湿，很危险。但当她回来时，几乎完全按照同样的路径走，她是独自一人，没有检测到滑落的痕迹。\n在旅途中，其他足迹显示一只巨大的树懒，猛犸象和剑齿猫穿过他们的道路，树懒被它们的气味吓了一跳。\n贝内特教授说，当这只动物接近跑道时，它似乎用后腿站立起来捕捉气味，转身践踏人类的脚印，然后停下来，然后四肢着地逃跑。\n这条小路是在一个干燥的湖床(称为Playa)的表面下几厘米处发现的，当时那里可能是泥泞的。\n贝内特教授说，经过太阳的烘烤和漂流物质的轻微覆盖，这些足迹已经在湖面附近停留了1万多年。\n这绝对令人难以置信，他补充道。当你看着跑道的时候，看起来有点像你刚洗完澡，在浴室上留下了湿漉漉的脚印。但我们不知道它们会持续到未来多久，因为那里的条件正在随着环境的变化而变化。\n他说，妇女和儿童的奋斗故事既是科学证据，也是诗歌。\n在科学上，纯粹的证据和诗歌是有界限的，我们也在这个界限上，但我们在故事中所说的每一件事都有某种形式的证据，他补充道。\n在这里，我们实际上可以在很长的距离内追踪这些个体，这是你在其他任何地方都做不到的，这就是令人惊叹的迷人之处。\n每日电讯报重视您的评论，但恳请所有帖子都是主题、建设性和尊重的。请检查我们的评论政策。", "note_en": "Prehistoric footprints of a woman carrying a toddler while dodging sabre-toothed cats and giant sloths are the longest set of fossilised human prints ever found, scientists have said.\n The prints, which stretch for almost a mile and were discovered in the White Sands National Park in New Mexico, USA, date back 13,000 years.\n Prior to their discovery, the longest track, located in Northern Tanzania, was only around 200 metres long, said Professor Matthew Bennett, of the University of Bournemouth.\n  Scientists say the newly-discovered track, and the story it reveals, could go on even further into the wilderness – but a US military missile range neighbouring the park means they are unable to follow the trail to its end.\n &#34;We just don&#39;t know how far they went,&#34; said Prof Bennett, the co-author of a study of the trail, published in the Quaternary Science Reviews. &#34;It would be really nice in the future, perhaps if we have access to the ranges, to trace it further.&#34;\n Locally known as &#34;ghost tracks&#34; because they can only be seen under certain weather conditions, the adult tracks were first discovered in 2017, followed by the child&#39;s.\n The prints tell the remarkable story of a woman and a small child as they made their way across the mudflats with large predators crossing their path.\n An analysis found the woman was moving at a rapid pace, intermittently carrying and putting down the child.\n On the outward journey, her prints show that she was slipping, suggesting conditions were wet and treacherous. But on her return, following the same path almost exactly, she was alone and no slipping marks were detected.\n  During the trips, other tracks show a giant sloth, mammoths and sabre-tooth cats crossed their path, and the sloth was startled by their scent.\n &#34;As the animal approached the trackway, it appears to have reared up on its hind legs to catch the scent, pausing by turning and trampling the human tracks before dropping to all fours and making off,&#34; Prof Bennett said.\n  The path was discovered just a few centimetres under the surface of a dry lake bed, known as playa, which would have been muddy at the time.\n After being baked by the sun and covered over slightly by drifting material, the tracks have stayed near the surface of the lake for over 10,000 years, said Prof Bennett.\n &#34;It&#39;s absolutely unbelievable,&#34; he added. &#34;When you look at the tracks, it looks a bit as if you just stepped out of the shower and you&#39;re making wet footprints on the bathroom. But how long they will last into the future we don&#39;t know, because the conditions are changing there with environmental change.&#34;\n  The story of the struggle of the woman and child is one of both scientific evidence and poetry, he said.\n &#34;There&#39;s a boundary in science between pure evidence and poetry and we&#39;re on that boundary, but everything that we said in the story is evidenced in some shape,&#34; he added.\n &#34;Here, we can actually track the individuals across the landscape over huge distances which you can do at no other site, and that&#39;s what&#39;s so amazingly fascinating.&#34;\n  The Telegraph values your comments but kindly requests all posts are on topic, constructive and respectful. Please review our commenting policy.", "posttime": "2020-10-17 01:44:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "孩子,footprints,足迹", "title": "古代妇女被剑齿猫偷袭时抱着蹒跚学步的孩子的脚印", "title_en": "Ancient footprints of woman carrying toddler while stalked by sabre-toothed cats", "transed": 1, "url": "https://www.telegraph.co.uk/news/2020/10/16/prehistoric-footprints-woman-carrying-toddler-dodging-sabre/", "via": "", "real_tags": ["孩子", "足迹"]}, {"category": "", "categoryclass": "", "imagename": "194d456bc520e6c8256569dd91c155e9.jpg", "infoid": 1029281, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "9月9日，斯托特号导弹驱逐舰在海上达到创纪录的208天。26日，作为部署到靠近中东和北非的美国第五舰队作战区的一部分。\n根据海军的一份新闻稿，他们的部署超过了今年早些时候由德怀特·D·艾森豪威尔航空母舰(Dwight D.Eisenhower)和导弹巡洋舰圣哈辛托号(San Jacinto)创造的207天的先前纪录。\n为了缓解船员感染新冠肺炎的风险，减少港口访问，增加海上训练时间已成为常态。\n在经历了令人印象深刻的208天之后，#USSStout#DDG55已经打破了@Usnavy号连续出海天数最多的记录。太棒了，祖鲁，#队友！我们感谢您的奉献和承诺。#americasAwayTeam#NavalPresence https://t.co/fPavEoaRwZ。\n-USNavyCNO(@USNavyCNO)2020年9月29日。\n今年早些时候，西奥多·罗斯福号航空母舰爆发了新冠肺炎疫情，对该事件的处理导致其指挥官被解雇。现在，TR正计划在接下来的几个月里再次部署。\n据海军报道，今年夏天，当驱逐舰中队26的其余成员返回家园时，Stout仍然支持特遣部队50特遣部队(Task Force 50)、特遣部队51/5和联盟特遣部队哨兵部队(Coalition Task Force Sentinel)，后者是国际海事安全机构负责行动的部门。\n在139天的支援特遣部队哨兵行动中，Stout为550多艘船只提供了监视，确保公开贸易不受干扰。\n“斯托特号航空母舰在维护该地区的航行自由方面发挥了重要作用。CTF哨兵部队司令Rob Bellfield中校在海军新闻稿中说：“它的定期存在有助于威慑潜在的威胁，并向全球商人社区提供了保证。”在海军新闻稿中，CTF Sentinel指挥官Rob Bellfield中校说。“我要感谢全体船员的努力，并祝他们在余下的任务中一切顺利。”\n除了TF51/5，该舰还进行了岛屿两栖突击和联合空面一体化训练。为了支持艾克和尼米兹航母打击群，“雄鹰”号在霍尔木兹海峡巡逻，并护送陆军后勤支援舰队。\n在海上，船员们还实现了海军的又一次第一，进行了有史以来第一次海上部署中航修。部署中的航程维修需要大量的维修和维护，以保持舰艇在剩余的部署中运行。\nNAVCENT老板塞缪尔·帕帕罗(Samuel Pparo)副海军上将在一份新闻稿中说：“我们对斯托特在战区取得的成就感到非常自豪，因为他们一直在确保航行自由。”“在新冠肺炎的挑战和地区紧张局势的不确定性下，斯托特体现了他们的座右铭，并以‘勇敢、勇敢、正直’取胜。”", "note_en": "The  guided-missile destroyer Stout reached a record 208 days at sea Sept. 26 as part of a deployment to the U.S. 5th Fleet area of operations, near the Middle East and North Africa.\n    Their deployment surpassed the previous record of 207 days,  set earlier this year by aircraft carrier  Dwight D. Eisenhower and guided-missile cruiser San Jacinto, according to a Navy news release.\n  In efforts to mitigate the risk of sailors contracting COVID-19, fewer port visits and more time training at sea have become the norm.\n  After an impressive 208 days underway,  #USSStout  #DDG55 has broken the record for the  @USNavy’s most consecutive days at sea. Bravo Zulu,  #Shipmates! We appreciate your dedication and commitment.  #AmericasAwayTeam  #NavalPresence https://t.co/fPavEoaRwZ\n— USNavyCNO (@USNavyCNO)  September 29, 2020\n  Earlier this year, the aircraft carrier Theodore Roosevelt experienced an outbreak of COVID-19, the handling of which led to the firing of its commanding officer. Now, the TR is  planning to deploy again in upcoming months.\n  When the rest of Destroyer Squadron 26 returned home this summer, the Stout remained to support Task Force 50, Task Force 51/5, and Coalition Task Force Sentinel, the arm of the International Maritime Security Construct responsible for operations, the Navy reported.\n    The Stout provided overwatch for more than 550 vessels in 139 days of supporting Task Force Sentinel, ensuring open trade was not interfered with.\n  “USS Stout has been instrumental in maintaining freedom of navigation in the region. Its regular presence has helped to deter potential threats and provide reassurance to the global merchant community,” said Cmdr. Rob Bellfield, commander of CTF Sentinel, in the Navy news release. “I wish to thank the crew for their efforts and wish them all the best during the rest of their deployment.”\n             Alongside TF 51/5 the ship also practiced island amphibious assault and joint air and surface integration. In support of both the Ike and  Nimitz Carrier Strike Groups, the Stout patrolled the Strait of Hormuz and escorted Army logistics support vessels.\n  While at sea, the crew also achieved another first for the Navy, conducting the first-ever mid-deployment voyage repair at sea. Mid-deployment voyage repairs require significant repair and maintenance to keep the ship running for the remainder of the deployment.\n    “We are extremely proud of Stout’s accomplishments in theater as they’ve been operating to ensure freedom of navigation,” said NAVCENT boss Vice Adm. Samuel Paparo in a news release. “Under the challenges of COVID-19 and the uncertainty of regional tensions, Stout embodied their motto and prevailed with ‘Courage, Valor and Integrity.’”", "posttime": "2020-10-17 01:43:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "舰艇,ship,部署", "title": "海军舰艇因Covid担忧打破海上最长时间纪录", "title_en": "Navy ship breaks longest time at sea record due to Covid concerns", "transed": 1, "url": "https://www.navytimes.com/news/your-military/2020/09/29/guided-missile-destroyer-breaks-record-for-longest-time-spent-at-sea/", "via": "", "real_tags": ["舰艇", "ship", "部署"]}, {"category": "", "categoryclass": "", "imagename": "b714dcfedadff0cf331ad3fb982919a7.jpeg", "infoid": 1029280, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家四大会计公司审查了Wirecard、Luckin Coffee和其他公司的账簿，当丑闻出现时，这些公司的投资者损失了数十亿美元。这家为快速增长的科技初创公司提供服务的公司表示，它发现了一些问题。", "note_en": "The Big Four accounting concern reviewed the books of Wirecard, Luckin Coffee and other companies where investors lost billions when scandals emerged. The firm, which caters to fast-growing tech startups, says it unearthed some of the problems. ", "posttime": "2020-10-17 01:43:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "永和,imploded", "title": "倒闭的公司有一些共同之处：安永和杨审计了它们", "title_en": "Firms That Imploded Have Something in Common: Ernst and Young Audited Them", "transed": 1, "url": "https://www.wsj.com/articles/string-of-firms-that-imploded-have-something-in-common-ernst-young-audited-them-11602863319", "via": "", "real_tags": ["永和", "imploded"]}, {"category": "", "categoryclass": "", "imagename": "cbfc7095d2738eb1ffa04e4b56ed769d.jpg", "infoid": 1029279, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "ProPublica是一个调查滥用权力的非营利性新闻编辑室。注册后即可收到我们最重要的新闻。\n上午7点47分。在阵亡将士纪念日周末的周日，杰伊·巴特勒(Jay Butler)博士向亚特兰大疾病控制和预防中心(Centers For Disease Control And Prevention)的同事们发出了一封严厉的电子邮件。\n巴特勒当时是该机构冠状病毒应对项目的负责人，他和他的团队一直在努力制定指导意见，帮助美国人安全地返回礼拜场所，因为他们担心，祈祷和唱赞美诗这两种最大的安慰可能会在每一次呼吸中向空气中排放一种致命的病毒。\n一周前，疾控中心公布了对阿肯色州一座教堂爆发疫情的调查，这起疫情导致4人死亡。该机构的科学期刊最近详细介绍了一场超级传播者活动，在两个半小时的合唱团练习中，61名歌手中有52名发展了新冠肺炎。两人死亡。\n巴特勒是一位有30多年经验的传染病专家，他似乎是领导这项努力的理想人选。作为疾控中心精英疾病侦探之一，他曾帮助联邦调查局调查炭疽袭击事件，并在H1N1流感大流行期间领导疫苗分发，当时供不应求。", "note_en": "ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive  our biggest stories as soon as they’re published.\n  At 7:47 a.m. on the Sunday of Memorial Day weekend, Dr. Jay Butler pounded out a grim email to colleagues at the Centers for Disease Control and Prevention in Atlanta.\n  Butler, then the head of the agency’s coronavirus response, and his team had been trying to craft guidance to help Americans return safely to worship amid worries that two of its greatest comforts — the chanting of prayers and singing of hymns — could launch a deadly virus into the air with each breath.\n  The week before, the CDC had published its investigation of an outbreak at an Arkansas church that had resulted in four deaths. The agency’s scientific journal recently had detailed a superspreader event in which 52 of the 61 singers at a 2½-hour choir practice developed COVID-19. Two died.\n  Butler, an infectious disease specialist with more than three decades of experience, seemed the ideal person to lead the effort. Trained as one of the CDC’s elite disease detectives, he’d helped the FBI investigate the anthrax attacks, and he’d led the distribution of vaccines during the H1N1 flu pandemic when demand far outstripped supply.", "posttime": "2020-10-17 01:43:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "疾控中心,fall,当时", "title": "疾控中心的垮台", "title_en": "The Fall of the CDC", "transed": 1, "url": "https://www.propublica.org/article/inside-the-fall-of-the-cdc", "via": "", "real_tags": ["疾控中心", "fall", "当时"]}, {"category": "", "categoryclass": "", "imagename": "52ee1eced2ab39cc25374ca0e3be0c2e.jpg", "infoid": 1029277, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "推特(Twitter)改变了分享黑客材料的政策。此前，该公司决定阻止用户在Twitter上发布指向“纽约邮报”(New York Post)一篇文章的链接，这篇文章据称包含亨特·拜登(Hunter Biden)的电子邮件，据称这些邮件是从一家维修店的一台电脑上取回的。\n周三，Twitter表示，它屏蔽了“华盛顿邮报”报道的链接，因为它包含私人信息，并违反了Twitter的黑客材料政策，该政策禁止分享指向黑客内容的链接或图片。但在周四深夜，Twitter法律主管维贾亚·加德(Vijaya Gadde)在一条帖子中写道，在收到重要反馈后，该公司决定改变(黑客材料)政策，以及我们如何执行这一政策。\nGadde写道，推特在2018年颁布了这项政策，以阻止和减轻与黑客攻击和未经授权暴露私人信息相关的危害。我们试图在人们的隐私和言论自由权利之间找到恰当的平衡，但我们可以做得更好。因此，Twitter将改变其黑客材料政策，不再删除被黑客攻击的内容，除非这些内容是由黑客或与他们协同行动的人直接分享的。Twitter还将标记Tweet以提供上下文，而不是阻止链接在Twitter上共享。&#34；Twitter还将为Tweet贴标签，以提供上下文，而不是阻止链接在Twitter上共享。&#34；Twitter将不再删除被黑客直接分享的内容。&#34；Twitter还将标记Tweet以提供上下文，而不是阻止链接在Twitter上共享。\n推特发言人布兰登·博尔曼(Brandon Borrman)写道，“华盛顿邮报”的文章仍然被屏蔽，因为文章中的材料仍然违反了我们关于分享个人隐私信息的规定。然而，今天我在推特上发布了“华盛顿邮报”报道的链接，屏蔽似乎已经解除。\nTwitter首席执行官杰克·多尔西承认Twitter对“华盛顿邮报”的处理不当，他在周三写道，在没有任何上下文说明为什么我们重新屏蔽URL是不可接受的情况下，屏蔽Twitter或DM上的URL共享是不可接受的。今天，多尔西评论了这一政策变化，写道直接屏蔽URL是错误的，我们更新了政策和执法措施以修复问题。我们的目标是尝试添加上下文，现在我们有能力做到这一点。\n“华盛顿邮报”关于这一事件的标题是，确凿无疑的电子邮件披露了亨特·拜登是如何将一位乌克兰商人介绍给副总统父亲的。但正如波因特研究所的PolitiFact所指出的，“华盛顿邮报”文章中引用的电子邮件并没有证明曾经有过这样的会面。", "note_en": "Twitter has changed its policy on sharing hacked materials after facing criticism of its  decision to block users from tweeting links to a New York Post article that contained Hunter Biden emails allegedly retrieved from a computer left at a repair shop.\n On Wednesday, Twitter  said it blocked links to the Post story because it included private information and violated Twitter&#39;s  hacked materials policy, which prohibits sharing links to or images of hacked content. But on late Thursday night, Twitter legal executive Vijaya Gadde  wrote in a thread that the company has &#34;decided to make changes to the [hacked materials] policy and how we enforce it&#34; after receiving &#34;significant feedback.&#34;\n Twitter enacted the policy in 2018 &#34;to discourage and mitigate harms associated with hacks and unauthorized exposure of private information,&#34; Gadde wrote. &#34;We tried to find the right balance between people&#39;s privacy and the right of free expression, but we can do better.&#34; Twitter will thus  change its hacked materials policy to &#34;no longer remove hacked content unless it is directly shared by hackers or those acting in concert with them.&#34; Twitter will also &#34;label Tweets to provide context instead of blocking links from being shared on Twitter.&#34;\n Twitter spokesperson Brandon Borrman  wrote that the Post article is still blocked because &#34;the materials in the article still violate our rules on sharing personal private information.&#34; However, I was able to tweet a link to the Post story today and the block  appears to be lifted.\n  Twitter CEO Jack Dorsey acknowledged that Twitter handled the Post situation poorly,  writing on Wednesday that &#34;blocking URL sharing via tweet or DM with zero context as to why we&#39;re blocking [was] unacceptable.&#34; Today, Dorsey commented on the policy change,  writing that &#34;Straight blocking of URLs was wrong, and we updated our policy and enforcement to fix. Our goal is to attempt to add context, and now we have capabilities to do that.&#34;\n The Post&#39;s headline on the story in question is, &#34;Smoking-gun email reveals how Hunter Biden introduced Ukrainian businessman to VP dad.&#34; But as the Poynter Institute&#39;s PolitiFact  noted, the emails cited in the Post article &#34;do not establish that such a meeting ever occurred.&#34;", "posttime": "2020-10-17 01:42:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,黑客,abruptly,twitter", "title": "推特在屏蔽拜登报道后突然改变黑客材料政策", "title_en": "Twitter abruptly changes hacked-materials policy after blocking Biden story", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/10/twitter-lifts-ban-on-sharing-hacked-materials-after-blocking-ny-post-story/", "via": "", "real_tags": ["推特", "黑客", "abruptly", "twitter"]}]