[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1033138, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "8月24日，我们宣布对部分用户实施Docker容器拉取限速。从11月2日开始，Docker将逐步对匿名和免费认证用户的Docker容器拉取请求进行限制。这些限制将于11月2日(星期一)从太平洋时间上午9点到10点全面实施，然后对匿名和免费用户减少到每6小时5000次拉动。这将短暂地通知一些用户他们是否超出了限制，但允许服务在一小时内恢复。这些限制将在几周内逐步降低，直到达到最终级别(匿名用户限制为每6小时100个容器拉取，免费用户限制为每6小时200个容器拉取)。所有付费Docker账户(Pro、Team或Legacy订户)均不受费率限制。\n分阶段实施阶段背后的基本原理是让我们的匿名和自由层用户和集成商看到匿名CI/CD进程拉取容器映像的地方。这将允许Docker用户通过两种方式之一来解决限制：升级到无限制的Docker Pro或Docker Team订阅，调整或调整应用管道以适应容器镜像请求限制。*经过深思熟虑和讨论，我们决定在未来几周逐步、分阶段增加，而不是突然实施这项政策。有关费率限制的最新状态更新，请访问https://www.docker.com/increase-rate-limits.。\nDocker用户可以通过查询Docker Hub API返回的当前拉取和头部消息，获得其使用限制和更新状态消息的最新视图。这篇博客文章引导开发人员了解如何访问他们的当前帐户使用情况，以及理解标题消息。最后，Docker用户可以通过升级到专业版或团队订阅来完全避免费率限制：订阅详细信息和升级信息请访问https://docker.com/pricing.。非商业性开源项目可通过填写此申请表申请赞助开源Docker账户，获批为非商业性开源项目的命名空间不受拉动率限制。", "note_en": "On August 24th, we  announced the implementation of rate limiting for Docker container pulls for some users. Beginning November 2, Docker will begin phasing in limits of Docker container pull requests for anonymous and free authenticated users. The limits will be fully enforced Monday, November 2, from 9-10 am PT, and then reduced to 5,000 pulls per 6 hours for anonymous and free users. This will briefly inform some users whether they are exceeding the limits, but allow service to resume within an hour. The limits will be gradually reduced over a number of weeks until the final levels (where anonymous users are limited to 100 container pulls per six hours and free users limited to 200 container pulls per six hours) are reached. All paid Docker accounts (Pro, Team or Legacy subscribers) are exempt from rate limiting.\n The rationale behind the phased implementation periods is to allow our anonymous and free tier users and integrators to see the places where anonymous CI/CD processes are pulling container images. This will allow Docker users to address the limitations in one of two ways:  upgrade to an unlimited Docker Pro or Docker Team subscription,  or adjust application pipelines to accommodate the container image request limits.  After a lot of thought and discussion, we’ve decided on this gradual, phased increase over the upcoming weeks instead of an abrupt implementation of the policy. An up-do-date status update on rate limitations is available at  https://www.docker.com/increase-rate-limits.\n Docker users can get an up-to-date view of their usage limits and updated status messages by querying for current pulls used as well as header messages returned from the Docker Hub API. This  blog post walks developers through how they can access their current account usage as well as understanding the header messages. And finally, Docker users can avoid rate limits completely by upgrading to a Pro or Team subscription: subscription details and upgrade information is available at  https://docker.com/pricing. And non-commercial open source projects can apply for a sponsored Open Source Docker account by  filling out this application.  No pull rate restrictions will be applied to namespaces approved as non-commercial Open Source projects.", "posttime": "2020-11-04 15:31:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "docker", "title": "关于即将推出的Docker Hub速率限制，您需要了解哪些内容", "title_en": "What you need to know about upcoming Docker Hub rate limiting", "transed": 1, "url": "https://www.docker.com/blog/what-you-need-to-know-about-upcoming-docker-hub-rate-limiting/", "via": "", "real_tags": ["docker"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033137, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "以下是编写干净代码的注意事项列表，即可维护和可扩展的代码。\n命名是编写干净代码最困难也是最重要的部分。名字应该清楚地表达意图，这里的假设是，代码库中涉及的每个人都有相同的文化背景，但在实践中并不总是这样。一些一般提示：\n函数或方法是编程的基本构件。事实上，程序的内部操作通常主要由函数在相互调用时将数据推送到堆栈和从堆栈中弹出数据组成。有时，需要在堆上为必须在函数调用中存活的数据分配内存。\n调用函数时，会创建一个堆栈帧来支持函数的执行。堆栈帧包含函数的局部变量和由其调用者传递给函数的参数。该框架还包含允许被调用函数(被调用者)安全返回调用者的内务信息。堆栈的确切内容和布局因处理器体系结构和函数调用约定而异。\nDrawSquare调用的DrawLine函数的调用堆栈示例。\n函数应该很小，它们应该只做一件事：只有1级缩进-高度嵌套的函数应该重构为子例程。\n没有副作用！Public int sum(int a，int b){int result=a+b；setGui()；//这是不可测试的，并且引入了隐藏的依赖关系！返回结果；}。\n不返回NULL-调用者将需要始终检查混乱的p代码，请考虑使用特殊情况的返回值\n除可为Null或可选类型的情况外，错误条件的首选异常可用。\n参数越少越好-参数越多，需要编写的复杂性和测试用例就越多。\n在OOP中需要注意的一个重要但很有说服力的地方是，对象将其数据隐藏在抽象后面，并公开对该数据进行操作的函数，而数据结构则公开它们的数据，并且没有有意义的函数。好的OOP需要知道何时使用对象和何时使用数据结构。考虑以下示例：\n公共类点{public Double x；public Double y；}公共接口点{Double getX()；Double Gty()；void setCartesian(Double x，Double y)；Double getR()；Double getTheta()；void setPolar(Double r，Double theta)；}。\n在第二点定义中，实现所使用的坐标系是未知的，并且不一定是笛卡尔坐标系或极坐标！\n避免使用边界接口，例如，不返回Map，而是将其包装在一个类(传感器)中以封装实现。\n注释应该只用于澄清或放大--一般避免使用，让代码来说话！\n更喜欢异常而不是错误代码-错误代码有溢出到整个系统的习惯\n最后，过程性代码使添加新数据结构变得困难，因为所有函数都必须更改。OO代码使添加新函数变得困难，因为所有类都必须更改。同样，编写干净的代码需要洞察何时使用哪种风格的编程。\n单元测试应遵循F.I.R.S.T原则，即它们应快速、独立于任何外部依赖项或手动设置、可重复、自我确认(无手动检查验证)和及时(在编写生产代码之前运行)。编写干净测试的一些一般提示：\n测试应该是可读的，这可能意味着放松某些产品代码对性能的限制。\n您编写的测试可能不会超过失败的程度，不编译就是失败。\n您编写的产品代码不能超过通过当前失败测试所需的数量。\n类应该遵循开放-关闭原则--对扩展开放，对修改关闭。考虑以下示例，其中我们编写了一个计算矩形集合总面积的AreaCalculator。Public class Rectangle{public Double Width；public Double Height；}public class AreaCalculator{public Double culateArea(集合矩形){Double Result=0；for(Rectangle r：Rectles){Result+=r.width*r.Height；}返回结果；}}。\n现在我们想扩展这个函数来计算圆的面积。我们的新函数现在看起来如下：public抽象类Shape{}public class Rectangle Extended Shape{public Double Width；public Double Height；}Public类Circle扩展Shape{public Double Radius；}Public Class AreaCalculator{public Double culateArea(Collection Shares){Double Result=0；for(Shape s：Shares){if(S Instanceof Rectangle){Rectangle r=(Rectangle)s；Result+=r.width*r.Height；}Else{Circle c=(Circle)s；Result+=c.Radius*c.Radius*Math.PI；}}返回结果；}}。\n将其进一步扩展以计算三角形的面积现在需要对culateArea方法进行另一次修改，即它不能进行扩展。我们可以通过在形状数据结构上引入面积方法来改变这一点。我们的代码如下所示：public抽象类shape{抽象Double Area()；}public class Rectangle扩展Shape{public Double Width；public Double Height；@Override public Double Area(){return width*Height；}}public class Circle扩展Shape{public Double Radius；@Override public Double Area(){return Radius*RADIUS*Math.PI；}}public class AreaCalculator{public Double culateArea(Collection Shares){Double Result=0；for(Shape s：Shares){result+=s.area()；//注意简单}返回结果；}}\n在构建大型软件系统时，尽量避免预先进行大型设计-使用依赖项注入容器将事务、日志等横切容器与业务逻辑分开", "note_en": "The following is a list of notes taken on writing clean code, i.e. code that is maintainable and extensible.\n  Naming is the  hardest and the most important part of writing clean code. Names should clearly express intent and the assumption here is that everyone involved in the codebase has the same cultural background which is not always the case in practice. Some general tips:\n    Functions or methods are the fundamental building blocks of programming. In fact, the internal operation of programs normally consists mostly of functions pushing data onto and popping data off the stack as they call each other. Sometimes memory needs to be allocated on the heap for data that must survive across function calls.\n When a function is called, a  stack frame is created to support the function&#39;s execution. The stack frame contains the function&#39;s local variables and the arguments passed to the function by its caller. The frame also contains housekeeping information that allows the called function (the callee) to return to the caller safely. The exact contents and layout of the stack vary by processor architecture and function call convention.\n An example of a call stack for the  DrawLine function which is called by  DrawSquare.\n  Functions should be small and they should do 1 thing only:  Only have 1 level of indentation - highly nested functions should be refactored into sub-routines\n  No side-effects!  public int sum(int a, int b) { int result = a + b; resetGui(); // this is untestable and introduces a hidden dependency! return result;}\n  Do not return  null - caller will need to always check cluttering p code, consider using  special case return values\n    Prefer exceptions for error conditions except in cases were a  Nullable or  Optional type is available\n    Fewer arguments are better - the more the arguments, the more the complexity and test cases that need to be written\n   An important but suble point to note in OOP is that objects hide their data behind abstractions and expose functions that operate on that data whereas data structures expose their data and have no meaningful functions. Good OOP requires knowing when to use objects and when to use data structures. Consider the following example:\n  public class Point { public double x; public double y;}public interface Point { double getX(); double getY(); void setCartesian(double x, double y); double getR(); double getTheta(); void setPolar(double r, double theta);}\n  In the second  Point definition the co-ordinate system being used by the implementation is not known and need not necessarily be cartesian nor polar!\n   Avoid using boundary interfaces, e.g. instead of returning a  Map, wrap it in a class ( Sensors) to encapsulate the implementation\n  Comments should only be used for clarification or amplification - avoid in general and let the code do the talking!\n  Prefer exceptions to error codes - error codes have the habit of spilling out into the entire system\n    Finally, procedural code makes it hard to add new data structures because all the functions must change. OO code makes it hard to add new functions because all the classes must change. Again, writing clean code requires insight as to when to use which style of programming.\n    Unit Tests should follow the F.I.R.S.T principle, i.e. they should be Fast, Independent of any external dependencies or manual setup, Repeatable, Self-validating (no manual checking verification) and Timely (run just before writing production code). Some general tips on writing clean tests:\n Tests should be readable above all else and this might mean relaxing certain production code restrictions on performance\n     You may not write more of a test than is sufficient to fail, and not compiling is failing.\n    You may not write more production code than is sufficient to pass the currently failing test.\n         Classes should follow the open-closed principle - open for extension but closed for modification. Consider the following example where we write an  AreaCalculator which calculates the total area of a collection of rectangles.  public class Rectangle { public double width; public double height;}public class AreaCalculator { public double calculateArea(Collection  rectangles) { double result = 0; for (Rectangle r : rectangles) { result += r.width * r.height; } return result; }}\n We would now like to extend this function to calculate the area of circles as well. Our new function now looks as follows:  public abstract class Shape { }public class Rectangle extends Shape { public double width; public double height;}public class Circle extends Shape { public double radius;}public class AreaCalculator { public double calculateArea(Collection  shapes) { double result = 0; for (Shape s : shapes) { if (s instanceof Rectangle) { Rectangle r = (Rectangle) s; result += r.width * r.height; } else { Circle c = (Circle) s; result += c.radius * c.radius * Math.PI; } } return result; }}\n Extending this further to calculate the area of triangles now requires another modification to the  calculateArea method, i.e. it is not  open for extension. We can change this by introducing an  area method on the  Shape data structure. Our code now looks like the following:  public abstract class Shape { abstract double area();}public class Rectangle extends Shape { public double width; public double height; @Override public double area() { return width * height; }}public class Circle extends Shape { public double radius; @Override public double area() { return radius * radius * Math.PI; }}public class AreaCalculator { public double calculateArea(Collection  shapes) { double result = 0; for (Shape s : shapes) { result += s.area(); // note the simplicity } return result; }}\n    When building large software systems, try to avoid doing a big design up front - use a dependency injection container to separate cross-cutting concers like transactions, logging, etc. from business logic", "posttime": "2020-11-04 15:31:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,code,函数", "title": "干净代码-备注", "title_en": "Clean Code – Notes", "transed": 1, "url": "https://smalldata.tech/blog/2018/09/16/clean-code-notes", "via": "", "real_tags": ["代码", "code", "函数"]}, {"category": "", "categoryclass": "", "imagename": "b67e90f9c06a813de38747c71ccc4e26.jpg", "infoid": 1033136, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "阿姆鲁·阿瓦达拉(Amr Awadallah)在埃及开罗长大，然后移居美国获得博士学位，然后追求自己的职业生涯，最终找到了克劳德拉，一个非常成功的…", "note_en": "Amr Awadallah grew up in Cairo, Egypt, and then moved to the US to obtain a PhD and then pursue a career that eventually had him found Cloudera, a highly succes...", "posttime": "2020-11-04 15:31:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,awadallah", "title": "阿姆鲁·阿瓦达拉(Amr Awadallah)：Cloudera创始人，谷歌副总裁：未来是安东斯", "title_en": "Amr Awadallah: Founder of Cloudera, VP at Google: The Future Is Anthos", "transed": 1, "url": "https://www.youtube.com/watch?v=p3XKLw5Kb9w", "via": "", "real_tags": ["google", "谷歌", "awadallah"]}, {"category": "", "categoryclass": "", "imagename": "a866e392e404a3752e927e6b0eb2142a.png", "infoid": 1033135, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "宾夕法尼亚州大学公园。-随着传统计算的进步放缓，新的计算形式脱颖而出。在宾夕法尼亚州立大学，一组工程师正试图开创一种模拟大脑神经网络效率的计算方式，同时利用大脑的模拟特性。\n现代计算机是数字化的，由两种状态组成，即开-关或一加零。模拟计算机和大脑一样，有许多可能的状态。这是打开或关闭电灯开关和将调光开关调到不同照明量之间的不同之处。\n据团队负责人、宾夕法尼亚州立大学工程科学和力学助理教授萨普塔尔希·达斯(Saptarshi Das)说，神经形态或大脑启发的计算已经研究了40多年。最新的是，随着数字计算达到极限，对高速图像处理的需求也在增长，例如用于自动驾驶汽车的图像处理。大数据的兴起是追求神经形态计算的另一个驱动力，它需要大脑架构特别适合的模式识别类型。\n达斯说：“我们有强大的计算机，这一点毋庸置疑，问题是你必须把内存存储在一个地方，在另一个地方进行计算。”\n这些数据在内存和逻辑之间来回穿梭需要大量能量，并会降低计算速度。此外，这种计算机架构需要很大的空间。如果计算和内存存储可以位于同一空间，则可以消除这一瓶颈。\n“我们正在创建人工神经网络，试图模仿大脑的能量和区域效率，”DAS小组的博士生托马斯·施兰哈默(Thomas Schranghamer)解释道，他是最近发表在“自然通讯”(Nature Communications)上的一篇论文的第一作者。大脑是如此紧凑，可以放在你的肩膀上，而现代的超级计算机占据了两三个网球场大小的空间。\n就像连接大脑中可以重新配置的神经元的突触一样，研究小组正在构建的人工神经网络可以通过在一张石墨烯上施加短暂的电场来重新配置，石墨烯是一层单原子厚的碳原子层。在这项工作中，他们展示了至少16种可能的记忆状态，而不是大多数基于氧化物的记忆电阻器或记忆电阻器中的两种状态。\n达斯说：“我们已经证明，使用简单的石墨烯场效应管，我们可以精确地控制大量的记忆状态。”\n该团队认为，将这项技术扩大到商业规模是可行的。随着许多最大的半导体公司积极从事神经形态计算，Das相信他们会发现这项工作很感兴趣。\n除了Das和Schranghamer之外，这篇题为“用于高精度神经形态计算的石墨烯记忆突触”的论文的另一作者是Aaryan Oberoi，他是工程科学和力学的博士生。\n陆军研究室支持这项工作。这个团队已经为这项发明申请了专利。", "note_en": "UNIVERSITY PARK, Pa. — As progress in traditional computing slows, new forms of computing are coming to the forefront. At Penn State, a team of engineers is attempting to pioneer a type of computing that mimics the efficiency of the brain’s neural networks while exploiting the brain’s analog nature.\n Modern computing is digital, made up of two states, on-off or one and zero. An analog computer, like the brain, has many possible states. It is the difference between flipping a light switch on or off and turning a dimmer switch to varying amounts of lighting.\n Neuromorphic or brain-inspired computing has been studied for more than 40 years, according to Saptarshi Das, the team leader and Penn State assistant professor of engineering science and mechanics. What’s new is that as the limits of digital computing have been reached, the need for high-speed image processing, for instance for self-driving cars, has grown. The rise of big data, which requires types of pattern recognition for which the brain architecture is particularly well suited, is another driver in the pursuit of neuromorphic computing.\n “We have powerful computers, no doubt about that, the problem is you have to store the memory in one place and do the computing somewhere else,” Das said.\n The shuttling of this data from memory to logic and back again takes a lot of energy and slows the speed of computing. In addition, this computer architecture requires a lot of space. If the computation and memory storage could be located in the same space, this bottleneck could be eliminated.\n “We are creating artificial neural networks, which seek to emulate the energy and area efficiencies of the brain,” explained Thomas Schranghamer, a doctoral student in the Das group and first author on a paper recently published in Nature Communications. “The brain is so compact it can fit on top of your shoulders, whereas a modern supercomputer takes up a space the size of two or three tennis courts.”\n Like synapses connecting the neurons in the brain that can be reconfigured, the artificial neural networks the team is building can be reconfigured by applying a brief electric field to a sheet of graphene, the one-atomic-thick layer of carbon atoms. In this work they show at least 16 possible memory states, as opposed to the two in most oxide-based memristors, or memory resistors.\n “What we have shown is that we can control a large number of memory states with precision using simple graphene field effect transistors,” Das said.\n The team thinks that ramping up this technology to a commercial scale is feasible. With many of the largest semiconductor companies actively pursuing neuromorphic computing, Das believes they will find this work of interest.\n In addition to Das and Schranghamer, the additional author on the paper, titled “ Graphene Memristive Synapses for High Precision Neuromorphic Computing,” is Aaryan Oberoi, doctoral student in engineering science and mechanics.\n The Army Research Office supported this work. The team has filed for a patent on this invention.", "posttime": "2020-11-04 15:30:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "存储,based,计算", "title": "基于石墨烯的存储电阻器在基于大脑的计算中显示出希望", "title_en": "Graphene-based memory resistors show promise for brain-based computing", "transed": 1, "url": "https://news.psu.edu/story/637059/2020/10/29/research/graphene-based-memory-resistors-show-promise-brain-based-computing", "via": "", "real_tags": ["存储", "based", "计算"]}, {"category": "", "categoryclass": "", "imagename": "99f3d6f735ccb412da7842d7d5b1d5ac.jpg", "infoid": 1033134, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "许多流行的量化策略都在苦苦挣扎，但在不同程度上，我们现在都是量化战略。\n价值投资的万能自然在金融界激起了一场激烈的辩论。投资策略目前正处于托马斯·杰斐逊(Thomas Jefferson)去世以来最糟糕的时期。然而，其困境的广度和深度掩盖了一个事实，即它远不是新冠肺炎市场环境的唯一受害者。\n价值只是经济学家发现的几个主要投资“因素”之一，从长远来看，这些因素往往会导致高于平均水平的回报。它们本质上涉及根据一些决定性的特征对股票进行分组，例如股票的规模、资产负债表的健康状况，或者就价值而言，是根据股票的廉价程度进行分组。系统地挖掘因素是计算机驱动、算法驱动的量化投资行业的核心，该行业在过去20年里取得了戏剧性的增长。\n诚然，价值缩水的严重程度是极端的。然而，有趣的是，目前有多少基于这些因素的战略正在苦苦挣扎。对于一些量化分析师来说，这足以让他们质疑自己的整个前提。\n“为什么我不再是量化分析师，”伯恩斯坦(Bernstein)投资研究机构伯恩斯坦(Bernstein)的量化策略主管伊尼戈·弗雷泽-詹金斯(Inigo Fraser-Jenkins)最近发布的一份报告的标题颇具挑衅性。伯恩斯坦是一家有血统的投资研究机构。他认为，像他这样的量化分析师的原罪是挖掘历史数据，寻找长期有效的线索，但掩盖了市场机制来来去去的事实。这可能意味着过去奏效的东西在未来可能会失败。\n“量化基金的核心是试图对未来的投资决策进行回溯测试。但是，如果规则发生了变化，进行定量研究和回溯测试又意味着什么呢？他问。他说：“要超越最近一段糟糕的回报，量化是一个挑战。如果Covid算不上政权更迭，我不知道还有什么算得上。“。\n他并不是唯一一个认为世界已经改变的人。Refinitiv在10月份的调查中，近四分之三的量化分析师表示，他们的模式受到了新冠肺炎的伤害，12%的少数人宣称他们的模式过时了，这一比例虽小，但很引人注目。\n简而言之，弗雷泽-詹金斯认为，均值回归的核心思想--旧的市场模式最终会重新出现--可能会在新的体制中消亡。正如以价值为导向的量化投资者泰德·阿伦森(Ted Aronson)最近向“华尔街日报”(The Wall Street Journal)指出的那样，在经历了一段惨淡的业绩后，他关闭了自己的对冲基金AJO：“这一切都可以持续数年、数十年，直到或除非那只不那么隐形的手落下来拍你一巴掌，‘这在过去是管用的，但现在不管用了，不，再也不管用了。’”\n并不是每一只量化基金都表现不佳。量化投资的范围可以从廉价、简单的交易所交易基金(ETF)到复杂的对冲基金，这些基金在全球经济的数字枯竭中筛选出有利可图但转瞬即逝的模式。\n然而，很明显，宽客总体上过得很糟糕。根据美国银行(Bank Of America)的数据，在截至9月底的一年里，定量美国股票共同基金的平均涨幅仅为3.3%，相比之下，选股者的平均涨幅为8.3%，罗素1000指数(Russell 1000)的平均回报率为6.4%。至关重要的是，当前困境更不同寻常的是，有多少因素同时失效。\n尽管较少依赖成熟的主流策略，但高辛烷值策略的表现甚至更差。根据Aurum Fund Management的数据，按资产加权，在截至8月底的一年里，量化对冲基金的平均亏损为5.7%，而对冲基金的平均收益为5.2%。事实上，Aurum表示，最受欢迎的量化策略的三个月滚动表现与2007年8月“量化地震”和随后的金融危机期间一样糟糕，甚至更差。\n然而，在数据的世纪里，有许多市场机制，大多数主要投资因素都是基于这些机制的。可能只是新冠肺炎电击的独特性质被完美地设计成短路其中的许多-随着大流行的最终消退，其影响将会消退。\n今年表现不佳的很大一部分原因是科技股的“增长”热潮。今年表现良好的唯一主要量化因素是趋势冲浪势头，这并不是巧合，因为赢家赢得了很大的胜利，输家则坐以待毙。\n如果宣称量化投资的太阳已经落山，那将是一个勇敢的人。有人可能会争辩说，如今，整个资金管理行业在不同程度上是由某种形式或方式的定量研究推动的。这是一个只可能在未来几年加速的趋势。我们现在都是宽客了。", "note_en": "Many popular quant strategies are struggling but to varying degrees we are all quants now\n The omnishambles in value investing has naturally stirred a lively debate in financial circles. The investment strategy is now on its worst run since  the death of Thomas Jefferson. Yet the length and depth of its woes obscure the fact that it is far from the only casualty of the Covid-19 market environment.\n Value is just one of several major  investment “factors” that economists had discovered tend to lead to above-average returns in the long run. They essentially involve grouping stocks according to some defining characteristic, such as their size, the health of their balance sheet or — in the case of value — their cheapness. Systematically mining factors is at the heart of the computer-powered, algorithm-driven quantitative investment industry that has grown dramatically over the past two decades.\n The severity of the  value drawdown is admittedly extreme. However, what is interesting is just how many of the strategies based on these factors are struggling at the moment. For some quantitative analysts, it is enough to make them question their entire premise.\n  “Why I am no longer a quant,” was the provocative title of a recent report from Inigo Fraser-Jenkins, head of quantitative strategy at Bernstein, a pedigreed investment research house. He argues that the original sin of quants like him is mining historical data for clues to what works in the long run, but glossing over the fact that market regimes come and go. That can mean that what worked in the past can fizzle out in the future.\n “At their core, quant funds try to apply backtests to future investment decisions. But what does it mean to do quant research and run backtests if the rules have changed?” he asked. “There is a challenge to quant beyond a recent patch of poor returns. If Covid doesn’t count as a regime change I don’t know what does.”\n  He is not alone in thinking the world has changed. Almost three-quarters of quants surveyed by Refinitiv in October said that their models had been hurt by Covid-19, and a small but eye-catching minority of 12 per cent declared that their models were obsolete.\n In short, Mr Fraser-Jenkins thinks that the central idea of mean reversion — that old market patterns will eventually reassert themselves — might be dead in this new regime. As Ted Aronson, a value-oriented quant investor recently  noted to the Wall Street Journal after shuttering his hedge fund AJO after a dismal performance stretch: “It can all work for years, for decades, until or except when the not-so-invisible hand comes down and slaps you and says, ‘That’s what worked in the past, but it’s not going to work now, nope, not any more’.”\n Not every quant fund has done poorly.  Quantitative investing can range from cheap, simple exchange traded funds to complex hedge funds that sift through the global economy’s digital exhaust for profitable but fleeting patterns.\n  However, it is clear that quants on the whole are having a bad time. The average  quant US equity mutual fund is up just 3.3 per cent in the year to end-September, compared with the average stockpicker’s 8.3 per cent gain, and the Russell 1,000’s 6.4 per cent return, according to Bank of America. Crucially, what is more unusual about the current predicament is how many factors are fizzling out at the same time.\n  Higher-octane strategies have done even worse, despite leaning less on well-established mainstream strategies. Weighted by assets, the average  quant hedge fund lost 5.7 per cent in the year to end of August, compared with the average hedge fund’s 5.2 per cent gain, according to Aurum Fund Management. In fact, Aurum says the rolling three-month performance of the most popular quant strategies is as bad or worse than during the “quant quake” of August 2007 and subsequent financial crisis.\n  However, there have been many market regimes in the century of data upon which most major investment factors are based. It may just be that the unique nature of the Covid-19 shock was perfectly designed to short-circuit many of them — and the effect will fade as the pandemic eventually recedes.\n The big technology “growth” stock boom accounts for much of the underperformance of everything else this year. It is no coincidence that the only major quant factor that has performed well this year is the trend-surfing momentum, as winners have won big and losers have been left for dead.\n It would be a brave person who declares that the sun has set on quantitative investing. One could argue that the entire money management industry is — to varying degrees — nowadays driven by  quantitative research in some form or fashion. This is a trend that is only likely to accelerate in the coming years. We are all quants now.", "posttime": "2020-11-04 15:30:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "宽子,horrible,量化", "title": "对于宽子来说，这是可怕的，可怕的，不好的一年", "title_en": "A terrible, horrible, no-good year for quants", "transed": 1, "url": "https://www.ft.com/content/d59ffc34-5a34-4cdd-bbbf-5a0e82859f1c", "via": "", "real_tags": ["宽子", "horrible", "量化"]}, {"category": "", "categoryclass": "", "imagename": "7e6e8f1effad6884ed444792c11d24b0.jpg", "infoid": 1033133, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "推特(Twitter)对唐纳德·特朗普(Donald Trump)总统的一条推文实施了分享限制，在选举日过后，总统与竞选平台之间出现了高调的对峙。Facebook为总统的帖子添加了标签，称最终计票结果尚未公布。\n这条消息在两个平台上都写道：“我们赢了很多，但他们试图窃取选举。”他说：“我们绝不会让他们这样做。投票结束后不能投票！“。\n早期的结果对总统来说是有希望的，但一些关键的州仍在计票，包括佐治亚州、宾夕法尼亚州、密歇根州和威斯康星州。这项工作不涉及额外的投票，而是处理已经正式投出但尚未清点的空前激增的邮寄选票。\n记者联系到推特请其置评，推特提到了该公司@安全账户在限制措施实施后不久发布的一条推文。这条推文写道：“我们在@realDonaldTrump的一条推文上发出警告，称其对选举做出了潜在的误导性声明。”“这项行动符合我们的公民廉洁政策。”\n在Twitter的限制下，用户必须点击警告框才能看到出现在订阅源和主页上的推文，并且不能点赞或回复推文。转发仅限于“引用推文”功能，用户只能用自己的评论分享信息。\n特朗普总统在Facebook上发布了同样的信息，该平台在帖子上添加了一个标签，指出投票仍在统计中，并将用户引导到Facebook的选举信息中心。Facebook没有采取任何措施来阻止该帖子在其网络内的传播。\n在两个平台上的另一条信息中，特朗普似乎暗示了未来的声明，而没有过早宣布胜利。“今晚我将发表声明。大获全胜！“。帖子上写着。这两个网络都没有对第二个帖子采取行动。\nTwitter和Facebook在9月份都采取了明确的政策，反对过早宣布胜利，这些政策似乎已经按照当时的规定得到了应用。自9月17日以来，推特的错误信息政策已经掩盖了过早宣称的胜利，使它们有资格被版主删除。Facebook的做法更为有限：它表示，将为涉及选举的帖子贴上标签，并将观众重定向到权威信息。Facebook还对选举相关帖子的有偿推广进行了限制，以确保候选人不能利用该公司的广告网络来宣传索赔。\n当天早些时候，推特也对特朗普的一名竞选工作人员施加了类似的限制。竞选活动负责人迈克·罗曼(Mike Roman)曾在推特上发帖指控费城存在广泛的选民欺诈行为，并附上了后来被该市地区检察官贴上误导性标签的视频。\n地区检察官办公室告诉记者：“网上传播的错误信息促使更多人拨打选举特别工作组热线，而不是投票站发生的实际事件。”", "note_en": "Twitter has placed sharing restrictions on a tweet from President Donald Trump, setting up a high-profile standoff between the president and the platform in the aftermath of Election Day. Facebook has added labels to the president’s posts, saying the final vote count isn’t in yet.\n “We are up BIG, but they are trying to STEAL the Election,” the message reads, on both platforms. “We will never let them do it. Votes cannot be cast after the Polls are closed!”\n  Early returns were promising for the president, but a number of pivotal states are still counting votes, including Georgia, Pennsylvania, Michigan, and Wisconsin. This work does not involve additional votes being cast, but instead deals with the unprecedented surge of mail-in ballots that have been officially cast but not yet counted.\n Reached for comment, Twitter referred to  a tweet from the company’s @safety account shortly after the restrictions were put in place. “We placed a warning on a Tweet from @realDonaldTrump for making a potentially misleading claim about an election,” the tweet reads. “This action is in line with our  Civic Integrity Policy.”\n Under Twitter’s restrictions, users must click through a warning box to see the tweet when it appears in feeds and homepages, and cannot like or reply to the tweet. Retweets are limited to the “quote tweet” function, where users can only share the message with their own commentary.\n President Trump posted the same message to Facebook, where the platform added a label to the post noting that votes are still being counted and directing users to Facebook’s election information center. Facebook has not taken any measures to block the spread of the post within its network.\n In a separate message on both platforms, Trump seemed to hint at a future announcement without going so far as to prematurely announce victory. “I will be making a statement tonight. A big WIN!”  the post reads. Neither network has taken action against this second post.\n Both Twitter and Facebook adopted explicit policies against premature victory announcements in September, and the policies seem to have been applied as they were laid out at the time. Since September 17th,  Twitter’s misinformation policy has covered premature claims of victory, making them eligible to be removed by moderators.  Facebook’s approach is more limited: it said it would label posts involving the election and redirect viewers to authoritative information. Facebook also placed restrictions on paid promotion of election-related posts, ensuring that candidates can’t use the company’s ad network to boost the claims.\n Earlier in the day, Twitter had  placed similar restrictions on a member of Trump’s campaign staff. Mike Roman, the campaign’s director of election day activities, had posted tweets alleging widespread voter fraud in Philadelphia, together with video that was later labelled as misleading by the city’s district attorney.\n “Misinformation being spread online has driven more calls to the Election Task Force hotline than actual incidents at polling sites,” the district attorney’s office told reporters.", "posttime": "2020-11-04 15:04:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,推特,今晚,sharing,帖子", "title": "推特对特朗普的一条声称选举舞弊的推文设置了分享限制，而Facebook则增加了标签，警告今晚的结果可能不是最终结果", "title_en": "Twitter placed sharing restrictions on a tweet from Trump alleging election theft while Facebook added labels warning that tonight's results may not be final", "transed": 1, "url": "https://www.theverge.com/2020/11/4/21548736/twitter-facebook-throttle-trump-tweet-election-theft?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["facebook", "推特", "今晚", "sharing", "帖子"]}, {"category": "", "categoryclass": "", "imagename": "de523f447a000b0fff682a44d198c371.jpg", "infoid": 1033132, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚当·鲁本(Adam Ruben)关于阅读科学论文的常见困难和挫折的开玩笑专栏，在美国科学与职业杂志的读者中引起了广泛的共鸣。你们中的许多人来我们这里寻求关于如何理解科学文献的更多(更严肃的)建议，所以我们询问了十几位处于不同职业阶段和广泛领域的科学家，告诉我们他们是如何做到这一点的。尽管很明显，随着经验的积累，阅读科学论文变得更容易了，但绊脚石是真实存在的，这取决于每一位科学家如何识别和应用最适合他们的技术。为清晰和简洁起见，对答复进行了编辑。\n我从阅读摘要开始。然后，我浏览了一下导言，翻阅了一下文章，看了一下数字。我试着找出最突出的一两个人物，我真的确信我明白他们在说什么。然后，我读了结论/总结。只有当我做到这一点后，我才会回到技术细节中来澄清我可能有的任何问题。-杰西·沙纳汉(Jesse Shanahan)，康涅狄格州米德尔敦卫斯理大学(Wesleyan University)天文学硕士候选人。\n我首先通过阅读摘要和结论来了解大体情况。这些结论帮助我了解摘要中总结的目标是否已经达到，以及所描述的工作是否对我自己的研究有意义。我也总是看情节/数字，因为它们帮助我对一篇论文有了第一印象。然后，我通常从头到尾阅读整篇文章，按照章节出现的顺序浏览它们，这样我就可以跟随作者想要交流的工作流程。\n如果你想让它成为一项富有成效的练习，你需要清楚地知道你首先需要获得什么样的信息，然后把重点放在这一方面。它可以是将您的结果与作者提出的结果进行比较，将您自己的分析放入上下文中，或者使用新发布的数据对其进行扩展。引用列表可以帮助你决定为什么这篇论文可能与你最相关，因为它可以让你第一次看到和你做过类似研究的同事可能是如何使用这篇论文的。--德国斯哥廷根马克斯·普朗克太阳能系统研究所科学家塞西莉亚·图比亚娜(Cecilia Tubiana)。\n如果我的目标只是抓住要点，我会阅读摘要，跳到图表上，浏览一下讨论的要点。我认为数字是这篇论文最重要的部分，因为论文的摘要和正文可以被操纵和塑造，以讲述一个引人入胜的故事。然后，任何我不清楚的事情，我都会去找方法论。\n如果我想更深入地研究这篇论文，我通常会完整地阅读它，然后还会阅读该小组之前的几篇论文或其他关于同一主题的文章。如果在陈述之后有我觉得特别有趣或有争议的提法，我也会查一查。如果我需要更多详细信息，我可以访问提供的任何数据存储库或补充信息。\n然后，如果作者的研究与我的相似，我会看看他们的相关数据是否与我们的发现相符，或者是否有任何不一致之处。如果有的话，我会想是什么原因造成的。此外，我想如果我们使用与他们相同的方法，在我们的模型中会发生什么，以及我们可以从中学到什么。有时，关注作者为什么决定以某种方式进行实验也很重要。作者是否使用了晦涩难懂的测试而不是常规测试，他们为什么要这样做？--哥伦布俄亥俄州立大学神经科学博士生杰里米·C·博尼格(Jeremy C.Borniger)。\n我总是从标题和摘要开始。这告诉我这是不是一篇我感兴趣的文章，以及我是否真的能够理解它-无论是科学上的还是语言上的。然后我读了引言，这样我就可以理解问题的框架，然后直接跳到数字和表格，这样我就可以对数据有一个感觉。然后，我阅读了讨论，以了解这篇论文是如何融入一般知识体系的。\n我注意承认局限性和正确推断数据。有些人比其他人更夸张他们的主张，这对我来说可能是一个危险信号。我还戴上了流行病学家的帽子，这样我就可以试着确保研究设计足以实际检验正在检验的假设。\n当我深入到论证框架、数字和讨论时，我也在思考哪些作品令人兴奋和新颖，哪些作品在生物学或逻辑上是相关的，哪些作品最受文献支持。我还会考虑哪些片段符合我先前的假设和研究问题。-凯文·博恩克(Kevin Boehnke)，密歇根大学安娜堡分校(University of Michigan，Ann Arbor)环境健康科学博士生。\n我的阅读策略取决于报纸。有时我会粗略地浏览一下，看看有多少可能是相关的。如果它直接适用于我当前的主题，我会仔细阅读这篇论文，除了可能已经熟悉的引言。但我总是想办法弄清楚是否有某些地方或数字需要我密切关注，然后我会去阅读结果和讨论中的相关信息。\n我还会检查是否有我可能感兴趣的推荐信。有时我很好奇，想看看该领域的哪些人--或者更有可能没有--被引用过，看看作者是否选择忽略这项研究的某些方面。我经常发现，补充数字实际上提供了最奇怪和最有趣的结果，特别是如果结果涉及作者没有引用的领域的部分，或者如果这些结果不清楚或对他们对整个故事的解释没有帮助。-加里·麦克道尔(Gary McDowell)，马萨诸塞州梅德福德塔夫茨大学发展生物学博士后研究员，波士顿学院访问学者。\n在阅读论文时，它帮助我有一个写作任务，这样我就成为一个积极的读者，而不是让我的眼睛盯着堆积如山的文本，只为了忘记我刚刚读过的所有东西。例如，当我阅读背景信息时，我会将每篇文章中关于特定主题的信息性句子保存在Word文档中。一路上，我会就我得到的新想法或需要进一步探索的问题写下评论。那么，以后我只需要阅读这份文件，而不是重新阅读所有的单篇论文。\n同样，当我想要弄清楚如何进行特定的实验时，我会在Excel中创建一个方便的表格，总结各种研究团队是如何进行特定的实验的。-莉娜·A·科鲁奇(Lina A.Colucci)，哈佛-麻省理工学院健康科学与技术项目博士生。\n我通常从摘要开始，这让我对这项研究的全部内容有了一个简短的快照。然后我读了整篇文章，把这些方法留到最后，除非我搞不懂结果，或者我不熟悉这些实验。\n结果和方法部分允许您将论文拆分，以确保其经得起科学严谨的考验。始终考虑所执行的实验类型，以及这些实验是否最适合解决所提出的问题。确保作者已包含相关且足够数量的控件。通常，结论也可以基于有限数量的样本，这限制了它们的意义。\n我喜欢把论文打印出来，并突出显示最相关的信息，所以在快速重新扫描时，可以提醒我要点。最相关的观点可能会改变你对研究主题的想法，或者给你新的想法和方向。--澳大利亚墨尔本莫纳什州立大学传染病系兼职研究员、伯内特研究所HIV神经发病实验室副主任拉克伦·格雷(Lachlan Gray)。\n我选择阅读的内容是基于与我的研究领域和事情的关系，这些领域和事情引起了很多兴趣和讨论，因为它们正在推动我们研究心理学或更广泛的科学的方式朝着新的方向发展。大多数时候，我试图从论文中得到的是方法论、实验设计和统计分析的问题，所以对我来说，最重要的部分首先是作者做了什么(方法)，其次是他们发现了什么(结果)。\n理解作者为什么认为他们在做这项研究(引言)以及他们认为结果意味着什么(讨论)也是很有趣的。当这是一个我很了解的领域时，我通常不太关心这些部分，因为它们往往反映了作者的理论偏好，也是思考方法和结果的多种方式之一。但当这是一个我知之甚少的领域时，我会仔细阅读这些内容，因为这样我就能学到很多关于该研究领域的假设和解释方法。--弗吉尼亚大学心理系教授、夏洛茨维尔开放科学中心(Center For Open Science)执行主任布莱恩·诺塞克(Brian Nosek)。\n首先，我读得很快：第一次阅读的目的很简单，就是看看这篇论文对我来说是否有趣。如果是的话，我会再读一遍，读得更慢，更注重细节。\n如果这篇论文对我的研究至关重要--如果它是理论性的--我会重塑这篇论文。在这种情况下，我只是从起点出发，然后自己做其他的事情，而不是看论文。有时这是一个极其缓慢的过程。有时我会因为作者写得不够清楚而生气，省略要点，纠缠于多余的胡言乱语。有时我被一张报纸电到了。-以色列雷霍沃特魏兹曼科学研究所(Weizmann Institute Of Science)物理学教授乌尔夫·伦哈特(Ulf Leonhardt)。\n我几乎总是先读摘要，只有当摘要表明论文对我有价值时，我才会继续看论文。然后，如果论文的主题是我很熟悉的，我通常会略读导言，阅读最后一段，以确保我知道论文中讨论的具体问题。然后我看数字和表格，阅读或浏览结果，最后浏览或阅读讨论。\n如果题目不是我很熟悉的，我通常会更仔细地阅读导言，以便把研究放在适合我的上下文中。然后我浏览一下数字和表格，看一下结果。--列克星敦肯塔基大学昆虫学系教授查尔斯·W·福克斯(Charles W.Fox)。\n重要的是要认识到，阅读论文时必须走捷径，这样我们才有时间完成其他工作，包括写作、进行研究、参加会议、教学和给论文评分。从博士生开始，我一直在阅读学术期刊文章和章节的结论和方法，而不是整本书。-温哥华不列颠哥伦比亚大学社会学系教授里玛·威尔克斯(Rima Wilkes)\n作为《科学》的主编，我必须时时刻刻阅读和理解我所在领域之外的论文。一般来说，我从相应的编辑摘要开始，这是为像我这样的人准备的：一个对一切都感兴趣但只深入一个领域的科学多面手。接下来，我检查一下是否有人在报纸上写了一篇新闻文章。第三，我检查是否有另一位科学家的观点。“透视”的主要目的是拓宽论文的信息，但作者往往在为非专业人士提炼文章精髓的同时，做了大量的工作。\n然后我处理摘要，它已经被写成广泛地传达给杂志的读者。最后，我转到论文本身，按顺序阅读导言、结论，浏览图表，然后通读论文。-马西娅·K·麦克纳特(Marcia K.McNutt)，科学期刊主编。\n我喜欢在网上阅读，这样我就可以很容易地将我不认识的单词剪切并粘贴到浏览器中，查看它们的意思。-麦克纳特。\n如果只是这篇文章中的几件事，我会记下来以后再查。如果我真的很难读完这篇论文，我会试着查阅评论文章或教科书章节，给我必要的背景知识来继续，我通常觉得这样做效率要高得多。\n有很多缩略语和行话可以是子领域特有的，所以我通常不会费力地浏览细节，除非是为了我自己的研究。但我总是试着从容不迫地真正理解正在使用的方法。--沙纳汉。\n我通常会立即停下来查找我不理解的东西。如果我听不懂一个关键的短语或行话，剩下的阅读可能就没有意义了。不过，这可能会产生一些适得其反的效果，因为我经常在查找完某样东西(X是什么？)后，陷入永无止境的兔子洞。哦，X影响Y.…。那么Y是什么呢？(ETC…)。。这可能会很有趣，因为你了解了一切是如何联系在一起的，但如果你的时间很紧，这可能会把你的注意力从手头的任务上移开。\n有时，一篇论文中的所有行话一开始就会使实验的整体观点变得模糊不清。在这种情况下，问问自己“作者试图回答什么问题？”然后您就可以确定他们是成功了还是失败了。-大卫·博尔尼格(Borniger)。\n这取决于不可理解的部分在多大程度上阻碍了我遵循主要思想。当我第一次读一篇论文时，我通常不会试图理解所有章节的所有细节。如果不能理解的部分对我的研究很重要，我会试着问问同事，甚至直接联系主要作者。回到最初的参考资料来获取所有的背景信息是最后的手段，因为时间可能是有限的，合作和个人联系可以更有效地解决特定的问题。-图比亚纳\n有时，你只需通读一篇论文，任何你不熟悉的术语到最后都会变得更加清晰。如果旅行非常繁重，那么停下来寻找更多的信息通常是可行的。我在谷歌上快速搜索主题、主题、方法、术语等。如果这是一篇非常密集的文章，有时需要通读几遍才能开始有意义。-灰色。\n我问自己的问题是，“为了从这篇论文中得到我需要的东西，我需要理解这意味着什么吗？”我现在阅读远远超出我专业知识的研究领域的文章，我通常不需要更多的实质性内容的肤浅知识。如果我对这篇论文什么都做不了，除非我理解不了那个深度，那我就会做更多的背景研究。-约翰·诺塞克(Nosek)。\n最近，我不得不阅读一些我专业领域以外的论文，其中有很多不熟悉的术语。在某些情况下，我可以直接从结果或图表中提取我需要的信息。在其他情况下，我使用谷歌搜索来定义论文中的术语和概念，或者阅读引用的参考文献以更好地理解所提出的观点。有时候，论文是如此难以理解(至少对我来说是如此)，以至于我懒得去读它们。-福克斯电视台。\n一直都是。如果论文与我试图解决的问题相关，你可以肯定论文中有一些关键的东西我不明白。“这种困惑不是威胁；而是机会。”(这句话的意思是：“如果论文与我试图解决的问题相关，你可以肯定论文中有一些我不明白的关键内容。)”我很无知，我需要变得不那么无知。这篇论文可能会对我有所帮助。\n同时，有些论文写得很糟糕，不值得努力。肯定有人把概念写得更清楚了，这样我就可以把困惑的重点放在理解实质上，而不是糟糕的语法上。-约翰·诺塞克(Nosek)。\n如果它不在我的子领域，如果它很长，如果它充满了技术术语，我尤其会感到不知所措。当这种情况发生时，如果可能的话，我会把它分成几块，然后在几天的时间里阅读它。对于很难的论文，坐下来和同事一起做也很有帮助。--约翰·沙纳汉(Shanahan)。\n是的，很多次。这就是为什么我制定了自己的阅读策略，通过与其他科学家交谈和反复试验。我也沮丧地举起双手，把那些令人不快的文件扔掉，再也不看了。-约翰·博恩克(Boehnke)。\n是的，在这种情况下，你必须意识到有些论文是几十位科学家多年工作的结果。期望在一个下午消化和理解其中的一切是一个牵强的想法。-大卫·博尔尼格(Borniger)\n我经常感到不知所措！但某些部分可能不需要像其他部分那样深入理解。你还需要知道你自己的限制：是否有一些你想要效仿的部分，但不是你的专业知识的一部分，可能会通过合作变得“容易接近”？--图比亚纳。\n如果我觉得报纸对我正在做的事情非常重要，我会暂时不看它，然后再看几次。但是，如果它太过压倒性，那么我就不得不把它放在一边，除非我联系的同事中有人能够解读它。--麦克道尔。\n如果有一篇开创性的论文我想要透彻地理解，我会想办法做一个关于它的期刊俱乐部式的演讲。对我来说，谈论某篇论文并回答问题是学习材料的最好方式。\n另外，找一个好的推荐人经理。门德利帮我做研究，读文学，写论文。-科鲁奇。\n一开始，新的学术读者发现它很慢，因为他们对正在阅读的内容没有参考框架。但是有很多方法可以把阅读作为一个创建精神图书馆的系统来使用，几年后，把纸放到你的精神书架上就变得很容易了。然后你可以快速浏览一篇论文，了解它的贡献。-迈克尔·威尔克斯(Wilkes)。\n要有耐心。不要害怕或羞愧地使用维基百科或其他更多的非专业受众来源，比如博客帖子来感受你的话题。问很多很多问题。如果你不能对论文有一个清晰的理解，可以和你的圈子里的人谈谈。如果你仍然不明白，理解这些概念真的很重要，给作者发邮件吧。--博恩克。\n请毫不犹豫地与更有经验的科学家交谈。让他们用你所理解的复杂论文的含义向你解释，这是在帮他们的忙。所有科学家都需要更多将复杂概念转化为通用术语的经验。-迈克尔·麦克纳特(McNutt)。\n如果可能的话，要经常阅读。尽量保存一个书目档案，里面有文章的摘要，任何重要的观点，甚至一两个数字，还有引用信息。注意不同的文章结构方式，注意不同的文风。这将帮助你形成一种既有效又独特的风格。--沙纳汉", "note_en": "Adam Ruben’s tongue-in-cheek column about  the common difficulties and frustrations of reading a scientific paper broadly resonated among  Science Careers readers. Many of you have come to us asking for more (and more serious) advice on how to make sense of the scientific literature, so we’ve asked a dozen scientists at different career stages and in a broad range of fields to tell us how they do it. Although it is clear that reading scientific papers becomes easier with experience, the stumbling blocks are real, and it is up to each scientist to identify and apply the techniques that work best for them. The responses have been edited for clarity and brevity.\n  I start by reading the abstract. Then, I skim the introduction and flip through the article to look at the figures. I try to identify the most prominent one or two figures, and I really make sure I understand what&#39;s going on in them. Then, I read the conclusion/summary. Only when I have done that will I go back into the technical details to clarify any questions I might have. -   Jesse Shanahan ,  master&#39;s candidate in astronomy  at Wesleyan University in Middletown, Connecticut\n I first get a general idea by reading the abstract and conclusions. The conclusions help me understand if the goal summarized in the abstract has been reached, and if the described work can be of interest for my own study. I also always look at plots/figures, as they help me get a first impression of a paper. Then I usually read the entire article from beginning to end, going through the sections in the order they appear so that I can follow the flow of work that the authors want to communicate.\n If you want to make it a productive exercise, you need to have a clear idea of which kind of information you need to get in the first place, and then focus on that aspect. It could be to compare your results with the ones presented by the authors, put your own analysis into context, or extend it using the newly published data. Citation lists can help you decide why the paper may be most relevant to you by giving you a first impression of how colleagues that do similar research as you do may have used the paper. -   Cecilia Tubiana , scientist at the Max Planck Institute for Solar System Research in  Göttingen, Germany\n If I’m aiming to just get the main points, I’ll read the abstract, hop to the figures, and scan the discussion for important points. I think the figures are the most important part of the paper, because the abstract and body of the paper can be manipulated and shaped to tell a compelling story. Then anything I’m unclear about, I head to the methodology.\n    If I want to delve deeper into the paper, I typically read it in its entirety and then also read a few of the previous papers from that group or other articles on the same topic. If there is a reference after a statement that I find particularly interesting or controversial, I also look it up. Should I need more detail, I access any provided data repositories or supplemental information.\n Then, if the authors&#39; research is similar to my own, I see if their relevant data match our findings or if there are any inconsistencies. If there are, I think about what could be causing them. Additionally, I think about what would happen in our model if we used the same methods as they did and what we could learn from that. Sometimes, it is also important to pay attention to why the authors decided to conduct an experiment in a certain way. Did the authors use an obscure test instead of a routine assay, and why would they do this? -   Jeremy C. Borniger , doctoral candidate  in neuroscience at Ohio State University, Columbus\n I always start with title and abstract. That tells me whether or not it’s an article I’m interested in and whether I’ll actually be able to understand it—both scientifically and linguistically. I then read the introduction so that I can understand the question being framed, and jump right to the figures and tables so I can get a feel for the data. I then read the discussion to get an idea of how the paper fits into the general body of knowledge.\n I pay attention to acknowledgement of limitations and proper inference of data. Some people stretch their claims more than others, and that can be a red flag for me. I also put on my epidemiologist hat so that I can try to make sure the study design is adequate to actually test the hypotheses being examined.\n As I go deeper into the argument framing, figures, and discussion, I also think about which pieces are exciting and new, which ones are biologically or logically relevant, and which ones are most supported by the literature. I also consider which pieces fit with my pre-existing hypotheses and research questions. -   Kevin Boehnke , doctoral candidate in environmental health sciences at the University of Michigan, Ann Arbor\n My reading strategy depends on the paper. Sometimes I start by skimming through to see how much might be relevant. If it is directly applicable to my current topic, I’ll read the paper closely, apart from the introduction that is probably already familiar. But I always try to figure out if there are particular places or figures that I need to pay close attention to, and then I go and read the related information in the results and discussion.\n I also check if there are references that I may be interested in. Sometimes I am curious to see who in the field has—or more likely has not—been referenced, to see whether the authors are choosing to ignore certain aspects of the research. I often find that the supplementary figures actually offer the most curious and interesting results, especially if the results relate to parts of the field that the authors did not reference or if they are unclear or unhelpful to their interpretation of the overall story. -   Gary McDowell , postdoctoral fellow in developmental biology at Tufts University in  Medford, Massachusetts, and visiting scholar at Boston College\n When reading papers, it helps me to have a writing task so that I am being an active reader instead of letting my eyes glaze over mountains of text only to forget everything I just read. So for example, when I read for background information, I will save informative sentences from each article about a specific topic in a Word document. I&#39;ll write comments along the way about new ideas I got or questions I need to explore further. Then, in the future, I’ll only need to read this document instead of re-reading all the individual papers.\n Likewise, when I want to figure out how to conduct a particular experiment, I create a handy table in Excel summarizing how a variety of research teams went about doing a particular experiment. -   Lina A. Colucci , doctoral candidate at the Harvard-MIT Health Sciences and Technology program\n I usually start with the abstract, which gives me a brief snapshot of what the study is all about. Then I read the entire article, leaving the methods to the end unless I can&#39;t make sense of the results or I&#39;m unfamiliar with the experiments.\n The results and methods sections allow you to pull apart a paper to ensure it stands up to scientific rigor. Always think about the type of experiments performed, and whether these are the most appropriate to address the question proposed. Ensure that the authors have included relevant and sufficient numbers of controls. Often, conclusions can also be based on a limited number of samples, which limits their significance.\n I like to print out the paper and highlight the most relevant information, so on a quick rescan I can be reminded of the major points. Most relevant points would be things that change your thinking about your research topic or give you new ideas and directions. -   Lachlan Gray ,  deputy head of the HIV Neuropathogenesis Lab at the Burnet Institute and adjunct research fellow in the Department of Infectious Disease at Monash  University in  Melbourne, Australia\n What I choose to read is based on relation to my research areas and things that are generating lots of interest and discussion because they are driving the way we do psychology, or science more widely, in new directions. Most often, what I am trying to get out of the papers is issues of methodology, experimental design, and statistical analysis. And so for me, the most important section is first what the authors did (methods) and second what they found (results).\n It can also be interesting to understand why the authors thought they were doing the study (introduction) and what they think the results mean (discussion). When it is an area that I know a lot about, I don&#39;t usually care much about these sections because they often reflect the authors&#39; theoretical predilections and one of many ways to think about the method and results. But when it is an area that I know very little about, I read these closely because then I learn a lot about the assumptions and explanatory approaches in that area of research. -   Brian Nosek , professor in the Department of Psychology at the University of Virginia and executive director of the Center for Open Science in Charlottesville\n First I read very fast: The point of the first reading is simply to see whether the paper is interesting for me. If it is I read it a second time, slower and with more attention to detail.\n If the paper is vital to my research—and if it is theoretical—I would reinvent the paper. In such cases, I only take the starting point and then work out everything else on my own, not looking into the paper. Sometimes this is a painfully slow process. Sometimes I get angry about the authors not writing clearly enough, omitting essential points and dwelling on superfluous nonsense. Sometimes I am electrified by a paper. -   Ulf Leonhardt , professor of physics at the Weizmann Institute of Science in Rehovot, Israel\n I nearly always read the abstract first and only continue on to the paper if the abstract indicates that the paper will be of value to me. Then, if the topic of the paper is one I know well, I generally skim the introduction, reading its last paragraph to make sure I know the specific question being addressed in the paper. Then I look at the figures and tables, either read or skim the results, and lastly skim or read the discussion.\n If the topic is not one I know well, I usually read the introduction much more carefully so that the study is placed into context for me. Then I skim the figures and tables and read the results. -   Charles W. Fox ,  professor in the Department of Entomology at the University of Kentucky in Lexington\n It is important to realize that shortcuts have to be taken when reading papers so that there is time left to get our other work done, including writing, conducting research, attending meetings, teaching, and grading papers. Starting as a Ph.D. student, I have been reading the conclusions and methods of academic journal articles and chapters rather than entire books. -   Rima Wilkes , professor in the Department of Sociology at the University of British Columbia, Vancouver\n As editor-in-chief of  Science, I have to read and comprehend papers outside of my field all the time. Generally, I start with the corresponding editors’ summaries, which are meant for someone like me: a science generalist who is interested in everything but dives deeply only into one field. Next, I check to see if someone wrote a News article on the paper. Third, I check to see if there is a Perspective by another scientist. The main goal of a Perspective is to broaden the message of the paper, but often the authors do a great job of extracting the essence of the article for non-specialists at the same time.\n Then I tackle the abstract, which has been written to broadly communicate to the readership of the journal. Finally, I move on to the paper itself, reading, in order, the intro, conclusions, scanning the figures, and then reading the paper through. -   Marcia K. McNutt , Editor-in-Chief, Science journals\n  I like to read online so that I can easily cut and paste words I don’t know into a browser to check what they mean.  - McNutt\n If it&#39;s only a few things in the article, I&#39;ll make a note to look them up later. If I am really struggling to proceed through the paper, I try to look up a review article or a textbook chapter to give me the necessary background to proceed, which I generally find much more efficient.\n There are a lot of acronyms and jargon that can be subfield-specific, so I usually don&#39;t wade through the details unless it&#39;s for my own research. But I always try to take my time to really understand the methods being used.  - Shanahan\n I will typically pause immediately to look up things I don’t understand. The rest of the reading may not make sense if I don’t understand a key phrase or jargon. This can backfire a bit, though, as I often go down never-ending rabbit holes after looking something up (What is X? Oh, X influences Y. … So what’s Y? etc…). This can be sort of fun as you learn how everything is connected, but if you’re crunched for time this can pull your attention away from the task at hand.\n Sometimes, all the jargon in a paper can cloud the whole point of the experiments in the first place. In such cases, it helps to ask yourself, “What question were the authors trying to answer?” Then you can determine whether they succeeded or failed. -  Borniger\n It depends on how much the non-understandable bits prevent me from following the main ideas. I usually do not try to understand all the details in all the sections the first time I read a paper. If non-understandable parts appear important for my research, I try to ask colleagues or even contact the lead author directly. Going back to the original references to get all the background information is the last resort, because time can be limited and collaborations and personal contacts can be much more efficient in solving specific problems.  - Tubiana\n Sometimes, you can just read through a paper and any terms you&#39;re not familiar with will become clearer by the end. If it is very heavy going, then stopping and seeking additional information is usually the way to go. I do a quick Google search on the topic, theme, method, jargon, etc. If it is a very dense article, sometimes it will require a few read-throughs before it all starts to make sense.  - Gray\n The question I ask myself is, “Do I need to understand what that means in order to get what I need from this paper?” I now read articles in research areas well outside of my expertise, and I often don&#39;t need more than superficial knowledge of the substantive content. If I can&#39;t do anything with the paper unless I don&#39;t understand that depth, then I do more background research. -  Nosek\n Lately, I have had to read a number of papers outside my area of expertise with a lot of unfamiliar jargon. In some cases, I am able to directly extract the information I need from the results or figures and tables. In other cases, I use Google searches to define terms and concepts in the paper or read the cited references to better understand the points being made. Occasionally, papers are so incomprehensible (to me, at least) that I don&#39;t bother reading them. -  Fox\n  All the time. If the paper is relevant to a problem I am trying to solve, you can be sure that there are key things in the paper that I do not understand. That confusion is not a threat; it is an opportunity. I am  ignorant; I need to become less ignorant. This paper may help me.\n Simultaneously, some papers are written terribly and are not worth the effort. Someone else has surely written about the concepts more clearly so that I can keep my confusion focused on understanding substance rather than poor grammar. -  Nosek\n I especially get overwhelmed if it&#39;s not in my subfield, if it&#39;s long, and if it&#39;s full of technical jargon. When this happens, I break it down into chunks and will read it over the course of a few days, if possible. For really difficult papers, it also helps to sit down and work through it with a colleague. -  Shanahan\n Yes, many times. This is why I developed my own reading strategies, by talking to other scientists and by trial and error. I also have thrown up my hands in frustration and tossed the offending papers away, never to read them again. -  Boehnke\n Yes, and in these cases you have to realize that some papers are the result of years of work by dozens of scientists. Expecting to digest and understand everything in it in one afternoon is a far-fetched idea. -  Borniger\n I have often felt overwhelmed! But certain sections might not need as deep an understanding as others. You also need to know your own limits: Are there some parts of the paper that you would like to emulate but are not part of your expertise and might become “accessible” through collaborations? -  Tubiana\n If I feel the paper is very important to what I’m doing, I’ll leave it a while and go back to it again a couple of times. But if it’s too overwhelming, then I have to leave it aside, unless someone among the colleagues I have contacted has been able to interpret it.  - McDowell\n  If there is a seminal paper I want to thoroughly understand, I find some way to give a journal club-style presentation about it. Speaking about a particular paper and answering questions is the best way for me to learn the material.\n Also, get a good reference manager. Mendeley helps me do my research, read literature, and write papers.  - Colucci\n At the beginning, new academic readers find it slow because they have no frame of reference for what they are reading. But there are  ways to use reading as a system of creating a mental library, and after a few years, it becomes easy to slot papers onto your mental shelves. Then you can quickly skim a paper to know its contribution. -  Wilkes\n Be patient. Don’t be afraid or ashamed to use Wikipedia or other, more lay-audience sources like blog posts to get a feel for your topic. Ask many, many questions. If you can’t get a clear understanding of the paper, talk with people in your circle. If you are still confused and it&#39;s really important to understand the concepts, email the authors.  - Boehnke\n Don’t hesitate to talk to more experienced scientists. You will be doing THEM a favor by having them explain to you in terms you understand what a complex paper means. All scientists need more experience translating complex concepts into common terms. -  McNutt\n If at all possible, read often. Try to keep a bibliography file with a summary of the article, any important points, even a figure or two, along with citation information. Pay attention to different ways of structuring an article, and pay attention to different styles of writing. This will help you develop a style that is effective and also unique.  - Shanahan", "posttime": "2020-11-04 14:59:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "论文,阅读,scientific", "title": "如何(认真)阅读科学论文", "title_en": "How to (Seriously) Read a Scientific Paper", "transed": 1, "url": "https://www.sciencemag.org/careers/2016/03/how-seriously-read-scientific-paper", "via": "", "real_tags": ["论文", "阅读"]}, {"category": "", "categoryclass": "", "imagename": "ab2670d11fe360d4afb32dd57ec37a94.gif", "infoid": 1033131, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我们之前的博客文章中，我们介绍了使用硅光子学来执行大规模线性算术运算的想法，其速度和效率比使用数字电子技术更快、更高效。您可能还记得，我们的系统使用许多称为马赫-曾德尔干涉仪(MZI)[1]的相同器件来实现基本的线性运算，即2x2矩阵乘法，由此可以构建更大的矩阵乘法。在这篇博客文章中，我们的目标是更详细地描述MZI是如何工作的，并希望阐明硅光子学相对于数字电子学在执行算术方面的一些优势。\n我们首先考虑可用于标量乘法的MZI。基本布局如下所示。单输入波导对称分裂成干涉仪的两臂。当光沿着每一臂行进时，电磁波在被重新组合成单个输出波导之前，会拾取一个(通常)依赖于路径的相位。我们将此配置称为“标量MZI”。\n标量MZI可以分为三个部分：两个Y结和一个差分相移。在对整个系统进行分析之前，让我们先了解一下这些子系统。\nY结是具有单个端口(A)的3端口集成光学器件，它平等地耦合到一对端口(B和C)。一个简单的版本可以通过将直波导连接到左转和右转波导弯头来实现，如下所示。\n当将光送入端口A时，光信号经历如下传输矩阵所描述的变换：\n为了得到输出波导模式(B和C)的光场振幅，我们可以将输入场振幅乘以传输矩阵。假设输入振幅为1，我们获得相同的输出场振幅：\n不出所料，端口A的输入光被简单地一分为二，每个输出波导中都有一半的光功率(光功率与场幅的平方成正比)。在这种情况下，灯光的行为非常类似于管道系统中的水。\n现在让我们检查一下当我们在端口B输入光时会发生什么。通过光学互易性(光学中的一种原理，即光可以沿着同一路径双向传播--想想您眼镜的镜片)，反向通过它的传输矩阵仅仅是正向传输矩阵的转置：\n请注意，只有一半的输入功率到达了输出，其余的似乎魔术般地消失了(实际上它是从系统中辐射出来的)。在这种情况下，灯光的波动性质使其行为与经典流体(管道中的水)不同，如下面的模拟所示。\n现在让我们考虑最后一种情况，在这种情况下，光同时发射到端口B和端口C。在这种情况下，我们可以将输入场振幅分别任意设置为b和c。同样，我们将输入幅度向量乘以传输矩阵，以得到：\n这个最终的Y结结果说明了光学中一个称为叠加的基本概念：系统对多个激发源的响应就是对每个单独源的响应的总和(或叠加)。这是光学执行线性算术的主要优点之一：作为系统固有线性的直接结果，加法就像组合(例如干涉)两个光学模式一样简单。此外，加法操作实际上是免费的：不需要功耗！请注意，输入光的生成确实需要功耗，但这不应包括在加法操作的成本中，正如本文在接近尾声时所讨论的那样。\n没有差分相移部分的标量MZI是将所有输入光传输到输出的无用器件。在算术运算方面，它可以被认为是将一个数字分成相等的两个部分，然后再将这两个一半相加在一起。然而，正如我们将看到的，在两个臂之间引入相移导致传输到输出模式的光功率改变。相移部分的传输矩阵可以写成：\n在两个手臂之间引入相位差的方法有很多种，但它们基本上都是基于延迟一条手臂相对于另一条手臂的波前。\n也许最简单的方法是制作不同长度的手臂。因为每个臂中的波以相同的速度传播，所以较长臂中的波相对于较短臂中的波会延迟，从而产生相对相位差：\n其中n是波导的折射率，ΔL是两臂之间的长度差，λ是光的自由空间波长。\n系统的传输矩阵是通过将各组成部分的传输矩阵相乘得到的(令人困惑的是，假设光从左到右传播，传输矩阵以与元素相反的空间顺序写出)。因此，标量MZI的合成转移矩阵可以计算为：\n因此，标量MZI的输出仅仅是其输入乘以标量值(cos(φ))。这说明了线性算术所需的第二个关键功能：标量乘法。再说一次，就像加法一样，使用光学进行标量乘法不需要耗散能量！\n可编程相移通常依赖于改变引导材料中的波速，即其折射率，而不是依赖于光路长度。根据相关材料的不同，有几种常见的方法来实现这一点。这些效应包括热光效应，其中材料的折射率随温度变化；等离子体色散效应，其中半导体的准费米能级(电子和空穴的浓度)改变其折射率；以及电光效应，其中向材料施加电场会引起其折射率成比例的变化。在热光效应中，材料的折射率随温度而变化；等离子体色散效应，其中半导体的准费米能级(电子和空穴的浓度)改变其折射率；以及电光效应，其中向材料施加电场会导致其折射率成比例变化。使用上述效果中的任何一种都能够实现可编程相位差。\n现在让我们考虑一个具体的例子：假设相位差部分中的波导是由电光材料制成的。在这种情况下，可以使用施加在每个臂上的相反电场来诱导臂之间的差分相位。这些电场可以在单个电压下获得，如下图所示。\n其中c是材料的电光系数，d是电极之间的距离，L是电光部分的长度，λ是光的自由空间波长。对于输入场幅度A，MZI的输出场幅度由下式给出：\n从这个例子中我们可以看到，由MZI实现的标量乘法器可以被编码成电压。这一点很重要，因为它允许使用高速电子设备对电光乘法器的值进行编程，从而实现完全集成的可重构解决方案。虽然改变乘数值需要电荷通过电势传输并因此需要能量耗散，但是如果在这种情况下电光材料是不导电的，则保持静态乘数值不需要。\n现在我们已经了解了如何使用“标量MZI”进行标量乘法，现在我们将把它修改为“向量MZI”来执行矩阵-向量乘法。原理图版本如下所示：\n同样，我们可以将系统分成3个子部分，但这次我们用50：50的定向耦合器取代了y形结。\n定向耦合器是具有两对端口(A/B和C/D)的4端口集成光学器件。一对中的每个端口都耦合到另一对中的两个端口，但不耦合到其伙伴。因此，例如，如果光输入到端口A和B，则端口C和D的输出幅度将分别是输入幅度的线性组合。这样的器件是通过将两个波导拉近以使它们彼此渐变耦合来实现的，如下所示：\n无损定向耦合器的一种形式可以由2x2么正传递矩阵表示：\n与标量MZI的情况一样，我们可以通过将子组件的传递矩阵按正确的顺序相乘来获得系统的传递矩阵：\n请注意，在这种情况下，结果矩阵是2x2，而不是标量版本中的1x1。与其组件定向耦合器非常相似，输出场幅度是输入场幅度的线性组合；实际上，将矢量MZI视为可编程定向耦合器是正确的。该设备的算术运算是将输入幅度向量与其传递矩阵相同地相乘。正如许多读者会从线性代数入门课程中回忆起的那样，矩阵乘法只是一系列有组织的标量乘法和加法：这两种基本运算我们已经确定在电光电路中是无能量的。毫不奇怪，这种复合操作也可以在零功耗的情况下执行。\n通过将矢量和标量MZI与简单的移相器串联到合适的网络中，可以实现任意矩阵乘法，并且可以在不消耗任何功率的情况下执行乘法。应当注意，有必要消耗网络的输入和输出处的功率来编码输入向量(这包括光产生)，并解码输出向量。然而，将N×N矩阵乘以N×1矢量只需要O{N}个编码/解码操作，而需要O{N²}个标量乘法和加法。数字电子需要耗散能量来执行标量乘法和加法。从光学领域所需的耗能操作的可伸缩性大大降低的情况来看，应该清楚地看到，当N&gT；α；α时，光学设备的效率总是更高的，这是有价值的。\nLightMatter的一个挑战是设计我们的系统，既要降低α的值，又要增加N的值，以便我们可以为其构建实际的系统。通过降低α的价值，我们将拓宽光计算具有吸引力的应用范围，并提高我们在降低与计算相关的能源成本方面的影响力。通过增加N的可达值，我们将尽我们的一份力量来扩展人类能力的范围，使计算能够达到常规数字机器无法实现的规模！", "note_en": "In our  previous blog posts, we introduced the idea of using silicon photonics to perform large-scale linear arithmetic operations faster and more efficiently than can be done with digital electronics. As you may recall, our systems make use of many identical devices called Mach-Zehnder interferometers (MZIs)  [1] to implement a basic linear operation, a 2x2  matrix multiplication, from which much larger matrix multiplications can be built up. In this blog post, we aim to follow up with a more detailed description of how MZIs work, and hopefully elucidate some of the advantages of silicon photonics over digital electronics for performing arithmetic.\n  We first consider an MZI that can be used for scalar multiplication. A basic layout is shown below. A single input waveguide is split symmetrically to become two arms of the interferometer. As the light travels down each arm, the electromagnetic waves pick up a phase, which is (in general) path-dependent, before being recombined into a single output waveguide. We’ll refer to this configuration as a “scalar MZI.”\n  A scalar MZI can be divided into 3 sub-sections: two Y-junctions and a differential phase-shift. Before we go through the analysis of the full system, let’s first get acquainted with these sub-systems.\n  A Y-junction is a 3-port integrated optical device with a single port (A), coupled equally to a pair of ports (B and C). A simple version can be implemented by connecting a straight waveguide to both left- and right-turning waveguide bends as shown below.\n  When sending light into port A, the light signal undergoes a transformation that can be described by the following transfer matrix:\n  In order to obtain the optical field amplitudes in the output waveguide modes (B and C), we can multiply the input field amplitude by the transfer matrix. Assuming the input amplitude to be 1, we obtain identical output field amplitudes:\n  Much as one might expect, the input light at port A is simply split in two, with half of the optical power in each of the output waveguides (optical power is proportional to the magnitude squared of the field amplitude). In this situation, the light behaves much like water in a system of pipes.\n Let us now examine what happens when we input light at port B. By optical reciprocity (a principle in optics that says light can travel both directions down the same path — think about the lenses of your glasses), the transfer matrix for passing backwards through it is simply the transpose of the forward transfer matrix:\n    Note that only half of the input power made it to the output, and the remainder seems to have magically disappeared (in reality it was radiated out of the system). In this case, the wave nature of light causes it not to behave like a classical fluid (water in a pipe), as can be seen in the simulation below.\n  Let’s now consider one final situation, wherein light is launched into both port B and port C. In this case, we can arbitrarily set the input field amplitudes to  b and  c respectively. Once again, we multiply the input amplitude vector by the transfer matrix to obtain:\n  This final Y-junction result illustrates a fundamental concept in optics known as superposition: a system’s response to multiple excitation sources is simply the sum (or superposition) of the responses to each individual source. This is one of the main advantages of optics for performing linear arithmetic: as a direct result of the inherent linearity of the system, addition is as simple as combining (e.g. interfering) two optical modes. Further,  the addition operation is effectively free: no power consumption is required! Note that generation of the input light does require power consumption but this should not be included in the cost of the addition operation, as is discussed toward the end of this post.\n  The scalar MZI without a differential phase shift section is a useless device that transmits all input light to the output. In terms of arithmetic operations, it can be thought of as dividing a number into equal halves and subsequently adding those two halves together again. However, as we will see, the introduction of a phase shift between the two arms results in a change in the optical power transmitted to the output mode. The transfer matrix for the phase shift section can be written as:\n  There are many ways of introducing a phase difference between the two arms, but they are all essentially based on delaying the wave-fronts in one arm versus the other.\n Perhaps the simplest method is to make the arms of different length. Because the waves in each arm travel at the same speed, those in the longer arm are delayed with respect to those in the shorter arm, resulting in a relative phase difference:\n  where  n is the refractive index of the waveguide,  ΔL is the length difference between the two arms, and  λ is the free-space wavelength of the light.\n  The system’s transfer matrix is obtained by multiplying the transfer matrices of the component parts (confusingly, the transfer matrices are written out in the opposite spatial order of the elements assuming the light travels from left to right). The resultant transfer matrix for the scalar MZI can thus be calculated as:\n  The output of the scalar MZI, then, is simply its input multiplied by a scalar value (cos(φ)). This illustrates the second key functionality required for linear arithmetic: scalar multiplication. And once again,  just like addition, scalar multiplication using optics does not require the dissipation of energy!\n   Rather than relying on optical path-length, programmable phase shifts typically rely on changing the speed of the waves in the guiding material, i.e. its refractive index. Depending on the material in question, there are several common ways of accomplishing this. These include the thermo-optic effect, in which the refractive index of a material changes with temperature; the plasma dispersion effect, where the quasi-Fermi level of a semiconductor (concentration of electrons and holes) changes its refractive index; and the electro-optic effect, wherein application of an electric field to a material induces a proportional change in its refractive index. Using any one of the above effects enables the implementation of a  programmable phase difference.\n Let’s now consider a specific example: let the waveguides in the phase-difference section be made of an electro-optic material. In this case, opposite electric fields applied across each arm can be used to induce a differential phase between the arms. These electric fields can be obtained with a single voltage, as illustrated below.\n    where  c is the electro-optic coefficient of the material,  d is the distance between the electrodes,  L is the length of the electro-optic section, and  λ is the free-space wavelength of the light. For an input field amplitude A, the output field amplitude of the MZI is given by:\n  From this example we can see that the scalar multiplier implemented by an MZI can be encoded in a voltage. This is an important point as it allows the value of electro-optic multipliers to be programmed using high-speed electronics, enabling a fully integrated reconfigurable solution. Though changing the multiplier value requires the transport of charges through an electric potential and thus energy dissipation, maintaining a static multiplier value does not, provided in this case that the electro-optic material is non-conductive.\n  Having now seen how the “scalar MZI” can be used for scalar multiplication, we will now modify it into a “vector MZI” to perform matrix-vector multiplication. A schematic version is shown below:\n  Once again, we can divide the system into 3 sub-sections, but this time we replace the y-junctions with 50:50 directional couplers.\n  Directional couplers are 4-port integrated optical devices with two pairs of ports (A/B and C/D). Each port in a pair is coupled to both ports in the other pair, but not to its partner. So if, for example light is input into ports A and B, the output amplitudes at ports C and D will each be linear combinations of the input amplitudes. Such devices are realized by bringing two waveguides into close proximity so that they are evanescently coupled to one another, as shown below:\n  A version of a lossless directional coupler can be represented by the 2x2 unitary transfer matrix:\n   As in the case of the scalar MZI, we can obtain the transfer matrix of the system by multiplying the transfer matrices of the sub-components in the correct order:\n  Note that in this case the resulting matrix is a 2x2, rather than a 1x1 as in the case of the scalar version. Much like its component directional couplers, the output field amplitudes are linear combinations of the input field amplitudes; in fact it is correct to consider the vector MZI to be a programmable directional coupler. The arithmetic operation of the device is identically multiplication of the input amplitude vector by its transfer matrix. As many of those reading will recall from introductory linear algebra courses, matrix multiplication is simply an organized series of scalar multiplications and additions: the two basic operations we have already identified as energy-free in electro-optic circuits.  It should come as no surprise that this compound operation can also be performed with zero power consumption.\n By stringing vector and scalar MZIs into a suitable network along with simple phase shifters,  arbitrary matrix multiplication can be implemented, and again the multiplication can be performed without consuming any power. It should be noted that it is necessary to consume power at the inputs and outputs of the network to encode the input vectors (this includes light generation), and decode the output vectors. However multiplying an  N x  N matrix by an  N x 1 vector requires only O{ N} encode/decode operations, while requiring O{ N²} scalar multiplications and additions.  Digital electronics require the dissipation of energy to perform scalar multiplications and additions. From the dramatically lower scaling of energy-consuming operations required in optics, it should be clear that there is some value α for which when  N &gt; α, optics will always be more efficient.\n A challenge here at Lightmatter is engineering our systems to both reduce that value of α,  and increase the value of  N for which we can build practical systems. By reducing the value of α, we will broaden the range of applications for which optical computing is attractive and increase our impact on reducing the energy costs associated with computing. By increasing the attainable value of  N, we will do our part to extend the reach of human capability, enabling computation at scales unachievable with conventional digital machines!", "posttime": "2020-11-04 14:59:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "矩阵,components", "title": "用于矩阵处理的光学元件", "title_en": "Optical Components for Matrix Processing", "transed": 1, "url": "https://medium.com/lightmatter/optical-components-for-matrix-processing-73687cdd7aa6", "via": "", "real_tags": ["矩阵"]}, {"category": "", "categoryclass": "", "imagename": "56fce0e9ee8b8abb7907a8d470d9c4d2.jpeg", "infoid": 1033130, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook Inc.。已经澄清了其规则，并表示不会在计票前悬挂特朗普总统或任何其他在关键州宣布候选人获胜的个人的旗帜。\n在给华尔街日报的一份声明中，该公司表示，其针对在其网站上过早宣布胜利的现有政策只适用于总统选举的整体结果，而不是个别州。\nFacebook还没有详细说明这项政策的细节，周二晚些时候，随着势均力敌的总统竞选看起来越来越像是在一两个有争议的州进行投票，这项政策变得越来越重要。\n在特朗普竞选团队和佛罗里达州州长罗恩·德桑蒂斯(Ron DeSantis)宣布特朗普总统在该州获胜后，这家社交媒体巨头发表了这份声明，当时主要媒体报道特朗普在佛罗里达州领先，但尚未宣布胜利者。\nFacebook在华尔街日报对一些共和党人在平台上宣布佛罗里达州获胜提出质疑两个小时后宣布了这一澄清，这将允许任何一位候选人或他们的主要支持者在选举结果实际存在争议的情况下宣布关键州的获胜者。\n斯坦福互联网观察站(Stanford Internet Observatory)主任、Facebook前首席安全官亚历克斯·斯塔莫斯(Alex Stamos)表示：“一项不适用于单个州的政策，在一场可能归结为一个州的竞争中用处不大。”\n在大选前的几个月里，首席执行长扎克伯格(Mark Zuckerberg)说，竞选平台不会允许与正式计票结果不符的说法。扎克伯格说，虽然该公司不会直接质疑这样的说法，但它将提供一个“信息性标签”，指出投票仍在统计中。该公司进一步表示，只有在主要媒体和决策台达成共识后，才会召集比赛。\n在周二的声明中，该公司表示，它只会为用户过早宣布国家竞赛完全结束的帖子贴标签。\n该公司表示，Facebook的计划“是为了解决人们对总统竞选最终结果的过早呼声”。“对于其他帖子，我们会在投票信息中心贴上标签，把人们引导到这些帖子上，在那里他们可以看到叫了什么比赛。”", "note_en": "Facebook Inc. has clarified its rules and said it won’t flag President Trump or any other individual who declares victory for a candidate in battleground states before votes are counted.\n In a statement to The Wall Street Journal, the company said its existing policy against premature declarations of victory on its site was only ever meant to apply to the overall result of the presidential election, not individual states.\n Facebook hadn&#39;t spelled out that detail of the policy, which took on increasing significance late Tuesday as the tight presidential race looked increasingly as if it might come down to the vote in one or two contested states.\n The social-media giant issued the statement after the Trump campaign and Florida Gov. Ron DeSantis declared President Trump the winner in that state, at a time when major media outlets were reporting that Trump was ahead in Florida but hadn’t declared a victor.\n The clarification--which Facebook announced two hours after the Journal raised questions about some Republicans posting on the platform declaring a Florida victory--would allow either candidate or their prominent supporters to proclaim the winner of battleground states while the outcome is actually in dispute.\n “A policy that doesn&#39;t apply to individual states is not very useful in a contest that might come down to one state,” said Alex Stamos, director of the Stanford Internet Observatory and former chief security officer at Facebook.\n For months ahead of the election, Chief Executive Mark Zuckerberg said the platform wouldn’t allow claims at odds with the formal counting results. While the company wouldn’t challenge such claims directly, Mr. Zuckerberg said, it would provide an “informational label” noting that votes were still being counted. The company further said it intended to only call races after a consensus had been reached among major media outlets and decision desks.\n In its statement on Tuesday, the company said it would only label posts in which users prematurely declare the national race to be entirely over.\n Facebook’s plan “is to address premature calls for the final result of the presidential race,” the company said. “For other posts we are applying labels directing people to them in the Voting Information Center where they can see what races have been called.”", "posttime": "2020-11-04 14:41:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,澄清,clarifies,宣布", "title": "Facebook澄清其规则并表示将允许个别州提前宣布胜利，但将禁止举行整体选举", "title_en": "Facebook clarifies its rules and says it will allow premature victory declarations in individual states but will prohibit for overall elections", "transed": 1, "url": "https://www.wsj.com/livecoverage/trump-biden-election-day-2020/card/wrv7kdHPVcKjdVnHyZ65", "via": "", "real_tags": ["facebook", "澄清", "clarifies", "宣布"]}, {"category": "", "categoryclass": "", "imagename": "c44b51158a06f0cd9523be9b3de36f6c.jpg", "infoid": 1033129, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特朗普在推特上写道：“我们赢了很多，但他们试图窃取选举。”他说：“我们绝不会让他们这样做。投票结束后不能投票！“。\nTwitter迅速对这条推文采取行动，将其置于警告后面，并添加了一个错误信息标签。该公司在一条推文中解释了其行动，称总统的信息包含“关于选举的潜在误导性说法”。\n我们在@realDonaldTrump的一条推文上发出警告，称其对选举做出了潜在的误导性声明。这项行动符合我们的公民廉洁政策。更多信息请点击此处：https://t.co/k6OkjNXEAm。\n在截至11月的几个月里，社交媒体公司开始为2020年大选的不同寻常情况及其令人担忧的错误信息生态系统制定新政策。由于与大流行相关的邮寄投票大幅增加，预计2020年选举之夜的结果将比过去几年更加模糊，到目前为止，事实证明这是正确的。\n推特还在9月份的政策声明中表示，将删除或贴上任何煽动非法活动的推文标签，以“防止权力和平移交或有序继承”。\n虽然Twitter限制的推文仍然在线，但它们被放在一条警告消息后面，用户必须先点击才能查看他们的内容。受限制的推文也被禁止转发、点赞和评论，从而减少了它们的覆盖范围。", "note_en": "“We are up BIG, but they are trying to STEAL the Election,” Trump  tweeted. “We will never let them do it. Votes cannot be cast after the Polls are closed!”\n Twitter   took action against the tweet quickly, placing it behind a warning and adding a misinformation label. The company explained its actions in a tweet, stating that the president’s message contained a “potentially misleading claim about an election.”\n  We placed a warning on a Tweet from  @realDonaldTrump for making a potentially misleading claim about an election. This action is in line with our Civic Integrity Policy. More here:  https://t.co/k6OkjNXEAm\n Social media companies began crafting new policies for the unusual circumstances of the 2020 election and its worrisome misinformation ecosystem in the months leading up to November. Due to a huge spike in mail-in voting related to the pandemic, results were expected to be more ambiguous on election night in 2020 than in past years and so far that’s proven true.\n Twitter also said in a September policy announcement that it would remove or label any tweets that incite unlawful activity in order to “prevent a peaceful transfer of power or orderly succession.”\n While tweets that Twitter restricts remain online, they’re placed behind a warning message that users must first click through in order to view their content. Restricted tweets also have their retweets, likes and comments disabled, reducing their reach.", "posttime": "2020-11-04 14:22:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推特,选举,restricts,推文", "title": "\n推特限制特朗普的推文引发人们对敌人会“窃取”选举的担忧", "title_en": "\n\t\t\t\tTwitter restricts Trump’s tweet raising fears that foes would ‘steal’ the election\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/03/trump-tweet-steal-election-vote-by-mail/", "via": "", "real_tags": ["推特", "选举", "restricts", "推文"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033128, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当杰妮卡·安德森(Jenica Anderson)和斯蒂芬·杜瓦尔(Stephan DuVal)在MoDamily.com上点击对方的在线个人资料时-口号是“家庭的新方式”-两人都没有寻找浪漫。他们都快30岁了，他们简短的简历表明，他们在健康和教育方面有着相似的观点，有稳定的收入，并在寻找同样的东西：一个没有浪漫色彩的伴侣来抚养孩子。共同的父母。\n现年38岁的安德森是一名来自美国蒙大拿州的地质学家，她在2019年春天与来自加拿大温哥华的杜瓦尔(DuVal)进行了第一次电话交谈，当时她已经与10名不同的男性进行了匹配并交谈，主要是通过所谓的交配网站-为想要孩子而没有浪漫关系的人提供的婚介网站。他们的谈话很快就开始持续到深夜，那年6月，她飞去和他共度周末。他们聊天，徒步旅行，一起跳进湖里。37岁的摄影操作员杜瓦尔(DuVal)说：“感觉就像是在约会。”“除了我们可以完全坦诚地说想很快要个孩子，而不是像第一次约会那样傻乎乎的和调情。”你们正在寻求实现一个共同的目标。“。\n在一个生物科学和平等权利有多种方式组建家庭的世界里，柏拉图式的共同育儿-决定与你没有恋爱关系的人生孩子，在大多数情况下，选择不一起生活-仍然是一个相对较新的现象。\n随着卵子和精子捐赠在同性恋社区得到了很好的确立，它在异性单身人群中正在上升。数以万计的人注册了婚介网站，每年的费用约为100 GB。在2008年在欧洲推出的Coparents.co.uk上，其全球12万会员中有三分之二是异性恋。MoDamly于2012年在洛杉矶成立，拥有3万名国际会员，其中80%是异性恋，2000名是英国人。总部位于英国的竞争对手PollenTree.com拥有5.3万会员，女性与男性的比例为60/40，并将其国内市场列为最强劲的市场。在封锁期间，后两个网站报告的流量激增了30%-50%。\n苏珊·戈伦博克教授是剑桥大学家庭研究中心主任，也是“我们是家庭”(We Are Family)一书的作者，这本新书考察了核心单元以外的结构中儿童的福祉。自20世纪80年代以来，她一直在研究新的家庭形式。她研究了通过试管受精、精子和卵子捐赠和代孕创建的家庭，以及选择的女同性恋母亲家庭、同性恋父亲家庭和单身母亲。\nGolombok的团队将注意力转向选择性共同育儿，这是2015年的一种新兴趋势。他们现在正在跟踪50个家庭，他们认为这是世界上第一个考虑到这一安排对儿童影响的研究。\n她表示：“人们逐渐意识到，这是一种正在加速发展的新现象。对于我们来说，主要的问题是，这种没有浪漫关系的父母之间的关系是如何发展的，彼此之间和孩子之间是如何发展的？关系破裂的比率是高还是低？早期的研究结果表明，父母之间在育儿问题上的沟通和合作似乎有很大的不同。\n她说，父母之间关系的质量，以及他们的亲密程度，对孩子的福利有很大的影响。“不过，除去浪漫的包袱甚至可以创造一个更稳定的环境，这是有可能的。”\n安德森已经有了一个年幼的儿子-在他父亲一岁的时候，她就和他父亲离婚了。她在2019年初注册了两个网站。她想要在孩子的生活中有两个父母能带来的机会。然而，她住在一个小社区，那里没有人愿意加入共同育儿安排，并且已经考虑并解雇了她以前约会过的男人。\n“我真的不想要浪漫的联系；我认为这会让事情变得复杂，”她说。“我看到传统的食谱行不通。(斯蒂芬和我)有一个共同的方向感--养育一个幸福的孩子，让他度过一生。我的前任和我是非常友好的共同父母，这向我展示了这样做的真正力量。我想利用对孩子有好处的东西-功能动态和稳定的生活。斯蒂芬和我问自己，‘我们能成为盟友，确保任何未来的孩子都能得到最好的吗？’如果这仅仅是关于育儿，我们可以保持务实。我想和一个想做一个溺爱我的父亲的人一起发展我的家庭，而不仅仅是给我生个孩子。“。\n她的父母并不是很信服。“我很肯定(他们)因为我的所作所为而睡不着觉。我父亲担心财政问题。在某种程度上，他们可能担心道德问题。“。\n在800多英里之外，杜瓦尔也订阅了MoDamly，因为他努力去见一个和他一样想要孩子的人，这让他感到沮丧。“我想要一个孩子，让生活更有意义；我认识的很多人都嫁给了自己的工作，”他说。“我希望，也许，我最终会找到浪漫，但(对我来说)是时候组建一个家庭了。”\n在与安德森联系之前，他还遇到了另外三场可能的比赛。他钦佩她的勇敢、育儿方式和家庭纽带。“最大的恐惧是我会和一个被证明是一个可怕的人类的人配对。但我的恐惧很快就消失了。我们谈了很多关于养育孩子的情景。我们经常意见一致。我们谈到了我们自己的生活，是什么塑造了我们，谈了过去的关系。“。\n安德森被他的冒险精神和灵活性所吸引。她说：“如果我们遇到不可预测的事情，(我觉得)他可以适应。他有很好的父亲气质。我很快就对这种真正不为人知的、非常规的合作关系充满信心。“。\n到6月的那个周末结束时，他们找到了想要为人父母的人，回到了自己的生活中。到了9月份，他们自然而然地怀孕了，并且怀孕了。安德森说：“在这方面，我认为怀孕是临床上的，但一旦我们在一起度过了一段时间，我们就决定自然地尝试。”“我记录了我的排卵情况，我们在西海岸的一次公路旅行中怀孕了。”(大多数共同育儿伙伴要么发生性行为，要么选择在家中进行人工授精的“火鸡膏”方法。一些人选择试管受精。)。\n当Golombok的团队注意到这个新的家庭单元的崛起时，奥利弗和凯特正在想象他们自己的家庭可能会是什么样子。奥利弗在他以前的恋情中多年来一直想要个孩子。在他40多岁的时候，这段关系结束了，但他想成为父亲的愿望并没有结束，他登录了总部位于伦敦的网站The Stork，自从五年前开始为“准备为人父母的人”牵线搭桥以来，该网站已经负责了15个婴儿。\n奥利弗说：“我的很多朋友都有孩子，结果却以灾难性的、代价高昂的离婚收场，只是不定期地见他们的孩子。”“我想最好还是和别人好好相处，不要浪费时间，生个孩子。”\n他被介绍给凯特，他们在通过该机构进行的兼容性测试中获得了93%的分数，该机构位于市场的高端，对其定制的会员套餐收取GB4k-GB10k的费用。这些计划包括A计划，为希望找到浪漫爱情的未来父母制定的计划，以及B计划，为那些只想共同为人父母的人制定的计划。奥利弗和凯特开始了A计划，但在几次约会后，一起上床后，很快就转向了柏拉图式的选择。\n奥利弗说：“没有什么是浪漫的。”“但是我们养育孩子的原则是一样的--乐趣和自发性；不要太放纵；教育很重要。感觉很直截了当。凯特接受我本来的样子。她很妥协，要求不高，也很容易相处。“。\n凯特说：“我开始去见一个我会永远在一起的人，但我快30岁了，时间不多了，我的生育能力不是很好，生个孩子对我来说非常重要。”奥利弗是个善良而勇敢的人，他会保护我们俩的。我们相处得非常好。“。\n四个月后，凯特怀孕了。由于她和奥利弗在约会的最初几周就已经睡在了一起，所以通过做爱来试着怀上他们的孩子似乎是一种显而易见的方式。奥利弗说：“在怀孕期间，我们做了所有你会和一个固定的长期伴侣做的事情：扫描，买婴儿用品，当婴儿踢的时候发短信。”“分娩时我也在场。”\n但这并不是完全直截了当的。由于担心共同育儿家庭经常面临的偏见，奥利弗和凯特(化名)直到今天还在向家人和朋友假装他们从相遇到儿子18个月大都在谈恋爱。\n凯特说：“奥利弗搬到我的空余房间，直到我们假装分手。那是一场闹剧。我们两家都相当保守。即使是现在，也只有一两个朋友知道真相。我们应该可以生活在不害怕评判的情况下，但现实是，通过一夜情生孩子的感觉可能比这更容易被人们接受。“。\n奥利弗补充道：“人们对改变生育过程、组建家庭持批判态度，即使通常的方式往往行不通。”\n他们的儿子现在4岁，每隔一个周末和一周一个晚上在他父亲家度过；这对夫妇住在距离彼此不到一小时车程的地方。他们在家庭日外出，一起过圣诞节和生日。两人现在都将他们的关系描述为一种类似于最好的伴侣的关系。\n“我们总是在笑，”凯特说。“我们志同道合，我们的首要任务是我们的儿子，他是一个充满深情、身体健康、快乐的小男孩。我们互相尊重。当奥利弗接送他时，他会进来喝茶；我认识很多离婚夫妇，父亲坐在外面的车里。我们都认为男人和女人给孩子的生活带来了不同的东西。“。\n两人现在都有了新的伴侣，他们都有了以前恋情中的孩子。奥利弗说：“没有前任经常会带来的敌意。去年圣诞节我们都在一起度过，那里有七个孩子。我希望我们的儿子(在他的父母身上)看到两个人之间的巨大纽带，他们给了他所需要的爱和支持。等他长大后，我们会向他解释这一点。“。\n凯特说，如果她29岁，她可能不会选择这条为人父母的道路，但她补充说：“我认为把孩子带到这个世界上还有更糟糕的方式。我得到了我的孩子和我一生的挚爱，但是通过两个不同的男人。我们的儿子没有看到妈妈和爸爸在同一个房子里亲吻和拥抱，但他看到我们两个人都非常爱他，非常想要他。“。\n例如，与代孕不同，代孕已经渗透到公众意识中，这在一定程度上要归功于埃尔顿·约翰(Elton John)和金·卡戴珊·韦斯特(Kim Kardashian West)等名人，而柏拉图式的共同育儿仍然鲜为人知，谈论也较少。PollenTree.com的创始人帕特里克·哈里森(Patrick Harrison)表示，在媒体、高级公务员、法律、医药和银行工作的成员在网站上的比例过高，这些领域珍视隐私。\n他说：“在这个国家，可能有很多人不认同这是一件伟大的事情，他们可以直言不讳。”“我们的会员都很低调，因为这不关别人的事。他们不需要社会上的其他人来告诉他们这是件好事还是坏事。“。\nGolombok说，这些担忧可能不是完全没有根据的，但也有好处。“人们仍然把传统家庭视为黄金标准，其他任何类型的家庭都是以此为标准来衡量的。但我们40多年的研究最重要的发现是，这些家庭都是适应良好的家庭，有时比传统家庭更适应。这些是被通缉的孩子。最大的担忧是，这些孩子是否会因为他们的家庭而受到污名、评判或欺凌。“。\nGolombok在她的书中写道：“从我们对20世纪70年代以来出现的新家庭形式的研究来看，这些家庭最初出现时被认为是危险和令人反感的，似乎对未来家庭的许多担忧最终都是没有道理的。”\n尽管近几十年来家庭结构发生了许多变化，但Golombok表示，目前还很难知道选择性共同育儿是否会变得司空见惯。这并不是一帆风顺的，就像任何关系一样，这些伙伴关系也可能破裂。\n艾米，37岁，六年前生下了她的女儿艾玛，此前她联系了一位认识了近十年的朋友，一起抚养孩子。他们都渴望为人父母，对医疗保健和学校教育有着共同的看法，住在加利福尼亚州，相隔15分钟。在第一次尝试怀孕之前，他们讨论了三个月的计划。\n她说：“多年来，我一直想要大爱。我最终心碎了，但仍然想要一个孩子。我本来可以在精子银行付500美元，但我很确定我可以免费做这件事。如果我不能有远大的梦想，这感觉就像是下一个最好的事情。“。她说，性爱是“我不得不喝得有点醉的东西”。尽管如此，我还是下定决心要生个孩子--我是一个肩负使命的女人。我确实‘享受’了，但我不会再和一个我不想和之发生性关系的人再做一次，即使是为了一个婴儿。“。\n当艾米的母亲对有了孙子感到兴奋时，她的父亲认为这是一个“可怕的”选择。“朋友们的朋友会告诉对方，他们对我‘从一个破碎的家庭开始’感到愤怒，”她回忆道。\n当艾玛还是个新生儿的时候，艾米的共同父母就睡在她的沙发上，帮她准备夜间的食物。随着她的成长，他们建立了50/50的育儿方式，每天工作的时间截然不同，所以两人都享受着每天与女儿在一起的时光。“有那么几个时刻，我想‘感谢上帝赐予他’，”她说。\n“我的政策是开放的。我整理了全家福，在万圣节采摘南瓜，我们一起过圣诞节和感恩节。我希望我的孩子能有一对慈爱的、敬业的父亲和母亲。我们有自己的社交、约会和职业生活；她有两个爱她的家庭。看起来效果不错。“。\n但是，在一场监护权之争的调解几天后，艾米将其描述为“可以想象的最大的噩梦”，她现在承认，裂缝在艾玛出生之前就已经出现了。\n“做爱来怀孕可能会让我们两个都感到困惑。发生了转变。他开始叫我“哼”和“宝贝”。他希望能有一段感情，“她说。边界成了紧张的根源。“(艾玛)出生后不久，我们就一起去接受治疗。我最大的恐惧就是和她分开，他的被遗漏了。“\n在英国，共同父母可以起草一份私人的条款协议，但文书工作在法庭上是不可执行的-在监护权争夺战中，法官只会考虑什么是对孩子最有利的。\n“如果现在有人说，‘我应该共同为人父母吗？’我会说，‘绝对不会，’“艾米说。“人们过去常常问我如何保护自己：你不能。我有一个漂亮、聪明、有同理心的女儿，但这很像是在经历离婚。”共同育儿的全部意义就是为了避免这种情况。“。\n她补充说：“我感到非常羞愧，因为我选择了这个。我以为我能行得通。回首往事，不知是真的觉得孩子需要父亲，还是社会压力？“。\n不可能计算出有多少孩子是这样出生的；更大的网站不科学地猜测，他们每个人都要为大约1000名新生儿负责。\n在他们2015年的友好学习盟友中，Golombok的剑桥团队发现，在网上寻找共同父母的主要动机是希望孩子认识亲生父母。其他包括对变老的担忧，以及分担育儿的经济成本。\n网站进行大量的适度投资，以消除诈骗者。例如，如果一名使用PollenTree的男子只指定自然受精，他将受到怀疑，他的个人资料将被关闭。“赌注非常高，我们需要在晚上睡觉，”哈里森说。\n洛杉矶的伊万·法托维奇(Ivan Fatovic)在与一群厌倦了约会游戏的女友交谈后，于2012年创立MoDamly之前，曾在电影和电视行业工作。第二年，该网站的第一个婴儿出生了。会员每月支付29.99美元(GB 23)，并被要求对共同父母的价值进行排名。它们通过算法进行匹配；领域包括收入、健康、创造力和外貌。定制的礼宾服务，网站为你审查潜在的匹配，价格为2,000-10,000美元(1,550-7,750 GB)。\n法托维奇说：“Tinder服务的对象是18-25岁的年轻人；我们的服务对象是30多岁和40多岁的人。”“第一次约会时说，‘我想在未来五年内生三个孩子’，这不是人们，尤其是男性想听到的。[但是]网站上的每个人都在考虑早晚要孩子。离婚率意味着，当父母可能有新伴侣的时候，住在两个不同的家里并不少见。像格温妮丝·帕特洛(Gwyneth Paltrow)和克里斯·马丁(Chris Martin)的“有意识的分离”这样的现代编排已经在发生，只是没有名字而已。\n“人们已经开始认识到，和你生孩子的人可能不是和你一起变老的那个人--但他们仍然希望在孩子的生活中既有父母的影响，也有父亲的影响。”他们想要那种连贯性、财政帮助和支持系统。“。\n和鹳一样，MoDamly也有一个浪漫的选择，适合那些也在寻找长期伴侣的人。法托维奇说：“我发现当两个异性恋的人在网站上相遇时，他们往往会沿着浪漫的道路走下去。”\n安德森和杜瓦尔可能并没有因为爱情而合拍-但不管怎样，这一切都随之而来。当他们在湖边度过第一个周末后告别时，已经有了更深层次的感情。三个月后，安德森怀孕时，他们成了一对夫妇，尽管她的意图与之相反。\n她说：“最终，我爱上了斯蒂芬，原因与我选择与他一起为人父母的原因相同：很容易沟通，分享信息，彼此诚实而脆弱。”\n“她是我父母十年来遇到的第一个女孩，”杜瓦尔补充道。\n六月中旬一个阳光明媚的日子，他们在蒙大拿州迎来了他们的女儿来到这个世界，他们在那里安家。他们仍然是一对情侣，但无论他们的罗曼史把他们带到哪里，共同为人父母仍然是他们的首要任务。杜瓦尔说：“我认为在不坠入爱河的情况下进入这一领域是可能的，但彼此坠入爱河也是有好处的。”“如果没有这一点，怀孕期间就会有很多我不需要的时候，我会错过这些时刻。我想和她在一起，她也想让我去。\n“每个人都问我们是怎么认识的。如果我不太了解他们，我只会说“在线”。如果让我再约会一次，我会开诚布公地开始我们的约会。这是一个更坚实的基础。“。\n安德森在新生儿泡沫的温暖中凝视着她扩大的家庭，说她并不认为这是理所当然的。“我们对关系或浪漫是什么样的有这些想法。我认为，在某种程度上，决定共同为人父母就是爱上了一个人--即使这不是一段浪漫的爱情。“\n·姓名和一些识别细节已被更改。苏珊·戈伦博克的“我们是一家人”由Scribe出版，编号为GB16.99。\n对这篇文章的评论是预先审核的，以确保讨论保持在文章提出的主题上。请注意，网站上的评论可能会有短暂的延迟。", "note_en": "When Jenica Anderson and Stephan DuVal  clicked on one another’s online profile on  Modamily.com – tagline “A new way to family” – neither was looking for romance. They were both in their late 30s, and their short bios indicated that they shared similar views on health and education, had solid incomes and were searching for the same thing: a non-romantic partner to have – and raise – a child with. A co-parent.\n Anderson, 38, a geologist from Montana, US, had matched with and spoken to 10 different men, mostly via so-called mating sites – matchmaking sites for people who want a baby without a romantic relationship – when she had her first phone call with DuVal, from Vancouver, Canada, in spring 2019. Their conversations quickly started to run into the night and, that June, she flew out to spend the weekend with him. They talked, went hiking and jumped into a lake together. “It felt like a date,” says DuVal, 37, a camera operator. “Except we could be totally honest about wanting to have a kid soon, without the goofiness and flirting of a first date. You’re looking to achieve a common goal.”\n In a world where biological science and equal rights have diversified ways to start a family, platonic co-parenting – the decision to have a child with someone you are not romantically involved with and, in most cases, choose not to live with – remains a relatively new phenomenon.\n Well established in gay communities, along with egg and sperm donation, it is on the rise among heterosexual singles. Tens of thousands have signed up to matchmaking sites at a cost of around £100 a year. On  Coparents.co.uk, which launched in Europe in 2008, two-thirds of its 120,000 worldwide members are straight. Modamily, which launched in LA in 2012, has 30,000 international members, of whom 80% are straight and 2,000 are British. UK-based competitor  PollenTree.com has 53,000 members, split 60/40 women to men, and ranks its domestic market as its strongest. During lockdown, the latter two sites reported traffic surges of 30-50%.\n Prof Susan Golombok, director of the University of Cambridge’s Centre for Family Research and author of  We Are Family , a new book examining the wellbeing of children in structures beyond the nuclear unit, has researched new family forms since the 1980s. She has studied families created via IVF, sperm and egg donation, and surrogacy, as well as lesbian mother families, gay father families and single mothers by choice.\n Golombok’s team turned their attention to elective co-parenting as an emerging trend in 2015. They are now following 50 families in what they believe to be the world’s first study considering the impact of the arrangement on children.\n  She says: “It was a gradual realisation that this was a new phenomenon picking up speed. The main question for us is how does this relationship between parents, where there is no romantic relationship, develop, with each other and the child? Is the relationship breakdown rate higher or lower? Very early findings suggest that how well the parents communicate with each other and collaborate over childcare seems to make a big difference.”\n The quality of parents’ relationships with one another, and their level of intimacy, has a large bearing on children’s welfare, she says. “It is possible, though, that taking away romantic baggage could even make for a more stable environment.”\n Anderson already had a young son – she split from his father when he was one. She signed up to two websites in early 2019. She wanted the opportunities that having two parents in a child’s life could bring. However, she lived in a small community where there was no one willing to enter into a co-parenting arrangement, and had already considered and dismissed men she had dated before.\n “I really didn’t want a romantic connection; I thought it would convolute things,” she says. “I’d seen the traditional recipe not work out. [Stephan and I] had a shared sense of direction – raising a happy child who makes it through life OK. My ex and I are very amicable co-parents, and that showed me there were real strengths to doing it this way. I wanted to tap into the stuff that’s good for the kid – a functional dynamic and a stable life. Stephan and I asked ourselves, ‘Can we be allies and ensure that any future kid gets the best?’ If it was just about parenting, we could remain pragmatic. I wanted to grow my family with somebody who wanted to be a doting father and wasn’t just having a baby for me.”\n Her parents weren’t so convinced. “I’m pretty sure [they] lost a lot of sleep over what I was doing. My father worried about finances. On some level, they probably worried about the morality.”\n More than 800 miles away, DuVal, frustrated by his efforts to meet someone who shared his desire for children, had also subscribed to Modamily. “I wanted a child to give life more meaning; a lot of people I know are married to their jobs,” he says. “I hoped that, maybe, I’d find romance eventually, but [for me] it was time to start a family.”\n He met three other possible matches before connecting with Anderson. He admired her bravery, parenting style and family ties. “The big fear was that I’d match with someone who turns out to be a terrible human. But my fear quickly disappeared. We spoke a lot about child-raising scenarios. We were often on the same page. We talked about our own lives, what shaped us, past relationships.”\n Anderson was drawn to his sense of adventure and flexibility. She says: “If unpredictable things came our way, [I felt] he could adapt. He had great dad qualities. I quickly felt confident in this really unknown and unconventional partnership.”\n  By the end of that June weekend, they returned to their lives having found the person they wanted to parent with. By September, they had conceived – naturally – and were pregnant. “Going into this, I presumed getting pregnant would be clinical, but once we spent time together we decided to try naturally,” says Anderson. “I tracked my ovulation, and we fell pregnant during a road trip on the west coast.” (Most co-parenting partnerships either have sex or choose the “turkey baster” method of artificial insemination at home. Some choose IVF.)\n   As Golombok’s team were noticing the rise of this new family unit, Oliver and Kate were imagining what their own might look like. Oliver had tried for years to have a baby in his former relationship. In his 40s, the relationship ended, but his desire to become a dad did not, and he logged on to  The Stork, a London-based site which has been responsible for 15 babies since it started matchmaking “people ready to be parents” five years ago.\n “So many of my mates had children and ended up with disastrous, costly divorces, only seeing their kids irregularly,” says Oliver. “I thought it would be better to get on with somebody as a mate and have a baby without wasting time.”\n He was introduced to Kate, and they scored 93% in a compatibility test through the agency, which sits at the top end of the market, charging £4k-£10k for its bespoke membership packages. These include Plan A, for prospective parents hoping to find romance, too, and Plan B, for those only wanting to co-parent. Oliver and Kate embarked on Plan A, but, after a few dates, and going to bed together, quickly switched to the platonic option.\n “Nothing blossomed romantically,” says Oliver. “But our principles for raising a child were the same – fun and spontaneity; not too indulgent; education was important. It felt straightforward. Kate takes me as I am. She is compromising, undemanding and easy to deal with.”\n Kate says: “I set out to meet someone I’d be with for ever, but I was in my late 30s, time was ticking, my fertility was not that great, and having a child was very important to me. Oliver’s kind and gallant; he would protect us both. We got on extremely well.”\n Kate became pregnant four months later. As she and Oliver had already slept together in the early weeks of dating, having sex to try for their baby felt like the obvious approach. “During the pregnancy, we did all the things you would with a regular, long-term partner: scans, shopping for baby stuff, texts when the baby kicked,” says Oliver. “I was at the birth, too.”\n But it was not entirely straightforward. Fearful of the prejudice that co-parenting families frequently face, Oliver and Kate (not their real names) have, to this day, pretended to family and friends that they were in a relationship from when they met until their son was 18 months old.\n  Kate says: “Oliver moved into my spare room until we faked splitting up. It was a farce. Both our families are quite conservative. Even now, only one or two friends know the truth. We should be able to live our lives without fear of judgment, but the reality is that having a child through a one-night stand probably feels more acceptable to people than this.”\n Oliver adds: “People are judgmental about changing the course of reproduction, manufacturing a family, even when the typical way often doesn’t work out.”\n Now aged four, their son spends every other weekend and one night a week at his dad’s; the pair live within an hour’s drive of each other. They go on family days out, and spend Christmas and birthdays together. Both describe their relationship now as one akin to best mates.\n “We’re always laughing,” says Kate. “We’re on the same wavelength, and our priority is our son, who is an affectionate, physical, happy little boy. We respect each other. When Oliver picks him up or drops him off, he comes in for tea; I know plenty of divorced couples where the dad sits outside in the car. We both believe that men and women bring different things to a child’s life.”\n Both now have new partners, who have children from previous relationships. Oliver says: “There’s none of the animosity that often comes with exes. We all spent last Christmas together; there were seven children there. I hope our son sees [in his parents] a great bond between two people who give him the love and support he needs. We will explain that to him as he grows up.”\n Had she been 29, Kate says she might not have chosen this path to parenthood, but she adds: “I think there are far worse ways to bring a child into this world. I’ve got my baby and the love of my life, but through two different men. Our son doesn’t see mummy and daddy kissing and cuddling in the same house, but he sees that he’s loved and wanted, very much, by both of us.”\n  Unlike surrogacy, for example, which has percolated into the public consciousness, partly thanks to celebrities such as Elton John and Kim Kardashian West, platonic co-parenting remains little understood and less spoken about. Sites are overrepresented by members working in the media, senior civil service, law, medicine and banking, where privacy is prized, says Patrick Harrison, founder of  PollenTree.com.\n “There are a lot of people in this country who probably don’t share a view that it’s a great thing, and they can be vocal,” he says. “Our members keep a low profile because it’s nobody else’s business. They don’t need the rest of society to tell them it’s a good or bad thing.”\n These concerns may not be completely unfounded, says Golombok, but there are upsides. “People still see the traditional family as the gold standard, and every other kind is measured against that. But the overarching finding of our research, over 40 years, is that these are well-adjusted families, sometimes more so than traditional ones. These are wanted children. The biggest concern is whether these children might be stigmatised, judged or bullied because of their family.”\n Golombok writes in her book: “From our studies of new family forms that have emerged since the 1970s –– families that were considered threatening and objectionable when they first appeared –– it seems likely that many of the fears about future families will turn out to be unjustified.”\n Despite the many changes in family makeup over recent decades, Golombok says it is hard to know, yet, whether elective co-parenting will become commonplace. It is not without difficulty and, as with any relationship, these partnerships can break down, too.\n Amy, 37, had her daughter, Emma, six years ago after approaching a friend of almost a decade to raise a child together. They both longed to be parents, shared views on healthcare and schooling, and lived 15 minutes apart, in California. They talked over their plan for three months, before falling pregnant at the first attempt.\n  She says: “For years, I wanted the big love. I ended up with a very broken heart, but still wanted a baby. I could have paid $500 at the sperm bank, but I was pretty sure I could do it for free. If I couldn’t have the big dream, this felt like the next best thing.” The sex, she says, was “something I had to get a bit drunk for. I was so determined to make a baby, though – I was a woman on a mission. I did ‘enjoy’ it, but I wouldn’t do it again with someone I didn’t really want to have sex with, even for a baby.”\n While Amy’s mother was excited about having a grandchild, her father thought it was an “awful” choice. “Friends of friends would tell each other they were outraged I was ‘starting from a broken home’,” she remembers.\n When Emma was a newborn, Amy’s co-parent slept on her sofa to help with night feeds. As she grew, they established 50/50 parenting, working opposite ends of the day so both enjoyed daily time with their daughter. “There were moments when I thought ‘Thank God for him’,” she says.\n “I had an open-door policy. I organised family photos, pumpkin picking on Halloween, and we spent Christmas and Thanksgiving together. I hoped my child would have a loving, engaged mother and father. We had our social, dating and professional lives; she had two families who love her. It seemed to work well.”\n But, speaking days after mediation in a custody battle she describes as “the biggest imaginable nightmare”, Amy now recognises that cracks appeared before Emma was born.\n “Having sex to conceive was probably confusing for us both. There was a shift. He started calling me ‘hun’ and ‘babe’. He was hoping for a relationship,” she says. Boundaries became a source of tension. “We went to therapy together soon after [Emma] was born. My big fear was being separated from her; his was being left out.”\n In the UK, co-parents can draw up a private agreement of terms, but the paperwork is unenforceable in court – in a custody battle, a judge would only consider what was in the best interests of the child.\n “If someone was to say now, ‘Should I co-parent?’ I’d say, ‘Absolutely not,’” says Amy. “People used to ask me how I’d protect myself: you can’t. I have a gorgeous, smart, empathic daughter, but it’s much like going through a divorce. The whole point of co-parenting was to avoid that.”\n She adds: “I feel a lot of shame because I chose this. I thought I could make it work. Looking back, I wonder if I really felt my child needed a father, or whether that was societal pressure?”\n  It is impossible to calculate how many children have been born this way; bigger websites unscientifically guess that they have been responsible for about 1,000 births each.\n In their 2015 study  Friendly Allies, Golombok’s Cambridge team found that the main motivation for seeking a co-parent online was wanting a child to know both biological parents. Others included concern about getting older, and sharing the financial cost of parenting.\n Sites invest a great deal in moderation, to eliminate scammers. For example, if a man using PollenTree specifies natural insemination only, he is treated with suspicion and his profile is closed down. “The stakes are very high, and we need to sleep at night,” says Harrison.\n  LA-based Ivan Fatovic worked in film and TV before he founded Modamily in 2012, after a conversation with a group of girlfriends tiring of the dating game. The site’s first baby was born the following year. Members pay $29.99 a month (£23), and are asked to rank what they value in a co-parent. They are matched by algorithms; fields include income, health, creativity and physical appearance. A bespoke concierge service, where the site vets potential matches for you, is available for $2,000-10,000 (£1,550-£7,750).\n “Tinder caters for 18- to 25-year-olds; we cater for people in their 30s and 40s,” says Fatovic. “On a first date, saying, ‘I want three kids in the next five years’, is not something people, particularly men, want to hear. [But] everyone on the site is thinking about having a child sooner or later. The divorce rate means that living in two separate homes, when mom and dad might have new partners, is not unusual. Modern arrangements, like Gwyneth Paltrow and Chris Martin’s ‘conscious uncoupling’ were already happening, there just wasn’t a name for it.\n “People have started to recognise that the person you have kids with may not be the person you grow old with – but they still want the influences of both a mother and father in their child’s life. They want that consistency, financial help and support system.”\n Like The Stork, Modamily also features a romance option, for those searching for a long-term partner too. “I find when two straight people meet on the site it often goes down the romance path,” says Fatovic.\n  Anderson and DuVal may not have clicked for love – but it followed anyway. By the time they said goodbye after that first weekend by the lake, there were the makings of deeper feelings. By the time Anderson was pregnant three months later, they were a couple, despite her intentions to the contrary.\n “Ultimately, I ended up falling for Stephan for the same reason I chose to parent with him: it was easy to communicate, share information, be honest and vulnerable with one another,” she says.\n “She’s the first girl my parents met in a decade,” adds DuVal.\n  They welcomed their daughter into the world on a sunny, mid-June day in Montana, where they’ve made their family home. They remain a couple, but wherever their romance takes them, parenting together remains their priority. “I think it’s possible to go into this without falling in love, but there are benefits of having fallen for each other,” says DuVal. “Without that, there would have been all these moments during the pregnancy, when I wasn’t needed, that I’d have missed. I wanted to be around and she wanted me there.\n “Everyone asks how we met. If I don’t know them well, I just say ‘online’. If I had to date again, I would start in the open and honest way we did. It’s a stronger foundation.”\n Gazing on her expanded family in the warmth of their newborn bubble, Anderson says she takes none of it for granted. “We have these ideas of what relationships or romance look like. I think deciding to co-parent is, in some ways, falling in love with someone – even if it’s not a romantic love.”\n • Names and some identifying details have been changed. We Are  Family by Susan Golombok is published by Scribe at £16.99.\n Comments on this piece are premoderated to ensure the discussion remains on the topics raised by the article. Please be aware that there may be a short delay in comments appearing on the site.", "posttime": "2020-11-04 14:17:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "育儿,platonic,家庭", "title": "柏拉图式共同育儿的兴起", "title_en": "The rise of platonic co-parenting", "transed": 1, "url": "https://www.theguardian.com/lifeandstyle/2020/oct/31/i-wanted-to-meet-a-mate-and-have-a-baby-without-wasting-time-the-rise-of-platonic-co-parenting", "via": "", "real_tags": ["育儿", "platonic", "家庭"]}, {"category": "", "categoryclass": "", "imagename": "45bf593425b37d6d228ceb757dd73844.jpeg", "infoid": 1033127, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加州选民对22号提案发表了意见，这是一项投票措施，将免除基于APP的运输和递送公司的司机被归类为员工。\n这项投票措施基本上已经成为优步和Lyft在该州继续维持现状运营的最后希望之一。\n这些公司面临加利福尼亚州总检察长的诉讼，指控他们违反了该州新的劳动法AB5。\n据NBC新闻(NBC News)预测，加州选民周二决定，优步(Uber)和Lyft应该免受州劳动法的约束，该法旨在让司机成为雇员，而不是承包商。\n选民们对加州的22号提案进行了投票，这项投票措施基本上成为优步和Lyft在该州继续维持现状运营的最后希望之一。\n该提议将允许基于APP的运输和递送公司的司机在许多情况下被归类为独立承包商。虽然这将取消他们获得员工福利的资格，但这项措施也让司机有权享受最低收入和车辆保险等新的福利。\n几个零工经济应用程序支持这一措施，包括优步(Uber)、Lyft、DoorDash、Insta和PostMates，优步正在收购这些应用。根据Ballotpedia汇编的统计，这些公司的支持帮助筹集了近2.03亿美元来支持这项措施，而反对者筹集的资金不到2000万美元。\n民主党总统候选人乔·拜登(Joe Biden)反对这项措施。拜登在5月份的推特上表示，加州人应该对这项倡议投反对票，并表示，零工经济巨头正试图破坏法律，免除工人的责任。这是不可接受的。\n尽管优步和Lyft能够在私下从风险投资家那里筹集到大量现金，并在公开市场上拥有数十亿美元的估值，但这两家公司都没有实现盈利。这使得承包商-司机模式对企业特别重要，使他们能够避免与就业相关的昂贵福利，如失业保险。\n这些公司警告说，他们可能不得不将工人重新分类增加的成本转嫁给消费者。优步在今年早些时候的一篇博客文章中估计，它将不得不在加州部分地区将乘客价格提高25%至111%，以弥补成本。\n《纽约时报》(New York Times)8月份报道称，两家公司都在考虑一种类似于传统出租车的车队模式。据泰晤士报报道，在这种模式下，这些公司将把自己的品牌像特许经营权一样授权给运营商。\n这一提议对DoorDash和Insta也有重大影响，据报道，这两家公司都在准备上市。与优步(Uber)和Lyft一样，这些公司的送货服务也严重依赖零工。如果22号提案没有通过，这些公司可能会担心雇佣工人作为员工的潜在更大费用。\n加州民主党众议员罗·坎纳(Ro Khanna)等批评人士表示，现行劳动法中没有任何条款阻止优步和Lyft在将司机归类为员工的同时，为他们提供灵活性。这些公司反驳说，这种模式的物流将是站不住脚的，因为跟踪工作时间太难了。\n今年8月，这些公司面临挫折，当时一名初审法官颁发了一项初步禁令，迫使它们将司机重新归类为员工，尽管随着案件进入法律程序，这一裁决尚未生效。由于投票措施已经通过，这起诉讼的命运尚不明朗。\n优步、Lyft和加州总检察长办公室的代表没有立即回复记者的置评请求", "note_en": "California voters weighed in on Proposition 22, a ballot measure that would exempt drivers for app-based transportation and delivery companies from being classified as employees.\n The ballot measure had essentially become one of Uber and Lyft&#39;s last hopes in the state to continue their operations under the status quo.\n The companies faced a lawsuit from California&#39;s attorney general, accusing them of violating the state&#39;s new labor law, AB5.\n California voters decided Tuesday that Uber and Lyft should be exempt from state labor law that aimed to make their drivers employees rather than contractors, according to projections from NBC News.\n Voters made the call on California&#39;s Proposition 22, a ballot measure that essentially became one of  Uber and  Lyft&#39;s last hopes in the state to continue their operations under the status quo.\n  The proposition would allow drivers for app-based transportation and delivery companies to be classified as independent contractors in many circumstances. While that would disqualify them for benefits granted to employees, the measure also entitles drivers to new benefits like minimum earnings and vehicle insurance.\n Several gig economy apps backed the measure, including Uber, Lyft, DoorDash, Instacart and Postmates, which Uber is acquiring. The support from these companies helped raise nearly $203 million to back the measure, while opponents raised less than $20 million, according to tallies compiled by  Ballotpedia.\n Democratic presidential nominee Joe Biden opposed the measure. Biden tweeted in May that Californians should vote no on the initiative and said, &#34;gig economy giants are trying to gut the law and exempt their workers. It&#39;s unacceptable.&#34;\n  While Uber and Lyft were able to raise gobs of cash from venture capitalists while private and have multi-billion dollar valuations on the public market, neither has reached profitability. That makes the contractor-driver model especially important to the businesses, allowing them to avoid costly benefits associated with employment, such as unemployment insurance.\n The companies have warned they&#39;d likely have to pass on increased costs of worker reclassification to consumers. Uber estimated in a  blog post earlier this year that it would have to raise rider prices between 25% and 111% in parts of California to cover the costs.\n  The New York Times reported in August that both companies were considering a fleet-like model, similar to traditional taxis. Under that model, the companies would license their brands to operators like a franchise, according to the Times.\n The proposition has significant implications for DoorDash and Instacart as well, both of which are reportedly preparing to go public. Like Uber and Lyft, these companies also rely heavily on gig workers for their delivery services. Without the passage of Proposition 22, the companies would likely worry about potentially larger expenses to hire workers as employees.\n Critics like Rep. Ro Khanna, D-Calif., have said that there&#39;s nothing written into current labor law stopping Uber and Lyft from providing flexibility to drivers while classifying them as employees. The companies have countered that the logistics of such a model would be untenable since it would be too difficult to track time worked.\n The companies faced a setback in August when a trial judge  granted a preliminary injunction forcing them to reclassify their drivers as employees, although that ruling has yet to go into effect as the case makes its way through the legal process. The lawsuit&#39;s fate is unclear now that the ballot measure has passed.\n Representatives from Uber, Lyft and the California attorney general&#39;s office did not immediately respond to requests for comment", "posttime": "2020-11-04 14:17:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "lyft", "title": "优步和Lyft有望在CA投票措施中获胜", "title_en": "Uber and Lyft expected to prevail in CA ballot measure", "transed": 1, "url": "https://www.cnbc.com/2020/11/03/california-voters-projected-to-pass-prop-22-backed-by-uber-and-lyft.html", "via": "", "real_tags": ["lyft"]}, {"category": "", "categoryclass": "", "imagename": "30d9901cf764887671865156faa9a07c.jpeg", "infoid": 1033126, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "FIX#9829：允许AS代替@for模式绑定#9837更改给定选择符的通配符#9949Keep@Alpha可选#10093。\n171Martin Odersky 94 Nicolas Stucki 75刘凤云62 Aleksander Boruch-Gruszecki 50 Filip Zybała 35 Krzysztof Romanowski 34 Anatolii Kmetiuk 32 Sébastien Doeraene 31 Guillaume Martres 28 Jamie Thompson 20 Bishabosha 19 Guillaume Raffin 16 Krzysztof Romanwoski 12 Ruslan Shevzenko 9 Tom Grigg 6 Som Snytt 5 Odersky 5 Andrzej Ratajczzzak 4 MichałPał3 Adrien Pereu Noti01 2 Krzysztof Bochenek 2 or 2 Raphael Jolly 2 Sabes in 1 Vasil Vasiski 1 Ruslan Shevzenko 9 Tom Grigg 6 Som Snytt 5 Odersky 5 Andrzej Ratajczzzak 4 MichałPał3 Adrien Pereo Voicu Noti01 2 Krzysztof Bochenek 2 or 2 Raphael Jolly 2 Sabes in 1 Vasil", "note_en": "Fix  #9829: Allow  as in place of  @ for pattern bindings  #9837 Change wildcard given selectors  #9949 Keep  @Alpha optional  #10093\n        171 Martin Odersky 94 Nicolas Stucki 75 Liu Fengyun 62 Aleksander Boruch-Gruszecki 50 Filip Zybała 35 Krzysztof Romanowski 34 Anatolii Kmetiuk 32 Sébastien Doeraene 31 Guillaume Martres 28 Jamie Thompson 20 bishabosha 19 Guillaume Raffin 16 Krzysztof Romanwoski 12 Ruslan Shevchenko 9 Tom Grigg 6 Som Snytt 5 odersky 5 Andrzej Ratajczak 4 Michał Pałka 3 Adrien Piquerez 3 Tudor Voicu 3 noti0na1 2 Krzysztof Bochenek 2 Tudor 2 Raphael Jolly 2 Miles Sabin 1 Vasil Vasilev 1 ansvonwa 1 Greg Zoller 1 felher 1 gzoller 1 zgrybus 1 Fengyun Liu 1 Philippus Baalman 1 Krzysiek Bochenek 1 Tomasz Godzik 1 ysthakur", "posttime": "2020-11-04 13:57:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "m1,krzysztof", "title": "Scala 3.0.0-M1版本", "title_en": "Scala 3.0.0-M1 Release", "transed": 1, "url": "https://github.com/lampepfl/dotty/releases/tag/3.0.0-M1", "via": "", "real_tags": ["m1", "krzysztof"]}, {"category": "", "categoryclass": "", "imagename": "e606254978fafcef354d5a15ec2cef5e.jpg", "infoid": 1033125, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着桅杆升级托卡马克的推出，来自聚变的清洁能源又近了一步。\n经过七年的建设，英国能源署的GB55M机器，标记为兆安球面托卡马克(MAST)的升级，第一次实现了“第一等离子体”--所有重要部件同时工作。\n库勒姆聚变能源中心的这个项目是由工程和物理科学研究理事会资助的，该理事会是英国研究和创新的一部分，以及商业、能源和工业策略部。\n聚变能源提供了充足的、内在安全的低碳电力供应的潜力(原材料在海水和地壳中找到)。它包括将氢粒子聚变在一种被称为“等离子体”的高温气体中，以释放大量能量。\n运行聚变技术需要在控制极端热量、气体和强大磁场以及其他复杂系统方面进行仔细的平衡。\n聚变研究中最大的挑战之一是从等离子体中提取多余的热量。英国航空航天局的科学家现在计划在桅杆升级时测试一种名为“Super-X偏滤器”的新排气系统。\n这个系统的设计目的是在足够低的温度下将等离子体引导出机器，使其材料能够承受-这意味着部件可以使用更长的时间。到达机器内表面的热量大约减少了十分之一，这可能会改变未来聚变发电站的长期生存能力。\n桅杆升级将是英国原型聚变发电厂--用于能源生产的球形托卡马克(“STEP”)的先驱，将于2040年完工。\nUKAEA正在设计由英国政府资助的2.2亿GB初始项目STEP，该项目将基于桅杆升级的“球形托卡马克”聚变概念。球形托卡马克可以提供一条通往紧凑型聚变发电厂的路线。桅杆升级的成功是设计未来聚变电力设施的又一步，作为未来低碳能源组合的一部分，这可能会发挥重要作用。\n桅杆升级还将有助于ITER的准备工作，ITER是世界上最大的科学巨型项目，目前正在法国南部建设，该项目打算在工业规模上展示聚变能力。\n英国科学大臣阿曼达·索洛韦(Amanda Solloway)说：“我们希望英国成为聚变能源的世界领先者，并利用其作为清洁能源的惊人潜力，这种潜力可以持续数百年。”\n在5500万GB政府资金的支持下，启动桅杆升级装置是这项全国聚变实验的一个里程碑式的时刻，使我们朝着到2040年建造英国第一座聚变发电厂的目标又迈进了一步。“。\n“桅杆升级将使我们更接近提供可持续、清洁的聚变能源。这项实验将开辟新天地，测试以前从未尝试过的技术。它确保了英国跻身于致力于核聚变的国家的顶级联盟，并将对实现英国能源署建造STEP核聚变发电厂的目标至关重要。“", "note_en": "Clean energy from fusion is a step closer with the launch of the MAST Upgrade tokamak.\n  For the first time, after a seven-year build, UKAEA’s £55M-machine, labelled Mega Amp Spherical Tokamak (MAST) Upgrade, has achieved “first plasma” – where all the essential components work together simultaneously.\n The project at Culham Centre for Fusion Energy was funded by the Engineering &amp; Physical Sciences Research Council, part of UK Research &amp; Innovation and the Department for Business, Energy &amp; Industrial Strategy.\n Fusion energy offers the potential of an abundant, inherently safe low-carbon electricity supply (the raw materials are found in seawater and the Earth’s crust). It involves fusing hydrogen particles in a hot gas known as a ‘plasma’ to unlock large amounts of energy.\n Operating fusion technologies requires a careful balancing act of controlling extreme heat, gas and powerful magnetic fields, amongst other complex systems.\n  One of the biggest challenges in fusion research has been to extract the amount of excess heat from the plasma. UKAEA’s scientists now plan to test a new exhaust system called the ‘Super-X divertor’ at MAST Upgrade.\n This system is designed to channel plasma out of the machine at temperatures low enough for its materials to withstand – meaning that components can last much longer. The approximate tenfold reduction in heat arriving at the internal surfaces of the machine has the potential to be a game-changer for the long-term viability of future fusion power stations.\n  MAST Upgrade will be the forerunner of the UK’s prototype fusion power plant, Spherical Tokamak for Energy Production (“STEP”), due for completion by 2040.\n STEP – which UKAEA is designing in an initial £220 million programme funded by the UK Government – will be based on MAST Upgrade’s ‘spherical tokamak’ fusion concept. The spherical tokamak could offer a route to a compact fusion power plant. The success of MAST Upgrade is another step along the way to designing future fusion power facilities, which could have an important role as part of a future portfolio of low-carbon energy.\n MAST Upgrade will also aid preparations for ITER – the world’s largest science megaproject, now being built in the South of France, which intends to demonstrate fusion power on an industrial scale.\n  UK Science Minister, Amanda Solloway, said: “We want the UK to be a world leader in fusion energy and to capitalise on its amazing potential as a clean energy source that could last for hundreds of years.\n “Backed by £55 million of government funding, powering up the MAST Upgrade device is a landmark moment for this national fusion experiment and takes us another step closer towards our goal of building the UK’s first fusion power plant by 2040.”\n  “MAST Upgrade will take us closer to delivering sustainable, clean fusion energy. This experiment will break new ground and test technology that has never been tried before. It ensures the UK is in the premier league of countries working on fusion – and will be vital in achieving UKAEA’s goal of building the STEP fusion power plant.”", "posttime": "2020-11-04 13:57:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "英国,energy,聚变", "title": "所有系统都将参加英国GB 55M聚变能源实验", "title_en": "All systems go for UK’s £55M fusion energy experiment", "transed": 1, "url": "https://ccfe.ukaea.uk/all-systems-go-for-uks-55m-fusion-energy-experiment/", "via": "", "real_tags": ["英国", "energy", "聚变"]}, {"category": "", "categoryclass": "", "imagename": "4e656cc019afe2d779de13aeb3e4e54e.jpg", "infoid": 1033124, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在Netflix电视剧“女王的赌博”(The Queen‘s Gambit)中，角色本尼·瓦茨(Benny Watts)在1967年美国国际象棋锦标赛开始时走向该剧的女主角贝丝·哈蒙(Beth Harmon)。地点是俄亥俄大学校园里的一个小礼堂。\n本尼说着脏话，在大厅周围做着手势，抱怨着条件，指出这个国家最好的选手正在比赛，但场地却是二流的，棋盘和棋子都是廉价的塑料，少数观众充其量似乎很无聊。\n作为一名国际象棋大师，他成长于该系列剧发生后的那个时代，并为《纽约时报》撰写国际象棋专栏长达八年之久，我可以证明这一场景几乎是痛苦的真实性。那个时代的许多锦标赛都是在奇怪的，有时甚至是肮脏的地方举行的。即使是美国锦标赛也不能幸免；1964-65年的比赛甚至没有举行。\n贝丝(安雅·泰勒-乔伊饰)和本尼(托马斯·布罗迪-桑格斯特饰)之间的交流反映了一位内部人士在该剧设定时对美国国际象棋的了解，也是该剧成为该游戏最好、最成功的屏幕改编之一的众多原因之一，其中包括1993年的2016年电影《卡韦女王》(Queen Of Katwe)和《寻找鲍比·费舍尔》(Searching For Bobby Fischer)，其中包括2016年的电影《卡特韦女王》(Queen Of Katwe)和1993年的《寻找鲍比·费舍尔》(Searching For Bobby Fischer)。\n该节目的创作者在捕捉和戏剧化国际象棋锦标赛的高度紧张以及这个游戏有时可以激发的完全痴迷方面也做得特别好。虽然这是为了喜剧效果，但在哈里·贝尔蒂克(Harry Mling饰)从车里拖出一大盒国际象棋书并开始递给客厅里的贝丝的场景中，有更多的真相，结果发现她已经读了大部分书。而且，大多数熟练的国际象棋选手可能至少在头脑中下过几盘棋，就像贝丝和本尼那样，一边在高速公路上加速一边喊着棋。\n几十年来，指出游戏屏幕上的错误几乎成了国际象棋爱好者们的笑料。丹·卢卡斯(Dan Lucas)是美国国际象棋联合会(United States Chess Federation)的高级官员之一，多年来一直保存着一份非官方名单。最常见的违规行为包括：棋盘方向不正确(右角应该总是有一个白色方块)，棋子排列不正确(比如颠倒了开始方格上的国王和王后)，以及角色不知道如何移动和处理棋子。\n与前世界冠军加里·卡斯帕罗夫(Garry Kasparov)和纽约市知名国际象棋教练布鲁斯·潘多尔菲尼(Bruce Pandolfini)这两位顾问合作，“女王的游戏”的创作者避免了这些错误。(潘多菲尼甚至还客串了肯塔基州的锦标赛总监。)。演员们接受了如何像专家一样演奏和移动棋子的培训，这通常是通过快速的、几乎像机关枪一样的动作来完成的。泰勒-乔伊在接受“国际象棋生活”杂志采访时解释说，她实际上形成了自己更流畅的风格，这是基于她作为一名舞者的训练。在这部系列剧中，她把碎片舀起来，然后轻轻地翻过来。\n该系列中描绘的游戏不仅是现实的，它们是真实的，基于实际的比赛。例如，贝丝击败哈里夺得肯塔基州冠军的比赛是1955年在拉脱维亚里加的一场比赛中进行的；上一次她击败本尼的速度棋比赛是在1858年在巴黎歌剧院进行的；她在系列赛决赛中与俄罗斯冠军瓦西里·博尔戈夫(Marcin Dorocinski饰)的比赛是1993年在瑞士贝尔进行的。\n尽管努力让国际象棋场景变得可信，但该系列仍有一些不足之处。最明显的是在锦标赛期间球员移动的速度。正如一位锦标赛总监在辛辛那提比赛前告诉贝丝的那样，每个球员有两个小时的时间进行40步移动，这过去是，现在仍然是此类比赛的标准时间控制。但在每一场比赛中，贝丝和她的对手们只用了几秒钟的时间就做出了每一步动作。在这样的节奏下，他们会在几分钟内完成游戏，而不是几个小时。这种速度对于电影制作来说是可以理解的，因为看着玩家坐在棋盘前几个小时，几乎不动，并不吸引人。但它也不准确。\n在一些比赛期间，也没有让竞争对手说话。除了提供平局-本质上同意比赛以平局结束-球员在比赛期间不会相互交谈。这不仅被认为是不良的体育道德，而且也是违反规则的。但有几次，就像在第二集中贝丝与哈里的比赛(她在接近尾声时幸灾乐祸)，以及在第四集中贝丝在墨西哥城与一名年轻的俄罗斯神童的比赛中，贝丝和她的对手进行了口头交流。对白让游戏变得更加通俗易懂，也为戏剧增添了情趣，但这又一次与生活脱节。\n虽然“女王的游戏”是一部虚构的作品，里面出现的人物从来就不存在，但也有提到出现过的球员，其中包括世界冠军何塞·劳尔·卡巴布兰卡(JoséRaúl Capablanca)、亚历山大·阿莱欣(Alexander Alekhine)、米哈伊尔·博特维尼克(Mikhail Botvinnik)和鲍里斯·斯帕斯基(Boris Spassky)。\n还有一个奇怪的时刻，哈里将贝丝与美国人保罗·莫菲(Paul Morphy)相提并论，保罗·莫菲于1858年在巴黎歌剧院玩了这场著名的游戏，他被广泛认为是19世纪最伟大的球员。这种比较似乎是一种误导。尽管贝丝有自我毁灭的倾向，但她并不像莫菲。她更接近女性版的另一位冠军：鲍比·费舍尔(Bobby Fischer)。\n这可能不是偶然的。沃尔特·特维斯(Walter Tevis)是一位充满激情和知识渊博的业余选手，他写了1983年的小说，该系列就是根据这部小说改编的。特维斯让女主人公玩一种长期以来由男性主导的游戏-这种游戏至今仍在进行，尽管没有人知道原因-可能是表达了一种希望，即有一天可能会在棋盘上实现真正的性别平等。\n费舍尔本人对女球员非常不屑一顾，在1963年的一次采访中说她们“很糟糕”，一个可能的原因是“她们没有那么聪明”。让贝丝回忆起一个女性费舍尔可能是一种狡猾而美妙的方式来发出这种评估。\n贝丝和费舍尔之间有很多相似之处(不包括她吸毒，顺便说一句，这只会减少而不是改善她的发挥)。\n“女王的赌博”涵盖了从1958年到1968年的一段时间。这与菲舍尔职业生涯的巅峰时期不谋而合，他的职业生涯从1957年14岁赢得美国锦标赛冠军，到1972年29岁赢得世界锦标赛并退出比赛。\n贝丝赢得1967年美国锦标赛冠军。那一年，费舍尔赢得了他的第八个也是最后一个美国冠军。\n养母在墨西哥城去世后，十几岁的贝丝发现自己独自一人生活。费舍尔的姐姐琼结婚搬走后不久，他的母亲里贾娜也去攻读医学学位。这使得16岁的费舍尔只能独自生活。\n费舍尔有点反社会和单向度-除了国际象棋，他几乎没有什么喜欢谈论的。贝丝更讨人喜欢，这是剧中主角的必备条件，但她也有一些相似的特点。\n她学习俄语是为了准备面对苏联棋手；费舍尔自学俄语是为了阅读俄罗斯国际象棋期刊，这是最好的信息来源。\n与节目中的其他顶尖棋手不同，贝丝能够靠国际象棋谋生。就连前美国冠军本尼也住在昏暗的地下室里。费舍尔是美国全职职业球员的先驱。卡斯帕罗夫经常说，正是费舍尔对更好的比赛条件和更大的奖金的要求，才使这项运动职业化。\n当贝丝需要钱去俄罗斯时，她会要求政府支付旅费。费舍尔的母亲曾在白宫设纠察队，试图为美国国际象棋队筹集资金。\n贝丝没有足够的钱去旅行的原因之一是她买了太多的衣服。费舍尔虽然经常为钱而挣扎，但他的西装和鞋子都是定做的。\n最后，贝丝和费舍尔有着相似的、咄咄逼人的打球风格。当面对西西里防守时，他们都打着相同的系统：费舍尔-索津进攻。\n当谈到如何在屏幕上描绘国际象棋时，国际象棋选手是出了名的挑剔和无情的人群。我们会抓住任何错误不放。尽管“女王的赌博”有它的缺陷，但最终这部系列剧显然是赢家。", "note_en": "In the Netflix series “ The Queen’s Gambit,” the character Benny Watts walks up to Beth Harmon, the show’s heroine, at the start of the 1967 United States Chess Championship. The location is a small auditorium on the campus of Ohio University.\n Uttering an expletive, Benny gestures around the hall and complains about the conditions, noting that the best players in the country are competing, and yet the venue is second rate, the chess boards and pieces are cheap plastic, and the few spectators seem bored at best.\n As a chess master who grew up in the era just after the one in which the series takes place, and who wrote the chess column for The New York Times for eight years, I can attest to the scene’s almost painful authenticity. Many tournaments of that era were played in odd and sometimes dingy locations. Even the U.S. championship was not immune; the 1964-65 competition was not even held.\n The exchange between Beth (played by Anya Taylor-Joy) and Benny (Thomas Brodie-Sangster) reflects an  insider’s knowledge of chess in the United States at the time that the show is set and is one of the many reasons that the series is one of the best and most successful screen adaptations of the game, a short list that includes the 2016 film “ Queen of Katwe” and “ Searching for Bobby Fischer,” from 1993.\n  The show’s creators have also done a particularly good job at capturing and dramatizing the high tension of chess tournaments and the sometimes total obsessiveness that the game can inspire. Although it is played for comic effect, there is more than a grain of truth to the scene in which Harry Beltik (Harry Melling) hauls a big box of chess books out of his car and starts passing them to Beth in her living room, only to discover that she has already read most of them. And most skilled chess players have probably played at least a few games entirely in their heads by calling out the moves while speeding down a highway, as Beth and Benny do.\n Over the decades, it has become almost a running gag among chess fans to point out mistakes in onscreen portrayals of the game. Dan Lucas, one of the senior officials at the United States Chess Federation, has kept an unofficial list for years. Among the most common transgressions: boards that are oriented incorrectly (there should always be a white square in the right corner), incorrect arrangements of pieces (such as reversing the kings and queens on their starting squares) and characters who don’t know how to move and handle the pieces.\n Working with two consultants, Garry Kasparov, the former world champion, and Bruce Pandolfini, a well-known New York City chess coach, the creators of “The Queen’s Gambit” have avoided those errors. (Pandolfini even has a cameo role as a Kentucky tournament director.) The actors were trained on how to play and to move pieces like experts, which is usually done with swift, almost machine-gun-like movements. Taylor-Joy actually developed her own, more fluid style, as she explained in an interview with Chess Life magazine, which was based on her training as a dancer. In the series, she scoops the pieces up and then softly flips them over.\n The games portrayed in the series are not just realistic, they are real, based on actual competitions. For example, the match in which Beth defeats Harry for the Kentucky state title was from  a game in Riga, Latvia, in 1955; the last speed chess game in which she beats Benny was played at the Paris Opera in 1858; and the game in which she faces the Russian champion Vasily Borgov (Marcin Dorocinski) in the series finale was  played in Biel, Switzerland, in 1993.\n  Despite the efforts to make the chess scenes believable, there are still areas in which the series comes up short. The most apparent is in how fast the players move during the tournaments. As one tournament director tells Beth before a competition in Cincinnati, each player has two hours to make 40 moves, which was, and still is, a standard time control for such games. But in every match, Beth and her opponents make each of their moves after taking only a few seconds to think about them. At such a tempo, they would finish their games in minutes, not hours. The speed is understandable for filmmaking because watching players sit at a board for hours, barely moving, is not riveting. But it is also not accurate.\n Nor is having competitors talk during some of the games. Other than offering a draw — essentially agreeing that the match ends in a tie — players do not speak to each other during matches. It is not only considered bad sportsmanship, it is also against the rules. But several times, as in Beth’s game against Harry in Episode 2, in which she gloats near the end, and in her game against a young Russian prodigy in Mexico City in Episode 4, Beth and her opponents engage in verbal exchanges. The dialogue makes the games more understandable and spices up the drama, but once again, it is not true to life.\n Though “The Queen’s Gambit” is a work of fiction and the characters that appear in it never existed, there are passing references to players who did, among them the world champions José Raúl Capablanca, Alexander Alekhine, Mikhail Botvinnik and Boris Spassky.\n There is also a curious moment when Harry compares Beth to Paul Morphy, an American, who played that famous game at the Paris Opera in 1858 and who is widely considered the greatest player of the 19th century. The comparison seems like a misdirection. Despite her self-destructive tendencies, Beth does not resemble Morphy. She is closer to a female version of another champion:  Bobby Fischer.\n That may not be accidental. Walter Tevis, who wrote the  1983 novel on which the series is based, was a passionate and knowledgeable amateur player. In making the protagonist a woman playing a game that had long been dominated by men — and which continues to be today, though no one knows the reason — Tevis may have been expressing a hope that one day there might be true equality of the sexes over the board.\n Fischer himself had been very dismissive of female players, saying in a 1963 interview that they were “terrible” and that a likely reason was that “they are not so smart.” Making Beth recall a female Fischer may have been a sneaky, and wonderful, way to send up that assessment.\n The parallels between Beth and Fischer are numerous (minus her drug use, which, by the way, would have only diminished, not improved, her play).\n  “The Queen’s Gambit” covers a period from 1958 to 1968. That coincides with the peak of Fischer’s career, which ran from 1957, when he won the U.S. championship at 14, to 1972, when he won the world championship at 29 and quit competing.\n Beth wins the 1967 U.S. championship. That was the year Fischer won his eighth and final American title.\n After her adoptive mother dies in Mexico City, Beth, who is in her late teens, finds herself living alone. Soon after Fischer’s older sister, Joan, married and moved out, his mother, Regina, did, too, to pursue a medical degree. That left Fischer, at 16, living on his own.\n Fischer was somewhat antisocial and one-dimensional — there was little that he liked to talk about outside of chess. Beth is more likable, a necessity for a leading character in a show, but she has some similar traits.\n She learns Russian in order to be prepared to face the Soviet players; Fischer taught himself Russian so that he could read Russian chess journals, which were the best sources of information.\n Unlike the other top players in the show, Beth is able to make a living at chess. Even Benny, a past U.S. champion, lives in a dingy basement. Fischer was a pioneer as a full-time professional player in the United States. Kasparov has often said that it was Fischer’s demands for better playing conditions and larger prizes that professionalized the game.\n When Beth needs money to go to Russia, she asks the government to pay for the trip. Fischer’s mother once picketed the White House to try to raise money for the United States chess team.\n One of the reasons Beth does not have enough money for the trip is because she has bought too many dresses. Fischer, even though he was often scratching for money, had his suits and shoes custom made.\n Finally, Beth and Fischer have similar, aggressive playing styles. And when playing white and facing the Sicilian Defense, they both play the same system: the Fischer-Sozin Attack.\n When it comes to how chess is portrayed onscreen, chess players are a notoriously picky and unforgiving crowd. We will pounce on any mistake. Though “The Queen’s Gambit” has its flaws, in the end the series is a clear winner.", "posttime": "2020-11-04 13:57:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "女王,queen,国际象棋", "title": "“女王的赌博”的正确之处是什么？", "title_en": "What ‘The Queen’s Gambit’ Gets Right", "transed": 1, "url": "https://www.nytimes.com/2020/11/03/arts/television/chess-queens-gambit.html", "via": "", "real_tags": ["女王", "queen", "国际象棋"]}]