[{"category": "", "categoryclass": "", "imagename": "35fa4924304e9d42b41645f9ad8c08b9.jpg", "infoid": 1014287, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "乍一看，这是一幅典型的乡村风景画。在德比郡山谷深处，小柳树向着晚春的太阳向上伸展。鸟儿、蜜蜂和奇特的黄蜂为田园般的和谐提供了柔和的配乐。\n但整齐地排列在田野中央的是一种似乎相当奇特的作物。\n细长的柳树从地上发芽，几英寸后，树干变成椅背，座椅紧随其后，最后是腿。结构被绑在一个蓝色的框架上，整个结构用树叶覆盖。\n加文·门罗(Gavin Munro)观察着他面前的风景，他是Full Growth的联合创始人，他成立该公司的目的是将童年的愿景付诸实践。\n这个概念非常简单明了。我想把树种成椅子、镜子、灯具等的形状，而不是砍伐树木和制作家具。\n在下一排，优雅的螺旋围绕着圆柱体生长。这些最终将被用作吊灯。还有镜架、桌子和吊床。\n加文解释说，我们种植树木，在它们生长的过程中塑造它们，这有点像埃斯帕利耶--训练树木的过程。\n当它们形成我们想要的特定形状时，它们会被切开并晾干，这样你就可以得到一把已经长成一块坚固的成品椅子。\n这是一个漫长的过程，从开始到结束大约需要六年时间。但加文是个有耐心的人。\n当我还是个孩子的时候，我的脊椎有问题，我接受了挺直背部的手术。治疗的一部分实际上是嫁接在框架上，类似于我们嫁接树木的方式。因此，我很欣赏表格可以被塑造的方式，以及这个过程可能需要多长时间。\n大约在同一时间，我妈妈有一棵盆景树。盆景被留在自己的方向上生长，最终形成了一个王座的形状。我对此很感兴趣，一想到椅子是直接从自然中创造出来的。\n当加文搬到加州时，他对树木和木头的迷恋发展成了一门生意。他以园丁工作为生，但开始以浮木为副业制作家具。\n你在海滩上购物，从被冲上岸的东西中收集材料。你正在使用那里已经有的东西，这让你有了一定的满足感。\n当加文回到英国时，他想继续从事自然环境方面的工作。回想起他母亲的盆景，一个想法开始形成。\n如果盆景能长成椅子的形状，为什么其他家具不能呢？为什么我不能种一整块地呢？没有浪费，而且在结构上会更坚固。\n十年前，加文将他的计划付诸实施。他从一位支持他的朋友那里投资了5000英镑，买了一些基本的东西，包括割草机、模具和其他设备。一开始，我们对材料进行了一些实验。\n我们研究了不同类型的木材，最终选择了柳树作为主要作物。它的发展速度很快，而且相对容易操作。\n我们想提供其他品种，如樱桃和橡木，既可供客户选择，也可分散感染某种疾病的风险。例如，我喜欢灰烬的外观，但它很容易得[真菌病]灰烬枯萎。\n还有害虫的问题，加文说，他正试图从自然环境中创造一个解决方案。\n我想你可以称之为露天工厂，我们正在利用这一点。例如，我们接受了永久养殖的想法，用坚果引诱鸟类到陆地上，这样它们就会吃掉蚜虫和毛毛虫。\n我们还在树下种了三叶草。根部固定氮素，这样树木就可以更好地接触到氮素，三叶草也会覆盖土壤，这样它就不会受到太阳的破坏。\n在宜家，你可以在一个下午把房子里的所有家具都取走，在这个世界里，加文速度较慢的替代方案似乎吸引了购房者的想象力。\n我们的第一批椅子明年应该可以收割了，而且我们的预购已经卖完了。世界各地对做类似事情感兴趣的人也对我们很感兴趣。\n椅子和灯具的预购暂时维持了业务，产生的收入刚刚够支付几名员工的工资，包括加文的妻子爱丽丝(Gavin&39；)的妻子爱丽丝(Alice)和一名全职员工和几名兼职员工。\n然而，种植家具所需的时间、精力和技能意味着这些家具的价格并不便宜。椅子的价格是2500 GB，灯具的起价是700 GB，镜框的价格是450 GB。\n那么，长大成人家具只是富人和财大气粗的人才有的东西吗？目前是这样，但加文表示，他的计划可能会看到这种变化。\n我们有一个50年的计划。全球扩张的空间很大。他解释说，哪里有树，哪里就可以种家具。", "note_en": "At first glance it is a typical countryside scene. Deep in the Derbyshire Dales, young willow trees stretch upwards towards the late spring sun. Birds, bees and the odd wasp provide a gentle soundtrack to the bucolic harmony.\n But laid out in neat rows in the middle of a field are what appears to be a rather peculiar crop.\n  Slender willows sprout out of the ground then after a few inches the trunk becomes the back of a chair, the seat follows and finally the legs. The structure is tied to a blue frame and the entire form is clothed in leaves.\n  Surveying the landscape in front of him is Gavin Munro, co-founder of Full Grown, the company he formed to put a childhood vision into practice.\n  &#34;The concept is pretty straightforward. Rather than cutting down trees and making furniture I wanted to grow the trees in the shape of chairs, mirrors, lamps and so on.&#34;\n On the next row along, elegant spirals are growing around cylinders. These will eventually be used as hanging lamps. There are also mirror frames, tables and hammocks.\n   &#34;We grow the trees, shaping them as they go along, it&#39;s a little bit like espalier - the process of training trees,&#34; Gavin explains.\n &#34;When they&#39;ve formed the specific shape we want, they&#39;re cut down and dried out, giving you a finished chair that has grown into one solid piece.&#34;\n It&#39;s a long process, taking around six years from start to finish. But Gavin is a patient man.\n   &#34;As a child I had a spinal condition and underwent surgery to straighten my back. Part of the treatment was in effect being grafted on a frame, similar to the way we graft trees. So I appreciated how forms can be shaped - and how long the process can take.\n &#34;Around about the same time, my mum had a bonsai tree. The bonsai was left to grow in its own direction and eventually formed itself into the shape of a throne. I was intrigued by this, the thought of a chair being created directly from nature.&#34;\n  Gavin&#39;s fascination with trees and wood grew into a business when he moved to California. He made his main living working as a gardener, but started to craft furniture from driftwood as a sideline.\n &#34;You do your shopping at the beach, collecting materials from what&#39;s washed up. You&#39;re using what&#39;s already there and there&#39;s a certain satisfaction to that.&#34;\n When Gavin returned to England, he wanted to continue working with the natural environment. Thinking back to his mum&#39;s bonsai, an idea began to form.\n &#34;If a bonsai grew into a chair shape, why not other furniture? Why couldn&#39;t I grow a whole field of it? There&#39;d be no waste plus it&#39;d be structurally stronger.&#34;\n  Ten years ago Gavin put his plan into action. With a £5,000 investment from a supportive friend he bought the basics, including a lawnmower, moulds and other equipment. There was some experimentation with materials to begin with.\n &#34;We looked at different types of wood and eventually settled on willow as the main crop. It&#39;s fast growing and relatively easy to work with.\n &#34;We wanted to offer other varieties such as cherry and oak, both for customer choice and also to spread the risk if they fall prey to a disease. I love the look of ash, for example, but it easily gets [the fungal disease] ash dieback.&#34;\n  There&#39;s also the problem of pests, says Gavin, who&#39;s trying to create a solution from the natural environment.\n &#34;I guess you could call this an open air factory and we&#39;re using this to our advantage. We&#39;ve taken on permaculture ideas, for example, tempting birds on to the land with nuts so that they&#39;ll eat the aphids and caterpillars.\n &#34;We&#39;ve also planted clover under the trees. The roots fix the nitrogen so the trees can access it better and the clover also covers the soil so it&#39;s not damaged by the sun.&#34;\n In a world where you can pick up the entire furnishings of your house in one afternoon in Ikea, Gavin&#39;s slower alternative seems to have caught the imagination of buyers.\n  &#34;Our first crop of chairs should be ready to harvest next year and we&#39;ve already sold out of pre-orders. We&#39;ve also had a lot of interest from people around the world who are interested in doing something similar.&#34;\n The pre-orders for chairs and lamps are sustaining the business for the time being and have generated just enough money to pay a few staff, one full-time and several part-time including Gavin&#39;s wife Alice.\n The time, effort and skills required to grow furniture mean that the pieces don&#39;t come cheap, however. Chairs are priced at £2,500, lamps start at £700 and mirror frames £450.\n So is grown furniture just something for the well-heeled and deep-pocketed? This is the case for the time being, but Gavin says his plans could see that change.\n &#34;We have a 50-year plan. There&#39;s plenty of scope for global scaling. Wherever trees grow, you can grow furniture,&#34; he reasons.", "posttime": "2020-07-26 23:50:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "田地,grows,树木", "title": "种植满是桌椅的田地的人", "title_en": "A man who grows fields full of tables and chairs", "transed": 1, "url": "https://www.bbc.com/news/business-32977012", "via": "", "real_tags": ["田地", "grows", "树木"]}, {"category": "", "categoryclass": "", "imagename": "c67d91b36e62eaeae76f20acaa85c723.png", "infoid": 1014286, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "佛教的四大真理构成了佛陀教义的核心。这些都在佛陀发表的第一次布道中得到了解释，被称为Ddhammacakkappavattana Sutta，在英语中大致翻译为“设置法轮或运动中的真理”。\n理解四个圣理是一个庞大的课题，需要详细而透彻的解释，不可能用一篇博客文章来涵盖。然而，我在这里提供的信息将作为那些希望理解佛陀教义的人的介绍性文本。\n佛陀的教义与其他人的不同之处在于，他提到，他的教义应该通过直接的经验来理解，而不是简单地相信他所说的话。\n他所说的经验可以通过不同的正念练习和冥想来验证。这些在经文(经文)中都有提及，世界各地的很多人都在实践。\n四个崇高的真理构成了可以应用于日常实际生活的根深蒂固的哲学的基础。他的教导的主要焦点是此时此地的未来。虽然这些教学是在公元前500年左右进行的，但它们经受住了时间的考验，至今仍然适用。\n乍一看，你可能会发现佛教非常悲观，因为它是从苦或苦的概念开始的。DUKKHA是巴利语中的一个词，由两个词组合而成：DUDU是“努力”的意思，KUKKHA是“忍耐”的意思。\n把“苦”翻译成英文，也就是“苦难”，是对这个词的过分简单化。不幸的是，英语中没有直接对应的词语。它有更深层次的含义，我们下一步将探讨这一点。\n“DUKKHA”这个词比英语单词“痛苦”要微妙得多。它包括伤害、疾病、衰老、精神痛苦、死亡、悲伤、悲伤、痛苦等等。它还包括日常生活中遇到的一些小挫折，如失望、不满和恼怒。\n当咖啡厅的服务员递给你一杯拿铁，而不是你要的卡布奇诺时，你会感到沮丧。\n我可以滔滔不绝，但你明白我的意思。所有这些都是苦差事。现在你可能会争辩说，这只是日常生活中正常的一部分。你怎么能称它为苦或苦呢？这发生在我们所有人身上，这很正常，对吧？\n你可能会争辩说，真正的苦恼是心爱的人去世，或者一夜之间失去了工作，或者因为经济崩溃而失去了所有的收入，或者离婚了。这些都是更紧迫的事情。没错！你是对的。以上都是苦差事。\n但这是大多数人不理解的。我们在日常生活中遇到的小挫折和不满会对我们的心理产生累积的负面影响。它以一种微妙的方式生长得非常缓慢。\n虽然心爱的人的死亡最初会让人伤心欲绝，但随着时间的推移，伤口会愈合的。创造的空虚可能永远不会消失，但最终，它的很大一部分会被时间填满。然而，在许多情况下，对我们心灵造成的微妙伤害没有被察觉。\n随着时间的推移，这些挫折感会积累到这样的程度，以至于一个人不得不结束自己的生命来逃避痛苦。问题是，我们已经将压力、焦虑和抑郁等疾病正常化，作为日常生活的一部分。\n例如，你可能会争辩说，丢掉工作也比被粗鲁地说话要糟糕得多。现在，这取决于你的个性。\n但总的来说，我观察到，人们很快就会忘记他们在失业时期所面临的困难。但即使多年后，他们仍然记得那次他们受到虐待或粗鲁言辞的事件。\n一旦你找到一份新工作，你就会忘记失去旧工作的痛苦。但是冒犯和贬低行为的事件会直接进入你的潜意识。\n随着时间的推移，这些会积累起来，造成巨大的精神痛苦，有时甚至会在肉体上表现为一种疾病。\n同样，你可能会争辩说，一个人无法逃脱生活中的这些不愉快。没错！你又说对了。但问题是--你打算在多大程度上忍受这些不愉快？我们所说的人生起起落落，只不过是一些事件而已。它们没有好坏之分。\n第一种是简单地理解痛苦，如疾病、伤害、衰老、死亡、悲伤、绝望、悲伤等等。它包括身体上和精神上的痛苦。我们上面已经报道过这种痛苦了。\n还有第二种痛苦是由变化引起的。每件事都会发生变化，最终都会结束。没有永久这回事。然而，心灵渴望永恒，因此，痛苦就出现了。例如，期望在关系、友谊、工作等方面有可靠的依恋，会导致不快乐。\n最后，佛陀所说的第三种痛苦是由条件反射状态造成的痛苦。用来形容这种痛苦的单词是“Sankara”，不幸的是，没有一个平行的英文单词可以形容它。有五种条件状态，也被称为五种集合体，或五种状态，其中一种是身体上的，另外四种是精神上的。\n现在我们来想一想。如果你仔细观察，第一圣洁真理的陈述和第四圣洁真理的陈述是矛盾的。\n第一个圣理说这个世界上所有的人都在受苦，而第四个圣理说有一条出路。这两种说法怎么可能都是真的呢？\n你看，第一圣理的陈述不是绝对的，因为苦伽是出于无知或狂热而生的。因此，一个人认为这个世界是苦行。对第四个崇高真理的理解使我们能够体验世界的本来面目。\n现在我们知道了苦是什么，让我们进入下一个部分：痛苦的起源。\n痛苦的起源是对三种欲望的执着(或罗巴)，也被称为坦哈(梵语中的Trishna)。\n这种渴望或口渴伴随着对感官愉悦的执着。我们总是寻找能刺激我们感官的东西。例如，我们看到一辆好车就会感到兴奋，而获得这辆车的强烈愿望是发自内心的。在佛教中，这是苦行的开始。\n任何能满足视觉、嗅觉、听觉、味觉和触觉这五种感官渴望的东西都是格摩坦哈。这背后的主要原因是，这些渴望只会带来暂时的满足。\n当你把注意力放在感官愉悦的物体上时，那一刻就标志着痛苦的开始。这种渴望的问题在于它是永无止境的。你拥有的越多，你想要的就越多。\n另一个例子是吃你最喜欢的食物或甜点。即使你吃完了，你也会想要更多。对于一些人来说，这种渴望在一两天后又会回来，而对另一些人来说，这种渴望会立即出现。\n然而，过去对心灵的制约是如此强烈，以至于我们看不出它有什么问题。一般来说，偶尔几分钟的强迫行为会造成长期的健康后果。\n巴瓦坦哈是以某种方式获得永恒的愿望。一个例子是死后继续在天堂领域作为意识存在的愿望。在这种情况下，对生命和存在的依恋如此之高，以至于一想到死后就不存在了，就让人感到恐惧。\n同样的，成为一名渴望开悟的僧侣也是婆罗门坦哈。修行冥想，吟诵咒语，表演仪式，以达到涅槃(从出生、死亡和重生的循环中解脱)的愿望，再次是婆罗门坦哈。\n这个坦哈很容易被误解。例如，当我几年前开始修行时，我发现自己落入了这个陷阱。\n当我更多地阅读这些经文的哲学方面时，我印象深刻，立即开始向我周围的人布道，即使他们并没有要求这样做。\n我对这些哲学思想建立了如此强烈的认同感，以至于过去当人们表现出不感兴趣的时候，我就会感到不安。\n但是，我渴望成为“最有学问”和“无所不知”的人，这让我失明了。我总是留意别人对我的看法。我不喜欢人们不同意我的想法。\n我所意识到的是，我又一次落入了同样的世俗陷阱。我在间接地寻求作为一名灵性教师的认可。被称为伟大老师的愿望迷惑了我。这种对被认可和表扬的渴望也是婆罗门坦哈。\n还有另一种类型的坦哈，它与婆罗门坦哈正好相反。它被称为Vibhava Tanha，那是摆脱事物的愿望。\n这种渴望通常发生在我们的努力失败的时候，比如建立一个有利可图的生意或获得精神上的启迪。我们很快就会对目前的环境感到幻灭，并开始反对它，认为它是我们痛苦的根源。\n因此，我们产生了一种想要摆脱导致不快乐的东西的愿望。例如，人们看到，对金钱和名望不再抱有幻想的人会转向灵性来寻求安慰。问题是，他们创造了另一种在精神上寻求和平的愿望。\n我们想要消除所有的负面情绪，比如愤怒、贪婪、仇恨、嫉妒、怨恨、焦虑等等。为了做到这一点，我们下意识地产生了一种欲望，想成为不受这些情绪影响的东西。\n第二个高尚的真理是关于实现和一代洞察力(而不是一种愿望)来放手欲望。当我们产生一种想要放弃其他吸引人的欲望时，我们就陷入了一个永无止境的陷阱，这就是大多数人修行出错的地方，只是后来幻想破灭了。\n通过洞察力冥想，一个人可以思考欲望的本质和它们的起源，这给了他们洞察力，让他们摆脱对这些欲望的依恋或认同。\n这里的想法并不是要摆脱所有导致欲望的想法，而是简单地认识到它们是心灵的条件反射。欲望本身不是问题--真正的问题是对欲望的依附(或把握)。\n心灵的条件作用是无常的，也就是说，它一直在变化；因此，执着于不断变化的东西必然会带来痛苦。\n然而，好消息是，这种局限是可以逆转的，这就把我们带到了第三个崇高的真理--停止痛苦。\n第三个崇高的真理可能是在实际生活中应用的最具挑战性的概念之一。我很难理解停止的意义。大多数人误以为停止就是压制或压制，这不是真的，而且极具破坏性。\n仅仅从理智上理解这些崇高的真理并不能解决我们的问题。这些概念必须在日常生活中实际应用才能实现。\n佛陀说，一切受制于升起的事物都会受制于停止。这意味着我们不应该在无常的事物中寻求庇护。那永远不会给我们带来持久的幸福。\n一小块一小块地追求快感会让我们上瘾。我们渴望更多，因为再多的东西也不会给我们带来持久的满足感。\n我们渴望的短暂的多巴胺分泌不会给我们带来真正的快乐；事实上，它是一种痛苦。也就是说，为同样的事情制造厌恶的感觉也是痛苦的。\n这不仅仅是一些抽象的哲学。您可以实际应用这些概念。但是，有效地做到这一点的唯一方法是培养一颗清晰的冥想心灵，它不容易被外界的干扰所腐蚀。头脑需要正确的训练才能体验沉默。\n只有在沉默中才会有深刻的洞察力，才能让智力达到最高水平。问题是，我们大多数人的头脑都在酝酿着这样一种想法，即为了追求幸福而获得感官愉悦的对象。\n我们追逐不同的目标，希望它们能提供持久的幸福，但这并没有实现。\n前一刻我们想吃糖果，所以我们吃巧克力来满足这种渴望，几分钟后，我们开始玩视频游戏，几分钟后，我们正在浏览我们的社交媒体订阅源。我们就像个瘾君子一样不停地用一件物品替换另一件物品。\n但是没有什么是永恒的！你嘴里那块巧克力的味道就消失了。你厌倦了玩电子游戏，社交媒体订阅会在某一时刻结束，但你仍然处于同样的不安状态，因为你创造了对无常事物的依恋。\n佛陀反对任何形式的极端修行。当他开悟时，他意识到人们要么完全被感官愉悦所迷惑，要么为了获得解脱而实行极端的禁欲主义。\n欲望可以欺骗我们，以至于一个人甚至可以执着于结束自己的生命来结束痛苦。这是对彻底毁灭的渴望，确保死后无一幸存。\n这两者都会阻碍涅槃(或开悟)的道路，因此，佛陀提倡中道。他宣称，依恋和厌恶都会产生源于无知的痛苦。\n依恋什么？对无常事物的依恋。对什么的厌恶？对丢弃引起渴望的东西的反感。那么解决方案是什么呢？只是不想再渴望了。\n我知道这一切听起来很抽象，甚至可能感觉像是压抑，但事实并非如此。对于初学者来说，放手的概念相当混乱，经常被误解，但通过反省和深思的实践，它是可以实现的。\n要训练我们的头脑“放手”，我们必须学会接受内在产生的一切。接受是走向复苏的第一步。我记得我修行的第一年，我是多么的痛苦。\n冥想所做的就是把我们潜意识的内容带入意识中。这些是深埋在我们潜意识中的一些最不舒服的感觉和创伤。\n我得到的启示是如此的压倒一切，以至于很多次我都想过完全停止冥想。太过分了。我本希望冥想能给我带来快乐和平静，但事实恰恰相反。\n然而，过了一段时间，我开始体验到我所希望的平静。不仅如此，我还能够非常平静地反思那些我压抑多年的想法。\n我学到的教训是，我们必须经历一点痛苦才能放下痛苦的原因。但这种痛苦是暂时的，它之所以存在，是因为行使了一种授权的控制，而不是压制。\n我们接受这种痛苦，欢迎它，让它有意识地出现，发挥它的作用，最后--让它过去--看着它结束。当我们放下那些起起落落的东西时，我们就体验到了空虚的终极快乐。这项练习需要通过训练头脑来培养耐心。\n人类的头脑是如此容易受骗，以至于很容易被这种解放或启蒙的想法所吸引。但这只是另一个陷阱(这是Vibhava Tanha-在第三个崇高真理中解释的)。\n虽然前两个圣理听起来很悲观，但第三个圣理给了我们一个保证，那就是有一条走出苦海的路。只有深思熟虑的心才能认识苦行的本质，才能找到解脱的道路。\n这样的心是通过修行佛陀在第四圣理中教导的八重道而发展起来的。\n第四个崇高的真理谈论的是八重道，或称塔坦吉卡Magga，它提供了一条走出苦海的途径。这条道路是通过实践以下几点来发展的。\nSila或道德-来自正确的言辞(Samma-vaca)、正确的行动(Samma-kammanta)和正确的生计(Samma-ajiva)。\n三摩地(或称专注)-来自正确的努力(Samma-Vayama)、正确的正念(Samma-Sati)和正确的专注(Samma-Samadhi)。\n正确的理解伴随着反思和沉思。理解为什么事情是这样的，而不是我们想要的样子。当我们根据我们之前的局限，将我们的意义赋予事物本来的样子时，问题就出现了。\n我看世界的方式可能与你的大不相同。这让我说对了吗？这件事没有对错之分，事情就是这样。例如，你可以看着一朵美丽的玫瑰，欣赏它的美丽，却不想采摘和占有它。\n当你赋予玫瑰花特殊的意义时，你会想要买一束，把它们放在花瓶里，然后把它们放在你的起居室里作为装饰品。那朵美丽的花不是给你带来乐趣的。只是欣赏美，不要产生占有的欲望。\n无论我们多么努力地强迫事情按我们的方式去做，它们永远都不会改变。正确的理解使我们能够通过直接的感知和理解来接受前三个高尚的真理。为此，必须培养心灵的纯洁性。\n这里的“渴望”一词并不表示渴望。看起来可能是这样，因为我们正在把巴利语单词“sankappa”翻译成英语。\n与欲望不同的是，这里提到的愿望不是出于无知，而是上述的正确理解。\n正确的愿望不是从绝望中寻求开悟而来的。它伴随着理解真相的意图或动作而来。我们的直觉智慧告诉我们，有一些东西超出了我们所知的真实世界。\n我们想要揭开的终极现实或真相。但是，受限的头脑阻碍了我们探索这一真理。它把我们困在琐碎的世俗欲望中。\n口语很有分量。没有想到的喋喋不休、闲聊和流言蜚语可能会带来严重的后果。说话是最难控制的事情之一。\n内心不快乐的人不会注意自己说的话，这样做的时候，他们会下意识地将自己的恐惧和不安全感投射到其他人身上。\n我们最终会因为无法控制自己的情绪而说不友善的话来伤害别人。我们的自我可能会在那一刻感到满足，但后来我们会后悔。通过重复这样的行为，我们训练自己变得更加愤怒和对他人不友好。\n我们觉得只要撒个小谎就可以逍遥法外。我们通过反复的行动养成了无意识撒谎的习惯。但只有在这个时候，哪怕是一个微小的无意识行为都会回来困扰我们。\n正确的行动包括不做伤害自己或他人的事情。它包括以下内容：\n正确的生计是关于思考你所做的工作的性质，以养活你自己和你的家庭。例如，如果你是一个纯粹为了利润而破坏生态的行业的一部分，你的生计是错误的。\n如果你依赖于通过出售有害物质或从事伤害人类和其他生物的恶意活动而蓬勃发展的企业，你需要反思更多。\n正确的生计是我们在现代需要思考的事情，因为我们对赚取财富的贪婪正在摧毁这个星球。我们不体贴的态度，加上缺乏同理心，正在给别人带来不幸。\n我们认为我们可以逃脱惩罚，但是因果报应有办法解决问题。我们迟早要为自己的行为付出代价，我们将无法通过借口和否认来逃避。\n佛陀的一个学生对他的冥想修行感到气馁，他向佛陀寻求指导。这位佛陀的学生是一名琵琶演奏家(在印度也被称为“锡塔尔”)。\n于是佛陀问他：“如果你拧紧琵琶的琴弦会怎么样？”学生回答说：“琴弦会断的。”接着，他又问：“如果你松开琴弦会怎么样？”学生回答说，“听起来不太好。”\n从上面的讨论中学到的是对我们的启示。\n.", "note_en": "The four noble truths in Buddhism forms the core of the Buddha’s teachings. These are explained in the very first sermon delivered by Buddha, known as  dhammacakkappavattana sutta, which in English loosely translates to, “Settings the wheel of dhamma or the truth in motion.”\n  Understanding  the four noble truths is a vast subject that needs a detailed and thorough explanation, and it’s impossible to cover it in a single blog post. However, the information I present here will serve as an introductory text for those who wish to understand Buddha’s teachings.\n What differentiates Buddha’s teachings from others is that he mentions that his teachings should be understood through direct experience rather than simply believing what he says.\n The experiences that he talks about can be verified through different mindfulness practices and meditations. These find mention in the texts ( suttas) and practiced by a lot of people all across the world.\n Four noble truths form the foundation of a deep-rooted philosophy that can be applied to daily practical life. The primary focus of his teachings is on the  here and now. Although these teaching were delivered sometime around 500 BCE, they have stood the test of time and are still applicable today.\n At first glance, you may find Buddhism to be very pessimistic, as it starts with the concept of dukkha or suffering. Dukkha is a word of the Pali language, which is a combination of two words:  du means “hard,” and  kkha means “to endure.”\n Translation of dukkha in English, referred to as the suffering, is a gross oversimplification of the term. Unfortunately, there is no direct equivalent in the English language. It has a much deeper meaning, which we shall explore next.\n   The word dukkha is much more subtle than the English word suffering. It constitutes injury, sickness, old age, mental pain, death, sorrow, grief, anguish, and more. It further includes minor frustrations such as disappointments, dissatisfactions, and irritations encountered in daily life.\n  Frustration when the server at the coffee shop hands you a latte instead of the cappuccino you asked.\n I can go on and on, but you get the idea. All of this is dukkha. Now you may argue that this is just a normal part of daily living. How can you call it dukkha or suffering? It happens to all of us, and it’s normal, right?\n You may argue that the real dukkha is passing away of a loved one, or losing a job overnight, or losing all of your income because of the collapse of the economy, or getting a divorce. These are more pressing matters. And yes! You’re right. All of the above are dukkha.\n But here’s what most people don’t understand. The minor frustrations and dissatisfaction that we encounter in our daily lives have a cumulative adverse effect on our psyche. It grows very slowly in a subtle manner.\n While the death of a loved one hurts a lot initially, the wounds heal with time. The created void may never go, but eventually, much of it is filled up with time. However, the subtle injuries caused to our psyche go undetected in many of the cases.\n Over time, these frustrations get accumulated to such an extent that one resorts to ending one’s life to escape the pain. The problem is that we have normalized ailments like stress, anxiety, and depression, as a part of daily life.\n For example, you might argue that losing a job is much worse than being rudely spoken too. Now, this would depend on your personality.\n But in general, I have observed that people soon forget about the hardships they face during the times of unemployment. But even after years, they still remember the incident where they were ill-treated or rudely spoken too.\n Once you get a new job, you forget about the pain of losing your old job. But the incidents of offensive and demeaning behaviors go directly into your subconscious.\n These get accumulated over time and create great mental suffering, and sometimes even manifest as a disease in the physical body.\n Again, you may argue that one cannot escape these unpleasantries of life. And yes! You are right again. But the question is – How much do you intend to suffer these unpleasantries? What we call as ups and downs of life are merely just events. There’s nothing good or bad about them.\n   The first is simple to understand suffering, like sickness, injury, old age, death, grief, despair, sorrow, etc. It includes both physical and mental pain. We have already covered this kind of suffering above.\n There is a second kind of suffering that is caused by change. Everything is subject to change and finally comes to an end. There is no such thing as a permanency. However, the mind craves for permanency, and therefore, the suffering arises. For example, expecting secure attachments in relationships, friendships, work, etc., results in unhappiness.\n Finally, the third kind of suffering buddha talks about is suffering due to the conditioned states. The word used for this suffering is “ Sankara.” Unfortunately, there is no parallel English word that can describe it. There are five conditioned states, also known as the five aggregates, or  skandhas, where one is physical, and the other four are mental.\n Now here’s something to think. If you notice carefully, there’s a contradiction between the statement of the first noble truth and the fourth noble truth.\n The first noble truth says that all in this world is suffering, while the fourth noble truth says that there is a way out of it. How can both of these statements be true?\n You see, the statement of the first noble truth is not an absolute, because the dukkha is born out of ignorance or  avidya. Hence, one perceives this world as dukkha. The understanding of the fourth noble truth enables us to experience the world as it is.\n Now that we know what dukkha is let’s get to the next section: the origin of suffering.\n  The origin of suffering is attachment (or L obha) to three kinds of cravings, also known as Tanha (or Trishna in Sanskrit).\n  This kind of craving or thirst comes with the attachment to sensory pleasures. We always seek things that excite our senses. For example, we get exciting seeing a nice car, and a strong desire to acquire it arises from within. In Buddhism, this is the beginning of dukkha.\n Anything that satisfies the craving of the five senses: vision, smell, hearing, taste, and touch – is Kama Tanha. The main reason behind this is that these cravings only give temporary satisfaction.\n The moment you set your attention to sensory pleasure objects, that very moment marks the beginning of suffering. The problem with this kind of craving is that it is insatiable. The more you have, the more you want.\n Another example would be eating your favorite food or dessert. Even after you’ve finished eating, you crave more. For some, this craving comes back after a day or two, while for others, it comes back instantly.\n However, the past conditioning of the mind is so intense that we do not see anything wrong with it. A few minutes of compulsive behavior now and then, generally speaking, creates long term health consequences.\n  Bhava Tanha is the desire to achieve permanence in some way. One example would be the desire to continue in the heavenly realms as consciousness after death. In this case, the attachment to life and existence is so high that the very thought of not existing after death scares people.\n Similarly, becoming a monk with the desire to attain enlightenment is also Bhava Tanha. Practicing meditation, chanting, reciting mantras, performing rituals in the desire to achieve the  nirvana (the freedom from the cycle of birth, death, and rebirth) is again Bhava Tanha.\n It is easy to misunderstand this Tanha. For example, when I started my spiritual practice a couple of years ago, I found myself falling into this trap.\n As I read more into the philosophical aspects of these scriptures, I was so impressed that I immediately started giving sermons to the people around me, even when they didn’t ask for it.\n I had built such strong identifications with these philosophical ideas that I used to get upset when people showed disinterest.\n But my thirst for being the “most knowledgeable” and “all-knowing” had blinded me. I was always keeping a check on how other people perceived me. And I didn’t like it when people disagreed with my ideas.\n What I realized was that I had fallen into the same worldly trap once again. I was indirectly seeking recognition as a spiritual teacher. The desire to be known as the great teacher was deluding me. This desire for being recognized and praised is also Bhava Tanha.\n  There is another type of Tanha that is the exact opposite of Bhava Tanha. It is known as Vibhava Tanha, that is the desire to get rid of things.\n This craving generally happens when we fail in our endeavors, such as building a profitable business or attaining spiritual enlightenment. We quickly get disillusioned by the present circumstances and become opposed to it, believing it to be the root cause of our suffering.\n Therefore, we create a desire to get rid of things that leads to unhappiness. For example, it is seen that people who get disillusioned with money and fame turn towards spirituality in search of solace. The problem is that they create another desire to seek peace in spirituality.\n We want to eliminate all the negative emotions like anger, greed, hatred, jealousy, resentment, anxiety, etc. To do so, we unconsciously create a desire to become something untouched by these emotions.\n The second noble truth is about realization and  generation of insight (and not a desire) to let go of the desire. When we create a desire to let go of other attractions, we fall into a never-ending trap, and this is where most people go wrong with their spiritual practice, only to be disillusioned later.\n Through insight meditation, one can contemplate the nature of desires and their origin, and that gives them the insight to let go of the attachment or identification to those desires.\n The idea here is not to get rid of all the thoughts that lead to desires but to simply recognize them as conditioning of the mind. The desire in itself is not a problem – the real issue is the attachment (or grasping) to the desire.\n Conditioning of the mind is impermanent ( anicca), i.e., it keeps on changing; therefore, attachment to something that is continuously changing is bound to bring pain.\n However, the good news is that this conditioning can be reversed, and that brings us to the third noble truth – the cessation of suffering.\n  The third noble truth is perhaps one of the most challenging concepts to apply in practical life. I had a hard time understanding the meaning of cessation. Most people mistake cessation for suppression or repression, which is not true and is very damaging.\n Merely understanding these noble truths intellectually is not going to solve our problem. These concepts have to be applied practically in day to day life to realize them.\n Buddha said that  everything subject to arising is subject to ceasing. What that implies is that we should not find refuge in impermanent things. That will never give us abiding happiness.\n Chasing highs in small chunks makes us into an addict. We crave more because no amount of it ever gives abiding satisfaction.\n The short burst of dopamine secretion that we crave is not going to provide us with real happiness; in fact, it is a pain. That said, creating feelings of aversion for the same is also pain.\n This is not just some abstract philosophy. You can practically apply these concepts. But the only way to do that effectively is to develop a clear contemplative mind that is not easily corrupted by the external disturbances. The mind requires the correct training to experience silence.\n Only in silence comes deep insight, which allows the intellect to function at its highest levels. The problem is that most of us have a mind that is brewing with thoughts of acquiring objects of sense pleasures in pursuit of happiness.\n We run after different objects hoping that they will provide lasting happiness, but that does not happen.\n One moment we crave sweets, so we eat chocolate to satisfy that craving, after a few minutes, we start playing video games, a couple of minutes later we are scrolling through our social media feeds. We keep going on replacing one object for another like an addict.\n But nothing lasts! The taste of that chocolate in your mouth perishes. You get bored playing video games, social media feeds end at a point, but you remain in the same restless state because you created attachment with impermanent things.\n Buddha was against following any kind of extreme practice. When he got enlightenment, he realized that people were either entirely deluded by sense pleasures or practicing extreme asceticism to attain liberation.\n Desire can delude us to such an extent that one can even get attached to ending one’s life to put an end to suffering. This is the desire for complete annihilation, making sure that nothing survives after death.\n Both of these cause hindrance in the path of  Nibbana (or enlightenment), and therefore, the Buddha advocated the middle path. He declared that both attachment and aversion create suffering that is born out of ignorance.\n Attachment to what? Attachment to impermanent things. And an aversion to what? Aversion to getting rid of things that cause craving. So what’s the solution?  Just letting go of the craving.\n I know all of this sounds abstract and may even feel like suppression, but it’s not. The concept of letting go is quite confusing for beginners and is often misunderstood, but through the practice of reflection and deep contemplation, it can be realized.\n  To train our minds “to let go,” we must learn to accept all that arises within. Acceptance is the first step towards recovery. I remember the first year into my meditation practice; How miserable I was.\n What meditation does is that it brings the contents of our subconscious into the conscious mind. These are some of the most uncomfortable feelings and traumas that are buried deep within our subconscious mind.\n The revelations I had were so overwhelming that many times I thought about quitting meditation altogether. It was too much. I was hoping that meditation would bring me joy and calm, but exactly the opposite was happening.\n However, after some time, I started experiencing the calm I had hoped. Not only that, but I was also able to reflect very peacefully on those thoughts that I had suppressed for years altogether.\n The lesson I learned was that we have to undergo a little pain to let go of the cause of suffering. But this pain is temporary, and it is there because of exercising an empowering control, and not suppression.\n We accept this suffering, welcome it, let it arise consciously, play its part, and finally – let go of it – watch it end. When we let go of that which arises and ceases, we experience the ultimate joy of emptiness. This exercise requires the cultivation of patience by training the mind.\n The human mind is so gullible that it is easy to get hooked to this idea of liberation or enlightenment. But that is just another pitfall (this is Vibhava Tanha – explained in the third noble truth).\n While the first two noble truths sound pessimistic, the third noble truth gives us the surety that there is a way of out of dukkha. Only a reflective and contemplative mind can realize the nature of dukkha and figure out the path of liberation.\n Such a mind is developed by practicing the eightfold path taught by Buddha in the fourth noble truth.\n  The fourth noble truth talks about the eightfold path, or the  atthangika magga, which offers a way out of the dukkha. This path is developed by practicing the following.\n  Sila or morality – comes from Right Speech (samma-vaca), Right Action (samma-kammanta), and Right Livelihood (samma-ajiva).\n Samadhi or concentration – comes from Right Effort (samma-vayama), Right Mindfulness (samma-sati), and Right Concentration (samma-samadhi).\n  Right understanding comes with reflection and contemplation. Understanding why things are the way they are, rather than the way we want them to be. The problems arise when we assign our meaning to the way things are, based on our previous conditioning.\n My way of looking at the world may be quite different from yours. Does that make me right? There’s nothing right or wrong about it; it’s just the way it is. For example, you may look at a beautiful rose and appreciate its beauty without the desire to pluck and possess it.\n The moment you assign a special significance to the rose, you’ll want to get a bunch of them, put them in a vase, and place them in your living room as a decoration. That beautiful flower is not there for your pleasure. Just appreciate the beauty without creating a desire for possession.\n No matter how much we try to force things our way, they will always be the way they are. Right understanding enables us to accept the first three noble truths through direct perception and understanding. And for that, purity of mind has to be developed.\n  The word aspiration here does not indicate desire. It might seem so because we are translating the pali word “sankappa” into English.\n Unlike desire, the aspiration mentioned here does not come out of ignorance but the Right Understanding described above.\n The right aspiration does not come out of desperation to seek enlightenment. It comes with an intention or movement to understand the truth. Our intuitive intelligence tells us there’s something beyond what we know as the real world.\n An ultimate reality or truth that we want to uncover. But the conditioned mind prevents us from exploring this truth. It keeps us trapped in the petty worldly desires.\n  Spoken words carry a lot of weight. Unthought of blabbering, chatting, and gossips can have severe consequences. And speech is one of the most challenging things to control.\n Internally unhappy people don’t take any cognizance of what they speak, and in doing so, they unconsciously project their fears and insecurities to other people.\n We end up hurting people by saying unkind words out of our inability to regulate ourselves emotionally. Our ego might feel satisfied at that very moment, but we regret it later on. By repeating such behavior, we train ourselves to be more angry and unkind to others.\n We feel that we can get away with small lies. We make a habit of lying unconsciously through repeated action. But its only time when even a minor act of unconscious behavior comes back to haunt us.\n  Right action involves refraining from doing things that harm ourselves or others. It includes the following:\n   Right livelihood is about contemplating the nature of work you do to sustain yourself and your family. For example, If you’re a part of an industry that destroys ecology just purely for profits, your livelihood is wrong.\n If you’re dependant on businesses that thrive by selling harmful substances or engage in malicious activities that harm humans and other beings, you need to reflect more.\n Right Livelihood is something we need to ponder in modern times because our greed for earning wealth is destroying the planet. Our inconsiderate attitude, coupled with a lack of empathy, is bringing misfortune to others.\n We think we’ll get away with this, but karma has its way of figuring out things. Sooner or later, we’ll have to pay for our deeds, and we will not be able to escape through excuses and denials.\n  One of the Buddha’s students was discouraged with his meditation practice, and he asked Buddha for guidance. This student of Buddha was a lute player (also known as “sitar” in India).\n So the Buddha asked him, “What would happen if you tighten the strings of your lute?”, the student replied, “They would break.”, Next, he asked, “What would happen if you loosen the strings?”, the student replied, “It would not sound good.”\n The learning from the above discussion was that for t\n......", "posttime": "2020-07-26 23:42:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "四大,truths,痛苦", "title": "佛教的四大真理", "title_en": "The Four Noble Truths in Buddhism", "transed": 1, "url": "https://mindfulnessquest.com/four-noble-truths-buddhism/", "via": "", "real_tags": ["四大", "truths", "痛苦"]}, {"category": "", "categoryclass": "", "imagename": "1847ae8813680a40230c773212247427.png", "infoid": 1014285, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在2020年开幕日，MLB将推出其升级后的Statcast平台，采用鹰眼创新公司的光学跟踪传感器和谷歌云的云基础设施。鹰眼Statcast系统已经证明在投球、击球和球员跟踪方面的准确性有了显著的提高，其姿势跟踪能力为分析开辟了一个令人兴奋的新领域。此外，MLB正在整合其在Google Cloud上的基础设施，以利用Google业界领先的机器学习、分析、应用程序管理和数据/视频存储功能来提高可靠性并大规模管理治理。这些合作伙伴关系将共同支持消费者的下一级体验，并激励世界各地的粉丝。\n由保罗·霍金斯博士于1999年创立的鹰眼创新公司已经开发出用于65个国家和20多个运动项目的光学跟踪系统，从板球、网球和足球开始。鹰眼公司的技术已经改变了体育跟踪、视频和裁判领域，最引人注目的是它在网球领域的电子线路呼叫系统和足球领域的球门线技术和智能重播系统。\n鹰眼通过2014年推出视频回放系统首次与MLB合作，这是一次成功的合作伙伴关系，使MLB裁判每个赛季能够确认或纠正超过1000次呼叫。现在，鹰眼已经将其最先进的跟踪软件调整到棒球场、安打和球员，以进一步发展与MLB和30家俱乐部的关系。\n谷歌云为组织提供领先的基础设施、平台功能和行业解决方案。他们提供企业级云解决方案，利用谷歌的尖端技术帮助公司更高效地运营并适应不断变化的需求，为客户提供面向未来的基础。谷歌云的客户遍及全球，其中包括美国职业棒球大联盟(Major League Baseball)，该公司于2018年开始与谷歌云产品合作，自那以来一直在扩大合作伙伴关系。作为多年合作伙伴关系的一部分，谷歌云已被任命为MLB的官方云数据和分析合作伙伴，并将成为MLB在广告交付、流媒体、云计算和机器学习方面持续创新的关键组件。\n鹰眼Statcast系统利用公园周围总共12个摄像头进行全视场光学投球、击球和球员跟踪。五个摄像头以每秒100帧的速度运行，主要用于球场跟踪，而另外七个摄像头以每秒50帧的速度专注于跟踪球员和击球手。\n鹰眼的光学系统结合了球和球员跟踪，如图4所示，以确定每个球场的精确放球点和轨迹。这种方法将投手力学和由此产生的投球轨迹联系在一起，以揭示两者之间的关系。\nSTATCAST 2020系统还能够直接测量俯仰旋转速率和旋转轴，而不是像以前的系统那样，从观察到的球路径推断其中一个或两个测量结果。这一改进提高了精确度，并为间距设计和开发打开了新的大门。\n当所有这些视频都被记录下来并对数据进行处理时，鹰眼的软件会将数据传输到MLB的PostgreSQL数据库，该数据库托管在谷歌云中。从那里，它通过同样由Google Cloud提供支持的Stats API应用程序分发给俱乐部和MLB合作伙伴。多个视频源也被剪辑并保存在Google Cloud Storage中，这也是MLB新的高级视频搜索的动力。\n鹰眼的18点姿势跟踪能力将允许Statcast扩展到质心点之外，以跟踪每个游戏过程中的姿势和方向。通过鹰眼的数据收集和谷歌的BigQuery产品及其机器学习功能，投手和击球手的力学分析、外野手反应时间等将成为可能。此外，这种姿势跟踪数据可以为新的数字和增强现实产品提供动力，并让粉丝获得完全身临其境的体验。\n鹰眼还开始测试蝙蝠跟踪功能，这将为教练和球迷评估击球机制和挥杆路径打开新的大门。\n通过独立测试，MLB发现鹰眼STATCAST系统从俯仰精度开始，表现出显著的精度改进。在反复测试中发现，棒球中心在本垒板前面的测量位置平均精度在0.25英寸以内，其中一些误差可归因于地面真相测试系统。换句话说，鹰眼统计广播系统在铅笔或图钉顶端的宽度内是精确的。下面的图6显示了相对于棒球本身大小测量的板位置精度。\n已经进行了类似的测试来验证投球释放点、投球旋转率、击球位置和球员位置，证实了全面的改善。与传统系统下来自不同供应商的摄像头和雷达不同，12个鹰眼摄像头作为一个凝聚力单元工作，随时跟踪球和球员的运动。例如，当一个飞得很高的球离开一个摄像机的视野时，其他摄像机可以继续沿着它的轨迹跟踪球。此外，如果球离开了所有12个摄像头的视野(就像在高弹出式和飞球上发生的那样)，那么系统就可以在稍后的轨迹中重新捕获球，因为重力会将它拉回一个或多个摄像头的视野中。通过更全面地跟踪球的完整飞行，新系统的着陆点测量已经被证明在整个赛场上的精确度在1英尺以内。\n除了测量精度外，鹰眼STATCAST系统的全场覆盖范围允许更全面地跟踪每场比赛之前、期间和之后的每一项行动。例如，以前的系统很难跟踪大约一半的外野手投球，特别是沿线投球和跨场投球；相比之下，鹰眼系统几乎完全覆盖了球场上的每一次投球和接球。\n鹰眼STATCAST系统的这一增强保真度将使开发一套新的STATCAST指标(特别是现场指标)和数字产品成为可能。\n下一代Statcast数据将继续在许多MLB平台上集成，包括Gameday、MLB.com、Baseball Savant以及比赛和演播室广播。国家广播合作伙伴ESPN、福克斯和特纳以及地区体育网络定期通过MLB的Live Strike Zone、Pitchcast、Replay和其他产品利用Statcast数据。Statcast 2020系统跟踪球和球员，并在整个比赛过程中将他们的精确坐标传递给广播合作伙伴，时间不到250毫秒。此外，Statcast数据现在可以通过MLB合作伙伴Sportradar和FanGraphs获得。MLB将继续与合作伙伴合作，通过下一代Statcast数据进一步提升球迷体验。", "note_en": "On Opening Day 2020, MLB will introduce its upgraded Statcast platform featuring optical tracking sensors from  Hawk-Eye Innovations and cloud infrastructure from  Google Cloud. The Hawk-Eye Statcast system has demonstrated significant accuracy improvements in pitch, hit, and player tracking, and its pose tracking capabilities open up an exciting new frontier for analysis. Additionally, MLB is consolidating its infrastructure on Google Cloud to leverage Google’s industry-leading machine learning, analytics, application management, and data/video storage capabilities to increase reliability and manage governance at scale. Together, these partnerships will support next-level experiences for consumers and inspire fans around the world.\n  Hawk-Eye Innovations, founded by Dr. Paul Hawkins in 1999, has developed optical tracking systems used in 65 countries and over 20 sports,  beginning with cricket, tennis, and soccer. Hawk-Eye’s technology has transformed the sports tracking, video, and officiating landscape, most notably its  Electronic Line Calling system in tennis and  Goal Line Technology and SMART Replay systems in soccer.\n Hawk-Eye first partnered with MLB through the 2014 launch of the  video replay system, a successful partnership that has allowed MLB umpires to confirm or correct over 1,000 calls per season. Now, Hawk-Eye has adapted its state-of-the-art tracking software to baseball pitches, hits, and players to further grow its relationship with MLB and the 30 Clubs.\n  Google Cloud provides organizations with leading infrastructure, platform capabilities and industry solutions. They deliver enterprise-grade cloud solutions that leverage Google’s cutting-edge technology to help companies operate more efficiently and adapt to changing needs, giving customers a foundation for the future. Google Cloud customers span the globe and include Major League Baseball, which began working with Google Cloud products in 2018 and has been growing the partnership ever since. As part of a multi-year partnership, Google Cloud has been named the  Official Cloud Data and Analytics partner of MLB and will become a key component in MLB’s continued innovation in ad delivery, streaming, cloud computing, and machine learning.\n    The Hawk-Eye Statcast system utilizes a total of 12 cameras around the park for full-field optical pitch, hit, and player tracking. Five cameras operating at 100 frames per second are primarily dedicated to pitch tracking, while an additional seven cameras are focused on tracking players and batted balls at 50 frames per second.\n  Hawk-Eye’s optical system combines ball and player tracking as demonstrated in Image 4 to determine the precise release point and trajectory for every pitch. This approach ties together pitcher mechanics and the resulting pitch trajectory to shed new light on the relationship between the two.\n  The Statcast 2020 system is also able to directly measure both pitch spin rate and spin axis rather than inferring one or both measurements from the observed path of the ball as previous systems have done. This enhancement leads to greater accuracy and opens up new doors for pitch design and development.\n As all of this video is recorded and the data is processed, Hawk-Eye’s software transmits the data to MLB’s PostgreSQL database hosted in Google Cloud. From there, it is distributed to Clubs and MLB partners through the Stats API application, also powered by Google Cloud. Multiple video feeds are also clipped and saved off in Google Cloud Storage, which also powers MLB’s new  advanced video search.\n  Hawk-Eye’s 18-point pose tracking capabilities will allow Statcast to expand beyond center-of-mass points to track pose and orientation over the course of each play. Analysis of pitcher and hitter mechanics, fielder reaction times, and more will be made possible through Hawk-Eye’s data collection and Google’s BigQuery product and its machine learning capabilities. Furthermore, this pose tracking data could power new digital and augmented reality products and engage fans with wholly immersive experiences.\n  Hawk-Eye has also begun testing bat tracking capabilities, which would open new doors for coaches and fans to evaluate hitting mechanics and swing paths.\n  Through  independent testing, MLB has found the Hawk-Eye Statcast system to exhibit significant accuracy improvements, beginning with pitch accuracy. The measured location of the center of the baseball at the front of home plate has been found in repeated testing to be accurate within 0.25 inches on average, with some of that error attributable to the ground truth testing system. In other words, the Hawk-Eye Statcast system is accurate within the width of a pencil or the top of a pushpin. Image 6 below demonstrates the measured plate location accuracy relative to the size of the baseball itself.\n  Similar tests have been conducted to verify pitch release point, pitch spin rate, hit locations, and player locations, confirming improvements across the board. Unlike the cameras and radar from different vendors under the legacy system, the 12 Hawk-Eye cameras work as one cohesive unit to track the ball and players in motion at all times. For example, when a high fly ball leaves one camera’s field of view, other cameras can continue to track the ball along its trajectory. Furthermore, if the ball leaves the field of view of all 12 cameras (as can happen on high pop-ups and fly balls), the system can then reacquire the ball later in its trajectory as gravity pulls it back into the view of one or more cameras. By more comprehensively tracking the full flight of the ball, the new system’s landing point measurements have been demonstrated to be within about one foot of accuracy across the field of play.\n In addition to measurement accuracy, the Hawk-Eye Statcast system’s full field coverage allows for more complete tracking of every action before, during, and after each play. For example, the previous system struggled to track about half of fielder throws, particularly throws down the lines and across the field; by contrast, the Hawk-Eye system approaches complete coverage of every throw and catch on the field of play.\n This enhanced fidelity of the Hawk-Eye Statcast system will enable the development of a new suite of Statcast metrics (especially  fielding metrics) and digital products.\n  Next-generation Statcast data will continue to be integrated across many MLB platforms, including  Gameday,  MLB.com,  Baseball Savant, and game and studio broadcasts. National broadcast partners ESPN, FOX, and Turner as well as regional sports networks regularly utilize Statcast data through the MLB’s Live Strike Zone, Pitchcast, Replay, and other products. The Statcast 2020 system tracks the ball and players and delivers their precise coordinates to broadcast partners in under 250 milliseconds throughout the game. Additionally, Statcast data is now available through MLB partners  SportRadar and  FanGraphs. MLB will continue working with its partners to further enhance the fan experience through next generation Statcast data.", "posttime": "2020-07-26 23:40:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,2020,谷歌,推出,introducing", "title": "(MLB)推出Statcast 2020：鹰眼和谷歌云", "title_en": "(MLB) Introducing Statcast 2020: Hawk-Eye and Google Cloud", "transed": 1, "url": "https://technology.mlblogs.com/introducing-statcast-2020-hawk-eye-and-google-cloud-a5f5c20321b8", "via": "", "real_tags": ["google", "2020", "谷歌", "推出"]}, {"category": "", "categoryclass": "", "imagename": "dfa542b7e5e900e2825184e96ffb4c52.jpg", "infoid": 1014283, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "战略网络是事业成功的关键，而不仅仅是对人类而言。一项对野生宽吻海豚的新研究显示，在早期生命中，海豚花更多的时间建立联系，这可能会在以后给它们带来优势。\n乔治敦大学和杜克大学的研究人员报告说，10岁以下的海豚寻找同伴和活动，可以帮助它们建立联系，建立成年所需的技能。\n该团队分析了西澳大利亚鲨鱼湾1700多头野生宽吻海豚近30年的记录。自20世纪80年代以来，研究人员一直在乘船进入这个偏远的海湾，并记录他们遇到的任何海豚的性别、年龄和行为等情况。\n在目前的研究中，研究小组重点收集了从断奶到10岁的年轻人的数据，观察他们和谁一起出去玩，以及他们在没有成年人在场的情况下是如何度过时间的。\n大约3到4岁时，海豚离开母亲的保护，独自冒险，生活在不断变化的群体中，聚在一起，分开，然后以不同的组合再次聚集在一起。\n研究表明，尽管小海豚在一天中每隔十分钟就会从一个群体飞到另一个群体，但它们往往会花更多的时间和几个亲密的朋友在一起。\n研究表明，这些同伴不仅仅是朋友，因为他们共享同一水域，而且更频繁地相遇。“这些关系反映了真实的偏好，”第一作者艾莉森·加莱佐(Allison Galezo)说，他是杜克大学苏珊·阿尔贝茨教授实验室的生物学博士生。\n男性更喜欢和其他男性在一起；女性更喜欢和其他女性在一起。但研究人员观察到，男性和女性往往以不同的方式互动。男性比女性更有可能在一起休息或进行友好的身体接触：摩擦鳍状肢，近距离游泳，以及模仿对方的动作。而女性的社交次数较少，取而代之的是她们花在觅食鱼类上的时间是男性的两倍。\n加莱佐说，这些差异表明，幼年海豚的社交生活可能会受到即将到来的成年需求的影响。\n对于成年男性来说，拥有其他男性的支持是他们有机会遗传基因的关键。在鲨鱼湾，两到三只雄性海豚经常联合起来，让有生育能力的雌性海豚单独与它们在一起，并强迫它们交配。到他们长大的时候，男性将需要有足够的社会洞察力来建立和维持强大的联盟，否则就会失去得到女孩的机会。\n另一方面，作为一只成功的成年雌性，意味着要照顾至少三岁才断奶的小牛。哺乳的母亲需要更多的卡路里，因此年轻的女性可能会花更多的时间寻找食物来练习她们稍后需要的技能，然后才能完全了解母亲的身份。\n加莱佐说：“青春期可能是一个发展社交技能的机会，这些技能在成年后很重要，没有随随性成熟而来的高风险。”\n这项工作得到了国家科学基金(0847922,0820722,9753044,0316800,0918308,0941487,1559380,1755229)和乔治敦大学的资助。\n引用：青少年社会动态反映宽吻海豚的成年生殖策略，&#34；艾莉森·A·加莱佐，Vivienne Foroughirad，Ewa Krzyszczyk，Céline H.Frère，珍妮特·曼。行为生态学，2020年7月14日。Doi：10.1093/beheco/araa068", "note_en": "Strategic networking is key to career success, and not just for humans. A new  study of wild bottlenose dolphins reveals that in early life, dolphins devote more time to building connections that could give them an edge later on.\n Researchers at Georgetown University and Duke University report that dolphins under age 10 seek out peers and activities that could help them forge bonds and build skills they’ll need in adulthood.\n  The team analyzed nearly 30 years’ worth of records for more than 1700 wild bottlenose dolphins in Shark Bay in Western Australia. Since the 1980s, researchers have been taking boats out into this remote bay and noting things like the sex, age and behavior of any dolphins they encountered.\n For the current study, the team focused on data collected on youngsters from weaning to age 10, looking at who they hung out with and how they spent their time when no adults were around.\n Around 3 or 4 years old, dolphins leave the protection of their mothers to venture off on their own, living in ever-changing groups that come together, split up and come together again in different combinations.\n The study revealed that, even though young dolphins flit from group to group as often as every ten minutes throughout the day, they tend to spend more time with a few close friends.\n These companions aren’t just friends because they share the same areas of water and bump into each other more often, the research shows. “These relationships reflect true preferences,” said first author  Allison Galezo, a biology Ph.D. student in professor Susan Alberts’ lab at Duke.\n Males prefer to hang out with other males; females with other females. But the researchers observed that males and females tend to interact in different ways. Males were more likely than females to spend their time together resting or engaged in friendly physical contact: rubbing flippers, swimming close together and mirroring each other’s movements. Whereas females socialized less often, and instead spent twice as much time as their male counterparts foraging for fish.\n These differences suggest that the social lives of young dolphins may be shaped by the upcoming demands of adulthood, Galezo said.\n For adult males, having other males in their corner is key to have a chance at passing on their genes. In Shark Bay, groups of two to three male dolphins often join forces to get fertile females alone with them and coerce them to mate. By the time they grow up, males will need to have enough social savvy to build and maintain strong alliances, or lose out on their chance to get a girl.\n Being a successful adult female, on the other hand, means caring for calves that aren’t weaned until they’re at least three years old. Nursing moms need more calories, and so young females may spend more time foraging to practice skills they’ll need later on, before the full realities of motherhood set in.\n “The juvenile period can be an opportunity to develop social skills that will be important in adulthood, without the high-stakes risks that go with sexual maturity,” Galezo said.\n This work was supported by grants from the National Science Foundation (0847922, 0820722, 9753044, 0316800, 0918308, 0941487, 1559380, 1755229) and by Georgetown University.\n CITATION: &#34;Juvenile Social Dynamics Reflect Adult Reproductive Strategies in Bottlenose Dolphins,&#34; Allison A. Galezo, Vivienne Foroughirad, Ewa Krzyszczyk, Céline H. Frère, Janet Mann. Behavioral Ecology, July 14, 2020. DOI:  10.1093/beheco/araa068", "posttime": "2020-07-26 23:11:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "明智地,dolphins,海豚", "title": "小海豚明智地挑选它们的朋友", "title_en": "Young dolphins pick their friends wisely", "transed": 1, "url": "https://today.duke.edu/2020/07/young-dolphins-pick-their-friends-wisely", "via": "", "real_tags": ["明智地", "dolphins", "海豚"]}, {"category": "", "categoryclass": "", "imagename": "def7f45f83f87eab66347236ec08ed0a.jpg", "infoid": 1014282, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据一项新的研究，在细胞测试中，一种海藻提取物在驱逐新冠肺炎方面优于雷米西韦。\n这项研究是调查针对新冠肺炎等病毒的诱饵策略的更大研究的一部分。这一策略的工作原理是敦促病毒将其锁定在诱饵上，而不是健康的人类细胞上，然后在那里它会被捕获、中和并最终被摧毁。\n在新冠肺炎的案例中，SARS-CoV-2表面的刺突蛋白附着在人类细胞表面的一种称为ACE2受体的分子上。一旦附着，它就会将自己的遗传物质插入细胞内，这样它就可以开始复制。使用正确的诱饵将意味着SARS-CoV-2可能会分散注意力，远离人体细胞，而不是能够复制并对人体造成严重破坏，而是被摧毁。此前的研究结果表明，该策略在消灭登革热、寨卡病毒和甲型流感等其他病毒方面有效。\n对于目前的发现，伦斯勒理工学院生物技术和跨学科研究中心(CBIS)的研究人员测试了五种化合物的抗病毒活性。这是三种不同的肝素(一种常见的血液稀释剂)和两种从海藻中提取的岩藻多糖。这五种化合物都是长链糖分子。\n研究人员在哺乳动物细胞中用每种化合物对抗SARS-CoV-2进行了一项被称为EC50的剂量-反应研究。最后，他们发现海藻提取物RPI-27的抗病毒效果明显好于雷米西韦。Remdesivir的EC50值为770纳摩尔，而RPI-27的EC50值约为83纳摩尔(值越低越好)。\n这项研究的作者之一罗伯特·林哈特教授说，我们感兴趣的是一种获得感染的新方法。目前的想法是新冠肺炎的感染是从鼻子开始的，这两种物质中的任何一种都可能是喷鼻剂的基础。如果你能简单地及早治疗感染，甚至在感染之前治疗，你就有办法在它进入人体之前将其阻断。\n对技术和行为生物学有浓厚兴趣的科学作家。她目前的重点是这些领域之间的相互作用，以创建有意义的交互、应用程序和环境。\nDMT是一种强大的迷幻药物，已知能产生涉及其他生物的幻觉，如精灵、外星人和神灵。\n世界卫生组织估计，寄生虫感染导致超过4800万人患病，其中59,000人死亡.。\n科学家们已经创造了一种系统的方法来评估我们肠道中的微生物群落是如何影响药物行为的。菲..。\n肝素是一种非常常见的药物，自1992年以来一直被批准为抗凝剂。研究人员现在发现……。\n在永无止境地寻找下一种治疗方法或治愈方法的过程中，许多研究人员转向了大自然。黑胡椒的研究。\n康奈尔大学的药物发现科学家已经从传统的合成化学转向更...", "note_en": "An extract from seaweed has outperformed Remdesivir in ousting COVID-19 during cellular tests, according to new research.\n  The research is part of a larger body of research investigating a &#39;decoy strategy&#39; against viruses such as COVID-19. This strategy works by urging the virus to &#39;latch&#39; onto decoys rather than healthy human cells, where it then becomes trapped, neutralized and eventually destroyed.\n  In the case of COVID-19, the spike protein on the surface of SARS-CoV-2 attaches onto a molecule on the surface of human cells known as the ACE_2 receptor. Once attached, it then inserts its own genetic material inside the cell so it can begin to replicate. Usage of the right decoy would mean that SARS-CoV-2 may be &#39;distracted&#39; away from human cells and, instead of being able to replicate and cause havoc in the human body, be destroyed. Previous findings have shown thta the strategy works in ousting other viruses like Dengue, Zika and Influenza A.\n    For the present findings, researchers from the Center for Biotechnology and Interdisciplinary Studies (CBIS) at Rensselaer Polytechnic Institute tested antiviral activity in five compounds. These were three variants of heparin (a common blood thinner) and two fucoidans, extracted from seaweed. All five compounds are long chains of sugar molecules.\n  The researchers conducted a dose-response study known as an EC50 with each of the compounds against SARS-CoV-2 in mammalian cells. In the end, they found that seaweed extract RPI-27 had significantly better antiviral effects than Remdesivir. While Remdesivir has an EC50 value of 770 nanomolar, RPI-27 had an EC50 value of around 83 nanomolar (the lower the value, the better).\n  &#34;What interests us is a new way of getting at infection,&#34; says Professor Robert Linhardt, one of the study&#39;s authors. &#34;The current thinking is that the COVID-19 infection starts in the nose, and either of these substances could be the basis for a nasal spray. If you could simply treat the infection early, or even treat before you have the infection, you would have a way of blocking it before it enters the body.&#34;\n      Science writer with keen interests in technology and behavioral biology. Her current focus is on the interplay between these fields to create meaningful interactions, applications and environments.\n    DMT is a powerful psychedelic drug known to produce visions involving &#39;other beings&#39; like elves, aliens, and dei ...\n  The World Health Organization has estimated that parasitic infections cause over 48 million cases of illness and 59,000 ...\n  Scientists have created a systematic way to evaluate how the microbial community in our gut influences drug behavior. Fi ...\n  Heparin is a very common drug that&#39;s been approved as an anticoagulant since 1992. Researchers have now found that the m ...\n  In the never-ending search for the next treatment or cure, many researchers turn towards nature. The study of black pepp ...\n  Drug discovery scientists at Cornell University have diverted away from the traditional synthetic chemistry into a more ...", "posttime": "2020-07-26 23:04:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "提取物,extract,研究", "title": "海藻提取物对新冠肺炎的阻滞作用优于瑞美昔韦", "title_en": "Seaweed Extract Outperforms Remdesivir in Blocking Covid-19", "transed": 1, "url": "https://www.labroots.com/trending/drug-discovery-and-development/18231/seaweed-extract-outperforms-remdesivir-blocking-covid-19", "via": "", "real_tags": ["提取物", "extract", "研究"]}, {"category": "", "categoryclass": "", "imagename": "f9432bc68ac18971fd5bf49dc81b0805.jpg", "infoid": 1014281, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "旧金山--与一件事关系最密切的人往往是最警惕的。技术专家知道电话的真正工作原理，许多人决定他们不想让自己的孩子靠近他们。\n一种慢慢酝酿的警惕正在转变为整个地区的共识：屏幕作为一种学习工具的好处被夸大了，上瘾和发育迟缓的风险似乎很高。硅谷现在的争论是，接触多少手机是可以接受的。\n与Facebook工程师结婚的前社交计算研究员克里斯汀·斯特谢尔(Kristin Stecher)说，“不在屏幕前工作几乎比做一点容易。”“如果我的孩子真的得到了，他们只是更想要而已。”\n37岁的斯特谢尔和她的丈夫拉沙布·多希(Rushabh Doshi)研究了屏幕时间，得出了一个简单的结论：他们几乎不希望家里有任何屏幕。他们的女儿，5岁和3岁，没有屏幕时间的“预算”，没有允许他们出现在屏幕上的固定时间。唯一可以使用屏幕的时间是在长途汽车旅行期间(四个小时的车程到塔霍)或在飞机旅行期间。\n斯特谢尔认为，未来还有一个隐约可见的问题：她39岁的丈夫喜欢电子游戏，认为它们既有教育意义，又有娱乐性。她没有。\n“我们到时候会越过这一关的，”斯特谢尔说，她很快就会生下一个男孩。\n一些制作视频节目的人现在对一个孩子现在可以在多少地方观看视频感到震惊。\n当被问及限制儿童使用屏幕的时间时，多年来一直为YouTube在谷歌指导产品的风险投资家亨特·沃克(Hunter Walk)发来了一张带iPad的厕所训练马桶的照片，并写道：“标签是‘我们没有买过的产品’。”\n雅典娜·查瓦里亚(Athena Chavarria)曾在Facebook担任行政助理，现在是马克·扎克伯格(Mark Zuckerberg)的慈善机构陈·扎克伯格倡议(Chan Zuckerberg Initiative)的成员。她说：“我相信魔鬼生活在我们的手机里，正在给我们的孩子造成严重破坏。”\n查瓦里亚直到高中才让她的孩子拥有手机，甚至现在也禁止在车内使用手机，并严格限制在家里使用手机。\n她说，她的生活信条是班上最后一个拿到手机的孩子获胜。她的女儿直到上九年级才有了手机。\n“其他家长会说，‘当你找不到孩子的时候，你不担心自己的孩子不知道他们在哪里吗？’”查瓦里亚说。“我想，‘不，我不需要每时每刻都知道我的孩子们在哪里。’”\n对于长期的科技领袖来说，看着他们制造的工具如何影响他们的孩子，感觉就像是对他们的生活和工作的清算。\n克里斯·安德森(Chris Anderson)就是其中之一，他曾是“连线”的编辑，现在是一家机器人和无人机公司的首席执行官。他也是GeekDad.com的创始人。\n“在糖果和强效可卡因之间的天平上，它更接近强效可卡因，”安德森谈到屏幕时说。\n“我们认为我们可以控制它，”安德森说。“这超出了我们的控制能力。这会直接进入发育中的大脑的愉悦中心。这超出了我们为人父母的能力范围。“\n他有五个孩子和12条科技规则。这些措施包括：高中前的夏天之前没有手机，卧室里没有屏幕，网络级的内容屏蔽，13岁之前没有社交媒体，根本没有iPad，以及他用手机控制的谷歌Wifi执行的屏幕时间表。不良行为？这个孩子有24小时处于离线状态。\n“直到我开始观察症状和后果，我才知道我们对他们的大脑做了什么，”安德森说。\n“这是疤痕组织在说话。书中的每一个错误我们都犯了，我想我的一些孩子也犯了错误，“安德森先生说。“我们瞥见了上瘾的深渊，有一些失去的岁月，这让我们感到很难过。”\n他的孩子们上了私立小学，在那里他看到政府推出了iPad和智能白板，结果却“陷入混乱，然后从混乱中抽身而出”。\n硅谷父母对科技持谨慎态度的想法并不新鲜。科技界的教父们几年前就表达了这些担忧，而最高层的担忧是最强烈的。\n苹果首席执行官蒂姆·库克(Tim Cook)今年早些时候表示，他不会让侄子加入社交网络。比尔·盖茨禁止使用手机，直到他的孩子十几岁，梅林达·盖茨写道，她希望手机能等得更久。史蒂夫·乔布斯不会让他年幼的孩子靠近iPad。\n但在过去的一年里，一群备受瞩目的硅谷叛逃者一直在以越来越可怕的措辞敲响警钟，谈论这些小玩意儿对人脑造成的影响。突然之间，硅谷的普通员工着迷了。无科技住宅在该地区如雨后春笋般涌现。保姆们被要求签署无电话合同。\n那些让孩子接触屏幕的人试图通过解释这项技术的工作原理来说服他们戒除毒瘾。\n格雷洛克合伙公司(Greylock Partners)驻硅谷的风险投资人、Mozilla的前首席执行官约翰·礼来(John Lilly)说，他试图帮助他13岁的儿子明白，他正在被那些制造这项技术的人操纵。\n礼来说，“我试图告诉他，有人编写代码让你有这种感觉--我试图帮助他理解事物是如何产生的，事物中蕴含的价值观，以及人们正在做些什么来创造这种感觉。”“他说，‘我只想花我的20块钱去买我的堡垒之夜皮。’”\n科技界也有一些人不同意屏幕是危险的。32岁的杰森·托夫(Jason Toff)经营着视频平台Vine，现在为谷歌工作，他让3岁的儿子在iPad上玩耍，他认为iPad并不比一本书更好或更差。这一观点在他的技术同事中非常不受欢迎，以至于他觉得现在这是一种“耻辱”。\n“昨天我得到的一个反应是，‘所有主要的科技高管都在限制屏幕时间，你不担心吗？’”托夫先生说。“我当时想，‘也许应该这样，但我想我一直对常态持怀疑态度。’人们只是害怕未知。“。\n“这是反向操作，”托夫说。“但我觉得我是在代表很多家长说话，他们害怕做出判断，不敢大声说出来。”\n他说，他回想起自己从小看很多电视长大的童年。托夫说，“我想我做得还可以。”\n其他硅谷家长表示，有一些方法可以让有限的屏幕时间稍微降低毒性。\n人道技术中心(Center For Humane Tech)董事会的安全研究员蕾妮·迪雷斯塔(Renee DiResta)不允许被动屏幕时间，但会允许短时间玩具有挑战性的游戏。\n她希望她2岁和4岁的孩子在很小的时候就学会编程，所以她拥抱了他们对小玩意的意识。但她区分了这些类型的屏幕使用。玩建筑游戏是允许的，但看YouTube视频是不允许的，除非是作为一个家庭。\n旧金山创业公司PebblePost的高管弗兰克·巴比耶里(Frank Barbieri)试图将他5岁女儿的屏幕时间限制在意大利语内容上。PebblePost跟踪发送直邮广告的在线活动。\n“我们有朋友是废止银幕的人，我们也有朋友是银幕自由主义者，”巴比耶里说。\n他读过关于在很小的时候学习第二语言如何对思维发展有好处的研究，所以他的女儿看意大利语电影和电视节目。\n“老实说，对我们来说，我和我的妻子就像是，‘我们想去哪里？’”巴比耶里说。", "note_en": "SAN FRANCISCO — The people who are closest to a thing are often the most wary of it. Technologists know how phones really work, and many have decided  they don’t want their own children anywhere near them.\n A wariness that has been slowly brewing is turning into a regionwide consensus: The benefits of screens as a learning tool are overblown, and the risks for addiction and stunting development seem high. The debate in Silicon Valley now is about how much exposure to phones is O.K.\n “Doing no screen time is almost easier than doing a little,” said Kristin Stecher, a former social computing researcher married to a Facebook engineer. “If my kids do get it at all, they just want it more.”\n Ms. Stecher, 37, and her husband, Rushabh Doshi, researched screen time and came to a simple conclusion: they wanted almost none of it in their house. Their daughters, ages 5 and 3, have no screen time “budget,” no regular hours they are allowed to be on screens. The only time a screen can be used is during the travel portion of a long car ride (the four-hour drive to Tahoe counts) or during a plane trip.\n   There is a looming issue Ms. Stecher sees in the future: Her husband, who is 39, loves video games and thinks they can be educational and entertaining. She does not.\n “We’ll cross that when we come to it,” said Ms. Stecher, who is due soon with a boy.\n Some of the people who built video programs are now horrified by how many places a child can now watch a video.\n Asked about limiting screen time for children, Hunter Walk, a venture capitalist who for years directed product for YouTube at Google, sent a photo of a potty training toilet with an iPad attached and wrote: “Hashtag ‘products we didn’t buy.’”\n  Athena Chavarria, who worked as an executive assistant at Facebook and is now at Mark Zuckerberg’s philanthropic arm, the Chan Zuckerberg Initiative, said: “I am convinced the devil lives in our phones and is wreaking havoc on our children.”\n Ms. Chavarria did not let her children have cellphones until high school, and even now bans phone use in the car and severely limits it at home.\n She said she lives by the mantra that the last child in the class to get a phone wins. Her daughter did not get a phone until she started ninth grade.\n “Other parents are like, ‘Aren’t you worried you don’t know where your kids are when you can’t find them?’” Ms. Chavarria said. “And I’m like, ‘No, I do not need to know where my kids are every second of the day.’”\n For longtime tech leaders, watching how the tools they built affect their children has felt like a reckoning on their life and work.\n Among those is Chris Anderson, the former editor of Wired and now the chief executive of a robotics and drone company. He is also the founder of  GeekDad.com.\n “On the scale between candy and crack cocaine, it’s closer to crack cocaine,” Mr. Anderson said of screens.\n  “We thought we could control it,” Mr. Anderson said. “And this is beyond our power to control. This is going straight to the pleasure centers of the developing brain. This is beyond our capacity as regular parents to understand.”\n He has five children and 12 tech rules. They include: no phones until the summer before high school, no screens in bedrooms, network-level content blocking, no social media until age 13, no iPads at all and screen time schedules enforced by Google Wifi that he controls from his phone. Bad behavior? The child goes offline for 24 hours.\n “I didn’t know what we were doing to their brains until I started to observe the symptoms and the consequences,” Mr. Anderson said.\n “This is scar tissue talking. We’ve made every mistake in the book, and I think we got it wrong with some of my kids,” Mr. Anderson said. “We glimpsed into the chasm of addiction, and there were some lost years, which we feel bad about.”\n His children attended private elementary school, where he saw the administration introduce iPads and smart whiteboards, only to “descend into chaos and then pull back from it all.”\n This idea that Silicon Valley parents are wary about tech is not new. The godfathers of tech expressed these concerns years ago, and concern has been loudest from the top.\n Tim Cook, the C.E.O. of Apple,  said earlier this year that he would not let his nephew join social networks. Bill Gates banned cellphones until his children were teenagers, and Melinda Gates wrote that  she wished they had waited even longer. Steve Jobs  would not let his young children near iPads.\n But in the last year, a fleet of high-profile Silicon Valley defectors have been sounding alarms in increasingly dire terms about what these gadgets do to the human brain. Suddenly rank-and-file Silicon Valley workers are obsessed. No-tech homes are cropping up across the region.  Nannies are being asked to sign no-phone  contracts.\n Those who have exposed their children to screens try to talk them out of addiction by explaining how the tech works.\n John Lilly, a Silicon Valley-based venture capitalist with Greylock Partners and the former C.E.O. of Mozilla, said he tries to help his 13-year-old son understand that he is being manipulated by those who built the technology.\n “I try to tell him somebody wrote code to make you feel this way — I’m trying to help him understand how things are made, the values that are going into things and what people are doing to create that feeling,” Mr. Lilly said. “And he’s like, ‘I just want to spend my 20 bucks to get my Fortnite skins.’”\n And there are those in tech who disagree that screens are dangerous. Jason Toff, 32, who ran the video platform Vine and now works for Google, lets his 3-year-old play on an iPad, which he believes is no better or worse than a book. This opinion is unpopular enough with his fellow tech workers that he feels there is now “a stigma.”\n “One reaction I got just yesterday was, ‘Doesn’t it worry you that all the major tech execs are limiting screen time?’” Mr. Toff said. “And I was like, ‘Maybe it should, but I guess I’ve always been skeptical of norms.’ People are just scared of the unknown.”\n “It’s contrarian,” Mr. Toff said. “But I feel like I’m speaking for a lot of parents that are afraid of speaking out loud for fear of judgment.”\n He said he thinks back to his own childhood growing up watching a lot of TV. “I think I turned out O.K.,” Mr. Toff said.\n Other Silicon Valley parents say there are ways to make some limited screen time slightly less toxic.\n Renee DiResta, a security researcher on the board of the Center for Humane Tech, won’t allow passive screen time, but will allow short amounts of time on challenging games.\n She wants her 2- and 4-year-old children to learn how to code young, so she embraces their awareness of gadgets. But she distinguishes between these types of screen use. Playing a building game is allowed, but watching a YouTube video is not, unless it is as a family.\n And Frank Barbieri, a San Francisco-based executive at the start-up PebblePost that tracks online activity to send direct mail advertising, tries to limit his 5-year-old daughter’s screen time to Italian language content.\n “We have friends who are screen abolitionists, and we have friends who are screen liberalists,” Mr. Barbieri said.\n He had read studies on how learning a second language at a young age is good for the developing mind, so his daughter watches Italian-language movies and TV shows.\n “For us, honestly, me and my wife were like, ‘Where would we like to visit?’” Mr. Barbieri said.", "posttime": "2020-07-26 23:03:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "硅谷,consensus,屏幕", "title": "关于屏幕和孩子的黑暗共识开始在硅谷浮现", "title_en": "A Dark Consensus About Screens and Kids Begins to Emerge in Silicon Valley", "transed": 1, "url": "https://www.nytimes.com/2018/10/26/style/phones-children-silicon-valley.html", "via": "", "real_tags": ["硅谷", "consensus", "屏幕"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014280, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着iOS14在WWDC 2020之后的发布，苹果再次更新了其核心ML框架，提供了更丰富的界面，用于在用户设备上培训、运行和微调机器学习模型。在这些改进中，神经网络模型现在可以支持3D卷积和池层，这是许多流行的视频分类模型的骨干。今天，我们将介绍如何采用预先培训的现成视频分类模型，并使其在iOS上运行！\n要全面了解今年为苹果平台推出的其他ML新进展，我推荐Matthijs Hollemans的文章“2020年的苹果机器学习：有什么新功能？”(Apple Machine Learning in 2020：What‘s new？)。\n膨胀的3D ConvNet(或i3D)是DeepMind研究人员创建的一种架构，用于对视频执行人类行为分类。我们将使用在DeepMind的Kinetics 400数据集上预先训练的i3D模型。也就是说，在给定包含视频帧的张量的情况下，该模型将输出给定视频属于400个相应动作类中的任何一个的概率(例如，“空气击鼓”、“泡茶”、“板凳推”等)。\n由于这是一个TensorFlow模型，我们的目标是将其转换为可在Apple平台上本地使用的MLModel。首先，我们将打开一个新的Colab笔记本并导入coem ltools，即Apple的Python库，用于模型转换、编辑和验证。\n接下来，我们将获取Dynamics-i3D repo并运行包含的样例评估脚本，该脚本加载预先生成的RGB视频分类模型，对样例视频执行推断(以便我们知道它正在工作)，然后将冻结的TensorFlow模型导出为Freeze_Model.pb。\n接下来，我们将从repo中获取类标签，其中400个字符串中的每个字符串都对应于视频中的一个潜在操作。\n最后，我们将使用coem ltools包将冻结的TensorFlow模型转换为可由iOS和MacOS应用程序直接使用的mlmodel。\n该模型期望形状张量(1，NUM_FRAMES，224,224，3)，即RGB帧的数组，每个RGB帧的大小为224 x 224，并且-根据模型的原始规范-像素值重新缩放到-1和1之间。\n我们希望将帧的数量动态化，这样我们的模型就可以处理任何包含(比方说)25到300帧之间的视频。因此，我们创建了一个具有灵活形状的TensorType，该形状将被传递到转换器中。\n此外，为了使我们的分类器模型更易于使用，我们告诉模型有关显式类标签的信息，以便这些标签在Xcode中显式可见。\n#可选)添加要在Xcode.mlmodel.license=&#34；Apache-2.0 License&#34；mlmodel.Author=&#34；Google Inc.中可见的元数据。&#34；mlmodel.version=&#34；1.0&#34；mlmodel.Short_description=&#34；卷积神经网络对在Kinetics 400数据集上训练的视频数据执行人体动作识别。&#34；\n🎉成功执行转换后，我们将把新的mlmodel保存到磁盘！现在可以将其导入到Xcode项目中。\nVisualActionKit是一个SWIFT包，它有效地方便地包装了我们的Dynamics_i3d.ML模型。此程序包执行以下操作：\n将资源数据预处理为模型预期的格式，包括使用原始i3D模型回放中概述的自定义大小调整策略将视频的每帧大小调整为224 x 224像素。\n要安装此软件包以在我们自己的应用程序中使用，我们需要将以下内容添加到我们的应用程序的Package.swft中。\n现在，我们可以对任何提供的视频执行操作分类，而不考虑来源或输入格式！以下是一些用法示例：\n导入VisualActionKit让url=Bundle.module e.url(forResource：&#34；Writing&#34；，with Extension：&#34；mp4&#34；)让ASSET=AVAsset(url：url)try分类器.shared.classfy(资产){打印中的预测(预测)/[(c l a s s L a b e l：&#34；w r i t I n g&#34；，p r o b a)/[(c l a s s L a b e l：&#34；w r i t I n&#34；，p r o b a。9 9 7 8 8 1 2 3 3 6 9 2 1 6 92)、。。。}。\n除了这个特定的操作分类模型之外，我们还可以使用这些相同的步骤，通过使用coem ltools v4将任何预先训练好的模型转换为在Apple平台上运行。\n此外，与我们在这里所做的不同，如果我们有兴趣从头开始训练我们自己的操作分类器-而不涉及任何Python或模型转换代码-我们现在也可以这样做。要了解更多信息，我建议查看2020年的WWDC会议，内容包括Create ML。下次见！", "note_en": "With the unveiling of iOS 14 following WWDC 2020, Apple has again updated its  Core ML framework with even richer interfaces for training, running, and fine-tuning machine learning models on users’ devices. Among these improvements, neural network models can now support  3D convolutional and pooling layers, which are the backbone of many popular video classification models. Today, we’ll walk through  how to take a pre-trained, off-the-shelf video classification model and get it running on iOS!\n For an incredibly thorough overview of the other new ML advances for Apple platforms introduced this year, I recommend Matthijs Hollemans’ article,  Apple machine learning in 2020: What’s new?.\n    The  Inflated 3D Convnet (or I3D) is an architecture created by DeepMind researchers to perform human action classification for videos. We will use the I3D model that has been pre-trained on DeepMind’s  Kinetics 400 dataset. That is, given a tensor containing frames of a video, this model will output probabilities that the given video belongs to any one of 400 respective action classes (e.g. “air drumming”, “making tea”, “bench pressing”, etc).\n As this is a TensorFlow model, our goal is to convert it to an  MLModel that can be consumed natively on Apple platforms. To get started, we’ll open up  a new Colab notebook and import   coremltools, Apple’s Python library for model conversion, editing, and validation.\n  Next, we’ll fetch the  kinetics-i3d repo and run the included sample evaluation script which loads the pre-rained RGB video classification model, performs an inference on a sample video (so we know that it’s working), and then exports the frozen TensorFlow model as  frozen_model.pb.\n  Next, we’ll grab the class labels from the repo, where each of the 400 strings corresponds to a potential action in a video.\n   Finally, we’ll use the  coremltools package to convert our frozen TensorFlow model to an  mlmodel that can be directly consumed by iOS and macOS applications.\n The model expects a tensor of shape  (1, NUM_FRAMES, 224, 224, 3), that is, an array of RGB frames, each of size 224 x 224 and – according to the  model’s original specification — pixel values rescaled to between -1 and 1.\n We’d like to make the number of frames dynamic, so that our model works for any video containing between, say, 25 and 300 frames. Therefore, we create a  TensorType with a flexible shape that will be passed into the converter.\n  Also, to make using our classifier model easier to consume, we tell the model about our explicit class labels so that these are explicitly visible within Xcode.\n   # Optionally, add metadata to be visible in Xcode.mlmodel .license  =   &#34; Apache-2.0 License &#34;mlmodel .author  =   &#34; Google Inc. &#34;mlmodel .version  =   &#34; 1.0 &#34;mlmodel .short_description  =   &#34; Convolutional neural network performing human action recognition on video data, trained on the Kinetics 400 dataset. &#34;\n 🎉 With the conversion successfully performed, we’ll save our new  mlmodel to disk! It’s now ready to be imported into an Xcode project.\n    VisualActionKit is a Swift package that is effectively a convenience wrapper around our  kinetics_i3d.mlmodel. This package does the following:\n Pre-processes the asset’s data into a format the model expects, including resizing each frame of the video to 224 x 224 pixels using the  custom resizing strategy outlined in original I3D model repo.\n To install this package for use in our own apps, we add the following to our app’s  Package.swift.\n  Now, we can perform action classifications on any provided videos, regardless of the source or input format! Here’s some example usage:\n import  VisualActionKit let url = Bundle.module.url(forResource:  &#34; writing &#34;, withExtension:  &#34; mp4 &#34;) let asset = AVAsset(url: url) try Classifier.shared.classify(asset) { predictions  in print(predictions)  // /   [ ( c l a s s L a b e l :   &#34; w r i t i n g &#34; ,   p r o b a b i l i t y :   0 . 9 9 7 8 8 1 2 3 3 6 9 2 1 6 9 2 ) ,   . . .}\n  Outside of this specific action classification model, we can use these same steps to convert any arbitrary pre-trained model to run on Apple platforms by using  coremltools v4.\n Additionally, different than what we did here, if we were interested in  training our own action classifier from scratch – without touching any Python or model conversion code – we also have ability to do so now. For more info, I recommend checking out the  2020 WWDC session covering Create ML. Until next time!", "posttime": "2020-07-26 23:03:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ml,offline,模型", "title": "用Core ML构建用于人类行为的离线视频分类器", "title_en": "Building an offline video classifier for human actions with Core ML", "transed": 1, "url": "https://lukereichold.com/blog/posts/video-action-classification-coreml/", "via": "", "real_tags": ["ml", "offline", "模型"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014279, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周日，也就是2020年7月19日，我推出了twtxt.net，这是一个去中心化的、自我托管的、类似twitter™的微博平台。\n然而，今天我想分享更多关于twtxt.net和它背后的软件prologic/twtxt的信息；为什么我要这么做，为什么它对我很重要，为什么你应该关心它。\n所以在我们开始讨论“为什么”和“如何”之前，让我们首先来谈谈我们是如何走到这里的。\n早在2015年，我就被facebook™猎头，并在两次拒绝他们之后(三次有点多了！)。我接受了这个提议，把我的家人搬到了阿拉巴马州门洛帕克总部的旧金山湾区。\n在那里，我做了大约3.5年的生产工程师(谷歌一下，如果你不熟悉，也可以想想DevOps/SRE，但这不是一个恰当的描述)。与此同时，当我努力做好我新找到的工作时，社交媒体行业正在发生有趣的发展。不仅脸谱网在剑桥分析系列活动上受到了猛烈抨击，推特™也在经历一些变化，…。\n推特(_据称，虽然我自己从来没有真正进入过推特…)。(正在引入新的自动算法来改变他们平台上的用户在他们的时间线上看到的内容。这对平台最初的预期用途的可用性有重大影响。当然，一些用户不喜欢这一点，于是寻找其他途径和Solutinos。\n一条这样的大道就是巴克的ttxt。据我所知，他创建了一个非常简单的文件格式规范，一个规范的客户端，并将其发布到了世界上！👏。\n快进到2020年(准确地说是2020年7月20日)，几周前，当我在度假时，有一天晚上我熬夜在互联网上闲逛(就像你一样)，寻找“分散的社交媒体”软件。我发现了相当多；以下是一些更知名的：\n这就是这个博客的底层平台Micro.blog，我现在在这里写和发布更长的文章，就像在我的博客上一样。\n“连线”上甚至有一篇题为“分散式社交网络听起来很棒”的文章。太糟糕了，它们永远不会起作用！好吧，我在这里告诉你，我正式挑战这一点，并在这里提出挑战！🧤。\n顺便说一句，…。当我从美国回来的时候，我可能会更早地在2018年感染ttxt，但我(当时)也太忙了，到处走动，工作，试图让bak进入我们当时仍在出租的家里。\n正如我所说的，我在2020年7月19日星期日推出了twtxt.net(我希望会有很多实例中的第一个)。我在“业余时间”短短几个周末就编写了软件Prologic/twtxt，并按照非常宽松的麻省理工学院的许可进行了许可。\n📕如果你还没有签出它，那就创建一个账户，然后玩一玩吧。我会鼓励你这样做的！我在twtxt.net上运行了一个免费供任何人使用的实例。\n如果您是非技术人员，并且阅读了到目前为止的内容，请参阅…。首先，恭喜你，我已经喜欢上你了！其次，不用担心，twtxt.net只是一个平台，让你可以发声/分享你的想法、智慧、漫无边际、简短的文本或任何你想要的东西。把它想象成一个迷你的Facebook或Twitter，但没有所有的广告或跟踪。\n如果你买了一本日记和一支派克™笔，如果你写下你的想法、智慧、经历、漫无边际或任何你想要的东西，并与他人分享。\n你写的东西归谁所有？这张纸的制造商是谁？日记的制造商？钢笔的制造商是谁？\n厌倦了所有大型社交媒体巨头的所有问题，这些问题现在困扰着f，g和t*。\n不再希望成为Facebook或Twitter的产品，希望拥有自己的帖子和互动。\n看，虽然twtxt.net是全新的，但有几个原则即使在现在和未来也永远是正确的：\n绝对必须允许用户将其数据带到其他地方并使用另一个twtxt客户端。\n问得好！很高兴你这么问。我可能不会！但我的主要目标之一是让用户“自我托管”。\n嗯，这仅仅意味着您运行您自己的twtxt.net后面的软件的服务器实例。\n如果你是一个非技术人员(这对大多数人来说都是真的，因为世界上只有大约100万软件开发人员)，那么你可能会问自己：\n但是我该怎么做呢？！我对计算机一窍不通！我只是使用应用程序！\n好的，别担心。尽管(在撰写本文时)twtxt.net还为时尚早，但仍有以下计划：\n一个twtxt.net的付费单用户实例，它是您自己的，为您个性化，具有您自己的域名，但具有所有相同的功能。\n一个twtxt.net的付费多用户实例，具有所有相同的功能，但更适合小型社区、学校、村庄、居民区等。\n这个有货的时候要多少钱？简而言之，我不知道。但我可以告诉你这一点，它将比你今天为facebook和twitter支付的费用要少(请记住，即使f，t，g*都是免费的，也有一个隐含的成本，这就是说，你是他们的产品，你隐含地为它买单！)。\n这么说吧，一旦我们准备好启动面向大众的单击托管实例，您几乎不需要花费任何费用。如果你买不起自己的实例，那就使用朋友的实例，或者跳到你能找到的任何其他实例上，比如twtxt.net！\n在文本框中输入一些智慧的散文，然后点击提交，这是你的第一篇帖子！\n您可以通过在https://twtxt.net/follow中输入提要的昵称及其url来跟踪其他提要。\n通过转到https://twtxt.net/discover，您可以发现与您位于同一实例上的其他用户\n通过访问https://twtxt.net/feeds，您可以找到有趣的外部提要，甚至可以找到您所在实例之外的外部用户。\n最重要的是。你可以和各种各样的人进行引人入胜的、有趣的、有趣的互动！Ttxt.net(在撰写本文时)正以每天约2-3K个请求和每天3-5个新用户注册的速度增长。哇！😱。\n现在仍然有更多的工作要做，所有这些都是在“空闲时间”进行的。没有人付钱给我或贡献者来做这些事情。我们这样做是出于我们内心的爱和善良💚。\n@提及你可以很容易地看到谁在帖子中提到了你(我们称他们为TTS)。\n上传图片/照片！📷这将会很快到来，因为已经有需求了！\n因此，twtxt.net是一种免费的新型社交媒体，它专注于自我托管、去中心化，没有任何我们都认为理所当然的臃肿、跟踪或广告。", "note_en": "Last Sunday the 19th July 2020 I launched  twtxt.net, a Decentralised, Self-Hosted, Twitter™-like microBlogging Platform.\n  Today however I want to share more about  twtxt.net and the software behind it  prologic/twtxt; Why I’ve done all this, Why it is important to me and Why you should care.\n   So before we go into the Why and How, let’s first of all talk about how we go here in the first place.\n Back in ~2015 I got head hunted by  Facebook™ and after turning them down twice ( three was a bit much!) I accepted the offer and relocated my family to the Bay Area at the Menlo Park HQ ala Silicon Valley.\n There I spent ~3.5yrs as a Production Engineer ( Google it, or think DevOps/SRE if you’re unfamiliar, but not an apt description).Meanwhile, while I was  trying to be good at my new found ay job, interesting developments were happening in the Social Media industry. Not only was Facebook copping flack for the Cambridge Analytics series of events, but  Twitter™ was going through some changes as well…\n Twitter (_allegedly, although I never really got into Twitter myself…)( was introducing new automated algorithms to change what users on their platform saw on their timeline. This has significant impact on usability of the original intended use of the platform. Naturally  some users did not like this and sought out other avenues and solutinos.\n One such avenue was  bucket’s  twtxt. As I understand it he created a very simple file format specification, a canonical client and unleashed this onto the world! 👏\n   Fast forward to ~2020 ( 20th July 2020 to be exact) and a few weeks earlier while I was on holidays I was up late one night just poking around on the Internet ( as you do) and looking for “Decentralized Social Media” software. I found quite a few; here are some of the better known ones:\n    This this very blog’s underlying platform  Micro.blog where I now write and publish longer pieces like on my  Blog\n There’s even an article on Wired entitled  Decentralised Social Networks Sound Great. Too Bad They’ll Never Work! Well I’m here to tell you I formally challenge this and am here to throw the gauntlet down! 🧤\n By the way… I  might have caught twtxt sooner back in ~2018 when I got back from the US, but I was also ( at that time) too busy moving around, working and trying to get bak into our family home that was still being rented at the time.\n  As I said I launched  twtxt.net ( the first of what I hope will be many instances) on Sunday the 19th July 2020. I wrote the software  prologic/twtxt in just a few short weekends in my “spare time” and licensed it under the very permissive MIT license.\n 📕 If you haven’t already checked it out, created an account and played around. I would encourage you to do so! I run a freely available for anyone to use instance over at  twtxt.net\n If you are non-technical and read this far… Firstly congratulations I like you already! Second, don’t worry,  twtxt.net is just a platform to voice/share your thoughts, wisdoms, rambling, short-form text or anything else you want. Think of it like a miniature Facebook or Twitter but without all the advertising or tracking.\n  If you buy a diary and a Parker™ Pen.If you then write down your thoughts, wisdoms, experiences, rambling or whatever you want to and share this with others.\n Who owns what you have written? The manufacturer of the paper? The manufacturer of the diary? The manufacturer of the pen?\n    Are tired of all the issues of all the  BIG Social Media giants that now plague the f , g and t*.\n No longer  wish to be the product of Facebook or Twitter and want to  own your own posts and interactions.\n See whilst  twtxt.net is brand spanking new, there are a few principles that will always remain true even now and going forward:\n Absolutely  must allow users to take their data somewhere else and use another  twtxt client\n  Good question! Glad you asked. I probably won’t! But one of my primary goals is for users to “Self Host”.\n  Well it simply means that you run your own server instance of the software that is behind  twtxt.net.\n If you are a non-technical person ( which would be true of most people as there are only about ~1M software developers in the world) then you’re probably asking yourself:\n But how do I do this?! I don’t know anything about computers! I just use apps!\n Well don’t worry. Even through ( at the time of writing this) it’s really early days for  twtxt.net there are plans for the following:\n A paid single-user instance of  twtxt.net that is  your very own, personalised to you, with your own domain name but with all the same features.\n A paid multi-user instance of  twtxt.net with all the same features but more suitable to small communities, schools, villages, neighbourhoods, etc.\n How much will this cost when it becomes available? Short answer is I don’t know. But I can tell you this, it will cost you less than what you are paying for Facebook and Twitter today ( remember that even through the f , t, g* are all FREE, there is an implicit cost, which is to say that you are implicitly paying for it as you are their product!).\n Let’s just say that once we’re ready to launch single-click hosted instances for the masses that it will cost you next to nothing. And if you can’t pay for your own instance, just use a friend’s instance or jump on any other instance you can find like  twtxt.net!\n    Make your first post by entering some prose of wisdom in the text box and hitting Submit!\n You can follow other feeds by entering a Nickname for the feed and their URL in  https://twtxt.net/follow\n You can discover other users on the same instance as you by going to  https://twtxt.net/discover\n You can find interesting external feeds and even external users outside of the instance you’re on by going to  https://twtxt.net/feeds\n And most of all. You can have engaging, fun and interesting interactions with all sorts of people!  twtxt.net ( at the time of writing this) is growing at a rate of ~2-3K requests per day and 3-5 new user signups per day. WOW! 😱\n  Now there’s still loads more work to do and all of this is happening in “spare time”. No one is paying me or contributors to do any of this. We do this out of the love and kindness of our hearts 💚\n  @mentions where you can easily see who has mentioned you in a post ( we call them  twts)\n   Uploading images/photos! 📷 This will come pretty quickly actually because there is already a demand for this!\n   So  twtxt.net is a  FREE new type of Social Media that has a strong focus on Self-Hosting, Decentralisation without any of the bloat, tracking or advertising that we’ve all come to take for granted.", "posttime": "2020-07-26 23:02:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "twitter,decentralised,实例", "title": "Net-一个去中心化的、自我托管的类似Twitter的网站。方式和原因", "title_en": "Twtxt.net – A Decentralised Self-Hosted Twitter -like. How and Why", "transed": 1, "url": "https://www.prologic.blog/2020/07/26/twtxtnet-a-decentralized.html", "via": "", "real_tags": ["twitter", "实例"]}, {"category": "", "categoryclass": "", "imagename": "73925aee91ea1e5106bd31fefc64f907.jpg", "infoid": 1014278, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自由主义对真理的追求是不是缺少了一种共同利益的意识，以及对语言暴力的历史渊博的理解？", "note_en": "Is the liberal search for truth missing a sense of the common good, and a historically informed understanding of the violence of words?", "posttime": "2020-07-26 23:02:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "言论自由,fish,真理", "title": "斯坦利·菲什与反对言论自由的争论", "title_en": "Stanley Fish and the Argument Against Free Speech", "transed": 1, "url": "https://www.tabletmag.com/sections/arts-letters/articles/cancel-culture-stanley-fish-free-speech", "via": "", "real_tags": ["言论自由", "fish", "真理"]}, {"category": "", "categoryclass": "", "imagename": "2095d9e9276c3424d5eb69828293b418.jpg", "infoid": 1014277, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我们详细介绍如何训练你的潜意识之前，让我们先了解积极思维的重要性，以及潜意识是如何运作的。\n在我的一生中，有一段时间我在努力改善我的财务状况。尽管我是一名合格的IT专业人员，有超过12年的工作经验，但我无法为自己找到工作。所以我决定自己做，开始为客户做自由撰稿人。\n但很快，我发现自己无法创造可持续的收入，随着时间的推移，我开始变得愤怒和沮丧。我开始批评我周围的一切和每个人，我的人际关系受到了影响，我开始失去健康。\n甚至在我意识到自己严重超重之前，我就已经下背部疼痛和一阵阵偏头痛(程序员知道我在说什么)。\n对我来说，情况每况愈下。我花了一段时间才意识到，我需要清理我围绕着自己建立起来的负能量池，更多地接受生活给予我的东西。\n大多数人告诉自己，“哦，一旦我做到了这件事或那件事，我会很开心的。”这就是他们痛苦的根源。\n你可以在生活中显化你想要的任何东西，宇宙会帮助你，但你必须以积极的态度接近它。积极的思想改变了我们的人生观，让我们充满了同情心和爱心。一旦我明白了这一点，事情就开始对我有利了。\n大多数人认为人类的头脑具有双重性质，即有意识或理性的头脑和潜意识的头脑。有意识的头脑是有意识的，包含所有的想法、感觉、记忆、欲望，并且更具逻辑性。\n另一方面，潜意识就像一个蓄水池或一个巨大的数据库，包含了所有类型的思想、记忆、感觉和情绪。\n与意识思维不同，潜意识思维缺乏辨别好坏的能力。它相信你的意识告诉它什么。这就是它如此强大的原因。\n编程潜意识的唯一方法是通过意识思维。因此，如果你重复诸如“我是一个快乐的人，我会在我的努力中成功，我会获得财务自由”这样的积极肯定，你的潜意识就会开始相信这一点。即使在最逆境的时候，你也会保持坚强，专注于你的目标。\n另一方面，如果你重复诸如“我不配成功，我买不起那辆车，我不擅长处理人际关系”这样的负面肯定，大脑就会开始相信这一点，并可能会让你陷入抑郁、焦虑和恐惧。\n潜意识可以是我们最好的朋友，也可以是我们最大的敌人。它可以是我们想要的任何东西。\n潜意识是反应性的，它对你思想的本质作出反应。你知道吗，潜意识占你思维的90%以上，而不是意识思维？\n你有多少次尝试戒烟都失败了？有多少次你试着减肥，结果却长高了？有多少次你开始一个项目只是为了半途而废，或者是在你即将完成的时候？为什么这会发生在我们身上？这是因为我们没有对你的潜意识进行适当的编程。\n现在我们了解了潜意识是如何工作的，让我们来探索如何利用潜意识的力量在生活中变得更有效率和更成功。\n冥想是训练你潜意识的最有力的工具之一。在冥想中，我们深入自己的内心，观察我们的思想和情绪。我们只是成为见证者，不去评判，也不受我们产生的想法的影响。\n如果你想开始冥想，请查阅免费的终极冥想指南。\n冥想使你内心平静，心理更稳定，从而帮助你精神上的进步。通过每天的练习，你慢慢地学会面对你的恐惧和负面情绪，不再受它们的影响。\n从舒适的坐姿开始。你可以盘腿坐在地上，如果不舒服，也可以挺直脊椎坐在椅子上。其中一个简单的技巧是观察呼吸，就像它在你的身体里移动一样。\n开始时，每天只做10分钟，随着你变得更加熟练，逐渐增加时间。\n早些时候，我们简要地谈到了这一点，并看到了意识思维如何可以被用作训练你的潜意识思维的工具。如果没有意识或意识，就不可能训练潜意识并利用它提供的无限潜力。\n一种方法是使用断言。这里的主要过程是一遍又一遍地重复一个特定的行为，直到这个信息深深地植根于你的潜意识中。例如，如果你想减肥，就不断告诉自己，“我不减10磅，我是不会停止锻炼的。”\n这里要注意的一件事是，你不应该接受远远超出你目前能力的挑战。否则，这是行不通的，这是人们决议失败的主要原因。\n例如，不要试图在一个月内减掉20磅，因为你超重了。在做出肯定时要务实，最初要选择一个小目标。一旦你实现了目标，就增加挑战。\n以下是人们用来训练思维的一些最常见的肯定词的清单：\n即使没有人和我说话，我也会整天面带微笑。\n通过重复这样的肯定，你极大地提升了你的自尊，培养了对他人的同理心，降低了你的自尊心，增加了你的自信。\n你必须努力相信你的肯定(带着情绪)。如果你不相信自己说的话，你的潜意识就不会明白。就像冥想一样，肯定也需要每天练习。\n帮助我了解潜意识的最重要的一本书是“潜意识的力量”。如果你感兴趣，你可以在亚马逊上查看这本书。\n通过挖掘潜意识中隐藏的力量，你可以显著提高工作效率。每天只花你30到40分钟的时间，好处是巨大的。不要轻信我的话，你自己试试看吧。\n现在的时代给我们提供了无限的机会，但我们目标失败的原因是我们分心了。让我们分心的事情无处不在，形式多种多样。\n我们的意识必须同时处理大量信息。通过冥想，我们清楚地知道什么是有用的，什么是无用的，而积极的肯定使我们能够将积极的信息传递到我们的潜意识中。通过反复练习，我们养成了终身不变的习惯。", "note_en": "Before we get into the details of how to train your subconscious mind, let’s understand the importance of positive thinking and how does the subconscious mind work.\n  There was a time in my life when I was trying hard to improve my financial situation. Despite being a qualified IT professional with more than 12 years of work experience, I was unable to find work for myself. So I decided to make it on my own and started freelancing for clients.\n But very soon, I found myself failing miserably to generate sustainable income, and as time progressed, I started becoming angry and frustrated. I started criticizing everything and everyone around me, my relationships suffered, and I started losing health.\n Before I even realized I was grossly overweight, I was having lower back pains and bouts of migraine tension headaches (programmers know what I’m talking about).\n Things were going from bad to worse for me. It took me some time to realize that I needed to clear this pool of negative energy, which I had built around me and be more accepting of what life has to offer me.\n Most people tell themselves, “Oh, I’ll be happy once I achieve this or that,” and that’s the root cause of their misery in the first place.\n You can manifest whatever you desire in life, and the universe will assist you, but you have to approach it with positivity. Positive thinking changes our outlook of life and fills us with compassion and love. Once I understood this, things started rolling for me.\n  Most people believe that the human mind has dual nature, the conscious or the rational mind, and the subconscious mind. The conscious mind is aware and contains all thoughts, feelings, memories, desires, and is more logical.\n A subconscious mind, on the other hand, is like a reservoir or a vast database that contains all types of thoughts, memories, feelings, and emotions.\n Unlike the conscious mind, the subconscious mind lacks the discriminatory capability of what is good or bad. It believes whatever your conscious mind tells it. And that’s the reason why it is so powerful.\n The only way to program the subconscious mind is through the conscious mind. So if you repeat positive affirmations such as, “I am a happy person, I will succeed in my endeavors, I will achieve financial freedom”, your subconscious mind will start believing it. Even in times of greatest adversities, you will stay strong and focused on your goals.\n On the other hand, if you repeat negative affirmations such as, “I don’t deserve success, I can’t afford that car, I’m bad at managing relationships”, the mind will start believing that and may drive you into depression, anxiety, and fear.\n The subconscious mindcan be our best friend or our worst enemy. It can be whatever we want it to be.\n The subconscious mind is reactive, and it reacts to the nature of your thoughts. Did you know that the subconscious mind makes up more than 90% of your mind, as opposed to the conscious mind?\n How many times have you tried quitting smoking and failed? How many times did you try losing weight but ended up gaining instead? How many times did you start a project just to leave it midway or when you were just about to finish? Why does this happen to us? This happens because we have not programmed your subconscious mind properly.\n Now that we understand how the subconscious mind works, let’s explore the various ways in which we can harness its power to be more productive and successful in life.\n  Meditation is one of the most powerful tools to train your subconscious mind. In meditation, we go deep inside ourselves and observer our thoughts and emotions. We simply become the witness without judging or being affected by the thoughts we generate.\n If you want to get started with meditation, check out the free  Ultimate Meditation Guide.\n Meditation helps you to advance spiritually by making you calm inside, and psychologically more stable. By practicing it every day, you slowly learn to confront your fears and negative emotions and are no more affected by them.\n Start by sitting in a comfortable posture. You can be seated on the ground in a cross-legged position, or if that’s uncomfortable, just sit on a chair with your spine erect. One of the simple techniques involves watching the breath as if it moves in and out of your body.\n Start by doing this every day for just 10 minutes and gradually increase the time as you become more proficient in it.\n  Earlier, we touched upon this briefly and saw how the conscious mind could be used as a tool to train your subconscious mind. If there were no consciousness or awareness, it would be impossible to train the subconscious mind and avail the infinite potential it offers.\n One way is to use Affirmations. The main process here is to keep repeating a particular behavior over and over again until the message is deeply ingrained in your subconscious mind. For example, if you want to lose weight, keep telling yourself, “I’m not going to stop my workouts until I shed 10 pounds”.\n One thing to note here is that you should not take up a challenge that far exceeds your present capacity. Otherwise, this will not work, and this is the main reason why people fail in their resolutions.\n For example, don’t try to lose 20 pounds in 1 month is you are overweight. Be practical while making your affirmations, and choose a small target initially. Once you achieve your goal, increase the challenge.\n Here is a list of some of the most common affirmationspeople use to train their mind:\n I will keep a smile on my face throughout the day, even if no one talks to me.\n By repeating such affirmations, you tremendously boost your self-esteem, develop empathy towards others, tone down your ego, and increase your confidence.\n You must make an effort to believe in your affirmations (with emotions). If you don’t believe what you are saying, your subconscious mind will not get the message. Just like meditation, affirmations also require daily practice.\n   One of the most important books that helped me to learn about the subconscious mind is “The Power of Subconscious mind”. If you’re interested, you can check out this  book here on amazon.\n You can significantly increase your productivity by tapping the hidden powers of your subconscious mind. It just takes 30 to 40 minutes of your time daily, and the benefits are tremendous. Don’t take my word for it; just try it yourself and see.\n Present times offer us unlimited opportunities, but the reason why we fail in our objectives is that we get distracted. Distractions are all around us in various forms.\n Our conscious mind has to deal with a lot of information at the same time. Through meditation, we get clarity as to what is useful and what is not, and positive affirmations allow us to transfer positive messages to our subconscious. Through repeated practice, we form habits that stick for life.", "posttime": "2020-07-26 22:31:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "潜意识,subconscious", "title": "训练你的潜意识积极思考", "title_en": "Train Your Subconscious Mind to Think Positive", "transed": 1, "url": "https://mindfulnessquest.com/how-to-train-your-subconscious-mind-to-think-positive/", "via": "", "real_tags": ["潜意识"]}, {"category": "", "categoryclass": "", "imagename": "055a88782fcc2bf2e973419160ce0493.jpg", "infoid": 1014276, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1952年，英国数学家艾伦·图灵(Alan Turing)因在密码破译和人工智能方面的研究而闻名，他被判从事同性恋行为，并被判处化学阉割。在这场个人戏剧中，他仍然抽出时间发表了一篇富有远见的论文，内容是自然界中定期重复的图案的数学，可以应用于老虎和斑马鱼上的条纹，豹子上的斑点，以及鳄鱼牙齿排成行的间距，等等。\n现在，60多年后的今天，生物学家们正在发现图灵在他的论文中提出的模式机制的证据，这引发了人们对它们的兴趣的重新燃起，并有可能阐明诸如基因最终如何造手这样的发育问题。“这种结构就在那里，”伦敦国王学院的发育生物学家杰里米·格林(Jeremy Green)说。“我们只需要把化学放在数学上，就能得到生物学。”\n对于导致他1952年论文的工作，图灵想要了解产生自然模式的潜在机制。他提出，斑点等图案的形成是两种化学物质相互作用的结果，这两种化学物质在整个系统中扩散得很像盒子里的气体原子，但有一个关键的不同之处。这些被图灵称为“形态成因”的化学物质不像气体一样均匀扩散，而是以不同的速度扩散。一个作为激活剂来表达独特的特征，比如老虎的条纹，而另一个则充当抑制器，周期性地发挥作用来关闭激活剂的表达。\n为了解释图灵的想法，牛津大学数学生物学名誉教授、普林斯顿应用数学家詹姆斯·默里(James Murray)想象了一片点缀着蚱蜢的干草田野。默里说，如果草在几个随机的点上被点燃，并且没有水分来抑制火焰，大火将烧毁整个田野。然而，如果这种情况像图灵机制一样发展，那么来自入侵的火焰的热量将导致一些逃窜的蚱蜢出汗，使它们周围的草受潮，从而在原本被烧毁的田野上产生周期性的未烧焦的斑点。\n这个想法很耐人寻味，但也是投机性的。图灵在他的论文发表两年后去世，这篇论文在相对默默无闻的情况下苦苦挣扎了几十年。“他实际上并没有把它应用到任何真正的生物学问题上，”默里说。“对于寻找分析问题的数学家来说，这主要是一件好事。”\n尽管20世纪70年代出现了大量的理论工作和计算机建模，成功地利用图灵机制再现了斑点和条纹等图案，但分子生物学远未达到研究人员能够识别充当激活剂和抑制剂的特定分子的地步。\n最新的研究表明，图灵型机制可能与小鼠毛囊和鸟类皮肤上的羽芽之间的间距、老鼠上颚上形成的脊状突起和老鼠爪子上的手指有关。\n一些生物学家仍然怀疑图灵机制是否足以解释这些周期性模式，特别是因为还有其他可行的模型，包括伦敦大学学院(University College London)名誉发展生物学家刘易斯·沃尔伯特(Lewis Wolpert)提出的一个模型。在沃尔伯特的模型中，细胞根据每种形态成分的多少来解释它们在空间中的位置，从而产生条纹、斑点或数字。此外，沃尔伯特说，“还没有人确定在发育过程中对图灵机制起作用的分子。”\n缺乏实验鉴定一直是图灵倡导者最严重的绊脚石，但这种情况已经开始改变。去年，格林和他的同事确定了两种化学物质，它们起到了激活剂和抑制剂的作用，导致在小鼠胚胎的口腔顶部发现了规则间隔的隆起。一种名为成纤维细胞生长因子(FGF)的蛋白质充当激活剂，一种名为Sonic Hedgehog(Shh)的基因变体充当抑制剂。当研究人员增加或减少这些化学物质的活性时，正如图灵方程所预测的那样，脊线的模式受到了影响。\n生物学是杂乱无章和复杂的，有许多混杂的因素，这使得很难从实验上证明模式是由图灵机制产生的。因此格林和他的同伴移走了其中一个山脊，从而增加了山脊之间的间距。如果没有图灵机制，就会形成替代山脊。取而代之的是，研究人员看到额外的脊状突起以分叉的模式出现，以填补空间-这是图灵模型的一个标志。\n图灵机制适用于任何数量的系统，几乎过于笼统。研究人员已经在生态系统中的物种分布中发现了类似图灵的特征，比如捕食者-猎物模型，在该模型中，猎物充当激活器，寻求繁殖和增加自己的数量，而捕食者则充当抑制剂，从而控制种群。在数学上，神经元也可以被描述为激活剂或抑制剂，鼓励或抑制大脑中其他附近神经元的放电。\n格林说：“如果你有任何两个过程(作为活化剂和抑制剂)，你总是可以从中获得周期性的模式。”他指出，沙丘上形成的涟漪就是一个例子。“很明显，在那里没有扩散的形态因子在起作用。只是这些过程有一个性质，你可以用扩散函数来表示。“。\n图灵在他的原始论文中也承认了这一点：“这个模型将是一种简化和理想化，因此是一种证伪，”他写道。这并不一定意味着模型是错误的，但从识别似乎遵循图灵机制的系统的行为转移到识别充当激活器和抑制器的特定物理过程是具有挑战性的。例如，对斑马鱼条纹的实验表明，斑马鱼条纹是由图灵机制产生的，但这种鱼没有分泌遍布整个系统的化学物质，而是有两种细胞，作为激活剂和抑制剂的作用相同。最有可能起激活/抑制作用的分子只能嵌入细胞膜，不能分泌。因此，要使这个机制工作，细胞之间必须相互接触。\n诚然，图灵模型存在缺陷。仅靠图灵机制不能解释自然界模式中的比例。鸡蛋是一个很好的缩放例子，因为它们可以是大的，小的，或者介于两者之间的任何东西，但无论受精卵的大小如何，如果它孵化出来，产品将是一只完整的鸡-而不是缺少关键部分的鸡。“图灵没能回答的问题是：你是如何实现这一扩展过程的？”格林说。\n答案可能在一篇关于小鼠胚胎脚趾形成的新论文中。根据西班牙坎塔布里亚大学和西班牙研究理事会的合著者玛丽亚·A·罗斯(Maria A.Ros)的说法，这项研究的目的是探索多指-额外手指的形成，例如一只手的第六个手指。\n数字图案类似于条纹图案。但是，尽管手指呈条纹图案展开，指尖之间的距离-如果你愿意的话，波长-和指节之间的距离是不同的。图案按比例缩放。如果这些条纹是由图灵机制引起的，那么一定有其他因素在影响缩放。\n有几个基因与多指有关，最著名的是一种叫做Gli3的基因，它受Shh的调控。早些时候的研究已经得出结论，小鼠胚胎中Gli3和Shh的缺失将导致一类名为Hox基因的基因增加，这类基因对身体结构的正常发育至关重要，包括手指和脚趾的数量。\n老鼠在四个不同的簇中有39个HOX基因。ROS决定通过逐步敲除HOX变种来检验这一假设，即更多的HOX基因导致更多的数字。她预计，随着更多的HOX基因被移除，数字的数量将会减少。相反，发生了相反的情况：HOX基因被移除的越多，出现的额外数字就越多-在一个案例中多达15个。\n多余的手指更细更近；它们分裂成一个分叉的图案-这与格林在实验中观察到的老鼠味觉上的脊线相同。当巴塞罗那基因组调控中心的系统生物学家、罗斯的合著者之一詹姆斯·夏普(James Sharpe)将关于数字粗细和间距的实验数据输入他的计算机模型时，他能够通过图灵机制重现这种效应。\n事实证明，数字图案化有两个过程在起作用：产生条状图案的图灵机制和通过HOX基因控制比例的第二个调整机制。夏普更愿意将它们视为同一机制的不同方面。\n也许最好将图灵的模型视为在一个更大的生物系统的背景下，与其他因素协同发挥特定的发展作用，而不是作为一个独立的机制。格林说：“图灵过程是理解多种形态生物质如何协同工作的一块拼图。”\n我们已经知道，基因既与其他基因相互作用，也与无数环境因素相互作用来表达特征。默里说：“为了真正理解生物的发展，我们需要知道基因是如何影响产生观察到的模式的物理元素的，当然，实际的生物元素是什么，它们是如何相互作用的。”话又说回来，理论建模有它的位置。“如果我们只能用遗传学来理解发育，我们仍然不会知道如何造鸡。”", "note_en": "In 1952, Alan Turing, a British mathematician best known for his work on code-breaking and artificial intelligence, was convicted of engaging in homosexual acts and sentenced to chemical castration. Amid that personal drama, he still found the time to publish  a visionary paper on the mathematics of regularly repeating patterns in nature, which could be applied to the stripes on tigers and zebra fish, the spots on leopards and the spacing in rows of alligator teeth, to name a few.\n Now, more than 60 years later, biologists are uncovering evidence of the patterning mechanisms that Turing proposed in his paper, prompting a resurgence of interest in them, with the potential to shed light on such developmental questions as how genes ultimately make a hand. “That structure is there,” said Jeremy Green, a developmental biologist at King’s College London. “We just need to put the chemistry onto the mathematics to get the biology.”\n For the work that led to his 1952 paper, Turing wanted to understand the underlying mechanism that produces natural patterns. He proposed that patterns such as spots form as a result of the interactions between two chemicals that spread throughout a system much like gas atoms in a box do, with one crucial difference. Instead of diffusing evenly like a gas, the chemicals, which Turing called “morphogens,” diffuse at different rates. One serves as an activator to express a unique characteristic, like a tiger’s stripe, and the other acts as an inhibitor, kicking in periodically to shut down the activator’s expression.\n To explain Turing’s idea, James Murray, emeritus professor of mathematical biology at the University of Oxford and an applied mathematician at Princeton,  imagined a field of dry grass dotted with grasshoppers. If the grass were set on fire at several random points and no moisture were present to inhibit the flames, Murray said, the fires would char the entire field. If this scenario played out like a Turing mechanism, however, the heat from the encroaching flames would cause some of the fleeing grasshoppers to sweat, dampening the grass around them and thereby creating periodic unburned spots in the otherwise burned field.\n  The notion was intriguing but speculative. Turing died two years after the publishing of his paper, which languished in relative obscurity for decades. “He didn’t actually apply it to any real biological problem,” Murray said. “It was mainly a boon for mathematicians looking for analytical problems.”\n Although there was an explosion of theoretical work and computer modeling in the 1970s that successfully reproduced patterns like spots and stripes using Turing mechanisms, molecular biology was nowhere near the point where researchers could identify the specific molecules acting as activators and inhibitors.\n The latest research suggests that Turing-type mechanisms may be responsible for the spacing between hair follicles in mice and feather buds on a bird’s skin, the ridges that form on a mouse’s palate and the digits on a mouse’s paw.\n Some biologists remain skeptical that Turing mechanisms are sufficient to account for these periodic patterns, particularly because there are other viable models, including one proposed by Lewis Wolpert, an emeritus developmental biologist at University College London. In Wolpert’s model, cells interpret their position in space based on how much of each morphogen there is, resulting in stripes, spots or digits. Furthermore, Wolpert said, “no one has yet identified the molecules that work for a Turing mechanism in development.”\n That lack of experimental identification has been the most serious stumbling block for Turing advocates, but that has begun to change. Last year,  Green and his colleagues identified two chemicals that behave as activator and inhibitor, giving rise to the regularly spaced ridges found in the roof of the mouth in mouse embryos. A protein called fibroblast growth factor (FGF) serves as the activator, and a gene variant dubbed Sonic hedgehog ( Shh) acts as an inhibitor. When the researchers increased or decreased the activity of those chemicals, the pattern of ridges were affected just as Turing’s equations predicted.\n Biology is messy and complicated, with many confounding factors, which makes it difficult to demonstrate experimentally that a pattern results from a Turing mechanism. So Green and his cohorts removed one of the ridges, thereby increasing the space between ridges. If there were no Turing mechanism, a replacement ridge would have formed. Instead, the researchers saw extra ridges pop up in a branching pattern to fill the space — a hallmark of Turing’s model.\n  Applicable to any number of systems, the Turing mechanism is almost too general. Researchers have identified Turing-like features in the distribution of species in ecological systems, such as the predator-prey model, in which the prey function as activators, seeking to reproduce and increase their numbers while the predators act as inhibitors, keeping the population in check. Neurons, too, can be described mathematically as activators or inhibitors, encouraging or dampening the firing of other, nearby neurons in the brain.\n “If you have any two processes that act [as activator and inhibitor], you can always get periodic patterns out of them,” said Green, pointing to the ripples that form on sand dunes as an example. “Clearly there are no diffusing morphogens at work there. It’s just that the processes have a property you can represent using a diffusion function.”\n Turing admitted as much in his original paper: “This model will be a simplification and an idealization, and consequently a falsification,” he wrote. That doesn’t necessarily mean the model is wrong, but it is challenging to move from identifying the behavior of a system that seems to follow a Turing mechanism to identifying the specific physical processes that act as activator and inhibitor. For example, experiments with zebra fish stripes have shown that they arise from a Turing mechanism, but rather than secreting chemicals that spread throughout the system, the fish has two kinds of cells that serve the same purpose as activators and inhibitors. The molecules most likely to play the activator/inhibitor roles can only be embedded in a cell membrane, not secreted. So for the mechanism to work, the cells must have contact with one another.\n  Granted, the Turing model has shortcomings. A Turing mechanism alone cannot account for scaling in nature’s patterns. Chicken eggs are a good example of scaling, in that they can be large, small or anything in between, but regardless of the size of a fertilized egg, if it hatches, the product will be a complete chick — not one that is missing crucial parts. “The question Turing fails to answer is: How do you get that scaling process?” Green said.\n The answer might lie in  a new paper on the formation of digits in the paws of mouse embryos. According to co-author Maria A. Ros of the University of Cantabria in Spain and the Spanish Research Council, the study aimed to explore polydactylism — the formation of extra digits, for example a sixth finger on one hand.\n Digit patterning is similar to that of stripes. But although fingers fan out in a pattern of stripes, the distance between the fingertips —  the wavelength, if you will — and the distance between the knuckles are different. The pattern scales proportionately. If those stripes arise from a Turing mechanism, something else must be influencing the scaling.\n Several genes are associated with polydactylism, most notably a gene called  Gli3 that is regulated by  Shh. Earlier studies had concluded that the absence of both  Gli3 and  Shh in mouse embryos would lead to an increase in a class of genes known as  Hox genes, essential to the proper development of the body’s structure, including the number of fingers and toes.\n Mice have 39  Hox genes in four distinct clusters. Ros decided to test the hypothesis that more  Hox genes led to more digits by progressively knocking out  Hox variants. She expected that the number of digits would decrease as more  Hox genes were removed. Instead, the opposite occurred: the more  Hox genes were removed, the more extra digits appeared — as many as 15 in one case.\n And the extra digits were thinner and closer together; they split into a branching pattern — the same pattern Green observed in his experiments with the ridges on mouse palates. When James Sharpe, a systems biologist at the Center for Genomic Regulation in Barcelona and one of Ros’ co-authors, fed the experimental data on the thickness and spacing of digits into his computer models, he was able to reproduce the effect via a Turing mechanism.\n  It turns out there are two processes at work in digit patterning: the Turing mechanism that produces the stripelike pattern and a second tuning mechanism to control scaling via the  Hox genes. Sharpe prefers to view them as different aspects of the same mechanism.\n It might be best to consider Turing’s model as playing a specific development role within the context of a larger biological system, in concert with other factors, rather than as a standalone mechanism. “The Turing process is a piece of the puzzle in understanding how multiple morphogens work together,” said Green.\n We already know that genes interact both with other genes and with myriad environmental factors to express traits. “To really understand biological development, we need to know how genes influence the physical elements which generate the observed patterns and, of course, what the actual biological elements are and how they interact with each other,” Murray said. Then again, theoretical modeling has its place. “If all we had to use to understand development was genetics, we would still not know how to build a chicken.”", "posttime": "2020-07-26 22:27:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "深入研究,home,图灵", "title": "生物学家深入研究图灵图案", "title_en": "Biologists Home in on Turing Patterns", "transed": 1, "url": "https://www.quantamagazine.org/biologists-home-in-on-turing-patterns-20130325/", "via": "", "real_tags": ["深入研究", "home", "图灵"]}, {"category": "", "categoryclass": "", "imagename": "527b5cdd1a3a75cedf537d8e64805e6f.png", "infoid": 1014274, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你可以采取的最有效的行动之一就是无论什么时候在人群中都戴上口罩。\n任何在公共场合不戴口罩的人都会使每个人都面临感染的风险，他们会增加第二次封锁的可能性，从而损害我们的经济。\n为什么？美国疾控中心和大多数专家一致认为，许多受感染和传染性的疾病患者不知道自己生病了，因为他们没有症状。", "note_en": "One of the most effective actions you can take is to wear a mask whenever around people.\n Anyone not wearing a cloth mask in public puts everyone at risk of getting infected and they hurt our economy by increasing the chances of a second lockdown.\n Why? The  U.S. CDC and most experts agree that  many infected and  contagious people don’t know they’re sick because they don’t have symptoms.", "posttime": "2020-07-26 22:26:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "感染,wear", "title": "信息图：我们为什么要戴口罩？传播率与感染风险", "title_en": "Infographic: Why should we wear face masks? Transmission Rate vs. Infection Risk", "transed": 1, "url": "https://askabout.io/covid-19/ask/why-should-most-people-wear-masks/", "via": "", "real_tags": ["感染", "wear"]}, {"category": "", "categoryclass": "", "imagename": "cf0a68898386dd18d3c646a0908cac60.jpg", "infoid": 1014273, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人们经常重复大多数降落在月球上的相机停留在月球上的情况。宇航员吉恩·塞尔南(Gene Cernan)多年来一直在讲述他如何将相机留在月球车上的故事，并在采访中讲述了这个故事：\n我把我的哈塞尔布拉德相机放在那里，镜头指向天顶，我的想法是有一天有人会回来，发现玻璃上的太阳宇宙辐射恶化了多少。所以，在爬上梯子的时候，我从来没有拍过我最后一步的照片。真是太蠢了！如果我随身携带相机，拍下照片，取下胶卷包，然后(因为重量限制)把相机扔掉，不是更好吗？\n人们很容易相信塞尔南的话-他是一位美国英雄，曾三次飞到太空，两次飞上月球-所以就每个人来说，包括媒体在内，相机就在他说他放在哪里的地方。此外，快速扫描阿波罗17号的配载列表，没有提到月球表面的相机与指挥舱一起飞溅而下。那为什么这么神秘呢？\n仔细看，照片和文字记录中有少量证据表明，他的相机确实返回了地球，这与1972年NASA的清单和宇航员的情况相矛盾。不，不要暗示戏剧性的音乐…。这里没有恶作剧或故意欺骗。我相信吉恩·塞尔南确实在月球车上留下了一台相机，只是不是他的。记忆可能是一件反复无常的事情，即使对英雄来说也是如此，在这个故事涉及的不是一个相机，而是三个相机的情况下，这一点听起来尤其正确。\n当你要去月球时，你会被分配一个60毫米镜头的相机，绑在你的胸口上，记录样品、实验和月球地形。两名宇航员都有他们自己的，在侧面清楚地贴上了标签：“CDR”代表指挥官，“LMP”代表登月舱飞行员，但它们并不相互排斥，在整个任务过程中经常根据他们用什么胶片拍摄来交换。在阿波罗17号上，杰克·施密特(Jack Schmitt)-LMP和杰出的地质学家-被设定在黑白胶片中。当他需要颜色时，他会抓起塞尔南的相机，反之亦然。\n第三架哈塞尔布莱德相机也将用于这次任务；它真的有点像野兽，拥有一个500毫米的长焦镜头，旨在为…捕捉遥远的月球特征，你知道的。科学。在两名宇航员中，塞尔南被困在500毫米口径的枪管下面看得最多，所以这完全有可能是他记忆中落在火星车上的相机。事实上，飞行后对成绩单的分析几乎证实了这一点。但是另外两个人怎么样了？\n一点背景知识。在每次阿波罗任务发射时，美国国家航空航天局都准备了一份最终的装载清单，其中记录了船上的所有设备，详细说明了登陆月球之前和之后每个航天器之间要转移的东西。当计划因时间或重量限制而更改时，此列表随后被实时修订。在日期为1972年12月12日的阿波罗17号登月发射积载表的最新修订中，登月舱内坠毁的三台相机都被标记为“已卸载”，这意味着它们被留在了月球表面。问题是，他们是在12月13日从月球发射的！所以如果额外的物品被带上飞机，就不会被记录下来。至少在网上可以买到的东西上没有。\n下一个合乎逻辑的步骤是检查文字记录，看看是否有可能通过监听正在发生的事情来跟踪摄像机。当你阅读下面的摘录时，塞尔南和施密特都站在他们最后一次EVA结束时月球车的最后安息之处。\n帕克[任务控制中心]：……杰克，我们正在制定计划，在EVA结束时改变摄像机的使用。我们会让你把指挥官的相机带到ALSEP，拍几张人们认为我们需要的照片。吉恩在部署地震检波器时，会把你的相机拿出来记录下来。然而，我们不会在长期实验中部署它。我们会把两台(相机)都带回来，弄好后再把它们带到ETB去。\n[当他说记录地震检波器时，鲍勃可能指的是吉恩将部署在VIP地点附近的地震电荷的记录照片。当他部署相机时，很可能指的是费用和短语我们不会在长期实验中部署它。指的是按照CDR-3 2核对表页面上的指示，有计划地在罗孚座椅上部署摄像头。具体地说，核对表(Checklist)要求将LMP摄像头(年代)垂直放置在座椅上。吉恩记得，他确实把相机放在了座椅上，镜头对准了座椅，镜头对准了座椅上的摄像头。&#34；吉恩记得，他确实把相机放在了座椅上，镜头对准了座椅上的摄像头。&#34；吉恩记得，他确实把相机放在了座椅上，镜头对准了座椅上的镜头。据推测，其意图是在未来某个日期找回相机，以获取长期暴露在月球环境中的信息。]。\n[塞尔南--帕克说，我们会把它们(也就是两台相机)都带回来，但我知道我把那台相机拿去做了什么。我把它落在火星车上，笔直朝上。这就是我计划要做的，我也是这么做的。我记得特意把它楔入我们座位之间的某个地方，我记不清具体放在哪里了。\n170：39：59帕克[任务控制中心]：好的，我们召集一个ETB，里面有两个摄像头。\n170：40：04施密特：ETB的下一站。(停顿)(对吉恩)有ETB吗？嗯。(停顿)ETB有两个摄像头。\nNASA偏离了要求宇航员交换相机的飞行设备：施密特将带着塞尔南的CDR相机返回LM，塞尔南将在月球车上使用施密特的LMP相机。\n完成后，使用设备传送袋(ETB)将CDR和LMP摄像机带回LM。\n在吉恩的袖带清单上，有一项是“将LMP相机面朝上放在月球车的座位上”，把它留在了后面，但因为NASA刚刚要求归还相机，吉恩按照清单，将500毫米的相机放回原位，手里拿着LMP返回登月舱。\n然后在ETB中确认两个摄像机，CDR和LMP，向上到达LM。\n在休息一段时间后，&gt；&gt；再次快进到登陆舱内的宇航员。\n183：40：17-Fullerton[任务控制中心]：挑战者，休斯顿。一次睡眠后程序的更新。我知道你带来了LMP的相机，我们想确保你在最后一次丢弃这里之前把它放进喷气式飞机的袋子里。顺便说一句，你要留下来等最后的抛弃。\n[塞尔南--很明显，我没有把LMP的相机放在火星车上对准天顶。但我发誓我放了什么东西在那里。有可能是500镜头的问题，因为我们没有把它带回来，我也提到过它在座椅下面。我知道我用相机做了什么。现在，它可能是一个镜头。我把它夹在座位之间，好像是塞进了某个地方，然后把镜头对准了天顶。\n[施密特]休斯顿想让我们扔掉相机，因为他们不想让我们拍罗恩·埃文斯的照片。他们认为这样做太麻烦、太冒险了。但是，我们打算忽略它们，我们想出了我们可以做到的方法。但我们需要一台摄像机。罗恩有一台相机，但它不是EVA认证的。\n[塞尔南--我们已经下定决心，要给罗恩拍照。]。\n[塞尔南--现在，我们确实把LMP的相机放在杰特包里了，所以我们肯定带了我的。]。\n*单击*。最后，我们有了一些清晰的东西。一架500毫米相机留在后面，在进入LM的两架相机中，LMP相机在发射前被丢弃回地面。当他们在电视上和彩色直播时，塞尔南的相机离开了。\n每台月球相机都有一个独特的序列号，通常刻在一块压在胶片平面上的玻璃上。它被称为Réseau平板，用于帮助科学家准确测量视野中的物体，并确定是哪台相机拍摄了什么图像。通过简单地查看在阿波罗17号上拍摄的照片，我们知道塞尔南的CDR相机是S/N 1023，施密特的LMP相机是S/N 1032。诚然，这些数字并不总是可见的，而且确实很容易遗漏…。我向您发起挑战，请您向上滚动到本文中的第一张照片，以找到“23”。\n仔细检查宇航员结束最后一次EVA后拍摄的照片，可以看到LM上的两台相机，只有塞尔南在月球轨道上的CDR相机。\n这就是我们很长一段时间以来所拥有的一切。吉恩·塞尔南的相机，至少在公开场合是在月球上的，私下里也不确定，甚至直到2014年，另一个月球表面的哈塞尔布拉德被错误地拍卖为“唯一从月球返回的相机”。Collect Space很快指出了描述其他相机回归的文字记录，比如埃德·米切尔(Ed Mitchell)目前在史密森博物馆展出的阿波罗14号LMP相机。这一信息后来被拍卖行更正。\n即使在那时，问题仍然存在：吉恩·塞尔南的相机在哪里？它是和登月舱一起丢弃的吗？不太可能，因为宇航员们有意识地记得把它留在罗恩·埃文(Ron Evan)的EVA上，这是在与LM脱离对接后回家的路上发生的。如果它确实溅落了，今天在NASA工作的人还记得发生了什么吗？它是丢失在私人收藏品中还是藏在博物馆的档案馆里？\n快闪到2020年2月29日：当我正在研究月球上使用的可拆卸偏振器时，瑞士摄影师马尔科·尼特利斯巴赫(Marco Nietlisbach)在Instagram上弹出了月球哈塞尔布拉德(Hasselblad)的新照片。没有提到它的历史，只有一个简单的描述“相机：HEDC(Hasselblad 500 EL数据相机)，带卡尔·蔡司Biogon F5.6-60 mm镜头。所以我联系了他。\nMarco是位于苏黎世的照相器材供应店Light&amp；Byte的专业服务主管。它靠近欧米茄(大部分阿波罗月球手表的制造商)，为马可提供了一个独特而难得的拍照机会：拍摄从NASA借给欧米茄博物馆的“真正的月球相机”。摄影师或博物馆馆长不知道相机是否飞起来了。\n现在，作为研究月球相机已有五年之久的人，这台相机立刻以正品脱颖而出。有一件事吸引了我的眼球，那就是CDR贴纸。网上关于月球相机的准确例子并不多--你会发现很多图片都是基于松散信息的商业和复制品部件的组合。在准确的例子中，只有飞行中的相机有这个贴纸。几天后的3月份，当更高分辨率的照片通过电子邮件到达时(马可非常友好地分享了它们，因为它们是一个非常棒的偏光镜参考)，我能够更仔细地查看相机，更重要的是，它的部件和序列号：P/N SEB 33100040-307，S/N1023。\n嗯。这让我思考。如果它在地面飞行和使用，可能有6名阿波罗任务指挥官可以分配给它。*阿波罗11号没有使用CDR贴纸，所以很容易排除这项任务。扫描装载列表，寻找部件号上的“-307”后缀，确定它是后来的相机，很可能是阿波罗15号，这使得可能性列表减少到3个指挥官。我从最后一次任务阿波罗17号开始，搜索每张照片底部的“23”序列号。\n不是的。咒骂。道路。看了不到5分钟，它就出现了。这真的会是吉恩..。塞尔南的…。相机呢？\n当时，我记得他讲过无数次的故事，当时我刚刚看完另一部阿波罗纪录片。像其他人一样，我以为它在月球上！Well…。“每个人”，就像在小圈子里一样痴迷于这种相机历史的人。我立即启动Photoshop，将我收件箱中的Réseau图板图像与表面拍摄的照片进行比较，翻转图层，直到一切都对齐为止。太完美了。甚至连玻璃连在一起的小咬痕也排成一排。\n吉恩·塞尔南的阿波罗17号相机不仅在地球上，而且在瑞士的欧米茄博物馆。\n我合上笔记本，走了一段路，感觉就像刚找到了基德船长的宝藏。我是唯一一个知道摄像机到底在哪里的人吗？在与马可和史密森学会的一位朋友谈论这张照片时，很明显，欧米茄并没有得到从美国国家航空航天局(NASA)传来的所有信息。溅落后我没有找到任何关于相机旅程的文件，但看起来它可能是在为阿波罗11号50周年纪念而被借出之前放在仓库里的。有没有可能NASA不记得了？我的意思是，48年是一段很长的时间，而且那个时代的文件非常参差不齐。\n自从3月初的那次漫步以来，我花了四个月的时间试图追踪相机从地表返回地球的旅程。我还联系了美国国家航空航天局(NASA)，确认他们有关于这件文物的哪些文件。他们回来后我会更新这篇帖子。这些信息完全有可能是内部知道的，但在大流行期间几乎不能接触到档案，这使得研究相当困难。\n与此同时，它在欧米茄得到了极好的管理，每当它被处理时都会接受白手套处理。应该是这样的。这台相机捕捉到了阿波罗的一些最具标志性的图像，并被最后一批人用来踏上月球。\n特别感谢Marco Nietlisbach分享了他精彩的照片，并毫不掩饰地开始了这次旅行。请随意在这里查看他的摄影作品。", "note_en": "It’s often repeated how most of the cameras that landed on the moon stayed on the moon. Astronaut Gene Cernan had been telling the story of how  he left his camera on the lunar rover  for years, recounting the tale in interviews:\n &#34;I left my Hasselblad camera there with the lens pointing up at the zenith, the idea being someday someone would come back and find out how much deterioration solar cosmic radiation had on the glass. So, going up the ladder, I never took a photo of my last footstep. How dumb! Wouldn’t it have been better to take the camera with me, get the shot, take the film pack off and then (for weight restrictions) throw the camera away?&#34;\n It’s easy to accept Cernan at his word - he’s an American hero who flew to space three times, twice to the moon - so as far as everyone was concerned, including the press, the camera was right where he said he left it. Plus, a quick scan of the Apollo 17 stowage list reveals no mention of a lunar surface camera splashing down with the command module. So why the mystery?\n Looking closer, there’s a sprinkling of evidence in photos and transcripts that suggest his camera did in fact return to earth, contradicting both the 1972 NASA inventory and the astronaut. No, don’t cue the dramatic music… there’s no mischief or intentional deception here. I believe Gene Cernan did leave a camera on the lunar rover, just not “his.” Memory can be a fickle thing, even for heroes, and that rings especially true in this case when the story involves not one camera, but three.\n  When you’re going to the moon, you’re assigned a camera with a 60mm lens that gets strapped to your chest to document samples, experiments, and the lunar terrain. Both astronauts get their own, clearly labeled with a sticker on the side: “CDR” for commander and “LMP” for lunar module pilot, but they weren’t mutually exclusive, often being swapped throughout the mission based on what film they were shooting with. On Apollo 17, Jack Schmitt - LMP and geologist extraordinaire - was set up with the black &amp; white film. When he needed color, he’d grab Cernan’s camera and vice versa.\n A third Hasselblad camera was also to be used on the mission; it was a bit of a beast really, boasting a 500mm telephoto lens meant to capture distant lunar features for, you know… science. Of the two astronauts, Cernan got stuck looking down the barrel of the 500mm the most, so it’s entirely possible that  this is the camera he remembers leaving on the rover. In fact, the post-flight analysis of the transcript pretty much confirms it. But what happened with the other two?\n  A little background. As each Apollo mission launched, NASA prepared a final stowage list that documented all the equipment aboard, detailing what was to be transferred between each spacecraft before and after landing on the moon. This list was then revised in real time as plans changed due to time or weight restrictions. In the latest revision of the  Apollo 17 LM Lunar Launch Stowage List, dated December 12th, 1972, the three cameras that went down in the LM are all marked as “offloaded,” meaning they were left on the surface. The problem is, they launched from the moon on December 13th! So if extra items were brought onboard, it’s not recorded. At least not in what’s available online.\n  The next logical step was to check the transcripts to see if it was possible to follow the cameras by listening to what was happening. As you read the following excerpt, Cernan and Schmitt are both standing by the final resting place of the lunar rover at the end of their last EVA.\n 169:29:44  Parker [Mission Control]: ...and, Jack,  we&#39;re making plans here, to change the camera usage at the end of EVA here. And we&#39;re going to let you take Commander&#39;s camera out to the ALSEP and take a few photos which people think we need. And Gene&#39;s going to take your camera out and document the geophone, when he deploys it. We will not deploy it for the long-term experiment, however.  And we&#39;ll bring both (cameras) back, and carry them to the ETB when we get done.\n  [When he said &#34;document the geophone&#34;, Bob may have been referring to documentary photos of the seismic charge Gene will deploy near the VIP site. &#34;When he deploys it&#34; probably refers to the charge and the phrase &#34;we will not deploy it for the long-term experiment&#34; refers to a planned deployment of the camera on the Rover seat as indicated on checklist page   CDR-3 2.   Specifically, the checklist calls out &#34;Pos(ition) LMP cam(era) vert(ically) on seat.&#34;  Gene remembers that he did put the camera on the seat, with the lens pointed at the zenith. Presumably, the intent was to recover the camera at some future date to get information of long-term exposure to the lunar environment.]\n [Cernan - &#34;Parker said &#39;We&#39;ll bring them both (that is, both cameras) back,&#39; but I know what I did with that camera. I left it on the Rover pointed straight up.  That&#39;s what I planned to do and that&#39;s what I did. I can remember specifically wedging it - I don&#39;t remember exactly where - somewhere up between our seats.&#34;]\n  170:39:59  Parker [Mission Control]: Okay, and we gather an ETB coming up with two cameras in it.\n 170:40:04  Schmitt: ETB&#39;s next. (Pause) (To Gene) Got an ETB? Yeah. (Pause) ETB has two cameras.\n  NASA deviates from the flight plant requesting the astronauts swap cameras:  Schmitt is to return to the LM with Cernan’s CDR camera, and Cernan is to use Schmitt’s LMP camera at the rover.\n When they’re done, both CDR and LMP cameras  are to be brought back into the LM using the equipment transfer bag (ETB).\n On Gene’s cuff checklist was an item to “Position the LMP camera facing up on the seat of the rover,” leaving it behind, but because NASA had just asked for that camera to be returned, Gene, following the checklist, positions the 500mm in its place, returning to the lunar module with the LMP in hand.\n Two cameras, the CDR and LMP, are then confirmed in the ETB going up to the LM.\n &gt;&gt;&gt;&gt; Fast forward again to the astronauts inside the LM after a rest period &gt;&gt;&gt;&gt;\n 183:40:17  Fullerton [Mission Control]: Challenger, Houston. One update for the post-sleep procedure. I understand you brought in the LMP&#39;s camera, and we want to be sure you get that into the  jett bag before the final jettison here. And, by the way, you&#39;re Stay for that final jettison.\n  [  Cernan  - &#34;Obviously, I did not leave the LMP&#39;s camera on the Rover pointed at the zenith. But I swear I put something there. It&#39;s possible it could have been the 500 lens, because we didn&#39;t bring it back and I mentioned it was under the seat. I know that I did something with a camera. Now, it could have been a lens. And I stuck it between the seats, sort of wedged it in somewhere, and pointed the lens toward the zenith.&#34;]\n [ Schmitt - &#34;Houston wanted us to jettison the camera because they didn&#39;t want us to take pictures of Ron Evans&#39; EVA. They had decided it was too cumbersome and too risky. But, we were going to ignore them, and we figured out how we could do it. But we needed a camera. Ron had a camera, but it was not EVA-qualified.&#34;]\n [ Cernan - &#34;We had made up our minds we were going to take pictures of Ron.&#34;]\n  [Cernan - &#34;Now, we did put the LMP&#39;s camera in the jett bag, so we must have had mine.&#34;]\n *Click*. Finally, we have some clarity. One 500mm camera stays behind, and of the two that go up into the LM, the LMP camera gets jettisoned back to the surface before launch. Cernan’s camera leaves with them as they blasted off live on TV and in color.\n  Every lunar camera has a unique serial number, usually etched into a piece of glass that’s pressed against the film plane. It’s known as the Réseau plate, used to help scientists both accurately measure objects in view, and identify what camera took what image. By simply  looking through the photos captured on Apollo 17, we know Cernan’s CDR camera was S/N 1023, and Schmitt’s LMP camera was S/N 1032. Granted, those numbers are not always visible, and are really easy to miss… I challenge you to scroll back up to the first photo in this article to find the “23.”\n A close examination of photos taken   after the astronauts ended their last EVA show both cameras onboard the LM, and only Cernan’s CDR camera in lunar orbit.\n  That’s all we’ve had for quite a while. Gene Cernan’s camera, at least publicly, was on the moon, and privately it wasn’t certain, even as late as 2014 when another lunar surface Hasselblad was being erroneously auctioned as “the only camera to come back from the moon.”  CollectSpace was quick to point out transcripts that described other cameras coming back, like Ed Mitchell’s  Apollo 14 LMP camera currently on display at the Smithsonian. The information was later corrected by the auction house.\n Even then, the question remained: where was Gene Cernan’s camera? Was it jettisoned with the lunar module? Not likely, since the astronauts consciously recall keeping it for Ron Evan’s EVA, which happened on the way home after undocking with the LM. If it did splash down, does anyone working at NASA today remember what happened? Was it lost to a private collection or hidden away in the archives of a museum?\n  Flash forward to February 29, 2020: While I was researching a detachable polarizer used on the moon, new images of a lunar Hasselblad  popped up on Instagram from Swiss photographer Marco Nietlisbach. No mention of it’s history, just a simple description “Camera: HEDC (Hasselblad 500 EL Data Camera) with a Carl Zeiss Biogon f5.6-60mm lens.” So I reached out.\n Marco is Head of Professional Services at   Light &amp; Byte, a photo equipment supply shop based in Zürich. Its close proximity to Omega, the manufacturer of most of the Apollo moon watches, had afforded Marco a unique and rare photo opportunity: shooting “a real moon camera”\u009d which was on loan to the Omega Museum from NASA. Whether the camera was flown or not wasn’t known by photographer or museum curator.\n   Now, as someone that’s been researching lunar cameras for half a decade, the camera immediately jumped out as authentic. One thing that caught my eye was the CDR sticker. There aren’t many accurate examples of lunar cameras online - many of the images you’ll find are a combination of commercial and replica parts based on loose information. Of the accurate examples, only flown cameras have this sticker. When higher resolution photos arrived via email a few days later in March (Marco was very kind to share them as they’re a fantastic polarizer reference) I was able to get a closer look at the camera, and more importantly, the part and serial numbers: P/N SEB 33100040-307,  S/N 1023.\n Hmm. That got me thinking. If it was flown and used on the surface, there were 6 possible Apollo mission commanders it could have been assigned to. Apollo 11 didn’t use CDR stickers, so it was easy to exclude that mission. Scanning the stowage lists for the “-307” suffix on the part number identified it as a later camera, likely Apollo 15 forward, which whittled the list of possibilities down to 3 commanders. I started with the last mission, Apollo 17, searching for the “23” serial number at the bottom of every photo.\n No. Expletive. Way. Not 5 minutes into looking, there it was. Could this really be Gene... Cernan’s… camera?\n At the time I remembered the story he had told countless times, having just finished watching yet another Apollo documentary. Like everyone else, I thought it was on the moon! Well… “everyone” as in the small circle of people as obsessed with this sort of camera history. I immediately fired up Photoshop to compare the Réseau plate images in my inbox to photos taken on the surface, flipping the layers on and off until everything was aligned. It was  perfect. Even the little bite marks from where the glass was attached lined up.\n  Gene Cernan’s Apollo 17 camera is not only on earth, it’s at the Omega museum in Switzerland.\n Closing my laptop, I went on a walk feeling like I had just found Captain Kidd’s treasure. Was I the only person that knew where this camera  really was? In talking with Marco about the photoshoot, and a friend at the Smithsonian, it was clear Omega didn&#39;t get all of the info when it was transferred over from NASA. I haven’t found any documentation of the camera’s journey since splashdown, but it appears it could have been in storage before being loaned out in prep for the 50th anniversary of Apollo 11. Could it be possible that NASA didn’t remember? I mean, 48 years is a long time, and the documentation from the era is super spotty.\n I’ve spent the last four months since that walk in early March, trying to trace the camera’s journey from the surface back to earth. I’ve also reached out to NASA to confirm what documentation they have on the artifact. I’ll update this post when they get back. It’s entirely possible this information is known internally, but having little access to the archives during a pandemic makes research quite difficult.\n In the mean time, it’s in excellent hands at Omega, receiving the white glove treatment whenever it’s handled. As it should be. It’s a camera that captured some of the most iconic images of Apollo, and was used by the last people to step foot on the moon.\n A special thanks to Marco Nietlisbach for sharing his wonderful images and unwhittingly kicking off this journey. Feel free to check out his photographic work  here.", "posttime": "2020-07-26 22:21:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "相机,失踪,gene,月球", "title": "找到吉恩·塞尔南失踪的月球相机", "title_en": "Finding Gene Cernan's Missing Moon Camera", "transed": 1, "url": "https://www.spacecamera.co/articles/2020/3/3/gene-cernans-missing-lunar-surface-camera", "via": "", "real_tags": ["相机", "失踪", "gene", "月球"]}, {"category": "", "categoryclass": "", "imagename": "ff74788ea1afc84287ee0f56e3183128.png", "infoid": 1014272, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一个晴朗的星期六早上，2020年7月4日。我刚给麦克斯安排了早餐和卡通(如果你好奇的话，可以说是“麦克风”)。我每天放假，朱莉都像往常一样睡懒觉。我是个早起的人，这是我们共同养育孩子的宝贵部分。这给了我和麦克斯建立联系的时间(当他不是在看卡通片的时候填满了他的脸和笑的时候)。我坐下来，拿着我的笔记本电脑，费力地读了一周的私人电子邮件。\n“哦，看，AWS法案，我应该笑一笑，”我自言自语道。直到最近，对于一些非常轻微的SES使用来说，每月都是几分钱。今年2月，我离开了谷歌云，回到了AWS。主要的动机是Google将GSuite和GCP IAM纠缠在一起，以至于变得过于混乱。\n随之而来的是这个网站的CDN(cdn.chrisShort.net)。我指的是Cloudflare正面的S3桶，当我说CDN时，它持有的资产被认为对GIT来说太大了。它甚至不是chrisShort.net本身，因为它托管在Netlify的CDN和我拥有或管理的所有其他静态站点上。我已经使用Cloudflare很长时间了。CDN不到300个文件，在各种云上已经存在了5年以上。将其从GCP搬回AWS，将AWS的账单推高至平均每月23美元。考虑到网站的流量，这还不算太糟。\n不是在这个周六早上，不是。2020年6月的AWS法案令人心悸，造成2657.68美元(PDF)。我听到了喘息的声音，“把你的狗屎放在一起。”我心里想。麦克斯靠在我身上喝他的牛奶。我知道他看着笔记本电脑的屏幕就能看出来不对劲。我只是猜想当他看到字母和数字时，他会想，“成人的东西…。这些卡通和这个肉桂吐司嘎吱作响。“2020年是这样的一年，我的军史是这样的，我被诊断出患有恐慌症(除了创伤后应激障碍和身体伤害之外)。\n我立刻开始惊慌失措。当我采取精神上的步骤来缓解恐慌症发作时，我开始形成一个作战计划。是的，我可以切换回紧急模式，就像过去一样，当某事发生爆炸或爆炸时，我会朝它跑去(相信我，总体上这是没有帮助的)。\n首先，麦克斯：马斯洛的需求层次？检查一下。接下来是我：仿佛这是命中注定的，我对晨间用药的警觉消失了。\n“爸爸得去拿他的药了，伙计。”本能地，麦克斯靠在我身上(哇，…。好的，…。他习惯了在那之后不久就听到这样的提醒和声明；我的大脑现在超负荷运转了)。我接受了我所需要的一切来征服它，同时仍然能够在认知上发挥作用。我重新倒了杯咖啡，拿了一个笔记本电脑充电器。\n我登录到AWS控制台，希望这个月能得到一些独一无二的输出。更奇怪的事情已经发生了(比如S3崩溃)。这项法案不可能比以往任何时候都更不寻常。这张AWS账单比我们的抵押贷款多几百美元！我访问了AWS帐单页面，对我看到的情况深感悲痛：\n它就在那儿。2657.68美元，盯着我看。“这不可能是合法的。”再往下看，它看起来确实是来自us-East-2的cdn.chrisShort.net s3桶的合法流量。总共有超过30.6 TB的流量从该S3存储桶中移出。什么时候？！？这是刚刚发生的吗？不是的。\n30.6 TB？！？！这怎么可能？2020年6月23日1011.59美元。2020年6月24日1639.07美元。\n我立即在AWS支持下开具了一张罚单，疯狂地想知道是什么出了问题？这怎么可能呢？有人绕过云焰了吗？见鬼的Cloudflare在说什么？\n哦，酷，Cloudflare让这2700个请求完全不加缓存地通过了吗？该异常怎么不会被检测为DDoS？为什么只缓存了很少一部分流量(稍后将详细介绍)？\n哦，第二天又有4,400个请求…。甜蜜的，宝贝耶稣。哦，但是你提供了9 GB的缓存。谢谢，云焰。\n显然，当你在推特上发一些疯狂的东西，比如一张2700美元的AWS账单，在一个安静的假日早晨，它会得到很多关注。25万人看到了这条推文，其中三分之一的人与之互动。我的朋友、云计算经济学家科里·奎因(Corey Quinn)说，AWS Support Twitter账户之前受到了足够的关注。\n哦，不！😰很抱歉听到这个令人不快的星期六早上的惊喜，克里斯。请创建支持案例，以便我们的工程师可以帮助查明此问题的真相：https://t.co/weTUnSYLRU.。🕵️‍♀️^HG。\n-AWS支持(@AWSSupport)2020年7月4日\n赞扬Twitter至少有能力将注意力吸引到一些事情上。我不确定如果没有它，这件事会不会有那么好的结局。\n在西海岸时间黎明前看到账单后，我几乎立刻就把它转发给了科里。我永远感谢科里的分析。当他准备好后，科里给我发了一张他需要做分析的东西的清单(相反，我给他创建了一个有适当烫发😉的定期iam账户，是的，之后我清理了头发)。\nCorey鼓励我应用存储桶策略，只允许Cloudflare IP地址访问存储桶中的任何内容。这里的理论是有人可能以某种方式绕过了云焰。但是，值得庆幸的是，Cloudflare发布了它们的IP块，而且它们并不经常更改。Cloudflare支持文章“配置Amazon Web服务静态站点以使用Cloudflare”为您提供了一个示例存储桶策略来执行此操作。这应该成为人们的标准做法。但是，在这种情况下这并不重要；稍后会详细介绍。\n科里·奎恩(Corey Quinn)关于这个话题的帖子很好地报道了AWS方面发生的事情：\n“…。这几乎完全归功于US-EAST-2数据从…传出。“。\n“克里斯·肖特不是某个随机的傻瓜…”(这可能是科里对任何与他没有亲属关系的人说过的最好听的话)。\n“‘出乎意料的混蛋，你的房贷不是你这个月最贵的账单，我猜你应该启用账单报警器的！’烂透了，坏了，根本解决不了问题！“。\n我有云焰(1918916)和aws(7153956931)的入场券。考虑到当时的情况，CloudFlare是我能想象到的最没有帮助的服务。一位长期用户和断断续续的客户认为他们被攻击了两天，而你却连一根手指都不提？如果我没有足够的理由离开云焰，我现在就有。这将是稍后的博客文章的更新。但是，如果你在一家CDN公司工作，而且启动和运行起来相对容易，我很有兴趣听到你的消息。\n在经历了一个非常混乱的早晨后，我听从了科里的建议，断开了联系，享受了这个假日周末。\n7月8日，一位精明的AWS员工开始四处挖掘，并找到了我。因为他们对此的看法和我和科里一样令人费解。为什么这么少的请求会如此迅速地产生如此多的流量，然后它一出现就又消失了呢？这看起来也不像是故意恶意的，因为Cloudflare和AWS让它直接通过了。\n事后看来，我做出了一个糟糕的决定，以qcot2文件的形式分发试用的Windows 2019 SQL Server虚拟机映像(完全修补了所有必要的驱动程序和VM扩展)。有人意识到此VM映像的存在。然后，他们使用互联网可访问的URL竖立了数百份，甚至可能是数千份该虚拟机的副本。从理论上讲，这是可能的，像Kubernetes和Kubevirt这样的公司。假设磁盘映像成为相应VM Pod中的卷装载。旋转足够多的VM副本，单个YAML文件就可以创建无限个VM副本。如果YAML定义直接引用Cloudflare或S3URL，而不是本地缓存的副本，那么您可以快速地累积下拉图像的次数。在本例中，qcot2映像是13.7 GB。但这比这要棘手得多。\n把这个放在“我应该知道但没有知道的事情”项下。您知道吗？“Cloudflare的CDN缓存的最大文件大小为512MB，适用于免费、专业和商务客户，而适用于企业客户，最大文件大小为5 GB。”没错，Cloudflare每次都会看到13.7 GB文件的请求，并将它们直接发送到原始位置。唉哟!。\n我在7月4日立即怀疑这些文件，并暂时将它们移到内部工作的GDrive。如果你需要这些图片，让我知道，如果你要的话，你也是嫌疑犯，请注意。\n如果你正坐在家里计算，可能有些事情不太对劲。带宽成本很低，当然，六月份确实有一些合法的流量流入桶中，但是，正如勇敢的AWS员工发现的那样，3655部分访问对象实际上可能是作为完整的文件请求提供的，Cloudflare可能曾经对它们做过任何事情。是的，这是一个漏洞，人们正在调查它。我还建议对象大小限制是一个可调的S3存储桶策略。这样一开始，我甚至无法将文件上传到存储桶中。\n正如我提到的，在我收到账单的那天(7月4日)，我已经从存储桶中删除了多个千兆字节的文件。科里在这里指出了这一点。这可能阻碍了AWS方面的调查。我以后不会这么快删除的。不过，我会把文件锁起来的。但是，让我们面对现实吧。现在我知道了Cloudflare的512MB文件限制，现在我正在将该存储桶中的其他更大的文件移到Archive.org(并将它们添加到我支持的原因中)。\n从长远来看，我不想将文件存储在多个地方。我不认为Archive.org应该成为我的网站的垃圾场，因为如果它流行起来，它可以盈利。Archive.org暂时是两个文件的权宜之计。但是，现在我已经启用了适当的日志记录(哦，还有AWS预算警报)，我可以对该存储桶进行一些清理。我还将研究Cloudflare的用户友好的替代品，即使这需要我每个月花几块钱。我也再也不会把工作和个人文件共享混为一谈了。\n最终，AWS确实退还了2657.68美元原始账单中除约40美元以外的所有款项。我想知道我是否与其他提供商(包括CDN)合作过，如果我得到了退款。我怀疑规模较小的供应商不会这么宽容，特别是在全球经济环境下。", "note_en": "It was a bright, Saturday morning, July 4, 2020. I had just gotten Max all situated with breakfast and cartoons (Mighty Mike, if you’re curious). Julie was sleeping in like she usually does on every day I have off. I’m an early riser and this is a cherished part of our co-parenting. It gives Max and I time to bond (when he’s not stuffing his face and laughing at cartoons). I sat down with my laptop to plow through the week’s personal email.\n  “Oh look, the AWS bill, I should have a laugh at that,” I thought to myself. Until recently, it had been pennies a month for some very light SES usage. In February, I moved off Google Cloud back to AWS. The primary motivation was that Google had so intertwined GSuite and GCP IAM that it became overly confusing.\n  Along with that migration came the CDN for this web site (cdn.chrisshort.net). I mean  a Cloudflare fronted S3 bucket that holds assets deemed too big for git when I say CDN. It’s not even  chrisshort.net itself, as it is hosted on Netlify’s CDN and every other static site I own or manage. I’ve been a Cloudflare user for a long time. The CDN is less than 300 files and has existed for over five years on various clouds. Moving it back to AWS from GCP bumped the AWS bill to an average of $23/month. Not too bad given the  site’s traffic.\n  Not on this Saturday morning, nope. June 2020’s AWS bill was a heart palpitation causing  $2,657.68 ( PDF). I audibly gasped, “Keep your shit together.” I thought to myself. Max was leaned up against me drinking his milk. I know he could tell something was wrong because he looked at the laptop screen. I only assume when he saw letters and numbers, he thought, “Adult stuff… These cartoons and this Cinnamon Toast Crunch tho.” 2020 being the year that it is and my military history being what it is, I’ve been diagnosed with a panic disorder (on top of the PTSD and physical injuries).\n   I immediately began having a panic attack. As I took the mental steps to mitigate the onset of the panic attack, I started forming a battle plan. Yes, I can switch back to emergency mode, like back in the old days, when something would go bang or boom, and I’d run towards it (it’s not helpful overall, trust me).\n First, Max: Maslow’s Hierarchy of Needs? Check. Next, me: As if it was destined, my alert for morning medications went off.\n “Daddy’s gotta grab his meds, bud.” Instinctively, Max leans off me (wow… okay… he’s used to hearing that reminder and statement shortly after that; my brain is now in overdrive). I take everything I need to conquer this while still being able to function cognitively. I refill my coffee and grab a laptop charger.\n     I login to the AWS console, hoping I got some output that was uniquely off this month. Weirder stuff has happened (like  S3 going down). This bill couldn’t be more out of the norm than ever. This AWS bill is several hundred dollars more than our mortgage! I hit the AWS Billing page and am deeply saddened by what I see:\n  There it was.  $2,657.68, staring at me. “This can’t be legit.” Drilling down even further, it looks like it is indeed legitimate traffic from the cdn.chrisshort.net S3 bucket in us-east-2. In total,  more than 30.6 terabytes of traffic had moved out of that one S3 bucket. WHEN?!? Did this just happen? Nope.\n   30.6 TB?!?! how is that even possible??? $1,011.59 on 23 June 2020. $1,639.07 on 24 June 2020.\n I immediately open a ticket with AWS Support frantically wondering what broke? How is this even possible? Did someone bypass Cloudflare? What the hell is Cloudflare saying?\n Oh cool, Cloudflare let those 2,700 requests passthrough completely uncached? How is that not anomaly detected as a DDoS??? How is it that barely of the fraction of the traffic is cached (more on that later)?\n Oh, another 4,400 requests the next day… Sweet, baby Jesus. Oh, but you served 9 GB from cache. Thanks, Cloudflare.\n  Apparently, when you tweet something crazy af, like a $2700 AWS bill, it gets a lot of attention on a quiet holiday morning. A quarter-million people saw the tweet and a third of them interacted with it. It was enough attention that the AWS Support Twitter account was on it before,  my friend and  cloud economist, Corey Quinn.\n Oh no! 😰 Sorry to hear about this unpleasant Saturday morning surprise, Chris. Please create a support case so our agents can help get to the bottom of this:  https://t.co/weTUnSYLRU. 🕵️‍♀️ ^HG\n— AWS Support (@AWSSupport)  July 4, 2020\n Praise Twitter for at least its ability to draw attention to things. I am not sure this would’ve ended up as well as it did without it.\n I forwarded the bill to Corey almost immediately after seeing it at pre-dawn west coast time. I am forever thankful to Corey for his analysis. When he was ready, Corey sent me a list of things he needed to do an analysis (instead, I created him a regular IAM account with the proper perms 😉 and yes I cleaned up after).\n Corey encouraged me to apply a bucket policy that would only allow Cloudflare IP addresses to access anything from the bucket. The theory here is that someone could have been bypassing Cloudflare somehow. But, thankfully,  Cloudflare publishes their IP blocks and they don’t change all that often. The Cloudflare support article,  Configuring an Amazon Web Services static site to use Cloudflare gives you an example bucket policy to do exactly that. This should become a standard practice for folks. However, it wouldn’t have mattered in this case; more on that later.\n Corey Quinn’s thread on the topic covers what happened on the AWS side pretty well:\n  ”…it’s almost entirely due to us-east-2 data transfer out…”\n  “Chris Short isn’t some random fool…” (Might be the nicest thing Corey’s every said about anyone he’s not related to)\n ”‘Surprise jackhole, your mortgage isn’t your most expensive bill this month, guess you shoulda enabled billing alarms!’ is crappy, broken, and WOULD NOT HAVE SOLVED THE PROBLEM!”\n  I had tickets in with Cloudflare (1918916) and AWS (7153956931). Cloudflare was the least helpful service I could have imagined given the circumstances. A long term user and on and off customer thinks they were attacked for two days and you don’t lift a finger? If I didn’t have reason enough to move off of Cloudflare, I do now. That’ll be an update for a later blog post. But, if you work for a CDN company and you’re relatively painless to get up and running, I’m interested in hearing from you.\n After a very chaotic morning, I take Corey’s advice, disconnect, and enjoy the holiday weekend.\n  On July 8th, an astute AWS employee starts doing some digging around and reaches out to me. Because they see this as bafflingly as Corey and I do. How did so few requests generate so much traffic so quickly and then as soon as it appears, it’s gone again? It doesn’t seem like something intentionally malicious either because Cloudflare and AWS let it right on through.\n  In hindsight, I made a poor decision to distribute a trial Windows 2019 SQL Server virtual machine images (fully patched with all necessary drivers and VM extensions) in the form of a qcow2 file. Someone became aware of the existence of this VM image. They then stood up hundreds, potentially thousands, of copies this VM using the internet accessible URL. This is, in theory, possible, with something like  Kubernetes and  Kubevirt. Given that the disk image becomes a volume mount in the corresponding VMs pod. Spin up enough copies of the VM, a single YAML file can create infinite copies of a VM. If the YAML definition directly referenced the Cloudflare or S3 URL and not a locally cached copy, you can rack up the number of times you pull down an image real quick. The qcow2 image, in this case, was 13.7 GB. But it’s trickier than that.\n  File this under, “Things I should’ve known but didn’t.” Did you know that “The maximum file size Cloudflare’s CDN caches   is 512MB for Free, Pro, and Business customers and 5GB for Enterprise customers.” That’s right, Cloudflare saw requests for a 13.7 GB file and sent them straight to origin every time  BY DESIGN.  Ouch!\n I suspected these files immediately on July 4 and moved them to an internal work GDrive for the time being. If you need the images, let me know, you’re also a suspect if you ask for them, be warned.\n If you’re sitting at home doing the math, something might not be adding up. The bandwidth cost is off, there was indeed some legitimate traffic to the bucket in June, of course, But, as it turns out the intrepid AWS employee discovered that 3655 partial GETs to the object might have actually been delivered as full file requests and Cloudflare might have ever done anything with them. Yes, this is a bug somewhere and folks are looking into it. I also suggested that object size limits be a tunable S3 bucket policy. This way, I wouldn’t have even been able to upload the files to the bucket, to begin with.\n  As I mentioned, I’ve removed the multiple gigabyte files from the bucket the day I got the bill (July 4).  Corey pointed that out here. That might have hindered the investigation from the AWS side. I won’t be so quick to delete in the future. I will lock files down though. But, let’s face it. Now that I’m aware of the  512 MB file limit at Cloudflare, I am moving other larger files in that bucket to  archive.org for now (and will add them to my supported  Causes).\n Long term, I won’t want to store files in multiple places. I don’t feel like archive.org should be my site’s dumping ground since it can turn a profit if it gets popular. archive.org is a stop-gap for two files for the time being. But, I could do some cleanup of that bucket now that I have proper logging enabled (oh and AWS Budget Alerts). I will also be researching user-friendly alternatives to Cloudflare even if it will cost me a few bucks a month. I will also never co-mingle work and personal file sharing EVER again.\n In the end, AWS did refund all but about $40 of the $2,657.68 original bill. I wonder if I had been with any other provider (CDN included) if I had gotten a refund at all. I suspect smaller vendors wouldn’t have been as forgiving, especially given the global economic climate.", "posttime": "2020-07-26 22:20:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "法案,aws,cloudflare", "title": "令人惊讶的AWS法案传遍了世界各地", "title_en": "The Surprise AWS Bill Heard Far and Wide", "transed": 1, "url": "https://chrisshort.net/the-aws-bill-heard-around-the-world/", "via": "", "real_tags": ["法案", "aws"]}, {"category": "", "categoryclass": "", "imagename": "b39f53bc83843e3e911a3a8901f17b96.jpeg", "infoid": 1014271, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个存储库的目的是收集令人敬畏的自述，世界各地的开发人员都在他们自己的个人资料中使用这些自述ME来作为对其他人的灵感。\n如果你觉得它超级棒，请随意添加你自己或其他人的个人资料自述文件！", "note_en": "The aim of this repository is to collect awesome READMEs that developers around the world are using on their own profiles to act as an inspiration for others.\n Feel free to add your own or someone else&#39;s profile README if you find it super awesome!", "posttime": "2020-07-26 22:20:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "github,自述文件,readme,自述", "title": "GitHub自述文件模板", "title_en": "GitHub Readme Templates", "transed": 1, "url": "https://github.com/kautukkundan/Awesome-Profile-README-templates", "via": "", "real_tags": ["github", "自述文件", "readme", "自述"]}]