[{"category": "", "categoryclass": "", "imagename": "9c3c7938b896622a50428f005ad6fc93.jpg", "infoid": 1001675, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "ProPublica是一个调查滥用权力的非营利性新闻编辑室。注册后即可收到我们最重要的新闻。\n这篇文章是与总部设在俄亥俄州扬斯敦的“商业杂志”合作撰写的，后者是ProPublica地方报道网络的成员。\n2016年11月一个反常温暖的早晨，扬斯敦的商界和政界领袖挤在这座俄亥俄州城市长期受苦的东区一小块杂乱无章的土地上。在几十年的衰落中摇摇欲坠，这个地区是坑坑洼洼的街道，杂草丛生的地块，腐烂的房屋和免下车的酒类市场。\n但在这一天，这座曾经是全国钢铁制造中心，现在是工业衰落的典范的城市，正在庆祝一项新事业的破土动工：世界上第一个自我冷却的饮料罐：冰镇罐头。总部位于加州的饮料公司约瑟夫国际公司(Joseph Co.International)曾承诺投资2000万美元建立一个研发和制造园区，并创造数百个新的就业机会。它的座右铭是：“冰河时代结束了！”\n身穿深色西装，打着粉色领带的公司董事长兼首席执行官米切尔·约瑟夫(Mitchell Joseph)对100多名朋友、家人和市政府官员发表讲话时笑容满面。他说，他的曾祖父于20世纪初在这里创立了星空瓶装公司，之后该公司于1971年关门。\n“这是我们的圣地，”约瑟夫说。能够在几乎100年后在同样的物业上回归，并采用饮料行业的革命性技术，并将其带回扬斯敦，对我们来说是非常令人欣慰的。“。\n时任市长约翰·麦克纳利(John McNally)和扬斯敦州立大学(Young Gstown State University)校长吉姆·特雷塞尔(Jim Tressel)在约瑟夫将铲子开进莱恩大道(Lane Avenue)沿线的一块草皮时鼓掌，并正式启动了一个项目，官员们表示，该项目将每年生产10亿罐。约瑟夫宣布：“我们将为波士顿、佛罗里达、达拉斯提供一切服务。”", "note_en": "ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive  our biggest stories as soon as they’re published.\n  This article was produced in partnership with The Business Journal, based in Youngstown, Ohio, which is a member of the  ProPublica Local Reporting Network.\n  On an unseasonably warm November morning in 2016, Youngstown’s business and political leaders crowded onto a small, scraggly plot of land on the Ohio city’s long-suffering East Side. Reeling from decades of decline, the area was a patchwork of potholed streets, weeded lots, moldering homes and drive-thru liquor marts.\n  But on this day, the city, once a national center of steel manufacturing and now a poster child for industrial decay, was celebrating the groundbreaking of a new venture: Chill-Can, the world’s first self-chilling beverage can. Joseph Co. International, a California-based beverage company, had pledged to build a $20 million research and manufacturing campus and create hundreds of new jobs. Its motto: “The Ice Age Is Over!”\n  Dressed in a dark suit and pink tie, Mitchell Joseph, the firm’s chairman and CEO, beamed as he addressed more than 100 friends, family members and city officials. His great-grandfather, he said, had founded the Star Bottling Co. on the site at the turn of the 20th century, before it closed shop in 1971.\n  “It’s sacred ground to us,” Joseph said. “To be able to come back after almost 100 years on the same exact property and take technology that is revolutionary in the beverage industry and bring it back to Youngstown is very gratifying to us.”\n  Then-Mayor John McNally and Youngstown State University President Jim Tressel applauded as Joseph drove a shovel into a patch of turf along Lane Avenue and officially kick-started a project that officials said would manufacture 1 billion cans a year. “We’ll service everything up to Boston, down to Florida, out to Dallas,” Joseph proclaimed.", "posttime": "2020-05-12 01:06:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,铁锈", "title": "挣扎的铁锈带城市将复兴寄托在一个自冷的饮料罐上", "title_en": "A Struggling Rust Belt City Pinned Its Revival on a Self-Chilling Beverage Can", "transed": 1, "url": "https://www.propublica.org/article/youngstown-chill-can", "via": "", "real_tags": ["rust", "铁锈"]}, {"category": "", "categoryclass": "", "imagename": "47251e5ac8880b853c679e85d77464ca.jpeg", "infoid": 1001674, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从周一开始，340万名高中生将坐在书桌前-以及在汽车里、卧室地板上和任何他们能找到安静的地方-参加高级选修考试，希望能证明他们掌握了一系列学术科目。\n这些测试看起来将与过去几年大不相同，因为冠状病毒大流行已经关闭了高中，并促使运行高级预修课程的大学委员会争先恐后地创建一种新的考试形式。\n..。", "note_en": "Beginning Monday, 3.4 million high school students will sit down at desks—and in cars, on bedroom floors and anywhere they can find some quiet—and take Advanced Placement exams with the hopes of proving mastery of a range of academic subjects.\n  The tests will look much different than in years past, as the coronavirus pandemic has closed high schools and sent the College Board, which runs the Advanced Placement program, scrambling to create a new format.\n...", "posttime": "2020-05-12 00:52:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "coronavirus,冠状病毒,病毒,时代,考试", "title": "冠状病毒时代的美联社考试：在线，时长只有15到45分钟", "title_en": "A.P. Exams in the Coronavirus Era: Online, and Just 15 To 45 Minutes Long", "transed": 1, "url": "https://www.wsj.com/articles/a-p-exams-in-the-coronavirus-era-online-and-just-15-to-45-minutes-long-11589208916", "via": "", "real_tags": ["冠状病毒", "病毒", "时代", "考试"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001673, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "通过@stripestatus推特馈送提供的更新-请关注我们的网站！", "note_en": "Updates provided via the  @stripestatus Twitter feed—follow us there!", "posttime": "2020-05-12 00:52:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "条带,stripe,关注", "title": "条带的API已关闭", "title_en": "Stripe's API Is Down", "transed": 1, "url": "http://status.stripe.com?down=now", "via": "", "real_tags": ["条带", "stripe", "关注"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001672, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "推荐附件：USB电缆，引脚24x1(2)，8MB pSRAM，USB主机电缆Teensy 4.1在2.4 x 0.7英寸的外形中具有最快的微控制器和扩展的强大外围设备集。\nTeensy 4.1的设计目的是将所有通用I/O引脚带到外部边缘上。要使用以太网端口，需要连接磁极插孔和电容器。目前这只是一个使用OSH公园共享电路板的DIY项目。PJRC计划在不久的将来将其作为DIY工具包提供。建议使用这些部件来构建以太网连接。1个以太网Magjack RB1-125BAG1A，Mouser950-RB1-125BAG1A，Digikey1278-1011-ND2接头，3x2，2 mm间距Digikey1849-1000-ND2插槽，3x2，2 mm间距Amhenon FCI 89361-706LF，Digikey609-3139-ND1带状电缆，3至6英寸Digikey HF06S-5-ND1电容器，0.1。\nTeensy 4.1的底部有焊接2个内存芯片的位置。较小的位置用于放置pSRAM芯片。较长的位置用于闪存。Teensy 4.1&#39；的USB主机端口允许您连接USB设备，如键盘和MIDI乐器。需要5针接头和USB主机电缆才能插入USB设备。如果需要多个设备，则可以使用USB集线器。有关详细信息，请参阅USBHost_t36示例。", "note_en": "Recommended Accessories: USB Cable, Pins 24x1 (2), 8MB PSRAM, USB Host Cable Teensy 4.1 features the fastest micocontroller and an expanded set ofpowerful peripherals in a 2.4 by 0.7 inch form factor.\n Teensy 4.1 is designed to bring all general purpose I/O pins tobreadboard friendly pads on the outside edges. To use the Ethernet port, a magjack and capacitor need to be connected. This is currently available only as a DIY project using this OSH Park Shared Circuit Board.PJRC is planning to offer this as a DIY kit in the near future. These parts are recommended to build the Ethenet connection. 1 Ethernet Magjack RB1-125BAG1A,  Mouser 950-RB1-125BAG1A,  Digikey 1278-1011-ND2 Header, 3x2, 2mm pitch  Digikey 1849-1000-ND2 Socket, 3x2, 2mm pitch Amphenol FCI 89361-706LF,  Digikey 609-3139-ND1 Ribbon Cable, 3 to 6 inch  Digikey HF06S-5-ND1 Capacitor, 0.1uF, 8051 Capacitor, 1uF, 805 probably not needed1 Capacitor, 1nF, 805 optional, should be high voltage rated if used1 Resistor, 1M optional1 Circuit Board  OSH Park Shared PCB\n The bottom side of Teensy 4.1 has locations to solder 2 memory chips.  The smaller location is meant for a  PSRAM chip. Thelarger location is intended for flash memory. Teensy 4.1&#39;s USB Host port allow you to connect USB devices, like keyboardsand MIDI musical instruments. A 5 pin header and a USB Host cable are needed tobe able to plug in a USB device. USB hubs may be used if more than 1 device is needed. See the USBHost_t36examples for details.", "posttime": "2020-05-12 00:51:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,mb,ethernet,usb", "title": "Teensy 4.1发布：100 Mbps以太网、高速USB、8 MB闪存", "title_en": "Teensy 4.1 Released: 100 Mbps Ethernet, High-Speed USB, 8 MB Flash", "transed": 1, "url": "https://www.pjrc.com/store/teensy41.html", "via": "", "real_tags": ["发布", "mb", "ethernet", "usb"]}, {"category": "", "categoryclass": "", "imagename": "1f3b45f848a35b2102c615aea9f0e239.jpg", "infoid": 1001671, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欧洲地区区域互联网注册中心(RIPE NCC)正在举行选举，以填补其执行董事会的三个席位。选举将于2020年5月13日至15日在RIPE NCC的年度股东大会上举行，结果将于5月15日上午10点45分现场直播。\n在成熟的NCC执行董事会三个空缺席位的候选人中，经营着一家名为Netstyle的网络公司的埃拉德·科恩(Elad Cohen)就是其中之一。\n互联网调查员Ron Guilmette将Netstyle和科恩的电子邮件地址与南非互联网协议地址空间中的可疑活动联系起来。这包括属于Sasol的IP地址块，以及似乎属于Tredcor、AfrOx、Woolworths和SITA的块。\n区域互联网注册机构，如RIPE网络协调中心，向其服务区域内的成员提供互联网资源。这些资源包括网际协议(IP)地址。\n在几个月的时间里，MyBroadband与Guilmette合作调查了大量有价值的互联网协议(IP)地址被明显窃取和占用的事件。\n调查的一部分揭露了非洲地区互联网注册中心(AFRINIC)的一名内部人员如何从AFRINIC的空闲地址池中挪用大量IP地址块。\n此空闲池是AFRINIC托管的IP地址空间，用于根据其规则向合法有资格获得IP地址空间的个人或组织发放。\nAFRINIC内部至少有一个人自己拿到了这些未分配的IP地址，并在黑市上出售。\n自从我们的报告发表以来，AFRINIC立即解雇了有问题的内部人士，并收回了从其空闲池中拿走的IP地址块。\n我们调查的另一部分涉及称为“传统”IP地址块的地址分配。\n这些地址块特别有价值，因为它们不会收取AFRINIC的年费，因为在AFRINIC出现之前，它们被分配给互联网早期的公司。\n在梳理非洲的IP地址空间时，Guilmette发现Cohen的Netstyle电子邮件地址([电子邮件受保护])出现在以下IP地址块的Internet路由注册表(IRR)记录中：\n当被问及Infoplan、AECI、Sasol、Tredcor和Wooltru区块时，科恩表示，他们(Netstyle)是所有这些区块的所有者，除了Sasol区块。他还说，他后悔曾经买过它们。\n科恩说，他通过一家美国经纪人为这些区块支付了数百万美元，但没有说明他使用的是哪家经纪人。\n当被问及有关购买的法律文件时，他说：“法律文件与相关的美国律师在一起，我们将在任何法庭上出示。”\n科恩拒绝回答为什么他的电子邮件地址会出现在萨索尔回收的一块IP地址的IRR记录中。\n下表总结了Guilmette调查认定为“被盗”的所有遗留IP地址块。\n在这种情况下，Guilmette选择使用“被盗”一词，专门指存储在AFRINIC数据库中的IP地址块的WHOIS记录被以可疑方式操纵的情况。\n这包括姓名、地址和联系方式的改变，吉尔梅特称这种方式“明显是假的”。\n世界卫生组织的记录就像互联网的地契。如果一个不好的演员能够找到操纵IP地址块的WHOIS记录的方法，就像能够闯入地契办公室，改变贵重房产的地契信息一样。\nAFRINIC尚未回答有关如何对这些传统IP地址块进行更改的问题。\n在更新下表中的信息时，Netstyle和Cohen连接到了其他几个块。\nNetstyle当前路由的IP地址是属于附属计算服务公司(160.116.0.0/16)的地址块的一部分。\n已使用电子邮件地址“[EMAIL_PROTECTED]”将IRR对象添加到属于Safren Computer Services的块的AFRINIC数据库中。该条目最后一次修改是在2020年1月26日。MyBroadband之前公布的文件将科恩与“Afri Holdings Ltd”的名字联系起来。\n类似地，在RADb数据库中使用“[Email.Protected]”地址为Agrihold添加了一个IRR对象。该条目最后一次修改是在2020年1月3日。\nIP地址块的估计值是使用1美元兑18.79兰特和每个IP地址20美元的汇率计算的。这一价格是基于业内消息人士的反馈，他们表示，20美元的平均价格是合理的，但价格可能会更高，也可能更低，具体取决于情况。\n\n科恩是争夺成熟的NCC执行董事会三个空缺席位的九名候选人之一。他提名了自己，并获得了第二高的支持提名。\n支持提名排名前五的候选人是谢尔盖·迈索多夫(35)，埃拉德·科恩(16)，雷蒙德·杰滕(16)，乔迪·佩莱特·马丁内斯(13)和威廉·西尔维斯特(11)。\n应该注意的是，此排名仅供参考。支持提名不一定决定哪些候选人将当选。\nGuilmette已将Maikel Uerling与南非传统IP地址块上的可疑活动联系起来，这一点在MyBroadband的早些时候的一份报告中发表。\n网络专用SAS、Novogara和FiberXpress都在上表中列出的一个或多个被盗IP地址块中通告路由，包括连接到Netstyle和Cohen的IP地址块。\n这意味着它们接受发往Guilmette认定为被盗的IP地址的网络流量。\n一个例子是Infoplan块(196.16.0.0/14)，其中Cohen的Netstyle电子邮件地址列在Internet Routing Registry条目中。网络专用SAS、Novogara和FiberXpress都为Infoplan块中包含的IP地址子分配通告路由。\n埃拉德·科恩(Elad Cohen)被要求就他加入RIPE NCC执行董事会的活动发表评论。他拒绝回答问题。\n必须指出的是，科恩在本报告中没有受到任何非法活动的指控。\nMyBroadband还向RIPE NCC询问了科恩的执行董事会候选人资格。该组织证实，它知道针对他的指控。\n“成熟的NCC是根据荷兰法律成立的会员协会。根据我们的规定，任何人都可以被支持作为执行局选举的候选人，“该组织的一位发言人表示。\n“每个成员都有权提名(并且)每个成员只能支持一个被提名人一次。”", "note_en": "The Regional Internet Registry for the European region, RIPE NCC, is holding elections to fill three seats on its executive board. The elections will be held at RIPE NCC’s annual general meeting on 13-15 May 2020, with the results live streamed at 10:45 on 15 May.\n Among the candidates for the three seats available on the RIPE NCC Executive Board is Elad Cohen, who operates a networking company called Netstyle.\n Internet investigator Ron Guilmette has linked Netstyle and Cohen’s e-mail address to   suspicious activity in the South African Internet Protocol address space. This included a block of IP addresses that belongs to Sasol, and blocks which appear to belong to Tredcor, Afrox, Woolworths, and SITA.\n Regional Internet Registries, like the RIPE Network Coordination Centre, provide Internet resources to their members in their service region. These resources include Internet Protocol (IP) addresses.\n  Over several months, MyBroadband worked with Guilmette to look into the apparent theft of, and squatting on, vast swaths of valuable Internet Protocol (IP) addresses.\n One portion of the investigation uncovered how an insider at Africa’s Regional Internet Registry, AFRINIC,   misappropriated large IP address blocks from AFRINIC’s free pool of addresses.\n This free pool is the IP address space that AFRINIC holds in trust to give out to people or organisations that legitimately qualify to receive IP address space under its rules.\n At least one person inside AFRINIC helped themselves to these unassigned IP addresses and sold them on the black market.\n Since publishing our report, AFRINIC has summarily dismissed the insider in question and has   taken back the IP address blocks that were taken from its free pool.\n  Another part of our investigation involved address assignments referred to as “legacy” IP address blocks.\n These blocks of addresses are particularly valuable because they do not attract AFRINIC’s annual fees, as they were assigned to companies in the early days of the Internet, before AFRINIC existed.\n While combing through Africa’s IP address space, Guilmette discovered that Cohen’s Netstyle e-mail address (  [email protected]) appeared in the Internet Routing Registry (IRR) records for the following IP address blocks:\n  When queried about the Infoplan, AECI, Sasol, Tredcor, and Wooltru blocks, Cohen stated that they (Netstyle) are the owners of all of those ranges, except the Sasol block. He also said that he regrets ever buying them.\n Cohen said he paid millions of US dollars for the blocks via a US-based broker, but did not state which broker he used.\n When asked for the legal documentation regarding the purchases, he said: “The legal documents are with the USA lawyer involved, we will show them in any court.”\n Cohen declined to answer questions about why his e-mail address appeared in an IRR record for a block of IP addresses which Sasol has reclaimed.\n  The table below summarises all of the legacy IP address blocks which Guilmette’s investigation identified as “stolen”.\n In this context, Guilmette chose to use the term “stolen” to specifically refer to a situation where the WHOIS records of an IP address block, stored in AFRINIC’s database, had been manipulated in a suspicious way.\n This includes names, addresses, and contact information being changed in ways which Guilmette described as “obviously fake”.\n WHOIS records are like the title deeds of the Internet. If a bad actor can find a way to manipulate the WHOIS record of an IP address block, it would be like being able to break into the deeds office and change the information on the title deeds of valuable property.\n AFRINIC has yet to answer questions on how the changes to these legacy IP address blocks were made.\n While updating the information in the table below, Netstyle and Cohen were connected to a few other blocks.\n Netstyle is currently routing IP addresses that are part of a block which belonged to a company called Affiliated Computing Services (160.116.0.0/16).\n An IRR object was added to the AFRINIC database for the block belonging to Safren Computer Services using the e-mail address “ [email protected]”. The entry was last modified on 26 January 2020. Documents   previously published by MyBroadband link Cohen to the name “Afri Holdings Ltd”.\n Similarly, an IRR object was added for Agrihold in the RADb database using the “ [email protected]” address. The entry was last modified on 3 January 2020.\n The estimated value of a block of IP addresses was calculated using an exchange rate of R18.79 per USD and a price of $20 per IP address. The price is based on feedback from industry sources who have indicated that $20 is a reasonable average to work with, but that prices can be higher or lower depending on circumstances.\n \n  Cohen is one of   nine candidates contending for the three available seats on the RIPE NCC Executive Board. He nominated himself and he is also tied for the second-highest number of support nominations received.\n The top five candidates by   support nominations received are Sergey Myasoedov (35), Elad Cohen (16), Raymond Jetten (16), Jordi Palet Martinez (13), and William Sylvester (11).\n It should be noted that this ranking is given for interest only. Support nominations do not necessarily determine which candidates will be voted in.\n    Guilmette has connected Maikel Uerlings to suspicious activity on South African legacy IP address blocks, as published in   an earlier report on MyBroadband.\n Network Dedicated SAS, Novogara, and FiberXpress all advertise routes in one or more of the stolen IP address blocks listed in the table above, including ones connected to Netstyle and Cohen.\n This means that they accept network traffic destined for IP addresses which Guilmette has identified as stolen.\n One example is the Infoplan block (196.16.0.0/14), where Cohen’s Netstyle e-mail address is listed in the Internet Routing Registry entry. Network Dedicated SAS, Novogara, and FiberXpress all advertise routes for IP address sub-allocations contained in the Infoplan block.\n  Elad Cohen was asked for comment regarding his campaign to join the RIPE NCC Executive Board. He declined to answer questions.\n It must be noted that Cohen is not being accused of any illegal activity in this report.\n  MyBroadband also asked RIPE NCC about Cohen’s candidacy for the Executive Board. The organisation confirmed that it was aware of the allegations against him.\n “The RIPE NCC is a membership association under Dutch law. According to our rules, anyone can be supported as a candidate for the Executive Board elections,” a spokesperson for the organisation stated.\n “Each member is entitled to make nominations [and] each member can support a nominee only once.”", "posttime": "2020-05-12 00:34:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "组织,ip,地址", "title": "连接到IP地址抢劫案的MAN正在竞选欧洲知识产权组织的职位", "title_en": "Man connected to IP address heist running for position at European IP org", "transed": 1, "url": "https://mybroadband.co.za/news/internet/350973-man-connected-to-african-ip-address-heist-running-for-board-position-at-european-ip-address-organisation.html", "via": "", "real_tags": ["组织", "ip", "地址"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001670, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新的环境变量支持：内置对.env和NEXT_PUBLIC_PREFIX的支持，如CRA中所示。\n改进的内置获取支持：对于Node.js和所有浏览器(构建和运行时)，放弃节点获取和同构获取导入，转而使用内置获取多边形填充。\n集成的Web Vitals报告：捕获推动灯塔得分的指标，但要从您的实际流量中获取。\n快速刷新是一种全新的热重新加载体验，可为您提供对Reaction组件所做编辑的即时反馈。现在，对于Next.js 9.4或更高版本上的所有项目，它现在都是默认启用的。\n热重新加载已经存在很长一段时间了，但从历史上看，它太脆弱了，无法在您的工作流中默认启用。正因为如此，Next.js以前实现了一种粗略的热重新加载形式，它将重置应用程序的整个状态。\n旧的热重新加载实现对编译或运行时错误没有弹性，如果您在编辑CSS或JavaScript时输入错误，则会执行应用程序的完全重新加载。这不是最优的，打乱了你的思路。\nFAST Refresh深度集成到Reaction本身(通过Reaction Refresh)，允许Next.js对Reaction组件树执行可预测的精确更新。\n这意味着Next.js将只更新您编辑的文件中的代码，并且只重新呈现该组件，而不会丢失组件状态。这包括样式(内联、CSS-in-JS或CSS/Sass模块)、标记、事件处理程序和效果(通过useEffect)。\n作为这次体验的一部分，我们完全重新设计了错误覆盖，以使其更有帮助，并使您的应用程序对打字错误或运行时错误具有弹性。这包括但不限于：\n准确的错误位置，在编译前解析到代码的原始行和列。\njs在9.3中引入了静态站点生成方法，目标很明确：我们应该获得静态(始终快速、始终在线、全球分布)的好处，但要出色地支持动态数据，这正是Next.js所熟知的。\n为了两全其美，Next.js支持增量静态生成，即在构建站点后更新静态内容。例如，在9.3中，我们在getStaticPath中引入了Fallback：true选项，它允许您在运行时添加新页面。\n我们最近整理了一个示例，展示了Next.js如何以这种方式静态预呈现无限数量的页面：\n今天，我们还引入了增量静态再生(Beta)，这是一种更新现有页面的机制，当流量传入时，通过在后台重新呈现它们。受过时而重新验证的启发，这确保了流量始终以静态方式不间断地提供服务，并且只有在新构建的页面完成生成之后才会将其推送。\n导出异步函数getStaticProps(){return{props：await getDataFromCMS()，//我们将尝试重新生成页面：//-当请求传入时//-最多每秒一次STRISTH_REVALIDATE：1}}。\n页面永远不会脱机。如果后台页重新生成失败，则旧页保持不变。\nNext Start和Vercel edge平台都已经完全支持增量功能(添加页面和延迟更新页面)和预览模式。\n接下来，我们将开发补充RFC，以解决两个额外的增量静态生成功能：\n一次重新生成多个页面并使其无效(如您的博客索引和某个博客帖子)。\n在我们宣布下一代静态站点生成之后，我们想要分享从Headless CMS API获取内容并将其呈现为Next.js HTML的真实场景。\n我们与世界上一些最好的CMS系统的创建者合作：Conentful、DatoCMS、棱镜、SANISH和TakeShape，还有更多的系统正在开发中。\n这些示例不仅可以随时使用并获得100%开源和麻省理工学院的许可，而且它们还结合了可用的最佳实践：\n我们还与TinaCMS在CMS的一个令人兴奋的新方向上进行了合作：内容的页面内编辑。请查看他们的指南，了解如何为您的项目实施它。\n我们从使用Next.js的公司得到的一个常见反馈是，不清楚环境变量何时内联到浏览器包中，以及何时仅在Node.js环境中可用。\n第一种方法是向浏览器公开环境变量，您可以在环境变量前面加上NEXT_PUBLIC_。当使用该环境变量时，它将内联到浏览器JavaScript包中。\n您不再需要添加next.config.js和env键来公开这些变量。\n//Pages/index.js//环境变量将向浏览器公开。记录(&#39；我的应用程序版本&#39；，进程。环境。NEXT_PUBLIC_VERSION)导出默认函数(){返回Hello World}。\n第二个更改是Next.js现在默认支持.env加载。允许您轻松定义开发和生产环境变量。\n在Next.js 9.1.7中，我们宣布在浏览器中对FETCH()API进行多层填充。现在，这种多层填充也扩展到了Node.js环境。\n实际上，您不再需要使用任何类型的服务器端FETCH PolyFill(例如，同构-取消获取或节点-获取)，因为Next.js将在所有环境中自动提供FETCH()。\n导出异步函数getStaticProps(){//不再需要从同构导入FETCH-UNFETCH常量res=AWAIT FETCH(&#39；https://./posts&#39；)常量POST=AWAIT RES。json()return{props：{post}函数({post}){//呈现帖子.。}导出默认值。\n上周，谷歌Chrome团队推出了Core Web Vitals。核心网络活力是在网络上传递伟大用户体验的关键质量信号，著名的灯塔报告就是建立在这个基础上的。\n如果您希望您的网站或Web应用程序尽可能快，那么跟踪这些指标是非常有用的，这也是Next.js的核心目标之一。\nChrome团队发布了一个Core Web Vitals Chrome扩展，它允许您作为开发人员获得页面执行情况的可视反馈。\n在构建生产Web应用程序时，您还希望了解您的站点对访问者和(潜在)客户的表现如何。您甚至可能希望跟踪这些度量随时间的改进或倒退，以查看您的更改是否对您的受众产生了预期的影响。\n为了帮助向您的分析服务报告Core Web Vitals，我们与Google合作引入了一种名为reportWebVitals的新方法，可以从Pages/_app.js中导出：\n//将为每个必须报告的指标调用一次。导出函数报告WebVitals(指标){//这些指标可以发送到任何分析服务。log(公制)}函数({，pageProps}){return}导出默认值。\n要将此方法与您的分析服务结合使用，请参阅文档的将结果发送到分析部分。如果您想了解更多关于核心Web Vitals的信息，可以参考web.dev/vitals。\n如果您正在处理一个大型项目，您的一些导入语句可能会受到../意大利面的影响：\n在这种情况下，我们应该使用绝对进口，而不是相对进口。假设Components目录位于根目录，我们希望import语句如下所示：\n我们很高兴地宣布，Next.js9.4使得设置JavaScript和TypeScript项目的绝对导入变得超级简单。您只需将baseUrl配置添加到jsconfig.json(JS项目)或tsconfig.json(TS项目)。\n这将允许从的绝对导入。(根目录)。它还与VSCode和其他编辑器集成，支持代码导航和其他编辑器功能。\n注意：如果您之前修改了webpack模块别名配置以启用绝对导入，则现在可以删除该配置。\n此外，Next.js9.4还支持路径选项，该选项允许您创建自定义模块别名。例如，以下代码允许您使用@/design-system而不是Components/design-system：\n如果指定路径，则必须指定baseUrl。您可以在TypeScript文档中了解有关路径选项的更多信息。\n当在Next.js9.3中启动内置的Sass支持时，我们得到的反馈是一部分用户想要配置Sass编译器。例如，要配置include dePath，请执行以下操作。\n我们重新设计了命令行输出，使其更加一致，输出的重复数据(如部署URL)更少，需要等待开发服务器启动等等。我们还更改了消息类型的间距，使其在消息之间保持一致，这意味着它们不再从一行跳到另一行。\n加入有关GitHub讨论的Next.js社区。讨论是一个社区空间，允许您与其他Next.js用户联系并提出问题。\n如果您使用的是Next.js，请随意与社区共享您的项目URL。\n我们感谢我们的社区和所有外部反馈和贡献，这些反馈和贡献帮助塑造了这个版本。", "note_en": "New Environment Variables Support: built-in support for  .env and a  NEXT_PUBLIC_ prefix, as seen in CRA\n Improved Built-in Fetch Support: ditch your  node-fetch and  isomorphic-fetch imports in favor of a built-in  fetch polyfill, for Node.js and all browsers (build and runtime)\n Integrated Web Vitals Reporting: capture the  metrics that drive Lighthouse scores, but from your real traffic\n  Fast Refresh is a new hot reloading experience that gives you instantaneous feedback on edits made to your React components. It is now  enabled by default for all projects on Next.js 9.4 or newer.\n Hot reloading has  existed for a long time but has  historically been  too fragile to enable by default in your workflow. Because of this, Next.js previously implemented a coarse form of hot reloading that would reset the entire state of your application.\n The old hot reloading implementation was not resilient to compilation or runtime errors and would perform a full reload of your application if you made a typo while editing your CSS or JavaScript. This was suboptimal and interrupted your train of thought.\n Fast Refresh deeply integrates into React itself ( via React Refresh), allowing Next.js to perform predictable precision updates to your React component tree.\n This means Next.js will only update code in the file you edited, and only re-render that component,  without losing component state. This includes styles (inline, CSS-in-JS, or CSS/Sass Modules), markup, event handlers, and effects (via  useEffect).\n  As part of this experience, we completely redesigned the error overlay to be more helpful and to make your application resilient to typos or runtime errors. This includes, but is not limited to:\n Accurate error locations, resolved to the  original line and column of your code, before compilation\n  Next.js introduced Static Site Generation methods in 9.3 with a clear goal in mind: we should get  the benefits of static (always fast, always online,  globally distributed), but with excellent support for dynamic data, which Next.js is known for.\n To get the best of both worlds, Next.js supports  Incremental Static Generation, updating static content after you have already built your site. For example, in 9.3 we’ve introduced the  fallback: true option in  getStaticPaths, which allows you to add  new pages at runtime.\n We recently put together an example showcasing how Next.js can statically pre-render an infinite number of pages this way:\n  Today, we are also introducing  Incremental Static Regeneration (beta), which is a mechanism to  update existing pages, by re-rendering them in the background as traffic comes in. Inspired by  stale-while-revalidate, this ensures traffic is served uninterrupted, always statically, and the newly built page is pushed only after it&#39;s done generating.\n export  async  function  getStaticProps ( )  {  return  { props :  await  getDataFromCMS ( ) ,  // we will attempt to re-generate the page:  // - when a request comes in  // - at most once every second unstable_revalidate :  1  } }\n  Pages never go offline. If the background page re-generation fails, the old page remains unaltered.\n Both incremental features (adding pages and lazily updating them), as well as  preview mode, are already fully supported by both  next start and the  Vercel edge platform out of the box.\n Up next, we will be working on a supplemental RFC to address two additional incremental static generation capabilities:\n Re-generating and invalidating multiple pages at once (like your blog index and a certain blog post)\n  On the heels of our announcement of  next-gen static site generation, we wanted to share real-world scenarios of fetching content from Headless CMS APIs and rendering it as Next.js HTML.\n We partnered with the creators of some of the best CMS systems in the world:  Contentful,  DatoCMS,  Prismic,  Sanity, and  TakeShape, with more on the way.\n  These examples are not only ready to be used and 100% open source and MIT licensed, but they incorporate the best practices available:\n   We also have collaborated with TinaCMS on an exciting new direction for CMS:  in-page editing of content.  Check out their guide to learn how to implement it for your project.\n  A common piece of feedback that we got from companies using Next.js is that it was unclear when an environment variable is inlined into the browser bundle and when it is only available in the Node.js environment.\n  The first is to expose an environment variable to the browser you can prefix the environment variable with  NEXT_PUBLIC_. When that environment variable is used it will then be inlined into the browser JavaScript bundle.\n You no longer have to add a  next.config.js and add the  env key to expose these variables.\n // pages/index.js // The environment variable will be exposed to the browser  . log ( &#39;My Application Version&#39; , process . env . NEXT_PUBLIC_VERSION ) export  default  function    ( )  {  return   Hello World  }\n The second change is that Next.js now supports  .env loading by default. Allowing you to easily define development and production environment variables.\n     In  Next.js 9.1.7 we announced polyfilling of the   fetch() API in the browser. Today this polyfilling has been extended to the Node.js environment too.\n In practice, you no longer have to use any type of server-side fetch polyfill (for example  isomorphic-unfetch or  node-fetch) as Next.js will automatically provide  fetch() in all environments.\n  export  async  function  getStaticProps ( )  {  // fetch no longer needs to be imported from isomorphic-unfetch  const res  =  await  fetch ( &#39;https://.../posts&#39; )  const posts  =  await res . json ( )  return  { props :  { posts  }  } } function    (  { posts  } )  {  // Render posts... } export  default\n  Last week the Google Chrome team introduced  Core Web Vitals. Core Web Vitals are the quality signals key to delivering great UX on the web, on top of which the  famous Lighthouse reports are built.\n Keeping track of these metrics is extremely useful if you want your website or web application to be as fast as possible, which is one of the core goals of Next.js.\n  The Chrome team has released a  Core Web Vitals Chrome extension that allows you as a developer to get visual feedback on how your pages are performing.\n When building production web applications you also want to know how your site is performing for your visitors and (potential) customers. You might even want to track the improvement or regression of these metrics over time in order to see if your changes have the intended impact on your audience.\n In order to aid reporting Core Web Vitals to your analytics service we have introduced,  in collaboration with Google, a new method called  reportWebVitals which can be exported from  pages/_app.js:\n // Will be called once for every metric that has to be reported. export  function  reportWebVitals ( metric )  {  // These metrics can be sent to any analytics service   . log (metric ) } function    (  {   , pageProps  } )  {  return   } export  default\n To use this method in combination with your analytics service refer to the  &#34;Sending result to Analytics&#34; section of the docs. If you want to learn more about Core Web Vitals you can refer to  web.dev/vitals.\n  If you’re working on a large project, some of your  import statements might suffer from the  ../../../ spaghetti:\n  In such cases, instead of relative imports, we should be using  absolute imports. Assuming that the  components directory exists at the root, we want  import statements to look like:\n  We&#39;re excited to announce that Next.js 9.4 makes setting up absolute imports super simple for both JavaScript and TypeScript projects. All you need to do is to add the  baseUrl config to   jsconfig.json (JS projects) or   tsconfig.json (TS projects).\n  This will allow absolute imports from  . (the root directory). It also integrates with VSCode and other editors, supporting code navigation and other editor features.\n Note: If you’ve previously modified your  Webpack module alias configuration to enable absolute imports, that configuration can now be removed.\n Furthermore, Next.js 9.4 also supports the  paths option, which allows you to create custom module aliases. For example, the following allows you to use  @/design-system instead of  components/design-system:\n    You must specify  baseUrl if you specify  paths. You can learn more about the  paths option  in the TypeScript documentation.\n  When built-in Sass support was launched in  Next.js 9.3 we got the feedback that a subset of users wanted to configure the sass compiler. For example to configure  includePaths.\n    We have redesigned the command line output to be more consistent and output less duplicate data like the deployment URL, waiting on the development server to start and more. We&#39;ve also changed the spacing of the message type to be consistent across messages, meaning they no longer jump from line to line.\n        Join the Next.js community on  GitHub Discussions. Discussions is a community space that allows you to connect with other Next.js users and ask questions.\n If you are using Next.js feel free to  share your project url with the community.\n We are thankful to our community and all the external feedback and contributions that helped shape this release.", "posttime": "2020-05-12 00:19:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "增量,refresh,js", "title": "Next.js 9.4-快速刷新、增量静态再生", "title_en": "Next.js 9.4 – Fast Refresh, Incremental Static Regeneration", "transed": 1, "url": "https://nextjs.org/blog/next-9-4", "via": "", "real_tags": ["增量", "refresh", "js"]}, {"category": "", "categoryclass": "", "imagename": "73c7ea8b77b6b6d909ee91ecd8b0de57.png", "infoid": 1001669, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们刚刚推出了ESLint v7.0.0，这是ESLint的主要版本升级。此版本添加了一些新功能，并修复了前一个版本中发现的几个错误。此版本也有一些突破性的变化，因此请仔细阅读以下内容。\n7.0.0中有几个突破性的更改。我们已经创建了一个迁移指南来解释突破性的更改并描述如何升级。\nNode.js 8在2019年12月达到EOL，我们将在此版本中正式取消对它的支持。\nCORE中的10个Node.js/CommonJS规则已被弃用，并移至eslint-plugin-node插件。\n默认情况下，几个规则已经更新，可以识别Bigint文字并在更多情况下发出警告。\n默认忽略模式已更新。默认情况下，ESLint将不再忽略.eslintrc.js和Bower_component/*。此外，在默认情况下，它现在将忽略嵌套的node_module目录。\n如果在overrides[].files中显式定义了扩展名不是.js的文件，ESLint现在将链接这些文件--不需要使用--ext标志！\nESLint现在支持指令注释中的描述，因此现在可以清楚地记录禁用注释之类的事情！\nRuleTester类中添加了额外的验证，以改进插件中的自定义规则测试。\nESLint现在将解析与入口配置文件相关的插件。这意味着位于项目外部的共享配置文件现在可以与它们所需的插件放在同一位置。\n从ESLintv7开始，分别使用--config path/to/a-config和--Ignore-path path/to/a-Ignore CLI标志传递给ESLint的配置文件和忽略文件将从当前工作目录而不是文件位置解析。这允许用户使用共享插件，而不必将其直接安装到他们的项目中。\nCLIEngine类提供了一个同步API，它阻止了并行链接等功能的实现，在可共享的配置/解析器/插件/格式化程序中支持ES模块，并添加了可视化显示链接运行进度的功能。新的ESLint类提供了一个异步API，ESLint内核现在将使用该API。在可预见的未来，CLIEngine将保留在核心中，但在未来的主要版本中可能会被删除。\n4af06fc中断：RuleTester中具有未知错误属性的测试应失败(#12096)(Milos Djermanovic)。\n8f1020f更新：no-void添加一个选项以允许void作为语句(#12613)(布拉德·扎切尔)。\n29f32db修复：更改隐式文件忽略的错误消息逻辑(修复#12873)(#12878)(斯科特·哈丁)。\nafde78b修复：Curly删除if和Else之间的必要花括号(修复#12928)(#12943)(Milos Djermanovic)。\n691d19a杂务：添加缺少的ecmaVersion2020/11年类型值(#12833)(Piotr Błażejesicz(Peter Blazejesicz))", "note_en": "We just pushed ESLint v7.0.0, which is a major release upgrade of ESLint. This release adds some new features and fixes several bugs found in the previous release. This release also has some breaking changes, so please read the following closely.\n  There are several breaking changes in 7.0.0. We&#39;ve created a  migration guide to explain the breaking changes and describe how to upgrade.\n  Node.js 8 reached EOL in December 2019, and we are officially dropping support for it in this release.\n  The ten Node.js/CommonJS rules in core have been deprecated and moved to the  eslint-plugin-node plugin.\n Several rules have been updated to recognize bigint literals and warn on more cases by default.\n  The default ignore patterns have been updated. ESLint will no longer ignore  .eslintrc.js and  bower_components/* by default. Additionally, it will now ignore nested  node_modules directories by default.\n ESLint will now lint files with extensions other than  .js if they are explicitly defined in  overrides[].files - no need to use the  --ext flag!\n ESLint now supports descriptions in directive comments, so things like disable comments can now be clearly documented!\n Additional validation has been added to the  RuleTester class to improve testing custom rules in plugins.\n ESLint will now resolve plugins relative to the entry configuration file. This means that shared configuration files that are located outside the project can now be colocated with the plugins they require.\n Starting in ESLint v7, configuration files and ignore files passed to ESLint using the --config path/to/a-config and --ignore-path path/to/a-ignore CLI flags, respectively, will resolve from the current working directory rather than the file location. This allows for users to utilize shared plugins without having to install them directly in their project.\n  The  CLIEngine class provides a synchronous API that is blocking the implementation of features such as parallel linting, supporting ES modules in shareable configs/parsers/plugins/formatters, and adding the ability to visually display the progress of linting runs. The new  ESLint class provides an asynchronous API that ESLint core will now using going forward.  CLIEngine will remain in core for the foreseeable future but may be removed in a future major version.\n  4af06fc Breaking: Test with an unknown error property should fail in RuleTester ( #12096) (Milos Djermanovic)\n    8f1020f Update:  no-void add an option to allow void as a statement ( #12613) (Brad Zacher)\n  29f32db Fix: Change error message logic for implicit file ignore (fixes  #12873) ( #12878) (Scott Hardin)\n               afde78b Fix:  curly removes necessary braces between if and else (fixes  #12928) ( #12943) (Milos Djermanovic)\n        691d19a Chore: add missing  ecmaVersion 2020/11 type value ( #12833) (Piotr Błażejewicz (Peter Blazejewicz))", "posttime": "2020-05-12 00:05:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,eslint", "title": "ESLint v7.0.0发布", "title_en": "ESLint v7.0.0 Released", "transed": 1, "url": "https://eslint.org/blog/2020/05/eslint-v7.0.0-released", "via": "", "real_tags": ["发布", "eslint"]}, {"category": "", "categoryclass": "", "imagename": "c8ccc4c50ad2a6dcae4247df965c9cc5.jpg", "infoid": 1001668, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "冠状病毒病-19(COVID19)是由严重急性呼吸综合征冠状病毒2型(SARS-CoV-2)引起的一种新的呼吸系统疾病，具有严重的发病率和死亡率。诊断检测在美国的推出速度很慢，导致许多病例在2020年2月和3月没有进行SARS-CoV-2检测，因此有必要使用血清学检测来确定过去的感染情况。在这里，我们通过检测3个不同的患者群体来评价雅培公司的SARS-CoV-2IgG检测方法对抗SARS-CoV-2IgG抗体的检测。我们检测了在美国SARS-CoV-2传播前收集的1020份血清样本，发现一份假阳性，特异性为99.90%。我们对125例RT-PCR检测SARS-CoV-2阳性的患者进行了检测，其中有689份超额血清样本，发现在症状出现后第17天和PCR阳性后第13天，敏感性均达到100%。在这个队列中，阳性的替代指标值阈值导致了100%的敏感性和100%的特异性。作为粉碎曲线计划的一部分，我们测试了2020年4月在爱达荷州博伊西一周内收集的4856个人，检测到87个阳性，阳性率为1.79%。这些数据表明雅培SARS-CoV-2 IgG检测的出色分析性能，以及病毒在美国西部的有限传播。我们预计，高质量血清学检测的可用性将是抗击SARS-CoV-2的关键工具。", "note_en": "Coronavirus disease-19 (COVID19), the novel respiratory illness caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), is associated with severe morbidity and mortality. The rollout of diagnostic testing in the United States was slow, leading to numerous cases that were not tested for SARS-CoV-2 in February and March 2020, necessitating the use of serological testing to determine past infections. Here, we evaluated the Abbott SARS-CoV-2 IgG test for detection of anti-SARS-CoV-2 IgG antibodies by testing 3 distinct patient populations. We tested 1,020 serum specimens collected prior to SARS-CoV-2 circulation in the United States and found one false positive, indicating a specificity of 99.90%. We tested 125 patients who tested RT-PCR positive for SARS-CoV-2 for which 689 excess serum specimens were available and found sensitivity reached 100% at day 17 after symptom onset and day 13 after PCR positivity. Alternative index value thresholds for positivity resulted in 100% sensitivity and 100% specificity in this cohort. We tested 4,856 individuals from Boise, Idaho collected over one week in April 2020 as part of the Crush the Curve initiative and detected 87 positives for a positivity rate of 1.79%. These data demonstrate excellent analytical performance of the Abbott SARS-CoV-2 IgG test as well as the limited circulation of the virus in the western United States. We expect the availability of high-quality serological testing will be a key tool in the fight against SARS-CoV-2.", "posttime": "2020-05-12 00:04:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "检测,sars", "title": "新的雅培SARS-CoV-2抗体检测具有99.90%的特异性和100%的敏感性", "title_en": "New Abbott SARS-CoV-2 antibody test has 99.90% specificity and 100% sensitivity", "transed": 1, "url": "https://jcm.asm.org/content/early/2020/05/07/JCM.00941-20", "via": "", "real_tags": ["检测", "sars"]}, {"category": "", "categoryclass": "", "imagename": "51d762c59cfc8e1db971248236840e48.jpg", "infoid": 1001667, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "四年前，当乔治奥斯·莫斯奇迪斯还是普林斯顿大学的研究生时，他遇到了一个可能不会成功的问题。他的顾问要求他从数学上证明某种特定的时空结构是不稳定的，换言之，证明对它的任何微小改变最终都会导致时空本身的崩溃。\n他的导师，数学家米哈利斯·达费尔莫斯(Mihalis Dafermos)知道这项任务有多艰巨。Dafermos说：“你可能会花很多时间用头撞墙，但什么也得不到。”Dafermos和古斯塔夫·霍尔泽格尔(Gustav Holzegel)在2006年提出了不稳定猜想。“我认为这是无法证明的。”但他鼓励目前在加州大学伯克利分校(University of California，Berkeley)做博士后的莫奇迪斯无论如何都要看看它。Moschidis已经做了足够多的工作来获得博士学位，所以为什么不尝试一些大的东西呢？\n达费尔莫斯对莫斯奇迪斯的信仰恰到好处。在从2017年开始并持续到今天的一系列进展中，莫斯奇迪斯已经表明，爱因斯坦时空的某种规范配置称为反德西特(ADS)空间是不稳定的。把一点点物质扔进广告空间，最终会出现一个黑洞。\n斯坦福大学数学家Jonathan Luk形容Moschidis的工作“令人惊叹”。…。他发现的是一种相当普遍的不稳定机制“--一种可以应用于其他与广告无关的环境中的机制，在这些环境中，物质或能量被封闭在一个没有逃生口的物理系统中。Dafermos称他以前学生的工作是“壮观的”，“肯定是我在过去几年里在广义相对论数学中看到的最具原创性的东西。”\n尽管我们没有生活在一个反德西特的宇宙中(谢天谢地，因为我们不会存在)，但这项工作也对我们理解从湍流到引力理论和量子力学之间的神秘联系的一切都有影响。\n不稳定性猜想--甚至是它产生的整个思想流派--可以追溯到爱因斯坦的广义相对论方程，该方程准确地阐明了质量和能量是如何影响时空曲率的。在真空中，根本没有物质，时空仍然可以弯曲，引力仍然可以存在，这要归功于真空本身的能量密度，这可以用一个“宇宙常数”来描述。事实证明，空白空间并不是真正的空白。\n爱因斯坦真空方程的三个最简单的解是最对称的--在这些解中，时空的曲率在任何地方都是相同的。在Minkowski时空中，宇宙常数为零，宇宙是完全平坦的。在德锡特时空中，宇宙常数为正值，宇宙的形状就像一个球体。当宇宙学常数为负值时，你会得到ADS时空，它有一个马鞍形。在宇宙学的早期，科学家们想知道这三个时空中的哪一个描述了我们的宇宙。\n另一方面，数学家倾向于怀疑这些时空是否真的、真的是稳定的。也就是说，如果你以任何方式扰乱真空时空--比方说，通过向系统注入一些物质或发出一些引力波--它最终会稳定下来，形成接近原始状态的东西吗？或者它会演变成截然不同的东西吗？这在宇宙中相当于把一块石头扔进池塘：海浪会逐渐减弱，还是会形成海啸？\n1986年，一位数学家证明了de Sitter时空是稳定的。1993年，两位数学家对Minkowski时空做了同样的研究。广告问题花了更长的时间。普遍的共识是，与其他两种配置不同的是，ADS是不稳定的，这意味着数学家将不得不采取一种全新的方法。Dafermos说：“已经开发了很多数学工具来解决稳定性问题。”“但不稳定是一个完全不同的领域--特别是这种类型的不稳定”，它本质上是非线性的，造成了一个本质上复杂的情况，相应地计算起来也很棘手。\nDafermos解释说，研究人员怀疑ADS时空可能是不稳定的，因为他们相信它的边界会是反射的，从而导致它“像一面镜子一样运作，这样任何击中它的波都会回来”。\n新泽西州普林斯顿高等研究院的物理学家胡安·马尔达塞纳(Juan Maldacena)说，“从物理角度看，边界上的反射是有意义的。”这在一定程度上是因为广告空间的曲率，但还有一个更简单的解释：前提是坚持能量守恒原则。\n如果边界实际上是反射的，那么任何东西都不能从广告时空中泄漏出来。因此，放入该系统的任何物质或能量都有可能被集中起来--可能达到形成黑洞的程度。问题是：这真的会发生吗？如果是的话，什么机制会导致物质和能量聚集到这样的程度，而不是保持分散？\nMoschidis想象站在广告时空的中间，这就像站在一个巨大的球里，这个球的边缘或边界是无限的。如果你从那里发出一个光信号，它会在有限的时间内传播出去并到达边界。这种旅行之所以可能是因为众所周知的相对论效应：虽然到边界的空间距离确实是无限的，但对于以光速或接近光速旅行的波或物体来说，时间会变慢。因此，站在ADS时空中间的观察者会看到一条光线在有限的时间内到达边界(尽管需要一些耐心)。\nMoschidis没有使用光线，而是将广义相对论模型中常用的一种物质形式-即所谓的爱因斯坦-弗拉索夫粒子-投放到ADS空间。这些粒子在时空中产生同心的物质波，类似于池塘中出现的水波。\n在物质突然坠入这个时空时产生的许多同心波中，前两个将是最大的。因为它们含有最多的物质和能量，所以我们将重点放在它们身上。第一波-称为波1-将向外扩展，直到它到达边界，反弹，并在向中心撤退时收缩。第二波，也就是第二波，将紧随其后。\n当第一浪从边界反弹并开始向中心收缩时，它将击中仍在扩张的第二浪。Moschidis确定的爱因斯坦方程的一个结果是，在这样的相互作用中，膨胀波(在这种情况下是波2)总是将能量传递给收缩波(波1)。\n在第一浪到达中心后，它将再次开始扩张，与现在正在收缩的第二浪相遇。这一次，第一波将把能量传递给第二波。这个循环可以重复很多很多次。\n莫斯奇迪斯意识到了另一件事：在中心附近，海浪占据的空间更小，它们携带的能量更集中。正因为如此，波在中心附近的相互作用过程中比在边界附近的相互作用过程中交换更多的能量。净结果是，波1给予中心的波2的能量比波2给予边界处的波1的能量多。\n经过无数次迭代，第二波变得越来越大，吸收了第一波的能量。因此，第二波的能量密度继续增加。在某一时刻，当第二波向中心收缩时，它的能量将变得如此集中，以至于将形成一个黑洞。\n这就是不稳定性的证据：莫斯奇迪斯证明，当他在ADS时空中添加哪怕是极少量的物质时，黑洞(或多个黑洞)就会无情地形成。然而，根据定义，ADS时空到处都有均匀的曲率，这意味着它不能容纳像黑洞这样扭曲空间的物体。“如果你扰乱广告时空并等待足够的时间，”莫斯奇迪斯说，“你最终会得到一个不同的几何体--一个包含黑洞的几何体--而它不再是广告。”这就是我们所说的不稳定。“。\nMoschidis最近证明了一种不同类型的物质扰动-所谓的无质量标量场-的不稳定性，在几次学术演讲中展示了这项尚未发表的工作。“因为标量场产生的波是引力波的代表，”Dafermos说，这让Moschidis离最终目标更近了一步-证明了ADS在真正真空中的不稳定性，在真空中，时空完全受到重力的扰动，没有引入任何物质。\nADS时空的不稳定性对我们如何理解我们自己的宇宙有着重大的影响。莫斯奇迪斯说，首先，由于广告时空是不稳定的，它是“你在自然界中看不到的东西”。\n但是“即使广告不是真实的，”他说，“它仍然可以引导我们发现和研究真实的现象。”\n例如，当能量从大尺度集中到小尺度时，就会产生湍流--Moschidis表明，当ADS时空被扰动时，就会发生这种情况。但是湍流是一种普遍存在(且知之甚少)的现象，它出现在各种流体系统中。ADS时空--至少对像Moschidis这样的技能和爱好的人来说--是一个“干净”且相对简单的系统，这就是为什么他认为它是研究湍流的“一个很好的理论试验台”。在ADS的背景下，湍流是由重力引起的，但Moschidis相信他正在开发的数学工具也可以帮助分析流体力学中突然出现的湍流。\nADS也在所谓的ADS/CFT通信中占有突出地位-这是如何将量子力学与引力结合在一个包罗万象的量子引力理论中的关键线索。对应关系表明，ADS空间中的引力系统可以等价于一个少一维的非引力量子系统。马尔达塞纳在1997年发现了这种对应关系，他说：“我们可以用一个不含重力的量子力学系统，用引力理论来描述它--不是我们宇宙中的引力理论，而是ADS宇宙中的引力理论。”他进一步指出，正如Moschidis最近证明的那样，ADS的不稳定性并不影响信件的有效性。\n当与ADS/CFT通信相结合时，Moschidis的工作也可能有助于阐明更熟悉的相互作用粒子领域。例如，Moschidis利用ADS时空的微小扰动来创造黑洞。通过对应，这个过程与量子系统达到平衡的热化过程相关--这是一种几乎无处不在的现实世界现象。\n“证明广告是不稳定的，”莫斯奇迪斯总结道，“并不意味着它不有趣。”", "note_en": "Four years ago, while still a graduate student at Princeton University,  Georgios Moschidis took on a problem that likely wasn’t going to pan out. His adviser asked him to mathematically prove that a certain configuration of space-time is unstable — to show, in other words, that any small change to it would ultimately lead to a breakdown in the space-time itself.\n His adviser, the mathematician  Mihalis Dafermos, knew how difficult the task would be. “You could spend a lot of time banging your head against the wall without getting anywhere,” said Dafermos, who (along with  Gustav Holzegel) posed the instability conjecture in 2006. “I didn’t think it could ever be proven.” But he encouraged Moschidis, now a postdoc at the University of California, Berkeley, to take a look at it anyway. Moschidis had already done enough work to earn a doctorate, so why not try for something big?\n Dafermos’ faith in Moschidis was well placed. In a series of advances that  began in 2017 and continue to this day, Moschidis has shown that a certain canonical configuration of Einsteinian space-time called anti-de Sitter (AdS) space is unstable. Throw a tiny bit of matter into AdS space, and eventually a black hole will emerge.\n The Stanford mathematician  Jonathan Luk describes Moschidis’ work as “amazing. … What he’s discovered is a rather general instability mechanism” — one that could apply to other settings, unrelated to AdS, in which matter or energy is cooped up within a physical system that has no escape hatches. Dafermos calls his former student’s work “spectacular” and “certainly the most original thing I’ve seen in the mathematics of general relativity in the last few years.”\n And although we do not live in an anti-de Sitter universe (thank goodness for that, as we wouldn’t exist), the work also has implications for our understanding of everything from turbulence to the mysterious connections between theories of gravity and quantum mechanics.\n  The instability conjecture — and indeed the whole school of thought from which it sprang — goes back to Einstein’s equations of general relativity, which spell out exactly how mass and energy affect the curvature of space-time. In a vacuum, where there’s no matter at all, space-time can still be curved and gravity can still be present, due to the energy density of the vacuum itself, described by a “cosmological constant.” Empty space, it turns out, is not really empty at all.\n The three simplest solutions to Einstein’s vacuum equations are the most symmetric ones — those in which the curvature of space-time is the same everywhere. In Minkowski space-time, where the cosmological constant is zero, the universe is perfectly flat. In de Sitter space-time, where the cosmological constant has a positive value, the universe is shaped like a sphere. And when the cosmological constant is negative, you get AdS space-time, which has a saddle shape. In the early days of cosmology, scientists wondered which one of these three space-times describes our universe.\n Mathematicians, on the other hand, tended to wonder if these space-times were really, truly stable. That is, if you disturbed a vacuum space-time in any way — say, by injecting some matter into the system or sending in some gravitational waves — would it eventually settle down into something close to the original state? Or would it evolve into something wildly different? It’s the cosmic equivalent of dropping a rock into a pond: Will the waves gradually diminish, or will they build into a tsunami?\n In 1986, a mathematician  proved that de Sitter space-time is stable. A pair of mathematicians  did the same for Minkowski space-time in 1993. The AdS problem has taken longer. The general consensus was that AdS, unlike the other two configurations, is unstable, which meant that mathematicians would have to take an entirely new approach. “A lot of tools in mathematics have been developed for stability problems,” said Dafermos. “But instability is a completely different arena — especially this type of instability,” which is nonlinear in nature, making for an inherently complicated situation, with correspondingly tricky calculations.\n Researchers suspected that AdS space-time might be unstable because they believed its boundary would be reflective, thereby causing it “to act like a mirror so that any waves hitting it will come back,” Dafermos explained.\n “Reflection at the boundary makes sense from a physical point of view,” said  Juan Maldacena, a physicist at the Institute for Advanced Study in Princeton, New Jersey. This is partly due to the curvature of AdS space, but there’s an even simpler explanation: The premise upholds the principle of energy conservation.\n If the boundary is, in fact, reflective, nothing can leak out of AdS space-time. So any matter or energy put into the system could potentially get concentrated — perhaps to such an extent that a black hole would form. The question was: Would that really happen, and, if so, what mechanism would cause matter and energy to cluster together to such a degree rather than staying spread out?\n  Moschidis imagined standing in the middle of AdS space-time, which would be like standing inside a giant ball whose edge or boundary lies at infinity. If you sent a light signal from there, it would travel out and reach the boundary in a finite amount of time. That kind of travel is only possible because of a well-known relativistic effect: Although the spatial distance to the boundary is indeed infinite, time slows down for a wave or object traveling at or near the speed of light. So an observer standing in the middle of AdS space-time would see a light ray reach the boundary in a finite amount of time (though some patience would be required).\n Instead of using a light ray, Moschidis dropped into AdS space a form of matter that is commonly used in general relativity models — so-called Einstein-Vlasov particles. These particles create concentric waves of matter in space-time, similar to the water waves that appear in a pond.\n Of the many concentric waves created when matter is suddenly plopped into this space-time, the first two will be the biggest. Since they contain the most matter and energy, we’ll focus on them. The first wave — call it wave 1 — will expand outward until it hits the boundary, bounces back, and contracts as it retreats toward the center. The second wave, wave 2, will follow.\n When wave 1 rebounds off the boundary and starts contracting toward the center, it will hit wave 2, which is still expanding. One consequence of the Einstein equations, Moschidis determined, is that in an interaction like this, the expanding wave (wave 2 in this case) will always transfer energy to the contracting wave (wave 1).\n After wave 1 reaches the center, it will start expanding again, meeting up with wave 2, which is now contracting. This time, wave 1 will impart energy to wave 2. This cycle can repeat many, many times.\n Moschidis realized something else: Near the center, the waves occupy less space, and the energy they carry is more concentrated. Because of this, the waves exchange more energy during the interaction near the center than during the interaction near the boundary. The net result is that wave 1 gives more energy to wave 2 at the center than wave 2 gives to wave 1 at the boundary.\n Over numerous iterations, wave 2 grows larger and larger, taking energy from wave 1. Consequently, the energy density of wave 2 continues to build. At some point, as wave 2 contracts toward the center, its energy will become so concentrated that a black hole will form.\n Here’s the proof of instability: Moschidis  showed that when he adds even a minuscule amount of matter to an AdS space-time, a black hole (or black holes) will inexorably form. However, AdS space-time has, by definition, uniform curvature everywhere, which means it cannot harbor space-contorting objects like black holes. “If you perturb AdS space-time and wait a sufficient time,” Moschidis said, “you’ll end up with a different geometry — one that contains black holes — and it’s no longer AdS. That’s what we mean by unstable.”\n Moschidis has recently proved AdS instability for a different kind of matter perturbation — a so-called massless scalar field — presenting this not-yet-published work in several academic talks. “Because the waves generated by a scalar field are a proxy for gravitational waves,” Dafermos said, this brings Moschidis one step closer to the ultimate goal — proving AdS instability in a true vacuum, where the space-time is perturbed strictly by gravity without the introduction of any matter.\n  The instability of AdS space-time has major implications for how we understand our own universe. First, since AdS space-time is unstable, it’s “something you will not see in nature,” Moschidis said.\n But “even though AdS is not real,” he said, “it can still lead us to the discovery and study of real phenomena.”\n For example, turbulence arises when energy gets concentrated from large scales to small scales — something that Moschidis showed can occur when AdS space-time is perturbed. But turbulence is a widespread (and poorly understood) phenomenon that appears in all kinds of fluid systems. AdS space-time — at least to someone with Moschidis’ skills and inclinations — is a “clean” and relatively simple system to work with, which is why he considers it “a good theoretical test bed” for studying turbulence. In the AdS setting, turbulence is caused by gravity, but Moschidis believes that the mathematical tools he is developing could aid the analysis of the turbulence that crops up in fluid mechanics as well.\n  AdS also features prominently in the so-called AdS/CFT correspondence — a key clue for how to unite quantum mechanics with gravity in an all-encompassing theory of quantum gravity. The correspondence states that a gravitational system in AdS space can be equivalent to a nongravitational quantum system in one fewer dimension. “We can take a quantum mechanical system that does not contain gravity and describe it instead by a theory of gravity — not a theory of gravity in our universe but a theory of gravity in an AdS universe,” said Maldacena, who uncovered the correspondence in 1997. He further noted that the instability of AdS — as recently proved by Moschidis — does not affect the validity of the correspondence.\n Moschidis’ work, when combined with the AdS/CFT correspondence, could also help illuminate the more familiar domain of interacting particles. For example, Moschidis used small perturbations of AdS space-time to create black holes. This process correlates, via the correspondence, to the process of thermalization whereby quantum systems achieve equilibrium — an almost ubiquitous real-world phenomenon.\n “Proving that AdS is unstable,” Moschidis concluded, “doesn’t mean it is uninteresting.”", "posttime": "2020-05-12 00:03:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数学,proves,时空", "title": "新数学证明一类特殊的时空是不稳定的", "title_en": "New Math Proves That a Special Kind of Space-Time Is Unstable", "transed": 1, "url": "https://www.quantamagazine.org/black-holes-prove-that-anti-de-sitter-space-time-is-unstable-20200511/", "via": "", "real_tags": ["数学", "proves", "时空"]}, {"category": "", "categoryclass": "", "imagename": "9891ade6215844c7073b62c4e07c8a64.png", "infoid": 1001666, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上面的图表是一个很酷的视觉表现，但我们的最终目标实际上只是一个可能的航程列表-类似于TSF-&gt；sxf-&gt；mla-&gt；tsf。完整的列表在这里：我想看看我们是否能在图中找到哈密尔顿循环会很有趣。不幸的是，由于有242个机场和4000多条航线，这个数字几乎不可能计算出来。不过，在下面的最终图中找到它实际上并不是那么糟糕-尽管它是NP-完全的，当一个图与上面一样多的边相连时，实际上并不难找到它。我还编写了下面的工具来计算最多4个机场的周期，从一个设定的机场开始和结束。这是我第一次在非学术背景下使用图形算法，这很酷。这是一项有趣的努力，创造了一个有望对某些人有用的工具。如果你正在计划一个超便宜的欧洲度假，你可以用这个来增加你的瑞安航空航班的所有行程！未来一个不错的补充是以某种方式获得每个飞行计划的价格数据。我找到了他们的API，而且非常简单：如果我发现我们的N长旅行变得太贵了，我可能会谈到这一点。如果这个网页很慢或者很笨重，我也很抱歉--通常我是网页优化的超级粉丝，但是这篇博客需要比平均速度慢得多的库来显示我想要展示的东西2。\n这张图实际上是这个问题的一个更有限的版本-因为每个机场都飞往TSF，我们正在人为地限制航线的数量。假设A、B和C在飞往TSF的图中。机场D不飞往tsf，但它确实飞往机场A，而机场B飞往d。此图不会向我们显示tsf-&&gt;；B-&&gt;；D-&&gt;；A-&&gt;；tsf的(更长)路线，因为它要求所有机场都飞往tsf。↩实际上说它们比平均速度慢既是对的，也不是对的-它们比大多数其他图书馆慢得多，但这也是因为它们所做的工作比大多数前端图书馆通常所做的工作要复杂得多。*iShares实际上说它们比平均速度慢是对的，也不是真的-它们比大多数其他图书馆慢得多，但这也是因为它们所做的工作比大多数前端图书馆通常所做的工作要复杂得多。我并不是说cytoscape没有优化(远非如此，它是一段令人惊叹的代码)，它只是在做一些你在javascript中通常不会做的事情。“↩", "note_en": "The graphs above are a cool visual representation but our end goal is really just a list of possible voyages - something like  TSF -&gt; SXF -&gt; MLA -&gt; TSF. The full list is here:   I thought it would be fun to see if we could actually find a Hamiltonian Cycle in the graph. Unfortunately, with 242 airports and over 4000 routes this would be nearly impossible to compute. It’s actually not that bad to find it in the final graph below, though - although it  is NP-Complete, when a graph is as connected with as many edges as above it’s actually not that difficult to find. I also wrote the tool below to compute cycles up to 4 airports in length, starting and ending from a set airport.   End    This was the first time I’ve used a graph algorithm in a non-academic context, which is pretty cool. It was a fun endeavour that created a tool that will hopefully be useful to some. If you’re looking to plan a super cheap European vacation you can just use this to add all the legs of your Ryanair flights! A nice future addition would be to somehow get price data for each flight plan. I found their API and it’s pretty straight forward:  I might get to that if I find that our N-length trip gets too expensive. Also I apologize if this webpage was slow or clunky - normally I’m a  huge fan of web optimizations, but this blog post needed libraries that are significantly slower than average to show what I wanted to show  2.\n  This graph is actually a more limited version of the problem - since every airport flies to TSF, we are artificially limiting the number of routes. Let’s say that A, B, and C are in the graph that fly to TSF. Airport D does not fly to TSF, but it does fly to airport A, and airport B flies to D. This graph would not show us the (longer) route of TSF -&gt; B -&gt; D -&gt; A -&gt; TSF, as it requires that  all airports fly to TSF.  ↩ Actually saying they’re slower than average is both true and not true - they  are significantly slower than most other libraries, but it’s also because they’re doing work that is significantly more complicated than most front end libraries normally do. I’m not saying Cytoscape isn’t optimized (far from that, it’s an amazing piece of code), it’s just doing things that you would not normally do in JavaScript.  ↩", "posttime": "2020-05-12 00:03:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "hamiltonian,tsf", "title": "瑞安航空，哈密尔顿循环，以及使用图论寻找廉价航班(2018年)", "title_en": "Ryanair, Hamiltonian Cycles, and using graph theory to find cheap flights (2018)", "transed": 1, "url": "https://blog.jldc.me/posts/ryan-air?ref=hnm20", "via": "", "real_tags": ["tsf"]}, {"category": "", "categoryclass": "", "imagename": "3e6a2c00e43c6f3b5d10b3e893bff687.png", "infoid": 1001665, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软的Outlook for the Web面临着与占主导地位的Gmail竞争的艰巨任务，而Gmail的竞争优势很大程度上要归功于文本预测等ML驱动的功能。但微软正在采取措施，直接面对与现代Gmail相关的功能之一-文本预测和完成。\n在过去的一周里，该公司更新了其公开可见的Microsoft 365功能路线图，将Outlook on the Web-文本预测纳入其中。该功能的描述是：使用智能技术，Outlook将在您键入时预测文本。只需使用Tab键就可以接受文本预测。&#34；这表明该功能的工作方式与Gmail非常相似。\n微软还计划引入“稍后发送”功能，用于安排发出的电子邮件；能够查看任务类别并为其分配类别；支持可能影响工作日历可用性的个人日历；能够回复消息列表中的会议；重新设计移动Web；全面重新设计任务界面；以及新的编辑器，该编辑器具有Microsoft 365支持的功能。在众多功能中，微软还计划推出一项新的编辑器，其中包括对消息列表中的会议进行回复的功能、移动Web重新设计、任务界面的整体重新设计，以及具有Microsoft 365、Microsoft 365和Microsoft 365所支持的功能的新编辑器，这些功能都会影响到工作日历的可用性、移动Web重新设计、任务界面的整体重新设计，以及由Microsoft 365支持的新编辑器等。\n从整体上看，我们的目标显然是更接近Gmail的功能对等-尽管基于Web的Outlook有几个积极的方面，但距离这一目标还有很长一段路要走。\nOutlook for Web是微软Office 365生产力订阅服务的一部分。这家科技巨头最近将Office 365的家庭和个人版本重新命名为微软365，这让人想起了类似亚马逊Prime的模式，它包括的不仅仅是核心的传统产品。福利仍在充实中，但最初包括供个人使用的微软团队，新的类似Grammarly的Word编辑器工具，以及从Adobe和冥想和正念应用Headspace等合作伙伴那里获得的福利。\n在过去的几年里，微软的许多产品都转向了订阅模式。从最新的季度收益报告来看--这份报告赢得了投资者的高度评价--这似乎对该公司目前的业务非常有效。至少就投资者的兴趣而言，该公司最近的表现是多年来最好的。\n尽管如此，来自谷歌(和亚马逊，在某些服务方面)的竞争依然激烈。就功能而言，这意味着一场持续的军备竞赛，就像这个预测文本示例一样--这对这些服务或工具的用户来说可能是一件好事。", "note_en": "Microsoft Outlook for the Web has the unenviable task of competing with a dominant Gmail—and much of Gmail&#39;s competitive advantage is thanks to ML-driven features like text prediction. But Microsoft is taking a step to face off directly with one of the features associated with modern Gmail—text prediction and completion.\n In the past week, the company updated its  publicly visible roadmap for Microsoft 365 features to include &#34;Outlook on the Web - text predictions.&#34; The feature&#39;s description reads: &#34;Using smart technology, Outlook will predict text while you type. Just use the Tab key to accept the text prediction.&#34; This suggests the feature would work very similarly to the way it does in Gmail.\n Microsoft also plans to introduce a &#34;send later&#34; feature for scheduling outgoing emails, the &#34;ability to view and assign categories to tasks,&#34; support for personal calendars that can affect work calendar availability, the ability to RSVP to meetings from the messages list, a mobile Web redesign, an overall redesign of the tasks interface, and a new editor with &#34;capabilities powered by Microsoft 365,&#34; among many other things.\n Looking at the roadmap as a whole, the goal is clearly to get much closer to Gmail feature parity—which is many steps away, despite several positives about Web-based Outlook.\n Outlook for the Web is part of Microsoft&#39;s Office 365 line of productivity subscription services. The tech giant recently rebranded the family and personal version of Office 365 to  Microsoft 365, evoking an Amazon Prime-like model of including much more than just the core traditional offerings. Benefits are still being fleshed out, but they initially include Microsoft Teams for personal use, the new Grammarly-like Editor tool for Word, and perks from partners like Adobe and meditation and mindfulness app Headspace.\n Over the past several years, Microsoft has pivoted to a subscriptions model for many of its products. Judging by the  most recent quarterly earnings report—which earned high marks from investors—that seems to be working very well for the company&#39;s business for the time being. At least in terms of investor interest, the company has lately had its best run in many years.\n Still, competition from Google (and Amazon, for some services) remains fierce. That means a continued arms race of sorts in terms of features, like this predicting text example—and that&#39;s probably a good thing for users of any of these services or tools.", "posttime": "2020-05-12 00:03:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,微软,web,reveals,功能", "title": "微软公布了基于Web的Outlook新功能计划", "title_en": "Microsoft reveals plans for new Web-based Outlook features", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/05/microsoft-plans-to-add-gmail-like-predictive-text-to-outlook-for-the-web/", "via": "", "real_tags": ["microsoft", "微软", "web", "reveals", "功能"]}, {"category": "", "categoryclass": "", "imagename": "828f07a14cbc194434883331229d4de9.jpg", "infoid": 1001664, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你避免夸张，并长期坚持，在一个华丽的霓虹灯世界中保持低调的纪律，当你宣布一个不同寻常的消息时，你可能会得到些许信任。没有人有权两次享受这种礼遇。如果你对月亮吹嘘的消息不起作用，你的读者有理由相信你之后说的每一句话。\n我相信哺乳动物已经实现了重大的复兴，使用了一种相对良性的干预措施，显示了扩大到人类的希望。我要拿我的名誉打赌。\n在实现实质性、全系统复兴的竞赛中，哈罗德·卡彻(Harold Katcher)是一匹黑马。他有合适的学历和扎实的研究历史。事实上，在他早年的生活中，他是发现乳腺癌基因BRCA1的团队的一员。我向哈罗德要了一份传记素描，并把它印在了这篇帖子末尾的一个盒子里。\n但卡彻没有研究拨款，也没有大学实验室或风险投资基金，也没有研究生团队在后面的房间里挖掘数据库和筛选化学品。\n卡彻有一件事对他有利，那就是正确的理论。老龄化研究的大多数爆炸性增长(以及几乎所有的风险投资初创公司)都在寻求从细胞层面治疗衰老。他们的范式是，衰老是分子损伤的积累，他们认为自己的工作是设计适当的修复机制。\n正如卡彻所理解的那样，事实是，在很大程度上，衰老是通过血液中的信号分子在整个系统范围内进行协调的。十多年前，正是我们对这一愿景的共同认识让卡彻和我走到了一起。卡彻在下面简要描述了他2009年的顿悟。这是他2013年发表的一篇文章的来源(花了几年时间才付印)，主题是异种共生实验对老龄化科学未来的意义。\n当然，卡彻并不是唯一一个了解到血液中的信号分子将组织重新编程为全身更年轻状态的人。问题是，血浆中有数以千计的微小浓度的成分，但它们传递的信息是细胞读取的。这些中的哪些是导致衰老的原因呢？一小部分实验室，包括伯克利的康博伊实验室、哈佛的艾米·瓦格实验室和斯坦福大学的托尼·怀斯-科雷实验室，在过去的十多年里一直在寻找答案。\n卡彻已经能够猜测、直觉或通过实验确定这个问题的答案。两年前，在阿克沙伊·桑哈维(Akshay Sanghavi)的种子资金支持下，他在孟买建立了一个实验室，并试图使用从年轻老鼠血液中提取的一部分，让老年实验室的老鼠恢复活力。第一轮实验令人鼓舞，一年前发表在这个领域。他从这篇博客的一位读者那里获得了下一轮资金，并有足够的老鼠通过实验滴定剂量，并看看随着时间的推移再次老化的经过治疗的老鼠是否能成功地重新治疗。\n这个故事有一个漏洞，等待知识产权的解决。卡彻和桑格维还没有申请专利，也还没有找到合适的合作伙伴为人体试验提供资金。他们没有透露治疗的任何细节，除了这样一个事实，即它分四次静脉注射，而且它是从一小部分血浆中提取的。卡彻认为，所涉及的分子不会很难制造，这样当产品最终商业化时，就不需要从活体受试者的血液中提取，无论是啮齿动物还是人类。\n我们还在等待这些经过治疗的老鼠的寿命曲线。与此同时，最好的年龄替代指标来自加州大学洛杉矶分校(UCLA)的史蒂夫·霍瓦特(Steve Horvath)和其他科学家开发的甲基化时钟。至关重要的是，卡彻在霍瓦特身上找到了一个盟友，他不仅测试了他恢复活力的老鼠，还进行了必要的统计分析，开发了一套专门针对老鼠的六个甲基化时钟。其中五个时钟针对不同的组织进行了优化，其中一个是跨物种校准的，这样它就可以测量人类的年龄以及相应的“老鼠年”(大约1/40人年)的年龄。这种双物种时钟是一项重大的创新，是将动物模型的结果转化为人类可能的等价物的第一座桥梁。\n在周五发表在BioRxiv上的一篇论文中，Katcher和Horvath报告了恢复活力的大鼠的甲基化测量结果。“至关重要的是，对老年大鼠进行的血浆治疗[109周]大大降低了血液、肝脏和心脏的表观遗传年龄，达到了与年轻大鼠[30周]…相当的水平。”根据表观遗传时钟的最终版本，四个组织的平均返老率为54.2%。换言之，这种治疗使表观遗传年龄减少了一半以上。“。\n除了甲基化时钟之外，这篇论文还提供了通过许多其他方法恢复活力的证据。例如：\n在认知功能测试(巴恩斯迷宫)中，经治疗的大鼠得分高于老年大鼠，但不如年轻大鼠。\n血浆返老还童实验中的一个主要问题是必须多久进行一次治疗。血浆中的许多成分都是短暂的，会分泌到血液中，并在一天中持续吸收。卡彻的研究结果带来的好消息是，似乎只需要注射四针就能恢复活力。\n这些实验解决的第二个问题是，返老还童是否需要同时添加和去除血浆中的分子物种。例如，在老年血液中发现的促炎细胞因子水平要高得多。伊琳娜和迈克·康博伊，我认为他们是该领域最可信的人，他们说过，把坏演员从血液中剔除可能比恢复年轻水平的有益信号更重要。他们是15年前斯坦福大学的研究生，当时异种寄生虫科学的现代浪潮开始了，从那时起，他们就一直在追求这个课题。卡彻的实验只通过添加血液成分，而不是移除或甚至中和其他成分就取得了结果，这表明他已经找到了重新编程表观遗传学的必要公式，从而降低了不良行为者的水平。但如果去除一些等离子体成分，是否能取得更好的效果还有待观察。\n一个悬而未决的问题是关于老化时钟的位置和机制。多年来，我一直在两款车型之间犹豫不决：\n也许在下丘脑中有一个中央衰老时钟，它保持自己的时间，并将协调分散组织甲基化状态的信号传送到全身。\n关于表观遗传年龄的信息散布在身体各处，生物钟是一个反馈环，它不断地更新局部甲基化年龄，以响应收到的关于全球甲基化年龄的信号。\n数据中有一种暗示，下丘脑可能比其他组织更难恢复活力。在协调整个身体的年龄方面，它是否比其他组织起到更重要的作用？霍瓦特(个人交流)建议，在测量得到证实并进行更多实验之前，在得出这一推论时要谨慎。\n这些结果将过去十年来一直在获得可信度的三条线索汇聚在一起。相辅相成的是，这三个国家都有一种它们都无法单独提供的力量。\n衰老的根本原因是表观遗传进程，即一生中基因表达的变化。\n核DNA中的甲基化模式不仅是衰老的标志，而且是衰老的主要来源。因此，衰老可以通过重新编程DNA甲基化来逆转。\n有关身体年龄状态的信息通过血液中的信号分子在整个系统内传递。在局部，组织对这些信号作出反应，并按照它们的指示采用年轻或年老的细胞表型。\n所以，你可能会认为我是一个大器晚成的人。虽然我在文献中有数千条引用，发表的出版物从发现人类“乳腺癌基因”，到蛋白质结构、细菌学、生物技术、生物信息学和生物化学，我的工作没有中心或方向，因为我已经放弃了解决/治愈衰老的个人目标，当我得知“磨损”是导致衰老的原因时。然而，1985年，当我在加利福尼亚州与迈克尔·沃特曼(Michael Waterman)和坦普尔·史密斯(Temple Smith)(生物信息学之父)一起工作时，发生了一件令人费解的事情：我发现自己在重症监护病房，气管里插入了一根管子，知道我可能活不下去了。然后我做了一个梦：我梦见不知何故在遥远的未来(以及在另一个世界)，我被宴请为“给人类带来不朽”。显然，我在那次事件中幸存了下来(从一颗感染的牙齿开始)。但我过着美好的生活-成为一名计算机程序员(这是我喜欢的)，离开了马里兰大学的亚洲分部，成为一名全职教授，然后是日本东京的理科学术主任。2004年我离开日本时(我的女儿莎莎(Sasha)是日本学校系统的一名四年级学生，(Yonensei))，我在密歇根大学在线教书--有点退休了，并期待着写计算机。然而，我从未忘记那个梦。这显然是不可能的；我没有实验室-真的，没有办法修复所有受损的细胞-这就像扫回大海一样。然后，在2009年，我读了一篇2005年的旧论文，一篇由康博伊斯夫妇(迈克尔和伊琳娜)，汤姆·兰多和其他人写的论文，来自欧夫·魏斯曼的实验室，它彻底改变了我的生活；它告诉我，我认为关于衰老的一切都是错误的-衰老发生在组织层面，而不是细胞层面，而且是可以逆转的。故事的其余部分是关于坚持不懈和阿克沙伊·桑赫维(Akshay Sanghvi)的祝福干预的，他也看到了另一种方式，并提供了结构、金钱和情感上的支持(以及一些好的想法)，让我在72岁的时候在印度孟买开始了新的职业生涯。虽然我感觉比三年前年轻了20岁，但我想这是另一个关于衰老的暗示。现在是“神秘”的梦想吗？这不会是历史上第一次发生这样的事情-把它作为一个数据。", "note_en": "If you eschew hyperbole and hang in for the long haul, maintaining a discipline of understatement in the midst of a flashy neon world, you may be offered a modicum of credence when you make an extraordinary announcement. No one is entitled to this courtesy twice. If the news that you trumpet to the moon does not pan out, your readers will be justified in discounting everything you say thereafter.\n  I believe major rejuvenation has been achieved in a mammal, using a relatively benign intervention that shows promise of scaling up to humans. I’m going to stake my reputation on it.\n  In the race to effect substantial, system-wide rejuvenation, Harold Katcher is a dark horse. He has the right academic credentials and a solid history of research. In fact, in earlier life he was part of a team that  discovered the breast cancer gene,  brca1. I asked Harold for a biographical sketch, and have printed it in a box at the end of this posting.\n But Katcher has no research grants or university lab or venture capital funding, no team of grad students mining databases and screening chemicals in the back room.\n One thing Katcher has going for him is the correct theory. Most of the explosion in aging research (and virtually all the venture capital startups) are looking to treat aging at the cellular level. Their paradigm is that aging is an accumulation of molecular damage, and they see their job as engineering of appropriate repair mechanisms.\n The truth, as Katcher understands it, is that, to a large extent, aging is coordinated system-wide via signal molecules in the blood. It was our common realization of this vision that brought Katcher and me together more than a decade ago. Katcher briefly describes his 2009 epiphany below. It was the source of his  2013 essay (it took a few years to get it into print) on the significance of parabiosis experiments for the future of aging science.\n Of course, Katcher was not the only one to get the message about the power of signal molecules in the blood to reprogram tissues to a younger state throughout the body. The problem is that there are thousands of constituents represented in tiny concentrations in blood plasma, but conveying messages that cells read. Which of these are responsible for aging? A small number of labs, including the Conboys at Berkeley, Amy Wager at Harvard, and Tony Wyss-Coray at Stanford have been searching for the answer over the last decade and more.\n Katcher has been able to guess or intuit or experimentally determine the answer to this question. With seed funding from Akshay Sanghavi, he set up a lab in Mumbai two years ago, and tried to rejuvenate old lab rats, using a fraction extracted from the blood of younger rats. The first round of experiments were encouraging, published  in this space a year ago. He obtained the next round of funding from a reader of this blog, and had enough rats to titrate dosages experimentally, and to see if treated rats who aged again over time could be re-treated successfully.\n There is a hole in this story that awaits the resolution of intellectual property rights. Katcher and Sanghvi have not applied for patents and have not yet found a suitable partner to provide financing for human trials. They have not revealed any details of the treatment, besides the fact that it is in four intravenous doses, and that it is derived from a fraction of blood plasma. Katcher thinks that the molecules involved will not be difficult to manufacture, so that when a product is eventually commercialized, it will not require extraction from the blood of live subjects, rodent or human.\n We’re still waiting for longevity curves of these treated rats. In the meantime, the best available surrogate measure of age comes from methylation clocks, as developed by Steve Horvath at UCLA, and other scientists as well. Crucially, Katcher found an ally in Horvath, who didn’t just test his rejuvenated rats, but did the needed statistical analysis to develop a set of six methylation clocks specialized to rats. FIve of the clocks are optimized for different tissues, and one is calibrated across species, so that it can measure age in humans as well as corresponding age in “rat years” (about 1/40 human year). The two-species clock was a significant innovation, a first bridge for translating results from an animal model into their probable equivalent in humans.\n  In a  paper posted to BioRxiv on Friday, Katcher and Horvath report results of the methylation measurements in rejuvenated rats. “Crucially, plasma treatment of the old rats [109 weeks] reduced the epigenetic ages of blood, liver and heart by a very large and significant margin, to levels that are comparable with the young rats [30 weeks]….According to the final version of the epigenetic clocks, the average rejuvenation across four tissues was 54.2%. In other words, the treatment more than halved the epigenetic age.”\n  Besides the methylation clock, the paper presents evidence of rejuvenation by many other measures. For example:\n In tests of cognitive function (Barnes maze), treated rats scored better than old rats, but not as well as young rats.\n A major question in blood plasma rejuvenation experiments has been how often the cure must be administered. Many of the components of blood plasma are short-lived, secreted into the blood and absorbed continuously throughout the day. The good news from Katcher’s results is that it seems only four injections are needed in order to achieve rejuvenation.\n A second question which these experiments resolve is whether rejuvenation requires both adding and removing molecular species from the blood plasma. For example, pro-inflammatory cytokines are found in old blood at much higher levels. Irina and Mike Conboy, people who I regard as most credible in the field, have said that removing bad actors from the blood is probably more important than restoring youthful levels of beneficial signals. They were grad students at Stanford 15 years ago, when the modern wave of parabiosis science was initiated, and have pursued the subject continuously ever since. Katcher’s experiments have achieved their results only by adding blood components, not by removing or even neutralizing others.  This suggests that he has found the necessary formula for re-programming epigenetics, so that lower levels of the bad actors occur as a result. But i t remains to be seen whether even better results can be obtained if some plasma constituents are removed.\n A question that remains unresolved concerns the location and mechanism of the aging clock. I have been undecided over the years between two models:\n There is a central aging clock, perhaps in the hypothalamus, which keeps its own time and transmits signals throughout the body that coordinate methylation state of dispersed tissues\n Information about epigenetic age is dispersed through the body, and the body’s clock is a feedback loop that is continually updating methylation age locally in response to signals received about the methylation age globally.\n There is a suggestion in the data that the hypothalamus may be more difficult to rejuvenate than other tissues. Does it play a more important role than other tissues in coordinating the age of the entire body? Horvath (personal communication) counsels caution in drawing this inference until measurements are corroborated and more experiments are done.\n  These results bring together three threads that have been gaining credibility over the last decade. Mutually reinforcing, the three have a strength that none of them could offer separately.\n The root cause of aging is epigenetic progression = changes in gene expression over a lifetime.\n Methylation patterns in nuclear DNA are not merely a marker of aging, but its primary source. Thus aging can be reversed by reprogramming DNA methylation.\n Information about the body’s age state is transmitted system-wide via signal molecules in the blood. Locally, tissues respond to these signals and adopt a young or an old cellular phenotype as they are directed.\n  So, you might consider me a late bloomer.  While I have thousands of citations in the literature, with publications ranging from the discovery of the human ‘breast cancer gene’, to protein structure, bacteriology, biotechnology, bioinformatics, and biochemistry, there was no center or direction to my work as I had given up my personal goal of solving/curing aging when I learned that ‘wear and tear’ was the cause of it.  Yet something happened in year 1985 when I was in California working with Michael Waterman and Temple Smith (fathers of bioinformatics) that is inexplicable: I found myself in Intensive Care with a tube inserted into my trachea and the knowledge that I might not live.   And then I had a dream: I dreamed that somehow in the far future (and on another world), I was being feted for ‘bringing immortality to mankind’. Clearly, I survived that incident (started with an infected tooth).    I lived a wonderful life – becoming a computer programmer (which I loved), leaving that for the University of Maryland’s Asian division, becoming a full professor and then the Academic Director for the Sciences, in Tokyo, Japan.  By the time I left Japan in 2004, (my daughter Sasha was a fourth-grader, (yonensei), in the Japanese school system), I was teaching for U of M online – somewhat retired, and looking forwards to writing computer programs for fun and profit. Yet I never ever forgot that dream. It was clearly impossible; I had no lab – and really, there was no way to repair all damaged cells – it’d be like sweeping back the ocean. And then, in 2009, I read an old paper from 2005, a paper written by the Conboys, (Michael and Irina), Tom Rando and others, coming from Irv Weisman’s lab, that completely changed my life; that showed me that everything I believed about aging was wrong – that aging occurred at the organismic level, not at the cellular level and could be reversed. Well, the rest of the story is about persistence and the blessed intervention of Akshay Sanghvi who too saw there was another way and provided the structural, monetary, and emotional support (and some good ideas) that had me start a new career at age 72 in Mumbai, India.  I feel twenty years younger than I did three years ago, I guess that’s another hint about aging. Now the ‘mystical’ dream?  It wouldn’t be the first time in history that that happened – take that as a datum.", "posttime": "2020-05-11 23:48:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "减龄,reduction,实验室", "title": "减龄突破", "title_en": "Age Reduction Breakthrough", "transed": 1, "url": "https://joshmitteldorf.scienceblog.com/2020/05/11/age-reduction-breakthrough/", "via": "", "real_tags": ["减龄", "reduction", "实验室"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001663, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "⇦我有一个理论，认为1995年犯了一个严重的错误--决定不用一种整洁、简洁和声明的方式来表示JavaScript中的HTML元素。\n在这篇文章中，我将描述事情的现状，展示几个对javascript语法的非常小的补充，它们可能已经产生了很大的不同，然后再谈一谈它带来的影响。在这篇文章中，我将描述目前的状况，展示几个对javascript语法的非常小的补充，它们可能会带来很大的不同，然后再谈论其影响。\nconst myLi=Name=&gt；`&lt；li&gt；我的名字是&lt；em&gt；${name}&lt；/em&gt；&lt；/li&gt；`const Myul=Names=&gt；`&lt；ul class=&#34；my-ul&#34；&gt；${names.map(myLi).join(&#39；&#39；)}&lt；/ul&gt；`。\n这是垃圾，原因很明显--编写字符串很容易出错，没有输入/打印等等。然后我们必须将它们转换为不太优雅的元素：\n当然，也有各种各样的库，从字符串模板库(如把手)到可编译的库(如.jsx)。\n类型HtmlNode={Tag：String，Attributes：{[Key：String]：String|Function}，子项：(HtmlNode|String)[]}。\n{Tag：&#34；Button&#34；，Attributes：{&#34；id&#34；：&#34；Baz&#34；，&#34；class&#34；：&#34；Foo bar&#34；，&#34；data&#34；：&#34；1&#34；，&#34；onclick&#34；：F，}，Children：[&#34；Hello&#34；，{tag：&#34；em&#34；，属性：{}，子项：[&#34；here&#34；]，}]}。\nHTML(lang=&#34；EN&#34；)head title=pageTitle body h1.一些类Jade-node模板引擎#CONTAIN-如果(YouAreUsingJade)你很棒\n这看起来不错，主要问题是我们在编程构造上有点局限，例如，我们如何使&lt；h1&gt；在某些条件下隐藏额外的类？Jade通过3种不同的方式指定类来绕过这个问题。与其想出一种特殊的模板语言，不如稍微扩展一下普通的js语法。\n好的，让我们来看看上面的例子。我不会过多地强调这一点的正确性，因为我并不是建议我们更改所有代码，而只是更改可能的代码。\n因此，下面是允许现有js对象语法以相当简洁的方式表示html节点的事项清单：\n除了键：值对之外，对象还允许拖尾值。我想可以用foo.~或一些特殊的构造来访问它们。\n它们获得一个可选标签(在本例中为按钮)。如果您做过很多JSON反序列化工作，那么标记似乎是个好主意(它们可以帮助您将数据映射到类型)，看看它们在edn-nices中是如何使用的(通过自定义命名空间)。\n就是这样。我们的javascript将使用它作为主数据类型(其他所有内容都将保持不变)。也许，我们会开始(重新)编写所有类似XML的html，以便也使用这种语法。\nConst Names=[&#34；Barry&34；，&#34；Lynette&34；]Const myLi=name=&gt；li{&#39；我的名字是&#39；em{name}}const Myul=Names=&gt；ul{class：[&#39；my-ul&#39；].names.map(MyLi)}app.get(&#39；/&#39；，(req，res)=&gt；res.。\n正文{class：&#34；language-javascript&#34；a{href：&#34；index.html&#34；img{style：&#34；Height：2EM&#34；src：&#34；pic.png&#34；}&#34；⇦&#34；}H1{&#34；如果我们最好使用代码{&#34；html&#34；}&#34；-in-&##。}句法一直？p我有一个理论，1995年犯了一个严重的错误.&#34；}}。\nJSON和HTML之间没有区别。(API设计的下游后果会是什么？)。\n我们的html只是结构化的数据，这会不断地让我们目不转睛地看着我们。\n我们就不会有像淘汰赛(还记得那一次吗？)那样在html中使用奇怪逻辑的年代了。\n我们在1996年可能会有类似的反应，而那只会是废话，很明显，我们会像诅咒一样做这件事。(这句话的意思是：“如果是在1996年，我们可能会有类似的反应，而那只会是废话，显然我们会像诅咒一样做这件事)。”\n我们本可以拥有一个可组合的库，用于日期选择器、情态函数等，而不必使用这个庞大的库。\n没有人会使用handlebar/jinsa/twig string munging库来制作html(至少在节点世界中是这样)。\nhtml&lt；form&gt；-&gt；json阻抗不匹配(尝试将嵌套数据描述为表单)现在可能已经正确排序。\n本世纪初，每个人的一切都是XML的计划可能会更成功。(这会是件好事吗？)\n我认为这是一个足够好的解决方案，但是它与您的标准js对象的语法不同这一事实鼓励人们将VDOM对象视为不是普通数据，但事实并非如此。记谱法本身就是一种思维工具。\n我们的另类历史从未发生过，我更喜欢无聊的超级脚本风格，一切都是代码。", "note_en": "⇦    I have a theory that a grave mistake was made in 1995 - the decision not to have a neat, succinct and declarative way of representing html elements in javascript.\n  In this post, I&#39;m going to describe the current state of affairs, show a couple of very small additions to javascript&#39;s syntax that might&#39;ve made all the difference, then talk about the repercussions.\n          const myLi = name =&gt; `&lt;li&gt;My name is &lt;em&gt;${name}&lt;/em&gt;&lt;/li&gt;`const myUl = names =&gt; `&lt;ul class=&#34;my-ul&#34;&gt;${names.map(myLi).join(&#39;&#39;)}&lt;/ul&gt;`\n  This is rubbish for obvious reasons - composing the strings is bug-prone, no typing/linting etc etc. We then have to turn them into elements with the  less than elegant:\n              Of course, there are also various libraries, ranging from string templating ones (like  handlebars) through to compile-away ones like  .jsx.\n      type HtmlNode = { tag: string, attributes: {[key: string]: string | Function}, children: (HtmlNode | string)[]}\n        { tag: &#34;button&#34;, attributes: { &#34;id&#34;: &#34;baz&#34;, &#34;class&#34;: &#34;foo bar&#34;, &#34;data&#34;: &#34;1&#34;, &#34;onclick&#34;: f, }, children: [ &#34;Hello&#34;, { tag: &#34;em&#34;, attributes: {}, children: [&#34;there&#34;], } ]}\n      html(lang=&#34;en&#34;) head title= pageTitle body h1.some-class Jade - node template engine #container - if (youAreUsingJade) You are amazing\n  This seems nice, the main problem is we are a bit confined in our programming constructs, for example, how would we make the  &lt;h1&gt; have the additional class  hidden on some condition? Jade gets around this by having 3 different ways of specifying classes. Rather than come up with a special templating language, let&#39;s just slightly extend vanilla  js syntax.\n    Right, let&#39;s have a go with the example from above. I&#39;m not going to put too much weight on the correctness of this as I&#39;m not suggesting we change all our code, only a &#34;what might&#39;ve been&#34;.\n            So, a checklist of things to allow existing  js object syntax to represent html nodes in a reasonably succinct way:\n  As well as  key: value pairs, objects allow trailing  values. I guess these would be accessible with  foo.~ or some special construct.\n  They get an optional tag (in this case  button). If you&#39;ve done much JSON deserialisation, tags seem like a good idea (they can help you map data to types), take a look at how they&#39;re used (with custom namespacing) in  edn - nice.\n  That&#39;s it. Our javascript would use this as the main data type (everything else would remain the same). Probably, we&#39;d start (re)writing all our XML-ish html to also use this syntax.\n          const names = [&#34;Barry&#34;, &#34;Lynette&#34;]const myLi = name =&gt; li{&#39;My name is &#39; em{name}}const myUl = names =&gt; ul{class: [&#39;my-ul&#39;] ...names.map(myLi)}app.get(&#39;/&#39;, (req, res) =&gt; res.send(myUl().asHTMLStr())\n    body{class: &#34;language-javascript&#34; a{href: &#34;index.html&#34; img{style: &#34;height:2em&#34; src: &#34;pic.png&#34;} &#34;⇦&#34;} h1{&#34;What if we&#39;d had better &#34; code{&#34;html&#34;} &#34;-in-&#34; code{&#34;js&#34;} syntax all along?&#34;} p{&#34;I have a theory that a grave mistake was made in 1995 ...&#34;} ...\n    There would be no distinction between  JSON and  html.  (What would have been the downstream consequences to API design?)\n  It would be constantly staring us in the face that our html is  just structured data.\n  We wouldn&#39;t have had the years of weird logic-in-html stuff like in  knockout (remember that one?)\n  We might&#39;ve had a React-a-like in 1996, and it would have just been &#34;duh, obviously we&#39;ll just do it like  curses&#34;.\n  We would have had a composable libraries for date selectors, modals, etc. without having to use said big-hairy-library.\n  No one would be using handlebars/Jinja/twig string munging libraries to make html (in the node world at least).\n  The html  &lt;form&gt; &lt;-&gt;  json impedence mismatch (try describing nested data as a form) would probably have been properly sorted by now.\n  Everyones&#39; early noughties plans for  everything to be  XML might&#39;ve been more successful.  (Would that have been good?)\n    I think it&#39;s a fine enough solution, but the fact that it&#39;s a different syntax from your standard  js objects encourages people to consider the VDOM objects as &#34;not normal data&#34;, but they  are.  Notation as a tool of thought innit.\n      Our alternative history having never happened, I  prefer the boring hyperscript style, everything is &#34;just code&#34;.", "posttime": "2020-05-11 23:34:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "js,html", "title": "如果我们一直有更好的HTML-in-JS语法会怎么样？", "title_en": "What if we'd had better HTML-in-JS syntax all along?", "transed": 1, "url": "https://leontrolski.github.io/dom-syntax.html", "via": "", "real_tags": ["js", "html"]}, {"category": "", "categoryclass": "", "imagename": "ca4507e2d1c91c190852680f7710f010.png", "infoid": 1001661, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚当·马格亚尔走红了。他最近拍摄的“不锈钢”系列以超慢动作播放地铁站台的视频，这一系列作品在网络上引起了轩然大波。Magyar首先从一列快速到达的火车上拍摄站台上的人，然后放慢镜头，突出经常被遗漏的细节和很少被记住的表情。无论是柏林的亚历山大广场、东京的新宿还是纽约市的中央车站，Magyar的视频片段都显示了拥挤的地铁站台，这些站台有时让人难以忘怀，有时又很优雅。等待下一班火车看起来从未如此令人信服。\n这段两分钟的片段是中央车站视频的一小段；整个视频长达11分钟，实时显示的一幕只持续了大约12秒。如果你在马扎尔拍摄每一个场景时站在他旁边，以接近每小时30英里的速度冲进车站，你可能不会再考虑两个男人因为某个共同的笑话而大笑，或者一对女孩在Alexanderplatz的站台上跑来跑去。就没有足够的时间了。但通过马扎尔的镜头，这些行动实际上已经被冻结，并变得有意义。\n马扎尔的项目之所以能引起如此强烈的共鸣，部分原因是他捕捉到了精细的细节，比如嘴巴周围的皱纹，某人的一缕头发。他把重点放在最有趣的人群上，比如亚历山大广场(见下图)，在那里，两个女孩在背景中奔跑-他说这是一份“礼物”-决定了一群服务员和另一群服务员的不同之处。最终的产品很大程度上要归功于他充分的准备。“我总是花更多的时间在计划上，而不是捕捉上，”他最近通过电子邮件告诉我。“你做你的计算和测试…。然后图像就像你想象的那样发生了。这是一种非常奇妙的感觉。“。\n马扎尔说，如果他在一个地点找到了合适的能量，他真的不必在车站等很长时间就能捕捉到合适的序列，尽管如果他去一个城市拍摄，他几乎所有的时间都花在地铁系统里。在新宿的情况下，他在东京车站闲逛了几个星期后，只拍了两个镜头。但是，正确的设备与正确的时机同样重要。\nMagyar通过使用相机捕捉运动图像的帧，速度快于我们的肉眼所能感知的速度，然后以更慢的速度播放它们，从而产生了这种效果。Magyar以每秒约1300帧的速度拍摄了这群人，是电影中标准每秒24帧的54倍。一些研究表明，我们的眼睛和大脑可以在短短13毫秒内识别出一张图像-眨眼的时间大约相当于每秒75帧，仅为不锈钢胶片速度的1/17。(Magyar使用的是改装后的Optronis相机，实际上每秒可以拍摄10万帧，这将使运动速度减慢到正常速度的近1/4000。)。\n本文是鹦鹉螺长达一个月的时间科学与艺术探索的一部分。在录音棚里，时间不会流逝--只有“永恒的现在”。来自工作室的艺术是一种结晶形式的.。多读。\n在几年的时间里，马扎尔捕捉到了这段视频，并用他创建的软件和他修改的硬件对其进行了处理。他的DIY伦理延伸到他工作的方方面面，从他用来校正原始数据的计算机程序，到他改装的相机，再到他发明的小玩意儿，比如寻呼机大小的传感器，它可以测量经常潮湿的地铁系统地下世界中的灯光闪烁。\n马扎尔并不是第一个创作这种视觉作品的人。业余摄影师格雷姆·泰勒(Graeme Taylor)捕捉到了英国巴斯一列火车通过站台的场景。特雷·拉特克利夫减缓了东京各条街道上的城市运动。“从技术上讲，我没有做任何还没有做过的事情。在公共场所也做了相当多的慢动作项目。但据我所知，还没有人像这样用这种质量扫描过地铁列车，“Magyar说。\n尽管最近人们对他的作品兴趣高涨，但他以前在他的静止全景照片中玩弄过时间，最有趣的是，我会争辩说。\n在他的Urban flow系列中，Magyar在上海、香港、伦敦和纽约创造了拥挤的空间和经过的地铁列车的全景。这里的环境是城市的，所以人群和过往的火车都很容易到达。这些图像的独特之处在于，马贾尔应用了一种名为狭缝扫描的技术，顾名思义，这种技术就是摄像机在狭缝前面移动时捕捉场景。如果拍摄对象的移动速度与感光胶片通过缝隙的速度相同，则运动中的拍摄对象看起来很清晰；如果它们的移动速度比胶片快或慢，则记录的内容是模糊的。\n到了20世纪初，足智多谋的摄影师发现，他们可以通过手动或自动将相机内的胶片移过狭缝来制作狭缝扫描照片。这项技术对拍摄比赛的终点线非常有效，因为比赛的第一名和第二名可以通过鼻子的不同来确定。你只需对车内的机械部件进行编程，使其移动速度与赛车手的移动速度一样快即可。Magyar的Optronis相机以数字方式进行计算和成像，扫描的空间狭长只有1个像素宽，大约相当于一个红细胞的长度。\n马扎尔说，他并不满足于仅仅是能够利用数字技术的一个功能，比如高速扫描场景的碎片或以超高帧率拍摄视频。“除了所有的技巧，结果需要提供一些洞察力-否则，它只会很有趣，而不是动人，”他说。因此，他花了数年时间为他的一些系列做准备，策划如何描绘城市人的风景，最后将人们的注意力吸引到他所说的“不重要的、被忽视的时刻”上。在去年的一次PopTech会议上，他说，“我总是对剩下的感兴趣。”现在我们也感兴趣了。", "note_en": "Adam Magyar’s gone viral. His recent series   Stainless, in which video recordings of subway platforms are played out in super-slow-motion, has been  rippling across the web. Magyar first films people on the platform from a speedily arriving train and then slows the footage down, highlighting details and expressions that are often missed and rarely remembered. Regardless of station—Berlin’s Alexanderplatz, Tokyo’s Shinjuku, or New York City’s Grand Central—Magyar’s video excerpts show crowded subway platforms that are at some times haunting, at others elegant. Waiting for the next train never looked so compelling.\n    This two-minute excerpt is one small piece of the Grand Central clip; the entire video runs almost 11 minutes, showing a scene that only lasted about a dozen seconds in real time. If you were standing next to Magyar when he shot each scene, rushing into a station at close to 30 miles per hour, you probably wouldn’t have given a second thought to two guys laughing at some shared joke, or a pair of girls running across the platform at Alexanderplatz. There wouldn’t have been enough time. But through Magyar’s lens, these actions have been practically frozen, and made meaningful.\n  Part of the reason Magyar’s project has struck such a chord is the fine details he’s captured, like the crease around a mouth, the wisps of someone’s hair. And he’s focused on the most interesting sets of crowds, like that on the Alexanderplatz (below), where the two girls running in the background—a “gift,” he says—make all the difference between one group of waiters and another. Much of the final product can be attributed to his ample preparation. “I always spend more time with planning than capturing,” he told me recently over email. “You make your calculations and tests … and then the image happens just as you imagined. It’s a pretty amazing feeling.”\n    Magyar says that if he finds the right energy in a spot, he doesn’t really have to wait long at a station to capture the right sequence, though he spends nearly all his time in a subway system if he visits a city to shoot it. In the case of Shinjuku, he only ended up shooting two sequences after hanging out at the Tokyo station for a couple of weeks. But the right equipment is just as important as good timing.\n  Magyar creates this effect by using a camera to capture frames of a moving image faster than our eyes can perceive them, and then playing them back much more slowly. Magyar filmed the throng of people at about 1,300 frames per second, 54 times the 24 frames per second used as a standard in movies.  Some research shows that our eyes, and brain, can identify an image in as little as 13 milliseconds—a blink of time that would correspond to approximately 75 frames per second, only 1/17th as fast as the footage in  Stainless. (Magyar used a modified Optronis camera that can actually shoot up to 100,000 frames per second, which would slow down motion to almost 1/4,000th of its usual speed.)\n This article is part of Nautilus’ month-long exploration of the science and art of time. Read the introduction here.In the studio, time does not pass—there is only an “eternal now.” The art coming from the studio is a crystallized form of...  READ MORE\n  Over the span of a couple of years, Magyar captured the footage, and processed it with software he created and hardware he modified. His DIY ethic stretches across all aspects of his work, from the computer programs he uses to correct raw data, to his modified camera, to gadgets he invents, like a beeper-sized sensor that measures light flickering in the often dank netherworld of subway systems.\n    Magyar isn’t the first to create this type of visual piece. One amateur photographer, Graeme Taylor, captured the scene of  a train passing a platform in Bath, England. Trey Ratcliff slowed down  urban motion on various streets across Tokyo. “In a technical sense, I’m not doing anything that hasn’t been done yet. Quite a few slow-motion projects have been done in public spaces, too. But as far as I know, no one has scanned subway trains like this, and [with] this quality,” Magyar says.\n  Although interest in his work spiked quite recently, he’s played with time before, and most interestingly I’d argue, in his still panoramic photographs.\n    In his  Urban Flow series, Magyar creates panoramas of crowded spaces and passing subway trains in Shanghai, Hong Kong, London, and New York. The settings are urban, so both crowds and passing trains are easy to come by. What’s unique in these images is Magyar’s application of a technique called slit-scan, in which, as the name suggests, a camera captures a scene as it moves in front of a thin slit. If the subject is moving at the same rate as the photosensitive film moving past the slit, the subject in motion looks crisp; if they move faster or slower than the film, what you’ll record is a blur.\n  By the early 20th century, resourceful photographers found that they could make slit-scan pictures by manually or automatically moving film within the camera past the slit. This technology worked—and still works—perfectly for  photographing the finish line of a race, where first and second place can be determined by the difference of a nose. You just have to program the mechanical parts inside to move as quickly as the racer will be moving. Magyar’s Optronis camera does the calculations and imaging digitally, scanning a sliver of space only 1 pixel wide—just about the length of a red blood cell.\n  Magyar says he isn’t satisfied with just being able to utilize a feature of digital technology, like scanning slivers of a scene at high speed or shooting video at super-high frame rates. “Beyond all the tricks, the outcome needs to provide some insight—otherwise, it’ll only be interesting, rather than moving,” he says. So he invests years into preparation for some of his series, plotting ways to portray a landscape of urban people, and finally drawing attention to what he has called “the unimportant, the ignored moments.” In a PopTech conference last year, he said, “I was always interested in the rest.” Now we’re interested too.", "posttime": "2020-05-11 23:25:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "摄影,叮当作响,tinkers,速度", "title": "“与时间叮当作响的摄影师”(2015)", "title_en": "A Photographer Who Tinkers with Time (2015)", "transed": 1, "url": "http://nautil.us/issue/22/slow/a-photographer-who-tinkers-with-time", "via": "", "real_tags": ["摄影", "叮当作响", "tinkers", "速度"]}, {"category": "", "categoryclass": "", "imagename": "6ad35de01359df1b430106d0e8053c66.jpg", "infoid": 1001660, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "包括YouTube、Vimeo和Facebook在内的社交媒体公司正在删除一段病毒式阴谋论视频，因为该视频声称是关于冠状病毒大流行的。\n这段大约26分钟的视频被作为一部名为“Plandhemic”的全长电影的极长“预告片”呈现，并对朱迪·米科维茨(Judy Mikovits)进行了长时间的采访。朱迪是反疫苗运动中的知名人物，曾就疫苗的效果发表过各种不可信的说法。\nYouTube的一位发言人说，该公司删除了“包括未经医学证实的冠状病毒诊断建议的内容”，其中包括“Plandhemic”视频。Facebook的一名代表说，“暗示戴口罩会让你生病，可能会导致迫在眉睫的伤害，所以我们删除了这段视频。”\nVimeo的一位发言人说，该公司“坚定不移地保护我们的平台不受传播有害和误导性健康信息的内容的影响。由于违反了这些政策，我们的信任与安全团队已经删除了相关视频。“。\n推特对“华盛顿邮报”的回应是，米科维茨发布的一条推文分享了她的另一段视频采访，这并不违反其冠状病毒政策，但该公司已经从搜索和趋势部分删除了#腐败瘟疫和#PlandemicMovie标签。\n这段视频错误地声称，亿万富翁帮助传播了冠状病毒，以进一步传播疫苗。它还使用了安东尼·S·福奇(Anthony S.Fuci)在白宫新闻发布会上发言的断章取义的镜头，攻击了国家过敏和传染病研究所所长安东尼·S·福奇(Anthony S.Fuci)的可信度。最后，它提出了毫无根据和危险的说法，即戴口罩是有害的。\n据Digital Trends报道，到它从Facebook上删除时，它已经获得了“180万点击量，包括1.7万条评论和近15万条分享”。\n据邮报采访的多位专家称，阴谋论在全球大流行期间蓬勃发展，部分原因是人类对不确定性感到基本不适。\n心理学家、阴谋论信仰专家迈克·伍德(Mike Wood)说，很多时候，“这些都是从早期的阴谋论中回收来的。”他研究了2016年寨卡病毒爆发期间错误信息的传播。“在大流行中，马上就会有阴谋论说，病毒要么是无害的，要么是会杀死所有人的生物武器，要么是政府提供疫苗会杀死所有人的借口。”\n“Facebook表示，它已经给这些不准确的信息贴上了标签，并降低了它们在用户日常馈送中的排名，”“华盛顿邮报”的托尼·罗姆(Tony Romm)写道，并补充说，Twitter已经“开始引导美国用户搜索与冠状病毒相关的标签，指向疾病控制和预防中心。”\n正如“麻省理工技术评论”(MIT Technology Review)的艾比·奥尔海瑟(Abby Ohlheiser)所写：“随着冠状病毒的流行，YouTube引入了具体的政策，禁止质疑疾病传播或存在的视频，宣传未经证实的治疗方法，或鼓励人们无视官方指导。”", "note_en": "Social media companies including YouTube, Vimeo and Facebook are removing a viral conspiracy theory video because of its claims regarding the  coronavirus pandemic.\n The approximately 26-minute video was presented as an extremely long “trailer” for a full-length film titled “Plandemic” and features an extended interview with  Judy Mikovits, a well-known figure in the anti-vaccination movement who has made  various discredited claims about the effects of vaccines.\n A YouTube spokesperson said the company removes “content that includes medically unsubstantiated diagnostic advice for covid-19,” which includes the “Plandemic” video. A representative for Facebook said, “Suggesting that wearing a mask can make you sick could lead to imminent harm, so we’re removing the video.”\n  A Vimeo spokesperson said the company “stands firm in keeping our platform safe from content that spreads harmful and misleading health information. The video in question has been removed by our Trust &amp; Safety team for violating these very policies.”\n  Twitter responded to The Washington Post by stating that a tweet from Mikovits sharing a different video interview of hers does not violate its covid-19 policy but that the company has removed the hashtags #PlagueofCorruption and #PlandemicMovie from its searches and trends sections.\n The video makes the false claim that billionaires aided in the spread of the coronavirus to further the spread of vaccines. It also attacks the credibility of Anthony S. Fauci, director of the National Institute of Allergy and Infectious Diseases, by using out-of-context footage of him speaking at White House news briefings. Finally, it makes the baseless and dangerous claim that wearings masks is harmful.\n   By the time it was removed from Facebook, it had racked up “1.8 million views, including 17,000 comments and nearly 150,000 shares,” Digital Trends  reported.\n  Conspiracy theories have flourished during the global pandemic, partially because of basic human discomfort with uncertainty, according to  various experts interviewed by The Post.\n  Many times, “these are recycled from earlier conspiracy theories,” said Mike Wood, a psychologist and expert on belief in conspiracy theories, who studied the spread of misinformation during the Zika outbreak in 2016. “In a pandemic, there’s immediately going to be conspiracy theories that the virus is either harmless, a bioweapon that’s going to kill everybody or an excuse for the government to give a vaccine that is going to kill everybody.”\n   “Facebook said it has labeled the inaccuracies and lowered their rank in users’ daily feeds,”  wrote The Post’s Tony Romm, adding that Twitter has “started steering U.S. users searching for coronavirus-related hashtags to the  Centers for Disease Control and Prevention.”\n  And as MIT Technology Review’s Abby Ohlheiser  wrote: “As covid-19 took hold, YouTube introduced specific policies prohibiting videos that question the transmission or existence of the disease, promote unsubstantiated cures, or encourage people to ignore official guidance.”", "posttime": "2020-05-11 23:24:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,病毒,阴谋,companies,冠状病毒", "title": "Facebook和其他公司正在删除病毒式的“Plandhemic”阴谋视频", "title_en": "Facebook and other companies are removing viral ‘Plandemic’ conspiracy video", "transed": 1, "url": "https://www.washingtonpost.com/technology/2020/05/07/plandemic-youtube-facebook-vimeo-remove/", "via": "", "real_tags": ["facebook", "病毒", "阴谋", "companies", "冠状病毒"]}]