[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1015837, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇文章最初是作为Twitter上的一条帖子发布的，但我想我应该在这里重新发布它，让它有一个合适的家。\n所以大约一个月前，Tailwind总共破解了1000万台安装量，尽管它的开始并不起眼，但这完全让我震惊。\n我们还将从Tailwind UI获得200万美元的收入，这是我们的第一个商业Tailwind CSS产品，大约在5个月前发布-距离第一个Tailwind CSS发布不到两年。\n下面是故事的开头，趁它还很新鲜，还能记住…。\n早在2015年，我就告诉我现在的商业伙伴史蒂夫·舒格(Steve Schoger)，我有一个副项目想法，想要一个网站，公司可以与他们的团队分享有趣的链接，外部人士可以订阅，看看他们钦佩哪些团队在阅读。\n我们对此非常兴奋，我决定请假一周来建造最初的原型。不过，以经典的开发者方式，我花了整整一周的时间来做关于技术堆栈的决定，最后可能有一整天的时间来真正地破解真正的功能。\n其中一个决定是如何处理CSS。我一直是Bootstrap的铁杆粉丝，但是第一个Bootstrap 4alpha刚刚问世，他们为萨斯丢的钱更少。我恨萨斯！\n在2010年代中期的预处理器大战中，Sass在某种程度上击败了它，但在我看来，Less是更好的语言。它是函数性和声明性的，而不是像Sass那样的过程性和命令性，而且它有一个Sass没有的杀手级特性：作为混合的类。\n您可以看到，在LESS中，任何现有的类都可以自动用作混合。您不需要像在Sass中那样显式定义Mixin。这使您可以轻松地从较小的实用程序类创建较大的类抽象。\n所以不管怎样，回到“文摘”。通常我会使用Bootstrap，但是Sass的事情毁了我的工作。我想继续少用。所以当然，我唯一的选择就是从头开始创作所有的风格。\n我正在构建的是非常受Bootstrap启发的，并且有很多组件类，如BTN、Card-List和Radio-Box。但它也有一组很小的实用程序类。\n(顺便说一句，这就是我们结束的地方，我认为即使在5年后，它看起来仍然相当不错！)。\n无论如何，我们忙于其他项目，对这个想法失去了热情，最终都落到了副项目的坟墓里(就像大多数事情一样)。\n在每个新项目中，我不断地从Digest复制和粘贴更少的文件，并将它们作为起点，根据需要对它们进行自定义，以适应我正在构建的任何新设计。在我们放弃“文摘”之后，我肯定把他们带到了至少4到5个其他项目中。\n当我复制样式时，我注意到一些东西：实用程序(最初是简单的填充和页边距实用程序)不断增长和发展，涵盖越来越多的CSS功能，而组件文件也越来越短。实用程序是唯一真正“可移植”的东西，而组件样式总是太固执己见，不能在另一种设计上重用。\n这就是我真正开始将整个“实用程序优先”的事情确定为一种架构哲学的时候，而不是将实用程序看作是一个有用的小把戏，可以随时随地根据需要在我的HTML上打耳光。\n快进到几年后，史蒂夫和我开始开发KiteTail，这将是一个面向开发人员的、WebHook驱动的结账平台：\n我们当时非常认真地对待这件事，并且-使用旧的Digest样式作为起点-我开始构建它，非常努力地使这些样式尽可能地“与项目无关”。\n你可以看到我在YouTube上构建了大量的应用程序，你可以一直在那里看到所有这些实用程序的风格：\n现在，在这一点上，我没有维护任何类型的开放源码CSS框架的意图。我甚至没有想到我所建造的东西会让任何人感兴趣。但是一条又一条，人们总是在问关于CSS的问题：\n这就是在公共场合工作的好处--如果我没有直播我在另一个被遗弃的副项目上的工作，史蒂夫和我永远不会建立Tailwind Labs业务(该业务在不到两年的时间里已经创造了超过400万美元的收入)。\n不管怎样，最终我想“也许我应该把这个少一点的框架开源？”\n在今晚观看“真实的谎言”的同时，稍微研究一下@kitetailapp less框架，😋认为我会对此进行足够的完善，以开放源码的🤘🏻pic.twitter.com/3Y7xHgMtac。\n-亚当·瓦森(@adamwathan)2017年6月18日\n这个时候，有几个人找到我谈这件事，以防他们能以任何方式与我合作。其中一个人是斯特凡·鲍尔(Stefan Bauer)，如果我没记错的话，他实际上是为Tailwind的响应性实用程序建议使用sm：font-bold而不是sm-font-bold等前缀的人。\n我的好朋友乔纳森·赖因克(Jonathan Reinink)也在这个时候给我发了一条关于框架的消息，说他即将对他的SaaS项目进行一次大的重新设计，并想尝试一下我一直在谈论的疯狂的实用无稽之谈。\n事实证明，这是让框架真正好起来的关键，因为我们的项目有完全不同的设计，未来的Tailwind需要支持这两个项目。这是一个很好的强制功能，使其与项目无关。\n顺便问一下，你的名字叫“尾风”吗？这是因为我希望这个名字能以某种方式与KiteTail联系在一起，因为史蒂夫和我仍在努力推动这个想法，并梦想着有一天它会成为我们经营的这家了不起的公司。我刚在onelook.com上加了“Tail\\*”，看看能不能找到什么很酷的相关词汇。\n回到故事-这是在2017年6/7月左右，在接下来的2-3个月里，乔纳森和我狂热地工作，做一些足够好的东西来开源。\n在这个过程中我面临的一个挑战是，为了让Tailwind成为我想要的可配置的，我必须认真地挑战用更少的资源实现可能的极限，并编写一些真正神秘和可怕的狗屎：\n据我所知，为这类事情编写测试套件并不实际，而且已经到了我甚至不再理解系统的地步，我只能希望并祈祷解决一个问题不会带来另一个问题。\n这可能是在8月中旬，我的朋友David Hemphill建议我使用PostCSS，看看是否可以用JS编写框架。\n我不知道使用PostCSS来构建像Tailwind这样的东西是什么意思(我认为它仅限于autoprefix使用它的那类东西)，但是David告诉了我一些高级技巧，比如使用自定义at-Rule和自定义属性作为“钩子”来插入生成的代码。\n我开始摆弄它，并立即惊讶于我对代码感到如此自信，以及如果有一种适当的编程语言我可以做的令人惊叹的事情。\n(顺便说一句，直到今天，我觉得Tailwind完全是在以一种从未有过的方式滥用PostCSS，我私下相信安德烈·西特尼克每次想到我们对他美丽的图书馆😅所做的事情都会有点畏缩)。\n无论如何，在2017年万圣节之夜，我们正在对第一个版本进行最后的润色，并在最初的文档上全力以赴：\n我们把它搬了出去，获得了大量的积极关注，即使是在v0.1.0中也是如此：\n几天后，Andrew Del Prete撰写了该框架历史上最重要的博客文章之一，向我介绍了PurgeCSS的美妙世界。\n在发布了大约一年的新版本0.x之后，我宣布我将全职使用Tailwind CSS，其中包含了很多很酷的新功能和不断增长的社区。\n我本应该和一个朋友一起开始一个新的SaaS项目，但在重构UI(史蒂夫和我在2018年12月出版的一本书)和Tailwind的增长取得成功后，我知道我会后悔没有进一步推进。\n顺风CSS是到目前为止我参与过的影响力最大的项目--它感觉就像是我在宇宙中留下的印记，而不投入工作来推动它越过那个驼峰的想法让我恶心。\n我很幸运地从重构UI中获得了一大笔资金，我知道有一些方法可以围绕框架本身构建商业产品(主题、UI工具包、课程等等！)。所以我决定试一试。\n我拼命清理东西，并应用我们所学到的知识来组装一个合适的1.0版本，该版本于2019年5月13日发布：\n🚀超级兴奋地宣布，@tawincss v1.0终于发布了！访问网站，给它一个https://t.co/zCaaNls0zp🤙🏻pic.twitter.com/nkpCN8Bq3q。\n-亚当·瓦森(@adamwathan)2019年5月13日。\n在那之后，史蒂夫和我在今年剩下的时间里都在埋头苦干，试图弄清楚“尾风业务”到底会是什么样子。我们原创并抛弃了大量不同的想法，但最终决定追求现在的Tailwind UI。\n这个周末我一直在和@Steveschoger一起计划一个@Tailwind css组件库/工作室项目的原型我认为成百上千个完全响应的专业设计的组件是预先构建的，这样你就可以复制👀并调整以品尝👌🏻的用处了吗？Pic.twitter.com/WobOoMGwxH。\n-亚当·瓦森(@adamwathan)2019年3月30日\n我们在Tailwind UI上不知疲倦地工作了几个月，终于在2020年2月发布了我们的早期访问版本，在我们自己设定的最后期限之前连续工作了36个小时。\n🥳天哪，尾风UI是现场直播！你需要知道的关于提前访问的一切都可以在新的网站👉🏻上找到(还有很多免费的东西可以预览！)。Https://t.co/CX0wtUgwGC。\n-亚当·瓦森(@adamwathan)2020年2月26日。\n它取得了超乎我们想象的成功(下周收入将突破200万美元)，因此我们能够开始组建一支令人惊叹的团队(布拉德·科恩斯、西蒙·弗拉里奥蒂斯和神秘开发者#3)，继续推动Tailwind的未来向前发展。\n从现在开始，事情只会变得更加令人难以置信，我迫不及待地想把我们脑海中浮现的一些想法转化为新的功能、产品和工具，让Tailwind体验在未来几年变得更好。", "note_en": "This was originally posted as a  thread on Twitter, but I thought I&#39;d republish it here to give it a proper home.\n  So about a month or so ago, Tailwind cracked 10 million total installs, which given its humble beginnings, completely blows my mind.\n  We&#39;re also about to cross $2 million in revenue from  Tailwind UI, our first commercial Tailwind CSS product which was released about 5 months ago — a bit under two years after the very first Tailwind CSS release.\n Here’s the story from the beginning, while it’s still fresh enough to remember…\n  Way back in 2015, I told my now-business-partner Steve Schoger about a side-project idea I had for a site where companies could share interesting links with their team, and outsiders could subscribe to see what teams they admired were reading.\n   We were pretty excited about it, and I decided to take a week off work to build the initial prototype. In classic developer fashion though, I spent the entire week making decisions about the tech stack, and had maybe one full day at the end to actually hack on the real functionality.\n One of those decisions was what to do about the CSS. I’d always been a big Bootstrap fan, but the first Bootstrap 4 alpha had just come out and they had dropped Less for Sass. I hated Sass!\n Sass had sort of beat out Less in the preprocessor wars of the mid-2010s, but in my opinion Less was the nicer language. It was functional and declarative, rather than procedural and imperative like Sass, and it had one killer feature Sass didn’t have:  classes as mixins.\n You see in Less, any existing class could automatically be used as a mixin. You didn’t need to explicitly define a mixin like you did in Sass. This let you easily create larger class abstractions out of smaller utility classes.\n   So anyways, back to Digest. Normally I would’ve used Bootstrap, but the Sass thing killed it for me. I wanted to keep using Less. So of course my only choice was to author all of the styles from scratch.\n  What I was building was very Bootstrap-inspired, and had lots of component classes like  btn,  card-list, and  radio-box. But it also had  this small set of utility classes.\n (Here’s where we kind of ended up by the way, I think it still looks pretty good even 5 years later!)\n  Anyways, we got busy with other projects, lost enthusiasm for this idea, and ultimately it all landed in the side-project graveyard (as most things do).\n  On every new project, I kept copying and pasting all the Less files from Digest and using them as a starting point, customizing them as necessary to suit whatever new design I was building. I must have brought them across to at least 4 or 5 other projects after we abandoned Digest.\n I noticed something as I copied the styles across though: the utilities (which started as simple padding and margin utilities) kept growing and evolving, covering more and more CSS features, while the components files kept getting shorter and shorter. The utilities were the only things that were truly “portable”, while the component styles were always too opinionated to reuse on another design.\n This is when I really started to identify the whole “utility-first” thing as an architectural philosophy, rather than seeing utilities as being just a useful bag of tricks to slap in my HTML here and there as needed.\n  Fast-forward a few years later and Steve and I started working on  KiteTail, which was going to be a developer-focused, webhook-driven checkout platform:\n  We were taking this one pretty seriously at the time, and — using those old Digest styles as a starting point — I started building the thing, trying very hard to make the styles as “project-agnostic” as possible.\n You can watch me build a ton of the app on YouTube, and you can see all these utility styles in there the whole time:\n  Now at this point I had  zero intention of maintaining any sort of open-source CSS framework. It didn’t even occur to me that what I had been building would even be interesting to anyone. But stream after stream, people were always asking about the CSS:\n  This is the benefit of working in public — Steve and I would have never built this Tailwind Labs business  (which has now done over $4m in revenue in under 2 years) if I hadn’t been live-streaming my work on yet-another-abandoned-side-project.\n Anyways, eventually I thought “maybe I’ll open-source this little Less framework?”\n Working on the  @kitetailapp Less framework a bit while watching True Lies tonight 😋 Think I&#39;m going to polish this enough to open source 🤘🏻  pic.twitter.com/3Y7xHgMtac\n— Adam Wathan (@adamwathan)  June 18, 2017\n  A few people reached out to me about it around this time in case they could collaborate on it with me in any way. One of these people was  Stefan Bauer, who if I remember right actually was the person to suggest prefixes like  sm:font-bold instead of  sm-font-bold for Tailwind&#39;s responsive utilities.\n My good friend  Jonathan Reinink also messaged me about the framework around this time, saying he was about to do a big redesign of his SaaS project and wanted to try this crazy utility nonsense I had been blabbering about.\n This turned out to be key for making the framework actually good, because our projects had completely different designs, and what-would-become-Tailwind needed to support both of those projects. This was a great forcing function for making it project-agnostic.\n By the way, the name Tailwind? It came from me wanting the name to be tied back to KiteTail in some way, since Steve and I were still pushing hard on that idea, and had dreams of it being this awesome company we’d run one day. I just threw  “tail\\*” into  onelook.com to see if I could find any cool related words.\n Back to the story — this was around June/July 2017, and for the next 2-3 months, Jonathan and I worked feverishly on making something that was good enough to open-source.\n One of the challenges I faced during this process was that in order to make Tailwind as configurable as I wanted, I had to seriously push the boundaries of what was possible with Less, and write some truly cryptic and horrific shit:\n  Writing a test suite for this sort of thing was not really practical as far as I could figure, and it was getting to the point where I didn’t even understand the system anymore and just had to hope and pray that solving one problem didn’t introduce another.\n This was maybe mid-August, and my friend  David Hemphill suggested I mess around with  PostCSS and see if I could write the framework in JS.\n I had no idea what it meant to use PostCSS to build something like Tailwind (I thought it was limited to the sort of things  autoprefixer uses it for), but David clued me in to some high-level tricks, like using custom at-rules and custom properties as “hooks” to insert generated code.\n I started messing around with it and was immediately amazed by how much more confident I felt in the code, and the amazing things I could do given a proper programming language.\n   (By the way, to this day I feel like Tailwind is completely abusing PostCSS in a way it was never intended, and I secretly believe  Andrey Sitnik cringes a little bit every time he thinks about what we’ve done with his beautiful library 😅)\n Anyways, on Halloween night 2017 we were putting the finishing touches on the first release, and cranking our asses off on the initial documentation:\n  We got it out the door and had tons of positive attention, even for v0.1.0:\n  A few days later,  Andrew Del Prete wrote what would be one of the most important blog posts in the history of the framework, introducing me to the wonderful world of PurgeCSS.\n  After about a year of new v0.x releases with lots of cool new features and a growing community,  I announced I was going to go full-time on Tailwind CSS.\n  I was supposed to be starting on a new SaaS project with a friend, but after the success of  Refactoring UI  (a book Steve and I had released in December 2018) and the growth of Tailwind, I knew I would regret not pushing it further.\n Tailwind CSS is by far the highest impact project I’ve ever worked on — it felt like it was  this close to being my &#34;dent in the universe&#34;, and the idea of not putting in the work to push it over that hump made me sick.\n I was lucky enough to have a big bankroll from Refactoring UI, and I knew there were ways to build commercial offerings around the framework itself  (themes, UI kits, courses, something!) so I decided to go for it.\n I busted my ass cleaning things up and applying what we’d learned to put together a proper v1.0 release, which came out on May 13, 2019:\n 🚀 Super excited to announce that  @tailwindcss v1.0 is finally out!  Head over to the website and give it a spin 🤙🏻 https://t.co/zCaaNls0zp  pic.twitter.com/NkpCN8Bq3q\n— Adam Wathan (@adamwathan)  May 13, 2019\n After that, Steve and I went heads down for the rest of the year trying to figure out what on earth “Tailwind the business” was going to be. We prototyped and discarded tons of different ideas, but eventually decided to pursue what is now Tailwind UI.\n  Been prototyping a  @tailwindcss component gallery/studio project I&#39;ve been planning with  @steveschoger this weekend 👀  Think hundreds and hundreds of fully responsive professionally designed components, pre-built so you can just copy the HTML and tweak to taste 👌🏻  Useful?  pic.twitter.com/WobOoMGwxH\n— Adam Wathan (@adamwathan)  March 30, 2019\n We worked tirelessly on Tailwind UI for months, and finally got our early access release out the door in February 2020, after working literally 36 hours straight before our self-imposed deadline.\n 🥳 Holy crap Tailwind UI is live!  Everything you need to know about getting early access is on the new website 👉🏻  (Lots of free stuff to preview too!) https://t.co/CX0wtUgwGC\n— Adam Wathan (@adamwathan)  February 26, 2020\n It has been successful beyond our wildest dreams  (going to cross $2m in revenue next week), and as a result we’ve been able to start building an amazing team ( Brad Cornes,  Simon Vrachliotis and  mystery developer #3) to keep pushing the future of Tailwind forward.\n Things are only going to get more incredible from here, and I can’t wait to turn some of the ideas rolling around our heads into new features, products, and tools to make the Tailwind experience even better over the coming years.", "posttime": "2020-08-03 09:49:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "css,tailwind", "title": "顺风CSS：从副产品到数百万美元的业务", "title_en": "Tailwind CSS: From Side-Project Byproduct to Multi-Million Dollar Business", "transed": 1, "url": "https://adamwathan.me/tailwindcss-from-side-project-byproduct-to-multi-mullion-dollar-business/", "via": "", "real_tags": ["css", "tailwind"]}, {"category": "", "categoryclass": "", "imagename": "4a3c99b508ffd89bf8d4ce0654a9d03e.jpg", "infoid": 1015836, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "莫斯科-对男孩们来说，这只是一种甜蜜的款待。对于他们的父母，著名的医学研究人员来说，1959年那天在他们莫斯科的公寓里发生的事情是一次至关重要的实验，无数人的生命岌岌可危-他们自己的孩子就像豚鼠一样。\n“我们排成了一条线，”彼特·朱马科夫博士在接受采访时回忆道，当时他只有7岁。在每个等待的嘴里，一位家长突然拿出一块掺有减弱的脊髓灰质炎病毒的方糖-一种针对一种可怕疾病的早期疫苗。“我是从我母亲手中吃的。”\n如今，同样的疫苗再次受到研究人员的关注--其中包括长大后都成了病毒学家的兄弟们--作为对抗新型冠状病毒的可能武器，这在一定程度上是基于他们的母亲玛丽娜·沃罗希洛娃(Marina Voroshilova)博士所做的研究。\n沃罗希洛娃博士证实，脊髓灰质炎活疫苗有一个意想不到的好处，事实证明，这可能与当前的大流行有关：接种疫苗的人在接种疫苗后一个月左右的时间里没有患上其他病毒性疾病。她开始每年秋天给男孩们接种脊髓灰质炎疫苗，以预防流感。\n现在，几个国家的一些科学家正对改变现有疫苗的用途产生浓厚兴趣，比如一种活的脊髓灰质炎病毒疫苗和另一种结核病疫苗，看看它们是否能至少提供对冠状病毒的暂时抵抗力。俄罗斯人就是其中之一，他们借鉴了疫苗研究的悠久历史-以及研究人员的悠久历史，他们并不担心被嘲笑为疯狂的科学家，在自己身上进行实验。\n专家建议，这个想法-就像许多其他提出的应对大流行的方法一样-必须非常谨慎地对待。\n宾夕法尼亚大学佩雷尔曼医学院(Perelman School Of Medicine At The University Of Pennsylvania)教授、轮状病毒疫苗的共同发明人保罗·A·奥菲特(Paul A.Offit)博士在接受电话采访时说，“有了一种能诱导特定免疫力的疫苗，我们的日子会好得多。”他说，与定制疫苗相比，改变用途的疫苗带来的任何好处都“寿命短得多，而且不完整”。\n不过，罗伯特·加洛(Robert Gallo)博士是测试脊髓灰质炎疫苗对抗冠状病毒的主要倡导者之一，他说，重新调整疫苗的用途是“免疫学中最热门的领域之一”。马里兰大学医学院(University Of Marland School Of Medicine)人类病毒学研究所(Institute Of Human Virroology At The University Of Marland School Of Medicine)所长加洛博士说，即使减弱的脊髓灰质炎病毒只有一个月左右的免疫力，“它也能帮你渡过难关，而且会拯救很多人的生命。”\n数十亿人接种了脊髓灰质炎病毒活疫苗，几乎消灭了这种疾病。然而，在极其罕见的情况下，疫苗中使用的弱化病毒可能会变异成更危险的形式，导致脊髓灰质炎并感染其他人。据估计，瘫痪的风险为270万疫苗中就有一例。\n出于这些原因，公共卫生组织表示，一旦一个地区消除了自然发生的脊髓灰质炎，就必须停止常规使用口服疫苗，就像美国20年前所做的那样。\n本月，美国国家过敏和传染病研究所推迟了由加洛博士的研究所、克利夫兰诊所、布法罗大学和罗斯威尔公园综合癌症中心设计的一项研究，该研究以医护人员为对象，测试脊髓灰质炎活疫苗对抗冠状病毒的有效性。据熟悉这项研究应用的研究人员说，该机构提出了安全方面的担忧，包括活的脊髓灰质炎病毒进入供水系统并感染其他人的可能性。NI.A.I.D.的新闻办公室拒绝置评。\n但其他国家正在向前迈进。脊髓灰质炎疫苗的试验已经在俄罗斯开始，并计划在伊朗和几内亚比绍进行。\n针对冠状病毒的特定疫苗将训练免疫系统以特定的病毒为目标，世界各地正在开发超过125种候选疫苗。\n相比之下，改变用途的疫苗使用活的但减弱的病毒或细菌来刺激更广泛的先天免疫系统，以对抗病原体，至少是暂时的。\n第一种脊髓灰质炎疫苗是由美国人乔纳斯·索尔克博士开发的，它使用了“灭活”病毒颗粒--灭活的病毒颗粒。它必须注射，这是较贫穷国家开展免疫活动的障碍。\n1955年，当这种疫苗被广泛引入时，阿尔伯特·萨宾(Albert Sabin)博士正在测试一种使用活的但减毒的脊髓灰质炎病毒的疫苗，这种病毒可以口服。但在美国，由于Salk疫苗已经在使用，当局不愿承担进行活病毒试验的感知风险。\n萨宾将他的三种减毒病毒株交给了苏联一对已婚的病毒学家，米哈伊尔·楚马科夫(Mikhail Chumakov)博士和沃罗希洛娃(Voroshilova)博士。朱马科夫博士是一家脊髓灰质炎研究所的创始人，现在以他的名字命名。\n朱马科夫博士自己接种了疫苗，但一种主要针对儿童的药物需要儿童试验对象，所以他和沃罗希洛娃博士给了他们的三个儿子和几个侄女和侄子。\n他们的实验使朱马科夫博士能够说服苏联高级官员阿纳斯塔斯·米科扬(Anastas Mikoyan)继续进行更广泛的试验，最终导致了一种在世界各地使用的口服脊髓灰质炎疫苗的大规模生产。1961年，在苏联证明口服脊髓灰质炎疫苗是安全的后，美国开始接种脊髓灰质炎疫苗。\n“必须有人是第一个，”彼得·朱马科夫博士在一次采访中说。“我从来没有生气过。我觉得有这样一位父亲是非常好的，他足够自信自己所做的事情是正确的，并且肯定不会伤害自己的孩子。“。\n他说，如果说有什么不同的话，那就是他的母亲对对男孩进行测试更加热情。\n“她绝对相信没什么好怕的，”他说。\n一个典型的健康儿童是十几种呼吸道病毒的宿主，这些病毒几乎不会引起疾病，或者根本不会引起疾病。但Voroshilova博士在儿童接种脊髓灰质炎疫苗后不久就没有在他们身上发现任何一种。\n全国各地的科学家试图找出过滤微细颗粒物效果很好的日常材料。在最近的测试中，HEPA炉过滤器得分很高，真空吸尘器袋、类似法兰绒睡衣的布料以及600支枕套的得分也很高。测试的其他材料包括分层的咖啡过滤器、围巾和头巾。这些粒子得分较低，但仍捕获了一小部分粒子。\n英国运动医学杂志(British Journal Of Sports Medicine)网站本月发表的一篇评论文章指出，运动时遮住脸“会带来潜在的呼吸受限和不适问题”，需要“权衡益处和可能的不良事件”。美国运动理事会(American Council On Exercise)主席兼首席科学官塞德里克·X·布莱恩特(Cedric X.Bryant)说，口罩确实会改变运动。美国运动理事会是一个非营利性组织，为运动研究提供资金，并为健身专业人士提供认证。“根据我的个人经验，”他说，“当你戴上口罩时，心率会在相同的相对强度下更高。”新墨西哥大学运动科学教授Len Kravitz说，有些人在戴着面具进行熟悉的锻炼时也会感到头晕目眩。\n根据英国科学家的说法，类固醇地塞米松是第一种被证明可以降低重病患者死亡率的治疗方法。这种药物似乎可以减少免疫系统引起的炎症，保护组织。在这项研究中，地塞米松使使用呼吸机的患者的死亡人数减少了三分之一，使用氧气的患者的死亡人数减少了五分之一。\n冠状病毒紧急救援方案给了许多美国工人带薪假期，如果他们因为病毒需要休假的话。它给合格的工人两周的带薪病假，如果他们生病，被隔离，或者寻求冠状病毒的诊断或预防性护理，或者如果他们正在照顾生病的家庭成员。它给那些照顾孩子的人12周的带薪假期，这些孩子的学校关闭了，或者因为冠状病毒而无法提供托儿服务。这是美国第一次有广泛的联邦授权带薪休假，包括通常不会获得这种福利的人，比如兼职和零工经济工作者。但这项措施至少排除了一半的私营部门员工，包括美国最大雇主的员工，并给予小雇主拒绝休假的巨大回旋余地。\n到目前为止，证据似乎表明确实如此。4月份发表的一篇被广泛引用的论文表明，人们在冠状病毒症状出现前两天左右传染性最强，并估计44%的新感染是由于尚未显示出症状的人传播的。最近，世界卫生组织的一位顶级专家表示，没有症状的人传播冠状病毒的情况“非常罕见”，但她后来收回了这一说法。\n接触受污染的物体，然后将细菌感染我们自己，这并不是典型的病毒传播方式。但这是有可能发生的。对流感、鼻病毒、冠状病毒和其他微生物的多项研究表明，包括新型冠状病毒在内的呼吸道疾病可以通过接触受污染的表面传播，特别是在日托中心、办公室和医院等地方。但是，要让这种疾病以这种方式传播，必须发生一系列漫长的事件。保护自己免受冠状病毒感染的最好方法--无论是表面传播还是密切的人类接触--仍然是社交距离、洗手、不碰脸和戴口罩。\n欧洲科学家的一项研究首次证明了基因变异和新冠肺炎(冠状病毒引起的疾病)之间存在强烈的统计联系。根据这项新的研究，拥有A型血的患者需要氧气或使用呼吸机的可能性增加了50%。\n美国劳工部6月5日表示，5月失业率降至13.3%，这是美国就业市场的意外改善，因为就业反弹的速度快于经济学家的预期。4月份失业率达到14.7%，是二战后政府开始记录官方统计数据以来的最高水平，经济学家此前预测失业率将增加到20%。但失业率反而下降，雇主在4月份失去了2000多万个工作岗位后，又增加了250万个工作岗位。\n常见症状包括发烧、干咳、疲劳、呼吸困难或呼吸急促。这些症状中的一些与流感的症状重叠，使检测变得困难，但流鼻涕和鼻窦堵塞不太常见。疾控中心还增加了寒战、肌肉疼痛、喉咙痛、头痛和新的味觉或嗅觉丧失作为要注意的症状。大多数人在接触后五到七天就会生病，但症状可能会在短短两天或长达14天内出现。\n如果航空旅行是不可避免的，你可以采取一些措施来保护自己。最重要的是：勤洗手，不要再摸你的脸。如果可能的话，选择靠窗的座位。埃默里大学的一项研究发现，在流感季节，坐在飞机上最安全的地方是靠窗的，因为坐在靠窗座位的人与可能生病的人接触较少。对坚硬的表面进行消毒。当你坐到座位上，双手干净后，用消毒湿巾清洁座椅的硬表面，如头枕和扶手、安全带扣、遥控器、屏幕、座椅靠背口袋和托盘桌子。如果座椅很硬，不透气，或者是皮革或人造革的，你也可以把它擦干净。(在软垫座椅上使用湿巾可能会导致座椅湿润，传播细菌，而不是杀死他们。)。\n如果你接触过冠状病毒或认为自己感染了冠状病毒，并出现发烧或咳嗽或呼吸困难等症状，请打电话给医生。他们应该就你是否应该接受检测，如何检测，以及如何在不潜在感染或暴露他人的情况下求医给你提供建议。\n在沃罗希洛娃博士的监督下，从1968年到1975年，苏联进行了一项涉及32万人的大型研究，发现接种了其他疫苗(包括口服脊髓灰质炎疫苗)的人的流感死亡率有所降低。\n她在苏联赢得了认可，因为她展示了疫苗接种和对病毒性疾病的广泛保护之间的联系，可能是通过刺激免疫系统。\nVoroshilova博士和Chumakov博士的工作显然影响了他们儿子的思想和健康--他们不仅都成为了病毒学家，还接受了自我检测。\n今天的彼得·朱马科夫博士是俄罗斯科学院恩格尔哈特分子生物学研究所的首席科学家，也是克利夫兰一家用病毒治疗癌症的公司的联合创始人。他已经开发了大约25种用于治疗肿瘤的病毒-他说，所有这些病毒他都在自己身上进行了测试。\n他现在还在服用他在自己的实验室种植的脊髓灰质炎疫苗，作为对冠状病毒的可能保护。\n阿列克谢·朱马科夫(Alexei Chumakov)博士在他的父母用他的兄弟做实验时还没有出生，他职业生涯的大部分时间都在洛杉矶雪松-西奈大学(Cedars-Sinai)担任癌症研究人员。在莫斯科工作期间，他开发了一种戊型肝炎疫苗，并首先在自己身上进行了试验。\n“这是一个古老的传统，”他说。“当第一个重载通过时，工程师应该站在桥下。”\n康斯坦丁·朱马科夫(Konstantin Chumakov)博士是美国食品和药物管理局疫苗研究和审查办公室的副主任，该办公室将参与批准任何冠状病毒疫苗在美国人使用。他还与加洛博士等人合著了最近发表在“科学”杂志上的一篇文章，这篇文章促进了对现有疫苗再利用的研究。\n在一次采访中，康斯坦丁·楚马科夫博士说，他不记得在1959年吃过方糖--当时他只有5岁--但他赞同父母的实验，认为这是拯救无数瘫痪儿童的一步。\n“这是正确的做法，”他说。“现在，会有一些问题，比如‘你得到道德委员会的许可了吗？’”", "note_en": "MOSCOW — To the boys, it was just a sugary treat. To their parents, prominent medical researchers, what happened in their Moscow apartment that day in 1959 was a vital experiment with countless lives at stake — and their own children as guinea pigs.\n “We formed a kind of line,” Dr. Peter Chumakov, who was 7 at the time, recalled in an interview. Into each waiting mouth, a parent popped a sugar cube laced with weakened poliovirus — an early vaccine against a dreaded disease. “I was eating it from the hands of my mother.”\n Today, that same vaccine is gaining renewed attention from researchers — including those brothers, who all grew up to be virologists — as a possible weapon against the new coronavirus, based in part on research done by their mother, Dr. Marina Voroshilova.\n Dr. Voroshilova established that the live polio vaccine had an unexpected benefit that, it turns out, could be relevant to the current pandemic: People who got the vaccine did not become sick with other viral illnesses for a month or so afterward. She took to giving the boys polio vaccine each fall, as protection against flu.\n Now, some scientists in several countries are taking a keen interest in the idea of repurposing existing vaccines, like the one with live poliovirus and  another for tuberculosis, to see if they can provide at least temporary resistance to the coronavirus. Russians are among them, drawing on a long history of vaccine research — and of researchers, unconcerned about being scoffed at as mad scientists, experimenting on themselves.\n  Experts advise that the idea — like many other proposed ways of attacking the pandemic — must be approached with great caution.\n “We are much better off with a vaccine that induces specific immunity,” Dr. Paul A. Offit, a co-inventor of a vaccine against the rotavirus and professor at the Perelman School of Medicine at the University of Pennsylvania, said in a telephone interview. Any benefits from a repurposed vaccine, he said, are “much shorter lived and incomplete,” compared with a tailored vaccine.\n Still, Dr. Robert Gallo, a leading advocate of testing the polio vaccine against coronavirus, said that repurposing vaccines is “one of the hottest areas of immunology.” Dr. Gallo, director of the Institute of Human Virology at the University of Maryland School of Medicine, said that even if the weakened poliovirus confers immunity for only a month or so, “it gets you over the hump, and it would save a lot of lives.”\n Billions of people have taken live poliovirus vaccine, nearly eradicating the disease. However, in extremely rare cases, the weakened virus used in the vaccine can mutate into a more dangerous form, cause polio and infect other people. The risk of paralysis is estimated at one in 2.7 million vaccinations.\n  For those reasons, public health organizations say that once a region eliminates naturally occurring polio, it must  stop routine use of oral vaccine, as the United States did 20 years ago.\n And this month, the National Institute of Allergy and Infectious Diseases delayed a study designed by Dr. Gallo’s institute, the Cleveland Clinic, the University of Buffalo and Roswell Park Comprehensive Cancer Center to test the effectiveness of live polio vaccine against coronavirus, using health care workers as subjects. The agency raised safety concerns, including the chance of live poliovirus making its way into water supplies and infecting others, according to researchers familiar with the study application. The press office of the N.I.A.I.D. declined to comment.\n But other countries are moving ahead. Trials with the polio vaccine  have begun in Russia, and are planned in Iran and Guinea-Bissau.\n  A specific vaccine for the coronavirus would be one that trains the immune system to target that virus specifically, and more than  125 vaccine candidates are under development around the world.\n Repurposed vaccines, in contrast, use live but weakened viruses or bacteria to stimulate the innate immune system more broadly to fight pathogens, at least temporarily.\n The first polio vaccine, developed by Dr. Jonas Salk, an American, used “inactivated” virus — particles of killed virus. It had to be injected, an obstacle to immunization campaigns in poorer countries.\n When that vaccine was widely introduced in 1955, Dr. Albert Sabin was testing a vaccine using live but attenuated poliovirus, which could be taken orally. But in the United States, with the Salk vaccine already in use, the authorities were reluctant to take the perceived risk of conducting live-virus trials.\n Dr. Sabin gave his three strains of attenuated virus to a married pair of virologists in the Soviet Union, Dr. Mikhail Chumakov, the founder of a polio research institute that now bears his name, and Dr. Voroshilova.\n Dr. Chumakov vaccinated himself, but a medicine intended primarily for children needed child test subjects, so he and Dr. Voroshilova gave it to their three sons and several nieces and nephews.\n Their experiment enabled Dr. Chumakov to persuade a senior Soviet official, Anastas Mikoyan, to proceed with wider trials, eventually leading to the mass production of an oral polio vaccine used around the world. The United States began oral polio vaccinations in 1961 after it was proved safe in the Soviet Union.\n  “Somebody has to be the first,” Dr. Peter Chumakov said in an interview. “I was never angry. I think it was very good to have such a father, who is confident enough that what he is doing is right and is sure he will not harm his children.”\n His mother was, if anything, even more enthusiastic about running the tests on the boys, he said.\n “She was absolutely sure there was nothing to be scared of,” he said.\n  A typical healthy child is host to a dozen or so respiratory viruses that cause little or no illness. But Dr. Voroshilova could not find any of them in children soon after they were immunized against polio.\n Scientists around the country  have tried to identify everyday materials that do a good job of filtering microscopic particles. In recent tests, HEPA  furnace filters scored high, as did vacuum cleaner bags, fabric similar to flannel pajamas and those of 600-count pillowcases. Other materials tested included layered coffee filters and scarves and bandannas. These scored lower, but still captured a small percentage of particles.\n  A  commentary published this month on the website of the British Journal of Sports Medicine points out that covering your face during exercise “comes with issues of potential breathing restriction and discomfort” and requires “balancing benefits versus possible adverse events.”  Masks do alter exercise, says Cedric X. Bryant, the president and chief science officer of the American Council on Exercise, a nonprofit organization that funds exercise research and certifies fitness professionals. “In my personal experience,” he says, “heart rates are higher at the same relative intensity when you wear a mask.” Some people also could experience lightheadedness during familiar workouts while masked, says Len Kravitz, a professor of exercise science at the University of New Mexico.\n  The steroid, dexamethasone, is  the first  treatment shown to reduce mortality in severely ill patients, according to scientists in Britain. The drug appears to reduce inflammation caused by the immune system, protecting the tissues. In the study, dexamethasone reduced deaths of patients on ventilators by one-third, and deaths of patients on oxygen by one-fifth.\n  The coronavirus emergency relief package gives many American workers paid leave if they need to take time off because of the virus. It gives qualified workers two weeks of paid sick leave if they are ill, quarantined or seeking diagnosis or preventive care for coronavirus, or if they are caring for sick family members. It gives 12 weeks of paid leave to people caring for children whose schools are closed or whose child care provider is unavailable because of the coronavirus.  It is the first time the United States has had widespread federally mandated paid leave, and includes people who don’t typically get such benefits, like part-time and gig economy workers. But  the measure excludes at least half of private-sector workers, including those at the country’s largest employers, and gives small employers significant leeway to deny leave.\n  So far, the evidence seems to show it does. A widely cited  paper published in April suggests that people are most infectious about two days before the onset of coronavirus symptoms and estimated that 44 percent of new infections were a result of transmission from people who were not yet showing symptoms. Recently, a top expert at the World Health Organization stated that transmission of the coronavirus by people who did not have symptoms was “very rare,”  but she later walked back that statement.\n  Touching contaminated objects and then infecting ourselves with the germs is not typically how the virus spreads. But it can happen. A number  of studies of flu, rhinovirus, coronavirus and other microbes have shown that respiratory illnesses, including the new coronavirus, can spread by touching contaminated surfaces, particularly in places like day care centers, offices and  hospitals. But a long chain of events has to happen for the disease to spread that way. The best way to protect yourself from coronavirus — whether it’s surface transmission or close human contact — is still social distancing, washing your hands, not touching your face and wearing masks.\n  A study by European scientists is the first to document a strong statistical link between  genetic variations and Covid-19, the illness caused by the coronavirus.  Having Type A blood was linked to a 50 percent increase in the likelihood that a patient would need to get oxygen or to go on a ventilator, according to the new study.\n  The unemployment rate fell to 13.3 percent in May, the Labor Department said on June 5, an unexpected improvement in the nation’s job market as hiring rebounded faster than economists expected. Economists had forecast the unemployment rate to increase to as much as 20 percent, after it hit 14.7 percent in April, which was the highest since the government began keeping official statistics after World War II. But the unemployment rate dipped instead, with employers adding 2.5 million jobs, after more than 20 million jobs were lost in April.\n  Common symptoms  include fever, a dry cough, fatigue and difficulty breathing or shortness of breath. Some of these symptoms overlap with those of the flu, making detection difficult, but runny noses and stuffy sinuses are less common.  The C.D.C. has also added chills, muscle pain, sore throat, headache and a new loss of the sense of taste or smell as symptoms to look out for. Most people fall ill five to seven days after exposure, but symptoms may appear in as few as two days or as many as 14 days.\n  If air travel is unavoidable,  there are some steps you can take to protect yourself. Most important: Wash your hands often, and stop touching your face. If possible, choose a window seat. A  study from Emory University found that during flu season, the safest place to sit on a plane is by a window, as people sitting in window seats had less contact with potentially sick people. Disinfect hard surfaces. When you get to your seat and your hands are clean, use disinfecting wipes to clean the hard surfaces at your seat like the head and arm rest, the seatbelt buckle, the remote, screen, seat back pocket and the tray table. If the seat is hard and nonporous or leather or pleather, you can wipe that down, too. (Using wipes on upholstered seats could lead to a wet seat and spreading of germs rather than killing them.)\n  If you’ve been exposed to the coronavirus or think you have, and have a fever or symptoms like a cough or difficulty breathing, call a doctor. They should give you advice on whether you should be tested, how to get tested, and how to seek medical treatment without potentially infecting or exposing others.\n A huge study in the Soviet Union of 320,000 people, from 1968 to 1975, overseen by Dr. Voroshilova, found reduced mortality from flu in people immunized with other vaccines, including the oral polio vaccine.\n She won recognition in the Soviet Union for demonstrating a link between vaccinations and broad protection against viral diseases, likely by stimulating the immune system.\n Dr. Voroshilova’s and Dr. Chumakov’s work clearly influenced their sons’ minds as well as their health — not only did all of them become virologists, they embraced self-testing as well.\n  Dr. Peter Chumakov today is the chief scientist at the Engelhardt Institute of Molecular Biology at the Russian Academy of Sciences and co-founder of a company in Cleveland that treats cancer with viruses. He has developed about 25 viruses for use against tumors — all of which, he said, he has tested on himself.\n He is also now taking polio vaccine, which he grows in his own laboratory, as possible protection against coronavirus.\n  Dr. Alexei Chumakov, who was not yet born when his parents experimented on his brothers, worked as a cancer researcher at Cedars-Sinai in Los Angeles for much of his career. While working in Moscow, he developed a vaccine against hepatitis E, which he tested first on himself.\n “It’s an old tradition,” he said. “The engineer should stand under the bridge when the first heavy load goes over.”\n Dr. Konstantin Chumakov is an associate director of the U.S. Food and Drug Administration’s Office of Vaccine Research and Review, which would be involved in approving any coronavirus vaccines for use in Americans. He is also a co-author, with Dr. Gallo and others, of a recent article in  the journal Science that promotes research into repurposing existing vaccines.\n In an interview, Dr. Konstantin Chumakov said he cannot remember eating the sugar cube back in 1959 — he was 5 years old — but approved of his parents’ experiment as a step toward saving untold numbers of children from paralysis.\n “It was the right thing to do,” he said. “Now, there would be questions, like ‘Did you get permission from the ethics committee?’”", "posttime": "2020-08-03 09:48:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,苏联,病毒,冠状病毒,研究", "title": "几十年前的苏联研究暗示冠状病毒战略", "title_en": "Decades-Old Soviet Studies Hint at Coronavirus Strategy", "transed": 1, "url": "https://www.nytimes.com/2020/06/24/world/europe/vaccine-repurposing-polio-coronavirus.html", "via": "", "real_tags": ["苏联", "病毒", "冠状病毒", "研究"]}, {"category": "", "categoryclass": "", "imagename": "3935998bd19657341395440d81acbcbe.jpg", "infoid": 1015833, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周在网上发生了一件有趣的事情。美国旅行管理公司遭到Ragnar Locker勒索软件攻击。该公司同意支付，并移交了450万美元的比特币reut.rs/3jXvpRY。\n但是，赎金谈判的在线聊天室被留在了网上，给了我们一个罕见的、“令人难以置信的”有趣的洞察力，让人了解这些事情实际上是如何进行的。\n黑客最初要求1000万美元的赎金。随之而来的是大量的讨价还价和关于折扣的讨论。\n就我个人而言，我对整个对话的专业性和合议性感到惊讶。自始至终，这都是一笔双方的商业交易。\n与专业人士合作是一件很愉快的事。最后一条消息是黑客提出要清除聊天内容。它没有被删除。", "note_en": "An interesting thing happened on the internet with week. U.S. travel management firm was hit with Ragnar Locker ransomware. The company agreed to pay and handed over $4.5 mln in bitcoin  reut.rs/3jXvpRY\n But the online chat room where the ransom negotiations took place was left online, giving a rare and *incredibly* interesting insight into how these things actually go down\n The hackers initially demanded a $10 mln ransom. What ensued was lots of haggling and discussion of discounts\n Personally I was surprised at how professional and collegial the whole conversation was. From beginning to end, this was treated a business transaction for both parties\n   &#34;It&#39;s a pleasure to work with professionals.&#34;  One of the last messages is the hackers offering to wipe the contents of the chat. It was not deleted.", "posttime": "2020-08-03 08:59:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,旅游,negotiation,黑客", "title": "美国旅游公司450万美元赎金谈判公开聊天", "title_en": "US Travel firm $4.5m ransom negotiation open chat", "transed": 1, "url": "https://threadreaderapp.com/thread/1289199296328298497.html", "via": "", "real_tags": ["美国", "旅游", "黑客"]}, {"category": "", "categoryclass": "", "imagename": "fb3dc625b78094ddad8d91d83993e3ac.jpg", "infoid": 1015832, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "嗯，看起来时机已经到了。让我向您介绍我在过去几年中一直在从事的项目：Pi-KVM。我开发了软件和一个简单的电路，基于树莓PI创建了一个简单而廉价的IP-KVM。此设备可帮助您远程管理服务器或工作站，而不管操作系统的运行状况如何或是否安装了服务器或工作站。您可以修复任何问题、配置BIOS，甚至重新安装操作系统！\n只需几个部件，您就可以构建支持所有这些功能的IP KVM：\n通过Web UI或VNC访问，能够使用IPMI BMC和局域网唤醒来控制服务器；\n这些部件只需花费30-100美元，您可以在10分钟内下载并安装操作系统。这很简单！如果你不想焊接，你甚至不需要焊接任何东西！", "note_en": "Well, it looks like the time has come. Let me introduce you to the project I&#39;ve been working on for the past few years: Pi-KVM. I developed software and a simple circuit to create a simple and cheap IP-KVM based on the Raspberry Pi. This device helps you to manage servers or workstations remotely, regardless of the health of the operating system or whether one is installed. You can fix any problem, configure the BIOS, and even reinstall the OS!\n  With just a few parts, you can build an IP KVM that will support all these features:\n Access via  Web UI or  VNC, ability to use  IPMI BMC and  Wake-on-LAN to control the server;\n The parts will cost you  only $30-$100, and you can download and install the operating system in ten minutes. It&#39;s simple! You don&#39;t even need to solder anything if you don&#39;t want to!", "posttime": "2020-08-03 08:58:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "kvm,pi", "title": "PI-KVM：带鼠标、虚拟驱动器、VNC和IPMI的简单、廉价的DIY KVM over IP", "title_en": "Pi-KVM: easy and cheap DIY KVM over IP with mouse, virtual drive, VNC and IPMI", "transed": 1, "url": "https://www.reddit.com/r/pikvm/comments/i2mf6h/pikvm_the_cheap_diy_kvm_over_ip_with_mouse_mass/", "via": "", "real_tags": ["kvm", "pi"]}, {"category": "", "categoryclass": "", "imagename": "7af6018e0ebd00137d41e59a02d026e3.jpg", "infoid": 1015831, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "10岁时，他开始玩电子游戏“我的世界”，部分原因是为了逃避他告诉朋友的不愉快的家庭生活。几个朋友说，在“我的世界”中，他以脾气暴躁的老练骗子而闻名，他骗取了人们的钱。\n15岁时，他加入了一个在线黑客论坛。社交媒体和法律记录显示，16岁时，他已经被比特币的世界所吸引，似乎参与了一起价值85.6万美元的比特币失窃案，尽管他从未因此而受到指控。在之后的Instagram帖子中，他穿着名牌运动鞋和一块镶着闪闪发光的劳力士出现在人们面前。\n周五，警方在佛罗里达州坦帕市的一间公寓逮捕了这名少年，结束了他在网上的不当行为。佛罗里达州检察官说，现年17岁的克拉克是上个月一起重大黑客事件的“策划者”，指控他通过欺骗进入Twitter的系统，窃取了一些世界上最有名的人的账户，包括贝拉克·奥巴马(Barack Obama)、坎耶·韦斯特(Kanye West)和杰夫·贝佐斯(Jeff Bezos)。\n他的被捕引发了人们的疑问：这么年轻的人怎么能穿透这家被认为是硅谷最先进的科技公司之一的防御工事。检方称，克拉克曾与其他至少两人一起侵入Twitter，但他是Twitter的头目。目前，克拉克正作为成年人被指控犯有30项重罪。\n数以百万计的青少年玩着和克拉克一样的电子游戏，在同一个在线论坛上互动。但是，在采访了十几个认识他的人，以及法律文件、在线取证工作和社交媒体档案时，出现了一张照片，上面是一个年轻人与家人的关系紧张，一生中的大部分时间都在网上度过，变得善于说服人们给他钱、照片和信息。\n19岁的科尔比·米兹(Colby Meeds)是“我的世界”的前朋友，他说，“我知道他真的很想要钱，但他的心态从来都不正常。”他说克拉克答应给他100美元的账户，但一直没有付清。“为了一些钱，他什么都愿意做。”\n周日，记者从坦帕的希尔斯伯勒县监狱(Hillsborough County Jail)通过一段简短的视频通话联系到了克拉克，他穿着一件黑色无袖衬衫，头发垂到了眼睛里。“你们有什么问题吗？”他问，然后推开椅子挂断了电话。他定于周二在虚拟法庭出庭。\n克拉克和他的妹妹在坦帕和他们的母亲埃米莉亚·克拉克(Emily Iya Clark)一起长大。埃米莉亚·克拉克是一名俄罗斯移民，持有美容师和房地产经纪人的证书。记者联系到她家，他的母亲拒绝置评。根据公开文件，他的父亲住在印第安纳州；他没有回复记者的置评请求。他的父母在他7岁的时候离婚了。\n几年前在网上认识克拉克的詹姆斯·肖(James Xio)说，克拉克很宠爱他的狗，不喜欢上学，朋友也不多。肖先生说，他有一个习惯，就是在情绪的极端之间来回移动，对一些小的违规行为大发雷霆。\n“他会发疯的，”18岁的肖先生说。“他的耐心很小。”\n19岁的阿比谢克·帕特尔(Abishek Patel)曾与克拉克一起玩过“我的世界”，他为他辩护。“他有一颗善良的心，总是照顾他关心的人，”他说。\n社交媒体监测公司SocialBlade称，2016年，克拉克开设了一个YouTube频道。他建立了数以千计的粉丝，并以玩暴力版的“我的世界”而闻名，名为“硬核派系”，用户名为“Open”和“OpenHCF”。\n但他更出名的是从其他“我的世界”玩家那里拿钱。人们可以支付游戏升级的费用，比如角色的配件。\n克拉克使用的一种策略似乎是为“我的世界”销售理想的用户名，但实际上并没有向买家提供该用户名。他还提出出售“我的世界”角色的斗篷，但有时在其他玩家给他寄钱后就消失了。\n21岁的尼克·杰罗姆(Nick Jerome)是弗吉尼亚州克里斯托弗·纽波特大学(Christopher Newport University)的一名学生，他说，克拉克曾提出出售自己的“我的世界”用户名“开放”(Open)。两人通过Skype发了信息，当时17岁的杰罗姆说，他为用户名支付了大约100美元，因为他认为这很酷。然后克拉克先生阻止了他。\n杰罗姆说，“我当时只是个愚蠢的青少年，回过头来看，我根本不应该这么做。”“我为什么要相信这个家伙？”\n2016年末和2017年初，“我的世界”的其他玩家在YouTube上制作了视频，描述了在与克拉克的别名“开放”(Open)擦肩而过后，他们是如何赔钱或面临网络攻击的。在其中一些视频中，可以听到克拉克使用种族主义和性别歧视的称谓，他还谈到了在家中接受教育，同时每月从“我的世界”活动中赚取5000美元。\n克拉克的真实身份很少出现在网上。有一次，他在网上露出了自己的脸和游戏设置，一些玩家称他为格雷厄姆。他的名字也出现在2017年的一篇推特帖子中。\n克拉克的兴趣很快扩展到视频游戏堡垒之夜和利润丰厚的加密货币领域。他加入了一个名为OGUsers的黑客在线论坛，并使用了网名Graham$。根据在线取证公司Echosec为时报所做的研究，他的OGUsers账户是从坦帕的同一个互联网协议地址注册的，这个地址与他的“我的世界”账户附带的地址相同。\n克拉克在OGUsers上称自己是“全职密码交易员辍学生”，并说他“专注于为所有人赚钱”。根据Echosec发现的帖子，Graham$后来被禁止进入社区，因为版主说他没有向另一名已经给他寄钱完成交易的用户支付比特币。\n尽管如此，克拉克已经利用OGUsers进入了一个黑客社区，该社区以窃取人们的电话号码来访问与这些号码相关的所有在线账户而闻名，这一攻击被称为SIM交换。主要目标是耗尽受害者的加密货币账户。\n2019年，黑客远程控制了西雅图地区科技投资者格雷格·贝内特(Gregg Bennett)的手机。几分钟内，他们就锁定了贝内特的在线账户，包括他的亚马逊和电子邮件账户，以及164枚比特币，这些比特币当时价值85.6万美元，今天价值180万美元。\n班尼特很快就收到了一封勒索信，并与“纽约时报”分享了这封信。据克拉克的几个网友说，这封信的署名是斯利姆，也就是克拉克的另一个网上化名。\n“我们只想要Bittrex的剩余资金，”斯克里姆写道，他指的是比特币交易所，这些硬币就是从那里被拿走的。“我们总是领先一步，这是你最简单的选择。”\n政府的没收文件显示，今年4月，特勤局从克拉克手中查获了100枚比特币。几周后，贝内特收到特勤局的一封信，信中说他们已经找回了100枚他的比特币，信中提到的密码与从克拉克手中查获的比特币的密码相同。\n目前还不清楚是否有其他人参与了这起事件，也不清楚剩下的64枚比特币发生了什么。\n班尼特在接受采访时说，一名特勤局特工告诉他，持有被盗比特币的人没有被捕，因为他是未成年人。特勤局没有回复记者的置评请求。\n到那时，克拉克先生已经住在坦帕公寓的公寓里了。根据朋友和社交媒体的帖子，他有一个昂贵的游戏设施，一个阳台和一个草地公园的景色。\n两位邻居说，克拉克先生一直独来独往，在不寻常的时间进进出出，开着一辆白色的宝马3系(BMW 3 Series)。\n在一个后来被删除的Instagram账号@Error上，克拉克还分享了自己穿着名牌运动鞋摇摆着说唱音乐的视频。一名珠宝商在Instagram上向嘻哈精英们大喊，照片显示克拉克在@Error上购买了一块镶有宝石的劳力士(Rolex)。\n与克拉克成了亲密朋友的肖先生说，4月份与特勤局的冲突震撼了克拉克。\n“他知道自己得到了第二次机会，”肖先生说。“他想努力做到尽可能合法。”\n但在特勤局被扣押不到两周后，检察官说克拉克开始努力进入Twitter。根据一份政府宣誓书，克拉克说服了一名“Twitter员工，他是IT部门的同事，并让这名员工提供访问客户服务门户的凭证。”\n指控文件显示，克拉克在OGUsers上找到同伙寻求帮助。根据同伙提交的文件和账户显示，这些同伙提出经纪出售用户名很酷的Twitter账户，比如@w，而克拉克则会进入Twitter的系统，改变账户的所有权。\n黑客攻击是在7月15日展开的。几天后，一名自称“哈哈”的同伙告诉“纽约时报”，他们认识的策划者开始欺骗想要秘密购买Twitter账户的顾客。黑客拿走了这笔钱并交出了账户，但随后利用他对Twitter系统的访问权限启动了客户端，很快就收回了这笔钱。这让人想起克拉克先生早先在“我的世界”中所做的事情。\n当克拉克的网友得知他被指控犯有黑客行为时，有几个人说他们并不感到惊讶。\n“他似乎从未真正关心过除了他自己以外的任何人，”网名为@iMakeMcVidz的游戏玩家康纳·贝尔彻(Connor Belcher)说。在成为他的网络批评者之前，贝尔彻曾与克拉克合作过一个单独的YouTube频道。", "note_en": "By the age of 10, he was playing the video game Minecraft, in part to escape what he told friends was an unhappy home life. In Minecraft, he became known as an adept scammer with an explosive temper who cheated people out of their money, several friends said.\n At 15, he joined an online hackers’ forum. By 16, he had gravitated to the world of Bitcoin, appearing to involve himself in a theft of $856,000 of the cryptocurrency, though he was never charged for it, social media and legal records show. On Instagram posts afterward, he showed up with designer sneakers and a bling-encrusted Rolex.\n The teenager’s digital misbehavior ended on Friday when  the police arrested him at a Tampa, Fla., apartment. Florida prosecutors said Mr. Clark, now 17, was the “mastermind” of a  prominent hack last month, accusing him of tricking his way into Twitter’s systems and  taking over the accounts of some of the world’s most famous people, including Barack Obama, Kanye West and Jeff Bezos.\n His arrest raised questions about how someone so young could penetrate the defenses of what was supposedly one of Silicon Valley’s most sophisticated technology companies. Mr. Clark, who prosecutors said worked with at least two others to hack Twitter but was the leader, is being charged as an adult with 30 felonies.\n Millions of teenagers play the same video games and interact in the same online forums as Mr. Clark. But what emerges in interviews with more than a dozen people who know him, along with legal documents, online forensic work and social media archives, is a picture of a youth who had a strained relationship with his family and who spent much of his life online becoming skilled at convincing people to give him money, photos and information.\n “I knew he really wanted money and he was never in the right mind-set,” said Colby Meeds, 19, a former friend in Minecraft who said Mr. Clark promised him $100 for his account but never paid up. “He would do anything for some money.”\n  Reached via a brief video call on Sunday from the Hillsborough County Jail in Tampa, Mr. Clark appeared in a black sleeveless shirt, his hair tumbling into his eyes. “What are your questions?” he asked, before pushing back his chair and hanging up. He is scheduled for a virtual court appearance on Tuesday.\n Mr. Clark and his sister grew up in Tampa with their mother, Emiliya Clark, a Russian immigrant who holds certifications to work as a facialist and as a real estate broker. Reached at her home, his mother declined to comment. His father lives in Indiana, according to public documents; he did not return a request for comment. His parents divorced when he was 7.\n Mr. Clark doted on his dog and didn’t like school or have many friends, said James Xio, who met Mr. Clark online several years ago. He had a habit of moving between emotional extremes, flying off the handle over small transgressions, Mr. Xio said.\n “He’d get mad mad,” said Mr. Xio, 18. “He had a thin patience.”\n Abishek Patel, 19, who played Minecraft with Mr. Clark, defended him. “He has a good heart and always looks out for the people who he cares about,” he said.\n In 2016, Mr. Clark set up a YouTube channel, according to the social media monitoring firm SocialBlade. He built an audience of thousands of fans and became known for playing a violent version of Minecraft called Hardcore Factions, under user names like “Open” and “OpenHCF.”\n But he became even better known for taking money from other Minecraft players. People can pay for upgrades with the game, like accessories for their characters.\n One tactic used by Mr. Clark was appearing to sell desirable user names for Minecraft and then not actually providing the buyer with that user name. He also offered to sell capes for Minecraft characters, but sometimes vanished after other players sent him money.\n  Mr. Clark once offered to sell his own Minecraft user name, “Open,” said Nick Jerome, 21, a student at Christopher Newport University in Virginia. The two messaged over Skype and Mr. Jerome, who was then 17, said he sent about $100 for the user name because he thought it was cool. Then Mr. Clark blocked him.\n “I was just kind of a dumb teenager, and looking back, there’s no way I should have ever done this,” Mr. Jerome said. “Why should I ever have trusted this dude?”\n In late 2016 and early 2017, other Minecraft players produced videos on YouTube  describing how they had lost money or faced online attacks after brushes with Mr. Clark’s alias “Open.” In some of those videos, Mr. Clark, who can be heard using racist and sexist epithets, also talked about being home schooled while making $5,000 a month from his Minecraft activities.\n Mr. Clark’s real identity rarely showed up online. At one point, he revealed his face and gaming setup online, and some players called him Graham. His name was also mentioned in  a 2017 Twitter post.\n Mr. Clark’s interests soon expanded to the video game  Fortnite and the lucrative world of cryptocurrencies. He joined an online forum for hackers, known as OGUsers, and used the screen name Graham$. His OGUsers account was registered from the same internet protocol address in Tampa that had been attached to his Minecraft accounts, according to research done for The Times by the online forensics firm Echosec.\n Mr. Clark described himself on OGUsers as a “full time crypto trader dropout” and said he was “focused on just making money all around for everyone.” Graham$ was later banned from the community, according to posts uncovered by Echosec, after the moderators said he failed to pay Bitcoin to another user who had already sent him money to complete a transaction.\n  Still, Mr. Clark had already harnessed OGUsers to find his way into a hacker community known for taking over people’s phone numbers to access all of the online accounts attached to the numbers, an  attack known as SIM swapping. The main goal was to drain victims’ cryptocurrency accounts.\n In 2019, hackers remotely seized control of the phone of Gregg Bennett, a tech investor in the Seattle area. Within a few minutes, they had secured Mr. Bennett’s online accounts, including his Amazon and email accounts, as well as 164 Bitcoins that were worth $856,000 at the time and would be worth $1.8 million today.\n Mr. Bennett soon received an extortion note, which he shared with The Times. It was signed by Scrim, another of Mr. Clark’s online aliases, according to several of his online friends.\n “We just want the remainder of the funds in the Bittrex,” Scrim wrote, referring to the Bitcoin exchange from which the coins had been taken. “We are always one step ahead and this is your easiest option.”\n In April, the Secret Service seized 100 Bitcoins from Mr. Clark, according to government forfeiture documents. A few weeks later, Mr. Bennett received a letter from the Secret Service saying they had recovered 100 of his Bitcoins, citing the same code that was assigned to the coins seized from Mr. Clark.\n It is unclear whether other people were involved in the incident or what happened to the remaining 64 Bitcoins.\n Mr. Bennett said in an interview that a Secret Service agent told him that the person with the stolen Bitcoins was not arrested because he was a minor. The Secret Service did not respond to a request for comment.\n By then, Mr. Clark was living in his own apartment in a Tampa condo complex. He had an expensive gaming setup, a balcony and a view of a grassy park, according to friends and social media posts.\n Two neighbors said that Mr. Clark kept to himself, coming and going at unusual hours and driving a white BMW 3 Series.\n On an Instagram account that has since been taken down, @error, Mr. Clark also shared videos of himself swaying to rap music in designer sneakers. He was given a shout-out on Instagram by a jeweler to the hip-hop elite, with a picture showing that Mr. Clark, as @error, had purchased a gem-encrusted Rolex.\n Mr. Xio, who became close friends with Mr. Clark, said the April run-in with the Secret Service shook Mr. Clark.\n “He knew he was given a second chance,” Mr. Xio said. “And he wanted to work on being as legit as possible.”\n But less than two weeks after the Secret Service seizure, prosecutors said Mr. Clark began working to get inside Twitter. According to a government affidavit, Mr. Clark convinced a “Twitter employee that he was a co-worker in the IT department and had the employee provide credentials to access the customer service portal.”\n For help, Mr. Clark found accomplices on OGUsers, according to the charging documents. The accomplices offered to broker the sale of Twitter accounts that had cool user names, like @w, while Mr. Clark would enter Twitter’s systems and change ownership of the accounts, according to the filings and accounts from the accomplices.\n  The hack unfolded on July 15. A few days later, one accomplice, who went by the name “lol,”  told The Times that the person they knew as the mastermind began cheating the customers who wanted to covertly buy the Twitter accounts. The hacker took the money and handed over the account, but then quickly reclaimed it by using his access to Twitter’s systems to boot out the client. It was reminiscent of what Mr. Clark had done earlier on Minecraft.\n When Mr. Clark’s online acquaintances learned he had been charged with the hack, several said they were not surprised.\n “He never really seemed to care about anyone but himself,” said Connor Belcher, a gamer known as @iMakeMcVidz who had previously teamed up on a separate YouTube channel with Mr. Clark before becoming one of his online critics.", "posttime": "2020-08-03 08:33:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,twitter,世界", "title": "Twitter黑客策划者格雷厄姆·克拉克(Graham Clark)的个人资料，他是一名问题青少年，据称从在我的世界上诈骗到加入黑客论坛OGUsers和SIM交换", "title_en": "Profile of Twitter hack mastermind Graham Clark, a troubled teen who allegedly went from scamming on Minecraft to joining hacker forum OGUsers and SIM swapping", "transed": 1, "url": "https://www.nytimes.com/2020/08/02/technology/florida-teenager-twitter-hack.html", "via": "", "real_tags": ["黑客", "twitter", "世界"]}, {"category": "", "categoryclass": "", "imagename": "aec490fe7f08694f94c2e09d404711af.jpg", "infoid": 1015829, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上个月，我给自己买了一台“新的”Mac电脑，只花了我50美元。最便宜的苹果电脑(Mac Mini)售价799美元，是我支付价格的16倍，这怎么可能呢？\n因为我从2003年买了一台旧的12英寸的iBook，它在800 MHz的G4 PowerPC处理器上运行的是一个长期过时的MacOSX版本。虽然这台机器可能有点老了，但它作为日常主力却出人意料地有用。\n现代职场充满了分心的事情，从官方商业应用程序，如Slake和微软团队，到社交媒体的轻浮。随着我们这么多人在家工作，这些比以往任何时候都更加明显。\n当然，不用说，我的古老的iBook不能运行Slake，这是在我的笔记本电脑出厂近十年后创建的。事实上，由于我还不清楚的原因，我的iBook的内置机场Wi-Fi卡无法连接到现代Wi-Fi网络-它们只是把它搞糊涂了。\n从本质上说，它完全是有气隙的。这对于长时间的不分心工作的马拉松来说是完美的，在此期间，在线中断是不可能的。\nIBook很适合打字，这一点也很有帮助。它来自笔记本电脑极其笨重的时代。因此，它的键盘有足够的移动空间，按键间距和轮廓都很好。我甚至认为它比苹果最新的魔术键盘使用起来更舒服。\n写作时，我使用的是AppleWorks6.0，这是一个办公套件，很大程度上已被iWork取代。它包括文字处理器、电子表格和演示应用程序。你也可以用它来制作网站，尽管按照今天的标准，它们看起来并不是特别好。\n在我完成一件作品的工作后，我将其复制到USB闪存驱动器，并将其移动到我连接互联网的主计算机上。\nAppleWorks支持多种Microsoft Word文件类型，最新的是2003年的文件类型。它们在带有TextEdit的最新版本的MacOS上本机打开，所以我不需要下载转换工具。\n不出所料，我发现拥有一台专用的、不上网的笔记本电脑帮助我变得更有效率。没有分心意味着我可以更好地专注于手头的任务。仅这一点就让我的电子书物有所值。\n当然，这并不都是好玩而无趣的。PowerPC Mac上发布了相当数量的游戏，你可以在网上找到其中的许多。我目前喜欢的两款游戏是手机阴影射击游戏XIII(将于今年晚些时候重新发布)和“星际迷航：精英力量II”(Star Trek：Elite Force II)。虽然游戏的玩法和图形不能完全满足当今游戏的复杂程度，但它们仍然相当有趣。\n你可以很容易地在eBay上找到旧的Mac游戏。有些甚至可以在各个网站上免费下载。“因为我的Mac很难连接到互联网，所以我把它们下载到我的主电脑上，然后用USB闪存盘将它们复制过来。\n请记住，有些网站将游戏作为“弃件”提供下载。这意味着它们的所有者并没有积极地出售它们，但它们仍然受版权保护，不能合法地分发。从这样的网站下载游戏时，请使用您的最佳判断力。\n由于许多闪存驱动器上使用的FAT32文件系统将文件限制为4 GB，因此建议您将驱动器重新格式化为MacOS Extended(也称为HFS+)。它能够存储更大的文件。不过，你必须通过另一台Mac来复制文件。\n我的iBook是在苹果销售搭载IBM处理器的电脑的时候推出的。PowerPC微体系结构在当时是真正具有开创性的，并且轻而易举地超越了同等的英特尔硅片。\n然而，这些优势是短暂的。英特尔迅速收复失地，尤其是在多核设计和能效方面。到2006年，苹果已经摆脱了IBM的处理器设计。尽管这造成了一些短期的混乱-特别是在涉及应用程序兼容性的时候-但这无疑是正确的决定。\n改用英特尔芯片使苹果能够制造更薄、更高效的机器，比如MacBook Pro。此外，自Power Macintosh 6100/66发布以来，首次可以在苹果电脑上双引导Windows。\nPowerPC并没有死。它在一些利基领域盛行，比如高性能计算和嵌入式系统。例如，NASA的好奇号火星车使用了专门设计的PowerPC处理器，可以承受火星的恶劣条件。与此同时，世界上排名前十的超级计算机中有三台使用的是旧PowerPC体系结构的衍生品。\n2019年，IBM正式开源PowerPC，让使用它的人无需支付巨额授权费，即可率先开发和创造新芯片。该标准的开发现在由OpenPOWER基金会控制，归Linux基金会管辖。\n这是否意味着我们将来会看到另一台PowerPC台式计算机或笔记本电脑？不太可能。\n你可以在很多地方买到一台传统的Mac电脑，包括旧货店、车库甩卖和易趣。当然，当涉及到它可能处于的状态时，里程数会有所不同。\n我的运气很好。它不仅没有划痕或任何视觉瑕疵，而且电池仍然可以充电。\n如果你想要一种简单的体验，那就去找1999年后生产的iBook或PowerBook吧。它们不仅可以运行MacOSX(因此会更加熟悉)，而且通常还带有内置USB。\n如果你更有冒险精神，你可以买一台更老的Mac。这些可能与Mac OS的预OS X版本(MacOS7、8或9)一起提供。首批PowerBook G3笔记本电脑中，有些甚至没有USB接口，不过使用Cardbus扩展卡就可以很容易地解决这个问题。我在易趣上找到了一张原始包装的10美元的，还有驱动CD。\n更划算的是，你可以买一台“备件或修理”的Mac电脑。不过，这些可能需要您做一些修修补补的工作。\n一些拒绝引导的老款Mac电脑可能只需要更换PRAM电池。如果您对该过程感到满意，您还可以拆卸并清除可能导致机器过热的任何内部灰尘。\n当你在那里的时候，你可能还想用一个新鲜的喷头来替换旧的热浆糊。完成后，您将拥有一个强大的(如果有点过时)主力。\n马修·休斯(Matthew Hughes)是The Register的记者，他在那里报道移动硬件和其他消费技术。他还为The Next Web、The Daily Beast、Gizmodo UK、The Daily Dot等撰写过文章。阅读完整的传记»", "note_en": "Last month, I bought myself a “new” Mac, and it only cost me $50. How is this possible, when the cheapest Apple computer (the Mac Mini) costs $799, or 16 times what I paid?\n Because I bought an old 12-inch iBook from 2003 that runs a long-obsolete version of Mac OS X on the steam of an 800 MHz G4 PowerPC processor. While this machine might be somewhat long-in-the-tooth, it’s surprisingly useful as a daily workhorse.\n     The modern workplace is filled with distractions, from official business applications, like Slack and Microsoft Teams, to social media frivolities. These are more keenly visible than ever with so many of us working from home.\n Of course, it goes without saying that my ancient iBook can’t run  Slack, which was created almost a decade after my laptop left the factory assembly line. In fact, for reasons I’m yet to discern, my iBook’s internal AirPort Wi-Fi card can’t connect to modern Wi-Fi networks—they simply confound it.\n In essence, it’s completely air-gapped. And that’s perfect for long marathons of undistracted work, during which online interruptions simply aren’t possible.\n It also helps that the iBook is lovely to type on. It hails from an era when laptops were profoundly bulky. As a result, its keyboard has plenty of travel, with well-spaced and contoured keys. I’d even argue it’s more pleasant to use than Apple’s latest  Magic Keyboard.\n For writing, I use AppleWorks 6.0, an office suite that was largely supplanted by  iWork. It includes a word processor, spreadsheet, and presentations app. You can also use it to make websites, although they wouldn’t look particularly good by today’s standards.\n After I finish working on a piece, I copy it to a USB flash drive and move it to my main internet-connected computer.\n AppleWorks supports several Microsoft Word file types, with the most recent being from 2003. These open natively on the latest version of macOS with TextEdit, so I didn’t have to download a conversion tool.\n Predictably, I’ve found that having a dedicated, internet-free laptop has helped me become more productive. No distractions means I’m able to focus better on the task at hand. This alone has made my iBook worth every cent.\n   Of course, it’s not all fun and no play. A decent amount of games were released for PowerPC Macs, and you can find many of them online. Two games I’m currently enjoying are the cell-shaded shooter  XIII (which will be re-released later this year) and  Star Trek: Elite Force II. While the gameplay and graphics don’t quite meet the sophistication of today’s games, they’re still fairly fun.\n You can easily find old Mac games on eBay. Some are even free to download on various websites. Since my Mac struggles to connect to the Internet, I download them on my main computer and copy them over with a USB flash drive.\n Bear in mind that some websites offer games for download as “abandonware.” This means the owner isn’t actively selling them, but they’re still under copyright and  can’t legally be distributed. Use your best judgment when downloading games from such websites.\n Since the  FAT32 file system used on many flash drives limits files to 4 GB, you’d be well-advised to reformat the drive to MacOS Extended ( also known as HFS+). It’s capable of storing much larger files. You’ll have to copy files over via another Mac, however.\n  My iBook was created at a time when Apple sold computers with processors made by IBM. The  PowerPC microarchitecture was genuinely groundbreaking at the time and handily outperformed the equivalent Intel silicon.\n However, those advantages were short-lived. Intel rapidly regained ground, particularly when it came to multicore designs and power efficiency. By 2006, Apple had transitioned away from IBM’s processor designs. Although that caused some short-term turmoil—particularly when it came to application compatibility—it was unquestionably the right decision.\n The switch to Intel chips allowed Apple to make thinner, more efficient machines, like the MacBook Pro. Also, for the first time since the release of the Power Macintosh 6100/66, it was possible to dual-boot Windows on Apple computers.\n PowerPC isn’t dead. It prevails in a few niche areas, like high-performance computing and embedded systems.  NASA’s Curiosity Rover, for example, used a PowerPC processor specially designed to withstand the harsh conditions of Mars. Meanwhile,  three of the top 10 supercomputers in the world use a derivative of the old PowerPC architecture.\n In 2019, IBM officially  open-sourced PowerPC, allowing those who used it to take the lead in development and create new chips without having to pay huge licensing fees. Development of the standard is now controlled by the  OpenPOWER Foundation, under the purview of the  Linux Foundation.\n Does this mean we’ll see another PowerPC desktop computer or laptop in the future? Not likely.\n    There are lots of places you can snag a legacy Mac, including thrift stores, garage sales, and eBay. Of course, when it comes to the condition it might be in, the mileage will vary.\n I got lucky with mine. Not only is it fairly free of scratches or any visual blemishes, but the battery also still holds a charge.\n If you’re looking for a straightforward experience, look for an iBook or PowerBook manufactured after 1999. Not only will these run Mac OS X (and, therefore, be more familiar), they also typically come with built-in USB.\n If you’re more adventurous, you can get an even older Mac. These might come with a pre-OS X version of Mac OS (Mac OS 7, 8, or 9). Some of the first PowerBook G3 laptops didn’t even include USB, although this is easily fixed with a Cardbus expansion card. I found one on eBay for $10 in the original packaging, with the driver CDs.\n For an even better bargain, you can buy a “spares or repair” Mac. These will likely require you to do a bit of tinkering, though.\n Some older Macs that refuse to boot might only need the PRAM battery to be replaced. If you’re comfortable with the process, you can also do a teardown and remove any internal dust that might be causing the machine to overheat.\n While you’re in there, you might also want to replace older thermal paste with a fresh squirt. When you’re done, you’ll have a powerful (if slightly archaic) workhorse.\n Matthew Hughes  Matthew Hughes is a reporter for The Register, where he covers mobile hardware and other consumer technology. He has also written for The Next Web, The Daily Beast, Gizmodo UK, The Daily Dot, and more.   Read Full Bio »", "posttime": "2020-08-03 08:06:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,powerpc", "title": "我在2020年仍在使用旧的PowerPC Mac", "title_en": "I Still Use an Old PowerPC Mac in 2020", "transed": 1, "url": "https://www.howtogeek.com/682300/why-i-still-use-an-old-powerpc-mac-in-2020/", "via": "", "real_tags": ["2020", "powerpc"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015828, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新的Mastodon版本为您带来了更好的音频播放器，改进了对不同音频和视频格式的支持，以及一些额外的安全机制。\n音响播放器已经完全改装，设计更吸引人眼球。它将自动从上传的音频文件中提取专辑画面，或者允许您上传自己选择的缩略图以显示在中心。然后，图片或缩略图中的主色将被用来给玩家一个独特的外观。\n以前的视频缩略图是从视频的第一帧自动获取的，而现在您还可以上传自定义缩略图，该缩略图将在视频开始播放之前显示。只需在新上传的媒体文件上单击“编辑”，然后选择一个新的缩略图！\n当你在其他平台上分享Mastodon的视频或音频链接时，比如Twitter，你的朋友将能够在该平台上打开Mastodon的视频或音频播放器(假设该平台支持twitter：player标签)。\n为了在您不在的时候更好地保护您的帐户，有了一个新的安全机制来保护新的登录尝试。如果您没有双因素身份验证设置，并且已离开至少两周，并且有人试图从以前看不见的IP地址登录到您的帐户，他们将被要求输入发送到您的电子邮件地址的令牌。\n这项功能更多的是为了保护那些忘记设置双因素身份验证的人，所以如果您正在阅读本文，请记住使用双因素身份验证(Mastodon‘s不需要电话号码或Mastodon应用程序，任何TOTP应用程序都可以使用)，并使用密码管理器为您拥有的每个帐户生成随机且唯一的密码！\n你是否曾经屏蔽或静音某人，但忘记了原因？或者你有没有跟踪过某人，但后来忘记了他们是谁？现在，您可以将个人笔记添加到其他帐户，以跟踪谁是谁。只有你才能看到！\n3.2版本包括自2020年5月14日以来由27个贡献者提交的380个承诺。对于逐行的属性，您可以仔细阅读ChangeLog文件，对于贡献者和翻译者的历史完整列表，您可以参考作者文件，这两个文件都包含在发行版中。\n翻译：杜伊，斯坦·艾诺特，贝斯尼克_b，伊曼纽尔·皮纳，定期翻译，ButterflyOfFire，adrmzz，Fédiquébec，Giorgio Herbie，Marcin Mikołajczak，咏叹i，泰语本地化，奈卜拉，Mentor Gashi，Xosém，AXI，Selyan Slimane Amiri，Alix Rossi，Jeroen，Steinark，AXI，Selyan Slimane Amiri，Alix Rossi，Jeroen，Steinark，AXI，Selyan Slimane Amiri，Alix Rossi，Jeroen，Steinark。首页--期刊主要分类--期刊细介绍--期刊题录与文摘--期刊详细文摘内容。硫酸鶏，Siamano，Viorel-CătăLin Rățeanu，Pachara Chantawong，Balázs Meskó，Steven Tappert，Unmual，子健赵，Skew，Enolp，Yann Aguettaz，Mick Onio，r3dsp1，张天琦，Piupiudiu，Padraic Calpin，るいーね，Belkacem Mohammed，Miquel SabatéSol。森の子リスのミーコの大冒険，道格，弗莱瓦。\n一如既往，非常感谢为此次发布做出贡献的每个人，感谢在Patreon上赞助该项目的每个人，以及使用该网络的每个人！🐘", "note_en": "The new Mastodon release brings you a much better audio player and improved support for different audio and video formats, as well as some additional security mechanisms.\n The  audio player has been completely reworked to have a more eye-catching design. It will extract album art from the uploaded audio file automatically, or allow you to upload a thumbnail of your own choosing to be displayed in the center. Dominant colors from the artwork or thumbnail will then be used to give the player a unique look.\n Whereas previously video thumbnails were automatically taken from the first frame of the video, you now also have the ability to  upload a custom thumbnail that will be displayed before the video starts playing. Simply click on “Edit” on a newly uploaded media file and then choose a new thumbnail!\n  When you share links to video or audio on Mastodon on other platforms, for example Twitter, your friends will be able to  open Mastodon’s video or audio player right on that platform (assuming the platform supports the  twitter:player tag).\n To better protect your accounts when you’re not there, there’s a  new security mechanism guarding new login attempts. When you don’t have two-factor authentication setup, have been away for at least two weeks, and someone tries to login to your account from a previously unseen IP address, they will be required to enter a token sent to your e-mail address.\n It’s a feature more meant to guard those who forget to setup two-factor authentication, so if you are reading this, remember that it’s good practice to use two-factor authentication (Mastodon’s does not require a phone number or a Mastodon app, any TOTP app works), and to use a password manager to generate random and unique passwords for each account you have!\n  Have you ever blocked or muted someone but forgot why? Or have you followed someone but then forgot who they are? Now you can add  personal notes to other accounts to keep track of who’s who. Visible only to you!\n  The 3.2 release consists of  380 commits by  27 contributors since May 14, 2020. For line-by-line attributions, you can peruse the  changelog file, and for a historically complete list of contributors and translators, you can refer to the  authors file, both included in the release.\n  Translators for this release: Duy, stan ionut, Besnik_b, Emanuel Pina, regulartranslator, ButterflyOfFire, adrmzz, FédiQuébec, GiorgioHerbie, Marcin Mikołajczak, ariasuni, Thai Localization, 奈卜拉, Mentor Gashi, Xosé M., axi, Selyan Slimane AMIRI, Alix Rossi, Jeroen, SteinarK, ThonyVezbe, Hrach Mkrtchyan, Gwenn, ᏦᏁᎢᎵᏫ mask, Danial Behzadi, spla, Rafael H L Moretti, Jeong Arm, koyu, Yi-Jyun Pan, norayr, Alessandro Levati, Sasha Sorokin, gagik_, lamnatos, Sveinn í Felli, Zoltán Gera, cybergene, Tagomago, Michal Stanke, borys_sh, Ramdziana F Y, Osoitz, Maya Minatsuki, Willia, BurekzFinezt, Evert Prants, ThibG, Dewi, Emyn-Russell Nt Nefydd, vishnuvaratharajan, tolstoevsky, Diluns, Falling Snowdin, Marek Ľach, Balázs Meskó, Ryo, Roboron, StanleyFrew, PPNplus, Heimen Stoffels, Andrew, Iváns, Carlos Solís, Sokratis Alichanidis, TS, SensDeViata, AzureNya, OctolinGamer, 北䑓如法, Laura, Imre Kristoffer Eilertsen, Rikard Linde, Ali Demirtaş, diorama, Daniele Lira Mereb, Goudarz Jafari, psymyn, v4vachan, Sebastián Andil, Khóo, ZiriSut, strubbl, Reg3xp, AlexKoala, VSx86, Mo_der Steven, musix, ギャラ, Saederup92, mynameismonkey, omquylzu, Miro Rauhala, 硫酸鶏, siamano, Viorel-Cătălin Răpițeanu, Pachara Chantawong, Balázs Meskó, Steven Tappert, Unmual, Zijian Zhao, Skew, enolp, Yann Aguettaz, Mick Onio, r3dsp1, Tianqi Zhang, piupiupiudiu, Padraic Calpin, るいーね, Belkacem Mohammed, Miquel Sabaté Solà, serubeena, Solid Rhino, Rintan, 林水溶, Tagada, shafouz, Tom_, OminousCry, ALEM FARID, Nathaël Noguès, Robin van der Vliet, twpenguin, Paz Galindo, 夜楓Yoka, mkljczk, kiwi0, Esther, Renato “Lond” Cerqueira, igordrozniak, Philipp Fischbeck, GaggiX, Allen Zhong, Albatroz Jeremias, Nocta, pezcurrel, Aditoo17, 森の子リスのミーコの大冒険, Doug, Fleva\n As always, huge thanks to everyone who contributed to this release, to  everyone who sponsors the project on  Patreon, and to everyone who uses the network! 🐘", "posttime": "2020-08-03 08:06:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "乳齿,mastodon", "title": "乳齿象3.2", "title_en": "Mastodon 3.2", "transed": 1, "url": "https://blog.joinmastodon.org/2020/08/mastodon-3.2/", "via": "", "real_tags": ["乳齿", "mastodon"]}, {"category": "", "categoryclass": "", "imagename": "1574246d775b011bc0592374869fdbfd.png", "infoid": 1015827, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我还是个孩子的时候，在假期旅行中，我总是坐在前排乘客的座位上，感到非常兴奋。你看，当时还没有导航设备，因此我们有了实际的路线图。我父亲经常凭记忆知道路线，但我却急于在地图上跟着走(并指出我们什么时候可以找到更快的或可供选择的路线)。\n我对地图的热情并没有消失。这不是巧合，我目前正在写的路线图，在另一个类似的，意义上的产品路线图。\n一般来说，地图的功能是帮助你到达目的地。但我们如何创建和使用产品路线图至关重要。这是一个既有创造性又有分析性的过程。\n在本系列中，我的目标是引导您了解创建最终产品路线图所需了解的所有内容。在这第一期中，我的目标是解释什么是产品路线图，以及为什么它是一个如此伟大的工具。\n首先，让我告诉您我认为产品路线图的一个很好的定义，它将帮助我们框定本指南中的其余要点。\n产品路线图是一个高层次的可视化总结，它规划出您的产品的愿景和方向。&#34；-ProductPlan。\n我们将一步一步地分解这个定义，这样我们就能理解它的含义。\n这意味着我们不会过多地深入产品愿景的细节(这就是积压的原因)。我们需要路线图保持在战略层面上，我们可以用它来设定长期的路线。举个例子：想象一艘船驶向某个目的地。船上的船长需要向地平线上望去寻找方向。相比之下，同一艘船上的一名工程师负责机舱内的机器：两者都是最终目标所必需的，但关注程度非常不同。\n这意味着产品路线图，就像陆地路线图一样，无需阅读即可理解(除了标题、注释、名称等)。可视化表示有助于更容易、更快速地理解路线图，这对于获得参与的每个人的认可是必要的。\n这与我们之前看到的高级部分类似。(不要把重点放在所有细节上。)。但它确实阐明了路线图应该简化的观点，但绝对不会遗漏愿景的关键部分。要做到这一点很难，特别是当一个产品很大的时候。注意，总结是一个持续的过程。\n这意味着产品的原因。为什么一开始就要创造产品呢？它有什么目标？对用户的价值主张是什么？企业创建此产品的动机是什么？小贴士，在你的愿景清晰之前，不要花太多时间来制定产品路线图。\n这意味着获得成品的执行部分。这就是你是如何从一无所有到提供预期价值的。我还需要说这很重要吗？嗯，是的，它是；它是必不可少的。在执行计划中，您可以在创建和更新产品路线图时找到最详细的(和困难的)。在你形成了一个产品愿景(希望与你的客户和你的公司一致！)之后，大多数利益相关者都不会动摇这个想法。然而，实现这一目标的道路是坎坷而复杂的。(我想在这里更多地讨论这一点几乎是言过其实了，但我们将在多个部分深入讨论这个问题的细节！)。\n这意味着你最终会创造出最终的成品。您创建产品路线图的全部原因是为了向最终用户，即您的客户提供有价值的产品。\n有趣的旁白。也许你已经熟悉了定义中的最后三个部分(愿景、方向和产品供应)，但措辞不同。Simon Sinek谈到了为什么、如何以及是什么(分别是愿景、方向和产品供应)。他在同名的书中称它为“黄金圈”。\n产品路线图可以采取多种形式，基于功能、基于目标、基于时间、基于版本等等。但好的路线图有几个共同点。\n与较晚的(较低优先级)项目相比，他们对近期(较高优先级)项目有更多的详细信息。\n它们将主题作为最高级别(如增加年度订阅者的客户保留率)，而不是功能。\n在下一篇文章中，我将详细介绍示例产品路线图。以及列出可能制定的不同类型的产品路线图。首先，我将更多地告诉您如何使用您的路线图。\n好了，现在您知道产品路线图应该做什么了，应该是什么样子了。对吗？嗯，从更高的层面来说，是的。但是，产品路线图的利用在您使用的特定案例中变得更加明显。\n这些都是关于人、社会动态、协作和交流的。您可以使用产品路线图。\n这五个用途都归结为创建产品路线图的最重要原因。设定你的产品愿景和执行的叙述。\n有了产品路线图，您就可以讲述意图的故事。朝着某个目标生产产品的意图。这个故事对于让其他人和你一起创造伟大的产品是必不可少的。\n有一点很关键，我想把它带回家。产品路线图是一份活生生的文档。你计划的事情并不是一成不变的。您重新构建的产品正在进行一次又一次的迭代。因此，您的路线图应该反映最新的发现和细节，特别是在敏捷和精益(软件)开发的时代。\n希望您现在已经熟悉了什么是产品路线图，为什么应该使用产品路线图，以及它是什么样子。\n如果您有任何问题、想法或感觉缺少什么，请务必在Twitter上给我发一条消息。\n顺便说一下，我还创建了一份包含40条产品路线图提示的核对表。因此，如果您迫不及待地开始创建和使用产品路线图，我强烈建议您查看一下。\n如果您想看到更多这样的内容，我将很高兴您能加入我的邮件列表。", "note_en": "When I was still a kid, I was always so excited to sit in the front passenger seat on holiday trips. You see, there were no navigation devices yet, and thus we had a physical roadmap. My dad frequently knew the route from memory, but I was eager to follow along on the map (and point out when we could find a quicker or alternative route).\n My excitement for maps has not gone away. It&#39;s not coincidental that I&#39;m currently writing about roadmaps in another, similar, sense—product roadmaps.\n In general, the power of a map is to help you get to a destination. But how we create and use product roadmaps is essential.  It is a process that is both creative and analytical.\n In this series, I aim to guide you through everything you need to know about creating the ultimate product roadmap. In this first installment, I aim to explain what a product roadmap is and why it&#39;s such a great tool.\n  Let me first tell you what I feel is a good definition of a Product Roadmap, which will help us frame the rest of the points in this guide.\n &#34;A product roadmap is a high-level visual summary that maps out the vision and direction of your product offering.&#34; -   ProductPlan\n We&#39;re going to break down the definition step by step, so we understand what it entails.\n  This means we don&#39;t go into the details of a product vision too much (that&#39;s what backlogs are for). We need the roadmap to stay on a strategic level where we can use it to set the course over the long term. To illustrate: think about a ship sailing to some destination. A captain on the vessel needs to look out over the horizon for direction. In contrast, an engineer on the same boat takes care of the machines in the engine room: both necessary for the end goal, but very different levels of focus.\n  This means the product roadmap, like a land roadmap, can be understood without needing to read it (apart from titles, notes, names, etc.). Visual representation helps make the roadmap easier and quicker to understand, which is necessary to get buy-in from everyone involved.\n  This is similar in the &#34;high-level&#34; part we saw earlier. (Not focus on all the details.) But it does drive home the point that the roadmap should simplify, but definitely not leave out critical parts of the vision. Doing this is hard, especially when a product is big. Note, summarizing is a continuous process.\n  This means the &#34;why&#34; of a product. Why create the product in the first place? What goal does it have? What is the value proposition for users? What is the incentive for the business to create this product? Tip, don&#39;t spend a lot of time creating a product roadmap before your vision is crystal clear.\n  This means the execution part of getting to a finished product. It is &#34;how&#34; you go from nothing to providing the value intended. Do I need to say this is important? Well, yes, it is; it is essential. In the execution plan, you find most detail (and struggles) while creating and updating the product roadmap. After you formed a product vision ( hopefully in line with your customers and your company!), most stakeholders don&#39;t sway from that idea. The route to that goal, however, is a bumpy and complicated road. (I&#39;m almost getting ahead of myself in wanting to talk more about this here, but there will be multiple sections where we&#39;ll get into the details of this!)\n  This means &#34;what&#34; you&#39;ll eventually end up creating—the finished product. The whole reason you create a product roadmap is to offer a valuable product to the end-user, your customer.\n An interesting aside. Maybe you&#39;re already familiar with the last three parts from the definition (vision, direction, and product offering) but under different wording.   Simon Sinek  talks about the &#34;why, how, and what&#34; (vision, direction, and product offering, respectively). He calls it the &#34;Golden Circle&#34; by his book with the same name.\n  A product roadmap can take many forms, feature-based, goal-based, time based, release-based, and a few more. But good roadmaps have a few things in common.\n They have more detail for near term (higher priority) items than for later (lower priority) items.\n They have &#39;themes&#39; as the highest level (like &#34;increase customer retention for yearly subscribers&#34;), not features.\n   In the next article, I will walk you through the details of an example product roadmap. As well as listing the different types of product roadmaps that are possible to make. First I&#39;ll tell you a bit more about how you can use your roadmap.\n  Ok, so now you know what a product roadmap is supposed to do and what it looks like. Right? Well, on a high level, yes. But the utilization of a product roadmap becomes even more evident in the specific cases you use it.\n These are all about people, social dynamics, collaboration, and communication. You can use a product roadmap\n  These five uses all come down to the most important reason for creating a product roadmap. To set the narrative of your product vision and execution.\n  With a product roadmap you can tell a story of intent. The intent to build a product towards a certain goal. This narrative is essential to get others to work with you in creating great products.\n There is one crucial point I want to drive home. A product roadmap is a living document. The things you plan are not set in stone. The product you&#39;re building is undergoing iteration upon iteration. Thus your roadmap should reflect the latest findings and details, especially in the age of Agile and Lean (software) development.\n  Hopefully, you&#39;re now familiar with the idea of what a product roadmap is, why you should use one, and what it looks like.\n If you have any questions, thoughts, or feel something is missing, please do shoot me a message on  Twitter.\n By the way, I also created a checklist with &#34; 40 Product Roadmap tips.&#34; So if you can&#39;t wait to get into creating and using a product roadmap, I highly recommend you check it out.\n  If you&#39;d like to see more content like this, I&#39;d be thrilled to have you join my  mailing list.", "posttime": "2020-08-03 08:06:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "产品,product", "title": "什么是产品路线图？", "title_en": "What is a Product Roadmap?", "transed": 1, "url": "https://www.jibranelbazi.com/blog/what-is-a-product-roadmap", "via": "", "real_tags": ["产品", "product"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015826, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Pleroma是一款免费的、基于开放协议的联合社交网络服务器。它与GNU Social、Mastodon和许多其他ActivityPub实现兼容。\n该项目由几个组件组成：Pleroma是服务器实现，与默认前端PleromaFE捆绑在一起。还提供了其他有用的实用程序，例如ActivityPub中继。", "note_en": "Pleroma is a free, federated social networking server built on open protocols. It is compatible with  GNU Social,  Mastodon, and many other ActivityPub implementations.\n  The project consists of several components:   Pleroma is the server implementation, and comes bundled with   PleromaFE, the default frontend. Other useful utilities are also provided, such as   an ActivityPub relay.", "posttime": "2020-08-03 08:06:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "兼容,mastodon,实现", "title": "Pleroma：兼容Mastodon的开放联合社交网络服务器", "title_en": "Pleroma: A Mastodon-compatible open and federated social networking server", "transed": 1, "url": "https://pleroma.social/", "via": "", "real_tags": ["兼容", "mastodon", "实现"]}, {"category": "", "categoryclass": "", "imagename": "4960d28b95dbda2b6e1124751b8d30ad.jpeg", "infoid": 1015825, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "货轮工作人员警告说，一场迫在眉睫的灾难即将到来，因为大约30万人实际上被冠状病毒大流行困在了海上。\n多位消息人士告诉Business Insider，船上的条件，一些工人已经一年多没有上岸了。\n在国际运输工人联合会(ITF)6月份发布的一份报告中，海员们谈到越来越多的自杀念头，并描述了潜在事故的定时炸弹。\n该联合会是一个工会组织，其成员约占全球航海劳动力的30%。\n随着各国在大流行期间关闭边境，数以千计的工人--他们运输着世界上90%的货物--被迫工作或留在船上，远远超过了他们通常为期四到六个月的合同。\n即使许多国家重新开业，航运公司也在努力安排新的船员，这意味着每个人都必须留在船上。\n根据ITF的说法，这种情况意味着一些行业正在违反国际海事劳工公约(MLC)。协议规定，没有上岸休假，海员不能工作超过11个月。\n今年6月，十几个国家承认海员是基本工人，这是为了缓解让他们回家或至少上岸的官僚障碍。但在7月16日的一份声明中，ITF表示，许多政府仍然做得远远不够。\n工人们不愿接受“商业内幕”杂志的采访，甚至不愿透露姓名，因为他们担心遭到雇主的报复。\n然而，有两个组织--创新及科技基金会和基督教慈善机构“海员使命”--与海员有直接联系，并根据他们的经验编写了报告。这些海员被这些组织匿名。\n但石油换能源，超市货架上的食品，亚马逊订单的商品，以及医院的医疗用品都在源源不断地涌入-因为货船工人大多别无选择，只能继续前进。\n船员们看到超市货架空空如也，抢购现象频频出现，他们为自己正在尽其所能帮助社会提供必需品而感到自豪，请阅读由“海员使命”制作的“2020年第一季度海员幸福指数简介”(The Hafarers Index For The Hafarers Index For 2020 Q1)。那是在三月底。\n但随着疫情的继续，这正在造成巨大的人员伤亡，ITF在其报告中将其描述为一场人道主义危机。\n截至5月底，ITF调查了867名海员，其中70%的人被迫续签合同。一小部分人-约5%-表示他们没有拿到工资。\n许多人谈到了精神健康的挣扎，想念他们的家人，并将他们的情况比作监禁或奴役。\n一名在海上滞留了四个月的瑞典海员问道：例如，你会锁上工厂的门，让人们与新冠肺炎隔离吗？除非你是一个无情的独裁者，否则你很可能根本不会考虑这件事。\n缺乏获得医疗护理的机会也是一个问题。艾玛·马士基号的一名船长不得不治疗关节炎，尽管他不是牙医，但还是给他的两名船员拔掉了牙齿。\n马士基的一位发言人告诉Business Insider，在严重的情况下，工人会被空运到安全的地方，机长们确实接受过基本的医疗培训。\n两名海员表示，他们一直未能见到在岸上遇难的家属。\n一名印度尼西亚海员在出海九个月后说，言语不足以解释我所面临的困难。有时我觉得我活不过这段时间了。\n另一位来自埃及并在海上呆了整整一年的人说：我想我会因为长期合同的压力而自杀。我觉得生活没有意义。\n根据海员使命第二季度幸福感调查，船员减少、社交距离和严格的卫生措施使船上的日常生活变得尴尬。\n报告称，有一种压力要求将卫生标准保持在几乎医院的水平。然而，工作人员报告说，他们并不总是有适当的个人防护用品，也不能保持有效的社会距离。\n海上保险机构船东俱乐部(Shiowners Club)防止损失主管路易丝·霍尔(Louise Hall)在报告中表示，有关额外安全措施的报道，比如在用餐时间分隔桌子和限制餐厅的容量，甚至让最习惯性的社交活动也变得困难。\n根据ITF报告中的水手们的说法，到了6月份，船员们的压力开始表现在他们的友谊上。一位在海上航行超过12个月的印度海员说：我们开始为了愚蠢的理由为一些小事而争吵。\n基本的舒适设施也供不应求。据ITF报告中的一名南非水手称，一名船员的洗发水用完了，无法洗头，不得不剃光头。\n我们已经筋疲力尽了，我们不再关心船上的任何东西了。一名印度水手在海上航行了一年多，他说，每天都像机器人一样前行。\n你们这些家伙在等定时炸弹爆炸。你将得不到你的货物，而且你将面临一场巨大的环境灾难。水手预测，我们很快就会在海上看到无政府状态。\n尽管许多国家正在重新开放边境，但让水手回家和让新工人上船仍然存在障碍。\n许多商业航线几乎不存在了，这意味着公司经常需要包租自己的飞机来运送机组人员往返港口。\n此外，许多国家没有提供简单的程序来获得过境签证和上岸许可。\nITF表示，不仅仅是那些在海上苦苦挣扎的人。另有大约30万名预计此时在海上工作的海员目前在岸上失业。\n疫情爆发之初，ITF与海员达成协议，同意船运公司将合同延长至多一个月，以承认边境关闭使其几乎不可能这么做。\n但在6月15日，随着越来越多的国家开放，欧盟的耐心耗尽了。ITF现在的立场是，如果船员选择采取行动，它将支持对船只采取罢工行动。\n但是，ITF海员组主席戴夫·海因德尔(Dave Heindel)表示，三周多过去了，他们的工作仍然没有达到需要的水平，一些国家的政府甚至已经倒退了。\n在ITF的报告中，一名南非海员将商业水手与军事人员的恶劣待遇相提并论，他说：你让你的士兵回国，但你想让那些维持你经济命脉的男男女女在令人沮丧、危险的孤立中受苦。\n当你需要发货时，你会找谁，谁会是你的海员？\n点击“注册”，即表示您同意接收来自Business Insider的营销电子邮件以及其他合作伙伴优惠，并接受我们的服务条款和隐私政策。\n形成一条X的两条交叉线。它指示一种关闭交互或取消通知的方式。", "note_en": "Cargo ship workers are warning of a looming disaster as some 300,000 people are effectively trapped at sea in the coronavirus pandemic.\n Multiple sources told Business Insider about conditions onboard, where some workers have not been on land for more than a year.\n Seafarers spoke of mounting suicidal thoughts, and described a &#34;ticking time bomb&#34; for potential accidents, in a report published in June by the International Transport Workers&#39; Federation (ITF).\n The federation is a group of trade unions, whose members represent around 30% of the global seafaring workforce.\n   As countries closed their borders during the pandemic, thousands of workers — who transport 90% of the world&#39;s goods — were forced to work or remain on board long beyond their contracts, which usually run for four to six months.\n Even as many countries reopen, shipping firms are struggling to arrange for new crew, which means everybody has to stay on board.\n The situation means some of the industry is breaching the international Maritime Labour Convention (MLC), according to the ITF. The agreement says that seafarers cannot be made to work without shore leave for longer than eleven months.\n In June more than a dozen countries  recognized seafarers as essential workers, which was meant to ease the bureaucratic hurdles to getting them home, or at least on shore.  But in a statement on July 16, the ITF said many governments were still not doing &#34;nearly enough.&#34;\n   Workers were reluctant to speak to Business Insider even anonymously for fear of reprisal from their employers.\n However, two organizations — the ITF and The Mission to Seafarers, a Christian charity — are in direct contact with seafarers and have produced reports based on their experiences. The seafarers were anonymized by the organizations.\n    But the oil for energy, the food on supermarket shelves, the goods for Amazon orders, and medical supplies for hospitals all kept coming — because of cargo ship workers who mostly had no choice but to go on.\n   &#34;Crews are reading of empty supermarket shelves and panic buying and are proud that they are doing everything they can to help keep society supplied with essential goods,&#34; read the introduction to the  Seafarers&#39; Happiness Index for Q1 2020, produced by the Mission to Seafarers. That was at the end of March.\n But as the pandemic continues, that is taking an immense human toll, in what the ITF described in its report as a &#34;humanitarian crisis.&#34;\n   The ITF surveyed 867 seafarers at the end of May, 70% of whom had been forced to extend their contracts. A small proportion — around 5% — said they were not being paid.\n Many spoke of mental health struggles, missing their families, and compared their situation to imprisonment or slavery.\n   One Swedish seafarer, stuck at sea for four months, asked: &#34;Would you lock the door to, for example, a factory to isolate people from COVID-19? Unless you are a ruthless dictator, you would most likely not even consider it.&#34;\n A lack of access to medical care has also been an issue. A captain for the Emma Maersk has had to treat arthritis and — despite not being a dentist — pulled the teeth of two of his crewmembers.\n  A spokesperson for Maersk told Business Insider that in serious cases workers are airlifted to safety, and that captains do have basic medical training.\n Two seafarers said they had not been able to see family members who have since died onshore.\n   &#34;Words are not enough to explain the hardships I&#39;ve faced,&#34; an Indonesian seafarer said, after being at sea nine months. &#34;Sometimes I feel I won&#39;t survive this period.&#34;\n Another, from Egypt and at sea for a full year, said: &#34;I think I will commit suicide because of the stress of the long contract. I feel that there is no meaning to life.&#34;\n   Reduced crews, social distancing and stringent hygiene measures have made day-to-day life awkward on board, according to the Mission to Seafarers&#39;s Q2 happiness survey.\n &#34;There is a pressure to keep hygiene standards at almost hospital levels,&#34; said the report. Yet crews reported not always having appropriate PPE or being able to maintain effective social distancing.\n   &#34;Reports of additional safety measures, such as separating tables and limiting the capacity of mess rooms at meal times, has made even the most habitual social interactions difficult,&#34; said Louise Hall, director of loss prevention at the Shipowners&#39; Club, a maritime insurance agency, in the report.\n By June, the strain on crews was beginning to show in their friendships, according to sailors in the ITF report. An Indian seafarer who had been at sea longer than 12 months said: &#34;We are starting to fight over little things for stupid reasons.&#34;\n And basic comforts are in short supply. One crew ran out of shampoo and, unable to wash their hair, had to shave their heads instead, according to a South African sailor in the ITF report.\n  &#34;We are extremely burnt out and we don&#39;t care about anything on the vessel anymore. Just going each day like robots,&#34; said an Indian sailor at sea more than a year.\n   &#34;You guys are waiting for a ticking time bomb to explode. You will not get your cargo and you will have a huge environmental disaster.&#34; The sailor predicted that we &#34;will soon see anarchy at sea.&#34;\n  Even though many countries are reopening their borders, there are still barriers to getting sailors home and getting new workers on board.\n Many commercial flight routes hardly exist any more, meaning companies often need to charter their own planes to move crews to and from ports.\n Additionally, many countries do not offer simple processes to secure transit visas and permits to come onshore.\n   It&#39;s not only those at sea who are struggling, the ITF said. Another estimated 300,000 seafarers who expected to be working at sea at this time are currently onshore and unemployed.\n   Early on in the pandemic, the ITF  agreed to up to one month of contract extensions from shipping companies — with seafarers&#39; agreement — in acknowledgement that border closures had made it practically impossible to do otherwise.\n But on June 15, as more and more countries opened up, the union&#39;s patience ran out. The ITF&#39;s position is now that it  will support strike action on ships, if the crews chose to take it.\n    But, more than three weeks later, they still &#34;aren&#39;t doing near what is needed and some governments have even gone backwards,&#34; according to Dave Heindel, chair of the ITF seafarers section.\n Comparing the poor treatment of commerical sailors to military personnel, one South African seafarer in the ITF report said: &#34;You let your soldiers repatriate, but you want the men and women who maintain your economic life blood to suffer in depressing, dangerous isolation.&#34;\n &#34;Who are you going to call on when you need your trade goods delivered, who will be your seafarers?&#34;\n  By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.\n        Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2020-08-03 08:05:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,冠状病毒,货船,ship", "title": "30万名货船工人仍被冠状病毒大流行困在海上", "title_en": "300k cargo ship workers still trapped at sea by the coronavirus pandemic", "transed": 1, "url": "https://www.businessinsider.com/cargo-ship-workers-trapped-sea-predict-anarchy-not-sent-home-2020-7", "via": "", "real_tags": ["病毒", "冠状病毒", "货船", "ship"]}, {"category": "", "categoryclass": "", "imagename": "9010ab9bbb7afd5bdea885170d1e9187.jpg", "infoid": 1015824, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年6月5日，星期五，在美国密歇根州诺维市，一名购物者戴着防护口罩走过一家劳德·泰勒有限责任公司门店。据底特律新闻报道，密歇根州州长格雷琴·惠特默5日宣布，密歇根州的理发店、美发和美甲沙龙将于6月15日在全州范围内开业。摄影师：Emily Elconin/Bloomberg，Bloomberg。\n彭博社(Bloomberg)--以高档时装和奢华的假日橱窗展示而闻名的洛德·泰勒百货公司(Lord&Amp；Taylor)在冠状病毒肆虐中扭亏为盈后，向债权人寻求破产保护。周日，美国最古老的百货商店在弗吉尼亚州里士满申请破产保护。该公司由两名英国移民于1826年在曼哈顿创立，在请愿书中列出了各自高达5亿美元的资产和负债。时尚初创公司Le Tote Inc.。去年，该连锁店以7,100万美元的价格从第五大道所有者哈德逊湾公司(Hudson‘s Bay Co.)手中买下了该公司的商店、品牌和电子商务网站的使用权。该连锁店加入了与病毒有关的迅速增长的百货商店伤亡名单，病毒将商场变成了鬼城。像J.Crew集团(J.Crew Group Inc.)这样的前时尚中坚分子。和Neiman Marcus Inc.。今年已经申请破产保护。总部位于旧金山的Le Tote--一家提供时尚服装租赁的公司--也申请了破产保护。该公司的高管原本计划削减Lord&amp；Taylor门店的数量，并以年轻女性为目标，提供奢侈品试衣室、美容订阅和租赁点。根据与哈德逊湾的协议，卖家同意支付Lord&amp；Taylor三年的租金，每年为Le Tote节省5800万美元。", "note_en": "A shopper wears a protective mask while passing in front of a Lord &amp; Taylor LLC store in Novi, Michigan, U.S., on Friday, June 5, 2020. Governor Gretchen Whitmer announced Friday that barbershops, hair and nail salons will be allowed to open statewide in Michigan on June 15, Detroit News reported. Photographer: Emily Elconin/Bloomberg , Bloomberg\n   (Bloomberg) -- Lord &amp; Taylor, known for its upscale fashions and extravagant holiday window displays, sought bankruptcy protection from creditors after a turnaround effort faltered amid the coronavirus pandemic.The oldest U.S. department store filed for Chapter 11 protection in Richmond, Virginia, on Sunday. The company, founded in Manhattan by two English immigrants in 1826, listed assets and liabilities of up to $500 million each in its petition. Fashion start-up Le Tote Inc. bought the rights to the company’s stores, brand and e-commerce site from Fifth Avenue owner Hudson’s Bay Co. for $71 million last year.The chain joins a burgeoning list of department-store casualties tied to the virus, which turned malls into ghost towns. Former fashion stalwarts like J. Crew Group Inc. and Neiman Marcus Inc. already filed for bankruptcy protection this year.San Francisco-based Le Tote – which offers fashion-apparel rentals – also filed for Chapter 11. Executives at the company had planned to cut the number of Lord &amp; Taylor stores and target younger women with luxury try-on studios, beauty subscriptions and rental drop-off points.Under the deal with Hudson’s Bay, the seller agreed to cover Lord &amp; Taylor’s rent for three years, saving Le Tote $58 million annually.", "posttime": "2020-08-03 07:40:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,百货公司,taylor", "title": "洛德和泰勒，美国最古老的百货公司，破产档案", "title_en": "Lord and Taylor, Oldest U.S. Department Store, Files Bankruptcy", "transed": 1, "url": "https://www.bnnbloomberg.ca/lord-taylor-oldest-u-s-department-store-files-bankruptcy-1.1474568", "via": "", "real_tags": ["美国", "百货公司", "taylor"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015823, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在微软首席执行官萨蒂亚·纳德拉(Satya Nadella)和唐纳德·J·特朗普(Donald J.Trump)总统交谈之后，微软准备继续讨论探索在美国收购TikTok的事宜。\n微软完全理解解决总统关切的重要性。它承诺在经过全面安全审查后收购TikTok，并为包括美国财政部在内的美国提供适当的经济利益。\n微软将在几周内迅速采取行动，与TikTok的母公司ByteDance进行谈判，无论如何都不会迟于2020年9月15日完成这些谈判。在这一过程中，微软期待着继续与美国政府对话，包括与总统对话。\n与ByteDance的讨论将基于微软和ByteDance向美国外国投资委员会(CFIUS)发出的通知。这两家公司已经发出通知，表示他们打算探索一项初步提案，该提案将涉及在美国、加拿大、澳大利亚和新西兰购买TikTok服务，并将导致微软在这些市场拥有和运营TikTok。微软可能会邀请其他美国投资者以少数股权参与此次收购。\n这个新结构将建立在TikTok用户目前喜爱的体验之上，同时增加世界级的安全、隐私和数字安全保护。将建立这项服务的运作模式，以确保对用户的透明度以及这些国家的政府进行适当的安全监督。\n在其他措施中，微软将确保TikTok美国用户的所有私人数据都转移到美国并保留在美国。如果任何此类数据目前存储或备份在美国境外，Microsoft将确保这些数据在传输后从国外的服务器上删除。\n微软感谢美国政府和特朗普总统的亲自参与，因为它继续为国家制定强有力的安全保护措施。\n这些讨论是初步的，不能保证涉及微软的交易会继续进行。在我们的讨论有最终结果之前，我们不打算提供进一步的最新情况。", "note_en": "Following a conversation between Microsoft CEO Satya Nadella and President Donald J. Trump, Microsoft is prepared to continue discussions to explore a purchase of TikTok in the United States.\n Microsoft fully appreciates the importance of addressing the President’s concerns. It is committed to acquiring TikTok subject to a complete security review and providing proper economic benefits to the United States, including the United States Treasury.\n Microsoft will move quickly to pursue discussions with TikTok’s parent company, ByteDance, in a matter of weeks, and in any event completing these discussions no later than September 15, 2020. During this process, Microsoft looks forward to continuing dialogue with the United States Government, including with the President.\n The discussions with ByteDance will build upon a notification made by Microsoft and ByteDance to the Committee on Foreign Investment in the United States (CFIUS). The two companies have provided notice of their intent to explore a preliminary proposal that would involve a purchase of the TikTok service in the United States, Canada, Australia, and New Zealand and would result in Microsoft owning and operating TikTok in these markets. Microsoft may invite other American investors to participate on a minority basis in this purchase.\n This new structure would build on the experience TikTok users currently love, while adding world-class security, privacy, and digital safety protections. The operating model for the service would be built to ensure transparency to users as well as appropriate security oversight by governments in these countries.\n Among other measures, Microsoft would ensure that all private data of TikTok’s American users is transferred to and remains in the United States. To the extent that any such data is currently stored or backed-up outside the United States, Microsoft would ensure that this data is deleted from servers outside the country after it is transferred.\n Microsoft appreciates the U.S. Government’s and President Trump’s personal involvement as it continues to develop strong security protections for the country.\n These discussions are preliminary and there can be no assurance that a transaction which involves Microsoft will proceed. We do not intend to provide further updates until there is a definitive outcome to our discussions.", "posttime": "2020-08-03 07:40:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,微软,美国,讨论,continue", "title": "微软将继续讨论在美国收购TikTok的可能性", "title_en": "Microsoft to continue discussions on potential TikTok purchase in the US", "transed": 1, "url": "https://blogs.microsoft.com/blog/2020/08/02/microsoft-to-continue-discussions-on-potential-tiktok-purchase-in-the-united-states/", "via": "", "real_tags": ["microsoft", "微软", "美国", "讨论", "continue"]}, {"category": "", "categoryclass": "", "imagename": "c2817e6db63e8906c27ea36ff18837f4.jpg", "infoid": 1015822, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在轮子发明前数十万年，一些倒霉的古人类踩在松动的岩石或不稳定的原木上-就在他们头骨破裂之前-发现一个圆形物体可以减少与地面的摩擦。\n这一清晰时刻的必然性解释了古代无处不在的滚轴，滚轴只是放在重物下面的原木。埃及人和美索不达米亚人用它们来建造金字塔和滚动他们的重型设备，波利尼西亚人用它们来移动复活节岛上的石摩艾雕像。但滚轮的效率并不是很高，因为它们向前滚动时必须更换，即使它们被钉在下面，摩擦力也会使它们非常难以移动。解决之道--也是辉煌的一笔--就是车轴。然而，尽管滚轮很古老，但似乎没有人在任何地方发现过轮轴，直到大约6000年前一位独具匠心的陶工才发现了轮轴。\n迄今发现的最古老的车轴不是在马车或手推车上，而是在美索不达米亚的陶工轮子上。这些可能看起来很简单的机器，但它们是第一个证据表明，任何地方的人都认识到旋转磁盘的中心是静止的，并将其用于自己的机械优势。这是一个完全巧妙的观察，而且是如此新奇，以至于不清楚这个想法是从哪里来的-也许是从绳子上旋转的珠子？-因为它在本质上没有明显的推论。杆子被称为轴，许多学者认为它是人类历史上最伟大的机械洞察力。\n然而，在陶工的轮子和滚动物体上的一套轮子之间，还有另一个伟大的智力飞跃。全轮装置似乎最早是由波特的母亲或父亲发明的，因为世界上最古老的车轴是由粘土制成的，大约两英寸长，坐在滚动的动物雕像下面。\n1880年7月，考古学家DésiréCharnay在美洲发现了第一个前哥伦布时代的轮子。它在一个装在四个轮子上的小郊狼身上，查奈在一个埋葬在墨西哥城南部的阿兹特克儿童的坟墓里发现了它。\n正如Charnay在他的书“新世界的古代城市”中所假设的那样，这个玩具是“一位慈爱的母亲…”的纪念品。很久以前，她和她心爱的孩子一起埋葬了(它)。“。\n阿兹特克人的孩子生活在发明家之后数千年的高草原上，但在欧洲人带着轮子来到美洲之前，这表明在新旧世界，波特的母亲或父亲都独立发明了轮子和轮轴来制造玩具。\n与我交谈过的考古学家们不敢相信，在追求像玩物这样轻浮的东西时，会有如此非凡的洞察力。然而，工程师们却并非如此。相反，他们认为，如果第一个轮子和车轴出现在500磅的马车上，那将是非常了不起的。小版本的发明--现代称为模型或原型--几乎总是先于较大的发明。它们更容易构建，花费的时间要短得多，并且允许发明者快速发现潜在问题并找到解决方案。\n然而，尽管这位发明家很聪明，他们的玩具并没有引发一场社会革命。几百年后，把它缩成一套全尺寸轮子的人做到了。全尺寸马车最早出现在大约5400年前，它可能是历史上最早像病毒一样传播开来的发明之一。考古学家在几百年内发现了从伊拉克南部到德国的全尺寸手推车，当时文化障碍特别难以渗透。这辆马车似乎有不可抗拒的用处。\n当我问人类学家、“马、车轮和语言”(The Horse，The Wheels，and Language)一书的作者大卫·安东尼(David Anthony)，如何解释这种病毒式增长时，他认为部分原因可能是马车的巨大尺寸：“这可能是人们见过的最大的木制机器，”他说。他们会很大声；他们会很慢。它们是由成群的公牛提供动力的，这些公牛本身就是草原上最大的一些动物。\n马车的发明相当于史前的史前人造卫星；它并不是没有引起人们的注意。因为考古学家发现的两个最古老的轮子在设计上有很大的差异-一个轮轴固定在轮子上，就像在现代火车上一样，另一个就像在现代汽车上一样在轮轴上自由旋转-安东尼认为，至少有一些马车制造者复制了他们从远处看到的东西，而没有能力近距离检查。\n马车的发明和广泛采用对整个中东和欧洲的社会产生了立竿见影的戏剧性影响。它极大地提高了农民的生产力，并由此改变了景观。以前，农场需要一队人来搬运沉重的化肥、种子和庄稼，而马车则为单户经营提供了可能性。以前聚集在河流周围的种群激增到多产但未开发的草原上。马车改变了整个经济、生活方式、战争，甚至语言。安东尼写道：“很难夸大第一辆轮式交通工具的社会和经济重要性。”\n轮子可能是从一个微型模型开始的，但这个微型模型并没有改变世界。全尺寸版本做到了。而攀登微型轮子需要它自己的天才。安东尼认为，全尺寸的轮子和车轴可能需要如此精细的工艺，不可能用石器建造，只能用冶金学家最近才开始铸造的凿子和锥子来制造。最后，它不可能是分阶段制造的，这意味着第一个是由个人建造的。\n第一个全尺寸轮子的发明者的身份已经成为代表不可知的陈词滥调，但最近对早已消亡的语言的重建提供了一个强有力的新证据，使学者们比以往任何时候都更接近这位发明者。\n我会叫他Kweklos-简称Kay-古语言学家认为这可能是他用来表示“车轮”的词。在他的语言中，kweklos起源于动词“转向”，意思是他非常恰当地将他的发明称为“特纳”。我之所以称凯为“他”，是因为已知的第一个马车司机是一个埋在黑海以东马车顶上的人。\n凯出生在大约5400年前，由于凯的发明很受欢迎，这个日期得到了很好的支持。在从中东到西欧的考古记录中，马车和对马车的引用在几代人之间爆炸式增长。\n但是，如果凯的出生时间在很大程度上已经确定，那么在哪里出生就是一个激烈的学术辩论的主题。安东尼告诉我，马车“传播得如此之快，以至于不可能准确地确定一个明确而明显的最早日期。”到目前为止，两个全尺寸的马车轮子与考古学家发现的最古老的马车车轮并驾齐驱。一个来自卢布尔雅那的斯洛文尼亚沼泽；另一个来自俄罗斯北高加索黑海以东的著名雅姆纳耶文化坟墓，考古学家在那里发现的不仅是一个轮子，还有一整辆马车，上面坐着一具30多岁的男子的骨架。\n考古学不是准确定位病毒发明地点的合适科学。然而，有语言上的原因可以怀疑与他的马车一起埋葬的Yamnayan人可能住在离发明发生的地方很近的地方。许多古语言学家现在认为Yamnaya人说的是一种叫做原始印欧语(PIE)的语言，而对这种早已消亡的语言的重建表明，它是车轮发明者的母语。\n安东尼告诉我：“车轮的词汇表表明，大多数车轮和车轴的词汇都是说派的人从他们自己的动词和名词中创造出来的。”例如，表示“轴”(Axle)的派单词(Ak)源自表示“肩”的派单词，意思是说派的人使用本国语言而不是外语中的单词来指代车轮和马车。\n这一事实是至关重要的，因为当文化采用外国技术时，他们通常也会采用原始文化的术语。例如，当西班牙人把烟草从加勒比海带回来时，他们保留了当地的泰诺(Taino)一词tabako。车轮词汇的重建表明-尽管没有证明-凯是一个会说馅饼的雅姆纳耶人，就像那个与他的马车一起埋葬在俄罗斯西南角的人一样。\n凯是一个农民和牧民。他养了狗、马和羊，也许还穿了一些最早的羊毛衣服。他喜欢蜜酒，一种含酒精的蜂蜜饮料，他养牛，喝牛奶。他住在一个很可能聚集在河边的小农业社区的一所长房子里。\n语言证据表明，凯崇拜一位男性天神，为了纪念他而牺牲牛和马，并生活在一个有受人尊敬的酋长和战士的村庄里。Yamnayans人的DNA表明，凯可能有棕色的眼睛，深色的头发-尽管红色的可能性很小-还有一些橄榄色的皮肤。Yamnayan男子的平均身高约为5英尺9英寸，他可能有一个肌肉发达的体格，这是他多年在田里辛勤劳作的结果。\n凯的许多个人细节当然都是推测的，但有一件事是肯定的：第一辆马车的制造者在构思和工艺方面是个天才。没有其他解释。把玩具变成一辆全尺寸的马车意味着要解决一系列的工程、设计和木工问题。包括安东尼在内的一些学者认为，冶金学家在第一辆马车之前几代人才首次铸造铜工具，这并不是巧合。他们认为，用石器建造功能性车轮和车轴所需的精确工艺可能是不可能的。\n“为什么车轮是圆的”一书的作者Steven Vogel写道，车轮的第一个也是最关键的部件是与车轴的配合。太紧了，马车的效率就会低得无可救药，太松了，车轮就会摇晃和断裂。火柴盒大小的车轮和车轴不会揭示问题，模型也不会要求车轴的直径和长度之间的适当比例。太厚了，车轴产生了太多的摩擦；太薄了，它在负荷的压力下断裂了。\n那么就会有车轮本身的问题，这是一个欺骗性的复杂装置。如果凯为他的轮子砍下一棵倒下的树，那他的轮子很快就会失败。根据沃格尔的说法，问题在于纹理的方向，在意大利腊肠风格的木片中，纹理无法支撑边缘的重量。在承受压力的情况下，它会很快变形。凯的解决方案-从早期的车轮设计中可以明显看出-是用多块垂直切割的木板建造一个复合车轮。凯必须小心翼翼地把这些切口钉在一起，然后把它们塑造成一个完美的圆形轮子。\n凯的轮子的大小也是至关重要的。太小了，马车就不能越过任何坑洞，太大了，已经很重的车辆就不能动了。\n凯的手艺的天才不在于这些实现中的任何一个，而在于所有这些实现。正如安东尼指出的那样，这辆马车不可能分阶段组装起来。要么全有要么全无。它要么能用，要么不能。但即使有凯的工艺天才，如果不是牛的话，他的轮子也会变得毫无用处地巨大。\n大约一万年前，在土耳其已故的纳图菲亚人驯化牛之前，牛就开始是野生的奥鲁克。起初，纳图菲亚人只将它们用作肉类和牛奶，但到公元前四千年初，生活在现在的乌克兰的梅科普文化开始阉割雄性，并将它们用作工作动物。把牛变成牛并把它们折断在轭上的过程不会是令人愉快的。考古学家萨宾·莱因霍尔德(Sabine Reinhold)写道：“它代表了一个全新的驯化水平，远远超过了早期对动物生活方式的入侵。”它包括阉割、暴力和施加痛苦。莱因霍尔德写道，这些动物“变得昏昏欲睡”。“他们情绪低落。”\n受苦的不仅仅是公牛。值得一提的是，考古学家发现的这位早期的Yamnayan马车司机一生中遭受了26次不同的骨折，除了脊椎、左肋骨和脚的关节。他的生活是残酷的，但也许并不少见。许多用马车埋葬的最早的雅姆纳雅人都显示出大量的骨折，特别是在他们的手和脚上，可能是因为把牛放在轭上是人和动物之间的激烈斗争。梅科普人用鼻环的牛埋葬了他们的人，一些考古学家推测这是为了庆祝他们掌握了这种野兽。\n当凯第一次把他的牛拴在他几百磅、3英尺乘6英尺的马车上时，他永远改变了耕作方式。马车配有尖叫的木质部件和一队正在努力以步行的速度拖着它的牛。曾经需要一个村庄来搬运农场的重物，用一辆马车和一队牛群，只需要一个家庭。\n因此，Yamnayan家庭将他们的马车作为移动房屋，从他们聚集的村庄扩散到广阔的未开发的欧亚草原-然后又扩展到更远的地方。\nYamnayan人从高地草原滚滚而下，进入欧洲和东亚，带来了他们的马车、文化和语言。今天，世界上45%的人口会说一种从凯的馅饼中流传下来的舌头。英语、希腊语、拉丁语、梵语、葡萄牙语、西班牙语、瑞典语、斯洛伐克语、普什图语、保加利亚语、德语和阿尔巴尼亚语等不同的语言都可以追溯到馅饼。\n最近的DNA证据支持类似的结论：Yamnaya文化从大草原迁徙，淹没了南部和西部的文化。他们巨大的马车在他们的文化统治中起到了很大的作用，但他们最小的偷渡者可能起到了更大的作用。遗传学家在俄罗斯中部发现的5000年前的牙齿中发现了鼠疫耶尔森菌，这是导致黑死病的细菌的一个古老版本，他们认为雅姆纳亚人可能在不知不觉中挥舞着生物武器进入欧洲。\n也许这场瘟疫使凯成为早期的受害者之一。或者他可能死于车祸。无论是哪一种，他的发明早期的受欢迎程度表明，凯可能是他有生之年为数不多的被认可的古代发明家之一。由于将司机埋葬在马车上成为雅姆纳亚人的葬礼习俗，或许凯是第一个。\n科迪·卡西迪的“谁吃了第一只牡蛎？：历史上最伟大的第一次背后的非凡人物”，由企鹅图书出版公司出版，企鹅出版集团是企鹅兰登书屋有限责任公司的一个部门。版权所有©2020，作者：Cody Cassidy。\n如果您在我们的故事中使用链接购买东西，我们可能会赚取佣金。了解更多。\n✨使用我们齿轮团队的最佳选择优化您的家庭生活，从机器人吸尘器到价格实惠的床垫再到智能扬声器", "note_en": "Hundreds of thousands of years before the invention of the wheel, some unlucky hominin stepped on a loose rock or unstable log and—just before they cracked their skull—discovered that a round object reduces friction with the ground.\n The inevitability of this moment of clarity explains the ancient ubiquity of rollers, which are simply logs put underneath heavy objects. The Egyptians and the Mesopotamians used them to build their pyramids and roll their heavy equipment, and the Polynesians to move the stone moai statues on Easter Island. But rollers aren’t terribly efficient, because they have to be replaced as they roll forward, and even if they’re pinned underneath, friction makes them horribly difficult to move. The solution—and the stroke of brilliance—was the axle. Yet despite the roller’s antiquity, it doesn’t appear that anyone, anywhere, discovered the wheel and axle until an ingenious potter approximately 6,000 years ago.\n  The oldest axle ever discovered is not on a wagon or cart, but instead on a potter’s wheel in Mesopotamia. These may seem like simple machines, but they’re the first evidence that anyone anywhere recognized the center of a spinning disk is stationary and used it to their mechanical advantage. It’s a completely ingenious observation and so novel that it’s unclear where the idea came from—perhaps from a bead spinning on string?—as it has no obvious corollary in nature. The pole is called an axle, and many scholars consider it the greatest mechanical insight in the history of humankind.\n  Yet there exists another great intellectual leap between the potter’s wheel and a set of wheels on a rolling object. The full wheel set appears to have first been invented by a mother or father potter, because the world’s oldest axles are made of clay, are about two inches long, and sit beneath rolling animal figurines.\n   In July 1880, the archaeologist Désiré Charnay discovered the first pre‑Columbian wheel set in the Americas. It was on a small coyote figure mounted on four wheels, and Charnay found it in the tomb of an Aztec child buried south of Mexico City.\n  As Charnay presumes in his book  The Ancient Cities of the New World, the toy was a memento of “a fond mother … who, ages gone by, buried [it] with her beloved child.”\n The Aztec child lived thousands of years after the inventor in the high steppe but before the Europeans arrived with their wheels in the Americas, which suggests that in both the New and Old Worlds a mother or father potter independently invented the wheel and axle to make a toy.\n The archaeologists I spoke with are hesitant to believe such a remarkable insight could have been made in the pursuit of something as frivolous as an object for play. The engineers, however, are not. Instead, they believe it would be far more remarkable if the first wheel and axles appeared on 500‑pound wagons. Small versions of inventions—modernly called models or prototypes—nearly always precede larger ones. They are far easier to build, take far less time, and allow an inventor to quickly discover potential problems and find solutions.\n Yet as ingenious as this inventor was, their toy did not spark a societal revolution. The person who scaled it into a full‑size set of wheels a few hundred years later did. The full‑size wagon first appeared approximately 5,400 years ago, and it may be one of the the first inventions in history to go viral. Archaeologists have discovered full‑size carts from southern Iraq to Germany within a few hundred years of each other at a time when cultural barriers were particularly impermeable. The wagon, it seems, was irresistibly useful.\n  When I asked David Anthony, an anthropologist and the author of  The Horse, the Wheel, and Language, what explains this viral growth, he believes part of the reason may be the wagon’s sheer size: “These were probably the biggest wooden machines anyone had ever seen,” he says. They would have been loud; they would have been slow. And they were powered by teams of oxen, which were by themselves some of the largest animals in the steppe.\n The invention of the wagon was the prehistoric equivalent of Sputnik; it did not go unnoticed. Because the two oldest wheels archaeologists have found vary significantly in design—one has an axle fixed to the wheel as it does on a modern train, the other spins freely on the axle like on a modern car—Anthony suggests that at least some wagon builders copied what they saw from afar without being able to inspect it closely.\n The invention and widespread adoption of the wagon had an immediate and dramatic effect on societies throughout the Middle East and Europe. It drastically increased a farmer’s productivity, and in doing so altered the landscape. Where once farms required teams of people to move the heavy loads of fertilizer, seeds, and crops, the wagon allowed for the possibility of a single‑family venture. Populations that were previously clustered around rivers exploded onto the productive but unexploited steppe. The wagon changed entire economies, lifestyles, wars, and even languages. “It would be difficult to exaggerate the social and economic importance of the first wheeled transport,” writes Anthony.\n The wheel might have begun with a miniature, but the miniature didn’t change the world. The full‑size version did. And scaling a miniature wheel required its own genius. Anthony believes the full‑size wheel and axle may have required craftsmanship so delicate, it was impossible to build with stone tools and could only be made with the gouges and awls metallurgists had only recently begun to cast. Finally, it couldn’t have been made in stages, which means an individual built the first one.\n  The identity of the inventor of the first full‑size wheel has become a cliché representing the unknowable, but recent reconstructions of long‑dead languages have provided a powerful new piece of evidence that has brought scholars closer to the inventor than ever before.\n  I’ll call him Kweklos—Kay for short—which paleolinguists believe is the word he may have used for “wheel.” In his language, kweklos originates from the verb “to turn,” meaning he referred to his invention very appropriately as “the turner.” And I’ll call Kay a him because the first known wagon driver is a man buried atop his wagon east of the Black Sea.\n Kay was born roughly 5,400 years ago, a date that is well supported thanks to the popularity of Kay’s invention. Wagons and references to them explode in the archaeological record from the Middle East to Western Europe within a few generations of each other.\n But if the when of Kay’s birth has largely been established, the where is the subject of a lively academic debate. Anthony tells me the wagon “spread so fast that it’s impossible to pinpoint a clear and obvious earliest date.” As of now, two full‑size wagon wheels tie for the oldest that archaeologists have found. One comes from a Slovenian bog in Ljubljana; the second comes from the remarkable Yamnayan culture grave just east of the Black Sea in the North Caucasus, Russia, where archaeologists found not only a wheel but an entire wagon complete with the skeleton of a thirtysomething man sitting atop it.\n Archaeology is not the proper science for pinpointing the location of viral inventions. There are, however, linguistic reasons to suspect the Yamnayan man buried with his wagon may have lived close to where the invention occurred. Many paleolinguists now believe the Yamnaya spoke a language called Proto‑Indo‑European (PIE), and reconstructions of that long‑dead language suggest it’s the native language of the wheel’s inventor.\n  “The vocabulary for wheels shows that most of the words for wheels and axles were created by PIE speakers from their own verbs and nouns,” Anthony tells me. For example, the PIE word for “axle” ( aks) derived from the PIE word for “shoulder,” which means PIE speakers used a word from their own language rather than a foreign one to refer to the wheel and wagon.\n This fact is critical, because when cultures adopt foreign technology they typically adopt the originating culture’s terminology as well. When the Spanish brought the tobacco plant back from the Caribbean, for example, they kept the local Taino word  tabako. Reconstructions of wheel vocabulary suggest—though do not prove—that Kay was a PIE‑speaking Yamnayan like the man buried with his wagon in the southwest corner of Russia.\n  Kay was a farmer and a herder. He had dogs, horses, and sheep, and perhaps wore some of the earliest wool clothing. He enjoyed mead, an alcoholic honey drink, and he raised cattle and drank their milk. He lived in a long house in a small farming community likely clustered near rivers.\n Linguistic evidence suggests Kay worshipped a male sky god, sacrificed cows and horses in his honor, and lived in a village with respected chiefs and warriors. DNA of Yamnayans suggest Kay was likely to have had brown eyes, dark hair—though with an outside chance at red—and somewhat olive‑toned skin. The average height for Yamnayan men was approximately 5-foot-9, and he likely had a heavily muscled frame from years spent toiling in his field.\n Many of Kay’s personal details are of course speculative, but one thing is certain: The builder of the first wagon was a genius at conception and craft. There is no other explanation. Scaling the toy into a full‑size wagon meant solving a host of engineering, design, and woodworking problems. Some scholars, including Anthony, believe it isn’t a coincidence that metallurgists first cast copper tools only a few generations before the first wagon. They believe the precise craftsmanship needed to construct a functional wheel and axle may have been impossible with stone tools.\n The first and most critical component of the wheel, writes Steven Vogel, author of  Why the Wheel Is Round, is the fit with the axle. Too tight and the wagon is hopelessly inefficient, too loose and the wheel wobbles and breaks apart. The problem would not have been revealed by the matchbox‑size wheel and axles, nor would models have required the proper ratio between the diameter and length of the axle. Too thick and the axle creates too much friction; too thin and it breaks under strain of the load.\n Then there would have been the matter of the wheel itself, which is a deceivingly complex device. If Kay had cut a fallen tree salami‑style for his wheel, it would have quickly failed. The problem, according to Vogel, is the direction of the grain, which in a salami‑style slice of wood cannot support weight on its edge. Under strain, it would quickly deform. Kay’s solution—as is evident from early wheel design—was to build a composite wheel out of multiple vertically cut planks. Kay would have had to carefully dowel these cuts together, and then shape them into a perfectly round wheel.\n The size of Kay’s wheels would also have been critical. Too small and the wagon cannot surmount any potholes, too large and the already heavy vehicle becomes immobile.\n The genius of Kay’s craftsmanship lies not in any single one of these realizations; it’s in all of them. The wagon, as Anthony notes, could not have been put together in stages. It’s all‑or‑nothing. Either it works, or it doesn’t. But even with Kay’s crafting genius, his wheel would have been uselessly massive were it not for oxen.\n  Cattle began as wild aurochs before the late Natufians of Turkey domesticated them some 10,000 years ago. At first the Natufians used them exclusively for their meat and milk, but by the early fourth millennium BCE, the Maykop culture living in what is now Ukraine began to castrate the males and use them as work animals. The process of turning cattle into oxen and breaking them to the yoke would not have been pleasant. “It represented an entirely new level of domestication,” writes the archaeologist Sabine Reinhold, “far beyond earlier intrusions into animal lifestyles.” It involved castration, violence, and the infliction of pain. The animals “become lethargic,” Reinhold writes. “Their spirits are broken.”\n  It wasn’t just the oxen who suffered. Tellingly, the early Yamnayan wagon driver who was uncovered by archaeologists suffered 26 separate bone fractures throughout his life, in addition to arthrosis in his spine, left ribs, and feet. His life was a brutal one, but perhaps not unusual. Many of the earliest Yamnayans buried with wagons show numerous broken bones, particularly on their hands and feet, probably because submitting oxen to the yoke was a violent struggle between man and animal. The Maykop buried their people with nose‑ringed cattle, and some archaeologists speculate it was as a celebration of them having mastered the beast.\n When Kay first yoked his oxen to his several‑hundred‑pound, 3‑ by 6‑foot wagon, complete with screeching wooden components and a team of oxen straining to haul it at a walking pace, he changed farming forever. Where it once took a village to haul a farm’s heavy loads, with a wagon and a team of oxen it took only a family.\n  As a result, Yamnayan families, using their wagons as mobile homes, spread away from their clustered villages into the vast, unexploited Eurasian steppes—and then beyond.\n  The Yamnayan rolled down from the high steppe into Europe and East Asia, bringing their wagons, culture, and language. Today, 45 percent of the world’s population speaks a tongue descended from Kay’s PIE. Languages as disparate as English, Greek, Latin, Sanskrit, Portuguese, Spanish, Swedish, Slovak, Pashto, Bulgarian, German, and Albanian, to name a few, can all trace their roots back to PIE.\n Recent DNA evidence supports a similar conclusion: the Yamnaya culture moved from the steppes and swamped the cultures to its south and west. Their massive wagons played a large role in their cultural domination, but their smallest stowaway may have played an even larger one. Geneticists have located the bacterium  Yersinia pestis, an ancient version of the germ responsible for the Black Death, in 5,000‑year‑old teeth found in Central Russia and believe the Yamnaya may have unwittingly wielded a biological weapon as they rolled into Europe.\n Perhaps the plague made Kay one of its early victims. Or he may have died from an accident. Whichever it was, the early popularity of his invention is an indication Kay may have been one of the few ancient inventors to have been recognized within his lifetime. And because it became the funeral custom of the Yamnaya to bury drivers on their wagons, perhaps Kay was the first.\n  From   Who Ate the First Oyster?: The Extraordinary People Behind the Greatest Firsts in History by Cody Cassidy, published by Penguin Books, an imprint of Penguin Publishing Group, a division of Penguin Random House, LLC. Copyright © 2020 by Cody Cassidy.\n  If you buy something using links in our stories, we may earn a commission.  Learn more.\n   ✨ Optimize your home life with our Gear team’s best picks, from  robot vacuums to  affordable mattresses to  smart speakers", "posttime": "2020-08-03 07:39:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发明,invented,马车", "title": "谁发明了轮子？他们是怎么做的？", "title_en": "Who invented the wheel and how did they do it", "transed": 1, "url": "https://www.wired.com/story/who-invented-wheel-how-did-they-do-it/", "via": "", "real_tags": ["发明", "invented", "马车"]}, {"category": "", "categoryclass": "", "imagename": "a1035590f9291189e5b8a3165eebd2b2.jpg", "infoid": 1015819, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是我的选择，但我开始希望不是这样，我觉得自己没有资格。我当了20年的警长，所以我想我应该习惯于做决定，但我总是在脑子里迷失方向。我会在办公室里看着一块空白的电脑屏幕，然后突然意识到已经过去了整整一个小时。我很担心。我对一切都很担心。我想出来的每一种可能性都是不好的。\n州长告诉我们，我们必须在8月17日向学生开放我们的学校，否则我们会错过百分之五的资金。我在亚利桑那州偏远的地方经营着一个高需求区。我们90%是西班牙裔，超过90%的午餐是免费和折扣的。这些孩子需要我们能弄到的每一块钱。但是Covid在这个地区蔓延，击中了我的员工，现在感觉就像有人用枪指着我的头。我已经因为这种病毒失去了一位老师。即使这会让我们付出更多的生命，我也要冒着重新敞开大门的风险吗？或者我们远程办学，结果剥夺了这些孩子？\n这就是你的经典单马镇。想象一下约翰·韦恩骑马穿过仙人掌之类的场景。我是学校的负责人，高中校长，有时在课间还担任篮球裁判员。这是骨干员工，我们的平均年薪约为4万美元。我没什么可剪的了。我们正在购买虚拟学习的新程序，并试图为我们所有的孩子购买热点和iPad。我们预算的5%是数十万美元。这从何而来呢？我可能会失去教学职位或基本课程，除非我们以某种方式开始运作。\n我每天都在大楼里，给门消毒，并测量教室的空间。我们还没有收到有机玻璃护栏的订单，所以我们正在裁剪浴帘，试着凑合着用。这是一个又一个障碍。就在上周，我发现我们有另一名检测呈阳性的工作人员，所以我查看了OSHA和疾病预防控制中心的指导意见，并试图弄清楚方案。我不是这方面的专家，但我在联系人追踪方面尽了最大努力。我给10个员工打了电话，告诉他们可能接触到了病毒。我安排了不同的车，把我们都送到了考点。我的一些员工在哭。他们已经看到了可能发生的事情，他们带着我不能总是回答的问题来找我。“我们全家都需要检查吗？”“我需要隔离多久？”“如果这个病毒像对伯德夫人那样袭击我怎么办？”\n我们已经拿到两个测试了-都是阳性的。我们还在等八个人。这使得我的员工中有11%的人变得令人羡慕，自3月份以来，我们的大楼里就没有一个学生。我们的部分设施已经关闭进行净化，但是除非我想穿上防护服走进去，否则我们就没有人去净化它了。我们已经看到这种病毒对我们的维修部、运输、餐饮服务和教职员工造成的影响。就像这个地区要逐案关闭一样。我不明白怎么会有人期望我们这个月以一种感觉安全的方式重新开放大楼。就像他们在告诉我们：“好吧。夏天结束了。已经很久了。是时候恢复正常了。“。但从什么时候起这种病毒开始按我们的时间表运作了？\n我梦想回归正常。我很乐意敞开心扉。这些孩子现在很受伤。我不需要政客来告诉我这些。我们这个学区只有300名学生，他们就像家人一样。我妻子是这里的一名教师，我们有四个孩子在这些学校上学。我知道谁的父母从铜矿下岗，谁吃不饱饭。今年夏天我们送早餐和午餐，每天送的饭菜比学生还多。我接到处理贫困、抑郁、孤独、无聊等问题的家庭打来的电话。这些孩子中的一些人现在正在荒野中，学校是他们最好的地方。我们都同意这一点。但每次我在8月17日开始播放这一幕时，我都会反胃。我们超过四分之一的学生和祖父母住在一起。这些孩子很容易感染这种病毒，传播并带回家。这不安全。它不可能是安全的。\n如果你有其他想法，我很抱歉，但那是幻想。孩子们会生病，甚至更糟。家人会死的。老师会死的。\n伯德太太做的每件事都是对的。她遵循了所有的协议。如果在大流行期间教室里有一个安全、可控的环境，那就是它了。我们有三个老师共用一个房间，这样他们就可以教一个虚拟的暑期学校。他们太小心了。这要追溯到6月份，当时这里的病例开始激增。孩子们都在家里，但老师们想在教室里聚在一起，这样他们就可以在新技术上合作了。我觉得这是个好主意。房间很大。他们可以互相观看，互相学习。伯德太太是个桅杆\n起初她以为是鼻窦感染。医生是这么告诉她的，但情况越来越糟。我接到电话说她被紧急送往医院了。她的氧气量很低，他们马上就给她戴上了呼吸机。另外两名老师在同一个周末开始感觉不舒服，所以他们去做了检查。在接下来的一个月里，他们俩都过得很糟糕。伯德太太的丈夫得了病，住院了。她哥哥得了病就去世了。伯德太太抗争了几个星期，直到她再也打不动了。\n我已经在脑子里想了一千遍了。我们遗漏了哪些预防措施？我还能做些什么呢？我没有答案。这是三个负责任的成年人，在一个原本空荡荡的教室里，他们努力相互保护。我们还是控制不了它。这就是让我害怕的。\n我们把全体员工召集到一起进行悲伤咨询。我们虚拟地做了，超过了Zoom。这里有悲伤，也有太多的恐惧。我的妻子是我们小学的一名老师，她患有哮喘。她向我解释说，每个看到她的孩子都会自动给她一个拥抱。他们在早晨到达-拥抱。离开去休息-拥抱。午餐拥抱。更衣柜的拥抱。那是一整天了。即使我们把每件事都做得尽善尽美，细菌也会在学校内传播。我们共用一个空间。我们的空气是一样的。\n我们的一群老师告诉我，如果我们这个月开学，他们就会申请退休。他们在说：“请不要让我们回去。这太疯狂了。我们正在将整个社区置于危险之中。“。\n他们是对的。我百分之百同意他们的看法。老师们没有安全感。大多数家长在一项调查中表示，他们“非常担心”把孩子送回学校。那我们为什么要被胁迫开张呢？这个区还没准备好开放。我不能再让更多的人生病了。为什么他们要威胁我们的资金？我一直在等待更高级别的人从我手中夺走这个决定，让他们醒悟过来。我在等待真正的领导，但也许这不会发生。\n是我呀。这是我职业生涯中最重大的决定，有一点我可以肯定的是，无论是哪种情况，这都会带来伤害。", "note_en": "This is my choice, but I’m starting to wish that it wasn’t. I don’t feel qualified. I’ve been a superintendent for 20 years, so I guess I should be used to making decisions, but I keep getting lost in my head. I’ll be in my office looking at a blank computer screen, and then all of the sudden I realize a whole hour’s gone by. I’m worried. I’m worried about everything. Each possibility I come up with is a bad one.\n    The governor has told us we have to open our schools to students on August 17th, or else we miss out on five percent of our funding. I run a high-needs district in middle-of-nowhere Arizona. We’re 90 percent Hispanic and more than 90 percent free-and-reduced lunch. These kids need every dollar we can get. But covid is spreading all over this area and hitting my staff, and now it feels like there’s a gun to my head. I already lost one teacher to this virus. Do I risk opening back up even if it’s going to cost us more lives? Or do we run school remotely and end up depriving these kids?\n  This is your classic one-horse town. Picture John Wayne riding through cactuses and all that. I’m superintendent, high school principal and sometimes the basketball referee during recess. This is a skeleton staff, and we pay an average salary of about 40,000 a year. I’ve got nothing to cut. We’re buying new programs for virtual learning and trying to get hotspots and iPads for all our kids. Five percent of our budget is hundreds of thousands of dollars. Where’s that going to come from? I might lose teaching positions or basic curriculum unless we somehow get up and running.\n    I’ve been in the building every day, sanitizing doors and measuring out space in classrooms. We still haven’t received our order of Plexiglas barriers, so we’re cutting up shower curtains and trying to make do with that. It’s one obstacle after the next. Just last week I found out we had another staff member who tested positive, so I went through the guidance from OSHA and the CDC and tried to figure out the protocols. I’m not an expert at any of this, but I did my best with the contact tracing. I called 10 people on staff and told them they’d had a possible exposure. I arranged separate cars and got us all to the testing site. Some of my staff members were crying. They’ve seen what can happen, and they’re coming to me with questions I can’t always answer. “Does my whole family need to get tested?” “How long do I have to quarantine?” “What if this virus hits me like it did Mrs. Byrd?”\n  We got back two of those tests already — both positive. We’re still waiting on eight more. That makes 11 percent of my staff that’s gotten covid, and we haven’t had a single student in our buildings since March. Part of our facility is closed down for decontamination, but we don’t have anyone left to decontaminate it unless I want to put on my hazmat suit and go in there. We’ve seen the impacts of this virus on our maintenance department, on transportation, on food service, on faculty. It’s like this district is shutting down case by case. I don’t understand how anyone could expect us to reopen the building this month in a way that feels safe. It’s like they’re telling us: “Okay. Summer’s over. It’s been long enough. Time to get back to normal.” But since when has this virus operated on our schedule?\n  I dream about going back to normal. I’d love to be open. These kids are hurting right now. I don’t need a politician to tell me that. We only have 300 students in this district, and they’re like family. My wife is a teacher here, and we had four kids go through these schools. I know whose parents are laid off from the copper mine and who doesn’t have enough to eat. We delivered breakfast and lunches this summer, and we gave out more meals each day than we have students. I get phone calls from families dealing with poverty issues, depression, loneliness, boredom. Some of these kids are out in the wilderness right now, and school is the best place for them. We all agree on that. But every time I start to play out what that looks like on August 17th, I get sick to my stomach. More than a quarter of our students live with grandparents. These kids could very easily catch this virus, spread it and bring it back home. It’s not safe. There’s no way it can be safe.\n  If you think anything else, I’m sorry, but it’s a fantasy. Kids will get sick, or worse. Family members will die. Teachers will die.\n    Mrs. Byrd did everything right. She followed all the protocols. If there’s such a thing as a safe, controlled environment inside a classroom during a pandemic, that was it. We had three teachers sharing a room so they could teach a virtual summer school. They were so careful. This was back in June, when cases here were starting to spike. The kids were at home, but the teachers wanted to be together in the classroom so they could team up on the new technology. I thought that was a good idea. It’s a big room. They could watch and learn from each other. Mrs. Byrd was a master teacher. She’d been here since 1982, and she was always coming up with creative ideas. They delivered care packages to the elementary students so they could sprout beans for something hands-on at home, and then the teachers all took turns in front of the camera. All three of them wore masks. They checked their temperatures. They taught on their own devices and didn’t share anything, not even a pencil.\n  At first she thought it was a sinus infection. That’s what the doctor told her, but it kept getting worse. I got a call that she’d been rushed to the hospital. Her oxygen was low, and they put her on a ventilator pretty much right away. The other two teachers started feeling sick the same weekend, so they went to get tested. They both had it bad for the next month. Mrs. Byrd’s husband got it and was hospitalized. Her brother got it and passed away. Mrs. Byrd fought for a few weeks until she couldn’t anymore.\n  I’ve gone over it in my head a thousand times. What precautions did we miss? What more could I have done? I don’t have an answer. These were three responsible adults in an otherwise empty classroom, and they worked hard to protect each other. We still couldn’t control it. That’s what scares me.\n    We got the whole staff together for grief counseling. We did it virtually, over Zoom. There’s sadness, and it’s also so much fear. My wife is one of our teachers in the primary grade, and she has asthma. She was explaining to me how every kid who sees her automatically gives her a hug. They arrive in the morning — hug. Leave for recess — hug. Lunch — hug. Locker — hug. That’s all day. Even if we do everything perfectly, germs are going to spread inside a school. We share the same space. We share the same air.\n  A bunch of our teachers have told me they will put in for retirement if we open up this month. They’re saying: “Please don’t make us go back. This is crazy. We’re putting the whole community at risk.”\n  They’re right. I agree with them 100 percent. Teachers don’t feel safe. Most parents said in a survey that they’re “very concerned” about sending their kids back to school. So why are we getting bullied into opening? This district isn’t ready to open. I can’t have more people getting sick. Why are they threatening our funding? I keep waiting for someone higher up to take this decision out of my hands and come to their senses. I’m waiting for real leadership, but maybe it’s not going to happen.\n  It’s me. It’s the biggest decision of my career, and the one part I’m certain about is it’s going to hurt either way.", "posttime": "2020-08-03 07:13:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "督学,superintendent,孩子", "title": "亚利桑那州的一名督学关于安全重新开学：“这是一种幻想。”", "title_en": "An Arizona superintendent on safely reopening schools: 'It's a fantasy'", "transed": 1, "url": "https://www.washingtonpost.com/nation/2020/08/01/schools-reopening-coronavirus-arizona-superintendent/", "via": "", "real_tags": ["督学", "孩子"]}, {"category": "", "categoryclass": "", "imagename": "45befa9e79eae5bb3ba9e247c561fab4.jpg", "infoid": 1015818, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特斯拉最近因超过丰田成为全球最有价值的汽车公司而登上新闻头条，但如果你比较两家公司去年的汽车销量，就会发现这一事实相当令人难以置信：\n当然，特斯拉实现其价值更多的是基于未来的潜力，而不是现在的成就。在两极分化的首席执行官埃隆·马斯克(Elon Musk)的领导下，该公司已经为生产电动汽车铺平了道路，而此时全世界正朝着使用更可持续的能源的方向发展。\n但本周早些时候，马斯克在Twitter上发表了微妙的评论，可能会在很大程度上颠覆汽车业。在Teslarati上发表了一篇文章，强调德国汽车制造商试图弥合特斯拉技术与自己技术之间的差距，马斯克在推特上写道：\n马斯克在推特上写道，特斯拉对授权软件和提供动力总成和电池持开放态度。我们只是在努力加速可持续能源，而不是粉碎竞争对手！\n除了在电动汽车生产(以及支持这些产品所需的更大样式的电池)方面领先于竞争对手之外，特斯拉在将现代技术应用于其车辆方面也走在了前列。事实上，许多人将特斯拉描述为一家碰巧制造汽车的科技公司。\n相比之下，马斯克曾多次谈到实际生产质量稳定的汽车以及交付汽车所面临的挑战。他一度将特斯拉的旅程描述为从生产地狱到交付物流地狱。\n在光谱的另一端，有传统的汽车制造商，如丰田、大众、通用和福特。很大程度上是因为特斯拉的崛起，这些公司被迫推进自己的电动汽车努力。这是以巨大的成本和资源使用为代价的，因为他们基本上是从头开始的。\n然而，传统的汽车制造商在特斯拉的弱点方面表现出色：即制造和交付。自从他们制造汽车这么长时间以来，他们已经发展了巨大的工厂，以及一致和精致的工艺。\n但是，如果特斯拉能够与汽车制造商达成协议，授权其优势--软件和电池技术--会怎么样呢？\n传统汽车制造商可以(几乎)立即赶上特斯拉的技术，使他们能够专注于自己擅长的领域：制造和交付。\n特斯拉从许可协议中赚了很多钱，使其继续在软件创新领域处于领先地位。\n普通民众受益最大，因为整个汽车业更接近使用更可持续能源的目标，并在其车辆中融入新技术。\n如果你对马斯克的推文感到惊讶，你不应该感到惊讶。事实上，多年来，马斯克一直坚称，他的首要目标不是与规模更大的汽车制造商竞争，而是争取他们的支持。\n早在2014年，马斯克就在一篇著名的博客文章中阐述了这一点。在那篇博文中，他宣布特斯拉不会对其他想要使用其技术的公司提起专利诉讼。马斯克说，这是本着开源运动的精神，为了推动电动汽车技术的发展而做的。\n马斯克解释说，特斯拉最初寻求专利，是为了防止更大的汽车公司想要复制其技术，然后利用他们的大量资源让特斯拉倒闭。但没过多久，它就意识到了相反的事实：在发表这篇文章的时候，传统的汽车制造商的电动汽车项目规模很小，甚至根本不存在。\n马斯克写道，鉴于每年新车年产量接近1亿辆，全球车队约为20亿辆，特斯拉不可能以足够快的速度制造电动汽车来解决碳危机。我们真正的竞争对手不是生产非特斯拉电动车的涓涓细流，而是每天从世界各地的工厂涌出的大量汽油车。\n所以，我们来了。六年后，特斯拉不再是这个街区的新成员。不再是其他人不屑一顾的后起之秀汽车公司。\n但这不一定是一场零和游戏。它甚至不一定非得是一场竞争，至少不是与特斯拉的竞争。\n如果老牌汽车制造商够聪明，他们会抓住机会谈判一项对自己和特斯拉都有意义的授权协议。\n因为谁先弄清楚，谁就可能把自己打造成世界上第二大最有价值的汽车公司。", "note_en": "Tesla recently made headlines when it  overtook Toyota as the most valuable automotive company in the world. That fact is pretty unbelievable when you compare the amount of cars each company sold last year:\n    Of course, Tesla has achieved its value more on the basis of future potential than present accomplishments. The company, under the leadership of its  polarizing chief executive Elon Musk, has paved the way in producing electric vehicles, at a time when the world as a whole is moving toward using more sustainable sources of energy.\n But earlier this week, Musk made a subtle comment on Twitter that could majorly upend the auto industry. In response to  an article in Teslarati highlighting German automakers&#39; attempts to bridge the gap between Tesla&#39;s technology and their own,  Musk tweeted the following:\n  &#34;Tesla is open to licensing software and supplying powertrains &amp; batteries,&#34; tweeted Musk. &#34;We&#39;re just trying to accelerate sustainable energy, not crush competitors!&#34;\n  In addition to leading its rivals in EV production (and the larger style batteries needed to support these), Tesla is also at the forefront of utilizing modern technology in its vehicles. In fact, many have described Tesla as &#34;a tech company that happens to make cars.&#34;\n In contrast, though, Musk has repeatedly spoken on the challenges of actually manufacturing cars at consistent quality, as well as delivering them. At one point, he  described Tesla&#39;s journey as going from &#34;production hell to delivery logistics hell.&#34;\n On the other end of the spectrum, you have legacy automakers, like Toyota, Volkswagen, GM, and Ford. Largely because of Tesla&#39;s rise, these companies have been forced to advance their own electric vehicle efforts. This has come at enormous cost and use of resources, as they were basically starting from scratch.\n However, the legacy automakers excel where Tesla is weak: namely, manufacturing and delivery. Since they&#39;ve been making cars so long, they&#39;ve developed huge factories, along with consistent and refined processes.\n But what if Tesla could reach a deal with automakers to license its strength--software and battery technology?\n  Legacy automakers can (almost) immediately catch up to Tesla&#39;s tech, allowing them to focus on what they&#39;re good at: manufacture and delivery.\n  Tesla makes lots and lots of money from the licensing deal, allowing it to continue to lead the way in software innovation.\n  The general population benefits the most, as the auto industry as a whole moves closer to its goals of using more sustainable energy, and incorporating new technology in its vehicles.\n   If you&#39;re surprised by Musk&#39;s tweet, you shouldn&#39;t be. In fact, for years Musk has insisted that his primary goal is not to compete with larger automakers but, rather, to win them over.\n Musk articulated this as early as 2014, in a notable blog post. There he announced that Tesla would not initiate patent lawsuits against other companies that wanted to use its technology. This was done, said Musk, &#34;in the spirit of the open-source movement, for the advancement of electric vehicle technology.&#34;\n Musk explained that Tesla initially pursued patents in case larger car companies wanted to copy its technology and then use their massive resources to put Tesla out of business. But it didn&#39;t take long to realize the opposite had become true: At the time of publishing the post, legacy automakers&#39; electric vehicle programs were &#34;small to non-existent.&#34;\n Musk wrote, &#34;Given that annual new vehicle production is approaching 100 million per year and the global fleet is approximately two billion cars, it is impossible for Tesla to build electric cars fast enough to address the carbon crisis. Our true competition is not the small trickle of non-Tesla electric cars being produced, but rather the enormous flood of gasoline cars pouring out of the world&#39;s factories every day.&#34;\n So, here we are. Six years later, and Tesla is no longer the new kid on the block. No longer the upstart car company the others thumb their noses at.\n But this doesn&#39;t have to be a zero-sum game. It doesn&#39;t even have to be a competition, at least, not with Tesla.\n If the legacy automakers are smart, they&#39;ll jump at the opportunity to negotiate a licensing deal that makes sense for both themselves and Tesla.\n Because whoever figures it out first just may set themselves up to be the  second most valuable car company in the world.", "posttime": "2020-08-03 07:12:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "埃隆·马斯克,改变,musk,汽车", "title": "埃隆·马斯克悄悄透露了一项可能改变汽车业的计划", "title_en": "Elon Musk Quietly Revealed a Plan That Could Change the Auto Industry", "transed": 1, "url": "https://www.inc.com/justin-bariso/elon-musk-quietly-revealed-a-brilliant-plan-that-could-change-auto-industry.html", "via": "", "real_tags": ["埃隆·马斯克", "改变", "musk", "汽车"]}]