[{"category": "", "categoryclass": "", "imagename": "8cafb61878e4251570d1518ed1ed4765.jpeg", "infoid": 1011893, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Vox Media已经通知其工会，由于第一季度和第二季度广告收入大幅下滑，该公司计划裁员。\nVOX第二季营收预估下降40%，计划达不到全年目标25%。\n据知情人士透露，拥有纽约杂志(New York Magazine)、The Verge、SBNation和Eater等媒体资产的Vox Media已通知其工会，为全公司范围内的裁员做准备。\n知情人士说，Vox周一与工会领导人进行了交谈，告知他们裁员计划。由于讨论是私下进行的，这些知情人士要求不具名。由于新冠肺炎影响广告预算，Vox在4月份解雇了约百名员工，占员工总数的9%。\n据一位知情人士透露，许多尚未采取买断措施的被暂时解雇的员工将被解雇。这些员工主要为VOX受疫情影响特别严重的部门工作，如SBNation、Curbed和该公司的事件组。两名知情人士表示，可能会进一步裁员。\n其中两名知情人士表示，代表Vox&#1200名员工中约350人的美国东部编剧协会(Writers Guild，East)和代表“纽约杂志”(New York Magazine)员工的纽约新闻协会(NewsGuild Of New York)本周都将与高管会面。其中一位知情人士说，VOX希望在周五之前解决这些讨论。\nVOX在2019年实现盈利，并计划在2020年实现更高的盈利。其中两名知情人士说，虽然该公司实现了2020年前两个月的收入目标，但Vox第二季度的预测比预期低了40%，并计划将全年目标实现25%。知情人士说，首席执行官吉姆·班科夫(Jim Bankoff)上周召开了全体员工会议，概述了公司的整体困境，同时也强调了一些亮点，比如播客收入反弹到Covid之前的水平。由于会议细节是私下进行的，这些知情人士要求不具名。\n与一些同行不同的是，Vox在4月份试图避免裁员，希望业务前景会有所改善。美国各地的媒体公司在冠状病毒大流行期间不得不裁员和减薪，以弥补广告收入的损失。\n知情人士说，工会领导人已要求Vox代表在周三之前提供更多数据，以支持裁员的必要性。VOX发言人拒绝置评。", "note_en": "Vox Media has informed its unions that it plans to cut jobs as advertising revenue has slumped in the first and second quarters.\n  Vox was 40% off its revenue forecast for the second quarter and plans to miss its full-year target by 25%\n Vox Media, the owner of media properties including New York Magazine, The Verge, SBNation and Eater, has informed its worker unions to prepare for company-wide layoffs, according to people familiar with the matter.\n Vox spoke with union leaders Monday to inform them of their plan to cut staff, said the people, who asked not to be named because the discussions are private. Vox furloughed about 100 employees in April, or 9% of its staff, until July 31 as Covid-19 affected advertising budgets.\n  Many of the furloughed workers who haven&#39;t already taken buyouts will be laid off, according to a person familiar with the matter. These employees primarily work for parts of Vox that were especially hit hard by the Pandemic, such as SBNation, Curbed and the company&#39;s events group. There are likely to be additional job cuts, two people said.\n Both the Writers Guild of America, East, which represents about 350 of Vox&#39;s 1,200 employees, and NewsGuild of New York, which represents New York Magazine employees, are meeting with executives this week, two of the people said. Vox hopes to resolve those discussions by Friday, one of the people said.\n Vox reached profitability in 2019 and planned to become even more profitable in 2020. While the company hit its revenue targets for the first two months of 2020, Vox was 40% off its forecast for the second quarter and plans to miss its full-year target by 25%, said two of the people. Chief Executive Jim Bankoff held an all-hands meeting last week outlining the company&#39;s overall struggles while also highlighting some bright spots, such as podcast revenue bouncing back to pre-Covid levels, said the people, who asked not to be named because the meeting&#39;s details were private.\n Unlike some of its peers, Vox attempted to avoid layoffs in April, hoping the business outlook would improve. Media companies  across the U.S. have had to cut salary and staff during the coronavirus pandemic to make up for lost advertising revenue.\n Union leaders have asked Vox representatives for more data to back up the need for layoffs by Wednesday, said the people. A Vox spokesperson declined to comment.", "posttime": "2020-07-15 06:43:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "准备,media", "title": "由于业务未能改善，Vox Media准备进行一轮裁员", "title_en": "Vox Media preparing round of layoffs as business fails to improve", "transed": 1, "url": "https://www.cnbc.com/2020/07/14/vox-media-preparing-round-of-layoffs-due-to-coronavirus-business-impact.html", "via": "", "real_tags": ["准备", "media"]}, {"category": "", "categoryclass": "", "imagename": "f0d68d5c7e39e56200b895689a1c9ae5.png", "infoid": 1011892, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无论它们是像捏面包一样揉我们的肉，还是跟着我们进浴室，猫总是试图告诉它们的人类一些事情--大部分是关于食物的。但一位动物行为学家告诉我们，反过来，猫表现出的一种熟悉的行为可能是爱的真实迹象。\n经常有传言说，猫的“缓慢眨眼”是它表达“我爱你”的方式。它甚至被称为“猫吻”！事实是，我们永远不会真正知道小猫的大脑里发生了什么，但是有证据表明，一只猫慢慢地向它的人类眨眼意味着它信任它的同伴。\n加州大学戴维斯兽医学院的猫研究员米克尔·德尔加多(Mikel Delgado)告诉Inverse：“猫在害怕或受到威胁时通常会避免眼神接触；当它们表现出攻击性时，它们会盯着它们看(盯着它们会被认为是一种威胁)，”加州大学戴维斯大学兽医学院的猫研究员米克尔·德尔加多(Mikel Delgado)告诉Inverse。“缓慢的眨眼是没有凝视的眼神交流的表现，我们将这一行为解读为放松和信任的标志。有些人可能会称之为爱。“。\n这样想吧：如果一只猫闭上眼睛好像要睡着了，那它就是在暗示它不会把你视为威胁。这类似于一些猫在人类面前露出肚子的方式，这表明了信任和脆弱。对于小猫来说，没有极端的仇恨就是爱，正如猫主人所知道的那样，没有介于两者之间的东西。\n“我一直听说”缓慢眨眼“是爱的象征，我试着马上也这么做，”“猫咪的神秘：关于女人和猫之间的神秘联系”一书的作者克莉亚·西蒙告诉“反转”杂志。\n虽然盯着你的猫咪圆圆的眼睛是很诱人的，但专家警告说，这可能会被解读为攻击性的迹象。取而代之的是，试着每隔一段时间给你的猫一个缓慢的眨眼，看看他或她是否会还给你。如果你的猫不眨眼，这并不意味着它们鄙视你--也许它们只是表达感激的方式不同而已。\n兽医行为学家Wailani Sung在“兽医街”上写道：“我总是建议人们看猫眨眼，然后慢慢地向猫伸出一根手指，让它闻一闻”，兽医行为学家威拉尼·宋(Wailani Sung)在“兽医街”(VetStreet)上写道。“如果猫咪愿意与那个人进行更多的互动，它会闻一下手指，可能会试着用手指摩擦她的脸，或者低下头以引起注意。”如果猫咪向后退或者用蝙蝠咬手指，这是一个明确的信号，表明猫咪不想与人进行任何身体上的互动。“。\n猫，虽然它们可能是反复无常的，但它们从来没有用完的方式来向人类表明它们真的关心我们。虽然他们对爱的定义模糊地解释为“我不想在这个特殊的时刻谋杀你”，但这仍然是爱。", "note_en": "Whether they’re  kneading our flesh like bread or  following us into the bathroom, cats are always trying to tell their humans  something — most of it involving food. But an animal behaviorist tells  Inverse one familiar behavior cats exhibit could be a true sign of affection.\n It’s often been rumored that a cat’s “slow blink” is its way of saying, “I love you.” It’s even  been called a “cat kiss”! The truth is, we’ll never truly know what’s going on inside a kitty’s brain, but there’s evidence to suggest a cat slowly winking at its human means it trusts its companion.\n “Cats will typically avoid eye contact when afraid or threatened; when they are being offensively aggressive, they will stare (and staring at them is perceived as a threat),” Mikel Delgado, a cat researcher the University of California Davis School of Veterinary Medicine, tells  Inverse. “The slow blink is a demonstration of eye contact without staring, and we interpret this behavior as a sign of relaxation and trust. Some might call that love.”\n  Think of it this way: If a cat closes its eyes around like it’s falling asleep, it’s signaling that it doesn’t view you as a threat. This is similar to the way some cats  expose their bellies to their humans, which signals trust and vulnerability. For kitties, the absence of extreme hatred is love, and as cat owners know, there is no in between.\n “I have always heard that the “slow blink” is a sign of love, and I try to do it right back,”  Clea Simon, author of  The Feline Mystique: On the Mysterious Connection Between Women and Cats tells  Inverse.\n  While it’s tempting to stare into your cat’s bulbous eyes, experts warn this  could be interpreted as a sign of aggression. Instead, try and give your cat a slow blink every once in a while and see if he or she returns it. If your cat doesn’t blink back, this doesn’t mean they despise you — maybe they just have a different way of expressing appreciation.\n “I always recommend to a person that they look for a blink from the cat and then slowly extend a finger out toward the cat and allow her to sniff,” veterinary behaviorist Wailani Sung  writes in  VetStreet. “If the cat is receptive to more interactions with that person, she will sniff the finger and may try to rub her face on the finger or lower her head for attention. If the cat backs away or bats at the finger, it is a clear sign the kitty does not want any physical interactions with the person.”\n   Cats, capricious as they may be, never run out of ways to show humans they actually care about us. Though their definition of love vaguely translates to “I don’t wish to murder you at this particular moment,” it’s love nonetheless.", "posttime": "2020-07-15 06:42:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "眨眼,slow,可能", "title": "根据“科学”，为什么猫对人类的眨眼速度很慢？", "title_en": "Why Cats Slow Blink at Humans, According to Science", "transed": 1, "url": "https://www.inverse.com/article/43553-why-cats-slow-blink-humans-science-explains", "via": "", "real_tags": ["眨眼", "slow", "可能"]}, {"category": "", "categoryclass": "", "imagename": "d93ac9c1ccc2ecb17580c6ccbcab68b2.jpg", "infoid": 1011891, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "民主党总统候选人、前副总统乔·拜登(Joe Biden)今天公布了一项2万亿美元的政策纲领，寻求通过大幅扩大对基础设施改善和清洁能源的投资，同时解决气候危机和日益恶化的流行病引发的经济危机。\n拜登计划中的建议与众议院气候危机特别委员会本月早些时候发布的一揽子政策一致。众议院民主党人的计划(一份550页的PDF)非常高的水平，要求首先让美国在2050年实现净零排放，然后利用后半个世纪实现负排放。这一雄心勃勃的目标将通过在能源、交通、住房、建筑、制造、农业、电信和基础设施等领域采取新的法规和激励措施来实现。\n拜登的计划，正如他的竞选网站上所概述的那样，远没有国会提案方案那么深入，但可能更具侵略性。\n拜登呼吁在四年(一个总统任期)内立即在基础设施、能源、交通、建筑和农业部门投资2万亿美元，用于一些相当大的项目。\n该计划要求的基础设施投资正是你所想的：道路、桥梁、供水系统和电力系统的维修和升级，以及在全国范围内部署普遍的宽带。同样，交通投资涵盖了你对竞选活动的期望：电动汽车充电站和更多的美国汽车制造业工作岗位。\n然而，值得注意的是，拜登的计划还呼吁大幅增加公共交通的资金，无论是在已经拥有公共交通的城市，还是在没有公共交通的城市。每个拥有10万居民或更多居民的美国城市，其中大约有300个来来去去，都应该有机会使用高质量的零排放公共交通选择，这不仅包括铁路和公共汽车，还包括为骑自行车和步行的人提供更安全、更大的基础设施。\n拜登的计划还呼吁彻底扩张清洁能源，而且(相对而言)要迅速。他写道，到2035年，美国的电力应该是无碳污染的，这将通过投资来实现，这些投资将刺激关键清洁能源技术的快速发展和广泛商业采用，包括电池储存、负排放技术、下一代建材、可再生氢和先进的核技术。\n该计划补充说，除了扩大清洁能源外，我们还应该更好地清理我们已经造成的现有烂摊子，创造25万个工作岗位，封堵废弃的油井和天然气井，并回收废弃的煤炭、硬岩和铀矿。这些清理努力将减少有毒产品泄漏到当地的空气和水供应中，并防止当地的环境破坏。\n拜登计划和国会计划一样，也呼吁密切关注谁受益，谁受到美国政策的伤害，而且它是通过关注环境正义来做到这一点的。他写道，拜登将通过以下方式做到这一点：在落后的社区创造良好的、工会的、中产阶级的就业机会，在首当其冲受到污染冲击的社区纠正错误，并从我们伟大的国家-农村、城市和部落-提出最好的想法。\n受环境污染物影响最严重的社区是有色人种的低收入社区。例如，2019年的一项研究发现，美国黑人暴露在车辆造成的空气污染中的比例比白人高66%。就连特朗普政府也在2018年得出结论，在美国，有色人种比美国白人更有可能呼吸污染的空气。黑人、拉丁裔和低收入社区也更有可能面临致癌污染物或生活在受污染的供水中。\n拜登解释说，他的计划将基本上利用整个联邦机构来产生真正有利于每个人的变革--或者用他的话说，是一种包容和授权的全政府方式。这将包括在司法部内设立一个新的部门，专门致力于在法律允许的最大程度上对污染者提起环境刑事诉讼，并在必要时寻求额外的立法，追究公司高管的个人责任。这包括坐牢，以及在必要时寻求额外的立法，以追究企业高管的个人责任，这包括坐牢等。这将包括在司法部内设立一个新的部门，专门致力于对污染者提起环境刑事诉讼，并在必要时寻求额外的立法，追究公司高管的个人责任。\n此外，拜登将重组和扩大白宫环境咨询小组，并彻底改革EPA的民权合规办公室。该计划还创建了一个民间气候队，在科学家和土地管理专家的指导下，在林业管理和湿地恢复等领域开展工作。这项工作将增强韧性，减轻未来自然灾害(如飓风和野火)造成的损害，这些灾害可能会因气候变化而加剧。\n拜登在家乡特拉华州发表的讲话(视频)中明确将他的气候计划与仍在席卷美国的新冠肺炎流行病联系在一起。拜登说，美国需要应对这场气候危机，这场危机可能会让我们陷入比当前的大流行更黑暗、更持久的阴影中，他补充说，重启计划应该建立一个未来的经济，而不是过去的经济。\n拜登补充说，未来的经济看起来就像数百万高薪的工会工作岗位，创造了现代化的基础设施和清洁能源的未来。这些是我们为美国经济的长期健康和活力，以及美国人民的长期身体健康和安全所能做的最重要的投资。", "note_en": "Democratic presidential candidate and former Vice President Joe Biden today unveiled a $2 trillion policy platform that seeks to address both the climate crisis and the worsening pandemic-driven economic crisis by drastically expanding investments in infrastructure improvements and clean energy.\n The proposals in the Biden plan are in line with a policy package  released earlier this month by the House Select Committee on the Climate Crisis. The House Democrats&#39; plan (a 550-page  PDF), at a very high level, calls first for bringing the United States to net-zero emissions by 2050, then for using the back half of the century to get to negative emissions. That ambitious goal would be reached by adopting new regulations and incentives in energy, transportation, housing, construction, manufacturing, agriculture, telecommunications, and infrastructure, among other sectors.\n Biden&#39;s plans, as  outlined on his  campaign website, go much less in-depth than the Congressional proposal package but are perhaps even more aggressive.\n  Biden calls for a $2 trillion investment across four years—one presidential term—to be spread immediately across the infrastructure, energy, transportation, construction, and agriculture sectors for some fairly large projects.\n The infrastructure investment the plan calls for is exactly what you think: repairs and upgrades to roads, bridges, water systems, and electric systems as well as the deployment of universal broadband nationwide. Similarly, the transportation investment covers about what you&#39;d expect from the campaign: electric vehicle charging stations and more US auto manufacturing jobs.\n Notably, however, Biden&#39;s plan also calls for a drastic increase in funding for public transportation, both in cities that already have it and in cities that do not. &#34;Every American city with 100,000 or more residents,&#34; of which there are roughly 300 give or take, should have access to &#34;high-quality, zero-emissions public transportation options,&#34; which not only includes rail and buses but also safer, expanded infrastructure for bicyclists and pedestrians.\n Biden&#39;s plan also calls for a radical expansion of clean energy, and  fast (relatively speaking). US electricity should be &#34;carbon pollution free&#34; by 2035, he writes, which would be achieved by investments that spur rapid development in and widespread commercial adoption of &#34;critical clean energy technologies, including battery storage, negative emissions technologies, the next generation of building materials, renewable hydrogen, and advanced nuclear&#34; technologies.\n In addition to expanding clean energy, the plan adds, we should clean up better after  existing messes we&#39;ve already made, by creating &#34;250,000 jobs plugging abandoned oil and natural gas wells and reclaiming abandoned coal, hardrock, and uranium mines.&#34; Those clean-up efforts would reduce leakage of toxic products into local air and water supplies and prevent local environmental damage.\n  The Biden plan, like the Congressional plan, also calls for keeping a careful eye on who benefits and who is harmed by US policy, and it does so by focusing on environmental justice. Biden would do that by &#34;creating good, union, middle-class jobs in communities left behind, righting wrongs in communities that bear the brunt of pollution, and lifting up the best ideas from across our great nation—rural, urban, and tribal,&#34; he writes.\n The communities that tend to be hardest-hit by environmental pollutants are low-income communities of color. One 2019 study, for example, found Black Americans being  exposed to 66 percent more air pollution from vehicles than their white counterparts. Even the Trump administration  concluded in 2018 that people of color are more likely to breathe polluted air in the United States than white Americans. Black, Latinx, and low-income communities are also more likely to face  cancer-causing pollutants or to live with  tainted water supplies.\n Biden&#39;s plan would leverage basically the entire federal apparatus to generate change that actually benefits everyone, he explains—or, in his terms, an &#34;inclusive and empowering, all-of-government approach.&#34; That would include the establishment of a new division inside the Department of Justice expressly devoted to pursuing criminal environmental prosecutions for polluters, &#34;to the fullest extent permitted by law and, when needed, seek additional legislation to hold corporate executives personally accountable.&#34; That includes jail time, &#34;where merited.&#34;\n  Additionally, Biden would restructure and expand White House environmental advisory groups and overhaul the EPA&#39;s office of civil rights compliance. The plan also creates a Civilian Climate Corps to work under scientists and land-management experts in areas such as forestry management and wetland restoration. That work would bolster resilience and mitigate damage from future natural disasters, such as hurricanes and wildfires, that can be exacerbated by climate change.\n Biden explicitly tied his climate plan to the COVID-19 pandemic still sweeping the United States in remarks ( video) he delivered in his home state of Delaware. The US needs to &#34;deal with the climate crisis that could cast us into an even darker and more permanent shadow&#34; than the current pandemic, Biden said, adding that plans to reopen should &#34;build an economy of the future, not an economy of the past.&#34;\n That &#34;economy of the future&#34; looks like &#34;millions of high-paying union jobs creating a modern infrastructure and a clean energy future,&#34; Biden added. &#34;These are the most critical investments we can make for the long-term health and vitality both of the American economy and the long-term physical health and safety of the American people.&#34;", "posttime": "2020-07-15 06:22:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "气候,美国", "title": "拜登2T美元气候计划中污染者入狱", "title_en": "Jail time for polluters in Biden’s $2T climate plan", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/07/jail-time-for-polluters-in-bidens-2t-climate-plan/", "via": "", "real_tags": ["气候", "美国"]}, {"category": "", "categoryclass": "", "imagename": "93c87ca3be862d3b6748d689b620d987.jpg", "infoid": 1011889, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "日期：1966年9月30日。类型：地下，-1532米位置：乌兹别克斯坦乌尔塔-布拉克。产量：3万吨高清历史上罕见的镜头显示了核子…", "note_en": "Date: 30 September, 1966. Type: underground, -1532 m Location: Urta-Bulak, Uzbekistan. Yield: 30 kilotons HD Historic rare footage shows the moment a nuclear...", "posttime": "2020-07-15 06:19:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苏联,引爆,detonated,显示", "title": "苏联引爆核弹扑灭燃烧的气井[视频]", "title_en": "USSR detonated a nuclear bomb to put out a burning gas well [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=3kwQfjGnVpw&feature=youtu.be", "via": "", "real_tags": ["苏联", "引爆", "detonated", "显示"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1011888, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们很抱歉。设置您的用户Cookie时出错。请将您的浏览器设置为接受Cookie以继续。\n当您从一个页面导航到另一个页面时，nejm.org会记住您的会话ID，从而使用cookie来提高性能。此Cookie仅存储会话ID；不捕获任何其他信息。接受NEJM cookie是使用网站所必需的。", "note_en": "Our apologies. An error occurred while setting your user cookie. Please set your browser to accept cookies to continue.\n NEJM.org uses cookies to improve performance by remembering your session ID when you navigate from page to page. This cookie stores just a session ID; no other information is captured. Accepting the NEJM cookie is necessary to use the website.", "posttime": "2020-07-15 06:19:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "sars,vaccine,cookie", "title": "抗SARS-CoV-2 mRNA疫苗的初步报告", "title_en": "An MRNA Vaccine Against SARS-CoV-2 – Preliminary Report", "transed": 1, "url": "https://www.nejm.org/doi/full/10.1056/NEJMoa2022483", "via": "", "real_tags": ["sars", "vaccine", "cookie"]}, {"category": "", "categoryclass": "", "imagename": "9ef477bc817d59e25d7ecefc98de39a3.jpg", "infoid": 1011887, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "DNS通常被描述为“互联网的电话簿”，它是一种用于将人类友好的计算机主机名翻译成IP地址的网络协议。因为它是互联网的核心组件，所以有很多DNS服务器的解决方案和实现，但被广泛使用的只有几个。\n“Windows DNS服务器”是Microsoft的实施，是Windows域环境的重要组成部分和要求。\nSIGRed(CVE-2020-1350)是Windows DNS服务器中的一个易受攻击的严重漏洞(CVSS基本分数为10.0)，它会影响Windows Server 2003至2019版，并可由恶意DNS响应触发。由于该服务在提升的权限(系统)下运行，如果攻击成功，攻击者将被授予域管理员权限，从而有效地危害整个公司基础架构。\n我们的主要目标是找到一个漏洞，该漏洞会让攻击者危害Windows域环境，最好是未经身份验证。各种独立的安全研究人员以及由民族国家发起的研究都有大量的相关研究。大多数公开发布的材料和漏洞都集中在Microsoft对SMB(EternalBlue)和RDP(BlueKeep)协议的实现上，因为这些目标同时影响服务器和端点。要获得域管理员权限，一种直接的方法是直接利用域控制器。因此，我们决定将研究重点放在主要存在于Windows Server和域控制器上的较少公开探索的攻击面上。输入WinDNS。\n“域名系统(DNS)是组成TCP/IP的行业标准协议组之一，DNS客户端和DNS服务器一起向计算机和用户提供计算机名称到IP地址映射名称解析服务。”-Microsoft。\nDNS主要使用端口53上的用户数据报协议(UDP)来服务请求。DNS查询包括来自客户端的单个UDP请求，后跟来自服务器的单个UDP回复。\n除了将名称转换为IP地址外，DNS还具有其他用途。例如，邮件传输代理使用DNS查找传递电子邮件的最佳邮件服务器：MX记录提供域和邮件交换器之间的映射，这可以提供额外的容错和负载分布层。可在维基百科上找到可用的DNS记录类型及其相应用途的列表。\n但这篇博客文章的重点不是介绍DNS功能和历史的冗长论述，所以我们鼓励您在这里阅读更多关于DNS的内容。\n单个DNS消息(响应/查询)在UDP中限制为512字节，在TCP中限制为65,535字节。\nDNS本质上是层次化和分散化的。这意味着当DNS服务器不知道其收到的查询的答案时，该查询将被转发到层次结构中位于其上方的DNS服务器。在层次结构的顶部有全球13个根DNS服务器。\nDNS服务器-dns.exe负责在安装了DNS角色的Windows服务器上回答DNS查询。\nDNS服务器解析转发查询的响应(应答)的方式中存在错误。\n由于DNS查询没有复杂的结构，因此在第一个场景中发现解析问题的可能性较低，因此我们决定以解析转发查询的传入响应的函数为目标。\n如前所述，转发查询是利用DNS体系结构能够将其不知道答案的查询转发到层次结构中其上方的DNS服务器。\n但是，大多数环境将其转发器配置为知名的、受人尊敬的DNS服务器，如8.8.8.8(Google)或1.1.1.1(Cloudflare)，或者至少是不受攻击者控制的服务器。\n这意味着即使我们在解析DNS响应时发现问题，我们也需要建立中间人来利用它。显然，这还不够好。\nNS代表“名称服务器”，该记录指示哪个DNS服务器是该域的授权机构(哪个服务器包含实际的DNS记录)。NS记录通常负责解析给定域的子域。一个域通常具有多个NS记录，这些NS记录可以指示该域的主和备份名称服务器。\n要让目标Windows DNS服务器解析来自我们的恶意DNS名称服务器的响应，我们执行以下操作：\n配置我们域的(deadbeef.un)NS记录以指向我们的恶意DNS服务器(ns1.41414141.Club)。\n受害者DNS(尚不知道此查询的答案)将查询转发到其上方的DNS服务器(8.8.8.8)。\n权威服务器(8.8.8.8)知道答案，并响应Deadbeef.un的NameServer是ns1.41414141.Club。\n下次我们查询deadbeef.un的子域时，目标Windows DNS服务器还将查询ns1.41414141.Club以获得响应，因为它是该域的NameServer。\n支持的响应类型之一是用于SIG查询。根据维基百科，SIG查询是“SIG(0)(RFC2931)和TKEY(RFC2930)中使用的签名记录。RFC 3755指定RRSIG作为SIG的替代品，在DNSSEC内使用。“。\n让我们检查一下Cutter为dns.exe！SigWireRead(SIG响应类型的处理程序函数)生成的反汇编：\n传递给RR_AllocateEx(负责为资源记录分配内存的函数)的第一个参数按以下公式计算：\n签名字段大小可以改变，因为它是SIG响应的主要有效载荷。\n如下图所示，RR_AllocateEx希望其参数在16位寄存器中传递，因为它只使用RDX的DX部分和RCX的CX部分。\n这意味着，如果我们可以使上面的公式输出大于65,535字节(16位整数的最大值)的结果，我们就会有一个整数溢出，这会导致比预期小得多的分配，这可能会导致基于堆的缓冲区覆盖。\n非常方便的是，此分配的内存地址随后作为memcpy的目标缓冲区传递，从而导致基于堆的缓冲区溢出。\n总而言之，通过发送包含较大(大于64KB)SIG记录的DNS响应，我们可以在较小的已分配缓冲区上导致约64KB的受控基于堆的缓冲区溢出。\n现在我们可以让受害的DNS服务器向我们的DNS服务器查询各种问题，我们已经有效地将其转换为客户端。我们可以让受害的DNS服务器向我们的恶意DNS服务器询问特定类型的查询，并分别以匹配的恶意响应进行回答。\n我们认为触发此漏洞所需的全部操作就是让受攻击的DNS服务器向我们查询SIG记录，并使用长签名(长度&&gt;=64KB)对其作出SIG响应。我们失望地发现，UDP上的DNS的大小限制为512字节(如果服务器支持EDNS0，则为4096字节)。在任何情况下，这都不足以触发漏洞。\n但是，如果服务器有合法的理由发送大于4096字节的响应，会发生什么情况呢？例如，冗长的TXT响应或可解析为多个IP地址的主机名。\n根据DNS RFC 5966：“在没有EDNS0(DNS 0的扩展机制)的情况下，任何需要发送超过512字节限制的UDP响应的DNS服务器的正常行为都是服务器截断响应，使其符合该限制，然后在响应头中设置TC标志。”当客户端接收到这样的响应时，它将TC标志作为应该通过TCP重试的指示。“。\n太棒了！因此，我们可以在响应中设置TC(截断)标志，这会导致目标Windows DNS服务器启动到我们的恶意NameServer的新TCP连接，并且我们可以传递大于4,096字节的消息。但是有多大呢？\n根据DNS RFC7766：“DNS客户端和服务器应该同时(例如，在单个”WRITE“系统调用中)将两个八位字节的长度字段和由该长度字段描述的消息传递到TCP层，以使所有数据更有可能在单个TCP段中传输。“。\n由于消息的前两个字节表示其长度，因此TCP上的DNS中消息的最大大小表示为16位，因此限制为64KB。\n但是，即使是长度为65,535的消息也不足以触发漏洞，因为消息长度包括报头和原始查询。计算传递给RR_AllocateEx的大小时不考虑此开销。\n让我们再看一看合法的DNS响应(为方便起见，我们选择了类型A的响应)。\n您可以看到，Wireshark将答案名称字段中的字节0xc00c计算为research.checkpoint.com。问题是，为什么？\n根据对DNS的热烈欢迎，powerdns.org说：“为了将尽可能多的信息压缩到512个字节中，DNS名称可以(而且通常必须)压缩为…。在本例中，应答的DNS名称编码为0xc0 0x0c。c0部分设置了两个最高有效位，表明后面的6+8位是指向消息中较早位置的指针。在这种情况下，这指向数据包中的位置12(=0x0c)，紧跟在DNS报头之后。“。\n距离数据包开头的偏移量0x0c(12)处是什么？这是research.checkpoint.com！\n在这种压缩形式中，指针指向编码字符串的起始处。在DNS中，字符串编码为(&lt；size&gt；&lt；value&gt；)链。\n因此，我们可以使用“魔术”字节0xc0来引用数据包中的字符串。让我们再次检查计算传递给RR_AllocateEx的大小的公式：\n反转Name_PacketNameToCountNameEx确认了我们上面描述的行为。Name_PacketNameToCountNameEx的目的是在考虑指针压缩的情况下计算Name字段的大小。拥有一个原语，它允许我们在仅用两个字节表示分配的情况下将分配的大小大幅增加，这正是我们所需要的。\n因此，我们可以在SIG签名者的姓名字段中使用指针压缩。然而，简单地指定0xc00c作为签名者的名字不会导致溢出，因为查询的域名已经存在于查询中，并且从分配的值中减去开销大小。但是0xc00d呢？我们必须满足的唯一约束是我们的编码字符串有效(以0x0000结尾)，而且我们可以很容易地做到这一点，因为我们有一个没有任何字符约束的字段-签名值。对于域414141.un，0xc00d指向域的第一个字符(‘4’)。然后将该字符的序数值用作未压缩字符串的大小(‘4’表示值0x34(52))。将这个未压缩字符串的大小与我们可以在签名字段中容纳的最大数据量(最多65,535，取决于原始查询)聚合在一起，得到的值大于65,535个字节，从而导致溢出！\n虽然看起来我们崩溃是因为我们试图将值写入未映射的内存，但是可以通过允许我们覆盖一些有意义的值的方式来调整堆的形状。\n以前对dns.exe的攻击尝试在线可用。例如：更深入地查看MS11-058。\n我们知道，LAN环境中的恶意攻击者可能会触发此漏洞。然而，我们认为看看这个错误是否可以在没有局域网接入的情况下远程触发会很有趣。\n到目前为止，您应该知道DNS可以通过TCP传输，并且Windows DNS服务器支持此连接类型。您还应该熟悉TCP上的DNS的结构，但以防万一，这里快速回顾一下：\n00000 50 4f 53 54 20 2f 70 77 6e 20 48 54 54 50 2f 31 POST/pwn HTTP/10010 2E 31 0d 0A 41 63 63 65 70 74 3a 20 2a 2f 2a 0d 1..接受：*/*.00200 0A 52 65 66 65 72 65 3a 20 68 74 74 70 3a 2f。\n即使这是HTTP有效负载，将其发送到端口53上的目标DNS服务器也会导致Windows DNS服务器将此有效负载解释为DNS查询。它使用以下结构完成此操作：\n0000 50 4f 53 54 20 2f 70 77 6e 20 48 54 54 50 2f 31 POST/pwn HTTP/10010 2E 31 0d 0A 41 63 63 65 70 74 3a 20 2a 2f 2a 0d 1..接受：*/*.0020 0A 52 65 66 65 72 65 3a 20 68 74 74 70 3a 2f。参考：http：//Message Length：20559(0x504f)事务ID：0x5354标志：0x202f问题：28791。\n幸运的是，Windows DNS服务器同时支持RFC 7766的“连接重用”和“流水线”，这意味着我们可以在单个TCP会话上发出多个查询，并且无需等待回复。\n当受害者访问我们控制的网站时，我们可以使用基本JavaScript从浏览器向DNS服务器发出POST请求。但如上所述，POST请求以我们无法真正控制的方式进行解释。\n但是，我们可能会滥用“连接重用”和“管道”功能，方法是向目标DNS服务器(https://target-dns:53/))发送HTTP post请求，其中包含要单独查询的POST数据中包含另一个“走私”DNS查询的二进制数据。\n“填充”，以便第一个DNS查询在POST数据内具有适当的长度(0x504f)。\n实际上，大多数流行的浏览器(如Google Chrome和Mozilla Firefox)都不允许对端口53的HTTP请求，因此此缺陷只能在有限的Web浏览器中利用，包括Internet Explorer和Microsoft Edge(不基于Chromium)。\n此错误存在的主要原因是RR_AllocateEx API需要16位的大小参数。通常可以安全地假设单个DNS消息的大小不超过64KB，因此此行为应该不会造成问题。但是，正如我们刚才所看到的，当在计算缓冲区大小时考虑Name_PacketNameToCountNameEx的结果时，这个假设是错误的。这是因为Name_PacketNameToCountNameEx函数计算的是未压缩名称的有效大小，而不是在数据包中表示它所用的字节数。\n要查找此错误的其他变体，我们需要找到满足以下条件的函数：\n调用Name_PacketNameToCountNameEx，其结果用于计算传递给RR_AllocateEx的大小。\n传递给RR_AllocateEx的值是使用16位或更大范围内的值计算的。\ndns.exe中唯一满足这三个条件的其他函数是NsecWireRead。让我们检查一下我们从反编译函数中推导出的以下简化代码片段：\nRESOURCE_RECORD*NsecWireRead(parsed_wire_record*pParsedWireRecord，DNS_Packet*pPacket，byte*pRecordData，word wRecordDataLength){DNS_RESOURCE_RECORD*pResourceRecord；UNSIGNED BYTE*pCurrentPos；UNSIGNED INT dwRemainingDataLength；UNSIGNED INT dwBytesRead；UNSIGNED INT dwAllocationSize；DNS_COUNT_NAME countName；pResourceRecRecord。=0xFFFFFFFF//&lt；--检查#2-相同的边界检查(？)&amp；&amp；wRecordDataLength&gt；=(Unsign Int)(pCurrentPos-pRecordData)//&lt；--检查#3-边界检查{dwRemainingDataLength=wRecordDataLength-(pCurrentPos-pRecordData)；dwBytesRead=countN。--检查#4-整数溢出检查(32位)&amp；&amp；dwAllocationSize&lt；=0xFFFF)//&lt；--检查#5-整数溢出检查(16位){pResourceRecord=RR_AllocateEx(dwAllocationSize，0，0)；IF(PResourceRecord){Name_CopyCountName(&amp；pResourceRecord-&gt；data，&amp；CountName)；memcpy(&amp；pResourceRecord-&G}\n如您所见，此函数包含许多安全检查。其中之一(检查5)是16位溢出检查，可防止此函数中漏洞的变体。我们还想提一下，此函数比dns.exe中的平均函数有更多的安全检查，这让我们怀疑是否已经注意到并修复了此错误，但仅在该特定函数中。\n如前所述，Microsoft在两个不同的模块中实现了DNS客户端和DNS服务器。虽然我们的漏洞肯定存在于DNS服务器中，但我们想看看它是否也存在于DNS客户端中。\n与dns.exe！SigWireRead不同，dnsapi.dll！Sig_RecordRead确实在Sig_RecordRead+D0处验证传递给dnsani.dll！DNS_AllocateRecordEx的值小于0xFFFF字节，从而防止溢出。\ndnsapi.dll中不存在此漏洞，并且两个模块之间的命名约定不同，这一事实使我们相信Microsoft为DNS服务器和DNS客户端管理两个完全不同的代码库，并且不同步它们之间的错误修补程序。\n根据微软的要求，我们决定保留有关攻击原语的信息，以便让用户有足够的时间修补他们的DNS服务器。相反，我们将讨论我们的开发计划，因为它适用于Windows Server 2012R2。但是，我们确实认为该计划也应该适用于其他版本的Windows Server。\ndns.exe二进制文件是使用Control Flow Guard(CFG)编译的，这意味着覆盖内存中的函数指针的传统方法不足以利用此缺陷。如果此二进制文件不是使用CFG编译的，利用此错误将非常简单，因为在相当早的时候我们遇到了以下崩溃：\n如您所见，我们在ntdll！LdrpValidateUserCallTarget崩溃。这是负责将函数指针目标作为CFG的一部分进行验证的函数。我们可以看到，要验证的指针(RCX)是完全可控的，这意味着我们成功地覆盖了某个函数指针。我们看到崩溃的原因是函数指针被用作全局位图表的索引，每个地址有“允许”/“不允许”位，而我们的任意地址导致从表本身的未映射页读取。\n要在击败CFG的同时利用此缺陷进行完全远程代码执行，我们需要找到具有以下功能的原语：Write-What-Where(精确覆盖堆栈上的返回地址)和Infoleak(泄漏内存地址，如堆栈)。\n为了实现Infoleak原语，我们使用溢出损坏了仍在缓存中的DNS资源记录的元数据。然后，当再次从缓存查询时，我们能够泄漏相邻的堆内存。\nWinDNS使用函数Mem_alloc动态分配内存。此函数管理其自己的内存池，以用作高效缓存。有4个内存池存储桶，用于不同的分配大小(最高可达0x50、0x68、0x88、0xA0)。如果请求的分配大小大于0xA0字节，则默认为使用本机Windows堆的Heapalloc。堆管理器为内存池头分配额外的0x10字节，其中包含元数据，包括缓冲区类型(已分配/空闲)、指向下一个可用内存块的指针、用于调试检查的cookie等。堆管理器以单链接列表的方式实现其分配列表，Me。\n.", "note_en": "DNS, which is often described as the “phonebook of the internet”, is a network protocol for translating human-friendly computer hostnames into IP addresses. Because it is such a core component of the internet, there are many solutions and implementations of DNS servers out there, but only a few are extensively used.\n “Windows DNS Server” is the Microsoft implementation and is an essential part of and a requirement for a Windows Domain environment.\n SIGRed (CVE-2020-1350) is a wormable, critical vulnerability (CVSS base score of 10.0) in the Windows DNS server that affects Windows Server versions 2003 to 2019, and can be triggered by a malicious DNS response. As the service is running in elevated privileges (SYSTEM), if exploited successfully, an attacker is granted Domain Administrator rights, effectively compromising the entire corporate infrastructure.\n   Our main goal was to find a vulnerability that would let an attacker compromise a Windows Domain environment, preferably unauthenticated. There is a lot of related research by various independent security researchers as well as those sponsored by nation-states. Most of the published and publicly available materials and exploits focus on Microsoft’s implementation of SMB ( EternalBlue) and RDP ( BlueKeep) protocols, as these targets affect both servers and endpoints. To obtain Domain Admin privileges, a straightforward approach is to directly exploit the Domain Controller. Therefore, we decided to focus our research on a less publicly explored attack surface that exists primarily on Windows Server and Domain Controllers. Enter WinDNS.\n  “ Domain Name System (DNS) is one of the industry-standard suite of protocols that comprise TCP/IP, and together the DNS Client and DNS Server provide computer name-to-IP address mapping name resolution services to computers and users.” –  Microsoft.\n DNS primarily uses the User Datagram Protocol (UDP) on port 53 to serve requests. DNS queries consist of a single UDP request from the client followed by a single UDP reply from the server.\n In addition to translating names to IP addresses, DNS serves other purposes as well. For example, mail transfer agents use DNS to find the best mail server to deliver e-mail: An MX record provides a mapping between a domain and a mail exchanger, which can provide an additional layer of fault tolerance and load distribution. A list of available DNS record types and their corresponding purposes can be found on  Wikipedia.\n But the point of this blog post is not to present a lengthy discourse on DNS features and history, so we encourage you to read more about DNS  here.\n  A single DNS message (response / query) is limited to 512 bytes in UDP and 65,535 bytes in TCP.\n DNS is hierarchal and decentralized in nature. This means when a DNS server doesn’t know the answer to a query it receives, the query is forwarded to a DNS server above it in the hierarchy. At the top of the hierarchy there are 13 root DNS servers worldwide.\n  DNS Server –  dns.exe is responsible for answering DNS queries on Windows Server, in which the DNS role is installed.\n    A bug in the way the DNS server parses a response (answer) for a forwarded query.\n As DNS queries do not have a complex structure, there is a lower chance of finding parsing issues in the first scenario, so we decided to target functions that parse incoming responses for forwarded queries.\n As mentioned previously, a forwarded query is the utilization of the DNS architecture to be able to forward queries it does not know the answer to – to the DNS server above it in the hierarchy.\n However, most environments configure their forwarders to well-known, respectable DNS servers such as  8.8.8.8 (Google) or  1.1.1.1 (Cloudflare), or at the very least a server that is not under the attacker’s control.\n This means that even if we find an issue in the parsing of DNS responses, we need to establish a Man-in-the-Middle to exploit it. Obviously, that’s not good enough.\n  NS stands for ‘name server’ and this record indicates which DNS server is the authority for that domain (which server contains the actual DNS records). The NS record is usually in charge of resolving the subdomains of a given domain. A domain often has multiple NS records which can indicate primary and backup name servers for that domain.\n To have the target Windows DNS Server parse responses from our malicious DNS NameServer, we do the following:\n Configure our domain’s ( deadbeef.fun) NS Records to point at our malicious DNS Server ( ns1.41414141.club).\n  The victim DNS, not yet knowing the answer for this query, forwards the query to the DNS server above it ( 8.8.8.8).\n The authoritative server ( 8.8.8.8) knows the answer, and responds that the NameServer of  deadbeef.fun is  ns1.41414141.club.\n  The next time we query for a subdomain of  deadbeef.fun, the target Windows DNS Server will also query  ns1.41414141.club for its response, as it is the NameServer for this domain.\n          One of the supported response types is for a SIG query. According to Wikipedia, a SIG query is the “ signature record used in SIG(0) (RFC 2931) and TKEY (RFC 2930). RFC 3755 designated RRSIG as the replacement for SIG for use within DNSSEC.”\n Let’s examine the disassembly generated by Cutter for  dns.exe!SigWireRead – the handler function for the SIG response type:\n   The first parameter that is passed to  RR_AllocateEx (the function responsible for allocating memory for the Resource Record) is calculated by the following formula:\n  The signature field size may vary as it is the primary payload of the SIG response.\n   As you can see in the image below,  RR_AllocateEx expects its parameters to be passed in  16bit registers as it only uses the  dx part of  rdx and  cx part of  rcx .\n This means that if we can make the above formula output a result bigger than 65,535 bytes (the maximum value for a 16 bit integer), we have an integer overflow that leads to a much smaller allocation than expected, which hopefully leads to a heap based buffer overwrite.\n   Conveniently enough, this allocated memory address is then passed as a destination buffer for  memcpy, leading to a Heap-Based buffer overflow.\n   To summarize, by sending a DNS response that contains a large (bigger than 64KB) SIG record, we can cause a controlled heap-based buffer overflow of roughly 64KB over a small allocated buffer.\n  Now that we’re able to get the victim DNS server to query our DNS server for various questions, we have effectively turned it into a client. We can make the victim DNS server ask our malicious DNS server specific types of queries, and respectively answer with matching malicious responses.\n We thought that all we needed to trigger this vulnerability was to make the victim DNS server query us for a SIG record, and answer it a SIG response with a lengthy signature (length &gt;= 64KB). We were disappointed to find that DNS over UDP has a size limit of 512 bytes (or 4,096 bytes if the server supports EDNS0). In any case, that is not enough to trigger the vulnerability.\n But what happens if there’s a legitimate reason for a server to send a response larger than 4,096 bytes? For example, a lengthy TXT response or a hostname that can be resolved to multiple IP addresses.\n  According to the DNS  RFC 5966:  “In the absence of EDNS0 (Extension Mechanisms for DNS 0), the normal behavior of any DNS server needing to send a UDP response that would exceed the 512-byte limit is for the server to truncate the response so that it fits within that limit and then set the TC flag in the response header.  When the client receives such a response, it takes the TC flag as an indication that it should retry over TCP instead. ”\n Great! So we can set the  TC (truncation) flag in our response, which causes the target Windows DNS Server to initiate a new TCP connection to our malicious NameServer, and we can pass a message larger than 4,096 bytes. But how much larger?\n According to DNS  RFC 7766:  “DNS clients and servers SHOULD pass the two-octet length field, and the message described by that length field, to the TCP layer at the same time (e.g., in a single “write” system call) to make it more likely that all the data will be transmitted in a single TCP segment. ”\n As the first two bytes of the message represent its length, the maximum size of a message in DNS over TCP is represented as 16 bits and is therefore limited to 64KB.\n   But even a message of length 65,535 is not large enough to trigger the vulnerability, as the message length includes the headers and the original query. This overhead is not taken into consideration when calculating the size that is passed to  RR_AllocateEx.\n  Let’s have another look at a legitimate DNS response (we chose a response of type A for convenience).\n   You can see that Wireshark evaluated the bytes  0xc00c in the answer’s name field to  research.checkpoint.com. The question is, why?\n According to  A warm welcome to DNS, powerdns.org:  “To squeeze as much information as possible into the 512 bytes, DNS names can (and often MUST) be compressed… In this case, the DNS name of the answer is encoded as 0xc0 0x0c. The c0 part has the two most significant bits set, indicating that the following 6+8 bits are a pointer to somewhere earlier in the message. In this case, this points to position 12 (= 0x0c) within the packet, which is immediately after the DNS header. ”\n What is at the offset 0x0c (12) from the beginning of the packet? It’s  research.checkpoint.com!\n In this form of compression, the pointer points at the start of an encoded string. In DNS, strings are encoded as a ( &lt;size&gt; &lt;value&gt;) chain.\n   So we can use the “magic” byte  0xc0 to reference strings from within the packet. Let’s once again examine the formula that calculates the size that is passed to  RR_AllocateEx:\n  Reversing  Name_PacketNameToCountNameEx confirms the behavior we described above. The purpose of  Name_PacketNameToCountNameEx is to calculate the size of a name field, taking pointer compression into consideration. Having a primitive that allows us to increase the size of the allocation by a large amount, when only representing it with two bytes, is exactly what we need.\n Therefore, we can use the pointer compression in the SIG Signer’s Name field. However, simply specifying  0xc00c as the Signer’s name would not cause the overflow, as the queried domain name is already present in the query, and the overhead size is subtracted from the allocated value. But what about  0xc00d? The only constraint we have to satisfy is that our encoded string is valid (ending with  0x0000), and we can do it easily because we have a field without any character constraints – the signature value. For the domain  41414141.fun,  0xc00d points at the first character of the domain (‘4’). The ordinal value of this character is then used as the size of the uncompressed string (‘4’ represents the value 0x34 (52)). Aggregation of the size of this uncompressed string, with the maximum amount of data we can fit in the Signature field (up to 65,535, depending on the original query), results in a value greater than 65,535 bytes, thus causing the overflow!\n    Although it seems that we crashed because we were trying to write values to unmapped memory, the heap can be shaped in a way that allows us to overwrite some meaningful values.\n Previous exploitation attempts for  dns.exe are available online. For example:  A deeper look at ms11-058.\n  We know this bug can be triggered by a malicious actor who is present in the LAN environment. However, we thought it would be interesting to see if this bug can be triggered remotely without LAN access.\n  By now you should be aware that DNS can be transported over TCP and that Windows DNS Server supports this connection type. You should also be familiar with the structure of DNS over TCP, but just in case, here’s a quick review:\n    0000 50 4f 53 54 20 2f 70 77 6e 20 48 54 54 50 2f 31 POST /pwn HTTP/10010 2e 31 0d 0a 41 63 63 65 70 74 3a 20 2a 2f 2a 0d .1..Accept: */*.0020 0a 52 65 66 65 72 65 72 3a 20 68 74 74 70 3a 2f .Referer: http:/\n Even though this is an HTTP payload, sending it to our target DNS server on port 53 causes the Windows DNS Server to interpret this payload as if it was a DNS query. It does this using the following structure:\n 0000  50 4f  53 54  20 2f  70 77  6e 20  48 54  54 50 2f 31 POST /pwn HTTP/10010 2e 31 0d 0a 41 63 63 65 70 74 3a 20 2a 2f 2a 0d .1..Accept: */*.0020 0a 52 65 66 65 72 65 72 3a 20 68 74 74 70 3a 2f .Referer: http:/ Message Length: 20559 (0x504f) Transaction ID: 0x5354 Flags: 0x202f Questions: 28791 (0x7077) Answer RRs: 28192 (0x6e20) Authority RRs: 18516 (0x4854) Additional RRs: 21584 (0x5450)Queries: [...]\n Fortunately, Windows DNS Server supports both “Connection Reuse” and “Pipelining” of  RFC 7766, which means we can issue multiple queries over a single TCP session and we can do so without waiting for replies.\n  We can use basic JavaScript to issue a POST request to the DNS Server from the browser when a victim visits a website we control. But as shown above, the POST request is interpreted in a manner we don’t really control.\n However, we can abuse the “Connection Reuse” and “Pipelining” features by sending an HTTP POST request to the target DNS server ( https://target-dns:53/) with binary data, containing another “smuggled” DNS query in the POST data, to be queried separately.\n  “Padding” so that the first DNS query has a proper length ( 0x504f) inside the POST data.\n    In practice, most popular browsers (such as Google Chrome and Mozilla Firefox) do not allow HTTP requests to port 53, so this bug can only be exploited in a limited set of web browsers – including Internet Explorer and Microsoft Edge (non-Chromium based).\n  The primary reason that this bug exists is because the  RR_AllocateEx API expects a size parameter of 16 bits. It is generally safe to assume that the size of a single DNS message does not exceed 64KB and thus this behavior should not present an issue. However, as we just saw, this assumption is wrong when the result of  Name_PacketNameToCountNameEx is taken into consideration while calculating the size of the buffer. This happens because the  Name_PacketNameToCountNameEx function calculates the effective size of the uncompressed name and not the number of bytes it took to represent it in the packet.\n To find other variants of this bug, we need to find a function that satisfies the following conditions:\n There is a call to  Name_PacketNameToCountNameEx and its result is used to calculate the size passed to  RR_AllocateEx.\n The value that is passed to  RR_AllocateEx is calculated using values in the range of 16bits or more.\n The only other function in  dns.exe that satisfied these three conditions is  NsecWireRead. Let’s examine the following simplified code snippet we deduced from decompiling the function:\n RESOURCE_RECORD* NsecWireRead(PARSED_WIRE_RECORD *pParsedWireRecord, DNS_PACKET *pPacket, BYTE *pRecordData, WORD wRecordDataLength){ DNS_RESOURCE_RECORD *pResourceRecord; unsigned BYTE *pCurrentPos; unsigned int dwRemainingDataLength; unsigned int dwBytesRead; unsigned int dwAllocationSize; DNS_COUNT_NAME countName; pResourceRecord = NULL; pCurrentPos = Name_PacketNameToCountNameEx(&amp;countName, pPacket, pRecordData, pRecordData + wRecordDataLength, 0); if (pCurrentPos) { if\t(pCurrentPos &gt;= pRecordData // &lt;-- Check #1 - Bounds check\t &amp;&amp; pCurrentPos - pRecordData &lt;= 0xFFFFFFFF // &lt;-- Check #2 - Same bounds check (?)\t &amp;&amp; wRecordDataLength &gt;= (unsigned int)(pCurrentPos - pRecordData)) // &lt;-- Check #3 - Bounds check\t{\t dwRemainingDataLength = wRecordDataLength - (pCurrentPos - pRecordData);\t dwBytesRead = countName.bNameLength + 2;\t // size := len(countName) + 2 + len(payload)\t dwAllocationSize = dwBytesRead + dwRemainingDataLength;\t if (dwBytesRead + dwRemainingDataLength &gt;= dwBytesRead // &lt;-- Check #4 - Integer Overflow check (32 bits)\t\t &amp;&amp; dwAllocationSize &lt;= 0xFFFF) // &lt;-- Check #5 - Integer Overflow check (16 bits)\t { pResourceRecord = RR_AllocateEx(dwAllocationSize, 0, 0); if (pResourceRecord) { Name_CopyCountName(&amp;pResourceRecord-&gt;data, &amp;countName); memcpy(&amp;pResourceRecord-&gt;data + pResourceRecord-&gt;data-&gt;bOffset + 2, pCurrentPos, dwRemainingDataLength); } } } } return pResourceRecord;}\n As you can see, this function contains many security checks. One of them (Check #5) is a 16 bit overflow check that prevents the variant of our vulnerability in this function. We would also like to mention that this function has many more security checks than the average function in  dns.exe, which makes us wonder if this bug was already noticed and fixed, but only in that specific function.\n As we mentioned previously, Microsoft implemented the DNS client and DNS server in two different modules. While our vulnerability definitely exists in the DNS server, we wanted to see if it exists in the DNS client as well.\n   It appears that, unlike  dns.exe!SigWireRead,  dnsapi.dll!Sig_RecordRead  does validate at  Sig_RecordRead+D0 that the value that is passed to  dnsapi.dll!Dns_AllocateRecordEx is less than 0xFFFF bytes, thus preventing the overflow.\n The fact that this vulnerability does not exist in  dnsapi.dll, as well as having different naming conventions between the two modules, leads us to believe that Microsoft manages two completely different code bases for the DNS server and the DNS client, and does not synchronize bug patches between them.\n  Per Microsoft’s request, we decided to withhold information about the exploitation primitives in order to give users enough time to patch their DNS servers. Instead, we discuss our exploitation plan as it applies to Windows Server 2012R2. However, we do believe that this plan should apply to other versions of Windows Server as well.\n The  dns.exe binary was compiled with  Control Flow Guard (CFG), which means the traditional approach of overwriting a function pointer in memory is not enough to exploit this bug. If this binary was not compiled with CFG, exploiting this bug would be pretty straight-forward, as quite early on we encountered the following crash:\n   As you can see, we crashed at  ntdll!LdrpValidateUserCallTarget. This is the function responsible for validating function pointer targets as part of CFG. We can see that the pointer to be validated ( rcx) is fully controllable, which means that we successfully overwrote a function pointer somewhere along the way. The reason we saw a crash is that the function pointer is used as an index to a global bitmap table with “allowed” / “disallowed” bit per address, and our arbitrary address led to a read from an unmapped page in the table itself.\n To exploit this bug to a full Remote Code Execution while defeating CFG, we need to find primitives that give us the following capabilities: write-what-where (to precisely overwrite a return address on the stack) and an infoleak (to leak memory addresses, such as the stack).\n  In order to achieve an Infoleak primitive, we corrupted the metadata of a DNS resource record, while it is still in the cache, using our overflow. Then, when queried again from the cache, we were able to leak adjacent heap memory.\n  WinDNS uses the function  Mem_Alloc to dynamically allocate memory. This function manages its own memory pools to be used as an efficient cache. There are 4 memory pool buckets for different allocation sizes (up to 0x50, 0x68, 0x88, 0xA0). If the requested allocation size is greater than 0xA0 bytes, it defaults to  HeapAlloc, which uses the native Windows heap. The heap manager allocates an additional 0x10 bytes for the memory pool header, which contains metadata including the buffer’s type (allocated / free), a pointer to the next available chunk of memory, a cookie for debug checks, and more. The heap manager implemented its allocation lists in a singly-linked-list fashion, me\n......", "posttime": "2020-07-15 06:18:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,漏洞,利用,bug,dns", "title": "SIGRed：利用Windows DNS服务器中存在17年的漏洞", "title_en": "SIGRed: Exploiting a 17 Year-Old Bug in Windows DNS Servers", "transed": 1, "url": "https://research.checkpoint.com/2020/resolving-your-way-into-domain-admin:-exploiting-a-17-year-old-bug-in-windows-dns-servers/", "via": "", "real_tags": ["windows", "漏洞", "利用", "bug", "dns"]}, {"category": "", "categoryclass": "", "imagename": "5d31ecc9a35354e79dc476d3e43e7f97.png", "infoid": 1011886, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正如微软之前所说，速度提升的主要原因是系统使用了NVMe固态硬盘内存，而不是过去游戏机转速低得多的硬盘驱动器。微软表示，这为系统提供了2.4 GB/s的原始I/O吞吐量，尽管我们之前已经注意到，这也可能会使将内存扩展到超过内置的1TB默认值的成本更高。\n为了进一步提高速度，微软表示，它正在行业标准LZ解压缩器的基础上进行扩展，增加了一种全新的、专为纹理数据设计的专有算法，名为BCPack。微软表示，这种硬件加速的纹理解压算法可以与标准LZ解压缩器并行运行，在不占用宝贵的CPU内核周期的情况下增加I/O总线的功能吞吐量。事实上，微软表示，如果没有硬件加速，类似的软件独占的解压缩方法将需要四个以上的Zen2CPU核心才能达到同样的结果。\n微软还详细介绍了之前发布的DirectStorage API。微软表示，DirectX流水线的新扩展为开发人员提供了对他们在X系列上的I/O操作的精细控制，使他们能够建立多个I/O队列，确定优先顺序，并将I/O延迟降至最低。对于开发人员需要特定数据在他们需要的时候从内存中显示的情况，这应该会有所帮助，而不是在过去通常同时加载的其他数据之前。\n不过，X系列I/O设计中最有趣的一点可能是微软称之为采样器反馈流的一种新的纹理优先排序方法。微软表示，这一新方法源于微软对GPU实际如何使用其从内存加载的高分辨率纹理的每一个mipmap(或细节级别)的分析。该公司表示，这种新方法源于微软对GPU实际如何使用其从内存加载的高分辨率纹理的每个mipmap(或细节级别)的分析。\n&#34；我们发现GPU访问的纹理数据通常不到需要加载到内存中的1/3，&#34；微软写道。凭借这种洞察力，我们能够为Xbox Series X GPU创建并添加新功能，使其能够按需仅将[特定纹理细节级别]的子部分加载到内存中，以备GPU需要数据时及时使用。&#34；\n与一次只能加载完整纹理mipmap的旧系统相比，微软表示，这种部分加载的结果平均是原始硬件能力之上和之外的有效I/O吞吐量和内存使用量的2.5倍。这意味着游戏中的纹理可以提供更多细节，而不会迫使系统等待额外的数据加载到GPU(或者一旦加载到GPU，就会弹出)。\n随着Xbox系列X计划在假日季发布的临近，现在的问题变成了开发者将如何很好地利用系统发布阵容中的这一新速度。当这些游戏中的大多数还在设计时考虑到Xbox One游戏机的I/O系统要慢得多(更不用说配备标准硬盘的PC了)，这个问题就变得更加紧迫。\n当我们看到微软为7月23日的游戏展示会准备的一些第一方游戏时，我们可能会得到更多关于这个分数的信息。", "note_en": "The bulk of the speed increase, as Microsoft has said before, comes from the system&#39;s use of NVMe SSD memory, rather than the much slower-spinning hard drives of past consoles. That gives the system &#34;2.4 GB/s of raw I/O throughput,&#34; Microsoft says, though we&#39;ve noted previously it will also  likely make expanding that memory past the built-in 1TB default more expensive.\n To extend that speed even further, Microsoft says it&#39;s expanding on the &#34;industry standard LZ decompressor&#34; with &#34;a brand new, proprietary algorithm specifically designed for texture data named BCPack.&#34; This hardware-accelerated texture-unpacking algorithm can be run in parallel with the standard LZ decompressor, Microsoft says, increasing the functional throughput of the I/O bus without using up precious CPU core cycles. In fact, without hardware acceleration, Microsoft says similar software-exclusive decompression methods &#34;would require more than four Zen 2 CPU cores&#34; to achieve the same results.\n Microsoft also went into a bit more detail on its previously announced DirectStorage API. That new expansion of the DirectX pipeline offers developers &#34;fine grain control of their I/O operations&#34; on the Series X, &#34;empowering them to establish multiple I/O queues, prioritization and minimizing I/O latency,&#34; Microsoft says. That should help with situations where developers need specific data to show up from memory right when they need it, ahead of other data that used to be loaded at the same time.\n  The most interesting bit of the Series X I/O design, though, might be a new texture-prioritization method Microsoft is calling Sampler Feedback Streaming. This new method grew out of a Microsoft analysis of how the GPU actually uses each &#34;mipmap (or detail level) of the high-resolution textures it loads from memory, the company says.\n &#34;We discovered that the GPU often accesses less than 1/3 of the texture data required to be loaded in memory,&#34; Microsoft writes. &#34;With this insight, we were able to create and add new capabilities to the Xbox Series X GPU which enables it to only load the sub portions of a [specific texture detail level] into memory, on demand, just in time for when the GPU requires the data.&#34;\n Compared to the old system that could only load a full texture mipmap at once, Microsoft says the result of this partial loading is &#34;approximately 2.5x the effective I/O throughput and memory usage above and beyond the raw hardware capabilities on average.&#34; That means in-game textures can offer that much more detail without forcing the system to wait for additional data to load to the GPU (or &#34;pop in&#34; once it does).\n As we approach the Xbox Series X&#39;s planned holiday season release, the question now becomes how well developers will be able to utilize this new speed in the system&#39;s launch lineup. That question becomes even more pressing when most of those games are  also being designed with the much slower I/O system of Xbox One consoles in mind (not to mention PCs with standard hard drives).\n We&#39;ll probably get a bit more information on that score when we see some of the first-party games Microsoft has in store for  its July 23 game showcase.", "posttime": "2020-07-15 05:59:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "微软,microsoft,内存,xbox,details", "title": "微软详细介绍Xbox Series X将如何从内存加载4.8 Gb/s", "title_en": "Microsoft details how Xbox Series X will load 4.8GB/s from memory", "transed": 1, "url": "https://arstechnica.com/gaming/2020/07/microsoft-details-how-xbox-series-x-will-load-4-8gb-s-from-memory/", "via": "", "real_tags": ["微软", "microsoft", "内存", "xbox", "details"]}, {"category": "", "categoryclass": "", "imagename": "8fbed6da8d4f5b9014292080122b9b74.jpg", "infoid": 1011885, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软正在紧急建议Windows服务器客户修补一个漏洞，该漏洞允许攻击者在没有用户交互的情况下控制整个网络，并从那里迅速从一台计算机传播到另一台计算机。\n这个漏洞，被发现它的研究人员称为SigRed，驻留在Windows DNS中，这是一个自动响应将域名转换为计算机在互联网上定位它所需的IP地址的请求的组件。通过发送恶意构建的查询，攻击者可以执行获得域管理员权限的代码，并从那里控制整个网络。该漏洞不适用于Windows客户端版本，2003至2019年的服务器版本中存在该漏洞。SigRed的正式跟踪编号为CVE-2020-1350。作为本月周二更新的一部分，微软发布了一个补丁。\n微软和发现该漏洞的安全公司Check Point的研究人员都表示，它是可蠕虫的，这意味着它可以像倒下的多米诺骨牌一样从一台计算机传播到另一台计算机。在不需要用户交互的情况下，计算机蠕虫仅通过连接就有可能迅速传播，而且根本不需要最终用户做任何事情。\n当蠕虫的潜在漏洞很容易允许恶意代码执行时，利用漏洞可能会特别有害，就像2016年的WannaCry和NotPetya攻击一样，这两起攻击关闭了全球网络，造成了数十亿美元的损失。\nCheck Point研究人员表示，利用SigRed所需的努力完全在熟练黑客的能力范围内。虽然目前没有证据表明该漏洞正在被积极利用，但Check Point表示，这种情况很可能会改变，如果改变了，破坏性影响将会很高。在一份技术分析报告中，公司研究员萨吉·扎迪克(Sagi Tzadik)在5月份发现了这个漏洞，并私下向微软报告了这一漏洞，他写道：\n我们认为此漏洞被利用的可能性很高，因为我们在内部找到了利用此漏洞所需的所有原语。由于时间限制，我们没有继续利用该缺陷(包括将所有利用原语链接在一起)，但我们相信决心坚定的攻击者将能够利用它。成功利用此漏洞将造成严重影响，因为您经常可以发现未打补丁的Windows域环境，尤其是域控制器。此外，一些互联网服务提供商(ISP)甚至可能已将其公共DNS服务器设置为WinDNS。\n在这里的简短总结中，微软分析师一致认为基于堆的底层缓冲区溢出很容易受到攻击。该公司还将剥削的可能性评为“更有可能”。许多外部研究人员对此表示赞同。\n保加利亚国家计算机病毒学实验室的安全专家Vesselin Vladimirov Bontchev在Twitter上写道：“如果我没有理解错的话，说它‘值得一读’实际上是轻描淡写。”“它适用于像Slammer一样的闪存蠕虫，这种蠕虫在大约10分钟内感染了互联网上所有易受攻击的电脑。”\n它适用于像Slammer一样的闪存蠕虫，这种蠕虫在大约10分钟内感染了互联网上所有易受攻击的计算机。\n邦切夫不同意安全研究员马库斯·哈钦斯(Marcus Hutchins)的观点，后者表示，他认为攻击者更有可能利用SigRed发动严重的勒索软件运动。在这种情况下，攻击者将控制网络的DNS服务器，然后使用它将恶意软件推送到所有连接的客户端计算机。Slamer是对SQL Slammer的引用，SQL Slammer是2003年的一种蠕虫，它利用了Microsoft SQL Server中的两个漏洞。在被激活的10分钟内，SQL Slammer感染了超过75,000台机器，其中一些属于微软。\n使用Windows DNS的组织应仔细评估风险，并尽快安装周二的修补程序。对于那些不能立即打补丁的人，微软在上面链接的评论中提供了人们可以采取的权宜之计。", "note_en": "Microsoft is urgently advising Windows server customers to patch a vulnerability that allows attackers to take control of entire networks with no user interaction and, from there, rapidly spread from computer to computer.\n The vulnerability, dubbed SigRed by the researchers who discovered it, resides in Windows DNS, a component that automatically responds to requests to translate a domain into the IP address computers need to locate it on the Internet. By sending maliciously formed queries, attackers can execute code that gains domain administrator rights and, from there, take control of an entire network. The vulnerability, which doesn’t apply to client versions of Windows, is present in server versions from 2003 to 2019. SigRed is formally tracked as  CVE-2020-1350. Microsoft issued a fix as part of this month&#39;s Update Tuesday.\n Both Microsoft and the researchers from Check Point, the security firm that discovered the vulnerability, said that it’s wormable, meaning it can spread from computer to computer in a way that’s akin to falling dominoes. With no user interaction required, computer worms have the potential to propagate rapidly just by virtue of being connected and without requiring end users to do anything at all.\n When a worm’s underlying vulnerability easily allows malicious code to be executed, exploits can be especially pernicious, as was the case with both the  WannaCry and  NotPetya attacks from 2016 that shut down networks worldwide and caused billions of dollars in damage.\n Check Point researchers said that the effort required to exploit SigRed was well within the means of skilled hackers. While there’s no evidence that the vulnerability is actively under exploit at the moment, Check Point said that’s likely to change, and if it does, the destructive effects would be high. In a  technical analysis, Sagi Tzadik, the company researcher who found the vulnerability in May and privately reported it to Microsoft, wrote:\n We believe that the likelihood of this vulnerability being exploited is high, as we internally found all of the primitives required to exploit this bug. Due to time constraints, we did not continue to pursue the exploitation of the bug (which includes chaining together all of the exploitation primitives), but we do believe that a determined attacker will be able to exploit it. Successful exploitation of this vulnerability would have a severe impact, as you can often find unpatched Windows Domain environments, especially Domain Controllers. In addition, some Internet Service Providers (ISPs) may even have set up their public DNS servers as WinDNS.\n In a brief writeup  here, Microsoft analysts agreed the underlying heap-based buffer overflow was wormable. The company also rated the chances of exploitation as  “more likely”. Many outside researchers concurred.\n “If I&#39;ve understood the article correctly, calling it ‘wormable’ is actually an understatement,” Vesselin Vladimirov Bontchev, a security expert who works for the National Laboratory of Computer Virology in Bulgaria,  wrote on Twitter. “It&#39;s suitable for flash worms a la Slammer, which infected the whole population of vulnerable computers on the Internet in something like 10 minutes flat.”\n It&#39;s suitable for flash worms a la Slammer, which infected the whole population of vulnerable computers on the Internet in something like 10 minutes flat.\n Bontchev was disagreeing with fellow security researcher Marcus Hutchins, who  said he thought it was more likely attackers would exploit SigRed in an attempt to wage crippling ransomware campaigns. In that scenario, attackers would take control of a network’s DNS server and then use it to push malware to all connected client computers. Slammer is a reference to SQL Slammer, a worm from 2003 that exploited two vulnerabilities in Microsoft’s SQL Server. Within 10 minutes of being activated, SQL Slammer  infected more than 75,000 machines, some of them belonging to Microsoft.\n Organizations that use Windows DNS should carefully assess the risks and install Tuesday’s patch as soon as possible. For those who can’t patch immediately, Microsoft offered stop-gap measures people can take in the write up linked above.", "posttime": "2020-07-15 05:58:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "微软,microsoft,漏洞,修补,urges", "title": "微软敦促修补影响严重、易恶化的服务器漏洞", "title_en": "Microsoft urges patching severe-impact, wormable server vulnerability", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/07/microsoft-urges-patching-severe-impact-wormable-server-vulnerability/", "via": "", "real_tags": ["微软", "microsoft", "漏洞", "修补", "urges"]}, {"category": "", "categoryclass": "", "imagename": "ad35d461d419b3ca257d82d9708c3e9c.png", "infoid": 1011883, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大家好！JPEGJPEG今天我们要了解👋压缩算法。很多人不知道的一件事是，JPEG不是一种格式，而是一种算法。您看到的JPEG图像大多是内部使用JPEG压缩算法的JFIF格式(JPEG文件交换格式)。在本文结束时，您将更好地理解JPEG算法如何压缩数据，以及如何编写一些自定义Python代码来解压缩数据。在编写解码器时，我们将不会介绍JPEG格式(如逐行扫描)的所有细微差别，而只是介绍基本的基线格式。\n既然互联网上已经有数百篇文章了，为什么还要再写一篇关于JPEG的文章呢？通常，当您阅读有关JPEG的文章时，作者只会给出格式的详细信息。您不需要实现任何代码来执行实际的解压缩和解码。即使您确实编写了代码，它也是用C/C++编写的，大多数人都无法访问。我计划通过向您展示一个基本的JPEG解码器如何使用Python3来改变这一点。我将基于这个麻省理工学院许可的代码来实现我的解码器，但为了提高可读性和易解性，我将对其进行大量修改。您可以在我的GitHub资源库中找到本文的修改代码。\n让我们从这张由Ange Albertini拍摄的漂亮照片开始吧。它列出了一个简单JPEG文件的所有不同部分。看看这个。我们将探索每一个部分。在阅读本教程时，您可能需要多次参考此图片。\n在最基本的级别上，几乎每个二进制文件都包含几个标记(或标头)。你可以把这些标记想像成书签。它们对于理解文件是非常关键的，并且被Find(在Mac/Linux上)这样的程序用来告诉我们关于文件的详细信息。这些标记定义文件中某些特定信息的存储位置。大多数标记后面跟着特定标记段的长度信息。这告诉我们那个特定的段有多长。\n我们关心的第一个标记是FF D8。它告诉我们这是图像的开始。如果我们看不到它，我们可以认为这是另一个文件。另一个同样重要的标志是FF D9。它告诉我们，我们已经到达图像文件的末尾。除了FFD0到FFD9和FF01之外，每个标记后面都紧跟一个长度说明符，该说明符将提供该标记线段的长度。对于图像文件开始标记和图像文件结束标记，每个标记的长度始终为两个字节。\nFrom struct import unPackmark_Mapping={0xffd8：&#34；开始图像&#34；，0xffe0：&#34；应用程序默认标题&#34；，0xffdb：&#34；量化表&#34；，0xffc0：&#34；帧开始&#34；，0xffc4：&#34；定义霍夫曼表&#34；，0xffda：&#34；，}class JPEG：def__init__(self，image_file)：with open(image_file，&#39；rb&#39；)as f：self.img_data=f.read()def decode(Self)：data=self.img_data While(True)：标记，=解包(&#34；&gt；H&#34；，data[0：2])print(mark_mapping.get(Mark))if mark==0xffd8：data=data[2：]elif marker==0xffd9：return Elif marker==0xffda：data=data[-2：]Else：lenchunk，=unpack(&#34；&gt；H&#34；，data[2：4])data=data[2+lenchunk：]if len(Data)=0：Break。)img.decode()#输出：#图像开始#应用程序默认标题#量化表格#量化表格#帧开始#霍夫曼表格#扫描开始#图像结束。\n我们使用struct来解压图像数据的字节。&gt；H告诉struct将数据视为大端和无符号短类型。JPEG格式的数据以BIG-Endian格式存储。只有EXIF数据可以采用小端(即使它不常见)。而短码的大小为2，因此我们提供从img_data解包两个字节。你可能会问自己，我们是怎么知道这是短路的。我们知道JPEG中的标记是4个十六进制数字：ffd8。一个十六进制数字等于4位(1个⁄，2个字节)，因此4个十六进制数字将等于2个字节，一个短数字将等于2个字节。\n扫描开始部分紧跟在图像扫描数据之后，且该图像扫描数据没有指定的长度。它会一直持续到找到“文件结束”标记为止，所以现在，每当我们看到SOC标记时，我们都会手动“寻找”到EOF标记。\n现在我们已经有了基本的框架，让我们继续并弄清楚其余的图像数据包含什么。我们将首先介绍一些必要的理论，然后开始编写代码。\n我将首先解释JPEG使用的一些基本概念和编码技术，然后解码自然会与JPEG相反。根据我的经验，直接尝试理解解码有点困难。\n尽管下面的图片现在对您没有多大意义，但在我们完成整个编码/解码过程时，它会给您一些可以把握的锚。它显示了JPEG编码过程中涉及的步骤：(SRC)。\n假设仅用一个分量编码的图像是灰度数据，其中0为黑色，255为白色。\n假设用三个分量编码的图像是编码为YCbCr的RGB数据，除非图像包含6.5.3中指定的APP14标记段，在这种情况下，根据APP14标记段的应用数据将颜色编码视为RGB或YCbCr。RGB和YCbCr之间的关系如Rec中规定的那样定义。国际电信联盟-T T.871|国际标准化组织/国际电工委员会10918-5。\n假设用四个分量编码的图像是CMYK，其中(0，0，0，0)表示白色，除非图像包含6.5.3中指定的APP14标记段，在这种情况下，根据APP14标记段的应用数据，颜色编码被认为是CMYK或YCCK。CMYK和YCCK之间的关系如第7条所规定。\n大多数JPEG算法实现使用亮度和色度(YUV编码)而不是RGB。这在JPEG中非常有用，因为人眼很难看到小区域内的高频亮度变化，所以我们可以从本质上减少频率，而人眼将无法区分。结果呢？高度压缩的图像，几乎没有明显的质量下降。\n就像RGB颜色空间中的每个像素由3个字节的颜色数据(红、绿、蓝)组成一样，YUV中的每个像素也使用3个字节，但每个字节表示的内容略有不同。Y分量确定颜色的亮度(也称为亮度或亮度)，而U和V分量确定颜色(也称为色度)。U分量是指蓝色的量，V分量是指红色的量。\n这种彩色格式是在彩色电视还不是很普遍的时候发明的，工程师们想要对彩色电视和黑白电视都使用一种图像编码格式。如果没有彩色电视，YUV可以安全地显示在黑白电视上。你可以在维基百科上阅读更多关于它的历史。\nJPEG将图像转换为8x8个像素块(称为MCU或最小编码单元)，更改像素值的范围以使其以0为中心，然后对每个块应用离散余弦变换，然后使用量化来压缩生成的块。让我们对所有这些术语的含义有一个更高层次的理解。\n离散余弦变换是一种将离散数据点转换为余弦波组合的方法。花时间将一幅图像转换成一串余弦似乎是无用的，但一旦我们理解了DCT并结合下一步的工作原理，它就有意义了。在JPEG中，DCT将获取一个8x8图像块，并告诉我们如何使用8x8余弦函数矩阵来再现它。单击此处阅读更多内容)。\n我们将DCT分别应用于像素的每个分量。应用DCT的输出是一个8x8系数矩阵，它告诉我们每个余弦函数(总共64个函数)对8x8输入矩阵有多少贡献。DCT的系数矩阵通常在系数矩阵的左上角包含较大的值，在右下角包含较小的值。左上角表示频率最低的余弦函数，右下角表示频率最高的余弦函数。\n这告诉我们，大多数图像包含大量的低频信息和少量的高频信息。如果我们将每个DCT矩阵的右下角分量设置为0，结果图像看起来仍然是一样的，因为正如我所提到的，人类不善于观察高频变化。这正是我们下一步要做的。\n我找到了一个关于这个话题的精彩视频。如果DCT没有太多意义，请注意。\n我们都听说过JPEG是一种有损压缩算法，但是到目前为止我们还没有做任何有损的事情。我们只将8x8的YUV分量块转换成8x8的余弦函数块，而不会丢失信息。有损部分出现在量化步骤中。\n量化是一个过程，在这个过程中，我们在一个特定的范围内取几个值，并将它们变成一个离散值。对于我们的例子，这只是一个将DCT输出矩阵中的较高频率系数转换为0的花哨名称。当您使用JPEG保存图像时，大多数图像编辑程序会询问您需要多少压缩。您在那里提供的百分比会影响应用多少量化以及丢失多少高频信息。这是应用有损压缩的地方。一旦丢失了高频信息，就不能从生成的JPEG图像中重新创建完全相同的原始图像。\n根据所需的压缩级别，可以使用一些常见的量化矩阵(有趣的事实是：大多数供应商都拥有构建量化表的专利)。我们将DCT系数矩阵与量化矩阵进行元素划分，将结果舍入为整数，得到量化矩阵。让我们来看一个例子。\n尽管人类看不到高频信息，但如果从8x8图像块中删除太多信息，整个图像看起来就会出现块状。在该量化矩阵中，第一个值称为直流值，其余值为交流值。如果我们从所有量化矩阵中提取DC值并生成一个新图像，我们基本上会得到原始图像的1/8分辨率的缩略图。\n同样重要的是要注意，因为我们在解码时应用量化，所以我们必须确保颜色落在[0,255]范围内。如果它们落在这个范围之外，我们将不得不手动将它们夹在这个范围内。\n这种编码是优选的，因为大多数低频(最重要的)信息在量化之后存储在矩阵的开始处，而Z字形编码存储在1D矩阵的开始处的所有信息。这对于下一步进行的压缩很有用。\n游程编码用于压缩重复数据。在Z字形编码的末尾，我们看到大多数Z字形编码的1D数组的末尾都有这么多0。游程编码允许我们回收所有浪费的空间，并且使用更少的字节来表示所有的0。假设您有如下数据：\n增量编码是一种用于表示一个字节相对于它之前的字节的技术。举个例子会更容易理解这一点。假设您有以下数据：\n在JPEG中，DCT系数矩阵中的每个DC值相对于其前面的DC值进行增量编码。这意味着，如果您更改图像的第一个DCT系数，整个图像将会出错，但如果您修改最后一个DCT矩阵的第一个值，则只会影响图像的一小部分。这很有用，因为图像中的第一个DC值通常是变化最大的，通过应用Delta编码，我们可以使其余的DC值接近0，从而在下一步的霍夫曼编码中获得更好的压缩效果。\n霍夫曼编码是一种对信息进行无损压缩的方法。赫夫曼曾经问过自己，“我可以用来存储任意一段文本的最小位数是多少？”这种编码格式就是他的答案。假设您必须存储以下文本：\n这是基于ASCII到二进制的映射。但是如果我们能想出一个定制的地图呢？\n这一切都很好，但是如果我们想要占用更少的空间呢？如果我们能够做这样的事情会怎么样：\n霍夫曼编码允许我们使用这种可变长度映射。它获取一些输入数据，将最频繁的字符映射到较小的位模式，将最不频繁的字符映射到较大的位模式，最后将映射组织成二叉树。在JPEG中，我们使用霍夫曼编码来存储DCT(离散余弦变换)信息。还记得我告诉过您，对DC值使用增量编码有助于霍夫曼编码吗？我希望你现在能明白为什么。在增量编码之后，我们要映射的“字符”更少，我们的哈夫曼树的总大小也减小了。\nTom Scott有一个很棒的视频，里面有关于哈夫曼编码一般工作原理的动画。在继续之前一定要看一看。\nJPEG包含最多4个霍夫曼表格，这些表格存储在“定义霍夫曼表格”部分(从0xffc4开始)。DCT系数存储在两个不同的霍夫曼表中。一个仅包含来自锯齿形表格的直流值，而另一个包含来自锯齿形表格的交流值。这意味着在解码时，我们必须合并来自两个独立矩阵的直流值和交流值。亮度和色度通道的DCT信息是分开存储的，因此我们有2组DC和2组AC信息，总共有4个霍夫曼表。\n在灰度图像中，我们只有2张霍夫曼工作台(1张用于直流，1张用于交流)，因为我们不关心颜色。正如您已经可以想象的那样，2个图像可以有非常不同的霍夫曼表，因此将这些表存储在每个JPEG中是很重要的。\n所以我们知道JPEG图像包含的基本细节。让我们从解码开始吧！\n使用DCT系数组合余弦波并为每个8x8块重新生成像素值\n我们将使用基线压缩，根据标准，基线将包含紧挨着的8x8块系列。其他压缩格式的数据布局略有不同。仅供参考，我已经在我们正在使用的图像的十六进制内容中给不同的部分着色。它看起来是这样的：\n我们已经知道JPEG包含4张霍夫曼表。这是编码过程的最后一步，因此应该是解码过程的第一步。每个分布式哈希表部分包含以下信息：\n位0..3：超线程数量(0..3，否则出错)位4：超线程类型，0=DC表，1=AC表位5..7：未使用，必须为0。\n代码长度为1..16的符号数，这些字节的总和(N)是代码的总数，必须为&lt；=256。\n按代码长度递增顺序包含符号的表(n=代码总数)。\n它将大致存储在JFIF文件中(它们将以二进制形式存储。我使用ASCII只是为了说明)：\n0 1 5 1 1 1 0 0 0 000 a b c d e f g h i j k l。\n0表示没有长度为1.1的霍夫曼码，1表示有1个长度为2的霍夫曼码，依此类推。DHT部分中始终有16字节的长度数据紧跟在类别和ID信息之后。让我们编写一些代码来提取DHT中的长度和元素。\nJPEG类：#.。def decdeHuffman(self，data)：Offset=0 Header，=Unpack(&#34；B&#34；，data[Offset：Offset+1])Offset+=1#提取包含长度的16个字节data Length=Unpack(&#34；BBBBBBBBBBBBBBBBB&#34；，Data[Offset：Offset+16])Offset+=16#提取长度为i的前16个字节元素=[]之后的元素：Elements+=(un.。，Header)打印(&#34；长度：&#34；，长度)打印(&#34；元素：&#34；，len(元素))data=data[Offset：]def decode(Self)：data=self.img_data While(True)：#-Else：LEN_CHUNCK，=UNPACK(&#34；&gt；H&#34；，data[2：4])len_chunk+=2 chunk=data[4：len_chunk]if mark==0xffc4：self.decdeHuffman(Chunk)data=data[len_chunk：]if len(Data)==0：Break。\n图像起始应用默认表头量化表量化表帧起始Huffman表头：0长度：(0，2，2，3，1，1，1，1，1，1，0，0，0，0，0，0，0，0，0，0)元素：10Huffman表头：16长度：(0，2，1，3，2，4，5，2，4，4，3，4，4，8，5，5，5，5，1。0)元素：8Huffman表头：17长度：(0，2，2，2，2，2，1，3，3，1，7，4，2，3，0，0)元素：34图像扫描结束开始。\n甜!。我们得到了长度和元素。现在，我们需要创建一个自定义的Huffman表类，以便可以根据这些元素和长度重新创建一棵二叉树。我厚颜无耻地从这里复制这段代码：\nclass HuffmanTable：def__init__(Self)：self.root=[]self.element=[]def BitsFromLengths(self，root，element，pos)：if isinstance(root，list)：if pos==0：if len(Root)&lt；2：root.append(Element)[0，1]中的i返回True返回False：if len(Root)==i：root.append([])if self.BitsFromLengths(root[i]，element，pos-1)==True：返回True返回False def GetHuffmanBits(self，Length，Elements)：self.element=range中i的元素II=0(len(Length))：for j in range(len(Length))：for j in range。list)：r=r[st.GetBit()]return r def GetCode(self，st)：While(True)：res=self.Find(St)if res==0：return 0 elf(res！=-1)：return res class JPEG：#-def decdeHuffman(self，data)：#-hf=HuffmanTable()hf.GetHuffmanBits(Length，Elements)data=data。\nGetHuffmanBits接受长度和元素，迭代所有元素并将它们放入根列表中。此列表包含嵌套列表，并表示二叉树。您可以在线阅读霍夫曼树是如何工作的，以及如何用Python创建您自己的霍夫曼树数据结构。对于我们的第一个分布式哈希表(使用我在本教程开始时链接的图像)，我们有以下数据、长度和元素：\n十六进制数据：00 02 02 03 01 01 00 00 00长度：(0，2，2，3，1，1，1，0，0，0，0，0，0，0，0，0)元素：[5，6，3，4，2，7，8，1，0，9]。\nHuffmanTable还包含GetCode方法，该方法为我们遍历树，并使用Huffman表返回解码的比特。此方法需要比特流作为输入。比特流就是数据的二进制表示形式。例如，ABC的典型位流将是011000010110001001100011。我们首先将每个字符转换为其ASCII码，然后将该ASCII码转换为二进制。让我们创建一个自定义类，它将允许我们将字符串转换为位并逐个读取位。以下是我们将如何实施它：\n类流：def__init__(self，data)：self.data=data self.pos=0 def GetBit(Self)：B=self.data[self.pos&gt；&gt；3]s=7-(self.pos&amp；0x7)self.pos+=1 return(b&gt；&gt；s)&amp；1 def GetBitN(self，l)：val\n我们在初始化该类时提供一些二进制数据，然后使用GetBit和GetBitN方法读取它。\n位0..3：Qt(0..3，否则出错)位4..7：Qt精度，0=8位，否则为16位。\n根据JPEG标准，在JPEG图像中有2个默认量化表。一个用于亮度，一个用于色度。这些表从0xffdb标记开始。在。\n.", "note_en": "Source         Hi everyone! 👋 Today we are going to understand the JPEG compression algorithm. One thing a lot of people don’t know is that JPEG is not a format but rather an algorithm. The JPEG images you see are mostly in the JFIF format (JPEG File Interchange Format) that internally uses the JPEG compression algorithm. By the end of this article, you will have a much better understanding of how the JPEG algorithm compresses data and how you can write some custom Python code to decompress it. We will not be covering all the nuances of the JPEG format (like progressive scan) but rather only the basic baseline format while writing our decoder.\n  Why write another article on JPEG when there are already hundreds of articles on the internet? Well, normally when you read articles on JPEG, the author just gives you details about what the format looks like. You don’t implement any code to do the actual decompression and decoding. Even if you do write code, it is in C/C++ and not accessible to a wide group of people. I plan on changing that by showing you how a basic JPEG decoder works using Python 3. I will be basing my decoder on  this MIT licensed code but will be heavily modifying it for increased readability and ease of understanding. You can find the modified code for this article on my  GitHub repo.\n  Let’s start with this nice image by  Ange Albertini. It lists all different parts of a simple JPEG file. Take a look at it. We will be exploring each segment. You might have to refer to this image quite a few times while reading this tutorial.\n  At the very basic level, almost every binary file contains a couple of markers (or headers). You can think of these markers as sort of like bookmarks. They are very crucial for making sense of a file and are used by programs like  find (on Mac/Linux) to tell us details about a file. These markers define where some specific information in a file is stored. Most of the markers are followed by  length information for the particular marker segment. This tells us how long that particular segment is.\n  The very first marker we care about is  FF D8. It tells us that this is the start of the image. If we don’t see it we can assume this is some other file. Another equally important marker is  FF D9. It tells us that we have reached the end of an image file. Every marker, except for  FFD0 to  FFD9 and  FF01, is immediately followed by a length specifier that will give you the length of that marker segment. As for the image file start and image file end markers, they will always be two bytes long each.\n    from struct import unpackmarker_mapping = { 0xffd8: &#34;Start of Image&#34;, 0xffe0: &#34;Application Default Header&#34;, 0xffdb: &#34;Quantization Table&#34;, 0xffc0: &#34;Start of Frame&#34;, 0xffc4: &#34;Define Huffman Table&#34;, 0xffda: &#34;Start of Scan&#34;, 0xffd9: &#34;End of Image&#34;}class JPEG: def __init__(self, image_file): with open(image_file, &#39;rb&#39;) as f: self.img_data = f.read() def decode(self): data = self.img_data while(True): marker, = unpack(&#34;&gt;H&#34;, data[0:2]) print(marker_mapping.get(marker)) if marker == 0xffd8: data = data[2:] elif marker == 0xffd9: return elif marker == 0xffda: data = data[-2:] else: lenchunk, = unpack(&#34;&gt;H&#34;, data[2:4]) data = data[2+lenchunk:] if len(data)==0: break if __name__ == &#34;__main__&#34;: img = JPEG(&#39;profile.jpg&#39;) img.decode() # OUTPUT:# Start of Image# Application Default Header# Quantization Table# Quantization Table# Start of Frame# Huffman Table# Huffman Table# Huffman Table# Huffman Table# Start of Scan# End of Image\n We are using  struct to unpack the bytes of image data.  &gt;H tells  struct to treat the data as big-endian and of type  unsigned short. The data in JPEG is stored in big-endian format. Only the EXIF data  can be in little-endian (even though it is uncommon). And a short is of size 2 so we provide  unpack two bytes from our  img_data. You might ask yourself how we knew it was a  short. Well, we know that the markers in JPEG are 4 hex digits:  ffd8. One hex digit equals 4 bits ( 1⁄ 2 byte) so 4 hex digits will equal 2 bytes and a short is equal to 2 bytes.\n The Start of Scan section is immediately followed by image scan data and that image scan data doesn’t have a length specified. It continues till the “end of file” marker is found so for now we are manually “seeking” to the EOF marker whenever we see the SOC marker.\n Now that we have the basic framework in place, let’s move on and figure out what the rest of the image data contains. We will go through some necessary theory first and then get down to coding.\n  I will first explain some basic concepts and encoding techniques used by JPEG and then decoding will naturally follow from that as a reverse of it. In my experience, directly trying to make sense of decoding is a bit hard.\n Even though the image below won’t mean much to you right now, it will give you some anchors to hold on to while we go through the whole encoding/decoding process. It shows the steps involved in the JPEG encoding process: ( src)\n    Images encoded with only one component are assumed to be grayscale data in which 0 is black and 255 is white.\n Images encoded with three components are assumed to be RGB data encoded as YCbCr unless the image contains an APP14 marker segment as specified in 6.5.3, in which case the color encoding is considered either RGB or YCbCr according to the application data of the APP14 marker segment. The relationship between RGB and YCbCr is defined as specified in Rec. ITU-T T.871 | ISO/IEC 10918-5.\n Images encoded with four components are assumed to be  CMYK, with (0,0,0,0) indicating white unless the image contains an APP14 marker segment as specified in 6.5.3, in which case the color encoding is considered either  CMYK or  YCCK according to the application data of the APP14 marker segment. The relationship between  CMYK and  YCCK is defined as specified in clause 7.\n Most JPEG algorithm implementations use luminance and chrominance (YUV encoding) instead of RGB. This is super useful in JPEG as the human eye is pretty bad at seeing high-frequency brightness changes over a small area so we can essentially reduce the amount of frequency and the human eye won’t be able to tell the difference. Result? A highly compressed image with almost no visible reduction in quality.\n Just like each pixel in RGB color space is made up of 3 bytes of color data (Red, Green, Blue), each pixel in YUV uses 3 bytes as well but what each byte represents is slightly different. The Y component determines the brightness of the color (also referred to as luminance or luma), while the U and V components determine the color (also known as chroma). The U component refers to the amount of blue color and the V component refers to the amount of red color.\n This color format was invented when color televisions weren’t super common and engineers wanted to use one image encoding format for both color and black and white televisions. YUV could be safely displayed on a black and white TV if color wasn’t available. You can read more about its history on  Wikipedia.\n  JPEG converts an image into chunks of 8x8 blocks of pixels (called MCUs or Minimum Coding Units), changes the range of values of the pixels so that they center on 0 and then applies Discrete Cosine Transformation to each block and then uses quantization to compress the resulting block. Let’s get a high-level understanding of what all of these terms mean.\n A Discrete Cosine Transform is a method for converting discrete data points into a combination of cosine waves. It seems pretty useless to spend time converting an image into a bunch of cosines but it makes sense once we understand DCT in combination with how the next step works. In JPEG, DCT will take an 8x8 image block and tell us how to reproduce it using an 8x8 matrix of cosine functions.  Read more here)\n   We apply DCT to each component of a pixel separately. The output of applying DCT is an 8x8 coefficient matrix that tells us how much each cosine function (out of 64 total functions) contributes to the 8x8 input matrix. The coefficient matrix of a DCT generally contains bigger values in the top left corner of the coefficient matrix and smaller values in the bottom right corner. The top left corner represents the lowest frequency cosine function and the bottom right represents the highest frequency cosine function.\n What this tells us is that most images contain a huge amount of low-frequency information and a small amount of high-frequency information. If we turn the bottom right components of each DCT matrix to 0, the resulting image would still appear the same because, as I mentioned, humans are bad at observing high-frequency changes. This is exactly what we do in the next step.\n I found a wonderful video on this topic. Watch it if DCT doesn’t make too much sense.\n We have all heard that JPEG is a lossy compression algorithm but so far we haven’t done anything lossy. We have only transformed 8x8 blocks of YUV components into 8x8 blocks of cosine functions with no loss of information. The lossy part comes in the quantization step.\n Quantization is a process in which we take a couple of values in a specific range and turns them into a discrete value. For our case, this is just a fancy name for converting the higher frequency coefficients in the DCT output matrix to 0. When you save an image using JPEG, most image editing programs ask you how much compression you need. The percentage you supply there affects how much quantization is applied and how much of higher frequency information is lost. This is where the lossy compression is applied. Once you lose high-frequency information, you can’t recreate the exact original image from the resulting JPEG image.\n Depending on the compression level required, some common quantization matrices are used (fun fact: Most vendors have patents on quantization table construction). We divide the DCT coefficient matrix element-wise with the quantization matrix, round the result to an integer, and get the quantized matrix. Let’s go through an example.\n       Even though humans can’t see high-frequency information, if you remove too much information from the 8x8 image chunks, the overall image will look blocky. In this quantized matrix, the very first value is called a DC value and the rest of the values are AC values. If we were to take the DC values from all the quantized matrices and generated a new image, we will essentially end up with a thumbnail with 1/8th resolution of the original image.\n It is also important to note that because we apply quantization while decoding, we will have to make sure the colors fall in the [0,255] range. If they fall outside this range, we will have to manually clamp them to this range.\n        This encoding is preferred because most of the low frequency (most significant) information is stored at the beginning of the matrix after quantization and the zig-zag encoding stores all of that at the beginning of the 1D matrix. This is useful for the compression that happens in the next step.\n  Run-length encoding is used to compress repeated data. At the end of the zig-zag encoding, we saw how most of the zig-zag encoded 1D arrays had so many 0s at the end. Run-length encoding allows us to reclaim all that wasted space and use fewer bytes to represent all of those 0s. Imagine you have some data like this:\n     Delta encoding is a technique used to represent a byte relative to the byte before it. It is easier to understand this with an example. Let’s say you have the following data:\n    In JPEG, every DC value in a DCT coefficient matrix is delta encoded relative to the DC value preceding it. This means that if you change the very first DCT coefficient of your image, the whole image will get screwed up but if you modify the first value of the last DCT matrix, only a very tiny part of your image will be affected. This is useful because the first DC value in your image is usually the most varied and by applying the Delta encoding we bring the rest of DC values close to 0 and that results in better compression in the next step of Huffman Encoding.\n  Huffman encoding is a method for lossless compression of information. Huffman once asked himself, “What’s the smallest number of bits I can use to store an arbitrary piece of text?”. This coding format was his answer. Imagine you have to store this text:\n    This is based on ASCII to binary mapping. But what if we could come up with a custom mapping?\n    This is all well and good but what if we want to take even less space? What if we were able to do something like this:\n  Huffman encoding allows us to use this sort of variable-length mapping. It takes some input data, maps the most frequent characters to the smaller bit patterns and least frequent characters to larger bit patterns, and finally organizes the mapping into a binary tree. In a JPEG we store the DCT (Discrete Cosine Transform) information using Huffman encoding. Remember I told you that using delta encoding for DC values helps in Huffman Encoding? I hope you can see why now. After delta encoding, we end up with fewer “characters” to map and the total size of our Huffman tree is reduced.\n Tom Scott has a wonderful video with animations on how Huffman encoding works in general. Do watch it before moving on.\n A JPEG contains up to 4 Huffman tables and these are stored in the “Define Huffman Table” section (starting with  0xffc4). The DCT coefficients are stored in 2 different Huffman tables. One contains only the DC values from the zig-zag tables and the other contains the AC values from the zig-zag tables. This means that in our decoding, we will have to merge the DC and AC values from two separate matrices. The DCT information for the luminance and chrominance channel is stored separately so we have 2 sets of DC and 2 sets of AC information giving us a total of 4 Huffman tables.\n In a greyscale image, we would have only 2 Huffman tables (1 for DC and 1 for AC) because we don’t care about the color. As you can already imagine, 2 images can have very different Huffman tables so it is important to store these tables inside each JPEG.\n So we know the basic details of what a JPEG image contains. Let’s start with the decoding!\n   Use DCT coefficients to combine cosine waves and regenerate pixel values for each 8x8 block\n   We are going to be working with the Baseline compression and according to the standard, baseline will contain the series of 8x8 blocks right next to each other. The other compression formats layout the data a bit differently. Just for reference, I have colored different segments in the hex content of the image we are using. This is how it looks:\n   We already know that a JPEG contains 4 Huffman tables. This is the last step in the encoding procedure so it should be the first step in the decoding procedure. Each DHT section contains the following information:\n bit 0..3: number of HT (0..3, otherwise error)  bit 4: type of HT, 0 = DC table, 1 = AC table  bit 5..7: not used, must be 0\n Number of symbols with codes of length 1..16, the sum(n) of these bytes is the total number of codes, which must be &lt;= 256\n Table containing the symbols in order of increasing code length ( n = total number of codes ).\n   It will be stored in the JFIF file roughly like this (they will be stored in binary. I am using ASCII just for illustration purposes):\n 0 1 5 1 1 1 1 1 1 0 0 0 0 0 0 0 a b c d e f g h i j k l\n The 0 means that there is no Huffman code of length 1. 1 means that there is 1 Huffman code of length 2. And so on. There are always 16 bytes of length data in the DHT section right after the class and ID information. Let’s write some code to extract the lengths and elements in DHT.\n class JPEG: # ... def decodeHuffman(self, data): offset = 0 header, = unpack(&#34;B&#34;,data[offset:offset+1]) offset += 1 # Extract the 16 bytes containing length data lengths = unpack(&#34;BBBBBBBBBBBBBBBB&#34;, data[offset:offset+16]) offset += 16 # Extract the elements after the initial 16 bytes elements = [] for i in lengths: elements += (unpack(&#34;B&#34;*i, data[offset:offset+i])) offset += i print(&#34;Header: &#34;,header) print(&#34;lengths: &#34;, lengths) print(&#34;Elements: &#34;, len(elements)) data = data[offset:] def decode(self): data = self.img_data while(True): # --- else: len_chunk, = unpack(&#34;&gt;H&#34;, data[2:4]) len_chunk += 2 chunk = data[4:len_chunk] if marker == 0xffc4: self.decodeHuffman(chunk) data = data[len_chunk:] if len(data)==0: break\n  Start of ImageApplication Default HeaderQuantization TableQuantization TableStart of FrameHuffman TableHeader: 0lengths: (0, 2, 2, 3, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0)Elements: 10Huffman TableHeader: 16lengths: (0, 2, 1, 3, 2, 4, 5, 2, 4, 4, 3, 4, 8, 5, 5, 1)Elements: 53Huffman TableHeader: 1lengths: (0, 2, 3, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)Elements: 8Huffman TableHeader: 17lengths: (0, 2, 2, 2, 2, 2, 1, 3, 3, 1, 7, 4, 2, 3, 0, 0)Elements: 34Start of ScanEnd of Image\n Sweet! We got the lengths and the elements. Now we need to create a custom Huffman table class so that we can recreate a binary tree from these elements and lengths. I am shamelessly copying this code from  here:\n class HuffmanTable: def __init__(self): self.root=[] self.elements = [] def BitsFromLengths(self, root, element, pos): if isinstance(root,list): if pos==0: if len(root)&lt;2: root.append(element) return True return False for i in [0,1]: if len(root) == i: root.append([]) if self.BitsFromLengths(root[i], element, pos-1) == True: return True return False def GetHuffmanBits(self, lengths, elements): self.elements = elements ii = 0 for i in range(len(lengths)): for j in range(lengths[i]): self.BitsFromLengths(self.root, elements[ii], i) ii+=1 def Find(self,st): r = self.root while isinstance(r, list): r=r[st.GetBit()] return r def GetCode(self, st): while(True): res = self.Find(st) if res == 0: return 0 elif ( res != -1): return res class JPEG: # ----- def decodeHuffman(self, data): # ---- hf = HuffmanTable() hf.GetHuffmanBits(lengths, elements) data = data[offset:]\n The  GetHuffmanBits takes in the lengths and elements, iterates over all the elements and puts them in a  root list. This list contains nested lists and represents a binary tree. You can read online how a Huffman Tree works and how to create your own Huffman tree data structure in Python. For our first DHT (using the image I linked at the start of this tutorial) we have the following data, lengths, and elements:\n Hex Data: 00 02 02 03 01 01 01 00 00 00 00 00 00 00 00 00Lengths: (0, 2, 2, 3, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0)Elements: [5, 6, 3, 4, 2, 7, 8, 1, 0, 9]\n   The  HuffmanTable also contains the  GetCode method that traverses the tree for us and gives us back the decoded bits using the Huffman table. This method expects a bitstream as an input. A bitstream is just the binary representation of data. For example, a typical bitstream of  abc will be  011000010110001001100011. We first convert each character into its ASCII code and then convert that ASCII code to binary. Let’s create a custom class that will allow us to convert a string into bits and read the bits one by one. This is how we will implement it:\n class Stream: def __init__(self, data): self.data= data self.pos = 0 def GetBit(self): b = self.data[self.pos &gt;&gt; 3] s = 7-(self.pos &amp; 0x7) self.pos+=1 return (b &gt;&gt; s) &amp; 1 def GetBitN(self, l): val = 0 for i in range(l): val = val*2 + self.GetBit() return val\n We feed this class some binary data while initializing it and then use the  GetBit and  GetBitN methods to read it.\n   bit 0..3: number of QT (0..3, otherwise error) bit 4..7: the precision of QT, 0 = 8 bit, otherwise 16 bit\n According to the JPEG standard, there are 2 default quantization tables in a JPEG image. One for luminance and one for chrominance. These tables start at the  0xffdb marker. In the\n......", "posttime": "2020-07-15 05:57:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,并用,writing,图像", "title": "理解并用Python编写JPEG解码器", "title_en": "Understanding and writing a JPEG decoder in Python", "transed": 1, "url": "https://yasoob.me/posts/understanding-and-writing-jpeg-decoder-in-python/", "via": "", "real_tags": ["python", "并用", "writing", "图像"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1011882, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "备注[BzQkNA6XRa5qilkQuiAqKQ==]：所列功率为最大组合传导输出功率。该设备支持20、40和80 MHz带宽模式。除非符合FCC多发射机产品程序或本申请所述，否则产品的安装必须确保其天线与所有人员的间隔距离至少为23厘米，并且不得与任何其他发射机同时传输。必须为最终用户和安装者提供天线安装和发射机操作条件，以满足射频暴露合规性。此设备的操作仅限于室内使用。注释[tiQ8pAYT94LcLqmvDwsh8A==]：列出的功率为最大组合传导输出功率。该设备支持20和40 MHz带宽模式。除非符合FCC多发射机产品程序或本申请所述，否则产品的安装必须确保其天线与所有人员的间隔距离至少为23厘米，并且不得与任何其他发射机同时传输。必须为最终用户和安装者提供天线安装和发射机操作条件，以满足射频暴露合规性。", "note_en": "Comment [BzQkNA6XRa5qilkQuiAqKQ==]: Power listed is maximum combined conducted output power. This device supports 20, 40 and 80 MHz bandwidth modes. The product must be installed such that its antenna(s) can provide a separation distance of at least 23 cm from all persons and must not transmit simultaneously with any other transmitter, except in accordance with FCC multi-transmitter product procedures or as described in this filing. End-users and installers must be provided with antenna installation and transmitter operating conditions for satisfying RF exposure compliance. Operation of this device is restricted to indoor use only. Comment [tiQ8pAYT94LcLqmvDwsh8A==]: Power listed is maximum combined conducted output power. This device supports 20 and 40 MHz bandwidth modes. The product must be installed such that its antenna(s) can provide a separation distance of at least 23 cm from all persons and must not transmit simultaneously with any other transmitter, except in accordance with FCC multi-transmitter product procedures or as described in this filing. End-users and installers must be provided with antenna installation and transmitter operating conditions for satisfying RF exposure compliance.", "posttime": "2020-07-15 05:56:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "wifi,发射机", "title": "StarLink WiFi路由器FCC获批", "title_en": "Starlink WiFi Router FCC Approved", "transed": 1, "url": "https://fcc.report/FCC-ID/2AWHPR201", "via": "", "real_tags": ["wifi", "发射机"]}, {"category": "", "categoryclass": "", "imagename": "952aafa67bc8ae12be91e582c233a11b.jpg", "infoid": 1011879, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据意大利北部的研究人员和临床医生的说法，新冠肺炎的长期影响，即使是对遭受轻微感染的人，也可能比最初预期的要糟糕得多。\n在该国受影响最严重的伦巴第区，前冠状病毒患者中发现了精神病、失眠、肾脏疾病、脊椎感染、中风、慢性疲劳和行动不便问题。\n医生警告说，一些受害者可能永远不会从疾病中恢复，所有年龄段的人都很脆弱。\n他们说，这种病毒是一种全身性感染，影响到身体的所有器官，而不是像之前认为的那样，只是一种呼吸系统疾病。\n有些人可能会发现，他们正常工作的能力、集中注意力的能力，甚至参加体育活动的能力都会受到严重的损害。\n医生们警告说，那些不认为自己属于弱势群体，也不担心感染这种疾病的人，如果忽视安全规则，可能会将自己置于改变人生的疾病的危险之中。\n他们强调，社交距离、洗手和口罩的需要现在和过去一样重要。\n警告发出之际，意大利北部越来越担心第二波病毒可能即将到来。该地区两家主要医院的医生报告了少数患有呼吸问题的重病患者的新病例。\n贝加莫Papa Giovanni XXIII医院急救负责人罗伯托·科森蒂尼(Roberto Cosentini)博士监督了对席卷这个高山省份的病毒的反应，病毒夺走了至少6000人的生命。\n今年3月，当病毒的第一个令人震惊的影响在世界各地广播时，他让天空新闻前所未有地进入了医院的急诊室，改变了人们对问题严重程度的看法。\n现在，他正带头再次向全球发出警告，新冠肺炎是一个影响全身的致命杀手，不会消失。\n一开始我们以为是重流感，后来以为是重流感，肺炎很严重，就是你来的时候，后来我们发现是全身血管受损，肾受累，脑部受累，他在几个月前人满为患的现在安静的新冠肺炎急诊室里告诉我。\n所以我们看到了其他需要透析的急性肾功能衰竭的表现；或者中风，然后是急性心肌梗死，所以有很多并发症或病毒的其他表现。\n现在，我们还看到相当大比例的人患有这种病毒的慢性损害。\n这场大流行给这里的医疗服务造成了严重破坏，其中为数不多的积极因素之一是创造了一个独特的环境，在这个环境中，不同领域的医生和专家发现自己在一起工作了几个月，有效地学习了新技能。这种合作有助于了解该病毒。\nEmanuela Catenacci医生是Cremona医院的神经外科医生，当我们在3月份第一次见到她时，她已经被选中在疫情最严重的时候在重症监护病房工作。\n她又回到了神经科，但至关重要的是，过去她会完全独立于其他部门治疗病人，现在她可以看到其中的联系。这个环节就是新冠肺炎，它是一种多器官杀手。\n她告诉我，在我们医院，我们现在有一个免疫学家的诊所，他们正在检查这些患者，特别是那些最严重、患有最严重疾病的患者，他们不仅检查肺部，还检查COVID病理的所有系统表现。\n她说，这种病毒是一种全身性感染，我们的一些器官有最大的表现，比如我们所知的肺部，但也有大脑、皮肤，有时还会有血管炎，所以它不仅仅是高呼吸道或下呼吸道感染，它还没有结束，她说。\n意大利医生在他们病人身上的发现反映了伦敦大学学院最近进行的一项研究。\n研究人员在43名年龄在16岁至85岁之间的人中发现了新冠肺炎引起的严重神经并发症，包括神志不清、脑部炎症、中风和神经损伤。\n一些患者根本没有经历过严重的呼吸问题，神经障碍是他们感染冠状病毒的第一个也是唯一的迹象。\n贝加莫已启动对所有幸存者的密集检测和后续分析。医生团队定期检查那些康复的人，试图追踪病毒性质的变化。\n他在2月份重病后接受了气管插管，但后来康复了。新冠肺炎已经四个月没有出院了，但他仍然呼吸困难，并有一段时间非常疲惫。他接受自己目前的状况，但向人们发出明确警告，在任何情况下都不要感染病毒。\n他告诉我，对于那些不遵守规则的人，我希望他们能有一周和我一样的感受，一周和我一样糟糕的感觉。\n也许这样他们就会明白，他们不能低估我们收到的许多警告和强制性规定。\n执行跟踪和检测计划的医生表示，他们对病毒的了解不够多，无法预测接下来会发生什么。\n吉安卢卡·伊梅里医生向我解释说，这是一件非常不同的事情，它改变了病人的身体。\n我们也看到过各种形式的哮喘在冠状病毒感染后发展。我们肯定知道冠状病毒的损害是由炎症引起的，哮喘和其他呼吸系统疾病都是炎症性疾病，我们体内也有一些炎症性疾病可以由冠状病毒发展并引发。\n从放射学的角度来看，单纯冠状病毒肺炎患者会完全康复，但最大的变化可能是炎症。我的意思是，我们在他们所有的身体、血管系统和呼吸系统都看到了炎症，所以我们认为即使这些患者从疾病的急性期恢复过来，我们也必须解决他们的炎症问题。\n医生们认为，即使是最年轻和最轻微的感染者也有可能永远改变他们的生活，这可能需要数年时间才能显现出来。因此，整个劳动力可能会变得不那么高效。", "note_en": "The long-term effects of COVID-19, even on people who suffered a mild infection, could be far worse than was originally anticipated, according to researchers and doctors in northern Italy.\n Psychosis, insomnia, kidney disease, spinal infections, strokes, chronic tiredness and mobility issues are being identified in former   coronavirus patients in Lombardy, the worst-affected region in the country.\n  The doctors warn that some victims may never recover from the illness and that all age groups are vulnerable.\n  The virus is a systemic infection that affects all the organs of the body, not, as was previously thought, just a respiratory disease, they say.\n Some people may find that their ability to properly work, to concentrate, and even to take part in physical activities will be severely impaired.\n     The physicians warn that people who do not consider themselves in a vulnerable group and aren&#39;t concerned at contracting the disease could be putting themselves in danger of life-changing illnesses if they ignore the rules to keep safe.\n  They stress that the need for social distancing, hand washing, and masks is as important now as it ever was.\n The warnings come amid growing concerns in northern Italy that a second wave of the virus could be imminent. Doctors in two of the main hospitals in the region have reported a handful of new cases of severely ill people with respiratory problems.\n   Dr Roberto Cosentini, head of emergencies at Papa Giovanni XXIII Hospital in Bergamo, oversaw the response to the virus that swept through this alpine province claiming the lives of at least 6,000 people.\n He gave Sky News unprecedented access to the hospital&#39;s emergency rooms in March when the first shocking effects of the virus were broadcast around the world, changing perceptions of the scale of the problem.\n Now he is leading efforts to again send a warning across the globe that   COVID-19 is a lethal killer that affects the whole body, and is not going away.\n &#34;At first, initially, we thought it was a bad flu, then we thought it was a bad flu with a very bad pneumonia, it was the phase when you came here, but subsequently we discovered that it is a systemic illness with vessel damage in the whole body with renal involvement, cerebral involvement,&#34; he told me in the now silent COVID-19 emergency room that was overwhelmed a few months ago.\n     &#34;So we are seeing other acute manifestations of renal failure that require dialysis; or stroke, and then acute myocardial infarction, so a lot of complications or other manifestations of the virus.\n &#34;And also now we see a significant proportion of the population with chronic damage from the virus.&#34;\n One of the few positives emerging from the pandemic that caused havoc to the health service here was the creation of a unique environment where doctors and experts in different fields found themselves working together for months, effectively learning new skills. That co-operation is helping the understanding of the virus.\n Dr Emanuela Catenacci is a neurosurgeon at Cremona Hospital and when we first met her in March she had been co-opted to work on the intensive care wards during the worst of the outbreak.\n She is back on neurology, but crucially, whereas in the past she would have treated patients completely independent of other departments, now she can see the link. That link is COVID-19, and it&#39;s a multi-organ killer.\n   &#34;In our hospital now we have a practice with immunologists, who are checking these patients, especially the most severe, those with the most severe illnesses, and they are checking not only lungs, but all the systemic manifestations of COVID pathology,&#34; she told me.\n &#34;The virus is a systemic infection, some of our apparatus organs have the biggest manifestation, such as lungs as we know, but also brain, skin, and sometimes we have vasculitis, so it&#39;s not [just] high respiratory or low respiratory infection, it&#39;s not finished [at] that,&#34; she said.\n The Italian doctors&#39; findings in their patients mirror a recent study carried out at University College London.\n    Researchers identified serious neurological complications arising from COVID-19 including delirium, brain inflammation, stroke and nerve damage in 43 people aged 16 to 85.\n Some of the patients had experienced no severe breathing problems at all, with the neurological disorder being the first and only sign that they had coronavirus.\n An intensive testing and follow up analysis of all survivors has been launched in Bergamo. Teams of doctors examine those who have recovered on a constant basis, trying to track the changing properties of the virus.\n    He was intubated in February after becoming severely ill, but recovered. He has been COVID-19-free for four months but he still has problems breathing and has periods of severe exhaustion. He accepts his ongoing condition, but sends a clear warning to people to take care not to catch the virus under any circumstances.\n &#34;To those who don&#39;t respect the rules, I wish they could have a week of what I felt, a week of feeling as bad as I have been,&#34; he told me.\n &#34;Perhaps then they understand that they cannot underestimate the many warnings and mandatory rules we have been given.&#34;\n The doctors carrying out the follow-up and testing programme say they simply do not know enough about the virus to predict what is going to happen next.\n   &#34;It&#39;s something very different, that changes the body of the patient,&#34; Dr Gianluca Imeri explained to me.\n &#34;We&#39;ve also seen forms of asthma develop after coronavirus infections. We for sure know the damage of coronavirus is caused by inflammation, and asthma and other respiratory diseases are inflammatory diseases, and there are also some inflammatory diseases in our body that can be developed and triggered by coronavirus.\n &#34;Simple coronavirus pneumonia is something that patients will recover completely from, from a radiological point of view, but probably the biggest change is inflammation. I mean, we have seen inflammation in all of their bodies, vascular systems, and respiratory systems, so we think we have to tackle inflammation in these patients even when they recover from the acute phase of the disease.&#34;\n    Doctors believe that even the youngest and mildest infected are at risk of their lives being changed forever, and it could take years to become apparent. Whole workforces could become less productive as a consequence.", "posttime": "2020-07-15 05:55:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "医生,doctors", "title": "意大利医生：新冠肺炎的影响可能比最初想象的更糟", "title_en": "Italian Doctors: Effects of Covid-19 could be worse than first thought", "transed": 1, "url": "https://news.sky.com/story/coronavirus-warning-from-italy-effects-of-covid-19-could-be-worse-than-first-thought-12027348", "via": "", "real_tags": ["医生", "doctors"]}, {"category": "", "categoryclass": "", "imagename": "b8dca33e2afbf8fa7cbcf9848a75bc2c.png", "infoid": 1011878, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2011年，我和咪咪住在她位于阿根廷科尔多瓦的家中。在我搬到咪咪那里大约两个月后，我坐在她对面的桌子上，听她解释2001年发生的阿根廷比索贬值。\n在20世纪90年代，阿根廷比索与美元挂钩。这意味着阿根廷政府保证你可以随时用一阿根廷比索兑换一美元。如果你的银行账户里有1000阿根廷比索，你可以走进银行，要求1000美元，他们就会把钱交给你。\n到2001年，由于多种原因，钉住汇率制变得不可持续，阿根廷政府放弃了它。结果，汇率自由落体。\n想象一下，如果你看看你的银行账户，在一年的时间里，它的价值下降了75%，而你没有花掉一分钱。这实际上就是阿根廷发生的事情。\n在不到一年的时间里，汇率从1：1变成了4：1，如果你在2001年的银行账户上有价值1万美元的比索，一年后你只有2500美元。\n对于大多数公民来说，在汇率暴跌时提取美元的尝试都受挫了，因为对银行的挤兑(每个人都试图在同一时间取出自己的钱)意味着没有剩余的美元可供分发。\n咪咪告诉我她在银行外面睡了一个星期也没有用。她一生积蓄的75%都不见了。同样的事情也发生在其他人身上，犯罪率上升。雪上加霜的是，她不得不在窗户上安装栅栏，以防止她的房子像附近的许多其他人那样被抢劫。\n她的故事与我从卡特里娜飓风受害者那里听到的故事没有什么不同，他们于2015年逃离新奥尔良，留在我的家乡孟菲斯。他们的生活一夜之间被他们无法控制的力量改变了。\n也许正是因为这些故事，我才被纳西姆·塔勒布的作品所吸引。\n塔勒布的中心论点是，我们生活在一个越来越多地被罕见、不可预测和有影响力的事件所定义的世界里。他称这些事件为“黑天鹅”。黑天鹅事件的示例可能包括：\n1929年的股市崩盘对于那些将80%的净资产投资于市场的人来说。\n这类事件在一个人的一生中可能会发生一到两次。然而，发达国家的大多数人都经历过一段黑天鹅数量少得惊人的时期。\n尽管也有例外，比如被征召参加越南战争或成为恐怖袭击的受害者，但与之前的任何时代相比，自1945年以来，对于发达国家的人来说，这是一个非常稳定和和平的时期。\n我担心，结果是我们对这些稀有但有影响力的黑天鹅有一个不好的直觉。\n当我们在新闻上看到有关飓风或内乱的报道时，我们直觉地认为，“这永远不会发生在我身上。”\n但更重要的是，大多数人忽视了这些黑天鹅的可能性，因为他们不知道如果真的发生了什么，他们会做什么。\n这是一种可怕的可能性，而且没有简单的解决方案。当面对一个看似棘手的问题时，把头埋在沙子里似乎是我们的第一本能。在有相对简单的解决方案的情况下，比如购买保险，似乎更多的人会选择这样做。\n让这两个问题雪上加霜的是，坦率地说，许多为黑天鹅提供解决方案的生存准备专家(也就是“准备者”)经常他妈的疯了。\n一篇由“预备者”撰写的关于如何应对恶劣飓风的文章可能会以某种方式得出结论，即你的地下室需要一个适合准军事部队使用的武器库。\n似乎很明显，整个准备工作的场景都有一种深深的幸灾乐祸情绪。每当我听到大多数准备者的话，我都会有一种感觉，他们暗地里想要世界末日，这样他们就可以最终停止忍受销售中的那个混蛋，向僵尸群体(也就是前同事)开炮。\n这也是很好的营销手段，因为僵尸启示录的生动画面会激起更多的恐惧，并推动情感触发，这可能会驱使人们购买无用的物品。\n2017年夏天，当我的朋友受到休斯顿和佛罗里达州飓风的影响时，我想起了这种因素汇聚的危险。\n我想在这里介绍的是一种实用、便宜，而且，嗯，不是他妈的疯狂的方法。\n在“你应该为意想不到但影响很大的事件做好合理的准备”和“僵尸来吃你的BRAINZZZ了”之间有一条微妙的界限。\n为灾难做好准备并不意味着你需要增加为世界末日僵尸景观而设计的疯狂装备和小玩意儿。完全有可能理性地准备好你需要的所有必需品，装在一个袋子里。\n灰天鹅是一种半可预测的事件，可能不会导致死亡或任何形式的灾难性结果，但仍然会非常糟糕。\n你的房子/公寓在你睡觉的时候着火了，你不得不跑出去，没有时间去拿太多(或任何东西)。\n一场小的自然灾害，比如一场冰暴，会让你三天没有电或水，杂货店的货架上空空如也。\n你出人意料地丢掉了工作，找到另一份工作的时间比预期的要长。\n你意外伤害了自己(在美国，跌倒、车辆碰撞和中毒加起来每年约有4000万急诊室就诊)。\n恐怖袭击或战争，就像我们在中东以及越来越多的欧洲和美国看到的那样。\n大规模的自然灾害，如4级或5级飓风(如卡特里娜飓风、伊尔玛飓风或哈维飓风)，气候科学家预测这些灾害正变得越来越常见\n经济危机和社会动荡，就像2001年在阿根廷发生的情况，或者最近发生在希腊和塞浦路斯的情况。\n像1918年初那样的大流行，当时一种不同寻常的流感毒株设法杀死了7500万人(占世界人口的4%)。\n僵尸启示录，或者我将要称之为黑洞天鹅的东西，整个世界都被吞没了，它们是科幻小说(或者说票房大片)的素材。\n事实证明，银河系中心的黑洞实际上是一只巨大的星际黑天鹅，它误以为地球是一块玉米糖，并在万圣节前夕吃掉了它。(“星际迷航16：黑洞天鹅的进攻--即将在您附近的影院上映”)。\n你可能会想到有人处理过至少一次(如果不是更多)的灰天鹅灾难。在你的有生之年，这类事情很可能会发生在你身上(尽管我显然希望不会发生！)。\n黑天鹅和灰天鹅之间的区别有点武断，但一般来说，灰天鹅是你可以预见到的东西，而黑天鹅是真正意想不到的东西。\n如果你决定去跳伞，但降落伞打不开，那就是一只灰天鹅。这不太可能发生，但你可以预见到它的到来。\n如果你决定去打高尔夫球，当你在四号洞发球时，一个跳伞运动员从天而降，落到了你的头上，那是一只黑天鹅。\n如果你正在打高尔夫球，你在第四洞发球的伙伴被你认为是跳伞运动员的东西击中了，但实际上并不是外星人发送的生物武器，那么黑洞天鹅就会变成一只外星婴儿，这些婴儿通过耳道爬进你的大脑，使你成为可汗的精神控制武器。\n我在这里是在开玩笑。我不是想小看像全球热核战争这样的可能性，这在过去的半个世纪里一直是一种非常现实的可能性。\n我的意思是，我认为，作为个人，为黑洞天鹅僵尸启示录的生存做准备是一种道德上的误判。\n如果我错了，我将很高兴成为第一批被砍倒的僵尸之一，但我和贝宝(Paypal)的联合创始人马克斯·莱夫钦(Max Levin)在一起，他更喜欢在这个话题上“关闭派对对话”。“我通常会问人们，‘所以你在担心干草叉。你给当地的无家可归者收容所捐了多少钱？‘“。\n这些事件太大了，我认为必须在社会层面而不是个人层面来处理。\n为僵尸末日级别的场景做准备的最多的是较少经过计算的风险管理，而更多的是那些可能只需要去当地无家可归者收容所看治疗师或志愿者的幸灾乐祸的幻想。\n然而，黑天鹅类别是一个我认为很多人在错误校准的领域，因为他们认为这样的灾难的影响将没有它那么严重。\n我们如何错误校准：他们唯一不会出现的时候是你最需要他们的时候\n虽然传统的保险类型对灰天鹅事件有利，但它们在黑天鹅事件中失败了，因为纯粹的需求上升得如此之高、如此之快，以至于没有任何保险公司或政府机构能够处理它。\n一位密友的父母住在佛罗里达州那不勒斯，2017年夏天飓风伊尔玛在这里登陆。\n州长周二下午宣布强制疏散。他们听从指示，周二晚上收拾好行李，然后上了车，周三早上第一件事就是离开。\n到下午晚些时候，他们还没有走出几英里远。州际公路完全堵塞，加油站的燃料也所剩无几。整个佛罗里达州都试图离开。亚马逊不送货，杂货店空荡荡的，避难所里挤满了人。他们调转车头回家安然度过难关。\n冒着过于技术化的风险，这类黑天鹅具有所谓的非线性缩放效应。\n这意味着随着事件强度的增加，事件的影响会以大于线性的速度增加。\n在伴随飓风的风暴潮的情况下，每增加一英尺的风暴潮就会造成超过线性的伤害。\n例如，10英尺高的风暴潮可能造成的破坏是5英尺风暴潮的5倍或10倍，尽管只是5英尺风暴潮的两倍。15英尺的浪涌可能造成的破坏是5英尺浪涌的50倍或100倍，尽管只是5英尺浪高的3倍。\n举一个简化的例子，假设你住在一个海拔8英尺的房子里。\n五英尺高的风暴潮可能意味着没有水到达你家，你只是受到了一些风的破坏，因为大风撕裂了屋顶，维修费用高达数千美元。\n10英尺高的风暴潮将淹没房屋，摧毁一楼的一切，造成数万美元的损失。\n15英尺高的风暴潮将彻底摧毁整座房屋，造成数十万美元的损失。\n幸运的是，飓风没有在这种情况下预测的那么强烈，但教训是重要的：在黑天鹅事件中，如果你还没有准备好，就不太可能有人有能力帮助你，而且危险程度可能会很快升级。\n然而，通过一些基本的准备，你可以极大地降低黑天鹅事件对你的影响。\n当他们这样做的时候，他们可能会产生比你想象的更大的影响。\n如果你还没有准备好，很可能没有人能帮你\n准备实际上相当容易(也很便宜)。如果你提前做好，你就可以避免疯狂的僵尸启示录。\n如果你可以选择为潜在的毁灭性事件购买廉价的保险，你为什么不呢？\n如果你有价值100万美元的财产，你可以一次性支付500美元的保险，你会这样做吗？\nBUG OUT袋子不会让你准备好应对每一个潜在的黑天鹅事件，但它会覆盖很广的范围。\n这就是我认为Bug Out袋子的目的，这是一种为各种黑天鹅事件提供的廉价保险形式。\nBUG OUT包的目的是充当72小时应急资源。如果真的发生了某种黑天鹅事件，你就有了在袋子里生存72小时所需的一切，这应该足以让你到达安全的地方，或者至少让你不必冒险走出家门就能安然度过事件中最糟糕的部分。\n值得注意的是，72小时的时间框架是基于负责救灾和管理的组织的建议，这些组织表示，他们可能需要长达72小时的时间才能接触到受灾难影响的人们并提供帮助。也就是说，即使是那些至少在一定程度上帮助人们认识到黑天鹅事件的非线性缩放效应的人也是如此。\n我花了几百美元在几周内装好了我的Bug Out包。大多数物品都是不容易腐烂的，所以一旦你把它们放在一起，让它保持最新只需要更少的时间和金钱。\n希望我永远不会用到它，但我知道如果发生什么事，它就在那里，我确实睡得更好了。在我看来，光是改善睡眠就是值得的。\n当然，这不是免费的，也不是每个人都能把东西拼在一起。这对我们这些有幸有资源准备的人来说就更有理由了，我们可以自己做，这样援助机构和其他组织就可以把他们的资源投入到那些没有资源准备的人身上。\n注：所有链接都是我包里的。除非另有说明，这些都是日用品，所以买个不同的牌子就可以了。\n它包含一个BUG OUT包清单，上面列出了你需要的所有物品，以及在亚马逊上购买它们的链接。\n选择Bug Out袋子(或任何袋子)总是一个争论。\n大到足以容纳72小时的补给-取决于你的体重，你看到的是50-85升。50升的容量适合像5英尺2英寸/120磅这样的小个子身材的人，而85升的容量更适合像6英尺4英寸/250磅这样的大身材的人。)。REI在这里有一个非常棒的指南。\n长途步行时携带的舒适性--我背着一个不合适的背包进行了一次背包旅行，这真是太糟糕了。每个人的身材都有点不同，所以我会试着去当地的商店试穿一些背包，看看哪种适合你。在我的经验中，最重要的变量是一条舒适的髋带，它能让重量落在你的髋骨上，而不是你的肩膀上。\n如果你曾经背包旅行过三天或更长的时间，那么无论你用什么方式旅行，几乎肯定都能行得通。\n大约十年前，我买了一个85升的鱼鹰包，现在仍然经常用来野营和背包。这是一个很棒的Bug Out包，而且方便的是，我野营时带的90%的补给我也放在Bug Out包里。任何类似品牌的背包都应该可以很好地使用。\n水是放在Bug Out袋子里最重要的东西。每人每天最少要喝一升。因此，如果你自己使用这个袋子，你会想要在里面放三升水。\n鸭嘴兽膀胱：大多数背包都会有一个装膀胱的皮套，你可以在走路时用来喝水。皮套可以让你把水放在背包里靠近你的背部，这样它的重量就会降到最低。它在不使用时也很容易折叠。\n防碎水瓶：除了膀胱，营地周围还有一个水瓶很有用，如果膀胱用完了，它可以提供备用水源。\n净水药片：有一堆不同的产品可以净化你从小溪或河流中取来的水。这些平板电脑很便宜，我已经用了很多年了，从来没有出过问题。如果你随身携带炉子(见下图)，你可以随时烧开水作为备用选择。\n在水之后，食物是你要确保包括在内的下一个东西。我针对以下方面进行了优化：\n下面的食物组合由你自己决定，但下面的建议是每人每天3500-4000千卡(卡路里)。\n高能糖条：Mylar包装的品种可以使用5-10年。这类产品价格低廉(每美元约300卡路里)，方便，能量密集(每磅约2,000卡路里)。(推荐：10吧/人)\n金枪鱼罐头或鸡肉罐头：你需要一些蛋白质来源。罐头肉的储存期通常超过20年(你可以忽略“此日期前最佳”的日期)。它们也很便宜(每美元大约200-300卡路里)。(推荐：9罐/人)。\n椰子油/坚果黄油：椰子油或其他坚果黄油(如花生或杏仁)也很便宜，而且体重所需的卡路里很多。它们至少持续一年，通常更长。(推荐：1个16盎司罐子/人)。\n即食饭：可用微波炉加热的米饭大约两分钟就能加热，有温暖的东西吃是很不错的。这是预先调味的，所以你只需加一罐鸡肉，这就是一顿饭。严格来说，它们在六个月内就会变质，但我在过期后两年才吃过它们，它们是完好无损的。(推荐：9袋/人)。\n速溶咖啡：对那些没有沉迷于这种甜蜜、甜蜜的人，我向你们致敬。对于我们其他人来说，在紧急情况下戒掉咖啡因并不是一个好主意，星巴克Instant Via对速溶咖啡的好处出人意料。\n灶具和燃料：你需要一些东西来煮米饭，多带一种生火的方式并不会有什么坏处。如果你被困在家里没有水电设施，这也可以让你做饭几天。\n放在防水袋里的打火机：标准的Bic打火机效果很好。把一两个扔进保鲜袋里，这样它们就不会弄湿了。\n铝锅和烤肉：烹调和食用食物。链接是到一个漂亮的折叠式野营炉子上，但任何铝制锅都可以。铝很好，因为它很轻。\n服装最重要的一点就是从层次的角度来思考。你需要哪几层将取决于你所处的气候，但你想要有能让你在任何季节都感到舒适的物品。不管你住在哪里，你都会想要避免棉花和人造纤维更快干燥。\n我大多只是用那些污迹斑斑或穿破了的旧衣服，无论如何我都打算扔掉才能把这些放在一起。我想如果我必须用这个包，我不会太在意我看起来有多体面。\n2条裤子(带拉链的敞篷式裤子很棒，因为它们可以让你根据天气进行调整)。\n手套-试着买一双足够耐用和灵活的手套，你可以在戴着它们的时候生火。\n-双人帐篷：我认为，如果你想把背包放在里面，或者如果你最终有一个朋友/重要的另一半和你在一起，那么两人帐篷的额外重量对于房间来说是值得的。如果你想让它尽可能轻，那就选一个人的吧。\n睡袋：你会想要一个足够严谨的睡袋来保暖。我带着一个便宜的睡袋在零下的温度下露营，几乎睡不着觉。如果我必须给出一个一般的学位评级，我会说安全的打赌是一个30-40度的袋子。如果你住的地方经常比那更冷，那就调低一些。\n睡垫：直接睡在地上非常不舒服。睡垫可以解决这个问题。\n急救箱：你可以在这里买一个预制的，也可以自己组装一个。\n风管胶带：几乎对所有东西都有用。携带一整卷纸卷是不必要的，而且会增加额外的重量。我喜欢在我的水瓶周围包上大约10-20%的卷，这样就可以拿着它了。\nSAS生存指南：这是户外生存的经典书籍。很高兴有这样的推荐人。这本平装书特意小，所以你可以把它装在包里携带。\n缝纫工具包：如果你的帐篷或袋子撕裂了，或者一颗纽扣从你多余的裤子上脱落了，你会很高兴拥有这个的。\n任何处方药：不想把这些放在家里而陷入困境。(无论灾难如何，在家里随时多存一个月的钱并不是一项糟糕的政策)。\n火贴：火贴在家中起到卷报纸的作用。你用这种方式生火。\n.", "note_en": "In 2011, I lived with Mimi in her home in Córdoba, Argentina. About two months after I moved in with Mimi, I was sitting across the table from her, listening to her explain the Argentine peso devaluation that had happened in 2001.\n In the 1990s, the Argentine peso was pegged to the U.S. dollar. That meant the Argentine government guaranteed that you could always change one Argentine peso for one U.S. dollar. If you had 1,000 Argentine pesos in your bank account, you could walk into the bank and ask for $1,000 U.S. dollars and they’d hand it over.\n By 2001, the peg had become unsustainable for a number of reasons and the government of Argentina abandoned it. As a result, the exchange rate went into freefall.\n Imagine if you looked at your bank account and the value had gone down by 75 percent over the course of a year and you hadn’t spent a dime of it. That’s effectively what happened in Argentina.\n In less than a year, the exchange rate went from 1:1 to 4:1. If you had US$10,000 worth of pesos in your bank account in 2001, a year later you would have had only US$2,500.\n Attempts to withdraw U.S. dollars as the exchange rate plummeted were thwarted for most citizens, because the run on the bank (where everyone tries to take their money out at the same time) meant there were no U.S. dollars left to hand out.\n Mimi told me she slept outside the bank for a week to no avail. 75 percent of her life savings disappeared. The same happened to others, and crime increased. To add insult to injury, she had to install bars over her windows to prevent her house from being robbed like many others in the neighborhood were.\n Her story was not unlike ones I had heard from victims of Hurricane Katrina who had fled New Orleans in 2015 to stay in Memphis, my hometown. Their lives were changed overnight by forces outside of their control.\n It’s perhaps because of these sorts of stories that I was drawn to  the work of Nassim Taleb.\n Taleb’s central thesis is that we are living in a world increasingly defined by rare, unpredictable, and impactful events. He calls these events “black swans.” Examples of black swan events might include:\n The Stock Market Crash in 1929 for someone who had 80 percent of their net worth invested in the market\n These sorts of events might happen to a person once or twice in a lifetime. However, most people in the developed world have lived through a period of remarkable few black swans.\n Though there are exceptions, like getting drafted into the Vietnam War or being the victim of a terrorist attack, the period since 1945 has been a remarkably stable and peaceful one for those in the developed world compared to any prior era.\n The result, I fear, is that we have a bad intuition about these rare but impactful black swans.\n While we see stories on the news about hurricanes or civil unrest, we intuitively believe, “that could never happen to me.”\n But more than that, most people ignore these black swan possibilities because they don’t know what they’d do if something did happen.\n It’s a frightening possibility, and there’s no easy solution. When confronted by a seemingly intractable problem, sticking our head in the sand seems to be our first instinct. In cases where there’s a relatively easy solution, like buying insurance, more people seem to choose to do it.\n Exacerbating these two is that not all, but many survival preparedness experts (aka “preppers”) who present solutions for black swans are often, to be frank,  fucking insane.\n An article by a “prepper” on how to deal with a bad hurricane can somehow end with the conclusion that you need an armory fit for a paramilitary force in your basement.\n It seems quite clear that the whole prepper scene has a strain of schadenfreude that runs deep. Whenever I listen to most preppers, I get the feeling they secretly  want the world to end, so they can finally stop putting up with that asshole in sales and unleash their firearm arsenal on the zombie hordes (aka former coworkers).\n It’s also good marketing, as vivid images of a zombie apocalypse inspire more fear and  push emotional triggers which can drive people to buy useless items.\n When I had friends affected by the hurricanes in Houston and Florida in the summer of 2017, I was reminded of the danger of this confluence of factors.\n  What I’d like to present here is an approach that is practical, cheap, and, well, not fucking insane.\n There is a fine line between “you should make reasonable preparations for unexpected, but highly impactful events” and “OMGGG THE ZOMBIES ARE COME EAT YOUR BRAINZZZ.”\n Preparing for disasters does not mean you need to bulk up on crazy gear and gadgets designed for an apocalyptic zombie landscape. It’s entirely possible to rationally prepare yourself all the essentials you’d need, packed in a single bag.\n     A grey swan is a semi-predictable event that probably wouldn’t result in death or any sort of catastrophic outcome, but would nonetheless really suck.\n  Your house/apartment catches on fire while you are sleeping and you have to run out and don’t have time to grab much (or anything).\n A small natural disaster, like an ice storm, leaves you without electricity or water for three days and the grocery store shelves are empty.\n You lose your job unexpectedly and it takes longer than expected to find another job.\n You accidentally injure yourself (falls, vehicle collisions, and poisonings together account for some 40 million ER visits annually in the U.S.)\n    Terrorist attacks or war like we have seen in the Middle East, and increasingly Europe and the U.S.\n Large-scale natural disasters, like a Category 4 or 5 Hurricane (like Katrina, Irma, or Harvey), which climate scientists predict are becoming more common\n  Economic crises and social unrest, like what happened in Argentina in 2001, or more recently Greece and Cyprus\n Pandemics like in  1918 when an unusual strain of flu managed to kill 75 million people (4% of the world’s population)\n  Zombie Apocalypses, or what I am going to call Black Hole Swans, where the whole world is swallowed up, are the stuff of science fiction (or major hits at the box office).\n  It turns out that the black hole at the center of the milky way is, in fact, a giant inter-galactic black swan which mistakes the Earth for a piece of candy corn and eats it on Halloween. (Star Trek XVI: Attack of The Black Hole Swan — Coming Soon to Theatres Near You)\n  You can probably think of someone who had dealt with at least one, if not more, of the grey swan disasters. It’s highly likely a few things in this category will happen to you in your lifetime, (though obviously I hope not!)\n   The difference between a black swan and a grey swan is somewhat arbitrary, but generally a grey swan is something you can see coming, whereas a black swan is something truly unexpected.\n If you decide to go skydiving and your chute doesn’t open, that’s a grey swan. It’s unlikely to happen, but you can see it coming.\n If you decide to go play golf and while you are teeing off on hole four a skydiver falls out of the sky onto your head, that’s a black swan.\n A black hole swan would be if you were golfing and your buddy teeing off on hole four was hit by what you  thought was a skydiver but was  actually a biological weapon sent by aliens, which then proceeded to spawn alien babies that crawled into your brain via the ear canal and made you a mind control weapon of the Khan.\n  I am being a little tongue in cheek here. I don’t mean to trivialize the possibility of something like global thermonuclear war, which has been a very real possibility for the last half century.\n What I am saying is that I believe prepping for survival of a black hole swan zombie apocalypse  as an individual is a moral miscalculation.\n If I’m wrong, I’ll happily be one of the first zombies mowed down, but I’m with Max Levchin, the co-founder of Paypal, who prefers to “shut down party conversations” on  the topic. “I typically ask people, ‘So you’re worried about the pitchforks. How much money have you donated to your local homeless shelter?’”\n These events are so large that I believe they must be dealt with at a societal level rather than an individual one.\n Most prepping for zombie apocalypse level scenarios is less calculated risk management, and more of a schadenfreude fantasy by people who probably just need to see a therapist or volunteer at the local homeless shelter.\n However, the black swan category is an area where I believe a lot of people are miscalibrating because they think the effect of such disasters will be less severe than it is.\n  How We Miscalibrate: The One Time They Won’t Be There Is When You Need Them Most\n While traditional types of insurance are good for grey swan events, they fail at Black Swan events because the sheer demand goes up so high, and so quickly, that no insurance company or government agency can handle it.\n A close friend’s parents live in Naples, Florida, where Hurricane Irma made landfall in the summer of 2017.\n The governor announced a mandatory evacuation on Tuesday afternoon. They followed instructions, packed up their stuff Tuesday night, and got in the car to leave first thing Wednesday morning.\n By late afternoon, they hadn’t moved more than a few miles. The interstate was completely clogged, and there was no fuel left at the gas stations. The entire state of Florida was trying to leave. Amazon wouldn’t deliver, the grocery stores were bare, and the shelters were packed. They turned their car around and went home to ride it out.\n At the risk of getting too technical, these sorts of black swans have what are called nonlinear scaling effects.\n That means as the intensity of an event scales, the effect of the event increases at a greater-than-linear rate.\n In the case of the storm surges that accompany hurricanes, each additional foot of surge causes a greater-than-linear amount of harm.\n For instance, a ten-foot storm surge may cause five or ten times as much damage as a five-foot storm surge, despite only being twice as high. A fifteen-foot surge may cause fifty or a hundred hundred times as much damage as a five-foot surge, despite only being three times as high.\n To use a simplified example, imagine you live in a home that is eight feet above sea level.\n A five-foot storm surge may mean no water reaches your home and you just have some wind damage, due to high winds tearing up the roof, costing thousands of dollars to repair.\n A ten-foot storm surge would flood the house and ruin everything on the first floor, causing tens of thousands of dollars of damage.\n A fifteen-foot storm surge would completely destroy the entire house, causing hundreds of thousands of dollars of damage.\n Fortunately, the hurricane was not as strong as predicted in this case, but the lesson is important: in a black swan event it’s unlikely anyone will have the ability to help you if you haven’t prepared already, and the degree of danger can escalate very quickly.\n However, with some basic preparations you can dramatically reduce the effect that a black swan event might have on you.\n When they do, they will probably have a larger impact than you think they will\n It’s likely that no one will be able to help you if you haven’t prepared already\n Preparing is actually quite easy (and cheap)  if you do it in advance and you avoid the crazy zombie apocalypse stuff\n If you have the option to buy cheap insurance for a potentially devastating event, why wouldn’t you?\n If you had a million dollars worth of property and you could insure it for a one-time payment of $500, would you do it?\n  A bug out bag will not prepare you against  every potential black swan event, but it will cover a broad swath.\n This is what I see as the purpose of the Bug Out Bag, a cheap form of insurance for a broad array of black swan events.\n The purpose of a Bug Out Bag is to function as a 72-hour emergency resource. If some sort of black swan event did happen, you’d have everything you needed to survive for 72 hours in the bag, which should be enough time to get somewhere safe or at least for you to ride out the worst part of the event without having to venture out of your home.\n It’s worth noting that the the 72-hour time frame is based on advice from organizations responsible for disaster relief and management, who say it may take them up to 72 hours to reach people affected by a disaster and offer help. That is, even the people whose job it is to help at least somewhat recognize the nonlinear scaling effect of black swan events.\n I put together my Bug Out Bag in a couple weeks and spent a few hundred bucks to do it. Most of the items are non-perishable, so once you’ve put it together, keeping it up-to-date requires even less time and money.\n Hopefully I never have to use it, but I do sleep a bit better knowing it’s there if something happens. The improved sleep alone is worth the cost in my opinion.\n Of course, it’s not free, and not everyone will be able to put something together. This is all the more reason for those of us fortunate enough to have the resources to prepare do it on our own, so that aid agencies and other organizations can devote their resources to those who did not have the resources to prepare.\n   Note: All links are just what I have in my bag. Unless otherwise noted, these are all commodity products, so getting a different brand is fine.\n   It contains a bug out bag checklist of all the items you’ll need and links to buy them on Amazon.\n Choosing a Bug Out Bag (or any bag for that matter) is always a debate.\n  Big enough to hold 72 hours of supplies — depending on how much you weigh, you’re looking at 50–85 liters. 50-liter capacity would be appropriate for someone with a small build like 5’2” / 120lbs, while 85 liters would be more appropriate for someone with a big build like 6’4” / 250lbs.) REI has a  great guide here.\n Comfortable to carry while walking long distances — I’ve been on a backpacking trip with a pack that didn’t fit me right and it’s pretty miserable. Everyone is built a little differently, so I would try to go to a local store and try on some packs to see what fits you. In my experience, a comfortable hip strap that lets the weight rest on your hip bones rather than your shoulders is the most important variable.\n If you’ve ever gone backpacking for a three-day or longer trip, whatever you used for that will almost certainly work.\n I bought an  85-Liter Osprey Bag about a decade ago and still regularly use it for camping and backpacking. It works great as a Bug Out Bag, and conveniently 90% of the supplies I take camping I also keep in my Bug Out Bag. Any similar brand backpack should work fine as well.\n   Water is the most important thing to have in a Bug Out Bag. One liter per person per day is the minimum recommendation. So if you are using the bag for yourself, you’ll want to keep three liters of water in it.\n Platypus Bladder: Most packs will have a holster for a bladder that you can use to drink water while walking. The holsters let you keep the water close to your back in the pack where it’s weightiness is minimized. It is also easily collapsible when not in use.\n Shatter Resistant Water Bottle : In addition to the bladder, a water bottle is useful around camp and provides a backup water source if the bladder runs out.\n Water Purification Tablets : There are a bunch of different products for purifying water you draw from streams or rivers. These tablets are cheap and I’ve been using them for years and never had a problem. If you carry a stove (below), you can always boil water as a backup option.\n    After water, food is the next thing you want to make sure is included. I optimized for things that were:\n  What combination of the below you get is up to you, but the recommendations below are for 3,500–4,000 kcals (calories) per person, per day.\n High Energy Sugar Bars: Mylar-packed varieties can last 5–10 years. Such products are inexpensive (~300 calories per dollar), convenient, and energy-dense (~2,000 calories per pound). (Recommended: 10 bars/person)\n Canned Tuna  or   Canned Chicken: You need some source of protein. The storage life on canned meat is usually in excess of 20 years (you can ignore “best by” dates). They are also cheap (~200–300 calories per dollar). (Recommended: 9 cans/person)\n Coconut Oil / Nut Butters: Coconut oil or other nut butters (e.g. Peanut or almond) are also cheap and have a lot of calories for the weight. They last at least a year, usually longer. (Recommended: 1 16oz jar/person)\n Ready Rice : Microwaveable rice can be heated up with a stove in about two minutes, and it’s nice to have something warm to eat. It’s pre-seasoned, so you can just throw in a can of chicken and it’s a meal. Technically they go bad within six months, but I’ve eaten them as late as two years after expiration and they were fine. (Recommended: 9 pouches/person)\n Instant Coffee : To those of you who are not addicted to this sweet, sweet nectar, I salute you. For the rest of us, going through a caffeine withdrawal during an emergency is not a great idea.  Starbucks Instant Via is surprisingly good for instant coffee.\n Stove and   Fuel: You’ll need something to cook the rice and it doesn’t hurt to carry an extra way to start fire. If you were trapped at home without utilities, this would also let you cook for a few days.\n Lighter(s) in a waterproof bag: standard Bic lighters work great. Just toss one or two in a ziploc bag so they don’t get wet.\n Aluminum Pot and   Spork: to cook and eat the food. The link is to a nifty fold-up camping stove, but any aluminum pot works. Aluminum is nice because it’s light.\n   The biggest thing with clothing is to think in terms of layers. What layers you’ll need will depend on the climate you’re in, but you want to have items that will allow you to be comfortable in any season where you live. Regardless of where you live, you’ll want to avoid cotton — wool and synthetics dry faster.\n I mostly just used old clothes that were stained or worn and that I was planning to throw out anyway to put this together. I figure I won’t care too much about how presentable I look if I have to use this bag.\n 2 pairs of pants (The convertible kind with a zipper are great since they let you adjust based on the weather)\n  Gloves — try to get a pair that are durable and flexible enough you could make a fire while wearing them.\n   -Two-Person Tent: I think the extra weight of a two-person tent is worth it for the room if you want to be able to keep your pack inside or if you end up having a friend/significant other with you. If you want to keep it as light as possible, then go for a one-person.\n Sleeping Bag: You will want to have this be a serious enough bag to stay warm. I’ve camped in sub-freezing temperatures with a cheap sleeping bag, and it’s nearly impossible to sleep. If I had to give a general degree rating, I would say a safe bet is a 30–40 degree bag. If you live somewhere that is regularly colder than that, adjust down.\n Sleeping Pad: Sleeping directly on the ground is terribly uncomfortable. A sleeping pad solves that.\n   First Aid Kit: You can buy a premade one here or put one together yourself.\n Duct Tape: Useful for just about everything. Carrying a whole roll is unnecessary and adds extra weight. I like to wrap maybe 10–20 percent of a roll around my water bottle and carry it that way.\n SAS Survival Guide : The classic book on outdoor survival. Nice to have as a reference. The paperback is intentionally small so you can carry it in a pack.\n Sewing Kit: If your tent or bag rips or a button flies off your extra pair of pants, you will be happy to have this.\n  Any prescription medications: Don’t want to leave these at home and be in a bind. (Keeping an extra month’s worth at home at all times is not a bad policy regardless of disasters).\n   Fire Paste: Fire paste performs the function of rolled up newspapers in starting a fire at home. You build a fire the way\n......", "posttime": "2020-07-15 05:54:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "理性,bag", "title": "为合理理性的人准备“袋子精华”(Bag Essentials)", "title_en": "Bug Out Bag Essentials for Reasonably Rational People", "transed": 1, "url": "https://taylorpearson.me/bug-out-bag/", "via": "", "real_tags": ["理性", "bag"]}, {"category": "", "categoryclass": "", "imagename": "b9da156d3fa21bb406814d88f8262786.jpg", "infoid": 1011877, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特朗普政府撤销了一项有争议的政策，该政策可能会迫使就读于在冠状病毒大流行期间不提供面对面课程的大学的外国学生被驱逐出境。\n正如我们上周报道的那样，哈佛大学和麻省理工学院起诉特朗普政府，以阻止美国移民和海关执法局(ICE)发布的政策。根据7月6日宣布的政策变化，持有非移民(F-1和M-1)签证的外国学生将不得不离开美国，或者转到提供面对面课程的不同学校。\n但美国官员今天在美国马萨诸塞州地区法院就此案举行的听证会上透露，在与哈佛和麻省理工学院达成的和解协议中，美国官员同意撤销这项新政策。据“华尔街日报”报道，在周二下午的一次简短听证会上，美国地区法官艾莉森·伯罗斯(Allison Burroughs)证实已达成和解。她说，政府将撤销这项政策，撤回一份详细说明该规定的常见问题解答，并回到春季发布的指导意见的现状。\n根据3月13日发布的一项政策，该政策因和解协议而重新生效，ICE对F-1学生必须亲自上课的规定提供了豁免。哈佛/麻省理工学院的诉讼指出，当ICE发布这项豁免时，政府明确表示，这一安排在紧急状态期间有效。但特朗普政府7月6日的命令推翻了这一政策，尽管疫情正在肆虐，特朗普总统也没有撤销他的国家紧急状态声明。\n哈佛大学和麻省理工学院在诉讼中辩称，特朗普政府7月6日的政策变化是武断和反复无常的，因为它没有考虑到该机构面临的问题的重要方面。没有提供任何合理的依据来证明这一政策是合理的。诉讼还认为，这一变化违反了提供公共通知和接受评论的要求。\n哈佛有近5000名学生持F-1签证在美国学习，麻省理工学院有近4000名这样的学生。这些学校正计划在今年秋天只在网上授课，他们表示，现在取消的洲际教育政策对来自叙利亚等国的学生来说将是个问题，那里的内战和持续的人道主义危机使他们几乎不可能接入互联网和学习。这些学生还将不得不放弃他们已经做出的住房安排，违反租约，支付高昂的机票费用，并冒着新冠肺炎在跨洋航班上感染新冠肺炎的风险，或者面临被移民当局拘留和正式驱逐出境的风险。这类学生还将不得不放弃他们已经做出的住房安排，违反租约，支付高昂的机票，并冒着在跨洋航班上感染新冠肺炎的风险。或者说，这些学生面临被移民当局拘留和正式驱逐出境的风险。\n但除非有进一步的变化，否则今天的和解意味着这些学生将能够留在美国，并在今年秋天只参加在线课程。特朗普政府的倒退似乎令人意外--这两所学校今天早些时候提交了一份法庭文件，要求初步禁令，因为哈佛和麻省理工学院很可能凭借其优点取得成功，而且这项政策已经造成了伤害。哈佛和麻省理工学院在和解宣布前不久提交的文件中表示，政府正在世界各地的机场和领事馆执行这项指令，拒绝学生进入大学，因为这些大学已经做出了深思熟虑的决定，在今年秋天提供在线教学。\n虽然7月6日的政策将阻止外国学生在美国完全参加在线课程，但这项现已废除的政策表示，非移民学生可以通过就读采用在线课程和面授课程混合模式的学校，避免被驱逐出境。\n哈佛/麻省理工学院的诉讼通过城镇和数百所其他大学的之友案情摘要得到了支持。特朗普政府驱逐学生的行动在17个州和哥伦比亚特区提起的一起诉讼中，以及纽约州总检察长利蒂夏·詹姆斯(Letitia James)提起的另一起诉讼中，都面临着其他挑战。\n詹姆斯发表声明称，今天纽约10万多名国际学生、全国100多万名学生，以及世界各地数百万个家庭迎来了和解的好消息。\n詹姆斯说，特朗普总统和他的团队威胁到纽约和美国其他地区所有学生、所有教师和数亿居民的公共健康和安全，因为他急于重新开学，他的反移民动机，以及他不断下滑的民调支持率。适可而止。现在是总统不再把移民当作替罪羊，而是他开始领导我们国家度过这场全国性流行病的时候了。", "note_en": "The Trump administration has rescinded a controversial policy that could have forced the deportation of foreign students who attend colleges that aren&#39;t offering in-person classes during the coronavirus pandemic.\n As we  reported last week, Harvard University and the Massachusetts Institute of Technology sued the Trump administration to block the policy issued by US Immigration and Customs Enforcement (ICE). Under the policy change  announced July 6, foreign students with nonimmigrant (F-1 and M-1) visas would have had to leave the United States or transfer to different schools that offer in-person classes.\n But US officials agreed to rescind the new policy in a settlement with Harvard and MIT, as revealed today at a hearing on the case at US District Court for the District of Massachusetts. &#34;At a short hearing Tuesday afternoon, US District Judge Allison Burroughs confirmed that a settlement had been reached,&#34; The Wall Street Journal  reported. &#34;She said the government would rescind the policy, withdraw an FAQ detailing the rule and return to the status quo of guidance issued in the spring.&#34;\n Under a policy issued on March 13, which is back in effect because of the settlement, ICE provided an exemption to the rule that F-1 students must attend classes in person. The Harvard/MIT lawsuit pointed out that, when ICE issued this exemption, &#34;the government made clear that this arrangement was &#39;in effect for the duration of the emergency.&#39;&#34; But the Trump administration&#39;s July 6 order reversed that policy despite the pandemic raging on and the fact that President Trump had not rescinded his national emergency declaration.\n Harvard and MIT argued in their lawsuit that the Trump administration&#39;s July 6 policy change &#34;is arbitrary and capricious because it fails to consider important aspects of the problem before the agency... fails to offer any reasoned basis that could justify the policy.&#34; The lawsuit also argues that the change violates a requirement to provide public notice and take comments.\n  Harvard has nearly 5,000 students who study in the United States on F-1 visas, and MIT has nearly 4,000 such students. The schools, which are planning online-only instruction this fall, said that the now-rescinded ICE policy would have been problematic for students from countries such as &#34;Syria, where civil war and an ongoing humanitarian crisis make Internet access and study all but impossible.&#34; Such students also would have had to &#34;abandon housing arrangements they have made, breach leases, pay exorbitant air fares, and risk COVID-19 infection on transoceanic flights&#34; or &#34;risk detention by immigration authorities and formal removal from the country&#34; if they did not leave the US promptly, the lawsuit said.\n But barring further changes, today&#39;s settlement means those students will be able to remain in the US and take online-only classes this fall. The Trump administration&#39;s backpedal seemed to come as a surprise—the schools submitted a  court filing earlier today asking for a preliminary injunction &#34;because Harvard and MIT are likely to succeed on the merits&#34; and because the policy was already causing harm. &#34;The government is enforcing the Directive at airports and consulates across the world, turning students away because they attend universities that have made the considered decision to offer instruction online this fall,&#34; Harvard and MIT said in their filing submitted shortly before the settlement was announced.\n While the July 6 policy would have prevented foreign students from taking fully online course loads in the US, the now-rescinded policy said that nonimmigrant students could avoid deportation proceedings by attending schools that use a &#34;hybrid model&#34; of online and in-person classes.\n  The Harvard/MIT lawsuit had support via amicus briefs from  cities and towns and  hundreds of  other  colleges. The Trump administration&#39;s move to deport students faced other challenges in  one lawsuit filed by 17 states and the District of Columbia as well as in another  lawsuit filed by New York Attorney General Letitia James.\n James issued a statement calling today&#39;s settlement &#34;welcome news for more than 100,000 international students in New York, more than one million students across the country, and millions of additional families across the world.&#34;\n &#34;President Trump and his team threatened the public health and safety of all students, all faculty, and hundreds of millions of residents across New York and the rest of the nation because of his rush to reopen schools, his anti-immigrant motives, and his sagging poll numbers,&#34; James said. &#34;Enough is enough. It&#39;s time for the president to stop treating immigrants like nothing more than scapegoats and for him to start leading our nation through this national pandemic.&#34;", "posttime": "2020-07-15 05:35:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "行政,admin,学生", "title": "特朗普行政洞穴哈佛和麻省理工学院，不会驱逐只在网上学习的学生", "title_en": "Trump admin caves to Harvard and MIT, won’t deport online-only students", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/07/trump-admin-caves-to-harvard-and-mit-wont-deport-online-only-students/", "via": "", "real_tags": ["行政", "admin", "学生"]}, {"category": "", "categoryclass": "", "imagename": "5c81f427a4199366ea47e031dc30d60a.jpg", "infoid": 1011876, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这封电子邮件声称，SpaceX的Starlink私人测试版将于今年夏天启动，随后将进行“公开测试版”。SpaceX在电子邮件中继续表示，那些已经注册并注册接收关于这项服务的更新的人将会收到通知，“如果有测试版的机会可用”。\n随着SpaceX在正式服务发射之前扩大其星座，SpaceX继续发射新一批Starlink卫星。到目前为止，似乎只有极少数精选的个人能够真正使用Starlink驱动的互联网连接，包括SpaceX创始人兼首席执行官埃隆·马斯克(自然而然)和SpaceX的早期投资者史蒂夫·尤尔维特森。\n到目前为止，SpaceX总共发射了540颗Starlink卫星，尽管其中一些已经脱轨、停用或死亡，目前总共可能有超过500颗卫星处于活动状态。该公司还按计划在8月份之前确认了另外三次发布，其中一次从6月份推迟，现在可能会在本月晚些时候进行。\n与此同时，SpaceX一直在排队等待其运营监管要求，包括在加拿大申请电信运营商牌照，目的是为该国农村地区提供连接。它也有资格获得专门用于能够缩小美国宽带差距的公司的美国资金，尽管它可能会错过这些联邦资金中利润丰厚的第一批资金，因为它需要在本周的窗口关闭期间取消现有连接的低延迟。", "note_en": "The email asserts that SpaceX’s Starlink private beta will kick off this summer, with a “public beta to follow.” Those who’ve registered their interest and signed up to receive updates about the service will be notified “if beta testing opportunities become available,” SpaceX continues in the email.\n SpaceX has continued to launch new batches of Starlink satellites as it grows its constellation ahead of its official service launch. So far, it looks like a very few select individuals have been able to actually use Starlink-powered internet connections, including SpaceX founder and CEO  Elon Musk   (naturally) and early SpaceX investor  Steve Jurvetson  .\n  To date, SpaceX has launched a total of 540 Starlink satellites, though a number have either been deorbited, deactivated or died, leaving a total of likely somewhere over 500 currently active. The company has three more launches confirmed as planned through August, including one that was delayed from June and that will now likely occur later this month.\n Meanwhile, SpaceX has been lining up its regulatory requirements for operating, including  applying for a telecom operator license in Canada with the intent of delivering connections to rural parts of the country. It’s also eligible for U.S. funding earmarked for companies that can narrow the broadband gap in the U.S., though it’s likely to miss out on a lucrative first tranche of those federal funds because of a requirement to d emonstrate low-latency in existing connections during a window closing this week.", "posttime": "2020-07-15 05:35:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "starlink,starts,spacex", "title": "\nSpaceX的Starlink要求潜在的服务测试者提供地址，称私人测试版将于今年夏天开始", "title_en": "\n\t\t\t\tSpaceX’s Starlink asks potential service testers for addresses, says private beta starts this summer\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/14/spacexs-starlink-asks-potential-service-testers-for-addresses-says-private-beta-starts-this-summer/", "via": "", "real_tags": ["starlink", "starts", "spacex"]}, {"category": "", "categoryclass": "", "imagename": "e60e47566281fa2eb1a533111176f6db.jpeg", "infoid": 1011875, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你现在可以和世界上最强大的人工智能模型之一玩人工智能地下城了。\n当我在大学四年级的一次黑客马拉松上建造第一个版本的人工智能地下城时，那是一次有趣而古怪的冒险，但它完全不像今天这样。\n从那时起，我们已经发布了大量新功能来改善体验，包括增加多人游戏，创建任务完成检测系统，改进我们处理模型输出的方式，以及为世界记忆添加更复杂的系统。\n现在我们发布了AI地下城自推出以来最戏剧性的改进，龙模型。\n经过几周与OpenAI的合作，运行AB测试，对AI地下城数据进行微调，并获得反馈，我们已经准备好使AI地下城能够在基于GPT-3的模型上运行，这是世界上最强大的AI模型之一。我们将这个新模型的人工智能地下城版本命名为“龙”。它现在可供高级用户使用。\n自从对Dragon进行测试以来，我们和尝试过它的用户都被它在生成丰富而引人入胜的体验以及将它们编织成一个有凝聚力的故事方面的出色表现惊呆了。\n这里有一个“龙”能够创造出的故事的例子。将它与一年前的AI地下城形成对比。从那时起，进步无非是令人振奋。\n现在，有人工智能经验的人可能会想：“这很酷，但这肯定是精挑细选的，10个例子中最好的一个。”是的，我特别喜欢这个样本，所以它可能是稍微精挑细选的，但这种程度的连贯性是正常的，对于这个模型来说不是例外。这个故事以同样的连贯性持续了100年的行动。你可以在这里阅读整个故事。\n当我最终找到“精华之书”时，我甚至能够无缝地阅读其中的整个章节。这个游戏发明了一个复杂的魔术系统和背后的潜在理论，并在我阅读这本书时描述了整个系统。这种创造知识和魔法系统并以如此流畅的方式与用户分享的能力，让你想知道这些类型的游戏在5-10年后会有多强的沉浸感和强大功能。\n总的来说，这是游戏和娱乐的范式转变。10年后游戏的制作和玩法将与今天截然不同。\n在Latitude，作为这场游戏革命的先驱，我们致力于实现我们的愿景，创造游戏，让你不受开发者编写的供你选择的有限选项的限制，NPC不只是带有手工制作的对话框的艺术资产，世界不是冻结的，没有围墙的盒子。\n随着人工智能的快速发展，我们可以创造出这样的世界，在那里你可以用无数种独特的方式塑造世界，在那里，每一种体验、角色和地方都是独一无二的，都是活的，世界随着你的行动而改变，这些世界的居民感觉自己是活的和真实的。人工智能地下城仍然有很多方面没有达到这些目标，但我们离实现这一现实越来越近了，我们希望激励其他人跟随我们实现这个梦想。\n如果你想关注人工智能地下城的进展和这个人工智能生成游戏的新时代，请关注我的Twitter，我会定期在Twitter上发布想法和进展更新。\n要体验像所描述的那样的魔法冒险，请尝试AI地下城(特别是在龙模式下)。我保证这将是你从未有过的经历。", "note_en": "You can now play AI Dungeon with one of the most powerful AI models in the world.\n  When I built the  first version of  AI Dungeon at a hackathon my senior year of college it was a fun and wacky adventure, but it was nothing like what it’s become today.\n  We’ve released a ton of new features to improve the experience since then, including adding multiplayer, creating a quest completion detection system, improving how we handle model output, and adding more complex systems for world memory.\n And now we’re releasing the most dramatic improvement in AI Dungeon since we launched, the Dragon model.\n  After several weeks of collaboration with OpenAI, running AB tests, fine-tuning on AI Dungeon data, and getting feedback, we’re ready to enable AI Dungeon to run on a GPT-3 based model that’s one of the most powerful AI models in the world. We’re calling the AI Dungeon version of this new model “Dragon”. It’s available  now for  premium users.\n Since testing on Dragon, we and the users who have tried it out have been blown away with how good it is at generating rich and engaging experiences and at weaving them into a cohesive story.\n Here’s an example of the kind of story that Dragon is capable of generating. Contrast it with where AI Dungeon was just one year ago. The progress is since then is nothing but mind blowing.\n   Now people experienced with AI might be thinking “that’s cool and all, but surely this is the cherry picked, best out of 10 example” and yes I particularly liked this sample so it may be slightly cherry picked, but this level of coherence is the norm, not the exception for this model. This story goes on for 100s of actions with the same level of coherence. You can  read the whole story here.\n When I eventually find the “Book of Essence” I’m even able to seamlessly read entire sections from it. The game invents a complex magic system and underlying theory behind why it works and describes the whole system as I read the book. This ability to create lore and magical systems and share it with the user in such fluid ways makes you wonder just how immersive and powerful these type of games will be 5–10 years from now.\n  This is a paradigm shift for games and entertainment in general. How games are built and played in 10 years is going to look dramatically different from how they look today.\n At  Latitude, as the pioneers in this revolution in gaming, we’re committed to achieving our vision of creating games where you aren’t constrained by the limited options the developer wrote for you to choose from, where NPCs aren’t just art assets with some hand crafted dialog, and where worlds aren’t frozen, walled off boxes.\n With the rapid advances of AI we can make worlds where you can shape the world in an infinite number of unique ways, where each experience, character, and place is unique and living, where worlds change from your actions and the inhabitants of those worlds feel alive and real. There are still ways AI Dungeon falls short of those goals, but we’re getting closer and closer to achieving that reality and we hope to inspire others to follow us in achieving this dream.\n If you want to follow the progress of AI Dungeon and this new era of AI generated games  follow me on twitter where I periodically post thoughts and progress updates.\n To experience magical adventures like those described, try  AI Dungeon out (especially with the  Dragon model). I promise it will be like no experience you’ve ever had before.", "posttime": "2020-07-15 05:34:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "dunjo,dungeon,世界", "title": "AI Dunjo现在使用OpenAI提供的最大GPT-3模型", "title_en": "AI Dungeon now uses the largest GPT-3 model offered by OpenAI", "transed": 1, "url": "https://medium.com/@aidungeon/ai-dungeon-dragon-model-upgrade-7e8ea579abfe", "via": "", "real_tags": ["dunjo", "dungeon", "世界"]}]