[{"category": "", "categoryclass": "", "imagename": "a58177d39a50dae0f38c5c15fec238e4.jpeg", "infoid": 1031979, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Spotify科技Spot-3.93%走出了疫情爆发之初的低迷时期，因为消费者花在聆听这项服务上的时间比新冠肺炎关闭之前更多。\n这家音乐流媒体巨头在最近一个季度增加了比预期更多的用户，并表示消费习惯已经正常化，车内收听时间-随着通勤时间的减少-超过了大流行前的峰值。在封锁期间爆炸的家庭设备监听率也保持在较高水平。\n在截至9月1日的季度末。30，Spotify的月度活跃用户为3.2亿，高于其指引。付费用户是其最有利可图的客户类型，增长到1.44亿，处于该公司预测的高端。\n在本季度，订阅业务的每位用户平均收入下滑10%，至4.19欧元，相当于4.92美元，因为Spotify通过折扣计划引入了新的订户，并在印度和俄罗斯等新市场收取了更低的价格。该公司表示，本月已在七个市场上调了家庭计划的价格。\n该季度订阅收入较上年同期增长15%，至17.9亿欧元，相当于21亿美元。广告收入在上半年下滑后恢复增长，增长9%，至1.85亿欧元。虽然广告占Spotify总收入的10%或更少，但随着该公司扩大其播客业务，这一领域已经成为一个增长领域-在疫情爆发前，该领域的增幅达到了两位数-该业务在最近一个季度引领了Spotify的反弹。\n该公司表示，其服务目前有190万个播客可用，在此期间，22%的月度活跃用户收听了播客，高于上一季度的21%。“米歇尔·奥巴马播客”(The Michelle Obama Podcast)是Spotify在7月份推出的独家节目，是整个8月份收视率最高的播客。Spotify表示，9月份在Spotify上线的“乔·罗根体验”(The Joe Rogan Experience)现在是该服务所有英语市场的头号节目。\nSpotify第三季度亏损1.01亿欧元，合每股亏损58欧分，而去年同期该公司实现利润2.41亿欧元，合每股亏损36欧分。虽然该公司定期公布季度利润，但高管们表示，它将继续优先考虑增长-吸引新订户和投资播客。\n自由现金流是衡量公司运营产生的现金的指标-被许多投资者视为业绩的代表-为1.03亿欧元，是一年前4800万欧元的两倍多。\n该公司预计，第四季度月度活跃用户将增长至3.4亿至3.45亿，高端用户将增长至1.5亿至1.54亿。该公司的营收指引为20亿至22亿欧元。\n新闻集团旗下的道琼斯公司(Dow Jones&Amp；Co.)是“华尔街日报”的出版商，该公司与Spotify旗下的Gimlet Media部门建立了内容合作关系。", "note_en": "Spotify Technology    SPOT  -3.93%  moved past a slump that hit early in the pandemic, as customers collectively spent more time listening to the service than before Covid-19 shutdowns.\n  The music-streaming giant added more users than expected in the most recent quarter and said consumption habits have normalized, with in-car listening hours—which had fallen with time spent commuting—exceeding their pre-pandemic peak. Listening on home devices, which exploded during lockdowns, also remained high.\n  At the close of the quarter ended Sept. 30, Spotify had 320 million monthly active users, higher than its guidance. Paying subscribers, its most lucrative type of customer, grew to 144 million, at the high end of the company’s forecast.\n  During the quarter, average revenue per user for the subscription business slipped 10% to 4.19 euros, equivalent to $4.92, as Spotify brought in new subscribers via discounted plans and charged lower prices in new markets such as India and Russia. The company said it had raised the price of its family plan in seven markets this month.\n    Revenue from subscriptions was up 15% from a year earlier in the quarter, to €1.79 billion, equivalent to $2.1 billion. Advertising revenue returned to growth after sliding in the first half of the year, rising 9% to €185 million. Though advertising accounts for 10% or less of Spotify’s overall revenue, it has become a growth area—on a double-digit rise before the pandemic—as the company has expanded its podcast business, which led the rebound in the recent quarter.\n  The company said it now has 1.9 million podcasts available on its service, and during the period 22% of its monthly active users listened to one, up from 21% in the previous quarter. “The Michelle Obama Podcast,” a Spotify exclusive launched in July, was the most-listened to podcast through August. “The Joe Rogan Experience,” which arrived on Spotify in September, is now the No. 1 show in all of the service’s English-language markets, the company said.\n    Spotify swung to a loss of €101 million, or 58 European cents a share, in the third quarter, from a profit of €241 million, or 36 European cents a share, a year earlier. While the company has periodically reported a quarterly profit, executives have said it will continue to give priority to growth—attracting new subscribers and investing in podcasts.\n  Free cash flow, a measure of the cash a company generates from operations—viewed by many investors as a proxy for performance—was €103 million, more than double the €48 million a year earlier.\n  For the fourth quarter, the company forecast growth in monthly active users to between 340 million and 345 million, and in premium subscribers to between 150 million and 154 million. It guided for revenue of €2 billion to €2.2 billion.\n  News Corp’s Dow Jones &amp; Co., publisher of The Wall Street Journal, has a content partnership with Spotify’s Gimlet Media unit.", "posttime": "2020-10-29 19:29:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "同比,q3", "title": "Spotify第三季度总收入为19.7亿欧元，同比增长14%，ARPU为4.19欧元，同比下降10%，MAU为3.2亿欧元，同比增长29%，付费用户1.44亿，同比增长27%", "title_en": "Spotify had total Q3 revenue of €1.97B, up 14% YoY, ARPU of €4.19, down 10% YoY, with 320M MAUs, up 29% YoY, and 144M paying subscribers, up 27% YoY", "transed": 1, "url": "https://www.wsj.com/articles/spotify-recovers-from-early-pandemic-slump-11603965605?mod=djemalertNEWS", "via": "", "real_tags": ["同比", "q3"]}, {"category": "", "categoryclass": "", "imagename": "5b9a094fa62beda411a104c1ea4296e0.jpg", "infoid": 1031976, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在2020年的研究中，我们很高兴与94(！)。远程工具公司了解他们在做什么。与十几个人一起，我们谈得稍微近了一些，其中许多我们已经给你看过了。然而，在远程工作空间中令人惊叹的新创新的海洋中，我们仍然发现了差距。\n我们从还没有解决方案的远程团队那里听说过这样的问题。解决方案缺少让它们变得令人惊叹的小东西。这是我们对来年的祝福。\n管理一个国际分布的团队有很多挑战需要克服，但当涉及到管理一个多国组织时，最严格的挑战都是国际法规和专业化。\n远程工作的运营方面通常被认为相当乏味。这一切都是关于与监管机构合作，握手，很可能是一次昂贵的在许多国家扩张的旅程。努力工作，但不会不被赏识。\n至于我们在远程工作方面已经走了多远，我们在跨洲支付方面真的没有取得很大进展。在我的第一份远程工作中，我过去常常从一个普通的美国公司银行账户直接拿到我的瑞士银行账户的工资。付款到处都是错误的，费用很高，付款通常需要一周的时间才能到我手中。\n从那时起，我们已经大踏步前进了一两步。使用TransferWise这样的工具，您可以使整个过程更快、更便宜。现在转账只需要1-2个工作日，而且相当透明。更好的是：费用和可获得性并不局限于一个国家，TransferWise几乎在任何地方都可以获得。\n然后，还有像Venmo和PayPal这样的在线钱包。它们真的很方便，可以保证以低廉的价格进行即时转账，而且对于没有银行账户的人来说也非常方便。跳过尘土飞扬的银行基础设施？完全同意!。\n当然，还有加密货币。现在，比特币&Amp；Co。从来没有打算成为投资工具。在过去的一年里，我两次要求通过密码支付某些东西的费用。这些付款是即时的，非常便宜(我支付了大约0.001美元的手续费)，我的银行也没有问我关于从美国进行的那笔奇怪的大额转账的事情。现在，如果它更容易接近就好了。\n那么，未来的支付网关是什么样子呢？嗯，首先，它应该是可以接近的。太多的金融服务仅限于美国、加拿大和英国。它也应该是国际收款。例如，虽然银行转账几乎可以到任何地方，但我现在已经多次听说，人们宁愿不接受外国直接向银行付款，也不愿在印度开立账户。远程支付堆栈说明了这一点。\n最后，等待你的工资存根，然后在几天后拿到钱，真的不再适合互联网时代了。也许你可以利用加密货币和现有的基础设施来创造一些即时、简单和国际上可以访问的东西？\n谈到退休福利，许多偏远公司还没有百分之百认真对待，根据最新的调查，员工也不介意。由于工作与生活的平衡是人们经常提到的好处，远离工作本身就是一项令人惊叹的福利。人们乐于接受减薪，甚至放弃退休福利。\n即使一家公司对拥有401K；持开放态度，但由于每个国家都有自己的体系，要做到这一点几乎是不可能的。从德国的养老金计划(Pensionskasse)到日本的每股收益计划(EPS)，各国都运行着自己的系统，外国实体通常无法访问这些系统。\n起初，这似乎并不重要，但根据麻省理工学院(MIT)和多家金融咨询公司的研究人员的说法，参与并充实401K账户(以及其他国家随后的替代账户)是积累改变人生的财富的基石。对于所有的个人理财爱好者来说，没有这个选择可能会破坏交易。提供401K和其他退休福利将变得更加重要。\n我们的想法是：一家私营公司可以在法规范围内建立什么，以便提供真实的、与雇主匹配的、可在国际上获得的退休账户？利用现有的基础设施和法规？卖掉金条，然后把它们存放在几个储藏室里？某种电子保险？再说一遍，加密货币？我们喜欢听取意见。\n对于大多数偏远公司来说，幕后福利和福利只是意味着多一点钱。到目前为止，在我做过的所有远程工作中，我都把我的津贴作为定期工资支出的一部分。这意味着额外的应税收入，而不是什么津贴。\n听我解释。几年前，我的朋友受雇于我们当地一家非常慷慨的公司。他拿到了一份丰厚的薪水，但还可以通过公司租车，订阅午餐外卖服务，有一段时间甚至可以从公司的房地产部门租到一个房间。那笔费用直接从他的工资中扣除了。因此，他比前几年少交了1000美元的税款。\n许多津贴-从公司的汽车到新的Macbook-对偏远公司来说更容易用现金报销，所以根本没有税前津贴。作为一项潜在的新服务，您可以做些什么来实现这一点？\n一种选择是通过许多专门提供全面服务的提高采收率服务中的一项进行招聘。不过，对于许多已经有了工资单的公司来说，这并不有趣。在这里，你可以为人们节省上千美元的税金，所以这是一项你不必低价出售的服务。\n通信仍然是所有远程工具中的王道。在我们今年看到的众多工具中，可能有2/3是在某种形式的交流和协作领域。那么，还有哪些差距应该还存在呢？让我们从头到尾看一遍。\n我相信会议在很大程度上已经解决了。今年，我们看到了一些对传统会议体验的迭代，但对于拥有令人惊叹的产品匹配的团队来说，其中大多数都是一个微小的改进。有一件事还没有解决，那就是大型的、有节制的全体人员会议。\n全体会议是指在同一次会议中包括所有人，或者至少包括公司大部分人的会议。会议体验与标准的小组会议有根本的不同：演讲者聚焦，其他参与者很少发言。\n说话者和听话者之间的关系非常清楚-一个发言者，许多参与者(通常超过100人)应该能够在被要求发言时这样做，但不能在其他情况下这样做。与只能凑合使用Skype&amp；公司的团队相比，新的会议软件改善了此类会议的体验，但仍然不是无缝的。\n在某个时候，为了让所有人都通过Skype通话召开全体会议，我们会将两台笔记本电脑放在一起，一台笔记本电脑呼叫一半的公司，另一台笔记本电脑呼叫公司的另一半。那是胡说八道，😄&#34；\n上一次我在Zoom上召开全体会议时，事情并不顺利。一些人打电话进来，无法使自己静音。人们试图提问，但被演讲者或听众中的另一个人打断了。\n有100多名与会者，延迟无处不在，最糟糕的是-会议主持人在会议的某个时候断开了连接，当会议室能够继续时，录音就停止了。团队中有三分之一的人无法重播会议。\n我相信全体会议需要一种新的技术，这种技术很少使用-可能只在每月一次的较大规模的演讲和公告中使用-但每次都适用于这种类型的会议，包括服务器端录音、低延迟、发言请求和更广泛的主持功能。\n沟通和写作技能一直是现代远程团队的基本要求，这些团队在很大程度上依赖于稀疏和长形式的通信。许多有才华的人为此而苦苦挣扎，要么不习惯或不适应打字，要么就是更喜欢面对面的方式做事。\n就像我们通过教育津贴、会议、课程和书籍来培养知识型员工的技能一样，我们也应该开始考虑积极的沟通培训。\n过去，在我的职业生涯中，我从执教中获益良多。教练们帮助我解决了一些棘手的职业问题，并帮助我建立了一个成功的小企业。在未来，教练不仅会对硬技能感兴趣，而且可能会有更多的软技能。在沟通和写作方面接受持续的训练将会受到有目标的人和团队的欢迎。\n现在，我并不一定主张简单明了的写作训练。Grammarly已经在许多作家的口袋里放了一个自动化写作教练，但如果你能进一步推动这一点呢？提醒您您已经有一段时间没有更新状态了吗？如果你的文本缺少上下文或者读起来是被动攻击性的，就会通知你。Grammarly效果很好，即使在我写这篇文章的时候也是如此，但它不是一个端到端的沟通教练，只是它不可或缺的一部分。我们希望在那个领域看到一些新的东西。\n我们今年得到的一致反馈是，团队很难找到一种好方法来集思广益，进行新的创新。远程工作对于深入工作状态、收集一些想法和发现新想法是令人惊叹的，但当涉及到协作和将这些想法释放出来时，就会变得更加困难。\n我们学会了在专业领域进行头脑风暴的方式就是使用可视化。我们喜欢在白板上画思维导图或草图。填补空白确实可以产生新的想法，并帮助真正创新的团队想出令人惊叹的想法。\n我们必须在全球范围内这样做的选择并不总是符合我们的需要。我们有数字白板，允许人们在组合的空白空间上协作，有协作的绘图区和写作平台，但经常发生的是，随着事情变得更加异步和在线，我们往往会失去上下文。\n想想看--没有其他人在线，你怎么能想出点子呢？也许是附加在音频信息上的图画？一个全新的框架？IPad上的一款应用程序，可以让你在通话过程中快速地在共享空间上记下想法？\n我相信这是一个非常有趣的领域，而且绝对不只有一个解决方案。\n远程工作的招聘好处是毋庸置疑的。远程团队可以获得更大、更好的招聘资源。远程受雇的人被训练成更具自主性，并且被留任的时间要长得多。尽管如此，招聘偏远团队是很困难的，而且信噪比并不总是最好的。一旦雇用了员工，并不是每个人都适合远程优先的生活方式，让我们来解决这个问题吧！\n几十年来，生活教练一直是一件事，知名专家都提到优秀的教练是他们成功的原因之一。然而，正如我们都知道的那样，大部分都是胡说八道。许多没有其他有形技能的人都在寻求通过建议某种生活方式谋生，最常见的是同时出售一些课程、补充剂和其他项目。\n然而，外面也有专业的生活教练。公司创始人、高管和其他知名公众人物使用一系列教练来保持他们的身心平衡。CEO教练通常被用来培养更好的领导技能，很多初创公司的创始人都在利用教练来推动充满压力的风险生活。\n当我和新的远程员工交谈时，特别是现在的新冠肺炎时代，人们经常会迷失。我不止一次听到这样的说法：\n几周来，在家工作一直很棒，但现在我很累，而且每天都会偏头痛。\n我早上起不来床。在家工作很棒，但切断联系是一件很艰难的事情。\n成为一名远程工作者是生活方式的巨大改变。突然之间，一大早就没有通勤可赶了。没必要把你最好的裤子和衬衫拿出来。如果你让事情拖延太久，突然之间，你也就没有理由离开房子，吃一顿健康的午餐，或者洗澡了。这是一个很滑的斜坡。\n更大的需求是公司为远程员工提供的生活教练。同样，这可以是连接到您的Fitbit或Apple Watch的人或数字助理，但关键是新的远程工作人员对自己负责。\n几个月前，我在Facebook的几个群里分享了一个完全远程兼职支持我的企业的角色。我不经常登录Facebook，所以当我几天后回来时，我的收件箱里已经有300多份申请了，它们一直在源源不断地出现，直到我删除了这些帖子。我只能想象对于一个高知名度的全职角色会发生什么！\n最糟糕的是，大多数配置文件都是相当通用的。一遍又一遍地使用相同的简历、办公用字版面。一些人比另一些人执行得更好一些。为了减少简历的绝对数量，我经历了多个一级招聘周期。\n首先，我删除了所有没有发送合适简历的内容。其次，我剔除了那些不遵循(真的，真的)简单说明的应用程序。我询问了他们对薪水的期望、可获得性和时间表。从很多人那里，我收到了附有简历的空电子邮件，所以我把它们删除了。\n这使得简历数量降至60或70份左右。最后，我看了一下简历，看了看他们的经历，看了一遍他们的回复。不管是因为薪资期望不匹配，还是因为该领域缺乏相关技能，我最终得到了大约20份我可以更认真地查看的个人资料。\n这个过程花了我几个小时，通常是在你认真看简历和开始面试之前完成的第一级招聘。花了几个小时我本可以用来做更好的事。\n这就是为什么我认为这是一家公司建设的好地方。大型远程企业的每个职位通常会收到1000多份申请，其中80%以上的申请可能会立即被取消资格。无论是聪明的算法，还是后台的几个快速廉价的员工，如果你能为每个职位为企业节省一两天的工作，这是值得支付的。\n我们的时事通讯每隔一周发送一次，向您展示如何建立一个快乐、健康和高效的远程团队。", "note_en": "Research      In 2020, we were happy to have talked to  94 (!) remote tool companies about what they are up to. With more than a dozen we talked a little closer and many of them we&#39;ve shown you. However, amongst the sea of amazing new innovations in the remote work space, we still found gaps.\n  Struggles we&#39;ve heard from remote teams that don&#39;t have a solution yet. Solutions that are missing that little something to make them amazing. These are our wishes for the next year.\n      Running an internationally distributed team has a lot of challenges to overcome, but the most rigid of them all are international regulations and specializations when it comes to running a multi-national organization.\n  The operations side of remote work is usually deemed pretty unsexy. It&#39;s all about working with regulators, shaking hands and most likely an expensive journey to expand in a lot of countries. Hard work, but one that wouldn&#39;t go unappreciated.\n      For how far we&#39;ve come with remote work, we really haven&#39;t made a ton of strides with cross-continental payments. In my first-ever remote job, I used to get paid from a regular US corporate bank account directly to my swiss bank account. Payments got routed wrongly here and there, the fees were sky-high and the payments often took a week to get to me.\n  Since then, we&#39;ve made a stride or two. With something like  TransferWise, you can make the whole process a little bit speedier and cheaper. Transfers now only take 1-2 working days and are fairly transparent. Even better: Fees and availability aren&#39;t confined to one nation, TransferWise is almost available anywhere.\n  Then, there are online wallets like Venmo and PayPal. They are really handy to guarantee instant transfers at a cheap price and are very handy for folks that are unbanked. Skipping the dusty banking infrastructure? All for it!\n  And then, of course, there&#39;s cryptocurrency. Now, Bitcoin &amp; co. were never meant to become investment instruments. In the past year, I asked to get paid for something through crypto twice. The payments were instant, extremely cheap ( I paid around $0.001 in fees) and my bank didn&#39;t ask me about that weird big-money-transfer from the US. Now, if it only was easier to access.\n        So, how does the payment gateway of the future look like? Well, first of all, it should be accessible. Too many financial services are confined to the US, Canada and the UK. It should also be internationally receivable. While a bank transfer almost goes anywhere, I&#39;ve heard multiple times now that people would prefer not getting foreign direct-to-bank payments to accounts in India, for example. The remote payment stack accounts for that.\n  Finally, waiting for your pay stub and then the money a couple of days later really doesn&#39;t fit in the internet age anymore.  Maybe you can leverage cryptocurrency and existing infrastructure to create something instant, simple and internationally accessible?\n      When it comes to retirement benefits, many remote companies don&#39;t take it 100% seriously just yet and according to the latest surveys, employees don&#39;t mind either. With work-life balance as a commonly cited benefit, being remote in itself is an amazing perk. People are happy to take a pay cut or even let go of their retirement benefits.\n  Even if a company is  open to having a 401k, doing it the &#34;right&#34; away is almost impossible with every country having its own system. From the  Pensionskasse in Germany to the  EPS in Japan, countries run their own systems that are usually not accessible to foreign entities.\n  This might not seem important at first, but according to  researchers at MIT and multiple financial advisories, taking part in and maxing out 401k accounts (and subsequent alternatives in other countries) is a cornerstone to building life-changing wealth. For all personal finance lovers out there, not having that option may be a dealbreaker. Offering 401k and other retirement benefits is about to get a lot more important.\n  Our idea:  What can a private company build within the regulations that allows for true, employer-matched and internationally available retirement accounts? Piggy-back off existing infrastructure and regulations? Sell gold bars and store them in a few storage units? Some sort of e-insurance? Again, cryptocurrency? We&#39;d love to hear ideas.\n      For most remote companies, &#34;perks&#34; and &#34;benefits&#34; under the hood only mean a bit more money. In all remote jobs I&#39;ve had so far, I&#39;ve claimed my perk payouts as part of my regular salary payout. That means additional taxable income, not what perks are about.\n  Let me explain. A few years ago, my friend got hired at a very generous company local to us. He got a generous salary but was additionally able to lease a car through the company, set up a subscription for lunch delivery and for a while was even able to rent a room out of the company&#39;s real estate arm. The costs of that were deducted directly from his salary. As a result of that, he paid a few $1,000 less in taxes than in the previous years.\n  Many of those perks – from a company car to new Macbook – are much easier to reimburse in cash for remote companies, so no pre-tax perks at all.  As a potential new service, what can you do to make this happen?\n  One option is to hire through one of the many  EOR services that specialize in providing a full-service. For many companies that already have their payroll in order, that&#39;s not interesting though. You could save people multiple $1,000s in taxes here, so it&#39;s a service you don&#39;t have to sell for cheap.\n      Communication is still the king of all remote tools. Out of the many tools we&#39;ve seen this year, probably 2/3 were in the communication and collaboration space of some sort. So, what gaps are supposed to still be there? Let&#39;s walk through it.\n      I believe meetings are largely figured out. This year, we&#39;ve seen some iterations on the traditional meeting experience, but most of them are a minor improvement for teams that have an amazing product-fit. One thing that isn&#39;t solved yet is large, moderated all-hands meetings.\n  All-hands meetings are meetings that include all, or at least most of the company in the same meeting. The meeting experience is fundamentally different from your standard small group meeting: The speaker is in focus and other participants rarely speak.\n  The relationship between speaker and listener is quite clear – one speaker, many participants (often over 100) that should be able to speak when called to do so but not otherwise. The experience of such meetings has improved with new meeting software, compared to teams that had to make-do with Skype &amp; co., but it&#39;s still not seamless.\n    &#34;At some point, to have everyone on a Skype call for an all-hands meeting, we would have two laptops set up next to each other and have one laptop call half the company and the other laptop call the other half of the company. That was nonsense 😄&#34;\n      The last time I had an all-hands meeting on Zoom, things didn&#39;t go great. Some people called in and were unable to mute themselves. People tried to ask questions but got interrupted by either the speaker or another person in the audience.\n  With over 100 participants, latency was all over the place and the worst part – the meeting host had a disconnect at some point in the meeting and while the room was able to continue, the recording stopped there. A third of the team was not able to re-play the meeting.\n  I believe all-hands meetings warrant a new piece of tech that is rarely used – probably only for larger talks and announcements once a month – but works for that type of meeting every single time, including server-side recording, low latency, speaking requests and a larger range of moderation features.\n      Communication and writing skills have been essential requirements for modern remote teams that largely rely on sparse and long-form communication. Many talented people struggle with that, are either not used or accommodated to typing a lot of simply prefer the face-to-face way of doing things.\n  Just like we build our knowledge worker&#39;s skills using education stipends, conferences, courses and books, we should also start looking into active communication training.\n  In the past, I have benefitted from coaching a lot in my career. Coaches have helped me push through some tough professional issues and have helped me build a small successful business. In the future, coaching will not only be interesting for hard skills but possibly even more soft skills. Getting continuous training in communication and writing will be popular with goal-getters and teams alike.\n  Now, I&#39;m not necessarily advocating for plain and simple writing training.  Grammarly has put an automated writing coach in many author&#39;s pockets, but what if you could push that further? Remind you that you didn&#39;t give a status update in a while? Notifying you if your text lacks some context or reads passive-aggressive. Grammarly works great, even as I am writing this post, but it&#39;s not an end-to-end communication coach, just an integral part of it.  We&#39;d love to see something new in that space.\n      A consistent piece of feedback we&#39;ve gotten this year is that teams struggle to find a good way to brainstorm new innovations. Remote work is amazing to get into a deep state, collect some thoughts and find new ideas, but when it comes to collaboration and getting those thoughts out, it gets more difficult.\n  The way we&#39;ve learned to brainstorm in the professional world is using visualizations. We like to draw mind maps or sketch graphs on a whiteboard. Filling out the blank space can indeed yield new ideas and has helped really innovative teams come up with amazing ideas.\n        The options we have to do so across the globe are not always fitting to what we need. We have digital whiteboards that allow people to collaborate on a combined white space, there are collaborative drawing areas and writing platforms but what often happens is that with things being more asynchronously and online, we tend to lose context.\n  Think about this – how can you yield ideas without the other person being online? Maybe drawings that are attached to audio messages? An entirely new framework? An app for the iPad that allows you to quickly jot down ideas on a shared space during a call?\n  I believe this is a very interesting space to be in and there&#39;s definitely not just one solution.\n      The recruiting benefits of remote work are undisputed. Remote teams have access to bigger and better hiring pools. People that get hired remotely are trained to be more self-directed and are retained for a lot longer. Despite all of that, hiring for a remote team is hard and the signal-noise ratio isn&#39;t always the best. Once people are hired, not everyone is made for the remote-first lifestyle, let&#39;s solve that!\n      Life coaching has been a thing for decades and high-profile experts have referenced good coaches as one of the reasons for their success. As we all know though, most of it is nonsense. Plenty of people without other tangible skills are looking to make a living off suggesting a certain lifestyle and most commonly sell some courses, supplements and other programs alongside it.\n  However, there  are professional life coaches out there. Company founders, executives and other high-profile public figures use a range of coaches to keep their mind and body in balance. CEO coaches are often used to build better leadership skills and plenty of startup founders are using coaches to push through the stressful venture life.\n  When I talk to new remote employees, especially now in the time of Covid-19, people are often lost. More than once I&#39;ve heard a statement along these lines:\n    &#34;Working from home has been great for a couple of weeks, but now I&#39;m tired and I tend to get migraines every day.&#34;\n  &#34;I can&#39;t get out of bed in the morning. Working from home has been great, but disconnecting is a struggle.&#34;\n      Becoming a remote worker is a drastic lifestyle change. Suddenly, there&#39;s no commute to catch early in the morning. No need to get your best pants and shirt out. If you let things slip for too long, suddenly there&#39;s no reason to leave the house, get a healthy lunch or shower anymore either. It&#39;s a slippery slope.\n  The bigger is the need for company-provided life coaches for remote workers. Again, this can either be a human or a digital assistant that connects to your Fitbit or Apple Watch, but the key point is that new remote workers are staying accountable to themselves.\n      A few months ago, I shared a fully remote part-time support role for my  business in a few Facebook groups. I don&#39;t log in to Facebook often, so when I came back after a couple of days I had over 300 applications in my inbox already and they kept coming until I deleted the posts. I can only imagine what&#39;d happen for a highly visible full-time role!\n  The worst part is that most profiles are pretty generic. The same CV office word layout over and over. Some a bit better executed than others. I went through multiple cycles of &#34;first-level recruiting&#34; to just bring down the sheer number of resumés.\n  First, I deleted all that didn&#39;t send a proper CV. Second, I got rid of applications that didn&#39;t follow the (really, really) simple instructions. I asked for salary expectations, availability and timeframe. From plenty of people, I got empty emails with a CV attached, so I removed those.\n        That brought the CV count down to around 60 or 70. Finally, I was able to take a look at the CVs, see their experience and go over their reply. Be it because of mismatched salary expectations or lack of relevant skills in the space, I ended up with about 20 profiles I was able to look at more seriously.\n  The process took me a few hours and is usually wrapped up as &#34;first-level hiring&#34;, everything that happens before you take a serious look at the CV and start doing interviews. It took a few hours I could have used for a better cause.\n  That&#39;s exactly why I think it&#39;s a good space for a company to build in. Big remote businesses are regularly getting over 1,000 applications per position and north of 80% of them can immediately get disqualified. Be it a smart algorithm or a few fast and cheap workers in the background,  if you can save a business a day or two of work for every position, that&#39;s worth paying for.\n  Our newsletter is sent every other week to show you how to build a happy, healthy and efficient remote team.", "posttime": "2020-10-29 19:23:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "看到,work", "title": "我们明年很想看到的远程作业工具", "title_en": "The remote work tools we'd love to see next year", "transed": 1, "url": "https://nohq.co/blog/the-remote-work-tools-wed-love-to-see-in-2021/", "via": "", "real_tags": ["看到", "work"]}, {"category": "", "categoryclass": "", "imagename": "6d312172a3cbaadd23c6c0a55e4a5d2a.jpeg", "infoid": 1031975, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在“星际迷航：下一代”(Star Trek：The Next Generation)剧集“人的尺度”(The Measure Of A Man)中，企业号(Enterprise)的一名Android机组人员Data将被拆解，用于研究目的，除非皮卡德船长能辩称，数据应该享有与人类同等的权利。自然会出现这样的问题：某物拥有权利的基础是什么？是什么赋予了一个实体道德地位？\n哲学家彼得·辛格(Peter Singer)认为，能够感觉到痛苦或痛苦的生物有权享有道德地位。他认为，非人类动物有道德地位，因为它们能感觉到痛苦和痛苦。将其限制在人身上将是一种物种歧视，类似于种族主义和性别歧视。\n如果不支持辛格的推理，我们可能会想，它是否可以进一步扩展到像Data这样的Android机器人。这将要求数据要么能感觉到痛苦，要么能遭受痛苦。你如何回答这个问题取决于你如何理解意识和智力。\n随着真正的人工智能技术向好莱坞想象的版本迈进，道德地位的问题变得更加重要。如果人工智能有道德立场，像我这样的哲学家有道理，那么他们就有生命权。这意味着你不能简单地拆卸它们，也可能意味着人们不应该干涉他们追求自己的目标。\nIBM的深蓝国际象棋机器被成功训练，击败了特级大师加里·卡斯帕罗夫。但它不能做其他任何事情。这台计算机拥有所谓的领域特定智能。\n另一方面，有一种智力可以让你有能力把各种事情做好。这就是所谓的“领域通用智能”。这是让人们做饭、滑雪和抚养孩子的东西-这些任务是相关的，但也有很大的不同。\n人工通用智能，AGI，是具有领域通用智能的机器的术语。可以说，目前还没有一台机器显示出这种智能。今年夏天，一家名为OpenAI的初创公司发布了新版本的生成性预培训语言模型。GPT-3是一个自然语言处理系统，经过读写训练，便于人们理解。\n它立即引起了人们的注意，不仅是因为它有令人印象深刻的模仿文体华丽和整合看似合理的内容的能力，还因为它与以前的版本有很大的不同。尽管GPT-3的表现令人印象深刻，但实际上，除了如何以各种方式将单词串在一起之外，GPT-3并不知道其他任何事情。AGI仍然遥遥无期。\n图灵测试以人工智能先驱研究人员艾伦·图灵的名字命名，有助于确定人工智能何时是智能的。与隐藏的人工智能对话的人能分辨出它是人工智能还是人类吗？如果他不能，那么在所有的实际目的中，人工智能都是智能的。但这项测试并没有说明人工智能是否可能是有意识的。\n意识有两个部分。首先，这是一种体验对我来说是什么样的方面，也就是意识的感官部分。哲学家们称之为现象意识。它是关于你如何体验一种现象，比如闻到玫瑰花或感觉到疼痛。\n相比之下，还有接近意识。这是一种根据目标对刺激做出协调和反应的报告、推理、行为和行动的能力。例如，当我把足球传给我的朋友在球门上玩耍时，我是在对视觉刺激做出反应，根据之前的训练采取行动，并追求游戏规则确定的目标。在比赛的过程中，我自动传球，没有经过深思熟虑。\n失明很好地说明了这两种意识之间的区别。例如，患有这种神经疾病的人可能会报告说，他们在视野的左侧看不到任何东西。但如果要求他们从视野左侧的一组物体中拿起一支笔，他们可以可靠地这样做。他们看不见钢笔，但他们可以在得到提示时拿起它-这是一个没有现象意识的访问意识的例子。\nAndroid的数据表明，他是有自我意识的，因为他可以监控，例如，他是否充电最好，或者他的机械臂是否有内部损伤。\n数据在一般意义上也是智能的。他在很高的掌握水平上做了很多截然不同的事情。他可以驾驶进取号，听从皮卡德上尉的命令，和他商量最好的路线。\n他还可以和他的船友打牌，做饭，和密友讨论热点问题，与外星人作战，从事各种形式的体力劳动。数据具有访问意识。他显然会通过图灵测试。\n然而，数据很可能缺乏非凡的意识-例如，他不喜欢玫瑰花的香味，也不经历痛苦。他体现了一种超大版本的盲目。他有自我意识，有接近意识-可以抓住笔-但在他所有的感官中，他缺乏非凡的意识。\n现在，如果数据没有感觉到痛苦，那么辛格提出的给予生物道德地位的至少一个原因是没有实现的。但数据可能满足另一个条件，即即使没有感觉到痛苦，也能够忍受痛苦。痛苦可能不像痛苦本质上那样需要非凡的意识。\n例如，如果痛苦也被定义为在不对他人造成伤害的情况下追求正义事业受挫的想法，那会怎么样？假设Data的目标是拯救他的船员，但由于他的一条四肢受伤，他无法联系到她。数据功能的下降使他无法拯救他的船员，这是一种不同寻常的痛苦。他宁愿救那名船员，如果他救了他会过得更好。\n在这一集中，问题最终不在于数据是否具有自我意识-这是毋庸置疑的。他是否聪明也是毋庸置疑的--他很容易证明他是一般意义上的。目前尚不清楚的是，他是否具有非凡的意识。数据没有被拆解，因为最终，他的人类评判者不能就意识对道德立场的重要性达成一致。\n数据是善意的-他的行动是为了支持他的船员和他在外星人星球上遇到的那些人的福祉。他服从人们的命令，似乎不太可能伤害他们，他似乎是在保护自己的存在。由于这些原因，他看起来很平和，更容易接受有道德立场的事物的领域。\n但是“终结者”电影中的天网呢？或者埃隆·马斯克(Elon Musk)最近表达的对人工智能比核武器更危险的担忧，以及斯蒂芬·霍金(Stephen Hawking)对人工智能终结人类的担忧？\n人类不会因为违背另一个人的利益而丧失他们的道德地位。同样，你不能仅仅因为一个人工智能的行为违背了人类的利益或另一个人工智能的利益，就自动说它没有道德地位。你可能有理由反击像天网这样的人工智能，但这并不能夺走它的道德地位。如果道德地位是由于能够遭受非同寻常的痛苦而赋予的，那么天网和数据都会得到道德地位，即使只有数据想要帮助人类。\n目前还没有人工通用智能机器。但现在是考虑如何才能赋予他们道德地位的时候了。人类如何选择回答非生物生物的道德地位问题，将对我们如何处理未来的人工智能产生重大影响-无论是像数据一样善良和有帮助的人工智能，还是像天网一样开始毁灭的人工智能。", "note_en": "In the  “Star Trek: The Next Generation” episode  “The Measure of a Man,” Data, an android crew member of the Enterprise, is to be dismantled for research purposes unless Captain Picard can argue that Data deserves the same rights as a human being. Naturally the question arises: What is the basis upon which something has rights? What gives an entity moral standing?\n The philosopher  Peter Singer argues that  creatures that can feel pain or suffer have a claim to moral standing. He argues that nonhuman animals have moral standing, since they can feel pain and suffer. Limiting it to people would be a form of speciesism, something akin to racism and sexism.\n Without endorsing Singer’s line of reasoning, we might wonder if it can be extended further to an android robot like Data. It would require that Data can either feel pain or suffer. And how you answer that depends on how you understand consciousness and intelligence.\n As real artificial intelligence technology advances toward Hollywood’s imagined versions, the question of moral standing grows more important. If AIs have moral standing,  philosophers like me reason, it could follow that they have a right to life. That means you cannot simply dismantle them, and might also mean that people shouldn’t interfere with their pursuing their goals.\n   IBM’s  Deep Blue chess machine was successfully trained to beat grandmaster Gary Kasparov. But it could not do anything else. This computer had what’s called domain-specific intelligence.\n On the other hand, there’s the kind of intelligence that allows for the ability to do a variety of things well. It is called domain-general intelligence. It’s what lets people cook, ski and raise children – tasks that are related, but also very different.\n Artificial general intelligence, AGI, is the term for machines that have domain-general intelligence. Arguably no machine has yet demonstrated that kind of intelligence. This summer, a startup called  OPENAI released a new version of its  Generative Pre-Training language model. GPT-3 is a natural-language-processing system, trained to read and write so that it can be easily understood by people.\n It drew immediate notice, not just because of its impressive ability to mimic stylistic flourishes and put together  plausible content, but also because of how far it had come from a previous version. Despite this impressive performance, GPT-3  doesn’t actually know anything beyond how to string words together in various ways. AGI remains quite far off.\n Named after pioneering AI researcher Alan Turing, the  Turing test helps determine when an AI is intelligent. Can a person conversing with a hidden AI tell whether it’s an AI or a human being? If he can’t, then for all practical purposes, the AI is intelligent. But this test says nothing about whether the AI might be conscious.\n  There are  two parts to consciousness. First, there’s the what-it’s-like-for-me aspect of an experience, the sensory part of consciousness. Philosophers call this phenomenal consciousness. It’s about how you experience a phenomenon, like smelling a rose or feeling pain.\n In contrast, there’s also access consciousness. That’s the ability to report, reason, behave and act in a coordinated and responsive manner to stimuli based on goals. For example, when I pass the soccer ball to my friend making a play on the goal, I am responding to visual stimuli, acting from prior training, and pursuing a goal determined by the rules of the game. I make the pass automatically, without conscious deliberation, in the flow of the game.\n Blindsight nicely illustrates the difference between the two types of consciousness. Someone with this neurological condition might report, for example, that they cannot see anything in the left side of their visual field. But if asked to pick up a pen from an array of objects in the left side of their visual field, they can reliably do so. They cannot see the pen, yet they can pick it up when prompted – an example of access consciousness without phenomenal consciousness.\n    The android Data demonstrates that he is self-aware in that he can monitor whether or not, for example, he is optimally charged or there is internal damage to his robotic arm.\n Data is also intelligent in the general sense. He does a lot of distinct things at a high level of mastery. He can fly the Enterprise, take orders from Captain Picard and reason with him about the best path to take.\n He can also play poker with his shipmates, cook, discuss topical issues with close friends, fight with enemies on alien planets and engage in various forms of physical labor. Data has access consciousness. He would clearly pass the Turing test.\n However, Data most likely lacks phenomenal consciousness - he does not, for example, delight in the scent of roses or experience pain. He embodies a supersized version of blindsight. He’s self-aware and has access consciousness – can grab the pen – but across all his senses he lacks phenomenal consciousness.\n Now, if Data doesn’t feel pain, at least one of the reasons Singer offers for giving a creature moral standing is not fulfilled. But Data might fulfill the other condition of being able to suffer, even without feeling pain. Suffering might not require phenomenal consciousness the way pain essentially does.\n For example, what if suffering were also defined as the idea of being thwarted from pursuing a just cause without causing harm to others? Suppose Data’s goal is to save his crewmate, but he can’t reach her because of damage to one of his limbs. Data’s reduction in functioning that keeps him from saving his crewmate is a kind of nonphenomenal suffering. He would have preferred to save the crewmate, and would be better off if he did.\n In the episode, the question ends up resting not on whether Data is self-aware – that is not in doubt. Nor is it in question whether he is intelligent – he easily demonstrates that he is in the general sense. What is unclear is whether he is phenomenally conscious. Data is not dismantled because, in the end, his human judges cannot agree on the significance of consciousness for moral standing.\n   Data is kind – he acts to support the well-being of his crewmates and those he encounters on alien planets. He obeys orders from people and appears unlikely to harm them, and he seems to  protect his own existence. For these reasons he appears peaceful and easier to accept into the realm of things that have moral standing.\n But what about  Skynet in the  “Terminator” movies? Or the worries recently expressed by  Elon Musk about  AI being more dangerous than nukes, and by  Stephen Hawking on  AI ending humankind?\n  Human beings don’t lose their claim to moral standing just because they act against the interests of another person. In the same way, you can’t automatically say that just because an AI acts against the interests of humanity or another AI it doesn’t have moral standing. You might be justified in fighting back against an AI like Skynet, but that does not take away its moral standing. If moral standing is given in virtue of the capacity to nonphenomenally suffer, then Skynet and Data both get it even if only Data wants to help human beings.\n There are no artificial general intelligence machines yet. But now is the time to consider what it would take to grant them moral standing. How humanity chooses to answer the question of moral standing for nonbiological creatures will have big implications for how we deal with future AIs – whether kind and helpful like Data, or set on destruction, like Skynet.", "posttime": "2020-10-29 19:23:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机器人,有意识,conscious,人工智能", "title": "如果机器人是有意识的，可以把它关掉吗？", "title_en": "If a robot is conscious, is it OK to turn it off?", "transed": 1, "url": "https://theconversation.com/if-a-robot-is-conscious-is-it-ok-to-turn-it-off-the-moral-implications-of-building-true-ais-130453", "via": "", "real_tags": ["机器人", "有意识", "conscious", "人工智能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031974, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "比利时最令人憎恨的人，恋童癖马克·杜鲁克斯，在过去的六年里未经审判就被关押了。安德鲁·奥斯本想知道为什么正义要这么久才能得到伸张。\n比利时的头号公敌杜鲁克斯，自1996年以来一直被监禁，但审判日期仍未确定。可能是今年，可能是下一个-谁能说得准，官员们耸耸肩。\n1996年，他被指控的罪行导致35万人走上布鲁塞尔街头，这是这个小国历史上规模最大的一次公开游行，但仍然没有采取任何行动。\n在他的案件被揭露出极其无能的处理方式后，整个刑事司法和警察系统都进行了撼动和改革，但仍然没有任何行动。\n杜鲁克斯事件是比利时民族良知上的一道伤疤，这种伤疤一年比一年深。除了第二次世界大战之外，没有其他单一事件对这个国家的自我形象造成如此巨大的创伤和破坏。那为什么要推迟呢？\n杜鲁克斯曾是一名电工，他受到的指控再严重不过了。据说他绑架和虐待了6名年龄在8岁到19岁之间的女孩，并杀害了其中4人。他还被指控谋杀了一名同伙。\n但对许多人来说，更糟糕的是他的俘虏们似乎在最后几天表现出的虐待狂和纯粹的残忍。他指控的两名受害者-梅丽莎·鲁索(Melissa Russo)和朱莉·勒琼(Julie Lejeune)，都是8岁-在他地下室的金属笼子里的临时地牢里遭到性虐待和折磨。他们的身体后来在比利时南部他的后花园被发现。他们饿死了，而杜鲁克斯因偷窃在监狱里短暂服刑。\n另外两个女孩-17岁的安马尔查尔(An Marchal)和19岁的Eefje Lambrecks-也在他的监护下结束了生命，他们的腐烂身体在他的另一所房子里被发现。当时14岁的莱蒂夏·德尔赫兹(Latitia Delhez)现在是一名超市收银员，她和萨宾·达登(Sabine Dardenne)设法逃脱了生命，但再也不会是原来的样子了。\n在最近的一次采访中，德尔赫兹女士说，她感觉自己被当局抛弃了，被剥夺了支持，甚至被剥夺了针对前绑架者的案件的基本信息。但当局仍然犹豫不决。\n与此同时，住在阿隆监狱801号牢房、日夜受到监视的杜鲁克斯似乎在嘲笑他的受害者。本周，他已经不是第一次登上头版新闻，而且是出于各种错误的原因。\n一名比利时参议员与一名佛兰德记者勾结，给杜鲁克斯广播时间，这名记者伪装成这位政客的司机，偷偷溜进他的牢房进行了采访。\n这位参议员陷入了困境，记者可能会丢掉工作，普通公众再次受到六年甚至七年前发生的事件的创伤。外加零钱。\n达鲁克斯在争议中茁壮成长，但这场惨败确实有一个有用的目的-它提醒人们，如果他们需要的话，正义还没有得到伸张。它还暴露了一名男子在安全方面的严重缺陷，他被认为是比利时最危险的罪犯，许多政客正在呼吁国家元首担任司法部长。\n但是，达鲁克斯的案例充斥着拙劣和不可接受的无能，那么再犯一个错又有什么不同呢？在1996年最终被捕之前，警方认识他多年。他因强奸多名儿童而被判13年监禁，1991年在服刑3年半后获释。\n当他被释放时，他每月得到1400英镑的无效养老金。令人难以置信的是，当朱莉和梅丽莎蜷缩在他家地下室的笼子里时，警察也搜查了他的房子，但没有找到他们。他们听到尖叫声，但选择相信杜鲁克斯，杜鲁克斯告诉他们，一定是孩子们在外面玩耍。\n而且，雪上加霜的是，杜鲁克斯在1998年短暂越狱，嘲弄了警察，并引发了一波政府辞职浪潮。矛盾的是，由于对他提起诉讼所需的时间太长，他也接近获释，他的律师辩称，这一拖延违反了欧洲人权公约。\n当局只能通过对他未遂的逃亡企图定罪来绕过这个问题。而他最接近的一起法庭案件是他自己发起的-抗议他在监狱里的条件。那么，你可能会问，到底是怎么回事？\n受害者父母认为他们有一个答案--掩盖事实，许多比利时人也同意他们的观点。他们说，杜鲁克斯并不是单独行动的，而是包括警察和建制派高级成员在内的更广泛的恋童癖团伙的一部分。要不然为什么要推迟开庭审理呢？\n本周，杜鲁克斯本人也说了同样的话，尽管可能是出于他自己的原因。他告诉佛兰德电视台VTM，一个有各种犯罪活动的网络确实存在。但是当局不想调查这件事。毫无疑问，事情看起来确实很奇怪。\n最初的调查法官在与一名受害者的家人共进晚餐后被解职，几名检察官、警察和关键证人已经自杀。重要证据也消失了。\n所以也许杜鲁克斯受到了保护，不受高层的伤害。对于如此可耻的一连串事件，还能有什么其他解释呢？但有一件事是肯定的--盖伊·弗霍夫施塔特(Guy Verhofstadt)领导的当前改革派政府和比利时作为一个正常文明国家的声誉都岌岌可危。再拖延是不能接受的。", "note_en": "Belgium&#39;s most hated man, convicted paedophile Marc Dutroux, has been locked up for the last six years without trial. Andrew Osborn wonders why it is taking so long for justice to be done\n    Dutroux, Belgium&#39;s public enemy number one without equal, has been incarcerated since 1996 and yet still there is no trial date. It might be this year it might be next - who can say, officials shrug.\n His alleged crimes brought 350,000 people onto the streets of Brussels in 1996, the largest public march of its kind in this small country&#39;s history and yet still nothing has been done.\n  The entire criminal justice and police system have been shaken up and reformed in the wake of revelations about the hideously incompetent way in which his case has been handled and yet still there is no movement.\n The Dutroux affair is a scar on Belgium&#39;s national conscience which grows deeper each year. There is no other single event, bar the second world war, which has had such a traumatic and damaging effect to the country&#39;s self-image. So why the delay?\n The charge sheet against Dutroux, formerly an electrician, could not be more serious. He is said to have kidnapped and abused six girls aged between eight and 19 and killed four of them. He is also alleged to have murdered an accomplice.\n But what is worse for many is the sadism and sheer cruelty which appears to have characterised his captives&#39; last days. Two of his alleged victims - Melissa Russo and Julie Lejeune, both eight - were sexually abused and tortured in makeshift dungeons in metal cages in his basement. Their bodies were later found in his back garden in southern Belgium. They had starved to death while Dutroux did a short stint in jail for theft.\n Two other girls - An Marchal, 17 and Eefje Lambrecks, 19 - also met their end in his custody and their decomposed corpses were discovered in another of his houses. Laetitia Delhez, who was then 14 and is now a supermarket checkout girl, and Sabine Dardenne, managed to escape with their lives but will never be the same again.\n In a recent interview Ms Delhez said she felt abandoned by the authorities and deprived of support and even basic information about the case against her former captor. But still the authorities dither.\n Meanwhile Dutroux, who inhabits cell 801 in Arlon prison and is watched night and day, seems to be sneering at his victims. This week he was, not for the first time, front-page news and for all the wrong reasons.\n A Belgian senator connived with a Flemish journalist to give Dutroux airtime and the reporter, disguised as the politician&#39;s chauffeur, smuggled himself into his cell and conducted an interview.\n The senator is in hot water, the journalist may lose his job and the general public at large is once again traumatised by events which took place six or even seven years ago. Plus ça change.\n Dutroux thrives on controversy but the fiasco did serve one useful purpose - it reminded people, if they needed it, that justice has yet to be done. It also exposed serious shortcomings in security for a man who is supposed to be Belgium&#39;s most dangerous convict and many politicians are calling for the head of the country&#39;s justice minister.\n But the Dutroux case is littered with bungling and unacceptable incompetence, so what difference will one more cock-up make? He was known to the police for years before he was finally arrested in 1996. He had been released from prison in 1991 after serving three-and-a-half years of a 13-year sentence for multiple child rape.\n When he was set free he was given a GBP 1,400 a month invalid&#39;s pension. Unbelievably, police also searched his house when Julie and Melissa were cowering in cages in his basement but failed to find them. They heard screaming but chose to believe Dutroux, who told them it must have been children playing outside.\n And, to add insult to injury, Dutroux briefly escaped in 1998 making a mockery of the police and prompting a wave of government resignations. Paradoxically he has also come close to being released because of the length of time it has taken to mount a case against him, a delay which his lawyers argued breached the European convention on human rights.\n The authorities were only able to circumvent this problem by convicting him for his abortive escape bid. And the closest he has come to a court case is one he mounted himself - to protest against his conditions in prison. So what an earth, you may well ask, is going on?\n The victims&#39; parents think they have an answer - a cover-up and many Belgians agree with them. Dutroux was not acting alone, they say, but was part of a wider paedophile ring which included policemen and senior members of the establishment. Why else would there be such a delay in going to trial?\n This week Dutroux himself said as much although possibly for his own reasons. &#34;A network with all kinds of criminal activities really does exist,&#34; he told VTM, a Flemish TV station. &#34;But the authorities don&#39;t want to look into it.&#34; And there is no doubting that things do look odd.\n The original investigating magistrate was dismissed after sharing a meal with one of the victim&#39;s families and several prosecutors, policemen and crucial witness have committed suicide. Important evidence has also disappeared.\n So maybe Dutroux is being protected from on high. What other explanation can there be for such a disgraceful chain of events? But one thing is certain - the entire credibility of the current reformist government of Guy Verhofstadt and Belgium&#39;s very reputation as a normal civilised country is on the line. Further delay is unacceptable.", "posttime": "2020-10-29 19:23:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "饱受,haunted,警察", "title": "比利时仍饱受恋童癖丑闻困扰(2002年)", "title_en": "Belgium still haunted by paedophile scandal (2002)", "transed": 1, "url": "https://www.theguardian.com/world/2002/jan/25/worlddispatch.dutroux", "via": "", "real_tags": ["饱受", "haunted", "警察"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031972, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "是。如果您的Qt许可证是永久的，则您可以在维护到期后继续永久使用本产品。只有通过购买已停用的软件版本的延长维护合同，才能获得产品和技术支持。如果您选择不续订，请注意，Qt不保证支持通过永久许可证获得的软件版本。\n请注意，您需要订阅许可证才能访问Qt 6。", "note_en": "Yes. If your  Qt licenses are perpetual, you may continue to use the product in perpetuity after your maintenance expires.  Access to product and technical support will only be available via the purchase of an Extended Maintenance Contract for software releases that are end-of-life. If you opt not to renew, please note that Qt will not guarantee to support software versions acquired with a perpetual license.\n Please note, you will need a subscription license to access Qt 6.", "posttime": "2020-10-29 18:57:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "订阅,license,获得", "title": "您需要订阅许可证才能访问Qt 6(非LPGL)", "title_en": "  You will need a subscription license to access Qt 6 (non-LPGL)", "transed": 1, "url": "https://www.qt.io/faq/what-happens-to-my-perpetual-licenses-once-i-convert-to-subscription", "via": "", "real_tags": ["订阅", "license", "获得"]}, {"category": "", "categoryclass": "", "imagename": "ad5a37a7605f3e478cd31eef952d9520.jpg", "infoid": 1031971, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "9月，阿塞拜疆和亚美尼亚再次就高加索山区有争议的纳戈尔诺-卡拉巴赫地区发生战斗。到那时，该地区的信息战已经进行了几个月。\n这场战役是使用为美国特种作战司令部(SOCOM)开发的人工智能技术来识别的，SOCOM负责监督美国特种部队的行动。\n人工智能系统来自专注于情报行业的Primer公司，通过分析数千个公共新闻来源确定了信息运动中的关键主题。在实践中，Primer的系统也可以分析机密信息。这份由连线编撰的分析报告显示，俄罗斯新闻媒体是如何在7月份开始推动一种旨在支持其盟友亚美尼亚、削弱其敌人阿塞拜疆的叙事。\n雷蒙德·托马斯(Raymond Thomas)是一名退役将军，曾领导SOCOM，现在是Primer董事会成员，他说国防部面临着大量信息和错误信息。他说：“为了跟上步伐，你不可能在一群人阅读的情况下做到这一点。”“这必须是机器支持的。”\nPrimer本月早些时候表示，它已经赢得了一份“数百万美元”的合同，为SOCOM和美国空军开发其技术的一个版本。这项技术利用自然语言处理的最新进展来识别文档中的人物、地点和事件，并将这些信息串在一起以揭示趋势。\n国防和情报行业需要分析大量的非机密信息，如社交媒体和机密报告，从而为Primer、Splunk、RedHorse和Strategic Analysis等公司创造机会。这越来越多地涉及到从不同形式的数据(如语音记录和图像以及文本)中提取洞察力。\nPrimer的投资者包括美国中央情报局(CIA)支持的风险投资公司In-Q-tel，该公司也为上月上市的Palantir提供了资金。Palantir开始提供收集和可视化不同类型信息的工具，如手机记录和互联网流量。它现在还提供了使用人工智能来解析和组织文本的技术。\n最近机器对语言理解的飞跃，通过向大型机器学习模型提供大量的文本训练数据，可能会对智能和商业产生重大影响。Primer专注于情报行业，但它之前赢得了一份向沃尔玛提供技术的合同，用于识别购买趋势和供应链问题。\nPrimer对俄罗斯信息运动的分析提供了一个简单的例子，说明人工智能如何帮助组织信息和识别错误信息。将阿塞拜疆和土耳其描绘成纳戈尔诺-卡拉巴赫的侵略者的努力，可能提供了紧张局势升级的早期预警信号，或者是俄罗斯试图挑起麻烦的迹象。这份报告将来自3000多个文件的985起事件归结为13个关键事件。人类分析员需要几个小时才能完成分析，但Primer系统在大约10分钟内就完成了。这项技术可以使用几种语言，包括俄语、汉语和英语。\n报道称，到8月中旬，俄罗斯媒体发布了越来越多的报道，声称阿塞拜疆的盟友土耳其正在向亚美尼亚增兵；其他新闻来源没有提到集结，表明这可能是一场协调一致的信息行动的一部分。退役将军兼Primer董事会成员托马斯表示：“能够整理所有这些信息和错误信息，以便做出决策，这是非常关键的。”\n新美国安全中心(Center For New American Security)高级研究员、前中央情报局(CIA)情报分析师马丁·拉塞尔(Martin Jn Rasser)表示，Primer的技术表明，人工智能最近的进步可以提供军事优势。他表示，SOCOM需要快速处理大量情报信息，而且它在使用技术时往往具有前瞻性。SOCOM拒绝置评。\n围绕人工智能用于国防的炒作很多，但Rasser表示，公司现在正在为美国情报行业带来有价值的解决方案。“我们现在已经过了蛇油阶段，”他说。在研究了关于俄罗斯信息运动的报告后，他说，这项技术似乎是尖端的。“他们似乎有相当复杂的自然语言能力，”他说。\nPrimer的技术确实建立在用于自然语言处理的机器学习的最新进展之上。在一篇博客文章中，该公司概述了它如何定制机器学习模型，向大量非结构化文本数据馈送，以创建一个能够准确地对文档中的姓名、地点和组织进行正确分类的系统。这很棘手，因为实体可能用不同的方式表示-例如，作为“巴黎”或“法国首都”。\n布鲁金斯学会专门研究人工智能的研究员克里斯·梅塞罗尔(Chris Meserole)表示，Primer的技术是分析师未来如何与人工智能系统合作的一个很好的例子。“从可以理解一切的人工智能的意义上说，这并不是令人兴奋的，但他们正在做的是一项艰巨的技术挑战。”这是一项令人印象深刻的技术，“他说。\n人工智能可能越来越多地被视为军事和情报机构的竞争优势，因为快速增长的信息源以及更复杂的信息运动。据估计，1995年至2016年间，分析师需要阅读的情报量增长了10倍。“随着时间的推移，它只会继续呈指数级增长，你只能线性地增加人力，”梅塞罗尔说。\n他补充说，Primer的方法可能会扩展到军事情报以外的用途。他表示：“无论是情报部门还是”财富“500强公司，(该公司的主张是)以一种人类团队可以管理的方式组织所有数据。”\n🏃🏽‍♀️想要最好的健康工具吗？看看我们Gear团队挑选的最好的健身跟踪器、跑步装备(包括鞋子和袜子)和最好的耳机", "note_en": "In September, Azerbaijan and Armenia  renewed fighting over  Nagorno-Karabakh, a disputed territory in the Caucasus mountains. By then, an information warfare campaign over the region had been underway for several months.\n The campaign was identified using  artificial intelligence technology being developed for  US Special Operations Command (SOCOM), which oversees US special forces operations.\n The AI system, from  Primer, a company focused on the intelligence industry, identified key themes in the information campaign by analyzing thousands of public news sources. In practice, Primer’s system can analyze classified information too. The analysis, compiled for WIRED, shows how Russian news outlets began pushing a narrative in July designed to bolster its ally Armenia and undermine its enemy Azerbaijan.\n  Raymond Thomas, a retired general who previously led SOCOM and now sits on Primer’s board, says the Department of Defense faces a torrent of information as well misinformation. “To keep pace, you&#39;re not going to do it with a bunch of people reading,” he says. “This has to be machine-enabled.”\n Primer said earlier this month it had won a “multimillion dollar” contract to develop a version of its technology for SOCOM as well as the US Air Force. The technology uses recent advances in  natural language processing to identify people, places, and events in documents, and to string this information together to reveal trends.\n  The defense and intelligence industries need to analyze an avalanche of unclassified information such as social media along with classified reports, creating opportunities for companies like Primer, Splunk,  Redhorse, and  Strategic Analysis. This increasingly involves drawing insights from different forms of data such as voice recordings and images as well as text.\n Primer’s investors include In-Q-Tel, the CIA-backed venture capital firm that also funded  Palantir, which went public last month. Palantir started out offering tools for collecting and visualizing different types of information, such as cell phone records and internet traffic. It also now offers technology that uses AI to parse and organize text.\n  Recent  leaps in machine understanding of language, enabled by feeding large machine-learning models huge amounts of text training data, could have a big impact on intelligence as well as business. Primer is focused on the intelligence industry, but it previously won a contract to  supply its technology to Walmart, for identifying buying trends and supply chain issues.\n  Primer’s analysis of the Russian information campaign offers a simple example of how AI can both help organize information and identify misinformation. The effort to portray Azerbaijan and Turkey as aggressors in Nagorno-Karabakh may have provided an early warning sign of escalating tensions, or an indicator of Russia trying to stir up trouble. The report boiled down 985 incidents from over 3,000 documents to 13 key events. A human analyst would have needed several hours to perform the analysis, but the Primer system did it in roughly 10 minutes. The technology works across several languages, including Russian and Chinese as well as English.\n By mid-August, according to the report, the Russian outlets were publishing an increasing number of stories claiming that Turkey, an ally of Azerbaijan, was pouring troops into Armenia; other news sources made no mention of the build-up, suggesting it may have been part of a concerted information campaign. “The ability to sort through all that information and misinformation, to enable decisionmaking, that’s exceptionally critical,” says Thomas, the retired general and Primer board member.\n Martijn Rasser, senior fellow at the Center for New American Security and a former CIA intelligence analyst, says Primer’s technology shows how recent advances in AI could provide a military advantage. SOCOM needs to handle large amounts of intelligence information quickly, and it tends to be forward-thinking in its use of technology, he says. SOCOM declined to comment.\n  There’s been plenty of hype around AI for defense, but Rasser says companies are now bringing valuable solutions to the US intelligence industry. “We’re past the snake oil phase now,” he says. After examining the report on the Russian information campaign, he says the technology appears to be cutting-edge. “They seem to have pretty sophisticated natural language capabilities,” he says.\n Primer’s technology is indeed built on recent progress in machine learning for natural language processing. In a  blog post, the company outlines how it has customized a machine learning model fed huge quantities of unstructured text data to create a system capable of correctly classifying names, places, and organizations in documents with record accuracy. This is tricky because entities may be presented in different ways—for example, as either “Paris” or “the capital of France.”\n  Chris Meserole, a fellow at the Brookings Institution who specializes in artificial intelligence, says Primer’s technology is a good example of how analysts will work together with AI systems in the future. “It&#39;s not mind-blowing—in the sense of an AI that can understand everything—but what they’re doing is a tough technical challenge. It’s impressive tech,” he says.\n AI may increasingly be seen as a competitive advantage for military and intelligence agencies due to rapidly growing information sources as well as more sophisticated information campaigns. By  one estimate, the amount of intelligence that analysts need to read grew 10-fold between 1995 and 2016. “It&#39;s just going to continue to grow exponentially over time, and you can only add manpower linearly,” Meserole says.\n He adds that Primer’s approach may extend to uses beyond military intelligence. “Whether it&#39;s intelligence services or Fortune 500 companies, [the company’s proposition is] to structure all that data in a way that is manageable by a human team,” he says.\n   🏃🏽‍♀️ Want the best tools to get healthy? Check out our Gear team’s picks for the  best fitness trackers,  running gear (including  shoes and  socks), and  best headphones", "posttime": "2020-10-29 18:34:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,识别,war,primer", "title": "Primer的人工智能技术帮助情报行业分析数以千计的公共新闻来源并识别信息战战役", "title_en": "A profile of Primer, whose AI tech helps the intelligence industry analyze thousands of public news sources and identify information war campaigns", "transed": 1, "url": "https://www.wired.com/story/ai-helping-pentagon-assess-disinfo-campaigns", "via": "", "real_tags": ["人工智能", "识别", "war", "primer"]}, {"category": "", "categoryclass": "", "imagename": "4d2b600d2de85507ff91c336b79c432a.png", "infoid": 1031970, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在本文中，我想探索一种有趣的模式，我越来越多地在JavaScript代码中看到这种模式，它允许您从一个函数返回多个值。\n您可能已经知道JavaScript本身并不支持多个返回值，因此本文实际上将探索一些“模拟”这种行为的方法。\n我最近看到的这种模式最著名的用法之一是在Reaction Hooks中，但是在深入研究它之前，让我们通过在其他语言中探索这个概念来看看我所说的“多个返回值”是什么意思。\n我想到的两种本机支持多个返回值的语言是Lua和Go。让我们实现一个简单的整数除法函数，它同时返回商和余数。\n让我们从一个简单的Lua实现开始。绝对值得一提的是，Lua的官方文档将多个返回值定义为“一种非常规但相当方便的特性”：\n函数intDiv(被除数，除数)局部商=数学。下限(被除数/除数)局部余数=被除数%除数返回商，余数结束打印(intDiv(10，3))--3 1。\nPackage main import&#34；fmt&#34；func intDiv(被除数，除数int)(int，int){商：=被除数/除数余数：=被除数%除数返回商，剩余数}func main(){fmt。Println(intDiv(10，3))//3 1}。\n正如您在这两个代码片段中看到的，函数可以返回一个以上的值，这在逻辑上使您在一次计算中产生多个输出的情况下非常方便。\n注意：围棋中更实际的实现是考虑错误(例如除以0)，并添加额外的返回值来传播潜在的错误。出于本文的目的，我们不应该太担心这一点，但绝对值得一提的是，Go中的多个返回值在错误传播和错误处理方面大放异彩。我们将在本文后面更多地讨论这一点，以了解如何将此思想应用于JavaScript，特别是在异步/等待的上下文中。\n因此，正如我们前面所说的，JavaScript本身并不支持从函数返回多个值的语法。我们可以通过使用复合值(如数组或对象)来解决此限制。\nIntDiv=(被除数，除数)=&gt；{常商=数学。下限(被除数/除数)恒定余数=被除数%除数返回[商，余数]}控制台。Log(intDiv(10，3))//[3，1]。\n这里我们只是打印除法的结果，但是让我们假设我们想要分别处理两个返回值，我们如何引用它们呢？\n返回值是一个数组，因此我们可以使用索引0和1简单地访问数组中的两个元素：\n常量结果=intDiv(10，3)常量商=结果[0]常量余数=结果[1]控制台。Log(`商=${商}`)//商=3console。Log(`剩余数=${剩余数}`)//剩余数=1。\n这个语法可以说是冗长的，绝对不是很优雅。值得庆幸的是，ES2015阵列解构任务可以在这方面为我们提供帮助：\nConst[商，余数]=intDiv(10，3)控制台。Log(`商=${商}`)//商=3console。Log(`剩余数=${剩余数}`)//剩余数=1\n这本书读起来好多了，我们还删减了2行和3行代码，大赢了！\n尽管该实现很好，但它有一个重要的缺点：返回值是位置的，因此在解构时需要小心并尊重顺序。\nIntDiv=(被除数，除数)=&gt；{常商=数学。下限(被除数/除数)恒定余数=被除数%除数返回{商，余数}}。\n请注意，这里我们使用的是ES2015(增强的对象文字语法)中的另一个语法糖，它允许我们非常简洁地定义对象。在ES2015之前，我们会将返回语句定义为{Quotient：Qutient，Rembers：Rembers}。\n常量结果=intDiv(10，3)常量商数=结果商常数余数=结果.剩余控制台。Log(`商=${商}`)//商=3console。Log(`剩余数=${剩余数}`)//剩余数=1。\n再说一次，这有点太冗长了，ES2015还有另一个奇妙的语法糖可以让它变得更好：\nConst{商，余数}=intDiv(10，3)控制台。Log(`商=${商}`)//商=3console。Log(`剩余数=${剩余数}`)//剩余数=1。\n这种语法糖称为对象析构赋值(Object Destructing Assignment)。使用这种方法，我们现在独立于返回值的位置(我们可以互换商和余数的位置，而不会产生副作用)。此语法还允许您重命名非结构化变量，这对于避免与其他局部变量的名称冲突非常有用，或者只是根据我们的需要使变量名更短或更具描述性。让我们看看这是如何工作的：\nConst{余数：R，商：Q}=intDiv(10，3)控制台。Log(`商数=${q}`)//商数=3console。Log(`剩余数=${r}`)//剩余数=1。\n在这里，我们不依赖于值的位置，而依赖于它们在返回对象中的名称。如果您正在设计一个具有多个返回值的API，那么您可以自己找出哪种折衷方案是保证正确的开发体验的最佳选择。\n好了，现在您应该对如何在JavaScript中模拟多个返回值有了很好的了解。在下一节中，我们将看到一些利用此模式的更实际的示例。\n正如前面提到的，该技术最近通过Reaction钩子得到了普及，因此我们将首先探讨这个用例。稍后，我们将看到与异步/等待相关的另外两个案例。\nReact钩子是React v16.7.0-alpha提供的一个新特性建议，它允许您使用状态和其他Reaction特性，而无需编写类。\n让我们通过一个示例来看看它是如何工作的，让我们构建一个CSS颜色查看器组件。\n从&#39；react&#39；function CssColorViewer(){const[cssColor，setCssColor]=useState(&#39；Blue&#39；)//&lt；--多个返回值const onCssColorChange=e=&gt；{setCssColor(e.target.value)}return(&lt；div&gt；&lt；input value={cssColor}onChange={onCssColorChange}/&gt；&lt；Div样式={{宽度：100，高度：100，背景：cssColor，}}/&gt；&lt；/div&gt；)}。\n出于本文的目的，我们将只关注useState调用，但是如果您想更好地了解钩子本身在内部是如何工作的，我强烈建议您阅读官方的State Hook文档。我个人很想了解多个useState调用如何维护与特定状态属性的关系(因为没有显式的标签或引用)。如果您对此也很好奇，那么您应该阅读Hooks常见问题解答和Dan Abramov最近关于Hooks的文章。\nUseState挂钩的作用类似于工厂：给定state属性的默认值(在我们的示例中为Blue)，它将需要为您实例化两件事：\nReaction开发人员决定通过用一个数组模拟多个返回值来处理这一需求。\n将其与数组解构和适当的变量命名相结合，结果是一个非常易于阅读和使用的API。\n此Reaction功能仍处于非常实验性的阶段，在撰写本文时可能会进行更改，但是对于Reaction社区来说，让代码更具表现力并降低进入门槛以开始采用React听起来已经是件大事了。\n我想指出的一点是，在这种特定情况下，多返回值模式在实现这一目标方面发挥了重要作用。\n最近，在尝试将面向回调的API转换为等效的异步/等待API时，我发现了多返回值模式的另一个很好的用例。\n为了弄清楚这一部分，我将非常快速地解释我用来将基于回调的API转换为可以与异步/等待一起使用的函数的一种方法。\n函数doSomething(输入，回调){//...。异步执行某些操作并//计算响应或错误//完成后，调用回调：callback(error，response)}\n要将此函数转换为可与异步/等待一起使用的功能，我们必须从本质上简化它。有一些库可以做到这一点，如果您使用的是Node.js，您甚至可以使用内置的util.promisify，但这是我们自己可以做的事情，只需创建一个包装器函数，如下所示：\nConst doSomethingPromise=(Input)=&gt；new((Resolve，Reject)=&gt；{DoSomething(Input，(Error Response)=&gt；{if(Error){Return Reject(Error)}Return Resolve(Response)})})。\n简而言之，我们的包装函数doSomethingPromise立即返回承诺。在承诺的主体内，我们使用一个回调调用原始的DoSomething函数，该回调将根据是否存在错误来解决或拒绝承诺。\n注意：这将在出错的情况下抛出，因此请确保将其放在try/catch块中以正确处理错误。\n如果您对缩短基于回调的函数感兴趣，我有一整篇文章专门介绍这个主题。\n在我的特定用例中，我使用的是遵循以下约定的Twitter客户端库：\n//Client是Twitter ClientClient的实例。GET(&#39；Status/USER_TIMELINE&#39；，params，函数回调(错误，推文，响应){IF(！Error){控制台。日志(推文)}})。\n这里重要的细节是回调函数有点非常规，因为它接收3个参数：可能的错误、tweet列表和响应(表示原始HTTP响应对象)。传统的回调风格的API将只向回调函数发送两个参数：潜在错误和某种结果对象。\nConst getUserTimeline=(客户端，参数)=&gt；new((解析，拒绝)=&gt；{客户端。GET(&#39；status/user_timeline&#39；，params，(error，twets，response)=&gt；{if(Error){return reject(Error)}return Resolve([twets，response])//多个返回值})。\n//在异步函数内//...。设置`client`和`params`const[twets，response]=await getUserTimeline(client，params)。\n简单地说，我们也可以使用多返回值模式，并承诺允许将它们解析为多个值。此技术为我们提供了非常好的界面，特别是在与异步/等待结合使用时。\n我越来越多地在JavaScript中看到的另一个密切相关的模式是错误传播和处理。\n在GO中，当函数可能产生错误时，该错误不会被抛出，而只是由函数返回。如果函数必须返回一些输出，并且还可能生成错误，则函数将有多个返回值(Output和Error)。\n理想情况下，调用方代码应在继续操作之前验证返回的错误值是否为实际错误，如下面的GO代码示例所示：\n一些JavaScript库开始推广与Go中相同的约定来报告错误，特别是在异步/等待方面。\n让我们重写前面示例中的getUserTimeline函数，以遵循此方法：\nConst getUserTimeline=(客户端，参数)=&gt；new((解析，拒绝)=&gt；{客户端。GET(&#39；status/user_timeline&#39；，params，(error，twets，response)=&gt；{Return Resolve([error，twets，response])//多个返回值})})。\n请注意，我们从未告诉承诺拒绝，所以当我们将此函数与异步/等待一起使用时，我们不能使用try/catch来处理错误。我们应该这样做：\n//在异步函数内//...。Set`client`and`params`const[error，twets，response]=await getUserTimeline(client，params)if(Error){//此处处理错误}//...。用`tweets`和`Response`做一些事情。\n我不确定我是否会在JavaScript领域推荐此模式。我对此有一点复杂的感觉。一方面，我相当喜欢它，因为正如Go中发生的那样，它迫使您单独处理每个错误，这会让您更仔细地考虑处理错误细节的最佳方式。另一方面，这个模式仍然让人感觉有点被强加到JavaScript中，那些从未在其他语言中看到过这个模式的人可能会觉得它很烦人，甚至很难理解。此外，如果您不捕获和处理错误，这将不会自动升级(就像抛出或拒绝承诺时发生的那样)，因此错误将完全被运行时吞噬，从而导致应用程序状态中潜在的不一致。我会让您对此得出您自己的结论！😇。\n现在，我想向您展示一些可以用于数组解构的“小技巧”，它们在处理多个返回值时可能会派上用场。\n例如，假设您有一个函数doStuff，它使用一个数组返回多个值，数组中的值是error、rawResponse和result。假设您对使用rawResponse不感兴趣，仅出于本例的原因，您可以在使用以下语法解构时轻松跳过该元素：\n请注意那里的双逗号。这基本上意味着我们没有分配数组索引。您可以随意弯曲此技术，例如，您可能决定仅变形结果：\n另一个有趣的把戏是你可以用特殊的..。语法将剩余的返回值累加到单个变量下。让我们举一个虚拟的例子来探讨这个想法。\n假设我们有一个名为listDog的函数，它的实现如下所示：\n数组的第一个元素是狗的数量，而其他每个元素都是实际的狗的名字。\n因为这里返回的元素数量是可变的，所以直接使用析构可能很棘手。在这些情况下，我们可以使用此特殊语法：\n那个..。语法基本上允许您将数组的任何剩余元素分解到另一个数组中。当然你只能有一个..。元素，并且该元素必须是列表中的最后一个元素。\n我这里的示例非常虚假，但是这个模式在一些真实的用例中非常有用，例如，当您想要从正则表达式匹配中解压缩值时。\n当Reaction钩子出现时，社区对这一新功能非常兴奋，但Google Chrome团队的一些性能专家(@bmeurer、@_developit和@rossmcilroy)都表示惊讶，想要更深入地挖掘，看看这种新方法是否会在网络上导致严重的性能问题。\n他们的研究发表了一篇令人惊叹的论文，标题是“多值返回的数组析构(根据Reaction钩子)”。\n我真的鼓励你阅读它，以获得所有的细节，但这里我试图给你一些TLDR；\n在Reaction组件中，Render()方法经常被调用，因此那里的代码应该优化到不会减慢速度。这就是你使用反应钩子的地方。\n数组解构是一种非常通用的API，它不仅适用于数组，而且适用于每种类型的可迭代对象，因此VM有很多工作要做才能弄清楚如何遍历和解析特定对象。\n对象析构可能是一种性能更好的替代方案，但它可能会给开发人员带来不太愉快的体验。\n如果您在松散模式下使用Babel，则数组解构将得到高度简化(以直接访问元素)，并将产生高度优化的代码。\n即使您没有使用Babel，仍在继续研究Google的V8引擎中的优化编译器的不同阶段是否能够优化解构。\n在本文中，我们讨论了这种新出现的JavaScript模式，它越来越受欢迎，这主要是因为它在Reaction中被采用。\n不过，用例并不局限于RESPECT，我希望您会发现这在您的日常开发生活中也是在RESPECT领域之外有用的。\n我真的很好奇您会想出什么，所以请使用Twitter或本文中的评论与我保持联系。\n对于非常好奇的问题，我想给您最后一个链接，这样您就可以比较多个返回值是如何在许多其他语言中实现的。", "note_en": "In this article, I want to explore an interesting pattern that I am seeing more and more in JavaScript code which allows you to return multiple values from a function.\n You probably know already that JavaScript does not support multiple return values natively, so this article will actually explore some ways to “simulate” this behavior.\n One of the most famous usages of this pattern I have seen recently is within  React Hooks, but before delving into that, let’s see what I mean with “multiple return values” by exploring this concept in other languages.\n  Two languages that come to my mind which natively support multiple return values are Lua and Go. Let’s implement a simple  integer division function that returns both the  quotient and the  remainder.\n  Let’s start with a simple implementation in Lua. It’s definitely worth mentioning that  Lua’s official documentation defines multiple return values as  “An unconventional, but quite convenient feature”:\n function  intDiv  (dividend , divisor )  local quotient  = math . floor (dividend  / divisor )  local remainder  = dividend  % divisor  return quotient , remainder end print ( intDiv ( 10 , 3 ) )  -- 3\t1\n   package main import  &#34;fmt&#34; func  intDiv (dividend , divisor  int )  ( int ,  int )  { quotient  := dividend  / divisor remainder  := dividend  % divisor  return quotient , remainder } func  main ( )  { fmt . Println ( intDiv ( 10 , 3 ) )  // 3 1 }\n As you can see in these 2 code snippets, functions can return more than 1 value and this can be very convenient in cases where you logically have produce multiple outputs in a computation.\n Note: a more realistic implementation in Go, would take into account errors (e.g. division by 0) and add an extra return value to propagate potential errors. We shouldn’t worry too much about this for the sake of this article, but it is definitely worth mentioning that multiple return values in Go shine when it comes to error propagation and error handling. We will touch a bit more on this later in this article to see how this idea can be applied to JavaScript as well, especially in the context of Async/Await.\n  So, as we said early on, JavaScript does not natively support a syntax to return more than one value from a function. We can workaround this limitation by using  composite values like arrays or objects.\n   intDiv  =  ( dividend , divisor )  =&gt;  {  const quotient  = Math . floor (dividend  / divisor )  const remainder  = dividend  % divisor  return  [quotient , remainder ] }console . log ( intDiv ( 10 ,  3 ) )  // [ 3, 1 ]\n Here we are just printing the result of a division, but let’s assume we want to handle the two return values individually, how do we  reference those?\n Well, the return value is an array so we can simply access the two elements in the array using the indices  0 and  1:\n const result  =  intDiv ( 10 ,  3 ) const quotient  = result [ 0 ] const remainder  = result [ 1 ]console . log (  ` Quotient =   ${quotient } ` )  // Quotient = 3console . log (  ` Remainder =   ${remainder } ` )  // Remainder = 1\n This syntax is arguably verbose and definitely not very elegant. Thankfully,  ES2015 array destructuring assignment can help us here:\n const  [quotient , remainder ]  =  intDiv ( 10 ,  3 )console . log (  ` Quotient =   ${quotient } ` )  // Quotient = 3console . log (  ` Remainder =   ${remainder } ` )  // Remainder = 1\n This is much nicer to read and we also trimmed away 2 out 3 lines of code, big win!\n As nice as it is, this implementation has an important shortcoming: return values are positional, so you need to be careful and respect the order while destructuring.\n   intDiv  =  ( dividend , divisor )  =&gt;  {  const quotient  = Math . floor (dividend  / divisor )  const remainder  = dividend  % divisor  return  { quotient , remainder  } }\n Note that here we are using another syntactic sugar from ES2015 (Enhanced object literal syntax) that allows us to define objects very concisely. Prior to ES2015, we would have defined the return statement as  {quotient: quotient, remainder: remainder}.\n  const result  =  intDiv ( 10 ,  3 ) const quotient  = result .quotient const remainder  = result .remainderconsole . log (  ` Quotient =   ${quotient } ` )  // Quotient = 3console . log (  ` Remainder =   ${remainder } ` )  // Remainder = 1\n Again, this is a bit too verbose and ES2015 has another fantastic syntactic sugar to make this nicer:\n const  { quotient , remainder  }  =  intDiv ( 10 ,  3 )console . log (  ` Quotient =   ${quotient } ` )  // Quotient = 3console . log (  ` Remainder =   ${remainder } ` )  // Remainder = 1\n This syntactic sugar is called  Object Destructuring Assignment. With this approach we are now independent from the position of return values (we can swap the position of  quotient and  remainder without side effects). This syntax also lets you rename the destructured variables, which can very useful to avoid name collisions with other local variables, or just to make variable names shorter or more descriptive as we please. Let’s see how this works:\n const  { remainder : r , quotient : q  }  =  intDiv ( 10 ,  3 )console . log (  ` Quotient =   ${q } ` )  // Quotient = 3console . log (  ` Remainder =   ${r } ` )  // Remainder = 1\n Here we are not dependent by values position, but by their names in the returned object. If you are designing an API with multiple return values, it’s up to you to figure out which trade off will be the best to guarantee a proper developer experience.\n Ok, now you should have a good idea on how to simulate multiple return values in JavaScript. In the next section we will see some more realistic examples that take advantage of this pattern.\n  As mentioned early on, this technique has been recently popularized by React hooks, so we are gonna explore this use case first. Later we will see other two cases related to Async/Await.\n  React hooks are a  new feature proposal available from  React v16.7.0-alpha that lets you use state and other React features without having to write a class.\n  Let’s see how it works with an example, let’s build a CSS color viewer component.\n    import  { useState  }  from  &#39;react&#39; function  CssColorViewer ( )  {  const  [cssColor , setCssColor ]  =  useState ( &#39;Blue&#39; )  // &lt;-- multiple return values  const  onCssColorChange  =  e  =&gt;  {  setCssColor (e .target .value )  }  return  (  &lt;div &gt;  &lt;input value = {cssColor } onChange = {onCssColorChange }  / &gt;  &lt;div style = { { width :  100 , height :  100 , background : cssColor ,  } }  / &gt;  &lt; /div &gt;  ) }\n  For the sake of this article, we are going to focus only on the  useState call, but if you are curious to understand better how the hook itself works internally I really recommend you read the  official State Hook documentation. I was personally curious to understand how multiple  useState calls could maintain the relationship with the specific state attribute (since there’s no explicit labelling or reference). If you are curious about that too, well you should read the  Hooks FAQ and  Dan Abramov’s recent article about Hooks.\n  The  useState hook acts like a factory: given a default value for the state property ( &#39;Blue&#39; in our case), it will need to instantiate for you 2 things:\n  React developers decided to handle this requirement by simulating multiple return values with an array.\n Combining this with array destructuring and proper variable naming, the result is an API that is very nice to read and to use.\n This React feature is still very experimental and subject to change at the time of writing, but it already sounds like a big deal for the React community to make the code more expressive and reduce the barrier to entry to start adopting React.\n The point I want to make is that, in this specific case, the multiple return values pattern plays a big role towards this goal.\n  Recently I found another great use case for the multiple return values pattern while trying to convert a callback oriented API into an equivalent Async/Await API.\n To make this part clear, I am going to explain very quickly an approach I use to convert callback based APIs into functions that I can use with Async/Await.\n  function  doSomething ( input , callback )  {  // ... do something asynchronously and  // compute response or error  // When finished, invoke the callback:  callback (error , response ) }\n To convert this function into something that can be used with Async/Await we have to essentially   promisify it. There are libraries to do it and, if you are using Node.js you can even use the builtin   util.promisify, but that’s something we can do ourselves by just creating a  wrapper function like the following one:\n const  doSomethingPromise  =  ( input )  =&gt;  new   ( ( resolve , reject )  =&gt;  {  doSomething (input ,  ( error response )  =&gt;  {  if  (error )  {  return  reject (error )  }  return  resolve (response )  } ) } )\n In short, our wrapper function  doSomethingPromise is immediately returning a  Promise. Inside the body of the promise we are invoking the original  doSomething function with a callback that will be resolving or rejecting the promise based on whether there’s an  error or not.\n   Note: this will throw in case of error, so make sure you have it in a  try/catch block to handle the error correctly.\n If you are curious about  promisifying callback-based functions, I have  an entire article dedicated to this topic.\n In my specific use case, I was using a  twitter client library that follows this conventions:\n // client is an instance of the twitter clientclient . get ( &#39;statuses/user_timeline&#39; , params ,  function  callback (  error , tweets , response )  {  if  ( !error )  { console . log (tweets )  } } )\n The important detail here is that the  callback function is a bit unconventional because it receives 3 parameters: a possible  error, a list of  tweets and a  response (which represents the raw HTTP response object). Conventional callback-style APIs will send only two parameters to the callback function: a potential error and some sort of result object.\n   const  getUserTimeline  =  ( client , params )  =&gt;  new   ( ( resolve , reject )  =&gt;  { client . get ( &#39;statuses/user_timeline&#39; , params ,  ( error , tweets , response )  =&gt;  {  if  (error )  {  return  reject (error )  }  return  resolve ( [tweets , response ] )  // multiple return values  } )  } )\n  // inside an async function // ... set `client` and `params` const  [tweets , response ]  =  await  getUserTimeline (client , params )\n  To recap, we can use the multiple return values pattern also with promises to allow them to be resolved to multiple values. This technique gives us a very nice interface especially when used in combination with Async/Await.\n  Another closely related pattern I am seeing more and more in JavaScript is error propagation and handling  à la Go.\n In Go, when a function can generate an error, this error is not thrown but simply returned by the function. If the function has to return some output and can also generate errors, then the function will have multiple return values (output and error).\n The caller code, should ideally verify if the returned error value is an actual error before proceeding, as in the following Go code example:\n  Some JavaScript libraries are starting to promote the same conventions as in Go to report errors, especially when it comes to Async/Await.\n  Let’s rewrite our  getUserTimeline function from our previous example to follow this approach:\n const  getUserTimeline  =  ( client , params )  =&gt;  new   ( ( resolve , reject )  =&gt;  { client . get ( &#39;statuses/user_timeline&#39; , params ,  ( error , tweets , response )  =&gt;  {  return  resolve ( [error , tweets , response ] )  // multiple return values  } )  } )\n Notice that we are never telling the promise to  reject, so when we will be using this function with Async/Await we cannot use try/catch to handle errors. This is what we should do instead:\n // inside an async function // ... set `client` and `params` const  [error , tweets , response ]  =  await  getUserTimeline (client , params ) if  (error )  {  // handle error here } // ... do stuff with `tweets` and `response`\n I am not sure if I would recommend this pattern or not in JavaScript land. I have a bit of mixed feelings about it. On one side I quite like it, because as happens in Go, it forces you to handle every single error individually, which makes you think a bit more carefully about the best way to handle the specifics of the error. On the other hand, this pattern it still feels a bit forced into JavaScript and people that never saw this pattern in other languages might find it annoying or even hard to understand. Moreover, if you don’t capture and handle an error this will not automatically escalate (as it happens with  throw or rejected promises), so the error will totally be swallowed by the runtime, leading to potential inconsistencies in your app state.I’ll let you draw your own conclusions on this one! 😇\n  At this point, I would like to show you few  “little tricks” that you can use with array destructuring that might come in handy when dealing with multiple return values.\n  Let’s say, for instance, that you have a function  doStuff that returns multiple values using an array and the values are in the array are an  error, a  rawResponse and  result. Let’s say only for the sake of this example that you are not interested in using the  rawResponse, you could easily skip that element while destructuring with the following syntax:\n  Notice the double comma there. That basically means that we are leaving an array index unassigned. You can bend this technique as you please, for example you might decide to destructure only the  result:\n    Another interesting trick is that you can use the special  ... syntax to accumulate the  remaining return values under a single variable. Let’s make a dummy example to explore this idea.\n Let’s say we have a function called  listDogs which is implemented as follows:\n  The first element of the array is the number of dogs, while every other elements are actual dog names.\n Since the number of returned elements here is variable it might be tricky to use destructuring directly. In these cases we can use this special syntax:\n  The  ... syntax basically allows you to destructure any remaining element of the array into another array. Of course you can only have a  ... element in the left hand side of the destructuring expression and this has to be the last element in the list.\n My example here is very dummy, but this pattern really shines in some real life use cases, for example when you want to  unpack values from a regular expression match.\n  When React hooks were presented the community was super excited about this new feature, but some performance experts in the Google chromium team ( @bmeurer,  @_developit and  @rossmcilroy) raised their eyebrows and wanted to dig deeper to see if this new approach could lead to serious performance issues in the web.\n What came out from their research is an amazing paper that goes by the title  “Array destructuring for multi-value returns (in light of React hooks)”.\n I really encourage you to read it to get all the details, but here’s my attempt at giving you some sort of TLDR;\n In React components the  render() method is called often, so the code there should be optimized enough not to slow things down. That’s where you use React hooks.\n Array destructuring is a very generic API, it doesn’t work only with arrays but with every type of  iterable object, so the VM has a lot work to do to figure out how to traverse and destructure the specific object.\n Object destructuring might be a more performant alternative, but it would probably offer a less pleasant developer experience.\n If you use Babel in loose mode, array destructuring will be highly simplified (to direct element access) and it will result in highly optimized code.\n There’s work going on to see if the different phases of the optimizing compiler in the Google’s V8 engine might be able to optimize destructuring even if you are not using Babel.\n  In this article we discussed this new emerging JavaScript pattern that is getting more and more traction, mostly because of its adoption within React.\n Use cases are not limited to React though and I hope you will find this useful in your daily development life also outside the React land.\n I am really curious to see what you will come up with, so please keep me in the loop using  twitter or the comments in this article.\n For the very curious ones I want to give you one last link, so that you can compare  how multiple return values are implemented in many many other languages.", "posttime": "2020-10-29 18:29:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,javascript", "title": "新兴的JavaScript模式：多个返回值", "title_en": "Emerging JavaScript pattern: multiple return values", "transed": 1, "url": "https://loige.co/emerging-javascript-pattern-multiple-return-values", "via": "", "real_tags": ["java"]}, {"category": "", "categoryclass": "", "imagename": "6451494a54256af025f2743a6a99417c.png", "infoid": 1031969, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我从1999年开始在网上写作，很多人问我是如何变得得体的。简短的答案是大量糟糕的写作，但更好的答案是我学会了遵循一些基本规则。\n当我开始写或解释某件事时，我会把我想说的一切都记录在一个结构中。这是我在这篇文章中使用的提纲。\n然后，我把这个提纲想象成一句话，帮助我明确我想要说的话。\n我在二十多年的写作中学到的是，你需要想清楚，写得清楚，并在短句和长句之间交替使用，才能达到最大的效果。\n整篇文章可以概括为一句话，而事实上，我在开始写作之前在脑海中澄清了这一点，这有助于文章的流畅。这就是为什么我确切地知道我要去哪里的原因。\n好的写作是无法掩饰杂乱无章的。如果你是边走边编的，你的读者会知道的。\n我从1999年开始在网上写作，很多人问我是如何变得得体的。\n这是一个人类会对另一个人类说的话。想象一下，如果我从这个开始，会是什么样子：\n这可能是真的，但普通人不会那样说话。像这样的句子相当于写作上的爵士手。它告诉读者期待胡说八道，而他们却置之不理。\n自然的写作传达了诚实，并更深入地渗透到读者中，因为只有诚实的人才能变得朴素。\n去掉不必要的词，尽量避免形容词，直截了当地说出你想说的话。\n当你可以写“他很开心”的时候，不要写“他很开心”。你认为“非常”这个词增加了一些东西。不是的，斯科特·亚当斯。\n遵循这个建议真的很难。只要假设你会失败，并计划多次编辑每个句子，直到你达到最大的效力。\n诚然，简洁的句子在每个字符上具有最大的力量，但你可以通过在复杂和简单之间交替使用来获得最大的影响。这是一门艺术，但也有一条捷径。\n五句话的好论点比一百句话的精彩论点能动摇更多的人。别抗拒了。斯科特·亚当斯。\n“不要抗争”的落地如此之好，是因为前一句话更长。正是这种对比度让它显得格格不入。\n最后，如果这份清单有第五名，那就是花很多时间练习。\n这本指南显然侧重于正常的“在线”写作，例如为论文或博客撰写的文章。商务、学术和其他类型的写作可能有不同的要求，但我认为他们也可以从更直接和更对话的语气中受益。\n在对话式写作和简明扼要之间有一个有趣的权衡。有时候你可能想说一些非常非常有趣的事情--因为这就是你在现实生活中会说的话。即使它用了多余的词。\n我经常被问到，当我回答问题时，我是如何组织我的想法的，我总是给出同样的答案：这是因为我花了很多时间写作。作为一个思想家，这种组织你想说的话的习惯是无价的。它迫使你在开车之前真正有一个目的地。\n改变我写作最多的帖子是呆伯特成名的斯科特·亚当斯的帖子，名为“你成为更好的作家的那一天”。它可能仍然是我的最爱，包括你刚刚读到的这篇我的文章。我的优势在于它是一种方法论，而不仅仅是建议。在他写那篇帖子之前，我已经钦佩他的写作很长一段时间了(自从他成为一名精神错乱的自由主义者后，我就停止了这个习惯)，但正是这篇文章明确了我喜欢他的散文的地方。更多。\n“黑客”避免陈词滥调的原因是我写的一篇关于为什么你应该避免常见短语的文章。更多。\n用复杂的语言写作往往是一种在内容中隐藏缺乏想法的方式。你在学术写作中经常看到这一点，他们花了9页小字体来表达3个句子。\n小字体是人们和机构使用的一个有趣的伎俩，他们试图最大化自己在读者心目中的地位。基本上，获得信息的难度越大，读者对内容的思考就越多。学术期刊和许多博客作者滥用这一心理事实，用几乎无法辨认的字体写得很少。哇!。我不得不眯着眼睛才能读到这个！他们一定是超级聪明的！", "note_en": "I started writing online in 1999, and I get asked a lot about how I became decent at it. The short answer is lots and lots of bad writing, but the better answer is that I learned to follow some basic rules.\n     When I set out to write or explain something, I capture everything I want to say into a structure. This is the outline I used for this piece.\n   I then imagine that outline as a sentence that helps me crystalize what I want to say.\n What I learned over two decades of writing is that you need to think clearly, write plainly, and alternate between short and long sentences for maximum effect.\n This whole essay could be summarized as that one statement, and the fact that I clarified that in my mind before I started writing helps the essay flow. It’s the reason I know exactly where I’m going.\n  There’s no way to hide disorganization with good writing. If you’re making it up as you go along, your reader will know.\n        I started writing online in 1999, and I get asked a lot about how I became decent at it.\n That’s something a human would say to another human. Imagine if I had started with this instead:\n  That might be true, but normal people don’t talk that way. Sentences like this are the writing equivalent of Jazz Hands. It tells the reader to expect bullshit, and they tune out.\n   Natural writing conveys honesty and soaks deeper into the reader because only honest people can afford to be plain.\n   Eliminate unnecessary words, avoid adjectives as much as possible, and just plainly say what you want to say.\n Don’t write, “He was very happy” when you can write “He was happy.” You think the word “very” adds something. It doesn’t.   Scott Adams\n Following this advice is  really difficult. Just assume you’ll fail and plan to edit each sentence multiple times until you reach maximum potency.\n   It’s true that crisp sentences have the most power per character, but you get maximum impact by alternating between the complex and the simple. This is an art, but there’s also a shortcut.\n   A good argument in five sentences will sway more people than a brilliant argument in a hundred sentences. Don’t fight it.   Scott Adams\n “Don’t fight it” lands so well because the previous sentence was longer. It’s the contrast that makes it click.\n    And finally, if this list had a #5 it would be to spend  a lot of time practicing.\n    This guide is clearly focused on normal, “online” writing, such as for essays or a blog. Business, academic, and other types of writing might have different requirements, but I’d argue they could also benefit from a more direct and conversational tone.\n There’s an interesting tradeoff between conversational writing and being concise. Sometimes you might want to say something is really, really funny—because that’s what you’d say in real life. Even if it uses extra words.\n I am often asked how I’m able to organize my thoughts when I answer questions, and I always give the same answer:  it’s because I spend a lot of time writing. This habit of organizing what you want to say is invaluable as a thinker. It forces you to actually have a destination before you start driving.\n The post that changed my writing the most was by Scott Adams of Dilbert fame, called,  The Day You Became a Better Writer. It’s probably still my favorite, including this piece of mine you just read. The advantage mine has is that it’s a methodology rather than just advice. I’d been admiring his writing for a long time before he wrote that post (a habit I’ve stopped since he became an unhinged Libertarian), but it was that piece that crystalized what I enjoyed about his prose.  More\n The Hacker’s Reason for Avoiding Clichés is an essay I wrote on why you should avoid common phrases.  More\n Writing with complex language is often a way to hide a lack of ideas in the content. You see this a lot in academic writing, where they spend nine pages of tiny font to convey three sentences.\n Small fonts are an interesting trick used by people and institutions trying to maximize their status in the reader’s mind. Basically, the harder it is to get the message, the more the reader thinks of the content. Academic journals and many bloggers abuse this psychological fact by saying very little in a font that’s barely legible. Wow! I had to squint to read this! They must be super smart!", "posttime": "2020-10-29 18:29:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "文章,write,写作", "title": "如何写好文章", "title_en": "How to Write Well", "transed": 1, "url": "https://danielmiessler.com/blog/how-to-write-well/", "via": "", "real_tags": ["文章", "write", "写作"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031968, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在那之前，我们所有的沟通都依赖于电子邮件和一种名为Wedoist的内部工具的混合。但是，我们跨越几个时区的稳步增长的团队让我们很难保持一致，更难感觉到自己是一个有凝聚力的团队。有些事情必须改变。\n说这款应用程序改变了游戏规则，这是委婉的说法。各大洲的团队成员之间的交流呈爆炸式增长。我们分享了想法和活动。(有很多gif。)。我们报告了错误并开发了内部笑话。我们庆祝了成功，并讨论了改进工作的方法。几乎一夜之间，我们从一个30人的团队变成了一个真正的团队。\n这篇文章讲述了我们停止使用Slake的原因。这也是一个故事，说明我们如何(可能)有一个疯狂的想法，即我们可以为已经杂乱无章的团队沟通市场贡献一些根本不同的东西。对于像我们这样有胆量的团队来说，也许有更多的工作要做，而不仅仅是跟上群聊…。\n像Slake这样的群聊应用程序是为一种特定类型的交流而设计的-一次一行，实时对话。这种形式的沟通有时很有用(例如，在紧急情况下)，但当它成为团队的主要沟通方式时，会带来很大的负面影响。\n因为斯拉克的对话是在单向传送带上进行的，我们的团队开始觉得他们必须保持持续的联系才能跟上。如果你没有关注Slake内部展开的对话，你很可能错过了重要的讨论和决定。\n这种通信方式对于像我们这样的远程优先的公司来说尤其成问题，因为团队成员分布在许多不同的时区。当之前的话题已经被讨论过，甚至在你醒来的时候都被埋没了，你如何保持在循环中？\n正如塞缪尔·胡立克在他写给这款应用的著名的“分手”信中所说的那样：\n我发现这种“永远在线”的趋势是一个自我延续的反馈循环：每个人出去玩得越多，对话就越多。对话越多，预计每个人都会参与的越多。起泡，冲洗，重复。\n一项研究发现，Slake用户平均每天在这款应用程序上花费10个小时！当然，这并不是说人们不能同时处理多项任务，但一项又一项研究表明，持续的上下文切换-比如当你停下来查看队友的通知-会降低工作效率，导致“更大的压力、更大的挫折感、时间压力和努力”。\n这对我们的团队来说是不健康的，也没有帮助我们专注于真正推动项目向前发展的艰苦工作。\nSLACK对于快速检查事情很有用，但我们发现这是一个进行大范围讨论的麻烦渠道。群聊界面是为快速发送信息而设计的，几乎不可能从头到尾保持完整的对话。\n甚至在你完全理解正在讨论的问题之前(更不用说找到解决方案了)，总会有人开始新的对话或回复频道早先发生的前一次讨论。\n即使谈话停留在主题上，一切都仍然需要立即做出回应。对于Slake，没有喘息的空间可以后退一步，想一想当时讨论的是什么，然后再跟进。我们仍然需要单独的工具-在我们的例子中是电子邮件和Wedoist-来就我们的工作进行更深入的对话。这意味着我们的谈话被分割成多个片段，很难组合在一起。\n随着多个同时进行的对话在一个单独的Slake频道内进行，我们开始失去对事物的跟踪。想法被提出了，讨论了一会儿，但最终还是失败了。不可能回头参考已经做出的决定，也不可能整齐地保存信息，以便其他人以后可以找到它。\n我们的一名支持团队成员将在#支持频道报告错误的经历比作试图跳上行驶中的火车。一旦他成功地引起了开发人员的注意，就没有简单的方法可以在以后跟进问题的状态。\n因为我们不能轻易地回去找出一个话题是否已经讨论过了，所以相同的问题和问题经常被多次提出。我们没有建立一个内部知识库，让人们自己查找信息，我们只是重复自己。\nSlake内部缺乏组织性，这对我们团队获取信息产生了真正的影响。我们很快发现，实时消息传递并不是为了保存历史或提高透明度。\n如果你正在寻找一些非常具体的东西，比如一个文件，Sack有一个很棒的搜索，但如果不手动浏览，就无法深入了解任何给定渠道正在发生的事情。即使在那时，也很难跟上，因为话题变成了话题，中间有很多不相干的闲聊。\n这导致了一个令人沮丧的矛盾。从理论上讲，团队中的每个人都可以访问所有通过公共渠道进行的交流。但在现实中，就连我也记不住公司里正在进行的所有对话。任何当时碰巧有联系的人都可以跟随并参与决策。其他人可能根本没有意识到对话的发生。\nTwist的基础是异步通信。我们的在线手册“异步的艺术：团队通信的远程指南”是一本全面的入门读物，介绍了异步通信和同步通信之间的区别。了解领先的远程公司，如GitLab、Doist、HashiCorp、Toggl和AngelList如何实现异步通信。\n产品松弛不是问题所在。它完美地设计和构建了它所做的事情--为团队提供实时消息传递。实时消息本身才是问题所在。但当我们探索替代方案时，我们发现Slake的竞争对手承诺提供完全相同的实时聊天模式。\n这就是为什么，在我们Slake实验的一年里，我们决定创建Twist，一个全新的平台-一个以更平静、更有组织、更有成效的交流为中心的平台。\n一路走来，我们从“花得好的时间”、“从注意力竞赛中找回头脑的非营利运动”和卡尔·纽波特教授的“华尔街日报”畅销书“深度工作”等倡议中获得灵感。纽波特认为，在当今互联互通、以知识为基础的工作场所，“不分心地专注于一项认知要求高的任务的能力”正变得越来越重要，也越来越罕见。人们开始意识到这样一个事实，科技全天候地吸引着我们的注意力，这既伤害了我们的工作，也伤害了我们的福祉。\n我们从2014年开始打造Twist，到了2016年3月23日，我们把所有的团队沟通都搬到了这个平台上。\n我坚信，如果我们没有追求这一挑战并做出改变，我们就不会有今天的团队。作为一个由50人组成的远程团队，面对面互动的机会非常少，Twist给了我们一个从头到尾全面讨论复杂想法和项目的空间，给出更有意义的反馈，提高我们决策的透明度，并切断联系，做我们真正兴奋的深入工作。\n以下是我们在此过程中做出的一些设计决策，将异步通信优先于实时消息传递，在保持连接的基础上做了大量工作：\n线程对话从一开始就是Twist的核心。他们允许团队中的任何人创建关于特定主题的对话，并确保整个对话--想法、问题、答案和决策--都围绕该主题组织起来。\n有了Twist，我可以拔掉插头，去踢一场足球，然后回到任何对话中，而不会错过任何东西。没有立即做出回应的压力。事实上，许多会员在一天中的很大一部分时间里都在打盹，有些人根本就没有打开通知。这让他们完全控制了自己的时间和注意力，去做深入、周到的工作。\n这里有一个来自Doist品牌频道的帖子的例子，我们在那里讨论、提供反馈，并在一年多的时间里反复讨论Twist的新徽标-所有这些都是在同一个帖子中组织的！\n从我们使用Slake的经验来看，我们知道仅仅将对话公之于众并不足以保证整个公司平等获取信息。透明度是我们围绕清晰主题建立沟通的主要原因之一。\n我们的团队现在可以浏览主题来了解公司内正在进行的讨论，而不必浏览单一意识流聊天渠道。我们可以更深入地研究我们感兴趣的对话，即使我们没有直接参与其中。我们经常分享整个帖子的链接作为参考，这样人们就可以看到某个决定是如何做出的。\n我们最新的团队成员能够通过阅读过去关于我们工作的讨论，快速了解正在发生的事情，并看到我们的团队文化在行动中。\n作为首席执行官，让我们所有的团队对话都在Twist线程中进行，让我可以随时掌握公司的脉搏，而不会感到不知所措。它让我可以自由地做其他工作，而不用担心我会错过重要的事情。\n我们发现Twist帮助我们以更有意义的方式保持联系，不仅是社交，而且实际上是在决定我们作为一家公司的核心人物的重要对话中分享。\n我们在创建Twist时所做的一个小而有影响力的设计选择是省略了在线状态指示器(Online Presence Indicator)。\n在线状态指示器已经成为任何团队沟通工具的一种期望，是以工作小时数而不是完成的工作量来衡量生产力的时代遗留下来的东西。但我们觉得这会破坏Twist的异步特性：\n如果你看到某人离线，你更有可能推迟发送邮件，因为他们可能不会立即回复你。\n在没有在线状态指示器的情况下，我们的团队已经适应了在需要的时候添加评论和发送消息。他们无法知道此人是否在线，因此他们不希望立即得到回复。\n对话可能会进行得更慢，但更多真正的工作完成了，因为我们不必处理实时消息带来的持续分心和上下文切换。\n我们如何设计Twist来培养专注的交流的另一个例子是休假功能。Twist可以让你设置一个休假状态，将来自应用程序的所有通知静音，将你的头像更改为“度假”头像，并让你的队友知道你什么时候会回来。这样，人们就可以适当地充电，享受当之无愧的假期，每个人都知道在回来之前不要指望得到回应。\n雄心壮志和平衡是我们公司的两个核心价值观。是的，我们想努力工作，建立一个强大的公司，但不能以牺牲我们的健康和人际关系为代价。如果我们实现了我们的目标，但在这个过程中我们已经筋疲力尽了，那么我们就失败了。能够构建像休假这样的功能来反映这些价值，感觉非常棒。\n无论是Facebook还是Slake，今天的通信应用都在争相吸引你的注意力，最大限度地让你在他们的应用中花费的时间最多。这就是他们筹集风投资金和提升巨额估值的方式(Slake目前的估值为38亿美元)。\n我们希望Twist做得好并且盈利，但我们希望这样做是因为它能真正让团队(包括我们的团队)做好他们的工作，而不是因为它占用了他们的时间和注意力。它是关于拥有一种为用户需求而打造的产品，而不是反过来。\n这将是一场漫长而艰苦的战斗。平静的异步通信不是规范。要认识到专注和平衡是公司为了成功需要保护的重要资产，这需要思想上的重大转变。\n我们打赌，在未来，最成功的公司将是那些实现这一转变的公司。那些不需要员工不断连接的公司，他们优先考虑异步通信，为深入工作创造空间，让员工完全断开连接并充电。我们很高兴能成为这场运动的一部分。", "note_en": "Until then, we had relied on a mix of email and an internal tool called Wedoist for all of our communication. But our steadily growing team based across several time zones made it hard to stay on the same page and even harder to feel like one, cohesive team. Something had to change.\n  To say the app was a game-changer would be putting it mildly. Communication between team members across continents exploded. We shared ideas and gifs. ( Lots of gifs.) We reported bugs and developed inside jokes. We celebrated successes and discussed ways to improve our work. Almost overnight, we went from a group of 30 individuals to a true team.\n  This post is the story of  why we stopped using Slack. It’s also the story of how we had the (possibly) crazy idea that we could contribute  something fundamentally different to an already cluttered team communication market. Something for teams like ours with the audacity to think that maybe there’s more to work than keeping up with group chat…\n  Group chat apps like Slack are built for a specific kind of communication — one-line-at-a-time, real-time conversations. This form of communication is sometimes useful (e.g. in emergency situations), but presents significant downsides when it becomes your team’s primary way of communicating.\n   Because conversations in Slack happen on a one-way conveyor belt, our team began feeling like they had to stay constantly connected to keep up. If you weren’t following conversations as they unfolded inside Slack, you were likely missing out on important discussions and decisions.\n This style of communication was especially problematic for a remote-first company like ours, with team members spread across many different time zones. How do you stay in the loop when earlier topics have already been discussed and are buried by the time you even wake up?\n As Samuel Hulick put it in his famous  “break-up” letter to the app:\n I’m finding that “always on” tendency to be a self-perpetuating feedback loop: the more everyone’s hanging out, the more conversations take place. The more conversations, the more everyone’s expected to participate. Lather, rinse, repeat.\n One study found that Slack users spend an of  average of ten hours per day in the app! That’s not to say that people aren’t multitasking of course, but study after study has shown that constant context-switching —like when you stop what you’re doing to check on a notification from a teammate— kills productivity and leads to “ more stress, higher frustration, time pressure and effort.”\n It wasn’t healthy for our team, and it wasn’t helping us focus on the hard work that really moves projects forward.\n  Slack was useful for quickly checking on things, but we found that it was a troublesome channel for big picture discussions. Group chat interfaces are designed for rapid fire messaging, and it was nearly impossible to sustain a full conversation from start to finish.\n  Before you could even fully understand the problem being discussed (let alone find a solution), someone would invariably start a new conversation or reply to a previous discussion that happened earlier in the channel.\n Even when conversations stayed on topic, everything still required an immediate response. With Slack, there was no breathing room to take a step back, think about what was being discussed, and follow up on it later. We still needed separate tools—in our case email and Wedoist—to have deeper conversations about our work. This meant that our conversations were fractured into multiple pieces that were hard to put together.\n   With multiple, simultaneous conversations happening inside a single Slack channel, we began losing track of things. Ideas were proposed, discussed for a bit, and lost. It was impossible to refer back to a decision that had been made, or to neatly preserve the information so that others could find it later.\n One of our support team members likened the experience of reporting a bug in the #Support channel to trying to hop on a moving train. Once he did manage to get a developer’s attention, there was no easy way to follow up on the status of the issue later.\n Since we couldn’t easily go back to find whether a topic had already been discussed, the same questions and issues were often brought up multiple times. Rather than building an internal knowledge base for people to find information themselves, we just repeated ourselves.\n   The lack of organization inside Slack had real consequences for our team’s access to information. We quickly discovered that real-time messaging wasn’t meant to preserve history or promote transparency.\n Slack had awesome search if you were looking for something very specific like a file, but there was no way to get insight into what was happening in any given channel without manually skimming through it. Even then, it was difficult to follow along as topics bled into topics with a lot of irrelevant chitchat in between.\n That led to a frustrating contradiction. In theory, everyone on the team had access to all the communication that happened in public channels. But in reality, even I couldn’t keep track of all the conversations that were happening at the company. Whoever happened to be connected at the time could follow along and be involved in the decision-making. Everyone else might not even be aware that the conversation happened at all.\n   The foundation of Twist is asynchronous communication. Our online handbook,  The Art of Async: The Remote Guide to Team Communication, is a comprehensive primer on understanding the difference between asynchronous and synchronous communication. Learn how leading remote companies like GitLab, Doist, HashiCorp, Toggl, and AngelList implement asynchronous communication.\n Slack the product wasn’t the issue. It’s perfectly designed and built for what it does—real-time messaging for teams. It was real-time messaging itself that was the problem. But when we explored alternatives, we found that Slack’s competitors promised the exact same model of real-time chat.\n That’s how, one year into our Slack experiment, we made the decision to create  Twist,  an entirely new platform—one that centers around calmer, more organized, and more productive communication.\n  Along the way, we’ve drawn inspiration from initiatives like  Time Well Spent, “a non-profit movement to reclaim our minds from the race for attention” and  Deep Work, the  Wall Street Journal bestseller by professor Cal Newport. Newport argues that “the ability to focus without distraction on a cognitively demanding task” is becoming both increasingly important and increasingly rare in today’s connected, knowledge-based workplace. People are waking up to the fact that the 24/7 hook that technology has on our attention hurts both our work  and our well being.\n We started building Twist in 2014, and on March 23rd, 2016, we moved all our team communication to the platform.\n I firmly believe we wouldn’t be the team we are today if we hadn’t pursued this challenge and made the switch. As a remote team of 50 with very few opportunities for face-to-face interaction, Twist has given us a space to fully discuss complex ideas and projects from start to finish, to give more meaningful feedback, to promote transparency in our decision-making, and to disconnect to do the deep work that we’re truly excited about.\n Here are a few of the design decisions we’ve made along the way to prioritize asynchronous communication over real-time messaging, doing great work over being constantly connected:\n  Threaded conversations have been at Twist’s core from the beginning. They let anyone on the team create a conversation about a specific topic and ensure that whole conversations—ideas, issues, answers, and decisions—stay organized around that topic.\n With Twist, I can unplug, go play a game of soccer, and come back to any conversation without missing anything. There’s no pressure to respond immediately. In fact, many members snooze all notifications for significant portions of the day, and some don’t have notifications turned on at all. This gives them complete control over their time and attention to do deep, thoughtful work.\n Here’s an example of a thread from our  Doist Branding channel where we discussed, gave feedback, and iterated on the new logo for Twist for over a year—all organized in the same thread!\n    From our experience with Slack, we knew that merely making conversations public wasn’t enough to guarantee equal access to information across the company. Transparency was one of the main reasons that we built communication around clear topics.\n Instead of having to skim through single-stream-of-consciousness chat channels, our team can now browse topics to get an overview of the discussions happening in the company. We can delve deeper into just the conversations we’re interested in, even if we’re not directly involved. We often share links to whole threads as reference so people can look and see how a certain decision was made.\n Our newest team members have been able to quickly get up to speed on what’s going on and see our team culture in action by reading past discussions about our work.\n As CEO, having all our team conversations in Twist threads lets me keep my finger on the pulse of the company without getting overwhelmed. It frees me up to do other work without worrying that I’m missing important things.\n We’ve found that Twist has helped us stay connected in more meaningful ways, not just socializing, but actually sharing in the important conversations that determine the core of who we are as a company.\n  A small, but impactful design choice we made in creating Twist was to leave out the online presence indicator.\n The presence indicator has become something of an expectation for any team communication tool, a holdover from the days when productivity was measured by hours worked rather than work accomplished. But we felt that it would ruin the asynchronous nature of Twist:\n If you see someone is offline, you’re more likely to postpone sending a message because they probably won’t get back to you right away.\n Without the presence indicator, our team has adapted to adding comments and sending messages whenever they need to. They have no way of knowing if the person is online, so they don’t expect an immediate response.\n Conversations may happen more slowly, but more real work gets done since we don’t have to deal with constant distractions and context-switching that come with real-time messaging.\n  Another example of how we’ve designed Twist to foster mindful communication is the time off feature. Twist lets you set up a time off status that mutes all notifications from the app, changes your avatar to a “vacation” avatar, and lets your teammates know when you’ll return. This way people can properly recharge and take a well-deserved vacation, and everyone knows not to expect a response until they get back.\n Ambition and balance are two of the core values of our company. Yes, we want to work hard and build a strong company, but not at the expense of our health and relationships. If we achieve our goals, but we’ve burnt ourselves out in the process, then we’ve failed. It feels amazing to be able to build features like Time Off that reflect those values.\n   Whether it’s Facebook or Slack, today’s communication apps compete to grab your attention and maximize your time spent inside their apps. That’s how they raise VC money and bolster huge valuations (Slack is currently valued at $3.8 billion).\n We want Twist to do well and be profitable, but we want it to be because it truly empowers teams (including ours) to do their best work, not because it hijacks their time and attention. It’s about having a product that’s built to serve users’ needs and not the other way around.\n It’s going to be a long, uphill battle. Calm, asynchronous communication isn’t the norm. It’s going to take a major shift in thinking to recognize that focus and balance are vital assets that companies need to protect in order to be successful.\n We’re betting that in the future, the most successful companies will be the ones who make that shift. The ones that  don’t require their employees to be constantly connected, who prioritize asynchronous communication to create space for deep work and allow employees to fully disconnect and recharge. We’re excited to be a part of that movement.", "posttime": "2020-10-29 18:28:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "消息,real,团队", "title": "为什么我们押注于Slake这样的实时团队消息应用", "title_en": "Why We’re Betting Against Real-Time Team Messaging Apps Like Slack", "transed": 1, "url": "https://blog.doist.com/betting-against-slack/", "via": "", "real_tags": ["消息", "real", "团队"]}, {"category": "", "categoryclass": "", "imagename": "d39996891b146984683d75218d7f6573.png", "infoid": 1031967, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "了解Atlassian服务器的销售和支持终止日期是什么时候，并获得有关如何应对此更改的帮助。了解为什么云可能适合您。", "note_en": "Learn when the Atlassian server end of sale and support date is and get help on how to navigate this change. Find out why cloud might be right for you.", "posttime": "2020-10-29 18:28:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "西岛,moving,获得", "title": "亚特兰西岛要到2024年才能迁移到云端", "title_en": "Atlassian moving to cloud only by 2024", "transed": 1, "url": "https://www.atlassian.com/migration/journey-to-cloud", "via": "", "real_tags": ["西岛", "moving", "获得"]}, {"category": "", "categoryclass": "", "imagename": "8106ece537f9aa7e50316f095b3bd08b.jpg", "infoid": 1031966, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尼古拉·特斯拉是最先设想无线未来的人之一。1900年，他声称将会有精确的无线信号传输，这些信号将被不超过一块手表的设备接收到。他当然是在描述我们现在所知的无线电波，这是我们现代互联电子如何工作的基础。\n事实上，特斯拉非常相信无线通信和能量转移的想法，以至于他开始在纽约建造一个发射站来证明他的观点。它被称为特斯拉无线世界系统，不幸的是，由于特斯拉耗尽了资金，它从未完工。\n话虽如此，我们仍然有特斯拉对这项无线技术的计划，这样我们就可以更仔细地看看它的设计，以及它是如何工作的。\n在特斯拉已经在科学和电气领域声名鹊起后，他开始在纽约市开设实验室。1888年，他在一个专门研究交流电的实验室进行实验。\n通过这些实验和测试，他能够开发出一种将直流电甚至低频交流电转化为高频电流的方法。\n正是在开发这些变压器和交流发电机的过程中，他意识到，如果交流电路没有完全完成，交流电路仍然可以正常工作。相反，电流仍然可以沿着一根导线从一个接地端子流向第二个接地端子，并且电路仍然可以工作。特斯拉发现，当电流源的频率足够高时，他基本上可以将地面作为电路的一部分。\n如果接地端子有足够高的电压接地，并且有一根导线连接到另一端，那么电流可以通过连接到导线另一端的导体的电容沿着导线吸收。\n比方说，灯泡的电容足以从电路中汲取电流来点亮它，这类似于无线电发射机的工作原理。\n沿着同样的思路，特斯拉想出了一个绝妙的无线传输点子。它是用大地作为传导电流的导体。正如1893年特斯拉的一次演讲中所描述的那样，该装置将在地面和上升到空中的球形导体之间连接一台发电机。\n在这种设置中，发电机产生的电磁频率将确保交流电与地面的符号相反。特斯拉因此认为，地面-地球-可以被设置为一种几乎没有能量耗散的振荡状态。\n通过发现地面作为传输介质的能力，特斯拉制定了一项计划，通过地面发送高频电流，这些电流将传播到全球任何地方，并由谐振接收器接收。\n土壤和水的电导率比金属小得多，但由于地球的大横截面积，发射器接地端子与给定远程点之间的电阻将非常小。\n在整个地球上无线传播的发射机电流的公式如下所示：\nI是以安培为单位的电流，f是以赫兹为单位的频率，C是以法拉为单位的发射球和地的自电容，V是球和地之间的电压。\n特斯拉继续利用这个等式在长岛建立了他的车站，他第一次在那里开始测试这个想法。发电机用来在700安培、10千赫兹的条件下产生1000万伏的电压。高电压对于他的无线传输想法来说是产生足够强电流所必需的，所以他不断地突破他的机器所能产生的极限。\n到这个时候，特斯拉已经有了一个半工作的原型，他在1897年左右开始为他的无线传输和接收技术申请专利。他的专利在1900年经过审查后被授予，其中一个设备的示意图如下所示。\n虽然特斯拉发明的接收器和发射器部分在他的专利申请中很清楚，但该装置的许多工作原理和内部工作原理并没有详细解释。他的理论是，如果他能够传输足够高的电压和电流，他就可以将有用的无线能量传输到世界任何地方。\n这台机器还能够产生如此高的电力，理论上它们可以用来制造人造北极光，即北极光。\n特斯拉的发电机、发射器和振荡装置在他们的时代是开创性的。除了简单的电子电力传输，他的动力振荡装置也同样有趣。通过利用地面和建筑物中的振荡，特斯拉相信他可以通过物质以动波的形式传输能量，然后这些能量可以在接收端转化回电能。\n为了实现这一点，他建造了一个蒸汽驱动的振荡装置，它的频率可以被操纵。当振荡装置的频率与接收器的谐振频率匹配时，机械运动将被转换回可用电能。\n特斯拉实际上也能让这项技术发挥作用。他在1897年建造了他的第一个机械振荡器，在1898年，他只用一台小发电机就能使他的实验室振荡。这座建筑位于纽约市，离邻居很近，里面的摇晃和摇晃足以让邻居们最终报警，担心会发生非常糟糕的事情。\n特斯拉有点边缘聪明，他会拿出他的小振动装置，在城市的不同建筑上进行测试。据1912年的“今日世界”杂志报道，\n他把他的小振动器放在上衣口袋里，出去寻找一座半竖立的钢结构建筑。在华尔街地区，他发现周围有一层、十层没有砖头或石头的钢架。他把振动器夹在其中一根横梁上，忙于调整，直到拿到为止。特斯拉说，最后结构开始吱吱作响和编织，钢铁工人惊慌失措地来到地面，认为发生了地震。警察被叫了出来。特斯拉把振动器放进口袋就走了。再过十分钟，他就可以把大楼铺在街上了。而且，用同样的振动器，他可以在不到一个小时的时间里把布鲁克林大桥扔进东河。\n这个参考创造了特斯拉在纽约市测试他的各种发明的相当迂回而有趣的画面。特斯拉确实将这项技术推向了更深一步，甚至进入了你可能没有意识到的领域。\n他开发了一种方法，利用他的蒸汽发生器产生的振荡来分析地球的地下条件。通过振荡器产生地震波，反射波可以给特斯拉和其他研究人员提供关于下面岩层的信息。\n从本质上说，这项技术是地质学家不用挖洞或取钻孔样本就能看到地球内部的第一种方式。事实上，地震学家至今仍在使用产生地震波的振荡发生器来研究地下条件的原理。\n当然，今天的设备要高科技得多，但它仍然在很大程度上归功于一个多世纪前特斯拉的发明。", "note_en": "Nikola Tesla was one of the first minds to envision a wireless future. In the year 1900, he claimed that there would be precise wireless  transmission of signals that would be received by devices no larger than a watch. He&#39;s of course describing what we now know as radiowaves, the foundation of how our modern connected electronics work.\n Tesla, in fact, believed in this idea of wireless communication and energy transfer so much that he started constructing a transmitting station in New York to prove his point. Called Teslas&#39; &#39;World System of Wireless&#39;, it was unfortunately never completed due to Tesla running out of money.\n With that said, we still have the plans from Tesla for this  wireless technology so we can take a closer look at its design and how it would&#39;ve worked.\n   After Tesla had already made a name for himself in the scientific and electrical realm, he started opening up laboratories in New York City. In 1888, he was  conducting experiments at one of the laboratories specifically focused on alternating current.\n Through these experiments and tests, he was able to develop a method of converting direct current and even low-frequency alternating currents into  high-frequency currents.\n  It was during the development of these transformers and alternators that he realized alternating current circuits can still function if they aren&#39;t fully &#39;complete&#39;. Rather, that the current can still flow along just one wire from one grounded terminal to a second grounded terminal and the circuit would still work. Tesla discovered that when the source of the current was of high enough frequency, he could essentially use the ground as a part of the circuit.\n  If the grounded terminal had a high enough voltage grounded, and a wire was connected to the other terminal, the current could be drawn along the wire by the capacitance of a conducting body connected to the other end of it.\n The capacitance of say, a light bulb, was enough to draw current from the circuit to light it up, which is similar to how radio transmitters work.\n  Along the same train of thought, Tesla came up with a brilliant wireless transmission idea. It was to use the earth as the conductor for transmitting currents. As described in a lecture from Tesla in 1893, the device would connect a generator between the ground and a spherical conductor raised into the air.\n The electromagnetic frequencies resulting from the generator in this setup would ensure that the alternating current was of opposite sign from the earth. Tesla consequentially believed that the ground—the earth—could be set into a state of oscillations with little dissipation of energy.\n  Through this discovery of the ground&#39;s ability to be utilized as a transmission medium, Tesla developed a plan to send high-frequency currents through the ground that would propagate anywhere around the globe, being received by a resonant receiver.\n The conductivity of soil and water is much smaller than metals, but the resistance between the transmitter ground terminal and a given distant point would be very small, due to the large cross-sectional area of the Earth.\n The formula for the transmitter current that would wirelessly propagate throughout the earth looks like this:\n  I is current in amps, f is the frequency in hertz, C is the self-capacitance of the transmitter sphere and Earth in farads, and V is the voltage between the sphere and the ground.\n  Tesla went on to utilize this equation to build his station on Long Island, where he first started testing the idea. A generator was used to produce 10 million volts at 700 amps at 10 kilohertz. The high voltage was necessary to produce a strong enough current for his wireless transmission idea, so he constantly pushed the limit of what he could generate with his machines.\n By this time, Tesla had a semi-working prototype and he began patenting his wireless transmission and reception technology around 1897. His patent was granted after review in 1900, with one of the diagrams of the device shown below.\n  While the receiver and transmitter parts of Tesla&#39;s invention were clear in his patent filing, many of the functioning principles and inner workings of the device were not explained in great detail. He theorized that if he was able to transmit a high enough voltage and current that he would be able to transmit useful levels of wireless energy anywhere in the world.\n   The machine was also capable of producing such high amounts of electricity that they could theoretically have been used to create man-made aurora borealis, or northern lights.\n  Tesla&#39;s generators, transmitters, and oscillation devices were groundbreaking for their time. Aside from simply electronic electricity transmission, his kinetic oscillation devices were also equally as interesting. By leveraging oscillations in the ground and in structures Tesla believed that he could transmit energy as kinetic waves through matter, which could then be translated back into electrical energy on the receiving side.\n To achieve this, he built a steam-powered oscillation device that could have its frequencies manipulated. When the frequency of the oscillation device matched the resonant frequency of the receiver, the mechanical motion would be transformed back into usable electrical energy.\n  Tesla was actually able to get this technology working too. He built his first mechanical oscillator in 1897 and in 1898, he was able to oscillate his laboratory with just a small generator. Located in New York City with close proximity to neighbors, the oscillations and shakings in the building were enough that neighbors eventually called the police, fearing something very bad was happening.\n  Tesla being somewhat of a fringe brilliant mind would take his small vibration device and test it on different structures in the cities. According to  The World Today Magazine from 1912,\n &#34;He put his little vibrator in his coat-pocket and went out to hunt a half-erected steel building. Down in the Wall Street district, he found one, ten stories of steel framework without a brick or a stone laid around it. He clamped the vibrator to one of the beams, and fussed with the adjustment until he got it. Tesla said finally the structure began to creak and weave and the steel-workers came to the ground panic-stricken, believing that there had been an earthquake. Police was called out. Tesla put the vibrator in his pocket and went away. Ten minutes more and he could have laid the building in the street. And, with the same vibrator, he could have dropped the Brooklyn Bridge into the East River in less than an hour.&#34;\n  That reference creates quite the devious and interesting picture of Tesla going throughout New York City testing his various inventions. Tesla did take this technology further, even into fields that you might not be aware of.\n He developed a way to utilize the oscillations created by his steam generator in order to analyze the subsurface conditions of the Earth. By generating seismic waves with the oscillator, the reflected waves could give Tesla and other researchers information about the layers of rock below.\n  In essence, this technology was the first way that geologists were able to see into the Earth without digging holes or taking bore samples. In fact, the principle of using an oscillation generator that creates seismic waves to study subsurface conditions is still used by seismologists today.\n  Today, the equipment is much more high tech of course, but it still owes a lot to Tesla&#39;s invention from over a century ago.", "posttime": "2020-10-29 18:28:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,发射机,tesla,电流", "title": "尼古拉·特斯拉的无线发射机技术", "title_en": "Nikola Tesla's Wireless Transmitter Technology", "transed": 1, "url": "https://interestingengineering.com/nikola-teslas-wireless-transmitter-technology", "via": "", "real_tags": ["特斯拉", "发射机", "tesla", "电流"]}, {"category": "", "categoryclass": "", "imagename": "0dff48cac5b9f0f058c2a3be45ad20c6.jpg", "infoid": 1031965, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "升级卡消费者将从使用该卡进行的所有购物中赚取1.5%的现金返还-没有特定的类别，没有合作伙伴零售商，没有积分制度。这是一个直截了当的、不设上限的现金返还计划。\n该公司希望鼓励用户偿还债务。所以升级并不是鼓励你花更多的钱来赚更多的钱。取而代之的是，当你每月支付余额时，你会得到你的奖励。\n凭借其信用卡，Upgrade正试图提供一种对消费者友好的信用卡。Upgrade首席执行官雷诺·拉普兰奇认为，升级始于较低的费率。与正常的12%到13%的入门率不同，升级承诺的入门率为6.99%。\n为了避免无休止的信用卡债务陷阱，Upgrade将月费合并到分期付款计划中，您可以在24到60个月内偿还。你按固定利率还款，月供相等。当然，你也可以预付任何金额--没有罚金。\n当你注册时，你会立即得到一张虚拟卡，几天后会得到一张Visa品牌的塑料卡。公司给你500到2000美元的信用额度。\n在过去的三年里，Upgrade已经发放了超过35亿美元的信贷。该公司目前的年经常性收入为1.25亿美元。这是有利可图的。\n有趣的是，Upgrade将自己描述为一家新银行。有许多成功的新银行-如Chime，Revolut，N26和Nubank-但大多数专注于支票账户和借记卡。他们的收入主要来自信用卡交易的交换费、带有保险套餐的保费订阅和转介费。\n升级是从专注于信贷的不同产品开始的，这会产生大量收入。该公司目前正在开发其他银行产品，以便它能够成为传统零售银行账户的真正替代品。他们应该会在未来几周推出新产品。", "note_en": "Upgrade   Card consumers will earn 1.5% cash back on all purchases made with the card — there’s no specific category, no partner retailer, no point system. It’s a straightforward, uncapped cash back program.\n The company wants to encourage users to pay down their debt. So Upgrade isn’t encouraging you to spend more to earn more. Instead, you receive your rewards when you make your monthly balance payments.\n  With its credit card, Upgrade is trying to provide a consumer-friendly credit card. And Upgrade CEO Renaud Laplanche believes that it starts with lower rates. Instead of a normal entry rate of 12% to 13%, Upgrade promises an entry rate of 6.99%.\n In order to avoid the endless trap of credit card debt, Upgrade combines monthly charges into installment plans that you can pay back over 24 to 60 months. You pay down your balance at a fixed rate with equal monthly payments. Of course, you can also prepay any amount — there’s no penalty.\n When you sign up, you get a virtual card immediately and a Visa-branded plastic card a few days later. The company gives you a credit line of $500 to $2,000.\n Over the past three years, Upgrade has issued over $3.5 billion in credit. The company is now on a run rate of $125 million in annual recurring revenue. It is profitable.\n Interestingly, Upgrade describes itself as a neobank. There are many successful neobanks out there — such as Chime, Revolut, N26 and Nubank — but most of them focus on checking accounts and debit cards. They mostly generate revenue from interchange fees on card transactions, premium subscriptions with insurance packages and referral fees.\n Upgrade has started with a different product offering focused on credit, which generates a lot of revenue. The company is now working on other banking products so that it can become a true alternative to traditional retail bank accounts. They should launch new products in the coming weeks.", "posttime": "2020-10-29 18:04:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "奖励,adds", "title": "\n升级将奖励计划添加到其信用卡", "title_en": "\n\t\t\t\tUpgrade adds rewards program to its credit card\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/29/upgrade-adds-rewards-program-to-its-credit-card/", "via": "", "real_tags": ["奖励", "adds"]}, {"category": "", "categoryclass": "", "imagename": "f1f9a506a2b5a50059f82ae238285702.png", "infoid": 1031963, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳跃导航跳跃搜索浴缸曲线在可靠性工程中有着广泛的应用。它描述了危险函数的一种特殊形式，它包括三个部分：\n这个名字来源于浴缸的横截面形状：陡峭的侧面和平坦的底部。\n浴缸曲线是通过绘制产品首次引入时早期婴儿死亡率、在其使用寿命内故障率恒定的随机故障率，以及产品超过其设计寿命时的磨损故障率的映射来生成的，浴缸曲线是通过映射最初引入的婴儿死亡率、在其使用寿命期间故障率恒定的随机故障率以及产品超过其设计寿命时的磨损故障率来生成的。\n用不那么专业的术语来说，在遵循浴缸曲线的产品的早期生命周期中，故障率很高，但随着缺陷产品被识别和丢弃，以及处理和安装错误等潜在故障的早期来源被克服，故障率迅速下降。在产品的中年阶段--一般来说，对于消费产品而言--故障率很低，而且是恒定的。在产品的后期寿命中，随着老化和磨损对产品造成的影响，故障率会增加。许多电子消费产品的生命周期强烈地呈现出浴缸曲线。[1]。\n虽然浴缸曲线是有用的，但并不是每个产品或系统都遵循浴缸曲线危险函数；例如，如果设备在磨损周期开始期间或之前退役或减少使用，则每单位日历时间(而不是每单位使用时间)显示的故障将比浴缸曲线少。\n在可靠性工程中，浴缸曲线对应的累积分布函数可以用威布尔图来分析。[1]。\n^a bJ.Lienig，H.Bruemmer(2017)。电子系统设计基础。斯普林格国际出版社。第54页。电话：55840-10.1007。ISBN978-3-319-55839-4。\n题名/责任者：The First of the Passler，P.C.(科斯勒，P.C.)，沃特曼，M.A.。(2003年3月)。仔细观察浴缸曲线。IEEE可靠性学报。52(1)：125-129。DOI：10.1109/TR.2002.804492.。ISSN电话：0018-9529。", "note_en": "Jump to navigation  Jump to search  The  bathtub curve is widely used in  reliability engineering. It describes a particular form of the  hazard function which comprises three parts:\n  The name is derived from the cross-sectional shape of a  bathtub: steep sides and a flat bottom.\n The bathtub curve is generated by mapping the rate of early &#34;infant mortality&#34; failures when first introduced, the rate of random failures with constant failure rate during its &#34;useful life&#34;, and finally the rate of &#34;wear out&#34; failures as the product exceeds its design lifetime.\n In less technical terms, in the early life of a product adhering to the bathtub curve, the failure rate is high but rapidly decreasing as defective products are identified and discarded, and early sources of potential failure such as handling and installation error are surmounted. In the mid-life of a product—generally speaking for consumer products—the failure rate is low and constant. In the late life of the product, the failure rate increases, as age and wear take their toll on the product. Many electronic consumer product life cycles strongly exhibit the bathtub curve.  [1]\n While the bathtub curve is useful, not every product or system follows a bathtub curve hazard function; for example, if units are retired or have decreased use during or before the onset of the wear-out period, they will show fewer failures per unit calendar time (not per unit use time) than the bathtub curve.\n In reliability engineering, the  cumulative distribution function corresponding to a bathtub curve may be analysed using a  Weibull chart.  [1]\n    ^     a     b   J. Lienig, H. Bruemmer (2017).  Fundamentals of Electronic Systems Design. Springer International Publishing. p. 54.  doi: 10.1007/978-3-319-55840-0.  ISBN   978-3-319-55839-4.\n  Klutke, G.; Kiessler, P.C.; Wortman, M. A. (March 2003). &#34;A critical look at the bathtub curve&#34;.  IEEE Transactions on Reliability.  52 (1): 125–129.  doi: 10.1109/TR.2002.804492.  ISSN  0018-9529.", "posttime": "2020-10-29 17:59:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "浴缸,bathtub,产品", "title": "浴缸曲线", "title_en": "Bathtub Curve", "transed": 1, "url": "https://en.wikipedia.org/wiki/Bathtub_curve", "via": "", "real_tags": ["浴缸", "bathtub", "产品"]}, {"category": "", "categoryclass": "", "imagename": "90179618e17a826c1ebac7e34b92b9a7.jpg", "infoid": 1031962, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "法国最近出版的一本书警告说，数字设备正在严重影响儿童和年轻人的神经发育。\n这篇文章被称为数字白痴工厂，它是由法国国家卫生研究所研究主任米歇尔·德斯穆尔热(Michel Desmurget)撰写的。\n在接受BBC采访时，这本在他的国家成为畅销书的作品的作者保证，今天的年轻人是历史上智商低于上一代的第一代人。\n“研究人员在世界许多地方观察到，智商代代相传。这就是所谓的“弗林效应”，指的是描述这一现象的美国心理学家。但最近，这一趋势在几个国家开始逆转“，这位研究人员说。\n“在这些国家，数字原住民是第一批智商低于父母的孩子。这是挪威、丹麦、芬兰、荷兰、法国等国记录在案的趋势。“。\n虽然这一现象涉及的具体因素尚未确定，但已经证明，孩子在屏幕前度过的时间会对他们的智商产生重要影响。\n因此，根据作者的说法，当电视或视频游戏的使用量增加时，智商和认知发展往往会下降。\n这将直接影响我们智力的主要基础，如语言、注意力、记忆力和一般文化，最终将导致学习成绩大幅下降。\n根据Desmurget的说法，对屏幕和数字设备的依赖与家庭互动的质量和数量的下降有关，也与花在其他可以更丰富的活动上的时间减少有关。\n睡眠中断、对注意力的高估、智力刺激不足(大脑不能充分发挥其潜力)以及过度久坐的生活方式也与此有关。\n麻省理工学院(MIT)和加州大学(University Of California)的米歇尔·德斯穆尔热(Michel Desmurget)批评了当今儿童在数字设备前花费的大量时间。\n他解释说：“平均而言，2岁的孩子每天几乎要花3个小时，8岁的孩子大约要花5个小时，青少年则要超过7个小时。”\n“这就是说，我们的孩子在18岁之前，将在娱乐屏幕前度过相当于30个学年的时间，或者，如果你愿意，也可以是16年的全职工作！这简直是疯狂和不负责任的。“", "note_en": "A recently published book in France warns about how digital devices are seriously affecting the neural development of children and young people.\n The text is called  The digital cretin factory and it was written by Michel Desmurget, director of research at the French National Institute of Health.\n In an interview with the  BBC, the author of the work, which has become a bestseller in his country, assures that today’s young people are the first generation in history with a lower IQ than the previous one.\n “Researchers have observed in many parts of the world that IQ increased from generation to generation. This was called the ‘Flynn effect’, in reference to the American psychologist who described this phenomenon. But recently, this trend began to be reversed in several countries ”, says the researcher.\n “In those countries, digital natives are the first children to have a lower IQ than their parents. It is a trend that has been documented in Norway, Denmark, Finland, the Netherlands, France, etc. ”.\n Although the specific factors involved in this phenomenon have not yet been determined, it has been proven that the time a child spends in front of a screen would have an important effect on their IQ.\n Thus, according to the author, when the use of television or video games increases, IQ and cognitive development tend to decrease.\n This would directly affect the main foundations of our intelligence, such as language, concentration, memory and culture in general, which would end up causing a significant drop in academic performance.\n  According to Desmurget, dependence on screens and digital devices is associated with a decrease in the quality and quantity of family interactions, as well as a decrease in the time spent on other activities that can be more enriching.\n Sleep disruption, overestimation of attention, intellectual under-stimulation (the brain cannot unfold its full potential) and the adoption of an excessively sedentary lifestyle are also involved.\n Michel Desmurget, with studies at the Massachusetts Institute of Technology (MIT) and the University of California, criticizes the enormous amount of time that today’s children spend in front of digital devices.\n “On average, almost three hours a day for 2-year-olds, about five hours for 8-year-olds and more than seven hours for adolescents,” he explains.\n “This means that before reaching the age of 18, our children will have spent the equivalent of 30 school years in front of recreational screens or, if you prefer, 16 years of full-time work! It is simply crazy and irresponsible ”.", "posttime": "2020-10-29 17:59:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数字,natives", "title": "“数字原住民”的第一代智商比他们的父辈还低", "title_en": "'Digital natives' first generation with a lower IQ than their parents", "transed": 1, "url": "https://moneytrainingclub.com/2020/10/28/alarming-trend-between-digital-natives-and-their-iq-digital-trends-spanish/", "via": "", "real_tags": ["数字", "natives"]}, {"category": "", "categoryclass": "", "imagename": "8ef02f095e14896944da52f6c888432f.png", "infoid": 1031961, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从冠状病毒大流行以来，出现了大量的新冠肺炎应用程序。除了国家赞助的官方“追踪”和检疫监控应用程序外，数百个与Covid相关的应用程序也可以在iOS应用程序和Google Play商店下载，这些应用程序提供从精心策划的信息、临床护理指南和工作场所/校园疫情监控等各种服务。\n自3月份以来，我一直密切关注这些与Covid相关的iOS应用程序，汇编了一个涵盖98个国家近500个iOS应用程序的广泛数据集。准确地说，该数据集包含493个Covid相关应用，来自于2020年3月24日至2020年10月25日期间iOS应用商店对[Covid]和[CoronaVirus]的查询结果。\n应用商店查询结果进行了重复数据删除，以查看是否有应用程序被删除/移除(注意：到目前为止，我还没有发现iOS应用商店中列出的任何应用程序都是这种情况)。大多数应用程序都是新的；一些应用程序，特别是远程医疗和医疗类别的应用程序，似乎已经被重新调整用途，包括Covid特有的功能。\n我用大量的元数据丰富了应用程序，包括每个应用程序的请求权限、销售者/开发人员位置(国家、州和城市)、嵌入式SDK(Google Firebase、Google ADS、Facebook Audience Network、Branch等)，并将其编码为几个使用类别(筛选和报告、信息和更新、临床参考等)。根据应用程序的描述。任何有疑问的地方，我都会收集新闻报道和新闻稿。\n和我过去的努力一样，我希望这个全面的数据优先观点，包括我的第一个研究成果，一个广泛的Tableau数据可视化包，可以作为每个国家的记者、教师、学生、援助组织和公民的资源。我还希望这些数据能为公共当局、技术领袖和政策制定者提供另一种方式，让他们了解“流行病应用”新时代的巨大影响、设计和社会影响。\n这些数据是几个月的工作和数据复杂化的结果，几乎可以在任何浏览器中通过Tableau可视化进行交互式浏览和过滤：https://public.tableau.com/profile/d1gi#！/vizhome/CViOS_493/iOSSDKsbyAppandCountry。\n确保使用活动图表视图正上方的选项卡查看所有可视化效果。我还建议使用我在每个可视化的右侧添加的过滤器，以减少信息过载的数量并回答特定的查询。底层数据集应该很快就会以可下载的.csv的形式提供-我会更新这篇文章并在这里链接它。\n我在这里收集、分析和重新编译了493个应用程序的大量元数据和补充数据，提供了我认为是迄今为止最全面的“Covid相关”iOS应用程序市场快照，包括：\n换句话说，我多次查找每个应用程序-记录每个iOS开发者(“艺术家/卖家”)的城市、州/省(如果可用)和国家。我还使用了各种领先的付费和无偿工具，在少数情况下，我甚至亲自下载源代码，并在苹果的Xcode中重新编译应用程序，以验证iOS应用程序所请求的设备权限(参见下面的“更安全的伊利诺伊州”示例)。我做了同样的事情来定位嵌入到应用程序源代码中的所有已知SDK。\n对于SDK在数据可视化方面的细分，我主要关注iOS应用程序构建中包含的分析、应用程序性能和与跟踪相关的SDK。当您触摸和/或悬停在特定数据点上时，所有SDK以及其他字段(如应用描述、版本、发布日期、应用商店URL和流派)都会出现。\n一些应用的权限和SDK除了通过外国iOS应用商店和当地货币下载并安装在设备上之外，根本无法通过任何方法获得。我不想这样做，也没有时间去尝试，但这个数据集包含了绝大多数应用程序的所有权限和SDK。\n随着本月北半球Covid病例的急剧上升，我认为这一数据立即分享是很重要的，所以我将其公之于众。我还在写我的结果，所以我计划对这493个应用程序进行更尖锐的观察，其中大约一半属于“筛查和报告”类别，因此涉及个人健康数据、位置跟踪和跟踪以及症状报告。\n显示通过请求的设备权限促进的普及性数据收集。对于寻求访问设备摄像头、用户的照片和媒体库、联系人列表以及设备的精确GPS位置的非报告Covid相关的“信息和更新”应用程序来说尤其如此)；\n显示这些应用程序源代码中包含的已知应用程序开发工具包(也称为拖放)的覆盖范围，并拖放与复杂的跟踪、分析和性能报告相关的技术代码；以及。\n展示Covid相关iOS应用的全球、地区和特定国家/地区的出现情况，包括应用商店类型和发布日期。\n我已经广泛地将所有iOS权限和SDK编码并设置为颜色编码的可过滤矩阵，甚至包括类似iOS的权限图标，如摄像头访问和位置共享，以实现视觉清晰度。整个493个应用程序集可以在大多数Data Viz选项卡中以交互方式向下钻取和过滤-这意味着，尽管有大量信息，但可以按县、主要用途类别、开发人员位置以及特定权限和/或SDK组合(例如，“Location-Always”、“Bluetooth-Always”、“Photo Library”和“Facebook SDK”)轻松浏览数据集。\n例如，我过滤了各种使用类别的组合，看看只安装了谷歌广告(Google Adds)、Facebook受众网络(Facebook Audience Network)、分支机构(Branch)、城市飞艇(Urban Airship)和开放信号(Open Signal)等跟踪SDK的筛选和自我报告iOS应用程序。我还查找了所有使用Apple/Google Exposure Notification API的已知应用程序，并将其添加为应用程序权限矩阵可视化选项卡中的一个字段。目前有42个iOS应用程序使用Exposure API。\n剩下的留到后面，但这是一种深入的数据集，由于广泛的应用程序权限、SDK、使用类别编码以及开发人员/销售商的业务和位置查找，它需要数月时间才能构建。您可以随意使用这些数据；我唯一的要求是您在将来的工作、课堂作业中正式引用它，如果有任何进一步的见解和/或衍生作品发表，请参考/链接到这篇文章。\n下面我将转述几个关键的观察结果。(注意：所有这些图像都直接来自我的交互式数据可视化)。\n自2020年3月以来，Covid和/或CoronaVirus搜索显示的493个iOS应用程序中，有一半至少包含一个Google SDK。这个发行版似乎与使用类别(例如，筛选和报告)没有太大差异，但以下是我的数据库中所有应用程序的SDK摘要。\n对于iOS权限，493个Covid相关应用程序中，“位置-始终(以及使用时)”、相机和图片库是最受欢迎的请求。\n当然，应用程序和SDK请求的权限的性质因使用类别的不同而明显不同(我已将下面的图表包含在我的Covid相关应用程序可视化工作簿中)。\n地方、州和地区当局已经做出回应，推出了一系列官方应用程序，将居民和游客与资源联系起来-并确保有关大流行的更新和指导方针是及时和准确的。\n在大多数情况下，这些应用程序有两个关键功能：第一，作为筛查和自我报告症状的工具，第二，作为实时分布式病例监测和警报的手段。\n这一数据还表明，美国的大学迅速推出了自己的Covid跟踪和报告应用程序，以应对大流行。这些应用程序有时是公共卫生和计算机科学系合作的结果，另一些时候这些应用程序似乎是一群附属但基本上独立的教职员工的作品。\n此外，还有“更安全的伊利诺伊州”应用程序，支持整个大学的建筑访问、学生筛选/报告和本地Covid测试工作。\n这一次，由于大流行的长期性和全球性，公共卫生当局和政策制定者再次陷入新的伦理困境，涉及通过大规模跟踪和数据监测控制疫情。\n我根本不记得全球公共传播渠道曾经如此法制化和平台化。我这么说的意思是，2020年标志着一个阶段--毫不夸张地说，数百家公共卫生机构和政府沟通渠道同时将他们的努力集中在两个严格控制的商业市场上：苹果的iOS和谷歌的Play商店。\n更不用说这些iOS应用中至少有一半的代码基础设施(SDK)是由其中一家公司(Google)构建的。当然，世界各地的政府-到目前为止有98个-都是由同样的两家公司构思、建造和分发的蓝牙暴露通知系统。\n就互联网在危机时期的效用而言，我们以前也经历过这样的情况：9/11标志着公众开始采用工具，即谷歌的搜索引擎，以绕过媒体和信息守门人。当公民在9/11灾难事件最严重的时候寻找新闻时，他们会求助于一种新颖、相对陌生的工具来寻找细节，核实他人说法的准确性，并解读手头这场悲剧的含义。\n然而，2020年是一只完全不同的野兽。首先，我认为这标志着9/11废除的集中把关的回归。\n最重要的是重新建立这种把关的方式。它嵌入到设备的结构中，嵌入到支持设备上运行的应用程序的代码中，嵌入到设备上运行的应用程序中，嵌入到用于分发应用程序的市场中，以及政府用来跟踪、监测和追踪流行病的基础设施中。\n上面的故事写于2020年5月。考虑到我找到的权限，我怀疑这些州有多少需要担心的。\n虽然9/11和2020年代表着激发了分散的互联网效用和数字通信工具的力量的事件，但2020年的大流行似乎明确地将力量平衡拉回到了中央集权的机构-不是政府，而是两家美国跨国科技公司。\n长期以来，人们一直以创造性的方式利用编程-包括开发SETI等应用程序，以及在笔记本电脑和移动设备中众包加速度计作为地震传感器-并在危机事件期间获得实时信息。然而，这一次，到目前为止，至少有98个国家利用商业平台获得关于其公民健康状况的关键实时信息。\n但他们之所以能做到这一点，只是因为这些公司首先建立了生态系统、基础设施、市场-当然还有允许/批准他们的应用程序。\n从公民到中央机构和当局的信息流现在完全通过两家美国跨国技术集团建造的基础设施进行。没错：两家公司。不过，这并不是要抨击苹果和谷歌。两人都以尚不能理解的方式为社会做出了贡献。\n相反，我想指出，这些数据有助于表明，新冠肺炎标志着在大规模危机期间，地方、地区和国家当局分发和收集公民数据的方式发生了全球转变。我们不知道政策何时会改变-他们会改变-以方便其他用途。\n冠状病毒时代的应用程序：重要的是信息流的互惠性质。随着指导方针的演变，关于新冠肺炎的最新信息被分发给公民、居民、游客和医疗提供者，这些人的信息通过恰好两个技术平台同时回流到公共机构、公共机构、地区当局和私人研究机构。这一次，它甚至被编入了全球公共卫生API。", "note_en": "Since the Coronavirus pandemic began, a host of Covid-19 applications have emerged. In addition to the state-sponsored official “track and trace” and quarantine monitoring apps, hundreds of Covid-related apps offering everything from curated information, clinical care guidelines, and workplace/campus outbreak monitoring have become available for download in the iOS App and Google Play Stores.\n Since March, I’ve followed these Covid-related  iOS apps closely, compiling an extensive data set representing almost  five hundred iOS apps across  98 countries. The data set, containing 493 Covid-related apps to be exact, is derived from the results of iOS app store queries for [Covid] and [Coronavirus] between March 24, 2020 and October 25, 2020.\n The app store query results were deduplicated to see if any apps have been deleted/removed (note: so far, I haven’t found this to be the case for any app listed in the iOS store). Most of the apps are new; some, especially in the telemedicine and medical care categories, appear to have been repurposed to include Covid-specific features.\n I enriched the apps with extensive metadata, including each application’s requested  permissions, the seller/developer  location (Country, State, and City), the embedded  SDKs (Google Firebase, Google Ads, Facebook Audience Network, Branch, etc.), and coded into several  use categories (Screening and Reporting, Information and Updates, Clinical Reference, etc.) based on the app descriptions. Where there was any doubt, I gathered news coverage and press releases.\n As with my past efforts, I hope this comprehensive data-first view, including my first research output, an extensive Tableau data visualization package, acts as a resource for journalists, teachers, students, aid organizations, and citizens in every country. I also hope this data offers public authorities, tech leads, and policymakers another way to understand the massive reach, design, and societal impact of the new era of “pandemic apps.”\n  The data—the result of months of work and data complication—can be interactively explored and filtered in almost any browser via the  Tableau visualization:  https://public.tableau.com/profile/d1gi#!/vizhome/CViOS_493/iOSSDKsbyAppandCountry\n Make sure to view  all the visualizations using the tabs directly above the active chart view. I also recommend using the filters I’ve added on the right of each visualization to reduce the amount of information overload and to answer specific queries. The underlying dataset should be available as a downloadable .csv soon—I’ll update this post and link it  here.\n I’ve collected, analyzed, and re-compiled a vast cross-section of metadata and supplemental data for 493 apps here, offering what I believe is easily the most comprehensive “Covid-related” iOS app marketplace snapshot to date, including:\n  To put it another way, I looked up   every app multiple times—recording the city, the state/province (when available), and country for each one of the iOS developers (“artists/sellers”). I also used a variety of leading paid and unpaid tools, and in a few cases went so far as to download the source code myself and recompile the app in Apple’s Xcode to verify the device permissions requested by iOS applications (see “Safer Illinois” example below). I did the same to locate all the known SDKs embedded within the app’s source code.\n  For the SDK breakdowns in the data visualizations, I was primarily concerned with the analytics, app performance, and tracking-related SDKs included in the iOS application build. As you touch and/or hover over specific data points,   all of the SDKs, and additional fields such as the app description, version, release date, app store URL, and genre will appear.\n  The permissions and SDKs for some apps simply could not be obtained through any method other than actually downloading and installing them on a device through a foreign iOS app store and local currency. I didn’t want to do this, nor did I have the time to try it, but this dataset contains all of the permissions and SDKs for the vast majority of apps.\n      With the  sharp rise in Covid cases in the Northern Hemisphere this month, I believe this data is important to share immediately, so I’m publishing it. I am still in the process of writing up my results, so I plan to follow up with more acute observations about these  493 applications, approximately half of which fall into the “Screening and Reporting” category and therefore involve personal health data, location tracking and tracking, and symptom reporting.\n  Show the  pervasive data collection facilitated through requested  device permissions. This is especially true for non-reporting Covid-related “information and update” apps that seek access to the device camera, the user’s photo and media libraries, contact lists, and the device’s precise GPS location);\n Show the reach of  known application SDKs included in the source code of these apps—aka drag-and drop tech code associated with sophisticated tracking, analytics, and performance reporting; and\n Show the  global, regional, and country-specific emergence of the Covid-related iOS apps, including by app store genre and the release date.\n I’ve  extensively coded and set  all of the iOS permissions and SDKS into color-coded filterable matrices, even including iOS-like icons for permissions like camera access and location sharing for visual clarity. This entire set of 493 apps can be interactively drilled down and filtered in most of the data viz tabs—meaning that despite the large amount of information, the dataset can be easily explored by county, primary use category, developer location, AND specific permissions and/or SDK combinations (e.g., “location — always,” “Bluetooth — always,” “Photo Library,” and “Facebook SDKs”)\n For instance, I have filtered various combinations of use categories to look at the screening and self-reporting iOS apps that only have embedded tracking SDKs like Google Ads, Facebook Audience Network, Branch, Urban Airship, and Open Signal installed. I’ve also looked up   every  known application  that uses the  Apple/Google Exposure Notification API and added this as a field in the app permission matrix visualization tab. There are 42 iOS apps that currently utilize the Exposure API.\n I’ll save the rest for later, but this is a deep-dive kind of dataset that took months to build because of the extensive app permissions, the SDKs, the use category coding, and the developer/seller business and location lookups. Feel free to use this data as you wish; my only request is that you formally cite it in your future work, class assignments, and kindly reference/link to this post if any further insights and/or derivative work is published\n I will relay a few key observations below. (Note: all of these images are directly from my interactive data visualizations)\n  Out of the 493 iOS apps that have appeared from Covid and/or Coronavirus searches since March 2020,   half contain at least one Google SDK. This distribution does not appear to vary much by use category (e.g., Screening and Reporting), but here is what the SDK summary looks like for  all of the apps in my database.\n    For iOS permissions,  “Location — Always (and When in Use),” Camera, and Photo Library were the top requests across the 493 Covid-related apps.\n Of course, the nature of the permissions requested by the application and the SDKs clearly vary by use category ( I’ve included the chart below in my Covid-related app visualization workbook).\n  Local, state, and regional authorities have responded with a flurry of official apps to connect their residents and visitors with resources—and to ensure updates and guidelines about the pandemic are timely and accurate.\n In most cases, the apps serve two critical functions: first, as tools for  screening and self-reporting symptoms, and second, as a means for  real-time distributed case monitoring and alerts.\n What this data also shows is that universities in the United States quickly have launched their own Covid-tracking and reporting apps in response to the pandemic. These apps were sometimes the result of partnerships between public health and computer science departments, and other times the apps appear to have been  the work of a group of affiliated but largely independent faculty members.\n  And then there’s the Safer Illinois”app supporting an entire university’s building access, student screening/reporting, and local Covid testing efforts.\n   Yet again, this time due to the prolonged and global nature of the pandemic, public health authorities and policymakers have been launched headfirst into new ethical dilemmas involving outbreak control through mass tracking and data monitoring.\n  I simply do not remember a time when   global  public communication channels have been so codified and platformitized. By this, I mean that 2020 marks the stage—quite literally—when hundreds of public health agencies and government communication channels simultaneously collapsed their efforts into exactly  two tightly controlled  commercial marketplaces: Apple’s iOS and Google’s Play stores.\n Not to mention the code infrastructure (SDKs) for at least  half of these iOS apps has been built by one of the companies (Google). And of course the Bluetooth exposure notification system that governments around the world us—98 of them so far—has been conceived, built, and distributed by the same two companies.\n As far as the internet’s utility during times of crisis is concerned, we’ve been here before, sort of: 9/11 marked the dawn of the public adopting tools—namely Google‘s search engine—to bypass media and information gatekeepers. When citizens sought news around the height of the 9/11 disaster events, they turned to a novel, relatively unfamiliar tool in their quest to locate details, verify the accuracy of claims made by others, and interpret the implications of the tragedy at hand.\n 2020, however, is an entirely different beast. For one, I’d argue it marks the  return of the centralized gatekeeping that 9/11 abolished.\n  What’s most important is the manner in which this gatekeeping has been re-established. It’s embedded in the very fabric of the devices, the code supporting the apps that run on the devices, the applications that run on them, the marketplaces that are used to distribute them, and the infrastructures used by governments to track, monitor and trace the pandemic.\n  The story above was written in May 2020.  Given the permissions I found, I doubt the states much to worry about.\n Whereas 9/11 and 2020 represent events that galvanized the utility of the decentralized internet and the power of digital communication tools, the 2020 pandemic seems to have pulled the balance of power decidedly back to centralized institutions—not governments, but two multinational American technology companies.\n People have long utilized programming in creative ways—including developing apps such as  SETI and crowdsourcing  accelerometers in laptops and mobile devices to act as earthquake sensors—and obtain real-time information during crisis events. This time around, however, at least 98 countries to date have harnessed commercial platforms to obtain critical real-time information about their citizens’ health status.\n But they can do this only because the companies have built the ecosystem, infrastructure, marketplace — and of course, allow/approve their app — in the first place.\n  The flow of information from citizens to centralized institutions and authorities now occurs exclusively through the infrastructures built by two American multinational technology conglomerates. That’s right: two companies. This really isn’t meant to be a diatribe about Apple and Google, though. Both have made contributions to society in ways that will still have yet to understand.\n Rather, I want to suggest that this data helps to show that Covid-19  marks a  global shift in the way local, regional, and national authorities distribute and collect data about their citizens during large-scale crises. And we have no idea when the policies will be changed—and they will—to facilitate other uses.\n  Apps in the time of the Coronavirus: it’s the  reciprocal nature of the information flows that matter. As guidelines evolve and updates about Covid-19 are distributed to citizens, residents, tourists, and medical providers, information about those same individuals simultaneously flows back to public institutions, public agencies, regional authorities, and private research through exactly two tech platforms. And this time around, it’s even been codified into a global public health API.", "posttime": "2020-10-29 17:10:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,程序,ios,应用程序,related", "title": "查看98个国家/地区的493个与COVID相关的iOS应用程序，包括每个应用程序的权限请求、开发者位置和嵌入式SDK，按类别排序", "title_en": "A look at 493 COVID related iOS apps across 98 countries including each app's permissions requests, developer location and embedded SDKs, sorted by categories", "transed": 1, "url": "https://d1gi.medium.com/the-pandemic-app-ecosystem-investigating-493-covid-related-ios-apps-across-98-countries-cdca305b99da", "via": "", "real_tags": ["开发", "程序", "ios", "应用程序", "related"]}]