[{"category": "", "categoryclass": "", "imagename": "20b236a41cdfe430aa8a9da0510a465a.jpg", "infoid": 1028091, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周早些时候，美国环保署公布了对北极星2号的电动范围的调查结果，证明它一次充电可以行驶233英里。这比竞争对手的特斯拉Model 3充电少了大约90英里。点击这里阅读我们的早期印象。\n在美国环保署发布射程指引后不久，北极星首席执行官托马斯·英根拉斯(Thomas Ingenlath)在TechCrunch Sessions：Mobility上发表了讲话。简而言之，他说，北极星知道司机看到的现实世界的结果超出了EPA的范围。\nIngenlath说：“我们知道这辆车在现实中的用途。”“我们知道，在现实中，看起来可能有很大不同的东西，在现实生活中并没有太大的不同。我们认为，作为一辆电动汽车，这对日常生活来说绝对足够了。这是我们的一个版本，我们将在北极星2上添加不同的变种，这将会有更高的EPA[评级]。我认为(这一系列)绝对处于与之竞争的电动汽车的水平，这对你一年365天都有好处。“。\n英根拉斯承认，他的公司在射程上没有击败特斯拉，但鼓励在现实世界中进行并排比较。在纸面上看起来有很大差别的东西，实际上却少得多。他说，一个更远距离的版本即将问世。\nIngenlath说：“明年，也就是2021年，我们的计划是推出一款单一的汽车版本。”“当然，这将用同样的电池提供更好的续航里程。当然，在此过程中，我们将对软件进行改进，用同样的千瓦时电池提高效率。\n“我们在旅途中，”他说。“这就是我们开始的地方，情况会逐月好转。”\nIngenlath还谈到了北极星2最近因驾驶时突然停车而全面召回的问题。“这种情况发生在非常非常罕见的情况下，”他说，并补充说，市场上只有2200架北极星2，而且报告的情况都没有发生在美国。没有一辆受影响的车辆发生事故。\nIngenlath说：“我们有很多东西需要学习，作为一家公司，我们需要改进。”“我们是一家刚刚起步的公司。当然，你也不能指望一切都能顺利进行。我们必须改进，我们的客户必须与我们一起前进。事实上，汽车行业很早就进行召回，以确保没有人陷入问题，我认为这真的是一个很高的标准。“。\n他说，他不认为提前召回有什么大问题。相反，他说，他现在专注于确保公司在与北极星2号车主围绕召回进行互动时，在客户服务方面出类拔萃。", "note_en": "Earlier this week, the EPA released its findings on the Polestar 2’s electric range, certifying it as capable of traveling 233 miles on a charge. That’s about 90 miles less on a charge than the competing  Tesla   Model 3.  Read our early impressions here.\n  Polestar CEO  Thomas Ingenlath   spoke at TechCrunch Sessions: Mobility shortly after the EPA released its range guidance. In short, he said Polestar knows drivers see real-world results that exceed the EPA’s range.\n “We know what the car does in reality,” Ingenlath said. “We know in reality, what might look like a very big difference, is not that much of a difference in real life. We think it’s definitely sufficient for day-to-day life as an EV. It’s one of our versions, and we will be adding different variants to the Polestar 2 that will have a higher EPA [rating]. I think [the range] is absolutely in the ballpark of competing EVs that is really good for you 365 days a year.”\n  Ingenlath concedes his company is not beating Tesla in range, but encourages side-by-side comparisons in the real world. What looks like a large difference on paper is much less in practice. And he says a longer-range version is on the way.\n “Next year, in 2021, we have in our plans to come out with a single motor version,” Ingenlath said. “This will, of course, provide a better range with the same battery. And, of course, along the way, we’ll have software improvements that will give more efficiency with the same kilowatt-hours battery.\n “We are on a journey,” he said. “That is where we start, and it will get better from month to month.”\n Ingenlath also addressed the Polestar 2’s recent full recall over vehicles that abruptly stopped while driving. “This happened in very, very rare cases,” he said, adding there are only 2,200 Polestar 2’s on the market, and none of the reported cases happened in the United States. None of the affected vehicles were involved in an accident.\n  “We have many things to learn, and as a company, improve,” Ingenlath said. “We are a startup that’s fresh out. And of course, you cannot expect everything to go smoothly. We have to improve, and our customers have to be with us on the way. And I think it’s a really great standard that the car industry, actually, does very early recalls to make sure no one gets into a problem.”\n He says he doesn’t see a big issue with the early recall. Instead, he says, he’s now focusing on ensuring the company excels at customer service when interacting with a Polestar 2 owner around the recall.", "posttime": "2020-10-11 17:03:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "北极星,polestar", "title": "\n北极星CEO为北极星2号召回和233英里EPA评级辩护", "title_en": "\n\t\t\t\tPolestar CEO defends the Polestar 2’s recall and 233-mile EPA rating\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/09/polestar-ceo-defends-the-polestar-2s-recall-and-233-mile-epa-rating/", "via": "", "real_tags": ["北极星", "polestar"]}, {"category": "", "categoryclass": "", "imagename": "a9d1cc552dde350ff49cbfde03bf05fc.jpg", "infoid": 1028090, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为小奥德尔·贝克汉姆(Odell Beckham Jr.)。他第一次与游戏超级明星无礼博士进行直播时，转向Mojichat创建了一个弹出式屏幕表情，它在定制控制器零售商飞毛腿游戏(Scuf Gaming)的标志上方跳舞。\n定制的品牌表情是公司试图让直播者更容易从节目中赚钱的方式之一。Mochjichat等公司辩称，对于游戏玩家来说，这是一个更优雅的解决方案，因为它不会让观众离开直播流，因为他们可能会错过一些动作。\nMojichat联合创始人杰里米·格林(Jeremy Greene)表示，通常情况下，流媒体依赖于滚动前、滚动中和滚动后广告的广告收入。格林和他的妻子珍妮尔一起把莫吉查特打造成了阿凡达开发界最重要的名字之一。随着竞争对手的涌入，该公司一直在使其产品多样化，以允许有影响力的人开始将他们的数字化身作为货币化来源。\n“无拖缆…。想要进行一次预演，“格林说。“Mojichat从一开始就让我们非常成功的第一件事是，你必须找个人为你定制表情。”\n今年早些时候，该公司与DoorDash合作举办了一场类似的音乐会，为男孩女孩俱乐部筹集资金，这是一项广泛的名人努力的一部分，目的是筹集资金，以缓解受新冠肺炎疫情影响的家庭的粮食不安全问题。\n格林在谈到之前的激活时说：“每当有人发送通讯信息时，都会触发一个警报，以Mojichat动画的形式漂浮在屏幕顶部。”\nGreene描述这项服务的方式-以及Janelle和他对公司的更大愿景-是成为直播市场的下一代AdServer。\n“我的计划是成为所有Unity的化身解决方案，”Greene早些时候告诉我。我们将把我们的平台提供给每一个单独的游戏平台或移动开发者，让他们即插即用…。我会认为我们是…。我们就像直播领域的谷歌Admob。\n像Streamlabs这样的公司正在将Mojichat的功能整合到他们的流媒体服务中。以及与无礼博士和小奥德尔·贝克汉姆的合作。显示对这些类型的产品有多大的需求。\n格林说：“阿凡达空间将在游戏社区赢得。”\nMojichat目前已经有12000名流媒体用户使用这项技术，通过今年早些时候签署的合作伙伴关系，该公司预计将通过这项服务推送更多广告。\n格林说：“没有人想每天在溪流上坐15个小时。”\n“流媒体不能像YouTubers…赚那么多钱，这真的是错误的。拖缆可能会在Twitch上花费一整天的时间，他们被迫运行这些预卷…。[同时]杰克·保罗可以上传一段视频到Youtube，赚300,000美元的…。这就是我建造莫吉查特…的真正原因。我想让游戏玩家的生活更轻松…。我们将为游戏玩家打造定制软件，让他们的生活变得更轻松。“", "note_en": "As Odell Beckham Jr.  did his first live stream with the gaming superstar Dr. Disrespect, he turned to Mojichat to create the pop-up onscreen emote that danced above a logo from  Scuf Gaming, a retailer of customized controllers.\n Customized, branded emotes are one of the ways that companies are trying to make it easier for live-streamers to make money off of their shows. Companies like Mochjichat argue that it’s a more elegant solution for gamers to use, because it doesn’t take viewers away from the live stream, where they could potentially miss some of the action.\n   Typically, streamers rely on advertising revenue from pre-roll, mid-roll and post-roll advertising, according to  Mojichat   co-founder Jeremy Greene. Alongside his wife, Janelle, Greene built Mojichat into one of the premier names in avatar development. As competitors crowded in, the company has been diversifying its products to allow for influencers to begin using their digital avatars as a monetization source.\n “No streamer… wants to run a pre-roll,” said Greene. “The first thing about Mojichat that made us very successful from the very beginning, you have to hunt down someone to make your custom emotes for you.”\n Earlier this year, the company partnered with  DoorDash   on a similar activation for a concert to raise money for the Boys and Girls Club as part of a broad celebrity effort to raise money to alleviate food insecurity for families affected by the COVID-19 outbreak.\n “Any time someone sends a communication, that will trigger an alert that floats as a Mojichat animation on top of the screen,” Greene said of the earlier activation.\n The way that Greene describes the service — and Janelle and his larger vision for the company — is to be the next generation of adserver for the live-streaming market.\n “My plan is to become the avatar solution for all of Unity,” Greene told me earlier. “We will offer up our platform to every single gaming platform or mobile developer to plug and play… I would consider us… we’re like the Google Admob for live stream.”\n Companies like  Streamlabs are integrating Mojichat’s features into their streaming offerings. and the work with Dr. Disrespect and Odell Beckham Jr. show just how much demand there is for these types of offerings.\n “The avatar space is going to be won in the gaming community,” Greene said.\n Mojichat   already has 12,000 streamers using the technology right now, and through a partnership inked earlier this year the company expects to push more ads through the service.\n “Nobody wants to sit on a stream for 15 hours a day,” said Greene.\n “It’s really wrong that streamers can’t make as much money as YouTubers… a streamer can spend all day on Twitch and they are forced to run these pre-rolls… [meanwhile] Jake Paul can upload a video to YouTube and make $300,000… T hat’s really why I built Mojichat… I wanted to make gamers’ lives easier… We are going to build custom software for gamers that makes their lives easier.”", "posttime": "2020-10-11 17:03:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,就职,beckham", "title": "\n小奥德尔·贝克汉姆(Odell Beckham Jr.)。在Mojichat的就职直播中转向他的广告特色", "title_en": "\n\t\t\t\tOdell Beckham Jr. turned to Mojichat’s advertising features during his inaugural live-stream\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/09/odell-beckham-jr-turned-to-mojichats-advertising-features-during-his-inaugural-live-stream/", "via": "", "real_tags": ["广告", "就职", "beckham"]}, {"category": "", "categoryclass": "", "imagename": "60d406c200320aef69c0812ec83a0e43.jpg", "infoid": 1028088, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们还谈到了伙伴关系。具体地说，我们想知道，向一家年轻的初创公司索要信息-甚至可能对其进行投资-的公司利维坦是真正的朋友还是敌人。\n我们从风投公司的感觉是，移动初创公司已经别无选择，只能与规模更大、资金更雄厚的公司合作。\n例如，布伦南向自动穿梭公司梅·莫比尔(May Mobility)开出了首批支票之一，并成为该公司的第一位董事会成员。他表示，该公司在2017年成立时，曾面临众多工程和运营挑战，有单打独斗的雄心。当时，其他公司也在世界上运营，显然计划保持独立，包括自动驾驶软件初创公司Cruise Automation和NuTonomy。\n今天，Cruise现在是通用汽车的子公司，NuTonomy在推出四年后出售给了汽车供应商德尔福(Delphi)。布伦南说：“如果你今天要[推出]一项结构化的机器人出租车服务，没有一个大的制造合作伙伴真的很难做到。”事实上，他接着指出，去年12月，丰田汽车公司(Toyota Motor Corp.)在5月份的Mobility公司牵头进行了一轮5000万美元的B系列融资，建议与会者“继续关注”这一合作伙伴关系的成果。\n顾同仁同意“合作伙伴结构”是初创企业的前进道路，并在活动期间列举了许多原因，包括汽车领域的许多较大公司在大流行期间继续近乎快速地工作这一事实。她提到了赫米投资组合中的一家公司Ample，这是一家致力于电池交换技术的初创公司，最近宣布与优步(Uber)合作(优步承诺到2040年成为零排放平台)。", "note_en": "We also talked partnerships. Specifically, we wanted to know how one determines whether a corporate leviathan that asks for information from a young startup — and maybe even invests in it — is really a friend or foe.\n Our sense from the VCs is that mobility startups no longer have a choice but to partner with bigger and deeper-pocketed companies.\n For example, Brennan wrote one of the first checks to autonomous shuttle company  May Mobility   and became its first board member. He suggested that the company, which has faced numerous  engineering and operational challenges, had ambitions of going it alone when it was founded in 2017. At the time, other companies were operating in the world with apparent plans to remain independent, including self-driving software startups Cruise Automation and NuTonomy.\n  Today, Cruise is now a  subsidiary of GM, and NuTonomy  sold to automotive supplier Delphi four years after it launched. “If you were to [launch] a structured robo-taxi service today, it’s really hard to do without a big manufacturing partner,” said Brennan. Indeed, he went on to note that last December, Toyota Motor Corp. led a $50 million Series B round in May Mobility, advising attendees to “stay tuned” for the fruits of that partnership.\n Gu agrees the “partner structure” is the path forward for startups and during the event cited numerous reasons why, including the fact that many of the larger companies in the automotive space have continued work nearly apace during the pandemic. She pointed to one of Hemi’s portfolio companies,  Ample, a startup working on a battery-swapping technology that recently announced a partnership with Uber (which has committed to becoming a  zero-emission platform by 2040).", "posttime": "2020-10-11 17:02:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,移动,mobility", "title": "\n顶级移动风投谈与亚马逊等巨头合作的风险和回报", "title_en": "\n\t\t\t\tTop mobility VCs on the risks and rewards in partnering with giants like Amazon\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/09/top-mobility-vcs-on-the-risks-and-rewards-in-partnering-with-giants-like-amazon/", "via": "", "real_tags": ["amazon", "亚马逊", "移动", "mobility"]}, {"category": "", "categoryclass": "", "imagename": "96ffa89e744e6e3db948319df2d195e9.jpg", "infoid": 1028086, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "施特劳贝尔不喜欢自我推销，甚至不喜欢做进度报告。他的个人推特账号，也不是专门为他的初创公司红木材料(Redwood Materials)开设的账号，甚至都没有发过推特。而且他确实喜欢在复杂的问题上辛辛苦苦。\n但他的低调表现混淆了他对红木材料(Redwood Materials)的雄心和计划，红木材料是他在2017年与人共同创立的回收初创公司。施特劳贝尔设想并正在积极努力，使Redwood成为世界上主要的电池回收公司之一，在全球拥有许多战略上分散的设施。\n周三，斯特劳贝尔在TechCrunch的虚拟舞台TC Sessions：Mobility上说：“这是一个主要行业，也是一个主要问题，这也是我想把时间花在这上面的很大一部分原因。”“我想做一些能真正对世界可持续发展产生实质性影响的事情。要做到这一点，你需要规模。因此，我非常高兴能继续发展，即使不是世界上最大的电池回收公司之一，也是其中之一。最终成为世界上最大的电池材料公司之一。“。\n这家总部位于内华达州卡森城的公司由施特劳贝尔经营，目标是创建一个循环供应链。该公司有一个企业对企业的战略，回收电池生产中的废料，以及手机电池、笔记本电脑、电动工具、电力库、滑板车和电动自行车等消费电子产品。Redwood从消费电子公司和松下(Panasonic)等电池制造商那里收集废料。然后，它对这些废弃的商品进行加工，提取通常被开采的钴、镍和锂等材料，然后将这些材料供应回松下和其他客户。红木材料有很多客户，只是公开披露它正在与松下和亚马逊合作。\n虽然红木材料是一家B2B公司，但它的商业模式有朝一日可能会演变。人们对斯特劳贝尔的兴趣如此之高，以至于斯特劳贝尔现在正在考虑是否也应该扩展到更面向消费者的业务。红杉可能永远不会提供收集网站，消费者可以在那里放下旧的智能手机和其他消费电子产品。然而，当地政府官员的询问数量，以及寻找回收电子产品(包括电动汽车中的电池)选择的消费者，促使斯特劳贝尔至少考虑了这种可能性。\n已知的是，斯特劳贝尔看到许多工厂-可能有几十个-在地区建立起来，在某些情况下，如果客户足够大，还会与工厂共处一地。该公司尚未披露这些未来的设施将设在哪里。\n该公司在卡森市有两个回收和加工设施。虽然这很难让它有资格成为世界上最大的电池回收公司之一，但Redwood已经在以“千兆瓦规模”运营。\n他说：“我们一直能够以极快的速度增长，并提高产能，我预计这将大致赶上锂离子生产的规模，落后几年。”\n将施特劳贝尔的话放在上下文中，看看松下与特斯拉在内华达州斯帕克斯运营的GigaFactory。今天，该工厂有能力每年生产35千兆瓦时的锂离子电池。如果施特劳贝尔达到他所追求的规模，雷德伍德将为松下提供足够的材料来与其产能相匹配。实现这一目标将从根本上改变松下的供应链，从已经开采的矿物转向红木回收的矿物。这些回收材料将来自松下的生产废料以及其他消费电子产品来源。\n北美Panasonic Energy负责电池技术的副总裁Celina Mikolajczak表示，该公司忽视回收供应是愚蠢的。\nMikolajczak在TC Sessions：Mobility与Straubel的联合采访中说：“我们已经从地下挖出了这些金属，我们把它们放在细胞里，它们就坐在那里。”“是的，处理电池有点困难，它们的加工过程与典型的金属矿石略有不同，对吧，但同时，我们需要的金属浓度比典型的金属矿石高得多。因此，积极进行回收是完全有意义的，因为世界上已经有很多这样的电池了。“。\n今天，智能手机和其他消费电子产品中使用的大多数锂离子电池没有得到回收，相反，要么被遗忘在车主的垃圾抽屉里，要么进入垃圾流，最终进入垃圾填埋场。可以说，电动汽车的保质期要长得多。但最终，电动汽车使用的电池将给汽车制造商以及与垃圾作斗争的社区带来挑战。\n斯特劳贝尔希望红杉也能成为电动汽车电池报废解决方案的一部分。\n施特劳贝尔说：“第二次生命的问题以及这些电池是如何回收的，这真的很有趣，关于电池如何进入整个第二次应用，有很多不同的想法。”他指出，雷德伍德并没有直接致力于第二次生命的使用案例。“如果我们能通过在一段时间内重复使用这些设备，获得更多有用的寿命，这是很棒的，但这只会推迟不可避免的事情；它们最终需要一个适当的处置和回收解决方案。”\n有许多汽车制造商谈到了将电动汽车电池重新用于储能。但关于OEM如何从消费者手中夺回这些电池的细节还很少。施特劳贝尔希望红木成为一家独立的公司，这样它就可以与所有生产电动汽车的OEM合作，并在整个行业提供材料。\n红木从未公开谈论过它可能或已经在与哪些汽车制造商合作。然而，纵观电动汽车的版图，一些可能的合作伙伴出现了。例如，电动汽车初创公司Rivian从未宣布过直接与红木材料合作的计划。但作为投资者和客户，这两家公司确实分享了亚马逊。里维安首席执行官RJ·斯卡林格和施特劳贝尔不仅相互认识，而且有着共同的愿景。\n斯卡林格谈到了二次生命电池的计划-尽管还没有太多细节-以及电池寿命结束时会发生什么。里维安今天没有任何车辆上路，所以这似乎是一个遥远的问题。这种情况将在2021年发生变化，届时该公司将向消费者市场推出电动皮卡和SUV，以及向亚马逊推出电动面包车。最终，里维安获得了向亚马逊交付10万辆电动面包车的合同。\n斯卡林格上个月在彭博社绿色峰会(Bloomberg Green Summit)上接受采访时表示：“我对JB(施特劳贝尔)正在做的事情感到非常兴奋，因为我们希望这些车辆成为原料，这些车辆的电池可以作为原料，开始另一套电池和电动汽车的另一个生命周期。”斯卡林格在接受彭博社绿色峰会(Bloomberg Green Summit)采访时表示，他与施特劳贝尔和亚马逊全球最后一英里船队和产品总监罗斯·拉奇(Ross Racche)一起参加了一个小组讨论。“将其本质上作为一个封闭的生态系统进行控制的能力，使我们能够在整个行业不仅开始转向电气化，而且开始转向不同的消费方式时，学习并建立起对这一点的肌肉记忆。”\n施特劳贝尔说，他对让红木材料上市不感兴趣，当然短期内也不感兴趣。\n施特劳贝尔在谈到特斯拉的公众地位时说：“不管是好是坏，作为一家上市公司，我在效率较低的部分都坐在前排。”“这不是我急着要去做的事。我认为，在某种程度上，公开上市就等同于成功，这真的没有什么意义。“。\n他说，他的目标是让红杉产生影响，在工业规模上做一些有意义的事情，并产生回报-也就是盈利。\n施特劳贝尔说：“这不是关于迅速上市，或者，你知道，试图给投资者带来快速回报，或者诸如此类的事情。”“这才是我真正想花时间做的事情。我认为这是一项非常长期的增长任务，可能会持续数十年。“。\n斯特劳贝尔谈了很多关于规模的问题，既有他对红木的愿景，也有美国消费者垃圾抽屉里电子垃圾的现状。正是GigaFactory的规模，松下(Panasonic)用来制造电池，特斯拉(Tesla)用来为其车辆制造电池组和电动机，这在一定程度上推动了斯特劳贝尔从一开始就创办了Redwood。\n“随着世界交通电气化，它需要如此多不同的材料，而工厂上游的供应链，我认为，往往得不到重视，”他说。“巨型工厂有点像一座冰山--在供应商、矿山和炼油厂以及所有需要注入的不同东西中，有太多的东西隐藏在表面之下，这是你通常看不到的。”\n他补充说，随着巨型工厂的扩张，供应链的部分部分变得更成了瓶颈。\n“你肯定看到特斯拉更加关注这一点，我认为是正确的，”Straubel说，这是对马斯克最近关于需要关注镍等更广泛的材料供应链的公开评论的认可.。“这是一个非常有趣的领域，我认为这个领域没有得到那么多的关注、报废和回收，因为材料供应链的一部分只是一个令人难以置信的强大空间，我认为我们可以在这个领域对制造电池的可持续性产生重大影响。”", "note_en": "Straubel isn’t prone to self-promotion, or even progress reports. His personal Twitter account, nor the one dedicated to his startup,  Redwood Materials,   has ever even tweeted. And he does like toiling away on complex problems.\n But his understated delivery obfuscates his ambitions and plans for Redwood Materials, the recycling startup that he co-founded in 2017. Straubel envisions and is actively working to make Redwood one of the world’s major battery recycling companies, with numerous facilities strategically scattered throughout the globe.\n “This is something that is a major industry and a major problem, and it’s a big part of why I want to spend my time on it,” Straubel said on TechCrunch’s virtual stage Wednesday at TC Sessions: Mobility. “I want to do something that can actually make a really material impact on sustainability in the world. And you need scale to do that. So I am very excited to keep growing this and to be one of, if not  the major battery recycling company in the world. And eventually, one of the large battery materials companies in the world.”\n The Carson City, Nevada-based company, which Straubel runs, is aiming to create a circular supply chain. The company has a business-to-business strategy, recycling the scrap from battery cell production as well as consumer electronics like cell phone batteries, laptop computers, power tools, power banks, scooters and electric bicycles. Redwood collects the scrap from consumer electronics companies and battery cell manufacturers like Panasonic. It then processes these discarded goods, extracting materials like cobalt, nickel and lithium that are typically mined, and then supplies those back to Panasonic and other customers. Redwood Materials has a number of customers, and has only publicly disclosed that it is working with Panasonic and Amazon.\n  While Redwood Materials is a B2B company, its business model could someday evolve. Interest has been so high that Straubel is now contemplating whether it should also expand into a more consumer-facing business as well. Redwood may never offer collection sites where consumers can drop off old smartphones and other consumer electronics. However, the number of inquiries from local government officials, as well as consumers looking for options to recycle electronics, including the batteries in EVs, has prompted Straubel to at least consider the possibility.\n What  is known is that Straubel sees numerous facilities — perhaps dozens — getting set up regionally, and in some cases co-located with factories if the customer is large enough. The company hasn’t disclosed where those future facilities will be located.\n The company has two recycling and processing facilities in Carson City. And while that hardly qualifies it as one of the world’s largest battery recycling companies, Redwood is already operating at the “gigawatt scale.”\n “We’ve been able to grow extremely quickly and to ramp up our capacity and I expect that will follow roughly the scale of lithium-ion production, lagging by a few years,” he said.\n To put Straubel’s words into context, consider the Gigafactory that Panasonic operates with Tesla in Sparks, Nevada. Today, the factory has the capacity to produce 35 gigawatt hours of lithium-ion battery cells annually. If Straubel hit the scale he’s shooting for, Redwood would be supplying Panasonic with enough materials to match that production capacity. Reaching that goal would fundamentally change Panasonic’s supply chain away from minerals that had been mined and toward those recycled by Redwood. Those recycled materials would come from Panasonic’s production scrap as well as other sources of consumer electronics.\n Celina Mikolajczak,   vice president of battery technology at Panasonic Energy of North America, said it would be foolish for the company to ignore the recycling supply.\n “We’ve already dug these metals out of the ground, we’ve put them in cells, they’re sitting there,” Mikolajczak said during the joint interview with Straubel at TC Sessions: Mobility. “And yeah, it’s a little difficult to handle cells, they process a little differently than a typical metal ore, right, but at the same time, we have a much higher concentration of the metals we need than a typical metal ore. So it makes total sense to go after recycling and to do it aggressively because there’s a lot of it, there’s a lot of batteries already out in the world.”\n   Today, the majority of lithium-ion batteries used in smartphones and other consumer electronics are not recycled and instead either sit forgotten in the owner’s junk drawer or enter the waste stream and end up in a landfill. Electric vehicles have a much longer shelf life, so to speak. But eventually batteries used in electric vehicles will pose a challenge for automakers, as well as communities grappling with the waste.\n Straubel wants Redwood to be a part of that end-of-life solution for electric vehicle batteries as well.\n “The second-life issue and how these batteries are recovered it’s really interesting and there’s a lot of different ideas around about how batteries can go into a whole second application,” Straubel said, noting that Redwood is not working directly on second-life use cases. “It’s great if we can get more useful life on these devices by reusing them for a period of time, but it only delays the inevitable; they eventually need an appropriate disposal, and recycling solution.”\n  There are a number of automakers that have talked about repurposing EV batteries for energy storage. But the details of how an OEM might recapture those batteries back from consumers is scant. Straubel wants Redwood to be an independent company so it can partner with all OEMs producing electric vehicles and provide its materials across the entire industry.\n Redwood has never talked publicly about which automakers it might or already is partnering with. However, looking across the EV landscape a few likely partners emerge. For instance, electric vehicle startup  Rivian   has never announced plans to work directly with Redwood Materials. But the companies do share Amazon as an investor and customer. Rivian CEO RJ Scaringe and Straubel not only know each other, they share a common vision.\n  Scaringe has talked about plans for second-life batteries — albeit without a lot of detail yet — as well as what happens at the end of a battery’s life. Rivian doesn’t have any vehicles on the road today, so it’s a seemingly distant problem. That changes in 2021 when the company will bring an electric pickup truck and SUV to the consumer market, as well electric vans to Amazon. Ultimately, Rivian has a contract to deliver 100,000 electric vans to Amazon.\n “I’m really excited about what JB [Straubel] is doing because we’d love to have these vehicles be a feedstock, and the batteries from these vehicles be a feedstock to then begin another start of lifecycle for another set of batteries and electric vehicles,” Scaringe said in an interview last month at the Bloomberg Green Summit, in which he joined Straubel and Ross Rachey, director of Global Last Mile Fleet and Products at Amazon, on a panel.  “The ability to control this essentially as a closed ecosystem allows us to learn and build the muscle memory for this as the whole industry starts to shift not only to electrification, but different methods of consumption as well.”\n   Straubel said he isn’t interested in taking Redwood Materials public, certainly not in the short term.\n “For better or worse, I had a front row seat to some of the less efficient parts of being a public company,” Straubel said, a comment directed to Tesla’s public status. “It’s nothing that I’m rushing toward. I think that being public is somehow equated with success, which doesn’t really make sense.”\n He said his goal is for Redwood to make an impact, do something meaningful at an industrial scale and generate returns — aka be profitable.\n “It’s not about going public quickly, or, you know, trying to give a quick return to investors or something like that,” Straubel said. “This is what I really want to spend my time on. And I see this as a very long-term growth mission that is likely to span decades.”\n  Straubel talks a lot about scale, both in terms of his vision for Redwood as well as the current state of e-waste sitting in junk drawers of U.S. consumers. It was the scale of the Gigafactory, which is used by Panasonic to make battery cells and by Tesla to make the battery packs and electric motors for its vehicles, that partially drove Straubel to start Redwood in the first place.\n “As the world electrifies transportation it needs so many different materials and the supply chain upstream of the factory is, I think, often under appreciated,” he said. “The Gigafactory is a little bit like an iceberg — there’s so much of it that’s kind of below the surface, in the suppliers and in the mines and refineries and all the different things that need to feed into it that you don’t typically see.”\n Parts of the supply chain became more of a bottleneck as the Gigafactory ramped, he added.\n “You certainly see Tesla focusing more on this, I think rightly so,” Straubel said, a nod to Musk’s recent public comments about needs to focus on the broader supply chain of materials such as nickel. “That was a very interesting area that I thought wasn’t getting as much attention and end-of-life and recycling as a part of that material supply chain is just an incredibly powerful space, one where I think we can have a major impact on the sustainability of creating batteries.”", "posttime": "2020-10-11 17:01:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,回收,panasonic,电池", "title": "\n为什么亚马逊和松下押注于这家电池回收初创公司", "title_en": "\n\t\t\t\tWhy Amazon and Panasonic are betting on this battery recycling startup\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/09/why-amazon-and-panasonic-are-betting-on-this-battery-recycling-startup/", "via": "", "real_tags": ["amazon", "亚马逊", "回收", "panasonic", "电池"]}, {"category": "", "categoryclass": "", "imagename": "c68ceac6ef2f76d1eaed80e2375ff9b4.jpg", "infoid": 1028085, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这一点上，2005年推出的游戏平台和发布系统增长迅速，但其底层技术正在老化，由芝加哥的一个数据中心和包括AWS在内的一批第三方合作伙伴组成，这些合作伙伴都运行裸机(非虚拟化)服务器。在用户对停机几乎没有耐心的时候，您的正常运行时间只有2个9，或者说不到99%(5个9被认为是最佳的)。\n令人难以置信的是，尽管如此，Roblox仍然很受欢迎，但公司领导层知道，它不能继续保持这样的业绩，特别是在它迅速受到欢迎的情况下。该公司需要召集技术骑兵，这基本上是它在2017年聘请丹·威廉姆斯(Dan Williams)时所做的。\n威廉姆斯有解决这类棘手的基础设施问题的历史，他的背景包括2007年至2011年在Facebook工作，在那里他致力于这项技术，帮助这家年轻的社交网络扩大到数百万用户。后来，他在Dropbox工作，在那里他帮助建立了一个新的内部网络，领导公司摆脱了AWS，这是一项涉及移动超过500 PB数据的重大任务。\n当Roblox在2017年年中找到他时，他抓住了接受另一个重大基础设施挑战的机会。虽然他们今天仍在向新的现代技术堆栈过渡，但我们与Williams坐在一起，了解他如何让公司走上以云为基础、专注于微服务的系统，并拥有自己的全球边缘数据中心网络。", "note_en": "At that point, the gaming platform and publishing system that launched in 2005 was growing fast, but its underlying technology was aging, consisting of a single data center in Chicago and a bunch of third-party partners, including  AWS,   all running bare metal (nonvirtualized) servers. At a time when users have precious little patience for outages, your uptime was just two nines, or less than 99% (five nines is considered optimal).\n Unbelievably,  Roblox   was popular in spite of this, but the company’s leadership knew it couldn’t continue with performance like that, especially as it was rapidly gaining in popularity. The company needed to call in the technology cavalry, which is essentially what it did when it hired Dan Williams in 2017.\n Williams has a history of solving these kinds of intractable infrastructure issues, with a background that includes a gig at  Facebook   between 2007 and 2011, where he worked on the technology to help the young social network scale to millions of users. Later,  he worked at Dropbox, where he helped build a new internal network, leading the company’s move away from AWS, a major undertaking involving moving more than 500 petabytes of data.\n When  Roblox   approached him in mid-2017, he jumped at the chance to take on another major infrastructure challenge. While they are still in the midst of the transition to a new modern tech stack today, we sat down with Williams to learn how he put the company on the road to a cloud-native, microservices-focused system with its own network of worldwide edge data centers.", "posttime": "2020-10-11 17:01:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "技术,completely", "title": "\nRoblox如何彻底转变其技术堆栈", "title_en": "\n\t\t\t\tHow Roblox completely transformed its tech stack\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/09/how-roblox-completely-transformed-its-tech-stack/", "via": "", "real_tags": ["技术"]}, {"category": "", "categoryclass": "", "imagename": "5973d3c42e90d06501f08bcd84c1ec1c.jpg", "infoid": 1028084, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周令人惊讶的时刻是周三，美国劳工部实质上指责微软在其以白人为主的公司承诺雇佣更多黑人员工，这是反向种族主义(不是真正的事情)。\n这甚至不是本周最引人注目的新闻。相反，该奖项颁给了优步工程师库尔特·纳尔逊(Kurt Nelson)和他公开反对雇主的决定，并敦促人们对加州优步发起的旨在将司机归类为独立承包商的投票措施投反对票。我采访了纳尔逊，想听听更多关于是什么促使他直言不讳的。你可以在这份时事通讯的下面读到他所说的话。\n但首先，我有一些我自己的新闻要分享-人力资本将于10月23日(星期五)以时事通讯的形式推出。在这里报名，这样你就不会错过了。\n还记得Coinbase是如何为那些由于加密货币公司在社会问题上的立场而不再想在该公司工作的员工提供出路的吗？本周，Coinbase首席执行官布莱恩·阿姆斯特朗表示，大约5%的员工(60人)已经决定接受离职方案，但可能还会有更多，因为还有其他几个对话仍在进行。\n阿姆斯特朗指出，一些人担心他的立场会把有色人种和其他代表性不足的少数族裔赶出去。但在他的博客文章中，阿姆斯特朗表示，这些人“并没有接受与总人口不成比例的退出方案”。\n微软本周披露，美国劳工部联邦合同遵守计划办公室(U.S.Department of Labor Office of Federal Contract Compliance Programs)就该公司在6月份做出的种族正义和多样性承诺与该公司联系。微软曾承诺到2025年将其美国员工中的黑人经理、高级个人贡献者和高级领导者的数量翻一番。然而，现在OFCCP表示，这可以被认为是违反民权法案第七章的非法歧视。这是因为，根据这封信，微软的承诺“似乎暗示着可能会根据种族采取就业行动。”\n微软在一篇博客文章中写道：“我们很清楚，法律禁止我们基于种族的歧视。”作为一家服务于联邦政府的公司，我们也有积极的义务继续增加我们劳动力的多样性，我们非常认真地对待这些义务。我们有几十年的经验，很清楚如何在不剥夺他人机会的情况下，适当地为人们创造机会。此外，我们知道我们需要把重点放在创造更多的机会上，包括通过专门的计划，为那些我们可以在微软提供职业机会的人才撒下一张大网。“。\n在此之前不久，特朗普政府扩大了对多样性和反种族主义培训的禁令，将联邦承包商包括在内。虽然这不属于禁令的范围，但看到司法部追查一家试图增加多样性的科技公司，这是令人担忧的。然而，这项禁令的影响似乎确实正在进入科技行业。\n多元化培训服务公司Paradigm的创始人兼首席执行官乔尔·爱默生(Joelle Emerson)表示，由于这项行政命令，她失去了第一个客户。虽然还不清楚是哪个客户，但Paradigm的许多客户都是科技公司。\n由于关于多元化培训的行政命令，我们刚刚失去了第一个客户。我相信这不会是我们的最后一次。看起来它确实产生了它想要的影响。我希望我可以说，我为站在历史的正确一边而感到自豪，但我只是感到害怕。\n人们普遍认为，黑人和拉丁裔创始人获得的资金远没有他们的白人同行多。现在，Crunchbase对这种情况有了更多的了解。以下是其2020年多样性聚焦报告中的一些亮点。\n自2015年以来，Black和Latinx创始人已经筹集了超过150亿美元，仅占筹集的风险资本总额的2.4%。\n2020年，Black和Latinx创始人已经筹集了23亿美元，占截至2020年8月31日所有风险投资的2.6%。\n自2015年以来，美国十大领先的风险投资公司已经投资了大约70家由黑人或拉丁裔人创立的初创公司。\n安德森·霍洛维茨(Andreessen Horowitz)和创始人基金(Founders Fund)是自2015年以来对黑人或拉丁裔创立的公司进行新投资最多的两家公司。\n优步工程师库尔特·纳尔逊(Kurt Nelson)与他的雇主背道而驰，他在TechCrunch上写了一篇评论文章，阐述了他为什么投票反对第22号提案。22号提案是加利福尼亚州的一项投票措施，旨在将拼车司机和送货工人归类为独立承包商。在纳尔逊发表了他的专栏文章后，我联系了他，以更多地了解是什么促使他公开反对22号提案。\n纳尔逊告诉我：“这是COVID影响了一群人的失业和医疗保险，临近大选，没有看到任何真正的前优步或优步或前任何零工公司说什么的综合作用。”\n此外，纳尔逊正在离开优步的路上--他一直在与他的经理坦率地谈论这件事。他已经对优步今年处理几轮裁员的方式感到沮丧，但该公司对22号提案的推动是“棺材里的最后一颗钉子”。\n优步围绕为什么司机应该保持独立承包商的主要论点是，这是司机想要的，让他们成为员工的成本很高。优步表示，它也看不到在雇佣司机的同时为司机提供灵活性的方法。\n“我认为这真的是具有挑战性的，”优步政策、城市和交通主管Shin-pei Tsay在TC Sessions：本周的移动性会议上告诉我。“我们必须开始确保覆盖范围，以确保有必要数量的司机来满足需求。这就是需要进行的预测。我们只能提供一定数量的工作岗位来满足这一需求，因为人们将在固定的时间内工作。我认为工作机会会相当少，特别是那些人们真的表示喜欢的工作机会。“。\n“我们是一家科技公司，我们解决难题--这就是我们的工作，”他说。\n在回应他的专栏文章时，纳尔逊说，他的一些同事已经联系了他-一些人感谢他说了一些话。甚至在他的专栏之前，纳尔逊就表示，他是仅有的几个在优步内部松弛频道上以任何负面方式谈论22号提案的人之一。考虑到优步在22号提案周围营造的氛围，这也就不足为奇了。\n在全体员工会议上，Nelson描述了高管团队如何在22件衬衫上穿Yes，或者在22 Zoom背景上穿Yes。纳尔逊说，优步还向员工免费提供22个汽车贴花和衬衫上的Yes。\n至于纳尔逊的下一份工作，他知道自己“再也不想碰零工经济了，”他说。“我知道这是事实。我受够了零工经济。“\n据副主席报道，Kickstarter同意向去年被解雇的前Kickstarter员工泰勒·摩尔支付36598.63美元的欠款。摩尔积极组织该公司的工会，该工会在今年早些时候得到正式承认。作为与国家劳动关系委员会(National Labor Relations Board)达成和解的一部分，Kickstarter还同意，每当员工重新开业时，都会在其内联网和实体办公室向员工发布有关和解的通知。\n2019年9月，Kickstarter解雇了两名积极组织工会的人。大约一年后，劳工委员会发现Kickstarter非法解雇了一名工会组织者的优点。\n自从80名谷歌承包商投票决定与美国钢铁工人组成工会以来，已经过去了大约一年。但根据美国国家劳资关系委员会(National Labor Relations Board)获得的一份新的起诉书，这些正式受雇于HCL America的承包商一直无法进行集体谈判。\n起诉书称，HCL未能与工会讨价还价，甚至将谈判单位成员的工作转移给了总部设在波兰的非工会成员。全国劳资关系委员会声称HCL这样做“是因为员工组建、加入和协助工会并从事协调一致的活动，并阻止员工参与这些活动。”", "note_en": "This week’s eyebrow-raising moment came Wednesday when the U.S. Department of Labor essentially accused  Microsoft   of reverse racism (not a real thing) for committing to hire more Black people at its predominantly white company.\n And that wasn’t even the most notable news items of the week. Instead, that award goes to Uber engineer Kurt Nelson and his decision to speak out against his employer and urge folks to vote no on the Uber-sponsored ballot measure in California that aims to keep drivers classified as independent contractors. I caught up with Nelson to hear more about what brought him to the point of speaking out. You can read what he had to say further down in this newsletter.\n But first, I have some of my own news to share  —  Human Capital is launching in newsletter form on Friday, October 23.  Sign up here so you don’t miss out.\n      Remember how Coinbase provided an out to employees who no longer wanted to work at the cryptocurrency company as a result of its stance on social issues? Well,   Coinbase CEO Brian Armstrong said this week  that about 5% of employees (60 people) have decided to take the exit package, but that there will likely be more since “a handful of other conversations” are still happening.\n Armstrong noted how some people worried his stance would push out people of color and other underrepresented minorities. But in his blog post, Armstrong said those folks “have not taken the exit package in numbers disproportionate to the overall population.”\n  Microsoft disclosed this week that the U.S. Department of Labor Office of Federal Contract Compliance Programs contacted the company regarding its racial justice and diversity commitments made in June. Microsoft had committed to double the number of Black people managers, senior individual contributors and senior leaders in its U.S. workforce by 2025. Now, however, the OFCCP says that could be considered as unlawful discrimination in violation of Title VII of the Civil Rights Act. That’s because, according to the letter, Microsoft’s commitment “appears to imply that employment action may be taken based on race.”\n “We are clear that the law prohibits us from discriminating on the basis of race,” Microsoft wrote in a blog post. “We also have affirmative obligations as a company that serves the federal government to continue to increase the diversity of our workforce, and we take those obligations very seriously. We have decades of experience and know full well how to appropriately create opportunities for people without taking away opportunities from others. Furthermore, we know that we need to focus on creating more opportunity, including through specific programs designed to cast a wide net for talent for whom we can provide careers with Microsoft.”\n This comes shortly after   the Trump administration expanded its ban on diversity and anti-racism training to include federal contractors . While this does not fall into the scope of that ban, it’s alarming to see the DOL going after a tech company for trying to increase diversity. However, it does seem that the effects of the ban are making its way into the tech industry.\n Joelle Emerson, founder and CEO of diversity training service Paradigm, says she lost her first client as a result of the executive order. While it’s not clear which client it was, many of Paradigm’s clients are tech companies.\n We just lost our first client as a result of the executive order on diversity training. I&#39;m sure it won&#39;t be our last. Seems it&#39;s having exactly its intended impact. I wish I could say I feel proud to be on the right side of history, but I just feel scared.\n  It’s widely understood that Black and Latinx founders receive not nearly as much funding as their white counterparts. Now, Crunchbase has shed some additional light on the situation. Here are some highlights from its   2020 Diversity Spotlight report .\n  Since 2015, Black and Latinx founders have raised more than $15 billion, which represents just 2.4% of the total venture capital raised.\n In 2020, Black and Latinx founders have raised $2.3 billion, which represents 2.6% of all VC funding through August 31, 2020.\n Since 2015, the top 10 leading VC firms in the U.S. have invested in around 70 startups founded by Black or Latinx people.\n Andreessen Horowitz and Founders Fund are the two firms with the highest count of new investments in Black or Latinx-founded companies since 2015.\n     Going against his employer,   Uber engineer Kurt Nelson penned an op-ed on TechCrunch  about why he’s voting against Prop 22. Prop 22 is a ballot measure in California that seeks to keep rideshare drivers and delivery workers classified as independent contractors. I caught up with Nelson after he published his op-ed to learn more about what brought him to the point of speaking out against Prop 22.\n “It was a combination of COVID affecting unemployment and health insurance for a bunch of people, getting close to the election and not having seen anyone who is really former Uber or Uber or former any gig companies saying anything,” Nelson told me.\n  Plus, Nelson is on his way out from Uber — something that he’s been forthcoming about with his manager. He had already been feeling frustrated about the way Uber handled its rounds of layoffs this year, but the company’s push for Prop 22 was “the final nail in the coffin.”\n Uber’s big arguments around why drivers should remain independent contractors is that it’s what drivers want and that it’d be costly to make them employees. Uber has said it also doesn’t see a way to offer flexibility to drivers while also employing them.\n “I think it’d be really challenging,” Uber Director of Policy, Cities and Transportation Shin-pei Tsay   told me at TC Sessions: Mobility this week . “We would have to start to ensure that there’s coverage to ensure that there’s the necessary number of drivers to meet demand. That would be this forecasting that needs to happen. We would only be able to offer a certain number of jobs to meet that demand because people will be working in set amounts of time. I think there would be quite fewer work opportunities, especially the ones that people really have said that they like.”\n  “We’re a tech company and we solve hard problems — that’s what we do,” he said.\n  In response to his op-ed, Nelson said some of his co-workers have reached out to him — some thanking him for saying something. Even prior to his op-ed, Nelson said he was one of the only people who would talk about Prop 22 in any negative way in Uber’s internal Slack channels. And it’s no wonder why, given the atmosphere Uber has created around Prop 22.\n During all-hands meetings, Nelson described how the executive team wears Yes on 22 shirts or has a Yes on 22 Zoom background. Uber has also offered employees free Yes on 22 car decals and shirts, Nelson said.\n As for Nelson’s next job, he knows he doesn’t “want to touch the gig economy ever again,” he said. “I know that for a fact. I’m done with the gig economy.”\n     Kickstarter agreed to pay $36,598.63 in backpay to Taylor Moore , a former Kickstarter employee who was fired last year,   Vice reported . Moore was active in organizing the company’s union, which was officially recognized earlier this year. As part of the settlement with the National Labor Relations Board, Kickstarter also agreed to post a notice to employees about the settlement on its intranet and at its physical office whenever they reopen.\n In September 2019, Kickstarter fired two people who were actively organizing a union. About a year later, the Labor Board found merit that Kickstarter unlawfully fired a union organizer.\n  It’s been about a year since 80 Google contractors voted to form a union with U.S. Steelworkers. But those contractors, who are officially employed by HCL America, have not been able to engage in collective bargaining,   according to a new complaint from the National Labor Relations Board ,   obtained by Vice .\n The complaint states HCL has failed to bargain with the union and has even transferred the work of members of the bargaining unit to non-union members based in Poland. The NLRB alleges HCL has done that “because employees formed, joined and assisted the Union and engaged in concerted activities, and to discourage employees from engaging in these activities.”", "posttime": "2020-10-11 17:01:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "优步,capital", "title": "\n人力资本：优步工程师解释为什么他公开反对22号提案", "title_en": "\n\t\t\t\tHuman Capital: Uber engineer explains why he spoke out against Prop 22\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/09/human-capital-uber-engineer-explains-why-he-spoke-out-against-prop-22/", "via": "", "real_tags": ["优步", "capital"]}, {"category": "", "categoryclass": "", "imagename": "785ba040e8863fa046a906c094fc5842.jpg", "infoid": 1028083, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "索菲·奥尔科恩是硅谷阿尔科恩移民法的创始人，也是2019年全球法律专家奖的创始人，她的获奖作品是“加州年度企业家移民服务律师事务所”。她将人们与拓展他们生活的业务和机会联系起来。\n硅谷移民律师索菲·奥尔科恩说：“你的问题对知识的传播至关重要，让世界各地的人们超越国界，追逐自己的梦想。”“无论你是在人事部、创始人还是在硅谷找工作，我都很乐意在我的下一篇专栏中回答你的问题。”\n额外的Crunch会员可以获得每周“亲爱的索菲”专栏的访问权限；使用促销码ALCON以50%的折扣购买一年或两年的订阅。\n我一直在阅读关于工资水平的新H-1B规则，并定义了本周公布的符合条件的工作类型。作为雇主，我们需要做些什么才能遵守呢？是否有其他类型的签证受到影响？\n正如你提到的，劳工部(DOL)和国土安全部(DHS)本周分别发布了一项影响H-1B计划的新临时规定。然而，DOL规则也会影响其他签证和绿卡。这些暂行规定，其中一项在公布后立即生效，是滥用权力。\n总统继续散布恐惧，试图通过种族主义、保护主义和仇外心理来获得选票。这里致命的讽刺是，公司实际上已经为创新经济中的工作岗位向“真正的员工”提出了“真正的提议”，这些工作是不可替代的，实际上是美国人创造新就业机会的来源。经济政策研究所(Economic Policy Institute)2019年的一份报告发现，美国私营部门每创造100个专业、科学和技术服务岗位，就会因此创造418个额外的间接就业岗位。每100个信息就业岗位新增近575个就业岗位，每100个医疗保健和社会救助岗位新增就业岗位206个。\n2020年10月8日生效的DOL规则大幅提高了雇主必须支付给他们赞助的员工的工资，这些员工申请H-1B，H-1B1和E-3专业职业签证，临时非农业工人的H-2B签证，EB-2高级学位绿卡，EB-2特殊能力绿卡和EB-3熟练工人绿卡。\n国土安全部进一步限制H-1B签证的新规定将于2020年12月7日生效。国土安全部将不会将新规则应用于任何未决或之前批准的请愿书。这意味着你的公司应该在该日期之前续签你的员工的H-1B签证-如果符合条件的话。\n美国移民律师协会(AILA)已经成立了一个特别工作组来审查这些规则并帮助进行诉讼。尽管司法部和国土安全部的规则都可能受到挑战，但在任何诉讼产生影响之前，它们可能会保持有效一段时间。他们正在积极寻找原告，包括员工、雇主和会员组织的代表，他们将受到新规则的伤害。", "note_en": "Sophie Alcorn is the founder of  Alcorn Immigration Law in Silicon Valley and 2019 Global Law Experts Awards’ “Law Firm of the Year in California for Entrepreneur Immigration Services.” She connects people with the businesses and opportunities that expand their lives.\n  “Your questions are vital to the spread of knowledge that allows people all over the world to rise above borders and pursue their dreams,” says  Sophie Alcorn, a Silicon Valley immigration attorney. “Whether you’re in people ops, a founder or seeking a job in Silicon Valley, I would love to  answer your questions in my next column.”\n Extra Crunch members receive access to weekly “Dear Sophie” columns;  use promo code ALCORN to purchase a one or two-year subscription for 50% off.\n   I’ve been reading about the new H-1B rules for wage levels and defining what types of jobs qualify that came out this week. What do we as employers need to do to comply? Are any other visa types affected?\n   As you mentioned, the Department of Labor (DOL) and the Department of Homeland Security (DHS) each issued a new interim rule this week that affects the H-1B program. However, the DOL rule impacts other visas and green cards as well. These interim rules, one of which took effect immediately after being published, are an abuse of power.\n The president continues to fear-monger in an attempt to generate votes through racism, protectionism and xenophobia. The fatal irony here is that companies were in fact already making “real offers” to “real employees” for jobs in the innovation economy, which are not fungible and are actually the source of new job creation for Americans. A 2019 report by the Economic Policy Institute found that for every 100 professional, scientific and technical services jobs created in the private sector in the U.S., 418 additional, indirect jobs are created as a result. Nearly 575 additional jobs are created for every 100 information jobs, and 206 additional jobs are created for every 100 healthcare and social assistance jobs.\n The DOL rule, which went into effect on October 8, 2020, significantly raises the wages employers must pay to the employees they sponsor for  H-1B,  H-1B1 and  E-3 specialty occupation visas,  H-2B visas for temporary non-agricultural workers,  EB-2 advanced degree green cards,  EB-2 exceptional ability green cards and  EB-3 skilled worker green cards.\n The new DHS rule, which further restricts H-1B visas, will go into effect on December 7, 2020. DHS will not apply the new rule to any pending or previously approved petitions. That means your company should renew your employees’ H-1B visas — if eligible — before that date.\n The American Immigration Lawyers Association (AILA) has formed a task force to review the rules and help with litigation. Although both the DOL and DHS rules will likely be challenged, they will likely remain in effect for some time before any litigation has an impact. They are actively seeking plaintiffs, including employees, employers and representatives of membership organizations who will be hurt by the new rules.", "posttime": "2020-10-11 17:00:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "雇主,sophie,员工", "title": "\n亲爱的索菲：雇主如何招聘并遵守所有这些新的H-1B签证疯狂？", "title_en": "\n\t\t\t\tDear Sophie: How can employers hire & comply with all this new H-1B craziness?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/09/dear-sophie-how-can-employers-hire-comply-with-all-this-new-h-1b-craziness/", "via": "", "real_tags": ["雇主", "sophie", "员工"]}, {"category": "", "categoryclass": "", "imagename": "0ccb495e10c760f535079df9cbc870a0.jpg", "infoid": 1028082, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "法院的判决再次确认了法院在8月下旬的一次庭审中宣布的这一决定。在听证会上，Epic Games的律师试图获得临时限制令，此前苹果通知堡垒之夜开发者，他们将把公司踢出应用商店，并注销他们所有的公司账户。\n法官指出，“[p]最严格的禁令救济是一种很少给予的非常措施”，并详细说明了他们部分批准和部分拒绝了Epici的请求，并指出“Epic Games承担着请求这种非常救济的责任。”\nEpic Games对苹果通过iOS应用商店进行独家分销以及应用内购买系统(苹果通过该系统收取特定应用内支付的30%)有强烈的争议。然而，考虑到记录有限，Epic Games并没有充分回应苹果的反驳论点。临时限制令中涉及的股票保持不变。\n这证实了堡垒之夜在庭审开始前不会回到应用商店；本周的一份法庭文件暗示，两家公司将于2021年5月3日开庭审理。\n在这个喜忧参半的决定中，双方的目标都是取胜而忽略失利。\n“随着诉讼的继续，苹果将继续被禁止对虚幻引擎和我们的游戏开发客户进行报复，Epic Games对此表示感谢。我们将在法院的保护下继续为iOS和Mac开发软件，我们将寻求一切途径来结束苹果的反竞争行为，“Epic Games发言人在一份声明中表示。\n苹果发言人在一份电子邮件声明中告诉TechCrunch：“我们的客户依赖于App Store是一个安全和值得信赖的地方，所有的开发者都遵循同样的规则，”苹果的一位发言人在一份电子邮件声明中告诉TechCrunch。“我们很感激法院认识到Etic的行为并不符合其客户的最佳利益，他们在违反协议时可能遇到的任何问题都是他们自己造成的。”12年来，App Store一直是一个经济奇迹，为大大小小的开发者创造了变革性的商机。我们期待着明年与法院分享这份创新和活力的遗产。“", "note_en": "The court’s decision re-affirmed its proclamation from late August in a court hearing where Epic Games’ lawyers sought to obtain a temporary restraining order after Apple informed the Fortnite developer that they would be kicking the company off the App Store and terminating all of their company accounts.\n  The judge noted that “[p]reliminary injunctive relief is an extraordinary measure rarely granted,” and detailed that they were granting in part and denying in part Epic’s request, noting that “Epic Games bears the burden in asking for such extraordinary relief.”\n  Epic Games has strong arguments regarding Apple’s exclusive distribution through the iOS App Store, and the in-app purchase (“IAP”) system through which Apple takes 30% of certain IAP payments. However, given the limited record, Epic Games has not sufficiently addressed Apple’s counter arguments. The equities, addressed in the temporary restraining order, remain the same.\n This confirms that Fortnite will not return to the App Store before the trial begins; a court filing this week signaled that the two companies will go to trial on May 3, 2021.\n Both sides aimed to take their win and ignore their loss in the mixed decision.\n “Epic Games is grateful that Apple will continue to be barred from retaliating against  Unreal Engine   and our game development customers as the litigation continues. We will continue to develop for iOS and Mac under the court’s protection, and we will pursue all avenues to end Apple’s anti-competitive behavior,” an Epic Games spokesperson said in a statement.\n “Our customers depend on the App Store being a safe and trusted place where all developers follow the same set of rules,” an Apple spokesperson told TechCrunch in an emailed statement. “We’re grateful the court recognized that Epic’s actions were not in the best interests of its own customers and that any problems they may have encountered were of their own making when they breached their agreement. For twelve years, the App Store has been an economic miracle, creating transformative business opportunities for developers large and small. We look forward to sharing this legacy of innovation and dynamism with the court next year.”", "posttime": "2020-10-11 17:00:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,apple,应用,denies", "title": "\n法官驳回史诗强制苹果将堡垒之夜带回应用商店的请求", "title_en": "\n\t\t\t\tJudge denies Epic’s request to force Apple to bring Fortnite back to App Store\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/09/judge-rules-that-apple-can-ban-fortnite-but-cant-terminate-epics-unreal-developer-accounts/", "via": "", "real_tags": ["苹果", "apple", "应用", "denies"]}, {"category": "", "categoryclass": "", "imagename": "eb4136e964fe70c867a6a53dffa49c2b.jpg", "infoid": 1028081, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“我认识到我们的方法并不适合每个人，而且可能会引起争议。我知道很多人可能不同意，有些员工可能会辞职。我也知道我在上面写的一些东西会被曲解，无论是无意的还是故意的。但我相信Coinbase的正确做法将使我们获得长期的成功，我宁愿诚实和透明地对待这一点，也不愿含糊其辞，在一家不一致的公司工作。“他写道。\n也许是因为几乎立即遭到了强烈反对，阿姆斯特朗第二天发出了一份单独的内部备忘录，详细说明了为可能感到不安并寻求离职的员工提供的离职方案。Coinbase也愿意非常慷慨，为那些在交易所工作不到3年的人提供4个月的遣散费，向长期员工提供6个月的遣散费。(值得一提的是：Coinbase还给员工最多七年的时间来行使他们的股票期权。)。\n阿姆斯特朗是否预计Coinbase 1200名员工中有60多名员工会接受这一报价，这只有他自己知道。正如他在昨天的一篇后续帖子中透露的那样，在10月7日的最后期限之前，有多少人通知公司他们将辞职，Coinbase预计，根据正在进行的几次对话，这个数字还会更高。\n不管怎样，如果我是阿姆斯特朗，我可能会对这个数字感到有点紧张。虽然在公司雄心壮志的宏伟计划中微不足道，但这60多人的简历上有Coinbase，头脑中有关于公司的机构知识，还有潜在的银行存款，介于遣散费和股权之间。\n更令人担忧的是，他们可能还有点与一家公司较量，这家公司告诉他们，它正在改变世界，然后在对大多数人来说已经很艰难的时候改变了与他们的协议条款。\n这种挫折感-如果存在的话-可能会以潜在的泄密形式泄露给媒体，尽管想必每个员工在离开家的路上都必须签署一份冗长的非贬损协议。\n更大的威胁是，这些员工中的一人或许多人现在可能会开始自己的密码相关业务，或者加入可能需要他们技能的竞争对手公司。(众所周知，竞业禁止协议在加利福尼亚州很难执行。)。正如密码爱好者喜欢说的那样，当涉及到分散的金融时，现在还处于初期阶段。\n当然，在这一点上与Coinbase竞争是一项非常艰巨的任务。两年前，当该公司完成E系列3亿美元的融资时，它的资金后估值超过80亿美元，使其遥遥领先于许多其他密码交易所。\n无论你如何看待阿姆斯特朗的新政策，也没有多少创始人拥有像他这样强大而快速地发展公司的能力。\n尽管如此，人们创办公司以搞垮其他公司的情况时有发生。这是人类的本性。\n鉴于许多前Coinbase员工在离开Coinbase后已经为项目筹集了资金，再加上有如此多的投资资金四处流动，希望投入使用，这种情况发生在Coinbase身上的风险可能很小，因为阿姆斯特朗的备忘录及其后果。", "note_en": "“I recognize that our approach is not for everyone, and may be controversial. I know that many people may not agree, and some employees may resign. I also know that some of what I’ve written above will be misinterpreted, whether accidentally or on purpose. But I believe it’s the right approach for  Coinbase   that will set us up for success long term, and I would rather be honest and transparent about that than equivocate and work in a company that is not aligned,” he wrote.\n Perhaps owing to an almost immediate backlash, Armstrong sent a separate, internal memo the next day detailing separation packages for employees who might be upset and looking for the exits. Coinbase was willing to be very generous, too, offering four months’ severance pay for those who have been at the exchange for less than three years, and paying longer-term employees six months of severance. (Worth noting: Coinbase also gives employees up to  seven years to exercise their stock options.)\n  Whether Armstrong expected that more than 60 employees of Coinbase’s staff of 1,200 would take him up on the offer is something only he knows. As he disclosed in a follow-up post yesterday, that’s how many people had alerted the company by its October 7th deadline that they are quitting, and Coinbase expects the number to inch higher, based on a “handful” of ongoing conversations.\n Either way, if I were Armstrong, I might be a little nervous about that number. Though small in the grand scheme of the company’s ambitions, that’s 60-plus people who have Coinbase on their resume, institutional knowledge about the company in their head, and potentially money in the bank, between their severance and  equity.\n More worrisome, they might also have a bit of an axe to grind against a company that told them it was changing the world, then changed the terms of its pact with them in the middle of an already trying time for most people.\n That frustration — if it exists — could come out in potential leaks to the press, though presumably every employee had to sign a lengthy non-disparagement agreement on their way out the door.\n The bigger threat is that one or numerous of these employees might now start their own crypto-related business, or else join rival companies that could use their skills. (Non-compete agreements are famously  difficult to enforce in the state of California.) As crypto enthusiasts like to say, it’s still early innings when it comes to decentralized finance.\n Certainly, taking on Coinbase is a very tall order at this point. Two years ago, when the company closed on $300 million in Series E funding, it did so at a post-money valuation of  more than $8 billion, putting it leaps and bounds ahead of numerous other crypto exchanges.\n No matter what you think of Armstrong’s new policy, there aren’t a lot of founders with the stuff to grow a company as strong and fast as he has, either.\n Still, it happens  all the time that people launch companies to  take down other companies. It’s human nature.\n Given that a  number of  former Coinbase  employees has already raised funding for projects after leaving Coinbase, combined with so many investing dollars sloshing around out there looking to be put to use, the risk of this happening to Coinbase because of Armstrong’s memo and its aftermath may be small.", "posttime": "2020-10-11 17:00:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "armstrong", "title": "\n布莱恩·阿姆斯特朗的新问题：60多名自由球员", "title_en": "\n\t\t\t\tBrian Armstrong’s new problem: 60-plus free agents\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/09/brian-armstrongs-new-problem-60-plus/", "via": "", "real_tags": ["armstrong"]}, {"category": "", "categoryclass": "", "imagename": "d8cf7ec00b349c3e20735ff60924160b.jpg", "infoid": 1028080, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这部电影原本计划由华纳兄弟影院上映，但在大流行关闭世界各地影院后，Netflix在今年早些时候接手了这部电影。\n“埃诺拉·福尔摩斯”由米莉·鲍比·布朗饰演名义上的青少年侦探，亨利·卡维尔饰演夏洛克，他们都是…。很好?。他们两人似乎都没有打来电话，而卡维尔有时完全是迷人的。尽管布朗承认她很难重新掌握自己的英国口音，但她为自己的角色带来了大量的能量，其中包括大量打破第四道墙的独白，让观众了解背景故事，并解释不是特别令人费解的谜团的解决方案。\n正如我们在原创内容播客的最新一集中所解释的那样，这部电影似乎在几乎所有方面都很称职，但完全是鼓舞人心的，让我们对结果并不印象深刻-安东尼以至于他在房间里踱来踱去，琢磨着自己的人生选择。不过，嘿，也许孩子们会喜欢看的？\n除了回顾这部电影，我们还讨论了Netflix最近关于取消“光芒四射”和“少年赏金猎人”的讨论。\n您可以在下面的播放器中收听我们的评论，使用Apple播客订阅，或者在您选择的播客播放器中找到我们。如果你喜欢这个节目，请在苹果上留言让我们知道。您也可以在Twitter上关注我们或直接向我们发送反馈。(或推荐节目和电影供我们评论！)。\n如果你想跳过这一集，下面是这一集的详细情况：0：00 Intro 0：37《离开》听众回应4：04《Glow》/《青少年赏金猎人》讨论12：43《埃诺拉·福尔摩斯》评论29：17：《Enola Holmes》剧透讨论", "note_en": "The film was originally planned for a theatrical release from Warner Bros., but  Netflix picked it up earlier this year, after the pandemic shuttered theaters around the world.\n “Enola Holmes” stars Millie Bobby Brown as titular adolescent detective, along with Henry Cavill as Sherlock, and they’re both … fine? Neither of them seems to be phoning it in, and Cavill is downright charming at times. And although Brown has admitted that  she struggled to reacquire her English accent, she brings plenty of energy to her role, which includes plenty of fourth-wall-breaking monologues that fill the audience in on backstory and explain the solutions to not-particularly-puzzling mysteries.\n  As we explain on the latest episode of  the Original Content podcast, the film seems competent in virtually every respect, but thoroughly inspired, leaving us underwhelmed by the results — Anthony to the point where he was pacing around the room and wondering about his life choices. But hey, maybe kids will enjoy watching it?\n In addition to reviewing the movie, we also discuss  Netflix’s   recent discussion to  cancel “Glow” and “Teenage Bounty Hunters.”\n You can listen to our review in the player below,  subscribe using Apple Podcasts or find us in your podcast player of choice. If you like the show, please let us know by leaving a review on Apple. You can also  follow us on Twitter or  send us feedback directly. (Or suggest shows and movies for us to review!)\n If you’d like to skip ahead, here’s how the episode breaks down: 0:00 Intro 0:37 “Away” listener response 4:04 “Glow”/”Teenage Bounty Hunters” discussion 12:43 “Enola Holmes” review 29:17: “Enola Holmes” spoiler discussion", "posttime": "2020-10-11 16:59:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "播客,内容,content", "title": "\n原创内容播客：Netflix的《埃诺拉·福尔摩斯》完全平庸", "title_en": "\n\t\t\t\tOriginal Content podcast: Netflix’s ‘Enola Holmes’ is thoroughly mediocre\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/10/original-content-enola-holmes/", "via": "", "real_tags": ["播客", "内容", "content"]}, {"category": "", "categoryclass": "", "imagename": "35d87b8d51d92059e7e92608ea73d6da.jpg", "infoid": 1028076, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(CNN)你以前听过这句话--给无家可归的人钱不是帮助他们的最好方式，因为钱可能会被挥霍掉，或者花在有害的习惯上。但加拿大的一项新研究提出了一个强有力的相反理由。\n这项名为“新叶计划”的研究是由社会变革基金会发起的，该基金会总部设在温哥华，是一家慈善组织，与不列颠哥伦比亚省大学合作。\n研究人员向50名最近无家可归的人一次性支付了7500加元(近5700美元)。他们对现金接受者的寿命进行了超过12-18个月的跟踪调查，并将他们的结果与没有收到付款的对照组的结果进行了比较。\n将于明年接受同行审查的初步调查结果显示，平均而言，那些获得现金的人能够更快地找到稳定的住房。相比之下，那些没有收到现金的人在获得更多永久住房方面落后了大约12个月。\n接受现金的人能够获得他们生活更快所需的食物。近70%的人在一个月后做到了这一点，并在全年保持了更大的粮食安全。\n受助者在食物、衣服和房租上的花费更多，而在酒类、香烟或药物等商品上的支出减少了39%。\n无家可归的人口继续增长，我们一直在采用同样的旧方法，社会变革基金会的首席执行官兼联合创始人克莱尔·威廉姆斯(Claire Williams)说。\n威廉姆斯补充说，我们真的认为，以社会变革的名义开始测试有意义的冒险行为是很重要的。\n这项随机对照试验的115名参与者年龄在19岁到64岁之间，他们无家可归的平均时间为6个月。参与者接受了心理健康挑战和药物滥用的低风险筛查。\n该倡议的资金来自加拿大联邦政府的赠款，以及该国的捐赠者和基金会。\n威廉姆斯告诉CNN，最令人震惊的一件事是，大多数收到现金的人立刻就知道他们想要用这笔钱做什么，这与人们的刻板印象背道而驰。\n例如，她解释说，一些接受现金的人知道他们想用这笔钱搬进住房，或者投资于交通--买辆自行车，或者把车开到修理店，以便保住自己的工作。其他人想买电脑。他们中的一些人想要开始自己的小生意。\n威廉姆斯说：人们非常清楚自己需要什么，但我们往往不会给他们提供真正赋予他们选择和尊严的干预或服务，让他们能够按照自己的方式前进。\n威廉姆斯说，通常情况下，直接现金转移并不是解决无家可归问题的灵丹妙药，该计划关注的是无家可归人口中功能较高的一部分，但她认为，研究表明，为最近无家可归的人提供有意义的支持会降低他们在无家可归经历中扎根的可能性。\n接受现金注射的人甚至可以留出一些钱-在12个月内平均约为1000加元。\n根据威廉姆斯的说法，该项目提供的资金也产生了涓滴效应，人们在孩子的福祉和需求上投入了更多资金，同时也帮助了家庭成员。\n威廉姆斯解释说，有一些隐藏的影响，我们只是没有预料到，也没有必要量化，但现在我们重新看到，这对人们的生活产生了指数级的影响。\n根据这项研究，减少50名接受现金的研究参与者在避难所度过的夜晚数，每人每年节省约8100加元，或对所有50名参与者来说，一年节省约40.5万加元。\n威廉姆斯说，有一种常见的误解，认为无所事事的代价是免费的或便宜的，但绝对不是。\n对于美国各地的许多人来说，无家可归的风险迫在眉睫，因为人们正在应对冠状病毒大流行带来的失业和经济不确定性。\n美国非营利组织“全国结束无家可归联盟”(National Alliance To End Homelless)副总裁史蒂夫·伯格(Steve Berg)告诉CNN，我们从很多地方的无家可归者那里听说，以前从未无家可归过的人纷纷来到收容所，他们不知道该怎么办。\n对他们来说，这是一种全新的体验，他们做梦也没想到，当他们谈论无家可归的人时，他们会谈论自己。没有参与“新叶计划”研究的伯格说。\n这个问题的创新解决方案现在更加紧迫。伯格认为，这项研究证实了对许多无家可归的人来说是正确的：金钱可以解决这个问题。\n当然也有无家可归的人有更深、更严重的问题，伯格解释说，但对许多人来说，这只是一个问题--他们花光了钱，失去了工作，陷入困境，无家可归。一旦他们无家可归，就很难攒够钱找地方住。\n伯格补充说，如果人们预先拿到了钱，他们可以信赖自己来解决这个问题。", "note_en": "(CNN)You&#39;ve heard this refrain before -- giving money to homeless people is not the best way to help them because it might be squandered, or spent on harmful habits. But a new Canadian study makes a powerful case to the contrary.\n The study, dubbed &#34; The New Leaf Project,&#34; is an initiative of Foundations for Social Change, a charitable organization based in Vancouver, in partnership with the University of British Columbia.\n Researchers gave 50 recently homeless people a lump sum of 7,500 Canadian dollars (nearly $5,700). They followed the cash recipients&#39; life over 12-18 months and compared their outcomes to that of a control group who didn&#39;t receive the payment.\n   The preliminary  findings, which will be peer-reviewed next year, show that those who received cash were able to find stable housing faster, on average. By comparison, those who didn&#39;t receive cash lagged about 12 months behind in securing more permanent housing .\n People who received cash were able to access the food they needed to live  faster. Nearly 70% did after one month, and maintained greater food security throughout the year.\n  The recipients spent more on food, clothing and rent, while there was a 39% decrease in spending on goods like alcohol, cigarettes or drugs.\n &#34;The homeless population continues to grow, and we keep applying the same old approaches,&#34; said Claire Williams, the CEO and co-founder of Foundations for Social Change.\n &#34;We really think it&#39;s important to start testing meaningful risk-taking in the name of social change,&#34; WIlliams added.\n The 115 participants in the randomized controlled trial were between the ages of 19 and 64, and they had been homeless for an average of 6 months. Participants were screened for a low risk of mental health challenges and substance abuse.\n Funding for the initiative came from a grant from the Canadian federal government, and from donors and foundations in the country.\n  &#34;One of the things that was most striking is that most people who received the cash knew immediately what they wanted to do with that money, and that just flies in the face of stereotypes,&#34; Williams told CNN.\n For example, she explained some cash recipients knew they wanted to use the money to move into housing, or invest in transportation -- getting a bike, or taking their cars to the repair shop to be able to keep their jobs. Others wanted to purchase computers. A number of them wanted to start their own small businesses.\n &#34;People very much know what they need, but we often don&#39;t equip them with the intervention or the services that really empowers them with choice and dignity to move forward on their own terms,&#34; Williams said.\n  Direct cash transfers are not &#34;a silver bullet for homelessness in general,&#34; and the program focused on &#34;a higher functioning subset of the homeless population,&#34; Williams said, but she believes the research shows that providing meaningful support to folks who have recently become homeless decreases the likelihood they will become entrenched in the experience.\n People who received the cash infusions were even able to set some money aside -- about 1,000 Canadian dollars on average through 12 months.\n The money provided by the program also had &#34;trickle down impacts,&#34; according to Williams, with people investing more in their children&#39;s well-being and needs, as well as helping out family members.\n &#34;There are these hidden impacts that we just don&#39;t anticipate and aren&#39;t necessarily quantifying, but now we&#39;re seeing that this is having an exponential effect on people&#39;s lives,&#34; Williams explained.\n  According to the research, reducing the number of nights spent in shelters by the 50 study participants who received cash saved approximately 8,100 Canadian dollars per person per year, or about 405,000 Canadian dollars over one year for all 50 participants.\n &#34;There&#39;s a common misconception that the cost of doing nothing is free or cheap and it absolutely is not,&#34; Williams said.\n  The risk of homelessness looms large for many across the United States, as people deal with job losses and economic uncertainty brought about by the coronavirus pandemic.\n &#34;We&#39;re hearing that from homeless providers in a lot of places, people who have never been homeless before are coming into shelters and have no idea what to do,&#34; Steve Berg, a vice president with the  National Alliance to End Homelessness, an American nonprofit organization, told CNN.\n &#34;It&#39;s a brand new experience for them, and they never dreamed that when they&#39;d be talking about homeless people they&#39;d be talking about themselves,&#34; said Berg, who was not involved in The New Leaf Project study.\n Innovative solutions to the issue are even more pressing right now. Berg thinks the research confirms what is true for many people experiencing homelessness: money can solve it.\n   &#34;There are certainly people who are homeless who have deeper, more severe problems,&#34; Berg explained, &#34;but for many people, it&#39;s simply a matter of -- they ran out of money, lost a job, fell on hard times, became homeless. Once they&#39;re homeless, it&#39;s very difficult to get enough money saved up in order to find a place to live.&#34;\n &#34;People can be relied on, if they get the money upfront, to take care of the problem themselves,&#34; Berg added.", "posttime": "2020-10-11 16:57:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人员,give,无家可归", "title": "当研究人员给无家可归的人数千美元时会发生什么？", "title_en": "What Happens When Researchers Give Thousands of Dollars to Homeless People?", "transed": 1, "url": "https://www.cnn.com/2020/10/09/americas/direct-giving-homeless-people-vancouver-trnd/index.html", "via": "", "real_tags": ["人员", "give", "无家可归"]}, {"category": "", "categoryclass": "", "imagename": "8e66310231844c81e8c1a483ae0f1309.png", "infoid": 1028075, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据报道，谷歌有限责任公司(Google LLC)正计划将其开源Kative项目的直接控制权让给一个由五个席位组成的指导委员会，该委员会将制定规则，防止任何一个组织拥有超过两个席位。\n据科技新闻网站The Protocol今天的一篇报道，该计划旨在平息外界对谷歌秘密计划保持对其开发的关键开源项目控制权的批评。Kative是一个开源项目，最先由谷歌开发，提供在Kubernetes之上部署、运行和管理无服务器、云原生应用的组件。Kubernetes是一个容器管理平台，也是由谷歌打造的，于2015年开源。\n无服务器应用程序可自动扩展和缩小以响应事件，无需手动增加额外的计算资源，从而提高了开发人员的工作效率并降低了运营成本。Kative是为公司提供一种方式来利用无服务器模式，容器应用程序可以在任何类型的计算平台上运行。\n报道称，谷歌正计划对Kative的治理结构做出一些重大改变。该委员会的席位现在将由个人而不是特定的公司持有，今年晚些时候将举行选举，选出两名新成员。此外，报道称，谷歌正在考虑最终将该委员会扩大到七名成员，以此作为纳入Kative用户社区代表的一种方式。\n就在几个月前，谷歌违背了将另一个项目Istio的控制权移交给云本地计算基金会(Cloud Native Computing Foundation)的承诺，激怒了开源软件界的一些成员。云本地计算基金会是Linux基金会的一个项目，成立于2015年，目的是帮助推进容器技术。\n今年7月，谷歌表示，它将创建一个名为Open Usage Commons的中立组织来管理其商标政策，而不是将Istio转移到CNCF，而控制将由该项目的指导委员会保持。\n这一决定令谷歌的许多合作伙伴感到不安，其中最引人注目的是IBM公司，该公司也为Istio的发展做出了巨大贡献。一些人表示，此举甚至可能是谷歌保持对Istio未来方向控制的秘密方式。批评人士说，问题在于谷歌控制了Istio指导委员会中有投票权的多数席位，这让开源支持者感到不安，他们认为Kubernetes这样的项目的中立性是他们成功的主要原因之一。\n谷歌终于在8月份采取行动平息了这些批评，宣布将改变Istio的治理结构，以防止任何一家公司获得控制权。\n通过一键订阅我们的YouTube频道(如下所示)，显示您对我们使命的支持。我们的订阅用户越多，YouTube向您推荐的相关企业和新兴技术内容就越多。谢谢!。\n…。我们还想告诉您我们的使命，以及您如何帮助我们完成它。SiliconANGLE Media Inc.的商业模式是基于内容的内在价值，而不是广告。与许多在线出版物不同的是，我们没有付费墙或投放横幅广告，因为我们想让我们的新闻保持开放，不受影响，也不需要追逐流量。关于SiliconANGLE的新闻、报道和评论-以及我们的硅谷演播室和CUBE的全球巡回视频团队提供的现场无脚本视频-需要大量的辛勤工作、时间和金钱。要保持高质量，需要赞助商的支持，这些赞助商与我们对无广告新闻内容的愿景保持一致。\n如果您喜欢这里的报道、视频采访等无广告内容，请花点时间查看一下我们赞助商支持的视频内容样本，发推特表示支持，并不断回到SiliconANGLE。", "note_en": "Google LLC is reportedly planning to relinquish direct control over its open-source Knative project to a five-seat steering committee that will have rules to prevent any single organization from having more than two seats.\n The plan is designed to stymie criticism that Google is secretly planning to retain control over key open-source projects it has developed, according to a  report today on the tech news website The Protocol.  Knative is an open-source project first developed by Google that provides components for deploying, running and managing serverless, cloud-native applications on top of Kubernetes, a container management platform that was also built by Google and open-sourced in 2015.\n Serverless apps automatically scale up and down in response to events without the need to spin up extra computing resources manually, leading to increased developer productivity and reduced operational costs. Knative was built to give companies a way to take advantage of the serverless model with container apps that can run on any kind of computing platform.\n Google is planning to make some major changes to Knative’s governance structure, according to the report. Seats on the committee will now be held by individuals rather than specific companies, and elections will be held later this year to select two new members. In addition, the report said, Google is considering eventually expanding the committee to seven members as a way to include representatives from Knative’s user community.\n The plan comes just a few months after Google angered some members of the open-source software community when it  reneged on a promise to hand over control of another project,  Istio, to the Cloud Native Computing Foundation, a Linux Foundation project that was founded in 2015 to help advance container technology.\n In July Google said that it instead of transferring Istio to the CNCF, it would create a neutral organization called Open Usage Commons to manage its trademark policies, while control would be maintained by the project’s steering committee.\n That decision  upset many of Google’s partners, most notably IBM Corp., which has also contributed greatly to the development of Istio. Some said the move could even be a secret way for Google to retain control over the future direction of Istio. The problem, critics said, was that Google controlled a voting majority of the seats on Istio’s steering committee, something that unnerves open-source proponents who believe the neutrality of projects like Kubernetes is one of the main reasons for their success.\n Google finally moved to calm those critics in August, announcing it would  change Istio’s governance structure to prevent any one company from taking control.\n  Show your support for our mission with our one-click subscription to our YouTube channel (below). The more subscribers we have, the more YouTube will suggest relevant enterprise and emerging technology content to you. Thanks!\n  … We’d also like to tell you about our mission and how you can help us fulfill it. SiliconANGLE Media Inc.’s business model is based on the intrinsic value of the content, not advertising. Unlike many online publications, we don’t have a paywall or run banner advertising, because we want to keep our journalism open, without influence or the need to chase traffic. The journalism, reporting and commentary on  SiliconANGLE — along with live, unscripted video from our Silicon Valley studio and globe-trotting video teams at   theCUBE — take a lot of hard work, time and money. Keeping the quality high requires the support of sponsors who are aligned with our vision of ad-free journalism content.\n If you like the reporting, video interviews and other ad-free content here, please take a moment to check out a sample of the video content supported by our sponsors,   tweet your support, and keep coming back to   SiliconANGLE.", "posttime": "2020-10-11 16:56:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开源,google,谷歌", "title": "报道：谷歌计划放弃对开源项目Kative的控制权", "title_en": "Report: Google Plans to Relinquish Control of Open-Source Project Knative", "transed": 1, "url": "https://siliconangle.com/2020/10/08/report-google-planning-relinquish-control-open-source-knative-project/", "via": "", "real_tags": ["开源", "google", "谷歌"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1028074, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "联邦调查局发布这一公告是为了鼓励美国人在使用酒店无线网络(Wi-Fi)进行远程工作时保持谨慎。联邦调查局观察到一种趋势，以前在家远程工作的人开始在酒店远程工作。主要位于大城市的美国酒店已经开始为寻求安静、无分心的工作环境的客人做日间客房预订广告。虽然这一选项可能很有吸引力，但从酒店Wi-Fi访问敏感信息会增加家庭Wi-Fi网络的安全风险。恶意攻击者可以利用不一致或松懈的酒店Wi-Fi安全和客人的安全自满来危害酒店客人的工作和个人数据。遵循良好的网络安全实践可以将使用酒店Wi-Fi进行远程工作的风险降至最低。\n攻击者以酒店为目标，获取客人姓名、个人信息和信用卡号码的记录。酒店环境涉及许多独立的客人，他们在有限的区域内运营，所有人都使用相同的无线网络。访客在很大程度上无法控制、验证或监控网络安全。网络犯罪分子可以利用这一环境监视受害者的互联网浏览或将受害者重定向到虚假登录页面。犯罪分子还可以通过创建与酒店网络名称类似的自己的恶意网络来进行“邪恶双胞胎攻击”。然后，客人可能会错误地连接到罪犯的网络，而不是酒店的网络，从而让罪犯直接访问客人的计算机。\n酒店网络的构建往往更看重客人的便利性，而不是强大的安全实践。较小的酒店通常会在服务台张贴标语牌，说明Wi-Fi访问的密码，并且很少更改此密码。在其最强大的时候，对酒店Wi-Fi网络的访问通常由房间号和密码的组合来管理。这种组合只管理访问酒店网络的设备，但不提供安全的互联网连接。目前，还没有针对安全Wi-Fi接入的酒店行业标准。如果在酒店远程办公，客人不应隐含地相信酒店已适当保护其网络安全或正在监控其网络是否存在攻击。\n酒店的大部分网络基础设施完全不受酒店客人的控制。客人通常对酒店内无线接入点的物理位置和网络设备的使用年限的可见性很低。陈旧、过时的设备更有可能存在犯罪分子可以利用的漏洞。即使酒店使用的是现代设备，客人也无法知道酒店更新设备固件的频率，也无法知道酒店是否更改了设备的默认密码。酒店客人在选择是否在酒店网络上远程办公时必须考虑这些因素。\n将个人或企业设备连接到酒店的无线网络可能会允许恶意行为者危害个人设备，然后访问客人雇主的企业网络。一旦恶意行为者获得商业网络的访问权限，他们就可以窃取专有数据并上传恶意软件，包括勒索软件。网络罪犯或民族国家行为者可以利用被盗的知识产权为自己的计划提供便利，或者生产假冒的专有产品。网络犯罪分子可以利用通过访问公司数据收集的信息来欺骗企业高管将公司资金转移给犯罪分子。\n如果你的设备遭到黑客攻击，很可能不会像娱乐业对电脑黑客的描述那样。您的设备可能看不到任何更改。可能表明您的计算机、电话或平板电脑已被攻破的一些迹象包括：\n如果可能，在远程工作时使用信誉良好的虚拟专用网络(VPN)来加密网络流量，使网络罪犯更难窃听您的在线活动。\n在旅行之前，请确保您的计算机操作系统(OS)和软件的所有补丁都是最新的；重要数据已备份；并且您的操作系统已安装并运行经过良好审查的最新安全或防病毒应用程序。\n使用公共Wi-Fi设置进行连接，并且在酒店网络上时不要启用自动重新连接。\n在浏览互联网时始终确认HTTPS连接；这由地址栏附近的锁定图标标识。\n避免访问敏感网站，如银行网站，或提供个人数据，如社保号码。\n确保无法发现任何连接到酒店Wi-Fi的设备，并且在不使用时禁用蓝牙。\n联邦调查局鼓励受害者向当地外地办事处(www.fbi.gov/contact-us/field-office)或联邦调查局互联网犯罪投诉中心(www.ic3.gov)报告有关可疑或犯罪活动的信息。有关远程工作时确保安全的其他资源和最佳实践，例如有关管理VPN、视频会议或使用无线设备进行远程工作的指导，请访问https://www.cisa.gov/telework.", "note_en": "The Federal Bureau of Investigation is issuing this announcement to encourage Americans to exercise caution when using hotel wireless networks (Wi-Fi) for telework. FBI has observed a trend where individuals who were previously teleworking from home are beginning to telework from hotels. US hotels, predominantly in major cities, have begun to advertise daytime room reservations for guests seeking a quiet, distraction-free work environment. While this option may be appealing, accessing sensitive information from hotel Wi-Fi poses an increased security risk over home Wi-Fi networks. Malicious actors can exploit inconsistent or lax hotel Wi-Fi security and guests’ security complacency to compromise the work and personal data of hotel guests. Following good cyber security practices can minimize some of the risks associated with using hotel Wi-Fi for telework.\n    Attackers target hotels to obtain records of guest names, personal information, and credit card numbers. The hotel environment involves many unaffiliated guests, operating in a confined area, and all using the same wireless network. Guests are largely unable to control, verify, or monitor network security. Cyber criminals can take advantage of this environment to monitor a victim’s internet browsing or redirect victims to false login pages. Criminals can also conduct an “evil twin attack” by creating their own malicious network with a similar name to the hotel’s network. Guests may then mistakenly connect to the criminal’s network instead of the hotel’s, giving the criminal direct access to the guest’s computer.\n  Hotel networks are often built favoring guest convenience over robust security practices. Smaller hotels will often post placards at the service desk stating the password for Wi-Fi access, and change this password very infrequently. At its most robust, access to a hotel Wi-Fi network is typically governed by a combination of room number and password. This combination only governs devices accessing the hotel’s network but does not provide a secure internet connection. Currently, there is no hotel industry standard for secure Wi-Fi access. If teleworking from a hotel, guests should not implicitly trust that the hotel has properly secured their network or is monitoring it for attacks.\n    Much of a hotel’s network infrastructure is entirely out of the control of the hotel guest. Guests generally have minimal visibility into both the physical location of wireless access points within the hotel and the age of networking equipment. Old, outdated equipment is significantly more likely to possess vulnerabilities that criminal actors can exploit. Even if a hotel is using modern equipment, the guest has no way of knowing how frequently the hotel is updating the firmware of that equipment or whether the hotel has changed the equipment’s default passwords. The hotel guest must take each of these factors into consideration when choosing whether to telework on a hotel network.\n    Connecting personal or business devices to the hotel’s wireless network may allow malicious actors to compromise the individual’s device and then access the business network of the guest’s employer. Once the malicious actor gains access to the business network, they can steal proprietary data and upload malware, including ransomware. Cybercriminals or nation-state actors can use stolen intellectual property to facilitate their own schemes or produce counterfeit versions of proprietary products. Cybercriminals can use information gathered from access to company data to trick business executives into transferring company funds to the criminal.\n    If your device is hacked, it probably will not resemble the entertainment industry’s portrayal of computer hacking. There may be no visible changes to your device. Some signs that may indicate your computer, phone, or tablet has been compromised include:\n          If possible, use a reputable Virtual Private Network (VPN) while teleworking to encrypt network traffic, making it harder for a cybercriminal to eavesdrop on your online activity.\n    Before travelling, ensure your computer’s operating system (OS) and software are up to date on all patches; important data is backed up; and your OS has a current, well-vetted security or anti-virus application installed and running.\n      Connect using the public Wi-Fi setting, and do not enable auto-reconnect while on a hotel network.\n  Always confirm an HTTPS connection when browsing the internet; this is identified by the lock icon near the address bar.\n  Avoid accessing sensitive websites, such as banking sites, or supplying personal data, such as social security numbers.\n  Make sure any device that connects to hotel Wi-Fi is not discoverable and has Bluetooth disabled when not in use.\n  The FBI encourages victims to report information concerning suspicious or criminal activity to their local field office ( www.fbi.gov/contact-us/field-offices) or to the FBI&#39;s Internet Crime Complaint Center ( www.ic3.gov). For additional resources and best practices for staying safe while teleworking—such as guidance on managing VPNs, videoconferencing, or using wireless devices for telework—visit  https://www.cisa.gov/telework.", "posttime": "2020-10-11 16:56:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,警告,fbi,酒店", "title": "美国联邦调查局警告使用酒店Wi-Fi存在安全风险", "title_en": "America's FBI Warns of Security Risks in Using Hotel Wi-Fi", "transed": 1, "url": "https://www.ic3.gov/media/2020/201006.aspx", "via": "", "real_tags": ["美国", "警告", "fbi", "酒店"]}, {"category": "", "categoryclass": "", "imagename": "5e55defe87aca3cc5dccbbf4d86a21d9.jpg", "infoid": 1028073, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着大麻的流行，越来越多的地方将娱乐用大麻合法化，越来越多的人在怀孕早期使用大麻。\n一项新的大型研究表明，这一选择可能会产生意想不到的影响。一项对11489名儿童的横断面分析发现，怀孕期间吸食大麻与晚年类似精神病的行为略有增加有关，其中655名儿童在子宫中暴露于 。\n虽然具有这些行为特征的女性在怀孕期间更有可能吸食大麻，但即使考虑到其他混杂因素，如遗传倾向，这种关系也是成立的。\n这种联系是否有因果关系则是另一回事--毕竟，研究人员可能还没有考虑到许多其他因素--但在其他研究的背景下，这是一个有趣的联系，值得进一步探讨。\n动物模型表明，大麻中的精神活性化合物THC通过发育中的大脑中的内源性大麻素受体起作用，而这些受体直到怀孕五六周后才会出现在人类胎儿身上。\n顺便说一句，这通常是女性得知自己怀孕的时候。因此，这项新研究的作者将重点放在那些即使在发现自己怀孕后仍继续使用大麻的人。\n在母亲知道怀孕之前而不是之后接触过的孩子与那些根本没有接触过的孩子没有什么不同。这进一步支持了内源性大麻素受体可能在儿童发育中发挥作用的观点。\n事实上，其他几条证据表明，产前暴露大麻与儿童注意力持续时间缩短和一些行为问题有关。\n但是，尽管关于大麻对健康影响的研究正在慢慢赶上合法化，但关于怀孕期间使用大麻的数据仍然远远落后。\n这可能会在不经意间伤害下一代。2019年对超过45万名孕妇进行的一项研究发现，大麻使用量在2002年至2017年间翻了一番多，达到7%。它现在是孕妇服用的最流行的违禁药物。\n据报道，大麻被用来治疗怀孕早期的恶心和呕吐，但几乎没有证据表明这是否真的有效，或者它是否安全。\n研究人员表示，在我们得到答案之前，卫生保健专业人员应该劝阻那些怀孕、哺乳甚至正在考虑要孩子的人不要使用大麻。\n有证据表明，胎儿中的THC浓度可能会有所不同，这取决于母亲是每月使用一次还是每天使用一次。\n但是怀孕期间的杂草剂量和暴露的时间根本没有太多的研究。研究人员也没有正确地研究食用和焚烧鲜花之间的区别。\n因此，目前还没有已知的怀孕或哺乳期大麻使用的安全水平。\n潜在的风险导致美国妇产科学会(ACOG)和美国儿科学会都建议不要在怀孕早期或哺乳期间使用大麻。\n他的公告解释说，在最后一次记录使用后的六天内，已经在母乳中发现了THC。\n它可能会影响新生儿的大脑发育，导致多动症、认知功能减退和其他长期后果。\n这条信息显然没有被传递出去。调查显示，孕妇不觉得他们的医生为他们提供了关于大麻的有用信息，这促使一些人到互联网上寻求答案。\n一项研究对牙买加非常小的孕妇样本进行了研究，这是网上分享最多的信息之一。在90年代进行的积极结果表明，没有明确的因果关系。但这些结果是基于过时的大麻，而这些大麻在THC中的含量并不像今天的许多植物那样高。\n自这项研究公布以来的几年里，已经有几项规模更大的研究发现了更令人担忧的结果。加拿大的一项研究发现，在超过66万例怀孕中，大麻的使用与早产、胎盘早剥、更多地进入重症监护病房以及较低的体重和阿普加评分有关。\n其中一些不良反应似乎是剂量依赖性的。例如，与较少使用大麻的女性相比，至少每周使用大麻的女性早产的可能性大约高出5%。\n美国的另一项研究发现，产前使用大麻与低出生体重的可能性增加50%有关。\n虽然怀孕期间饮酒和吸烟也与不良健康后果有关，但这些都已经有了很好的记录。但许多女性并不知道这些风险也可能伴随着产前接触杂草而来。\n因此，美国奥组委的一份分析报告显示，由于担心神经发育受损，以及孕妇和胎儿暴露在吸烟的不利影响之下，应该鼓励怀孕或打算怀孕的妇女停止使用大麻。", "note_en": "As cannabis surges in popularity and more places legalise recreational weed, a growing number of people are using the drug in early pregnancy.\n A large new study suggests there may be unexpected impacts of that choice. A cross-sectional analysis of 11, 489 children, 655 of whom were exposed to THC in the womb, has found cannabis use during pregnancy is tied to a small elevation in psychotic-like behaviours later in life.\n    While it could be that women with these behavioural features are more likely to use cannabis during pregnancy, the relationship stood even when other confounding factors, such as genetic predispositions, were considered.\n Whether or not this link is causal is another matter - after all, there are many other factors the researchers may not have considered - but in the context of other research, it&#39;s an interesting link worthy of further exploration.\n Animal models suggest THC - the psychoactive compound in cannabis - acts through endocannabinoid receptors in the developing brain, and these don&#39;t show up in the human fetus until five or six weeks into gestation.\n Incidentally, this is when women generally learn they are pregnant. As such, the authors of the new study focused on people who continued to use cannabis even after finding out they were pregnant.\n Children who were exposed prior to a mother&#39;s knowledge of pregnancy but not after showed no differences to those children that were not exposed at all. This further supports the idea that endocannabinoid receptors may play a role in child development.\n   Indeed,  several other lines of evidence have shown prenatal cannabis exposure is associated with decreased attention span and some behavioural problems in children.\n But while research on the health effects of cannabis is slowly catching up with legalisation, data on cannabis use during pregnancy is still lagging far behind.\n And that could be inadvertently harming the next generation. A 2019  study of over 450,000 pregnant women found cannabis use more than doubled between 2002 and 2017, reaching 7 percent. It&#39;s now the most popular illicit drug for pregnant women to take.\n Cannabis is reportedly used to deal with nausea and vomiting in early pregnancy, but there&#39;s little evidence to say whether this actually works or if it&#39;s safe.\n Until we have those answers, researchers say health care professionals should discourage those who are pregnant, breastfeeding or even contemplating having kids from using cannabis.\n Evidence suggests THC concentrations in the fetus can differ depending on whether the mother uses once per month or once per day.\n But the dosage of weed during pregnancy and the timing of the exposure has not been studied very much at all. Nor have researchers properly examined the differences between ingesting edibles or burning flower.\n   As such, there is currently  no known safe level of cannabis use during pregnancy or lactation.\n The potential risks have led the  American College of Obstetricians and Gynaecologists (ACOG) and the  American Academy of Pediatrics to both advise against using cannabis in early pregnancy or while breastfeeding.\n  &#34;THC has been found in breast milk for up to six days after the last recorded use,&#34; his announcement  explains.\n &#34;It may affect the newborn&#39;s brain development and result in hyperactivity, poor cognitive function, and other long-term consequences.&#34;\n That message clearly isn&#39;t getting through. Surveys  show pregnant patients do not feel like their doctors are providing them with useful information about cannabis, and this has driven some to the internet for answers.\n A  study looking at a very small sample of pregnant women in Jamaica is one of the most shared pieces of information online. Conducted during the 90s, the positive results  show no clear cause-and-effect relationship. But these results are based on outdated cannabis that was not nearly as high in THC as many plants are today.\n   In the years since this research came out, there have been several larger studies that have found much more worrying results.  A  study in Canada found that among more than 660,000 pregnancies, cannabis use was tied to a greater risk of preterm birth, placental abruption, greater admission to the intensive care unit, and lower weight and  Apgar scores.\n Some of these adverse effects appeared to be dose dependent. For instance, women using cannabis at least weekly, compared to less often, had a roughly  5 percent greater chance of preterm delivery.\n Another  study in the US found prenatal cannabis use was associated with a 50 percent increased likelihood of low birth weight.\n While alcohol and tobacco during pregnancy are also linked to adverse health outcomes, these are already well documented. But many women don&#39;t know these are risks that might also come with prenatal exposure to weed.\n &#34;Therefore,&#34;  reads an analysis from ACOG, &#34;because of concerns regarding impaired neurodevelopment, as well as maternal and fetal exposure to the adverse effects of smoking, women who are pregnant or contemplating pregnancy should be encouraged to discontinue marijuana use.&#34;", "posttime": "2020-10-11 16:55:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "儿童,behavioral,大麻", "title": "11000名儿童孕期使用大麻与儿童行为改变关系的研究", "title_en": "Study of 11,000 Kids Links Cannabis Use During Pregnancy To Child Behavioral Change", "transed": 1, "url": "https://www.sciencealert.com/using-weed-during-pregnancy-linked-to-behavioural-changes-in-kids", "via": "", "real_tags": ["儿童", "大麻"]}, {"category": "", "categoryclass": "", "imagename": "3a471c198f24e912d5d706116095c899.jpg", "infoid": 1028072, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天发布的Python3.9对该语言的特性和开发方式都带来了重大变化。Python在过去几年如雨后春笋般流行，它在数据科学和机器学习等快速发展的领域中的使用也呈爆炸式增长。该项目正在努力跟上所有新需求的步伐。\n到目前为止，Python已经以18个月的节奏开发和发布。PEP602建议Python开发团队采用年度发布周期，该建议已经被接受。\n每年的发布周期意味着每个版本的功能更少，但这也意味着对功能测试的反馈更快，每个版本的潜在破坏性更改更少，因此对用户和Linux发行版经理来说更有动力更频繁地升级Python。这也意味着在开发周期后期提出的新功能不需要那么长时间就可以投入到新版本中。\n新的时间表意味着Python3.9将于2020年10月发布。Python3.10于2020年5月19日正式启动Pre-Alpha开发，将在Python3.9发布时进入Alpha开发阶段，并将于2021年10月发布。未来的Python版本将遵循相同的模式。\n与前一个版本相比，Python的每个版本都有性能改进。Python3.9引入了两个重大改进，无需对现有代码进行任何更改即可提高性能。\n第一个改进涉及更多地使用Python3.8中引入的向量调用协议。Vector通过最小化或消除为调用创建的临时对象，使许多常用函数调用速度更快。在Python3.9中，几个Python内置组件-range、tuple、set、frozenset、list、dict-在内部使用Vector call来加快执行速度。\n第二大性能增强是更高效地解析Python源代码。CPython运行时的新解析器不是为解决性能问题而设计的，而是为了处理原始解析器中的内部不一致。但是，一个重要的附带好处是解析速度更快，尤其是对于大量代码而言。\nPython使操作常见数据类型变得容易，Python3.9通过字符串和字典的新特性扩展了这一简单性。对于字符串，有了新的方法来删除前缀和后缀，这些操作长期以来都需要大量的手动工作才能完成。对于字典，现在有联合运算符，一个用于将两个字典合并成一个新字典，另一个用于用另一个字典更新一个字典的内容。\n装饰器允许您包装Python函数，以编程方式改变它们的行为。以前，修饰符只能由@符号、名称(例如func)或带点的名称(func.method)以及可选的单个调用(func.method(arg1，arg2))组成。在Python3.9中，修饰符现在可以由任何有效表达式组成。\n绕过这一限制的一种长期方法是创建一个函数或lambda表达式，它在用作装饰符时代表更复杂的表达式。现在任何表达式都可以，只要它产生一些可以作为装饰符的东西。\n在过去的几个版本中，Python扩展了对类型提示的支持。这主要是为了使用链接器和代码检查器；在CPython中不会在运行时强制使用类型，也没有计划将Python变成一种静态类型的语言。但是类型提示是确保大型代码库中一致性的强大工具，因此Python代码仍然可以从类型提示中获益。\nPython3.9中引入了类型提示和类型注释的两个新特性。在其中之一，集合内容的类型提示-例如，列表和字典-现在在Python中本机可用。这意味着，例如，您可以将列表描述为LIST[INT]-整数的列表-而不需要类型库来执行此操作。\nPython类型机制的第二个补充是灵活的函数和变量注释。这允许使用带注释的类型来使用元数据描述类型，元数据可以提前(使用linting工具)或在运行时进行检查。例如，Annotated[int，ctype(&#34；char&#34；)]可以用来描述在C中应该被视为char类型的整数。默认情况下，Python不会对这样的注释做任何事情，但是它可以由代码链接器使用。\n清理、提炼和现代化Python的内部结构是Python开发人员正在进行的一项计划，Python3.9在这方面做了一些更改。\n第一个是重新设计模块与进口机器交互的方式。用C编写的Python扩展模块现在可以使用一种新的加载机制，使它们在导入时的行为更像常规的Python模块。Python的标准库中有几个模块新支持此行为：_abc、audioop、_bz2、_codecs、_contextvars、_crypt、_functools、_json、_locale、Operator、resource、time、_winnref。新的加载机制不仅允许Python更加灵活地处理扩展模块，还支持高级挂钩行为等新功能。\n第二个清理计划是CPython的稳定内部ABI，保证在Python3的生命周期内持续。从历史上看，Python的每个主要版本都与以前的版本不兼容，需要为每个新版本重新编译扩展模块。从现在开始，任何使用稳定ABI的扩展模块都将跨Python版本工作。在Python3.9中，标准库中的以下模块使用稳定的ABI：audioop、ast、grp、_hashlib、pwd、_posxsubprocess、Random、select、struct、termios、zlib。\nPython的标准库现在支持IANA时区数据库。Said数据库维护良好，使用广泛，在Python的DateTime库中直接使用它将是一个很大的，呃，节省时间的方法。\n新的字符串方法允许轻松删除前缀和后缀。这是常见的日常使用场景之一，它需要的样板比看起来必要的要多一点。新的.removeprefix()和.removesuffix()方法返回字符串的修改副本减去有问题的前缀或后缀，前提是它们存在于字符串中。", "note_en": "Python 3.9, released today, brings forward significant changes to both the features of the language and to how the language is developed. Python has mushroomed in popularity the last few years, and its use has exploded in rapidly evolving areas such as data science and machine learning. The project is working hard to keep pace with all of the new demands.\n    Up until this point, Python has been developed and released on an eighteen-month cadence.  PEP 602 proposed that the Python development team adopt an annual release cycle, and that proposal has been accepted.\n An annual release cycle means fewer features per release, but it also means faster feedback on feature testing, fewer potentially breaking changes for each release, and thus more incentive for users and Linux distribution managers to upgrade Python more often. It also means new features proposed late in the development cycle won’t take as long to be rolled into a new release.\n The new timeline means Python 3.9 will ship in October 2020. Python 3.10 officially started pre-alpha development on May 19, 2020, will enter the alpha development phase when Python 3.9 ships, and will ship in October 2021. Future Python releases will follow the same pattern.\n  Every revision of Python enjoys performance improvements over the previous version. Python 3.9 rolls in two big improvements that boost performance without requiring any changes to existing code.\n  The first improvement involves more use of the   vectorcall protocol introduced in Python 3.8.  vectorcall makes many common function calls faster by minimizing or eliminating temporary objects created for the call. In Python 3.9, several Python built-ins —  range, tuple, set, frozenset, list, dict — use  vectorcall internally to speed up execution.\n  The second big performance enhancer is more efficient parsing of Python source code. The  new parser for the CPython runtime wasn’t designed to address performance issues, but rather to deal with internal inconsistencies in the original parser. However, an important fringe benefit is faster parsing, especially for large volumes of code.\n   Python makes it easy to manipulate common data types, and Python 3.9 extends this ease with new features for strings and dictionaries. For strings, there are  new methods to remove prefixes and suffixes, operations that have long required a lot of manual work to pull off. For dictionaries, there are now  union operators, one to merge two dictionaries into a new dictionary and one to update the contents of one dictionary with another dictionary.\n  Decorators let you wrap Python functions to alter their behaviors programmatically. Previously, decorators could only consist of the @ symbol, a name (e.g.  func) or a dotted name ( func.method) and optionally a single call ( func.method(arg1, arg2)). With Python 3.9,  decorators can now consist of any valid expression.\n One long-standing way to get around this restriction was to create a function or lambda expression that would stand in for a more complex expression when used as a decorator. Now any expression will do, provided it yields something that can function as a decorator.\n  Over the last few versions, Python has expanded support for type hinting. This is mainly for the sake of linters and code checkers; types aren’t enforced at runtime in CPython, and there are no plans to make Python a statically typed language. But type hinting is a powerful tool to ensure consistency in large codebases, so Python code can still benefit from having type hints.\n  Two new features for type hinting and type annotations made their way into Python 3.9. In one,  type hints for the contents of collections — e.g., lists and dictionaries — are now available in Python natively. This means you can for instance describe a list as  list[int] — a list of integers — without needing the  typing library to do it.\n The second addition to Python’s typing mechanisms is  flexible function and variable annotations. This allows the use of the  Annotated type to describe a type using metadata that can be examined ahead of time (with linting tools) or at runtime. For instance,  Annotated[int, ctype(&#34;char&#34;)] could be used to describe an integer that should be considered as a  char type in C. By default, Python would do nothing with such an annotation, but it could be used by code linters.\n  Cleaning up, refining, and modernizing Python’s internals is an ongoing initiative for Python’s developers, and Python 3.9 has a couple of changes in that vein.\n The first is a redesign of the way modules interact with the import machinery. Python extension modules, written in C, may now use a  new loading mechanism that makes them behave more like regular Python modules when imported. Several modules in Python’s standard library newly support this behavior:  _abc, audioop, _bz2, _codecs, _contextvars, _crypt, _functools, _json, _locale, operator, resource, time, _weakref. The new loading mechanism not only allows extension modules to be handled more flexibly by Python, but also enables new capabilities such as advanced hooking behaviors.\n The second cleanup initiative is a stable internal ABI for CPython, one guaranteed to last for the lifetime of Python 3. Historically, each major revision of Python has been ABI-incompatible with previous versions, requiring extension modules to be recompiled for every new version. From now on, any extension modules that use the stable ABI will work across Python versions. With Python 3.9, the following modules in the standard library use the stable ABI:  audioop, ast, grp, _hashlib, pwd, _posixsubprocess, random, select, struct, termios, zlib.\n  Python’s standard library now supports the IANA Time Zone Database. Said database is well-maintained and widely used, and having a direct way to use it in Python’s datetime library will be a big, er, time-saver.\n New string methods allow easy removal of prefixes and suffixes. This is one of those common, everyday usage scenarios that required a little too much boilerplate than seemed necessary. The new  .removeprefix() and  .removesuffix() methods return a modified copy of a string minus the prefix or suffix in question, provided they exist in the string.", "posttime": "2020-10-11 16:54:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "python,python3,功能,significant", "title": "新的Python3.9给语言功能带来了“重大变化”", "title_en": "New Python 3.9 'Brings Significant Changes' To Language Features", "transed": 1, "url": "https://www.infoworld.com/article/3543885/python-39-whats-new-and-better.html", "via": "", "real_tags": ["python", "python3", "功能"]}]