[{"category": "", "categoryclass": "", "imagename": "590dfaec5d7e39dd71ed962cd4497989.jpeg", "infoid": 1068105, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "网络设备制造商Zyxel是有效和持续攻击的警告客户，这些客户是针对公司的防火墙和其他类型的安全设备的范围。\n 在电子邮件中，该公司表示，目标设备包括具有启用远程管理或SSL VPN的安全设备，即在USG / ZyWall，USG Flex，ATP和VPN系列上运行的ZLD固件运行。电子邮件中的语言是简洁的，但似乎可以说攻击被暴露于互联网的目标设备。当攻击者成功访问设备时，电子邮件进一步似乎可以说，它们可以连接到先前未知的帐户硬连线到设备中。\n  “我们意识到这种情况，并一直在努力调查和解决它，”发布到Twitter的电子邮件说。 “威胁演员尝试通过WAN访问设备;如果成功，他们然后绕过身份验证并使用未知的用户帐户建立SSL VPN隧道，例如“Zyxel_Silvpn，”zyxel_ts，“或”zyxel_vpn_test“，以操纵设备＆＃39; s配置。”\n 如果攻击的弱点是新的或以前已知的，则仍然不清楚。同样不清楚是有多少客户受到攻击，他们的地理故障是什么，以及攻击成功损害客户设备或只是试图这样做。\n  最初从欧洲用户报告，Zyxel意识到一种复杂的威胁演员，试图通过WAN访问Zyxel安全设备的子集，以便绕过身份验证并建立具有未知用户帐户的SSL VPN隧道。 Zyxel目前正在评估攻击向量，以确定这是否是已知的或未知的漏洞。\n Zyxel开发了指导，使用户能够暂时减轻安全事件并包含威胁。 SOP已发送给USG / Zywall，USG Flex，ATP或VPN系列设备的所有注册用户。 Zyxel正在开发一个固件更新，以解决如SOP中所述的用户界面安全实践，以减少攻击表面。\n 此时受影响的客户的数量是未知的，因为似乎被剥削的设备具有可公开访问的Web管理，并且不会被锁定。 \n基于迄今为止可用的模糊细节，漏洞听起来让人想起CVE-2020-29583，该CVE-2020-29583源于具有使用硬编码密码“PROW！AN_FXP”的完整管理系统权利的无证账户。然而，当Zyxel在1月份修复漏洞时，该帐户被列为“ZYFWP”，该名称不会出现在本周向客户发送给客户的电子邮件Zyxel中。\n    在任何情况下，所述电子邮件都表示，客户保护其Zyxel设备的最佳方式是遵循在此发布的指南。该指南包含通用建议，例如使用最低特权可能，修补设备，使用双因素身份验证以及遗骸的网络钓鱼攻击威胁。\n 该电子邮件作为防火墙，VPN和用于保护网络的其他设备被出现为黑客推动Ransomware或间谍活动攻击的密钥矢量。设备通常位于网络周边，以过滤或阻止移动到组织或脱离组织的流量。突破后，这些设备通常会使攻击者能够枢转到内部网络。\n 在过去几年中，FortiGate SSL VPN中的漏洞以及竞争脉冲安全SSL VPN遭到攻击。来自SonicWALL的设备也通过安全漏洞受到损害。威胁显示安全设备如何在不仔细锁定时实际上可以使网络更不安全。 ", "note_en": "Network device maker Zyxel is warning customers of active and ongoing attacks that are targeting a range of the company’s firewalls and other types of security appliances.\n In an email, the company said that targeted devices included security appliances that have remote management or SSL VPN enabled, namely in the USG/ZyWALL, USG FLEX, ATP, and VPN series running on-premise ZLD firmware. The language in the email is terse, but it appears to say that the attacks target devices that are exposed to the Internet. When the attackers succeed in accessing the device, the email further appears to say, they are then able to connect to previously unknown accounts hardwired into the devices.\n  “We’re aware of the situation and have been working our best to investigate and resolve it,” the email, which was  posted to Twitter, said. “The threat actor attempts to access a device through WAN; if successful, they then bypass authentication and establish SSL VPN tunnels with unknown user accounts, such as ‘zyxel_silvpn,’ ‘zyxel_ts,’ or ‘zyxel_vpn_test,’ to manipulate the device&#39;s configuration.”\n It remains unclear if the weaknesses under attack are new or were previously known. Equally unclear is how many customers are under attack, what their geographical breakdown is, and if attacks are successfully compromising customer devices or simply attempting to do so.\n  Initially reported from users in Europe, Zyxel became aware of a sophisticated threat actor that attempts to access a subset of Zyxel security devices through the WAN in order to bypass authentication and establish SSL VPN tunnels with unknown user accounts. Zyxel is currently evaluating the attack vectors to determine whether this is a known or unknown vulnerability.\n Zyxel has developed guidance to enable users to temporarily mitigate the security incident and contain the threat. A SOP was sent out to all registered users of USG/ZyWALL, USG FLEX, ATP, or VPN series devices. Zyxel is developing a firmware update to address user interface security practices as described in the SOP to reduce the attack surface.\n The number of affected customers is unknown at this time because it appears that the devices being exploited have their web management publicly accessible and are not locked down.\n Based on the vague details available so far, the vulnerability sounds reminiscent of  CVE-2020-29583, which stemmed from an undocumented account with full administrative system rights that used the hardcoded password “PrOw!aN_fXp.” When Zyxel  fixed the vulnerability in January, however, the account was listed as “zyfwp,” a name that doesn’t appear in the email Zyxel sent to customers this week.\n    In any event, the email said that the best way for customers to secure their Zyxel devices is to following guidelines published  here. The guidelines contain generic advice such as configuring appliances using the lowest privileges possibile, patching devices, using two-factor authentication, and remaining wary of phishing attacks.\n The email comes as firewalls, VPNs, and other devices used to secure networks have emerged as a key vector for hackers pushing ransomware- or espionage-motivated attacks. The appliances typically sit at the network perimeter to filter or block traffic moving into or out of the organization. Once breached, these devices often give attackers the ability to pivot to internal networks.\n In the past few years, vulnerabilities in the Fortigate SSL VPN, and the competing Pulse Secure SSL VPN  have  come  under  attack. Devices from  Sonicwall have also been compromised through security vulnerabilities. The threats show how security appliances can actually make networks less secure when they’re not carefully locked down.", "posttime": "2021-06-25 04:32:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,unknown,攻击", "title": "黑客正在使用未知的用户帐户来定位Zyxel防火墙和VPN ", "title_en": "Hackers are using unknown user accounts to target Zyxel firewalls and VPNs", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/06/zyxel-scrambles-to-thwart-active-hacks-targeting-customers-firewalls-and-vpns/", "via": "", "real_tags": ["黑客", "unknown", "攻击"]}, {"category": "", "categoryclass": "", "imagename": "456d9075d9680c772e40f8971eb7dafd.jpg", "infoid": 1068103, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "订阅更好，提高客户体验，并持有经常性和更可预测的收入流的承诺 - 对任何业务的令人兴奋的前景。这款商业模式是作为服务（SaaS）的软件主导的，但很难找到一个没有成功订阅故事的行业。越来越多的部门公司从汽车，航空公司，博彩和健康到健康，教育，专业发展和家庭维护的近年来一直在推出认购服务。\n  但是，企业应该意识到订阅模式远不仅仅是将每月或年度价格标签放在其产品上。高管不能只在现有业务的顶部层层。他们需要更改整个操作流程，船上所有利益相关者，重新校准其战略并创建订阅文化。\n 虽然70％的商业领袖认为订阅将是他们未来的关键，但只有55％的公司认为他们已经为过渡准备了。在谈话之前，这是一个推动者，公司应该首先将以下核心问题解决到全面计划并切换到重复的收入模型。\n  拟合支付代理模型的传统公司可能会对订阅模型移位只是销售问题。他们错了。这种迁移将影响组织的几乎所有部门，从产品开发和制造业到金融，销售，营销和客户服务。因此，领导者必须让所有利益攸关方能够改变，并赋予他们积极准备转型。你准备好了，更顺畅的过渡。\n 但正如我们所知，人们自然不喜欢改变，即使它是为了自己的好处。因此，它可以是一个强大的任务，以确保所有内部利益相关者的合作，这取决于贵公司的大小，可以在数千人中编号。 ", "note_en": "Subscriptions scale better, enhance customer experience and hold the promise of recurring and more predictable revenue streams — a pretty enticing prospect for any business. This business model is predominant in software as a service (SaaS), but it is hard to find an industry that doesn’t have a successful subscription story. A growing number of companies in sectors ranging from automotive, airlines, gaming and health to wellness, education, professional development and home maintenance have been introducing subscription services in recent years.\n  However, businesses should be aware that the subscription model is much more than simply putting a monthly or annual price tag on their offering. Executives cannot just layer a subscription model on top of an existing business. They need to change the entire operation process, onboard all stakeholders, recalibrate their strategy and create a subscription culture.\n While  70% of business leaders believe subscriptions will be key to their future, only  55% of companies believe they’re ready for the transition. Before talking technology, which is an enabler, companies should first address the following core issues to holistically plan and switch to a recurring revenue model.\n  Legacy companies accustomed to pay-as-you-go models may assume shifting to a subscription model is just a sales issue. They are wrong. Such a migration will affect nearly all departments across an organization, from product development and manufacturing to finance, sales, marketing and customer service. Leaders must therefore get all stakeholders motivated for the change and empower them to actively prepare for the transformation. The better you prepare, the smoother the transition.\n But as we know, people naturally do not like change, even if it is for their own good. So it can be a formidable task to secure the cooperation of all internal stakeholders, which, depending on the size of your company, could number in the thousands.", "posttime": "2021-06-25 04:32:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "商业,订阅,resolve", "title": "在切换到订阅商业模式之前要解决的3个问题 ", "title_en": "\n\t\t\t\t3 issues to resolve before switching to a subscription business model\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/3-issues-to-resolve-before-switching-to-a-subscription-business-model/", "via": "", "real_tags": ["商业", "订阅", "resolve"]}, {"category": "", "categoryclass": "", "imagename": "8fc0ad9f96fe142b63658b04f21e9b91.png", "infoid": 1068102, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Ghodsi与2013年共同创立的Databricks以及2013年的少数合作伙伴，了解用于大数据处理的开源Apache Spark Analytics引擎。与如此多的开源公司，Ghodsi有这么多的案例，他有博士学位。从瑞典的Kth /皇家理工学院，其研究专注于分布式计算，是火花发动机的原始开发人员之一。在Databricks，他首先曾在2016年被命名首席执行官之前担任公司的工程和产品管理副总裁。\n 根据他的领导下，DataBroicks达到了280亿美元的估值，现在已经提高了19亿美元。该公司对开源，数据和AI的赌注明确地偿还并与其中一些竞争对手不同，DataBroks在趋势方面取得了很好的工作（并且有一点幸运，鉴于其中一些趋势，包括崛起机器学习，真的有益于公司）。\n  尽管近年来，尽管微软和其他人试图获得公司的宗旨，Ghodsi和他的董事会明确决定他们希望保持独立。相反，Databricks已经与所有大型云播放器进行了精明的，与Microsoft开始，它实际上为其Azure云计算服务和用户界面中的Prime展示中尚未闻名的服务。最近，该公司将其平台带到了谷歌云。\n Ghodsi将加入我们的TC课程：SaaS谈谈建立他的公司，在疯狂估值中提高资金以及AI空间中数据管理的未来看起来像。\n 75美元的早期鸟票销售时间为10月1日。立即抓住您的机票，并获得如何从已经完成其所做的CEO的CEOS扩展B2B和B2C公司的洞察。符合低码/没有代码的创始人建筑，符合投资者削减支票，并发现下一代SaaS启动桥接数据具有新技术。 ", "note_en": "Ghodsi co-founded Databricks together with a handful of partners in 2013 with the idea of commercializing the open-source Apache Spark analytics engine for big data processing. As is the case with so many open-source companies, Ghodsi, who has a Ph.D. from KTH/Royal Institute of Technology in Sweden and whose  research focused on distributed computing, was one of the original developers of the Spark engine. At Databricks, he first served as the company’s VP of Engineering and Product Management before being named CEO in 2016.\n Under his leadership, Databricks has reached a $28 billion valuation and has now raised a total of $1.9 billion. The company’s bets on open source, data and AI are clearly paying off and unlike some of its competitors, Databricks has done a good job staying ahead of the trends (and had a bit of luck given that some of those trends, including the rise of machine learning, really benefitted the company, too).\n  Despite consistent rumors of Microsoft and others trying to acquire the company in recent years, Ghodsi and his board have clearly decided that they want to remain independent. Instead, Databricks has shrewdly partnered with all of the big cloud players, starting with Microsoft, which actually gave the service the kind of  prime placement in its Azure cloud computing service and user interface that was previously unheard of. Most recently, the company brought its platform  to Google Cloud.\n Ghodsi will join us at  TC Sessions: SaaS to talk about building his company, raising funding at crazy valuations and what the future of data management in the AI space looks like.\n $75 Early Bird ticket sales end October 1.  Grab your ticket today and gain insights on how to scale your B2B and B2C company from CEOs who have done it themselves. Meet the founders building with low code/no code, meet the investors cutting the checks, and discover the next generation of SaaS startups bridging data with new technologies.", "posttime": "2021-06-25 04:31:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "tc,founder", "title": "Databricks联合创始人兼首席执行官Ali Ghodsi即将到达TC会话：SaaS ", "title_en": "\n\t\t\t\tDatabricks co-founder and CEO Ali Ghodsi is coming to TC Sessions: SaaS\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/databricks-co-founder-and-ceo-ali-ghodsi-is-coming-to-tc-sessions-saas/", "via": "", "real_tags": ["tc", "founder"]}, {"category": "", "categoryclass": "", "imagename": "e29940248baf36adfdfaea76b1d844e4.png", "infoid": 1068101, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Joe Biden总统和Kamala Harris副总裁周四同意了1.2万亿美元的两亿美元的基础设施计划，包括在全国范围内建立高速通用宽带。基础设施框架将使用来自Biden＆＃39;拟议的美国工作计划的三分之二的资源，还包括清洁的运输，清洁水基础设施，可再生能源基础设施和气候变化弹性。\n 根据该计划，将投资6.5亿美元的宽带。它提出了宽带基础设施的州和当地投资，以及使用5G频谱拍卖的收益。\n  它＆＃39;从3月份拜登提出的2.25万亿基础设施计划向后倒退，其中包括1000亿美元用于宽带基础设施。 3月份，拜登谈到了数字鸿沟，超过3000万美国人无权进入宽带，而居住在城市和郊区市场面临过于昂贵的宽带票据。\n ＆＃34;民主需要妥协，＆＃34;白宫在星期四发布的情况下说。 ＆＃34;历史悠久的两党基础设施​​框架将使数百万美国人更好，创造一代好支付的联盟工作和经济增长，并将美国赢得21世纪。＆＃34;\n 新的基础设施框架还包括支出75亿美元，以沿着电动车辆（EV）充电器的高速公路建立国家网络，作为Biden＆＃39;计划建立500,000名EV充电器的一部分。\n  在CNET＆＃39;移动专家发现智能手机和运营商的最新消息和最佳评论。 ", "note_en": "President Joe Biden and Vice President Kamala Harris on Thursday agreed to a  $1.2 trillion bipartisan infrastructure plan that includes building out high-speed universal broadband across the nation. The infrastructure framework will use two-thirds of the resources from   Biden&#39;s proposed American Jobs Plan, and also includes clean transportation, clean water infrastructure, renewable energy infrastructure and climate change resilience.\n Under the plan, $65 billion will be invested in broadband for all. It proposes state and local investment in broadband infrastructure as well as using the   proceeds from 5G spectrum auctions.\n  It&#39;s a step backwards from the   $2.25 trillion infrastructure plan previously proposed by Biden in March, which included $100 billion for broadband infrastructure. In March, Biden spoke about the   digital divide, and how more than 30 million Americans have no access to broadband while those living in urban and suburban markets face broadband bills that are too expensive.\n &#34;Democracy requires compromise,&#34; the White House said in a fact sheet published Thursday. &#34;The historic Bipartisan Infrastructure Framework will make life better for millions of Americans, create a generation of good-paying union jobs and economic growth and position the United States to win the 21st century.&#34;\n The new infrastructure framework also includes spending $7.5 billion to build a   national network along highways of electric vehicle (EV) chargers as part of   Biden&#39;s plan to build 500,000 EV chargers.\n  Discover the latest news and best reviews in smartphones and carriers from CNET&#39;s mobile experts.", "posttime": "2021-06-25 04:23:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "计划,universal,基础设施", "title": "Biden的新增1.2万亿美元的基础设施计划包括650亿美元用于通用宽带 ", "title_en": "Biden's New $1.2 Trillion Infrastructure Plan Includes $65 Billion for Universal Broadband", "transed": 1, "url": "https://www.cnet.com/news/bidens-new-1-2-trillion-infrastructure-plan-includes-65b-for-universal-broadband/", "via": "", "real_tags": ["计划", "universal", "基础设施"]}, {"category": "", "categoryclass": "", "imagename": "5c8328800441a669b73432d0edd42942.png", "infoid": 1068099, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "前两个时刻之间的主要区别是马里奥徒步（左）或骑yoshi（右）。左侧两会之间的差异是马里奥在户外与Goomba（顶部），或室内与鲍尔（底部）。通过想象这样的东西来填补空白，您可能能够解决上面的类比，以填补空白：\n    在这个类似的解决方案中，马里奥在室内与鲍泽（如底部），骑yoshi而不是步行（如右侧）。如果你是马里奥·凡士队，你也可能注意到这些图像不是真正的马里奥游戏，但我打赌的人没有让你解决类比的更难。\n  这种类似的代理对人类来说很容易，但很难解释一下，这并不明显机器可以做到这一点。下面，我们展示了如何培训计算机以了解这一类比，并提供一些互动示例。\n  因为游戏很重要：媒体，包括电子游戏，是我们生命的重要组成部分，并对媒体进行思考很重要。按类比搜索是游戏学者和批评者的工具，可以实现新的分析。\n  因为游戏是试验可能具有更广泛应用程序的想法的好地方：通常在您进行网络搜索或使用具有预测文本的键盘时，您将从相同的底层技术（Word Embeddings）受益于类比时受益可能的。视频名称是一个新的实验这些想法的地方，我们在这些实验中学的学习可能具有在其他域中的应用程序（例如，文本，音乐，图像，视频等）。\n     对于计算机在视频名时刻获得句柄，它需要转换为数字。对于一个人类的播放器，游戏中的每一刻都有许多功能，我们可以想象这些功能如何分为数字。在Mario游戏中，这可能包括收集的硬币数量，屏幕上的敌人数量，剩余的终身数量，得分等：\n    这些都是我们可能会挑选为Mario游戏的功能，但从现在开始让我们将这些中的每一个视为一些抽象的东西（特征x，特征y等）。其余的这种解释是有效的，即使我们不知道任何个别特征是什么意思（例如，如果他们是一个不熟悉的游戏，或者他们是由机器学习生成的）。如果我们随着时间的推移查看游戏图的图表，我们可以看到每个时刻是如何组合的这些功能： \n我们可以为每个功能分配数值，并创建数字的向量（列表）以表示任何特定的电子游戏时刻。现在每个单独的时刻只是一个长期的数字列表：\n         现在我们已经将游戏中的每一刻转化为数字列表，我们可以为这些时刻做有趣的事情（用数学）！这是教授计算机理解类比的第一步。实际上，我们每一刻的向量都将包含许多功能的值，但如果我们假装一会儿，则更容易说明这一解释的其余部分。在这种情况下，我们的电子游戏矩向量可能看起来像这样：\n    我们可以想象一个带有特征x的图形（在x轴上），功能y（在y轴上）。如果游戏只有这两个功能，则每个可能的时刻都存在于此2D图的某处。这是所有可能的游戏状态的抽象空间的表示。 （这也是为什么我们不得不简化 - 如果我们的矢量中的每个功能都在这个图表中添加了另一个维度，它将在页面上绘制它很快就会变得不可能。）所以，坚持这个简化的版本，我们可以把时刻a和从该图表上页面顶部的示例中的矩B向量。\n    我们可以在矢量和时刻B向量之间的瞬间之间取得差异来获取一个新的传染媒介（BA），从而消除它们的共同点（Mario在户外），但叶完好无损，它们之间是不同的（徒步上的Yoshi上的vs） 。该操作（B-A）的结果是一个差异矢量，在这种情况下，我们认为代表了那一刻的YoShiness的东西。\n      现在我们有一个差异矢量代表yoShiness（ba）等东西，我们可以将它添加到它中没有Yoshi的那一刻（矩C，来自上面的例子），并希望找到一个关键差异的等效片刻（对上面的类比，矩C + Yoshi的解决方案。\n    这是VideoGame Scipt搜索的本质，但是有一个最终重要的皱纹，这是使这种搜索形式的部分。虽然我们可以想象一个包含游戏中所有可能的时刻的图表，但对于大多数游戏，我们只能与这些时刻的一个小样本一起使用。如果我们寻找的那一刻，那个样本不存在什么？如果我们正在寻找的那一刻，甚至可能是什么？\n  在这种情况下，我们仍然将差异矢量（b-a）添加到另一个（时刻c），而不是直接向我们提供答案，这会创建查询矢量。 \n现在我们有一个查询矢量，我们可以将其与我们在我们的样本中实际拥有的所有瞬间进行比较（如下图所示）。单个最近的时刻是我们的类比搜索结果，刻度D.\n      有一个诀窍我们可以做到这一点会使我们的图表有点有用。现在轴不是非常有意义的，但我们可以通过旋转和转换图来改变它。我们可以实现这种方式，这使得与矩的矩传染媒介垂直（按余弦相似测量）相似，并且与B-A差异矢量的相似。这给了我们一个y轴，告诉我们每个时刻的瞬间c和x轴，告诉我们我们定义了多少（例如，yoShiness）的x轴。我们还可以包括每个时刻对查询矢量的相似，以每个点的大小和颜色编码。\n    下面的交互式包含几个游戏的逐个类别成功的例子。所有使用的时刻来自每场比赛的人类演奏（超级马里奥世界和超级狂欢）。该图表显示了样本中的每一刻，它与差异矢量（Ba，X轴上）的相似性，其与时刻C（在Y轴上）的相似性以及它对查询向量的关闭程度c（DOT尺寸和颜色）。您可以在任何时刻绕过图表和鼠标滚动，以获取更多详细信息。您还可以制作自己的查询（更改时刻A，B和C），并查看会发生什么：\n  结合了几个旧想法：第一个概念是，可以将许多不同类型的东西代表为抽象空间中的载体。言语，面孔和许多其他东西都可以转变为在适当的空间内装有的矢量。\n  第二个重要概念是，这些矢量之间的关系可能是惊人的有意义的。这里最着名的结果是＆＃34;王 - 男人+女人=女王＆＃34;，字向量之间的数学关系捕获了单词之间的类比关系。\n  将它们应用于一个新域：之前，这些想法尚未应用于电子游戏中的时刻。只有最近已经完成了该工作以创建嵌入视频游戏时刻的抽象空间，并且仍在探索可能的应用程序。 ", "note_en": "The primary difference between the top two moments was that Mario was on foot (left) or riding Yoshi (right). The difference between the two moments on the left was that Mario was outdoors with a goomba (top), or indoors with Bowser (bottom). You were probably able to solve the analogy above, by imagining something like this to fill in the blank:\n    In this analogical solution, Mario is indoors with Bowser (as on the bottom), and riding Yoshi instead of on foot (as on the right). If you’re a Mario fan you probably also noticed that these images aren’t from a real Mario game, but I bet that did not make it any harder for you to solve the analogy.\n  This kind of analogical reasoning is easy for humans to do, but hard for them to explain, and it is not obvious that a machine can do it at all. Below, we show how a computer can be trained to understand this analogy, and provide a few interactive examples.\n  Because games matter: Media, including videogames, is an important part of our lives, and thinking about  media  critically is important. Search by analogy is a tool for game scholars and critics that will make new kinds of analysis possible.\n  Because games are a good place to experiment with ideas that might have broader applications: Often when you conduct a web search or when you use a keyboard with predictive text, you are benefiting from the same underlying technology ( word embeddings) that makes search by analogy possible. Videogame moments are a new place to experiment with these ideas, and what we learn in these experiments might have applications in other domains (e.g. text, music, images, video, etc.).\n     For a computer to get a handle on a videogame moment, it will need to turned into a something numerical. To a human player, each moment in a game has many features, and we can imagine how those features can be broken down into numbers. In a Mario game this could include things like the number of coins collected, the number of enemies on the screen, the number of lives remaining, score, and so on:\n    These are all the sort of things that we might pick out as features for a Mario game, but from now on let’s treat each of these as something a little more abstract (Feature X, Feature Y, etc.). The rest of this explanation works even if we have no idea what any of the individual features mean (e.g., if they are for an unfamiliar game, or if they were generated by machine learning). If we look at a graph of gameplay over time, we can see how each moment is a combination of these features:\n    We can assign a numeric value to each feature and create a vector (list) of numbers to represent any specific videogame moment. Now each individual moment is just a long list of numbers:\n         Now that we have turned each moment in the game into a list of numbers, we can do interesting things to these moments (with math)! This is the first step in teaching a computer to understand an analogy. In reality our vectors for each moment will contain values for many features, but it will be easier to illustrate the rest of this explanation if we pretend for a little while that they only have two. In that case, our   videogame moment vectors might look something like this:\n    We can imagine a graph with Feature X (on the x-axis) and Feature Y (on the y-axis). If the game had only these two features, every possible moment would exist somewhere on this 2D graph. This is a representation of the abstract space of all of possible game states. (This is also why we had to simplify - if every feature in our vector added another dimension to this graph it would very quickly become impossible to draw it on the page.) So, sticking to this simplified version, we can put Moment A and Moment B vectors from the example at the top of the page on this graph.\n    We can take the difference between the Moment A vector and the Moment B vector to get a new vector (B-A) that removes what they have in common (Mario outdoors), but leaves intact what is distinct between them (on foot vs on Yoshi). The result of this operation (B-A) is a   difference vector that, in this case, we think represents something like the  Yoshiness of that moment.\n      Now that we have a   difference vector representing something like  Yoshiness (B-A), we can add it to a moment that has no Yoshi in it (Moment C, from our example above), and hopefully find an equivalent moment with one crucial difference (the solution of to the analogy above, Moment C + Yoshi).\n    That is the essence of videogame moment search-by-analogy, but there is one final important wrinkle, which is the part that makes this a form of search. Although we can imagine a graph that contains all possible moments in a game, for most games we are only ever going to be working with a small sample of those moments. What if the moment we are looking for doesn’t exist in that sample? What if the moment that we are looking for isn’t even possible?\n  In this case, we still add the difference vector (B-A) to another (Moment C), but instead of giving us the answer directly this creates a   query vector.\n    Now that we have a   query vector we can compare it to all of the moments that we actually have in our sample (represented as dots on the graph below). The single closest moment is our analogy search result, Moment D.\n      There is one more trick we can do that will make our graph a little more useful. Right now the axes are not very meaningful, but we can change that by rotating and transforming the graph. One way we can do this makes resemblance to the Moment C vector vertical (as measured by  cosine similarity), and resemblance to the B-A   difference vector horizontal. This gives us a y-axis that tells us how similar each moment is to Moment C, and x-axis that tells us how much of the B-A distinction that we defined (e.g.,  Yoshiness) each moment has. We can also include how similar each moment is to the   query vector, encoded in the size and color of each dot.\n    The interactive below contains examples of search-by-analogy successes for a couple of games. All of the moments used came from a human playthrough of each game ( Super Mario World and  Super Metroid). The graph shows, for every moment in the sample, its similarity to the   difference vector (B-A, on the x-axis), its similarity to Moment C (on the y-axis) and how close it is to the   query vector (dot size and color). You can scroll around the graph and mouse over any moment for more detail. You can also make your own queries (changing Moments A, B, and C) and see what happens:\n  Combining several old ideas: The first concept is that it is possible to represent many different kinds of things as vectors in an abstract space.  Words, faces, and many other things can all be turned into vectors embdeded in an appropriate space.\n  The second important concept is that the relationships between these vectors can be surprisingly meaningful. The most famous result here is  &#34;King - Man + Woman = Queen&#34;, where a mathematical relationship between word vectors captures an analogical relationship between words.\n  Applying them to a new domain: Before now, these ideas had not been applied to moments in a videogame. Only recently has the work been done to create an  abstract space for embedding videogame moments, and possible applications are  still being explored.", "posttime": "2021-06-25 04:22:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,搜索,search,时刻", "title": "通过Videyy搜索简介，具有视频游戏（2019） ", "title_en": "Introduction to Search by Analogy, with Videogames (2019)", "transed": 1, "url": "http://barrettrees.com/search_by_analogy_interactive/IntroductionToSearchByAnalogy.html", "via": "", "real_tags": ["游戏", "搜索", "search", "时刻"]}]