[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1000352, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Apache2 Debian测试页该页仅用于测试目的", "note_en": "Apache2 Debian Test Page  The page is only for testing purpose", "posttime": "2020-05-02 21:47:03", "tags": "vps,usd,测试,page", "title": "每月测试1美元VPS CPU", "title_en": "Testing 1 USD a month VPS CPU", "transed": 1, "url": "http://vps.novateg.com/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["vps", "usd", "测试", "page"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000350, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "分散的、私有的、安全的和免费的基础设施。获取开始构建所需的工具和支持。\n您的用户的隐私和匿名性。每个人的安全访问(SAFE)网络的建立是为了用内置的加密通信来否定互联网入侵者的窥探。\n易于使用多种语言的API，这意味着您可以专注于编码。这里无需担心您的基础设施或扩展成本！\n用户始终控制着他们的数据，随着网络的货币化，你可以专注于开发最好的应用程序，而不会让你的用户掉以轻心。\n您不需要滚动自己的帐户管理解决方案，用户只需在网络级别登录一次。有了保险箱，您再也不会丢失密码了！\n有了用户拥有的数据，您可以跨应用程序共享数据，以新的方式创建和重用数据集！\n安全网络中涉及的组件包括客户端、保险库、路由和低级网络。\n核心技术。\n桌面、Web和移动Dapp都可以很容易地构建在安全网络上。您可以使用多种语言将您的想法带到新的、分散的互联网上。\n示例Dapp。\nPARSEC(Protocol for Achronous，Reliable，Secure and Efficient Consensus，异步、可靠、安全和高效一致性协议)是一种允许节点在分散的网络中达成有序一致性的算法。\n使用Parsec", "note_en": "Decentralised, private, secure and infrastructure free. Get the tools and support you need to start building.\n Privacy and anonymity for your users. The Secure Access for Everyone (SAFE) Network is built to negate the prying eyes of internet interlopers with built-in encrypted communications.\n Easy to use APIs in many languages, means you can focus on coding. No need to worry about your infrastructure or scaling costs here!\n  Users are always in control of their data, and with monetisation being built into the network, you can focus on making the best app, without selling your users short.\n You don’t need to roll-your-own account management solutions, users log in once at the network level. With SAFE you have no passwords left to lose!\n With data owned by users, you can share data across applications to create and reuse data sets in new ways!\n The components involved in the SAFE Network range from clients, vaults, routing and low level networking.\n Core Technology\n Desktop, Web and Mobile DApps can all easily be built on the SAFE Network. You can work with several languages to bring your ideas to the new, decentralised internet.\n Example DApps\n PARSEC (Protocol for Asynchronous, Reliable, Secure and Efficient Consensus) is an algorithm which allows nodes to reach ordered consensus in a decentralised network.\n Use PARSEC", "posttime": "2020-05-02 21:46:42", "tags": "rust,app,安全,p2p,网络", "title": "安全网络。安全P2P APP系统在Rust中的实现", "title_en": "Safe Network. Secure P2P app system implemented in Rust", "transed": 1, "url": "https://hub.safedev.org/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["rust", "app", "安全", "p2p", "网络"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000348, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一个超级简单的待办事项应用程序。您可以将任务分类到项目中，并将任务分类为三列：&#34；TODO&34；、&#34；DO&#34；和&#34；Done&#34；。每个创建的任务都会自动分配一个ID。更改任务的每个命令都需要一个任务ID。", "note_en": "This is a super simple todo app. You can sort your tasks into projects and sort your task into three columns,  &#34;TODO&#34;,  &#34;DOING&#34; and  &#34;DONE&#34;. Every created tasks gets automatically assigned an id. Every command that changes a task requires a task ID.", "posttime": "2020-05-02 21:45:34", "tags": "任务,manager,task", "title": "Bash中的任务管理器", "title_en": "Task Manager in Bash", "transed": 1, "url": "https://github.com/magtastic/bashtodo", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["任务", "manager", "task"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000347, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "DIXED帮助深度学习团队更快地培训模型，轻松共享GPU资源，并有效协作。Desired允许深入学习的工程师专注于大规模构建和培训模型，而无需担心DevOps或为常见任务(如容错或实验跟踪)编写自定义代码。\n您可以将Desired看作是一个平台，它可以弥合TensorFlow和PyTorch等工具之间的差距-这两个工具非常适合使用单个GPU的单个研究人员-以应对随着团队、集群和数据集的规模不断增大而大规模进行深度学习时出现的挑战。\n灵活的GPU调度，包括动态调整培训作业大小以及自动管理AWS和GCP上的云资源。\n要使用Defined，您可以继续使用流行的DL框架，如TensorFlow和PyTorch；您只需要修改模型代码来实现Defined API。\n要将现有深度学习模型移植到Desired，请遵循您首选的深度学习框架的指导：\n如果您需要帮助，想要提交错误报告，或者只是想要及时了解有关DIRECTED的最新消息，请加入DIRECTED社区！\n松弛是问有关决心的问题并获得支持的最好地方。单击此处加入我们的松弛。\n您也可以加入社区邮件列表，询问有关项目的问题并接收通知。", "note_en": "Determined helps deep learning teams  train models more quickly,  easilyshare GPU resources, and  effectively collaborate. Determined allows deeplearning engineers to focus on building and training models at scale, withoutneeding to worry about DevOps or writing custom code for common tasks likefault tolerance or experiment tracking.\n You can think of Determined as a platform that bridges the gap between toolslike TensorFlow and PyTorch --- which work great for a single researcher with asingle GPU --- to the challenges that arise when doing deep learning at scale,as teams, clusters, and data sets all increase in size.\n  flexible GPU scheduling, including dynamically resizing training jobson-the-fly and automatic management of cloud resources on AWS and GCP\n To use Determined, you can continue using popular DL frameworks such asTensorFlow and PyTorch; you just need to modify your model code to implementthe Determined API.\n       To port an existing deep learning model to Determined, follow thetutorial for your preferred deep learning framework:\n     If you need help, want to file a bug report, or just want to keep up-to-datewith the latest news about Determined, please join the Determined community!\n Slack is the best place toask questions about Determined and get support.  Click here to join our Slack.\n You can also join the  community mailing listto ask questions about the project and receive announcements.", "posttime": "2020-05-02 21:42:06", "tags": "深度学习,深度,deep,学习,determined", "title": "决心：深度学习培训平台", "title_en": "Determined: Deep Learning Training Platform", "transed": 1, "url": "https://github.com/determined-ai/determined", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["深度学习", "深度", "deep", "学习"]}, {"category": "", "categoryclass": "", "imagename": "f445aec87178b5c9e4b9fb45921abee9.jpg", "infoid": 1000343, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "时间，一个与我们生活中的一切纠缠在一起的词，一个我们非常熟悉的东西。在我们做的任何活动中，跟踪它都是很重要的。\n几千年来，我们发展了不同的计算方法。最突出的是，我们一直依赖于太阳在天空中的位置，也就是所谓的视太阳时间。\n我们决定随着季节的推移把它分成两部分，将四季的一个完整周期算作一年，即绕太阳一周。我们还把光的传递与缺少分成几天，即地球自转一周。接下来来看更精确的时钟划分，比如秒、分和小时，这些单位在历史上的不同时刻意味着不同的事情。最终，随着旅行变得更快，在多个地方进化出来的不同计时方式不得不趋同。各位。\n在物理学中，时间是事件的进程，没有事件就没有时间。它是由它的测量来定义的，以特定间隔变化的东西可以被认为是一个单位，尽管它仍然是无限可除的。在物理学中，看待时间有两种方式。在经典物理学中，时间是绝对的，独立于感知者，每个人都是同步的。在现代物理学中，我们有爱因斯坦的狭义而广义的相对论，也就是适用的，事物依赖于一个参照系，时间可以膨胀或收缩。\n所有这些都表明，由于跟踪时间的重要性，我们创造了每3000万年误差为1秒的超精密原子钟。我们可以绝对确定两个节拍/振荡之间发生的失误，如果有错误，那么它就超出了人类的寿命，我们有很多错误需要纠正。这些时钟是我们真理的来源，它们给了我们秒的标准单位的定义，SI秒。\n一方面，我们有计算时间的原子钟，而不考虑周围发生的事件；另一方面，我们有一个在太空中运动的行星，它受到力的作用，在那里我们选择了这样一个事实，即围绕太阳一周满一圈等于一年，它本身自转一周就是一个太阳日，两次太阳凌日之间的空间(天空中的最高高度)。这两个值最终都应该是不同的，也应该是不同的。地球，因为它的不均匀性和目前的位置，在它的。\n我们所做的就是使用SI秒的标准定义作为我们的锚。现在，一天不是由太阳的表观位置来定义的，而是由组成平均恒星日的平均标准单位秒的数量来定义的，大约在86400.002秒左右。这个实际的统一时钟时间称为平均时间。平均太阳时间是一年中某一天的准确平均时间。这是所有太阳日除以n天的总和。\n因此，具有统一固定值(平均时间)的时钟将与表观太阳时间不同。这种差异被称为时间方程(EOT)，它的变化可以长达15分钟(提前14分钟，接近2月6日，落后于接近11月3日的16分钟)，但随着地球完成绕太阳的轨道，它会重新平衡自己。你可以在网上找到许多模拟来理解这个概念。\n几年来，我们的日历只能容纳整整一天，但实际完成一圈所需的天数只是一小部分。所以我们将这个分数累积多年，在下一年增加额外的一天，366d而不是365天。在儒略历上，一年是365.25天，然而这并不精确，它比形成一年所需的实际天数：365.242199天要高出一年的实际天数：366天，而不是365天。在儒略历上，一年是366天，而不是365天。今天最常见的公历对它的定义更多……。\n但是在我们现在的生活中，在我们的软件中，我们仍然用86400秒来定义一天，对吗？那么这个复杂系统的其余部分呢，我们如何处理这种差异，谁选择时间，我们如何才能在这些价值上同步，谁负责？你所在的正午可能不是我所在的正午。\n我们钟上显示的当地时间是由我们的地方当局选择的，我们称之为民事时间。因为我们都生活在同一个星球上，而不是我们当地社区的每个人都与我们认为是同时的时间同步，我们可以选择一个固定的地理位置，在那里创建一个严格的标准时间，并从那里为世界其他地方派生出时间。任何离这条子午线更远的经度都会增加增量时差。那样的话我们就可以同步了，减少了乱七八糟的事情..。\n第一个主要标准是在伦敦格林威治的皇家天文台设立的。那里记录的平均时间被用来作为当地民用时间的偏移量，称为格林威治标准时间，或简称为GMT。然而，它并不像它所能达到的那样精确，因此在1967年被另一种称为世界协调时间(UTC)的标准所取代。\nUTC是世界时间标准的一个版本。在这个标准中，我们还找到了UT1，它利用GPS卫星跟踪地球自转角，它是0度经度的平均太阳时，它是一个更好的", "note_en": "Time, a word that is entangled in everything in our lives, somethingwe’re intimately familiar with. Keeping track of it is important formany activities we do.\n Over millennia we’ve developed different ways to calculate it. Mostprominently, we’ve relied on the position the sun appears to be at inthe sky, what is called apparent solar time.\n We ’ve decided to split it as seasons pass, counting one full cycle ofthe 4 seasons as a year, a full rotation around the sun. We ’ve alsodivided the passing of light to the lack thereof as days, a rotationof the earth on itself. Moving on to more precise clock divisions suchas seconds, minutes, and hours, units that meant different things atdifferent points in history. Ultimately, as travel got faster, thedifferent ways of counting time that evolved in multiple places had toconverge. People  ...\n In physics, time is the progression of events, without events there’sno time. It is defined by its measurement, what changes at a specificinterval can be considered a unit, though still infinitely divisible. In physics there are two ways to view time. In classical physics, time isabsolute, independent of the perceiver, synchronized for everyone. Whilein modern physics, we have Einstein ’s special and general relativitythat applies, things depend on a frame of reference, time can dilate orcontract  ...\n All of this to say that because of the importance of tracking time, we’vecreated ultra-precise atomic clocks that have an error of 1 second every30 million years. We can be categorically sure of the lapse that happensbetween two beats/oscillations, if there’s an error then it’s outsidethe human life-span, and we’ve got many of them to correct errors. Thoseclocks are our sources of truth, they give us the definition of thestandard unit of second, SI second.\n We have, on one hand, the atomic clocks counting time regardless of eventshappening around, and on the other hand, we have a moving planet in spacethat is subject to forces, where we’ve chosen the fact that one fullorbit around the sun equals a year and that one full rotation on itselfis a solar day, the space between two transit of the sun (maximum heightin the sky). Both of those values ought to diverge and differ eventually. The earth, because of its unevenness and current position in its  ...\n What we’ve done is used this standard definition of the SI second as ouranchor. A day is now not defined by the apparent sun position but as theaverage number of standard unit seconds that make up an average stellarday, somewhat around 86400.002 seconds. This actual uniform clock timeis called the mean time. Mean solar time is the exact average mean timefor a day in a year. That is the sum of all solar days over n days.\n Thus, clocks that have a uniform fixed value, mean-time, will differ withthe apparent sun time. This difference is called the equation of time(EOT) and it can vary as much as 15min (ahead 14 minutes near February 6,behind 16 minutes near November 3) but rebalances itself as the earthfinishes its orbit around the sun. There are many simulations you canfind online to understand this concept.\n As for years, our calendars can only hold entire days but the actualnumber of days it takes to finish an orbit is fractional. And so weaccumulate this fraction over multiple years and add an extra day tothe year that follows making it a leap year, 366 days instead of 365.On a Julian calendar, a year is 365.25, however this is not precise,it is higher than the actual number of days it takes to form a year:365.242199. The Gregorian calendar, which is the most common today,defines it more  ...\n But we still use 86400 seconds to define a day in our current lives,in our software, right? What about the rest of this complex system,how do we cope with this discrepancies, who chooses the mean time,how can we all sync on those values, who’s in charge? Noon where youare might not be noon where I am.\n The local time that shows on our clock is chosen by our local authorities,we call it civil time. And because we all live on the same planet, instead of each syncing inour local community with what appears to us as the mean time, we canchoose a fixed geographical spot, create a rigorous standard time there,and for the rest of the world, derive from it. Anything further away inlongitude from this meridian can add a delta time difference. That waywe can all sync and make less of a mess in  ...\n The first major standard was set at the Royal Observatory in Greenwich,London. The mean time recorded there was used as the one to derive yourlocal civil time as an offset from, called Greenwich Mean Time, or GMT forshort. However, it was not as precise as it could be and thus got replacedin 1967 by another standard called Universal Coordinated Time, UTC.\n UTC is a version of the Universal Time standard. In this standard we alsofind UT1, that keeps track of Earth rotation angle using GPS satellites,it is the mean solar time at 0 degree longitude, it’s a better and moreprecise version of GMT.\n UTC, instead of relying on the rotation of the earth, relies on theInternational Atomic Time (TAI), which is the time we talked aboutthat defines precisely the SI second using 400 atomic clocks at multiplelaboratories worldwide. Additionally, to keep count of the rotation ofthe Earth, and keeps in sync with UT1, the UTC authorities can add or removea second in a day, a leap second. The difference between UTC and UT1 isDUT1, basically when DUT1 is one second we need a leap second. So  ...\n As you could’ve guessed, introducing a leap second isn’t a decision wetake instantaneously, it’s announced at least six months in advance in“Bulletin C” by the International Earth Rotation and Reference SystemsService (IERS) which is one of the authority. There’s also involvementin the standard from the International Astronomical Union (IAU) and theInternational Telecommunication Union (ITU).\n With this, we’re set, we have a clean standard, now how should we dividethe world such that civil local time keep in sync with the sun.\n Time and longitude difference is what we need, we split the world into 24meridians, each 15 degrees apart, each meridian zone represents one hourseparation offset from UTC. Those are called time zones, they can gofrom UTC-12 to UTC+14, and can sometimes be referred to by their name,for example Western European Time, Central European Time, etc …However,countries don ’t fall precisely on meridian, and thus local authorities canchoose which section of the country follows which time  ...\n Moreover, there’s a practice called daylight saving time (DST), or summertime, which is used in civil time to advance forward the clock by one hourin spring and set it back one hour in autumn/fall. For example in winterthe region could be on UTC+2 (EET) and in summer on UTC+3 (EEST). Creatinga 23h day in late winter and a 25h day in autumn/fall. This practice isbeing reconsidered in the EU and planned to be removed by 2021.\n     The easiest way I’ve found to test many formats is to use the  date(1)command.\n It can show the time both in human readable format string and moremachine readable numeric formats.\n Some formats include the timezone as numeric, others as the alphabetictime zone abbreviation. You can represent the date with or without thetime zone, with it to make it more precise to the viewer.\n Some formats prepend the time zone part with the ‘Z’ character, which hasorigins in the GMT standard but that now stands for zone descriptionof zero hours, also sometimes called “Zulu time”.\n We can see that the date command automatically knows our time zone andhow to display the time in a way we can read it. How do we set thisformat and where does it take it from. How to set the time zone.\n  The date commands relies on  locale, which is an internationalizationmechanism used by Unix-like operating systems. Locale are configurationsthat can be used to set the language, money, and other representationalvalues that can change by location. The libc on the system, andconsequentially the coreutils, should be aware of those locale values.\n The specific category of locale we are interested in is the  LC_TIME,which is used for the formatting of time and date information, spellingof weekdays, months, format of display, time zone, 24 vs 12h format, etc..\n     Locale can also be set on a user level in  ~/.config/locale.conf, or $XDG_CONFIG_HOME/locale.conf, or generally  $HOME/.config/locale.conf.\n All of this works because of the way profiles are loaded in the shell,you can take a look at  /etc/profile.d/locale.sh.\n  The time zone information database is distributed by the IANA,it’s referred to as the tz database. The Unix distribution downloadswhen updated and installs it in  /usr/share/zoneinfo/so that otherlibraries and programs can use it. In the tz data/zoneinfo db we canfind all the information required to keep track of time in specificplaces. It ’s distributed in such a way to make it easier to choosetime zone by choosing the city name or location instead of the exactdrift/skew  ...\n To change the timezone globally we have to link  /etc/localtime to anentry in  /usr/share/zoneinfo/. For instance:\n  Many Unix-like system provide helpers to not have to manually linkit. There’s  timedatectl(1) from systemd and  /etc/timezone on Debian,for instance.\n The  TZ POSIX environment variable can also be used to specify thezone in human readable format on the command line, and the  TZDIRto specify the location of the tzdata. That means separate users on asingle system can have different time zones.\n   The format of the tz database aka tzdata is explained in details in the man tzfile(5). To create it you can use a textual format an convertit using the command  zic(1) (zone information compiler).\n  &gt; echo &#34;Zone COOL +2:25 - COOL&#34; &gt; COOL.zone&gt; mkdir ./zoneinfo&gt; zic COOL.zone -d ./zoneinfo&gt; TZDIR=zoneinfo TZ=COOL date# Should Output something similar toSun 12 Apr 2020 11:44:00 AM COOL\n So now programs that rely on the standard  time.h header can be awareof the time zone info. You can also load your own dynamically using tzset(3) from the  TZ env.\n   Time is used in so many places in our operating system. We’re goingto list some common places where it is found and then build on them toapproach more complex topics in the following sections.\n Let’s start with the infamous POSIX time. POSIX time, or Unix time, orEpoch time, is the number of seconds that have elapsed since Epoch time,which is the 1st of January 1970 00:00:00 UTC, minus the leap secondsdifference, so Unix time is the same everywhere. That means that in Unixtime, each day is considered to be exactly 86400 SI seconds, which wouldmean it should skew away from real UTC, and thus drifts away from UT1(mean time).\n To answer this, when there’s a leap second introduced in UTC, POSIXtime will repeat the same second or omit one because its minute cannotgo over 60 seconds unlike real UTC.\n Some rare systems can use TAI (International Atomic Time) as a sourceinstead of UTC but will need a table on the system with the leap secondsin it to know how to calibrate itself to civil time.\n Because Unix time start in 1970, dates that are before this need to berepresented as negative numbers. However, prior to this date we haveto keep in mind that there might not have been the UTC standard yet andthus it ’s better to rely on something else to represent the time and dateaccurately. Some real time operating systems (RTOS), that we ’ll see ina bit, like QNX choose to represent Unix time as an unsigned integer,which means it cannot represent time  ...\n  Historically, Unix time was a signed 32 bit integer that incremented at60 Hz, the same rate as the system clock on the hardware of early Unixsystem, that is 60 times per second. Epoch differed too, it was the 1st of January 1971 in the first editionof Unix Programmer ’s Manual. However, at 1/60th of a second precision,the 32 bit integer would have used all its range in only 2.5 years. Thusit was changed again to the Epoch of 1 January 1970 at the rate of 1Hz,an  ...\n When the concept was made there was no consideration of all theissues with leap seconds, time zones, leap years, we’ve mentionedpreviously. It’s only in the 2001 edition of POSIX.1 that there wassome rectification about the faulty leap year rule in the definition ofUnix time.\n  Unix time is the value that Unix system look at to keep track of theirsystem time. Its value is kept in a  time_t type format, defined vaguelyin POSIX.1 as previously mentioned, and that can be included via the time.h header. POSIX only mandates that it should be an integer, anddoesn’t say anything about if it should be signed or not, explainingwhy QNX chose an unsigned integer. For more precise time manipulation, the  time.hheader also includesother types  ...\n However, usually it is a singled signed number which size is defined persystem. For example on mine,  &lt;time.h&gt; redirects to  &lt;bits/timesize.h&gt;as a 64 bits signed integer.\n One issue called the Year 2038 problem, Y2038, or Y2k38, is when systemthat chose to represent Unix time as a signed 32 bit value reach themaximum range of 32 bit integers and overflows, creating an undefinedbehavior. This issue is completely avoided using a 64 bit signed integer.\n  The uptime of a machine is a measure of how long the machine has beenrunning since the last reboot, the current time minus the time it wasbooted at. Some system may require high availability due to service level agreementand this is one of the measure that can be looked at. However, highuptime can be a sign of negligence and rebooting after a long time maylead to unexpected consequences as some changes may only happen on reboot.\n Most Unix-like OS come with the BSD  uptime(1) command which shows thecurrent time, how long the system has been running, how many users arecurrently logged in, and the system load average for the last 1, 5, and15 minutes (Though those values aren’t good metrics, see Brendan Gregg’sblog). Load average being the average number of processing running atthat time. It’s the same information one can find in the first line ofthe  w(1) command.\n On Linux the uptime can also be found in the  /proc filesystem, as /proc/uptime, the file containing 2 values, the first one being thenumber of seconds elapsed since last reboot and the second how muchtime each core has spent idle in seconds. Which are both indicator ofsystem usage.\n Another command that is common as a metric is  time(1). It is a simplecommand which reports the time a command has taken. By default it reports on real time, user time, and sys time. Real timemeans the wall-clock time, it ’s the total time for everything to executefrom start to finish. User time is the amount of cpu time spent in usermode, while sys time is the amount of time spent in kernel mode, systemcalls time and more. CPU time is calculated as  ...\n In fact, there exists a panoply of commands that can be used forbenchmarking processes and what they use, how much time they spend inwhich particular section of their code. We’ll keep it at that.\n That said, we often have to take snapshots of time in our programs,timestamps, saying this has happened at this specific time, attaching ametadata. These timestamps can be stored in Unix time, or UTC time, or inthe specific time zone. However, time-stamping records with local timeisn ’t advised because of issues that could arise with daylight saving,it ’s much easier to recalculate the offset from UTC. Though in certaincases, it would be valuable  ...\n Examples of metadata timestamps are the Unix atime, ctime, mtime thatare stored with files inodes on the file system.\n Atime is the last access timestamp changed whenever the file is read orexecuted for instance, ctime is the last status change timestamp changedwhenever the file is written to or its inode changes, mtime is the lastmodification timestamp changed whenever the file has data written to it,is created, truncated, etc.. An additional non-standard timestamp that we can find on some system isbtime, the file creation/birth timestamp.\n Additionally, some filesystems support flags related to those timestamps,usually for optimization to avoid disk load, such as ones that changethe way atime is updated, remove access time from directories, etc.. This is the prevalent default on a lot of filesystems and thus gives afalse sense of the definition of those timestamps.\n To have more information about when those timestamp are actually updatedhave a look at  man 7 inode, and check your file current values bycalling the  stat command or related system call on it. You can also use touch(1) to arbitrarily change the timestamps on files.\n Let’s end this section with timers and chronometers that trigger eventsat specified time, Unix alarm clocks if you want, clock daemons.\n The de facto implementation of this is cron, which first appeared inUnix V6, a clock daemon tool written by Ken Thompson, in reference tothe word Chronos which is the Greek word/prefix for time.\n Cron specialized in scheduling the execution of programs periodically,at certain time events. It registers the events in a table.\n It initializes its entries from directories containing the scripts: /etc/crontab or  /etc/cron.*/ or  /var/spool/cron, you can take alook at  man 8 cron for more info on that.\n   Cron will by default execute the entries using sh, that means those aresimple shell scripts, letting you set environment variables, and more. In the crontab you have to specify at which time to repeat the executionof events using a special syntax composed of every minute, every hour,every day, every month, every week day.\n Despite cron being the go to solution for repeated scheduled execution,others have created new solutions. Namely, init systems and servicemanagers have tried to re-implement cron their own way and integratetimers as a type of service. Centralizing the management of timers alongwith services.\n Prominently, systemd implements this function using  systemd.timers,which are systemd unit files and inherit all the facilities and securitythat systemd provides for them.\n      We’ve said previously that POSIX time was used by Unix-like OS to keeptrack of system time but we’ve cut it short at that. There’s still a lotto add to this, like where does the system get its time to begin with,how does it store it when it’s not running, what in the OS triggers thecount of seconds, etc..\n In this section I’ll limit myself to Linux and FreeBSD as examples butthe concepts should apply to any other Unix-like OS. I’ve chosen to dothis because resources were scarce on this topic as most have chosento not mention it and skip directly to the topic of NTP, Network TimeProtocol, which we’ll see in the next section.\n There are two types of clocks on our machines, the first type goes bythe name of RTC (Real Time clock)/CMOS Clock/BIOS Clock/Hardware clock,and the other by the name of system clock/kernel clock/software clock. The system clock is the one we ’ve mentioned before, that keeps track oftime using a counter of seconds after the Epoch, and the hardware clockis one we haven ’t mentioned that resides physically on the system andruns without  ...\n As you would have guessed, any two clocks are bound to drift aparteventually, those clocks will differ from each other and from the realtime. However, there are many methods to keep them in sync and accuratewithout using external sources.\n Hardware clocks are usually found on the PC motherboard and interfacedwith using an IO bus. Because some of those are on standard architecturesuch as the ISA (Industry Standard Architecture), it can be easy to knowhow to query and modify them. However, it’s still hardware dependentand so can vary widely.\n These clocks run independently of any control program and are even runningwhen the machine is powered off, kept alive by their own power source,a small battery. They are normally consulted only when the machine is turned on, to setthe system time on boot. Unfortunately, they are known to be inaccurate,but weirdly inaccurate in a predictable way, gaining or losing the sameamount of time each day, drifting monotonously, a systematic  ...\n Hardware clocks don’t have to store time as Unix time or UTC, and don’thave to be limited in precision to seconds. It’s up to the hardwareimplementation to decide what can be done and on the user to decidewhat to do with it. In theory these clocks have a frequency that variesbetween 2Hz and 8192Hz, from 0.5s to 0.1ms precision.\n Let’s also note that there can be more than one hardware clock ona system.\n  On Linux for example, the RTC clocks are mapped to special device files /dev/rtc* backed by the driver. The star denoting the number of theclock if there are many, and  /dev/rtc being the default RTC clock. As with anything hardware, there could possibly be issues with the driverof the RTC and the clocks might not be mapped properly, especially ifnot following the industry standard. Linux has fallback mechanisms forother systems  ...\n On the other side, the only time that matters is the one you see whenthe system is running, and that is the system time.\n As we said, system time is the number of seconds since the Epoch thatis stored and kept track of by the kernel, however internally it mightbe more precise than seconds, it could go up to the precision offered bythe architecture. We’ll come back to this topic of high precision soon,just keep the simple concept in mind.\n The system time, when displayed to us, refers to the timezone informationand files we’ve previously mentioned. It’s good to know that the Linuxkernel also keeps its own timezone information for specific actions suchas filesystem related activities, and this kernel timezone is updatedat boot or via the utility  hwclock(8) by issuing  hwclock --systz.\n When booting, the system clock is also initialized from the RTC thatkeeps running when the system is off. In some cases it can be initializedfrom external sources and not rely on the RTC.\n Thus, when the system is running the hardware clock is pretty muchuseless and we could do whatever we want with it. However, we have tobeware of discrepancies on reboot.\n The counter that the kernel uses to increment the system clock is usuallybased on a timer functionality offered by the Instruction Set Architectureof the CPU (ISA not to be confused with the other ISA we spoke about,the Industry Standard Architecture). In simple terms, that means that theCPU gets interrupted at known programmable intervals periodically,and when it ’s interrupted it executes a timer service/event routine.  ...\n To set the system time and date, we can rely on the  date(1) command,which takes many formats via its  --set option.\n     Or even, on some system, rely on the service manager. The infamous timedatectl(1) of systemd comes to mind, which can set and giveinformation about pretty much everything we’re mentioning in this section.\n  Local time: Fri 2020-04-17 12:40:00 EEST Universal time: Fri 2020-04-17 09:40:00 UTC RTC time: Fri 2020-04-17 09:40:01 Time zone: Asia/Beirut (EEST, +0300) System clock synchronized: yes NTP service: active RTC in local TZ: no\n What’s this line about “RTC in local TZ”, can the time on the hardwareclock be stored with timezone info, and why would we do this? What isstored on this clock, is it UTC or local time?\n The answer to this, like most things, is that it depends. The time onthe RTC can be configured to be set to whatever the system wants it tobe. Yet, storing it in UTC is the best choice as UTC doesn ’t changeregardless of time zones and daylight saving. Having the RTC storingthe local civil time means that it would need to be aware of all thecomplication that it implies, which most RTC clock won ’t. If in localtime,  ...\n So it’s preferable to store the time of the RTC in UTC but some systemsstill choose to not adhere to this. For instance, when dual-booting,the other operating system may expect the RTC to contain local time andupdate it accordingly. That creates a discrepancy, and the RTC has noway to indicate if it is storing local time or UTC, hence the OShas to keep track of this information internally. This is the kind of scenario  ...\n On FreeBSD, this information is given via the  /etc/wall_cmos_clockfile: if the file exists it means that the hardware clock keeps localtime, otherwise the hardware clock is in UTC. On Linux, this information is passed to the kernel at boot time viathe  persistent_clock_is_local kernel parameter/stanza (see notes timekeeping.c). The RTC can also be queried and set in localtime orUTC via the  hwclock(8) options  --localtime  ...\n Hence, we have to keep those clocks in sync. The best way to do thisis to rely on the predictable inaccuracy/systematic drift/instrumentbias of the hardware clock. We can measure its drift rate, and applya correction factor in software.\n On Linux there are two tools to perform this,  hwclock(8) and adjtimex(8), while on FreeBSD there is  adjkerntz(8).\n hwclock(8), and its predecessor  clock(8), let you query, calculatedrift, and adjust the hardware clock and kernel/system clock in bothdirection. While with  clock(8) you had to calculate the drift manually, hwclock(8) does it automatically. It does it by keeping track, in an ASCII file called  /etc/adjtime, ofthe historical information, the records of how the clock drifts over time,and if the hardware clock is in  ...\n  # adjust drift of RTC&gt; hwclock --adjust# set RTC to the same time given by --date&gt; hwclock --set --date=&#39;19:30&#39;# set the RTC from system clock# and update the drift at the same time&gt; hwclock --systohc --update-drift\n Thus, it would be a good idea to call  hwclock(8) periodically in acron job to keep the hardware time in sync and calibrate the drift.\n On FreeBSD, the utility  adjkerntz(8) is used in a similar way but onlyfor local time RTC. It’s called at system startup and shutdown with the -i option from the init system before any other daemon is startedand sets the kernel clock from the RTC, managing the DST and timezonerelated configuration.\n       We can specify if it’s a clock that has issues with years above 1999(which I can’t find in the man page on my machine though):\n  As for the  adjtimex(8) tool, on Linux, it doesn’t actually changethe hardware clock at all but specializes in the nitty-gritty detailsof the system/kernel clock and its relation with hardware.\n It’s especially useful for manually readjusting the system clock basedon the drift of the RTC and raw access to kernel settings related tosystem time.\n For instance, it can be used to change the speed of the system clock,telling it how much to add to time whenever it receives an interrupt. Forexample if the system clock ticks faster than it’s supposed to be, itcould be made to tick slower or it could be made such that each tickrepresents a smaller value to add to the time, both options are possible. Those are done through the  --frequency and  --tickoptionsrespectively.  ...\n It can also be used to change the offset/drift, apply adjustment to thesystem time, and what affects the hardware clock.\n Interesting options are the  -c and  -a which keep comparing the systemtime and hardware clock time every 10s and print the ticks and frequencyoffsets, which can be useful for estimating the systematic drift andthen store it in  /etc/adjtime, which  -a actually does.\n  --- current --- -- suggested --cmos time system-cmos error_ppm tick freq tick freq1587136817 0.2772121587136827 0.278389 117.7 10000 -17010561587136837 0.279261 87.2 10000 -1701056 9998 56905191587136847 0.280304 104.3 10000 -1701056 9998 4571769\n So my system considers 10000 ticks to be equal to 10s, basically having1K ticks a second, but it’s suggested that I use 9998 per 10s instead.\n Note also the  error_ppm, ppm (part per million), meaning that I’vegotten a delta error of around 103 ticks per million that I need slewforward.\n  mode: 0 offset: -852985 frequency: -1701056 maxerror: 483000 esterror: 0 status: 8193time_constant: 7 precision: 1 tolerance: 32768000 tick: 10000 raw time: 1587136914s 254051439us = 1587136914.254051439\n  1 PLL updates enabled 2 PPS freq discipline enabled 4 PPS time discipline enabled 8 frequency-lock mode enabled 16 inserting leap second 32 deleting leap second 64 clock unsynchronized 128 holding frequency 256 PPS signal present 512 PPS signal jitter exceeded 1024 PPS signal wander exceeded 2048 PPS signal calibration error 4096 clock hardware fault 8192 Nanosecond resolution (0 is microsecon)16384  ...\n PPS standing for Pulse Per Second, PLL for Phase-lock loop,and FLL for Frequency-Locked Loop, which are different clockcircuitries/feedback-loop, discipline, and slewing techniques, basicallydifferent methods of looping for time adjusting frequency and ticks tomatch real one, which are affected differently by the environment andhave ups and downs.\n What we can deduce is that my clock with status  8193 has PLL updatesand a nanosecond precision.\n That means that if 1000 ticks make up a second, a tick happens everymillisecond. Can’t we have more precise ticks, aren’t I supposed to getnanosecond precision. But wouldn’t that clog the CPU altogether, canwe get multiple timers too. We’ll see that with high resolution clockslater on, for now, again, let’s keep those questions and concepts in mind.\n An interesting line in the output of  adjtimex catches our attention,bit 6, or 64 in decimal, “clock unsynchronized” what does it mean. It’ssimilar to the “System clock synchronized: yes” line of systemd’s timedatectl output.\n An inspection of the Linux kernel source code let us know that there’s amechanism in the kernel to automatically synchronize the hardware clockwith the system clock. It goes under the name of NTP “11 minute mode”because it adjusts it every 11 minutes.\n Many other Unix-like operating systems choose to do this, have the kernelbe the only program that syncs hardware time to system time. To not letother programs have to worry about all the drifting and calculation. Inthis case we don ’t need to create a cron job that adjusts the time,the kernel already does it for us. Sometimes however, the kernel won ’trecord the drift time anywhere while in  ...\n  On Linux, the only way to turn it off is to stop the NTP daemon (networktime protocol daemon, which we’ll see in the next section), call anyprogram that sets the system clock from the hardware clock such as hwclock --hctosys or actually recompile the kernel without the relatedoption:  RTC_SYSTOHC.\n   Let’s move to this high precision topic we’ve kept in mind.\n So my system clock has nanosecond precision, are there ways to gethigher precision from my system clock, what does that mean from thetimer interrupt perspective. How much time should we spend on timerevents handling instead of executing programs. How are they implementedin the instruction set, do I have a choice of clocks, are there otherinstructions to call. How do I check all that?\n We said briefly that system time was kept track with using interruptsthat were generated at predefined time or at specific periodicintervals. Whenever they happen, the kernel needs to handletime-based events such as the scheduling of processes, statisticscalculation, time keeping (time of day), profiling, measurements,and more. Different machines have different kinds of timer devices that  ...\n  We could choose to actually rely on the RTC directly and not anythingelse. However, that comes with a cost because its quite slow, it ticksevery 0.5s to 0.1ms, to stay energy efficient. So let’s leave the RTCfor boot time only and not timers.\n  The Time Stamp Counter is a 64 bit register called TSC present on allx86 processors since the Pentium. It’s connected via a CLK input pinthat also drives the CPU clock and thus ticks as the same frequency. Forexample a 2GHz CPU will make this register tick every 0.5 nanosecond. TheTSC register can be queried by the  rdtsc, read tsc, instruction. It ’svery useful as it ticks along with  ...\n  The Programmable Interrupt Timer is also part of an instruction set. Theway it works is that it can be programmed to send global interruptsafter a certain time has elapsed, one-shot or periodically. It has a 16bit precision and variable frequency rates that can be configured.\n  Similar to PIT in such that it can issue one-shot or periodicinterrupts. Its size is 32 bits. And the interrupt it sent to the specificprocessor that requested it instead of globally (which PIT would do). Itsfrequency is based on the bus clock signal and can also be controlledbut less flexible than PIT.\n  ACPI Power Management Timer is part of the ACPI-based motherboards andhave quite a low frequency of 3.58MHz, ticking every 279ns. It isn’tnearly as accurate as other timers but has the advantage that it isn’taffected by change based on power-management. It should be used as alast resort system clock.\n  The High Precision Event Timer is a chip integrated into theSouthbridge. It provides multiple hardware timers, up to eight 32 or64 bit independent counters, each having their own clock signal and afrequency of at least 10MHz, 100ns. It is less precise than the TSC buthas the advantage that it is separated and has multiple clocks.\n It’s always good to keep in mind that all those numbers about precisionare for the best case scenario and that we may have overheads. We stillhave to remember that, for example, when querying the TSC we have to firstissue the  rdtscpcommand which has to be interpreted. It doesn ’t meanthat we have a machine ticking at 0.5ns that we ’re going to be able tomeasure such intervals precisely.  ...\n On Linux you can check the features your CPU supports by consulting theflags in  /proc/cpuinfo.\n    Before checking for the availability of the hardware timers and what iscurrently set for what on your system, let’s take a moment to understandwhere we can use these timers.\n There are in general 3 uses for the timers we’ve seen: clock source,clock event, and clock scheduling.\n The clock source is the one that provides the basic timeline, it shouldbe a continuous, non-stop (ideally), monotonic, uniform timer that tellsyou where you are in time. It’s used to provide the system time, the POSIXtime counter. When issuing  date this is what is going to be consulted. So the clock source should have a high resolution and the frequencyshould be as stable and  ...\n Clock events are the reverse of clock source, they take snapshotson the timeline and interrupts at certain point, providing a higherresolution. They could in theory use the same hardware as the clocksource but are not limited to it. They could use all the other hardwarethat are specialized in sending interrupts after a programmed time totrigger the events on the system timeline.  ...\n The clock scheduling is about how time affects the scheduling of processeson the system, what timeslice should be used to run processes and thenswitch to another one. This can possibly be the same counter as theclock source, however usually it needs smaller intervals as it has tobe very fast but doesn’t have to be accurate.\n The clock source keeps time as a counter we refer to as jiffies. Jiffiesare used to keep the number of ticks that happened since the system hasbooted, it is incremented by 1 at each timer interrupt. The number ofticks/interrupts in a second is denoted by a constant defined at compiletime or in a kernel parameter called  HZ, for Hertz, it ’s named thisway in most Unix-like OS.  ...\n   However, it is deprecated and will always return 100 (10ms), regardlessof the precision. The actual value has to be set as a kernel parameter in CONFIG_HZ.\n  Nonetheless, it isn’t such a good idea to go to higher precision  HZbecause if scheduling relies on jiffies it could affect performance.\n Now let’s check how we can see which devices we support and changethe clocks.\n On Linux, there’s not many options regarding anything other than the clocksource (system time). To check the ones available and the one currentlyin used you can rely on the  /sys/ filesystem.\n  The clock source can be changed while the system is running by echoingthe new clock to the same location:\n  For permanent changes you can recompile the kernel with different optionsor set the clock at boot by passing it as the  clocksource option tothe Linux kernel (kernel stanza) in grub or any other boot-manager.\n  Additionally you can enable or disable  hpet to be used as the basetime for events clock.\n As of today here are the relevant configurations and different clocksources for multiple CPU architectures:\n clocksource= Override the default clocksource Format: &lt;string&gt; Override the default clocksource and use the clocksource with the name specified. Some clocksource names to choose from, depending on the platform: [all] jiffies (this is the base, fallback clocksource) [ACPI] acpi_pm [ARM] imx_timer1,OSTS,netx_timer,mpu_timer2, pxa_timer,timer3,32k_counter,timer0_1  ...\n The process is quite similar on FreeBSD. By default it’s aware of thetimer available on the system, it automatically ranks and chooses thebest possible ones.\n It has three timekeeping, one it calls  hardclock running at 1000HZ(1ms), which is the same as the clock source, one it calls  statclockused for statistics and scheduler events with a frequency of 128HZ,and a last one called  profclock which is a bit higher in precision,0.125ms. Those obviously can be tuned to preference.\n       The documentation about what the flag means can be found via themanpage  eventtimers(4), they are related to what the clock supports(periodic or not, per CPU or not). Those values can be changed in the /etc/sysctl.conf file or tunable via  sysctl on the command line.\n As with Linux, on FreeBSD hpet can be used for events if the driveris installed and enabled, it’s part of the acpi. FreeBSD offers somebeautiful documentation about it in the  hpet(4) manpage, discussing theconfigurations too. For instance if it can be used to support event timersfunctionality, and tune how many timers on the hpet per CPU can be used.\n So now we should be all set, if we call POSIX functions part of  &lt;time.h&gt;such as  gettimeofday we can get the result in a structure that containsmicroseconds (0.001ms) if the precision allows it. And actually POSIX1003.1b requires nanosecond precision. There are also the POSIX  clock_gettime()family of functions, which letyou specify from which clock to get  ...\n There used to be a time when on Linux all the timers on the system werecoupled to the jiffies, it isn’t the case today. We have a decoupledclock event subsystem that gets delegated and manages interrupts, and thesource device can be swapped without breaking everything. Linux alsoadded a kernel configuration called  CONFIG_HIGH_RES_TIMERSto allowhigh resolution  ...\n  On Linux, all the information about timers and their statistics ispropagated to user space in  /proc for advanced debugging.\n For instance,  /proc/timer_list, gets us a list of the currentlyconfigured clocks and running timers. We can use it to check theirprecisions:\n  HRTIMER_MAX_CLOCK_BASES: 2now at 294115539550 nsecscpu: 0 clock 0: .index: 0 .resolution: 1 nsecs .get_time: ktime_get_real .offset: 0 nsecsactive timers: clock 1: .index: 1 .resolution: 1 nsecs .get_time: ktime_get .offset: 0 nsecs[...] event_handler: hrtimer_interrupt\n We can see that the  .resolution is  1 nsecs and that the event_handler is  hrtimer_interrupt instead of  tick_handle_periodic,which would be for lower resolution timers.\n /proc/timer_stats is an advance debugging feature that can be enablevia the  CONFIG_TIMER_STATSkernel configuration and that let us gatherstatistics about all the timers on the system, you turn it on and offwhenever you want. It can tell us which routines in the kernel are usingthe timers an how frequently they are requesting them. The format isas follows:  ...\n     Before starting this section I’d like to point out three ways that timecan be updated. One is called stepping and it consists of making one discontinuous changeto time, a sudden instant jump from one value to another that could bebackward or forward in time. This happens when something triggers thesystem time to go to a specific value, external sources  ...\n We also have to keep in mind the time it takes to fetch the value of timefrom a source: for it to be transmitted and interpreted by our system. Itwon ’t be an instant transfer and sometimes may take such a long time thatwe are forced to take it in consideration when doing our calculationsof adjustment. We call this the delay, the time it takes to do the  ...\n So why should we rely on an external source of time, why should we careabout having precise time.\n At human scale, on my watch I can rotate the hands of the clock a littleand adjust it to whatever someone else has. Nothing horrible is goingto happen because of it, right? The majority of people don’t need precisionhigher than a couple of minutes. However, computers are different, you ’re not the one monitoring time,and their errors accumulate pretty  ...\n So who needs millisecond accuracy or more? Who has a need for precisetime? And precise time according to what. Haven’t we said in the previoussection that our system clocks already have a pretty good calibrationmechanism in place. However, even with all the accuracy we can get, we ’re still going todrift, no matter what, and we still need to be aware  ...\n So what does accurate mean, do you need accuracy across your internalnetwork of machines, each not drifting too far away from the other eventhough not in sync with UTC. Or do you need them all to be in sync withUTC or your time zone. How much does the software you are running tolerate change in time. Doesit expect monotonic time, can it handle jumps,  ...\n   We have to add to this list all the machines with nasty system clocksthat drift in unexpected ways. Such machines are better off syncing withan external source.\n  If we don’t want to worry about managing another daemon on our system\n  If the system doesn’t have access neither to the internet nor to anyphysical external source of time.\n Now that we know if we need an external source of time or not, let’ssee how to calculate how precise and stable these sources are.\n When using a clock as reference we want to make sure it’s stable andprecise.\n A clock’s frequency stability is rated and measured by its ppm or ppberror, part per million errors or part per billion errors. The “part”can be either the number of ticks or the number of seconds that aredrifting from the actual value (both can be used interchangeably). Thesmaller this ppm value is the more stable the clock is. The reasons why  ...\n  Let’s take as an example an HPET clock with a frequency of 10MHz( 10_000_000Hz) in an environment between -40 to 80 degrees C. Add thefact that the clock manufacturer has specified that it has a stabilitythat varies between -7.5 and +7.5 ppm.\n For every 1 million ticks or 1 million seconds, there is a plus or minus7.5 variation. Over a whole day the clock would drift by 0.648 seconds.\n  Atomic clocks have tremendously small error variations, those can bebetween 0.0001 and 0.000001 ppb (part per billion). They are driftingby a second every ~300k to 30M years, which confirms what we’ve exploredin the first section of this article.\n Temperature plays such a big role in the stability of our clock so tomake them more stable we could either lock our machines in a controlledtemperature environment or try to come up with a way to automaticallycompensate for how much the temperature is affecting the clock. While the first option is possible in data centers, it ’s not somethingthat  ...\n However, we could devise an experiment in which we find a formula thatcalculates how much the temperature affects the clock frequency and slewour clock appropriately. We could monitor the temperature, feed it, and use it to train thecorrection mechanism in whatever software or mean we use to handlesetting time. Which all comes up to gathering  ...\n Unfortunately, no solution is perfect and this could be overlyoptimistic. Correlation doesn ’t equate causation. Still, such mechanismare great to keep the clock stable within a certain temperaturerange. Some experiments have found that temperature compensation reducesdeviation by 3.5 times. Our earlier drift of 0.648s would be reduced  ...\n Let’s now define some important terms we need in our inventory tounderstand everything that is coming next about external clocks.\n “Reference clock” or “ordinary clock”, this means any machine thatcan be used to retrieve accurate time, usually in UTC so that itcan be used by anyone. Those could range from cesium clock, to GPS,to terrestrial broadcast like radio clocks.\n The time from the reference clock will be forwarded from one server toanother until it reaches you. Thus the reliability of the network, andhow far you are from the it play a big role in how accurate the valuefrom the reference clock will be.\n We’re using server that are connected to external time source and externaltime source themselves interchangeably here unless explicitly mentioned.\n “Delay”, a word we’ve seen before that means the time it takes to doa round trip. It’s normally calculated by timestamping on both endsand doing an estimate of the difference in transport and processing.\n  “Offset” or “Phase”, is the time difference/deviation between theclock on one end and the clock on another end, usually your clock and areference clock. Phase referring to the oscillation rhythm difference,as in “out of phase”.\n  “Jitter ”or “Dispersion ”, is the successive time values differenceafter subsequent requests from remote servers or action. It ’s a greatcriteria to measure the stability of the network, how much delaychanges, if it varies a lot the network isn ’t reliable. This term canbe used as a measure of stability of any other repeatable  ...\n  “clockhopping”, the spreading of time, jumping from one server toanother, which results in less and less accuracy.\n  “Frequency error”, this is how much the reference clock or our localclock drifts over time, measured in ppm and ppb, as we’ve seen before.\n  “Stability”, the generic term to refer to how much we can trust aclock. It’s also a term used in control theory to refer to how far weare from a reaching a stable point (0).\n  “Accuracy”, also a generic term that means how far apart a machine’stime is away from UTC. The typical accuracy on the internet rangesfrom about 5ms to 100ms, varying with network delays.\n  “PPS”, or “Pulse Per Second”, a method of synchronizing two clocksbased on a tick that happens every second.\n  “Watchdog timer”, is a timer that keeps the time since the last pollor update of time from the external source of time.\n  “Fudge”, I couldn’t put my hand on the precise definition of this termother than that it refers to any special way in which you can configurean external clock.\n  “Max Poll” and “Min Poll”, throttling parameters which are the maximumand minimum number amount of time that should pass before the remoteserver allows you to query it again. This is usually expressed inpowers of 2, for example 6 means  2^6 or 64 seconds.\n  “Stiffness ”or “Update Interval ”or “Time Constant ”( τtau), how muchthe clock is allowed to change in a specified amount of time, andthe time between the updates. A small time constant (update interval)means a clock that is less stiff and slews quickly. It ’s usuallyexpressed like the max poll in powers of  ...\n When all those values differ a lot, we can’t allow an abrupt jump oftime on our end, that would disrupt local processes. So what we do isslew time, but that would also mean having a slow calibration. In an ideal world, all the reference clocks would be the same everywhere,however they aren ’t. So what should we do if there ’s a big  ...\n First off, if the offset is too big we don’t trust it until we have thesame offset from multiple time sources. If it’s small enough we go on with our slewing. If the offset is still big, we have to set the clock anew, step it.\n However, on boot we have to sync from the hardware clock, like we’veseen before, which might be off, so we have to either slew the systemtime which can take several hours or make the updates less stiff toquickly reduce the offset (in 5min usually with an less stiff PLL).\n Moreover, we can’t also believe any remote server or machine as a timesource, so we ought to devise a mechanism, a sanity check, to filterwhich machines we trust and which ones we don’t, maybe even combiningmultiple time sources in a quorum-like fashion. We can evaluate remote machines for how stable they are by making thempass  ...\n That also creates a trust issue on boot, so what can be done is to sendmultiple quick requests to multiple external time source servers toinsure their reliability and get an estimate within 10 seconds at boot.\n As time goes on, our system clock should become more stable and we shouldbe requesting the remote servers less frequently.\n This is possible through different feedback mechanisms that learn toadjust the system time appropriately. In a way, this is similar to themechanism that fixes the hardware clock drifting but for the systemclock which we haven’t tackled before.\n Different Unix-like OS and software provide different means of adjustingthe system clock according to external time. There are 4 mechanismsor system calls that can be used to implement the adjustment of thesystem clock.\n The first method is through  settimeofday(2), which is used to jump to afixed place in time, to step it. This could be used for very big offsets.\n The second method is through  adjtime(2)which is used to slew thetime by changing the frequency of the clock. You pass a delta to thefunction and if this is positive the clock will be sped up until itgains that delta and if negative the clock will slow down until it haslost this delta. This is intended to be used to make small  ...\n The third method is through the  hardpps() function that is internal tothe kernel and handles an interrupt service that listens to a constantpulse that happens every second. The RFC 2783 defines how this APIshould behave, basically syncing the transition between pulses with thesystem clock.\n The fourth and last method is through the  ntp_adjtime(2) function,that is an advanced mechanism to discipline the system clock. It isdefined in RFC 1589 called “A Kernel Model for Precision Timekeeping”,also going under the name of “kernel clock discipline”. Initially createdas a better version of  adjtime(2)that can be  ...\n &gt; adjtimex -p mode: 0 offset: -7431812 frequency: -1677305 maxerror: 2000 esterror: 0 status: 8193time_constant: 7 precision: 1 tolerance: 32768000 tick: 10000 raw time: 1588007066s 608698606us = 1588007066.608698606\n &gt; ntptimentp_gettime() returns code 0 (OK) time e2518f79.db34a44c Mon, Apr 27 2020 20:06:01.856, (.856272195), maximum error 49500 us, estimated error 0 us, TAI offset 0ntp_adjtime() returns code 0 (OK) modes 0x0 (), offset -6172.114 us, frequency -25.594 ppm, interval 1 s, maximum error 49500 us, estimated error 0  ...\n Phase locked loop and frequency locked loops main difference is theirpredictor part that will output the value of their feedback loop. Theyboth take as input the timestamp and compare it with local time butwhat happens afterwards, how they change either the phase/offset or thefrequency depends on which one is chosen.  ...\n PLL is an offset discipline mode, its predictor is an integral of theoffset over past updates and outputs the offset amortized over timein order to avoid setting the clock backward. It adjusts it graduallyby small increments or decrements until the offset is gone. The timeconstant aka update interval is the rate at  ...\n FLL is a frequency based discipline mode, its predictor takes the offsetand divides it by the time since the last update and adjusts the clockfrequency such that at the next update the offset will be as small aspossible.\n In the most recent software, the two modes are used together andmixed. They are weighted according to the polling intervals, when itis bellow Allan intercepts, which is 2048s (this can be changed), thena phased-lock loop is used with more weight, and whenever the pollinginterval is higher, then a frequency-locked  ...\n When not fetching the time from another machine that is connected to areference clock but having it connected directly to us, we’ll requiresome hardware driver to interface with it. These physical source of time can implement their own clock disciplinealgorithm and synchronization protocol and thus we have to adaptappropriately.  ...\n Before moving on to what those device could possibly be, let’s have asmall note on leap second smearing.\n There are two main ways to handle a leap second, we could either step,that is stopping the clock completely for a second (repeating a second)or skipping an entire second, or we could either slew the clock usingthe smooth kernel discipline we’ve seen. This is what leap smearing is about, it ’s a standard pushed by  ...\n However, keep in mind that such standard only has weight if everyoneadhere to it, otherwise during the leap second event multiple serverswill have different time and the dispersion will be bigger. That is whywe shouldn’t mix smearing with non-smearing time servers.\n We’ve said we could connect to physical precise time source to becomea reference clock, so what can those be? We’ll give as example the twomost popular ones.\n In the first category we have terrestrial broadcasts, radio stationsthat broadcast time. The most well known are the CHU in Canada, WWV in Colorado, USA, and WWVHin Hawai, USA.\n CHU broadcasts at 3.33MHz, 7.85MHz, 14.67MHz since 1923, and WWVbroadcasts on 2.5MHz, 5MHz, 10MHz, 15MHz, and 20MHz since 1945. They bothget their time from other reliable sources such as atomic clocks and GPS.\n As they are radio broadcasts, you need a radio receiver and a way toanalyze the audio to be able to synchronize with them.\n What they broadcast is some repetitive beep to sync on pulse per secondand minute, some binary coded decimal, and literally someone talking fromtime to time to say in English, or French for the Canadian version, whattime it currently is in UTC hour and minute. So they alternate beeps,ticks, and voice announcements.  ...\n Furthermore, there are also telephone numbers that you can call to getthe time, similarly to the radio. One of them is provided by the sameorganization as the CHU, the NRC, National Research Council of Canada.\n In the second category we have GPS, the Global Positioning System. And let’s be more explicit here, we’re talking about the American NAVSTARGPS that is composed of multiple satellites at 20K km orbit,always having 4 satellites visible from any point on Earth.\n To sync time with a GPS you need a GPS receiver, some of those also comewith a pulse per second feature for accuracy sake. The receiver catchesthe civilian band frequency that the GPS continuously broadcasts anddecodes the signal to get the messages in it. This message containsa multitude of information  ...\n The GPS satellites include atomic clocks that are accurate to thenanosecond. However, we ’re loosing a bit of accuracy because of the delaybetween us and the satellite. So you ’d think that since they have atomicclocks they would follow TAI (International Atomic Time), however theyfollow their own special  ...\n The format time that GPS store and broadcast doesn ’t use theyear/month/day Gregorian calendar but express it as a week number anda seconds-into-week number. The week is a 10-bit field and thus rotatesevery 1024 weeks, which is approximately 19.6 years. The first rolloverhappened on August 21, 1999 and  ...\n This phenomena of week rollover has been deemed the “Y2K” of GPS becausemany device drivers didn’t anticipate it and had hard-coded the GPS epoch. A solution to this would be to derive the GPS epoch from the leapsecond data broadcasted by the GPS and a leap second table. Weirdly,a GPS vendor, has a patent  ...\n   A last nota-bene, your position is derived from how far you are, thedelay, from 3 satellites and calculating the intersection.\n To link this to the previous ideas, if you have a driver that supportsthose external clocks hardware device receiver, it should implement the ntp_adjtime(2) or a custom discipline to take care of adjusting timeitself. Be sure to check the list of drivers available for your solution.\n Let’s proceed from the abstract talk to the concrete: which protocolsand standards can be used to implement time synchronization with externalsources of time.\n The most trivial protocol is the Time Protocol defined in rfc 868. It’s asimple client-server protocol where the server when receiving a requestdirectly replies the time in seconds since midnight 1st 1900 GMT as a32 bit binary number. The protocol runs on UDP and TCP on port 37, as  /etc/servicesshows:  ...\n  Because it’s based on a 32 bit value, it’s going to rollover at some pointin 2036 which will deprecate it easily unless the value is upgraded to64 bits.\n While it’s simple, it doesn’t take into consideration leap seconds,delays, is only precise to the second, and disregards all the stuffsabout time we’ve previously mentioned.\n  rdate - get the time via the networkrdate connects to an RFC 868 time server over a TCP/IP network, printingthe returned time and/or setting the system clock.\n The evolution of the time protocol is the Network Time Protocol, orNTP. It takes into consideration multiple things the other did notincluding: leap seconds, broadcasting mechanism, active/passive modes,security and digest, a hierarchical level of accuracy, polling mechanisms,more precision,  ...\n The current protocol stands at version 4, NTPv4, which is documentedin rfc 5905 but has additional addendum for extensions. It is backwardcompatible with its previous version, NTPv3, in rfc 1305.\n   The timestamps that NTP sends and receives rely on UTC time, the timezoneinformation is kept for local machines to decide. Additionally, NTPwarns of any impending leap second adjustment. Thus, in theory, all NTP servers should store the same UTC time up toa certain precision.\n When an NTP client is running we have to choose what to do with thehardware clock, do we sync it with system time. Many implementationseither save the drift to a file so that it can be used on the nextboot and/or rely on the kernel “11 minute mode ”we talked aboutearlier. Moreover, if a network  ...\n NTP uses a hierarchy, a semi-layered division, to classify clocks thatare available. It calls them strata.\n The stratum, singular, is a measure of the synchronization distance to areference clock. Remember a reference clock is an actual hardware thatcan be used to get precise time, like a GPS. The stratum is the numberof servers we need to pass through to reach such reference clock. Unlikejitter  ...\n The reference clock itself, the timekeeping device, is considered stratum0 and the closest servers connected to it are at stratum 1. Thus a serversynchronized to a stratum  n server will itself be considered stratum  n+1. The upper limit for stratum is 15, in theory, above this the dispersionmay  ...\n The stratum hierarchy helps in spreading the load and avoid cyclicalclock dependencies as it ’s now in the shape of a tree. That means asmall number of servers give time to a large number of clients, whichin turn could be servers to others. That implies low stratum servers,such as stratum  ...\n In addition, the NTP contains in its message a reference identifier, refId, which denotes which reference clock is used at stratum 0 on thispath. So you can know you’re getting your time from which source.\n Let’s also mention that NTP can be deployed locally, in a LAN. It’spossible to create your own hierarchy by acquiring a timekeeping device,such as a GPS, to avoid network delays and get a better precision.\n NTP is not limited to the usual client/server architecture, it includeshorizontal peering mode and a broadcasting mechanism.\n Horizontal peering is when multiple servers are coupled together in agroup to synchronize time more accurately.\n The broadcasting mode works by having a server sends the time to abroadcast address and have clients listen for NTP packets sent to thataddress. This mode is useful for leap second propagation instead ofhaving it sent only when the client connects.\n On that note, on the day of a leap second event, the leap second couldbe propagated either from a configuration file, a reference clock, oranother NTP server. What then happens, how the leap second is applied,depends on the implementation. It could be a stop or skip mechanism ora  ...\n  In the early days of the NTP, the timestamp in the message used to havethe same issue as the Time Protocol, a single 32 bit value, thus havingrollover issue.\n NTPv4 now uses a 128-bit date format that is split into 2 main parts, oneis 64 bits for the seconds and the other 64 bits for fractional seconds. The seconds part is again split into two others, the most significant32 bits is the current era number (number of rollovers), and the  ...\n  0 1 2 3 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ |LI | VN |Mode | Stratum | Poll | Precision | +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ | Root Delay | +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  ...\n As you can see NTP is much more advanced than the time protocol. Forexample, a minimal request would need the version and mode filled,client mode being 3, or 011 in binary. The usual unencrypted messagesare 90 bytes long (76 bytes at the IP layer). A broadcast happens every64  ...\n With such protocol, though requiring minimal bandwidth, but with aninsane amount of clients, there needs to be throttling system. Thepolling interval of a client depends on many factors, including itscurrent precision and the maximum and minimum polling interval allowedby the  ...\n NTP servers are viewed as a public utility of sorts and thus need helpfrom the public, especially the people that are knowledgeable and haveaccess to static public IP addresses. The pool of public NTP serversneeds to keep growing to serve the increase in clients.\n   But why rely on publicly available NTP servers instead of building ourown NTP server hierarchy on LAN, haven’t we said this would offer moreprecision.\n Not only would it offer more precision because of the stability ofthe bandwidth and its network distance, it would also mean it ’s underour control and thus not throttled, thus more available. That wouldalso mean more security and trust as you could put the NTP server in  ...\n But let’s say you want to deploy your own NTP server, what’s availableout there for you to use, what are the implementations.\n The NTP reference implementation of the protocol, the canonical opensource implementation, is called ntpd. It has continuously been developedand maintained for over 25 years.\n It comes with sensible default configuration to fetch time from a poolof NTP servers on the internet. Most Unix-like distros have packages thatare easy to set up.\n What you can configure range from the location of the drift file tocontrol local clock, to the location of the leap second and how it ’sapplied, to the clock discipline related configurations like jitter rate,to security options, to log locations, and to hardware driver  ...\n The  ntpq utility allows to manage the NTP server, be it local orremote, and query its status and configurations. Similar to openssl,it has an interactive mode and a command line arguments mode. For instance, the  ntpq -p output is quite interesting.\n  remote refid st t when poll reach delay offset jitter==============================================================================*time-A.timefreq .ACTS. 1 u 152 1024 377 43.527 -11.093 3.982+clock.isc.org 127.0.0.1 2 u 230 1024 377 67.958 -7.729 0.071 time-a.nist.gov  ...\n It displays the server name in the first column along with its state, a + meaning it’s a candidate server and  * meaning it’s a peer. The refid column is the reference identifier we’ve mentioned. The  stcolumn is the stratum level of the server. The  whencolumn shows thenumber  ...\n Another tool to test remote NTP servers is  ntpdate. It can be used toinitiate syncing local clock but when used with the  -d option it canquery an NTP server without changing system time.\n  &gt; ntpdate -d time-b.nist.gov30 Apr 19:04:27 ntpdate[72016]: ntpdate 4.2.8p14@1.3728-o Wed Mar 18 13:44:46 UTC 2020 (1)Looking for host time-b.nist.gov and service ntp129.6.15.29 reversed to time-b-g.nist.govhost found : time-b-g.nist.govtransmit(129.6.15.29)receive(129.6.15.29)transmit(129.6.15.29)receive(129.6.15.29)transmit(129.6.15.29)receive(129.6.15.29)transmit(129.6.15.29)receive(129.6.15.29)server  ...\n  There are many other implementations of NTP servers other than thecanonical ntpd. You can find multiple comparison tables online thatshow the differences between them. Here’s a few things that often getmentioned:\n  The canonical implementation, ntpd, fully supports the specs as it’sthe reference implementation, has been ported to the biggest number ofoperating systems, has the largest number of drivers, and is probablythe most stable.\n Chrony is another software that implements NTPv4. It has been writtenfrom scratch and is known to be well maintained and secure. Chrony ’s biggest selling point is that it works remarkably well inenvironments where the external time source isn ’t regularly available,a  ...\n systemd ’s timesyncd is a network time protocol daemon that implements anSNTP client, Simple Network Time Protocol, defined in RFC 4330. SNTP isa simplified version of NTP that uses the same network packet format butwith a different way to deal with synchronization.  ...\n The advantage of having the time synced using a service manager is that itcan be hooked to automatically start whenever the network is operational,whenever there’s connectivity.\n   &gt; timedatectl status Local time: Thu 2020-04-30 19:26:56 EEST Universal time: Thu 2020-04-30 16:26:56 UTC RTC time: Thu 2020-04-30 16:26:56 Time zone: Asia/Beirut (EEST, +0300) System clock synchronized: no NTP service: inactive RTC in local TZ: no\n   &gt; timedatectl timesync-status Server: 162.159.200.1 (1.arch.pool.ntp.org)Poll interval: 34min 8s (min: 32s; max 34min 8s) Leap: normal Version: 4 Stratum: 3 Reference: A960804 Precision: 1us (-25) Root distance: 32.142ms (max: 5s) Offset: -9.034ms Delay:  ...\n The client configuration can be found in  /etc/systemd/timesyncd.confwith a format defined in the  timesyncd.conf(5) manpage and systemd-timesyncd.service.\n   clockspeed by D. J. Bernstein is an even simpler approach to SNTP thatuses the TSC register to adjust the ticking speed.\n Another protocol called Berkeley Algorithm works by polling the timefrom all the machines on a network and taking the average, all the othermachines then syncs with this time.\n Yet another interesting implementation is HTP, the HTTP Time protocol. HTPrelies on the Date header of HTTP, defined in the HTTP/1.1 RFC 2616. Ituses statistical analysis to arrive at the most accurate time possible. Soif you can access a webpage then  ...\n Hence, let’s see what’s up with security and NTP. We know that anythingthat is on the network should be secure and trusted.\n If, for example, an attacker effectuate a man-in-the-middle attack theywould be to be able to change the time source for your machine. Thesecurity implications would be that certificates and signatures thatshouldn ’t be trusted because they expired  ...\n That’s one reason why browsers today show errors whenever the systemclock is out of sync.\n The NTP specifications have been there for so long that we’ve hadplenty of years to find security issues and fix them, the referenceimplementation being the testing ground for them. The codebase isconstantly audited. For example, the first version  ...\n There has been a move by the IETF to create this encryption overlaycalled Network Time Security (NTS). CloudFlare currently implements itbut not many others.\n Another project called NTPSec forks the ntpd source, tries to removecomplexity and clean the code. Finding vulnerabilities in it.\n Audits are important, as we’ve said, Chrony came out as the most securebetween multiple NTP implementations.\n  A 2017 security audit of three NTP implementations, conducted on behalfof the Linux Foundation ’s Core Infrastructure Initiative, by the securityfirm Cure53 suggested that both NTP reference implementation and NTPsecwere more problematic than  ...\n On the other hand, there are other types of things we need to careabout. We ’ve discussed the polling issues and the lack of public NTPservers in the pool, and so it ’s important for them to be able towithstand heavy loads. One attack relies  ...\n Another security issue related to how much we rely on NTP as a publicservice, is about how some IoT devices have been found to hard-code theaddress of NTP servers. These kinds of assumptions are dangerous.\n The last thing I want to address in this section is another protocolfor syncing system time with an external time source called PTP, thePrecision Time Protocol.\n PTP is used for when NTP doesn ’t provide enough precision, for criticalmeasurement and control systems such as financial transactions or mobilephone tower transmissions. It is specially crafted for the local networkscenario where you have  ...\n PTP was originally defined by the IEEE in 2002 in the IEEE 1588-2002standard, officially entitled “Standard for a Precision ClockSynchronization Protocol for Networked Measurement and Control Systems ”,then reviewed in IEEE 1588-2008, PTPv2,  ...\n PTP is similar to NTP in the way that it synchronizes time betweenmachines but the difference is that it adds accurate network latencyinformation using hardware timestamping. Hardware assisted timestamp is done at the very lowest levels of  ...\n  It uses the same epoch as the Unix time however, while Unix time is basedon UTC and is subject to leap seconds, PTP is based on the InternationalAtomic Time (TAI).\n An ordinary clock, in NTP parlance a reference clock, is the source oftime in PTP that distributes it to a grandmaster, which can then againrelay it to boundary clocks that others sync with. It is an architecturethat is integrated with  ...\n Within a group the system is automatically able to decide on who to electas a master clock, which is the clock which is deemed the most accurate.\n Let’s end by saying that when push comes to shove, you can always buya machine that comes with everything integrated instead of setting itup yourself.\n In the next section we’ll see systems that rely on precise time inspecial ways.\n   We’ve hinted and mentioned some examples of what could happen if thereis misbehavior in system time. What else could happen.\n We rely on system time for anything related to communication with otherhumans, it creates the context of what is happening. It is also usefulfor sampling, data collecting for statistical analysis.\n With an out-of-whack system time, logs will be out of synchronizationand events will be hard to debug. It will be hard to correlate thingswith real life. Database queries that rely on the  now()to get the current time anddate will  ...\n Apart from the human perception issues there are the countless overflowsand rollovers we ’ve mentioned. All of them being issues related to thesize of the data structure that isn ’t enough to store what is needed, leadingto either  ...\n There are the problems related to time zones and daylight savingevents. Those can happen during the transition when computers repeat anevent for one more hour or one hour less than the expected duration. Thisis tricky when those  ...\n To resolve most of those it’s better not to use time zones and DST inthese cases but to rely on UTC and leave civil time for display only. Butas you know, there’s still the issue of leap seconds.\n Some domains need more synchronization than others, let’s discussdistributed systems and real-time operating systems as examples.\n A distributed computer system consists of multiple software pieces runningon different computers but that still try to act as a single system.\n In a distributed system, it is important to keep clock synchronization,to ensure all the computers have the same notion of time so that theexecution runs on the same timeline. What we truly care about is event ordering, to know  ...\n In general there are two ways to keep things in order, you either use wallclocks, which are all the timekeeping devices we ’ve been mentioning thusfar, or you use logical clocks which are simple monotonous counters allgoing  ...\n The complication in distributed systems is that system clocks ondifferent machines will eventually drift and so it’s hard to keep a strictordering. That’s not what’s expected of a consistent monotonic clock. That is why logical  ...\n However, Logical clocks are not always an option. Another one could beto have a strong coordinator for timestamp in the middle where messagesalways pass through it. But that solution adds a bottleneck to the architectureand  ...\n In distributed systems, virtual machines are often used, so a way tokeep them in sync is to sync them with their host.\n The other domain to explore is real-time operating systems, systems thatare mission critical and require accuracy.\n Real-time OS, aka RTOS, are similar to general-purpose OS (GPOS) inthat they are responsible to managing computer resources and hostingapplications, but they differ in the way they are made to have precisetiming and high  ...\n RTOSs are deterministic by design, they are made to meet deadlinesassociated with external events, they are made to be responsive. Its jitters, the measure of error in the timing of subsequent tasks,should be extremely  ...\n Depending on the type of events it can guarantee, real-time OS areseparated into two categories. If it is mandatory that it should betruly deterministic and that a not adhering means a system failure, wecategorize it  ...\n So programs running on real-time OS should run with consistent timing,but we don ’t stop at this, programmers should have full control on howthese tasks are prioritized and be able to check for deadlines. Theyshould  ...\n The priority given to task are a parameter that is part of the schedulingalgorithm an OS uses to choose which task should run next. It schedulestasks based on interrupts. The time to handle this interrupt routine  ...\n The scheduling is strict, no low priority task can run before a highpriority one. Real-time OSs use rate monotonic, earlier deadline first,preemptive scheduling algorithms while general-purpose OSs use completelyfair  ...\n There are many examples of real-time OS such as VxWorks, QNX, RtLinux,FreeRTOS, RiotOS, and more. Some are open source, some are POSIXcompliants, some are hard real-time, some are soft real-time.\n On Linux specifically, to enable real-time you have to enable the PREEMPT_RT scheduling patch. Though it’s arguably soft real-time as it’snot mathematically provable real-time.\n Another real-time Linux related project is the ELISA project, the EnablingLinux in Safety Application project, which aims at creating a standardto build mission critical Linux systems.\n  Founding members of ELISA include Arm, BMW Car IT GmbH, KUKA, Linutronix,and Toyota. To be trusted, safety-critical systems must meet functionalsafety objectives for the overall safety of the system, including  ...\n   For machines time may need accuracy but for humans it is definitelysubjective. We feel time as our emotions are swayed by life. Thiscertainly matters.\n We possess clocks within us, biological clocks in which sun time andmemories play an integral part in.\n For example in emergencies and dangerous situations, time seems toslow down. And as we grow older we perceive time to move faster. It’sinteresting to see time from a human perspective.\n We live in such an interconnected world that greeting people inthe morning on the internet has lead to the  Universal GreetingTime. Time inthis interconnected world has also lead to marketingcampaigns and  ...\n I’ve written in depth about “internet time perception” in  this otherarticle.\n I hope this colossal article has cleared the topic of time, and time onUnix. It may not be as concise and scientifically true in some placesbut still convey an approximate overview to readers. Please reachout  ...\n                       If you want to have a more in depth discussion I&#39;m always available by  email or irc.We can discuss and argue about what you like and dislike, about new ideas to consider, opinions, etc.. If you don&#39;t  ...", "posttime": "2020-05-02 21:19:44", "tags": "unix,时间", "title": "Unix上的时间", "title_en": "Time on Unix", "transed": 1, "url": "https://venam.nixers.net/blog/unix/2020/05/02/time-on-unix.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["unix", "时间"]}, {"category": "", "categoryclass": "", "imagename": "ef3c4f5d6860c14256741f3887554c69.jpg", "infoid": 1000341, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这里是说明如何自己制作的说明书。：)玩得开心，请把你用它做什么的截图发给我！：)。\n谢谢.。twitter会使用此信息，来优化你的时间线。撤销。\n让我知道一本说明书是否有用，如果有用，我会马上做一本。\n这就是这个想法的由来--如何获得更好的在线修补体验。如果你们制作并试用了它，请与我们联系并提供反馈！我明天要做一本难教的书……。\n对话结束。\n谢谢.。twitter会使用此信息，来优化你的时间线。撤销", "note_en": "And here&#39;s the instructable that shows how to make one yourself. :) Have fun and please send me screengrabs of what you do with it! :)\n  谢谢。Twitter 会使用此信息，来优化你的时间线。  撤销\n  Let me know if an instructable would be useful, and if so I&#39;ll whip one up.\n  That&#39;s the idea this grew out of - how to enable better online tinkering experiences. If you guys make and try it out, please be in touch to give feedback! I&#39;ll whip up an instructable tomorrow...\n  对话结束\n      谢谢。Twitter 会使用此信息，来优化你的时间线。  撤销", "posttime": "2020-05-02 21:19:26", "tags": "视频,mirror,有用,instructable", "title": "用于视频通话的侧视镜", "title_en": "Sideview Mirror for Videocalls", "transed": 1, "url": "https://twitter.com/AmosLightnin/status/1255511707960647684", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["视频", "mirror", "有用"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000340, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "+((！+[]+(！！[])+！！[]+！！[]+[])+(！+[]+(！！[])+！！[])+(！+[]+(！！[])+！！[]+！！[])+(！+[]-(！！[]))+(！+[]+(！！[])+！！[]+！！[])+(+！！[])+(！+[]+(！！[])+！！[])+(！+[]+(！！[])+！！[]+！！[])+(+！！[]))/+((！+[]+(！！[])-。[]+[])+(！+[]+(！！[])+！！[])+(！+[]+(！！[])+！！[])+(+！！[])+(！+[]+(！！[])+！！[]+！！[]。+！！[]+！！[])+(！+[]+(！！[])+！！[]+！！[])+(！+[]+(！！[])-[])+(！+[]+(！！[])+！！[])+(+！！[]))", "note_en": "+((!+[]+(!![])+!![]+!![]+!![]+!![]+!![]+!![]+[])+(!+[]+(!![])+!![])+(!+[]+(!![])+!![]+!![]+!![]+!![]+!![]+!![])+(!+[]-(!![]))+(!+[]+(!![])+!![]+!![])+(+!![])+(!+[]+(!![])+!![]+!![]+!![]+!![])+(!+[]+(!![])+!![]+!![])+(+!![]))/+((!+[]+(!![])-[]+[])+(!+[]+(!![])+!![]+!![]+!![]+!![])+(!+[]+(!![])+!![]+!![]+!![]+!![]+!![]+!![]+!![])+(+!![])+(!+[]+(!![])+!![]+!![]+!![]+!![])+(!+[]+(!![])+!![]+!![])+(!+[]+(!![])-[])+(!+[]+(!![])+!![]+!![]+!![]+!![]+!![])+(+!![]))", "posttime": "2020-05-02 21:19:23", "tags": "甲骨文,oracle,faces", "title": "甲骨文面临4000多名女性的不平等薪酬索赔", "title_en": "Oracle faces claims of unequal pay from over 4k women", "transed": 1, "url": "https://www.theregister.co.uk/2020/05/02/oracle_pay_discrimination_lawsuit_gets/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["甲骨文", "oracle", "faces"]}, {"category": "", "categoryclass": "", "imagename": "d1a9b44493c2c0d1728e0f6150421d66.png", "infoid": 1000339, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“写作、计划、协作和组织。理念就是你所需要的一切--在一个工具里。“。\n这篇文章包含了我对Concept的观察，它是无代码的拥护者，正在吞噬生产力工具空间。如果你不知道什么是概念，或者以前没有用过，那么这篇文章可能不适合你。值得一提的是，作为一家在diesdas.digital工作的公司，我们热爱观念，而且一直在广泛使用它，以至于它让我们以前使用的大多数其他工具变得多余-它已经成为我们的操作系统，我不知道如果没有它，我们该如何运营公司。所以这个帖子非常…。\nConcept是一种元工具：一种构建工具的工具，它的可延展性如此之强，使得发明您自己的工作流变得如此容易，以至于您不禁惊叹不已：允许人们在不编写任何代码的情况下构建数据库和关系，这是一个令人难以置信的令人印象深刻的成就。它还擅长媒体密集的空白页面协作环境--它在这方面比谷歌文档(Google Docs)强，比Dropbox Paper好，比任何维基(Wiki)都好。\n一开始就是阳光和彩虹：你只需要几页纸就可以开始了；这里是会议笔记，那里是待办事项清单，那里是特雷洛式的黑板；太棒了，最后你所有移动的数据目标都汇聚到了一个地方！然后，您开始将更多的东西放在一起：您发现了自定义视图、关系和数据库。脑筋急转弯，所有的可能性！一夜之间，概念成为您公司的项目管理工具、项目文档工具、内部维基工具、销售线索跟踪工具、CRM工具……。\n对不起，我需要休息一下，…。因为你巨大的灵活性也是你最大的弱点。\n首先：通知没有跟上。如果您已经在概念上构建了大量不同的工具，那么通知就不再有用了，…。你会收到一封电子邮件，上面列出了所有方面的86项更改；它们没有条理，也不像单独的应用程序那样与思维桶相对应。您的CRM通知突然与您当前的产品开发Sprint更新捆绑在一起。他们怎么会分开呢？概念不知道它在储存什么，不管是什么手段和目的……。\n我从未想过我会这么说，但我怀念收到JIRA通知的时候，图标的颜色、格式和措辞会立即准确地告诉我它的上下文和内容。\n虽然这个概念可以处理所有这些不同的用例，这是令人印象深刻的，但它并不是特别擅长其中的任何一个。它没有引起讨论，因为它的评论很小，而且很隐蔽。你也不能引起人们对卡片/页面的某些属性的注意，因为所有的元数据都变成了一个很长的属性列表。如果你有意为一个用例设计一个工具，你应该强调常见/重要的功能，而隐藏更多模糊的功能。在观念上一切都是一样的，..。\n作为一个独立的工具(例如项目待办事项)，Concept根本没有为该任务设计得很好。由于它的强制通用性，它几乎不是设计出来的。一切都是妥协。一切都变成了它的最低公分母。没有任何东西是有目的的，也不容易在视觉上进行扫描。通用化迫使万事万物都采用通用化设计。\n到目前为止，我最大的抱怨是工具应该是达到目的的一种手段，并且不会成为障碍-但有了概念，构建工具本身往往就成了目的。\n太多时候，人们无法处理强大的概念赋予他们的能力：他们经常为一个问题构建最复杂、最复杂的解决方案，因为这会让他们看起来很聪明。园艺意念板本身就成了一项活动…。概念不会妨碍你，它的延展性总是会让你进一步调整你的电路板，添加另一个属性，连接另一个关系，添加另一个视图，检查你的电路板并完成所有卡上的数据。它已经成为一种永恒的..。\n但别搞错了：所有这些忙碌的工作都没有什么价值。当然，更好的工具可以提高效率，但从理念上讲，你通常很早就达到了“90%”的水平--但这不是人们停下来的时候。人们陶醉于收益递减的活动，使一切变得不必要地复杂。一张桌子上的一张卡片，一张纸板上的一张卡片，一页纸上的一张卡片？好的!。\n大多数时候，一个平凡的项目符号列表就可以了。也许可以列个待办事项清单。也许可以把那些待办事项加到日历上。但那不会让你看起来很聪明，不是吗？具有5个视图、3个与其他数据库的关系和每张卡20个属性的概念板执行…。这表明你真的考虑到了所有的边缘情况！做得好!。\n在这个忙碌的…上花费的初始时间不仅浪费了。您最终得到的解决方案需要一本手册来理解和使用。这不是一个玩笑，我们确实经历过：我们看到了无数的Slake消息，解释如何使用一个新的概念板。这种不必要的复杂性会降低以后需要使用这些工具的每个人的速度。\n现在…。当然，所有这些都不是观念的错--当然，它是可以利用的。", "note_en": "“Write, plan, collaborate, and get organized.  Notion is all you need — in one tool.”\n This post contains my observations on Notion, the no-code champion that’s eating up the productivity tool space. If you don’t know what Notion is or haven’t used it before, then this post is probably not for you. I should mention that as a company at  diesdas.digital, we love Notion and have been using it so extensively that it has made most other tools we previously used redundant —it ’s become our operating system and I don ’t know how we would run the company without it. So this post is very much  ...\n Notion is a meta-tool: a tool to build tools and it’s so malleable and makes inventing your own workflows so easy, you can’t help, but marvel at it: It’s an incredibly impressive achievement to allow people to build databases and relations without writing any code. It also excels at the media-heavy blank-page collaboration environment — it’s better at that than Google Docs, it’s better than Dropbox Paper, it’s better than any wiki.\n   It ’s all sunshine and rainbows at the start: You get going with a few pages; meeting notes here, a to do list there, a trello-esque board over there; it ’s fantastic, finally all your moving data targets converge in one place! Then you start putting more things together: You discover custom views, relations, databases. Mind blown, all the possibilities! Over night Notion becomes your company ’s project management tool, project documentation tool, internal wiki tool, lead tracking tool, CRM tool,  ...\n Sorry Notion, but I need a break … because your immense flexibility is also your biggest weakness.\n  First of all: Notifications don’t keep up. It you’ve built a ton of different tools in Notion, then notifications simply aren’t useful anymore … you receive emails that list 86 changes all across the board(s); they are not organized and they don’t correspond to mental buckets, like separate apps would. Your CRM notifications are suddenly bundled with your current product development sprint updates. And how could they be separate? Notion doesn’t know  what it is storing, for all means and purposes  ...\n I never thought I’d say this, but I miss the times of receiving a JIRA notification and the icon’s color, the formatting and the phrasing tell me immediately and exactly its context and what it is about.\n  And while it ’s impressive that Notion can handle all of these different use cases, it ’s not particularly good at any of them. It doesn ’t invite discussion because its comments are tiny and hidden. You also can ’t call attention to certain properties of a card/page because all meta-data becomes one long list of properties. If you were purposefully designing a tool for one use case, you ’d emphasize common/important functionality and hide more obscure features. In Notion everything is the same,  ...\n Judged as a standalone tool, e.g. a project backlog, Notion is simply not well designed for that task. It’s almost undesigned due to its forced genericness. Everything is a compromise. Everything becomes its lowest common denominator. Nothing has purpose or is easy to scan visually. Being generic forces generic design onto everything.\n  By far the biggest gripe I have is that a tool should be a means to an end and get out of the way—but with Notion building the tool often becomes the end in itself.\n Too often people can ’t handle the great power Notion gives them: they frequently build the most sophisticated, most complex solution for a problem because that makes them look smart. Gardening Notion boards becomes an activity in itself …Notion doesn ’t get out of the way, it ’s malleability always invites you to tweak your boards further, to add another property, to connect another relation, to add another view, to go through your board and complete data on all cards. It has become a perpetual  ...\n But make no mistake: All of this busy-work has little value. Of course better tools provide efficiency gains, but in Notion you usually reach a “90% there” level quite early—but that’s not when people stop. People revel in activities of diminishing returns and make everything unnecessarily complicated. A card in a table on a card in a board on a page? Sure!\n Most times a mundane bullet point list would have been fine. Maybe a to do list. Maybe adding those todos to a calendar. But that wouldn’t make you look smart, would it? A Notion board with 5 views, 3 relations to other databases and 20 properties per card does … it shows you’ve really thought of all the edge cases! Good job!\n Not only is the initial time spent on this busy-work wasted … you end up with solutions that need a manual to comprehend and use them. This is not a joke, we’ve actually been there: We’ve seen endless Slack messages explaining how a new Notion board is supposed to be used. This needless complexity slows everyone down who needs to use these tools later on.\n Now …of course all this is not Notion ’s fault —of course it can be used sensibly and responsibly. This whole post is a bit like criticizing a programming language for the bad code beginners write with it. Maybe we simply haven ’t grown our Notion legs yet. But the reality is that not everyone on your team will want to become an expert tool builder: The flexibility that Notion offers simply invites you to use it for the wrong things and make everything too damn complicated. It invites excessive  ...\n  Observing this makes me feel really drawn to tools like Basecamp, which are very rigid, very opinionated, funneling you through workflows that make sense, because they ’ve been proven over time and iterated upon. Somebody decided, after careful consideration, that this is the feature set the tool should offer and that ’s it. Somebody thought about how it all connects, how it ’s designed and how it all comes together. The feature scope is fixed. No adding of stuff. No rearranging the core  ...\n Notion is the opposite and that flexibility makes it incredibly useful in  some situations, but sadly also distracting and mediocre for  most use cases. Maybe we had to go down this way, to see the benefits of more opinionated software again — to embrace constraints and to focus on the actual work. Understanding usually comes in sine waves … we’ve been at the top of the flexibility hill and now it might be time to bounce back.\n But that’s just my opinion. Even in my team people will probably strongly disagree. Maybe someone will write a follow-up blog post with a counter take? That’d be great, I’d like to have that conversation!", "posttime": "2020-05-02 21:19:09", "tags": "观念,encourages,工具,notion", "title": "观念鼓励忙碌的工作，我已经厌倦了", "title_en": "Notion encourages busy-work and I’m tired of it", "transed": 1, "url": "https://medium.com/diesdas-direct/notion-encourages-busy-work-and-im-tired-of-it-b1e049edb663", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["观念", "工具", "notion"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000338, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此列表正在进行中。我们没有审核本页所列软件的安全或隐私问题，超出了该软件的开发者以及可能的其他站点告诉我们的内容。我们对软件许可做了一些初步研究。\n此页面是共享资源，我们鼓励其他人向其添加内容，因此此处的某些条目可能是由社区成员添加的。我们定期检查此资源，知道其他人也会检查它，但它是一个维基，因此在修复错误之前可能会添加错误。我们鼓励您在使用之前查看有关您感兴趣的软件的许可证和信息，并使用您的调查结果更新此页面。\n随着越来越多的人远程访问，互联网上爆发了专有软件。许多人建议使用专有、SaaSS和/或侵犯隐私的视频会议软件作为面对面会议的替代方案。专有供应商正在通过提供临时免费的服务来跳过这项任务，因为这些服务的成本很高，这将锁定组织继续使用这些供应商。相反，让我们共同努力促进自由软件的发展。\n聊天视频BigBlueButton视频流和音频连接往往相当稳定。与Canvas、Moodle和其他学习管理解决方案(LMS)系统集成(见下文)。LGPL。\nJITSI Meet简单易用，适合几个人进行视频或音频聊天。对于两个以上的人来说并不总是可靠的。有时需要重新加载页面才能使音频在两个方向上工作。Apache-2.0。\n如果所有各方都使用相同的(理想情况下是最新的)客户端版本，那么GNU Jami往往是稳定的。GPLv 3。\nGStreamer/Icecast可以使用命令行脚本与许多单向关系中的人共享您的相机或桌面屏幕。这种方法与Mumble相结合，允许学校教师进行演示，并可以通过音频回答问题。由于视频流的缓冲，视频馈送可能会滞后约5-10秒。请参阅下面的更多选项。\nOBS/nginx OBS Studio可以与nginx web服务器配合使用，可以通过RTMP进行录屏或直播。观众可以使用VLC、MPV或任何其他兼容播放器在您的Web服务器上收看RTMP流。GPL-2.0。\nOpenTokRTC现在是Nexmo/Vonage视频API的一部分。至少原始TokBox代码的一部分是自由软件，但不清楚它是否可以在没有任何非自由软件的情况下使用。作为一个反功能，Vonage提供了可以在您自己的服务器上运行的企业版，或者可能需要运行非免费JavaScript。\nAudio Mumble Mumble对于终端用户来说非常容易，而且主要平台都有免费的本地客户端。在服务器上，它占用的内存很少，但是如果有很多人同时在一个有很多人在监听的频道中通话，那么它会占用大量的服务器带宽。客户端在这些时间会看到下行链路带宽增加，这是可以接受的，因为大多数非对称住宅连接允许更大的下行链路。事件发生在直接面对面的交流中，它通常是…。\n文本和可能的文档共享电子邮件和邮件列表电子邮件已经被许多人普遍使用，并且是一个分散的社交网络。一种选择是通过在电子邮件的“收件人：”或“抄送：”字段中列出多个人来向您的同事、朋友和家人发送电子邮件。建立邮件列表是一个更好的长期策略，特别是当人们希望加入或离开小组，或者他们想要阅读完整的历史记录，或者不再关注一个长期运行的主题时。\nIRC IRC有适用于所有主要平台的免费软件IRC客户端。如果您想在Freenode(一种流行的IRC服务器)上创建频道，但您的频道不是关于自由软件或获得广泛许可的创意作品，您仍然可以创建以#39；##&#开头的热门频道。请注意，在这种情况下，如果您需要Freenode员工的帮助，您的请求将不会像请求自由软件项目渠道的帮助那样优先。..。\nKiwiIRC不要在站点配置中添加验证码密钥，否则它会在用户尝试登录时添加非免费验证码系统。Apache-2.0。\n休息室在休息室的公共实例上，关闭浏览器选项卡或断开与应用程序网页的连接后，与IRC服务器的连接将断开。如果您使用的是私有实例，则需要管理员创建的帐户才能登录，并且即使在关闭浏览器选项卡或断开连接后，与IRC服务器的连接仍保持活动状态。麻省理工学院。\nMatrix看起来Matrix做了相当多的事情，包括联合、网络之间的桥接和VoIP。Apache-2.0。\nMatterest Anti-Feature：尊重自由的Matterest版本比企业版的功能少，后者很可能是非免费的。针对不同组件(MIT、AGPLv3、Apache 2.0)的多个许可证。\nRocket.Chat Anti-f", "note_en": "This list is work in progress. We have not audited the software listed on this page for security or privacy concerns beyond what developers of the software, and potentially other sites tell us about it. We have done some initial research into software licenses.\n This page is a shared resource, and we encourage others to add to it, so some of the entries here may be added by members of the community. We check this resource periodically, and know that others check it too, but it&#39;s a wiki, so errors may be added before they&#39;re fixed. We encourage you to review licenses and information about the software you&#39;re interested in before using it, and to update this page with your findings.\n As more people are going remote, there is an outbreak of proprietary software happening around the Internet. Many are suggesting to use proprietary,  SaaSS, and/or privacy invading video conferencing software as an alternative to meeting in person. Proprietary vendors are hopping to the task by offering services that are temporarily free as in cost, and that would lock organizations into continuing to use those vendors. Let&#39;s work together to promote free software instead.\n   Chat Video BigBlueButton Video streaming, and audio connections tend to be quite stable. Integrates with Canvas, Moodle, and other Learning Management Solutions (LMS) systems (see below). LGPL\n Jitsi Meet Easy to use, and good for a couple of people to video or audio chat with each other. Not always reliable with more than two people. Sometimes it&#39;s necessary to reload the page to get audio working in both directions. Apache-2.0\n GNU Jami Tends to be stable if all parties use the same (ideally the latest) version of the client. GPLv3\n GStreamer/Icecast It&#39;s possible to share your camera or desktop screen with many people in a one-way relationship using  command line scripts. This method combined with Mumble allows for a school teacher to give a presentation, and to be available for questions via audio. The video feed would likely be about 5-10 seconds behind, due to buffering of the video stream. See more options below.\n OBS/nginx OBS Studio can be used in conjunction with the nginx web server to screencast or stream via RTMP. Viewers can tune into the RTMP stream on your web server using VLC, mpv, or any other compatible player. GPL-2.0\n OpenTokRTC Now a part of nexmo / Vonage video API. At least parts of the original TokBox code are free software, but it&#39;s not clear whether it&#39;s possible to use without any non-free software. As an anti-feature, Vonage offers enterprise editions that may run on your own server, or may require running non-free JavaScript.\n Audio Mumble Mumble is pretty easy for end users, and there are free native clients for major platforms. On the server, it has a low memory footprint, but can use a lot of server bandwidth if many people are talking at once in a channel that has many people listening in. Clients would see an increase in downlink bandwidth at these times, which is okay, since most asymmetrical residential connections allow for a larger downlink. Event in direct face to face communication, it&#39;s generally  ...\n Text and possibly document sharing Email and mailing lists Email is already commonly used by many people, and is a decentralized social network. One option is to email your coworkers, friends and family by listing multiple people in your email&#39;s To: or Cc: fields. Setting up mailing lists is a better long term strategy, especially if people are expected to join or leave groups, or they want to read the full history of, or stop following a long-running thread.\n IRC IRC There are free software IRC clients for all major platforms. If you want to create a channel on Freenode (a popular IRC server), but your channel isn&#39;t about free software or broadly licensed creative works, you can still create topical channels that begin with &#39;##&#39;. Note that in this case if you need help from Freenode staff, your request won&#39;t be as high priority as requests for help with a free software project&#39;s channel.  ...\n KiwiIRC Don&#39;t add a captcha key in the site config, otherwise it will add a non-free captcha system when users try to log in. Apache-2.0\n The Lounge On public instances of The Lounge, connections to IRC servers are dropped after closing your browser tabs or losing your connection to application&#39;s Web page. If you use a private instance, you&#39;ll need an account created by an administrator to log in, and connections to the IRC server are kept active even after closing your browser tabs or losing your connection. MIT\n Matrix It seems like Matrix does quite a lot, including federation, bridging between networks, and VoIP. Apache-2.0\n Mattermost Anti-feature: the freedom respecting version of Mattermost has less features than the enterprise editions, which are likely non-free. Multiple licenses for different components (MIT, AGPLv3, Apache 2.0)\n Rocket.Chat Anti-feature: the freedom respecting version of Rocket.Chat has less features than the enterprise editions, which are likely non-free. MIT\n Wire On their  client source code repo, they say &#34;a. You agree not to change the way the Open Source App connects and interacts with our servers;...&#34;. It&#39;s not clear whether this is acceptable for software under a free license.\n XMPP / Jabber XMPP has been around for a long time. There are free clients for major platforms, and a variety of free server codebases to choose from if you want to run your own server.\n Zulip It looks like Zulip&#39;s enterprise edition is a support contract for the free software, which is great. Apache 2.0\n Sandstorm Sandstorm makes it easy to install and use free software applications on your Web server. It comes with many free applications, and it&#39;s probably best to confirm the licenses of the applications before you install them.\n Document Writing and document sharing Etherpad This is a very useful tool for collaborative text editing. It&#39;s great for meetings, brainstorming, and interleaved writing and editing flows. Apache 2.0\n     NextCloud NextCloud is a featureful Web service for document editing, file storage, audio/video chat, and more. AGPL-3.0\n   Wiki Software ikiwiki Write wiki pages in Markdown, via a Git repo, or via the Web (which commits to Git). Great for internal wikis, ie for documenting procedures, policies, article drafts, etc. Extensible with plugins. GPL-2.0 +\n MediaWiki Used in quite a lot of places. It supports many different extensions. It&#39;s a good choice for public wikis that anyone can edit, or for internal wikis. GPLv2+\n Learning Management Solutions (LMS) Canvas One of the more popular choices out there. Integrates with Big Blue Button (see above). AGPLv3", "posttime": "2020-05-02 21:18:49", "tags": "通信,communication,software", "title": "远程通信(LibrePlanet上的Wiki页面)", "title_en": "Remote Communication (wiki page on LibrePlanet)", "transed": 1, "url": "https://libreplanet.org/wiki/Remote_Communication", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["通信", "software"]}, {"category": "", "categoryclass": "", "imagename": "a333658f99f26e9966290db145465b38.jpg", "infoid": 1000335, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这位特斯拉联合创始人谈到了他对Twitter的使用，以及在与美国证券交易委员会(Securities And Exchange Commission)达成和解后他必须做出的调整。欲了解完整访谈，请单击此处：https://cbsn.ws/2UB9O5c订阅60分钟频道这里：http://bit.ly/1S7CLRu观看全集&#34；60分钟&#34；这里：http://cbsn.ws/1Qkjo1F获取更多&#34；60分钟&#34；从&#34；60分钟：加班这里：http://cbsn.ws/1KG3sdr重温过去的剧集.", "note_en": "The Tesla co-founder talks about his use of Twitter and the adjustments he’s had to make after a settlement with the Securities and Exchange Commission. For the full interview, click here:  https://cbsn.ws/2UB9O5c  Subscribe to the &#34;60 Minutes&#34; Channel HERE:  http://bit.ly/1S7CLRu Watch Full Episodes of &#34;60 Minutes&#34; HERE:  http://cbsn.ws/1Qkjo1F Get more &#34;60 Minutes&#34; from &#34;60 Minutes: Overtime&#34; HERE:  http://cbsn.ws/1KG3sdr Relive past episodies  ...", "posttime": "2020-05-02 21:18:26", "tags": "埃隆·马斯克,特斯拉,埃隆,ceo,http", "title": "特斯拉CEO埃隆·马斯克：“我用我的推文来表达自己”(2018)[视频]", "title_en": "Tesla CEO Elon Musk: “I use my tweets to express myself” (2018) [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=SIzGdoPu9vs", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["埃隆·马斯克", "特斯拉", "埃隆", "ceo", "http"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000334, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尼康正在加大相机维修的难度，这是维权运动的“煤矿里的金丝雀”。", "note_en": "Nikon is making it harder to repair its cameras, 'the canary in the coal mine' for the right-to-repair movement. ", "posttime": "2020-05-02 21:18:13", "tags": "相机,尼康,longer,repair", "title": "尼康将不再授权任何人修理其相机", "title_en": "Nikon Will No Longer Authorize Anyone to Repair Its Cameras", "transed": 1, "url": "https://www.vice.com/en_us/article/qvgggp/nikon-is-making-it-harder-to-fix-its-cameras", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["相机", "尼康", "longer", "repair"]}, {"category": "", "categoryclass": "", "imagename": "99a151567d649869bb818d0d5cd0f00e.png", "infoid": 1000333, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在经过几个月的深思熟虑后，有争议的.org网站域名的出售-慈善机构和非营利组织使用-已经被搁置。\n运营.org域名的公共互联网注册中心(PIR)于11月被出售给私募股权公司ethos Capital，传言价格为10亿美元(8亿GB)。\n批评人士警告说，新的所有者将试图运营.org以盈利，这将使慈善机构损失数百万美元。\n包括美国女童子军和基督教青年会在内的组织呼吁阻止PIR的销售。\n非营利部门的许多人担心，将.org出售给一个营利性股权集团会导致：\n4月15日，加利福尼亚州总检察长泽维尔·贝塞拉(Xavier Becera)表示，转移引发了不容忽视的严重关切。\n互联网名称与数字地址分配机构(Icann)是.org和.com等顶级域名的管理机构。\n周四，它拒绝兑现PIR从互联网协会(Internet Society)转移到ethos Capital的交易。\n该公司在一份声明中表示，ethos Capital没有保护或服务.org社区的有意义的计划。\n此次收购将留下3.6亿美元的债务，PIR将被迫偿还这笔债务，并向股东提供回报。\n今天，Icann断然拒绝了ethos Capital将.org域名注册中心转变为负债累累的盈利性实体的计划。它在一份声明中表示，这是一场重要的胜利，承认了注册中心作为一个以使命为基础的非营利实体的长期遗产，保护了数千个组织及其服务的人的利益。\n但是，.org注册中心仍然需要一位忠实的管家，因为互联网协会已经明确表示，它不再需要这一责任。\n皮尔在宾夕法尼亚州注册成立，该州总检察长也在调查这笔交易。", "note_en": "The controversial sale of the .org web domain - used by charities and non-profit organisations - has been set back after months of deliberation.\n Public Internet Registry (PIR), which runs the .org domain, was sold in November to private equity firm Ethos Capital for a rumoured $1bn (£800m).\n Critics warned that the new owner would try to run .org for profit, costing charities millions.\n     Organisations including the Girl Scouts of America and the YMCA had called for the sale of PIR to be blocked.\n Many in the non-profit sector feared the sale of .org to a for-profit equity group would lead to:\n  On 15 April, California&#39;s attorney general Xavier Becerra said the transfer &#34;raises serious concerns that cannot be overlooked&#34;.\n The  Internet Corporation for Assigned Names and Numbers (Icann) is the governing body for top-level domains such as .org and .com.\n It declined to honour the transfer of PIR from the Internet Society to Ethos Capital on Thursday.\n  In a statement, it said Ethos Capital had &#34;no meaningful plan to protect or serve the .org community&#34;.\n The takeover would leave a debt of $360m, which PIR would be &#34;forced to service&#34; and &#34;provide returns to its shareholders&#34;.\n  &#34;Icann today roundly rejected Ethos Capital&#39;s plan to transform the .org domain registry into a heavily indebted for-profit entity. This is an important victory that recognises the registry&#39;s long legacy as a mission-based, not-for-profit entity protecting the interests of thousands of organisations and the people they serve,&#34; it said in a statement.\n &#34;But the .org registry still needs a faithful steward, because the Internet Society has made clear it no longer wants that responsibility.&#34;\n PIR is incorporated in Pennsylvania, where the state&#39;s attorney general is also investigating the sale.", "posttime": "2020-05-02 21:16:37", "tags": "域名,网站,web,注册,profit", "title": ".org网站域名销售被阻止", "title_en": "Sale of .org web domain blocked", "transed": 1, "url": "https://www.bbc.com/news/technology-52501456", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["域名", "网站", "web", "注册", "profit"]}, {"category": "", "categoryclass": "", "imagename": "c58c12d9d9cdd40b7cdc5273c0356ec0.png", "infoid": 1000332, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据我们的政策，任何人都可以在媒体上发表文章，但我们不会对每一篇报道进行事实核查。有关冠状病毒的更多信息，请参见cdc.gov。\nCOVID19即将杀死数以千计的餐厅。这场大流行是最终的压力测试，餐厅严重失败。想想看：当我们走出这个困境时，你最喜欢的食物可能不再存在了。为什么他们会被操成这样？听我解释。\n餐饮业的利润率是出了名的少。实际上是很小的。作为参考，银行、会计和法律服务的利润率约为18-25%，医疗保健利润率为12-15%，软件利润率为15-25%。餐馆？3-9%。是啊，就像个位数。这些微薄的利润率让餐厅的储备为零。因此，当危机来袭时(就像现在)，他们几乎就完蛋了。餐馆老板唯一的选择就是收起他们的骄傲，乞求和希望得到帮助--或者放弃那些俗话说的。\n那么，为什么利润率这么差呢？嗯，首先是整个行业在开始价格竞争时搬起石头砸自己的脚。你看，情况并不总是这样-过去的利润率即使不是现在的三倍，也是现在的两倍。但在过去的几十年里，虽然菜单价格应该一直在上涨，以跟上通胀和快速上涨的租金等因素，但价格战反而压低了价格(有人愿意支付1美元的超值套餐吗？)。所有这些被侵蚀的边际直到餐厅被..。\n“即使是广受赞誉的餐馆老板也在赚取越来越少的收入。利润率从20年前的15%-20%下降到今天的4%-7%。“--费城·马格。\n这就引出了我的下一点：我们对经营食品经营的真实成本缺乏理解或认识。我们只是不知道。而且我们的假设有很大的偏差。老实说，在我开Wolf Down(德国街头快餐)之前，我也不太了解这一点。让我告诉你，这让你大开眼界！我将通过我的经历来分享我的发现，以阐明为什么餐馆如此糟糕，为什么我们要(至少部分地)承担责任，以及我们是如何拥有权力的。\n首先，我们需要了解餐厅利润率是如何发挥作用的。别担心，我会保持简单的。利润率是销售收入减去把食物送到肚子里的所有费用后剩下的。这包括食品成本(COGS)、劳动力成本和间接费用。乍一看似乎相当直截了当，但有很多隐藏的成本可能会让你大吃一惊。我将只分享一些在“狼来了”之前我从未想过的东西。\n食物成本显然包括了所有的食材。然而，我们经常忘记的是像浪费和包装成本这样的东西，它们可能会很快累积起来。例如，我们的外卖碗每个售价0.35美元。再加上一个叉子、袋子和餐巾纸，这对我们的利润率来说是个不错的利润率。不知何故，我也确信从大型食品供应商那里获得产品会更便宜，因为我们是批量购买的。显然，情况并不总是如此。有些事情是这样的，但有些事情，他们会加价。为..。\n就管理费用而言，有房租、水电费、保险、互联网、簿记、支付处理等显而易见的费用。还有所有其他我从未想过的费用-比如每月300美元的垃圾管理费(我们已经习惯了在家里免费捡垃圾，我从来没有想过要付钱)。然后还有150美元的床单服务费来洗所有的清洁毛巾，150美元的洗碗机租赁费，另外150美元的隔油器服务费，还有别忘了。\n总而言之，食品成本通常占收入的33%左右，劳动力成本又占33%，希望管理费用足够低，足以产生剩余物。比率根据餐厅类型的不同而有所不同，但利润率通常在3-9%左右。为了帮助说明这一点，我为沃尔夫·唐恩(Wolf Down)的一位Döner整理了一个粗略的成本细目，让你对它是如何分解的有一个概念。\n在我们的情况下，由于我们的面包和蛋白质，食品成本比推荐的要高。我们想要最好、最新鲜的酸面团做我们的döner面包，所以我们和Artisin合作，他为我们定制了烘焙。这比预先包装的皮塔饼贵得多，但根据好评，这是完全值得的。至于蛋白质，我们不仅使用高质量的东西，而且与当今许多地方相反的是，我们在蛋白质上并不吝啬。大多数地方平均每份75-100克。我们超过125克。因为那是因为..。\n既然我们拒绝牺牲适当的份额和产品质量，我知道我们必须找到其他方法来降低成本。我们设计的精简菜单正是为此而设计的--优化运营成本以补偿食品成本。不过，如你所见，狼吞虎咽之后，就所剩无几了。大概一美元左右。这意味着我们需要出售大量的多纳来赚取一点利润。我想说的是，这里没有人能赚到几百万，只是想存点钱。\n好的，那么，我们怎样才能降低成本呢？除了扩张以从规模经济中获益(即，为什么这么大？", "note_en": "Anyone can publish on Medium per our  Policies, but we don’t fact-check every story. For more info about the coronavirus, see  cdc.gov.\n  COVID 19 is about to kill restaurants by the thousands. This pandemic is the ultimate pressure test and restaurants are failing hard. Think about it: when we come out of this, your favourite food spots might not be there any more. Why are they so fucked? Let me explain.\n Margins in the restaurant industry are notoriously small. Like tiny, actually. For reference, margins for banking, accounting, and legal services come in around 18–25%, healthcare 12-15%, and software 15–25%. Restaurants? 3–9%.  Ya, like single digit. These razor thin profit margins have left restaurants with zero reserves. So when a crisis hits ( like right now), they are pretty much screwed. Restaurant owners ’only options are to swallow their pride, beg, and hope for help —or throw in the proverbial  ...\n So, why are the margins so bad anyway? Well, it starts with the fact that the industry as a whole shot itself in the foot when it started competing on price. See, it wasn’t always this way — margins used to be double, if not triple, what they are now. But for the past couple decades, while menu prices should have been rising to keep up with things like inflation and rapidly increasing rent, price wars instead drove them down ( $1 value meal anyone?). All this eroded margins til restaurants were  ...\n “Even widely lauded restaurateurs are taking ever-smaller earnings. The 15-20% margins of 20 years ago have dwindled to a mere 4-7% today.” —  Philly Mag\n That brings me to my next point: our lack of understanding or appreciation of the true cost of running a food operation.  We just don’t know.And our assumptions are way off. To be honest, I didn ’t know most of this either before I opened Wolf Down (quick serve German Street Food). And let me tell you, it was quite the eye opener! I ’ll share what I discovered through my experience to shed light on why restaurants are so fucked, why we are (at least in part) accountable, and how we have the power  ...\n  First we need to understand how restaurant margins work. Don’t worry, I’ll keep it simple. Profit margin is what’s left of sales revenue after subtracting all expenses to get food into your belly. This includes food cost (COGS), labour cost, and overhead. It seems pretty straight forward at first, but there are a lot of  hidden costs that might surprise you. I’ll share just a few that I’d never even thought about before Wolf Down.\n Food cost obviously includes all the ingredients.  What we often forget though are things like waste and packaging cost, which can add up fast. Our take-out bowls, for example, cost $0.35 each. Add a fork, bag and napkins and that ’s a nice little bite out of our profit margin. I was also somehow convinced that getting product from big food suppliers would be cheaper since we buy in bulk. Apparently that ’s not always the case. For some things yes, but for others, they up-charge. Drinks for  ...\n In terms of overhead costs, there ’s the obvious stuff like rent, utilities, insurance, internet, bookkeeping, payment processing, etc. Then there ’s all this other stuff I ’d never thought about —like $300/month for waste management (we ’re so used to free garbage pick-up at home that I never anticipated having to pay for it). Then there ’s $150 for linen service to wash all the cleaning towels, another $150 for dishwasher rental, another $150 for grease trap servicing, and don ’t forget  ...\n All-in, food cost generally eats up around 33% of revenue, labour chews up another 33%, and hopefully overhead is low enough to have leftovers. Ratios vary based by restaurant type, but profit margins usually land around 3–9%. To help illustrate this, I put together a rough breakdown of costs for a döner at Wolf Down to give you an idea of how it all breaks down.\n  In our case, food cost is higher than recommended due to our bread and proteins. We wanted the best, freshest sourdough for our döner bread, so we partnered with Artisin who bakes it custom for us. This is much pricier than pre-packaged pitas but, based on the raving reviews, totally worth it. As for the protein, not only do we use high quality stuff, but contrary to many spots these days, we don ’t skimp on protein. Most places average 75 –100g per portion. We go over 125g. Cause that  ...\n Since we refuse to sacrifice proper portions and product quality, I knew we had to find other ways to keep costs down. We designed our streamlined menu precisely for this —optimizing operating costs to compensate for food cost. Still, as you can see, after wolfing down, there isn ’t much left. Roughly a dollar or so. That means we need to sell a whole lot of döner to make a little profit. All I ’m trying to say is, no one is making millions here, just trying to save up a little something  ...\n Ok so, how can we lower costs? Other than expanding to take benefit from economies of scale (ie. why big chains are doing ok), the options, well, you’re not gonna like them…\n Option 1: Lower food cost. Lower quality ingredients cost less.  But wait, they also won’t be as fresh or tasty.  You cool with that? Restaurants already do all they can to negotiate with suppliers to lower cost — and when they go too far, it shows. Personally, it makes me want to cry when my favourite sandwich spot replaces its fresh crusty sourdough for bagged pre-sliced Wonder trash.  But I get it. Though in my head I’m yelling ‘ I’ll pay for the good shit —please, bring it back!’. So  ...\n Option 2: Cut overhead costs. Again, restaurants do their best to negotiate with landlords, insurance companies, utilities, internet providers… and we all know how well that tends to work. If you want a nice clean dining experience — it is what is, and it costs what it costs. Not much wiggle room here.\n Option 3: Reduce labour cost.  How long do you want to wait for food? Is it ok if it’s not cooked perfectly cause one guy is trying to do five things at once? Besides, it’s not like we can we pay them any less — most make minimum wage. If anything, we don’t pay them enough. If you think they are  ‘non-skilled workers’ — are you saying feeding you is not a valuable skill? I’ve worked with great people in tech and finance, but they’re no better or harder working than our  Wolf Pack. This  ...\n “In most people’s opinion, an office job is preferable to a career in the restaurant industry. Which is not to say it’s not worthy work. If this pandemic has proven anything, it’s how essential those working in the food industry are. Instead, these assumptions come from a cycle of low pay and bad benefits that devalue both the job itself and the people doing it.” —  Eater\n And in case anyone is wondering “ Then how come Wolf Down can afford to feed healthcare workers for free?” What’s the deal?  Fine. For the sake of this post, I’ll come clean: it comes from our (the owner’s) pockets, not Wolf Down’s.\n What about third-party delivery? Do they help or hurt restaurants? That’s a whole other conversation I dive into in my post ‘ Why Uber Eats is A Necessary Evil’ — check it out if interested in learning more about that.\n How about tips? Tips are hugely appreciated and really help staff survive, which is awesome. Unfortunately, however, tips do not impact margins. Even though tipping generously is always commendable —  please keep it up!—it does not solve the problem.  So what do we do?\n Desperate times call for desperate measures. Although we can’t change the past, we can reshape the future. Let’s learn something from COVID 19. Let’s create positive change out of a bad situation and finally fix this mess. If you love food as much as I do, you might want to pay attention.\n Whenever the margin issue comes up, the answer always seems to be ‘ just lower costs’.  Like duh. But wait! We already trimmed all the fat… Decreasing costs won’t solve this. That leaves only one option: increasing sales revenue. We’ve been looking at it all wrong. The simple truth is we don’t pay enough. Without realizing it, we’ve been cheaping out on restaurants.\n The craziest thing to me in all this is, I love food. Like, obsessed.  Who’s with me? My point is: if eating is literally one of our favourite things ever, are we willing to pay adequately for it? Do we value it sufficiently? Honestly, seems to me like, if there’s one industry that should be profitable, it’s restaurants. One, we have to eat. Two, we love to eat! What if you could never have your favourite pizza, burger, pasta, etc, again? What would you pay to save it?\n Reports show that, due to COVID 19, 1 in 10 restaurants is already gone for good. And this is just the beginning. When restaurants do re-open (those that survive), they will be in rough shape. This is when we need to step up to ensure that those who put food on our tables can keep food on theirs.\n Let’s call it OPTION 19. As in,  we already tried all the other options and none work. As in,  fuck you COVID 19! It’s very simple: let’s reset our expectations and restore respectable margins. Like back in the 1990’s. Like many other industries today. We can do better. They deserve better. Let’s aim for 19%.\n How do  we do this? By supporting your favourite restaurants adjusting menu prices as needed.  That’s it. For too long they’ve avoided doing this out of fear we would rebel. Armed with new knowledge, let’s be more understanding. That’s how we #supportlocal. That’s how we keep enjoying our favourite foods. It won’t kill us. It will save them.\n  If you feel like it, please share, post, tag, like, publish, send to journalist, tell your friends — whatever you can to help this all be for something.", "posttime": "2020-05-02 18:06:51", "tags": "他妈的,restaurants,成本,food", "title": "为什么餐馆这么他妈的烂？", "title_en": "Why Restaurants Are So Fucked", "transed": 0, "url": "https://medium.com/@joelleparenteau/why-are-restaurants-so-fucked-ca07c4624745", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["他妈的", "成本", "food"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000331, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在去世前接受的最后一次采访中，共享软件先驱吉姆·巴顿(Jim Button)表示，在20世纪90年代初之前，他“已经放弃了共享软件游戏的想法”。当时，这似乎是一个合理的立场，这是一个基于相当多证据的立场。虽然有很多人试图以这种方式销售他们的游戏，但在游戏中还没有与Andrew Fluegelman、Jim Button或Bob Wallace相媲美的共享软件成功案例。\n很自然，很多人都在思考为什么会是这样。他们得出的答案往往带有那个时代的偏见，认为编程或玩无聊的游戏不如制作或使用呆板的商业软件那么正直。尽管如此，即使是有偏见的答案通常也有一层真实性。您与您的电信程序、数据库或文字处理程序有长期的合作关系，因此给其作者发送支票以加入.。\n幸运的是，对于那些缺乏人脉、抱负和才华的游戏程序员来说，除了共享软件模型之外，还有一种选择，可以走传统的商业路线-这种替代方案比20世纪80年代的共享软件提供了更好的前景，因为至少可以从自己的努力中获得一些报酬。这是光盘杂志中奇特的小聚居区，所以我们今天必须从那里开始我们的故事。\n磁盘杂志背后的核心理念几乎和个人计算机本身一样古老。1978年2月，加利福尼亚州戈莱塔的拉尔夫·麦克尔罗伊(Ralph McElroy)出版了第一期Cload，这是Radio Shack TRS-80每月一次的软件集合，是第一台预装的微型计算机，获得了真正令人印象深刻的销售数字。McElroy在他的介绍性社论中写道：“要加入多少有些精英的计算机用户俱乐部，一个人(以前)必须学习用一种相当……的语言说话的神秘艺术。”\n到了1981年，TRS-80的早期势头开始减弱，功能更强的Apple II表现强劲。什里夫波特路易斯安那州立大学医疗中心(Louisiana State University Medical Center)的程序员吉姆·曼厄姆(Jim Mangham)认为，市场已经准备好为Apple II推出等同于CLOAD的产品-尽管它不是以盒式磁带发布的，而是在软盘上发布的，而软盘现在正在稳步获得吸引力。他招募了一个叫阿尔·维科维乌斯的朋友来和他一起创业，两人准备了第一期他们喜欢的杂志.。\nMangham和Vekovius一开始只有50个用户，就把软盘打造成了Apple II计算领域的一支真正的力量。他们清楚地意识到，他们自己不可能写出足够的软件来填满每个月的磁盘，所以他们从一开始就努力与读者建立共生关系；他们发布的大部分程序都来自读者自己。在早期，互惠的精神扩展到了希望读者把他们的光盘寄回来的地步……。\n因此，曼格姆和维科维乌斯的小公司软盘出版公司慢慢地变成了一个名副其实的磁盘杂志帝国。随着时间的推移，曼格姆从日常运营中退了下来，成为Vekovius的近乎沉默的合作伙伴，Vekovius总是两人中更专注于商业的人。1983年8月，他将软盘扩展到每期两张磁盘；1984年1月开始进入零售店；1984年6月为Commodore 64推出了一本名为Loadstarfor the Commodore 64的配套磁盘杂志。软盘在伟大的..。\n为了鼓励软件提交，所有的软盘杂志都定期举办了一场名为CodeQuest的编程竞赛。鼓励读者发送任何类型的程序，除了软盘最终发布获奖软件所需支付的奖金外，还将争夺1000美元的冠军投稿奖金、500美元的第二名奖金和250美元的第三名奖金。大蓝盘的第二轮比赛于1988年1月31日结束，最终产生了两名获胜者，他们的成绩相当不错.。\n在比赛的时候，米勒似乎没有去过生活中的任何地方.。在他快30岁的时候，他仍然以一种相当杂乱无章的方式上大专，同时在数据处理图腾柱的低端做一些没有前途的工作，比如照看他所在学院的计算机室。他的熟人几乎不指望他搬出父母的房子，更不用说改变一个行业了。然而，这个看似懒惰的人却有雄心壮志，坚持不懈，敏锐的营销头脑……。\n在参加CodeQuest竞赛之前，他为当地报纸写了一篇关于游戏的专栏，写了一本关于如何击败流行街机游戏的书，最后但同样重要的是，他测试了早期的游戏共享软件市场：他以Apogee Software的名义编写并分发了几个共享软件文本冒险-这个名字后来在特定的游戏玩家中变得非常非常有名。但这一次，他对这个反应感到失望，就像其他人一样……。\n简而言之，Kroz王国是旧大型机Classi的混合体", "note_en": "In one of the last interviews he gave before his death, shareware pioneer Jim Button said that he “had written off the idea of shareware games” prior to the beginning of the 1990s. At the time, it seemed a reasonable position to take, one based on quite a bit of evidence. While any number of people had tried to sell their games this way, there had been no shareware success stories in games to rival those of Andrew Fluegelman, Jim Button, or Bob Wallace.\n Naturally, many pondered why this should be so. The answers they came up with were often shot through with the prejudices of the period, which held that programming or playing frivolous games was a less upstanding endeavor than that of making or using stolid business software. Still, even the prejudiced answers often had a ring of truth. You had a long-term relationship with your telecommunications program, database, or word processor, such that sending its author a check in order to join the  ...\n Luckily, there was an alternative to the shareware model for those game programmers who lacked the right combination of connections, ambitions, and talents to go the traditional commercial route — an alternative that offered a better prospect than shareware during the 1980s of getting paid at least a little something for one’s efforts. It was the odd little ghetto of the disk magazines, and so it’s there that we must start our story today.\n   The core idea behind the disk magazines is almost as old as personal computing itself. In February of 1978, Ralph McElroy of Goleta, California, published the first issue of  CLOAD, a monthly collection of software for the  Radio Shack TRS-80, the first pre-assembled microcomputer to rack up really impressive sales numbers. “To join the somewhat elite club of computer users, ”wrote McElroy in his introductory editorial, “one [previously] had to learn the mysterious art of speaking in a rather  ...\n By 1981, the TRS-80’s early momentum was beginning to flag and the more capable  Apple II was coming on strong. Jim Mangham, a programmer at the Louisiana State University Medical Center in Shreveport, decided that the market was ready for a  CLOADequivalent for the Apple II —albeit published not on cassettes but on floppy disks, which were now steadily gaining traction. He recruited a buddy named Al Vekovius to join him in the venture, and the two prepared the first issue of something they  ...\n Starting with just 50 subscribers, Mangham and Vekovius built  Softdiskinto a real force in Apple II computing. Well aware that they couldn ’t possibly write enough software themselves to fill a disk every single month, they worked hard from the beginning to foster a symbiotic relationship with their readership; most of the programs they published came from the readers themselves. In the early days, the spirit of reciprocity extended to the point of expecting readers to mail their disks back  ...\n Thus Mangham and Vekovius’s little company Softdisk Publishing slowly turned into a veritable disk-magazine empire. In time, Mangham stepped back from day-to-day operations, becoming a nearly silent partner to Vekovius, always the more business-focused of the pair. He expanded  Softdisk to two disks per issue in August of 1983; started reaching retail stores by January of 1984; launched a companion disk magazine called  Loadstarfor the Commodore 64 in June of 1984. Softdisk survived the great  ...\n   In order to encourage software submissions, all of the Softdisk magazines ran a periodic programming competition called CodeQuest. Readers were encouraged to send in programs of any type, competing for prizes of $1000 for the top submission, $500 for second place, and $250 for third place, on top of the money Softdisk would pay upon eventually publishing the winning software.  Big Blue Disk‘s second incarnation of the contest ended on January 31, 1988, yielding two winners that were fairly  ...\n At the time of the contest, Miller didn ’t seem to be going much of anywhere in life. In his late twenties, he was still attending junior college in a rather desultory fashion whilst working dead-end gigs at the lower end of the data-processing totem pole, such as babysitting his college ’s computer lab. His acquaintances hardly expected him to ever move out of his parents ’house, much less change an industry. Yet this seeming slacker had reserves of ambition, persistence, marketing acumen,  ...\n  Before entering the CodeQuest contest, he’d written a column on games for the local newspaper, written a book on how to beat popular arcade games, and, last but not least, tested the early shareware market for games: he’d written and distributed  a couple of  shareware text adventuresunder the name of Apogee Software —a name which would later become very, very famous among a certain segment of gamers. But on this occasion he was disappointed by the response, just like everyone else making  ...\n Put crudely,  Kingdom of Kroz was a mash-up of the old mainframe classic   Rogue and the arcade game   Gauntlet — or, if you like, a version of  Rogue that  played in real time and had handcrafted levels instead of procedurally-generated ones. It wasn’t much to look at — like classic  Rogue, it was rendered entirely in ASCII graphics — but many people found it surprisingly addictive once they got into it. It went over very well indeed with  Big Blue Disk‘s subscribers when it appeared in the  ...\n While he waited on  Big Blue Diskto release those sequels, Miller started to explore a new idea for marketing games outside the traditional publishing framework. In fact, this latest idea would eventually prove his greatest single stroke of marketing genius, even if its full importance would take some time yet to crystallize. He would later sum up his insight in an interview: “People aren ’t willing to pay for something they ’ve already got in their hands, but they are willing to pay  ...\n Miller and George Broussard, his longtime best friend and occasional partner in the treacherous world of shareware, made an engine for multiple-choice trivia games — not exactly a daunting programming challenge after the likes of  Kroz. They compiled sets of questions dealing with different topics: general trivia,  vocabulary,  the original  Star Trek and  Star Trek: The Next Generation. They created “volumes ”in each category consisting of 100 questions. Then they released the first  ...\n Alas, the scheme proved not to be a surefire means of selling trivia games; the economics of getting just 100 questions for $4 were perhaps a bit dodgy even in the late 1980s, when just about everything involving computers cost exponentially more than it does today. But a seed had been planted; the next time Miller tried something similar, he would finally hit pay dirt.\n The next time in question came in the second half of 1989, just after  Big Blue Disk published the last  Kroz game. The magazine’s contract terms were far more generous than those of any traditional software publisher: Miller had retained the  Kroz copyright throughout, and the magazine’s license to it became non-exclusive as soon as it published the third and last game of the trilogy. Miller, in other words, could now do whatever he wished with his three  Krozgames, while still benefiting  ...\n  So, he decided to try the same scheme he had used with his trivia games: release the first part of the trilogy for free, but ask people to send him $7.50 each for the second and third parts. A tactic that had prompted an underwhelming response the first time around worked out much better this time. Unlike those earlier exercises in multiple choice, the  Kroz trilogy was made up of real  games—or, perhaps better said, was actually one real game artificially divided into three. After  ...\n In short, Scott Miller —and shareware gaming in general —finally got their equivalent to that day when Jim Button returned home from a Hawaiian vacation to find his basement drowning in paid registrations. Suddenly Miller as well was drowning in mail, making thousands of dollars every month. He ’d done it; his dogged persistence had paid off. He ’d found a way around the machinations of the big publishers, found a way to sell games on his own terms, cracked the code of shareware  ...\n From here, things happened very, very quickly. Miller whipped up a second trilogy of  Kroz games to sell under the same model —  first part free,  second and  thirdmust be paid for —and was rewarded with more checks in the mail. Most people at this point would have been content to continue writing lone-wolf games and reaping huge rewards —but Miller was, as I ’ve already noted, a man of unusual ambition. At heart, he was more passionate about marketing games than programming them;  ...\n Already before 1989 was over, he had reached out to a Silicon Valley youth named Todd Raplogle, who had created and uploaded to various bulletin-board systems a little action-adventure called  Caves of Thor that was similar in spirit to the  Kroz games. Miller convinced Raplogle to re-release his free game under the Apogee imprint, and to make two paid sequels to accompany it. Raplogle followed that trilogy up with a tetralogy called   Monuments of Mars. Meanwhile George Broussard  ...\n By 1991, Apogee was off and running as a real business. Miller quit his dead-end day jobs, moved out of his parents’ house, convinced Broussard to join him as a full-time partner, found an accountant, leased himself an office, and started hiring helpline attendants and clerical help to deal with a workload that was mushrooming for all the right reasons. His life had undergone a head-spinning transformation in the span of less than two years.\n At this point, then, we might want to ask ourselves in a more holistic way just  whyApogee became so successful so quickly. Undoubtedly, a huge part of the equation is indeed the much-vaunted “Apogee model ”of selling shareware: hook them with a free game, then reel them in with the paid sequels. Yet that wasn ’t a silver bullet in and of itself, as Miller ’s own early lack of success with his trivia games illustrates. It had to be executed just right —which tells us that Miller  ...\n If all of this sounds a bit mercenary, so be it; Miller was as hard-nosed as capitalists come, and he certainly wasn ’t running Apogee as a charity. Yet it ’s seldom good business, at least in the long run, to sell junk, and this too Miller understood. Apogee maintained a level of quality control that was often lacking even from the big publishers, who often felt compelled to release a game before its time to meet the Christmas market or to pump up the quarterly numbers.  ...\n I ’ll be the first to admit that the Apogee style of game does little for me. Still, my personal tastes in no way blind me to the reality that these unprepossessing but well-crafted little games filled a space in the market of the early 1990s that the big publishers were missing entirely as they rushed to cement a grand merger of Silicon Valley and Hollywood and begin the era of the “interactive movie. ”While the boxed-games industry went more and more high-concept, with  ...\n But of course a business model as profitable as Miller ’s must soon attract rivals who hope to execute it even better. Already in 1992, a company called Epic MegaGames appeared to challenge Apogee for the title of King of Shareware; they as well employed Scott Miller ’s episodic approach, and also echoed Apogee ’s proven action-first design aesthetic. Shareware gaming was becoming a thriving shadow industry of its own, right under the noses of the big boys who were still  ...\n  This shareware sales chart from July of 1993 shows how dominant Apogee was at that time. Seven out of the top ten games are theirs, with a further two going to Epic MegaGames, their only remotely close competitor. Although the fast-and-simple design aesthetic in which those companies specialized ruled the charts, they pulled with them a long tale of many other types of shareware games, as we ’ll see in the next part of this article. The very fact that there existed a  ...\n Many of you doubtless have an inkling already of where this series of articles must go from here — of how not only the story of Apogee Software but also that of Softdisk Publications will feed directly into that of the most transformative computer game in history. And never fear, I’ll get to all of that — but in my next article rather than this one.\n For in addition to that other story which threatens to suck all the oxygen out of the room, there are a thousand other, smaller ones of individual creators being inspired to program all kinds of games and sell them as shareware in the wake of Apogee ’s success. Exactly none of them made as much money from their endeavors as did Scott Miller, but some became popular enough to still be remembered today. Indeed, many of us who were around back then still have our obscure  ...\n Like the Apogee games, many other shareware titles identified holes in the market which the big publishers, who all seemed to be rushing hell-bent in the exact same direction, were failing to fill. In many cases, these were genres from which the traditional industry had actually done very well in the past, but which which it had now judged to no longer to be worth its while. For example, the years between the  collapse of Infocomin 1989 and the beginning of the Internet-based  ...\n In terms of presentation, most of these shareware games were dead ringers for the games that had been sold on store shelves five to ten years earlier. And by the same token, the people who made them in the 1990s were really not all that different from the bedroom programmers who had built the boxed-games industry in the 1980s. Just as many creators of non-game shareware were uncomfortable with time-limited or otherwise crippled software, not all creators of shareware  ...\n By way of illustration, I’d like to conclude this article with a short case study of a shareware parnership that didn’t make its principals rich, that didn’t even allow them to quit their day jobs. In fact, neither partner ever really even  triedto achieve either of those things. They just made games in two unfashionable styles which they still happened to love, and said games made some other people with the same tastes very happy. And that was more than enough for  ...\n   Matthew remembers his best childhood Christmas ever as the one in 1983, when he was twelve years old and his family got an Apple IIe computer. A sheet of Apple-logo stickers came in the box that housed the computer, and Matthew stuck one of them on his notebook. Soon Daniel, another student at his Los Angeles-area school, noticed the sticker and came over to chat. “I’ve got an Apple II also!” he said. Just like that, a lifelong friendship was born.\n The two joined an informal community of fellow travelers, the likes of which could be found in school cafeterias and playgrounds all over the country, swapping tips and exploits and most of all games. Their favorites of the games they traded were the text adventures of Infocom and the  Ultima CRPGs of Origin Systems; if the pair’s friendship was born over the Apple II, it was cemented during the many hours they spent plumbing the depths of   Zorktogether. Matthew  ...\n So many things in life are a question of timing — not least the careers of game developers. One story which Matthew Engle shared with me when I interviewed him in preparation for this article makes that point disarmingly explicit. In 1986, Daniel, Matthew, and another friend created a BASIC text adventure called  Zapracker, which they attempted to sell through their local software stores. Matthew:\n We made our own boxes and packaged the game with the floppy disk and the manual, just like Richard Garriott did back in the day. Our box was designed to hang on a peg in a software store. We got on a bus with 25 or so copies and visited a few different stores. We’d say, “Hey, would you like to sell this on consignment? You get half the money and we get half.” A few stores took us up on it, and we sold a few copies.\n       This tale is indeed almost eerily similar of that of Richard Garriott selling a Ziploc-bagged   Akalabeth through his local Computerland just six years earlier; if anything, our heroes in 1986 would appear to have put  moreeffort into their packaging, and perhaps into their game as well, than Garriott did into his. But in the short span of barely half a decade, the possibility of parlaying a homemade game hanging on a rack in a local computer store into an iconic  ...\n Their game-making efforts were growing steadily more sophisticated, as evinced by Daniel’s choice of programming languages: after starting off in Apple II BASIC, he moved on to an MS-DOS C compiler. Adopting unknowingly the approach that had already been used by everyone from  Scott Adams to  Infocom, from  Telarium to  Polarware to  Magnetic Scrolls, Daniel wrote an interpreter in C which could present a text adventure written in a domain-specific language of his  ...\n During the pair ’s last year in high school, the Los Angeles school district and the manufacturing conglomerate Rockwell International co-sponsored a contest for interesting student projects in computer science. Once Daniel and Matthew decided to enter it, it gave them a thing which many creators find invaluable: a deadline. They finished up their game, and submitted it alongside the technological framework that enabled it. They were soon informed that their  ...\n All of the finalists were there, demonstrating their entries. We did a couple of interviews for a local TV station. Then the dinner started. They started running down the list of winners, and before we knew it, it was down to two finalists: my and Dan’s project and another one. Then they announced the other one as second place; we had won. It was quite a night!\n  Daniel and Matthew gave little initial thought to monetizing their big win. After finishing high school in 1989, they went their separate ways, at least in terms of physical location: Daniel moved to New York to study computer science, while Matthew stayed in Los Angeles to study film. But they kept in touch, and soon started talking about making another game, this time in the spirit of their other favorite type from the 1980s: an old-school  Ultima.\n It was 1991 by now, and, fed by the meteoric success of Apogee, shareware games of many different stripes were appearing. Daniel and Matthew as well finally caught the fever. They belatedly released  Skyland’s Star as shareware for $15, using it as a sort of test case for the eventual marketing of their  Ultima-alike. They were among those noble or naïve souls who eschewed the Apogee model in favor of releasing their whole game at once. Instead of offering  ...\n Progress on the  Ultima-like game, which was to be called   Excelsior Phase I: Lysandia, was inevitably slowed by their respective university studies; the biggest chunk of the work got done in the summers of 1991, 1992, and 1993, when Daniel came back to Los Angeles and they both had more free time. Then they would sit for hours many days at their favorite pizza restaurant, sketching out their plans. Matthew did most of the scenario design, graphics, and  ...\n Calling themselves by now 11th Dimension Entertainment, they finished and released  Excelsior in 1993 as shareware, with a registration price of $20. Once again, they relied on a manual, a hint book, and a map alongside players’ consciences to convince them to register. Although it certainly didn’t become an Apogee-sized success story,  Excelsior did garner more attention and registrations than had  Skyland’s Star. It was helped not only by its being in a  ...\n As they were finishing  Excelsior, Daniel and Matthew had also been finishing their degree programs. Daniel got a programming job at Electronic Arts after a few false starts, while Matthew started a career in Hollywood that would put him, ironically given the retro nature of  Excelsior, on teams making cutting-edge CD-ROM-enabled multimedia products at companies like Disney Interactive. Despite their busy lives, they were both still excited enough by independent  ...\n The sheer quantity of labor which Matthew in particular put into this retro-game with limited commercial prospects could have been motivated only by love. Matthew:\n We went all out. I ultimately made about 3800 16 X 16-pixel tiles. It was an exhausting process. For every tile, I had to specify whether you could walk on it or it would block you. There was also transparency; we had layers of tiles, overlaid upon one another. There might be a grass tile, then the player-character tile. Then, if you’re walking through a doorway, for example, the arch at the top of the doorway.\n Then, after that exhausting process, began the arduous process of putting the tiles down to create the map, which was 500 X 500 tiles if I’m not mistaken — so, 250,000 tiles to place. Plus all of the town and castle and dungeon maps had to be created.\n By the time they released   Excelsior Phase II: Errondorin 1999, software distribution had changed dramatically from what it had been six years before. It was now feasible to accept credit-card registrations online, and to offer registrants the instant satisfaction of downloadable PDF documents and the like. The motivating ethic of the original shareware movement was alive and well in its way, but, just as with other types of software, the phrase “shareware  ...\n In the end, the two of them sold roughly 500 copies each of  Excelsior I and  II — “small potatoes” by any standard, as Matthew freely admits. He believes that they made perhaps $5000 to $10,000 in all on their games, after the cost of postage and all those printed manuals was subtracted.\n I must confess that I personally have some reservations about the 11th Dimension games. It seems to me that  Skyland’s Star‘s scenario isn’t quite compelling enough to overcome the engine’s limited parser and lack of player conveniences, and that the  Excelsiorgames, while certainly expansive and carefully put-together, rely a bit too much on needle-in-the-haystack hunting over their enormous maps. Then again, though, I have the exact same complaints  ...\n Shareware gave a place for games like those of Daniel and Matthew to live and breathe when the only other viable mode of distribution was through the boxed publishers, who interested themselves only in a fairly small subset of the things that games can do and be. Long before the likes of Steam, the shareware scene was the indie-games scene of its time, demonstrating all of the quirky spirit which that phrase has come to imply. While the big boys  ...\n ( Sources: the books   Masters of Doom by David Kushner,   Rocket Jump: Quake and the Golden Age of First-Person Shooters by David L. Craddock, and   Sophistication &amp; Simplicity: The Life and Times of the Apple II Computer by Steven Weyhrich;  Computer Gaming World of December 1992, January 1993, March 1993, May 1993, June 1993, July 1993, September 1993, January 1994, February 1994, and June 1994;  Game Developer of January/February 1995;  PC Powerplay  ...\n In the interest of full disclosure as well as a full listing of sources, I have to note that a small part of this article is drawn from lived personal experience. I actually knew Scott Miller and George Broussard in the late 1980s and early 1990s, albeit only in a very attenuated, second-hand sort of way: Scott dated my sister for several years. Scott and George came by my room from time to time to see the latest Amiga games when I was still in  ...\n A year or two after finishing high school, I interviewed for a job at Apogee, which was by then flying high. Again, had I known what my future held I would have paid more attention to my surroundings; I retain only the vaguest impression of a chaotic but otherwise unremarkable-looking office. Scott and George were perceptive enough to realize that I would never have fit in with them, and didn ’t hire me. For this I bear them no ill will whatsoever,  ...\n The company once known as Apogee, which is now known as 3D Realms, has released  all of their old shareware games for free on their website. Daniel Berke and Matthew Engle continue to maintain their old games in updated versions that work with modern incarnations of Windows; you can  download them and  purchase registrations on the 11th Dimension Entertainment home page.)", "posttime": "2020-05-02 18:06:48", "tags": "游戏,软件,scene,games", "title": "共享软件场景，第2部分：游戏问题", "title_en": "The Shareware Scene, Part 2: The Question of Games", "transed": 0, "url": "https://www.filfre.net/2020/05/the-shareware-scene-part-2-the-question-of-games/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["游戏", "软件", "scene", "games"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000330, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新墨西哥州阿尔伯克基--桑迪亚国家实验室(Sandia National Laboratory)领导的一组研究人员发明了一款首创的软件，供科学家创建复杂物体的精确数字表示。\n这款名为VoroCrust的新软件提供了一种新的方式来创建名为网格的数字表示，科学家们在许多学科中使用这种网格，这些学科使用各种部件的几何模型-从转子到车轮再到防护设备。复杂网格通常具有曲线、锐边或孔。一旦创建，它们看起来就像3D图像，可以在计算机模拟中使用，计算机模拟中包含确定部件在极端条件下何时可能失效的算法。这是一个很有帮助的-而且经常是..。\n例如，航空航天行业的一位科学家可能会制作一个飞机机翼的网格，并通过计算机模拟来了解更多关于它在大风和极端温度下会发生什么的信息。一些科学家还使用网格对地质学进行建模，以预测地下变化，例如液体或污染物的地下流动。\n桑迪亚计算机科学家兼项目负责人穆罕默德·埃贝达(Mohamed Ebeida)表示，VoroCrust结合了名为Voronoi Cell的特殊类型的3D多面体细胞来创建网格。他说，大多数其他网格生成方法使用3D四面体或六面体单元，这些单元质量较低或难以自动化。现有的Voronoi网格划分方法并不总是适用于复杂物体的所有角和角。这可以用体力劳动来解决，但这是一个乏味的过程，可能需要大量的…。\nVoroCrust目前正在接受其他一些政府机构和大学的测试。该软件拥有一项专利，另外还提交了两项专利申请。研究许可证可通过桑迪亚知识产权局获得。\nEbeida说，VoroCrust是第一个生成符合复杂模型的Voronoi-cell网格的软件，不需要手动修复。他已经在该软件上工作了三年多，并表示该软件可以减少科学家在3D建模上花费的许多小时的体力劳动。\n“桑迪亚认为啮合是这些分析中最大的单一瓶颈，”埃贝达说。目前的做法需要人工干预，而VoroCrust为我们提供了一条实现这一过程自动化的途径，通过减少修复计算机生成的建模错误所花费的时间，减轻了技术人员的负担。“。\nEbeida说，最近描述VoroCrust的手稿已经通过了Graphics的交易，并将在顶级计算机图形会议SIGGRAPH 2020上展示，并补充说“这是一个相当大的荣誉。”\n该软件是与马里兰大学、帕克学院、德克萨斯大学奥斯汀分校和加州大学戴维斯分校合作开发的。\n在3D建模中，分析师在需要分析的对象周围创建看起来像几何壳的网格。理想情况下，网格看起来与对象完全一样，并符合所有边，但使用当前的网格技术并不总是很容易做到这一点。\n常见的网格方法通常使用四面体和六面体单元来填充对象的空间，从对象的内部到其外部边界。然而，当单元不符合边界附近的形状时，就会出现问题。Ebeida说，手动修复这个问题并不总是可靠的，有时会改变最终模型的数学属性。\n想象啮合过程的一种方式是想着填满床垫。四面体的“垫子”可以很容易地填满空间，但它们可能太坚固了。六面体坐垫可以更灵活，但由于其固定的结构，可能不会沿着顶部或角落的边缘。使用灵活的材料，如多面体，可以有任意数量的边，可以更容易地填充床垫的所有区域和角落。\nEbeida说，为了完全自动化网格划分过程，他的团队不仅使用了多面体，他们还逆转了标准方法，找到了一种从3D模型的边界而不是中间开始的方法。研究小组小心翼翼地在几何物体的边界周围放置称为种子的点，然后这些点成为沃罗诺伊细胞的立足点。一旦边界的外部完成，就可以用附加的Voronoi单元格填充对象的内部。\n马里兰大学的博士生艾哈迈德·阿卜杜勒卡德(Ahmed Abdelkader)与埃贝达一起研究VoroCrust，并描述了使用Voronoi细胞的优势。\n“表面更干净，就像宝石或钻石，”他说。“它们可以完美而自然地结合在一起。”\nAbdelkader说，曲线带来了挑战，他使用碗和更复杂的物体(如发动机)为例。他说，要确定必要的成分，以便在数学证明中将这些碎片完美地组合在一起，需要做大量的工作。现在，他说，团队很高兴能在这一更深层次的理解基础上，通过以下方式增强软件", "note_en": "ALBUQUERQUE, N.M. — A team of researchers led by Sandia National Laboratories have invented a first-of-its-kind software for scientists to create accurate digital representations of complex objects.\n  The new software, VoroCrust, offers a novel way to create digital representations, called meshes, which are used by scientists in many disciplines that work with geometric models of all kinds of parts —from rotors to wheels to protective equipment. Complex meshes often have curves, sharp edges or holes. Once created, they look like 3D images that can be used in computer simulations that incorporate algorithms to determine when parts might fail in extreme conditions. This is a helpful —and often  ...\n For example, a scientist in the aerospace industry might make a mesh of an airplane wing and run it through a computer simulation to learn more about what will happen to it in high wind and extreme temperatures. Some scientists also use meshes to model geology to anticipate underground changes, such as subsurface flows of liquids or contaminants.\n VoroCrust incorporates special types of 3D polyhedral cells called Voronoi cells to create the meshes, said Sandia computer scientist and project lead Mohamed Ebeida. Most other mesh-generation methods use 3D tetrahedral or hexahedral cells that can have low quality or are difficult to automate, he said. Existing methods for Voronoi meshing don ’t always conform to all corners and angles of complex objects. This can be fixed with manual labor, but it is a tedious process that can take a significant  ...\n VoroCrust is currently being tested by a few other government agencies and universities. The software has one patent, and two additional patent applications have been filed. Research licenses are available through Sandia’s  Intellectual Property office.\n VoroCrust is the first software to generate Voronoi-cell meshes that conform to complex models without needing to be fixed manually, said Ebeida. He’s been working on the software for more than three years and said the software could reduce many hours of manual labor that scientists spend on 3D modeling.\n  “Sandia identified meshing as the single biggest bottleneck in these analyses,” Ebeida said. “Current practices require human intervention, and VoroCrust provides us with a path toward automating this process to relieve tech staff by reducing the time spent on fixing computer-generated errors in modeling.”\n A recent manuscript describing VoroCrust has been reviewed and accepted in Transaction on Graphics and will be presented in  SIGGRAPH 2020, a top computer graphics conference, Ebeida said, adding “this is quite an honor.”\n The software was developed in collaboration with the University of Maryland, College Park, the University of Texas at Austin and the University of California, Davis.\n  In 3D modeling, analysts create meshes that look like geometric shells around the objects they need to analyze. Ideally, the mesh will look exactly like the object and conform to all edges, but that’s not always easy using current meshing techniques.\n Common meshing methods typically use the tetrahedral and hexahedral cells to fill the space of an object, starting from the object’s interior toward its outside boundaries However, problems occur when the cells do not conform to the shape near the boundary. Manually fixing this problem is not always reliable and sometimes changes the mathematical properties of the final model, Ebeida said.\n One way to imagine the meshing process is to think of filling a mattress. Tetrahedral “cushions” could fill the space easily, but they might be too firm. Hexahedral cushions could be more flexible but might not follow the edges along the top or corners due to their fixed structure. Using flexible material like a polyhedron that can have arbitrary number of sides could make it easier to fill all areas and corners of the mattress.\n  Ebeida said to fully automate the meshing process, his team not only used polyhedrons, they also reversed the standard approach and found a way to start at the boundary, rather than the middle, of a 3D model. The team carefully placed points, called seeds, around the boundaries of geometrical objects, which then became footholds for Voronoi cells. Once the outside of the boundary is complete, the interior of the object can be filled in with additional Voronoi cells.\n Ahmed Abdelkader, a doctoral student at the University of Maryland, worked on VoroCrust with Ebeida and described the advantages of using Voronoi cells.\n “The facets are cleaner, like gemstones or diamonds,” he said. “They can perfectly and naturally fit together.”\n Curves present challenges, Abdelkader said, using the examples of bowls and more complex objects like engines. He said it took a lot of work to pin down the necessary ingredient that would set the pieces together perfectly in a mathematical proof. Now, he said, the team is excited to build upon this deeper understanding to enhance the software with more features.\n “The Voronoi magic will happen,” Ebeida said. “Once you decompose the object into these well-shaped pieces, these cells, you can mesh any model you want with confidence about the quality of the resulting mesh without any post-processing.”\n  When working on  VoroCrust, the goal was to create a software robust enough that it could model any object needed for simulation, said Ahmed Mahmoud, a University of California doctoral student who worked on the software.\n Sandia manager Emily Stein and research engineer Tara LaForce have used VoroCrust to make geological models for deep disposal of nuclear waste as part of the Department of Energy’s Spent Fuel and Waste Science and Technology Campaign that Sandia leads. In addition to the  Laboratory Directed Research and Development program, the campaign contributes funding for VoroCrust development.\n Two priorities of the campaign are to create design concepts and numerical modeling approaches for disposal systems. VoroCrust might create a mesh of an underground repository and the waste in it, or it could create a mesh of the underground geology. This mesh can be then used to solve the subsurface flow of liquid or gas in porous material or the transport of contaminants within flowing fluids.\n LaForce said VoroCrust offers promising capabilities for creating a mesh that can run in a reasonable timeframe. Stein added that other meshing methods sometimes distort the mesh, creating a simulation that is not as accurate as it could be.\n  “The idea is that we could take the geological model as it is and run it without additional manipulation,” LaForce said.\n Carl Gable, the leader of the Computational Earth Sciences group at Los Alamos National Laboratory, has also used VoroCrust to create geological models as part of the campaign.\n “If you’re making an airplane, submarine or car, one of the first steps is building computational framework you’re trying to represent,” Gable said. “In our case, it’s geology. We need to represent tunnels, canisters and waste packages, and we also need represent the natural system, the geological system, and VoroCrust is a tool that is good at doing that.”\n  Ebeida said while the research problem of creating geometric meshes with Voronoi cells has been solved, the technical readiness of the software is not at a place where it could be used off-the-shelf.\n Sandia manager Joe Bishop, who’s been interested in VoroCrust for years, said modeling and simulation engineers on his team could benefit from the software for simulations if current software packages can leverage the polyhedral elements.\n “We need to know if we can run our simulations on these objects and compare it to tetrahedral and hexahedral methods,” he said. “VoroCrust is a promising tool. It could provide the geometry, and we would do the physics.”\n  Sandia National Laboratories is a multimission laboratory operated by National Technology and Engineering Solutions of Sandia LLC, a wholly owned subsidiary of Honeywell International Inc., for the U.S. Department of Energy ’s National Nuclear Security Administration. Sandia Labs has major research and development responsibilities in nuclear deterrence, global security, defense, energy technologies and economic competitiveness, with main facilities in Albuquerque,  ...", "posttime": "2020-05-02 18:06:45", "tags": "自动化,automating,网格,vorocrust", "title": "自动化复杂的3D建模", "title_en": "Automating Complex 3D Modeling", "transed": 0, "url": "https://share-ng.sandia.gov/news/resources/news_releases/3d_modeling/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["自动化", "网格", "vorocrust"]}]