[{"category": "", "categoryclass": "", "imagename": "00d3291eebdcee1117833f94f5e8bf1f.jpg", "infoid": 1033363, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你的键盘可以访问你的记忆呢？如果它可以完成你的想法，而不是基于你之前输入的东西，或者学习一般性的回复或愚蠢的规则，而是基于一个包含各种地点、书籍、网页和笔记的个人数据库，那会怎么样？\n当你用日语打字时，让我们了解一下这会是什么样子，你在键盘上输入的内容与屏幕上显示的内容并不完全相同。取而代之的是，你可以输入你想要的文字的罗马化版本，一次几个字。在每个跨度之后，您可以将其锁定，如果您需要转换，您可以从下拉列表中选择一个替换选项。在某些输入系统中，当前选项的旁边可能会显示简短的定义。\n日语自动补全功能基于操作系统附带的词典和用户词典。如果你经常要输入字典里没有的东西，你可以把它注册到个人字典里，这样它就会像其他单词一样出现。你也可以获得创造性，注册一些不是普通单词的东西，比如把家换成123毫升。愉快的驾车路线。\n这种中介输入开启了软件键盘(缩写为输入法引擎(IMES))的智慧潜能。引入表情符号只需将它们添加到字体和词典中--你不必告诉人们如何使用它们，因为当你输入啤酒🍻或爱你的😍或其他东西时，它们只是另一个补全选项。\n现在我们都有智能手机，我们都有媒介输入，表情符号无处不在。万岁。🎊。\n如果你能在这里输入我上周去过的那个杂货店，然后自动完成一个地图链接，会怎么样？\n这就是我在午餐时提到的那本书。这是一款带有间接控制的游戏。这是你应该去的那个聚会的页面。这是你可以买到博物馆展览门票的地方。\n当然，多亏了万能的链接，你已经可以分享这些信息了，但如果它不需要上下文切换呢？如果做笔记能让你更容易与人分享，那会怎样呢？(当然，这是Memex梦想的一部分。)\n六年前，当我开始在Deltos上做个人笔记时，我的目标之一是把Deltos中的音符用作口吃师键盘的素材，但这最终被搁置了。事实证明，使用IME是很困难的--每个操作系统都有完全不同的处理方式，而且它们往往没有很好的文档记录。\n具体地说，IME的工作原则是，对于任何给定的输入，潜在的输出都是明确定义的。在字典文件中，这些只是很短的文本片段。但是，如果你可以搜索你所有的笔记，那么输入和输出就不是很好的定义，仅仅更新词典是不够的--你需要搜索功能。\n一种想法是避免直接使用IME接口。一个小的应用程序，只是一个搜索框，其中的选择被复制到剪贴板上，就足以实现哲学家键盘的主要目标，同时仍然最大限度地减少上下文切换。这也将使创建跨平台应用程序变得更容易。也许这就足够好了。\n另一个问题是，大多数人没有明确的个人数据库，只是被锁在孤岛上的一堆个人数据。解决这个问题是另一个也是更大的一步，但它可以一次只有一个人来处理。", "note_en": "What if your keyboard had access to your memories? What if it could completeyour thoughts, not based on what you&#39;d previously typed or learning  genericresponsesor  dumb rules, but based on a personaldatabase of places, books, web pages, and notes of all kinds?\n  To give an idea of what this would look like, when you type in Japanese, whatyou type on the keyboard isn&#39;t exactly what shows up on the screen. Instead youcan type a romanized version of the text you want a few words at a time. Aftereach span you lock it in, and if you need conversion you choose one of a fewalternatives from a drop-down list. In some input systems, short definitionsmay be shown next to the current selection.\n  Autocomplete in Japanese is based on a dictionary supplied with your operatingsystem, plus a user dictionary. If you frequently have to type something not inthe dictionary you can register it in a personal dictionary to have it come outjust like any other word. You can also get creative and register things thataren&#39;t normal words, like converting &#34;home&#34; to &#34;123 Mt. Pleasant Drive&#34;.\n This  mediated input opened up potential for cleverness in software keyboards,acronymically known as  Input Method Engines (IMEs). Introducing emojiwas just a matter of adding them to a font and the dictionary - you didn&#39;t haveto tell people how to use them, as they&#39;d just be another completion optionwhen you typed &#34;beer&#34; 🍻 or &#34;love&#34; 😍 or what have you.\n Now we all have smartphones, and we all have mediated input, and emoji areeverywhere. Hooray. 🎊\n  What if you could type &#34;Here&#39;s that  gyoza place I went to last week&#34; andautocomplete a map link?\n  &#34;Here&#39;s that book I mentioned at lunch.&#34; &#34;This is that game with indirectcontrols.&#34; &#34;This is the page for that meetup you should go to.&#34; &#34;This is whereyou can get tickets for that museum show.&#34;\n Of course you can already share this information thanks to the universal powerof links, but what if it didn&#39;t need a context switch? What if taking notes onthings made it easier for you to share them with people? (This is, of course,part of the dream of the  Memex.)\n Six years ago when I started work on  Deltos for personal notetaking, one of my goals was to use the notes in Deltos as fodder for aphilosopher&#39;s keyboard, but that ended up falling by the wayside. It turns outworking with IMEs is difficult - every operating system has a completelydifferent way of handling them, and they often aren&#39;t well documented.\n In particular, IMEs often work on the principle that for any given input, thepotential outputs are clearly defined. In a dictionary file these are justshort bits of text. But if you can search through all your notes, then inputsand outputs aren&#39;t well defined, and just updating the dictionary isn&#39;t enough -you need search functionality.\n One idea is to avoid using the IME interface directly. A small application,just a search box where a selection is copied to the clipboard, would be enoughto realize the main goal of the philosopher&#39;s keyboard, while still minimizingcontext switching. It would also make it easier to create a cross-platform app.Maybe that&#39;s good enough.\n The other problem is that most people don&#39;t have an explicit personal database,just a bunch of personal data locked up in silos. Fixing that is another andhonestly bigger step, but it can be handled one person at a time.", "posttime": "2020-11-06 04:23:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "键盘,哲学家,philosopher,输入", "title": "寻找哲学家的键盘", "title_en": "In Search of the Philosopher's Keyboard", "transed": 1, "url": "https://www.dampfkraft.com/philosophers-keyboard.html", "via": "", "real_tags": ["键盘", "哲学家", "输入"]}, {"category": "", "categoryclass": "", "imagename": "ec02f4417c9c3391bcc59dc2c47bcc21.jpg", "infoid": 1033362, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "科学家们首次设想了一类新的分子门，可以维持脑细胞内的pH平衡，这是一种关键功能，可以保持细胞存活，并有助于预防中风和其他脑损伤。这些门被称为质子激活的氯离子通道(PAC)，它们嵌套在细胞膜内，调节被称为氯离子的小分子进出细胞的通道。这使得细胞能够感知并对环境做出反应。\n范安德尔研究所(Van Andel Institute)助理教授、这项研究的共同通讯作者魏吕德博士(音译)说，质子激活是最近才被描述的，但它们对大脑至关重要，尤其是在大脑中。这项研究今天发表在了《自然》(Nature)杂志上。我们的新图像，加上我们对这些通道如何工作的发现，提供了亟需的分子蓝图，这将有助于回答该领域长期存在的问题，并为这些通道如何在治疗上针对疾病提供新的见解。\n这些图片显示了一个婚礼花束状的结构，部分部件会随着环境pH值的变化而改变结构。当pH从碱性转变为酸性时，一个关键的pH传感器从静止位置移动，插入酸性口袋中，该口袋发出允许离子进出细胞的门应该打开的信号。这种特殊的机制以前从未被描述过。\n这项研究是范安德尔研究所LüLab与约翰·霍普金斯大学医学院助理教授、该论文的共同通讯作者邱兆柱博士领导的一个研究小组的合作。约翰霍普金斯大学的研究小组去年在《科学》杂志上首次报道了PAC的发现。\n解决PAC结构是另一个重要的早期步骤，有助于理解有朝一日可能会影响人类健康的问题。更多信息：郑阮等，质子激活氯离子通道的结构和pH敏感机制，《自然》(2020)。电话：10.1038/s41586-0202875-7", "note_en": "For the first time, scientists have visualized a new class of molecular gates that maintain pH balance within brain cells, a critical function that keeps cells alive and helps prevent stroke and other brain injuries.    These gates, called proton-activated chloride channels (PAC), nest within cell membranes and regulate the passage of small molecules called chloride ions into and out of cells. This allows cells to sense and respond to their environment.\n  &#34;Proton-activated   have only recently been described but they are critical for  , particularly in the brain,&#34; said Wei Lü, Ph.D., a Van Andel Institute assistant professor and co-corresponding author of the study, which was published today in  Nature. &#34;Our new images, coupled with our findings into how these channels work, provide much-needed molecular blueprints that will help answer long-standing questions in the field and provide new insights into how these channels may be therapeutically targeted in disease.&#34;\n  The images reveal a wedding bouquet-like structure, with parts that change configuration in response to environmental pH. When pH shifts from alkaline to acidic, a key pH sensor moves from its &#34;resting&#34; location and is inserted in an &#34;acidic pocket,&#34; which signals that the gate allowing ions in and out of the cell should be open. This specific mechanism has never before been described.\n   This study is a collaboration between the Lü Lab at Van Andel Institute and a group led by Zhaozhu Qiu, Ph.D., an assistant professor at Johns Hopkins University School of Medicine and co-corresponding author of the paper. The Johns Hopkins team first reported the discovery of PAC in  Science last year.\n  Solving PAC structures are another important, early step toward an understanding that may one day impact human health.        More information:\t\t\t\t\t\t\t\t\t\t\t\tZheng Ruan et al, Structures and pH-sensing mechanism of the proton-activated chloride channel,  Nature (2020).  DOI: 10.1038/s41586-020-2875-7", "posttime": "2020-11-06 04:22:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "图谱,maps,通道", "title": "近原子“图谱”揭示了维持细胞内pH平衡的结构", "title_en": "Near-atomic 'maps' reveal structure for maintaining pH balance in cells", "transed": 1, "url": "https://phys.org/news/2020-11-near-atomic-reveal-ph-cells.html", "via": "", "real_tags": ["图谱", "maps", "通道"]}, {"category": "", "categoryclass": "", "imagename": "b3e81f0b661430d9d2f37047151d7e74.jpg", "infoid": 1033361, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我重新设计了这个网站，让人回想起90年代的网络。想想地理城市、美国在线、滚动字幕和动画GIF吧。90年代的网络是一个很酷的地方，现在我在这个网站上带回了一些。\n我和妻子最近看了《停止与着火》，这是一部四季的电视剧，讲述了一群技术专家一头扎进90年代的网络和.com热潮的故事。这是一个很棒的系列，我强烈推荐它。\n无论如何，看了这部连续剧(第二次)让我的小心向往上世纪90年代末和21世纪初互联网的美好时光💔。那是光辉的日子，展示了各种各样非常酷、有趣、充满奇思妙想的个人网站。\n我决定带着一些怀旧之情上船。我自己的网站，就是你现在所在的这个网站，看起来非常干净。它有漂亮的排版，非常内容集中，但很朴素。\n我喜欢上一个主题，但它没有个性。更重要的是，它没有刻画我的角色。我认为所有好的个人网站都应该这样做。\n这次重新设计肯定是对GeoCity时代的一种认可，当时网站管理员在他们的网站上做各种很酷的事情。但我不希望它只是几页像素化的GIF(顺便说一句，发音为giff，不是jiff👺)和8位像素图片。不是的。它必须反映我的个性，让游客感兴趣，重量轻，易于阅读。\n我把这个新主题称为怪异的19，现在你可以在GitHub上下载和使用它。以下是我和《19Quirky》一起做过的一些事情：\n是的，没有更多的评论。我过去一直在与删除评论作斗争，但最终我决定把它们带回来。这是个错误。它们令人头疼，而且很难管理。\n另外，据我所知，大多数90年代的网站都没有评论区。不，取而代之的是他们有一本留言簿。因此，在真正的90年代，我还在这个网站上实现了一个留言簿。请随时过来签个名。\n虽然我之前的主题很酷，但它没有个性。这几乎是一张白纸，上面有几个字。那是…。无聊。很不错，但还是很无聊。\n我希望我的90年代风格的网站能包含更多我的个性。所以从现在开始，我会试着用一种更非正式的方式来写，包括一些笑话等等。类似于我在一个垃圾爸爸的💩上写东西的方式。\n我真的希望你喜欢这个新版本的我的网站。我在这方面下了很大功夫，我对结果真的很满意。哦，糟了，我差点忘了…。我早些时候说过，它需要光线。下面是它有多轻：\n页面大小为300kb(包括新的背景图像)，加载时间为0.7秒，我对它的轻量级非常满意。\n你认为如何？新的设计有什么好的，还是你讨厌它？请与我联系，告诉我你的想法，或者在我的留言簿上留下一个条目。", "note_en": "I’ve re-designed this site in a way that nods back to the 90s web. Think Geocities, AOL, scrolling marquees and animated GIFs. The 90s web was a cool place to be, and now I’ve brought some of it back with this website.\n My wife and I recently watched  Halt and Catch Fire, which is a 4 season show following a group of technologists as they go headlong into the 90s web and the .com boom. It’s a great series, I’d highly recommend it.\n Anyway, watching that series (for the second time) made my little heart yearn for the good old days of the Internet during the late 1990s and early 2000s 💔. They were glorious days that showcased all sorts of really cool and interesting personal sites that were full of whimsy.\n  I decided that I wanted to get onboard with some of this nostalgia. My own site, this very one that you’re on now, had a very clean and spars look to it. It had  beautiful typography and was very content focussed, but it was plain.\n I loved it the previous theme, but it had no character. More importantly, it didn’t portray  my character. Which I think all good personal websites should.\n   The redesign had to be a nod back to those Geocities days where webmasters did all kinds of cool things with their sites. But I didn’t want it be just pages of pixelated GIFs (pronounced giff, by the way, not jiff 👺) and 8bit pixel art. No. It had to reflect my personality, be interesting to visitors, lightweight and easy to read.\n  I’ve called this new theme  Nineteen Quirky and  it’s available on GitHub right now for you to download and play with. Here’s a list of  some of the things I’ve done with Nineteen Quirky:\n   That’s right, no more comments. I’ve battled with removing comments in the past, but decided to bring them back in the end. This was a mistake. They’re a headache and are difficult to manage.\n Plus, most 90s websites that I knew of didn’t have a comments section. No, instead they had a guestbook. So in true 90s fashion, I’ve also implemented a  guestbook on this site. Please feel free to pop on over there to sign it.\n  Although my previous theme was cool, it had no character. It was pretty much a blank slate with some words on it. It was… boring. Very nice, but boring nonetheless.\n I wanted my 90s web styled site to include more of my personality. So from now on I’m going to try and write in a more informal way that includes some jokes etc. Similar to the way I write over on  One Crap Dad 💩.\n  I really hope you like this new version of my website. I’ve worked hard on it and I’m  really happy with the results. Oh crap, I almost forgot…I said earlier it needed to be light. Here’s how light it is:\n  With a page size of  300kb that includes the new background images, and a load time of 0.7 seconds, I’m pretty happy with how light it is.\n What do you think? Is the new design any good, or do you hate it?  Get in touch to tell me your thoughts, or leave an entry in  my guestbook.", "posttime": "2020-11-06 04:22:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "网络,nod,网站", "title": "向90年代的网络致敬", "title_en": "A Nod to the 90s Web", "transed": 1, "url": "https://kevq.uk/a-nod-to-the-90s-web/", "via": "", "real_tags": ["网络", "nod", "网站"]}, {"category": "", "categoryclass": "", "imagename": "0ccb495e10c760f535079df9cbc870a0.jpg", "infoid": 1033359, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据英国广播公司报道，英伟达将堡垒之夜带回iPhone和iPad。\n这一进展意味着，堡垒之夜游戏玩家可以在英伟达运营的服务器上玩《Epic Games》了。目前还不清楚的是，云游戏服务是否会给玩家带来很大的滞后时间，从而影响他们的游戏。\n总部位于北卡罗来纳州的Epic Games绕过了苹果公司关于游戏内支付的规定，此后苹果用户一直无法下载这款热门游戏的新版。\n收入和规则是Etic和苹果之间冲突的核心。EPIC开发了一个游戏内市场，交易不受苹果对通过其平台进行的交易收取30%的费用的限制。\n这一策略明显违反了苹果的服务条款，但Etic辩称，这些规则本身是不公平的，也是苹果垄断其平台上的应用程序分发的一个例子。\n这场正在进行的法律纠纷甚至要到5月份才能进入法庭，诉讼可能需要数年时间才能解决。\n据英国广播公司报道，这将给近1.16亿名iOS堡垒之夜玩家带来很多麻烦，特别是对7300万只使用苹果产品访问游戏的玩家来说。\n与安卓不同的是，苹果不允许通过自己的应用商店以外的应用商店将游戏或其他应用加载到其手机或平板电脑上。\n据BBC报道，NVIDIA已经为Mac、Windows、Android和Chromebook电脑提供了GeForce游戏服务，但新版本也将在苹果移动设备上使用。\n如果继续推进，NVIDIA的云游戏服务将是市场上唯一支持iOS用户的服务。无论是亚马逊的露娜云游戏平台，还是谷歌的体育场服务，都没有堡垒之夜的身影。", "note_en": "Nvidia  is bringing  Fortnite  back to iPhones and iPads,  according to a report from the BBC .\n The development means that Fortnite gamers can play the  Epic Games   title off of servers run by Nvidia. What’s not clear is whether the cloud gaming service will mean significant lag times for players that could effect their gameplay.\n Apple   customers have been unable to download new versions of Epic Games’ marquee title after the North Carolina-based company circumvented Apple’s rules around in-game payments.\n  Revenues and rules are at the center of the conflict between Epic and Apple. Epic had developed an in-game marketplace where transactions were not subject to the 30% charges that Apple places on transactions conducted through its platform.\n The maneuver was a clear violation of Apple’s terms of service, but  Epic is arguing that the rules themselves are unfair and an example of Apple’s monopolistic hold over distribution of applications on its platform.\n   The ongoing legal dispute won’t even see the inside of a courtroom until May and it could be years before the lawsuit is resolved.\n That’s going to create a lot of hassles for the nearly 116 million iOS Fortnite players, especially for the 73 million players that only use Apple products to access the game, according to the BBC report.\n Unlike  Android,   Apple does not allow games or other apps to be loaded on to its phones or tablets via app stores other than its own.\n Nvidia already offers its GeForce gaming service for Mac, Windows, Android and Chromebook computers, but the new version will be available on Apple mobile devices as well, according to the BBC report.\n If it moves ahead, Nvidia’s cloud gaming service would be the only one on the market to support iOS users. Neither Amazon’s Luna cloud-gaming platform, nor Google’s Stadia service carry Fortnite.", "posttime": "2020-11-05 22:58:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,nvidia,ios,reportedly,苹果", "title": "\n据报道，英伟达通过其云游戏服务将堡垒之夜带回iOS", "title_en": "\n\t\t\t\tNvidia reportedly bringing Fortnite back to iOS through its cloud gaming service\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/05/nvidia-reportedly-bringing-fortnite-back-to-ios-through-its-cloud-gaming-service/", "via": "", "real_tags": ["游戏", "nvidia", "ios", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "c9cbed41bd8b688151c66974bb7f137c.jpg", "infoid": 1033358, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年夏天早些时候，一批高端创作者为TikTok制作了视频，并推出了专门的“在TikTok上学习”标签(#LearnOnTikTok)。之后，许多用户和社交媒体观察者(感谢马特)报告看到了一个名为“学习”的新菜单项。\nTikTok在主屏幕顶部与“For You”和“Follow”并列显示，它将“学习”描述为一个地方，可以在那里了解用户发布的如何操作和提供信息的视频，这些视频将带观众了解烹饪、创作艺术、科学过程是如何运作的，等等。\n学习提要似乎一夜之间就消失了：据我们所知，它仍在测试中。\n图片字幕：莉娜·科波娃(Lena Koppova)(打开一个新窗口)(打开一个新窗口)无论如何，它的出现恰逢该公司昨天推出了一项新的宣传活动，通过#LearnOnTikTok标签可以找到教育内容。\n(在关于TikTok内容学习的最初声明中，TikTok指出，它正在探索其他方式，以展示在该平台上蓬勃发展的丰富教学内容，其中包括“建立一个创作者学习门户，提供关于如何在TikTok上创建高质量内容的见解、工具和最佳实践”，所以“学习”标签可能是对这些内容外观和工作方式的一次测试。)。\n这些并不是TikTok在教育领域的第一次或唯一的努力。\n除了由观众自行制作的教育视频--它是学习TikTok舞蹈、了解最新歌曲表情包、观看人们试图解释某事时的喜剧灾难等的最佳平台--该公司一直在打造一个学习更严肃事物的首选平台，而不仅仅是闲逛。\n今年，TikTok比以往任何时候都更努力地推动这一进程，一方面是因为TikTok本身因潜在的有害影响而面临当局的愤怒，另一方面是因为在新冠肺炎疫情期间，越来越多的人转向屏幕。\n这包括正式的努力，比如与机构合作，鼓励学生创作教育内容。", "note_en": "After launching a dedicated “Learn On TikTok” hashtag (#LearnOnTikTok) earlier this summer with a slate of premium creators producing videos for it,  multiple  users and social media watchers (thanks  Matt) are  reporting sightings of a  new menu item called “Learn.”\n Featured prominently alongside “For You” and “Following” at the top of the homescreen, TikTok describes Learn as a place to discover how-to and informative videos posted by users that take viewers through making food, producing art, how scientific processes work, and more.\n  The Learn feed seems to have disappeared overnight: from what we understand it’s still being tested.\n Image Credits:  Lena Koppova  (opens in a new window)  (opens in a new window)In any case, its emergence  coincided with the company yesterday launching a new promotional campaign for educational content discoverable through the #LearnOnTikTok hashtag.\n (And in the  original announcement for Learn On TikTok content, TikTok noted that it is “exploring additional ways to showcase the rich offering of instructional content that’s thriving on the platform,” which includes “building a creator learning portal that will provide insights, tools, and best practices on how to create quality content on TikTok,” so the Learn tab may have been a test of how that will look and work.)\n These are not TikTok’s first or only efforts in the realm of education.\n Aside from its self-referential audience-created educational videos — it’s the best platform for learning TikTok dances, for learning about the latest song-based memes, watching comedic mishaps as people try to explain something, etc. — the company has been cultivating an image as a go-to platform for learning more serious things, not just messing around.\n It’s been pushing that even harder this year than ever, both as TikTok itself faces ire from authorities for having a more potentially harmful influence; and as more people turn to their screens during the Covid-19 pandemic.\n This has included formal efforts like  partnering up with institutions, and  encouraging students to create educational content.", "posttime": "2020-11-05 22:58:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "测试,tests,学习", "title": "\nTikTok测试学习选项卡以展示教育和使用方法视频", "title_en": "\n\t\t\t\tTikTok tests a Learn tab to showcase education and how-to videos\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/05/tiktok-tests-a-learn-tab-to-showcase-education-and-how-to-videos/", "via": "", "real_tags": ["测试", "tests", "学习"]}, {"category": "", "categoryclass": "", "imagename": "54f0571f3dacfcc6ca7b973ecc3e7c0b.jpeg", "infoid": 1033357, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "毫无疑问，Xbox Series S是下一代最可爱的游戏机。它也是威力最小的。S系列可以达到1080p以上的分辨率，但它不支持4K游戏，存储空间也比Xbox Series X或PlayStation 5小得多。当然，它也没有光驱。\n这就是说，S系列是一个强大的下一代游戏机，恰好被包装在一个可爱的包装里。\nXbox Series S无疑是下一代最可爱的游戏机，但它的小尺寸是有代价的。它不能玩4K的游戏，没有光驱，只有362 GB的可用存储空间，除非你买一张昂贵的扩展卡。快速恢复、更快的加载速度和更高的帧速率使其成为一款可靠的下一代游戏机，但持久力略低于X系列。\n让我们从深入研究这些可爱的内脏开始吧。S系列配备4万亿次浮点GPU、10 GB内存和512 GB内置固态硬盘。但实际上，这款游戏机的开箱即用空间为362 GB，不同之处在于预装软件和后台功能。S系列能够达到1440p的分辨率，并支持高达120fps的可变刷新率，但不要指望很多游戏能同时做到这两点。对于大多数游戏来说，1080p和60fps是最佳选择。\n这款游戏机的大小和鞋盒差不多：长10.8英寸，宽约6英寸，深2.5英寸，重约4.25磅。它是水平放置的，上面有一个大的黑色圆圈覆盖着风扇，在它的小侧板上有两个额外的通风口。值得注意的是，这款风扇本身非常安静，尤其是与PlayStation4相比，PlayStation4是我这一代的主要游戏机。\n在S系列的短边有四个小垫子，表面上是用来垂直存放的，但这种安排感觉不是个好主意。这不仅会使底座变得很薄，而且实际上会在控制台底部放置一个通风口，在那里肯定会产生额外的热量。\nS系列与Xbox自适应控制器有着相同的设计DNA，这并不令人意外。微软推出自适应控制器的目标是为残障人士打造一款时尚、实用的手柄，与传统的游戏硬件无缝融合。从设计上讲，S系列本质上是一款被切成两半的自适应控制器，这意味着它们在任何人的起居室里都会看起来很自然。\n说到控制器：S系列附带的游戏板是我们熟悉和喜爱的无线Xbox控制器的略微调整版本。它使用两节AA电池，充电时间和现有的Xbox游戏板一样长，如果我经常使用，续航时间可达三天左右。微软在游戏手柄的中央增加了一个很小的分享按钮，D键盘是一个完整的圆圈，类似于Elite。否则，它是完全哑光的，在扳机和保险杠的把手和底座上有轻微的纹理。新的Xbox控制器坚固轻便，如果要说有什么不同的话，那就是与目前的型号相比，隆隆声的功率提高了半个档次。\n在S系列的背面，有用于以太网、HDMI 2.1、一块希捷扩展卡、电源线的端口，以及两个用于USB 3.1连接的端口。在控制台的前面，蓝牙配对按钮旁边还有一个额外的USB 3.1端口。游戏机背面的每个端口都放置在一组独特的盲文凸起上方，仅靠触摸就可以更容易地区分它们。这真是太方便了。\n考虑到控制台内置的空间相对较小，存储扩展对S系列至关重要。微软与希捷(Seagate)合作发布了一款定制的1TB扩展卡，该卡反映了其下一代架构，允许玩家直接从该卡启动游戏，同时仍可利用其新功能，包括快速恢复、更快的加载时间和对旧游戏的性能增强。这款扩展卡也适用于X系列，该系列配有802 GB的可用空间。\nS系列还支持通过USB 3.1的外部硬盘存储，但只支持向后兼容的游戏，从这些来源玩的游戏没有针对新游戏机进行优化。基本上，如果你有一个装有Xbox One游戏的硬盘，它们看起来也会像S系列上的Xbox One游戏，除非你把它们安装到机顶盒的内置固态硬盘上。\n希捷扩展卡售价220美元，仅比S系列本身便宜80美元。但是，它的效果和宣传的一样。从希捷扩展卡玩游戏和从内存玩游戏没有明显区别。\n在我不得不打开希捷之前，我在S系列上玩了13个游戏和23个应用程序。这令人印象深刻，但这也只是一个快照。S系列在发布时有362 GB的可用空间，游戏可以运行在12到100 GB的任何地方。例如，像《使命召唤：战区》这样的游戏，其内存超过100 GB，仅这一块就消耗了近三分之一的存储空间。值得庆幸的是，像Netflix和YouTube这样的流媒体应用通常各自占用的空间不到100MB。\n开机过程鼓励玩家下载Xbox移动应用程序，这使得从你的手机登录和设置控制台变得很容易。尽管这款游戏机不支持4K格式的游戏，但它可以播放4K格式的视频，因此设置包括4K和HDR校准提示。\n当我测试X系列时，它自动要求我将游戏机连接到我家的谷歌助手或亚马逊Alexa网络，但在我使用S系列的过程中，这个屏幕没有出现。不管怎样，在设置中有一个选项可以将游戏机连接到语音助理网络，这是我做的第一件事。我再怎么强调也不为过：我喜欢对着我的电器大喊大叫。\n这是无可奈何的，有些游戏在S系列上看起来比X系列--或者PlayStation5--更糟糕。S系列不支持4K模式，在《黑帮：像龙一样》(Like A Dragon)这样的游戏中有明显的不同，它可以达到1440p和30fps，或者900p和60fps。即使在菜单屏幕上，Ori中的灯光效果和WING的意志在S系列上也显得不那么精致。\n在像《控制》这样的向后兼容游戏中，这种差异更加明显。由于游戏机的内存很小，S系列游戏是从Xbox One S版本升级而来的，而不是功能更强大的One X Control(向后兼容版本，而不是优化的旗舰版)，以及许多其他在One S上运行的不到1080p的多平台游戏，除非它们采用动态分辨率，否则它们在Series S上看起来是一样的。\n这绝不是一种破坏游戏或破坏游戏机的观察，但4K游戏正在成为常态，微软的下一代设备之一就是无法做到这一点。\nS系列赛在技术上支持高达120fps的游戏，这一因素在竞技比赛中比分辨率重要得多。但同样，这并不适用于大多数游戏。以当代最著名的两款游戏《堡垒之夜》和《命运2》为例：这两款游戏的目标都是1080p和60fps。S系列的Forza Horizon 4在标准的Xbox One上最高可以达到30fps，而S系列则是60fps。Gears 5是为数不多的将机顶盒的帧速率提升到最高帧速率的游戏之一，提供120fps的多人体验。\n即使没有4K，S系列也支持令人难以置信的流畅游戏。提升当前和上一代游戏的帧速率是这款小小的游戏机内置技术的最清晰展示之一，相比之下，它们看起来和玩起来都像黄油。\nS系列采用了X系列的所有HDMI 2.1技巧，自动将HDR、可变刷新率和游戏模式设置传输到支持的电视机上。它还具有快速恢复和更快的向后兼容游戏的加载时间，这两个功能让新的Xbox唱起了歌。\n快速恢复允许玩家循环浏览几个游戏，而不必关闭它们，实质上是让它们在系统后台暂停。这些游戏甚至可以在重启后通过Quick Resume获得，这意味着你可以关闭S系列，睡觉，醒来，打开游戏机，从你离开的地方拿起你的游戏，而不会浪费时间在加载屏幕上。快速恢复和更快的加载时间是让S系列感觉像下一代游戏机的两个因素，尽管它缺乏4K和中等存储空间。\n根据我的经验，大多数向后兼容的游戏在关卡和快速旅行点之间只需要10秒或更短的时间，尽管普遍的看法是：世界越大，加载时间就越长。像《无人的天空》和《命运2》这样的游戏仍然需要近一分钟的时间来启动一个新的区域。Gears 5的初始加载屏幕也相对较长，大约需要35秒。\n附注：在Gears 5战役的早期阶段真的很难死掉，即使是在中等难度的情况下也是如此。为了进一步测试游戏的加载时间，我试图通过三波敌人策划DJ的灭亡，遇到危险而没有还击。他摔倒在地近12次，屏幕上血迹斑斑，但每次都有队友在临死前将他救活，无论我安排他的队友领先球队多远。然而，在第三次浪潮结束时，我终于找到了一个可以让DJ安详死去的角落。之后，加载屏幕弹出了一秒钟，然后我又回到了游戏中。至少，这一部分令人印象深刻。\n在使用S系列大约一周的时间里，我遇到了一个需要硬重启的问题。我正在做晚餐，在游戏机的HBO Max应用程序上看誓词--顺便说一句，这是个垃圾--突然场景冻结，我的音棒开始嗡嗡作响，重复着音频曲目中的一个音节。游戏手柄在这一点上没有用，所以我按住了游戏机前面的Xbox按钮，它就关闭了。一切都重新启动得很好，我没有遇到过任何类似的问题。然而，HBO Max应用程序仍然很悲惨。\n我不确定在这种情况下发生了什么--S系列被硬连接到我的网络上，而我没有在后台下载任何东西。值得注意的是，我的内置固态硬盘已满96%以上。\n作为一款全数字、全天候的游戏机，S系列是微软为游戏通行证终极版用户打造的游戏，它的设计初衷是为了在这个数字生态系统中产生订阅。游戏通行证终极版解锁了一个包含150多款游戏的虚拟图书馆，外加Xbox Live功能和访问微软的游戏流媒体技术XCloud(由微软利润惊人的云网络Azure提供支持)。所有这些服务每月只需15美元，与Netflix订阅的价格相同。目前有超过1500万的Game Pass会员，这些订阅已经在几个季度里提升了微软的利润。新一代代表着让Game Pass成为Xbox业务中一个更大、更可持续的方面的机会，而S系列和Xbox应用程序都提供了大量的注册机会。\n由于存储容量有限，S系列也是一个出售220美元扩展卡的机会，将游戏机的真实价格提高到520美元。这比X系列的价格高出20美元，而且这还不包括4K游戏。\n这是新一代游戏机的核心问题：你是会先买全数字版，省下一些钱，还是会多花几百美元购买存储空间和电量更大的全功能游戏机？如果你渴望获得一款拥有更流畅的帧速率、快速加载屏幕和快速恢复功能的游戏机，S系列可以满足你的需求。然而，如果你想要一台寿命更长的游戏机，X系列在技术保真度、包括磁盘驱动器和存储容量方面都是更好的选择。\n存储空间可能在某一时刻成为所有S系列用户的问题，下一代游戏将需要更多的电力，而不是更少。如果你可能不得不花钱购买S系列的Seagate扩展卡，那么让大男孩拥有所有的内置存储空间就更有意义了。\n当然，如果你真正关心的是可爱的因素，那么S系列是唯一的选择。", "note_en": "The  Xbox Series S is, hands-down, the cutest console of the next generation. It’s also the least powerful. The Series S can hit resolutions above 1080p, but it doesn’t support 4K gaming and it has significantly less storage than the Xbox Series X or  PlayStation 5. And, of course, it doesn’t have a disc drive.\n That said, the Series S is a formidable next-gen console that happens to be wrapped up in an adorable package.\n  The Xbox Series S is undoubtedly the most adorable console of the next generation, but its tiny size comes at a cost. It can’t play games in 4K, doesn’t have a disc drive and has just 362GB of usable storage, unless you buy a pricey expansion card. Quick resume, faster loading times and improved framerates make this a solid next-gen console, but with slightly less staying power than the Series X.\n  Let’s start with a deep dive into those cute guts. The Series S has a 4 teraflop GPU, 10GB of RAM, and a 512GB internal SSD. In practice though, the console has 362GB of free space out of the box, with the difference lost to pre-loaded software and background functions. The Series S is capable of hitting resolutions of 1440p and supports variable refresh rates up to 120 fps, though don’t expect many games to do both at the same time. For most titles, the sweet spot is going to be 1080p and 60 fps.\n The console is roughly the size of a shoebox: 10.8 inches long, about six inches wide, and 2.5 inches deep, weighing about 4.25 pounds. It’s meant to lay horizontally, with a large black circle covering the fan on top and two additional vents on its small side panels. Notably, the fan itself is whisper-quiet, especially when compared to the PlayStation 4, my main console this generation.\n  There are four tiny pads on one of the short sides of the Series S, ostensibly for vertical storage, but this arrangement feels like a bad idea. Not only does it make the base precariously thin, but this actually places one of the vents on the bottom of the console, where it’s sure to generate extra heat.\n The Series S shares design DNA with the  Xbox Adaptive Controller, and that’s really no surprise. Microsoft’s goal with the Adaptive Controller was to build a stylish, functional gamepad for people with disabilities, one that seamlessly blends in with traditional gaming hardware. Design-wise, the Series S is essentially an Adaptive Controller cut in half, meaning they’ll look natural together in anyone’s living room.\n  Speaking of controllers: The gamepad that ships with the Series S is a slightly tweaked version of the wireless Xbox controllers we know and love. It runs on two AA batteries and holds a charge as long as existing Xbox gamepads, lasting three-ish days with regular use for me. Microsoft added a small share button to the center of the gamepad, and the D-pad is a complete circle, similar to the Elite. Otherwise, it’s fully matte, with light texturing on the grips and the bases of the triggers and bumpers. The new Xbox controller is sturdy and light, and if anything, the rumble power has been turned up a half notch compared with current models.\n On the rear of the Series S, there are ports for ethernet, HDMI 2.1, a Seagate expansion card, the power cable, and two for USB 3.1 connections. There’s an additional USB 3.1 port on the front of the console, beside the Bluetooth pairing button. Each port on the back of the console is placed above a unique set of Braille-like bumps, making it easier to tell them apart by touch alone. It’s incredibly convenient.\n  Storage expansion is critical to the Series S, considering the relatively low amount of space built into the console. Microsoft partnered with Seagate to release a custom, 1TB expansion card that mirrors its next-gen architecture, allowing players to boot up games directly from the card and still take advantage of its fresh features, including Quick Resume, faster load times and performance enhancements on old games. The expansion card also works with the Series X, which ships with  802GB of free space.\n The Series S also supports external HDD storage via USB 3.1, but only for backward compatible titles, and games played from these sources aren’t optimized for the new console. Basically, if you have an HDD filled with Xbox One games, they’re going to look like Xbox One games on the Series S, too, unless you install them to the box’s internal SSD.\n The Seagate expansion card costs $220, which is just $80 cheaper than the Series S itself. But, it works as advertised. There’s no discernable difference between playing a game from the Seagate expansion card or internal storage.\n  I was able to get 13 games and 23 apps on the Series S before I had to break out the Seagate. That’s impressive, but it’s also just a snapshot. The Series S has 362GB of free space at launch, and titles can run anywhere from a dozen to 100GB. A game like  Call of Duty: Warzone, for example, clocks in at over 100GB, which eats up close to a third of the box’s storage on its own. Thankfully, streaming apps like Netflix and YouTube usually take up less than 100MB each.\n The boot-up process encourages players to download the Xbox mobile app, which makes it easy to sign in and set up the console from your phone. Even though the console doesn’t support gaming in 4K, it can play video in 4K, so set-up includes both 4K and HDR calibration prompts.\n  When I tested out the Series X, it automatically asked me to link the console to my home’s Google Assistant or Amazon Alexa network, but this screen didn’t show up during my time with the Series S. Regardless, there’s an option to link the console to a voice assistant network in Settings, and that’s the first thing I did. I can’t stress this enough: I love yelling at my appliances.\n  There’s no way around it, some titles look worse on Series S than on Series X -- or PlayStation 5, for that matter. The Series S doesn’t play in 4K, and the difference is noticeable in games like  Yakuza: Like a Dragon, which hits 1440p and 30 fps, or 900p and 60 fps. The lighting effects in  Ori and the Will of the Wisps appear  less delicate on the Series S, even on the menu screen.\n  The disparity is even clearer in backward compatible games like  Control. Due to the console’s small amount of RAM, Series S games are upgraded from their Xbox One S versions, rather than the much more powerful One X.  Control (the backward compatible version, not the optimized  Ultimate Edition) and many other multiplatform games run at less than 1080p on the One S, and unless they employ dynamic resolutions, they’ll look the same on the Series S.\n By no means is this a game-breaking or console-ruining observation, but 4K gaming is becoming the norm, and one of Microsoft’s next-gen devices simply can’t cut it.\n  The Series S technically supports games at up to 120 fps, a factor that’s much more important than resolution in competitive play. But again, this isn’t going to apply to most games. Take  Fortnite and  Destiny 2, two of the most prominent games of the current generation, for example: They’re both targeting 1080p and 60 fps on the Series S.  Forza Horizon 4, which maxes out at 30 fps on the standard Xbox One, is available at 60 fps on Series S.  Gears 5 is one of the few games to push the box to its max framerate, offering multiplayer at 120 fps.\n Even without 4K, the Series S supports incredibly smooth gameplay. Boosting the framerates of current- and past-generation titles is one of the clearest demonstrations of the technology packed inside this tiny console, and comparatively, they look and play like butter.\n The Series S employs all the HDMI 2.1 tricks that the Series X does, automatically piping HDR, variable refresh rate and game-mode settings to supported televisions. It also has Quick Resume and faster load times for backward compatible titles, two features that make the new Xboxes sing.\n  Quick Resume allows players to cycle through a handful of games without having to close them down, essentially leaving them on pause in the system’s background. These games are even available via Quick Resume after a restart, meaning you can shut down the Series S, go to bed, wake up, turn the console on, and pick up your games from exactly where you left them, with no time wasted on loading screens. Quick Resume and faster load times are two factors that make the Series S feel like a next-gen console, despite its lack of 4K and middling storage space.\n In my experience, most backward compatible games take 10 seconds or less between levels and fast-travel points, though conventional wisdom applies: The larger the world, the longer the load time. Titles like  No Man’s Sky and  Destiny 2 can still take nearly a minute to boot up a new area. The initial loading screen for  Gears 5 is relatively long, too, taking about 35 seconds.\n  Side note: It’s really hard to die in the early stages of the  Gears 5 campaign, even on Intermediate difficulty. In an effort to further test the game’s load times, I tried to orchestrate DJ’s demise through three waves of enemies, running into danger without fighting back. He fell to the ground nearly a dozen times, screen bloodied, but a teammate would revive him just before death each time, no matter how far ahead of the squad I positioned him. By the end of the third wave, though, I finally found a corner where DJ could die in peace. The loading screen popped up for just a second afterward, and then I was back in the game. That part, at least, was impressive.\n In about a week with the Series S, I’ve run into one issue that required a hard restart. I was making dinner and watching  The Vow on the console’s HBO Max app -- which is trash, by the way -- when the scene suddenly froze and my sound bar began droning, repeating a single syllable from the audio track. The gamepad was useless at this point, so I held the Xbox button on the front of the console and it shut down. Everything restarted just fine, and I haven’t had any similar issues. The HBO Max app, however, remains tragic.\n  I’m not sure what happened in this instance -- the Series S was hardwired to my network and I wasn’t downloading anything in the background. It may be worth noting that my internal SSD was over 96 percent full.\n As an all-digital, all-the-time console, the Series S is Microsoft’s play for the  Game Pass Ultimate crowd, and it’s built to generate subscriptions in this digital ecosystem. Game Pass Ultimate unlocks a virtual library of more than 150 games, plus Xbox Live capabilities and access to xCloud, Microsoft’s game-streaming technology (which is powered by Azure, Microsoft’s  incredibly profitable cloud network). All of this for just $15 a month, the same price as a Netflix subscription. There are more than 15 million Game Pass members in the wild today, and these subscriptions have been boosting Microsoft’s bottom line for a few quarters now. The new generation represents a chance to make Game Pass an even larger and more sustainable aspect of the Xbox business, and both the Series S and the Xbox app offer plenty of opportunities to sign up.\n With its storage capacity limits, the Series S is also a chance to sell that $220 expansion card, raising the true price of the console to $520. That’s $20 more than the price of a Series X, and it doesn’t include 4K gameplay.\n  This is the question at the heart of the new console generation: Do you buy the all-digital edition and save some cash up front, or drop a few extra hundred on a full-fat console with more storage space and power? If you’re eager to get your hands on a console with smoother framerates, rapid loading screens and Quick Resume, the Series S gets the job done. However, if you want a console with longevity, the Series X is a better choice in terms of technical fidelity, the inclusion of the disc drive and storage capacity.\n Storage space is likely to become an issue for all Series S owners at some point, and games in the next gen are going to demand more power, not less. If it seems likely that you’ll have to splurge for that Seagate expansion card on the Series S, it just makes more sense to get the big boy with all that storage built-in.\n Of course, if what you really care about is the cute factor, then the Series S is the only option.", "posttime": "2020-11-05 22:56:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "设计,性能,游戏,limited", "title": "Xbox Series S评测：紧凑的设计，良好的性能，巨大的向后兼容库，但游戏质量较低，没有4K游戏，存储空间有限", "title_en": "Xbox Series S review: compact design, good performance, and huge backward compatible library but of lower-quality games, no 4K gameplay, and limited storage", "transed": 1, "url": "https://www.engadget.com/xbox-series-s-review-140027758.html", "via": "", "real_tags": ["设计", "性能", "游戏", "limited"]}, {"category": "", "categoryclass": "", "imagename": "8ddc0cd83383b3302ae04b7d05be2807.jpg", "infoid": 1033356, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳到主要内容：@tomwarren摄影：VJeran Pavic|视频由Becca Farsace、Phil Esposito和VJeran Pavic|声音由Andrew Marino提供|图形由格雷森·布莱克蒙提供。\n如果你从Verge链接上购买东西，Vox Media可能会赚取佣金。请参阅我们的道德声明。\n微软新的Xbox Series X游戏机旨在开启游戏新纪元。每当游戏机硬件出现重大飞跃时，我们都亲切地称其为“下一代”，承诺推出新游戏和我们从未见过的东西。Xbox Series X无疑会及时交付这些，但目前，大型发布游戏、华丽的新图形和下一代游戏仍在路上。\n与此同时，微软以控制台的形式打造了一种令人兴奋的PC升级体验。Xbox Series X是我见过的最接近于重新创造卓越的PC游戏体验的机型，这要归功于SSD存储，更强大的CPU，120赫兹的支持，以及令人印象深刻的向后兼容功能，这些功能改善了现有的游戏。这一切都在一个499美元的盒子里，比我几周前开发的3000美元的游戏电脑安静得多，使用和维护也容易得多。\nXbox Series X看起来像一台PC是有原因的--因为它给人的感觉往往就像一台PC。\n微软将Xbox Series X的所有组件都压缩到了一个四四方方、长方形、塔形的外壳里。它看起来像一台紧凑的PC，但设计朴实无华，垂直站立比水平站立看起来要好得多(就像大多数PC一样)。Xbox Series X的底座是不可拆卸的，而且(与PS5不同)游戏机的设计也不是为了打开。当Xbox Series X水平放置时，可以公平地说，它看起来就像是翻倒了，底座是永久固定的。我不喜欢这个设计，但我也不介意。这是一个黑匣子，只要你能把它放在电视下面，你就可以把它放在电视下面，然后忘掉它。\n后面有两个USB端口，旁边有一个以太网端口、一个存储扩展插槽和HDMI 2.1输出。机身正面有一个USB接口和4K蓝光驱动器。微软还在Xbox Series X的端口旁边增加了凸起的盲文凸起，这是一个很好的无障碍触摸。我希望有一天能在这里看到USB-C，甚至是Xbox One智能的HDMI直通系统，但这两个都不是什么重大遗漏。遗憾的是，Xbox Series X不支持Wi-Fi 6，而Wi-Fi 6对很多人来说是非常适合未来的。\n我没有注意到X系列的任何散热或噪音问题。微软将Xbox X系列的排气扇放在了顶部，两侧的塑料盖上了绿色涂层，让它看起来像是上面有一个LED。我从来没有听过这个粉丝，这很令人惊讶，因为我的Xbox One X在某些游戏中会变得非常响亮。然而，在我使用X系列的几周时间里，它一直保持沉默。从顶部散发的热量与我在Xbox one X上感受到的非常相似，而且它从来没有太热过，摸不着。\n在短短几周的使用中很难判断灰尘堆积、噪音和风扇，但我没有任何直接的理由担心。我大部分时间都是在电视机架外使用X系列，因为那里的空气很容易流动，所以它没有被挤进电视机里。我认为大多数人都需要考虑这些下一代游戏机的定位和气流，就像你使用巨型游戏机一样。\nXbox Series X唯一新增的硬件是控制器和存储扩展卡。(下一节将详细介绍这些内容。)。更新的控制器与Xbox One版本非常相似，有更新的D-pad，有纹理的手柄，并增加了一个新的共享按钮和一个USB-C端口。分享按钮可以让你快速与朋友分享剪辑或截图，就像在PS4上一样，而如果你真的想利用USB-C，你需要单独购买一个可充电的播放和充电套件(24.99美元)-控制器默认使用AA电池。\n与我们在当前游戏机上习惯的加载时间相比，Xbox Series X上的加载时间要好得令人难以置信。Xbox Series X采用了极大改进的CPU，与固态硬盘配合使用，帮助游戏加载速度远远快于目前的Xbox One X。\n我注意到我在X系列上使用的每一款游戏的加载时间都有了改善。有些游戏在等待游戏或游戏中的关卡加载所节省的分钟数方面要快得多。还有一些游戏可以节省几秒钟，但它们加起来会花更多的时间来玩游戏，而不是等待它们加载。\n我已经习惯了PC SSD的快速加载速度，但X系列的加载速度仍然给我留下了深刻的印象。像“盗贼之海”和“命运2”这样的游戏，加载时间还不到Xbox One X的一半。即使是像GTA V这样的老游戏，加载速度也比以前快得多。\n虽然Xbox Series X配备了1TB的存储空间，但你只能使用802 GB的存储空间。这实际上略高于Xbox One X的780 GB可用空间，即使微软为Xbox One X预留了空间，而且新的Quick Resume功能可以让你在大约10秒或更短的时间内在游戏之间切换。\n微软还在Xbox Series X上使用专有的存储扩展槽，到目前为止，只有希捷被确认为游戏机后部价值219.99美元的1TB卡的合作伙伴。这些卡上的可用空间为920 GB，因为同样为快速恢复保留了空间。\n针对Xbox Series X进行了专门更新的游戏使用了微软新的Velocity架构，以使系统的固态硬盘发挥最大的性能，因此你不能在USB存储空间上运行它们。然而，绝大多数向后兼容的游戏都不使用Velocity Architecture，这意味着它们可以直接在USB驱动器上玩--除非它们在未来得到X系列的更新。\n这意味着，很多即时的加载时间改进都要归功于SSD和CPU本身，而不是微软新实现的API，这些API应该会在未来进一步缩短加载时间。这也意味着，如果你的一些老游戏没有升级到Velocity架构，那么你可以从USB存储中自由运行它们。如果你使用的是快速USB SSD存储驱动器，你会看到这样的加载时间有了很大的改善，有些甚至可能与你使用内置驱动器的时间非常接近。\n这些加载时间和CPU改进，加上GPU性能大幅提升至12万亿次浮点，所有这些都为现有游戏带来了更流畅的体验。这可能意味着在Fallout 4这样的游戏中，菜单和行星加载速度将从30fps跃升至60fps，或者《命运2》中的菜单和行星加载时间突然与PC持平。\n这些改进还意味着，大多数在Xbox One上表现不佳的游戏至少应该达到稳定的30fps。我在Xbox One X的游戏中看到的很多帧速率下降都在Xbox Series X上消失了，这要归功于Xbox Series X的硬件提升。我注意到《尖端传奇》、《魔兽争霸》和《命运2》在要求较高的点数上都下降得较少。\nXbox Series X的一些优化补丁将在11月10日发布时发布，我有机会测试了《盗贼之海》和《地平线4》。这两款游戏都因这些更新而发生了变化，从30fps提升到了60fps。因此，《盗贼之海》给人的感觉就像是一款新游戏，或者就像你在PC上玩游戏一样。这就是从30fps到60fps转变的戏剧性感觉。\n甚至对向后兼容性的支持也得到了令人印象深刻的提升。Xbox 360版本的侠盗猎车手IV现在在锁定在60fps的Xbox Series X上运行超级流畅，而Xbox One X往往难以保持60fps的性能。侠盗猎车手4还受益于微软Xbox Series X附带的自动HDR功能，该功能可以在大多数游戏上运行，让它们看起来更好看。\n除了优化补丁，我到目前为止在Xbox Series X上测试过的最令人兴奋的游戏是Dirt 5和Gears 5--这不是因为它们一定是游戏机的技术展示，而是因为这两款游戏都提供了新的120 Hz选项。\n这就是Xbox Series X开始让我感觉更像PC的地方。我在游戏PC上玩《命运2》(Destiny 2)、《勇士》(Valorant)、《使命召唤：战区》(Call of Duty：Warzone)和《CS：Go》等游戏时的帧速率超过200fps，频率为165赫兹。我个人更看重帧速率而不是视觉质量，所以我会定期删除设置以获得尽可能多的帧。在Gears5的多人模式和多人模式下以120赫兹的频率运行，感觉就像是在我的PC上玩游戏。随着帧速率达到120fps，输入延迟减少了，体验突然变得比我以前在任何Xbox上体验过的流畅得多。\n在启用了120 Hz模式的Dirt 5中，同样的PC般的流畅感觉也在上演。整体视觉质量下降到120fps，但当我在角落里滑动时，输入延迟减少了，我认为这比我的4K电视上一些泥土和雪地渲染的效果要好得多。\n这种感觉对于这款新的Xbox来说真的很重要，我怎么强调都不为过。游戏让人感觉更好。无论是因为加载时间、更好的帧速率，还是仅仅是因为CPU、SSD和更好的GPU让游戏中的菜单或角色更改等操作感觉即时，许多迟钝已经被消除，开发人员甚至不必触摸游戏。\n更高的帧速率显然是Xbox Series X的重点，但一些游戏会转而青睐新的光线跟踪技术。看门狗：Legion就是一个很好的例子，因为它在Xbox Series X上的运行速度为30fps，并启用了光线跟踪。X系列的《守望狗：军团》补丁还没来得及审阅，所以光线追踪在很大程度上仍然是Xbox X系列的谜团。\n看到Xbox游戏中出现了一种选择，我也很受鼓舞。这是我们在当前一代的游戏中看到的，有视频选项，比如通常只能在PC上找到的FOV滑块。灰尘5和Gears 5就是这种选择的好例子，让你可以启用120赫兹模式，以获得更高的帧速率和更流畅的游戏体验，或者专注于4K目标，优先考虑图像质量。\n我希望将来我们能在许多优化的Xbox Series X游戏中看到这些选择。\n虽然Xbox Series X的硬件和游戏体验发生了变化，但仪表盘保持不变。微软保留了现有的Xbox One仪表盘，但近几个月来一直在进行一些视觉上的改变。\n自2013年Xbox One游戏机发布以来，微软似乎一直在调整这款游戏机的仪表盘，几乎每一年都会进行彻底改革。我认为这几天它的状态肯定好多了，但我仍然觉得指南有时会让人迷惑。\n不过，我在Xbox One仪表盘上遇到的大部分大问题都消失了。速度和可靠性问题已经消失，和游戏一样，仪表盘在Xbox Series X上的反应也更灵敏一些。Xbox One上也有一个新的商店界面，这无疑是有帮助的。很明显，微软在最近几个月已经接受了反馈，并做出了一些有意义的改变，但我仍然希望能够将我最喜欢的应用程序和游戏固定在主界面的顶部，而不是看到最近使用过的频繁旋转的应用程序和游戏。微软仍然可以在这里提供更多的定制选项，并进一步简化界面。\n如果你来自Xbox One，你会得到仪表盘的好处，它会让你立即感到熟悉，但不会像新的用户界面那样有趣和大张旗鼓。多亏了Xbox Series X内部更快的组件，你现在可以在大约20秒内从冷(而不是待机)启动。这可能足以让一些人关闭即时待机选项，转而考虑到一些能源账单的节省和地球的健康。此外，靴子动画不再有伴随的声音，声音太大，让你感觉你的房子正在倒塌。\n与Xbox One相比，Xbox Series X仪表盘最大的新增功能是Quick Resume。这项功能可以让你在大约10秒或更短的时间内在游戏之间切换。每个游戏的时间会有所不同，您可以切换并快速恢复的游戏数量也会有所不同。我可以经常在五场游戏之间自由切换，但数字会随着游戏的不同而有所不同。\n它甚至可以在重启或更新后运行，只需关闭主机就可以了，而不必担心保存点的问题。当Quick Resume工作时，它真的工作得很好，但似乎并不是所有的游戏都能工作。我还不能在Forza Horizon 4、Watch Dog：Legion、Sea of Thieves或GTA V上使用它。由于“最近发现的平台漏洞”，微软仍在努力为许多游戏启用快速恢复功能，所以更新应该会在发布后发布。虽然大多数游戏应该支持快速恢复，但目前还不清楚哪些缺失的游戏会得到更新。\n虽然我在Xbox Series X预览版上遇到了一些Quick Resume错误，但我在零售硬件上没有遇到过这么多问题。Gears 5无法恢复，或者在恢复时音频发出爆裂声，但大多数游戏似乎都恢复得很好。不过，我的快速简历积分就这么消失了。我认为Quick Resume是Xbox Series X最好的部分，但显然还有一些早期的缺陷需要解决。我也希望微软能提供一些方法来管理Quick Resume，或者知道哪些游戏处于暂停状态。\n我想谈的仪表板的最后一部分是分享剪辑和截图。微软在Xbox Series X控制器上增加了一个新的共享按钮，这是件大事，但它完全被仪表盘搞砸了。剪辑和截图要上传到微软的Xbox Live服务，你才能分享它们，这仍然需要太长时间。\n这是Xbox One上存在的一个问题，尽管我家里的上传速度很快，但我不得不等几分钟才能看到视频片段。在我的游戏PC上，我可以在不和谐的情况下立即向朋友们播放视频片段或屏幕，相比之下，Xbox的处理过程感觉既陈旧又缓慢。\n微软在这一代产品上的意图是将类似PC的体验带到游戏机上。你可以在X系列甚至更小的S系列中感受到这一点。如果你现在从一台GTX 1060游戏电脑升级到一台RTX 3080电脑，你会得到你知道的同样的Windows 10，并且可以玩你已经玩了多年的同样的游戏。一切都会感觉更快，看起来更好，你就可以准备好观看最新、最棒的游戏了。\nXbox Series X就是这样。如果你从Xbox One升级到Xbox Series X，不仅感觉像是在升级你的PC，而且它的感觉和外观也是如此。(您好，PC塔设计。)。你带上你已经拥有的所有东西，甚至是现有的硬件配件，并随身携带，就像你在PC上所做的那样。\n这是与索尼不同的做法，PS5及其专属的下一代游戏、新的仪表盘用户界面和新的控制器。微软将重点放在了真正重要的基础上：高帧速率、安静而酷的控制台、更快的加载速度、附件支持以及向后兼容性。在我使用Xbox Series X的三周时间里，可以公平地说，它已经实现了这些基本功能。\n但Xbox Series X最棒的地方在于，它实际上并不是一台PC。我不必担心驱动程序、丰富的游戏启动程序或Windows更新会毁了我的PC的工作方式。你打开Xbox，然后玩游戏。如果开发人员接受我在X系列上经历过的选择和性能选项，我肯定会很想在Xbox上玩得更多，因为它的交叉播放、交叉保存以及键盘和鼠标支持都在Xbox上变得更加突出。\n对我来说，Xbox Series X还有一个很大的问题：微软的23家第一方工作室什么时候才能推出下一代游戏，真正展示这款游戏机的能力？强大的硬件和流畅的用户体验只是其中的一部分。微软需要这些游戏才能真正让X系列看起来像个全新的产品。\n索尼证实，游戏PlayStation5在发布当天不能在店内购买。\n查看游戏中的所有故事", "note_en": "Skip to main content                                                                                                                By       @tomwarren        Photography by  Vjeran Pavic | Video by  Becca Farsace,  Phil Esposito, and  Vjeran Pavic | Sound by  Andrew Marino  | Graphics by  Grayson Blackmon\n If you buy something from a Verge link, Vox Media may earn a commission. See our  ethics statement.\n    Microsoft’s new Xbox Series X console is designed to usher in a new era of gaming. We affectionally call it the “next gen” every time a big leap in console hardware arrives, promising new games and things we’ve never seen before. The Xbox Series X will undoubtedly deliver those in time, but for now, the big launch games, flashy new graphics, and next-gen games are still on their way.\n In the meantime, Microsoft has built what feels like an exciting PC upgrade experience in a console form. The Xbox Series X comes the closest I’ve ever witnessed to re-creating the superior PC experience of playing games, thanks to SSD storage, a far more powerful CPU, 120Hz support, and impressive backward compatibility features that improve existing games. This is all inside a $499 box that’s quieter and far easier to use and maintain than the $3,000 gaming PC I built a few weeks ago.\n There’s a reason the Xbox Series X even looks like a PC — it’s because it often feels like one.\n    Microsoft has squeezed all of the components of the Xbox Series X into a boxy, rectangular, tower-like case. It looks like a compact PC but with an unassuming design that looks far better standing vertically than it does laying horizontally (just like most PCs). The base of the Xbox Series X isn’t removable, and (unlike the PS5) the console is not designed to be opened up. When placed horizontally, it’s fair to say that the Xbox Series X looks like it fell over with the base permanently attached. I’m not in love with the design, but I’m also not bothered by it. It’s a black box you stick under your TV and forget about, as long as you’re able to fit it under your TV.\n There are two USB ports at the rear alongside an Ethernet port, a storage expansion slot, and HDMI 2.1 out. At the front, there’s a single USB port and the 4K Blu-ray drive. Microsoft has also added raised Braille bumps next to the ports on the Xbox Series X, a nice touch for accessibility. I would have liked to have seen USB-C here or even the clever HDMI passthrough system from the Xbox One days, but neither is a major omission. Sadly, the Xbox Series X doesn’t support Wi-Fi 6, which would have been great future-proofing for many.\n I haven’t noticed any issues with heat or noise on the Series X. Microsoft has placed the Xbox Series X exhaust fan at the top, flanked by a green coating in the plastic cover that makes it look like there’s an LED up top. I’ve never once heard this fan, which is surprising since my Xbox One X can get pretty loud in certain games. Yet, the Series X has remained silent throughout the weeks I’ve been using it. The heat exhausting from the top is very similar to what I’ve felt on the Xbox One X, and it has never been too hot to touch.\n It’s difficult to judge dust buildup, noise, and fans in just a few weeks of use, but I don’t have any immediate causes for concern. I have mostly been using the Series X outside of a TV stand where air can flow easily, so it hasn’t been squeezed inside a unit. I think most people are going to need to think about positioning and airflow with these next-gen consoles, just like you would with a giant gaming PC.\n The only other hardware that’s new with the Xbox Series X is the controller and the storage expansion cards. (More on these in the next section.) The updated controller is very similar to the Xbox One version, with an updated D-pad, textured grips, and the addition of a new share button and a USB-C port. The share button lets you quickly share clips or screenshots with friends, much like on a PS4, while you’ll need to purchase a rechargeable play-and-charge kit separately ($24.99) if you really want to take advantage of USB-C — the controller runs on AA batteries by default.\n   Load times are incredibly good on the Xbox Series X compared to what we’re used to on current consoles. The Xbox Series X utilizes a greatly improved CPU that works in tandem with the SSD to help games load far faster than the current Xbox One X.\n I’ve noticed load time improvements across every game I’ve used on the Series X. Some are dramatically faster in terms of minutes saved waiting for a game or a level within a game to load. Others are a few seconds saved here and there, but they all add up to more time spent playing games instead of waiting for them to load.\n  I’m used to the speedy load times from PC SSDs, but I’m still impressed with the Series X load times. Games like  Sea of Thieves and  Destiny 2 load in less than half the time they do on the Xbox One X. Even older games like  GTA V load a lot faster than before.\n While the Xbox Series X comes equipped with 1TB of storage, you can only use 802GB of it. That’s actually slightly more than the 780GB of usable space on the Xbox One X, even with Microsoft reserving space for the OS and new Quick Resume feature that lets you swap between games in around 10 seconds or less.\n   Microsoft is also using a proprietary storage expansion slot on the Xbox Series X, and so far, only Seagate has been confirmed as a partner for the  $219.99 1TB cards that slot into the rear of the console. The usable space on these cards is 920GB as, once again, space is reserved for Quick Resume.\n Games that have been specifically updated for the Xbox Series X make use of Microsoft’s new Velocity Architecture to get the most performance out of the system’s SSD, so you can’t run them off USB storage. The vast majority of backward-compatible games, however, don’t use Velocity Architecture, meaning they can be played directly off a USB drive — unless they get a Series X update in the future.\n  That means a lot of the immediate load time improvements are thanks to the SSD and CPU alone, not the new APIs Microsoft has implemented that should improve load times even more in the future. It also means that if some of your older games don’t get updated for the Velocity Architecture, then you could just run them freely from USB storage. You’ll see plenty of load time improvements this way — providing you’re using fast USB SSD storage drives — and some may even come very close to the times you’ll see using the internal drive.\n  These load times and CPU improvements, alongside a big bump to 12 teraflops of GPU performance, all contribute to an experience in existing games that feels a lot smoother. That could mean a jump from 30fps to 60fps in games like  Fallout 4, or menus and planet load times in  Destiny 2 suddenly being on par with PC.\n These improvements also mean that most titles with poor performance on an Xbox One should hit a stable 30fps at the minimum. A lot of frame rate drops that I’ve seen in games on the Xbox One X have simply disappeared with the Xbox Series X, thanks to the hardware boost. I’ve noticed  Apex Legends,  Warframe, and  Destiny 2 all dipping less at demanding points.\n A number of Xbox Series X optimization patches will be available when the console launches on November 10th, and I’ve had a chance to test both  Sea of Thieves and  Forza Horizon 4. Both games are transformed by these updates, moving from 30fps to 60fps.  Sea of Thieves feels like a new game as a result, or like you’re playing on a PC. That’s how dramatic the shift from 30fps to 60fps feels.\n   Even backward compatibility support gets an impressive boost. The Xbox 360 version of  Grand Theft Auto IV now runs super smoothly on the Xbox Series X locked at 60fps, while the Xbox One X often struggled to maintain that 60fps performance.  Grand Theft Auto IV also benefits from the auto HDR feature that Microsoft is shipping with the Xbox Series X, that will work on most games to make them look even better.\n Alongside the optimization patches, the most exciting games I’ve tested so far on the Xbox Series X are  Dirt 5 and  Gears 5 — not because they’re necessarily technical showcases for the console, but because both offer a new 120Hz option.\n This is where the Xbox Series X really started to feel even more PC-like to me. I play at 165Hz with frame rates that exceed 200fps in games like  Destiny 2,  Valorant,  Call of Duty: Warzone, and  CS:GO on my gaming PC. I personally value frame rates over visual quality, so I regularly drop settings to get as many frames as possible. Running around the versus multiplayer mode in  Gears 5 in 120Hz feels like I’m playing on my PC. With frame rates hitting 120fps, input lag is reduced, and the experience is suddenly so much smoother than what I’ve ever experienced on any Xbox before.\n   That same feeling of PC-like smoothness plays out in  Dirt 5 with the 120Hz mode enabled. The overall visual quality drops to achieve 120fps, but when I’m sliding around corners, the input latency is reduced, and I value that over some mud and snow rendering just that little better on my 4K TV.\n It’s that  feeling that’s really important with this new Xbox, and I can’t stress it enough. Games  feel better. Whether that’s because of load times, better frame rates, or simply the CPU, SSD, and better GPU making things like menus or character changes in games feel instant, a lot of the sluggishness has been removed without developers even having to touch games.\n  Higher frame rates are clearly a focus on the Xbox Series X, but some games will favor new ray-tracing techniques instead.  Watch Dogs: Legion is a good example, as it will run at 30fps on the Xbox Series X with ray tracing enabled. The  Watch Dogs: Legion patch for Series X wasn’t available in time for review, so ray tracing is still largely a mystery on the Xbox Series X right now.\n I’m also encouraged to see that a choice is emerging in Xbox games. That’s something we’ve seen in current-gen games, with video options like FOV sliders you typically only find on PCs.  Dirt 5 and  Gears 5 are good examples of this choice, allowing you to enable a 120Hz mode for the higher frame rates and smoother gameplay or focus on a 4K target with image quality prioritized.\n I’m hoping we see these choices on many optimized Xbox Series X titles in the future.\n    While the hardware and experience of gaming have changed on the Xbox Series X, the dashboard remains the same. Microsoft is keeping the same Xbox One dashboard that exists today, with a few visual changes the company has been working on in recent months.\n It feels like Microsoft has been  tweaking the Xbox One dashboard ever since the disastrous launch of the console back in 2013, and not a year goes by without an overhaul. I think it’s definitely in much better shape these days, but I still find the guide confusing to use at times.\n Most of the big issues I had with the Xbox One dashboard have disappeared, though. Speed and reliability problems have vanished, and, like games, the dashboard feels just that bit more responsive on the Xbox Series X. A new store interface, also available on the Xbox One, has definitely helped. It’s clear Microsoft has taken the feedback and made some meaningful changes in recent months, but I’d still like to just be able to pin my favorite apps and games at the top of the home interface instead of seeing recently used ones that rotate frequently. Microsoft could still do with offering more customization options here and simplifying the interface further.\n You do get the benefits of a dashboard that feels instantly familiar if you’re coming from an Xbox One, but without the fun and fanfare that a new UI entails. Thanks to the faster components inside the Xbox Series X, you can now boot from cold (not standby) in around 20 seconds. That might be enough for some to turn off the instant standby option in favor of some energy bill savings and the health of our planet. Also, the boot animation no longer has an accompanying sound so loud it  makes you feel like your house is falling down.\n The biggest new addition to the Xbox Series X dashboard over the Xbox One is Quick Resume. It’s a feature that lets you switch between games in around 10 seconds or less. The timing will vary per game, as will the number of games you can switch between and quickly resume. I’ve been able to regularly swap between five games freely, but the number will vary on titles.\n It even works after reboots or updates, and it’s great to just turn a console off and not have to worry about save points. When Quick Resume works, it works really well, but it doesn’t seem to work on all games. I’ve not been able to use it with  Forza Horizon 4,  Watch Dogs: Legion,  Sea of Thieves, or  GTA V. Microsoft is still working to enable Quick Resume on a number of games due to a “recently discovered platform bug,” so updates should arrive after launch. While most games should support Quick Resume, it’s still not clear which missing ones will get updated.\n  While I ran into a number of Quick Resume bugs on an Xbox Series X preview unit, I haven’t had as many problems on the retail hardware.  Gears 5 has failed to resume or the audio has crackled as it resumes, but most games seem to resume well. I have had Quick Resume points just disappear, though. I think Quick Resume is the best part of the Xbox Series X, but there are clearly some early bugs that still need to be squashed. I also wish Microsoft had provided some way to manage Quick Resume or to know which games are in a suspended state.\n The final part of the dashboard I want to touch on is sharing clips and screenshots. Microsoft made a big deal about a new share button on the Xbox Series X controller, but it’s totally let down by the dashboard. It still takes far too long for clips and screenshots to be uploaded to Microsoft’s Xbox Live service for you to share them.\n This is a problem that exists on the Xbox One, and I’ve had to wait minutes for clips to be available despite having a fast 1Gbps upload at home. On my gaming PC, I can instantly stream clips or my screen to friends on Discord, and the Xbox process just feels old and slow in comparison.\n   Microsoft’s intention with this new generation is to bring a PC-like experience to a console. You can feel it throughout the Series X and even the smaller Series S. If you upgraded from a GTX 1060 gaming PC to an RTX 3080 PC right now, you’d get the same Windows 10 you know and access to the same games you’ve been playing for years. Everything would just feel faster and look better, and you’d be ready for the latest and greatest games.\n That’s exactly what you get with the Xbox Series X. Not only does it feel like you’re upgrading your PC if you move from an Xbox One to an Xbox Series X, but it feels and looks like it. (Hello, PC tower design.) You take everything you already own, even existing hardware accessories, and you bring them along with you, just like you do on a PC.\n It’s a different approach to Sony with the PS5 and its dedicated exclusive next-gen games, new dashboard UI, and new controller. Microsoft has focused on the basics that really matter: high frame rates, a quiet and cool console, faster load times, accessory support, and backward compatibility. In my three weeks of using an Xbox Series X, it’s fair to say it has delivered on these basics.\n But the best part about the Xbox Series X is that it’s not actually a PC. I don’t have to worry about drivers, copious game launchers, or Windows updates ruining how my PC works. You turn the Xbox on, and you play games. If developers embrace the choice and performance options I’ve experienced on the Series X, I’d certainly be tempted to play far more on an Xbox with crossplay, cross-save, and keyboard and mouse support all becoming more prominent on Xbox.\n There’s one big question that remains for me with the Xbox Series X: when will Microsoft’s 23 first-party studios deliver the next-gen games to truly show what this console is capable of? Powerful hardware and a sleek user experience are only part of the mix. Microsoft will need the games to really make the Series X feel like something brand-new.\n Gaming   PlayStation 5 won’t be available for in-store purchase on launch day, Sony confirms\n  View all stories in Gaming", "posttime": "2020-11-05 22:55:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,性能,游戏,模式,series", "title": "Xbox Series X评测：出色的性能和令人印象深刻的向后兼容性，120赫兹模式使游戏更流畅，恢复速度更快，但发布时没有AAA级游戏", "title_en": "Xbox Series X review: good performance and impressive backward compatibility, 120Hz mode for smoother gameplay, and quick resume, but no AAA games at launch", "transed": 1, "url": "https://www.theverge.com/21548987/xbox-series-x-review?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["发布", "性能", "游戏", "模式", "series"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033355, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "LWN订户已向您提供以下仅限订阅的内容。数以千计的用户依赖LWN获取来自Linux和自由软件社区的最好消息。如果您喜欢这篇文章，请考虑接受右边的试用报价。感谢您访问LWN.net！\n免费试用LWN 1个月：无需付款或信用卡。现在激活您的试用订阅，看看为什么成千上万的读者订阅LWN.net。", "note_en": "The following subscription-only content has been made available to you by an LWN subscriber. Thousands of subscribers depend on LWN for the best news from the Linux and free software communities. If you enjoy this article, please consider accepting the trial offer on the right. Thank youfor visiting LWN.net!\n Try LWN for free for 1 month: no payment or credit card required.  Activate your trial subscription now and see why thousands of readers subscribe to LWN.net.", "posttime": "2020-11-05 22:49:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冥王星,introduction,lwn", "title": "冥王星简介", "title_en": "An Introduction to Pluto", "transed": 1, "url": "https://lwn.net/SubscriberLink/835930/47c363bef07134a4/", "via": "", "real_tags": ["冥王星", "lwn"]}, {"category": "", "categoryclass": "", "imagename": "910523ca0d809d014bfb2d6087671f30.jpg", "infoid": 1033354, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当AMD宣布其新的Zen 3核心是一次彻底的重新设计，并提供完全的性能领先时，我们不得不要求他们证实这是否真的是他们所说的。尽管AMD的规模还不到英特尔的10%，而且在2015年作为一家公司已经接近倒闭，但AMD在那个时间框架内对其下一代Zen微架构和Ryzen设计的押注现在正在结出硕果。针对台式机市场，Zen 3和新的Ryzen 5000处理器实现了这些目标：不仅性能功耗比和性能价格比处于领先地位，而且在每个细分市场都处于绝对的性能领先地位。我们已经研究了新的微体系结构，并测试了新的处理器。AMD是新的王者，我们有数据证明这一点。\n新的Ryzen 5000处理器是Ryzen 3000系列的替代产品。今天，任何拥有AMD X570或B550主板，拥有最新BIOS(AGESA 1081或更高版本)的人，都应该能够毫不费力地购买和使用其中一个新处理器。任何拥有X470/B450主板的用户都必须等到2021年第一季度这些主板进行更新。\n正如我们之前所说的，AMD今天将推出四款处理器进行零售，从六核到十六核不等。\n根据JEDEC标准，所有处理器都具有对DDR4-3200内存的本机支持，尽管AMD建议使用稍微快一点的内存以获得最佳性能。所有处理器还具有20条PCIe 4.0通道，可用于附加设备。\n顶级处理器是Ryzen 9 5950X，有16个内核和32个线程，提供3400 MHz的基频和4900 MHz的Turbo频率-在我们的零售处理器上，我们实际上检测到了5050 MHz的单核频率，这表明该处理器将在5.0 GHz以上进行涡轮增压，具有足够的散热余量和冷却！\n该处理器通过两个八核芯片(下面将详细介绍)启用，每个芯片具有32MB的L3高速缓存(总计64MB)。Ryzen 9 5950X的额定TDP与Ryzen 9 3950X相同，为105W。根据AMD的插座设计，在支持它的主板上，峰值功率将为~142W。\n对于那些没有阅读其余评论的人来说，Ryzen 9 5950X的简短结论是，即使在799美元的建议零售价下，它也能使整个消费级产品的表现达到一个新的水平。单线程频率高得离谱，当与具有更高IPC的新内核设计相结合时，会将单核受限的工作负载推到英特尔最好的Tiger Lake处理器之上。在多线程工作负载方面，我们全面记录了消费类处理器。\n与英特尔最好的消费级处理器相抗衡的是Ryzen 9 5900X，它有12个内核和24个线程，基频为3700 MHz，涡轮频率为4800 MHz(观察到4950 MHz)。该处理器通过两个六核芯片启用，但所有高速缓存仍以每个芯片32MB的速度启用(总共64MB)。5900X还具有与其在105W时替代的3900X/3900XT相同的TDP。\n549美元的价格比它所取代的处理器高出50美元，这意味着额外10%的成本，它将不得不展示它的性能至少可以提高10%。\n在上一代AMD展示了一款不到100美元的四核处理器后，花了很大力气才能以449美元的价格提供一款八核处理器--AMD坚持其声称的这款处理器可以大幅提升代际性能的说法。新的AMD Ryzen 7 5800X拥有8个内核和16个线程，将与英特尔的酷睿i7-10700K展开竞争，酷睿i7-10700K也是一个8核/16线程处理器。\nRyzen 7 5800X的基频为3800 MHz，额定Turbo频率为4700 MHz(我们检测到了4825 MHz)，并使用了一个8核芯片，总共有32MB的L3缓存。与需要跨CPU通信的双芯片设计相比，单核心芯片有一些小的好处，这在我们的一些CPU非常有限的游戏基准中得到了体现。该处理器还具有105W的TDP(约142W峰值)。\nAMD今天发布的最便宜的处理器是Ryzen 5 5600X，但它也是唯一一款配备CPU散热器的处理器。Ryzen 5 5600X有6个内核和12个线程，运行在3700 MHz的基频和4600 MHz的峰值Turbo(测量为4650 MHz)，并且是唯一被赋予65W(~88W峰值)的TDP的CPU。\n单芯片设计意味着总共32MB的三级高速缓存(从技术上讲，它仍然与Ryzen 9部件的单核访问能力相同)，并将与英特尔的六核i5-10600K进行竞争，后者的零售价也与Ryzen 9大致相当。\n尽管Ryzen 5 5600X处理器价格最低，技术上也是最慢的，但它的性能让我大吃一惊：与Ryzen 9 5950X类似，在单线程基准测试中，它完全超越了英特尔所能提供的所有处理器--甚至包括泰格湖(Tiger Lake)。\n在更高的层面上，新的Ryzen 5000；Vermeer系列似乎与上一代Ryzen 3000《马蒂斯》系列出奇地相似。这实际上是出于设计目的，因为AMD在新处理器中充分利用了他们的芯片设计方法。\n为了介绍一些术语，AMD创造了两种类型的芯片。其中一个有主要的加工核心，被称为核心复合模或CCD。这是一款基于台积电7纳米制程的产品。另一种芯片是带有I/O的互连芯片，称为IO芯片或IOD-这一芯片具有PCIe通道、内存控制器、SATA端口、与芯片组的连接，并有助于控制电力传输和安全。在上一代和新一代中，AMD都将其IO中的一个芯片与多达两个8核芯片配对。\n这是可能的，因为新的核心小芯片包含用于互连、物理设计和功率限制的相同协议。AMD能够利用上一代平台和代的执行，这样当核心连接相同时，尽管内部结构不同(Zen 3与Zen 2)，它们仍然可以以已知和成功的方式组合在一起并执行。\n和上一代一样，新的禅宗3芯片设计有8个内核。\n通过使新的8核Zen 3芯片保持相同的大小和相同的功率，这显然意味着AMD必须构建一个符合这些限制的内核，同时提供性能和性能效率的提升，以便做出更有说服力的设计。通常，在设计CPU内核时，最容易做的事情就是利用之前的设计，对其某些部分进行升级--也就是工程师们所说的“低垂的果实”，即以最少的努力获得最大的加速。因为CPU核心设计是有最后期限的，所以总会有一些想法永远不会进入最终设计，但这些想法会成为下一代最容易瞄准的目标。这就是我们在Zen 1/Zen+转到Zen 2时看到的。所以很自然，AMD做的最简单的事情也是一样的，但是Zen 3。\n然而，AMD并非如此。在对AMD高级员工的采访中，我们了解到AMD有两个独立的CPU核心设计团队，他们的目标是在构建更新的、高性能的核心时相互超越。禅1和禅2是第一核心设计团队的产品，现在禅3是第二设计团队的产品。自然，我们预计禅宗4将成为禅宗3的下一代，“低垂的果实”将得到照顾。\n在最近对AMD首席技术官Mark Papermaster的采访中，我们被告知，如果你从10万英尺的高度看核心，你可能很容易误认为Zen 3的核心设计类似于Zen 2。然而，我们被告知，因为这是一个新的团队，核心的每个部分都经过了重新设计，或者至少是更新了。密切关注这一领域的用户会记得，Zen 2中使用的分支预测器在Zen 3之前是不会出现的，这表明即使是核心设计也有可移植性的元素。Zen 2和Zen 3都建立在相同的TSMC N7工艺节点上(相同的PDK，尽管Zen 3拥有来自TMSC的最新良率/一致性制造更新)，这也有助于提高设计的可移植性。\nAMD已经宣布了一个重大变化，这对大多数对这一领域感兴趣的技术人员来说都是显而易见的：基础核心芯片不是有两个四核复合体，而是一个八核复合体。这使得每个内核能够访问芯片的全部32MB的三级高速缓存，而不是16MB，从而缩短了16到32MB窗口中的内存访问延迟。它还简化了芯片内的核心到核心通信。要做到这一点，需要做一些权衡，但总的来说，这是一场不错的胜利。\n事实上，在整个核心地区存在着大量的不同之处。AMD已有所改善：\n其中许多内容将在接下来的几页中进行解释和扩展，并在基准测试结果中进行观察。简而言之，这不仅仅是核心的更新--这些都是真正的新核心和新设计，需要在新的纸张上建造。\n其中一些特性，比如更宽的缓冲器和更高的带宽，自然伴随着一个问题：与Zen 2相比，AMD是如何保持Zen 3的功率不变的。通常情况下，当内核变宽时，意味着必须一直打开更多的硅，这会影响静态功率，或者如果所有这些都同时使用，那么就会有更高的有功功率。\n在接受Mark Papermaster采访时，他指出AMD在物理实现方面的能力是其中的一个关键因素。通过利用他们对台积电7纳米(N7)制程的了解，以及对他们自己工具的更新来充分利用这些设计，AMD能够保持电源中立，尽管进行了所有这些更新和升级。部分原因还来自AMD与TMSC的长期优质合作伙伴关系，能够在平面图、制造和产品之间实现更好的设计技术协同优化(DTCO)。\n自第一代Zen推出以来，AMD的CPU营销团队一直非常准确地宣称其性能，甚至时不时地低估其性能。除了在单线程、多线程和游戏方面提升性能领先地位外，AMD还推出了几个逐代改进的指标。\nAMD提供的关键指标是IPC从Zen 2升级到Zen 3+19%，或者更确切地说，当两个CPU都在4.0 GHz并使用DDR4-3600内存时，从Ryzen 5 3800XT升级到Ryzen 5 5800X+19%。\n事实上，使用我们的行业基准，对于单线程性能，我们观察到每个时钟的CPU性能提高了19%。我们必须在这里向AMD致敬，这是他们第二次或第三次引用我们匹配的IPC数据。\n在多线程SPECrate中，考虑到更快的内核也需要更多的主存带宽(这一代没有提供)，绝对增益只有10%左右。这意味着存在一些瓶颈，如果更多的内核需要相同的资源，那么更高的IPC将无法帮助解决这些瓶颈。\n在实际测试中，在我们的整个套件中，我们看到平均提升了24%。对于显式多线程测试，我们看到的范围从均匀性能到+35%，而对于显式单线程测试，范围从均匀性能到+57%。这归根结底是执行/计算限制的测试在内存限制的工作负载上获得更大的加速。\n对于游戏，这个数字在1920x1080游戏中以+5%到+50%的形式给出，在高预设的情况下，将Ryzen 9 5900X与Ryzen 9 3900XT进行比较，这取决于基准。\n在CPU受限设置(例如720p或480p最低设置)下的测试中，我们发现Ryzen 9 5950X与Ryzen 9 3950X相比，平均每秒帧数提升44%。根据测试的不同，性能提升的幅度从+10%到+80%不等，切尔诺贝利、Borderland 3、齿轮战术和F1 2019的关键收益。\n对于我们更主流的游戏测试，运行在1920x1080，所有的质量设置都是最大的，性能提升平均在+10%左右。这从相同的分数(坦克世界，奇异旅，红色死亡救赎)到+36%(文明6，遥远的哭泣5)，横跨了所有的色域。\n也许最重要的比较是AMD Ryzen 9 5950X与英特尔酷睿i9-10900K的对比。在我们的CPU受限测试中，AMD在CPU受限的情况下获得了+21%的平均FPS胜利，范围从+2%到+52%。但在我们的1080p最大设置测试中，结果平均并驾齐驱，在-4%到+6%之间波动。(这一结果不包括我们测试中的一个异常情况，因为文明6号显示AMD赢得了+43%的胜利。)。\n根据内核数量和定价，新的Ryzen 5000系列处理器与英特尔一些最受欢迎的Comet Lake处理器以及上一代AMD硬件非常接近。\n在整个回顾中，我们将参考这些比较，并最终将每个处理器细分为其自己的分析细目。\n由于这是我们对禅宗3的深度报道，我们将深入探讨一些细节。在接下来的几页中，我们将回顾一下：\n发表评论是的！我只想看到缓存和延迟部分-统一缓存允许6核和12核设置，而不会受到部分CCX的影响！回覆。\n至少在火箭湖(Rocket Lake)到来之前，AMD终于有了一台英特尔(Intel)打击机。有真正的竞争将是伟大的计算。不错的评论。回覆\n非常令人印象深刻。我认为我的3950X在下一个插座之前很好，但单线提升是非常诱人的。回覆", "note_en": "When AMD announced that its new Zen 3 core was a ground-up redesign and offered complete performance leadership, we had to ask them to confirm if that’s exactly what they said. Despite being less than 10% the size of Intel, and very close to folding as a company in 2015, the bets that AMD made in that timeframe with its next generation Zen microarchitecture and Ryzen designs are now coming to fruition. Zen 3 and the new Ryzen 5000 processors, for the desktop market, are the realization of those goals: not only performance per watt and performance per dollar leaders, but absolute performance leadership in every segment. We’ve gone into the new microarchitecture and tested the new processors. AMD is the new king, and we have the data to show it.\n  The new Ryzen 5000 processors are drop-in replacements for the Ryzen 3000 series. Anyone with an AMD X570 or B550 motherboard today, with the latest BIOS (AGESA 1081 or above), should be able to buy and use one of the new processors without a fuss. Anyone with an X470/B450 board will have to wait until Q1 2021 as those boards are updated.\n As we’ve previously covered, AMD is launching four processors today for retail, ranging from six cores up to sixteen cores.\n   All the processors have native support for DDR4-3200 memory as per JEDEC standards, although AMD recommends something slightly faster for optimum performance. All the processors also have 20 lanes of PCIe 4.0 for add-in devices.\n  The top processor is the Ryzen 9 5950X, with 16 cores and 32 threads, offering a base frequency of 3400 MHz and a turbo frequency of 4900 MHz – on our retail processor, we actually detected a single core frequency of 5050 MHz, indicating that  this processor will turbo above 5.0 GHz with sufficient thermal headroom and cooling!\n  This processor is enabled throug h two eight core chiplets (more on chiplets below), each with 32 MB of L3 cache (total 64 MB). The Ryzen 9 5950X is rated at the same TDP as the Ryzen 9 3950X, at 105 W. The peak power will be ~142 W, as per AMD’s socket design, on motherboards that can support it.\n  For those that don’t read the rest of the review, the short conclusion for the Ryzen 9 5950X is that even at $799 suggested retail price, it enables a new level of consumer grade performance across the board. The single thread frequency is crazy high, and when combined with the new core design with its higher IPC, pushes workloads that are single-core limited above and beyond Intel’s best Tiger Lake processors. When it comes to multi-threaded workloads, we have new records for a consumer processor across the board.\n   Squaring off against Intel’s best consumer grade processor is the Ryzen 9 5900X, with 12 cores and 24 threads, offering a base frequency of 3700 MHz and a turbo frequency of 4800 MHz (4950 MHz was observed). This processor is enabled through two six-core chiplets, but all the cache is still enabled at 32 MB per chiplet (64 MB total). The 5900X also has the same TDP as the 3900X/3900XT it replaces at 105 W.\n At $549, it is priced $50 higher than the processor it replaces, which means that for the extra 10% cost it will have to showcase that it can perform at least 10% better.\n  After AMD showcased a quad core processor under $100 in the last generation, it takes a lot of chutzpah to offer an eight core processor for $449 – AMD stands by its claims that this processor offers substantial generational performance improvements. The new AMD Ryzen 7 5800X, with eight cores and sixteen threads, is set to go up against Intel’s Core i7-10700K, also an eight core / sixteen thread processor.\n The Ryzen 7 5800X has a base frequency of 3800 MHz and a rated turbo frequency of 4700 MHz (we detected 4825 MHz), and uses a single eight-core chiplet with a total 32 MB of L3 cache. The single core chiplet has some small benefits over a dual chiplet design where some cross-CPU communication is needed, and that comes across in some of our very CPU-limited gaming benchmarks. This processor also has 105 W TDP (~142 W peak).\n  The cheapest processor that AMD is releasing today is the Ryzen 5 5600X, but it is also the only one that comes with a CPU cooler in box. The Ryzen 5 5600X has six cores and twelve threads, running at a base frequency of 3700 MHz and a peak turbo of 4600 MHz (4650 MHz measured), and is the only CPU to be given a TDP of 65 W (~88 W peak).\n The single chiplet design means 32 MB of L3 cache total (technically it’s still the same that a single core can access as the Ryzen 9 parts, more on that later), and will be put up against Intel’s six-core Core i5-10600K, which also retails in a similar ballpark.\n Despite being the cheapest and technically the slowest processor of the bunch, I was mightily surprised by the performance of the Ryzen 5 5600X: similar to the Ryzen 9 5950X, in single threaded benchmarks, it completely knocks the socks off of anything Intel has to offer – even Tiger Lake.\n  At a high level, the new Ryzen 5000 &#39;Vermeer&#39; series seem oddly familiar to the last generation Ryzen 3000 ‘Matisse’ series. This is actually by design, as AMD is fully leveraging their chiplet design methodology in the new processors.\n To introduce some terminology, AMD creates two types of chiplets. One of them has the main processing cores, and is called a core complex die or CCD. This is the one that is built on TSMC&#39;s 7nm process. The other chiplet is an interconnect die with I/O, known as an IO die or IOD - this one has the PCIe lanes, the memory controllers, the SATA ports, the connection to the chipset, and helps control power delivery as well as security. In both the previous generation and the new generation, AMD pairs one of its IO dies with up to two 8-core chiplets.\n  This is possible because the new core chiplets contain the same protocols for interconnect, physical design, and power constraints. AMD is able to leverage the execution of the previous platform and generation such that when the core connections are identical, despite the different internal structures (Zen 3 vs Zen 2), they can still be put together and executed in a known and successful fashion.\n As with the previous generation, the new Zen 3 chiplet is designed with eight cores\n  By keeping the new 8-core Zen 3 chiplet the same size and same power, this obviously means that AMD had to build a core that fits within those constraints but also affords a performance and performance efficiency uplift in order to make a more compelling design. Typically when designing a CPU core, the easiest thing to do is to take the previous design and upgrade certain parts of it – or what engineers call tackling ‘the low hanging fruit’ which enables the most speed-up for the least effort. Because CPU core designs are built to a deadline, there are always ideas that never make it into the final design, but those become the easiest targets for the next generation. This is what we saw with Zen 1/Zen+ moving on to Zen 2. So naturally, the easiest thing for AMD to do would be the same again, but with Zen 3.\n However, AMD did not do this. In our interviews with AMD’s senior staff, we have known that AMD has two independent CPU core design teams that aim to leapfrog each other as they build newer, high performance cores. Zen 1 and Zen 2 were products from the first core design team, and now Zen 3 is the product from the second design team. Naturally we then expect Zen 4 to be the next generation of Zen 3, with ‘the low hanging fruit’ taken care of.\n  In  our recent interview with AMD’s Chief Technology Officer, Mark Papermaster, we were told that if you were to look at the core from a 100,000 foot level, you might easily mistake that the Zen 3 core design to be similar to that of Zen 2. However, we were told that because this is a new team, every segment of the core has been redesigned, or at the very least, updated. Users who follow this space closely will remember that the branch predictor used in Zen 2 wasn’t meant to come until Zen 3, showing that even the core designs have an element of portability to them. The fact that both Zen 2 and Zen 3 are built on the same TSMC N7 process node (the same PDK, although Zen 3 has the latest yield/consistency manufacturing updates from TMSC) also helps in that design portability.\n AMD has already announced the major change that will be obvious to most of the techies that are interested in this space: the base core chiplet, rather than having two four-core complexes, has a single eight-core complex. This enables each core to access the whole 32 MB of L3 cache of a die, rather than 16 MB, which reduces latency of memory accesses in that 16-to-32 MB window. It also simplifies core-to-core communication within a chiplet. There are a couple of trade-offs to do this, but overall it is a good win.\n In fact there are a significant number of differences throughout the core. AMD has improved:\n  Many of these will be explained and expanded upon over the next few pages, and observed in the benchmark results. Simply put, this is something more than just a core update – these are genuinely new cores and new designs that required new sheets of paper to be built upon.\n A number of these features, such as wider buffers and increased bandwidth, naturally come with the question about how AMD has kept the power the same for Zen 3 compared to Zen 2. Normally when a core gets wider, that means more silicon has to be turned on all the time, and this influences static power, or if it all gets used simultaneously, then there is higher active power.\n When speaking with Mark Papermaster, he pointed to AMD’s prowess in physical implementation as a key factor in this. By leveraging their knowledge of TSMC’s 7nm (N7) process, as well as updates to their own tools to get the best out of these designs, AMD was able to remain power neutral, despite all this updates and upgrades. Part of this also comes from AMD’s long standing premium partner relationship with TMSC, being able to enable better design technology co-optimization (DTCO) between floorplan, manufacturing, and product.\n  The CPU marketing teams from AMD, since the launch of first generation Zen, have been very accurate in their performance claims, even to the point of understating performance from time to time. Aside from promoting performance leadership in single thread, multi-thread, and gaming, AMD promoted several metrics for generation-on-generation improvement.\n  The key metric offered by AMD was a +19% IPC uplift from Zen 2 to Zen 3, or rather a +19% uplift from Ryzen 5 3800XT to Ryzen 5 5800X when both CPUs are at 4.0 GHz and using DDR4-3600 memory.\n  In fact, using our industry benchmarks, for single threaded performance,  we observed a +19% increase in CPU performance per clock. We have to offer kudos to AMD here, this is the second or third time they&#39;ve quoted IPC figures which we&#39;ve matched.\n In multithreaded SPECrate, the absolute gain was only around 10% or so, given that faster cores also require more bandwidth to main memory, which hasn’t been provided in this generation. This means that there are some bottlenecks to which a higher IPC won’t help if more cores require the same resources.\n For real-world tests, across our whole suite, we saw an average +24% uplift. For explicitly multithreaded tests, we saw ranges from even performance up to +35%, while for explicitly single threaded tests, this ranged from even performance up to +57%. This comes down to execution/compute bound tests getting bigger speedups over memory bound workloads.\n  For gaming, the number was given as a +5 to +50% uplift in 1920x1080 gaming at the high preset, comparing a Ryzen 9 5900X against the Ryzen 9 3900XT, depending on the benchmark.\n In our tests at CPU limited settings, such as 720p or 480p minimum, we saw an average +44% frames-per-second performance uplift comparing the Ryzen 9 5950X to the Ryzen 9 3950X. Depending on the test, this ranged from +10% to +80% performance uplift, with key gains in Chernobylite, Borderlands 3, Gears Tactics, and F1 2019.\n For our more mainstream gaming tests, run at 1920x1080 with all the quality settings on maximum, the performance gain averaged around +10%. This spanned the gamut from an equal score (World of Tanks, Strange Brigade, Red Dead Redemption), up to +36% (Civilization 6, Far Cry 5).\n Perhaps the most important comparison is the AMD Ryzen 9 5950X against the Intel Core i9-10900K. In our CPU limited tests, we get a +21% average FPS win for the AMD at CPU-limited scenarios, ranging from +2% to +52%. But in our 1080p Maximum settings tests, the results were on average neck-and-neck, swaying from -4% to +6%. (That result doesn’t include the one anomaly in our tests, as Civilization 6 shows a +43% win for AMD.)\n  Based on core counts and pricing, the new Ryzen 5000 series processors closely align with some of Intel’s most popular Comet Lake processors, as well as the previous generation AMD hardware.\n   Throughout this review we will be referencing these comparisons, and will eventually break-out each processor into its own analysis breakdown.\n  As this is our Deep Dive coverage into Zen 3, we are going to go into some nitty-gritty details. Over the next few pages, we will go over:\n  POST A COMMENT      Yes! All I wanted to see was on the Cache and Latency parts - the unified cache allows 6 core and 12 core setups without the penalties of having partial CCXs!  Reply\n              AMD finally has an Intel beater on its hands at least until Rocket Lake arrives. Having actual competition is going to be great computing. Nice review.  Reply\n  Very impressive. I think I&#39;m good with my 3950X until the next socket but the single thread uplift is very tempting.  Reply", "posttime": "2020-11-05 22:41:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "zen,amd", "title": "AMD Zen 3 Ryzen深潜评论：5950X、5900X、5800X和5700X测试", "title_en": "AMD Zen 3 Ryzen Deep Dive Review: 5950X, 5900X, 5800X and 5700X Tested", "transed": 1, "url": "https://www.anandtech.com/show/16214/amd-zen-3-ryzen-deep-dive-review-5950x-5900x-5800x-and-5700x-tested", "via": "", "real_tags": ["zen", "amd"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033353, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有关于使用PageSpeed Insights的具体的、可回答的问题吗？就堆栈溢出提出您的问题。要获得一般反馈和讨论，请在我们的邮件列表中创建一个帖子。", "note_en": "Have specific, answerable questions about using PageSpeed Insights? Ask your question on  Stack Overflow. For general feedback and discussion, start a thread in our  mailing list.", "posttime": "2020-11-05 22:40:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "pagespeed", "title": "新Reddit的PageSpeed洞察力", "title_en": "New Reddit’s PageSpeed Insights", "transed": 1, "url": "https://developers.google.com/speed/pagespeed/insights/?url=https%3A%2F%2Fwww.reddit.com%2F&tab=mobile", "via": "", "real_tags": ["pagespeed"]}, {"category": "", "categoryclass": "", "imagename": "f1fccd7e01156c815d97708be9aec72b.png", "infoid": 1033352, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去10年左右的时间里，我一直是Vim的铁杆用户。我是在第一份编程工作中被介绍给Vim的。对我来说，这几乎是一种瞬间的联系。我爱上了只需要一个终端就能完成工作的极简主义，以及将命令(如文字)串在一起编辑程序和文本的能力。\n我和Vim的爱情在我的整个职业生涯中一直伴随着我，直到今天仍然很强烈。当我还是一名初级发布工程师，从事小脚本工作时，Vim令人惊叹。后来，作为一名Ruby on Rails工程师，Vim仍然是一名令人惊叹的编辑。Thoughtbot、HashRocket和无数其他机构、公司和个人为Vim社区(和邪教)做出了贡献。这个社区将我的知识、安慰和理解推向了越来越远的地方。\n最后，我在终端上一起运行tmux和Vim。有了足够的插件和点文件，我开始浏览代码库。我可以非常轻松地编写测试、运行测试、重构代码和运行命令。\nVIM和TMUX..。不过，最近我们太棒了，我对Vim有点不以为然。即使有了我复杂的点文件、知识和插件设置，也感觉有些不对劲。我开始了一份新工作，从事一个大型打字反应项目。Vim无法在不崩溃的情况下打开超过50行的TSX文件。\n在过去的几年里，我尝试了编写移动应用程序。Fight and Dart--尽管有LSP支持--在我的Vim设置上运行得不是很好。在给安卓工作室一次试水之后，感觉就像是一个全新的世界。\nAndroid Studio突然改变了游戏规则，我对一切都触手可及。默认情况下，自动补全、自动格式化、代码片段和文档查找都是设置的。实际上，我对Ffltter框架的理解要好得多，因为Android Studio使深层框架代码易于调试、检查和探索。更不用说，Vim的集成非常棒。这是两全其美。我拥有令人惊叹的编辑、最小配置和Vim键绑定！\n在Vim中学习一种新的语言或框架时，我会花费数小时配置插件、处理linting和查找文档。与Android Studio一样，使用和IDE，所有这些都是在没有任何配置的情况下预先构建的。\nAndroid Studio在某种程度上让我大吃一惊。我开始对自己说，“如果这对Ffltter来说是件好事，那对我的其他项目来说难道不是很棒吗？”\n我现在几乎只为IntelliJ Idea工作。这就是JetBrains事实上的编辑器，它包含了几乎所有东西的插件：\n我工作的每一个项目--比如Reaction中的Gatsby博客、我的公司打字工作，或者Ruby on Rails方面的项目--都在这个编辑器中工作。\n我曾短暂地使用过VSCode，但在我看来，它似乎有一些我当时不喜欢Vim的缺陷。它在处理大文件时速度很慢，在处理复杂的程序和复杂的编程语言(如Tyescript和tsserver)时感觉很慢。\n我还和WebStorm有过一段很长的恋情，基本上都很棒。我确实做到了；但是，我发现只使用为几个程序设计的编辑器是很奇怪的。如果我想在WebStorm中运行Ruby on rails应用程序，我是Sol。我觉得在一台机器上运行Rubymine、WebStorm和PyCharm有点傻。如果我用所有三种语言编写代码，难道一个编辑器就不能处理它吗？\n最终，我用插件来运行IntelliJ，这些插件可以处理我可能有的任何编程需求。现在，我很开心。当然，IntelliJ有很多缺点。但我真的相信利大于弊。\n我仍然认为Vim是一位伟大的编辑，我喜欢时不时地把它说出来。但我相信在我职业生涯的这一阶段，IntelliJ的优势大于Vim的劣势。以下是我的思考过程的概述。\n在Vim中学习一种新的语言或框架时，我会花费数小时配置插件、处理linting和查找文档。\n极简主义者。你所需要的就是航站楼，仅此而已。你不需要打开多个窗口，Tmux和Vim在这方面很棒。\n让你进入这股潮流：。Vim比任何东西都能让我更好地融入“流动”。我只需要稍微移动一下手指，就可以进入/退出窗口、缓冲区、拆分等…。我特别记得当我用Vim编程时的微笑，因为有时候感觉很有趣。\n可扩展性：它已经存在很久了，Thoughtbot、HashRocket和许多社区成员都为它做出了巨大贡献。\n非常陡峭的学习曲线：Vim需要很长时间来学习，而且你永远不会停止学习它。对于像我这样更有经验的用户来说，这不是问题，但我觉得值得一提的是。\n不一致的插件：快点，告诉我Vim中最好的自动补全插件。麦酒/全脂啤酒？你完成我了吗？VimCompletesMe？DeoPlete？对于你可能有的任何任务，都有数量惊人的插件。而且并不是所有的插件都在一起玩。随着LSP的出现，这一点变得稍微好了一些；然而，我经常发现自己在玩插件以使事情更好地工作，结果却不喜欢这种设置，后来又去找另一种插件。有点文件是很好的，但是当你切换计算机/系统时，你必须为一些包安装pip3/python，为其他包安装node/npm/yer，对于某些包，你必须将CD放入安装它的目录并运行一个Makefile！(看着你，YouCompleteMe)。\n并不总是能很好地处理其他事情：我已经用Vim进行了无数次配置。Vim独立版、NeoVim版、Vim with Tmux版和MacVim/GUIVim版。它们都有长处和短处，但总有一个共同点，那就是并不是每个计算机系统都能很好地运行。尝试在Mac上的Vim上设置复制+粘贴，完成了吗？好的，太棒了！现在为Linux做这件事。为了让所有的东西都能在一起很好地发挥，有这么多的变通和技巧。当你把它设置好的时候，感觉很好，但有时会很粗糙。我发现自己一遍又一遍地阅读旧的博客帖子，以回忆我是如何在系统范围的剪贴板上设置Yank+Paste的。\n用复杂的语言(比如打字稿)编写复杂的代码库并不是很有趣：我记得我开始了一份使用打字稿的新工作，有很多工程师在处理一些非常酷的问题。获得VIM/ENV VARS/ETC…后。所有设置好后，我开始在Vim和BAM中工作，任何超过20行的文件都会冻结，而且处理起来非常慢。果不其然，我的Javascript解析器/突出显示插件(参见我上面关于插件的观点)效率低下，而且它使一切都陷入了泥潭。因此，我不得不满足于一个性能更好的较小的解析器。类似的事情也发生在更漂亮的、eslint和tsserver上。如果你需要用这些技术自动修复你的代码，那么它的代码块是读/写的。即使您的IO被阻塞的时间很短，在编写代码时也会给人一种步履蹒跚、缓慢如蜜的感觉。\n突然之间，我的一切都触手可及。默认情况下，自动补全、自动格式化、代码片段和文档查找都是设置的。\n一切都是预先配置的：您不必担心设置标签、YouCompleteMe或NERDTree。我数不清有多少次我打开了一个新项目，可能是用不同的语言，一切都开箱即用。这完全让人松了一口气。\n文件观察器很强大：在IntelliJ中有一种叫做文件观察器的东西。您可以将任意任务设置为在编辑/保存/键入文件后运行。当您有更高级的任务需要在代码库中运行时，比如对导入进行排序、运行特定的eslint规则或在保存文件后运行rubocopp，这会非常强大。\n一切都很适合你的操作系统：我不能告诉你我在一个新的操作系统上设置了Vim和tmux多少次，比如Linux。我会运行我所有的点文件，配置我错过的任何疯狂的东西。编译需要编译的插件。修复Vim/tmux/Linux(或Mac，随便什么)之间发生的任何小问题。然后我在编程，我必须复制+粘贴一些东西，BAM，我花费了4个小时在Vim/tmux/之间正确配置复制和粘贴。\n复杂的代码库和语言很容易处理：使用IntelliJ(或WebStorm)后，我的大型打字代码库的所有问题都消失了。所有内容都被正确索引、解析、突出显示和呈现。在处理复杂的代码库时很少遇到麻烦，而且异常通常比Vim更容易处理。\n复杂的界面：IntelliJ的界面有点复杂。有很多工具、下拉菜单和配置。一开始这绝对是一件令人望而生畏的事情，但一旦你习惯了，它就不是什么大问题了。\n内存使用：IntelliJ确实占用了我机器上的一些内存。不过，我相信这样的内存使用是值得的。您为索引、标记和缓存程序支付了前期费用，因此您的编辑体验就像黄油一样顺畅。VSCode和Vim(带有插件)只是懒惰地做这件事；因此，随着时间的推移，您对复杂项目的编程体验会变得非常笨拙和缓慢。\n某些任务的配置很困难：同样，随着时间的推移，您也会习惯这一点。IntelliJ的某些配置选项不太理想。例如，在为eslint设置自动格式化时，要在IntelliJ中设置文件监视器，需要经过几个步骤。不过，一旦您理解了这个概念，它就相当简单，很容易与其他工具一起使用。\n最后，我认为IntelliJ的利大于弊。我对这个平台非常满意，并期待着在未来使用它。\n如果你能走到这一步，恭喜你，你真的很了不起。我想知道；不过，你的感觉和我一样吗？我不确定是否只有我一个人有这种想法。我相信6个月后你就能找到一篇关于我如何转回Vim的帖子。但就目前而言，我真的很享受这段经历。", "note_en": "For the last 10 years or so, I have been a die-hard Vim user. I was introduced to Vim on my first programming job. It was almost an instant connection for me. I fell in love with the minimalism of only needing a terminal to do work; and the power of stringing together commands, like words, to edit programs and text.\n The love affair I have with Vim stuck with me throughout my career and remains strong to this very day. When I was a junior-level release engineer, working on small scripts, Vim was amazing. Later, working as a Ruby on Rails Engineer, Vim was still an amazing editor. Thoughtbot, Hashrocket, and countless other agencies, companies, and individuals contributed to the community (and cult) of Vim. That community pushed my knowledge, comfort, and understanding further and further.\n Eventually, I was running tmux and Vim together in the terminal. With sufficient plugins and dotfiles, I was CRUISING through codebases. I could write tests, run them, refactor code, and run commands with absolute ease.\n    Vim and tmux... were so amazing   Lately, though, I have been feeling a little underwhelmed by Vim. Even with my sophisticated dotfiles, knowledge, and Plugin setup; something felt off. I started a new job working on a large typescript React project. Vim couldn’t handle opening a TSX file larger than 50 lines without crashing.\n Within the last few years, I tried my hand at programming mobile applications. Flutter and Dart — although supported by an LSP — was not running very well on my Vim setup. After giving Android Studio a shot with Flutter, it felt like a whole new world.\n     Android Studio was a game changer  All of a sudden, I had everything at my fingertips. Auto completion, Auto formatting, snippets, and documentation lookup was all set  By Default. I actually understood the Flutter framework much better because Android Studio made deep framework code easy to debug, inspect, and explore. Not to mention, the Vim integration was  fantastic. This was the best of both worlds. I had amazing editing, minimal configuration, and Vim keybindings!\n When picking up a new language or framework in Vim, I would spend hours configuring plugins, dealing with linting, and looking up documentation. With and IDE like Android Studio, all of this came pre-built without any configuration.\n Android Studio was something of a revelation for me. I began thinking to myself, “If this is so great for Flutter, wouldn’t this be great for my other projects?“.\n  I am now working almost exclusively on IntelliJ IDEA. It is the JetBrains defacto editor that includes plugins for almost anything:\n  Every project I work on — like this Gatsby blog in React, my corporate Typescript React job, or my Ruby on Rails side projects — All work within this one editor.\n I had a brief stint with VSCode but, to me, it appeared to have the same flaws I disliked with Vim at the time. It was slow with large files, and it felt sluggish with complicated programs and complicated programming languages (like typescript and tsserver).\n I also had a long affair with WebStorm, which was mostly great. I did; however, find it odd to be using an editor  ONLY made for a few programs. If I wanted to run a Ruby on Rails app in Webstorm, I was SOL. I thought it was a little silly to run RubyMine, Webstorm, and Pycharm on one machine. If I wrote code in all three languages, shouldn’t one editor be able to handle it?\n Eventually I wound up running IntelliJ with plugins that handle any programming need I may have. And for now, I am very happy. There are, of course, many cons with IntelliJ. But I truly believe the Pros outweigh the Cons.\n  I still think Vim is a great editor and I love to break it out every once in a while. But I believe the pros of IntelliJ outweigh the cons of Vim at this point in my career. Here is an overview of my thought process.\n  When picking up a new language or framework in Vim, I would spend hours configuring plugins, dealing with linting, and looking up documentation.\n  Minimalist. All you need is the terminal, and that is it. You don’t need to open multiple windows, Tmux and Vim together were  awesome for this.\n Gets you into the Flow: . Vim  gets me into “The Flow” better than anything. I just need to move my fingers a bit, and I’m in/out of windows, buffers, splits, etc… I specifically remember smiling when I was coding with Vim, because it just felt so fun sometimes.\n Extensible: It’s been around forever, Thoughtbot, Hashrocket, and many community members contributed greatly to it.\n  Very steep learning curve: Vim takes a long time to learn, and you’ll never stop learning it. This is not a problem with more experienced users like myself, but I thought it was worth mentioning.\n Inconsistent Plugins: Quick, tell me the best plugin for auto-completion in Vim. ALE/Omnicomplete? YouCompleteMe? VimCompletesMe? DeoPlete? There is an insane number of plugins for any task you may have. And not all plugins play together. This has become slightly better with the emergence of LSPs; however, I constantly find myself playing with plugins to make things work better, only to dislike the setup and go for another mix of plugins later. Having dot files are nice, but when you switch computers/systems, you have to install pip3/python for some packages, node/npm/yarn for others, and for some, you’ll have to cd into the dir where its installed and run a makefile! (looking at you, YouCompleteMe)\n Doesn’t always play nice with everything else: I have had countless configurations with Vim. Vim standalone, NeoVim, Vim with Tmux, and MacVim/GUIVim. They all have strengths and weaknesses, but there is always one thing in common, it doesn’t play very well with every computer system. Try to set up copy+paste on Vim on a Mac, done? Ok great! Now do it for Linux. There are so many workarounds and hacks to get everything to play well together. When you get it set up, its nice, but sometimes its rough. I find myself reading old blog posts to remember how I set up yank + paste on my system-wide clipboard over and over.\n Isn’t very fun with complex codebases in complicated languages (like typescript): I remember starting a new job that used typescript, and there were a lot of engineers working on some really cool problems. After getting Vim/ ENV vars/ etc… all set up, I go to start woking in Vim and  BAM, any file over 20 lines freezes and its incredibly slow to work with. Sure enough, my javascript parser/highlighting plugin (see my point above about plugins) was not efficient, and it was bogging down everything. So I had to settle for a lesser parser that performed better. A similar thing happens with prettier, eslint, and tsserver. If you need your code to be auto-fixed with these technologies, its blocks read/write. Even when your IO is blocked for only a short amount of time, it makes for a trudging, slow-as-molasses feeling when writing code.\n  All of a sudden, I had everything at my fingertips. Auto completion, Auto formatting, snippets, and documentation lookup was all set  By Default.\n  Everything is pre-configured: You don’t have to worry about setting up tags, or YouCompleteMe, or NERDTree. I can’t tell you how many times I open a new project, perhaps in a different language, and everything works great out of the box. It’s a total sigh of relief.\n File watchers are powerful: There is a thing in IntelliJ called file watchers. You can set arbitrary tasks to run after you edit/save/type in a file. This can be super powerful when you have more advanced tasks you need to run in your codebase like: sorting imports, running specific eslint rules, or running rubocop after saving a file.\n Everything plays nicely with your OS: I can’t tell you how many times I set up Vim and tmux on a new OS, like linux. I’ll run all my dot files, configure anything crazy I missed. Compile the plugins that need compilation. Fix any small issues that happen between Vim/tmux/linux (or Mac, whatever). Then I’m programming, and I have to copy+paste something, and BAM, I lose 4 hours configuring copy and paste correctly between Vim/tmux/\n Complicated codebases and languages are handled easily: After using IntelliJ (or Webstorm), all my problems with my large Typescript codebase went away. Everything gets indexed, parsed, highlighted, and rendered correctly. There are very few hangups when working with complicated codebases, and the exceptions are usually much easier to deal with than with Vim.\n  Complicated Interface: The interface to IntelliJ is somewhat, complicated. There are a lot of tools, dropdown menus, and configurations. This is definitely a daunting thing at first, but once you get used to it, its not a big problem at all.\n Memory Usage: IntelliJ does eat up a bit of RAM on my machines. I believe this memory usage is worth it though. You’re paying an upfront price to index, tag, and cache programs, so your editing experience is smooth as butter. VSCode and Vim (with plugins) only do this lazily; therefore, your programming experience with complicated projects becomes very awkward and slow over time.\n Difficult configuration for some tasks: Again, this is something you get used to with time. Some configuration options with IntelliJ are less than ideal. For example, when setting up auto-formatting for eslint, you have to go through a couple hoops to set up a file watcher in IntelliJ. Once you understand this concept though, its fairly straightforward and easy to use with other tools.\n In the end, I have decided that the pros for IntelliJ greatly outweigh the cons. I have been really happy with the platform and look forward to using it in the future.\n If you’ve made it this far, congrats, you’re really amazing. I wonder; though, are you feeling the same way I was? I am not sure I’m alone in this thinking or not. I’m sure in 6 months you can find a post about how I switched back to Vim. But for now, I’m really enjoying this experience.", "posttime": "2020-11-05 22:39:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "切换,vim", "title": "从Vim切换到IntelliJ", "title_en": "Switching from Vim to Intellij", "transed": 1, "url": "https://browntreelabs.com/from-vim-to-intellij/", "via": "", "real_tags": ["切换", "vim"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033351, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们依赖您的支持：本网站主要依靠广告支持。广告使这个网站得以维持了16年之久。我们尽最大努力确保只显示干净、相关的广告，当检测到任何令人讨厌的广告时，我们会尽快将其删除。如果你想浏览没有广告的网站，同时仍然支持我们的工作，请考虑我们的无广告Phoronix溢价。你也可以考虑通过贝宝(PayPal)支付小费。AMD Ryzen 9 5900X和Ryzen 9 5950X无疑是令人难以置信的赢家。虽然处理器公司的营销声明有时令人怀疑，而且不一定与Linux用户及其开源工作负载/软件相关，但在过去几周对Ryzen 9 5900X和5950X进行测试后，性能令人难以置信地令人信服，与Zen 2相比，单线程和多线程性能都有了显著提升，并轻松击败了英特尔目前的台式机产品，在发布当天进行了200多次基准测试。\nZen 3上个月发布时看起来不错，但在Ryzen 9 5900X和5950X上运行了广泛的Linux基准测试后，我会将其归类为非常好，甚至在许多领域都非常好。IPC的提升当然是存在的，缓存的改进和其他架构增强确实带来了巨大的回报。对于单线程Linux工作负载，Ryzen 9 5900系列现在几乎所有的工作负载都领先于英特尔，利润率相当可观，并且比Ryzen 3000系列有了很大的升级。\n但在谈到这些激动人心的Linux数字之前，我们先从Linux的角度更广泛地介绍一下Ryzen 5000系列/Zen 3。\nAMD的私人简报会确认支持控制流执行技术(CET)的Zen 3以及内存保护密钥(MPK)和AVX2 Vaes/VPCLMULQD的新指令是这一代处理器的新指令。自从AMD发布了针对GNU Binutils的znver3补丁后，我们就知道了Zen 3的新指令。Binutils补丁在10月份才发布，不幸的是，在撰写本文时，AMD还没有为LLVM/Clang或GCC编译器提供任何补丁，这些补丁的目标是启用受Zen 3支持的这些新指令或任何优化的调度器模型等。看起来很快就会发布补丁，但不幸的是，他们等到发布后才提供对Znver3编译器的支持。\n众所周知，英特尔经常提前数年提供他们的编译器/工具链支持，在过去的一些发布中，AMD也提前准备了他们的编译器支持。但在这种情况下，Znver3要等到产品发布后才会推出。反过来，在GCC 11和LLVM/Clang 12都将在3~4月发布之前，我们很可能不会看到优化的Znver3编译器支持。或者AMD可能很快就会发布他们自己的AOCC编译器更新，支持LLVM znver3。但在寻找主要Linux发行版现成使用的这些编译器方面，对于像Ubuntu这样要到2021年下半年才会出现的编译器来说，由于Zen 3、编译器的发布联盟，以及大多数发行版供应商在转向主要编译器更新方面的节奏感，Ubuntu等现在不会出现这种情况。因此，希望在Zen 4及以后的版本中，我们能看到AMD推出其编译器支持的最佳时机。\n诚然，对大多数用户来说，不合时宜的Znver3支持并不是太紧迫。除了对GCC和LLVM/Clang尚未合并的Znver3的失望之外，Linux对Ryzen 5000系列的支持应该还不错。特别是在没有新的芯片组和现有的支持Zen 3的主板的情况下，从Linux的角度来看，就没有那么多需要担心的了。有了Ryzen 95900X和5950X，我没有遇到任何其他奇怪的问题，就像之前一些关于四轮马车RdRand的问题或其他发布怪癖。\n唯一需要指出的是，如果你是一个调整或超频的人，你应该得到更多的狂热支持者的支持。Linux 5.10内核提供了对Zen 3CPU的温度监控支持。如果您喜欢在运行期间监控CPU温度，那么下个月Linux 5.10稳定版将提供对k10temp的支持。如果您想监控CPU包的功耗，遗憾的是，今年引入内核的amd_Energy Linux驱动程序目前不支持Zen 3桌面CPU，在Linux5.10中也不支持。因此，如果想要监控CPU功耗，这是一个未知的等待游戏，但希望能在2021年初发布内核。\n在这次发布日的测试中，我一直在使用带有Linux5.9的Ubuntu 20.04LTS。其他发行版的测试、内核比较和其他软件调优乐趣将在适当的时候到来。通过Phoronix测试套件已经完成了200多个基准测试，而且很快还会有更多的测试。", "note_en": "We Rely On Your Support: This site is primarily supported by advertisements.  Ads are what have allowed this site to be maintained for the past 16 years. We do our best to ensure only clean, relevant ads are shown, when any nasty ads are detected, we work to remove them ASAP. If you would like to view the site without ads while still supporting our work,  please consider  our ad-free Phoronix Premium. You can also consider  a tip via PayPal.   The AMD Ryzen 9 5900X and Ryzen 9 5950X are hands-down incredible winners. While processor company marketing claims are sometimes dubious and not necessarily relevant to Linux users and their open-source workloads/software, after testing the Ryzen 9 5900X and 5950X the past several weeks the performance has been incredibly compelling with significant single and multi-threaded performance uplift over Zen 2 and easily thrashing Intel&#39;s current desktop offerings with over 200 benchmarks conducted for launch-day.\n    Zen 3 when revealed last month looked  good, but after running extensive Linux benchmarks with the Ryzen 9 5900X and 5950X I would classify it as  very good or even exceptionally good in many areas. The IPC uplift is certainly there and the cache improvements and other architectural enhancements are indeed paying off big time. For single-threaded Linux workloads, the Ryzen 9 5900 series is leading over Intel now in nearly all of the workloads by healthy margins and a big upgrade over the Ryzen 3000 series.\n    But before getting to these exciting Linux figures a few words more broadly on the Ryzen 5000 series / Zen 3 from the Linux perspective.\n    The private AMD briefings did confirm Zen 3 supporting Control-Flow Enforcement Technology (CET) and new instructions of memory protection keys (MPK) and AVX2 VAES/VPCLMULQD as the new instructions with this generation of processors. We have known of the new instructions for Zen 3 since AMD sent out  the znver3 patch for GNU Binutils. That Binutils patch only came out in October while as of writing AMD unfortunately hasn&#39;t provided any patches to the LLVM/Clang or GCC compilers for the &#34;znver3&#34; target for enabling these new instructions supported by Zen 3 or any optimized scheduler model, etc. It&#39;s looking like that will come imminently, but unfortunate they have waited until launch to provide the znver3 compiler support.\n    Intel is known for providing their compiler/toolchain support often years in advance and for some past launches AMD has also prepped their compiler support ahead of time. But in this case Znver3 isn&#39;t coming until after the product launch. In turn we likely won&#39;t see the optimized Znver3 compiler support until GCC 11 and LLVM/Clang 12 that will both be out in the March~April timeframe. Or AMD will presumably issue their own AOCC compiler update soon with their LLVM znver3 support. But in terms of finding these compilers used out-of-the-box by major Linux distributions, for the likes of Ubuntu that won&#39;t be now until the second half of 2021 due to the release alignment of Zen 3, the compilers, and the cadence for most distribution vendors in being conservative in moving to major compiler updates. So hopefully for Zen 4 and beyond we&#39;ll see more optimal timing of AMD pushing out their compiler support.\n    Granted, the untimely Znver3 support isn&#39;t too pressing for a majority of users. Aside from the let down of Znver3 not yet merged for GCC and LLVM/Clang, the Linux support for the Ryzen 5000 series should be in good standing. Particularly with no new chipsets and existing motherboards supporting Zen 3, there isn&#39;t as much to worry about from the Linux perspective. With the Ryzen 9 5900X and 5950X I didn&#39;t encounter any other odd issues like with some previous issues around buggy RdRand or other launch quirks.\n    The only other caveat to point out is for more of the enthusiast support if you are a tweaker or overclocker.  The temperature monitoring support for Zen 3 CPUs is coming with the Linux 5.10 kernel. If you like monitoring your CPU temperatures during operation, that support in k10temp is coming next month with Linux 5.10 stable. If you are wanting to monitor your CPU package power consumption, sadly, the amd_energy Linux driver introduced this year to the kernel does not currently support the Zen 3 desktop CPUs nor is in Linux 5.10... So that is an unknown waiting game if wanting to monitor your CPU power consumption but hopefully will come to a kernel release in early 2021.\n    For this launch-day testing I have been using Ubuntu 20.04 LTS with Linux 5.9. Tests on other distributions and kernel comparisons and other software tuning fun will come in due course. More than two hundred benchmarks were completed via the  Phoronix Test Suite and even more tests are coming soon.", "posttime": "2020-11-05 22:34:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,占据,amd,支持", "title": "AMD Ryzen 9 5900X和Ryzen 9 5950X在Linux上占据主导地位", "title_en": "AMD Ryzen 9 5900X and Ryzen 9 5950X Dominate On Linux", "transed": 1, "url": "https://www.phoronix.com/vr.php?view=29687", "via": "", "real_tags": ["linux", "占据", "amd", "支持"]}, {"category": "", "categoryclass": "", "imagename": "3d945593140cf74ef13d290d0dd11a1c.jpg", "infoid": 1033350, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对许多人来说，蜜蜂象征着繁荣、可持续发展和环保主义。但作为一名蜜蜂研究人员，我必须告诉你，只有清单上的第一项是可以辩护的。尽管蜜蜂对农业很重要，但它们也会与本土蜜蜂竞争，从而破坏自然生态系统的稳定--其中一些蜜蜂是濒危物种。\n养蜂爱好现在已成为数十万美国人的一种时尚活动，在此之前，人们发起了强烈的“拯救蜜蜂”意识运动。但作为一个物种，蜜蜂最不需要拯救。与本地传粉者相比，媒体对它们的关注不成比例，而且模糊的信息让许多公民--包括我在内--相信，他们戴上养蜂人的面纱是在为环境做好事。不幸的是，他们可能弊大于利。\n加拿大多伦多约克大学(York University)助理教授兼保护生物学家希拉·科拉(Sheila Colla)说：“养蜂是为人类服务的；这不是一种保护做法。”人们错误地认为饲养蜜蜂或帮助蜜蜂在某种程度上帮助了濒临灭绝的本土蜜蜂。\n科拉最近发表了一份针对安大略省授粉者健康行动计划草案的公民提交的近1000条评论的分析报告，该计划涉及一项更严格的新烟碱类杀虫剂监管计划。尽管公众对蜜蜂和授粉有浓厚的兴趣，并强烈支持更严格的杀虫剂法规，但科拉和她的同事们发现，公民对传粉者的多样性及其在授粉中的作用的了解令人惊讶地贫乏。\n科拉说：“对霓虹灯(一种杀虫剂)和蜜蜂的关注使大量资源无法保护野生传粉者免受它们最重要的威胁。”她有理由对人们对拯救蜜蜂的不当关注感到沮丧，因为从自然资源保护者的角度来看，本地蜜蜂更需要支持。\n虽然以蜜蜂为中心的企业经常支持有利于本地蜜蜂的倡议，如开发蜜蜂友好型栖息地，但与直接将资金用于这些倡议所能达到的效果相比，财政贡献相形见绌。科拉解释说：“养蜂公司和各种非科学项目都从本土传粉者的减少中获得了经济上的好处。”“因此，这些资源并没有分配到人们真正关心的问题上。”\n出于某种原因，也许是因为蜜蜂体型较小，它们通常不被视为分布广泛的家畜动物。北美有数百万蜂群，其中280万在美国。每个蜂群大约有3万只蜜蜂(相当于一个授粉单位的大小)，仅在加拿大和美国就大约有10亿只蜜蜂-几乎是人口的三倍。\n蜜蜂群体的高密度增加了本地传粉者之间对饲料的竞争，给已经在衰落的野生物种带来了更大的压力。蜜蜂是极端多才多艺的觅食者，垄断花卉资源，从而导致掠夺性竞争--也就是说，一个物种耗尽了一种资源，没有留下足够的资源供其使用。\n但是，确定蜜蜂对自然生态系统的影响需要进行实证测试。例如，本地蜜蜂不同的觅食习惯--例如，它们一天中活动时间的不同或喜好的植物--可能会导致几乎没有有效的竞争。然而，蜜蜂是如此无处不在，以至于很难准确测试它们的引入以及随后的资源垄断对生态系统网络的影响。\n但对加那利群岛来说，情况并非如此。分别来自特内里费岛和塞维利亚的西班牙国家研究委员会的研究人员阿尔弗雷多·瓦利多和佩德罗·乔丹诺看到了一个机会，可以利用这些岛屿--非洲西北海岸外的一个西班牙群岛--来研究蜜蜂的引入对当地授粉社区的影响。\n在这些岛屿的泰德国家公园(Teide National Park)的高地上，数以千计的蜜蜂群体被季节性地引入蜂蜜生产，并在花蜜流结束时再次被移走，这为实验创造了一个极好的场景。他们的研究结果发表在《科学报告》(Science Reports)上，并没有让蜜蜂看起来像他们已经成为的可持续发展名人。\n蜜蜂的引入降低了植物-传粉者网络的连通性。衡量生态系统弹性的两个指标--嵌套性和模块化也有所下降。虽然一些植物品种的座果率较高，但在靠近根尖的地方采样的水果只含有败育的种子。“蜂箱的影响是如此巨大，”瓦利多说，“你可以在蜂箱安装后的第二天就察觉到植物和传粉者之间的干扰。”\n瓦利多解释说：“通过引入数十或数百个蜂箱，蜜蜂的相对密度比野生本地授粉者成倍增加。”这导致觅食范围内的花卉资源--花粉和花蜜--急剧减少。乔达诺说：“养蜂对生物多样性的负面影响似乎比之前认为的更普遍、更负面。”\nValido和Jordan ano怀疑，他们在加那利群岛上的发现普遍适用于引入蜜蜂的其他生态系统，但他们指出，在其他地方养蜂的具体影响可能有所不同。\n事实上，蜜蜂并不总是传粉者网络中的头号竞争者：它们是否成功地击败了本地蜜蜂取决于其他因素。例如，英国苏塞克斯大学(University Of Sussex)的尼古拉斯·巴尔福(Nicholas Balfour)和他的同事们发现，本土大黄蜂在熏衣草管状花上是更好的竞争者，部分原因是它们的鼻子(舌头)更长。\n在其他生态系统中，蜜蜂似乎没有加那利群岛那么有影响力。在巴塔哥尼亚北部引进后，外来大黄蜂和蜜蜂取代本地蜜蜂成为最频繁的访花蜜蜂，但这对本地蜜蜂的实际访问率没有影响。\n虽然每个生态系统都有自己的怪癖--有不同的传粉者和参与传粉的植物--但在离家更近的地方进行的传粉网络研究往往与加那利群岛的研究结果一致。科拉说：“北美有研究表明蜜蜂破坏了授粉系统。”“蜜蜂在给某些杂草物种授粉方面也非常有效，这会改变整个植物群落。”\n许多杂草物种也是入侵物种，包括苏格兰扫帚、蒲公英、喜马拉雅黑莓和日本虎杖等。养蜂人暗地里喜欢入侵植物。它们的密集繁殖提供了利润丰厚和可预测的花蜜流动--这对蜜蜂和养蜂人来说是完美的利用--但这些植物也破坏了当地的生态系统。\n即使有了这种饲料的增加，有时仍然不足以在蜜蜂中四处走动，更不用说本地蜜蜂了。在加拿大温哥华周围较低的大陆，我养了一个小型的研究蜂箱，里面有15到20个蜂箱。这是我第一年在高密度地区建立研究基地，我从未如此费力地让我的蜜蜂存活下来。\n蜂巢里布满了疾病。我甚至安乐死了一个蜂群，症状符合美国污育标准，因为这是蜜蜂面临的最具破坏性、最具传染性的疾病之一。尽管在季节开始时完全没有瓦罗亚破坏者(一种毁灭性的寄生螨类)，但到夏末，这些蜂箱需要进行杀螨剂治疗。殖民地也没有生产出一批蜂蜜。\n一些地方的群体密度变得过高，助长了疾病的传播，并加剧了营养不良的问题。如果让我的蜜蜂保持健康真的这么难，我不确定我能不能忍受想到野生蜜蜂。\n但想一想，我们必须这样做。我曾经相信蜜蜂是一种门户物种，对它们健康和繁荣的担忧会蔓延到本地蜜蜂身上，也会让它们受益。虽然这在某些情况下可能会发生，但越来越多的证据表明，对蜜蜂的错误热情很可能损害了本土蜜蜂。养蜂不再让我感觉好了。事实上，情况恰恰相反。", "note_en": "To many people, honey bees symbolize prosperity, sustainability and environmentalism. But as a honey bee researcher, I have to tell you that only the first item on that list is defensible. Although they are important for agriculture, honey bees also destabilize natural ecosystems by competing with native bees—some of which are species at risk.\n  The  rise in hobby beekeeping, now a trendy activity for  hundreds of thousands of Americans, followed strong awareness campaigns to “save the bees.” But as a species, honey bees are least in need of saving. Media attention  disproportionately covers them over native pollinators, and murky messaging has led many citizens—myself once included—to believe they are doing a good thing for the environment by putting on a beekeeper’s veil. Unfortunately, they are probably doing more harm than good.\n  “Beekeeping is for people; it&#39;s not a conservation practice,” says Sheila Colla, an assistant professor and conservation biologist at Toronto’s York University, Canada. “People mistakenly think keeping honey bees, or helping honey bees, is somehow helping the native bees, which are at risk of extinction.&#34;\n  Colla  recently published an analysis of nearly a thousand comments submitted by citizens in response to Ontario’s draft  Pollinator Health Action Plan—a proposal that involved a plan for stricter neonicotinoid pesticide regulations. Despite intense public interest in bees and pollination and strong support of tighter pesticide regulations, Colla and her colleagues found that citizens had a surprisingly poor understanding of the diversity of pollinators and their roles in pollination.\n  “The focus on neonics [a kind of pesticide] and honey bees has taken a ton of resources away from conserving wild pollinators from their most important threats,” Colla says. She is justifiably frustrated at the misappropriated attention on saving honey bees when, from a conservationist’s point of view, native bees are the ones in more dire need of support.\n  And while honey bee–centric businesses often support initiatives that benefit native bees, such as developing bee-friendly habitat, the financial contributions pale in comparison to what could be achieved if funds were applied to these initiatives directly. “Beekeeping companies and various non-science-based initiatives have financially benefitted from the decline of native pollinators,” Colla explains. “These resources thus were not allocated to the actual issue people are concerned about.”\n  For some reason, maybe because they are small, honey bees are not generally viewed as the massively distributed livestock animal that they are. There are millions of honey bee colonies in North America,  2.8 million of which are in the U.S. Approximating around 30,000 bees per colony (the size of a  pollination unit), that’s roughly a billion honey bees in Canada and the U.S. alone—almost triple the number of people.\n  High densities of honey bee colonies increase competition between native pollinators for forage, putting even more pressure on the wild species that are already in decline. Honey bees are extreme generalist foragers and monopolize floral resources, thus leading to exploitative competition—that is, where one species uses up a resource, not leaving enough to go around.\n  But determining honey bees&#39; influence on natural ecosystems requires empirical testing. It is possible, for example, that alternate foraging habits of native bees—differences in their active times of day or preferred plants, for example—could lead to little effective competition. Honey bees are so ubiquitous, though, that it has been hard to test exactly how their introduction, and subsequent resource monopolization, affects ecosystem networks.\n  Not so for the Canary Islands. Alfredo Valido and Pedro Jordano, researchers from the Spanish National Research Council in Tenerife and Sevilla, respectively, saw an opportunity to use these islands—a Spanish archipelago off the northwestern coast of Africa—to study how the introduction of honey bees affects the native pollinating community.\n  In the highlands of the islands’ Teide National Park, thousands of honey bee colonies are introduced seasonally for honey production and removed again at the end of the nectar flow, creating an excellent scenario for experimentation. Their results, published in   Scientific Reports, do not make honey bees look like the sustainability celebrities they have become.\n  Bringing in honey bees reduced the connectedness of the plant-pollinator networks. Nestedness and modularity, two indicators of ecosystem resilience, also declined. While some plant species enjoyed higher fruit set, fruits sampled nearest the apiaries contained only aborted seeds. “The impact of the beehives is so dramatic,” says Valido, “You can detect disruption between plants and pollinators just the day after beehive installation.”\n  “By introducing tens or hundreds of beehives, the relative density of honey bees increases exponentially compared with wild native pollinators,” Valido explains. This causes a drastic reduction of flower resources—pollen and nectar—within the foraging range. “Beekeeping appears to have more pervasive, negative impacts on biodiversity than it was previously assumed,” says Jordano.\n  Valido and Jordano suspect that their findings on the Canary Islands are generally applicable to other ecosystems where honey bees are introduced, but they note that the specific impact of beekeeping in other locations may differ.\n  Indeed, honey bees are not always the top competitor in a pollinator network: Whether they succeed at outcompeting the native bees depends on other factors. For example, Nicholas Balfour and his colleagues at the University of Sussex, England,  found that native bumble bees were superior competitors on the tubular flowers of lavender, owing in part to their longer proboscis (tongue).\n  In still  other ecosystems, honey bees appear not to be as influential as in the Canary Islands. After introduction in northern Patagonia, nonnative bumble bees and honey bees overtook the native bees as the most frequent floral visitors, but this had no effect on the native bees’ actual visitation rates.\n  While every ecosystem has its own quirks—with different pollinator players and participating plants—pollination network studies conducted closer to home tend to agree with the findings in the Canary Islands. “There have been studies in North America showing pollination system disruptions by honey bees,” says Colla. “Honey bees also are very effective at pollinating certain weedy species, which changes the overall plant communities.”\n  Many of those weedy species are also invasive, including Scotch broom, dandelions, Himalayan blackberry and Japanese knotweed, among others. And beekeepers secretly love invasive plants. Their intense proliferation provides a lucrative and predictable nectar flow—perfect for the honey bees, and beekeepers, to capitalize on—but the plants, too, disrupt native ecosystems.\n  Even with this boost of forage, there is sometimes still not enough to go around amongst honey bees, let alone native bees. In the lower mainland surrounding Vancouver, Canada, I kept a small research apiary with 15–20 hives. It was my first year keeping research colonies in a high-density area, and I have never struggled so much to keep my bees alive.\n  The hives were riddled with diseases. I even euthanized one colony with symptoms of American foulbrood—standard protocol, as it’s one of the most destructive, contagious diseases that honey bees face. Despite being entirely free of  Varroa destructor—a devastating parasitic mite—at the start of the season, the hives required miticide treatments by late summer. And the colonies did not produce a crop of honey.\n  Colony densities in some locations have become too high, facilitating the spread of disease and exacerbating problems with poor nutrition. If it was this hard to keep my honey bees healthy, I’m not sure I can bear to think about the wild bees.\n  But think about them, we must. I used to believe that honey bees were a gateway species, and that concern over their health and prosperity would spill over onto native bees, benefitting them, too. While this may have happened in some cases, evidence is mounting that misguided enthusiasm for honey bees has likely been to the native bees’ detriment. Beekeeping doesn’t make me feel good, anymore. In fact, quite the opposite.", "posttime": "2020-11-05 22:14:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "蜜蜂,honey", "title": "蜜蜂的问题", "title_en": "The Problem with Honey Bees", "transed": 1, "url": "https://www.scientificamerican.com/article/the-problem-with-honey-bees/", "via": "", "real_tags": ["蜜蜂", "honey"]}, {"category": "", "categoryclass": "", "imagename": "858108b2c01ecbd5609900c3ed02db27.jpg", "infoid": 1033349, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个月前，AMD宣布推出Zen 3桌面CPU架构。该声明包括新的AMD内部基准，这意味着英特尔已经失去了最后一个台式机性能奖杯-纯单线程性能。\n上周，ARS拿到了新CPU阵容中两款最高端机型的样品--售价800美元的16核/32线程Ryzen 9 5950X和售价550美元的12核/24线程Ryzen 9 5900X。我们可以证实AMD的大多数基准测试结果--IPC在单线程和多线程性能方面全面提升，几乎在所有方面都完美无缺地击败了英特尔。\n我们对AMD的说法唯一的吹毛求疵是关于功耗，而不是性能--公平地说，这几乎肯定不是AMD的错。该系统的桌面空闲功耗增加了约10W，但这一增加影响了我们较旧的Ryzen 9 3900XT CPU，以及两个新的Zen 3部件。了解到这一点，我们预计这一增长来自我们不得不在ROG十字准线VIII英雄主板上执行的强制性BIOS升级，而不是新的CPU本身。\n无论你选择哪种多线程基准测试，你都会看到这些部分之间熟悉的关系--AMD一代又一代地获得了可观的性能提升，而英特尔则明显落后。\n和往常一样，这些差异在Passmark中被放大得最多，在Geekbench中被放大得最小--但它们不容忽视，英特尔日益老龄化的i9-10900K开始显得非常尴尬。如果英特尔不想抢占市场份额，那么它的下一代游戏CPU将需要出人意料地出人意料，因为AMD不仅要发布速度更快的CPU，还要更频繁地发布新版本。\n我们的单线程测试有力地证实了AMD在Zen 3发布时的说法--英特尔主导单线程基准测试的日子已经结束了，至少目前是这样。我们的所有三个单线程基准测试都显示，两款新的Zen 3 CPU在英特尔最高性能的单线程i9-10900K CPU上遥遥领先。\n一如既往，我们告诫大多数人不要对纯粹的单线程结果过于兴奋-多线程性能并不等同于单线程乘以活动线程的数量，其他线程上的重大活动将降低您在此处看到的性能水平。\n也就是说，单线程性能在游戏机设置中可能更加重要，在游戏控制台设置中，CPU活动可以比通常在台式PC中受到更严格的控制。Zen 3在这方面的巨大进步并没有给PlayStation 5或Xbox Series X带来帮助--这两款产品都将采用基于较旧Zen 2架构的处理器--但我们怀疑，索尼和微软都不会后悔支持Team Red的决定。\n3DMark针对游戏的CPU测试证实了我们已经从通用基准测试中看到的结果--AMD的Zen 3架构并没有向英特尔让出任何东西。Time Spy Extreme--模拟4k游戏性能，可以利用比Time Spy更多的内核和更高级的CPU指令--在5900X和5950X上遥遥领先于老款3900XT和英特尔i9-10900K。\n更简单、非极端的Time Spy基准测试可能更适合于高达1440便士的游戏，英特尔在这方面的表现要好得多，与5950X和5900X的表现基本持平，略高于老款的3900XT。即使在分辨率较低的情况下，i9-10900K的游戏性能也不太可能比AMD部件更好--但如果你在预算有限的情况下，发现英特尔部件真的很划算，而且不在乎4K游戏，它也不会影响你的帧速率。\n不幸的是，i9-10900K会让你受伤的地方是发热量和耗电量。无论是旧的还是新的Ryzen 9 CPU，英特尔CPU的耗电量和发热量都比旧的和新的Ryzen 9 CPU多100W。\n我们的测试结果在很大程度上印证了AMD声称的Zen 3提高了能效的说法-尽管Ryzen 9 5950X的时钟频率提高了200 MHz，内核和线程增加了25%，但在负载下消耗的电力比上一代Ryzen 3900XT略低。实际上，5950X的功耗比5900X略低，但我们怀疑这是单个CPU的怪癖，而不是不同型号之间的总体差异。\n我们发现台式机的空闲功耗有了相当大的增长，从53W增加到64W--但这一增长似乎并不是CPU本身造成的。为了支持两个新的CPU，我们需要用尚未公开发售的全新BIOS来刷新我们的ROG十字准线VIII英雄主板。在注意到桌面空闲功耗的增加后，我们换回了Ryzen 9 3900XT，发现该处理器的功耗增幅更大。\n我们怀疑，空闲功耗的增加将在未来公开提供的BIOS版本中得到解决。我们还怀疑，想要Ryzen 9或酷睿i9 CPU的人中，很少有人会对53W和64W之间的差异感到困扰。\nAMD的新台式机处理器阵容是一个相当直截了当的故事-该公司承诺在不牺牲效率的情况下提高多线程和单线程性能，然后兑现了这些承诺。\n从3900XT开始，AMD决定不为OEM冷却器提供Ryzen 9部件-该公司坚持这一决定，推出了新的5900X和5950X。虽然一些读者抱怨这里的不足，但AMD声称，数据显示，无论如何，在这个处理器级别的客户中，很少有人坚持使用OEM冷却器，以证明这一点是合理的。在这一点上，我们认为没有理由怀疑AMD。\n随着这些新的Zen 3处理器的发布，英特尔的粉丝们失去了他们最后一个吹嘘的权利-单线程性能。英特尔现在在性能、能效、甚至台式机CPU的发布数量上都落后于AMD-它的上一款游戏CPU是5月份发布的i9-10900K。AMD现在提前了两个版本，7月份发布了3900X和3900XT，今天发布了5900X和5950X。\n与此同时，英特尔的下一代火箭湖预计要到2021年的某个时候才会出现-人们普遍预计它将继续使用英特尔的14纳米制程，尽管它使用的是从10纳米阳光湾架构移植的功能。我们还预计火箭湖将只有8个核心，而彗星湖有10个核心。\n英特尔最新的老虎湖移动处理器尽管内核数量也很低，但表现出色，火箭湖也有可能在明年取得类似的成功--但我们并不是很看好这一点。(注：英特尔最新推出的Tiger Lake移动处理器内核数量也很低，但也有可能在明年取得类似的成功，但我们对此并不抱太大希望)。我们怀疑英特尔在台式机上的艰难时期不会很快结束。", "note_en": "A month ago, AMD  announced the arrival of the Zen 3 desktop CPU architecture. The announcement included new AMD internal benchmarks that implied Intel had lost its last desktop performance trophy—pure single-threaded performance.\n Last week, Ars got samples of the two highest-end models in the new CPU lineup—the $800, 16-core/32-thread Ryzen 9 5950X, and the $550 12-core/24-thread Ryzen 9 5900X. And we can confirm most of AMD&#39;s benchmark claims—IPC has improved, along with both single and multi-threaded performance, across the board, beating Intel soundly on nearly all fronts.\n The only quibble we have with AMD&#39;s claims regards power consumption, not performance—and to be fair, it&#39;s almost certainly not AMD&#39;s fault. The system&#39;s desktop idle power consumption increased about 10W—but the increase affected our older Ryzen 9 3900XT CPU, as well as the two new Zen 3 parts. Knowing that, we expect the increase comes from the mandatory BIOS upgrade we had to perform on the ROG Crosshair VIII Hero motherboard, rather than the new CPUs themselves.\n     Regardless which multi-threaded benchmark you choose, you&#39;ll see a familiar relationship between these parts—AMD packs on a sizable performance boost from generation to generation, and Intel languishes behind significantly.\n As usual, these differences are magnified the most in Passmark, and the least in Geekbench—but they&#39;re impossible to ignore, and Intel&#39;s increasingly elderly i9-10900K is starting to look downright embarrassing. Intel will need to pull a pretty impressive rabbit out of its hat with its next generation of gaming CPUs if it doesn&#39;t want to hemorrhage marketshare, as AMD continues to both release faster CPUs, and release new iterations more frequently.\n     Our single-threaded tests solidly confirm AMD&#39;s claims from the Zen 3 launch—Intel&#39;s days of dominating single-threaded benchmarks are over, at least for now. All three of our single-threaded benchmarks show a healthy lead for the two new Zen 3 CPUs over Intel&#39;s top-performing single-threaded i9-10900K CPU.\n As always, we caution most people not to get too excited about pure single-threaded results—multi-threaded performance is not equivalent to single-threaded multiplied by the number of active threads, and significant activity on other threads will reduce performance from the levels you see here.\n That said, single-threaded performance can be more important in a gaming console setting, where CPU activity can be more tightly controlled than it typically is in a desktop PC. Zen 3&#39;s big gains here won&#39;t help Playstation 5 or Xbox Series X—both of which will feature CPUs based on the older Zen 2 architecture—but we suspect neither Sony nor Microsoft is regretting its decision to back Team Red, all the same.\n     3DMark&#39;s more gaming-specific CPU tests confirm what we already saw from general-purpose benchmarks—AMD&#39;s Zen 3 architecture isn&#39;t giving anything up to Intel. Time Spy Extreme—which models 4k gaming performance and can take advantage of more cores and more advanced CPU instructions than Time Spy—delivers a healthy lead for 5900X and 5950X over both the older 3900XT and Intel&#39;s i9-10900K.\n The simpler, non-Extreme Time Spy benchmark is likely a better fit for gaming up to 1440p, and Intel does much better there, running a basically dead heat with the 5950X and 5900X and slightly outperforming the older 3900XT. You&#39;re not likely to see  better gaming performance out of the i9-10900K than the AMD parts, even at lower resolutions—but if you&#39;re budget-constrained, find a really great deal on the Intel parts, and don&#39;t care about 4K gaming, it won&#39;t hurt your framerates.\n   Where the i9-10900K  will hurt you, unfortunately, is in heat generation and power consumption. The Intel CPU pulls 100W more power—and generates 100W more heat—than either the old or new Ryzen 9 CPUs.\n Our test results largely confirm AMD&#39;s claims of increased power efficiency with Zen 3—despite having a 200MHz higher clockrate and 25-percent more cores and threads, Ryzen 9 5950X consumed a little  less power under load than last generation&#39;s Ryzen 3900XT. We actually saw slightly lower power consumption from the 5950X than the smaller 5900X, but we suspect that&#39;s a quirk of individual CPUs rather than an overarching difference between models.\n We saw a pretty significant increase in desktop idle power consumption, from 53W to 64W—but the increase doesn&#39;t appear to be a result of the CPUs themselves. We needed to flash our ROG Crosshair VIII Hero motherboard with a brand-new BIOS that wasn&#39;t yet publicly available in order to support the two new CPUs. After noticing the increase in desktop idle power consumption, we swapped back to the Ryzen 9 3900XT and saw an even larger increase in power draw on that processor.\n We suspect that the increase in idle power consumption will be addressed in future publicly available BIOS versions. We also suspect that very few of the people who want a Ryzen 9 or Core i9 CPU are going to let the difference between 53W and 64W bother them much.\n  AMD&#39;s new desktop processor lineup is a pretty straightforward story—the company promised higher multi-threaded and single-threaded performance without a corresponding sacrifice in efficiency and then delivered on those promises.\n Beginning with the 3900XT, AMD decided not to provide OEM coolers with Ryzen 9 parts—and the company stuck with that decision with the new 5900X and 5950X. Although some readers have complained about the lack here, AMD justifies it with claims that data shows very few customers at this processor level stick with the OEM cooler anyway. We see no reason to doubt AMD there.\n With the release of these new Zen 3 processors, Intel fans lose their last big bragging right—single-threaded performance. Intel is now behind AMD on performance, power efficiency, and even release count on desktop CPUs—its last gaming CPU was the i9-10900K, released in May. AMD is now two releases ahead, with the 3900X and 3900XT in July, and 5900X and 5950X today.\n Meanwhile, Intel&#39;s next-gen Rocket Lake isn&#39;t expected until sometime in 2021—and it&#39;s widely  expected to remain on Intel&#39;s 14nm process, although using features backported from the 10nm Sunny Cove architecture. We&#39;re also expecting Rocket Lake to top out at only eight cores, compared to Comet Lake&#39;s ten.\n Intel&#39;s newest Tiger Lake mobile CPUs are great performers despite their similarly low core count, and it&#39;s possible that Rocket Lake will enjoy similar success next year—but we aren&#39;t betting on it. We suspect that Intel&#39;s difficult times on the desktop aren&#39;t going to be over any time soon.", "posttime": "2020-11-05 22:13:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "zen,英特尔", "title": "AMD的Zen 3 CPU就在这里--我们测试一下最快的5900X和5950X", "title_en": "AMD’s Zen 3 CPUs are here—we test the blistering-fast 5900X and 5950X", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/11/hands-on-zen-3-testing-with-amds-ryzen-9-5900x-and-5950x/", "via": "", "real_tags": ["zen", "英特尔"]}, {"category": "", "categoryclass": "", "imagename": "3ac86fbd7dd786713355aa9fbda9cde3.jpg", "infoid": 1033348, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年最新的Xbox游戏机X系列和S系列是Xbox生态系统历史上需求最少的设备。\n这可以说是一件非常好的事情，这是菲尔·斯宾塞(Phil Spencer)作为微软Xbox部门的首席执行官重整旗鼓的直接结果。作为一名面向公众的Xbox代言人，自2014年上任以来，他一直强调一个重要的公司理念：开放尽可能多的Xbox设备。云流媒体服务Windows 10 PC既有旧的也有新的游戏机：如今，它们基本上都与同一个Xbox品牌的软件兼容，而且只需一项订阅服务，每台游戏机上就可以播放100多款游戏。\n像Ars Technica的其他高级用户一样，从技术上讲，我玩Xbox游戏并不需要这两台新游戏机。在我强大的PC和安卓智能手机之间，我已经可以玩Xbox生态系统中的大量游戏，特别是第一方游戏(也就是前面提到的Xbox Game Pass旗舰版服务的帮助)。Xbox的员工似乎对此并不介意：想怎么玩就怎么玩，只要它在他们的游乐场上。\n这就是X系列和S系列变得更有趣的地方。经过数周的测试，我可以有把握地说，它们的设计不仅是为了与其他平台(特别是索尼的PlayStation5)竞争，也是为了与其他兼容Xbox的设备(如电脑)竞争。这些游戏机背后的工程师似乎把斯宾塞Xbox的所有理念都当成了挑战，在可用性、功能和价格上击败了大多数其他硬件选择。因此，当我想到每一台Xbox系列游戏机都做对了什么，通常都是这样的：我宁愿用一台新的Xbox来实现这一点。\n我已经在预览版中谈到了Xbox Series X的亮点，今天的点评并不会改变它们。这是一台不同寻常的499美元的游戏机。从它的外观来看，它功能强大，而且它的高端游戏目前的运行速度比我自己那台1000多美元的测试电脑还快。与此同时，Xbox Series S的小巧表亲/兄弟姐妹/同乡男孩在尺寸、价格和耗电量方面都非常高效。自盒式游戏时代以来，我们当然还没有见过如此小巧安静的下一代游戏机，在某些方面，它对下一代、但分辨率较低的游戏机的重视取得了巨大的成功。\n但截至发稿时，我还不能确定售价299美元的S系列是否与微软固有的承诺一致：与X系列相同的游戏玩法，以及你在1080P电视上看不到的降级效果。有时候，这和宣传的完全一样，特别是像Gears 5和Sea of Thieves这样的第三方软件。但由于截至发稿时有一个主要的表现异常值，以及对其与X系列相比价值的一些担忧，我更不情愿地涉足这篇评论的S系列。\n最重要的是，这两款Xbox系列游戏机都有一些共同之处。在今天的禁运之前，媒体只能看到少量真正的下一代内容。我们最终会回到两款游戏机的发布窗口游戏上，这更像是一场正面交锋的游戏机大战，但如果你在发布时来到这两款新Xbox中的任何一款，都怀着成功的下一代游戏的愿景，请注意，截至今天解禁，微软及其第三方合作伙伴并没有帮助我们为你证明这一点。(值得一提的是，在2020年剩下的时间里，我们也没有任何Xbox系列独家游戏可供参考。)。\n在我们开始讨论之前，先做些记账：因为我之前已经写过我在X系列上的亲身体验，所以我将在这次联合评论中重温一下描述这款游戏机的严肃立场。另一方面，我要说的关于S系列的一切都是全新的，因为它今天解除了禁运。不出所料，这两款游戏机都有很多共同之处，所以任何用名词来描述Xbox Series(不带字母)的东西都是对这两款游戏机的描述。而且，没有将其与11月12日发布的PlayStation5进行直接比较也是有意为之。我可以确认我已经审查了PS5的硬件，但我还不能自由地描述我们上周所谈到的以外的任何事情。(这并不妨碍我详细介绍Xbox系列的某些方面，特别是那些可能与PS5有所不同的方面。)\n最明显的是规模。X系列是一个厚实的长方体，形状笨拙，对于任何普通娱乐中心的货架来说都够笨拙的，而S系列则是一个小小的婴儿。这款游戏机的大小为10.8 x 5.9 x 5.9 x 2.5(275 mm x 151 mm x 63.5 mm)，总体积约为2016年Xbox One S的61%。这款游戏机和2017年的Xbox One X的最薄边上都有2.5&34；个左右，所以你可以把两台较老的游戏机从一个给定的架子上滑出来，换成S系列。\n另一方面，X系列的尺寸约为2.5系列S系统：x 11.6&#34；x 6&#34；x 6&#34；。如果这个尺寸看起来很大，请记住这一代X系列的性能同行--PlayStation5，尺寸为15.4&34；x 10.24；x 4.2，大约大了55%(不过，为了在水平位置更好地清理货架，它还是被挤压了)。\nS系列在几个方面都变小了，最明显的是它没有光驱。如果你想在S系列上玩旧游戏或新游戏，你唯一的选择就是在线下载，无论是通过Xbox Live金牌赠品、Xbox游戏通行证订阅，还是通过Xbox Marketplace点菜购买。比方说，没有办法将旧光盘交易给商店店员来获得数字下载许可证。\n更好的消息是，如果一款游戏可以在任何Xbox One游戏机上运行，除了Kinect动作感应游戏，它也可以在Xbox Series上运行。这包括一个重要的Xbox 360库和一个较小的OG Xbox选择，这也是Xbox多年来强调向后兼容运动的一部分。从Xbox 360的全盛时期开始，长期的Xbox用户很可能已经积累了不错的数字购买库，我已经享受到了从下一代开放世界的嬉戏跳到像Trials HD或Super Meat Boy这样的晚00年代经典游戏的轻松能力。\n然而，如果没有光驱，一些在X系列上运行的游戏就会被抛在脑后--至少，如果你还没有在Xbox Marketplace上买到电子版的话。我没有一个详尽的清单，但我已经找到了几个退市的例子，我只能通过光盘在X系列上播放，特别是Xbox 360版本的《黑暗灵魂1》(Dark Souls 1)。\n可以说，S&#系列的尺寸更多地来自于全面的功耗降低：CPU速度稍慢，GPU的计算单元更少，带宽更低的RAM更少，功耗更低。这也意味着游戏机产生的热量更少，因此它需要一个更小的风扇系统来保持系统的凉爽和安静。\n我之前曾说过，Xbox Series X是我测试过的最安静的现代游戏机，即使它有巨大的风扇，现在我可以确认S系列也是一样的。这两款设备都很安静，微风轻拂，如果你竖起耳朵倾听它们朝外的通风口，并将你选择的电视附近的所有其他设备静音，就能辨别出这一点。你会从任何通过USB连接到这些游戏机的旋转板硬盘上听到比游戏机本身更多的信息。安静，安静，安静。这是Xbox系列最容易称赞的方面，因为这两款游戏机在这方面都非常成功。\n虽然我对X系列的测试功耗高达205W，但S系列的功耗要求要低得多：在同样紧张的游戏场景下，最高功率约为95W，这是Gears 5的下一代版本，运行的是60fps的活动内容和120fps的模式。120fps的游戏分辨率徘徊在1080p左右，并切换了大量的视觉铃声和口哨，它如何能如此高效地在S系列上耗电，这让我感到震惊。", "note_en": "This year&#39;s newest Xbox consoles,  Series X and Series S, are the least imperative devices in the history of the Xbox ecosystem.\n This is arguably a very good thing and a direct result of Phil Spencer righting the ship as the chief of Microsoft&#39;s Xbox division. As a public-facing Xbox figure, he&#39;s emphasized a major company philosophy since taking over in 2014: open up &#34;Xbox&#34; access to as many devices as possible. Windows 10 PCs, a cloud-streaming service, consoles old and new: they&#39;re all largely compatible with the same Xbox-branded software these days, and a single subscription service delivers over 100 games on each of them.\n Like other power users at Ars Technica, I don&#39;t technically need either new console to play Xbox games. Between my powerful PC and my Android smartphone, I can already play plenty from the Xbox ecosystem, especially first-party games (with help from the aforementioned  Xbox Game Pass Ultimate service, that is). The folks at Xbox seem like they&#39;re fine with that: play how I want to, so long as it&#39;s in their playground some of the time.\n This is where Series X and S become more interesting. After weeks of testing each, I can safely say they were built to compete not just against other platforms (particularly Sony&#39;s PlayStation 5) but also against other Xbox-compatible devices like computers. It&#39;s as if the engineers behind these consoles took Spencer&#39;s &#34;Xbox on all the things&#34; philosophy as a challenge, to beat most other hardware options in usability, power, and price. Thus, when I think about what each Xbox Series console gets right, it&#39;s usually in the form of, &#34;I&#39;d rather use a new Xbox for that.&#34;\n   I&#39;ve already said  glowing things about Xbox Series X in  preview form, and rounding today&#39;s &#34;review&#34; corner doesn&#39;t change them. This is a remarkable $499 machine. It&#39;s sleek, it&#39;s powerful, and its high-end games currently load at higher speeds than my own $1,000-plus testing PC can manage. Meanwhile, the X&#39;s diminutive cousin/sibling/homeboy, Xbox Series S, is remarkably efficient for its size, price, and power draw. We certainly haven&#39;t seen a &#34;next-gen&#34; gaming machine this small and quiet since the cartridge era, and in some ways, its emphasis on &#34;next-gen, but lower-res&#34; is a smashing success.\n But as of press time, I can&#39;t definitively confirm that the $299 Series S locks onto Microsoft&#39;s inherent promise: same gameplay as Series X, with the kinds of downgrades you can&#39;t perceive on a 1080p TV. Sometimes, that pans out exactly as advertised, especially with first-party software like   Gears 5 and   Sea of Thieves. But with one major performance outlier as of press time, and some concerns about its value compared to Series X, I wade into the Series S half of this review more reluctantly than I&#39;d like.\n Above all, both Xbox Series consoles have something in common. There&#39;s only a mild amount of truly &#34;next-gen&#34; content available to the press ahead of today&#39;s embargo. We&#39;ll eventually circle back to launch-window games for both consoles as more of a head-to-head console-war breakdown, but if you&#39;re coming to either new Xbox at launch with visions of triumphant, next-gen games to play, be advised that Microsoft and its third-party partners didn&#39;t help us make that case for you as of today&#39;s embargo lift. (Worth noting, we don&#39;t really have any Xbox Series-exclusive games to point to for the rest of 2020, either.)\n Some bookkeeping before we dive in: because I&#39;ve previously written about my hands-on experience with Series X, I&#39;m going to retread serious ground describing that console in this joint review. Everything I have to say about Series S, on the other hand, is entirely new, owing to its embargo lifting today. Unsurprisingly, both consoles have a lot in common, so anything that describes &#34;Xbox Series&#34; as a noun, without a letter attached, describes both consoles. And the lack of direct comparisons to November 12&#39;s PlayStation 5 is intentional. I can confirm I have review PS5 hardware, but I&#39;m not yet free to describe anything beyond what we covered last week. (That doesn&#39;t stop me from going into great detail about certain Xbox Series aspects, especially those that may differ from what you&#39;ll find on the PS5.)\n      The most obvious is size. Where Series X is a chonky cuboid, shaped  juuuust awkwardly enough for any average entertainment center&#39;s shelves, Series S is an itty-bitty baby. At 10.8&#34; x 5.9&#34; x 2.5&#34; (275mm x 151mm x 63.5mm), its total volume is about 61 percent of  2016&#39;s Xbox One S. Both that console and  2017&#39;s Xbox One X are roughly 2.5&#34; at their slimmest side, as well, so you can slide either older console out of a given shelf and swap Series S in its place.\n Series X, on the other hand, is about 2.5 Series S systems in size: 11.6&#34; x 6&#34; x 6&#34;. If that seems big, remember that Series X&#39;s performance peer this generation, the PlayStation 5, measures 15.4&#34; x 10.24&#34; x 4.2, or roughly 55 percent bigger (albeit, squished down for better shelf clearance in horizontal position).\n Series S gets smaller in a few ways, and the most evident is its lack of an optical media drive. If you want to play old or new games on Series S, your only option is some form of online download, whether that&#39;s via Xbox Live Gold giveaways, Xbox Game Pass subscriptions, or a la carte purchases through the Xbox Marketplace. There&#39;s no way to, say, trade old discs to a store clerk to get digital download licenses.\n In better news, if a game functioned on any Xbox One console, with the exception of Kinect motion-sensing games, it will work on Xbox Series. This includes a significant Xbox 360 library and a smaller OG Xbox selection, and it&#39;s part of Xbox&#39;s years-long campaign to emphasize backwards compatibility. Longtime Xbox owners have likely accrued a decent digital-purchase library since the Xbox 360&#39;s heyday, and I have already relished the easy ability to jump from next-gen open-world romps to late-&#39;00s classics like   Trials HD or   Super Meat Boy.\n However, without a disc drive, some games that work on Series X are left in the back-compat dust—at least, if you didn&#39;t already buy their digital versions when they were available at the Xbox Marketplace. I don&#39;t have an exhaustive list, but I have already found a few delisted examples that I can only play on Series X via disc, particularly the Xbox 360 version of   Dark Souls 1.\n   Series S&#39;s size arguably stems more from power downgrades across the board: a slightly slower CPU, a GPU with fewer compute units, less RAM at lower bandwidth, and a lower power draw. That also means the console generates less heat, so it requires a smaller fan system to keep the system running cool and quiet.\n I&#39;ve previously reported that Xbox Series X is the quietest modern console I&#39;ve ever tested, even with its massive fan, and I can now confirm that Series S is in the same boat. Both are whisper quiet, with a mild breeze that&#39;s discernible if you put your ears up to their outward-facing vents and mute every other device near your TV of choice. You&#39;ll hear more from any spinning-plate hard drive attached to these consoles via USB than from the consoles themselves. Quiet, quiet, quiet. It&#39;s the easiest Xbox Series aspect to praise, since both consoles are so successful at it.\n And while my testing of Series X has jumped as high as 205W of power draw, Series S is much less demanding: at an apparent max of around 95W in the same stressful gameplay scenario, which is  Gears 5&#39;s &#34;next-gen&#34; build running both its 60 fps campaign content and 120 fps versus modes. I&#39;m still floored by how 120 fps gaming that hovers around 1080p resolution, with plenty of visual bells and whistles toggled, can sip power so efficiently on Series S.", "posttime": "2020-11-05 22:13:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "xbox,series", "title": "Xbox系列X/S评论：漂亮、强大--但是你会玩什么呢？", "title_en": "Xbox Series X/S review: Beautiful, powerful—but whatcha gonna play?", "transed": 1, "url": "https://arstechnica.com/gaming/2020/11/xbox-series-x-s-review-beautiful-powerful-but-whatcha-gonna-play/", "via": "", "real_tags": ["xbox", "series"]}]