[{"category": "", "categoryclass": "", "imagename": "55ddb27297d88cb51c4765f0680d6c09.jpg", "infoid": 1066578, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周四的尼尔森宣布越来越越来越靠近现代娱乐世界的一个伟大问题之一：有多大，究竟是流动？\n  近年来，Netflix，YouTube，亚马逊，呼伦，迪士尼+和苹果电视彻底改变了数百万美国人的观察习惯，但流媒体公司已经严重保护了他们的数字，分享了有多少人在选择性地观看的数据，如果根本\n 现在，尼尔森是十几年的98岁的研究公司对衡量美国的电视评级有效垄断，有一个新的指标，它说允许它达到苹果对比，百分比基础，有多少人在他们的电视上媒体展示和电影，而且正在观看传统的电缆和广播频道。\n 暂时，尼尔森报道，人们正在花更多的时间观看电视老式的方式 - 但流媒体正在快速获得。\n 周四，该公司报告称，64％的美国观众在5月2021年5月在5月20日使用电视套装是在观看网络和有线电视，而他们观看了大约26％的时间的流动服务。另外9％的时间，他们正在使用他们的电视屏幕，如视频游戏或观看他们在DVR上保存的程序或电影。\n 流媒体份额正在迅速增加。尼尔森说，它去年大约20％，尼尔森说; 2019年，大约是14％。尼尔森发言人表示，该公司预计媒体股票截至年底最高可达约33％。\n 研究公司表示，Netflix和YouTube是流媒体领导者，每次捕获6％的总电视时间。他们落后于Hulu（3％），亚马逊（2％）和迪士尼+（1％）。 \nNielsen称其新的公制仪表。除了以前测量有多少人正在观看流平台的方法之外，它还依赖于尼尔森设备中包含的音频识别软件，这些软件现在在全国38,000户家庭中。两个指标只测量在电视屏幕上查看的内容，不计算在手机或笔记本电脑上观看的内容。\n 当尼尔森在2017年开始释放额定评级数字时，Netflix并未印象深刻。 Nielsen四年前为平台的HIT系列“陌生事物”推出评级时，Netflix称为数据“不准确，甚至不准确”。\n “他们在裁判或得分的好地方 - 保留流动如何改变美国电视景观，”Netflix共同行政长官的芦苇黑斯廷斯在采访时表示。\n  询问Nielsen的报告认为，电缆和广播电视，也被称为线性电视，继续占据座位的观察习惯，Hastings先生说他是“惊讶的”，但并没有想到它持续。\n “这有点明显，有一个时间框架在线性带来线性，”他说。 “每年6％，它不会很长。”\n  Netflix通过外部公司进行了长期抵制的尝试，以估计其基础数据，而希斯廷斯先生对尼尔森的新公制的信心表决表示其立场上的疲软。\n Nielsen还使用许多房屋中的音频识别软件跟踪最大的流媒体服务，包括Netflix，迪士尼+，Hulu和亚马逊，并且它发布了关于最具流动的系列和电影的每周评级报告。 \n希斯廷斯先生没有终于尼尔森的预先现有的电视流系列评分，每周发布。 （“我们不卖广告，所以这不是非常相关的，”他说。但他说，他对新的指标印象深刻，尼尔森说将每月更新。\n 对于仪表的流统计数据，尼尔森通过观察通过路由器的互联网流量的一块硬件来测量约14,000户。向黑斯廷斯先生，这是一种更严格的流媒体测量方法。\n 他说，尼尔森，“在互联网观察方面习惯于不是非常复杂或准确。但在过去两年中，他们在Wi-Fi路由器级别开发并推出了新技术。因此，对于尼尔森面板中的房屋，他们现在可以准确地了解互联网观看，包括Netflix和Youtube。“\n “他们是周到的人，他们一直在做这个很长一段时间 - 我认为这非常好，”他继续。 “他们有准确的动力。”\n Netflix的批准是尼尔森的福音。几个月，研究公司在传统媒体公司的高管受到攻击，这些公司在冠状病毒大流行病的困扰着期间指责电视评级。\n David Zaslav是何种宣传媒体巨头的Discovery的首席执行官，如果其与警察的合并被监管机构清算，称为Nielsen的报告方法“上个月过时”。尼尔森承认了一些欠款，因为与大流行期间有些尼尔森家园的装置维持有关的困难。\n 在过去的Netflix中坚决拒绝透露任何您的竞争电视工作室和网络的失望。但Netflix现在为一些原始系列和电影发布了一些可供选择的统计数据。例如，去年年底，该公司表示，“Bridgerton”，来自超级生产商Shonda Rhimes的浪漫系列，是其历史上最受欢迎的原创系列。 \n与此同时，Netflix股票在其中间节目或彻头彻尾的拖鞋上没有公众。尼尔森释放只有十大流媒体评级列表。\n LightShed Partners的媒体分析师Rich Greenfield表示，Netflix是指仪表的批准，因为新的度量标准显示平台和YouTube，是流媒体领导者。\n “它还表明，在Netflix上花了6％的时间，并且在10年内将在哪里？”格林菲尔德先生补充道。 “它显示了未来十年的长期跑道。”\n “其他人在哪里？”他继续，参考其他主要的流媒体服务。 “关于流动战争的所有这些对话，但如果只有少数公司占主导地位 - 而Netflix是其中之一的话，他们不是流动战争。”\n 为了保持相关性，在几十年作为传统电视评级的黄金标准之后，尼尔森必须分为流媒体测量。\n David Kenny，Nielsen首席执行官和Akamai，云计算公司的前总统，已知赫斯廷先生十多年来。两者讨论了尼尔森的愿望，即立即衡量流动和传统电视的努力。\n 当赫斯廷斯先生被问到他是否鼓励肯尼先生公开发布新统计数据，他回答说，“是的，在鸡尾酒一级。不，在财务水平。“ \n对于尼尔森来说，仪表是一种尝试更清楚地了解美国观看习惯如何改变的习惯，更好地占人们如何在人们之间翻转，比如说，CNN和“Bridgerton”。  “对消费者来说，她得到了她的遥控器，她正在从现场运动转移到新闻到媒体，回来，”肯尼先生说。 “我们需要将整个行业汇集在一起看起来有可比的方式。” ", "note_en": "Nielsen on Thursday announced that it had moved a step closer toward cracking one of the great questions of the modern entertainment world: How big, exactly, is streaming?\n  In recent years,  Netflix, YouTube, Amazon, Hulu, Disney+ and Apple TV have revolutionized the viewing habits of millions of Americans, but the  streaming companies have been fiercely protective of their numbers, sharing data on how many people are watching very selectively, if at all.\n Now Nielsen, the 98-year-old research firm that for decades has had an effective monopoly on measuring TV ratings in the United States, has a new metric that it says allows it to make an apples-to-apples comparison, on a percentage basis, of how many people are streaming shows and films on their TVs versus how many are watching traditional cable and broadcast channels.\n For the time being, Nielsen reports, people are spending more time watching TV the old-fashioned way — but streaming is gaining fast.\n On Thursday, the firm reported that 64 percent of the time American viewers used their television sets in May 2021 was spent watching network and cable TV, while they watched streaming services about 26 percent of the time. Another 9 percent of the time, they were using their TV screens for things like video games or watching programs or films they had saved on DVR.\n The streaming share is increasing rapidly. It stood at about 20 percent last year, Nielsen said; in 2019, it was about 14 percent. A Nielsen spokesman said that the firm anticipates the streaming share could go up to about 33 percent by the end of the year.\n Netflix and YouTube are the streaming leaders, the research firm said, with each capturing 6 percent of total TV time. They are trailed by Hulu (3 percent), Amazon (2 percent) and Disney+ (1 percent).\n Nielsen calls its new metric The Gauge. It comes in addition to its previous method of measuring how many people are watching streaming platforms, which relies on  audio-recognition software included in Nielsen devices that are now in 38,000 households across the country. Both metrics measure only what is viewed on television screens and do not count what is watched on phones or laptops.\n When Nielsen started releasing ratings numbers based on its audio-recognition software in 2017, Netflix was not impressed. Netflix called the data “not accurate, not even close” when Nielsen put out ratings four years ago for the platform’s hit series “ Stranger Things.”\n “They’re in a good place to referee or score-keep how streaming is changing the U.S. television landscape,” Reed Hastings, the co-chief executive of Netflix, said in an interview.\n  Asked about Nielsen’s report that cable and broadcast TV, also known as linear television, continue to dominate viewing habits, Mr. Hastings said he was “surprised” but did not expect it to last.\n “It’s kind of obvious there’s a time frame over which streaming takes over linear,” he said. “At 6 percent per year, it’s not going to be long.”\n  Netflix had long resisted attempts by outside firms to estimate its viewership data, and Mr. Hastings’s vote of confidence in Nielsen’s new metric represents a softening in its stance on third party statistics.\n Nielsen also uses the audio recognition software in many of its homes to track the biggest streaming services, including Netflix, Disney+, Hulu and Amazon, and it releases a weekly ratings report on the most-streamed series and films.\n Mr. Hastings did not endorse Nielsen’s pre-existing TV streaming series ratings, which are released each week. (“We don’t sell advertising, so it’s not very relevant,” he said.) But he said he was impressed by the new metric, which Nielsen said will be updated monthly.\n For The Gauge’s streaming stats, Nielsen measured about 14,000 households through a piece of hardware that observes internet traffic that passes through a router. To Mr. Hastings, that is a more rigorous methodology for streaming measurement.\n Nielsen, he said, “used to not be very sophisticated or accurate in terms of internet viewing. But over the last two years, they’ve developed and rolled out new technology at the Wi-Fi router level. And so, for the homes in the Nielsen panel, they now have an accurate view of internet viewing, including Netflix and YouTube.”\n “They’re thoughtful people, they’ve been doing this for a long time — I assume it’s pretty good,” he continued. “They have incentive to be accurate.”\n Netflix’s approval comes as a boon for Nielsen. For months, the research firm has been under attack by executives at traditional media companies who have accused it of undercounting television ratings during the stuck-at-home months of the coronavirus pandemic.\n David Zaslav, the chief executive of Discovery who is in line to lead a media giant if its merger with WarnerMedia is cleared by regulators, called Nielsen’s reporting methods “ antiquated” last month. Nielsen  acknowledged some undercounting because of difficulties related to the maintenance of devices in some Nielsen homes during the pandemic.\n In the past Netflix steadfastly refused to disclose any viewership data, much to the  disappointment of rival TV studios and networks. But Netflix now releases some viewership stats for a few of its original series and movies. Late last year, for instance, the company said that “Bridgerton,” the romance series from the super-producer Shonda Rhimes, was the  most-watched original series in its history.\n At the same time, Netflix shares next to nothing with the public on its middling shows or outright flops. Nielsen releases only Top 10 streaming ratings lists, as well.\n Rich Greenfield, a media analyst at LightShed Partners, said Netflix was signaling its approval of The Gauge because the new metric shows that the platform, along with YouTube, is the streaming leader.\n “It also shows that 6 percent of time is spent on Netflix, and where’s that going to be in 10 years?” Mr. Greenfield added. “It shows how much long term runway there is over the next decade.”\n “And where’s everybody else?” he continued, referring to the other major streaming services. “There’s all this conversation about the streaming wars, but they’re not the streaming wars if only a few companies dominate — and Netflix is one of them.”\n To remain relevant, Nielsen must segue into streaming measurement after decades as the gold standard for traditional TV ratings.\n David Kenny, the Nielsen chief executive and the former president of Akamai, a cloud computing company, has known Mr. Hastings more than a decade. The two have discussed Nielsen’s desire to ramp up its efforts at measuring streaming and traditional television all at once.\n When Mr. Hastings was asked whether or not he had encouraged Mr. Kenny to release the new stats publicly, he replied, “Yes, at a cocktail level. No, at a financial level.”\n For Nielsen, The Gauge is an attempt to give a clearer picture of how American viewing habits have changed, one that better accounts for how people flip back and forth between, say, CNN and “Bridgerton.”\n “To the consumer, she’s got her remote control, and she’s moving from live sports over to news down to streaming, and back around,” Mr. Kenny said. “We need to bring the whole industry together to a comparable way of looking at this.”", "posttime": "2021-06-18 05:05:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "现在,nielsen,尼尔森", "title": "尼尔森现在知道你的流媒体 ", "title_en": "Nielsen Now Knows When You Are Streaming", "transed": 1, "url": "https://www.nytimes.com/2021/06/17/business/media/nielsen-streaming-metrics-netflix-youtube.html", "via": "", "real_tags": ["现在", "nielsen", "尼尔森"]}, {"category": "", "categoryclass": "", "imagename": "55ddb27297d88cb51c4765f0680d6c09.jpg", "infoid": 1066577, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周四的尼尔森宣布越来越越来越靠近现代娱乐世界的一个伟大问题之一：有多大，究竟是流动？\n  近年来，Netflix，YouTube，亚马逊，呼伦，迪士尼+和苹果电视彻底改变了数百万美国人的观察习惯，但流媒体公司已经严重保护了他们的数字，分享了有多少人在选择性地观看的数据，如果根本\n 现在，尼尔森是十几年的98岁的研究公司对衡量美国的电视评级有效垄断，有一个新的指标，它说允许它达到苹果对比，百分比基础，有多少人在他们的电视上媒体展示和电影，而且正在观看传统的电缆和广播频道。\n 暂时，尼尔森报道，人们正在花更多的时间观看电视老式的方式 - 但流媒体正在快速获得。\n 周四，该公司报告称，64％的美国观众在5月2021年5月在5月20日使用电视套装是在观看网络和有线电视，而他们观看了大约26％的时间的流动服务。另外9％的时间，他们正在使用他们的电视屏幕，如视频游戏或观看他们在DVR上保存的程序或电影。\n 流媒体份额正在迅速增加。尼尔森说，它去年大约20％，尼尔森说; 2019年，大约是14％。尼尔森发言人表示，该公司预计媒体股票截至年底最高可达约33％。\n 研究公司表示，Netflix和YouTube是流媒体领导者，每次捕获6％的总电视时间。他们落后于Hulu（3％），亚马逊（2％）和迪士尼+（1％）。 \nNielsen称其新的公制仪表。除了以前测量有多少人正在观看流平台的方法之外，它还依赖于尼尔森设备中包含的音频识别软件，这些软件现在在全国38,000户家庭中。两个指标只测量在电视屏幕上查看的内容，不计算在手机或笔记本电脑上观看的内容。\n 当尼尔森在2017年开始释放额定评级数字时，Netflix并未印象深刻。 Nielsen四年前为平台的HIT系列“陌生事物”推出评级时，Netflix称为数据“不准确，甚至不准确”。\n “他们在裁判或得分的好地方 - 保留流动如何改变美国电视景观，”Netflix共同行政长官的芦苇黑斯廷斯在采访时表示。\n  询问Nielsen的报告认为，电缆和广播电视，也被称为线性电视，继续占据座位的观察习惯，Hastings先生说他是“惊讶的”，但并没有想到它持续。\n “这有点明显，有一个时间框架在线性带来线性，”他说。 “每年6％，它不会很长。”\n  Netflix通过外部公司进行了长期抵制的尝试，以估计其基础数据，而希斯廷斯先生对尼尔森的新公制的信心表决表示其立场上的疲软。\n Nielsen还使用许多房屋中的音频识别软件跟踪最大的流媒体服务，包括Netflix，迪士尼+，Hulu和亚马逊，并且它发布了关于最具流动的系列和电影的每周评级报告。 \n希斯廷斯先生没有终于尼尔森的预先现有的电视流系列评分，每周发布。 （“我们不卖广告，所以这不是非常相关的，”他说。但他说，他对新的指标印象深刻，尼尔森说将每月更新。\n 对于仪表的流统计数据，尼尔森通过观察通过路由器的互联网流量的一块硬件来测量约14,000户。向黑斯廷斯先生，这是一种更严格的流媒体测量方法。\n 他说，尼尔森，“在互联网观察方面习惯于不是非常复杂或准确。但在过去两年中，他们在Wi-Fi路由器级别开发并推出了新技术。因此，对于尼尔森面板中的房屋，他们现在可以准确地了解互联网观看，包括Netflix和Youtube。“\n “他们是周到的人，他们一直在做这个很长一段时间 - 我认为这非常好，”他继续。 “他们有准确的动力。”\n Netflix的批准是尼尔森的福音。几个月，研究公司在传统媒体公司的高管受到攻击，这些公司在冠状病毒大流行病的困扰着期间指责电视评级。\n David Zaslav是何种宣传媒体巨头的Discovery的首席执行官，如果其与警察的合并被监管机构清算，称为Nielsen的报告方法“上个月过时”。尼尔森承认了一些欠款，因为与大流行期间有些尼尔森家园的装置维持有关的困难。\n 在过去的Netflix中坚决拒绝透露任何您的竞争电视工作室和网络的失望。但Netflix现在为一些原始系列和电影发布了一些可供选择的统计数据。例如，去年年底，该公司表示，“Bridgerton”，来自超级生产商Shonda Rhimes的浪漫系列，是其历史上最受欢迎的原创系列。 \n与此同时，Netflix股票在其中间节目或彻头彻尾的拖鞋上没有公众。尼尔森释放只有十大流媒体评级列表。\n LightShed Partners的媒体分析师Rich Greenfield表示，Netflix是指仪表的批准，因为新的度量标准显示平台和YouTube，是流媒体领导者。\n “它还表明，在Netflix上花了6％的时间，并且在10年内将在哪里？”格林菲尔德先生补充道。 “它显示了未来十年的长期跑道。”\n “其他人在哪里？”他继续，参考其他主要的流媒体服务。 “关于流动战争的所有这些对话，但如果只有少数公司占主导地位 - 而Netflix是其中之一的话，他们不是流动战争。”\n 为了保持相关性，在几十年作为传统电视评级的黄金标准之后，尼尔森必须分为流媒体测量。\n David Kenny，Nielsen首席执行官和Akamai，云计算公司的前总统，已知赫斯廷先生十多年来。两者讨论了尼尔森的愿望，即立即衡量流动和传统电视的努力。\n 当赫斯廷斯先生被问到他是否鼓励肯尼先生公开发布新统计数据，他回答说，“是的，在鸡尾酒一级。不，在财务水平。“ \n对于尼尔森来说，仪表是一种尝试更清楚地了解美国观看习惯如何改变的习惯，更好地占人们如何在人们之间翻转，比如说，CNN和“Bridgerton”。  “对消费者来说，她得到了她的遥控器，她正在从现场运动转移到新闻到媒体，回来，”肯尼先生说。 “我们需要将整个行业汇集在一起看起来有可比的方式。” ", "note_en": "Nielsen on Thursday announced that it had moved a step closer toward cracking one of the great questions of the modern entertainment world: How big, exactly, is streaming?\n  In recent years,  Netflix, YouTube, Amazon, Hulu, Disney+ and Apple TV have revolutionized the viewing habits of millions of Americans, but the  streaming companies have been fiercely protective of their numbers, sharing data on how many people are watching very selectively, if at all.\n Now Nielsen, the 98-year-old research firm that for decades has had an effective monopoly on measuring TV ratings in the United States, has a new metric that it says allows it to make an apples-to-apples comparison, on a percentage basis, of how many people are streaming shows and films on their TVs versus how many are watching traditional cable and broadcast channels.\n For the time being, Nielsen reports, people are spending more time watching TV the old-fashioned way — but streaming is gaining fast.\n On Thursday, the firm reported that 64 percent of the time American viewers used their television sets in May 2021 was spent watching network and cable TV, while they watched streaming services about 26 percent of the time. Another 9 percent of the time, they were using their TV screens for things like video games or watching programs or films they had saved on DVR.\n The streaming share is increasing rapidly. It stood at about 20 percent last year, Nielsen said; in 2019, it was about 14 percent. A Nielsen spokesman said that the firm anticipates the streaming share could go up to about 33 percent by the end of the year.\n Netflix and YouTube are the streaming leaders, the research firm said, with each capturing 6 percent of total TV time. They are trailed by Hulu (3 percent), Amazon (2 percent) and Disney+ (1 percent).\n Nielsen calls its new metric The Gauge. It comes in addition to its previous method of measuring how many people are watching streaming platforms, which relies on  audio-recognition software included in Nielsen devices that are now in 38,000 households across the country. Both metrics measure only what is viewed on television screens and do not count what is watched on phones or laptops.\n When Nielsen started releasing ratings numbers based on its audio-recognition software in 2017, Netflix was not impressed. Netflix called the data “not accurate, not even close” when Nielsen put out ratings four years ago for the platform’s hit series “ Stranger Things.”\n “They’re in a good place to referee or score-keep how streaming is changing the U.S. television landscape,” Reed Hastings, the co-chief executive of Netflix, said in an interview.\n  Asked about Nielsen’s report that cable and broadcast TV, also known as linear television, continue to dominate viewing habits, Mr. Hastings said he was “surprised” but did not expect it to last.\n “It’s kind of obvious there’s a time frame over which streaming takes over linear,” he said. “At 6 percent per year, it’s not going to be long.”\n  Netflix had long resisted attempts by outside firms to estimate its viewership data, and Mr. Hastings’s vote of confidence in Nielsen’s new metric represents a softening in its stance on third party statistics.\n Nielsen also uses the audio recognition software in many of its homes to track the biggest streaming services, including Netflix, Disney+, Hulu and Amazon, and it releases a weekly ratings report on the most-streamed series and films.\n Mr. Hastings did not endorse Nielsen’s pre-existing TV streaming series ratings, which are released each week. (“We don’t sell advertising, so it’s not very relevant,” he said.) But he said he was impressed by the new metric, which Nielsen said will be updated monthly.\n For The Gauge’s streaming stats, Nielsen measured about 14,000 households through a piece of hardware that observes internet traffic that passes through a router. To Mr. Hastings, that is a more rigorous methodology for streaming measurement.\n Nielsen, he said, “used to not be very sophisticated or accurate in terms of internet viewing. But over the last two years, they’ve developed and rolled out new technology at the Wi-Fi router level. And so, for the homes in the Nielsen panel, they now have an accurate view of internet viewing, including Netflix and YouTube.”\n “They’re thoughtful people, they’ve been doing this for a long time — I assume it’s pretty good,” he continued. “They have incentive to be accurate.”\n Netflix’s approval comes as a boon for Nielsen. For months, the research firm has been under attack by executives at traditional media companies who have accused it of undercounting television ratings during the stuck-at-home months of the coronavirus pandemic.\n David Zaslav, the chief executive of Discovery who is in line to lead a media giant if its merger with WarnerMedia is cleared by regulators, called Nielsen’s reporting methods “ antiquated” last month. Nielsen  acknowledged some undercounting because of difficulties related to the maintenance of devices in some Nielsen homes during the pandemic.\n In the past Netflix steadfastly refused to disclose any viewership data, much to the  disappointment of rival TV studios and networks. But Netflix now releases some viewership stats for a few of its original series and movies. Late last year, for instance, the company said that “Bridgerton,” the romance series from the super-producer Shonda Rhimes, was the  most-watched original series in its history.\n At the same time, Netflix shares next to nothing with the public on its middling shows or outright flops. Nielsen releases only Top 10 streaming ratings lists, as well.\n Rich Greenfield, a media analyst at LightShed Partners, said Netflix was signaling its approval of The Gauge because the new metric shows that the platform, along with YouTube, is the streaming leader.\n “It also shows that 6 percent of time is spent on Netflix, and where’s that going to be in 10 years?” Mr. Greenfield added. “It shows how much long term runway there is over the next decade.”\n “And where’s everybody else?” he continued, referring to the other major streaming services. “There’s all this conversation about the streaming wars, but they’re not the streaming wars if only a few companies dominate — and Netflix is one of them.”\n To remain relevant, Nielsen must segue into streaming measurement after decades as the gold standard for traditional TV ratings.\n David Kenny, the Nielsen chief executive and the former president of Akamai, a cloud computing company, has known Mr. Hastings more than a decade. The two have discussed Nielsen’s desire to ramp up its efforts at measuring streaming and traditional television all at once.\n When Mr. Hastings was asked whether or not he had encouraged Mr. Kenny to release the new stats publicly, he replied, “Yes, at a cocktail level. No, at a financial level.”\n For Nielsen, The Gauge is an attempt to give a clearer picture of how American viewing habits have changed, one that better accounts for how people flip back and forth between, say, CNN and “Bridgerton.”\n “To the consumer, she’s got her remote control, and she’s moving from live sports over to news down to streaming, and back around,” Mr. Kenny said. “We need to bring the whole industry together to a comparable way of looking at this.”", "posttime": "2021-06-18 05:04:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,硬件,观看,announces,尼尔森", "title": "Nielsen宣布了一个新的公制，仪表，通过观看通过路由器的互联网流量的硬件来测量〜14,000个美国房屋中的流式观看 ", "title_en": "Nielsen announces a new metric, The Gauge, to measure streaming viewing in ~14,000 US homes via hardware that watches internet traffic passing through a router", "transed": 1, "url": "https://www.nytimes.com/2021/06/17/business/media/nielsen-streaming-metrics.html", "via": "", "real_tags": ["美国", "硬件", "观看", "announces", "尼尔森"]}, {"category": "", "categoryclass": "", "imagename": "a42209ab7e7e430c5e6a518ac2bf8fa9.jpeg", "infoid": 1066576, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我正在考虑我想在这个时事通讯中写下的内容，而不是在音高甲板上提供快乐的蹩脚建议，并告诉你粉碎它，我决定我会走一个不同的路线。\n  首先，如果您是自杀，WhatsApp Meat at +16468270591或致电自杀式预防热线+ 1800-273-8255或者如果您不在各州，请访问此网站。\n 我最近对创始人讲话，他试图通过这么说来表达这么多。事实上，他很尴尬，在他想要做什么。他正试图告诉我他受到伤害，他害怕，他沮丧。\n “你能找到一个本地首席执行官组吗？你可以和人交谈？“我问。\n “不，他们想谈论的只是谁的加剧更大，”他说。\n  听：你正在尝试建造一些东西。你致力于这个想法。你是为了一种非常个人的理由而这样做。也许你想分享一个想法。也许你不想在小隔间里工作。也许你想传给你的孩子。重要的是，你是，正如那个老肮脏的海报所说，竞技场中的“男人（或女人）”。“\n 伟大的。你在竞技场。你在建造。在不久的将来，您将奇迹愉快和成功。如何定义现在不清楚，没有人，甚至没有像我这样的预测者可以告诉你。但是听：在某些时候，你会醒来说“是的，这很棒。这就是我想要的。“我肯定的那一点。 \n我怎么知道？因为我读了书，我已经谈过了老年人。我最近也读到了这一点。这是从威廉·夏特纳采访中。\n 如果他担心死亡，那么问一个90岁的孩子们感觉粗鲁，所以我问他希望他知道他在90岁时知道他的意见。\n “这是一个有趣的答案！”他说蜂拥而至。 “我很高兴我不知道，因为你在90所知道的是：把它变得容易，最终没有什么事，发生了什么必须下来。如果我知道在20岁时，我就不会做任何事情！“\n 得到它？我们在那个伟大的轮子上。有时我们已经起来了，有时候我们已经失败了。命运说，唯一的常态是变化的。然后她说：\n 委托自己托儿＆＃39;他的统治，你必须符合你的情妇和＃39; S的方式。你试图停止她旋转轮的运动吗？傻瓜的傻瓜，你必须意识到如果车轮停止转动，它会停止成为机会的过程。\n  但这是问题：在前往这种理解的途中，你会充满疑问，愤怒和恐惧。我失败了很多，很多次，我的最后一个大失败让我想在公共汽车前走。我最近再次失败了 - 它是自我造成的，但仍然是 - 而且我可能会失败。我们有线失败。我们不是完美的众生。\n 所以当你觉得你不辜负你的潜力时，请记住你实际上正在做点什么。大多数人都在地铁或公共汽车上，进入工作，放了八个小时，回家。大多数人都很乐意这样做。为什么错了？但是你做了不同的事情。令人惊讶的东西。普通人拒绝做的事情。 \n但是你不开心。而且你也可能不高兴。因为在你的追求趋势中，你已经失去了对你存在的纯粹性的理解。您的启动可能会失败。你将继续永远努力。对于你生命的一个时期，你将为别人和另一个人工作，你不会。陶醉于这些变化。陶醉于这些机会。当车轮停止时，没有更多的机会。请为无论如何的爱，不要让那个轮子停下来。\n 再次：不要杀死自己。不要让自己被焦虑或抑郁症摧毁。您停止早上醒来的即时是您需要获得帮助或退出的即时。你觉得你觉得害怕感到害怕，你应该和某人谈谈。请。不要胆结玻璃。不要打架。只是得到帮助。在启动世界中没有人会告诉你这个，当我在帖子后面承认这一点时，一个评论者说我没有被砍掉成为一个创始人，因为我不是由严厉的东西制成。操这个家伙。当您需要时获取帮助，当您看到其需要时提供帮助。\n 你很重要，你是聪明的，你很爱。你值得担心。如果你经历了艰难的时间，请伸出援手。初创公司不是自杀契约，这是一个冒险。把它放在鼓舞人心的斑块上并吸烟。 ", "note_en": "I was thinking about what I wanted to write in this newsletter and instead of offering happy crappy advice on pitch decks and telling you to crush it, I decided I’d go a different route.\n  First, if you’re suicidal, WhatsApp me at +16468270591 or call the Suicide Prevention Hotline at +1800-273-8255 or, if you’re not in the States,  visit this site.\n I was speaking to a founder recently who tried to express so much by saying very little. He was embarrassed, in fact, at what he was trying to do. He was trying to tell me he was hurting, he was scared, and he was frustrated.\n “Can you find a local CEO group? Folks you can talk to?” I asked.\n “No, all they want to talk about is whose raise was bigger,” he said.\n  Listen: you’re trying to build something. You’re dedicated to that idea. You’re doing it for a very personal reason. Maybe you want to share an idea. Maybe you don’t want to work in a cubicle. Maybe you want to pass something on to your kids. The thing that matters is that you are, as that  old shitty poster says, the “man (or woman) in the arena.”\n Great. You’re in the arena. You’re building. You will, at one point in the near future, be miraculously happy and successful. How that is defined is unclear right now and no one, not even prognosticators like me can tell you. But listen: at some point, you’ll wake up and say “Yeah, this is great. This is what I wanted.” I’m certain on that point.\n How do I know? Because I read books and I’ve talked older folks. I also read this recently. It’s from an interview with  William Shatner.\n It feels rude to ask a 90-year-old if he worries about death, so I ask instead what he wishes he had known at 20 that he knows at 90.\n “Here’s an interesting answer!” he says perkily. “I’m glad I didn’t know because what you know at 90 is: take it easy, nothing matters in the end, what goes up must come down. If I’d known that at 20, I wouldn’t have done anything!”\n Get it? We’re on that great wheel. Sometimes we’re up, sometimes we’re down.  The only constancy is change, says Fate. Then  she says:\n Having entrusted yourself to Fortune&#39;s dominion, you must conform to your mistress&#39;s ways. What, are you trying to halt the motion of her whirling wheel? Dimmest of fools that you are, you must realize that if the wheel stops turning, it ceases to be the course of chance.\n  But here’s the problem: on the way to that point of understanding, you will be full of doubt, anger, and fear. I’ve failed many, many times and my last big failure had me wanting to walk in front of a bus. I just recently failed again — it was self-inflicted but still — and I’ll probably fail in the future. We’re wired to fail. We’re not perfect beings.\n So when you feel that you’re not living up to your potential, remember that you are actually doing something. Most people get on the subway or bus, go into work, put in their eight hours, and go home. Most people are happy doing that. Why fault them? But you are doing something different. Something amazingly hard. Something the average person refuses to do.\n  But you’re not happy doing that. And you’re also probably not happy at all. Because in your quest to buck trends you’ve lost your understanding of the sheer inexplicability of your existence. Your startup will probably fail. You will keep trying forever and ever. For one period of your life, you’ll work for someone else and in another, you won’t. Revel in these changes. Revel in these chances. When the wheel stops there are no more chances. And please, for the love of whatever, don’t let that wheel stop.\n Again: don’t kill yourself. Don’t let yourself be destroyed by anxiety or depression. The instant you stop wanting to wake up in the morning is the instant you need to get help or quit. The instant you feel a crushing sense of fear you should talk to someone. Please. Don’t gut through it. Don’t fight. Just get help. No one in the startup world will tell you this and when I admitted this in a post a while back, one commenter said I wasn’t cut out to be a founder because I wasn’t made of sterner stuff. Fuck that guy. Get help when you need it, give help when you see its need.\n You are important, you are intelligent, and you are loving. You’re worth worrying about. If you’re going through a tough time please reach out. A startup isn’t a suicide pact, it’s an adventure. Put that on an inspirational plaque and smoke it.", "posttime": "2021-06-18 05:03:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "抑郁症,depression,告诉", "title": "关于抑郁症和创始人 ", "title_en": "On Depression and Founders", "transed": 1, "url": "https://startupstrats.substack.com/p/dont-kill-yourself", "via": "", "real_tags": ["抑郁症", "告诉"]}, {"category": "", "categoryclass": "", "imagename": "52d43a56990ef4c5a0997b197747e930.jpg", "infoid": 1066575, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据Lawstreet的一份报告，WD已搬迁到与其SMR WD红色硬盘相关的虚假广告的持续的类行动诉讼。拟议的解决方案追求WD＆＃39的普遍批评的批评。在某些硬盘中的一些硬盘上的偷区使用较慢的凸起的磁记录（SMR）技术，而不披露营销材料或规格表。值得注意的是，这一解决方案仅适用于对西方数码上的多个诉讼行动之一。随着解决的，WD将同意与SMR技术的WD Red NAS HDDS＆＃39; T适合NAS和RAID使用。谈判术语达到270万美元，投诉人每次购买的每次驱动器收到4美元至7美元的现金，最高税款调整为85％的零售价格。这意味着在160美元的范围内每个驱动器的最大损坏（尽管由于持续的硬盘短缺导致的价格膨胀，但这很难计算）。你赢得了＆＃39; t需要购买证明来制定索赔。 WD之前披露于TOM＆＃39;硬件2到6TB WD红色硬盘，其中包括SMR技术。该技术能够提高能力并导致较低的制造成本，但它以牺牲性能为代价，特别是随机写入活动。除了一般的性能较慢，这也可能导致目标NAS使用情况的过度重建时间（重新定义），特别是如果它们使用ZFS RAID阵列。结算价值为10周的谈判的高潮以及律师＆＃39;费用和其他费用。 WD还同意在接下来的四年内完全披露其驱动器中使用的录制技术，包括在包装及其网页上。针对WD的原始虚假广告索赔涉及一波类动作诉讼，甚至呼吁禁止销售NAS使用的SMR驱动器。该公司澄清了该驱动器使用SMR技术，甚至发布了新的驱动器来解决问题。 WD ISN＆＃39; T唯一的HDD制造商在没有完整披露的情况下运送较慢的SMR技术 - 东芝和希捷也在没有完整披露的情况下发货。我们不了解对这些公司的任何待处理诉讼。我们确实知道在不同地区的WD上提交了多个类行动诉讼。法律报告称，在原告修改投诉时，一项此类诉讼已被驳回。\n      律师将在汉普顿享受夏季住宅。你得到4美元到7美元。听起来很愉快。 / s.\n   回复\n 当故事破裂时，我是一个买了一些未解决的阵列的驱动器的驱动器。我添加了ZFS插头并用垃圾填充它，然后强制阵列重建奇偶校验磁盘。它在6GB驱动器上深入缓慢。我将用Ryzen 2400g CPU服用5天。当另一个失败可能意味着死亡时不完全安慰。由于我在我的1个月内窗口中，我将他们送回亚马逊，因为WD支持Didn＆＃39; T向我提供了一个升级选项（我会支付的）我以来已经离开了希捷Ironwolf和Haven＆＃39;看起来背部。我有点担心奇偶校验检查（57c）上的temps（std运行为55c max），但我的驱动器笼可能只需要良好的风扇流清洁。或者我可能需要调整风扇曲线。到目前为止，只有警告＆＃39;我看到的，由于振动，已经看过头调，这是漂亮的标准票价。\n   回复 ", "note_en": "WD has moved to settle one of its ongoing class-action lawsuits for false advertising associated with its SMR WD Red hard drives, according to a report from   LawStreet. The proposed settlement comes after widespread criticism from WD&#39;s customers about its  surreptitious use of slower shingled magnetic recording (SMR) technology in some of its hard drives without disclosing that fact in marketing materials or specification sheets. Notably, this settlement is only proposed for one of the multiple litigation actions against Western Digital on the matter.   With the settlement, WD would agree that the WD Red NAS HDDs with SMR tech aren&#39;t suitable for NAS and RAID usage. The negotiated terms come to $2.7 million, with complainants receiving $4 to $7 in cash for each drive purchased with a maximum pro-rata adjustment of 85% of the retail price possible. That means the maximum damages per drive in the ~$160 range (although this is hard to calculate due to inflated pricing due to ongoing HDD shortages). You won&#39;t need proof of purchase to make a claim.  WD previously  disclosed to Tom&#39;s Hardware that the 2 to 6TB WD Red hard drives, among others, use SMR technology. This tech boosts capacity and results in a lower manufacturing cost, but it comes at the expense of performance, particularly in random write activity. Aside from generally slower performance, that can also  cause excessive rebuild times (resilvering) in the targets NAS use cases, particularly if they use ZFS RAID arrays.  The settlement value comes as the culmination of 10 weeks of negotiations and also includes lawyers&#39; fees and other costs. WD also agrees to fully disclose the recording technology used in its drives, both on the packaging and its web pages, for the next four years.  The original false advertising claims against WD touched off a  wave of class-action lawsuits, with one even  calling for a ban to block WD from selling SMR drives for NAS usage. The company has since  clarified which drives use SMR technology and even  released new drives to address the issue.  WD isn&#39;t the only HDD manufacturer to ship the slower SMR tech without full disclosure —  Toshiba and Seagate also shipped drives without full disclosure. We aren&#39;t aware of any pending litigation against those companies. We do know that multiple class-action lawsuits have been filed against WD in different regions.  LawStreet reports that one such lawsuit has been  dismissed while the plaintiff amends the complaint.\n      Lawyers will get summer homes in the Hamptons. You get $4 to $7. Sounds fare to me.   /s\n   Reply\n I was one that bought a couple of those drives for my UNRAID array just when the story broke.  I added the ZFS plug in and filled it with garbage and then forced the array to rebuild the parity disk. It was abysmally slow on 6GB drives. I would have taken over 5 days with a Ryzen 2400g CPU. Not exactly comforting when another failure could mean death.  Since I was within my 1 month window, I returned them to amazon as defective because WD support didn&#39;t offer me an upgrade option (which I would have paid for)  I since have gone Seagate Ironwolf and haven&#39;t looked back. I&#39;m a little concerned about temps on parity checks (57C) (std operating is 55C max) But my drive cage may just need a good cleaning for fan flow. Or I may need to adjust the fan curve up. So far only post warning&#39;s I&#39;ve seen have been about head realignment due to vibration which is pretty standard fare.\n   Reply", "posttime": "2021-06-18 05:03:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,smr,settle,wd", "title": "WD将SMR HDD虚假广告课程诉讼诉讼为160美元 ", "title_en": "WD to Settle SMR HDD False Advertising Class Action Lawsuit at $160 per Drive", "transed": 1, "url": "https://www.tomshardware.com/news/wd-moves-to-settle-smr-hdd-false-advertising-class-action-lawsuit", "via": "", "real_tags": ["广告", "smr", "settle", "wd"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066574, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "研究表明，人类不能减缓因生物限制而变老的速度\n    不朽和永恒的年轻人是神话的东西，根据新的研究，这可能终于最终结束了无论我们是否可以住的永恒的辩论。\n 由政府，商业，学者，投资者的投资者支持价值110亿美元（82.5亿英镑） - 估计到2025年的价值610亿美元 - 科学家们花了几十年，试图利用基因组学和人工智能的力量找到一种方法预防甚至逆转老化。\n  但现在，一个前所未有的研究已经证实，由于生物限制，我们可能无法减缓我们年龄较大的速度。\n 该研究，通过来自14个国家的科学家的国际合作，包括牛津大学的专家，并列出了测试“老龄化的不变率”假设，该假设表明，某种物种从成年期具有相对固定的衰老率。\n “我们的调查结果支持理论，而不是减缓死亡，由于年龄较小的死亡率降低，莫斯曼·穆尔姆·赫科特（JoséManuel）为特定年龄诞生和跨越几个世纪和大陆的死亡数据。\n  “我们将出生和死亡数据与人类和非人的灵长类动物进行了比较，发现这一般的死亡率在所有这些中都是相同的，”Aburto说。 “这表明生物学，而不是环境因素，最终最终控制寿命。 \n“统计数据确认，个人生活在健康和生活条件的改善方面，这导致整个人口的寿命增加。尽管如此，随着年龄的历史升级，死亡率的陡峭升高，在所有物种中都很清楚。“\n 辩论多年来，我们能够延长多年的学术界，几十年来，在英国寻求延长的生活和健康特别活跃，至少260家公司，250家投资者，10个非营利性和10个研究实验室使用最先进的技术。\n 英国政府甚至在四个工业战略中的两个工业战略中的两个工业战略中都是优先考虑的艾美和长寿的独立部门，这旨在让英国在未来行业的最前沿。\n 但是，辩论中缺少的是研究比较了多种动物人群与人类的寿命，以解决驱动死亡率的原因。\n 这项研究插在一起，说话。 “这使我们可以在物种内部和之间的死亡率进行比较。”\n 宇州健康衰老研究所的生物激素学教授大卫宝石表示，该报告的摘要表明，该研究是“非常高兴的研究证明了一些争议且肯定的权利”。\n 阿布托团队审查的所有数据集揭示了相同的死亡格相制：婴儿期的高风险，在未成熟和青少年迅速下降，仍然低至成年早期，然后在推进年龄持续上升。 \n“我们的调查结果证实，在历史人口中，预期寿命低，因为许多人死于年轻人，”Aburto说。 “但作为医疗，社会和环境改善持续，预期寿命增加。  “越来越多的人现在越来越长。 然而，老年死亡的轨迹没有改变，“他补充道。 “这项研究表明进化生物学胜过一切，到目前为止，医疗进步一直无法击败这些生物制约因素。” ", "note_en": "Research suggests humans cannot slow the rate at which they get older because of biological constraints\n    Immortality and everlasting youth are the stuff of myths, according to  new research which may finally end the eternal debate about whether we can live for ever.\n Backed by governments, business, academics and investors  in an industry worth $110bn (£82.5bn) – and estimated to be worth $610bn by 2025 – scientists have spent decades attempting to harness the power of genomics and artificial intelligence to find a way to prevent or even reverse ageing.\n  But an unprecedented  study has now confirmed that we probably cannot slow the rate at which we get older because of biological constraints.\n The study, by an  international collaboration of scientists from 14 countries and including experts from the University of Oxford, set out to test the “invariant rate of ageing” hypothesis, which says that a species has a relatively fixed rate of ageing from adulthood.\n “Our findings support the theory that, rather than slowing down death, more people are living much longer due to a reduction in mortality at younger ages,” said  José Manuel Aburto from Oxford’s  Leverhulme Centre for Demographic Science, who analysed age-specific birth and death data spanning centuries and continents.\n  “We compared birth and death data from humans and non-human primates and found this general pattern of mortality was the same in all of them,” said Aburto. “This suggests that biological, rather than environmental factors, ultimately control longevity.\n “The statistics confirmed, individuals live longer as health and living conditions improve which leads to increasing longevity across an entire population. Nevertheless, a steep rise in death rates, as years advance into old age, is clear to see in all species.”\n The debate over how much longer we can live has divided the academic community for decades, with the search for extended life and health particularly active in the UK, where at least 260 companies, 250 investors, 10 non-profits, and 10 research labs are using the most advanced technologies.\n The UK government has even prioritised the separate sectors of AI and longevity by including both of them in the  four industrial strategy grand challenges, which aim to put Britain at the forefront of the industries of the future.\n But what has been missing from the debate is research comparing lifespans of multiple animal populations with humans, to work out what is driving mortality.\n This study plugs that gap, said Aburto. “This extraordinarily diverse collection of data enabled us to compare mortality differences both within and between species.”\n David Gems, a professor of biogerontology at UCL’s Institute of Healthy Ageing, said that the summary of the report suggested the research was “a very high-powered study proving something contentious and surely right”.\n All the datasets examined by Aburto’s teams revealed the same general pattern of mortality: a high risk of death in infancy which rapidly declines in the immature and teenage years, remains low until early adulthood, and then continually rises in advancing age.\n “Our findings confirm that, in historical populations, life expectancy was low because many people died young,” said Aburto. “But as medical, social, and environmental improvements continued, life expectancy increased.\n “More and more people get to live much longer now. However, the trajectory towards death in old age has not changed,” he added. “This study suggests evolutionary biology trumps everything and, so far, medical advances have been unable to beat these biological constraints.”", "posttime": "2021-06-18 05:03:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "过程,process,研究", "title": "老化过程是不可阻挡的，发现前所未有的研究 ", "title_en": "Ageing process is unstoppable, finds unprecedented study", "transed": 1, "url": "https://www.theguardian.com/science/2021/jun/17/ageing-process-is-irreversible-finds-unprecedented-study", "via": "", "real_tags": ["过程", "process", "研究"]}]