[{"category": "", "categoryclass": "", "imagename": "a25de5aad33b00a11b7a70cf991039c1.jpg", "infoid": 1030113, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "总体而言，Azure现在有65个云区-尽管这个数字包括一些还没有上线的云区。正如它的竞争对手喜欢指出的那样，并不是所有的产品都有多个可用区，但该公司计划改变这一点。在此之前，通常附近有另一个区域的事实通常可以弥补这一点。\n谈到可用区，除了宣布这个新的数据中心区域外，微软今天还宣布了在巴西扩展云的计划，新的可用区将于2021年在现有的巴西南部地区启动高可用性工作负载。目前，该地区仅支持Azure工作负载，但将在未来几个月增加对Microsoft 365、Dynamics 365和Power Platform的支持。\n这一声明是其在巴西建立业务的重大承诺的一部分。微软还与经济部合作，“帮助多达2500万名工人找到工作，并提供免费的数字技能，培训多达550万人”，并利用其人工智能保护热带雨林。最后一部分听起来有点天真，但这里的具体计划是使用人工智能根据卫星图像的数据预测可能的森林砍伐区域。", "note_en": "In total, Azure now features 65 cloud regions — though that number includes some that aren’t online yet. As its competitors like to point out, not all of them feature multiple availability zones yet, but the company plans to change that. Until then, the fact that there’s usually another nearby region can often make up for that.\n   Talking about availability zones, in addition to announcing this new data center region, Microsoft also today  announced plans to expand its cloud in Brazil, with new availability zones to enable high-availability workloads launching in the existing Brazil South region in 2021. Currently, this region only supports Azure workloads but will add support for Microsoft 365, Dynamics 365 and Power Platform over the course of the next few months.\n This announcement is part of a large commitment to building out its presence in Brazil. Microsoft is also partnering with the Ministry of Economy “to help job matching for up to 25 million workers and is offering free digital skilling with the capacity to train up to 5.5 million people” and to use its AI to protect the rainforest. That last part may sound a bit naive, but the specific plan here is to use AI to predict likely deforestation zones based on data from satellite images.", "posttime": "2020-10-21 00:56:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,微软,宣布,azure", "title": "\n微软Azure宣布其在奥地利的第一个地区", "title_en": "\n\t\t\t\tMicrosoft Azure announces its first region in Austria\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/microsoft-azure-announces-its-first-region-in-austria/", "via": "", "real_tags": ["microsoft", "微软", "宣布", "azure"]}, {"category": "", "categoryclass": "", "imagename": "9c4d79bbcaf7c4c86e8f4d8d348b593a.jpg", "infoid": 1030112, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有无数理由用坚果奶、燕麦奶或豆奶等替代品取代牛奶，但对于那些喜欢食用动物性乳制品的人来说，替代品就是不一样。因此，生产“不可能汉堡”和其他植物性肉类替代品的“不可能食品”公司，正致力于另一种看起来、尝起来和行为都像牛奶的食品替代品。\n在今天上午的虚拟新闻发布会上，Impact Foods透露，它将在明年将硅谷研发团队的规模扩大一倍，同时还启动了所谓的“Impact Investigator项目”，以吸引顶尖科学家为其事业做出贡献。该公司还向世界展示了其新的植物性牛奶替代品，该产品尚未有一个朗朗上口的营销名称。(尽管您可能可以放心地认为，“不可能的牛奶”是一个正在考虑的选择。)。\n就像该公司的旗舰产品Impact Burgers一样，Impact Foods的新牛奶替代品也是由来自植物的稳定蛋白质制成的。这个想法是，它不仅可以与其他液体(如热咖啡)正确混合，不会形成可能改变质地和饮用体验的沉淀物，而且还可以搅拌成泡沫，用作其他食品的配料，而不必像其他替代品经常要求的那样修改配方。\n与Impact Foods的肉制品一样，牛奶替代品的目标是保持乳制品的消费体验，包括质地、口感和味道，同时减少对饲养牛等动物的需求。换句话说，Impact Milk，或者公司在准备正式向公众提供它时最终给它起的任何名字，都不一定是豆奶或坚果奶的替代品。有很多消费者更喜欢这些替代品，而不是牛奶。Impact Foods的目标是为那些想要抛弃牛奶，而不是体验消费牛奶的人创造一种选择。\n该公司尚未给出其牛奶替代品何时准备好离开研发实验室的时间表，但它有助于证明，Impact Foods成功地利用了其研究，而不仅仅是替代绞肉。更重要的是，这将使该公司最终为世界提供一个完整的植物性芝士汉堡。\n如果我的外卖有点像不可能的汉堡……我会试一试，然后再吃正宗的。", "note_en": "There’s a myriad of reasons to replace cow’s milk with alternatives like nut milks, oat milk, or soy milk, but for those who enjoy the experience of consuming animal-sourced dairy products, the alternatives just aren’t the same. So Impossible Foods, makers of the   Impossible Burger and other   plant-based meat alternatives, are working on another food replacement that looks, tastes, and behaves like cow’s milk.\n    During a virtual press conference this morning where Impossible Foods revealed it was doubling the size of its Silicon Valley-based research and development team over the next year while also launching what it calls the “Impossible Investigator project” to entice leading scientists to contribute to its cause, the company also gave the world its first look at its new plant-based cow’s milk alternative that hasn’t yet been dubbed with a catchy marketing name. (Although you can probably safely assume that Impossible Milk is an option being considered.)\n   Like the company’s flagship Impossible Burgers, Impossible Foods’ new milk alternative is made with stable proteins sourced from plants. The idea is that it not only properly mixes with other liquids (like hot coffee) without forming precipitates that can alter the texture and drinking experience, but that it can also be whipped into a foam and used as an ingredient in other food products without having to modify a recipe as is often required with other substitutes.\n As with Impossible Foods’ meat products, the goal of the milk alternative is to preserve the experience of consuming dairy products, including the texture, mouth feel, and flavor, while reducing the demand for raising animals like cattle. In other words, Impossible Milk, or whatever the company ends up calling it when it’s ready to officially make it available to the public, won’t necessarily be a replacement for soy milk or nut milks. There are lots of consumers who prefer those alternatives over cow’s milk. Impossible Foods’ goal is to create an alternative for those who want to leave cow milk behind, but not the experience of consuming it.\n   The company hasn’t given a timeline on when its milk substitute will be ready to leave its R&amp;D labs, but it helps demonstrate that Impossible Foods has managed to successfully parlay its research into more than just replacements for ground meats. More importantly, it will allow the company to finally give the world a complete plant-based cheeseburger.\n        If my takeaway is anything like the impossible burger...I’ll give it a try and then go back to the real thing.", "posttime": "2020-10-21 00:55:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,牛乳,foods,牛奶", "title": "Impact Foods现在正在开发一种以植物为基础的牛乳替代品", "title_en": "Impossible Foods Is Now Developing a Plant-Based Alternative To Cow's Milk", "transed": 1, "url": "https://gizmodo.com/impossible-foods-is-now-developing-a-plant-based-altern-1845425703", "via": "", "real_tags": ["开发", "牛乳", "foods", "牛奶"]}, {"category": "", "categoryclass": "", "imagename": "3878eae83a677de05b12902d8d537938.png", "infoid": 1030111, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周日，英国政府发表了一份关于端到端加密和公共安全的国际声明，由美国、澳大利亚、新西兰、加拿大、印度和日本的代表共同签署。这份声明写得很好，很值得一读，但核心是：\n我们呼吁科技公司[...]。使执法部门能够以可读和可用的格式访问内容，其中授权是合法颁发的，是必要的和相称的，并受到强有力的保障和监督。\n换句话说，这是世界上七个最大的政府明确提出的要求，要求在端到端加密(E2EE)通信服务中设置后门：一个当局拥有密钥的后门，允许他们按需查看通信。这是个大新闻，与Matrix直接相关，因为Matrix是一种端到端的加密通信协议，其核心团队目前集中在英国。\n现在，我们同情当局在这里的困境：我们完全憎恶虐待儿童、恐怖主义、法西斯主义和类似的东西-我们没有建造黑客帝国来实现这些。然而，不幸的是，试图通过后门来减少滥用是有根本缺陷的。\n后门必然会为每个人的加密引入一个致命的弱点，然后成为攻击者的终极高价值目标。任何能够确定破解加密所需的秘密的人都将获得完全访问权限，并且您可以绝对确定后门密钥将会泄露-无论是通过入侵、社会工程、暴力攻击还是意外。即使你单方面相信你的现任政府会负责打开后门的钥匙，但单方面相信他们的继任者是明智的吗？计算机安全只是一个程度问题，要想像这样安全地保守秘密，唯一安全的方法就是让它从一开始就不存在。\n如今，端到端加密是一种完全无处不在的技术；试图立法禁止它就像试图扭转潮流或宣布某一数学分支是非法的。即使Matrix确实泄露了其加密，用户也可以轻松地使用任何其他方法来额外保护他们的对话-从PGP、OTR，到使用一次性Pad，再到共享密码保护的ZIP文件中的内容。或者，他们可以直接切换到从司法管辖区运行的E2EE聊天系统，而不需要后门。\n各国政府使用端到端加密来保护自己的数据，正是因为他们不希望其他政府能够窥探这些数据。因此，政府为后门辩护不仅是虚伪的，而且会立即使他们自己的政府数据面临被泄露的风险。此外，为后门创建基础设施为世界其他地区树立了一个令人难以置信的糟糕先例-在这些国家，不那么健康的政府将不可避免地使用同样的技术，严重损害其公民的人权。\n最后，在Matrix的具体案例中：Matrix是一个加密的、分散的、由开源软件驱动的开放网络，任何人都可以在其中运行服务器。即使Matrix核心团队有义务增加一个后门，这对更广泛的世界来说也是可见的-而且没有办法让更广泛的网络采用它。这只会损害核心团队的可信度，将加密开发推向其他国家，更广泛的网络将无关紧要地向前发展。\n简而言之，我们需要保持E2EE的现状，这样它才能让99.9%的优秀演员受益。如果我们实施后门并破坏它，那么糟糕的0.1%的人将简单地切换到非走后门的系统，而99.9%的人则会变得脆弱。\n我们也不是唯一这样想的人：GDPR(世界领先的数据保护和隐私法规)明确呼吁将健壮的加密作为必要的信息安全措施。事实上，美国政府后门的风险明确导致欧洲法院(European Of Court Of Justice)宣布欧盟-美国数据的隐私盾牌无效。七国政府在这里的立场(以及欧盟专员最近关于加密“问题”的通信)是在保护基本隐私权方面的重大倒退。\n七国政府的这一声明旨在保护普通公众免受不良行为者的伤害，但它显然破坏了好的行为者。我们真正需要的是授权用户和管理员在不破坏隐私的情况下识别并保护自己不受不良行为影响。\n如果我们有一种标准的方式，让用户自己建立和分享他们自己的观点，看看其他用户、消息、房间、服务器等是否令人讨厌，会怎么样？如果您可以可视化并选择要应用于Matrix视图的筛选器，情况会怎样？\n就像Web、电子邮件或整个互联网一样，Matrix中的内容不可能被单方面审查或屏蔽。但我们能做的是提供一流的基础设施，让用户(以及房间/社区版主和服务器管理员)自己决定信任谁，允许哪些内容。这还将为当局提供一种发布有关非法内容的声誉数据的方法，提供一种尊重隐私的机制，管理员/MODS/用户可以使用该机制将非法内容远离他们的服务器/客户端。\n任何人都可以收集有关Matrix聊天室/用户/服务器/社区/内容的声誉数据，并根据自己的喜好将其发布给更广泛或更窄的受众，从而提供他们对Matrix中的内容在给定环境中是正面还是负面的主观评分。\n此声誉数据以隐私保护的方式发布-即，如果您知道要查询的ID，则可以查找声誉数据，但数据以假名方式存储(例如，通过散列ID进行索引)。\n任何人都可以订阅信誉提要，并将它们混合在一起，以便告知他们如何过滤其内容。馈送可以是他们自己的数据，或者来自他们的朋友，或者来自可信的来源(例如，事实核查公司)。他们的混合饲料可以作为自己的饲料重新发布。\n为了防止用户陷入他们自己设计的派系过滤气泡中，我们将提供UI来可视化并警告他们的过滤范围--并让他们可以根据需要轻松而有趣地转换他们的观点。\n然后，在特定辖区运行服务器的管理员可以选择在他们的服务器上实施他们需要的任何规则(例如，他们可能想要订阅来自可信来源(如IWF)的信誉馈送，识别儿童性虐待内容，并使用它从他们的服务器阻止它)。\n这不仅仅是为了打击滥用--同样的系统也可以用来授权用户根据自己的条件过滤掉垃圾邮件、宣传、不想要的NSFW内容等。\n这就形成了一个相对的声誉体系。尽管这可能令人不舒服，但一个人的恐怖分子是另一个人的自由斗士，不同的司法管辖区有不同的法律--扮演上帝和裁决并不是Matrix.org基金会的事。每个用户/版主/管理员都应该可以自由地做出自己的决定，并决定与哪些声誉源保持一致。这并不是说这个系统将帮助用户定位极端内容-声誉数据的隐私保护性质意味着它只对过滤掉你本来可以看到的材料有用-而不是定位新内容。\n就这与端到端加密和减少滥用的交互方式而言：现实情况是，Matrix、Web或电子邮件等公共网络中的绝大多数滥用行为都是从公共未加密域中看到的。辱骂的社区通常想要吸引/招募/培养用户-这意味着提供一个公共前门，这将由一个声誉系统来标记，比如上面提出的一个。与此同时，完全私人和完全加密的社区通常仍然与世界其他地方有接触点-即使那样，他们也极有可能避免任何假想的后备服务器。简而言之，调查这类社区需要当局传统的渗透和监控，而不是无效的后门。\n现在，这种方法听起来可能完全是科幻小说，而且雄心勃勃得令人难以置信(我们的专长！)-但我们实际上已经开始成功地构建这个方法，我们在过去几年里一直在提炼这个想法。MSC2313是发布和订阅声誉数据的想法的第一个切入点-从简单的二进制禁令规则开始。它已经实现并投入生产一年多了，用来维护matrix.org和mozilla.org社区使用的共享名单。下一步是对其进行扩展，以支持可混合的声誉数据连续体(而不仅仅是二进制禁止列表)，使其保护隐私，并开始在客户端UX上进行配置和可视化。\n最后：我们将继续聘请一支专门的声誉团队，全职致力于这一点的建设。这是对Matrix未来的一项重大投资，坦率地说，这是在烧钱，我们并没有真正的钱-但这对该项目的长期成功至关重要，也许对整个互联网的健康也是至关重要的。毕竟，没有什么好的相对声誉系统是Matrix所特有的，而且许多其他人(分散的或其他的)显然也迫切需要一个。我们正在积极寻找资金来支持这项工作，所以如果你感到富有和慈善(或者政府想要支持更开明的方法)，我们希望通过[电子邮件保护]听到你的消息！\n在这个世界里，用户拥有出色的在线保护工具，他们的安全不会因为加密后门而受到损害。在这个世界里，用户拥有出色的在线保护工具，他们的安全不受加密后门的影响。", "note_en": "Last Sunday, the UK Government published an  international statement on end-to-end encryption and public safety, co-signed by representatives from the US, Australia, New Zealand, Canada, India and Japan. The statement is well written and well worth a read in full, but the central point is this:\n We call on technology companies to [...] enable law enforcement access to content in a readable and usable format where an authorisation is lawfully issued, is necessary and proportionate, and is subject to strong safeguards and oversight.\n In other words, this is an explicit request from seven of the biggest governments in the world to mandate a backdoor in end-to-end encrypted (E2EE) communication services: a backdoor to which the authorities have a secret key, letting them view communication on demand. This is big news, and is of direct relevance to Matrix as an end-to-end encrypted communication protocol whose core team is currently centred in the UK.\n Now, we sympathise with the authorities’ predicament here: we utterly abhor child abuse, terrorism, fascism and similar - and we did not build Matrix to enable it. However, trying to mitigate abuse with backdoors is, unfortunately,  fundamentally flawed.\n Backdoors necessarily introduce a fatal weak point into encryption for  everyone, which then becomes the ultimate high value target for attackers. Anyone who can determine the secret needed to break the encryption will gain full access, and you can be absolutely sure   the backdoor key will leak - whether that’s via intrusion, social engineering, brute-force attacks, or accident. And even if you unilaterally trust your current government to be responsible with the keys to the backdoor, is it wise to unilaterally trust their successors? Computer security is only ever a matter of degree, and the only safe way to keep a secret like this safe is for it not to exist in the first place.\n End-to-end encryption is nowadays a completely ubiquitous technology;  an attempt to legislate against it is like trying to turn back the tide or declare a branch of mathematics illegal. Even if Matrix did compromise its encryption, users could easily use any number of other approaches to additionally secure their conversations - from PGP, to OTR, to using one-time pads, to sharing content in password-protected ZIP files. Or they could just switch to a E2EE chat system operating from a jurisdiction without backdoors.\n Governments protect their own data using end-to-end encryption, precisely because they do not want other governments being able to snoop on them. So not only is it hypocritical for governments to argue for backdoors,  it immediately puts their own governmental data at risk of being compromised. Moreover, creating infrastructure for backdoors sets an incredibly bad precedent to the rest of the world - where less salubrious governments will inevitably use the same technology to the massive detriment of their citizens’ human rights.\n Finally, in Matrix’s specific case: Matrix is an encrypted decentralised open network powered by open source software, where anyone can run a server. Even if the Matrix core team were obligated to add a backdoor, this would be visible to the wider world - and  there would be no way to make the wider network adopt it. It would just damage the credibility of the core team, push encryption development to other countries, and the wider network would move on irrespectively.\n In short, we need to keep E2EE as it is so that it benefits the 99.9% of people who are good actors. If we enforce backdoors and undermine it, then the bad 0.1% percent simply will switch to non-backdoored systems while the 99.9% are left vulnerable.\n We’re not alone in thinking this either: the GDPR (the world-leading regulation towards data protection and privacy) explicitly calls out robust encryption as a necessary information security measure. In fact, the risk of US governmental backdoors explicitly caused the  European of Court of Justice to invalidate the Privacy Shield for EU-&gt;US data. The position of the seven governments here (alongside  recent communications by the EU commissioner on the ‘problem’ of encryption) is a significant step back on the protection of the fundamental right of privacy.\n   This statement from the seven governments aims to protect the general public from bad actors, but it clearly undermines the good ones. What we  really need is something that empowers users and administrators to identify and protect themselves from bad actors, without undermining privacy.\n What if we had a standard way to let users themselves build up and share their own views of whether other users, messages, rooms, servers etc. are obnoxious or not? What if you could visualise and choose which filters to apply to your view of Matrix?\n Just like the Web, Email or the Internet as a whole, there is literally no way to unilaterally censor or block content in Matrix. But what we  can do is provide first-class infrastructure to let users (and room/community moderators and server admins) make up their own mind about who to trust, and what content to allow. This would also provide a means for authorities to publish reputation data about illegal content, providing a privacy-respecting mechanism that admins/mods/users can use to keep illegal content away from their servers/clients.\n  Anyone can gather reputation data about Matrix rooms / users / servers / communities / content, and publish it to as wide or narrow an audience as they like - providing their subjective score on whether something in Matrix is positive or negative in a given context.\n This reputation data is published in a privacy preserving fashion - i.e. you can look up reputation data if you know the ID being queried, but the data is stored pseudonymised (e.g. indexed by a hashed ID).\n Anyone can subscribe to reputation feeds and blend them together in order to inform how they filter their content. The feeds might be their own data, or from their friends, or from trusted sources (e.g. a fact-checking company). Their blended feed can be republished as their own.\n To prevent users getting trapped in a factional filter bubble of their own devising, we’ll provide UI to visualise and warn about the extent of their filtering - and make it easy and fun to shift their viewpoint as needed.\n Admins running servers in particular jurisdictions then have the option to enforce whatever rules they need on their servers (e.g. they might want to subscribe to reputation feeds from a trusted source such as  the IWF, identifying child sexual abuse content, and use it to block it from their server).\n This isn’t just about combating abuse - but the same system can also be used to empower users to filter out spam, propaganda, unwanted NSFW content, etc on their own terms.\n This forms a  relative reputation system. As uncomfortable as it may be, one man’s terrorist is another man’s freedom fighter, and different jurisdictions have different laws - and it’s not up to the Matrix.org Foundation to play God and adjudicate. Each user/moderator/admin should be free to make up their own mind and decide which reputation feeds to align themselves with. That is not to say that this system would help users locate extreme content - the privacy-preserving nature of the reputation data means that it’s only useful to filter  out material which would otherwise already be visible to you - not to locate new content.\n In terms of how this interacts with end-to-end-encryption and mitigating abuse: the reality is that the vast majority of abuse in public networks like Matrix, the Web or Email is visible from the public unencrypted domain. Abusive communities generally want to attract/recruit/groom users - and that means providing a public front door, which would be flagged by a reputation system such as the one proposed above. Meanwhile, communities which are entirely private and entirely encrypted typically still have touch-points with the rest of the world - and even then, the chances are extremely high that they will avoid any hypothetical backdoored servers. In short, investigating such communities requires traditional infiltration and surveillance by the authorities rather than an ineffective backdoor.\n Now, this approach may sound completely sci-fi and implausibly overambitious (our speciality!) - but we’ve actually started successfully building this already, having been refining the idea over the last few years.  MSC2313 is a first cut at the idea of publishing and subscribing to reputation data - starting off with simple binary ban rules. It’s been implemented and in production for over a year now, and is used to maintain shared banlists used by both matrix.org and mozilla.org communities. The next step is to expand this to support a blendable continuum of reputation data (rather than just binary banlists), make it privacy preserving, and get working on the client UX for configuring and visualising them.\n Finally: we are continuing to hire a dedicated Reputation Team to work full time on building this. This is a major investment in the future of Matrix, and frankly is burning money that we don’t really have - but it’s critical to the long-term success of the project, and perhaps the health of the Internet as a whole. There’s nothing about a good relative reputation system which is particularly specific to Matrix, after all, and many other folks (decentralised and otherwise) are clearly in desperate need of one too. We are actively looking for funding to support this work, so if you’re feeling rich and philanthropic (or a government wanting to support a more enlightened approach) we would  love to hear from you at   [email protected]!\n Here’s to a world where users have excellent tools to protect themselves online - and a world where their safety is not compromised by encryption backdoors.", "posttime": "2020-10-21 00:52:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "滥用,abuse,加密", "title": "打击滥用，没有后门", "title_en": "Combating abuse without backdoors", "transed": 1, "url": "https://matrix.org/blog/2020/10/19/combating-abuse-in-matrix-without-backdoors", "via": "", "real_tags": ["滥用", "abuse", "加密"]}, {"category": "", "categoryclass": "", "imagename": "c72a4bdf84c77ccc3eff0558d5edc17a.jpg", "infoid": 1030110, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "编程中最常见的“数据类型”之一是文本字符串。当程序员想到字符串时，他们会想象自己在处理一个列表或一个字符数组。这通常是一个“足够好”的近似值，但实际情况要复杂得多。\n字符必须以某种方式编码成位。互联网上的大多数字符串，包括这篇博客文章，都是使用一种名为UTF-8的标准进行编码的。UTF-8格式使用1、2、3或4个字节表示“字符”。它是ASCII标准的推广，每个字符只使用一个字节。也就是说，ASCII字符串也是UTF-8字符串。\n它稍微复杂一些，因为从技术上讲，utf-8描述的是代码点，一个可见字符(如表情符号)可以由几个代码点…组成。但对于大多数程序员来说，这是一个迂腐的区别。\n还有其他标准。一些较老的编程语言(如C#和Java)依赖于UTF-16。在UTF-16中，每个字符使用两个或四个字节。这在当时看起来是个好主意，但我相信，共识正越来越多地朝着随时随地使用UTF-8的方向发展。\n大多数字符编码的共同点是它们受到约束，并且这些约束必须强制执行。换句话说，并不是任何随机位序列都是UTF-8。因此，您必须验证收到的字符串是有效的UTF-8。\n有关系吗？的确如此。例如，Microsoft的Web服务器存在安全漏洞，而用户可以发送在安全检查看来是有效和安全的URI，但一旦被服务器解释，就会允许攻击者在服务器的磁盘上导航。即使安全性不是问题，您几乎肯定希望在将无效字符串存储到数据库之前拒绝它们，因为这是一种损坏形式。\n因此，您的编程语言、Web服务器、浏览器、数据库引擎一直都在验证UTF-8。\n如果您的字符串大多只是ASCII字符串，那么检查速度会相当快，UTF-8验证是没有问题的。然而，所有字符串都是可靠的ASCII字符串的日子已经一去不复返了。我们生活在表情符号和国际字符的世界里。\n早在2018年，我就开始想知道…。验证UTF-8字符串的速度有多快？我当时得到的答案是每个字符需要几个CPU周期。这可能看起来令人满意，但我并不高兴。\n这花了几年时间，但我相信我们现在已经达到了可能是人们所能做的最好的东西：查找算法。它可以比常见的FAST替代产品快十倍以上。我们写了一篇关于它的研究论文：在每个字节少于一条指令的情况下验证UTF-8(将出现在软件：实践和体验中)。我们还发布了我们的基准软件。\n因为我们有一整篇研究论文来解释，所以我不会深入细节，但是核心的洞察力是相当整齐的。大多数UTF-8验证可以通过查看成对的连续字节来完成。一旦您确定了通过查看所有连续字节对可以检测到的所有违规，剩下的工作就相对较少了(每个字节)。\n我们的处理器都有快速的SIMD指令。它们是在宽寄存器(128位、256位等)上操作的指令。它们中的大多数都有一个“矢量化查找”指令，该指令可以获取16字节值(在0到16的范围内)，然后在16字节表中查找它们。英特尔和AMD处理器具有与此描述匹配的pShufb指令。范围在0到16之间的值有时称为半字节，它跨越4位。一个字节由两个半字节(低半字节和高半字节)组成。\n在查找算法中，我们调用矢量化查找指令三次：一次在低位半字节上，一次在高位半字节上，一次在下一个字节的高位半字节上。我们有三个相应的16字节查找表。通过恰到好处地选择它们，三个查找中的逐位AND将允许我们发现任何错误。\n有关更多详细信息，请参阅本文，但最终结果是，您可以使用大约5行快速C++代码验证几乎全部的UTf-8字符串，而无需任何分支…。并且这5行一次验证大小为32字节的块…。\nSimd8分类(simd8输入，simd8上一次输入){\rAUTO PROVER1=输入.prev&lt；1&gt；(Previous_Input)；\rAUTO BYTE_1_HIGH=优先1.Shift_Right&lt；4&gt；().lookup_16(表1)；\rAUTO BYTE_1_LOW=(优先1&amp；0x0F).lookup_16(表2)；\rAUTO BYTE_2_HIGH=输入.Shift_Right&lt；4&gt；().lookup_16(表3)；\rRETURN(BYTE_1_HIGH&amp；BYTE_1_LOW&AMP；BYTE_2_HIGH)；\r}。\n目前还不清楚这是否足够和100%安全。但它是。您只需要几个便宜的额外技术步骤。\n最终结果是，在最新的Intel/AMD处理器上，即使是更糟糕的随机输入，也只需要每字节不到一条指令就可以验证，而且由于代码非常精简，每个周期可以停用三条以上这样的指令。因此，我们始终实现超过12 Gb/s的速度。\n教训是，虽然查找表很有用，但矢量化查找表是高速算法的基本构建块。\n如果您需要在生产设置中使用快速查找UTF-8验证功能，我们建议您查看simdjson库(0.5版或更高版本)。它经过了很好的测试，并且有一些功能可以让您的生活变得更轻松，比如运行时调度。虽然simdjson库是由JSON解析驱动的，但是即使在看不到JSON的情况下，您也可以使用它来验证UTF-8。Simdjson支持64位ARM和x64处理器，具有其他系统的后备功能。我们将其打包为单个头文件和单个源文件；因此，您几乎可以将其放入您的C++项目中。\n功劳：Muł比任何人都普及了矢量化分类技术，这是查找算法的关键。据我所知，Keiser最先提出了三查策略。据我所知，第一个实用的(非破解的)基于SIMD的UTF-8验证算法是由K.Willets设计的。包括Z.Wegner在内的几个人表明，你可以做得更好。特拉维斯·唐斯还就如何加速传统算法提供了聪明的见解。\n进一步阅读：如果您喜欢这项工作，您可能会喜欢以几乎与内存副本相同的速度进行Base64编码和解码(软件：实践和经验50(2)，2020)和每秒解析千兆字节的JSON(VLDB Journal 28(6)，2019年)。", "note_en": "One of the most common “data type” in programming is the text string. When programmers think of a string, they imagine that they are dealing with a list or an array of characters. It is often a “good enough” approximation, but reality is more complex.\n The characters must be encoded into bits in some way. Most strings on the Internet, including this blog post, are encoded using a standard called UTF-8. The UTF-8 format represents “characters” using 1, 2, 3 or 4 bytes. It is a generalization of the ASCII standard which uses just one byte per character. That is, an ASCII string is also an UTF-8 string.\n It is slightly more complicated because, technically, what UTF-8 describes are code points, and a visible character, like emojis, can be made of several code points… but it is a pedantic distinction for most programmers.\n There are other standards. Some older programming languages like C# and Java rely on UTF-16. In UTF-16, you use two or four bytes per character. It seemed like a good idea at the time, but I believe that the consensus is increasingly moving toward using UTF-8 all the time, everywhere.\n What most character encodings have in common is that they are subject to constraints and that these constraints must be enforce. To put it another way, not any random sequence of bits is UTF-8. Thus you must validate that the strings you receive are valid UTF-8.\n Does it matter? It does. For example, Microsoft’s web server had a security vulnerability whereas one could send URIs that would appear to the security checks as being valid and safe, but once interpreted by the server, would allow an attacker to navigate on the disk of the server. Even if security is not a concern, you almost surely want to reject invalid strings before you store them in your database as it is a form of corruption.\n So your programming languages, your web servers, your browsers, your database engines, all validate UTF-8 all of the time.\n If your strings are mostly just ASCII strings, then checks are quite fast and UTF-8 validation is no issue. However, the days when all of your strings were reliably ASCII strings are gone. We live in the world of emojis and international characters.\n Back in 2018, I started wondering…  How fast can you validate UTF-8 strings? The answer I got back then is a few CPU cycles per character. That may seem satisfying, but I was not happy.\n It took years, but I believe we have now arrived at what might be close to the best one can do: the lookup algorithm. It can be more than ten times faster than common fast alternatives. We wrote a research paper about it:  Validating UTF-8 In Less Than One Instruction Per Byte (to appear at Software: Practice and Experience).  We have also published our benchmarking software.\n Because we have a whole research paper to explain it, I will not go into the details, but the core insight is quite neat. Most of the UTF-8 validation can be done by looking at pairs of successive bytes. Once you have identified all violations that you can detect by looking at all pairs of successive bytes, there is relatively little left to do (per byte).\n Our processors all have fast SIMD instructions. They are instructions that operate on wide registers (128 bits, 256 bits, and so forth). Most of them have a “vectorized lookup” instruction that can take, say, 16 byte values (in the range 0 to 16) and look them up in a 16-byte table. Intel and AMD processors have the  pshufb instruction that match this description. A value in the range 0 to 16 is sometimes called a nibble, it spans 4 bits. A byte is made of two nibbles (the low and high nibble).\n In the lookup algorithm, we call a vectorized lookup instruction three times: once on the low nibble, once on the high nibble and once on the high nibble of the next byte. We have three corresponding 16-byte lookup tables. By choosing them just right, the bitwise AND of the three lookups will allow us to spot any error.\n Refer to the paper for more details, but the net result is that you can validate almost entirely a UTF-8 string using roughly 5 lines of fast C++ code without any branching… and these 5 lines validate blocks as large as 32 bytes at a time…\n simd8 classify (simd8 input , simd8 previous_input )  {\r  auto prev1  = input .prev &lt; 1 &gt; (previous_input ) ;\r  auto byte_1_high  = prev1 .shift_right  &lt; 4 &gt; ( ) .lookup_16 (table1 ) ;\r  auto byte_1_low  =  (prev1  &amp;  0x0F ) .lookup_16 (table2 ) ;\r  auto byte_2_high  = input .shift_right  &lt; 4 &gt; ( ) .lookup_16 (table3 ) ; \r  return  (byte_1_high  &amp; byte_1_low  &amp; byte_2_high ) ;\r }\n It is not immediately obvious that this would be sufficient and 100% safe.  But it is. You only need a few inexpensive additional technical steps.\n The net result is that on recent Intel/AMD processors, you need just under an instruction per byte to validate even the worse random inputs, and because of how streamlined the code is, you can retire more than three such instructions per cycle. Thus we consistently achieve speeds of over 12 GB/s.\n The lesson is that while lookup tables are useful, vectorized lookup tables are fundamental building blocks for high-speed algorithms.\n If you need to use the fast lookup UTF-8 validation function in a production setting, we recommend that you go through the  simdjson library (version 0.5 or better). It is well tested and has features to make your life easier like runtime dispatching. Though the simdjson library is motivated by JSON parsing, you can use it to just validate UTF-8 even when there is no JSON in sight. The simdjson supports 64-bit ARM and x64 processors, with fallback functions for other systems. We package it as a single header file along with a single source file; so you can pretty much just drop it into your C++ project.\n Credit: Muła popularized more than anyone the vectorized classification technique that is key to the lookup algorithm. To my knowledge, Keiser first came up with the three-lookup strategy. To my knowledge, the first practical (non hacked) SIMD-based UTF-8 validation algorithm was crafted by K. Willets. Several people, including Z. Wegner showed that you could do better. Travis Downs also provided clever insights on how to accelerate conventional algorithms.\n Further reading: If you like this work, you may like  Base64 encoding and decoding at almost the speed of a memory copy (Software: Practice and Experience 50 (2), 2020) and  Parsing Gigabytes of JSON per Second (VLDB Journal 28 (6), 2019).", "posttime": "2020-10-21 00:51:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "utf-8,unicode,fast,字节", "title": "超快的Unicode(UTF-8)验证", "title_en": "Ridiculously fast Unicode (UTF-8) validation", "transed": 1, "url": "https://lemire.me/blog/2020/10/20/ridiculously-fast-unicode-utf-8-validation/", "via": "", "real_tags": ["utf-8", "unicode", "fast", "字节"]}, {"category": "", "categoryclass": "", "imagename": "fd1a7bf2fa596ede87f8ecaecef8a370.png", "infoid": 1030109, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这项出版活动于2018年3月开始。我们的计划是记录HTTP/3及其底层协议：Quic。为什么，它们是如何工作的，协议细节，实现等等。\n这本书是完全免费的，旨在让任何愿意提供帮助的人参与其中。\n这本书的读者应该对TCP/IP网络、HTTP和Web的基础有基本的了解。要进一步了解和了解HTTP/2，我们建议先阅读http2中解释的详细信息。\n这本书是由丹尼尔·斯滕伯格创作的，这部作品是由丹尼尔·斯坦伯格开始的。丹尼尔是世界上使用最广泛的HTTP客户端软件cURL的创始人和主要开发者。Daniel已经在HTTP和Internet协议上工作了二十多年，并且是http2的作者。\n如果您在本文件中发现错误、遗漏、错误或明目张胆的谎言，请将受影响段落的更新版发送给我们，我们将对其进行修改。我们会给每一个帮忙的人适当的奖励。我希望随着时间的推移将这份文件做得更好。\n本文档及其所有内容均受知识共享署名4.0许可证许可。", "note_en": "This book effort was started in March 2018. The plan is to document HTTP/3 and its underlying protocol: QUIC. Why, how they work, protocol details, the implementations and more.\n The book is entirely free and is meant to be a collaborative effort involving anyone and everyone who wants to help out.\n  A reader of this book is presumed to have a basic understanding of TCP/IP networking, the fundamentals of HTTP and the web. For further insights and specifics about HTTP/2 we recommend first reading up the details in    http2 explained  .\n  This book is created and the work is started by    Daniel Stenberg  . Daniel is the founder and lead developer of    curl  , the world&#39;s most widely used HTTP client software. Daniel has worked with and on HTTP and internet protocols for over two decades and is the author of    http2 explained  .\n    If you find mistakes, omissions, errors or blatant lies in this document, please send us a refreshed version of the affected paragraph and we will make amended versions. We will give proper credits to everyone who helps out. I hope to make this document better over time.\n   This document and all its contents are licensed under the    Creative Commons Attribution 4.0 license  .", "posttime": "2020-10-21 00:51:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "http", "title": "HTTP/3说明", "title_en": "HTTP/3 Explained", "transed": 1, "url": "https://http3-explained.haxx.se/en/", "via": "", "real_tags": ["http"]}, {"category": "", "categoryclass": "", "imagename": "719f1cb3f5239eeb1de0288de565acfd.jpg", "infoid": 1030108, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌的博客甚至还点缀着GIF--这对于这家搜索巨头来说，在其消费产品发布时是很常见的。这些GIF包括将谷歌以外的搜索引擎设置为移动和桌面Chrome的默认搜索引擎的分步屏幕录像。沃克在帖子中将这两个过程都描述为“微不足道的简单”，但当你注意到在桌面上完成这项工作需要多少步骤时，它们看起来确实有点像是自己的目标，包括在单击哪里进一步深入查看“设为默认”命令时似乎有短暂的犹豫。\n据报道，谷歌还提到一些公司出于服务质量的考虑选择他们的搜索引擎作为默认搜索引擎，包括苹果和Mozilla(我们自己的Frederic Lardinois有一个链接中断)。归根结底，谷歌的论点是，它的搜索引擎之所以占据主导地位，并不是因为反竞争行为导致了缺乏可行的选择，相反，它是构建高质量产品的结果，消费者随后会从一系列选择中选择使用。\n司法部今天早上撤销了全部诉讼，初步分析表明，从距离选举很近的角度来看，这一审查的时机可能不合时宜，因为它实际上没有任何重要的牙齿。然而，有一些迹象表明，在两党州级总检察长的支持下，稍后可能会进行更广泛的两党调查，因此无论选举结果如何，这并不一定都会烟消云散。", "note_en": "Google’s blog post is even sprinkled with GIFs – something that’s pretty common for the search giant when it comes to its consumer product launches. These GIFs include step-by-step screen recordings of setting search engines other than Google as your default in Chrome on both mobile and desktop. These processes are both described as “trivially easy” by Walker in the post, but they do look like a bit of an own-goal when you notice just how many steps it takes to get the job done on desktop in particular, including what looks like a momentary hesitation in where to click to drill down further for the “Make Default” command.\n   Google also reportedly makes reference to companies choosing their search engine as default because of the quality of their service, including both  Apple   and Mozilla (with a link drop for our own Frederic Lardinois). Ultimately, Google is making the argument that its search engine isn’t dominant because of a lack of viable options fostered by anti-competitive practices, but that instead it’s a result of building a quality product that consumers then opt in to using from among a field of choices.\n  The DOJ’s full suit dropped this morning, and an initial analysis suggests that this scrutiny is perhaps inopportunely timed in terms of its proximity to the election to actually have any significant teeth. There is some indication that a more broad, bipartisan investigation with support from state level attorney generals on both sides of the aisle could follow later, however, so it’s not necessarily all just going to go away regardless of election outcome.", "posttime": "2020-10-21 00:36:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,谷歌,google,rust,博客", "title": "\n谷歌称美国司法部的反垄断诉讼在GIF充斥的博客回应中存在“严重缺陷”", "title_en": "\n\t\t\t\tGoogle calls DOJ’s antitrust lawsuit “deeply flawed” in GIF-laden blog response\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/google-calls-dojs-antitrust-lawsuit-deeply-flawed-in-gif-laden-blog-response/", "via": "", "real_tags": ["美国", "谷歌", "google", "rust", "博客"]}, {"category": "", "categoryclass": "", "imagename": "c49ab0eb00bd97af592f1d0f1c36ca0b.jpg", "infoid": 1030107, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为虚拟Invoca峰会的一部分，该公司宣布了这些消息。在活动之前，首席执行官格雷格·约翰逊(曾在Salesforce担任高管)告诉我，客户一直在要求Invoca超越之前的重点，向营销团队提供“对话情报”。\n“我们需要在如何支持营收之旅上达成一致，”约翰逊回忆企业告诉他的话。“我们已经沿着这条路走了，但当COVID袭击时，我们加大了三倍的努力。”\n他认为，在大流行和相关的封锁期间，Invoca提供的数据变得更加重要，当时企业只有“两个反馈来源”-数字互动和客户对话。约翰逊说，虽然有很多分析工具可以跟踪在线行为，但“客户对话真的很重要，因为它们能理解为什么”人们会以某种方式行事。\n与此同时，约翰逊说，呼叫中心团队不得不转向在家工作，这意味着他们不得不改用在线软件，“一切都坏了”，而主管“对座席的表现不再有任何可见性”。\nInvoca正试图通过确保营销、销售、客户体验和电子商务团队都可以访问相同的通话数据来解决这些问题。\n例如，他说，Invoca Customer BBQGuys的代理商需要数据来了解，如果他们想要的特定烤架找不到，应该向他们的客户推荐哪些产品。或者，医疗保健提供者可能会使用呼叫数据来预测和准备他们所在地区的COVID病例可能会上升的时间。\n“我们一直将自己视为一个应用程序和一个平台，”约翰逊补充道。“我们已经为您提供了在Invoca使用这些数据来自动应用这些见解的能力，而无需任何人工干预。因此，对于我们来说，我们仔细考虑了使用案例，以将此数据提供给其他工具，并创建了四个解决方案…。它们的臀部是真正连接在一起的。“。\nInvoca for ECommerce，Invoca for Sales和现有的Invoca for Marketing产品现在都可以使用，而Invoca for Sales目前正在签约11月份的测试版。\n与此同时，Invoca Exchange已经包含了40多个集成，包括Google、Salesforce、Facebook、Adobe、Tealium和Five9。该公司还宣布与Full Story和Criteo建立新的合作伙伴关系。", "note_en": "The company is making these announcements as part of its virtual  Invoca   Summit. Ahead of the event, CEO Gregg Johnson (previously an executive at Salesforce) told me that customers have been asking Invoca to expand beyond its previous focus on providing “conversation intelligence” to marketing teams.\n “‘We need to get aligned on how we support the revenue journey,&#39;” Johnson recalled businesses telling him. “We were already going down this path, but when COVID hit, we tripled down on it.”\n  He argued that the data that Invoca provides has become even more important during the pandemic and related lockdowns, when businesses only had “two sources of feedback” — digital interactions and customer conversations. And while there are plenty of analytics tools for tracking online behavior, Johnson said, “Customer conversations are really important because they get at why” people are behaving in a certain way.\n And at the same time, Johnson said call center teams have had to shift to working at home, which meant that they had to switch to online software and “everything broke,” while supervisors “no longer had any visibility into how agents were performing.”\n  Invoca is trying to address these issues by making sure that marketing, sales, customer experience and e-commerce teams all have access to the same call data.\n For example, he said that agents at Invoca customer  BBQGuys need data to understand what products to recommend for their customers if the specific grill that they want isn’t available. Or a healthcare provider might use call data to predict and prepare when COVID cases might be rising in their area.\n “We’ve always viewed ourselves as an application and a platform,” Johnson added. “We already give you ability to use this data at Invoca to automatically apply these insights without any human intervention at all. So for us, we thought through use cases to feed this data into other tools and created four solutions … that are really joined at the hip.”\n Invoca for eCommerce, Invoca for Sales and the existing Invoca for Marketing product are all available now, while Invoca for Sales is currently signing up beta testers for NOvember.\n The Invoca Exchange, meanwhile, already includes more than 40 integrations, including Google, Salesforce, Facebook, Adobe, Tealium, and Five9. The company is also announcing new partnerships with FullStory and Criteo.", "posttime": "2020-10-21 00:35:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "分析,analytics,invoca", "title": "\n呼叫分析平台Invoca扩展到销售、电子商务和客户体验领域", "title_en": "\n\t\t\t\tCall analytics platform Invoca expands into sales, e-commerce and customer experience\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/call-analytics-platform-invoca-expands-into-sales-e-commerce-and-customer-experience/", "via": "", "real_tags": ["分析", "analytics", "invoca"]}, {"category": "", "categoryclass": "", "imagename": "dcc29415534949a288a8fe6e9345520f.jpg", "infoid": 1030106, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "结合世界上最受欢迎的运动和每个人最喜欢的离散概率分布，这篇帖子使用泊松分布预测足球比赛。\n足球(对我的美国读者来说是足球)充满了陈词滥调：“这是一场两个半场的比赛”、“一场比赛一场比赛”和“利物浦没能赢得英超联赛”。你不太可能听到“将每支球队的进球数量视为独立的泊松过程，统计模型显示主队今天有60%的机会获胜”。但这实际上也有点陈词滥调(这里、这里已经讨论过了，这里讨论得特别好)。我们会发现，简单的泊松模型过于简单化了。但这是一个很好的起点，也是学习统计建模的一种很好的直观方式。所以，如果你来这里是为了赚钱，我听说这家伙不出家门就能每月挣5000 GB。\n该模型是建立在每支球队得分/丢球的数量基础上的。过去得分较高的球队未来进球的可能性更大。我们将导入最近结束的英超(2016/17)赛季的所有比赛结果。这些数据的来源多种多样(kaggle、focket-data.co.uk、gihub、api)。我为该API构建了一个R包装器，但这一次我将采用CSV路线。\n将熊猫作为PD导入matplotlib.pylot作为PLT导入Numpy作为NP从scipy.stats导入Poisson，skellam EPL_1617=PD。Read_CSV(&#34；http://www.football-data.co.uk/mmz4281/1617/E0.csv&#34；)EPL_1617=EPL_1617[[&#39；HomeTeam&39；，&#39；AwayTeam&#39；，&#39；FTHG&39；，&#39；FTAG&#39；]EPL_1617=EPL_1617。重命名(Columns={&#39；FTHG&#39；：&#39；HomeGoals&#39；，&#39；FTAG&#39；：&#39；AwayGoals&#39；})EPL_1617。头部()。\n我们导入了一个CSV作为熊猫数据帧，其中包含2016-17赛季英超赛季380场英超比赛的各种信息。我们将数据帧限制在我们感兴趣的列中(具体地说，就是球队名称和每支球队的进球数量)。我将省略生成本文中图表的大部分代码。但别担心，您可以在我的GitHub页面上找到该代码。我们的任务是模拟本赛季的最后一轮比赛，所以我们必须删除最后10行(每场比赛周包含10场比赛)。\n你会注意到，平均来说，主队比客队进了更多的球。这就是所谓的“主场优势”(这里讨论)，并不是足球所特有的。现在是介绍泊松分布的方便时间。它是一个离散的概率分布，描述特定时间段(例如，90分钟)内具有已知平均发生速率的事件数量的概率。一个关键的假设是事件的数量与时间无关。在我们的背景下，这意味着进球的可能性不会因为比赛中已经进了多少球而变得更多/更少。取而代之的是，进球数量纯粹表示为平均进球率的函数。如果这一点不清楚，也许这个数学公式会变得更清楚：\n表示平均比率(例如，平均目标数、您收到的平均信件数等)。因此，我们可以将主队和客队的进球数视为两个独立的泊松分布。下面的图表显示了进球与相应泊松分布估计的进球数量相比的比例。\n平局的概率简单地说就是两支球队进球相等的项目的总和。\n请注意，我们将每支球队的进球数量视为独立事件(即P(A N B)=P(A)P(B))。两个泊松分布之差实际上称为Skellam分布。因此，我们可以通过将平均目标值输入到该分布中来计算平局的概率。\n因此，希望您能看到我们如何调整这种方法来为特定的比赛建模。我们只需要知道每支球队的平均进球数量，并将这些数据输入泊松模型。让我们来看看切尔西和桑德兰(分别获得第一名和最后一名的球队)的进球分布情况。\n现在您应该确信，每支球队的进球数量可以用泊松分布来近似。由于样本量相对较大(每支球队最多打19场主客场比赛)，这个近似值的准确性可能会有很大差异(特别是在本赛季早些时候，球队打的比赛较少)。和以前一样，我们现在可以计算出在这场切尔西桑德兰比赛中发生各种事件的可能性。但是，我们将构建一个更通用的泊松回归模型(那是什么？)，而不是分别对待每一场比赛。\n#导入Poisson回归模型所需的工具将statsmodel s.api作为sm import statsmodel s.mulma.api作为SMF Goal_Model_Data=pd导入。Concat([EPL_1617[[&#39；HomeTeam&#39；，&#39；AwayTeam&#39；，&#39；HomeGoals&#39；]。指定(HOME=1)。重命名(Columns={&#39；HomeTeam&#39；：&#39；Team&#39；，&#39；AwayTeam&#39；：&#39；对手&#39；，&#39；HomeGoals&#39；：&#39；Goals&#39；})，EPL_1617[[&#39；AwayTeam&#39；，&#39；HomeTeam&#39；，&#39；AwayGoals&#39；]]。指定(HOME=0)。重命名(Columns={&#39；AwayTeam&#39；：&#39；Team&#39；，&#39；HomeTeam&#39；：&#39；Andicator&#39；，&#39；AwayGoals&#39；：&#39；Goals&#39；})])POISSON_MODEL=SMF。GLM(FORMULA=&#34；进球~主场+球队+对手&#34；，DATA=GOAL_MODEL_DATA，FAMILY=sm.。家人。泊松(Poisson))。拟合()泊松模型。摘要()。\n如果您对smf.glm(...)。这一部分，你可以在这里找到更多信息(编辑：这篇文章的早期版本错误地使用了一个通用的估计公式(GEE)-有什么不同？)。我更感兴趣的是模型汇总表中coef列中显示的值，它们类似于线性回归中的斜率。与Logistic回归类似，我们取参数值的指数。正值表示更多目标()，而更接近零的值表示更中性的效果()。在桌子底部，你可能会注意到HOME的系数是0.2969。这反映了这样一个事实，即主队通常比客队进更多的球(具体地说，==1.35倍的可能性)。但并不是所有的团队都是生而平等的。切尔西的系数是0.0789，而桑德兰的相应系数是-0.9619(差不多是说切尔西(桑德兰)更好(更糟糕！)。得分高于平均水平)。最后，对手会根据对手的实力来惩罚/奖励球队。这反映了每支球队的防守实力(切尔西：-0.3036；桑德兰：0.3707)。换句话说，你在对阵切尔西的比赛中进球的可能性更小。希望这一切在统计上和直觉上都有意义。\n让我们开始为即将到来的比赛做一些预测。我们只需将我们的团队传递到POISSON_MODEL中，它将返回该团队的预期平均进球数(我们需要运行两次-我们分别计算每个团队的预期平均进球数)。所以让我们看看我们预计切尔西和桑德兰会进多少球。\n和前面一样，我们有两个泊松分布。由此，我们可以计算出各种事件的概率。我将把它包装在一个Simulation_Match函数中。\nDef Simulation_Match(FOOT_MODEL，HomeTeam，awayTeam，max_Goals=10)：HOME_Goals_avg=FOOT_MODEL。预测(PD)。DataFrame(data={&#39；team&#39；：HomeTeam，&#39；对方&#39；：awayTeam，&#39；home&#39；：1}，index=[1]))。VALUES[0]Away_Goals_avg=FOOT_MODEL。预测(PD)。DataFrame(data={&#39；team&#39；：awayTeam，&#39；对方&#39；：HomeTeam，&#39；home&#39；：0}，index=[1]))。VALUES[0]TEAM_PRED=[[泊松。[HOME_Goals_Avg，Away_Goals_Avg]中的Team_Avg的范围(0，max_Goals+1)内i的PMF(i，Team_Avg)RETURN(NP.。外部(NP.。数组(Team_pred[0])，np。Array(team_pred[1])Simulate_Match(泊松_model，&#39；切尔西&#39；，&#39；桑德兰&#39；，max_Goals=3)\nArray([[0.03108485，0.01272529，0.00260469，0.00035543]，[0.0951713，0.03896054，0.00797469，0.00108821]，[0.14569118，0.059642，0.01220791，0.00166586]，[0.14868571，0.06086788，0.01245883，0.0017001]])。\n这个矩阵简单地显示了切尔西(矩阵的行)和桑德兰(矩阵的列)打进特定数量进球的概率。例如，沿对角线，两队进球数相同(例如P(0-0)=0.031)。因此，您可以通过将所有对角线条目相加来计算抽签的赔率。斜线以下的一切都代表着切尔西的胜利(例如P(3-0)=0.149)。如果您更喜欢高于/低于市场，您可以通过对列号和行号之和(均从零开始)小于3(即形成左上角三角形的6个值)的条目求和来估计P(低于2.5个目标)。幸运的是，我们可以使用基本的矩阵操作函数来执行这些计算。\n嗯，我们的模型给桑德兰2.7%的获胜机会。但这是对的吗？为了评估预测的准确性，我们将把我们的模型返回的概率与Betfair交易所提供的赔率进行比较。\n与传统的博彩公司不同，在博彩交易所(必发不是唯一的博彩交易所--它只是最大的一家)，你与其他人打赌(必发从赢家中提取佣金)。它就像是体育赛事的股票市场。而且，就像股票市场一样，由于有效市场假说，Betfair的可用价格反映了这些事件发生的真实价格/几率(至少在理论上)。下面，我发布了5月21日周日Betfair交易所的截图(比赛开始前几个小时)。\n盒子里的数字代表了最好的可用价格和按这些价格可供使用的金额。蓝色方框表示反向押注(即押注某一事件将会发生-用股市术语来说是长期的)，而粉红色方框表示平局押注(即押注某事不会发生-即做空)。例如，如果我们将100 GB押注于切尔西获胜，如果他们获胜，我们将获得原始金额加100*1.13=GB 13(当然，如果他们没有获胜，我们将失去我们的GB 100)。现在，我们如何将这些价格与我们的模型返回的概率进行比较呢？小数赔率可以很容易地转换成概率：它只是小数赔率的倒数。例如，切尔西获胜的隐含概率是1/1.13%(=0.885-我们的模型将概率设为0.889)。我关注的是小数赔率，但您可能也熟悉Moneyline(美式)赔率(例如+200)和分数赔率(例如2/1)。小数赔率、货币线和概率之间的关系如下表所示。我将坚持使用小数赔率，因为其他选择要么对我来说不熟悉(Moneyline)，要么就是愚蠢的(分数赔率)。\n因此，我们有自己的模型概率，并且(如果我们信任交易所)我们知道每个事件发生的真实概率。理想情况下，我们的模型将识别市场低估了事件发生的可能性(或在平局押注的情况下不发生)的情况。例如，在一个简单的掷硬币游戏中，想象一下，如果你猜对了，每赌1美元(加上你的赌注)，你会得到2美元的奖励。隐含的概率是0.333，但是任何有效的模型都会返回概率0.5%。下表比较了我们的模型和Betfair交易所返回的赔率。\n根据我们的模型，绿色单元格表示进行有利可图的押注的机会(单元格的不透明度由隐含的差异决定)。我已经强调了模型和Betfair在绝对值上的差异(相对差异可能与任何交易策略更相关)。透明单元格表示交易所和我们的模型大体一致的情况。强烈的色彩暗示要么是我们的模型错了，要么是交易所错了。考虑到我们模型的简单性，我倾向于后者。\n那么我们应该把房子押在曼联身上吗？可能不会(尽管他们确实赢了！)。有一些非统计原因让人抗拒支持他们。狂热的足球迷会注意到，这些比赛代表着本赛季的最后一场比赛周。大多数球队几乎没有什么可争夺的，这意味着比赛的可预测性较差(特别是当它们涉及的是没有动力的“大”球队时)。雪上加霜的是，曼联将在三天后的欧联杯决赛中对阵阿贾克斯。曼联主帅何塞·穆里尼奥甚至确认他将让一线队休息，把他们留到更重要的决赛中去。以类似的方式，关键球员的受伤/停职，管理层的解雇将使我们的模型不准确。永远不要低估领域知识在统计建模/机器学习中的重要性！我们还可以考虑对模型进行改进，在考虑以前的比赛时纳入时间(即最近的比赛应该是\n从统计学上讲，泊松分布是否合适呢？我们的模型建立在这样一种信念之上，即目标数量可以准确地表示为泊松分布。如果这一假设是错误的，那么模型输出将是不可靠的。给出带有均值的泊松分布，那么在该时间段的一半内的事件数量遵循带有均值/2的泊松分布。在足球术语中，根据我们的泊松模型，在上半场和下半场应该有相等数量的进球。不幸的是，这似乎并不成立。\nEPL_1617_Halves=PD。Read_CSV(&#34；http://www.football-data.co.uk/mmz4281/1617/E0.csv&#34；)EPL_1617_Halves=EPL_1617_Halves[[&#39；FTHG#39；，&#39；FTAG#39；，&#39；HTHG#39；，&#39；HTAG#39；]]EPL_1617_Halves[&#39；FHGoals&39；]=EPL_1617_Halves[&#39；HTHG&#39；]+EPL_1617_Halves[&#39；HTAG&#39；]EPL_1617_Halves[&#39；SHGoals&39；]=EPL_1617_Halves[&#39；FTHG&39；]+EPL_1617_Halves[&#39；FTAG&#39；]-EPL_1617_Halves[&#39；FHGoals&39；]EPL_1617_Halves=EPL_1617_Halves[[&#39；FHGoals&#39；]。，&#39；SHGoals&#39；]]。\n我们有无可辩驳的证据，违反了我们模型的一个基本假设，使整个帖子像桑德兰一样毫无意义！或者我们可以在我们粗糙的第一次尝试的基础上再接再厉。与简单的单变量泊松模型相比，使用双变量泊松分布可能会更成功。威布尔分布也被认为是一种可行的选择。这些可能是未来博客文章的主题。\n我们建立了一个简单的泊松模型来预测英超比赛的结果。尽管其固有的缺陷，它重新创造了几个特征，这将是任何预测足球模型所必需的(主场优势，不同的进攻实力和对手质量)。总而言之，不要把房租押在钱上，但对于更复杂的现实模型来说，这是一个很好的起点。谢谢你的阅读！", "note_en": "Combining the world’s most popular sport with everyone’s favourite discrete probability distribution, this post predicts football matches using the Poisson distribution.\n Football (or soccer to my American readers) is full of clichés: “It’s a game of two halves”, “taking it one game at a time” and “Liverpool have failed to win the Premier League”. You’re less likely to hear “Treating the number of goals scored by each team as independent Poisson processes, statistical modelling suggests that the home team have a 60% chance of winning today”. But this is actually a bit of cliché too (it has been discussed  here,  here,  here,  here and  particularly well here). As we’ll discover, a simple Poisson model is, well, overly simplistic. But it’s a good starting point and a nice intuitive way to learn about statistical modelling. So, if you came here looking to make money,  I hear this guy makes £5000 per month without leaving the house.\n  The model is founded on the number of goals scored/conceded by each team. Teams that have been higher scorers in the past have a greater likelihood of scoring goals in the future. We’ll import all match results from the recently concluded Premier League (2016/17) season. There’s various sources for this data out there ( kaggle,  football-data.co.uk,  github,  API). I built an  R wrapper for that API, but I’ll go the csv route this time around.\n import  pandas  as  pd import  matplotlib.pyplot  as  plt import  numpy  as  np import  seaborn from  scipy.stats  import  poisson , skellam epl_1617  =  pd . read_csv ( &#34;http://www.football-data.co.uk/mmz4281/1617/E0.csv&#34; ) epl_1617  =  epl_1617 [[ &#39;HomeTeam&#39; , &#39;AwayTeam&#39; , &#39;FTHG&#39; , &#39;FTAG&#39; ]] epl_1617  =  epl_1617 . rename ( columns = { &#39;FTHG&#39; :  &#39;HomeGoals&#39; ,  &#39;FTAG&#39; :  &#39;AwayGoals&#39; }) epl_1617 . head ()\n  We imported a csv as a pandas dataframe, which contains various information for each of the 380 EPL games in the 2016-17 English Premier League season. We restricted the dataframe to the columns in which we’re interested (specifically, team names and numer of goals scored by each team). I’ll omit most of the code that produces the graphs in this post. But don’t worry, you can find that code on  my github page. Our task is to model the final round of fixtures in the season, so we must remove the last 10 rows (each gameweek consists of 10 matches).\n   You’ll notice that, on average, the home team scores more goals than the away team. This is the so called ‘home (field) advantage’ (discussed  here) and  isn’t specific to soccer. This is a convenient time to introduce the  Poisson distribution. It’s a discrete probability distribution that describes the probability of the number of events within a specific time period (e.g 90 mins) with a known average rate of occurrence. A key assumption is that the number of events is independent of time. In our context, this means that goals don’t become more/less likely by the number of goals already scored in the match. Instead, the number of goals is expressed purely as function an average rate of goals. If that was unclear, maybe this mathematical formulation will make clearer:\n represents the average rate (e.g. average number of goals, average number of letters you receive, etc.). So, we can treat the number of goals scored by the home and away team as two independent Poisson distributions. The plot below shows the proportion of goals scored compared to the number of goals estimated by the corresponding Poisson distributions.\n   The probability of a draw is simply the sum of the events where the two teams score the same amount of goals.\n Note that we consider the number of goals scored by each team to be independent events (i.e. P(A n B) = P(A) P(B)). The difference of two Poisson distribution is actually called a  Skellam distribution. So we can calculate the probability of a draw by inputting the mean goal values into this distribution.\n      So, hopefully you can see how we can adapt this approach to model specific matches. We just need to know the average number of goals scored by each team and feed this data into a Poisson model. Let’s have a look at the distribution of goals scored by Chelsea and Sunderland (teams who finished 1st and last, respectively).\n   You should now be convinced that the number of goals scored by each team can be approximated by a Poisson distribution. Due to a relatively sample size (each team plays at most 19 home/away games), the accuracy of this approximation can vary significantly (especially earlier in the season when teams have played fewer games). Similar to before, we could now calculate the probability of various events in this Chelsea Sunderland match. But rather than treat each match separately, we’ll build a more general Poisson regression model ( what is that?).\n # importing the tools required for the Poisson regression model import  statsmodels.api  as  sm import  statsmodels.formula.api  as  smf goal_model_data  =  pd . concat ([ epl_1617 [[ &#39;HomeTeam&#39; , &#39;AwayTeam&#39; , &#39;HomeGoals&#39; ]] . assign ( home = 1 ) . rename (  columns = { &#39;HomeTeam&#39; : &#39;team&#39; ,  &#39;AwayTeam&#39; : &#39;opponent&#39; , &#39;HomeGoals&#39; : &#39;goals&#39; }),  epl_1617 [[ &#39;AwayTeam&#39; , &#39;HomeTeam&#39; , &#39;AwayGoals&#39; ]] . assign ( home = 0 ) . rename (  columns = { &#39;AwayTeam&#39; : &#39;team&#39; ,  &#39;HomeTeam&#39; : &#39;opponent&#39; , &#39;AwayGoals&#39; : &#39;goals&#39; })]) poisson_model  =  smf . glm ( formula = &#34;goals ~ home + team + opponent&#34; ,  data = goal_model_data ,  family = sm . families . Poisson ()) . fit () poisson_model . summary ()\n   If you’re curious about the  smf.glm(...) part, you can find more information  here (edit: earlier versions of this post had erroneously employed a Generalised Estimating Equation (GEE)-  what’s the difference?). I’m more interested in the values presented in the  coef column in the model summary table, which are analogous to the slopes in linear regression. Similar to  logistic regression, we take the  exponent of the parameter values. A positive value implies more goals (), while values closer to zero represent more neutral effects (). Towards the bottom of the table you might notice that  home has a  coef of 0.2969. This captures the fact that home teams generally score more goals than the away team (specifically, =1.35 times more likely). But not all teams are created equal. Chelsea has a  coef of 0.0789, while the corresponding value for Sunderland is -0.9619 (sort of saying Chelsea (Sunderland) are better (much worse!) scorers than average). Finally, the  opponent* values penalize/reward teams based on the quality of the opposition. This relfects the defensive strength of each team (Chelsea: -0.3036; Sunderland: 0.3707). In other words, you’re less likely to score against Chelsea. Hopefully, that all makes both statistical and intuitive sense.\n Let’s start making some predictions for the upcoming matches. We simply pass our teams into  poisson_model and it’ll return the expected average number of goals for that team (we need to run it twice- we calculate the expected average number of goals for each team separately). So let’s see how many goals we expect Chelsea and Sunderland to score.\n     Just like before, we have two Poisson distributions. From this, we can calculate the probability of various events. I’ll wrap this in a  simulate_match function.\n def  simulate_match ( foot_model ,  homeTeam ,  awayTeam ,  max_goals = 10 ):  home_goals_avg  =  foot_model . predict ( pd . DataFrame ( data = { &#39;team&#39; :  homeTeam ,  &#39;opponent&#39; :  awayTeam , &#39;home&#39; : 1 },  index = [ 1 ])) . values [ 0 ]  away_goals_avg  =  foot_model . predict ( pd . DataFrame ( data = { &#39;team&#39; :  awayTeam ,  &#39;opponent&#39; :  homeTeam , &#39;home&#39; : 0 },  index = [ 1 ])) . values [ 0 ]  team_pred  =  [[ poisson . pmf ( i ,  team_avg )  for  i  in  range ( 0 ,  max_goals + 1 )]  for  team_avg  in  [ home_goals_avg ,  away_goals_avg ]]  return ( np . outer ( np . array ( team_pred [ 0 ]),  np . array ( team_pred [ 1 ]))) simulate_match ( poisson_model ,  &#39;Chelsea&#39; ,  &#39;Sunderland&#39; ,  max_goals = 3 )\n array([[ 0.03108485, 0.01272529, 0.00260469, 0.00035543], [ 0.0951713 , 0.03896054, 0.00797469, 0.00108821], [ 0.14569118, 0.059642 , 0.01220791, 0.00166586], [ 0.14868571, 0.06086788, 0.01245883, 0.0017001 ]])\n This matrix simply shows the probability of Chelsea (rows of the matrix) and Sunderland (matrix columns) scoring a specific number of goals. For example, along the diagonal, both teams score the same the number of goals (e.g. P(0-0)=0.031). So, you can calculate the odds of draw by summing all the diagonal entries. Everything below the diagonal represents a Chelsea victory (e.g P(3-0)=0.149). If you prefer Over/Under markets, you can estimate P(Under 2.5 goals) by summing the entries where the sum of the column number and row number (both starting at zero) is less than 3 (i.e. the 6 values that form the upper left triangle). Luckily, we can use basic matrix manipulation functions to perform these calculations.\n       Hmm, our model gives Sunderland a 2.7% chance of winning. But is that right? To assess the accuracy of the predictions, we’ll compare the probabilities returned by our model against the odds offered by the  Betfair exchange.\n  Unlike traditional bookmakers, on betting exchanges (and Betfair isn’t the only one- it’s just the biggest), you bet against other people (with Betfair taking a commission on winnings). It acts as a sort of stock market for sports events. And, like a stock market, due to the  efficient market hypothesis, the prices available at Betfair reflect the true price/odds of those events happening (in theory anyway). Below, I’ve posted a screenshot of the Betfair exchange on Sunday 21st May (a few hours before those matches started).\n  The numbers inside the boxes represent the best available prices and the amount available at those prices. The blue boxes signify back bets (i.e. betting that an event will happen- going long using stock market terminology), while the pink boxes represent lay bets (i.e. betting that something won’t happen- i.e. shorting). For example, if we were to bet £100 on Chelsea to win, we would receive the original amount plus 100*1.13= £13 should they win (of course, we would lose our £100 if they didn’t win). Now, how can we compare these prices to the probabilities returned by our model? Well, decimal odds can be converted to the probabilities quite easily: it’s simply the inverse of the decimal odds. For example, the implied probability of Chelsea winning is 1/1.13 (=0.885- our model put the probability at 0.889). I’m focusing on decimal odds, but you might also be familiar with  Moneyline (American) Odds (e.g. +200) and fractional odds (e.g. 2/1). The relationship between decimal odds, moneyline and probability is illustrated in the table below. I’ll stick with decimal odds because the alternatives are either unfamiliar to me (Moneyline) or just stupid (fractional odds).\n      So, we have our model probabilities and (if we trust the exchange) we know the true probabilities of each event happening. Ideally, our model would identify situations the market has underestimated the chances of an event occurring (or not occurring in the case of lay bets). For example, in a simple coin toss game, imagine if you were offered $2 for every $1 wagered (plus your stake), if you guessed correctly. The implied probability is 0.333, but any valid model would return a probability of 0.5. The odds returned by our model and the Betfair exchange are compared in the table below.\n   Green cells illustrate opportunities to make profitable bets, according to our model (the opacity of the cell is determined by the implied difference). I’ve highlighted the difference between the model and Betfair in absolute terms (the relative difference may be more relevant for any trading strategy). Transparent cells indicate situations where the exchange and our model are in broad agreement. Strong colours imply that either our model is wrong or the exchange is wrong. Given the simplicity of our model, I’d lean towards the latter.\n  So should we bet the house on Manchester United? Probably not ( though they did win!). There’s some non-statistical reasons to resist backing them. Keen football fans would notice that these matches represent the final gameweek of the season. Most teams have very little to play for, meaning that the matches are less predictable (especially when they involve unmotivated ‘bigger’ teams). Compounding that, Man United were set to play Ajax in the Europa Final three days later.  Man United manager, Jose Mourinho, had even confirmed that he would rest the first team, saving them for the much more important final. In a similar fashion, injuries/suspensions to key players, managerial sackings would render our model inaccurate. Never underestimate the importance of domain knowledge in statistical modelling/machine learning! We could also think of improvements to the model that would  incorporate time when considering previous matches (i.e. more recent matches should be weighted more strongly).\n Statistically speaking, is a Poisson distribution even appropriate? Our model was founded on the belief that the number goals can be accurately expressed as a Poisson distribution. If that assumption is misguided, then the model outputs will be unreliable. Given a Poisson distribution with mean , then the number of events in half that time period follows a Poisson distribution with mean /2. In football terms, according to our Poisson model, there should be an equal number of goals in the first and second halves. Unfortunately, that doesn’t appear to hold true.\n epl_1617_halves  =  pd . read_csv ( &#34;http://www.football-data.co.uk/mmz4281/1617/E0.csv&#34; ) epl_1617_halves  =  epl_1617_halves [[ &#39;FTHG&#39; ,  &#39;FTAG&#39; ,  &#39;HTHG&#39; ,  &#39;HTAG&#39; ]] epl_1617_halves [ &#39;FHgoals&#39; ]  =  epl_1617_halves [ &#39;HTHG&#39; ]  +  epl_1617_halves [ &#39;HTAG&#39; ] epl_1617_halves [ &#39;SHgoals&#39; ]  =  epl_1617_halves [ &#39;FTHG&#39; ]  +  epl_1617_halves [ &#39;FTAG&#39; ]  -  epl_1617_halves [ &#39;FHgoals&#39; ] epl_1617_halves  =  epl_1617_halves [[ &#39;FHgoals&#39; ,  &#39;SHgoals&#39; ]]\n  We have irrefutable evidence that violates a fundamental assumption of our model, rendering this whole post as pointless as Sunderland!!! Or we can build on our crude first attempt. Rather than a simple univariate Poisson model, we might have  more success with a  bivariate Poisson distriubtion. The  Weibull distribution has also been proposed as a  viable alternative. These might be topics for future blog posts.\n  We built a simple Poisson model to predict the results of English Premier League matches. Despite its inherent flaws, it recreates several features that would be a necessity for any predictive football model (home advantage, varying offensive strengths and opposition quality). In conclusion, don’t wager the rent money, but it’s a good starting point for more sophisticated realistic models. Thanks for reading!", "posttime": "2020-10-21 00:31:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "建模,football,模型", "title": "用统计建模预测足球比赛成绩", "title_en": "Predicting Football Results with Statistical Modelling", "transed": 1, "url": "https://dashee87.github.io/football/python/predicting-football-results-with-statistical-modelling/", "via": "", "real_tags": ["建模", "football", "模型"]}, {"category": "", "categoryclass": "", "imagename": "e55c566d25cce96ec3b6891d7462d382.jpg", "infoid": 1030105, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "杰米·戴维拉(Jamie Davila)在俄勒冈州比弗顿的家中领导着一个由7个州的8名工程师组成的团队，为科技初创公司Ultranauts工作。像数百万在家工作的其他人一样，她依赖于流行的通讯工具，如Zoom和Slake。\n但达维拉和Ultranauts也以与大多数公司不同的方式进行远程工作。他们遵循一套独特的政策和做法，以促进员工的多样性和包容性。\n所有视频会议都有闭路字幕，以满足喜欢以文本形式吸收信息的员工的需要。会议议程是提前分发的，所以那些不舒服发言的人可以提前以书面形式发表意见。员工每天都会被要求提供反馈，比如他们是否相信自己的优势受到重视，以及他们在工作中是否感到孤独。\n“我们的整个想法是创造一个安全的空间，让每个人的声音都能被听到，”36岁的达维拉说。\nUltranauts多年来一直致力于解决大流行期间乃至更长时间内如此多公司面临的挑战：如何有效地远程工作，朝着多元化和包容性目标取得进展，以及建立强大的组织文化。\n这家公司由麻省理工学院(Massachusetts Institute Of Technology)的两名前室友于2013年创立，从第一天起就有了一支远程员工队伍。它的成立也是为了利用自闭症患者尚未开发的才华，他们的思维和处理信息的方式往往与其他人不同。Ultranauts公司75%的员工患有自闭症。\n因此，这家小型初创公司可能会为美国企业界提供如何招聘、管理和激励分散在各地的员工的课程，如果没有办公室生活中的面对面和走廊交谈，他们的工作和职业生涯可能会受到影响。\n康奈尔大学杨谭就业与残疾研究所学术主任苏珊·布鲁耶尔(Susanne Bruyere)表示：“Ultraauts有目的地建造一个真正支持人们的工作场所，这是非同寻常的。”“它的技术和工具绝对可以得到更广泛的应用。”\n这家初创企业的客户包括美国国际集团(AIG)、纽约梅隆银行(BNY Mellon)和信诺(Cigna)等大公司。它从网站和应用程序的人工质量测试开始，但已稳步转向更高级的工作，如数据质量工程、数据分析和自动化软件测试。\n当大流行来袭时，总部位于纽约的Ultranauts失去了业务，因为几个大客户为了节省现金而削减了开支。但它很快从一些公司那里获得了新的工作，这些公司尽管经济低迷，但仍在加速数字项目。该业务目前有90名员工，高于一年前的60名。它的目标是在两年内扩大到200家。\nUltranauts得到了社会影响投资者的支持-他们寻求财务回报，而不是意外之财-包括残疾机会基金、可持续风险投资公司、Wasabi Ventures和Moai Capital。到目前为止，他们已经投资了570万美元。\n该公司坚称，其劳动力是一种竞争优势。它说，与其说自闭症患者的大脑是负责计算任务的，不如说是自闭症谱系中的人是一个多样化的群体。\n一个人可能很快就能识别出模式，而另一个人的认知风格更有节制，但却得出了不同的模式和修复代码的方法。关键在于利用团队的各种人才。\n会议被记录、转录和存档，这不仅是为了适应那些更喜欢阅读而不是倾听的员工，也是为了培养一个更开放的组织。这延伸到Ultranauts六人领导团队的每周会议。这些会议的记录，包括做出的决定和背后的原因，都发布在全公司的Slake频道上。\n该公司联合创始人兼总裁阿特·谢克特曼(Art Shectman)说，“这比大多数商界人士所能接受的透明度高得多。”\nUltranauts的领导人相信，他们完全开放、明确的沟通方式-没有不成文的规则-可以让任何公司受益。Ultranauts将赠送一款有价值的自主开发的软件产品Biodex，作为测试的一部分，以查看其工具和实践可能在企业主流中扎根的范围有多广。\nUltranauts的每个员工都有一个Biodex个人资料，其中说明了个人的工作、沟通和反馈偏好。您对消息的典型响应时间是多长时间-几分钟、几个小时、同一天？如果一位同事有建设性的批评，你希望如何收到反馈-口头的还是书面的？\n每天早上，Biodex都会发出一条机器人信息，其中包含两个问题：“互动”程度如何--准备好与他人交流--你今天感觉如何？你今天的精力水平是多少？员工的回答从1分到10分。\nUltranauts的联合创始人兼首席执行官拉杰什·安丹(Rajesh Ananda)将Biodex描述为“如何与人合作的快速入门指南”。\nUltranauts正在让大约12个组织的团队，从大公司到初创公司，试用Biodex的测试版。如果与外界的试运行进展顺利，Ultranauts计划在今年年底之前让Biodex在Slake应用商店上免费下载。其他Ultranauts应用程序，比如其针对员工情绪和福祉的民意调查程序，也将紧随其后。\n“我们制造了一个引擎，为那些以前没有公平机会的人释放机会，”安丹说。“但如果我们只为自己这么做，就不会有太大影响.”\n阿纳丹曾是贝恩咨询公司的顾问，后来转行。2003年，他前往全球抗击艾滋病、结核病和疟疾基金工作，后来在联合国儿童基金会创办了一个社会企业孵化器。他和软件工程顾问谢克曼先生从麻省理工学院时代起就知道自闭症患者很难找到工作。\n许多自闭症患者很好地完成了学校的结构化课程，获得了本科生和研究生的大学学位。但他们经常在进入就业市场的第一个障碍-传统的求职面试-面前跌跌撞撞。他们倾向于在社交、非正式交谈和阅读交流的非语言暗示方面苦苦挣扎。\n莱斯利·里斯(Leslie Reis)就是这样。她拥有软件工程硕士学位，但在Ultranauts去年聘用她之前，她一直没有全职工作。\n里斯女士解释说，写作是她最好的沟通方式。“对很多组织来说，这被认为是一个缺点，”她在一封电子邮件中说，“而不是让我更充分地参与。”\nUltranauts不使用工作经验来筛选求职者。该公司确实会进行结构化面试，但招聘在很大程度上是基于它开发的技能评估，这些评估是为了衡量解决新问题的能力，以及接受指导和应用的能力。工作模拟是另一个考验。\n匹兹堡的一家投资公司Tulco今年聘请了Ultranauts来做数据质量工作。Tulco投资于它认为通过应用数据科学和人工智能可以变得更有效率和更有利可图的传统业务，但创建这些人工智能算法需要筛选杂乱无章的数据宝库。\nUltranauts的工作给Tulco负责数据科学的执行副总裁马修·马罗达留下了深刻印象。他说，在一个项目中，其团队清理了大量信息，并以惊人的速度将大量信息加载到人工智能模型中，用几天而不是几周的时间。\n“这是一支拥有内在力量的劳动力，”马罗达说。“他们真的很擅长模式识别，真的很擅长细节工作。”\n近年来，在倡导团体的推动下，为了寻找新的熟练工人，几家公司开始了招聘和聘用自闭症员工的计划，包括SAP、微软、安永(Ernst&amp；Young)和摩根大通(JPMorgan Chase)。\nUltranauts是欧洲和美国为数不多的几家主要雇用自闭症工人从事技术工作的小公司和非营利组织之一。其他公司包括Specialisterne、Auticon、Daivergent和Aspiritech。专家说，Ultranauts从一开始就完全远程工作，并开发出精心制作的数字工具和工作场所实践的组合，因此脱颖而出。\n它的文化肯定引起了达维拉的共鸣，她患有自闭症，四年前受聘，没有接受过正规的计算机培训。从那时起，她不仅掌握了编程语言，还掌握了作为经理的技能。\nUltranauts也是她进入中产阶级的阶梯。“在我得到Ultranauts的工作之前，我靠食品券过活，”达维拉回忆道。“现在，我有了自己的房子。而且这是一所不错的房子，坐落在一个很好的社区里。“", "note_en": "From her home in Beaverton, Ore., Jamie Davila leads a team of eight engineers in seven states for the technology start-up Ultranauts. Like millions of other people during these work-from-home times, she relies on popular communication tools like Zoom and Slack.\n But Ms. Davila and Ultranauts also work remotely in ways that make them different from most companies. They follow a distinctive set of policies and practices to promote diversity and inclusion among employees.\n All video meetings have closed captioning, for workers who prefer to absorb information in text. Meeting agendas are distributed in advance so people who are uncomfortable speaking up can contribute in writing beforehand. Employees are asked daily for feedback, like whether they believe their strengths are valued and if they feel lonely at work.\n “The whole idea is to create a safe space that allows everyone to be heard,” Ms. Davila, 36, said.\n Ultranauts has been working for years on the challenges confronting so many companies during the pandemic, and probably beyond: how to effectively work remotely, make progress toward diversity and inclusion goals, and build a strong organizational culture.\n The company, founded in 2013 by two former roommates at the Massachusetts Institute of Technology, has had a remote work force from Day 1. It was also founded to use the untapped talent of autistic people, who often think and process information differently from the rest of the population. Seventy-five percent of Ultranauts employees are on the autism spectrum.\n So the small start-up may offer lessons for corporate America in how to hire, manage and motivate far-flung employees, whose work and careers can suffer without the face time and hallway conversations of office life.\n “Ultranauts’ purposeful construction of a workplace that really supports people is extraordinary,” said Susanne Bruyere, academic director of the Yang-Tan Institute on Employment and Disability at Cornell University. “Its techniques and tools could absolutely be applied more broadly.”\n The start-up’s customers include big companies like AIG, BNY Mellon and Cigna. It began with manual quality testing of websites and apps but has steadily moved to more advanced work like data-quality engineering, data analytics and automated software testing.\n When the pandemic hit, Ultranauts, which is based in New York, lost business as a couple of large customers made cuts to conserve cash. But it quickly picked up new work from companies that are accelerating digital projects despite the downturn. The business now has 90 employees, up from 60 a year ago. Its goal is to expand to 200 in two years.\n Ultranauts is backed by social-impact investors — which seek financial returns, but not windfalls — including The Disability Opportunity Fund, SustainVC, Wasabi Ventures and Moai Capital. They have invested $5.7 million so far.\n The company insists its work force is a competitive advantage. The edge, it says, is not so much that autistic brains are wired for computing tasks but that people on the autism spectrum are a diverse group.\n One person may recognize patterns quickly, while another has a more measured cognitive style but arrives at different patterns and ways to fix code. The key lies in harnessing the varied talents of teams.\n Meetings are recorded, transcribed and archived not only to accommodate workers who prefer reading to listening but also to foster a more open organization. That extends to the weekly meetings of the six-person leadership team at Ultranauts. The notes of those sessions, including the decisions made and reasons behind them, are published on the companywide Slack channel.\n “It is a lot more transparency than most people in business are comfortable with,” said Art Shectman, a co-founder and the company’s president.\n  Ultranauts’ leaders believe their style of wide-open, explicit communication — no unwritten rules — could benefit any company. Ultranauts is giving away a valued homegrown software product, Biodex, as part of a test to see how widely its tools and practices might take root in the corporate mainstream.\n Each employee at Ultranauts has a Biodex profile that states the person’s work, communication and feedback preferences. What is your typical response time to messages — a few minutes, a few hours, same day? If a colleague has constructive criticism, how do you want to receive the feedback — orally or in writing?\n Each morning, Biodex sends out a bot message with two questions: How “interactive” — ready to communicate with others — are you feeling today? What’s your energy level today? Workers answer on a 1-to-10 scale.\n Rajesh Anandan, a co-founder and the chief executive of Ultranauts, describes Biodex as “a quick-start guide for how to work with a person.”\n Ultranauts is letting teams at about a dozen organizations, from big corporations to start-ups, try out a test version of Biodex. If trial runs with outsiders go well, Ultranauts plans to make Biodex a free download on the Slack app store by the end of the year. Other Ultranauts apps, like its program for polling worker sentiment and well-being, would follow.\n “We’ve built an engine that unlocks opportunity for people who haven’t had a fair shot before,” Mr. Anandan said. “But if we only do that for ourselves, it won’t have much of an impact.”\n Mr. Anandan is a former Bain consultant who switched gears and careers. In 2003, he went to work for the Global Fund to Fight AIDS, Tuberculosis and Malaria and later started an incubator for social ventures at UNICEF. Both he and Mr. Shectman, a software engineering consultant, had known since their M.I.T. days autistic people who struggled to find work.\n Many autistic people do well with the structured coursework of school, earning undergraduate and graduate university degrees. But they often stumble at the first hurdle into the job market — the traditional job interview. They tend to struggle with social interaction, speaking informally and reading the nonverbal cues of communication.\n That was the case for Leslie Reis. She holds a master’s degree in software engineering, but had not had a full-time job until Ultranauts hired her last year.\n Writing, Ms. Reis explained, is how she communicates best. “For a lot of organizations, that was perceived as something that would be a drawback,” she said in an email, “rather than a way for me to participate more fully.”\n Ultranauts does not use work experience to filter job candidates. The company does conduct structured interviews, but hiring is largely based on skills assessments that it has developed to measure traits like the ability to work through new problems and take guidance and apply it. Work simulations are another test.\n Tulco, an investment firm in Pittsburgh, hired Ultranauts this year to do data-quality work. Tulco invests in traditional businesses that it thinks can become more efficient and profitable by applying data science and artificial intelligence, but creating those A.I. algorithms requires sifting through troves of messy data.\n Ultranauts’ work has impressed Matthew Marolda, executive vice president for data science at Tulco. On one project, its team cleaned up and loaded a vast amount of information into an A.I. model with remarkable speed, days instead of weeks, he said.\n “This is a work force with inherent strengths,” Mr. Marolda said. “They’re really good at pattern recognition and really good at detail work.”\n Seeking new pools of skilled workers, and prodded by advocacy groups, several companies in recent years have begun programs to recruit and employ autistic workers, including SAP, Microsoft, Ernst &amp; Young and JPMorgan Chase.\n Ultranauts is one of a handful of small companies and nonprofits in Europe and the United States that employ mainly autistic workers for jobs in technology. Others include Specialisterne, Auticon, Daivergent and Aspiritech. Ultranauts stands out, experts say, for working entirely remotely from the outset and for developing its carefully crafted combination of digital tools and workplace practices.\n Its culture has certainly resonated with Ms. Davila, who is autistic and was hired four years ago, with no formal training in computing. Since then, she has mastered not only programming languages but also skills as a manager.\n Ultranauts has also been her ladder to the middle class. “Before I got the job at Ultranauts, I was on food stamps,” Ms. Davila recalled. “Now, I own my own house. And it’s a nice house in a nice neighborhood.”", "posttime": "2020-10-21 00:30:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "员工,percent", "title": "75%的Ultranauts员工患有自闭症", "title_en": "Seventy-five percent of Ultranauts employees are on the autism spectrum", "transed": 1, "url": "https://www.nytimes.com/2020/10/18/technology/ultranauts-remote-work.html", "via": "", "real_tags": ["员工", "percent"]}, {"category": "", "categoryclass": "", "imagename": "f33dceb6cd937047277f3db234940a3c.jpg", "infoid": 1030104, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌搜索已经将世界上的信息放在了超过10亿人的指尖上。我们的工程师致力于提供尽可能最好的搜索引擎，不断改进和微调。我们认为，这就是为什么广大美国人看重并经常热爱我们的免费产品的原因。\n司法部今天的诉讼存在严重缺陷。人们使用谷歌是因为他们选择了，而不是因为他们是被迫这样做的，也不是因为他们找不到替代品。\n这起诉讼对消费者没有任何帮助。相反，它会人为地支持质量较低的搜索选择，提高手机价格，并使人们更难获得他们想要使用的搜索服务。\n让我们来谈谈细节吧。商务部的控诉依据可疑的反垄断论据来批评我们为方便人们使用谷歌搜索所做的努力。\n是的，就像无数其他企业一样，我们付钱推广我们的服务，就像一个谷物品牌可能会付钱给超市，让他们在一排结束时或在与眼睛齐高的货架上进货。对于数字服务来说，当你第一次购买一台设备时，它有一种主屏幕的“视平架”。在移动领域，这个货架由苹果以及AT&amp；T、Verizon、三星和LG等公司控制。在台式计算机上，这个架子空间由微软压倒性地控制。\n因此，我们与这些公司中的许多公司就与眼睛水平的货架空间进行谈判。但让我们明确一点--我们的竞争对手也很容易找到，如果你想用他们的话。\n我们与苹果和其他设备制造商和运营商的协议与许多其他公司传统上用来分发软件的协议没有什么不同。其他搜索引擎，包括微软的必应(Bing)，都在与我们争夺这些协议。我们的协议已经通过了反复的反垄断审查。\n苹果在其Safari浏览器中加入了谷歌搜索功能，因为他们说谷歌是“最好的”。这种安排不是排他性的-我们的竞争对手必应(Bing)和雅虎(Yahoo！付费成为突出的特色，其他竞争对手的服务也出现了。", "note_en": "Google Search has put the world’s information at the fingertips of over a billion people. Our engineers work to offer the best search engine possible, constantly  improving and fine-tuning it. We think that’s why a wide cross-section of Americans  value and often  love our free products.\n Today’s lawsuit by the Department of Justice is deeply flawed. People use Google because they choose to, not because they&#39;re forced to, or because they can&#39;t find alternatives.\n This lawsuit would do nothing to help consumers. To the contrary, it would artificially prop up lower-quality search alternatives, raise phone prices, and make it harder for people to get the search services they want to use.\n  Let&#39;s talk specifics. The Department&#39;s complaint relies on dubious antitrust arguments to criticize our efforts to make Google Search easily available to people.\n Yes, like countless other businesses, we pay to promote our services, just like a cereal brand might pay a supermarket to stock its products at the end of a row or on a shelf at eye level. For digital services, when you first buy a device, it has a kind of home screen “eye level shelf.” On mobile, that shelf is controlled by Apple, as well as companies like AT&amp;T, Verizon, Samsung and LG. On desktop computers, that shelf space is overwhelmingly controlled by Microsoft.\n So, we negotiate agreements with many of those companies for eye-level shelf space. But let&#39;s be clear—our competitors are readily available too, if you want to use them.\n Our agreements with Apple and other device makers and carriers are no different from the agreements that many other companies have traditionally used to distribute software. Other search engines, including Microsoft’s Bing, compete with us for these agreements. And our agreements have passed repeated antitrust reviews.\n  Apple features Google Search in its Safari browser because they say Google is “ the best.” This arrangement is not exclusive—our competitors Bing and Yahoo! pay to prominently feature, and other rival services also appear.", "posttime": "2020-10-21 00:30:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "诉讼,flawed,搜索", "title": "一个有很大缺陷的诉讼，对消费者毫无帮助", "title_en": "A deeply flawed lawsuit that would do nothing to help consumers", "transed": 1, "url": "https://blog.google/outreach-initiatives/public-policy/response-doj/", "via": "", "real_tags": ["诉讼", "flawed", "搜索"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1030103, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳到主要内容五年前，我做了一个网站，允许你输入几个域名，并在SSL证书即将到期时收到一封电子邮件。没有广告，没有大惊小怪，人们不用像Nagios那样设置自己的监控，就可以轻松地跟踪自己的网站。就像我所有的软件一样，我是在GPL下发布的，特别是AGPL，因为它是基于Web的软件。AGPL与GPL有一点不同，简而言之，您必须发布您在同一许可证下所做的任何修改的源代码，即使当您在线托管软件(而不是分发)时也是如此。使用常规的GPL，如果您在线提供修改后的版本，只要您分发它，您就不必发布源代码。\n最近，我发现一家公司托管了证书监控器，但做了一些修改(品牌和荷兰语翻译)，没有提到它的来源，没有提供源代码，也没有提到许可证。我不会链接到公司，你可以看到截图，但我不想给他们任何额外的曝光。\n在这篇文章中，我将谈论我做了什么来强制执行许可证，以及它是如何进行的。tl；dr，不像预期的那样。这家公司及时而友好地做出了回应，但还是做了半个assedattempt(在我的网站上添加了一个链接，文字为“受到人头马启发”)，然后在我的投诉之后，整个网站都被撤下了。\n早在2010年，我就是欧洲自由软件基金会(Free Software Foundation Europe)的成员，曾多次向软件自由法律中心/软件自由保护协会(Software Freedom Law Center/SoftwareFreedom Protection ancy)捐款(布拉德利总是在Linux Outlaw播客上谈论这件事)，在工作中，每当我们收到GPL对我们咖啡机的请求时，我就是GOTO的人，所以你可能会说我对开源很感兴趣。如果SFC或FSFor GPL Violations.org的任何人正在阅读这篇文章，并想用它做更多的事情，请给我发一封电子邮件。\n我根据GPL和AGPL(如果适用)许可我个人所有的东西，不喜欢许可许可(麻省理工学院，第3条BSD，X11，Apache)，因为它们允许人们拿走你的东西，永远不会回来。我更喜欢强制你投稿的强有力的版权许可。这里有一篇关于许可与版权许可的好文章。\n以下两段摘自plausible.io文章，解释他们的许可证切换。我发现他们很好地解释了AGPL，所以我在这里引用了他们。请去看看他们的文章，我通过阅读他们的文章发现谷歌有一个反AGPL的政策。\nAGPL许可与原始的GPL许可相同，唯一的附加条款是允许通过网络与许可软件交互的用户接收该程序的源代码。\nAGPL旨在确保企业回馈开源社区，即使在云中将软件作为服务运行时也是如此。\n如果您在云中的Web服务中使用了AGPL许可的代码，则需要将其开源。它从根本上阻止了那些从未打算对开源做出贡献的公司从开源工作中获利。\n它明确禁止公司与开源项目进行寄生性竞争。如果不将这些更改贡献给原始项目，他们将无法获取代码，对其进行更改，并将其作为竞争产品进行销售。\n如果您在服务器上运行修改后的程序并让其他用户在该服务器上与其通信，则您的服务器还必须允许他们下载与在该服务器上运行的修改后的版本相对应的源代码代码。\n公司需要清楚地说明并提供到原始项目的突出说明和链接，以便正在考虑使用其软件版本的人们能够了解原始源代码。\n如果一家公司修改了原始软件，他们需要开源并发布他们的修改，例如，为原始项目做出贡献。\n遗憾的是，我在手机上只拍了几张屏幕截图，所以我不能再展示更多了，但相似之处将非常明显。在我们的电子邮件交谈中，他们承认这是我的密码，所以这一点毋庸置疑。\n首先是我的原始代码上的常见问题解答项目，然后是它们的翻译版本：\n他们声称拥有作为作者的全部版权(这是错误的，他们不是作者，这也不是他们的版权)。\n然而，他们忘了删除第一封电子邮件中的取消订阅链接，上面写着，要想不再收到电子邮件，请点击这个链接，然后再没有链接点击。\n很难找到这家公司的实际电子邮件地址。他们的网站上什么都没有，只有一张联系人表格。隐藏在他们的工作页面上，我发现了一份工作列表，其中包括一个地址，以及在他们的一般条款和条件页上，他们是一个支持地址。\n也许这只是我一个人的想法，但是每个主要的票务支持系统都支持电子邮件，就在门户网站旁边。请让我发一封电子邮件，而不是强迫我使用网页。\n因此，我决定使用乔布斯的电子邮件，而不是一个大的组织，所以可能没有专门的人力资源，这是一个巨大的变化，工作直接交给了创始人。\n我们的电子邮件交谈很有礼貌，他们及时回复，在几天内，其他GPL请求我从未得到任何回应，或者至少花了两周时间才得到初步回复，他们确实在那里获得了一些分数。\n我的第一封电子邮件说，他们的工具看起来很像我几年前写的，他们可能应该提供源代码。我声明他们确实在他们托管的另一个工具(SSL解码器)上提供了源代码/链接，他们也应该在这里这样做。我也注意到了查找电子邮件地址的困难。\n三天后，他们的第一个回应是，一些公司说谢谢你的服务，我们调查了一下，事实上，我们已经使用你的代码3年了，但没有提供任何归属。我们在页脚添加了一些内容，如果您想要文本更改，请告诉我们。\n遗憾的是，我没有截取新的页脚文本的屏幕截图，但上面写着灵感来自人头马，并链接到这个网站。伙计们，这不是它的工作原理，我的第一封电子邮件足够清楚，完整的源代码和许可证，不是这些废话。创建一个新的GitHub/GitLab回购，执行一次初始提交，然后再也不碰它，真的不是那么难。\n我的回答是，以一种更文明的方式，他们应该在相同的许可下提供源代码。\n四天后，他们做出了回应，声称他们已经内部讨论过，并决定将该网站下线。\n我们的谈话结束了，他们关闭了他们的网站，从来没有遵守许可证。我认为他们现在并没有违反它，但已经有几年了。\n他们应该从一开始就向任何人提供源代码，最好是在网上，从他们建立服务的时候起就是这样。即使他们没有给我命名，但提供了源代码，我也没问题。\n我不确定他们的网站在线多久了(他们在电子邮件中说有3年)，但他们一直在违反许可证，一半的试用期以糟糕的结局收场。我怀疑他们的服务没有那么多人使用，因为他们只是在没有通知的情况下就把它撤下了。我希望他们所有的订户都知道这件事，因为如果他们的证书即将过期，他们永远不会收到通知。\n当我还在自己托管这段代码时，我有大约20,000个域被检查。当我取消这项服务时，每个域名都收到了一条消息，通知他们30天后他们的服务将被取消，并提供一些他们可以使用的替代服务。\n你知道奇怪的是什么吗？他们还托管了SSL解码器，这是我以同样的思路编写的另一款软件，带有指向源代码的链接。这是一张图片，您可以在其中看到URL，在底部是许可证和源代码链接：\n那么，为什么在那里做，而不在另一个网站上做呢？我怀疑这是因为他们更改了源代码来翻译它，而SSL解码器站点似乎没有更改。\n他的朋友兼Revspace成员马克·詹森(Mark Janssen)也主持了这些服务。在这里阅读他的帖子，他说他已经分叉了存储库，链接到了源代码，并对分叉使用了相同的许可证。\n提供源代码并使用相同的许可证并不是那么困难。只管去做就行了。\n标签：agpl、blog、gpl、Legal、License、php、security、ssl", "note_en": "Skip to main content          Five years ago I made  a website that allowed you to put in a few domains and get an email when the SSL certificate was about to expire. No ads, no fuss, justan easy way for people to keep tabs on their sites without setting up theirown monitoring like Nagios. As with all of my software, I released it underthe GPL, specificaly the AGPL due to it being web based software. The AGPLdiffers from the GPL on one point, simplified, you have to release the sourceof any modifications you make under the same license, even when you host the software (not distribute)online. With the regular GPL, you don&#39;t have to release the source if you provide a modified version online, only if you distribute it.\n Recently I found a company that hosted certificatemonitor, with some modifications (branding and a dutch tanslation), without any reference to its origin, no sourcecode provided and no mention of the license. I&#39;m not going to link to the company,you can see the screenshots, but I don&#39;t want to give them any extra exposure.\n In this article I&#39;ll talk about what I did to enforce the license and how it went.TL;DR, not as expected. The company responded timely and friendly, but did a half assedattempt (added a link to my site with  Inspired By Remy as the text), then after my complaints, took down the entire site.\n I was a member of the  Free Software Foundation Europe back in  2010 and have  donated many times to the Software Freedom Law Center / SoftwareFreedom Conservancy (the thing Bradley always talked about on the Linux Outlaws Podcast) and at work I&#39;m the goto guy whenever we  get a  GPL request for our coffeemachines, so you might say I have a heart for open source. If anyone from the SFC or FSFor GPL violations.org is reading this and wants to do more with it, please send me an email.\n I license all my personall stuff under the GPL and AGPL (where applicable)and dislike the permissive licenses (MIT, 3 clause BSD, X11, Apache) becausethey allow people to take your stuff and never contribute back. I preferstrong copyleft licenses that force you to contribute.  Here is a goodarticle going into permissive vs copyleft licensing.\n  The following two paragraphs are taken from the  Plausible.io articleexplaining their license switch. I found them to explain the AGPL so well,that I cited them here. Please  go read their article, I found out that Google has a  anti AGPL policy by reading their article.\n  The AGPL license is identical to the original GPL license with the onlyadditional term being to allow users who interact with the licensed softwareover a network to receive the source for that program.\n AGPL is designed to ensure corporations contribute back to the open sourcecommunity even when running the software as a service in the cloud.\n If you used AGPL-licensed code in your web service in the cloud, you arerequired to open source it. It basically prevents corporations that never hadany intention to contribute to open source from profiting from the open sourcework.\n It explicitly prohibits corporations from parasitically competing with an opensource project. They won&#39;t be able to take the code, make changes to it andsell it as a competing product without contributing those changes back to theoriginal project.\n  If you run a modified program on a server and let other users communicatewith it there, your server must also allow them to download the source codecorresponding to the modified version running there\n  A corporation needs to be clear and provide a prominent mention and link tothe original project so people that are considering to use their version ofsoftware can be aware of the original source\n If a corporation modifies the original software, they need to open source andpublish their modifications by for instance contributing back to the originalproject\n  I sadly only took a few screenshots on my phone, so I cannot show more than this,but the similarities will be more than clear. In the email conversation we had,they ackowledged that it was my code, so there&#39;s no doubt on that.\n  First the FAQ items on my original code and next to it their translated version:\n  They claim full copyright as authors (which is wrong, they&#39;re not authors and its not their copyright)\n       They however forgot to remove the  Unsubscribe link from the first email,it says,  To receive no more emails, click this link and then, no link to click.\n  It was pretty hard to find an actual email address for this company. Nothing listedon their website, just a contact form. Hidden on their  jobs page I found a  job listing which included an address and on their  General Terms and Conditionspage their was a support address.\n Maybe thats just me, but every major support ticket systemsupports emailing, next to web portals. Please let me just send an email instead of forcingme to use a webpage.\n So I decided to go for the Jobs email, not a large organisation so probably no dedicated HR,big change that jobs go right to the founders.\n Our email conversation was polite and they responded in a timely fashion, within days,other GPL requests I did never got any response or took at least two weeks for an initial reply, they did score some points there.\n  My first email stated that their tool looks a lot like one I wrote a fewyears ago and that they probably should provide the source code. I stated thatthey did provice the source/links on another tool they host (ssl decoder) and that they should do that here as well. I also noted the dificulty in findingan email address.\n Their first response, three days later, says some companyspeak thank youfor your service, we looked into it and indeed, we are using your code for 3years, without providing any attribution. We&#39;ve added something to thefooter, if you want textual changes, please let us know.\n I sadly did not take a screenshot of the new footer text, but it said  Inspired by Remy, and linked to this site. That&#39;s not how it works guys,my first email was clear enough, full source code and license, not this crap. It really is not that hard to create a new github/gitlab repo, do one initialcommit and never touch it again.\n My response said, in a more civil way, that they should provide source code under the same license.\n Four days later,  they responded, stating that they had discussed internallyand decided to take the site offline.\n That concludes our conversation, they took down their site and never complied withthe license. I think they&#39;re not violating it now, but have done for a few years.\n  They should have provided the source code to anyone asking, preferably online, rightfrom the start when they set up their service. Even if they would not have namedme, but had provided source code, it would be fine by me.\n I&#39;m not sure how long their site was online (they state 3 years in the email),but they have been violating the license all that time, and the half-assedattempt ended badly. I suspect their service was not used that much, becausethey just took it down without notice. I hope all their subscribers know ofit, since they will never be notified if their certificate is about to expire.\n When I still hosted this code myself, I had about 20,000 (twenty thousand) domains beingchecked. When I cancelled the service, each and every one of those domains got a messagenotifying them that their service would be cancelled after 30 days with a few alternativeservices they could use.\n And you know what the strange thing is? They have also hosted the  SSL decoder,another piece of software I wrote in the same vein, with a link to the source code.Here&#39;s an image where you can see the URL and at the bottom, the license and sourcecode link:\n  So why do it there but not on the other site? I suspect it&#39;s because they changed the source code to translate it, and the ssl decoder site doesn&#39;t seem to be changed.\n  A friend and fellow  revspace member Mark Janssen has also hosted these services.  Read his post here, where he states that he has forked the repositories, linksto the source code and has used the same license for the forks.\n   It&#39;s not that hard to provide the source and use the same license. &#34;Just do it&#34;.\nTags:  agpl,  blog,  gpl,  legal,  license,  php,  security,  ssl", "posttime": "2020-10-21 00:29:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,强制执行,agpl", "title": "我在我的代码上强制执行了AGPL，下面是它是如何进行的(糟糕)", "title_en": "I enforced the AGPL on my code, here's how it went (bad)", "transed": 1, "url": "https://raymii.org/s/blog/I_enforced_the_AGPL_on_my_code_heres_how_it_went.html", "via": "", "real_tags": ["代码", "强制执行", "agpl"]}, {"category": "", "categoryclass": "", "imagename": "a82620a696f0002b566d8a68087d1a92.jpg", "infoid": 1030102, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "去年6月，谷歌首次透露，它将以全价点菜购买的方式销售单个体育场流媒体游戏。当时，我们感到遗憾的是，这种老式的商业模式忽视了这项服务最大的潜在特点：便利性。流媒体的价值通常在于，它能够简单地立即投入一部新作品，而不必像我们当时写的那样，考虑额外购买一部作品的边际成本是否值得。\n现在，谷歌似乎终于领会了这个想法，至少有点领会。从今天开始，谷歌将开始为即将到来的体育场游戏提供限时的、完全免费的演示，只需点击一个链接，就可以在网络浏览器上立即播放这些游戏。\n今天的节目从Pac-Man Mega Tunes Battle开始，这是一款64人参与的竞争性Battle Royale游戏，它是一款经典的迷宫游戏，让人联想到俄罗斯方块99和超级马里奥兄弟35(Super Mario Bros.35)。你现在只需点击一个链接就可以试用这款游戏，不需要下载或安装。谷歌表示，虽然你需要一个谷歌体育场账户才能参加，但你不需要注册谷歌体育场专业版每月10美元的免费试用，甚至不需要输入任何支付信息。\n谷歌将在未来几天将演示服务扩展到另外两款游戏：世嘉的4X战略游戏“人类”(Human Kin)将于10月21日获得免费在线演示，育碧(Ubisoft)类似冒险游戏“神仙之息”的Fenyx Rise将于10月22日开始试玩。所有三个演示都只能在七天内提供，可以通过体育场店面和YouTube游戏预告片上的链接访问。", "note_en": "Last June, Google  first revealed that it would be selling individual Stadia streaming games as full-priced à la carte purchases. At the time,  we lamented that this old-fashioned business model ignored the service&#39;s greatest potential feature: convenience. The value of streaming media is often in the &#34;ability to simply dive into a new work immediately, without having to think about whether it&#39;s worth the marginal cost of an additional purchase,&#34; as we wrote at the time.\n Now, Google finally seems to be catching on to that idea, at least a little bit. Starting today, Google will begin offering time-limited, completely free demos for upcoming Stadia games, which can be played instantly in a Web browser simply by clicking on a link.\n The program begins today with  Pac-Man Mega Tunnel Battle, a 64-player competitive Battle Royale take on the classic maze game that evokes instant comparisons to   Tetris 99 and   Super Mario Bros. 35. You can try that game out right now  just by clicking a link, with no downloads or installation required. While you will need a Google Stadia account to take part, you  won&#39;t need to  sign up for a &#34;free trial&#34; of Google&#39;s $10/month Stadia Pro subscription or even enter any payment information, Google says.\n Google will extend the demo offer to two more games in the coming days: Sega&#39;s 4X strategy game  Humankind gets a free streaming demo on October 21, while Ubisoft&#39;s  Breath of the Wild-like adventure   Immortals Fenyx Rising starts on October 22. All three demos will only be available for seven days, accessible via links found on  the Stadia storefront and  the YouTube trailers of the games themselves.", "posttime": "2020-10-21 00:16:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "体育,免费,游戏,谷歌,google", "title": "谷歌体育场的免费演示可以证明游戏流媒体的价值", "title_en": "Google Stadia’s free demos could prove the value of game streaming", "transed": 1, "url": "https://arstechnica.com/gaming/2020/10/google-stadias-free-demos-could-prove-the-value-of-game-streaming/", "via": "", "real_tags": ["体育", "免费", "游戏", "谷歌", "google"]}, {"category": "", "categoryclass": "", "imagename": "c13b3f1099d36de5e19f251181f82cea.jpg", "infoid": 1030101, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "浏览网络已经成为一项毫不费力-而且往往是不需要动脑筋的-任务。你拿起手机或电脑，打开一个新的标签，然后在地址栏中键入几个单词。\n由多姆·莱卡(Dom Leca)和塞巴斯蒂安·梅特罗特(Sébastien Métrot)创立的新创业公司Beam正在开发一款全新的应用程序，既是网络浏览器，也是笔记应用程序。Dom Leca之前创立了Sparrow，这是一款适用于MacOS和iOS的电子邮件应用程序，于2012年被谷歌收购。塞巴斯蒂安·梅特罗特已经为苹果公司工作了几年。\n莱卡告诉我：“每个人都抱怨Instagram和Facebook会让你的大脑变得油炸，让你浪费时间。”然而，网络浏览器代表着无限的知识和无限的可能性。\n如果你对某个小众话题非常感兴趣，那么你很有可能通过阅读、看视频、在论坛上互动等方式学到很多东西。但当您关闭浏览器窗口时，所有内容都会消失。\n当然，有一个网络历史功能-但它是一个没有连接的长长的链接列表。当然，你可以在另一款应用程序中为页面添加书签或做笔记--但这是一个繁琐的过程。\n更重要的是，你可能不知道什么是重要的，什么不是。大多数激情项目都是从毫无意义的搜索查询开始的。", "note_en": "Browsing the web has become an effortless — and often mindless — task. You grab your phone or computer, you open a new tab and you type a few words in the address bar.\n Beam, a new startup founded by Dom Leca and Sébastien Métrot, is working on a brand new app that is both a web browser and a note app. Dom Leca previously founded  Sparrow, an email app for macOS and iOS that was acquired by Google in 2012. Sébastien Métrot has been working for Apple for several years.\n  “Everybody complains that Instagram and Facebook fry your brain and make you waste time,” Leca told me. And yet, web browsers represent infinite knowledge and infinite possibilities.\n If you’re very passionate about a niche topic, chances are you can learn a ton of things by reading stuff, watching videos, interacting on forums and more. But when you close your browser window, everything disappears.\n Sure, there’s a web history feature — but it’s a long list of links with no connection. Sure, you can bookmark pages or take notes in another app — but it’s a cumbersome process.\n More importantly, you might not know what’s important and what’s not. Most passion projects start with meaningless search queries.", "posttime": "2020-10-21 00:12:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "web,网络", "title": "\nBeam正在构建一个从您的Web活动中收集知识的Web浏览器", "title_en": "\n\t\t\t\tBeam is building a web browser that gathers knowledge from your web activity\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/beam-is-building-a-web-browser-that-gathers-knowledge-from-your-web-activity/", "via": "", "real_tags": ["web", "网络"]}, {"category": "", "categoryclass": "", "imagename": "efbead0a98804aa7d9b26d59296f4cd4.png", "infoid": 1030100, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在试用期间，谷歌向用户提供了每月7.99美元的订阅费，用户可以自动从三个主题中的一个中选择10张照片，包括人和宠物，风景，或者“一切都有一点”的混合。这些4×6的照片打印在无光泽的白色卡纸上，边框为1/8英寸。\n即将推出的新订阅利用了早期测试的反馈，现在让用户可以更多地控制他们收到的打印内容以及打印效果。它还将价格降至每月6.99美元，包括运费和税前。\n有了新的Premium Print系列(订阅名为Premium Print Series)，Google Photos将使用机器学习技术从您最近的10张照片中挑选10张进行打印。但用户可以编辑照片选择，他们可以选择哑光或光面处理，也可以在照片发货前添加边框。\n谷歌指出，多亏了纸质纸背，这些照片可以选择性地变成明信片。\n订户还可以选择跳过一个月，如果他们不再使用这项服务，可以很容易地取消这项服务。\n逆向工程师Jane Manun Wong最近发现了这一更新版本的服务，她详细介绍了新的定制选项和更低的价位。\n谷歌建议您每月支付6.99美元/月…的订阅服务，用于运送您的照片打印。好的!。\n抛光和边框是可调的。如果你愿意，你也可以跳过一个月的指纹。\n谷歌表示，高级打印系列将在未来几周内向谷歌照片用户推出。\n该公司今天还在沃尔格林推出当天打印，立即可用。这扩大了Google Photos现有的当天取件选项，其中已经包括了CVS和沃尔玛的当天取件服务。\n使用谷歌照片应用程序，顾客现在可以订购4×6、5×7或8×10的照片打印，以便当天在沃尔格林取货。谷歌表示，这几乎使向谷歌照片用户提供当天照片的商店数量翻了一番。\n除了印刷品和订阅，Google Photos继续提供画布印刷品和照相册-后者现在最多有140页-作为其在线印刷店的一部分。\n扩大照片打印服务和订阅的推出正值人们由于大流行而减少旅行，参加可能会发生拍照的大型活动-例如派对或音乐会-的时候。\n但是，即使时代不同了，人们仍在继续拍照-尽管他们可能不会为了避免评判而将照片发布到社交媒体上。照片的主题可能也发生了变化，现在包括更多的家庭和宠物或自然场景，而不是例如大型、拥挤的地方或大型社交聚会。\n对大流行前时代的怀旧可能会让用户转向印刷品，以帮助他们重温美好的记忆。\n谷歌没有透露新订阅的确切推出时间，但表示用户应该可以在未来几周内访问这一功能。", "note_en": "During the trial, Google had offered users a $7.99 per month subscription that would automatically select 10 photos from one of three themes, including people and pets, landscapes, or “a little bit of everything” mix. The 4×6 photos were printed on matte, white cardstock with a 1/8-inch border.\n   The new subscription, launching soon, leverages feedback from the early tests to now give users more control over which prints they receive and how they look. It also drops the price to $6.99 per month, including shipping and before tax.\n With the new  Premium Print Series, as the subscription is called, Google Photos will use machine learning techniques to pick 10 of your recent photos to print. But users can edit the photo selection and they can choose either a matte or glossy finish or add a border before the photos ship.\n The photos can optionally be turned into postcards, thanks to the cardstock paper backing, Google notes.\n Subscribers can also opt to skip a month and can easily cancel the service, if they’re no longer using it.\n This updated version of service was recently discovered by reverse engineer  Jane Manchun Wong, who detailed the new customization options and the lower price point.\n a subscription service for shipping prints of your photos that Google suggested for you monthly for $6.99/month… nice!\n the finish and border are adjustable. you can also skip a month of prints if you’d like\n Google says the Premium Print Series will make its ways to Google Photos users in the next few weeks.\n The company today is also launching  same-day printing at Walgreens, available immediately. This expands Google Photos’ existing same-day options, which already included same-day pickup from CVS and Walmart.\n Using the Google Photos app, customers can now order 4×6, 5×7, or 8×10 photo prints for same-day pickup at  Walgreens  . This nearly doubles the number of stores offering same-day prints to Google Photos users, Google says.\n In addition to prints and subscriptions, Google Photos continues to offer  canvas prints and  photo books — the latter now with up to 140 pages — as part of its online print store.\n  The launch of the expanded photo printing services and subscription comes at a time when people are traveling less often, due to the pandemic, and are attending fewer large events where photo-taking may take place — like parties or concerts, for example.\n But even if times have changed, people are continuing to take photos — though they  may not be posting them across social media in order to avoid judgement.The subject of the photos may have changed, too, to now include more family and pets or nature scenes, instead of large, crowded places or big social gatherings, for instance.\n The nostalgia for pre-pandemic times could see users turning to prints to help them relive fond memories, too.\n Google didn’t say exactly when the new subscription will launch, but said users should be able to access the feature in the coming weeks.", "posttime": "2020-10-21 00:12:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,打印,photos,照片", "title": "\nGoogle Photos恢复打印订阅服务，扩大当天打印选择", "title_en": "\n\t\t\t\tGoogle Photos revives its prints subscription service, expands same-day print options\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/google-photos-revives-its-prints-subscription-service-expands-same-day-print-options/", "via": "", "real_tags": ["google", "打印", "photos", "照片"]}, {"category": "", "categoryclass": "", "imagename": "98dc7dcc7c64dcbb78b63fb6fc5684d1.jpeg", "infoid": 1030098, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Pylo是几个Prolog引擎的Python前端，它允许您只需切换后端，就可以编写一次程序并使用不同的Prolog引擎执行它。\nGNU Prolog(到目前为止只能在OSX上运行；GNNU Prolog的外部函数接口在Linux上不能正确编译)。\n步骤1：Pylo依赖ENV变量来检测要支持的Prolog引擎。需要首先安装所需的Prolog引擎。\n要安装对GNU Prolog的支持，您需要提供指向GNU Prolog安装文件夹的GNUPROLOG_HOME变量：\n要安装对XSB_PROLOG的支持，您需要提供指向XSB Prolog源代码的XSB_HOME变量。这是解压XSB源文件的文件夹。例如。\n常见问题自述文件cmplib etc lib站点InstallXSB.jar管理配置示例软件包syglibLICENSE bin文档GPP prolog-commonsMakefile构建EMU安装程序prolog_include。\n要安装对SWI Prolog的支持，您需要提供指向SWIPL安装文件夹的SWIPL_HOME变量。在OSX上，如下所示。\n步骤2：克隆此存储库。您需要递归地提取它来获得子模块。\n要安装GNU Prolog支持，您需要通过GNU_LIB_PATH提供GNU-Prolog安装文件夹的路径。例如，在OSX上使用默认安装会导致以下路径。\n要安装对XSB Prolog的支持，您需要通过XSB_LIB_PATH提供外部接口库的路径。要找到此文件夹，假定&lt；XSB_ROOT&gt；包含解压XSB源代码的文件夹。\n其中&lt；arch&gt；是系统的体系结构(它将是&lt；XSB_ROOT&&gt;；/config文件夹中的唯一文件夹)。\n要安装对SWI Prolog的支持，您需要通过SWIPL_LIB_PATH提供SWIPL库的路径。要查找正确的文件夹，请在SWIPL安装文件夹中查找lib/&lt；Arch&&gt;文件夹(&lt；Arch&&gt;是您的系统的体系结构)。例如，在OSX上，EVN var应如下所示。\n步骤2：设置环境变量后，可以使用以下命令安装Pylo(和所需的Prolog引擎。\n重要提示：由于编译选项不兼容，您不能同时指定所有三个选项。如果要构建对多个Prolog引擎的支持，则必须分别编译引擎(当时仅指定一个标志)。\n步骤3：编译完成后，确保可以通过PATH和PYTHONPATH变量访问Build文件夹。\n为了使用SWIPL，您需要使用LD_LIBRARY_PATH环境变量提供动态库的路径。例如，在OSX上\n对于Ciao Prolog，您还需要能够找到动态库。关于OSX。\n为了降低内存使用量，常量、变量、函数器和谓词需要通过上下文进行构造：\n如果您希望在子句中使用命题(不带参数的函数器)，如：-...，请将其创建为带编号0的谓词。请小心使用文字而不是结构来构建子句。\nPylo允许您方便地指定知识库并使用不同的PROLOG引擎进行查询。所有基本结构(常量、变量、函数器和谓词)都应该使用全局上下文(函数以c_：c_const、c_pred、c_var、c_functor为前缀)创建，这样可以确保不会出现重复。\n从Pylo import c_pred，c_var，c_const，c_functor，Atom，Clause，Conj，Structure，List#创建一些常量Luke=c_const(&#34；Luke&#34；)Anakin=c_const(&#34；Anakin&#34；)leia=c_const(&#34；leia&#34；)padme=c_const(&#34；padme&#34；)#create谓词父=c_pred(&#34；padme&#34；)。，2)MASTER=c_pred(&#34；MASTER&#34；，2)Parent=c_PRED(&#34；Parent&#34；，2)#创建文字f1=Atom(父亲，[阿纳金，卢克])f2=Atom(父亲，[阿纳金，莱娅])f3=Atom(母亲，[帕德梅，卢克])f4=Atom(母亲，[帕德梅，莱娅])#创建变量X=c_var(&#34；X&#34；)Y=c_var(&#34；Y&#34；)#CREATE子句Head=Atom(Parent，[X，Y])Body1=Atom(Parent，[X，Y])Body2=Atom(Move，[X，Y])rule1=Clause(Head，Conj(Body1))rule2=Clause(Head，Conj(Body2))#Create Structures sabre=c_const(&#34；sabre&#34；)green=c_const(&#34；green&#34；)Item=c_functor(&#34；Item&#34；)struct=Structure(Item，[sabre，green])#创建列表l=list([padme，leia，1，2，3])。\n这种显式的面向对象的方法可能适合于程序的自动构建，Pylo还为知识库的构建提供了许多方便快捷的方式，上面的例子可以用下面的方式来构建。\n从Pylo导入c_pred、c_const、c_var、c_functor，列表#构造谓词父项=c_pred(&#34；父项&#34；，2)母项=c_pred(&#34；母亲&#34；，2)父项=c_pred(&#34；父项&#34；，2)CLOSES_TO=c_PRED(&#34；CLOSES_TO&#34；，2)#直接创建事实#将谓词符号应用于术语/字符串创建文字#它还会将字符串转换为适当的结构f1=父亲(&#34；阿纳金&#34；，&#34；卢克&#34；)f2=父亲(&#34；阿纳金&#34；，&#34；莱娅&#34；)f3=母亲(&#34；padme&#34；，&#34；卢克&#34；)f4=母亲(&#34；padme&#34；，&#34；Leia&#34；))#直接创建结构#将函数器应用于一系列术语/字符串创建一个结构#它还知道如何将字符串转换为正确的格式Item=c_functor(&#34；Item&#34；，2)struct=Item(&#34；sabre&#34；，&#34；green&#34；)f5=Beles_to(struct，&#34；Luke&#34；)#create list l=list([&#34；padme&#34；，&#34；leia&#34；)#create list l=list([&#34；padme&#34；，&#34；leia&#34；)#create list l=list([&#34；padme&#34；，&#34；leia&#34；，1，2，3])#如果常量是数字，只需使用Python数据结构#Creating子句Rule 1=Parent(&#34；X&#34；，&#34；Y&#34；)&lt；=Parent(&#34；X&#34；，&#34；Y&#34；)rule2=Parent(&#34；X&#34；，&#34；Y&#34；)&lt；=母亲(&#34；X&#34；，&#34；Y&#34；)。Y&#34；)。\n从皮洛寄来的。引擎从Pylo导入SWIProlog。引擎从Pylo导入XSBProlog。引擎导入GNUProlog#create GNU Prolog实例pl_gnu=GNUProlog()#create XSB Prolog#您需要提供路径pl_xsb=XSBProlog(&#34；[安装中使用的XSB文件夹的路径]&#34；)#create SWI Prolog#如果对应于pl_Swi=SWIProlog(&#39；/usr/local/bin/swpl&#39；)，则SWIPL二进制文件的路径是可选的。\nSWIProlog将可执行文件的路径作为参数。如果路径是标准路径，即OSX上的路径为/usr/local/bin/swpl，则不需要传递任何参数。\nFrom pylo import prolog pl=prolog()#查询文件pl。Consult(&#34；metagol.pl&#34；)#load module#Pylo不提供跨不同引擎的模块的标准化#这意味着确保提供正确的模块名称是您的工作##例如，GNU Prolog没有模块#XSB Prolog需要指定要从库中加载哪些谓词，#这是作为额外的名称参数提供的，它接受谓词pl的列表。Use_module(&#34；library(List)&#34；)#断言事实或子句pl。Asserta()#断言事实或子句pl。Assertz()#撤销文字pl。Retract()#检查是否可能满足查询#HAS_Solution(...)。可以将任意数量的文字作为参数，该参数被解释为连接词pl。HAS_Solution()#查询所有解决方案#query(...)。接受任意数量的文字作为输入，它被解释为conjucion#它另外还接受&#39；max_Solutions&#39；参数，该参数可用于限制查找pl的解的数量。查询()。\n从皮洛寄来的。引擎从Pylo导入XSBProlog导入c_pred pl=XSBProlog(&#34；/Users/Seb/Documents/Programs/XSB&34；)Person=c_pred(&#34；Person&#34；，1)Friends=c_pred(&#34；Friends&#34；，2)Stress=c_pred(&#34；Stress&#34；，1)Imffects=c_pred(&#34；Influence&#34；，2)Smokes=c_pred(&#34；Smokes&#34；；，1)哮喘=c_pred(&#34；哮喘&#34；，1)pl.。Assertz(人(&#34；a&#34；))pl.。Assertz(Person(&#34；b&#34；))pl.。Assertz(Person(&#34；c&#34；))pl.。Assertz(Friends(&#34；a&#34；，&#34；b&#34；))pl.。Assertz(Friends(&#34；a&#34；，&#34；c&#34；))pl.。Assertz(Stress(&#34；X&#34；)&lt；=Person(&#34；X&#34；))pl.。Assertz(影响(&#34；X&34；，&#34；Y&34；)&lt；=Person(&#34；X&34；)&amp；Person(&#34；Y&#34；))pl.。Assertz(Smokes(&#34；X&#34；)&lt；=Stress(&#34；X&#34；))pl.。Assertz(Smokes(&#34；X&34；)&lt；=Friends(&#34；X&34；，&#34；Y&34；)&amp；Influents(&#34；Y&#34；，&#34；X&34；)&amp；Smokes(&#34；Y&#34；))pl.。Assertz(哮喘(&#34；X&34；)&lt；=吸烟(&#34；X&34；))query_p=Person(&#34；X&#34；)TV=pl.。Query(Query_P)打印(&#34；所有人：&#34；，tv)query_f=Friends(&#34；X&#34；，&#34；Y&#34；)tv=pl.。Query(Query_F)print(&#34；all Friends：&#34；，tv)query_st=stress(&#34；Y&#34；)tv=pl.。Query(Query_St)打印(&#34；所有有压力的人：&#34；，tv)tv=pl。查询(影响(&#34；X&#34；，&#34；Y&#34；))打印(&#34；所有影响：&#34；，TV)TV=pl.。查询(Smokes(&#34；X&#34；))打印(&#34；所有吸烟者：&#34；，TV)TV=pl.。查询(哮喘(&#34；X&#34；)，max_Solutions=3)打印(&#34；所有哮喘：&#34；，TV)", "note_en": "pylo is a Python front-end for several Prolog engines.It allows you to write your program once and execute it with different Prolog engines simply by switching the back-end.\n    GNU Prolog (works only on OSX so far; GNNU PROLOG&#39;s foreign function interface does not compile properly on Linux)\n       STEP 1:  pylo relies on ENV variables to detect which Prolog engines to support.The desired Prolog engines need to be installed first.\n To install the support for  GNU Prolog, you need to provide the  GNUPROLOG_HOME variable pointing to the installation folder of GNU Prolog:\n    To install the support for  XSB_PROLOG, you need to provide  XSB_HOME variable pointing to the source of XSB Prolog.This is the folder in which you unpacked the XSB source files.For example\n   FAQ README cmplib etc lib siteInstallXSB.jar admin config examples packages syslibLICENSE bin docs gpp prolog-commonsMakefile build emu installer prolog_includes\n To install the support for  SWI Prolog, you need to provide  SWIPL_HOME variable pointing to the installation folder of SWIPL.On OSX, this looks like\n       STEP 2: Clone this repository. You need to pull it recursively to get the submodules.\n           To install the support for  GNU Prolog, you need to provide the path to the GNu-prolog&#39;s installation folder through the  GNU_LIB_PATH.For instance, using the default installation on OSX results in the following path\n  To install the support for  XSB Prolog, you need to provide the path to the foreign interface library through the  XSB_LIB_PATH.To locate this folder, assume that  &lt;XSB_ROOT&gt; contains the folder in which the XSB source was unpacked.\n  where  &lt;arch&gt; is the architecture of your system (it will be the only folder in  &lt;XSB_ROOT&gt;/config folder).\n To install the support for  SWI Prolog, you need to provide the path to the SWIPL library through the  SWIPL_LIB_PATH.To find the right folder, look for the  lib/&lt;arch&gt; folder in the SWIPL installation folder ( &lt;arch&gt; is the architecture of you system).For instance, on OSX the EVN var should look like this\n  STEP 2: Once the environment variables have been setup, you can install  pylo (and the desired Prolog engines) with the following commands\n    Important: due to the incompatibility of the compiling options, you cannot specify all three options at the same time.If you want to build the support for several Prolog engines, you have to compile the engines separately (with only one flag specified at the time).\n STEP 3: Once the compilation is done, make sure that the  build folder is accessible through the  PATH and  PYTHONPATH variables.\n  In order to use SWIPL, you need to provide a path to the dynamic library using the  LD_LIBRARY_PATH env var. For instance, on OSX\n  For Ciao prolog, you also need to be able to find the dynamic library. On OSX\n        To reduce the memory usage, constants, variables, functors and predicates should be constructed through context:\n  If you want to use a proposition in a clause (a functor without arguments), like  a :- ..., create it as a  Predicate with arity 0.Be careful to construct clauses with literals, not structures.\n  Pylo allows you to conveniently specify the knowledge base and the query it with different prolog engines.All basic constructs (constants, variables, functors and predicates) should be created using the  global context (functions prefixed with  c_:  c_const,  c_pred,  c_var,  c_functor), which ensures that there are not duplicates.\n from  pylo  import  c_pred,  c_var,  c_const,  c_functor,  Atom,  Clause,  Conj,  Structure,  List # create some constants  luke  =  c_const( &#34;luke&#34;)  anakin  =  c_const( &#34;anakin&#34;) leia  =  c_const( &#34;leia&#34;) padme  =  c_const( &#34;padme&#34;) # create predicates father  =  c_pred( &#34;father&#34;,  2)  mother  =  c_pred( &#34;mother&#34;,  2) parent  =  c_pred( &#34;parent&#34;,  2) # create literals f1  =  Atom( father, [ anakin,  luke])  f2  =  Atom( father, [ anakin,  leia]) f3  =  Atom( mother, [ padme,  luke]) f4  =  Atom( mother, [ padme,  leia]) # create Variables X  =  c_var( &#34;X&#34;)  Y  =  c_var( &#34;Y&#34;) # create clauses  head  =  Atom( parent, [ X, Y])  body1  =  Atom( father, [ X, Y]) body2  =  Atom( mother, [ X, Y]) rule1  =  Clause( head,  Conj( body1)) rule2  =  Clause( head,  Conj( body2)) # create structures sabre  =  c_const( &#34;sabre&#34;) green  =  c_const( &#34;green&#34;) item  =  c_functor( &#34;item&#34;) struct  =  Structure( item, [ sabre,  green]) # create lists l  =  List([ padme,  leia,  1,  2,  3])\n Such an explicit object-oriented way might be suited for automated construction of programs.Pylo also provides many convenient shortcuts for less tedious construction of knowledge bases.The above example could have been constructed in the following way\n from  pylo  import  c_pred,  c_const,  c_var,  c_functor,  List # construct predicates father  =  c_pred( &#34;father&#34;,  2) mother  =  c_pred( &#34;mother&#34;,  2) parent  =  c_pred( &#34;parent&#34;,  2) belongs_to  =  c_pred( &#34;belongs_to&#34;,  2) # create facts directly # applying the predicate symbol to terms/strings creates a literal # it also converts strings to the appropriate structures f1  =  father( &#34;anakin&#34;,  &#34;luke&#34;) f2  =  father( &#34;anakin&#34;,  &#34;leia&#34;) f3  =  mother( &#34;padme&#34;,  &#34;luke&#34;) f4  =  mother( &#34;padme&#34;,  &#34;leia&#34;) # create structures directly # applying the functor to a series of terms/strings creates a structure # it also knows how to convert strings to the right form item  =  c_functor( &#34;item&#34;,  2) struct  =  item( &#34;sabre&#34;,  &#34;green&#34;) f5  =  belongs_to( struct,  &#34;luke&#34;) # create list l  =  List([ &#34;padme&#34;,  &#34;leia&#34;,  1,  2,  3])  # if constants are numbers, just use python data structures # creating clauses rule1  =  parent( &#34;X&#34;,  &#34;Y&#34;)  &lt;=  father( &#34;X&#34;,  &#34;Y&#34;) rule2  =  parent( &#34;X&#34;,  &#34;Y&#34;)  &lt;=  mother( &#34;X&#34;,  &#34;Y&#34;)\n   from  pylo. engines  import  SWIProlog from  pylo. engines  import  XSBProlog from  pylo. engines  import  GNUProlog # Create GNU Prolog instance pl_gnu  =  GNUProlog() # create XSB Prolog # you need to provide the path pl_xsb  =  XSBProlog( &#34;[path to the XSB folder used in installation]&#34;) # create SWI Prolog # the path to SWIPL binary is optional if it corresponds pl_swi  =  SWIProlog( &#39;/usr/local/bin/swipl&#39;)\n  SWIProlog takes the path to the executable as an argument. If the path is standard, i.e. is  /usr/local/bin/swipl on OSX, no argument needs to be passed\n  from  pylo  import  Prolog pl  =  Prolog() # consult file pl. consult( &#34;metagol.pl&#34;) # load module # Pylo does not provide a standardization of modules accross different engines # this means that it is your job to ensure that the correct mofule nam is provided  # # for instance, GNU prolog does not have modules # XSB Prolog needs to specify which predicates to load frm the library,  # this is provided as an extra names arguments &#39;predicates&#39;, which takes a list of predicates pl. use_module( &#34;library(lists)&#34;) # asserta a fact or a clause pl. asserta() # assertz a fact or a clause pl. assertz() # retract literal pl. retract() # check whether it is possible to satisfy a query # has_solution(...) can take any number of literals as an argument, which is interpreted as a conjunction pl. has_solution() # query all solutions # query(...) takes any number of literals as an input, which is interpreted as a conjuncion # it additionally takes &#39;max_solutions&#39; arguments, which can be used to limit the number of solutions to look for pl. query()\n  from  pylo. engines  import  XSBProlog from  pylo  import  c_pred  pl  =  XSBProlog( &#34;/Users/seb/Documents/programs/XSB&#34;) person  =  c_pred( &#34;person&#34;,  1) friends  =  c_pred( &#34;friends&#34;,  2) stress  =  c_pred( &#34;stress&#34;,  1) influences  =  c_pred( &#34;influences&#34;,  2) smokes  =  c_pred( &#34;smokes&#34;,  1) asthma  =  c_pred( &#34;asthma&#34;,  1) pl. assertz( person( &#34;a&#34;)) pl. assertz( person( &#34;b&#34;)) pl. assertz( person( &#34;c&#34;)) pl. assertz( friends( &#34;a&#34;,  &#34;b&#34;)) pl. assertz( friends( &#34;a&#34;,  &#34;c&#34;)) pl. assertz( stress( &#34;X&#34;)  &lt;=  person( &#34;X&#34;)) pl. assertz( influences( &#34;X&#34;,  &#34;Y&#34;)  &lt;=  person( &#34;X&#34;)  &amp;  person( &#34;Y&#34;)) pl. assertz( smokes( &#34;X&#34;)  &lt;=  stress( &#34;X&#34;)) pl. assertz( smokes( &#34;X&#34;)  &lt;=  friends( &#34;X&#34;,  &#34;Y&#34;)  &amp;  influences( &#34;Y&#34;,  &#34;X&#34;)  &amp;  smokes( &#34;Y&#34;)) pl. assertz( asthma( &#34;X&#34;)  &lt;=  smokes( &#34;X&#34;)) query_p  =  person( &#34;X&#34;) tv  =  pl. query( query_p) print( &#34;all persons: &#34;,  tv) query_f  =  friends( &#34;X&#34;,  &#34;Y&#34;) tv  =  pl. query( query_f) print( &#34;all friends: &#34;,  tv) query_st  =  stress( &#34;Y&#34;) tv  =  pl. query( query_st) print( &#34;all stressed people: &#34;,  tv) tv  =  pl. query( influences( &#34;X&#34;,  &#34;Y&#34;)) print( &#34;all influences: &#34;,  tv) tv  =  pl. query( smokes( &#34;X&#34;)) print( &#34;all smokers: &#34;,  tv) tv  =  pl. query( asthma( &#34;X&#34;),  max_solutions = 3) print( &#34;all asthma: &#34;,  tv)", "posttime": "2020-10-21 00:07:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,引擎,prolog", "title": "Pylo：几个Prolog引擎的Python前端", "title_en": "Pylo: Python front-end for several Prolog engines", "transed": 1, "url": "https://github.com/sebdumancic/pylo2", "via": "", "real_tags": ["python", "引擎", "prolog"]}]