[{"category": "", "categoryclass": "", "imagename": "56d506e645524adaf14b12b4756f0ba3.png", "infoid": 1032812, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创新地使用蓝牙和Wi-Fi的线下通讯应用Bridgefy被世界各地数千名抗议者称为首选应用，即使在专制政权封锁或关闭互联网的情况下，它也能保持通信正常。最近，尼日利亚和泰国的活动人士敦促支持者下载这款应用，就像去年香港抗议者下载Bridgefy面对政府对电话服务或数据连接的审查一样。这家创业公司表示，在过去的12个月里，它的下载量达到了200万次。自从上周末土耳其和希腊遭受地震袭击以来，这款应用程序现在这些地区的应用程序商店上很受欢迎。\nBridgefy现在发布了一个重要的新更新，为活动人士提供了一个新的关键功能：端到端加密消息。这将允许人们在无法访问数据时安全地发送和接收消息，并将使用Signal、Whatsapp和Facebook Messenger使用的相同加密协议。\nBridgefy于2014年推出(并于2017年出现在TechCrunch Disrupt舞台上)，当时创始人发现了墨西哥城地震期间无法沟通的问题。它最初是一款移动应用程序，几年后添加了SDK，这样其他应用程序也可以在没有互联网的情况下工作。Bridgefy SDK现在以年度订阅模式授权给公司，基于用户量，并由40多家公司集成，涉及支付、消息传递、游戏、社交媒体、约会和自然灾害应用程序。从技术上讲，它的竞争对手包括goTenna和蛾子球聚会Firechat，尽管Bridgefy在活动家领域变得更出名。\n这家初创公司现在正在筹集种子轮资金，已经筹集了80万美元，投资者包括Twitter联合创始人比兹·斯通(Biz Stone)、炼金师加速器(AlChemist Accelerator)和Gan Ventures。", "note_en": "Offline-messaging app  Bridgefy — which innovatively uses Bluetooth and Wi-fi — became known as the go-to app by thousands of protesters around the world to keep communications going even when oppressive regimes blocked or shut down the Internet. Recently, activists in Nigeria and Thailand have urged supporters to download the app, as last year, when protesters in Hong Kong downloaded  Bridgefy   to face the government’s censorship of phone services or data connections. In the last 12 months, the startup says it’s reached 2 million downloads. And since the events of the weekend, when Turkey and Greece were hit by an earthquake, the app is now trending on app stores for those regions.\n Bridgefy is now publishing a major new update, with a new, crucial feature for activists: end-to-end encrypted messages. This will allow people to securely send and receive messages when they don’t have access to data and will use the same encryption protocol used by Signal, Whatsapp and  Facebook    Messenger  .\n  Bridgefy launched in 2014 (and  appeared on the TechCrunch Disrupt stage in 2017) when the founders identified the problem of not being able to communicate during the earthquakes in Mexico City. It started as a mobile app, and an SDK was added a few years later so other apps could also work without the Internet. The Bridgefy SDK is now licensed to companies on an annual subscription model, based on user volume and is integrated by more than 40 companies across payments, messaging, gaming, social media, dating, and natural disaster apps. Technically-speaking, its competitors include  GoTenna and the moth-ball gathering Firechat, although Bridgefy has become better known in the activist space.\n The startup is now raising a Seed round and has already raised $800,000 USD, with investors including Twitter cofounder  Biz Stone,   Alchemist Accelerator and GAN Ventures.", "posttime": "2020-11-03 02:00:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,抗议,launches,bridgefy", "title": "\nBridgefy为抗议和灾难期间使用的应用程序推出端到端加密消息传递", "title_en": "\n\t\t\t\tBridgefy launches end-to-end encrypted messaging for the app used during protests and disasters\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/02/bridgefy-launches-end-to-end-encrypted-messaging-for-the-app-used-during-protests-and-disasters/", "via": "", "real_tags": ["程序", "抗议", "launches", "bridgefy"]}, {"category": "", "categoryclass": "", "imagename": "12fa0fe484a8c8f89a65fc287d14c0c1.png", "infoid": 1032811, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在新冠肺炎停摆期间向虚拟活动的转变，使公司能够比过去几年更多地拆分这些聚光灯下的活动。毕竟，仅仅是要求记者和分析师收看直播就是一种小得多的提升。因此，该公司利用了这一优势，迅速接连举办了三场活动。第一次集中在新的Apple Watch和iPad上，第二次集中在iPhone上，现在看来苹果将不可避免地将注意力转向Mac。\n这次展会可能会看到期待已久的MacOS Big Sur的发布日期，以及围绕该公司优先基于ARM的处理器构建的Mac的揭幕。回到6月下旬的WWDC，该公司采取了不同寻常的举措，在发布日期之前很早就宣布了这项技术的到来，以便在零售上市之前让开发人员加入到这一转变中来。然而，到目前为止，这项技术一直局限于开发工具包领域。\n从一开始，Mac就一直拥抱着巨大的变化，以保持在个人计算领域的领先地位。蒂姆·库克在声明中说：“今天，我们宣布向苹果硅片过渡，使这一天成为Mac历史性的一天。”凭借其强大的功能和业界领先的性能，苹果硅将使Mac变得比以往任何时候都更强大、更强大。“。看来下周我们终于可以看到这一切意味着什么了。\n最近有传言称，新版MacBook Air将于2020年第四季度上市。据报道，重新设计的MacBook Pro和iMac版本也在筹备中。值得注意的是，11月初的发布会也是苹果在假日季之前发布产品的最后机会。因此，我们当然有可能看到其他一些传言已久的产品面世，包括其类似Tile的AirTags跟踪设备和Over-ear AirPods Studio耳机。\n我们将一如既往地跟踪您，并在新闻发布时为您带来最新消息。", "note_en": "The move toward virtual events amid the COVID-19 shutdown has afforded companies the ability to break these spotlight events up more than in past years. After all, simply asking reporters and analysts to tune into a livestream is a much smaller lift. As such, the company has taken advantage, with three events in quick succession. The first focused on the new Apple Watch and iPads, the second iPhones and now it seems inevitable that Apple is going to turn its attention to the Mac.\n  The show will likely see the long-awaited release date for macOS Big Sur, along with the unveiling of Macs built around the company’s priority ARM-based processors. Back at WWDC in late-June, the company took the unusual step of announcing the technology’s arrival well-ahead of its launch date, in order to get developers on board with the shift, prior to retail availability. Until now, however, the technology has been limited to the realm of development kits.\n “From the beginning, the Mac has always embraced big changes to stay at the forefront of personal computing. Today we’re announcing our transition to Apple silicon, making this a historic day for the Mac,” Tim Cook said during the announcement. “With its powerful features and industry-leading performance, Apple silicon will make the Mac stronger and more capable than ever.” It seems we’ll finally see what all of that means next week.\n Recent rumors have pointed to a new version of the MacBook Air set for a Q4 2020 arrival. Redesigned versions of the MacBook Pro and iMac are also reportedly in the works. The early November event is also, notably, Apple’s last chance to get products announced ahead of the holiday season. As such, it certainly seems possible we could see some other long-rumored products arrive, including its Tile-like AirTags tracking device and over-ear AirPods Studio headphones.\n As always, we’ll be following along with you and bringing you the news as it breaks.", "posttime": "2020-11-03 01:59:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,big", "title": "\n苹果的下一个重大活动是11月10日", "title_en": "\n\t\t\t\tApple’s next big event is November 10\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/02/apples-next-big-event-is-november-10/", "via": "", "real_tags": ["apple", "苹果", "big"]}, {"category": "", "categoryclass": "", "imagename": "fe9ac86e97eefd7bd46e0fb918764c6e.jpg", "infoid": 1032810, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年，Llamasoft发布了其最新工具，这是一个人工智能驱动的供应链智能管理平台。这一能力似乎特别吸引Coupa的注意，因为它正在寻找供应链应用程序来补充其支出管理能力。\nCoupa首席执行官兼董事长罗布·伯恩什特恩表示，当你将供应链数据与Coupa的支出数据结合起来时，就会产生一个强大的组合。\nBernshteyn在一份声明中说，“Lamasoft深厚的供应链专业知识、先进的数据科学和建模能力，再加上我们在Coupa拥有的大约2万亿美元的累计交易支出数据，将为企业提供必要的情报，使其能够迅速转型。”\n此次收购正值各公司越来越关注整个企业的数字化过程，以及供应链可能不确定的时候，这取决于COVID热点在任何特定时间的位置。\n“一方面是需求的不确定性，另一方面是供应的波动性，企业需要供应链技术来帮助他们评估替代方案并平衡权衡，以实现预期的业务结果。Llamasoft为这些能力提供了一个人工智能支持的云平台，使公司能够更智能、更快地做出供应链决策，“该公司在一份声明中写道。\n根据Crunchbase的数据，Llamasoft于2002年在密歇根州的安娜堡成立，已经筹集了超过5600万美元。其最大规模的融资是2015年由高盛(Goldman Sachs)牵头的B系列融资5000万美元。\n公司数据显示，该公司创造了超过1亿美元的收入，拥有650个大客户，包括波音(Boeing)、DHL、金佰利(Kimberly-Clark)和通用汽车(GM)。\n根据Crunchbase的数据，Coupa多年来一直非常贪婪，收购了17家公司。这笔交易是该公司今年的第四笔收购。到目前为止，股市对这笔收购并不感兴趣，该公司的股价在公布时下跌了5.20%。", "note_en": "This year Llamasoft released its latest tool,  an AI-driven platform for managing supply chains intelligently. This capability in particular seemed to attract Coupa’s attention, as it was looking for a supply chain application to compliment its spend management capabilities.\n Coupa CEO and chairman Rob Bernshteyn says when you combine that supply chain data with Coupa’s spending data, it can produce a powerful combination.\n  “Lamasoft’s deep supply chain expertise and sophisticated data science and modeling capabilities, combined with the roughly $2 trillion of cumulative transactional spend data we have in Coupa, will empower businesses with the intelligence needed to pivot on a dime,” Bernshteyn said in a statement.\n  The purchase comes at a time when companies are focusing more and more on digitizing processes across enterprise, and when supply chains can be uncertain, depending on the location of COVID hotspots at any particular time.\n “With demand uncertainty on one hand, and supply volatility on the other, companies are in need of supply chain technology that can help them assess alternatives and balance trade-offs to achieve desired business results.  LLamasoft   provides these capabilities with an AI-powered cloud platform that empowers companies to make smarter supply chain decisions, faster,” the company wrote in a statement.\n Llamasoft was founded in 2002 in Ann Arbor, Michigan and has raised over $56 million, according to Crunchbase data. Its largest raise was a $50 million Series B in 2015 led by Goldman Sachs.\n The company generated more than $100 million in revenue and has 650 big customers including Boeing, DHL, Kimberly-Clark and GM, according  to company data.\n Coupa has been extremely acquisitive over the years, buying 17 companies, according to Crunchbase data. This deal represents the fourth acquisition this year for the company. So far the stock market is not enamored with the acquisition with the company’s stock price down 5.20% at publication.", "posttime": "2020-11-03 01:59:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "llamasoft,snags,供应链", "title": "\nCoupa Software以15亿美元收购Llamasoft，将支出和供应链数据整合在一起", "title_en": "\n\t\t\t\tCoupa Software snags Llamasoft for $1.5B to bring together spending and supply chain data\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/02/coupa-software-snags-llamasoft-for-1-5b-to-bring-together-spending-and-supply-chain-data/", "via": "", "real_tags": ["llamasoft", "snags", "供应链"]}, {"category": "", "categoryclass": "", "imagename": "667ce933011dde5015703ac092fa8b69.jpeg", "infoid": 1032809, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与InterPrivate的交易由私募股权投资者艾哈迈德·法图(Ahmed Fattouh)牵头，预计将在2021年初完成。AEVA是最新一家避开传统IPO路径，通过SPAC合并上市的公司。它也是继Velodyne和Lumar之后第三家采用这条路线进入公开市场的激光雷达公司。\n激光雷达，或称光探测和测距雷达，测量距离。它被新兴的自动驾驶行业中的许多人认为是一个关键和必要的传感器。Velodyne长期以来一直主导着激光雷达行业，并向大多数AV开发商提供其产品。在过去的几年里，数十家初创公司如雨后春笋般涌现，旨在从Velodyne手中夺取市场份额，每一家公司都在技术和商业方式上推出了自己的变体。\n传统的激光雷达传感器能够通过发出可见光光谱以外的高功率光脉冲，然后跟踪每个脉冲返回需要多长时间来确定距离。当它们回来时，无论这些脉冲击中什么，其方向和距离都被记录为一个点，并最终形成3D地图。\nAEVA的创始人索鲁什·萨利安(Soroush Salehian)和米娜·雷兹克(Mina Rezk)开发了他们所称的“4D激光雷达”，这种雷达可以测量距离和瞬时速度，而不会丢失距离，同时还可以防止来自太阳或其他传感器的干扰。该公司的FMCW技术也使用更少的电力，使其能够折叠在感知软件中。虽然该公司的技术主要是为自动驾驶汽车以及先进的驾驶辅助系统而开发的，但Salehian表示，其技术也激起了那些消费电子产品的兴趣。\nSalehian在给TechCrunch的一封电子邮件中说：“我们认为这笔交易是加快我们的4D LiDAR开发工作的机会，以便在下一级ADAS和自动驾驶车辆上生产，但同样重要的是，我们已经单独看到人们对我们的芯片级LiDAR的使用产生了浓厚的兴趣，我们的芯片级LiDAR专门用于消费设备应用，在这些应用中，我们的技术可以提供更高的射程能力，不受阳光和运动的影响-这最终打开了一系列新的应用，用于扩大AR/VR和更高的应用范围。”Salehian在给TechCrunch的一封电子邮件中说。据我所知，AEVA是唯一一家能够以这样的价位提供这样的LiDAR-on-Chip技术，以满足汽车和消费设备应用的高性能要求的公司。我们觉得现在正是我们抓住这样的机会的好时机。“。\nAEVA的技术使其获得了许多合作伙伴和客户，以及大众集团最大股东保时捷汽车控股公司(Porsche Automobili Holding SE)的支持。9月份，AEVA宣布与一级制造商ZF建立生产合作伙伴关系，供应汽车级4D激光雷达。\n合并后的公司将更名为AEVA Inc.。预计将继续在纽约证券交易所上市，股票代码为“AEVA”。\nAEVA表示，它能够通过私募股权(PIPE)筹集1.2亿美元，其中包括来自Adage Capital和保时捷SE的投资。合并后的公司将提供约3.63亿美元的毛收入，这一数字包括InterPrivate以信托形式持有的2.43亿美元和1.2亿美元的PIPE，包括Lux Capital、Canaan Partners和洛克希德·马丁在内的所有AEVA股东将通过AEVA向上市公司的过渡保留所持股权。", "note_en": "The deal with InterPrivate, which is led by private equity investor Ahmed Fattouh, is expected to close by early 2021. Aeva is the latest company to eschew the traditional IPO path and go public via a SPAC merger. It’s also the third lidar company, following Velodyne and Luminar, to take this  route to the public markets.\n Lidar, or light detection and ranging radar, measures distance. It’s considered by many in the emerging automated driving industry as a critical and necessary sensor. Velodyne long dominated the lidar industry and supplied most AV developers with its products. Dozens of startups have popped up in the past several years aiming to carve away market share from Velodyne, each one pitching its own variation on the technology and business approach.\n  Traditional lidar sensors are able to determine distance by sending out high-power pulses of light outside the visible spectrum and then tracking how long it takes for each of those pulses to return. As they come back, the direction of, and distance to, whatever those pulses hit are recorded as a point and eventually forms a 3D map.\n Aeva’s founders Soroush Salehian and Mina Rezk have developed what they call “4D lidar,” which can measure distance as well as instant velocity without losing range, all while preventing interference from the sun or other sensors. The company’s FMCW technology also uses less power, allowing it to fold in perception software. While the company’s technology has been primarily developed for use in autonomous vehicles as well as advanced driving assistance systems, Salehian says its technology is also piquing the interest of those in consumer electronics.\n  “We see this transaction as an opportunity to accelerate our development efforts to scale our 4D LiDAR for production on next level ADAS and automated driving vehicles, but also importantly, we have separately seen significant interest for the use of our chip level LiDAR built on silicon photonics specifically for consumer device applications where our technology can provide higher range capability, no degradation from sunlight and measuring motion — which at the end open a new set of applications for expanded AR/VR and beyond,” Salehian said in an email to TechCrunch. “To my knowledge, Aeva is the only company that is capable of providing such a LiDAR-on-chip technology that meets the high performance requirements of automotive and consumer device applications at such price points. And we feel that now is the right time for us to seize such opportunities.”\n Aeva’s technology has landed it a number of partnerships and customers as well as backing from Porsche Automobili Holding SE, the largest shareholder of the VW Group. In September, Aeva announced a production partnership with Tier 1 manufacturer ZF to supply automotive grade 4D lidar.\n  The combined company will be renamed Aeva Inc. and is expected to continue to be listed on the New York Stock Exchange and trade under the ticker symbol “AEVA.”\n Aeva said it was able to raise $120 million in private investment in public equity, or PIPE, including investments from Adage Capital and Porsche SE. The combined company will provide about $363 million in gross proceeds, a figure that include $243 million held in trust by InterPrivate and the $120 million in PIPE. All Aeva stockholders, including Lux Capital, Canaan Partners, and Lockheed Martin, will retain their equity holdings through Aeva’s transition into the publicly listed company.", "posttime": "2020-11-03 01:59:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,交易,deal,aeva", "title": "AEVA是一家由两名苹果资深人士创立并得到保时捷SE支持的激光雷达公司，该公司将通过SPAC合并上市，这将使其在交易后的估值达到21亿美元", "title_en": "Aeva, a lidar company started by two Apple veterans and backed by Porsche SE, is going public via SPAC merger, which will give it a post-deal valuation of $2.1B", "transed": 1, "url": "https://techcrunch.com/2020/11/02/lidar-startup-aeva-to-go-public-via-2-1-billion-spac-merger/", "via": "", "real_tags": ["apple", "苹果", "交易", "deal", "aeva"]}, {"category": "", "categoryclass": "", "imagename": "a7b1d46b188aed1ae7270a1299fc65ff.jpeg", "infoid": 1032808, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Coupa Software正在收购供应链规划公司Llamasoft Inc.。大约15亿美元，因为大流行带来了对帮助企业从原材料采购到分销的运营更具弹性的技术的更多关注。\n此次收购扩大了总部位于加州圣马特奥的Coupa的供应链能力，Coupa基于云的企业软件帮助公司管理业务支出。Coupa预计这笔交易将于周一完成，将使宝马集团(BMW Group AG)、空客SE(Airbus SE)和宝洁(Procter；Gamble)等客户获得Llamasoft的人工智能驱动技术。\nLlamasoft的软件帮助公司建模、设计和优化其供应链网络，使用人工智能和算法来规划场景并缓解潜在风险。这家位于密歇根州安阿伯(Ann Arbor)的公司得到了私募股权基金TPG Capital的支持，TPG Capital于2017年入股，其客户包括波音(Boeing)、达能(Danone)和家得宝(Home Depot)。\n这是Coupa今年第三次收购。该公司的平台帮助企业管理采购、开具发票、支付、采购和其他支出功能，其管理的客户累计支出超过1.95万亿美元。\nCoupa首席执行官罗布·伯恩斯廷(Rob Bernshteyn)说：“我们已经将所有这些孤立的流程整合在一起。”“我们就像Salesforce，但在公司的供应链管理方面。”\n随着时间的推移，这笔交易将使Coupa的客户能够通过Llamasoft的软件重新设计和规划他们的供应链，并允许Llamasoft的客户通过Coupa的平台执行供应链决策并管理供应商关系，Coupa的平台拥有500多万家供应商。\n伯恩斯廷说，今年发生的事件，包括从家庭必需品到工业零部件的商品短缺，以及冠状病毒导致的停工，表明企业必须能够对供应波动和不断变化的需求做出快速反应。他表示：“2021年和2022年需要理顺供应链，我们希望成为这些公司的战略合作伙伴。”\n供应链的动荡吸引了更多对软件和技术的投资，这些软件和技术可以帮助公司将风险降至最低，并建立后盾，例如持有更多库存或在不同地点增加供应商。\n供应链软件提供商E2open LLC上个月表示，计划通过与一家空白支票公司合并上市，这将使E2open的估值约为25.7亿美元。今年4月，私募股权公司KKR&amp；Co.向O9 Solutions Inc.投资1亿美元，对这家基于云的供应链管理软件制造商的估值超过10亿美元。", "note_en": "Coupa Software  is buying supply-chain planning company Llamasoft Inc. for roughly $1.5 billion, as the pandemic brings greater attention to technology that helps businesses make operations from raw materials sourcing to distribution more resilient.\n  The acquisition expands the supply-chain capabilities of San Mateo, Calif.-based Coupa, whose cloud-based enterprise software helps companies manage their business spending. The deal, which Coupa expects to close Monday, will give customers such as BMW Group AG,  Airbus SE and  Procter &amp; Gamble  access to Llamasoft’s artificial intelligence-powered technology.\n  Llamasoft’s software helps companies model, design and optimize their supply-chain networks, using AI and algorithms to map out scenarios and mitigate potential risks. The Ann Arbor, Mich., company is backed by private-equity fund TPG Capital,  which took a stake in 2017, and counts  Boeing  ,  Danone  and  Home Depot  among its customers.\n  This is Coupa’s third acquisition this year. The company’s platform helps businesses manage procurement, invoicing, payments, sourcing and other spending functions and has more than $1.95 trillion in cumulative spending by its customers under management.\n    “We’ve pulled all these siloed processes together,” Coupa CEO Rob Bernshteyn said. “We’re like  Salesforce  but on the supply-chain management side of the house.”\n    The deal, over time, will give Coupa’s customers the ability to redesign and plan their supply chains through Llamasoft’s software, and allow Llamasoft’s clients to execute supply-chain decisions and manage supplier relationships through Coupa’s platform, which has a network of more than 5 million suppliers.\n  Events this year, including shortages of goods from household staples to industrial components, amid coronavirus-driven lockdowns, demonstrated that businesses must be able to respond quickly to supply volatility and shifting demand, Mr. Bernshteyn said. “Supply chains need to be sorted out in 2021 and 2022, and we want to be a strategic partner to the companies,” he said.\n  The turmoil in supply chains is drawing more investment in software and  technology that can help companies minimize risks and  build in backstops, such as holding additional inventory or adding suppliers in different locations.\n  Supply-chain software provider E2open LLC said last month it plans to  go public through a merger with a blank-check company that would value E2open at about $2.57 billion. In April, private-equity firm  KKR &amp; Co.  invested $100 million in o9 Solutions Inc., valuing the cloud-based supply-chain management software maker at more than $1 billion.", "posttime": "2020-11-03 01:58:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "helps", "title": "帮助公司管理业务支出的Coupa以约15亿美元收购供应链规划公司Llamasoft", "title_en": "Coupa, which helps companies manage their business spending, acquires supply-chain planning company Llamasoft for ~$1.5B", "transed": 1, "url": "https://www.wsj.com/articles/software-firm-coupa-to-buy-supply-chain-tech-provider-llamasoft-11604326800?mod=djemalertNEWS", "via": "", "real_tags": ["helps"]}, {"category": "", "categoryclass": "", "imagename": "127730c8d9e99f4e1e2cc845ebb70b25.jpg", "infoid": 1032807, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果公司今天宣布了2020年秋季的第三场活动，将于11月10日(星期二)上午10点举行。在加利福尼亚州库比蒂诺的苹果园区。与9月和10月的活动一样，苹果新手表、iPhone和其他产品都将首次亮相，11月的活动将仅限数字形式，苹果可能会为即将发布的每一款新产品提供预先录制的片段。\n苹果已经宣布了新的第四代iPad Air、第八代iPad、Apple Watch Series 6和iPhone 12系列，预计11月的活动将是一次以Mac为中心的活动，苹果将推出第一款Apple Silicon Mac。我们已经对下面的预期做了一个简单的概述。\n苹果承诺，第一款搭载ARM芯片的‌苹果硅‌Mac将在2020年底之前推出，看起来11月的活动将完全围绕‌苹果硅‌Mac展开。\n早在6月份，苹果公司就首次宣布了它在‌、苹果、硅、‌芯片方面的研究成果，从那以后，我们就再也没有听到什么消息了。‌苹果硅‌芯片类似于苹果iPhone和iPad使用的A系列芯片，这些芯片由苹果自行设计，由台积电制造。\n‌苹果硅‌芯片将带来更高的性能和更高效的Mac，硬件和软件之间的集成更深，允许在所有苹果设备上运行通用应用程序等事情。\n目前还没有明确的消息说，哪台苹果电脑将是第一个获得‌Apple Silicon‌芯片的，但有传言称，苹果正在开发新的MacBook Air或复兴的12英寸MacBook，因此成本较低的MacBook系列可能会首先进行更新。还有传言说会有新的14英寸的MacBook和24英寸的iMac，所以这些也是可能的候选者。\n我们可以只更新一台Mac电脑，也可以同时更新多台Mac电脑，使用‌、苹果、硅‌。\n这次活动可能主要是为了介绍第一款‌苹果硅‌Mac(或Mac)，但仍有一些其他产品即将在11月的活动中发布。\n苹果正在开发高端耳机，这是AirPods家族的一部分，为‌AirPods‌和AirPods Pro提供了一种耳式耳机替代品。有传言称AirPods工作室将耗资349美元，并将提供主动消音和复古风格的设计。\n一张据称是‌AirPods工作室‌传言的泄露图片最初暗示，‌AirPods工作室‌将在今年年底前推出，但彭博社最近表示，由于开发方面的问题，现在还不清楚我们是否仍在按计划在2020年推出这些产品。\nAirTags是传闻已久的苹果蓝牙追踪器，可以连接到钱包和钥匙等物品上，让它们与iPhone、iPad和Mac电脑一起在Find My应用程序中被追踪。\n我们期待‌AirTags‌已经有很长一段时间了，我们终于可以在11月份看到它们，但苹果也有可能推迟到明年。\n苹果计划在上午10点开始时，在其活动网站、YouTube和Apple TV上直播Mac活动。太平洋时间。对于那些无法观看的人，MacRumors将在MacRumors.com和MacRumorsLive Twitter账户上提供全面的活动报道。\n许多运行iOS 14测试版的用户报告说，他们看到一个对话框反复弹出，要求他们从最新的iOS 14测试版进行更新。\r我们论坛、Reddit和Twitter上的帖子正在报道这一问题。这个对话框已经出现了几天了，但从今晚开始，每次iPhone解锁时，对话框出现的频率都会越来越高。在…有进一步的讨论。\n今天，苹果向开发者和公测人员发布了即将发布的iOS 14.2和iPadOS 14.2更新候选版本。10天前，苹果发布了iOS 14和iPadOS 14更新，10天后发布了第四个Beta版本，一个半月后，苹果发布了发布候选版本的iOS 14和iPadOS 14更新。\rIOS和iPadOS14.2可以由开发者通过Apple开发者中心下载，或者在正确的开发者配置文件完成后通过无线方式下载。\nApple One捆绑包现已在美国和其他100多个国家/地区提供，允许客户通过单一计划订阅多项Apple服务，包括Apple Music、Apple TV+、Apple Arade、iCloud等。\r要在iPhone上注册Apple One，请执行以下操作：\r打开设置应用程序\r在顶部点击你的名字\r点击订阅\r点击Apple One上的Apple One提示符...\n对于那些仍在试图在iPhone12和iPhone12Pro之间做出选择的人，我们选择了这两种型号，并在我们最新的YouTube视频中对它们进行了亲身体验的比较。我们的视频突出了相似之处和不同之处，这样你就可以知道哪一款最适合你，以及iPhone12 Pro是否值额外的200美元。\r订阅MacRumors YouTube频道了解更多...。\n我们已经开始在专门的黑色星期五综述中跟踪早期的黑色星期五交易，为了让我们的读者为11月27日之前的大型购物活动做好准备，我们将逐家商店的促销活动放在突出位置。\r注：MacRumors是百思买的附属合作伙伴。当您点击一个链接并进行购买时，我们可能会收到一小笔付款，这将帮助我们保持网站的运行...。\n苹果公司今天宣布推出一项针对AirPods Pro声音问题的新服务计划，该计划旨在解决AirPods Pro设备遇到静态或爆裂声音或有源噪音消除问题。\r根据苹果公司的说法，有故障的AirPods表现出以下问题：在嘈杂的环境中、在锻炼时或在打电话时，爆裂或静电声音会增加\r..。\n苹果周四公布2020财年第四季获利，其中Mac营收为90亿美元，创下新的季度纪录。苹果以286亿美元的年度Mac收入结束了这一年，创历史新高。\r在今天提交给美国证券交易委员会(U.S.Securities and Exchange Commission)的年度Form 10-K报告[PDF]中，苹果表示，与2010财年相比，2020财年Mac销量有所增长。\n苹果新推出的Apple One系列服务套餐将于周五在100多个国家和地区推出，但顶级套餐将仅限于美国、英国、澳大利亚和加拿大。\r29.95美元Premier的有限推出是因为Apple News+目前只在上述国家提供。Apple News+是Premier Tier的独家服务，...。\n在今天2020财年第四季度(第三财季)的财报电话会议上，库克表示，虽然他不想透露太多，但今年还有一些更令人兴奋的事情要做。\r库克可能是在谈论Apple Silicon Mac，因为苹果之前曾表示，第一款Apple Silicon Mac将在2020年底之前上市。有传言说会有第三次秋季活动。\nIPhone12和iPhone12Pro已经上市一周了，所以这周给了我们很多机会来更多地了解这两款新设备，因为我们已经能够拿到它们并对其进行测试。\r本周还有相当多的其他消息，包括Apple one订阅捆绑包的发布，苹果9月份季度财报的发布，关于苹果未来计划的传言……", "note_en": "Apple today announced a third fall 2020 event, which is set to be held on Tuesday, November 10 at 10:00 a.m. on the  Apple Park campus in Cupertino, California. As with the September and October events that saw the debut of new Apple Watches, iPhones, and other products, the November event will be digital only, with Apple likely providing pre-taped segments for each new product that will be announced.\n Apple has already announced a new fourth-generation  iPad Air, eighth-generation  iPad,  Apple Watch Series 6, and  iPhone 12 lineup, the November event is expected to be a Mac-centric event with Apple introducing the first  Apple Silicon Mac. We&#39;ve got a quick overview of what to expect below.\n  Apple has promised the first ‌Apple Silicon‌ Mac with an Arm-based chip is coming before the end of 2020, and it looks like the November event will be all about ‌Apple Silicon‌ Macs.\n Apple first announced its work on ‌Apple Silicon‌ chips back in June, and we&#39;ve heard little since then. ‌Apple Silicon‌ chips are similar to the A-series chips used in Apple&#39;s iPhones and iPads, with the chips designed in-house by Apple and manufactured by TSMC.\n ‌Apple Silicon‌ chips will bring improved performance and more efficient Macs that have a deeper integration between hardware and software, allowing for things like universal apps that run on all Apple devices.\n There&#39;s no clear word yet on which Mac will be the first to get an ‌Apple Silicon‌ chip, but rumors suggest Apple is working on a new  MacBook Air or a revived 12-inch MacBook, so the lower-cost MacBook line could see an update first. There are also rumors of a new 14-inch MacBook and a 24-inch  iMac, so these are possible candidates as well.\n We could get just a single Mac or multiple Macs could be refreshed with ‌Apple Silicon‌ at the same time.\n  This event will likely be held primarily to introduce the first ‌Apple Silicon‌ Mac (or Macs), but there are still some other products that are on the horizon that could see a launch at the November event.\n  Apple is developing  high-end over-ear headphones that are a part of the  AirPods family, offering an over-ear alternative to the ‌AirPods‌ and the  AirPods Pro. Rumors suggest the  AirPods Studio will cost $349 and will offer Active Noise Cancellation and a retro-style design.\n A  leaked image allegedly featuring the ‌AirPods Studio‌ Rumors initially suggested ‌AirPods Studio‌ would launch before the end of the year, but  Bloomberg  recently said there have been development issues, so it&#39;s now unclear if we&#39;re still on track to get them in 2020.\n  AirTags are Apple&#39;s  long-rumored Bluetooth trackers that can attach to items like wallets and keys, letting them be tracked right in the  Find My app alongside iPhones, iPads, and Macs.\n We&#39;ve been expecting ‌AirTags‌ for quite some time now and we could finally see them in November, but there&#39;s also a chance that Apple is holding off until next year.\n  Apple plans to stream the Mac event live on its  Events website, on YouTube, and on the  Apple TV when it kicks off at 10:00 a.m. Pacific Time. For those unable to watch,  MacRumors will be providing full event coverage both on MacRumors.com and through the  MacRumorsLive Twitter account.\n   Many users running iOS 14 beta are reporting that they are seeing a dialog box pop up repeatedly asking them to update from the latest iOS 14 beta.\rThreads in our forums, Reddit, and Twitter are reporting the issue. The dialog has been appearing for a few days now, but as of tonight has started appearing more frequently, every time an iPhone is unlocked. There&#39;s been further discussion in...\n Apple today seeded &#34;Release Candidate&#34; versions of upcoming iOS 14.2 and iPadOS 14.2 updates to developers and public beta testers, 10 days after seeding the fourth betas and a month and a half after releasing the iOS 14 and iPadOS 14 updates.\riOS and iPadOS 14.2 can be downloaded by developers through the Apple Developer Center or over the air after the proper developer profile has been...\n Apple One bundles are now available in the United States and over 100 other countries, allowing customers to subscribe to multiple Apple services through a single plan, including Apple Music, Apple TV+, Apple Arcade, iCloud, and more.\rTo sign up for Apple One on an iPhone:\rOpen Settings App\rTap on Your Name at the top\rTap on Subscriptions\rTap on Apple One The prompt for Apple One...\n For those still trying to make a decision between an iPhone 12 or an iPhone 12 Pro, we picked up both models and in our latest YouTube video, did a hands-on comparison between them. Our video highlights the similarities and the differences so you can which one is the best fit for you and whether the iPhone 12 Pro is worth an extra $200.\rSubscribe to the MacRumors YouTube channel for more ...\n We&#39;ve begun tracking early Black Friday deals in our dedicated Black Friday Roundup, and in an effort to prepare our readers for the big shopping event we&#39;re highlighting sales store-by-store in the lead-up to November 27.\rNote: MacRumors is an affiliate partner with Best Buy. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running....\n Apple today announced the launch of a new service program for AirPods Pro sound issues, which is designed to address AirPods Pro units experiencing static or crackling sounds or problems with Active Noise Cancellation.\rFaulty AirPods exhibit the following problems, according to Apple:Crackling or static sounds that increase in loud environments, with exercise or while talking on the phone\r...\n Apple on Thursday reported its earnings for the fourth quarter of the 2020 fiscal year, including Mac revenue of $9 billion, a new quarterly record. Apple ended the year with annual Mac revenue of $28.6 billion, an all-time high.\rIn its annual Form 10-K report [PDF], filed with the U.S. Securities and Exchange Commission today, Apple said increased Mac sales in fiscal 2020 compared to fiscal ...\n Apple&#39;s new Apple One series of services bundles launches on Friday in over 100 countries and regions, but the top Premier tier will be limited to the United States, the United Kingdom, Australia, and Canada.\rThe limited rollout of the $29.95 Premier tier is down to the fact that Apple News+ is currently only available in the above countries. Apple News+ is exclusive to the Premier tier,...\n During today&#39;s earnings call for the fourth fiscal quarter of 2020 (third calendar quarter), Cook said that while he doesn&#39;t want to give too much away, &#34;this year has a few more exciting things in store.&#34;\rCook is likely speaking about the Apple Silicon Macs, as Apple has previously said the first Apple Silicon Mac will be coming before the end of 2020. There are rumors of a third fall event ...\n The iPhone 12 and iPhone 12 Pro have been out for a week now, so this week gave us lots of opportunities to learn more about the new devices now that we&#39;ve been able to get our hands on them and test them out.\rThere was quite a bit of other news this week as well, including the launch of Apple One subscription bundles, Apple&#39;s September quarter earnings release, rumors about future plans for ...", "posttime": "2020-11-03 01:58:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,预计", "title": "苹果公司宣布11月10日的活动，预计苹果硅Mac将首次亮相；邀请函的标题是“还有一件事”。", "title_en": "Apple announces November 10 event where Apple Silicon Macs are expected to debut; invites are titled “One more thing.”", "transed": 1, "url": "https://www.macrumors.com/2020/11/02/apple-november-event/?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["apple", "苹果", "预计"]}, {"category": "", "categoryclass": "", "imagename": "71042f626bb18ec109abb36b95ca273f.jpg", "infoid": 1032805, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "像很多人一样，我一直在苦苦挣扎在不可靠的情况下Android上的指纹识别器智能手机经久不衰。好消息！我已经找到了几个解决方案。..。\n这笔罚款已经从最初针对大流行提出的9900万英镑的罚款中大幅削减。\nCERT/CC试图减少使用耸人听闻的漏洞名称，因为这些名称会不必要地吓坏软件用户。\n美国网络司令部与中情局和联邦调查局一起祝俄罗斯国家黑客万圣节快乐！\n最近，微软表达了它的极端对美国人的挫败感政客和他们的无能才能让事情发生。新数据显示微软ISN&39；不是一个人，这可能是..。\n拉扎达公开了自己的失误因为整合了杂货店应用程序集成到自己的平台上，所以它应该会来的不足为奇的是，被忽视的&#39；过期&#39；", "note_en": "Like\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmany,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thave\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbeen\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tstruggling\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twith\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tunreliability\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfingerprint\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\treaders\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ton\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAndroid\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsmartphones\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tages.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGood\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnews!\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI&#39;ve\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfound\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfew\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsolutions.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  The fine has been slashed from over £99 million originally proposed In light of the pandemic.\n  CERT/CC attempts to reduce the use of sensationalized vulnerability names that needlessly scare software users.\n  Together with CISA and the FBI, US Cyber Command wish Russian state hackers a &#34;Happy Halloween!&#34;\n  Recently,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMicrosoft\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\texpressed\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tits\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\textreme\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfrustration\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAmerican\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpoliticians\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttheir\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tinability\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmake\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthings\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thappen.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNew\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdata\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tshows\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMicrosoft\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tisn&#39;t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\talone,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twhich\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmay\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Lazada\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thas\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmade\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpublic\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmissteps\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsince\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tintegrating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgrocery\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tapp\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tinto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tits\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\town\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tplatform,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tso\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tit\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tshould\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcome\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tas\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tno\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsurprise\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\toverlooked\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t&#39;out\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdate&#39;\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdatabase\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thas\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tled\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcompromise\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  In 2021, security and risk professionals must address issues of insiders, team culture and geopolitics.\n  Values-based companies will elevate customer and employee privacy as a strategic business and societal imperative.", "posttime": "2020-11-03 00:55:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "chrome,专用,dedicated,美国", "title": "Chrome很快将拥有自己的专用证书根存储区", "title_en": "Chrome Will Soon Have Its Own Dedicated Certificate Root Store", "transed": 1, "url": "https://www.zdnet.com/article/chrome-will-soon-have-its-own-dedicated-certificate-root-store/", "via": "", "real_tags": ["chrome", "专用", "dedicated", "美国"]}, {"category": "", "categoryclass": "", "imagename": "24135d2c2c2c26723641d7b552f26199.jpg", "infoid": 1032804, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎回到车站，这是一份时事通讯，专门介绍现在和未来人们和包裹从A点到B点的所有方式。\n对于运输界来说，这是忙碌的一周，特别是在自动车辆技术方面。我们开始吧。\n随时给我发电子邮件到kirsten.korosec@techcrunch.com，与我分享想法、批评、提出意见或提示。您也可以通过Twitter-@kirsten korosec直接发送消息给我。\n纽约是最后一个尚未决定的大型摩托车市场之一。该市于10月30日发布了一份针对其试点滑板车项目的“意向书”，并对为电动滑板车行业提供辅助服务的公司发出了单独的请求，如数据聚合和分析、街头充电和停车供应商、安全骑行培训课程以及滑板车收集和扣押服务。\n这正式启动了决定哪些公司将获得在该市经营许可的程序。这将是一场争夺世界上最令人垂涎的市场之一的竞争。在该市发布RFEI后的几个小时内，我收到了一些电子邮件，其中包含滑板车公司的声明，每家公司都在兜售自己的经验、专注于安全和商业战略。\n该市的一些重要决定尚未确定，或者至少还没有与公众分享，比如到底在哪里允许滑板车，以及对想要在那里运营的公司有什么要求。我们知道曼哈顿出局了，因为滑板车是不允许的。这就剩下另外四个行政区，包括布鲁克林、布朗克斯、皇后区和斯塔顿岛。\n哈雷-戴维森宣布，它已经剥离了一项致力于电动自行车的新业务，并计划在2021年春季将其第一系列产品推向市场。\n踏板辅助电动自行车公司是在新冠肺炎疫情后需求不断增长的推动下蓬勃发展的电动自行车行业中成立的。据估计，2019年全球电动自行车市场规模将超过150亿美元，预计从2020年到2025年，全球电动自行车市场的年增长率将超过6%。需求就在那里；哈雷戴维森会不会就是这样与下一代客户建立联系的？\n这项名为Serial 1 Cycle Company的新业务最初是摩托车制造商产品开发中心内的一个项目。这个名字来自“系列号1”，这是哈雷戴维森已知的最古老的摩托车的昵称。\n菲斯克公司。成为一批投机性电动汽车初创公司中最新一家通过与一家特殊目的收购公司合并上市的公司。菲斯克早在7月份就宣布-就在从投资者那里筹集了5000万美元-它还没有与斯巴达能源收购公司(Spartan Energy Acquisition Corp.)达成合并协议，斯巴达能源收购公司是一家特殊目的收购公司，由阿波罗全球管理公司(Apollo Global Management Inc.)的一家附属公司赞助。\n合并于本周完成，菲斯克在纽约证券交易所(New York Stock Exchange)首次亮相。它的第一个交易日是在周五，POP的股票下跌了，收盘上涨了13%。值得注意的是，菲斯克没有产生任何收入，也没有投入生产的汽车，尽管它最近确实与麦格纳达成了制造协议，生产其第一款汽车-海洋SUV。菲斯克表示，将于2022年开始交付海洋SUV。\n著名汽车设计师、该公司创始人亨里克·菲斯克(Henrik Fisker)本周在推特上发布了海洋酒店的预订数据，他认为预订数量为8871辆。我最大的问题是，菲斯克需要生产和销售多少辆汽车才能实现盈亏平衡，或者我敢说，才能扭亏为盈？9000辆车够吗？这些保留会转化为实际销售吗？(下面是菲斯克预订数字的截图)。\n大陆航空公司收购了激光雷达开发公司Aye的少数股权。两家公司没有透露“少数股权”是什么意思。然而，Aye的员工可以说，它是该公司迄今为止最大的一级投资者，这是一个多方面的合作伙伴关系，将一个由大约300名激光雷达工程师组成的联合团队聚集在一起，开发远程激光雷达产品并将其产业化。在这笔投资之前，有消息称，Aye已任命其总裁布莱尔·拉科特(Blair LaCorte)担任首席执行官。通用汽车前首席技术官乔恩·劳克纳(Jon Lauckner)、曾在戴姆勒股份公司(Daimler AG)董事会任职的汽车业高管兼顾问贝恩德·戈特沙尔克(Bernd Gottschalk)博士、汽车咨询公司AutoValue的创始人兼管理合伙人弗兰克·佩兹尼克(Frank Petznick)、大陆汽车公司(Continental)高级驾驶辅助系统执行副总裁弗兰克·佩兹尼克(Frank Petznick)和IBM资深高管基思·迪尔克斯(Keith Dierkx)上个月也加入了Aye的顾问委员会。\nHermeus是一家初创公司，目标是制造一架5马赫的飞机，能够在短短90分钟内从纽约飞到伦敦。该公司在迦南合伙公司(Canaan Partners)牵头的首轮融资中筹集了1600万美元。现有投资者科斯拉风险投资公司(Khosla Ventures)、Bling Capital和Rise of the REST种子基金也参与了这轮融资。\nOtrider是一家开发了自动庭院卡车系统的初创公司，在退出隐形仅8个月后就筹集了6500万美元的资金。B轮融资由科赫颠覆技术公司(Koch Disruptive Technologies)牵头，使其筹集的总资金达到1.18亿美元。其他现有投资者增加了投资，包括NEA、8VC和Prologis Ventures。新的投资者包括Henry Crown and Company和Evolv Ventures。\n总部位于俄亥俄州的汽车保险平台Root Inc.通过在美国的首次公开募股(IPO)筹集了7.24亿美元。该公司以每股27美元的价格出售了2420万股票-高于每股22美元至25美元的市场区间。据美国证券交易委员会(SEC)提交的文件显示，该公司还通过向Dragoneer Investment Group和Silver Lake出售普通股筹集了5亿美元。\n全球航运、物流和卡车租赁公司莱德系统(Ryder System)推出了一只5000万美元的风险基金。TechCrunch的乔纳森·谢伯深入分析了其中的原因。\nWiTricity完成了一轮3400万美元的投资，由第一阶段风险投资公司牵头，空气波无线电力公司参与，三菱公司通过其美国子公司三菱公司(美洲)进行战略投资。WiTricity表示，这笔资金将用于继续开发无线电力平台，扩大其知识产权组合，并利用电动汽车无线充电的商业势头。\n通常情况下，我的“小鸟”栏目致力于审查和多来源的尚未报告的花絮。这周有点不一样。我将利用我报道和观察AV行业的经验，稍微读读Twitter的茶叶，并预测我认为将会是更有趣的合作伙伴关系之一。\n我对2020年的重大预测是。…。。自动车辆技术初创公司Voyage和电动汽车初创公司Canoo将与新上市公司Canoo合作开发一款汽车。好了，我说出来了。好了。我怎么敢这么大胆呢？这么说吧，我看到了Voyage和Canoo之间的许多爱情；对我来说，这似乎不仅仅是钦佩。D；\n在实际公开宣布的新闻中，Voyage表示正在与第一运输公司合作，在像村庄这样的社区部署和运营机器人出租车。Voyage已经在村庄的老年社区进行了一段时间的测试和乘车(有一名人类安全司机在方向盘后面)。同时，第一运输公司作为一家运输公司有60年的经验。\nVoyage创始人兼首席执行官奥利弗·卡梅隆(Oliver Cameron)在最近的一条推文中解释了该公司与第一运输公司合作的原因(还有一篇博客文章)。他写道，“机器人出租车在很多方面都是一项新业务，但其中的许多挑战已经被久经考验的玩家(比如@FirstTransport)解决了。那么，为什么不是合伙人，而不是重新发明轮子呢？\n预计开发这项技术的公司与那些在运输运营方面有经验的公司之间会有更多的合作伙伴关系。本周，我们看到了另一个这种AV-运营商合作的例子。现代-Aptiv合资企业Motional和按需穿梭初创公司Via宣布计划于2021年上半年在美国一个城市为公众推出共享机器人出租车服务。两家公司表示，其目的是为按需共享机器人出租车开发一张“蓝图”，并了解如何将这些无人驾驶车辆整合到公共交通中。\n当我度假时，Waymo丢掉了大量关于其在亚利桑那州凤凰城的自动驾驶汽车运营的数据。这个数据转储提供的不仅仅是过去20个月的撞车事故(18起)或险些发生的事故(29起)的洞察力。它首次真正详细地展示了Waymo的自动化系统和运营。\n该公司发表了两篇论文，详细介绍了其安全方法和准备情况，以及公共道路安全性能数据，其中分析了Waymo在亚利桑那州公共道路上行驶的里程。第一篇论文深入探讨了它的三个层次的安全方法，包括硬件、自动驾驶系统的行为和操作。\n我仍在通读报纸，很快会补充更多关于这方面的想法，但在此期间，我有两个重要的收获。\nWaymo终于详细回答了我向该公司提出的问题，包括其首席技术官德米特里·多尔戈夫(Dmitri Dolgov)的问题，即“多安全才够安全？”以及“你怎么知道它什么时候足够安全？”\n戴姆勒卡车和Waymo宣布建立合作伙伴关系，以制造自动版本的Freightliner Cascadia卡车。这是Waymo在货运业务中的第一笔交易。几天后，戴姆勒卡车公司(Daimler Trucks)宣布已投资激光雷达开发商卢米纳，作为更广泛合作伙伴关系的一部分，该公司将生产能够在没有人工驾驶的情况下在高速公路上导航的自动卡车。\n这些交易是这家德国制造商摆脱机器人出租车和共享机动性，转而专注于如何将自动车辆技术应用于货运的最新行动。\nGrab和万豪国际宣布建立合作伙伴关系，涵盖这家酒店业巨头在六个东南亚国家的餐饮业务：新加坡、印度尼西亚、马来西亚、菲律宾、越南和泰国。与Grab达成的万豪国际交易重点是其在东南亚六国物业的约600家餐厅和酒吧，而不是房间预订，这些餐厅和酒吧将于11月开始加入Grab Food的按需送货平台。", "note_en": "Welcome back to The Station, a newsletter dedicated to all the present and future ways people and packages move from Point A to Point B.\n It was a busy week in the world of transportation, particularly around automated vehicle technology. Let’s get to it.\n  Email me anytime at  kirsten.korosec@techcrunch.com to share thoughts, criticisms, offer up opinions or tips. You can also send a direct message to me at Twitter —  @kirstenkorosec.\n   New York is one of the last big scooter markets yet to be decided. The city released October 30 a “Request for Expressions of Interest” for its  pilot scooter program as well as a separate request for companies that provide ancillary services to the electric scooter industry, such as data aggregation and analysis, on-street charging and parking vendors, safe-riding training courses as well as scooter collection and impound services.\n This officially kicks off the process to determine what companies will receive permits to operate in the city. It promises to be a competitive battle for one of the most coveted markets in the world. In the hours after the city released its RFEIs, I received a number of emails with statements from scooter companies, each one touting its experience, focus on safety and business strategy.\n Some important decisions from the city have yet to be determined, or at least shared with the public such as exactly where the scooters will be allowed and what requirements will be placed on the companies that want to operate there. We know Manhattan is out as scooters are not allowed. That leaves four other boroughs, including Brooklyn, the Bronx, Queens and Staten Island.\n   Harley-Davidson announced that it has  spun out a new business dedicated to electric bicycles and plans to bring its first line of products to market in spring 2021.\n The pedal assist electric bicycle company is being launched amid a booming e-bike industry fueled by growing demand in the wake of the COVID-19 pandemic. The global e-bicycle market was estimated to be over $15 billion in 2019 and projected to grow at an annual rate of more than 6% from 2020 to 2025. The demand is there; might this be how Harley-Davidson connects with the next-generation of customers?\n The new business, called Serial 1 Cycle Company, started as a project within the motorcycle manufacturer’s product development center. The name comes from “Serial Number One,” the nickname for Harley-Davidson’s oldest-known motorcycle.\n   Fisker Inc. became the latest in a group of speculative electric vehicle startups to go public via a merger with a special purpose acquisition company. Fisker had announced back in July — and right after raising $50 milion from investors — that it had reached an agreement to merge with Spartan Energy Acquisition Corp., a special purpose acquisition company sponsored by an affiliate of Apollo Global Management Inc.\n The merger closed this week and Fisker made its debut on the New York Stock Exchange. Its first day of trading was Friday and pop went the shares, closing up 13%. It’s important to note that Fisker isn’t generating any revenue and doesn’t have a vehicle in production yet, although it did recently lock in a manufacturing agreement with Magna to build its first vehicle, the Ocean SUV. Fisker has said it will begin to deliver the Ocean SUV in 2022.\n Henrik Fisker, the famous car designer and founder of the company, tweeted this week figures on reservations of the Ocean, which he pegged at 8,871. My big questions are how many vehicles does Fisker need to make and sell to break even, or dare I say, turn a profit? Is 9,000 vehicles enough? And will these reservations convert into actual sales? (a screenshot below of Fisker’s reservation figures)\n    Continental took a minority stake into lidar develop Aeye. The companies didn’t disclose what “minority stake” means. However, the folks at Aeye were able to say that its the company’s largest Tier 1 investor to-date, and it’s a multi-faceted partnership that brings together a joint team of about 300 lidar engineers to develop and industrialize the long-range lidar product. The investment follows news that Aeye has appointed its president Blair LaCorte to the CEO position. Jon Lauckner, formerly CTO at GM, Dr. Bernd Gottschalk, an automotive executive and consultant who served on Daimler AG’s board and is the founder and managing partner of automotive consultancy AutoValue, Frank Petznick, the executive vice president of advanced driver assistance systems at Continental and Keith Dierkx, a longtime IBM executive, also joined Aeye’s advisory board last month.\n Hermeus, a startup aiming to build a Mach 5 aircraft capable of making the trip from New York to London in just 90 minutes,  raised $16 million in a Series A round led by Canaan Partners. Existing investors Khosla Ventures, Bling Capital and the Rise of the Rest Seed Fund also participated in the round.\n Outrider, a startup that developed a system of autonomous yard trucks, has  raised $65 million in funding just eight months after coming out of stealth. The Series B round was led by Koch Disruptive Technologies and brings its total funding raised to $118 million. Other existing investors increased their investments, including NEA, 8VC and Prologis Ventures. New investors included Henry Crown and Company and Evolv Ventures.\n Root Inc., the Ohio-based auto insurance platform, raised $724 million through its U.S. initial public offering. The company sold 24.2 million shares at $27 each — above the marketed range of $22 to $25 a share. The company also raised $500 million through sales of common shares to Dragoneer Investment Group and Silver Lake,  according to an SEC filing.\n Ryder System, the shipping, logistics, and truck rental company, launched a $50 million venture fund.  TechCrunch’s Jonathan Shieber digs into why.\n WiTricity closed a  $34 million investment round led by Stage 1 Ventures with participation from Air Waves Wireless Electricity and a strategic investment by Mitsubishi Corporation through its U.S. subsidiary, Mitsubishi Corporation (Americas). WiTricity said the funds will be used to continue wireless power platform development, expand its intellectual property portfolio, and capitalize on the commercial momentum for wireless charging for electric vehicles.\n   Typically, my “little bird” section is dedicated to vetted and multi-sourced tidbits that have yet to be reported out. This week is a bit different. I’m going to tap into my experience of reporting on and observing the AV industry, throw in a little reading of the Twitter tea leaves and make a prediction of what I believe is going to be one of the more interesting partnerships.\n My big prediction in 2020 is. …. automated vehicle technology startup Voyage and electric vehicle startup and newly public company Canoo will partner on a vehicle. There I said it. Done. How could I dare be so bold? Let’s just say I’ve seen lots of love between Voyage and Canoo; to me it seems like more than just admiration. ;D\n  In actual publicly announced news, Voyage said it is teaming up with First Transit to deploy and operate robotaxis in communities like The Villages. Voyage has been testing and giving rides (with a human safety driver behind the wheel) in the senior community the Villages for some time now. Meanwhile, First Transit has six decades of experience as a transportation company.\n Oliver Cameron, founder and CEO of Voyage, explained why the company partnered with First Transit in a recent tweet  (there’s also a blog post). He wrote, “Robotaxis are a new business in many ways, but many of the challenges within have already been solved by tried-and-tested players (like  @FirstTransit). So, why not partner instead of reinventing the wheel?”\n Expect more partnerships between the companies developing the technology and those that have experience in transportation operations. We saw another example of these kind of AV-operator partnerships this week. Motional, the Hyundai-Aptiv joint venture, and on-demand shuttle startup Via announced plans to launch  a shared robotaxi service for the public in a U.S. city in the first half of 2021. The companies said the aim is to develop a “blueprint” for on-demand shared robotaxis and learn how these driverless vehicles can be integrated into mass transit.\n   While I was on vacation,  Waymo dropped a massive amount of data on its autonomous vehicle operations in Phoenix, Arizona. This data dump offers insight into more than just the number of crashes — 18 — or near misses — 29 — over the past 20 months. It provides the first real detailed look at  Waymo’s   automated system and operations.\n The company published two papers detailing its safety methodologies and readiness as well as public road safety performance data, which analyzes the miles Waymo has driven on public roads in Arizona. The first paper digs into its three layered approach to safety, which includes the hardware, the automated driving system behavior and operations.\n I’m still reading through the papers and will add more thoughts on this soon, but in the meantime here are my two big takeaways.\n Waymo is finally providing a detailed answer to questions I have asked the company, including its CTO Dmitri Dolgov, which is “how safe is safe enough?” and “how do you know when it is safe enough?”\n    Daimler Trucks and  Waymo  announced a partnership to build an autonomous version of the Freightliner Cascadia truck. This is Waymo’s first deal in the freight business. Then a few days later, Daimler Trucks announced it had  invested in lidar developer Luminar as part of a broader partnership to produce autonomous trucks capable of navigating highways without a human driver behind the wheel.\n These deals are the latest action by the German manufacturer to move away from robotaxis and shared mobility and instead focus on how automated vehicle technology can be applied to freight.\n Grab and Marriott International  announced a partnership that will cover the hospitality giant’s dining businesses in six Southeast Asian countries: Singapore, Indonesia, Malaysia, the Philippines, Vietnam and Thailand. Instead of room bookings, the Marriott International deal with Grab focuses on about 600 restaurants and bars at its properties in the six Southeast Asian countries, which will start being added to GrabFood’s on-demand delivery platform in November.", "posttime": "2020-11-03 00:32:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "waymo", "title": "\nThe Station：Waymo使其成为安全案例，AV合作伙伴比比皆是，消防成本不断上涨", "title_en": "\n\t\t\t\tThe Station: Waymo makes it safety case, AV partnerships abound and the rising cost of FSD\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/02/the-station-waymo-makes-it-safety-case-av-partnerships-abound-and-the-rising-cost-of-fsd/", "via": "", "real_tags": ["waymo"]}, {"category": "", "categoryclass": "", "imagename": "2fab89fa91a456a7e20f2c4b92f874fc.jpg", "infoid": 1032803, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家纽约市的初创公司一开始是通过测量传统的电视收视率，使用网络摄像头来确定观众是否真的注意到了广告。最近，它推出了一个专注于联网电视的解决方案，联合创始人兼首席执行官刘岩表示，没有标准的衡量标准。\n“我发现，在流媒体领域，没有所谓的电视收视率，”他说。“就其本身而言，这个行业没有好的货币。”\n部分原因是，像Netflix和Disney+这样的大公司是基于订阅的，而不是靠广告支持的，所以它们没有什么动力与第三方测量公司合作。\n刘还表示，目前市场上的测量解决方案在很大程度上仅限于标签-这种方法允许广告商衡量他们的广告被看到的范围有多广，但没有向他们展示他们的表现与行业基准或竞争对手相比有多好。\n因此，TVision没有依赖标签，而是建立了一个连接电视观众的面板。在某些方面，这是一种非常老式的方法-这是尼尔森衡量电视观众的核心-但刘说，这比看起来要难，这就是为什么你不会看到很多其他广告测量公司建造自己的面板。\n他补充说，TVision(不要与同名的T-Mobile流媒体捆绑包混淆)已经建立了新的技术，使用WiFi信号等数据来确定广告是在流媒体服务上播放还是在线性电视上播放。\n刘说，所有这些都是以符合法规和隐私友好的方式进行的，防止任何个人身份信息被上传，并确保小组成员了解他们共享的数据。\nTVision的测量平台专注于联网电视，而不是台式机/笔记本电脑或移动设备。然而，刘表示，它可以通过与甲骨文的护城河合作提供跨平台的见解。\n这家初创公司已经与百事可乐(Pepsi)、安海斯-布希(Anheuser-Busch)、Hulu、AMC和电通宙斯盾网络(Dentsu Aegis Network)等客户合作，总共筹集了3900万美元的资金。新一轮融资由全球贸易公司Susquehanna International Group的子公司SIG亚洲投资公司(SIG Asia Investments)牵头。现有投资者帮凶、黄金风投和跳跃资本也参与其中。", "note_en": "The New York City startup started out by measuring traditional TV viewing, using webcams to determine whether viewers were actually paying attention to the ads. More recently, it’s launched a solution focused on connected TVs, where co-founder and CEO Yan Liu said there’s no standard measurement.\n “What I’ve found is that in streaming, there’s no such a thing called a TV rating,” he said. “There’s no good currency, per se, in the industry.”\n  Partly, that’s because the large players like Netflix and Disney+ are subscription-based, rather than ad-supported, so they have little incentive to work with third-party measurement firms.\n Liu also said that the measurement solutions currently in the market are largely limited to tags — an approach that allows advertisers to measure how widely their ads were seen, but doesn’t show them how their performance stacks up against industry benchmarks or competitors.\n  So instead of relying on tags,  TVision   has built up a panel of connected TV watchers. In some ways, this is a very old-fashioned approach — it’s the core of how Nielsen measures TV audiences — but Liu said it’s harder than it looks, which is why you don’t see many other ad measurement companies building panels of their own.\n He added that TVision (not to be confused with  the T-Mobile streaming bundles of the same name) has built new technology that uses data like WiFi signals to determine whether an ad is being played on a streaming service or on linear TV.\n And Liu said it’s doing all of this in a regulation-compliant and privacy-friendly way, preventing any personally identifiable information from being uploaded and ensuring that panelists understand what data their sharing.\n TVision’s measurement platform is focused on connected TVs, rather than desktop/laptop computers or mobile devices. However, Liu said it can offer cross-platform insights through a partnership with Oracle’s Moat.\n The startup is already working with customers like Pepsi, Anheuser-Busch, Hulu, AMC and Dentsu Aegis Network, and it has raised a total of $39 million in funding. The new round was led by SIG Asia Investments, an affiliate of global trading firm Susquehanna International Group. Existing investors Accomplice, Golden Ventures and Jump Capital also participated.", "posttime": "2020-11-03 00:32:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "观众,viewer", "title": "\nTVision筹集1600万美元衡量观众对联网电视的关注度", "title_en": "\n\t\t\t\tTVision raises $16M to measure viewer attention on connected TVs\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/02/tvision-funding/", "via": "", "real_tags": ["观众", "viewer"]}, {"category": "", "categoryclass": "", "imagename": "a0e0fde123b00309179ee652dbf6189f.jpg", "infoid": 1032802, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "相对论成立于2015年，自那以来已经积累了一大批热切的客户，使其Terran-1火箭可能成为有史以来预售最多的运载火箭。不难看出其中的原因。埃利斯与联合创始人兼首席技术官乔丹·努恩(Jordan Noone)在蓝色起源(Blue Origin)切割火箭牙齿时梦想的3D打印过程可能是革命性的。\n运载火箭通常由数千个部件组成，每个部件都必须单独制造、检查和安装在一起。这不仅使建造火箭成为一个漫长而复杂的过程，而且也是一个昂贵的过程。\n相对论的方法是在其巨大的“星门”打印机上尽可能地进行3D打印，将部件总数减少几个数量级-同时，至少根据飞行前的测试，不会影响最终产品的性能。事实上，通过消除组装中的微小制造缺陷和人为错误的放大，可以显著提高可靠性和性能。如果出了问题，你可以在大约两个月内拆解旧的并打印一份新的，这只是建造新的德尔塔4号或猎鹰9号所需时间的一小部分。总而言之，这是一个非常有吸引力的提议。\n当然，从头开始为火箭创造一个全新的制造工艺是一项重大的努力，但相对论已经做了足够的工作，让投资者和客户相信，这远远不仅仅是一个科学项目。该公司在2018年和2019年分别筹集了3500万美元和1.4亿美元，并正在为2021年的首次轨道飞行做准备。\n由于明年将是公司成立以来最重要的一年，埃利斯将有很多事情要讨论，从他们使用的技术到他们将面临的竞争。\n只需125美元就能买到一张下周之前的早班票。我们还为团体、学生、现役军人/政府雇员以及希望推销并让他们的初创公司获得额外知名度的早期空间初创公司创始人提供折扣。", "note_en": "Relativity was founded in 2015 and since then has racked up a full slate of  eager customers, making its Terran-1 rocket possibly the most pre-sold launch vehicle ever. And it’s not hard to see why. The 3D printing process that Ellis, with co-founder and CTO Jordan Noone, dreamed up while cutting their rocketry teeth at Blue Origin,  is potentially revolutionary.\n  Launch vehicles are normally made up of thousands of parts, each of which must be manufactured, inspected, and fitted together individually. This not only makes building a rocket a long and complex process, but an expensive one, too.\n Relativity’s approach is to 3D print everything it possibly can in its enormous “Stargate” printers, reducing the total number of parts by orders of magnitude — while, at least according to pre-flight tests, not affecting the final product’s performance. In fact, by removing the magnification of minor manufacturing defects and human error in assembly, reliability and performance can be significantly improved.     And if something goes wrong, well, you can break down the old one and print a new one in about two months, a fraction of the time it would take to build a new Delta IV or Falcon 9. Altogether it’s a very attractive proposition.\n Of course, creating an entire new manufacturing process for rocketry from scratch is something of a major endeavor, but Relativity has done enough to convince both investors and customers that it is far from a mere science project. The company raised $35 million in 2018  and $140 million in 2019, and is preparing for its first orbital flight in 2021.\n With next year shaping up to be the most important since the company was founded, Ellis will have a great deal to discuss, from the technology they use to the competition they’ll be going up against.\n   Get an early-bird ticket for just $125 until next week. And we have  discounts available for groups,  students,  active military/government employees and for  early-stage space startup founders who want to pitch and give their startup some extra visibility.", "posttime": "2020-11-03 00:32:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,太空,参加,space,火箭", "title": "\n相对论太空的蒂姆·埃利斯将参加TC Sessions：Space 2020", "title_en": "\n\t\t\t\tRelativity Space’s Tim Ellis is coming to TC Sessions: Space 2020\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/02/relativity-spaces-tim-ellis-is-coming-to-tc-sessions-space-2020/", "via": "", "real_tags": ["2020", "太空", "参加", "space", "火箭"]}, {"category": "", "categoryclass": "", "imagename": "608cc1c80e56de49bae8e64837bad6c8.png", "infoid": 1032801, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上个月，索尼在一段拆卸视频中透露，让PlayStation5拥有如此大体积的白色波浪形面板很容易用手拆卸，而不需要使用工具。这让一些人希望可定制的Xbox360风格面板的售后市场回归，以改变你个人娱乐中心系统的外观。\n显然，索尼并不在希望之列。据报道，该公司威胁要对首批设计并试图销售定制PS5面板的公司之一采取法律行动，首先是侵犯商标，然后是涉嫌侵犯知识产权。\nThePlateStation.com(存档版本)诞生于创建一个哑光黑色定制面板的单一愿望中，原因很简单，因为我们认为这是PS5社区应得的，网站上写道。该网站上个月上线，承诺为PS5提供非官方的第三方配件，包括一些价值39.99美元的五颜六色的面板，计划在11月12日系统发布后的两周内发货。\n然而，正如“视频游戏纪事报”(Video Games Chronicle)报道的那样，索尼很快就伸出援手，停止了这一努力。更名后的CustomizeMyPlates的一名代表告诉网站，我们的网站上线仅一天后，索尼的律师就以商标侵权为由要求我们更名(当时是PlateStation5)，更名后的CustomizeMyPlates的一名代表告诉该网站。\n他们说，制版公司认为更名就足够了，因为索尼的面板设计本身只有一项正在申请的专利。但后来索尼的律师告诉我们，这是他们的意见，索尼的知识产权延伸到了面板上，如果我们继续在任何国家销售和分销这些产品，我们最终会诉诸法庭，CustomizeMyPlates的代表继续说。\n记者无法立即联系到索尼代表回应Ars Technica的置评请求。\n在受到法律威胁后，ChangeMyPlates表示，它已经取消并退还了现有的定制面板预购。该网站现在为PS5提供用于剥离和涂抹乙烯基的装甲控制台和控制器皮肤，而不是批发更换面板，预计本月底交货。", "note_en": "Last month, Sony  revealed in a teardown video that the wavy white faceplates that give the PlayStation 5 so much of  its substantial bulk are easily removable by hand, without the use of tools. That caused some to hope for the return of an aftermarket for  customizable, Xbox 360-style faceplates to change the look of the system in your personal entertainment center.\n Sony, apparently, is not among the hopeful. The company has reportedly threatened legal action against one of the first companies to design and attempt to sell custom PS5 faceplates, first for trademark infringement and then for alleged infringement on intellectual property.\n ThePlateStation.com ( archived version) was &#34;born out of the single desire to create a Matte Black custom faceplate, simply because we believed it was what the PS5 community deserved,&#34; the site read. The site went up last month promising &#34;unofficial third-party accessories&#34; for the PS5, including a number of colorful $39.99 faceplates that it planned to ship within two weeks of  the system&#39;s November 12 launch.\n As  Video Games Chronicle reports, though, Sony quickly reached out to put a stop to the effort. &#34;After only a day of our website being live, Sony’s lawyers asked us to change our name (at the time, PlateStation5), due to trademark infringements,&#34; a representative for  the renamed CustomizeMyPlates told the site.\n The plate-makers thought that name change would be enough, they said, since Sony only had &#34;pending patents&#34; on the faceplate design itself. &#34;But then Sony’s lawyers told us it was their opinion Sony’s intellectual property extended to the faceplates and that if we continued to sell and distribute them in any country, we would end up in court,&#34; the CustomizeMyPlates representative continued.\n Sony representatives were not immediately available to respond to a request for comment from Ars Technica.\n Following the legal threat, ChangeMyPlates says it has canceled and refunded its existing pre-orders for custom faceplates. The site  now offers &#34;armored&#34; console and controller skins for the PS5 in &#34;peel and apply&#34; vinyl, rather than wholesale faceplate replacement, with delivery expected by the end of the month.", "posttime": "2020-11-03 00:13:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "面板,sony", "title": "报道：索尼法律威胁暂停第三方PS5面板计划", "title_en": "Report: Sony legal threat halts plans for third-party PS5 faceplates", "transed": 1, "url": "https://arstechnica.com/gaming/2020/11/report-sony-legal-threat-halts-plans-for-third-party-ps5-faceplates/", "via": "", "real_tags": ["面板", "sony"]}, {"category": "", "categoryclass": "", "imagename": "14ec6a4e5dec230e1e6a59dc66ab72fb.jpg", "infoid": 1032800, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是Haystack News在其以前仅限视频点播(VOD)的新闻服务中增加的第一个现场新闻频道。\n在此之前，Haystack News最近进行了另一次更新，由于福克斯拥有和运营的地方电视台的增加，该公司的服务总共达到了350多个新闻源。这一变化使得干草堆新闻可以100%覆盖排名前30位的DMA(指定的市场区域)。\n通过今天的更新，Haystack News的目标是成为选举之夜现场报道的一站式商店，特别是为寻求国家和地方新闻报道相结合的服务的剪线工人提供服务。\nHystack News尤其受益于向过度流媒体的快速转变和剪线的兴起。\n今年早些时候，该公司将品牌从Haystack TV更名为Haystack News，以更好地反映其作为广告支持的视频新闻报道目的地的地位。6月份，Haystack新闻报道了其服务创纪录的增长，今年到目前为止已有“数百万”新用户注册，受众同比增长145%。该公司还表示，该应用程序的使用率有望在2020年翻一番以上，每月超过数百万小时。\n作为重塑品牌的一部分，Haystack News更新了其应用程序的用户界面，并推出了Newsline-一种个性化和动态的新闻电视报价器。\n今天，Haystack新闻告诉我们，在过去的五年里，该公司的净新用户每年都翻了一番，到2020年这个数字已经达到了大约300万。\n它还提供了一个新的数据点，首次指出海堆栈新闻在2020年消费的新闻内容已经超过20亿分钟。\n作为一项免费服务，Haystack News通过广告获得支持，但声称其广告负荷低于传统电视。这使得这项服务对剪线工人特别有吸引力，他们可能在放弃传统的付费电视订阅并正在寻找免费替代品时失去了收看电视新闻的机会。\n虽然从智能电视或流媒体设备访问流媒体新闻的方式有很多种，但Haystack News的优势在于，截至此次更新，它现在提供了各种内容-包括点播和实况流媒体新闻，以及国家和地方新闻报道。\n然而，该公司告诉我们，其更大的竞争优势仍将是如何向最终用户个性化新闻-该公司表示，这一功能将有助于将自己与其他流媒体竞争对手区分开来。\nHystack News在一系列智能电视上提供服务，包括海信、LG、三星、索尼、TCL和Vizio智能电视，以及亚马逊Fire TV、Android TV、Apple TV、Roku以及Android和iOS移动设备。在网络上，它可以在haystack.tv上找到。\n到目前为止，Haystack News已经筹集了650万美元，其中包括2019年结束的最新一轮融资。这项服务得到了Altair Capital、全国广播公司协会(NAB)、斯坦福大学的StartX基金、SVLinks、Uhuru Capital和Zorlu Ventures的支持。", "note_en": "These are the first live news channels Haystack News has added to its previously video-on-demand (VOD) only news service.\n The expansion follows another recent update to Haystack News that brought its service to over 350 total news sources, thanks to the addition of Fox owned-and-operated local stations. This change allowed Haystack News to reach 100% of the top 30 DMAs ( designated market areas).\n  With today’s update, Haystack News aims to become a one-stop shop for live Election Night coverage, as well  — particularly for cord cutters looking for a service offering a combination of both national and local news coverage.\n Haystack News has particularly benefited from the rapid shift to over-the-top streaming and rise of cord cutting.\n Earlier this year, the company rebranded from  Haystack TV   to Haystack News to better reflect its position as a destination for ad-supported video news coverage. And in June, Haystack News  reported record growth for its service with “millions” of new users signing up year-to-date, and 145% audience growth year-over-year. It also said the app was on pace to more than double usage in 2020, exceeding millions of hours monthly.\n As part of its rebrand, Haystack News updated its app’s user interface and rolled out Newsline — a personalized and dynamic news TV ticker.\n Today, Haystack News tells us the company has doubled its net new users for each of the past five years and that number has reached about 3 million users for 2020.\n It also offered a new data point, noting for the first time that Haystack News has surpassed 2 billion minutes of news content consumed in 2020.\n As a free service, Haystack News is supported through advertising, but claims its ad load is less than of traditional TV. This makes the service appealing to cord cutters in particular, who may have lost access to TV news when they dropped their traditional pay TV subscription and are looking for a free replacement.\n While there are a number of ways to access streaming news from a smart TV or streaming media device, Haystack News’ advantage is that it now, as of this update, offers a variety of content — including both on-demand and live streaming news, and both national and local news coverage.\n However, the company tells us its larger competitive advantage will continue to be how it personalizes the news to the end users — a feature that will help to differentiate itself from other streaming rivals, it says.\n Haystack News is offering across a range of smart TVs, including Hisense, LG, Samsung, Sony, TCL and Vizio Smart TVs, as well as on Amazon Fire TV, Android TV, Apple TV, Roku, and Android and iOS mobile devices. On the web, it’s available at  haystack.tv.\n To date, Haystack News has raised $6.5 million, including its most recent round of funding that closed in 2019. The service is backed by AltaIR Capital, the National Association of Broadcasters (NAB), Stanford University’s StartX Fund, SVLinks, Uhuru Capital, and Zorlu Ventures.", "posttime": "2020-11-03 00:08:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "新闻,news", "title": "\n干草堆新闻在选举日前夕增加16个直播新闻频道", "title_en": "\n\t\t\t\tHaystack News adds 16 live news channels ahead of Election Day\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/02/haystack-news-adds-16-live-news-channels-ahead-of-election-day/", "via": "", "real_tags": ["新闻", "news"]}, {"category": "", "categoryclass": "", "imagename": "9656be3c0b8d51dbaee87559ba9c9f36.jpg", "infoid": 1032799, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然我们不能确定，但交易完成的速度可能表明，它酝酿的时间比我们知道的要长，当我们开始听到有关收购的传言时，它可能已经签署、密封和交付了。此外，Twilio首席执行官杰夫·劳森和Segment首席执行官彼得·莱因哈特在达成协议之前就已经认识，这一事实可能有助于加快这一进程。\n无论如何，这两家公司是非常合适的。两者都涉及API经济性，提供了一组工具来帮助开发人员轻松地将一组特定的功能添加到他们的应用程序中。对于Twilio，这是一组通信API，而Segment专注于客户数据。\n当你将这两套工具放在一起，并将其与Twilio对2018年SendGrid的收购结合在一起时，你可以看到构建更完整的应用程序来与各个层面的客户进行互动的可能性，包括来自Twilio的视频、短信和音频等基本通信，以及来自Segment的客户数据，以及基于来自SendGrid的这些互动的定制电子邮件和广告。\n随着公司越来越关注数字参与，特别是在大流行期间，Twilio的劳森认为，这种参与的最大障碍是数据被锁在竖井里，这正是Segment一直在解决的问题。\n劳森在一份声明中说：“随着Segment的加入，Twilio的客户参与平台现在使公司能够了解他们的客户，并通过数字方式与他们互动-这种结合是建立出色的数字体验的关键。”\nCRM Essentials创始人兼首席分析师布伦特·利里在最近的一篇文章中分析了这笔交易背后的原因，他这样认为：“此举让Twilio消除了开发者使用其平台的摩擦，从而影响了数据-洞察-交互-体验转变过程。”\n随着交易的完成，Segment将成为Twilio的一个部门。莱因哈特将继续担任首席执行官，并将直接向劳森汇报工作。", "note_en": "While we can’t know for sure, the speed with which the deal closed could suggest that it was in the works longer than we had known, and when we began hearing rumors of the acquisition, it could have already been signed, sealed and delivered. In addition, the fact that  Twilio   CEO Jeff Lawson and Segment CEO Peter Reinhardt knew one another before coming to terms might have helped accelerate the process.\n  Regardless, the two companies are a nice fit. Both deal with the API economy, providing a set of tools to help developers easily add a particular set of functions to their applications. For Twilio, that’s a set of communications APIs, while  Segment   focuses on customer data.\n When you pull the two sets of tooling together, and combine that with  Twilio’s 2018 SendGrid acquisition, you can see the possibility to build more complete applications for interacting with customers at every level including basic communications like video, SMS and audio from Twilio, as well as customer data from Segment and customized emails and ads based on those interactions from SendGrid.\n As companies increasingly focus on digital engagement, especially in the midst of a pandemic, Twilio’s Lawson believes the biggest roadblock to this type of engagement has been that data has been locked in silos, precisely the kind of problem that Segment has been attacking.\n “With the addition of Segment, Twilio’s Customer Engagement Platform now enables companies to both understand their customer and engage with them digitally — the combination is key to building great digital experiences,” Lawson said in a statement.\n In a recent post  looking at the reasoning behind the deal, Brent Leary, founder and principal analyst at CRM Essentials saw it this way: “This move allows Twilio to impact the data-insight-interaction-experience transformation process by removing friction from developers using their platform,” Leary explained.\n With the deal closed, Segment will become a division of Twilio. Reinhardt will continue to be CEO, and will report directly to Lawson.", "posttime": "2020-11-03 00:08:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "速度,segment", "title": "\nTwilio敲定以32亿美元收购Segment后的翘曲速度求爱", "title_en": "\n\t\t\t\tTwilio wraps $3.2B purchase of Segment after warp speed courtship\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/02/twilio-wraps-3-2b-purchase-of-segment-after-warp-speed-courtship/", "via": "", "real_tags": ["速度", "segment"]}, {"category": "", "categoryclass": "", "imagename": "17fc0b65066fe60754f721ca374b8e44.jpg", "infoid": 1032798, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "风险资本家在第二季度和第三季度加大了支出，推高了私人投资总额，因为随着工作变得偏远，软件需求飙升，电子商务蓬勃发展，学校停课。\n该交易所探索初创企业、市场和资金。每天早上在Extra Crunch上阅读它，或者每周六获得Exchange时事通讯。\n初创公司的反弹在硅谷无处不在：初创公司在大流行中筹集新资本-然后再(一次又一次)筹集资金。即使是直接受到新冠肺炎影响的初创企业也看到了复苏的萌芽，而随着投资者学会在Zoom上开支票，当地的创业场景也在增长。\n但是，虽然这是一个偶然的故事，但它并不是完整的故事。TechCrunch整理的来自各种来源的数据显示，早期女性创始人受到大流行影响的伤害不成比例。\n几周前，香港交易所触及了这个话题，指出“女性创立和联合创立的公司募集的融资数量同比下降，投资于这些融资轮的美元跌至2017年时代的水平。”其他数据表明，大流行更多地落在女性肩上，而不是男性身上，导致她们推迟了创业计划。\n今天上午，交易所正在充实其对女性创始人不断变化的风险投资市场的理解，依靠Flik Founders Report，PitchBook，Imple Ventures收集的信息，以及气球公司(Balloon)关于风险投资和初创公司变化的报告，三年前，#MeToo标签引发了一场关于代理的全球讨论。\n第二季度感受到了大流行的影响，如果减去Reliance Jio筹集的资本，风险投资与2020年第一季度相比下降了9%，与去年同期相比下降了23%。\n在第三季度，情况出现了转机。北美初创企业融资370亿美元，亚洲初创企业融资240亿美元，欧洲初创企业融资90亿美元。正如香港交易所(Exchange)报告的那样，“从我们的数据集来看，亚洲的业绩至少是自2018年第四季度以来的最好结果。欧洲的总市值追平了2019年第二季度创下的高点，“并补充说，”作为一对组合，北美以外的风险投资可能刚刚经历了多年来最好的一个季度，如果不是有史以来最好的一个季度的话。“。\n从第一季度末的恐惧，到第二季度的中等水平，再到第三季度的繁荣。这是一次令人印象深刻的复出。对一些人来说。", "note_en": "Venture capitalists ramped up their spend in Q2 and Q3, pushing private investment totals higher as software demand shot up as work went remote,  e-commerce boomed and schools shuttered.\n  The Exchange explores startups, markets and money. Read it  every morning on Extra Crunch, or get  The Exchange newsletter every Saturday.\n  The startup rebound is omnipresent around Silicon Valley: startups are raising fresh capital amidst a pandemic — and then raising again ( and again). Even startups directly impacted by COVID-19 are  seeing green shoots, while  local entrepreneurial scenes are growing as investors learn to write  checks over Zoom.\n But, while that’s a fortuitous narrative, it’s not the full story. Data from a variety of sources collated by TechCrunch shows that early-stage female founders have been disproportionately hurt by the pandemic’s impact.\n The  Exchange touched on this topic a few weeks ago, noting that “number of rounds raised by female-founded and co-founded companies fell year-over-year, with dollars invested in those rounds collapsing to 2017-era levels.” Other data indicated that  the pandemic was landing more heavily on the shoulders of women than men, causing them to delay entrepreneurial plans.\n This morning, The Exchange is fleshing out its understanding of the changing VC market for female founders, leaning on information collected by the  FLIK Female Founders Report,  PitchBook,  January Ventures and a report  from Balloon on the changes in the venture and startups three years after the #MeToo hashtag spurred a global conversation about representation.\n  The pandemic’s bite was felt in the second quarter when, if one subtracted the capital raised by Reliance Jio, VC  investments fell by 9% compared to Q1 2020, and 23% compared to the year-ago second quarter.\n In the third quarter, things turned around. North American startups raised $37 billion and Asian startups raised $24 billion, while European startups raised $9 billion. As The Exchange reported, “Asia’s result was its best since at least Q4 2018, as far back as our dataset goes. Europe’s total tied its high-water mark set in Q2 2019,” adding that “as a combined pair, venture capital outside North America might have just had its best quarter in years, if not ever.”\n From fear in late Q1, to a middling Q2, to a boom in Q3. It was an impressive comeback. For some.", "posttime": "2020-11-03 00:08:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "风险投资,影响,impact,初创", "title": "\n流行病的影响不成比例地减少了对女性创始人的风险投资", "title_en": "\n\t\t\t\tPandemic’s impact disproportionately reduced VC funding for female founders\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/02/pandemics-impact-disproportionately-reduced-vc-funding-for-female-founders/", "via": "", "real_tags": ["风险投资", "影响", "impact", "初创"]}, {"category": "", "categoryclass": "", "imagename": "105127929739a56d49dcc2db0d9d36d7.jpg", "infoid": 1032797, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "政府研究人员证实，冠状病毒大流行期间航空运输量的急剧下降，大幅减少了商业客机常规收集的大气数据量，从而影响了天气预报模型的质量。\n在一项研究中，研究人员表明，当短期预测模型从飞机上收到的温度、风和湿度数据较少时，预测技能(预测的气象条件与实际发生的情况之间的差异)就会变得更差。\n研究人员和其他人曾怀疑情况会是这样，因为客运和货运航班的大气观测是预测模型中使用的最重要的数据之一。这些观测是由数千架客机上的仪器进行的，这些客机大多设在北美和欧洲，这是一个实施了几十年的计划的一部分。它们被实时传送给世界各地的预报组织，包括美国国家气象局(National Weather Service)。\n在大流行的头几个月里，当全球空中交通下降了75%或更多时，观察到的数量下降了大约同样的百分比。\n其中一名研究人员斯坦·本杰明(Stan Benjamin)是科罗拉多州博尔德市国家海洋和大气管理局下属的全球系统实验室(Global Systems Laboratory)的资深科学家，他说，“通过天气模型中的每一种观测，我们都知道它们对提高整体精度有一定的影响。”“如果你真的失去了很多某种形式的观察能力，总体上可能会在技能上有所倒退。”\n虽然研究人员表明，数据丢失在一定程度上降低了模型的准确性，但NOAA表示，到目前为止，它还没有看到对公司用来做出商业决策的短期预测类型，或者个人可能用来决定外出时是否需要带伞的影响。\n该机构的一份声明称：“随着我们继续从客机和货机以及众多其他数据来源收到有价值的数据，我们没有直接看到预测准确性明显下降。”这些其他来源包括卫星、海洋浮标和由气象气球携带的仪器。\n该机构表示，近几个月来，随着航空旅行的回升，来自飞机的数据量也有所增加。美国每天客机的航班数量现在约为大流行前水平的50%。货机航班没有受到那么大的影响。\n本杰明博士和两名在实验室工作的同事--科罗拉多大学(University Of Colorado)的埃里克·P·詹姆斯(Eric P.James)和科罗拉多州立大学(Colorado State University)的布莱恩·D·贾米森(Brian D.Jamison)--模拟了4月大流行期间的情况，他们从2018年和2019年获取数据，剔除其中的80%，然后将其输入NOAA开发的名为快速刷新的预测模型。\n他们将导致的误差与模型不包括飞机数据时的误差进行了比较。\n本杰明博士说，“我们必须看看80%的影响是否达到了80%。”“但也不算太多。”他们发现，消除80%的数据会产生30%到60%的错误，这些错误是完全没有数据所导致的错误的30%到60%。这项研究发表在“应用气象学和气候学杂志”上。\n另外，世界气象组织本周宣布，它已经与一个航空行业组织签署了一项协议，将把观测项目扩大到目前收集的数据很少的世界部分地区。今年春天，世界气象组织曾对飞机观测数据的丢失表示担忧。\n与国际航空运输协会(International Air Transport Association)达成的协议要求在该计划中增加更多的航空公司和飞机，包括那些在非洲和其他监控较少的地区有航线的航空公司和飞机。\n目前约有40家航空公司参与该计划，总共约有3500架飞机拥有进行和传输观测的设备。在美国，达美航空、联合航空、美国航空和西南航空以及货运公司联合包裹服务公司(United Parcel Service)和联邦快递(FedEx)都参与其中。", "note_en": "Government researchers have confirmed that the steep decline in air traffic during the coronavirus pandemic has affected the quality of weather forecasting models by sharply reducing the amount of atmospheric data routinely collected by commercial airliners.\n In a study, researchers showed that when a short-term forecasting model received less data on temperature, wind and humidity from aircraft, the forecast skill (the difference between predicted meteorological conditions and what actually occurred) was worse.\n The researchers and others had  suspected this would be the case because atmospheric observations from passenger and cargo flights are among the most important data used in forecasting models. The observations are made by instruments aboard thousands of airliners, mostly based in North America and Europe, as part of a program in place for decades. They are transmitted in real time to forecasting organizations around the world, including the National Weather Service.\n During the first months of the pandemic, when air traffic declined by 75 percent or more worldwide, the number of observations dropped by about the same percentage.\n “With every kind of observation that goes into weather models, we know they have some impact on improving accuracy overall,” said one of the researchers, Stan Benjamin, a senior scientist at the Global Systems Laboratory, a part of the National Oceanic and Atmospheric Administration, in Boulder, Colo. “If you’ve really lost a lot of observations of some kind there could be some stepping back in skill overall.”\n While the researchers showed that the data loss contributed to making the model less accurate, NOAA said that so far it had not seen an impact on the type of short-term forecasts that companies use to make business decisions or a person might use to decide if they need to take an umbrella when going out.\n “We are not directly seeing a readily apparent reduction in forecast accuracy as we continue to receive valuable data from passenger and cargo aircraft along with numerous other data sources,” an agency statement said. Those other sources include satellites, ocean buoys and instruments carried aloft by weather balloons.\n The amount of data from aircraft has also increased in recent months as air travel has picked up, the agency said. The daily number of flights by passenger aircraft in the United States is now at about 50 percent of pre-pandemic levels. Flights by cargo aircraft were not as affected.\n Dr. Benjamin, along with two colleagues working at the laboratory, Eric P. James of the University of Colorado and Brian D. Jamison of Colorado State University, simulated conditions during the pandemic in April by taking data from 2018 and 2019 and eliminating 80 percent of it before feeding it into a forecasting model developed by NOAA called Rapid Refresh.\n They compared the errors that resulted to those if the model included no aircraft data.\n “We had to look to see if 80 percent gives 80 percent of impact,” Dr. Benjamin said. “But it’s not quite that much.” They found that eliminating 80 percent of the data produced errors that were 30 to 60 percent of the errors that would have resulted from having no data at all.  The study was published in the Journal of Applied Meteorology and Climatology.\n Separately, the World Meteorological Organization, which in the spring had expressed concern about the loss of aircraft-based observational data, announced this week that it had signed an agreement with an aviation industry group  to expand the observation program   to cover parts of the world where little data is currently gathered.\n The agreement with the International Air Transport Association calls for adding more airlines and aircraft to the program, including those that have routes in Africa and other less-monitored areas.\n Currently about 40 airlines participate in the program, and in all about 3,500 aircraft have the equipment to make and transmit observations. In the United States, Delta, United, American and Southwest and the cargo carriers United Parcel Service and FedEx are involved.", "posttime": "2020-11-03 00:07:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "显示,air,数据", "title": "研究显示，航空旅行的低迷阻碍了天气预报", "title_en": "Slump in Air Travel Hindered Weather Forecasting, Study Shows", "transed": 1, "url": "https://www.nytimes.com/2020/10/29/climate/slump-in-air-travel-hindered-weather-forecasting-study-shows.html", "via": "", "real_tags": ["显示", "air", "数据"]}]