[{"category": "", "categoryclass": "", "imagename": "c1424cf2f4d4993beebcbe24139b8e6c.jpg", "infoid": 1002252, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "iiSM.org是一个由软件管理专业人员为软件管理专业人员提供的软件开发经理成员社区", "note_en": "iiSM.org is a community of software development manager members, by software management professionals, for software management professionals", "posttime": "2020-05-16 00:49:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "scrum,人员", "title": "敏捷Scrum不起作用", "title_en": "Agile Scrum is not working", "transed": 1, "url": "https://iism.org/article/agile-scrum-is-not-working-51", "via": "", "real_tags": ["scrum", "人员"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002249, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我很高兴地报告，我去年与其他人共同创立的非营利组织POLYFORM Project发布了两个新的标准格式软件许可证，POLYFORM Defense 1.0.0和POLYFORM Perieter 1.0.0。\n这些许可证授予对软件源代码的广泛权限，但有两个相似但可区分的限制。POLYFORM防御性禁止使用软件完成开发人员或公司对代码的许可。POLYFORM PERIMETER禁止使用软件与软件项目本身竞争。根据项目在其开发人员中扮演的角色(例如，附加组件或核心产品)，这些新表单中的一种或另一种可能恰到好处。\n特别感谢所有参与帮助我们为这些新许可证选择独特名称的人。更要感谢所有那些在设计和实现过程中提供了重要反馈的人-现在他们太多了，已经数不清了。\n根据我自己的实践经验，我知道这些许可证将直接解决来自公司和软件开发人员的非常常见的请求，特别是那些处于弄清楚如何将他们的软件变成业务的早期阶段的公司和软件开发人员。我听说客户要求获得许可，以防止他们的竞争对手-特别是规模更大、更成熟的竞争对手-将自己的工作与他们作对。当仅限于已发布的标准许可时，这通常会导致复杂的、迂回的分析，即如何使用版权许可，或者如何分割设计良好的项目，以便某些部分或其他部分可以秘密保留，以达到相同的效果。\n随着时间的推移，随着关系网络、市场地位、收入和自信的增长，许多软件公司享有越来越多的自由，可以更自由地许可他们的工作。这里希望这些新的POLYFORM许可证填补了一路上的空白，成为我们曾经在泥泞中跋涉或大踏步前进的坚实垫脚石。", "note_en": "Very pleased to report that  PolyForm Project, a non-profit I cofounded with others last year, has published two new standard form software licenses,  PolyForm Defensive 1.0.0 and  PolyForm Perimeter 1.0.0.\n These licenses grant broad permission for software source code, with two similar but distinguishable limits. PolyForm Defensive prohibits using the software to complete with the developer or company licensing the code. PolyForm Perimeter prohibits using the software to compete with the software project itself. Depending on the role a project plays for its developer—add-on or core offering, for example—one or the other of these new forms may be just right.\n Special thanks go out to all those who weighed in to help us  pick distinctive names for these new licenses. More thanks go out to all those—now too many to count—who provided crucial feedback on design and implementation along the way.\n From my own practice experience, I know that these licenses will directly address very common requests from companies and software developers, especially those in the early stages of figuring out how to make their software a business. I’ve heard clients ask for licenses that keep their competitors—especially larger, more established competitors—from turning their own work against them. When limited to published standard licenses, that has often led to complex, roundabout analyses of how to use copyleft licenses, or how to slice and dice well designed projects, so that some part or other can be held back in secret, for the same effect.\n In time, many software companies enjoy increasing freedom to license their work more permissively as their network of relationships, market position, revenue, and self-confidence grow. Here’s hoping these new PolyForm licenses fill gaps along the way, as sturdy stepping stones where once we trudged through mud or took big leaps.", "posttime": "2020-05-16 00:32:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "竞业禁止,noncompete,软件", "title": "POLYFORM竞业禁止许可证", "title_en": "PolyForm Noncompete Licenses", "transed": 1, "url": "https://writing.kemitchell.com/2020/05/14/PolyForm-Defensive-Perimenter.html", "via": "", "real_tags": ["竞业禁止", "软件"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002248, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了帮助支持我们的社区在COVID-19期间远程工作，我们将在2020年6月30日之前免费访问ACM在我们的数字图书馆中发布的所有作品。了解更多。\n我们使用饼干，以确保我们给你最好的经验，在我们的网站。\n您的浏览器似乎不支持它们，这会影响网站功能。", "note_en": "To help support our community working remotely during COVID-19, we are making all work published by ACM in our Digital Library freely accessible through June 30, 2020.  Learn more\n   We use cookies to ensure that we give you the best experience on our website.\n  It seems your browser doesn&#39;t support them and this affects the site functionality.", "posttime": "2020-05-16 00:31:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "硬币,bias,网站", "title": "掷硬币的动态偏向(2007)", "title_en": "Dynamical bias in the coin toss (2007)", "transed": 1, "url": "https://dl.acm.org/doi/10.1137/S0036144504446436", "via": "", "real_tags": ["硬币", "bias", "网站"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002247, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "HOWTO-INDEX下一章第5章HOWTO的单列表，如何让3键串行鼠标在Linux下正常工作。，.Details下载和安装使用RedHat Linux的图形渲染和建模开发环境的说明。，.在一台小规格(4MB内存，200MB硬盘)笔记本电脑上安装一个成熟的Linux。，。描述使用XSupplicant作为Supplicant并将FreeRADIUS用作后端验证服务器来设置和使用基于IEEE802.1X端口的网络访问控制的软件和过程。，涵盖Linux可用的自适应技术的使用。为Linux软件开发人员提供了开发可访问的Linux应用程序的指导方针和测试用例。描述如何构建、设置和使用IBM Thinkpad[tm]600e、600和770X的ACP(MWave)调制解调器功能。概述了如何为内核打补丁以获得ACPI支持；它允许从操作系统内部控制电源管理。。描述如何配置Linux路由器以更有效地管理ADSL调制解调器上的出站通信。如何为Linux/i386商用ADSM备份系统安装和使用客户端。-替换为《高级Bash-脚本指南》。iproute2、流量整形和一些netfilter的实际操作方法。对Linux社区如何有效地倡导使用Linux提出建议。、有关在Linux平台上工作的各种AI相关软件库、应用程序等的信息和链接。，.现有Alpha CPU、芯片组和系统的简要概述。，。描述Linux版ALSA声卡驱动程序的安装。介绍如何安装、配置和维护由Antares Microsystems在基于5070 SBus主机的RAID控制器上构建的硬件RAID。介绍如何使用mod_perl、mod_dav、mod_auth_ldap、mod_dynvhost、mod_roaming、mod_jserv和mod_php等重要模块编译Apache Web服务器。详细介绍了如何安装配置为处理DSO的基于Apache的Web服务器套件，以及各种有用的模块，包括mod_perl、mod_ssl和php。，.Apache Web服务器和相关项目的概述。它为进一步的信息和实施细节提供了指针。关于通过PHP/FI脚本语言构建支持动态Web内容的多用途Web服务器、基于Netscape的SSL安全传输数据、安全执行CGI和MS Frontpage Server Extensions。介绍如何使用Apache实现WebDAV服务-使用LDAP进行身份验证，使用SSL确保DAV存储的安全性。如何使用免费编程工具用汇编语言编程，重点关注Linux操作系统Onia-32(I386)平台的开发。，.Document分享了在追求天文学的过程中利用Linux解决方案的提示和资源。，。说明如何在具有ATA RAID控制器(板载芯片或独立卡)、单处理器或多处理器以及至少两个硬盘的英特尔奔腾兼容计算机上安装Linux。，。如何在某些主板/芯片组上启用Athlon/Duron/AthlonXP处理器的节能功能。描述如何安装、设置和配置必要的驱动程序和工具，以支持Linux下的ATM网络。，.Document说明如何设置身份验证网关。、.Autodir安装、配置和其他与Autodir相关的问题。，。描述autofs自动挂载程序，如何配置它；指出一些需要避免的问题。提供在GNU/Linux下运行的软件包的指针，这些软件包对飞行员(私人、商业或军事)、航空公司、机场或航空领域的任何参与者都很有用。，.适用于希望使用GNU/Linux机器对AVR微控制器进行编程的读者。，。如何安装和配置对AX的支持。全球业余无线电运营商使用的25个分组无线电协议。如何在控制台和X.上使用与Linux兼容的磁带机来备份Linux机器的文件系统的解决方案，..Working Backspace and Delete Keyon on the Console and X.，.如何使用安装在MS-DOS机器上的与Linux兼容的磁带机来备份Linux机器的文件系统。描述如何设置Linux服务器以限制下载带宽或传入流量，以及如何更有效地使用Internet链接。，.a文档，用于在GNU/Linux中设置和开发对孟加拉语(孟加拉语)的支持。，。本文旨在帮助您开始编写从基础到中间的shell脚本。讨论了终端和xterm提示符的创建和控制，包括结合标准转义序列给出用户名、当前工作目录、时间等。如何优化和配置电池供电笔记本电脑上现成配置的Linux系统的电源管理。在Linux控制台、X Window系统、Web浏览器、文本编辑器等中设置白俄罗斯语支持的简短指南。描述的字符集有WINDOWS-1251、ISO-8859-5和KOI8-RU。用英语写的。", "note_en": "HOWTO-INDEX    Next   Chapter 5. Single list of HOWTOs  ,  .How to get a 3 button serial mouse working properly under Linux.  ,  .Details download and installation instructions for a graphicsrendering and modelling development environment using RedHat Linux.  ,  .Put a &#34;grown-up&#34; Linux on a small-spec (4mb RAM, &lt;=200mb hard disk)laptop.  ,  .Describes the software and procedures to set up and use IEEE802.1X Port-Based Network Access Control using Xsupplicant asSupplicant with FreeRADIUS as a back-end Authentication Server.  ,  .Covers the use of adaptive technologies that are availablefor Linux.  ,  .Provides Linux software developers with guidelines andtest cases for developing accessible Linux applications.  ,  .Describes how to build, setup, and use the ACP (Mwave) Modemfeature of the IBM Thinkpad[tm] 600E, 600, and 770x.  ,  .Outlines how to patch a kernel for ACPI support; which allows control ofpower management from within the operating system.  .  ,  .Describes how to configure a linux router to moreeffectively manage outbound traffic on an ADSL modem.  ,  .How to install and use a client for the commercial ADSM backup systemfor Linux/i386.   - replaced by the  Advanced Bash-Scripting Guide.  ,  .A very hands-on approach to iproute2, traffic shaping and a bit of netfilter.  ,  .Suggestions for how the Linux community can effectivelyadvocate the use of Linux.  ,  .Information about, and links to, various AI related software libraries,applications, etc. that work on the Linux platform.  ,  .A brief overview of existing Alpha CPUs, chipsets and systems.  ,  .Describes the installation of the ALSA sound drivers for Linux.  ,  .Describes how to install, configure, and maintain a hardware RAID builtaround the 5070 SBUS host based RAID controller by Antares Microsystems. ,  .Describes how to compile the Apache Webserver with important modules like mod_perl, mod_dav, mod_auth_ldap,mod_dynvhost, mod_roaming, mod_jserv, and mod_php.  ,  .Details the installation of an Apache based webserver suite configuredto handle DSO, and various useful modules including mod_perl,mod_ssl and php.  ,  .An overview of the Apache webserver and relatedprojects. It provides pointers for further information and implementation details.  ,  .About building a multipurpose webserver that will support dynamicweb content via the PHP/FI scripting language, secure transmission ofdata based on Netscape&#39;s SSL, secure execution of CGI&#39;s andMS Frontpage Server Extensions.  ,  .A HOWTO on implementing WebDAV services using Apache - with LDAP forauthentication and SSL for ensuring security of the DAV stores.  ,  .How to program in assembly language using FREE programming tools,focusing on development for or from the Linux Operating System onIA-32 (i386) platform.  ,  .Document shares tips and resources to utilize Linux solutions inthe pursuit of Astronomy.  ,  .Explains how to install Linux on an IntelPentium compatible computer with an ATA RAID Controller (onboard chipor seperate card), single or multiple processors and at least two harddisks.  ,  .How to enable the power-saving functionality of theAthlon/Duron/AthlonXP processor on some motherboards/chipsets.  ,  .Describes how to install, setup, and configure the necessarydrivers and tools to support ATM networking under Linux.  ,  .Document explains how to setup an authentication gateway.  ,  .Autodir installation, configuration and other issues related to Autodir.  ,  .Describes the autofs automounter, how to configure it; points outsome problems to avoid.  ,  .Intended to provide pointers to software packages that rununder GNU/Linux and are usefull to pilots (private, commercialor military), airlines, airports or any actors in the aeronauticaldomain.  ,  .For readers wishing to program an AVR microcontrollerusing a GNU/Linux machine.  ,  .How to install and configure support for the AX. 25 packet radioprotocol utilized by Amateur Radio Operators worldwide.  ,  .Solutions for having working Backspace and Delete keyson the console and on X.  ,  .How to use a Linux-compatible tape drive installed on an MS-DOSmachine to back up the filesystem of a Linux machine.  ,  .Describes how to set up your Linux server to limit download bandwidth or incoming traffic, and how to use your internet link more efficiently.  ,  .A document to setup and develop support forBengali (Bangla) in GNU/Linux.  ,  .This article intends to help you to start programmingbasic-to-intermediate shell scripts.  ,  .Creating and controlling terminal and xterm prompts is discussed,including incorporating standard escape sequences to give username,current working directory, time, etc.  ,  .How to optimize and configure power management on aready-configured Linux system for use on battery-powered laptops.  ,  .Short guide in setting up Belarusian language support in Linux console,X Window System, web-browsers, text editors, etc. Charsetsdescribed are windows-1251, iso-8859-5 and koi8-ru.  Written in English.  ,  .How to tweak Linux for Belgian users; lists Linux user groups,businesses and other resources in Belgium.  ,  .Discusses some issues associated with the benchmarking of Linuxsystems and presents a basic benchmarking toolkit.  ,  .Describes step by step instructions on building a Beowulf cluster.This is a Red Hat and LAM specific version of this document. ,  .Describes the basics of a Boca 16-port serial card (Boca 2016)with Linux.  ,  .Some information about BogoMips, compiled from various sources.  ,  .A cookbook for setting up root raid using the 0.90 raidtoolsfor bootable raid mounted on root using standard LILO.  ,  .How to design and build your own boot/root diskettes for Linux.  ,  .A compilation of all the possible boot time arguments that can bepassed to the Linux kernel at boot time. Includes all kernel anddevice parameters.  ,  .Describes how to setup an ethernet bridge.  ,  .A bridge is an intelligent connection wire between two network cards.A firewall is an intelligent insulator.  ,  .Describes how to setup a bridge with the recent kernel patches and brctlutility by Lennert Buytenhek. With developer kernel 2.3.47 the newbridging code is part of the mainstream. On 20.06.2000 there are patchesfor stable kernels 2.2.14 and 2.2.15.  ,   .Assists the reader in the steps necessary to configure and usea video tuner card based on the popular Bt848 and Bt878 chipsetswithin the Linux operating system.  ,  .How to use the bzip2 compression program.   .This HOWTO has been removed for review.  ,  .How to dynamically load C++ functions and classes usingthe dlopen API.  ,  .This HOWTO has been removed for review.  ,  .An introduction to editing C andother language files whose syntax is similar like C++and Java in vi/VIM.  ,  .Written to assist the Linux user in configuring a cable modemfor internet access using a cable network.  ,  .How to set up call-back by using the Linux system and modem.  ,  .An overview of the Caudium (web) server. Includes informationon setup, development, and optimization.  ,  .Describes the steps and commands you canuse to setup your own CD Server using Linux and some built-inUnix commands along with other freely available software packages.  ,  .Explains how to write CD-ROMs under Linux.  ,  .How to install, configure, and use CD-ROM drives under Linux.  ,  .Demonstrates how to implement Chinese on Linux system, includingthose common problems encountered while using Chinese, the ways toobtain, and shows how to install and setup a variety of differentChinese software.  ,  .Describes installing the BIND 9 nameserver to run in a chrootjail and as a non-root user, to provide added security and minimise thepotential effects of a security compromise.  ,  .Describes installing the BIND 8 nameserver to run in a chrootjail and as a non-root user, to provide added security and minimise thepotential effects of a security compromise.  ,  .How to setup a VPN using Cipe on a linux masquerading firewall.  ,  .How to set and keep your computer&#39;s clock on time.  ,  .Describes a setup that allows a machine to boot Linux fromBOOTP/TFTP, using the Grub boot loader, and save and restore disk andpartition images to and from a TFTP server.  ,  .How to set up high-performance Linux computing clusters.  ,  .Yes, Linux DOES make coffee, and it tastes good.  ,  .A listing of commercial software and applications which are offeredfor Linux.  ,  .Discusses methods that can be used to approach commercial softwarecompanies to convince them to port their programs to Linux.  ,  .Describes the installation of Linux on a headless CompaqProLiant server with a Compaq Remote Insight Lights-OutEdition card without physical access to the system.  ,  .Lists the procedures and tools needed to boot the Compaq T1500, using aNetboot of both the native file system and a generic Linux installation. ,  .Discusses how to compress data streams.  ,  .A guide to using Conexant and Rockwell chipset based Software modems under Linux.  ,  .Document from which every others can refer to configuremost common hardware and services.  .  ,  .Helps people understand how a CPU is designed and manufactured.Contains references to various resources.  ,  .Eplains how to create encrypted file systems using theCryptoloop functionality. Cryptoloop is part of the CryptoAPI in the 2.6 Linux kernel series.  ,  .This HOWTO has been removed for review.  ,   .A comprehensive guide to installing, configuring, and running CyrusImap and Cyrus Sasl.  ,  .How to configure Linux and various Linux applications for Danishlocale standards such as keyboard, font, paper-size etc.  ,  .Intended for anyone interested in installing andusing IBM DB2 Express-C 9 database on Linux.  ,  .Shows how to build a minimal Debian .deb package.  ,  .Demonstrates how to use command-line tools to configure yourDebian system for printing. It explains how to send documents from Linuxto Windows printers and how to share Linux printers with Windows PCs.  ,  .Describes why you should use jigdo (a tool for obtaining Debian ISOs),a little bit about how it works and how you use it to get and updateDebian ISOs.  ,  .Answers basic questions on how to set up yourLinux box to serve as a DHCP server or a DHCP client.  ,  .Shows some typical scenarios for easy start using Diald.  .  ,  .A method is described for encrypting a hard disk, either in whole or in part, with the encryption key storedon an external medium for increased security.  ,  .This HOWTO has been removed for review.  ,  . How to setup a server and configure clients for diskless operationfrom a network.  ,  .Another approach to  Diskless-root-NFS-HOWTO. ,  .Discusses how to make the Flash Drives Linux bootable.Describes how to boot from such a drive, instead of from the normal hard drive.  ,  .Describes how to get, compile and use FreeBSD divert sockets underLinux 2.2.12.  ,  .How to become a totally &#34;small time&#34; DNS admin.  ,  .Attempts to clear the fog and mystery surrounding the DocBook markupsystem and the tools that go with it.  ,  .A detailed practical guide for novices to quickly getting DocBook installedand processing SGML files into HTML, PostScript and PDF on a GNU/Linuxsystem.  ,  .Explains setting up OpenJade to process SGML/XML DocBook documents.  ,  .Outlines the things you will probably have to do when you want toset up a network of computers under your own domain.  ,  .Written for all the DOS and Windows users who have decided to switchto Linux.  ,  .DOSEMU stands for DOS Emulation, and is an application that enables theLinux OS to run many DOS programs.  ,  .How to set up hardware RAID under Linux.  ,  .Examines the DSL family of high speed Internet services now beingdeployed in various markets worldwide. Information is included on thetechnology behind DSL as well as subscribing, installing,configuring, and troubleshooting.  ,  .An easy to follow explanation on how to get DVD movieplay-back in Linux.  ,  .This document describes how to view DVD movies on a Linux computer with aDVD drive.  ,  .Discusses ways to make computers less harmful toour environment and to solve some ecological issues. It explains how to useLinux to save power and consumables like paper and ink. Since it does notrequire big hardware, Linux may be used with old computers to make their lifecycle longer. Games may be used in environmental education and software isavailable to simulate ecological processes.  ,  .Introduces Linux users to the Emacs editor.  ,  .Installation instructions for the Emacspeak audio desktopapplication for Linux.  ,  . Explains some of the difficulties and biases women face in the Linux community and examines various strategies foraddressing those difficulties in order to encourage more participation by women.  ,  .Explains how to make your personal data secure by encrypting your Linux root filesystem using strong cryptography.  ,  .How to set up an Enterprise Java environment on Linux including aJDK, a Web server, supporting Java servlets, accessing a database viaJDBC, and supporting Enterprise Java Beans (EJBs).  ,  .  ,  .Information about which ethernet devices can be used for Linux, andhow to set them up (focused on the hardware and low level driveraspect of the ethernet cards; see Network HOWTO for softwareconfiguration information).  ,  .Information on setting up an ethernet bridge with asurveying and/or regulating instance into an existing network topology.  ,  .Describes how to make the Euro character supportin GNU/Linux work.  ,  .The purpose of this document is to show you how to creategood presentations for almost any sort of Linux event.  ,  .Presents a discussion of how to retrieve deleted files froma Second Extended File System.  ,  .Describes in detail one of the simplest ways to setup a faxserver on your Linux system.  ,  .Covers the installation and use of the most popular amateur packet-radioBBS software FBB.  ,  .How to get various proprietary and restricted multimedia DamnedThings (Flash, MP3, Java, mpeg, avi, Real Media, Windows Media)working under Fedora.  ,  .About filesystems and accessing filesystems.  ,  .Describes how to localize GNU/Linux for Finnish users (written in Finnish).  ,  .Designed to describe the basics of firewall systems and give you somedetail on setting up both a filtering and proxy firewall on a Linuxbased system.  ,  .Directions for using ppp over telnet to do network activitiestransparently through an Internet firewall.  ,  .Describes procedures for installing USB Flash Memory devicesand the way of formatting them for various file systems suchas vfat (the way they usually come) and ext2 (the way they fit in better with Linux).  ,  .Provides a comprehensive source to act as a starting point for any and all font questions about Linux.  ,  .How to use the framebuffer devices in Linux with a variety of platforms.Also includes how to set up multi-headed displays.  ,  .  ,  .A brief description of what happens in a Linux system from the timethat you turn on the power, to the time that you log in and get abash prompt.  ,  .Discusses essential do&#39;s and dont&#39;s for the ftape floppy tape driverunder Linux. Focuses on the newest version (ftape-4.02 at the time ofthis writing).  ,  .How to use ftp clients and servers ,  .Creating a new GCC front end.  ,  .Addresses Linux localization issues specific to German users(written in German).  ,  .How to acquire, install and configure a powerful scientificpublic-domain Geographic Information System (GIS): the GeographicResources Analysis Support System (GRASS).  ,  .Explains how you install a new version of glibc on your system.  ,  .Covers installing and using the GNU C Library version 2 (libc6)on Linux systems.  ,  .Using the Visor with Linux and your USB port.  ,  .How to copy a Linux system from one hard disk to another.  ,  .Lists most of the hardware supported by Linux and helps you locateany necessary drivers.  ,  .How to configure your Linux machine to use Hebrew characters onX-Windows and Virtual Consoles.  ,  .Addresses Linux localization issues specific to Greek users(written in Hellenic).  ,  .Tries to clarify some issues and give tips on how to create Linux applications highly integrated to the Operating System, security and easy of use.  ,  .Use Linux to control your home electrical devices.  ,  .Tutorial on configuring Red Hat 6 and related variants to operateas an internet gateway to a small home or office network.Topics covered include masquerading, DNS, DHCP, and basic security.  ,  .This is about how to write HOWTOs using the simple LinuxDoc markup.It&#39;s primarily for Linux Documentation Project authors (and futurefledging authors who want to get started fast). If you want to usethe more advanced DocBook markup (including XML) see the LDP Author Guide.  .  ,  .Index to the Linux HOWTOs as well as other information about the LDP.  ,  .Describes the use of products available in the Hewlett-Packard (HP) catalogwith Linux and some free software.  ,  .Describes getting XFree86 4.x running on Intel&#39;s i810 graphics chipset by using special features of the 2.4.0 kernel.  ,  .Describes the installation of GNU/Linux on the IBM RS/6000 43Pmodel 7248 series.  ,  .Information about implementing system calls in the Linuxoperating system for i386 architecture with 2.6 kernels.  ,  .A detailed guide on how to install and use Indic scripts (devanagri etc.) using UTF-8 encoding under GNU/Linux.  ,  .Provides basic information about the Linux operating system,including an explanation of Linux, a list of features, somerequirements, and some resources.  ,  .Introduction to Linux and infrared devices and how to use thesoftware provided by the Linux/IrDA project.  ,  .Helps install the Ingres II Relational Database Management System on Linux.  ,  .How to obtain and install Linux software. It is the first documentwhich a new Linux user should read to get started.  ,  .Provides some guidelines that should help you run asuccessful installfest.  ,  .How to install Linux from a parallel port zip drive using theSlackware Linux distribution.  ,  .Discusses a few installation strategies for those whointend to dual-boot between Windows and Linux.  ,  .This xmodmap and kimap solutions will work for you in setting up anyinternational keyboard for (Debian, RedHat, Mandrake, Corel)Linux, FreeBSD, OpenBSD, NetBSD and possibly every Unix that usesXfree86 and KDE.  ,  .How to setup an Intranet using Linux as the server which binds Unix,Netware, NT and Windows together.  ,  .Covers information on available patches for the 2.4 kernelthat will improve the I/O performance of your Linux operating system.  ,  .Describes programming hardware I/O ports and waiting for smallperiods of time in user-mode Linux programs running on the Intel x86architecture.  ,  .How to set up and run IP aliasing on a Linux box.  ,  .How to obtain, install and configure the enhanced IP firewallingchains software for Linux, and some ideas on how you might use them.  ,  .How to enable the Linux IP Masquerade feature on a given Linux host.  ,  .Present a way to allow users behind an IPMasq&#39;d system to use Napster.  ,  .How to obtain, install and configure various tools available for theLinux operating system that use the Linux kernel IPX protocol support.  ,  .Describes the basics of IRC and respective applications for Linux.  ,  .How to use Linux to connect to an Internet Service Provider via adial-up modem TCP/IP connection (basic dial-up procedure and IPestablishment, email and news handling is covered).  ,  .Outlines the setup of a single RedHat box for dial-ins,virtual web hosting,virtual email, POP3 and ftp servers.  ,  .Addresses Linux localization issues specific to Italian users(written in Italian).  ,  .Provide Jabber admins a look into the present and future ofJabber Server Farming.  ,  .Explains how to set up your server to allow CGI programs written inJava and how to use Java to write CGI programs.  ,  .This HOWTO has been removed for review.  ,  .Describes\n......", "posttime": "2020-05-16 00:31:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "howtos,list,linux", "title": "HOWTOS的单一列表", "title_en": "Single List of HOWTOS", "transed": 1, "url": "http://www.tldp.org/HOWTO/HOWTO-INDEX/howtos.html", "via": "", "real_tags": ["howtos", "list", "linux"]}, {"category": "", "categoryclass": "", "imagename": "b63a8b20531653a7620de20d27ff8731.png", "infoid": 1002246, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "DynamoDB正在大受欢迎。它速度快、可扩展且完全托管。但这不是你父亲的数据库。DynamoDB中的数据建模与您习惯的关系数据模型不同。了解如何使用DynamoDB正确设计数据模型，以避免以后出现问题。DynamoDB图书现已上市！把它拿到这里来。想看一眼吗？请在下面输入您的电子邮件，以接收有关DynamoDB中一对多关系的免费预览章节、完整的演练示例以及指向截屏视频的链接。\nDynamoDB是市场上增长最快的数据库之一。它将一致的性能与灵活的计费模式相结合，作为完全托管的服务。需要速度吗？DynamoDB涵盖了您。DynamoDB用于拥有海量数据的大型应用程序，如Amazon.com的购物车或Lyft的乘车定位服务。它可以扩展到TB或更高，而不会降低性能。想要实现无服务器吗？DynamoDB是无服务器应用程序最流行的数据库。\n虽然关系数据库查询会随着数据的增长而减慢，但DynamoDB会继续运行。它旨在处理大型、复杂的工作负载，而不会崩溃。\n这本书包含五个演练示例，以复杂的数据模型和大量的访问模式为特色。从关系到唯一约束，DynamoDB都可以处理。\nNoSQL数据建模不同于关系数据建模。您必须专门为您的访问模式设计表。\n这本书教你设计表格的一种策略驱动的方法。您将学习处理以下内容的策略：\n作为AWS NoSQL黑带团队的负责人，我亲自设计了数百个NoSQL数据模型，多年来，我的团队定义了亚马逊服务团队和AWS全球客户使用的许多通用DynamoDB设计模式和最佳实践。Alex在记录这些模式并用他自己的洞察力和专业知识增强它们方面做得很好。如果你想了解如何正确建模nosql应用程序的数据，那绝对是一本必读的书。&#34；​。\n我研究DynamoDB建模已经有一段时间了，不知疲倦地钻研博客文章、文档和视频，希望能找到任何有用的信息。通常，我最终会两手空空，甚至更糟，面对相互冲突或不准确的信息。\n然后最后！Alex提供了所有必要模式和实践的概要，这些模式和实践将帮助您释放DynamoDB的力量。它写得很漂亮，所有级别的从业者都能读懂，最重要的是，它是基于多年的研究和第一手经验。如果你正在寻找DynamoDB建模的终极指南，你的搜索以Alex的书结束。\n“如果你在找一本关于世界上最好的数据库的书，你需要自己写一本关于53号公路的书。如果你正在寻找一本关于世界上第二好的数据库的书，我推荐亚历克斯·德布里的一本写得非常好、非常平易近人的“DynamoDB书”。“。\n如果您在AWS上构建无服务器应用程序，那么DynamoDB数据建模是一项必备技能。但是，关于如何做好这一点的现有信息是不完整和支离破碎的，而且第一次就很容易出错。\n无论您是刚接触DynamoDB并想真正掌握如何正确建模数据，还是想学习更高级的模式，Alex都会使用相关的真实用例用简单的语言描述新的概念。\n这本书我将推荐给我所有开始无服务器之旅的客户。\n“这是学习DynamoDB的最好资源之一！亚历克斯会一步一步地递给您要添加到工具箱中的工具，这样您就可以为您的用例选择合适的工具。&#34；\n你好，我是亚历克斯。我已经通过我的网站DynamoDBGuide.com帮助了成千上万的开发人员学习DynamoDB。\n我曾在多个AWS峰会上谈到DynamoDB，并在AWS Re：Invent2019上进行了观看次数第二多的会议。我是一名AWS英雄，曾帮助编写过一些AWS数据库服务的官方指南。\n在过去的5年里，我一直在与DynamoDB合作。我设计了糟糕的DynamoDB数据模型，所以您不必这样做。这就是我刚开始时希望有的那本书。从我的错误中学习，在DynamoDB中设计一个干净、高效的数据模型。\n这本450页的书(PDF&amp；EPUB格式)包含概念、提示、策略和五个演练示例。", "note_en": "DynamoDB is exploding in popularity. It&#39;s fast, scalable, and fully-managed. But it&#39;s not your father&#39;s database. Data modeling in DynamoDB is different than the relational data model you&#39;re used to.  Learn how to properly design your data model with DynamoDB to avoid problems later.  The DynamoDB Book is available now!   Get it here.  Want a sneak peek? Enter your email below to receive free preview chapters on one-to-many relationships in DynamoDB, a full walkthrough example, and links to screencasts.\n    DynamoDB is one of the fastest-growing databases on the market. It combines  consistent performance with a  flexible billing model as a  fully-managed  service.   Have a need for speed? DynamoDB has you covered. DynamoDB is used for high-scale applications with enormous data, like Amazon.com&#39;s shopping cart or Lyft&#39;s ride location service. It scales to terabytes and beyond with no performance degradation.   Want to go Serverless? DynamoDB is the most popular database for Serverless applications.\n    While your relational database queries slow down as your data grows, DynamoDB keeps on going. It is designed to handle large, complex workloads without melting down.\n  This book contains  five walkthrough examples featuring complex data models and a large number of access patterns. From relationships to unique constraints, DynamoDB can handle it all.\n    NoSQL data modeling is different than relational data modeling. You must design your table specifically for your access patterns.\n  This book teaches a  strategy-driven approach for designing your tables. You will learn strategies for handling:\n    &#34;As the leader of the NoSQL Blackbelt team at AWS I have personally designed hundreds of NoSQL data models, and over the years my team has defined many of the common design patterns and best practices for DynamoDB used by both Amazon service teams and AWS customers around the world. Alex has done a great job of documenting these patterns and enhancing them with his own insight and expertise. Definitely a must read if you want to understand how to correctly model data for NoSQL apps.&#34;​\n     &#34;I’ve been studying DynamoDB modeling for quite some time, tirelessly digging through blog posts, documentation, and videos, hoping to find any bits of useful information. Oftentimes, I would end up empty-handed, or even worse, confronted with conflicting or inaccurate information.\n    And then finally! Alex delivers a compendium of all the necessary patterns and practices that will help you unleash the power of DynamoDB. It’s beautifully written, accessible to all levels of practitioners, and most importantly, it’s based on years of research and firsthand experience. If you’re looking for the ultimate guide to DynamoDB modeling, your search ends with Alex’s book.&#34;\n  “If you’re looking for a book on the best database in the world, you’ll need to write one yourself about Route 53. If you’re looking for a book on the second best database in the world, I recommend the remarkably well written and incredibly approachable ‘The DynamoDB Book’ by Alex DeBrie.”\n  &#34;If you’re building serverless applications on AWS, then DynamoDB data modelling is a must-have skill. But existing information on how to do this well is incomplete and fragmented and it&#39;s so easy to get it wrong first time round.\n  Whether you’re new to DynamoDB and want to get a real grasp on how to properly model your data, or you want to learn more advanced patterns, Alex describes novel concepts in simple terms using relatable real-world use cases.\n This is the book I’ll be recommending to all my clients who are starting their serverless journey.&#34;\n  “One of the best resources out there to learn DynamoDB! Step-by-step, Alex hands you tools to add to your toolbox so you can pick the right one for your use case.&#34;\n      Hi there, I&#39;m Alex. I&#39;ve helped thousands of developers learn DynamoDB through my site,  DynamoDBGuide.com.\n  I&#39;ve spoken about DynamoDB at multiple AWS Summits and had the  second-most viewed session at AWS re:Invent 2019. I&#39;m an AWS Hero and have helped write some of the official guides for AWS database services.\n  I&#39;ve spent the last 5 years working with DynamoDB. I&#39;ve designed bad DynamoDB data models so you don&#39;t have to. This is the book I wish I had when I started. Learn from my mistakes to design a clean, efficient data model in DynamoDB.\n      The  450-page book (PDF &amp; EPUB format) with concepts, tips, strategies, and  five walkthrough examples.", "posttime": "2020-05-16 00:16:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "书籍,dynamodb", "title": "DynamoDB书籍：使用NoSQL和DynamoDB进行数据建模的综合指南", "title_en": "The DynamoDB Book: Comprehensive Guide to Data Modeling with NoSQL and DynamoDB", "transed": 1, "url": "https://www.dynamodbbook.com/", "via": "", "real_tags": ["书籍", "dynamodb"]}, {"category": "", "categoryclass": "", "imagename": "58b76a0088b28d7aa00951231100e943.jpeg", "infoid": 1002245, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“我不知道--也许是有偏见的--我不相信任何人知道明天的市场走势。”--沃伦·巴菲特(Warren Buffet)。\n当这位奥马哈先知说他不知道股市会发生什么时，人们应该听一听。\n截至撰写本文时，道琼斯指数略低于24,000点。早在2月份，该指数就创下了29,551点的历史新高。\n几天后，纳斯达克指数(NASDAQ)也有了类似的经历，如果不是更明显的话。2月19日，该指数创下9838点的历史新高。\n然后冠状病毒来了，狗屎变成了现实。市场看起来正在进入可能是历史上最大的熊市之一。事实上，全球股市在3月份总共暴跌了25%。\n但奇怪的是-我相信你已经知道了-他们一直在康复。见鬼，图表读起来好像会在一两个月内再创历史新高。\n关于历史上最大的潜在股市崩盘是如何逼近我们的，我已经写了大量的文章。\n这是我在1月12日写的。我仍然坚定地坚持我在那里写的东西。\n问题是，从那时起，我们就进入了一场全球大流行。然而，市场上的数字几乎是完全相同的？\n在过去的两个月里，3600万美国人提交了失业申请。占总人口的10%以上，截至4月份占劳动力的14.7%。\n历史上上一次我们的失业率接近这个水平是在二战前。\n让我们忽略围绕着小企业救助基金被挪用的事实，以及它是如何由于已知的漏洞没有堵住而被严重滥用的。\n让我们忽略这样一个事实，即债务与GDP的比率现在已经朝着错误的方向大幅加速，预计将提前10年达到历史上首次超过100%。\n请不要提及价值8500亿美元的全球航空业，该行业在未来6-18个月内基本上已经停飞。\n美联储和世界各地的类似机构都在疯狂印钞。然而，世界上有数十个国家处于完全封锁状态。\n当然，在大流行期间，他们在Netflix(增加了超过1500万订户)和亚马逊(第一季度销售额同比增长26%)上大肆挥霍。\n但是街角的比利叔叔的汽车店呢？再也没有人开车了，更不用说把车撞坏了。\n梅阿姨的美发沙龙已经关门两个月了。你应该在家里剪头发。\n“可怜”星巴克这个月只卖出了200杯法卡摩卡南瓜塔巴斯科拿铁咖啡。\n关键是，在这场大流行中，经济正在迅速萎缩。从1月到3月，美国经济大幅萎缩了4.8%。这是2008年金融危机的水平。\n但这是一个滞后的指标。美国的许多封锁是什么时候开始的？三月中下旬，对吧？\n我肯定我们只能猜测6月份之后第二季度的数字。如果这是80多年来最大的收缩，我不会感到惊讶。\n我无法预测股市的未来，没有人可以。但这周我终于鼓起勇气把钱放在嘴边。\n为什么？因为我坚信，我们现在正处于一个怪异版本的泡沫市场中，下一次崩盘将是绝对毁灭性的。\n我不敢相信这种市场定价是可持续的，甚至在某种意义上也是道德的。\n我关注的所有股市报告都在呼吁涨价。我几乎不敢相信我睁开眼睛时看到的东西。这些都是经过多年培训的金融专业人士，他们建议人们在预期股市将继续走高的情况下进行更多投资。\n但当我打开当天的新闻，看到一个南瓜色的男人尖叫着“一切都好”--我记得为什么会这样。\n我没有资格提供财务建议，也不是经常这样做。我主修的是财务会计，几年前曾广泛研究过这门学科，但现在它不再是我的专业了。\n看看其他选择，而不是咆哮的支撑在谎言上的股市，并考虑上述因素的影响。有债券，有现金，有密码，有房地产，只要你能说出名字，你就可以拥有它。\n打电话给你的顾问，陈述你的意见。如果你有，他们有责任对你坦诚相待。就本文中的主题向他们提问。他们会不舒服的。\n至于我，我卖掉了所有的股票，结果看到我持有的主要股份第二天根据第一季度的业绩大幅上涨。\n但我仍然感到安慰的是，我找到了真正按下“全部卖出”按钮的勇气。我就是看不出这个当前的市场怎么能在一个正在崩溃的世界里继续上涨。\n当它发生的时候-如果我是正确的-我将有我的现金储备来购买便宜得多的股票。\n如果说我在这么多年的交易和投资研究中学到了一件事：股市最终总是会下跌的。\n我们通常不应该为市场计时。但这不是我们生活的正常时代。\nJJ拥有两个商学学位，之前拥有CSC学位，在转行之前曾广泛学习过CPA和CFA项目。这篇文章是他的观点陈述，不应被解释为财务建议。", "note_en": "“I don’t know — and perhaps with a bias — I don’t believe anybody knows what the market is going to do tomorrow.” — Warren Buffet\n When the  Oracle of Omaha says he has no idea what’s going to happen with the stock market, people should listen.\n As of the time of this writing, the DOW Jones is just under 24,000. Back in February, it hit its  all-time record high of 29,551.\n A few days later, the NASDAQ has had a similar experience, if not more pronounced. It hit its  all-time record high of 9,838 on February 19.\n Then came the coronavirus, and shit got real. The markets looked to be entering into possibly one of the biggest bear markets in history. And indeed, global stock markets  collectively crashed 25% in March.\n But the weird thing — which I’m sure you already know — is they’ve been recovering. Hell, the charts read like they’ll be going back to the record highs within a month or two.\n  I already wrote extensively about how the biggest potential stock market crash in history has been looming over us.\n  I wrote that on  January 12th. And I still   firmly stand by what I wrote there.\n The thing is, we’ve entered into a global pandemic  since then. And yet the markets are almost at the exact same number?\n  36 million Americans have filed unemployment in the last 2 months. More than 10% of the entire total population, and  14.7% of the workforce as of April.\n The last time in history we had an unemployment rate anywhere near that was pre-WWII.\n  Let’s ignore the facts surrounding the misappropriation of the  small business rescue fund and how it was grossly abused due to known loop-holes that weren’t closed.\n Let’s ignore the fact that the debt-GDP ratio has now massively accelerated in the wrong direction, projected to hit  more than 100% for the first time in history 10 years ahead of schedule.\n And please, no one mention the $850 billion  global airline industry that has been essentially grounded for the next 6–18 months.\n  The Fed and similar agencies around the world are printing money like crazy. Yet dozens of countries around the world are in complete lockdown.\n  Sure, in the pandemic they’re splurging on Netflix (up more than 15 million subscribers) and Amazon (sales up 26% 1st quarter y-o-y).\n But what about Uncle Billy’s auto shop down on the corner? No one’s driving cars anymore, let alone breaking them.\n Aunt May’s hair salon has been closed for 2 months. You gotta cut your hair at home.\n ‘Poor’ Starbucks has only sold 200 fracca-mocha pumpkin tabasco latte’s this month.\n The point is, the economy is shrinking rapidly in this pandemic. January to March saw the  US economy  shrink a whopping 4.8%. That’s 2008 financial crisis levels.\n But that’s a lagging indicator. When did many of the lockdowns in the US start? Mid-to-late March right?\n I’m sure we can only guess at the numbers we’ll see for the 2nd quarter after June. I wouldn’t be surprised if it’s the biggest contraction in over 80 years.\n  I can’t predict the future of the stock market, no one can. But I finally got the nerves to put my money where my mouth is this week.\n  Why? Because I firmly believe that we are in a weird version of a bubble market right now and that the next crash is going to be absolutely devastating.\n I cannot believe that this market pricing is sustainable — nor even ethical in some sense.\n All the stock market reports I follow are still calling for higher prices. I can barely believe what I see when I open them. These are financial professionals with years of training that are advising people to invest even more in the   expectation that stocks are going to continue higher.\n But then I open up my news for the day and see a pumpkin-colored man screaming “ everything is fine” — and I remember why it’s happening.\n  I’m not qualified to give financial advice nor do I do so on a regular basis. I’ve majored in accounting in finance and studied the subject extensively years ago, but it is no longer my profession.\n   Look at options other than the roaring propped-up-on-lies stock markets and consider the implications of the above. There are bonds, there’s cash, there’s crypto, real estate, you name it, you can own it.\n Call your advisor and state your opinion. If you have one, it’s their responsibility to be honest with you. Ask them questions about the topics in this article.  They won’t be comfortable.\n  As for me, I sold all my stock only to see a major holding of mine go up a drastic amount the next day based on its first-quarter results.\n   But I still take solace in finding the courage to actually hit the sell-all button. I just can’t see how this current market can continue rising in a world that is crumbling around it.\n And when it does — if I’m right — I’ll have my stockpile of cash to buy those stocks much cheaper.\n And if there’s one thing I’ve learned in all the years of trading and investment research: Stocks always go down, eventually.\n We normally shouldn’t time the markets. But this isn’t normal times we’re living in.\n  JJ has two degrees in business, previously held a CSC and has studied the CPA and CFA programs extensively in the past before switching careers. This article is a statement of his opinion and shouldn’t be construed as financial advice.", "posttime": "2020-05-16 00:15:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "星期,sold,股市", "title": "这个星期我完全抛售了我所有的投资。", "title_en": "I Completely Sold Off All My Investments This Week", "transed": 1, "url": "https://medium.com/@jjpryor/why-i-completely-sold-off-all-my-investments-this-week-d486049a318c", "via": "", "real_tags": ["星期", "sold", "股市"]}, {"category": "", "categoryclass": "", "imagename": "95e99b453d2936c0af879a64bde34b27.png", "infoid": 1002244, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Crytic是我们的Github应用程序，用于发现智能合同缺陷，在某种程度上是一件大事：它可以在没有人工干预的情况下检测安全问题，在你工作的同时提供持续的保证，并在部署之前保护你的代码库。\nCrytic发现了许多其他工具无法检测到的错误，包括一些不广为人知的错误。目前，Crytic有90多个探测器，我们正在不断增加新的检查并改进现有的检查。它在每次提交时运行这些错误和优化检测器，并评估您自己添加的自定义安全属性！\n今天，我们将分享仅由Crytic发现的主要项目中的12个问题，其中包括一些高度严重的问题。\nCrtic在安永的“夜幕降临”项目中发现了三个漏洞，其中一个严重漏洞可让任何人制造免费代币。\nFTokenShield.mint不检查transfer From的返回值。如果FTokenShield与令牌一起使用，该令牌在错误传输的情况下不会恢复，并且只返回FALSE(例如，BAT)，则任何人都可以创建免费承诺-而攻击者可以免费创建令牌。\nFTokenShield.registerVerificationKey和NFTokenShield.registerVerificationKey返回空字节32。不清楚正确的返回值应该是什么。这可能会导致第三方和合同出现意想不到的行为。\n可以在MerkleTree.sol中声明treeHeight和0为常量，以允许编译器优化此代码。\nCrytic在DeFiStrategy中发现了一个不寻常的问题：修饰符中缺少占位符执行，导致调用者函数返回默认值。此外，Crytic发现了一个与返回BalanceOf调用时严格相等相关的问题。\n在无效访问的情况下，SuperSaverZap.onlyInSurface()和SuperSaverZap.stopInSurface()修饰符不会恢复。如果修饰符没有执行或还原，则函数的执行将返回默认值，这可能会误导调用者。\nERC20toUniPoolZapV1_General.addLiquity在_UniSwapExchangeContractAddress余额上严格相等。此行为可能允许攻击者通过向_UniSwapExchangeContractAddress发送令牌来陷阱协定。\nCrytic发现了另一个在DOSNetwork中并不广为人知的问题：如果使用多个动态参数调用abi.encodedPacked，则可以使用不同的参数返回相同的值。\n此模式容易发生冲突，使用不同的数据源和选择器的两个调用可能会导致相同的queryId(有关详细信息，请参阅Solidity文档)。\n不要在encodePacked中使用多个动态类型，并考虑首先使用keccak256散列数据源和选择器。\n在基线协议中，Crtic发现了一个架构问题，其中包括：实现接口的契约不继承它。\nShield是ERC1820ImplementerInterface的实现，但它不从接口继承。此行为容易出错，可能会阻止实现或接口正确更新。\nCrytic在ethKids中发现了另一个不寻常的问题：*this.Balance包括当前事务的金额(msg.value)，这可能会导致不正确的值计算。\n在fundWithAward中使用this.Balance不会考虑msg.value已经添加的值。因此，价格计算是不正确的。\nmsg.value已经存在于此.Balance中。例如，如果this.Balance在交易前是10以太，而msg.value是1eth，那么在交易期间this.Balance将是11以太)。结果，msg.value被使用了两次，culatePurche eReturn计算错误。\n更改价格计算，以便_Reserve veBalance不包括事务中发送的金额。\n最后，Crtic在HQ20中发现了一个众所周知的问题：可重入性。这种可重入性很有趣，因为如果协定与具有回调功能的令牌(如ERC777)一起使用，就会发生这种情况。这类似于最近的uniswap和lendf.me黑客攻击。\n在不遵循检查效果交互模式的情况下，Classfied调用从外部令牌转移。如果目标令牌具有回调机制(例如，ERC777令牌)，则这会导致可被攻击者利用的重入性。\nCrytic可以将代码库从关键缺陷中拯救出来，并帮助您设计更安全的代码。有什么不喜欢的？\n今天就报名参加Crtic吧。有问题吗？加入我们的松弛频道(#Crytic)或在Twitter上关注@CryticCi。", "note_en": "Crytic, our Github app for discovering smart contract flaws, is kind of a big deal: It detects security issues without human intervention, providing continuous assurance while you work and securing your codebase before deployment.\n Crytic finds many bugs no other tools can detect, including some that are not widely known. Right now, Crytic has 90+ detectors, and we’re continuously adding new checks and improving existing ones. It runs these bug and optimization detectors on every commit, and evaluates custom security properties that you add yourself too!\n Today, we’re sharing twelve issues in major projects that were found solely by Crytic, including some of high severity.\n    Crytic found three bugs in  E&amp;Y’s Nightfall project, including one critical vulnerability that could allow anyone to mint free tokens.\n   FTokenShield.mint does not check the return value of  transferFrom. If  FTokenShield is used with a token that does not revert in case of incorrect transfers, and only returns false (e.g.,  BAT), anyone can mint free commitments—and an attacker can mint tokens for free.\n        FTokenShield.registerVerificationKey and   NFTokenShield.registerVerificationKey return an empty  bytes32. It is unclear what the correct returned value should be. This might lead to unexpected behavior for third parties and contracts.\n       treeHeight and   zero can be declared constant in  MerkleTree.sol to allow the compiler to optimize this code.\n      Crytic found one unusual issue in  DeFiStrategies: The lack of placeholder execution in a modifier leads the caller function to return the default value. Additionally, Crytic found an issue related to strict equality on the return of a  balanceOf call.\n   The   SuperSaverZap.onlyInEmergency() and   SuperSaverZap.stopInEmergency() modifiers do not revert in case of invalid access. If a modifier does not execute or revert, the execution of the function will return the default value, which can be misleading for the caller.\n       ERC20toUniPoolZapV1_General.addLiquidity  has strict equality on the  _UniSwapExchangeContractAddress balance. This behavior might allow an attacker to trap the contract by sending tokens to  _UniSwapExchangeContractAddress .\n      Crytic found another issue that is not well known in  DOSNetwork: If  abi.encodedPacked is called with multiple dynamic arguments, it can return the same value with different arguments.\n    This schema is vulnerable to a collision, where two calls with a different  dataSource and selector can result in the same  queryId (see the  Solidity documentation for more information).\n  Do not use more than one dynamic type in  encodePacked, and consider hashing both  dataSource and  selector with  keccak256 first.\n    Crytic found an architectural issue in the  Baseline Protocol, among others: A contract implementing an interface did not inherit from it.\n   Shield is an implementation of   ERC1820ImplementerInterface, but it does not inherit from the interface. This behavior is error-prone and might prevent the implementation or the interface from updating correctly.\n      Crytic found another unusual issue in  EthKids:   this.balance includes the amount of the current transaction ( msg.value), which might lead to incorrect value computation.\n   The use of  this.balance in   fundWithAward does not account for the value already added by  msg.value. As a result, the price computation is incorrect.\n       msg.value is already present in this.balance. For example, if this.balance is 10 ether before the transaction, and msg.value is 1 eth, this.balance will be 11 ether during the transaction). As a result, msg.value is used two times, and calculatePurchaseReturn is incorrectly computed.\n  Change the price computation so that _reserveBalance does not include the amount sent in the transaction.\n    Finally, Crytic found a well-known issue in  HQ20: reentrancy. This reentrancy is interesting as it occurs if the contract is used with a token with callback capabilities (such as ERC777). This is similar to the recent  uniswap and lendf.me hacks.\n   Classifieds calls  transferFrom on external tokens without following the check-effects-interaction pattern. This leads to reentrancy that can be exploited by an attacker if the destination token has a callback mechanism (e.g., an ERC777 token).\n        Crytic can save your codebase from critical flaws and help you design safer code. What’s not to like?\n Sign up for  Crytic today. Got questions? Join  our Slack channel (#crytic) or follow  @CryticCi on Twitter.", "posttime": "2020-05-15 23:59:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "漏洞,crytic,hunting,问题", "title": "使用Crytic的智能合同中的漏洞搜索", "title_en": "Bug Hunting in Smart Contracts with Crytic", "transed": 1, "url": "https://blog.trailofbits.com/2020/05/15/bug-hunting-with-crytic/", "via": "", "real_tags": ["漏洞", "crytic", "hunting", "问题"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002243, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我最近遇到了一个人，他说过去面向对象编程(OOP)的方法是回到简单地告诉计算机去做什么，把OOP从你的脑海中清除出来，就像什么都没有发生过一样。我不认为这是个好主意，但我也不认为这是可能的。\n面向对象编程，尽管后来过度了，但它在软件工程中是向前迈出的一大步。它使开发比以前大得多的程序成为可能，可能是以前的10倍。有人可能会反驳说，由于OOP的所有开销，程序必须大10倍，但事实并非如此。OOP确实增加了一些开销，并且随着工具和框架变得更加复杂，开销会随着时间的推移而增加，但是OOP使编写以前无法编写的程序成为可能。\nOOP为程序员提供了一种组织代码的方法。根据问题的不同，这可能不是最好的方法，但是超越OOP的方法是用另一个规程取代它。我想大多数已经学会然后又没有学会的OOP的人都会这么做，不管他们是否意识到这一点。也许他们保留了在OOP上下文中学习的一些组织模式。\n这是我的经验。我几乎不再编写类了；我编写函数。但我编写函数的方式与我花数年编写类之前不太一样。\n虽然我不经常编写类，但我确实经常使用来自库的类。有时，这些对象看起来更适合作为纯函数，但我想如果没有函数包装在对象中，同样的库将更难使用。\n我通常喜欢函数式编程，但根据我的经验，当您试图将纯度提高到100%时，会出现曲棍球杆力曲线。詹姆斯·黑格说得很好：\n100%纯函数式编程不起作用。即使是98%的纯函数式编程也不起作用。但是，如果功能纯洁性和20世纪80年代基本风格的命令性混乱之间的滑块被踢低几个档次-比方说降到85%-那么它真的是有效的。您可以获得函数式编程的所有优势，但不会有随着您越来越接近完全纯净而增加的极端心力和不可维护性。\n用纯函数代码开发系统的大部分是可能的，也是一个好主意。但总得有人写一些与外界互动的杂乱无章的部分。", "note_en": "I ran across someone recently who says the way to move past object oriented programming (OOP) is to go back to simply telling the computer what to do, to clear OOP from your mind like it never happened. I don’t think that’s a good idea, but I also don’t think it’s possible.\n Object oriented programming, for all its later excesses, was a big step forward in software engineering. It made it possible to develop much larger programs than before, maybe 10x larger. Someone might counter by saying that programs  had to be 10x larger because of all the overhead of OOP, but that’s not the case. OOP does add some overhead, and the amount of overhead grew over time as tools and frameworks became more complicated, but OOP made it possible to write programs that could not have been written before.\n OOP provides a way for programmers to organize their code. It may not be the best way, depending on the problem, but the way to move past OOP is to replace it with another discipline. And I imagine most people who have learned and then unlearned OOP do just that, whether they realize it or not. Maybe they retain some organizational patterns that they learned in the context of OOP.\n That has been my experience. I hardly ever write classes anymore; I write functions. But I don’t write functions quite the way I did before I spent years writing classes.\n And while I don’t often  write classes, I do often  use classes that come from libraries. Sometimes these objects seem like they’d be better off as bare functions, but I imagine the same libraries would be harder to use if no functions were wrapped in objects.\n I generally like functional programming, but in my experience there’s a hockey stick effort curve as you try to push the purity to 100%.  James Hague said it well:\n 100% pure functional programing doesn’t work. Even 98% pure functional programming doesn’t work. But if the slider between functional purity and 1980s BASIC-style imperative messiness is kicked down a few notches — say to 85% — then it really does work. You get all the advantages of functional programming, but without the extreme mental effort and unmaintainability that increases as you get closer and closer to perfectly pure.\n It’s possible, and a good idea, to develop large parts of a system in purely functional code. But someone has to write the messy parts that  interact with the outside world.", "posttime": "2020-05-15 23:59:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,假装,oop", "title": "假装OOP从未发生过", "title_en": "Pretending OOP Never Happened", "transed": 1, "url": "https://www.johndcook.com/blog/2020/05/15/pretending-oop-never-happened/", "via": "", "real_tags": ["app", "假装", "oop"]}, {"category": "", "categoryclass": "", "imagename": "9046cf5b80a16831f2d0c0d61837901e.jpg", "infoid": 1002242, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "包括Refinery29在内的Refinery29将裁员155人，占其全球员工总数的5%以上，以应对大流行导致的收入下降。\n副媒体集团首席执行官在周五获得的一份内部备忘录中写道，大约三分之二的裁员(约100人)将是国际裁员，其中55人影响到美国员工。国际裁员将在未来几周内进行，而这家总部位于布鲁克林的公司的美国员工将于周五被解雇。\n在这份题为“未来的道路”的备忘录中，杜布克写道，“虽然即使失去一份工作也感觉太多了，但这些决定最终取决于我，我向你保证，我们尽了很大努力来保住就业机会。”\n副数码的团队将受到裁员的不成比例的影响。杜布克在备忘录中称，目前，该公司的数字组织占员工成本的50%，“但仅带来约21%的营收.”“从整体上看我们的业务，为了我们公司的长期健康，这种不平衡需要得到解决。”\n一位前副媒体员工告诉Varity，公司在过去的几周里已经在裁员了。\n根据Dubuc的说法，通过取消整个公司的空缺职位，InnoMedia能够保留数字组织中约90%的工作岗位。此外，该公司正在将“尽可能多的人”转移到不断增长的副新闻部门。\n杜布克写道，在数字广告领域经历了多年的经济逆风之后，情况变得更加糟糕：“挤压正在成为一种扼杀。平台不仅分到了更大的一块蛋糕，而且几乎分到了整个蛋糕。\n在一份声明中，代表编辑和其他员工的副工会声称，一个多月来，公司管理层“一再拒绝讨论工作分担计划，就像”洛杉矶时报“用来避免裁员的计划一样。”\n“我们理解整个新闻业正在受到伤害，”副工会的声明说。“我们不明白为什么在全球大流行期间，West选择解雇我们的许多同事，而不是用尽所有的选择来保住这些工作岗位.”\n裁员是在副媒体于3月底实施勒紧裤腰带的行动之后进行的，延长了90天。这些措施目前有效期至6月30日，包括对年收入在10万美元或以上的员工进行滑动减薪；暂停晋升；以及停止与公司匹配的401(K)缴费。\nDubuc在备忘录中说，被解雇的副媒体员工将获得遣散费；此外，“每个人都可以保留他们的工作发放的笔记本电脑”，以及接受重新安置服务。在美国，下岗员工将获得延长的医疗福利覆盖范围，直至2020年底。", "note_en": ", which includes Refinery29, is laying off 155 employees, or more than 5% of its total worldwide headcount, in response to revenue declines stemming from the   pandemic.\n About two-thirds of the staff cuts (around 100) will be international, with 55 layoffs affecting U.S. employees, Vice Media Group CEO   wrote in an internal memo Friday obtained by  Variety. The international layoffs will happen over the next few weeks, while the Brooklyn-based company’s U.S. staffers will be let go Friday.\n In the memo, titled “The Course Ahead,” Dubuc wrote, “While losing even one job feels like too many, these decisions ultimately rest with me and I assure you that we went to great lengths to preserve jobs.”\n Vice Digital’s teams will be disproportionately affected by the layoffs. Currently, the company’s digital organization accounts for 50% of headcount costs, “but only brings in about 21% of our revenue,” Dubuc said in the memo. “Looking at our business holistically, this imbalance needed to be addressed for the long-term health of our company.”\n  A former Vice Media employee told  Variety that the company already has been making layoffs over the last several weeks.\n According to Dubuc, Vice Media was able to retain about 90% of the jobs in the digital organization by eliminating open roles across the company. In addition, the company is moving “as many individuals as possible” over to the growing Vice News division.\n After many years of economic headwinds in digital advertising, Dubuc wrote, the situation has become even worse: “[T]he squeeze is becoming a choke hold. Platforms are not just taking a larger slice of the pie, but almost the whole pie.”\n In  statement, Vice Union, which represents editorial and other employees, claimed that for more than a month company management “repeatedly refused to discuss workshare programs, like the one the Los Angeles Times used to avoid layoffs.”\n “We understand that the entire news industry is hurting,” Vice Union’s statement said. “We do not understand why Vice chose to lay off many of our colleagues in the middle of a global pandemic instead of exhausting all options to save these jobs.”\n The layoffs come after Vice Media implemented belt-tightening moves at the end of March, extending for a 90-day period. Those steps, which are currently effective through June 30, include a sliding scale of pay cuts for employees earning $100,000 or more; a temporary suspension on promotions; and a halt on company-matched 401(k) contributions.\n Vice Media staff who are being pink-slipped will receive severance pay; in addition, “everyone will be able to keep their work-issued laptops” as well as receive outplacement services, Dubuc said in the memo. In the U.S., laid-off employees will receive extended health benefits coverage through the end of 2020.", "posttime": "2020-05-15 23:58:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "裁员,media", "title": "副媒体裁员155人，数字集团裁员幅度最大", "title_en": "Vice Media Lays Off 155 Employees with Deepest Cuts in Digital Group", "transed": 1, "url": "https://variety.com/2020/digital/news/vice-media-layoffs-155-employees-covid19-1234607610/", "via": "", "real_tags": ["裁员", "media"]}, {"category": "", "categoryclass": "", "imagename": "226350875609fd1a8cc572e78b7e781a.png", "infoid": 1002241, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在2月份一次大学黑客马拉松成功地使用了整整四款苹果手表的推动下，Mozilla决定在春季尝试一个更有条理的项目。第一批测试公司正在进行中，4月份启动了一个为期8周的计划，每个团队成员提供2500美元，并在结束时赠送4万美元的奖金。不同领域的开发人员都被邀请申请，只要他们符合赋权、隐私、去中心化、社区等主题。\n它吸引了约1500人对520个项目的兴趣，其中25人被选为在开发MVP期间获得全套服务和津贴。其余的人被邀请到一个“开放实验室”，可以访问Mozilla的一些资源。\n他们正在寻找的一个例子是Ameelio，这是一家初创公司，其成员希望在监狱里提供免费系统的付费视频通话，并为囚犯提供免费信件递送。\nMozilla资深人士(想想Firefox 1.0)、Builders Studio负责人之一巴特·德克莱姆(Bart Decrem)表示：“这个孵化器的使命是催化新一代互联网产品和服务，在这些产品和服务中，人们可以控制如何使用互联网来塑造社会。”“商业模式应该是可持续和有价值的，但不需要从用户那里榨取每一分钱(或每盎司)的注意力。”\n“我们认为，我们正在挖掘学生和专业‘建设者社区’的能量，希望致力于有意义的想法。这一号角真的引起了共鸣，“他说。不仅如此，被取消实习机会的学生似乎也成群结队地出现了-主要是计算机科学，但设计和其他学科也是如此。申请者没有任何限制，比如原籍国，以前的资金，或任何类似的东西。\n首先是“创业工作室”(Startup Studio)，它涉及75,000美元的投资，“当外管局转换(否则我们将参与一轮已经在进行的融资)时，为公司3.5%的股份提供后期资金保障，”德克莱姆澄清道。\n下面是“最有价值球员实验室”(MVP Lab)，与春季项目类似，但每支球队总共提供16,000美元，就金钱承诺而言，这一项目的下方是“最有价值球员实验室”(MVP Lab)。下面是开放实验室，但有10个10000美元的奖金，而不是前3名。\n关于有多少支球队将组成这两个补贴级别，没有确切的数字，但考虑总共20-30支，而不是50支或100支。同时，鼓励协作、交叉授粉和开源代码，正如您在Mozilla项目中所期望的那样。而且社会公益方面也很强，正如春季一批公司的抽样调查所显示的那样。\nNeil是一个浏览器插件，它可以显示你在亚马逊购买的碳足迹，给我们忘记的交易增加了一些至关重要的负罪感，这些交易是由脚痛的人类和耗油的长途货物运输提供动力的。Meething、Cabal和OASIS正在从分散的角度开展视频会议、团队聊天和社交馈送，使用现代互联网体系结构的奇迹来实现曾经需要集中式服务器的分布式系统。\n德克莱姆说，今年夏天，该计划将正式启动，但这只是“多年努力的开始”。", "note_en": "Spurred on by the success of a college hackathon using a whole four Apple Watches in February,  Mozilla   decided to try a more structured program in the spring. The first test batch of companies is underway,  having started in April an 8-week program offering $2,500 per team member and $40,000 in prizes to give away at the end. Developers in a variety of domains were invited to apply, as long as they fit the themes of empowerment, privacy, decentralization, community and so on.\n It drew the interest of some 1,500 people in 520 projects, and 25 were chosen to receive the full package and stipend during the development of their MVP. The rest were invited to an “Open Lab” with access to some of Mozilla’s resources.\n   One example of what they were looking for is  Ameelio, a startup whose members are hoping to render paid video calls in prisons obsolete with a free system, and provide free letter delivery to inmates as well.\n  “The mission of this incubator is to catalyze a new generation of internet products and services where the people are in control of how the internet is used to shape society,” said  Bart Decrem,   a Mozilla veteran (think Firefox 1.0) and one of the principals at the Builders Studio. “And where business models should be sustainable and valuable, but do not need to squeeze every last dollar (or ounce of attention) from the user.”\n “We think we are tapping into the energy in the student and professional ‘builder communities’ around wanting to work on ideas that matter. That clarion call really resonates,” he said. Not only that, but students with canceled internships are showing up in droves, it seems — mostly computer science, but design and other disciplines as well. There are no restrictions on applicants, like country of origin, previous funding, or anything like that.\n  First is the “Startup Studio,” which involves a $75,000 investment, “a post-money SAFE for 3.5% of the company when the SAFE converts (or we will participate in an already active funding round),” Decrem clarified.\n Below that, as far as pecuniary commitment goes, is the “MVP Lab,” similar to the spring program but offering a total of $16,000 per team. And below that is the Open Lab again, but with 10 $10,000 prizes rather than a top 3.\n There are no hard numbers on how many teams will make up the two subsidized tiers, but think 20-30 total as opposed to 50 or 100. Meanwhile, collaboration, cross-pollination and open-source code is encouraged, as you might expect in a Mozilla project. And the social good aspect is strong as well, as a sampling of the companies in the spring batch shows.\n  Neutral is a browser plugin that shows the carbon footprint of your  Amazon   purchases, adding some crucial guilt to transactions we forget are powered by footsore humans and gas-guzzling long-distance goods transport. Meething, Cabal and Oasis are taking on video conferencing, team chat and social feeds from a decentralized standpoint, using the miracles of modern internet architecture to accomplish with distributed systems what once took centralized servers.\n This summer will see the program inaugurated, but it’s only “the beginning of a multiyear effort,” Decrem said.", "posttime": "2020-05-15 23:39:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "创业,修复,full,提供", "title": "Mozilla通过“修复互联网”创业实验室和早期投资进入全面孵化器", "title_en": " Mozilla Goes Full Incubator With 'Fix The Internet' Startup Lab and Early-Stage Investments", "transed": 1, "url": "https://techcrunch.com/2020/05/14/mozilla-goes-full-incubator-with-fix-the-internet-startup-lab-and-early-stage-investments/", "via": "", "real_tags": ["创业", "修复", "full", "提供"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002240, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为什么您需要将您的服务器放置在地理上靠近您的用户的位置？其中一个原因是为了实现更低的延迟。当您发送应该尽快传送的短突发数据时，这很有意义。但是如果是大文件，比如视频呢？当然，接收第一个字节会有延迟损失，但之后不应该一帆风顺吗？\n与HTTP一样，通过TCP发送数据时的一个常见误解是带宽与延迟无关。但是，对于TCP，带宽是延迟和时间的函数。让我们看看怎么做。\n在客户端可以开始向服务器发送数据之前，它需要对TCP和TLS分别执行一次握手和另一次握手。\n发送方挑选随机生成的序列号“x”，并将SYN分组发送给接收方。\n接收器递增“x”，选择随机生成的序列号“y”，并发回SYN/ACK分组。\n发送方递增序列号，并使用ACK数据包和应用程序数据的第一个字节进行回复。\nTCP使用序列号来确保数据按顺序无漏洞地传输。\n握手引入了完全往返，这取决于底层网络的延迟。TLS握手还需要最多两次往返。在TLS连接打开之前，不能发送任何应用程序数据，这意味着在此之前，您的带宽实际上为零。往返时间越短，建立连接的速度就越快。\n流量控制是一种退避机制，用于防止发送方压倒接收方。\n接收器将等待应用程序处理的传入TCP分组存储到接收缓冲器中。\n每当接收方确认数据包时，它还会将缓冲区的大小传回发送方。如果发送方遵守协议，则会避免发送更多可以放入接收方缓冲区的数据。\n此机制与应用程序级别的速率限制没有太大不同。但是，TCP不是对API密钥或IP地址进行速率限制，而是对连接级别进行速率限制。\n发送方和接收方之间的往返时间(RTT)越短，发送方调整其输出带宽以适应接收方容量的速度就越快。\nTCP不仅防止使接收方不堪重负，而且还防止淹没底层网络。\n发送方如何知道底层网络的可用带宽是多少？估计它的唯一方法是通过测量进行实证。\n这个想法是发送者维护一个所谓的“拥塞窗口”。该窗口表示无需等待对方确认即可发送的未完成数据包的总数。接收器窗口的大小限制拥塞窗口的最大大小。拥塞窗口越小，在任何给定时间可以传输的字节就越少，并且使用的带宽就越少。\n当建立新连接时，拥塞窗口的大小被设置为系统默认值。然后，对于每个确认的数据包，窗口以指数方式增加其大小。这意味着我们不能在连接建立后立即使用网络的全部容量。同样，往返时间越短，发送方开始利用底层网络带宽的速度就越快。\n如果数据包丢失，会发生什么情况？当发送器通过超时检测到丢失的确认时，称为“拥塞避免”的机制开始起作用，并且拥塞窗口大小被减小。从那时起，时间会使窗口大小增加一定的量，而超时则会使窗口的大小减少另一个量。\n如前所述，拥塞窗口的大小定义了无需等待确认即可发送的最大位数。发件人需要等待完整的往返行程才能得到确认。因此，通过将拥塞窗口大小除以往返时间，我们得到最大理论带宽：\nB a n d w i d t h=W i n S i z e R T带宽=\\frac{WinSize}{rtt}B a n d w i d t h=R T T W I n S I z e​这个简单的公式表明带宽是延迟的函数。TCP将非常努力地优化窗口大小，因为它对往返时间无能为力。但是，这并不总是产生最佳配置。\n总之，拥塞控制是一种用于推断网络底层带宽和拥塞的自适应机制。类似的模式也可以应用于应用程序级别。想想当你在Netflix上看电影时会发生什么。它开始模糊；然后，它稳定在合理的水平，直到出现打嗝，质量再次恶化。应用于视频流的这种机制称为自适应比特率流。\n如果您使用的是HTTP，那么您将受到底层协议的支配。如果你不知道香肠是怎么做的，你就不会得到最好的表现。\n突发请求会受到冷启动处罚。可能需要多次往返才能通过TCP和TLS握手发送第一个字节。由于拥塞控制的工作方式，往返时间越短，底层网络的带宽利用率就越高。\n整本书都是关于这个主题的，你可以做很多事情来挤压每一盎司的带宽。但是，如果您必须记住关于TCP的一件事，那么就让它这样吧：\n您不能以比光速更快的速度发送数据，但您可以做的是将服务器放在离客户端更近的地方，并重复使用连接以避免冷启动带来的损失。\n如果您想了解有关网络如何影响分布式系统的更多信息，请查看我即将到来的视频课程。", "note_en": "Why do you need to place your servers geographically close to your users? One of the reasons is to achieve lower latencies. That makes a lot of sense when you are sending short bursts of data that should be delivered as quickly as possible. But what about large files, such as videos? Surely there is a latency penalty for receiving the first byte, but shouldn’t it be smooth sailing after that?\n A common misconception when sending data over TCP, like with HTTP, is that bandwidth is independent of latency. But, with TCP, bandwidth is a function of latency and time. Let’s see how.\n  Before a client can start sending data to a server, it needs to perform a handshake for TCP and another one for TLS.\n  The sender picks a randomly generated sequence number “x” and sends a SYN packet to the receiver.\n The receiver increments “x,” chooses a randomly generated sequence number “y” and sends back a SYN/ACK packet.\n The sender increments both sequence numbers and replies with an ACK packet and the first bytes of application data.\n The sequence numbers are used by TCP to ensure the data is delivered in order and without holes.\n  The handshake introduces a full round-trip, which depends on the latency of the underlying network. The  TLS handshake also requires up to two round trips. Until the TLS connection is open, no application data can be sent, which means your bandwidth is for all intent and purposes zero until then. The lower the round trip time is, the faster the connection can be established.\n  Flow control is a backoff mechanism implemented to prevent the sender from overwhelming the receiver.\n The receiver stores incoming TCP packets waiting to be processed by the application into a receive buffer.\n  The receiver also communicates back to the sender the size of the buffer whenever it acknowledges a packet. The sender, if it’s respecting the protocol, avoids sending more data that can fit in the receiver’s buffer.\n  This mechanism is not too dissimilar to  rate-limiting at the application level. But, rather than rate limiting on an API key or IP address, TCP is rate-limiting on a connection level.\n The lower the round-trip time (RTT) between the sender and the receiver is, the faster the sender adapts its outgoing bandwidth to the receiver’s capacity.\n  TCP not only guards against overwhelming the receiver but also against flooding the underlying network.\n How can the sender find out what the available bandwidth of the underlying network is? The only way to estimate it is empirically through measurements.\n The idea is that the sender maintains a so-called “congestion window.” The window represents the total number of outstanding packets that can be sent without waiting for an acknowledgment from the other side. The size of the receiver window limits the maximum size of the congestion window. The smaller the congestion window is, the fewer bytes can be in flight at any given time, and the less bandwidth is utilized.\n When a new connection is established, the size of the congestion window is set to a system default. Then, for every packet acknowledged, the window increases its size exponentially. This means that we can’t use the full capacity of the network right after a connection is established. Once again, the lower the round trip time is, the quicker the sender can start utilizing the underlying network’s bandwidth.\n  What happens if a packet lost? When the sender detects a missed acknowledgment through a timeout, a mechanism called “congestion avoidance” kicks in, and the congestion window size is reduced. From there onwards,  time increases the window size by a certain amount, and timeouts decrease it by another.\n As mentioned, the size of the congestion window defines the maximum number of bits that can be sent without waiting for an acknowledgment. The sender needs to wait for a full round trip to get an acknowledgment. So, by dividing the size of the congestion window by the round trip time, we get the maximum theoretical bandwidth:\n       B a n d w i d t h =   W i n S i z e  R T T Bandwidth = \\frac{WinSize}{RTT}    B a n d w i d t h  =             R T T       W i n S i z e ​     This simple  equation shows that bandwidth is a function of latency. TCP will try very hard to optimize the window size since it can’t do anything about the round trip time. But, that doesn’t always yield the optimal configuration.\n To summarize, congestion control is an adaptive mechanism used to infer the underlying bandwidth and congestion of the network. A similar pattern can be applied at the application level as well. Think of what happens when you watch a movie on Netflix. It starts blurry; then, it stabilizes to something reasonable until there is a hiccup, and the quality worsens again. This mechanism applied to video streaming is called  adaptive bitrate streaming.\n  If you are using HTTP, then you are at the mercy of the underlying protocols. You can’t get the best performance if you don’t know how the sausage is made.\n Bursty requests suffer from the cold start penalty. Multiple round trips can be required to send the first byte with TCP and TLS handshakes. And due to the way congestion control works, the lower the round trip time is, the better the underlying network’s bandwidth is utilized.\n Entire  books have been written on the subject, and there is a lot you can do to squeeze every ounce of bandwidth. But if you have to remember one thing about TCP then let it be this:\n You can’t send data faster than the speed of light, but what you can do is put your servers closer to the clients and re-use connections to avoid the cold start penalty.\n If you want to learn more about how the network affects distributed systems check out my  upcoming video class.", "posttime": "2020-05-15 23:38:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,应该,developers,带宽", "title": "开发人员应该了解哪些关于TCP的知识", "title_en": "What developers should know about TCP", "transed": 1, "url": "https://robertovitillo.com/what-every-developer-should-know-about-tcp/", "via": "", "real_tags": ["开发", "应该", "带宽"]}, {"category": "", "categoryclass": "", "imagename": "cd2446b0314b331cdd33a4d5711d7ef2.png", "infoid": 1002239, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在本例中，我们将使用https://fmpcloud.io/(股票和金融应用编程接口)和Google Sheet(https://www.google.com/sheets/about/).。\n我们将展示将他们的API集成到Google Sheet中以访问和跟踪苹果公司是多么容易。价格和财务报表。\n例如，在A1型中=IFERROR(IMPORTJSON(“https://fmpcloud.io/api/v3/quote/AAPL/?apikey=demo&#34；，“/”，“noHeaders”)，IMPORTJSON(“http://fmpcloud.io/api/v3/quote/AAPL/?apikey=demo&#34；，“/”，“noHeaders”))“)。\nh.或者您可以键入A1：=IFERROR(IMPORTJSON(“https://fmpcloud.io/api/v3/income-statement/AAPL/?apikey=demo&#34；，“/”，“noHeaders”)，IMPORTJSON(“http://fmpcloud.io/api/v3/income-statement/AAPL/?apikey=demo&#34；，“/”，“noHeaders”))“)。\n您现在可以用您的API密钥替换API密钥演示，并在其文档上查询其他股票和任何端点。\n欢迎来到一个语言很重要的地方。在媒体上，聪明的声音和原创的想法占据了中心舞台-看不到广告。观看。\n关注所有你关心的话题，我们将为你提供最好的故事到你的主页和收件箱。探索。\n不受限制地访问媒体上最好的故事，并在您工作的同时为作家提供支持。只有5美元/月。升级换代", "note_en": "For this example we will be using  https://fmpcloud.io/ ( stocks and financial API) and google sheet ( https://www.google.com/sheets/about/).\n We will demonstrate how easy it is to integrate their API into Google Sheets for accessing and keeping track of Apple Inc. price and financial statements.\n               g. In A1 type  =IFERROR(IMPORTJSON(“https://fmpcloud.io/api/v3/quote/AAPL/?apikey=demo&#34;, “/”, “noHeaders”), IMPORTJSON(“http://fmpcloud.io/api/v3/quote/AAPL/?apikey=demo&#34;, “/”, “noHeaders”))”))\n  h. Or for financials you can type in A1:  =IFERROR(IMPORTJSON(“https://fmpcloud.io/api/v3/income-statement/AAPL/?apikey=demo&#34;, “/”, “noHeaders”), IMPORTJSON(“http://fmpcloud.io/api/v3/income-statement/AAPL/?apikey=demo&#34;, “/”, “noHeaders”))”))\n  h. you can now replace the API key demo by your API key and query other stocks and any endpoints on their  documentation.\n    Welcome to a place where words matter. On Medium, smart voices and original ideas take center stage - with no ads in sight.  Watch\n Follow all the topics you care about, and we’ll deliver the best stories for you to your homepage and inbox.  Explore\n Get unlimited access to the best stories on Medium — and support writers while you’re at it. Just $5/month.  Upgrade", "posttime": "2020-05-15 23:38:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,数据,json,api", "title": "如何将JSON数据从API导入到Google工作表", "title_en": "How to Import JSON Data from an API into a Google Sheet", "transed": 1, "url": "https://medium.com/learn-finance/how-to-import-json-data-from-an-api-into-a-google-sheet-1b66a28707b0", "via": "", "real_tags": ["google", "数据", "json", "api"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002238, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "选择购买试用订阅港币10元，试用期4周，试用结束后每月收费港币495.00元。\n4周内可无限制享受英国“金融时报”值得信赖、屡获殊荣的商业新闻的无限量高级数字访问。\n礼品-每月与家人、朋友和同事分享多达10篇文章", "note_en": "Select  Purchase a Trial subscription for HK$10.00 for 4 weeks   You will be billed HK$495.00 per month after the trial ends\n  For 4 weeks receive unlimited Premium digital access to the FT&#39;s trusted, award-winning business news\n  Gift Article – share up to 10 articles a month with family, friends and colleagues", "posttime": "2020-05-15 23:23:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "破产,bankruptcy,试用", "title": "人满为患的破产法院威胁到美国的复苏", "title_en": "Swamped bankruptcy courts threaten US recovery", "transed": 1, "url": "https://www.ft.com/content/14b07c0e-95e3-11ea-af4b-499244625ac4", "via": "", "real_tags": ["破产", "试用"]}, {"category": "", "categoryclass": "", "imagename": "f3a0d23b8ce26ccee4723fed1d6fe9c6.jpg", "infoid": 1002235, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从我开始编程并发现开源世界以来，我承认我一直有点痴迷于我们社区的精英开发人员。领导大型开源项目(通常是很多项目)或商业指导大型团队的人员。他们是怎么走到今天这一步的？软件社区有很多关于如何成为一名更好的开发人员、如何发展您的事业以及个人开发的建议和支持；我认为程序员非常善于自我反省和关闭自己的反馈循环。那么，在一片极其合格的专业人士的海洋中，如何才能成功地领导和创造呢？\n为了回答这个问题，而且因为我对这个话题有普遍的好奇心，我设立了一个播客，名为“杰出的开发人员”。与顶级开发人员交谈令人着迷，我学到的东西比我开始播客时认为可能学到的要多。所以我想在这篇文章中分享一些知识。\n在采访了几位开发人员之后，一个模式开始变得清晰起来：优秀的开发人员分享了很多东西。对于不同的人，这采取了不同的形式，但通常是一个博客。“那又怎样？”你可能会说，你会期待成功的人--“思想领袖”--利用他们的职位和平台来分享他们自己的想法和项目。但有趣的是，对于许多顶级开发者来说，他们的分享心态先于他们的成功，是他们成功的直接原因，而不是它的结果。\n以杰夫·阿特伍德为例。Jeff与人共同创立了Stack Overflow和Stack Exchange，并继续从事后来发现的讨论。这一切开始的原因完全归功于他的博客，Coding Horror。\n在我的播客中，杰夫讲述了这样一个故事：有一天，他查看了博客上的统计数据，发现自己有4万订阅者。自2004年以来，他一直在分享他对软件和其他一些事情的想法，他意识到他想用自己的精力做一些事情，并遵循他所拥有的。在联系到Joel Spolsky(碰巧他也有一个非常成功的博客，joelonsoft)之后，他们开始了Stack Overflow。\n如果没有从博客到kickstart Stack Overflow的临界用户数量，它的命运可能会截然不同。但更重要的是，如果他们中的任何一个不写博客，这个想法就永远不会实现。\n我经常问成功的博客作者的一个问题是：是什么驱使你开始呢？\n这是一个幸存者偏见的例子；那些为了吸引追随者而开设博客的人将失去动力，对短期结果变得不耐烦。成功的博客作者对这个话题有个人的信心和热情，他们会记录和分享他们认为很酷的东西。\n米格尔·格林伯格(Miguel Grinberg)是Flask Mega教程(被许多人认为是最顶尖的Flask资源)的作者，他在我的播客上谈论了第一期是如何在Twitter上获得了单一的点赞和转发的。几个月来写新的分期付款几乎没有带来更多的参与度，但它花了几年的时间才获得吸引力。但这对他来说无关紧要，因为“我玩得很开心，追随我的兴趣，为自己做这件事。”\n世界上Stackoverflow上Python的头号贡献者Martin jn Pieters在我的播客上讨论了他回答大量问题的动机，他所做的一切都很有质量。对他来说，这关乎好奇心和专业知识。他引用Eric Lippert(微软C#编译器的核心工程师，也是一名博客作者)的话说：“你如何成为某件事的专家？那么，找一堆问题，或者找一个人们就你的话题提问的地方。如果你尝试回答每一个问题，你很快就会成为专家。“。\n这并不是说回答问题来帮助别人没有奖励或动机，只是这样做的个人利益经常被低估。\n对于许多成功的开放源码项目也是如此，这些项目通常从个人项目开始，后来才被改编成通用项目。当我采访Vuitify的创建者约翰·莱德(John Leider)关于这个项目是如何开始的时候，他最初只是为自己建造了这个项目，以便为他的咨询业务快速制作网站原型。“实际上，我从来没有打算发布它，这对我来说是一件事。我的一个同事有一天路过，他说，看起来真的很酷。谈了一会儿，他说服我把它作为开源项目发布。“。\n从外部看，为自己而不是观众做点什么的想法看起来像是分享的主要好处来自于你吸引的人的网络，以及提升知名度创造的机会，比如新工作、咨询、项目机会和演讲机会。虽然这是真的，但顶尖的软件工程师告诉我，这种长期利益从来不是他们的目标-分享的行为创造了巨大的短期个人利益。\n虽然为自己创造东西很重要，但这并不意味着你把它们留给自己。启蒙窗口管理器的创建者卡斯滕·海茨勒(又名Rasterman)只为自己启动了这个项目，原因很简单，他想要一个更漂亮的桌面环境。一时兴起，他在网上分享了一些截图，然后突然开始收到人们要求提供源代码的电子邮件。快进到今天，启蒙库被用于数百万部手机、台式机，甚至三星智能手表和智能电视。\n关键的一点是，虽然任何成功项目的动机都必须来自你自己，但你不应该阻止自己分享它，因为它从来就不是给观众看的。当我与播客交谈时，这个想法经常出现，因为人们的反应总是令人惊讶。无论你的工作是什么，你都应该秉持“默认公开”的理念。\n公开默认的意思是：每次你创造一些东西，学到一些东西，或者只是注意到一些有趣的东西，都要在公共场合这样做。这可能看起来令人望而生畏--写博客帖子、帮助社区以及将想法从思想转化为语言都需要时间。但分享就像一块肌肉，通过承诺有规律的时间表，你会变得更有效率。这种量的一致性也是收获共享好处的关键。\n默认公开原则可以如此迅速地加速你的个人发展，原因有很多。首先，在技术层面上，有一个即时反馈循环。如果你在论坛或在线社区上回答问题，考虑策略或为开源做出贡献，你就会有一个如此迅速的反馈循环，以至于不可能不改进。\n更重要的是，互联网的蜂群思维习惯于将你可能有的想法转化为值得追求的东西，通过不同的角度或方向进行增值。特别值得一提的是，博客是极好的创意生成平台。我对此有过亲身体验--作为一名自由撰稿人，我的一些最好的新文章线索和学习机会来自人们在我的帖子上留下的评论。\n要真正接受默认的公开，仅仅分享你成功的项目和知识是不够的，还需要谦虚地分享你的学习和失败。一般说来，很难否认这样一种情绪，即如果你打算分享而不是只为自己做任何事情，无论这些事情多么微不足道，你都会更仔细地考虑你所做的每一件事。默认情况下公开有很多价值，而且往往是以我们意想不到的方式。\n对于顶尖的软件开发人员来说，共享并不是他们成功的副产品--它往往是成功的原因。这样做的原因有很多，但有信心为自己分享更多，可能是非常有意义的。\n所以下次你做周末项目，学到一些东西或发现任何你认为很酷的东西时，一定要分享它；你会有很好的同伴。\n标签：公告、开源、堆栈溢出", "note_en": "Ever since I started programming and discovered the open source world, I confess I’ve been a little obsessed with the elite developers in our communities. People who lead large open source projects (and often many of them) or direct large teams commercially. What is about them that got them to where they are? The software community has an abundance of advice and support on how to become a better developer, how to progress your career, and develop personally; I like to think programmers are pretty good at self-introspection and closing their own feedback loops. So amid a sea of extremely qualified professionals, what does it take to lead and create successfully?\n To answer this question, and because I have a general curiosity around the topic, I set up a podcast,  Distinguished Devs. Talking to top developers has been fascinating, and I’ve learned more than I thought was possible when I started the podcast. So I’d like to share some of that knowledge in this article.\n  After interviewing several developers, a pattern started to become clear: great developers share  a lot. This takes different forms for different people, but is very often a blog. “So what?” you might say, you would expect successful people—“thought leaders”—to use their position and platform to share their own ideas and projects. But the interesting thing is that for many top developers, their sharing mindset came before their success, and was the direct cause of it, not the result of it.\n Take Jeff Atwood, for example. Jeff co-founded Stack Overflow and Stack Exchange and went on to later found Discourse. The reason this all started is entirely due to his blog,  Coding Horror.\n On my podcast, Jeff tells the story of how one day he checked the stats on his blog and realized he had 40,000 subscribers. He’d been sharing his thoughts on software and a little bit of everything else since 2004, and he realized he wanted to do something with the energy and following that he had. After reaching out to Joel Spolsky (who also happened to have a very successful blog,  joelonsoftware), they started Stack Overflow.\n Without the critical mass of users from their blogs to kickstart Stack Overflow, its fate might have been very different. But more than that—the idea would never have been realized at all if either of them hadn’t blogged.\n  One of the questions I always ask successful bloggers is: what motivated you to start?\n  This is an example of survivor bias; those who start a blog with the aim of attracting a following will lose motivation and grow impatient with the short term results. Successful bloggers have the personal confidence and passion for the topic to document and share stuff they think is cool.\n Miguel Grinberg, the author of the Flask Mega Tutorial (regarded by many as the top Flask resource) talks on my podcast about how the first installment received a single like and retweet on Twitter. Months of writing new installments brought little more engagement, it took years for it to gain traction. But it didn’t matter to him, because “I was having fun, following my interests, doing it for myself.”\n Martijn Pieters, the world’s top contributor to Python on Stackoverflow, discussed on my podcast his motivation for answering the volume of questions with the quality he does. For him, it’s about curiosity and expertise. Quoting Eric Lippert (a core engineer of the Microsoft C# compiler, and also a  blogger), he says “How do you become an expert on something? Well, find a pile of questions or a place where people are asking questions about your topic. If you try and answer each one, you’ll become an expert quickly enough.”\n That’s not to say there’s no reward or motivation in answering questions to help others, just that the personal benefits of doing so often go underestimated.\n The same is true for many successful open source projects, which often start out as personal projects, only to later be adapted for general use. When I interviewed John Leider, the creator of Vuetify, about how the project started, he initially built it just for himself to enable rapid prototyping of sites for his consulting business. “I actually never planned to release it, it was going to be a thing for me. One of my buddies at work was walking by one day and said, that looks really cool. After a bit of talking, he convinced me to release it as an open source project.”\n From the outside, the idea of doing something for yourself, not the audience looks like the main benefits of sharing come from the network of people you attract, and the opportunities created by a raised profile, such as new jobs, consulting, project offers and speaking opportunities. While this is true, top software engineers have told me that this long-term benefit was never their goal—the act of sharing creates significant short-term personal benefit.\n  Though it’s important to create things for yourself, this shouldn’t mean you keep them to yourself. Carsten Haitzler (AKA Rasterman), the creator of the Enlightenment window manager, started the project only for himself, simply because he wanted a prettier desktop environment. On a whim, he shared some of the screenshots online, and all of a sudden began receiving emails from people asking for the source code. Fast forward to today, and the Enlightenment libraries are used in millions of phones, desktops, and even Samsung smartwatches and smart TVs.\n The key point is that whilst the motivation for any successful project has to come from within yourself, you shouldn’t stop yourself sharing it because it was never meant for an audience. This idea surfaces frequently when I’m talking to podcast guests, because it’s always surprising how people react. Whatever your work, you should embrace the philosophy of “public by default”.\n Public-by-default means this: everytime you create something, learn something, or just notice something’s interesting, do it in public. This may seem daunting—writing blog posts, helping the community and transforming ideas from thoughts into words all takes time. But sharing is like a muscle, and by committing to a regular schedule, you become much more efficient. This consistency of volume is also key to reaping the benefits of sharing.\n There are a number of reasons why the public-by-default principle accelerates your personal development so rapidly. Firstly, on a technical level, there’s an immediate feedback loop. If you’re answering questions on forums or online communities, considering strategy or contributing to open source, you have such a swift feedback loop that it’s impossible not to improve.\n What’s more, the hive-mind of the internet has a habit of taking ideas you might have which are ok and turning them into something worth pursuing, adding value through different angles or directions. Blogs in particular are excellent idea generation platforms. I’ve had personal experience with this—as a freelance writer, some of my best leads for new pieces and learning opportunities come from comments people have left on my posts.\n To truly embrace public-by-default, it’s not enough to share your successful projects and knowledge, but additionally to bring the humility to share your learning and failures. In general, it’s hard to argue with the sentiment that you think harder about everything you do if you’re going to share instead of just do it for yourself, no matter how trivial it might be. There’s a lot of value to be had from being public-by-default, and often in ways which we don’t expect.\n  For top software developers, sharing isn’t a byproduct of their success—it’s often the cause of it. The reasons for this are many and varied, but having the confidence to share more, for yourself, can be extremely rewarding.\n So the next time you make a weekend project, learn something or discover anything you think is cool, be sure to share it; you’ll be in good company.\n  Tags:  bulletin,  open source,  stackoverflow", "posttime": "2020-05-15 23:02:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,开发人员,developers,项目", "title": "优秀的开发人员分享了很多", "title_en": "Great developers share a lot", "transed": 1, "url": "https://stackoverflow.blog/2020/05/14/the-most-successful-developers-share-more-than-they-take/?cb=1", "via": "", "real_tags": ["开发", "开发人员", "项目"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002234, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当考虑多态性，特别是运行时多态性时，首先想到的是虚函数。\n虚拟函数非常强大，适合某些用例。但在使用它们之前，最好考虑一下我们对多态性的确切需求，看看是否有其他更适合的工具来满足它。\n实际上，虚函数会在对象上创建多态性。但是，如果您不需要对象怎么办？如果您只需要您的代码根据某些条件以不同的方式运行，但是您不需要任何涉及的对象，该怎么办呢？\n请考虑下面的示例，它的灵感来自于我参与的一个项目。我简化了示例，去掉了与域相关的所有内容，使其更易于理解。\n我们有一个输入，我们想要计算一个输出(这是一个相当标准化的例子，对吧？)。输入值如下所示：\n有各种类型的计算器，旨在处理各种类型的输入。为了使示例简单，但又不失其一般性，我们假设有两个计算器：一个处理大输入(值大于10)，另一个处理小输入(值小于或等于10)。\n此外，每个计算器可以记录有关给定输入和输出对的一些信息。\n考虑到上述需要，我们需要一些接口来表示具有以下三个功能的计算器：\n布尔句柄(输入常量输入)；输出计算(输入常量输入)；无效日志(输入常量输入，输出常量输出)；\n将这三个函数分组在同一位置(例如，一个类)会很好。但是我们不需要它们是成员函数，它们可以只是常规函数。如果我们使用一个类将它们粘合在一起，我们可以将它们实现为静态函数。\nstruct BigCalculator{static bool Handles(input const&amp；input){return input.value&gt；10；}静态输出计算(input const&amp；input){return output{input.value*5}；}静态无效日志(input const；amp；input，output const&amp；output){std：：cout&lt；&lt；&#34；BigCalculator接受&#34；&lt；&lt；in.。&lt；&lt；output.value&lt；&lt；&#39；\\n&#39；；}}；\nstd：：cout&lt；&lt；&#34；BigCalculator接受&#34；&lt；&lt；INPUT的输入。值，并产生了#34；&lt；&lt；输出。Value&lt；&lt；&#39；\\n&#39；；\nstruct SmallCalculator{static bool Handles(input const&amp；input){return input.value&lt；=10；}静态输出计算(input const&amp；input){return output{input.value+2}；}静态无效日志(input const；input，output const&amp；output){std：：cout&lt；&lt；&#34；SmallCalculator接受&#34；&lt；&lt；的输入。并产生了&#34；&lt；&lt；output.value；&lt；&#39；\\n&39；；}}；\nstd：：cout&lt；&lt；&#34；SmallCalculator接受&#34；&lt；&lt；INPUT的输入。值，并产生了#34；&lt；&lt；输出。Value&lt；&lt；&#39；\\n&#39；；\n现在我们已经有了Calculator接口的各种实现，我们需要以某种方式将它们以统一的方式绑定到调用点。\n这意味着给定调用点的代码应该独立于它使用的特定计算器。根据定义，这就是多态性实现的目的。\n到目前为止，“Calculator”接口是隐式的。现在让我们创建一个包含Calculator的组件，它的行为既可以像SmallCalculator，也可以像BigCalculator。\n此组件必须具有Calculator接口的三个功能，并执行BigCalculator或SmallCalculator的代码。让我们添加三个函数指针，稍后我们将为其分配计算器实现的静态函数：\n结构计算器{bool(*handles)(输入常量(&amp；input)；输出(*计算)(输入常量(&amp；input))；void(*log)(输入常量(&amp；input，输出常量(&amp；output))；}；\n为了使与计算器实现的绑定更容易，让我们添加一个帮助器函数，该函数将这些函数指针分配给计算器的函数指针：\n结构计算器{bool(*Handles)(输入常量输入)；输出(*计算)(输入常量输入)；void(*log)(输入常量输入，输出常量输出)；模板&lt；TypeName CalculatorImplementation&gt；静态计算器createFrom(){return Calculator{&amp；CalculatorImplementation：Handles，&amp；CalculatorImplementation：\n此函数有点像构造函数，但它不像普通构造函数那样接受值，而是接受类型作为输入。\n要解决在几个计算器中选择正确计算器的初始问题，让我们实例化这些计算器并将其存储在一个集合中。为此，我们将拥有一个绑定到BigCalculator或SmallCalculator的计算器集合：\n我们现在可以编写使用Calculator接口的代码，并且独立于各种类型的计算器：\n自动常量输入=输入{50}；自动常量计算器=getCalculators()；自动常量计算器=std：：find_if(BEGIN(计算器)，END(计算器)，[&amp；Input](自动&amp；&amp；计算器){Return Calculator.Handles(INPUT)；})；IF(COMPATOR！=END(计算器)){AUTO CONST OUTPUT=COMPUTOR-&&gt;COMPUTE(INPUT)；COMPATOR-&&gt;；LOG(INPUT，\n如果我们将第一行替换为以下内容，以获取一小部分输入：\n我们看到代码选择了正确的计算器，并使用它来执行计算和日志记录。\n上面的代码既不包含继承，也不包含关键字virtual。但是它使用函数指针将执行路由到给定类中的实现，这听起来很像虚函数和vtable所做的事情。\n我们是不是刚刚手动实现了虚拟功能？在这种情况下，我们最好使用语言的本机特性，而不是实现我们自己的特性。\n我们试图解决的问题确实可以用虚函数来实现。以下是执行此操作的代码，并突出显示了与前面代码的显著差异：\nstruct input{Double Value；}；struct Output{Double Value；}；struct Calculator{虚拟布尔句柄(输入常量&amp；input)常量=0；//虚方法虚拟输出计算(输入常量&amp；input)常量=0；虚拟无效日志(输入常量输入，输出常量&amp；输出)常量=0；Virtual~Calculator(){}；}；struct BigCalculator：计算器//继承{bool Handles(输入常量。}output computer(input const&amp；input)const覆盖{return output{input.value*5}；}void log(input const&amp；input，output const&amp；output)const覆盖{std：：cout&lt；&lt；&#34；BigCalculator接受&#34；&lt；&lt；input.value&lt；&#34；的输出，并生成&#34；&lt；&输出。\\n&#39；；}}；struct SmallCalculator：计算器{bool Handles(input const&amp；input)const覆盖{return input.value&lt；=10；}output computer(input const&amp；input)const覆盖{return output{input.value+2}；}void log(input const；input，output const&amp；output)const覆盖{std：：cout&lt；&lt；&#34；SmallCalculator Take&#34；并产生了输出&#34；&lt；&lt；output.value；&lt；&#39；\\n&39；；}}；std：：vector&lt；std：：unique_ptr&lt；Calculator&gt；&gt；getCalculators()//Unique_ptrs{自动计算器=std：：vector&lt；std：：unique_ptr&lt；Calculator&gt；&gt；{}；calculators.push_back(std：：make_unique&lt；BigCalculator&gt；())；calculators.push_back(std：：make_unique&lt；SmallCalculator&gt；())；返回计算器；}int Main(){自动常数输入=输入{50}；自动常数计算器=getCalculators()；自动常数计算器=std：：Find_if(开始(计算器)，结束(计算器)，[&amp；输入](自动&amp；&amp；计算器){返回计算器-&&gt;句柄(输入)；})；IF(计算器！=END(计算器)){自动常量输出=(*计算器)-&gt；COMPUTE(输入)；//额外间接(*计算器)-&gt；log(输入，输出)；}}。\nstd：：cout&lt；&lt；&#34；BigCalculator接受&#34；&lt；&lt；INPUT的输入。值，并产生了#34；&lt；&lt；输出。Value&lt；&lt；&#39；\\n&#39；；\nstd：：cout&lt；&lt；&#34；SmallCalculator接受&#34；&lt；&lt；INPUT的输入。值，并产生了#34；&lt；&lt；输出。Value&lt；&lt；&#39；\\n&#39；；\n与我们前面没有使用虚函数的代码相比，有一些显著的不同之处：\n这两种方法之间的结构差异在于，第一种方法是在类或代码上使用多态性，而具有虚函数的方法是在对象上使用多态性。\n因此，多态对象在堆上实例化，以便将它们存储在容器中。使用类上的多态性，我们没有实例化堆上的任何对象。\n使用新选项(和删除)可能会有问题，特别是在性能方面。出于这个原因，一些应用程序甚至被禁止使用堆存储。\n但是，如果您的系统允许使用new，最好编写富有表现力的代码，并仅在必要时对其进行优化。也许在代码的这一部分中，调用new并不会有什么显著的不同。\n我们的第一个在类上使用多态性的代码在表现力方面有一个缺点：它使用非标准结构，使用Calculator接口处理函数指针。另一方面，虚拟函数只使用隐藏所有这些绑定的标准功能，并且提供更少的代码可读。\n另一方面，虚函数不像类上的多态性那样精确地表达我们的意图：计算器不是对象，它们是函数。将多态性与类一起使用的解决方案通过使用静态函数而不是对象方法来演示这一点。\n总而言之，当谈到表现力时，两种解决方案都有利弊。当谈到new的使用时，一个解决方案使用new，一个不使用。\n在任何情况下，重要的是要记住，虚函数是强大的，因为它们允许对象级别的多态性，但它们是有代价的：堆上的实例化和使用指针。\n当您需要多态性时，不要急于使用虚函数。就此而言，不要仓促做任何设计。首先想一想你需要什么。可能还有其他解决方案可以更好地满足您的需求。\n成为守护神！分享这篇帖子！你不想错过吗？(&amp；nbsp)。以下是：", "note_en": "When thinking of polymorphism, and in particular of runtime polymorphism, the first thing that comes to mind is virtual functions.\n Virtual functions are very powerful, and fit for some use cases. But before using them, it’s a good thing to consider our exact need for polymorphism, and look around if there are other, more adapted tools to satisfy it.\n Indeed, virtual functions create polymorphism on objects. But what if you don’t need objects? What if you only need you code to behave differently depending on some conditions, but you don’t need any objects involved?\n   Consider the following example, which is inspired from a project I worked on. I simplified the example by stripping off everything domain related to make it easier to understand.\n We have an input, and we’d like to compute an output (this is a pretty standardised example, right?). The input value looks like this:\n           There are various types of calculators, that are designed to handle various types of inputs. To make the example simple but without losing any of its generality, let’s say that there are two calculators: one that handles big inputs (with a  value larger than 10) and one that handles small inputs (with a  value smaller or equal to 10).\n Moreover, each calculator can log some information about a given pair of input and output.\n    Given the above needs, we would need some interface to represent a Calculator, with the three following functions:\n  bool handles(Input const&amp; input);\r\rOutput compute(Input const&amp; input);\r\rvoid log(Input const&amp; input, Output const&amp; output);\n    It would be nice to group those three functions in the same place, for example a class. But we don’t need them to be member functions, they can be just regular functions. If we use a class to stick them together, we can implement them as  static functions.\n   struct BigCalculator\r{\r static bool handles(Input const&amp; input)\r {\r return input.value &gt; 10;\r }\r\r static Output compute(Input const&amp; input)\r {\r return Output{ input.value * 5 };\r }\r\r static void log(Input const&amp; input, Output const&amp; output)\r {\r std::cout &lt;&lt; &#34;BigCalculator took an input of &#34; &lt;&lt; input.value &lt;&lt; &#34; and produced an output of &#34; &lt;&lt; output.value &lt;&lt; &#39;\\n&#39;;\r }\r};\n  std :: cout   &lt;&lt;   &#34;BigCalculator took an input of &#34;   &lt;&lt;   input . value   &lt;&lt;   &#34; and produced an output of &#34;   &lt;&lt;   output . value   &lt;&lt;   &#39;\\n&#39; ;\n     struct SmallCalculator\r{\r static bool handles(Input const&amp; input)\r {\r return input.value &lt;= 10;\r }\r\r static Output compute(Input const&amp; input)\r {\r return Output{ input.value + 2 };\r }\r\r static void log(Input const&amp; input, Output const&amp; output)\r {\r std::cout &lt;&lt; &#34;SmallCalculator took an input of &#34; &lt;&lt; input.value &lt;&lt; &#34; and produced an output of &#34; &lt;&lt; output.value &lt;&lt; &#39;\\n&#39;;\r }\r};\n  std :: cout   &lt;&lt;   &#34;SmallCalculator took an input of &#34;   &lt;&lt;   input . value   &lt;&lt;   &#34; and produced an output of &#34;   &lt;&lt;   output . value   &lt;&lt;   &#39;\\n&#39; ;\n     Now that we have various implementations of the Calculator interface, we need to somehow bind them to a call site, in a uniform manner.\n This means that the code of a given call site should be independent of the particular calculator that it uses. This is by definition what polymorphism achieves.\n So far, the “Calculator” interface was implicit. Let’s now create a component that embodies a Calculator, and that can behave either like a  SmallCalculator or a  BigCalculator.\n This component must have the three functions of the Calculator interface, and execute the code of either  BigCalculator or  SmallCalculator. Let’s add three functions pointers, that we will later assign the the  static functions of the calculator implementations:\n  struct Calculator\r{\r bool (*handles) (Input const&amp; input);\r Output (*compute)(Input const&amp; input);\r void (*log)(Input const&amp; input, Output const&amp; output);\r};\n   To make the binding with a calculator implementation easier, let’s add a helper function that assigns those function pointers to the one of a calculator:\n  struct Calculator\r{\r bool (*handles) (Input const&amp; input);\r Output (*compute)(Input const&amp; input);\r void (*log)(Input const&amp; input, Output const&amp; output);\r\r template&lt;typename CalculatorImplementation&gt;\r static Calculator createFrom()\r {\r return Calculator{ &amp;CalculatorImplementation::handles, &amp;CalculatorImplementation::compute, &amp;CalculatorImplementation::log };\r }\r};\n   This function is a bit like a constructor, but instead of taking values like a normal constructor, it takes a type as input.\n  To solve our initial problem of choosing the right calculator amongst several ones, let’s instantiate and store the calculators in a collection. To do that, we’ll have a collection of  Calculators that we bind to either  BigCalculator or  SmallCalculator:\n       We can now write code that uses the  Calculator interface, and that is independent from the individual types of calculators:\n  auto const input = Input{ 50 };\r\rauto const calculators = getCalculators();\rauto const calculator = std::find_if(begin(calculators), end(calculators),\r [&amp;input](auto&amp;&amp; calculator){ return calculator.handles(input); });\r\rif (calculator != end(calculators))\r{\r auto const output = calculator-&gt;compute(input);\r calculator-&gt;log(input, output);\r}\n        And if we replace the first line by the following, to take a small input:\n     We see that the code picks the correct calculator and uses it to perform the calculation and the logging.\n  The above code doesn’t contain inheritance nor the keyword  virtual. But it uses function pointers to route the execution to an implementation in a given class, and that sounds a lot like what virtual functions and vtables do.\n Did we just manually implement virtual functions? In this case, we’d be better off using the native feature of the language rather than implementing our own.\n The problem we’re trying to solve is indeed implementable with virtual functions. Here is the code to do this, with highlight on the significant differences with our previous code:\n  struct Input\r{\r double value;\r};\r\rstruct Output\r{\r double value;\r};\r\rstruct Calculator\r{\r virtual bool handles(Input const&amp; input) const = 0; // virtual methods\r virtual Output compute(Input const&amp; input) const = 0;\r virtual void log(Input const&amp; input, Output const&amp; output) const = 0;\r virtual ~Calculator() {};\r};\r\rstruct BigCalculator : Calculator // inheritance\r{\r bool handles(Input const&amp; input) const override\r {\r return input.value &gt; 10;\r }\r\r Output compute(Input const&amp; input) const override\r {\r return Output{ input.value * 5 };\r }\r\r void log(Input const&amp; input, Output const&amp; output) const override\r {\r std::cout &lt;&lt; &#34;BigCalculator took an input of &#34; &lt;&lt; input.value &lt;&lt; &#34; and produced an output of &#34; &lt;&lt; output.value &lt;&lt; &#39;\\n&#39;;\r }\r};\r\rstruct SmallCalculator : Calculator\r{\r bool handles(Input const&amp; input) const override\r {\r return input.value &lt;= 10;\r }\r\r Output compute(Input const&amp; input) const override\r {\r return Output{ input.value + 2 };\r }\r\r void log(Input const&amp; input, Output const&amp; output) const override\r {\r std::cout &lt;&lt; &#34;SmallCalculator took an input of &#34; &lt;&lt; input.value &lt;&lt; &#34; and produced an output of &#34; &lt;&lt; output.value &lt;&lt; &#39;\\n&#39;;\r }\r};\r\rstd::vector&lt;std::unique_ptr&lt;Calculator&gt;&gt; getCalculators() // unique_ptrs\r{\r auto calculators = std::vector&lt;std::unique_ptr&lt;Calculator&gt;&gt;{};\r calculators.push_back(std::make_unique&lt;BigCalculator&gt;());\r calculators.push_back(std::make_unique&lt;SmallCalculator&gt;());\r return calculators;\r}\r\rint main()\r{\r auto const input = Input{ 50 };\r\r auto const calculators = getCalculators();\r auto const calculator = std::find_if(begin(calculators), end(calculators),\r [&amp;input](auto&amp;&amp; calculator){ return calculator-&gt;handles(input); });\r\r if (calculator != end(calculators))\r {\r auto const output = (*calculator)-&gt;compute(input); // extra indirection\r (*calculator)-&gt;log(input, output);\r }\r}\n  std :: cout   &lt;&lt;   &#34;BigCalculator took an input of &#34;   &lt;&lt;   input . value   &lt;&lt;   &#34; and produced an output of &#34;   &lt;&lt;   output . value   &lt;&lt;   &#39;\\n&#39; ;\n                  std :: cout   &lt;&lt;   &#34;SmallCalculator took an input of &#34;   &lt;&lt;   input . value   &lt;&lt;   &#34; and produced an output of &#34;   &lt;&lt;   output . value   &lt;&lt;   &#39;\\n&#39; ;\n   There are a few notable differences with our previous code that didn’t use virtual functions:\n  The structural difference between the two approaches is that the first one was using  polymorphism on classes, or on code, whereas the one with virtual functions uses  polymorphism on objects.\n As a result, polymorphic objects are instantiated on the heap, in order to store them in a container. With polymorphism on classes, we didn’t instantiate any object on the heap.\n  Using  new (and  delete) can be a problem, especially for performance. Some applications are even forbidden to use heap storage for this reason.\n However, if your system allows the use of  new, it is preferable to write expressive code and optimise it only where necessary. And maybe in this part of the code calling  new doesn’t make a significant difference.\n  Our first code using polymorphism on classes has a drawback in terms of expressiveness: it uses a non-standard construct, with the  Calculator interface handling function pointers. Virtual functions, on the other hand, use only standard features that hide all this binding, and gives less code to read.\n On the other hand, virtual functions don’t express our intention as precisely as polymorphism on classes does: calculators are not objects, they are functions. The solution using polymorphism with class demonstrates this, by using  static functions instead of object methods.\n In summary when it comes to expressiveness, there are pros and cons for both solutions. When it comes to the usage of  new, one solution uses  new and one doesn’t.\n  In any case, it is important to keep in mind that virtual functions are powerful as they allow polymorphism at object level, but they come at a cost: instantiation on the heap, and using pointers.\n When you need polymorphism, don’t rush on virtual functions. Don’t rush on any design, for that matter. Think first about what you need. There may be other solutions that will match your need better.\n    Become a Patron!   Share this post!       &amp;nbspDon&#39;t want to miss out ?  Follow:", "posttime": "2020-05-15 23:01:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "对象,polymorphism,计算器", "title": "没有对象或虚拟函数的运行时多态性", "title_en": "Runtime Polymorphism Without Objects or Virtual Functions", "transed": 1, "url": "https://www.fluentcpp.com/2020/05/15/runtime-polymorphism-without-virtual-functions/", "via": "", "real_tags": ["对象", "计算器"]}]