[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1008286, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "注意：这是一篇来自Sixten编程语言文档的老帖子，我对它进行了润色和充实。在写完之后，我发现了Salsa，这是一个与我的Rock库有着非常相似目标的Rust库，它也绝对值得一看！\n编译器不再仅仅是获取一堆源文件并产生汇编代码的黑匣子。我们期望他们：\n是增量的，这意味着如果我们在做了一些更改之后重新编译一个项目，我们只会重新编译受更改影响的内容。\n提供编辑器工具，例如通过语言服务器，支持转到定义、查找特定位置的表达式类型以及动态显示错误消息等功能。\n这就是Anders Hejlsberg在他关于现代编译器构建的视频中谈到的，你们中的一些人可能已经看到了。\n在这篇文章中，我将介绍如何在Sixten中通过围绕查询系统构建编译器来实现这一点。\n对于那些不知道的人来说，Sixten是一种实验性的函数式编程语言，创建它的目的是让程序员比传统语言更好地控制内存布局和装箱。Sixten的最新开发是在Sixty存储库中完成的，并且完全是基于查询的。下面是一个小视频，让您体验一下它的语言服务器可以做些什么，其中显示了基于类型的完成：\n+-++|源文本|-解析-&gt；|AST|-类型检查-+-&gt；|核心AST|--生成-&gt；|ASSEMBLY|^|+-++-+|+-++-|读写类型|v+-+||类型表|+-+\n有许多变化，通常比插图中的步骤和中间表示法更多，但想法保持不变：\n我们沿着管道向下推送源文本，并运行一组固定的转换，直到最终输出汇编代码或其他目标语言。在此过程中，我们经常需要阅读和更新一些状态。例如，我们可以在类型检查期间更新类型表，以便稍后可以查找代码引用的实体类型。\n我们中的许多人可能对传统的编译器流水线非常熟悉，但是基于查询的编译器应该如何构建可能不是那么广为人知。在这里，我将描述一种方法来做到这一点。\n如何才能获得限定名称的类型，如&#34；Data.List.map&#34；？在基于管道的体系结构中，我们只需在类型表中查找它。对于问题，我们必须以不同的方式思考。我们不再依赖于更新某个状态，而是将其视为从头开始。\n作为第一次迭代，我们完全从头开始。它可能看起来有点像这样：\nfetchType：：QualifiedName-&gt；IO类型fetchType(QualifiedName模块名称)=do文件名&lt；-module eFileName模块名称源代码&lt；-readFile文件名parsedModule&lt；-parseModule源代码解析模块&lt；-solveNames parsedModule let定义=查找名称解析模块推断DefinitionType定义。\n我们首先找出名称来自哪个文件，可能是Data.List的data/List.vix，然后读取文件内容，解析它，也许我们进行名称解析以找出代码中的名称在给定导入内容的情况下引用了什么，最后我们查找名称解析的定义并键入check，返回它的类型。\n这一切仅仅是为了获取标识符的类型吗？这似乎很荒谬，因为在模块的类型检查过程中，查找名称的类型是我们会做很多次的事情。幸运的是，我们还没有做完。\nfetchParsedModule：：ModuleName-&gt；IO ParsedModule fetchParsedModule module eName=do filename&lt；-module eFileName module eName sourceCode&lt；-readFile filename parseModule module name fetchResolvedModule：：ModuleName-&gt；IO ResolvedModule fetchResolvedModule fetchResolvedModule module eName=do parsedModule&lt；-fetchParsedModule modeName：：ModuleName-&gt；IO ResolvedModule fetchResolvedModule module eName=do parsedModule&lt；-fetchParsedModule module。\n请注意，每个函数都是自己从头开始做所有事情的，也就是说，它们每个都在做流水线中要做的工作的前缀(越来越长)。我发现这是我的基于查询的编译器中的一种常见模式。\n提高效率的一种方法是在每个函数周围添加一个记忆层。这样，当我们第一次使用特定参数调用函数时，我们会做一些代价高昂的工作，但后续调用的代价很低，因为它们可以返回缓存的结果。\n这基本上就是我们要做的，但是我们不会为每个函数使用单独的缓存，而是有一个由查询索引的中央缓存。此功能由Rock提供，Rock是一个将一些功能打包以创建基于查询的编译器的库。\nRock是一个实验性的图书馆，灵感主要来自Shake和点菜纸上的构建系统。它实质上实现了构建系统框架，如make。\n构建系统与现代编译器有很多共同之处，因为我们希望它们是增量的，也就是说，在重新构建时只需很少的更改就可以利用以前的构建结果。但也有一个不同之处：大多数构建系统并不关心它们的查询类型，因为它们在文件和文件系统级别上工作。\n按单方式构建系统更接近我们想要的。在那里，用户编写了一系列计算、任务，为键选择合适的类型，为值选择类型。这些任务是假定它们在这样的环境中运行的：存在Key-&gt;Task Value类型的函数获取，其中Task是用于描述构建系统规则的类型，可用于获取具有特定键的依赖项的值。在上面的示例中，密钥类型可能如下所示：\n构建系统可以控制我们执行FETCH时运行的代码，因此通过变化，它可以执行细粒度的依赖项跟踪、记忆和增量更新。\n按菜单构建系统也是关于探索当我们改变允许Task做什么时，我们会得到什么样的构建系统，例如它是Monad还是Applicative。在Rock，我们没有探索这一点，所以我们的任务是IO之上的一层薄薄的东西。\n然而，现在出现的一个问题是，没有令人满意的价值类型。我们希望FETCH(ParsedModuleKey&#34；Data.List&#34；)返回ParsedModule，而FETCH(TypeKey&#34；Data.List.map&#34；)应该返回类型为Type的内容。\nROCK允许我们根据查询的返回类型来索引键类型。我们运行示例中的键类型变为以下GADT：\n数据键a其中ParsedModuleKey：：ModuleName-&gt；密钥解析模块ResolvedModuleKey：：ModuleName-&gt；密钥解析模块TypeKey：：QualifiedName-&gt；密钥类型。\nFETCH函数获取所有a.Key a-&gt；任务a的类型，因此我们在运行FETCH(ParsedModuleKey&#34；Data.List&#34；)时会获得一个ParsedModule，这是我们想要的，因为返回类型取决于我们使用的键。\n现在我们知道了Fetch应该是什么样子，更具体地说，它也值得透露一下Rock中的任务类型是什么样子。如前所述，它是IO周围的一层薄层，提供了一种获取密钥(如上面的密钥)的方法：\nNewtype Task Key a=Task{unTask：：ReaderT(Fetch Key)IO a}Newtype Fetch Key=Fetch(for All a.。键a-&gt；IO a)。\n然后，我们编译器的规则(即其Makefile)变成以下函数，重用上面的函数：\n规则：：key a-&gt；Task a Rules Key=Case Key of ParsedModuleKey模块名称-&gt；fetchParsedModule模块名称ResolvedModuleKey模块名称-&gt；fetchResolvedModule ModeName TypeKey QualifiedName-&gt；fetchType QualifiedName。\n在Rock中运行Task的最基本方式是在Task获取密钥时直接调用规则函数。这会导致效率低下的构建系统从头开始重新计算每个查询。\n但是Rock库允许我们在我们的规则函数上添加更多的功能，我们可以添加的一件事就是备忘录。如果我们这样做，Rock通过将已经执行的读取的键-值对存储在依赖的哈希图中来缓存每个提取的键的结果。这样，在编译器的一次运行期间，我们最多执行一次每个查询。\n可以分层到规则功能上的另一种功能是增量更新。当它被使用时，Rock会跟踪任务在表中执行时使用的依赖项(很像Shake)，例如它获取了哪些键以及值是什么。使用此信息，即使依赖关系图的其他部分可能发生更改，它也能够确定何时可以安全地重用编译器上一次运行的缓存。\n此细粒度依赖项跟踪还允许在任务的依赖项以不起作用的方式更改时重用缓存。例如，空格更改可能会触发重新解析，但由于AST是相同的，因此可以在依赖于解析结果的查询中重用缓存。\n对于像语言服务器这样的实时工具来说，验证依赖关系可能太慢了，因为必须遍历依赖关系图的大部分，才能检查它的大部分即使是很小的更改也是不变的。\n例如，如果我们对具有许多大型导入的源文件进行更改，则需要遍历所有导入的依赖关系树，以便更新该单个文件的编辑器状态。这是因为依赖关系验证本身需要一直遍历到给定查询的所有依赖关系的根查询，这通常会占整个依赖关系树的很大比例。\n要解决这个问题，还可以让Rock跟踪查询之间的反向依赖关系。例如，当语言服务器检测到单个文件已经改变时，通过从改变的文件开始遍历反向依赖关系，使用反向依赖关系树来使高速缓存仅对于依赖于该文件的查询无效。\n由于导入的模块不依赖于该文件，因此它们不需要重新检查，从而使工具制作更快了！？\n大多数现代语言都需要一种工具策略，在我看来，围绕查询系统构建编译器似乎是一种非常有前途的方法。\n使用查询，编译器编写器不必处理对一组特别缓存的更新和失效，这可能是向传统编译器流水线添加增量更新时的结果。在基于查询的系统中，它都是一劳永逸地集中处理，这意味着出错的可能性较小。\n查询是极好的工具，因为它们允许我们随时询问任何查询的值，而无需担心顺序或时间影响，就像编写良好的Makefile一样。系统将以增量方式自动计算或检索查询及其依赖项的缓存值。\n基于查询的编译器也非常容易并行化。由于我们被允许在任何时候进行任何查询，而且它们在第一次重新运行时都会被记住，所以我们可以不需要考虑太多就可以并行地发出查询。在Sixty中，默认行为是并行检查所有输入模块的类型。\n最后，我希望这篇文章能启发您使用基于查询的编译器体系结构，并让您了解如何做到这一点。", "note_en": "Note: This is an old post originally from the documentation of the  Sixten programming language, that I&#39;ve touched up and fleshed out. After the time that it was written I&#39;ve found out about  Salsa, a Rust library with very similar goals to my Rock library, which is definitely worth checking out as well!\n  Compilers are no longer just black boxes that take a bunch of source files and produce assembly code. We expect them to:\n Be incremental, meaning that if we recompile a project after having made a few changes we only recompile what is affected by the changes.\n Provide editor tooling, e.g. through a  language server, supporting functionality like going to definition, finding the type of the expression at a specific location, and showing error messages on the fly.\n This is what Anders Hejlsberg talks about in  his video on modern compiler construction that some of you might have seen.\n In this post I will cover a about how this is achieved in  Sixten by building the compiler around a query system.\n For those of you that don&#39;t know, Sixten is an experimental functional programming language created to give the programmer more control over memory layout and boxing than traditional languages do. The most recent development of Sixten is being done in the  Sixty repository, and is completely query-based. Here&#39;s a little video giving a taste of what its language server can do, showing type-based completions:\n   +-----------+ +-----+ +--------+ +--------+  | | | | | | | |  |source text|---parse---&gt;| AST |---typecheck-+-&gt;|core AST|---generate---&gt;|assembly|  | | | | ^ | | | |  +-----------+ +-----+ | +--------+ +---------   |   read and write   types   |   v   +----------+   | |   |type table|   | |   +----------+\n There are many variations, and often more steps and intermediate representations than in the illustration, but the idea stays the same:\n We push source text down a pipeline and run a fixed set of transformations until we finally output assembly code or some other target language. Along the way we often need to read and update some state. For example, we might update a type table during type checking so we can later look up the type of entities that the code refers to.\n Traditional compiler pipelines are probably quite familiar to many of us, but how query-based compilers should be architected might not be as well-known. Here I will describe one way to do it.\n  What does it take to get the type of a qualified name, such as  &#34;Data.List.map&#34;? In a pipeline-based architecture we would just look it up in the type table. With queries, we have to think differently. Instead of relying on having updated some piece of state, we do it as if it was done from scratch.\n As a first iteration, we do it  completely from scratch. It might look a little bit like this:\n fetchType ::  QualifiedName  -&gt;  IO  Type  fetchType ( QualifiedName moduleName name)  =  do   fileName  &lt;- moduleFileName moduleName   sourceCode  &lt;-  readFile fileName   parsedModule  &lt;- parseModule sourceCode   resolvedModule  &lt;- resolveNames parsedModule    let definition  =  lookup name resolvedModule   inferDefinitionType definition\n We first find out what file the name comes from, which might be  Data/List.vix for  Data.List, then read the contents of the file, parse it, perhaps we do name resolution to find out what the names in the code refer to given what is imported, and last we look up the name-resolved definition and type check it, returning its type.\n All this for just for getting the type of an identifier? It seems ridiculous because looking up the type of a name is something we&#39;ll do loads of times during the type checking of a module. Luckily we&#39;re not done yet.\n  fetchParsedModule ::  ModuleName  -&gt;  IO  ParsedModule  fetchParsedModule moduleName  =  do   fileName  &lt;- moduleFileName moduleName   sourceCode  &lt;-  readFile fileName   parseModule moduleName     fetchResolvedModule ::  ModuleName  -&gt;  IO  ResolvedModule  fetchResolvedModule moduleName  =  do   parsedModule  &lt;- fetchParsedModule moduleName   resolveNames parsedModule     fetchType ::  QualifiedName  -&gt;  IO  Type  fetchType ( QualifiedName moduleName name)  =  do   resolvedModule  &lt;- fetchResolvedModule moduleName    let definition  =  lookup name resolvedModule   inferDefinitionType definition\n Note that each of the functions do everything from scratch on their own, i.e. they&#39;re each doing a (longer and longer) prefix of the work you&#39;d do in a pipeline. I&#39;ve found this to be a common pattern in my query-based compilers.\n One way to make this efficient would be to add a memoisation layer around each function. That way, we do some expensive work the first time we invoke a function with a specific argument, but subsequent calls are cheap as they can return the cached result.\n This is essentially what we&#39;ll do, but we won&#39;t use a separate cache per function, but instead have a central cache, indexed by the query. This functionality is provided by  Rock, a library that packages up some functionality for creating query-based compilers.\n  Rock is an experimental library heavily inspired by  Shake and the  Build systems à la carte paper. It essentially implements a build system framework, like  make.\n Build systems have a lot in common with modern compilers since we want them to be incremental, i.e. to take advantage of previous build results when building anew with few changes. But there&#39;s also a difference: Most build systems don&#39;t care about the  types of their queries since they work at the level of files and file systems.\n Build systems à la carte is closer to what we want. There the user writes a bunch of computations,  tasks, choosing a suitable type for keys and a type for values. The tasks are formulated assuming they&#39;re run in an environment where there is a function  fetch of type  Key -&gt; Task Value, where  Task is a type for describing build system rules, that can be used to fetch the value of a dependency with a specific key. In our above example, the key type might look like this:\n  The build system has control over what code runs when we do a  fetch, so by varying that it can do fine-grained dependency tracking, memoisation, and incremental updates.\n Build systems à la carte is also about exploring what kind of build systems we get when we vary what  Task is allowed to do, e.g. if it&#39;s a  Monad or  Applicative. In Rock, we&#39;re not exploring  that, so our  Task is a thin layer on top of  IO.\n A problem that pops up now, however, is that there&#39;s no satisfactory type for  Value. We want  fetch (ParsedModuleKey &#34;Data.List&#34;) to return a  ParsedModule, while  fetch (TypeKey &#34;Data.List.map&#34;) should return something of type  Type.\n  Rock allows us to index the key type by the return type of the query. The  Key type in our running example becomes the following  GADT:\n data  Key a  where    ParsedModuleKey  ::  ModuleName  -&gt;  Key  ParsedModule    ResolvedModuleKey  ::  ModuleName  -&gt;  Key  ResolvedModule    TypeKey  ::  QualifiedName  -&gt;  Key  Type\n The  fetch function gets the type  forall a. Key a -&gt; Task a, so we get a  ParsedModule when we run  fetch (ParsedModuleKey &#34;Data.List&#34;), like we wanted, because the return type depends on the key we use.\n Now that we know what  fetch should look like, it&#39;s also worth revealing what the  Task type looks like in Rock, more concretely. As mentioned, it&#39;s a thin layer around  IO, providing a way to  fetch  keys (like  Key above):\n newtype  Task key a  =  Task {  unTask ::  ReaderT ( Fetch key)  IO a }   newtype  Fetch key  =  Fetch ( forall a . key a  -&gt;  IO a)\n The rules of our compiler, i.e. its &#34;Makefile&#34;, then becomes the following function, reusing the functions from above:\n rules ::  Key a  -&gt;  Task a  rules key  =  case key  of    ParsedModuleKey moduleName  -&gt;   fetchParsedModule moduleName      ResolvedModuleKey moduleName  -&gt;   fetchResolvedModule moduleName      TypeKey qualifiedName  -&gt;   fetchType qualifiedName\n  The most basic way to run a  Task in Rock is to directly call the  rules function when a  Task fetches a key. This results in an inefficient build system that recomputes every query from scratch.\n But the  Rock library lets us layer more functionality onto our  rules function, and one thing that we can add is memoisation. If we do that Rock caches the result of each fetched key by storing the key-value pairs of already performed fetches in a  dependent hashmap. This way, we perform each query at most once during a single run of the compiler.\n  Another kind of functionality that can be layered onto the  rules function is incremental updates. When it&#39;s used, Rock keeps a track of what dependencies a task used when it was executed (much like Shake) in a table, i.e. what keys it fetched and what the values were. Using this information it&#39;s able to determine when it&#39;s safe to reuse the cache  from a previous run of the compiler even though there might be changes in other parts of the dependency graph.\n This fine-grained dependency tracking also allows reusing the cache when a dependency of a task changes in a way that has no effect. For example, whitespace changes might trigger a re-parse, but since the AST is the same, the cache can be reused in queries that depend on the parse result.\n  Verifying dependencies can be too slow for real-time tooling like language servers, because large parts of the dependency graph have to be traversed just to check that most of it is unchanged even for tiny changes.\n For example, if we make changes to a source file with many large imports, we need to walk the dependency trees of all of the imports just to update the editor state for that single file. This is because dependency verification by itself needs to walk all the way to the root queries for all the dependencies of a given query, which can often be a large proportion of the whole dependency tree.\n To fix this, Rock can also be made to track  reverse dependencies between queries. When e.g. a language server detects that a single file has changed, the reverse dependency tree is used invalidate the cache just for the queries that depend on that file by walking the reverse dependencies starting from the changed file.\n Since the imported modules don&#39;t depend on that file, they don&#39;t need re-checked, resulting in much snappier tooling!\n  Most modern languages need to have a strategy for tooling, and building compilers around query systems seems like an extremely promising approach to me.\n With queries the compiler writer doesn&#39;t have to handle updates to and invalidation of a bunch of ad-hoc caches, which can be the result when adding incremental updates to a traditional compiler pipeline. In a query-based system it&#39;s all handled centrally once and for all, which means there&#39;s less of a chance it&#39;s wrong.\n Queries are excellent for tooling because they allow us to ask for the value of any query at any time without worrying about order or temporal effects, just like a well-written Makefile. The system will compute or retrieve cached values for the query and its dependencies automatically in an incremental way.\n Query-based compilers are also surprisingly easy to parallelise. Since we&#39;re allowed to make any query at any time, and they&#39;re memoised the first time they&#39;re run, we can fire off queries in parallel without having to think much. In Sixty, the default behaviour is for all input modules to be type checked in parallel.\n Lastly, I hope that this post will have inspired you to use a query-based compiler architecture, and given you an idea of how it can be done.", "posttime": "2020-06-26 05:18:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编译,编译器,based,类型", "title": "基于查询的编译器体系结构", "title_en": "Query-Based Compiler Architectures", "transed": 1, "url": "https://ollef.github.io/blog/posts/query-based-compilers.html", "via": "", "real_tags": ["编译", "编译器", "based", "类型"]}, {"category": "", "categoryclass": "", "imagename": "527b0695f24fe69fa4af2dddf2528470.png", "infoid": 1008285, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "$\\Beginggroup$每个人在讨论信号处理时都会讨论傅里叶变换。为什么它对信号处理如此重要？它告诉我们关于信号的什么信息？\n它是只适用于数字信号处理，还是也适用于模拟信号？\n$\\结束组$。\n$\\Begingroup$最近在Math.SE上重新开始了一场关于傅立叶变换的讨论，我认为这个网站上的人们可能会觉得其中一些是值得的，甚至可能想要参与其中。$\\endgroup$-Dilip Sarwate。\n$\\BEGINGROUP$cf.。这个答案有很好的历史背景。傅立叶级数至少可以追溯到托勒密的周天文学。增加更多的偏心率和本轮，类似于给傅立叶级数增加更多的项，就可以解释天空中物体的任何连续运动。$\\endgroup$-1菌血症。\n这是一个相当广泛的问题，确实很难准确指出为什么傅立叶变换在信号处理中很重要。我们能提供的最简单的答案是，它是一种极其强大的数学工具，允许您在不同的领域查看信号，在不同的领域内，几个困难的问题变得非常容易分析。\n它几乎无处不在，几乎在工程和物理科学的每一个领域，都是出于不同的原因，这使得缩小一个原因变得更加困难。我希望，看看它的一些导致它被广泛采用的特性，加上一些实际例子和一点历史，可能会帮助人们理解它的重要性。\n要理解傅立叶变换的重要性，重要的是退一步，欣赏约瑟夫·傅立叶提出的傅立叶级数的威力。在坚果壳中，区域$\\mathcal{D}=[-\\pi，\\pi]$上的任何周期函数$g(X)$可积可表示为正弦和余弦的无穷和\n$e^{\\imath\\theta}=\\cos(\\theta)+\\jmath\\sin(\\theta)$.。函数可以分解为其组成频率(即所有频率的正弦和余弦)的想法非常强大，并构成了傅立叶变换的主干。\n傅里叶变换可以看作是上述傅里叶级数到非周期函数的扩展。为完整和清楚起见，我将在这里定义傅里叶变换。如果$x(T)$是连续的可积信号，则其傅立叶变换$X(F)$由下式给出。\n首先，也是最重要的，信号的傅里叶变换告诉您信号中存在的频率和比例。\n例如：你有没有注意到，当你在通话过程中按下每个号码键时，每个数字键的声音都不同，而且每个型号的电话听起来都是一样的？这是因为它们每个都由两个不同的正弦组成，这两个正弦可以用来唯一地识别按钮。当你用手机输入组合来导航菜单时，对方知道你按了什么键的方式是通过对输入进行傅立叶变换并查看存在的频率。\n除了一些非常有用的基本性质使所涉及的数学变得简单之外，它在信号处理中具有如此广泛的重要性的其他一些原因是：\n傅立叶变换的幅值平方，$\\vert X(F)\\vert^2$立即告诉我们信号$x(T)$在特定频率$f$有多少功率。\n根据Parseval定理(更一般的Plancherel定理)，我们有$$int_\\mathbb{R}\\vert x(T)\\vert^2\\dt=int_\\mathbb{R}\\vert X(F)\\vert^2\\df$$，这意味着信号中所有时间的总能量等于所有频率上变换的总能量。因此，变换是能量守恒的。\n时域中的卷积等价于频域中的乘法，即给定两个信号$x(T)$和$y(T)$，则如果\n对于离散信号，随着高效FFT算法的发展，几乎总是在频域实现卷积运算比在时域实现卷积运算更快。\n与卷积运算类似，互相关也很容易在频域实现为$Z(F)=X(F)^*Y(F)$，其中$^*$表示复共轭。\n通过能够将信号分割成它们的组成频率，人们可以很容易地通过取消它们的贡献来选择性地屏蔽某些频率。\n例句：如果你是一个足球迷，你可能会对2010年南非世界杯期间持续不断的呜呜祖拉声感到恼火，这种嗡嗡声几乎淹没了所有的评论。然而，呜呜祖拉拥有~235 Hz的恒定音调，这使得广播公司很容易实施陷波滤波器来切断令人不快的噪音。[1]。\n时域中的移位(延迟)信号表现为频域中的相变。虽然这属于基本属性类别，但这是实践中广泛使用的属性，特别是在成像和层析成像应用中，\n当波在非均匀介质中传播时，它会根据波在介质中传播速度的变化而减速和提速。因此，通过观察预期和测量到的相位变化，可以推断出多余的时间延迟，进而告诉你介质中的波速发生了多大变化。当然，这是一个非常简单的外行解释，但却构成了断层成像的基础。\n傅立叶变换理论适用于信号是连续的还是离散的，只要它是好的并且是绝对可积的。所以，是的，只要信号满足这个标准，ASP就使用傅里叶变换。然而，在ASP中，可能更常见的是讨论拉普拉斯变换，它是一种广义的傅立叶变换。拉普拉斯变换定义为。\n优点是不一定像傅立叶变换那样局限于良好的信号，但变换仅在特定的收敛区域内有效。它被广泛用于研究/分析/设计LC/RC/LCR电路，而这些电路又用于收音机/电吉他、瓦瓦踏板等。\n这几乎是我现在所能想到的全部，但是请注意，再多的写作/解释也不能完全捕捉到傅立叶变换在信号处理和科学/工程中的真正重要性。\n$\\结束组$。\n$\\BEGINGROUP$给出了一些使用FT及其性质的现实世界应用的很好的答案。+1.$\\endgroup$-1黄金均值。\n我并没有说傅立叶变换是第一个，只是说它很强大。请注意，泰勒级数并不是组成频率的展开式。例如，$\\sin(\\alphax)$的泰勒级数约$$是$\\alphax-\\alpha^3x^3/3！+\\alpha^5x^5/5！\\ldots$，而$\\sin(\\alphax)$的傅立叶变换是$\\left[\\delta(\\omega-\\alpha)-\\delta(\\omega+\\alpha)\\right]/(2\\jmath)$(给定或取一些归一化因子)。后者是正确的频率表示，所以我不确定这里是否适合与泰勒级数进行比较。$\\endgroup$-Lorem Ipsum。\n$\\Begingroup$当我开始阅读此回复时，不知何故，我知道@Yoda在我向下滚动查看它到底是谁之前写下了它=)$\\endgroup$-1 phon。\n$\\Begingroup$详细说明#3：卷积是将滤镜应用于图像时所做的操作，例如平均滤镜或高斯滤镜(虽然您可以对非线性滤镜进行傅立叶变换)。$\\endgroup$-1 Jonas。\n彼得·K的观点真的很关键。信号可以相对于许多不同的碱基来表示。正弦和余弦是LTI系统的特征函数，所以它们是特殊的。$\\endgroup$-nnibot。\n$\\Begingroup$Lorem Ipsum的伟大答案遗漏了一件事：傅立叶变换将信号分解成组成复数的指数：\n简而言之，如果一个系统$H$是线性的，并且是时间不变的，那么它对复指数的响应将是一个具有相同频率但(可能)不同相位的复指数，$\\φ$，和振幅$A$，-并且振幅可以是零：\n$\\结束组$。\n$\\Begingroup$@Peter K我认为，遵循关于答案(学术)正确性的选择哲学，你的答案应该被整合到由Lorem Ipsum提供的上述答案中，尽管Lorem Ipsum被用户选为96分的答案，但它缺乏这一非常重要的观点。$\\endgroup$-1 FAT32。\n$\\Begingroup$@Peter很抱歉以此请求打扰您，但您是1)版主，2)您的名字与您的波束成形标签一起出现在活动用户列表中。你能给出一个简短的意见吗？Math.SE的这个帖子在这里会不会很受欢迎？我不确定DSP.SE、Math.SE还是EE.SE中哪一个最有可能帮助那个提问者。我正在考虑迁移(作为Math.SE版主我可以做到)。$\\endgroup$-Jyrki Lahtonen。\n$\\egingroup$@peter K.，请重新打开问题，地址是：dsp.stackexchange.com/Questions/37468。我把它修好了。谢谢。$\\endgroup$-1罗伊。\n$\\BEGINGROUP$Peter(为什么有些人可以用@接近，有些人不能？这个选项在哪里？)，似乎有人打开了它。谢谢。$\\endgroup$-1罗伊。\n由于其线性时间复杂度(具体地说，是FFT的时间复杂度)，它的速度很快(例如，对于卷积很有用)。我会争辩说，如果不是这样，我们很可能会在时域做更多的事情，而在傅立叶域做的更少。\n为了给出一个具体的例子说明它是如何工作的，假设您将两个多项式相乘，$a_0x^0+a_1x^1+\\ldots+a_nx^n$和$b_0x^0+b_1x^1+\\ldots+b_nx^n$。\n如果您要幼稚地执行此操作(使用箔片方法)，您将需要大约$n^2$算术运算(给定或取一个常数因子)。\n然而，我们可以做一个看似平凡的观察：为了将两个多项式相乘，我们不需要压制系数。取而代之的是，我们可以简单地在(足够的)点数处计算多项式，对评估的值进行逐点相乘，然后进行插值以返回结果。\n这有什么用呢？毕竟，每个多项式都有$n$项，如果我们用$2n$点来计算每个多项式，仍然会导致$\\\\约n^2$运算，所以它似乎没有什么帮助。\n但是，如果我们做得正确，它就会发生！如果我们在正确的点上求值，那么一次在多个点上计算一个多项式比在这些点上单独求值要快。正确的分数是什么？\n事实证明，这些都是团结的根源(即所有复数$z$，使得$z^n=1$)。如果我们选择在单位根处计算多项式，那么很多表达式都将是相同的(因为许多单项式将被证明是相同的)。这意味着我们可以只做一次他们的算术，然后重复使用它来计算所有其他点的多项式。\n我们可以做一个非常类似的过程，通过点的插值，得到结果的多项式系数，只需使用单位根的倒数。\n这里显然跳过了很多数学运算，但实际上，FFT基本上就是我刚才描述的算法，用来计算和插值多项式。正如我所展示的，它的用途之一是用比正常少得多的时间来乘多项式。结果证明，这节省了大量的工作，将运行时间降低到与$n\\logn$成正比(即线性)，而不是$n^2$(二次)。\n因此，能够使用快速傅立叶变换来执行一个典型的运算(如多项式乘法)要快得多是什么使它有用，这也是为什么人们现在对麻省理工学院稀疏快速傅立叶变换算法的新发现感到兴奋。\n$\\结束组$。\n$\\Beginggroup$什么是线性时间复杂度？我不会否决这个答案，但我不认为它会给这个关于傅立叶变换的讨论增加任何有价值的东西。$\\endgroup$-Dilip Sarwate。\n$\\egingroup$@DilipSarwate我怀疑他在用它作为O(n*log(N))的简写。$\\endgroup$-1吉姆·克莱。\n$\\Begingroup$@DilipSarwate：吉姆是对的。它与(离散的)傅立叶变换有关。如果没有FFT，您的傅立叶变换将花费与输入大小的平方成比例的时间，这将使它们的用处大大降低。但是使用FFT，它们花费的时间与输入的大小成比例(乘以其对数)，这使得它们更有用，这加快了大量计算的速度。另外，这可能是一本有趣的读物。$\\endgroup$-n用户541686。\n$\\BEGINGROUP$您应该提到为什么它很快。它的速度在哪里，我们为什么要关心它的速度？$\\endgroup$-1Cyberman。\n$\\BEGINGROUP$我认为这个答案是合理的。应该解释一下，除了其他人的回答中解释的所有好的特性之外，FFT还允许它成为实时应用程序中的一种可行的方法。$\\endgroup$--Andrey Rubshtein。\n除了彼得的答案之外，还有另一个原因也与本征函数有关。$e^{kx}$是微分算子$\\frac{d^n}{dx^n}$的本征函数。这就是为什么可以使用傅立叶变换(对应于纯虚数$k$)和拉普拉斯变换(对应于复数$k$)来求解微分方程。\n由于$e^{kx}$是卷积算子和微分算子的特征函数，这可能是LSIV系统可以用微分方程表示的原因之一。\n编辑：事实上，微分(和积分)运算符都是LSIV运算符，请看这里。\n$\\结束组$。\n$\\Begingroup$本帖子中的其他一些答案对傅立叶变换的定义和性质进行了很好的数学讨论；作为一名音频程序员，我只想提供我个人的直觉，说明为什么它对我很重要。\n傅立叶变换使我能够回答有关声音的问题，这些问题很难或不可能用其他方法来回答。它使难题变得容易。\n录音包含一套三个音符。音符是什么？如果随着时间的推移将录音保留为一组振幅，这不是一个容易的问题。如果你随着时间的推移将录音转换成一组频率，这真的很容易。\n我想改变录音的音高而不改变其持续时间。我该怎么做呢？这是可能的，但不容易做到，仅仅通过操纵输入信号的幅度。但是，如果你知道构成信号的频率，那就很容易了。\n这段录音是包含语音还是包含音乐？仅使用基于振幅的方法很难做到这一点。但是，基于傅立叶变换及其族，几乎所有时候都有很好的解决方案可以猜测出正确的答案。\n几乎每一个你想问的关于数字录音的问题都可以通过使用离散版本的傅立叶变换来变换录音而变得更容易。\n实际上，每个现代数字音频设备都严重依赖于与傅里叶变换非常相似的功能。\n再说一次，请原谅高度非正式的描述；这只是我个人关于为什么傅立叶变换很重要的直觉。\n$\\结束组$。\n$\\Beginggroup$嗨，约翰，我有一个愚蠢的问题。我想计算TWA(osha.gov/pls/oshaweb/…)。从我们在工作场所录制的声音来看，如果我在分析音频文件时使用傅立叶变换，我想知道是否可以更精确地测量这个值。$\\endgroup$-侯赛因·萨沙尔。\n$\\Beginggroup$除非已校准麦克风和录音环境，否则不会。$\\endgroup$-1 johnwbyrd。\n$\\BEGINGROUP$其他人给出了很好的、有用的答案。只要想一想一些信号：你只关心它的频率(和它们的相位)，而不是时域。我不知道这是最终的还是完整的答案，但这只是傅立叶变换有用的另一个原因。\n当你有一些信号时，它可以由无限(或接近)的频率组成，这取决于你的采样率。但是，事实并非如此：我们知道大多数信号的频率是最少的，或者我们正在以足够高的速率进行采样。\n如果我们知道这一点，为什么我们不能使用它呢？这就是压缩传感领域所做的事情。他们知道最有可能的信号是误差最小、频率最低的信号。因此，它们将相对于我们的测量和傅里叶变换的幅度的总体误差最小化。\n几个频率的信号通常有一个最小的傅立叶变换，或者大部分是零(也就是他们在压缩感测中所说的稀疏)。例如，一个频率的信号仅具有作为变换的增量函数。\n在这里，我们要做的就是最小化误差(第一组$||\\cdot||$)和最小化傅立叶变换(第二组$||\\cdot||$)。在这里，我们有。\n你可能还记得奈奎斯特说过，你必须以两倍的最高频率测量，才能获得良好的表现。这是假设你的信号中有无限的频率。我们可以渡过这个难关的！\n压缩感测领域可以重构在某些域中大部分为零(或稀疏)的任何信号。嗯，这就是傅立叶变换的情况。\n$\\结束组$。\n傅立叶变换的主要意义在于系统分析。我们宇宙的主要成分是真空，真空是场的基本线性和时不变的载体：不同的场通过将各自的矢量相加而叠加，无论你何时重复某些场的应用，结果都是一样的。\n因此，许多也涉及物理物质的系统在很好的近似下表现为线性的、时不变的系统。\n这样的LTI系统可以用它们的脉冲响应来描述，而对任何时间分布的信号的响应都可以通过将信号与脉冲响应卷积来描述。\n卷积是一种交换和结合运算，但在计算和概念上也相当昂贵。然而，函数的卷积通过傅里叶变换映射成分段乘法。\n这意味着，经过傅立叶变换后，线性时不变系统及其组合的性质得到了更好的描述和处理。\n因此，像频率响应这样的东西对于描述许多系统的行为是很有特色的，并且变得对描述它们很有用。\n快速傅立叶变换与傅立叶变换几乎但不完全不同，因为它们的结果并不能真正合理地解释为傅立叶变换，尽管它们在理论上是坚定的。只有在讨论具有变换间隔周期的采样信号时，它们才完全对应于傅立叶变换。特别是，周期性标准几乎总是不能满足。\n有几种技术可以解决这个问题，比如使用重叠窗口函数。\n然而，FFT在做正确的事情时可以用来做离散时间卷积，而且它是一种有效的算法，使得它在很多事情上都是有用的。\n人们还可以将基本的FFT算法用于数论变换(它在离散数域而不是复杂的实数域中工作)，以便进行快速卷积，就像乘以大数或多项式一样。在这种情况下，基本上对于任何输入，频域和白噪声都是无法区分的，并且在您这样做之前没有有用的解释。\n..", "note_en": "$\\begingroup$  Everyone discusses the Fourier transform when discussing signal processing. Why is it so important to signal processing and what does it tell us about the signal?\n Does it only apply to digital signal processing or does it apply to analog signals as well?\n      $\\endgroup$\n  $\\begingroup$  Recently a  discussion about Fourier transforms was revived on math.SE, and I thought that people on this site might find some of it worthwhile, and might even want to participate.  $\\endgroup$\r–  Dilip Sarwate\n  $\\begingroup$  cf.   this answer for some excellent historical background. Fourier series date at least as far back as  Ptolemy&#39;s epicyclic astronomy. Adding more eccentrics and epicycles, akin to adding more terms to a Fourier series, one can account for  any continuous motion of an object in the sky.  $\\endgroup$\r–  Geremia\n  $\\begingroup$  This is quite a broad question and it indeed is quite hard to pinpoint  why exactly Fourier transforms are important in signal processing. The simplest, hand waving answer one can provide is that it is an  extremely powerful mathematical tool that allows you to view your signals in a different domain, inside which several difficult problems become very simple to analyze.\n Its ubiquity in nearly every field of engineering and physical sciences, all for different reasons, makes it all the more harder to narrow down a reason. I hope that looking at some of its properties which led to its widespread adoption along with some practical examples and a dash of history might help one to understand its importance.\n  To understand the importance of the Fourier transform, it is important to step back a little and appreciate the power of the Fourier series put forth by Joseph Fourier. In a nut-shell, any periodic function $g(x)$ integrable on the domain $\\mathcal{D}=[-\\pi,\\pi]$ can be written as an infinite sum of sines and cosines as\n  where $e^{\\imath\\theta}=\\cos(\\theta)+\\jmath\\sin(\\theta)$.  This idea that a function could be broken down into its constituent frequencies (i.e., into sines and cosines of all frequencies) was a powerful one and forms the backbone of the Fourier transform.\n  The Fourier transform can be viewed as an extension of the above Fourier series to non-periodic functions. For completeness and for clarity, I&#39;ll define the Fourier transform here. If $x(t)$ is a continuous, integrable signal, then its Fourier transform, $X(f)$ is given by\n     First and foremost, a Fourier transform of a signal tells you  what frequencies are present in your signal and in what proportions.\n Example: Have you ever noticed that each of your phone&#39;s number buttons sounds different when you press during a call and that it sounds the same for every phone model? That&#39;s because they&#39;re each composed of two different sinusoids which can be used to uniquely identify the button. When you use your phone to punch in combinations to navigate a menu, the way that the other party knows what keys you pressed is by doing a Fourier transform of the input and looking at the frequencies present.\n Apart from some very useful  elementary properties which make the mathematics involved simple, some of the other reasons why it has such a widespread importance in signal processing are:\n The magnitude square of the Fourier transform, $\\vert X(f)\\vert^2$ instantly tells us how much power the signal $x(t)$ has at a particular frequency $f$.\n From Parseval&#39;s theorem (more generally Plancherel&#39;s theorem), we have $$\\int_\\mathbb{R}\\vert x(t)\\vert^2\\ dt = \\int_\\mathbb{R}\\vert X(f)\\vert^2\\ df$$which means that  the total energy in a signal across all time is equal to the total energy in the transform across all frequencies. Thus, the transform is energy preserving.\n Convolutions in the time domain are equivalent to multiplications in the frequency domain, i.e., given two signals $x(t)$ and $y(t)$, then if\n   For discrete signals, with the development of efficient FFT algorithms, almost always, it is faster to implement a convolution operation in the frequency domain than in the time domain.\n Similar to the convolution operation, cross-correlations are also easily implemented in the frequency domain as $Z(f)=X(f)^*Y(f)$, where $^*$ denotes complex conjugate.\n By being able to split signals into their constituent frequencies, one can easily block out certain frequencies selectively by nullifying their contributions.\n Example: If you&#39;re a football (soccer) fan, you might&#39;ve been annoyed at the constant drone of the vuvuzelas that pretty much drowned all the commentary during the 2010 world cup in South Africa. However, the vuvuzela has a constant pitch of ~235Hz which made it easy for broadcasters to implement a notch filter to cut-off the offending noise.  [1]\n A shifted (delayed) signal in the time domain manifests as a phase change in the frequency domain. While this falls under the elementary property category, this is a widely used property in practice, especially in imaging and tomography applications,\n Example: When a wave travels through a heterogenous medium, it slows down and speeds up according to changes in the speed of wave propagation in the medium. So by observing a change in phase from what&#39;s expected and what&#39;s measured, one can infer the excess time delay which in turn tells you how much the wave speed has changed in the medium. This is of course, a very simplified layman explanation, but forms the basis for tomography.\n  The theory of Fourier transforms is applicable irrespective of whether the signal is continuous or discrete, as long as it is &#34;nice&#34; and absolutely integrable. So yes, ASP uses Fourier transforms as long as the signals satisfy this criterion. However, it is perhaps more common to talk about Laplace transforms, which is a generalized Fourier transform, in ASP. The Laplace transform is defined as\n  The advantage is that one is not necessarily confined to &#34;nice signals&#34; as in the Fourier transform, but the transform is valid only within a certain region of convergence. It is widely used in studying/analyzing/designing LC/RC/LCR circuits, which in turn are used in radios/electric guitars, wah-wah pedals, etc.\n  This is pretty much all I could think of right now, but do note that  no amount of writing/explanation can fully capture the true importance of Fourier transforms in signal processing and in science/engineering\n    $\\endgroup$\n  $\\begingroup$  Nice answer in giving some realworld application using FT and its properties. +1.  $\\endgroup$\r–  goldenmean\n  $\\begingroup$  @endolith I didn&#39;t say the Fourier transform was first, just that it is  powerful. Note that a Taylor series is  not an expansion in terms of the constituent frequencies. For e.g., the Taylor series of $\\sin(\\alpha x)$ about $0$ is $\\alpha x-\\alpha^3x^3/3!+\\alpha^5x^5/5!\\ldots$, whereas the Fourier transform of $\\sin(\\alpha x)$ is $\\left[\\delta(\\omega-\\alpha)-\\delta(\\omega+\\alpha)\\right]/(2\\jmath)$ (give or take some normalization factors). The latter is the correct frequency representation, so I&#39;m not sure if any comparisons with Taylor series is apt here.  $\\endgroup$\r–  Lorem Ipsum\n  $\\begingroup$  When I started reading this response, somehow I knew @yoda wrote it before I scrolled down to see who it actually was = )  $\\endgroup$\r–  Phonon\n  $\\begingroup$  To elaborate on #3: Convolution is what you do when you apply a filter to an image, such as an average filter, or a Gaussian filter (though you can&#39;t Fourier-transform non-linear filters).  $\\endgroup$\r–  Jonas\n  $\\begingroup$  Peter K&#39;s point is really critical. Signals can be represented with respect to  many different bases. Sines and cosines are special because they are the eigenfunctions of LTI systems.  $\\endgroup$\r–  nibot\n      $\\begingroup$  Lorem Ipsum&#39;s great answer misses one thing: The Fourier transform decomposes signals into constituent complex exponentials:\n   Put simply, if a system, $H$ is linear and time-invariant, then its response to a complex exponential will be a complex exponential of the same frequency but (possibly) different phase, $\\phi$, and amplitude, $A$, --- and the amplitude may be zero:\n    $\\endgroup$\n  $\\begingroup$  @Peter K. I think that following the philosophy of choice on the (academic) correctness over &#34;popularity&#34; of an answer, your answer should be be integrated into the above answer provideded by Lorem Ipsum, which despite being selected as the answer with 96 points by the users, lacks this very important point of view.  $\\endgroup$\r–  Fat32\n  $\\begingroup$  @Peter Sorry to disturb you with this request, but you are 1) a moderator, 2) your name appeared on the list of users &#34;active&#34; with your beamforming tag. Can you give a quick opinion whether  this post in Math.SE would be well received here? I am not sure, whether DSP.SE, Math.SE or EE.SE has the best chance of helping that asker. I am considering migration (which I can do as a Math.SE moderator).  $\\endgroup$\r–  Jyrki Lahtonen\n  $\\begingroup$  @Peter K., Could you please reopen the question at:  dsp.stackexchange.com/questions/37468. I fixed it. Thank You.  $\\endgroup$\r–  Royi\n    $\\begingroup$  Peter (How come some people can be approached using  @ and some can&#39;t? Where is the option for that?), It seems someone opened it. Thank You.  $\\endgroup$\r–  Royi\n    $\\begingroup$  It&#39;s  fast (e.g. useful for convolution), due to its  linearithmic time complexity (specifically, that of the  FFT). I would argue that, if this were not the case, we would probably be doing a lot more in the time domain, and a lot less in the Fourier domain.\n   To give an concrete example of how it works, suppose you were multiplying two polynomials,  $a_0 x^0 + a_1 x^1 + \\ldots + a_nx^n$ and  $b_0 x^0 + b_1 x^1 + \\ldots + b_nx^n$.\n If you were to do this naively (using the  FOIL method), you would need approximately  $n^2$ arithmetic operations (give or take a constant factor).\n However, we can make a seemingly mundane observation: in order to multiply two polynomials,  we don&#39;t need to FOIL the coefficients. Instead, we can simply  evaluate the polynomials at a (sufficient) number of points, do a  pointwise multiplication of the evaluated values, and then  interpolate to get back the result.\n Why is that useful? After all, each polynomial has  $n$ terms, and if we were to evaluate each one at  $2n$ points, that would still result in  $\\approx n^2$ operations, so it doesn&#39;t seem to help.\n But it does, if we do it correctly! Evaluating a single polynomial at  many points at once is  faster than evaluating it at those points individually,  if we evaluate at the &#34;right&#34; points. What are the &#34;right&#34; points?\n It turns out those are the roots of unity (i.e. all complex numbers  $z$ such that  $z^n = 1$). If we choose to evaluate the polynomial at the roots of unity, then a lot of expressions will turn out the same (because a lot of monomials will turn out to be the same). This means we can do their arithmetic  once, and re-use it thereafter for evaluating the polynomial at all the other points.\n We can do a very similar process for interpolating through the points to get back the polynomial coefficients of the result, just by using the  inverse roots of unity.\n There&#39;s obviously a lot of math I&#39;m skipping here, but effectively, the FFT is basically the algorithm I just described, to evaluate and interpolate the polynomials. One of its uses, as I showed, was to multiply polynomials in a lot less time than normal.It turns out that this saves a tremendous amount of work, bringing down the running time to being proportional to  $n \\log n$ (i.e. linearithmic) instead of  $n^2$ (quadratic).\n Thus the ability to use the FFT to perform a typical operation (such as polynomial multiplication) much faster is what makes it useful, and that is also why people are now excited by MIT&#39;s new discovery of the  Sparse FFT algorithm.\n    $\\endgroup$\n  $\\begingroup$  What is linearithmic time complexity? I won&#39;t downvote this answer but I don&#39;t think it adds anything of value to this discussion on Fourier  transforms.  $\\endgroup$\r–  Dilip Sarwate\n  $\\begingroup$  @DilipSarwate I suspect he&#39;s using it as shorthand for O(n*log(n)).  $\\endgroup$\r–  Jim Clay\n  $\\begingroup$  @DilipSarwate: Jim is right. It has  everything to do with (discrete) Fourier transforms. Without the FFT, your Fourier transforms would take time proportional to the  square of the input size, which would make them a lot less useful. But with the FFT, they take time proportional the size of the input (times its logarithm), which makes them much more useful, and which speeds up a lot of calculations. Also  this might be an interesting read.  $\\endgroup$\r–  user541686\n  $\\begingroup$  You should mention WHY its fast. Where its fast and why do we care that its fast?  $\\endgroup$\r–  CyberMen\n  $\\begingroup$  I think that this answer is legitimate. It should be paraphrased - &#34;Beside all the nice characteristics explained in other peoples answer, FFT allows it to become a feasible approach in real-time applications&#34;.  $\\endgroup$\r–  Andrey Rubshtein\n      $\\begingroup$  Additional to Peter&#39;s answer, there is another reason which is also related to the eigenfunction. That&#39;s, $e^{kx}$ is the eigenfunction of the differential operator $\\frac{d^n}{dx^n}$. That&#39;s why Fourier transform (corresponding to pure imaginary $k$) and Laplace transform (corresponding to complex $k$) can be used to solve differential equations.\n Since $e^{kx}$ is the eigenfunction of both convolution and differential operator, maybe that&#39;s one the of the reasons why LSIV system can be represented by differential equations.\n EDIT: As a matter of fact, differential (and integral) operators are LSIV operators, see  here.\n    $\\endgroup$\n    $\\begingroup$  Some of the other answers in this thread have excellent mathematical discussions of the definition and properties of the Fourier transform; as an audio programmer, I merely want to provide my own personal intuition as to  why it&#39;s important to me.\n The Fourier transform permits me to answer questions about a sound that are difficult or impossible to answer with other methods. It makes hard problems easy.\n A recording contains a set of three musical notes. What are the notes? If you leave the recording as a set of amplitudes over time, this is not an easy problem. If you convert the recording to a set of frequencies over time, it&#39;s really easy.\n I want to change the pitch of a recording without changing its duration. How do I do this? It&#39;s possible, but not easy to do, by just manipulating the amplitude of an input signal. But it&#39;s easy if you know the frequencies that comprise the signal.\n Does this recording contain speech or does it contain music? Super hard to do using only amplitude-based methods. But there are good solutions that guess the right answer nearly all of the time based on the Fourier transform and its family.\n Almost every question you&#39;d like to ask about a digital audio recording is made easier by transforming the recording using a discrete version of the Fourier transform.\n In practice,  every modern digital audio device relies heavily on functions very similar to the Fourier transform.\n Again, forgive the highly informal description; this is merely my personal intuition as to  why the Fourier transform is important.\n    $\\endgroup$\n  $\\begingroup$  Hey John, I have a silly question. I want to calculate the TWA ( osha.gov/pls/oshaweb/…) from the sound we recorded in a workplace, I wonder if I could measure this value more precisely if I employ Fourier Transformation in analyzing my audio file.  $\\endgroup$\r–  Hossein Sarshar\n  $\\begingroup$  Not unless the microphone and the recording environment were calibrated, no.  $\\endgroup$\r–  johnwbyrd\n    $\\begingroup$  The other people have given great, useful answers. Just think about some signal: you only care what frequencies are in it (and their phase), not about the time domain.  I do not know that this is a final or complete answer, but just another reason why the Fourier transform is useful.\n When you have some signal, it could be composed of an infinite (or close to) number of frequencies, depending on your sampling rate. But, that&#39;s not the case: we know that most signals have the fewest number of frequencies possible, or that we&#39;re sampling at a high enough rate.\n If we know that, why can&#39;t we use it? That&#39;s what the field of compressed sensing does. They know that the most likely signal is one that has the least error and has the fewest frequencies. So, they minimize the overall error relative to our measurements as well as the magnitude of the Fourier transform.\n A signal of a few frequencies often has a minimal Fourier transform, or mostly zeros (aka &#34;sparse,&#34; as they say in compressed sensing). A signal of one frequency just has a delta function as the transform, for example.\n   Here, all we&#39;re doing is minimizing the error (first set of $||\\cdot||$) and minimizing the Fourier transform (second set of $||\\cdot||$). Here, we have\n  You may recall that Nyquist said that you have to measure at twice the highest frequency to get a good representation. Well, that was assuming you had infinite frequencies in your signal. We can get past that!\n The field of compressed sensing can reconstruct any signal that&#39;s mostly zeros (or sparse) in some domain. Well, that&#39;s the case for the Fourier transform.\n    $\\endgroup$\n    $\\begingroup$  The main importance of the Fourier transform lies with system analysis. The main constituent of our universe is vacuum, and vacuum is a fundamentally linear and time-invariant carrier of fields: different fields superimpose by adding their respective vectors, and regardless of when you repeat the application of certain fields, the outcome will be the same.\n As a consequence, a lot of systems also involving physical matter are to a good approximation behaving as linear, time-invariant systems.\n Such LTI systems can be described by their &#34;impulse response&#34;, and the response to any time-distributed signal is described by convolving the signal with the impulse response.\n Convolution is a commutative and associative operation, but it is also quite computationally and conceptually expensive. However, the convolution of functions is mapped by Fourier transform into piecewise multiplication.\n That means that the properties of linear time invariant systems and their combinations are much better described and manipulated after Fourier transformation.\n As a result, things like &#34;frequency response&#34; are quite characteristic for describing the behavior of a lot of systems and become useful for characterizing them.\n Fast Fourier transforms are in the &#34;almost, but not quite, entirely unlike Fourier transforms&#34; class as their results are not really sensibly interpretable as Fourier transforms though firmly routed in their theory. They correspond to Fourier transforms completely only when talking about a sampled signal with the periodicity of the transform interval. In particular the &#34;periodicity&#34; criterion is almost always not met.\n There are several techniques for working around that, like the use of overlapping windowing functions.\n However the FFT  can be employed for doing discrete-time convolution when doing things right, and is it is an efficient algorithm, that makes it useful for a lot of things.\n One can employ the basic FFT algorithm also for number theoretic transforms (which work in discrete number fields rather than complex &#34;reals&#34;) in order to do fast convolution, like when multiplying humongous numbers or polynomials. In this case, the &#34;frequency domain&#34; is indistinguishable from white noise for basically any input and has no useful interpretation before you do t\n......", "posttime": "2020-06-26 05:17:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "傅立叶,transform,变换", "title": "为什么傅立叶变换如此重要？", "title_en": "Why is the Fourier transform so important?", "transed": 1, "url": "https://dsp.stackexchange.com/questions/69/why-is-the-fourier-transform-so-important", "via": "", "real_tags": ["傅立叶", "transform", "变换"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008284, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "关于本页面，我们的系统检测到来自您的计算机网络的异常流量。该页面检查是否真的是您发送的请求，而不是机器人。为什么会发生这种事？当Google自动检测到来自您的计算机网络的请求似乎违反了服务条款时，会出现此页面。该块将在这些请求停止后不久过期。在此期间，解决上述验证码将让您继续使用我们的服务。此通信量可能是由恶意软件、浏览器插件或发送自动请求的脚本发送的。如果您共享网络连接，请向您的管理员寻求帮助-使用相同IP地址的不同计算机可能会负责。了解更多有时，如果您使用的是已知机器人使用的高级术语，或者发送请求非常迅速，则可能会要求您解决验证码问题。\nIP地址：207.46.138.74时间：2020-06-25T21：16：46Z网址：https://www.youtube.com/watch?v=DMUofMagmfc", "note_en": "About this page  Our systems have detected unusual traffic from your computer network. This page checks to see if it&#39;s really you sending the requests, and not a robot.  Why did this happen?   This page appears when Google automatically detects requests coming from your computer network which appear to be in violation of the  Terms of Service. The block will expire shortly after those requests stop. In the meantime, solving the above CAPTCHA will let you continue to use our services.  This traffic may have been sent by malicious software, a browser plug-in, or a script that sends automated requests. If you share your network connection, ask your administrator for help — a different computer using the same IP address may be responsible.  Learn more  Sometimes you may be asked to solve the CAPTCHA if you are using advanced terms that robots are known to use, or sending requests very quickly.\nIP address: 207.46.138.74 Time: 2020-06-25T21:16:46Z URL: https://www.youtube.com/watch?v=DMUofMagmfc", "posttime": "2020-06-26 05:16:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,raspberry-pi,苹果,arm64,silicon", "title": "苹果硅对树莓PI和ARM64意味着什么？", "title_en": "What Does Apple Silicon Mean for the Raspberry Pi and ARM64?", "transed": 1, "url": "https://www.youtube.com/watch?v=DMUofMagmfc", "via": "", "real_tags": ["apple", "苹果", "arm64", "silicon"]}, {"category": "", "categoryclass": "", "imagename": "7f878e88be3e79edc274b0ed33fbfcb2.jpg", "infoid": 1008282, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是维珍航空与Unity在新墨西哥州的Spaceport America发射设施进行的第二次这样的试飞，但与之前的飞行相比，这次飞行是在更高的高度和更高的速度进行的。这使得维珍现在可以从美国航天港转移到动力太空飞行-这是它在该设施的第一次，尽管Unity本身之前也曾以测试能力飞行，在2018年以超音速到达地球上空41.4英里的高度，进行了最令人印象深刻的演示。\n维珍银河于2018年在加利福尼亚州的莫哈韦航空航天港恢复了动力航天测试-四年前，该公司在测试Unity的前身VSS Enterprise时发生了致命的坠机事件。维珍航空那次航班的副驾驶迈克尔·阿尔斯伯里(Michael Alsbury)在那次事件中不幸遇难，飞行员彼得·西博尔德(Peter Siebold)受了重伤。\nUnity没有这样的问题，今天的无动力滑翔飞行似乎完全按照计划进行，为维珍提供了来自新墨西哥发射场的飞行条件和飞机/航天器行为的关键数据，该发射场最终也将服务于维珍银河的付费客户，作为他们前往太空边缘的旅游旅行的出发和返回地点。\n该公司的下一个重要步骤是在美国太空港进行动力试飞，因为它正朝着真正让这些门票持有者参加太空之旅的方向迈进。如前所述，Unity之前曾进行过动力试飞，包括维珍航空的首席宇航员教练贝丝·摩西在飞机上，但仍需要采取一些中间步骤才能实现这一目标，包括审查今天飞行期间收集的数据，以及对发射和飞行系统进行任何可能需要的小改动，以确保动力航天的成功。\n维珍航空一直在寻求最早在今年年中开始商业飞行，但考虑到它仍有一些重要的测试需要完成，时间表看起来更像是今年年底，这是任何实际旅游推出的最佳情况。", "note_en": "This flight was the second such test flight that Virgin has flown with Unity from its Spaceport America launch facility in New Mexico, but it was done at higher altitudes and at higher speeds than the earlier flight. This sets up Virgin to now move on to powered spaceflight from Spaceport America – its first at the facility, though Unity itself has flown previously in a test capacity, reaching a heigh of 41.4 miles above Earth at supersonic speeds back in 2018 for its most impressive demonstration.\n Virgin Galactic returned to powered spaceflight testing at the Mojave Air and  Space   Port in California in 2018 – four years after it had a fatal crash during testing of Unity’s predecessor, VSS Enterprise. Virgin’s co-pilot for that flight, Michael Alsbury, was tragically killed in that incident, and pilot Peter Siebold suffered serious injuries.\n  Unity has had no such issues, and today’s unpowered glide flight seems to have gone perfectly to plan, providing Virgin with key data about flight conditions and aircraft/spacecraft behaviour from the New Mexico launch site, which will ultimately also serve Virgin Galactic’s paying customers as the departure and return location for their tourist trips to the edge of space.\n The next major step for the company as it moves towards actually getting those ticket-holders on their space tours is performing powered test flights from Spaceport America. As mentioned, Unity has done powered test flights previously, including with Virgin’s Chief Astronaut Trainer Beth Moses on board, but there are still a number of intermediary steps that need to take place to get there, including reviewing the data collected during today’s flight, and making any small changes to the launch and flight system that may be required to ensure the success of a powered spaceflight.\n Virgin had been looking to begin commercial flights as early as the middle of this year, but given that it still has some significant testing to complete, the timeline looks more like end of year as a best-case scenario for any actual tourist launches.", "posttime": "2020-06-26 04:57:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "太空,动力,galactic,飞行", "title": "\n维珍银河在新墨西哥州太空港进行第二次太空船二号测试，为动力航天扫清道路", "title_en": "\n\t\t\t\tVirgin Galactic flies second SpaceShipTwo test at New Mexico spaceport, clearing the way for powered spaceflight\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/25/virgin-galactic-flies-second-spaceshiptwo-test-at-new-mexico-spaceport-clearing-the-way-for-powered-spaceflight/", "via": "", "real_tags": ["太空", "动力", "galactic", "飞行"]}, {"category": "", "categoryclass": "", "imagename": "c39fa3b8fb99e4caa79c2656761ca6e3.jpeg", "infoid": 1008281, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“制作电子表格的人，制作天气应用程序的人，只想创建家谱网站的人，他们都被买断了，都被颠覆了，正在被腐败。”", "note_en": "\"People who make spreadsheets, people who make weather apps, people who just wanted to create family tree websites, all of them are being bought out, are being subverted, are being corrupted.\"", "posttime": "2020-06-26 04:34:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "工作者,tech", "title": "斯诺登：科技工作者是他们的公司伤害社会的同谋", "title_en": "Snowden: Tech Workers Are Complicit in How Their Companies Hurt Society", "transed": 1, "url": "https://www.vice.com/en_ca/article/wxqx8q/snowden-tech-workers-are-complicit-in-how-their-companies-hurt-society", "via": "", "real_tags": ["工作者", "tech"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008279, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "开发一个可用的软件是很困难的。就像制造飞机一样，它需要有才华的人、工作部件和测试框架。在一切准备就绪、检查和复核之前，任何飞机都不能离开机库。\n在JetBrains中，我们采用相同的理念来构建我们的软件。严格的测试帮助我们在最终产品起飞之前发现错误和问题。就像造飞机一样，软件开发是一个由多个阶段组成的过程。虽然这篇文章的作者不是航空航天工程师，但我们将使用简化的飞机类比。这有几个原因：飞机很漂亮，它是纯粹的工程，它揭示了我们在这里提出的问题并不是软件工程所独有的。\n产品越大，步骤和模块就越多。要确保您的软件已准备就绪，需要测试每个模块，并将其与其他所有模块正确集成。如果设置正确，CI/CD服务有助于自动执行此过程。最重要的是，它们消除了以一次粗心大意的行为可能导致全面灾难而闻名的人为因素。\n与人们普遍认为的相反，测试在前端开发中非常重要。继续这个类比，你的飞机不仅需要飞行-它还必须舒适地坐在里面！此外，它的外部影响飞机的飞行(空气动力学)。回到前端，这意味着您必须测试可用性和功能性。这使得前端测试成为必须。在本文中，我们将概述TeamCity中使用的UI测试。如果您对技术细节有任何疑问，请不要犹豫，尽管问我们。\n这篇文章的每个部分都包含到有用资源的链接。其中一些导致公共TeamCity配置，您可以在其中检查我们如何测试前端。请随时以客人身份签到并四处看看。\nUI测试不仅仅是关于单元测试的。有屏幕截图、行为、可访问性、性能、安全性和感知测试。下面列出了它们中的每一个。\n让我们来考虑一下对问题的拦截。在JetBrains中，它在多个级别上工作，并且大多数都是基于CI/CD的。每个测试、每个部门、每个级别都参与了发现和报告问题的整个过程。以下图表显示了所有这些部分：\n每个测试都会处理一些问题类别。最后，它帮助我们缓解问题。\n例如，我们捕获的大量UI问题属于屏幕截图测试阶段。属于Linters/Unit/Render测试的问题较少。这并不意味着这些测试毫无意义。相反，这可能意味着我们在这些领域的工作做得足够好，可以防止大量的问题。\n我们想在此提出的重点是：大家可以看到，质素保证部门只面对三分之一的问题。这意味着通过使用CI/CD，您可以帮助您的同事节省检查易于预测的问题的时间，而这些问题可能会被组织良好的测试系统捕获。\n该图表并不是100%有代表性，每个版本的数字都是浮动的：某些级别可以消除比其他级别更多的问题。然而，它表明测试系统是非常重要的，即使单独的测试只涵盖一个案例。在这里，数量不等于质量：测试可以“只”找到一个bug，但是如果不注意，这个bug可能会使整个应用程序崩溃。\n首先，我们应该说代码应该是干净和一致的，但这是有问题的。每个人对干净代码都有自己的理解。在JetBrains中，我们同意了200多条规则，以确保我们的代码客观上保持干净。因此，每当林特检测到问题时，我们都会收到来自IntelliJ Idea的警告。提到复杂的应用程序需要使用类型脚本、流、kotlin或原因的静态类型，这并不是多余的。我们，TeamCity团队，已经决定使用Flow。我们用来构建前端的第一个测试之一就是eslint/style int检查。它的目的不仅是查找代码样式问题，还包括遗漏变量、导入或非廉价/安全操作(如没有依赖项的Reaction Hooks)的问题。\n当然，也有单元测试。这很简单：我们编写纯原子函数，然后断言它们的输出。如果输出正常，TeamCity会将其标记为绿色，并允许管道继续运行。\n跨多个设备和平台显示一致的UI是我们的主要目标之一。我们需要确保正确显示所有组件，而不管使用的浏览器、布局或视口大小如何。这意味着要测试组件在不同配置中的可视呈现方式。屏幕截图测试就是这样做的。\n在其中一个更新之后，评论部分已添加到未经授权的代理。那挺好的。但是想象一下，这种测试可以揭示元素的消失。这种情况时有发生，我们发现这项测试非常有用。虽然，快照测试，您很快就会熟悉，但在这种情况下也会有所帮助。\n使用WebDriver API连接到服务器；此API允许我们以自动模式与网站交互-而无需真正的用户。\nYandex的实用工具Hermione使用WebDriver连接到Storybook，并在每个浏览器中拍摄选定区域的多个屏幕截图。\n这些截图随后被放入一个文件夹，赫敏在那里将它们与使用Mocha的默认截图进行比较。\n我们试图通过最小化不必要的渲染量来提高界面的性能。一般来说，Reaction在这方面做得很好。但是，有一些情况您应该记住：如果您更改了组件中的某些内容，Reaction会创建一个新组件，而不是修改原始组件。\n假设您将新道具传递到一个组件中。为了保存重新渲染所需的资源，Reaction会检查传递的道具是否与以前的版本不同。如果它们相同，则不会进行重新渲染。不幸的是，我们中的许多人忘记了，在JavaScript中，具有相同内容的两个数组或对象是不同的实体(因为这些对象/数组将具有不同的引用)。结果，我们最终不必要地呈现相等的组件。\n您可以使用Reaction开发人员工具启用Reaction更新突出显示。这将显示您的应用程序中的所有重新渲染。例如，有一些重新渲染器，它们在光标移动到Trends Page子组件上时发生。幸运的是，所有这些重现的人都是在这里。但想象一下，添加到这些重新渲染的应用程序将会多激发100个呢？\n我们已经知道危险了。尽管如此，我们还是决定使用“为什么要渲染”来检查冗余渲染。令我们惊讶的是，我们发现了多个效率低下的情况。我们就是这么做的：\n如果我们更改了存储区中的某些内容，我们将使所有组件(订阅此存储区)再次收集数据。使用mapStateToProps回调时会发生这种情况。\n收集完数据后，我们将其传递给组件，并启动比较功能来检查道具是否已更改。\n同时，我们知道虚拟操作实际上不会更改存储中的任何值，这意味着不应该向组件传递任何新的道具。\n如果新的道具导致组件重新呈现，我们知道我们在不应该创建新对象/数组的地方创建了一个新对象/数组。太遗憾了!。\n使用重新选取库，如果生成函数的所有参数保持不变，则可以对结果进行记忆。如果传递的参数与前面的参数相等，我们将接收的不是新对象，而是对旧对象的引用。不会进行重新渲染。\n您可以通过冻结对象或数组来将其预定义为不可变的。下一次，每当您想要返回回退值时，都应该返回这个不可变的对象。它保证对此对象的引用始终相同，因此不会重新呈现该组件。\n快照测试验证对重要组件的结构所做的任何更改都是有意的。再一次，让我们回到我们的飞机类比。假设我们有一架飞机的结构快照：它应该有一个机身、一个机翼和四个喷气发动机。突然，我们决定拆下其中一个喷气发动机，用涡轮机取而代之。虽然这可能是个好主意，但它不再适合我们的快照。因此，我们会收到通知。\n在上图中，这一改变是故意的，具有明显的后果。现在想象一下我们的飞机的快照，它由数百个组件组成：跟踪所有的交互将非常困难。JavaScript项目在这方面类似。对一个组件的微小更改可能会给整个项目的结构带来不希望看到的后果。\n您可以通过创建结构的快照来保护结构。无论何时打印错误、更改HTML类或添加新组件，都会破坏结构。如果您这样做，快照测试将通知您。检查下面的示例：\n在这里，我们将发动机类型从涡扇改为螺旋桨。只是为了测试一下它是怎么工作的。由于新的搜索引擎不再与我们的快照匹配，因此测试失败。我们有一份报告，我们的工程师正在调查问题的路上。\ne2e测试与试飞非常相似。就像飞机一样，我们必须确保我们的界面在现实世界中确实是可用的。由于数以千计的部件相互作用，在飞行员真正将飞机送入空中之前，你永远不会知道你的飞机是否能起飞。\ne2e测试旨在从头到尾测试应用程序流。这些测试模拟一个真实的用户，该用户一遍又一遍地经历相同的特定用例。\n根据用户的POV(用户情景)创建一个关键场景列表。\n每个测试都应该描述Selenium应该如何与UI交互。声明：“确保用户在转到页面X并启动进程Y后获得窗口Z。”\n写这篇文章花了一段时间。在此期间，我们实现了一些新的测试，例如依赖项安全审计、可访问性测试，我们还在讨论一些新的测试类别。我们期待您的反馈意见，以便继续撰写文章并更深入地研究前端测试领域。\nTeamCity允许您为启动测试和部署构建创建无限复杂的逻辑。这就是TeamCity为其自己的UI显示构建链/时间线的方式。\n如您所见，TeamCity并行运行测试，因此，一些构建会等待其他构建成功完成。如果出了问题，它可能会停止整个管道-只是为了防止在肯定会失败的测试上浪费资源。\n这里重要的一点是，我们不仅可以建造复杂的管道，而且可以很好地使它们变得复杂、复杂。例如，我们流水线的某些部分必须构建在OS X代理上，其中一些必须构建在Linux系统上，而有些将使用Amazon Cloud代理构建。\n你还记得第一张图吗？我们的自动化测试涵盖了一半以上的问题，而质量保证部涵盖了三分之一的问题。尽管如此，总会有一些东西留下来。在JetBrains中，我们广泛实践“狗脚”：我们使用自己的产品(IntelliJ、TeamCity、Space、YouTrack等)来开发和构建软件。所以，在这个阶段，JetBrains内部的每个人都可以来找我们，分享反馈。通过这样做，我们可以获得通知并修复通过所有其他过滤器的错误。\n在我们的Early Access计划期间，您可以了解更多有关我们目前正在开发的新功能的信息，分享您的反馈，报告问题，并要求我们包括一些新功能，以便尽快发布。\n希望我们已经明确了前端测试的基本原则。总而言之，你可以认为它是保险的：它需要一些努力，但可以挽救生命。为了从小规模项目的CI/CD中获得最大利润，您可以免费使用TeamCity。保护自己不会犯代价高昂的错误！", "note_en": "Developing a working piece of software is difficult. Just like building an airplane, it requires talented people, working components, and a testing framework. No plane leaves the hangar before everything is ready, checked and double-checked.\n In JetBrains, we adopt the same philosophy for building our software. Vigorous testing helps us discover bugs and problems before the final product takes off. Just like building a plane, software development is a process that consists of multiple stages. Although the authors of this post are not aerospace engineers, we will use simplified aircraft analogies. There are several reasons for that: aircraft is beautiful, it is pure engineering, and it reveals that the problems we raise here are not exclusive to software engineering.\n The bigger your product, the more steps and modules there are. To make sure your software is ready to lift off, every module needs to be tested and correctly integrated with everything else. CI/CD services, if set up correctly, help automate this process. Most importantly, they remove the human factor famous for one careless action being able to lead to total disaster.\n Contrary to popular belief, testing is very important in front-end development. To continue the analogy, your plane is not only required to fly – it has to be comfortable inside! Moreover, its exterior affects how airplane flights (aerodynamics). Getting back to the front end, this means that you have to test the usability as well as functionality. This makes  front-end testing a must. In this article, we will provide an overview of UI testing used in TeamCity. If you have any questions about the technical details – don’t hesitate to ask us.\n  Each section of this post contains links to useful resources. Some of them lead to public TeamCity configurations where you could examine how we test the front end. Feel free to sign in as a guest and look around.\n  UI testing is not only about the Unit tests. There are screenshots, behavior, accessibility, performance, security, and perception tests. Each of them is listed below.\n  Let’s consider the interception of issues. In JetBrains, it works on multiple levels, and most of them are based on the CI/CD. Each test, each department, each level takes its part in the entire process of revealing and reporting problems. Here is a chart that shows all of these parts:\n  Every test takes care of some issue categories. Finally, it helps us to mitigate issues.\n For example, a huge amount of UI problems we catch belong to the  Screenshot testing stage. Fewer problems belong to the Linters / Unit / Render tests. That doesn’t make those tests meaningless. On the contrary, it could mean that we work in these areas well enough to prevent tons of issues.\n The key point we would like to show here: as you can see, the Quality Assurance Department faces only one-third of the problems. This means that  by using CI/CD you could help your colleagues to save time on inspecting issues that are easy to predict, which could be caught by a well-organized testing system.\n The chart isn’t 100% representative and numbers float from release to release: some level can remove more problems than others. However, it shows that the test system is very important, even if a separate test covers only one case. Quantity doesn’t equal quality here: a test could find “only” one bug but that one bug could’ve crashed your whole application if left unnoticed.\n  Firstly, we ought to say that the code should be clean and consistent, but there’s an issue with that. Everyone has their own understanding of clean code. In JetBrains, we agreed on 200+ rules that make sure our code stays objectively clean. As a result, we get a warning from IntelliJ Idea whenever a  linter detects a problem. It’s not superfluous to mention that static typings with  TypeScript,  Flow,  Kotlin, or  Reason are required for complicated applications. We, the TeamCity team, have decided to use Flow. One of the first tests we use for building the front end is just eslint/stylelint check. Its purpose not only to find code style problems but also issues with missed variables, imports, or non-cheap/safe operations (like React Hooks without dependencies).\n Of course, there are also unit tests. It’s simple: we write pure atomic functions and then assert their output. If the output is OK,  TeamCity marks them green and allows the pipeline to continue.\n   Displaying consistent UI across multiple devices and platforms is one of our main goals. We need to be certain that all the components are displayed correctly, regardless of the used browser, layout, or viewport size. This implies testing how the components are visually presented in different configurations. Screenshot testing does exactly that.\n   After one of the updates Comment sections have been added to the Unauthorized Agents. That’s quite ok. But imagine, that this kind of test could reveal the disappearing of elements. It happens from time to time and we find this test very useful. Although, Snapshot Testing, you’ll get familiar soon also will help in this case.\n  Connect to the server using the WebDriver API; this API allows us to interact with a website in an automatic mode – without a real user.\n  Hermione, a utility tool by Yandex, connects to Storybook using WebDriver and takes multiple screenshots of the selected area in every browser.\n Those screenshots are then put into a folder, where Hermione compares them to the default screenshots using Mocha.\n   We try to improve the performance of our interfaces by minimizing the amount of unnecessary rendering. Generally, React is pretty good at that. However, there are some cases you should keep in mind: if you change something in a component, React  creates a new one instead of modifying the original component.\n Imagine that you pass new props into a component. In order to save the resources needed for a re-render, React checks if the passed props differ from the previous version. If they are the same, no re-rendering takes place. Unfortunately, many of us forget that in JavaScript two arrays or objects with equal content are different entities (because those objects/arrays will have different references). As a result, we end up unnecessarily rendering equal components.\n   You can enable React Updates Highlighting with React Developer tools. This will reveal all re-renders in your App. For example, there are rerenders, which take place during cursor moving over the Trends Page subcomponent. Fortunately, all those rerenders are intended here. But imagine, that adding to these re-renders app will fire one hundred more?\n   We already know about the danger. Nevertheless, we decided to check for redundant rendering using  why-did-you-render. To our surprise, we discovered multiple instances of inefficiency. That’s how we did it:\n If we change something in the store, we will make all the components (subscribed to this store) collect data once again. It happens with  mapStateToProps callback.\n After collecting the data, we pass it to the component and launch compare function to check, whether the props had been changed or not.\n Meanwhile, we know that the dummy action doesn’t actually change any values in the store, meaning that no new props should be passed to the component.\n If new props lead the component to a re-render, we know that we created a new object/array somewhere where we should not. What a shame!\n      Using the  reselect library, you can memoize results if all the parameters for the generation function remain the same. If the passed parameters are equal to the previous ones, we will receive not the new objects, but the references to old ones. No re-rendering takes place.\n  You can predefine an object or array as immutable by freezing it. Next time, whenever you would like to return a fallback value, you should return this immutable object. It guarantees that reference to this object always will be the same, so the component will not be re-rendered.\n  Snapshot testing verifies that any changes made to the structure of important components are intentional. Once again, let’s return to our airplane analogy. Imagine that we have a snapshot of a plane’s structure: it should have a body, one wing, and four jet engines. Suddenly, we decide to remove one of the jet engines and replace it with a turbine. While this may be a great idea, it no longer fits our snapshot. Consequently, we would get a notification.\n   In the picture above the change was intentional, with obvious ramifications. Now imagine a snapshot of our plane which consists of hundreds of components: tracking all the interactions would be very difficult. JavaScript projects are similar in this respect. A small change to one component could lead to unwanted consequences for the structure of the whole project.\n You can protect structures by creating their snapshots. Whenever you misprint, change an HTML class, or add a new component, you will break the structure. A snapshot test will notify you if you do. Check the example below:\n Here, we change the engine type from turbofan to propfan. Just to test how it works. Since the new engine no longer matches our snapshot, the test fails. We’ve got a report, and our engineers are on their way to investigate the problem.\n    E2E tests are very similar to test flights. Like with planes, we have to make sure that our interface is actually usable in the real world. With thousands of components interacting with each other, you never know if your plane can take off before the pilot actually takes it into the air.\n E2E tests are designed to test an application flow from start to finish. Those tests emulate a real user who is going through the same specific use case over and over again.\n    Create a list of scenarios that are critical from the user’s POV (user stories).\n  Each of those tests should describe how Selenium is supposed to interact with the UI. Declaratively: “Make sure the user gets the window Z after going to page X and start process Y.”\n   Writing this article took a while. During this time we had implemented some new tests, such as  Dependencies Security Audit,  Accessibility tests, and we are also discussing some new categories of tests. We are looking forward to your feedback to continue writing articles and dive deeper into the front-end testing area.\n  TeamCity lets you create infinitely complex logic for launching tests and deploying builds. This is how TeamCity displays the chain/timeline of builds for its own UI.\n  As you can see, TeamCity runs tests in parallel, and in consequence, some builds waiting for others to been finished successfully. And if something goes wrong, it could stop the whole pipeline – just to prevent wasting resources on the tests which will definitely fail.\n   The important point here is that we could not only build complex pipelines but make them sophisticated, complicated in a good manner. For example, some parts of our pipeline must be built on OS X agents, some of them – on the Linux system, and some of them are going to be built with  Amazon Cloud Agents.\n   Do you remember the first diagram? Our automated tests cover more than half of those issues, and the Quality Assurance Department covers one-third part. Nevertheless, there is always something left. In JetBrains, we widely practice “dogfooding”: we use our own products (IntelliJ, TeamCity, Space, YouTrack, and so on) to develop and build software. So, at this stage, everyone inside JetBrains could come to us and share feedback. By doing so, we get notice and fix bugs that passed all the other filters.\n  During our  Early Access Program, you can find out more about the new features we are making right now, share your feedback, report issues, and ask us to include some new features so they are released as soon as possible.\n Hopefully, we’ve made the basic principles of front-end testing clear. Summing up, you can consider it insurance: it requires some effort but can be lifesaving. To get the most profit from CI/CD for small-scale projects, you can use TeamCity free of charge. Protect yourself from costly mistakes!", "posttime": "2020-06-26 04:32:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ui,测试", "title": "TeamCity UI：我们如何测试它", "title_en": "TeamCity UI: how do we test it", "transed": 1, "url": "https://blog.jetbrains.com/teamcity/2020/06/teamcity-ui-how-do-we-test-it/", "via": "", "real_tags": ["ui", "测试"]}, {"category": "", "categoryclass": "", "imagename": "895c4bbecd9ceab3d056ef918cb36859.jpg", "infoid": 1008278, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司表示，在新的YouTube实验中，用户将在移动上传流中看到一个“创建视频”的选项。\n与TikTok类似，用户可以点击并按住录制按钮来录制他们的剪辑。然后，他们可以再次点击或松开按钮以停止录制。重复这个过程，直到他们创建了15秒的视频片段。YouTube将合并这些剪辑，并在录制完成后将其作为单个视频上传。换句话说，就像TikTok一样。\n该功能的引入还意味着，想要录制超过15秒的移动视频内容的用户将不能再在YouTube应用程序本身内进行录制。取而代之的是，他们必须在手机上录制较长的视频，然后从手机的图库上传，才能将其发布到YouTube上。\nYouTube没有提供测试的其他细节-例如，它稍后是否会包括更多与简短工作流相关的控件和功能，如过滤器、效果、音乐、AR或更改视频速度的按钮。这些都是让TikTok视频成为今天的样子的工具--不仅仅是视频的长度或多段录制风格。\n不过，值得注意的是，YouTube的视线是由TikTok普及的短片格式。\n这将不是YouTube第一次通过模仿竞争对手的功能集来对抗竞争对手。\n该公司在2017年推出了Instagram故事的替代方案，旨在创建和分享更多休闲视频。但YouTube故事不会服务于TikTok的观众，因为TikTok与其说是关于个人Vlog，不如说是关于精心设计和排练的内容。这需要不同的工作流和工具集。\nYouTube最新实验的消息是在TikTok在本周IAB NewFronts向广告商进行大规模推销之前传来的。TikTok今天发布了TikTok for Business，这是它的新平台，面向希望在TikTok的应用程序上做生意的品牌和营销人员。从新网站上，广告商可以了解TikTok的广告产品，创建和跟踪活动，并参与电子学习。\nYouTube表示，其新的视频测试是与iOS和Android的一小部分创建者一起运行的。一位公司发言人指出，这是公司正在进行的几项关于短片的测试之一。\n“我们一直在试验各种方法，帮助人们更容易地找到、观看、分享和互动对他们来说最重要的视频。我们正在为用户测试几种不同的工具来发现和创建短视频，“YouTube的一位发言人说。他们补充说：“这是我们一直在YouTube上进行的众多实验之一，我们将根据对这些实验的反馈，考虑更广泛地推出功能。”", "note_en": "Users in the new YouTube experiment will see an option to “create a video” in the mobile upload flow, the company says.\n Similar to TikTok, the user can then tap and hold the record button to record their clip. They can then tap again or release the button to stop recording. This process is repeated until they’ve created 15 seconds worth of video footage. YouTube will combine the clips and upload it as one single video when the recording completes. In other words, just like TikTok.\n  The feature’s introduction also means users who want to record mobile video content longer than 15 seconds will no longer be able to do so within the YouTube app itself. Instead, they’ll have to record the longer video on their phone then upload it from their phone’s gallery in order to post it to YouTube.\n YouTube didn’t provide other details on the test — like if it would later include more controls and features related to the short-form workflow, such as filters, effects, music, AR, or buttons to change the video speed, for example. These are the tools that make a TikTok video what it is today — not just the video’s length or its multi-segment recording style.\n Still it’s worth noting that YouTube has in its sights the short-form video format popularized by TikTok.\n This would not be the first time YouTube countered a rival by mimicking their feature set with one of its own.\n The company in 2017  launched an alternative to Instagram Stories, designed for the creation and sharing of more casual videos. But YouTube Stories wouldn’t serve the TikTok audience, as TikTok isn’t as much about personal vlogs as it is about choreographed and rehearsed content. That demands a different workflow and toolset.\n The news of YouTube’s latest experiment arrived just ahead of TikTok’s big pitch to advertisers at this week’s IAB NewFronts.  TikTok today launched TikTok For Business, its new platform aimed at brands and marketers looking to do business on TikTok’s app. From the new site, advertisers can learn about TikTok’s ad offerings, create and track campaigns, and engage in e-learning.\n YouTube says its new video test is running with a small group of creators across both iOS and Android. A company spokesperson noted it was one of several tests the company had in the works around short-form video.\n “We’re always experimenting with ways to help people more easily find, watch, share and interact with the videos that matter most to them. We are testing a few different tools for users to discover and create short videos,” a YouTube spokesperson said. “This is one of many experiments we run all the time on YouTube, and we’ll consider rolling features out more broadly based on feedback on these experiments,” they added.", "posttime": "2020-06-26 04:12:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "youtube,tiktok,latest,视频", "title": "\nYouTube的最新实验是TikTok的竞争对手，专注于15秒的视频", "title_en": "\n\t\t\t\tYouTube’s latest experiment is a TikTok rival focused on 15-second videos\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/25/youtubes-latest-experiment-is-a-tiktok-rival-focused-on-15-second-videos/", "via": "", "real_tags": ["youtube", "tiktok", "latest", "视频"]}, {"category": "", "categoryclass": "", "imagename": "676541cf7f20371713a2f81c385b3d53.jpg", "infoid": 1008277, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "沃尔沃和Waymo只提供了几个关于合作伙伴关系的细节，以及这一合作实际上可能是什么样子，只是两家公司“将首先合作，将Waymo司机整合到一个全新的、专注于移动性的电动汽车平台上，提供叫车服务。”“第一次一起工作”这句话暗示着更多的事情即将到来。我们知道，新的车辆平台将能够实现4级自动驾驶，这是由SAE指定的，这意味着它可以处理在特定地理区域或特定天气和路况下的所有驾驶。\n此次合作还包括沃尔沃汽车集团旗下的其他子公司，包括电动性能品牌Polestar和Lynk&Amp；Co.International，沃尔沃汽车集团首席技术官亨里克·格林(Henrik Green)在他准备好的声明中特别提到了这一点。\n沃尔沃汽车集团CTO亨里克·格林(Henrik Green)在一份声明中表示：“全自动驾驶汽车有可能将道路安全提高到前所未有的水平，并彻底改变人们的生活、工作和出行方式。”我们与Waymo的合作为沃尔沃汽车公司、北极星公司和Lynk&amp；公司打开了新的令人兴奋的商机。“。\n“排他性”一词也用来描述这种合伙关系。但如果没有具体的细节，很难知道这件事会走向何方，以及“独家”到底是什么意思。排他性一词是用来描述Waymo的4级自动驾驶软件的，这意味着两家公司可能在共同开发，或者肯定是共享关于堆栈内部工作的敏感信息。它还暗示，合作伙伴关系的结构包括可能的许可交易。\n到目前为止，Waymo的战略一直是与汽车制造商合作。Waymo负责其硬件套件、软件和计算系统的设计。然后，它与汽车制造商合作，创造出易于与其所谓的Waymo司机集成的车辆。这些关系主要集中在叫车应用上，但可以进行定制，使车辆更适合本地送货、卡车运输和个人拥有汽车。\n如果两家公司之间的许可协议成为现实，可能类似于Waymo与菲亚特克莱斯勒汽车公司(Fiat Chrysler Automobiles)的合作。2018年5月，FCA宣布扩大与Waymo的合同，向这家自动驾驶汽车公司供应多达6.2万辆克莱斯勒太平洋混合动力小型货车。FCA当时还表示，它正在探索授权Waymo的自动驾驶汽车技术的方法，以便为消费者在汽车上部署该技术。\nWaymo与捷豹路虎(Jaguar Land Rover)建立了供应商合作伙伴关系，生产多达2万辆全电动i-Pace汽车。2020年6月，Waymo与雷诺(Renault)和日产(Nissan)达成合作伙伴关系，研究商业自动驾驶汽车如何为法国和日本的乘客和包裹服务。\n不要忘记，沃尔沃仍与优步自动驾驶部门优步高级技术集团(Uber Advanced Technologies Group)达成协议。沃尔沃和优步ATG都证实，其四年的合作伙伴关系仍然完好无损。根据这一合作关系，沃尔沃将向优步提供一款专为自动驾驶设计的车辆。这些特殊的沃尔沃XC90车辆配备了支持优步自动驾驶软件所需的硬件。然后，优步将其自动驾驶软件栈集成到车辆中。沃尔沃表示，它与优步(Uber)达成了一项“框架协议，将交付数万辆可自动驾驶的汽车。”", "note_en": "Volvo and Waymo provided just a few details on the partnership and what this might actually look like except that the companies “will first work together to integrate the Waymo Driver into an all-new mobility-focused electric vehicle platform for ride hailing services.” The phrase “first work together” suggests more is coming. We know that the new vehicle platform will be capable of Level 4 autonomy, a designation by SAE that means it can handle all driving in a specific geographic area or in certain weather and road conditions.\n The partnership also includes other subsidiaries under Volvo Car Group, including electric performance brand Polestar and Lynk &amp; Co. International, a point that Volvo Car Group CTO Henrik Green specifically noted in his prepared statement.\n  “Fully autonomous vehicles have the potential to improve road safety to previously unseen levels and to revolutionize the way people live, work and travel,” Volvo Car Group CTO Henrik Green said in a statement. “Our partnership with Waymo opens up new and exciting business opportunities for Volvo Cars, Polestar and Lynk &amp; Co.”\n The term “exclusivity” is also used to describe the partnership. But without specific details it’s hard to know where this is headed and what “exclusive” actually means. The exclusivity term is used to describe Waymo’s Level 4 self-driving software, which suggests that the two companies might be co-developing or certainly sharing sensitive information on the inner workings of the stack. It also hints that the partnership is structured to include a possible licensing deal.\n Waymo’s strategy so far has been to partner with automakers. Waymo handles the design of its hardware suite, software and compute system. It then works with the automakers to create vehicles that integrate easily with its so-called Waymo Driver. These relationships have largely focused on ride-hailing applications, but could be customized to make the vehicles more suitable for local delivery, trucking and personal car ownership.\n If a licensing deal between the two companies materializes, it could be similar to Waymo’s partnership with Fiat Chrysler Automobiles. In May 2018, FCA announced it expanded its contract with Waymo to supply the self-driving car company with up to 62,000 Chrysler Pacifica Hybrid minivans. FCA also said at the time that it was exploring ways to license Waymo’s self-driving car technology in order to deploy the tech in cars for consumers.\n Waymo has a supplier partnership with Jaguar Land Rover for up to 20,000 all-electric I-Pace vehicles. In June 2020, Waymo locked in a partnership with  Renault and Nissan to research how commercial autonomous vehicles might work for passengers and packages in France and Japan.\n Don’t forget that Volvo still has a deal with  Uber   self-driving unit Uber Advanced Technologies Group. Both Volvo and Uber ATG confirmed that its four-year partnership is still intact. Under that partnership, Volvo is supplying Uber with a vehicle designed for autonomous driving. These special Volvo XC90 vehicles are equipped with the hardware necessary to support Uber’s self-driving software. Uber then integrates its self-driving software stack into the vehicle. Volvo said it has a “framework agreement with Uber to deliver tens of thousands of autonomous drive ready vehicles.”", "posttime": "2020-06-26 04:12:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,机器人,沃尔沃,volvo,waymo", "title": "\nWaymo，沃尔沃合作开发电动机器人出租车", "title_en": "\n\t\t\t\tWaymo, Volvo partner to develop electric robotaxis\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/25/waymo-volvo-partner-to-develop-electric-robotaxis/", "via": "", "real_tags": ["开发", "机器人", "沃尔沃", "volvo", "waymo"]}, {"category": "", "categoryclass": "", "imagename": "157c9fa3eef75984cbe5b9935c2d52d4.jpg", "infoid": 1008276, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "测试驱动的开发应该消除对独立测试的需要。唉，这还不够深入。\n测试驱动开发(TDD)赢得了使软件更健壮的声誉。这是不是意味着你可以解雇所有的测试员？剧透：不。\n测试驱动开发是一种以小块编写软件的方法。您从测试开始，然后编写功能代码以使测试通过，最后重构功能代码以清理它。TDD的想法是由Kent Beck在20世纪90年代早期提出的，作为极限编程(一种敏捷软件开发方法)的一部分。\nTDD有时被概括为“红色、绿色、重构”。许多测试工具上的接口，比如JUnit(用于Java)和NUnit(用于.NET)，在测试失败时显示红灯，在测试通过时显示绿灯。然而，还有另一个步骤需要考虑。您需要考虑所需的行为，并划出一小段代码(通常为5行)来实现下一步。\n正如Beck所建议的，在TDD中，除非测试失败，否则永远不会编写功能代码。然而，学习首先(而不是事后)编写测试是需要练习的；开发人员经常难以改变他们习惯的工作方式。在编写功能代码之前编写测试感觉是错误的。你确实会习惯它，尽管这可能需要几个月的时间；到那时它就会开始感觉对了。\nTDD的最大好处是消除了破坏代码的恐惧。在添加单元测试和功能代码时，您还构建了一个经常运行的回归测试库。当您添加新特性、修复bug或重构以清理代码时，再次运行测试可以确保您没有破坏任何东西。或者至少可以确认您没有破坏您编写的任何测试。\n当程序员采用TDD时，软件经理有时会想要取消或减少软件QA部门，理由是程序员也在编写测试。这个决定通常是错误的，因为测试人员在开发人员的单元测试之外提供了价值。\n单元测试只是充分覆盖现代代码所需的测试类型之一。TDD开发人员很少编写端到端集成测试。他们可能会避免编写需要大量设置或依赖于其他软件组件(如填充的数据库)的单元测试。\n专门的测试人员比程序员更有可能花时间执行探索性(特别)测试，这可以发现在代码开发过程中没有想象到的错误。与长时间沉浸在软件中的程序员相比，测试人员使用产品时也会有新的视角。\n此外，软件开发人员通常对设置CI/CD工具或将团队的测试组织到主回归测试中不感兴趣。测试人员认为所有这些都是工作的一部分。开发人员可能不会参与实现超出TDD的左移测试。对于左移测试，测试人员可以在单个测试或一行功能代码完成之前收集信息，帮助进行需求管理，并帮助定义验收标准。\n安全性是一个很大、很重要的测试领域，通常不会通过编写单元测试来解决。测试人员使用自动化漏洞测试工具、手动安全评估、渗透测试、安全审计和安全审查来查找安全缺陷。\n开发人员很难编写单元测试来测试GUI。相反，测试人员使用特定于支持的应用程序环境的自动化工具，例如浏览器、桌面应用程序和移动应用程序。\n开发人员可能很难处理与硬件相关的错误，因为主要的工作方式是让编码器在一台机器上工作。QA部门经常收集装满各种计算机和设备的房间，以及许多操作系统版本的图像。在许多不同型号的设备上进行测试的另一种方法是使用众包测试服务。\n虽然理论上TDD可以在边缘情况下捕获错误，但它们被称为“边缘情况”是有充分理由的。当编码器为功能点设计测试时，模糊的边缘情况可能在瞬间不会引起注意。测试人员比编写软件的程序员更有可能找到这些。\n同样，跨模块缺陷有时可以在单元测试中逃脱检查。当一个程序员误解了另一个程序员模块的接口或边界条件时，很容易出现这种情况。在端到端测试和临时测试期间，经常会发现跨模块错误。\n总之，尽管TDD作为一种开发实践有很多话要说，但它通常不会提供代码的完整测试覆盖。为此，您仍然需要测试人员。\n无论谁编写测试用例，遵循既定的指导原则都是有意义的。这些可能会有帮助。\n马丁·海勒是一名自由撰稿人。他以前是一名Web和Windows编程顾问，在1986到2010年间开发了数据库、软件和网站。最近，他曾担任阿尔法软件公司的技术和教育副总裁和图比菲公司的董事长兼首席执行官。", "note_en": "Test-driven development was supposed to eliminate the need for independent testing. Alas, it doesn’t go far enough.\n Test-driven development (TDD) earned a reputation of making software more robust. Does that mean you can fire all the testers? Spoiler: No.\n Test-driven development is a method for writing software in small chunks. You start with a test, then write functional code to make the test pass, and finally refactor the functional code to clean it up. The idea of TDD was proposed by  Kent Beck in the early 1990s, as part of Extreme Programming, an Agile software development methodology.\n TDD is sometimes summarized as “Red, Green, Refactor.” The interfaces on many testing harnesses, such as JUnit (for Java) and NUnit (for .NET), show red lights when tests fail and green lights when tests pass. There’s another step to consider, however. You need to think about the desired behavior and carve out a small chunk of code – typically five lines – to implement next.\n As proposed by Beck, in TDD you never write functional code until you have a failing test. Yet, it takes practice to learn to write the tests first (rather than after the fact); developers often have trouble shifting their habitual way of working. Writing the tests before the functional code just feels  wrong. You do get used to it, though it may take months; by then it starts feeling  right.\n The  biggest benefit of TDD is that it removes the fear of breaking your code. As you add unit tests and functional code, you also build  a library of regression tests that you run frequently. When you add a new feature, fix a bug, or refactor to clean up your code, running the tests again reassures you that you didn’t break anything. Or at least it confirms that you didn’t break any of the tests that  you wrote.\n  Software managers are sometimes tempted to eliminate or reduce software QA departments when the coders adopt TDD, on the grounds that the programmers are also writing tests. That decision usually is a mistake, because  testers provide value outside of the developers’ unit tests.\n Unit tests are only one of the kinds of tests needed to adequately cover modern code. TDD developers rarely write end-to-end integration tests. They may avoid writing unit tests that require significant setup or that rely on other software components, such as a populated database.\n Dedicated testers are more likely than coders to take the time to perform exploratory (ad-hoc) testing, which can find bugs that weren’t imagined during the development of the code. Testers also come to the product with fresh eyes compared to the coders who have been immersed in the software for long hours.\n Additionally, software developers often are not interested in setting up CI/CD tooling or in organizing the team’s tests into a master regression test. Testers consider all of that to be part of the job. Developers may not be involved in implementing shift left testing beyond TDD.  For shift left testing, testers can gather information, help with requirements management, and help to define the acceptance criteria, before a single test or line of functional code is complete.\n  Security is one large, important testing area that isn’t normally addressed by writing unit tests. Testers look for security flaws with automated vulnerability testing tools, manual security assessments, penetration tests, security audits, and security reviews.\n It’s difficult for developers to write  unit tests to test GUIs. Instead, testers use automation tools specific to the supported application environments, such as browsers, desktop applications, and mobile apps.\n Developers can have a hard time with hardware-dependent bugs, as the dominant way of working is for a coder to work on a single machine. QA departments often collect rooms full of varied computers and devices, as well as images of many operating system versions. An alternative way of testing on many different model devices is to use a crowd-sourced testing service.\n While TDD can theoretically catch bugs in edge cases, they are called “edge cases” for a good reason. When a coder designs the tests for a function point, obscure edge cases may escape notice in the heat of the moment. Testers are more likely to find these than are the coders who wrote the software.\n Similarly, cross-module flaws can sometimes escape scrutiny in unit tests. They can easily arise when one programmer misunderstands the interface or boundary conditions of another programmer’s module. Cross-module bugs are often found during end-to-end testing and ad-hoc testing.\n In summary, while there’s a lot to be said for TDD as a development practice, it doesn’t usually provide complete test coverage of your code. For that, you still need testers.\n Whoever writes the test cases, it makes sense to follow established guidelines.  These might help.\n Martin Heller is a freelance writer. Formerly a web and Windows programming consultant, he developed databases, software, and websites from 1986 to 2010. More recently, he has served as VP of technology and education at Alpha Software and chairman and CEO at Tubifi.", "posttime": "2020-06-26 04:10:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "测试人员,testers,测试", "title": "测试人员与TDD", "title_en": "Testers vs. TDD", "transed": 1, "url": "https://www.functionize.com/blog/testers-vs-tdd", "via": "", "real_tags": ["测试人员", "testers", "测试"]}, {"category": "", "categoryclass": "", "imagename": "300cfebe8c47b805ed168ed47e0c15e2.png", "infoid": 1008275, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "劳拉·戴明(Laura Deming)是生物学家，也是长寿基金(Longevity Fund)的创始人，该基金是第一家专注于通过生物技术延长健康人类寿命和解决与年龄相关疾病的公司的风险投资公司。她在新西兰在家上学时就扎根于生物学，12岁时移居美国，在加州大学旧金山分校的一个生物实验室工作。14岁时，她成为麻省理工学院的一名学生，然后成为泰尔研究员。我们请劳拉分享她所受的教育是如何为她今天的领导和建设做好准备的。\n你还有多长时间？我通常有几个关键的工作重点(现在，从一堆不同的角度来免疫衰老)，然后还有数十亿个其他的小想法浮现在我的头盖骨里和外面。我最执着的关注点是一些我还不能谈论的东西，因为这听起来有点疯狂，但现在，我正在追寻以下更连贯的问题：\n生物工具有飞轮效应吗？生物发现会成为下一代发现的工具吗？我们如何预测生物学的进步呢？\n为什么我认识的最优秀的原始创业者通常需要一年左右的时间才能完全相信自己要开一家公司？有哪些方法可以加速这一进程？\n地球上有不会复制的永生细胞吗？(如果有的话，我们大概也看不到。)。\n我对细胞生物学着迷于数字。我认为生物学的量化直观模型是有史以来最好的东西。另外，这段尼玛·阿卡尼-哈米德的视频简直是有史以来最棒的。\n我在新西兰自学长大，对现实世界的了解少得可笑。回想起来，这完全是理想的。在我生命的早期，有两个强烈的迷因深深植根于我的头颅-我热爱科学，做一些真正重要的事情是我的工作，我也能做到。我不知道如果没有这些迷因我会是谁，我也不确定后者是否真的是真的！我的父亲总是告诉我，我很特别，可以想出一种方法来实现我在这个世界上想做的任何事情，我相信了他的话。尽管十年来有相反的证据，而且意识到制造治疗复杂疾病的药物实际上是多么困难，但我仍然以一种有趣的方式做到了这一点。非常可悲的是，许多本来聪明的孩子可能因为没有类似的支持环境而不能做他们能做的事情-因此，我真的为丹尼尔·格罗斯(Daniel Gross)的《拓荒者》(Pioneer)这样的作品感到兴奋。\n我觉得这是一大堆解谜和做一些显而易见的事情。然后在大学里开始更独立地思考，试着找出我想要解决的问题。但我和一位朋友开车去露营的时候，我正试着向他解释一个数学概念，他突然转向我说：“我现在感到非常沮丧，因为老实说，你根本不知道自己在说什么。”\n真的很难在没有上下文的情况下解释这条评论到底有多有用。当他解释的时候，我只是鹦鹉学样地重复了一些东西的定义。理解事物的真正方式是能够从一系列不同的角度去看、去探索、去感受这个概念，并且能够严格地证明关于它的东西。我仍然在与后者作斗争，但对一个概念的真实而深刻的理解有一种直觉，这已经是一个很好的路标。例如，在经历了一个夏天的沮丧之后，我意识到我不理解熵是什么，现在我有点理解了。\n这很有趣，因为我经常被问到这个问题。我是这样想的：如果你每天看着一百万人从桥上跳下，从头到尾都在以一种非常极端的方式受苦，作为一个社会，我们会作何反应？绝大多数人将受到鼓舞，采取行动并提供帮助。当你用尖锐、直截了当的术语来思考它时，你会感到内心的震撼和感动。但是，随着长寿和其他深刻的生存问题的出现，正在发生的事情的恐怖已经悲剧性地正常化了。\n我真的只想解决最大的问题。起初，我以为那是癌症，但在经历了各种经历后，衰老似乎是一个更大的问题。\n与我小时候相比，我现在对死亡的敌意要少得多。我更明白，我们是一个物种，有一些东西超出了我们作为个体的范围-但尽管如此，当亲戚患上癌症时哭泣，然后又完全接受另一种同样由衰老引起的衰弱退化性疾病，这一想法是绝对无法调和的，我们不知何故共同认为这是自然和正常的。\n你小时候的学习方式如何影响了你在长寿基金的学习和决策方式？\n我不得不背诵我刚进入职场时学到的一大堆东西。当我还是个孩子的时候，我非常喜欢科学。我直接而热情地喜欢上了它，我绝对相信我长大后会成为迈克尔·法拉第(Michael Faraday)那样的人(顺便说一句，他关于跟汉弗莱·戴维(Humphrey Davy)当学徒的故事令人惊叹)。当我带着我的基金进入金融世界时，我完全害怕自己看起来不知道自己在做什么，我觉得隐藏自己的身份真的很重要，让自己看起来更“成熟”。现在，回过头来看，我认为这是可以理解的，也是一个小小的错误。\n当我还是个孩子的时候，我学到了一件事，但我总是很容易忘记，那就是如何不去关心别人的想法(除了几个非常接近的例外)。有趣的是，即使是在硅谷，假设是独立思考的先锋，我也觉得这是非常困难的。部分原因是其他人的想法限制了你对资源的访问。所以这是一个有趣的平衡。\n我听你说过，你爸爸在你12岁时告诉你，要确保每个人都更快乐一些，因为你每天都在实验室里。你的父母在你的生活和教育中扮演了什么角色？\n哦，伙计。我父亲小时候有这么多好建议--我真的觉得我很早就得到了生活中的欺骗代码。就像是本·富兰克林的女儿什么的。我可能是夸张了，但感觉是这样的。\n他告诉我的一件事是“行动先于激励”--这在我的生活中一直是一件令人难以置信的事情。他教会了我很多关于埋头苦干，不要相信任何人说你很棒的道理，这主要来自于你自己的自我判断。在懂得更多的人面前极其谦虚，想尽办法帮助他们。\n我爸爸还教会了我很多关于幽默的知识，以及这个世界在很多不同的方面是多么可笑。几乎太多了-我想我现在对事情更认真了。但这是一种马克·吐温效应--世界和其中的每个人都是一个滑稽的、自我破坏的、鲁莽的地方，也是银河系中发生的最令人愉悦和有趣的事情之一。他过去常说，你可以看着世界上正在发生的事情而哭泣，也可以大笑。为什么不选后者呢？\n我妈妈教会了我什么是善良，什么是同理心，什么是想要帮助别人。她可能是我认识的最乐于助人的人。\n当我第一次见到辛西娅·肯扬(Cynthia Kenyon)时，她确实改变了我和其他许多人的生活-她令人惊叹-我有一种非常极端的精神自负，我会恳求她在她的实验室里擦洗地板，然后以某种方式在学术阶梯上向上爬。我当时12岁。她非常友好地提出让我在她的实验室做普通实习生，回想起来真是太好了。它改变了我的生活，在我很小的时候就被如此认真地对待。\n我喜欢你描述长寿基金取消对谁可以参与生物医学创业的限制的方式。我们怎样才能把你所学到的关于科学多元参与的一些知识转化为孩子们学习的方式呢？\n我认为当你遇到一个一无所知的人时，你会感到非常高兴。这种感觉是世界上最美好的事情，因为你是第一个告诉他们一些令人难以置信的酷自然现象的人。那真是太棒了。我还记得在辛西娅的实验室里，当马克·麦考密克(Marc McCormick)描述支持向量机(Support Vector Machines)如何在邮政系统中用于手写识别时，我还是个十几岁的孩子。他就是太善于解释事情了，这一点真的让人印象深刻。鼓励人们拥有自己的想法，对它们持怀疑态度，并学会以在事物中挖洞为乐。\n当我考虑多元参与时，有趣的是，在我来到硅谷之前，我完全不知道作为一个女孩是一种障碍。对我来说，这是一个明显的优势--在一片看起来都一样的人的海洋里，我会像一个酸痛的拇指一样脱颖而出！如果我能做到，我显然不会是一个令人惊叹的榜样吗？在硅谷呆了一段时间后，这种感觉渐渐消失了，我读的关于做一个科学界的女孩是多么糟糕的文章越多，我就越相信这一点。我真的不知道该怎么想这一切。\n在接下来的十年里，我们将看到第一种可测量地影响人类健康的药物进行测试，这是我们如何看待疾病的最大交易之一。这不仅仅是炒作和修辞。\n这些原创思想家比我想象中的他们长大后要难得得多。\nPrimer是一家新的教育公司，其目标是帮助孩子们进行无限的学习，从在家上学的孩子开始。“在家上学：”是一个关于在家上学的校友的定期系列节目，他们后来做出了令人惊叹的事情。我们才刚刚开始，所以我们很想听听你的想法！", "note_en": "Laura Deming is a biologist and founder of The Longevity Fund, the first VC firm to focus on companies that work on extending healthy human lifespan and addressing age-related diseases through biotechnology. She grew her roots in biology as a homeschooling student in New Zealand, and moved to the US to work in a  UCSF biology lab at age 12. By age 14, she was a student at MIT, then became a  Thiel Fellow. We asked Laura to share how her education prepared her to lead and build today.\n   How long do you have? I normally have a few key focuses at work (right now, immune aging from a bunch of different angles), and then a billion other small ideas that float in and out of my cranium. My most persistent focus is something that I can’t talk about yet because it would sound slightly insane, but right now, I’m pursuing these more coherent questions:\n Is there a flywheel effect with biological tools? Will biological discoveries become the tools for next-generation discovery? How might we predict progress in biology?\n Why does it normally take about a year for the best proto-entrepreneurs I know to reach full conviction about starting a company? What are ways to accelerate that process?\n Is there an immortal cell that doesn’t replicate anywhere on earth? (We presumably wouldn’t see it if there was.)\n I’m really obsessed with  Cell Biology by the Numbers. I think quantitative intuitive models of biology are the best thing ever. Also  this Nima Arkani-Hamed video is literally the best thing ever.\n   I grew up homeschooled in NZ with a hilariously small amount of context for what the real world was like. In retrospect, it was totally ideal. I had two strong memes deeply implanted in my cranium early in life -  I love science and  it’s my job to do something really important and  I can do it, too. I have no clue who I’d be without those memes, and I’m also not sure that the latter was actually true! My dad just always told me that I was exceptional and could work out a way whatever I wanted to do in the world and I believed him. I still do, in a funny way, despite about a decade of evidence to the contrary and realizing how actually hard it is to make drugs for complex diseases. It’s extraordinarily sad how many otherwise brilliant kids might not do things they could because they don’t have a similarly supportive environment — I’m really excited for things like  Daniel Gross’s  Pioneer for that reason.\n  I feel like it was a lot of puzzle solving and doing obvious stuff. And then starting to think more independently in college, and to try to figure out what problems I wanted to work on. But I had this moment around that time where a friend and I were driving to a camping site, and I was trying to explain a math concept to him, and he abruptly turned to me and said “I’m feeling very frustrated right now because you honestly have absolutely no idea what you are talking about.”\n It’s really hard to explain without context how actually useful that comment was. As he explained it, I was just parroting off the definition of something. The real way to understand things is to be able to see, explore, feel the concept from a bunch of different angles, and to be able to rigorously prove things about it. I still struggle with the latter, but having an intuition for what  real, deep understanding of a concept looks like has been a great guidepost. For example, I realized I didn’t understand what entropy was, and now kind of do, after a summer of being in near tears with frustration about it.\n   It’s funny, because I get asked that question a lot. I think of it like this: if you were to watch a million people jump off a bridge every day and just suffer in a really extreme way throughout all of it, How would we respond as a society? An overwhelming number of people would be inspired to take action and help. When you think of it in acute, immediate terms, viscerally shocking and moving. But with longevity and other deeply existential problems, the horror of what’s happening has been tragically normalized.\n I really just wanted to work on the biggest problem possible. At first I thought that was cancer, but after a variety of experiences, aging just seemed like a bigger deal.\n I have a much less antagonistic relationship with death now than I did when I was a kid. I understand more that we are a species, that there’s something beyond us as individuals — but despite that, I absolutely cannot square the idea of sobbing when a relative gets cancer and then being totally fine with another debilitating degenerative disease also caused by aging that we somehow have collectively decided is natural and normal.\n  How has the way you learned as a kid shaped the way you learn and make decisions at the helm of The Longevity Fund?\n I’ve had to un-learn a bunch of stuff I learned when I first came to the professional world. As a kid, I was deeply joyous about science. I loved it directly and with a passion, and I absolutely believed I was going to grow up to be like Michael Faraday (his story about  getting an apprenticeship with Humphrey Davy is amazing, by the way). When I entered the world of finance with my fund, I was totally scared to seem like I didn’t know what I was doing, and I felt like it was really important to hide who I was to seem more ‘adult’. Now, in retrospect, I think that was both understandable and a bit of a mistake.\n One thing I learned as a kid that I keep on forgetting so easily is how not to care about what anyone else thinks (with a few close exceptions). It’s funny - even in Silicon Valley, hypothetically the vanguard of independent thought, I feel like that’s extremely hard to do. In part, because what other people think constrains your access to resources. So it’s an interesting balance.\n  I’ve heard you talk about your dad telling you at 12 years old to make sure that everyone was a little bit happier because you were in the lab each day. What role did your parents play in your life and education?\n Oh, man. My Dad had so much good advice as a kid — I really felt like I got a cheat code to life early on. It was like being Ben Franklin’s daughter or something. I’m probably exaggerating, but it felt that way.\n One thing he told me was ‘action comes before motivation’ - that’s always been an incredibly powerful thing in my life. He taught me a lot about putting your head down and working hard and not believing anyone who tells you you are great, having that come mostly from your own self-judgment. Being extremely humble around people who know more, finding any way on earth to help them.\n My dad also taught me a lot about humor and how ridiculous the world was in so many different ways. Almost too much - I think I take things more seriously now. But it’s kind of the Mark Twain effect - the world and everyone in it is a hilarious, self-sabotaging, foolhardy place that is also one of the most deeply joyous and interesting things going on in the galaxy. He used to say you can either look at what’s going on in the world and cry or laugh. Why not pick the latter?\n My mom taught me about kindness and empathy and wanting to help others. She’s probably the most giving person I know.\n When I first met Cynthia Kenyon, who literally changed my and many other lives – she’s amazing – I had this very extreme mental conceit that I would beg her to scrub floors in her lab and somehow work my way up on the academic ladder. I was 12. She very kindly offered for me to just work in her lab as a normal intern, which was so kind in retrospect. It changed my life, to be taken seriously like that at a young age.\n  I love how you describe the way The Longevity Fund removes limits on who can participate in biomedical entrepreneurship. How can we translate some of what you’ve learned about diverse participation in science to the way that kids learn?\n I think there’s something about being absolutely delighted when you meet someone who doesn’t know something. That feeling is the best thing in the world because  you get to be the first person to tell them about some incredibly cool natural phenomenon. That’s pretty great. I still remember being a preteen in Cynthia’s lab when Marc McCormick described how SVMs ( Support Vector Machines) worked for handwriting recognition in the postal system. He was just so good at explaining things, and that really stuck. Encourage people to own ideas, be skeptical of them, and learn to delight in poking holes in things.\n When thinking about diverse participation, it’s funny – before I came to the Valley, I had absolutely no idea that being a girl was in any way a handicap. To me, it was an obvious advantage – in a sea of people who all looked the same way, I’d stick out like a sore thumb! If I could make it, wouldn’t I obviously be an amazing role model? Being in the valley for a while, it kind of wore off, and the more articles I read about how much it sucked to be a girl in science, the more I believed it. I’m not sure what to think about all of that, really.\n    That we will see the first drug to measurably affect  human healthspan tested in the next decade, and that this is one of the biggest deals in how we thinking about disease. It’s not just hype and rhetoric.\n That original thinkers are so darn much more rare to find than I thought they’d be growing up.\n  Primer is a new education company whose goal is to help kids engage in limitless learning, starting with homeschoolers.  Homeschooled:  is a regular series about homeschooling alumni who have gone on to do amazing things. We&#39;re just getting started, so we&#39;d love to hear what you think!", "posttime": "2020-06-26 04:09:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "基金,deming,事情", "title": "长寿基金创始人劳拉·戴明(Laura Deming)谈到在家上学", "title_en": "Laura Deming, founder of the Longevity Fund, on being homeschooled", "transed": 1, "url": "https://blog.withprimer.com/laura-deming/", "via": "", "real_tags": ["基金", "deming", "事情"]}, {"category": "", "categoryclass": "", "imagename": "247add977c28a80151e64cdb8361c124.gif", "infoid": 1008274, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年6月25日(星期四)。\n无可奉告：", "note_en": "Thursday, June 25, 2020\n    No comments :", "posttime": "2020-06-26 04:09:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "传感器,sensing,星期四", "title": "无传感器深度传感", "title_en": "Depth Sensing Without Sensors", "transed": 1, "url": "https://developers.googleblog.com/2020/06/a-new-wave-of-ar-realism-with-arcore-depth-api.html", "via": "", "real_tags": ["传感器", "sensing", "星期四"]}, {"category": "", "categoryclass": "", "imagename": "557c69d7a413c199bb78c7fe5dbe4221.jpg", "infoid": 1008273, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "投资银行高盛(Goldman Sachs)发布了自己的字体：一套没有攻击性的无衬线字体，名为高盛无衬线(Goldman Sans)。但本着各地银行家的精神，这些字体在合同中都有一处可圈可点之处。正如他们的执照所规定的那样，只要你不用它来批评高盛，你就可以自由地使用高盛做任何你喜欢的事情。\n只需下载字体包，即表示您同意这些条款和条件。虽然高盛Sans名义上是一种免费字体，但高盛保留了对许可证的完全控制权，允许它以任何喜欢的理由终止使用。\nC.C.。用户不得使用经许可的字体软件来贬低或暗示与Goldman Sachs的任何从属关系或背书。\nD.2对于任何不符合本许可证中任何条件的使用，本许可证应终止并失效。此外，高盛可随时终止本许可证，而无需通知用户，完全由高盛全权酌情决定，无论是出于任何原因，还是毫无理由。\n这是一家最令人难忘的公司的低级法律厕所，它被描述为“一只伟大的吸血鱿鱼缠绕在人类的脸上，无情地将其血液漏斗塞进任何闻起来像钱的东西。”这一小小的合同条款被推特用户Matt round发现，并被波音公司(BoingBoing)发现，The Verge也看到了这一条款。\n当然，没有人应该特别感到惊讶的是，一些提升高盛品牌的营销失败并不意味着该公司实际上是在遵循平等主义的设计原则。但许可证引发了一个有趣的问题：高盛在终止该字体的使用之前，会允许多少人的诋毁？\n例如，如果你把高盛(Goldman Sachs)维基百科(Wikipedia)页面上明显冗长的“争议和法律问题”部分放在高盛无国界(Goldman Sans)网站上会怎么样？这是贬低吗？我的意思是，如果你谈论我在2008年金融危机期间如何诈骗客户以获取利润，或者我参与了一个“从马来西亚主权财富基金掠夺数十亿美元的厚颜无耻的计划”，我个人会受到伤害。话又说回来，我不是世界上最强大、最长寿、最受批评和最中伤的金融机构之一，但似乎无懈可击。我甚至没有自己的字体。", "note_en": "Investment bank Goldman Sachs has released its very own typeface: an inoffensive set of sans-serif fonts dubbed  Goldman Sans. But in the spirit of bankers everywhere, these fonts come with a catch in the contract. As their license  states, you’re free to use Goldman Sans for just about anything you like  so long as you don’t use it to criticize Goldman Sachs.\n Just by downloading the package of fonts, you agree to these terms and conditions. And although Goldman Sans is nominally a free font, Goldman Sachs retains complete control over the license, allowing it terminate usage for any reason it likes.\n  C.c. The User may not use the Licensed Font Software to disparage or suggest any affiliation with or endorsement by Goldman Sachs.\n D.2 This License shall terminate and become null and void for any use that does not comply with any of the conditions in this License. Further, Goldman Sachs may terminate this License, without notice to the User, for any reason or no reason at all and at any time, completely at Goldman Sachs’s sole discretion\n   It’s a fitting bit of low-grade legal shithousing from a company that was most  memorably described as “a great vampire squid wrapped around the face of humanity, relentlessly jamming its blood funnel into anything that smells like money.” This little contractual clause was spotted by Twitter user  Matt Round and picked up by   BoingBoing , where  The Verge saw it.\n Of course, no one should be particularly surprised that a bit of marketing fluff to bolster Goldman Sachs’ brand doesn’t actually mean the company is engaging with egalitarian design principles. But the license raises an interesting question: how much disparagement will Goldman Sachs allow before it terminates the font’s use?\n What if you took, for example, the noticeably lengthy “ Controversies and legal issues” section of Goldman Sachs’ Wikipedia page and rendered that in Goldman Sans? Is that disparagement? I mean, I would personally have my feelings hurt if you talked about how I  defrauded customers for profit during the 2008 financial crisis or about my  involvement in a “brazen scheme to loot billions of dollars from a Malaysian sovereign wealth fund.” Then again, I’m not one of the world’s most powerful, long-lived, criticized and maligned but seemingly bulletproof financial institutions. I don’t even have my own font.", "posttime": "2020-06-26 04:07:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,字体,高盛,sachs", "title": "高盛发布新字体", "title_en": "Goldman Sachs releases new font", "transed": 1, "url": "https://www.theverge.com/tldr/2020/6/25/21302831/goldman-sachs-font-sans-criticize-disparage-license", "via": "", "real_tags": ["发布", "字体", "高盛", "sachs"]}, {"category": "", "categoryclass": "", "imagename": "875f92915eaa84e3e8b186c91d5a8574.jpg", "infoid": 1008272, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为一项大胆的努力，该公司今天宣布将购买西雅图KeyArena的使用权，这是该市目前正在重新开发的一座老化的体育场。亚马逊创始人兼首席执行官杰夫·贝佐斯吹嘘说，这个体育场将“成为世界上第一个获得净零碳认证的竞技场。”\n杰夫·贝佐斯在Instagram上写道：“我们没有称它为亚马逊竞技场，而是将其命名为气候承诺竞技场，以定期提醒人们采取气候行动的迫切需要。”", "note_en": "In a bold effort to do so, the company  announced today that it would buy the rights to Seattle’s KeyArena, an aging stadium currently under redevelopment in the city. Amazon founder and CEO Jeff Bezos boasts that the stadium will “be the first net zero carbon certified arena in the world.”\n “Instead of calling it Amazon Arena, we’re naming it Climate Pledge Arena as a regular reminder of the urgent need for climate action,” Jeff Bezos  wrote on Instagram.", "posttime": "2020-06-26 03:48:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "体育,amazon,亚马逊,体育场,renamed", "title": "\n亚马逊刚刚将西雅图体育场重新命名为“气候承诺竞技场”。", "title_en": "\n\t\t\t\tAmazon really just renamed a Seattle stadium ‘Climate Pledge Arena’\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/25/amazon-climate-pledge-arena/", "via": "", "real_tags": ["体育", "amazon", "亚马逊", "体育场", "renamed"]}, {"category": "", "categoryclass": "", "imagename": "7ecb30227e69520e43eb0f3ef1b207b5.jpg", "infoid": 1008271, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最引人注目的新功能可能是声音识别，每当手机检测到用户可能想要注意的一长串常见噪音中的一个时，它就会创建一个通知。警报器、狗叫声、烟雾报警器、汽车喇叭、门铃、自来水、家电嘟嘟声--清单相当广泛。几年前，一家名为Furenexo的公司制造了一款这样的设备，但能内置它是件好事。\n用户也可以将通知发送到他们的Apple Watch上，以防他们不想总是检查手机以检查烤箱是否达到了温度。苹果公司正在努力增加更多的人和动物的声音，这样系统就有了增长的空间。\n这个功能对听障人士的效用是显而易见的，但对于那些迷失在音乐或播客中并忘记了他们放狗出来或正在等待包裹的人来说，这也是件好事。\n音频部门的另一个新功能是苹果所说的“个人听力图”，这相当于根据你听到不同频率的程度进行自定义的EQ设置。它不是一个医学工具--这不是用来诊断听力损失或其他东西的--但一些音频测试就能告诉你某些频率是否需要调高或调低。不幸的是，由于某些原因，这项功能只能在苹果品牌的耳机上使用。\n实时文本对话是一种可访问性标准，它基本上通过语音呼叫协议发送文本聊天，允许无语言的人进行无缝对话和获得紧急服务。iPhone支持它已经有一段时间了，但现在用户不需要在通话应用程序中使用它-当你玩游戏或看视频时打电话，对话就会出现在通知中。\n最后一项为听障人士设计的功能是对FaceTime通话进行分组。通常情况下，视频会自动切换到正在讲话的人--但手语当然是无声的，所以视频不会聚焦在他们身上。不管怎样，直到iOS 14，手机会将这些动作识别为手语(尽管不是任何特定的手势)，并适时地将视线切换到参与者身上。\n苹果为视力低下或没有视力的人提供的无障碍功能是可靠的，但总有增长的空间。已经存在了十多年的智能屏幕阅读功能VoiceOver已经通过机器学习模型得到了增强，该模型可以识别更多的界面项目，即使它们没有正确标记，在第三方应用程序和内容中也是如此。这一点也正在走向桌面，但还没有完全实现。\niOS的描述性印章也进行了升级，通过分析照片的内容，它现在可以用更丰富的方式将它们联系起来。例如，它可能会说“两个人坐在酒吧里喝酒”，或者不是“田里的狗”，而是“阳光明媚的日子里，一只金毛猎犬在田里玩耍”，而不是“两个人坐在一起”。嗯，我不能百分之百肯定它能把品种选对，但你明白我的意思。\n放大镜和转子控制也得到了加强，大量盲文文本现在可以自动平移。\n有视力障碍的开发人员会很高兴听到SWIFT和Xcode收到了许多新的画外音选项，并确保代码完成和导航等常见任务是可访问的。\n“回击”对苹果设备来说是一个新功能，但对Android用户来说很熟悉，他们在Pixel手机和其他设备上见过类似的功能。它使用户可以轻触手机背面两三次来激活快捷方式-当你的另一只手牵着狗的皮带或一杯茶时，调用屏幕阅读器非常方便。\n正如您可以想象的那样，该功能对几乎任何人都很有用，因为您可以自定义它来执行各种快捷方式或任务。不幸的是，该功能目前仅限于带有FaceID的手机-这使得iPhone8和SE等用户受到冷落。很难想象没有秘密的窃听检测硬件-几乎可以肯定的是，它使用的是从一开始就安装在iPhone中的加速计。\n苹果对无缘无故地劫持某些功能并不陌生，比如通知扩展，这不可能是像SE这样的全新手机。但是，使用旨在实现可访问性的功能来做到这一点是不寻常的。该公司没有排除背面轻击将用于按钮承载设备的可能性，但也不愿承诺这一想法。希望这一有用的功能很快就能得到更广泛的使用，但只有时间才能证明这一点。", "note_en": "The most compelling new feature is perhaps Sound Recognition, which creates a notification whenever the phone detects one of a long list of common noises that users might want to be aware of. Sirens, dog barks, smoke alarms, car horns, doorbells, running water, appliance beeps — the list is pretty extensive.  A company called Furenexo made a device that did this years ago, but it’s nice to have it built in.\n Users can have notifications go to their  Apple   Watch as well, in case they don’t always want to be checking their phone to check if the oven has gotten up to temperature. Apple is working on adding more people and animal sounds as well, so the system has room to grow.\n  The utility of this feature for hearing-impaired folks is obvious, but it’s also nice for anyone who gets lost in their music or podcast and forgets they let the dog out or are expecting a package.\n Also new in the audio department is what Apple is calling a “personal audiogram,” which amounts to a custom EQ setting based on how well you hear different frequencies. It’s not a medical tool — this isn’t for diagnosing hearing loss or anything — but a handful of audio tests can tell whether certain frequencies need to be boosted or dampened. Unfortunately the feature only works, for some reason, with Apple-branded headphones.\n  Real Time Text conversations is an accessibility standard that basically sends text chat over voice call protocols, allowing seamless conversations and access to emergency services for nonverbal people. It’s been supported by iPhones for some time, but now users don’t need to be in the calling app for it to work — do a call while you play a game or watch a video, and the conversation will appear in notifications.\n A last feature intended for use by the hearing impaired is an under-the-hood change to group FaceTime calls. Normally the video automatically switches to whoever is speaking — but of course sign language is silent, so the video won’t focus on them. Until iOS 14 anyway, in which the phone will recognize the motions as sign language (though not any specific signs) and duly switch the view to that participant.\n  Apple’s accessibility features for those with low or no vision are solid, but there’s always room to grow. VoiceOver, the smart screen-reading feature that’s been around for more than a decade now, has been enhanced with a machine learning model that can recognize more interface items, even if they haven’t been properly labeled, and in third party apps and content too. This is making its way to the desktop as well, but not quite yet.\n iOS’s descriptive chops have also been upgraded, and by analyzing a photo’s contents it can now relate them in a richer way. For instance, instead of saying “two people sitting,” it might say,  “two people sitting at a bar having a drink,” or instead of “dog in a field,” “a golden retriever playing in field on a sunny day.” Well, I’m not 100 percent sure it can get the breed right, but you get the idea.\n The Magnifier and Rotor controls have been beefed up as well, and large chunks of Braille text will now auto-pan.\n Developers with vision impairments will be happy to hear that Swift and Xcode have received lots of new VoiceOver options, as well as making sure common tasks like code completion and navigation are accessible.\n  The “back tap” is a feature new to Apple devices but familiar to Android users, who have seen things like it on Pixel phones and other devices. It enables users to tap the back of the phone two or three times to activate a shortcut — super handy for invoking the screen reader while your other hand is holding the dog’s leash or a cup of tea.\n As you can imagine the feature is useful to just about anyone, since you can customize it to perform all sorts of shortcuts or tasks. Unfortunately the feature is for now limited to phones with FaceID — which leaves iPhone 8 and SE users, among others, out in the cold. It’s hard to imagine that there is no secret tap-detection hardware involved — it’s almost certain that it uses accelerometers that have been in iPhones since the very beginning.\n Apple is no stranger to holding certain features hostage for no particular reason, such as the notification expansions that aren’t possible a brand-new phone like the SE. But doing so with a feature intended for accessibility is unusual. The company did not count out the possibility that the back tap would make its way to button-bearing devices, but would not commit to the idea either. Hopefully this useful feature will be more widely available soon, but only time will tell.", "posttime": "2020-06-26 03:48:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ios,允许,deaf,功能", "title": "\niOS14允许聋人用户设置重要声音的提醒，以及其他巧妙的辅助功能", "title_en": "\n\t\t\t\tiOS 14 lets deaf users set alerts for important sounds, among other clever accessibility perks\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/25/ios-14-lets-deaf-users-set-alerts-for-important-sounds-among-other-clever-accessibility-perks/", "via": "", "real_tags": ["ios", "允许", "deaf", "功能"]}, {"category": "", "categoryclass": "", "imagename": "4b8a00173c4e459122fc6536524386cc.jpg", "infoid": 1008270, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2014年，AMD表示将在2020年前将其移动处理器的能效提高25倍。但该公司已经超过了这一目标：该公司表示，新的AMD Ryzen 7 4800H移动处理器的能效比2014年的基准测试提高了31.7倍，同时提供了便携式PC的“领先性能”。\nAMD首席技术官Mark Papermaster在一份事先准备好的声明中表示：“我们一直专注于处理器的能效，但在2014年，我们决定更加重视这一能力。”我们的工程团队团结起来迎接挑战，制定了一条道路，以实现我们到2020年将能效提高25倍的延伸目标。我们能够远远超过我们的目标，实现了31.7倍的改进，导致游戏和超薄笔记本电脑具有无与伦比的性能、显卡和长电池续航时间。我为我们的工程和商业团队感到无比自豪。“。\n正如AMD指出的那样，更高的能效会带来巨大的现实利益，包括延长电池寿命、提高性能、降低能源成本，以及减少计算对环境的影响。如今，随着移动计算硬件的关注点转向性能功耗比，AMD正试图将自己定位为传统的PC芯片制造商，可以挑战ARM。\n大多数读者可能都熟悉“摩尔定律”，这是英特尔的戈登·摩尔(Gordon Moore)观察到的，集成电路中的元件数量每年都会翻一番。(至少在最初，随着时间的推移，这被修改为18个月，然后是2年。)。对于移动设备，AMD引用了斯坦福大学咨询教授乔纳森·G·库米(Jonathan G.Koomey)创立的类似的“库米定律”(Koomey‘s Law)，根据该定律，能源效率也将每一年半翻一番。\n“六年前，AMD向自己发起挑战，要求大幅提高其移动处理器的实际能效，”库米博士在谈到AMD的里程碑时说。“我审阅了数据，可以报告AMD通过改进的设计、卓越的优化以及对能效的激光般的关注，已经超过了它在2014年设定的25×20的目标。AMD芯片的能效是2014年的31.7倍，在现实世界中的能效提升远远超过了库米定律所体现的传统摩尔定律的预期速度。\n高级会员对新闻帖子的评论将以提升状态为特色，从而提高他们的可见性。此选项卡允许您与其他高级会员一起参与高级评论。注册以加入其他高级会员提升对话！\n注册或订阅。\n您没有登录但想要加入对话吗？成为瑟罗特高级或基本用户参与。\n寄存器", "note_en": "In 2014, AMD said that it would improve the energy efficiency of its mobile processors by 25 times by 2020. But the firm has exceeded that goal: The new AMD Ryzen 7 4800H mobile processor improves on the energy efficiency of the 2014 baseline measurement by 31.7 times, the firm says, while offering “leadership performance” for portable PCs.\n “We have always focused on energy efficiency in our processors, but in 2014 we decided to put even greater emphasis on this capability,” AMD CTO Mark Papermaster  says in a prepared statement. “Our engineering team rallied around the challenge and charted a path to reach our stretch goal of 25 times greater energy efficiency by 2020. We were able to far surpass our objective, achieving 31.7 times improvement leading to gaming and ultrathin laptops with unmatched performance, graphics and long battery life. I could not be prouder of our engineering and business teams.”\n As AMD notes, greater energy efficiency leads to significant real-world benefits, including improved battery life, better performance, lower energy costs, and reduced environmental impact from computing. And with the focus in mobile computing hardware switching to performance-per-watt these days, AMD is trying to position itself as the traditional PC chipmaker that can rise to the ARM challenge.\n  Most readers are probably familiar with “Moore’s Law,” the observation made by Intel’s Gordon Moore that the number of components in integrated circuits would double every year. (At least originally, this was modified over time to 18 months and then 2 years.) For mobile, AMD is citing the similar “Koomey’s Law,” created by Stanford consulting professor Jonathan G. Koomey,  by which energy efficiency will likewise double every year and a half.\n “Six years ago, AMD challenged itself to dramatically improve the real-world energy efficiency of its mobile processors,” Dr. Koomey says of AMD’s milestone. “I have reviewed the data and can report that AMD exceeded the 25×20 goal it set in 2014 through improved design, superior optimization, and a laser-like focus on energy efficiency. With a chip 31.7 times more energy-efficient than its 2014 predecessor, AMD has far outpaced in real-world efficiency gains what would be expected from a traditional Moore’s Law pace as embodied in Koomey’s Law.”\n Premium member comments on news posts will feature an elevated status that increases their visibility.This tab would allow you to participate in Premium comments with other premium members.Register to join the other Premium members in elevating the conversation!\n  Register or Subscribe\n  Don&#39;t have a login but want to join the conversation? Become a Thurrott Premium or Basic User to participate\n  Register", "posttime": "2020-06-26 03:47:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "效率,delivers,amd", "title": "AMD提供重要的移动效率里程碑", "title_en": "AMD Delivers a Major Mobile Efficiency Milestone", "transed": 1, "url": "https://www.thurrott.com/hardware/236987/amd-delivers-a-major-mobile-efficiency-milestone", "via": "", "real_tags": ["效率", "delivers", "amd"]}]