[{"category": "", "categoryclass": "", "imagename": "99f2142c0124e0d0a756ac05f1257d4d.png", "infoid": 1031619, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这并不神奇：它只是estree AST格式的S表达式编码。宏是返回对象的普通JS函数，这些对象只在编译时存在。这意味着宏可以放在NPM上来分发您自己的语言特性，如下所示。\n岩心小，靠近JS。此核心eslisp与estree抽象语法树格式紧密对应，因此与输出JSP清晰匹配。除非您使用宏，否则它纯粹是一个语法适配器。\n最大用户控制。用户必须能够轻松地扩展语言以满足他们的需要，并且能够独立于核心语言发布他们的功能。\n用户定义的宏必须像对待内置宏一样对待，并且只是普通的JS函数。这意味着您可以用编译成JavaScript的任何语言编写它们，将它们放在NPM上并需要它们。\n；宏是绑定到名称的函数，在代码上操作。这个；检查是否设置了`$DEBUG`环境变量，如果设置了，；返回对`console.log`的调用，该调用还包括传入的代码字符串。(MACRO DEBUG(lambda(Expression)(if(.。进程环境调试)(返回`((.。控制台日志)；将输入表达式编译为JavaScript，并将其转换为字符串。、(、(.。此字符串)((.。此编译程序为ToJs)((.。此编译)表达式)&#34；=&#34；，表达式))(返回NULL)(var fib；斐波那契数序列(lambda(X)；有条件编译日志记录代码(Debug X)；基本斐波那契算法(开关x(0(返回0))(1(返回1))(默认(return(+(fib(-x 1))(fib(-x 2)。\nVar fib=function(X){console.log(&#39；x&#39；，&#39；=&#39；，x)；开关(X){案例0：返回0；案例1：返回1；默认：返回fib(x-1)+fib(x-2)；}}；\n请注意，生成的console.log还具有变量x ASA字符串的名称。尝试将调试调用更改为(DEBUG((.。Math.power)(+x1)2)，并观察日志记录代码更改为Math.pow(x+1，2)也在第一个字符串中。(您可以在runkihere上的浏览器中对其进行编辑。)。\nVar fib=function(X){switch(X){case 0：return 0；case 1：return 1；default：return fib(x-1)+fib(x-2)；}}；\n与通常将调试代码隐藏在布尔标志后面的技术相比，您的输出代码更小。\n这实际上记录了产生结果的表达式。在JS中，如果不每次都手动编写，就不能做到这一点，因为您不能在编译时调用编译器。\n我希望JavaScript是同形的，并且用相同的语言编写模块宏。我觉得这是那个方向可能的相邻位置。Sweet.js是为宏而存在的，但是它们编写起来很笨拙，而且不是JavaScript。存在各种JavaScript lisp，但大多数都具有过于努力地成为Lisp(而不仅仅是一种JS语法)的特性，并且没有一个具有仅仅是JS函数的宏。\n我想要一种我能适应的语言。当我需要回指条件，或者条件编译或者文件内容内联(如BRF)，或者我最喜欢的库的特定于领域的语言，或者出于某种奇怪的原因，在编译期间黑客攻击NASA并通过grep运行我所有的While循环的疯狂事情时，我希望能够自己创建该语言功能，如果它存在，则需要从NPM获得它，从而使该语言更适用于这项工作，并在将来为其他人做得更好。\nS表达式在概念上也相当漂亮；它们只是嵌套列表，最小限度地表示抽象语法树，众所周知它们很棒，所以让我们使用有效的。\n当然，这也有很大的黑客价值。LISP宏是继薄荷冰淇淋之后最酷的东西。我还需要这么说吗？\n这是核心语言的快速概述。有关更完整的文档，请参阅基本参考或测试套件。\n；从分号到行尾的所有内容都是注释。hello；这是一个原子。&#34；hello&#34；；这是一个字符串。(Hello&#34；hello&#34；)；这是一个包含原子和字符串的列表。()；这是一个空列表。\n所有的eslisp代码都是通过在编译时调用宏来构造的。有内置的宏来生成javascript运算符、循环结构、表达式、语句…。编写任意JavaScript所需的一切。\n通过编写一个列表来调用宏，该列表将其名称作为第一个元素，并将其参数作为其余元素：\n；&#34；.&#34；宏编译为属性访问。A)(B)(.。A b5c&#34；yo&34；)；宏编译为加法。(+12)；...。对于您从JS期望的&#34；-&#34；、&#34；*&#34；和&#34；%#34；也是如此。\n如果(.。A)语法感觉单调乏味，您可能喜欢eslisp-Propertify转换宏，它允许您编写a.b。\n如果列表的第一个元素不是作用域中的宏名称，它将编译为函数调用：\n；&#34；=&#34；宏编译为变量声明。(var x(+1(*23)；调用属性访问表达式的结果((.。控制台日志)&#34；嗨&#34；)。\n；&#34；IF&#34；宏编译为IF语句(如果午餐时间；参数1成为条件(BLOCK(var Lunch(Find Food))；参数2为后件(午餐))(WriteMoreCode))；参数3(可选)为替代。\n注意BLOCK语句((BLOCK...))。必须说得很清楚。因为它太常见了，其他接受BLOCK语句作为最后一条语句的宏对此也有好处：它们只是假设您的意思是其余的都处于阻塞状态。\n例如。Lambda宏(创建函数表达式)将其第一个参数视为函数的参数名列表，其余参数视为正文中的语句。\n(Var N 10)(WHILE(--n)；第一个参数是有循环条件的(Hello N)；其余参数是循环体语句(hello(-n 1)。\n您可以使用显式BLOCK语句((BLOCK...))。任何允许含蓄的地方，如果你想的话。\n宏是在编译时运行的函数。无论它们返回什么，都会成为编译代码的一部分。用户定义的宏和预定义的编译器宏被同等对待。\n在文档/目录中有一个更全面的教程来介绍eslisp宏。这些只是一些亮点。\n您可以将宏的别名命名为您认为方便的名称，或者屏蔽任何您不想使用的名称。\n(宏a数组)(A 1)(数组1)；原始文件仍然有效...(宏数组)；...除非我们故意屏蔽它(数组1)。\n使用this上下文调用宏函数，该上下文包含便于使用宏参数的方法，例如this.valuate(编译并运行参数并返回结果)和this.atom(创建新闻表达式原子)。\n(宏add2(lambda(X)(var xPlusTwo(+(.。此评估)x)2)(RETURN((.。这个原子)xPlusTwo)(。控制台日志)(Add240)。\n(宏LOG-AND-DELETE(lambda(VarName)(return(array`(.。控制台日志)(.。Json stringify)，varName))`(delete，varName)(日志删除某些变量)。\n从宏返回NULL没有任何意义。这对于编译副作用和条件编译非常方便。\n；如果设置了`$DEBUG`环境变量(宏调试(lambda(Statement)(Return(？：(.。Process env debug)语句NULL)(DEBUG((.。控制台日志)&#34；调试输出&#34；))(是)。\n因为宏是JS函数，而JS函数可以是闭包，所以您甚至可以创建共享状态的宏。一种方法是将它们放入立即调用的函数表达式(LIFE)中，在对象中返回它们，然后将其传递给宏。对象的每个属性都作为宏导入，并且生命周期中的变量在它们之间共享。\n(宏((lambda()(Var X 0)；对所有宏函数(Return(对象增量(lambda()(Return((.。这个原子)(++x)递减(lambda()()(return((.。这个原子)(--x)get(lambda()(return((.。这个原子)x)(increment)(decrement)(get)。\n宏的第二个参数需要计算为函数，但它可以是任意的，因此您可以将宏函数放在单独的文件中并执行以下操作-。\n这意味着您可以在NPM上发布eslisp宏。建议使用名称前缀eslisp-和关键字eslisp-宏。有些已经存在了。\n从命令行运行ESLC时，要在编译期间将转换宏应用于eslisp文件，请提供--Transform&lt；宏名称&gt；参数(缩写为-t；)。例如,。\n使用eslisp-Propertify将所有包含点的原子转换为成员表达式。可以多次指定该标志。\n如果需要在$PATH中使用ESLC，请安装NPM--global eslisp。(您可能需要sudo。)。然后ESLC程序将eslisp代码作为输入输出JavaScript。\n如果在没有参数的情况下交互运行，编译器将加载一个REPL，您可以在该REPL中键入命令以对其进行测试。\n您还可以将eslisp用作模块：它导出一个函数，该函数接受一串eslisp代码作为输入，并输出一串JavaScript，如果发现错误，就会抛出错误。\n简而言之：使用一个预定义宏表将S表达式转换为SpiderMonkey AST，然后将其提供给escodegen，由escodegen输出JS。其中一些宏允许定义更多宏，这些宏被添加到表中，从那时起就像预定义的宏一样工作。", "note_en": "This is not magic: It&#39;s just an S-expression encoding of the  estree ASTformat. The macros are ordinary JS functions that return objects, which justexist at compile-time. This means macros can be put on  npm to distributeyour own language features,  like this.\n   Small core, close to JS. This core eslisp corresponds closely with the estree abstract syntax tree format, and hence matches output JSclearly. It&#39;s purely a syntax adapter unless you use macros.\n Maximum user control. Users must be able to easily extend the languageto their needs, and to publish their features independently of the corelanguage.\n User-defined macros must be treated like built-in ones, and are justordinary JS functions. This means you can write them in anything thatcompiles to JavaScript, put them on  npm, and  require them.\n   ; Macros are functions bound to names, which operate on code. This one; checks whether the `$DEBUG` environment variable is set, and if so,; returns a call to `console.log` that also includes a string of the code; that was passed in.(macro debug (lambda (expression) (if (. process env DEBUG) (return `((. console log) ; Compile the input expression to JavaScript, and convert ; that to a string. ,((. this string) ((. this compileToJs) ((. this compile) expression))) &#34;=&#34; ,expression)) (return null))))(var fib ; Fibonacci number sequence (lambda (x) ; Conditionally compile logging code (debug x) ; Basic Fibonacci algorithm (switch x (0 (return 0)) (1 (return 1)) (default (return (+ (fib (- x 1)) (fib (- x 2))))))))\n  var fib = function (x) { console.log(&#39;x&#39;, &#39;=&#39;, x); switch (x) { case 0: return 0; case 1: return 1; default: return fib(x - 1) + fib(x - 2); }};\n Note how the generated  console.log also has  the name of the variable  x asa string. Try changing the  debug call to  (debug ((. Math pow) (+ x 1) 2)and watch the logging code change to say  Math.pow(x + 1, 2) also inside thefirst string. (You can edit it in your browser  on runkithere.)\n  var fib = function (x) { switch (x) { case 0: return 0; case 1: return 1; default: return fib(x - 1) + fib(x - 2); }};\n  Your output code is smaller, compared to the usual technique of hiding yourdebug code behind a boolean flag.\n This actually logs the expression that produced the result. Can&#39;t do thatin JS without writing it manually every time, because you can&#39;t invoke thecompiler at compile-time.\n  I wanted JavaScript to be  homoiconic and have modular macros written inthe same language. I feel like this is the  adjacent possible in thatdirection.  Sweet.js exists for macros, but theyre awkward to write andaren&#39;t JavaScript.  Various JavaScript lisps exist, but most havefeaturitis from trying too hard to be Lisp (rather than just being a JSsyntax), and none have macros that are just JS functions.\n I want a language that I can adapt. When I need  anaphoric conditionals,or  conditional compilation or file content inlining (like  brfs), ora  domain-specific language for my favourite library, or something insanethat hacks NASA and runs all my while-loops through  grep during compilationfor some freak reason, I want to be able to create that language feature myselfor  require it from npm if it exists, and hence make the language better forthat job, and for others doing it in the future.\n  S-expressions are also quite conceptually beautiful; they&#39;re just nested lists,minimally representing the  abstract syntax tree, and it&#39;s widely knownthat  they rock, so let&#39;s use what works.\n This has great  hack value too of course.  Lisp macros are thecoolest thing since mint ice cream. Do I even need to say that?\n    This is a quick overview of the core language. See  the basics referenceor the  test suite for a more complete document.\n   ; Everything from a semicolon to the end of a line is a comment.hello ; This is an atom.&#34;hello&#34; ; This is a string.(hello &#34;hello&#34;) ; This is a list containing an atom and a string.() ; This is an empty list.\n   All eslisp code is constructed by calling macros at compile-time. There arebuilt-in macros to generate JavaScript operators, loop structures, expressions,statements… everything needed to write arbitrary JavaScript.\n  A macro is called by writing a list with its name as the first element and itsarguments as the rest:\n ; The &#34;.&#34; macro compiles to property access.(. a b)(. a b 5 c &#34;yo&#34;); The &#34;+&#34; macro compiles to addition.(+ 1 2); ... and similarly for &#34;-&#34;, &#34;*&#34;, &#34;/&#34; and &#34;%&#34; as you&#39;d expect from JS.\n  If the  (. a b) syntax feels tedious, you might like the  eslisp-propertify transform macro, which lets you write  a.b instead.\n If the first element of a list isn&#39;t the name of a macro which is in scope, itcompiles to a function call:\n    ; The &#34;=&#34; macro compiles to a variable declaration.(var x (+ 1 (* 2 3))); Calling the result of a property access expression((. console log) &#34;hi&#34;)\n    ; The &#34;if&#34; macro compiles to an if-statement(if lunchtime ; argument 1 becomes the conditional (block (var lunch (find food)) ; argument 2 the consequent (lunch)) (writeMoreCode)) ; argument 3 (optional) the alternate\n  Note how the block statement ( (block ...)) has to be made explicit. Becauseit&#39;s so common, other macros that accept a block statement as their lastargument have sugar for this: they just assume you meant the rest to be in ablock.\n For example. the  lambda macro (which creates function expressions) treats itsfirst argument as a list of the function&#39;s argument names, and the rest asstatements in the body.\n    (var n 10)(while (-- n) ; first argument is loop conditional (hello n) ; the rest are loop-body statements (hello (- n 1)))\n  You  can use an explicit block statements ( (block ...)) wherever implicitones are allowed, if you want to.\n     Macros are functions that run at compile-time. Whatever they return becomespart of the compiled code. User-defined macros and pre-defined compiler onesare treated equivalently.\n There&#39;s a  fuller tutorial to eslisp macros in the  doc/ directory.These are just some highlights.\n You can alias macros to names you find convenient, or mask any you don&#39;t wantto use.\n (macro a array)(a 1)(array 1) ; The original still works though...(macro array) ; ...unless we deliberately mask it(array 1)\n     The macro function is called with a  this context containing methods handy forworking with macro arguments, such as  this.evaluate, which compiles and runsthe argument and returns the result, and  this.atom which creates a newS-expression atom.\n (macro add2 (lambda (x) (var xPlusTwo (+ ((. this evaluate) x) 2)) (return ((. this atom) xPlusTwo))))((. console log) (add2 40))\n   (macro log-and-delete (lambda (varName) (return (array `((. console log) ((. JSON stringify) ,varName)) `(delete ,varName)))))(log-and-delete someVariable)\n  Returning  null from a macro just means nothing. This is handy forcompilation side-effects and conditional compilation.\n ; Only include statement if `$DEBUG` environment variable is set(macro debug (lambda (statement) (return (?: (. process env DEBUG) statement null))))(debug ((. console log) &#34;debug output&#34;))(yep)\n  Because macros are JS functions and JS functions can be closures, you can evenmake macros that share state. One way is to put them in an immediately-invoked function expression (IIFE), return them in an object,and pass that to  macro. Each property of the object is imported as a macro,and the variables in the IIFE are shared between them.\n (macro ((lambda () (var x 0) ; visible to all of the macro functions (return (object increment (lambda () (return ((. this atom) (++ x)))) decrement (lambda () (return ((. this atom) (-- x)))) get (lambda () (return ((. this atom) x))))))))(increment)(increment)(increment)(decrement)(get)\n   The second argument to  macro needs to evaluate to a function, but it can bewhatever, so you can put the macro function in a separate file and do—\n   This means you can publish eslisp macros on  npm. The name prefix eslisp- and keyword  eslisp-macro are recommended.  Some existalready.\n  When running  eslc from the command line, to apply a transformation macro toan eslisp file during compilation, supply the  --transform &lt;macro-name&gt;argument ( -t for short). For example,\n  uses  eslisp-propertify to convert all atoms containg dots into memberexpressions. The flag can be specified multiple times.\n   If you want  eslc in your   $PATH,  npm install --global eslisp. (Youmight need  sudo.) Then  eslc program takes eslisp code as input and outputsJavaScript.\n If run interactively without arguments, the compiler loads a  REPL thatyou can type commands into to test them.\n       You can also use eslisp as a module: it exports a function that takes a stringof eslisp code as input and outputs a string of JavaScript, throwing errors ifit sees them.\n  In brief: A table of predefined macros is used to turn S-expressions into SpiderMonkey AST, which is fed to  escodegen, which outputs JS.Some of those macros allow defining further macros, which get added to thetable and work from then on like the predefined ones.", "posttime": "2020-10-28 05:07:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,javascript,ecmascript,expression,编译", "title": "Eslisp-ECMAScript/JavaScript的S表达式语法，带有类似Lisp的宏", "title_en": "Eslisp – An S-expression syntax for ECMAScript/JavaScript, with Lisp-like macros", "transed": 1, "url": "https://github.com/anko/eslisp", "via": "", "real_tags": ["java", "编译"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031618, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "是的，那是因为苹果正在采取环保措施来减少浪费，而不是再给你一块收费砖，而你，一个忠实的苹果客户，可能已经有很多这样的东西了。\n自从iPhone问世以来，我每两年就会买一部新的iPhone，我非常忠诚！这样我就可以用我家里已经有的六块砖中的一块了？\n嗯，不，看看随附的闪电电缆不能与我们随iPhone一起发货的任何砖块一起工作，除了去年的iPhone11专业版。\n那么好吧，我想这没问题，我想我可以用家里的一根磨损较小的电缆给这部手机充电。\n不要操之过急，因为我们有一种新的充电技术，我们认为你会喜欢的：MagSafe。它是无线充电的，但它比以前的iPhone和磁铁更快，这也使它更可靠。\n太棒了，让我们这样做吧。看起来冰球是40美元。这个数字有点高，但是听起来很酷，所以让我们开始吧。\n我会把它加到您的包里。现在告诉我，你们有苹果公司的20W USB-C充电砖可以用吗？它也没有带充电砖，要达到宣传的速度，你就需要用到那块砖。从字面上看，没有其他充电砖能达到这样的速度。\n所以我们也会把其中一件放到您的包里。现在，您将获得我们一直在宣传的完整的iPhone12体验，这是您应该拥有的体验！\n这听起来似乎都很好用，但现在我有了一部新手机，两条新电缆和一块新充电砖，但我没有用iPhone买到充电砖，因为那应该有助于减少浪费？&#34；\n&#34；你说对了。感谢您购买我们的广告所说的您应该购买的东西，并享受您的新iPhone。\n再说一次，我不是在反对公司减少浪费的举措。上面的理论对话旨在说明环境信息对消费者来说听起来是多么空洞。\n是的，移除每个iPhone盒子上的充电砖将减少浪费，这将使苹果能够在更少的飞机/火车/卡车上出货更多的iPhone。但如果你稍微扩大一下你的视野，你就会发现他们的其他营销活动都没有支持这一目标，而且实际上与之背道而驰。他们引入了一种新的充电方法，无论如何都会让很多人买一块新的充电砖，他们正在推动一种比有线充电浪费更多电力的无线充电技术，他们还有一项iPhone升级计划，鼓励人们每12个月更换一次新iPhone。\n这并不是说我讨厌苹果，也不是说我打算退还我的iPhone并全天候使用Android。我对苹果持批评态度，因为我真的很喜欢这家公司，我认为这一环保信息并不像我认为的那样站得住脚。", "note_en": "&#34;Yup, that&#39;s because Apple is making the environmental move to reduce waste and not give you yet another charging brick when you, a loyal Apple customer likely have tons of these already.&#34;\n &#34;I have bought a new iPhone every 2 years for as long as iPhones have existed, I&#39;m extremely loyal! So I can use one of the half dozen bricks I have in my house already?&#34;\n &#34;Well, no, see the included Lightning cable doesn&#39;t work with any brick we&#39;ve shipped with an iPhone except last year&#39;s iPhone 11 Pro.&#34;\n &#34;Ok then, I guess that&#39;s fine, I suppose I can use one of the less-frayed cables I have at home to charge this phone.&#34;\n &#34;Don&#39;t get too ahead of yourself, because we have this new charging technology that we think you&#39;re going to love: MagSafe. It&#39;s wireless charging, but it&#39;s faster than previous iPhones and magnets make it more reliable too.&#34;\n &#34;Fantastic, let&#39;s do that. Looks like it&#39;s $40 for the puck. That&#39;s a bit more, but it sounds cool so let&#39;s do it.&#34;\n &#34;I&#39;ll add it to your bag. Now tell me, do you have Apple&#39;s 20W USB-C charging brick to use with this? It doesn&#39;t come with a charging brick either, and to get the advertised speeds then you need to use that brick. Literally no other charging bricks will get that speed.&#34;\n  &#34;So we&#39;ll just add one of those to your bag as well. Now you&#39;re getting the full iPhone 12 experience we&#39;ve been advertising you should want to have!&#34;\n &#34;This sounds like it will all work great, but now I have a new phone, two new cables, and one new charging brick, but I didn&#39;t get a charging brick with the iPhone because that was supposed to help reduce waste?&#34;\n &#34;You got it. Thanks for buying the things our ads say you should buy, and enjoy your new iPhone.&#34;\n  Again, I&#39;m not arguing against corporate initiatives to reduce waste. The theoretical conversation above aims to illustrate how hollow that environmental message can sound to consumers.\n Yes, removing the charging brick from each iPhone box will reduce waste, and it will allow Apple to ship more iPhones on fewer planes/trains/trucks. But if you expand your view just a bit, you can really see how none of their other marketing backs up this goal, and in fact runs counter to it. They&#39;ve introduced a new charging method that is going to get lots of people to buy a new charging brick anyway, they&#39;re pushing a wireless charging technology that wastes far more electricity than wired charging, and they have an iPhone Upgrade Program that encourages people to get a new iPhone every 12 months.\n None of this is to say I hate Apple or am about to return my iPhone and use Android full time. I&#39;m critical of Apple because I really like the company and I don&#39;t think this environmental message holds up as well as I think it should.", "posttime": "2020-10-28 05:07:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,苹果,男人,walks,充电", "title": "一个男人走进一家苹果店", "title_en": "A Guy Walks into an Apple Store", "transed": 1, "url": "https://birchtree.me/blog/a-guy-walks-into-an-apple-store/", "via": "", "real_tags": ["apple", "苹果", "男人", "walks", "充电"]}, {"category": "", "categoryclass": "", "imagename": "7f3823c14971dc80f9973aaaa4ec91a4.png", "infoid": 1031617, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我承认，我喜欢“我的世界”。我喜欢如何建造我梦想的房子，拥有我自己的彩虹牧羊场，以及骑马去随机的冒险。我喜欢在危险的洞穴里寻找钻石宝藏，喜欢在日落时爬上超高的山峰看风景。从我记事起，“我的世界”对我来说就很有趣。\n作为一名母亲，我想和我四岁的双胞胎们分享我对“我的世界”的爱！\n我想让他们看看，为什么我这么喜欢它！所以，我丈夫和我创建了我们自己的家庭服务器，我们用它来向我们的孩子介绍“我的世界”。[如果您想要为您的家人创建自己的低成本随需应变Mincraft服务器，这非常容易，您可以在这里完成]。\n我们一展示我们的双胞胎兄弟“我的世界”，他们就疯狂了。他们开始大笑，感谢我们允许他们玩这个看起来很有趣的游戏。他们意识到他们每个人都是一个小小的人类，他们有一个完全数字化的世界可以一起探索、建造、毁灭、创造和毁灭！他们花了几个小时的时间四处飞来飞去探索。有的时候，他们为了一个共同的目标而合作，有的时候，他们在游戏中厚颜无耻地互相骚扰，还有一些时候，他们在玩“我的世界”里有趣的捉迷藏游戏。但在某种程度上，他们想要更多。\n我的双胞胎们想用他们在现实生活中喜欢的材料建造高大的“我的世界”建筑，比如鹅卵石和羊毛。\n所以他们开始向我求助。他们要我尽快在库存中找到他们要找的东西！他们在库存中滚动，直到找到他们想要的物品，这让他们感到沮丧和无聊。\n但对我来说，帮助他们太耗时了。如果每次他们玩“我的世界”时，我都得坐在那里帮他们找到他们想要的一切，那就意味着我不能做任何家务活。我不会洗衣服，我不会洗碗，我不会做午餐！但我想利用他们玩“我的世界”的一些时间来做家务。我们需要一个解决方案！\n所以，我想教他们如何使用库存的搜索特性。我会告诉他们字母的声音，他们会在键盘上找到字母，就像这里的视频一样。\n如果他们找不到他们要找的东西，仅凭每个字母的发音，他们就会给我一张纸和笔，让我用大写字母(就像他们在键盘上一样)，我还会加上一个小图画，画出这个单词代表的是什么。例如，如果他们不能仅凭声音写一个苹果，我就会写一个苹果，然后画一个小苹果！因为我天生不擅长保持东西超级整洁，所以每次我都会弄丢我的笔记，而且每次双胞胎玩“我的世界”时我都得重新做一个笔记。\n随着时间的推移，我的孩子们要求的单词越来越少，但他们仍然在使用“我的世界”库存的“搜索”属性来查找他们需要的物品。他们还会使用各种各样的物品，甚至开始有更先进的体验，比如驯养和骑马，饲养动物，制作工艺品！他们是怎么做到的？\n是的，他们在拼写自己的单词。他们会写水桶，他们会写鸡蛋，他们会写南瓜，他们会写羊毛！看到他们以如此有趣和独立的方式获得这些技能，真是令人惊讶！事实上，我还记得有一天，我的一个双胞胎姐妹问她的妹妹我们怎么拼写岩浆，因为她想用岩浆在她家里做一个捕鼠室，她姐姐为她拼写了这个拼写！我看到我的孩子们从我非常喜欢的游戏中学到了技能！\n我看到我的孩子在无人监督的情况下学习、阅读和写作，一边大笑，一边体验他们的冒险经历。更令人惊讶的是，他们开始在现实生活中读单词，这一切都是从玩“我的世界”开始的，还有一位太忙而没有时间真正帮助的母亲！\n我想知道，我的女儿们还能从“我的世界”和其他创意游戏中学到多少东西呢？学习不一定要有条理，也不一定要用我们认为合适的方式！\n稍微介绍一下我自己：我是一名科学家，也是双胞胎的母亲。我制作了带有快速STEM教育活动的视频，供年幼的孩子和家长/教育工作者在视频的同时一起观看和玩耍。我的视频以一种非常独特和有趣的方式设计，鼓励孩子们对科学活动感到快乐和兴奋，这样他们就可以享受乐趣和学习：)在这里查看它们：https://www.youtube.com/c/PausePlay/", "note_en": "I admit it, I love Minecraft. I love how I can create my dream house, have my very own rainbow sheep farm, and ride horses to random adventures. I love finding diamond treasures in dangerous caves and climbing super high mountains to see the views during the sunset. Minecraft was fun for me since I remember.\n As a mother, I wanted to share my love for Minecraft with my four-year-old twins!\n I wanted to show them, why I loved it so  much! So, my husband &amp; I created our very own family server which we used to introduce our kids to Minecraft . [If you like to create your own low-cost on-demand Minecraft server for your family, it&#39;s super easy, you can do it   here  ]\n As soon as we showed our twins Minecraft, they went wild. They started laughing and thanking us for allowing them to play with this fun looking game. They realized that each one of them was a little human, and they have an entirely digital world to explore together, built, ruin, create, and destroy! They spend hours just flying around exploring. Sometimes, they were collaborating towards a common goal, some others, they were being cheeky bothering each other in the game, and some other times they were playing fun hide and seek games in Minecraft. But at some point, they wanted more.\n My twins wanted to build tall Minecraft buildings from materials they liked in real life such as cobblestones and wool.\n So they started asking me for help. They wanted me to find them the items they were looking for in the inventory and FAST! They were getting frustrated and bored in scrolling around the inventory until they find the items they wanted.\n But for me, it was too time-consuming helping them. If every time they played Minecraft I had to sit there and help them find everything they wanted, it meant I could not do any household jobs. I couldn’t do the laundry, I couldn’t do the dishes, I couldn’t cook lunch! But I wanted to use some of the time they were playing Minecraft, to do the household chores. We needed a solution!\n So, I thought of teaching them how to use the SEARCH property of their inventory. I would tell them the sound of the letter, and they would find the letter on the keyboard, just like the video here.\n  If they couldn’t find what they were looking for, just by the sounds of each letter, they would bring me a paper and pen to write the letters in the capital (just as they are on the keyboard) and I would also add a small drawing of what that word represents. For example, if they couldn’t write an apple just from sounds, I would write APPLE and draw a little apple! Since I am naturally bad at keeping things super tidy, I would lose my note every time, and I would have to make a new one every time the twins played Minecraft.\n  As time progressed, my kids were asking for fewer and fewer words but they were still using the “SEARCH” property of Minecraft inventory to find the items they needed. They will still use a variety of items, and they even started having more advanced experiences, such as taming and riding horses, breeding animals, and crafting! How did they do it?\n  Yes, they were spelling their own words. They could write bucket, they could write eggs, they could write pumpkin, they could write wool! It was amazing to see them acquiring these skills in such a fun and independent way! In fact, I still remember one day, when one of my twins asked her sister how do we spell magma, as she wanted to use magma for a trap room in her house, and her sister spelled it for her! I saw my kids gaining skills from a game I love so much!\n I saw my kids learning reading and writing unsupervised while laughing and living their adventures. Even more amazing, the started reading words in real life, and it all started from playing Minecraft and a mother who was too busy to actually help!\n I wonder, how many more things can my girls learn from Minecraft and other creative games. Learning doesn’t always have to be structured and with a way we find proper!\n   A little bit about myself: I am a scientist mum of twins. I create videos with quick STEM educational activities for young kids and parents/educators to watch and play together, in parallel to the video. My videos are design in a very unique and playful way, encouraging kids to feel happy and excited for science activities so they can have fun and learn:) Check them out here:   https://www.youtube.com/c/PausePlay/", "posttime": "2020-10-28 05:01:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "写作,writing,世界", "title": "阅读和写作技能可以通过“我的世界”来教授", "title_en": "Reading and writing skills can be taught through Minecraft", "transed": 1, "url": "https://phoinixdurden.medium.com/i-used-minecraft-to-teach-my-kids-reading-and-writing-5361b5c49691", "via": "", "real_tags": ["写作", "writing", "世界"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031616, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "将任何任务缩减为2分钟版本，以便更轻松地开始。\n当你发现很难开始一项任务时，考虑把它缩减成2分钟的版本。例如,。\n我们的想法是让入门变得超级容易。一旦你通过了起点，这可以说是最困难的一步，你就开始获得继续完成任务本身的动力：\n正如你所看到的，一旦你开始了，继续做下去就容易多了。有时候，你会发现自己甚至在意识到之前就已经完成了任务。\n有关系统规划和目标设置的更多见解，请随时查看Motion→", "note_en": "Scale any task down into a 2-minute version to make it easier to get started\n  Whenever you find it hard to get started on a task, consider scaling it down into a 2-minute version. For example,\n  The idea is to make it super easy to get started. Once you pass the starting point, which is arguably the hardest step, you start to gain momentum to keep doing the task itself:\n  As you can see, once you start, it is much easier to continue doing it. Sometimes, you’ll find yourself completing the task even before you even notice it.\n For more insights on system planning and goal setting, feel free to check out  Motion →", "posttime": "2020-10-28 05:01:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "minute,继续", "title": "开始使用2分钟规则", "title_en": "Get started with 2-minute rule", "transed": 1, "url": "https://hoanhan.co/2-minute-rule", "via": "", "real_tags": ["minute", "继续"]}, {"category": "", "categoryclass": "", "imagename": "a3504e207de007f0a64a33f4b27a65de.jpeg", "infoid": 1031615, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伦敦(路透社)-研究人员周二警告称，新冠肺炎康复的人可能会遭受重大的大脑功能影响，与精神衰退有关的最严重感染病例相当于大脑老化10年。\n由伦敦帝国理工学院(Imperial College London)医生亚当·汉普希尔(Adam Hampshire)领导的一项对8.4万多人进行的非同行评议研究发现，在一些严重的病例中，冠状病毒感染与长达数月的严重认知缺陷有关。\n“我们的分析...。与新冠肺炎有慢性认知后果的观点一致，“研究人员在他们的发现报告中写道。“康复的人，包括那些不再报告症状的人，表现出明显的认知缺陷。”\n认知测试衡量大脑完成任务的能力，比如记住单词或拼图上的点。这类测试被广泛用于评估阿尔茨海默氏症等疾病的大脑表现，也可以帮助医生评估暂时性的大脑损伤。\n汉普郡的团队分析了84,285人的结果，这些人完成了一项名为“伟大的英国智力测试”的研究。这些发现尚未得到其他专家的审查，已在MedRxiv网站上在线发布。\n研究人员表示，认知缺陷“影响很大”，特别是那些曾与新冠肺炎一起住院的人，最严重的情况表现出的影响“相当于20岁至70岁之间全球表现的平均10年下降”。\n然而，没有直接参与这项研究的科学家表示，应该谨慎看待研究结果。\n爱丁堡大学应用神经成像学教授乔安娜·沃德洛(Joanna Wardlaw)说：“参与者的认知功能在COVID之前是未知的，结果也不能反映长期的恢复--所以对认知的任何影响都可能是短期的，”爱丁堡大学(Edinburgh University)应用神经成像学教授乔安娜·沃德洛(Joanna Wardlaw)说。\n伦敦大学学院(University College London)医学影像科学教授德里克·希尔(Derek Hill)也指出，这项研究的结果并不完全可靠，因为它们没有比较分数前后的差异，而且涉及大量自称患有新冠肺炎的人，但他们的测试没有呈阳性。\n希尔说：“总的来说，这是一项关于COVID对大脑影响的耐人寻味但没有定论的研究。”\n随着研究人员寻求更好地了解COVID的长期影响，进一步调查在感染后的几周和几个月内认知受到影响的程度，以及是否会对某些人的大脑功能造成永久性损害，将是很重要的。“", "note_en": "LONDON (Reuters) - People recovering from COVID-19 may suffer significant brain function impacts, with the worst cases of the infection linked to mental decline equivalent to the brain ageing by 10 years, researchers warned on Tuesday.\n  A non-peer-reviewed study of more than 84,000 people, led by Adam Hampshire, a doctor at Imperial College London, found that in some severe cases, coronavirus infection is linked to substantial cognitive deficits for months.\n “Our analyses ... align with the view that there are chronic cognitive consequences of having COVID-19,” the researchers wrote in a report of their findings. “People who had recovered, including those no longer reporting symptoms, exhibited significant cognitive deficits.”\n Cognitive tests measure how well the brain performs tasks - such as remembering words or joining dots on a puzzle. Such tests are widely used to assess brain performance in diseases like Alzheimer’s, and can also help doctors assess temporary brain impairments.\n  Hampshire’s team analysed results from 84,285 people who completed a study called the Great British Intelligence Test. The findings, which have yet to be reviewed by other experts, were published online on the MedRxiv website.\n The cognitive deficits were “of substantial effect size”, particularly among people who had been hospitalised with COVID-19, the researchers said, with the worst cases showing impacts “equivalent to the average 10-year decline in global performance between the ages of 20 to 70”.\n Scientists not directly involved with the study, however, said its results should be viewed with some caution.\n  “The cognitive function of the participants was not known pre-COVID, and the results also do not reflect long-term recovery - so any effects on cognition may be short term,” said Joanna Wardlaw, a professor of applied neuroimaging at Edinburgh University.\n Derek Hill, a professor of medical imaging science at University College London, also noted that the study’s findings could not be entirely reliable, since they did not compare before and after scores, and involved a large number of people who self-reported having had COVID-19, who had no positive test.\n “Overall (this is) an intriguing but inconclusive piece of research into the effect of COVID on the brain,” Hill said.\n “As researchers seek to better understand the long term impact of COVID, it will be important to further investigate the extent to which cognition is impacted in the weeks and months after the infection, and whether permanent damage to brain function results in some people.”", "posttime": "2020-10-28 04:54:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "认知,大脑,cognitive", "title": "科维德的认知成本？有些病人的大脑可能老化10年。", "title_en": "Covid's cognitive costs? Some patients' brains may age 10 years", "transed": 1, "url": "https://www.reuters.com/article/idUSL8N2HI38G", "via": "", "real_tags": ["认知", "大脑", "cognitive"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031614, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着假日旅游旺季的临近，航空公司正试图说服人们乘坐飞机是安全的，并兜售研究表明让新冠肺炎登机的风险微乎其微，但近百名联邦空警的病毒检测呈阳性。\n上周，多起新冠肺炎案件袭击了联邦空警达拉斯办事处，并关闭了其在费城的外地办事处。10月初，明尼阿波利斯的一名空警死于新冠肺炎；几名空警告诉雅虎新闻，已故的空警认为他是在航班上感染病毒的。\n运输安全管理局告诉雅虎新闻，98名联邦空警的新冠肺炎病毒检测呈阳性，但没有说明这些病例是否来自飞行。然而，一些空警-保护民用飞机免受袭击的武装执法官员-至少将其中一些感染与他们在机场和航班上度过的时间直接联系起来。\n这两个协会代表了近3000名联邦空警中的许多人，他们也认为，至少有一些成员在航班上的工作中感染了冠状病毒，尽管他们承认，其中一些病例是在大流行开始时，在全国范围内关闭或在航班上引入口罩之前。\n该协会主席约翰·卡萨雷蒂(John Casaretti)表示：“(空警协会)在疫情爆发之初就知道有一个(联邦空警)病例，可以肯定地与一架欧洲航班有关。”该协会代表大约一半的空警。\n代表一些空警的另一个组织-空军元帅全国委员会(Air Marshal National Council)主席索尼娅·海托尔·拉博斯科(Sonya HighTower LaBosco)也表示，它已经确认了一些病例，他们认为自己的成员从飞机上感染了病毒。“当然，我们知道他们让它飞起来了，”她说。\n虽然航空旅行处于历史低点，但联邦空警仍在乘坐飞机，以保护他们免受恐怖袭击，在大流行期间，这项工作现在带来了一系列新的风险。最近一名空警死亡，以及最近的其他案例，正值航空公司不顾一切地让公众相信飞行是安全的，强调他们的通风系统、消毒程序和强制性口罩要求。\n从飞行中感染冠状病毒的风险是一些研究的主题，但结论有些相互矛盾。最近航空业的一项研究声称，传播新冠肺炎的风险微乎其微，哈佛大学研究人员周二发布的一份新报告称，“到目前为止的研究表明，在飞行中感染SARS-CoV-2的风险相对很低。”但本周在爱尔兰发布的另一份报告指出，一架几乎空无一人的长途航班上，49名乘客中有13名-其中大多数是蒙面乘客-感染了病毒。\n空警和其他执法人员面临的问题之一是，通常不可能确切知道他们在哪里感染了病毒。参议院今年8月通过的一项法案延长了公共安全官员的福利-空警是执法人员，属于该称号-该法案建立了一个一般推定，即死于新冠肺炎或相关并发症或因公受伤的公共安全官员因此有资格获得死亡和伤残福利。\n“自从实施口罩和疏远措施以来，AMA已经协助了大约36名FAM提出与COVID相关的福利索赔，但每月都会发生更多的案件，”空警协会主席卡萨雷蒂(Casaretti)说。\n他补充说：“虽然文书工作可能表明航空航天公司因为他们所做的工作类型而感染了COVID，但这并不一定意味着他们在飞机上感染了COVID。”\n试图推断从空警到普通公众的飞行风险是困难的，因为官员们在机场和航班上花费的时间比大多数飞行的公众要多得多。\n卡萨雷蒂说：“FAM的飞行时间比大多数机组人员都多，而且在交通枢纽和酒店里呆了无数个小时，所以风险永远不会是零。”“由于恐怖分子和犯罪活动继续以航空为目标，他们承受着密闭空间和再循环空气造成的与COVID相关的固有飞行风险。”\n也不可能知道有多少空警被感染。虽然有98名空警的新冠肺炎检测呈阳性，但自疫情开始以来，感染总人数可能更高，因为根据采访和该机构的内部沟通，在疫情爆发初期，空警和其他人一样，往往无法获得检测结果。\n据知情人士透露，在某些情况下，空警在执勤时生病，被迫在美国和海外的酒店进行隔离，等待症状消退。(两名属于这一类别的空警告诉雅虎新闻，他们相信自己抓到了新冠肺炎，但他们无法接受测试。)。\n运输安全管理局没有回答雅虎新闻关于该机构所谓的“推定案件”数量的问题，但提供了关于新冠肺炎政策的一般性声明。\n“关于联邦空警，运输安全管理局在其所有行动中都采取了重大措施来限制新冠肺炎的传播，”该机构的一名官员告诉雅虎新闻。包括联邦空警在内的所有TSA员工在工作时和在公共场合担任不可能保持社交距离的角色时，都被要求穿上个人防护装备。\n运输安全管理局表示，它将“非常严肃地”对待其员工中所有新冠肺炎的案件，以及潜在的风险暴露。该机构表示：“在联邦空警新冠肺炎检测呈阳性的情况下，进入外地办事处进行清理暂时受到限制。”\n然而，联邦空警服务局(Federal Air Marshal Service)的一些人表示，这份工作的性质经常让他们与疾病控制和预防中心(Centers For Disease Control And Prevention)的指导意见不符，特别是在大流行的早期，他们经常处于危险的境地。根据内部电子邮件，空警在夏天被告知忽略德克萨斯州、佛罗里达州和纽约州等州在不同时间实施的检疫旅行限制。\n两名驻扎在不同城市的空警告诉雅虎新闻，今年夏天，他们都被安排执行任务-分配给他们的航班-当时他们正在等待检测结果出来，或者是在尝试检测失败后。在这两种情况下，空警都与不同城市的同事会面，延长了与这些团队的时间，这些团队后来检测呈阳性，然后感染了家乡的其他人。在这两种情况下，空警都与不同城市的同事会面，延长了与这些团队的时间，这些团队后来检测呈阳性，然后感染了家乡的其他人。\n一位感染了新冠肺炎的空警告诉雅虎新闻：“我是一个超级传播者，这让我很痛苦，但我就是这样。”\n该机构的内部电子邮件显示，在过去六个月里，芝加哥、华盛顿特区、波士顿、奥兰多、西雅图、亚特兰大、新泽西州纽瓦克、底特律、迈阿密和明尼阿波利斯等地的空警都感染了新冠肺炎病毒。\n对于一些空警来说，具有讽刺意味的是，他们经常乘坐几乎不构成恐怖威胁的近乎空荡荡的航班。\n“空警大多是退役军人，执法人员。一名空警说：“我们很强硬，我们想要飞，我们会飞，我们有也想飞--当有威胁的时候，当威胁是基于情报的时候。”一名空警要求匿名，因为该机构过去曾报复那些与媒体交谈的人。\n“现在我们在胡说八道，”空警说，“无缘无故地把我们自己和我们的家人置于危险之中。”\n我们的目标是为用户创造一个安全和吸引人的地方，让他们在兴趣和激情上建立联系。为了改善我们的社区体验，我们暂停了文章评论。", "note_en": "As the holiday travel season approaches, the airlines are trying to convince people it’s safe to fly and touting studies showing the risk of getting COVID-19 on a flight is minimal, but nearly 100 federal air marshals have tested positive for the virus.\n Last week, a number of COVID-19 cases hit the Federal Air Marshals Dallas office and shuttered its field office in Philadelphia. And earlier in October, an air marshal based in Minneapolis died from COVID-19; several air marshals told Yahoo News the deceased officer believed he had contracted the virus on a flight.\n The Transportation Security Administration told Yahoo News that 98 federal air marshals have tested positive for the COVID-19 virus, though it does not address whether those cases were from flying. Yet some air marshals — armed law enforcement officers who protect civil aircraft from attacks — directly link at least some of those infections to their time spent in airports and on flights.\n  Both associations that represent many of the nearly 3,000 federal air marshals also believe that at least some of their members contracted the coronavirus from their work on flights, though they acknowledge some of these cases were from the start of the pandemic, prior to the nationwide shutdown or the introduction of masks on flights.\n “The [Air Marshal Association] knows of one [federal air marshal] case at the start of the outbreak that is linked with certainty to a European flight,” said John Casaretti, president of the association, which represents about half the air marshals.\n Sonya Hightower LaBosco, president of the Air Marshal National Council, another organization that represents some air marshals, also said it has identified cases in which it believes its members contracted the virus from airplanes. “Absolutely, we know they got it flying,” she said.\n While air travel is at a historic low, federal air marshals are still flying on aircraft to protect them from terrorist attacks, a job that now comes with a new set of risks amid a pandemic. The recent death of an air marshal, and other recent cases, come at a time when airlines are desperate to convince the public that flying is safe, emphasizing their ventilation systems, disinfectant procedures and mandatory mask requirements.\n  The risk of contracting the coronavirus from flying is the subject of a number of studies with somewhat conflicting conclusions. A recent  airline trade industry study claimed that the risk of transmitting COVID-19 is minimal, and a new report  released Tuesday by researchers at Harvard University says that “the research to date indicates a relatively very low risk of acquiring SARS-CoV-2 while flying.” But  another report released this week in Ireland pointed to a nearly empty long-haul flight where 13 of 49 passengers — most of them masked — contracted the virus.\n One of the issues facing air marshals, and others serving in law enforcement positions, is that it’s often impossible to know for sure where they contracted the virus. A bill passed by the Senate in August extended benefits for public safety officers — air marshals are law enforcement and fall under that designation — which creates a general presumption that a public safety officer who dies of COVID-19 or related complications or sustained a personal injury in the line of duty is thus eligible for death and disability benefits.\n  “Since the implementation of masks and distancing measures, the AMA has assisted about 36 FAMs with COVID-related benefits claims, but more cases occur each month,” said Casaretti, the Air Marshal Association president.\n “While the paperwork may indicate that FAMs contracted COVID because of the type of work they do, it does not necessarily mean they contracted COVID on an aircraft,” he added.\n Trying to extrapolate risks of flying from air marshals to the general public is difficult, because the officers spend much more time in airports and on flights than most of the flying public.\n “FAMs fly more than most flight crews, and spend countless hours in transportation hubs and hotels, so the risk will never be zero,” Casaretti said. “They endure the inherent COVID-related in-flight risks caused by confined spaces and recirculated air because terrorist and criminal activity continues to target aviation.”\n It’s also impossible to know how many air marshals have been infected. While 98 air marshals have tested positive for COVID-19, the total infected since the beginning of the pandemic is likely higher, because in the pandemic’s early days, air marshals, like others, often couldn’t get access to tests, according to interviews and internal agency communications.\n In some cases, air marshals have gotten sick while on duty and have been forced to quarantine in hotels in the U.S. and overseas, waiting for symptoms to subside, according to those familiar with their operations. (Two air marshals who fall into that category told Yahoo News they believe they had COVID-19, but they were unable to get tested.)\n The TSA did not answer Yahoo News’ question about the number of what the agency calls “presumptive cases” but provided a general statement about its COVID-19 policies.\n “Regarding Federal Air Marshals, TSA implemented significant measures throughout all of its operations to limit the spread of COVID-19,” an official with the agency told Yahoo News. “All TSA employees, including Federal Air Marshals, are required to wear personal protective equipment while on the job and in public-facing roles where social distancing is not possible.”\n The TSA says it takes “very seriously” all cases of COVID-19 among its employees, as well as potential exposure. “In instances where federal air marshals have tested positive for COVID-19, access to field offices has been temporarily restricted for cleaning,” the agency said.\n  Yet some within the Federal Air Marshal Service say the nature of the job often put them at odds with guidance from the Centers for Disease Control and Prevention, and that, particularly early in the pandemic, they were often put in dangerous situations. According to internal emails, air marshals were told over the summer to ignore quarantine travel restrictions imposed at various times by states like Texas, Florida and New York.\n Two air marshals based in different cities told Yahoo News that over the summer they’d both been put on missions — assigned flights — while they were waiting for their test to come back or after failed attempts to get tested. In both instances, the air marshals met up with colleagues in different cities, spending extended amounts of time with those teams, who later tested positive and then infected others in their hometowns.\n “I was a superspreader, it pains me to say, but that’s what I was,” one air marshal who became infected with COVID-19 told Yahoo News.\n Over the past six months, COVID-19 infections hit air marshals in Chicago; Washington, D.C.; Boston; Orlando; Seattle; Atlanta; Newark, N.J.; Detroit; Miami; and Minneapolis, among others, according to internal agency emails.\n For some air marshals, the irony of the pandemic is that they are often flying on near-empty flights that pose little terrorist threat.\n “Air marshals are mostly retired military, law enforcement. We’re tough and we want to fly and will, and have and want to — when there is a threat, when it’s based on intelligence,” said one air marshal who requested anonymity because of the agency’s history of retaliation against those who speak with the press.\n “Now we’re flying bullshit flights,” the air marshal said, “and putting ourselves and our families at risk for no reason.”\n Our goal is to create a safe and engaging place for users to connect over interests and passions. In order to improve our community experience, we are temporarily suspending article commenting.", "posttime": "2020-10-28 04:53:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,marshals,空警", "title": "近百名美国空警感染新冠肺炎", "title_en": "Nearly 100 U.S. air marshals have been infected with Covid-19", "transed": 1, "url": "https://news.yahoo.com/the-airlines-insist-flying-is-safe-but-nearly-100-us-air-marshals-have-been-infected-with-covid-19-192022228.html", "via": "", "real_tags": ["美国", "marshals", "空警"]}, {"category": "", "categoryclass": "", "imagename": "653b85ee615d5970fed86b40abd01622.jpg", "infoid": 1031613, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "到目前为止，当地媒体的灭亡是全国数千万美国人经历的一个令人悲伤、熟悉的故事。在今天发布的一份报告中，参议院商务委员会(Senate Commerce Committee)的民主党领袖将这场大屠杀直接归咎于谷歌和Facebook，声称这两家公司为了追求垄断货币化，参与了破坏当地新闻的活动。\n参议员玛丽亚·坎特维尔(华盛顿州民主党人)。Twitter首席执行官杰克·多尔西、谷歌首席执行官桑达尔·皮查伊和Facebook首席执行官马克·扎克伯格将在周三的听证会上作证，今天发布了这份措辞严厉的新报告(PDF)。\n诚然，随着新闻数字化，在互联网出现之前资助当地报纸的广告流在21世纪发生了戏剧性的变化。报告称，即便如此，除了本地新闻被少数几个大型新闻聚合平台劫持，尤其是谷歌(Google)和脸书(Facebook)，这两家公司已成为在线广告的主导者之外，媒体本可以管理好的。\n报告继续说，这些价值数万亿美元的公司为自己的网站收集当地新闻内容和数据，并利用它们的市场主导地位，迫使当地新闻接受很少甚至没有知识产权的补偿。它解释说：\n这些平台利用它们的市场地位迫使地方新闻签订“要么接受要么放弃”的合同，这限制了地方新闻公司获得公平补偿的能力。如果一家新闻机构想要以平台创建的移动格式展示其内容的摘要，该新闻机构通常必须同意一项合同，该合同允许平台在没有公平经济补偿的情况下获得内容，并从浏览者那里收集用户数据，以及其他条款。对新闻媒体的好处是，读者可能会点击其网站的链接来了解更多信息。然而，这种安排也导致整体广告收入中不成比例的份额流向了平台，而不是各自新闻网站上的内容创作者，在这些网站上，建立关系和流量是维持长期收入的关键。主要新闻聚合平台在读者中的受欢迎程度意味着他们可以推动地方报纸在这些不公平的条款下向他们提供当地新闻内容。\n坎特维尔的调查结果与众议院反垄断小组委员会本月早些时候发布的一份重磅炸弹反垄断报告的调查结果相呼应。\n众议院的报告指出，尽管全国主要报纸的在线流量大幅增长，但全国各地的纸质和数字新闻编辑部正在裁员或干脆倒闭。数字广告市场高度集中，谷歌和Facebook控制着美国大部分在线广告市场……。新闻出版商担心，在线市场的这种高度集中--通常被称为数字双头垄断--已经损害了新闻的质量和可获得性。\n这份新的报告既引用了众议院的报告，也引用了州、联邦和国际监管机构目前正在对科技公司的商业行为进行的其他几项积极调查。", "note_en": "The decimation of local media is by now a sad, familiar tale experienced by tens of millions of Americans all over the country. In a report released today, the Senate Commerce Committee&#39;s top Democrat is laying blame for the bloodbath squarely at the feet of Google and Facebook, claiming the companies have participated in destroying local news in the pursuit of monopolizing monetization.\n Sen. Maria Cantwell (D-Wash.) released the scathing new report ( PDF) today, ahead of a  scheduled hearing Wednesday in which Twitter CEO Jack Dorsey, Google CEO Sundar Pichai, and Facebook CEO Mark Zuckerberg will be testifying.\n It is true that the advertising streams that funded local newspapers before the advent of the Internet changed dramatically in the 21st century as news went digital. Even so, the report says, outlets could have been able to manage except that &#34;Local news has been hijacked by a few large news aggregation platforms, most notably Google and Facebook, which have become the dominant players in online advertising.&#34;\n &#34;These trillion-dollar companies scrape local news content and data for their own sites and leverage their market dominance to force local news to accept little to no compensation for their intellectual property,&#34; the report goes on. It explains:\n The platforms use their market position to force local news into “take it or leave it” contracts, which limit the ability for local news companies to be fairly compensated. If a news outlet wants a summary of its content featured in mobile formats created by the platforms, the news outlet typically must agree to a contract that allows the platforms to obtain the content without fair financial compensation and collect user data from those who view it, among other provisions. The benefit to the news outlet is the possibility that readers will click on a link to its site to learn more. However, this arrangement also results in a disproportionate share of overall advertising revenue flowing to the platforms instead of the content creators on their individual news sites, where building a relationship and traffic is key to sustaining long-term revenue. The popularity of the major news aggregation platforms with readers means they can push local newspapers into providing local news content to them under these unfair terms.\n  Cantwell&#39;s findings echo the findings of a  blockbuster antitrust report published by the House antitrust subcommittee earlier this month.\n &#34;Despite significant growth in online traffic among the nation&#39;s leading newspapers, print and digital newsrooms across the country are laying off reporters or folding altogether,&#34; the House report observed. &#34;The digital advertising market is highly concentrated, with Google and Facebook controlling the majority of the online advertising market in the United States... News publishers have raised concerns that this significant level of concentration in the online market—commonly known as the digital duopoly—has harmed the quality and availability of journalism.&#34;\n The new report cites both the House report as well as  several other active investigations that state, federal, and international regulators are currently conducting into tech firms&#39; business practices.", "posttime": "2020-10-28 04:39:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,google,谷歌,希望,新闻", "title": "参议员希望谷歌和Facebook为当地新闻买单", "title_en": "Senator wants Google, Facebook to pony up for local news", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/10/congress-should-stop-google-facebook-from-killing-local-news-report-says/", "via": "", "real_tags": ["facebook", "google", "谷歌", "希望", "新闻"]}, {"category": "", "categoryclass": "", "imagename": "347c534f032bfe619fd6826285a87bd4.jpg", "infoid": 1031612, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "分析师此前预计，该公司每股收益为1.54美元，营收为357.2亿美元。\n在业绩疲软之后，该公司的股价实际上持平，在盘后交易中仅上涨了一小部分点。尽管市场有些不均衡，但微软在下午的交易中上涨了近2%。\n推动微软股价走势的是至关重要的Azure更新。以下是微软不得不说的话：\n服务器产品和云服务收入增长22%(按不变货币计算增长21%)，受Azure收入增长48%(按不变货币计算增长47%)的推动。\n分析投资者情绪，似乎大多数人都预计会有一个更接近40多岁的数字，这使得Azure结果成为一个强劲的数字。\nAzure所在的更广泛的类别被称为“智能云”，报告收入为130亿美元，比去年同期增长了20%。这是微软三个部门中表现最好的，这三个部门还包括以Office和LinkedIn为主的“生产力和业务流程”部门，收入为123亿美元，增长11%；以及以Windows和Xbox为主的“更个人化的计算”部门，收入为118亿美元，与去年同期相比增幅较小，为6%。\n必应营收下滑，该公司称“不包括流量获取成本的搜索广告营收下降了10%”\n消费PC需求-从PC销售数据中可以看出-与去年同期相比，非专业Windows OEM收入增加了31%，尽管专注于专业Windows OEM的营收下降了22%。\n展望未来，分析师预计微软本季度每股利润将达到1.60美元，总营收减少404亿美元。该公司将在财报电话会议上宣布自己的预测。", "note_en": "Analysts had  anticipated the company to report $1.54 in earnings per share, generated from $35.72 billion in revenue.\n In the aftermath of the beat, shares of the company are effectively flat, gaining only a fraction of a point in after-hours trading. Microsoft was up by nearly 2% in afternoon trading, despite somewhat uneven markets.\n  Helping drive the movement in Microsoft share price was the all-important Azure update. Here’s what Microsoft had to say:\n Server products and cloud services revenue increased 22% (up 21% in constant currency) driven by Azure revenue growth of 48% (up 47% in constant currency)\n Parsing investor sentiment, it appears that a number closer in the low-40s was anticipated by most, making the Azure result a strong number.\n The broader category that Azure sits inside of, called “Intelligent Cloud,” reported $13.0 billion in revenue, up 20% from the year-ago quarter. That was the best performing of Microsoft’s three units, which also include the Office-and-LinkedIn heavy “Productivity and Business Processes” group that posted $12.3 billion in revenue — up 11% — and the Windows-and-Xbox heavy “More Personal Computing” which had revenues of $11.8 billion, up a smaller 6% compared to the year-ago quarter.\n    Bing revenue declines, with the company saying that “[s]earch advertising revenue excluding traffic acquisition costs decreased 10%”\n    Consumer PC demand — seen in PC sales numbers — boosted non-Pro Windows OEM revenues by 31% compared to the year-ago quarter, though Pro-focused Windows OEM top line fell 22%\n Looking ahead, analysts expect Microsoft to record $1.60 in per-share profit in the current quarter, off $40.4 billion in total revenue. The company will announce its own projections on its earnings call.", "posttime": "2020-10-28 04:34:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,微软,持平,stock,收入", "title": "\n微软股价持平，尽管收益好于预期，Azure增长强劲", "title_en": "\n\t\t\t\tMicrosoft stock flat despite better-than-expected earnings, strong Azure growth\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/27/microsoft-stock-flat-despite-better-than-expected-earnings-strong-azure-growth/", "via": "", "real_tags": ["microsoft", "微软", "持平", "stock", "收入"]}, {"category": "", "categoryclass": "", "imagename": "f8c44bbfe0c49a34b1b68396d08edcd9.jpg", "infoid": 1031611, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该运营商已经开始进军电视市场，去年收购了Layer3，随后推出了TVision Home。然而，这更接近于传统的有线电视，起价为每月100美元，仅限于部分市场。(T-Mobile还提供免费的Netflix和一些家庭计划。)。\n新的TVision阵容更实惠，也更容易获得。最便宜的选择是TVision Vibe，它包括30多个频道的直播和点播内容，包括AMC、BET、Discovery、Food Network、Hallmark、HGTV、MTV和TLC，每月收费10美元。\n稍贵一点，但有现场新闻和体育节目的是TVision Live。它的起价是每月40美元，提供不同的30多个频道的阵容-ABC、福克斯、NBC、特纳、ESPN等等，每月50美元(TVision Live+)和每月600美元(TVision Live Zone)的计划为捆绑包引入更多频道。(相比之下，YouTube电视每月收费65美元，Hulu+直播电视每月收费55美元。)。如果你在11月1日至12月31日期间注册Live+或Live Zone，你还将获得一年免费的Apple TV+。\n最后，您还将通过TVision频道购买Starz、Showtime和Epix等个人服务。\n新的TVision服务可以在Android和苹果的移动和电视设备上使用，也可以在亚马逊Fire TV上使用。此外，T-Mobile还推出了一款售价50美元的新HDMI流媒体设备，名为TVision Hub。\nT-Mobile负责新兴产品的执行副总裁道德雷珀(Dow Draper)在一份声明中表示：“有了TVision，你就可以剪断绳索，削减成本，减少废话。”", "note_en": "The carrier has already been moving into the TV market with the acquisition of Layer3 and  the subsequent launch of TVision Home last year. However, that was closer to traditional cable, with a price tag starting at $100 a month and availability limited to select markets. (T-Mobile also  offers free Netflix with some family plans.)\n The new TVision lineup is more affordable and more broadly available. The cheapest option is TVision Vibe, which includes more than 30 channels of live and on-demand content including AMC, BET, Discovery, Food Network, Hallmark, HGTV, MTV and TLC, and which costs $10 a month.\n  A bit more costly, but with live news and sports, is TVision Live. It starts at $40 a month and offers a different lineup of 30-plus channels — ABC, FOX, NBC, Turner, ESPN and more, with $50-a-month (TVision Live+) and $600a-month (TVision Live Zone) plans that introduce more channels to the bundle. (In contrast, YouTube TV costs $65 a month and Hulu + Live TV costs $55 a month.) And if you sign up for Live+ or Live Zone between November 1 and December 31, you’ll get a free year of Apple TV+ as well.\n Lastly, you’ll also be purchase individual services like Starz, Showtime and Epix through TVision Channels.\n The new TVision services are available on Android and Apple mobile and TV devices, as well as Amazon Fire TV. Plus, T-Mobile is launching a new $50 HDMI streaming device called the TVision Hub.\n “With TVision, you can cut the cord, cut the cost and cut the crap,” said Dow Draper, T-Mobile’s executive vice president of emerging products, in a statement.", "posttime": "2020-10-28 04:34:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "流媒体,pricing,tvision", "title": "\nT-Mobile推出新的TVision流媒体捆绑包，起价为每月10美元", "title_en": "\n\t\t\t\tT-Mobile launches new TVision streaming bundles, pricing starts at $10 per month\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/27/t-mobile-tvision/", "via": "", "real_tags": ["流媒体", "pricing", "tvision"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031609, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "{&#34；@odata.context&#34；：&#34；http://api.msn.com/finance/$metadata#Quotes&#34；，&#34；valueM&#34；：[{&#34；Price&#34；：213.25，&#34；priceChange&#34；：3.17，&#34；priceDayHigh&#34；：214.67，&#34；priceDayLow&#34；：210.329，&#34；market cap&#34；：1588799000000.0，&#34；TimeLastTraded&#34；：&#34；2020-10-27T20:33:32.192&#34；，&#34；priceDay Open&#34；：211.76，&34；pricePreviousClose&#34；：210.08，&#34；datePreviousClose&#34；：&#34；2020-10-26T00:00:00&#34；，&#34；priceAsk&#34；：214.49，&34；askSize&#34；：1000.0，&34；priceBid&#34；：214.19，&#34；BIDSIZE&#34；：232.86，&#34；累计成交量&#34；：33593793.0，&#34；平均成交量&#34；：27624994.0，&#34；：36.4455，&#34；priceChangePercent&#34；：1.5089，&#34；price52w High&#34；：132.52，&#34；price52w Low&#34；：132.52，&#34；priceChangePostMarket&#34；：36.4455，&#34；priceChangePostMarket&#34；：1.5089，&#34；price52w High&#34；：52w Low&#34；：132.52，&#34；priceChangePostMarket&#34；：36.4455，&#34；priceChangePostMarket&#34；：1.5089，&#34；priceChangePostMarket&#34；：1.04，&34；priceChangePostMarketPercent&#34；：0.4877，&#34；priceChangePreMarket&#34；：213.25，&#34；priceChangePreMarketPercent&#34；：1.5089，&#34；priceChangePreMarketPercent&#34；：213.25，&#34；yeeldPercent&#34；：1.0663，&#34；priceChange1 Week&#34；：-1.40，&#34；priceChange1 Month&#34；：5.43，&#34；priceChange3 Month&#34；：9.4，&#34；价格变动6个月&#34；：39.2，&#34；priceChangeYTD&#34；：55.55，&#34；priceChange1Year&#34；：72.52，&#34；rereturn 1 Week&#34；：-0.6522，&#34；retur1 Month&#34；：2.6128，&#34；retur3 Month&#34；：4.6112，&#34；retur6 Month&#34；：22.5223，&#34；returYTD&#34；：35.2251，&#34；retur1 Year&#34；：51.5313，&34；SourceExchangeCode&#34；：&#34；XNASB&#34；，&#34；sourceExchangeName&#34；：&#34；Nasdaq Last Sale&#34；，&#34；MarketCaprency&#34；：&#34；USD&#34；，&#34；exchangeId&#34；：&#34；r6dwop&#34；，&#34；exchangeCode&#34；：&#34；XNAs&#34；，&#34；exchangeName&#34；：&#34；Nasdaq Stock Market&#34；，&#34；offeringStatus&#34；：&#34；普通的&#34；，&#34；DisplayName&#34；：&#34；Microsoft Corp&#34；，&#34；Short Name&#34；：&#34；Microsoft&#34；，&#34；securityType&#34；：&#34；stock&#34；，&#34；InstrumentId&#34；：：&#34；a1xzim&#34；，&#34；Symbol&#34；：&#34；MSFT&#34；，&#34；Country&#34；：&#34；US&#34；，&#34；市场&#34；：&#34；EN-US&34；，&#34；localizedAttributes&#34；：{&#34；en-us&#34；：{&#34；displayName&#34；：&#34；MICROSOFT公司，&#34；zh-cn&#34；：{&#34；displayName&#34；：&#34；MICROSOFT公司，&#34；zh-hk&#34；：{&#34；displayName&#34；：&#34；MICROSOFT公司。}，&#34；zh-tw&#34；：{&#34；displayName&#34；：&#34；MICROSOFT公司，&#34；nl-nl&#34；：{&#34；displayName&#34；：&#34；MICROSOFT公司，&#34；fr-fr&#34；：{&#34；displayName&#34；：&#34；MICROSOFT公司，{#34；}，{#34；}，{#34；}，{#34；}，{#34；}，{#34；}，{#34；}，{#34；}，{#34；}，{#34；DisplayName&#34；微软公司、&#34；es-es&#34；：{&#34；displayName&#34；：&#34；MICROSOFT公司、&#34；sv-se&#34；：{&#34；displayName&#34；：&#34；MICROSOFT公司、&#34；it-it&#34；：{&#34；displayName&#34；：&#34；MICROSOFT公司。JA-JP&#34；：{&#34；DisplayName&#34；：&#34；&#34；pt-br&#34；：{&#34；displayName&#34；：&#34；MICROSOFT&#34；}，&#34；ru-ru&#34；：{&#34；displayName&#34；：&#34；MICROSOFT公司&#34；}}，&#34；timeLastUpdated&#34；：&#34；2020-10-27T20:33:32.8574651&#34；，&#34；マイクロソフト&#34；}。，&#34；货币&#34；：&#34；美元&#34；，&#34；_p&#34；：&#34；a1xzim&#34；，&#34；id&#34；：&#34；报价：a1xzim&#34；，&#34；_t&#34；：&#34；报价&#34；，&#34；_etag&#34；：&#34；\\&#34；230071a5-0000-0200-0000-5f98841e0000\\&#34；&#34；，&#34；_RID&#34；：&#34；-lkPAOGdLgC+8wgAAAAADQ==&#34；，&#34；_self&#34；：&#34；dbs/-lkPAA==/colls/-lkPAOGdLgA=/docs/-lkPAOGdLgC+8wgAAAAADQ==/&#34；，&#34；_ts&#34；：1603830814}]}。\n{&#34；id&#34；：&#34；图表1D1M：A1xzim&#34；，&#34；前小时系列&#34；：空，&#34；后小时系列&#34；：空，&#34；Series&#34；：{&#34；PT&#34；：[{&#34；P&#34；：211.18，&#34；T&#34；：&#34；2020-10-27 09：30：00&#34；}，{&#34；P&#34；：210.95，&#34；T&#34；：&#34；2020年-10-27 09：31：00&#34；}，{&#34；P&#34；：210.75，&#34；T&#34；：&#34；2020-10-27 09：32：00&#34；}，{&#34；P&#34；：210.89，&#34；T&#34；：&#34；2020-10-27 09：33：00&#34；}，{&#34；P&#34；：211.3735，&#34；T&#34；：&#34；2020-10-27 09：34：00&#34；}，{&#34；P&#34；：211.47，&#34；T&#34；：&#34；2020-10-27 09：35：00&#34；}，{&#34；P&#34；：211.79，&#34；T&#34；：&#34；2020-10-27 09：36：00&34号；}，{&#34；P&#34；：211.65，&#34；T&#34；：&#34；2020-10-27 09：37：00&#34；}，{&#34；P&#34；：211.33，&#34；T&#34；：&#34；2020-10-27 09：38：00&#34；}，{&#34；P&#34；：211.0657，&#34；T&#34；：&#34；20-10-27 09：39：00&#34；}，{&#34；P&#34；：211，&#34；T&#34；：&#34；2020-10-27 09：40：00&#34；}，{&#34；P&#34；：211.23，&#34；T&#34；：&#34；2020-10-27 09：41：00&#34；}，{&#34；P&#34；：211.68，&#34；T&#34；：&#34；2020-10-27 09：42：00&#34；}，{&#34；P&#34；：211.6724，&#34；T&#34；：&#34；2020-10-27 09：43：00&#34；}，{&#34；P&#34；：211.86，&#34；T&#34；：&#34；2020-10-27 09：44：00&#34；}，{&#34；P&#34；：212.17，&#34；T&#34；：&#34；2020-10-27 09：45：00&#34；}，{&#34；P&#34；：211.86，&#34；T&#34；：&#34；2020-10-27 09：46：00&#34；}，{&#34；P&#34；：211.86，&#34；T&#34；：&#34；2020-10-27 09：47：00&#34；}，{&#34；P&#34；}。：211.6585，&#34；T&#34；：&#34；2020年-10-27 09：48：00&#34；}，{&#34；P&#34；：211.69，&#34；T&#34；：&#34；2020-10-27 09：49：00&#34；}，{&#34；P&#34；：212，&#34；T&#34；：&#34；2020-10-27 09：50：00&#34；}，{&#34；P&#34；：212.215，&#34；T&#34；：&#34；2020-10-27 09：51：00&#34；}，{&#34；P&#34；：211.8299，&#34；T&#34；：&#34；2020-10-27 09：52：00&#34；}，{&#34；P&#34；：211.84，&#34；T&#34；：&#34；2020-10-27 09：53：00&", "note_en": "{ &#34;@odata.context&#34;: &#34;http://api.msn.com/finance/$metadata#Quotes&#34;, &#34;valueM&#34;: [{&#34;price&#34;:213.25,&#34;priceChange&#34;:3.17,&#34;priceDayHigh&#34;:214.67,&#34;priceDayLow&#34;:210.329,&#34;marketCap&#34;:1588799000000.0,&#34;timeLastTraded&#34;:&#34;2020-10-27T20:33:32.192&#34;,&#34;priceDayOpen&#34;:211.76,&#34;pricePreviousClose&#34;:210.08,&#34;datePreviousClose&#34;:&#34;2020-10-26T00:00:00&#34;,&#34;priceAsk&#34;:214.49,&#34;askSize&#34;:1000.0,&#34;priceBid&#34;:214.19,&#34;bidSize&#34;:50.0,&#34;accumulatedVolume&#34;:33593793.0,&#34;averageVolume&#34;:27624994.0,&#34;peRatio&#34;:36.4455,&#34;priceChangePercent&#34;:1.5089,&#34;price52wHigh&#34;:232.86,&#34;price52wLow&#34;:132.52,&#34;pricePostMarket&#34;:214.29,&#34;priceChangePostMarket&#34;:1.04,&#34;priceChangePostMarketPercent&#34;:0.4877,&#34;pricePreMarket&#34;:213.25,&#34;priceChangePreMarket&#34;:3.17,&#34;priceChangePreMarketPercent&#34;:1.5089,&#34;priceClose&#34;:213.25,&#34;yieldPercent&#34;:1.0663,&#34;priceChange1Week&#34;:-1.4,&#34;priceChange1Month&#34;:5.43,&#34;priceChange3Month&#34;:9.4,&#34;priceChange6Month&#34;:39.2,&#34;priceChangeYTD&#34;:55.55,&#34;priceChange1Year&#34;:72.52,&#34;return1Week&#34;:-0.6522,&#34;return1Month&#34;:2.6128,&#34;return3Month&#34;:4.6112,&#34;return6Month&#34;:22.5223,&#34;returnYTD&#34;:35.2251,&#34;return1Year&#34;:51.5313,&#34;sourceExchangeCode&#34;:&#34;XNASB&#34;,&#34;sourceExchangeName&#34;:&#34;Nasdaq Last Sale&#34;,&#34;marketCapCurrency&#34;:&#34;USD&#34;,&#34;exchangeId&#34;:&#34;r6dwop&#34;,&#34;exchangeCode&#34;:&#34;XNAS&#34;,&#34;exchangeName&#34;:&#34;Nasdaq Stock Market&#34;,&#34;offeringStatus&#34;:&#34;regular&#34;,&#34;displayName&#34;:&#34;Microsoft Corp&#34;,&#34;shortName&#34;:&#34;Microsoft&#34;,&#34;securityType&#34;:&#34;stock&#34;,&#34;instrumentId&#34;:&#34;a1xzim&#34;,&#34;symbol&#34;:&#34;MSFT&#34;,&#34;country&#34;:&#34;US&#34;,&#34;market&#34;:&#34;en-us&#34;,&#34;localizedAttributes&#34;:{&#34;en-us&#34;:{&#34;displayName&#34;:&#34;MICROSOFT CORPORATION&#34;},&#34;zh-cn&#34;:{&#34;displayName&#34;:&#34;MICROSOFT CORPORATION&#34;},&#34;zh-hk&#34;:{&#34;displayName&#34;:&#34;MICROSOFT CORPORATION&#34;},&#34;zh-tw&#34;:{&#34;displayName&#34;:&#34;MICROSOFT CORPORATION&#34;},&#34;nl-nl&#34;:{&#34;displayName&#34;:&#34;MICROSOFT CORPORATION&#34;},&#34;fr-fr&#34;:{&#34;displayName&#34;:&#34;MICROSOFT CORPORATION&#34;},&#34;de-de&#34;:{&#34;displayName&#34;:&#34;MICROSOFT CORPORATION&#34;},&#34;es-es&#34;:{&#34;displayName&#34;:&#34;MICROSOFT CORPORATION&#34;},&#34;sv-se&#34;:{&#34;displayName&#34;:&#34;MICROSOFT CORPORATION&#34;},&#34;it-it&#34;:{&#34;displayName&#34;:&#34;MICROSOFT CORPORATION&#34;},&#34;ja-jp&#34;:{&#34;displayName&#34;:&#34;マイクロソフト&#34;},&#34;pt-br&#34;:{&#34;displayName&#34;:&#34;MICROSOFT CORPORATION&#34;},&#34;ru-ru&#34;:{&#34;displayName&#34;:&#34;MICROSOFT CORPORATION&#34;}},&#34;timeLastUpdated&#34;:&#34;2020-10-27T20:33:32.8574651&#34;,&#34;currency&#34;:&#34;USD&#34;,&#34;_p&#34;:&#34;a1xzim&#34;,&#34;id&#34;:&#34;Quote:a1xzim&#34;,&#34;_t&#34;:&#34;Quote&#34;,&#34;_etag&#34;:&#34;\\&#34;230071a5-0000-0200-0000-5f98841e0000\\&#34;&#34;,&#34;_rid&#34;:&#34;-lkPAOGdLgC+8wgAAAAADQ==&#34;,&#34;_self&#34;:&#34;dbs/-lkPAA==/colls/-lkPAOGdLgA=/docs/-lkPAOGdLgC+8wgAAAAADQ==/&#34;,&#34;_ts&#34;:1603830814}]}\n  {&#34;id&#34;:&#34;Chart1D1M:a1xzim&#34;,&#34;PreHoursSeries&#34;:null,&#34;AfterHoursSeries&#34;:null,&#34;Series&#34;:{&#34;PT&#34;:[{&#34;P&#34;:211.18,&#34;T&#34;:&#34;2020-10-27 09:30:00&#34;},{&#34;P&#34;:210.95,&#34;T&#34;:&#34;2020-10-27 09:31:00&#34;},{&#34;P&#34;:210.75,&#34;T&#34;:&#34;2020-10-27 09:32:00&#34;},{&#34;P&#34;:210.89,&#34;T&#34;:&#34;2020-10-27 09:33:00&#34;},{&#34;P&#34;:211.3735,&#34;T&#34;:&#34;2020-10-27 09:34:00&#34;},{&#34;P&#34;:211.47,&#34;T&#34;:&#34;2020-10-27 09:35:00&#34;},{&#34;P&#34;:211.79,&#34;T&#34;:&#34;2020-10-27 09:36:00&#34;},{&#34;P&#34;:211.65,&#34;T&#34;:&#34;2020-10-27 09:37:00&#34;},{&#34;P&#34;:211.33,&#34;T&#34;:&#34;2020-10-27 09:38:00&#34;},{&#34;P&#34;:211.0657,&#34;T&#34;:&#34;2020-10-27 09:39:00&#34;},{&#34;P&#34;:211,&#34;T&#34;:&#34;2020-10-27 09:40:00&#34;},{&#34;P&#34;:211.23,&#34;T&#34;:&#34;2020-10-27 09:41:00&#34;},{&#34;P&#34;:211.68,&#34;T&#34;:&#34;2020-10-27 09:42:00&#34;},{&#34;P&#34;:211.6724,&#34;T&#34;:&#34;2020-10-27 09:43:00&#34;},{&#34;P&#34;:211.86,&#34;T&#34;:&#34;2020-10-27 09:44:00&#34;},{&#34;P&#34;:212.17,&#34;T&#34;:&#34;2020-10-27 09:45:00&#34;},{&#34;P&#34;:211.86,&#34;T&#34;:&#34;2020-10-27 09:46:00&#34;},{&#34;P&#34;:211.86,&#34;T&#34;:&#34;2020-10-27 09:47:00&#34;},{&#34;P&#34;:211.6585,&#34;T&#34;:&#34;2020-10-27 09:48:00&#34;},{&#34;P&#34;:211.69,&#34;T&#34;:&#34;2020-10-27 09:49:00&#34;},{&#34;P&#34;:212,&#34;T&#34;:&#34;2020-10-27 09:50:00&#34;},{&#34;P&#34;:212.215,&#34;T&#34;:&#34;2020-10-27 09:51:00&#34;},{&#34;P&#34;:211.8299,&#34;T&#34;:&#34;2020-10-27 09:52:00&#34;},{&#34;P&#34;:211.84,&#34;T&#34;:&#34;2020-10-27 09:53:00&#34;},{&#34;P&#34;:211.97,&#34;T&#34;:&#34;2020-10-27 09:54:00&#34;},{&#34;P&#34;:211.77,&#34;T&#34;:&#34;2020-10-27 09:55:00&#34;},{&#34;P&#34;:211.89,&#34;T&#34;:&#34;2020-10-27 09:56:00&#34;},{&#34;P&#34;:211.92,&#34;T&#34;:&#34;2020-10-27 09:57:00&#34;},{&#34;P&#34;:211.71,&#34;T&#34;:&#34;2020-10-27 09:58:00&#34;},{&#34;P&#34;:211.905,&#34;T&#34;:&#34;2020-10-27 09:59:00&#34;},{&#34;P&#34;:211.57,&#34;T&#34;:&#34;2020-10-27 10:00:00&#34;},{&#34;P&#34;:211.84,&#34;T&#34;:&#34;2020-10-27 10:01:00&#34;},{&#34;P&#34;:211.86,&#34;T&#34;:&#34;2020-10-27 10:02:00&#34;},{&#34;P&#34;:211.94,&#34;T&#34;:&#34;2020-10-27 10:03:00&#34;},{&#34;P&#34;:211.5754,&#34;T&#34;:&#34;2020-10-27 10:04:00&#34;},{&#34;P&#34;:211.58,&#34;T&#34;:&#34;2020-10-27 10:05:00&#34;},{&#34;P&#34;:211.6,&#34;T&#34;:&#34;2020-10-27 10:06:00&#34;},{&#34;P&#34;:211.885,&#34;T&#34;:&#34;2020-10-27 10:07:00&#34;},{&#34;P&#34;:211.91,&#34;T&#34;:&#34;2020-10-27 10:08:00&#34;},{&#34;P&#34;:211.87,&#34;T&#34;:&#34;2020-10-27 10:09:00&#34;},{&#34;P&#34;:211.9901,&#34;T&#34;:&#34;2020-10-27 10:10:00&#34;},{&#34;P&#34;:211.69,&#34;T&#34;:&#34;2020-10-27 10:11:00&#34;},{&#34;P&#34;:211.76,&#34;T&#34;:&#34;2020-10-27 10:12:00&#34;},{&#34;P&#34;:211.7273,&#34;T&#34;:&#34;2020-10-27 10:13:00&#34;},{&#34;P&#34;:211.55,&#34;T&#34;:&#34;2020-10-27 10:14:00&#34;},{&#34;P&#34;:211.44,&#34;T&#34;:&#34;2020-10-27 10:15:00&#34;},{&#34;P&#34;:211.2865,&#34;T&#34;:&#34;2020-10-27 10:16:00&#34;},{&#34;P&#34;:211.1404,&#34;T&#34;:&#34;2020-10-27 10:17:00&#34;},{&#34;P&#34;:211.0828,&#34;T&#34;:&#34;2020-10-27 10:18:00&#34;},{&#34;P&#34;:210.79,&#34;T&#34;:&#34;2020-10-27 10:19:00&#34;},{&#34;P&#34;:210.85,&#34;T&#34;:&#34;2020-10-27 10:20:00&#34;},{&#34;P&#34;:210.8782,&#34;T&#34;:&#34;2020-10-27 10:21:00&#34;},{&#34;P&#34;:210.679,&#34;T&#34;:&#34;2020-10-27 10:22:00&#34;},{&#34;P&#34;:210.51,&#34;T&#34;:&#34;2020-10-27 10:23:00&#34;},{&#34;P&#34;:210.5,&#34;T&#34;:&#34;2020-10-27 10:24:00&#34;},{&#34;P&#34;:210.4565,&#34;T&#34;:&#34;2020-10-27 10:25:00&#34;},{&#34;P&#34;:210.675,&#34;T&#34;:&#34;2020-10-27 10:26:00&#34;},{&#34;P&#34;:210.9,&#34;T&#34;:&#34;2020-10-27 10:27:00&#34;},{&#34;P&#34;:210.735,&#34;T&#34;:&#34;2020-10-27 10:28:00&#34;},{&#34;P&#34;:210.72,&#34;T&#34;:&#34;2020-10-27 10:29:00&#34;},{&#34;P&#34;:210.8301,&#34;T&#34;:&#34;2020-10-27 10:30:00&#34;},{&#34;P&#34;:210.96,&#34;T&#34;:&#34;2020-10-27 10:31:00&#34;},{&#34;P&#34;:210.86,&#34;T&#34;:&#34;2020-10-27 10:32:00&#34;},{&#34;P&#34;:210.98,&#34;T&#34;:&#34;2020-10-27 10:33:00&#34;},{&#34;P&#34;:211.14,&#34;T&#34;:&#34;2020-10-27 10:34:00&#34;},{&#34;P&#34;:210.9716,&#34;T&#34;:&#34;2020-10-27 10:35:00&#34;},{&#34;P&#34;:211.14,&#34;T&#34;:&#34;2020-10-27 10:36:00&#34;},{&#34;P&#34;:211.37,&#34;T&#34;:&#34;2020-10-27 10:37:00&#34;},{&#34;P&#34;:211.49,&#34;T&#34;:&#34;2020-10-27 10:38:00&#34;},{&#34;P&#34;:211.42,&#34;T&#34;:&#34;2020-10-27 10:39:00&#34;},{&#34;P&#34;:211.37,&#34;T&#34;:&#34;2020-10-27 10:40:00&#34;},{&#34;P&#34;:211.25,&#34;T&#34;:&#34;2020-10-27 10:41:00&#34;},{&#34;P&#34;:211.115,&#34;T&#34;:&#34;2020-10-27 10:42:00&#34;},{&#34;P&#34;:211.34,&#34;T&#34;:&#34;2020-10-27 10:43:00&#34;},{&#34;P&#34;:211.65,&#34;T&#34;:&#34;2020-10-27 10:44:00&#34;},{&#34;P&#34;:211.63,&#34;T&#34;:&#34;2020-10-27 10:45:00&#34;},{&#34;P&#34;:211.88,&#34;T&#34;:&#34;2020-10-27 10:46:00&#34;},{&#34;P&#34;:212.065,&#34;T&#34;:&#34;2020-10-27 10:47:00&#34;},{&#34;P&#34;:212.13,&#34;T&#34;:&#34;2020-10-27 10:48:00&#34;},{&#34;P&#34;:212.0968,&#34;T&#34;:&#34;2020-10-27 10:49:00&#34;},{&#34;P&#34;:212.02,&#34;T&#34;:&#34;2020-10-27 10:50:00&#34;},{&#34;P&#34;:212.08,&#34;T&#34;:&#34;2020-10-27 10:51:00&#34;},{&#34;P&#34;:212.045,&#34;T&#34;:&#34;2020-10-27 10:52:00&#34;},{&#34;P&#34;:211.9373,&#34;T&#34;:&#34;2020-10-27 10:53:00&#34;},{&#34;P&#34;:212.1,&#34;T&#34;:&#34;2020-10-27 10:54:00&#34;},{&#34;P&#34;:212.273,&#34;T&#34;:&#34;2020-10-27 10:55:00&#34;},{&#34;P&#34;:212.045,&#34;T&#34;:&#34;2020-10-27 10:56:00&#34;},{&#34;P&#34;:212,&#34;T&#34;:&#34;2020-10-27 10:57:00&#34;},{&#34;P&#34;:212.0515,&#34;T&#34;:&#34;2020-10-27 10:58:00&#34;},{&#34;P&#34;:211.7053,&#34;T&#34;:&#34;2020-10-27 10:59:00&#34;},{&#34;P&#34;:211.67,&#34;T&#34;:&#34;2020-10-27 11:00:00&#34;},{&#34;P&#34;:211.83,&#34;T&#34;:&#34;2020-10-27 11:01:00&#34;},{&#34;P&#34;:212.03,&#34;T&#34;:&#34;2020-10-27 11:02:00&#34;},{&#34;P&#34;:212.02,&#34;T&#34;:&#34;2020-10-27 11:03:00&#34;},{&#34;P&#34;:211.9977,&#34;T&#34;:&#34;2020-10-27 11:04:00&#34;},{&#34;P&#34;:211.94,&#34;T&#34;:&#34;2020-10-27 11:05:00&#34;},{&#34;P&#34;:212,&#34;T&#34;:&#34;2020-10-27 11:06:00&#34;},{&#34;P&#34;:212.0101,&#34;T&#34;:&#34;2020-10-27 11:07:00&#34;},{&#34;P&#34;:212.0001,&#34;T&#34;:&#34;2020-10-27 11:08:00&#34;},{&#34;P&#34;:212.08,&#34;T&#34;:&#34;2020-10-27 11:09:00&#34;},{&#34;P&#34;:212.1948,&#34;T&#34;:&#34;2020-10-27 11:10:00&#34;},{&#34;P&#34;:212.12,&#34;T&#34;:&#34;2020-10-27 11:11:00&#34;},{&#34;P&#34;:212.2566,&#34;T&#34;:&#34;2020-10-27 11:12:00&#34;},{&#34;P&#34;:212.37,&#34;T&#34;:&#34;2020-10-27 11:13:00&#34;},{&#34;P&#34;:212.3099,&#34;T&#34;:&#34;2020-10-27 11:14:00&#34;},{&#34;P&#34;:212.28,&#34;T&#34;:&#34;2020-10-27 11:15:00&#34;},{&#34;P&#34;:212.4,&#34;T&#34;:&#34;2020-10-27 11:16:00&#34;},{&#34;P&#34;:212.39,&#34;T&#34;:&#34;2020-10-27 11:17:00&#34;},{&#34;P&#34;:212.29,&#34;T&#34;:&#34;2020-10-27 11:18:00&#34;},{&#34;P&#34;:212.26,&#34;T&#34;:&#34;2020-10-27 11:19:00&#34;},{&#34;P&#34;:212.25,&#34;T&#34;:&#34;2020-10-27 11:20:00&#34;},{&#34;P&#34;:212.175,&#34;T&#34;:&#34;2020-10-27 11:21:00&#34;},{&#34;P&#34;:212.2553,&#34;T&#34;:&#34;2020-10-27 11:22:00&#34;},{&#34;P&#34;:212.27,&#34;T&#34;:&#34;2020-10-27 11:23:00&#34;},{&#34;P&#34;:212.4479,&#34;T&#34;:&#34;2020-10-27 11:24:00&#34;},{&#34;P&#34;:212.42,&#34;T&#34;:&#34;2020-10-27 11:25:00&#34;},{&#34;P&#34;:212.5136,&#34;T&#34;:&#34;2020-10-27 11:26:00&#34;},{&#34;P&#34;:212.3,&#34;T&#34;:&#34;2020-10-27 11:27:00&#34;},{&#34;P&#34;:212.08,&#34;T&#34;:&#34;2020-10-27 11:28:00&#34;},{&#34;P&#34;:212.0179,&#34;T&#34;:&#34;2020-10-27 11:29:00&#34;},{&#34;P&#34;:212.0245,&#34;T&#34;:&#34;2020-10-27 11:30:00&#34;},{&#34;P&#34;:212.06,&#34;T&#34;:&#34;2020-10-27 11:31:00&#34;},{&#34;P&#34;:212.1877,&#34;T&#34;:&#34;2020-10-27 11:32:00&#34;},{&#34;P&#34;:212.08,&#34;T&#34;:&#34;2020-10-27 11:33:00&#34;},{&#34;P&#34;:212.32,&#34;T&#34;:&#34;2020-10-27 11:34:00&#34;},{&#34;P&#34;:212.2501,&#34;T&#34;:&#34;2020-10-27 11:35:00&#34;},{&#34;P&#34;:212.545,&#34;T&#34;:&#34;2020-10-27 11:36:00&#34;},{&#34;P&#34;:212.7601,&#34;T&#34;:&#34;2020-10-27 11:37:00&#34;},{&#34;P&#34;:212.82,&#34;T&#34;:&#34;2020-10-27 11:38:00&#34;},{&#34;P&#34;:213,&#34;T&#34;:&#34;2020-10-27 11:39:00&#34;},{&#34;P&#34;:213.16,&#34;T&#34;:&#34;2020-10-27 11:40:00&#34;},{&#34;P&#34;:213.1094,&#34;T&#34;:&#34;2020-10-27 11:41:00&#34;},{&#34;P&#34;:212.83,&#34;T&#34;:&#34;2020-10-27 11:42:00&#34;},{&#34;P&#34;:212.76,&#34;T&#34;:&#34;2020-10-27 11:43:00&#34;},{&#34;P&#34;:212.6798,&#34;T&#34;:&#34;2020-10-27 11:44:00&#34;},{&#34;P&#34;:212.72,&#34;T&#34;:&#34;2020-10-27 11:45:00&#34;},{&#34;P&#34;:212.96,&#34;T&#34;:&#34;2020-10-27 11:46:00&#34;},{&#34;P&#34;:212.8,&#34;T&#34;:&#34;2020-10-27 11:47:00&#34;},{&#34;P&#34;:212.72,&#34;T&#34;:&#34;2020-10-27 11:48:00&#34;},{&#34;P&#34;:212.75,&#34;T&#34;:&#34;2020-10-27 11:49:00&#34;},{&#34;P&#34;:212.84,&#34;T&#34;:&#34;2020-10-27 11:50:00&#34;},{&#34;P&#34;:212.83,&#34;T&#34;:&#34;2020-10-27 11:51:00&#34;},{&#34;P&#34;:212.89,&#34;T&#34;:&#34;2020-10-27 11:52:00&#34;},{&#34;P&#34;:212.9,&#34;T&#34;:&#34;2020-10-27 11:53:00&#34;},{&#34;P&#34;:212.87,&#34;T&#34;:&#34;2020-10-27 11:54:00&#34;},{&#34;P&#34;:212.94,&#34;T&#34;:&#34;2020-10-27 11:55:00&#34;},{&#34;P&#34;:213.065,&#34;T&#34;:&#34;2020-10-27 11:56:00&#34;},{&#34;P&#34;:213.1,&#34;T&#34;:&#34;2020-10-27 11:57:00&#34;},{&#34;P&#34;:213.1299,&#34;T&#34;:&#34;2020-10-27 11:58:00&#34;},{&#34;P&#34;:213.09,&#34;T&#34;:&#34;2020-10-27 11:59:00&#34;},{&#34;P&#34;:213.09,&#34;T&#34;:&#34;2020-10-27 12:00:00&#34;},{&#34;P&#34;:213.1,&#34;T&#34;:&#34;2020-10-27 12:01:00&#34;},{&#34;P&#34;:213.09,&#34;T&#34;:&#34;2020-10-27 12:02:00&#34;},{&#34;P&#34;:213.27,&#34;T&#34;:&#34;2020-10-27 12:03:00&#34;},{&#34;P&#34;:213.245,&#34;T&#34;:&#34;2020-10-27 12:04:00&#34;},{&#34;P&#34;:213.266,&#34;T&#34;:&#34;2020-10-27 12:05:00&#34;},{&#34;P&#34;:213.1738,&#34;T&#34;:&#34;2020-10-27 12:06:00&#34;},{&#34;P&#34;:213.24,&#34;T&#34;:&#34;2020-10-27 12:07:00&#34;},{&#34;P&#34;:213.33,&#34;T&#34;:&#34;2020-10-27 12:08:00&#34;},{&#34;P&#34;:213.33,&#34;T&#34;:&#34;2020-10-27 12:09:00&#34;},{&#34;P&#34;:213.16,&#34;T&#34;:&#34;2020-10-27 12:10:00&#34;},{&#34;P&#34;:213.1176,&#34;T&#34;:&#34;2020-10-27 12:11:00&#34;},{&#34;P&#34;:212.9,&#34;T&#34;:&#34;2020-10-27 12:12:00&#34;},{&#34;P&#34;:212.83,&#34;T&#34;:&#34;2020-10-27 12:13:00&#34;},{&#34;P&#34;:212.64,&#34;T&#34;:&#34;2020-10-27 12:14:00&#34;},{&#34;P&#34;:212.7072,&#34;T&#34;:&#34;2020-10-27 12:15:00&#34;},{&#34;P&#34;:212.73,&#34;T&#34;:&#34;2020-10-27 12:16:00&#34;},{&#34;P&#34;:212.7179,&#34;T&#34;:&#34;2020-10-27 12:17:00&#34;},{&#34;P&#34;:212.675,&#34;T&#34;:&#34;2020-10-27 12:18:00&#34;},{&#34;P&#34;:212.83,&#34;T&#34;:&#34;2020-10-27 12:19:00&#34;},{&#34;P&#34;:212.99,&#34;T&#34;:&#34;2020-10-27 12:20:00&#34;},{&#34;P&#34;:212.79,&#34;T&#34;:&#34;2020-10-27 12:21:00&#34;},{&#34;P&#34;:212.78,&#34;T&#34;:&#34;2020-10-27 12:22:00&#34;},{&#34;P&#34;:212.77,&#34;T&#34;:&#34;2020-10-27 12:23:00&#34;},{&#34;P&#34;:212.9,&#34;T&#34;:&#34;2020-10-27 12:24:00&#34;},{&#34;P&#34;:212.99,&#34;T&#34;:&#34;2020-10-27 12:25:00&#34;},{&#34;P&#34;:212.82,&#34;T&#34;:&#34;2020-10-27 12:26:00&#34;},{&#34;P&#34;:212.84,&#34;T&#34;:&#34;2020-10-27 12:27:00&#34;},{&#34;P&#34;:212.87,&#34;T&#34;:&#34;2020-10-27 12:28:00&#34;},{&#34;P&#34;:212.71,&#34;T&#34;:&#34;2020-10-27 12:29:00&#34;},{&#34;P&#34;:212.69,&#34;T&#34;:&#34;2020-10-27 12:30:00&#34;},{&#34;P&#34;:212.68,&#34;T&#34;:&#34;2020-10-27 12:31:00&#34;},{&#34;P&#34;:212.61,&#34;T&#34;:&#34;2020-10-27 12:32:00&#34;},{&#34;P&#34;:212.615,&#34;T&#34;:&#34;2020-10-27 12:33:00&#34;},{&#34;P&#34;:212.63,&#34;T&#34;:&#34;2020-10-27 12:34:00&#34;},{&#34;P&#34;:212.55,&#34;T&#34;:&#34;2020-10-27 12:35:00&#34;},{&#34;P&#34;:212.565,&#34;T&#34;:&#34;2020-10-27 12:36:00&#34;},{&#34;P&#34;:212.66,&#34;T&#34;:&#34;2020-10-27 12:37:00&#34;},{&#34;P&#34;:212.76,&#34;T&#34;:&#34;2020-10-27 12:38:00&#34;},{&#34;P&#34;:212.8079,&#34;T&#34;:&#34;2020-10-27 12:39:00&#34;},{&#34;P&#34;:212.9255,&#34;T&#34;:&#34;2020-10-27 12:40:00&#34;},{&#34;P&#34;:213.0308,&#34;T&#34;:&#34;2020-10-27 12:41:00&#34;},{&#34;P&#34;:212.94,&#34;T&#34;:&#34;2020-10-27 12:42:00&#34;},{&#34;P&#34;:212.754,&#34;T&#34;:&#34;2020-10-27 12:43:00&#34;},{&#34;P&#34;:212.61,&#34;T&#34;:&#34;2020-10-27 12:44:00&#34;},{&#34;P&#34;:212.7679,&#34;T&#34;:&#34;2020-10-27 12:45:00&#34;},{&#34;P&#34;:212.73,&#34;T&#34;:&#34;2020-10-27 12:46:00&#34;},{&#34;P&#34;:212.83,&#34;T&#34;:&#34;2020-10-27 12:47:00&#34;},{&#34;P&#34;:212.775,&#34;T&#34;:&#34;2020-10-27 12:48:00&#34;},{&#34;P&#34;:212.8221,&#34;T&#34;:&#34;2020-10-27 12:49:00&#34;},{&#34;P&#34;:212.9321,&#34;T&#34;:&#34;2020-10-27 12:50:00&#34;},{&#34;P&#34;:212.9425,&#34;T&#34;:&#34;2020-10-27 12:51:00&#34;},{&#34;P&#34;:212.93,&#34;T&#34;:&#34;2020-10-27 12:52:00&#34;},{&#34;P&#34;:213.035,&#34;T&#34;:&#34;2020-10-27 12:53:00&#34;},{&#34;P&#34;:213.24,&#34;T&#34;:&#34;2020-10-27 12:54:00&#34;},{&#34;P&#34;:213.33,&#34;T&#34;:&#34;2020-10-27 12:55:00&#34;},{&#34;P&#34;:213.3,&#34;T&#34;:&#34;2020-10-27 12:56:00&#34;},{&#34;P&#34;:213.37,&#34;T&#34;:&#34;2020-10-27 12:57:00&#34;},{&#34;P&#34;:213.18,&#34;T&#34;:&#34;2020-10-27 12:58:00&#34;},{&#34;P&#34;:213.36,&#34;T&#34;:&#34;2020-10-27 12:59:00&#34;},{&#34;P&#34;:213.35,&#34;T&#34;:&#34;2020-10-27 13:00:00&#34;},{&#34;P&#34;:213.33,&#34;T&#34;:&#34;2020-10-27 13:01:00&#34;},{&#34;P&#34;:213.39,&#34;T&#34;:&#34;2020-10-27 13:02:00&#34;},{&#34;P&#34;:213.3197,&#34;T&#34;:&#34;2020-10-27 13:03:00&#34;},{&#34;P&#34;:213.38,&#34;T&#34;:&#34;2020-10-27 13:04:00&#34;},{&#34;P&#34;:213.4909,&#34;T&#34;:&#34;2020-10-27 13:05:00&#34;},{&#34;P&#34;:213.5075,&#34;T&#34;:&#34;2020-10-27 13:06:00&#34;},{&#34;P&#34;:213.59,&#34;T&#34;:&#34;2020-10-27 13:07:00&#34;},{&#34;P&#34;:213.455,&#34;T&#34;:&#34;2020-10-27 13:08:00&#34;},{&#34;P&#34;:213.345,&#34;T&#34;:&#34;2020-10-27 13:09:00&#34;},{&#34;P&#34;:213.385,&#34;T&#34;:&#34;2020-10-27 13:10:00&#34;},{&#34;P&#34;:213.1101,&#34;T&#34;:&#34;2020-10-27 13:11:00&#34;},{&#34;P&#34;:213.1,&#34;T&#34;:&#34;2020-10-27 13:12:00&#34;},{&#34;P&#34;:213.16,&#34;T&#34;:&#34;2020-10-27 13:13:00&#34;},{&#34;P&#34;:213.165,&#34;T&#34;:&#34;2020-10-27 13:14:00&#34;},{&#34;P&#34;:212.975,&#34;T&#34;:&#34;2020-10-27 13:15:00&#34;},{&#34;P&#34;:212.93,&#34;T&#34;:&#34;2020-10-27 13:16:00&#34;},{&#34;P&#34;:212.8501,&#34;T&#34;:&#34;2020-10-27 13:17:00&#34;},{&#34;P&#34;:212.87,&#34;T&#34;:&#34;2020-10-27 13:18:00&#34;},{&#34;P&#34;:212.7838,&#34;T&#34;:&#34;2020-10-27 13:19:00&#34;},{&#34;P&#34;:212.99,&#34;T&#34;:&#34;2020-10-27 13:20:00&#34;},{&#34;P&#34;:213.015,&#34;T&#34;:&#34;2020-10-27 13:21:00&#34;},{&#34;P&#34;:212.8674,&#34;T&#34;:&#34;2020-10-27 13:22:00&#34;},{&#34;P&#34;:213.22,&#34;T&#34;:&#34;2020-10-27 13:23:00&#34;},{&#34;P&#34;:213.38,&#34;T&#34;:&#34;2020-10-27 13:24:00&#34;},{&#34;P&#34;:213.21,&#34;T&#34;:&#34;2020-10-27 13:25:00&#34;},{&#34;P&#34;:213.05,&#34;T&#34;:&#34;2020-10-27 13:26:00&#34;},{&#34;P&#34;:213.26,&#34;T&#34;:&#34;2020-10-27 13:27:00&#34;},{&#34;P&#34;:213.39,&#34;T&#34;:&#34;2020-10-27 13:28:00&#34;},{&#34;P&#34;:213.325,&#34;T&#34;:&#34;2020-10-27 13:29:00&#34;},{&#34;P&#34;:213.37,&#34;T&#34;:&#34;2020-10-27 13:30:00&#34;},{&#34;P&#34;:213.56,&#34;T&#34;:&#34;2020-10-27 13:31:00&#34;},{&#34;P&#34;:213.83,&#34;T&#34;:&#34;2020-10-27 13:32:00&#34;},{&#34;P&#34;:213.74,&#34;T&#34;:&#34;2020-10-27 13:33:00&#34;},{&#34;P&#34;:213.72,&#34;T&#34;:&#34;2020-10-27 13:34:00&#34;},{&#34;P&#34;:213.86,&#34;T&#34;:&#34;2020-10-27 13:35:00&#34;},{&#34;P&#34;:214.0279,&#34;T&#34;:&#34;2020-10-27 13:36:00&#34;},{&#34;P&#34;:213.95,&#34;T&#34;:&#34;2020-10-27 13:37:00&#34;},{&#34;P&#34;:213.9162,&#34;T&#34;:&#34;2020-10-27 13:38:00&#34;},{&#34;P&#34;:213.87,&#34;T&#34;:&#34;2020-10-27 13:39:00&#34;},{&#34;P&#34;:213.81,&#34;T&#34;:&#34;2020-10-27 13:40:00&#34;},{&#34;P&#34;:213.93,&#34;T&#34;:&#34;2020-10-27 13:41:00&#34;},{&#34;P&#34;:213.9411,&#34;T&#34;:&#34;2020-10-27 13:42:00&#34;},{&#34;P&#34;:213.92,&#34;T&#34;:&#34;2020-10-27 13:43:00&#34;},{&#34;P&#34;:214.02,&#34;T&#34;:&#34;2020-10-27 13:44:00&#34;},{&#34;P&#34;:214.09,&#34;T&#34;:&#34;2020-10-27 13:45:00&#34;},{&#34;P&#34;:214.06,&#34;T&#34;:&#34;2020-10-27 13:46:00&#34;},{&#34;P&#34;:214.18,&#34;T&#34;:&#34;2020-10-27 13:47:00&#34;},{&#34;P&#34;:214.23,&#34;T&#34;:&#34;2020-10-27 13:48:00&#34;},{&#34;P&#34;:214.2,&#34;T&#34;:&#34;2020-10-27 13:49:00&#34;},{&#34;P&#34;:214.4\n......", "posttime": "2020-10-28 04:33:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,微软,季度,revenue,month", "title": "微软公布季度收入372亿美元，同比增长12%，净收入139亿美元，同比增长30%，智能云收入130亿美元，同比增长20%", "title_en": "Microsoft reports quarterly revenue of $37.2B, up 12% YoY, net income of $13.9B, up 30% YoY, revenue for Intelligent Cloud was $13.0B, up 20% YoY", "transed": 1, "url": "https://www.microsoft.com/en-us/Investor/earnings/FY-2021-Q1", "via": "", "real_tags": ["microsoft", "微软", "季度", "revenue", "month"]}, {"category": "", "categoryclass": "", "imagename": "de9d397571855f0735e67e5e58b7099f.png", "infoid": 1031608, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天上午，AMD宣布将以350亿美元的股票收购FPGA制造商Xilinx，作为这一消息的一部分，该公司还发布了第三季度收益报告，同时发布了收购消息。这是一份非典型的财报，至少可以说，清晨的财报让AMD的投资者和其他人得以了解AMD最新的财务状况，同时也消化了利用该公司可观的市值收购另一家公司的决定-最终帮助AMD证明他们现在处于如此有利的地位进行交易是合理的。紧随公司创纪录的第二季度之后，AMD在今年第三季度结束了营收纪录，同时利润翻了两番。\n2020年第三季度，AMD公布的收入为28亿美元，比去年同期增长了56%。因此，AMD再次为公司创造了新的收入纪录，公布了有史以来最好的第三季度和最好的单季度业绩。推动这一增长的是AMD两个主要细分市场的进一步增长，据报道，从消费CPU销售到EPYC和半定制销售的一切都在上升。\n最令人瞠目结舌的可能是AMD的净利润，比去年同期增长了两倍多。在第三季度，AMD记录了3.9亿美元的GAAP净收入，增长了225%，使他们去年同期1.2亿美元的收入相形见绌。即使在季度的基础上，AMD的收入和利润也全面大幅增长，与第二季度相比，AMD的净收入再次翻了一番以上。事实上，AMD的财务数据目前唯一没有显著增长的方面是AMD的毛利率，仅为44%，仅比去年增长了1%。据该公司称，通用汽车的增长受到利润率相对较低的半定制销售的限制，PS5/XSX的提升抵消了CPU销售的增长。\n按细分市场细分数字，AMD的计算和图形部门享受了强劲的季度业绩，这在很大程度上是因为Ryzen处理器销量的增加。总体而言，该部门的收入为16.7亿美元，比去年同期增长了31%。AMD台式机和笔记本电脑的CPU出货量都出现了可观的增长，AMD报告这两个方面都实现了两位数的增长，并创下了笔记本处理器出货量的新纪录。然而，AMD的显卡部门是个异类；RX6000系列的推出意味着显卡收入与19年第三季度相比有所下降。\n至于产品平均售价(ASP)，AMD报告称，客户端处理器和显卡ASP每年都受到打击。由于AMD当前一代的RX5000产品生命周期接近尾声，图形ASP下降，而CPU ASP下降是因为移动芯片的销量较高，而移动芯片往往价格较低。对于AMD来说，这两个方面在下个季度都应该会改变，因为Zen 3和Radeon RX 6000系列的推出将把新一轮的产品推向市场，可以卖到更高的价格。\n与此同时，AMD的企业、嵌入式和半定制部门在第三季度又迎来了一个更大的季度，从EPYC处理器到控制台SoC的所有产品的出货量都在上升。有了前者，AMD在服务器领域的市场份额继续增长，在公司的财报电话会议上，首席执行官Lisa Su博士证实，服务器销售额比19年第三季度翻了一番以上，理由是云和企业采用率的提高。与此同时，PlayStation5和Xbox Series X的加速销售也推动了半定制产品的销售，预计第四季度会有更大的增长。\n而且，就像AMD业务的消费者端一样，企业端也即将从下一代产品的推出中受益。AMD已经证实，他们的基于Zen3架构的EPYC“米兰”处理器将按照之前的承诺在本季度开始发货，最初的芯片将提供给云计算和“精选的HPC”客户。与此同时，OEM将在2021年第一季度全面上市。\n总体而言，AMD在第三季度有很多值得高兴的地方，在第四季度更值得期待。随着AMD公布创纪录的收入，以及他们传统上最强劲的季度仍将到来，该公司预计第四季度会更好。将用于台式机和服务器的Zen 3 CPU与新的RADEON硬件相结合，将意味着AMD将拥有发展势头和新产品。所有这一切都发生在该行业的关键时刻，因为AMD正寻求利用其技术优势，从不同寻常的令人眼花缭乱的英特尔(Intel)手中瓜分更大的x86处理器市场份额。\n发表评论我猜AMD在研发上投入了大量资金，因为考虑到他们在台式机、笔记本电脑甚至服务器领域取得的巨大成功，他们的数字并不是那么令人震惊。回覆。\n他们的研发每年增加1亿美元，而他们的收入每年增加约10亿美元。他们的收入没有飞涨的原因是因为他们的毛利率一直保持在44%。因此，~10亿美元的收入相当于~5亿美元的毛利润。然后，你从研发和SG&A中减去大约2亿美元，你只会得到大约3亿美元的额外利润。就服务器而言，他们似乎还没有在那里取得如此成功。他们收入的巨大增长来自台式机和笔记本电脑CPU的销售以及控制台SOC。\n回覆。\n对于我的一天来说，这是一个非常好的消息。我为AMD感到激动，我希望这种积极的势头和增长能持续到未来。我希望他们作为一家公司继续发展壮大，继续创新并投资于研发，这样他们才能保持与这一细分市场的其他公司的竞争力。我的下一个计算机版本将使用AMD硬件，如果我有空的话。回覆。\n我的一部分感觉是他们可以通过抛弃Radeon赚更多的钱。另一方面，我觉得，如果他们愿意投入更多的钱，他们可以让Radeon和它的司机们变得更好。回覆。\n我认为他们需要保持他们的显卡，因为这对像笔记本电脑这样的大批量生产部件的销售至关重要。此外，他们还需要有图形能力，才能在控制台方面赢得设计胜利，在那里，索尼和微软可以通过从一个来源获得处理器和图形来降低供应链的复杂性。我认为AMD不会让Radeon离开，尽管他们目前在EPYC的企业领域取得了成功，但考虑到它在他们的产品组合中实现了什么。回覆", "note_en": "As part of this morning’s announcement from AMD that the company would be  buying FPGA maker Xilinx for $35 billion in stock, the company also released its Q3 earnings report alongside the buyout news. An atypical earnings release to say the least, an early-morning release allowed AMD investors and others to get a look at the very latest in AMD’s financials while also digesting the decision to use the company’s sizable market capitalization to buy another company – and ultimately to help AMD justify why they’re in such a good position now to make the transaction. Coming on the heels of a record Q2 for the company, AMD closed out the third quarter of the year setting revenue records once again all the while trebling its profits.\n  For the third quarter of 2020, AMD reported $2.8B in revenue, a 56% jump over the same quarter a year ago. As a result, AMD has once again set new revenue records for the company, posting both their best Q3 ever, and their best single quarter period. Driving this was further growth in both of AMD’s major segments, with everything from consumer CPU sales to EPYC and semi-custom sales reported as being on the rise.\n    Most eye-popping, perhaps, has been AMD’s net income, which more than trebled over the year-ago quarter. For Q3’20, AMD booked $390M in GAAP net income, a 225% increase that dwarfs the $120M they took home at this point last year. Even on a quarterly basis AMD’s revenues and profits were up significantly across the board, with AMD again more than doubling its net income versus Q2. In fact the only aspect of AMD’s financials not showing significant growth at the moment is AMD’s gross margin, which at 44% is only up 1% over last year. According to the company, GM growth is being limited by relatively low margin semi-custom sales, with the PS5/XSX ramp-up counterbalancing the increase in CPU sales.\n  Breaking down the numbers by segment, AMD’s Computing and Graphics segment enjoyed a strong quarter based in large part on an increase in Ryzen processor sales. Overall the segment booked $1.67B in revenue, which is up 31% over the year-ago quarter. Carrying the segment were sizable increases in both AMD’s desktop and notebook CPU shipments, with AMD reporting double-digit growth in both and setting a new record for notebook processor shipments. AMD’s graphics division was the odd man out, however; the run-up to the RX 6000 series means that graphics revenue was down versus Q3’19.\n    As for product average selling prices (ASPs), AMD is reporting that both client processor and graphics ASPs have taken a hit on a yearly basis. Graphics ASPs were down due to AMD’s current-generation RX 5000 products approaching the end of their lifecycle, while CPU ASPs declined due to higher sales of mobile chips, which tend to carry lower prices. Both of these should change for AMD in the next quarter, as the launch of Zen 3 and the Radeon RX 6000 series will put a fresh round of products on the market that can fetch higher prices.\n  Meanwhile, AMD’s Enterprise, Embedded, and Semi-Custom segment saw another greater quarter with Q3, with shipments of everything from EPYC processors to console SoCs on the rise. With the former, AMD has continued to grow its market share in the server space, and on the company’s earnings call CEO Dr. Lisa Su confirmed that server sales have more than doubled over Q3’19, citing improved cloud and enterprise adoption. Meanwhile the ramp-up for the Playstation 5 and Xbox Series X has pushed semi-custom sales higher as well, and that’s expected to grow even more in Q4.\n    And, like the consumer side of AMD’s business, the enterprise side is about to benefit as well from the launch of next-generation products. AMD has confirmed that their Zen 3 architecture-based EPYC “Milan” processors will begin shipping this quarter as previously promised, with the initial chips going out to cloud and “select HPC” customers. Meanwhile general OEM availability will follow in the first quarter of 2021.\n  Overall, AMD has a lot to be happy about for Q3, and even more to look forward to in Q4. With AMD posting record revenue and their traditionally strongest quarter still to come, the company is expecting an even better Q4. The combination of Zen 3 CPUs for desktops and servers, along with new Radeon hardware will mean that AMD has momentum and new products on their side. All of which comes at a critical time for the industry, as AMD seeks to use its technology advantages to carve a larger piece of the x86 processor market from an uncharacteristically dazed Intel.\n  POST A COMMENT      I am guessing AMD is pumping lots of money in R&amp;D since their numbers are not that mind blowing given how big of a success they have in desktop, laptop and even server.  Reply\n    Their R&amp;D went up $100 M year over year while their revenue went up ~$1 B year over year. The reason their earnings have not skyrocketed is because their gross margins has remained at 44%. So That ~$1 B in revenue amounts to ~$500 M in gross profit. then you subtract ~$200 M from R&amp;D and SG&amp;A and you get only ~$300 M in extra profits. As far as server is concerned, they seemingly haven&#39;t been so successful there, yet. The big gains in their revenue came from desktop and laptop CPU sales and console SOCs.\n  Reply\n  This is very good news to start my day with. I&#39;m thrilled for AMD and I hope that the positive momentum and growth continues into the future. I want them to continue to grow as a company and continue innovating and investing in R&amp;D, so that they can remain competitive with other companies in this segment.  My next computer build will use AMD hardware, if I ever get around to it.  Reply\n  part of me feels that they can make more money by ditching radeon. the other part of me feels that they can make radeon and its drivers much better if they would put more money into it.  Reply\n  I think they need to keep their graphics going because it&#39;s vital to landing sales in large volume production parts like laptops. Also they need to have graphics capabilities to land design wins on the console side where Sony and Microsoft can keep the supply chain complexity down by getting processor and graphics from a one source. I don&#39;t think AMD would let Radeon go given what it enables in their product portfolio despite their current success in the enterprise space with EPYC.  Reply", "posttime": "2020-10-28 04:33:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "图形,net,amd", "title": "AMD报告第三季度收入为28亿美元，同比增长56%，净收入为3.9亿美元，高于去年同期的1.2亿美元；计算和图形收入为16.7亿美元，同比增长31%，原因是Ryzen的销售情况更好", "title_en": "AMD reports Q3 revenue of $2.8B, up 56% YoY, net income of $390M, up from $120M YoY; Computing and Graphics revenue was $1.67B, up 31% YoY on better Ryzen sales", "transed": 1, "url": "https://www.anandtech.com/show/16198/amd-reports-q3-2020-earnings-making-money-and-settings-records-yet-again", "via": "", "real_tags": ["图形", "net", "amd"]}, {"category": "", "categoryclass": "", "imagename": "1785fa7c221ca2987f0efc1e819452f1.png", "infoid": 1031607, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "游戏结束后，我们一年一度的游戏Jam(构建游戏的黑客马拉松)将于本周末回归。参与者将在11月1日获得一个秘密主题，并将有整个11月的时间根据他们对主题的解释来构建一个游戏。这是构建您的第一个游戏、学习新语言、游戏引擎或其他框架的一个很好的借口。或者，这可能是启动一个新的有趣的周末/晚上项目的一种方式！\n去年的主题是“飞跃”，提交了200多款游戏，包括像素化平台、块状拼图游戏、LCD外观的点击式游戏等等。\n如果您以前从未构建过游戏，那么您可能会有兴趣了解一下免费的开源游戏引擎，如Phaser(如果您了解JavaScript，则非常理想)、Godot(如果您熟悉C#、C++或Python，则非常棒)或libGDX(如果您精通Java，则非常棒)。你可以在游戏关闭网站上找到更多的例子。\n鼓励使用免费和开放源码的工具，但这不是必需的。前几年的参赛作品包括虚幻引擎、Unity、Pico-8。见鬼，我们甚至已经有准将64和NES游戏提交了！", "note_en": "Game Off , our annual game jam (a hackathon for building games) returns this weekend. Participants will be given a secret theme on November 1 and will have the entire month of November to build a game based on their interpretation of the theme. This is a great excuse to build your first game, learn a new language, game engine, or other framework. Alternatively, this could be  a way to kick off a new fun weekend/evening project!\n Last year’s theme was “leaps and bounds,” and over   200 games were submitted , including   pixelated platformers ,   a blocky puzzler , an   LCD-looking point ‘n click game , and more.\n If you’ve never built a game before, you might be interested in taking a look at free and open source game engines like   Phaser  (perfect if you know JavaScript),   Godot  (great if you’re comfortable with C#, C++, or Python), or   libGDX  (excellent if you’re proficient with Java). You can find additional examples on the   Game Off website .\n The use of free and open source tools is encouraged, but it is not a requirement. Previous years’ entries have included  Unreal Engine,  Unity,  PICO-8. Heck, we’ve even had Commodore 64 and NES games submitted!", "posttime": "2020-10-28 04:24:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,github,game", "title": "在今年11月关闭GitHub游戏的情况下构建游戏", "title_en": "Build a Game This November with GitHub Game Off", "transed": 1, "url": "https://github.blog/2020-10-27-github-game-off-2020/", "via": "", "real_tags": ["游戏", "github", "game"]}, {"category": "", "categoryclass": "", "imagename": "f270c8384e713817e647e755b65ce8d1.png", "infoid": 1031606, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "18年来，我们一起在阿姆斯特丹庆祝我们对Blender的热情，分享工作，与旧的(和新的)一起度过一段美好的时光！朋友。2020年已经改变了一切，我们也将改变。\n从历史上看，Blender项目几乎完全在网上进行。我们在网上有很强的影响力，我们习惯于在线合作和远程会面。这就是为什么完整的在线版本的会议不是一个非常好的选择的主要原因。\n没有好东西，会议就不是真正的会议！为了给你一种真正的“一起分开”的感觉，我们将在一个装满糖果的小盒子里塞满东西：一件会议T恤、华夫饼、明信片、贴纸、来自搅拌机基金会主席的特别信息等等！\n卖完了！", "note_en": "For 18 years we have come together in Amsterdam to celebrate our passion for Blender, to share work and have a good time hanging out with old (and new!) friends. 2020 has changed things around, and we will too.\n  Historically, the Blender project takes place nearly entirely online. We have a very strong online presence and we’re used to working together online and to meet remotely. That’s the main reason why a full online version of the conference would not be a very good alternative.\n A conference is not a real conference without the goodies! To give you a real “together apart” feeling, we will stuff a small box full of goodies: a conference t-shirt, stroopwafels, postcards, stickers, a special message from the Blender Foundation chairman and more!\n Sold out!", "posttime": "2020-10-28 04:19:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,搅拌机,blender", "title": "2020年搅拌机大会", "title_en": "Blender Conference 2020", "transed": 1, "url": "https://conference.blender.org/2020/", "via": "", "real_tags": ["2020", "搅拌机", "blender"]}, {"category": "", "categoryclass": "", "imagename": "aff2e1ac807fe51f5e7e2c48a9bdeca0.png", "infoid": 1031604, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年早些时候，Reddit不得不面对100%远程访问这一意想不到的挑战。我们的员工，也就是我们所知的Snoos，顺应了这种情况，迅速调整了我们的业务和我们合作的方式，帮助Reddit在另一边变得更强大。进化是我们公司的价值观之一，我们一直在挑战自己，不断地让我们的文化和工作体验变得更好。\n展望未来，我们希望满足员工的需求，以便他们能够尽最大努力，特别是在不确定的时期。随着我们实现为世界上每个人创造归属感的使命，我们希望Reddit定位为一支多样化的劳动力队伍，就像它的社区和用户生态系统一样。\n展望未来，团队和团队成员将可以灵活地探索他们的工作地点：在办公室、远程或两者兼而有之。也有一些例外；我们在Reddit有一些角色需要在我们的办公室或特定的地理位置执行，例如设施或IT支持。最终，我们使我们的领导者和他们的团队能够做出这些决策，平衡企业和员工的需求。\n一些团队成员会想要从Reddit办公室搬出去，如果他们能够在远程环境下高效工作，我们会支持这一举措--而且不会调低他们的薪酬(我们稍后会详细讨论这一点)。\nReddit将能够在他们居住的任何地方找到并聘用更多令人惊叹的人才，为多元化打开更多有意义的机会。\n我们的领导者将创建虚拟的和面对面的互动(一旦这样做是安全的)，以建立文化，并在他们的团队和整个Reddit之间培养信任、合作和创新。\n为了帮助将这一想法带回家(双关语)，我们重新设想了我们在美国的薪酬方式。为了支持员工住在他们想住的地方，并尽其所能，我们正在取消美国的地理补偿区。这意味着我们在美国的薪酬将与旧金山和纽约等高成本地区的薪酬范围挂钩，无论员工住在哪里。我们认为，这是灵活性和对员工支持的正确平衡，认识到人们在决定住在哪里时会考虑各种权衡。在国际上，我们每个国家都有一个薪酬范围，现在美国将与这一方法保持一致。\n我们正在重新设想我们办公空间的未来，以支持那些每周在办公室呆1-5天的团队成员。想象一下：休闲和咖啡馆式的座椅，低头专注的私人空间，更大的可预订资源和团队战略上满足IRL的协作空间，没有更多的固定办公桌-我们将有供团队聚集的社区和供在办公室工作的员工预订的办公桌。\n为了让所有这些都发挥作用，我们正专注于创建流程、工作流程和文化，以支持员工分散和远程工作，从而提高工作效率并建立联系、归属感、信任和一致性。\n这种方法有很多好处，包括吸引人才、留住人才、多样性、包容性、归属感等等。我们相信，提供更大的灵活性将提高我们的能力，以：\n在此过程中，通过不要求员工搬迁并增加我们劳动力的多样性来吸引顶尖人才。\n当然，这也有一些不利之处，比如不能经常在一起，但我们相信，通过努力创造有意义的联系时刻，并加倍投入流程来支持更分散的劳动力，好处将远远大于坏处。\n随着我们的团队变得更加分散，我们将对这种模式对我们作为一个企业的业绩的影响有很多了解。我们将不怕不断调整和发展我们的劳动力理念、计划和流程。2020年是史无前例的一年，我们坚信，在可预见的未来，为我们现在和未来的Snoos提供灵活的工作安排是Reddit应该做的正确的事情。", "note_en": "Earlier this year, Reddit had to evolve with the unexpected challenge of going 100% remote. Our employees, or Snoos as we’re known, rose to the occasion, adapting our business and the way we work together quickly to help Reddit come out stronger on the other side. Evolve is one of our company values and we have always challenged ourselves to continuously make our culture and work experience better.\n Looking ahead, we want to meet the needs of our employees so they can do their best work, especially in a time of uncertainty. And as we deliver on our mission of creating belonging for everyone in the world, we want Reddit to be positioned as a workforce that’s as diverse as its ecosystem of communities and users.\n Moving forward, teams and team members will have flexibility to explore where they work: in the office, remotely, or a combination of the two. There are some exceptions; we have some roles at Reddit that need to be performed from our offices or specific geographic locations, such as Facilities or IT Support. Ultimately, we empower our leaders and their teams to make those decisions, balancing the needs of the business and employees.\n  Some team members will want to move away from a Reddit office and if they can be effective while remote, we will be supportive of the move—and won’t adjust their compensation down (we’ll talk more about that in a bit).\n Reddit will be able to find and hire more amazing talent wherever they live, opening up more meaningful opportunities for diversity.\n And our leaders will create virtual and in-person (once it’s safe to do so) interactions to build culture and foster trust, collaboration, and innovation among their teams and across Reddit.\n  To help drive the idea home (pun intended), we’ve reimagined our approach to compensation in the US. To support employees to live where they want to and do their best work, we are eliminating geographic compensation zones in the US. It means that our US compensation will be tied to pay ranges of high-cost areas such as SF and NY, regardless of where employees live.  We believe this is the right balance of flexibility and support for employees, recognizing the varied tradeoffs people consider when deciding where to live.  Internationally, we have had one pay range per country, and now the US will be consistent with this approach.\n  We are reimagining the future of our office space to support those team members who will be in the office 1-5 days per week.   Imagine:  casual and coffee shop-style seating, private space for heads-down focusing, larger bookable resources and collaboration spaces for teams to strategically meet IRL, and no more fixed desks—we’ll have neighborhoods for teams to gather and bookable desks for employees working in the office.\n To make this all work, we are focusing on creating processes, workflows, and a culture that supports employees being distributed and remote to drive productivity and build connection, belonging, trust, and alignment.\n  There are many upsides to this approach, across talent attraction, retention, diversity, inclusion, belonging, and more. We believe that providing more flexibility will increase our ability to:\n Attract top talent by not requiring people to relocate and increase the diversity of our workforce in the process.\n There are some downsides, of course, like not being physically together as frequently, but we’re confident that by leaning into creating meaningful moments of connection and doubling down on processes to support a more distributed workforce, the pros will greatly outweigh the cons.\n As our teams become more distributed, we will have many learnings about the impact of this model on our performance as a business. We will not be afraid to continuously adapt and evolve our workforce philosophies, programs, and processes. 2020 is an unprecedented year, and we strongly believe that for the foreseeable future, providing flexible work arrangements to our current and future Snoos is the right thing to do for Reddit.", "posttime": "2020-10-28 04:18:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "reddit,员工", "title": "不断发展的Reddit员工队伍", "title_en": "Evolving Reddit’s Workforce", "transed": 1, "url": "https://redditblog.com/2020/10/27/evolving-reddits-workforce/", "via": "", "real_tags": ["reddit", "员工"]}, {"category": "", "categoryclass": "", "imagename": "6a18472e3f63b15d2e78ded9d16b01b4.png", "infoid": 1031603, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们在ICmaster的朋友们已经深入研究了苹果A14仿生的包装。芯片尺寸已经被揭开，达到88mm2。尽管塞入了118亿个晶体管，但由于采用了台积电的5 nm工艺节点，芯片尺寸非常小。\n进步的进程并非一帆风顺。苹果的芯片历来在其处理器中达到了工艺节点理论密度的90%以上。这一代人之所以脱颖而出，是因为他们在很大程度上错过了这一标志。与理论密度相比，A14的有效晶体管密度高达78%。尽管台积电声称N5缩小了1.8倍，但苹果只实现了1.49倍的收缩。\n这并不是因为台积电或苹果的失败。这两家公司分别是半导体制造和设计的明显领先者。相反，这种将理论密度转换为有效密度的失败源于SRAM缩放的缓慢消亡。从寄存器到高速缓存，SRAM在整个处理器中被广泛使用。台积电(TSMC)的杰弗里·耶普(Geoffrey Yeap)声称，典型的移动SoC由60%的逻辑、30%的SRAM和10%的模拟/IO组成。\n台积电的N5节点显示出SRAM伸缩放缓的迹象，与之前的收缩有所不同。尽管SRAM在逻辑上是完全缩小的，但它是1.35倍的缩小。这个数字被夸大了，因为一旦考虑到其他辅助电路，它最终会更低。SemiAnalysis预计这将是一种趋势，并将在新节点中持续存在。台积电和三星已经在展示3D堆叠式SRAM，这将有助于缓解密度问题。\n3D堆叠不是灵丹妙药。成本增长已经开始大幅放缓。随着台积电N5晶片定价在约17K美元的范围内，很明显，每个晶体管的成本并没有下降。即使SRAM的规模保持不变，从N7到N5，每个晶体管的成本也将保持不变。", "note_en": "Our friends over at ICmasters have delved into the package of the Apple A14 Bionic. The die size has been unmasked, and it stands in at 88mm 2. Despite cramming in 11.8 billion transistors, the die size is incredibly small thanks to utilization of TSMC’s 5nm process node.\n  The march of progress is not all rosy. Apple’s chips have historically achieved 90%+ of the process node’s theoretical density in their processors. This generation stands out by missing that mark by a large amount. A14 comes in at a cool 78% effective transistor density when compared to theoretical density. Despite TSMC claiming a 1.8x shrink for N5, Apple only achieves a 1.49x shrink.\n  This is not due to a failure of TSMC or Apple. These companies are clear leaders for the manufacturing and design of semiconductors respectively. Instead, this failure to convert theoretical to effective density stems from the slow death of SRAM scaling. SRAM is extensively used throughout a processor from registers to caches. Geoffrey Yeap of TSMC claims that the typical mobile SoC which consists of 60% logic, 30% SRAM, and 10% analog/IO.\n  TSMC’s N5 node diverges from prior shrinks by showing signs of slowing SRAM scaling. Despite being a full shrink with logic, the SRAM is a 1.35x shrink. This figure is overstated as it will end up being even lower once other the other assist circuitry is accounted for. SemiAnalysis expects this to be a trend that will persist with new nodes. TSMC and Samsung are already demonstrating 3D stacked SRAM which will help alleviate the issue of density.\n  3D Stacking is not the silver bullet. Cost scaling has begun slowing dramatically. With TSMC N5 wafer pricing in the ~$17k range, it is clear cost per transistor has not fallen. Even if SRAM scaling kept up, the cost per transistor would still have remained flat from N7 to N5.", "posttime": "2020-10-28 04:18:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,a14,sram", "title": "Apple的A14封装134M晶体管/mm²", "title_en": "Apple’s A14 Packs 134M Transistors/mm²", "transed": 1, "url": "https://semianalysis.com/apples-a14-packs-134-million-transistors-mm2-but-falls-far-short-of-tsmcs-density-claims/", "via": "", "real_tags": ["apple", "a14", "sram"]}]