[{"category": "", "categoryclass": "", "imagename": "7b10ad7b5f198b7a9bb0490f28bd23c4.jpg", "infoid": 1007101, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据投资者称，全球最大和最知名的对冲基金之一复兴科技(Renaissance Technologies)延续了最近表现不佳的局面，今年录得两位数的亏损。\n吉姆·西蒙斯(Jim Simons)创立的量化对冲基金公司复兴科技(Renaissance Technologies)今年截至6月第一周的市场中性工具亏损了近21%。\n据彭博社(Bloomberg)报道，文艺复兴机构多元化阿尔法基金(Renaissance Institution Diversified Alpha Fund)本月出现部分下跌，原因是冠状病毒危机带来的波动。该基金在6月的第一周损失了近9%。\n复兴资本的Rida基金交易全球股票，管理着所谓的“市场中性”投资组合，平衡了对价格上涨和下跌的押注。它还寻求利用期货市场的趋势和其他模式。\n该公司的一位发言人拒绝对英国“金融时报”早些时候报道的回报发表评论。\n根据发给投资者的数据，今年的亏损标志着里达业绩的180度大转弯，该公司在过去五个日历年中每年都有盈利。该基金去年上涨了4.2%。\n彭博上周报导称，该公司的量化股票对冲基金5月上涨2.3%。复兴机构股票基金(Renaissance Institution Equities Fund)今年截至5月份下跌了11%。该基金只交易其电脑模型预计会上涨的在美国上市的股票。\n截至今年早些时候，文艺复兴管理着约750亿美元的资产，长期以来一直是3万亿美元对冲基金行业利润最高的公司之一。这家总部位于纽约东塞托基特的公司最出名的是其Medallion基金，该基金仅对高管和员工开放，过去30年的年化收益约为40%。\n这家750亿美元的计算机驱动基金公司由前冷战密码破译员吉姆·西蒙斯(Jim Simons)创立，在应对冠状病毒大流行带来的市场波动性加剧方面，今年是艰难的一年。\n文艺复兴的股票基金是3月初冠状病毒引发的市场暴跌中最引人注目的受害者之一，这使该公司有望迎来最糟糕的年度表现之一。该公司拒绝对这些数字发表评论。\n随着市场从全球经济停摆的最初冲击中复苏，以遏制疫情，这家总部位于长岛的集团成功收复了部分早先的损失，但其最近的业绩困境让这些涨幅化为乌有。\n文艺复兴公司由西蒙斯先生于1982年创立，是对冲基金行业中最具影响力和最神秘的公司之一。它的旗舰对冲基金Medallion非常成功，以至于它在2005年驱逐了外部投资者，现在只管理公司员工的资金。\n事实证明，对于许多交易员来说，今年金融市场很难计时。疫情的余波促使美国市场以最快的速度跌入熊市区域，随后全球央行和政府的大规模刺激浪潮推动股市大幅反弹，使标准普尔500指数(S&P；500)在今年短暂进入正值区间。", "note_en": "Renaissance Technologies, one of the world’s largest and best-known hedge funds, has extended its recent run of poor performance and has recorded double-digit losses this year, according to investors.\n  Renaissance Technologies, the quantitative hedge fund firm founded by Jim Simons, lost almost 21% this year through the first week of June in its market-neutral vehicle.\n  Part of the decline for the Renaissance Institutional Diversified Alpha fund came this month amid volatility brought on by the coronavirus crisis,  according to Bloomberg. The fund lost almost 9% in the first week of June.\n  Renaissance’s RIDA fund trades global stocks and runs a so-called ‘market-neutral’ portfolio that balances out bets on rising and falling prices. It also seeks to capitalise on trends and other patterns in futures markets.\n    A spokesman for the firm declined to comment on the returns, which were reported earlier by the  Financial Times.\n  This year’s losses mark a U-turn in performance for RIDA, which has made money in each of the previous five calendar years, according to numbers sent to investors. The fund gained 4.2 per cent last year.\n  The firm’s quantitative equity hedge fund rose 2.3% in May, Bloomberg reported last week. The Renaissance Institutional Equities Fund, which only trades U.S.-listed stocks that its computer models expect to rise, was down 11% this year through May.\n  Renaissance, which oversaw about $75 billion as of earlier this year, has long been one of the $3 trillion hedge fund industry’s most profitable firms. The East Setauket, New York-based firm is best known for its Medallion fund, which is only open to executives and employees and has had annualized gains of roughly 40% over the past three decades.\n  The $75bn computer-driven fund firm, founded by former Cold War codebreaker Jim Simons, is having a difficult year navigating the increased market volatility brought on by the coronavirus pandemic.\n  Renaissance’s equities-focused funds were among some of the most high-profile casualties of the coronavirus-led market rout in early March, putting the firm on track for one of its worst annual performances. The firm declined to comment on the numbers.\n    The Long Island-based group had managed to pare back some of its earlier losses as markets recovered from the initial shock of a global economic shutdown to stem the pandemic, but its recent performance woes gave back those gains.\n  Founded by Mr Simons in 1982, Renaissance is one of the most influential and secretive firms in the hedge fund industry. Its flagship hedge fund Medallion was so successful that it ejected outside investors in 2005, and now just manages the money of the firm’s employees.\n  Financial markets have proved hard to time for many traders this year. The fallout from the pandemic provoked the US market’s fastest descent into bear market territory, before a massive wave of stimulus from global central banks and governments prompted a sharp rebound that briefly took the S&amp;P 500 into positive territory for the year.", "posttime": "2020-06-18 23:00:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "对冲,hedge,基金", "title": "文艺复兴对冲基金今年亏损20%", "title_en": "Renaissance hedge fund loses 20% this year", "transed": 1, "url": "https://www.marketwatch.com/story/renaissance-technologies-one-of-the-worlds-best-known-hedge-funds-extends-recent-run-of-poor-performance-2020-06-13", "via": "", "real_tags": ["对冲", "hedge", "基金"]}, {"category": "", "categoryclass": "", "imagename": "d5a602fbd5dd6abf286d99ddb5f7150a.jpg", "infoid": 1007100, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英国国家医疗服务体系(NHS)正在放弃自主研发的解决方案，转而使用苹果(Apple)和谷歌(Google)合作提出的系统，为其冠状病毒接触者追踪应用提供支持。这一变化于6月18日由卫生和社会保健部(DHSc)宣布并确认。\n此举是该应用程序方向的重大转变。最近几周，围绕这款应用的开发和讨论似乎陷入停滞，这让许多人怀疑，它的工作方式并不像负责该项目的技术集团NHSX所希望的那样。\n这一转变将使苹果(Apple)的iPhone和谷歌(Google)的Android设备内置联系人追踪功能，提供近距离联系人的信息，从而在用户病毒检测呈阳性时向联系人网络发出警报。然而，DHSc已经证实，这款应用程序将整合在怀特岛上试验的经验教训。\nNHS Test and Trace执行主席迪多·哈丁男爵夫人和NHSX首席执行官马修·古尔德在一份联合声明中表示，我们已经同意与谷歌和苹果分享我们自己在估计应用用户与谷歌和苹果之间的距离方面的创新工作，我们希望这些工作能让其他人受益，同时使用他们的解决方案来解决通过我们严格的测试发现的一些具体技术挑战，NHS Test and Trace执行主席迪多·哈丁男爵夫人和NHSX首席执行官马修·古尔德在一份联合声明中表示。\n预计NHS的应用程序看起来将与目前在怀特岛上测试的版本相同，但该应用程序的基本机制现在将有很大不同。\n谷歌-苹果系统采用的是去中心化的模式，这意味着数据将保留在手机上，当新冠肺炎的诊断结果呈阳性时，系统会匿名通知其他用户。NHS无法获得这些信息，这意味着当局无法收集数据并进行分析。\n最初，这已经在英国的愿望清单上，允许识别热点，以便采取行动，并允许在所谓的集中式系统中收集更广泛的流行病学数据。隐私权倡导者已经对这种做法发出了警告，他们更喜欢科技巨头提出的去中心化模式。\n当苹果(Apple)和谷歌(Google)首次提出自己的接触者追踪系统时，英国卫生大臣马特·汉考克(Matt Hancock)曾表示，该系统有使用的潜力；事实上，英国“金融时报”在2020年5月报道称，NHSX正在调试第二个应用程序，以便英国可以使用这两个系统中的任何一个。\n在宣布NHS将改用谷歌-苹果系统时，汉考克表示：全球各国在开发一款能够正确处理所有这些要素的应用程序方面面临挑战，但通过正在进行的国际合作，我们希望能够学习、改进并找到解决方案，以加强我们对这种病毒的全球反应。\n从一开始，技术专家就警告称，任何不使用谷歌-苹果方式的联系人追踪系统都将很难有效，因为苹果在应用程序在后台运行时处理蓝牙接入的方式。蓝牙是系统的基本元素，虽然最初的NHSX应用程序声称已经找到了解决问题的方法，但我们怀疑这仍然是问题的一部分。\n使用谷歌和苹果的核心代码应该意味着，任何基于他们系统的应用程序都应该在电池续航时间方面更有效率，并拥有对设备硬件的必要访问权限。与此同时，DHSc表示，它正在分享自己基于接触距离的发现，目的是改善苹果和谷歌提供的系统。\n虽然这是一个方向的改变，但这款应用的发布仍然没有时间表。", "note_en": "The UK&#39;s NHS is stepping back from the development of its homegrown solution and instead turning to the system proposed by an Apple and Google partnership to power its  coronavirus contact tracing app. The change was announced and confirmed by the Department of Health and Social Care (DHSC) on 18 June.\n The move is a major change of direction for the app. Development and discussion around the app had seemingly stalled in recent weeks, leading many to suspect that it wasn&#39;t working the way that NHSX - the technology group responsible for the project - had hoped.\n The shift will see in-built contact tracing from Apple&#39;s iPhone and Google&#39;s Android devices providing the information about close proximity contacts, allowing a network of contacts to be alerted should a user test positive for the virus. However, the DHSC has confirmed that the app will integrate the learnings from its trials on the Isle of Wight.\n &#34;...we have agreed to share our own innovative work on estimating distance between app users with Google and Apple, work that we hope will benefit others, while using their solution to address some of the specific technical challenges identified through our rigorous testing,&#34; says a joint statement from Baroness Dido Harding, executive chair of NHS Test and Trace, and Matthew Gould, CEO of NHSX.\n It&#39;s expected that the NHS app will look the same as the version currently in testing on the Isle of Wight, but the underlying mechanics of the application will now be substantially different.\n  The Google-Apple system works on a &#34;decentralised&#34; model, meaning that the data remains on the phone and anonymously notifies other users when triggered by a positive COVID-19 diagnosis. This information is not available to the NHS, meaning that authorities cannot gather the data and analyse it.\n Originally, that had been on the UK&#39;s wishlist, allowing the identification of hotspots so that action could be taken and to allow wider epidemiological data gathering, in a so-called &#34;centralised&#34; system. Privacy advocates had raised warning flags about this approach, preferring the decentralised model proposed by the tech giants.\n When Apple and Google first proposed their own system of contact tracing, Health Secretary Matt Hancock had said that there was potential to use the system; indeed, it was reported in  by the Financial Times in May 2020 that NHSX was commissioning a second app so that the UK could use either system moving forward.\n On the announcement that the NHS was switching to the Google-Apple system, Hancock said: &#34;Countries across the globe have faced challenges in developing an app which gets all of these elements right, but through ongoing international collaboration we hope to learn, improve and find a solution which will strengthen our global response to this virus.&#34;\n From the outset, technology experts had warned that any contact tracing system that didn&#39;t use the Google-Apple approach would struggle to be effective, because of the way that Apple handles access to Bluetooth when apps are running in the background. Bluetooth is the essential element of the system and although the original NHSX app claimed to have found a way around the problem, we suspect that this is still part of the issue.\n Using core code from Google and Apple should mean that any app based on their system should be more efficient in terms of battery life, as well as having the necessary access to the device&#39;s hardware. At the same time, the DHSC is saying that it is sharing its own findings based around contact proximity with the aim of improving the system that Apple and Google offers.\n Although this is a change of direction, there&#39;s still no timeline for the app&#39;s release.", "posttime": "2020-06-18 22:59:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,谷歌,苹果,google,app", "title": "英国将国民保健系统新冠肺炎应用程序转换为谷歌-苹果系统", "title_en": "UK shifts NHS Covid-19 app to Google-Apple system", "transed": 1, "url": "https://www.pocket-lint.com/phones/news/152606-uk-shifts-nhs-covid-19-app-to-google-apple-system", "via": "", "real_tags": ["程序", "谷歌", "苹果", "google", "app"]}, {"category": "", "categoryclass": "", "imagename": "73173ca627582390b2d0f482852a0f2e.jpg", "infoid": 1007099, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据佛罗里达大西洋大学和佛罗里达国际大学教授的最新全国指数，在全美范围内，拥有住房的成本正在超过租赁成本，在东南部、中西部和太平洋西北部的部分地区，两者之间的差异正在急剧上升。Beracha，Hardin&amp；Johnson Buy Vs.Rent指数决定了消费者是会更快地创造财富，还是会更快地购买房屋和建立资产净值，或者租下同样的房产，然后将原本会花在所有权上的钱进行再投资，比如税收、保险和维修。该指数考察了整个美国房地产市场，但隔离了23个关键大都市地区，考虑到租金、抵押贷款利率、投资回报、物业税、保险和房屋维护成本。\n季度数据显示，亚特兰大、达拉斯、丹佛、休斯顿、堪萨斯城、迈阿密、匹兹堡、旧金山、西雅图和俄勒冈州波特兰都明显高于其长期基本房价水平。FAU商学院房地产经济学家肯·H·约翰逊(Ken H.Johnson)博士表示，这意味着在这些领域，租房显然是更好的选择。\n他说，这些都是房价下跌的最大风险，包括新冠肺炎未来给房价带来的任何负面影响。我们仍在拭目以待，看这场流行病将如何影响房地产市场。\n指数中追踪的其余城市-波士顿、芝加哥、辛辛那提、克利夫兰、底特律、檀香山、洛杉矶、密尔沃基、明尼阿波利斯、纽约、费城、圣地亚哥和圣路易斯-在购房需求方面似乎几乎没有压力。这表明，在这些地区租房还是买房都是一件摇摆不定的事情。\n传统上，拥有住房被认为是比为了积累财富而租房要好得多的选择，但2006年至2011年的历史性房地产崩盘改变了许多美国人的这种看法，新冠肺炎疫情的影响很快就会感受到。2013年首次发布的购房与租金指数显示，即使在房价上涨的情况下，对于纪律严明的投资者来说，租房也可能同样有利可图，甚至更有利可图。\n不过，FIU霍洛房地产学院(Hollo School Of Real Estate At FIU)的助理教授伊莱·贝拉查(Eli Beracha)博士表示，不愿将原本会花在购房上的钱投资的租房者最好买房。\n他说，拥有住房并不一定会产生诱人的回报率，但它确实会迫使消费者更加注意自己的支出。租房者应该对自己诚实。如果他们不打算把多余的钱投入股市，那么从长远来看，更安全的选择是持有。\n该指数的房价数据涵盖了1月、2月和3月的所有交易，当时冠状病毒大流行的大部分影响还没有在全国范围内感受到。约翰逊和贝拉查一致认为，这个时机让人很难预测新冠肺炎可能会对价格造成什么影响。\n约翰逊说，如果能迅速开发出有效的治疗方法和疫苗，新冠肺炎对美国住房的影响应该是微乎其微的。但是，如果这个国家仍然处于病毒的长期威胁之下，房价大幅下跌的可能性很高。引用：租房显然比在美国大部分地区买房要好(2020年6月18日)，这是从https://phys.org/news/2020-06-renting-home-nation.html网站上检索到的。\n本文档受版权保护。除为私人学习或研究的目的而进行的任何公平交易外，未经书面许可不得复制任何部分。提供的内容仅供参考。", "note_en": "The cost of homeownership is outpacing the cost of renting across the United States, and the discrepancy between the two is rising sharply in parts of the Southeast, Midwest and Pacific Northwest, according to the latest national index by professors at Florida Atlantic and Florida International universities.    The  Beracha, Hardin &amp; Johnson Buy vs. Rent Index determines whether consumers will create wealth faster in buying a home and building equity or renting the same property and reinvesting the money they would have spent on ownership, such as taxes, insurance and maintenance. The index examines the entire U.S. housing market but isolates 23 key metropolitan areas, factoring in  , rents, mortgage rates, investment returns, property taxes, insurance and home maintenance costs.\n  The quarterly numbers show that Atlanta, Dallas, Denver, Houston, Kansas City, Miami, Pittsburgh, San Francisco, Seattle and Portland, Oregon, are all significantly above their long-term fundamental home price levels. That means renting clearly is the better option in those areas, according to Ken H. Johnson, Ph.D., a real estate economist within FAU&#39;s College of Business.\n  &#34;These   are the most at risk for home price declines, including any future negative impacts to housing values brought about by COVID-19,&#34; he said. &#34;We&#39;re still waiting to see how the pandemic will affect the housing market.&#34;\n  The remaining metros tracked in the index—Boston, Chicago, Cincinnati, Cleveland, Detroit, Honolulu, Los Angeles, Milwaukee, Minneapolis, New York, Philadelphia, San Diego and St. Louis—appear to be under little or no pressure in terms of the demand for homeownership. That suggests it&#39;s a toss-up between renting and buying in those areas.\n  Homeownership traditionally was considered the far better option than renting for building wealth, but the historic housing crash from 2006-2011 changed that perception for many Americans, and the effects of the COVID-19 pandemic will soon be felt. The buy vs. rent index, first published in 2013, shows that even when home prices are rising, renting can be equally or more lucrative for disciplined investors.\n  Still, renters who would not invest the money they would have spent on ownership are better off buying a home, according to Eli Beracha, Ph.D., an assistant professor in the Hollo School of Real Estate at FIU.\n  &#34;Homeownership doesn&#39;t necessarily generate attractive rates of return, but it does force consumers to be more mindful of their expenses,&#34; he said. &#34;Renters should be honest with themselves. If they aren&#39;t going to put their extra money into the stock market, then the safer option over the long run would be to own.&#34;\n  The index&#39;s housing price numbers cover all transactions for the months of January, February and March, before much of the effect from the coronavirus pandemic was felt nationwide. Johnson and Beracha agree that the timing makes it difficult to predict what COVID-19 may do to   prices.\n  &#34;If effective treatments and a vaccine are developed quickly, COVID-19&#39;s impact on U.S. housing   should be minimal,&#34; Johnson said. &#34;But if the nation remains under a long-term threat from the virus, the potential for significant   price declines is high.&#34;           Citation: Renting a home is clearly better than buying in much of the nation (2020, June 18) retrieved 18 June 2020 from https://phys.org/news/2020-06-renting-home-nation.html\n  This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.", "posttime": "2020-06-18 22:58:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "地区,home,房地产", "title": "在美国大部分地区，租房显然比买房要好", "title_en": "Renting a home is clearly better than buying in much of US", "transed": 1, "url": "https://phys.org/news/2020-06-renting-home-nation.html", "via": "", "real_tags": ["地区", "home", "房地产"]}, {"category": "", "categoryclass": "", "imagename": "0466800e273d53022613c30557868e49.jpeg", "infoid": 1007095, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从冠状病毒袭击美国以来，美国人已经免除了1亿多笔学生贷款、汽车贷款和其他形式的债务，这是这种大流行给人们的财务造成损失的最新迹象。\n根据信用报告公司TransUnion的数据，自3月1日以来登记延期、忍耐或其他类型救济并仍处于这种状态的账户数量在5月底升至1.06亿，是4月底的三倍。\n..。", "note_en": "Americans have skipped payments on more than 100 million student loans, auto loans and other forms of debt since the coronavirus hit the U.S., the latest sign of the toll the pandemic is taking on people’s finances.\n  The number of accounts that enrolled in deferment, forbearance or some other type of relief since March 1 and remain in such a state rose to 106 million at the end of May, triple the number at the end of April, according to credit-reporting firm TransUnion.\n...", "posttime": "2020-06-18 22:56:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,冠状病毒,贷款,skip", "title": "美国人跳过数百万笔贷款，冠状病毒带来经济损失", "title_en": "Americans Skip Millions of Loan Payments as Coronavirus Takes Economic Toll", "transed": 1, "url": "https://www.wsj.com/articles/americans-skip-millions-of-loan-payments-as-coronavirus-takes-economic-toll-11592472601", "via": "", "real_tags": ["病毒", "冠状病毒", "贷款", "skip"]}, {"category": "", "categoryclass": "", "imagename": "bc227053fda61aca29776de4f86bfbed.jpeg", "infoid": 1007094, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "旧金山是美国最昂贵的公寓市场，随着该市自吹自擂的科技行业裁员，越来越多的租户离开该市，该市的租金正在暴跌。\n公寓数据公司RealPage的数据显示，旧金山5月公寓空置率升至6.2%。这一数字高于仅仅三个月前的3.9%，当时居家订单生效，该市更多的人决定不续签租约。", "note_en": "Rents in San Francisco, the most expensive apartment market in the U.S., are tumbling as the city’s vaunted tech sector sheds jobs and more tenants leave the city.\n  The apartment vacancy rate in San Francisco rose to 6.2% in May, according to apartment data firm RealPage. That’s up from 3.9% only three months ago, after stay-at-home orders went into effect and more people in the city decided not to renew their leases.", "posttime": "2020-06-18 22:56:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "旧金山,公寓,san,数据", "title": "一度繁荣的旧金山公寓市场走势逆转", "title_en": "Once Booming San Francisco Apartment Market Goes in Reverse", "transed": 1, "url": "https://www.wsj.com/articles/once-booming-san-francisco-apartment-market-goes-in-reverse-11592472602", "via": "", "real_tags": ["旧金山", "公寓", "san", "数据"]}, {"category": "", "categoryclass": "", "imagename": "c9ce2f07c81deb934b8d75df8319763d.png", "infoid": 1007093, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近，围棋团队宣布了他们围棋提案中泛型的最新设计草案。它详细介绍了做出某些决定的原因、实施细节等。\n在本文中，我的目标是总结即将发生的主要变化，因为整个设计草案可能会让很多人感到厌烦。\n我将提供一些代码片段来演示主要功能，并让您有机会体验它们，这要归功于新的支持泛型的围棋游乐场。\n下面是在类型参数上没有任何约束的泛型函数的外观：\n要在泛型类型上添加约束，您可以要求它实现给定的接口：\n编写多个类型参数的约束的方式与编写函数参数类型的方式相同：\n您可以基于一组受支持的类型来约束类型，而不是基于一组方法来约束类型。例如，您可以指定接受只能是int或long的泛型类型。\n例如，您可以利用“小于”、“大于”等运算符，这些运算符仅适用于围棋中的基本类型：\n您还有一个称为比较的开箱即用约束，它将类型约束为支持==和！=运算符的类型。\n使用这些约束类型列表和/或可比较类型的接口不能由结构实现。\n可以使用泛型类型定义结构。在类型声明中指定之后，不需要为该类型的所有函数指定类型：\n您也可以在接口中执行此操作。当类型约束依赖于自身时，这尤其有用。\n例如，您有一个T的类型约束，它需要一个接受T参数的EQUAL方法：\n如果您需要指定一个类型参数，该参数具有状态修改功能(例如setter)，那么您可以指定一个指针类型约束：\n请注意，上面的示例要求您显式指定将在函数-FromStrings(可设置)…中使用的类型。\n这是因为只要类型不作为函数参数出现，一旦编译代码，编译器就无法推断实际类型。因此，您需要显式指定它。\n这篇文章故意简明扼要，直截了当。希望它能帮助您在喝早餐咖啡的同时，快速了解最新的仿制药草案设计。\n然而，在围棋中围绕泛型的任何单一设计选择背后都有很大的理论基础。如果您有兴趣更深入地研究这个主题，请查看官方的设计草案文档。", "note_en": "Recently, the Go team announced an  updated draft design for their Generics in Go proposal. It goes into a lot of details about why certain decisions were made, implementation details, etc.\n In this article, my goal is to summarise the major upcoming changes, as the whole draft design can be a mouthful for many.\n I will provide some code snippets to demonstrate the major features as well as give you the chance to experiment yourself with them, thanks to the  new Go playground with support for generics.\n   Here’s how a generic function looks like without any constraints on the type parameter:\n  To add constraints on the generic type, you can demand that it implements a given interface:\n    Constraints on multiple type parameters are written the same way you write function argument types:\n     Instead of constraining types based on a set of methods, you can constraint them based on a set of supported types. For example, you could specify that you accept a generic type which can only be an int or a long.\n This allows you to e.g. leverage operators like “less than”, “greater than”, which are only available for basic types in Go:\n  You also have an out-of-the-box constraint called  comparable, which constraints types to those which support the == and != operators.\n  Interfaces using these constraints – type lists and/or comparable, cannot be implemented by a struct.\n   Structs can be defined using a generic type. Once specified, in the type declaration, there is no need to specify the type for all the functions of the type:\n  You can also do that in interfaces. This is especially useful when a type constraint depends on itself.\n E.g. you have a type constraint for  T, which requires an  Equal method, which accepts a  T parameter:\n  In case you need to specify a type parameter, who has a state-modifying function (e.g. a setter), then you can specify a pointer type constraint:\n  Notice how this example above requires that you explicitly specify the type you’ll use in the function –  FromStrings(Settable)…\n This is because whenever the type is not present as a function argument, the compiler cannot infer the actual type once the code is compiled. Hence, you need to explicitly specify it.\n  This article was purposefully succinct and straightforward. Hopefully, it will help you quickly get up-to-date on the latest generics draft design, while you’re drinking your morning coffee.\n However, there is a lot of rationale behind any single design choice around generics in Go. If you are interested to dive deeper into this subject, check out the  official draft design doc.", "posttime": "2020-06-18 22:38:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,通用,guide,类型", "title": "最新围棋通用设计简明指南", "title_en": "A Concise Guide to the Latest Go Generics Draft Design", "transed": 1, "url": "https://pmihaylov.com/go-generics-draft-design/", "via": "", "real_tags": ["设计", "通用", "guide", "类型"]}, {"category": "", "categoryclass": "", "imagename": "0b83bdfccf8f5f94e0f8eb2a0cc53702.jpeg", "infoid": 1007092, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Wirecard表示，审计机构安永(EY)找不到约占其资产负债表四分之一的现金余额。\n消息传出后，其股价立即暴跌，跌幅一度高达66%。截至美国东部时间06：40，股价下跌了47%。\n该公司补充称，安永(EY)延迟核销账目可能意味着本周初将收回约20亿欧元的贷款。\nWirecard股价周四暴跌逾60%，因这家德国支付巨头再次推迟公布年度业绩，并称审计师无法确认其资产负债表上是否存在19亿欧元(21亿美元)现金。\n这家总部位于慕尼黑的公司周四上午在一份声明中表示，审计机构安永(EY)找不到现金余额-约占其资产负债表的四分之一。它补充称，有迹象表明，一名受托人做出了虚假的余额确认，以欺骗审计师，并造成对此类现金余额存在的错误看法。\n该公司表示，Wirecard管理委员会正在与审计师密切合作，以澄清情况。该公司补充称，安永(EY)延迟核销账目可能意味着本周初将收回约20亿欧元的贷款。\n消息传出后，Wirecard的股价立即暴跌，截至上午8点40分，股价下跌了近64%。埃特。\n这家四面楚歌的集团已从德国顶级金融科技宠儿之一的位置，跌至一家因欺诈指控而陷入争议的公司。该公司去年的市值一度超过240亿欧元，甚至在德国蓝筹股指数中取代了德国商业银行，但自那以来其市值已降至仅65亿欧元。\n英国“金融时报”就其对Wirecard会计操作的调查发表了一系列报道。根据这些始于2019年1月的报告，Wirecard新加坡办事处试图通过伪造和回溯合同来夸大收入。10月份的另一篇报道称，Wirecard的员工似乎合谋夸大迪拜和都柏林子公司的销售额和利润，误导安永(EY)。", "note_en": "Wirecard said that auditor EY couldn&#39;t find the cash balances, which represent roughly a quarter of its balance sheet.\n Its shares cratered immediately after the news, falling as much as 66% at one point. Shares were down 47% by 06:40 ET.\n It added that the delay in getting its accounts signed off by EY could mean loans of around 2 billion euros would be called in early this week.\n Wirecard shares plunged more than 60% on Thursday as the German payments giant postponed its annual results once again and said auditors could not confirm the existence of 1.9 billion euros ($2.1 billion) in cash on its balance sheet.\n The Munich-headquartered company said in a  statement Thursday morning that auditor EY couldn&#39;t find the cash balances — which represent roughly a quarter of its balance sheet. There were indications that &#34;spurious balance confirmations&#34; had been made by a trustee to &#34;deceive the auditor and create a wrong perception of the existence of such cash balances,&#34; it added.\n  &#34;The Wirecard management board is working intensively together with the auditor towards a clarification of the situation,&#34; the firm said. It added that the delay in getting its accounts signed off by EY could mean loans of around 2 billion euros would be called in early this week.\n Wirecard&#39;s share price cratered immediately after the news, and was trading almost 64% lower by 8:40 a.m. ET.\n The embattled group has fallen from its position as  one of Germany&#39;s top financial technology darlings to a company mired in controversy due to  allegations of fraud. The firm was at one point last year worth more than 24 billion euros and even replaced Commerzbank in the German blue-chip index, but has since seen its market capitalization decline to just 6.5 billion euros\n The Financial Times has published a series of reports on its investigation into Wirecard&#39;s accounting practices. According to those reports, which began back in January 2019, Wirecard&#39;s Singapore office tried to inflate revenue through forged and backdated contracts. Another story in October claimed that Wirecard&#39;s staff appeared to conspire to inflate sales and profits at subsidiaries in Dubai and Dublin and mislead EY.", "posttime": "2020-06-18 22:38:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "wirecard,cash", "title": "Wirecard称21亿美元现金失踪", "title_en": "Wirecard says $2.1B cash is missing", "transed": 1, "url": "https://www.cnbc.com/2020/06/18/wirecard-shares-plummet-as-payments-firm-postpones-annual-report.html", "via": "", "real_tags": ["wirecard", "cash"]}, {"category": "", "categoryclass": "", "imagename": "f835d316bcef4bb54bfc02acc50c3337.jpg", "infoid": 1007091, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上个月，Facebook游戏部门的高管和工程师向苹果提交了他们的新应用Facebook Gaming，以获得批准在这家iPhone制造商的App Store中提供这款应用。\n苹果花了几周时间考虑Facebook的申请。本月，它宣布了自己的裁决：被拒绝。\nFacebook团队对此并不感到惊讶。这并不是苹果第一次拒绝Facebook游戏应用程序。或者第二个。或者甚至是第三个。\n据三名了解这些公司的消息人士称，自2月以来，苹果已经拒绝了至少五个版本的Facebook Gaming，这些消息人士要求匿名，因为细节是保密的。知情人士说，每一次，苹果都引用了它的规定，禁止以分发休闲游戏为“主要目的”的应用程序。\n其中两名知情人士说，Facebook Gaming可能也受到了伤害，因为它似乎在与苹果自己的游戏销售竞争。到目前为止，游戏是全球最有利可图的移动应用类别。苹果的App Store是iPhone和iPad用户找到新游戏和其他程序的唯一官方批准的地方，去年创造了约150亿美元的收入。\n苹果拒绝了同为硅谷巨头的Facebook的这款应用，这表明苹果对移动软件和娱乐生态系统的控制--监管机构正在越来越多地审视这一影响力。周二，欧盟执行机构欧盟委员会(European Commission)表示，已对苹果展开正式的反垄断调查，以确定该公司强加给应用开发商的条款是否违反了竞争规则。\n欧盟执委会负责竞争政策的执行副主席玛格丽特·维斯特格(Margrethe Vestager)说，“我们需要确保苹果的规定不会扭曲苹果与其他应用开发商竞争的市场竞争。”\n本周，Basecamp公开抱怨称，其新的电子邮件应用程序嘿被App Store拒绝，因为它向苹果支付系统以外的客户收取费用，使这家巨头无法收取30%的提成。\nBasecamp联合创始人兼首席技术官大卫·汉森(David Hansson)在Twitter上写道：“我们一直在努力在苹果应用商店的决策中找到逻辑和一致性。”“答案要简单得多：权力。苹果可以在他们想做的时候做他们想做的事情，所以他们就这么做了。“。\n汉森补充说，司法部的反垄断部门早些时候曾与他联系，讨论有关苹果的问题。\n苹果将于下周举行年度开发者大会，该公司表示，App Store有许多提供休闲游戏的应用程序，并遵循其规则，包括主要的Facebook应用程序。\n苹果长期以来一直对其移动设备采取“围墙花园”的方式，而其主要移动竞争对手谷歌(Google)及其Android操作系统则采取了更加自由放任的理念。两家公司在其应用商店上购买的大部分商品中，有30%是通过其应用商店进行的，70%留给了应用程序开发人员。\n游戏行业研究公司Newzoo的市场分析主管坎迪斯·穆德里克(Candice Mudrick)表示：“苹果和Google Play的应用商店一直奉行不同的战略，它们与封闭的生态系统-苹果-与开放的生态系统-谷歌-公司的属性保持一致。”\n苹果表示，它密切监控其App Store生态系统，以确保最高标准的质量和安全。根据其App Store原则：“当你下载一款应用时，它应该如承诺的那样工作。我们仔细审查每款应用程序，并要求开发者严格遵循隐私、设计和商业模式方面的指导方针。“。\n但随着时间的推移，这越来越让一些应用程序开发者感到恼火。欧盟对苹果的调查是由Spotify去年的一项投诉引发的，Spotify的音乐流媒体服务与Apple Music竞争。Spotify和其他人批评苹果对通过其App Store销售的数字服务收取高达30%的费用，认为这相当于一种违反竞争法的税收。\nFacebook在4月份宣布了其游戏应用程序，当时人们正在适当的地方躲避冠状病毒大流行，玩更多的视频游戏。对于这家社交网络来说，这款新的应用程序是一种更深入地吸引用户的方式。\n这款免费的应用程序有三个主要组成部分：观看其他人玩游戏的直播；与其他游戏玩家建立社交网络；以及玩简单的游戏，比如与朋友和Thug Life的文字游戏。在苹果和Android设备上，这些简单的游戏都可以在Facebook Gaming的应用程序中使用名为HTML5的软件进行交付。\n谷歌很快批准了Facebook Gaming用于其Google Play应用商店，并于4月20日开始在全球范围内提供这款应用。在Facebook Gaming的Android版本中，简单游戏的目录是按类别分类的，并带有五颜六色的图标。其中一些游戏允许玩家在游戏中花费真金白银进行购买。\n知情人士说，Facebook最初在2月下旬将其游戏应用程序提交给苹果公司审批。他们说，苹果拒绝了这个版本，理由是其应用规则的第4.7条规定，“只要代码分发不是应用的主要目的”，以及“代码不在商店或类似商店的界面中提供”等限制，HTML5游戏就是被允许的。\n但Facebook向苹果展示的游戏应用程序的初始版本与Android版本类似，以一种可以被解读为“商店式”的方式按类别列出游戏。\n知情人士说，为了让这款游戏应用通过苹果的审查程序，Facebook随后从几个方面改变了游戏展示的设计。五颜六色的图标被移除，取而代之的是平淡无奇的列表。删除了不同的游戏类别，以便一次列出所有游戏。对游戏进行分类的能力也被剥夺了。\n知情人士说，Facebook还包括了一个版本，看起来与苹果设备上Facebook主要应用程序中已经存在的此类游戏的呈现方式几乎完全相同，这是一个没有字母顺序、无法排序的列表。\n知情人士说，在Facebook最近提交的文件中，这款游戏应用程序没有为可玩游戏单独提供标签，也没有让用户从广泛的游戏选择中进行选择。取而代之的是，该版本在用户的新闻和活动Feed中推荐了某些游戏。\n自那以后，Facebook一直在权衡下一步行动。知情人士说，该公司正在考虑在苹果设备上发布Facebook游戏，根本没有可玩的游戏。他们说，另一个选择是继续让用户在应用程序中更难找到可玩的游戏。", "note_en": "Executives and engineers from Facebook’s games division submitted their new app,  Facebook Gaming, to Apple last month for approval to offer it in the iPhone maker’s App Store.\n Apple considered Facebook’s application for a few weeks. This month, it delivered its verdict: denied.\n The Facebook team was not surprised. It wasn’t the first time Apple had said no to the Facebook Gaming app. Or the second. Or even the third.\n Since February, Apple has rejected at least five versions of Facebook Gaming, according to three people with knowledge of the companies, who spoke on the condition of anonymity because the details are confidential. Each time, the people said, Apple cited its rules that prohibit apps with the “main purpose” of distributing casual games.\n Facebook Gaming may also have been hurt by appearing to compete with Apple’s own sales of games, two of the people said. Games are by far the most lucrative category of mobile apps worldwide. Apple’s App Store, the only officially approved place for iPhone and iPad users to find new games and other programs, generated about $15 billion in revenue last year.\n Apple’s rejections of the app from Facebook, a fellow Silicon Valley powerhouse, illustrate the control it exerts over the mobile software and entertainment ecosystem — clout that regulators are increasingly examining. On Tuesday, the European Commission, the executive body of the European Union, said it had  opened a formal antitrust investigation into Apple to determine if the terms that the company imposes on app developers violate competition rules.\n “We need to ensure that Apple’s rules do not distort competition in markets where Apple is competing with other app developers,” said Margrethe Vestager, the European Commission executive vice president in charge of competition policy.\n This week, Basecamp publicly complained that its  new email app, Hey, had been denied from the App Store because it charged customers outside Apple’s payment system, keeping the giant company from collecting its 30 percent cut.\n “We keep trying to find logic, consistency in Apple’s App Store decisions,” David Hansson, Basecamp’s co-founder and chief technology officer,  wrote on Twitter. “The answer is much more basic: power. Apple can do what they want, when they want, so they do.”\n Mr. Hansson added that the Justice Department’s antitrust division had contacted him earlier to talk about Apple.\n  Apple, which will hold its annual developer conference next week, said the App Store has many apps that offer casual games and that follow its rules, including the main Facebook app.\n  Apple has long taken a “ walled garden” approach to its mobile devices while its main mobile competitor, Google and its Android operating system, has adopted a more laissez-faire philosophy. Both companies take 30 percent of most purchases on their app stores, leaving 70 percent to app developers.\n “Apple and Google Play have always pursued different strategies for their app stores, which align with the closed ecosystem — Apple — versus open ecosystem — Google — company attributes,” said Candice Mudrick, head of market analysis at Newzoo, a game industry research firm.\n Apple has said it monitors its App Store ecosystem closely to ensure the highest standards of quality and security. According to its  App Store principles: “When you download an app, it should work as promised. We carefully review each app and require developers to follow strict guidelines on privacy, design and business models.”\n But over time, that has increasingly grated on some app developers. The European Union investigation into Apple was spurred by a  complaint last year from Spotify, whose music-streaming service competes with Apple Music. Spotify and others have criticized Apple for charging a fee of up to 30 percent on digital services sold through its App Store, arguing that it amounts to a tax that violates competition laws.\n Facebook announced its Gaming app in April as people were sheltering in place from the coronavirus pandemic and playing more video games. For the social network, the new app was a way to more deeply engage its users.\n The free app has three main components: watching live streams of other people playing games; socially networking with other gamers; and playing simple games like Words With Friends and Thug Life. On both Apple and Android devices, those simple games can be delivered within Facebook Gaming’s app using software called HTML5.\n  Google quickly approved Facebook Gaming for its Google Play app store and began  offering the app worldwide on April 20. In the Android version of Facebook Gaming, a catalog of simple games is presented by category and with colorful icons. Some of those games allow players to spend real money for in-game purchases.\n Facebook initially submitted its Gaming app to Apple for approval in late February, said the people with knowledge of the situation. Apple rejected that version, they said, citing  Section 4.7 of its app rules, which state that HTML5 games are allowed “as long as code distribution isn’t the main purpose of the app” and “the code is not offered in a store or store-like interface,” among other restrictions.\n But the initial version of the Gaming app that Facebook showed to Apple was similar to the Android version, listing games by category in a manner that could be interpreted as “store-like.”\n Trying to get the Gaming app through Apple’s review process, Facebook then changed the design of the presentation of games in several ways, the people said. The colorful icons were removed in favor of a bland listing. The different games categories were removed to list all games at once. The ability to sort games was also taken away.\n Facebook also included a version that looked almost exactly like how such games are presented already within the main Facebook app on Apple devices, which is a single unalphabetized, unsortable list, the people said.\n  In Facebook’s most recent submission, the Gaming app did not include a separate tab for playable games and included no way for the user to choose from a wide selection of games to play, the people said. Instead, that version suggested certain games within the user’s news and activity feed.\n  Since then, Facebook has been weighing its next move. The company is considering releasing Facebook Gaming on Apple devices without playable games at all, the people with knowledge of the social network said. Another option, they said, is continuing to make playable games even more difficult for users to find within the app.", "posttime": "2020-06-18 22:19:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,苹果,facebook,app,apple", "title": "苹果至少第五次拒绝Facebook的游戏应用", "title_en": "Apple Rejects Facebook’s Gaming App, for at Least the Fifth Time", "transed": 1, "url": "https://www.nytimes.com/2020/06/18/technology/apple-ios-facebook-gaming-app.html", "via": "", "real_tags": ["游戏", "苹果", "facebook", "app", "apple"]}, {"category": "", "categoryclass": "", "imagename": "33231f19fcf9066ca9ea5cb2f292fe32.jpeg", "infoid": 1007090, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "路透旧金山8月23日电-Awake Security的研究人员告诉路透，一项新发现的间谍软件努力通过下载3,200万次谷歌市场领先的Chrome网络浏览器的扩展来攻击用户，突显出科技行业未能保护浏览器，因为浏览器更多地用于电子邮件、工资单和其他敏感功能。\nAlphabet Inc的谷歌(GOOGL.O)表示，在上月接到研究人员的警告后，该公司从其官方Chrome网络商店中删除了70多个恶意插件。\n谷歌发言人Scott Westover告诉路透社：“当我们接到网络商店中违反我们政策的扩展的警报时，我们会采取行动，并将这些事件作为培训材料，以改进我们的自动和手动分析。”\n大多数免费扩展声称是为了警告用户有问题的网站或将文件从一种格式转换为另一种格式。取而代之的是，他们抽走了提供访问内部业务工具凭据的浏览历史和数据。\n觉醒联合创始人兼首席科学家加里·戈罗姆(Gary Golomb)表示，从下载量来看，这是迄今为止影响最深远的恶意Chrome商店活动。\n谷歌拒绝讨论最新的间谍软件与之前的活动相比有何不同，破坏的广度有多大，也拒绝讨论为什么尽管过去承诺更密切地监督服务，但谷歌没有自己检测并删除不良扩展。\n目前还不清楚谁是分发恶意软件的幕后黑手。觉醒说，开发者在向谷歌提交扩展时提供了虚假的联系信息。\n美国国家安全局(National Security Agency)前工程师本·约翰逊(Ben Johnson)表示：“任何让你进入某人的浏览器、电子邮件或其他敏感区域的东西，都会成为国家间谍活动和有组织犯罪的目标。”本·约翰逊创立了安全公司Carbon Black和黑曜石安全公司(Obsidian Security)。\nGolomb说，这些扩展是为了避免被反病毒公司或评估网络域名声誉的安全软件检测到。\n研究人员发现，如果有人使用该浏览器在家用电脑上上网，它就会连接到一系列网站并传输信息。任何使用公司网络(包括安全服务)的人都不会传输敏感信息，甚至不会到达恶意版本的网站。\nGolomb说：“这表明攻击者可以使用极其简单的方法来隐藏，在这种情况下，隐藏数千个恶意域名。”\n所有有问题的域名，总共超过15,000个相互链接的域名，都是从以色列的一家小型注册商Galcomm购买的，正式名称为CommuniGal Communication Ltd。\n在一封电子邮件往来中，Galcomm的所有者Mohe Fogel告诉路透社，他的公司没有做错任何事情。\n福格尔写道：“Galcomm没有参与，也没有参与任何恶意活动。”“你可以说恰恰相反，我们与执法和安全机构合作，尽我们所能防止。”\n福格尔说，Golomb说他在4月份和5月份两次向公司的电子邮件地址报告虐待行为，没有查询的记录，他要求提供一份可疑域名的名单。路透社向他发送了这份名单三次，都没有得到实质性的回复。\n负责监督注册商的互联网名称与数字地址分配机构(Internet Corp For Assigned Names And Numbers)表示，多年来几乎没有收到有关Galcomm的投诉，也没有收到过关于恶意软件的投诉。\n虽然欺骗性的延期多年来一直是一个问题，但它们正在变得越来越糟糕。他们最初会投放不想要的广告，现在更有可能安装额外的恶意程序，或者追踪用户在哪里，以及他们在为政府或商业间谍做什么。\n恶意开发者将谷歌的Chrome Store用作渠道已有很长一段时间了。在十分之一的提交被认为是恶意的之后，谷歌在2018年表示，它将通过增加人工审查来提高安全性。\n但在2月份，独立研究员Jamila Kaya和思科系统的Duo Security在这里发现了一个类似的Chrome活动，从大约170万用户那里窃取了数据。谷歌加入了调查，发现了500个欺诈性扩展。\n谷歌的Westover说：“我们定期进行扫描，使用类似的技术、代码和行为来查找扩展。”他的语言与谷歌在Duo报告后发布的语言相同。", "note_en": "SAN FRANCISCO (Reuters) - A newly discovered spyware effort attacked users through 32 million downloads of extensions to Google’s market-leading Chrome web browser, researchers at Awake Security told Reuters, highlighting the tech industry’s failure to protect browsers as they are used more for email, payroll and other sensitive functions.\n Alphabet Inc’s (  GOOGL.O) Google said it removed more than 70 of the malicious add-ons from its official Chrome Web Store after being alerted by the researchers last month.\n “When we are alerted of extensions in the Web Store that violate our policies, we take action and use those incidents as training material to improve our automated and manual analyses,” Google spokesman Scott Westover told Reuters.\n Most of the free extensions purported to warn users about questionable websites or convert files from one format to another. Instead, they siphoned off browsing history and data that provided credentials for access to internal business tools.\n Based on the number of downloads, it was the most far-reaching malicious Chrome store campaign to date, according to Awake co-founder and chief scientist Gary Golomb.\n Google declined to discuss how the latest spyware compared with prior campaigns, the breadth of the damage, or why it did not detect and remove the bad extensions on its own despite past promises to supervise offerings more closely.\n It is unclear who was behind the effort to distribute the malware. Awake said the developers supplied fake contact information when they submitted the extensions to Google.\n “Anything that gets you into somebody’s browser or email or other sensitive areas would be a target for national espionage as well as organized crime,” said former National Security Agency engineer Ben Johnson, who founded security companies Carbon Black and Obsidian Security.\n The extensions were designed to avoid detection by antivirus companies or security software that evaluates the reputations of web domains, Golomb said.\n If someone used the browser to surf the web on a home computer, it would connect to a series of websites and transmit information, the researchers found. Anyone using a corporate network, which would include security services, would not transmit the sensitive information or even reach the malicious versions of the websites.\n “This shows how attackers can use extremely simple methods to hide, in this case, thousands of malicious domains,” Golomb said.\n All of the domains in question, more than 15,000 linked to each other in total, were purchased from a small registrar in Israel, Galcomm, known formally as CommuniGal Communication Ltd.\n  In an email exchange, Galcomm owner Moshe Fogel told Reuters that his company had done nothing wrong.\n “Galcomm is not involved, and not in complicity with any malicious activity whatsoever,” Fogel wrote. “You can say exactly the opposite, we cooperate with law enforcement and security bodies to prevent as much as we can.”\n Fogel said there was no record of the inquiries Golomb said he made in April and again in May to the company’s email address for reporting abusive behavior, and he asked for a list of suspect domains. Reuters sent him that list three times without getting a substantive response.\n The Internet Corp for Assigned Names and Numbers, which oversees registrars, said it had received few complaints about Galcomm over the years, and none about malware.\n While deceptive extensions have been a problem for years, they are getting worse. They initially spewed unwanted advertisements, and now are more likely to install additional malicious programs or track where users are and what they are doing for government or commercial spies.\n  Malicious developers have been using Google’s Chrome Store as a conduit for a long time. After one in 10 submissions was deemed malicious, Google said in 2018  here it would improve security, in part by increasing human review.\n But in February, independent researcher Jamila Kaya and Cisco Systems’ Duo Security uncovered  here a similar Chrome campaign that stole data from about 1.7 million users. Google joined the investigation and found 500 fraudulent extensions.\n “We do regular sweeps to find extensions using similar techniques, code and behaviors,” Google’s Westover said, in identical language to what Google gave out after Duo’s report.", "posttime": "2020-06-18 22:01:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,漏洞,chrome,spying", "title": "对谷歌Chrome用户的大规模间谍活动显示出新的安全漏洞", "title_en": "Massive Spying on Users of Google's Chrome Shows New Security Weakness", "transed": 1, "url": "https://www.reuters.com/article/us-alphabet-google-chrome-exclusive-idUSKBN23P0JO", "via": "", "real_tags": ["谷歌", "google", "漏洞", "chrome", "spying"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007089, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "水星计划在起飞时确实遇到了困难。1960年8月，在第一个水星-地图集在飞行中爆炸后，航空航天商业、导弹和火箭的主要期刊说：美国国家航空航天局(NASA)的水星载人卫星计划似乎正在使美国陷入东西方太空竞赛中的一场新的灾难。该计划比原计划推迟了一年多，预计将下滑到两年。在把第一个人送入轨道上，它不再给击败俄罗斯带来任何现实的希望，更不用说作为登月的早期垫脚石了。水星太空舱逃生系统的测试是在马里兰州和弗吉尼亚州边界下方的沃洛普斯岛站进行的。这是一个兰利测试设施，用来测试各种探空火箭或高空研究火箭。逃生系统的测试大约成功了50%。正当我们在好望角做准备的时候，11月8日，沃洛普斯的一次水星测试壮观地失败了。发射16秒后，逃逸和丢弃的火箭过早发射，导致太空舱附着在助推器火箭上，火箭到达10英里的顶峰，然后尖叫着返回地球，在撞击中摧毁了太空舱。水星计划使用了两枚助推器火箭--红石号和阿特拉斯号。两者都是军事系统的衍生品，但具有巨大的不同能力。红石是一枚陆军战场火箭。它将用于启动太空舱系统资格测试飞行，如果成功，还将用于两次弹道式载人飞行任务。弹道飞行任务大约需要20分钟的时间，最大高度约为130英里，在重返大气层之前提供了一段短暂的失重期。阿特拉斯是一枚空军洲际导弹，将同时用于弹道和轨道水星任务。前三次任务是弹道任务，继续助推器和胶囊均衡化，测试跟踪网络，并为MCC小组提供经验。轨道测试将在载人轨道飞行之前继续使用机械人和一只黑猩猩进行资格测试。当水星-阿特拉斯1号在飞行中爆炸时，我们的时间表落后了大约一年，所以很多人都乘坐了水星-红石的第一次飞行，MR-1。卡夫的团队于11月13日抵达，参加MR-1的发射，现在只有8天了。我的守护天使约翰逊又一次来救了我。在我们的模拟彩排中，他坐在控制台的右边，按下了对讲机的按钮。立刻，六个不同的对话充斥着我的耳机。它让我想起了当我在韩国指挥空袭地面目标期间，当事情升温时，战术频率上出现的凉爽、几乎随意但简洁而清晰的声音。当我听的时候，我听到了测试指挥的声音。约翰逊打开了几份厚厚的文件，并告诉卡夫倒计时的页面和顺序。幸运的是，这只是一次测试。这给了约翰逊一个机会向我简要介绍倒计时过程，了解在循环上交谈的人，以及水星控制在测试中所扮演的角色。每隔一段时间，约翰逊就鼓励我作为MCC程序控制员向卡夫或其他控制员提出建议。在整个测试过程中，他环顾了一下房间，并在脑海中记下了各种控制台位置的人应该做什么或以不同的方式做什么。我会定期打印出一条信息，并打电话给地面通信控制员。埃谢尔曼会冲进房间拿起信息，放在电传传输线上，然后带着一份传送的文本的确认副本冲回来。几个小时后，只要一切顺利，我就开始了伯爵的日常工作，感觉很舒服。我要参与的第一个任务是对红石助推器火箭和水星太空舱进行弹道测试。红石的引擎计划燃烧两分半钟。在助推器发动机关闭后，逃生塔通过发射塔环螺栓和点燃塔式逃生火箭与太空舱分离。然后在助推器推力衰减后，爆炸螺栓会发射，然后发射三枚小型波西格雷固体火箭，将太空舱与助推器分开。(波西格雷是指在飞行方向上增加速度的术语，在这种情况下是用来将水星舱与助推器分开的小型火箭。)。逆行火箭与飞行方向相反发射。)。雷石号把飞船推到130英里的高度，然后开始向下拉弧。在20000英尺的高空，太空舱的减速降落伞将展开，稳定其运动，并将其减速到足以让主降落伞安全展开。然后着陆序列就会开始。整个任务按计划只进行了一次。", "note_en": "Project Mercury was literally having trouble getting off the ground. In Augustof 1960, after the first Mercury-Atlas exploded in flight, the major journal inthe aerospace business,  Missiles and Rockets, stated: &#34;NASA&#39;s Mercurymanned satellite program appears to be plummeting the United States toward a newhumiliating disaster in the East-West space race. The program is more than oneyear behind the original schedule and is expected to slip to two. It no longeroffers any realistic hope of beating Russia in launching the first man intoorbit, much less to serve as an early stepping-stone for reaching the Moon.&#34; The testing of the Mercury capsule escape system was carried out at the WallopsIsland Station just below the Maryland-Virginia border. This was a Langley testfacility for all sorts of &#34;sounding,&#34; or high-altitude research rockets. Thetests of the escape system were about 50 percent successful. While we weregetting ready at the Cape, one of the Mercury tests at Wallops failedspectacularly on November 8. Sixteen seconds after launch the escape andjettison rockets fired prematurely, thus leaving the capsule attached to thebooster rocket, which reached a ten-mile apex and then came screaming back toEarth, destroying the capsule at impact. The Mercury program used two booster rockets — the Redstone and the Atlas. Bothwere derivatives of military systems but with vastly different capabilities. TheRedstone was an Army battlefield rocket. It would be used to start the capsulesystems qualification test flight and, if that was successful, for two ballisticmanned missions. The ballistic missions were to be about twenty minutes induration, reaching a maximum altitude of about 130 miles and providing a shortweightless period before reentry. The Atlas was an Air Force intercontinentalmissile and was to be used for both ballistic and orbital Mercury missions. Thefirst three missions were ballistic, to continue the booster and capsulequalification, test the tracking network, and provide experience for the MCCteam. The orbital testing would continue the qualification testing using themechanical man and a chimpanzee before the manned orbital flights. When Mercury-Atlas 1 exploded in flight, we fell about one year behind in theschedule, so a lot was riding on the first Mercury-Redstone flight, MR-1.Kraft&#39;s team arrived on November 13 for the MR-1 launch, now only eight daysaway. Once again my guardian angel, Johnson, arrived to save my bacon. He took aplace to the right of the console and punched up the buttons of the intercomduring our simulation dress rehearsal. Immediately, a half dozen different conversations flooded through my headset. Itreminded me of the cool, almost casual but terse and clear voice chatter thatcame up on the tactical frequency when things heated up during the time I was inKorea directing air strikes on ground targets. As I listened, I picked up thevoices of the test conductors. Johnson broke out some thick documents andadvised Kraft of the page and sequence of the countdown. It was fortunate thatthis was just a test. It gave Johnson a chance to brief me on the countdownprocess, get to know the people talking on the loops and Mercury Control&#39;s rolein the test. At intervals, Johnson encouraged me as the MCC procedures controller to makesuggestions to Kraft or one of the other controllers. Throughout the test, heglanced around the room and made mental notes about what people at the variousconsole positions should be doing or doing in a different way. Periodically, Iwould print out a message and call the ground communications controller.Eshelman would rush into the room to pick up the message, put it on the Teletypeline, and then rush back with a confirming copy of the transmitted text. Afterseveral hours, I picked up the routine of the count and felt comfortable, aslong as all was going well. This first mission in which I would play a role was a ballistic test of aRedstone booster rocket and a Mercury capsule. The Redstone&#39;s engine wasscheduled to burn for two and one half minutes. After the booster engine cutoff, the escape tower separated from the capsule by firing the tower ringattachment bolts and igniting the tower escape rocket. Then after the boosterthrust had decayed, explosive bolts would fire, followed by the firing of threesmall posigrade solid rockets, to separate the capsule from the booster.(&#34;Posigrade&#34; is the term used for adding velocity in the direction of flight, inthis instance the small rockets used to separate the Mercury capsule from thebooster. Retrograde rockets fire opposite to the direction of flight.) TheRedstone boosted the spacecraft to an altitude of 130 miles before it started toarc downward. At 20,000 feet, the capsule&#39;s drogue parachutes would deploy, stabilize itsmotion, and slow it down sufficiently to allow the main parachutes to deploysafely. Then the landing sequence would begin. The entire mission was planned tolast only sixteen minutes. After the countdown simulation test we began trainingfor the brief actual flight of the Redstone. For three days we rehearsed,calling out events and issuing backup commands to the automatic sequences. During the simulation run-through our instructors sat watching us from theirvantage point at the top row of the consoles and played magnetic tapes into thetelemetry and radar systems, which in turn drove the controller&#39;s meters andplot board displays. If all else failed, we would be handed a written question,like a pop quiz in school. You had to stand up in front of the entire MissionControl Center team and say, &#34;Flight! A new problem has shown up and this iswhat I am going to do about it.&#34; You took it seriously. God help you if youcouldn&#39;t come up with an answer — instantly. The launch complex from which we would fire the Redstone consisted of the launchpad, service tower, and a blockhouse for launch site command and control.Servicing the pad was a network of power and communications cables, and pipescarrying fuel and other fluids. The blockhouses were igloolike structures thatsat about 230 meters from the pad and looked somewhat like squat World War IIpillboxes. Atlas blockhouses were a bit different — twelve-sided concretebunkers with walls three meters thick and domed tops, embedded in thirteenmeters of sand. Earlier blockhouses used a viewing slit with a thickquartz/glass window. Later on periscopes were added; they afforded a view ofsuch things as the fuel tanks and cable trenches. The blockhouses had to beclose enough for direct viewing and far enough from the booster to survive anexplosion. (Five percent of the early boosters exploded shortly after liftoff.) The blockhouse team was a mixture of German rocket scientists, former Armytechnicians, and booster contractors. The Germans were most often found talkingin their native language, huddled over their displays and praying for things togo right. In addition to von Braun&#39;s colleagues, the blockhouse capsuleengineers were drawn from a broad talent pool, mostly from aircraft (soon to becalled aerospace) contractors. Kraft&#39;s team was made up of engineers who camefrom all sorts of backgrounds, put together like a pickup softball team. Thecapsule engineers came from the NASA Space Task Group, network controllers fromthe Air Force, facility technicians from Bendix, and the Mercury Control CenterCapComs from the initial group of seven astronauts. Three-man operations teamswere deployed to the thirteen Project Mercury manned tracking stations toprovide global tracking, data, and voice communications data coverage. Theleader of the three-man team was the CapCom, and he was responsible for sitemission readiness, real-time mission support, and status reporting to theMercury Control flight director. During the manned missions he provided thecommunications with the astronaut in the capsule, hence the term &#34;CapCom.&#34; The teams at the thirteen manned tracking stations were provided by Kraft&#39;soperations organization. With high-risk time-critical decisions, the astronautcorps believed that only astronauts should talk to the astronaut in the capsule.In the Mercury Control Center and at the blockhouse, CapComs were selected fromthe Mercury astronauts and they were often sent to tracking stations designatedas mission critical. During this period, the American space program drew on some military resourcesas well as those of NASA. By contrast, the Russian program was part of theirmilitary. Soviet hardware, software, and personnel were military, albeit withsome modification — spacecraft instead of warheads sitting on top of boostersthat, like our Atlas, originated in military programs developed for strategicwarfare. Over time the Russian effort would become somewhat more civilian innature, but from inception, NASA&#39;s operations would be separated by a kind offirewall from military operations and personnel. In the first decades of the race into space the Russians enjoyed the advantagesof running a program powered by the virtually unrestricted resources and fundingof a military that, in a command economy, came first in economic priority. Wewere on a somewhat more modest footing in the early days. That would changedramatically thanks to President John F. Kennedy and Vice President Johnsonpushing for the funding and resources that would enable an explicitly civilianspace program to succeed. In Mercury Control the only controllers reporting administratively to ChrisKraft were the trajectory operators, Tecwyn (Tec) Roberts, and Carl Huss, whom Ihad yet to meet; Howard Kyle, who doubled for Kraft at the flight directorconsole; Paul Johnson; and myself. The capsule engineers assigned to work withthe MCC team understandably focused on hardware rather than flight operationsand had their hands full checking out the spacecraft in Hangar S, and theylooked at training in the Mercury Control Center as a waste of their time. Thecore of the engineering staff was based at Space Task Group headquarters atLangley Research Center. When McDonnell Aircraft sent a capsule to the Cape theengineers would come down and check it out in Hangar S. Despite a certain amount of confusion about who should be doing what, since wewere inventing it all as we went along, we were moving quickly to the crunchpoint. To my dismay, two days before launch at the readiness review, Johnsontook me aside and said he would not be there. He had to go to the Canary Islandsto work out a tracking site problem. He wished me good luck. November 21, 1960, Mercury-Redstone 1 Only one month and four days after I was hired, I was at the procedures console.Thanks to Johnson&#39;s unflagging coaching and the training we had done, I had noproblems and felt comfortable with the mechanics. But I had a long way to gobefore I would have that sense of &#34;being ahead of the airplane&#34; or &#34;ahead of thepower curve&#34; as pilots put it — having the experience to anticipate what could happen rather than just reacting to what was happening at themoment. As the countdown proceeded, I noticed a change in the intensity of theatmosphere in the control room. I had felt that before when I signed off myaircraft — accepted it as ready for flight — at Holloman. Although the job wasdifferent, the emotional content was the same. Controllers were going throughthe same gut churning as we had had prior to a B-52 test flight. During a holdin the countdown to fix a leak in the Redstone&#39;s hydrogen peroxide system thatfueled the control thrusters, Kraft turned to me and said, &#34;How about getting mea couple of cartons of milk from the roach coach?&#34; (Mercury Control, like allthe other Cape facilities, was out in a vast palmetto swamp, about half a mileoff the main road. A lunch wagon, known as the roach coach, pulled by a pickuptruck, made its rounds to the test stands, camera trackers, and other stations.The loudspeakers would announce its arrival when it stopped at Mercury Controlthree times each day. The menu was pretty limited — but it did offer milk.) Forthe first time I realized that behind Kraft&#39;s calm exterior he had the samesensations I felt — of squirrels running around in my stomach — as weapproached launch. The launch countdown progressed without any major incident. As liftoffapproached, I leaned back and peered at the video image on Kraft&#39;s consolecoming from a camera focused on the Redstone standing on the launch pad.Precisely at zero on the clock, there was a great cloud of smoke. Kraft lookedstartled, and then he leaned forward intently. The TV cameraman momentarily losttrack as he panned the camera upward, and, for a few seconds, there was nothingon the screen but a smoky sky. From my position, it looked much like the rocketsI had launched from aircraft. I was surprised at how quickly the Redstone hadaccelerated and moved out of sight. Then after a few seconds the camera panned down. Although smoke still obscuredthe launch pad, the vague outline of the Redstone was still there. Kraft&#39;s facewas incredulous. He stammered for a few seconds, then called out, &#34;Booster, whatthe hell happened?&#34; Our booster engineer in the control room came from the Marshall Redstone team.After liftoff he was responsible for reporting booster status — engine andguidance — to Kraft&#39;s team. If something was wrong he was supposed to give us aheads-up so the trajectory people in Mercury Control could better assess whatthey were seeing on their radar plot boards. Now he reverted to his nativeGerman as he tried to figure out what happened and, more importantly, what theblockhouse team should do about it. All hell broke loose. The Redstone hadlifted a few inches off the launch pad and then the engine shut down. By somemiracle, the rocket had landed back on the launcher cradle. When the escape tower cut loose, unguided and spewing flame, it corkscrewed toan altitude of about 4,000 feet. As it plummeted back to Earth, loudspeakersaround the facility blared out warnings to the astronauts, engineers, and VIPsin the viewing area to take cover. The escape tower ultimately landed some 1,200feet from the launch pad. The launch team in the blockhouse was as stunned as Mercury Control. Boostercontinued talking in German to his counterparts in the blockhouse, oblivious toKraft&#39;s repeated calls. Television cameras showed the events on the pad as themain and reserve landing parachutes popped out of their stowage compartment atthe nose of the capsule, ejected upward and partially opened up. Initially, theyhung limply, then they slowly inflated and caught the sea breeze. At the sametime strips of tinfoil were ejected from the capsule and spilled over the sidesof the booster and capsule. (The strips, or chaff, were used to help radar trackthe capsule as it was slowed down by the parachute and headed for splashdown, orwater landing, in the Atlantic Ocean.) Every controller held his breath, afraidthe parachute would topple the rocket and cause an explosion. The intercom that had been quiet was now busily filled with directions,observations, and opinions. Everything that happened, although it had taken onlyseconds, passed before me in slow motion. Then it finally clicked.  We hadlaunched the escape tower. The Redstone rocket, surrounded by smoke, was armed and fueled but still sittingon the launch pad. Kraft told everyone to calm down, but Booster was still onthe hot line, interrogating the blockhouse in German. We all could see the angerglowing in Kraft&#39;s eyes as he walked over and yanked Booster&#39;s headset cordloose from the console, saying, &#34;Speak to  me, dammit!&#34; Chaos continued for several minutes until Booster, in halting English, told usthat the Redstone engines had fired and the rocket had lifted off the pad enoughto drop the umbilical, the bundle of cables that connected launch control withthe booster and that normally fell away right after liftoff. Then the engineinexplicably shut down. The Mercury capsule, sensing the booster&#39;s engineshutdown, acted as if it were in orbit and sent the command to jettison theescape tower. The capsule, not sensing any further acceleration, acted as if itwere in the recovery phase and so deployed the parachutes. We now had a liverocket on the pad, a fully pressurized Redstone; and, since the umbilicals haddisconnected, we had no control of it. The booster&#39;s destruct system was armedand there was no way to secure the system. No one had any idea what to do next. Kraft walked over to me, eyes blazing. Pointing at Booster he snapped, &#34;The damnGermans still haven&#39;t learned who they work for. Everyone in this control roommust work for me.&#34; We sat stunned, helpless in Mercury Control. We had notechnical data on the spacecraft or the launch system beyond a simple manual,the equivalent of an owner&#39;s manual for a new car. All of us were still thinkingin aircraft, not rocket, terms — and we were definitely behind the power curve.We had no data to work with because we weren&#39;t smart enough to know what wereally needed. We were dealing with a  new control room, a  newnetwork,  new procedures, and entirely  new jobs, doing somethingthat we had never done before, something almost alien to our nature. A tentative proposal came from the blockhouse to reconnect the umbilical. Thechances of people getting killed doing this were discussed and we decided thatit could not be done safely. The next, and equally desperate, suggestion was toget a cherry picker (a kind of crane or boom with a man-holding bucket on theend of it, like those used by telephone and utility line repair crews) and cutthe nylon parachute risers. This would at least eliminate the threat of windfilling the parachute and toppling the Redstone, but this idea was alsodiscarded because of the risk to personnel. All the while we were apprehensivelywatching a partially inflated parachute and praying that the sea breeze did notpick up, fill the parachute, and topple the whole damn rocket over. After impatiently listening to a pretty far-out proposal to depressurize therocket by using a rifle to shoot holes in the fuel and oxidizer tanks, Kraftsputtered and growled, &#34;Dammit, that&#39;s no way to do it! They sound like a bunchthat just started spring training!&#34; Even to a rookie like me, shooting a hole inthe tanks did not seem to be a sound plan. Kraft listened intently as each of the crazy schemes came across the loops,everybody desperately searching for a way out. Then one of the test conductorscame up with a plan that made sense. &#34;The winds are forecast to remain calm, soif we wait until tomorrow morning, the batteries will deplete, the relays andvalves will go to the normally open condition. As the oxidizer warms up, thetank vents will open, removing the flight pressure. With the boosterdepressurized and batteries depleted, it will then be safe to approach therocket.&#34; Kraft nodded and growled at his controllers, &#34;That is the first rule of flightcontrol. If you don&#39;t know what to do,  don&#39;t do anything!&#34; We securedMercury Control and the blockhouse gang got saddled with the unenviable job ofnervously watching over the Redstone throughout the night. &#34;Doing nothing&#34;worked: by early the next morning, the batteries were depleted, the destructsystem disarmed, and the pressure relieved. The capsule and the Redstone rockethad survived with only minor damages to the tail fins. This fiasco was the most embarrassing episode yet for the young engineers of theMercury program. The history books call this mission, sardonically butaccurately, &#34;The Four-Inch Flight.&#34; While the badly shaken booster engineersfrantically worked on finding out just what had happened, I promised myself thatwhen I returned to Langley I would use the same technique that had worked for meflying airplanes or flight-testing at Holloman. I would get to know as manytechnici\n......", "posttime": "2020-06-18 22:00:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "英寸,option,测试", "title": "失败不是一种选择：四英寸飞行(2000)", "title_en": "Failure Is Not an Option: The Four-Inch Flight (2000)", "transed": 1, "url": "http://movies2.nytimes.com/books/first/k/kranz-failure.html", "via": "", "real_tags": ["英寸", "option", "测试"]}, {"category": "", "categoryclass": "", "imagename": "f896a4d2abbff1254dcbb00bd8fca1b4.png", "infoid": 1007088, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一个重大的180度大转弯中，英国放弃了现有冠状病毒追踪应用程序的基础，转而采用基于苹果和谷歌提供的技术的模式。\n此前一天，英国广播公司(BBC)透露，苹果前高管西蒙·汤普森(Simon Thompson)将负责这个运行时间较晚的项目。\n还有一个问题是，是否有任何依赖蓝牙信号的基于智能手机的系统将足够准确，从而能够发挥作用。\n英国追随德国、意大利和丹麦等国的脚步，从所谓的集中式方式转变为分散式方式。\n当两个人靠得很近很长一段时间时，他们的工作方式是伐木。\n如果其中一个用户后来被诊断出患有这种疾病，可以向他们最近亲近的其他人发送警报，告诉他们也应该接受检测和/或自我隔离。\n苹果-谷歌模式本身在手机上执行这一过程，使得当局或潜在的黑客更难将记录去匿名化并将其用于其他手段。\n这种切换的一个优点是，国民医疗服务系统的新冠肺炎应用程序将能够克服iPhone的限制，并在软件关闭时进行蓝牙握手。\n另一个原因是，这款应用应该更容易与基于相同系统的其他国家(包括爱尔兰共和国和德国)兼容。\n本周早些时候，欧盟委员会(European Commission)表示，采用了集中化APP的法国将在这方面面临挑战。", "note_en": "In a major U-turn, the UK is abandoning the underpinnings of its existing coronavirus-tracing app and switching to a model based on technology provided by Apple and Google.\n The move comes the day after the BBC revealed that a former Apple executive, Simon Thompson, was taking charge of the late-running project.\n   And questions remain about whether any smartphone-based system reliant on Bluetooth signals will be accurate enough to be useful.\n  The UK follows Germany, Italy and Denmark among others in switching from a so-called &#34;centralised&#34; approach to a &#34;decentralised&#34; one.\n     They work by logging when two people have been in close proximity to each other for a substantial period of time.\n If one of the users is later diagnosed as having the disease, an alert can be sent to others they have recently been close to, telling them that they should also get tested and/or self-isolate.\n  The Apple-Google model carries the process out on the handsets themselves, making it more difficult for the authorities or potentially hackers to de-anonymise the records and use them for other means.\n One advantage of the switch is that the NHS Covid-19 app will be able overcome a limitation of iPhones and carry out Bluetooth &#34;handshakes&#34; when the software is closed.\n Another is that it should be easier to make the app compatible with other countries&#39; counterparts, which are based on the same system - including the Republic of Ireland and Germany.\n Earlier in the week, the European Commission said that France - which had adopted a centralised app - would face challenges in this regard.", "posttime": "2020-06-18 20:49:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,谷歌,苹果,病毒,google", "title": "英国病毒跟踪应用程序切换到谷歌-苹果模式", "title_en": "UK virus-tracing app switches to Google-Apple model", "transed": 1, "url": "https://www.bbc.co.uk/news/technology-53095336", "via": "", "real_tags": ["程序", "谷歌", "苹果", "病毒", "google"]}, {"category": "", "categoryclass": "", "imagename": "b4e5a577090dfe38cddaf6187440174e.jpg", "infoid": 1007087, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据路透社报道，昨天，在美国财政部长史蒂文·姆努钦退出谈判后，欧盟和美国关于数字服务税的谈判破裂，称谈判没有取得任何进展。\n欧盟一直在考虑对平台巨头的当地收入征收2%至6%的税。\n今天，欧盟委员会(European Commission)对美国的举动做出了回应，专员保罗·真蒂洛尼(Paolo Gentiloni)重申了“一种数字税”的必要性，以适应他所称的“新世纪的现实”，并呼吁在全球谈判中“理解”。\n然而，他也重申了欧盟委员会的警告，即如有必要，它将单独推进。他表示，如果美国退出谈判的决定意味着不可能达成全球共识，它将把“一项新的欧洲提案摆在桌面上”。\nC‘èBisogno di una#DigitalTax adeguata alla realtàdel Nuovo Secolo。为Un‘intesa Nel Negoziato Globale服务。So lo Stop americano la rendesse impossible，la@EU_Commission metteràsul Tavolo una Nuova proposta Europe.。\n谈判破裂后，法国还警告称，今年将继续对科技巨头征收数字税-扭转了早些时候旨在推动谈判的暂停。\n“纽约时报”报道，法国财政部长布鲁诺·勒梅尔(Bruno Le Maire)将美国的退出描述为“一种挑衅”，并抱怨法国“有系统地以制裁威胁”盟友。\n多年来，平台的“公平税收”问题在欧洲一直进展缓慢，政界人士公开质问科技高管，指责他们为国库贡献的资金太少，甚至敦促公众抵制亚马逊(Amazon)等服务(收效甚微)。\n更新税收体系以对数字巨头进行核算也是乌苏拉·冯德莱恩(Ursula Von Der Leyen)领导的委员会的前沿和核心问题-该委员会正在回应该地区普遍存在的愤怒情绪，即科技巨头缴纳的税款相对于它们创造的地方收入来说太少了。\n去年年底上任的欧盟委员会(European Commission)主席冯德莱恩(Von Der Leyen)曾表示，需要对税收制度进行“紧急”改革-她在2020年初警告称，如果到今年年底无法达成全球协议，欧盟(EU)将准备在“公平的数字税”方面单打独斗。\n与此同时，一些欧洲国家一直在推进自己的提案，对大型科技公司征税-包括英国和法国，英国从4月份开始对当地收入征收2%的数字服务税；法国已经制定了一项计划，对科技巨头的当地收入征收3%的税。\n这给了欧盟委员会另一个采取行动的明确理由，因为它存在的理由是减少欧盟单一市场的碎片化。\n尽管它在成员国之间达成协议方面面临内部挑战，但鉴于一些较小的经济体使用较低的国家公司税率来吸引外来投资，包括来自科技巨头的投资，它面临着内部挑战。\n与此同时，在欧洲各国政府采取行动制定自己的平台税时，美国并没有袖手旁观。特朗普政府一直在四处施压-辩称美国公司正不公平地成为税收的目标，并警告称，它可能会对继续征税的国家征收高达100%的关税进行报复。尽管它还没有这样做。\n在数字税制改革问题上，美国曾表示，它希望通过经合组织(OECD)达成一项全球最低限度的多边协议。去年夏天，法国和美国达成了一项微不足道的协议，当时法国总统伊曼纽尔·马克龙(Emmanuel Kavanaugh)同意，一旦经合组织拿出全球解决方案，法国的科技税将被取消。\n然而，随着特朗普的谈判代表退出与欧盟的国际税收谈判，在这个分歧很大的问题上达成全球谅解的前景看起来比以往任何时候都更加遥远。\n尽管英国今天表示，它仍然致力于全球解决方案，据路透社援引财政部发言人的话说。\n本月早些时候，美国还对欧盟新的或拟议的数字税启动了正式调查，包括英国的征税和欧盟的提议，以及其他一些欧盟国家制定的计划，声称它们“不公平地针对”美国科技公司-排队对改革计划发起新的攻击。", "note_en": "Yesterday talks between the EU and the US on a digital services tax broke down after U.S. treasury secretary, Steven Mnuchin, walked out — saying they’d failed to make any progress, per  Reuters.\n The EU has been eyeing  levying a tax of between 2% and 6% on the local revenues of platform giants.\n  Today the European Commission dug in in response to the US move, with commissioner Paolo Gentiloni reiterating the need for “one digital tax” to adapt to what he dubbed “the reality of the new century” — and calling for “understanding” in the global negotiation.\n However he also repeated the Commission’s warning that it will push ahead alone if necessary, saying that if the US’ decision to quit talks means achieving global consensus impossible it will put “a new European proposal on the table”.\n C’è bisogno di una  #DigitalTax adeguata alla realtà del nuovo secolo. Serve un’intesa nel negoziato globale. Se lo stop americano la rendesse impossibile, la  @EU_Commission metterà sul tavolo una nuova proposta europea.\n Following the break down of talks, France also warned it will go ahead with a digital tax on tech giants this year — reversing an earlier suspension that had been intended to grease the negotiations.\n The  New York Times reports French finance minister, Bruno Le Maire, describing the US walk-out as “a provocation”, and complaining about the country “systematically threatening” allies with sanctions.\n The issue of ‘fair taxes’ for platforms has been slow burning in Europe for years, with politicians grilling tech execs in public over how little they contribute to national coffers and even  urging the public to boycott services like Amazon (with little success).\n Updating the tax system to account for digital giants is also front and center for  Ursula von der Leyen’s Commission — which is responding to the widespread regional public anger over how little tech giants pay in relation to the local revenue they generate.\n European Commission president von der Leyen, who took up her mandate at the back end of last year, has said “urgent” reform of the tax system is needed — warning at the start of 2020 that the  European Union   would be prepared to go it alone on “a fair digital tax” if no global accord was reached by the end of this year.\n At the same time, a number of European countries have been pushing ahead with their own proposals to tax big tech — including the UK, which started  levying a 2% digital services tax on local revenue in April; and France, which has set out a plan to  tax tech giants 3% of their local revenues.\n This gives the Commission another clear reason to act, given its  raison d’être is to reduce fragmentation of the EU’s Single Market.\n Although it faces internal challenges on achieving agreement across Member States, given some smaller economies have used low national corporate tax rates to attract inward investment, including from tech giants.\n The US, meanwhile, has not been sitting on its hands as European governments move ahead to set their own platform taxes. The Trump administration has been throwing its weight around — arguing US companies are being unfairly targeted by the taxes and warning that it could  retaliate with up to 100% tariffs on countries that go ahead. Though it has yet to do so.\n On the digital tax reform issue the US has said it wants a multilateral agreement via the OECD on a  global minimum. And a petite  entente cordiale was reached between France and the US  last summer when president Emmanuel Macron agreed the French tech tax would be scraped once the OECD came up with a global fix.\n However with Trump’s negotiators pulling out of international tax talks with the EU the prospect of a global understanding on a very divisive issue looks further away than ever.\n Though the UK said today it remains committed to a global solution, per  Reuters which quotes a treasury spokesman.\n Earlier this month the US also launched a formal investigation into new or proposed digital taxes in the EU, including the UK’s levy and the EU’s proposal, and plans set out by a number of other EU countries, claiming they “unfairly target” U.S. tech companies — lining up a pipeline of fresh attacks on reform plans.", "posttime": "2020-06-18 20:49:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "退出,digs,美国", "title": "美国退出谈判后，欧盟深入研究数字税收计划", "title_en": "EU digs in on digital tax plan, after US quits talks", "transed": 1, "url": "https://techcrunch.com/2020/06/18/eu-digs-in-on-digital-tax-plan-after-us-quits-talks/", "via": "", "real_tags": ["退出", "digs", "美国"]}, {"category": "", "categoryclass": "", "imagename": "5ec1afea6967826a7efff71898190b56.png", "infoid": 1007086, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "又是一个漫长的夜晚。我正在用C语言编写我完美的、没有bug的程序，这时可预见的事情发生了：\n哦，好吧..。也许改天晚上我会更幸运地接管这个世界。但后来我突然想到。我的程序收到SIGSEGV信号并崩溃，并显示分段故障消息。这句话是从哪里来的？\n我看错了吗？是否有分段保险库？#34；？还是Linux的作者犯了一个错误？这个信号不应该被命名为SIGSEGF吗？\n我问我的同事，大卫·拉格很快告诉我，信号名称代表分段违规。我想这是有道理的。很久很久以前，计算机通常有内存分段。每个内存段都定义了长度-称为段限制。访问超过此限制的数据导致处理器故障。此错误代码被使用分页的较新系统重新使用。我认为英特尔手册称之为此错误&#34；无效页面错误&#34；。当它被触发时，它会作为SIGSEGV信号报告给用户空间。故事结束了。\nMartin Levy向我指出了关于Signal&#34；的一个古老的第6版UNIX文档。这是从1978年开始的：\nUNIX树的用户空间部分(即/usr/include/signal.h)似乎很早就切换到了SIGSEGV。但是内核内部继续使用名称SIGSEG的时间要长得多。\n更深入地观察，David发现PDP11陷阱向量使用了分段违规的措辞。这在UNIX历史记录库中的Research V4版中有所体现，但这并不意味着它是在V4中引入的，因为V4是第一个代码仍然可用的版本。\n文件/usr/include/signal.h出现在Research V7的树中，名称为SIGSEGV。但内核当时仍称其为SIGSEG。\n这就是你要的。最初，这个信号被称为SIGSEG。它随后在用户空间被重命名为SIGSEGV，稍晚一点-大约在1980年-在内核端被重命名为SIGSEGV。显然，在UNIX系统上仍然没有找到分段保管库。\n至于我最初的崩溃，我当然是通过捕捉信号并跳过令人不快的指令来修复它。在Linux上，完全可以捕获和处理SIGSEGV。有了这个修复，我的代码再也不会崩溃了。当然了。\n#DEFINE_GNU_SOURCE#include&lt；signal.h&gt；#include&lt；stdio.h&gt；#include&lt；ucontext.h&gt；static void sighandler(int signo，siginfo_t*si，void*v_context){ucontext_t*context=v_context；context-&gt；uc_mcontext.gregs[REG_RIP]+=10；}int*Total_NULL_POINTER=。printf(&#34；在NULL指针取消引用之前\\n&#34；)；*TOTAL_NULL_POINTER=1；__ASM__volatile__(&#34；nop；&#34；)；printf(&#34；在NULL指针之后。仍然在这里！\\n&#34；)；返回0；}", "note_en": "Another long night. I was working on my perfect, bug-free program in C, when the predictable thing happened:\n  Oh, well... Maybe I&#39;ll be more lucky taking over the world another night. But then it struck me. My program received a SIGSEGV signal and crashed with &#34;Segmentation Fault&#34; message. Where does the &#34;V&#34; come from?\n Did I read it wrong? Was there a &#34;Segmentation  Vault?&#34;? Or did Linux authors make a mistake? Shouldn&#39;t the signal be named SIGSEGF?\n I asked my colleagues and  David Wragg quickly told me that the signal name stands for &#34;Segmentation Violation&#34;. I guess that makes sense. Long long time ago, computers used to have  memory segmentation. Each memory segment had defined length - called Segment Limit. Accessing data over this limit caused a processor fault. This error code got re-used  by newer systems that used paging. I think the Intel manuals call this error  &#34;Invalid Page Fault&#34;. When it&#39;s triggered it gets reported to the userspace as a SIGSEGV signal. End of story.\n  Martin Levy pointed me to an ancient  Version 6th UNIX documentation on &#34;signal&#34;. This is from around 1978:\n   It seems that userspace parts of the UNIX tree (i.e. /usr/include/signal.h) switched to SIGSEGV fairly early on. But the kernel internals continued to use the name SIGSEG for much longer.\n Looking deeper David found that PDP11 trap vector used wording  &#34;segmentation violation&#34;. This shows up in Research V4 Edition in the UNIX history repo, but it doesn&#39;t mean it was introduced in V4 - it&#39;s just because V4 is the first version with code still available.\n  The file /usr/include/signal.h appears in the tree for Research V7,  with the name SIGSEGV. But the kernel  still called it SIGSEG at the time\n  Here you go. Originally the signal was called SIGSEG. It was subsequently renamed SIGSEGV in the userspace and a bit later - around 1980 - to SIGSEGV on the kernel side. Apparently there are still no Segmentation Vaults found on UNIX systems.\n As for my original crash, I fixed it - of course - by catching the signal and jumping over the offending instruction. On Linux it is totally possible to catch and handle SIGSEGV. With that fix, my code will never again crash. For sure.\n #define _GNU_SOURCE#include &lt;signal.h&gt;#include &lt;stdio.h&gt;#include &lt;ucontext.h&gt;static void sighandler(int signo, siginfo_t *si, void* v_context){ ucontext_t *context = v_context; context-&gt;uc_mcontext.gregs[REG_RIP] += 10;}int *totally_null_pointer = NULL;int main() { struct sigaction psa; psa.sa_sigaction = sighandler; sigaction(SIGSEGV, &amp;psa, NULL); printf(&#34;Before NULL pointer dereference\\n&#34;); *totally_null_pointer = 1; __asm__ __volatile__(&#34;nop;nop;nop;nop;nop;nop;nop;nop;nop;nop;&#34;); printf(&#34;After NULL pointer. Still here!\\n&#34;); return 0;}", "posttime": "2020-06-18 20:31:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "分段,segmentation", "title": "为什么SIGSEGV分段故障中有一个“V”？", "title_en": "Why is there a “V” in SIGSEGV Segmentation Fault?", "transed": 1, "url": "https://blog.cloudflare.com/why-is-there-a-v-in-sigsegv-segmentation-fault/", "via": "", "real_tags": ["分段"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007085, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "选择购买试用订阅港币10元，试用期4周，试用结束后每月收费港币495.00元。\n4周内可无限制享受英国“金融时报”值得信赖、屡获殊荣的商业新闻的无限量高级数字访问。\n礼品-每月与家人、朋友和同事分享多达10篇文章", "note_en": "Select  Purchase a Trial subscription for HK$10.00 for 4 weeks   You will be billed HK$495.00 per month after the trial ends\n  For 4 weeks receive unlimited Premium digital access to the FT&#39;s trusted, award-winning business news\n  Gift Article – share up to 10 articles a month with family, friends and colleagues", "posttime": "2020-06-18 20:30:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "现金,cash,试用", "title": "Wirecard称19亿欧元现金失踪", "title_en": "Wirecard says €1.9bn of cash is missing", "transed": 1, "url": "https://www.ft.com/content/1e753e2b-f576-4f32-aa19-d240be26e773", "via": "", "real_tags": ["现金", "cash", "试用"]}, {"category": "", "categoryclass": "", "imagename": "dc3dcc25bb886454028af235636c8e16.jpeg", "infoid": 1007084, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Basecamp首席技术官David Heinemeier Hansson在苹果年度开发者大会召开前几天，在欧盟委员会(European Commission)对苹果和App Store展开反垄断调查的消息传出之际，在苹果拒绝更新Basecamp的新电子邮件应用程序后，Basecamp的推文和随之而来的争议浮出水面，引发了公众对苹果的猛烈批评。\n正在讨论的应用程序是嘿，这是一款避开传统，为特定类型的用户提供更好体验的电子邮件工具。它要求用户每年支付99美元的订阅费才能使用其功能和服务，但提供免费试用期。\n就在本周，1.0版本刚刚获准在App Store上发布，但当Basecamp试图发布带有错误修复的1.0.1更新时，它受到了苹果的密切关注。随着事件的展开，来自苹果的电话和电子邮件表明，嘿必须采取措施，通过苹果自己的计费系统和应用内支付平台提供订阅服务。否则，该应用程序将从商店中退市。\n根据汉森的说法，苹果公司告诉Basecamp，嘿违反了App Store审查指南中的3.1.1条规则。以下是苹果在这些指南中使用的语言：\n如果您要解锁应用程序内的特性或功能(例如：订阅、游戏内货币、游戏级别、访问高级内容或解锁完整版本)，则必须使用应用内购买。应用程序不能使用自己的机制来解锁内容或功能，如许可证密钥、增强现实标记、二维码等。应用程序及其元数据可能不包括按钮、外部链接或将客户引导到应用内购买以外的购买机制的其他行动呼吁。\n但乍一看，嘿并没有违反这一规则。它不允许用户在该应用程序内订阅。取而代之的是，用户必须登录嘿的网站才能通过Basecamp自己的付费方式注册-就像Spotify或Netflix等许多其他流行的应用程序一样。根据苹果的指导方针，嘿没有链接或行动号召将用户引导到该网站。\n这是嘿团队困惑的一个原因，这是可以理解的。同样令人困惑的是：1.0.1更新被拒绝了，但1.0版本没有被拒绝，尽管更新没有改变与这个问题相关的任何东西。\n尽管这条推文开启了这场对话，但大部分内容都出现在大卫·皮尔斯的一篇后续文章中，这篇文章包含或引用了汉森和苹果的声明。这份报告充实了细节；看起来苹果公司也在坚持一套规则，这些规则并不包括在公共指导方针中。\n苹果告诉我，它的实际错误是一开始就批准了这款应用，当时它不符合它的指导方针。苹果允许这类客户端应用--你不能注册，只能登录--用于商业服务，但不能用于消费产品。这就是为什么公司通常付费的Basecamp在App Store上被允许使用，而用户付费的嘿则不被允许。\n另一个区别是：苹果允许“阅读器”应用程序 - netflix、kindle和dropbox之类的东西，在这些应用程序中，只要它们不提供注册方式，你就可以使用该应用程序访问现有的订阅 - 。但电子邮件、短信等不算阅读器应用。\n许多开发界成员对这些爆料做出了愤怒的回应，因为苹果的App Store审查指南中没有说明或澄清这些区别。此外，有许多应用程序无视分类，或者根本不遵守这些规则，这让评论员们不禁要问，Say，Dropbox(它似乎没有这个问题)和嘿(它有这个问题)到底有什么不同。\n这种愤怒还源于一种强烈的观点，即苹果从通过其支付系统获得的订阅费收入中抽取15%至30%的提成是不合理的，这一观点经常被公开表达。汉森则明确表示，Basecamp并不打算只做苹果要求的改变。在议定书中引用了他的话，他说：\n一百万年来，我从来没有以任何方式向苹果支付三分之一的收入。这是猥亵的，也是犯罪的，我会花掉我们拥有的或曾经赚到的每一美元来烧毁这一切，直到我们找到更好的地方。\n苹果还没有发布任何额外的声明，但看起来这场冲突还没有结束。\n在他的推特帖子中，汉森反复将苹果比作暴徒和黑帮，尽管苹果还没有被发现违法。尽管像Spotify这样的各种参与者已经开始投诉，但这些投诉还没有得到解决，而且还没有得出决定性的结论，表明苹果的所作所为在欧洲、美国或大多数其他地区实际上是非法的。\n很难证明苹果是垄断企业，因为它确实有竞争对手，而且相对于它的主要竞争对手，它占据了少数市场份额--以巨大的差距--。但合法性问题的风向可能会改变，等待欧盟投诉和调查的结果。\n开发人员长期以来一直在抱怨苹果的税收--苹果从其App Store的应用程序中收取的收入减少了。在这一点上，“The Verge”援引汉森的话说，苹果的降价幅度不大，与处理此类交易账单的信用卡公司的降价幅度相去甚远：\n为什么信用卡手续费徘徊在1.8-2.8%的区间，而苹果的App Store却稳稳地坐在30%的高端？因为没有竞争对手！而且他们有垄断的把柄！\n他认为，信用卡之所以提供如此低的费用，是因为它们生活在一个竞争激烈的世界里--更不用说信用卡在很大程度上是可替代的。而造成这种差异的原因除了竞争之外，还有更多的原因。信用卡公司为企业提供的服务和支持不像苹果那样广泛，而不仅仅是支付基础设施。\n苹果为开发者提供资源和支持，包括广泛的API和软件工具，这对开发iOS和iPadOS应用程序至关重要。没有它们，创建应用程序是不可能的。苹果运营着一个庞大的编辑团队来策划和突出应用程序，我采访过的许多开发人员表示，这对在该平台上的可发现性和成功至关重要。*苹果在研发开发人员使用的硬件上投入了大量资金，比如相机、CPU、机器学习处理器、GPU等等。是的，它运行着一个支付系统。\n苹果在提供收入份额的情况下，捍卫自己的收入份额，类似于大多数人支持的国家政府捍卫公司税的做法：一家企业只有在提供安全、法规、多种形式的基本基础设施等方面的支持和努力下，才有可能盈利，因此，该企业缴纳一大笔税款是合理的。\n这就是苹果为开发者提供的服务。这也是值得考虑的投资，进入平台的一开始。", "note_en": "Basecamp CTO David Heinemeier Hansson launched a firestorm of public criticism of Apple after Apple rejected an update to Basecamp&#39;s new email app. Hansson&#39;s  tweet thread and the ensuing controversy surfaced days before Apple&#39;s annual developer conference, and amidst news that the European Commission has opened an  antitrust probe of Apple and the App Store.\n The app in question is Hey, an email tool that eschews tradition to offer a better experience for a certain type of user. It requires users to pay a $99 annual subscription fee to access its features and services but offers a free trial period.\n Hey&#39;s 1.0 version was approved for launch on the App Store just this week, but it came under scrutiny at Apple when Basecamp attempted to deliver a 1.0.1 update with bug fixes. As events unfolded, a call and email came from Apple that indicated Hey would have to take steps toward making its subscription available through Apple&#39;s own billing system and in-app-payments platform. Otherwise, the app would be delisted from the store.\n According to Hansson, Apple told Basecamp that Hey violated rule 3.1.1 in the App Store&#39;s review guidelines. Here&#39;s the language Apple uses  in those guidelines:\n If you want to unlock features or functionality within your app, (by way of example: subscriptions, in-game currencies, game levels, access to premium content, or unlocking a full version), you must use in-app purchase. Apps may not use their own mechanisms to unlock content or functionality, such as license keys, augmented reality markers, QR codes, etc. Apps and their metadata may not include buttons, external links, or other calls to action that direct customers to purchasing mechanisms other than in-app purchase.\n But at first glance, Hey doesn&#39;t break that rule. It does not allow users to subscribe within the app. Instead, users must go to Hey&#39;s website to sign up through Basecamp&#39;s own billing—as is the case for many other popular apps like Spotify or Netflix. As per Apple&#39;s guidelines, Hey does not have a link or call-to-action directing users to said website.\n This was understandably a source of confusion for the Hey team. Also confusing: the fact that the 1.0.1 update was rejected but not the 1.0 version, even though the update did not change anything related to this issue.\n Though the tweet started the conversation, much of the meat is in a  follow-up article by David Pierce in Protocol, which contains or references statements from both Hansson and Apple. That report fleshes out the details; it appears Apple is also holding Hey to a set of rules that are  not included in the public guidelines.\n  Apple told me that its actual mistake was approving the app in the first place, when it didn&#39;t conform to its guidelines. Apple allows these kinds of client apps—where you can&#39;t sign up, only sign in—for business services but not consumer products. That&#39;s why Basecamp, which companies typically pay for, is allowed on the App Store when Hey, which users pay for, isn&#39;t.\n  One other distinction: Apple allows “Reader” apps — things like Netflix and Kindle and Dropbox, where you’re using the app to access existing subscriptions — as long as they don’t offer a way to sign up. But email, messaging, etc. don’t count as Reader apps.\n Many members of the development community have responded to these revelations with outrage, because these distinctions are not stated or clarified in Apple&#39;s App Store review guidelines. Plus, there are numerous examples of apps that defy classification or simply don&#39;t seem to follow these rules, leaving commentators to  ask what the difference really is between say, Dropbox (which doesn&#39;t appear to have this problem) and Hey (which does).\n The outrage also stems from a strongly held and often voiced belief that Apple&#39;s 15 to 30 percent cut of subscriptions revenue gained through its payment system is not justified. For his part, Hansson made it clear Basecamp doesn&#39;t intend to just make the changes Apple has requested. Quoted in The Protocol, he says:\n There is never in a million years a way that I am paying Apple a third of our revenues. That is obscene, and it&#39;s criminal, and I will spend every dollar that we have or ever make to burn this down until we get to somewhere better.\n Apple has not yet released any additional statements, but it seems this conflict is not yet over.\n  In his tweet thread, Hansson repeatedly compared Apple to the mob and gangsters, even though Apple has not yet been found to be breaking the law. While various players like Spotify have opened complaints, those complaints haven&#39;t been resolved, and there have been no decisive conclusions that what Apple is doing is, in fact, illegal in Europe, the United States, or most other regions.\n It&#39;s difficult to make the case that Apple is a monopoly, because it does have competition, and it holds a minority market share—by an enormous margin—against its main competitor. But the winds of the legality question could shift, pending the results of the EU complaints and investigation.\n Developers have long complained about the &#34;Apple tax&#34;—that revenue cut the company takes from apps in its App Store. To that point, Hansson is  quoted in The Verge comparing Apple&#39;s cut unfavorably with those of credit card companies that handle billing for transactions like this:\n Why is it that credit card processing fees hover in the 1.8-2.8% range, while Apple’s App Store have sat steady at 30% on the high end? Because there’s no competition! And they have a monopoly grip!\n Credit cards, he argues, offer such low fees because they live in a world of fierce competition—never mind the fact that credit cards are largely fungible. And there are more reasons for this difference besides competition. Credit card companies do not offer nearly the breadth of services and support to businesses that Apple does. It&#39;s not just about payment infrastructure.\n Apple provides resources and support to developers, including a wide range of APIs and software tools, that are critical to developing iOS and iPadOS apps. It is not possible to create the apps without them. Apple operates a vast editorial operation to curate and highlight apps, which many developers I have spoken with say is vital for discoverability and success on the platform. Apple spends a fortune on the research and development of hardware that developers use, like cameras, CPUs, machine-learning processors, GPUs, and more. And yes, it operates a payments system.\n Apple&#39;s defense of its revenue share, when it has offered one, is similar to the defense of corporate taxes by a national government, which most people support: the earnings of a business are only possible because of the government&#39;s support and diligence in providing security, regulations, multiple forms of basic infrastructure, and so on, so it is reasonable for that business to pay a significant sum in taxes.\n That&#39;s what Apple offers to developers. It&#39;s also worth considering the investment that went into the platform to begin with.", "posttime": "2020-06-18 20:28:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,app,apple,应用", "title": "为什么一款电子邮件应用与苹果开战-为什么两款都不对", "title_en": "Why one email app went to war with Apple–and why neither one is right", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/06/why-one-email-app-went-to-war-with-apple-and-why-neither-one-is-right/", "via": "", "real_tags": ["苹果", "app", "apple", "应用"]}]