[{"category": "", "categoryclass": "", "imagename": "22d96e19d29b72905e5216c49c9460da.png", "infoid": 1000865, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现代移动和Web应用程序旨在提供令人愉快和无缝的用户体验。作为用户，我们的要求越来越高，我们期望每天与之交互的移动应用程序都能获得出色的用户体验。例如，如果我们点击社交媒体应用程序上的点赞按钮，但互联网连接恰好在那个特定时刻中断，我们希望应用程序会负责重试，并让连接看起来从未中断。为了提供这种用户体验，前端开发人员传统上必须实现复杂的机制，用于在本地缓存中存储数据、自动恢复连接、使用指数退避进行重试、将数据同步到云并将其与安全的冲突解决方案合并。要实现这样的体验并不容易，我们从开发人员那里听到，他们宁愿把时间花在新功能上，而不是把时间花在这种毫无区别的繁重工作上一遍又一遍。\nAWS AppSync是适用于移动和Web应用程序的GraphQL无服务器后端。它通过内置计算层提供灵活可靠的API来运行查询、突变和订阅，从而安全地访问、操作和组合来自任何应用程序的一个或多个数据源的数据。在客户端设备上，Amplify数据存储区提供了一种熟悉的编程模型，用于利用共享和分布式数据，而无需为离线、实时和在线方案编写额外代码，这使得处理分布式、跨用户数据与处理仅本地数据一样简单。\n今天，我们将分享一个参考应用程序和架构，演示如何使用前端带有Amplify数据存储区的React Native和后端带有Amazon DynamoDB的AWS AppSync构建具有内置脱机和云同步功能的现代移动应用程序。\nAmplify Datastore是一个在移动设备或Web浏览器内部运行的客户端，它提供一个API供开发人员与之交互。它充当持久存储库，将数据存储在本地，并通过GraphQL查询、突变和订阅在后台自动将其同步到云。与数据存储区客户端的任何交互始终针对本地数据，而同步、冲突检测、版本控制和日志记录由同步引擎和AWS AppSync在后台自动处理。值得一提的是，数据同步到云是Datastore的一项可选功能，如果需要，您可以在没有AWS帐户的情况下以仅本地独立模式使用它。\n另一个重要的亮点是，开发人员不需要熟悉像Apollo或Relay这样的GraphQL库。他们只需使用标准函数调用数据存储区API，客户端会在后台自动将这些操作转换为GraphQL查询、突变和订阅，以便与AWS AppSync API端点进行交互。数据存储区中提供了以下API，可方便地操作您的数据：\n观察-订阅使用AppSync实时功能监听模型更改的功能。\n清除-从本地存储中删除所有数据，这在用户注销以清除本地数据时非常有用。\n使用Amplify CLI中的模型生成工具，开发人员首先将他们的数据模型定义为标准的GraphQL架构，CLI会自动生成本机代码中的模型，还会创建GraphQL语句(查询、突变和订阅)，这样您就不必手动编写代码。此外，通过使用Amplify CLI中的PUSH命令，开发人员可以使用DynamoDB表和一组GraphQL解析器自动调配AppSync API，以便根据定义的架构对数据执行CRUD操作。所有这些都不需要编写一行后端代码。\n我们决定构建一个现代的无服务器销售点(POS)实现，作为展示上述所有服务的移动应用程序。对于离线功能，还有什么比关键业务应用程序更好的使用案例呢？该应用程序处理销售，即使全天出现小范围的互联网中断也需要继续工作。商店员工应该继续处理交易并为客户服务，而不必担心互联网连接不良。\n我们为Point of Sale应用程序选择了一个咖啡馆主题，所以让我们来了解一下咖啡师使用移动应用程序的用户体验。这一切都从主屏幕开始，咖啡师可以在接受客户订单时将产品添加到购物车中：\n当顾客准备好付款时，咖啡师导航到结账屏幕，在那里订单摘要与行项目、数量和税一起显示。按Checkout按钮将使用数据存储区保存订单，并将您带回主屏幕。\n最后，用户可以浏览按日期分组的订单列表。这就是订阅数据实时更改变得非常有用的地方，因为只要销售点应用程序的任何用户添加新订单，此列表就会动态填充。无需手动刷新列表，数据存储区将观察和检索异步新订单，并自动更新应用程序本地存储，从而使订单列表始终保持最新。\n该应用程序提供流畅的用户体验，因为向购物车添加产品快速且响应迅速，即使网络不可用，用户界面也不会出现延迟。这是可能的，因为UI正在与Amplify Datastore交互，只要有网络连接，Amplify Datastore总是在本地访问数据，并在后台将更改同步到云。虽然这是一个简单的应用程序，没有复杂的计算要求，但关键的亮点是，通过使用Amplify数据存储区构建具有可靠和高效的数据处理的令人愉快的响应用户体验是多么简单。\n这一切都从GraphQL模式定义开始。开发人员在Graphql.schema文件中定义他们的应用程序数据模型，Amplify用本地语言为本地数据存储生成所有必要的构造。让我们看一下销售点应用程序的架构：\n键入order@model{id：id！合计：浮点小计：浮点税：浮点创建日期：字符串！lineItems：[LineItem]@Connection(name：&#34；OrderLineItems&#34；)}type LineItem@model{id：id！数量：INT订单：Order@Connection(Name：&#34；OrderLineItems&#34；)product：product@Connection Description：String Price：Float Total：Float}type Product@model{id：id sku：string name：string Price：Float image：string}。\n请注意@model和@connection指令，它们是Amplify抽象，允许开发人员快速创建应用程序的后端，包括DynamoDB表和GraphQL解析器来操作您的数据。@Connection指令特别用于定义模型之间的关系，例如“有一个”、“有多个”和“属于”。在本例中，我们的模型定义一个订单有多个LineItem，一个LineItem属于一个Order和一个Product。\n异步函数submitOrder(Order){const now=new date().toISOString()；//保存订单表头const Neworder=等待DataStore.save(new order({total：order.total，subtotal：order.subtotal，Tax：order.Tax，createdAt：Now，}))；//保存每个行项目const Promises=order.lineItems.map(lineItem=&gt；{return DataStore.save(new LineItem({qty：lineItem.qty，description：lineItem.description，Price：lineItem.Price，Total：lineItem.total，order：neworder，//按订单关联产品：lineItem.product，//关联到产品})；})；等待Promise.all(Promise.all(Promises)；}。\n这有多简单？想象一下，如果我们不使用Amplify Datastore，并且必须针对Internet不可用实现错误处理逻辑，并将数据保存在本地以备以后同步到云中，那么代码会是什么样子。它将比上面的代码复杂得多。\n当您有多个客户端向后端发送并发事务时，客户端总是有可能同时尝试更改同一项。这就是冲突解决方案派上用场的地方，也是开发人员开箱即用数据存储区的另一项AppSync功能。\n让我们回顾一个更具体的示例，说明冲突解决在销售应用程序中的哪些方面是有用的：假设两个不同的咖啡师正在尝试更新产品目录，以更改产品的属性。一是更新产品定价，二是更新产品形象。当他们这样做的时候，他们两个突然都碰巧在同一时间更新了相同的产品：\nAppSync允许两次更新都成功，从而优雅地解决了冲突。此策略称为Automerge，当在DynamoDB数据源中启用冲突解决时，它是默认策略。它主要使用GraphQL类型和字段信息来检查更新，并将其与已写入表的当前项进行比较。\n您可以将此策略更改为使用乐观并发将版本检查应用于整个对象，其中写入数据库的最新项目使用针对传入记录的版本检查。或者，对于希望更好地控制冲突解决策略的开发人员，您可以使用Lambda函数，在该函数中，您可以在合并或拒绝更新时为冲突定义任何自定义业务逻辑。\n当AppSync突变更改版本化的项目时，该更改的记录将存储在针对增量更新进行优化的Delta DynamoDB表中。此表的目的是允许客户端使用一个可能包含过多记录的基本查询的结果对其本地存储进行消重数据处理，然后仅接收自上次查询(增量更新)以来更改过的数据。增量同步表在您的AWS帐户中可见，并由Amplify数据存储区和AppSync解析器自动更新，开发人员无需执行任何操作即可填充该表。\n这对销售点应用程序意味着什么？用户首次打开应用程序时，数据存储区通过查询未指定lastSync值的AppSync来提取订单，因此GraphQL解析器将从主Orders表中检索数据。\n数据存储区自动跟踪并包括lastSync值，以便后续调用从后端获取订单。这称为增量查询，它仅使用增量同步表从该客户端提取自上次同步以来已更改的数据。它比转到主表更高效，因为增量同步表是专门为基于时间戳的查询而设计的。\n增量同步表提供由AppSync解析器针对每个突变保持最新的日志。使用DynamoDB TTL属性定期逐出表上的项目，以防止该表积累陈旧数据。这允许客户端在从脱机状态切换到在线状态时高效地提取数据。“软删除”是AppSync的Delta Sync实现与DynamoDB数据源一起提供的另一个有趣的特性，这意味着删除的项目在基本表中使用Tombstone标志保留一段可配置的时间。这使开发人员有机会实现“Undelete”功能，通过在永久删除项目之前删除BaseTableTTL属性来处理意外删除。\n借助AWS AppSync和Amplify Datastore，前端开发人员只需使用熟悉而简单的编程模型编写几行代码，即可构建现代应用程序，从而提供令人愉快、快速且响应迅速的用户体验。AppSync通过提供在高度可扩展的DynamoDB表中存储数据的托管GraphQL API端点为您的后端提供支持，而Amplify数据存储区通过提供强大的数据处理和足智多谋的同步引擎为您的客户端应用程序提供支持。\n转到GitHub存储库，探索我们构建的销售点应用程序代码，并将其用作启动您自己的REACTION原生移动应用程序的示例：https://github.com/aws-samples/aws-appsync-refarch-offline.。您可以亲身体验，在几分钟内部署移动前端以及您AWS账户中的所有后端服务。\n我们迫不及待地想知道您下一步将使用AWS AppSync和Amplify数据存储区构建什么！", "note_en": "Modern mobile and web applications are built to provide delightful and seamless user experiences. As users we have become more demanding and we expect a great user experience for the mobile apps we interact with on a daily basis. For example, if we tap the  Like button on a social media app, but the internet connectivity happens to be lost in that particular moment, we expect the application to take care of retrying and make it seem like the connection was never lost. In order to deliver that kind of user experience, frontend developers traditionally had to implement complex mechanisms for storing data in a local cache, resuming connections automatically, doing retries with exponential backoff, sync the data to the cloud and merge it with safe conflict resolution. It is not easy to implement such an experience, and we heard from developers that they would rather use their time working on new features as opposed to spending time on this sort of undifferentiated heavy lifting over and over.\n  AWS AppSync is a GraphQL serverless backend for mobile and web applications. It provides a flexible and reliable API with a built-in compute layer to run queries, mutations, and subscriptions to securely access, manipulate, and combine data from one or more data sources for any application. On the client device, the  Amplify DataStore provides a familiar programming model for leveraging shared and distributed data without writing additional code for offline, real-time and online scenarios, which makes working with distributed, cross-user data just as simple as working with local-only data.\n  Today we share a reference application and architecture that demonstrates how to build a modern mobile application with built-in offline and cloud synchronization capabilities using React Native with the Amplify DataStore in the front end and AWS AppSync with Amazon DynamoDB in the backend.\n        Amplify DataStore is a client that runs inside the mobile device or web browser and exposes an API for developers to interact with. It serves as a persistent repository to store data locally and synchronize it to the cloud automatically in the background via GraphQL queries, mutations, and subscriptions. Any interaction with the DataStore client is always against local data, while the synchronization, conflict detection, versioning, and journaling is handled automatically in the background by the Sync Engine and AWS AppSync. It’s worth mentioning that data synchronization to the cloud is an optional feature of DataStore, you can use it in a local-only standalone mode without an AWS account if needed.\n  Another important highlight is that developers don’t need to be familiar with GraphQL libraries like Apollo or Relay. They just need to invoke the DataStore APIs with standard function invocations and the client automatically transforms those operations into GraphQL queries, mutations, and subscriptions behind the scenes to interact with an AWS AppSync API endpoint. The following APIs are available in the DataStore to easily manipulate your data:\n  Observe – subscribe a function to listen for changes in your models using AppSync real-time features.\n  Clear – delete all data from the local store, useful when signing out a user to clear local data.\n  Using the model generation tool from the Amplify CLI, developers start by defining their data model as a standard GraphQL schema, the CLI automatically generates the models in native code and also creates the GraphQL statements (queries, mutations, and subscriptions) so that you don’t have to hand code them. Moreover, by using the   push command in the Amplify CLI, developers can automatically provision an AppSync API with DynamoDB tables and a set of GraphQL resolvers to perform CRUD operations over the data based on the defined schema. All of this without writing a single line of backend code.\n      We decided to build a modern serverless Point of Sale (POS) implementation as a mobile application that showcases all the services described above. What better use case for offline capabilities than a critical business application that processes sales and requires to continue working even if there are small internet outages throughout the day? Store associates should continue processing transactions and serving customers without worrying about poor internet connectivity.\n  We chose a coffee shop theme for the Point of Sale app, so let’s walk through the user experience of a barista using the mobile application. It all starts with the home screen where the barista can add products to the cart when taking the customer’s order:\n    When the customer is ready to pay, the barista navigates to the checkout screen where the order summary is displayed along with the line items, quantities and taxes. Pressing the  Checkout button saves the order using the DataStore and take you back to the home screen.\n  Finally, the user can browse the list of orders grouped by date. This is where subscribing to real-time changes to the data becomes very useful because this list populates dynamically as soon as new orders are added by any user of the Point of Sale application. There is no need to manually refresh the list, the DataStore observes and retrieves asynchronously new orders and automatically updates the app local storage causing the list of orders to always be up to date.\n  The application provides a smooth user experience as adding products to the shopping cart is fast and responsive, there is no lag in the user interface even if the network is unavailable. This is possible because the UI is interacting with the Amplify DataStore, which is always accessing data locally and synchronizing changes to the cloud in the background whenever there’s network connectivity. Granted this is a simple application with no complex computation requirements, but the key highlight is how simple it is to build a delightful responsive user experience with reliable and efficient data handling by using the Amplify DataStore.\n      It all starts with the GraphQL schema definition. Developers define their application data model in a  graphql.schema file and Amplify generates all the necessary constructs for the local data store in native language. Let’s take a look at the schema for the Point of Sale application:\n  type Order @model {\r id: ID!\r total: Float\r subtotal: Float\r tax: Float\r createdAt: String!\r lineItems: [LineItem] @connection(name: &#34;OrderLineItems&#34;)\r}\r\rtype LineItem @model {\r id: ID!\r qty: Int\r order: Order @connection(name: &#34;OrderLineItems&#34;)\r product: Product @connection\r description: String\r price: Float\r total: Float\r}\r\rtype Product @model {\r id: ID\r sku: String\r name: String\r price: Float\r image: String\r}\n  Notice the   @model and   @connection directives, these are Amplify abstractions that allow developers to quickly create the backend for the application including DynamoDB tables and GraphQL resolvers to manipulate your data. The  @connection directive in particular is used to define relationships between your models, such as “ has one”, “ has many” and “ belongs to”. In this case, our model defines that an  Order has many  LineItems, and a  LineItem belongs to an  Order and a  Product.\n    async function submitOrder(order) {\r const now = new Date().toISOString();\r // Save order header\r const newOrder = await DataStore.save(\r new Order({\r total: order.total,\r subtotal: order.subtotal,\r tax: order.tax,\r createdAt: now,\r })\r );\r\r // Save each lineItem\r const promises = order.lineItems.map(lineItem =&gt; {\r return DataStore.save(\r new LineItem({\r qty: lineItem.qty,\r description: lineItem.description,\r price: lineItem.price,\r total: lineItem.total,\r order: newOrder, // associate to order\r product: lineItem.product, // associate to product\r })\r );\r });\r\r await Promise.all(promises);\r}\n  How simple is that? Just imagine what the code would look like if we didn’t use the Amplify DataStore, and had to implement error handling logic for internet unavailability as well as save data locally for later synchronization to the cloud. It would be a lot more complex than the code above.\n      When you have multiple clients sending concurrent transactions to the backend, there is always the possibility that clients attempt to change the same item at the same time. This is where conflict resolution comes in handy and it is another AppSync feature developers get out of the box with the DataStore.\n  Let’s review a more concrete example of where conflict resolution would be useful in the point of sales application: imagine two different baristas are trying to update the product catalog to change the properties of the products. One of them is updating the pricing of products and the other one is updating the product image. And as they do it, they both suddenly happen to update the same product at the same time:\n    AppSync resolves the conflict gracefully by allowing both updates to succeed. This strategy is called  Automerge and it is the default when conflict resolution is enabled in a DynamoDB data source. It essentially uses the GraphQL type and field information to inspect the update and compare it to the current item that has been written to the table.\n  You can change this strategy to apply version checks to the entire object with  Optimistic Concurrency where the latest written item to your database uses a version check against the incoming record. Alternatively, for developers who want to get even more control over the conflict resolution strategy, you can use a Lambda function where you define any custom business logic for conflicts when merging or rejecting updates.\n        When an AppSync mutation changes an item that is versioned, a record of that change is stored in a  Delta DynamoDB table that is optimized for incremental updates. The purpose of this table is to allow clients to hydrate their local storage with results from one base query that might have too many records, and then receive only the data altered since their last query (the  delta updates). The Delta Sync table is visible in your AWS account and updated automatically by the Amplify DataStore and AppSync resolvers, there is nothing developers need to do to populate it.\n  What does it mean for the Point of Sale application? The first time a user opens the application, the DataStore fetches  Orders by doing a query to AppSync without a  lastSync value specified and therefore the GraphQL resolver retrieves the data from the main  Orders table.\n    The DataStore automatically tracks and includes a  lastSync value for subsequent calls to fetch orders from the backend. This is called a  delta query and it only fetches the data that has changed since the last synchronization from that client using the Delta Sync table. It is more efficient than going to the main table because the Delta Sync table is purposely designed for queries based on timestamps.\n  The Delta Sync table provides a journal that is kept up to date by the AppSync resolvers on every mutation. Items on the table are evicted periodically using the  DynamoDB TTL attribute to prevent this table to accumulate stale data. This allows clients to fetch data efficiently as they switch from offline to online states. “ Soft deletes” are another interesting feature the AppSync’s Delta Sync implementation with DynamoDB data sources offer, which means deleted items are kept in the Base table with a tombstone flag for a configurable amount of time. This gives developers the opportunity to implement an “ Undelete” feature to handle accidental deletions by removing the  BaseTableTTL attribute before the item is deleted permanently.\n        With AWS AppSync and Amplify DataStore, frontend developers can build modern applications providing a delightful, fast and responsive user experience by just writing few lines of code using a familiar and simple programming model. AppSync powers your backend by providing a managed GraphQL API endpoint storing data in highly scalable DynamoDB tables while the Amplify DataStore powers your client application by providing robust data handling and a resourceful synchronization engine.\n  Head over to the GitHub repository to explore the Point of Sale application code we built and use it as an example to start your own React Native mobile application:  https://github.com/aws-samples/aws-appsync-refarch-offline. You can try it yourself and deploy the mobile front end as well as all the backend services in your AWS account in minutes.\n  We can’t wait to see what you will build next with AWS AppSync and the Amplify DataStore!", "posttime": "2020-05-06 08:38:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,提供,appsync,应用程序,data", "title": "AWS AppSync离线参考体系结构-由Amplify数据存储区提供支持", "title_en": "AWS AppSync offline reference architecture – powered by the Amplify DataStore", "transed": 1, "url": "https://aws.amazon.com/blogs/mobile/aws-appsync-offline-reference-architecture/", "via": "", "real_tags": ["app", "提供", "appsync", "应用程序", "data"]}, {"category": "", "categoryclass": "", "imagename": "1856e233b3c2b1fff9d3dacb5150cb19.jpg", "infoid": 1000863, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是补充剂的黑暗日子。虽然它们仅在美国就有300多亿美元的市场，但维生素A、维生素C、维生素E、硒、β-胡萝卜素、氨基葡萄糖、软骨素和鱼油现在已经在一项又一项研究中失败了。\n如果说有一种补充剂似乎肯定能通过严格的测试，那就是维生素D。血液中维生素D水平较低的人，几乎所有你能想到的疾病和障碍的发病率都要高得多：癌症、糖尿病、肥胖症、骨质疏松症、心脏病发作、中风、抑郁症、认知障碍、自身免疫性疾病等等。维生素是钙吸收所必需的，因此对骨骼健康至关重要，但随着越来越多的证据表明低水平的维生素D与如此多的疾病相关，健康专家开始怀疑它还参与了许多其他生物过程。\n他们认为我们中的大多数人都没有得到足够的信息。这是有道理的。维生素D是一种由皮肤在阳光的帮助下产生的荷尔蒙。它很难通过饮食获得足够的量。当我们的祖先住在热带地区的户外，半裸着跑来跑去时，这不是问题。我们从太阳中生产出所需的全部维他命D。\n但今天，我们中的大多数人都在室内工作，当我们真的走到户外时，我们被教导要保护自己免受危险的紫外线的伤害，紫外线可能会导致皮肤癌。防晒霜也会阻止我们的皮肤产生维生素D，但这没什么，美国皮肤病学会说，该学会对阳光暴晒采取零容忍态度：“你需要每天保护你的皮肤免受阳光的伤害，即使是在多云的时候，”该学会在其网站上建议。我们都被告知，最好涂上厚厚的防晒霜，然后用维生素D药片来弥补。\n然而，维生素D补充剂在临床试验中却惨败。五年前，研究人员就已经警告说，它没有显示出任何好处，而且证据只会变得更有力。11月初，有史以来规模最大、最严格的维生素试验之一-25871名参与者接受了为期五年的高剂量试验-发现对癌症、心脏病或中风没有影响。\n我们怎么会错得这么离谱呢？维生素D水平低的人怎么会明显患上这么多疾病的几率更高，而补充却得不到帮助呢？\n事实证明，一群无赖的研究人员一直都有一个解释。如果他们是对的，这意味着我们又一次被史诗般的误导了。\n这些反叛者争辩说，维他命D水平高的人之所以如此健康，并不是维他命本身。那只是个记号笔。他们的维生素D水平很高，因为他们大量接触到真正对他们的健康负有责任的东西-那个从上方向下闪耀的橙色大球。\n爱丁堡大学(University Of Edinburgh)的皮肤科医生理查德·韦勒(Richard Weller)是这场叛乱的领导者之一，他举止温和。多年来，韦勒轻信了关于太阳光破坏性的党派路线。“我天生不是一个叛逆者，”今年秋天我给他打电话时，他坚持说。“我在学校一直是个循规蹈矩的好孩子。这条道路来自于对数据的追随，而不是想要颠覆苹果车的愿望。\n韦勒的怀疑始于2010年左右，当时他正在研究一氧化氮，这是一种在体内产生的分子，可以扩张血管并降低血压。他发现了一种以前不为人知的生物途径，皮肤通过这种途径利用阳光制造一氧化氮。\n已经确定，高血压、心脏病、中风和总死亡率都会上升，你离阳光灿烂的赤道越远，而且它们都会在黑暗的月份上升。韦勒把两件事放在一起，有了他所谓的“尤里卡时刻”：将皮肤暴露在阳光下能降低血压吗？\n果然，当他将志愿者暴露在没有防晒霜的相当于30分钟的夏日阳光下时，他们的一氧化氮水平上升，血压下降。由于它与心脏病和中风有关，血压是世界上过早死亡和疾病的主要原因，而且降幅足够大，足以在全球范围内防止数百万人死亡。\n难道所有这些射线都不会增加皮肤癌的发病率吗？是的，但皮肤癌导致的死亡人数令人惊讶地很少：在美国，每年每10万人中只有不到3人死于皮肤癌。每死于皮肤癌的人中，就有100多人死于心血管疾病。\n人们没有意识到这一点，因为几种不同的疾病被混为一谈，称为“皮肤癌”。到目前为止，最常见的是基底细胞癌和鳞状细胞癌，它们几乎从不致命。韦勒说，事实上，“当我诊断一名患者患有基底细胞皮肤癌时，我首先说的是祝贺你，因为你走出我的办公室时的预期寿命比你走进办公室时要长。”这可能是因为罹患癌症的人往往是健康的类型，在户外得到足够的锻炼和阳光，癌症与阳光暴露有很大的联系。\n黑色素瘤，一种致命的皮肤癌，要罕见得多，只占新皮肤癌的1%到3%。令人费解的是，户外工作者的黑色素瘤发病率是室内工作者的一半。一般来说，晒黑的人的发病率较低。韦勒说：“黑色素瘤的危险因素似乎是间歇性的阳光和晒伤，特别是在你年轻的时候。”“但有证据表明，长期暴露在阳光下与较少的黑色素瘤有关。”\n这些在老牌皮肤科社区里都是相当激进的词。“我们确实知道黑色素瘤是致命的，”耶鲁大学的大卫·莱弗尔(David Leffell)说，他是美国领先的皮肤科医生之一，“我们知道绝大多数病例都是由于阳光暴晒造成的。”因此，人们当然需要谨慎行事。“\n尽管如此，韦勒仍在不断寻找与官方说法不符的证据。其中一些最好的来自瑞典卡罗林斯卡研究所的妇产科高级研究员佩尔·林德奎斯特(Pelle Lindqvist)，该研究所是诺贝尔生理学或医学奖的发源地。Lindqvist在20多年的时间里跟踪了瑞典近3万名女性的日光浴习惯。最初，他在研究血液凝块，他发现，在阳光下时间更长的女性中，血栓发生的频率较低-而且在夏天发生的频率也较低。林德奎斯特接下来研究了糖尿病。果不其然，太阳崇拜者的比率要低得多。黑色素瘤?。诚然，太阳崇拜者的发病率更高，但他们死于这种疾病的可能性要低8倍。\n因此，林德奎斯特决定研究总体死亡率，结果令人震惊。在这项研究的20年中，避免晒太阳的人死亡的可能性是太阳崇拜者的两倍。\n没有太多的日常生活方式选择会使你的死亡风险增加一倍。在2016年发表在“内科医学杂志”(Journal Of Internal Medicine)上的一项研究中，林德奎斯特的团队正确看待了这一问题：“就预期寿命而言，避免阳光暴晒与吸烟的风险程度相当。”\n盲目应用SPF50可能会像万宝路100一样对你有害，这一想法产生了一系列简短的新闻，但这个想法太奇怪了，以至于它没有突破致命太阳的范式。事实上，一些医生发现这相当危险。\n“我不反对他们的数据，”马萨诸塞州综合医院皮肤科主任大卫·费舍尔(David Fisher)说。“但我确实不同意其中的含意。”他认为，皮肤癌的风险远远超过日光照射的好处。他说：“有人可能会认为这些结论意味着皮肤癌的风险值得降低全因死亡率或受益于血压。”他说：“我强烈反对这一点。这是不值得的，除非所有其他降低血压的选择都用尽了。”相反，他建议服用维生素D药片和高血压药物作为更安全的方法。\n韦勒迄今规模最大的研究将于2019年晚些时候发表。在三年的时间里，他的团队跟踪了美国2000个地点34万人的血压，并根据年龄和皮肤类型等变量进行了调整。结果清楚地表明，阳光明媚的气候中的人血压较低的原因很简单，就像光线击中皮肤一样。\n当我与韦勒交谈时，我犯了一个错误，把这个概念描述为违反直觉的。“这完全是凭直觉的，”他回答说。“智人已经存在了20万年了。工业革命之前，我们一直住在户外。没有防晒霜我们是怎么度过新石器时代的？实际上，非常好。令人反感的是，皮肤科医生跑来跑去说，‘不要出去，你可能会死。’“。\n当你每天花大部分时间治疗患有可怕黑色素瘤的患者时，专注于预防他们是很自然的，但你需要牢记大局。毕竟，骨科医生并不建议他们的病人为了降低膝盖受伤的风险而避免锻炼。\n与此同时，这幅大图景只会变得越来越有趣。维生素D现在看起来就像太阳冰山一角。阳光会触发体内其他一些重要化合物的释放，不仅有一氧化氮，还有血清素和内啡肽。它可以降低前列腺癌、乳腺癌、结直肠癌和胰腺癌的风险。它能改善昼夜节律。它可以减少炎症，抑制自身免疫反应。它几乎改善了你能想到的每一种精神状态。而且是免费的。\n这些似乎是每个人都应该能够利用的好处。但并不是所有的人都以同样的方式处理阳光。目前的美国阳光暴露指南是为地球上最白的人写的。\n每年，理查德·韦勒(Richard Weller)都会在埃塞俄比亚亚的斯亚贝巴的一家皮肤病医院工作。亚的斯亚贝巴不仅位于赤道附近，而且位于7500英尺以上，因此它会接收大量的紫外线辐射。尽管如此，威勒说，“我还没有见过皮肤癌。然而，英国和美国的非洲人却被告知要躲避阳光。“。\n所有早期人类都是在热带阳光下进化到户外的。就像空气、水和食物一样，阳光是我们的主要输入之一。人类还进化出一种保护皮肤免受过多辐射的方法--黑色素，一种天然防晒霜。我们深色皮肤的非洲祖先产生了如此多的黑色素，以至于他们从来不用担心太阳。\n随着人类从热带迁徙到更远的地方，每年冬天面临数月的光线短缺，他们进化成在太阳较弱的时候产生较少的黑色素，吸收他们可能获得的所有阳光。他们还开始生产更多的蛋白质来储存维生素D以供以后使用。在春天，随着太阳的加强，他们会逐渐形成遮挡阳光的古铜色皮肤。在现代之前，晒伤可能是一种罕见的现象，直到我们开始把大部分时间花在室内。突然，脸色苍白的办公室职员在夏天去海滩玩，结果被电击了。那是黑色素瘤的配方。\n有色人种很少得黑色素瘤。高加索人每10万人中有26人，西班牙裔人每10万人中有5人，非洲裔美国人每10万人中有1人。在非洲裔美国人患上黑色素瘤的罕见情况下，黑色素瘤尤其致命-但它大多发生在手掌、脚底或指甲下，不是由阳光照射引起的。\n与此同时，非洲裔美国人患糖尿病、心脏病、中风、内癌和其他在阳光下似乎有所改善的疾病的比率很高，他们很可能对这些疾病的摄入量还不够。由于它们的黑色素基因水平较高，它们需要更多的阳光照射才能产生维生素D等化合物，而且它们较难在较暗的日子储存这种维生素。他们可以从阳光中获益很多，也没什么好害怕的。\n然而，他们被告知了一个非常不同的故事，被误导，相信防晒霜可以防止他们的黑色素瘤，这让威勒感到恼火。他说：“化妆品行业现在正试图向深肤色的人推广防晒霜。”“在皮肤科会议上，你会让人们站起来说，‘我们必须调整产品以适应这个市场。’嗯，不，我们不需要。这是一种营销策略。”\n当我要求美国皮肤科学会(American Academy Of Dermatology)澄清其对黑皮肤人群和太阳的立场时，它又把我引回到了其网站上的官方说法：“美国皮肤科学会建议，所有人，无论肤色如何，都要通过寻找阴凉处、穿防护服、使用SPF为30或更高的广谱防水防晒霜来保护自己免受太阳有害的紫外线的伤害。”(美国皮肤科学会建议所有人，无论肤色如何，都要通过寻找阴凉处，穿上防护服，并使用SPF为30或更高的广谱防水防晒霜)。\n在我看来，这似乎是一个小小的样板，我想知道官方的指导方针是否还没有跟上当前的想法。所以我问了耶鲁大学的大卫·莱弗尔(David Leffell)。“我认为防晒建议，”他告诉我，“总是针对那些风险最高的人”--皮肤白皙或有皮肤癌家族史的人。“虽然橄榄色皮肤的人患皮肤癌的风险确实较低，但我们确实看到越来越多的这类皮肤的人患皮肤癌。”但是皮肤癌。在非裔美国人中非常罕见。虽然它们代表了一系列的色素沉着，但(它们)没有那么大的风险。“。\n尽管如此，麻省总医院的大卫·费舍尔并不认为这改变了方程式。他说：“有一本药典列出了在降低血压方面极其有效的药物。”因此，在高血压有这么多替代疗法的情况下，得出结论认为人们应该暴露在皮肤癌风险增加的环境中，包括潜在的致命癌症，这是有问题的。\n我是否愿意接受这样一种观念，即当前的指导方针正在无意中倡导一种正在杀死我们的生活方式？\n在20世纪70年代，当营养学家开始看到有迹象表明，饮食中饱和脂肪和胆固醇含量高的人也有很高的心血管疾病发病率时，他们告诉我们要避免食用黄油，而要选择人造黄油，人造黄油是通过植物油鼓泡氢气制成的，将它们转化为固体反式脂肪。\n自19世纪中期问世以来，人造黄油一直被认为是爬行动物，是买不起真正黄油的人的怪异替代品。到了19世纪末，几个中西部乳制品州已经完全禁止了它，而包括佛蒙特州和新罕布夏州在内的其他州则通过了法律，要求它被染成粉红色，这样它就永远不会被冒充黄油了。然而，不知何故，人造黄油成为了我们几十年来涂抹在吐司上的东西，提醒人们，即使是最古怪的产品，也可以在拥有足够的行业影响力的情况下成为主流。\n最终，更好的科学发现，氢化过程产生的反式脂肪比黄油中的天然脂肪对我们的动脉有害得多。1994年，哈佛大学的研究人员估计，由于反式脂肪，每年有3万人不必要地死亡。然而，直到2015年，它们才在美国被禁止。\n防晒霜在早期也非常粗略，会不会也出现了同样的动向呢？作为最早的防晒霜之一，红色兽医宠物(红色兽医凡士林)是1944年发明的一种厚厚的红色凡士林，目的是保护南太平洋的士兵；它一定令人毛骨悚然地让人想起粉色人造黄油。只有在铜通购买了版权并重新配制了红色宠物以适应本世纪中叶新的晒黑文化之后，防晒霜才大受欢迎。\n然而，与人造黄油一样，早期的防晒霜配方也是灾难性的，可以保护使用者免受导致晒伤的UVB射线的伤害，但不能保护用户免受导致皮肤癌的UVA射线的伤害。即使在今天，SPF级别也只是指UVB射线，所以许多用户吸收的UVA辐射可能比他们意识到的要多得多。与此同时，许多常见的防晒霜成分被发现是荷尔蒙干扰物，可以在使用者的血液和母乳中检测到。最严重的违法者是氧苯酮，它也会使珊瑚的DNA发生突变，据信是在杀害珊瑚礁。夏威夷和西太平洋国家帕劳已经禁止了它，分别于2021年和2020年生效，预计其他国家的政府也会效仿。\n该行业现在正争先恐后地摆脱奥苯宗，拥抱不透明的、甚至是霓虹灯的矿物质配方，这是一种让人想起古老的红色宠物的时尚宣言。但由于其长期推动后来被证明是不健康的产品的记录，我仍然对行业保持怀疑，并保证它最终解决了一切问题。我们总是被告知要用一些能改善我们健康的人造药丸或产品来代替天然的东西，但几乎总是被证明是一个错误，因为我们知道的不够。多种维生素不能替代水果和蔬菜，维生素D补充剂显然也不能替代自然光。\n旧的信仰不会轻易消失，如果你仍然对旧的索尔持怀疑态度，我可以理解。为什么要相信一名记者和一小撮流氓研究人员，而不相信这么多专业人士的庄严观点呢？\n原因如下：世界其他地方的许多专家已经意识到阳光的好处。阳光澳大利亚在2005年改变了论调。澳大利亚癌症委员会的官方立场文件(由澳大利亚皮肤科医师学院认可)指出：“太阳的紫外线辐射对人体健康既有有益的影响，也有有害的影响。需要在过度的阳光暴晒(增加皮肤癌风险)和足够的阳光暴晒以维持充足的维生素D水平之间取得平衡……应该注意的是，阳光暴晒的好处可能不仅仅限于维生素D的产生。阳光暴晒的其他可能的有益影响…。包括降低血压、抑制自身免疫性疾病和改善情绪。“。\n澳大利亚的官方建议是什么？当紫外线指数低于3摄氏度时(冬季美国大陆的大部分地区都是如此)，“除非靠近雪地或其他反射面，否则不建议防晒。为了支持维生素D的生产，中午在户外活动一段时间，露出一些皮肤。“。即使在盛夏，澳大利亚也建议每天晒太阳几分钟。\n新西兰接受了类似的建议，英国皮肤科医生协会在一份声明中走得更远，这与美国皮肤科医生协会的立场直接矛盾：“安全地享受阳光，同时注意不要灼伤，可以帮助提供维生素D的好处，而不会过度增加皮肤癌的风险。”\n耶鲁大学皮肤科医生莱弗尔推荐了一种他称之为“明智”的方法。他告诉我：“我一直建议我的病人，他们不需要在岩石下爬行，但应该使用常识，特别要意识到累积的日照和晒伤。”\n这并不意味着要擦出婴儿油或培养出光亮的古铜色皮肤。所有的专家都认为晒伤--尤其是童年和青春期的晒伤--尤其严重。\n归根结底，还是你说了算。每个人的需求随着季节、纬度、肤色、个人历史、哲学和其他许多因素的不同而千差万别，以至于不可能提供一刀切的建议。Dminder应用程序使用年龄、体重和暴露皮肤的数量等因素来跟踪你生产维生素D所需的日光量，可能是一个起点。用你的防晒霜换一件衬衫和一顶宽边帽子是另一回事。这两家公司都有卓越的安全记录。\n至于我，我已经做出了选择。一个健康的户外探险世界正在召唤-如果不是半裸的话，那就相当接近了。从今天开始，我要走向光明。\n您现在订阅了Body Work，我们不会以任何理由与任何人共享您的电子邮件。在我们的时事通讯注册页面上可以找到更多时事通讯。\n本网站受reCAPTCHA保护，适用谷歌隐私政策和服务条款。", "note_en": "These are dark days for supplements. Although they are a $30-plus billion market in the United States alone, vitamin A, vitamin C, vitamin E, selenium, beta-carotene, glucosamine, chondroitin, and fish oil have now flopped in study after study.\n If there was one supplement that seemed sure to survive the rigorous tests, it was vitamin D. People with low levels of vitamin D in their blood have significantly higher rates of virtually every disease and disorder you can think of: cancer, diabetes, obesity, osteoporosis, heart attack, stroke, depression, cognitive impairment, autoimmune conditions, and more. The vitamin is required for calcium absorption and is thus essential for bone health, but as evidence mounted that lower levels of vitamin D were associated with so many diseases, health experts began suspecting that it was involved in many other biological processes as well.\n And they believed that most of us weren’t getting enough of it. This made sense. Vitamin D is a hormone manufactured by the skin with the help of sunlight. It’s difficult to obtain in sufficient quantities through diet. When our ancestors lived outdoors in tropical regions and ran around half naked, this wasn’t a problem. We produced all the vitamin D we needed from the sun.\n But today most of us have indoor jobs, and when we do go outside, we’ve been taught to protect ourselves from dangerous UV rays, which can cause skin cancer. Sunscreen also blocks our skin from making vitamin D, but that’s OK, says the American Academy of Dermatology, which takes a  zero-tolerance stance on sun exposure: “You need to protect your skin from the sun every day, even when it’s cloudy,” it advises on its website. Better to slather on sunblock, we’ve all been told, and compensate with vitamin D pills.\n Yet vitamin D supplementation has failed spectacularly in clinical trials. Five years ago, researchers were already warning that  it showed zero benefit, and the evidence has only grown stronger. In November,  one of the largest and most rigorous trials of the vitamin ever conducted—in which 25,871 participants received high doses for five years—found no impact on cancer, heart disease, or stroke.\n How did we get it so wrong? How could people with low vitamin D levels clearly suffer higher rates of so many diseases and yet not be helped by supplementation?\n As it turns out, a rogue band of researchers has had an explanation all along. And if they’re right, it means that once again we have been epically misled.\n These rebels argue that what made the people with high vitamin D levels so healthy was not the vitamin itself. That was just a marker. Their vitamin D levels were high because they were getting plenty of exposure to the thing that was really responsible for their good health—that big orange ball shining down from above.\n One of the leaders of this rebellion is a mild-mannered dermatologist at the University of Edinburgh named  Richard Weller. For years, Weller swallowed the party line about the destructive nature of the sun’s rays. “I’m not by nature a rebel,” he insisted when I called him up this fall. “I was always the good boy that toed the line at school. This pathway is one which came from following the data rather than a desire to overturn apple carts.”\n Weller’s doubts began around 2010, when he was researching nitric oxide, a molecule produced in the body that dilates blood vessels and lowers blood pressure. He discovered a previously unknown biological pathway by which the skin uses sunlight to make nitric oxide.\n It was already well established that rates of high blood pressure, heart disease, stroke, and overall mortality all rise the farther you get from the sunny equator, and they all rise in the darker months. Weller put two and two together and had what he calls his “eureka moment”: Could exposing skin to sunlight lower blood pressure?\n Sure enough, when he exposed volunteers to the equivalent of 30 minutes of summer sunlight without sunscreen, their nitric oxide levels went up and their blood pressure went down. Because of its connection to heart disease and strokes, blood pressure is the leading cause of premature death and disease in the world, and the reduction was of a magnitude large enough to prevent millions of deaths on a global level.\n  Wouldn’t all those rays also raise rates of skin cancer? Yes, but skin cancer kills surprisingly few people: less than 3 per 100,000 in the U.S. each year. For every person who dies of skin cancer, more than 100 die from cardiovascular diseases.\n People don’t realize this because several different diseases are lumped together under the term “skin cancer.” The most common by far are basal-cell carcinomas and squamous-cell carcinomas, which are almost never fatal. In fact, says Weller, “When I diagnose a basal-cell skin cancer in a patient, the first thing I say is congratulations, because you’re walking out of my office with a longer life expectancy than when you walked in.” That’s probably because people who get carcinomas, which are strongly linked to sun exposure, tend to be healthy types that are outside getting plenty of exercise and sunlight.\n Melanoma, the deadly type of skin cancer, is much rarer, accounting for only 1 to 3 percent of new skin cancers. And perplexingly, outdoor workers have half the melanoma rate of indoor workers. Tanned people have lower rates in general. “The risk factor for melanoma appears to be intermittent sunshine and sunburn, especially when you’re young,” says Weller. “But there’s evidence that long-term sun exposure associates with less melanoma.”\n These are pretty radical words in the established dermatological community. “We do know that melanoma is deadly,” says  Yale’s David Leffell, one of the leading dermatologists in the country, “and we know that the vast majority of cases are due to sun exposure. So certainly people need to be cautious.”\n Still, Weller kept finding evidence that didn’t fit the official story. Some of the best came from Pelle Lindqvist, a senior research fellow in obstetrics and gynecology at Sweden’s Karolinska Institute, home of the Nobel Prize in Physiology or Medicine. Lindqvist tracked the sunbathing habits of nearly 30,000 women in Sweden over 20 years. Originally, he was studying blood clots, which he found occurred less frequently in women who spent more time in the sun—and less frequently during the summer. Lindqvist looked at diabetes next. Sure enough, the sun worshippers had much lower rates. Melanoma? True, the sun worshippers had a higher incidence of it—but they were eight times less likely to die from it.\n So Lindqvist decided to look at overall mortality rates, and the results were shocking. Over the 20 years of the study, sun avoiders were twice as likely to die as sun worshippers.\n There are not many daily lifestyle choices that double your risk of dying. In a 2016 study published in the  Journal of Internal Medicine, Lindqvist’s team  put it in perspective: “Avoidance of sun exposure is a risk factor of a similar magnitude as smoking, in terms of life expectancy.”\n  The idea that slavish application of SPF 50 might be as bad for you as Marlboro 100s generated a flurry of short news items, but the idea was so weird that it didn’t break through the deadly-sun paradigm. Some doctors, in fact, found it quite dangerous.\n “I don’t argue with their data,” says David Fisher, chair of the dermatology department at Massachusetts General Hospital. “But I do disagree with the implications.” The risks of skin cancer, he believes, far outweigh the benefits of sun exposure. “Somebody might take these conclusions to mean that the skin-cancer risk is worth it to lower all-cause mortality or to get a benefit in blood pressure,” he says. “I strongly disagree with that.&#34; It is not worth it, he says, unless all other options for lowering blood pressure are exhausted. Instead he recommends vitamin D pills and hypertension drugs as safer approaches.\n Weller’s largest study yet is due to be published later in 2019. For three years, his team tracked the blood pressure of 340,000 people in 2,000 spots around the U.S., adjusting for variables such as age and skin type. The results clearly showed that the reason people in sunnier climes have lower blood pressure is as simple as light hitting skin.\n  When I spoke with Weller, I made the mistake of characterizing this notion as counterintuitive. “It’s entirely intuitive,” he responded. “ Homo sapiens have been around for 200,000 years. Until the industrial revolution, we lived outside. How did we get through the Neolithic Era without sunscreen? Actually, perfectly well. What’s counterintuitive is that dermatologists run around saying, ‘Don’t go outside, you might die.’”\n When you spend much of your day treating patients with terrible melanomas, it’s natural to focus on preventing them, but you need to keep the big picture in mind. Orthopedic surgeons, after all, don’t advise their patients to avoid exercise in order to reduce the risk of knee injuries.\n Meanwhile, that big picture just keeps getting more interesting. Vitamin D now looks like the tip of the solar iceberg. Sunlight triggers the release of a number of other important compounds in the body, not only nitric oxide but also serotonin and endorphins. It reduces the risk of prostate, breast, colorectal, and pancreatic cancers. It improves circadian rhythms. It reduces inflammation and dampens autoimmune responses. It improves virtually every mental condition you can think of. And it’s free.\n These seem like benefits everyone should be able to take advantage of. But not all people process sunlight the same way. And the current U.S. sun-exposure guidelines were written for the whitest people on earth.\n  Every year, Richard Weller spends time working in a skin hospital in Addis Ababa, Ethiopia. Not only is Addis Ababa near the equator, it also sits above 7,500 feet, so it receives massive UV radiation. Despite that, says Weller, “I have not seen a skin cancer. And yet Africans in Britain and America are told to avoid the sun.”\n All early humans evolved outdoors beneath a tropical sun. Like air, water, and food, sunlight was one of our key inputs. Humans also evolved a way to protect our skin from receiving too much radiation—melanin, a natural sunscreen. Our dark-skinned African ancestors produced so much melanin that they never had to worry about the sun.\n As humans migrated farther from the tropics and faced months of light shortages each winter, they evolved to produce less melanin when the sun was weak, absorbing all the sun they could possibly get. They also began producing much more of a protein that stores vitamin D for later use. In spring, as the sun strengthened, they’d gradually build up a sun-blocking tan. Sunburn was probably a rarity until modern times, when we began spending most of our time indoors. Suddenly, pasty office workers were hitting the beach in summer and getting zapped. That’s a recipe for melanoma.\n People of color rarely get melanoma. The rate is 26 per 100,000 in Caucasians, 5 per 100,000 in Hispanics, and 1 per 100,000 in African Americans. On the rare occasion when African Americans do get melanoma, it’s particularly lethal—but it’s mostly a kind that occurs on the palms, soles, or under the nails and is not caused by sun exposure.\n  At the same time, African Americans suffer high rates of diabetes, heart disease, stroke, internal cancers, and other diseases that seem to improve in the presence of sunlight, of which they may well not be getting enough. Because of their genetically higher levels of melanin, they require more sun exposure to produce compounds like vitamin D,  and they are less able to store that vitamin for darker days. They have much to gain from the sun and little to fear.\n And yet they are being told a very different story, misled into believing that sunscreen can prevent their melanomas, which Weller finds exasperating. “The cosmetic industry is now trying to push sunscreen at dark-skinned people,” he says. “At dermatology meetings, you get people standing up and saying, ‘We have to adapt products for this market.’ Well, no we don’t. This is a marketing ploy.”\n When I asked the American Academy of Dermatology for clarification on its position on dark-skinned people and the sun, it pointed me back to the official line on its website: “The American Academy of Dermatology recommends that all people, regardless of skin color, protect themselves from the sun’s harmful ultraviolet rays by seeking shade, wearing protective clothing, and using a broad-spectrum, water-resistant sunscreen with an SPF of 30 or higher.”\n This seemed to me a little boilerplate, and I wondered whether the official guidelines hadn’t yet caught up to current thinking. So I asked David Leffell, at Yale. “I think that sun-protection advice,” he told me, “has always been directed at those most at risk”—people with fair skin or a family history of skin cancer. “While it is true that people with olive skin are at less risk, we do see an increasing number of people with that type of skin getting skin cancer. But skin cancer... is very rare in African Americans... and although they represent a spectrum of pigmentation, [they] are not at as much risk.”\n Still, David Fisher at Mass General didn&#39;t think that changed the equation. “There’s a pharmacopoeia of drugs that are extremely effective at lowering blood pressure,” he said. “So to draw the conclusion that people should expose themselves to an elevated skin-cancer risk, including potentially fatal cancer, when there are so many alternative treatments for hypertension, is problematic.”\n  Am I willing to entertain the notion that current guidelines are inadvertently advocating a lifestyle that is killing us?\n  In the 1970s, as nutritionists began to see signs that people whose diets were high in saturated fat and cholesterol also had high rates of cardiovascular disease, they told us to avoid butter and choose margarine, which is made by bubbling hydrogen gas through vegetable oils to turn them into solid trans fats.\n From its inception in the mid-1800s, margarine had always been considered creepers, a freakish substitute for people who couldn’t afford real butter. By the late 1800s, several midwestern dairy states had banned it outright, while others, including Vermont and New Hampshire, passed laws requiring that it be dyed pink so it could never pass itself off as butter. Yet somehow margarine became the thing we spread on toast for decades, a reminder that even the weirdest product can become mainstream with enough industry muscle.\n Eventually, better science revealed that the trans fats created by the hydrogenation process were far worse for our arteries than the natural fats in butter. In 1994, Harvard researchers estimated that 30,000 people per year were dying unnecessarily thanks to trans fats. Yet they weren’t  banned in the U.S. until 2015.\n Might the same dynamic be playing out with sunscreen, which was also remarkably sketchy in its early days? One of the first sunscreens, Red Vet Pet (for Red Veterinary Petrolatum) was a thick red petroleum jelly  invented in 1944 to protect soldiers in the South Pacific;  it must have been eerily reminiscent of pink margarine. Only after Coppertone bought the rights and reformulated Red Vet Pet to suit the needs of the new midcentury tanning culture did sunscreen take off.\n However, like margarine, early sunscreen formulations were disastrous, shielding users from the UVB rays that cause sunburn but not the UVA rays that cause skin cancer. Even today, SPF ratings refer only to UVB rays, so many users may be absorbing far more UVA radiation than they realize. Meanwhile, many common sunscreen ingredients have been found to be hormone disruptors that can be detected in users’ blood and breast milk. The worst offender, oxybenzone, also mutates the DNA of corals and is believed to be killing coral reefs. Hawaii and the western Pacific nation of Palau have already banned it, to take effect in 2021 and 2020 respectively, and other governments are expected to follow.\n The industry is now scrambling to move away from oxybenzone, embracing opaque, even neon, mineral-based formulations, a fashion statement reminiscent of the old Red Vet Pet. But with its long track record of pushing products that later turn out to be unhealthy, I remain skeptical of industry assurances that it finally has everything figured out. We are always being told to replace something natural with some artificial pill or product that is going to improve our health, and it almost always turns out to be a mistake because we didn’t know enough. Multivitamins can’t replace fruits and vegetables, and vitamin D supplements are clearly no substitute for natural sunlight.\n  Old beliefs don’t die easily, and I can understand if you remain skeptical of old Sol. Why trust one journalist and a handful of rogue researchers against the august opinions of so many professionals?\n Here’s why: many experts in the rest of the world have already come around to the benefits of sunlight. Sunny Australia changed its tune back in 2005. Cancer Council Australia’s official-position paper (endorsed   by the Australasian College of Dermatologists) states, “Ultraviolet radiation from the sun has both beneficial and harmful effects on human health.... A balance is required between excessive sun exposure which increases the risk of skin cancer and enough sun exposure to maintain adequate vitamin D levels.... It should be noted that the benefits of sun exposure may extend beyond the production of vitamin D. Other possible beneficial effects of sun exposure… include reduction in blood pressure, suppression of autoimmune disease, and improvements in mood.”\n  Australia’s official advice? When the UV index is below 3 (which is true for most of the continental U.S. in the winter), “Sun protection is not recommended unless near snow or other reflective surfaces. To support vitamin D production, spend some time outdoors in the middle of the day with some skin uncovered.” Even in high summer, Australia recommends a few minutes of sun a day.\n New Zealand signed on to similar recommendations, and the British Association of Dermatologists went even further in a statement, directly contradicting the position of its American counterpart: “Enjoying the sun safely, while taking care not to burn, can help to provide the benefits of vitamin D without unduly raising the risk of skin cancer.”\n Leffell, the Yale dermatologist, recommends what he calls a “sensible” approach. “I have always advised my patients that they don’t need to crawl under a rock but should use common sense and be conscious of cumulative sun exposure and sunburns in particular,” he told me.\n This does not mean breaking out the baby oil or cultivating a burnished tan. All the experts agree that sunburns—especially those suffered during childhood and adolescence—are particularly bad.\n Ultimately, it’s your call. Each person’s needs vary so much with season, latitude, skin color, personal history, philosophy, and so much else that it’s impossible to provide a one-size-fits-all recommendation.  The Dminder app, which uses factors such as age, weight, and amount of exposed skin to  track the amount of sunlight you need for vitamin D production, might be one place to start. Trading your sunscreen for a shirt and a broad-brimmed hat is another. Both have superior safety records.\n As for me, I’ve made my choice. A world of healthy outdoor adventure beckons—if not half naked, then reasonably close. Starting today, I’m stepping into the light.\n You are now subscribed to  Bodywork We will not share your email with anyone for any reason. Find more newsletters on our  newsletter sign-up page.\n This site is protected by reCAPTCHA and the Google  Privacy Policy and  Terms of Service apply.", "posttime": "2020-05-06 07:56:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "防晒霜,sunscreen,阳光,sun", "title": "防晒霜是新的人造黄油吗？(2019年)", "title_en": "Is Sunscreen the New Margarine? (2019)", "transed": 1, "url": "https://www.outsideonline.com/2380751/sunscreen-sun-exposure-skin-cancer-science", "via": "", "real_tags": ["防晒霜", "sunscreen", "阳光", "sun"]}, {"category": "", "categoryclass": "", "imagename": "483d8c4296fe68d9e6092fa67b94b55e.jpg", "infoid": 1000861, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这辆SUV的司机在高速公路上以大约每小时32英里的速度转弯，犹他州公路巡逻队的一名警察发现了他，并将他拦在了路边。\n骑兵看不到座椅靠背上方的头，他认为司机可能受到了伤害。\n但当他周一走近司机侧窗时，这名警察对他所看到的感到惊讶：一个穿着犹他州皇家队(Utah Royals)灰色足球连帽衫的小男孩。\n“你才5岁。哇！“。骑兵里克·摩根(Rick Morgan)在交通拦截的仪表盘摄像头视频中说。然后他问他：“好吧，你在哪里学会开车的？”\n当局称，这名身份不明的男孩在盐湖城以北约38英里的城市奥格登的15号州际公路南行车道被拦下之前，他设法开车离开了家约两到三英里。\n公路巡逻队在社交媒体上分享了这一事件的视频和细节，很快就引起了人们的关注。和这名骑兵一样，人们也想知道：这个男孩是怎么走到这么远的地方的，而没有造成车辆受伤或损坏？他想去哪里？他在哪里学会开车的？\n在周一的新闻发布会上，骑兵摩根说，“当窗户落下时，我不太确定该怎么想。”\n“当我看到司机时，这绝对不是我所期待的，”他补充说。\n他说，男孩坐在座位的前缘，“这样他就可以够到刹车踏板了。”目前还不清楚他能从挡风玻璃里看得多清楚。警察帮助孩子把车放到停车的位置并把它关掉。\n“但他坚持说他5岁，他的家人确认他5岁，下个月他就6岁了，”骑兵摩根说。\n这名士兵说，这名男孩给出了简短或一个词的答案，在停车期间几乎要哭了。据公路巡逻队称，男孩解释说，他是在与母亲发生争执后离开家的。\n公路巡警在推特上说：“她告诉他，她不会给他买兰博基尼。”“他决定开车去加州自己买一辆。”\n在仪表盘摄像头的视频中，可以听到男孩告诉警察，他的妹妹住在加利福尼亚州，他正试图去她那里的家。这名士兵说，这名男孩钱包里有3美元，当时他正在前往该州的路上。\n“他已经为这次旅行做好了一切准备，”骑兵摩根在新闻发布会上说。“令我吃惊的是，当他听到我的警报器时，他确实靠边停车了。”\n高速公路巡警说，男孩的父母一直在工作，他开车时正和一名兄弟姐妹在家中。当警察找到他们时，他的父母正在找他们的儿子。\n当局说，这辆车的钥匙被留在了这家人住处的挂钩上。据骑兵摩根说，男孩的父母说，“他以前没有开过车，这是他第一次做这样的事情。”\n骑兵摩根还敦促父母们，总的来说，要尽可能密切关注他们的孩子。他说：“孩子们都是孩子，他们脑子里有一个想法，却没有意识到要做什么才能做到这一点，我认为这就是这里发生的事情。”“一个年轻人决定去加州买一辆车。他抓起钥匙就走了。“。\n公路巡警发言人尼克·斯特里特(Nick Street)中尉说，在他上路的那段时间，他看到了一些12岁和14岁的孩子开车的案例，这让他感到惊讶。\n当被问及周一的事件时，他说，“一个5岁的孩子竟然会开车、上高速公路、从加州到目的地的正确方向，这让人非常震惊。”\n“此案正在筛选过程中，”他说，并补充说韦伯县检察官办公室可能会提出指控或将案件交给奥格登的较小级别法院。\n骑兵摩根说，男孩可能意识到情况有问题，尽管他可能没有完全理解。“我确实认为他可能上了一堂人生课，”他说。“我认为我们不会很快再看到他处于这种情况.”", "note_en": "The driver of the SUV swerved on the freeway at about 32 miles per hour when a trooper for the Utah Highway Patrol spotted and pulled him over.\n The trooper could not see a head above the seat’s headrest, and thought the driver might have been impaired.\n But when he approached the driver’s side window on Monday, the trooper was surprised by what he saw: a young boy wearing a gray Utah Royals soccer hoodie.\n “You’re 5 years old. Wow!” the trooper, Rick Morgan, said in the  dash camera video of the traffic stop. He then asked him, “OK, where did you learn how to drive a car?”\n The boy, who was not identified, had managed to drive about two to three miles from his home before he was pulled over in the southbound lane of Interstate 15 in Ogden, a city about 38 miles north of Salt Lake City, according to the authorities.\n The Highway Patrol shared  video and details of the episode on social media, where it quickly gained attention. Like the trooper, people wondered: How did the boy manage to get so far without injury or damage to the vehicle? Where was he trying to go? And where did he learn to drive?\n During a  news conference Monday, Trooper Morgan said that “when the window came down, I wasn’t quite sure what to think.”\n  “It absolutely was not what I was expecting when I saw the driver,” he added.\n He said the boy was sitting on the front edge of the seat “so that he could reach the brake pedal.” It was not clear how well he could see through the windshield. The trooper helped the child to put the car into park position and to shut it down.\n “But he insisted he was 5, and his family confirmed he’s 5 years old and he will be 6 next month,” Trooper Morgan said.\n The boy, who gave short or one-word answers, was on the verge of tears during the stop, the trooper said. The boy explained that he left home after an argument with his mother, according to the Highway Patrol.\n “She told him she would not buy him a Lamborghini,” the Highway Patrol said in a  tweet. “He decided to take the car and go to California to buy one himself.”\n  In the dash cam video, the boy is heard telling the trooper that his sister lives in California, and that he was trying to get to her house there. The boy had $3 in his wallet, the trooper said, and was heading on a road toward the state.\n “He was all set to make the trip,” Trooper Morgan said at the news conference. “It amazed me that when he heard my siren that he did pull over and stop.”\n The Highway Patrol said that the boy’s parents had been at work and that he was with a sibling at home when he took the car. His parents were looking for their son when the police reached them.\n The keys to the vehicle had been left on a hook at the family’s residence, the authorities said. The boy’s parents said that “he’d not driven before, this was the first time he’d done anything like this,” according to Trooper Morgan.\n Trooper Morgan also urged parents, generally, to keep a close eye on their children as best they could. “Kids are kids and they get an idea in their head and don’t realize what it takes to pull that off, and I think that’s what happened here,” he said. “Young man decided he wanted to go to California and buy a car. He grabbed the keys and he was off.”\n Lt. Nick Street, a spokesman for the Highway Patrol, said that during his time on the road, he had seen some cases of 12- and 14-year-old children driving cars that surprised him.\n Asked about Monday’s episode, he said it was “very shocking that a child, age 5, would know how to drive, get on the freeway and go the right direction to California to his destination.”\n “The case is in the screening process,” he said, adding that the Weber County Attorney’s Office may file charges or give the case to a lesser court in Ogden.\n Trooper Morgan said that the boy probably realized something was wrong with the situation, though he might not have understood it completely. “I do think he’s probably had a life lesson,” he said. “I don’t think we’ll see him in the situation again soon.”", "posttime": "2020-05-06 07:43:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "犹他州,boy,男孩,trooper", "title": "5岁男孩在从犹他州开往加利福尼亚州的高速公路上停车", "title_en": "Five-year-old boy stopped on highway driving from Utah to California", "transed": 1, "url": "https://www.nytimes.com/2020/05/05/us/utah-boy-driver.html", "via": "", "real_tags": ["犹他州", "boy", "男孩", "trooper"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000860, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用Mac Pro Wheels Kit，让您的Mac Pro骑在轮子上。定制设计的不锈钢和橡胶轮子让您可以轻松地移动Mac Pro，无论它是从办公桌下面滑出来还是从工作室滑出来。\n需要安装。包括一个4毫米(1/4英寸)的六角钻头，但还需要其他工具。用轮子替换Mac Pro脚板会使框架的高度增加约25 mm。", "note_en": "Put your Mac Pro on wheels with the Mac Pro Wheels Kit. The custom-designed stainless steel and rubber wheels make it easy to move your Mac Pro around, whether sliding it out from under your desk or across your studio.\n  Installation required. A 4-mm (1/4-inch) hex bit is included, but additional tools are necessary. Replacing the Mac Pro feet with wheels adds approximately 25mm to the height of the frame.", "posttime": "2020-05-06 07:32:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,apple,mac,wheels", "title": "Apple Mac Pro Wheels套件", "title_en": "Apple Mac Pro Wheels Kit", "transed": 1, "url": "https://www.apple.com/au/shop/product/MX572FE/A/apple-mac-pro-wheels-kit", "via": "", "real_tags": ["app", "apple", "mac", "wheels"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000859, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GitHub是5000多万开发人员的家园，他们一起工作，共同托管和审查代码、管理项目和构建软件。\n报名", "note_en": "GitHub is home to over 50 million developers working together to host and review code, manage projects, and build software together.\n  Sign up", "posttime": "2020-05-06 07:32:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "c++,编程,编译,审查,build", "title": "Circle-具有编译时命令式元编程的C++编译器", "title_en": "Circle – A C++ compiler with compile time imperative metaprogramming", "transed": 1, "url": "https://github.com/seanbaxter/circle", "via": "", "real_tags": ["c++", "编程", "编译", "审查", "build"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000858, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它过去有409本英文书(在我的机器上下载大约14 GB的PDF和EPUB需要大约4个小时)，但斯普林格后来将其中一些从开放访问中删除了。\n注意：如果您只想要一本或两本特定的图书，请获取Excel文件并手动下载，或者使用脚本帮助您下载(请参阅选择性下载图书小节)。\n默认情况下，脚本根据主题(Excel文件的&#34；英语包名称&#34；列)将图书存储在./downloads子文件夹中。\n使用以下命令将所有PDF和EPUB图书下载到默认下载文件夹。/downloads。\n您可以按类别下载精选图书。确保带空格的类别名称用双引号引起来，如下所示。\n如果需要知道要下载的内容，请使用-v选项启用详细模式。\npython3main.py-v-c&#34；行为科学和心理学；混沌AD&34；UFO&34；生命科学&#34；-i 2 34 400。\n英文书名2所有统计学、数学和统计学34基本天体物理和天文学37心理治疗的国际观点行为科学和心理学40应用行为分析行为科学和心理学70感知心理学行为科学和心理学95消费金融研究行为科学和心理学手册311医疗家庭治疗的临床方法行为科学和心理学313动机与行动行为科学和心理学。忽略：1.混沌公元2.不明飞行物3.生命科学。\n只需在Windows资源管理器中双击Run_VirtualEnv.bat文件，或在命令行中键入其名称，然后按Enter键。首先从python.orgor或Microsoft Store for Windows 10安装Python。\n在MacOS上，如果脚本产生[SSL：CERTIFICATE_VERIFY_FAILED]错误，则可能需要安装安全证书。执行此操作的说明可在此处找到。如果这不起作用，请参阅此处的替代说明。", "note_en": "It used to have 409 english books (it took about 4 hours to complete the download ~ 14 GB, both PDF and EPUB, on my machine), but Springer has since removed some of them from the open access.\n  Note: If you want just one or two specific books, get  the excel file and manually download those or use the script to help you download (see  Download book selectively sub-section).\n By default the script stores the books in  ./downloads subfolder according to the subject (&#34;English Package Name&#34; column of the excel file).\n  Use the following command to download all PDF and EPUB books to the default download folder  ./downloads\n            You can download selective books by categories. Make sure category name with space(s) is enclosed in double quotation marks, like so\n       If you need to know what you are downloading, enable the verbose mode with  -v option\n python3 main.py -v -c   &#34;Behavioral science and psychology &#34;   &#34;chaos AD &#34; UFO   &#34;Life science &#34; -i 2 34 400\n  Book Title English Package Name2 All of Statistics Mathematics and Statistics34 Essential Astrophysics Physics and Astronomy37 International Perspectives on Psychotherapy Behavioral Science and Psychology40 Applied Behavior Analysis Behavioral Science and Psychology70 Psychology of Perception Behavioral Science and Psychology95 Handbook of Consumer Finance Research Behavioral Science and Psychology311 Clinical Methods in Medical Family Therapy Behavioral Science and Psychology313 Motivation and Action Behavioral Science and Psychology381 Perceptual Organization Behavioral Science and Psychology396 Evidence-Based Practice in Clinical Social Work Behavioral Science and Psychology397 Foundations of Behavioral Health Behavioral Science and Psychology398 Social Psychology in Action Behavioral Science and Psychology400 A Course in Rasch Measurement Theory Education13 titles ready to be downloaded...The following invalid book categories will be ignored: 1. chaos AD 2. UFO 3. Life science\n    Just double-click the  run_VirtualEnv.bat file from Windows Explorer, or type-in its name at the command-line and press ENTER.Do install Python first, either from  python.orgor from the  Microsoft Store for Windows 10.\n               On macOS, if the script produces a  [SSL: CERTIFICATE_VERIFY_FAILED] error, then security certificates may need to be installed. Instructions for doing so can be found  here. If that doesn&#39;t work, see alternate instructions  here.", "posttime": "2020-05-06 07:32:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,python,下载,发布,图书", "title": "下载Covid期间免费发布的所有Springer图书的Python脚本", "title_en": "Python script to download all Springer books released for free during Covid", "transed": 1, "url": "https://github.com/alexgand/springer_free_books", "via": "", "real_tags": ["免费", "python", "下载", "发布", "图书"]}, {"category": "", "categoryclass": "", "imagename": "3ca1f391c13943db0f29832602147d82.png", "infoid": 1000857, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "早在2月份，我们就宣布支持Firefox Preview的第一次扩展，Firefox Preview是一款全新的Android移动浏览器，将在今年晚些时候取代Firefox for Android。\n自那以后，我们已经扩展了对推荐扩展程序中更多插件的支持，我们想向您介绍这些插件。这些附加组件将在接下来的两周内在Firefox Preview中推出。\n有了黑暗阅读器，在灯光昏暗的情况下，手机上的网站将很容易阅读。该扩展自动反转网页上的亮色，以提供赏心悦目的深色模式。有许多配置选项允许您自定义您的体验。\n当你在路上时，你不想让别人窃听你的浏览行为。HTTPS Everywhere会自动为默认为未加密通信的页面启用网站加密。如果您是通过共享WiFi连接冲浪，这一点尤其有用。\n如果您担心潜在的恶意Web内容，NoScript可以通过禁止在网站上运行潜在的恶意脚本来防范大量的Web安全漏洞攻击。您可以微调NoScript的配置，并仅允许脚本在您信任的站点上运行。\n担心广告商和其他第三方跟踪者在网络上跟踪你？Privacy Badger很好地补充了Firefox内置的跟踪保护功能。该扩展会自动获知网站何时开始跟踪你，并将结束侵犯隐私的行为。它还包括额外的隐私保护，如阻止链接跟踪。\n如果你经常说“我以前在哪里见过那张照片”，那么按图片搜索对你来说是正确的扩展。在这个扩展的帮助下，您可以选择图像并将它们输入到来自20多个搜索引擎的反向图像搜索中。\n我们要感谢这些插件的开发者对Firefox Preview的支持。开发人员已经做了一些很大的调整来优化他们的移动扩展，并且很高兴与他们交谈。\n虽然我们很高兴能提供这六个极力推荐的插件作为起点，但很明显，插件开发者有更多可以增强移动浏览体验的扩展想法。我们打算在接下来的几个月内从推荐的扩展程序中启用更多的附加组件，并将很快接触到开发人员。", "note_en": "Back in February, we announced support for the first extension for  Firefox Preview, the new and rebuilt mobile browser for Android that is set to replace Firefox for Android later this year.\n We’ve since expanded support for more add-ons from the  Recommended Extensions program that we’d like to introduce to you. These add-ons will be available in Firefox Preview within the next 2 weeks.\n With   Dark Reader, websites on mobile will be easy to read when the lights are dim. The extension automatically inverts bright colors on web pages to offer an eye-pleasing dark mode. There are a number of configuration options allowing you to customize your experience.\n When you are on the go, you don’t want people eavesdropping on your browsing behavior.   HTTPS Everywhere automatically enables website encryption for pages that default to unencrypted communications. This is especially helpful if you are surfing via a shared wifi connection.\n If you are worried about potentially malicious web content,   NoScript protects against a number of web security exploits by disabling potentially malicious scripts from running on websites. You can fine-tune the configuration of NoScript and permit scripts to run only on sites you trust.\n Concerned about advertisers and other third-party trackers from following you around the web?   Privacy Badger nicely complements Firefox’s built-in tracking protection. The extension automatically learns when websites start tracking you and will put an end to the privacy invasion. It also includes additional privacy protections like block link tracking.\n If you’ve said “now where did I see that picture before” once too often, then   Search by Image is the right extension for you. With the help of this extension you can select images and feed them into reverse image searches from more than 20 search engines.\n We’d like to thank the developers of these add-ons for supporting Firefox Preview. The developers have made some great adjustments to optimize their extensions for mobile and have been a pleasure to talk to.\n While we’re pleased to offer these six highly recommended add-ons as a starting point, it’s clear that add-on developers have more great ideas for extensions that can enhance the mobile browsing experience. We intend to enable more add-ons from the Recommended Extensions program within the next few months and will be reaching out to developers soon.", "posttime": "2020-05-06 07:31:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "firefox,mobile,扩展", "title": "新的Firefox for Mobile现在支持NoScript、PrivacyBadger、HTTPSEverywhere", "title_en": "The New Firefox for Mobile Now Supports NoScript, PrivacyBadger, HTTPSEverywhere", "transed": 1, "url": "https://blog.mozilla.org/addons/2020/04/14/april-extensions-for-firefox-preview/", "via": "", "real_tags": ["firefox", "mobile", "扩展"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000856, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GraphQLize的第三次迭代按计划进行得很好，GraphQLize中的过滤器刚刚变得更好：)。\n让我们来看看GraphQLize有哪些新功能，接下来两周将会有哪些功能。\n或者在语法上与和相似。它既接受单个条件，也接受条件列表。\n在上一次迭代期间添加的另一个主要功能是基于嵌套对象的字段过滤结果对象。\n例如，要获取使用上述架构中的国家名称的国家的所有城市，我们可以将其查询为。\n如果嵌套对象与其父对象具有一对多关系，则如果至少有一个嵌套对象的字段满足条件，则筛选条件会产生结果。\n对于上面的模式，我们可以使用下面的查询获得至少有一个城市以Ab开头的国家/地区列表。\n基于具有多对多关系的嵌套对象的筛选器与一对多关系的筛选器的行为相同。\n对于上面的方案，让演员参与至少一部片名中有“生活”这个词的电影。\n要过滤至少有一门课程评分为5的作者，我们可以使用以下查询来实现。\n如果我们只想过滤所有课程得分为5的作者，我们可以通过以下方式来实现。\n我们在这里使用SQL反连接，使用NOT反转整个条件，并使用其反转(neq代替eq)补充内部条件。\nGraphQLize提供了一个特殊的过滤器参数，可以基于子对象的存在进行过滤。例如，在上面的架构中，如果我们希望只过滤有课程的作者，可以使用以下查询来实现。\n假设，如果我们要过滤没有课程的作者，我们可以在过滤器中使用NOT和HAVE。\nGraphQLize的下一次迭代的重点是添加对SQL聚合函数的支持。", "note_en": "The third iteration of  GraphQLize went well as planned and the filters in GraphQLize just got better :).\n Let&#39;s take a peek at what&#39;s new in GraphQLize and what is in the pipeline for the next two weeks.\n         or is similar to  and in syntax. It accepts both a single condition or a list of conditions.\n      Another major feature that was added during the last iteration is filtering the resulting objects based on the fields of a nested object(s).\n   For example, to get all the cities of a country using the country&#39;s name in the above schema, We can query it as\n   If the nested object has  one-to-many relationship with its parent, the filter condition yield the results if  at-least one of the nested object&#39;s field(s) satisfy the condition.\n For the above schema, we can get a list of countries which has at-least one city that starts with  Ab using the below query.\n   A filter based on a nested object with the  many-to-many relationship behaves the same as that of  one-to-many.\n  For the above schema, to get the actors who are part of  at-lease one film which has the word  LIFE in its title.\n    To filter authors who has  at-least one course with the rating  5, we can achieve it using the following query.\n  If we want to filter only the authors who has got the rating  5 in  all their courses, we can achieve it by\n  We are making use of  SQL anti-join here by inverting the whole condition using  not and complementing the inner condition using its reverse ( neq in the place of  eq).\n  GraphQLize provides a special filter parameter  have to filter based on the existence of child objects. For example, in the above schema, if we&#39;d like to filter only the authors who have courses, it can be achieved using the following query.\n  Suppose, if we want to filter authors who don&#39;t have  courses, we can make use of the  not in addition to  have in the filter.\n    The focus of the next iteration of GraphQLize is adding support for SQL aggregate functions.", "posttime": "2020-05-06 07:20:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "graphql,运算符,operators,condition", "title": "GraphQLize更新(#3)-逻辑运算符和按嵌套对象过滤", "title_en": "GraphQLize Update (#3) – Logical Operators and Filter by nested objects", "transed": 1, "url": "https://www.graphqlize.org/blog/graphqlize-update-3/", "via": "", "real_tags": ["graphql", "运算符", "operators", "condition"]}, {"category": "", "categoryclass": "", "imagename": "c4626fd5b9cc494942753b7b209a5558.jpg", "infoid": 1000855, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大约四年前，当安-玛丽·梅迪根(Ann-Marie Madigan)第一次遇到冥王星轨道之外可能潜伏着一颗未被探测到的大质量行星的想法时，她感到兴奋，但也持怀疑态度。当时和现在，存在这样一个世界的证据仍然是间接的：已知太阳系外围的小物体的轨道上出现了奇怪的图案。“九号行星”(冥王星不再计入太阳系的行星总数)的支持者说，这样的模式可能是由那个世界强大的引力影响产生的。但是，现供职于科罗拉多博尔德大学的天体物理学家梅迪根想知道，其他一些平淡无奇的解释是否就足够了。当时，她正在研究恒星如何在围绕超大质量黑洞旋转时相互推挤进入不同的轨道。她看不出为什么她的工作不能同样适用于绕太阳运行的更微小的物体。\n今天，梅迪根和她的几位合作者已经从这些微不足道的开始，发展出了一种完全不同的理论来解释太阳系外的奇特之处：远离冥王星的扩散的、散乱的(目前为止基本上是假设的)冰块的“集体引力”可能会改变我们很容易看到的遥远物体的轨道，类似于一颗大行星的效果。这样的圆盘将由数百万个小天体组成，其中大部分是很久以前太阳系形成时留下的。\n“我们正在做的是考虑所有这些小天体之间的引力，”梅迪根说。“事实证明，把这些引力包括在内真的很重要。”她坚持认为，只要假定的圆盘在10亿年左右的时间里拥有足够的质量-几倍于地球的质量-它的组成成员之间和来自其成员的微小引力相互作用可能会以九号行星所解释的其他方式塑造跨冥王星的外太阳系。其效果将有点像谚语中的蝴蝶拍打着翅膀，最终掀起一场遥远的风暴。\n梅迪根和她的研究生亚历山大·兹德里克(Alexander Zderic)现在已经在预印服务器arxiv.org上发布的两项新研究中提出了他们的理论。在提交给《天文学杂志》(The Astronomical Journal)的一篇文章中，他们展示了集体引力如何能够产生与十几个物体相同的倾斜和聚集轨道，这些物体的距离是地球和太阳之间距离的250倍-其他人将这种观测归因于可能的九星。在另一篇正在“天体物理杂志快报”(AstroPhysical Journal Letters)上发表的论文中，他们认为，如果有足够的时间，集体引力也可以解释遥远轨道上的某些物体在绕太阳旋转时会如何移动，这也被认为是一颗看不见的行星的证据。\n从梅迪根和她的团队的这项工作中，关于太阳系可能的历史的另一幅图景开始浮现。在早期，木星、土星、天王星和海王星在紧凑、有序的轨道上结合在一起，有点靠近我们的恒星，后来由于引力的相互作用，这些恒星才向外迁移。当时，这些世界被一大群残骸包围着，这些残骸从未找到通往行星的道路-巨大的行星最终踢出了冰冷的天体。大多数人被排斥在梅迪根所说的“原始散乱的圆盘”中，这个圆盘超出了今天的冥王星的疆域。她认为，盘中的质量可能比其他研究人员通常认为的要多得多。冰体被推进到远离圆形轨道的环中，组成了一个不稳定的系统-很像一个摇摇晃晃、摇摇欲坠的旋转的顶部。这个系统施加了引力效应，同时它逐渐稳定下来，一些轨道共享相似的平面和方向。当然，这种构型本质上反映了人们对一颗未被发现的大型外行星隐藏的引力之手的期望。\n“集体引力可以给你所有关键的观测特征，这意味着你不需要任何新的东西。梅迪根说，我认为奥卡姆的剃须刀会让你相信这是“比行星九更简单的解决方案”。\n加州理工学院(California Institute Of Technology)天体物理学家迈克·布朗(Mike Brown)和康斯坦丁·巴蒂金(Konstantin Batygin)自2016年初发布了一项关于行星9假说的轰动研究以来，一直是该假说的两位最重要的支持者，他们也一直在磨练自己关于世界存在的论点。为了与最新的观测结果相匹配，研究人员认为，九号行星的质量必须是地球的5到10倍，它的位置必须是地球到太阳距离的400到800倍-比他们最初提出的略小一些，也更近一些。\n巴蒂金说，他对梅迪根关于遥远的碎片环的想法很感兴趣。但他认为太阳系并不是这样的。“如果有这样一个光环停在(离我们的太阳)很远的地方，你就会遇到它在地球上稳定性的问题。”\n梅迪根在她的新模拟中对时间进行了仔细的调整，解决了这个问题：如果在年轻的太阳系离开其恒星托儿所，形成巨型行星后，分散的圆盘组装在一起，它可以持续亿万年。这样的调整并不是微不足道的：精确地模拟碎片盘的集体重力需要在相当于数亿年的时间里，在计算机模型中跟踪数千个或更多漂浮和旋转的粒子的运动和相互作用。梅迪根说，这项任务比对单个行星的影响进行建模要艰巨得多，这在一定程度上就是为什么她和她的团队经常似乎比支持九号行星的队伍落后一步。\n到目前为止，与行星九相比，梅迪根的想法在科学界并没有得到太多关注。但随着望远镜对这颗行星的搜索继续一无所获，这种情况可能即将改变。“我们是少数，但我们正在成长，”她说。“在太阳系中，集体引力还没有真正被研究过。这个领域才刚刚开始腾飞。“。\n至少另外两个研究小组也已经开始研究各种引力效应和动力学，作为九号行星的替代方案。类似地，它们要么涉及一个岩石天体的圆盘，要么涉及数量较少的较大天体，它们的引力影响，在数十亿年前，也可能撼动早期太阳系，创造出后冥王星时代碎片的特殊轨道。\n新泽西州普林斯顿高级研究所的天体物理学家斯科特·特雷曼(Scott Tremaine)说：“梅迪根所做的事情的吸引力在于，这是一种完全不同的方式来解释这些遥远的轨道发生了什么。”然而，他指出了梅迪根提议的一个挑战：她的集体引力假说要求分散的圆盘上有太多的冰体，以至于它们加起来就是一个相当大的质量。除非在某个时刻，这个圆盘的总质量大约是地球的20倍，位置与太阳的距离大约是地球的几百倍，否则它将没有足够的重量来充分重新配置外部太阳系，以反映天文学家目前看到的情况。通过跟踪彗星的轨道，天文学家已经对那里肯定有多少质量有了一个模糊的想法。而一个足够大的圆盘足以让梅迪根的想法发挥作用，它位于看起来可能的最高端。\n在解释天文学家观测到的太阳系外异常星团的竞赛中，除了集体引力和行星九之外，还有另一个黑马候选者：也许这两个假设都是错误的。也许，事实上，根本没有集群。天文学家搜索小天体的方法和用于整体研究它们的统计数据的偏差可能会导致截然不同的结论-其中一些人认为观察到的星团是虚幻的。\n新西兰坎特伯雷大学的天文学家米歇尔·班尼斯特(Michele Bannister)是该合作项目的成员，他说：“在外太阳系起源调查中，我们没有强有力的证据支持星系团。”这项调查的设计使她和她的同事有可能发现以前从未见过的极其微弱的身体，并更系统地评估它们是否以一种不太可能的形式聚集在一起。他们发现的遥远物体可能只是均匀分布的更大群体的一部分。暗能量调查成员的新发现得出了类似的结论，但他们也只发现了少数几个物体。\n在浩瀚的黑暗中只看到少量图案和结构的少量统计数据的现实，使得测试关于外太阳系的想法变得极其困难-包括搜索一颗隐藏的行星或散落的天体的圆盘。到目前为止，在那里发现的一切都是昏暗、黑暗和微小的。许多行星是如此遥远，它们需要几千年才能绕太阳旋转一周，这使得天文学家更难有效地确定它们的轨道特性。\n除了解释已经做出的观察之外，梅迪根和她的同事们已经开始做出预测。如果他们是正确的，那么遥远物体的轨道应该会有一个巨大的缺口：这个区域几乎完全没有碎片，中心大约是地球到太阳距离的50倍。如果九号行星存在，那么就不应该有这么大的差距。班尼斯特说：“我很高兴地看到，随着太阳系深处的规划，它正在创造这种理论热情和创新。”他指的是集体引力和九号行星。\n虽然梅迪根、巴蒂金和其他天体物理学家整理了更多的间接证据来证明他们的观点，并寻找新的预测来验证，但他们也在等待来自更灵敏的即将到来的望远镜的观测，希望直接解决这场争论。维拉·C·鲁宾天文台建在智利北部的一座沙漠山脉上，将以比以前更深入和更精确的方式绘制太阳系外部的小天体地图。而望远镜最早将在2021年秋天看到“第一缕曙光”。\n“太阳系外正在发生一些非常奇怪的事情，那里肯定有更多的质量。梅迪根说：“如果鲁宾天文台没有观测到[我们假想的圆盘]，那么它就不在那里--然后它就是行星九。”“不是其中之一，就是另一个。”", "note_en": "Some four years ago, when Ann-Marie Madigan first encountered the idea that there might be an undetected massive planet lurking beyond Pluto’s orbit, she felt excited but skeptical. The evidence for such a world was then—and now remains—circumstantial: strange patterns in the orbits of small objects at the outskirts of the known solar system. Proponents of “Planet Nine” (Pluto no longer counts in the solar system’s planetary tally) say such patterns could be produced by that world’s hefty gravitational influence. But Madigan, an astrophysicist now at the University of Colorado Boulder, wondered whether some other, more prosaic explanation could suffice. At the time, she was studying how stars can jostle one another into different orbits as they whirl around supermassive black holes. And she saw no reason why her work could not also apply to tinier things orbiting our sun.\n  Today, from those modest beginnings, Madigan and a few of her collaborators have developed a totally different theory to explain the strangeness in the outer solar system: the “collective gravity” of a diffuse, sprawling (and so far largely hypothetical) disk of icy debris far beyond Pluto could alter the orbits of the far distant objects we readily see in a way that resembles the effect of a large planet. Such a disk would be composed of millions of small bodies, most of them left over from the solar system’s formation long ago.\n  “What we’re doing is taking the gravitational forces between all these small bodies into account,” Madigan says. “Including those gravitational forces turns out to be really important.” Provided the putative disk possessed sufficient mass—several times that of Earth—over a billion years or so, the tiny gravitational interactions between and from its constituent members could sculpt the trans-Plutonian outer solar system in ways otherwise explained by Planet Nine, she maintains. The effect would be a bit like the proverbial butterfly flapping its wings to eventually set a distant storm in motion.\n  Madigan and her graduate student Alexander Zderic have now advanced their theory in two new studies posted on the preprint server arXiv.org. In  one, submitted to the  Astronomical Journal, they show how collective gravity can produce the same kinds of tilted and clumped orbits seen in about a dozen objects at a distance 250 times that between Earth and the sun—an observation others had attributed to a possible Planet Nine. In  the other paper, under review at  Astrophysical Journal Letters, they argue that given enough time, collective gravity can also explain how certain objects in far out orbits can shift as they twirl around the sun, which had been taken to be evidence for an unseen planet as well.\n  From this work by Madigan and her team, an alternate picture of the solar system’s plausible history is beginning to emerge. In the early days, Jupiter, Saturn, Uranus and Neptune coalesced in compact, orderly orbits somewhat closer to our star, which only migrated outward later because of gravitational interactions. Back then those worlds were surrounded by a swarm of leftover chunks of debris that never found their way to planethood—icy bodies that the giant planets eventually kicked outward. Most were left ostracized in what Madigan calls a “primordial scattered disk” beyond the territory of present-day Pluto. And she suggests that there may be much more mass in the disk than other researchers have usually considered. The icy bodies were propelled into that ring with far from circular orbits, making up an unstable system—much like a wobbly, precariously spinning top. This system exerted gravitational effects while it gradually settled down into a more stable configuration, with some orbits sharing similar planes and orientations. That configuration would, of course, essentially mirror what one would expect from the hidden gravitational hand of an undiscovered large outer planet.\n  “The fact that collective gravity can give you all the key observational features means that you don’t need anything new. I think Occam’s razor would lead you to believe that it’s the simpler solution” than Planet Nine, Madigan says.\n  California Institute of Technology astrophysicists Mike Brown and Konstantin Batygin have been two of the foremost proponents of the Planet Nine hypothesis since they released a sensational study on the subject in early 2016, and they have also been honing their arguments for the world’s existence. To match the latest observations,  the researchers argue that Planet Nine’s mass must be between five and 10 times that of Earth, and its location must be between 400 and 800 times our planet’s distance from the sun—slightly smaller and closer than what they first proposed.\n  Batygin says he is intrigued by Madigan’s idea of a remote ring of debris. But he thinks that is not what the solar system looks like. “If there were such a ring parked far away [from our sun], you run into the problem of its stability in the early solar system, since the solar system formed in a cluster of stars,” he says. “Perturbations from passing stars will mess up this ring. They’re going to destroy its coherence and disperse it.”\n  Madigan resolves this problem in her new simulations with careful tweaks to timing: if the scattered disk assembled after the young solar system left its stellar nursery and the giant planets formed, it could endure for eons. Such tweaks are not trivial: accurately modeling the collective gravity of a debris disk requires tracking the motions and interactions of thousands of particles or more floating and whipping around in computer models for the equivalent of hundreds of millions of years. That task is far more arduous than modeling the effects of a single planet, Madigan says—which is, in part, why she and her team so often seem to be one step behind the pro-Planet Nine contingent.\n  To date, Madigan’s idea has not gotten much attention in the scientific community, compared with Planet Nine. But as telescopic searches for the planet continue to come up empty, that situation may be about to change. “We’re in a minority, but we’re growing,” she says. “In the solar system, collective gravity just hasn’t really been studied. The field is just starting to take off.”\n  At least two other research groups have also begun investigating various gravitational effects and dynamics as an alternative to Planet Nine. They similarly involve either a  disk of rocky bodies or a  smaller number of larger ones whose gravitational influences, billions of years ago, could have also shaken up the early solar system to create the peculiar orbits of post-Plutonian debris.\n  “The attraction of what Madigan is doing is that it’s a radically different way of trying to explain what’s going on with these distant orbits,” says Scott Tremaine, an astrophysicist at the Institute for Advanced Study in Princeton, N.J.He points out a challenge for Madigan’s proposal, however: Her collective gravity hypothesis requires the scattered disk to have so many icy bodies that they add up to a rather large mass. Unless, at some point, the disk had a combined mass that was about 20 times Earth’s and a location that ranged around a few hundred times our planet’s distance from the sun, it would lack the heft to sufficiently reconfigure the outer solar system to reflect what astronomers currently see. By following the orbits of comets, astronomers have already gained a fuzzy idea of how much mass must be out there. And a disk big enough to make Madigan’s idea work lies at the upper end of what appears possible.\n  In the contest to explain astronomers’ observations of the anomalous clustering in the outer solar system, there is another, dark horse candidate in addition to collective gravity and Planet Nine: Perhaps both hypotheses are wrong. Perhaps, in fact, there is no clustering at all. Biases in astronomers’ methods of searching for small bodies and in the statistics used to study them en masse can lead to markedly different conclusions—some of which dismiss the observed clustering as illusory.\n  “With the Outer Solar System Origins Survey,  we don’t have strong evidence for clustering,” says Michele Bannister, an astronomer at the University of Canterbury in New Zealand and a member of that collaboration. The survey’s design made it possible for her and her colleagues to spot extremely faint bodies that were not seen before and to more systematically assess whether they are clustered in an unlikely configuration. The distant objects they found could simply be part of a larger population that is evenly spread out. New findings by members of the  Dark Energy Survey come to a similar conclusion, but they, too, have only discovered a  handful of objects.\n  The reality of small-number statistics, of only seeing a few glimmers of patterns and structures in the vast darkness, is what makes it extremely difficult to test ideas about the outer solar system—including searches for a concealed planet or a disk of scattered bodies. Everything spotted there so far is faint, dark and small. Many are so remote, they take millennia to complete a single revolution around the sun, making it far harder for astronomers to efficiently determine the properties of their orbits.\n  In addition to explaining observations that have already been made, Madigan and her colleagues have begun making predictions. If they are right, there should be a huge gap in the distant objects’ orbits: a region almost entirely swept free of debris and approximately centered at 50 times Earth’s distance from the sun. If Planet Nine exists instead, there should not be such a wide gap. “I’m delighted to see that as the depths of the solar system get mapped out, it’s creating this kind of theoretical enthusiasm and innovation,” Bannister says, referring to both collective gravity and Planet Nine.\n  While Madigan, Batygin and other astrophysicists marshal additional pieces of indirect evidence to make their case and look for new predictions to test, they are also waiting for observations from more sensitive upcoming telescopes in the hope of directly settling the debate. The Vera C. Rubin Observatory, being built atop a desert mountain in northern Chile, will map small objects in the outer solar system to much greater depth and precision than before. And the telescope will see “first light” as early as fall 2021.\n  “Something really odd is going on in the outer solar system, and there has to be more mass out there. If [our hypothesized disk] is not observed with the Rubin Observatory, it’s not there—and then it’s Planet Nine,” Madigan says. “It has to be one or the other.”", "posttime": "2020-05-06 07:19:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可能,planet,梅迪根", "title": "九号行星可能是海市蜃楼", "title_en": "Planet Nine Could Be a Mirage", "transed": 1, "url": "https://www.scientificamerican.com/article/planet-nine-could-be-a-mirage/", "via": "", "real_tags": ["可能", "planet", "梅迪根"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000854, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "还记得2018年初，由于各种YouTube和Twitch流媒体和相当幼稚/攻击性的表情包，VRChat有了一个短暂的炒作阶段，并在Steam上达到了超过2万的并发峰值。在那之后，并发性迅速回落，许多人认为其最高点早已不复存在。\n然而，自那以后，VRChat的蒸汽并发性一直在稳步攀升至2018年的水平，没有下降的迹象。在过去的几周里，它的每周峰值一直在15000到16000美元之间，这比2月份12000年代的每周峰值有所上升。如果这种稳定增长继续下去，VRChat的蒸汽并发性将再次达到20000左右的峰值--但现在，是定期的。\n如果考虑到没有从Steam、通过Oculus Quest和其他平台进入VRChat的使用量，总并发总数甚至可能是这个数字的两倍。\n距离虚拟市场4在@VRChat(太平洋标准时间下午4/28 6：30开始)不到4天。这是官方的@SEGA展台，你可以在这里购买Virtua Fighter Akira Yuki&amp；Pai Chan 3D模型以及Space Channel 5 Ulala模型。#vket4#vRChat@sonic_hedgehog pic.twitter.com/qvzO5pvxiT。\n-VRPill🔜虚拟市场4(@VrPill)2020年4月25日。\n这一增长的部分原因是巨大的、支持性的子社区，比如VRChat的虚拟记者Syrmor。最近，VRChat的虚拟市场博览会也带来了增长，展示了SEGA等现实世界品牌(见上图)。无论如何，虚拟世界回到峰值使用水平是非常罕见的，特别是在几年后。", "note_en": "Remember in early 2018 when VRChat had a brief hype phase thanks to various YouTube and Twitch streamers and fairly juvenile/offensive memes and thanks to both, hit a peak concurrency of over 20,000 on Steam? After that, concurrency promptly dropped back down and many assumed its high point had long since gone.\n  Since then, however, VRChat&#39;s Steam concurrency has been steadily climbing back toward that 2018 level, with no signs of dropping. Over the last few weeks, its weekly peak has been in the 15,000s and 16,000s, and that&#39;s up from weekly peaks in the 12000s in February. If this steady growth continues, VRChat&#39;s Steam concurrency will once again be peaking around 20,000 -- but now, on a regular basis.\n    When you factor in usage  not coming into VRChat from Steam, via Oculus Quest and other platforms, the grand concurrency total could be even double that number.\n  Less than 4 days until Virtual Market 4 in  @VRChat (starts 4/28 6:30pm PST). This is the official  @SEGA booth, where you can purchase Virtua Fighter Akira Yuki &amp; Pai Chan 3d models along with the Space Channel 5 Ulala model.  #vket4  #VRChat  @sonic_hedgehog  pic.twitter.com/qvzO5pvxiT\n\r— VRPill 🔜 Virtual Market 4 (@vrpill)  April 25, 2020\n    Part of this growth is due to huge and supportive sub-communities  like that of Syrmor, VRChat&#39;s virtual reporter. More recently, growth has also come from a virtual market expo in VRChat featuring real world brands like SEGA (see above). In any case, it&#39;s very rare for a virtual world to return to peak usage levels, especially years later.", "posttime": "2020-05-06 07:08:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "指节,concurrency,vrchat", "title": "VRChat并发稳步回归2018年“乌干达指节”高峰", "title_en": "VRChat concurrency steadily returning to “Ugandan Knuckles” peak of 2018", "transed": 1, "url": "https://nwn.blogs.com/nwn/2020/05/vrchat-concurrency-growth-steam.html", "via": "", "real_tags": ["指节", "vrchat"]}, {"category": "", "categoryclass": "", "imagename": "0b10e473502b212378c5c642b74695a5.jpg", "infoid": 1000853, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "重新发布Horizon文章可以根据知识共享署名4.0国际(CC by 4.0)许可证免费重新发布。\n你必须给予适当的评价。我们要求您这样做：1)使用原始记者的署名2)链接回我们的原始故事3)在页脚使用以下文本：本文最初发表在欧盟研究与创新杂志“地平线”(Horizon)上。\n&lt；H2&&gt;语音识别技术如何帮助预测火山的行为&lt；/H2&&gt;；&lt；br/&gt；全球有2900多万人居住在火山周围10公里的范围内，了解火山的行为-并能够预测它们何时喷发或喷发到空气中-对于保障人们的福祉至关重要。&lt；/p&lt；&lt；p&gt；p&gt；对于保障人们的福祉至关重要。&lt；/p&gt；&lt；/p&gt；p&gt；了解火山的行为，并能够预测它们何时喷发或喷发到空气中，对于保障人们的福祉至关重要。&lt；/h2&&gt;；&lt；https://theconversation.com/why-cant-we-predict-when-a-volcano-will-erupt-53898&#34；的目标是预测火山活动，特别是在火山处于休眠状态的情况下，因为采集样本或部署设备会带来物理危险，所以监测火山活动可能是具有挑战性的，因为没有任何开创者和参照者&lt；/a&gt；预测火山行为的人&lt；/a&gt；的情况更是如此，而且监测火山行为也可能是一件具有挑战性的事情，因为采集样本或部署设备会带来物理危险。虽然理论模型可能会根据特定火山的位置、地质组成和下面地球岩浆的行为(以及其他因素)来近似其行为，但仍然有许多未知的变量--而且每座火山都是独一无二的。现为西班牙格拉纳达大学(University Of Granada)研究员的祖卡雷洛博士的目标是自动分析火山活动，以开发早期预警模型，以拯救生活在火山附近的人们的生命。&lt；/p&gt；&p&gt；现为西班牙格拉纳达大学(University Of Granada)研究员的祖卡雷洛博士的目标是自动分析火山活动，以开发早期预警模型，以拯救生活在火山附近的人们的生命。&lt；在过去的十年里，随着新的、更灵敏的设备的出现，数据收集方法有了显著的改进，研究人员现在可以获得前所未有的海量数据。例如，他们可以获取有关火山附近的地球如何震动(地震活动)、来自地球深处的声波传播、火山内部存在的化学物质以及它们是如何变化的实时信息。&lt；/p&gt；&lt；p&gt；火山天文台需要在短时间内分析大量数据。祖卡雷洛博士说，需要更快、无错误的技术来收集这些数据。&lt；/p&gt；&p&gt；他的&lt；a href=&#34；https://cordis.europa.eu/project/id/798480&#34；目标=#34；_BLACK&#34；rel=#34；；&gt；VOLCANOWAVES&lt；/a&gt；该项目包括西班牙、英国、意大利、墨西哥和阿根廷的研究人员，该项目利用机器学习来识别火山周围地震活动的模式，以努力预测火山何时或是否会喷发。祖卡雷洛博士特别关注的是频率较低的事件，例如火山震动，这些事件通常与火山管道内的岩浆运动有关。&lt；/p&gt；p&gt；&lt；div class=&#34；报价-查看报价块报价_Horizular&34；&gt；&lt；div class=#34；报价TOP&34；&lt；&lt；img src=&#34；https://horizon-magazine.eu/sites/all/themes/horizon/images/quotes_top.png&#34；Alt=#34；&34；Title=&#34；/&&gt;；&lt；/div&&gt;；&lt；p&&gt;；‘’演讲和地震信号与意大利乌迪内大学的properties.’&lt；/p&gt；&lt；blockquote&gt；&lt；p&gt；Dr Guillermo Cortés有重要的共同之处，意大利乌迪内斯大学；/p&lt；/BLOCK QUOTE&&gt;；&lt；div class=&#34；QUERESBottom&34；；&&gt;t；&lt；img。https://horizon-magazine.eu/sites/all/themes/horizon/images/quotes_bottom.png&#34；alt=&#34；&#34；Title=&#34；&34；/&gt；&lt；/div&gt；&lt；/div&gt；&lt；/p&gt；&lt；p&gt；&lt；strong&gt；Speech Recognition&lt；/strong&&gt;；&lt；p&gt；在过去的十年里，机器学习在模式识别中的应用已经成为语音识别中不可或缺的一部分，但研究人员现在正在使用它来预测火山的行为。祖卡雷洛博士说：“尽管这些领域在背景和来源上有很大不同，但分析的目标是一样的--研究它们随时间变化的谐波，以寻找规律。”&lt；/p；&p；p&gt；该项目的主要成果将是一套算法--将于今年晚些时候项目结束时完成--他希望这些算法能在科学界被广泛用于日常监测火山。&lt；/p。意大利乌迪内大学的信号处理和机器学习专家Guillermo Cortés博士说：“语音信号和地震信号有共同的重要特性。”他经营着一个名为&lt；a href=&#34；https://cordis.europa.eu/project/id/749249&#34；target=&#34；_BLACK&34；rel=&#34；&gt；VULCAN.ears&lt；/a&gt；的项目，该项目还使用语音识别技术来理解火山在说什么。&lt；/p&gt；&lt；p&gt；Cortés博士和他的同事开发了一种实时火山监测系统，该系统自动检测并标记来自监测地震信号的监测站的数据流中的火山“事件”。该系统然后在订单中创建活动目录\n火山观测站需要在短时间内分析大量数据。祖卡雷洛博士说：“需要更快、更无错误的技术来收集这些数据。”\n他的VOLCANOWAVES项目包括西班牙、英国、意大利、墨西哥和阿根廷的研究人员，利用机器学习来识别火山周围地震活动的模式，以努力预测火山何时或是否会喷发。特别是，祖卡雷洛博士正在研究低频率的事件，比如火山震动，这通常与火山管道内的岩浆运动有关。\n在过去的十年里，机器学习在模式识别中的应用已经成为语音识别中不可或缺的一部分，但研究人员现在正在使用它来预测火山的行为。祖卡雷洛博士说：“尽管这些领域在背景和来源方面有很大的不同，但分析的目标是相同的--研究它们随时间的谐波，以寻找模式。”\n该项目的主要成果将是一套算法-将在今年晚些时候该项目结束时完成-他希望这些算法将在科学界广泛使用，用于日常监测火山。\n意大利乌迪内大学的信号处理和机器学习专家Guillermo Cortés博士说：“语音信号和地震信号有共同的重要特性。”他经营着一个名为VULCAN.ears的项目，该项目还使用语音识别技术来理解火山在说什么。\nCortés博士和他的同事开发了一种实时火山监测系统，该系统自动检测并标记来自监测地震信号的监测站的数据流中的火山“事件”。然后，这个系统会创建活动目录，以便发现行为模式。\n乌迪内大学的地球物理学家、该项目的科学主管罗伯托·卡尼尔博士说：“机器学习和应用深度学习技术的到来正在为老问题找到新的解决方案。”(现在)更容易将几个监测领域的结果混合在一起，这些监测领域涉及地震信号、次声信号、磁信号、气体和流体的地球化学分析、形变、热和摄像机，以产生更可靠的预测。“。\n该团队开发了一种基于监督机器学习的火山地震识别系统，在该系统中，他们分析了已经由其他专家标记的数据，教会软件识别火山事件，如火山震动、火山灰落下或火山内的爆炸。这种方法类似于在对话中找到单词，标记它们的词性，然后找出每座火山特有的语言模式。\nCortés博士说，这与建立火山行为目录的传统方法不同。这些方法涉及事件的自动检测和专家的手动分类。他说，通常情况下，他们每天都会执行这项任务，在涉及到由于意外喷发而处于危险之中的人群的情况下，这可能会太慢。\n他说，对于火山来说，时间可能是至关重要的，特别是在火山灰、坍塌和山体滑坡的情况下。在这些情况下，如果附近社区需要疏散，“实时操作中的检测和分类是至关重要的”，以减少决策时间。\n科特斯博士的最终目标是开发一种通用的、独立于火山的系统，该系统可以很容易地嵌入任何火山观测站。为了建立这一点，研究人员从世界各地的数十座火山创建了一个通用数据库，并使用他们的机器学习技术建立了通用模型。这本书的初步版本可以在网上找到。\n然而，对于Carniel博士来说，现在重要的是世界各地的火山天文台将这项工作推向前进。他说，他们是推进火山独立理念、在自己的观测站安装火山地震识别系统、共享资源并提供有价值反馈的真正关键。\n毕竟，这些天文台是各国保护本国公民免受境内火山影响的前线-科学家们需要能够听到火山的低语，以预测它们何时会开始呼喊。\n本文的研究是由欧盟资助的。如果你喜欢这篇文章，请考虑把它分享到社交媒体上。\n更多信息", "note_en": "Republish Horizon articles can be republished for free under the  Creative Commons Attribution 4.0 International (CC BY 4.0) licence.\n You must give appropriate credit. We ask you to do this by: 1) Using the original journalist&#39;s byline 2) Linking back to our original story 3) Using the following text in the footer: This article was originally published in  Horizon, the EU Research and Innovation magazine\n &lt;h2&gt;How speech recognition techniques are helping to predict volcanoes’ behaviour&lt;/h2&gt;&lt;br /&gt;&lt;p&gt;More than 29 million people globally live within 10km of a volcano, and understanding volcanoes’ behaviour – and being able to predict when they are going to erupt or spew ash into the air – is vital for safeguarding people’s wellbeing.&lt;/p&gt;&lt;p&gt;However, &lt;a href=&#34;https://theconversation.com/why-cant-we-predict-when-a-volcano-will-erupt-53898&#34; target=&#34;_blank&#34; rel=&#34;noopener noreferrer&#34;&gt;predicting volcano behaviour is difficult&lt;/a&gt;, especially if they have been dormant, and monitoring them can be challenging since taking samples or deploying equipment poses physical dangers. And while theoretical models may approximate how a particular volcano behaves given its location, geological makeup and the behaviour of the Earth’s magma underneath it (amongst other things), there are still many unknown variables – and every volcano is unique.&lt;/p&gt;&lt;p&gt;Now a researcher at the University of Granada in Spain, Dr Zuccarello is aiming to automatically analyse volcanic activities to develop early-warning models that could save the lives of people living near volcanoes.&lt;/p&gt;&lt;p&gt;In the last decade, data collection methods have improved significantly, with new and more sensitive equipment, and researchers now have access to an unprecedented deluge of data. For example, they can access real-time information on how the Earth shakes in the vicinity of the volcano (seismic activity), the propagation of sound waves from deep within the Earth, and the chemicals present inside the volcano and how they are changing.&lt;/p&gt;&lt;p&gt;Volcano observatories need to analyse large quantities of data in a short period of time. ‘There is a need for faster and error-free techniques to gather such data,’ Dr Zuccarello said.&lt;/p&gt;&lt;p&gt;His &lt;a href=&#34;https://cordis.europa.eu/project/id/798480&#34; target=&#34;_blank&#34; rel=&#34;noopener noreferrer&#34;&gt;VOLCANOWAVES&lt;/a&gt; project, which includes researchers based in Spain, the United Kingdom, Italy, Mexico, and Argentina, uses machine learning to identify patterns in the seismic activity around a volcano in an effort to predict when, or if it will erupt. In particular, Dr Zuccarello is looking at the low-frequency events, such as volcanic tremors, which are usually linked to the movement of magma within a volcano’s plumbing.&lt;/p&gt;&lt;p&gt;&lt;div class=&#34;quote-view quotesBlock quote_horizontal&#34;&gt;&lt;div class=&#34;quotesTop&#34;&gt;&lt;img src=&#34;https://horizon-magazine.eu/sites/all/themes/horizon/images/quotes_top.png&#34; alt=&#34;&#34; title=&#34;&#34; /&gt;&lt;/div&gt;&lt;p&gt;‘Speech and seismic signals share important properties.’&lt;/p&gt;&lt;blockquote&gt;&lt;p&gt;Dr Guillermo Cortés, University of Udine, Italy &lt;/p&gt;&lt;/blockquote&gt;&lt;div class=&#34;quotesBottom&#34;&gt;&lt;img src=&#34;https://horizon-magazine.eu/sites/all/themes/horizon/images/quotes_bottom.png&#34; alt=&#34;&#34; title=&#34;&#34; /&gt;&lt;/div&gt;&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Speech recognition&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;In the last decade, the application of machine learning to pattern identification has been integral in speech recognition, but researchers are now using it to forecast volcanoes’ behaviour. ‘Although these fields vary significantly in terms of context and source, the object of the analysis is the same – the study of their harmonics over time in search of patterns,’ Dr Zuccarello said.&lt;/p&gt;&lt;p&gt;The project’s main output will be a set of algorithms – set to be complete when the project ends later this year – and he hopes that they will be used widely in the scientific community to monitor volcanoes on a day-to-day basis.&lt;/p&gt;&lt;p&gt;‘Speech and seismic signals share important properties,’ said Dr Guillermo Cortés, a specialist in signal processing and machine learning at the University of Udine in Italy. He ran a project called &lt;a href=&#34;https://cordis.europa.eu/project/id/749249&#34; target=&#34;_blank&#34; rel=&#34;noopener noreferrer&#34;&gt;VULCAN.ears&lt;/a&gt;, which also used speech recognition technology to understand what volcanoes are saying.&lt;/p&gt;&lt;p&gt;Dr Cortés and colleagues developed a real-time volcano monitoring system, which automatically detects and labels volcanic ‘events’ in the data streams coming from monitoring stations that detect seismic signals. This system then creates catalogues of activity in order to find patterns of behaviour.&lt;/p&gt;&lt;p&gt;Dr Roberto Carniel, a geophysicist at the University of Udine and the project’s scientific supervisor, says: ‘The arrival of machine learning and applied deep-learning techniques is uncovering new solutions for old problems. (Now) it is easier to mix results from several monitoring areas involving the study of seismic signals, infrasonic signals, magnetic signals, geochemical analysis of gases and fluids, deformation, thermal and video cameras, to produce more robust and reliable predictions.’&lt;/p&gt;&lt;p&gt;&lt;img class=&#34;@alignleft@&#34; title=&#34;Image credit - Pexels/pixabay, licenced under CC0&#34; src=&#34;https://horizon-media.s3-eu-west-1.amazonaws.com/s3fs-public/IMCEUpload/light-night-evening-fire-68645.jpg&#34; alt=&#34;With 29 million people around the world living within 10km of a volcano, predicting when they are going to erupt is vital for safeguarding people’s wellbeing. Image credit - Pexels/pixabay, licenced under CC0&#34; width=&#34;1280&#34; height=&#34;853&#34; /&gt;&lt;/p&gt;&lt;p&gt;The team developed a volcanic seismic recognition system based on supervised machine learning, in which they analysed data that had already been labelled by other experts, teaching the software to identify volcano events such as volcanic tremors, ashfall, or explosions within the volcano. This approach is similar to finding words in a conversation, labelling their parts of speech and finding the patterns of language unique to each volcano.&lt;/p&gt;&lt;p&gt;This is a break from the classic methods for building catalogues of volcano behaviour, Dr Cortés says. These methods involve the automatic detection of events and manual classification by experts. ‘Usually they perform this task on a daily basis, which could be too slow in a situation involving a population at risk due to an unexpected eruption,’ he said.&lt;/p&gt;&lt;p&gt;Time can be of the essence when it comes to volcanoes, particularly in the event of ashfall, collapses and landslides, he says. In those cases, ‘the detection and classification in real-time operation is critical’ in order to reduce decision-making time if nearby communities need to be evacuated.&lt;/p&gt;&lt;p&gt;Dr Cortés’ ultimate aim was to develop a system that is universal and volcano-independent that could be easily embedded at any volcano observatory. To build this, the researchers have created a universal database from dozens of volcanoes around the world and used their machine-learning techniques to build universal models. A preliminary version of this &lt;a href=&#34;https://zenodo.org/record/3594897&#34; target=&#34;_blank&#34; rel=&#34;noopener noreferrer&#34;&gt;is available online&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;However, for Dr Carniel, what’s important now is that volcanic observatories around the world take the work forward. ‘They are the real key to advancing the volcano-independent idea, installing the volcanic seismic recognition system in their own observatories, sharing resources, and giving valuable feedback,’ he said.&lt;/p&gt;&lt;p&gt;These observatories are, after all, the front line of countries’ efforts to protect their citizens from the volcanoes within their borders – and scientists need to be able to hear volcanoes’ whispers to predict when they are going to start shouting.&lt;/p&gt;&lt;p&gt;&lt;em&gt;The research in this article was funded by the EU. If you liked this article, please consider sharing it on social media.&lt;/em&gt;&lt;/p&gt;&lt;br /&gt;\r&lt;img src=”http://www.google-analytics.com/collect?v=1&amp;tid=UA-40077089-1&amp;cid=how-speech-recognition-techniques-are-helping-to-predict-volcanoes’-behaviour&amp;t=event&amp;ec=republish&amp;ea=read&amp;el=how-speech-recognition-techniques-are-helping-to-predict-volcanoes’-behaviour&amp;cs=republish&amp;cm=republish&amp;cn=republish&amp;cm1=1&#34; /&gt; This post &lt;a href=&#34;https://horizon-magazine.eu/article/how-speech-recognition-techniques-are-helping-predict-volcanoes-behaviour.html&#34;&gt;How speech recognition techniques are helping to predict volcanoes’ behaviour&lt;/a&gt; was originally published on &lt;a href=&#34;https://horizon-magazine.eu/&#34;&gt;Horizon: the EU Research &amp;amp; Innovation magazine | European Commission&lt;/a&gt;.\n     As speech and seismic signals have properties in common, speech recognition techniques are being used to understand what volcanoes are saying and when they might erupt. Image credit - milito10/ Pixabay, licenced under CC0\n  More than 29 million people globally live within 10km of a volcano, and understanding volcanoes’ behaviour – and being able to predict when they are going to erupt or spew ash into the air – is vital for safeguarding people’s wellbeing.\n  However,  predicting volcano behaviour is difficult, especially if they have been dormant, and monitoring them can be challenging since taking samples or deploying equipment poses physical dangers. And while theoretical models may approximate how a particular volcano behaves given its location, geological makeup and the behaviour of the Earth’s magma underneath it (amongst other things), there are still many unknown variables – and every volcano is unique.\n Now a researcher at the University of Granada in Spain, Dr Zuccarello is aiming to automatically analyse volcanic activities to develop early-warning models that could save the lives of people living near volcanoes.\n In the last decade, data collection methods have improved significantly, with new and more sensitive equipment, and researchers now have access to an unprecedented deluge of data. For example, they can access real-time information on how the Earth shakes in the vicinity of the volcano (seismic activity), the propagation of sound waves from deep within the Earth, and the chemicals present inside the volcano and how they are changing.\n Volcano observatories need to analyse large quantities of data in a short period of time. ‘There is a need for faster and error-free techniques to gather such data,’ Dr Zuccarello said.\n His  VOLCANOWAVES project, which includes researchers based in Spain, the United Kingdom, Italy, Mexico, and Argentina, uses machine learning to identify patterns in the seismic activity around a volcano in an effort to predict when, or if it will erupt. In particular, Dr Zuccarello is looking at the low-frequency events, such as volcanic tremors, which are usually linked to the movement of magma within a volcano’s plumbing.\n   In the last decade, the application of machine learning to pattern identification has been integral in speech recognition, but researchers are now using it to forecast volcanoes’ behaviour. ‘Although these fields vary significantly in terms of context and source, the object of the analysis is the same – the study of their harmonics over time in search of patterns,’ Dr Zuccarello said.\n The project’s main output will be a set of algorithms – set to be complete when the project ends later this year – and he hopes that they will be used widely in the scientific community to monitor volcanoes on a day-to-day basis.\n ‘Speech and seismic signals share important properties,’ said Dr Guillermo Cortés, a specialist in signal processing and machine learning at the University of Udine in Italy. He ran a project called  VULCAN.ears, which also used speech recognition technology to understand what volcanoes are saying.\n Dr Cortés and colleagues developed a real-time volcano monitoring system, which automatically detects and labels volcanic ‘events’ in the data streams coming from monitoring stations that detect seismic signals. This system then creates catalogues of activity in order to find patterns of behaviour.\n Dr Roberto Carniel, a geophysicist at the University of Udine and the project’s scientific supervisor, says: ‘The arrival of machine learning and applied deep-learning techniques is uncovering new solutions for old problems. (Now) it is easier to mix results from several monitoring areas involving the study of seismic signals, infrasonic signals, magnetic signals, geochemical analysis of gases and fluids, deformation, thermal and video cameras, to produce more robust and reliable predictions.’\n  The team developed a volcanic seismic recognition system based on supervised machine learning, in which they analysed data that had already been labelled by other experts, teaching the software to identify volcano events such as volcanic tremors, ashfall, or explosions within the volcano. This approach is similar to finding words in a conversation, labelling their parts of speech and finding the patterns of language unique to each volcano.\n This is a break from the classic methods for building catalogues of volcano behaviour, Dr Cortés says. These methods involve the automatic detection of events and manual classification by experts. ‘Usually they perform this task on a daily basis, which could be too slow in a situation involving a population at risk due to an unexpected eruption,’ he said.\n Time can be of the essence when it comes to volcanoes, particularly in the event of ashfall, collapses and landslides, he says. In those cases, ‘the detection and classification in real-time operation is critical’ in order to reduce decision-making time if nearby communities need to be evacuated.\n Dr Cortés’ ultimate aim was to develop a system that is universal and volcano-independent that could be easily embedded at any volcano observatory. To build this, the researchers have created a universal database from dozens of volcanoes around the world and used their machine-learning techniques to build universal models. A preliminary version of this  is available online.\n However, for Dr Carniel, what’s important now is that volcanic observatories around the world take the work forward. ‘They are the real key to advancing the volcano-independent idea, installing the volcanic seismic recognition system in their own observatories, sharing resources, and giving valuable feedback,’ he said.\n These observatories are, after all, the front line of countries’ efforts to protect their citizens from the volcanoes within their borders – and scientists need to be able to hear volcanoes’ whispers to predict when they are going to start shouting.\n The research in this article was funded by the EU. If you liked this article, please consider sharing it on social media.\n       More info", "posttime": "2020-05-06 06:56:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "识别,recognition,火山,volcano", "title": "语音识别技术如何帮助预测火山的行为", "title_en": "How speech recognition techniques are helping to predict volcanoes’ behaviour", "transed": 1, "url": "https://horizon-magazine.eu/article/how-speech-recognition-techniques-are-helping-predict-volcanoes-behaviour.html", "via": "", "real_tags": ["识别", "火山", "volcano"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000852, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "流是元素集合的包装器，提供许多有用的操作来修改和/或获取有关集合的信息。这些操作是可链接的，可以分类如下：\n中间操作(跳过、过滤、映射等)--这些操作正在改变流，但仍使其处于打开状态，以供进一步修改。\n终端操作(计数、收集等)--在完成所有修改后执行并返回有限结果的操作。\narray=[1，2，3，4，5，6，7，8，9，10]stream=Stream：：FromArray。收集的新(数组)=流.filter{|num|num%2==0}.跳过(2).Collect放置收集的数量#[6，8，10]。\nGenerate方法接受一个限制(最大元素数)和一个&amp；Seed Block函数，该函数在每次Seed.call时返回一个新元素。限制是必需的，因为如果没有限制，此流将是无限的。如果未指定限制，则默认值为100个元素。\n例如，当您必须使用来自某些IO对象的传入对象流时，此机制非常有用。\n这不是密信！Stream是包装您的集合的适当对象。此外，这个gem中的每个对象都是不可变的，因此是线程安全的-&gt；中间操作不会改变调用它们的实例；相反，它们使用底层集合的修改版本创建Stream的新实例。\n如果您想贡献，只需打开一个问题(bug、功能请求、任何改进想法)或公关即可。", "note_en": "A Stream is a wrapper over a collection of elements offering a number of usefuloperations to modify and/or get information about the collection. The operations are chainable and can be categorized as follows:\n Intermediate operations (skip, filter, map etc) -- operations which are altering the Stream and still leave it open for further modifications.\n Terminal operations (count, collect etc) -- operations which are executed after all the modifications have been done and are returning a finite result.\n   array  = [ 1,  2,  3,  4,  5,  6,  7,  8,  9,  10]stream  =  Stream:: FromArray. new(array)collected  = stream .filter { | num| num  %  2  ==  0 } .skip( 2) .collect puts collected   # [6, 8, 10]\n   The  generate method takes a  limit (max number of elements) and a  &amp;seed Block function whichreturns a new element at each  seed.call. A limit is necessary as, without it, this Stream would be infinite.If no limit is specified, the default is  100 elements.\n This mechanism is useful, for instance, when you have to consume an incomming stream of objects from some  IO objects.\n           This is  not a Mixin! The Stream is a proper object wrapping your collection(s). Furthermore, each object in this gem is immutable and therefore thread-safe -&gt; the  intermediate operations are not altering the instance on which they are called; instead, they create a new instance of the Stream with a modified version of the underlying collection.\n  If you would like to contribute, just open an Issue (bugs, feature requests, any improvement idea) or a PR.", "posttime": "2020-05-06 06:33:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ruby,stream,操作", "title": "Ruby Stream API", "title_en": "Ruby Stream API", "transed": 1, "url": "https://github.com/ruby-ee/ruby-stream-api", "via": "", "real_tags": ["ruby", "stream", "操作"]}, {"category": "", "categoryclass": "", "imagename": "db7ff9362b8530bc9824c53ed2111539.png", "infoid": 1000851, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用纳米孔长读序列重新组装人类基因组已有报道，但它使用了150，000 中央处理器小时和数周的挂钟时间。为了实现人类基因组的快速组装，我们提出了Shasta，一个从头开始的长读汇编器，以及名为MarginPolish和Helen的抛光算法。使用单个ProMethION纳米孔测序仪和我们的工具包，我们在9 d内重新组装了11个高度连续的人类基因组。我们在每个样本中使用三个流式细胞，获得了大约63倍的覆盖率，42kb的读取N50值和6.5kb的Reads&GT；100 kb的覆盖率。沙斯塔在单个商业计算节点上用不到6 h的时间完成了完整的单倍体人类基因组组装。MarginPolish和Helen仅用纳米孔就将单倍体组件抛光到99.9%以上的一致性(Phred Quality Score QV = 30)。邻近连接测序的增加使得所有11个基因组都可以接近染色体水平的支架。我们将我们的组装性能与现有的二倍体、单倍体和三倍体人类样本的组装方法进行了比较，并报告了优越的准确性和速度。\n基于参考的方法，如GATK-1，可以从短读取序列中推断人类变异，但结果仅覆盖参考人类基因组组合2，3的~90%。这些方法对于参考基因组4的这一可映射部分的单核苷酸变异和短插入和缺失(INDel)是准确的。然而，对于从头基因组组合5，发现结构变异(SVS)6，7(包括大的INDel和碱基水平分辨的拷贝数变异)是困难的。但是，对于新的基因组组合5，发现结构变异(SVS)6、7(包括大的INDel和碱基水平分辨的拷贝数变异)是困难的。\n第三代测序技术，包括连锁读数9、10、11和长读技术12、13，克服了用于基因组推断的短读测序的基本限制。除了越来越多地在参考引导方法2、14、15、16中使用之外，长阅读序列可以产生高度连续的从头开始基因组组件17。\n牛津纳米孔技术公司(ONT)商业化的纳米孔测序对于从头组装基因组特别有用，因为它可以产生非常长的100千碱基(Kb)读数18的高产量。非常长的读数有望促进人类基因组中最具挑战性的区域的连续、不间断的组装，包括着丝粒卫星、末端着丝粒短臂、核糖体 阵列和最近的片段复制19、20、21。基于纳米孔测序的人类基因组的从头组装已被报道18。这一早期的工作需要53个微小的流式细胞，组装需要超过150，000 的中央处理器小时和数周的挂钟时间，这对于高通量的人类基因组测序工作是不可行的。\n为了实现人类基因组的简单、廉价和快速从头组装，我们开发了一种用于纳米孔数据组装和抛光的工具包，其速度比最先进的方法快了几个数量级。我们结合使用纳米孔和邻近连接(HIC)测序9和我们的工具包，我们报告了人类基因组测序的改进，并减少了时间、劳动力和成本。\n我们从1000个基因组计划22和瓶装基因组23样本中选择了11个低传代(6代)亲子三人组后代的人类细胞系进行测序。选择样本以最大化捕获的等位基因多样性(见方法)。\n我们对这11个基因组进行了蛋白纳米孔测序和免疫测序。我们每个基因组使用三个流式细胞，每个流式细胞每隔20-24 小时接受一次核酸酶冲洗，这种冲洗去除了可能导致毛孔随着时间的推移而堵塞的长dna片段。在核酸酶冲洗后，每个流动细胞都收到一个相同样本的新文库。每个流式细胞总共进行两次核酸酶刷新，每个流式细胞总共获得三个测序文库。我们使用带有高精度触发器模型的Guppy v.2.3.5进行基本呼叫(参见方法)。\n对全部11个基因组进行纳米孔测序，历时9 d，产生2.3Tb( Terabases，TB)序列。在这些测序过程中，我们并行运行了多达15个流式细胞。结果如图所示。纳米孔测序平均每个流动细胞产生69 千兆碱基(GB)，每个基因组的总吞吐量在48× (15 8 GB)到85× (2 80 GB)覆盖范围内(图2)。(1A)。测序运行的读数N50值在28到51 kb(图2)之间。(1B)。(N50值是加权的中位数；它是集合中序列的长度，对于该集合，该长度或更大的所有序列的总和为集合总大小的50%。)。我们将纳米孔读数与人类参考基因组(GRCH38)进行了比对，并计算了它们的比对一致性以评估序列质量(参见方法)。我们观察到，中位数和模态比对一致性分别为90%和93%(F\nA，对于11个样本，三个流动单元中的每一个的吞吐量以千兆基数为单位，总吞吐量最高。每个点都是一个流动单元。b、读取每个流动单元的N50值。每个点都是一个流动单元。C，与GRCh38对齐身份。a-c中的中点用虚线表示，c中的虚线是模式。每条线是由三个流动池组成的单个样品。D，基因组覆盖作为读取长度的函数。虚线表示覆盖范围为10和100 kb。例如，HG00733以深蓝色突出显示。每条线是由三个流动池组成的单个样品。E，标准和RLE读取的对齐标识。HG00733染色体1流式细胞1的数据如图所示(4.6 GB原始序列)。虚线表示四分位数。\n在从纳米孔读数组装人类大小的基因组方面，Shasta被设计成比我们之前工作中使用的CANU汇编器快几个数量级，成本也低几个数量级。在大多数Shasta组装阶段，读数都是使用游程编码(RLE)24、25、26以均聚物压缩的形式存储的。在这种形式中，相同的连续碱基被折叠，并且存储碱基和重复计数。例如，GATTTACCA将表示为(GATACA，113121)。这种表示对均聚物游程长度中的错误不敏感，从而解决了牛津纳米孔读数12的主要错误模式。结果，由于读取错误而导致的组装噪声减少，并有助于显著更高的同一性比对(图。1E)。还使用读取的标记表示，其中每个读取在其游程表示中被表示为短k-MERS(标记表示)的预定的固定子集的出现序列。使用m个标记的连续出现(缺省为m个 = 4)作为最小散列特征，使用修改的最小散列27，28方案来寻找重叠读取的候选对。为所有候选对计算标记表示中的最佳对齐。标记表示中的路线计算非常有效，特别是在使用各种带状试探法时。创建标记图，其中每个顶点表示在若干读取的集合中发现对准的标记。标记图是经过一系列简化步骤后用来组装序列的。汇编器在具有大量内存的单台机器上运行(对于人工汇编，通常为1-2 TB)。所有数据结构都保存在内存中，除了读取的初始加载和汇编结果的最终输出之外，不会发生任何磁盘I/O。\n我们将沙斯塔与三位同时代的汇编者进行了比较：Wtdbg2(参考文献2)。29)，Flye 30和Canu 31。我们在两个二倍体人类样本HG00733和HG002以及一个单倍体人类样本CHM13的可用读取数据上运行了所有四个汇编程序。HG00733和HG002是我们收集的11个样本的一部分，CHM13的数据来自T2T联盟32。\nCANU始终产生最连续的组装，样品HG00733、HG002和CHM13的重叠NG50值分别为40.6、32.3和79.5 Mb(图.。2A)。(NG50与N50相似，但只占估计基因组大小的50%。)。对于相同的样品，Flye是第二连续的，其重叠NG50值分别为25.225.935.3Mb Mb。沙斯塔紧随其后，其重叠群NG50值分别为21.1、20.2和41.1 Mb。Wtdbg2产生的邻接组装最少，重叠群NG50值分别为15.3、13.7和14.0 Mb。\na，NGx图显示重叠群长度分布。每条直线与虚线的交点是该部件的NG50。B，NGAx图显示了排列的重叠群长度的分布。每条水平线表示组件的对齐段，相对于GRCh38未被不一致或不可映射的序列打断。每条直线与虚线的交点是该部件的对齐NGA50。C，着丝粒外区域的组装不一致计数，节段性复制，对于HG002，已知SVS。d，总生成序列长度与总比对序列长度(对照GRCh38)。E.用于组合序列的平衡的基准级错误率。f，汇编程序的平均运行时间和成本(未显示CANU)。\n相反，将样本与GRCh38对齐，并用Quast 33进行评估，与其他组装者相比，Shasta每个组装件的不一致(组装件相对于参考组装件包含断点的位置)减少4.2至6.5倍(补充表5)。打破这些相对于GRCh38的不一致和未对齐区域的组装，我们观察到连续的绝对变化要小得多(图4)。2B和补充表5)。然而，发现的分歧中有相当一部分可能反映了关于GRCh38的真实SVS。为了解决这个问题，我们对Y染色体、着丝粒、端着丝粒染色体臂、QH-区域和已知的最近节段性复制(所有这些都在SVS34，35中富集)内的折扣进行了折扣；在HG002的情况下，我们进一步\nShasta产生的碱基水平准确的组件最多(二倍体的平均平衡错误率为0.98%，单倍体的平均平衡错误率为0.54%)，其次是Wtbdg2(二倍体的1.18%和单倍体的0.69%)，CANU(二倍体的1.40%和单倍体的0.71%)和Flye(二倍体的1.64%和单倍体的2.21%)(图2)。2E，见方法和补充表12)。我们还计算了所有组件覆盖的区域的碱基水平准确性，并观察到与全基因组评估一致的结果(补充表13)。\nShasta、Wtdbg2和Flye在商业云上运行，使我们能够合理地比较它们的成本和运行时间(图2)。2E，请参见方法)。沙斯塔以平均每件样品70美元的成本完成每个组装平均需要5.25Mh( h)。相比之下，Wtdbg2耗时7.5倍，成本3.7倍，Flye耗时11.9倍，成本9.9倍。由于将CANU程序集移植到Amazon Web Services的预期成本和复杂性，CANU程序集在大型机构计算群集上运行，计算消耗高达19，000美元(估计)，每个程序集需要大约4-5 d(方法，请参阅补充表14和15)。\n为了评估使用Shasta进行SV表征的使用情况，我们创建了一个从Shasta组装图中提取假定杂合子SV的工作流程(方法)。从HG002的组装图中提取SVS，Indels的长度分布显示了已知反转录转座子长度的特征尖峰(补充图。1)。将这些SV与高置信度Giab SV集合进行比较，我们发现一致性很好，F1综合得分为0.68(补充表16)。\nMHC区域由于其重复性和高度多态的性质37而很难使用短读取来解决，并且最近将长读取序列应用于该问题的努力已经显示出希望18、38。我们分析了CHM13和HG00733的组装，看看它们是否跨越了MHC区域。对于CHM13的单倍体组装，我们发现MHC在所有四个组合器的输出中完全被单个重叠群跨越，并且与GRCH38(图38)中提供的GL000251.2单倍群最为相似。3A，附图3A。2和补充表17)。在HG00733的二倍体组装中，两个重叠群横跨Shasta和Flye的大部分MHC，而Canu和Wtdbg2以一个重叠群跨越该区域(图.。3B和附图3。3)。然而，我们注意到，所有这些嵌合的二倍体组装导致的序列与任何单群(方法)并不十分相似。\n用于CHM13和HG00733的未抛光的Shasta组件，包括HG00733三箱装母体和父体组件。灰色阴影区域是覆盖范围(与GRCh38对齐)降至20以下的区域。水平黑线表示重叠群中断。蓝色和绿色表示唯一对齐(分别向前和向后对齐)，橙色表示多个对齐。\n为了尝试解析HG00733的单倍型，我们使用三仓39根据可能的母系或父系将HG00733的读数分成两组，并组装单倍型(方法)。对于所有组装者和每个单倍型组装体，全局邻接性显著恶化(因为可用的读取数据覆盖率大约减半，而且，并不是所有的读取都可以分割)，但是所产生的不一致计数减少(补充表18)。当使用单倍体三库组件时，MHC由母体单倍型的单个重叠群跨越(图4)。3C，附图3。4和补充表19)，与GRCH38同源性高，并且与GL000255.1单倍型具有最大的邻接性和同一性。对于父本单倍型，低覆盖率会导致不连续(图3)。3D)将该区域划分为三个重叠群。\n我们开发了一种基于深度神经网络的共识序列抛光流水线，旨在提高初始装配的基准级质量。该管道由两个模块组成：MarginPolish和用于纳米孔的均聚物编码长读纠错器(Helen)。MarginPolish在成对隐马尔可夫模型(Pair-HMM)上使用前向-后向算法的带状形式，从到程序集的每个读取器的RLE对齐生成成对对齐统计信息。根据这些统计数据，MarginPolish生成表示潜在可选局部组件的加权RLE偏序排列(POA)40图。MarginPolish使用此RLE POA迭代地细化程序集，然后输出最终摘要图供Helen使用。海伦使用多任务递归神经网络(RNN)41，该网络采用MarginPolish RLE POA图的权重来预测每个基因组位置的核苷酸碱基和游程长度。RNN利用上下文基因组特征和POA权重到正确碱基和游程长度的关联耦合来产生具有更高准确性的共识序列。\n为了证明MarginPolish和Helen的有效性，我们将他们与国家-o进行了比较。\n图4a和补充表20-22详细说明了使用Pomoxis在HG00733和CHM13 Shasta组件(参见方法)上执行的四种方法的错误率。对于二倍体的HG00733样本，MarginPolish和Helen的平衡错误率为0.388%(Phred质量分数QV = 24.12)，相比之下，拉康和Medaka的错误率为0.455%(QV =23.42)。对于这两条抛光管道，这些误差中有相当一部分可能是由于真正的杂合变异造成的。对于单倍体CHM13，我们将比较限于由T2T联盟32提供的高度精选的X染色体序列。我们实现了0.064%(QV = 31.92)的均衡错误率，而Racon和Medaka的错误率为0.110%(QV = 为29.59)。\nA，HG00733和CHM13上四种方法的均衡错误率。B，描述HG00733上的管线的四个步骤的给定真实运行长度(y轴)的预测运行长度(x轴)的行归一化热图。Guppy v.2.3.3是从3.7GBRLE序列中产生的。沙斯塔、马尔金·波利什和海伦是从与其各自对齐的整个集合中生成的。\n..", "note_en": "De novo assembly of a human genome using nanopore long-read sequences has been reported, but it used more than 150,000 CPU hours and weeks of wall-clock time. To enable rapid human genome assembly, we present Shasta, a de novo long-read assembler, and polishing algorithms named MarginPolish and HELEN. Using a single PromethION nanopore sequencer and our toolkit, we assembled 11 highly contiguous human genomes de novo in 9 d. We achieved roughly 63× coverage, 42-kb read N50 values and 6.5× coverage in reads &gt;100 kb using three flow cells per sample. Shasta produced a complete haploid human genome assembly in under 6 h on a single commercial compute node. MarginPolish and HELEN polished haploid assemblies to more than 99.9% identity (Phred quality score QV = 30) with nanopore reads alone. Addition of proximity-ligation sequencing enabled near chromosome-level scaffolds for all 11 genomes. We compare our assembly performance to existing methods for diploid, haploid and trio-binned human samples and report superior accuracy and speed.\n     Reference-based methods such as GATK  1 can infer human variations from short-read sequences, but the results only cover ~90% of the reference human genome assembly  2, 3. These methods are accurate with respect to single-nucleotide variants and short insertions and deletions (indels) in this mappable portion of the reference genome  4. However, it is difficult to use short reads for de novo genome assembly  5, to discover structural variations (SVs)  6, 7 (including large indels and base-level resolved copy number variations), or to resolve phasing relationships without exploiting transmission information or haplotype panels  8.\n Third generation sequencing technologies, including linked-reads  9, 10, 11 and long-read technologies  12, 13, overcome the fundamental limitations of short-read sequencing for genome inference. In addition to increasingly being used in reference guided methods  2, 14, 15, 16, long-read sequences can generate highly contiguous de novo genome assemblies  17.\n Nanopore sequencing, as commercialized by Oxford Nanopore Technologies (ONT), is particularly useful for de novo genome assembly because it can produce high yields of very long 100+ kilobase (kb) reads  18. Very long reads hold the promise of facilitating contiguous, unbroken assembly of the most challenging regions of the human genome, including centromeric satellites, acrocentric short arms, ribosomal DNA arrays and recent segmental duplications  19, 20, 21. The de novo assembly of a nanopore sequencing based human genome has been reported  18. This earlier effort needed 53 ONT MinION flow cells and the assembly required more than 150,000 CPU hours and weeks of wall-clock time, quantities that are unfeasible for high throughput human genome sequencing efforts.\n To enable easy, cheap and fast de novo assembly of human genomes we developed a toolkit for nanopore data assembly and polishing that is orders of magnitude faster than state-of-the-art methods. We use a combination of nanopore and proximity-ligation (HiC) sequencing  9 and our toolkit, and we report improvements in human genome sequencing coupled with reduced time, labor and cost.\n We selected for sequencing 11, low-passage (six passages), human cell lines of the offspring of parent-child trios from the 1,000 Genomes Project  22 and genome-in-a-bottle (GIAB)  23 sample collections. Samples were selected to maximize captured allelic diversity (see  Methods).\n We carried out PromethION nanopore sequencing and HiC Illumina sequencing for the 11 genomes. We used three flow cells per genome, with each flow cell receiving a nuclease flush every 20–24 h. This flush removed long DNA fragments that could cause the pores to become blocked over time. Each flow cell received a fresh library of the same sample after the nuclease flush. A total of two nuclease flushes were performed per flow cell, and each flow cell received a total of three sequencing libraries. We used Guppy v.2.3.5 with the high accuracy flipflop model for basecalling (see  Methods).\n Nanopore sequencing of all 11 genomes took 9 d and produced 2.3 terabases (Tb) of sequence. We ran up to 15 flow cells in parallel during these sequencing runs. Results are shown in Fig.  1 and Supplementary Tables  1– 3. Nanopore sequencing yielded an average of 69 gigabases (Gb) per flow cell, with the total throughput per individual genome ranging between 48× (158 Gb) and 85× (280 Gb) coverage per genome (Fig.  1a). The read N50 values for the sequencing runs ranged between 28 and 51 kb (Fig.  1b). (An N50 value is a weighted median; it is the length of the sequence in a set for which all sequences of that length or greater sum to 50% of the set’s total size.) We aligned nanopore reads to the human reference genome (GRCh38) and calculated their alignment identity to assess sequence quality (see  Methods). We observed that the median and modal alignment identity was 90 and 93%, respectively (Fig.  1c). The sequencing data per individual genome included an average of 55× coverage arising from &gt;10-kb reads and 6.5× coverage from &gt;100-kb reads (Fig.  1d). This was in large part due to size selection that yielded an enrichment of reads longer than 10 kb. To test the generality of our sequencing methodology for other samples, we sequenced high-molecular weight DNA isolated from a human saliva sample using identical sample preparation. The library was run on a MinION (roughly one-sixth the throughput of a ProMethION flow cell) and yielded 11 Gb of data at a read N50 of 28 kb (Supplementary Table  4), extrapolating both are within the lower range achieved with cell-line derived DNA.\n a, Throughput in gigabases from each of three flow cells for 11 samples, with total throughput at top. Each point is a flow cell.  b, Read N50 values for each flow cell. Each point is a flow cell.  c, Alignment identities against GRCh38. Medians in  a– c shown by dashed lines, dotted line in  c is the mode. Each line is a single sample comprising three flow cells.  d, Genome coverage as a function of read length. Dashed lines indicate coverage at 10 and 100 kb. HG00733 is accentuated in dark blue as an example. Each line is a single sample comprising three flow cells.  e, Alignment identity for standard and RLE reads. Data for HG00733 chromosome 1 flow cell 1 are shown (4.6 Gb raw sequence). Dashed lines denote quartiles.\n  Shasta was designed to be orders of magnitude faster and cheaper at assembling a human-scale genome from nanopore reads than the Canu assembler used in our earlier work  18. During most Shasta assembly phases, reads are stored in a homopolymer-compressed form using run-length encoding (RLE)  24, 25, 26. In this form, identical consecutive bases are collapsed, and the base and repeat count are stored. For example, GATTTACCA would be represented as (GATACA, 113121). This representation is insensitive to errors in the length of homopolymer runs, thereby addressing the dominant error mode for Oxford Nanopore reads  12. As a result, assembly noise due to read errors is decreased, and notably higher identity alignments are facilitated (Fig.  1e). A marker representation of reads is also used, in which each read is represented as the sequence of occurrences of a predetermined, fixed subset of short  k-mers (marker representation) in its run-length representation. A modified MinHash  27, 28 scheme is used to find candidate pairs of overlapping reads, using as MinHash features consecutive occurrences of  m markers (default  m = 4). Optimal alignments in marker representation are computed for all candidate pairs. The computation of alignments in marker representation is very efficient, particularly as various banded heuristics are used. A marker graph is created in which each vertex represents a marker found to be aligned in a set of several reads. The marker graph is used to assemble sequence after undergoing a series of simplification steps. The assembler runs on a single machine with a large amount of memory (typically 1–2 Tb for a human assembly). All data structures are kept in memory, and no disk I/O takes place except for initial loading of the reads and final output of assembly results.\n  We compared Shasta to three contemporary assemblers: Wtdbg2 (ref.   29), Flye  30 and Canu  31. We ran all four assemblers on available read data from two diploid human samples, HG00733 and HG002, and one haploid human sample, CHM13. HG00733 and HG002 were part of our collection of 11 samples, and data for CHM13 came from the T2T consortium  32.\n Canu consistently produced the most contiguous assemblies, with contig NG50 values of 40.6, 32.3 and 79.5 Mb, for samples HG00733, HG002 and CHM13, respectively (Fig.  2a). (NG50 is similar to N50, but for 50% of the estimated genome size.) Flye was the second most contiguous, with contig NG50 values of 25.2, 25.9 and 35.3 Mb, for the same samples. Shasta was next with contig NG50 values of 21.1, 20.2 and 41.1 Mb. Wtdbg2 produced the least contiguous assemblies, with contig NG50 values of 15.3, 13.7 and 14.0 Mb.\n a, NGx plot showing contig length distribution. The intersection of each line with the dashed line is the NG50 for that assembly.  b, NGAx plot showing the distribution of aligned contig lengths. Each horizontal line represents an aligned segment of the assembly unbroken by a disagreement or unmappable sequence with respect to GRCh38. The intersection of each line with the dashed line is the aligned NGA50 for that assembly.  c, Assembly disagreement counts for regions outside centromeres, segmental duplications and, for HG002, known SVs.  d, Total generated sequence length versus total aligned sequence length (against GRCh38).  e, Balanced base-level error rates for assembled sequences.  f, Average runtime and cost for assemblers (Canu not shown).\n Conversely, aligning the samples to GRCh38 and evaluating with QUAST  33, Shasta had between 4.2 and 6.5× fewer disagreements (locations where the assembly contains a breakpoint with respect to the reference assembly) per assembly than the other assemblers (Supplementary Table  5). Breaking the assemblies at these disagreements and unaligned regions with respect to GRCh38, we observe much smaller absolute variation in contiguity (Fig.  2b and Supplementary Table  5). However, a substantial fraction of the identified disagreements likely reflect true SVs with respect to GRCh38. To address this, we discounted disagreements within chromosome Y, centromeres, acrocentric chromosome arms, QH-regions and known recent segmental duplications (all of which are enriched in SVs  34, 35); in the case of HG002, we further excluded a set of known SVs  36. We still observe between 1.2× and 2× fewer disagreements in Shasta relative to Canu and Wtdbg2, and comparable results against Flye (Fig.  2c and Supplementary Table  6). To account for differences in the fraction of the genomes assembled, we analyzed disagreements contained within the intersection of all the assemblies (that is, in regions where all assemblers produced a unique assembled sequence). This produced results highly consistent with the previous analysis and suggests Shasta and Flye have the lowest and comparable rates of misassembly ( Methods, see Supplementary Table  7). Finally, we used QUAST to calculate disagreements between the T2T Consortium’s chromosome X assembly, a highly curated, validated assembly  32 and the subset of each CHM13 assembly mapping to it; Shasta has two to 17 times fewer disagreements than the other assemblers while assembling almost the same fraction of the assembly (Supplementary Table  8).\n Canu consistently assembled the largest genomes (average 2.91 Gb), followed by Flye (average 2.83 Gb), Wtdbg2 (average 2.81 Gb) and Shasta (average 2.80 Gb). Due to their similarity, we would expect the most of these assembled sequences to map to another human genome. Discounting unmapped sequence, the differences are smaller: Canu produced an average of 2.86 Gb of mapped sequence per assembly, followed by Shasta (average 2.79 Gb), Flye (average 2.78 Gb) and Wtdbg2 (average 2.76 Gb) (Fig.  2d, see  Methods). This analysis supports the notion that Shasta is currently relatively conservative versus its peers, producing the highest ratio of directly mapped assembly per sample.\n For HG00733 and CHM13 we examined a library of bacterial artificial chromosome (BAC) assemblies ( Methods). The BACs were largely targeted at known segmental duplications (473 of 520 BACs lie within 10 kb of a known duplication). Examining the subset of BACs for CHM13 and HG00733 that map to unique regions of GRCh38 (see  Methods), we find Shasta contiguously assembles all 47 BACs, with Flye performing similarly (Supplementary Table  9). In the full set, we observe that Canu (411) and Flye (282) contiguously assemble a larger subset of the BACs than Shasta (132) and Wtdbg2 (108), confirming the notion that Shasta is relatively conservative in these duplicated regions (Supplementary Table  10). Examining the fraction of contiguously assembled BACs of all BACs represented in each assembly we can measure an aspect of assembly correctness. In this regard Shasta (97%) produces a much higher percentage of correct BACs in duplicated regions versus its peers (Canu 92%, Flye 87%, Wtdbg2 88%). In the intersected set of BACs attempted by all assemblers (Supplementary Table  11), Shasta, 100%; Flye, 100%; Canu, 98.50% and Wtdbg2, 90.80% all produce comparable results.\n Shasta produced the most base-level accurate assemblies (average balanced error rate 0.98% on diploid and 0.54% on haploid), followed by Wtbdg2 (1.18% on diploid and 0.69% on haploid), Canu (1.40% on diploid and 0.71% on haploid) and Flye (1.64% on diploid and 2.21% on haploid) (Fig.  2e, see  Methods and Supplementary Table  12). We also calculated the base-level accuracy in regions covered by all the assemblies and observe results consistent with the whole-genome assessment (Supplementary Table  13).\n Shasta, Wtdbg2 and Flye were run on a commercial cloud, allowing us to reasonably compare their cost and runtime (Fig.  2e, see  Methods). Shasta took an average of 5.25 h to complete each assembly at an average cost of US$70 per sample. In contrast, Wtdbg2 took 7.5× longer and cost 3.7× as much, and Flye took 11.9× longer and cost 9.9× as much. Due to the anticipated cost and complexity of porting it to Amazon Web Services (AWS), the Canu assemblies were run on a large, institutional compute cluster, consuming up to US$19,000 (estimated) of compute and took around 4–5 d per assembly ( Methods, see Supplementary Tables  14 and  15).\n To assess the use of using Shasta for SV characterization we created a workflow to extract putative heterozygous SVs from Shasta assembly graphs ( Methods). Extracting SVs from an assembly graph for HG002, the length distribution of indels shows the characteristic spikes for known retrotransposon lengths (Supplementary Fig.  1). Comparing these SVs to the high-confidence GIAB SV set we find good concordance, with a combined F1 score of 0.68 (Supplementary Table  16).\n  The MHC region is difficult to resolve using short reads due to its repetitive and highly polymorphic nature  37, and recent efforts to apply long-read sequencing to this problem have shown promise  18, 38. We analyzed the assemblies of CHM13 and HG00733 to see if they spanned the MHC region. For the haploid assemblies of CHM13 we find MHC is entirely spanned by a single contig in all four assemblers’ output, and most closely resembles the GL000251.2 haplogroup among those provided in GRCh38 (Fig.  3a, Supplementary Fig.  2 and Supplementary Table  17). In the diploid assembly of HG00733 two contigs span most of the MHC for Shasta and Flye, while Canu and Wtdbg2 span the region with one contig (Fig.  3b and Supplementary Fig.  3). However, we note that all these chimeric diploid assemblies lead to sequences that do not closely resemble any haplogroup ( Methods).\n Unpolished Shasta assembly for CHM13 and HG00733, including HG00733 trio-binned maternal and paternal assemblies. Shaded gray areas are regions in which coverage (as aligned to GRCh38) drops below 20. Horizontal black lines indicate contig breaks. Blue and green describe unique alignments (aligning forward and reverse, respectively) and orange describes multiple alignments.\n To attempt to resolve haplotypes of HG00733 we used trio-binning  39 to partition the reads for HG00733 into two sets based on likely maternal or paternal lineage and assembled the haplotypes ( Methods). For all assemblers and each haplotype assembly, the global contiguity worsened substantially (as the available read data coverage was approximately halved and, further, not all reads could be partitioned), but the resulting disagreement count decreased (Supplementary Table  18). When using haploid trio-binned assemblies, the MHC was spanned by a single contig for the maternal haplotype (Fig.  3c, Supplementary Fig.  4 and Supplementary Table  19), with high identity to GRCh38 and having the greatest contiguity and identity with the GL000255.1 haplotype. For the paternal haplotype, low coverage led to discontinuities (Fig.  3d) breaking the region into three contigs.\n  We developed a deep neural network-based consensus sequence polishing pipeline designed to improve the base-level quality of the initial assembly. The pipeline consists of two modules: MarginPolish and the homopolymer encoded long-read error-corrector for Nanopore (HELEN). MarginPolish uses a banded form of the forward–backward algorithm on a pairwise hidden Markov model (pair-HMM) to generate pairwise alignment statistics from the RLE alignment of each read to the assembly. From these statistics, MarginPolish generates a weighted RLE partial order alignment (POA)  40 graph that represents potential alternative local assemblies. MarginPolish iteratively refines the assembly using this RLE POA, and then outputs the final summary graph for consumption by HELEN. HELEN uses a multi-task recurrent neural network (RNN)  41 that takes the weights of the MarginPolish RLE POA graph to predict a nucleotide base and run length for each genomic position. The RNN takes advantage of contextual genomic features and associative coupling of the POA weights to the correct base and run length to produce a consensus sequence with higher accuracy.\n To demonstrate the effectiveness of MarginPolish and HELEN, we compared them with the state-of-the-art nanopore assembly polishing workflow: four iterations of Racon polishing  42 followed by Medaka. MarginPolish is analogous in function to Racon, both using pair-HMM-based methods for alignment and POA graphs for initial refinement. Similarly, HELEN is analogous to Medaka, in that both use a deep neural network and both work from summary statistics of reads aligned to the assembly.\n Figure  4a and Supplementary Tables  20– 22 detail error rates for the four methods performed on the HG00733 and CHM13 Shasta assemblies (see  Methods) using Pomoxis. For the diploid HG00733 sample MarginPolish and HELEN achieve a balanced error rate of 0.388% (Phred quality score QV = 24.12), compared to 0.455% (QV = 23.42) by Racon and Medaka. For both polishing pipelines, a notable fraction of these errors are likely due to true heterozygous variations. For the haploid CHM13 we restrict comparison to the highly curated X chromosome sequence provided by the T2T consortium  32. We achieve a balanced error rate of 0.064% (QV = 31.92), compared to Racon and Medaka’s 0.110% (QV = 29.59).\n a, Balanced error rates for the four methods on HG00733 and CHM13.  b, Row-normalized heatmaps describing the predicted run lengths ( x axis) given true run lengths ( y axis) for four steps of the pipeline on HG00733. Guppy v.2.3.3 was generated from 3.7 Gb of RLE sequence. Shasta, MarginPolish and HELEN were generated from whole assemblies aligned to their respectiv\n......", "posttime": "2020-05-06 06:21:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "从头,sequencing,组装,assembly", "title": "纳米孔测序和Shasta工具包实现11个人类基因组的从头组装", "title_en": "Nanopore sequencing&Shasta toolkit enable de novo assembly of 11 human genomes", "transed": 1, "url": "https://www.nature.com/articles/s41587-020-0503-6", "via": "", "real_tags": ["从头", "组装", "assembly"]}, {"category": "", "categoryclass": "", "imagename": "4a960aaaea695e514a6a32702ee1ecdc.png", "infoid": 1000850, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，我们再次发布Textile Hub，这是一个库和服务的集合，可以连接和扩展IPFS、Libp2p和Filecoin，这样您就可以构建应用程序、保护数据并取悦用户。此版本包括全新的服务、激动人心的Bucket更新、新的ThreadsDB版本，以及通向未来Filecoin支持的简单途径。\n我们的目标是让开发人员轻松快速地进行实验，然后高效地扩展成功的实验。Hub是我们热爱的协议的开源门户，并提供简单的开发人员工具来访问托管的ThreadsDB和IPFS节点(很快还会访问Filecoin)。更令人兴奋的是，开发人员随后会将访问权限传递给他们的用户。Hub提供了可互操作的数据存储选项，因此应用程序可以持久保存最终用户的数据，而不会将用户锁定在系统中。\nThreadsDB是一个构建在IPF之上的数据库，感觉就像MongoDB。它经过精心设计，充分考虑了性能，帮助消费者应用程序更有效地在分散的Web上移动数据。ThreadsDB支持P2P通信以及可在用户之间持久、服务和中继数据的不可信任的第三方服务。\nBucket是开发人员可以创建的动态目录，然后在远程IPFS对等体上持久化，并与他们的团队协作编辑。\nHub是通过js-thread和js-Texture提供的一组易于使用的Thread服务的第一个提供商。Hub让开发人员(和他们的应用程序用户)可以即时访问远程IFPS节点以实现持久性和联网。\n这个版本包含了如此之多的新功能和改进功能，不可能一一列出。这里有几个我们最喜欢的。\n所有新存储桶都获得子域&lt；bucket&gt；.textile.space。子域为Bucket的IPNS地址。Bucket支持多种协议，包括HTTP、Libp2p、IPFS、IPNS、ThreadsDB等等……。我们将添加Filecoin！🤩。\n存储桶开箱即可与IPN集成。从任何IPFS对等设备获取最新的Bucket内容，并为您的自定义域设置DNSLinks。🤯。\n构建可在ThreadsDB上运行的加密的P2P聊天应用程序，以确保无论何时何人在线，都能发送和接收消息。\n为文档、表单、笔记、照片、电子表格、时间跟踪、演示文稿构建分散的应用程序.。你说得出来！\n介绍Textile Hub-一组用于构建和扩展应用程序(和#Dapps)的工具。包括远程存储桶&amp；#IPFS资源、线程数据库服务等！#分散式#IPFS#developertools https://t.co/QqtSalpGfu。\n-纺织品(@textileio)2020年5月4日", "note_en": "Today, we&#39;re announcing the  Textile Hub, a collection of libraries and services that connect and extend  IPFS,  Libp2p, and  Filecoin so that you can build apps, secure data, and delight users. This release includes brand new services, exciting  Bucket updates, a new  ThreadsDB release, and a simple pathway to future Filecoin support.\n  Our goal is to make it easy for developers to experiment quickly and then scale  successful experiments efficiently. The Hub is an open-source portal to the protocols we love and offers simple developer tools to access hosted  ThreadsDB and IPFS nodes (and soon, Filecoin). What&#39;s even more exciting is that developers then pass on that access to their users. The Hub provides interoperable data storage options, so apps can persist data of end-users while not locking users into the system.\n ThreadsDB is a database built on IPFS that feels like MongoDB. It has been carefully designed with performance in mind, helping consumer applications move data across the decentralized web more effectively. ThreadsDB enables p2p communication as well as trustless 3rd party services that can persist, serve, and relay data among users.\n Buckets are dynamic directories that developers can create and then persist on remote IPFS peers and collaboratively edit with their team.\n The Hub is the first provider of an easy-to-use set of Thread services available through  js-threads and  js-textile. The Hub gives developers (and their app users) instant access to remote IFPS nodes for persistence and networking.\n  This release is packed with so many new and improved features it&#39;s impossible to list them all. Here are a few of our favorites.\n All new Buckets get subdomains &lt;bucket&gt;.textile.space. The subdomain is the IPNS address of the Bucket. Buckets support multiple protocols, including HTTP, Libp2p, IPFS, IPNS, ThreadsDB, and soon... we&#39;ll add Filecoin! 🤩\n Buckets are integrated with  IPNS out of the box. Get your latest Bucket content from any IPFS peer and setup  DNSLinks for your custom domain. 🤯\n   Build encrypted, p2p, chat apps that work over ThreadsDB to ensure messages are sent and received no matter who is online, when.\n  Build decentralized apps for docs, forms, notes, photos, spreadsheets, time tracking, presentations... you name it!\n  Introducing the Textile Hub - a collection of tools to build and scale apps (and  #dapps). Including remote Buckets &amp;  #IPFS resources, ThreadsDB services, and more!  #decentralized  #ipfs  #developertools  https://t.co/QqtSalpGfu\n— Textile (@textileio)  May 4, 2020", "posttime": "2020-05-06 06:20:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,database,app,数据库,hub", "title": "Texture Hub：面向应用程序构建商的数据库、存储和远程IPF", "title_en": "Textile Hub: databases, storage, and remote IPFS for app builders", "transed": 1, "url": "https://blog.textile.io/announcing-the-textile-protocol-hub/", "via": "", "real_tags": ["程序", "database", "app", "数据库", "hub"]}, {"category": "", "categoryclass": "", "imagename": "973aaff58fc6e5f88951c5dba835e963.jpg", "infoid": 1000849, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "全球冠状病毒大流行危机向我们展示了很多东西，但有几个东西是突出的。其中之一是，目前的疫苗和药物开发过程需要大量时间。一些人甚至会说，在遏制扩散方面产生预期影响的时间太长了。\n上面显示的疫苗开发过程中肯定有一些因素不能更快地完成，以开发出安全有效的疫苗。但对于其他步骤，现代技术可以大大缩短创造新疫苗和药物所需的时间。\n塔里克·达乌达(Tariq Daouda)博士在蒙特利尔大学免疫学和癌症研究所获得博士学位时，开发了一种人工智能算法，可以预测病毒的哪些部分更有可能暴露在感染细胞的表面，这些部分被称为表位。\n在过去的几周里，一个由几个免疫学和生物信息学博士组成的研究小组自愿建立了一个平台，将他们的研究开源。在几个软件开发商的无偿帮助下，他们今天推出了epecopes.world，这样世界各地的每个人都可以访问神经网络发现的结果，并将其用于进一步的研究。关于epecopes.world基于什么的研究也是一个团队的努力，可以在这里访问(PDF)。\nWORLD正在使用神经网络分析人类的基因组序列和病毒的不同变异，以预测进一步疫苗和药物研究的最佳表位候选。这一过程以前需要数周甚至数月的人工实验室工作-假设实验室能够获得足够的活病毒来进行研究。使用这种新的方法，只需要几个小时和特定病毒的基因序列就可以让神经网络发挥作用。\n细胞表面存在它们所含蛋白质的微小碎片。这些位被称为表位，用来向免疫系统表明细胞内发生了什么。当细胞被病毒感染时，来自病毒的遗传物质被注入细胞。\n然后，这种遗传物质开始产生新的病毒。然而，产生的病毒蛋白的一些(但不是全部)片段也会出现在细胞表面。\n通过分析病毒的基因序列，我们的人工智能算法(CAMAP)可以预测这种病毒的哪些片段更有可能出现在细胞表面。\n然后我们可以选择一组有很高机会出现在表面的片段，我们就可以设计出一种能够有效训练我们免疫系统的疫苗。\n如果免疫细胞随后遇到受感染的细胞，它们可以迅速识别它们并杀死病毒。\n“冠状病毒强调需要加快疫苗和疗法的设计，以减少全球大流行对人类和经济的影响，”哈佛医学院研究员、epecopes.world团队负责人Tariq Daouda博士说。“感染冠状病毒的人往往免疫细胞较少，因此很难获得足够的感染细胞，以便在实验室进行适当的研究--而且，由于冠状病毒非常罕见，各实验室都在争先恐后地获取这些细胞。”EPitopes.world让编码成为培养皿--利用开源技术将机器学习与生物医学联系起来，帮助加速学习和发现。Tariq周围的团队决定完全走开源之路，遵循他们对开源疫苗研究的终极愿景，缩影。world是他们的第一步。\nepecopes.world的团队正在孜孜不倦地改进和扩展ececopes.world的团队。world前端和后端都是在Apache 2下开源的。此外，所有的生物信息学家、数据科学家和机器学习专家都被邀请加入这个团队。“世界”的前台和后端都是开源的，而且所有的生物信息学家、数据科学家和机器学习专家都被邀请加入到这个团队中来。\nepecope.world高度赞赏为扩展该平台的功能并允许研究人员以新的、甚至更好的方式分析数据所做的贡献。\n这个团队在这么短的时间内取得的成就绝对是了不起的！我们很幸运有机会支持：\n整个ArangoDB团队都感到很幸运，能够有机会赞助在ArangoDB OASIS上运行的emecopes.world，并让我们团队中的人投入他们的空闲时间来支持这一事业。", "note_en": "There are many things the global coronavirus pandemic crisis has shown us, but there are a few things that stand out. One of them is that the current vaccine and drug development process takes a lot of time. Some would even say too long for having the desired impact on containing the spread.\n   There are for sure elements in the vaccine development process shown above that can’t be done much faster in order to develop a safe and effective vaccine. But for other steps, modern technology can contribute significantly to shorten the time needed for creating new vaccines and drugs.\n While obtaining his doctorate degree at the Institute for Research in Immunology and Cancer at the Université de Montréal, Tariq Daouda, PhD, developed an AI algorithm that can predict which parts of a virus are more likely to be exposed at the surface of infected cells, which are called epitopes.\n  Over the past weeks, a research team consisting of several PhDs in immunology and bioinformatics volunteered to build a platform open-sourcing their research. Together with the pro-bono help of several software developers, they launched  epitopes.world today, so that everyone around the globe can access the results the neural net found and utilize it for further research. The research on which epitopes.world is based on has also been a team effort and  can be accessed here (PDF).\n  Epitopes.world is using a neural net to analyze the genomic sequences of humans and different mutations of viruses to predict the best epitope candidates for further vaccine and drug research. This process previously took weeks or even months of manual lab work –  assuming the labs could get their hands on enough living viruses to conduct their research. With the new approach it only takes hours and the genetic sequence of a particular virus to let the neural net do its work.\n Cells present at their surface tiny fragments of the proteins that they contain. These bits are called epitopes and serve to indicate to the immune system what’s happening inside the cells. When a cell gets infected by a virus, the genetic material from the virus is injected into the cell.\n Then, the production of new viruses from this genetic material begins. However, some (but not all) fragments from the viral proteins produced also get presented at the cell surface.\n By analyzing the genetic sequence of the virus, our artificial intelligence algorithm (CAMAP) can predict which fragments of this virus are more likely to be presented at the cell surface.\n We can then select a combination of fragments that have a high chance of being presented at the surface, we can design a vaccine that will efficiently train our immune system.\n If immune cells then encounter infected cells, they can rapidly recognize them and kill the virus.\n “COVID-19 stresses the need to accelerate the design of vaccines and therapies to reduce the human and economic impact of global pandemics,” said Tariq Daouda, PhD, research fellow at Harvard Medical School and team lead of epitopes.world. “People infected with COVID-19 tend to have less immune cells, making it difficult to get enough infected cells to study them appropriately in a lab — and, because they are so rare, labs are in competition with each other to obtain them. Epitopes.world makes code the petri dish — utilizing open source technologies to connect machine learning to biomedicine to help accelerate learnings and findings.” The team around Tariq decided to completely go the open-source way to follow their ultimate vision of open-sourcing vaccine research, and  epitopes.world is their first step.\n  The team of epitopes.world is working tirelessly to improve and expand the  epitope.worlds frontend as well as the  backend, which are both open-source under Apache 2. Also all bioinformaticians, data scientists and machine learning specialists are invited to join the team.\n epitope.worlds highly appreciates contributions to expand the platform’s functionality and allowing researchers to analyze data in new, even better ways.\n  It is absolutely remarkable what the team achieved in such a short time! We feel lucky to have the chance to support:\n  The whole ArangoDB team feels blessed to have the opportunity to sponsor epitopes.world, which is running on  ArangoDB Oasis, and to have people on our team investing their free time to support this cause.", "posttime": "2020-05-06 06:20:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,培养皿,source,病毒,team", "title": "一个开源的培养皿-as-code", "title_en": "An open-source petri dish-as-code", "transed": 1, "url": "https://www.arangodb.com/2020/05/an-open-source-petri-dish-as-code/", "via": "", "real_tags": ["开源", "培养皿", "source", "病毒", "team"]}]