[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1073908, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每台计算机都需要一个功能强大的网络浏览器，但在运行Windows、macOS或Linux以外的计算机上，这说起来容易做起来难。仍然有一些人在使用OS/2操作系统，它是由微软和IBM创建的，并在2001年结束了主流开发，现在迫切需要一个功能强大的web浏览器。如果运气好的话，这套已有数十年历史的操作系统可以拥有与现代智能手机相同的网络引擎。\nOS/2语音社区主席罗德里克·克莱因（Roderick Klein）在一篇公告文章中透露，新水獭浏览器的公测版将“在2月的最后一周或3月的第一周”发布新浏览器基于Chrome引擎，该引擎支持Google Chrome、Microsoft Edge、Vivaldi和大多数其他非Firefox或Safari浏览器。该接口是在跨平台Qt框架中编写的。\nOS/2是IBM和微软在20世纪80年代末和90年代初联合开发的操作系统，其目标是取代所有基于DOS和Windows的系统。然而，在Windows 3.0和3.1大受欢迎之后，微软决定将重点放在Windows上，让IBM自己继续开发。IBM最终在2001年停止了OS/2的开发，但另外两家公司授权该操作系统继续IBM停止的工作——第一家是eComStation，最近一家是ArcaOS。\n按位工作的GMH和荷兰OS/ 2语音基金会2017开始在Outter浏览器上工作，因为在OS/2和ARCAOS上保持更新的Firefox版本变得越来越困难。2016年推出的Firefox 49 ESR是最新版本，因为那时Mozilla开始用锈迹代码重写Firefox的重要部分，并且OS/2没有锈迹编译器。从那时起，主要关注点一直是将Qt 5.0移植到OS/2，其中包括QtWebEngine（基于Chromium）。这一努力还有一个副作用，那就是未来可能会有更多的跨平台端口。\n帮助开发的史蒂文·莱文在一篇公告中说，“Qt5和Otter浏览器端口基本上是一个人的项目，在bww bitwise works其他员工和社区的帮助下。什么是Dmitry[主要开发者]正在做的是移植两个大型、复杂的项目，它们从未被设计为在32位平台上运行，也从未被设计为在OS/2上运行。在我看来，几乎没有开发人员能够在同一时间内完成他所做的事情。据我所见，这款浏览器几乎可以每天使用。已经有很多对我来说很重要的网站，我现在可以通过Otter访问，而不必在另一个平台上工作。\"\n尽管OS/2在任何想象中都不是现代操作系统，但ArcaOS发行版/fork仍在开发中，主要针对遗留系统和复古爱好者。最新的更新是v5。0.7在2021年12月，其中包括更新的驱动程序和内核修复。Otter Browser的开发者正在OS/2语音网站上接受捐款。", "note_en": "Every computer needs a capable web browser, but that’s easier said than done on computers running something besides Windows, macOS, or Linux. There are still a few people using the OS/2 operating system, which was created by Microsoft and IBM and ended mainstream development in 2001, and is in desperate need of a functional web browser. With any luck, the decades-old operating system could have the same web engine as modern smartphones.\n Roderick Klein, president of the OS/2 Voice community, revealed in  an announcement article that a public beta of the new Otter Browser will arrive “in the last week of February or the first week of March.” The new browser is based on the Chromium engine, the same one that powers Google Chrome, Microsoft Edge, Vivaldi, and most other browsers that aren’t Firefox or Safari. The interface is written in the cross-platform Qt framework.\n OS/2 was the operating system developed jointly by IBM and Microsoft in the late 1980s and early 1990s, with the intended goal of replacing all DOS and Windows-based systems. However, Microsoft decided to focus on Windows after the immense popularity of Windows 3.0 and 3.1, leaving IBM to continue development on its own. IBM eventually stopped working on OS/2 in 2001, but two other companies licensed the operating system to continue where IBM left off — first  eComStation, and more recently,  ArcaOS.\n  BitWise Works GmbH and the Dutch OS/2 Voice foundation  started work on Otter Browser in 2017, as it was becoming increasingly difficult to keep an updated version of Firefox available on OS/2 and ArcaOS. Firefox 49 ESR from 2016 is the  latest version available, because that’s around the time Mozilla started rewriting significant parts of Firefox with Rust code, and there’s no Rust compiler for OS/2. Since then, the main focus has been porting Qt 5.0 to OS/2, which includes the  QtWebEngine (based on Chromium). This effort also has the side effect of making more cross-platform ports possible in the future.\n Steven Levine, who helped with development,  said in an announcement post, “the Qt5 and Otter browser ports have basically been a one man project, with help other bww bitwise works employees and from the community. What Dmitriy [the main developer] is doing is porting two large, complex projects that were never designed to run on a 32-bit platform and were never designed to run on OS/2. IMO, there are few developers that could have accomplished what he has done in the same timeframe. From what I can see, the browser is close to being usable on a daily basis. There are already a number of sites, that matter to me, that I can now access with Otter, rather than having to work on another platform.”\n Even though OS/2 is not a modern operating system by any stretch of the imagination, the  ArcaOS distribution/fork is still under development, primarily targeting legacy systems and retro enthusiasts. The latest update was  v5.0.7 in December 2021, which included updated drivers and kernel fixes. The developers of Otter Browser are  accepting donations on the OS/2 Voice website.", "posttime": "2022-02-17 18:40:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "操作系统,browser,os", "title": "Otter Browser旨在将Chromium引入数十年前的OS/2操作系统", "title_en": "Otter Browser Aims To Bring Chromium To Decades-Old OS/2 Operating System", "transed": 1, "url": "https://www.xda-developers.com/otter-browser-os2/", "via": "", "real_tags": ["操作系统", "browser", "os"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073906, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用Axios AM和PM时事通讯，让忙碌的日子变得更简单。赶上什么&#39；这是新的，为什么它在5分钟内重要。\n订阅Axios Closer时事通讯，了解当天的商业新闻和趋势以及它们的重要性。\n深入VC、PE和M&amp；A按比例使用Axios。由Dan Primack和Kia Kokalitheva每天发送到你的收件箱。\n通过Axios体育通讯，尽情享受推动体育界的统计数据和故事。免费注册。\n通过Axios登录，从Valley和D.C.获取我们的智能接收技术。免费注册。\n找个内幕人士&#39；Axios的新白宫指南。免费注册。\n通过Axios Denver获取影响家乡的最重要故事的每日摘要\n通过Axios得梅因通讯获取影响家乡的最重要故事的每日摘要。\n通过Axios Twin Cities，每日获取影响家乡的最重要故事摘要\n通过Axios Tampa Bay时事通讯获取影响家乡的最重要故事的每日摘要。\n与Axios Charlotte一起获取影响家乡的最重要故事的每日摘要\n通过Axios Nashville时事通讯获取影响家乡的最重要故事的每日摘要。\n通过Axios Columbus时事通讯获取影响家乡的最重要故事的每日摘要。\n通过Axios Dallas时事通讯获取影响家乡的最重要故事的每日摘要。\n通过Axios Austin时事通讯获取影响家乡的最重要故事的每日摘要。\n通过Axios Atlanta时事通讯获取影响家乡的最重要故事的每日摘要。\n通过Axios Philadelphia通讯获取影响家乡的最重要故事的每日摘要。\n通过Axios芝加哥时事通讯获取影响家乡的最重要故事的每日摘要。\n关注当地记者撰写的影响阿肯色州西北部的最重要、最有趣的故事\n通过Axios DC时事通讯获取影响家乡的最重要故事的每日摘要。\n美国交通部国家公路交通安全管理局（NHTSA）周二发布了一项规定，允许在美国使用自适应远光前照灯或智能前照灯。\n重要原因：NHTSA表示，这项依靠传感器和LED灯的技术将有助于防止碰撞，因为它可以更好地照明行人、动物和物体，而不会影响其他车辆上驾驶员的能见度。\n自适应远光前照灯系统在欧洲和加拿大很常见，它可以自动将光束聚焦在较暗的无人区域，同时在迎面而来的车辆中降低照明强度。\n美国汽车协会（American Automobile Association）在2019年发布的研究发现，与美国近光前照灯相比，配备自适应前照灯系统的欧洲车辆的道路照明增加了多达86%。\n我们的思想泡沫，通过Axios&#39；乔安·穆勒：它&#39；现在是美国在智能大灯方面赶上世界其他国家的时候了。\n这些自适应远光灯将极大地提高行人、骑自行车者和其他驾驶者的安全性，在需要时照亮道路，而不会使迎面而来的车辆失明。\n他们&#39；你说&#34；NHTSA优先考虑我们国家道路上每个人的安全，无论他们在车内还是车外。新技术可以帮助推进这项任务；NHTSA副局长史蒂文·克利夫在一份声明中说。\n&#34;国家公路交通安全管理局发布这项最终规定是为了帮助提高安全性，保护弱势道路使用者&#34;", "note_en": "Make your busy days simpler with the Axios AM and PM newsletters. Catch up on what&#39;s new and why it matters in just 5 minutes.\n Subscribe to the Axios Closer newsletter for insights into the day’s business news and trends and why they matter.\n Dive into the world of dealmakers across VC, PE and M&amp;A with Axios Pro Rata. Delivered daily to your inbox by Dan Primack and Kia Kokalitcheva.\n Binge on the stats and stories that drive the sports world with the Axios Sports newsletter. Sign up for free.\n Get our smart take on technology from the Valley and D.C. with Axios Login. Sign up for free.\n Get an insider&#39;s guide to the new White House with Axios Sneak Peek. Sign up for free.\n Get a daily digest of the most important stories affecting your hometown with Axios Denver\n Get a daily digest of the most important stories affecting your hometown with the Axios Des Moines newsletter.\n Get a daily digest of the most important stories affecting your hometown with Axios Twin Cities\n Get a daily digest of the most important stories affecting your hometown with the Axios Tampa Bay newsletter.\n Get a daily digest of the most important stories affecting your hometown with Axios Charlotte\n Get a daily digest of the most important stories affecting your hometown with the Axios Nashville newsletter.\n Get a daily digest of the most important stories affecting your hometown with the Axios Columbus newsletter.\n Get a daily digest of the most important stories affecting your hometown with the Axios Dallas newsletter.\n Get a daily digest of the most important stories affecting your hometown with the Axios Austin newsletter.\n Get a daily digest of the most important stories affecting your hometown with the Axios Atlanta newsletter.\n Get a daily digest of the most important stories affecting your hometown with the Axios Philadelphia newsletter.\n Get a daily digest of the most important stories affecting your hometown with the Axios Chicago newsletter.\n Stay up-to-date on the most important and interesting stories affecting NW Arkansas, authored by local reporters\n Get a daily digest of the most important stories affecting your hometown with the Axios DC newsletter.\n   The Department of Transportation’s National Highway Traffic Safety Administration (NHTSA)  issued a rule Tuesday to allow adaptive driving beam headlights, or smart headlights, in the U.S.\n Why it matters: The technology, which relies on sensors and LED light, will help prevent crashes by allowing better illumination of pedestrians, animals and objects without impairing the visibility of drivers in other vehicles, NHTSA said.\n Adaptive driving beam headlight systems, which are commonplace in Europe and Canada, automatically focus beams on darker, unoccupied areas while reducing the intensity of illumination in times of oncoming traffic.\n Research released in 2019 by the American Automobile Association found that European vehicles with adaptive headlight systems increase roadway lighting by as much as 86% when compared to U.S. low beam headlights.\n Our thought bubble,  via Axios&#39; Joann Muller: It&#39;s about time that the U.S. caught up with the rest of the world when it comes to smart headlights.\n These adaptive driving beams are going to dramatically improve safety for pedestrians, cyclists and other motorists by illuminating the roadway where and when you need it — without blinding oncoming traffic.\n What they&#39;re saying: &#34;NHTSA prioritizes the safety of everyone on our nation’s roads, whether they are inside or outside a vehicle. New technologies can help advance that mission,&#34; said Steven Cliff, NHTSA’s deputy administrator, in a statement.\n &#34;NHTSA is issuing this final rule to help improve safety and protect vulnerable road users.&#34;", "posttime": "2022-02-17 18:34:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,汽车,automakers,axios", "title": "美国为汽车制造商安装智能头灯扫清道路", "title_en": "US Clears Way For Automakers To Install Smart Headlights", "transed": 1, "url": "https://www.axios.com/cars-smart-headlights-nhtsa-6686a7aa-ee4a-4fa4-a764-ccb58b96d40d.html", "via": "", "real_tags": ["美国", "汽车", "axios"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073905, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司表示，它将给其他公司足够的时间来适应安卓软件的变化。苹果做出的类似改变也影响了大型互联网公司。\n谷歌周三表示，它正在制定隐私措施，以限制运行安卓软件的智能手机上的数据共享。但该公司承诺，这些变化不会像苹果去年的类似举措那样具有破坏性。\n苹果在iPhone上对其iOS软件进行的更改在允许广告商追踪之前，需要获得用户的许可。苹果的许可控制——以及最终用户阻止跟踪的决定——对那些以所谓的定向广告为基础建立业务的互联网公司产生了深远的影响。\n谷歌没有提供其变化的确切时间表，但表示将在至少两年内支持现有技术。\n本月，作为Facebook成立的Meta公司表示，苹果的隐私变更将使其今年损失100亿美元的广告收入。这一消息打压了Meta的股价，并引发了对其他依赖数字广告的公司的担忧。\n谷歌安卓部门副总裁安东尼·查韦斯（Anthony Chavez）在宣布之前接受采访时表示，现在评估谷歌的变化可能带来的影响还为时过早，这些变化旨在限制应用程序之间以及与第三方共享数据。但他强调，该公司的目标是为用户找到一个更私密的选择，同时也允许开发商继续创造广告收入。\n作为世界上最大的两个智能手机软件供应商，谷歌和苹果对移动应用程序在数十亿台设备上的功能具有重大影响。为了增加隐私或为用户提供对其数据的更大控制权（客户、监管机构和政界人士日益增长的需求）而做出的改变，会让收集数据的公司付出代价，以销售符合用户利益和人口统计特征的个性化广告。\n查韦斯说，如果谷歌和苹果不提供注重隐私的替代方案，广告商可能会转向更隐蔽的选项，从而减少对用户的保护。他还指出，苹果的“直截了当的做法”被证明是“无效的”，引用了一项研究，该研究称，iOS的变化在阻止第三方跟踪方面没有产生重大影响。\n谷歌和苹果的变化意义重大，因为过去20年来，基于用户数据积累的数字广告一直支撑着互联网。但随着用户对影响深远的数据收集越来越怀疑，以及对科技巨头的普遍不信任，这种商业模式面临着更多挑战。\n苹果和谷歌在方法上的差异也说明了两家公司是如何赚大钱的。苹果的大部分收入来自销售设备，而谷歌的收入主要来自销售数字广告，可能更愿意考虑广告商的需求。\n营销软件公司Iterable的产品总监韦恩·科伯恩（Wayne Coburn）表示，当苹果积极将隐私作为运行安卓系统的产品的卖点时，谷歌采取这些措施并不奇怪。不过，他表示，谷歌的做法提供了一个两年的时间表，感觉像是一种“软弱的姿态”。他预计，该公司将面临“做得更多、更快”的压力\n“这是对苹果所做的事情的反应，”科伯恩说。“谷歌不会自己做这件事。”\n谷歌表示，计划将其隐私倡议隐私沙盒（privacy Sandbox）引入安卓系统，安卓系统是世界上使用最广泛的移动设备软件。隐私沙盒主要用于减少谷歌Chrome浏览器上的跟踪。谷歌被迫改变其在Chrome上消除所谓的Cookie（一种追踪工具）的方法，同时面临隐私组织和广告商的抵制。\n谷歌表示，它将在安卓系统中提出一些新的注重隐私的方法，以允许广告商评估广告活动的表现，并根据过去的行为或最近的兴趣展示个性化广告，以及限制通过应用程序进行隐蔽跟踪的新工具。谷歌没有提供太多关于这些新替代方案如何工作的细节。\n谷歌表示，作为这些变化的一部分，它计划逐步淘汰广告ID，这是安卓系统中的一项跟踪功能，帮助广告商了解用户是否点击了广告或购买了产品，并跟踪他们的兴趣和活动。谷歌表示，它已经允许用户通过删除跟踪标识来选择退出个性化广告。\n该公司表示，计划为包括谷歌在内的所有人消除安卓系统广告中使用的标识符。查韦斯说，谷歌自己的应用程序在没有具体说明如何工作的情况下，将不会有特殊或特权访问Android数据或功能。这与谷歌向英国监管机构做出的承诺相呼应，即不会对自己的产品给予优惠待遇。\n该公司没有提供消除广告ID的最终时间表，但承诺将现有系统保留两年。谷歌表示，将向广告商提供其新提案的预览版，然后在今年发布更完整的测试版。\n查韦斯说，谷歌的举动并不是由苹果的行动推动的，他补充说，该公司一直在寻求“提高隐私标准”。", "note_en": "It says it will give other companies plenty of time to adapt to changes to its Android software. Similar changes made by Apple affected big internet companies.\n Google said on Wednesday that it was working on privacy measures meant to limit the sharing of data on smartphones running its Android software. But the company promised those changes would not be as disruptive as a similar move by Apple last year.\n Apple’s changes to its iOS software on iPhones asked users for permission before allowing advertisers to track them. Apple’s permission controls — and, ultimately, the decision by users to block tracking — have had  a profound impact on internet companies that built businesses on so-called targeted advertising.\n Google did not provide an exact timeline for its changes, but said it would support existing technologies for at least two more years.\n This month, Meta, the company founded as Facebook, said Apple’s privacy changes would cost it  $10 billion this year in lost advertising revenue. The revelation weighed on Meta’s stock price and led to concerns about other companies reliant on digital advertising.\n  Anthony Chavez, a vice president at Google’s Android division, said in an interview before the announcement that it was too early to gauge the potential impact from Google’s changes, which are meant to limit the sharing of data across apps and with third parties. But he emphasized that the company’s goal was to find a more private option for users while also allowing developers to continue to make advertising revenue.\n As the world’s two biggest smartphone software providers, Google and Apple hold significant sway over what mobile apps can do on billions of devices. Changes to increase privacy or provide users with greater control over their data — a growing demand from customers, regulators and politicians — come at a cost for companies collecting data to sell ads personalized to a user’s interests and demographics.\n Mr. Chavez said that if Google and Apple did not offer a privacy-minded alternative, advertisers might turn to more surreptitious options that could lead to fewer protections for users. He also argued that Apple’s “blunt approach” was proving “ineffective,” citing  a study that said the changes in iOS had not had a meaningful impact in stopping third-party tracking.\n  The changes from Google and Apple are significant because digital advertising based on the accumulation of data about users has underpinned the internet for the last 20 years. But that business model is facing more challenges as users have grown more suspicious about far-reaching data collection amid a general distrust of technology giants.\n The difference in approaches between Apple and Google also speaks to how each company makes the bulk of its money. Apple generates most of its revenue from selling devices, while Google makes its money largely from selling digital advertising and may be more open to considering the needs of advertisers.\n  Wayne Coburn, a product director at Iterable, a marketing software company, said it was not surprising that Google was taking these steps when Apple was aggressively pitching privacy as a selling point over products running Android. Still, he said Google’s approach felt like a “weak gesture” by providing a two-year timeline. He expects the company will be pressured to “do more, faster.”\n “This is a reaction to what Apple has done,” Mr. Coburn said. “Google wouldn’t be doing this on their own.”\n Google said it planned to bring its privacy initiative, Privacy Sandbox, which had been limited mainly to reducing tracking on the company’s Chrome browser, to Android — the world’s most widely used software for mobile devices. Google has been forced to  revamp its approach to eliminating so-called cookies, a tracking tool, on Chrome while facing resistance from privacy groups and advertisers.\n Google said it was proposing some new privacy-minded approaches in Android to allow advertisers to gauge the performance of ad campaigns and show personalized ads based on past behavior or recent interests — as well as new tools to limit covert tracking through apps. Google did not offer much in terms of detail about how these new alternatives would work.\n As part of the changes, Google said, it plans to phase out Advertising ID, a tracking feature within Android that helps advertisers know whether users clicked on an ad or bought a product as well as keep tabs on their interests and activities. Google said it already allowed users to opt out of personalized ads by removing the tracking identifier.\n The company said it planned to eliminate identifiers used in advertising on Android for everyone — including Google. Mr. Chavez said Google’s own apps would not have special or privileged access to Android data or features without specifying how that would work. This echoes a pledge Google made to regulators in Britain that it would not give preferential treatment to its own products.\n The company did not offer a definitive timeline for eliminating Advertising ID, but it committed to keeping the existing system in place for two years. Google said it would offer preview versions of its new proposals to advertisers, before releasing a more complete test version this year.\n  Mr. Chavez said Google’s move had not been prompted by Apple’s actions, adding that the company is always looking to “raise the bar” on privacy.", "posttime": "2022-02-17 18:30:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,计划,plans", "title": "谷歌计划改变隐私，但承诺不会造成破坏", "title_en": "Google Plans Privacy Changes, but Promises To Not Be Disruptive", "transed": 1, "url": "https://www.nytimes.com/2022/02/16/technology/google-android-privacy.html", "via": "", "real_tags": ["谷歌", "google", "计划", "plans"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073904, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个学术研究项目发现，数千名JavaScript开发人员正在为他们的npm帐户使用一个带有过期域的电子邮件地址，使他们的项目容易被劫持。\n微软和北卡罗琳州立大学的研究人员去年进行了这项研究，分析了上传到Node Package Manager（npm）上的1630101个库的元数据。Node Package Manager是JavaScript库的事实存储库，也是互联网上最大的包存储库。\n研究人员表示，他们发现2818名项目维护人员仍在使用他们的帐户的电子邮件地址，这些帐户的域名已过期，其中一些在GoDaddy等网站上出售。\n该团队认为，攻击者可以购买这些域，在自己的电子邮件服务器上重新注册维护者的地址，然后重置维护者的帐户密码并接管其npm包。\n这样的攻击会起作用，因为npm门户不会对帐户所有者强制实施双因素身份验证（2FA），这意味着一旦攻击者重置所有者的密码，他们就可以在任何其他障碍的情况下自由更改包。\n研究团队表示，总共有2818个维护者帐户管理8494个包，这些包平均有2.43个直接依赖者，这意味着任何攻击都会影响数万个其他下游项目。\n帐户所有者可以发现类似的帐户劫持，但研究人员还指出，许多npm库和帐户要么没有维护（58.7%）要么被放弃（44.3%），攻击者很有可能在维护者没有注意到的情况下实施攻击。\n研究团队表示，他们将报告的发现通知了npm安全团队，但没有说明npm团队的反应。在本文发表之前，发送给npm所有者GitHub的一封电子邮件没有被回复。\n然而，值得注意的是，在2021年12月公布这项研究之前几天，NPM水果挞宣布计划慢慢地开始为开发者账户强制2FA。这一过程计划分多个阶段进行，本月初，前100名维护者帐户将被纳入强制性2FA。\n有关该研究的更多详细信息，请参阅“npm供应链中的薄弱环节是什么？”研究论文。研究团队的其他一些发现也列在下面：\n2.2%（33249）的软件包使用安装脚本，这些脚本可能被滥用来运行恶意命令，并且违反npm最佳安全实践；\n排名前1%的软件包（14941个）平均每个软件包有32.4个维护者，这为不活跃或漫不经心的开发人员的帐户打开了攻击之门；\n389个包为每个维护人员提供了40个贡献者，为意外插入安全漏洞打开了大门，或者为一个项目注入了大量的贡献来潜入恶意代码；\n前1%的维护人员平均拥有180.3个包，直接依赖于4010个平均包，这意味着一些开发人员可能工作过度，或者没有时间彻底维护或审查包更改。", "note_en": "An academic research project found that thousands of JavaScript developers are using an email address with an expired domain for their npm accounts, leaving their projects exposed to easy hijacks.\n The study, performed last year by researchers from Microsoft and North Caroline State University, analyzed the metadata of 1,630,101 libraries uploaded on  Node Package Manager (npm), the de-facto repository for JavaScript libraries and the largest package repository on the internet.\n  Researchers said they found that 2,818 project maintainers were still using an email address for their accounts that had an expired domain, some of which they found on sale on sites like GoDaddy.\n The team argued that attackers could buy these domains, re-register the maintainer’s address on their own email servers, and then reset the maintainer’s account password and take over his npm packages.\n An attack like this would work because the npm portal does not enforce two-factor authentication (2FA) for account owners, meaning that once the attacker reset the owner’s password, they would be free to alter packages with any other hindrance.\n In total, the research team said the 2,818 maintainer accounts managed 8,494 packages, which had an average of 2.43 direct dependents, denoting that any attack would also hit tens of thousands of other downstream projects.\n Account hijacks like these could be spotted by the account owners, but researchers also pointed out that many npm libraries and accounts are either unmaintained (58.7%) or abandoned (44.3%), and there would be a big chance that attackers would be able to carry out their attacks without the maintainers even noticing.\n  The research team said they notified the npm security team of their report’s findings but did not say how the npm team reacted. An email sent to GitHub, which owns npm, was not returned before this article’s publication.\n However, it is worth noting that days before this study was published in December 2021, npm  announced plans to slowly start enforcing 2FA for developer accounts. This process was scheduled to take place in multiple stages, with the Top 100 maintainer accounts being enrolled in mandatory 2FA  at the start of this month.\n Additional details on the study are available in the “ What are Weak Links in the npm Supply Chain?” research paper. Some of the research team’s other findings are also listed below:\n 2.2% (33,249) of packages used install scripts, which could be abused to run malicious commands and is against npm best security practices;\n The Top 1% packages (14,941) had an average of 32.4 maintainers per package, opening the door for attacks via the accounts of inactive or inattentive developers;\n 389 packages had 40 contributors for every maintainer, opening the door for the accidental insertion of security flaws or flooding a project with contributions to sneak in malicious code;\n The top 1% maintainers own an average number of 180.3 packages with direct dependents of 4,010 average packages, meaning some developers could be overworked or not have time to thoroughly maintain or review package changes.", "posttime": "2022-02-17 18:27:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "帐户,npm", "title": "数千个Npm帐户使用带有过期域的电子邮件地址", "title_en": "Thousands of Npm Accounts Use Email Addresses With Expired Domains", "transed": 1, "url": "https://therecord.media/thousands-of-npm-accounts-use-email-addresses-with-expired-domains/", "via": "", "real_tags": ["帐户", "npm"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073901, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "距离2月25日发布日期还有两周，Valve已经向GitLab发布了蒸汽甲板外壳的CAD文件。该公司表示，该产品的发布对于DIY爱好者、改装者，尤其是配件制造商来说，是一个“好消息”。这三个小组都可以使用提供的技术图纸和示意图来3D打印手持设备的定制外壳。\n正如Eurogamer所指出的，Valve在这里的决定很有趣。它建议该公司允许箱子制造商自由制造蒸汽甲板的售后外壳。事实上，Valve表示“期待看到社区创造的东西！”与索尼在PlayStation 5上的做法形成对比。当索尼最新的游戏机第一次发货时，只有一种颜色，一个由公司组成的家庭手工业突然兴起，为PS5生产彩色平板。然而，索尼很快就关闭了这些项目，然后宣布推出一套供人们购买的首日封。\nEngadget推荐的所有产品均由我们的编辑团队选择，独立于我们的母公司。我们的一些故事包括附属链接。如果你通过其中一个链接购买东西，我们可能会获得会员佣金。\n由于您的隐私偏好，此内容不可用。在此处更新设置，然后重新加载页面以查看它。", "note_en": "With two weeks to go before its  February 25th release date, Valve has published CAD files for Steam Deck’s exterior shell to  GitLab. Making them available under a Creative Commons license, the company  noted the release is “good news” for DIY enthusiasts, modders and most notably, accessory manufacturers. All three groups can use the provided technical drawings and schematics to 3D-print custom shells for the handheld.\n As   Eurogamer notes, Valve’s decision here is an interesting one. It suggests the company will allow case makers to freely make aftermarket shells for Steam Deck. In fact, Valve said it was “looking forward to seeing what the community creates!” Contrast that to the approach Sony has taken with the PlayStation 5. When Sony’s latest console first shipped and only came in one color, an entire  cottage industry of companies sprang up to produce colored plates for the PS5. However, Sony quickly moved to  shut down those projects before it went on to announce a set of  first-party covers for people to purchase.\n   All products recommended by Engadget are selected by our editorial team, independent of our parent company. Some of our stories include affiliate links. If you buy something through one of these links, we may earn an affiliate commission.\n   This content is not available due to your privacy preferences.  Update your settings here, then reload the page to see it.", "posttime": "2022-02-17 18:20:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "打印,发布,定制,custom", "title": "阀门发布蒸汽甲板CAD文件，允许任何人3D打印定制外壳", "title_en": "Valve Releases Steam Deck CAD Files Allowing Anyone To 3D-Print Custom Shells", "transed": 1, "url": "https://www.engadget.com/valve-steam-deck-cad-files-release-175935793.html", "via": "", "real_tags": ["打印", "发布", "定制", "custom"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073900, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "仅24小时，《迷失方舟》就轻松地超过了100万名并发玩家，成为Steam历史上并发次数第二多的游戏。亚马逊游戏公司（Amazon Games）与Smilegate RPG合作，对《迷失方舟》（Lost Ark）进行本地化和翻译，并将其翻译成英文，之后，类似暗黑破坏神的MMO于昨日在西方推出。现在，它已经同时通过了《反击：全球进攻》和《Dota 2》两项记录，这两项记录经常占据Steam最热门游戏的榜首。\nLost Ark现在非常受欢迎，它遇到了服务器问题，而且有一个队列要开始播放。SteamDB列出了1311842名《迷失方舟》的并发玩家，超过了CS:GO的1308963名玩家和1295114名Dota 2的记录。不过，目前尚不清楚这些玩家中到底有多少人在积极地玩游戏，而不是坐在服务器队列中。\n不管怎样，它现在是仅次于PUBG的第二大并发列表。要打败普格队历史上3257248名球员的巅峰状态，还有很长的路要走。《迷失方舟》是亚马逊游戏的第二大热门，四个月前，新世界创下了913634名玩家的同期记录。\n《迷失方舟》最初于2019年在韩国发行，在韩国、俄罗斯和日本拥有数百万活跃玩家。它可以免费玩，而且也很快上升到Twitch的榜首，超过了流行的聊天类。", "note_en": "Lost Ark has comfortably passed 1 million concurrent players after just 24 hours, becoming the second most played game in Steam history by concurrent counts. The  Diablo-like MMO launched yesterday in the West, after Amazon Games collaborated with Smilegate RPG to localize and translate  Lost Ark and make it available in English. It has now passed concurrent records for both  Counter-Strike: Global Offensive and  Dota 2, which regularly dominate the top of Steam’s most-played games.\n Lost Ark is so popular right now that it has experienced server issues and there’s a queue just to start playing.  SteamDB lists concurrent players of  Lost Ark at 1,311,842, passing  CS:GO’s record of 1,308,963 players and  Dota 2’s of 1,295,114. It’s not clear exactly how many of those players are actually actively playing the game and not sitting in a server queue, though.\n Either way, it’s now second place on the top concurrent list behind only  PUBG. It still has a long way to go to beat  PUBG’s all-time peak of 3,257,248 players.  Lost Ark is a second huge hit for Amazon Games, after  New World set a concurrent record of 913,634 players four months ago.\n Lost Ark was originally released in 2019 in South Korea, and has millions of active players in South Korea, Russia, and Japan. It’s free-to-play and has also quickly risen to the top of Twitch, overtaking the popular Just Chatting category.", "posttime": "2022-02-17 18:18:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,方舟,lost,服务器", "title": "仅仅24小时后，《迷失方舟》就成为蒸汽历史上第二大热门游戏", "title_en": "After Just 24 Hours 'Lost Ark' Becomes the Second Most Played Game in Steam History", "transed": 1, "url": "https://www.theverge.com/2022/2/12/22930757/lost-ark-steam-most-played-game-launch", "via": "", "real_tags": ["游戏", "方舟", "lost", "服务器"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073898, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与安卓12不同的是，谷歌计划在四月推出两个开发者版本，然后在2021个月前推出测试版。根据谷歌的路线图，最终版本最早可能在8月发布，而安卓12则在10月初发布。\n所有这些都是在安卓12L（安卓大屏幕设备版本）还在开发的同时发生的，不过谷歌指出，它也将把其中一些功能带到安卓13上。其中包括在Chromebook上改进对平板电脑、可折叠电脑和Android应用程序的支持。\n到目前为止，Android 13最明显的变化之一是，谷歌将把Material You的动态颜色功能带到所有应用程序图标上，默认情况下，该功能会从你的主屏幕图像中获取提示。开发者必须提供一个单色的应用程序图标才能工作，很多人希望这样做，因为目前主题和非主题图标的混合并不能带来很好的外观。不过，目前这只在像素设备上可用，谷歌表示将与其合作伙伴合作，将其应用到更多设备上。\n与之前的版本一样，谷歌在这里强调隐私和安全。例如，有一个新的全系统照片和视频采集器，它允许你与应用程序共享本地设备或云上的照片，而无需让该应用程序访问你的所有照片。Android已经有了一个文档选择器，但没有专门的照片和视频选择器。想要使用此功能的开发者可以使用新的API，他们的应用程序无需申请许可即可查看设备上的所有媒体。\n以类似的方式，谷歌现在也让应用程序更容易请求附近Wi-Fi设备的列表，而无需请求位置许可。到目前为止，这两者是交织在一起的，如果不请求位置许可，你无法获得有关附近接入点的信息。\n有了安卓13，谷歌将继续围绕Project Mainline开展工作，该项目旨在通过谷歌Play系统更新，让更多操作系统可更新，而无需等待供应商向用户提供安卓point更新。“我们现在可以通过对现有模块的更新，将photo picker和OpenJDK 11等新功能直接推广给Android旧版本的用户。我们还添加了新模块，如蓝牙和超宽带模块，以进一步扩大Android可更新的核心功能的范围，”该公司在今天的新闻发布会上解释道公告\n对于你们中的多语用户，Android 13还将提供每个应用程序的语言首选项——或者，至少，应用程序将允许您选择不同于系统语言的语言。这将有一个API，谷歌的Jetpack库中也将有一个类似的API。\n在Android 13中，谷歌还将使开发者更容易强调他们提供快速设置的互动程序。应用程序以前可能已经提供了自定义的快速设置，但除非你知道它们，否则很可能你从未见过它们。现在，开发人员获得了一个新的API，它允许他们提示用户直接将他们的自定义磁贴添加到“快速设置”菜单中。\n其他新功能包括可编程着色器、Android核心库的更新，以使其与OpenJDK 11 LTS版本保持一致，以及更快的连字号。谷歌解释道：“在Android 13中，我们已经优化了多达200%的断字性能，所以现在你可以在文本视图中启用它，而几乎不影响渲染性能。”。\n对于安卓13中的许多选择加入更改，谷歌现在也再次通过提供一个切换列表，从开发者选项或adb中打开和关闭它们，让开发者更容易测试它们。\n像往常一样，这些早期版本只能下载，所以如果你想试一试，你必须在手机上闪现一个系统映像（之后，你将获得无线更新）。在这个版本中，谷歌支持Pixel 6 Pro、Pixel 6、Pixel 5a 5G、Pixel 5、Pixel 4a（5G）、Pixel 4a、Pixel 4 XL和Pixel 4（对不起，Pixel 3的所有者）。Android Studio中还将为Android Emulator提供一个系统映像，并为想要测试它的供应商提供通用系统映像（即纯Android）。", "note_en": "Unlike with Android 12, Google plans to have two developer releases and then launch a beta in April, a month earlier than in 2021. The final release could come as early as August, based on Google’s roadmap, whereas Android 12 launched in early October.\n All of this is happening while Android 12L, the Android release for large-screen devices, is still in development, too, though Google notes that it will bring some of those features to Android 13 as well. These include improved support for tablets, foldables and Android apps on Chromebooks.\n   One of the most visible changes in Android 13 so far is that Google will bring the dynamic color feature of Material You, which by default takes its cues from your home screen image, to all app icons. Developers will have to supply a  monochromatic app icon for this to work, which many will hopefully do, because the current mix of themed and un-themed icons doesn’t make for a great look. For now, this will only be available on Pixel devices, though, and Google says it will work with its partners to bring it to more devices.\n  As with previous releases, Google is putting an emphasis on privacy and security here. There is a new system-wide photo and video picker, for example, which allows you to share with an app photos from your local device or the cloud — all without giving that app access to all of your photos. Android already featured a document picker, but not a dedicated photo and video picker. Developers that want to use this feature will be able to do so with a new API and their apps won’t have to ask for permission to view all media on a device.\n   In a similar way, Google is also now making it easier for apps to ask for a list of nearby Wi-Fi devices  without having to ask for location permissions. Until now, these two were intertwined and you couldn’t get information about nearby access points without asking for location permissions.\n With Android 13, Google continues its efforts around Project Mainline, its project to make more of the operating system updatable through Google Play system updates without having to wait for vendors to make Android point updates available to their users. “We can now push new features like photo picker and OpenJDK 11 directly to users on older versions of  Android through updates to existing modules. We’ve also added new modules, such as the Bluetooth and Ultra wideband modules, to further expand the scope of  Android’s updatable core functionality,” the company explains in today’s announcement.\n For the multilingual among you, Android 13 will also feature  per-app language preferences — or, at least, apps will be able to let you choose a language that’s different from the system language. There will be an API for that, as well as a similar API in Google’s Jetpack library.\n In Android 13, Google will also make it easier for developers to highlight that they offer Quick Setting tiles. Apps could already offer custom quick settings before, but unless you knew about them, chances are you’d never seen them. Now, developers get a new API that allows them to prompt users to directly add their custom tiles to the Quick Settings menu.\n  Other new features include  programmable shaders, updates to the Android core libraries to align them with the OpenJDK 11 LTS release and — get hyped — faster hyphenation. “In  Android  13 we’ve optimized hyphenation performance by as much as 200% so you can now enable it in your TextViews with almost no impact on rendering performance,” Google explains.\n  For a lot of the opt-in changes in Android 13, Google now also once again makes it easier for developers to test them by providing a list of toggles to turn them on and off from the developer options or  adb.\n As usual, these early releases will only be available as downloads, so if you want to give them a try, you’ll have to flash a system image to your phone (after that, you’ll get over-the-air updates). With this release, Google supports the Pixel 6 Pro, Pixel 6, Pixel 5a 5G, Pixel 5, Pixel 4a (5G), Pixel 4a, Pixel 4 XL and Pixel 4 (sorry, Pixel 3 owners). There will also be a system image for the Android Emulator in Android Studio and  generic system images (that is, pure Android) for vendors who want to test that.", "posttime": "2022-02-17 18:15:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,android,开发者,preview,谷歌", "title": "Android 13的第一次开发者预览已经到来", "title_en": " The First Developer Preview of Android 13 Has Arrived", "transed": 1, "url": "https://techcrunch.com/2022/02/10/the-first-developer-preview-of-android-13-has-arrived/", "via": "", "real_tags": ["开发", "android", "开发者", "preview", "谷歌"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073897, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在广受欢迎的订阅服务MoviePass崩溃并烧毁两年后，其联合创始人斯泰西·斯派克（Stacy Spikes）决心将其恢复。斯派克斯表示，MoviePass将于今年夏天回归。\n该公司于2018年被斯派克（Spikes）不客气地赶出影城，最近被斯派克（Spikes）收购。该公司今天在纽约林肯中心（Lincoln Center）的沃尔特·里德剧院（Walter Reade Theater）举行了发布会。Spikes一开始就毫不费时地向房间里的Helios和Matheson Analytics形状的大象致辞。这家公司因是MoviePass的母公司而臭名昭著。MoviePass收购了这家初创公司后不久，就成功地将整个事情搞砸了。这家公司以月费提供无限电影票而闻名。\n斯派克斯说：“很多人赔钱了，很多人失去了信任。”他声称自己是公司管理不善造成伤害的人之一。在活动的开幕式上，Spikes在回应被赶出公司的失望、嘲笑MoviePass的忠实消费者以及它的超级用户之间摇摆不定，Spikes崩溃是公司倒闭的原因，最后，在2020年母公司破产后，将该公司重新收购的过程。\n“我们从另一个角度来看这一点，”斯派克斯谈到公司的重新启动时说，他补充说，他现在计划以“合作”的方式经营这一业务。斯派克斯补充说，MoviePass用户将能够持有该公司的部分所有权，其最高级的一级包括终身订阅。\n该活动有时有点奇怪，当Spikes暂停以确保他的笑话和提议在现场与会者中落地时，可以听到无声的掌声。Spikes有时听起来更像是他在Ted上发表的关于戏剧版的热情演讲，而不是产品发布。他在自己的新愿景下大肆宣传重新启动，他说，新愿景将“由web3技术提供动力”\n据Spikes称，该公司最初的工程团队正在重新启动业务，该服务将于今年夏天推出。在新模式下，MoviePass将使用按月滚动的可交易信用证。订户还可以使用信用卡带朋友来，这与MoviePass以前使用的单用户卡系统截然不同，后者可能会让非持卡人感到恼火。\n斯派克斯说，MoviePass 2.0还将在分层系统上运行。Spikes分享了新应用的beta版和基于信用卡的系统的图片，这些图片将根据高峰电影观看时间等情况而有所不同。从慈善角度讲，MoviePass对订户的雄心是雄心勃勃的。Spikes希望在2030年之前占领30%的观众市场，这是MoviePass的“登月”目标。\n毫不奇怪，MoviePass将整合Spikes现有业务预览的各个方面，这项技术已被用于让游戏玩家用广告视图换取游戏内货币。（这种电影形式之前曾被《内幕人士》（Spikes to Insider）嘲笑过。）Presshow的工作方式是，你必须实际查看广告——它跟踪你的注意力是否在手机上得到训练。一旦用户“完成预演”，他们将获得积分，然后可以通过MoviePass平台购买门票。\n斯派克斯在活动中告诉与会者，MoviePass最忠实的粉丝将被“代理”给测试版用户，并将能够在第一年免费使用该体验。在夏天的某个时候，这些用户将被联系到测试版编程。\nMoviePass的第二人生于2011年由一个由联合创始人斯派克斯领导的开发团队推出，在Helios和Matheson Analytics的指导下，它经历了一系列灾难性的失败。该公司在2017年购买了该公司的多数股权，随后直接将其投入运营。\nSpikes在2018年被Helios and Matheson Analytics的高管Ted Farnsworth和Mitch Lowe解雇，据说是因为他们担心该服务每月10美元的支付结构不可持续（Spikes称，这是暂时的）。此后不久，这项服务开始崩溃——资金大量流失，服务发生了突然的变化，应用有时根本无法运行（后来有报道称这是故意的）。该服务最终于2019年关闭，Helios和Matheson Analytics于次年申请破产。\n然后，去年冬天，Spikes回购了该公司，并宣布了重新推出该服务的计划。斯派克斯当时在与《内幕》的杰森·格拉西奥（Jason Guerrasio）交谈时表示，回购他帮助打造的品牌的决定“受到了电影界持续关注的鼓舞”。杰森·格拉西奥曾广泛报道过这部电影\n他补充说，“我们相信，如果做得好，影院订阅可以在将电影观众人数提升到新高度方面发挥重要作用。”\nSpikes似乎对个别影院连锁店推出的现有订阅不屑一顾，而是暗示MoviePass将提供比单个参展商更多的选择和更大的灵活性。自从MoviePass停刊以来，很多影院都推出了自己的超级用户订阅模式，将直接与现在已经晚到派对的MoviePass竞争。MoviePass还必须说服这些参展商签约，这是他们最初在大流行前的市场上感到棘手的事情。\n自2019年MoviePass关闭以来，电影院发生了很多变化——如果MoviePass希望第二轮放映有更好的结局，它也必须做出很多改变。", "note_en": "Two years after the wildly popular subscription service MoviePass crashed and burned, its co-founder Stacy Spikes is determined to bring it back. Spikes says MoviePass will return this summer.\n The company, recently bought by Spikes after his  unceremonious ouster from MoviePass in 2018, held its launch event today at the Walter Reade Theater at Lincoln Center in NYC. Spikes began by wasting absolutely no time addressing the Helios and Matheson Analytics-shaped elephant in the room. The firm is now infamous for being the parent company of MoviePass that managed to blow the entire thing up shortly after the firm bought the startup, which became famous for offering unlimited movie tickets for a monthly fee.\n “A lot of people lost money, a lot of people lost trust,” Spikes said, claiming he was among those who were hurt by the company’s mismanagement. During the opening moments of the event, Spikes oscillated between addressing the disappointment of being pushed out of his company, joking about MoviePass’ loyal consumers — as well as its power users, who Spikes cracked are the reason the company went out of business — and finally, the process of snapping the company back after  its parent company went bankrupt in 2020.\n  “We’re looking at this from another point of view,” Spikes said of the company’s relaunch, adding that he now plans to run the business like a “co-op.” Spikes added that MoviePass users will be able to hold partial ownership of the company, with its most premium tier inclusive of a lifetime subscription.\n The event was at times a little bizarre, with muted clapping audible when Spikes paused to make sure his jokes and proposals were landing with live attendees. Spikes sounded at times more like he was delivering an enthusiastic Ted Talk about theatrical releases than a product launch. He hyped the relaunch under his new vision, which, he says, will be “powered by web3 technology.”\n  The company’s original engineering team is returning for the business’s relaunch, according to Spikes, and the service will launch this summer. Under the new model, MoviePass will run on tradable credits that roll over month to month. Subscribers will also be able to use their credits to bring a friend, a markedly different approach from the single-user card system that MoviePass used previously, which could prove annoying for non-cardholders.\n MoviePass 2.0 will also work on a tiered system, Spikes said. Spikes shared images of a beta version of the new app and the credit-based system, which will vary based on things like peak moviegoing hours. MoviePass’ ambitions for subscribers are, charitably, ambitious. Spikes wants to claim 30 percent of the moviegoer market by 2030, MoviePass’ “moonshot” goal.\n   Somewhat unsurprisingly, MoviePass will incorporate aspects of Spikes’ existing business PreShow, a technology that has been used to allow gamers to  trade ad views for in-game currency. (This sort of format for moviegoing was  previously teased by Spikes to  Insider.) The way that PreShow works is that you have to actually  view the ad — it tracks whether your attention is trained on your phone. Once users “complete the PreShow,” they’ll be awarded credits that can then be used to buy tickets through the MoviePass platform.\n Spikes told attendees at the event that MoviePass’ most loyal fans will be “deputized” to beta users and will be able to use the experience for its first year for free. At some point during the summer, these users will be contacted about the beta programming.\n Launched in 2011 with a small team of developers and headed by co-founder Spikes, MoviePass’ second life follows a series of comically disastrous failures under the direction of Helios and Matheson Analytics. The firm  bought a majority stake in the company in 2017 and, subsequently, ran it straight into the ground.\n  Spikes was  fired from his own company by Helios and Matheson Analytics executives Ted Farnsworth and Mitch Lowe in 2018, reportedly for raising concerns about the service’s unsustainable $10-per-month payment structure (which was  meant to be temporary, according to Spikes). Shortly thereafter, the service began imploding — it was hemorrhaging money, the service underwent abrupt changes, and the app sometimes didn’t work at all (which was  later reported to be intentional). The service  eventually shut down in 2019, and Helios and Matheson Analytics  filed for bankruptcy the following year.\n Then, last winter, Spikes  bought back the company and announced plans to relaunch the service. Speaking at the time with  Insider’s Jason Guerrasio, who covered the MoviePass saga extensively, Spikes said that the decision to buy back the brand he helped form “was encouraged by the continued interest from the moviegoing community.”\n He added, “We believe, if done properly, theatrical subscription can play an instrumental role in lifting moviegoing attendance to new heights.”\n Spikes seemed to shrug off existing subscriptions launched by individual theater chains, instead suggesting that MoviePass would offer more options and more flexibility than a single exhibitor could. Since MoviePass folded, plenty of theaters have launched their own power user subscription models that will compete directly with a now-late-to-the-party MoviePass. MoviePass will also have to convince these exhibitors to sign on, something they were initially prickly about in a pre-pandemic market.\n A lot has changed for movie theaters since MoviePass shut down in 2019 — and a lot will have to change for MoviePass, too, if it wants this second run to have a better ending.", "posttime": "2022-02-17 18:12:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "电影,officially,moviepass", "title": "电影通行证正式回归", "title_en": "MoviePass Is Officially Coming Back", "transed": 1, "url": "https://www.theverge.com/2022/2/10/22927812/moviepass-back-relaunch-stacy-spikes", "via": "", "real_tags": ["电影", "moviepass"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073896, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大约五年后，关于电动汽车行驶里程焦虑的常见抱怨将在美国大部分地区成为过去。\n从今年开始，联邦政府将在五年内向各州拨款50亿美元，以建立一个全国性的快速充电器网络。该计划最初侧重于州际公路系统，指示各州每50英里建设一个充电站。这些电站必须能够以150千瓦的功率同时为至少四辆电动汽车充电。\n一旦各州完成了州际充电网络，他们就可以申请补助金来填补其他地方的空白。能源和运输联合办公室（Joint Office of Energy and Transportation）是为帮助运输和能源部门管理该项目而成立的一个新机构，如果附近没有电网连接，该办公室将允许对50英里的要求进行个案例外。该项目最初州际部分的资金将使用一个模拟联邦公路拨款分配方式的公式进行分配。从2022财年开始，6.15亿美元将用于建设充电站，3亿美元将用于建立能源和交通联合办公室。每年10%的资金将用于填补网络的缺口。\n在最初的50亿美元项目启动后，另外25亿美元的可自由支配拨款将用于在农村和服务不足地区建造充电器。\n作为提交给联邦政府的计划的一部分，各州将需要确保充电站的可靠性，每个充电站至少有一个充电器需要在超过97%的时间内工作，并限制其对电网的影响。各州还被要求设计车站，以便随着需求的增长和充电率的提高，车站可以方便地扩展和升级。新计划还鼓励各州在旅游中心、便利店、游客中心或餐馆附近安装充电器。\n为了获得州际建设的信誉，各州必须安装使用组合充电系统（也称为CCS）的充电器。除了日产Leaf之外，在美国销售的大多数电动汽车型号都可以使用这种插头类型。尽管特斯拉有自己的插头类型，但据报道，该公司正计划提供一种适配器，使其至少部分北美车队能够使用CCS快速充电器。（它已经在韩国提供了这种适配器。）\n新计划还优先考虑国内充电器的生产，这已经促使一些制造商开始在美国开展业务。向ChargePoint提供一些快速充电器的澳大利亚公司Tritium本周早些时候表示，将在田纳西州建造一座工厂，每年生产30000台直流快速充电器。西门子还计划扩大其在美国的业务范围，以便到2025年每年能生产100万台充电器。\n这项新计划目前有一个不足之处，那就是人们将如何支付费用。大多数非特斯拉电动汽车车主的手机（或钥匙链上的FOB）上都有许多应用程序，让他们能够接入不同的充电网络。这不太方便。\n运输部长皮特·布蒂吉格告诉《汽车与司机》杂志，“我们正在仔细研究这个问题。”。他说：“这个项目的一部分将是一个共享标准。如果我们要用纳税人的#39；美元来帮助私人演员建立充电站，那么我们当然需要确保公民从中获得良好的价值。通过忠诚项目可能会有任何数量的网络利益。这很好。”，“但我们必须确保……每个人都能受益。”\n在每个充电站安装一个信用卡读卡器似乎是一个不错的解决方案，尽管一些网络已经支持ISO 15118标准，也被称为&#34；充电&#34; 使用兼容车辆的驾驶员只需插入电源，充电器和车辆就可以协调处理身份验证和支付。Buttigieg还表示，新成立的能源和交通联合办公室将开始研究如何定位和设计充电器，以方便车辆牵引拖车。\n这项新计划代表着乔·拜登总统承诺到2030年在美国各地建立一个50万个充电站网络的重大首期付款。如果该计划能够实现，它将有助于加快该国向电动汽车的过渡，同时大幅减少交通运输的碳排放。\n目前最新的充电器可以达到250-350千瓦，那么我们为什么计划只生产150千瓦的未来充电器呢？\n我不&#39；我对电动汽车了解不多，这篇文章规定四辆车同时使用150千瓦的充电器——你提到的充电器能做到这一点吗？\n有些是，很多不是。那&#39；答案很简单。答案要复杂得多。许多充电站分为两个。因此，如果你到达，没有其他人在那里，你将获得充分的权力。但如果有人连接到同一个站点，则会被拆分。因此，想象一下，为了简单起见，200对100&#39；看在上帝的份上。这就是为什么你会经常看到特斯拉在充电站把车停在彼此相隔一个空间的地方。", "note_en": "About five years from now, a common complaint about electric vehicles—range anxiety—will be a thing of the past across much of the US.\n Starting this year, the federal government will begin doling out $5 billion to states over five years to build a nationwide network of fast chargers. The  plan initially focuses on the Interstate Highway System, directing states to build one charging station every 50 miles. Those stations must be capable of charging at least four EVs simultaneously at 150 kW.\n  Once states have completed the Interstate charging network, they’ll be able to apply for grants to fill in gaps elsewhere. The Joint Office of Energy and Transportation, a new agency formed to help the Transportation and Energy Departments administer the program, will allow case-by-case exceptions to the 50-mile requirement if, for example, no grid connection is available nearby. Funding for the initial Interstate portion of the program will be allocated using a formula that mimics how federal highway grants are distributed. Starting in fiscal year 2022, $615 million will be available to build charging stations, and $300 million will be allocated to set up the Joint Office of Energy and Transportation. Ten percent of each year’s funding will go toward filling gaps in the network.\n After the initial $5 billion program is launched, another $2.5 billion in discretionary grants will be available to build chargers in rural and underserved areas.\n As part of their plans submitted to the federal government, states will need to ensure that the charging stations will be reliable—at least one charger per station needs to be working more than 97 percent of the time—and that they will limit their impact on the electric grid. States are also directed to design stations so they can be easily expanded and upgraded as demand grows and charging rates increase. The new program also encourages states to site chargers near travel centers, convenience stores, visitor centers, or restaurants.\n    To get credit for their Interstate build-out, states will have to install chargers that use the Combined Charging System, also known as CCS. With the exception of the Nissan Leaf, most models of EVs sold in the US can use this plug type. Though Teslas have their own plug type, the company is reportedly planning to offer an adapter that will allow at least some of its North American fleet to use CCS fast chargers. (It already offers that adapter in South Korea.)\n The new program also prioritizes domestic production of chargers, which has already spurred some manufacturers to begin setting up operations in the US. Tritium, an Australian company that supplies some fast chargers to ChargePoint, said earlier this week that it would build a factory in Tennessee that can crank out 30,000 DC fast chargers per year. Siemens also plans to expand its US footprint so it can make up to 1 million chargers per year by 2025.\n One area where the new program currently falls short concerns how people will pay for charging. Most non-Tesla EV owners have a number of apps on their phones (or fobs on their keychains) to give them access to different charging networks. It’s less than convenient.\n “We’re taking a good look at this,” Secretary of Transportation Pete Buttigieg  told Car and Driver. “Part of this program is going to be a shared standard. If we’re going to use taxpayers&#39; dollars to help private actors put in charging stations, then of course we need to make sure the citizen is getting good value out of it. There may be any number of network benefits through loyalty programs. That’s fine,” he said, “but we’ve got to make sure… everybody can benefit.”\n  Putting a credit card reader on each charging station seems like a decent solution, though some networks  already support the ISO 15118 standard, also known as &#34;plug-and-charge.&#34; Drivers using compatible vehicles can simply plug in, and the charger and vehicle coordinate to handle both authentication and payment. Buttigieg also said that the new Joint Office of Energy and Transportation will start looking into providing guidance on how to site and design chargers to facilitate vehicles towing trailers.\n The new program represents a significant down payment on President Joe Biden’s pledge to create a  network of 500,000 charging stations across the US by 2030. If that plan comes to fruition, it should help speed the country’s transition to EVs while slashing carbon emissions from transportation.\n  The current newest chargers can do 250-350 kw, so why are we planning making *future* chargers only 150 kw?\n  I don&#39;t know much about EVs, the article specifies 150kw for four vehicles simultaneously - are the chargers you mentioned able to do that?\n Some are, many are not. That&#39;s the short answer. The long answer is much more complicated.   Many charging stations split between two. So if you arrive and no one else is there, you will get full power. But if someone connects to the same station, that is then split. So imagine 200 vs 100 for simplicity&#39;s sake. This is why you will often see Teslas parked one space away from each other at charging stations.", "posttime": "2022-02-17 18:10:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,unveils,充电器", "title": "每50英里四个快速充电器——美国公布电动汽车基础设施计划", "title_en": "Four Fast Chargers Every 50 Miles -- US Unveils EV Infrastructure Plan", "transed": 1, "url": "https://arstechnica.com/cars/2022/02/four-fast-chargers-every-50-miles-us-unveils-ev-infrastructure-plan/", "via": "", "real_tags": ["美国", "unveils", "充电器"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073895, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2月9日（路透社）-西方数字公司（WDC.O）周三表示，合资伙伴Kioxia Holdings Corp.在日本运营的两家生产单位的某些材料受到污染，将导致闪存设备的可用性降低。\n据该公司称&#39；根据目前的评估，闪存的可用性至少不足6.5 EB。1 EB等于10亿GB。\nWestern Digital正在与Kioxia密切合作，实施必要的措施，尽快将设施恢复到正常运行状态。\nKioxia是全球最大的闪存和固态存储生产商之一，是Western Digital的关键供应商。这两家公司去年正在进行合并谈判，但谈判陷入僵局。", "note_en": "Feb 9 (Reuters) - Western Digital Corp  (WDC.O) said on Wednesday certain materials at two of its manufacturing units in Japan, operated by joint-venture partner Kioxia Holdings Corp, were contaminated and will result in reduced availability of flash storage devices.\n According to the company&#39;s current assessment, there would be a shortage of at least 6.5 exabytes in flash storage availability. One exabyte equals one billion gigabytes.\n Western Digital is working closely with Kioxia to implement necessary measures that will restore the facilities to normal operational status as quickly as possible.\n Kioxia, one of the biggest producers globally of flash memory and solid-state storage, is a key supplier to Western Digital. The two companies were in merger talks last year but they reached a standstill.", "posttime": "2022-02-17 18:08:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "日本,digital,kioxia", "title": "Western Digital表示污染影响了日本工厂的生产", "title_en": "Western Digital Says Contamination Impacting Production at Japanese Facilities", "transed": 1, "url": "https://www.reuters.com/business/western-digital-says-contamination-impacting-production-japanese-facilities-2022-02-10/", "via": "", "real_tags": ["日本", "digital", "kioxia"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073893, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "路透2月16日电---DoorDash Inc（DASH.N）周三公布的季度收入超过预期，因为食品配送需求没有放缓的迹象，表明订购习惯已经永久性改变，导致该公司&#39；铃声响起后，s的股价上涨了24%。\n分析人士表示，在疫情高峰期频繁点菜后，人们已经习惯了将食物送到家门口。他们预计DoorDash及其竞争对手Uber Eats（Uber.N）和Grubhub将在未来几年内呈现强劲增长，尽管人们冒险外出的次数更多。\nUber&#39；s股上涨1%，而Grubhub母公司在美国上市的股票只吃外卖。com NV上涨2%。\n&#34;它&#39；It’我们很有可能在餐馆吃饭并得到送货上门，因为我们每天可能吃三次或更多，这#39；每月购物时间超过100次，&#34；首席执行官Tony Xu在一次财报电话会议上说。\n在截至12月31日的第四季度，高于预期的消费者保留率和新客户增长帮助DoorDash#39；根据来自Refinitiv的IBES数据，该公司的收入增长了34%，达到13亿美元，超过了12.8亿美元的预期。\n&#34;在一定程度上，被压抑的进餐需求会侵蚀收入，这只会暂时抑制一些增长，而不会长期逆转；电子商务管理平台CommerceIQ的首席执行官古鲁·哈里哈兰说。\n总部位于旧金山的DoorDash还预测，第一季度marketplace的总订单价值，即所有应用程序订单和订阅费的总价值，介于114亿美元和118亿美元之间，而报告季度为112亿美元。\n即使面对通货膨胀，消费者&#39；M Science分析师马修·古德曼（Matthew Goodman）表示，持续的支付意愿应该能支持需求。\n为了吸引更多用户，DoorDash还将非餐厅产品（包括食品杂货、宠物食品和酒精饮料）增加了一倍。它与多家零售商建立了合作关系，包括Ulta Beauty（Ulta.O）、Bed Bath&amp；Beyond（bby.O）和PetSmart。\nDoorDash还预测，2022财年的核心收益将达到5亿美元，而预计为4.551亿美元。", "note_en": "Feb 16 (Reuters) - DoorDash Inc  (DASH.N) reported quarterly revenue on Wednesday that beat estimates as food delivery demand showed no sign of slowing, indicating ordering habits have changed permanently, sending the company&#39;s shares up 24% after the bell.\n Analysts have said people have grown accustomed to having food delivered to their doorsteps after frequently ordering in during the peak of the pandemic. They expect DoorDash and rivals Uber Eats  (UBER.N) and Grubhub to show strong growth for several years even as people venture out more.\n Uber&#39;s shares rose 1%, while the U.S.-listed shares of Grubhub parent Just Eat Takeaway.com NV gained 2%.\n  &#34;It&#39;s very possible to eat at a restaurant and get delivery because we eat three times or more maybe per day, and that&#39;s over 100 shopping moments per month,&#34; Chief Executive Officer Tony Xu said on an earnings call.\n In the fourth quarter ended Dec. 31, higher-than-expected consumer retention and new customer growth helped DoorDash&#39;s revenue jump 34% to $1.30 billion and beat estimates of $1.28 billion, according to IBES data from Refinitiv.\n &#34;To the extent that pent-up demand for dining in would eat into revenue, it would only serve to dampen some growth temporarily, not reverse it for long periods,&#34; Guru Hariharan, CEO of e-commerce management platform CommerceIQ, said.\n San Francisco-based DoorDash also forecast first-quarter marketplace gross order value, the total value of all app orders and subscription fees, between $11.4 billion and $11.8 billion, versus $11.2 billion in the reported quarter.\n Even in the face of inflation, consumers&#39; persistent willingness to pay for the convenience of delivery should support demand, M Science analyst Matthew Goodman said.\n DoorDash has also doubled down on non-restaurant offerings, including grocery, pet food and alcohol to attract more users. It has tied up with a number of retailers, including Ulta Beauty  (ULTA.O), Bed Bath &amp; Beyond  (BBBY.O) and PetSmart.\n DoorDash also forecast core earnings in a range of break-even to $500 million for fiscal 2022, compared with estimates of $455.1 million.", "posttime": "2022-02-17 18:01:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "股票,美国,订单,reports,doordash", "title": "DoorDash报告第四季度营收为13亿美元，与美国东部时间12.8亿美元相比。，同比增长34%，订单3.69亿份，同比增长35%，市场订单总值1116亿美元，同比增长36%；股票上涨20%+", "title_en": "DoorDash reports Q4 revenue of $1.3B v. $1.28B est., up 34% YoY, 369M orders, up 35% YoY, marketplace gross order value of $11.16B, up 36% YoY; stock up 20%+", "transed": 1, "url": "https://www.reuters.com/business/doordash-beats-revenue-estimates-sustained-demand-food-delivery-2022-02-16/", "via": "", "real_tags": ["股票", "美国", "订单", "reports", "doordash"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073892, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "思科（Cisco）股价周三在延长交易中上涨5%，此前该企业软件和硬件制造商公布的第二财季收益超过分析师#39；期望。\n收益：根据Refinitiv的数据，经调整后的每股收益为84美分，而分析师预期的每股收益为81美分。\n根据一份声明，截至1月29日的季度收入同比增长6%。上一季度收入增长了8%。\n&#34;半导体仍然存在重大限制，阻碍我们完成部分产品的制造，尽管需求非常强劲，但这仍然是收入增长的阻力；思科首席执行官查克·罗宾斯在与分析师的电话会议上说。他说他不是&#39；我不确定什么时候组件会变得更容易获得。\n随着思科为确保组件的替代来源和加快发货速度而支付费用，该公司正在提高产品价格，高管们表示，此举将在本季度末和第四财季提振业绩。\n思科&#39；包括数据中心网络交换机在内的安全、灵活的网络部门创造了59亿美元的收入。这比StreetAccount调查的分析师预测的57.8亿美元增长了7%。\n该公司&#39；包括路由光网络、公共5G、硅和光学产品在内的未来互联网板块贡献了13.2亿美元，增长了42%，略高于StreetAccount一致认为的13亿美元。\n思科&#39；以Webex合作产品为特色的s混合工作细分市场收入为10.7亿美元，下降9%，略低于StreetAccount一致认为的11亿美元。第39段；本季度，思科更名为Collaboration，思科&#39；美国财政部长斯科特·赫伦（Scott Herren）说。\n在指导方面，思科要求在收入增长3%至5%的情况下，调整后的第三财季每股收益为85美分至87美分。Refinitiv调查的分析师预计调整后每股收益为86美分，营收为132.5亿美元，这意味着增长3.5%。\n思科表示，2022财年的调整后每股收益为3.41美元至3.46美元，营收增长率为5.5%至6.5%。Refinitiv调查的分析师一直希望调整后的每股收益为3.42美元，营收为527.1亿美元，增幅为5.8%。\n上周，新闻媒体报道称，思科已出价收购数据分析软件公司Splunk。一位分析师询问了这些报告，罗宾斯没有回答；虽然他确实对思科&#39作了总体评论，但他没有具体谈论与Splunk有关的任何计划；这是一种交易方式。\n&#34;首先，我们没有&#39；不要评论谣言、猜测或故事。但我要告诉你们的是，我们一直在评估潜在的机会；罗宾斯说&#34;斯科特和我谈过，我们认为我们做的每一笔交易都可能涉及10到15家公司。我们的决策首先基于战略匹配，其次是文化匹配，同样重要的是财务和估值匹配&#34;\n自2022年初以来，思科的股价下跌了14%，而S&amp；同期，P500指数下跌了约6%。", "note_en": "Cisco shares rose as much as 5% in extended trading on Wednesday after the enterprise software and hardware maker disclosed fiscal second-quarter earnings that surpassed analysts&#39; expectations.\n  Earnings: 84 cents per share, adjusted, vs. 81 cents per share as expected by analysts, according to Refinitiv.\n  Revenue increased by 6% year over year in the quarter, which ended Jan. 29, according to a statement. In  the previous quarter revenue had risen 8%.\n &#34;There are still significant constraints with semiconductors, preventing us from completing manufacturing of some of our products, and that remains a headwind to revenue growth despite very strong demand,&#34; Cisco CEO Chuck Robbins said on a conference call with analysts. He said he isn&#39;t sure when components would become more readily available.\n  As Cisco pays to secure alternative sources of components and speed up shipping, the company is raising product prices, a move that executives said should boost results toward the end of the current quarter and in the fiscal fourth quarter.\n Cisco&#39;s Secure, Agile Networks segment, which includes data-center networking switches, generated $5.90 billion in revenue. That was up 7% and more than the $5.78 billion sum that analysts polled by StreetAccount had predicted.\n The company&#39;s Internet for the Future segment, which contains routed optical networking, public 5G, silicon and optics products, contributed $1.32 billion, up 42% and just above the StreetAccount consensus of $1.30 billion.\n  Cisco&#39;s Hybrid Work segment that features Webex collaboration offerings posted $1.07 billion in revenue, down 9% and slightly lower than the $1.10 billion StreetAccount consensus. The segment&#39;s name is changing to Collaboration this quarter, Cisco&#39;s finance chief, Scott Herren, said.\n With respect to guidance, Cisco called for 85 cents to 87 cents in adjusted fiscal third-quarter earnings per share on 3% to 5% revenue growth. Analysts polled by Refinitiv had expected 86 cents in adjusted earnings per share and $13.25 billion in revenue, which implies 3.5% growth.\n For the 2022 fiscal year, Cisco said it sees $3.41 to $3.46 in adjusted earnings per share and 5.5% to 6.5% revenue growth. Analysts polled by Refinitiv had been looking for adjusted earnings of $3.42 per share and $52.71 billion in revenue, or 5.8% growth.\n Last week  news outlets reported that Cisco had made a bid for data-analytics software company  Splunk. One analyst asked about the reports, and Robbins wouldn&#39;t talk specifically about any plans related to Splunk, although he did comment generally on Cisco&#39;s approach to doing deals.\n &#34;First of all we don&#39;t comment on rumors and speculations or stories. But what I will tell you is that we are constantly evaluating potential opportunities,&#34; Robbins said. &#34;Scott and I were talking and we think every deal we do we probably look at 10 to 15 companies. We base our decisions on first and foremost strategic fit, secondly cultural fit, and equally as important, the financial and valuation fit.&#34;\n  Shares of Cisco have declined 14% since the start of 2022, while the S&amp;P 500 index has fallen roughly 6% over the same period.", "posttime": "2022-02-17 17:59:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "股票,同比,revenue,思科", "title": "思科报告第二季度收入为127亿美元，同比增长6%，互联网未来收入为13.2亿美元，同比增长42%，混合工作收入为10.7亿美元，同比下降9%；股票上涨5%+", "title_en": "Cisco reports Q2 revenue of $12.7B, up 6% YoY, Internet for the Future revenue of $1.32B, up 42% YoY, Hybrid Work revenue of $1.07B, down 9% YoY; stock up 5%+", "transed": 1, "url": "https://www.cnbc.com/2022/02/16/cisco-csco-earnings-q2-2022.html", "via": "", "real_tags": ["股票", "同比", "revenue", "思科"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073890, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在大流行期间，青少年的饮食失调激增。现在，投资者正把资金投入一家相对较新的初创公司，希望帮助儿童和年轻人与家人一起工作，从这种疾病中康复。这家名为Equipm的公司在Chernin集团的领导下筹集了5800万美元，使其资金总额达到7500万美元。该公司计划在年中之前将这笔资金用于在全国推广其服务。\n首席执行官克里斯蒂娜·萨夫兰（Kristina Saffran）正在从厌食症中恢复，她于2019年与首席运营官和临床心理学家埃林·帕克斯（Erin Parks）共同创立了Equipment。该在线平台实施基于家庭的治疗，这是一个门诊框架，家庭与孩子一起在家中帮助他们康复。父母负责菜单规划、份量控制、安排膳食、监控身体活动，并确保孩子真正在吃东西。为了支持家长在这方面的努力，Equipment将患者及其家人与治疗师、营养师、医生、同伴和家庭导师联系起来，他们可以验证他们的经验并提供建议。\n到目前为止，Equipm已在40个州上市，拥有10家保险公司，包括安泰、安泰、信诺、地平线BCBS、麦哲伦、莫达、Optum、PacificSource和加利福尼亚州的Partnership HealthPlan，通过这些保险公司，Equipm将治疗医疗补助患者。到目前为止，该公司正在治疗数百个家庭。目标是走向全国。\n虽然以家庭为基础的治疗（FBT）作为一种治疗饮食失调的方法已经越来越受欢迎，但它并不总是容易获得。“过去的想法是，‘让我们和你谈谈，让我们激励你想吃东西，&#39萨夫兰说。“但这并不是说他们选择不吃东西。”FBT的信条之一是，儿童无法控制他们的饮食紊乱。FBT也没有详细讨论饮食失调的原因，声称饮食失调是由一系列复杂的因素引起的，这些因素部分是生物因素，部分是环境因素。相反，它专注于让患者恢复正常体重，然后解决导致饮食紊乱的思维过程。\n萨夫兰说：“饮食失调的很多症状都是饥饿的症状，所以你真的什么都做不了。”。“第一步需要全身恢复。”\n饮食失调是一种自我控制的感觉，你经常会听到康复中的人们谈论这一点。完美主义与饮食失调密切相关，焦虑也是如此。当孩子们觉得对自己的环境没有权威时，也会出现这种情况。身体变成了一个可以控制的东西。当青少年感觉到自己无法跟上Instagram等社交平台为他们提供的各种美容标准时，身体也是一个自然的控制目标。\n“我认为我们经常接触到的是，媒体让女性错误地感觉到女性应该是什么样子，这可能会导致她们说，‘哦，好吧，我可以用我的食物到达那里，&#39玛丽斯·德杰纳在2018年的电影《我是玛丽斯》中讲述了她十几岁时患饮食障碍的经历。“对我来说，这就像是，‘嗯，食物是我可以控制的，我觉得自己无法控制自己的生活。所以，如果我能控制我的食物，那么也许我可以控制一切。&#39；”\n当德杰纳14岁时，她被送进了一家医院，血压很低，可能会死亡。她的厌食症完全控制了她。在这部电影中，她对自己在饮食障碍病房的经历做出了惊人的观察：“每个人都在争当最混乱的人。因为你在这家医院里，他们试图拿走一件能让你有控制感的东西，而你几乎想证明他们没有这么做。”\nDegener现在在Equipm管理着同伴导师。她说她也做过FBT，但她和她的父母都没有同伴导师，也没有经历过这种经历的人，他们可以帮助定义在饮食障碍的情况下什么是“正常”。她说，她自己的父母对她积极康复时的行为感到震惊。\n她告诉我：“饮食失调会让你的孩子变得非常安静，有点像一双好鞋子，完美主义者。现在他们把盘子扔到房间的另一边，而你却在为吃面包而争吵。”。“我认为，有时我的父母会害怕挑战饮食障碍，因为他们周围没有一个家长网络，他们说，‘哦，是的，不，我的孩子也这么做了。’”\nDegener说，同伴指导对患者也很有价值。她说：“当时的很多叙事都是，‘事情会变得更好’，但总是很艰难。”。“过了一段时间，我才发现有人在说，‘我去过那里，现在看看我这段时间在做什么，或者我在做什么志愿者工作。’”自从她的饮食障碍首次出现以来，德杰纳已经成为一名瑜伽教练，并在大学毕业。\nEquip希望为患者提供长期支持。观察复发最关键的时间是在恢复的第一年，尽管正如大流行所表明的那样，不可预见的情况总是会引发复发。目前，保险公司正在持续支付所有护理的月费。", "note_en": "During the pandemic, eating disorders  skyrocketed among teens. Now, investors are putting their money behind a relatively new startup that hopes to help kids and young adults work with their families to recover from this ailment. The company, Equip, has raised $58 million led by The Chernin Group, bringing its total funding to $75 million. It plans to use the money to push its service nationwide by mid-year.\n   CEO  Kristina Saffran, who is in recovery from anorexia, co-founded Equip in 2019 with COO and clinical psychologist Erin Parks. The online platform practices family-based treatment, an outpatient framework where families work with their children to help them recover at home. Parents take on menu planning, portion control, scheduling meals, monitoring physical activity, and ensuring their child is actually eating. To support parents in this endeavor, Equip connects patients and their families with a therapist, a dietician, a doctor, and peer and family mentors who can validate their experiences and offer advice.\n So far, Equip is available in 40 states with 10 insurers including, Aetna, Anthem, Cigna, Horizon BCBS, Magellan, Moda, Optum, PacificSource, and Partnership HealthPlan of California, through which it will treat Medicaid patients. To date, the company is treating hundreds of families. The goal is to go nationwide.\n While family-based treatment (FBT) has gained  popularity as a treatment for eating disorders, it’s not always easily accessible. “The old thinking was, ‘Let’s talk to you, let’s motivate you to want to eat,&#39;” says Saffran. “But it’s not that they’re choosing not to eat.” One of the tenets of FBT is that children are not in control of their eating disorder. FBT also doesn’t dwell on the cause of the eating disorder, asserting that they arise from a complex set of factors that are part biological and part environmental. Instead, it focuses on getting the patient back to a normal weight and then on addressing the thought processes that lead to disordered eating.\n  “A lot of the symptoms of eating disorders are symptoms of starvation, so you really can’t do anything,” says Saffran. “Step one needs to be full weight restoration.”\n Eating disorders are about feeling in control, something you will often hear people who are in recovery talk about. Perfectionism is heavily associated  with eating disorders, as is  anxiety. They can also arise when children feel no authority over their own circumstances. The body becomes a thing that can be controlled. The body is also a natural target for control when a teen’s feelings of inadequacy stem from their perceived inability to keep up with the kinds of beauty standards that are served to them on social platforms  such Instagram.\n “What I think we’re exposed to a lot is the media gives women a false sense of what women should look like, and that can lead to them going, ‘Oh well, I can use my food to get there,&#39;” says Maris Degener in the 2018 film,  I am Maris, about her experience as a teenager with an eating disorder. “For me, it was like, ‘Well, food is something that I can control and I feel out of control of my life. So, if I can control my food, then maybe I can control everything.&#39;”\n  When Degener was 14, she was checked into a hospital with blood pressure so low she could have died. Her anorexia had taken complete control of her. In the film, she makes a stunning observation about her stay in the eating disorder ward: “Everybody is competing to be the most disordered person. Because you’re in this hospital where they’re trying to take away the one thing that gives you a sense of control, and you almost want to prove that they’re not doing it.”\n Degener now manages peer mentors at Equip. She says that she also did FBT, but neither she nor her parents had peer mentors, or people who have been through the experience and can help to define what constitutes “normal” within the context of an eating disorder. She says her own parents were totally shocked by her behavior when she in active recovery.\n “An eating disorder can take your very quiet, kind of goody-two-shoes, perfectionist kid to now they’re throwing plates across the room and you’re arguing over eating bread,” she told me. “I think there’s times where my parents were scared away from challenging the eating disorder as much as they needed to because they didn’t have a network of parents around them saying, ‘Oh yeah, no, my kid did that too.&#39;”\n  Peer mentorship is also valuable to the patients, says Degener. “A lot of the narrative that was out there was, ‘Things will get better,’ but they’ll always be hard,” she says. “It was a while until I found voices that were saying, ‘I’ve been there and now look at what I’m doing with this part of my life or this volunteer work I’m doing.&#39;” In the years since her eating disorder first emerged, Degener has become a yoga instructor and graduated college.\n Equip is hoping to provide long-term support for patients. The most critical time to watch for relapse is in the  first year of recovery, though as the pandemic has shown, unforeseen circumstances can always trigger a flareup. For now, insurers are paying Equip a monthly fee for all care on an ongoing basis.", "posttime": "2022-02-17 17:55:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "治疗师,led,饮食", "title": "Equip将年轻患者与治疗师和其他专家联系起来，在家里治疗饮食障碍，它筹集了由Chernin集团牵头的5800万美元的B系列", "title_en": "Equip, which connects young patients with therapists and other specialists to treat eating disorders at home, raises a $58M Series B led by The Chernin Group", "transed": 1, "url": "https://www.fastcompany.com/90721709/equip-eating-disorders-startup-chernin-group", "via": "", "real_tags": ["治疗师", "led", "饮食"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073889, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "移动数据和分析平台应用程序Annie已更名为data。人工智能，因为该公司将自己重新定位为“统一数据标准”，以利用其所谓的“大企业市场机遇”\nApp Annie以其一套移动性能数据产品而闻名，为开发者、出版商和广告商提供了关键的见解和基准，以推动收入、参与度等。当大数据分析已经成为企业在竞争中寻求优势的关键工具时，应用程序Annie希望更好地与这些新兴趋势保持一致——这一切都从它的名字开始。\n“该名称反映了我们的愿景，即通过产品和合作伙伴关系推动全面的数字绩效，”Data说。ai首席执行官Ted Krantz在一封公开信中指出。“今天，我们是移动标准，这是标杆的尖端，也是市场的发展方向。然而，我们看到了一个蓝海机遇，可以组装更多种类的数字数据集，激活人工智能，使企业能够在更高水平上竞争。”\n随着数字领域的公司通过各种数字转型努力追求增长，Krantz认为，数字生态系统是分散的，需要太多的IT和数据科学资源——这最终会“分散”企业对其核心目标的注意力。数据也是如此。人工智能希望帮助统一数据集，帮助公司获取客户获取成本、终身价值和投资回报率（ROI）等信息。\n“我们的任务是通过提供一个跨越所有渠道的统一视图，并用人工智能照亮机会，从而消除等式的复杂性，”克兰茨解释道。\n考虑到这一点，数据。ai已经与网络跟踪和分析公司Similarweb签订了数据许可协议，以创建“统一的移动和网络市场数据集”\nSimilarweb将整合数据。ai的移动应用程序和市场数据——如每月活跃用户、安装基数和会话——将被整合到即将推出的新产品中，这将使公司能够从单一供应商处购买网络和移动应用程序市场估值。\n“在我们提供更多数据集的同时，合作伙伴关系将仍然是我们的优先事项，同时我们将继续关注人工智能，以推动所有数字渠道的规范性建议，”Krantz补充道。\nVentureBeat&#39；公司的使命是成为一个数字城市广场，让技术决策者了解变革性企业技术和交易。了解更多", "note_en": "Mobile data and analytics platform App Annie has rebranded as  Data.ai, as the company repositions itself as the “unified data standard” to capitalize on what it calls a “big enterprise market opportunity.”\n App Annie is best known for its suite of  mobile performance data products, giving developers, publishers, and advertisers  key insights and benchmarks to drive revenue, engagement, and more. At a time when  big data analytics has emerged as a key tool for businesses looking for a leg up on the competition, often powered by  machine learning and AI, App Annie wants to better align itself with these burgeoning trends — and this all begins with its name.\n  “The name reflects our vision to drive comprehensive digital performance with products and partnerships,” Data.ai CEO Ted Krantz noted in an  open letter. “Today we are the mobile standard, which is the tip of the spear and where the market is going. However, we see a blue ocean opportunity to assemble a broader variety of digital datasets and activate artificial intelligence so that enterprises can compete at a higher level.”\n  As companies across the digital spectrum pursue growth through various  digital transformation efforts, Krantz argues that the digital ecosystem is fragmented and requires too many IT and data science resources — this ultimately “distracts” businesses from their core objectives. And so, Data.ai wants to help unify datasets that help companies extract insights such as customer acquisition cost, lifetime value, and return on investment (ROI).\n “Our mission is to take complexity out of the equation by providing a unified view across all channels and illuminating opportunities with artificial intelligence,” Krantz explained.\n With that in mind, Data.ai has entered a data licensing agreement with  web-tracking and analytics company  Similarweb to create a “unified mobile and web market dataset.”\n Similarweb will incorporate Data.ai’s mobile app and market data — such as monthly active users, installed base, and sessions — into an upcoming new product, which will enable companies to purchase web and mobile app market estimates from a single vendor.\n “Partnerships will remain a priority for us as we deliver on additional datasets while we maintain focus on artificial intelligence to drive prescriptive recommendations across all digital channels,” Krantz added.\n VentureBeat&#39;s mission is to be a digital town square for technical decision-makers to gain knowledge about transformative enterprise technology and transact.  Learn More", "posttime": "2022-02-17 17:53:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,更名,data,数据", "title": "应用程序Annie更名为Data。ai和Similarweb合作，后者将使用数据。ai的移动应用程序和即将推出的产品中的市场数据", "title_en": "App Annie rebrands as Data.ai and partners with Similarweb, which will use Data.ai's mobile app and market data in an upcoming product", "transed": 1, "url": "https://venturebeat.com/2022/02/16/app-annie-becomes-data-ai-to-be-the-unified-data-standard/", "via": "", "real_tags": ["程序", "更名", "data", "数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073888, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "供应链自动化和优化平台Relex Solutions在总部位于纽约的Blackstone Growth领导的新一轮融资中获得了5亿欧元。新的资金将使该公司能够开展一场积极的招聘活动，旨在为现有的400多名成员团队增加数百名开发者。到目前为止，Relex Solutions共筹集了7亿欧元。\n这家芬兰公司由三位供应链科学家（Johanna Småros、Mikko Kärkkäinen和Michael Falk）于2005年创立，提供端到端的零售规划解决方案，旨在通过自动化和优化任何数量的关键功能，帮助零售商和品牌减少浪费、成本和手动操作。\n通过使用Relex的Living Retail平台，零售商可以在业务的各个阶段获得人工智能，从而实现无与伦比的速度、适应性和准确性。该服务可以优化需求预测，并以精确的精度自动化补货流程。，最终实现供应链可视性的最大化。不用说，它&#39；这是这个提议的最后一部分，到最近已经变得相当关键。\n谈到供应链危机，在RelEX公司的13000名员工中，2021是一个大丰收年。该公司的客户群发展到350多个顶级品牌，包括Dollar Tree、M&amp；S Food、Flink、Morrison、PetSmart、Sephora和Rossmann。\n&#34;我们的客户重视技术，使他们能够快速应对外部干扰，并在销售和履行渠道、产品供应和商店形式方面推动快速创新，而不会错过供应链、营销和运营规划方面的一个节拍，”首席执行官兼联合创始人Mikko Kärkkäinen说。", "note_en": "Supply chain automation and optimisation platform  Relex Solutions has secured €500 million in a new funding round led by New York-based  Blackstone Growth.  The new funding will allow the company to embark upon an aggressive recruitment campaign that aims to add hundreds more developers to its existing 400+ member team. To date, Relex Solutions has raised a total of €700 million.\n The Finnish company, which was founded in 2005 by three supply chain scientists:  Johanna Småros,  Mikko Kärkkäinen, and  Michael Falck, provides end-to-end retail planning solutions all aimed at helping retailers and brands reduce waste, costs, and manual operations by automation and optimising any number of mission-critical functions.\n By employing Relex’s  Living Retail Platform retailers are afforded AI at all stages of the business, resulting in unparalleled speed, adaptability, and accuracy. The service can optimise demand forecasting and automate the replenishment processes with pinpoint accuracy., ultimately maximising supply chain visibilities. Needless to say, it&#39;s the last part of this offer that has become rather crucial as of late.\n And speaking to those supply chain woes, for the 1,3000 employees at Relex, 2021 was a bumper year. The firm saw its customer base blossoming to over 350 top brands including  Dollar Tree,  M&amp;S Food,  Flink,  Morrisons,  PetSmart,  Sephora, and  Rossmann.\n &#34;Our customers value technology that enables them to respond quickly to external disruptions and drive rapid innovations in sales and fulfillment channels, product offering, and store formats without missing a beat in their supply chain, merchandising, and operational planning,” said CEO and co-founder  Mikko Kärkkäinen.", "posttime": "2022-02-17 17:52:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,欧元,bringing,供应链", "title": "总部位于芬兰的Relex Solutions帮助零售商使用人工智能预测需求，以50亿欧元的估值筹集了5亿欧元，使其总资金达到7亿欧元", "title_en": "Finland-based Relex Solutions, which helps retailers predict demand using AI, raises €500M at a €5B valuation, bringing its total funding to €700M", "transed": 1, "url": "https://tech.eu/2022/02/17/relex-solutions-raises-500-million-in-blackstone-led-round-now-at-5-billion-valuation", "via": "", "real_tags": ["人工智能", "欧元", "bringing", "供应链"]}]