[{"category": "", "categoryclass": "", "imagename": "3f90d4351eb121de663bcdf68dc07a48.jpg", "infoid": 1068540, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您从Verge链接购买的内容，Vox Media可能会获得佣金。看看我们的道德声明。\n Microsoft今天正在发布其第一个Windows 11预览版本。 Windows Insiders现在可以下载Windows 11预览（Build 22000.51），其中包括访问新的开始菜单，多任务功能和过修的Microsoft Store。与以前的Windows 11泄漏不同，此官方预览还具有更新的文件资源管理器，可以使用命令栏替换功能栏以简化文件管理。\n 大多数Windows 11上周透露Microsoft显示的可视变化将在此初始预览中使用。新的开始菜单与其居中的Launcher样界面是此构建的一部分，在整个操作系统中围绕圆角，并改进通知中心，音量飞口等。如果您的PC有加速度计，则Windows 11 Lock屏幕还将包括视差运动效果。\n   Windows 11的新主题和黑暗/光模式改进也是如此预览的一部分，以及新的小部件功能。所有的新主题 - 焕发，捕获的运动，日出和流动 - 铭刻着中心的任务栏设计，Microsoft在您使用操作系统时将它们耦合在Windows 11中的新声音。\n 虽然缺少两个大型Windows 11功能：Windows上的Microsoft团队集成和Android应用程序。两者仍然由Microsoft开发和测试，但将出现在稍后的预览版本中。\n   此Windows 11预览还包括Microsoft的新捕捉组和捕捉布局功能，以改善各种屏幕尺寸的多任务处理。这些新的Snap功能在Windows中的大量众多多任务功能构建，但使其更容易发现和更有用 - 特别是在多个监视器方案中。\n Microsoft还在大修Windows 11的设置部分。此预览版本包括更改，使其更容易导航并找到所需的设置。设置现在具有左侧导航面板，始终持续，使其更快地切换部分。 Microsoft在顶部建立了新的“英雄”控件，可快速访问与每个部分相关的信息或设置。 \n沿着Windows 11今天预览时，Microsoft还释放了Windows 11的Office刷新的预览。更新的UI包括Office应用程序中的圆角，以匹配Windows 11以及对黑暗和灯光模式如何变化的变化。\n 如果您有兴趣测试Windows 11预览版本，则需要注册Windows内部程序程序，然后导航到设置＆gt;更新＆amp;安全＆gt; Windows 10设备上的Windows Insider程序，以启用DEV通道并获取Windows 11构建。\n 您需要一个兼容的机器，虽然Microsoft表示，在此预览期间，它在此预览期间放弃了新的硬件要求，适用于6月24日之前测试过Windows Builds的那些。否则，您需要使用Microsoft的PC Health Check应用程序来查看您的系统是否兼容。\n 我们不建议在您每天使用的计算机上安装这些预览，因为存在错误和未完成的功能。事实上，Microsoft有许多已知的问题它列出，这些是您应该知道的重要内容：\n 任务栏不会在多个监视器上显示（将在即将到来的构建中修复）\n 在将具有多个用户帐户的设备升级到Windows 11时，设置将无法启动\n Microsoft Store Install按钮可能在“一些有限的方案”中可能无法运行 ", "note_en": "If you buy something from a Verge link, Vox Media may earn a commission. See our  ethics statement.\n Microsoft is releasing its first Windows 11 preview build today. Windows Insiders can download the Windows 11 preview ( build 22000.51) right now, which includes access to the new Start menu, multitasking features, and overhauled Microsoft Store. Unlike the  previous Windows 11 leak, this official preview also features an updated File Explorer that replaces the ribbon with a command bar to simplify file management a little more.\n Most of the Windows 11 visual changes that Microsoft revealed last week will be available in this initial preview. The new Start menu with its centered launcher-like interface is part of this build, alongside rounded corners throughout the OS and improvements to the notification center, volume flyouts, and more. If your PC has an accelerometer, the Windows 11 lock screen will also include a parallax motion effect.\n   Windows 11’s new themes and dark / light mode improvements are also part of this preview, alongside the new Widgets feature. All of the new themes — Glow, Captured Motion, Sunrise, and Flow — are designed with the centered taskbar in mind, and Microsoft has coupled them with new sounds in Windows 11 as you use the OS.\n Two big Windows 11 features are missing, though:  Microsoft Teams integration and  Android apps on Windows. Both are still being developed and tested by Microsoft but will appear in later preview builds.\n   This Windows 11 preview also includes Microsoft’s new Snap Groups and Snap Layouts features, to improve multitasking across a variety of screen sizes. These new Snap features build on a lot of the multitasking features that have been in Windows for years but make them easier to discover and more useful — particularly in multiple-monitor scenarios.\n Microsoft is also overhauling the Settings section of Windows 11. This preview build include changes that make it easier to navigate around and find the setting you need. Settings now has a left-hand navigation panel that persists throughout, making it quicker to switch between sections. Microsoft has built new “hero” controls at the top that offer quick access to information or settings that are relevant for each section.\n   Alongside the Windows 11 preview today, Microsoft is also releasing a preview of its Office refresh for Windows 11. The updated UI includes rounded corners in Office apps to match Windows 11 and some changes to how the dark and light modes work.\n If you’re interested in testing the Windows 11 preview build, you’ll need to  enroll in the Windows Insiders program and then navigate to Settings &gt; Update &amp; Security &gt; Windows Insider Program on a Windows 10 device to enable the Dev Channel and obtain Windows 11 builds.\n You’ll need a compatible machine, although Microsoft says it’s waiving its  new hardware requirements during this preview period for those who have been testing Windows builds prior to June 24th. Otherwise, you’ll need to use  Microsoft’s PC Health Check app to see if your system is compatible.\n We wouldn’t recommend installing these previews on a machine you use daily, as there will be bugs and unfinished features. In fact, Microsoft has a  number of known issues it lists, and these are the important ones you should be aware of:\n the taskbar will not be shown across multiple monitors (will be fixed in an upcoming build)\n when upgrading a device with multiple user accounts to Windows 11, Settings will fail to launch\n the Microsoft Store install button might not be functional yet in “some limited scenarios”", "posttime": "2021-06-29 23:12:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,windows,android,releases", "title": "Microsoft释放第一个Windows 11预览，可供企业使用，其中包含主要更新，除了团队集成和Android应用支持 ", "title_en": "Microsoft releases the first Windows 11 preview, available to Insiders, with major updates included except Teams integration and Android app support", "transed": 1, "url": "https://www.theverge.com/2021/6/28/22553639/microsoft-windows-11-download-available-preview-features?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["microsoft", "windows", "android", "releases"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068539, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了提高播放商店的开发人员安全性，谷歌要求那些为Android开发的人在今年晚些时候遵守2步验证和新的身份要求。\n  在登录播放控制台时，第一个要求是2步验证（2SV）。这是一种防止账户和应用劫持的方法，从而保持最终用户的安全。它遵循谷歌广泛推动鼓励2FA采用。除了您的用户名和密码外，您必须验证您是否真的使用发送到手机或物理安全密钥的提示符。\n 新的Google Play开发人员账户需要在8月份启用2步验证，要求在现有的要求“今年晚些时候”。\n 同时，谷歌正在将“开发人员识别要求”介绍“帮助我们更好地了解您的需求”。除了提供您的电子邮件地址和电话号码之外，还将需要以下信息：\n  此信息不会公开列出，只是帮助确认您是谁并进行沟通：\n 您的联系信息允许我们分享有关您应用的重要信息和更新。它还有助于我们确保每个帐户由一个具有真实联系方式创建的，这有助于我们为所有用户保证播放商店安全。\n 从今天开始，开发人员可以指定其帐户类型并验证联系方式。这是可选的，但将是8月份新用户的要求。今年将要求现有账户提交。谷歌还提供以下最佳实践： \n保持联系信息激活和最新信息。我们偶尔会通过通过电子邮件发送或使用所提供的详细信息发送或调用帐户所有者来检查您的帐户是否有效，因此它们是准确的。\n 考虑使用与您用来创建Google帐户的联系人电子邮件地址，特别是如果您的开发人员帐户将有多个用户或用于组织或业务。您可能希望考虑为此目的设置专用的共享收件箱，以便团队或组织中的正确的人员集可以访问这些重要消息。如果您有一个，我们会鼓励您使用自己的域中的电子邮件地址。\n 组织或商业帐户的联系人电子邮件地址不应该是通用或个人电子邮件地址。确保使用与组织关联的电子邮件地址。\n  您正在阅读9To5Google  - 在日复一日的日复一日地打破有关谷歌及其周围生态系统的新闻的专家。请务必查看我们的主页，以了解所有最新消息，并在Twitter，Facebook和LinkedIn上关注9to5Google，留在循环中。不知道从哪里开始？查看我们的独家故事，评论，How-TO，以及订阅我们的YouTube频道 ", "note_en": "To improve developer security on the Play Store, Google is  requiring those that develop for Android to abide by 2-Step Verification and new identity requirements later this year.\n  The first requirement is 2-Step Verification (2SV) when signing into the Play Console. This is a way to prevent account and app hijacking, thus keeping end users safe. It follows Google’s  broad push to encourage 2FA adoption. Besides your username and password, you have to verify it’s really you signing in with either a prompt sent to your phone or a  physical security key.\n New Google Play developer accounts will need to enable 2-Step Verification in August, with the requirement enforced on existing ones “later this year.”\n Meanwhile, Google is introducing “Developer identification requirements” to “help us better understand your needs.” In addition to providing your email address and phone number, the following information will also be required:\n  This information will not be listed publicly, and just meant to help confirm who you are and communicate:\n Your contact information allows us to share important information and updates about your app. It also helps us make sure that every account is created by a real person with real contact details, which helps us keep the Play Store safe for all users.\n Starting today, developers can specify their account type and verify contact details. This is optional for now but will be a requirement for new users in August. Existing accounts will be required to submit this year. Google also offers the following best practices:\n Keep your contact information active and up to date. We may occasionally check if your account is active by emailing or calling the account owner using the details provided, so it is important that they are accurate.\n Consider using a contact email address different from the one that you use to create your Google account, especially if your developer account will have multiple users or is for an organization or business. You might want to consider setting up a dedicated shared inbox for this purpose so that the right set of people within your team or organization can access these important messages. We encourage you to use an email address from your own domain if you have one.\n The contact email address for an organization or business account should not be a generic or personal email address. Make sure to use an email address associated with your organization.\n  You’re reading 9to5Google — experts who break news about Google and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Google on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2021-06-29 23:12:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,google,谷歌,验证,play", "title": "谷歌表示，所有播放商店开发人员帐户都需要启用2步验证，提供地址，并在今年晚些时候验证他们的联系方式 ", "title_en": "Google says all Play Store developer accounts will need to enable 2-Step Verification, provide an address, and verify their contact details later this year", "transed": 1, "url": "https://9to5google.com/2021/06/28/google-play-developer-requirements/", "via": "", "real_tags": ["开发", "google", "谷歌", "验证", "play"]}, {"category": "", "categoryclass": "", "imagename": "7ce8b530efcee0b4303caa1977fb7572.jpg", "infoid": 1068538, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Apple高管在过去的隐私实践中已经在Google上拍摄了Swipes。但iPhone制造商信任谷歌足够的信任，以便在过去的一年中，在过去的一年里，它大大增加了谷歌云中的苹果用户数据的数量，根据这一事项的直接知识。\n 增加了CENDES Apple作为Google存储服务最大的企业客户的状态，Dwarfing其他高调的Google客户，如Bytedance和Spotify。该人表示，截至5月中旬，苹果公司正在轨道上花费大约3 000万美元的谷歌云层储存量，这将增加2020年的大约50％。这个人说，谷歌的云单元内，员工甚至给了Apple一个代码名称，其中暗示其大小：Bigfoot。\n    Apple高管在过去的隐私实践中已经在Google上拍摄了Swipes。但iPhone制造商信任谷歌足够的信任，以便在过去的一年中，在过去的一年里，它大大增加了谷歌云中的苹果用户数据的数量，根据这一事项的直接知识。增加CENDES Apple作为最大的企业客户的地位...... ", "note_en": "Apple executives have taken swipes at Google in the past over its privacy practices. But the iPhone maker trusts Google enough so that over the past year it has dramatically increased the amount of Apple user data it stores in Google’s cloud, according to a person with direct knowledge of the matter.\n The increase cements Apple’s status as the largest corporate client for Google’s storage service, dwarfing other high-profile Google customers such as ByteDance and Spotify. As of mid-May, Apple was on track to spend around $300 million on Google cloud storage this year, which would represent an increase of roughly 50% from all of 2020, the person said. Inside Google’s cloud unit, the person said, staffers have even given Apple a code name that hints at its size: Bigfoot.\n    Apple executives have taken swipes at Google in the past over its privacy practices. But the iPhone maker trusts Google enough so that over the past year it has dramatically increased the amount of Apple user data it stores in Google’s cloud, according to a person with direct knowledge of the matter. The increase cements Apple’s status as the largest corporate client for...", "posttime": "2021-06-29 23:12:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,google,apple,来源,cloud", "title": "资料来源：Apple在2021年在Google Cloud Services上花费〜300米，从2020年起高出50％，矮化百万态，Spotify等大客户 ", "title_en": "Source: Apple is on track to spend ~$300M on Google Cloud services in 2021, up roughly 50% from 2020, dwarfing ByteDance, Spotify, and other large customers", "transed": 1, "url": "https://www.theinformation.com/articles/apples-spending-on-google-cloud-storage-on-track-to-soar-50-this-year", "via": "", "real_tags": ["2020", "google", "apple", "来源", "cloud"]}, {"category": "", "categoryclass": "", "imagename": "5bb34525a0fdf8cef2c11a7e39064d02.jpg", "infoid": 1068536, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "让您忙碌的日子与Axios Am / PM更简单。 赶上什么＆＃39;新的，为什么它只是在5分钟内重要。  订阅AXIOS更接近的洞察洞察日的商业新闻和趋势以及为何重要  订阅Axios Markets，了解最新的市场趋势和经济洞察力。 免费注册。  讨论统计数据和故事，让运动世界与Axios Sports。 免费注册。  从山谷和D.C.使用Axios登录来实现我们的智能技术。 免费注册。  通过Axios Sneak Peek获取内部内幕和第39页的新白宫指南。 免费注册。  每天摘要最重要的故事，影响你的家乡的斧头丹佛 \n获得影响您家乡的最重要故事的日常摘要  获得每天消化最重要的故事，影响您的家乡的Axios Twin City  获得影响您家乡的最重要的故事的日常摘要，Axios Tampa Bay  每天摘要最重要的故事，影响您的家乡的夏洛夏洛特  保持最新的最重要和最有趣的故事，影响NW Arkansas，由当地记者撰写  联邦法官＆＃39;星期一的决定抛出了针对Facebook的反托拉斯诉讼 - 并将冷水扔到加热的运动中，以品牌大型技术＆＃39;领先的公司是非法垄断者。  为什么重要事项：裁决表明，联邦贸易委员会和司法部的监管机构将如何艰难地展示，以便他们对科技渎职戒备的指控。 \n是的，但是：它也加强，今天＆＃39谁认为立法者的手; S过时的反托拉斯法缺乏牙齿抑制挥起由谷歌，Facebook，亚马逊和苹果的力量。\n 驾驶消息：美国联邦地区法院哥伦比亚特区法官詹姆斯Boasberg发送联邦贸易委员会回到绘图板显示的Facebook究竟是如何在市场和垄断＃34;个人社交网络服务＆＃34;。\n FTC＆＃39;西装，在12月提交，是＆＃34;法律上不足，＆＃34; Boasberg写道：＆＃34;它几乎就好像原子能机构希望法院只是向传统智慧点头，这是Facebook是一个垄断者。＆＃34;\n 他还通过州的检察长，他反对给Facebook＆＃39的联盟抛出了一个平行诉讼;收购的Instagram和WhatsApp的，他统治，来到近十年为时已晚。\n Facebook投资者收到了GLEE的新闻，首次向近5％的股票送到近5％并驾驶公司上涨超过1万亿美元的市场上限。\n 这部大局：裁决是对技术批评者寄予厚望的一刻。\n 五年来，积极分子，立法者和学者联盟已经严厉批评了巨大的高科技公司在其市场主导地位，隐私和数据的政策，并未能控制网上误传的传播。 \n主要拜登政府任命 - 包括白宫和新FTC椅Lina Khan的Tim Wu  - 来自这个营地。\n 就在几天前，房子司法委员会批准了一揽子一揽子，旨在重新定义反垄断规则以覆盖巨型科技平台。\n 更强大的技术规则的倡导者认为，这些提案将使监管机构艰难的新工具限制行业和＃39; S权力。\n 但即使他们成为法律 - 面对核心参议院的挑战前景 - 他们将面临宪法和其他理由的必然司法挑战。\n  根据目前的法律，您必须定义一个市场，表明公司在该市场上垄断，然后证明该公司已滥用其垄断。\n 您可以改变游戏规则，因为房屋司法提案旨在，但任何法律仍然需要为法院申请的企业不当行为设计的连贯性测试。\n 新房子账单的支持者表示，他们会这样做。但新的法律狭隘地量身定制，以实现少数公司和实践。在上诉过程中运行课程之前，它们可能存在过期。 ", "note_en": "Make your busy days simpler with Axios AM/PM. Catch up on what&#39;s new and why it matters in just 5 minutes.\n Subscribe to Axios Closer for insights into the day’s business news and trends and why they matter\n Subscribe to Axios Markets for the latest market trends and economic insights. Sign up for free.\n Binge on the stats and stories that drive the sports world with Axios Sports. Sign up for free.\n Get our smart take on technology from the Valley and D.C. with Axios Login. Sign up for free.\n Get an insider&#39;s guide to the new White House with Axios Sneak Peek. Sign up for free.\n Get a daily digest of the most important stories affecting your hometown with Axios Denver\n Get a daily digest of the most important stories affecting your hometown with Axios Des Moines\n Get a daily digest of the most important stories affecting your hometown with Axios Twin Cities\n Get a daily digest of the most important stories affecting your hometown with Axios Tampa Bay\n Get a daily digest of the most important stories affecting your hometown with Axios Charlotte\n Stay up-to-date on the most important and interesting stories affecting NW Arkansas, authored by local reporters\n   A federal judge&#39;s decisions Monday tossed out antitrust lawsuits against Facebook — and threw cold water on the heated campaign to brand Big Tech&#39;s leading companies as illegal monopolists.\n Why it matters: The rulings show just how tough it will be for regulators at the Federal Trade Commission and the Justice Department to make their charges of tech malfeasance stick.\n Yes, but: It could also strengthen the hand of lawmakers who argue that today&#39;s outdated antitrust laws lack the teeth to restrain the power wielded by Google, Facebook, Amazon and Apple.\n Driving the news: Judge James Boasberg of the Federal District Court in D.C.  sent the Federal Trade Commission back to the drawing board to show exactly how Facebook has a monopoly in the market for &#34;personal social networking services.&#34;\n The FTC&#39;s suit, filed in December, is &#34;legally insufficient,&#34; Boasberg wrote: &#34;It is almost as if the agency expects the court to simply nod to the conventional wisdom that Facebook is a monopolist.&#34;\n He also threw out a parallel lawsuit by a coalition of state attorneys general, whose objections to Facebook&#39;s acquisition of Instagram and WhatsApp, he ruled, came nearly a decade too late.\n Facebook investors received the news with glee, sending its stock up nearly 5% and driving the company&#39;s market cap  over $1 trillion for the first time.\n The big picture: The rulings came at a moment of high hopes for tech critics.\n For five years, a coalition of activists, lawmakers and scholars has castigated the giant tech companies over their market dominance, privacy and data policies, and failure to control the spread of online misinformation.\n Key  Biden administration appointees — including Tim Wu at the White House and new FTC chair Lina Khan — have come from this camp.\n Just days ago, the House Judiciary Committee approved a package of  a half-dozen new bills aimed at redefining antitrust rules to cover giant tech platforms.\n Advocates of stronger tech regulation argue that these proposals will give regulators tough new tools to restrain the industry&#39;s power.\n But even if they became law — a challenging prospect in the face of a sclerotic Senate — they would face inevitable judicial challenges on constitutional and other grounds.\n  Under current law, you have to  define a market, show that a company has a monopoly in that market, and then prove that the company has abused its monopoly.\n You can change the rules of the game, as the House Judiciary proposals aim to, but any law still needs to devise coherent tests for corporate misbehavior that courts can apply.\n Supporters of the new House bills say they will do just that. But the new laws are narrowly tailored to target a handful of companies and practices. They could be out of date before the appeals process has run its course.", "posttime": "2021-06-29 23:11:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,rust,ftc,antitrust,axios", "title": "对Facebook的FTC诉讼解雇表明难以制作反垄断费用，并可以刺激立法者加强过时的反托拉斯法 ", "title_en": "The dismissal of FTC suit against Facebook shows the difficulty of making antitrust charges stick and could spur lawmakers to strengthen outdated antitrust laws", "transed": 1, "url": "https://www.axios.com/facebook-ftc-ruling-brakes-tech-antitrust-c5079818-97a6-446a-ba0f-aa9e5d92d631.html", "via": "", "real_tags": ["facebook", "rust", "ftc", "antitrust", "axios"]}, {"category": "", "categoryclass": "", "imagename": "1904694a5862b09700abd7f4b92ba660.jpeg", "infoid": 1068535, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多么尴尬。联邦法官James Boasberg周二召开了联邦贸易委员会在寻找原子能机构失败的反垄断101：展示垄断之后试图分解Facebook。\n    FTC在谢尔曼法案第2章中起诉Facebook，这使得一家公司为“垄断或企图垄断”市场而言。该诉讼说Facebook收购了Instagram（2012）和WhatsApp（2014）来中和未来的竞争对手。作为证据，FTC通过CEO Mark Zuckerberg引用了陈述，例如“比竞争更好。”\n  我们表示，FTC诉讼弱势，并非最不重要的是，因为FTC在2012年批准了Facebook的10亿美元的Instagram。大多数WhatsApp用户在海外，而Facebook自己的即时消息应用程序仍有四倍的用户在美国。\n  正如Boasberg Notes的法官，原子能机构未能表明Facebook在社交媒体上有一个垄断，这是在第2节下带来反垄断诉讼的垄断。虽然政府声称Facebook的杂志是一个超过60％的人市场份额在“个人社交网络服务”市场中，它没有详细说明它用于计算此数字的指标或方法。\n      “这种不受支持的断言可能（几乎）在一个涉及更传统的商品市场的第2条案件中足够就足够，其中法院可以合理地推断出通过收入，销售单位或其他一些典型的指标来衡量市场份额或其他典型指标。”法官写道。 “但这种情况涉及普通或直观的市场。”\n  “PSN服务可以自由使用，”他补充道，Facebook的市场份额可能会根据正在衡量的内容而异。\n  法官在不偏见的情况下驳回诉讼，因此FTC可以在30天内重新提交修订的投诉。但他的责备是及时提醒拜登监管机构和国会成员，他渴望使用反托拉斯法惩罚大型技术。法律问题和法院历史悠久的审查历史，并派遣，并不基于有说服力的证据和谨慎的法律论证。你不能只是因为他们很大而破坏大企业。 ", "note_en": "What an embarrassment. Federal Judge James Boasberg Tuesday threw out the Federal Trade Commission’s lawsuit seeking to break up  Facebook after finding the agency failed Antitrust 101: Demonstrating a monopoly.\n    The FTC sued Facebook in December under Section 2 of the Sherman Act, which makes it unlawful for a company to “monopolize, or attempt to monopolize” a market. The lawsuit says Facebook acquired Instagram (2012) and WhatsApp (2014) to neutralize future competitors. As evidence, the FTC cited statements by CEO  Mark Zuckerberg such as “It is better to buy than compete.”\n  We  said the FTC lawsuit was weak, not least because the FTC had approved Facebook’s $1 billion Instagram purchase in 2012. Most WhatsApp users are overseas, and Facebook’s own instant-messaging app still has four times more users in the U.S.\n  The more basic problem, as Judge Boasberg notes, is that the agency failed to show that Facebook has a monopoly in social media, which is step one in bringing an antitrust suit under Section 2. While the government claimed Facebook had a more than 60% market share in the “Personal Social Networking Services” market, it didn’t detail the metrics or methods it used to calculate this figure.\n      “Such an unsupported assertion might (barely) suffice in a Section 2 case involving a more traditional goods market, in which the Court could reasonably infer that market share was measured by revenue, units sold, or some other typical metric,” the judge writes. “But this case involves no ordinary or intuitive market.”\n  “PSN services are free to use,” he added, and Facebook’s market share could vary enormously based on what is being measured.\n  The judge is dismissing the lawsuit without prejudice so the FTC can re-file an amended complaint within 30 days. But his rebuke is a timely reminder to Biden regulators and Members of Congress who are eager to use antitrust law to punish Big Tech. The law matters, and courts have a long history of examining, and dispatching, facile lawsuits that aren’t based on persuasive evidence and careful legal argument. You can’t break up big businesses merely because they are big.", "posttime": "2021-06-29 23:11:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "华尔街,华尔街日报,street,facebook", "title": "华尔街日报 ", "title_en": "Wall Street Journal", "transed": 1, "url": "https://www.wsj.com/articles/the-ftcs-facebook-face-plant-11624920269?mod=djemalertNEWS", "via": "", "real_tags": ["华尔街", "华尔街日报", "street", "facebook"]}]