[{"category": "", "categoryclass": "", "imagename": "9370fe07769b41e0dda8d93ca6487b88.jpg", "infoid": 1005042, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "安全记分卡在全球向远程工作转变之际修订其网络安全风险管理产品2020年6月3日。\n更多新闻。\nHome.aspx与您的数千名同行一起接收我们每周的时事通讯，其中包含最新新闻、行业活动、客户洞察力和市场情报。\n*所需", "note_en": "SecurityScorecard Revamps Its Cybersecurity Risk Management Product Amidst Global Shift to Remote Work  June 03, 2020\n  More News\n          home.aspx      Join thousands of your peers and receive our weekly newsletter\r with the latest news, industry events, customer insights, and market intelligence.\n          *Required", "posttime": "2020-06-04 04:06:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,基本,releases,通讯", "title": "CISA发布其六个系列网络安全基本工具包中的第一个", "title_en": "CISA Releases First of Its Series of Six Cybersecurity Essentials Toolkits", "transed": 1, "url": "https://informationsecurity.report/news/cisa-releases-first-of-its-series-of-six-cybersecurity-essentials-toolkits/7230", "via": "", "real_tags": ["发布", "基本", "releases", "通讯"]}, {"category": "", "categoryclass": "", "imagename": "c0e1be35788304c1f8d3f08471141a59.png", "infoid": 1005041, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无可奉告：", "note_en": "No comments :", "posttime": "2020-06-04 04:05:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,advanced,无可奉告", "title": "使高级保护程序和Titan安全密钥更易于使用", "title_en": "Making the Advanced Protection Program and Titan Security Keys Easier to Use On", "transed": 1, "url": "https://security.googleblog.com/2020/06/making-advanced-protection-program-and.html", "via": "", "real_tags": ["程序", "advanced", "无可奉告"]}, {"category": "", "categoryclass": "", "imagename": "afe817603a4208c0455462f1a3730bca.jpg", "infoid": 1005039, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“纠察线和纠察牌不要用残暴来惩罚我，跟我说话吧，这样你就能知道发生了什么事。”--马文·盖伊(Marvin Gaye)。\n上周，这个国家目睹了乔治·弗洛伊德(George Floyd)缓慢而令人心碎的谋杀案，许多人在愤怒、抗议和绝望中爆发。单独目睹一起谋杀案会让人感到刺耳，但在此之前，不久前发生了几起类似的事件，从艾哈迈德·阿贝里(Ahmaud Arbury)到布雷娜·泰勒(Breonna Taylor)，以及之前的无数其他事件。\n但即使是这些事件也没有真正触及非裔美国人社区愤怒的核心；它们只是点燃了地下火药桶的火柴。与这些非常明显的事件不同，火药桶是建立在黑暗中所做的事情上的，没有手机向世界展示一直在发生的事情。\n警察对待非洲裔美国人既不同于其他种族，也不同于其他种族，这一点无处不在。以至于我们现在在风投工作的合伙人都有自己的故事可以分享(你可以在俱乐部、Twitter上收听其中的一些故事，或者在这里和这里找到一些故事)。\n在法律面前平等，在执法前不平等，这是残暴的。这是不对的。这与我们公司的价值观背道而驰。\n这带来的连锁反应是显著的，很容易把一个人从生活的快车道上撞倒。如果你的皮肤是黑的，你天生就是嫌疑犯。如果你没有教育，没有流动性，没有网络，没有社会证明，没有导师，没有商业知识，那么风险投资界就看不到你。对于那些确实拥有所有这些东西的人来说，获得资金已经够难的了，那么那些拥有才华-但没有网络和技术诀窍-的人将如何被看到呢？\n我们的企业文化基于这样一种观念，即语言本身是空洞的。文化不是一套信仰。这是一套动作。\n这就是我们宣布人才x机会基金(TXO)和计划的原因。这个基金是为那些有才华、动力和想法来创建伟大的企业，但缺乏典型的背景和资源的企业家而设计的，我们已经研究了6个月-包括弄清楚原型模型；计划一个种子前期的培训计划；对隐藏的天才创始人进行研究和命名，这在硅谷是看不到的。这项工作将由奈特·琼斯(Nait Jones)领导，他在过去五年里一直是安德森·霍洛维茨(Andreessen Horowitz)的合伙人；此前，他曾与我们的投资组合创始人一起制定上市计划。近十年前，当他创办自己的公司时，他从中西部搬到了硅谷，作为一个局外人，他自己也必须克服这些创始人面临的一些同样的挑战。\n我们将在第一年资助和培训一个小团队，然后在接下来的几年扩大规模。我们正在寻找那些没有进入生活快车道但有巨大潜力的企业家。他们的产品可以是非高科技的，也可以是高科技的；他们应该来自服务不足的社区(欢迎所有背景)；理想情况下，他们的业务应该有一个有趣的模式、利基市场和/或一点吸引力来表明前景和潜力。\n除了种子资本，我们还将通过培训计划等为这些潜在的伟大企业家提供公司的知识和网络。这样做的目的是让这些创业者有机会获得更多资金(就像是为看不见的人提供的加速器，结果是获得风投资金)，或者根据学到的东西按自己的方式发展业务。以下是有关它将如何工作的更多细节：\n我们将投资以换取企业的股权，但100%的投资回报将保留在基金中，为未来的企业家提供资金-因此，每个成功的企业家都会自动将其转给下一位企业家，因为所有利润都会循环进入未来几代企业家手中。\n每一批人都将参加一个为期10个月的培训计划，在那里我们将从我们网络中经验丰富的操作员那里(在线)提供指导和指导。\n该基金是一个由Tides管理的捐赠者咨询基金，为捐赠者提供税收优惠-我们欢迎其他人的捐赠来帮助我们这一努力(链接如下)。\n本和费利西亚·霍洛维茨夫妇将在任何其他捐款中匹配高达500万美元的额外捐款。\n我们是风险资本家，不是激进分子。我们支持人们为具体解决治安问题所做的令人惊叹的工作，更广泛地支持刑事司法系统，以及许多其他努力，但我们的直接贡献将是做我们最擅长的事情：帮助企业家成为更好的企业家，这样他们就可以建立伟大的企业，进而为他人创造就业机会和价值。\n我们知道伟大就在那里，正如我们在安德烈·哈雷尔(Andre Harell)、C·J·沃克夫人(Madame C.J.Walker)和迪迪(Diddy)等企业家身上看到的那样。但是让我们把现在存在的隐藏的潜力让它看得见。这项基金和计划旨在填补成功的文化领袖和没有机会成功的文化领袖之间的空白。创业并不是每个人都能接触到的，但事实仍然是，成为一名企业家是拥有自己的未来、增加跨越时间和地点的流动性、发明新的做事方式和打造新系统的最有力的方式之一。当我们走出这个悲剧性的时刻，让我们一起建设。\n如果你是一位雄心勃勃的创始人，拥有一家正在工作的企业，但你觉得自己没有网络和知识来将它打造成可能取得的成功，可以通过单击此处向TXO基金申请。\n如果你愿意和我们一起成为TXO基金的合伙人，帮助有才华的企业家充分发挥他们的潜力，你可以点击这里捐款。(如果您对捐赠有任何疑问，请发送电子邮件至txo@a16z.org或txo@tides.org。)。\n这里所表达的观点是引用的AH Capital Management，L.L.C.(“a16z”)个人人员的观点，而不是a16z或其附属公司的观点。这里包含的某些信息是从第三方渠道获得的，包括从a16z管理的基金的投资组合公司获得的。虽然a16z是从被认为可靠的来源获得的，但它并没有独立核实这些信息，也没有就这些信息的持久准确性或其在特定情况下的适当性做出任何陈述。此外，此内容可能包括第三方广告；a16z没有审核过此类广告，也不认可其中包含的任何广告内容。\n本内容仅供参考，不应作为法律、商业、投资或税务建议使用。关于那些问题，你应该咨询你自己的顾问。对任何证券或数字资产的提及仅用于说明目的，并不构成提供投资咨询服务的投资建议或要约。此外，这些内容不针对任何投资者或潜在投资者，也不打算供任何投资者使用，在任何情况下，在决定投资于a16z管理的任何基金时都不能依赖这些内容。(投资a16z基金的要约只能通过任何此类基金的私募备忘录、认购协议和其他相关文件进行，并应完整阅读。)。提到、提及或描述的任何投资或投资组合公司并不代表对a16z管理的投资工具的所有投资，也不能保证这些投资将是有利可图的，也不能保证未来进行的其他投资将具有类似的特点或结果。由安德森·霍洛维茨管理的基金进行的投资清单(不包括发行人没有提供a16z公开披露许可的投资，以及对公开交易的数字资产的未宣布投资)可在https://a16z.com/investments/.上查阅。\n其中提供的图表仅供参考，在做出任何投资决策时不应依赖。过去的业绩并不代表未来的成果。内容仅截至指定日期。这些材料中表达的任何预测、估计、预测、目标、前景和/或意见如有更改，恕不另行通知，并可能与其他人表达的意见不同或相反。有关其他重要信息，请访问https://a16z.com/disclosures。", "note_en": "“Picket lines and picket signs  Don’t punish me with brutality  Talk to me, so you can see  Oh, what’s going on  What’s going on”  –Marvin Gaye\n Last week the country watched the slow and heart-wrenching murder of George Floyd and many exploded in outrage, protest, and desperation. Witnessing a murder would be jarring in isolation, but it followed several similar incidents in the immediate past from Ahmaud Arbery to Breonna Taylor and countless others before.\n But even these incidents do not really get to the heart of the outrage among the African American community; they were just the matches that lit the powder keg underneath. Unlike these highly visible incidents, the powder keg has been built on deeds done in the dark, without cellphones to show the world what’s  always been going on.\n Police treating African Americans both differently and less than other races is pervasive. So much so that our own partners who now work in VC have their own stories to share (you can listen to some of these  on Clubhouse, on Twitter, or find some of them  here and  here).\n Being equal before the law, but unequal before law enforcement, is atrocious. It is wrong. It is against our firm’s values.\n The knock-on effects of this are significant and can easily knock a person off the fast track of life. If your skin is dark, you’re born a suspect. If you do not have the education, the mobility, the network, the social proof, the mentors, the business knowledge, then the Venture Capital world cannot see you. It’s hard enough as it is for people who DO have all these things to get funded, so how are those who have the talent — but not the network and the know-how — going to be seen?\n Our firm culture is based on the idea that words by themselves are empty. A culture is not a set of beliefs. It’s a set of actions.\n This is why we’re announcing The Talent x Opportunity Fund (TxO) and program. Designed for entrepreneurs who have the talent, drive, and ideas to build great businesses but lack the typical background and resources to do so, this fund is something we’ve been working on for 6 months — including figuring out the prototype model; planning a training program for pre-seed;  doing research and taking names on hidden genius founders you would not see in Silicon Valley. The effort will be led by Nait Jones, who’s been a partner at Andreessen Horowitz for the past five years; previously, he worked with our portfolio founders on their go-to-market plans. He moved to Silicon Valley from the midwest almost a decade ago when starting his own company, and as an  outsider himself had to overcome some of the same challenges these founders face.\n We will fund and train a small group in the first year, then expand in subsequent years. We are looking for entrepreneurs who did not have access to the fast track in life but who have great potential. Their products can be non-tech or tech; they should be from underserved communities (all backgrounds welcome); and ideally, their business will have an interesting model, niche market, and/or a little traction to indicate the promise and potential.\n In addition to seed capital, we will provide these potentially great entrepreneurs with the knowledge and the network of the firm through training programs and more. The goal of this is to give these entrepreneurs a chance to then get further funding (much like an accelerator for the unseen, where the outcome is to go get VC money) or to grow their businesses their way based on the learnings. Here’s more details on how it will work:\n We will invest in exchange for equity in the business, but 100% of the investment returns will remain in the fund to finance future entrepreneurs — so every successful entrepreneur will automatically pay it forward to the next, as all profits get recycled into future generations of entrepreneurs.\n Each cohort will join a 10-month training program where we will provide mentorship and instruction (online) from experienced operators in our networks.\n  The Fund is a Donor Advisory Fund managed by  Tides which provides tax benefits for the donor — we welcome donations from others to help us in this effort (link below).\n Ben and Felicia Horowitz will match up to an additional $5,000,000 total in any other donations.\n We’re venture capitalists, not activists. We support the amazing work that people are doing to fix policing specifically, the criminal justice system more generally, and many other efforts, but our direct contribution will be doing what we do best: To help entrepreneurs be better entrepreneurs, so they can build great businesses that in turn create jobs and value for others.\n We know the greatness is out there as we have seen it in entrepreneurs such as Andre Harell, Madame C.J. Walker, and Diddy. But let’s take the hidden potential that’s out there right now and make it  seen. This fund and program aims to fill a gap between the  cultural leaders who have made it, and those who haven’t had a chance to make it. Entrepreneurship hasn’t been accessible to everyone, but the fact remains that being an entrepreneur is one of the most powerful ways to own your own future, to increase mobility across time and place, to invent new ways of doing things, and to forge a new system. As we emerge from this tragic moment, let’s build.\n If you’re an ambitious founder with a working business and don’t feel you have the network and knowledge to build it into the success it could be, apply to the TxO Fund by clicking   here .\n If you’d like to become a partner along with us in TxO Fund and help talented entrepreneurs realize their full potential, you can donate by clicking    here  . (If you have questions about your donation please email txo@a16z.org or txo@tides.org.)\n   The views expressed here are those of the individual AH Capital Management, L.L.C. (“a16z”) personnel quoted and are not the views of a16z or its affiliates. Certain information contained in here has been obtained from third-party sources, including from portfolio companies of funds managed by a16z. While taken from sources believed to be reliable, a16z has not independently verified such information and makes no representations about the enduring accuracy of the information or its appropriateness for a given situation. In addition, this content may include third-party advertisements; a16z has not reviewed such advertisements and does not endorse any advertising content contained therein.\n This content is provided for informational purposes only, and should not be relied upon as legal, business, investment, or tax advice. You should consult your own advisers as to those matters. References to any securities or digital assets are for illustrative purposes only, and do not constitute an investment recommendation or offer to provide investment advisory services. Furthermore, this content is not directed at nor intended for use by any investors or prospective investors, and may not under any circumstances be relied upon when making a decision to invest in any fund managed by a16z. (An offering to invest in an a16z fund will be made only by the private placement memorandum, subscription agreement, and other relevant documentation of any such fund and should be read in their entirety.) Any investments or portfolio companies mentioned, referred to, or described are not representative of all investments in vehicles managed by a16z, and there can be no assurance that the investments will be profitable or that other investments made in the future will have similar characteristics or results. A list of investments made by funds managed by Andreessen Horowitz (excluding investments for which the issuer has not provided permission for a16z to disclose publicly as well as unannounced investments in publicly traded digital assets) is available at  https://a16z.com/investments/.\n Charts and graphs provided within are for informational purposes solely and should not be relied upon when making any investment decision. Past performance is not indicative of future results. The content speaks only as of the date indicated. Any projections, estimates, forecasts, targets, prospects, and/or opinions expressed in these materials are subject to change without notice and may differ or be contrary to opinions expressed by others. Please see  https://a16z.com/disclosures for additional important information.", "posttime": "2020-06-04 03:58:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人才,talent,投资", "title": "a16z：人才X机会基金", "title_en": "A16Z: The Talent X Opportunity Fund", "transed": 1, "url": "https://a16z.com/2020/06/03/talent-x-opportunity/", "via": "", "real_tags": ["人才", "talent", "投资"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005038, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近，我被提示升级我的免费福克斯阅读器(Foxit Reader)。我想是昨天吧。我现在的版本是10.0.0.35798。现在我的Foxit PDF打印机不见了。这是应该发生的吗？这意味着免费的Foxit Reader不再提供打印PDF的功能，这就是我安装它的原因。我刚刚试着卸载了Foxit Reader，从Foxit上下载了当前的安装程序，然后重新安装。生成的版本与上面相同。仍然没有PDF打印机。有没有人能说出他们是否也有同样的问题？这会让我更好地猜测这只是我当地环境的问题，还是现在的免费阅读器真的排除了PDF打印机。我使用的是Windows10。", "note_en": "I was recently prompted to upgrade my free Foxit Reader. I believe that it was yesterday. I am now at version 10.0.0.35798. Now my Foxit PDF printer is gone.  Is this supposed to happen?  It means that the free Foxit Reader no longer provides the ability to print to PDF, and that&#39;s the reason why I installed it.  I just tried uninstalling Foxit Reader, downloading the current installer from Foxit, and reinstalling. The resulting version is the same as above. Still no PDF printer.  Can anyone say whether they have the same problem? That would let me better guess whether it&#39;s just a problem with my local environment or whether the free reader really excludes the PDF printer now.  I am using Windows 10.", "posttime": "2020-06-04 03:58:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "打印,reader,foxit", "title": "Foxit Reader更新删除打印到PDF", "title_en": "Foxit Reader update removes Print to PDF", "transed": 1, "url": "https://forums.foxitsoftware.com/forum/portable-document-format-pdf-tools/foxit-reader/177686-foxit-pdf-printer-gone-after-foxit-reader-upgrade", "via": "", "real_tags": ["打印", "reader", "foxit"]}, {"category": "", "categoryclass": "", "imagename": "872a63c2366c0f16a76a873aedf2664e.jpg", "infoid": 1005037, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "联邦调查局局长詹姆斯·科米再次挑战白宫关于警务和黑人生命也是运动的官方路线。科米10月16日在圣地亚哥向国际警察局长协会发表讲话时警告说，“警察是有偏见的、暴力的和不公平的说法”正在导致“更多的年轻黑人男性死亡”。他补充说，这种说法也“威胁到了警察的未来”。\n科米之前也曾直言不讳。2015年10月，在他观察到暴力犯罪率上升很可能是警察…", "note_en": "FBI Director James Comey has again defied the official White House line on policing and the Black Lives Matter movement. The “narrative that policing is biased and violent and unfair” is resulting in “more dead young black men,” Mr. Comey warned in an Oct. 16 address to the International Association of Chiefs of Police in San Diego. That narrative, he added, also “threatens the future of policing.”\n  Mr. Comey has spoken out before. In October 2015, after he observed that rising violent crime was likely the result of officers...", "posttime": "2020-06-04 03:58:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "警察,racist", "title": "“种族主义警察的神话”(2016)", "title_en": "The Myth of the Racist Cop (2016)", "transed": 1, "url": "https://www.wsj.com/articles/the-myth-of-the-racist-cop-1477261025", "via": "", "real_tags": ["警察", "racist"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005035, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SpaceX公司将于今晚(6月3日)将其下一批Starlink互联网卫星送入轨道，此前两周的天气延误，以及该公司历史性的首次宇航员飞行。\nSpaceX公司已经执行过四次飞行任务的猎鹰9号火箭将从该公司位于佛罗里达州卡纳维拉尔角空军基地40号发射综合体的发射台上发射60颗新的Starlink卫星进入轨道。发射定于晚上9点25分。美国东部夏令时(格林尼治标准时间0125 6月4日)。\n你可以在这里和Space.com上观看发射实况，由SpaceX提供，大约在发射前10分钟开始。你也可以直接从SpaceX的发射网站上或通过SpaceX的YouTube页面观看这次发射。\n今晚的星链发射是SpaceX卫星星座项目的第八次任务，原定于5月中旬发射。由于一系列的天气和日程冲突，会议被推迟了。如果天气原因不能在今晚发射，备用日期是周四(6月4日)，也就是SpaceX公司2010年首次发射猎鹰9号的10周年纪念日。\n自2019年以来，SpaceX已经将422颗Starlink卫星送入轨道，在轨道上建立了一个由1.2万颗卫星组成的巨型星座。该项目旨在向世界各地的客户提供高速互联网服务，特别是在偏远或服务不足的地区。SpaceX首席执行官埃隆·马斯克(Elon Musk)表示，SpaceX将至少需要400颗Starlink卫星提供基本服务，其中800颗卫星需要中等覆盖。\n由于轨道上有如此多的Starlink卫星(SpaceX正在运营有史以来最大的卫星机队)，该公司受到了天文学家和科学家的抨击，他们担心这会影响天文研究。上周，SpaceNews报道称，SpaceX公司很快就会使用VisorSat限制反射率的设计，为其所有的Starlink卫星增加遮阳罩。据SpaceNews报道，SpaceX负责卫星政府关系的副总裁帕特里夏·库珀(Patricia Cooper)表示，该公司的遮阳项目将在目前设计的最后80颗卫星发射后开始。\n猎鹰9号助推器发射即将到来的Starlink卫星，将与这项任务一起进行第五次太空之旅。这是SpaceX公司第二次发射五次助推器。这项任务的助推器在今年早些时候发射了两次星链任务，2019年的铱-8任务和2018年的Telstar 18 Vantage卫星。\n由于天气原因，一枚阿特拉斯-V火箭(Atlas V)在附近停机坪为美国太空部队(US Space Force)运送一架X-37B航天飞机的飞行被推迟了24小时，原计划于5月17日发射的“星际链接”(Starlink)任务被推迟了24小时。5月18日的发射尝试由于猎鹰9号近海着陆区的天气原因被取消，SpaceX公司也因热带风暴亚瑟的影响而停止了5月19日的发射。\n在最后一次推迟之后，SpaceX的代表表示，该公司将停职，直到美国国家航空航天局(NASA)的Demo-2任务发射之后。演示2是SpaceX首次与宇航员一起发射“龙”号机组人员。5月30日，它从美国宇航局肯尼迪航天中心发射了宇航员鲍勃·本肯和道格·赫尔利，并在一天后抵达国际空间站。\n发电子邮件给Tariq Malik，电子邮件地址是：ttmalik@space.com，或者关注他的电子邮件：@ttmalik@tariqjmalik。关注我们@Spacedotcom，Facebook和Instagram。\n在有限的时间内，您可以订阅我们任何畅销的科学杂志，每月只需2.38美元，即前三个月的标准价格有45%的折扣。视图交易。\n加入我们的空间论坛，继续谈论空间的最新任务，夜空和更多！如果您有任何新闻提示、更正或评论，请发送电子邮件至：Community@space.com。", "note_en": "SpaceX will launch its next batch of  Starlink internet satellites into orbit tonight (June 3) after two weeks of weather delays and the company&#39;s historic first astronaut flight.\n A  Falcon 9 rocket, which SpaceX has already flown four past missions, will launch 60 new Starlink satellites into orbit from the company&#39;s pad at Launch Complex 40 at Cape Canaveral Air Force Base in Florida. Liftoff is set for 9:25 p.m. EDT (0125 June 4 GMT).\n  You can watch the launch live here and on Space.com, courtesy of SpaceX, beginning about 10 minutes before launch. You can also watch the launch directly from  SpaceX&#39;s launch website here and via  SpaceX&#39;s YouTube page.\n    Tonight&#39;s Starlink launch, the eighth mission for SpaceX&#39;s satellite constellation project, was originally scheduled to launch in mid-May. It was delayed by a series of weather and schedule conflicts. If weather prevents a launch tonight, a backup date is available on Thursday (June 4), the tenth anniversary of  SpaceX&#39;s first Falcon 9 launch in 2010.\n SpaceX has launched 422 Starlink satellites into orbit since 2019 as it builds a 12,000-satellite megaconstellation in orbit. The project aims to provide high-speed internet service to customers around the world, particularly in remote or under-served areas. SpaceX CEO Elon Musk has said that SpaceX would need at least 400 Starlink satellites for basic service, with 800 needed for moderate coverage.\n With so many Starlink satellites in orbit (SpaceX is operating the largest satellite fleet ever), the company has  come under fire from astronomers and scientists worried about impacts to astronomical research. Last week,  SpaceNews reported that SpaceX will soon add &#34;sunshades&#34; to all of its Starlink satellites  using a VisorSat design that limits reflectivity. Patricia Cooper, SpaceX&#39;s vice president of satellite government relations, said the company the sunshade project will begin after the last 80 satellites of the current design are launched,  according to SpaceNews.\n  The Falcon 9 booster launching the upcoming Starlink satellites will make its fifth trip to space with the mission. It&#39;s the second time SpaceX will launch a booster five times. This mission&#39;s booster launched two Starlink missions earlier this year, the  Iridium-8 mission in 2019 and the  Telstar 18 VANTAGE satellite in 2018.\n A plan to launch tonight&#39;s Starlink mission on May 17 was postponed 24 hours after weather delayed the flight of an Atlas V rocket  carrying an X-37B space plane for the U.S. Space Force at a nearby pad. A May 18 launch attempt was called off due to weather in the Falcon 9&#39;s offshore landing zone, and  SpaceX stood down from a May 19 launch due to the weather impacts of Tropical Storm Arthur.\n After that last delay, SpaceX representatives said the company would stand down until after the launch of its  Demo-2 mission for NASA. Demo-2 was SpaceX&#39;s  first Crew Dragon launch with astronauts. It launched astronauts Bob Behnken and Doug Hurley from NASA&#39;s Kennedy Space Center on May 30 and arrived at the International Space Station a day later.\n  Email Tariq Malik at   tmalik@space.com  or follow him   @tariqjmalik . Follow us   @Spacedotcom ,   Facebook  and   Instagram .\n For a limited time, you can take out a digital subscription to any of  our best-selling science magazines for just $2.38 per month, or 45% off the standard price for the first three months. View Deal\n Join our Space Forums to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at:  community@space.com.", "posttime": "2020-06-04 03:57:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "今晚,satellites,发射", "title": "SpaceX今晚将发射60颗用于巨型星座的Starlink卫星", "title_en": "SpaceX to launch 60 Starlink satellites for megaconstellation tonight", "transed": 1, "url": "https://www.space.com/spacex-starlink-satellite-launch-may-2020-webcast.html", "via": "", "real_tags": ["今晚", "发射"]}, {"category": "", "categoryclass": "", "imagename": "f1a9dd47098e1d625f66155c0a312a1d.jpg", "infoid": 1005034, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "咖啡是通过从烘焙的豆子中提取一系列复杂的有机分子制成的，这些分子已经被研磨成细小的颗粒。提取取决于温度、水的化学成分以及咖啡的可及表面积。在这里，我们调查单一来源咖啡豆生产过程中的变化是否会影响研磨时的粒度分布。我们发现粒度分布与豆类的来源和加工方法无关。此外，我们还阐述了豆类温度对粒度分布的影响，得出冷研磨会导致粒度分布变窄，平均粒度变小的结论。我们预计这些结果将对咖啡的工业生产产生影响，并对我们每天储存和使用咖啡的方式做出贡献。\n咖啡是仅次于石油的最有价值的合法交易商品。供消费的咖啡有两个生物学上不同的品种：加拿大咖啡(Robusta)和阿拉伯咖啡(Arabica)1。虽然robusta的化学成分比阿拉比卡少，味道也不像阿拉比卡，但它得益于在低海拔地区种植可行，而且是抗虫害的。然而，全球咖啡消费量的60%以上来自阿拉比卡。2014年，巴西和哥伦比亚合计生产了超过350万吨绿色阿拉比卡2，埃塞俄比亚和其他非洲和中美洲生产国也做出了重大贡献。包括越南这样几乎只生产罗布斯塔的国家，全球咖啡年产量达到850万吨。\n除了不同寻常的绿咖啡药用和饮食制剂外，咖啡通常不是作为固体食用，而是从烘焙的种子3、4、5、6、7、8、9中提取出来的。咖啡豆是进口的，经过烘焙、研磨，然后在咖啡店和家里冲泡(包括速溶咖啡)。在这样一个有价值的行业里，产品的质量和产量是最重要的。然而，有许多变量影响这种大量消费的饮料的风味、产量和整体享受10。与确保咖啡质量相关的挑战可以分为两类：i)与原产国相关的变量；ii)与消费相关的变量。\n除了气候和海拔等典型的植物学影响外，影响原产地咖啡的一般因素有两个：咖啡的品种(如Typica、Pacamara、Geisha)11和加工方法(如洗咖啡、制浆咖啡和天然咖啡)。该品种定义了豆子的化学特性，以及它可以生长的条件。理想情况下，咖啡豆的果实成熟速度不应快于卵子的发育，否则种子缺乏化学复杂性。相反，果实应该能够在不同的气候条件下成熟，从而允许种子的形成。遗传品种杂交种现在无处不在，通常以亲本品种12、13中最好的品种为特色。\n不管是什么品种，所有的咖啡都是用三种一般方法中的一种来加工的。洗涤(或湿洗)过程是最常见的，用水去掉樱桃的皮和果实，只留下种子在阳光下晒干。制浆(天然制浆)加工方法将樱桃的皮去掉，但不能完全去掉粘液。然后在羊皮纸(种子的薄保护层)周围形成一层阳光硬化的富含糖分的外壳。自然过程只是将咖啡樱桃晒干，种子和水果都完好无损。\n虽然所使用的加工方法对风味有深远的影响，但决定这些差异的化学机制还没有被很好地理解。不管樱桃的加工方法是什么，干燥后的豆子都会去壳，这会通过去掉所有干燥的羊皮纸、粘液或皮来暴露豆子。然后，青咖啡豆被运到烘焙店，在那里烘焙者建立一个烘焙轮廓，目的是制作出最美味的杯子来满足他们的口味。烘焙轮廓是温度和时间的双变量问题，但是由于烘焙设备的限制和到生咖啡14的热传递的不均匀性，烘焙轮廓的开发更具艺术性而不是科学性，尽管在这一领域肯定有改进的空间。\n图1中的烘焙曲线显示了表1中列出的坦桑尼亚咖啡在烘焙过程中测得的烘焙温度。烘焙咖啡的化学成分取决于生咖啡分子分解的温度。这些化合物的生成和浓度控制是通过微调烘焙轮廓15、16、17来实现的。虽然烘焙咖啡中的大多数化合物很可能是美拉德产品(图1中没有显示一个例子)18，但我们提出了允许形成的各种途径\n毫无疑问，提取的程度和质量取决于烘焙咖啡中所含有机分子的可及性。影响不同有机分子提取总量和相对比例的因素很多，包括冲泡温度、水化学和水与咖啡的比例21、22、23、24。然而，在这里，我们特别关注增加可接近表面积的物理方法，即研磨机的效果。\n虽然这是制药行业的例行公事，但在咖啡厅设计和执行粒度均匀的研磨是一件具有挑战性的事情。然而，这在咖啡冲泡中是至关重要的，因为可变的可接近表面积导致小颗粒比大颗粒提取得更快。因此，冲泡咖啡在粒度可变的情况下是具有挑战性的，特别是在浓缩咖啡风格的加压酿造中，包装效果变得重要。考虑到粒度的重要性，我们评估了咖啡豆来源、樱桃加工方法和烘焙轮廓是否对磨碎咖啡的粒度分布有显著影响。\n此外，人们怀疑豆子的温度也会影响豆子的破裂动力学，从而影响最终的尺寸分布。虽然理想情况下豆类和毛刺都能达到所需的温度，但毛刺的受控主动加热或冷却目前是不可行的。为了研究温度效应，我们对咖啡本身进行了控制冷却。考虑到许多人将咖啡储存在冰箱或冰柜中(如果没有水蒸气，这是一种化学上合理的储存方法)，我们检查不同的豆子温度是否会导致研磨分布的可观察到的调制。\n在这项研究中，假设磨碎的咖啡在研磨过程中可以改变的最重要的特性是粒度分布。虽然颗粒形状可能会对最终提取的酿造产生影响，但很难看出如何在微米尺度上可靠地控制这一点，而且很可能大多数磨碎的咖啡都有类似的颗粒形状分布。\n第一组实验探索在相同条件下研磨时，豆子的来源、类型或加工方法是否对粒度分布有任何影响。第二组测量探索研磨时的豆子温度是否对产生的粒度分布有任何影响。\n为了探讨这些影响，我们采用了激光衍射粒度分析方法，对在Mahlkönig EK43咖啡研磨机上研磨的烘焙咖啡进行了粒度分析。\n对多波长Beckman Coulter LS13320 mW进行了激光衍射粒度分析。该仪器有一个内置的暗视场标尺，用来确保正确的光学对准。每次运行前都会进行对准检查，以确保粒度分布的最佳准确性。要特别注意确保正确的光学对准，因为磨碎的咖啡含有跨越3个数量级的颗粒尺寸，包括大于100 μm的成分，这对于使用基于衍射的技术进行测量可能是具有挑战性的，因为它们依赖于倒数空间中的距离测量。\n之所以选择如图2所示的Mahlkönig EK 43研磨机进行这项研究，是因为它的设计目的是在将咖啡放入料斗和随后的研磨之间具有最短的停留时间。与所有磨床一样，EK 43毛刺是可更换的，很容易不对准(两个磨盘不是完全平行的)。我们在测试当天接触到了三个独立的EK 43 ；其中两个安装了所谓的咖啡毛刺，一个安装了土耳其毛刺(图2)。毛刺对齐最初可以通过关闭毛刺孔径并打开磨床来进行声音评估，从而使它们发出“啁啾”声。啁啾的音调提供了对准的洞察力，更深的啁啾表明毛刺之间的接触更多，因此对准效果更好。评估磨粒分布的平滑度和铺展程度也可以给出毛刺对齐的信息，尽管根据这些信息可靠地调整对齐是困难和缓慢的。我们在图S1中提供了一个由毛刺未对准引起的颗粒大小分布的例子。最终，我们选择了那天生产主观上适销对路的浓缩咖啡的研磨机，这是由当地一名合格的Q级评价员和店主(Maxwell Colonna-Dashwood)27决定的。这里的实验是在Mahlkönig EK43磨床上进行的，转速为1480rpm，并使用土耳其毛刺进行磨削。\nEK43型磨床(A)由两个毛刺组成，一个是固定式的，另一个是移动式的。料斗到新梢的路径是线性的，因此磨碎的咖啡在毛刺和新梢中的滞留量最小。毛刺有两种：土耳其毛刺(B)和咖啡毛刺(C)。这两个毛刺之间的主要区别在(b，c)中分别用蓝色强调。扁平的三角形末端是用来抛光颗粒的。在这项研究中，我们使用了土耳其毛刺集合。斯宾塞·韦伯拍摄的照片。\n为了确定豆类产地是否对研磨后的粒度分布有影响，对来自四个国家的豆类进行了测试：危地马拉、萨尔瓦多、坦桑尼亚和埃塞俄比亚。这些豆子在研磨试验前7至16天由表1中列出的烘焙店烘焙过，因此有足够的时间进行二氧化碳脱气，但仍被认为是“新鲜烘焙的”。表1列出了本研究中考虑的四种咖啡的更多细节。所有咖啡豆都被允许平衡到室温(当时是20 °C和79%的相对湿度)，没有测量烘焙咖啡豆的密度。在整个实验过程中，所有咖啡的研磨机毛刺孔径都保持恒定，固定在原料EK43刻度盘上的2.7(任意单位)。对于每一次测量，研磨20克咖啡，并在每次研磨后允许研磨机冷却10 分钟(返回室温)。\n对于温度研究，我们选择了危地马拉咖啡，因为这种特殊的危地马拉咖啡代表了当代特色级咖啡(即它在酸度、花香复杂性和整体口感之间取得了良好的平衡)。这四个温度是使用以下方法实现的：将20 g的完整烘焙咖啡豆放入纸杯中，盖上盖子，然后放入液氮、一桶干冰、冰箱和台面上。在冷却到0 °C以下的任何样品上都没有观察到明显的大气水凝结。在研磨前，豆子在每个温度下保持2 小时的平衡。\n研磨机在研磨前5 秒打开，豆子直接从它们的气候中取出，送入料斗。EK43的额定研磨速度为1,200-1,500 g/分钟，这表明每20 g剂量的咖啡在环境条件下暴露的时间不超过1 秒。为了防止大气中的水凝结到磨碎的咖啡表面，研磨的颗粒立即被放入样品瓶中进行激光衍射粒度分析。大气水分的吸收被证明不是问题，因为重复的样品在室温下平衡时暴露在大气湿度中，与那些研磨后立即密封的样品没有什么不同。\n每个数据集一式三份，每个温度一式两份，从而每个温度产生6个数据集。采用方差分析方法，综合考虑豆类来源、加工方法、焙烧和焙烧等因素，确定颗粒数分布的相似性。此统计分析的输出包含在支持信息中。\n烘焙咖啡豆的物理结构是一种复杂的材料复合材料，含有高分子量的纤维分子，夹杂着大量较小有机物的无定形和部分结晶的区域。烘豆和研磨设备的极其复杂的结构使得精确的第一原理建模成为一个令人望而生畏的前景，因此最好通过实验来研究破裂(与之前研磨其他非晶态材料的研究一致)28、29、30、31、32。也就是说，可以很好地预期，赋予不同咖啡独特风味的特定化学物质组合可能会改变咖啡豆的破碎方式。\n为了调查这一点，我们选择了四种特级咖啡作为样本。选择跨越了原产地、品种、加工方法和烘焙轮廓等变量，是当代特产咖啡的代表性横截面。表1中描述的四种咖啡是在环境条件下使用规定的方法研磨的。\n在这里，我们关注的是研磨轮廓作为咖啡原产地的函数的偏差，尽管在开始这些实验之前，研磨轮廓看起来是什么样子并不清楚。EK43产生的颗粒范围从0.1 μm到1,000 μm，虽然我们选择用对数标尺表示大部分数据，但坦桑尼亚咖啡的线性标尺显示在图3的上部面板中。所有研磨轮廓都显示为倾斜高斯形状。在这种情况下，我们给出了蓝色阴影区域的粒子数分布，并以灰色表示积分。我们可以任意定义细颗粒截止，用图形表示为紫色虚线 = n，其中：\n精细的特殊分界线被描绘成一条紫色的虚线。中下板：这里检查的四种咖啡的研磨轮廓。累积数和表面积贡献分别以实线和虚线表示。坦桑尼亚人、埃塞俄比亚人、萨尔瓦多人和危地马拉人的个人资料分别以黑色、紫色、红色和蓝色显示。包括用于视觉辅助的数据模式i-vi：i-14.3、ii-27.4、iii-282.1、iv-13.0、v-27.4和vi-256.9 μm。\n这里，n是以μm为单位的直径。从图3的上面板中，坦桑尼亚的n = 70 μm(模式 = 13.0 μm，其中模式是最频繁出现的尺寸)。考虑到分布的不对称性质，该模式有助于分配分布的关键特征。然而，对咖啡提取有贡献的不仅仅是颗粒的数量，还有从这些颗粒获得的可用表面积。\n这里检测的四种咖啡的研磨轮廓如图3的中下图所示。它们以对数标度表示，以适应大颗粒对表面积的贡献。使用粒子33的球面近似来估计表面积，并由虚线表示。在这里，数据看起来明显是双峰的，因为细颗粒构成了可接近表面积的大部分(模式II和模式V)，但也存在大颗粒(直径大一个/两个数量级的粒子，直径大一个/两个数量级，三个数量级和六个数量级)。即使在低浓度的情况下，这些物质也会产生影响。\n研磨轮廓有一些细微的差异：黑色和紫色的轮廓具有相似的颗粒数模式(I)，细颗粒截止值为76.4 ± 3.5 μm。红色和蓝色的轮廓产生的颗粒分布略细，数字模式(Iv)1.3 ± 0.7 μm)比黑色/紫色咖啡更细，细颗粒截止值为69.6 ± 3.1 μm。总而言之，咖啡产生的研磨分布似乎非常相似。表S1提供了方差分析的全部细节。应该注意的是，与典型的消费级咖啡相比，这里考虑的所有咖啡豆的烘焙都相对“清淡”(尽管在“Agtron Gourmet Scale”上，这些咖啡都被归类为轻至中等烘焙)。我们只能推测严重腐烂的豆类(例如“深色”或法式烘焙)可能会在多大程度上偏离这些结果；需要进一步的实验来阐明这种影响。\n对于浓缩咖啡，咖啡研磨可以被认为是一种颗粒状物质，在捣固过程中增加的压力会堵塞材料34、35、36。颗粒大小的可变性在可接近的表面积中起着重要作用，也在水可能流经的真空空间中起着重要作用。从Herman 37的研究中可以明显看出，大颗粒安装了大量有序的相邻小颗粒，这会增加局部密度，因此会导致不均匀的水流通过浓缩咖啡机。然而，考虑到咖啡口味的主观性和业内从业者的偏好，目前还不清楚是否存在理想的粒度分布：我们只希望阐明咖啡之间令人惊讶的一致性。\n烤豆子研磨温度的不同会影响最后的研磨吗？非晶态材料的温度变化可以导致定义明确的玻璃化转变，其中材料从橡胶和柔性转变为坚硬和脆性38。一些固体也可以进行破碎运输。\n..", "note_en": "Coffee is prepared by the extraction of a complex array of organic molecules from the roasted bean, which has been ground into fine particulates. The extraction depends on temperature, water chemistry and also the accessible surface area of the coffee. Here we investigate whether variations in the production processes of single origin coffee beans affects the particle size distribution upon grinding. We find that the particle size distribution is independent of the bean origin and processing method. Furthermore, we elucidate the influence of bean temperature on particle size distribution, concluding that grinding cold results in a narrower particle size distribution, and reduced mean particle size. We anticipate these results will influence the production of coffee industrially, as well as contribute to how we store and use coffee daily.\n     Second only to oil, coffee is the most valuable legally traded commodity. There are two biologically dissimilar species of coffee grown for consumption;  Coffea canephora (robusta) and  Coffea arabica (arabica)  1. Whilst robusta is both less chemically complex and less flavoursome than arabica, it benefits from being feasibly grown at low altitude and is pest resistant. However, over 60% of the global coffee consumption is of arabica. In 2014, Brazil and Colombia combined to produce over 3.5 million tonnes of green arabica  2, with Ethiopia and other African and Central American producers also making significant contributions. Including countries like Vietnam which almost exclusively produces robusta, global coffee production amounts to 8.5 million tonnes annually.\n With the exception of unusual green coffee medicinal and dietary preparations, coffee is not typically consumed as a solid but rather an extract from the roasted seed  3, 4, 5, 6, 7, 8, 9. Coffee beans are imported, roasted, ground and then brewed (including instant coffee) in coffee shops and homes. In such a valuable industry, the quality and yield of the product is paramount. However, there are many variables that influence the flavour, yield and overall enjoyment of this mass consumed beverage  10. The challenges associated with ensuring coffee quality can be divided into two categories i) variables associated with the country of origin and ii) variables associated with consumption.\n Besides typical botanical influences including climate and altitude, there are two general considerations that affect the coffee at the origin: the variety of coffee ( e.g. Typica, Pacamara, Geisha)  11 and the processing method ( i.e. washed, pulped and natural). The variety defines chemical characteristics of the bean, and also the conditions in which it may be grown. Ideally, the fruit of the coffee bean should not ripen more rapidly than the ovum develops, otherwise the seed is lacking chemical complexity. Conversely, the fruit should be able to ripen in variable climate conditions thereby permitting the formation of the seed. Genetic variety hybrids are now ubiquitous and often feature the best of both of the parent varieties  12, 13.\n Irrespective of the variety, all coffee is processed in one of three general methods. The washing (or wet) process is the most common, and uses water to remove the skin and fruit of the cherry, leaving only the seeds to dry in the sun. The pulped (pulped natural) processing method removes the skin from the cherry, but does not fully remove the mucilage. This then forms a sun-hardened sugar-rich shell around the parchment (the thin protective layer for the seed). The natural process is simply the sun-drying of the coffee cherries with both seed and fruit intact.\n Whilst the processing method used has a profound impact on flavour, the chemical mechanisms which dictate these differences are not well-understood. Regardless of the cherry processing method, after drying the beans are hulled, which exposes the bean by removing all the dry parchment, mucilage, or skin. The green coffee beans are then transported to roasteries, where the roaster develops a roast profile with the aim of producing the most flavoursome cup to their palate. The roast profile is a two variable problem of temperature and time, but due to limitations of roasting equipment and the inhomogeneity of heat transfer into green coffee  14, the development of a roast profile is more artistic than scientific, although there is certainly room for improvement in this area.\n The roast profile presented in  Fig. 1 shows the measured roaster temperature as the roasting progresses for the particular Tanzanian coffee listed in  Table 1. The chemical constituents of roasted coffee depend on the temperatures of green coffee molecular decomposition. The generation and concentration control of these compounds is achieved through fine tuning of the roast profile  15, 16, 17. Whilst most compounds in roasted coffee are likely Maillard products (an example of which is not shown in  Fig. 1)  18, we present various pathways that permit the formation of acids, phenolic compounds, and also the cleavage of cellulose into sugar-related products like levoglucosan. The left-most process in  Fig. 1 shows an example of decomposition of a chlorogenic acid (a group of molecules contributing to 66% of the acidity in green coffee) through low temperature hydrolysis, in which the formation of products depend on the water content within the seed  19, 20.\n In this case, 10 kg of the Burka coffee was roasted in a 12 kg Probat Roaster. The temperature was monitored with a probe in the headspace of the oven, and hence the hot air rapidly cools due to thermal energy transfer to the green coffee. The temperature trajectory throughout the roasting process determines the decomposition of organic materials in coffee. Three illustrative decomposition reactions are shown that are representative processes throughout the heating process. At lower temperature a chlorogenic acid (left) may decompose through either hydrolysis or pyrolysis into quinic acid, acetic acid and the phenolic compound 3,4-dihydroxybenzyl alcohol  40, or quinic acid, carbon dioxide and 3,4-dihydroxystyrene  41, 42. Oxalic acid (centre) may decarboxylate to either CO 2 or in the case of incomplete combustion CO 2 and formic acid  19. At higher temperatures cellulose can undergo hydrolysis to smaller sugar derivatives including glucose and levoclucosan  43, 44, 45. Both the temperature and time determine the chemical composition of the roasted coffee: In this case, the coffee was removed from the oven after 9 m 54 s as this time was determined to result in a soluble, sweet and favourably acidic product.\n  Undoubtedly the extent and quality of extraction is dictated by the accessibility of the organic molecules contained within roasted coffee. Many factors influence the total amount, and relative proportions of the different organic molecules extracted, including temperature of brew, water chemistry and water-to-coffee ratio  21, 22, 23, 24. Here, however, we are specifically concerned with physical method of increasing accessible surface area;  i.e. the effect of the grinder.\n Whilst routine in the pharmaceutical industry, it is challenging to both design and execute a grind to a homogeneous particle size in a coffee shop. This, however, is of critical importance in coffee brewing because variable accessible surface area causes the small particles to extract more rapidly relative to larger ones. As a result, brewing coffee is challenging with variable particle size, especially in espresso-style pressurised brews, where packing effects become important  25, 26. Given the importance of particle size, we assess if bean origin, cherry processing method, and roast profile have any significant effect on the particle size distribution of the ground coffee.\n Additionally, it was suspected that the temperature of the beans could also influence the bean fracturing dynamics, and therefore the final size distribution. Whilst ideally the beans and burrs would both be brought to the desired temperature, controlled active heating or cooling of the burrs is not presently feasible. To investigate the temperature effects we pursued the controlled cooling of the coffee itself. Given that many people store coffee in the refrigerator or freezer (if devoid of water vapour this is a chemically reasonable method of storage), we examine if varying bean temperature results in an observable modulation of grind distribution.\n For this study, it was assumed that the most important property of the ground coffee which can vary in the grinding process is the distribution of particle sizes. Whilst it is possible that particle shape may have an effect on the final extracted brew, it is difficult to see how this can be reliably controlled on the micrometer scale, and it is likely that most ground coffee has a similar spread of particle shapes.\n The first set of experiments explored if the origin, type, or processing method of the bean had any effect on the particle size distribution, when ground under identical conditions. The second set of measurements explored if bean temperature at the time of grinding had any effect on produced particle size distribution.\n To probe these effects we employed laser diffraction particle size analysis of roasted coffees ground on a Mahlkönig EK 43 coffee grinder.\n  The laser diffraction particle size analysis was performed on the multiple wavelength Beckman Coulter LS13 320 MW. The instrument has a built in dark field reticule which is used to ensure correct optical alignment. An alignment check was carried out prior to every run to ensure the optimum accuracy of the particle size distribution. Particular care was taken to ensure correct optical alignment because ground coffee contains particles sizes spanning 3 orders of magnitude, including components larger than 100  μm, which can be challenging to measure with diffraction based techniques since they rely on distance measurements in reciprocal space.\n  The Mahlkönig EK 43 grinder, shown in  Fig. 2, was selected for this study because it is designed to have minimum retention time between placing the coffee in the hopper and subsequent grinding. Like all grinders, the EK 43 burrs are replaceable and are susceptible to becoming misaligned (where the two grinding discs are not perfectly parallel). We had access to three separate EK 43 s on the day of testing; two which were fitted with so-called coffee burrs and one with Turkish burrs ( Fig. 2). Burr alignment can initially be assessed audibly by closing the burr aperture with the grinder turned on, causing them to ‘chirp’. The pitch of the chirp provides insight into the alignment, with deeper chirps indicating more contact between the burrs and therefore better alignment. Assessing the smoothness and spread of ground particle distribution can also give information on burr alignment, though it is difficult and slow to reliably adjust alignment based on this information. We have provided one example of particle size distributions from a burr misalignment in  Figure S1. Ultimately, we elected to use the grinder that was producing subjectively marketable espresso shots that day, as determined by a resident qualified Q-grader and shop owner (Maxwell Colonna-Dashwood)  27. Experiments herein were performed with the Mahlkönig EK 43 grinder spinning at 1480 rpm and grinding with Turkish burrs.\n The EK 43 grinder, ( a) consists of two burrs; one stationary and one mobile. The hopper-to-shoot path is linear resulting in minimal retention of ground coffee in the burrs and shoot. There are two types of burrs: Turkish, ( b) and Coffee, ( c). The primary differences between the two burrs are emphasised in blue in ( b, c), respectively. The flat triangular ends are intended to polish the particulates. For this study we employed the Turkish burr set. Photographs taken by Spencer Webb.\n  To determine if bean origin has an effect on particle size distribution after grinding, beans were tested from four countries: Guatemala, El Salvador, Tanzania, and Ethiopia. The beans had been roasted by roasteries listed in  Table 1, between seven and sixteen days prior to the grinding test, and so had sufficient time for CO 2 degassing, but were still considered ‘freshly roasted’. Further details of the four coffees considered in this study are presented in  Table 1. All beans were allowed to equilibriate to room temperature (at the time, 20 °C and 79% relative humidity), densities of the roasted coffee beans were not measured. The grinder burr aperture was kept constant for all coffees throughout the experiment, fixed at 2.7 (arbitrary units) on the stock EK 43 dial. For each measurement, 20 grams of coffee was ground, and the grinder was allowed to cool for 10 minutes after each grind (returning to room temperature).\n  For temperature studies, we selected the Guatemalan coffee because this particular Guatemalan crop is representative of contemporary speciality grade coffee ( i.e. it has a favourable balance of acidity, floral complexity and overall taste). The four temperatures were achieved using the following method: 20 g of whole roasted coffee beans were placed into a paper cup, covered, and placed into either liquid nitrogen, a tub of dry ice, the freezer and on the counter top. No visible condensation of atmospheric water was observed on any of the samples cooled below 0 °C. The beans were equilibriated at each temperature for 2 hours prior to grinding.\n The grinder was switched on 5 seconds before grinding and the beans were taken directly from their climates and fed into the hopper. The EK 43 is rated to grind 1200–1500 g/min, suggesting each 20 g dose of coffee was exposed to ambient conditions for no longer than 1 second. To prevent condensation of atmospheric water onto the surface of the  ground coffee, the ground particulates were immediately placed into sample vials for laser diffraction particle size analysis. Absorption of atmospheric water proved not to be a problem, as duplicate samples which were exposed to atmospheric moisture as they equilibrated to room temperature, showed no difference to those that where sealed immediately upon grinding.\n Each data set was obtained in triplicate, and each temperature was obtained in duplicate thereby generating 6 data sets per temperature. ANOVA was employed for determination of similarities in particle number distributions with consideration of the bean origin, processing method, roast and roaster included. The output of this statistical analysis is included in the  supporting information.\n The physical structure of roasted coffee beans is a complex composite of materials, containing high molecular weight fibrous molecules interspersed with amorphous and partially crystalline domains of a vast array of smaller organics. The extremely complex structure of both the roasted beans and grinding apparatus makes accurate first principles modeling a daunting prospect, and so fracturing is best studied experimentally (in line with previous studies of grinding other amorphous materials)  28, 29, 30, 31, 32. That said, it could well be expected that the specific mix of chemicals that give different coffees their distinctive flavour may change the way in which the bean is fragmentised.\n To investigate this, we elected to sample four speciality grade coffees. The selection spans the variables of origin, variety, processing method and roast profile, and is a representative cross section of contemporary speciality coffee. The four coffees described in  Table 1 were ground at ambient conditions using the stipulated methods.\n Here we are concerned with the deviations in grind profile as a function of coffee origin, although before embarking on these experiments it was unclear what the grind profile looked like. The EK 43 produces particles ranging from 0.1  μm to 1000  μm, and whilst we have elected to present most of the data on a logarithmic scale, the linear scale is shown for the Tanzanian coffee in the upper panel of  Fig. 3. All grind profiles appear as a skewed-Gaussian shape. In this case, we present the particle number distribution in the shaded blue region, and the integral in grey. We can arbitrarily define the fine particulate cutoff, graphically represented as a purple dashed line =  n where:\n The fine particular cutoff is depicted as a purple dashed line. Middle and lower panel: The grind profiles of the four coffees examined here. The cumulative number and surface area contribution are shown in solid and dashed lines, respectively. The Tanzanian, Ethoipian, El Salvadorian and Guatemalan profiles are shown in black, purple, red and blue, respectively. Data modes  i- vi are included for visual aid:  i - 14.3,  ii - 27.4,  iii - 282.1,  iv - 13.0,  v - 27.4 and  vi - 256.9  μm.\n  Here,  n is a diameter in  μm. From the upper panel of  Fig. 3, the Tanzanian  n = 70  μm (mode = 13.0  μm, where the mode is the most frequent size occurrence). Given the skewed nature of the distribution, the mode is helpful in assigning key features of the distribution. However, it is not only the number of particles that contributes to the extraction of coffee, but also the available surface area obtained from these particles.\n The grind profiles for the four coffees examined here are shown in the middle and lower panels of  Fig. 3. They are presented on a logarithmic scale to accommodate the surface area contribution from the large particles. The surface area is estimated using a spherical approximation for the particles  33, and is shown by the dotted line. Here, the data appears distinctly bimodal because the fine particulates contribute to the majority of the accessible surface area (modes  ii and  v), but large particulates (one/two orders of magnitude larger in diameter,  iii and  vi) are also present. These have an influence even at low concentrations.\n There are minor differences in the grind profiles: The profiles shown in black and purple share similar particle number modes ( i), and have a fine particulate cutoff of 76.4 ± 3.5  μm. The profiles shown in red and blue produced a slightly finer particle distribution with a number mode ( iv) 1.3 ± 0.7  μm) more fine than the black/purple coffees, and a fine particulates cutoff of 69.6 ± 3.1  μm. In summary, the coffees appear to produce a very similar grind distribution irrespective of the variables associated with bean production. Full ANOVA details are presented in  Table S1. It should be noted that all of the beans considered here are roasted relatively ‘light’ compared to typical consumer grade coffee (although on the ‘Agtron Gourmet Scale’, these coffees all are catagorised as light-medium roast). We can only speculate how heavily decomposed beans ( e.g. ‘dark’ or French roast) may deviate from these results; further experimentation is required to elucidate that effect.\n For espresso, the coffee grinds can be thought of as a granular material, where the increase in pressure during tamping jams the materials  34, 35, 36. The variability in particle size plays a significant role in the accessible surface area, but also in the vacuous space in which the water may flow through. From the work of Herman  37, it is apparent that large particles install significant order of neighbouring small particles, which increases local density and therefore can result in inhomogeneous water flow through the espresso puck. However, given the subjectivity of coffee flavour and the preferences of practitioners working in the industry, it is not clear if there is an ideal particle size distribution: We only hope to shed light on the surprising consistencies between coffees.\n Do Differences in the Roasted Bean Grind Temperature Affect the Final Grind? Temperature changes in amorphous materials can lead to well defined glass transitions, where the material changes from rubbery and flexible to being hard and brittle  38. Some solids can also undergo shattering trans\n......", "posttime": "2020-06-04 03:56:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "产地,bean,咖啡", "title": "豆类产地和温度对烘焙咖啡研磨的影响", "title_en": "Effect of bean origin and temperature on grinding roasted coffee", "transed": 1, "url": "https://www.nature.com/articles/srep24483", "via": "", "real_tags": ["产地", "bean", "咖啡"]}, {"category": "", "categoryclass": "", "imagename": "5a9f1a11ac45969ba4c5363d31ca8766.jpg", "infoid": 1005032, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "像大多数美国人一样，我现在离任何暴力都很远。尽管如此，我还是在一系列屏幕上听到和看到了暴力：电视屏幕、智能手机屏幕、电脑屏幕。即使是在像我这样安静的房间里-窗外我可以看到草和树-刺耳的声音也几乎让人无法忍受。这就好像不同的合唱团都在同一时间演唱，而不是和声。\n在盐湖城，警方撞倒了一名拄着拐杖走路的老人。在纽约市，两辆警用SUV撞向人群。另一方面，在休斯顿，警察局长告诉一群多种族的人群，“如果你心里对有色人种怀有仇恨，那就算了吧。”在新泽西州的卡姆登，警察与抗议者一起游行。周日，华盛顿特区的暴徒在白宫对面的拉斐特广场(Lafayette Square)的圣约翰圣公会(St.John‘s Episcopal Church)食堂焚烧了商店，并点燃了一把火。周一，广场上完全和平的示威者遭到催泪弹袭击，这样唐纳德·特朗普(Donald Trump)总统就可以手持圣经在同一座教堂前拍照。\n许多人希望简化这些事件--给它们一个单一、清晰的解释。一些人讲述了一个关于警察暴力的令人痛心的故事。一些人讲述了一个关于警察和社区团结在一起的温馨故事。一些人讲述了一个关于黑人抢劫者的阴险故事。一些人讲述了白人渗透到和平的黑人抗议运动中的模糊故事。几周前，“大西洋月刊”的Ed Yong描述了一种“拼凑的大流行”，这是一种冠状病毒的爆发，正以不同的方式在该国不同的地区展开。现在我们有拼凑而成的抗议，混杂着拼凑而成的骚乱。在每一起事件中，警方和抗议者都有不同的动机，造成不同的影响，以不同的方式影响人们。\n然而，互联网上正积极地涌现着想要将这些完全不同的故事整合到一个单一叙事中的人。昨天，我在推特上转发了一段视频短片，视频中似乎是两名白人女性，她们都穿着黑色衣服，戴着黑色口罩。他们援引黑人生命也是运动的名义，在一个身份不明的城市的一家星巴克的外墙上喷绘了BLM和其他涂鸦。一名黑人抗议者对他们大喊停止。“他们会为此责备黑人，”她说，“而黑人没有这么做。”这段视频不到两分钟长。我在上面写了一句话：“这是一个令人难以置信的复杂故事。”\n许多受访者并不同意。我在说什么来着？这不是一个复杂的故事！因为，很明显，这些妇女是寻求无政府状态的极左“反法”成员。或者，很明显，因为这些妇女是寻求种族战争的极右翼白人至上主义者。或者，很明显，因为这些妇女是诋毁黑人抗议者的更大阴谋的一部分。一位网友写道，“发生的每一件事都是特朗普的人精心策划的，目的是让Covid、失业和蒙面登上头版。”另一个人告诉我，安提法准备这场混乱已经很久了。第三个人在推特上发布了另一个视频剪辑，这段视频显然是南卡罗来纳州一名白人商店老板被黑人暴徒殴打的视频。我认为这是一种反驳：这就是黑人的真实面目。\n对于许多人来说，重点是为他们已经相信的东西找到理由，并加强他们已经拥有的身份。从这个角度来看，骚乱是黑人(或白人)、警察(或抗议者)、右翼(或左翼)的错。情绪如此高涨，以至于正在进行的操纵抗议图像的努力本身就已经是一个行业，涉及到数不清的虚假账户、机器人和挑衅者。#DC Blackout是一个广受欢迎的话题标签，由一个只有三个粉丝的新Twitter账号发起，它错误地声称华盛顿警方实施了通讯封锁。成千上万的人相信它。一个名为Identity Evropa的白人民族主义组织被证明是一个有影响力的病毒式账户@ANTIFA_US的真正所有者。在推特和私人消息群中，它呼吁暴力-成千上万的人也相信这一点。\n虚假故事和虚假叙述的泛滥并不意味着真相不存在，也不意味着美国人永远不会发现真实发生的事情。但这确实意味着，整个故事必须以相当复杂的方式，从不同的角度，由许多人讲述。这需要时间和耐心，以及数百万美国人不再信任的那种新闻工作。至少，最近几天警察对记者的数十次身体攻击提供了最后的证据，证明总统对记者的持续言语攻击已经被包括一些警察在内的许多人吸收和相信。当试图讲述真实故事的人受到怀疑时，或者当他们受到鲁迅的抨击时，虚假故事就更容易被传播出来。\n教堂和圣经也是信息的一部分。特朗普甚至没有假装要去圣约翰教堂祈祷。他没有请求教堂或教区的许可，甚至没有口头上向上帝祈祷；相反，圣公会的神职人员被驱散示威者的催泪瓦斯赶出了该地区。取而代之的是，他在镜头前举起了一本圣经，不是作为一种宗教姿态，而是一种信号。特朗普以一种威权倾向向他的美国人发出了一个信息：我和你一样的身份。我是你们部落的一员。\n但武力并不是对刺耳声音的唯一可能反应。你可以创造和谐，而不是强加沉默。你可以创造一个不同的故事--一个将人们拉到一起的更大的故事。你可以寻求共识；你可以呼吁大家都能达成一致的东西。你可以援引爱国主义、美国、建国文件，或者仅仅是相信事情可以变得更好。\n从历史上看，这是美国最伟大和最受爱戴的领导人一直使用的策略。亚伯拉罕·林肯呼吁我们天性中的“更好的天使”。马丁·路德·金。谈到“所有上帝的孩子”和他们享有宪法保障的自由的权利。亚特兰大市长凯莎·兰斯·博托姆斯(Keisha Lance Bottoms)周日尝试了类似的上诉。她求助于亚特兰大的历史和金的非暴力遗产。“抗议是有目的的，”她说，但暴力没有目的。“当你烧毁这座城市时，”博托姆斯宣称，“你就是在烧毁我们的社区。”用这种由来已久的方式，她鼓励亚特兰大人利用民主制度，让社会变得更美好：“如果你想改变美国，就去登记投票吧！6月9日出现在投票站吧！十一月份就做吧！“。\n现在的问题是，古老的美国口头禅，即对民主和法治传统的呼吁，是否仍然有效-或者它们现在是否已经成为信息战中另一种相互竞争的叙事。当然，总统认为是后者。所有关于社区、对话、诚意讨论的呼吁--这些只是他必须击败的另一组论点。如果特朗普要在11月获胜，他不仅要破坏媒体，不仅要破坏公众的信任，还要破坏对民主本身的信心。\n他必须让美国人相信，任何东西都不会发挥作用，所有的机构都失败了，只剩下暴力了。他必须让所有像我一样坐在家里、被树木和草地包围的人相信，屏幕上的噪音给他们带来了严重的危险，他们需要暴力来关闭屏幕。他还有五个月的时间来提出这一论点。\n我们想听听您对这篇文章的看法。向编辑提交一封信，或写信给letters@theatlantic.com。\n是“大西洋月刊”的特约撰稿人，也是约翰·霍普金斯大学阿格拉研究所的高级研究员。她的新书“民主的暮光之城：威权主义的诱惑力”将于7月出版。", "note_en": "Like most Americans, I am nowhere near any violence right now. Nevertheless, I am hearing and seeing violence on a series of screens: television screens, smartphone screens, computer screens. Even in a room as quiet as mine—outside the window I can see grass and trees—the cacophony is almost unbearable. It’s as if different choruses are all singing at the same time, and not in harmony.\n   In Salt Lake City, police knocked down an elderly man who was walking with a cane. In New York City, two police SUVs drove into a crowd. In Houston, on the other hand, the police chief told a multiracial crowd, “If you’ve got hate in your heart for people of color, get over it.” In Camden, New Jersey, police officers marched together with protesters. On Sunday, rioters in Washington, D.C., burned shops and lit a fire in the refectory of St. John’s Episcopal Church, just across Lafayette Square from the White House. On Monday, completely peaceful demonstrators in the square were teargassed so President Donald Trump could  have himself photographed in front of that same church with a copy of the Bible in hand.\n  Many would like to simplify these events—to give them a single, clear interpretation. Some tell a harrowing story about police violence. Some tell a heartwarming story about police and communities pulling together. Some tell an insidious story about black looters. Some tell a murky story about white infiltration of peaceful black protest movements. A few weeks ago,  The Atlantic’s Ed Yong described a “ patchwork pandemic,” a coronavirus outbreak that is unfolding in different ways in different parts of the country. Now we have patchwork protests, mixed with patchwork riots. In each one of them, the police and the protesters have different motives, create different impacts, affect people in different ways.\n    Nevertheless, the internet is positively thrumming with people who want to fit these disparate stories into a single narrative. Yesterday, I  reposted on Twitter a short video clip of what appears to be two white women, both dressed in black outfits with black face masks. Invoking the Black Lives Matter movement, they were spray-painting BLM and other graffiti on the outside wall of a Starbucks in an unidentified city. A black protester shouted at them to stop. “They are going to blame black people for this,” she said, “and black people didn’t do it.” The clip was less than two minutes long. I wrote one sentence on top: “This is an unbelievably complicated story.”\n  Many respondents did not agree. What was I talking about? This was  not a complicated story! Because, obviously, the women were far-left “antifa” members seeking anarchy. Or because, obviously, the women were far-right white supremacists seeking a race war. Or because, obviously, the women were part of a larger plot to discredit the black protesters. One person wrote that “every single thing that has happened has been planned by Trump’s people to get Covid and unemployment and masks off the front pages.” Another person told me that antifa had been preparing this chaos for a long time. A third tweeted another video clip, this one—apparently—of a white store owner in South Carolina being beaten up by black rioters. I think it was meant to be a kind of counterargument:  Here’s what black people are really like.\n   The point, for many, is to find justifications for what they already believe and reinforcement of the identity that they already have. From this vantage point, the unrest is the fault of black people (or white people), police (or protesters), the right (or the left). Emotions are so high that the ongoing effort to manipulate images coming out of the protests is already an industry in and of itself, involving uncounted fake accounts, bots, and provocateurs. #DCblackout, a wildly popular hashtag started by a  new Twitter account with only three followers, falsely claimed that D.C. police had imposed a communications blackout. Thousands of people believed it. A white-nationalist group called Identity Evropa  turned out to be the true owner of an influential viral account called @ANTIFA_US. On Twitter and in private message groups it called for violence—and thousands of people believed that too.\n The proliferation of false stories and fake narratives doesn’t mean that truth doesn’t exist, or that Americans will never find out what really happened. But it does mean that the full story has to be told in quite a complicated way, from different angles, by many people. That requires time and patience, as well as the sort of journalism that millions of Americans no longer trust. If nothing else, the dozens of physical attacks by police on journalists in recent days offer final proof that the president’s constant verbal attacks on journalists have been absorbed and believed by many, including a number of officers. False stories can be promulgated more easily when the people trying to tell true stories have been discredited—or when they are battered by rubber bullets.\n    In any case, quite a lot of people will not want to hear the truth. Quite a lot of people will want, instead, for everyone to shut up. They will want force, violence, whatever it takes to make the cacophony stop. The behavioral scientist Karen Stenner has written very eloquently about people who have what she calls an authoritarian predisposition, a personality type that is bothered by complexity and is especially enraged by disagreement. Trump has made himself into the spokesperson for precisely these American authoritarians. They were the audience for his decision to use tear gas to clear peaceful protesters from Lafayette Square. It’s for them that he uses the language of “domination,” for them that he calls for the army, for helicopters, for the cities to be treated as a “battle space,” in the astonishing words of America’s secretary of defense.\n  The church and the Bible were part of the message too. Trump did not even pretend that he was going to St. John’s to pray. He did not ask permission of the church or the diocese or even pay lip service to God; on the contrary, Episcopal clergy were  cleared out of the area by the same tear gas that dispersed the protesters. Instead, he held up a Bible for the cameras, not as a religious gesture, but as a signal. Trump was sending a message to his Americans with an authoritarian predisposition:  I share your identity. I am part of your tribe.\n  But force is not the only possible response to cacophony. Instead of imposing silence, you can produce harmony. You can create a different narrative—a larger narrative that pulls people together. You can seek consensus; you can appeal to something that everyone can agree on. You can invoke patriotism, America, the founding documents, or just the belief that things can change for the better.\n Historically, this is the tactic that America’s greatest and most beloved leaders have always used. Abraham Lincoln appealed to the “better angels” of our nature. Martin Luther King Jr. spoke of “all God’s children” and their right to enjoy the freedoms guaranteed in our Constitution. The mayor of Atlanta, Keisha Lance Bottoms, tried a similar kind of appeal on Sunday. She appealed to the history of Atlanta, and to King’s legacy of nonviolence. “A protest has purpose,” she said, but violence has no purpose. “When you burn down this city,” Bottoms declared, “you’re burning down our community.” In this time-honored way, she encouraged Atlantans to make use of democratic institutions in order to make society better: “If you want change in America, go and register to vote! Show up at the polls on June 9! Do it in November!”\n  The question now is whether the old American mantras, the appeals to traditions of democracy and the rule of law, still work—or whether they have now become just another competing narrative in the information war. Certainly the president is assuming the latter. All of the calls for community, dialogue, good-faith discussions—these are just another set of arguments that he has to defeat. If Trump is to win in November, he has to undermine not just the press, and not just public trust, but faith in democracy itself.\n    He has to convince Americans that nothing will function, that all of the institutions have failed, that only violence remains. He has to convince all of the people who are sitting at home as I am, surrounded by trees and grass, that they are in such grave danger from the noise on their screens that they need brute force to shut it off. He has five months left to make that argument.\n    We want to hear what you think about this article.  Submit a letter to the editor or write to letters@theatlantic.com.\n          is a staff writer at  The Atlantic and a senior fellow of the Agora Institute at Johns Hopkins University. Her new book,   Twilight of Democracy: The Seductive Lure of Authoritarianism, is published in July.", "posttime": "2020-06-04 03:55:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "故事,urge,黑人", "title": "克制住简化故事的冲动", "title_en": "Resist the Urge to Simplify the Story", "transed": 1, "url": "https://www.theatlantic.com/ideas/archive/2020/06/trump-tries-scare-people-who-are-far-protests/612568/", "via": "", "real_tags": ["故事", "urge", "黑人"]}, {"category": "", "categoryclass": "", "imagename": "d27494b2dfbd26126bff27d29fee39d8.jpg", "infoid": 1005031, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加密友好、注重隐私的网络浏览器Brave表示，它现在拥有1500万月度活跃用户和530万日活跃用户。\n虽然与谷歌Chrome的数字相去甚远，但这可能是一个迹象，表明网络用户正在更加认真地对待隐私。\n加密友好和关注隐私的网络浏览器Brave昨天宣布，它的月度活跃用户已经达到1500万，日活跃用户达到530万。\n这是自今年11月推出Brave 1.0以来增长了50%，比2019年12月报告的月度用户增加了500万。与一年前相比，日活跃用户数量增加了200万。\nProPrivacy的数字隐私专家雷·沃尔什(Ray Walsh)表示：“消费者正在意识到大技术公司进行的跟踪，并集体转向承诺做得更好的服务。”勇敢者的里程碑证明了“消费者正在用脚投票，”他说，“在未来很长一段时间内，我们将继续看到这一趋势。”\n网络浏览器支持“私人设计”的广告，这些广告以其加密货币--基本注意力令牌(BAT)向观众支付费用。这些代币也可以捐赠给内容创作者。\n这些广告吸引了各大品牌，其中包括Verizon、贝宝(PayPal)、亚马逊(Amazon)和英特尔(Intel)。Brave说，这些活动在183个国家得到了支持，点击率为9%，而行业平均水平为2%。\nBrave的首席政策官约翰尼·瑞安(Johnny Ryan)告诉DECRYPT，用户数量的增加可能是因为流感引发了远程工作的趋势。他说，人们“自然对选择最快的工作方式感兴趣”。“如果碰巧有更好的隐私和安全性，他们的雇主会很乐意(更换)。”\n尽管这款浏览器在去年有了相当大的增长，但Brave的数据仍无法与主要竞争对手相提并论。谷歌的Chrome浏览器开发了与Brave所基于的相同的Chromium技术，拥有更多的用户。根据“极客先驱报”(Geek Herald)的数据，Chrome的Android应用程序去年6月下载量超过50亿次。\n根据NetMarketShare的数据，Chrome保持着68%的市场份额，名单上没有Brave。StatCounter、Wikimedia、W3Counter也显示Chrome是目前为止最占主导地位的浏览器。他们也把Brave排除在计算之外。\nBrave长期以来一直试图破坏谷歌在浏览器和广告市场的霸主地位。\n它已经向当局提出了几项投诉。在2月份写给英国竞争与市场管理局的一封信中，谷歌辩称，谷歌收集了太多关于其用户的数据，并“以令人费解的方式”在其业务和产品之间重新使用。2019年9月，Brave指控谷歌使用隐藏网页向广告商发送个人信息。\n勇敢者肯定会从余波中受益。到目前为止，它的行动还没有引起人们对谷歌的不满。但它的数据显示，慢慢地，它的努力开始见效。\n隐私硬币ZCoin的项目负责人鲁本·雅普(Ruben Yap)表示：“政府和公司之间的斗争已经开始激烈起来，他们希望获得越来越多的我们的数据，以及个人保护自己数据的权利。”勇敢者已经证明了自己是头号竞争者之一。", "note_en": "Crypto-friendly and privacy-focused web browser Brave says it now has 15 million monthly active users and 5.3 million daily active users.\n   While nowhere near Google Chrome numbers, it could be a sign that web users are taking privacy more seriously.\n Crypto-friendly and privacy-focused web browser Brave yesterday announced that it has  hit 15 million monthly active users and 5.3 million daily active users.\n This is an increase of 50% since the launch of Brave 1.0 this November and 5 million more monthly users than it reported in December 2019. The number of daily active users is up 2 million compared to a year ago.\n “Consumers are waking up to the tracking performed by Big Tech and moving en masse to services that promise to do better,” said Ray Walsh, a digital privacy expert at    ProPrivacy . Brave’s milestone is proof that “Consumers are voting with their feet,” he said, “a trend that we will continue to see long into the future.”\n   The web browser supports “private by design” advertisements that pay viewers in its  cryptocurrency, the Basic Attention Token ( BAT). These tokens can also be donated to content creators.\n The advertisements have attracted major brands, among them Verizon, PayPal, Amazon and Intel. The campaigns are supported in 183 countries and have a click-through-rate of 9 percent, compared to the industry average of 2 percent, said Brave.\n Brave’s Chief Policy Officer, Johnny Ryan, told   Decrypt  that the uptick in users could be because of the trend toward remote-work that has been sparked by the pandemic. People are “naturally interested in choosing the fastest way to work,” he said. “If that happens to come with better privacy and security, their employer will be happy to [switch].”\n  And though the browser has seen considerable growth in the last year, Brave&#39;s numbers still don&#39;t yet stack up to major competitors.  Google’s Chrome browser, which developed the same Chromium technology that Brave is based upon, has far more users. Chrome’s Android app surpassed 5  billion  downloads last June,  according  to   The Geek Herald.\n Chrome maintains 68% of the market share, according to   NetMarketShare , which does not feature Brave on its list.   StatCounter, Wikimedia, W3Counter  also  show  that  Chrome is by far the most dominant browser. They, too, have left Brave out of calculations.\n Brave has long sought to destabilize Google’s hegemonic share over the browser and advertising market.\n It has lodged several complaints with authorities. In a letter to the UK Competition &amp; Markets Authority in February, it argued that Google collects too much data about its users and repurposes “between its businesses and products in bewildering ways.” In September 2019, Brave alleged that Google uses hidden web pages to send personal information to advertisers.\n Brave would surely benefit from the fallout. So far its actions have not caused heads to roll at Google. But its numbers show that, slowly, its efforts are beginning to pay off.\n “The battle is already starting to rage between governments and companies seeking more and more of our data and the rights of an individual to protect their own data,” said Reuben Yap, Project Lead of ZCoin, a privacy coin. Brave has proven itself to be one of the top contenders.", "posttime": "2020-06-04 03:55:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "增长,growth,brave", "title": "勇敢者的增长标志着人们对网络隐私的担忧与日俱增", "title_en": "Brave’s growth signals rising concerns over privacy online", "transed": 1, "url": "https://decrypt.co/31028/brave-growth-users-privacy-online", "via": "", "real_tags": ["增长", "growth", "brave"]}, {"category": "", "categoryclass": "", "imagename": "81c3af1c65eec27bfac65ceb1cd3c596.jpg", "infoid": 1005030, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于那些希望Zoom能为用户隐私做更多事情的人来说，它的游戏已经结束了：该公司首席执行官明确表示，为什么它不会向免费(即无证)用户提供加密通话服务，原因是执法部门。\n袁说，免费用户不会享受到这种级别的隐私，这使得第三方无法解密通信。\n袁在电话中说：“免费用户我们当然不想给，因为我们也希望与FBI合作，与当地执法部门合作，以防一些人将Zoom用于不良目的。”\nGoogle Duo和Apple Facetime已经加密，这些公司并不是国家的敌人。Zoom的立场不仅是合作的，而且是合作的：假设他们已经在与执法部门合作，让对Zoom的一般监控变得尽可能简单和简单。", "note_en": "It&#39;s game over for those holding out hope Zoom would do more for user privacy: the company&#39;s CEO  explicitly cited law enforcement as why it will not offer encrypted calling to free (i.e. undocumented) users.\n  Yuan said free users won’t enjoy that level of privacy, which makes it impossible for third parties to decipher communications.\n “Free users for sure we don’t want to give that because we also want to work together with FBI, with local law enforcement in case some people use Zoom for a bad purpose,” Yuan said on the call.\n Google Duo and Apple Facetime are already encrypted, and these companies are no enemies of the state. Zoom&#39;s position is not just cooperative but collaborative: assume they are already working with law enforcement to make general surveillance of Zoom as simple and pushbutton as possible.", "posttime": "2020-06-04 03:54:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,首席,ceo,zoom", "title": "Zoom首席执行官表示不会加密免费电话", "title_en": "Zoom CEO says it won't encrypt free calls", "transed": 1, "url": "https://boingboing.net/2020/06/03/zoom-ceo-says-it-wont-encryp.html", "via": "", "real_tags": ["免费", "首席", "ceo", "zoom"]}, {"category": "", "categoryclass": "", "imagename": "88f8d91b7c02dff27adb58669986709a.jpg", "infoid": 1005028, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一门典型的大学哲学史课程将西方文明的伟大思想家作为一个庄严的过程来考察，从柏拉图到亚里士多德，再到笛卡尔，再到康德，再到黑格尔，再到尼采。这些伟大的知识分子以沉重的哲学大部头提出他们的观点，其中充斥着刻板的定义、合理的论点和持续的批评。反过来，教师向新一代学生展示宏伟的思想叙事。\n伊曼纽尔·康德就是这种权威方法的典型代表。在他的“纯粹理性批判”(1781年)的最后几页中，这位德国哲学家叙述了西方哲学的历史，从柏拉图到亚里士多德，再到洛克，再到莱布尼茨自己，作为一系列构建体系的尝试。事实上，如果他不是一位一丝不苟的思想设计师，那他就什么都不是：\n我所说的建筑学是指系统的艺术。因为系统的统一性首先是把普遍认识转化为科学的。\n也就是说，科学把仅仅是随机思想的集合变成了连贯的东西。只有这样，哲学才能成为判断什么是知识，什么不是知识的教条或方法。没有系统，就没有真正的哲学。\n但是，天地间会不会有比康德哲学所梦想的更多的东西呢？当我们不是从系统建设的角度来考虑哲学史，而是通过一种关注思维碎片的另一种说法来考虑时，会发生什么？\n想想赫拉克利特“大自然喜欢躲藏”；布莱斯·帕斯卡(Blaise Pascal)的“这些无限空间的永恒寂静让我害怕”；或者弗里德里希·尼采(Friedrich Nietzsche)的“如果要建造神庙，就必须摧毁神庙。”赫拉克利特出现在柏拉图和亚里士多德之前，帕斯卡在笛卡尔之后，尼采在康德和黑格尔之后。思想史是否真的是由警句驱动的呢？\n西方哲学史的大部分可以描述为一系列构建体系的尝试。相反，警句的大部分历史可以被描述为一种批判，通过构建文学碎片来背离这样的宏大体系。哲学家创造和批判连续的论据线，而警句家则组成零散的直觉线。一个按逻辑链移动，另一个则突飞猛进。\n在西方哲学本身诞生之前，就有格言。在古希腊，阿纳克西曼德、色诺芬尼、巴门尼德或赫拉克利特的短句构成了思辨思维的第一次尝试，但它们也是柏拉图和亚里士多德敌视的东西。他们神秘莫测的声明很难进行详尽的分析。他们拒绝被整顿成系统的秩序。没有人会否认他们精辟的陈述可能是明智的，但柏拉图和亚里士多德对此持矛盾态度。它们一点也不严谨--它们只是聪明人的零散言论。\n如果你问他们中的任何一个人一个问题，他会从他的箭袋里拿出一些小谜语向你射击；如果你试图让他解释他所说的话，你只会被另一个充满奇怪语言变化的人击中。\n对于柏拉图来说，赫拉克利特学派不断回避的策略是一个问题，因为他们不断地产生新的格言，以颠覆封闭。在这个意义上，赫拉克利特至少在两个基本方面反对柏拉图：第一，他的流动学说与形式论背道而驰；第二，人们得到的印象是，他的思想是孤独的、独白的、厌世的，而柏拉图总是社会性的、对话性的、诱惑性的。\n柏拉图对其前辈格言风格的否定标志着古代哲学发展的一个重要阶段：从雄辩的表述过渡到论证的话语，从晦涩到清晰，从而使格言风格被边缘化，转而支持持续的逻辑论证。从苏格拉底开始，没有证据或论证就不会有哲学。\n然而，我认为保护赫拉克利特不受柏拉图攻击是可能的。谜语引起的困惑并不一定会使人陷入思考的境地。相反，它可以催化富有成效的探究。以这句广为人知的谚语为例：\n这些话引起了很多评论。什么是“自然”？什么是“隐藏”？什么是“爱”？法国哲学家皮埃尔·哈多(Pierre Hadot)在“伊希斯的面纱”(The Veil of Isis，2004)一书中提出，至少有五种解释：很难知道某件事的真正意义；它的意义想要被隐藏；自然就是起源，很难追溯；死亡跟在出生之后；最后，外表具有欺骗性。赫拉克利特本人的本性--以及一般语言的本性--都喜欢隐藏起来。因此，我们可以得出两个推论：“格言太爱藏不住了”和“诠释爱阐释”。\n赫拉克利特微型体的本质对于格言来说是普遍成立的。格言既抵制又吸引更充分的表达，因此解释学--文本和读者之间的一条通道--被要求向每一位读者提出要求。碎片对辩证哲学既是对立面的，又是现实主义的：对立面是因为它们太神秘了；而现实主义是因为它们不能不促使我们去思考事物的起源和本质。\n好的格言需要解释。在他们的解释中，邀请读者从事他们自己的哲学事业--自己做哲学。因此，格言同时出现在哲学之前、反对哲学和哲学之后。\n17世纪，笛卡尔开创了现代哲学的先河，为清晰的思维提供了规则和方向。然而，几十年后，帕斯卡提出了一个强有力的纠正措施。他打赌，也许订单被高估了。大家都说，帕斯卡是他那个时代的天才。年轻时，他在几何和代数方面做出了里程碑式的贡献。由于健康不佳，他在快30岁的时候皈依了宗教，在短暂生命的最后10年里，他徒劳地试图为基督教辩护，目的是“为宗教道歉”，死后出版的“佩内斯集”(The Pensées，1670)。\n帕斯卡毕生的任务变成了一项无休止地将文字精简到本质的练习，目的是探索一种纯粹的虚无，并将我们带到它的边缘。对他来说，所有有限的东西都是碎片，因为它们只不过是从无限中撕下的碎片。尽管如此，有限的本质是这样的，即使是大量的碎片也不可能接近完整，“一个单位加到无穷大根本不会增加无穷大，就像一英尺加到无限长上一样”。帕斯卡尔式的秩序缺失是对人类智力未能理解这种无限的承认。因此，佩内斯家族在碎片的诗学中运作。\n当帕斯卡在1662年去世时，有800多张纸条处于不同阶段的混乱状态。这些片断在很大程度上是他拒绝笛卡尔对秩序和清晰度的坚持的直接结果。“心有其理，而理不知道”就是一个明显的例子。帕斯卡的主要批评是笛卡尔将哲学简化为一个过于理性的体系。对帕斯卡来说，“我想，所以我在”这一命题建立在摇摇欲坠的基础上，因为笛卡尔认为是一切推理基础的这个自我只是一个贫乏的东西。这是帕斯卡对人类状况的看法：\n什么怪物，什么乱七八糟的…。弱小的蚯蚓；真理的仓库，不确定性和错误的阴沟；宇宙的荣耀和垃圾！\n然后，组成佩内斯的光荣堆积如山可能会被认为是对笛卡尔理性对自身至高无上的自信的一种不朽的拒绝。\n警句与哲学的辩证法在19世纪的德国达到顶峰。在康德之后，从弗里德里希·施莱格尔(Friedrich Schlegel)、亚瑟·叔本华(Arthur Schopenhauer)、索伦·克尔凯郭尔(Søren Kierkegaard)到尼采(Nietzsche)等不同的思想家都使用缩微形式努力解决如何在系统之后进行哲学研究。浪漫主义者喜欢废墟，喜欢未完成的影子。想想卡斯帕·大卫·弗里德里希(Caspar David Friedrich)的风景画，弗朗茨·舒伯特(Franz Schubert)的未完成交响曲，或者对古典古董的痴迷。这种对碎片的崇拜是对康德坚持不懈的制度建设的回应。面对如何充分表现先验知识的统一性，浪漫主义者坚持认为，这样做的唯一可能的方式是部分地。因此，警句思维：系统思维：：微观：宏观。\n在短短三年(1798年至1800年)发表的一系列令人眼花缭乱的文章、评论、对话和宣言中，德国期刊“雅典报”(Das Athenaeum)将浪漫主义确立为一种统一的审美反应，是理想主义的一种可行的哲学选择。一方面，正如雅典的一段片段所说，“所有的个体都是系统，至少在胚胎和倾向上是这样。”另一方面，“对话是一串碎片的链条或花环”。因此，“对头脑来说，有系统和没有系统是同样致命的。”它将不得不简单地决定将这两者结合起来。\n尼采是这种浪漫主义思想的晚期后裔。在“偶像的暮光”(1889)中，他宣称：\n我不信任所有的系统化论者，并避免他们。对系统的意愿是缺乏完整性…。这句格言，也就是格言，我是德国人中的第一位大师，是“永恒”的形式；我的抱负是用10句话说出其他人在书中说过的话--说出其他人在书中没有说过的话。\n尼采的一生始于一个古典主义者，他收集早期希腊哲学家的片段。他的学识是如此令人敬畏，以至于在1869年，24岁的他在巴塞尔大学获得了希腊文献学的全职教授职位。\n当他在19世纪70年代末放弃古典主义者的职业时，他关于碎片的文献学变成了碎片哲学。他不仅研究警句，还开始制作警句。在他一生中最丰富的时期，从“人，都是人”(1878年)到“ECCHomo”(1888年)，他撰写了数以千计的精辟格言和格言。零散的形式成了他余生的首选风格。Zarathustra(1883-85年)中的先知用神秘的dihyramb说话，这让人想起古代的智慧文学。\n尼采的格言形式成为他训练读者的方式，使他们不再认同一种教义或特定的尼采人生观，而是创造和加工他们自己的生活哲学。他写道，“在像我这样的警句书中，短句警句之间和背后有很多被禁止的、长篇大论的东西和思想链条。”这意味着尼采不会用勺子喂他的读者。他的方法就像赫拉克利特的方法-激烈、困难、令人失望的格言和箭头击中读者的心脏，抓住或动摇了他们的思维习惯。他们被要求做很多工作，调查他尖刻的言辞“之间和背后”是什么。这里有一个这样精辟的见解：\n我们已经超越了我们所说的一切；在所有的谈话中都隐藏着一丝蔑视…。演讲者已经通过讲话使自己变得粗俗了。\n尼采在这里强迫我们思考内心思想、言语和写作之间微妙的连续性。思想的产生-从我们头脑中的想法到书面表达的想法-从来都不是无缝的；总是存在着传递的保真度问题。任何语言都无法捕捉到我们内心深处的想法：真正的格言是无法用语言表达的。在施莱格尔优雅的表述中：\n碎片应该像一件小小的艺术品一样与周围的世界完全隔离，像刺猬一样完整。\n当施莱格尔把一句格言比作刺猬(伊恩·伊格尔)时，西方思想中最著名的刺猬来自以赛亚·柏林后来流行的一段阿基洛克斯的片段，这并不是偶然的：\n尽管格言从定义上来说是简洁的，但它几乎总是扩散成无数次迭代。从本质上讲，格言-就像刺猬一样-是一种孤独的动物。努力剔除所有的废话，它并不是那么秘密的愿望是消灭它的邻居，这样它的独特的力量将占据至高无上的地位。\n然而，警句也有一种从众心理。从苏美尔人和埃及人的智慧文学开始，他们在选集的社会集体中找到了力量。正如施莱格尔所说，每句格言都很可能是“本身完整的”，但它也形成了网络中的一个节点，通常是一个寿命很长的跨国节点，能够持续扩展。最好的现代格言家从来不只写一句格言，而是几乎总是写了很多格言：弗朗索瓦·德拉罗什福科(François de La Rochefoucauld)、约翰·沃尔夫冈·冯·歌德(Johann Wolfgang Von Goethe)、乔治·克里斯托夫·利希滕贝格(Georg Christoph Lichtenberg)、帕斯卡(Pascal)和尼采(Nietzsche)自己都有笔记本，笔记本上写满了这些格言，但往往。\n因此，虽然一句格言可能是一只霸道的刺猬，但一组格言变成了一大群狡猾的小狐狸。\n从词源上看，‘警句’是由希腊语中的‘from，away from’+Horein‘to bound’组成的。“韦氏词典”将地平线定义为：\na：地球和天空的明显交界处；b：天球上的大圆，由天球与在观察者位置处与地球表面相切的平面相交而形成。\n它永远不可能到达地平线；它正在无限地后退，既有内在的，也有迫在眉睫的。永远超越，就像一条没有起点和终点的线，切开看得见的和看不见的。\n格言是明确的声明，设定界限，确立属性。然而，任何好的定义都意识到它自己的限制，知道什么是内部的，什么是外部的。毕竟，定义任何东西就是界定它。地球的曲率，就像思维的形状一样，意味着我们的视野总是有限的。一句格言，从这个意义上说，是我们有限的标志，永远在向后退的地平线靠近。超越语言的地平线，思维不能走得更远。\n在非常困难的时候，我们可能没有集中注意力阅读沉重的大部头的力量-甚至连伟大的碎片哲学家克尔凯郭尔的巨著(1843年)都没有，普林斯顿大学出版社翻译的两卷共计1200页也是如此。(1843)克尔凯郭尔是一位伟大的碎片哲学家，他的巨著在普林斯顿大学出版社的翻译中长达两卷，共计1200页。黑格尔的“精神现象学”(1807)有600页；柏拉图的“理想国”有500页；康德的三篇评论(1781；1788；1790)加起来大约有2400页。米歇尔·福柯还著有“疯狂与文明”(1961)、“诊所的诞生”(1963)、“纪律与惩罚”(1975)、“事物的秩序”(1966)和“知识考古”(1969)等著作。在生命接近尾声时，福柯思考了古代一种更为温和的写作体裁，称为“hupomnemata”，即斯多葛学派、伊壁鸠鲁派、耶稣的格言。在1983年的“自我写作”(Self Writing)中，福柯说：\n在这一时期有一种可以被称为“个人写作”的文化：把人们听到的、有的或做的阅读、对话和反思记下来；在重要的主题上记下这样或那样的笔记本(希腊人称之为hupomnemata)，这些笔记本必须不时地重读，以便重新认识其中包含的…。\n我们不属于那些只有在书本中才有想法的人，当我们被书本激发的时候。我们习惯于在户外思考--散步、跳跃、攀登、跳舞，最好是在孤零零的山上或靠近大海的地方，那里的小径也会变得很有想象力。\n在新冠肺炎封锁的这些日子里，我们中的许多人都呆在家里。这不就是一句构思精良的格言吗？柔和而柔和的格言，不正是行走、跳跃、攀登和跳舞的格言吗？也许通过阅读更多的格言，并撰写一些我们自己的格言，我们可以提高我们在这个黑暗时代的生活艺术。毕竟，有谁能在户外真正读到黑格尔的作品呢？\n许仕仁的《格言理论(2019年)》由普林斯顿大学出版社出版。", "note_en": "A typical university course in the history of philosophy surveys the great thinkers of Western civilisation as a stately procession from Plato to Aristotle to Descartes to Kant to Hegel to Nietzsche. These magnificent intellects offer their ideas in weighty philosophical tomes, stuffed with chiselled definitions, well-reasoned arguments and sustained critiques. In turn, instructors present the grand narrative of ideas to a new generation of students.\n Immanuel Kant typifies this magisterial approach. In the closing pages of his  Critique of Pure Reason (1781), the German philosopher narrates the history of Western philosophy from Plato to Aristotle to Locke to Leibniz to himself as a series of attempts to construct systems. Indeed, he is nothing if not a scrupulous architect of thought:\n By an  architectonic I mean the art of systems. Since systematic unity is what first turns common cognition into science.\n That is, science turns what is a mere aggregate of random thoughts into something coherent. Only then can philosophy become a doctrine or method of judgment of what is knowledge and what is not. No systems, no real philosophy.\n But might there be more things in heaven and earth than are dreamt of in Kant’s philosophy? What happens when we consider the history of philosophy not from the point of system-building, but through an alternative account that pays attention to the fragments of thinking?\n Consider Heraclitus’ ‘Nature loves to hide’; Blaise Pascal’s ‘The eternal silence of these infinite spaces terrifies me’; or Friedrich Nietzsche’s ‘If a temple is to be erected, a temple must be destroyed.’ Heraclitus comes before and against Plato and Aristotle, Pascal after and against René Descartes, Nietzsche after and against Kant and G W F Hegel. Might the history of thought be actually driven by aphorism?\n Much of the history of Western philosophy can be narrated as a series of attempts to construct systems. Conversely, much of the history of aphorisms can be narrated as an animadversion, a turning away from such grand systems through the construction of literary fragments. The philosopher creates and critiques continuous lines of argument; the aphorist, on the other hand, composes scattered lines of intuition. One moves in a chain of logic; the other by leaps and bounds.\n Before the birth of Western philosophy proper, there was the aphorism. In ancient Greece, the short sayings of Anaximander, Xenophanes, Parmenides or Heraclitus constitute the first efforts at speculative thinking, but they are also something to which Plato and Aristotle are hostile. Their enigmatic pronouncements elude discursive analysis. They refuse to be corralled into systematic order. No one would deny that their pithy statements might be wise; but Plato and Aristotle were ambivalent about them. They have no rigour at all – they are just the scattered utterances of clever men.\n  If you ask any one of them a question, he will pull out some little enigmatic phrase from his quiver and shoot it off at you; and if you try to make him give an account of what he has said, you will only get hit by another, full of strange turns of language.\n For Plato, the Heracliteans’ stratagem of continual evasion is a problem because they constantly produce new aphorisms in order to subvert closure. In this sense, Heraclitus is opposed to Plato in at least two fundamental ways: first, his doctrine of flux is contrary to the theory of Forms; and second, the impression one gets is that his thinking is solitary, monologic, misanthropic, whereas Plato is always social, dialogic, inviting.\n Plato’s repudiation of his predecessor’s gnomic style signals an important stage in the development of ancient philosophy: the transition from oracular enunciation to argumentative discourse, obscurity to clarity, and thus the marginalisation of the aphoristic style in favour of sustained logical arguments. From Socrates onward, there would simply be no philosophy without proof or argument.\n Yet I think it is possible to defend Heraclitus against Plato’s attack. Perplexity arising from enigmatic sayings need not necessarily lead one to seizures of thinking. On the contrary, it can catalyse productive inquiry. Take this well-known saying:\n  These words have invited much commentary. What is ‘nature’? What is ‘hiding’? What is ‘love’? The French philosopher Pierre Hadot in  The  Veil of Isis (2004)  suggests that there are at least five interpretations: the true meaning of something is hard to know; its meaning  wants to be hidden; nature is origins, and it is hard to retrace; death follows birth; and, finally, appearances deceive. The nature of Heraclitus himself – and the nature of language in general – loves to hide. As such, we can claim two corollaries: ‘Aphorisms too love to hide,’ and ‘Interpretation loves to illuminate.’\n The nature of Heraclitus’ microform is true for the aphorism in general. The aphorism both resists and invites fuller articulations, and so hermeneutics – a conduit between the text and the reader – is demanded from every reader. Fragments are both  antithetical and  propaedeutic to argumentative philosophy: antithetical because they are too enigmatic; and propaedeutic because they cannot but prompt us to think about the origins and nature of things.\n Good aphorisms demand to be interpreted. And in their interpretation is an invitation for the readers to engage in their own philosophical enterprise – to do philosophy themselves. Aphorisms, then, are at once before, against and after philosophy.\n  In the 17th century, Descartes inaugurated modern philosophy by offering rules and directions for clear thinking. Yet a few decades later, Pascal offered a powerful corrective. Perhaps, he wagered, order is overrated. By all accounts, Pascal was a genius of his time. At a young age, he made landmark contributions to geometry and algebra. Plagued by ill health, he had a religious conversion in his late 20s, and spent the last 10 years of his short life in vain attempts to construct a justification of Christianity intended as an ‘Apology for Religion’, published posthumously as the  Pensées (1670).\n Pascal’s lifelong task became an exercise of endlessly reducing words to their essence, in order to probe a pure nothingness and bring us to its edge. For him, all finite things are fragments, for they are nothing but pieces torn from infinity. All the same, the nature of finitude is such that not even a vast quantity of fragments could ever approach wholeness, ‘a unit added to infinity does not increase infinity at all, any more than a foot added to an infinite length’. The Pascalian lack of order is an acknowledgment of the failure of the human intellect to understand such infinity. As such, the  Pensées operate within a poetics of the fragment.\n When Pascal died in 1662, there were more than 800 slips of paper in various stages of disorder. These fragments are, in a large part, a direct consequence of his rejection of the Cartesian insistence on order and clarity. The saying ‘The heart has its reasons of which reason does not know’ is one clear case. Pascal’s principal criticism is that Descartes reduces philosophy to an all-too-rational system. For Pascal, the proposition ‘I think, therefore I am’ rests on shaky grounds, for this self that Descartes posits to be the foundation of all reasoning is but an impoverished thing. This is Pascal’s view of the human condition:\n What a monster, what chaos … weak earthworm; repository of truth, and sewer of uncertainty and error; the glory and garbage of the universe!\n The glorious heap that makes up the  Pensées might then be conceived of as a monumental rejection to Cartesian reason’s supreme confidence in itself.\n The dialectic between aphorisms and philosophy reaches its apex in 19th-century Germany. After Kant, thinkers as varied as Friedrich Schlegel, Arthur Schopenhauer, Søren Kierkegaard and Nietzsche all used the microform to grapple with how to do philosophy after systems. The Romantics loved ruins, the unfinished, shadows. Think of Caspar David Friedrich’s landscapes, Franz Schubert’s Unfinished Symphony, or the obsession with classical antiquity. This cult of the fragment is a response to Kant’s relentless system-building. Confronted with how to adequately represent the unity of transcendental knowledge, the Romantics insist that the only possible way of doing so is in parts. Thus,  aphoristic thinking : systematic thinking :: the micro : the macro.\n In a series of dazzling essays, reviews, dialogues and manifestos published over just three years – 1798 to 1800 – the German journal  Das  Athenaeum established Romanticism as a unified aesthetic reaction and a viable philosophical alternative to idealism. On one hand, as an  Athenaeum fragment holds, ‘all individuals are systems, at least in embryo and tendency’. On the other, ‘a dialogue is a chain or garland of fragments’. Hence, ‘it’s equally fatal for the mind to have a system and to have none. It will simply have to decide to combine the two.’\n Nietzsche is a late descendant of this Romantic strain of thought. In  Twilight of the Idols (1889), he declares:\n I mistrust all systematisers and avoid them. The will to a system is a lack of integrity … The aphorism, the apothegm, in which I am the first master among Germans, are the forms of ‘eternity’; my ambition is to say in 10 sentences what everyone else says in a book – what everyone else does  not say in a book.\n Nietzsche’s life began as a classicist collecting the fragments of early Greek philosophers. So formidable was his erudition that, in 1869, it earned him a full professorship of Greek philology at the University of Basel at the age of 24.\n  His philology on fragments became a philosophy  of fragments when he abandoned his profession as a classicist in the late 1870s. Rather than just studying aphorisms, he started producing them. In the most fertile stretch of his life, from  Human, All Too Human (1878) to  Ecce Homo (1888), he composed thousands upon thousands of pithy sayings and maxims. The fragmentary form became the preferred style for the rest of his life. The prophet in  Thus Spoke Zarathustra (1883-85) speaks in enigmatic dithyrambs reminiscent of the wisdom literature of antiquity.\n  Nietzsche’s aphoristic form becomes his way of training his readers not to subscribe to a doctrine or a particular Nietzschean view of life, but rather to create and craft their own philosophy of life. He writes that ‘in books of aphorisms like mine there are plenty of forbidden, long things and chains of thoughts between and behind short aphorisms’. What this means is that Nietzsche will not spoon-feed his readers. His method is like Heraclitus’ – intense, difficult, aporetic maxims and arrows that strike at the heart of readers, seizing or destabilising their habits of thought. They are required to do much work, to investigate what is ‘between and behind’ his sharp words. Here is one such piercing insight:\n We have already grown beyond whatever we have words for; in all talking there lies a grain of contempt … The speaker has already vulgarised himself by speaking.\n Nietzsche here forces us to think about the tenuous continuity between inner thoughts, speech and writing. The production of thought – the movement from ideas in our minds to ideas expressed in writing – is never seamless; there is always a fidelity problem of transmission. Our inmost thoughts cannot be captured in any language: the true aphorism is beyond words. In Schlegel’s elegant formulation:\n A fragment ought to be entirely isolated from the surrounding world like a little work of art and complete in itself like a hedgehog.\n It is no accident that, when Schlegel compares an aphorism to a hedgehog ( ein Igel), the most famous hedgehog in Western thought comes from a fragment of Archilochus that  Isaiah Berlin later popularised:\n  Though an aphorism by definition is succinct, it almost always proliferates into an innumerable series of iterations. By nature, the aphorism – like the hedgehog – is a solitary animal. Striving to cut out all verbiage, its not-so-secret wish is to annihilate its neighbour so that its singular potency would reign supreme.\n Yet aphorisms also have a herd mentality. From the wisdom literature of the Sumerians and Egyptians onward, they find strength in the social collective of anthologies. Each aphorism might very well be ‘complete in itself’, as Schlegel claims, but it also forms a node in a network, often a transnational one with great longevity, capable of continuous expansion. And the best modern aphorists never wrote just one aphorism, but almost always a great many: François de La Rochefoucauld, Johann Wolfgang von Goethe, Georg Christoph Lichtenberg, Pascal and Nietzsche himself had notebooks upon notebooks filled with them, and often had trouble finishing them.\n So while a  single aphorism might be a hegemonic hedgehog, a  collection of aphorisms morphs into a multitude of cunning little foxes.\n Etymologically, ‘aphorism’ is composed of the Greek  apo- ‘from, away from’ +  horizein ‘to bound’. A horizon is defined by Merriam-Webster’s dictionary as:\n a: the apparent junction of Earth and sky;   b: the great circle on the celestial sphere formed by the intersection of the celestial sphere with a plane tangent to the Earth’s surface at an observer’s position.\n It is impossible to ever arrive at the horizon; it is infinitely receding, both immanent and imminent. Ever transcendent, as a line it is without beginning or end, cutting the visible and invisible.\n  An aphorism makes a definitive statement, sets boundaries, establishes property. Yet any good definition is aware of its own limits, what is within and without. To  define anything, after all, is to  delimit it. The curvature of the globe, like the shape of thinking, means that there is always a limit to our field of vision. An aphorism, in this sense, is a mark of our finitude, ever approaching the receding horizon. Beyond the horizon of language, thinking can go no further.\n In times of great difficulty, we might not have the powers of concentration to read weighty tomes – even  Either/Or (1843), the magnum opus of Kierkegaard, that great philosopher of fragments, runs to  two  volumes totalling 1,200 pages in the Princeton University Press translation. Hegel’s  The  Phenomenology of the Spirit (1807) is 600 pages; Plato’s  Republic is 500; Kant’s three  Critiques (1781; 1788; 1790) add up to some 2,400. Michel Foucault also wrote big books –  Madness and Civilization (1961) , The Birth of the Clinic (1963),  Discipline and Punish (1975) , The Order of Things (1966) and  The Archaeology of Knowledge (1969), among others. Toward the end of this life, Foucault reflected on a more modest genre of writing in antiquity called ‘hupomnemata’, the sayings of the Stoics, the Epicureans, Jesus. In ‘Self Writing’ (1983), Foucault said:\n In this period there was a culture of what could be called ‘personal writing’: taking notes on the readings, conversations, and reflections that one hears or has or does; keeping notebooks of one sort or another on important subjects (what the Greeks call  hupomnemata), which must be reread from time to time so as to reactualise what they contain …\n   We do not belong to those who have ideas only among books, when stimulated by books. It is our habit to think outdoors – walking, leaping, climbing, dancing, preferably on lonely mountains or near the sea where even the trails become thoughtful.\n In these days of COVID-19 lockdowns, many of us are housebound. Is not a well-wrought aphorism, supple and limber, precisely that which walks, leaps, climbs, and dances? Perhaps by reading more aphorisms, and composing some of our own, we can improve our art of living in these dark times. After all, who can really read Hegel outdoors anyway?\n A Theory of the Aphorism  (2019) by Andrew Hui is published by Princeton University Press.", "posttime": "2020-06-04 03:38:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "赞颂,praise,格言", "title": "赞颂警句", "title_en": "In Praise of Aphorisms", "transed": 1, "url": "https://aeon.co/essays/aphorisms-tell-philosophys-history-as-fragments-not-systems", "via": "", "real_tags": ["赞颂", "praise", "格言"]}, {"category": "", "categoryclass": "", "imagename": "5f1df3ea2fef684c9d0332158db166a7.jpg", "infoid": 1005027, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周三，六家蓝十字和蓝盾保险公司起诉CVS Health，声称药房对他们的仿制药收取了过高的费用。原告-其中包括阿拉巴马州、佛罗里达州、明尼苏达州、北卡罗来纳州、北达科他州和堪萨斯城的Blues计划-表示，CVS向他们收取的仿制药价格高于客户用现金支付的价格。\n药店应该向保险公司收取仿制药的“通常和惯例”价格，在之前针对凯马特的诉讼中，这一价格被确定为客户支付的标准现金价格。蓝军计划将支付他们的药房福利经理协商的药品价格，除非通常的价格低于谈判的价格。\n原告声称，CVS向参与其现金折扣计划的客户提供了低得多的价格，从而歪曲了这些药物的惯常价格。该公司于2008年开始提供健康储蓄通行证计划，后来过渡到价值处方储蓄卡计划。\n通过支付15美元的会员费，以现金支付的客户将以12美元的价格获得400多种仿制药，为期3个月。根据起诉书，CVS经常向没有参加这些计划的客户提供相同的现金价格。\n原告说，Blues计划为这些相同的药物收取的价格“明显高于”客户支付的现金价格。例如，多个Blues计划报告称，纳多洛尔支付了过高的价格，纳多洛尔是一种治疗高血压的仿制药。法庭文件显示，北卡罗来纳州的BCBS报告为该药物支付了257美元，而储蓄计划中的现金支付客户支付了12美元。\n起诉书称：“第三方付款人随后根据那些更高、更高的价格来偿还CVS-而不是CVS向普通公众提供的实际、更低的价格，包括通过其现金折扣计划。”\n蓝军的计划说，这不仅导致他们为处方药索赔支付过高的费用，而且还阻止了他们为其成员获得更优惠的药品价格。\n在一份电子邮件声明中，CVS Health否认了这些指控，称它们“完全没有根据”。\n“CVS药房健康储蓄通行证是一项会员计划，旨在为没有保险或选择不使用保险的客户服务。Value处方药储蓄卡计划是一种处方药储蓄卡，由第三方提供和管理，“该公司表示。通过这些计划获得的仿制药价格既不是CVS制药公司通常收取的价格，也不是普通公众可以获得的价格。这两个节目都不是隐蔽的，也不是欺骗性的。“。\n原告正在寻求禁令救济、损害赔偿和两倍于他们被多收费用的赔偿。\n其他药店连锁店最近也面临着类似的诉讼。2018年，Rite Aid因涉嫌向保险公司收取的费用高于其现金会员计划向客户收取的费用而受到集体诉讼的打击。同年，沃尔格林因类似指控面临集体诉讼。", "note_en": "Six Blue Cross and Blue Shield insurers sued CVS Health on Wednesday, claiming the pharmacy overcharged them for generic drugs. The plaintiffs — which include Blues plans in Alabama, Florida, Minnesota, North Carolina, North Dakota and Kansas City — said CVS charged them a higher price for generic prescriptions than customers paid in cash.\n Pharmacies are supposed to charge insurers the “usual and customary” price for generic medications,  determined in a previous lawsuit against Kmart to be the standard cash price paid by customers. The Blues plans would pay the price negotiated by their pharmacy benefit managers for drugs, unless the usual and customary price is lower than that negotiated rate.\n   The plaintiffs alleged that CVS misrepresented the usual and customary rate for these drugs by offering a much lower price to customers that participated in its cash discount programs. The company began offering its Health Savings Pass program in 2008, which was later transitioned to its Value Prescription Savings Card program.\n By paying a $15 membership fee, customers that paid in cash would have access to more than 400 generics at the price of $12 for a three-month supply. According to the complaint, CVS frequently offered the same cash price to customers who were not enrolled in one of these programs.\n The prices that the Blues plans were charged for these same medications was “significantly higher” than the cash prices paid by customers, the plaintiffs said. For example, multiple Blues plans reported overpaying for Nadolol, a generic to treat high blood pressure. BCBS of North Carolina reported paying $257 for the drug, while cash-paying customers in the savings program paid $12, according to court documents.\n “Third-party payors then reimbursed CVS based on those higher, inflated prices—instead of the actual, lower, prices CVS offered to the general public, including through its Cash Discount Programs,” the complaint stated.\n The Blues plans said this not only caused them to overpay for prescription claims, but it also prevented them from getting better drug prices for their members.\n In an emailed statement, CVS Health denied the allegations, saying they were “completely without merit.”\n “The CVS Pharmacy Health Savings Pass was a membership program intended for customers who either did not have insurance or chose not to use insurance. The Value Prescription Savings Card Program is a prescription drug card offered and administered by a third-party,” the company stated. “Generic drug prices available through these programs were not the usual and customary price charged by CVS Pharmacy, nor the price available to the general public. Neither of these programs were in any way concealed, nor fraudulent.”\n The plaintiffs are seeking injunctive relief, damages, and an award of twice the amount they were overcharged.\n Other pharmacy chains have recently faced similar lawsuits. In 2018, Rite Aid was  hit with a class action lawsuit for allegedly charging insurers more than it charged customers under its cash membership plans. Walgreens  faced a class action lawsuit for similar allegations that year.", "posttime": "2020-06-04 03:38:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "十字,blue,计划", "title": "蓝十字蓝盾计划起诉CVS对他们收取过高的仿制药费用", "title_en": "Blue Cross Blue Shield plans sue CVS for overcharging them for generic drugs", "transed": 1, "url": "https://medcitynews.com/2020/05/blues-plans-sue-cvs-saying-it-overcharged-them-for-generic-drugs/?rf=1", "via": "", "real_tags": ["十字", "blue", "计划"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005026, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我最近构建并发布了我的第一个SaaS产品，我从中学到了很多。有趣的是，在我学会这些东西之后，我意识到它们看起来是多么微不足道。它们太简单了，我不敢相信我从一开始就没有考虑过它们。我将分享这些基础知识，这样你就不会重蹈我的覆辙，节省你宝贵的时间来做你的项目。\n在我们继续之前先简要介绍一下背景知识。我最近推出了我的第一个SaaS项目，我将其命名为Respium，灵感来自于“响应”这个词。Respium建立了简单的店面来销售你的回复--可能是专业的建议、随意的问答等等，这些都是消费者愿意付钱的地方。它和Shopify类似，只是销售的是文字回复，而不是实体产品。一个店面示例如下所示。\n让我们跳到我答应要列出的学习项目清单上。我将从我最喜欢的开始。\n如果你不了解足够多的潜在客户来要求反馈，那就试着做广告吧。\n听起来很奇怪，对吧？但我认为这是明智的。听我解释。创始人非常幸运，因为他们实际上来自产品的目标用户群，这意味着他们已经有了第一手的用户洞察力，可以帮助他们评估自己的想法。在我的案例中，我是我的产品用户的目标客户。我开始在Respium上工作是因为我希望有这样一个工具，可以用来从各自领域的专业人士、你关注的内容创作者等那里获得建议/推荐/提示。我没有足够的潜在客户是我个人认识的，但我意识到在线广告实际上是一个很好的工具。广告网络有很好的工具，比如目标定位，A/B测试，你可以用它来找出谁是你的受众，以及根据一个单一的衡量标准-CTR(点击率=点击你的广告的人数/观看你的广告的人数)，找出谁是你的受众，以及什么吸引了他们的注意力。如果你的主要营销将是广告，那么这个黑客攻击实际上可能更有价值。\n假设您有SaaS的仪表板，您的现有客户可以在其中闲逛，还有一个注册页面、一个登录页面和营销材料(在线广告、博客帖子等)。在发布的头几天里，我不断地向应用程序添加新功能，对用户仪表板进行轻微的UI改进，以及其他类似的更改。当我观察分析结果时，我注意到我在登录页面或注册页面上失去了很多访问者。我意识到我从管道的错误一端开始了优化。为了更好地理解这一点，让我们考虑以下管道：Ad Copy→登录页面→注册页面→教程→实际使用。从理论上讲，与每一步交互的人数将小于或等于(在完美世界中)上一步的人数(考虑到这是唯一可能的流程)。这意味着，如果你的广告文案很糟糕，几乎没有人会看到你的登录页面，如果登录页面很糟糕，那就忘了注册吧，以此类推。这些步骤中的每一个都可以具有表示其转换率的度量。我会选择假设你的产品本身不是流水线中最糟糕的部分。因为如果是这样，而且管道的左侧仍然表现良好，也许你应该停止你正在做的事情，转而从事营销工作。😉。\n如果您能够将流水线中任何一个步骤的转化率提高5%，从数学上讲，如果您将5%添加到当前转化率最差的步骤中，则总转化率(完成教程的用户计数/观看您的广告的人数计数)将增加最多。这就是说，如果你知道自己最薄弱的地方是什么，那么努力改进这一点会更有成效。但如果您不知道这一点，我会选择从管道的开始进行优化。\n互联网上充斥着各种不同类别的付费或免费模板。如果你在网页设计方面没有天赋，那么使用已经可用的模板可能很有诱惑力。他们不都看起来很完美吗？他们这样做是因为这是他们应该做的，才能卖得好。但也有一些问题。首先，这些模板并不完全是为您的产品构建的。它们只是一些空洞的例子，可能看起来很吸引人，但实际上毫无意义。您可能会爱上这种设计，并最终根据模板调整您的产品，而不是做相反的事情。\n第二件要避免的事情是充斥着炫酷的效果、花哨的动画等的模板。对于Respium的登录页面的第一个版本，我使用的是麻省理工学院授权的免费模板。当我用灯塔检查页面的性能分数时，得到了令人震惊的分数14/100。我丢弃了一切，使用Bootstrap构建了一个新的更简单的。页面变得更简单、更快了。\n尽管如此，我仍然认为你可以从这些模板中获得一些很好的灵感。\n自豪于你的产品解决了多么复杂的问题，你的代码库有多大(除非你不可能简化它)。但是拥有一个复杂的用户界面并不值得骄傲。对于工程师来说，在前端反映代码库的每个方面并不少见。归根结底，这就是我们大脑的工作方式。试着让界面变得简单，以至于任何用户都会说“哎呀，我侄子周末就能造出来”。\n你的团队越小，这个团队就越重要。高级SSL证书不是构建由多个EC2(或类似实例)组成的高可用性、超强弹性的群集，而是构建一个昂贵的负载平衡器，而使用无服务器体系结构构建相同的东西，并且几乎不需要支付任何费用。减少维护工作量，将节省的时间用于改进最终产品，将节省的资金用于营销。\n虽然这些项目中的大多数听起来都很琐碎，但很容易落入陷阱而忽略它们。我希望这篇文章能帮助一些像我这样的创始人。\n另外，我邀请您查看Respium.com，如果您喜欢这个故事，请点击它并在Twitter上关注我：@jtogrul", "note_en": "I recently built and launched my first SaaS product and I learned a lot just by that. Interestingly, I realized afterward how trivial these things looked after I learned them. They are so simple, I can’t believe how I didn’t consider them from the beginning. I will share these elementary learnings so that you don’t do the mistakes I did and save your precious time to work on your project.\n A short background before we continue. I recently launched my first SaaS project which I named  Respium, inspired by the word “response”. Respium builds simple storefronts to sell your responses — which might be professional advice, casual Q&amp;A’s, etc where the consumer is ready to pay for. It is like Shopify, except for selling text responses instead of physical products. An example storefront looks like  this.\n Let’s jump to the list of the learnings which I promised to list. I will start with my favorite.\n If you don’t know enough potential customers to ask for feedback, then try advertising\n Sounds weird, right? But I think it is smart. Let me explain. Founders are very lucky when they are actually from their product’s target user group, meaning they already have first-hand user insights to help them evaluate their idea. In my case, I was the target customer of my product’s users. I started working on Respium because I wished there was such a tool that I could use to get advice/recommendations/tips from the respective field professionals, content creators that you follow, etc. I didn’t have enough potential customers that I knew personally, but I realized that Online advertising is actually a great tool for this. The ad networks have great tools like targeting, A/B tests which you can use to find out who is your audience and what catches their attention based on one single metric — CTR ( Click-through rate = count of people clicked your ad / count of people saw your ad). This hack can actually be even more valuable if your primary marketing will be advertising.\n  Let’s say you have the dashboard of your SaaS where your existing customers hang out, a signup page, a landing page, and the marketing materials (online ads, blog posts, etc). During the first few days of the launch, I was continuously adding new features to the app, doing minor UI improvements to the user dashboard, and other changes like this. As I observed the analytics results, I noticed I was losing a lot of visitors either on the landing page or on the signup page. I realized that I had started optimization from the wrong end of the pipeline. To understand this better, let’s consider the following pipeline:  ad copy → landing page → signup page→tutorial →real usage. Theoretically, the count people interacted with each step would be less than or equal to (in the perfect world) that of the previous step (considering this is the only possible flow). That means, if your ad copy sucks almost nobody will ever see your landing page and if the landing page sucks then forget signups and so on. Each of these steps can have a metric representing its conversion rate. I will choose to assume that your product itself is not the worst part of the pipeline. Because if it is and the left side of the pipeline still performed well, maybe you should stop what you are doing and switch to marketing. 😉\n If you are able to improve the conversion rate of any of these steps in the pipeline by 5%, mathematically, the total rate (count of users completed the tutorial / count of people who saw your ad) would increase the most if you added the 5% to the step which has the worst rate currently. That means if you know what is your weakest point, it is more fruitful to try to improve that one. But if you don’t know that, I would choose to start optimization from the beginning of the pipeline.\n  The internet is full of paid or free templates for different a variety of categories. If you are not talented on web design it might be so tempting to use an already available template. Don’t they all look perfect? They do because that is what they are supposed to do to sell well. But there are some issues. First of all, these templates are not built for exactly your product. They are just dummy examples, which might look appealing but make no sense actually. You might fall in love with this design and end up adapting your product to the template instead of doing the opposite.\n The second thing to run away from is templates bloated with cool effects, fancy animations, etc. For the first version of Respium’s landing page, I used an MIT licensed free template. When I checked the Performance Score of the page using  Lighthouse a got a shocking score of 14/100. I throw away everything and built a new simpler one using Bootstrap. The page got much simpler, faster.\n All these said, I still think you can get some great inspiration from these templates.\n  It is fine to be proud of how complex problems does your product solve, how big is your codebase (unless you couldn’t possibly simplify it). But having a complex user interface is not something to be proud of. For an engineer, it is not very unusual to mirror every aspect of the codebase in the frontend. In the end, this is how our brain works. Try to have an interface so simple, that any user would say “pff, my nephew can build it during the weekend”.\n  The smaller your team is the important this one is. Instead of building a highly available, super-resilient cluster of multiple EC2 (or similar) instances, an expensive load balancer in front of them, premium SSL certificate build the same thing with Serverless architecture and pay next to nothing. Reduce maintenance effort, use the time saved on improving the end product, and the money saved on marketing.\n  Although most of these items sound very trivial, it is very easy to fall into the trap and ignore these. I hope this post would help some founders like me.\n Also, I invite you to check out  Respium.com, and if you like this story clap it and follow me on twitter:  @jtogrul", "posttime": "2020-06-04 03:37:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "初创,simple,产品", "title": "通过启动我的第一家SaaS初创公司，我学到了5件愚蠢而简单的事情", "title_en": "5 stupid simple things I learned by launching my first SaaS startup", "transed": 1, "url": "https://medium.com/@togruljafarli/5-stupid-simple-things-i-learned-by-launching-my-first-saas-startup-e9242bfed032", "via": "", "real_tags": ["初创", "simple", "产品"]}, {"category": "", "categoryclass": "", "imagename": "ad63e07cffed384f30131a6c63fdc0e0.jpg", "infoid": 1005025, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "韩国手机制造商LG上个月发布了安全更新，以修复一个影响其过去七年销售的Android智能手机的漏洞。\n在标识符CVE-2020-12753下跟踪的该漏洞会影响LG智能手机附带的引导加载程序组件。\n与Android操作系统不同，Bootloader是每个智能手机供应商特有的固件。它是用户启动设备时运行的第一段代码，它确保智能手机固件和Android操作系统本身以正确和安全的方式启动。\n今年3月，美国软件工程师马克斯·托马斯(Max Thomas)在从LG Nexus 5系列开始添加到LG智能手机的引导加载程序组件中发现了一个漏洞。\n在周二发布的漏洞技术分析报告中，托马斯表示，BootLoader组件的图形包中包含一个漏洞，该漏洞可让攻击者在特定情况下(如电池耗尽或设备处于BootLoader的下载模式时)潜入自己的代码，与BootLoader的图形一起运行。\n托马斯说，对攻击进行精确计时的威胁行为者可以获得运行自己的自定义代码的能力，这可能会让他们接管引导加载程序，并本质上接管整个设备。下面嵌入了一个视频演示。\n该漏洞影响到所有使用QSEE(高通安全执行环境)芯片的LG智能手机，这些芯片使用EL1或EL3运行时固件，以及所有运行Android 7.2和更高版本的LG设备。\n需要明确的是，CVE2020-12753漏洞是研究人员所说的冷启动攻击，意思是只有通过物理访问并连接到易受攻击的设备才能利用该漏洞。\n然而，这并不意味着错误的影响就小了。在用户的设备被盗或被扣押的情况下，此漏洞可用于授予新所有者对该设备的控制权并解锁其机密。\nLG在2020年5月上旬发布的LVE-smp-200006安全更新中发布了针对此漏洞的补丁。\n拥有包括无法访问LG智能手机在内的日常威胁模型的设备用户应该考虑应用lve-smp-200006更新。\n托马斯还发布了他用来破解LG Stylo 4智能手机引导加载程序的概念验证代码。", "note_en": "South Korean phone manufacturer LG has released a security update last month to fix a vulnerability that impacts its Android smartphones sold over the past seven years.\n The vulnerability, tracked under the identifier of CVE-2020-12753, impacts the bootloader component that ships with LG smartphones.\n Separate from the Android OS, the bootloader is a piece of firmware specific to each smartphone vendor. It is the first piece of code that runs when a user starts their device, and it ensures that smartphone firmware and the Android OS itself start in a correct and secure manner.\n  In March this year, US software engineer Max Thomas discovered a vulnerability in the bootloader component that had been added to LG smartphones starting with the LG Nexus 5 series.\n In a  technical breakdown of the vulnerability published on Tuesday, Thomas says the bootloader component&#39;s graphics package contains a bug that lets attackers sneak in their own code to run alongside the bootloader&#39;s graphics under certain conditions, such as when the battery dies out and when the device is in the bootloader&#39;s Download Mode.\n    Thomas says that threat actors who perfectly time an attack can gain the ability to run their own custom code, which could allow them to take over the bootloader, and inherently the entire device. A video demo is embedded below.\n  The bug impacts all LG smartphones utilizing QSEE (Qualcomm Secure Execution Environment) chips that use the EL1 or EL3 runtime firmware, and all LG devices running Android 7.2 and later.\n    To be clear, the CVE-2020-12753 vulnerability is what researchers call a &#34; cold boot attack,&#34; meaning a vulnerability that can only be exploited by having physical access and connecting to a vulnerable device.\n However, this doesn&#39;t mean the bug is less impactful. In situations where a user&#39;s device is stolen or seized, this vulnerability can be used to grant the new owner control over the device and to unlock its secrets.\n LG has released a patch for this bug in the LVE-SMP-200006 security update, which the company  released in early May 2020.\n Device owners who have a daily threat model that includes losing access to their LG smartphone should look into applying the LVE-SMP-200006 update.\n Thomas has also released  proof-of-concept code he used to break the bootloader on an LG Stylo 4 smartphone.", "posttime": "2020-06-04 02:50:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "手机,android,攻击,boot,lg", "title": "新的冷启动攻击影响LG Android智能手机七年", "title_en": "New Cold Boot Attack Affects Seven Years of LG Android Smartphones", "transed": 1, "url": "https://www.zdnet.com/article/new-cold-boot-attack-affects-seven-years-of-lg-android-smartphones/", "via": "", "real_tags": ["手机", "android", "攻击", "boot", "lg"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005024, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "众所周知，Windows98之前的Win9x变体有在快速CPU上崩溃的趋势。“快速”的定义当然是模糊的，但早在1998年，这些问题就已经在运行350 MHz或更快的AMDK6-2处理器上出现了。当微软试图收取35美元的修复费用时，这导致了一些尖刻的批评。350 MHz部分的崩溃是间歇性的，但由于时钟速度更快，更难避免。\n这个问题很快就开始影响其他频率更高的CPU，但暂时没有影响英特尔处理器。英特尔CPU在某种程度上更好吗？不完全是，但这是有原因的；稍后会有更多信息。\n我早就意识到了这个问题，但从来没有仔细研究过细节。当我这么做的时候，一开始我并没有意识到这一点。一位熟人提到，Windows3.11 for Workgroup不再在虚拟机中运行。\n经过调查，发现问题与主机CPU有关。一台较老的英特尔i7-2600主机出现了这次崩溃，但很少见。一架较新的Ryzen 73800X每次都会坠毁。英特尔/AMD有什么意想不到的区别吗？嗯，是的，也不是…。\n也就是说，“崩溃”描述的更多的是原因，而不是症状。在运行‘win’之后，wfw 3.11会显示Windows徽标，并很快返回到DOS提示符，但没有给出任何原因的提示。\n在搜索wfw 3.11调试内核(不是那么容易)并使用WDEB386之后，原因变得更加明显。在保护模式下发生被零除，导致Windows自行关闭。早些时候的实验表明，“win/n”运行没有问题，所以网络是首要的疑点。\n现在，这条错误消息并不比只是默默地返回到DOS更有启发性。WDEB386也不清楚代码在哪里崩溃。\n因此，我求助于在Windows二进制文件中查找分零码序列，很快就找到了罪魁祸首：NDIS.386。这就解释了为什么问题只出现在wfw3.11中的保护模式网络堆栈中，而实际上并不依赖于网络驱动程序或协议或任何配置细节。\n使用IDA Pro几分钟后，真正的原因变得显而易见。NDIS模块校准NdisStallExecution API的延迟循环。请注意，这是32位保护模式(VxD)代码。核心算法如下：\n现在，这种方法的问题是，尽管GET_SYSTEM_TIME直接使用8254 PIT读取时间(并且它可以提供微秒精度)，但它只能精确到1毫秒。如果两次调用get_system_time并在其间运行循环指令大约一百万次所需的时间不到1毫秒，就会出现问题-因为开始和结束的毫秒可能相同，从而导致增量为零，并直接导致除以零(代码不是非常小心)。只要GET_SYSTEM_TIME不返回相同的值，就没有问题。\n这正是在大约100兆赫兹和更慢的CPU上100%稳定的事情，但是当cpu时钟速度提高几倍并且循环指令执行…所需的周期也更少时。麻烦。考虑到wfw3.11的发布日期(1993)，该代码不可能在任何比66 MHz奔腾更快的设备上进行测试(如果有的话)。一台350兆赫的K6-2仅在时钟速度上就会快五倍以上，但在实践中性能差异要大得多。\n请注意，对GET_SYSTEM_TIME的调用使事情变得更加有趣。如上所述，这些芯片将访问PIT，这意味着端口I/O。不同的芯片组处理这些读取的速度很可能存在差异，更快的访问更有可能触发故障。\n事实证明，Windows95中的NDIS.VXD具有用于校准NdisStallExecution的完全相同的代码。考虑到Windows95和Windows3.11之间的密切关系，这并不令人惊讶。因此，Windows 95用户可能已经看到以下屏幕：\n应该指出的是，Windows95至少有礼貌地将矛头牢牢地指向了麻烦制造者的方向。\n更有趣的是，Windows95还在其他几个模块中添加了相同的逻辑，即ESDI_506.PDR和SCSIPORT.PDR。\nMicrosoft修复了Windows 95 OSR2的问题并提供了更新。有点不幸的是，这被称为“AMD修复”(包含解决方案的文件名为AMDK6UPD.EXE)，尽管微软很清楚这在AMD CPU中不是问题，而是在它们自己的代码中。\n为什么英特尔CPU在AMD之前或大约同时受到影响？1998年8月，英特尔已经有了一台运行在450 MHz的奔腾II。它不应该比350兆赫的K6-2有更多的麻烦吗？事实并非如此，要找出为什么需要查看优化手册。\n但首先让我们考虑一下最初的奔腾，它是编写代码时可用的最快处理器。根据奔腾处理器家族开发人员手册第3卷：架构和编程手册(英特尔订单号241430)，循环指令。采用分支时的绝对最佳情况是6个时钟周期。英特尔手册指出，“执行无条件循环指令所需的时间比两条指令序列长，后者会递减计数寄存器，并在计数不等于零时跳转”。\n然后，1,048,576次迭代将在奔腾上花费至少6,291,456个时钟周期，在66 MHz频率下，这将花费94毫秒多一点的时间来执行。请注意，这是最好的情况，实际上也是最坏的情况(最短的执行时间，最有可能导致除法溢出)。\n现在考虑一下AMDK6-2的当代，一台350兆赫兹的英特尔奔腾II。信息来源是英特尔架构优化手册(英特尔订单编号242816-003)。手册再次建议：避免使用复杂的指令(例如，Enter、Leave、Loop)。取而代之的是使用简单的指令序列。当然，对于微软来说，在Intel CPU上循环指令速度很慢这一事实是可取的(如果有什么不同的话)。\n在P6架构上，简单循环指令解码为4个μ操作。从英特尔手册中计算出…是多少个时钟周期。困难。Agner Fog似乎也有同样的困难，在他的工作中没有给出奔腾II/III的循环吞吐量。但是他给出了6个循环的奔腾M吞吐量。很可能这也是奔腾II/III所需要的。\n在奔腾II处理器上的实验确实证明了这一点。具有1,048,576次迭代的循环需要略低于600万个时钟周期来执行，这表明吞吐量大致正好是6个周期。然后，350 MHz奔腾II将需要大约17毫秒来执行循环。以1 GHz运行的奔腾III仍然需要大约6毫秒来运行循环。\n那么K6-2怎么样？与英特尔不同，AMD-K6处理器代码优化应用笔记(AMD出版物21924 Rev.D，2000年1月)实际上建议在适用的情况下使用循环指令，第89页上写道：JCXZ采用2个周期，不采用7个周期。循环需要1个周期。\n这意味着在相同的时钟速度下，K6-2执行循环指令的速度比同时代的英特尔CPU快6倍。那是相当大的差别。\n换句话说，运行在350 MHz的AMDK6每秒将吞噬350,000,000次循环迭代，而1,048,576次迭代将花费不到3毫秒。\n但这并不合理，不是吗？即使NDIS停止校准循环的运行时间略低于3毫秒，测量的时间增量也不可能为零，除非GET_SYSTEM_TIME完全损坏。但事实并非如此。因此，我们刚刚发现为什么Windows for Workroups 3.11在350 MHz CPU上没有崩溃。然而，众所周知，Win95也存在与…相同的问题。但是为什么呢？\n因为如上所述，其他Win95组件中也有类似的代码。这里的关键词是相似的。\n例如，ESDI_586.PDR(非常常用的IDE磁盘端口驱动程序)包含以下逻辑：\nSCSI端口驱动程序SCSIPORT.PDR包含实现ScsiPortStallExecution API的相同代码。Win95机器几乎可以保证使用ESDI_506.PDR或SCSIPORT.PDR，除非在安全模式下。\n存储驱动程序算法不那么通用，因为ScsiPortStallExecution被指定为仅支持少于1毫秒的停顿，而NDIS变体可以支持任意长的停顿(使用不同的方法实现)。最后除以153是因为ScsiPortStallExecution接受参数(停止的微秒数)，将其乘以计算出的常量，然后将结果右移16位。\n存储端口校准算法更容易出现问题。它不会将校准循环执行的开始与时间刻度“对齐”，这会导致测量结果不稳定。它使用的循环迭代稍微少一些，也许刚好足以产生影响。最重要的是，它将一个非常大的数字(10,000,000,000或2540BE400h)除以可能很小的毫秒数。\n因此，存储算法最大的问题是，它不仅容易被零除，而且与NDIS中使用的算法不同，当除数是1或2时，它也容易发生除法溢出。而这正是350 MHz AMD K6可能发生的情况。根据循环与毫秒刻度对齐的确切方式，测量结果通常可能是3毫秒(由于测量开销和不准确)，但有时只有2毫秒。这正是会导致分裂溢出的原因。谜团解开了。\n同样，由于英特尔CPU的循环指令执行速度慢得多，因此在当时有效地不受此问题的影响。今天的英特尔CPU自然也会崩溃，因为尽管它们执行循环指令的速度仍然有些慢，但它们的时钟速度大约是350 MHz奔腾II的10倍。\n在现代(从Windows9x的角度来看是“极快的”)机器上，Winows95可以引导到安全模式，但不能通过联网进入安全模式。在后一种情况下，它仍然在NDIS中报告“Windows保护错误”。\n根据以上情况，很容易看出其中的原因。在纯安全模式下，会跳过网络，因此不会加载NDIS。也不使用本机Windows 95存储驱动程序。这就绕过了导致分裂溢出的组件。\n带有网络的安全模式将不使用本地存储驱动程序，但仍使用NDIS，这意味着在NDIS初始化时，它将被零除。\nWindows 98(第一版)似乎修复了存储驱动程序中的分区溢出，但没有修复NDIS中的分区溢出。这几乎可以肯定，因为在1998年可以在可用的硬件上观察到存储驱动程序崩溃，但NDIS崩溃不能。事实上，Windows95OSR2的“AMD修复”同样纠正了存储驱动程序中的问题，但NDIS保持不变。\n即使是存储驱动程序的修复也不是很好。修改了校准算法，以避免除以除零以外的任何值时溢出的可能性，并将其改为运行1000万个循环周期进行校准，而不是原来的100万个循环周期。如果1000万次循环迭代在1毫秒内完成(2020年没有能够做到这一点的硬件)，代码仍然会崩溃，并且除以零。\n2001年，Microsoft发布了针对Windows 98(但不是Windows 95)中NDIS崩溃的修复程序。如果第一次测量导致零毫秒增量，则固定校准算法重试一次。如果第二次尝试的结果也是0，则只需将其强制为1即可避免崩溃。因此，无论CPU有多快，修复的NDIS校准都不会崩溃。\nWindows98SE(1999)已经为NDIS崩溃和存储驱动程序崩溃提供了修复，并且在今天(2020)的硬件上没有重大的速度相关问题；它在最近的AMD CPU上确实有其他无关的问题。\n同样，在编写代码时，这是任何测试都无法发现的问题。也就是说，代码审查可以也应该提出这样的问题：“如果校准循环在一毫秒内执行，会发生什么？”要么是这种情况没有发生，要么是这种可能性被认为足够不可能被忽视。\n将NDIS算法与存储端口算法进行比较同样有趣。两者都使用完全相同的核心逻辑(多次运行循环指令以延迟给定的微秒数)，但是存储端口代码更容易出现问题，因为它在测量延迟长度时不太小心，而且因为额外的输入值会触发除法溢出。\n这个问题还表明，软件和硬件工程师所做的看似可靠的假设有时并不可靠。软件工程师查看当前可用的CPU，看看最快的CPU表现如何，并假设CPU在短期内不会提高100倍的速度。但是，当时钟速度提高几倍，指令执行速度加快几倍时，它们就可以了。\n在这种特殊情况下，从66 MHz Intel Pentium到350 MHz AMD K6-2只用了5年时间，将校准循环的执行时间从几乎100毫秒降到了3毫秒以下。\n另一方面，硬件工程师认为使指令更快是一件好事。在这种情况下，AMD无疑在更高的时钟速度触发崩溃之前很久就优化了循环指令。\n目前尚不清楚英特尔只是没有费心让循环指令快速执行(而只是有效地告诉所有人不要使用它)，还是英特尔是否知道让循环快速执行可能会在编写不佳的软件中引发问题。一种或两种都有可能。\nWindows for Workgroup 3.11并不是第一个使用循环指令进行软件计时的软件。1988年的IBM PC LAN Program 1.3以类似的方式使用循环，并且(在NETWORK1.CMD组件中)在CPU上使用除以零的速度比当时可用的要快得多。\n赛拉在线的Sound Blaster驱动程序使用了一个略有不同的主题变体。驱动程序使用循环指令等待中断到达。在20世纪90年代末的一些机器上，延迟不够，驱动程序无法加载，认为中断不起作用。", "note_en": "It is well known that Win9x variants prior to Windows 98 have a tendency to crash on fast CPUs. The definition of “fast” is of course fuzzy but the problems were  known to occur on AMD K6-2 processors running at 350 MHz or faster as early as 1998. This led to some acrimony when  Microsoft attempted to charge $35 for the fix. The crashes were intermittent on the 350 MHz parts but harder to avoid with faster clock speeds.\n The problem soon started affecting other CPUs with higher frequencies, but it didn’t affect Intel processors for a while. Were Intel CPUs somehow better? Not exactly, but there was a reason for that; more about it later.\n I have been long aware of this problem but never looked into the details. And when I did, at first I didn’t realize it. An acquaintance mentioned that Windows 3.11 for Workgroups no longer works in a VM.\n  After some investigation it turned out that the issue is related to the host CPU. An older Intel i7-2600 host exhibited the crash, but rarely. A newer Ryzen 7 3800X crashed every time. Some unexpected Intel/AMD difference? Well, yes and no…\n  That said, “crashed” describes more the cause than the symptoms. After running ‘win’, WfW 3.11 would show the Windows logo and pretty quickly drop back to the DOS prompt without giving  any hints as to why.\n After hunting down the WfW 3.11 debug kernel (not so easy) and engaging WDEB386, the cause became more apparent. A division by zero occurred in protected mode, causing Windows to shut itself down. Earlier experimentation showed that ‘win /n’ runs without problems, so networking was the prime suspect.\n   Now, that error message was not really any more enlightening than just silently dropping back to DOS. And it was not clear from WDEB386  where the code was crashing either.\n  So I resorted to looking for the zero-dividing code sequence in Windows binaries and soon enough found the culprit: NDIS.386. And that explained why the problem only showed up with the protected-mode networking stack in WfW 3.11, but didn’t actually depend on the network driver or protocols or any configuration details.\n After a few minutes with IDA Pro, the real cause became apparent. The NDIS module calibrates a delay loop for the NdisStallExecution API. Note that this is 32-bit protected-mode (VxD) code. The core algorithm is as follows:\n  Now, the problem with this approach is that although Get_System_Time reads the time directly using the 8254 PIT (and it could provide microsecond accuracy), it is only accurate to one millisecond. If it takes less than one millisecond to call Get_System_Time twice and run the LOOP instruction about one million times in between, there will be a problem—because the starting and ending millisecond may be the same, causing the delta to be zero, and directly leading to a division by zero (the code is not very careful). As long as Get_System_Time does not return the same value, everything will be fine.\n This is exactly the kind of thing that would have been 100% solid on circa 100 MHz and slower CPUs, but when the CPU clock speed went up several times and the LOOP instruction also took fewer cycles to execute… trouble. Given the WfW 3.11 release date (1993), the code could not have been tested on anything faster than a 66 MHz Pentium, if at all. A 350 MHz K6-2 would be more than five times faster on the basis on clock speed alone, but the performance differential was much bigger in practice.\n Note that the calls to Get_System_Time make things even more interesting. As mentioned above, these would access the PIT, which means port I/O. There could well have been differences in how quickly different chipsets handled these reads, with faster access being more likely to trigger failures.\n  As it turns out, NDIS.VXD in Windows 95 has the exact same code for calibrating NdisStallExecution. That is hardly surprising given the close relationship between Windows 95 and Windows for Workgroups 3.11. And thus Windows 95 users may have seen the following screen:\n  It should be noted that Windows 95 at least had the decency to point the finger firmly in the direction of the troublemaker.\n To make things more interesting, Windows 95 also added the same logic in several other modules, namely ESDI_506.PDR and SCSIPORT.PDR.\n Microsoft fixed the problems for Windows 95 OSR2 and  provided an update. It was somewhat unfortunate that this was called an “AMD fix” (the file containing the solution was called AMDK6UPD.EXE), even though Microsoft was clear that this was not a problem in AMD CPUs but rather in their own code.\n  Why weren’t Intel CPUs affected before or around the same time as AMDs? In August 1998, Intel already had a Pentium II running at 450 MHz. Shouldn’t it have had more trouble than a 350 MHz K6-2? It didn’t, and to find out why one needs to look at the optimization manuals.\n But first let’s consider the original Pentium, the fastest processor available when the code was written. According to the  Pentium Processor Family Developer’s Manual Volume 3: Architecture and Programming Manual (Intel order no. 241430), the LOOP instruction. The absolute best case when the branch is taken is 6 clock cycles. The Intel manual notes that “[t]he unconditional LOOP instruction takes longer to execute than a two-instruction sequence which decrements the count register and jumps if the count does not equal zero”.\n 1,048,576 iterations will then take at minimum 6,291,456 clock cycles on a Pentium, which at 66 MHz frequency would take a bit over 94 milliseconds to execute. Note that that’s the best case, which is actually the worst case (shortest execution time, most likely to cause division overflow).\n Now consider the AMD K6-2’s contemporary, a 350 MHz Intel Pentium II. The source of information is the  Intel Architecture Optimization Manual (Intel order no. 242816-003). Again the manual advises:  Avoid using complex instructions (for example, enter , leave , loop ). Use sequences of simple instructions instead. Of course for Microsoft’s purposes, the fact that the LOOP instruction was slow on Intel CPUs was, if anything, desirable.\n The simple LOOP instruction decodes to 4 μops on the P6 architecture. Figuring out from the Intel manuals how many clock cycles is… difficult. Agner Fog appears to have the same difficulty and does not present the LOOP throughput for Pentium II/III in his work. But he does present the Pentium M throughput for LOOP—6 cycles. Chances are that that’s what the Pentium II/III also needed.\n And experimentation on a Pentium II processor indeed shows that that’s the case. A LOOP loop with 1,048,576 iterations takes just under 6 million clock cycles to execute, indicating throughput of more or less exactly 6 cycles. A 350 MHz Pentium II would then take about 17 milliseconds to execute the loop. A Pentium III running at 1 GHz would still take about 6 milliseconds to run the loop.\n What about the K6-2 then? Unlike Intel, the  AMD-K6 Processor Code Optimization Application Note (AMD publication 21924 Rev. D, January 2000) actually recommends using the LOOP instruction where applicable and on page 89 says:  JCXZ takes 2 cycles when taken and 7 cycles when not taken. LOOP takes 1 cycle.\n What that means is that the K6-2 executed the LOOP instruction  six times faster than contemporary Intel CPUs at the same clock speed. That’s quite a big difference.\n In other words, an AMD K6 running at 350 MHz will chew through 350,000,000 LOOP iterations per second, and 1,048,576 iterations will take just under 3 milliseconds.\n  But that does not add up, does it? Even if the NDIS stall calibration loop takes slightly less than three milliseconds to run, there’s no way the measured time delta will be zero, unless Get_System_Time is completely broken. And it’s not. Therefore we just found out why Windows for Workgroups 3.11 did  not crash on 350 MHz CPUs. Yet Win95 is known to have have had the same kind of problems… but why?\n Because similar code is in other Win95 components, as mentioned above. And the key word here is  similar.\n For instance ESDI_586.PDR (the port driver for IDE disks, very commonly used) contains the following logic:\n  The SCSI port driver SCSIPORT.PDR contains identical code to implement the ScsiPortStallExecution API. And a Win95 machine would be almost guaranteed to use either ESDI_506.PDR or SCSIPORT.PDR, except in safe mode.\n The storage driver algorithm is less generic because ScsiPortStallExecution is specified to only support stalls of less than one milliseconds, whereas the NDIS variant can support arbitrarily long stalls (implemented using different approaches). The final division by 153 is done because ScsiPortStallExecution takes the argument (number of microseconds to stall), multiplies it by the calculated constant, and shifts the result right by 16 bits.\n The storage port calibration algorithm is more susceptible to problems. It does not “align” the start of the calibration loop execution with a time tick, which causes the measurement results to be unstable. It uses slightly fewer LOOP iterations, perhaps just enough to make a difference. Most importantly, it divides a very large number (10,000,000,000 or 2540BE400h) by a potentially small count of milliseconds.\n The biggest trouble with the storage algorithm then is that it is not only susceptible to division by zero, but it is—unlike the algorithm used in NDIS—also susceptible to division overflows when the divisor is 1 or 2. And that’s exactly what  could happen on a 350 MHz AMD K6. Depending on exactly how the LOOP loop aligned with millisecond ticks, the measured result was probably often 3 milliseconds (due to the measurement overhead and inaccuracy) but sometimes only two. That is exactly what  would cause a division overflow. Mystery solved.\n Again Intel CPUs were effectively impervious to this problem at the time due to their much slower LOOP instruction execution. Today’s Intel CPUs naturally would also crash because although they still execute the LOOP instruction somewhat slowly, their clock speeds are roughly 10 times faster than those 350 MHz Pentium IIs.\n  On a modern (“extremely fast” from the Windows 9x perspective) machine, Winows 95 can boot to safe mode, but not safe mode with networking. In the latter case, it still reports a “Windows protection error” in NDIS.\n In light of the above, it is easy to see why. In the plain safe mode, networking is skipped and therefore NDIS isn’t loaded. The native Windows 95 storage drivers are not used either. That sidesteps the components which cause division overflows.\n Safe mode with networking won’t use the native storage drivers but still uses NDIS, which means it will divide by zero when NDIS initializes.\n  Windows 98 (First Edition) appears to have fixed the division overflows in the storage drivers, but  not in NDIS. That’s almost certainly because the storage driver crashes could be observed on hardware available in 1998, but the NDIS crashes could not. In fact the “AMD fix” for Windows 95 OSR2 likewise corrected the problems in the storage drivers but left NDIS untouched.\n And even the storage driver fixes weren’t great. The calibration algorithm was modified to avoid the possibility of overflow when dividing by anything other than zero, and it was changed to run 10 million LOOP cycles for calibration rather than the original 1 million. If 10 million LOOP iterations completed in under 1 millisecond (no hardware capable of that exists in 2020), the code would still crash with a division by zero.\n In 2001, Microsoft issued a  fix for the NDIS crash in Windows 98 (but not Windows 95). The fixed calibration algorithm retries once if the first measurement resulted in a zero millisecond delta. If the second try also results in a zero, it’s simply forced to one to avoid the crash. The fixed NDIS calibration therefore won’t crash, regardless of how fast the CPU is.\n Windows 98 SE (1999) already came with fixes for the NDIS crashes as well as the storage driver crashes and does not have major speed-related problems on today’s (2020) hardware; it does have  other, unrelated problems on recent AMD CPUs.\n  Once again, this is the sort of problem that no amount of testing could have caught when the code was written. That said, a code review could and should have asked questions like “what happens if the calibration loop executes in under one millisecond?”. Either that didn’t happen or the possibility was considered sufficiently unlikely to ignore.\n It’s likewise interesting to compare the NDIS algorithm with the storage port algorithm. Both use the exact same core logic (run the LOOP instruction a number of times to stall a given number of microseconds) but the storage port code is much more susceptible to problems, because it is both less careful when measuring the delay length  and because additional input values trigger a division overflow.\n The issue also illustrates how seemingly solid assumptions made by software and hardware engineers sometimes aren’t. Software engineers look at the currently available CPUs, see how the fastest ones behave, and assume that CPUs can’t get faster by a factor of 100 anytime soon. Except they can when the clock speed goes up several times  and the instructions execute several times quicker.\n In this particular case, it took only 5 years to get from a 66 MHz Intel Pentium to a 350 MHz AMD K6-2, dropping the execution time of the calibration loop from almost 100 milliseconds to under 3 milliseconds.\n Hardware engineers on the other hand assume that making instructions faster is a good thing. In this case AMD no doubt optimized the LOOP instruction long before the increased clock speed triggered the crashes.\n It is not known whether Intel simply did not bother making the LOOP instruction execute fast (and just effectively told everyone not to use it), or whether Intel knew that making LOOP fast could trigger problems in poorly written software. Either or both is possible.\n   Windows for Workgroups 3.11 was not exactly the first piece of software using the LOOP instruction for software timing. The IBM PC LAN Program 1.3 from 1988 used LOOP in a similar way, and similarly crashes (in the NETWORK1.CMD component) with a division by zero on CPUs significantly faster than those available at the time.\n A slightly different variation on the theme was used by Sierra On-Line’s Sound Blaster drivers. The drivers used the LOOP instruction to wait for an interrupt to arrive. On some late-1990s machines, the delay was insufficient and the drivers failed to load, thinking that interrupts weren’t working.\n Many of these LOOP uses were unsafe and implicitly assumed that the LOOP loop cannot execute faster than some arbitrary limit. Time has proven the assumption-makers wrong one by one.", "posttime": "2020-06-04 02:49:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "win9x,crashes,问题", "title": "那些在快速机器上运行的Win9x崩溃", "title_en": "Those Win9x Crashes on Fast Machines", "transed": 1, "url": "http://www.os2museum.com/wp/those-win9x-crashes-on-fast-machines/", "via": "", "real_tags": ["win9x", "crashes", "问题"]}]