[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1072621, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“圣诞节季节，雪，颂歌和喜悦的时间，代码冻结在这里，昨天是我上次部署。仍然是我最喜欢的时刻是在树下，我总能找到一个新版本的红宝石。\n写作计划很快感到简单，优雅和自然。这里没有复杂的语法。相信我，我看了。这是最好的perl，lisp和smalltalk，没有怪癖。就是这样，我被迷上了！\n多年来过去了，Rails现在是我的日常工艺，我仍然享受它的每一刻。是的，甚至是istiverecord。当人们问我“是ruby死了？”，我只是回答：不，它只是无聊，在最好的话语中。\n因为我不想闪亮。我想要富有成效和简单。我需要的是写代码，也许是一次或两次奇怪。加入我们在我们的大帐篷下，你的欢迎来到Matz很好，所以我们很好。", "note_en": "‘tis Christmas season, time for snow, carols and joy, The code freeze is here, yesterday was my last deploy. Still my favorite moment is when under the tree, I always find a new version of ruby.\n Today I take this opportunity to reflect on the past Where my journey began, not knowing how long it would last. _why’s poignant guide was an amusing read It made me smile and think: “wow, this language is weird!”\n Writing programs soon felt simple, elegant and natural. No convoluted syntax here. Trust me, I looked. It was the best of perl, lisp and smalltalk, And none of the quirks. That’s it, I was hooked!\n And then there was this thing called Rails, A blog in ten minutes, could this be possible? It was a lot to take in, but I hung in there The tutorial helped a lot, thank you Michael Hartl!\n Years have passed, and Rails is now my daily craft I still enjoy every moment of it. Yes, even ActiveRecord. And when people ask me “is ruby dead?”, I just answer: No. It’s just boring, in the best sense of the word.\n Don’t get me wrong, I love innovation and new ideas But it sometimes seems like the web has jumped the shark So I’m happy to get off the new framework treadmill No web3 for me, thanks. I’m off to the park!\n For I don’t want shiny. I want productive and simple. What I need is to write code, and maybe be weird once or twice. Join us under our big tent, you are more than welcome For Matz is nice and so we are nice.\n So here’s to you, Ruby, Rails and the whole community, May you still thrive and make people cheery. I leave you now, and go back to my desk For I once again have trouble installing Nokogiri.", "posttime": "2022-01-10 22:45:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ruby,红宝石,ode,代码", "title": "对红宝石的颂歌", "title_en": "An Ode to Ruby", "transed": 1, "url": "https://blog.yboulkaid.com/2022/01/10/ode-to-ruby.html", "via": "", "real_tags": ["ruby", "红宝石", "ode", "代码"]}, {"category": "", "categoryclass": "", "imagename": "f97959f0780e55cfd6979ca53b9fa67f.png", "infoid": 1072620, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我从一贯优秀的博客无人壁橱里读了关于霍夫曼的金字塔。 Huffman的金字塔是一个图画不存在的图。\n你是否相信？如果你是，那么你的几何直觉比我的更强大，你可能现在可以停止阅读。但如果你持怀疑态度，就像我一样，请继续阅读。\n我认为我们的意思是不可能的数字是该数字似乎具有矛盾的属性。上面所示的雕塑实际上不是三角形，但它看起来是一个从一定角度的三角形，并且这种明显的形状与我们可以观察到雕塑的其他东西不一致。\n绘图似乎表示具有两个三角形面和三个四边形面的多面体。三角形面是abc和def。双边面临的脸部，BCFE和CADF。它还似乎在G的I，AD和CF与G处相交，并且在H的情况下与CF相交，如果我们接受这种绘图的解释，那么它代表的形状是不可能的。\n这似乎表明Pentahedra不能太不规则。进一步探索这个概念会很有意思。", "note_en": "I read about Huffman’s Pyramid from the consistently excellent blog  Futility Closet. Huffman’s Pyramid is a drawing of a figure that cannot exist.\n  However, the impossibility of this figure is hardly obvious. Here is the reason: if the slanting lines were extended, then they would have to meet at the apex of a pyramid. However, the lines do not meet. Contradiction!\n  Are you convinced yet? If you are, then your geometric intuition is stronger than mine, and you can probably stop reading now. But if you are skeptical, as I was, then please continue reading.\n First, we should ask this question: What exactly do we mean by an impossible figure? Surely a figure can’t be impossible if we can draw it. Sometimes we can even make a physical model of an impossible object, such as this impossible triangle sculpture in Perth.\n  I think that what we mean by an impossible figure is that the figure appears to have contradictory properties. The sculpture shown above is not actually a triangle, but it appears to be a triangle from a certain angle, and this apparent shape is inconsistent with other things that we can observe about the sculpture.\n Let’s consider Huffman’s Pyramid again. We’ll label the points to make it easier to talk about.\n  The drawing  appears to represent a polyhedron with two triangular faces and three quadrilateral faces. The triangular faces are ABC and DEF. The quadrilateral faces are ABED, BCFE, and CADF. It also appears that AD and BE intersect at I, AD and CF intersect at G, and BE and CF intersect at H. If we accept this interpretation of the drawing, then the shape that it represents is impossible.\n Here’s why. Consider the plane Π containing the face ABED. The plane contains G, since G is on the line AD. The plane also contains H and I, since they are on the line BE. Therefore, Π contains the triangle GHI. Similarly, the plane containing the face BCFE must also contain the triangle GHI. But there is only one plane that contains the triangle GHI, so the two planes must be the same. Therefore, the entire shape lies in a plane, and it cannot be a polyhedron.\n This seems to suggest that pentahedra can’t be  too irregular. It would be interesting to explore this notion further.\n Edit: Greg Ross suggests that the figure might be possible if there is another hidden edge. Can anyone explain this?", "posttime": "2022-01-10 22:43:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "解释,huffman,相交", "title": "解释霍夫曼不可能金字塔", "title_en": "Explaining Huffman’s Impossible Pyramid", "transed": 1, "url": "https://mathblag.wordpress.com/2015/03/11/explaining-huffmans-impossible-pyramid/", "via": "", "real_tags": ["解释", "huffman", "相交"]}, {"category": "", "categoryclass": "", "imagename": "64a5f78ebf9c6cf5cfbb4f1429c60163.png", "infoid": 1072619, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇文章描述了LatencyFlex的内部工作，这是一组图书馆，实现了视频游戏的延迟减少，作为NVIDIA反射的供应商替代替代品。\n一段时间后，我遇到了谷歌的精彩拥堵控制算法，BBR。 BBR旨在解决网络中的长期问题：BufferBloat。 BufferBloop的原因是之前，拥塞控制依赖于数据包丢失，这是缓冲区已满的信号。因此，这些算法最终可能会在最坏情况下运行。但事实证明，拥有挤塞的另一个信号，可以在达到满带宽时立即使用，并且它被称为延迟。 BBR利用此度量来实现最佳操作点的拥塞控制。\n在这篇文章中，我将通过将BBR的行为分解为两部分，然后描述如何在LatencyFlex中使用这些想法。\n为了测量MAX带宽，BBR周期性地进入“探测带宽”模式：它暂时增加了分组发送速率，从而创建队列并允许我们看出更多带宽是否可用。然后，它将发送速率降低相同的量，以保持平均发送速率相同，并删除在临时发送速率凹凸期间可能创建的任何排队。该行为是由BBR纸中的下图描述的：\n在LatencyFlex中，我们基本上使用了同样的想法，但在更高的频率下：我们在“探测帧速率”模式下运行一帧，然后使用下一个帧漏任何队列，然后重复。至关重要的差异是我们使用不同的估计器进行吞吐量和延迟。在BBR中，通过$$ \\ widehat {\\ text {btlbw}} = \\ max（\\ text {deliveryrate}）测量带宽。$$这适用于bbr，因为$ \\ text {forluserrate} $在长窗口中平滑方差足够低。但是，在LatencyFlex中，我们需要从最新的帧时间值派生实时帧速率，这是非常嘈杂的。使用最大值会使估算器强烈偏见。相反，我们使用指数加权的移动平均值，这给出了一个无偏估计：\n我们还将负增益应用于BBR中。在LatencyFlex中，我们使用-1.5％，被确定为良好的测试平衡。\n我们在上一节中讨论的步行者有一个问题：适应带宽减少需要很长时间。这是因为有两个原因：\noverpacing创建队列（以比例比例在极限上的比例），并且步行者只能以等于我们指定的余量的速率排出队列（BBR的1％，LFX为1.5％）。前者可以比后者快得多，这意味着它会恢复到最佳操作会过度长时间。\n这给出了一个“BrickWall”，它可以防止延迟无限期地增加，如下面的BBR纸上所示：\n对于每个帧，我们预测它将完成的时间。这是通过将估计的延迟添加到开始时间来派生这一点。\n预测和实际完成之间的差异等于延迟估计和真实地之间的差异。该算法所做的是保持延迟常数：如果延迟由于排队而增加，则尝试将队列减少相同的数量。延迟将暂时飙升，直到我们可以做出反应，但很快就会恢复到所需的低值。\n本说明省略了许多我在实际实现中做出的复杂决策以实现稳定性，以避免将帖子变得太长。我在代码中记录了它们，尽管一些稳定性属性仍然不太了解。\nLatencyFlex的有意识的设计决策是它将整个管道视为黑匣子，只假设瓶颈的排队将反映在延迟中。这是一个非常强大的模型，适应各种瓶颈，不限于GPU。\n另一方面，NVIDIA反射依赖于游戏引擎代码的显式仪器。它具有用于仿真，渲染和呈现线程的执行标记，用于识别线程之间的通信，以及启用此类优化的选项BusemAstoOptimize。看起来它有一个没有这些标记的模式，但据我所知，所有公布的游戏似乎都使用显式标记。\nLatencyFlex可用于Linux用户，可以注入支持NVIDIA反射的游戏，也可以与某些不支持反射的游戏一起使用，但满足某些游戏发动机条件。如果您有兴趣，请尝试一下。未来，我期待开发游戏开发人员的一体化，一旦我有信心，LFX就足够稳定为最终产品。", "note_en": "This post describes the inner workings of  LatencyFleX, which is a set of libraries that achieves latency reduction for video games, made as a vendor-agnostic alternative to Nvidia Reflex.\n A technology called Nvidia Reflex was released in 2020. It drastically improved system latency, by adjusting the pacing of the game’s main thread so that it kept queued GPU work to a minimal amount. If you are not familiar with the tech, I recommend watching this  video from Battle(non)sense.\n Some time later, I came across Google’s wonderful congestion control algorithm,  BBR. BBR was designed to solve a long-standing issue in networking:  Bufferbloat. The cause of Bufferbloat was that previously, congestion control relied on packet loss, which was a signal that the buffer is full. As such, these algorithms could end up operating at the worst-case round-trip time. But it turns out that there’s another signal for congestion, that can be utilized as soon as we reach full bandwidth, and it’s called delay. BBR exploits this metric to achieve congestion control at the optimal operation point.\n Soon after I gained an understanding of BBR, I realized Bufferbloat shares a lot of properties with the game latency issue. The buffer is called a queue, the RTT is called latency, and the bandwidth is called throughput, frames per second, or something like that. This became the basis of LatencyFleX: using BBR’s idea to run games at the latency-optimal operating point.\n In this post, I will analyze BBR’s behavior by breaking it up into two parts, and then describe how these ideas are utilized in LatencyFleX.\n  The first step toward optimal operation is to not pile up the work too fast. To achieve that, BBR measures the “bottleneck bandwidth” and paces packet sending at that rate. Measuring bandwidth is easy: just look at the rate you receive the ACKs. But there’s one catch: you can’t measure a bandwidth higher than what you’re currently pacing at. BBR authors call this the “uncertainty principle”.\n  In order to measure the max bandwidth, BBR periodically enters a “probe bandwidth” mode: it increases packet sending rate temporarily, which creates a queue and allows us to see if more bandwidth is available. Then, it lowers the sending rate by the same amount to keep the average sending rate the same, and to remove any queuing that might have been created during the temporary sending rate bump. The behavior is described by the following figure in the BBR paper:\n  BBR also applies a  -1% gain to the average bandwidth, which allows it to gradually reduce the preexisting queue and eventually see the minimum RTT.\n In LatencyFleX we use basically the same idea, but at a higher frequency: we run one frame in the “probe frame rate” mode, then use the next frame to drain any queue, then repeat. A crucial difference is that we use a different estimator for throughput and latency. In BBR, bandwidth is measured by$$\\widehat{\\text{BtlBw}}=\\max(\\text{DeliveryRate})$$This worked well for BBR because $\\text{DeliveryRate}$ is smoothed over a long window and the variance is low enough. However in LatencyFleX we need to derive the real-time frame rate from the latest frame time values, which is highly noisy. Using the maximum would make the estimator strongly biased. Instead, we use  exponentially weighted moving average, which gives an unbiased estimate:\n  We only sample the frames we tried to make “fast”, or we would be measuring the average frame rate which is equal to our pacing target.\n We also apply the negative gain like in BBR. In LatencyFleX we use -1.5% which was determined to be a good balance from testing.\n By running the main thread at a lower rate than the bottleneck (which is typically the GPU), we have now created a CPU-bound scenario. This alone will give the sweet latency reduction we want in the steady state. We’re now halfway through the problem! Next, we look at the delay compensator, which actively tries to prevent latency increase in a scenario where latency and frame time dynamically varies.\n  The pacer we discussed in the previous section has an issue: it takes a long time for it to adapt to bandwidth decrease. This is because of two reasons:\n Both the windowed-max estimator and EWMA estimator has a certain delay until it adapts to a lower value. Until then, we would continue to pace at a rate over the actual bandwidth.\n Overpacing creates queue (at a rate proportional how much it’s over the limit), and the pacer can only drain queue at a rate equal to the margin we specified (1% for BBR, 1.5% for LFX). The former can be much faster than the latter, and it means that it would take an excessively long time to return to optimal operation.\n Therefore, we need something that detects and removes the queue, independently of the pacer. What BBR uses is called “inflight control”: it calculates the “just right” amount of packet inflight (sent but not ACKed yet) that is needed for optimal bandwidth utilization, and blocks sending if ACKs are arriving at a rate slower than anticipated.\n This gives a “brickwall” that prevents the latency from increasing indefinitely, as illustrated in the following figure from the BBR paper:\n  We need something similar in LatencyFleX, but the idea of inflight control cannot be used directly since it quantizes $\\text{Bandwidth} \\times \\text{Delay}$ to an integer, but in the case of games, this would be a small number like 2 or 3, making its behavior suffer significantly from quantization error. We will now describe an algorithm below, that achieves behavior similar to inflight control through a different construct:\n For each frame, we predict the time when it would complete. This is derived by adding the estimated latency to the start time.\n When the completion notification arrives, we compare it to the predicted finish time. If it has completed later than anticipated, we delay frames that begin later by the same amount, but subtracting any previous compensation that we have previously made (so that we don’t compensate for the same delay twice).\n The difference between prediction and actual completion is equal to the difference between the latency estimation and ground-of-truth. What this algorithm does is to keep the latency constant: if the latency increases due to queuing, then we try to reduce the queue by the same amount. The latency will spike temporarily until we can react, but it will soon go back to the desired low value.\n Let’s further analyze this algorithm’s behavior. When we’re overpacing, the algorithm will throttle the frame rate to the actual bottleneck rate. On the other hand, when the latency increases without a decrease in frame rate, it will end up over-reducing the throughput. The same thing happens with BBR’s inflight control, and this is why I think the algorithm vastly similar in spirit even if the construct is different.\n This description omits a lot of complex decisions I made in the actual implementation to achieve stability, in order to avoid making the post too long. I documented as much of them in the  code, although some of the stability properties are still not well understood.\n  One of the motivations that lead to me creating LatencyFleX is that I don’t own an Nvidia GPU but an AMD one. Therefore, I’m unable to provide a direct comparison of performance, but let us discuss a key difference between the overall design of the two middlewares.\n A conscious design decision in LatencyFleX is that it treats the entire pipeline as a black-box, only assuming that queuing at the bottleneck would be reflected in the delay. It’s a very powerful model that adapts to every kind of bottleneck, not limited to GPUs.\n A common non-GPU bottleneck in recent engines is the render thread. (Render thread sits between the main simulation thread and the GPU queue, issuing the draw calls and building the command buffer.) LatencyFleX is able to reduce latency in such situations without any extra configuration. As game engines increase in complexity, I anticipate that more and more unique kinds of bottlenecks could be born in the future. The following chart illustrates how a game engine pipeline could currently look like.\n  Nvidia Reflex, on the other hand, relies on explicit instrumentation of game engine code. It has execution markers for simulation, render and presentation thread, used to identify communication between threads, as well as an option  bUseMarkersToOptimize that enables such optimization. It looks like it has a mode that operates without these markers, but as far as I know all published games seem to use the explicit markers.\n In the end, I think Reflex’s explicit instrumentation still has an advantage in terms of stability or frame smoothness, given its more detailed insight on internal queuing. However, LatencyFleX’s trial-and-error measurement approach is also very promising, as it’s highly generalized and future-proof, requires little instrumentation, and still delivers acceptable results.\n LatencyFleX is available for Linux users and can be injected into any game that supports Nvidia Reflex, and can also be used with certain games that does not support Reflex but meets certain game engine conditions. If you are interested, please give it a try. In the future, I look forward to developing integrations for game developers, once I’m confident the LFX is stable enough as an end product.\n For further reading, I recommend Raph Levien’s  Swapchains and frame pacing, which covers a wider range of solutions and tradeoffs on solving the frame pacing issue.", "posttime": "2022-01-10 22:39:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,减少,approach,延迟", "title": "LatencyFlex：减少游戏延迟的新方法", "title_en": "LatencyFleX: A new approach to game latency reduction", "transed": 1, "url": "https://ishitatsuyuki.github.io/post/latencyflex/", "via": "", "real_tags": ["游戏", "减少", "approach", "延迟"]}, {"category": "", "categoryclass": "", "imagename": "540a1edb891c8664b1354ba367265781.jpg", "infoid": 1072618, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一个美丽的仪式，是一个明亮的初级开发商加入团队，采取一些充满热情的任务，并在一次冲刺中汲取生命和欢乐。足够很快，他们坐在规划会议上，悲惨的抱怨，指责谁写过谁写的那个狗屎。对一个完整的团队成员的转型是完整的。他们已成为我们之一。\n有一天，我与我的朋友Torben对编程。 Torben是一位高级开发商，他将介绍给小组的几个月。当我找到一些奇怪的代码时，我遵循了传统。谁愚蠢地写这件事是愚蠢的？我打开了提交日志，第一次，我认可了一个名字：“torben。”\n对于所有抱怨我的垃圾代码抱怨的所有初级开发人员：我明白了。", "note_en": "It is a beautiful rite of passage for a bright-eyed junior developer to join a team, take some tasks full of enthusiasm, and have the life and joy sucked out of them one sprint at a time. Soon enough, they sit in planning meetings, miserably complaining, accusingly asking who wrote that shit.Their transformation to a full team member is complete. They have become one of us.\n I was once that bright-eyed junior developer. Many encounters with PHP4 later could no longer look forward to creating new features. Instead, I looked back and complained about old ones. Trashing legacy software is fun. It creates camaraderie. Who wrote this? What were they thinking? Looking at the commit log showed names that meant nothing to me. Ghosts that moved on long ago, leaving nothing but their shit code.\n One day, I was pair programming with my friend Torben. Torben was a senior developer who introduced me to the team months earlier. When I found some weird code, I followed the tradition. Who was dumb enough to write this? I opened the commit log, and for the first time, I recognized a name: “Torben.”\n Since then, I remind myself that legacy software is written by people like me. Torben had constraints I knew nothing about. He worried about deadlines long past. Torben had learned a lot since then. Development workflows had evolved, infrastructure had gotten better.\n And to all the junior developers who have complained to my face about my trash code: I forgive you, I understand.", "posttime": "2022-01-10 22:35:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "狗屎,wrote,torben", "title": "谁写了这个狗屎？", "title_en": "Who Wrote This Shit?", "transed": 1, "url": "https://www.heltweg.org/posts/who-wrote-this-shit/", "via": "", "real_tags": ["狗屎", "wrote", "torben"]}, {"category": "", "categoryclass": "", "imagename": "01f87814bf1883937ba019ba2c7ed720.jpeg", "infoid": 1072616, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "阿什哈巴特，土库曼斯坦（AP） - 土库曼斯坦总统呼吁结束该国最值得注意但地狱的景点 - 炽热的天然气火山口被广泛称为“地狱之门”。\nTurkmen新闻网站Turkmenportal表示，1971年的储气坍塌形成了火山口，直径约60米（190英尺），深20米（70英尺）。为了防止天然气的蔓延，地质学家设置着火，预计煤气在几周内燃烧。\n但贝达姆克烈ov已经命令他的政府寻找燃烧的方法，因为它导致生态损害并影响生活在该地区的人们的健康状况，国家报纸奈伊特里省土库曼斯坦于周六报道。", "note_en": "ASHGABAT, Turkmenistan (AP) — The president of Turkmenistan is calling for an end to one of the country’s most notable but infernal sights — the blazing natural gas crater widely referred to as the “Gates of Hell.”\n The desert crater located about 260 kilometers (160 miles) north of the capital, Ashgabat, has burned for decades and is a popular sight for the small number of tourists who come to Turkmenistan, a country which is difficult to enter.\n The Turkmen news site Turkmenportal said a 1971 gas-drilling collapse formed the crater, which is about 60 meters (190 feet) in diameter and 20 meters (70 feet) deep. To prevent the spread of gas, geologists set a fire, expecting the gas to burn off in a few weeks.\n The spectacular if unwelcome fire that has burned ever since is so renowned that state TV showed President Gurbanguly Berdymukhamedov speeding around it in an off-road truck in 2019.\n But Berdymukhamedov has ordered his government to look for ways to put the fire out because it is causing ecological damage and affecting the health of people living in the area, state newspaper Neitralny Turkmenistan reported Saturday.", "posttime": "2022-01-10 22:24:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "领导者,leader,地狱", "title": "土库曼斯坦的领导者想要“地狱之栅”", "title_en": "Turkmenistan’s leader wants ‘Gates of Hell’ fire put out", "transed": 1, "url": "https://apnews.com/article/business-fires-environment-and-nature-turkmenistan-ashgabat-5aa743375a84ecd181a8f3886e322047", "via": "", "real_tags": ["领导者", "leader", "地狱"]}, {"category": "", "categoryclass": "", "imagename": "8506802762adfeb96cac21bebc2fb568.jpg", "infoid": 1072615, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“那些数字表明，随着三角洲所做的，omicrron在未接受的疾病中造成严重的严重疾病。 ......我们有超过100,000名儿童，我们从未在过以前，在严重的情况下，很多呼吸者。“\n实际上，正如我们所表明的那样，这不是简要说的。事实上，它甚至认为接种疫苗的人可能更有可能捕捉Covid而不是未被移民的个人。 （简介主要是指带有两种疫苗剂量的人作为“疫苗”，而不是也收到助推器的人。）简介“这可能是因为未被接种，恢复的患者比以前从未疫苗的患者更好地保护，而不是omicron。有covid。“", "note_en": "“Those numbers show that omicron is as deadly and causes as much serious disease in the unvaccinated as delta did. … We have over 100,000 children, which we’ve never had before, in serious condition and many on ventilators.”\n Several readers questioned these remarks by Sotomayor, made during a hearing on whether the Biden administration’s nationwide rules ordering a vaccination-or-testing requirement on large employers were constitutional. Her remarks came during an exchange with Ben Flowers, Ohio’s solicitor general, as he referred to  a brief filed by the American Commitment Foundation, which argued that the rise of the omicron variant had made the vaccine rules less relevant because vaccines do not appear especially effective against it.\n   (We will not address remarks made by Justice Neil M. Gorsuch, which some readers also thought were wrong. The official court transcript  suggested he had made an inflated statement about the annual flu: “Flu kills — I believe — hundreds of thousands of people every year.” The flu kills between 12,000 and 52,000 people in the United States a year, but  the audio of the argument shows Gorsuch actually said that “flu kills, I believe, hundreds, thousands of people every year.” So the transcript is incorrect.)\n  The brief in question sought to update the court on latest scientific and technical information on the omicron variant, as that had emerged with force after the mandate was proposed. Epidemiologists  Jay Bhattacharya of Stanford University and  Andrew Bostom, who says he is affiliated with Brown University, helped advise on it.\n   Its key argument, citing data from countries such as South Africa and Denmark, was that omicron cases were 80 percent less likely to get hospitalized (South Africa) and three times less likely to end up with hospital admissions than the delta variant (Denmark). Moreover, the brief argued, the case fatality rate in South Africa plunged dramatically when omicron became dominant.\n  Flowers, who said he had been twice vaccinated and received a booster, participated remotely after testing positive for covid. His symptoms  were said to be “exceptionally mild.”\n “My presence here as a triple vaccinated individual by phone” suggested “vaccines do not appear to be very effective in stopping the spread or transmission,” he said, though he added that vaccines are effective at preventing “severe consequences.” That’s when Sotomayor interrupted him to assert “those numbers show that omicron is as deadly and causes as much serious disease in the unvaccinated as delta did.” She argued that “saying it’s a different variant just underscores the fact” a workplace rule was needed.\n   Actually, as we have shown, that’s not what the brief said. In fact, it even argued that vaccinated individuals might be more likely to catch covid rather than unvaccinated individuals. (The brief refers mainly to people with two vaccine doses as “vaccinated,” not people who also received a booster.) The brief suggests “this may be because unvaccinated, covid-recovered patients have better protection versus omicron than vaccinated patients who never previously had covid.”\n Nevertheless, the spike in cases has led to increased hospitalizations, Sotomayor noted during the exchange. Almost 30 percent of intensive-care beds are filled with covid patients as of Jan. 8,  according the Health and Human Services Department data.\n But then Sotomayor went off the rails: “We have over 100,000 children, which we’ve never had before, in serious condition and many on ventilators.”\n   That’s wildly incorrect, assuming she is referring to hospitalizations, given the reference to ventilators.  According to HHS data, as of Jan. 8 there are about 5,000 children hospitalized in a pediatric bed, either with suspected covid or a confirmed laboratory test. This figure includes patients in observation beds. So Sotomayor’s number is at least 20 times higher than reality, even before you determine how many are in “serious condition.”\n Moreover,  according to the Centers for Disease Control and Prevention, there have been less than 100,000 — 82,843 to be exact — hospital admissions of children confirmed with covid since Aug. 1, 2020.\n Still, the current seven-day average (Dec. 30-Jan. 5) is 797, which is a sharp increase from the week before (441) and represents the peak seven-day average for children, the CDC said. So Sotomayor is not wrong to suggest the rate of pediatric admissions is cause for concern. On Monday, the American Academy of Pediatrics  reported a sharp rise in pediatric cases, with many of the children unvaccinated. (Some children are hospitalized for other reasons and then test positive for covid through screenings at the hospital.)\n     It’s important for Supreme Court justices to make rulings based on correct data. There has been a spike in pediatric cases with covid, even if the omicron variant appears less deadly. But Sotomayor during an oral argument offered a figure — 100,000 children in “serious condition … many on ventilators” — that is absurdly high. She earns Four Pinocchios.", "posttime": "2022-01-10 22:02:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "covid,false,接种", "title": "Sotomayor的虚假声称“超过100k”的孩子们与covid处于“严重状态”", "title_en": "Sotomayor’s false claim ‘over 100K’ kids are in 'serious condition’ with Covid", "transed": 1, "url": "https://www.washingtonpost.com/politics/2022/01/08/sotomayors-false-claim-that-over-100000-children-are-serious-condition-with-covid/", "via": "", "real_tags": ["covid", "false", "接种"]}, {"category": "", "categoryclass": "", "imagename": "1a0ba5ceeb8b4da8ff344792f2dede47.jpg", "infoid": 1072614, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "优步首席执行官Dara Khosrowshahi在12月向一批银行家们向12月安抚了对新欧盟法规的投资者，即使根据规则，他的公司也可以继续茁壮成长，这将迫使员工雇用司机。\n2020年，由于GIG公司在加州法院在加利福尼亚州的法律中讨论了法律，Khosrowshahi漂浮了暂时暂停整个国家服务的可能性。该法律现已部分废除，遵守乘车和交付司机，旨在将分类为独立承包商。\n在U.K.决定之后，Khosrowshahi发表了一项关于裁决和治疗司机作为工人的舆论栏目。 “在上个月的英国最高法院裁决之后，我们本可以继续在法庭上的任何这些保护方面争夺司机的权利。相反，我们决定转动该页面。从今天开始，英国的优步司机将被视为工人，“Khosrowshahi写道。\n“优步总是表示，它不能适应员工模型，这是加州劳工联合会的发言人的最低工资和组合的最低工资和权利的权利，即加州劳工联合会的发言人，在一份声明中拦截。", "note_en": "Uber CEO Dara Khosrowshahi reassured investors concerned about new European Union regulations in December, telling a group of bankers that his company can continue to thrive even under rules that would force it to hire drivers as employees.\n “We can make any model work,” Khosrowshahi said when asked about potential EU legislation that would require Uber to designate drivers as employees or provide additional rights such as vacation time and a pension.\n  Speaking by video at a December 14 “fireside chat” hosted by the Swiss bank UBS, Khosrowshahi told investors that recent decisions in Spain and the United Kingdom have not drastically harmed the company. In the past year, both countries have enacted rules compelling gig companies to provide more worker protections to drivers.\n “Spain business is up close to 40 percent on a year-on-year basis, and Spain EBITDA margins are very close to our overall long-term margins as well,” noted Khosrowshahi, referencing the company’s cash flow before taxes and interest.\n “There’s a lot of demand for our technology, our service, our brand, our safety, our reliability. So any model can work economically for us,” he added.\n  The Uber CEO’s nonchalant remarks appear to contradict the company’s stance in the United States.\n The classification of gig economy drivers has become one of the most contentious modern labor industry issues in the U.S., where an estimated 59 million total gig workers labor without benefits, guaranteed hours, or the protection of a union. Uber has been a leading force in preserving this gig structure, pouring over $190 million into a ballot measure in California alone to reverse rules that granted most drivers employee status. The regulations, passed by the California State Assembly in 2019 as Assembly Bill 5, or A.B. 5, aimed to make these workers eligible for minimum wage, union membership, and health care benefits.\n In 2020, as gig companies fought the law in California courts, Khosrowshahi  floated the possibility of temporarily suspending services in the entire state. The law has now been partially repealed, keeping the ride-hailing and delivery drivers it was designed to convert classified as independent contractors.\n Uber has preserved its focus on maintaining this classification in every market in which it operates. The company is currently spending millions of dollars on advocacy to enshrine independent contractor status laws for drivers in Illinois, Massachusetts, New York, and  other states that have considered gig labor reform.\n Employer costs for employee benefits tend to be higher in the U.S. than in Europe, given the U.S. system of employer-provided health coverage. In many European states, the government provides health benefits and directly limits health care costs.\n But the political environment is different across the Atlantic in many other ways. Despite a string of lobbying victories in the U.S. around the driver classification issue, the tides have recently turned in Europe, where the courts and elected officials are more aligned with labor interests.\n Last August, Spain enacted the “Rider Law,” which requires gig food delivery companies to classify drivers as employees. Uber  lashed out in response, claiming that such rules “directly hurt thousands of couriers who use food delivery apps for much-needed flexible earnings opportunities and made it clear they do not want to be classified as employees.”\n Like in the U.S., independent contractors in Spain are not afforded a number of employer-provided benefits, such as paid leave, and are excluded from joining unions or collective bargaining agreements. Under the new law, Just Eat, Europe’s largest gig economy food delivery platform, signed a contract with Spanish unions CCOO and UGT for a higher hourly rate, extended vacation, a maximum working day of nine hours, and other protections. Uber Eats, however, responded by hiring a fleet of drivers through third-party employment agencies, an arrangement that helps the California-based firm avoid direct management of its drivers while complying with the Spanish labor law.\n In the U.K., courts ruled last year that Uber must classify 70,000 drivers as “workers.” The worker classification, a technical distinction from either an independent contractor or employee under British labor law, allows drivers to receive a minimum wage, vacation time, and access to a pension plan.\n In the wake of the U.K. decision, Khosrowshahi  published an opinion column pledging to respect the ruling and treat drivers as workers. “Following last month’s UK Supreme Court ruling, we could have continued to dispute drivers’ rights to any of these protections in court. Instead, we have decided to turn the page. Beginning today, Uber drivers in the UK will be treated as workers,”  Khosrowshahi wrote.\n  The series of defeats for Uber’s management could roll into a much larger setback, as the EU is now considering federation-wide adoption of Spain’s gig economy law. The European Trade Union Confederation said that the EU “must” follow Spain’s lead and adopt a similar law, a push that is growing in the European Parliament.\n While conceding defeat in the U.K., Uber has continued to oppose Spain’s Rider Law and has employed lobbyists in Brussels to prevent a similar statute from being enacted across the EU. By revealing Uber’s continued business success in Spain despite the enhanced worker protections, last month’s investor call belies the company’s advocacy.\n Asked for comment about Khosrowshahi’s apparent reversal, Uber emphasized its focus on treating drivers as independent contractors.\n “Poll after poll shows that drivers overwhelmingly want to remain independent contractors and work where and when they want — but they also deserve more protections,” wrote Uber spokesperson Noah Edwardsen in an email to The Intercept.\n “In Europe, Accenture, Good Work, Oxford Economics and the latest studies from Copenhagen Economics (based on a survey of 16k European couriers) as well as Compass Lexecon make it clear the #1 reason people access platform work is for flexibility to earn money while balancing other commitments, and would prefer to remain independent. This is why we believe the best answer is to provide new benefits, while ensuring drivers and couriers keep the flexibility they value,” Edwardsen continued.\n But labor advocates see a company that is merely forced to comply with the rules and will stop at nothing to maximize profit for executives and shareholders.\n “Uber has always said it couldn’t adapt to an employee model that afforded its drivers fundamental protections in law like a minimum wage and the right to form a union,” wrote Steve Smith, a spokesperson for the California Labor Federation, in a statement to The Intercept.\n “Dara Khosrowshahi’s acknowledgement that the company can — and has — adapted to treating workers as employees in other countries is a slap in the face to every single driver in the US that Uber continues to exploit,” Smith added. “It boils down to pure greed of wealthy executives who will do anything in their power to lock workers out of having a share of the profits their labor creates.”\n Wait! Before you go  on about your day, ask yourself: How likely is it that the story you just read would have been produced by a different news outlet if The Intercept hadn’t done it?Consider what the world of media would look like without The Intercept. Who would hold party elites accountable to the values they proclaim to have? How many covert wars, miscarriages of justice, and dystopian technologies would remain hidden if our reporters weren’t on the beat?The kind of reporting we do is essential to democracy, but it is not easy, cheap, or profitable. The Intercept is an independent nonprofit news outlet. We don’t have ads, so we depend on our members — 35,000 and counting — to help us hold the powerful to account. Joining is simple and doesn’t need to cost a lot: You can become a sustaining member for as little as $3 or $5 a month. That’s all it takes to support the journalism you rely on.  Become a Member\n      Join the conversation", "posttime": "2022-01-10 21:27:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "商业,首席,opposing,司机", "title": "由于优步保留了对抗西班牙的法律将司机视为与类似法规的员工和大小说，其首席执行官声称这些规则不会破坏其商业模式", "title_en": "As Uber keeps opposing Spain's law to treat drivers as employees and lobbies against similar statutes, its CEO claims such rules don't break its business model", "transed": 1, "url": "https://theintercept.com/2022/01/07/uber-drivers-labor-protections-dara-khosrowshahi-european-union/", "via": "", "real_tags": ["商业", "首席", "opposing", "司机"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072611, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "____ / ____（__________）（OO）\\ _______（__）\\。 。 ）\\ / \\ u || ---- v || || || _ _ _ / + ____ / + ___ | \\ | | \\ | | / ___ | _ \\ | \\ | | \\ | | | | | _）|| | \\ | | \\ | | ___ | __ / | _ | \\ _ | _ | \\ _ | \\ ____ | _ |", "note_en": "____/\\____ (__________) (oo)\\_______ (__)\\ . . )\\/\\ U ||----v|| || || _ _ _ /+ ____/+___| \\ | | \\ | |/ ___| _ \\| \\| | \\| | | | |_) || |\\ | |\\ | |___| __/|_| \\_|_| \\_|\\____|_|\n NNCP (Node to Node copy) is a collection of utilitiessimplifying secure store-and-forward files, mail and command exchanging.\n  This utilities are intended to help build up small size (dozens ofnodes) ad-hoc  friend-to-friend (F2F) statically routed darknet delay-tolerantnetworks for fire-and-forget secure reliable files, file requests,Internet mail and commands transmission. All packets are integritychecked,  end-to-end encrypted, explicitly authenticated by known participantspublic keys.  Onionencryption is applied to relayed packets. Each node acts both as aclient and server, can use push and poll behaviour model.Also there is  multicasting areas support.\n Out-of-box offline  sneakernet/floppynet,  dead drops, sequential and append-only CD-ROM/ tape storages, air-gappedcomputers support. But online TCP daemon with full-duplex resumable datatransmission exists.\n  NNCP is  copylefted free softwarelicenced under  GNU GPLv3.It should work on all  POSIX-compatible systems. Easy  integration with existing SMTP servers. Single Hjson configuration file.\n Why create yet another store-and-forward solution when UUCP, FTN andeven SMTP exists? Look in  comparison section!Simplicity, cryptographic security, sneakernet compatibility and easyintegration with current SMTP servers are the reasons.", "posttime": "2022-01-10 20:22:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "节点,node,oo", "title": "NNCP：节点到节点复制", "title_en": "NNCP: Node to Node Copy", "transed": 1, "url": "http://www.nncpgo.org/", "via": "", "real_tags": ["节点", "node", "oo"]}, {"category": "", "categoryclass": "", "imagename": "4861ceb0c0662115cdc268c83880f449.jpeg", "infoid": 1072610, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该资金由Balderton Capital领导，全球创始人资本（该公司与Rocket Internet的Samwer家族有关），Burda首席投资，La Famiglia和468资本也参与。 （La Famiglia和468资本都是慕尼黑的屡付金属，既是为本公司投资的种子，这并不是与美国美国同名的抵押贷款启动混淆\nReeker告诉我，实际上释放了在某些市场中这些初创公司的供过于求 - 事实上，泡沫肯定开始为其中一些初创公司爆发，因为他们被抢购了更大，高度大写的竞争对手，希望扩展到新的地理位置因为它们成为一个灭绝的信号，所以应该考虑扩展到下一个。", "note_en": "The funding is being led by Balderton Capital, with Global Founders Capital (the firm connected to Rocket Internet’s Samwer family), Burda Principal Investments, La Famiglia and 468 Capital also participating. (La Famiglia and 468 Capital are repeat backers of Munich-based Arive, both having invested in the seed round for the company, which is not to be confused with the  mortgage startup of the same name in the U.S.)\n Arive’s funding, and list of backers, is notable in that it’s based on a pretty limited run so far. The startup launched only four months ago and is currently active in just four cities in Germany — Berlin, Hamburg, Munich and Frankfurt — although now the idea will be to use the investment to expand further across the country and to start considering which other markets to tackle next.\n  The reason for the vote of confidence is that so far, the numbers look promising. Arive is not disclosing how many customers it has or what its revenues are looking like, but it notes that the average order size is between €50 and €100 ($56 and $113) across some 1,000 SKUs, with the average basket containing between one and four items. That presents what Arive is doing as a very different proposition to what, say, a GoPuff or Getir is hoping to achieve with its instant delivery model, essentially replacing the weekly grocery shop with multiple baskets delivered to one’s door.\n “It’s not just about being the next quick commerce vertical but building the next generation of e-commerce,” said Maximilian Reeker, who co-founded Arive with Linus Fries (the two co-lead the company). He described that next generation like this: “Very convenient delivery of between 30 and 60 minutes, connecting people to local stores with a bike-based service, in an app optimized for the phone.” All of its couriers are employed by the company, either full-time or part-time.\n Arive has up to now split the model into three parts, providing consignment, wholesale and, in the next 2-3 months, marketplace options for sourcing supply. Fries said that currently the wholesale part accounts for the largest part of its business and sales.\n Beyond that, white label services — where Arive might sell its backend technology and delivery infrastructure to third-party retailers to build their own instant delivery services — is another area that the company is considering, Fries said. This could be a very interesting opportunity in areas such as fashion: typically online sales of clothes have been challenged by issues of sizing and dealing with returns, which make for a high barrier of entry for a company like Arive without making extensive and focused investments to address them. What it could do, however, is provide its technology to fashion brands and retailers that have, who are considering ways of getting apparel faster to would-be online buyers.\n  Meanwhile, although it’s taking a different approach in instant delivery by eschewing groceries and  FMCG essentials and focusing on higher-ticket slower-moving consumer goods, Arive is still operating very much with those grocery delivery startups in mind for another reason.\n Reeker told me that Arive actually relishes the oversupply of these startups in certain markets — indeed, the bubble has definitely started to burst for some of these startups, as they get  snapped up by much larger and highly capitalized rivals looking to expand to new geographies — because they become a signal for where Arive should be considering to expand to next.\n “We want to go to more places in Germany and expand internationally, and while we haven’t decided which cities, we looking at those where existing grocery plays are live,” said Reeker. “The UK, France, they are all interesting. Having those grocery companies there is an advantage for us because it’s evidence of the consumer shift that has taken place. They are already used to getting their food quickly, which is the first step.”\n Arive is not the first company to have thought of building a service around instant delivery of virtually any kind of item a person might like to have without leaving their homes to buy it. This was basically the premise behind Amazon Prime Now, which the e-commerce giant launched the service in  2014. Pointedly, although Amazon expanded it to several markets, eventually it  discontinued the standalone app and branding it had built for Prime Now, which now exists as a faster-delivery option for some of the items that it sells via Prime.\n The message there could be interpreted in two ways. It could point to challenges for scaling something like a fast-delivery service without also providing a wider range of options that offer cheaper options and longer delivery times to customers put off by the premium that comes with instant.\n Or, it could point to how there remains an opportunity for a smaller and more focused company to get the model right, understanding that the market has matured in the last eight years and consumers are not only more willing to shop online than ever before due to Covid-19, but have focused their expectations of how that experience should more closely mirror the instant-gratification of shopping in person.\n Investors are willing to bet that the two co-founders — which hatched the idea of Arive while at business school — have a shot in building something fit the latter of those.\n “Linus, Max, and the entire team at arive are challenging e-commerce conventions with energetic execution and an acute sensitivity to the priorities of modern brands,” said Colin Hanna, partner at Balderton Capital, in a statement. “Using light electric vehicles to rapidly fulfill orders leaves a lighter footprint on our planet and ensures that customers are home to receive goods they’ve purchased online, avoiding costly failed deliveries. The team is also committed to building their UX in a way that protects, rather than erodes, the value of the brands they are lucky to work with. Finally, high basket sizes and no wastage means the company has a much stronger path to a sustainable business model over the long run.  Balderton is fortunate to be backing arive as it scales rapidly across Europe.”", "posttime": "2022-01-10 19:38:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "服务,delivery", "title": "在杂货和必需品超越杂货和必需品的即时送货服务，呈现20米", "title_en": "\n\t\t\t\tArive raises $20M for an instant delivery service beyond groceries and essentials\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/01/10/arive-raises-20m-for-an-instant-delivery-service-beyond-groceries-and-essentials/", "via": "", "real_tags": ["服务", "delivery"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072609, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当您在自然保护区工作时，每天都有不同的，但没有任何内容可以在卢特兰水自然保护区举行的储备团队在他们使古绿语发现一生中的一天。", "note_en": "Every day is different when you work on a nature reserve, but nothing could have prepared our reserves team at Rutland Water Nature Reserve for the day when they made the palaeontological discovery of a lifetime.", "posttime": "2022-01-10 19:27:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "英国,largest,自然保护区", "title": "英国最大的“海龙”在英国最小的县发现", "title_en": "Britain's largest 'Sea Dragon' discovered in UK's smallest county", "transed": 1, "url": "https://www.lrwt.org.uk/seadragon", "via": "", "real_tags": ["英国", "largest", "自然保护区"]}, {"category": "", "categoryclass": "", "imagename": "99b914602dae1449ee970d836ee480ad.jpeg", "infoid": 1072608, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "近两年，我们有 - 新闻界和人口 - 当局的每日冠状动脉几乎催眠。\n换句话说，这里有一些不值得“超级”一词。无论是疫苗，医院还是它的混合，每个人的出价都是。但潮力人士与人口的沟通通常应该不应该“超级”一词。相反。", "note_en": "I NÆSTEN to år har vi – pressen og befolkningen – været nærmest hypnotisk optagede af myndighedernes daglige coronatal.\n VI HAR STIRRET på tal-pendulets svingninger, når det gjaldt smittede, indlagte og døde med corona. Og vi har fået betydningen af pendulets mindste bevægelser udlagt af eksperter, politikere og myndigheder, som konstant har advaret os om det slumrende corona-monster under vores senge. Et monster, der bare venter på, at vi falder i søvn, så det kan slå til i nattens mulm og mørke.\n DET KONSTANTE mentale alarmberedskab har slidt enormt på os alle sammen. Derfor må vi – pressen – også gøre status over vores egen indsats. Og vi har fejlet.\n  VI HAR IKKE været vakse nok ved havelågen, når myndighederne skulle afkræves svar på, hvad det konkret betød, at folk er indlagt med corona og ikke på grund af corona. For det gør en forskel. En stor forskel. Helt præcist har de officielle indlæggelsestal vist sig at være 27 procent højere end det reelle tal for, hvor mange der er på sygehuset, alene fordi de har corona. Det ved vi først nu.\n DET ER SELVFØLGELIG først og fremmest myndighederne, der har ansvaret for at oplyse befolkningen korrekt, præcist og ærligt. Tallene for, hvor mange der er syge og døde af corona, skulle af indlysende grunde have været offentliggjort for længst, så vi fik det klareste billede af monstret under sengen.\n I DET HELE TAGET lader myndighedernes og politikernes beskeder til befolkningen i denne historiske krise meget tilbage at ønske. Og derfor ligger de, som de har redt, når dele af befolkningen mister tillid til dem.\n ET ANDET eksempel: Vaccinerne bliver konsekvent omtalt som vores ’supervåben’. Og vores sygehuse kaldes ’supersygehuse’. Ikke desto mindre er disse supersygehuse åbenbart maksimalt pressede, selvom næsten hele befolkningen er bevæbnet med et supervåben. Selv børn er vaccineret i enormt omfang, hvilket man ikke har gjort i vore nabolande.\n DER ER MED ANDRE ord et eller andet her, der ikke fortjener betegnelsen ’super’. Om det er vaccinerne, sygehusene eller en blanding af det hele, er hver mands bud. Men magthavernes kommunikation til befolkningen fortjener i hvert fald på ingen måde betegnelsen ’super’. Tværtimod.", "posttime": "2022-01-10 19:25:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "covid,danish,人口", "title": "主要丹麦报纸仅为政府Covid叙述道歉", "title_en": "Major Danish newspaper apologises for only covering government Covid narrative", "transed": 1, "url": "https://ekstrabladet.dk/nyheder/lederen/vi-fejlede/9072013", "via": "", "real_tags": ["covid", "danish", "人口"]}, {"category": "", "categoryclass": "", "imagename": "ab8f4a70a3515e6d7e1f429e370f003e.jpg", "infoid": 1072607, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "采矿比特币是植物上最有利可图的业务之一 - 但它也消耗了太多的能源，以便不断增长的国家名单。", "note_en": "Mining Bitcoin is one of the most profitable businesses on the plant—but it also consumes too much energy for a growing list of nations.", "posttime": "2022-01-10 19:24:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "比特币,采矿,mining,业务", "title": "比特币采矿正在全球各国被禁止", "title_en": "Bitcoin mining is being banned in countries across the globe", "transed": 1, "url": "https://fortune.com/2022/01/05/crypto-blackouts-bitcoin-mining-bans-kosovo-iran-kazakhstan-iceland/", "via": "", "real_tags": ["比特币", "采矿", "mining", "业务"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072606, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "律师说，维尔纽斯黑色网站允许酷刑的薪酬拨款表明，律师说\n“当您向某人和全世界支付100,000欧元时，Zubaydah Zubaydah的法律团队之一向监护人表示，当您支付10万欧元的情况时，情况较少。\n欧洲法官听说Zubaydah在立陶宛时不太可能遭受最严重的酷刑形式。但他受到仍然酷刑的技术，律师争论，包括感官和睡眠剥夺，单独监禁，大声噪音和苛刻的光线。", "note_en": "Compensation for allowing torture at Vilnius black site indicates changing attitudes in Washington, lawyers say\n    Lithuania has paid more than $110,000 to Abu Zubaydah, the Guantánamo detainee  known as the “forever prisoner”, in compensation for having allowed the CIA to hold him at a secret site outside Vilnius where he was subjected to forms of torture.\n   The €100,000 ($113,500) payment comes more than three years after the European Court of Human Rights  ordered the Lithuanian government to pay compensation for violating European laws banning the use of torture.\n It marks a significant shift in the treatment of Zubaydah, who has been detained by the US without charge for more than 20 years.\n Zubaydah was captured in Pakistan six months after 9/11. The  CIA and lawyers for the Bush administration attempted to justify his torture by claiming he was a very senior figure in al-Qaida. It emerged that he was not a member of the organisation and he has never been charged with involvement in 9/11.\n For much of the time since his arrest, Zubaydah has been held incommunicado, at the insistence of the CIA as part of its efforts to prevent details of his torture from becoming public.\n Lawyers for Zubaydah believe it is highly unlikely that  Lithuania would have made the compensation payment without approval from Washington.\n “The situation is a lot less incommunicado when you pay €100,000 to someone and the whole world knows about it,” Mark Denbeaux, one of Zubaydah’s legal team based in the US, told the Guardian.\n  “This move is consistent with the idea that the US is softening its position on the detention of the forever prisoners. The US could clearly have kept Lithuania from handing over this money and the question is, why didn’t they?”\n News of the Lithuanian payment comes just days before the 20th anniversary of the military prison at Guantánamo, which  received its first detainees on 11 January 2002. In recent months there have been other signs of a shifting attitude towards Zubaydah and the torture that was inflicted upon him by CIA agents and contractors.\n In October, the US supreme court  heard arguments in a case in which the US government is seeking to block two CIA contractors from testifying in Poland about torture Zubaydah suffered in 2002 and 2003 at a secret or “black” site in that country. In the course of the hearing, several of the justices, including conservatives, broke a legal taboo by  openly using the word “torture”.\n In Zubaydah’s case against Lithuania, which was led on the European side by his lawyer Helen Duffy, the European Court of Human Rights  heard that Zubaydah was held at a CIA black site in that country from February 2005 to March 2006. The site, codenamed Violet, was on the outskirts of Vilnius.\n The most brutal forms of torture endured by Zubaydah occurred in 2002 when he was held at a CIA black site in Thailand. An entire program of torture, euphemistically referred to by the CIA as “enhanced interrogation techniques”, was devised for the prisoner by two psychologists under contract to the agency.\n  Zubaydah was waterboarded – a type of controlled drowning – at least 83 times in August 2002, as well as being placed in a coffin-sized box for days on end.\n European judges heard that Zubaydah was unlikely to have suffered from the harshest forms of torture while in Lithuania. But he was subjected to techniques that still amounted to torture, lawyers argued, including sensory and sleep deprivation, solitary confinement, loud noise and harsh light.\n The money transferred by Lithuania is now in a bank account. Zubaydah is unable to receive the sum given his detention in Guantánamo and because his assets have been frozen by the US treasury.\n A similar freezing of his assets by the United Nations security council was reversed two years ago, after a petition by his lawyers.", "posttime": "2022-01-10 19:24:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "abu,pays,zubaydah", "title": "立陶宛支付Guanteránamo永远囚犯Abu Zubaydah€100000在CIA酷刑", "title_en": "Lithuania pays Guantánamo forever prisoner Abu Zubaydah €100000 over CIA torture", "transed": 1, "url": "https://www.theguardian.com/us-news/2022/jan/10/lithuania-pays-guantanamo-forever-prisoner-abu-zubaydah-100000-cia-torture", "via": "", "real_tags": ["abu", "pays", "zubaydah"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072605, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我Saac Newton Apocryphally发现了他的第二律 - 关于引力的一个 - 在苹果摔倒在他的脑袋之后。稍后的实验和数据分析，他意识到了力量，质量和加速之间存在基本关系。他制定了一个理论来描述这种关系 - 可以表达为等式的关系，f = ma  - 并用它来预测苹果以外的物体的行为。他的预测结果是对的（如果并不总是足够精确，因为那些稍后的人）。\n第二个是人类对无理论科学来说非常不舒服。我们不喜欢处理黑匣子 - 我们想知道为什么。\n普林斯顿心理学家在现有理论中延伸仍然可以解释的是可解释的。但随着他们揭示越来越复杂的，它将变得更少 - 这一过程的逻辑高潮是Facebook或alphafold体现的无论是无论无论是无论如何的预测发动机。\nAi Sumit Chopra是一个考虑机器学习在纽约大学的医疗保健的科学家，给出了MRI图像的例子。它需要很多原始数据 - 因此扫描时间 - 产生这样的图像，这不一定是您的目标是准确检测，例如癌症的最佳使用该数据。您可以培训AI以确定原始数据的较小部分足以产生准确的诊断，而是通过其他方法验证，并且实际上是Chopra的组已经这样做。但放射科医生和患者仍然依赖于图像。 “我们人类更舒适地对我们的眼睛可以解释的2D形象，”他说。", "note_en": "I saac Newton apocryphally discovered his second law – the one about gravity – after an apple fell on his head. Much experimentation and data analysis later, he realised there was a fundamental relationship between force, mass and acceleration. He formulated a theory to describe that relationship – one that could be expressed as an equation, F=ma – and used it to predict the behaviour of objects other than apples. His predictions turned out to be right (if not always precise enough for those who came later).\n Contrast how science is increasingly done today. Facebook’s  machine learning tools predict your preferences better than any psychologist. AlphaFold, a program built by DeepMind, has produced the most  accurate predictions yet of protein structures based on the amino acids they contain. Both are completely silent on why they work: why you prefer this or that information; why this sequence generates that structure.\n   You can’t lift a curtain and peer into the mechanism. They offer up no explanation, no set of rules for converting this into that – no theory, in a word. They just work and do so well. We witness the social effects of Facebook’s predictions daily. AlphaFold has yet to make its impact felt, but  many are convinced it will change medicine.\n Somewhere between Newton and Mark Zuckerberg, theory took a back seat. In 2008, Chris Anderson, the then editor-in-chief of  Wired magazine,  predicted its demise. So much data had accumulated, he argued, and computers were already so much better than us at finding relationships within it, that our theories were being exposed for what they were – oversimplifications of reality. Soon, the old scientific method – hypothesise, predict, test – would be relegated to the dustbin of history. We’d stop looking for the causes of things and be satisfied with correlations.\n  With the benefit of hindsight, we can say that what Anderson saw is true (he wasn’t alone). The complexity that this wealth of data has revealed to us cannot be captured by theory as traditionally understood. “We have leapfrogged over our ability to even write the theories that are going to be useful for description,” says computational neuroscientist Peter Dayan, director of the Max Planck Institute for Biological Cybernetics in Tübingen, Germany. “We don’t even know what they would look like.”\n But Anderson’s prediction of the end of theory looks to have been premature – or maybe his thesis was itself an oversimplification. There are several reasons why theory refuses to die, despite the successes of such theory-free prediction engines as  Facebook and AlphaFold. All are illuminating, because they force us to ask: what’s the best way to acquire knowledge and where does science go from here?\n The first reason is that we’ve realised that artificial intelligences (AIs), particularly a form of machine learning called neural networks, which learn from data without having to be fed explicit instructions, are themselves fallible. Think of the prejudice that has been documented in  Google’s search engines and  Amazon’s hiring tools.\n The second is that humans turn out to be deeply uncomfortable with theory-free science. We don’t like dealing with a black box – we want to know  why.\n And third, there may still be plenty of theory of the traditional kind – that is, graspable by humans – that usefully explains much but has yet to be uncovered.\n So theory isn’t dead, yet, but it is changing – perhaps beyond recognition. “The theories that make sense when you have huge amounts of data look quite different from those that make sense when you have small amounts,” says Tom Griffiths, a psychologist at Princeton University.\n Griffiths has been using neural nets to help him improve on existing theories in his domain, which is human decision-making. A popular theory of how people make decisions when economic risk is involved is prospect theory, which was formulated by behavioural economists Daniel Kahneman and Amos Tversky in the 1970s (it later won Kahneman a Nobel prize). The idea at its core is that people are sometimes, but not always, rational.\n  In  Science last June,  Griffiths’s group described how they trained a neural net on a vast dataset of decisions people took in 10,000 risky choice scenarios, then compared how accurately it predicted further decisions with respect to prospect theory. They found that prospect theory did pretty well, but the neural net showed its worth in highlighting where the theory broke down, that is, where its predictions failed.\n These counter-examples were highly informative, Griffiths says, because they revealed more of the complexity that exists in real life. For example, humans are constantly weighing up probabilities based on incoming information, as prospect theory describes. But when there are too many competing probabilities for the brain to compute, they might switch to a different strategy – being guided by a rule of thumb, say – and a stockbroker’s rule of thumb might not be the same as that of a teenage  bitcoin trader, since it is drawn from different experiences.\n “We’re basically using the machine learning system to identify those cases where we’re seeing something that’s inconsistent with our theory,” Griffiths says. The bigger the dataset, the more inconsistencies the AI learns. The end result is not a theory in the traditional sense of a precise claim about how people make decisions, but a set of claims that is subject to certain constraints. A way to picture it might be as a branching tree of “if… then”-type rules, which is difficult to describe mathematically, let alone in words.\n  What the Princeton psychologists are discovering is still just about explainable, by extension from existing theories. But as they reveal more and more complexity, it will become less so – the logical culmination of that process being the theory-free predictive engines embodied by Facebook or AlphaFold.\n Some scientists are comfortable with that, even eager for it. When voice recognition software pioneer Frederick Jelinek said: “Every time I fire a linguist, the performance of the speech recogniser goes up,” he meant that theory was holding back progress – and that was in the 1980s.\n Or take protein structures. A protein’s function is largely determined by its structure, so if you want to design a drug that blocks or enhances a given protein’s action, you need to know its structure. AlphaFold was trained on structures that were derived experimentally, using techniques such as X-ray crystallography and at the moment its predictions are considered more reliable for proteins where there is some experimental data available than for those where there is none. But its reliability is improving all the time, says Janet Thornton, former director of the EMBL European Bioinformatics Institute (EMBL-EBI) near Cambridge, and it isn’t the lack of a theory that will stop drug designers using it. “What AlphaFold does is also discovery,” she says, “and it will only improve our understanding of life and therapeutics.”\n  Others are distinctly less comfortable with where science is heading. Critics point out, for example, that neural nets can throw up spurious correlations, especially if the datasets they are trained on are small. And all datasets are biased, because scientists don’t collect data evenly or neutrally, but always with certain hypotheses or assumptions in mind, assumptions that worked their way damagingly into Google’s and Amazon’s AIs. As philosopher of science Sabina Leonelli of the University of Exeter explains: “The data landscape we’re using is incredibly skewed.”\n But while these problems certainly exist, Dayan doesn’t think they’re insurmountable. He points out that humans are biased too and, unlike AIs, “in ways that are very hard to interrogate or correct”. Ultimately, if a theory produces less reliable predictions than an AI, it will be hard to argue that the machine is the more biased of the two.\n A tougher obstacle to the new science may be our human need to explain the world – to talk in terms of cause and effect. In 2019, neuroscientists Bingni Brunton and Michael Beyeler of the University of Washington, Seattle,  wrote that this need for interpretability may have prevented scientists from making novel insights about the brain, of the kind that only emerges from large datasets. But they also sympathised. If those insights are to be translated into useful things such as drugs and devices, they wrote, “it is imperative that computational models yield insights that are explainable to, and trusted by, clinicians, end-users and industry”.\n “ Explainable AI”, which addresses how to bridge the interpretability gap, has become a hot topic. But that gap is only set to widen and we might instead be faced with a trade-off: how much predictability are we willing to give up for interpretability?\n Sumit Chopra, an AI scientist who thinks about the application of machine learning to healthcare at New York University, gives the example of an MRI image. It takes a lot of raw data – and hence scanning time – to produce such an image, which isn’t necessarily the best use of that data if your goal is to accurately detect, say, cancer. You could train an AI to identify what smaller portion of the raw data is sufficient to produce an accurate diagnosis, as validated by other methods, and indeed Chopra’s group has  done so. But radiologists and patients remain wedded to the image. “We humans are more comfortable with a 2D image that our eyes can interpret,” he says.\n  The final objection to post-theory science is that there is likely to be useful old-style theory – that is, generalisations extracted from discrete examples – that remains to be discovered and only humans can do that because it requires intuition. In other words, it requires a kind of instinctive homing in on those properties of the examples that are relevant to the general rule. One reason we consider Newton brilliant is that in order to come up with his second law he had to ignore some data. He had to imagine, for example, that things were falling in a vacuum, free of the interfering effects of air resistance.\n In  Nature last month, mathematician Christian Stump, of Ruhr University Bochum in Germany,  called this intuitive step “the core of the creative process”. But the reason he was writing about it was to say that for the first time, an AI had pulled it off. DeepMind had built a machine-learning program that had prompted mathematicians towards new insights – new generalisations – in the mathematics of knots.\n In 2022, therefore, there is almost no stage of the scientific process where AI hasn’t left its footprint. And the more we draw it into our quest for knowledge, the more it changes that quest. We’ll have to learn to live with that, but we can reassure ourselves about one thing: we’re still asking the questions. As Pablo Picasso put it in the 1960s, “computers are useless. They can only give you answers.”", "posttime": "2022-01-10 19:22:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "目睹,dawn,预测", "title": "我们是否目睹了理论后科学的曙光？", "title_en": "Are we witnessing the dawn of post-theory science?", "transed": 1, "url": "https://www.theguardian.com/technology/2022/jan/09/are-we-witnessing-the-dawn-of-post-theory-science", "via": "", "real_tags": ["目睹", "dawn", "预测"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072604, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "专家谨慎，国防部的保障措施不会走得得足够远，而且我们在我们所知道的东西上落后于球\n1995年俄克拉荷马城市轰炸造成168人，650多人受伤650岁时，当一份早晨的前军士兵蒂莫西·麦克风和连贯的人泰科尔斯停放了一个租赁卡车，里面装满了美联机外的自制炸药并引爆了。它仍然是美国历史中最致命的国内恐怖主义行为。两名男子题联反政府和种族主义者的信念。\n2018年海洋兰斯兰氏兰斯法利斯瓦西奥·巴斯托斯在2017年夏洛斯维尔的人民袭击人民“团结”反弹之后被监禁。在吹牛与其他atomwaffen成员的聊天中吹牛之后，发现手枪的是Neo-Nazi Group Atomwaffen，最终泄露。\n“严重地？你想和一个股票的家伙一起散步，kkk的成员？这真的是我们想在这里做什么吗？“伊顿说。 “服务成员的想法必须靠近卡片携带骄傲的男孩的成员，只要他们不'3月”，那就是没有得到它。“他加了。\n金匠看到反民主党，白色至高无上的和法西斯主义者，以与国外对手的原因相同。 “退伍军人是一个经济上有效的竞选目标，因为如果你得到一个，他们经常带他们直接的社交圈，”金匠说。", "note_en": "Experts caution the defense department’s safeguards don’t go far enough and that ‘we’re behind the ball on what we know’\n    Fears are growing among experts, politicians, and former generals about the rise of rightwing extremism in the  US military and the potential threat it could pose to American democracy.\n Even as the US Department of Defense issues new policies to root out extremism in its ranks, some experts caution that the safeguards don’t go far enough, leaving the next election vulnerable to attack as well as fears about a broader violent “insurgency” by rightwing radicals.\n   “We’re behind the ball on what we know about domestic terrorists in the United States,” Paul Eaton, a retired US army major general and senior adviser to the non-profit VoteVets, said.\n Eaton and two other retired army generals recently wrote an op-ed in the Washington Post last month warning of the threat of a coup in the 2024 election. The generals warned that it could succeed with the aid of rogue military elements. They contemplated the possibility of a breakdown of the chain of command, along partisan lines, in the aftermath of a contested election with “rogue units organizing among themselves to support the ‘rightful’ commander in chief”.\n Eaton said in an interview that the American military and law enforcement have a history of underestimating the threat from the far right.\n “It’s the Timothy McVeigh problem: what did we know about McVeigh and what were we doing about it?” said Eaton.\n The 1995 Oklahoma City bombing killed 168 people and injured over 650 when one morning ex-army soldiers Timothy McVeigh and co-conspirator Terry Nichols parked a rental truck filled with homemade explosives outside a federal building and detonated it. It remains the deadliest act of domestic terrorism in US history. The two men harbored anti-government and racists beliefs.\n “The McVeighs of the world are still there, we had about 4,500 of them crawling all over the nation’s capitol [during the 6 January attack],” said Eaton, who added that the increased power of the internet and rise of social media had boosted the threat massively since McVeigh’s attack.\n  “The infection of extremism into our state and local police and our armed forces is a very serious concern that needs to be monitored,” said Eaton.\n Eaton added: “There’s a recruiting effort going on locally, they’re going to school boards, like missionaries sent to the islands to convert people. The Proud Boys and Oath Keepers are definitely recruiting.””\n In many ways the aftermath of the attack on the Capitol in Washington DC laid bare the vulnerability of US service members to extremism. The  727 defendants charged in the 6 January Capitol riot include  81 with ties to the military, while five were active duty service members. A 35-year-old woman, air force veteran Ashli Babbitt, was fatally shot while attempting to break the doors into the House chamber.\n The appeal of extremism among active duty and veterans is a longstanding issue with a track record of violent incidents.\n Last year army  private Ethan Phelan Melzer confessed to prosecutors in the southern district of New York to plotting an attack on fellow soldiers in his unit. The federal indictment states that Melzer confessed to sharing sensitive information about his soon-to-deploy unit with members of a neo-Nazi group in order to facilitate an attack that would “result in the deaths of as many of his fellow service members as possible”.\n In 2018 marine lance corporal Vasillios Pistolis was imprisoned after assaulting people at the 2017 Charlottesville “Unite The Right” rally. Pistolis was discovered to belong the neo-Nazi group Atomwaffen after bragging about violence in  chats with other Atomwaffen members, which were eventually leaked.\n From 1990 to July 2021 there have been at least 354 people with military backgrounds that have committed criminal acts motivated by “political, economic, social, or religious goals” according to data collected by  the National Consortium for the Study of Terrorism and Responses to Terrorism at the University of Maryland.\n The data suggest the problem is growing in the US as from 1990-2010 there was an average of six cases a year, but over the last decade “that number has more than tripled to nearly 21 subjects per year”.\n  The generals’ public call for elections safeguards in the military comes as the Pentagon issued new guidelines aimed at rooting out extremism in its ranks. The defense chief, Lloyd Austin, ordered a 60-day “stand down” early last year to come up with rules to stomp out extremism among the military’s various branches. The new rules adopted by the Pentagon last month specify that service members are prohibited from engaging in extremist activities and could face disciplinary action for even “liking” extremist content on social media.\n The new guidance specifies that commanders must not be “indifferent” and hold service members who participate in extremist activity accountable. The Pentagon defines extremism as advocacy for violence to achieve goals that are “political, religious, discriminatory, or ideological in nature”. It includes efforts to overthrow the government and advocating widespread unlawful discrimination “based on race, color, national origin, religion, sex (including pregnancy), gender identity, or sexual orientation”.\n Bu the Pentagon’s effort towards stomping out extremism in the military may not go far enough. An  Associated Press investigation found the new guidelines fail to account for racism among the ranks, membership in groups such as the KKK, and longstanding racial disparities in military justice.\n The new guidelines don’t prohibit membership in extremist groups like the KKK as long as they are not “actively participating”. The new rules attempt to police acts rather than associations or beliefs. Some former military figures say it’s absurd to allow service members to also be members of violent extremist groups.\n “Seriously? You want to be in a foxhole with a guy whose a member of the KKK? Is that really what we want to do here?” said Eaton. “The idea of service members having to be in close proximity to card carrying members of the Proud Boys, as long as they don’t ‘march’, that just doesn’t get it.” he added.\n Some experts also criticize the approach as ignoring the very real threat of white supremacists. “It reflects the institutional bias that permeates all of our government, that even calling out white supremacy is politically fraught,” said Mike German, a former FBI special agent and current Fellow at the Brennan Center for Justice.\n German is concerned the classification has the potential for unintended consequences. “It opens the door to a strange political ‘both sides-ism’,” he said. “The consequence is that somebody expressing anti-racism can be seen as an extremist under that description.”\n Experts see the far-right and other extremists as actively trying to recruit members of the military, including foreign agents seeking to promote disruption within the US.\n “We’re in the early stages of an insurgency in the Untied States,” said Kristofer Goldsmith, an Iraq war veteran and researcher.\n In a 200-page report published by Vietnam Veterans of America, Goldsmith found that between 2017 and 2019 foreign entities, such as Russian hackers, “coordinated online targeting of American service members, veterans, and their families” in an effort to disrupt American democracy.\n “We found 10 different ways foreign entities were targeting veterans online,” said Goldsmith, including through ads, fake veteran accounts that sent friend request to other veterans in order to penetrate the “relatively small community of veteran advocates, and found large social media pages run by foreign admins that spread disinflation tailored to veterans in a effort to influence the election”.\n Goldsmith sees anti-democratic, white supremacist and fascists movements targeting veterans for the same reason as foreign adversaries. “Veterans are an economically efficient target for campaigns, because if you get one, they often bring their immediate social circle with them,” said Goldsmith.\n Goldsmith warns that the coming election is vulnerable to a rising insurgency. “We saw a violent insurrection, we did not experience a peaceful transfer of power. It was an attempted coup. Every failed coup is just practice for the next one,” said Goldsmith.", "posttime": "2022-01-10 19:22:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,军队,rightwing,成员", "title": "美国军队的右翼极端主义的崛起引起了对民主的恐惧", "title_en": "Rise of rightwing extremism in US military sparks fears over democracy", "transed": 1, "url": "https://www.theguardian.com/us-news/2022/jan/10/us-military-rightwing-extremism-american-democracy", "via": "", "real_tags": ["美国", "军队", "rightwing", "成员"]}]