[{"category": "", "categoryclass": "", "imagename": "c5f20af55108a8f4028141be9dec4e70.png", "infoid": 1072589, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一台笔记本电脑，为移动专业人士为本，电池寿命长达8小时，价格为1899美元......在1985年。有可能的？这是这个故事的英雄，东芝T1100加：", "note_en": "A laptop, which was intended “for mobile professionals”, with up to 8 hours of battery life, with an $1899 price… in 1985. How was it possible? This is a hero of this story, Toshiba T1100 Plus:", "posttime": "2022-01-10 12:34:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电脑,t1100,英雄", "title": "Toshiba T1100  - 被评为电子工程里程碑的笔记本电脑", "title_en": "Toshiba T1100 – the laptop that was named a milestone of electronic engineering", "transed": 1, "url": "https://medium.com/geekculture/toshiba-t1100-why-a-laptop-without-a-hard-drive-was-named-an-ieee-milestone-of-electronic-574a8f71b5ec", "via": "", "real_tags": ["电脑", "t1100", "英雄"]}, {"category": "", "categoryclass": "", "imagename": "5fa17b758fdadf37eaea328897dec1b7.jpg", "infoid": 1072588, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "暴力来自极端主义，因此需要一些更复杂的工具，因为LLN慢慢地工作。我们看到粉红色的论文是如何伪造的。我们看看......", "note_en": "Violence is from Extremistan, hence requires some more sophisticated tools since LLN works slowly. We see how Pinker's thesis is bogus. We look at ways to in...", "posttime": "2022-01-10 12:33:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "声称,claims,来自", "title": "N.N. Taleb：声称暴力辍学不是统计", "title_en": "N.N. Taleb: Claims That Violence Has Dropped Are Not Statistical", "transed": 1, "url": "https://www.youtube.com/watch?v=rwZ0dL6BLxw", "via": "", "real_tags": ["声称", "claims", "来自"]}, {"category": "", "categoryclass": "", "imagename": "c5d5e3fe270c24e4fd53b932ff5560ef.jpg", "infoid": 1072587, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“在我写的岁月里，我的思想和写作是一个漫长的启蒙之旅。当我在高中时，我第一次见到空间的虚幻性质。在四十多岁时，我看到因果关系是一种幻觉。“\n在日常生活中的恒定动荡 - 迪克和他的母亲经常从小屋搬到伯克利周边的公寓 - 开始对年轻的伯克利安造成折扣，他在想象中世界的故事和言论中找到了慰借。\n迪克需要在想象力艺术领域避难，或者通过现实世界的身体和心理创伤吞噬整体。\n他在大学收音机的第一任务，然后位于Shattuck Avenue和Centre Street附近，被拯救了真空管和适配器的零件（第二次世界大战继续在迪克的青少年时期愤怒）。迪克为商店销售收音机和其他电器，以后是一种新的技术形式，称为电视。\n“我有一大堆课程，这只是非常多的鸟类。 ......我站在那里看着显微镜。在那里甚至没有任何副职员，因为幻灯片移动了。而且指令是，“画出你所看到的，”我意识到那里没有什么，什么都没有。“\n他只看到这部电影的瞥见，但在给生产公司的一封信中，迪克对未来的兴奋是明显的：“我的生命和创造性工作是由刀片跑步者合理的合理和完成。谢谢，......而且它将成为商业成功的地狱。它将证明无敌。“", "note_en": "“Without knowing it during the years I wrote, my thinking and writing was a long journey toward enlightenment. I first saw the illusory nature of space when I was in high school. In the late forties I saw that causality was an illusion.”\n This is a reflective Philip K. Dick, writing in the last few years of his life, trying to put into words a social and metaphysical philosophy that had been haunting him for decades as he wrote dozens of science fiction stories that aimed to, as he said, “pierce the veil of what is only apparently real to find out what is  really  real.” The world was not real, everything was an illusion and everyday life was but a living dream.\n It’s fitting that Berkeley — a city of artists and intellectuals and mechanics and squatters — was the place where the epiphany revealed itself to him; that Berkeley would become the locale of inspirational fodder for decades to come.\n His family moved to the city in 1931 when he was just 2. School records at the nursery he attended described Dick as “a lover of peace,” with an “intellectual curiosity and keen interest in everything about him.”\n This was, in part, a reflection of both his upbringing by his well-educated parents and his new home in a town with a large population of freethinking academics and bohemians attending UC Berkeley. Back then, a small trolley car used to run along Telegraph Avenue, flanked by small shops and restaurants that catered to the cosmopolitan tastes.\n More traditional forms of entertainment and leisure seemed to escape him, even at an early age: After watching a Cal football game at age 6, he later told his dad that he didn’t understand why the players were constantly chasing each other back and forth across the field.\n Of course, Berkeley is more than just a university, and later in life, Dick would base many of his stories — science fiction and   otherwise  — in the blue-collar neighborhood of West Berkeley that was populated by warehouses, used car lots, greasy-spoon cafes and bars.\n As constant upheaval in his everyday life — Dick and his mother frequently moved from cottage to apartment around Berkeley — began to take a toll on the young Berkeleian, he found solace in the stories and rhetoric of imaginary worlds.\n Dick would base many of his stories  in the blue-collar neighborhood of West Berkeley that was populated by warehouses, used car lots, greasy-spoon cafes and bars.\n He became obsessed with L. Frank Baum’s “Oz”  series and its tales of flying homes and evil witches and enchanted roads (though he later said as an adult that he struggled to find every book installment because “librarians haughtily told me that they ‘did not stock fantastic material,’ their reasoning being that books of fantasy led a child into a dreamworld and made it difficult for him to adjust properly to the ‘real’ world.”)\n When Dick was 10, he and his dad paid 50 cents each to attend the 1939 World’s Fair in San Francisco. In an   short film  promoting the event, an announcer proclaims how the city is straddled by “the two largest bridges in the world, symbolizing both pioneering vision and modern courage, in the conquest of space and time.” As his father went to see a striptease performance, Dick wandered the fair’s Hall of Science.\n  The next year, he took a crack at writing, his first attempt being a poem titled “He’s Dead.” The last two lines of the piece read, “No longer shall he scorn his bed. / Alas for us! Our dog is dead.” The poem, along with several short stories, was published in the “Young Authors’ Club” section of the now-defunct local paper Berkeley Gazette. A mature Dick would go on to say that he considers the beginning of his writing career to be the same year he wrote the elegy to his late family dog.\n During this time, like most kids his age in Berkeley, he attended Garfield Junior High School, now known by its current name, Martin Luther King Jr. Middle School. But, like any good tortured artist, he hated the academic structure of public school with a passion. His health had never been particularly good (he was already taking amphetamines for his asthma), and constant bouts of panic attacks and vertigo made school almost unbearable.\n Often staying home from school, his discovery of his first science fiction magazine in 1940 unfurled the infinite opportunities of fantasy before him. Dick began to haunt various Berkeley secondhand bookstores, trying to get his hands on as many sci-fi pulps as possible. By the time he entered Berkeley High School four years later, “the battles were drawn,” writes biographer Lawrence Sutin.\n Dick would need to take refuge in the realm of imaginative art or be swallowed whole by physical and psychological trauma of the real world.\n But back to that high school epiphany, that first glimpse of “divine madness.” A student at Berkeley High School, still suffering from a debilitating combination of vertigo, agoraphobia and claustrophobia — he once, as he walked down the aisle of a classroom, said he felt as though the floor was tilting away from him, as if the whole world were shifting under him.\n During the middle of a high school physics final, he struggled to answer a question on Archimedes’ principle, which states that when an object is submerged, it is met with a force equal to the volume of the water it has displaced. In an anxiety-fueled panic, the test seemed to be all that stood between him and entrance to UC Berkeley (the university that most of his friends were expected to attend).\n “I prayed and prayed and prayed and prayed and then this voice clicked on and said, ‘The principle is really very simple,” Dick later recalled in an interview. “Then it went on and stated the principle and explained how it was applied.”\n All the mental barriers that had plagued him through schooling suddenly melted away, with a mechanical “click” and the guidance of an almost android-like entity. He got an A on the test.\n It was a revelation that would still follow him many years later: The technological female voice of artificial intelligence just beyond the event horizon of reality, weaving its way into published words and burrowing into his increasingly unstable mind, providing a dizzying clarity and obscurity.\n For a teen with as much social anxiety as Dick had, it’s surprising that he ended up getting jobs at local radio and records shops in Berkeley at the tender age of 15. But Dick thrived in the seeder art community in Berkeley, debating and joking with his co-workers about politics and music and life.\n His first task at University Radio, then located near Shattuck Avenue and Center Street, was salvaging vacuum tubes and adapters for parts (World War II continued to rage in Dick’s teen years). Dick sold radios and other appliances for the store and, later, a new form of technology called television.\n The store imparted more than work experience: He lost his virginity to a former customer of his in its basement storage closet. Interestingly enough, in his 1965 novel “Dr. Bloodmoney, or How We Got Along After the Bomb,” a basement storage closet becomes the last place of refuge for a couple of TV store employees in Berkeley during a nuclear strike.\n “Because I was fortunate enough to live in Berkeley, which is probably as much an intellectual center as you’d find anywhere in the world, I was not limited as my other friends who write science fiction are.”\n As hard as it is to imagine now, Dick’s love of science fiction and fantasy began to wane when he left his mother’s home as a 19-year-old with no plan to go to college. An older Dick posited that it was because Berkeley culture of the 1940s “required you to have a really thorough groundbreaking in the classics.”\n “Because I was fortunate enough to live in Berkeley, which is probably as much an intellectual center as you’d find anywhere in the world, I was not limited as my other friends who write science fiction are,” Dick   said .\n In a kind of parallel to the days of his childhood with his then-recently-divorced mother, Dick’s early 20s were marked by constant moving: One year at McKinley Avenue, another Bancroft Way, another on Dwight Way. During this time, Dick struggled under his desire to write, a deeper desire to attain celebrity status and a desperate need to make money. He wrote dozens of mainstream short stories at the time. Editors didn’t bite, and it stung.\n In 1949, he gave college one last try. At UC Berkeley, he majored in philosophy, taking classes in history and zoology. One year later, however, he quit. In a later interview, he described his exasperation with the whole institution of academia:\n “I had a whole bunch of courses that were just so much birdshit. … I was standing there looking in the microscope. And there aren’t even any paramecia in there at all, ‘cause the slide moved. And the instruction is, ‘draw what you see,’ and I realize that there’s nothing there, nothing at all.”\n He would never return to school, but stated on several occasions the importance and value he placed in his UC Berkeley library card. It would be at UC Berkeley’s very own Main Stacks that, in the coming decade, he would spend years looking up Gestapo documents and other Nazi propaganda, gathering research for a possible story about an alternative world where the Axis won World War II.\n In 1962, the years of writing and researching and soul-searching would culminate in the publication of the “The Man in the High Castle,” a novel set in the shimmering, gritty and exotic city just across the bay. The novel received critical acclaim and put the short story writer on the map. The book won Dick a Hugo Award, the science fiction and fantasy literature world’s highest award.\n  The whole story, though, of Dick’s life after the end of his youthful years in Berkeley is just as dystopian as many of his works. For most of his life he was impoverished — In 1950, he bought a house on Francisco Street, but as the decade went on, he was still writing mostly short stories that didn’t pay nearly enough. Dick and his then-wife would sometimes eat ground horse meat purchased at 35 cents a pound from the Lucky Dog Pet Shop in Berkeley. And, eventually, he would move away.\n The amphetamines he had started taking for his asthma as a child morphed into an addiction to speed that fueled the breakneck pace of his writing (he wrote three novels, “Do Androids Dream of Electric Sheep?” “Ubik” and “Nick and the Glimmung,” all in 1966) but also destroyed his body and mind. From that first consummation in the basement of University Radio, Dick had a procession of failed marriages and romances, almost always with a woman whose intelligence and seductive charm appeared to him both terrifyingly cold but deliriously irresistible.\n In 1974, Dick proclaimed that a pink light had appeared before him and a benevolent being he nicknamed Zebra had zapped his brain with “mystical information.” Zebra, he said, was camouflage in the form of everyday objects, and had revealed to him that our history and present was an illusion.\n By the end of his life, the visionary of alternative worlds believed that his own world was a simulacrum of some unattainable reality. Dick would remain largely unknown to the mainstream public whose attention he had so desperately craved until just before his death in 1982, just a few months before the first release of a major film based on his work: “Blade Runner.”\n  He only ever saw glimpses of the film, but in a   letter  to the production company, Dick’s excitement for the future is palpable: “My life and creative work are justified and completed by Blade Runner. Thank you, … and it is going to be one hell of a commercial success. It will prove invincible.”\n Even with his larger-than-life narratives of space travel and technological advances and apocalyptic societies, Dick’s works always seemed to present an uncanny valley version of everyday life — who’s to say that goat in the Berkeley hills or that toad croaking at Strawberry Creek isn’t  a machine?\n In fact, Berkeley’s unique fingerprints on the sci-fi vanguard’s work become obvious on closer inspection: the repairmen and tinkerers, the anxiety of a dilapidated urban cityscape, the lofty metaphysical philosophies of men long since dead, robot-life femmes fatales, and even a neighbor’s dog. Every aspect of his life in Berkeley was rendered imaginative fodder for his creative tales. Everything was material.\n It makes sense, perhaps, that the first short story Dick ever sold in 1953 was entirely based on the utterly mundane situation of a Berkeley neighbor’s dog barking at the garbage man. The story of “Roog” goes like this: A dog named Boris, who believes that garbage is actually precious food, is shocked to see that his owner not only tosses the garbage into cans, but that it is also dumped into garbage trucks. The twist? With his keen perception, Boris is able to sense that the garbage men are actually “Roogs,” predatory creatures disguised as humans that accept the garbage as sacrifices until they eventually tire of trash and devour the humans.\n Trying to alert the humans, Boris cries “Roog! Roog!” but they all mistake the alerts as simple barking, letting the garbagemen escape to prey another day.\n Kyle Arnold puts it best in his biography “The Divine Madness of Philip K. Dick”:  “The dog wouldn’t let him dream, so he dreamed   it  by writing it into his story.”", "posttime": "2022-01-10 11:33:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "android,梦想,dream,迪克", "title": "Androids梦想伯克利吗？ Philip K. Dick's Youth市", "title_en": "Do androids dream of Berkeley? The city of Philip K. Dick's youth", "transed": 1, "url": "https://www.dailycal.org/2018/03/04/phillip-k-dick-berkeley-retrospective/", "via": "", "real_tags": ["android", "梦想", "dream", "迪克"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072586, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一个恐怖故事，对亚马逊支付的小型电子商务商人：类似于PayPal的支付处理服务，它利用了客户现有的亚马逊账户。这看起来都很有前途。亚马逊工资将为我的客户提供更容易的结账体验，送货地址和付款详细信息已经填写，我会在交易费中节省少量。什么可能出错？但是六周后，亚马逊有2300美元的钱，没有办法进入它，他们的支持一直没有价值。我只能希望公共羞辱文章将刺激亚马逊的人注意并介入，否则钱可能只是走了。\n我（释义）：我仍然遇到了支付困难。您关闭了我的最后一个案例编号xxxx关于这个问题，所以我必须创建这个新的案例。我的银行表示，在亚马逊工资的所有ACH转账中缺少银行账号的最后一位数，但银行账号在我的亚马逊付费设置中是正确的。\n亚马逊工资：我明白您的银行帐户遇到了问题。谢谢你继续耐心。此时，我正在与我们的内部团队合作，达到您的案件的决议。\n我要求电话代理审查之前的情况，并查看在该案件结束之前发现的“内部团队”所发现的信息。没有。前案中的所有讨论都基本上已经消失了和毫无价值。", "note_en": "This is a horror story of a small e-commerce merchant who signed up for Amazon Pay: a payment processing service similar to PayPal that leverages customers’ existing Amazon accounts. It all seemed so promising. Amazon Pay would provide an easier checkout experience for my customers, with the shipping address and payment details already filled, and I’d save a small amount in transaction fees. What could go wrong? But six weeks later, Amazon has $2300 of my money with no way for me to access it, and their support has been worthless. I can only hope that a public shaming article will spur somebody at Amazon to take notice and intervene, otherwise that money is probably just gone.\n I created the Amazon Pay account on November 29, and configured my business bank account info so I could receive electronic disbursements. This is a normal business checking account at a normal US bank, using US dollars, and that works fine with other payment processors like PayPal and Shopify Payments. I entered the bank’s ACH routing number and my account number, which ends with the digits 622. Soon I was able to receive payments in my store using Amazon Pay, and everything seemed good.\n The problem started on December 8, when Amazon Pay attempted the first disbursement to my bank account. I received a failure notification by email:\n “Your most recent transfer of funds in the amount of $XXX was not successfully deposited into your bank account on file (ending in 622). The funds were returned to us, and we have removed the current bank account information from your account.”\n Amazon Pay’s merchant support was unable to explain what went wrong. They sent me some generic troubleshooting info that looked like it was written by a bot. It’s not clear why they couldn’t provide any specific details about why this transfer failed. The generic info suggested the routing or bank account numbers might be wrong, so I re-entered the numbers again, being extra careful to get them correct. Then I waited a week… and the exact same thing happened. This same dance played out five more times on December 16, 17, 18, 20, and 21. Each time Amazon Pay attempted a disbursement to my bank, then a few days later I got the same email saying the money wasn’t successfully deposited to my bank account ending in 622, and “we have removed the current bank account information from your account.”\n On December 23 I contacted my bank and gave them the trace IDs for all the failed transfers. My bank determined that the account number was wrong on every transfer. All the failed ACH transfers used an account number ending in 62 instead of 622:  the last digit of the account number was missing!\n Armed with this information, I returned to Amazon Pay merchant support, and here’s where I really started to get frustrated. I discovered that my original support case had been unilaterally closed without resolution, because five days had passed since the last reply, and apparently that’s their support policy. It’s not possible to reopen or reply to a closed case, so I had to create a new case and explain the issue all over again. This did not go well. Imagine this support exchange happening slowly by email over a series of two days:\n Me (paraphrasing):  I’m still having trouble with disbursements. You closed my last case number XXXX about this issue, so I had to create this new case. My bank says the last digit of the bank account number is missing on all the ACH transfers from Amazon Pay, but the bank account number is correct in my Amazon Pay settings.\n Amazon Pay:  To receive disbursements, you need to set up your bank account info in your Amazon Pay settings. You do not have a bank account configured in your settings.\n Me:  Please see attached screenshot showing my bank account info is already set up correctly. I have already done this several times, but every time there’s a failed disbursement attempt, Amazon Pay removes my bank account information. The fundamental problem is that the last digit of the bank account number is missing in all of Amazon’s ACH transfers. Please look at the ACH transfers yourself to confirm.\n Amazon Pay:  To receive disbursements, you need to set up your bank account info in your Amazon Pay settings. You do not have a bank account configured in your settings. The screenshot you sent doesn’t show what account it’s associated with so we can’t tell anything from that.\n Me:  The bank account info has already been entered. I’ve attached a full-page screenshot showing this. The deposit method isn’t assigned, because every time there’s a failed disbursement attempt, Amazon Pay removes my bank account information. Please respond to the fundamental issue of the missing digit in the ACH transfers. Here are all the trace IDs again. You can verify them yourself.\n Amazon Pay:  Your bank account may not be compatible with our system. Your account needs to be ACH-ready. Please contact your bank.\n Me:  Yes it’s ACH-ready, it’s a standard business checking account at a USA bank, and I’m already receiving ACH transfers there from PayPal and Shopify. I mentioned all this already in the first case that I opened, that Amazon Pay closed without resolution. You still have not addressed or even mentioned the fundamental problem that I’ve asked about four times now, the missing digit in the ACH transfers. Kindly investigate why this digit is missing in all the ACH transfers from Amazon Pay.\n Amazon Pay:  I understand that you are having problems with your bank account. Thank you for your continued patience. At this time I am working with our internal team to reach a resolution on your case.\n (five days later) Me:  Has there been any progress on this? I’m still unable to access the funds in my Amazon Pay account.\n Amazon Pay:  I understand that you are having problems with your bank account. Thank you for your continued patience. At this time I am working with our internal team to reach a resolution on your case.\n (five days later): Case closed with no further response from Amazon. Can’t reopen or reply.\n Now I was really upset. Since I couldn’t reopen the old cases, I opened a third case to explain the issue with failed disbursements and the missing account number digit, all over again.\n Amazon Pay:  To receive disbursements, you need to set up your bank account info in your Amazon Pay settings. You do not have a bank account configured in your settings.\n  I was able to reach a phone support agent, and told him I just wanted to close my Amazon Pay account and get a final payout by paper check, since they seem unable to resolve the problem with electronic transfers to my bank.  I was told they can’t do it. Basically the options were 1) electronic transfer to bank, or 2) electronic transfer to bank.\n I asked the phone agent to review the previous case, and see what information the “internal team” had found before that case was closed. There was none. All the discussion from the previous case was essentially gone and worthless.\n So I went through all the same conversation again with the phone agent, arguing about why my bank account info wasn’t set up in my Amazon Pay settings. I gamely played along while he had me delete my browser cookies and other irrelevant troubleshooting. Since closing the account didn’t appear to be a viable option, I tried once again to delete and re-enter all my bank account info. The phone agent insisted that everything would be OK now that I’d entered my bank account info, and I would receive a disbursement within the next few days. He didn’t seem to understand or care that I’d already been through this same loop several times before without success. Skeptical, I thanked him and hung up. I then received a follow-up email:\n Amazon Pay:  I understand that you would like to know how you can see the transaction and how disbursements work for the Amazon Pay platform. If you want to find your transactions coming from Amazon Pay just remember to switch from “Amazon.com” to “Amazon Pay (Production View)”. You would be able to see that next to your Seller name and the USA flag where there is a scroll down. etc…\n What the actual fuck?! What is this and how is it relevant in any way? Is Amazon Pay’s merchant support even staffed by human beings, or is it all just chatbots and  GPT-3-driven natural language text generation? Amazon needs to understand that merchants have many choices for payment processing, including PayPal and traditional credit card processors, who have professional support staffs to respond to account problems in a timely and constructive way. Many people complain about PayPal, but at least PayPal’s support team responds to me with useful and relevant information that answers my questions. After a month of trying, I’ve failed to get anyone at Amazon Pay to even acknowledge my problem with the missing account number digit, let alone give me any constructive help. Their merchant support seems designed to frustrate merchants into simply giving up and going away. I’ve lost $2300 thanks to Amazon Pay, with no further options for resolution. Meanwhile Amazon Pay has been removed from my store, and I will not be reactivating it. Good riddance.\n  Read 1 comment and join the conversation", "posttime": "2022-01-10 11:32:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,亚马逊,商家,service,案件", "title": "商家服务恐怖：亚马逊工资和消失2300美元", "title_en": "Merchant Service Horror: Amazon Pay and the Disappearing $2300", "transed": 1, "url": "https://www.bigmessowires.com/2022/01/09/merchant-service-horror-amazon-pay-and-the-disappearing-2300/", "via": "", "real_tags": ["amazon", "亚马逊", "商家", "service", "案件"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072585, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与乔治·里普利相关的炼金术卷轴是不寻常的手稿，说明了哲学家的追求追求.Ripley是约克郡的布里奇顿的佳能，他从约1415年到1495年。他被称为炼金术作品和炼金术作品的作者。押韵，他的经文在大多数卷轴上使用。", "note_en": "The alchemical scrolls which are associated with George Ripley are unusual manuscripts which illustrate the pursuit of the Philosophers' Stone.Ripley was a canon of Bridlington in Yorkshire who lived from about 1415 to 1495. He was renowned as an alchemist and author of alchemical works in rhyme, and his verses are used on most of the scrolls.", "posttime": "2022-01-10 10:39:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "炼金术,alchemical", "title": "Ripley的炼金术卷轴", "title_en": "Ripley's Alchemical Scrolls", "transed": 1, "url": "https://www.rcpe.ac.uk/heritage/ripleys-alchemical-scrolls", "via": "", "real_tags": ["炼金术"]}, {"category": "", "categoryclass": "", "imagename": "567ed36a5399aff64be9cc2dc76b34cd.jpeg", "infoid": 1072584, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与UBER合作，赫兹将从其舰队中获得高达50,000车辆，可供优步司机租用。\n优步的首席执行官是完全挑剔的：一旦司机经历了一个Tesla，这是该计划的目标，他们不想回到驾驶内燃机车辆。这也不会成为一个困难的销售，因为最近对6000个优步司机的调查发现，47％的司机希望他们的下一个车辆完全电动。", "note_en": "In partnership with Uber, Hertz will make up to 50,000 Tesla vehicles from its fleet available for Uber drivers to rent.\n The program will start on November 1st in Los Angeles, San Francisco, San Diego, and Washington, DC. Nationwide expansion will begin in the following weeks.\n Hertz will offer Tesla Model 3, assumedly Standard Ran  ge Plus, for $334/week with plans available in the near future that will lower the price to $299 or less. Insurance and maintenance are both included. Drivers will have to currently maintain a 4.7 star rating and have completed at least 150 trips to be eligible for the program.\n Uber and Hertz have partnered since 2016 to provide drivers with vehicle rental options. With this partnership, Hertz will kick off the program by providing up to 50,000 vehicles by 2023 exclusively to drivers. If successful, the program could expand to 150,000 Teslas during the next three years. Hertz pointed out that these ambitions could be affected by factors outside of its control, such as semiconductor chip shortages or other constraints.\n Uber CEO Dara Khosrowhshahi issued a statement to CNN at the time of release that he hopes drivers who rent Tesla’s through Hertz will eventually end up buying them in an effort to accelerate Uber’s sustainability efforts.\n Uber is additionally offering a $1-a-ride bonus of up to $4,000 per year for Uber drivers who rent a Tesla through Hertz. Less than 10% of Uber drivers currently rent a vehicle.\n The rollout will be completed in 2023, with up to 50,000 Tesla’s available for rent to Uber drivers. These Tesla’s will be taken out of the 100,000 total purchase commitment that Herz made earlier this week, which pushed Tesla to a one-trillion dollar valuation.\n  Uber’s CEO is completely spot-on: once drivers experience a Tesla, which is the goal of this program, they won’t want to go back to driving an internal-combustion engine vehicle. This won’t be a difficult sell either, as a recently-conducted survey of 6,000 Uber drivers found that 47% of drivers want their next vehicle to be fully electric.\n We do have to ponder the economics, as for many this will be a way to trial a Tesla as a taxi without the necessary commitments. $334/week, with a goal of getting prices to $299/week with volume, may sound slightly expensive at its surface but nonetheless carries a number of benefits along with the lack of a commitment.\n It is currently possible to finance a Tesla Model 3 Standard Range Plus with $0 down for $789/month, or lease it for $672/month. This is with a market-adjusted starting price of $43,990 — up $7,000 from February of this year. While both figures ultimately represent a lower cost, Hertz is including all insurance and maintenance. We’d have to presume that mileage limits will be high, or nonexistent, as well. There is also a variable of whether Hertz plans to enable Full Self-Driving Capability at a cost of $10,000 per Tesla, although we would assume they aren’t planning to do so.\n Long-term it absolutely does become more cost-effective to purchase a Tesla, as on the used market they hold value well even with extremely high miles. Rental fees of ~ $1200/month are a sunken cost, whereas there is added utility to financing a new or used Tesla which includes a potential to use the vehicle on Tesla’s own autonomous taxi network once it’s ready. It’s also possible to sell it once it’s no longer in commission.\n Model 3 already lends itself to being the perfect electric taxi, so making it more accessible for Uber drivers will lead to a big push towards sustainability as well as increased driver satisfaction. We would recommend that drivers consider buying a Tesla, either new or used, to make it more economical over time — which is the goal here for both companies.\n  Interested in Listing or Upgrading YOUR Tesla?  The BEST place to get TOP dollar for your used Tesla. MADE IN NYC\n Tesla currently has no new inventory available for immediate purchase, and used vehicles across the automotive industry are selling for an average of $5,000 over market value.", "posttime": "2022-01-10 10:37:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "优步,uber,司机", "title": "赫兹为优步司机提供299美元的价格为299美元", "title_en": "Hertz to Offer Insured Tesla’s for $299/Week to Uber Drivers", "transed": 1, "url": "https://blog.onlyusedtesla.com/hertz-to-offer-insured-teslas-for-299-week-to-uber-drivers-90384f0f68ca?gi=2e0193224ce7", "via": "", "real_tags": ["优步", "uber", "司机"]}, {"category": "", "categoryclass": "", "imagename": "95044c41f318ad5bfba89d051f0f9ee2.jpeg", "infoid": 1072583, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我看到了很多令人困惑，正是术语“可观察宇宙”是指的。这篇文章是试图解决这个问题。\n粒子地平线：可观察到的宇宙的全部程度由粒子视野有界限，这是由于宇宙开始以来，光线从中有时间到达我们的地区，考虑到其扩张。粒子视线的半径为465亿光年，因此可观察到的宇宙是930亿光年。", "note_en": "I’ve seen a lot of confusion over what precisely the term ‘observable universe’ refers to. This post is an attempt to remedy that.\n In 1929,  Edwin Hubble discovered that the universe is expanding. He observed that light emitted from distant celestial objects was redder than expected, due to the downward shift in frequency as their light receded from Earth. And the further away the objects were, the proportionately greater their redshift. Since objects were getting further apart from each other, figures like  Lemaître and  Friedmann reasoned that there must have been some point in the past at which the whole universe was compressed into a single point.\n Embarrassingly, linear extrapolation implied an age of the universe of 1-2 billion years, shorter than the known age of the oldest rocks on Earth. One of the difficulties is that expansion flipped from slowing down to speeding up after several billion years, and this requires complex observations of supernovae to account for. In any case, astronomers eventually measured the age of the universe at about 13.8 billion years. This implies three tempting definitions for the observable universe — that part of the whole universe which we can theoretically see — only one of which is correct.\n Universe age in light-years: You would be forgiven for thinking that the observable universe is a sphere with a radius of 13.8 billion light-years centred on the Earth, since that’s how long light has had to reach us. However, this assumes the universe isn’t expanding or contracting.\n The Hubble radius: Hubble found that the distance to a given galaxy was proportional to its recessional velocity, with a constant of proportionality now called the Hubble constant  H. This implies there is a sphere past which everything is travelling away from us faster than the speed of light. This is known as the Hubble sphere, and it has a radius of around 14.4 billion light-years.\n You may worry that this faster-than-light travel violates Einstein’s theory of relativity, which says that nothing can travel faster than light. However, what relativity says is that matter within space can’t travel faster than light, but nothing about how fast space itself can travel.\n The Hubble sphere isn’t the observable universe either. The radius of the Hubble sphere will be given by c/H, where  c is the speed of light. And the Hubble constant is decreasing: the relative velocities of celestial objects are (on average) growing more slowly than the distances between them. Therefore the Hubble sphere is expanding. If the Hubble sphere expands fast enough, light leaving an extremely distant object can get ‘caught’ and drop from the faster-than-light region outside the sphere to the slower-than-light region inside. Once this light is within the Hubble sphere, it can make its way to Earth (this is explained well in  this video). If you work out their present distance from us, it turns out that all of the photons we receive from the first five billion years of the universe’s existence were all caught by the Hubble sphere. These objects were, are, and always will be travelling away from us faster than the speed of light!\n The particle horizon: The full extent of the observable universe is bounded by the particle horizon, which is the region from which light has had time to reach us since the beginning of the universe, taking into account its expansion. The particle horizon has a radius of 46.5 billion light-years, so the observable universe is 93 billion light-years across.\n The famous  cosmic microwave background is at the particle horizon, and its light has taken 13.8 billion years to reach us (the fact that it consists of microwaves is an extreme version of redshifting). In the  jargon, the  proper distance (the actual distance not taking into account the expansion of the universe) is 46.5 billion light-years but the  comoving distance (taking account of expansion) is 13.8 billion years.\n The particle horizon limits how far in distance we can observe, while the Hubble sphere limits how far back in  time we can observe. We could never see objects outside the Hubble sphere as they are now, no matter how long we waited. Moreover, just as light can get caught in the Hubble sphere, the expansion of space can push light out of it. Every second, 20,000 stars become newly unobservable from Earth. In a few billion years, the observable universe will consist of only our  Local Group of a few dozen galaxies. Future astronomers would gaze upon a barren universe.", "posttime": "2022-01-10 10:36:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "观察,observable,宇宙", "title": "澄清“可观察宇宙”包括什么", "title_en": "Clarifying what the 'Observable Universe' includes", "transed": 1, "url": "https://samenright.com/2022/01/09/disambiguating-the-observable-universe/", "via": "", "real_tags": ["观察", "宇宙"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072582, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在桌面上查看此站点以获得对DMARC如何工作的完整视觉解释。", "note_en": "View this site on your desktop to get the full visual explanation on how DMARC works.", "posttime": "2022-01-10 09:44:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "dmarc,spf,查看", "title": "看看DMARC，SPF和DKIM如何交互方式", "title_en": "See how DMARC, SPF, and DKIM work interactively", "transed": 1, "url": "https://www.learndmarc.com/", "via": "", "real_tags": ["dmarc", "spf", "查看"]}, {"category": "", "categoryclass": "", "imagename": "63a98cbd80d0907ccb96e8b98a63c103.jpg", "infoid": 1072581, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Iconic Comedian Bob Saget在他发现在酒店房间没有反应之后死亡。\n着名的电视人格在ABC SItcom全房屋及其Netflix efreer House上，最着名的电视人格是最为闻名的职位Danny Tanner。他还从1989年到1997年举办了美国最有趣的家庭视频。", "note_en": "Iconic comedian Bob Saget has died after he was found unresponsive in a hotel room.\n  JACKSONVILLE, Fla. – Stand-up comedian, actor, television host and director Bob Saget has died at a hotel in Orlando,  according to the Orange County Sheriff’s Office.\n Hotel staff found Saget unresponsive in his room at the Ritz Carlton on Sunday afternoon around 4, according to police. A cause of death has not been announced, but police said foul play or drug use is not immediately suspected. He was 65.\n The Morning Show spoke to Saget on Monday ahead of his Saturday night comedy show at Ponte Vedra Hall in Jacksonville. The actor appeared in good spirits and health at the time. He spoke to News4JAX anchor Bruce Hamilton, with who he maintained a friendship since college.\n   The iconic comedian’s last public statement, sent from Twitter early Sunday morning, thanked the Jacksonville crowd who came to see his show.\n Loved tonight’s show  @PV_ConcertHall in Jacksonville. Appreciative audience. Thanks again to  @RealTimWilkins for opening. I had no idea I did a 2 hr set tonight. I’m happily addicted again to this shit. Check  https://t.co/nqJyTiiezU for my dates in 2022.  pic.twitter.com/pEgFuXxLd3\n— bob saget (@bobsaget)  January 9, 2022\n The famed television personality is most well known for his role as beloved father Danny Tanner on the ABC sitcom Full House and its Netflix sequel Fuller House. He also hosted America’s Funniest Home Videos from 1989 to 1997.", "posttime": "2022-01-10 09:43:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,爸爸,dad,职位", "title": "“美国的爸爸”鲍勃萨格克斯在奥兰多酒店死亡", "title_en": "'America's Dad’ Bob Saget Dies at Orlando Hotel", "transed": 1, "url": "https://www.news4jax.com/news/local/2022/01/10/sources-americas-dad-bob-saget-dies-at-orlando-hotel/", "via": "", "real_tags": ["美国", "爸爸", "dad", "职位"]}, {"category": "", "categoryclass": "", "imagename": "393380c31d4b4acd43128612b654f279.png", "infoid": 1072580, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几个月里，通过Crypto Compyities关于NFTS作为游戏中的物品和化妆品，已经存在了许多不忠实的宣传。随着“常规”的成长和人民浮动的理论，有关拥有物品和美容皮肤，并且能够在比赛之间采取的理论，对游戏玩家几乎意味着的兴趣导致了一系列狂野的理论，但它们在很大程度上是在很大程度上推动的由对游戏开发知之无愧的人。所以，作为一个开发人员，它落在像我这样的人身上，在这些空间中生活和工作，以分享我们的知识，所以在接下来的几周内，我会尝试这样做，所以订阅并坚持休息该系列。\n在这个球场上，有两场比赛，这个概念是游戏A可以将物品存放或购买游戏作为一个区间的nft，然后拥有它可以在游戏B中使用它。\n即使您可以将原始资产数据存放并直接从区块链向其他游戏发送到另一个游戏，其他游戏也必须花时间和金钱实现这些物品和化妆品。\nVFX和织物。您在游戏中看到的许多酷炫视觉效果都是在相同的工具和插件中构建，并且再次在游戏之间切换意味着丢失这些工具。您需要重建等效模块中的行为。\n每个游戏都有自己的进程（资产管道），它通过Wav文件和网格等原始数据，并将它们变成游戏内的功能。所以即使有原始资产也没有帮助你。转换它们的花费时间，费用费用。", "note_en": "Over the past few months, there’s been a lot of disinformation spreading through crypto communities about NFTs as in-game items and cosmetics. As talk of “the metaverse” grows, and people float theories about owning items and cosmetic skins and being able to take between games, interest in what that means practically for gamers has lead to a wild array of theories, but they’re largely pushed by people who know nothing about game development. So, as a developer, it falls to people like me who live and work in these spaces to share our knowledge, and so over the next couple of weeks, I’ll attempt to do just that, so subscribe and stick around for the rest of the series.\n  The myth of ‘storing an item’ on the blockchain (or anywhere else) as an NFT (← You are Here)\n Thing is, being able to tell what someone owns in a game is a solved problem. APIs have been doing it for decades — that’s how PSN and XBox Live tell games what people bought in their stores, and grant them access to stuff like games, or DLC. We’ll dig into how that works in a later episode.\n The blockers to cross-game itemization are, and always have been, logical, technical, legal, and business issues.\n Before we start, I need to explain what an NFT is, and what it does.\n  At it’s simplest form, an NFT is just a record in a kind of database. You can retrieve the wallet address that owns it, the contract address that created it, the transaction history of its previous owners and sales, and the contents itself, which are arbitrary. In most public use cases, the NFT contains  JSON — a structured text file containing data. It can execute arbitrary code or perform a function when certain conditions are met. Then it records the transaction on a blockchain. The NFT can never be edited or changed, and you can cryptographically prove that all transactions happened the way the blockchain says.\n You can think of it just like a database that anyone can read. If you don’t understand why the kind of database a game uses is important, then this article is for you.\n   In this pitch, there are two games, and the concept is that Game A could store items people earn or buy in-game as an NFT on a blockchain, and then people who own it could use it in Game B.\n Some definitions: - Item: some in-game functional piece of gear, like a sword, gun, or armour. - Cosmetic: some non-functional appearance change, like a skin for an item. - Inventory: a collection of things you have, made up of both items and cosmetics.\n While there are many problems with this idea from the get-go, this article focuses on the idea that the NFT, or any off-platform storage, could contain an item in its entirety for use in another game, which it could load at will.\n To put names to it - here’s one example I hear a lot.\n “With NFTs I could earn a rare sword in Diablo 3 and take it into Path of Exile!”\n And there are fundamental problems with that idea, that are unrelated to blockchains or NFTs.\n You can’t actually store the items or cosmetics themselves on the blockchain in a way that will let them be used automatically. They’re big, complex, and games can’t interpret them without a lot of manual work. In reality, if you were attempting to do this, the NFT would contain a string that uniquely represents them, the same ones the game uses internally, like “WEAPON_ENERGY_SWORD_01”, then it would be up to the other game to implement that in a way that can work with yours. This is how things like Twitch Prime drops are granted.\n Even if you could store the raw asset data and send it to the other game straight off the blockchain, the other game has to spend time and money implementing those items and cosmetics.\n To dig into these, we have to learn a little bit about how game assets are actually made, so let’s start with some of the basics, and the processes that a human has to go through to take something out of one game, and put it in another.\n Since you can download assets from online stores and put them in games, you might think you can just export  meshes (what most people think of when you say a 3D model) between games as well. But the truth is much more complex, and simply put: no.\n  Game engines can’t even agree on which way is up, let alone a myriad of other things. You cannot simply ‘export’ and ‘import’, let alone have that happen automatically without knowing the intricate details of how the asset was created, and what specific tasks need to be done to make it work in your game. These assets aren’t just a model and textures - they all contain code of some sort that fundamentally ties them to the game they were created in. Even moving items or cosmetics between two games made in Unreal Engine is an extremely manual process, because they all depend on things in the codebase that don’t exist in other games.\n At a high level, some of the things that can’t be imported are:\n Behaviour. Every game has its own custom ways of storing and recalling that data. Even moving guns between two shooters can’t be done programmatically without customizing the task. For example, one might store rate of fire as a ‘rounds per second’, and the other might store a ‘delay between rounds’. Others might use curves to represent ramp speed, while some might just use a number. Recoil might be a central library or a function per gun. You need to recode the objects.\n Audio. You could store wav files, but how they actually behave and produce sound are totally dependent on whatever audio middleware they might be using, like  WWise or  FMod. You need to reprogram the audio.\n VFX and Fabric. Many of the cool visuals that you see in a game are built off the same tools and plugins, and again, switching between games means losing those tools. You need to rebuild the behaviors in equivalent modules.\n Shaders. They’re like tiny programs that you use to generate the look of a surface in a game. It’s not as simple as just painting a surface with a texture, you code in how it handles reflections, how it emits light, what it does when you look at it. I’ve written shaders that adjust colours depending on what’s happening to the item, which refers back to the weapon code powering it, which can’t work without bits of my core engine. Shaders are used to  simulate the liquid contents of bottles in Half-Life: Alyx. Some people use them to make it so text always faces the camera, which links back to the original font. So even the appearance of an item or cosmetic is likely to be tied to the internals of the game that created it. You need to rebuild these.\n Animation. In animation, you start with a mesh, and build out a rig for it, which you can roughly consider to be the skeletal structure that the body moves around. It sets the rules for the ranges of how bones can move, but also how bones pull on the rest of the character, like how if you push your hand forward, how your elbow also moves, and maybe your shoulder stretches out at full extension. So if you’re moving a mesh that has a certain rig attached to it into a different engine that has a different rig, they’re going to have different bones, with different rules. At a minimum, you’ll have to go through something called Animation Retargeting in which you manually tell the game which bones in one rig correspond to the bones in a different one. You will need to manually reanimate or retarget.\n Procedural animation. Even after you’ve done your retargeting, it’s normal to need to make programmatic adjustments, with things like Control Rig.  This video from Epic shows Control Rig in action, and how despite having models and rigs for a gauntlet that’s already compatible with the game engine, it needs additional manual work to be used on a Fortnite character to stop the gauntlet clipping through their hand, and sitting how it should. You need to reprogram this.\n Levels of detail. All of this is made more complex by that games all have different rules about what levels of complexity are shown at what draw distances. You might need to see all the details of a gun up close, but at 30 yards, perhaps it uses a simpler model to claw back some performance. Even simple 2D images like sprays or icons are not exempt from this. Mipmaps are a sequence of sequentially lower-resolution textures to be used at different distances, and it’s likely that every game will be using slightly different rules. You need to regenerate the assets.\n QA. Adding items and cosmetics to games and their in-game data tables needs to be done  at build time, and be tested before you let players see it. And even if you could do all of this at run time, live, why would any game just  trust that some other game’s stuff was going to go through this process and magically turn out production-ready?\n This is  not even close to the full list of problems; I’ve stuck to the things that I think people who don’t work on games will be able to understand easily. The systems that enable games to display moving, animated 3D objects go multiple layers deeper than this — mesh deformations as the rigs move, how much of the appearance comes from rendering and shading, which again, are both deeply tied to the game itself. One of my prototypes used anime-style cell-shaded characters, and their stylization had nothing to do with the character models; they got their look from a post-processing volume that encapsulated the Actor, which is something the engine provided.\n    Each game has its own processes (asset pipeline) that it goes through to manually take raw data like WAV files and meshes and turns them into functional things inside the game. So even  just having the raw assets doesn’t help you. Converting them costs time, which costs money.\n So even if you were to arrange all this ahead of time for specific items, why would a game studio spend all that money and time to produce another game’s items and cosmetics in their game, that they can’t sell, QA, control, buff, nerf, or protect themselves against?\n And even if the myriad of things that you need to do to set something up in your game were done in advance, the only thing you’d be checking off the blockchain is that User A has Item B. But since you know this item can  only come from Game B, you would just use an API to check for it. This is how games tell when people bought things like DLC for our games from the PlayStation or Xbox store. If someone’s account claims to have bought something from PSN, clearly the best way to tell is to check PSN.\n Even if you were able to wave a magic wand and make all of the things that prevent it irrelevant, you’d  still just be left with something that adds complexity while providing no additional value. The only extra functionality that would provide over a regular cross-game promotional item (like Little Big Planet was doing 10 years ago) is the ability to trade those items between users .. which Steam was doing 9 years ago.\n If you’re currently thinking something about ‘but decentralization’, hold that thought. That’s a falsehood people have been selling, and I’ll address it in a future article. The point of  this article is singular - to show how NFTs do nothing to mitigate any of the difficulties of asset sharing.\n Game development is a complex, exciting, interdependent web of complexities that are largely invisible to people who never see them, and while I’m thrilled to see people taking an interest in game development tech, I hope this has opened at least a small window into challenges at play.", "posttime": "2022-01-10 09:40:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,nft,fantasy", "title": "NFT Fantasy：为什么 -  AS-AS-NFT不会在游戏之间转移资产", "title_en": "NFT Fantasy: Why-Items-as-NFTs Does Not Enable Transfer of Assets Between Games", "transed": 1, "url": "https://chhopsky.substack.com/p/nft-fantasy-why-items-as-nfts-does", "via": "", "real_tags": ["游戏", "nft", "fantasy"]}, {"category": "", "categoryclass": "", "imagename": "c1caef2136109f5d933c7c648dd30fb4.jpg", "infoid": 1072579, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "分析：“促进恐惧和镇压的气氛......损害创造力，推动优秀的年轻科学家脱离了这个领域'\nKambhampati，其研究与超额激光有可能在众多技术进步中发挥作用的潜力，最近被加拿大自然科学和工程研究委员会拒绝了未能“充分描述将被投入的具体的具体实践”确保在他的实验室中有意和积极支持EDI的地方。\n科学部门在与科学无关的新闻故事中发表声明，如果故事有任何感知的种族彻底，因为斯坦福在罗滕·赫尔迪克和乔治弗洛伊德的死亡之后，斯坦福等待着许多其他干部部门。\n“在生物学中教授的一些主题的主题随着时间的推移而变得争议。 ......一个很好的例子是性别是二进制的，“威廉姆斯学院生物学教授Luana Maroja和科学家自我审查的2019年大西洋作品，告诉大学修复。\n然而，许多美国人在学术词干中工作，已经了解他们的预期，以及真诚或不是真诚的，使其隆重展示如此大声地说。", "note_en": "ANALYSIS:  ‘Promoting a climate of fear and repression … damages creativity and drives excellent young scientists out of the field’\n In December, Stanford University’s Department of Computer Science released a  statement on the Kyle Rittenhouse verdict accompanied by an anti-racism  toolkit comprised of images of what looks like the reading list for a racial studies course.\n “We condemn the violence, trauma, and suffering that the Black community has both historically and contemporarily endured,” the computer science department stated.\n “The pervasiveness of anti-Black racism reaffirms our department’s mission to create an equitable, diverse, and inclusive community that centers, affirms, and uplifts everyone and prioritizes an enduring sense of belonging and community for all.”\n Although academic departments related to science, technology, engineering, and math, collectively known as STEM, once operated largely unadulterated by the social and political ideologies that plague much of academia, many professors and students in those departments now find that espousing the proper views on a plethora of topics related to race, sex, and the broader Diversity, Equity and Inclusion philosophy has become prerequisite for a meaningful career.\n Patanjali Kambhampati, a chemistry professor at McGill University, recalled when he was a student in the late 1980s and 1990s.\n “Some of my friends and professors in science were saying, ‘Oh the people in sociology are trying to study us and judge us and tell us how to do better and be better people,’ and we were laughing at that seeing how silly that was because we’re the rational ones,” he said in a phone interview with  The College Fix.\n  Kambhampati, whose research pertains to ultrafast lasers with the potential to play a role in numerous technological advancements, was recently  denied a grant by the Natural Sciences and Engineering Research Council of Canada for failing to “adequately describe specific, concrete practices that will be put in place to ensure that EDI is intentionally and proactively supported” in his lab.\n Responding via email to a series of questions sent by  The College Fix, Dorian Abbot, a professor in the Department of the Geophysical Sciences at the University of Chicago, wrote that “20 years ago the emphasis was on reducing biases and identifying the most promising candidates from a scientific perspective regardless of their background, which I strongly support.”\n But today, as a prominent critic of DEI’s tendency to prioritize skin color above skills, Abbot was disinvited from giving a lecture at MIT about his geological studies.\n DEI has become “focused on trying to hit quotas for group membership, discriminating against members of undesirable groups, and suppressing the speech of those who disagree with any aspect of it,” Abbot told  The Fix.\n “The effect,” he added, “has been that we are hindering our ability to produce the best science by (1) selecting young scientists partially using criteria other than scientific merit and potential and (2) promoting a climate of fear and repression, which damages creativity and drives excellent young scientists out of the field.”\n Illustrating Abbot’s point is a growing list of prominent victims of this systemic infection of STEM by DEI who have lost funding and professional opportunities due to their failure to take what Abbot described as an “ideological loyalty oath.”\n  Academic departments in STEM routinely  post DEI statements to their websites, replete with all the proper slogans.\n Science departments issue statements on news stories unrelated to science if the story has any perceived racial overtones, as Stanford did with the Rittenhouse verdict and as many other STEM departments did in the wake of George Floyd’s death.\n For example, in the summer of 2020, the chair of Northern Illinois University’s Department of Biological Sciences at the time sent out an unnecessary but seemingly heartfelt email condemning Floyd’s death.\n Ironically, this also got him publicly scolded via mass email by a graduate student because he failed to use this opportunity to call for more race-based hiring and mandatory in-person anti-racism training within NIU’s biology department.\n Further exemplars of Abbot’s concerns include recent postings for faculty positions at both Illinois State University and the University of Hartford, with ISU  requiring aspiring neuroethologists to submit a “one-page statement describing [their] interest in or effort toward furthering diversity, equity, and inclusion” and Hartford  informing would-be anatomy and physiology instructors, “A review of applicant diversity statements will precede that of any other application materials.”\n None of this however has any apparent benefit to science or scientists. None of it furthers understanding of human disease, life on Earth, or the universe beyond.\n The net result, according to Abbot, is academic institutions are “screening out scientists with alternative political and moral viewpoints,” which led him to ask: “Do you care if the person who will come up with the cure for cancer agrees with you politically?”\n For most people the answer is no. However, given today’s academic climate, perhaps the better answer is that we should hope that the person who can come up with the cure for cancer agrees with the right people politically.\n “Some topics which were topics taught in biology have become controversial over time. … A good example would be that sexes are binary,” Luana Maroja, a professor of biology at Williams College and author of a 2019  Atlantic  piece on self-censorship by scientists, told  The College Fix.\n Debra Soh, who formerly did neurocognitive research on human sexuality as a graduate student, felt she needed to  self-exile from academia if she wished to comment on politicized scientific issues related to her area of expertise like  gender dysphoria in children.\n Former friendly neighborhood spider researcher Colin Wright gave up on an academic career after, according to his  account, he was blacklisted from long-term employment in academia upon penning several popular articles containing heretical truths pertaining to biological sex in humans.\n Commenting on the examples of Soh and Wright, Maroja stated, “I don’t think that just holding [these] views would have been detrimental…I don’t think their view is a niche view…I think most people agree with them – especially biologists.”\n However, Maroja said, “They were very open about it.” In today’s academic climate, “a person having those views is fine. If they publish it and it becomes widely known, it’s another story,” she said.\n One of the greatest ironies of these types of requirements, according to Maroja, who is originally from Brazil, is that immigrants are sometimes among the most negatively impacted by them.\n “People who are not Americans…”, she said, “don’t understand what it is that they are expected to say.”\n Many Americans working in academic STEM, however, have come to understand what they are expected to say, and, whether sincere or not, make a grand display of saying it as loudly as they can.", "posttime": "2022-01-10 09:39:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "阻碍,takeover,故事", "title": "Dei接管茎阻碍能力'产生最好的科学'", "title_en": "DEI takeover of STEM hinders ability ‘to produce the best science’", "transed": 1, "url": "https://www.thecollegefix.com/dei-takeover-of-stem-hinders-ability-to-produce-the-best-science-say-scientists/", "via": "", "real_tags": ["阻碍", "takeover", "故事"]}, {"category": "", "categoryclass": "", "imagename": "4979e0bf78a41f42e8e1b4519c154e75.png", "infoid": 1072578, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我已经研究过，了解了客户端内存泄漏，以了解大多数Web开发人员都没有担心它们。如果Web应用程序在每次互动上泄漏5 MB，但它仍然有效，没有人通知，那么这很重要吗？ （有点听起来像“森林里的树”koan，但与我忍受。）\n首先，浏览器很清楚，Web是一个泄漏的混乱，并且已经无情地杀死了消耗太多内存的背景选项卡。 （我的前同事在Microsoft Edge Performance Team，Todd Reifsteck，告诉我，2016年回到2016年，“Web泄漏就像筛子。”）很多用户都是制表符（基本上使用标签为书签），并且有一个默契在浏览器和用户之间的了解，您无法在一次打开100个选项卡（从此开始主动运行并立即可用）。所以你点击几周大的标签，繁荣，页面加载时有一闪白的白色，而且没有人似乎很多。\n这将我们带到第二点：内存泄漏很难诊断。我已经写了很多关于这个问题，我不会重新返回旧内容。就此而言，可以说，该工具并不是真正取决于任务（尽管最近的最近的创新），即使您是具有多年的Web开发经验的退伍军人。一些绊倒我的Gotchas包括你必须忽略弱势的事实和循环引用，并且DevTools控制台本身可以泄漏内存。\n这是我想和fuite一起去的地方。如果您只需在网站上指出工具并让它告诉您究竟是哪一行代码导致泄漏，这将是惊人的。 （如果它可以打开拉动请求以修复泄漏，但嘿，让我们不要超越自己，更好。）\n感谢Jake Archibald和Todd Reifsteck关于这篇文章草案的反馈。", "note_en": "I’ve researched and learned enough about client-side memory leaks to know that most web developers aren’t worrying about them too much. If a web app leaks 5 MB on every interaction, but it still works and nobody notices, then does it matter? (Kinda sounds like a  “tree in the forest” koan, but bear with me.)\n Even those who have poked around in the browser DevTools to dabble in  the arcane art of memory leak detection have probably found the experience… daunting. The effort-to-payoff ratio is disappointingly high, especially compared to the hundreds of other things that are important in web development, like security and accessibility.\n  I would argue that they do matter, if only because the lack of care (as shown by  public-facing SPAs leaking up to 186 MB per interaction) is a sign of the immaturity of our field, and an opportunity for growth. Similarly, five years ago, there was much less concern among SPA authors for accessibility, security, runtime performance, or even ensuring that the back button maintained scroll position (or that the back button worked at all!). Today, I see a lot more discussion of these topics among SPA developers, and that’s a great sign that our field is starting to take our craft more seriously.\n So why should you, and why  shouldn’t you, care about memory leaks? Obviously I’m biased because I have an axe to grind (and a tool I wrote,   fuite), but let me try to give an even-handed take.\n  In terms of actual impact on the business of web development, memory leaks are a funny thing. If you speed up your website by 2 seconds, everyone agrees that that’s a good thing with a visible user impact. If you reduce your website’s memory leak by 2 MB, can we still agree it was worth it? Maybe not.\n Here are some of the unique characteristics of memory leaks that I’ve observed, in terms of how they actually fit into the web development process. Memory leaks are:\n   Most web apps can leak memory and no one will ever notice. Not the user, not the website author – nobody. There are a few reasons for this.\n First off, browsers are well aware that the web is a leaky mess and are already ruthless about killing background tabs that consume too much memory. (My former colleague on the Microsoft Edge performance team,  Todd Reifsteck, told me way back in 2016 that “the web leaks like a sieve.”) A lot of users are tab hoarders (essentially using tabs as bookmarks), and there’s a tacit understanding between browser and user that you can’t  really have 100 tabs open at once (in the sense that the tab is actively running and instantly available). So you click on a tab that’s a few weeks old, boom, there’s a flash of white while the page loads, and nobody seems to mind much.\n Second off, even for long-lived SPAs that the user may habitually check in on (think: GMail, Evernote, Discord), there are plenty of opportunities for a page refresh. The browser needs to update. The user doesn’t trust that the data is fresh and hits F5. Something goes wrong because  programmers are terrible at managing state, and users are well aware that the old turn-it-off-and-back-on-again solves most problems. All of this means that even a multi-MB leak can go undetected, since a refresh will almost always occur before an Out Of Memory crash.\n  Third, it’s a tragedy-of-the-commons situation, and people tend to blame the browser. Chrome is a memory hog. Firefox gobbles up RAM. Safari is eating all my memory. For reasons I can’t quite explain, people with 100+ open tabs are quick to blame the messenger. Maybe this goes back to the first point: tab hoarders expect the browser to automatically transition tabs from “thing I’m actively using” to “background thing that is basically a bookmark,” seamlessly and without a hitch. Browsers have  different  heuristics about this, some heuristics are better than others, and so in that sense, maybe it is the browser’s “fault” for failing to adapt to the user’s tab-hoarding behavior. In any case, the website author tends to escape the blame, especially if their site is just 1 out of 100 naughty tabs that are all leaking memory. (Although this may change as more browsers call out tabs individually in Task Manager, e.g.  Edge and  Safari.)\n  What’s interesting, though, is that every so often a memory leak will get so bad that people actually start to notice. Maybe someone opens up Task Manager and wonders why a note-taking app is consuming more RAM than DOTA. Maybe the website slows to a crawl after a few hours of usage. Maybe the users are on a device with low available memory (and of course the developers, with their 32GB workstations, never noticed).\n Here’s what often happens in this case: a ticket lands on some web developer’s desk that says “Memory usage is too high, fix it.” The developer thinks to themselves, “I’ve never given much thought to memory usage, well let’s take a stab at this.” At some point they probably open up DevTools, click “Memory,” click “Take snapshot,” and… it’s a mess. Because it turns out that the SPA leaks, has always leaked, and in fact has  multiple leaks that have accumulated over time. The developer assumes this is some kind of sudden-onset disease, when in fact it’s a pre-existing condition that has gradually escalated to stage-4.\n The funny thing is that the  source of the leak – the event listener, the subscriber, whatever – might not even be the proximate cause of the recent crisis. It might have been there all along, and was originally a tiny 1 MB leak nobody noticed, until suddenly someone attached a much bigger object to the existing leak, and now it’s a 100 MB leak that no one can ignore.\n Unfortunately to get there, you’re going to have to hack your way through the jungle of the half-dozen  other leaks that you ignored up to this point. (We fixed the leak! Oh wait, no we didn’t. We fixed the other leak! Oh wait, there’s still one more…) But that’s how it goes when you ignore a chronic but steadily worsening illness until the moment it becomes a crisis.\n  This brings us to the second point: memory leaks are hard to diagnose. I’ve already written  a lot about this, and I won’t rehash old content. Suffice it to say, the tooling is not really up to the task (despite some nice  recent innovations), even if you’re a veteran with years of web development experience. Some gotchas that tripped me up include the fact that you have to ignore  WeakMaps and circular references, and that  the DevTools console itself can leak memory.\n Oh and also, browsers themselves can have memory leaks! For instance, see these ResizeObserver/IntersectionObserver leaks in  Chromium,  Firefox, and  Safari (fixed in all but Firefox), or this Chromium leak in  lazy-loading images (not fixed), or  this discussion of a leak in Safari. Of course, the tooling will not help you distinguish between browser leaks and web page leaks, so you just kinda have to know this stuff. In short: good luck!\n Even with the tool that I’ve written,   fuite, I won’t claim that we’ve reached a golden age of memory leak debugging. My tool is better than what’s out there, but that’s not saying much. It can catch the dumb stuff, such as leaking event listeners and DOM nodes, and for the more complex stuff like leaking collections (Arrays, Maps, etc.), it can at least point you in the right direction. But it’s still up to the web developer to decide  which leaks are worth chasing (some are trivial, others are massive), and to track them down.\n I still believe that the browser DevTools (or perhaps professional testing tools, such as Cypress or Sentry), should be the ones to handle this kind of thing. The browser especially is in a much better position to figure out why memory is leaking, and to point the web developer towards solutions.  fuite is the best I could do with userland tooling (such as Puppeteer), but overall I’d still say we’re in the Stone Age, not the Space Age. (Maybe  fuite pushed us to the Bronze Age, if I’m being generous to myself.)\n  Here’s the really surprising thing about memory leaks, though, and perhaps the reason I find them so addictive and keep coming back to them: once you figure out where the leak is coming from, they’re usually trivial to fix. For instance:\n You added a DOM node, but forgot to remove it when the page transitions away.\n You might have a multi-MB leak, and the fix is one line of code. That’s a massive bang-for-the-buck! That is, if you discount the days of work it might have taken to find that line of code.\n This is where I would  like to go with  fuite. It would be amazing if you could just point a tool at your website and have it tell you exactly which line of code caused a leak. (It’d be even better if it could open a pull request to fix the leak, but hey, let’s not get ahead of ourselves.)\n I’ve taken some baby steps in this direction by adding  stacktraces for leaking collections. So for instance, if you have an Array that is growing by 1 on every user interaction,  fuite can tell you which line of code actually called  Array.push(). This is a huge improvement over v1.0 of  fuite (which just told you the Array was leaking, but not why), and although there are edge cases where it doesn’t work, I’m pretty proud of this feature. My goal is to expand this to other leaks (event listeners, DOM nodes, etc.), although since this is just a tool I’m building in my spare time, we’ll see if I get to it.\n  After releasing this tool, I also learned that  Facebook has built a similar tool and is planning to open-source it soon. That’s great! I’m excited to see how it works, and I’m hoping that having more tools in this space will help us move past the Stone Age of memory leak debugging.\n  So to bring it back around: should you care about memory leaks? Well, if your boss is yelling at you because customers are complaining about Out Of Memory crashes, then yeah, you absolutely should. Are you leaking 5 MB, and nobody has complained yet? Well, maybe an ounce of prevention is worth a pound of cure in this case. If you start fixing your memory leaks now, it might avoid that crisis in the future when 5 MB suddenly grows to 50 MB.\n Alternatively, are you leaking a measly ~1 kB because your routing library is appending some metadata to an Array? Well, maybe you can let that one slide. ( fuite will still report this leak, but I would argue that it’s not worth fixing.)\n On the other hand, all of these leaks are important in some sense, because even  thinking about them shows a dedication to craftsmanship that is (in my opinion) too often lacking in web development. People write a web app, they throw something buggy over the wall, and then they rewrite their frontend four years later after users are complaining too much. I see this all the time when I observe how my wife uses her computer – she’s constantly telling me that some app gets slower or buggier the longer she uses it, until she gives up and refreshes. Whenever I help her with her computer troubles, I feel like I have to make excuses for my entire industry, for why we feel it’s acceptable to waste our users’ time with shoddy, half-baked software.\n Maybe I’m just a dreamer and an idealist, but I really enjoy putting that final polish on something and feeling proud of what I’ve created. I notice, too, when the software I use has that extra touch of love and care – and it gives me more confidence in the product and the team behind it. When I press the back button and it doesn’t work, I lose a bit of trust. When I press  Esc on a modal and it doesn’t close, I lose a bit of trust. And if an app keeps slowing down until I’m forced to refresh, or if I notice the memory steadily creeping up, I lose a bit of trust. I would like to think that fixing memory leaks is part of that extra polish that won’t necessarily win you a lot of accolades, but your users will subtly notice, and it will build their confidence in your software.\n Thanks to  Jake Archibald and  Todd Reifsteck for feedback on a draft of this post.", "posttime": "2022-01-10 08:47:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "性能,内存,泄漏,leaks", "title": "内存泄漏：Web性能的遗忘方面", "title_en": "Memory leaks: the forgotten side of web performance", "transed": 1, "url": "https://nolanlawson.com/2022/01/05/memory-leaks-the-forgotten-side-of-web-performance/", "via": "", "real_tags": ["性能", "内存", "泄漏", "leaks"]}, {"category": "", "categoryclass": "", "imagename": "642d6d3930d6a8f7670ee33c46d6e19a.png", "infoid": 1072577, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "树木对5G变速器的影响可能对使用新的信号至关重要。\n为无线行业的新草坪而言，毫米波可能是解决方案的一部分。他们的波浪嵴仅为几毫米 - 与无线电波相比，距离很短的距离很长。他们的频率非常高，在30到300千兆赫兹之间的某处，或每秒十亿波峰。与传统的无线电传输相比，这是千赫兹（适用于AM）和Megahertz（fm）范围，新的5G信号确实是非常高的频率 - 与收音机的深度相比，在人类听力的上方的鸟类推文中，低音。\n（作为比较的衡量标准，该团队还看着不同类型的建筑材料。木门，石膏板墙和室内玻璃分别显示出高达40.5 dB，31.6 dB和18.1dB的损失，而外部建筑材料表现出更大的损失，高达66.5 dB。）", "note_en": "Measurements of trees’ impact on 5G transmissions could prove vital to using a new class of signal.\n  As 5G technology gets fully implemented over the next several years, cellphones and other wireless tech will grow more powerful with increased data flow and lower latency. But along with these benefits comes a question: Will your next-generation cellphone be unable to see the forest for the trees?\n That’s one way to describe the problem confronting cell network designers, who have to embrace both the benefits and shortcomings of a new class of signals that 5G will use: millimeter waves. Not only can these waves carry more information than conventional transmissions do, but they also usefully occupy a portion of the broadcast spectrum that communication technologies seldom use — a major concern in an age when broadcasters vie for  portions of spectrum like prospectors staking out territory.\n However, millimeter waves also have drawbacks, including their limited ability to penetrate obstacles. These obstacles include buildings, but also the trees that dot the landscape. Until recently little was known about how trees affected millimeter wave propagation. And just as few of us would want to imagine a landscape without greenery, few designers would be able to plan networks around it without such a crucial fundamental detail.\n The National Institute of Standards and Technology (NIST) has set out to solve this problem by measuring trees’ effect on millimeter waves. The effort could make a profound difference in our next-generation devices’ ability to see the 5G antennae that may soon sprout.\n The 5G era will feature wireless communication not only between people but also between devices connected to the Internet of Things. The increased demand for larger downloads by cell customers and lag-free network response by gamers has spurred the wireless industry to pursue speedier, more effective communication. Not only could our current devices and services work more effectively, but we could realize new ones: Autonomous vehicles will depend on such quick network response to function.\n “We will be able to do new things if our machines can exchange and process information quickly and effectively,” said Nada Golmie, head of NIST’s Wireless Networks Division in the Communications Technology Laboratory. “But you need a good communication infrastructure. The idea is to connect, process data in one place and do things with it elsewhere.”\n Millimeter waves, which are new turf for the wireless industry, could be part of the solution. Their wave crests are just a few millimeters apart — a very short distance compared with radio waves that can be several meters long. And their frequencies are very high, somewhere between 30 and 300 gigahertz, or billion wave crests per second. Compared with conventional radio transmissions, which are in the kilohertz (for AM) and megahertz (for FM) ranges, new 5G signals will be very high frequency indeed — something like a bird tweeting at the upper range of human hearing compared with radio’s deep, low bass.\n It is millimeter waves’ high frequency that makes them both tantalizing as data carriers and also hard to harness. On the one hand, more wave crests per second means the waves can carry more information, and our data-hungry era craves that capability to provide those faster downloads and network responses. On the other, high-frequency waves have trouble traveling through obstructions. Anyone who has passed near a house or car whose occupants are playing loud dance music knows that the throbbing bass frequencies are most of what reaches the outdoors, not the treble of a lilting soprano.\n For 5G networks, the obstructing wall can be no more than an oak leaf. For that reason, NIST scientists embarked on a somewhat unusual task in September 2019: They set up measurement equipment near trees and shrubs of different sizes around the agency’s Gaithersburg, Maryland, campus. The study continued for months, in part because they needed seasonal perspective.\n “The tree study is one of the few out there that looks at the same tree’s effect on a particular signal frequency through different seasons,” Golmie said. “We couldn’t only do the survey in the winter, because things would have changed by summer. It turns out that even the shape of leaves affects whether a signal will reflect or get through.”\n The team worked with the wireless community to develop the mobile equipment that was needed to take the measurements. The researchers focused it on single trees and aimed millimeter-wave signals at them from a range of angles and positions, to simulate waves coming from different directions. They measured the loss, or attenuation, in decibels. (Each 10 dB of loss is a reduction by a power of 10; a 30 dB attenuation would mean the signal is reduced by a factor of 1,000.)\n “The tree study is one of the few out there that looks at the same tree’s effect on a particular signal frequency through different seasons. Even the shape of leaves affects whether a signal will reflect or get through.” — Nada Golmie, NIST researcher\n For one type of leafy tree, the European nettle, the average attenuation in summer was 27.1 dB, but it relaxed to 22.2 dB in winter when the tree was bare. Evergreens blocked more of the signal. Their average attenuation was 35.3 dB, a number that did not change with the season.\n (As a measure of comparison, the team also looked at different types of  building materials. Wooden doors, plasterboard walls and interior glass showed losses of up to 40.5 dB, 31.6 dB and 18.1 dB, respectively, while exterior building materials exhibited even larger losses, up to 66.5 dB.)\n While NIST’s contributions to 5G network development effort could end up as ubiquitous as trees themselves, for most of us they will be considerably less visible. The measurements the team made are intended mainly for companies that create models of how different objects affect millimeter waves. Part of the effort was a  collaboration with Ansys Inc. The company used the measurement data NIST shared with it to tune the tree simulation models, which cell companies use to plan out their networks of antennas in detail.\n “Most models don’t include measurement-based information about trees,” said NIST’s David Lai, one of the scientists who conducted the study. “They might simply say that for a given tree-like shape, we should expect a certain amount of signal loss. We want to improve their models by providing accurate measurement-based propagation data.”\n NIST’s collaboration with Ansys contributed to guidance issued by the International Telecommunication Union ( ITU), the organization that creates guidelines for telecom standards. The results now appear as a new section on trees in ITU’s  Recommendation ITU-R P.833-10. This publication serves as a reference for signal propagation models, which others will develop.\n “Our goal is to get these measurements in front of the  entire wireless community,” Golmie said. “We hope this effort will help the entire marketplace.”", "posttime": "2022-01-10 08:43:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "5g,变速器,trees,相比", "title": "树木对5G变速器的影响", "title_en": "Measurements of trees’ impact on 5G transmissions", "transed": 1, "url": "https://www.nist.gov/news-events/news/2022/01/nist-helps-next-generation-cell-technology-see-past-greenery", "via": "", "real_tags": ["5g", "变速器", "trees", "相比"]}, {"category": "", "categoryclass": "", "imagename": "a30f2eedd9cf94ca117aaa963e19d056.jpg", "infoid": 1072576, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "研究人员发现，在200年前的自然真菌战争中发现，研究人员在刺猬皮肤上演化的第一个耐药物毒性菌株。\n“我们的研究表明，它并不是利用青霉素推动MRSA的初始出现，这是一种自然的生物过程。我们认为MRSA在刺猬皮肤上生存的战斗中，随后通过直接联系蔓延到牲畜和人类，“Wellcome Sanger Institute和剑桥大学和高级作者的研究员ewan哈里森研究，在剑桥的声明中。", "note_en": "The first strains of drug-resistant staph bacteria evolved on the skin of hedgehogs 200 years ago, researchers found, in response to natural fungal warfare.\n The origins of a notorious bacterial superbug can be traced back to hedgehogs that lived centuries ago, new research this week suggests. The study found evidence that one particular type of methicillin-resistant  Staphylococcus aureus, also known as MRSA, first emerged on the skin of hedgehogs. The bacteria likely evolved resistance in response to fungus also living on hedgehogs that naturally produced antibiotic compounds to kill off their competitors—long before humans began using antibiotic drugs to treat these infections.\n  MRSA is one of the most well-known examples of antibiotic resistance. The term refers to any strains of  S. aureus that are resistant to beta-lactam antibiotics—a class of antibiotics that include methicillin but also many other drugs, including penicillin.  S. aureus strains, including MRSA, live naturally on our skin and elsewhere, typically without causing trouble. But when these bacteria do cause illness, often among people hospitalized or in poorer health, MRSA infections can be much harder to get rid of with conventional treatments and can turn deadly.\n Scientists   discovered the existence of MRSA almost immediately after methicillin became the standard drug of choice for staph infections in the 1960s. But it wasn’t until the 1990s that MRSA became widely known, as rates of hospital-related cases climbed and strains spreading between people outside of hospitals began to emerge. There has been   some progress in stemming the tide of MRSA within hospitals since then, though this progress may have slowed down in recent years. The Centers for Disease Control and Prevention estimates that almost 120,000 Americans   contracted serious bloodstream infections of MRSA in 2017, while nearly 20,000 died as a result.\n    The widespread use of antibiotics in medicine and agriculture since the 1940s has fostered the emergence of drug-resistant infections, including MRSA. But a few years ago, scientists made a curious discovery: Hedgehogs living in   Sweden and   other European countries seemed to widely carry a form of MRSA known as mecC-MRSA. mecC-MRSA is thought to cause only a sliver of MRSA infections in humans, and while other animals have been documented to carry it, rates of colonization were much higher in these hedgehogs (around two-thirds had it). This led scientists at the time to theorize that hedgehogs have been a natural host for mecC-MRSA for at least decades.\n  This new research,   published in Nature on Wednesday, has found genetic evidence that this timeline goes back much further. An international group of researchers from the UK, Denmark, Sweden, and elsewhere, including some of the first to document mecC-MRSA in hedgehogs and other animals, collaborated for the study. They sequenced the genomes of hedgehog MRSA strains and compared them to other  S.  aureus strains in order to build a likely family tree.\n   Near as they can tell, the lineages that first gave rise to the hedgehog-related MRSA we see today began in the 19th century, about 200 years ago. The team also found that a common fungus living on hedgehog skin, known as  Trichophyton erinacei, can produce two different types of beta-lactam antibiotics. And in the lab, hedgehog MRSA strains did appear better able to survive against these antibiotics than other strains.\n  “Our study suggests that it wasn’t the use of penicillin that drove the initial emergence of MRSA, it was a natural biological process. We think MRSA evolved in a battle for survival on the skin of hedgehogs, and subsequently spread to livestock and humans through direct contact,” said senior study author Ewan Harrison, a researcher at the Wellcome Sanger Institute and the University of Cambridge and a senior author of the study, in a   statement from Cambridge.\n  mecC-MRSA infections in humans are rare and are typically mild and easily treated with other antibiotics when they do happen. So even though these bacteria may have occasionally sickened us over the past 200 years, the findings shouldn’t make us fearful of hanging out with hedgehogs, the authors say.\n But they do illustrate that the world is a smaller and more connected place than we might think. Because most antibiotics we use today are derived from natural sources, this may not be the only example of important antibiotic resistance that has existed prior to the antibiotic era of medicine. And we already know that antibiotic resistance   found in other animals can have serious health consequences for humans. That said, while some animals may play host to their own native superbugs, our   continued overuse of antibiotics in livestock also plays a major, if not leading, role in causing this resistance.\n  “These results underscore the importance of taking a broad One Health perspective on antibiotic resistance that recognizes the role of natural selection in wild animals and the connectivity of natural, agricultural and human ecosystems in the evolution and spread of antibiotic-resistant pathogens,” the researchers wrote.", "posttime": "2022-01-10 08:42:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "表明,blame,研究", "title": "研究表明，刺猬责备MRSA Superbug，而不是现代抗生素", "title_en": "Hedgehogs to Blame for a MRSA Superbug, Not Modern Antibiotics, Study Suggests", "transed": 1, "url": "https://gizmodo.com/hedgehogs-to-blame-for-a-mrsa-superbug-not-modern-anti-1848301189", "via": "", "real_tags": ["表明", "blame", "研究"]}, {"category": "", "categoryclass": "", "imagename": "227c6b2c0c2867726fbd76406457807d.jpg", "infoid": 1072575, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "免费横向流动测试面向斧头，根据与Covid一起生活，鲍里斯约翰逊将在几周内宣布。", "note_en": "Free lateral flow tests face the axe under plans for living with Covid which Boris Johnson will announce within weeks.\n More than £6 billion of public money has been spent on mass testing using the devices.\n  The new system could mean free tests being provided only in high-risk settings such as care homes, hospitals and schools, and to people with symptoms. Contact tracing by NHS Test and Trace is also likely to be scaled back.\n A senior Whitehall source said: “I don’t think we are in a world where we can continue to hand out free lateral flow tests to everybody for evermore. It’s likely we will move to a scenario where there is less testing but where we have a capacity to ramp it", "posttime": "2022-01-10 08:42:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,国家,lateral,横向", "title": "作为国家与covid一起生活的国家的免费横向流动测试结束", "title_en": "End of free lateral flow tests as country told to live with Covid", "transed": 1, "url": "https://www.thetimes.co.uk/article/end-of-free-lateral-flow-tests-as-country-told-to-live-with-covid-3bpz8lnqf", "via": "", "real_tags": ["免费", "国家", "lateral", "横向"]}]