[{"category": "", "categoryclass": "", "imagename": "4f73512808373fbdc93251c2d18798f1.jpg", "infoid": 1030579, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "相反，Squcke(其品牌名称是“PSYKHE”)是一家电商初创公司，它利用人工智能和心理学根据用户的个性特征和产品的“个性”做出产品推荐。诚然，已经有一些初创公司来来往往地声称这一点，但它声称已经采取了一种独特的方法，通过充当一个聚合器，从所有领先的时尚零售商那里拉出产品，从而使购买时尚的过程变得更容易。该公司表示，每个用户看到的店面都不同，变得越来越个性化。\n它现在已经从一系列投资者那里筹集了170万美元的种子资金，并宣布了新的计划，在未来将其技术扩展到B2B领域的其他消费垂直市场。\n这些投资者包括：Carmen Busquets--Net-a-Porter的最大创始投资者；SLS Journey--北美奢侈品分销商MadaLuxe集团的新投资部门；John Skipper-DAZN董事长、迪士尼媒体网络公司前联席董事长和ESPN总裁；以及Lara Vanjak--Aser Ventures首席运营官，曾在MP&amp；Silva和FC International-米兰任职。\n那么它是做什么的呢？作为一家B2C聚合器，它汇集了领先零售商的库存。然后，该平台应用机器学习和个性特征科学，并根据注册时进行的个性测试，为用户量身定做产品推荐。该公司表示，它拥有正在申请的国际专利，并已与包括Moda Operandi、MyTheresa、LVMH的Platform 24s和11 Honoré在内的领先零售商建立了合作伙伴关系。\n这种商业模式是基于联属伙伴关系模式的，在这种模式下，它从每笔销售中赚取5-25%的收入。它还计划在未来扩展到其他垂直消费者的B2B领域，提供一种插件产品，允许用户根据自己的个性对商品进行排序。\n这项性格测试有什么帮助呢？好的，mental khe为实际产品本身分配了一个整体的心理特征：使用机器学习(基于训练数据)，来自商业合作伙伴的100多万种产品。\n例如，如果一只皮靴上有金属钉(这样看起来更“叛逆”)，它在“宜人”这一特征上会得到中等偏低的评分。粉红色的花朵连衣裙在这一特点上会得到更高的分数。一件保守的粗花呢上衣在“开放”的特征上得分较低，因为粗花呢上衣往往意味着更保守的风格，因此也就是自然。\n到目前为止，Mental khe的零售合作伙伴包括Moda Operandi、MyTheresa、LVMH的Platform 24s、Outdoor Voices、Jimmy Choo、Coach和尺寸包罗万象的Platform 11 Honoré。\n它的竞争对手包括Yes和Lyst。然而，精神病学的主要区别点是这种个性评分。此外，Yes仅限应用程序，仅限美国，仅与单一品牌合作，而Lyst是一个拥有1000个品牌的聚合器，但更多地被用作搜索平台。\n精神科处于一个很好的位置，可以利用新冠肺炎的持续影响，随着人们在封锁期间涌入网上，微博继续对全球电子商务产生重大推动作用。\n这家初创公司是首席执行官兼Amp；创始人安娜贝尔·马尔多纳多(与创始团队CTO威尔·帕尔默和首席数据科学家雷内-让·科内尔，见上图)的创意，她在家乡多伦多学习心理学，但最终在英国NHS的一个专家团队工作，为5岁以下的儿童进行发育诊断。\n在赢得英国“玛丽·克莱尔”杂志编辑导师的竞争后，她转向时尚界。后来她去了克里斯蒂安·鲁布托(Christian Louboutin)的新闻部，随后在星期日邮报(The Mail On Sunday)和玛丽·克莱尔(Marie Claire)实习，然后在杂志出版业工作了几年，然后进入CoutureLab从事电子商务。作为自由撰稿人，她曾与多个奢侈品牌和平台合作，担任编辑顾问。作为一名时尚记者，她曾为“时尚商业”、“纽约时报风尚”和“玛丽·克莱尔”等刊物撰写行业专栏。\n作为时尚界10年的一员，她说，她对那些“让时尚看起来比实际更轻浮”的叙述感到沮丧。我想，这是一个价值万亿美元的行业，我们都对基于我们是谁的审美有如此情绪化的、发自内心的反应，但我们一直在谈论的只是“秋季的热门新颜色和所谓的毯子”。\n但是，她说，“没有对个体差异进行调查。这个世界真的缺乏应有的深度，我试图证明，我们都以这样或那样的方式对审美敏感，基于我们独特的内在需求，我们的服装选择对我们有很大的心理回报作用。“。因此，她开始创建一家初创公司来解决这种“时尚心理”-或者，正如她所说的“我们为什么要穿我们穿的衣服”。", "note_en": "Instead,  Psycke ( it’s brand name is ‘PSYKHE’) is an e-commerce startup that uses AI and psychology to make product recommendations based both on the user’s personality profile and the  ‘personality’ of the products. Admittedly, a number of startups have come and gone claiming this, but it claims to have taken a unique approach to make the process of buying fashion easier by acting as an aggregator that pulls products from all leading fashion retailers. Each user sees a different storefront that, says the company, becomes increasingly personalized.\n It has now raised $1.7 million in seed funding from a range of investors and is announcing new plans to scale its technology to other consumer verticals in the future in the B2B space.\n  The investors are Carmen Busquets – the largest founding investor in Net-a-Porter; SLS Journey – the new investment arm of the MadaLuxe Group, the North American distributor of luxury fashion; John Skipper – DAZN Chairman and former Co-chairman of Disney Media Networks and President of  ESPN;   and Lara Vanjak – Chief Operating Officer at Aser Ventures, formerly at MP &amp; Silva and FC Inter-Milan.\n   So what does it do? As a B2C aggregator, it pools inventory from leading retailers. The platform then applies machine learning and personality-trait science, and tailors product recommendations to users based on a personality test taken on sign-up. The company says it has international patents pending and has secured affiliate partnerships with leading retailers that include  Moda Operandi,   MyTheresa, LVMH’s platform 24S, and 11 Honoré.\n The business model is based around an affiliate partnership model, where it makes between 5-25% of each sale. It also plans to expand into B2B for other consumer verticals in the future, providing a plug-in product that allows users to sort items by their personality.\n How does this personality test help? Well, Psykhe has assigned an overall psychological profile to the actual products  themselves: over 1 million products from commerce partners, using machine learning (based on training data).\n So for example, if a leather boot had metal studs on it (thus looking more ‘rebellious’), it would get a moderate-low rating on the trait of ‘Agreeableness’. A pink floral dress would get a higher score on that trait. A conservative tweed blazer would get a lower score tag on the trait of ‘Openness’, as tweed blazers tend to indicate a more conservative style and thus nature.\n So far, Psykhe’s retail partnerships include Moda Operandi, MyTheresa,  LVMH’s   platform 24S,  Outdoor Voices,   Jimmy Choo, Coach, and size-inclusive platform 11 Honoré.\n It’s competitors include  The Yes and  Lyst. However, Psykhe’s main point of differentiation is this personality scoring. Furthermore, The Yes is app-only, US-only, and only partners with monobrands, while  Lyst   is an aggregator with 1,000s of brands, but used as more of a search platform.\n Psykhe is in a good position to take advantage of the ongoing effects of COVID-19, which continue to give a major boost to global ecommerce as people flood online amid lockdowns.\n The startup is the brainchild of  Anabel Maldonado, CEO &amp; founder, (along with founding team CTO Will Palmer and Lead Data Scientist, Rene-Jean Corneille, pictured above), who studied psychology in her hometown of Toronto, but ended up working at in the UK’s NHS in a specialist team that made developmental diagnoses for children under 5.\n She made a pivot into fashion after winning a competition for an editorial mentorship at British Marie Claire. She later went to the press department of Christian Louboutin, followed by internships at the Mail on Sunday and Marie Claire, then spending several years in magazine publishing before moving into e-commerce at CoutureLab. Going freelance, she worked with a number of luxury brands and platforms as an editorial consultant. As a fashion journalist, she’s contributed industry op-eds to publications such as The Business of Fashion, T The New York Times Style, and Marie Claire.\n As part of the fashion industry for 10 years, she says she became frustrated with the narratives which “made fashion seem more frivolous than it really is. I thought, this is a trillion-dollar industry, we all have such emotional, visceral reactions to an aesthetic based on who we are, but all we keep talking about is the ‘hot new color for fall and so-called blanket “must-haves’.”\n But, she says, “there was no inquiry into individual differences. This world was really missing the level of depth it deserved, and I sought to demonstrate that we’re all sensitive to aesthetic in one way or another and that our clothing choices have a great psychological pay-off effect on us, based on our unique internal needs.” So she set about creating a startup to address this ‘fashion psychology’ – or, as she says “why we wear what we wear”.", "posttime": "2020-10-22 23:31:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "khe,secures,产品", "title": "\nMental Khe获得种子资金，将消费者个性与时尚产品相匹配", "title_en": "\n\t\t\t\tPsykhe secures Seed funding to match consumer personalities to fashion products\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/22/psycke-secures-seed-funding-to-match-consumer-personalities-to-fashion-products/", "via": "", "real_tags": ["khe", "secures", "产品"]}, {"category": "", "categoryclass": "", "imagename": "2a62edcef7e5b74386c09b882d30277a.jpg", "infoid": 1030577, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一位苏格兰博学者如何永远改变了科学界的性别进程，并使连接看似脱节的事物成为一门高超的艺术。\n更新：萨默维尔不同寻常的故事，以及“科学家”一词是如何创造出来的更全面的背景，占据了计算的一部分。\n科学史上充斥着杰出的女性，她们克服了机会的极度匮乏和高耸的性别偏见，以改变了我们对现实、宇宙和我们在其中的位置的理解的方式，为人类知识库做出了贡献。回过头来看，他们的遗产生活在振奋人心和令人心碎之间-既是对他们非凡天才的证明，也是对剥夺全体人民基本人权的悲剧的悲歌。其中最引人注目的例子是发现核裂变但被剥夺诺贝尔奖的先驱物理学家丽丝·梅特纳(Lise Meitner)，发现脉冲星的天体物理学家乔斯林·贝尔·伯内尔(Jocelyn Bell Burnell)，同样因为她自己的发现而被排除在诺贝尔奖之外，以及天文学家维拉·鲁宾(Vera Rubin)，她证实了暗物质的存在，在接近90岁时仍被剥夺诺贝尔奖。这些女性，就像早期的女天文学家在被允许投票前几十年做出革命性的天文发现一样，从不等待现状赶上她们的智力力量和优点。但是，尽管我们有所谓的文化进步，但女性在科学劳动大军中所占的比例仍然远远不到一半。\n女性应该面对这样一种珠穆朗玛峰般的包容和平等，这是一种奇怪而相当残酷的文化讽刺，因为“科学家”这个词在近代史上并不总是具有压倒性的男性内涵。事实上，它是为一位女性创造的-维多利亚时期的博学者玛丽·萨默维尔(1780年12月26日-1872年11月28日)，她曾指导过计算机程序员先驱艾达·洛夫莱斯，后来将她介绍给查尔斯·巴贝奇，从而引发了他们在世界上第一台计算机上的传奇合作。萨默维尔1834年发表的关于“物理科学的联系”的论文给她的同行、读者和评论家留下了如此深刻的印象，以至于“科学人”-这个用来指推动知识进步的人-似乎突然变得不合适和过时了。\n学者Renée Bergland在“玛丽亚·米切尔和科学的性别：美国浪漫主义者中的天文学家”(公共图书馆)中讲述了这个词鲜为人知的起源-这是一部从这位为美国女性在科学领域铺平道路的开创性天文学家的传记中向着中心展开的精彩文化史。\n1834年，剑桥唐·威廉·惠威尔(Cambridge Don William Whewell)写了一篇关于苏格兰研究员玛丽·萨默维尔(Mary Somerville)的免费文章，她博学的书籍将以前截然不同的数学、天文学、地质学、化学和物理领域清晰地结合在一起，以至于这些教材成为剑桥大学第一个科学课程的主干。他称萨默维尔为科学家，部分原因是“科学人”似乎不适合女性，但更重要的是因为萨默维尔的工作是跨学科的。她不仅是天文学家、物理学家或化学家，而且是一位富有远见的思想家，清楚地阐述了各研究分支之间的联系。根据萨默维尔传记作家凯瑟琳·尼利(Kathryn Neeley)的说法，惠威尔创造的“科学家”一词不仅仅是一个中性的术语。惠威尔想要一个词来积极颂扬“女性心灵的奇特光芒”：把不同的领域综合成一门学科的能力。\n一个世纪后，当弗吉尼亚·伍尔夫称赞雌雄同体思维的创造性至高无上时，她指的就是这种能力。\n惠威尔称萨默维尔为“真正的科学人”，而不是他略微鄙视的仅仅是科学的普及者。在提出“科学家”一词时，他强调它与“艺术家”一词的构成方式相似。事实上，他在萨默维尔已经认识到，在看似脱节的事物之间画出联系的独一无二的创作天才，这本身就是一种艺术成就。25年后，萨默维尔的美国同行玛丽亚·米切尔(Maria Mitchell)在“大西洋月刊”(The Atlantic)上发表了一篇对萨默维尔天才的美丽赏析，捕捉到了这一不同寻常的天赋：\n阅读数学著作是一件容易的事；公式是可以学习的，它们的意义也是可以理解的：要阅读其中最深刻的部分，要带着与创始人并肩而立的伟大思想的欣赏，需要更高层次的智力；而深远的是，它在研究几个通过观察而知道的现象时，发展了世界理论，追溯了它们的历史，勾勒出了它们未来命运的轮廓。\n1835年，在萨默维尔的论文和惠威尔创造“科学家”一词的一年后，萨默维尔加入了天文学家卡罗琳·赫歇尔的行列，两人成为历史悠久的皇家天文学会的第一批女性会员。但是，为了避免我们忘记进步的结构性步伐，萨默维尔进入科学的万神殿绝非一帆风顺。尽管用米切尔的话说，她被誉为“欧洲最有学问的女性”，但由于她的性别原因，她被拒绝进入梵蒂冈天文台。不过，如果没有她的毅力--这证明了苏珊·桑塔格(Susan Sontag)所说的“榜样的勇气”--女性在科学领域的成就曲线可能会截然不同，无疑会花费更长的时间才能走向正义和平等。\n这是对玛丽亚·米切尔(Maria Mitchell)关于为什么女性比男性更适合从事天文学的补充，爱因斯坦给一位想成为科学家但担心性别会阻碍她的年轻南非女孩的大胆建议，以及这篇精彩的图文并茂的对科学界女性的庆祝。\n更新：更多关于萨默维尔，她不同寻常的生活，以及她影响深远的遗产的信息，请参见我的书“计算”(Figuring)。\n自2006年以来的每周，我都投入大量的时间、思想、爱心和资源来挑选人才，这仍然是免费的(而且没有广告)，而且是靠赞助实现的。我一个月要花几百个小时去研究和创作，还要花几千美元来维持。如果你在这份爱的劳动中找到任何快乐和慰藉，请考虑成为一名持续的赞助人，在一杯茶和一顿丰盛的午餐之间，你可以选择每月定期捐赠。你的支持真的很重要。\n“脑筋急转弯”周日免费摘录了本周最有趣、最鼓舞人心的文章，内容涉及艺术、科学、哲学、创造力、儿童读物，以及我们追求真、美和意义的其他方面。这里有一个例子。喜欢?。认领您的：\n还有：因为“脑洞大开”已经是第14个年头了，而且我主要写的是一个永恒人物的想法，所以我决定每周三一头扎进我庞大的档案馆，从数以千计的文章中挑选一篇值得重新浮现和保存的文章。订阅这款免费的周中提神产品吧，以下是心灵、头脑和精神的提神之作-它与周日的标准新作品摘要是分开的：", "note_en": "How a Scottish polymath forever changed the course of gender in science and made a high art of connecting the seemingly disconnected.\n    UPDATE: Somerville’s remarkable story, along with a fuller context of how the word “scientist” was coined, occupies a portion of   Figuring.\n The history of science is strewn with remarkable women who overcame a crushing dearth of opportunity and towering gender bias to contribute to the corpus of human knowledge in ways that have transformed our understanding of reality, the universe, and our place in it. In history’s hindsight, their legacy lives between the heartening and the heartbreaking — both a testament to their extraordinary genius and an elegy for the tragedy of denying basic human rights to entire populations. Among the most blazing examples are pioneering physicist Lise Meitner, who  discovered nuclear fission but was denied the Nobel Prize for the discovery, astrophysicist Jocelyn Bell Burnell, who  discovered pulsars and was similarly excluded from the Nobel for her own discovery, and astronomer Vera Rubin, who  confirmed the existence of dark matter and is still bereft of a Nobel as she approaches her ninth decade. These were women who, like the early female astronomers  making revolutionary astronomical discoveries decades before they were allowed to vote, never waited for the status quo to catch up to their intellectual might and merit. But despite our so-called cultural progress, women still comprise  far less than half of the scientific workforce.\n That women should face such an Everestine climb toward inclusion and equality is a piece of curious and rather cruel cultural irony, for the very word “scientist” didn’t always have the overwhelmingly male connotations it has had in recent history. In fact, it was a coined for a woman — the Victorian polymath  Mary Somerville (December 26, 1780–November 28, 1872), who had tutored pioneering computer programmer  Ada Lovelace and later introduced her to Charles Babbage, thus sparking their  legendary collaboration on the world’s first computer. Somerville’s 1834 treatise  On the Connexion of the Physical Sciences so impressed her peers, readers, and reviewers that “man of science” — the term used to refer to a person who had advanced the progress of knowledge — seemed suddenly inappropriate and obsolete.\n  Scholar Renée Bergland relays the little-known origin of the word in    Maria Mitchell and the Sexing of Science: An Astronomer Among the American Romantics (  public library) — a terrific cultural history unfolding centripetally from the biography of the trailblazing astronomer who  paved the way for American women in science.\n  In 1834, the Cambridge don William Whewell wrote a complimentary article about Mary Somerville, a Scottish researcher whose erudite books brought together previously disparate fields of mathematics, astronomy, geology, chemistry, and physics so clearly that the texts became the backbone of Cambridge University’s first science curriculum. He called Somerville a scientist, in part because “man of science” seemed inappropriate for a woman, but more significantly because Somerville’s work was interdisciplinary. She was no mere astronomer, physicist, or chemist, but a visionary thinker who articulated the connections among the various branches of inquiry. According to Somerville’s biographer Kathryn Neeley, Whewell’s coinage of the word “scientist” was not meant to be merely a gender-neutral neutral term. Whewell wanted a word that actively celebrated “the peculiar illumination of the female mind”: the ability to synthesize separate fields into a single discipline.”\n It was this ability that Virginia Woolf meant when she  lauded the creative supremacy of the androgynous mind a century later.\n Whewell called Somerville “a person of real science,” as opposed to the mere popularizers of science whom he held in mild disdain. In suggesting the term “scientist,” he emphasized its similarity to how the word “artist” is formed. Indeed, he had recognized in Somerville that singular creative genius of drawing connections between the seemingly disconnected, which is itself an artistic achievement. Maria Mitchell, Somerville’s American counterpart, would capture this uncommon gift in a beautiful appreciation of Somerville’s genius published in  The Atlantic a quarter century later:\n To read mathematical works is an easy task; the formulae can be learned and their meaning apprehended: to read the most profound of them, with such appreciation that one stands side by side with the great minds who originated them, requires a higher order of intellect; and far-reaching indeed is that which, pondering in the study on a few phenomena known by observation, develops the theory of worlds, traces back for ages their history, and sketches the outline of their future destiny.\n In 1835, a year after the publication of her treatise and Whewell’s coinage of the word “scientist,” Somerville joined astronomer  Caroline Herschel as the two became the first women ever admitted into the venerable Royal Astronomical Society. But, lest we forget the tectonic pace of progress, Somerville’s entry into the pantheon of science was far from unobstructed. Despite being celebrated as “the most learned woman in Europe,” in Mitchell’s words, she was denied entry into the Vatican Observatory on account of her gender. Still, without her perseverance — a testament to what Susan Sontag called  “the courage of an example” — the arc of accomplishment for women in science would have been rather different and would have undoubtedly taken even longer to bend toward justice and equality.\n Complement with Maria Mitchell on  why women are better suited for astronomy than men, Einstein’s emboldening  letter of advice to a young South African girl who wanted to be a scientist but feared her gender would hold her back, and this wonderful  illustrated celebration of women in science.\n UPDATE: Find more of Somerville, her unusual life, and her far-reaching legacy, in my book   Figuring.\n    Every week since 2006, I have been pouring tremendous time, thought, love, and resources into  Brain Pickings, which remains free (and ad-free) and is made possible by patronage. It takes me hundreds of hours a month to research and compose, and thousands of dollars to sustain. If you find any joy and solace in this labor of love, please consider becoming a Sustaining Patron with a recurring monthly donation of your choosing, between a cup of tea and a good lunch. Your support really matters.\n Brain Pickings has a free Sunday digest of the week&#39;s most interesting and inspiring articles across art, science, philosophy, creativity, children&#39;s books, and other strands of our search for truth, beauty, and meaning. Here&#39;s an  example. Like? Claim yours:\n Also: Because  Brain Pickings is in its fourteenth year and because I write primarily about ideas of a timeless character, I have decided to plunge into my vast archive every Wednesday and choose from the thousands of essays one worth resurfacing and resavoring. Subscribe to this free midweek pick-me-up for heart, mind, and spirit below — it is separate from the standard Sunday digest of new pieces:", "posttime": "2020-10-22 23:27:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,名字,somerville,女性", "title": "玛丽·萨默维尔：“科学家”这个词就是以她的名字命名的(2016)", "title_en": "Mary Somerville: The Woman for Whom the Word “Scientist” Was Coined (2016)", "transed": 1, "url": "https://www.brainpickings.org/2016/12/26/mary-somerville-scientist/", "via": "", "real_tags": ["科学家", "名字", "女性"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1030576, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "独处 / 隐私 / 秘密 / 隐居", "note_en": "Privacy", "posttime": "2020-10-22 23:27:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,道德,ethical,秘密", "title": "荷兰道德黑客登录特朗普的Twitter账户", "title_en": "Dutch Ethical Hacker Logs into Trump’s Twitter Account", "transed": 1, "url": "https://www.volkskrant.nl/nieuws-achtergrond/dutch-ethical-hacker-logs-into-trump-s-twitter-account~badaa815/", "via": "", "real_tags": ["黑客", "道德", "ethical", "秘密"]}, {"category": "", "categoryclass": "", "imagename": "b59eb719ab321ad5cfa328bbe4c0baa0.jpg", "infoid": 1030575, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在冠状病毒大流行的早期，航空旅行看起来像是一项有风险的努力。一些科学家甚至担心飞机可能成为超级传播事件的地点。例如，3月份，一名越南女商人喉咙痛，咳嗽，在伦敦登上了一架航班。十个小时后，她降落在越南河内；她感染了航班上的15人，其中包括与她坐在商务舱的一半以上的乘客。\n然后在4月份，航空公司改变了路线。许多航空公司开始要求乘客在飞机上戴口罩-一些航空公司甚至执行了这项政策。就在周一，美国疾病控制和预防中心(Centers For Disease Control And Prevention)表示，现在强烈建议所有乘客和机组人员戴口罩。\n所以最大的问题是：口罩的效果如何？他们能安全地飞越这个国家去探亲吗？\n科学家们刚刚开始回答这个问题。他们的发现带来了一线希望，同时也为在飞机上保护自己最重要的东西提供了新的想法。\n新的证据主要来自香港，那里的卫生官员一直在对所有在这座城市降落的乘客进行仔细的测试和跟踪。阿拉巴马大学伯明翰分校的传染病医生大卫·O·弗里德曼(David O.Freedman)说，他们在抵达时对每个人进行PCR检测，将他们隔离在单人房间14天，然后再次对乘客进行检测。因此，那里的卫生官员知道哪些乘客在已经感染病毒的情况下登上了飞机，以及他们是否可能感染了飞机上的其他任何人。\n弗里德曼和他的同事一直在分析这些数据，并特别关注一家航空公司：阿联酋航空公司。\n弗里德曼说，自4月份以来，阿联酋航空一直实行非常严格的蒙面政策。航空公司不仅要求乘客和机组人员戴口罩，空乘人员还确保每个人在整个飞行过程中尽可能多地戴口罩。\n弗里德曼查看了6月16日至7月5日期间所有阿联酋航空公司从迪拜飞往香港的航班。他的发现很能说明问题。在这三周内，阿联酋航空有五个航班，每个航班上有七名或更多受感染的乘客，总共有58名冠状病毒阳性的乘客乘坐了8小时的航班。然而，弗里德曼和他的同事在“旅行医学杂志”(Journal Of Travel Medicine)上报道，飞机上没有其他人-其他1500到2000名乘客-都没有感染病毒。\n在另一架阿联酋航空公司的航班上，多达27名冠状病毒呈阳性的人在迪拜登机。猜猜在8小时的飞行中还有多少乘客被感染了？\n如果没有口罩，他预计会有更多的病例。弗里德曼和他的同事发现了其他几个没有传播的高风险航班，包括一架从东京飞往以色列特拉维夫的公务机，11名乘客中有两名感染了冠状病毒。\n弗里德曼说，他们都坐在一个非常小的环境里，因为那是一架公务机。又一次，因为乘客戴着精心遮盖的面具，所以没有传输。剧组人员监督了蒙面工作。\n弗里德曼说，事实上，自从航空公司开始要求戴口罩以来，科学家们还没有记录过航空公司发生过一次超级传播事件。记录有重大传播记录的航班是大流行早期的航班。\n总而言之，这些数据表明口罩正在工作-而且工作得很好。他说，许多飞行中都有令人鼓舞的证据表明，蒙面确实有很大帮助，但更好地研究它会很好。间接证据是，如果有坚硬的面具，你在飞机上的风险很低。\n最后一部分是关键。为了在飞机上保持较低的风险，每个人在乘坐飞机时都需要戴上口罩。\n为什么？据美国运输司令部周四报道，飞机拥有出色的空气通风和过滤系统，大约每六分钟就能清除空气中的冠状病毒颗粒。\n弗吉尼亚理工大学的工程师林赛·马尔(Linsey Marr)说，所以将病毒吸入体内的唯一机会是在病毒通过通风系统之前从你身边经过的空气。因此，只有当你坐得离生病的人很近的时候，这种情况才会发生。\n换句话说，由于飞机的过滤系统，你在飞机上感染冠状病毒的风险几乎完全来自坐在你周围的人。而当其他乘客戴上口罩时，这种风险就会降低。\n口罩可以阻挡人释放到周围空气中的一些病毒颗粒。它还可以减少你吸入的病毒数量。Marr说，它还可以防止大滴的唾液和唾液滴到你的鼻子和嘴巴上。\n出于这些原因，马尔说，当她飞行时，她会仔细选择戴哪个口罩。\n我把最好的面具留到飞机上。她说，它有两层高效空气过滤器，可以去除99%以上的颗粒物。这不是我的日常口罩。我不能就这样把它挂在脖子上。这比那更麻烦。\n你现在还买不到N95口罩，但如果你碰巧有，马尔建议你使用它--甚至是P100口罩，它包括一个塑料面罩和能去除99.97%病毒颗粒的微粒过滤器或滤芯。在飞机上，你想要最好的，她重申。但只要确保它合身就行了，而且要记住，口罩不会保护你的眼睛。因此，你可能要考虑戴上面罩、护目镜或其他类型的眼睛保护。\n还要记住对座椅周围的表面进行消毒，如扶手、托盘桌和座椅靠背。您可以使用洗手液或漂白湿巾，并尽量在整个飞行过程中定期使用。马尔说，尽量避免触摸你的脸。把闲聊保持在最低限度。当你说话的时候，你可以释放出10倍于你安静时的水滴和气溶胶。\n最后，弗里德曼说，在整个旅行过程中，不要忘记戴上口罩和社交距离--无论是往返机场、在机场等候，还是在登机和下机时。\n弗里德曼说，对我来说，(飞行)最可怕的部分之一是下机过程。航空公司可以控制人们上飞机，但下飞机可能会很混乱，因为每个人都会匆忙下飞机。\n弗里德曼说，出于这个原因，他和妻子今年不会飞去过感恩节。他们改乘美国铁路公司的列车。", "note_en": "Early in the coronavirus pandemic, air travel looked like a risky endeavor. Some scientists even worried that airplanes could be sites of superspreading events. For example, in March a Vietnamese businesswoman with a sore throat and a cough boarded a flight in London. Ten hours later, she landed in Hanoi, Vietnam; she  infected 15 people on the flight, including more than half of the passengers sitting with her in business class.\n  Then in April, airlines shifted course. Many started requiring passengers to wear masks on planes — and some airlines even enforced the policy. Just on Monday, the Centers for Disease Control and Prevention  said it now &#34;strongly recommends&#34; all passengers and crew members wear masks.\n  So the big question is this: How well do the masks work? Do they make it safe to fly across the country for a family visit?\n  Scientists are just beginning to answer that question. And their findings offer a glimmer of hope as well as fresh ideas about what&#39;s most important for protecting yourself on a plane.\n       The new evidence comes largely from Hong Kong, where health officials have been meticulously testing — and  tracking — all passengers who land in the city. &#34;They test everybody by PCR on arrival, quarantine them in single rooms for 14 days and then test the passengers again,&#34; says infectious disease doctor David O. Freedman at the University of Alabama at Birmingham. So health officials there know which passengers boarded the plane while already infected with the virus and whether they could have infected anyone else on the plane.\n  Freedman and his colleague have been analyzing these data, with a specific focus on one airline: Emirates.\n  &#34;Since April, Emirates has had a very rigid masking policy,&#34; Freedman says. Not only does the airline require passengers and crew members to wear masks, but flight attendants also make sure everyone keeps on their masks, as much as possible, throughout the entire flight.\n  Freedman looked at all Emirates flights from Dubai to Hong Kong between June 16 and July 5. What he found is quite telling. During those three weeks, Emirates had five flights with seven or more infected passengers on each flight, for a total of 58 coronavirus-positive passengers flying on eight-hour trips. And yet, nobody else on the planes — none of the other 1,500 to 2,000 passengers — picked up the virus, Freedman and his colleague  report in the  Journal of Travel Medicine.\n    On another Emirates flight, a whopping 27 coronavirus-positive people boarded the plane in Dubai. Guess how many other passengers were infected on the eight-hour flight?\n    Without the masks, he would have expected many more cases. Freedman and his colleague found several other high-risk flights with no transmission, including an executive jet that flew from Tokyo to Tel Aviv, Israel, with two of the 11 passengers infected with the coronavirus.\n  &#34;They were all sitting in a very small environment because it was an executive jet,&#34; Freedman says. &#34;And yet again, there was no transmission because passengers were meticulously masked. The crew supervised the masking.&#34;\n  In fact, since airlines have started to require masks, Freedman says, scientists have not documented one superspreading event on airlines. &#34;Flights that had significant transmission documented were flights early on in the pandemic.&#34;\n  All together, these data suggest masks are working — and working well. &#34;There&#39;s encouraging evidence from a number of flights that masking does help greatly, but it would be nice to study it better,&#34; he says. &#34;The circumstantial evidence is, your risk is low on a plane, if there is rigid masking.&#34;\n  And that last part is key. To keep the risk low on planes, everyone needs to keep their mask on while riding the plane.\n  Why? Planes have excellent air ventilation and filtration systems, which remove coronavirus particles from the air about every six minutes, the U.S. Transportation Command  reported Thursday.\n  &#34;So the only opportunity to breathe the virus in comes from the air that passes by you before it goes through that ventilation system,&#34; says engineer Linsey Marr at Virginia Tech. &#34;And so that&#39;s only going to happen if you&#39;re sitting close to the person who&#39;s sick.&#34;\n  In other words, because of a plane&#39;s filtration systems, your risk of catching the coronavirus on a flight comes almost entirely from the people sitting around you. And that risk is lower when those fellow passengers wear masks.\n  The mask will block some of the virus particles a person releases into the air around them. It will also reduce how much virus you breathe in. And it will prevent big drops of spit and saliva from hitting your nose and mouth, Marr says.\n  For these reasons, Marr says, when she flies, she carefully chooses which mask to wear.\n  &#34;I save my best mask for the plane. It has a couple layers of HEPA filters that remove more than 99% of particles,&#34; she says. &#34;It&#39;s not my everyday mask. I can&#39;t just hang it around my neck. It&#39;s more troublesome than that.&#34;\n  You can&#39;t really buy N95 masks right now, but if you happen to have one, Marr recommends using it — or even a  P100 respirator, which includes a plastic facepiece and particulate filters or cartridges that remove 99.97% of virus particles. &#34;On the plane, you want the best there is,&#34; she reiterates. &#34;But just make sure it fits well, and keep in mind, the mask doesn&#39;t protect your eyes. So you might want to consider wearing a face shield or goggles or some other kind of eye protection.&#34;\n  Also remember to disinfect surfaces around your seat, such as the armrests, tray tables and seat backs. You can use hand sanitizer or bleach wipes, and try to do it regularly throughout the flight. Avoid touching your face as much as possible, Marr says. And keep chatter to a minimum. When you talk, you can emit 10 times the droplets and aerosols that you do when you&#39;re quiet.\n  Finally, Freedman says, don&#39;t forget to wear a mask and socially distance throughout the travel process — while traveling to and from the airport, while waiting in the airport and while boarding and exiting the plane.\n  &#34;To me, one of the scariest parts [of flying] is the disembarkation process,&#34; Freedman says. &#34;Airlines can control people getting onto a plane, but getting off can be chaos because everybody rushes off the plane.&#34;\n  For this reason, Freedman says, he and his wife aren&#39;t flying this year for Thanksgiving. They&#39;re taking Amtrak instead.", "posttime": "2020-10-22 23:27:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "抓到,plane,口罩", "title": "飞机上戴口罩真的能降低抓到新冠肺炎的风险吗？", "title_en": "Do Masks on Plane Flights Really Cut Your Risk of Catching Covid-19?", "transed": 1, "url": "https://www.npr.org/sections/goatsandsoda/2020/10/20/925892185/do-masks-really-cut-your-risk-of-catching-covid-19-on-long-plane-flights", "via": "", "real_tags": ["抓到", "plane", "口罩"]}, {"category": "", "categoryclass": "", "imagename": "4f194c70c7ee2c713277c284587b828d.png", "infoid": 1030574, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "FLAIR的系统是围绕一个简单的理念设计的：控制各个房间的气流可以帮助您更有效地控制加热和制冷的位置以及时间。FLAIR用来实现这一点的基本成分是其智能通风口，该通风口适合标准尺寸的现有地板和墙壁寄存器插槽。FLAIR的设计是低调的，所有的电子产品都放在位于地板水平以下的外壳中。它们可以硬连线供电，但它们还附带两个C电池，在需要更换之前提供“数年”的电力。\nFLAIR建议使用三种不同的方法来确定您需要补充现有系统的多少个智能通风口：如果您有一个房间，制冷时太冷，加热时太热，那么只需为该房间安装一个智能通风口和FLAIR Puck即可。如果您只有一个房间的制冷和供暖太少，请为所有其他房间配备智能通风口和PUCK(如果您有Ecobee恒温器，也可以使用Ecobee传感器，但我们稍后会讨论这个问题)。如果您的暖通空调已经相当均匀，但您只是想要更多的控制和效率提升，那么将整个房子作为第三个选项来装备。\n每个房间都需要一个Puck，这是一个小的圆形设备，包括温度控制和监控。第一个需要通过随附的USB电缆硬连线供电，因为它充当连接FLAIR系统和家庭网络的桥梁。所有其他设备都可以由内置的AAA电池供电，而且它们的能效非常高，这在一定程度上要归功于电子墨水显示屏。\nFLAIR可在多种模式下工作，包括与任何恒温器兼容的一种模式，您只需设置任何房间的温度，相关的通风口将根据该房间的温度是否匹配而打开或关闭。它还可以直接与Ecobee和Honeywell智能恒温器一起工作，以实现更智能的模式，在这种模式下，它们可以接收温度或将温度发送到智能单元，并根据该模式协调其打开/关闭状态。谷歌已经改变了Nest API，所以FLAIR正在努力在未来支持Nest系统上的类似功能，但目前它在Nest安装上的工作方式与对“哑巴”恒温器的工作方式相同。\nFLAIR的智能通风口本身就是有吸引力的、制作精良的硬件。通风口盖本身是由金属制成的，有一个吸引人的烧烤设计，可以与大多数装饰相匹配。它们完全是白色的，这可能是深色地板的一个问题，但它们肯定比你的平均登记簿高了一步。一方面，它们有一个LED灯条，用于在设置过程中识别哪个是电池外壳、百叶窗和控制其打开和关闭状态的电机，并在下面识别哪个是电池外壳、百叶窗和电机。\n如前所述，智能通风口可以与Puck相关联，Puck将向它们提供环境温度信息和目标温度，以便将其设置为打开或关闭。当设置为与Ecobee系统软件集成时，他们还可以使用Ecobee传感器来获取行军命令。我安装了我的审阅装置，并首先用FLAIR应用程序尝试向Ecobee提供目标温度信息，但后来又改变了它，以便Ecobee确定所需的温度，FLAIR装置都继承了该信息，并相应地设置了它们的打开/关闭状态。\n起初，我觉得FLAIR应用程序有点吓人，因为它有一个多通风口系统，它提供了很多信息，而且最初需要设置一定程度的逻辑。但是，一旦我让Ecobee集成工作起来，整个FLAIR系统就像魔术一样工作了。\n在这种配置中，您甚至不必考虑通风口是智能的这一事实；它们只需做任何它们需要做的事情，以使温度均匀，并智能地保持加热和冷却路线。它对我那座有近100年历史的房子周围的气流产生了令人印象深刻的不同-我的设置不一定是理想的，因为周围有一些非标准的更大的收银机，还不能配备高超的设备。\nPUCKS本身设计精良，具有磁性、立式和旋入式安装选项，以及易读性、高能效的电子墨水显示屏。它们的挡板用于温度控制，如果你真的想把它们当作遥感器的话，也可以把它们放在看不见的地方。\n你可能会认为登记处是开着还是关着，对全屋暖通空调系统的功效没有太大影响，但根据我的经验，FLAIR的前后效果截然不同。我一开始只有一个问题点(主卧室)，后来它更快地瞄准了温度，无论是在供暖模式还是在制冷模式下都是如此。\n即使你发现你的中央空调和暖气已经相当有效，FLAIR似乎是一个明智的升级，将在一致性和能效方面提供持久的好处。此外，如果您使用FLAIR作为控制器，则可以根据各个居住者的喜好为不同的房间设置不同的目标温度。\n真正分区的HVAC系统可能需要数千美元-特别是如果您要更换墙壁中的现有管道。相比之下，FLAIR的解决方案要实惠得多，只需几分钟即可完成DIY安装，并提供有效的效果。", "note_en": "Flair’s system is designed around a simple idea: Controlling the airflow across individual rooms can help you be more efficient about where you direct your heating and cooling, and when. The basic ingredients Flair uses to make this happen are its Smart Vents, which fit into existing floor and wall register slots in standard sizes. The Flair designs are low profile, with all the electronics contained in casing that rests under floor level. They can be hardwired for power, but they also ship with two C batteries the provide “years” of power before they require replacement.\n Flair advises three different approaches to determining how many Smart Vents you need to complement your existing system: If you have one room that’s too cold when cooling and too hot when heating, just get a Smart Vent and Flair Puck for that room. If you have just one room that gets too little cooling, and too little heating, equip all your other rooms with Smart Vents and Pucks (or Ecobee sensors if you have an Ecobee thermostat, but we’ll get to that later). If your HVAC is already pretty even, but you just want more control and efficiency gains, then equip the whole house as a third option.\n  Each room will require a Puck, which is a small round device that includes temperature control and monitoring. The first of these needs to be hardwired to power via the included USB cable, since it acts a bridge connecting the Flair system to your home network. All the others can be powered by included AAA batteries, and they’re very power efficient thanks in part to the e-Ink display.\n Flair works in a number of modes, including one that’s compatible with any thermostat where you simply set the temperature for any room, and the associated vent(s) will open or close depending on whether the temperature in that room matches up. It can also work directly with Ecobee and Honeywell smart thermostats for a much more intelligent mode where they receive or send the temperature to the smart unit, and coordinate their open/shut status depending on that.  Google   has changed the Nest API, so Flair is working on supporting similar features on Nest systems through that in future, but for now it works with Nest installations the same way it would with ‘dumb’ thermostats.\n   Flair’s Smart Vents themselves are attractive, well-made hardware. The vent covers themselves are made of metal, with an attractive grill design that will go with most decors. They’re exclusively white, which could be an issue for dark flooring, but they’re definitely a step up from your average registers. One one side, they have an LED light strip that is used during setup for identifying which is which, and underneath, the have the battery housing, louvres and the motors that control their open and shut status.\n As mentioned, the Smart Vents can be associated with a Puck, which will provide them the ambient temp information, as well as target temp, in order to set them open or shut. They can also use an Ecobee sensor to get their marching orders when set up for software integration with an Ecobee system. I installed my review units and first tried them with the Flair app providing target temp info to the Ecobee, but then switched it around so that the Ecobee determined the desired temperature, and the Flair units all inherited that info and set their open/close status accordingly.\n At first, I found the Flair app a bit intimidating just because with a multi-vent system it presents a lot of information, and some degree of logic to initially set up. But once I got the Ecobee integration working, the whole Flair system just worked – and worked like magic.\n In this configuration, you never even have to think about the fact that the vents are Smart; they just do whatever they need to in order to equalize the temperature and keep heating and cooling routing intelligently. It made an impressive difference in the amount of airflow circulating around my nearly 100-year old house – and my setup isn’t necessarily ideal because there are a few non-standard, larger registers around that can’t yet be Flair-equipped.\n The Pucks themselves are well designed, with magnetic, stick-up and screw-in installation options, and readible, power-efficient e-Ink displays. Their bezel turns for temperature control, and they can also be placed out of sight if you really just want to use them as remote sensors.\n  You might think that whether a register is open or closed wouldn’t make much difference to the efficacy of a house-wide HVAC system, but in my experience, the before-and-after of Flair was dramatically different. I started out with one problem spot primarily (the master bedroom) and afterwards it got to target temp much more quickly, both in heating and cooling modes.\n Even if you find your central air and heating are already pretty effective, Flair seems like a wise upgrade that will provide lasting benefits in terms of consistency and power efficiency. Plus, if you use Flair as the controller, you can set different target temps for different rooms depending on individual occupant preferences.\n True zoned HVAC systems can cost thousands – especially if you’re replacing existing ducting in walls. Flair’s solution is a lot more affordable by comparison, and provides effective results with DIY installation that takes just minutes to set up.", "posttime": "2020-10-22 23:09:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "智能,smart,flair", "title": "\nFLAIR的智能通风系统对于任何希望改善家庭HVAC的人来说都是一个巨大的改进", "title_en": "\n\t\t\t\tFlair’s Smart Vent system is a big improvement for anyone looking to improve their home HVAC\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/22/flairs-smart-vent-system-is-a-big-improvement-for-anyone-looking-to-improve-their-home-hvac/", "via": "", "real_tags": ["智能", "smart", "flair"]}, {"category": "", "categoryclass": "", "imagename": "502d4689643f7df0d4b38aa2b540b489.jpeg", "infoid": 1030573, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在，当一段视频因内容违规而被删除时，用户将在应用程序内收到通知，并附上帖子的日期和违反的具体政策，以及一个阅读社区指南的链接。\n如果视频的内容被标记为与自我伤害或自杀有关，TikTok还会通过额外的通知将用户引导到专家资源，包括非营利性的beFrienders.org。然而，它似乎不包括自杀热线的号码，而是指示用户或用户的朋友拨打“当地执法部门”的电话。\n相比之下，Facebook和Instagram拥有更强大的系统和更广泛的合作伙伴，在这样的情况下提供支持。\n过去，TikTok用户经常抱怨他们的视频在没有通知的情况下消失了。其中一些故事已经在网上疯传，比如利佐呼吁TikTok撤下她穿游泳衣的视频。\n随着越来越多的用户加入TikTok，视频删除的数量也在增长。TikTok表示，2020年上半年，它删除了1.045亿个违反政策的视频，高于2019年下半年的4900万个。\n新的通知系统在全球推出之前，TikTok最近扩大了针对仇恨言论和其他仇恨意识形态的执法行动。\n就在昨天，该公司才为其欧洲社区发布了一份关于这些变化的解释。一些新闻网站错误地报道了这一更新，似乎这是一项全新的政策，但大多数变化是在8月份首次在美国宣布的。\n不管时机如何，TikTok更强大的政策执行力可能导致了更多关于视频删除的混乱，因为它缺乏明确的通知系统。\nTikTok表示，它相信新的视频删除通知系统将有助于减少重复违规行为，就像它在测试期间所做的那样。由于新的通知，对其社区指南的访问量几乎增加了两倍，上诉请求减少了14%。\nTikTok在一份声明中说：“对我们的社区保持透明是继续赢得和维持信任的关键。”我们很高兴能够将这一新的通知系统带给我们的所有用户，我们将继续努力改善我们帮助社区了解我们的政策的方式，同时我们将继续建立一个安全和支持的平台。“", "note_en": "Now, when a video is removed over content violations, users will be notified in-app, with the date of the post and the specific policy it violated, along with a link to read the Community Guidelines.\n   And if the video’s content was flagged as self-harm or suicide related, TikTok will also direct users to expert resources through an additional notification, including nonprofit befrienders.org. However, it doesn’t appear to include numbers for suicide hotlines, instead directing users or friends of users to call “local law enforcement.”\n Facebook and  Instagram, by comparison, have a more robust system and wider array of partners offering support in cases like this.\n  In the past, TikTok users have often complained about their videos disappearing without notice. Some of these stories have gone viral, as when  Lizzo called out TikTok for taking down videos of her in a bathing suit, for example.\n As more users joined TikTok, video removals have grown, too. In the first half of 2020,  TikTok said it removed 104.5 million videos for policy violations, up from the  49+ million it removed during the second half of 2019.\n The new notification system’s global launch also follows a recent expansion of TikTok’s enforcement actions around hate speech and other hateful ideologies.\n The company  only yesterday published an explanation of those changes for its European community. That update was mistakenly reported by some news sites as if were a brand-new policy, but the majority of the changes had been  first announced in the U.S. in August.\n Regardless of timing, TikTok’s stronger policy enforcements may have led to even more confusion over video removals, due to its lack of a clear notification system.\n TikTok says it believes the new notification system for video removals will help to reduce repeat violations, as it did during tests. It also saw visits to its Community Guidelines nearly triple, as a result of the new notifications, as well as a 14% reduction in requests for an appeal.\n “Being transparent with our community is key to continuing to earn and maintain trust,” said TikTok in an  announcement. “We’re glad to be able to bring this new notification system to all our users, and we’ll keep working to improve the ways we help our community understand our policies as we continue to build a safe and supportive platform.”", "posttime": "2020-10-22 23:09:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "删除,rolls,社区", "title": "\nTikTok推出新的内容删除通知系统", "title_en": "\n\t\t\t\tTikTok rolls out a new notification system for content removals\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/22/tiktok-rolls-out-a-new-notification-system-for-content-removals/", "via": "", "real_tags": ["删除", "rolls", "社区"]}, {"category": "", "categoryclass": "", "imagename": "9add58b5af341f2a77b41164183b5445.jpg", "infoid": 1030572, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这并不是谷歌地图平台第一次涉足这一业务。例如，早在2018年，该公司就为拼车公司推出了一款应用内导航解决方案。当时，该团队并没有真正专注于交付解决方案，但这显然是目前为数不多的蓬勃发展的市场之一，这要归功于新冠肺炎的大流行。\n谷歌高级产品经理伊莱·丹齐格在今天的公告中写道：“基于15年来绘制世界地图的经验，按需乘车和送货解决方案帮助企业改善运营，并将司机和客户的旅程从预订转变为到达或送货-所有这些都是以可预测的每次完成旅行的价格计算的，”谷歌高级产品经理埃利·丹齐格(Eli Danziger)在今天的公告中写道。\n这项服务的核心是谷歌地图路线服务，开发者可以对其进行调整，例如骑自行车或摩托车送货，并找到具有最短或最快路径的优化路线。该团队指出，这一所谓的“首选路线”功能还可以对对时间敏感的送货和定价估计进行到达时间预测。\n这个平台的另一个新功能是让开发者能够快速构建一种体验，帮助用户找到附近的司机。这里的想法很有想象力地称为“附近的驱动程序”，几乎是你能想象到的最直截了当的想法，让开发人员只需调用一次API就可以找到离你最近的驱动程序。他们还可以根据自己的特定需求添加自定义排名，以确保正确的司机与正确的路线相匹配。\n不出所料，该平台还提供了对应用内导航的支持，这与其他功能集紧密相关。\n开发人员还可以很容易地集成谷歌的实时出行和订单进度功能，以“让客户从接送到下车或送货都有信息，并实时查看司机的当前位置、路线和预计到达时间(ETA)。”\n所有这一切几乎都是任何用户对现代拼车或送货应用程序的期望，所以在很大程度上，这是桌上的赌注。然而，它背后的技术并非如此，许多快递公司已经建立了大型技术业务来构建这些功能。他们不太可能转向谷歌的平台，但该平台可能会给规模较小的参与者一个机会，让他们更高效地运营或进入新市场，而不需要从头开始建立这个技术堆栈-或者从多个供应商那里拼凑起来。", "note_en": "This isn’t Google Maps Platform’s first foray into this business. Back in 2018, the company launched a solution for in-app navigation for ridesharing companies, for example. At the time, the team didn’t really focus on delivery solutions, though, but that’s obviously one of the few booming markets right now, thanks to the COVID-19 pandemic.\n “Building on 15 years of experience  mapping the world, the On-demand Rides &amp; Deliveries solution helps businesses improve operations as well as transform the driver and customer journey from booking to arrival or delivery–all with predictable pricing per completed trip,” Google senior product manager Eli Danziger writes in today’s announcement.”\n  At the core of the service is the Google Maps  routing service, which developers can tweak for deliveries by bike or motorcycle, for example, and to find optimized routes with the shortest or fastest path. The team notes that this so-called ‘Routes Preferred’ feature also enables arrival time predictions for time-sensitive deliveries and pricing estimates.\n The other new feature of this platform is to enable developers to quickly build an experience that helps users find nearby drivers. Imaginatively called ‘Nearby Drivers,’ the idea here is about as straightforward as you can imagine and allows developers to find the closest driver with a single API call. They can also add custom rankings, based on their specific needs, to ensure the right driver is matched to the right route.\n Unsurprisingly, the platform also features support for in-app navigation, and that’s tied in closely with the rest of the feature set.\n Developers can also easily integrate Google’s real-time trip and order progress capabilities to “keep customers informed from pickup to drop-off or delivery, with a real-time view of a driver’s current position, route, and ETA.”\n All of this is pretty much what any user would expect from a modern ride-sharing or delivery app, so for the most part, that’s table stakes. The technology behind it is not, though, and a lot of delivery companies have set up large tech operations to build out exactly these features. They aren’t likely to switch to Google’s platform, but the platform may give smaller players a chance to operate more efficiently or enter new markets without the added expense of having to build this tech stack from the ground up — or cobble it together from multiple vendors.", "posttime": "2020-10-22 23:09:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,谷歌,google,地图,maps", "title": "\n谷歌地图为按需乘车和送货公司推出新的开发者解决方案", "title_en": "\n\t\t\t\tGoogle Maps launches a new developer solution for on-demand ride and delivery companies\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/22/google-maps-launches-a-new-developer-solution-for-on-demand-ride-and-delivery-companies/", "via": "", "real_tags": ["开发", "谷歌", "google", "地图", "maps"]}, {"category": "", "categoryclass": "", "imagename": "022ae1f163e3837faf7572f4d1b4761b.png", "infoid": 1030569, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们正在将镍库公之于众。镍是Tweag开发的一种实验配置语言。虽然现在还不是第一次租赁的时候，但这是一个谈论这个项目的机会。这篇文章的目标是对该项目进行一个高层次的概述。如果你的好奇心很强，但你还想学更多，那就不要害怕，因为我们将来会发布更多关于英语具体方面的博客文章。但是现在，让我们来游览一下吧！\n[免责声明：Nickel的实际语法仍在研究中，出于说明的目的，我自由使用目前尚未存在的语法。但是，已经支持底层功能。]。\n在Tweag，我们是NIX包管理器的忠实用户。事实证明，NIX的配置语言(也称为NIX)是一种非常好的配置语言，它不仅适用于包管理，还适用于更多的事情。\n总而言之，Nix语言是一种带函数的懒惰JSON。它很简单，但功能强大。它用于生成NIX的包描述，但非常适合编写任何类型的配置(Terraform、Kubernetes等…)。。\n问题在于，Nix-the-language的解释器与Nix-the-Package管理器紧密耦合。因此，按照目前的情况，将NIX语言用于包管理以外的任何事情都是一项非常痛苦的工作。\n我们试图回答这个问题：如果Nix-the-language从包管理器中分离出来，它会是什么样子？同时抓住机会稍微改进一下语言，以Nix社区多年来的经验为基础。\nNICI是一种轻量级通用配置语言。因为它可以取代YAML作为应用程序的配置语言。不过，与YAML不同的是，它通过可编程实现了大型配置。使用Nickel的另一种方式是生成静态配置文件(例如JSON、YAML)，然后将其提供给另一个系统。像NikeNix一样，它被设计成有一个简单的、易于理解的核心：实际上，它是带有函数的JSON。\n但过去使用Nix的经验也带来了一些关于这种语言的哪些方面可以改进的见解。无论一种语言的初始范围是什么，它几乎肯定会以一种与原始计划不同的方式使用：您创建了一种配置语言来描述软件包，接下来您知道，需要有人实现拓扑排序。\nNiel努力保持Nix的简单性，同时根据这个反馈对其进行扩展，不过，您可以在没有新特性的情况下做得非常好，只需编写类似Nix的代码即可。\n在这一点上，您可能会想这是不是已经在其他地方做过了，似乎每天都有越来越多的语言诞生，并且肯定已经存在了与Nickel具有类似用途的配置语言：Starlark、Jsonnet、DHall或CUE，不一而足。那为什么是镍呢？\n也许与其他配置语言最重要的区别在于Nickel的键入方法。\n一些语言，如Jsonnet或Starlark，不是静态类型的。实际上，静态类型在配置语言中可以被视为多余的：如果您的程序只在固定输入上运行一次，那么无论如何都会在运行时报告任何类型错误。为什么要为静态类型系统而烦恼呢？\n另一方面，越来越多的系统依赖于复杂的配置，如云基础设施(Terraform、Kubernetes或NixOps)，导致相应的程序变得越来越复杂，以至于静态类型是有益的。对于可重用的代码-也就是说，库函数-静态类型添加结构，作为文档，并及早消除错误。\nDHall有一个功能强大的打字系统，可以打字范围很广。但它很复杂，需要一些经验才能变得流利。\nCUE更接近我们的奋斗目标。它有一个可选的、行为良好的系统，有很强的保证。作为交换，人们通常不能编写Nortype高阶函数，即使一些简单的函数可以编码。\n渐变类型并不引人注目：它们使你可以对程序的可重用部分进行静态类型，但是你仍然可以自由地编写没有任何类型的配置。解释器安全地处理类型化和非类型化世界之间的交互。\n//文件：mylib.ncl{numToStr：Num-&gt；Str=Fun n=&gt；...；makeURL：Str-&gt；Str-&gt；Num-&gt；Str=Fun原始主机端口=&gt；&#34；${proto}：//${host}：${numToStr port}/&#34；；}。\n//file：server.ncllet mylib=import&#34；mylib.ncl&#34；input host=&#34；myproject.com&#34；in{host=host；port=1；urls=[mylib.makeURL&#34；myproto&#34；host port，{protocol=&#34；proto2&#34；；server=&#34；sndserver.net&#34；；port=4242}]；}。\n在第一个代码片段中，对numToStr和makeURL的主体进行了统计检查：错误地在makeURL内调用numToStr proto会引发错误，即使从未使用过makeURL。另一方面，第二个代码段没有注释，因此没有进行静态检查。特别地，我们在同一列表中将表示为字符串的URL与表示为记录的URL混合在一起。相反，解释器会插入运行时检查或契约，例如，如果make URL被误用，则程序会失败，并出现相应的错误。\n渐进式类型还让我们保持类型系统的简单：即使是内部类型的代码，如果您要编写类型检查器不知道如何验证的组件，也不必对该部分进行类型检查。\n作为静态类型系统的补充，Nickel提供合同。Contractsoffer精确而准确的动态类型错误报告，即使在存在函数类型的情况下也是如此。Nickel的解释器在内部使用合约在类型块和非类型块之间插入保护。合同也可供程序员使用，使他们能够以一种简单的方式在运行时强制执行类型断言。\n这种设计的一个令人愉快的结果是，用户接触该类型系统的过程可以是渐进的：\n编写配置的用户可以只编写类似Nix的代码，而忽略(几乎)所有关于键入的内容，因为您可以从非类型化代码无缝调用typedfunction。\n基本计算块是函数，而Nickel中的基本数据块是记录(或JSON中的对象)。Ni支持编写自记录记录模式，例如：\n{host|type：str|description：&#34；|default：&#34；faulback.myserver.net&#34；；port|type：num|description：&#34；|default：4242；url|type：url|description：&#34；；}。\n每个字段都可以包含元数据，如描述或默认值。它们的目的是在文档中显示，或通过工具查询。\n然后可以将该架构用作合同。假设一个函数在其输出中设置了两个值并返回：\n没有类型，就很难捕捉到这一点。当然，错误最终会在管道的下游弹出，但如何以及何时出现错误呢？使用上面的模式可以确保，无论何时实际计算字段，函数都会被归咎于类型错误。\n模式实际上是涉及将记录合并在一起的更大故事的一部分，尤其是让模式用缺省值实例化缺少的字段。它非常受NixOS模块系统和CUE语言的启发，但这是另一个时代的故事。\n我希望我能让你们对Nickel想要实现的目标有个了解。我只介绍了它最突出的方面：它的渐进型系统和合同，以及内置的记录模式。但是还有更多需要探索的地方！该语言还没有准备好在现实世界的应用程序中使用，但是这里展示的设计的很大一部分已经实现。如果你对它很好奇，那就去看看吧！", "note_en": "We are making the  Nickel repository public. Nickel is an experimental configurationlanguage developed at Tweag. While this is not the time for the firstrelease yet, it is an occasion to talk about this project. The goal of thispost is to give a high-level overview of the project. If your curiosity is tickledbut you are left wanting to learn more, fear not, as we will publishmore blog posts on specific aspects of the language in the future. But fornow, let’s have a tour!\n [ Disclaimer: the actual syntax of Nickel being still worked on, I’m freelyusing as-of-yet non-existing syntax for illustrative purposes. The underlyingfeatures are however already supported.]\n  We, at Tweag, are avid users of the  Nix package manager. As ithappens, the configuration language for Nix (also called Nix) isa pretty good configuration language, and would be applicable to manymore things than just package management.\n All in all, the Nix language is a lazy JSON with functions. It issimple yet powerful. It is used to generate Nix’s package descriptionsbut would be wellsuited to write any kind of configuration ( Terraform, Kubernetes, etc…).\n The rub is that the interpreter for Nix-the-language is tightlycoupled with Nix-the-package manager. So, as it stands, using theNix language for anything else than package management is a ratherpainful exercise.\n Nickel is our attempt at answering the question: what wouldNix-the-language look like if it was split from the package manager?While taking the opportunity to improve the language a little,building on the experience of the Nix community over the years.\n  Nickel is a lightweight generic configuration language. In that it canreplace YAML as your application’s configuration language. UnlikeYAML, though, it anticipates large configurations by beingprogrammable. Another way to use Nickel is to generate staticconfiguration files —  e.g. in JSON, YAML — that are then fed to another system. LikeNix, it is designed to have a simple, well-understood core: at itsheart, it is JSON with functions.\n But past experience with Nix also brings some insights on which aspects of thelanguage could be improved. Whatever the initial scope of a language is, it willalmost surely be used in a way that deviates from the original plan: you createa configuration language to describe software packages, and next thing you know,somebody needs to implement a  topological sort.\n Nickel strives to retain the simplicity of Nix, while extending itaccording to this feedback.Though, you can do perfectly fine without the new features and just write Nix-like code.\n  At this point you’re probably wondering if this hasn’t already been done elsewhere.It seems that more and more languages are born every day, and surely therealready exist configuration languages with a similar purpose to Nickel: Starlark,  Jsonnet,  Dhall or  CUE, to namea few. So why Nickel?\n  Perhaps the most important difference with other configuration languages isNickel’s approach to typing.\n Some languages, such as  Jsonnet or  Starlark, are notstatically typed. Indeed, static types can be seen as superflous in a configurationlanguage: if your program is only run once on fixed inputs, any type error willbe reported at run-time anyway. Why bother with a static type system?\n On the other hand, more and more systems rely on complex configurations, such ascloud infrastructure ( Terraform,  Kubernetes or NixOps), leading the corresponding programs to become increasinglycomplex, to the point where static types are beneficial. For reusable code —that is, library functions — static types add structure, serve asdocumentation, and eliminate bugs early.\n  Dhall features a powerful type system that is able to type a wide range ofidioms. But it is complex, requiring some experience to become fluent in.\n CUE is closer to what we are striving for. It has an optional and well-behavedtype system with strong guarantees. In exchange for which, one can’t write nortype higher-order functions in general, even if some simple functions arepossible to encode.\n  Nickel, features a   gradual type system.Gradual types are unobtrusive: they make it possible to staticallytype reusable parts of your programs, but you are still free to writeconfigurations without any types. Theinterpreter safely handles the interaction between the typed and untyped worlds.\n  // file: mylib.ncl{ numToStr : Num -&gt; Str = fun n =&gt; ...; makeURL : Str -&gt; Str -&gt; Num -&gt; Str = fun proto host port =&gt; &#34;${proto}://${host}:${numToStr port}/&#34;;}\n  // file: server.ncllet mylib = import &#34;mylib.ncl&#34; inlet host = &#34;myproject.com&#34; in{ host = host; port = 1; urls = [ mylib.makeURL &#34;myproto&#34; host port, {protocol = &#34;proto2&#34;; server = &#34;sndserver.net&#34;; port = 4242} ];}\n In the first snippet, the body of  numToStr and  makeURL are staticallychecked: wrongfully calling  numToStr proto inside  makeURL would raise anerror even if  makeURL is never used. On the other hand, the second snippet isnot annotated, and thus not statically checked. In particular, we mix an URLrepresented as a string together with one represented as a record in the samelist. The interpreter rather inserts run-time checks, or  contracts, suchthat if  makeURL is misused then the program fails with anappropriate error.\n Gradual types also lets us keep the type system simple: even instatically typed code if you want to write a component that the typechecker doesn’t know how to verify, you don’t have to type-check thatpart.\n  Complementary to the static type system, Nickel offers  contracts. Contractsoffer precise and accurate dynamic type error reporting, even in thepresence of function types. Contracts are used internally byNickel’s interpreter to insert guards at the boundary between typed and untypedchunks. Contracts are available to the programmer as well, to give them theability to enforce type assertions at run-time in a simple way.\n One pleasant consequence of this design is that the exposure of the user to thetype system can be progressive:\n Users writing configurations can just write Nix-like code while ignoring(almost) everything about typing, since you can seamlessly call a typedfunction from untyped code.\n   While the basic computational blocks are functions, the basic data blocks inNickel are records (or objects in JSON). Nickel supports writing self-documentingrecord schemas, such as:\n { host | type: Str | description: &#34;The host name of the server.&#34; | default: &#34;fallback.myserver.net&#34; ; port | type: Num | description: &#34;The port of the connection.&#34; | default: 4242 ; url | type: Url | description: &#34;The host name of the server.&#34; ;}\n Each field can contain metadata, such as a description or defaultvalue. These aim at being displayed in documentation, or queried bytools.\n The schema can then be used as a contract. Imagine that a function hasswapped two values in its output and returns:\n  Without types, this is hard to catch. Surely, an error will eventually pop updownstream in the pipeline, but how and when? Using the schema abovewill make sure that, whenever the fields are actually evaluated, thefunction will be blamed in the type error.\n Schemas are actually part of a bigger story involving merging recordstogether, which, in particular, lets the schema instantiate missingfields with their default values. It is very much inspired by the NixOs module system and the  CUE language, butit is a story for another time.\n  I hope that I gave you a sense of what Nickel is trying to achieve. Ionly presented its most salient aspects: its gradual type system withcontracts, and built-in record schemas. But there is more to explore!The language is not ready to be used in real world applications yet, but a goodshare of the design presented here is implemented. If you are curious about it, check it out!", "posttime": "2020-10-22 23:02:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "成本,nickel,类型", "title": "镍：以更少的成本实现更好的配置", "title_en": "Nickel: Better Configuration for Less", "transed": 1, "url": "https://www.tweag.io/blog/2020-10-22-nickel-open-sourcing/", "via": "", "real_tags": ["成本", "nickel", "类型"]}, {"category": "", "categoryclass": "", "imagename": "a15c83e7e8abc15a76ac2b5c4fb126b3.png", "infoid": 1030568, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "底特律(路透社)-通用汽车公司(General Motors Co GM.N)表示，在周二一段引人注目的视频披露后，其庞大的GMC悍马EV电动皮卡的第一年价值已经售罄。\nGMC网站上显示了悍马电动汽车“第一版”上方的“预订满”横幅，预计将于2021年秋季开始生产。这款卡车的下一个版本，售价99,995美元的悍马EV 3X，计划要到2022年秋天才能开始生产。\n通用汽车表示，最便宜的悍马电动汽车起价79,995美元，计划于2024年春季投产。\n通用汽车官员在周三的一次演示中表示，悍马电动汽车是在18个月的时间里设计和制造的。这辆强壮的卡车可以使用它的四轮转向系统在崎岖的地形上横向“螃蟹行走”，并且有一个“瓦茨自由”模式，可以在3秒内将卡车加速到60英里/小时(97公里/小时)。\n悍马电动汽车在一定程度上是对特斯拉公司(Tesla Inc)TSLA.O CyberTruck的回应，TSLA.O CyberTruck拥有截然不同但同样引人注目的设计和一系列极致的性能特点。CyberTruck的起价为39,900美元，而续航里程为500英里的车型起价为69,900美元。\n特斯拉已经开始在德克萨斯州奥斯汀建造一家工厂，从2021年末开始生产CyberTruck。\n通用汽车GMC部门负责人邓肯·奥尔德雷德(Duncan Aldred)表示，该品牌约一半的经销商已同意出售悍马电动汽车(Hummer EV)阵容。通用汽车在其网站上接受订单，奥尔德雷德表示，公司的意图是提供没有讨价还价的价格。在线预订和确定定价类似于特斯拉的方法。\n高性能电动皮卡在美国市场可能是一个拥挤的利基市场，有八家公司承诺在2021年底之前推出车型。\n福特汽车公司(Ford Motor Co F.N)承诺推出F系列皮卡的电动版本，尽管福特曾表示，其电动皮卡将针对想要使用卡车上班的客户。通用汽车正在生产雪佛兰(Chevrolet)版的电动卡车。\n初创公司Rivian，Nikola Corp NKLA.O和Lordstown Motors等公司都在开发电动皮卡。", "note_en": "DETROIT (Reuters) - General Motors Co   GM.N  said it has sold out the first year&#39;s worth of its hulking GMC Hummer EV electric pickup truck after a splashy video reveal on Tuesday.\n The GMC website showed a “reservations full” banner over the Hummer EV “Edition 1,” due to start production in the fall of 2021. The next version of the truck, the $99,995 Hummer EV 3X, is not scheduled to begin production until the fall of 2022.\n The least expensive Hummer EV, starting at $79,995, is scheduled to go into production in the spring of 2024, GM said.\n  The Hummer EV was designed and engineered in 18 months, GM officials said during a presentation on Wednesday. The brawny truck can “crab walk” sideways on rough terrain using its four-wheel steering system, and has a “Watts to Freedom” mode that accelerates the truck to 60 miles per hour (97 kph) in 3 seconds.\n The Hummer EV is in part a response to Tesla Inc&#39;s   TSLA.O  Cybertruck, which has a very different but equally eye-grabbing design and a bevy of extreme performance features. The Cybertruck&#39;s starting price is $39,900, though a model with 500 miles of range starts at $69,900.\n Tesla has begun building a factory in Austin, Texas to build the Cybertruck starting in late 2021.\n  The head of GM’s GMC division, Duncan Aldred, said about half the brand’s dealers have agreed to sell the Hummer EV lineup. GM is taking orders on its website, and Aldred said the company’s intent is to offer no-haggle prices. The online reservations and firm pricing are similar to the Tesla approach.\n High-performance electric pickup trucks could be a crowded niche in the U.S. market, with eight companies promising to launch models by the end of 2021.\n Ford Motor Co   F.N  is promising an electric version of its F-series pickup, though Ford has said its electric pickup will be aimed at customers who want to use the truck for work. GM has Chevrolet versions of its electric truck in the works.\n Startups Rivian, Nikola Corp   NKLA.O  and Lordstown Motors are among other companies that have electric pickups in development.", "posttime": "2020-10-22 23:02:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "通用汽车,电动,sells", "title": "通用汽车电动悍马第一年的生产销售一空", "title_en": "GM sells out first year of electric Hummer production", "transed": 1, "url": "https://www.reuters.com/article/us-autos-electric-hummer/gm-sells-out-first-year-of-electric-hummer-production-idUSKBN27639J", "via": "", "real_tags": ["通用汽车", "电动", "sells"]}, {"category": "", "categoryclass": "", "imagename": "836f4650fac2144e0237c6b09f824b8d.jpg", "infoid": 1030566, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几十年来，美国的反托拉斯法-最初旨在限制19世纪企业巨头在铁路、石油和钢铁领域的权力-一直被誉为“自由企业的大宪章”，并被证明是非常持久和适应性很强的。\n但是，就在司法部周二对谷歌提起反垄断诉讼之际，越来越多的法律专家和经济学家已经开始质疑，传统的反垄断是否能够胜任解决当今数字巨头提出的竞争担忧的任务。谷歌在搜索和搜索广告领域非法维持垄断地位。他们说，需要进一步的帮助。\n反垄断案件通常以法院的庄严步伐进行，审判和上诉可能会拖延数年。法律专家和经济学家表示，这些拖延将给谷歌、Facebook、亚马逊和苹果提供自由，让它们在自己主导的市场变得更加根深蒂固。\n他们说，需要一种更快速的方法。一种解决方案是：成立一个专门的监管机构，专注于主要的科技公司。它将建立并执行一套基本的行为规则，其中包括不允许公司偏袒自己的服务，排除竞争对手或收购新兴竞争对手，并要求它们允许竞争对手以合理的条件访问其平台和数据。\n英国政府已经表示，将创建一个数字市场部门，并呼吁欧盟和澳大利亚也引入大型科技监管机构。在美国，专家报告和国会证词中也提出了建立数字市场监管机构的建议。它可以是一个单独的机构，也可以是联邦贸易委员会(Federal Trade Commission)内部的一个数字部门。\n值得注意的是，在美国，这条道路的主要支持者是主流的反垄断专家和经济学家，而不是分裂的煽动者。哈佛大学(Harvard University)教授、奥巴马政府经济顾问委员会(Council Of Economic Advisers)主席杰森·福尔曼(Jason Furman)领导了一个向英国政府提供咨询的小组，该小组建议在2019年成立一个数字市场部门。\n福尔曼说，拆分大型科技公司不是一个好主意，因为那会冒着失去这些数字公用事业公司无可否认地为消费者带来的一些好处的风险。他说，监管机构对于监管数字市场和科技巨头的行为是必要的。\n“我是一个小小的‘C’保守派，总的来说，我不是监管的粉丝，”福尔曼说。“但在这个领域，它是需要的。”\n专注于特定经济部门的监管机构在美国很常见。对于金融市场，有证券交易委员会(Securities And Exchange Commission)；对于航空公司，有联邦航空管理局(Federal Aviation Administration)；对于制药市场，有食品和药物管理局(Food And Drug Administration)；对于电信市场，有联邦通信委员会(Federal Communications Commission)等等。\n挑选少数几家大公司进行特殊对待也是有先例的。在银行业，客户和贷款最多的最大银行被归类为“具有系统重要性的金融机构”，并受到更严格的审查。\n新科技监管机构的几名支持者是奥巴马政府的官员，奥巴马政府以对硅谷友好而闻名。但倡导者表示，这些经历-以及近年来法院裁决中保守的、亲大企业的倾向-让他们对反垄断法感到失望，因为反垄断法是限制大型科技公司日益增长的市场力量和行为的唯一途径。\n“反垄断机制没有起到保护竞争的作用，”奥巴马政府司法部反垄断部门官员、耶鲁大学管理学院(Yale University School Of Management)经济学家菲奥娜·斯科特·莫顿(Fiona Scott Morton)说。“所以让我们做点别的吧--使用不同的工具。”\n去年，芝加哥大学布斯商学院斯蒂格勒中心(Stigler Center)在一份关于数字平台的报告中，由斯科特·莫顿(Scott Morton)领导了一个反垄断专家小组。报告建议设立一个监管机构。(斯科特·莫顿一直是谷歌的有力批评者，但也是苹果和亚马逊的顾问。)。\n一些反垄断专家警告说，这样的监管方式存在政府干预这个快速发展的行业的风险，这可能会阻碍创新。他们说，虽然反垄断法对所谓的反竞争行为做出反应，因此可能会很慢，但这一缺陷比规定的政府规章制度更可取。\n宾夕法尼亚大学法学院(University Of Pennsylvania Law School)教授赫伯特·霍文坎普(Herbert Hovenkamp)表示：“我对监管路径感到非常不舒服，特别是如果这意味着产品变更需要获得政府批准的话。”“监管的历史表明，它是创新杀手.”\n英特尔(Intel)前总法律顾问、司法部前反垄断官员道格拉斯·梅拉米德(A.Douglas Melame)也有同样的担忧。但斯蒂格勒中心(Stigler Center)报告的专家小组成员梅拉米德表示，科技巨头确实带来了竞争问题。\n斯坦福大学法学院(Stanford Law School)教授梅拉米德说，“我认为，如果监管的重点是狭隘的，而不是管理这个行业，那么它可能是有意义的。”\n上一次针对大型科技公司的重大反垄断行动是在20世纪90年代具有里程碑意义的微软案件。该案始于1994年联邦贸易委员会(Federal Trade Commission)提起的诉讼和一项同时同意的法令。\n司法部和几个州后来接手追查，重新调查，提起诉讼，并进行了详尽的审判。微软被发现多次违反国家反垄断法，该公司随后与政府达成和解，并于2002年获得联邦法院批准。\n在微软的案例中，反垄断法律程序以自己的方式发挥了作用。然而，它的影响仍然存在争议。一些观察人士说，如果没有这起诉讼和多年的审查，微软可能已经扼杀了谷歌的崛起。\n但其他人表示，技术转向互联网，而不是个人电脑，意味着微软失去了曾经掌握的看门人权力。他们坚称，打开竞争大门的是技术，而不是反垄断。\n无论胜利与否，微软的案子都是20年前的事了。新监管机构的支持者表示，反垄断法本身不适合限制当今行动更快的数字巨头。他们说，在互联网经济中，加强和扩大市场领先者权力的力量-称为网络效应-比个人电脑时代更强大、更迅速。\n“反垄断不是对付主导这些市场的公司的充分工具，”斯蒂格勒中心小组成员吉恩·基梅尔曼(Gene Kimmelman)说。他是哈佛大学肖伦斯坦中心(Shorenstein Center)最近一份报告的合著者之一，该报告呼吁在美国建立一个“数字平台机构”。\n监管选项的另一个论点是，竞争担忧现在覆盖了四家公司，而不仅仅是一家。苹果、亚马逊、Facebook和谷歌处于不同的市场，包括搜索、在线广告、电子商务和社交网络。单独对他们提起反垄断诉讼很可能超出了政府的资源范围。\n霍华德大学(Howard University)法学教授安德鲁·I·加维尔(Andrew I.Gavil)说，“当竞争问题比一家公司更大的时候，监管可能是更好的工具。”", "note_en": "For decades, America’s antitrust laws — originally designed to curb the power of 19th-century corporate giants in railroads, oil and steel — have been hailed as “the Magna Carta of free enterprise” and have proved  remarkably durable and adaptable.\n But even as the  Justice Department filed an antitrust suit against Google on Tuesday for unlawfully maintaining a monopoly in search and search advertising, a growing number of legal experts and economists have started questioning whether traditional antitrust is up to the task of addressing the competitive concerns raised by today’s digital behemoths. Further help, they said, is needed.\n Antitrust cases typically proceed at the stately pace of the courts, with trials and appeals that can drag on for years. Those delays, the legal experts and economists said, would give Google, Facebook, Amazon and Apple a free hand to become even more entrenched in the markets they dominate.\n A more rapid-response approach is required, they said. One solution: a specialist regulator that would focus on the major tech companies. It would establish and enforce a set of basic rules of conduct, which would include not allowing the companies to favor their own services, exclude competitors or acquire emerging rivals and require them to permit competitors access to their platforms and data on reasonable terms.\n The British government has already said it would  create a digital markets unit, with calls for a Big Tech regulator to also be introduced in the European Union and in Australia. In the United States, recommendations for a digital markets regulator have also been made in expert reports and in congressional testimony. It could be a separate agency or perhaps a digital division inside the Federal Trade Commission.\n Significantly, the leading proponents of this path in the United States are mainstream antitrust experts and economists rather than break-’em-up firebrands. Jason Furman, a professor at Harvard University and chair of the Council of Economic Advisers in the Obama administration, led  an advisory group to the British government that recommended the creation of a digital markets unit in 2019.\n  Breaking up the big tech companies, Mr. Furman said, is a bad idea because that would risk losing some of the consumer benefits these digital utilities undeniably deliver. A regulator is necessary to police digital markets and the behavior of the tech giants, he said.\n “I’m a small ‘c’ conservative, and I’m not a fan of regulation generally,” Mr. Furman said. “But it’s needed in this space.”\n Regulators that focus on specific sectors of the economy are common in the United States. For financial markets, there is the Securities and Exchange Commission; for airlines, the Federal Aviation Administration; for pharmaceuticals, the Food and Drug Administration; for telecommunications, the  Federal Communications Commission; and so on.\n There is also precedent for picking out a handful of big companies for special treatment. In banking, the biggest banks with the most customers and loans are classified as “systemically important financial institutions” and subject to more stringent scrutiny.\n Several supporters of a new tech regulator were officials in the Obama administration, which was known for being friendly to Silicon Valley. But the advocates said that experience — as well as the conservative, pro-big business drift of court rulings in recent years — left them  frustrated with antitrust law as the only way to restrain the growing market power and conduct of the big tech companies.\n “The mechanism of antitrust is not working to protect competition,” said Fiona Scott Morton, an official in the Justice Department’s antitrust division in the Obama administration, who is an economist at the Yale University School of Management. “So let’s do something else — use a different tool.”\n Ms. Scott Morton led an expert panel on antitrust in  a report last year on digital platforms by the Stigler Center at the  University of Chicago’s Booth School of Business. The report recommended the creation of a regulatory authority. (Ms. Scott Morton has been a forceful critic of Google, but also a consultant to Apple and Amazon.)\n Such a regulatory approach carries the risk of government’s meddling in a fast-moving industry that could hobble innovation, some antitrust experts warned. While antitrust law reacts to alleged anticompetitive behavior and can thus be slow, that shortcoming is preferable to prescriptive government rules and regulations, they said.\n “I’m very uncomfortable with the regulatory path, especially if it means things like getting government approval for product changes,” said Herbert Hovenkamp, a professor at the University of Pennsylvania Law School. “The history of regulation shows that it is an innovation killer.”\n A. Douglas Melamed, a former general counsel of Intel and a former antitrust official in the Justice Department, shared that concern. But Mr. Melamed, a member of the expert panel for the Stigler Center report, said the tech giants did pose a competition problem.\n “I think regulation might make sense if it is narrowly focused, not running the industry,” said Mr. Melamed, who is a professor at Stanford Law School.\n The last major antitrust action against a big technology company was  the landmark Microsoft case in the 1990s. The case began with a suit filed in 1994 by the Federal Trade Commission and a simultaneous consent decree.\n The Justice Department and several states later picked up the pursuit, investigated anew, filed suit and conducted an exhaustive trial. Microsoft was found to have repeatedly violated the nation’s antitrust laws, and the company then reached a settlement with the government, which a federal court approved in 2002.\n In the Microsoft case, the antitrust legal process worked, in its way. Yet its impact is still debated. Without the suit and years of scrutiny, some observers said, Microsoft could have throttled the rise of Google.\n  But others said the technological shift toward the internet and away from the personal computer meant that Microsoft had lost the gatekeeper power it once held. Technology, not antitrust, they insisted, opened the door to competition.\n Triumph or not, the Microsoft case was two decades ago. Proponents of a new regulator said antitrust law was ill suited by itself to restraining today’s faster-moving digital giants. In the internet economy, they said, the forces that reinforce and expand the power of a market leader — called network effects — are stronger and more rapid than in the personal computer era.\n “Antitrust is not a fully adequate tool to deal with the companies that dominate these markets,” said Gene Kimmelman, who was on the Stigler Center panel and a co-author of  a recent report by the Shorenstein Center at Harvard that called for the creation of a “digital platform agency” in America.\n Another argument for the regulatory option is that competition concerns now span four companies, not just one. Apple, Amazon, Facebook and Google are in different markets, including search, online advertising, e-commerce and social networks. Bringing separate antitrust cases against them would most likely be beyond the resources of the government.\n “When the competition issues are larger than a single firm, regulation might be the better tool to use,” said Andrew I. Gavil, a law professor at Howard University.", "posttime": "2020-10-22 23:00:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,反垄断法,antitrust,监管", "title": "忘了反垄断法吧。为了限制技术，一些人说需要一个新的监管机构", "title_en": "Forget Antitrust Laws. To Limit Tech, Some Say a New Regulator Is Needed", "transed": 1, "url": "https://www.nytimes.com/2020/10/22/technology/antitrust-laws-tech-new-regulator.html", "via": "", "real_tags": ["rust", "反垄断法", "antitrust", "监管"]}, {"category": "", "categoryclass": "", "imagename": "3de441c4d69f13de07f1d3deddce3e9b.png", "infoid": 1030565, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "注：根据美国农业部经济研究局的定义，农村地区是指那些位于大都市以外的县。它们可能包括小城镇。\n冠状病毒传播到北达科他州福斯特县的速度很慢，福斯特县位于该州东部，人口略高于3000人。当病毒病例在春季在东北部激增时，该县只记录了一例阳性病例。当全国病例数量在7月中旬达到顶峰时，只多记录了两例。\n但到周二，大约每20名居民中就有一人检测出病毒呈阳性。其中超过一半的病例是在过去两周内报告的。\n目前美国大多数最严重的疫情都发生在像福斯特县这样的农村地区。在早先的高峰中，病毒病例主要集中在城市和郊区，而目前的激增是迄今地理上最分散的，它正在重创往往缺乏医院或其他关键医疗资源的偏远县。\n自夏末以来，农村地区的人均病例和死亡率已经超过了大都市地区。\n注：根据美国农业部经济研究局的定义，农村地区是指那些位于大都市以外的县。它们可能包括小城镇。\n由于农村地区人口相对较少，农村地区的冠状病毒病例和死亡总数仍然低于城市。但随着时间的推移，农村地区在病毒负担中所占的份额有所增加。\n现在，农村县记录的死于该病毒的人数约占四分之一。这与3月和4月的情况形成了鲜明对比，当时几乎所有的死亡病例都发生在大都市地区，因为病毒在西雅图地区和加利福尼亚州人口稠密的地区出现早期聚集性之后，在东北部肆虐。\n这些地图显示了全国疫情爆发不同时间点农村地区的病例比率：\n在夏季疫情激增期间，农村疫情发生的频率比春季更高，但城市及其郊区报告的每百万病例仍然高于农村县。\n直到8月份，疫情从休斯顿、迈阿密和凤凰城等阳光地带城市逐渐消退，农村地区的人均病例和死亡率才超过了大都市地区。\n现在，随着全国病例数量和住院率接近第三个峰值，这个国家最大的热点都不在大城市。几乎所有疫情最严重的县的人口都在5万人以下，大多数县的人口都在10000人以下。几乎所有的都在中西部或西部山区。\n虽然疫情的地理传播正在扩大，但许多同类型的地方仍然面临聚集性感染的风险。就人口而言，堪萨斯州诺顿县是全国受灾最严重的县，一家疗养院的62名居民全部感染了病毒，其中10人死亡。该县的一所州立监狱也爆发了疫情。\n上中西部和西部山区的医院也感受到了激增。设施正在为容量而苦苦挣扎，在某些情况下，居民们发现最近的医院有可用的床位需要几个小时的路程，或者在另一个州。\n本月早些时候，北达科他州的医院不得不将患者拒之门外。截至周一，该州首府俾斯麦有一张配备了工作人员的重症监护病房床位。\n被创纪录的病例数量压垮了，北达科他州本周暂停了接触者追踪计划。新墨西哥州州长也看到该州的医院床位挤满了人，她计划对餐馆、酒吧和零售店实施新的限制。\n阿拉斯加正在经历创纪录的感染人数，它提供了一个警示故事：即使进行了广泛的测试和强有力的接触者追踪，随着气温下降和人们转移到室内活动，病毒仍将蓬勃发展。\n资料来源：冠状病毒病例数据来自“纽约时报”数据库，数据库中有来自州和地方卫生机构和医院的报告。", "note_en": "Note: Rural areas are those counties located outside of metropolitan areas, as defined by the United States Department of Agriculture’s Economic Research Service. They may include small cities and towns.\n The coronavirus was slow to come to Foster County, N.D., a community of just over 3,000 people in the eastern part of the state. When virus cases surged in the Northeast in the spring, the county recorded just one positive case. When national case counts peaked in mid-July, it had recorded just two more.\n But by Tuesday, about one in every 20 residents had tested positive for the virus. More than half of those cases were reported in the past two weeks.\n Most of the worst outbreaks in the United States right now are in rural places like Foster County. Where earlier peaks saw virus cases concentrated mainly in cities and suburbs, the current surge is the  most geographically dispersed yet, and it is hitting hard remote counties that often lack  a hospital or other critical health care resources.\n Since late summer, per capita case and death rates in rural areas have outpaced those in metropolitan areas.\n Note: Rural areas are those counties located outside of metropolitan areas, as defined by the United States Department of Agriculture’s Economic Research Service. They may include small cities and towns.\n The total number of coronavirus cases and deaths in rural places remains smaller than those in cities because of the comparatively low population in rural areas. But the rural share of the virus burden has grown over time.\n Now, about one in four deaths from the virus is recorded in a rural county. That stands in contrast to March and April, when almost every death was in a metropolitan area, as the virus tore through the Northeast, after early clusters in the Seattle area and populous parts of California.\n These maps show the case rates in rural areas at different points of the national outbreak:\n  During the summer surge, rural outbreaks occurred more often than they had in the spring, but reported cases per million remained higher in cities and their suburbs than in rural counties.\n It was not until August, when the outbreak was receding from Sun Belt cities like Houston, Miami and Phoenix that per capita rates of cases and deaths in rural areas surpassed those in metropolitan areas.\n Now, with the national case count and hospitalization rates  approaching a third peak, none of the country’s biggest hotspots are in a large city. Almost all the counties with the largest outbreaks have populations under 50,000, and most have populations under 10,000. Nearly all are in the Midwest or the Mountain West.\n Though the outbreak’s geographic spread is expanding, many of the same kinds of places remain at risk for clusters of infections. In Norton County, Kan., the hardest-hit county in the country relative to its population,  all 62 residents of one nursing home have been infected with the virus, and 10 have died. A state prison in the county also has an outbreak.\n Hospitals across the Upper Midwest and the Mountain West are also feeling the surge. Facilities are struggling with capacity, and in some cases residents are finding that the nearest hospital with available beds is hours away, or in another state.\n Earlier this month, hospitals in North Dakota had to  turn patients away. Bismarck, the state’s capital, had one staffed I.C.U. bed available  as of Monday.\n Overwhelmed by the record case numbers, North Dakota  suspended its contact tracing program this week. New Mexico’s governor, also seeing hospital beds fill up in her state, plans to put in effect  new restrictions on restaurants, bars and retail stores.\n And Alaska, which is experiencing record numbers, provides a cautionary tale: Even with extensive testing and robust contact tracing,  the virus is poised to thrive as temperatures drop and people move activities indoors.\n Source: Coronavirus case data is from a  New York Times database of reports from state and local health agencies and hospitals.", "posttime": "2020-10-22 22:57:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,美国,爆发,virus,病例", "title": "美国最严重的病毒爆发现在发生在农村地区", "title_en": "The Worst Virus Outbreaks in the U.S. Are Now in Rural Areas", "transed": 1, "url": "https://www.nytimes.com/interactive/2020/10/22/us/covid-rural-us.html", "via": "", "real_tags": ["病毒", "美国", "爆发", "virus", "病例"]}, {"category": "", "categoryclass": "", "imagename": "1400eab1c8211d565fe50e51f239a807.jpg", "infoid": 1030564, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿-一家网络安全公司表示，他们发现一名黑客出售超过2亿美国人的个人身份信息，其中包括1.86亿的选民登记数据。\n这一披露突显了美国人在犯罪分子和外国对手以电子邮件为目标时是多么脆弱，尽管美国官员宣布，伊朗和俄罗斯已经获得了选民登记数据和电子邮件地址，目的是干预2020年的选举。\n全球网络安全公司Trustwave确认的许多数据都是公开的，几乎所有这些数据都是合法企业经常买卖的那种。但是，在所谓的黑暗网络上发现了如此多的姓名、电子邮件地址、电话号码和选民登记记录，这一事实突显了犯罪分子和外国对手通过发送旨在恐吓选民的电子邮件，通过发送旨在恐吓选民的电子邮件，可以很容易地利用这些信息，就像联邦调查局(FBI)最近所说的那样。\n发现这些材料的Trustwave安全研究副总裁齐夫·马多尔(Ziv Mador)表示，网络罪犯和外国对手可以获得大量关于美国公民的数据。\n他补充说，在选举之前、期间和之后，这些选民和消费者数据很容易被坏人利用，通过社交媒体、电子邮件钓鱼、短信和电话诈骗等方式进行地理定位的虚假信息活动，特别是在选举结果存在争议的情况下。\n他说，这些数据混合了近年来各种公司黑客攻击中窃取的材料，以及从政府网站检索到的公开可用数据。例如，在大多数州，选民登记信息都是公开的。\nTrustwave监控黑暗网络论坛的威胁信息，它遇到了一名自称Greenmoon2019的黑客，他正在提供出售数据。Trustwave使用虚构的身份诱使黑客提供更多信息，包括Greenmoon 2019用来收取付款的比特币钱包。\n比特币钱包是最常用的加密货币的虚拟存储设施，它公开显示交易，但不显示交易者的身份。马多尔说，Trustwave能够追踪到5月份创建的一个更大的钱包的付款，这个钱包已经吸收了公司认为是非法收益的1亿美元。他说，并不是所有的这些都来自数据销售。\n个人信息的广泛可获得性并不是什么新鲜事，但随着选举的临近，如此巨大的宝藏被出售的想法突显了恶意行为者制造麻烦是多么容易。Trustwave表示，黑客提供了1.86亿份选民记录和2.45亿份其他个人数据记录。\n美国国家情报总监约翰·拉特克利夫(John Ratcliffe)周三晚间表示，伊朗获得了选民登记信息，并利用这些信息向民主党人发送威胁性电子邮件，同时冒充白人至上主义组织骄傲男孩(Popular Boys)。拉特克利夫说，俄罗斯政府还获得了选民登记信息。\n在许多州，选民登记数据是公开的，但电子邮件地址通常不是公共数据的一部分。Mador说，Trustwave确认的黑客使用其他被盗的数据将电子邮件地址与选民名单配对，并将其作为包裹出售。\n例如，Greenmoon2019出售的数据库将允许恶意行为者只针对注册的民主党人或只针对注册的共和党人的电子邮件地址。\nTrustwave表示，它将收集到的信息交给了联邦调查局，联邦调查局在一份声明中告诉NBC新闻：\n我们致力于发现和调查这次选举中的舞弊行为。虽然我们不能对我们是否从公众那里收到的信息发表评论，但我们想向美国人民保证，联邦调查局与我们的联邦、州和地方合作伙伴密切协调，以保障我们的投票过程。\n肯·迪拉尼安是NBC新闻调查组负责情报和国家安全的记者。", "note_en": "WASHINGTON — A cybersecurity company says it has found a hacker selling personally identifying information of more than 200 million Americans, including the voter registration data of 186 million.\n The revelation underscored how vulnerable Americans are to email targeting by criminals and foreign adversaries, even as U.S. officials announced that  Iran and Russia had obtained voter registration data and email addresses with an eye toward interfering in the 2020 election.\n   Much of the data identified by Trustwave, a global cybersecurity company, is publicly available, and almost all of it is the kind that is regularly bought and sold by legitimate businesses. But the fact that so many names, email addresses, phone numbers and voter registration records were found for sale in bulk on the so-called  dark web underscores how easily criminals and foreign adversaries can deploy it as the FBI said Iran has done recently, by sending emails designed to intimidate voters.\n &#34;An enormous amount of data about U.S. citizens is available to cyber criminals&#34; and foreign adversaries, said Ziv Mador, vice president of security research at Trustwave,  which found the material.\n  &#34;In the wrong hands, this voter and consumer data can easily be used for geotargeted disinformation campaigns over social media, email phishing and text and phone scams,&#34; he added, &#34;before, during and after the election, especially if results are contested.&#34;\n The data is a mix of material stolen in various hacks of companies in recent years and publicly available data retrieved from government websites, he said. In most states, voter registration information is publicly available, for example.\n  Trustwave monitors dark web forums for threat information, and it came across a hacker calling himself Greenmoon2019 who was offering the data for sale. Trustwave used fictitious identities to induce the hacker to provide more information, including a Bitcoin wallet that Greenmoon2019 used to collect payment.\n  Bitcoin wallets — virtual storage facilities for the most commonly used cryptocurrency — publicly display transactions but not the identities of those making them. Trustwave was able to trace payments to a larger wallet, created in May, that has taken in $100 million in what the company believes is illicit proceeds, Mador said. Not all of that was from data sales, he said.\n The wide availability of personal information is not new, but the idea that such a huge cache is for sale as the election approaches underscores how easy it would be for malicious actors to cause trouble. Trustwave said the hacker was offering 186 million voter records and 245 million records of other personal data.\n National Intelligence Director John Ratcliffe said Wednesday night that Iran had obtained voter registration information and used it to send threatening emails to Democrats while posing as the Proud Boys, a white supremacist group. Ratcliffe said the Russian government had also obtained voter registration information.\n  Voter registration data is public in many states, but email addresses are not often part of the public data. The hacker identified by Trustwave used other stolen data to pair email addresses with voter rolls and offer it for sale as a package, Mador said.\n  The databases on sale by Greenmoon2019 would allow malicious actors to target the email addresses of only registered Democrats, for example, or only registered Republicans.\n Trustwave said it turned over what it had gathered to the FBI, which told NBC News in a statement:\n &#34;We are committed to finding and investigating fraud during this election. While we cannot comment on information we may or may not have received from the public, we want to assure the American people the FBI is closely coordinated with our federal, state, and local partners to safeguard our voting processes.&#34;\n Ken Dilanian is a correspondent covering intelligence and national security for the NBC News Investigative Unit.", "posttime": "2020-10-22 22:43:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,黑客,选民,selling,信息", "title": "网络公司发现黑客出售1.86亿美国选民的信息", "title_en": "Cyber firm finds hacker selling info on 186 million U.S. voters", "transed": 1, "url": "https://www.nbcnews.com/politics/2020-election/cybersecurity-firm-finds-hacker-selling-info-148-million-u-s-n1244211", "via": "", "real_tags": ["美国", "黑客", "选民", "selling", "信息"]}, {"category": "", "categoryclass": "", "imagename": "89562adba900470db9bf50531c20e738.jpeg", "infoid": 1030563, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天我们要介绍的是Product Hunt的新任首席执行官。但首先，…的背景故事。\n过去的七年是我生活和职业生涯中最具挑战性和最有意义的七年。Product Hunt最初是一份电子邮件时事通讯，一天清晨在旧金山的菲尔茨咖啡(Philz Coffee)发布了一条推文。谢天谢地，这个想法得到了支持，Product Hunt很快成为创业时代精神的一部分，这是一个由制造者和乐观主义者组成的社区，他们分享和庆祝世界各地的最新科技。从那以后，我们看到：\n在该平台上推出了20多万个产品，包括家喻户晓的品牌的早期版本，如Concept、Airtable、Lambda School等。\n社区不断增长，业务盈利，我们继续受到这样的轶事的启发，像这样的，这样的。\n在与一支才华横溢的团队一起经历了一段令人惊叹的旅程之后，感觉现在是做出改变的合适时机。\n产品狩猎一直是我的生活。我清楚地记得，在2014年，我第一次无意中听到一个陌生人说，那是产品猎人吗？这家公司在很大程度上决定了人们对我的看法，以及我对自己的看法。\n从一开始，我就把我的全部精力投入到产品猎头中。我一天中的大部分时间(经常是梦想)都集中在我们共同建立的社区和企业上。从周一到周日，我追逐高点，突破低点。这是许多创始人和首席执行官的生活，我有幸领导了七年。\n我们在“产品猎人”的文化价值观之一就是真实性。去年，我意识到我已经不再忠于这个价值观。我不是真正的我。推动我工作的动力和快乐开始消退，取而代之的是越来越多的抑郁和倦怠。我压抑了自己的真实感受。我告诉自己，这就是我签约的目的。这是我的工作。而且确实是这样。但是这个阴影阻碍了我做最好的工作。\n我永远感谢社会各界对我的支持和公司给我的机会。\n与许多创始人一样，我对社区和我们共同创建的公司有着深深的依恋，这使得这一过渡变得特别困难。7月4日，我做出了寻找新CEO的决定。我相信我们会找到一位强有力的领导者来提升产品猎人的使命，并以真实和大胆的新想法服务于社区。\n我几年前认识了乔什·巴克利。我们在几个共同点上建立了联系：我们都是Y Combinator校友，并在游戏行业工作了几年。2011年，他创立了米诺游戏公司(Mino Games)，这是米诺怪物和猫游戏的创造者(与Product Hunt😉没有关系)。在从首席执行官过渡到董事长之前，他将团队扩大到70人，年收入达到2000万美元。\n自从辞去首席执行官一职后，乔什把更多的时间花在了投资上。他是繁荣、重组、涟漪、Clearbit、漫游研究和许多其他项目的早期投资者。他投资于种子期初创公司，但也因投资于后期公司而声名鹊起，领跑NexHealth的1500万美元首轮和Playco的1亿美元首轮。很少能看到有人(尤其是独立资本家)如此坚定地投资于多个阶段。\n关于乔什，我最喜欢的特质是：他的野心。尽管他举止谦逊，但他有大胆的想法，并有将这些想法付诸实践的记录。\n今年早些时候，我给他打了电话，征求他的意见。我们的快速追赶演变成了关于Product Hunt未来的更深入的讨论，他将在那里对公司进行重大投资，并加入公司担任首席执行官。\n我们分享了大量关于产品猎头和未来机遇的对话。他对Product Hunt社区的未来有着令人难以置信的愿景-这是由他作为创始人的独特经历塑造的-让我对他带领社区度过下一个篇章的能力充满信心。\n我渴望与您分享产品猎头的下一步是什么，但我不想从乔希即将发布的公告中抽丝剥茧。\n短期内，我们会在社区上下双倍的赌注。在过去的一个月里，我们悄悄地发布了几个微妙但重要的改进，改进了网站的用户档案、讨论和架构，为下一步做好了准备。\n乔希明白，对我们来说，继续投资于一个健康的社区是多么重要，这个社区庆祝制造商和建设。这不会是他第一次领导一个面向全球观众的团队建设社区。\n“产品猎人”和我们共同建立的社区对我来说意义重大。我将继续从战略层面支持公司，来自AngelList的Naval将继续留在董事会。\n请加入我们的全球团队和我一起欢迎乔希担任他的新角色。很高兴你们都能听到下一步是什么。✌️😸", "note_en": "Today we’re introducing the new CEO of Product Hunt. But first, the backstory…\n The last seven years have been the most challenging and rewarding of my life and career. Product Hunt started as an email newsletter, &#34;launched&#34; with a tweet one early morning at Philz Coffee in San Francisco. Thankfully, this idea got traction and Product Hunt quickly became part of the startup zeitgeist, a community of makers and optimists sharing and celebrating the latest in tech around the world. Since then we&#39;ve seen:\n 200,000+ products launched on the platform, including early versions of household names like Notion, Airtable, Lambda School, and many others\n The community continues to grow, the business is profitable, and we continue to be inspired by anecdotes like  this,  this,  this,  this,  this,  this, and  this.\n After an amazing journey with a talented team, it felt like the right time to make a change.\n Product Hunt has been my life. I distinctly remember back in 2014 the first time I overheard a stranger say, &#34;Is that the Product Hunt guy?&#34; The company is a large part of how people perceive me, and how I perceive myself.\n Since the beginning I&#39;ve thrown my whole being into Product Hunt. The majority of my day (and often dreams) were focused on the community and business we&#39;ve built together. I chased the high highs and pushed through the low lows, Monday through Sunday. This is the life of many founders and CEOs, and one that I’ve been privileged to lead for seven years.\n One of our cultural values at Product Hunt is authenticity. Last year I realized I had stopped being true to this value. I wasn&#39;t being my authentic self. The motivation and happiness that fueled my work started to fade, replaced with a growing cloud of depression and burnout. I suppressed my true feelings. I told myself, &#34;This is what I signed up for. This is my job.&#34; And it was. But this shadow was keeping me from doing my best work.\n   I&#39;m forever grateful to the community for their support and for the opportunities the company has given me.\n I, like many founders, have a deep attachment to the community and the company we&#39;ve built together, which makes this transition particularly difficult. On July 4th I made the decision to search for a new CEO. I was confident we would find a strong leader to elevate Product Hunt&#39;s mission and serve the community with authenticity and bold new ideas.\n   I met Josh Buckley several years ago. We bonded over a few commonalities: We&#39;re both Y Combinator alums and spent several years working in the gaming industry. In 2011 he founded Mino Games, creators of Mino Monsters and Cat Game (no relation to Product Hunt 😉). He grew the team to 70 people reaching $20M in annualized revenues before transitioning from CEO to Chairman.\n Since stepping down as CEO, Josh has spent more of his time investing. He&#39;s an early investor in Boom, Retool, Rippling, Clearbit, Roam Research, and many others. He invests in seed stage startups but has also made a name for himself with investments in later stage companies, leading NexHealth&#39;s $15M Series A and Playco&#39;s $100M Series A. It&#39;s rare to see someone, especially a  solo capitalist, invest across multiple stages with this much conviction.\n My favorite quality about Josh: His ambition. He has bold ideas and a track record of bringing them to life, despite his humble demeanor.\n I called him earlier this year to ask for advice. Our &#34;quick catch up&#34; evolved into a much deeper conversation about the future of Product Hunt, where he’d both be making a significant investment in the company, and joining as CEO.\n  We shared numerous conversations about Product Hunt and the opportunities ahead. He has an incredible vision for the future of the Product Hunt community – shaped by his unique experiences as a founder – giving me confidence in his ability to lead it through its next chapter.\n I&#39;m eager to share with you what&#39;s next for Product Hunt, but I don&#39;t want to take away from Josh&#39;s upcoming announcements.\n In the short term, we&#39;re doubling down on the community. In the past month, we&#39;ve quietly released several subtle but important improvements to user profiles, discussions, and architecture of the site in prep for what&#39;s next.\n Josh understands how important it is for us to continue investing in a healthy community that celebrates makers and building. This won&#39;t be the first time he&#39;s led a team building community for a global audience.\n   Product Hunt and the community we&#39;ve built together means so much to me. I will continue to support the company at a strategic level and Naval from AngelList will remain on the board.\n Please join our global team and me in welcoming Josh in his new role. Excited for you all to hear about what&#39;s next. ✌️😸", "posttime": "2020-10-22 22:39:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "josh,buckley", "title": "Product Hunt宣布Mino Games创始人兼天使投资人乔什·巴克利(Josh Buckley)为新任首席执行官", "title_en": "Product Hunt announces founder of Mino Games and angel investor Josh Buckley as its new CEO", "transed": 1, "url": "https://www.producthunt.com/stories/product-hunt-s-new-ceo-josh-buckley", "via": "", "real_tags": ["josh", "buckley"]}, {"category": "", "categoryclass": "", "imagename": "04ad74ab892d8c7debec997435b8c0af.png", "infoid": 1030561, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我第一次看到阿美人的时候，我立刻爱上了它。雪铁龙(Citroën)的迷你电动车“柠檬”(Citadine)聪明、创新、设计精良。看到第一批记者车在巴黎宽阔的林荫大道上疾驰而过，我脸上露出了灿烂的笑容。但是我越想越怀疑这辆车的用途。\nAMI最初是作为AMI One C概念车诞生的，这是一项研究如何克服设计小型、负担得起的城市汽车的挑战的新方法。两个最大的挑战是如何创造尽可能多的室内空间和如何保持较低的生产成本。这款概念车的许多想法都被应用到了阿美的生产模式中。\n在制造价格适中的城市汽车时，通常的节约成本秘诀是与其他制造商共用一条生产线。缺点是，这些制造商销售的是设计细节略有不同的同一款车。\n雪铁龙采取了不同的方式。他们没有共享一条生产线，而是想出了创建最简单的生产线的方法。这限制了设计的多样性，但AMI并没有试图掩盖这一点，而是强调了这些限制。最明显的例子是外部车身。正如你可以从下面的视频中看到的那样，车身外部主要由三个不同的车身面板组成。\n这让它看起来很古怪，因为从很远的地方看，这辆车似乎没有清晰的前后方。这些门也有类似的效果。因为它们是相同的，所以它们彼此朝相反的方向打开。雪铁龙没有试图隐藏这些限制，而是在广告和商业广告中展示这些限制，庆祝这款车的古怪之处。\n雪铁龙还受到了批量生产之父福特Model T的启发，与Model T一样，Ami也只有一种颜色可供选择。不过，个性化对许多客户来说很重要。因此，雪铁龙拿出了不同的贴纸套装，顾客可以用来对汽车进行个性化设置。\n这种聪明的设计理念在室内得以延续。例如，侧窗不是电动的，而是向外铰链。雪铁龙喜欢指出，这是受到阿美族精神之父2CV的启发，把它变成了一种怀旧的特征，而不是一种限制。\n这不仅仅是为了节省成本，因为通常用来存放窗户的空间现在变成了储藏室。\n如今，汽车公司面临的一大挑战是，消费者希望在汽车上使用更昂贵的技术。新款智能手机的采用率很高，客户期望他们的汽车也能有同样水平的创新。对于一辆便宜的城市汽车来说，这是不可能的，这就是为什么AMI没有中控台，而是有一个大的智能手机底座。就像这样，AMI利用司机的智能手机免费提供与豪华车相同的功能。同样，这辆车也没有扬声器。取而代之的是，仪表盘上有一个设计用来容纳蓝牙扬声器的开口。\n它仅有的几个功能是一个加热器(没有空调)，以及一个廉价的单色集群屏幕，它可以显示最少的信息，如速度、电池电量和下一次充电前的时间。\n创造大量的室内空间对小型城市汽车来说是一个巨大的挑战。多亏了AMI的电动传动系统，原本用来容纳发动机、变速箱和其他机械部件的空间现在可以用于内部。这也意味着车轮可以放置在汽车的外缘，这不仅给了它一个微小的转弯圈，也最大化了车内空间。\n汽车的许多窗户允许大量自然光进入机舱，这有助于使内部感觉更大。第一次进入汽车感觉不真实。这辆车比路上的任何其他车辆都小得多。它的长度为2.41米，宽度为1.29米，明显小于Smart ForTwo(2.69米x 1.66米)。但是当进入车内时，内部感觉非常宽敞，似乎比车本身还要大！\n显然，AMI不是用来度假的，所以它不需要很大的存储空间。它确实设法有足够的内部空间来容纳你短途旅行时要带的东西。由于车的包装，仪表盘可以伸展到车的前面相当远的地方。在它里面，有不同的图案和小东西的支架，比如水瓶或太阳镜。\n一个直接来自概念车的想法是将乘客座椅放在比司机座位稍靠后一点的位置，这样就在乘客的脚下为背包创造了一个空间。\n开着阿美在巴黎转悠，感觉更像是一辆滑板车，而不是一辆汽车。多亏了许多窗户，你会感觉更暴露，更容易与其他道路使用者联系在一起。它更容易与骑自行车的人和行人进行眼神交流和交流，因此它是一种比普通汽车更友好的交通工具。尽管材料便宜，但车内并不是一个令人不快的地方。通过巧妙地为智能手机创造空间和位置，它为你提供了短途旅行可能需要的一切。不喜欢它是很难的！\n雪铁龙打算让阿美成为(城市)大众的汽车，并试图给每个人一个使用的理由。在支付首付后，它可以以6000欧元左右的价格购买，或者以每月20欧元的价格出租。此外，几家汽车共享服务公司将把AMI包括在他们的车队中。它不仅在雪铁龙经销商有售，在法国大型电子零售商Fnac和Darty也有售。\n它的最高时速为45公里/小时，充满电后可以行驶75公里，用普通的220V家用插头充电只需要3个小时。它被归类为四轮车，而不是汽车，因此在法国，任何超过14岁的人都可以合法地在没有驾照的情况下驾驶这辆车。\n雪铁龙并没有针对特定的目标受众设计这款车。但该公司确实想打入家庭市场。雪铁龙预计，近一半的司机年龄将在18岁以下。他们辩称，父母更愿意让十几岁的孩子乘坐比摩托车或自行车安全得多的车辆在城市里赛车。每月订阅的价格类似于公交卡或滑板车的订阅价格，这使得它成为一个有吸引力的替代选择。第一个迹象显然是积极的，因为目前有等待试驾的队伍。\n到目前为止，一切都很好。AMI价格便宜，设计精良，环保，大多数公众都可以使用。什么是不爱呢？为了理解我的担忧，我们必须回到过去，看看城市交通的更大图景。\n在汽车成为主要交通工具之前，城市街道是孩子们踢足球的地方，邻居们会在这里相遇并停下来聊天。它们是人们消磨时间和社交的地方。但在某种程度上，有些事情发生了变化。巴黎是最早发生这种情况的城市之一。1853年至1870年间，豪斯曼男爵将巴黎中世纪市中心的大部分地区改造成了一座健康的城市。这包括拆除大部分狭窄的街道，为宽阔的林荫大道腾出地方。\n它的副作用是让马车行驶得更快，导致街道更喧闹、更危险。在此之前，行人统治着街道，其他交通工具不得不适应这种情况。不过，改造后，宽阔的林荫大道改变了这一点。请查看这段1890年的视频，其中清晰可见：\n第二次世界大战后，当汽车被视为个人交通的未来时，情况变得更加糟糕。现代主义运动把整个城市中心变成了高速公路和停车场。突然间，城市街道不再是一个社交场所，它们的存在是为了让交通尽可能快而高效地从A到B。尽管行人占多数，但他们被分配到狭窄的人行道上，乱穿马路成为一种违法行为，大部分公共空间被分配给驾驶或停车。\n随着时间的推移，我们已经接受了这一点，但事实并非如此。在“太空的傲慢”一书中，米凯尔·科尔维尔-安德森以巴黎为例描述了空间分配的不公平：\n随着全球气候变化的重要性不断上升，以及最近的Covid危机，城市们开始意识到目前的解决方案是不可持续的。几十年前就已经实现了这一点的国家是荷兰。与60年代的其他国家一样，荷兰的城市也在向以汽车为中心的基础设施迈进。有计划摧毁阿姆斯特丹的大部分历史中心，为高速公路让路。经过多年来反对汽车危险的抗议活动，荷兰开始寻找更安全、更方便的方式来发展其基础设施。\n今天，阿姆斯特丹和其他荷兰城市的大多数市民要么骑自行车上班，要么乘坐公共交通，或者两者兼而有之。这使得城市噪音更少，空气污染更少，居民更快乐，更健康，更少的交通事故，更多独立的孩子，…。名单还在继续。尽管骑自行车经常被归因于荷兰文化，但它与之无关。荷兰的周期，因为基础设施就在那里。如果其他国家能够停止对汽车的上瘾，他们也可以实现同样的目标。\n如果说Covid危机带来了一件积极的事情，那就是更多的城市正在意识到这一点。巴黎发生了巨大的变化，新建了超过650公里的自行车道。围绕步行和骑自行车设计你的城市，不是强迫人们骑自行车，而是提供汽车的替代方案。当有不同的方式到达你的目的地时，人们会选择最好的交通方式，在大多数情况下，恰好是骑自行车。\n著名的里沃利街就是一个很好的例子。它曾经是一条以汽车为主的三车道街道。今天，汽车只允许在一条车道上行驶，其余的都被分配给骑自行车。自从这一变化以来，每天大约有1万名骑自行车的人使用自行车道。巴黎已经证明了这一点，如果你建造了基础设施，人们就会使用它。\n有了这些背景信息，让我们回到AMI。它与这个新未来的契合点在哪里？理想的未来应该是大多数人步行或骑自行车出行。像阿美这样的交通工具可以用于步行或骑自行车不可能的短途旅行。如果一个城市的大多数汽车都是阿美族，道路可以更窄，街道停车更少，噪音也更少，最大的问题是阿美族并不与其他汽车竞争，而是与公共交通、摩托车和自行车竞争。这可能会促使少数汽车使用者改用AMI，但大多数人将是那些原本会骑自行车或公共交通出行的人。\n你可能会争辩说，选择AMI而不是自行车没有什么错，因为它更舒适，更安全。但这是一个目前在一个沉迷于汽车的世界里奏效的解决方案。我担心阿美会阻止人们骑自行车，减少地方政府建设更好基础设施的筹码。\n对于机动性较差的人、送货服务、地方政府、信使或其他服务来说，AMI是一种很好的交通方式。但绝大多数的AMI司机将是那些选择开车而不是骑自行车或乘坐公共交通舒适的人。从这个意义上说，这将对城市摆脱汽车成瘾的倡议产生不利影响。\n如果每个人都决定明天骑车上班，城市将在一夜之间改变他们的基础设施。它们将变得污染更少、更安静、更令人愉快，这样的清单不胜枚举。我希望阿美能说服一些车主把他们的大轿车换成友好的阿美，但我忍不住认为这是在通往更宜居城市的道路上倒退了一步。尽管如此，我每次看到它都会微笑，特别是在巴黎的大街小巷。", "note_en": "When When I saw the Ami for the first time I instantly fell in love. Citroën&#39;s tiny electric &#39;citadine&#39; is smart, innovative, and well-designed. Seeing the first press cars zip through the wide boulevards of Paris brought a big smile to my face. But the more I kept thinking about it, the more I started to doubt the purpose of this car.\n   The Ami started life as the AMI ONE C Concept which was a study on new ways to overcome the challenges of designing a small, affordable city car. The two biggest challenges are how to create as much interior space as possible and how to keep the production costs low. Many of the ideas of the concept car have found their way to the Ami production model.\n   The &#39;usual&#39; cost-saving recipe when creating affordable city cars is to share a production line with other manufacturers. The drawback is that these manufacturers are selling the same car with slightly different design details.\n  Citroën took a different approach. Instead of sharing a production line, they have come up with ways to create the simplest production line. This limits the variety of the design but instead of trying to hide that, the Ami highlights these limitations.The clearest example is the exterior bodywork. As you can see from the video below, the exterior is largely made up of only three different bodywork panels.\n   This gives it its quirky look as from far away the car does not seem to have a clear front or backside. The doors have a similar effect. Because they are identical, they open in opposite directions from each other. Instead of trying to hide these limitations, Citroën shows them off in ads and commercials, celebrating the quirkiness of the car.\n  Citroën was also inspired by the father of mass production, the Ford Model T. Like the Model T, the Ami is only available in one color. Personalization is important to many customers though. So Citroën came up with different sticker sets that the customer can use to personalize the car.\n  This smart design philosophy continues in the interior. For example, the side windows are not electric but hinge outward. Citroën like to point out that this was inspired by the 2CV, the spiritual father of the Ami, turning it into a nostalgic feature instead of a limitation.\n  It is not only for cost-saving though because the space that is normally used to house the window when it is down is now a storage compartment.\n  A big challenge for car companies today is that customers want more expensive technology to be available in the car. The adoption rate of new smartphones is high and customers expect the same level of innovation in their cars. For a cheap city car, it is impossible to provide this.That is why the Ami does not have a center console but instead, a big smartphone mount. Like this, the Ami leverages the driver&#39;s smartphone to offer the same features as premium cars without the cost. Similarly, the car has no speakers. Instead, there is an opening in the dashboard designed to hold a Bluetooth speaker.\n  The few functionalities it does have are a heater (no airconditioning), and a cheap, monochrome cluster screen that shows minimal information like speed, battery level, and time until the next charge.\n   Creating a lot of interior space is a huge challenge for small city cars. Thanks to Ami&#39;s electric drivetrain, the space that is otherwise used to house the engine, gearbox, and other mechanical parts can now be used for the interior. It also means that the wheels can be placed at the outer edges of the car which not only gives it a tiny turning circle, it also maximizes the interior space.\n The many windows of the car allow for a lot of natural light to enter the cabin which helps in making the interior feel big.Entering the vehicle for the first time feels unreal. The car is much smaller than any other vehicle on the road. With its length of 2.41m and width of 1.29m, it is significantly smaller than a Smart Fortwo (2.69m x 1.66m). But when entering the car, the interior feels so spacious that it seems bigger than the car itself!\n Clearly, the Ami is not meant for going on vacation so it does not need to have a big amount of storage space. It does manage to have enough interior space for the things you would bring on short trips.Due to the packaging of the car, the dashboard reaches quite far to the front of the car. In it, there are different patterns and holders for small items like a water bottle or sunglasses.\n  An idea that directly comes from concept car is to place the passenger seat a bit further back than the driver&#39;s seat which creates a space for a backpack in the passenger&#39;s footwell.\n  Driving the Ami around Paris, it feels more like a scooter than a car. Thanks to the many windows, you feel more exposed and connected to other road users. It is easier to make eye contact and communicate with cyclists and pedestrians so it is a much friendlier vehicle than a regular car.Despite the cheap materials, the interior is not an unpleasant place to be. By cleverly creating space and a place for the smartphone, it provides everything you might need for a short trip. It is hard not to love it!\n   Citroën has intended the Ami to be a car for the (urban) masses and is trying to give anyone a reason to use one. It is available to buy for around 6000 euros or rent for 20 euros per month after a down payment. Additionally, several car-sharing services will include the Ami in their fleet. It is not only available at Citroën dealerships, but also in France&#39;s big electronics retailers Fnac and Darty.\n  It has a top speed of 45km/h, it can do 75km on a full charge and it takes only 3 hours to charge it in a normal 220v household plug. It is classified as a quadricycle, not a car, so anyone over 14 can legally drive the car in France without a license.\n Citroën did not design the car for a specific target audience. But the company does want to tap into the market of families. Citroën expects that almost half of the drivers will be younger than 18. They argue that parents will prefer to have their teenage children race around the city in a vehicle that is much safer than scooters or bicycles. The price of a monthly subscription is similar to a public transportation card or scooter subscription making it an attractive alternative.The first signs are clearly positive as there are currently waiting lines to test drive one.\n  So far so good then. The Ami is cheap, well-designed, eco-friendly, and accessible to most of the public. What is not to love? To understand my concerns, we have to dive back in time and look at the bigger picture of city transportation.\n  Before cars were the main mode of transport, city streets were a place where children played football, where neighbors would run into each other and stop for a chat. They were a place where people spent time and socialized. But at some point, something changed. Paris was one of the first cities where this happened. Between 1853 and 1870 Baron Haussman transformed much of the medieval city center of Paris into a &#39;healthy&#39; city. This involved tearing down much of the narrow streets to make place for wide boulevards.\n  The side effect was that it allowed horse-drawn carriages to go much faster, resulting in louder, more dangerous streets.Before, pedestrians ruled the streets and other forms of transportation had to adjust to them. After the transformation though, the wide boulevards switched this around. Check this video from 1890 where this is clearly visible:\n  After the Second World War, this became even worse when cars were seen as the future of personal transportation. The modernist movement turned entire city centers into highways and parking lots. Suddenly, city streets were not a social place, they were there to get traffic from A to B as quickly and efficiently as possible. Pedestrians, despite being in the majority, were delegated to narrow sidewalks, jaywalking became an offense, and most of the public space was allocated to driving or parking.\n  Over time we have accepted this as normal but it isn&#39;t. In  &#39;The Arrogance of Space&#39; Mikael Colville-Anderson describes the unfair distribution of space with Paris as an example:\n  With the rising importance of global climate change and more recently, the Covid crisis, cities are realizing that the current solution is unsustainable.A country where this realization has happened a few decades ago is the Netherlands. Like other countries in the &#39;60s, Dutch cities were moving towards car-centric infrastructure. There were plans to destroy much of the historic center of Amsterdam to make way for highways. After years of protests against the dangers of cars, the Netherlands looked at safer, more accessible ways of developing its infrastructure.\n  Today, the majority of citizens in Amsterdam, and other Dutch cities, either cycle to work, takes public transport, or a combination of the two. This results in cities with less noise, less air pollution, happier and healthier inhabitants, fewer road accidents, more independent children, ... The list goes on. Even though cycling is often attributed to Dutch culture, it has nothing to do with it. The Dutch cycle because the infrastructure is there. Other countries can achieve the same if they can stop their car addiction.\n If there is one positive thing that has happened thanks to the Covid crisis, it is that more cities are realizing this. Paris has seen a massive transformation with more than 650km of new bike lanes. Designing your city around walking and cycling is not about forcing people to get on a bike, it is about offering alternatives to the car. When there are different ways of getting to your destination, people will choose the best form of transportation, which in most cases happens to be the bike.\n A great example of this is the famous Rue de Rivoli. It used to be a three-lane street dominated by cars. Today, cars are only allowed on one lane, the rest is allocated to cycling. Since this change, around 10,000 cyclists use the bike lanes each day. Paris has proven the point that if you built the infrastructure, the people will use it.\n   With this background information, let&#39;s go back to the Ami. Where does it fit into this new future? An ideal future would be one where the majority of people travel on foot or by bike. A vehicle like the Ami could be used for the short trips that are not possible on foot or by bike. If the majority of cars in a city were Ami, roads can be narrower, with less street parking, and less noise.The big problem is that the Ami does not compete with other cars, it competes with public transport, scooters, and cycling. It might motivate a few car users to switch to an Ami, but the majority will be the people that would otherwise travel by bike or public transportation.\n You might argue that there is nothing wrong with choosing the Ami over a bicycle because it is more comfortable and safer. But it is a solution that works right now in a car addicted world. I fear the Ami will discourage people from cycling, creating less leverage for local governments to build better infrastructure.\n  The Ami is a great mode of transport for the less mobile, for delivery services, local governments, messengers, or other services. But the great majority of Ami drivers will be people who choose the comfort of driving over cycling or taking public transport. And in that sense, it will work against cities&#39; initiatives to move away from our car addiction.\n If everybody decided to cycle to work tomorrow, cities would change their infrastructure overnight. They would become less polluted, quieter, more pleasant, and the list goes on.I hope the Ami can convince some car owners to swap their big cars for the friendly Ami but I can&#39;t help but see it as a step backward in the path to more livable cities. Though, I will still smile every time I see one, especially on the big boulevards of Paris.", "posttime": "2020-10-22 22:35:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "阿美,ami,汽车", "title": "雪铁龙阿美与城市交通的未来", "title_en": "The Citroën Ami and the Future of Urban Transportation", "transed": 1, "url": "https://www.theturnsignalblog.com/blog/ami-and-future-of-transportation/", "via": "", "real_tags": ["阿美", "ami", "汽车"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1030560, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "请注意，所有响应都将在处理后公开。请不要分享个人信息或任何您不愿意公开发布的信息。\n要提交您的回复，您可以：下载回复模板并将其作为邮件正文完成后通过电子邮件发送至response2020@emacsSurvey y.org(您的电子邮件地址将不会公布)。\n调查结束、数据整理整理完成后，结果将在此公布。问题或意见可通过电子邮件发送至Contact@emacsSurvey y.org", "note_en": "Note that all responses will be made public after processing. Please do not share personal information or anything you would not be comfortable posting publicly.\n  To submit your response, you can either:      Download  the response template and email it completed as message body to  responses2020@emacssurvey.org (your email address will not be released)\n   Results will be posted here after the survey is closed and data is cleaned up and compiled.   Questions or comments can be emailed to  contact@emacssurvey.org", "posttime": "2020-10-22 22:35:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "emacs,回复", "title": "Emacs调查", "title_en": "Emacs Survey", "transed": 1, "url": "https://emacssurvey.org", "via": "", "real_tags": ["emacs", "回复"]}]