[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1003193, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "开始30天免费试用", "note_en": "Start 30-day free trial", "posttime": "2020-05-22 05:48:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,自定义,customizable,免费", "title": "Marvin-可自定义的任务管理器和日常计划程序", "title_en": "Marvin – Customizable Task Manager and Daily Planner", "transed": 1, "url": "https://amazingmarvin.com/", "via": "", "real_tags": ["程序", "自定义", "免费"]}, {"category": "", "categoryclass": "", "imagename": "39e7bcf1014cb68868dc5641420a54df.png", "infoid": 1003192, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你刚开始工作或在家上学，远程方法可能会给你做事的方式带来很大的转变。Firefox有许多浏览器扩展，它们可能有助于使#WFH转换更容易、更高效。\n如果您的工作通常意味着要为文档、电子表格、网站等提供大量打开的选项卡，则可以使用选项卡管理器。这三个流行的选项卡扩展提供了重新思考和重组选项卡的独特创意方式：\n树状样式选项卡：收集选项卡并将其嵌套到树状样式的组中，这些组可以进行分支和折叠，以保持浏览器窗口的整洁。\n简单选项卡组：将选项卡分组到您创建的集合中，这些集合将保持隐藏状态，而不是使浏览器窗口变得杂乱无章，直到您需要它们为止。\n猫：轻松管理多个浏览器窗口和选项卡。此扩展可以帮助您在选项卡和窗口上快速打开、关闭、移动、固定和执行许多其他操作。您甚至可以只需单击一下即可保存所有窗口和选项卡以备以后使用。\n书签是指向网页的链接，可以方便地返回到您喜欢的地方。要为页面添加书签，只需单击地址栏中的星号即可。当页面被添加书签时，星号将变为蓝色，并且会弹出一个窗口，以便您可以命名、移动或标记您的书签。[阅读有关Firefox浏览器书签的更多信息。]。这两个Firefox浏览器扩展可以帮助你成为更好的书签。\n默认书签文件夹提供了一种将网页保存到各种书签文件夹的简单方法。方便地将您的工作内容和个人内容分开。\n如果您想要组织对浏览器中敏感信息的快速访问，私有书签将派上用场。\n||如何从Google Chrome切换到Firefox，并随身携带书签。××。\n额外提示：如果你在多台电脑上工作，Firefox账户可以让你在所有设备上同步数据和首选项(如书签、历史记录、密码、打开的标签和已安装的附加组件)。\n当你在家工作时，你自然会通过电子邮件、聊天系统、数字文档和其他在线渠道进行更多的交流。\nLanguageTool会自动检查你在网络上写的任何地方的拼写和语法错误，并建议使用25种以上的语言进行编辑。\n您有没有尝试过定制鼠标手势(您为鼠标定义的特定动作)以获得更高的导航机动性和效率？使用“抓取拖动”和“动量滚动”等强大功能快速浏览页面。以下是三个优秀的鼠标手势扩展-每个扩展都有不同的优势：\nGesturefy：这个带有各种不同命令的可定制鼠标手势扩展通过鼠标手势更快地导航、操作和浏览。\nScrollAnywhere：使用鼠标中键(或右键/左键)拖动滚动条，而不实际接触滚动条。您还可以将行为更改为“抓取并拖动”样式。\nFoxGestures：使用手势库或定义自己的手势库，为鼠标设计动作以处理许多浏览器任务。\n如果电脑屏幕持续明亮的眩光让你的眼睛疲惫不堪，这些扩展可以让你的眼睛休息一下。使用可视化自定义扩展更改整个Internet的配色方案：\n午夜蜥蜴：使用自定义配色方案(如夜间模式、黑暗主题、蓝光滤镜、屏幕着色器、高对比度、灰度等)重新设置网站皮肤。\n深色背景和浅色文本：使每个网页(或只是您想要的页面)在深色背景上显示浅色文本。所有的颜色变化都是完全可定制的。\n额外提示：尝试使用Firefox浏览器主题来改变您的数字装饰。从数以千计的主题中进行选择，给Firefox提供您想要的外观，并随时将其换成新的。\n在家工作需要一定的纪律，否则你可能会模糊专业家务活和家务活之间的界限，更不用说休闲时间了。\n番茄时钟是一个简单的时间管理工具，通过给自己分配严格的工作和休息时间间隔，帮助你保持工作状态。\nImpact Blocker在这里是为了让你远离那些令人分心的、时间链接的网站。只要输入任何让你分心的网站地址，分机就会屏蔽它，直到你自己指定的工作时间之后。\n试试这六个Firefox浏览器扩展，让你的浏览器中的视频和音乐流媒体效果更好。", "note_en": "If you are newly working or going to school from home, the remote approach can be a big shift in how to get things done. Firefox has a number of browser extensions that might help make the #WFH transition a little easier and more productive.\n   If your work typically means having a large number of open tabs for documents, spreadsheets, sites, etc,  tab organizers are here for you. These three popular tab extensions offer uniquely creative ways to re-think and reorganize tabs:\n Tree Style Tab: Collect and nest your tabs into tree-style groups that can be branched and collapsed to keep your browser window tidy.\n Simple Tab Groups: Group your tabs together in collections you create that stay hidden — rather than cluttering your browser window — until you want them.\n Tabby: Manage multiple browser windows and tabs easily. This extension can help you open, close, move, pin, and do many other things on tabs and windows quickly. You can even save all your windows and tabs for later with just one click.\n   Bookmarks are links to web pages that make it easy to get back to your favorite places. To bookmark a page, just click on the star in the address bar. The star will turn blue when the page is bookmarked and a window will pop up so you can name, move or tag your bookmark. [ Read more about Firefox browser bookmarks.] These two Firefox browser extensions can help you be a better bookmark.\n Default Bookmark Folder provides a simple way to save web pages to various bookmark folders. Keep your work and personal content conveniently separated.\n Private Bookmarks comes in handy if you want to organize quick access to sensitive information in your browser.\n ||   How to  switch from Google Chrome to Firefox  and bring your bookmarks along. ||\n Bonus tip: If you work on more than one computer, a  Firefox Account lets you sync your data and preferences (such as your bookmarks, history, passwords, open tabs and installed add-ons) across all your devices.\n  As you work from home, you’ll naturally communicate even more through email, chat systems, digital docs and other online channels.\n LanguageTool automatically checks for spelling and grammar mistakes anywhere you write on the web and suggests edits in 25+ languages.\n  Have you ever tried customizing mouse gestures (which are movements you define for your mouse to do a specific thing) for more navigation mobility and efficiency? Move swiftly through pages using powerful features like “grab ‘n drag” and “momentum scroll.” Here are three excellent mouse gesture extensions—each with distinct strengths:\n Gesturefy: Navigate, operate and browse faster with mouse gestures with this customizable mouse gesture extension with a variety of different commands.\n ScrollAnywhere: Drag your scrollbar with your middle (or right / left) mouse button without actually touching a scrollbar. You can also change the behavior to “grab and drag” style.\n FoxyGestures: Design movements for your mouse to handle many browser tasks using the gesture library or define your own.\n  If the constant bright glare of the computer screen is fatiguing your eyes, these extensions can give them a break. Change the color scheme of the entire internet with visual customization extensions:\n Midnight Lizard: Reskin websites with custom color schemes like night mode, dark themes, blue light filter, screen shader, high contrast, grayscale, etc.\n Dark Background and Light Text: Make every web page (or just the pages you want) display light text on dark backgrounds. All color variations are fully customizable.\n Bonus tip: Try a  Firefox browser theme to change up your digital decor. Choose from thousands of themes to give Firefox just the look you want, and swap it for a new one any time.\n  Working from home requires a certain kind of discipline or you risk blurring the lines between professional and home chores, not to mention leisure time.\n Tomato Clock is a simple time management tool that helps you stay on task by assigning yourself strict work and break intervals.\n Impulse Blocker is here to keep you away from those distracting, timesink websites. Just enter the address of any website that tempts you with unwanted distractions, and the extension will block it until after your self-designated work hours.\n     Try these   six Firefox browser extensions to make video and music streaming even better in your browser.", "posttime": "2020-05-22 05:42:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "远程工作,firefox,扩展,extensions,选项卡", "title": "Firefox扩展使远程工作和学校变得更好", "title_en": "Firefox extensions to make remote work and school a little better", "transed": 1, "url": "https://blog.mozilla.org/firefox/firefox-extensions-work-from-home/", "via": "", "real_tags": ["远程工作", "firefox", "扩展", "选项卡"]}, {"category": "", "categoryclass": "", "imagename": "8aa73e632dd8be3b2953c8440b278af6.jpg", "infoid": 1003191, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多年来，GNU C库(Glibc)中一直隐藏着一个已知的安全漏洞。该库对Linux和许多其他操作系统和程序至关重要，它有一个动态内存管理安全漏洞，可用于拒绝服务(DoS)攻击。现在，安全公司Check Point发布了一个开源补丁，这将使利用此内存分配(Malloc)问题变得更加困难。\nCheck Point再次遇到了这个已知问题，因为它发现所谓的智能灯泡可以通过利用无保护的单链表来侵入网络。此问题的双向链表版本早在2005年就已通过安全解除链接进行了修复。但是，存在于内存原语函数Fast-bins和Thread Cache(TCache)中的单链表版本仍然易受攻击。\n现在，这个问题的解决方案已经到位。这种新的内置安全机制称为安全链接。它通过使用从Linux的地址空间布局随机化(ASLR)功能派生的随机数对其单链接表指针签名来保护malloc。与内存块对齐完整性检查相结合，它可以保护内存指针免受劫持尝试，从而保护系统本身。\n该补丁现在正与最常用的标准C库实现glibc集成。安全链接将于2020年8月在glibc 2.32中发布。它已经在glibc广受欢迎的嵌入式产品uClibc-NG中启动并运行。\n您可能会想，既然这是一个已知问题，为什么花了这么长时间才解决。Check Point的技术负责人埃亚尔·伊特金解释说：\n虽然利用漏洞的开发人员已经意识到这个问题很多年了，但是库的开发人员并没有意识到一个问题--所以什么都没有修复。通过向开发人员提供反馈，以及修复的想法，我们成功地一劳永逸地解决了这个问题。Linux用户应该意识到这一更新，并确保他们在标准库发布后立即切换到使用最新版本的标准库。&#34；\n重要的是要注意，安全链接不是阻止所有针对现代堆实现的攻击尝试的灵丹妙药。然而，这是朝着正确方向又迈出了一步。从我们过去的经验来看，这种特定的缓解措施将阻止我们多年来展示的几个主要漏洞，从而将损坏的软件产品变成无法利用的产品。", "note_en": "For years, there&#39;s been a known security vulnerability hiding in the  GNU C Library (glibc). This library, which is critical for Linux and many other operating systems and programs, had a dynamic memory management security hole that could be used for denial of service (DoS) attacks. Now, the security company,  Check Point, has issued an  open-source patch, which will make it much more difficult to exploit this memory allocation ( malloc) problem.\n Check Point re-encountered this known problem when it discovered that so-called  smart light bulbs could be used to hack into networks by  exploiting unprotected single-linked-lists. The double-linked-list version of this problem had been fixed back in 2005 with  Safe-Unlinking. But, the single-linked-list version, which is present in the memory primitive functions Fast-Bins and Thread Cache (TCache), remained vulnerable.\n Now, the fix is in for this problem. This new built-in security mechanism is called Safe-Linking. It protects malloc by signing its single-linked-list pointers with random numbers derived from Linux&#39;s  Address Space Layout Randomization (ASLR) functionality. Combined with memory chunk alignment integrity checks, it protects the memory pointers from hijacking attempts and thus the system itself.\n The patch is now being integrated with the most common standard C library implementation, glibc. Safe-Linking will be released in glibc 2.32 in August 2020. It&#39;s already up and running in glibc&#39;s popular embedded counterpart:  uClibc-NG.\n You may wonder why it took so long for this to be fixed since it was a known problem. Check Point&#39;s technology lead, Eyal Itkin explained:\n &#34;While exploit developers have been aware of this problem for many years now, the developers of the libraries weren&#39;t aware of a problem --  so nothing got fixed. By giving developers the feedback, along with an idea for a fix, we managed to close this issue once and for all. Linux users should be aware of this update and make sure they switch to using the most updated version of their standard library, once it gets released.&#34;\n    &#34;It is important to note that Safe-Linking is not a magic bullet that will stop all exploit attempts against modern-day heap implementations. However, this is another step in the right direction. From our past experience, this specific mitigation would have blocked several major exploits that we demonstrated throughout the years, thus turning &#39;broken&#39; software products to ones that are &#39;unexploitable.&#39;&#34;", "posttime": "2020-05-22 05:27:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,内存,开源,linux,发布", "title": "Check Point发布常见Linux内存崩溃安全漏洞的开源修复程序", "title_en": "Check Point Releases Open-Source Fix For Common Linux Memory Corruption Security Hole", "transed": 1, "url": "https://www.zdnet.com/article/check-point-released-an-open-source-fix-for-common-linux-memory-corruption-security-hole/", "via": "", "real_tags": ["程序", "内存", "开源", "linux", "发布"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003189, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当你第一次学习复数时，你会发现它们给了你解决以前不可解的方程的方法。经典的例子是方程x^2+1=0，如果你只使用实数，它没有解，但是对于复数，它有解x=i和x=-i。\n作为一个喜欢想象一切事物的物理现实的人，这总是给我带来相当大的困难。方程x^2+1=0可以看作是告诉你方程y=x^2+1的抛物线在哪里与x轴相交的方程。\n只有方程y=x^2+1的抛物线不与x轴相交。如果我们的复数解是可信的，那么它与点(i，0)和(-i，0)中的x轴相交，但我肯定看不到我的图上的这些点。他们在哪里？\n大概有一大堆具有复杂坐标的点，这些点是各种东西相遇的地方，它们看起来不像相遇的地方。这些点一定在某个地方，一定是与我在真实平面上看到的图形有某种关联的某个地方。但是这个地方在哪里呢？\n嗯，大约一周前，我终于找到了复杂的点所在的地方！\n(在这一点上，我需要澄清几件事：这完全是我自己编造的。我不是从别人那里学到的，也不是从阅读别人的作品中学到的。我不会虚荣到相信以前从来没有人想到过这一点，但到目前为止，我还没有在谷歌中找到任何与我相似的搜索词。如果你以前听说过它，我很想知道！)。\n这个想法是这样的：在真实平面的每个点上，都有相当于真实平面的复杂的点连接在一起。连接到实点(a，b)的复点都是形式(a+ci，b+di)。也就是说，两个坐标的实部是(a，b)。我把它们想象成一个平面，x轴表示我们添加到x坐标的虚部，y轴表示我们添加到y坐标的虚部，实点本身在这个平面的中心。\n我将把这个连接到点(a，b)的平面称为“(a，b)处的iPlane”。在上图中，我在(3，2)处的iPlane中显示了几个点。我把它涂成了粉红色，这样你就能看出它不是普通的真飞机，正如你在上面看到的，我通常是涂成白色的。\n当我说“连接”时，我是指字面上的意思--我确实想象iPlane在物理意义上被连接到点上，就像在这里的照片中，它们处于不同程度的扩散：\n当然，真实平面中的每个点都有自己的iPlane，因此复杂平面作为一个整体看起来更像这样：\n这就是复杂的点所在。复点(3+i，5-2i)位于附着于实点(3，5)的iPlane中；复点(2i，-6+7i)位于附着于实点(0，-6)的iPlane中；复点(i，0)和(-i，0)均位于附着于实点(0，0)的iPlane中。\n如果展开适当的iPlane并将其展平，使其位于真实平面的顶部，则更容易看到它们。当然，你不会想做整个平面；你只想要一个足够大的切片，这样你就能看到你想要的点在哪里。此外，我想象iPlane是透明的，这样你就可以透过它看到真实的飞机-因此在所有物理模型的照片中都有玻璃纸。\n在下图中，位于(0，0)处的iPlane切片被展平以显示点(i，0)和(-i，0)。\n这个Geogebra小程序允许你输入一个复杂点的坐标，它会向你显示它所在的iPlane以及iPlane所在的真实位置。试一试，感受一下这里正在发生的事情。\n那么，为什么我会对这个想法如此非常兴奋呢？这一切都与当你计算出复杂的点时会发生什么有关，这些点是一些熟悉的图形的一部分。到目前为止，我已经考虑了很多关于直线和抛物线的问题。我需要一段时间才能把它全部写出来，所以我会把这些话题留到后面的博客文章中去写。\n这篇文章发表在ISN&#39；t Maths Cool？上，是关于数学思维和标记复数、平面、数学的想法。为固定链接添加书签。\n[…]。复杂的点在哪里：iPlane概念简介[…]。\n[…]。复杂的点在哪里：iPlane概念简介[…]。\n[…]。复杂的点在哪里：iPlane概念简介[…]。\n[…]。复杂的点在哪里：iPlane概念简介[…]。\n[…]。代数，我没想到会从他的帖子里分析太多。然而，当我深入研究大卫的作品“复杂之处在哪里”时，我感到很舒服。他的字写得很清楚。我可以遵循他的逻辑，和他一起思考，“[…]。\n当我看到“我有过的最伟大的数学想法”时，我想我没有祈祷去理解它。我所做的证明了你对问题和解决方案的理解，以及你如此清晰地表达出来的能力。\n这篇帖子激发了我很多想法，我试图在这里把它们浓缩成一些连贯的东西。我通过我们在K-12州使用的“数学实践标准”的镜头来看待你的“有史以来最伟大的想法”。更广泛的想法正在观察和对比数学家(比如你！)。以及学校数学经常是什么样子。\n您已经发明了一种可视化R^4的方法，即在R^2的每个点上都附加一个R^2，因此在某种意义上，R^2的切线束就是R^2的切线束。不过，您是如何将其具体化的，这是相当巧妙的！\n理解函数(实变量或复变量)的另一种方法是使用映射图。对于二次函数(具有实数或复数系数)，二次方程的根由从源复平面中的点到目标平面中的点0+0i的箭头可视化。例如，请参阅我使用Geogebra https://www.geogebra.org/m/JZYgq4Mx#material/aYeGJpS4和MD所做的工作，以可视化地解决https://www.geogebra.org/m/CX32kuXG#chapter/274869.中的线性方程和二次方程", "note_en": "When you first learn complex numbers, you find out that they give you ways to solve equations that were previously unsolvable. The classic example is the equation equation x^2 + 1 = 0, which if you’re only using real numbers has no solutions, but with complex numbers has the solutions x=i and x=-i.\n As someone who likes to imagine the physical reality of everything, this has always caused me considerable difficulties. The equation x^2 + 1 = 0 can be thought of as the equation that tells you where the parabola with equation y = x^2 + 1 meets the x-axis.\n Only the parabola with equation y = x^2 +1  doesn’t meet the x-axis. If our complex number solutions are to be believed, then it meets the x-axis in the points (i,0) and (-i,0), but I certainly can’t see those points on my graph. Where  are they?\n  Presumably there are a whole host of points with complex coordinates, which are points where various things meet that don’t look like they meet. These points must be somewhere, and they must be some place that is somehow related to the graphs I see in the real plane. But where is this place?\n Well, about a week ago, I finally found the place where the complex points are!\n (At this point I need to make a few things clear: I have made this up entirely on my own. I have not learned it from anyone else, or from reading anyone else’s work. I am not so vain as to believe that no-one has ever thought of this before, but as yet I can’t find search terms in Google that have shown me anything close. If you have heard of it before I’d love to know!)\n Here’s the idea: at every point in the real plane, there are a real-plane’s-worth of complex points attached. The complex points attached to the real point (a,b) are all of the form (a+ci,b+di). That is, the real parts of the two coordinates are (a,b). I imagine them as a plane, with x-axis showing what imaginary part we’ve added to the x-coordinate, and y-axis showing what imaginary part we’ve added to the y-coordinate.The real point itself is in the centre of this plane.\n  I’m going to call this plane attached to the point (a,b) the “iplane at (a,b)”. In the picture above, I’ve shown a few points in the iplane at (3,2). I’ve coloured it pink so you can tell it’s not the ordinary real plane, which as you saw above, I usually colour in white.\n When I say “attached” I mean it literally — I actually do imagine the iplane being attached to the point in a physical sense, like in the photos here, which are at different levels of spread-out-ness:\n  Of course, every point in the real plane has its own iplane, so the complex plane as a whole looks more like this:\n  And that’s where the complex points are. The complex point (3+i,5-2i) is in the iplane attached to the real point (3,5); the complex point (2i, -6+7i) is in the iplane attached to the real point (0,-6); and the complex points (i,0) and (-i,0) are both in the iplane attached to the real point (0,0).\n It’s easier to see them if you spread the appropriate iplane out and flatten it so it sits on top of the real plane. You don’t want to do the whole plane of course; you just want a big enough slice so that you can see where the point is that you want. Also, I imagine the iplane being transparent so you can see the real plane through it — hence the cellophane in all the photos of the physical models.\n In the below picture, a slice of the iplane at (0,0) is being flattened out to show the points (i,0) and (-i,0).\n  This GeoGebra applet allows you to enter the coordinates of a complex point and it will show you the iplane it’s in and the real point where the iplane is attached. Give it a go to get a feel for what’s happening here.\n  So why am i so very very excited by this idea? Well, it all has to do with what happens when you figure out the complex points that are part of some familiar graphs. So far, I’ve thought a lot about lines and a bit about parabolas. It will take me a while to write about it all, so I’ll save those topics for the subsequent blog posts.\n       This entry was posted in  Isn&#39;t maths cool?,  Thoughts about maths thinking and tagged  complex numbers,  iplanes,  maths. Bookmark the  permalink.\n          […] Where the complex points are: introduction to the iplane concept […]\n  […] Where the complex points are: introduction to the iplane concept […]\n  […] Where the complex points are: introduction to the iplane concept […]\n  […] Where the complex points are: introduction to the iplane concept […]\n  […] algebra, I didn’t expect to parse much from his post. However, as I dug into David’s work “Where the complex points are” I felt comfortable. His writing was clear. I could follow his logic and wonder with him, “where […]\n  When I saw “the biggest maths idea I’ve ever had” I didn’t think I had a prayer of understanding it. That I do is a testament to your understanding of the problem and solution and your ability to articulate it so clearly.\n This post inspired a lot of thoughts that I tried to condense into something coherent here. I look at your “biggest idea ever” through the lens of the Standards for Mathematical Practice we use in the states k-12. The broader ideas are looking at and contrasting what mathematicians (like you!) do and what school mathematics is often like.\n  You’ve invented a way of visualizing R^4 by attaching an R^2 to each point of R^2, so in some sense the tangent bundle of R^2. It’s pretty neat, though, how you’ve made it concrete!\n  An alternative to understanding functions (of either real or complex variable) is to use mapping diagrams. For quadratic functions (with either real or complex coefficients) the roots of the quadratic equations are visualized by arrow(s) from point(s) in the source complex plane to the point 0+0i in the target plane. See for example my work with GeoGebra  https://www.geogebra.org/m/JZYgq4Mx#material/aYeGJpS4 and MD to visualize solving linear and quadratic equations in  https://www.geogebra.org/m/CX32kuXG#chapter/274869.", "posttime": "2020-05-22 05:12:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "complex,iplane", "title": "复杂的点在哪里", "title_en": "Where the complex points are", "transed": 1, "url": "https://blogs.adelaide.edu.au/maths-learning/2016/08/05/where-the-complex-points-are/", "via": "", "real_tags": ["complex", "iplane"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003187, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "天文学家认为，他们可能已经发现了新行星诞生的第一个直接证据。\n在距地球约520光年的一颗名为AB御夫座的年轻恒星周围发现了一个由尘埃和气体组成的致密圆盘。\n利用位于智利的欧洲南方天文台的甚大望远镜(VLT)，研究人员观察到中心附近有一个“扭曲”的螺旋结构，这表明一个新的世界可能正在形成过程中。科学家们说，旋转的圆盘是御夫座恒星系统诞生的迹象之一。\n法国PSL大学巴黎天文台的安东尼·博卡莱蒂博士领导了这项研究，他说：“到目前为止，已经发现了数千颗系外行星，但对它们是如何形成的知之甚少。”\n他补充说：“我们需要观察非常年轻的系统，才能真正捕捉到行星形成的瞬间。”\n到目前为止，天文学家一直无法拍摄年轻圆盘的清晰图像来观察这些扭曲。\nBoccaletti博士和他的天文学家团队使用VLT的Sphere仪器拍摄了AB御夫座的照片，照片显示了这颗试图“踢”气体的幼行星造成的“令人震惊的螺旋状尘埃”。\n2018年，同样的仪器被用来拍摄另一颗被认为只有540万年历史的新生行星的照片。\n法国波尔多天体物理实验室(LAB)的伊曼纽尔·迪·福尔科(Emmanuel Di Folco)是这项研究的作者之一，他表示，这种所谓的踢球现象会引起“圆盘中波浪形式的扰动，有点像湖上的船的尾迹”。\n当这颗新行星围绕AB御夫座旋转时，它会使周围的气体和尘埃形成螺旋臂。螺旋线中心附近非常明亮的黄色区域是扭曲，它与恒星的距离大约与海王星与太阳的距离相同。\n实验室的安妮·杜特里(Anne Dutrey)是这项研究的合著者，她说：“行星形成的一些理论模型预计会出现这种转折。它对应于两个螺旋线的连接-一个向内缠绕在行星轨道内，另一个向外扩展-在行星位置连接。\n“它们让圆盘中的气体和尘埃附着在正在形成的行星上，并使其生长。”", "note_en": "Astronomers believe they may have found the first direct evidence of a new planet being born.\n A dense disc of dust and gas has been spotted surrounding a young star called AB Aurigae, about 520 light years away from Earth.\n Using the European Southern Observatory’s Very Large Telescope (VLT), located in Chile, the researchers observed a spiral structure with a “twist” near the centre, which suggests a new world may be in the process of forming. The swirling disc was one of the telltale signs of the star system being born in the constellation of Auriga, the scientists said.\n  Dr Anthony Boccaletti, who led the study from the Observatoire de Paris at the PSL University, in France, said: “Thousands of  exoplanets have been identified so far, but little is known about how they form.”\n He added: “We need to observe very young systems to really capture the moment when planets form.”\n Until now astronomers had been unable to take clear images of young discs to see these twists.\n Dr Boccaletti and his team of astronomers used VLT’s Sphere instrument to take photos of AB Aurigae, which show “a stunning spiral of dust” caused by the baby planet trying to “kick” the gas.\n The same instrument was used in 2018 to take photos of another infant planet, thought to be just 5.4m years old.\n According to Emmanuel Di Folco, of the Astrophysics Laboratory of Bordeaux (LAB), in France, and one of the study’s authors, this so-called kicking phenomenon causes “disturbances in the disc in the form of a wave, somewhat like the wake of a boat on a lake”.\n As the new planet rotates around AB Aurigae, it causes the surrounding gas and dust to be shaped into a spiral arm. The very bright yellow region near the centre of the spiral is the twist, which lies at about the same distance from the star as Neptune from the sun.\n Anne Dutrey of LAB, a study co-author, said: “The twist is expected from some theoretical models of planet formation. It corresponds to the connection of two spirals – one winding inwards of the planet’s orbit, the other expanding outwards – which join at the planet location.\n “They allow gas and dust from the disc to accrete on to the forming planet and make it grow.”", "posttime": "2020-05-22 04:51:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "天文学家,spot,行星", "title": "天文学家发现新行星诞生的第一个潜在证据", "title_en": "Astronomers Spot Potential First Evidence of New Planet Being Born", "transed": 1, "url": "https://www.theguardian.com/science/2020/may/20/astronomers-spot-likely-first-evidence-of-a-new-planet-being-born-ab-aurigae", "via": "", "real_tags": ["天文学家", "spot", "行星"]}, {"category": "", "categoryclass": "", "imagename": "0b18272a21f2237670bd71bd1f30bcc1.jpeg", "infoid": 1003186, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook首席执行官马克·扎克伯格(Mark Zuckerberg)周四表示，他预计在未来5到10年内，公司50%的员工可能会远程办公。\n扎克伯格表示：我们将成为规模最大的远程办公领域最具前瞻性的公司。\n他说，公司将开始允许某些员工远程全职工作。如果这些员工在2021年1月1日之前搬到其他地点，他们将不得不通知公司。扎克伯格说，因此，这些员工的薪酬可能会根据他们的新地点进行调整。\n扎克伯格说，到时候我们会根据你所在的位置调整工资，并指出这对于税收和会计是必要的。对于那些对此不诚实的人来说，将会有严重的后果。\n扎克伯格宣布，Facebook将积极增加远程员工的招聘，并将采取慎重措施，为现有员工开辟长期的远程工作岗位。\n扎克伯格在每周一次的员工直播中做出了预测，他告诉员工，这一决定应该有助于公司提高员工保留率，并将使Facebook能够从人才库中招聘人才，而这些人才库以前是不会考虑搬到大城市为公司工作的。此外，这一决定将使Facebook能够改善其员工的多样性，并将经济机会传播到更多的地方。\n扎克伯格说，当你将招聘限制在居住在少数大城市或愿意搬到那里的人时，就会排除很多生活在不同社区、不同背景或观点不同的人。\n扎克伯格说，目前，Facebook 95%的员工都在远程办公。扎克伯格说，Facebook进行的一项调查发现，50%的员工表示，他们在家工作的效率与在办公室工作的效率一样高。扎克伯格说，在Facebook员工中，40%的人表示他们对全职远程工作非常、非常或有点感兴趣，在这部分员工中，75%的人表示，如果他们可以远程工作，他们要么非常有信心，要么可能会搬到不同的城市。\n扎克伯格说，人们拥有很多这样的工作，他们不得不搬到少数几个大城市，这在某种程度上是一种不幸和不可持续的安排。\n首先，Facebook将允许现有员工在满足特定标准的情况下请求永久远程工作。扎克伯格说，这包括有经验的员工，最近表现强劲的员工，支持远程工作的团队中的员工，以及获得组长批准的员工。扎克伯格说，这将不包括最近毕业的员工。\nFacebook是最新一家宣布决定继续支持远程工作的公司。在此之前，Twitter、Square和Shopify等公司也做出了类似的决定。\n扎克伯格宣布这一消息的同时，Facebook也宣布了Workplace的新功能，Workplace是该公司的企业通信软件。该公司周四宣布，在冠状病毒大流行的推动下，Workplace的付费用户群已从10月份的300万增加到500万。\n扎克伯格宣布这一消息后，Facebook的股价连续第二天上涨，涨幅接近1%，尽管市场其余部分大多下跌。", "note_en": "Facebook CEO Mark Zuckerberg on Thursday said he predicts that 50% of the company&#39;s employees could be working remotely within the next five to 10 years.\n &#34;We&#39;re going to be the most forward-leaning company on remote work at our scale,&#34; Zuckerberg said.\n  The company will begin allowing certain employees to work remotely full time, he said. Those employees will have to notify the company if they move to a different location by Jan. 1, 2021. As a result, those employees may have their compensations adjusted based on their new locations, Zuckerberg said.\n &#34;We&#39;ll adjust salary to your location at that point,&#34; said Zuckerberg, citing that this is necessary for taxes and accounting. &#34;There&#39;ll be severe ramifications for people who are not honest about this.&#34;\n Zuckerberg announced that Facebook is going to &#34;aggressively&#34; ramp up its hiring of remote workers, and the company is going to take a &#34;measured approach&#34; to opening up permanent remote work positions for existing employees.\n Zuckerberg made his prediction on his weekly live stream with employees, telling them that this decision should help the company improve its employee retention, and it will allow Facebook to hire from talent pools that previously wouldn&#39;t consider moving to big cities to work for the company. Additionally, this decision will allow Facebook to improve the diversity of its workforce and spread economic opportunity across more places.\n &#34;When you limit hiring to people who either live in a small number of big cities or are willing to move there, that cuts out a lot of people who live in different communities, different backgrounds or may have different perspectives,&#34; Zuckerberg said.\n  Currently, 95% of Facebook&#39;s employees are working remotely, Zuckerberg said. A survey conducted by Facebook found that 50% of employees said they were as productive working from home as they were at the office, Zuckerberg said. Among Facebook employees, 40% said they were extremely, very or somewhat interested in full-time remote work, and among that subset of employees, 75% said they were either pretty confident or they might move to a different city if they could work remotely, Zuckerberg said.\n &#34;It&#39;s somewhat of an unfortunate and unsustainable setup for people to have a lot of these jobs they have to move to a small number of big cities,&#34; Zuckerberg said.\n To start, Facebook will allow existing employees to request permanent remote work if they meet specific criteria. This includes experienced employees, those with strong recent performance, employees on teams that support remote work and employees who get approval from their group leaders, Zuckerberg said. This will not include employees who are recent graduates, Zuckerberg said.\n Facebook is the latest company to announce a decision to continue supporting remote work. This follows  similar decisions by companies like  Twitter,  Square and  Shopify.\n Zuckerberg&#39;s announcement comes as Facebook announced new features for Workplace, the company&#39;s enterprise communication software. Boosted by the coronavirus pandemic, Workplace has grown its base from 3 million paid users in October to 5 million, the company  announced on Thursday.\n Following Zuckerberg&#39;s announcements, Facebook&#39;s share price was up for the second day in a row, up nearly 1%, despite the rest of the market being mostly down.", "posttime": "2020-05-22 04:42:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "面临,employees,员工", "title": "扎克伯格称搬出硅谷的员工可能面临减薪", "title_en": "Zuckerberg says employees moving out of Silicon Valley may face pay cuts", "transed": 1, "url": "https://www.cnbc.com/2020/05/21/zuckerberg-50percent-of-facebook-employees-could-be-working-remotely.html", "via": "", "real_tags": ["面临", "employees", "员工"]}, {"category": "", "categoryclass": "", "imagename": "b8f08b73c30efdc2bc0b21f521ffa700.jpeg", "infoid": 1003184, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们最近向您介绍了OWC推出的一款激动人心的新硬盘--4TB Aura P12 M.2 NVMe固态硬盘。固态硬盘之所以如此有趣，是因为它巨大的4TB容量，突破了M.2硬盘的极限。\n好了，各位，4TB的PCIe M.2固态硬盘现在是旧帽子了。你们看，Sabrent有了一个新的驱动器，容量翻了一番！是的，该公司的Rocket Q NVMe PCIe M.2 2280固态硬盘将很快推出令人惊叹的8TB-这是有史以来第一款达到这一容量的消费产品PCIe M.2固态硬盘。\n最新的8TB Rocket Q NVMe PCIe M.2 2280内置固态硬盘高性能固态硬盘(SB-RKTQ-8TB)通过PCIe Gen3 x4接口提供闪存磁盘技术的所有优势，并且完全符合标准的下一代外形规格(NGFF)，也就是通常所说的M.2。萨布伦特说，功耗比传统硬盘低得多，使其成为新系统的最佳嵌入式解决方案。\n支持SMART和TRIM命令。支持ONFI 2.3、ONFI 3.0、ONFI 3.2和ONFI 4.0接口。\n所有SABRENT固态硬盘都配有免费的SABRENT Acronis True Image for SABRENT软件，便于克隆，有关更多信息，请访问我们的网站。\nSabrent没有共享可用性、价格或性能，但它应该既昂贵又快速。例如，Rocket Q NVMe PCIe M.2 2280 SSD的4TB变种(见此处)售价750美元。如果你计算一下，很容易预计8TB的价格会远远超过1,000美元。见鬼，我预计它的价格会接近2000美元！4TB型号的读/写速度分别为3,200 MB/s和2,900 MB/s，而8 TB版本的性能应该非常相似(如果不相同)。", "note_en": "We recently told you about an exciting new drive by OWC -- the  4TB Aura P12 M.2 NVMe solid state drive. What made that SSD so interesting was its massive 4TB capacity, which was pushing the boundaries of what is possible with an M.2 drive.\n Well, folks, a 4TB PCIe M.2 SSD is now &#34;old hat.&#34; You see, Sabrent has a new drive that  doubles that capacity! Yes, the company&#39;s Rocket Q NVMe PCIe M.2 2280 SSD will soon be available in a mind-blowing 8TB -- the first ever such consumer PCIe M.2 SSD to achieve that capacity.\n    &#34;The Sabrent 8TB ROCKET Q NVMe PCIe M.2 2280 Internal SSD High-Performance Solid State Drive (SB-RKTQ-8TB) delivers all the advantages of flash disk technology with PCIe Gen3 x4 interface and it is fully compliant with the standard Next Generation Form Factor (NGFF), commonly-known as M.2. Power consumption is much lower than traditional hard drives, making it the best-embedded solution for new systems,&#34; says Sabrent.\n  Supports SMART and TRIM commands. Supports ONFi 2.3, ONFi 3.0, ONFi 3.2 and ONFi 4.0 interface.\n  All Sabrent SSDs come with FREE Sabrent Acronis True Image for Sabrent Software for easy Cloning, For more information please visit our website.\n Sabrent has not shared availability, pricing, or performance, but it should be both expensive and fast. For example, the 4TB variant of the Rocket Q NVMe PCIe M.2 2280 SSD (seen  here) sells for $750. If you do the math, it is easy to expect the 8TB model to cost well over $1,000. Hell, I expect it to carry a price tag closer to $2,000! The 4TB model has read/write speeds of 3,200 MB/s and 2,900 MB/s, and the 8TB version should have very similar performance (if not identical).", "posttime": "2020-05-22 04:20:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "火箭,固态硬盘,硬盘,揭开,unveils", "title": "Sabrent揭开破纪录的8TB火箭Q NVMe PCIe M.2 2280固态硬盘", "title_en": "Sabrent Unveils Record-Breaking 8TB Rocket Q NVMe PCIe M.2 2280 SSD", "transed": 1, "url": "https://betanews.com/2020/05/21/sabrent-8tb-rocket-q-nvme-pcie-ssd/", "via": "", "real_tags": ["火箭", "固态硬盘", "硬盘", "揭开", "unveils"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003183, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "FPGA可以被视为硬件和软件领域之间的桥梁，因为它们的硬件操作可以使用代码重新编程，从而为开发人员提供了前所未有的灵活性。在AntMicro帮助其客户制造的高级产品中，这种处理并行数据的灵活性通常需要由CPU提供的更标准的顺序处理能力来补充，CPU可以运行控制软件并与用户或其他设备进行接口。\n对异构计算的这种需求一直是Xilinx的Zynq/UltraScale+或英特尔的Cyclone/Stratix等FPGA SoC技术成功的根源，也是世界上第一款支持Linux的RISC-V FPGA SoC PolarFire SoC令人兴奋的原因。即将推出的用于PFSoC的ICICLE开发工具包现在也可以作为我们的模拟框架Renode中的平台使用，但是我们将很快在专门的笔记中讨论这一点。\n向FPGA设计提供标准CPU处理能力的另一种方法涉及构建所谓的软核-在FPGA内部合成的CPU。虽然它们提供了很高的灵活性，但它们通常不能与高性能或软件功能联系在一起，当然不能与“真正的”FPGA SoC中的支持Linux的双核或四核CPU相提并论。\n随着最近在开源ISA、HDL、软SoC框架和FPGA开发流程方面的进步，AntMicro正处于领先地位，这即将发生变化-阅读我们如何增强VexRiscv，一个开放而灵活的32位RISC-V实现，成为一个支持Linux的四核CPU，为完全在FPGA中运行的软件密集型工作负载提供更强的计算能力和多功能性。\n我们越来越多的FPGA项目涉及一种名为Litex的基于Python的软SoC生成器，它可以在FPGA中为各种应用构建高度灵活的SoC。虽然它提供了许多CPU选项(涵盖RISC-V、OpenRISC、LM32或最近才出现的POWER等架构)，但当与VexRiscv等灵活、高性能、支持Linux的FPGA优化CPU配合使用时，效率最高。\nVexRiscv最初由Charles Papon(SpinalHDL的发明者)开发和维护，SpinalHDL是一种基于Scala的高级HDL，类似于Chisel，也用于CPU本身。VexRiscv是一种高性能的32位Linux支持的基于Spinal HDL的软RISC-V内核，针对FPGA进行了优化。它的高度可配置性允许FPGA用作一种定制的硅，使其成为CPU中的瑞士军刀。\n为了进一步提高VexRiscv的能力，我们与Charles合作，为CPU添加了可扩展的多核配置，从而提供了第一个FPGA RISC-V实现，该实现提供了高性能，同时针对FPGA进行了资源优化。在FPGA设计中使用VexRiscv，再加上Litex提供的大量外围IP(如DRAM内存控制器、USB、以太网、PCIe等)，即可实现所谓的“软FPGA SoC”。根据您对I/O和处理能力的需求，以及FPGA中自定义IP和加速器所需的空间大小，这种“软FPGA SoC”可以根据需要进行上下扩展，添加内核或外围设备。\n为了展示一个实际的用例，我们创建了一个运行Linux的成熟的四核SMP系统(当然，如果需要的话，它也可以运行RTOS--我们还为Zephyr添加了对VexRiscv的支持)。为此，我们需要在核心之间实施通信和同步，包括：\n由OS(在这种情况下为Linux)中的调度器使用的处理器间中断实现的处理器间通信，以确保任务的正确调度和中断，\n总线互连，其允许所有核心访问存储器，包括无序访问以最大化CPU和存储器资源的有效性，\nCPU一致性机制，以确保来自不同内核的加载和存储指令的排序。\n我们与Litex和SpinalHDL的创建者合作，在Digilent的ARTYA7板(https://store.digilentinc.com/arty-a7-artix-7-fpga-development-board-for-makers-and-hobbyists/).上实现了一个测试设计。只占用35Klut FPGA的70%-Artix A35T-VexRiscv在大约4秒内启动Linux，并在所有内核上同时运行Dhrystone CPU基准测试，所有内核都通过了测试。机器模式异常由openSBI处理。CPU的多核能力也已经在更大的200T FPGA上进行了测试，它在电路资源中所占的比例要小得多。\n最重要的是，这种实现现在也在Renode-AntMicro的硬件模拟和硬件/软件联合开发框架中得到支持。Renode中的RISC-V支持使您可以使用Verilator将Litex SoC与自定义FPGA设计进行联合仿真，从而为RISC-V SoC原型项目提供完整的开发/调试环境。\nFPGA上的RISC-V已经达到了一个重要的里程碑，VexRiscv成为了广泛的RISC-V核心列表上的第一个具有多核能力的FPGA优化CPU，我们正在帮助维护RISC-V International。AntMicro一直在使用灵活的SoC框架提供FPGA领域的高级客户项目，并改进相关工具和实施工作流程改进，使您的FPGA开发更加便携、以软件为中心和面向未来。如果您正在从事与FPGA相关的项目，请与我们联系，以利用AntMicro在该领域的专业知识。", "note_en": "FPGAs can be seen as a bridge between the domains of hardware and software as their hardware operation can be reprogrammed using code, giving developers unprecedented flexibility. In advanced products that Antmicro helps its customers build, this flexibility to process parallel data often needs to be complemented with a more standard, sequential processing capability provided by a CPU, which can run control software and interface with the user or other devices.\n This need for heterogeneous computing has been at the root of the success of FPGA SoC technologies like Xilinx’ Zynq/UltraScale+ or Intel’s Cyclone/Stratix, and is the reason behind the excitement about  PolarFire SoC, world’s first Linux-capable RISC-V FPGA SoC. The upcoming Icicle Development kit for PFSoC is now also  available as a platform in our simulation framework, Renode, but we’ll discuss this in a dedicated note soon.\n  Another approach to providing standard CPU processing power to an FPGA design involves building a so-called softcore - a CPU synthesized inside an FPGA. While they offer high flexibility, they are not normally associated with high performance or software capability, certainly not on par with the Linux-capable dual or quad core CPUs found in ‘real’ FPGA SoCs.\n With the recent advancements in open source ISAs, HDLs, soft SoC frameworks and FPGA development flows in general that Antmicro is spearheading, that is about to change - read on how we enhanced VexRiscv, an open and flexible 32-bit RISC-V implementation to be a quad-core, Linux capable CPU to offer more computing power and versatility for software-intensive workloads running entirely in an FPGA.\n   A growing number of our FPGA projects involve a  Python-based soft SoC generator called  LiteX, which enables building highly flexible SoCs in FPGAs for a variety of applications. While it offers many CPU options (covering architectures such as RISC-V, OpenRISC, lm32 or - since recently -  POWER, it is most effective when paired with a flexible and high-performance, Linux-capable FPGA-optimized CPU like VexRiscv.\n Originally developed and maintained by Charles Papon (the inventor of SpinalHDL, a high-level Scala-based HDL akin to Chisel, also used for the CPU itself),  VexRiscv is a high-performance 32-bit Linux-capable Spinal HDL-based soft RISC-V core optimized for FPGAs. Its high configurability, which allows FPGAs to be used as a sort of custom silicon, makes it a Swiss army knife among CPUs.\n  In order to increase VexRiscv’s capabilities even further, we have collaborated with Charles to add a scalable multi-core configuration to the CPU, thus delivering the first FPGA RISC-V implementation that offers high performance and is resource optimized for FPGAs at the same time. Using VexRiscv in your FPGA design - together with the multitude of peripheral IPs such as DRAM memory controller, USB, Ethernet, PCIe etc. available in LiteX - results in what could be called a “soft FPGA SoC”. Depending on your need for I/Os and processing power, and how much space you need for custom IP and accelerators in the FPGA, this “soft FPGA SoC” can be scaled up and down adding cores or peripherals as needed.\n To showcase one practical use case, we created a full-blown quad-core SMP system running Linux (of course, it could run an RTOS as well if needed - we have also added VexRiscv support to e.g. Zephyr). To do that, we needed to implement communication and synchronization between the cores, including:\n inter-processor communication, enabled by inter-processor interrupts used by the schedulers in the OS (Linux in this case) to ensure correct scheduling and interrupting of tasks,\n    bus interconnections, which allow all the cores to access the memory, including out of order access to maximize the effectivity of the CPUs and memory resources,\n  cpu consistency mechanisms, to ensure the ordering of load and store instructions from different cores.\n  In collaboration with the creators of LiteX and SpinalHDL, we implemented a  test design on Digilent’s Arty A7 board (https://store.digilentinc.com/arty-a7-artix-7-fpga-development-board-for-makers-and-hobbyists/). Taking only 70% of a 35 KLUT FPGA - the Artix A35T - VexRiscv boots Linux in about 4 seconds, and runs the Dhrystone CPU benchmark on all cores at the same time, with all the cores passing the test. Machine mode exceptions are handled by openSBI. The CPU’s multi-core capability has also been tested on the much bigger 200T FPGA, where it occupies a much smaller chunk of the circuit’s resources.\n On top of that, this implementation is now also  supported in Renode - Antmicro’s framework for hardware simulation and HW/SW co-development. The RISC-V support in Renode gives you the possibility to co-simulate your LiteX SoC with a custom FPGA design using  Verilator, providing a full development / debug environment for RISC-V SoC prototyping projects.\n   RISC-V on FPGA has reached an important milestone with VexRiscv becoming the first multi-core capable FPGA-optimized CPU on the extensive  RISC-V cores list, which we are helping to maintain for the RISC-V International. Antmicro has been delivering advanced customer projects in the FPGA space using the flexible SoC framework as well as refining the relevant tooling and implementing workflow improvements that can make your FPGA development much more portable, software-centric and future-proof. If you are working on an FPGA-related project, reach out to us to take advantage of Antmicro’s expertise in this area.", "posttime": "2020-05-22 04:12:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,支持,quadcore,fpga", "title": "VexRiscv是用于FPGA的四核RISC-V软核，支持Linux", "title_en": "VexRiscv is a quadcore RISC-V softcore for FPGA, Linux-capable", "transed": 1, "url": "https://antmicro.com/blog/2020/05/multicore-vex-in-litex/", "via": "", "real_tags": ["linux", "支持", "quadcore", "fpga"]}, {"category": "", "categoryclass": "", "imagename": "ea5dffc2aae8c4dae083bafda5af2450.png", "infoid": 1003182, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "戴利：作为亚马逊的一名开发人员，我在第二年末就精疲力尽了。从那以后，我找到了健康和可持续的工作和生活平衡，并再次享受工作。我写这篇文章是为了提高人们的意识，特别是对新员工和他们的家人，以及B)帮助亚马逊或其他公司经历同样经历的人带来希望和建议。\n最近，关于亚马逊企业文化的轶事、观点和反驳不绝于耳。我写这篇文章不是为了利用最新的新闻馈送时尚，而是为了分享我已经写好并迅速删除的内容。我认为没有人会想听我的故事，但很明显，人们正在经历类似的经历，没有发言权。\n我是亚马逊的软件开发工程师II；SDE II基本上指的是具有至少2-3年行业经验的软件开发人员。我以SDE I的身份开始在亚马逊工作。\n在五大之一工作对于大多数开发人员来说并不少见，但这是我分享的一个梦想。在通过了一次计时的在线编程测验后，我被空运到西雅图参加面试。飞回来不到一周，我就接到了一个电话祝贺我，并讨论了通常的(薪酬和福利)，以及特殊的(搬家奖金、签约奖金和授予股票期权)。记住那些“特殊”的部分，因为它们在以后很重要。\n在最初的几个月里，情况相当正常：典型的公司座右铭(这一次称为“原则”)和“你的工作不仅仅是工作”的演讲。我现在看透了，但在当时，像“世界上最以客户为中心的公司”这样的短语对一个睁大眼睛的新员工来说是糖果。\n在队里待了几个月后，我被安排在随叫随到的轮换名单上。以下是随叫随到的含义：\n-您每X周随叫随到1周，其中X是您团队中的成员数量。\n-待命时，您的其他项目在工作日最多占用您一半的时间\n-工作日的其余时间专注于运营问题(保持灯光亮起)。\n-如果你的团队拥有的一件“东西”“进入警报”，你就会被寻呼。这是故意含糊的，因为它对不同的团队意味着不同的事情。\n-如果被寻呼，您有15分钟的时间上网并回复寻呼。\n-如果您不这样做，就会呼叫您的经理。你不会希望这种事发生的。\n随叫随到对我的团队来说不是(现在也不是)太糟糕。起初，我们平均每2周浏览1页；现在，我们大约每周阅读1页。其他球队的情况要糟糕得多。不过，它是一种社会阻尼器。如果你必须能够在一秒钟的通知下“跳出困境”，你就不能真的计划出去任何地方。\n我提到随叫随到的工作，是因为它是“特殊的”，因为唯一需要这种反应的其他职业是医生，字面上的救命稻草。当你第一次接听电话时，你会感到恐惧，并告诉你“天哪，这件事很严重。”\n在招聘过程中，除了通常的受薪一概而论之外，不会以任何方式提到随叫随到。你愿意在晚上和/或周末工作吗？\n有时，为了完成大型项目，其他团队可能需要更改代码。当然，另一个团队可能无法腾出所需的开发人员，所以您就被借出去了。在项目完成之前，你要在团队之间奔波，为两位经理服务。\n在某些情况下，另一个团队认为他们可以腾出开发时间来完成代码更改。当他们不这样做的时候，他们就会落后，所以你就会被贷款出去。\n任何人读了神话中的男人月，都会竖起耳朵。对于那些还没有读过它的人来说，这里的要点是，通过维基百科：给一个迟到的软件项目增加人力，让它变得更晚。\n我在亚马逊最糟糕的日子是我被借出去的时候；事实上，我一生中最糟糕的日子是我被借出去的时候。\n在亚马逊工作的第二年接近尾声时，我被拉进了X项目(显然是改名了)。它具备了一个前景不佳的项目的所有基础：\n我不会逐日叙述，而是直截了当地说：事情变得紧张起来。\n由于项目落后，来自上级的压力和审查越来越大。项目经理希望以尽可能多产的方式传递紧迫性，以取得适度的成功。\n长的工作日变成了周末的工作。我觉得事情的落后程度在很大程度上是我的责任。到目前为止，我不知道这有多真实。不管是什么原因，无论是需要证明我的价值，还是出于对失败的恐惧，结果都是一样的：我不停地工作。醒着的每一个小时都被投入到编写代码和修复错误上。\n起初我还是有一些自我意识的。我客观地知道，工作越多只会降低人的工作效率，但这是必须要做的。\n精疲力竭最终占据了上风。我的代码变得越来越糟。我以为我可以用几行代码就能超过我的错误计数。死亡螺旋的内环已经开始旋转。\n最终，压力改变了我的个性，让别人看得见。我很粗鲁，而我平时很外向，很善解人意。当我通常是那个开玩笑的人时，我是没有幽默感的。我的同事们开始注意到这一点，尽管我试图伪装起来。我开始选择工作而不是和朋友在一起。起初他们明白了。很抱歉，我需要工作，这是可以理解的。最终，他们也开始担心起来。再一次，为了不给他们增加负担，我又一次误入歧途，开始孤立自己=&gt；死亡螺旋的第二个环路。\n还记得我提到亚马逊的搬家和签约奖金吗？一点小小的警告，如果你在两年内离开或被解雇，你必须偿还这笔钱。\n当时我刚从大学毕业，我的积蓄比我欠下的钱要少得多。因此，如果我离开亚马逊，我不会只是失业，我将会有超过三个月的收入。\n所以现在我不能就这样离开。随之而来的是令人瘫痪的绝望。如果我失败了，被解雇了，那么我可能会在很长一段时间内找不到另一份工作。千禧一代中未充分就业是一件事。现在我有压力要把工作放在所有事情的首位=&gt；第三个循环。\n在这一点上，我的自我照顾是不存在的。为了最大化代码输出，我靠源源不断的垃圾食品和咖啡因为生。我一直有一定程度的失眠，但情况变得更糟了。最后一根稻草是当我用睡眠换取代码的时候。\n在这一点上，压力在我的脑海里变成了一个巨大的黑洞。没有其他的类比符合。它的身体感觉压垮了。没有情感，没有思想可以逃脱。我只能一遍又一遍地说这有多痛，我希望它停止。\n在这段时间里，我哭了。很多。通常是在睡觉的时候，因为我知道第二天一切都会重新开始。有时和我妻子在一起。在卫生间隔间待过几次。但是不，(你们这些受虐狂)不能在我的办公桌前。\n我的大脑只产生两种类型的想法(痛苦和请停止痛苦)，没过多久，自杀的念头就悄悄出现了。\n需要说明的是：我从未对这些想法采取任何行动。我不想自杀。我保留了尽可能多地计划的想法。但这正是自杀念头的本质：不管你真的想要什么，这种想法一次又一次地出现，最终以“请停止痛苦”取代“请停止一切。”=&&gt;“最后一圈”。\n我最终寻求精神上的帮助。我记得那个决定是如此实事求是。几乎带着你雇了个杂工修理东西的热情。&#34；嗯。漏水的管道。最好找个水管工来。考虑一下结束这件事的想法吗？我应该找个人来看看这个。\n直到现在，唯一知道事情真相的人是我的妻子。在这段时间里，我不能(但会试着)向她表达我的感激之情。她恰好在我需要她的时候出现了。即使在她不明白我为什么要让自己经历这件事的时候，她也会帮助我。她比我早得多地看到了这些迹象，并试图告诉我。当我意识到我需要帮助时，她让我与她取得联系。\n我被安排服用塞莱克斯。最终，死亡螺旋的循环解开了。项目启动了。一切都回到了基本正常的状态。几个月后我离开了塞莱克萨。直到几个月后，我才感觉完全康复。我摸到蛋壳上了。我严格地把自我照顾放在首位，在8小时内准时下班。我开始联系我的朋友，一起出去玩。\n我的经理给了我几天额外的假期作为我努力的回报。我被提拔到二级SDE，甚至还很健康，可以庆祝和享受它。\n那又怎么样？所以你把自己烧得精疲力尽，然后就精疲力尽了。你想要什么？我写这篇文章是因为我需要把我的故事写下来，作为一个警示故事。我来这里不是为了给一个真正的程序员设置一些愚蠢的标准，让他们把事情做好。我不是来妖魔化亚马逊的。\n就我要对亚马逊/杰夫·贝佐斯(Jeff Bezos)说的话而言，我只有几件事：\n-重新审视您的奖金/搬迁回报策略。我不知道什么是正确的解决方案，但如果这是你留住员工所需要的，那就完蛋了。\n-坦率和尽可能准确地说明职位所需的内容。与聪明人和热情的人一起工作是懒惰的招聘。\n-鼓励员工不仅对想法持批评态度，而且对期望持批评态度。让他们相信他们必须放弃一切才能得到你的认可，这是一种辱骂。\n-认识到生产力和快乐的员工不是零和游戏。顾客不是一个要求牺牲的愤怒的神。\n这个警示故事并不是亚马逊独有的。这可能发生在几乎任何人身上，但尤其是在紧张的工作场所工作的人，特别是在紧张的工作场所工作的开发人员。\n有一句话我在论坛和博客上看了一遍又一遍，但直到我亲身经历后才相信：\n回击不合理的期望是你的职业义务。你的老板一开始可能不喜欢，但他们会因此尊重你。\n我知道匿名发布这篇文章并不是在促进讨论。一个匿名帖子是我在跟你说话。\n然而，如果我不是真的害怕丢掉工作，我就不会以这种方式发帖。我们从现任员工那里听到的唯一其他声音都是支持亚马逊的，那就是：https://www.linkedin.com/pulse/amazonians-response-inside-amazon-wrestling-big-ideas-nick-ciubotariu，https://www.linkedin.com/pulse/my-name-brittan-im-amazonian-brittan-cole-ma。\n-他们在LinkedIn上。我讨厌在LinkedIn上发布的任何东西。所有的批评都是没有说服力的，所有的话都被淡化了。因为一切都是由未来的雇主来清理的，所以每个人都害怕真正说出任何有争议的话。\n-他们来自当地的员工，而不是经理经理和人力资源代表。\n难道没有其他人觉得有趣的是，我们没有看到现任员工提出任何负面批评吗？我不在乎你为哪家公司工作，从来不缺少愿意抱怨的人。那么，为什么现在的员工没有负面文章呢？\n我看到了一些对文章的常见回应，我想在这里先发制人：\n确切地说，工作超过40小时是专业人士的一部分。(及其变体)。\n我全心全意地同意，但这些应该是偶发事件。每周70小时以上不应该是固定模式。他们应该得到管理层的赏识。见鬼，如果你要为了一张门桌而操我们，那就请我们吃饭吧。\n你为什么不干脆少干点呢？这似乎很大程度上是你自己的错。\n我在自己的脑海里反复考虑这个问题。除了前面提到的原因，我只是觉得有必要推动它。我觉得，在受雇于这样一家大名鼎鼎的公司后，如果我不尽我所能，我就是在伤害所有帮助我走到今天这一步的人。我没有意识到的是，事实恰恰相反：通过打破自己，我确实表明了我在某种程度上还没有准备好。谢天谢地，我确实挺过了难关，因为我能从中学到东西。\n除了我的故事，我还想列举我喜欢在亚马逊工作的事情。毕竟我还在这里工作，我也没有把我的通知放进去的计划。\n“什么？！？在你刚才说了这么多之后？！？“。但说真的，当事情没有陷入危机时(80%以上的情况下)，开发人员的一天很少在上午9点之前开始。你通常大约一周可以在家工作一次。如果你有充分的理由需要提早下班，那也没问题(尽管下班后在家工作通常是一种常见的礼节)。\n这在大多数地方可能是理所当然的，但来自商务休闲场所的t恤是天赐之物。\n这件事不得不提一下。我不会给出数字，因为这可能是身份识别，但GlassDoor.com可以满足你的好奇心。当我的很大一部分朋友努力保持有报酬的工作时，这是件好事。尽管我上面描述了这些问题，但我仍然来自经济稳定的特权地位，现在有很好的工作保障。\n科技公司最常见的招聘口号之一就是与聪明人一起工作。虽然我通常对此不屑一顾，但实际上，对于开发者的成长而言，不要总是成为房间里最聪明的人是很重要的。\n杰夫·贝佐斯(Jeff Bezos)的电子邮件提到了招聘人员是如何一直联系我们的；这方面与我们的现实不谋而合。我已经收到谷歌、Facebook、Netflix和其他公司的来信。我在西雅图的第一个月收到的招聘电子邮件比我以前工作的地方一年里收到的都多。\n让你写的代码每天被成千上万的人实际执行，这是一件很棒的事情。很少有人有机会向他们的朋友和家人展示他们经常访问的网站，并说我在那里做了那件事。也许它最终会消失，但它仍然是我的最爱。\n我现在正在做一个新的贷款项目。另一个DEFCON ZEROMG！&34；项目，但现在我有了界限，我知道如果我不每周工作70小时，亚马逊就不会倒闭。工作和生活的平衡可能在很大程度上是主观的，但我现在知道这种平衡对我来说是什么样子，并在仍然尽我最大努力工作的同时强制执行这一点，我必须以艰难的方式学习这一点。我只能希望你不必这么做。\n触发警告：提到自杀念头tl；dr：我在亚马逊做开发人员的时候，在第二年末就精疲力竭了。从那以后，我找到了健康和可持续的工作和生活平衡，并再次享受工作。我写这篇文章是为了提高人们的意识，特别是对新员工和他们的家人，以及B)帮助亚马逊或其他公司经历同样经历的人带来希望和建议。=你好，世界=最近不乏关于亚马逊企业文化的轶事、观点和反驳。我写这篇文章不是为了利用最新的新闻馈送时尚，而是为了分享我已经写好并迅速删除的内容。我认为没有人会想听我的故事，但很明显，人们正在经历类似的经历，没有发言权。我是亚马逊的软件开发工程师II；SDE II基本上指的是具有至少2-3年行业经验的软件开发人员。我在亚马逊开始时是一名SDE I，在五大开发人员之一工作对大多数开发人员来说并不罕见，但这是我分享的一个梦想。在通过了一次计时的在线编程测验后，我被空运到西雅图参加面试。飞回来不到一周，我就接到了一个电话祝贺我，并讨论了通常的(薪酬和福利)，以及特殊的(搬家奖金、签约奖金和授予股票期权)。记住那些“特殊”的部分，因为它们在以后很重要。在最初的几个月里，情况相当正常：典型的公司座右铭(这一次称为“原则”)和“你的工作不仅仅是工作”的演讲。我现在看透了，但在当时，像“世界上最以客户为中心的公司”这样的短语对一个睁大眼睛的新员工来说是糖果。=首先是传呼机=在队里待了几个月后，我被安排在随叫随到的轮换名单上。随叫随到意味着：-你每X周随叫随到1周，其中X是你团队的成员数量-当随叫随到时，你的其他项目在工作日最多占用你一半的时间-工作日的其余时间专注于操作问题(保持灯光亮着)-你在随叫随到期间全天候负责寻呼机值班这就是寻呼机职责的含义：-如果你的团队拥有的一件“东西”“报警”，你会被寻呼。这是故意含糊的，因为它对不同的团队意味着不同的事情。-如果被寻呼，您有15分钟的时间上网并回复寻呼-如果不这样做，您的经理将被寻呼。你不会希望这种情况发生的，随叫随到对我的团队来说不是(现在也不是)太糟糕了。起初，我们平均每2周浏览1页；现在，我们大约每周阅读1页。其他球队的情况要糟糕得多。不过，它是一种社会阻尼器。如果你必须能够在一秒钟的通知下“跳出困境”，你就不能真的计划出去任何地方。我提到随叫随到的工作，是因为它是“特殊的”，因为唯一需要这种反应的其他职业是医生，字面上的救命稻草。当你第一次接听电话时，你会感到恐惧，并告诉你“天哪，这件事很严重。”在招聘过程中，除了通常的受薪包罗万象之外，不会以任何方式提到随叫随到。你是否愿意在晚上和/或周末工作。&#34；=然后偶尔会有借款人=为了完成一个大型项目，其他团队可能需要修改代码。当然，另一个团队可能无法腾出所需的开发人员，所以您就被借出去了。在项目完成之前，你要在团队之间奔波，为两位经理服务。在某些情况下，另一个团队认为他们可以腾出开发时间来完成代码更改。当他们不这样做的时候，他们就会落后，所以你就会被贷款出去。任何人读了神话中的男人月，都会竖起耳朵。对于那些还没有读过它的人来说，这里的要点是，通过维基百科：给一个迟到的软件项目增加人力，让它变得更晚。我在亚马逊最糟糕的日子是我被借出去的时候；事实上，我一生中最糟糕的日子是我被借出去的时候。在亚马逊工作的第二年接近尾声时，我被拉进了X项目(显然是改名了)。它具有一个前景不佳的项目的所有基础：-来自不同团队、不同国家的不断变化的要求-高风险和可见性(实际上取决于贝佐斯本人)我不会逐日描述，而是直截了当地说：事情变得激烈起来。由于项目落后，来自上级的压力和审查越来越大。项目经理希望以尽可能多产的方式传递紧迫性，以取得适度的成功。", "note_en": "tl;dr: I burned out as a developer at Amazon at the end of my second year. I’ve since found a healthy and sustainable work-life balance and enjoy work again. I write this to A) raise awareness, especially for new-hires and their families, and B) help give hope and advice to people going through the same at Amazon or other companies.\n   There’s been no shortage of anecdotes, opinions, and rebuttals regarding Amazon’s corporate culture as of late. I write this not to capitalize on the latest news-feed fad, but to share what I had already written and promptly deleted. I didn’t think anyone would want to hear my story, but it’s apparent people are going through a similar experience and don’t have a voice.\n  I’m a Software Development Engineer II at Amazon; SDE II basically means a software developer with at least 2–3 years of industry experience. I started at Amazon as an SDE I.\n  To work at one of the Big 5 is no uncommon dream for most devs, but it was one that I shared. After passing a timed online coding quiz, I was flown to Seattle for an interview. Within a week of flying back, I got a call to congratulate me as well as discuss the usual (compensation, and benefits), as well as the exceptional (moving bonus, signing bonus, and vesting stock options). Remember those “exceptional” bits, as they matter later.\n  For the first few months, things were fairly standard: typical corporate mottos (this time called “Principles”) and “your work is more than just work” speeches. I see through it now but at the time phrases like “World’s Most Customer-Centric Company” are candy to a wide-eyed new-hire.\n   After being on the team for a couple of months, I was put on the on-call rotation. Here’s what being on-call means:\n - You are on-call for 1 week every X weeks, where X is the number of members on your team\n - While on-call, your other projects take up at most half your time during the workday\n - The rest of the workday is focused on operational issues (keeping the lights on)\n    - You are paged if a “thing” your team owns goes “into alarm.” This is intentionally vague because it means different things for different teams.\n - If paged, you have 15 minutes to get online and respond to the page\n - If you don’t, your manager is paged. You do NOT want this to happen\n  On-call wasn’t (and isn’t) too terrible for my team. At first we averaged 1 page every 2 weeks; now we’re up to about 1 a week. Other teams have it much, much worse. It is a social damper though. If you have to be able to “bail out” at a second’s notice, you can’t really make plans to go out anywhere.\n  I mention on-call duty because it is “peculiar” in that the only other profession requiring this kind of responsiveness is doctors, literal lifesavers. When you go on-call for the first time, it’s terrifying and tells you “holy crap, this is serious.”\n  During the hiring process, on-call is not mentioned in any way other than the usual salaried catch-all &#34;are you willing to work nights and/or weekends.&#34;\n    Occasionally in order to complete a large project, some other team may need to make code changes. That other team, naturally, may not be able to spare the developers required, so you get loaned out. Until the project is done, you&#39;re between teams and serving two managers.\n  In some cases, that other team thought they could spare the dev-hours and complete the code changes. When they don’t, at some point they fall behind, so you get loaned out.\n  Anyone who&#39;s read &#34;The Mythical Man-Month&#34; has their ears perking up. For those who haven&#39;t read it, here&#39;s the gist, via Wikipedia: &#34;adding manpower to a late software project makes it later&#34;.\n  My worst days at Amazon have been when I was loaned out; in fact, the worst days of my life were when I was loaned out.\n  Near the end of my second year at Amazon, I was pulled into &#34;Project X&#34; (obviously renamed). It had all the underpinnings of a project with a bad future:\n    I won&#39;t give a day-by-day account, but to cut to the chase: things got intense.\n  As the project fell behind, the pressure and scrutiny from above grew. The project managers wanted to pass down the urgency in the most productive way possible, to moderate success.\n  Long weekdays turned into working over the weekend. I felt largely responsible for how behind things were. As of now, I have no idea how true that is. Whatever the cause, whether through the need to prove my worth or out of fear of failure, the result was the same: I worked non-stop. Every waking hour was put into write code and fixing bugs.\n  At first I still had some self-awareness. I knew objectively that working more only makes one less productive, but It Had To Be Done.\n  Exhaustion eventually took over. My code got worse and worse. I thought I could outrace my bug-count with lines of code. The Inner Loop of the Death Spiral had begun to spin.\n  Eventually the stress changed my personality in ways that became visible to others. I was rude, when I’m normally out-going and understanding. I was humorless when I’m usually the one who makes jokes. My co-workers starting noticing it, despite the guise I tried to put on. I started choosing work over being with my friends. At first they understood. Some amount of &#34;sorry I need to work&#34; is understandable. Eventually they started to worry too. Again, in a misguided attempt to not burden them, I began to isolate myself =&gt; The Second Loop of the Death Spiral.\n     Remember when I mentioned Amazon&#39;s moving and signing bonus? Little caveat on that, if you leave or are fired within 2 years, you have to pay it back.\n  Still fresh out of college, my savings were significantly less than how much I would&#39;ve owed. So if I were to quit Amazon, I wouldn&#39;t just be out of a job, I would be in the hole more than three months&#39; income.\n  So now I cannot &#34;just leave.&#34; With that realization came paralyzing hopelessness. If I failed and got fired, then I may not be able to find another job for quite a while. Un/Underemployment among Millennials is kind of A Thing. Now I have the stress of staying employed on top of everything =&gt; The Third Loop.\n   At this point, my self-care was non-existent. All to maximize code output, I lived off a steady stream of junk food and caffeine. I&#39;ve always had some level of insomnia, but it got much worse. The final straw was when I traded sleep for code.\n  At this point the stress became a massive black hole in my mind. No other analogy fits. It physically felt crushing. No emotions and no thoughts could escape. I could only go over and over how much it hurt and that I wanted it to stop.\n   During this time I cried. A lot. Usually when going to sleep, as I knew it would just all start again the next day. Sometimes with my wife. A couple of times in the bathroom stall. But no, (you masochists) not at my desk.\n  With my brain producing only two thought types (&#34;Pain&#34; and &#34;Please stop pain&#34;), it wasn&#39;t long before thoughts of suicide crept in.\n  To be clear: I never took any action on these thoughts. I did not want to kill myself. I kept thoughts of planning away as much as I could. But that&#39;s the thing with suicidal ideation: despite what you really want, the thought comes back again and again and finally replaces &#34;Please stop pain&#34; with &#34;Please stop Everything.&#34; =&gt; The Final Loop.\n   I finally sought psychiatric help. I remember the decision coming so matter-of-fact. Almost with the enthusiasm that you hire a handyman to fix something. &#34;Hm. A leaky pipe. Better get a plumber.&#34; &#34;Ruminating thoughts of ending it? I should have someone to look at that.&#34;\n  Up until this point, the only person who knew what was really going on was my wife. I cannot (but will try to) express my gratitude to her during this time. She was there exactly when I needed her. She helped even when she didn&#39;t understand why I was putting myself through it. She saw the signs much sooner than I did and tried to tell me. When I did realize I needed help, she put me in touch.\n  I was put on Celexa. Eventually the Death Spiral&#39;s loops unwound. The project launched. Things went back to mostly normal. I went off of Celexa after a couple of months. I didn&#39;t feel fully recovered until months later. I felt on eggshells. I rigorously prioritized self-care by leaving work at 8 hours in, on the dot. I started reaching back out to my friends for hangouts.\n  My manager gave me a couple of extra vacation days in return for my efforts. I was promoted to SDE II and was even healthy enough to celebrate and enjoy it.\n   &#34;So what? So you burned yourself out and got burned out. What did you expect?&#34; I wrote this because I needed to put my story down and as a cautionary tale. I am NOT here to set some silly bar of what a &#34;real&#34; programmer does to get things done. I am NOT here to demonize Amazon.\n  As far as what I have to say to Amazon/Jeff Bezos, I only have a few things:\n - Revisit your bonus/relocation payback strategy. I don&#39;t know what the &#34;right&#34; solution is, but if that&#39;s what you need to keep employees, that&#39;s fucked.\n - Be upfront and as precise as possible with what a position entails. &#34;Working alongside smart and passionate people&#34; is lazy hiring.\n - Encourage employees to be critical not just of ideas, but also of expectations. Getting them to buy into the idea that they have to give up everything else to get validation from you is abusive.\n - Realize that productivity and happy employees is not a zero-sum game. The customer is not a wrathful god that demands a sacrifice\n  This cautionary tale is not Amazon-specific. This could happen to nearly anyone, but especially people working in intense workplaces and especially developers working in intense workplaces.\n  There&#39;s a saying that I saw over and over again in forums and subreddits, but never believed until I lived it:\n &gt; It&#39;s your professional obligation to push back on unreasonable expectations. Your bosses may not like it at first, but they will respect you for it.\n     I know that by posting this anonymously I&#39;m not facilitating a discussion. An anon post is me talking at you.\n  However, I wouldn&#39;t be posting in this manner if I wasn&#39;t authentically afraid of losing my job. The only other voices we&#39;ve heard from current employees have been gag-worthy in favor of Amazon: https://www.linkedin.com/pulse/amazonians-response-inside-amazon-wrestling-big-ideas-nick-ciubotariu, https://www.linkedin.com/pulse/my-name-brittan-im-amazonian-brittan-cole-ma\n   - They&#39;re on LinkedIn. I abhor anything posted on LinkedIn. All criticism is toothless; all words watered down. Because everything is scoured by future employers, everyone is afraid of actually saying anything controversial.\n - They&#39;re from employees that aren&#39;t &#34;on the ground,&#34; but rather a manager-of-managers and an HR-rep respectively.\n  Does no one else find it interesting that we&#39;re not seeing any negative criticism from current employees? I don&#39;t care what company you work for, there is never any shortage of people willing to complain. So why no negative articles from current employees?\n    There are a few common responses I&#39;ve seen to articles and I would like to pre-empt those here:\n  &#34;Working more than exactly 40 hours is part of being a professional.&#34; (and variants thereof)\n I agree wholeheartedly, but these should be occasional events. 70+ hour weeks shouldn&#39;t be the holding pattern. They should be appreciated by management. Hell, buy us dinner if you&#39;re going to fuck us over a door desk.\n  &#34;Why didn&#39;t you just work less? It seems like a lot of it was your own fault.&#34;\n I go over this question again and again in my own head. Along with the reasons mentioned before, I just felt compelled to push through it. I felt that after getting hired at such a &#34;big name&#34; company, that if I didn&#39;t put everything I could into it that I was doing a disservice to all those who helped me get here. What I didn&#39;t realize was that the opposite was true: that by breaking myself, I did show that I wasn&#39;t ready in a way. Thankfully I did make it through as was able to learn from it.\n        In addition to my story, I do want to enumerate the things I enjoy about working at Amazon. I am still working here after all and I have no plans of putting in my notice.\n   “What?!? After all you just said?!?” But seriously, when things are not in crisis, which is 80%+ of the time, a developer&#39;s day rarely starts before 9am. You can usually work from home about once a week. If you need to leave work early for a good reason, that&#39;s fine (though it&#39;s usually common courtesy to work from home afterward).\n   This may be a given in most places, but coming from a business-casual-only place, t-shirts are a godsend.\n   It has to be mentioned. I won’t give out numbers, as that could be identifying, but Glassdoor.com can satisfy your curiosity. When a good portion of my friends struggle to stay gainfully employed, it is nice. Despite the issues I described  above, I still come from a privileged position of being financially stable and now have a good amount of job security.\n   One of the common hiring catch phrases of tech companies is to &#34;work alongside smart people.&#34; While I usually roll my eyes at that, it actually is important to a developer&#39;s growth to not always be the smartest one in the room.\n   Jeff Bezos&#39;s email mentioned how we get contacted by recruiters all the time; with that aspect was in touch with our reality. I&#39;ve heard from Google, Facebook, Netflix, and others. I got more recruiting emails in my first month in Seattle than I did in a year in my previous location.\n   There is something great about having code you wrote be actually executed by thousands of people every day. So few people get to show their friends and family a site they visit often and say &#34;I did that thing there.&#34; Maybe it will wear off eventually, but it&#39;s still my favorite.\n    I&#39;m on a new loaner project now. Another &#34;DEFCON ZEROMG!&#34; project, but now I have boundaries,and the knowledge that Amazon will not topple over if I don’t work 70-hour weeks. Work-life balance can be largely subjective, but I now know what that balance looks like for me and enforce that while still putting my best efforts into my work I had to learn that the hard way. I can only hope you don&#39;t have to as well.\n    Trigger warning: mention of suicidal ideation\r\rtl;dr: I burned out as a developer at Amazon at the end of my second year. I’ve since found a healthy and sustainable work-life balance and enjoy work again. I write this to A) raise awareness, especially for new-hires and their families, and B) help give hope and advice to people going through the same at Amazon or other companies.\r\r====Hello, world====\rThere’s been no shortage of anecdotes, opinions, and rebuttals regarding Amazon’s corporate culture as of late. I write this not to capitalize on the latest news-feed fad, but to share what I had already written and promptly deleted. I didn’t think anyone would want to hear my story, but it’s apparent people are going through a similar experience and don’t have a voice.\r\rI’m a Software Development Engineer II at Amazon; SDE II basically means a software developer with at least 2–3 years of industry experience. I started at Amazon as an SDE I.\r\rTo work at one of the Big 5 is no uncommon dream for most devs, but it was one that I shared. After passing a timed online coding quiz, I was flown to Seattle for an interview. Within a week of flying back, I got a call to congratulate me as well as discuss the usual (compensation, and benefits), as well as the exceptional (moving bonus, signing bonus, and vesting stock options). Remember those “exceptional” bits, as they matter later.\r\rFor the first few months, things were fairly standard: typical corporate mottos (this time called “Principles”) and “your work is more than just work” speeches. I see through it now but at the time phrases like “World’s Most Customer-Centric Company” are candy to a wide-eyed new-hire.\r\r====First Comes the Pager====\rAfter being on the team for a couple of months, I was put on the on-call rotation. Here’s what being on-call means:\r- You are on-call for 1 week every X weeks, where X is the number of members on your team\r- While on-call, your other projects take up at most half your time during the workday\r- The rest of the workday is focused on operational issues (keeping the lights on)\r- You are on 24/7 pager duty during your on-call\r\rHere’s what pager duty means:\r- You are paged if a “thing” your team owns goes “into alarm.” This is intentionally vague because it means different things for different teams.\r- If paged, you have 15 minutes to get online and respond to the page\r- If you don’t, your manager is paged. You do NOT want this to happen\r\rOn-call wasn’t (and isn’t) too terrible for my team. At first we averaged 1 page every 2 weeks; now we’re up to about 1 a week. Other teams have it much, much worse. It is a social damper though. If you have to be able to “bail out” at a second’s notice, you can’t really make plans to go out anywhere.\r\rI mention on-call duty because it is “peculiar” in that the only other profession requiring this kind of responsiveness is doctors, literal lifesavers. When you go on-call for the first time, it’s terrifying and tells you “holy crap, this is serious.”\r\rDuring the hiring process, on-call is not mentioned in any way other than the usual salaried catch-all &#34;are you willing to work nights and/or weekends.&#34; \r\r\r====Then Come Loaners====\rOccasionally in order to complete a large project, some other team may need to make code changes. That other team, naturally, may not be able to spare the developers required, so you get loaned out. Until the project is done, you&#39;re between teams and serving two managers. \r\rIn some cases, that other team thought they could spare the dev-hours and complete the code changes. When they don’t, at some point they fall behind, so you get loaned out.\r\rAnyone who&#39;s read &#34;The Mythical Man-Month&#34; has their ears perking up. For those who haven&#39;t read it, here&#39;s the gist, via Wikipedia: &#34;adding manpower to a late software project makes it later&#34;.\r\rMy worst days at Amazon have been when I was loaned out; in fact, the worst days of my life were when I was loaned out.\r\rNear the end of my second year at Amazon, I was pulled into &#34;Project X&#34; (obviously renamed). It had all the underpinnings of a project with a bad future:\r- changing requirements from different teams, in different countries\r- high stakes and visibility (practically up to Bezos himself)\r\rI won&#39;t give a day-by-day account, but to cut to the chase: things got intense.\r\rAs the project fell behind, the pressure and scrutiny from above grew. The project managers wanted to pass down the urgency in the most productive way possible, to moderate success.\r\rLong weekdays turned into working over the weekend. I felt largely responsible for how behind things were. As of now, I have no idea how true that is. Whatever the cause, whether through the need to prove my worth or out of fear of failure, the result was the same: I worked non-stop. Every waking hour was put into write code and fixing bugs.\r\rAt first I still had some self-awareness. I knew objectively that working more only makes one less productive, but It Had To Be Done.\r\rExhaustion eventually took over. My code got worse and worse. I thought I could outrace my bug-count with lines of code. The Inner Loop of the Death Spiral had begun to spin.\r\rEventually the stress changed my personality in ways that became visible to others. I was rude, when I’m normally out-going and understanding. I was humorless whe\n......", "posttime": "2020-05-22 04:06:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,亚马逊,amazon,程序员,programmer", "title": "亚马逊程序员的视角(2015)", "title_en": "An Amazon programmer’s perspective (2015)", "transed": 1, "url": "https://pastebin.com/BjD84BQ3", "via": "", "real_tags": ["程序", "亚马逊", "amazon", "程序员"]}, {"category": "", "categoryclass": "", "imagename": "ba227965f006f24454e8208f75972ea1.jpg", "infoid": 1003181, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Axios获得的“大西洋月刊”董事长大卫·布拉德利(David Bradley)的一份内部报告显示，“大西洋月刊”正在裁员近20%。\n重要原因：它是最新一家被迫采取严厉措施以求在冠状病毒大流行带来的经济影响中生存下来的媒体公司。\n现状：裁员68人主要归因于该公司活动业务的崩溃，该业务多年来一直是该公司最强大的支柱之一。\n离开公司的人没有过错。让这件事变得特别困难的是，他们是杰出的、受人爱戴的大西洋公司同事。他们与一开始被选中加入我们的好人一模一样。从衡量标准来看，他们和那些留下来的人一样，为大西洋和平做出了贡献。只是情况发生了变化，布拉德利在给员工的便条中写道。\n他补充说，我原本以为我会用这份备忘录的很大一部分内容来解释我们这一决定背后的理由。但是，我认为这可能不言而喻。但具体的时机是明确的--一场全球大流行，它总体上关闭了经济，大幅投放广告，以及完全面对面的活动，他补充道。\n言外之意：“大西洋月刊”从劳伦·鲍威尔·乔布斯(Laurene Powell Jobs)拥有的Impact投资工具艾默生集团(Emerson Collective)手中获得了新的多数股权，这使得该公司近年来加快了增长，包括从2018年开始的大规模员工增加和扩张。\n大局：大流行正在迫使数十家大型媒体公司进行裁员和减薪，包括较新的数字本土媒体公司和较老的杂志公司。\n大西洋月刊加入了好莱坞报道、财富、公告牌、经济学人集团、第九媒体集团、BuzzFeed新闻、Vox媒体、Bustle Digital Group、Cheddar、Maven Media、G/O Media、Protocol等采取裁员和休假措施的行列。", "note_en": "The Atlantic is laying off nearly 20% of staff, according to an internal note from David Bradley, the publication&#39;s chairman, that was obtained by Axios.\n Why it matters: It&#39;s the latest media company that&#39;s been been forced to take drastic measures to survive the economic fallout from the coronavirus pandemic.\n The state of play: The 68 staff cuts are mostly attributable to the collapse of the company&#39;s events business, which was one of its strongest pillars for many years.\n &#34;There is no fault on the part of people leaving the firm.  What makes this so particularly difficult is that these are exceptional and beloved Atlantic colleagues.  They are exactly the same good people who were selected to join us at the outset.  Measure for measure, they have contributed to The Atlantic as have those who are remaining. It is only that the ground has shifted,&#34; Bradley wrote in his note to staff.\n &#34;I had thought that I would spend some substantial part of this memo explaining the reasoning behind our decision. But, I think it may speak for itself. The particular timing is clear — a global pandemic that has shuttered the economy generally, advertising acutely, and in-person events altogether,&#34; he added.\n Between the lines: The Atlantic&#39;s new majority ownership stake from Emerson Collective, the impact investment vehicle owned by Laurene Powell Jobs, has allowed the company to accelerate its growth in recent years, including  a major staff increase and expansion that began in 2018.\n The big picture: The pandemic is forcing dozens of  major media companies, including newer, digitally-native media companies and older magazine companies, to carry out layoffs and pay cuts.\n The Atlantic joins The Hollywood Reporter, Fortune, Billboard, The Economist Group, Group Nine Media, BuzzFeed News, Vox Media, Bustle Digital Group, Cheddar, Maven Media, G/O Media, Protocol and others who have resorted to layoffs and furloughs.", "posttime": "2020-05-22 04:05:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "月刊,atlantic", "title": "“大西洋月刊”裁员近20%。", "title_en": "The Atlantic lays off almost 20% of staff", "transed": 1, "url": "https://www.axios.com/the-atlantic-layoffs-coronavirus-49cc6ad2-6579-45cd-b816-e20865f7351e.html", "via": "", "real_tags": ["月刊", "atlantic"]}, {"category": "", "categoryclass": "", "imagename": "18e34d7102632db8aeb1fc253372b6b8.jpg", "infoid": 1003180, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "荷兰一家法院裁定，一名妇女在未经孙子孙女父母许可的情况下，必须删除她在Facebook和Pinterest上发布的孙子孙女的照片。\n法官裁定此事在欧盟“一般数据保护条例”(GDPR)的范围内。\n一位专家表示，这项裁决反映了欧洲法院多年来一直以来的立场。\n在这名女子拒绝删除她在社交媒体上发布的孙子孙女的照片后，该案进入了法庭。\n孩子们的母亲几次要求删除这些照片。\n然而，裁决称，这一豁免不适用，因为在社交媒体上发布照片可以让更多的观众获得这些照片。\n该公司表示，在Facebook上，不能排除放置的照片可能会被传播，最终可能落入第三方手中。\n这名女子必须删除照片，否则就必须为她不遵守命令的每一天支付50欧元(45 GB)的罚款，最高罚款为1000欧元。\n如果她将来发布更多孩子的照片，她每天将被额外罚款50欧元。\nDecoded Legal律师事务所的技术律师尼尔·布朗(Neil Brown)表示：我认为这项裁决会让很多人大吃一惊，他们在发推特或上传照片之前可能不会想太多。\n不管法律地位如何，上传这些照片的人认为，他或她不想让它们再出现在网上，这合理吗？\n事实上，合理的做法--人类应该做的事情--就是去把它们拿下。", "note_en": "A woman must delete photographs of her grandchildren that she posted on Facebook and Pinterest without their parents&#39; permission, a court in the Netherlands has ruled.\n  The judge ruled the matter was within the scope of the EU&#39;s General Data Protection Regulation (GDPR).\n One expert said the ruling reflected the &#34;position that the European Court has taken over many years&#34;.\n The case went to court after the woman refused to delete photographs of her grandchildren which she had posted on social media.\n  The mother of the children had asked several times for the pictures to be deleted.\n  However, that exemption did not apply because posting photographs on social media made them available to a wider audience, the ruling said.\n &#34;With Facebook, it cannot be ruled out that placed photos may be distributed and may end up in the hands of third parties,&#34; it said.\n The woman must remove the photos or pay a fine of €50 (£45) for every day that she fails to comply with the order, up to a maximum fine of €1,000.\n  If she posts more images of the children in the future, she will be fined an extra €50 a day.\n &#34;I think the ruling will surprise a lot of people who probably don&#39;t think too much before they tweet or post photos,&#34; said Neil Brown, a technology lawyer at Decoded Legal.\n &#34;Irrespective of the legal position, would it be reasonable for the people who&#39;ve posted those photos to think, &#39;Well, he or she doesn&#39;t want them out there anymore&#39;?&#34;\n &#34;Actually, the reasonable thing - the human thing to do - is to go and take them down.&#34;", "posttime": "2020-05-22 03:37:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,勒令,ordered,照片", "title": "祖母被勒令删除GDPR下的Facebook照片", "title_en": "Grandmother ordered to delete Facebook photos under GDPR", "transed": 1, "url": "https://www.bbc.com/news/technology-52758787", "via": "", "real_tags": ["facebook", "勒令", "ordered", "照片"]}, {"category": "", "categoryclass": "", "imagename": "951fd94b32e92733a913d8f310d34b75.jpg", "infoid": 1003179, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "还有比杂货店货架空空如也的想法引发的恐慌更原始的吗？还有什么比安慰食品提供的解脱更原始的解脱吗？\n这些天来，几乎每个人都在做更多的烹饪，更多地记录烹饪，更多地思考总体上的食物。肉类短缺，加上特朗普总统不顾濒危工人的抗议，决定下令屠宰场开放，这两个因素共同促使许多美国人思考肉类到底有多重要。\n它比劳动生产它的穷人的生命更重要吗？看起来是这样。令人震惊的是，白宫自己认定为冠状病毒热点的10个县中有6个是总统下令开放的屠宰场的所在地。\n在南达科他州的苏福尔斯，史密斯菲尔德猪肉厂生产的猪肉约占全国猪肉产量的5%，是全国最大的热点之一。爱荷华州佩里的泰森工厂有730例冠状病毒病例-几乎占其员工总数的60%。在爱荷华州滑铁卢的另一家泰森工厂，大约2800名工人中有1031例报告病例。\n生病的工人意味着工厂关闭，导致动物积压。一些农民正在给怀孕的母猪注射疫苗，以导致流产。其他人则被迫对他们的动物实施安乐死，通常是通过毒气或枪杀它们。爱荷华州共和党参议员查克·格拉斯利(Chuck Grassley)要求特朗普政府向养猪农民提供心理健康资源，这已经够糟糕的了。\n尽管存在这一可怕的现实，而且早在这场流行病来袭之前，工厂化养殖业就对美国的土地、社区、动物和人类健康产生了广泛的影响，但只有大约一半的美国人表示，他们正在努力减少肉类消费。从感恩节火鸡到棒球场热狗，肉类以太重要的方式植根于我们的文化和个人历史中。肉有独特的美妙的气味和味道，令人满意，几乎可以感觉到家的感觉。如果不是家的感觉，又有什么是必不可少的呢？\n畜牧业现在被认为是全球变暖的主要原因。据“经济学人”报道，25岁到34岁的美国人中，有四分之一的人表示自己是素食主义者或纯素食主义者，这可能是植物性“肉类”销量飙升的原因之一，从全食超市(Whole Foods)到白色城堡(White Castle)，到处都能买到“不可能”(Impact)和“超越汉堡”(Beyond Burgers)。\n在过去的几年里，我们的手一直在伸手去摸门把手。冠状病毒已经把门踢开了。\n至少它迫使我们去寻找。当谈到像肉这样不方便的话题时，人们很容易假装明确的科学是倡导者，从永远无法衡量的例外中寻找安慰，把我们的世界说得好像是理论上的一样。\n我认识的一些最有思想的人想办法不去想畜牧业的问题，就像我想办法避免思考气候变化和收入不平等一样，更不用说我自己饮食生活中的悖论了。这几个月的庇护带来的一个意想不到的副作用是，很难不去思考对我们来说至关重要的事情。\n我们不能在继续经常吃肉的同时保护我们的环境。这不是一个可以反驳的观点，而是一个陈词滥调。无论是成为花花公子还是精品草食牛排，奶牛都会产生大量的温室气体。如果奶牛是一个国家，它们将是世界第三大温室气体排放国。\n根据致力于建模应对气候变化解决方案的非营利性组织Drawdown项目的研究主管的说法，食用植物性饮食是“每个人都能为扭转全球变暖做出的最重要贡献”。\n美国人压倒性地接受气候变化科学。大多数共和党人和民主党人都表示，美国应该留在巴黎气候协议中。我们不需要新的信息，也不需要新的价值观。我们只需要走进那扇开着的门。\n我们不能一边继续定期吃肉，一边声称关心人道对待动物。我们赖以生存的耕作制度充满了苦难。现代的鸡已经被如此转基因，即使我们打开它们的笼子，它们的身体也成了痛苦的监狱。火鸡被培育得非常肥胖，如果不进行人工授精，它们就无法繁殖。母牛在断奶前会被撕下小腿，导致严重的痛苦，我们可以从它们的哭声中听到，并根据经验通过它们体内的皮质醇进行测量。\n任何标签或认证都无法避免这种残忍行为。我们不需要任何动物权利活动家向我们挥舞手指。我们不需要相信任何我们还不知道的事情。我们需要倾听我们自己的声音。\n我们不能在继续经常吃肉的同时预防大流行。湿货市场备受关注，但工厂化养殖场，特别是家禽养殖场，是更重要的流行病滋生地。此外，CDC报告说，四分之三的新的或新出现的传染病是人畜共患病--这是我们与动物关系破裂的结果。\n不用说，我们想要安全。我们知道如何让自己更安全。但是光想要和知道是不够的。\n这些不是我或任何人的观点，尽管人们倾向于在评论部分发布这些信息。对于任何对畜牧业提出的严肃质疑，最常见的回答都不是观点。\n没有它，我们可以活得更长、更健康。大多数美国成年人摄入的蛋白质大约是推荐摄入量的两倍-包括素食者，他们摄入的蛋白质比他们需要的多70%。食用动物蛋白含量高的饮食的人更有可能死于心脏病、糖尿病和肾衰竭。当然，肉和蛋糕一样，也可以成为健康饮食的一部分。但是，没有一位健全的营养学家会建议你吃蛋糕吃得太多。\n那些在剥削他们的同时以他们的名义说话的公司将会这样做。尽管美国人口几乎是南北战争时期的11倍，但今天的美国农民比南北战争时期要少。这不是偶然，而是一种商业模式。畜牧产业综合体的终极梦想是实现“农场”的全自动化。向植物性食品和可持续农业实践过渡将创造比结束时更多的就业机会。\n不要轻信我的话。问一位农民，他或她是否乐于看到工厂化耕作的终结。\n2015年的一项研究发现，素食饮食每年比肉食饮食便宜750美元。有色人种不成比例地自我认同为素食者，也有不成比例地成为工厂化农业暴行的受害者。为了满足我们对肉的品味，屠宰场的员工目前正处于危险之中，他们绝大多数是棕色和黑色的。认为一种更便宜、更健康、更少剥削的耕作方式是精英的说法，实际上是一种行业宣传。\n嗯，除非你相信那些通过剥削而变得强大的人会自愿摧毁那些给他们带来巨大财富的车辆。工厂化农业之于实际农业，就像犯罪垄断之于企业家一样。如果政府在一年内取消了380亿美元的支持和救助，并要求肉类和乳制品公司按照正常的资本主义规则行事，那么它将永远摧毁它们。该行业无法在自由市场中生存。\n也许比起其他任何食物，肉既能带来舒适，也能让人感到不适。这可能会使我们很难按照我们知道的和想要的采取行动。我们真的能把肉从盘子中央移开吗？这是一个把我们带到不可能的门槛的问题。另一方面是不可避免的。\n随着大流行压力从背后蔓延的恐怖，以及对什么是必要的新质疑，我们现在可以看到那扇一直在那里的门。就像在梦里，我们的家有我们醒着的自己不知道的房间，我们可以感觉到有一种更好的饮食方式，一种更接近我们价值观的生活。另一边不是什么新东西，而是一些来自过去的东西-在这个世界里，农民不是神话，被折磨的身体不是食物，地球也不是晚餐结束时的账单。\n一顿饭在另一顿饭之前，是时候跨过门槛了。另一边是家。\n乔纳森·萨夫兰·福尔(Jonathan Safran Foer)是“吃动物”和“我们是天气”(We Are The Weather)的作者。\n“泰晤士报”致力于向编辑发表各种信件。我们想听听您对这篇文章或我们的任何一篇文章的看法。这里有一些小贴士。这是我们的电子邮件：Letters@nytimes.com。", "note_en": "Is any panic more primitive than the one prompted by the thought of empty grocery store shelves? Is any relief more primitive than the one provided by comfort food?\n Most everyone has been doing more cooking these days, more documenting of the cooking, and more thinking about food in general. The combination of meat shortages and President Trump’s  decision to order slaughterhouses open despite the protestations of endangered workers has inspired many Americans to consider just how essential meat is.\n Is it more essential than the lives of the working poor who labor to produce it? It seems so. An astonishing six out of 10 counties that the White House itself  identified as coronavirus hot spots are home to the very slaughterhouses the president ordered open.\n In Sioux Falls, S.D., the  Smithfield pork plant, which produces some 5 percent of the country’s pork, is one of the largest hot spots in the nation. A Tyson plant in Perry, Iowa, had  730 cases of the coronavirus — nearly 60 percent of its employees. At another Tyson plant, in Waterloo, Iowa, there were  1,031 reported cases among about 2,800 workers.\n Sick workers mean plant shutdowns, which has led to a backlog of animals. Some farmers are injecting pregnant sows  to cause abortions. Others are forced to  euthanize their animals, often by gassing or shooting them. It’s gotten bad enough that Senator Chuck Grassley, an Iowa Republican, has asked the Trump administration to provide mental health resources to hog farmers.\n Despite this grisly reality — and the widely reported effects of the  factory-farm industry on America’s lands, communities, animals and human health long before this pandemic hit — only  around half of Americans say they are trying to reduce their meat consumption. Meat is embedded in our culture and personal histories in ways that matter too much, from the Thanksgiving turkey to the ballpark hot dog. Meat comes with uniquely wonderful smells and tastes, with satisfactions that can  almost feel like home itself. And what, if not the feeling of home, is essential?\n Animal agriculture is now recognized as a leading cause of global warming.  According to The Economist, a quarter of Americans between the ages of 25 and 34 say they are vegetarians or vegans, which is perhaps one reason sales of plant-based “meats”  have skyrocketed, with Impossible and Beyond Burgers available everywhere from Whole Foods to White Castle.\n  Our hand has been reaching for the doorknob for the last few years. Covid-19 has kicked open the door.\n At the very least it has forced us to look. When it comes to a subject as inconvenient as meat, it is tempting to pretend unambiguous science is advocacy, to find solace in exceptions that could never be scaled and to speak about our world as if it were theoretical.\n Some of the most thoughtful people I know find ways not to give the problems of animal agriculture any thought, just as I find ways to avoid thinking about climate change and income inequality, not to mention the paradoxes in my own eating life. One of the unexpected side effects of these months of sheltering in place is that it’s hard not to think about the things that are essential to who we are.\n We cannot protect our environment while continuing to eat meat regularly. This is  not a refutable perspective, but a banal truism. Whether they become Whoppers or boutique grass-fed steaks, cows produce an enormous amount of greenhouse gas. If cows were a country, they would be the  third-largest greenhouse gas emitter in the world.\n According to the research director of  Project Drawdown — a nonprofit organization dedicated to modeling solutions to address climate change — eating a plant-based diet is “the most important contribution every individual can make to reversing global warming.”\n Americans overwhelmingly accept the science of climate change. A  majority of both Republicans and Democrats say that the United States should have remained in the Paris climate accord. We don’t need new information, and we don’t need new values. We only need to walk through the open door.\n  We cannot claim to care about the  humane treatment of animals while continuing to eat meat regularly. The farming system we rely on is woven through with misery. Modern chickens have been so  genetically modified that their very bodies have become prisons of pain even if we open their cages. Turkeys are bred to be so obese that they are incapable of reproducing without artificial insemination. Mother cows have their  calves ripped from them before weaning, resulting in acute distress we can hear in their wails and empirically measure through the cortisol in their bodies.\n No label or certification can avoid these kinds of cruelty. We don’t need any animal rights activist waving a finger at us. We don’t need to be convinced of anything we don’t already know. We need to listen to ourselves.\n We cannot protect against pandemics while continuing to eat meat regularly. Much attention has been paid to wet markets, but factory farms, specifically poultry farms, are a more important breeding ground for pandemics. Further, the  C.D.C. reports that three out of four new or emerging infectious diseases are zoonotic — the result of our broken relationship with animals.\n  It goes without saying that we want to be safe. We know how to make ourselves safer. But wanting and knowing are not enough.\n  These are not my or anyone’s opinions, despite a tendency to publish this information in opinion sections. And the answers to the most common responses raised by any serious questioning of animal agriculture aren’t opinions.\n We can live  longer, healthier lives without it. Most American adults  eat roughly twice the recommended intake of protein — including vegetarians, who consume 70 percent more than they need. People who eat diets high in animal protein are more likely to die of heart disease, diabetes and kidney failure. Of course, meat, like cake, can be part of a healthy diet. But no sound nutritionist would recommend eating cake too often.\n The corporations that speak in their name while exploiting them will. There are  fewer American farmers today than there were during the Civil War, despite America’s population being nearly 11 times greater. This is not an accident, but a business model. The ultimate dream of the animal-agriculture industrial complex is for “farms” to be fully automated. Transitioning toward plant-based foods and sustainable farming practices would create many more jobs than it would end.\n Don’t take my word for it. Ask a farmer if he or she would be happy to see the end of factory farming.\n A 2015 study  found that a vegetarian diet is $750 a year cheaper than a meat-based diet. People of color disproportionately  self-identify as vegetarian and disproportionately are victims of factory farming’s brutality. The slaughterhouse employees currently being put at risk to satisfy our taste for meat are overwhelmingly brown and black. Suggesting that a cheaper, healthier, less exploitative way of farming is elitist is in fact a piece of industry propaganda.\n Well, unless you believe that those made powerful through exploitation will voluntarily destroy the vehicles that have granted them spectacular wealth. Factory farming is to actual farming what criminal monopolies are to entrepreneurship. If for a single year the government removed its $38-billion-plus in props and bailouts, and required meat and dairy corporations to play by normal capitalist rules, it would destroy them forever. The industry could not survive in the free market.\n Perhaps more than any other food, meat inspires both comfort and discomfort. That can make it difficult to act on what we know and want. Can we really displace meat from the center of our plates? This is the question that brings us to the threshold of the impossible. On the other side is the inevitable.\n With the horror of pandemic pressing from behind, and the new questioning of what is essential, we can now see the door that was always there. As in a dream where our homes have rooms unknown to our waking selves, we can sense there is a better way of eating, a life closer to our values. On the other side is not something new, but something that calls from the past — a world in which farmers were not myths, tortured bodies were not food and the planet was not the bill at the end of the meal.\n One meal in front of the other, it’s time to cross the threshold. On the other side is home.\n Jonathan Safran Foer is the author of “Eating Animals” and “We Are the Weather.”\n The Times is committed to publishing   a diversity of letters  to the editor. We’d like to hear what you think about this or any of our articles. Here are some   tips . And here’s our email:   letters@nytimes.com .", "posttime": "2020-05-22 03:36:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,coronavirus,病毒,无肉,world", "title": "冠状病毒与无肉世界", "title_en": "The Coronavirus and a World Without Meat", "transed": 1, "url": "https://www.nytimes.com/2020/05/21/opinion/coronavirus-meat-vegetarianism.html", "via": "", "real_tags": ["冠状病毒", "病毒", "无肉", "world"]}, {"category": "", "categoryclass": "", "imagename": "b7358ff42f668ee565d684f4c7778a6b.jpg", "infoid": 1003177, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转搜索假设的生物化学类型是推测在科学上可行的生物化学形式，但目前还没有被证明存在。[2]目前地球上已知的各种生物体都使用碳化合物来实现基本的结构和代谢功能，使用水作为溶剂，使用DNA或RNA来定义和控制它们的形式。如果在其他行星或卫星上存在生命，那么它们在化学上可能是相似的；也有可能存在具有完全不同化学成分的有机体[3]--例如，涉及其他种类的碳化合物、另一种元素的化合物或另一种代替水的溶剂。\n生命形式建立在另一种生物化学基础上的可能性是一个正在进行的科学讨论的主题，这一讨论的依据是关于外星环境以及各种元素和化合物的化学行为的已知情况。它对合成生物学很感兴趣，也是科幻小说中常见的主题。\n元素硅作为碳的假想替代品已经讨论了很多。在元素周期表中，硅与碳属于同一族，并且和碳一样，它也是四价的。假设水的替代品包括氨，它和水一样，是一种极性分子，在宇宙中含量丰富；以及非极性碳氢化合物溶剂，如甲烷和乙烷，已知以液体形式存在于泰坦表面。\n也许最不寻常的替代生物化学将是具有不同的生物分子手性的生物化学。在已知的地球生命中，氨基酸几乎都是L型的，而糖是D型的。使用D氨基酸或L糖的分子可能是可能的；然而，这样的手性分子与使用相反手性分子的生物体是不相容的。\n液氨作为生命的替代溶剂的可能作用至少可以追溯到1954年，当时J·B·B·S·霍尔丹在一次关于生命起源的研讨会上提出了这个话题。\n砷在化学上与磷相似，但对地球上大多数生命形式来说都是有毒的，它被结合到一些生物体的生物化学中。\n硼烷在地球大气层中具有危险的爆炸性，但在减少的环境中会更稳定。然而，与邻近的碳、氮和氧相比，宇宙中硼的丰度是极其罕见的。\n2007年，Vadim N.Tsytovich和他的同事提出，在可能存在于太空的条件下，悬浮在等离子体中的尘埃颗粒可以表现出逼真的行为。\n在我们所知的仅与生命周期性一致的环境中维持生命在生物化学上是可能的。\n各种金属和氧可以形成非常复杂的热稳定性结构，可以与有机化合物相媲美；[需要引用的]杂多酸就是这样一个家族。\n彼得·斯尼思等科学家认为它可能是生命的溶剂。\n硫化氢是最接近水的化学类似物，但极性较低，是一种较弱的无机溶剂。\n甲烷(CH4)是一种简单的碳氢化合物：即宇宙中最常见的两种元素：氢和碳的化合物。假设甲烷生命是可能的。\n物理学家指出，尽管地球上的光合作用通常涉及绿色植物，但各种其他颜色的植物也可以支持光合作用，而光合作用对地球上的大多数生命来说都是必不可少的，而且在接受与地球不同的恒星辐射混合的地方，其他颜色可能是首选的。\n影子生物圈是一种假想的地球微生物生物圈，它使用与目前已知生命完全不同的生化和分子过程。\n像碳一样，硅可以产生足够大的分子来携带生物信息；然而，可能的硅化学的范围比碳的范围要有限得多。\n杰拉尔德·范伯格(Gerald Feinberg)和罗伯特·夏皮罗(Robert Shapiro)提出，熔融的硅酸盐岩石可以作为有机体的液体介质，其化学基础是硅、氧和其他元素，如铝。\n硫作为碳的替代品在生物上的使用纯粹是假设的，特别是因为硫通常只形成线性链，而不是支链。\n影子生物圈是一种假想的地球微生物生物圈，它使用与目前已知生命完全不同的生化和分子过程。[4][5]虽然地球上的生命研究相对较好，但阴影生物圈可能仍然没有引起注意，因为对微生物世界的探索主要针对大型有机体的生物化学。\n也许最不寻常的替代生物化学将是具有不同的生物分子手性的生物化学。在已知的地球生命中，氨基酸几乎都是L型的，而糖是D型的。使用D氨基酸或L糖的分子可能是可能的；然而，这样的手性分子与使用相反手性分子的生物体是不相容的。在地球上发现了手性与正常相反的氨基酸，这些物质通常被认为是手性正常的有机体腐烂的结果。然而，物理学家保罗·戴维斯(Paul Davies)推测，其中一些可能是反手性生命的产物。[6]。\n然而，这样的生物化学是否真的是外星人，这是值得怀疑的。虽然它肯定会是一种替代立体化学，但在绝大多数生物体的一种对映体中压倒性地发现的分子仍然经常可以在不同(通常是基础的)生物中的另一种对映体中找到，例如在古生代成员和其他领域之间的比较中，[需要引用]使得替代立体化学是否真的新颖成为一个开放的话题。\n在地球上，所有已知的生物都有一个以碳为基础的结构和系统。科学家们已经推测了使用碳以外的原子来形成生命所需的分子结构的利弊，但还没有人提出使用这种原子来形成所有必要结构的理论。然而，正如卡尔·萨根(Carl Sagan)所说，很难确定一个适用于地球上所有生命的声明是否会最终适用于整个宇宙的所有生命。[7]萨根使用“碳沙文主义”一词来解释这一假设。[8]他认为硅和锗是碳的可能替代品；[8](其他看似合理的元素包括但不限于钯和钛)，但另一方面，他注意到碳似乎在化学上更多才多艺，在宇宙中也更丰富。[9]。\n硅原子作为另一种生物化学体系的基础已经讨论了很多，因为硅有许多类似于碳的化学性质，并且在元素周期表中属于相同的基团，即碳基。像碳一样，硅可以产生足够大的分子来携带生物信息。[10]。\n然而，硅作为碳的替代品有几个缺点。与碳不同，硅缺乏与不同类型的原子形成化学键的能力，这是新陈代谢所需的化学多样性所必需的，但这种精确的无能为力使得硅不太容易与各种杂质结合，相比之下，碳没有受到这些杂质的保护。与碳形成有机官能团的元素包括氢、氧、氮、磷、硫以及铁、镁和锌等金属。另一方面，硅与极少数其他类型的原子相互作用。[10]此外，在与其他原子相互作用的地方，硅创造的分子与有机大分子的组合宇宙相比被描述为单调。[10]这是因为硅原子大得多，具有更大的质量和原子半径，因此很难形成双键(双键碳是羰基的一部分，这是碳基生物有机化学的基本主题)。\n硅烷是氢和硅的化合物，类似于烷烃，与水具有高度的反应性，长链硅烷会自发分解。包含交替的硅和氧原子的聚合物而不是硅之间的直接键(统称为硅)的分子要稳定得多。有人提出，硅基化学品在富含硫酸的环境中会比同等的碳氢化合物更稳定，就像在一些外星人的地方发现的那样。[11]。\n到1998年为止，在星际介质中发现的各种分子中，有84种是基于碳的，只有8种是基于硅的。[12]此外，在这8种化合物中，有4种还含有碳。宇宙中碳与硅的丰度约为10比1。这可能表明宇宙中复杂的碳化合物种类更多，至少在行星表面普遍存在的条件下，为建立基于硅的生物提供的基础较少。此外，尽管地球和其他类地行星异常富含硅和贫碳(地球地壳中硅与碳的相对丰度约为925：1)，但地球生命是以碳为基础的。碳被用来代替硅的事实可能是硅不太适合类地行星上的生物化学的证据。其原因可能是硅在形成化合物方面不如碳多才多艺，硅形成的化合物不稳定，而且它阻挡了热量的流动。[13]。\n即便如此，一些地球生命也在使用生物硅，比如硅藻的硅酸盐骨架结构。根据A.G.凯恩斯-史密斯的粘土假说，水中的硅酸盐矿物在非生物发生中起着至关重要的作用：它们复制了自己的晶体结构，与碳化合物相互作用，是碳基生命的先驱。[14][15]。\n虽然在自然界中没有观察到碳-硅键，但已经通过定向进化(人工选择)将碳-硅键添加到生物化学中。利用定向进化的方法设计了一种含细胞色素c蛋白的血红素，用来催化氢硅烷和重氮化合物之间新的碳硅键的形成。[16]。\n在与陆地行星表面不同的温度或压力下，硅化合物可能在生物上是有用的，要么与碳结合，要么起到与碳不太直接相似的作用。聚硅醇是一种与糖相对应的硅化合物，可溶于液氮，这表明它们在超低温生物化学中可能起到一定的作用。[17][18]。\n在电影和文学科幻小说中，当人造的机器从无生命到有生命的时候，人们经常会提出这样的假设：[是谁？]。这种新的形式将是非碳基生命的第一个例子。自从20世纪60年代末微处理器问世以来，这些机器通常被归类为计算机(或计算机引导的机器人)，并归入硅基LIFE类别，尽管这些处理器的硅衬底矩阵对它们的运行并不像碳对于湿态LIFE的基础那么重要。\n硼烷在地球大气层中具有危险的爆炸性，但在减少的环境中会更稳定。然而，硼在宇宙中的低丰度使得它比碳更不可能成为生命的基础。\n各种金属和氧可以形成非常复杂的热稳定性结构，可以与有机化合物相媲美；[需要引用的]杂多酸就是这样一个家族。一些金属氧化物在形成纳米管结构和类金刚石晶体(如立方氧化锆)的能力上也与碳相似。钛、铝、镁和铁在地壳中的含量都比碳丰富。因此，在某些条件下，基于金属氧化物的生命可能是可能的，包括那些基于碳的生命不太可能存在的条件(如高温)。格拉斯哥大学(Glasgow University)的克罗宁(Cronin)研究小组报告了多金属钨自组装成细胞状球体的情况。[19]通过改变它们的金属氧化物含量，球体可以获得充当多孔膜的孔，根据大小选择性地允许化学品进出球体。[19]\n硫也可以形成长链分子，但与磷和硅烷一样存在高反应性问题。硫作为碳的替代品在生物上的使用纯粹是假设的，特别是因为硫通常只形成线性链，而不是支链。(硫作为电子受体的生物用途非常广泛，可以追溯到地球上35亿年前，因此先于分子氧的使用。[20]降硫菌可以利用元素硫代替氧气，将硫还原为硫化氢。)。\n砷在化学上与磷相似，但对地球上大多数生命形式来说都是有毒的，它被结合到一些生物体的生物化学中。[21]一些海藻将砷结合到复杂的有机分子中，如砷糖和砷甜菜碱。真菌和细菌可以产生挥发性甲基化砷化合物。砷酸根微生物(Chrysigenes Arcatis)中存在亚砷酸盐还原和亚砷酸盐氧化的现象。[22]此外，一些原核生物在厌氧生长过程中可以利用砷酸盐作为末端电子受体，而一些原核生物可以利用亚砷酸盐作为电子供体来产生能量。\n据推测，地球上最早的生命形式可能在它们的DNA结构中使用了砷生物化学代替了磷。[23]对这种情况的一个共同反对意见是，砷酸酯对水解的稳定性比相应的磷酸酯差得多，因此砷不太适合这种功能。[24]。\n2010年的一项地球微生物学研究的作者推测，在加利福尼亚州东部莫诺湖的沉积物中收集到的一种名为GFAJ-1的细菌，在没有磷的情况下培养时，可以利用这种砷。这项研究得到了美国宇航局(NASA)的部分支持，该研究的作者推测，一种名为GFAJ-1的细菌在没有磷的情况下培养时可以利用这种砷。[25][26]他们提出，细菌可能会使用高浓度的聚羟基丁酸酯(Poly-β-羟基丁酸盐)或其他方法来降低水的有效浓度，并稳定其砷酸酯。[26]这一说法在发表后几乎立即受到严厉批评，因为它被认为缺乏适当的控制。[27][28]科学作家卡尔·齐默(Carl Zimmer)联系了几位科学家进行评估：我联系了十几位专家……。他们几乎一致认为NASA的科学家未能证明他们的观点。[29]其他作者无法复制他们的结果，并表明这项研究存在磷酸盐污染的问题，这表明目前存在的少量磷酸盐可以维持极端微生物的生命形式。[30]或者，有人建议GFAJ-1细胞是通过从降解的核糖体中回收磷酸盐而不是用砷酸盐代替它来生长的。[31][31]。\n除了碳化合物，目前已知的所有陆地生命也需要水作为溶剂。这引发了关于水是否是唯一能够填补这一角色的液体的讨论。在最近的科学文献中，生物化学家史蒂文·本纳(Steven Benner)[32]和约翰·A·巴罗斯(John A.Baross)主持的天体生物学委员会认真对待了外星生命形式可能基于水以外的溶剂的想法。[33]Baross委员会讨论的溶剂包括氨、[34]硫酸、[35]甲酰胺、[36]烃、[36]和(在远低于地球温度的情况下)液氮，或超临界流体形式的氢。[37]。\n卡尔·萨根(Carl Sagan)曾形容自己既是碳沙文主义者，又是水沙文主义者；然而，在另一个场合，他说他是碳沙文主义者，但不是那么大的水沙文主义者。[39]他推测碳氢化合物[39]：11氢氟酸[40]和氨[39][40]可能是水的替代品。\n这种复杂性导致了可能的反应路径的大量排列，包括酸碱化学、H+离子、OH−阴离子、氢键、范德华键、偶极-偶极和其他极性相互作用、水溶剂笼和水解。这种复杂性为进化提供了大量产生生命的途径，还有许多其他的溶剂[哪种？]。可能的反应大大减少，这严重限制了进化。\n热力学稳定性：液态水的生成自由能很低(−为237.24千焦耳/摩尔)，水几乎不会发生反应。其他溶剂的反应性很强，特别是与氧气的反应。\n水在氧气中不燃烧，因为它已经是氢和氧的燃烧产物。大多数替代溶剂在富氧的大气中不稳定，因此这些液体支持有氧生命的可能性很小。\n室温下氧气和二氧化碳的高度溶解性，支持有氧水生动植物的进化。\n水是一种室温液体，需要大量的量子过渡态来克服反应障碍。低温液体(如液态甲烷)具有指数级较低的过渡态，这是基于化学反应的生命所需的。这导致化学反应速率可能非常慢，从而阻碍了任何以化学反应为基础的生命的发展。[需要引用]。\n光谱透明性允许太阳辐射穿透液体(或固体)几米，极大地促进了水生生物的进化。\n固体(冰)的密度比液体低，所以冰漂浮在液体上。这就是为什么水体结冰而不结冰(自下而上)的原因。如果冰的密度大于液态水(几乎所有其他化合物都是如此)，那么大量的液体会慢慢冻结成固体，这将不利于生命的形成。\n水作为一种化合物在宇宙中非常丰富，尽管其中大部分是以蒸汽或冰的形式存在的。地下液态水被认为可能或可能存在于几颗外部卫星上：土卫二(在那里观察到间歇泉)、木卫二、土卫六和木卫三。地球和土卫六是目前已知的仅有的两个表面有稳定液态体的星球。\n然而，并不是水的所有性质都必然对生命有利。[41]例如，水冰的反照率很高，[41]这意味着它反射了大量来自太阳的光和热。在冰河时期，随着反射性冰在水面上堆积，全球变冷的影响会增加。[41]。\n有一些性质使得某些化合物和元素在成功的生物圈中作为溶剂比其他化合物和元素更有利。溶剂必须能够在行星物体通常遇到的温度范围内处于液体平衡状态。因为沸点随压力而变化，所以问题往往不是预期的溶剂是否保持液体，而是在多大的压力下。例如，氰化氢在1℃的大气压下液相温度范围很窄，但在压力为金星的大气层中，在92巴(91atm)的压力下，它确实可以在很宽的温度范围内以液体的形式存在。\n氨分子(NH3)和水分子一样，在宇宙中含量丰富，是氢(最简单和最常见的元素)与另一种非常常见的元素氮的化合物。[42]可能扮演的角色。\n..", "note_en": "Jump to navigation  Jump to search  Hypothetical types of biochemistry are forms of  biochemistry speculated to be scientifically viable but not proven to exist at this time.  [2] The kinds of  living organisms currently known on Earth all use  carbon compounds for basic structural and  metabolic functions,  water as a  solvent, and  DNA or  RNA to define and control their form. If  life exists on other  planets or  moons, it may be chemically similar; it is also possible that there are organisms with quite different chemistries  [3]—for instance, involving other classes of carbon compounds, compounds of another element, or another solvent in place of water.\n The possibility of life-forms being based on &#34;alternative&#34; biochemistries is the topic of an ongoing scientific discussion, informed by what is known about extraterrestrial environments and about the chemical behaviour of various elements and compounds. It is of interest in  synthetic biology and is also a  common subject in science fiction.\n The element  silicon has been much discussed as a hypothetical alternative to carbon. Silicon is in the same group as carbon on the  periodic table and, like carbon, it is  tetravalent. Hypothetical alternatives to water include  ammonia, which, like water, is a  polar molecule, and cosmically abundant; and non-polar  hydrocarbon solvents such as  methane and  ethane, which are known to exist in liquid form on the surface of  Titan.\n   Perhaps the least unusual alternative biochemistry would be one with differing  chirality of its biomolecules. In known Earth-based life,  amino acids are almost universally of the  L form and  sugars are of the  D form. Molecules using  D amino acids or  L sugars may be possible; molecules of such a chirality, however, would be incompatible with organisms using the opposing chirality molecules.\n The possible role of  liquid ammonia as an alternative solvent for life is an idea that goes back at least to 1954, when  J. B. S. Haldane raised the topic at a symposium about life&#39;s origin.\n Arsenic, which is chemically similar to  phosphorus, while poisonous for most  life forms on Earth, is incorporated into the biochemistry of some organisms.\n Boranes are dangerously explosive in Earth&#39;s atmosphere, but would be more stable in a reducing environment. The abundance of Boron in the universe however, is exceedingly rare in comparison to its neighbours Carbon, Nitrogen and Oxygen.\n In 2007,  Vadim N. Tsytovich and colleagues proposed that lifelike behaviors could be exhibited by dust particles suspended in a  plasma, under conditions that might exist in space.\n It would be biochemically possible to sustain life in environments that are only periodically consistent with life as we know it.\n Various metals, together with oxygen, can form very complex and thermally stable structures rivaling those of organic compounds; [   citation needed] the  heteropoly acids are one such family.\n It has been considered as a possible solvent for life by scientists such as Peter Sneath.\n Hydrogen sulfide is the closest  chemical analog to water, but is less polar and a weaker inorganic solvent.\n Methane (CH 4) is a simple hydrocarbon: that is, a compound of two of the most common elements in the cosmos: hydrogen and carbon. Methane life is hypothetically possible.\n Physicists have noted that, although photosynthesis on Earth generally involves green plants, a variety of other-colored plants could also support photosynthesis, essential for most life on Earth, and that other colors might be preferred in places that receive a different mix of stellar radiation than Earth.\n A shadow biosphere is a hypothetical  microbial  biosphere of Earth that uses radically different  biochemical and  molecular processes than currently known life.\n Like carbon, silicon can create molecules that are sufficiently large to carry biological information; however, the scope of possible silicon chemistry is far more limited than that of carbon.\n Gerald Feinberg and  Robert Shapiro have suggested that molten silicate rock could serve as a liquid medium for organisms with a chemistry based on silicon, oxygen, and other elements such as  aluminium.\n The biological use of sulfur as an alternative to carbon is purely hypothetical, especially because sulfur usually forms only linear chains rather than branched ones.\n    A shadow biosphere is a hypothetical  microbial  biosphere of Earth that uses radically different  biochemical and  molecular processes than currently known life.  [4]  [5] Although life on Earth is relatively well-studied, the shadow biosphere may still remain unnoticed because the exploration of the microbial world targets primarily the biochemistry of the macro-organisms.\n  Perhaps the least unusual alternative biochemistry would be one with differing  chirality of its biomolecules. In known Earth-based life,  amino acids are almost universally of the  L form and  sugars are of the  D form. Molecules using  D amino acids or  L sugars may be possible; molecules of such a chirality, however, would be incompatible with organisms using the opposing chirality molecules. Amino acids whose chirality is opposite to the norm are found on Earth, and these substances are generally thought to result from decay of organisms of normal chirality. However, physicist  Paul Davies speculates that some of them might be products of &#34;anti-chiral&#34; life.  [6]\n It is questionable, however, whether such a biochemistry would be truly alien. Although it would certainly be an alternative  stereochemistry, molecules that are overwhelmingly found in one  enantiomer throughout the vast majority of organisms can nonetheless often be found in another enantiomer in different (often  basal) organisms such as in comparisons between members of  Archaea and other  domains, [   citation needed] making it an open topic whether an alternative stereochemistry is truly novel.\n  On Earth, all known living things have a carbon-based structure and system. Scientists have speculated about the pros and cons of using  atoms other than carbon to form the molecular structures necessary for life, but no one has proposed a theory employing such atoms to form all the necessary structures. However, as  Carl Sagan argued, it is very difficult to be certain whether a statement that applies to all life on Earth will turn out to apply to all life throughout the universe.  [7] Sagan used the term &#34; carbon chauvinism&#34; for such an assumption.  [8] He regarded  silicon and  germanium as conceivable alternatives to carbon;  [8] (other plausible elements include but aren&#39;t limited to palladium and titanium) but, on the other hand, he noted that carbon does seem more chemically versatile and is more abundant in the cosmos.  [9]\n      The silicon atom has been much discussed as the basis for an alternative biochemical system, because silicon has many  chemical properties similar to those of carbon and is in the same  group of the periodic table, the  carbon group. Like carbon, silicon can create molecules that are sufficiently large to carry biological information.  [10]\n However, silicon has several drawbacks as an alternative to carbon. Silicon, unlike carbon, lacks the ability to form chemical bonds with diverse types of atoms as is necessary for the chemical versatility required for metabolism, and yet this precise inability is what makes silicon less susceptible to bond with all sorts of impurities from which carbon, in comparison, is not shielded. Elements creating organic functional groups with carbon include hydrogen, oxygen, nitrogen, phosphorus, sulfur, and metals such as iron, magnesium, and zinc. Silicon, on the other hand, interacts with very few other types of atoms.  [10] Moreover, where it does interact with other atoms, silicon creates molecules that have been described as &#34;monotonous compared with the combinatorial universe of organic macromolecules&#34;.  [10] This is because silicon atoms are much bigger, having a larger  mass and  atomic radius, and so have difficulty forming double bonds (the double-bonded carbon is part of the  carbonyl group, a fundamental motif of carbon-based bio-organic chemistry).\n Silanes, which are  chemical compounds of  hydrogen and silicon that are analogous to the  alkane  hydrocarbons, are highly reactive with  water, and long-chain silanes spontaneously decompose. Molecules incorporating  polymers of alternating silicon and  oxygen atoms instead of direct bonds between silicon, known collectively as  silicones, are much more stable. It has been suggested that silicone-based chemicals would be more stable than equivalent hydrocarbons in a sulfuric-acid-rich environment, as is found in some extraterrestrial locations.  [11]\n Of the varieties of molecules identified in the  interstellar medium as of 1998 , 84 are based on carbon, while only 8 are based on silicon.  [12] Moreover, of those 8 compounds, 4 also include carbon within them. The  cosmic abundance of carbon to silicon is roughly 10 to 1. This may suggest a greater variety of complex carbon compounds throughout the cosmos, providing less of a foundation on which to build silicon-based biologies, at least under the conditions prevalent on the surface of planets. Also, even though  Earth and other  terrestrial planets are exceptionally silicon-rich and carbon-poor (the relative abundance of silicon to carbon in Earth&#39;s crust is roughly 925:1), terrestrial life is carbon-based. The fact that carbon is used instead of silicon may be evidence that silicon is poorly suited for biochemistry on Earth-like planets. Reasons for which may be that silicon is less versatile than carbon in forming compounds, that the compounds formed by silicon are unstable, and that it blocks the flow of heat.  [13]\n Even so,  biogenic silica is used by some Earth life, such as the  silicate skeletal structure of  diatoms. According to the  clay hypothesis of  A. G. Cairns-Smith, silicate minerals in water played a crucial role in  abiogenesis: they replicated their crystal structures, interacted with carbon compounds, and were the precursors of carbon-based life.  [14]  [15]\n Although not observed in nature, carbon–silicon bonds have been added to biochemistry by using directed evolution (artificial selection). A heme containing cytochrome  c protein from  Rhodothermus marinus has been engineered using directed evolution to catalyze the formation of new carbon–silicon bonds between hydrosilanes and diazo compounds.  [16]\n Silicon compounds may possibly be biologically useful under temperatures or pressures different from the surface of a terrestrial planet, either in conjunction with or in a role less directly analogous to carbon. Polysilanols, the silicon compounds corresponding to  sugars, are soluble in liquid nitrogen, suggesting that they could play a role in very-low-temperature biochemistry.  [17]  [18]\n In cinematic and literary science fiction, at a moment when man-made machines cross from nonliving to living, it is often posited, [   by whom?] this new form would be the first example of non-carbon-based life. Since the advent of the  microprocessor in the late 1960s, these machines are often classed as  computers (or computer-guided  robots) and filed under &#34;silicon-based life&#34;, even though the silicon backing matrix of these processors is not nearly as fundamental to their operation as carbon is for &#34;wet life&#34;.\n   Boranes are dangerously explosive in Earth&#39;s atmosphere, but would be more stable in a reducing environment. However, boron&#39;s low cosmic abundance makes it less likely as a base for life than carbon.\n Various metals, together with oxygen, can form very complex and thermally stable structures rivaling those of organic compounds; [   citation needed] the  heteropoly acids are one such family. Some metal oxides are also similar to carbon in their ability to form both nanotube structures and diamond-like crystals (such as  cubic zirconia).  Titanium,  aluminium,  magnesium, and  iron are all more abundant in the Earth&#39;s crust than carbon. Metal-oxide-based life could therefore be a possibility under certain conditions, including those (such as high temperatures) at which carbon-based life would be unlikely. The Cronin group at Glasgow University reported self-assembly of tungsten  polyoxometalates into cell-like spheres.  [19] By modifying their metal oxide content, the spheres can acquire holes that act as porous membrane, selectively allowing chemicals in and out of the sphere according to size.  [19]\n Sulfur is also able to form long-chain molecules, but suffers from the same high-reactivity problems as phosphorus and silanes. The biological use of sulfur as an alternative to carbon is purely hypothetical, especially because sulfur usually forms only linear chains rather than branched ones. (The biological use of sulfur as an electron acceptor is widespread and can be traced back 3.5 billion years on Earth, thus predating the use of molecular oxygen.  [20]  Sulfur-reducing bacteria can utilize elemental sulfur instead of oxygen, reducing sulfur to  hydrogen sulfide.)\n   Arsenic, which is chemically similar to  phosphorus, while poisonous for most  life forms on Earth, is incorporated into the biochemistry of some organisms.  [21] Some  marine algae incorporate arsenic into complex organic molecules such as  arsenosugars and  arsenobetaines.  Fungi and  bacteria can produce volatile methylated arsenic compounds. Arsenate reduction and arsenite oxidation have been observed in  microbes (  Chrysiogenes arsenatis).  [22] Additionally, some  prokaryotes can use arsenate as a terminal electron acceptor during anaerobic growth and some can utilize arsenite as an electron donor to generate energy.\n It has been speculated that the earliest life forms on Earth may have used  Arsenic biochemistry in place of phosphorus in the structure of their DNA.  [23] A common objection to this scenario is that arsenate esters are so much less stable to  hydrolysis than corresponding  phosphate esters that arsenic is poorly suited for this function.  [24]\n The authors of a 2010  geomicrobiology study, supported in part by NASA, have postulated that a bacterium, named  GFAJ-1, collected in the sediments of  Mono Lake in eastern  California, can employ such &#39;arsenic DNA&#39; when cultured without phosphorus.  [25]  [26] They proposed that the bacterium may employ high levels of  poly-β-hydroxybutyrate or other means to reduce the  effective concentration of water and stabilize its arsenate esters.  [26] This claim was heavily criticized almost immediately after publication for the perceived lack of appropriate controls.  [27]  [28] Science writer  Carl Zimmer contacted several scientists for an assessment: &#34;I reached out to a dozen experts ... Almost unanimously, they think the NASA scientists have failed to make their case&#34;.  [29]Other authors were unable to reproduce their results and showed that the study had issues with phosphate contamination, suggesting that the low amounts present could sustain extremophile lifeforms.  [30]Alternatively, it was suggested that GFAJ-1 cells grow by recycling phosphate from degraded ribosomes, rather than by replacing it with arsenate.  [31]\n   In addition to carbon compounds, all currently known terrestrial life also requires water as a solvent. This has led to discussions about whether water is the only liquid capable of filling that role. The idea that an extraterrestrial life-form might be based on a solvent other than water has been taken seriously in recent scientific literature by the biochemist  Steven Benner,  [32] and by the astrobiological committee chaired by John A. Baross.  [33] Solvents discussed by the Baross committee include  ammonia,  [34]  sulfuric acid,  [35]  formamide,  [36] hydrocarbons,  [36] and (at temperatures much lower than Earth&#39;s) liquid  nitrogen, or hydrogen in the form of a  supercritical fluid.  [37]\n Carl Sagan once described himself as both a  carbon chauvinist and a water chauvinist;  [38] however, on another occasion he said that he was a carbon chauvinist but &#34;not that much of a water chauvinist&#34;.  [39] He speculated on hydrocarbons,  [39] : 11  hydrofluoric acid,  [40] and ammonia  [39]  [40] as possible alternatives to water.\n  A complexity which leads to a large number of permutations of possible reaction paths including acid-base chemistry, H + cations, OH − anions, hydrogen bonding, van der Waals bonding, dipole–dipole and other polar interactions, aqueous solvent cages, and hydrolysis. This complexity offers a large number of pathways for evolution to produce life, many other solvents [   which?] have dramatically fewer possible reactions, which severely limits evolution.\n Thermodynamic stability: the free energy of formation of liquid water is low enough (−237.24 kJ/mol) that water undergoes few reactions. Other solvents are highly reactive, particularly with oxygen.\n Water does not combust in oxygen because it is already the combustion product of hydrogen with oxygen. Most alternative solvents are not stable in an oxygen-rich atmosphere, so it is highly unlikely that those liquids could support aerobic life.\n  High solubility of oxygen and carbon dioxide at room temperature supporting the evolution of aerobic aquatic plant and animal life.\n  Water is a room-temperature liquid leading to a large population of quantum transition states required to overcome reaction barriers. Cryogenic liquids (such as liquid methane) have exponentially lower transition state populations which are needed for life based on chemical reactions. This leads to chemical reaction rates which may be so slow as to preclude the development of any life based on chemical reactions. [   citation needed]\n Spectroscopic transparency allowing solar radiation to penetrate several meters into the liquid (or solid), greatly aiding the evolution of aquatic life.\n   The solid (ice) has lower density than the liquid, so ice floats on the liquid. This is why bodies of water freeze over but do not freeze solid (from the bottom up). If ice were denser than liquid water (as is true for nearly all other compounds), then large bodies of liquid would slowly freeze solid, which would not be conducive to the formation of life.\n Water as a compound is cosmically abundant, although much of it is in the form of vapour or ice. Subsurface liquid water is considered likely or possible on several of the outer moons:  Enceladus (where geysers have been observed),  Europa,  Titan, and  Ganymede. Earth and Titan are the only worlds currently known to have stable bodies of liquid on their surfaces.\n Not all properties of water are necessarily advantageous for life, however.  [41] For instance, water ice has a high  albedo,  [41] meaning that it reflects a significant quantity of light and heat from the Sun. During  ice ages, as reflective ice builds up over the surface of the water, the effects of global cooling are increased.  [41]\n There are some properties that make certain compounds and elements much more favorable than others as solvents in a successful biosphere. The solvent must be able to exist in liquid equilibrium over a range of temperatures the planetary object would normally encounter. Because boiling points vary with the pressure, the question tends not to be  does the prospective solvent remain liquid, but  at what pressure. For example,  hydrogen cyanide has a narrow liquid-phase temperature range at 1 atmosphere, but in an atmosphere with the pressure of  Venus, with 92 bars (91 atm) of pressure, it can indeed exist in liquid form over a wide temperature range.\n   The  ammonia molecule (NH 3), like the water molecule, is abundant in the universe, being a compound of hydrogen (the simplest and most common element) with another very common element, nitrogen.  [42] The possible role of\n......", "posttime": "2020-05-22 03:13:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "假想,types,生命", "title": "生物化学的假想类型", "title_en": "Hypothetical Types of Biochemistry", "transed": 1, "url": "https://en.wikipedia.org/wiki/Hypothetical_types_of_biochemistry", "via": "", "real_tags": ["假想", "types", "生命"]}, {"category": "", "categoryclass": "", "imagename": "b81064cac06ba0c4e89d7c2c89c92b17.png", "infoid": 1003176, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Scout Suite是一款开源的多云安全审计工具，可实现云环境的安全状态评估。Scout Suite使用云提供商提供的API收集配置数据进行手动检查，并突出显示风险区域。Scout Suite不需要在网络控制台上浏览几十个页面，而是自动呈现攻击面的清晰视图。\nScout Suite是由安全顾问/审计师设计的。它的目的是为运行它的云帐户提供一个面向安全的时间点视图。一旦收集了数据，就可以离线执行所有使用。\n完成此操作后，它将生成一份HTML报告，其中包括调查结果和云帐户配置：", "note_en": "Scout Suite is an open source multi-cloud security-auditing tool, which enables security posture assessment of cloud environments. Using the APIs exposed by cloud providers, Scout Suite gathers configuration data for manual inspection and highlights risk areas. Rather than going through dozens of pages on the web consoles, Scout Suite presents a clear view of the attack surface automatically.\n Scout Suite was designed by security consultants/auditors. It is meant to provide a point-in-time security-oriented view of the cloud account it was run in. Once the data has been gathered, all usage may be performed offline.\n        Once this has completed, it will generate an HTML report including findings and Cloud account configuration:", "posttime": "2020-05-22 03:13:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "多云,multi,安全", "title": "ScoutSuite：多云安全审计工具", "title_en": "ScoutSuite: Multi-cloud security auditing tool", "transed": 1, "url": "https://github.com/nccgroup/ScoutSuite", "via": "", "real_tags": ["多云", "multi", "安全"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003175, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有两种类型的工程师，一种是能快速做估计的，另一种是不能的。这些人只是更聪明，还是有更多的东西？\n信封后面的评估是一项可以通过实践学习的技能。一旦你熟悉了这项交易的一些诀窍，事情就会变得容易起来。\n从磁盘读取数据的速度有多快？从网络传来的速度有多快？您应该熟悉您的组件的大致性能数字。重要的不是确切的数字本身，而是它们在数量级上的相对差异。\n估计的目标不是得到正确的答案，而是得到正确的答案。使用2或10的幂使得乘法非常容易，因为在对数空间中，乘法变成了加法。\n例如，假设您有80万用户以12 Mbps的速度观看超高清视频。您的内容交付网络中的计算机可以以1 Gbps的速度出口。你需要几台机器？\n1 0 6∗1 0 7 b p s 1 0 9 b ps=1 0(6+7−9)=1 0 4=10 K\\FRAC{10^{6}*10^7bps}{10^{9}bps}=10^{(6+7-9)}=10^{4}=10K 1 0 9 b p s 1 0 6∗1 0 7 b p s​=1 0(。6+7−9)=1 04=1 0K将6与7相加并从中减去9比试图得到准确答案容易得多：\n0.8M∗12 M b p s 1000 M b p s=9.6K\\frac{0.8M*12 Mbps}{1000 Mbps}=9.6K 1 00 M b p s 0.。8 M∗1 2 M b p s​=9。6K，差别真的重要吗？不尽然；确切的答案无论如何都不是确切的。用户随时间变化、网络带宽不恒定等。\n72法则是一种方法，用来估计如果一个数量以一定的百分比增长，它需要多长时间才能翻一番。\nt i m e=72 r t e time=\\frac{72}{速率}t i m e=r a t e 7 2​例如，假设您Web服务的流量每周增加约10%，需要多长时间才能翻一番？\nt i m e=72 10=7.2time=\\frac{72}{10}=7.2t i m e=1 0 7 2​=7.。2如果你把72的法则和2的幂结合起来，那么你很快就能知道一个量需要多长时间才能增加几个数量级。\n很多事情都可以建模为队列。例如，可以将Web服务视为队列。请求率是新项目到达的速率。处理请求所需的时间是项目在队列中花费的时间。最后，并发处理的请求数是队列中的项目数。\n如果您可以从另外两个参数中推导出三个参数中的一个，那不是很好吗？原来这三个量之间有一个相互联系的定律！这叫做利特尔定律：\nL=λ∗W L=\\λ*W L=λ∗W它说的是队列中项目的平均数量等于新项目到达的平均速率乘以项目在队列中花费的平均时间。\n让我们试试看吧。假设您有一项处理请求的平均时间为100ms的服务。它目前每秒接收大约200万个请求(RPS)。同时处理多少个请求？\nR e Q u e s ts=2 M r p s∗0.1s=200K Requests=2MRps*0.1s=200K r e Q u e s t s=2 M r p s∗0。1 s=2 00K该服务正在并发处理200K请求。如果每个请求都占用大量CPU并且需要一个线程，那么我们将需要大约200K个线程。如果我们使用8台核心机器，那么为了跟上步伐，我们将需要大约25K台机器。\n估计对于工程师来说是一项至关重要的技能。通过练习和使用我在这篇文章中提出的技巧，你可以在这方面做得更好：\n使用72法则来计算出一个数量在给定增长率的情况下需要多长时间才能翻一番。\n如果您想了解更多关于如何对分布式系统进行实际评估的信息，请查看我即将到来的视频课程。", "note_en": "There are two types of engineers, the ones that can quickly do estimates and the ones that can’t. Are these people just smarter, or is there more to it?\n   Back of the envelope estimation is a skill that can be learned with practice. It becomes easier once you get familiar with some tricks of the trade.\n  How fast can you read data from the disk? How quickly from the network? You should be familiar with ballpark performance figures of your components. What’s important are not the exact numbers per se but their relative differences in terms of orders of magnitude.\n  The goal of estimation is not to get a correct answer, but to get one in the right ballpark. Using powers of 2 or 10 makes multiplications very easy as in logarithmic space, multiplications become additions.\n For example, let’s say you have 800K users watching videos in UHD at 12 Mbps. A machine in your Content Delivery Network can egress at 1 Gbps. How many machines do you need?\n          1  0 6 ∗ 1  0 7 b p s  1  0 9 b p s = 1  0  ( 6 + 7 − 9 ) = 1  0 4 = 10 K \\frac{10^{6}*10^7bps}{10^{9}bps} = 10^{(6 + 7 - 9)} = 10^{4} = 10K             1  0         9 b p s       1  0         6  ∗  1  0        7 b p s ​      =    1  0         ( 6 + 7 − 9 )  =    1  0         4  =    1 0 K Summing 6 to 7 and subtracting 9 from it is much easier than trying to get to the exact answer:\n         0.8 M ∗ 12 M b p s  1000 M b p s = 9.6 K \\frac{0.8M*12Mbps}{1000 Mbps} = 9.6K             1 0 0 0 M b p s       0 . 8 M  ∗  1 2 M b p s ​      =    9 . 6 K Does the difference really matter? Not really; the precise answer is not exact anyway. Users vary over time, the network bandwidth is not constant, etc.\n  The rule of 72 is a method to estimate how long it will take for a quantity to double if it grows at a certain percentage rate.\n       t i m e =  72  r a t e time = \\frac{72}{rate}    t i m e  =             r a t e       7 2 ​     For example, let’s say the traffic to your web service is increasing by approximately 10% weekly, how long will it take to double?\n       t i m e =  72 10 = 7.2 time = \\frac{72}{10} = 7.2    t i m e  =             1 0       7 2 ​      =    7 . 2  If you combine the rule of 72 with the powers of two, then you can quickly find out how long it will take for a quantity to increase by several orders of magnitudes.\n    Lots of things can be modeled as queues. A web service can be seen as a queue, for example. The request rate is the rate at which new items arrive. The time it takes for a request to be processed is the time an item spends in the queue. Finally, the number of concurrently processed requests is the number of items in the queue.\n Wouldn’t it be great if you could derive one of the three parameters from the other two? It turns out there is a law that relates these three quantities to one another! It’s called  Little’s Law:\n       L = λ ∗ W L = \\lambda * W    L  =    λ  ∗    W What it says is that the average number of items in the queue equals the average rate at which new items arrive, multiplied by the average time an item spends in the queue.\n Let’s try it out. Let’s say you have a service that takes on average 100 ms to process a request. It’s currently receiving about two million requests per second (rps). How many requests are being processed concurrently?\n       r e q u e s t s = 2 M r p s ∗ 0.1 s = 200 K requests = 2Mrps * 0.1s = 200K     r e q u e s t s  =    2 M r p s  ∗    0 . 1 s  =    2 0 0 K The service is processing 200K requests concurrently. If each request is CPU heavy and requires a thread, then we will need about 200K threads. If we are using 8 core machines, then to keep up, we will need about 25K machines.\n  Estimation is a vital skill for an engineer. It’s something you can get better at by practicing and using the hacks I have presented in this post:\n Use the rule of 72 to find out how long it takes for a quantity to double given its growth rate.\n Check out my  upcoming video class if you want to learn more about how to do back of the envelope estimates for distributed systems.", "posttime": "2020-05-22 03:11:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "估计,estimation,需要", "title": "包络估计攻击的背后", "title_en": "Back of the Envelope Estimation Hacks", "transed": 1, "url": "https://robertovitillo.com/back-of-the-envelope-estimation-hacks/", "via": "", "real_tags": ["估计", "需要"]}]