[{"category": "", "categoryclass": "", "imagename": "dd78d633797adbf0ffcbcf187b2da9ef.jpg", "infoid": 1031331, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "早在4月份，大预算、角色扮演的第一人称射击视频游戏Borderland 3在发布后的六个月内就售出了超过800万份-收到了免费更新，向玩家推出了一款新的迷你游戏。\n在基地的医疗舱里，采用复古风格的拱廊橱柜的形式，边疆科学公司让玩家在行和列之间移动彩色方块来解决谜题。他们的成功会得到游戏内货币的奖励，玩家可以用这些货币来更好地对抗主要游戏中的外星人、雇佣兵、机器和太空爱好者。\n但是“边疆科学”并不仅仅是在幕后进行高分计算。它的服务玩家们的彩色方块和拼图分别代表了微生物16S核糖体RNA基因序列的核苷酸和片段，所有这些都是从人类粪便样本中收集的，并由一个名为全球美国肠道项目的开放研究平台进行了测序。\n更确切地说，边疆科学的真正目标是帮助人工智能在整体组织和分析这些序列时消除错误。通过汇编玩家正在进行的数百万匹配，然后将它们输入排序算法，该项目的目标是建立一个更高质量的数据体，研究人员有朝一日可以用这些数据来开发新的健康或健康疗法。\n乍一看，用户基础和科学问题之间的匹配似乎不太可能。这款充满黑色幽默的快节奏第一人称射击抢劫游戏主要是为寻求冒险和动作的游戏玩家设计的，麦吉尔大学(McGill University)、视频游戏科学公司Massily Multiplayer Online Science(MMOS)和Borderland 3开发商Gearbox Studios在最近的一篇自然生物技术信件中写道，该项目的贡献者。\n但可能是一条死胡同的是这项倡议的力量。他们写道，在“边疆之地”进行部署提供了一个接触不是特别接触科学的公众的机会，同时也为一个庞大而强大的在线玩家社区打开了大门，这些玩家可以承载和放大这一倡议的影响。\n现在已经过去了近半年，Gearbox创始人兼首席执行官兰迪·皮奇福德(Randy Pitchford)和MMOS联合创始人兼研究和业务发展主管阿提拉·桑特纳(Attila Szantner)告诉MobiHealthNews，Borderland Science的产出已经远远超过了之前的众包视频游戏研究项目。\n不仅有160万不同的玩家至少解决了一项任务，每个人平均完成了近40个谜题，总共解决了6320万个谜题-与35万多名玩家相比，参与度大幅增加，也超过了它的前身-一款名为The Phylo的独立益智游戏-在过去10年里记录的平均5项任务。\n“我认为边界科学是一个里程碑式的项目，”Szantner告诉美国移动健康新闻网(MobiHealthNews)。我们以前已经证明，这样的集成在游戏中工作得很好，在游戏中，玩家社区和…。这个游戏是以科学为导向的。边疆科学公司已经证明，在拥有不同观众的主流枪手/抢劫者中，公民科学特写可以获得超级成功，可以为游戏带来巨大的价值，可以给玩家带来授权和乐趣的体验，同时对科学研究做出重大贡献。\n边疆科学受益于悠久的公民科学项目遗产，其中一些项目采用游戏化设计方法来实现他们的研究目标，该团队在《自然·生物技术》杂志上写道。\n其中包括2008年推出的预测蛋白质3D结构的益智游戏The Foldit；自2016年以来让参与者查看小鼠脑血管视频，以加速阿尔茨海默氏病研究；以及前述由麦吉尔研究人员开发的绘制与疾病相关的哺乳动物基因图的The Phylo等。“Foldit”是一款预测蛋白质3D结构的益智游戏；“Stall Catcher”自2016年以来一直让参与者查看小鼠脑血管的视频，以加快阿尔茨海默氏病的研究。\n其他公民科学项目对玩家的要求并不高，而是需要游戏机内的硬件。\n“我记得在我的PlayStation3上使用了‘Folding@Home’，它给了我灵感，”皮奇福德告诉美国移动健康新闻网(MobiHealthNews)。这是一种非互动的体验，基本上是当机器所有者不使用它们时，将计算能力集中到人群中，但这并不是在利用玩家自己的脑力。当阿提拉带着他对挖掘游戏玩家创造力和解决问题能力的远见来找我时，我变得非常活跃和兴奋，能够帮助把针搬得更远。“。\nSzantner和MMOS之前推出的一款公民科学研究视频游戏是“发现计划”(Project Discovery)，该游戏旨在对大量的荧光显微镜图像进行分类。与其他程序不同的是，Project Discovery并不是作为独立游戏发布的，而是部署在科幻巨型多人在线角色扮演游戏Eve Online中。\nProject Discovery招募了30多万人参与，平均每人完成了100多项任务。该团队将这一成功归因于两个主要因素：每月登录Eve在线的数十万活跃玩家，以及利基玩家群体中更成熟的人群。(Eve Online的吸引力在于模拟了一个由大宗商品交易和玩家经营的公司组成的真实经济环境，在玩家中享有太空电子表格的声誉。)(Eve Online的吸引力在于模拟了商品交易和玩家经营的公司的真实经济，在玩家中享有电子表格的美誉。)。\n为了扩大这一成功，MMOS的下一个项目将需要通过在更主流的特许经营权内部署来极大地增加接触公民科学游戏的人数。挑战是在保持参与率更接近项目发现而不是Phylo的情况下做到这一点。\n桑特纳说，虽然过去的众包科学项目使用游戏化，甚至是围绕解决科学问题而开发的独立手机游戏，但我们的创新是将这些公民科学任务与已经存在的主要视频游戏整合在一起，创造无缝的游戏体验。这是一个巨大的差异。以前没有人做过，所以我们处在未知的领域。\n当做这样的整合时，最重要的是，这款小游戏在更大的游戏宇宙中让人感觉像是体验中不可或缺的一部分。这是确保我们不会打破沉浸的一种方式。\nSzantner和Pitchford解释说，这种沉浸因素很大程度上取决于团队如何选择向球员展示Borderland Science。\n首先，这款迷你游戏被记录在玩家的日志中，作为一项可选的任务，由一名科学家角色提供，他已经在该系列的叙事中扮演了关键角色。一旦玩家与华丽的街机互动，Gearbox就会通过一段介绍性视频介绍Borderland Science的游戏性和现实世界的目标，脚本与特许经营的厚颜无耻和喜剧基调相匹配。\n至于Borderland Science本身，它的艺术品以Borderland 3的主人公和其他特许经营形象的面孔为特色，并采用声音、颜色和图像保真度进行风格化，以配合它所唤起的20世纪80年代的拱廊机器。\n皮奇福德说，这种对玩家沉浸的关注对商业视频游戏行业来说并不是什么新鲜事，该行业多年来一直在研究新技术和最佳实践，以帮助游戏玩家在虚拟世界中迷失自我。但是，在某种程度上，设计团队是在自相残杀，因为边疆科学公司还需要与主要游戏的射击、驾驶和掠夺动作竞争。\n为了让至少10%的《边疆3》玩家以任何身份触摸这款迷你游戏，团队再次求助于电子游戏行业的必需品：几十年来将玩家与零钱隔开的五颜六色的街机橱柜设计，以及在过去几年里变得更加常见的游戏内助推器和化妆角色服装的承诺。\n皮奇福德说，激励玩家首次尝试Borderland Science是该项目目前为止最大的参与障碍。他说，一旦玩家拿到彩色积木，他毫不怀疑他的设计师可以推出一款值得重玩的益智游戏。\n皮奇福德说：“在”边疆科学“一书中，很多的重点放在了设计本身的趣味性、趣味性和参与性上。重要的是，游戏本身不是一件苦差事，而是一种本身就能激发和满足互动的东西。当这一目标的成功与主要的Borderland游戏的主题、背景和角色的深度整合结合在一起时，我们的客户欣然接受。“。\n与Borderland Science的设计挑战并行不悖的是，要证明商业组织内的任何重大项目都是合理的，都会遇到内部障碍。对于Gearbox来说，Borderland Science的开发成本不是微不足道的，皮奇福德表示，他不会设想这种类型的项目通过生物制药研究伙伴关系或类似途径直接推动利润增长。\n从商业责任的角度来看，总是有很多摩擦与时间和精力的承诺背道而驰，皮奇福德说。\n相反，他建议那些在非研究商业实体工作的人在他们可能追求的任何潜在健康研究项目的范围和重点上保持灵活性，Szantner补充说，赢得能够推动这些项目的内部领导者或领军者的支持至关重要。但对于视频游戏或娱乐业来说，Pitchford和Szantner表示，这些项目最有力的商业理由是它们可以为最终产品增加独特的价值。\n例如，早些时候，该团队讨论了是否将Borderland Science作为一款简单的迷你游戏呈现给玩家，但没有提到其研究目标，但很快就认定这种特洛伊木马方法将是错误的。通过坦率地告知该项目的范围，对于那些有兴趣为健康研究贡献时间的人来说，玩这款游戏可以变得更有回报和乐趣-对于那些销售视频游戏的人来说，这是一个宝贵的奖金。\n皮奇福德说，研究结果表明，这种努力是有价值的，不仅体现在科学价值上，也体现在商业价值上。今天读到这些话的一些人可能以前没有听说过Borderland，并且会因为Borderland Science而考虑购买Borderland 3，这一事实为其他开发商和出版商提供了一个商业案例，让他们把一些精力投入到具有良好社会成分的努力上。“。\n皮奇福德警告说，只有当这种体验不会影响付费客户的娱乐体验时，这种增值才是有效的。在这里，他举了一个参加现场舞台表演的例子，在娱乐结束后，一些演员可能会拿着捐赠箱在人群中走来走去。他说，虽然是慈善的，而且经常被接受，但现实情况是，观众已经收到了他们支付的娱乐费用，现在正在被要求捐款。\n然而，当慈善请求以一种身临其境且不会稀释产品的方式融入娱乐节目时，艺人能够与付费观众保持牢固的关系-对于视频游戏开发商来说，这意味着玩家将继续购买并参与他们发布的产品。\nPitchford说：“我认为Borderland Science成功的原因之一是，如果玩家不知道他们正在玩的游戏是用测序微生物DNA来解决现实世界的科学问题，他们仍然会被这种体验所娱乐，并与它是如何在更大的Borderland宇宙的背景下呈现的有关。”我认为关心客户的利益一定是成功将公民科学项目与商业视频游戏相结合的关键因素。\n与之前的其他众包科学项目一样，Borderland Science利用社区来大规模执行特定任务。自推出以来，它的玩家每天贡献的工作量相当于1万至15000小时的体力工作。但即使是Borderland 3的玩家基础也只占整个市场的一小部分-根据视频游戏行业最大的行业协会娱乐软件协会(Entertainment Software Association)的数据，仅在美国就有超过1.64亿成年人花时间完成依赖批判性思维和解谜技能的挑战。\n对于Szantner来说，将所有未使用的计算能力留在桌面上对研究人员来说是一个错失的机会。\n桑特纳说：“随着人们在电子游戏的虚拟世界中花费越来越多的时间，我们必须找到新的方法来尽可能地从这段时间获取更多的价值。”我相信我们才刚刚开始这段旅程，但可以肯定的是，它的价值就在那里。\n皮奇福德说，更重要的是，这些人可能特别适合这类工作。玩家已经习惯于通过游戏教程接收新的指令，并迅速将他们的培训应用到他们面前的问题上。此外，许多人启动了一款视频游戏，专门寻求解决和克服繁重的精神挑战，并在完成一项艰巨的任务后获得满足感。\n这种灵活性和干劲可能会为绘制人类肠道微生物群的专家带来实实在在的好处，或者可能为其他研究领域争论不休的大量数据带来实实在在的好处。\n皮奇福德说：“我的梦想是，越来越多的游戏将公民科学融入到他们的项目中，世界各地数十亿视频游戏玩家的集体技能和创造力可以被用来帮助我们人类克服一些现实世界中的科学障碍，我们在医学、物理、工程、气候、太空探索和许多其他关键的重点领域面临着一些现实世界的科学障碍。”\n虽然看到“边疆科学”的实际工作完成对现实世界的医学突破做出了贡献，但我想我也会很高兴看到其他一些游戏受到“边疆科学”的启发，为我们带来飞跃。\n除了Borderland Science的数据输出，Pitchford希望该项目和整个商业视频游戏的设计考虑可以对萌芽中的健康和医疗软件领域产生积极影响。\n例如，多年来，参与度一直是数字健康应用程序的主要障碍，设计师们仍在研究防止用户流失的最佳方法，甚至无法辨别哪些参与度指标是治疗成功的最有价值的指标。\n虽然视频游戏制造商在最大化用户参与度的基础上建立了一个完整的行业，但皮奇福德指出，他和他的同龄人受益于一个相对低风险的环境，可以在其中试验和开发最佳实践。\n随着医疗行业开始越来越深入地涉足新技术，他鼓励数字健康利益相关者将互动娱乐视为测试实验室，并与游戏设计师合作，了解哪些方法将对患者最成功。\n他说：电子游戏的好处之一是，我们可以在模拟、人工智能、用户界面等前沿领域冒险；而在我们最糟糕的一天，我们所能做的最糟糕的事情就是不能完全按照他们的喜好招待他们。\n这为我们提供了一个有趣的机会，让我们在风险较低的地方更快地冒险，并在此过程中发现有效的解决方案。由于数百万游戏玩家已经敲击了一个系统，它可以应用于更重要的现实世界的努力。\n这是非常令人兴奋的事情，我们刚刚开始挖掘潜力，通过数字互动娱乐和我们必须在现实世界中克服的重要挑战之间越来越好的合作，潜力可以被释放出来。“", "note_en": "Back in April, Borderlands 3 – a big budget, role-playing first-person shooter videogame that sold over 8 million copies within six months of its release – received a free update that introduced a new mini-game to its players.\n Taking the form of a retro-style arcade cabinet in the home base&#39;s medical bay, &#34;Borderlands Science&#34; has players shifting colored blocks between rows and columns to solve puzzles. Their successes are rewarded with in-game currency, which players can then use to better combat the aliens, mercenaries, machines and space cultists of the main game.\n But Borderlands Science has a bit more than high-score calculations going on under the hood. The colored blocks and puzzles that it&#39;s serving players each represent nucleotides and fragments of microbial 16S ribosomal RNA gene sequences, all of which were collected from human stool samples contributed to and sequenced by an open research platform called the  American Gut Project.\n Rather, Borderlands Science&#39;s true goal is to help artificial intelligence iron out errors when organizing and analyzing those sequences en masse. By compiling the millions of matches that players are making, and then feeding them into a sequencing algorithm, the project aims to build a higher-quality body of data that researchers could someday use to develop novel health or wellness treatments.\n &#34;At first glance, the match between user base and scientific problem seems unlikely. The fast-paced, first-person shooter-looter game filled with dark humor is primarily designed for gamers seeking adventure and action,&#34; wrote contributors on the project from McGill University, videogame science company Massively Multiplayer Online Science (MMOS) and Borderlands 3 developer Gearbox Studios in a recent   nature biotechnology correspondence.\n &#34;But what could be a dead end turns out to be the strength of this initiative. A deployment in the Borderlands universe offers an opportunity to reach a public not particularly exposed to science, while at the same time it opens the door to a large and strong online community of players who can carry and amplify the impact of this initiative,&#34; they wrote.\n Now nearly half a year in, Gearbox founder and CEO Randy Pitchford and MMOS cofounder and head of research and business development Attila Szantner tell  MobiHealthNews that the output of Borderlands Science has far outstripped that of previous crowdsourced videogame research projects.\n Not only have 1.6 million different players solved at least a single task, each completed an average of nearly 40 puzzles for a collective total of 63.2 million total puzzles solved – a stark increase in engagement over the 350,000-plus players and the five-task average logged by its predecessor, a standalone puzzle game called  Phylo, over 10 years.\n “I consider Borderlands Science a milestone project,&#34; Szantner told  MobiHealthNews. &#34;We have proven before that such integration works beautifully in a game where both the player community and ... the game are science oriented. Borderlands Science has proven that a citizen science feature in a mainstream shooter/looter with a diverse audience can be super successful, can bring enormous value to the game, and can be an empowering and fun experience to players, all while substantially contributing to scientific research.&#34;\n  Borderlands Science benefits from a long heritage of citizen science projects, some of which embraced gamification design approaches to achieve their research goals, the team wrote in  nature biotechnology.\n These include  Foldit, a puzzle game launched in 2008 to predict protein 3D structure;  Stall Catchers, which has had participants review videos of mouse brain vessels to accelerate Alzheimer&#39;s disease research since 2016; and the aforementioned  Phylo, developed by McGill researchers to map mammalian genes associated with diseases.\n Other citizen science projects didn&#39;t ask much of their players, but instead require the hardware inside their game consoles.\n “I remember using ‘ Folding@Home’ on my PlayStation 3 and it inspired me,&#34; Pitchford told  MobiHealthNews. &#34;It was a non-interactive experience, basically crowd sourcing the computing power when the machines&#39; owners were not using them, but it was not harnessing the brain power of the players themselves. When Attila came to me with his vision for tapping into the creativity and problem-solving ability of gamers, I got very animated and excited to help move the needle further.”\n Szantner and MMOS&#39;s prior take on a citizen science research videogame was  Project Discovery, which aimed to classify a large body of fluorescence microscopy images. Unlike other programs, Project Discovery was not released as a standalone game, but deployed within the sci-fi massive multiplayer online role-playing game Eve Online.\n Project Discovery enrolled more than 300,000 people to participate, and saw an average engagement of more than 100 tasks completed per person. The team attributed that success to two major factors: the hundreds of thousands of active players who log into Eve Online every month, and the &#34;more mature&#34; demographic of its niche player base. (Eve Online&#39;s appeal is the simulation of a live economy with commodity trading and player-run corporations, and has a reputation among players as &#34; spreadsheets in space.&#34;)\n  To expand upon this success, MMOS&#39;s next project would need to greatly increase the number of people exposed to a citizen science game by deploying within a more mainstream franchise. The challenge was doing so while maintaining engagement rates closer to Project Discovery than to Phylo.\n &#34;Although crowdsourced science projects in the past utilized gamification and even stand-alone mobile games that were built around solving scientific problems, our innovation was to take these citizen science tasks and integrate them with already existing major videogames and create seamless gaming experience,&#34; Szantner said. &#34;This is a huge difference. Nobody has ever done it before, and so we were in uncharted territory.\n &#34;When doing such an integration, it is of utmost importance that this mini-game inside the larger game universe feels like an integral part of the experience. This is one way to ensure that we are not breaking immersion.&#34;\n Much of this immersion factor comes down to how the team chose to present Borderlands Science to its players, Szantner and Pitchford explained.\n For starters, the mini-game is recorded in the player&#39;s journal as an optional quest provided by a scientist character who already plays a key role in the franchise&#39;s narrative. Once players interact with the flashy arcade machine, Gearbox introduces Borderlands Science&#39;s gameplay and real-world goals through  an introductory video with a script that matches the cheeky and comedic tone of the franchise.\n As for Borderlands Science itself, its artwork features the faces of Borderlands 3&#39;s protagonists and other franchise iconography, and is stylized with sounds, colors and image fidelity to match the 1980s arcade machine it&#39;s evoking.\n This focus on player immersion is nothing new for the commercial videogame industry, which has spent years hammering out new technologies and best practices to help gamers lose themselves in a virtual world, Pitchford said. But, in a way, the design team was working against itself, since Borderlands Science also needed to compete with the shooting, driving and loot-hunting action of the main game.\n With the goal of having at least 10% of the Borderlands 3 audience touch the mini-game in any capacity, the team again fell back on videogame industry staples: the loud, colorful arcade cabinet designs that for decades have separated players from their pocket change, and the promise of in-game boosters and cosmetic character outfits which have become more commonplace over the last several years.\n Motivating players to try Borderlands Science for the first time was by far the biggest engagement hurdle for the project, Pitchford said. Once players got their hands on the colored blocks, he said, he had no doubt his designers could deliver a puzzle game that was worth replaying.\n “With Borderlands Science, a lot of emphasis was placed on the design being, well, fun and engaging in its own right,&#34; Pitchford said. &#34;It was important that the game itself was not a chore, but something that was stimulating and gratifying to interact with in and of itself. When success in this objective was combined with a deep integration with the themes, context and characters of the main Borderlands game, our customers embraced it.”\n  Parallel to the design challenges of Borderlands Science were the internal roadblocks that come with justifying any major project within a commercial organization. The development cost of Borderlands Science &#34;was nontrivial&#34; for Gearbox, and Pitchford said that he doesn&#39;t envision these types of projects directly driving profit through biopharma research partnerships or similar avenues.\n &#34;There was always a lot of friction against the commitment of time and energy from a commercial responsibility point of view,&#34; Pitchford said.\n Instead, he advised those working at non-research commercial entities to be flexible on the scope and focus of any potential health research projects they may pursue, with Szantner adding that it&#39;s vital to win over internal leaders or champions who can push these projects along. But for the videogame or entertainment industry in particular, Pitchford and Szantner said that the strongest commercial argument for these projects is the unique value they can add to the final product.\n For instance, early on the team discussed whether or not to present Borderlands Science as a straightforward mini-game to players with no mention of its research goals, but quickly decided that this sort of Trojan Horse approach would be a mistake. By being upfront about the project&#39;s scope, playing the game can become more rewarding and enjoyable for those interested in contributing their time to health research – a valuable bonus for those selling a videogame.\n &#34;The results have demonstrated that there is value to this kind of effort, not merely on the merits of the scientific value, but also on the commercial value,&#34; Pitchford said. &#34;The fact that some of you reading these words today may not have heard about Borderlands before and will consider buying Borderlands 3 because of Borderlands Science creates a commercial case for other developers and publishers to put some of their energy toward efforts that have a good social component attached to them.”\n That kind of value-add is only effective if the experience doesn&#39;t impose on the paying customer&#39;s entertainment experience, Pitchford warned. Here, he gave the example of attending a live stage performance, where following the entertainment some actors may walk around the crowd with a donation bin. Although charitable and often accepted, the reality is that the audience has already received the entertainment it paid for and is now being pressed for contributions, he said.\n However, when that charitable request is instead incorporated into the entertainment in a way that is immersive and doesn&#39;t dilute the product, the entertainer is able to maintain their strong relationship with the paying audience – which for a videogame developer means that players will continue to purchase and engage with their releases.\n “I think one of the reasons why Borderlands Science succeeds is because if players had no idea that the game they were playing was solving real-world scientific problems with sequencing microbial DNA, they would still be entertained by the experience and relate to how it is presented in the context of the larger Borderlands universe,&#34; Pitchford said. &#34;I think caring for the interest of the customer must be a key component to success with integrating citizen science projects with commercial videogames.&#34;\n  Like other crowdsourced science projects before it, Borderlands Science taps the community to perform specific tasks at a massive scale. Since launch, its players have contributed each day what would be the equivalent of 10,000 to 15,000 hours of manual work. But even Borderlands 3&#39;s player base is only a fraction of the total market – according to the Entertainment Software Association, the videogame industry&#39;s largest trade association,  more than 164 million adults in the U.S. alone spend their time completing challenges that rely on critical thinking and puzzle-solving skills.\n For Szantner, leaving all of that unused computational power off the table is a missed opportunity for researchers.\n “As people spend more and more time in the virtual worlds of videogames it is imperative that we find new ways to extract as much value from this time as possible,&#34; Szantner said. &#34;I believe that we are only at the beginning of this journey, but what is certain is that the value is there.&#34;\n What&#39;s more, this population may be especially primed for this type of work, Pitchford said. Players are already accustomed to receiving new instructions via gameplay tutorials and quickly applying their training to the problems ahead of them. Further, many boot up a videogame specifically seeking to tackle and overcome mentally taxing challenges, and receive gratification upon completing a task.\n That type of flexibility and drive may deliver tangible benefits for experts mapping the human gut microbiome – or potentially other areas of research wrangling large quantities of data.\n “My dream is that more and more games integrate citizen science into their projects, and that the collective skill and creativity of the billions of videogame players around the world can be pressed into the service of helping our species overcome some real-world scientific hurdles we are facing on the cutting edge of medicine, physics, engineering, climate, space exploration, and many other critical areas of focus,&#34; Pitchford said.\n &#34;As great as it will be to see actual work completed in Borderlands Science contributing to a real-world medical breakthrough, I think I would be just as happy with the idea of some other game having been inspired by Borderlands Science making the leap for us.&#34;\n In addition to the data output of Borderlands Science, Pitchford hoped that the design considerations of the project and commercial videogames at large could be a positive influence on the budding field of health and medical software.\n Engagement, for instance,  has been a major obstacle for digital health apps over the years, with designers still hammering out the best ways to prevent user attrition, or  even discern which engagement metrics are the most valuable indicators of therapeutic success.\n While videogame makers have built an entire industry out of maximizing user engagement, Pitchford noted that he and his peers have benefitted from a relatively low-stakes environment in which to experiment and develop best practices.\n As the healthcare industry begins to wade deeper and deeper into novel technologies, he encourages digital health stakeholders to think of interactive entertainment as a test lab and work with game designers to understand what approaches will be the most successful for patients.\n &#34;One of the beauties of videogames is that we can take risks on the cutting edge of simulation, artificial intelligence, user interface and so on; and on our very worst day, the worst we can do is not quite entertain someone as much as they like,&#34; he said.\n &#34;This affords us an interesting opportunity to take risks faster where the stakes are lower and along the way make discoveries of solutions that work. With the rigor of millions of gamers already having banged on a system, it can be applied to more consequential real-world endeavors.\n &#34;It’s very exciting stuff, and we’re just getting started on the potential that can be unlocked through better and better collaborations between digital interactive entertainment and the people tackling important challenges we must overcome in the real-world.”", "posttime": "2020-10-27 06:18:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,微生物,millions", "title": "“边疆3”利用数百万游戏玩家绘制人类肠道微生物群图", "title_en": "Borderlands 3 using millions of gamers to map the human gut microbiome", "transed": 1, "url": "https://www.mobihealthnews.com/news/borderlands-3-using-its-millions-gamers-help-map-human-gut-microbiome?mc_cid=479bdaf50c&mc_eid=6adb095f5e", "via": "", "real_tags": ["游戏", "微生物", "millions"]}, {"category": "", "categoryclass": "", "imagename": "07d95e1cf4374e14da63c4669947663b.jpg", "infoid": 1031329, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在今年早些时候仅在欧洲推出中端OnePlus Nord之后，OnePlus终于带着OnePlus Nord N10 5G将一款更便宜的手机带到了美国。不过，它看起来不太像最初的诺德(Nord)那样的扣篮，而且对于一家从未在媒体图片上大肆宣扬的公司来说，感觉就像我们正在这里安顿下来。\nOnePlus表示，这款手机即将登陆美国，但它只提供了329英镑(427美元)的英国标价。为此，你会得到一个90 Hz，6.49英寸，2400×1080的LCD-是的，一个LCD而不是一个OLED显示屏-一个骁龙690 SoC，6 GB的RAM，128 GB的UFS 2.1存储空间，以及一个4300mAh的电池。\n骁龙690是一款相当新的八核高通SoC，拥有两个Cortex A77内核，六个Cortex A55内核，以及一个基于8 nm工艺的全新Adreno 619。高通(Qualcomm)的中端芯片阵容现在有点乱七八糟，你必须真的拆开卡尺，才能发现欧洲北部的骁龙690和骁龙765G之间的显著差异。与765G上的A76相比，690拥有较新的A77主CPU内核，但690的时钟要低200 MHz。在基准测试中，新的CPU和GPU数字基本上是轻而易举的，但7纳米765G应该会比你的电池轻一点。高通将690与一堆高通型号点对接，因为它不支持mmWave 5G，但当大多数765G手机也选择不支持mmWave时，这似乎无关紧要。带有mmWave支持的骁龙765G听起来像是对这款芯片的一个足够接近的速记描述。", "note_en": "After the Europe-only launch of the midrange  OnePlus Nord earlier this year, OnePlus is finally bringing a cheaper phone to the United States with the  OnePlus Nord N10 5G. It doesn&#39;t quite look like the slam dunk the original Nord was, though, and for a company that has &#34;never settle&#34; emblazoned across its press images, it kinda feels like we&#39;re settling here.\n OnePlus says the phone is coming to the US, but it only provided a UK price tag of 329 pounds ($427). For that, you get a 90Hz, 6.49-inch, 2400×1080 LCD—yes, an LCD and not an OLED display—a Snapdragon 690 SoC, 6GB of RAM, 128GB of UFS 2.1 storage, and a 4300mAh battery.\n The Snapdragon 690 is a fairly new eight-core Qualcomm SoC with two Cortex A77 cores, six Cortex A55 cores, and an Adreno 619 built on an 8nm process. Qualcomm&#39;s midrange chip lineup is kind of a mess right now, and you&#39;d have to really break out the calipers to find significant differences between the Snapdragon 690 and the Snapdragon 765G on the European Nord. The 690 has a newer A77 main CPU core compared to the A76 on the 765G, but the 690 has a 200mHz lower clock. In benchmarks, the CPU and GPU numbers are  basically a wash, but the 7nm 765G should be a bit lighter on your battery. Qualcomm docks the 690 a bunch of Qualcomm Model Number Points because it does not support mmWave 5G, but that seems irrelevant when most 765G phones opt to not support mmWave either. &#34;The Snapdragon 765G with mmWave support sliced off&#34; sounds like a close-enough shorthand description for this chip.", "posttime": "2020-10-27 06:01:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,oneplus,高通", "title": "OnePlus希望美国客户能满足于OnePlus Nord N10", "title_en": "OnePlus hopes US customers will settle for the OnePlus Nord N10", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/10/oneplus-hopes-us-customers-will-settle-for-the-oneplus-nord-n10/", "via": "", "real_tags": ["美国", "oneplus", "高通"]}, {"category": "", "categoryclass": "", "imagename": "b28dec60b5d26ec72e61ce7e3d741b75.jpg", "infoid": 1031328, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "德克萨斯州一个学区上周宣布，SpaceX已同意在2021年初为该学区的45个家庭提供互联网服务，并在晚些时候向另外90个家庭提供互联网服务。位于敖德萨的埃克托县独立学区(ECISD)宣布，这将是第一个利用SpaceX卫星为学生提供互联网的学区。\n该地区表示，该项目最初将为埃克托县南部欢乐农场地区的45个家庭提供免费互联网服务。随着网络能力的持续增长，它将扩展到为另外90个埃克托县家庭提供服务。\n得克萨斯州的地点值得注意，因为正在进行的有限的Starlink测试版只存在于美国北部，SpaceX首席执行官埃隆·马斯克表示，即将到来的公开测试版只会在美国北部和加拿大南部进行。SpaceX在轨道上有700多颗Starlink卫星，随着它部署更多被授权发射的近1.2万颗卫星，它将能够扩大服务区域。在华盛顿州，Starlink已经部署到农村家庭、一个偏远的部落，以及野火灾区的应急人员和家庭。\nECISD的公告称，这项服务将于2021年初开始，但没有透露具体时间，但“敖德萨美国人报”(The Odessa American)的一篇文章称，将于明年1月开始。据“敖德萨美国人报”(The Odessa American)报道，该项目总成本为30万美元，其中一半由面向学区领导人的非营利组织Chiefs for Change提供。报道称，入选的家庭将免费获得一年的互联网服务。\n目前还不清楚这笔钱是否会流向SpaceX。学区有一些费用，因为它计划确定[谁将得到服务]的家庭，并促进向这些家庭运送必要的设备。\n在美国南部更广泛的Starlink可用性的时间表仍然未知。我们询问SpaceX是否计划在2021年初在南方的任何其他地点部署Starlink，并询问更多关于何时在全美提供服务的细节。如果我们得到更多信息，我们将更新这篇文章。\n2019年8月，SpaceX详细介绍了一项计划，即每次发射60颗卫星，SpaceX将把卫星部署在三个不同的轨道平面上，而不是只有一个轨道平面上，从而加快卫星部署过程，覆盖更广泛的服务区域。当时，SpaceX告诉FCC，这一变化可能会让它在2020年末在美国南部部署宽带。\n正如ECISD指出的那样，这场流行病证明了家庭互联网对学生的重要性，这些学生在没有面对面课程的情况下不得不在家学习和完成作业。孩子们坐在学校、图书馆和麦当劳门店外使用Wi-Fi的故事令人失望，要么是因为他们的家人负担不起宽带费用，要么是因为他们居住的地方没有宽带。\n欧洲教育、科学及文化权利委员会的公告称，去年春天新冠肺炎强制关闭校舍时，它确实让埃克托县的数字鸿沟成为人们关注的焦点。当ECISD领导人对教师、学生和家庭进行调查时，他们发现大约39%的家庭没有互联网接入。SpaceX Starlink卫星技术将为目前无法或负担不起接入类型的地区提供高速、低延迟的宽带互联网。", "note_en": "SpaceX has agreed to provide Internet service to 45 families in a Texas school district in early 2021 and to an additional 90 families later on, the school district  announced last week. The announcement by Ector County Independent School District (ECISD) in Odessa said it will be the &#34;first school district to utilize SpaceX satellites to provide Internet for students.&#34;\n &#34;The project will initially provide free Internet service to 45 families in the Pleasant Farms area of south Ector County,&#34; the district said. &#34;As the network capabilities continue to grow, it will expand to serve an additional 90 Ector County families.&#34;\n The Texas location is notable because the ongoing, limited Starlink beta exists only in the northern US, and SpaceX CEO Elon Musk has  said an upcoming public beta will only be for the northern US and &#34;hopefully&#34; southern Canada. SpaceX has over 700 Starlink satellites in orbit, and will be able to expand the service area as it deploys more of the  nearly 12,000 it has been authorized to launch. In Washington state, Starlink has been deployed to rural homes, a  remote tribe, and emergency responders and families in  wildfire-stricken areas.\n The ECISD announcement said the service will begin &#34;early in 2021&#34; without saying exactly when, but an  article by the Odessa American newspaper said it will be in January. The total project cost is $300,000, half of which is being provided by Chiefs for Change, a nonprofit group for school-district leaders, according to the Odessa American. Families who are selected will get Internet service for free for one year, the report said.\n It&#39;s not clear whether any of the money is going to SpaceX. The school district has some costs, as it plans to &#34;identify the families [who will get service] and facilitate delivery of the necessary equipment to those homes.&#34;\n  The timeline for wider Starlink availability in the American South is still unknown. We asked SpaceX if it plans to deploy Starlink in any other Southern locations in early 2021, and for more details on when service will be available across the United States. We&#39;ll update this article if we get more information.\n In August 2019, SpaceX detailed a plan in which each SpaceX launch of 60 satellites would deploy the satellites in &#34;three different orbital planes&#34; instead of just one, &#34;accelerating the process of deploying satellites covering a wider service area.&#34; At the time, SpaceX told the FCC this change would &#34;potentially&#34; let it deploy broadband in the Southern United States in late 2020.\n As ECISD pointed out, the pandemic has demonstrated the importance of home Internet for students who have to learn and complete assignments from home when in-person classes are unavailable. Stories of children sitting outside  schools,  libraries, and McDonald&#39;s stores to use Wi-Fi, either because their families cannot afford broadband or it simply isn&#39;t available where they live, have been disappointingly common.\n &#34;When COVID-19 forced the closure of school buildings last spring, it really brought to the forefront just how large the digital divide is in Ector County,&#34; the ECISD announcement said. &#34;As ECISD leaders dove into surveys of teachers, students, and families, they found some 39 percent of families have limited to no Internet access. The SpaceX Starlink satellite technology will provide high-speed, low-latency broadband Internet to an area where that type of access is not currently available or affordable.&#34;", "posttime": "2020-10-27 06:01:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "starlink,家庭", "title": "SpaceX Starlink计划在德克萨斯州首次南下部署", "title_en": "SpaceX Starlink to go South for first time with planned deployment in Texas", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/10/spacex-starlink-bringing-free-internet-to-some-texas-kids-in-early-2021/", "via": "", "real_tags": ["starlink", "家庭"]}, {"category": "", "categoryclass": "", "imagename": "b0ec5e885c5997e3c62040740792162b.jpg", "infoid": 1031327, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在美国唱片工业协会(Record Industry Association Of America)提出索赔后，用于存档YouTube视频的流行工具youtube-dl已从GitHub中消失，理由是根据版权法，该代码本质上是非法的。\n微软旗下的GitHub周五删除了18个项目，这些项目之前托管了YouTube-dl的版本，YouTube-dl是一个允许下载YouTube视频和音频文件的Python库。这些资料库现在显示一条消息显示，由于DMCA关闭通知，此资料库当前处于禁用状态。我们已禁用对存储库的公共访问。&#34；\n尽管这份通知被框定为DMCA问题，但上周五来自RIAA的下架通知并没有声称youtube-dl是侵犯版权的行为。相反，它声称代码本身违反了美国版权法(以及德国版权法)的另一节，因为本源代码的明确目的是…。规避YouTube等授权流媒体服务使用的技术保护措施，并[在未经授权的情况下]复制和分发我们成员公司拥有的音乐视频和录音。\nRIAA的通知特别引用了YouTube-dl文档和源代码中提供的三个例子，这些例子提到了Icona Pop、Justin Timberlake和Taylor Swift的受版权保护的音乐视频-他们都是RIAA成员品牌的代表-以支持这一说法。\nRIAA认为youtube-dl作为纯流媒体视频的技术变通方案存在是没有错的，如果声称没有人使用它来帮助自己不合法地收听音乐-人们绝对会这样做-这是一个谎言。但是，youtube-dl并不像RIAA声称的那样，完全是为此目的而设计的。活动家、历史学家和内容创建者也将该工具广泛用于有效的归档目的。", "note_en": "A popular tool used for archiving YouTube videos, YouTube-dl, is gone from GitHub after the Recording Industry Association of America filed a claim arguing that the code is inherently illegal under copyright law.\n GitHub, which is owned by Microsoft, removed 18 projects on Friday that previously hosted versions of YouTube-dl, a Python library that allows for the downloading of YouTube video and audio files. Those repositories now display a message reading, &#34;This repository is currently disabled due to a DMCA takedown notice. We have disabled public access to the repository.&#34;\n Although the notice is framed as a DMCA issue, the  takedown notice from the RIAA, dated Friday, does not make claim that YouTube-dl is an act of copyright infringement. Instead, it alleges that the code itself is a violation of a different section of Us copyright law (as well as German copyright law), because the &#34;clear purpose of this source code is to... circumvent the technological protection measures used by authorized streaming services such as YouTube, and [to] reproduce and distribute music videos and sound recordings owned by our member companies without authorization for such use.&#34;\n The RIAA notice specifically cites three examples provided in YouTube-dl documentation and source code that make reference to copyrighted music videos by Icona Pop, Justin Timberlake, and Taylor Swift—all of whom are represented by RIAA-member labels—to back up the claim.\n  The RIAA is not wrong that YouTube-dl exists as a technological workaround for streaming-only video, and it would be a lie to claim that nobody uses it for helping themselves less-than-lawfully to music tracks—people absolutely do. But YouTube-dl is not solely designed for that purpose, as the RIAA alleges. Activists, historians, and  content creators widely use the tool for valid archival purposes as well.", "posttime": "2020-10-27 05:59:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "youtube,github,下载,启动,boots", "title": "RIAA声明后，GitHub启动流行的YouTube下载工具", "title_en": "GitHub boots popular YouTube download tool after RIAA claim", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/10/github-boots-popular-youtube-download-tool-after-riaa-claim/", "via": "", "real_tags": ["youtube", "github", "下载", "启动", "boots"]}, {"category": "", "categoryclass": "", "imagename": "0180ac0ea76338b19757f074690144d9.jpg", "infoid": 1031326, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尽管它靠近一颗非常蓝色的行星，但地球的月球似乎完全干燥，阿波罗任务返回的样本几乎没有水。但近年来，一些研究发现了月球上某些地方似乎有水存在，尽管证据并不总是决定性的。\n今天，美国国家航空航天局宣布，它已经使用空中天文台在意想不到的地方发现了清晰的水迹象。但水的形式可能会使获取它变得更加困难。另外，对水可能更容易到达的地点的分析表明，潜在的水库比我们之前怀疑的要多。\n在没有大气层和低重力的情况下，月球不能附着在其表面的水上。当阳光第一次加热月球水时，它会形成水蒸气，最终逃逸到太空中。但月球上的一些区域，主要是靠近两极的区域，是永久性的阴影。那里的气温一直很低，冰可以无限期存活。而且，为了测试这种可能性，美国宇航局在月球南极附近的一个阴暗区域撞毁了一些硬件，并在碎片中发现了水蒸气。\n事实上，从月球其他地方释放出来的水在逃逸到太空之前可以在那里凝结，可能会形成越来越多的冰。由于水将通过撞击小行星和彗星物质来输送，这很可能是一个持续的过程。\n但我们不会指望这种情况会发生在任何暴露在阳光下的地区。在那里，任何水都应该被加热到足以将其驱动到大气中，这就解释了为什么从阿波罗任务返回的样本显示几乎没有水。\n但数据中存在一定的模糊性。研究表明，存在一些类水物质，但不能区分水和一些矿物中可能存在的羟基(OH)。所以，我们不太确定我们在那里看到的是什么。\n为了弄清这一点，美国宇航局求助于一个红外天文台，称它卡在一架747的后端，侧面挖了一个洞。747被称为红外天文平流层天文台(SOFIA)，它将硬件带到了大部分大气层的上空。从那里，能够愉快地吸收一些索非亚上的望远镜设计来观察的红外光的分子要少得多。\n索非亚的一台仪器对6微米范围内的波长很敏感(索非亚望远镜(FORCAST)的暗物红外相机)。这是至关重要的，因为虽然水可以在这个波长吸收和释放，但羟基不能。所以，这里检测到的任何东西都肯定是水。\n研究人员观察了月球的两个区域，一个是赤道区域，另一个是靠近极点的区域。这使得他们可以使用赤道地区作为对照，那里阳光更充足，因此不太可能有水。极地地区，更有可能含有水，是实验。它有一个清晰而强烈的信号，与水相对应。几乎所有成像的区域都看到了重要性在2西格玛之间的水信号，其中20%的区域超过了4西格玛。(对于月球，该仪器可以解析1.5x5公里的表面斑块。)。\n这篇新论文的作者估计，月球物质中的水丰度在每克100到400微克之间。然而，在一次新闻发布会上，NASA决定通过混合单位来给出一个可接近的值：它相当于每立方米月球材料平均含有12盎司瓶装水。\n这很奇怪。该地区看到的阳光应该足以使任何水迅速被煮熟。水怎么还在那里？\n作者的建议--目前这只是一种假设--是水已经被装在玻璃里了。与其想象一个12盎司的玻璃瓶，你更应该想到的是由撞击形成的杂乱无章的材料。对月球的一些影响将来自含水的材料，这些水将因撞击而蒸发。一些岩石和其他材料也会这样，尽管它们很快就会凝结成液体。当这种岩石液体冷却形成无序的玻璃状固体时，它会捕获一些水蒸气。\n一旦被困在一些玻璃岩石中，这些水将不会受到加热和冷却循环的影响，而这些循环通常会将水从月球表面赶回，这就是为什么它一直停留在月球表面阳光充足的地方。\n这也意味着到达水面将会困难得多。关于未来月球活动的许多想法都涉及到在月球表面收集水。但是，如果取水需要磨碎细小的玻璃颗粒，麻烦可能要大得多。\n但同样，人们对月球水的关注并不在阳光充足的地区。取而代之的是，重点放在阴凉处可能会让水凝结成冰的地方。这就是第二篇论文的用武之地；它基本上列出了月球上所有可能的地点，这些地点足够冷，可以让冰保持稳定。我们的意思是所有的，甚至深入到考虑可能会产生小到一厘米的阴暗区域的粗糙表面。", "note_en": "Despite its proximity to a very blue planet, the Earth&#39;s Moon appeared to be completely dry, with samples returned by the Apollo missions being nearly devoid of water. But in recent years, a number of studies have turned up what appears to be water in some locations on the Moon, although the evidence wasn&#39;t always decisive.\n Today, NASA is announcing that it has used an airborne observatory to spot clear indications of water in unexpected places. But the water may be in a form that makes accessing it much harder. Separately, an analysis of spots where water could be easier to reach indicates that there&#39;s more potential reservoirs than we&#39;d previously suspected.\n  With no atmosphere and low gravity, the Moon can&#39;t hang on to water on its surface. The first time that sunlight heats lunar water up, it will form a vapor and eventually escape into space. But there are regions on the Moon, primarily near the poles, that are permanently shadowed. There, temperatures remain perpetually low, and ice can survive indefinitely. And, to test this possibility, NASA  crashed some hardware into a shady area near the Moon&#39;s south pole and found water vapor amidst the debris.\n In fact, water liberated from elsewhere on the Moon can condense there before it escapes into space, potentially creating a growing pile of ice. Since water is going to be delivered by impacts with asteroids and cometary material, it&#39;s likely that this is an ongoing process.\n But we wouldn&#39;t expect this to be happening in any areas exposed to sunlight. There, any water should be heated enough to drive it into the atmosphere, which would explain why samples returned from the Apollo missions show little water.\n But there was a certain ambiguity in the data. Studies had indicated that some water-like material was present but couldn&#39;t differentiate between water and a hydroxyl group (OH), which could exist in some minerals. So, we weren&#39;t really sure what we were seeing there.\n To figure this out, NASA turned to an infrared observatory that it&#39;s stuck in the back-end of a 747 with a hole cut out of the side. Known as the Stratospheric Observatory for Infrared Astronomy or SOFIA, the 747 brings the hardware up above much of the atmosphere. From there, there are far fewer molecules that would happily absorb some of the infrared light that the telescopes on SOFIA are designed to observe.\n One of SOFIA&#39;s instruments is sensitive to wavelengths in the area of six micrometers (the Faint Object infraRed CAmera for the SOFIA Telescope, or FORCAST). And that&#39;s critical because, while water can absorb and emit at this wavelength, hydroxyl groups cannot. So, anything detected here is definitively water.\n  The researchers looked at two regions of the Moon, one equatorial and one near a pole. This allowed them to use the equatorial site, which gets more sunlight and is therefore less likely to have water, as a control. The polar region, more likely to contain water, was the experimental. And it had a clear, strong signal corresponding to water. Nearly all of the areas imaged saw the water signal with a significance of anywhere from two sigma, and 20 percent of them exceeded four sigma. (For the Moon, the instrument could resolve patches of surface that are 1.5 x 5km.)\n The authors of the new paper estimate the abundance of water as ranging from 100 to 400 micrograms per gram of lunar material. In a press conference, however, NASA decided to give an approachable value by mixing units: it&#39;s the equivalent of each cubic meter of Moon material having a 12 ounce bottle of water in it, on average.\n And this is weird. The sunlight the area sees should be enough to cause any water to be cooked off rapidly. How is the water still there?\n The authors&#39; proposal—and it&#39;s just a hypothesis at this point—is that the water has been encased in glass. Rather than envisioning a literal 12 ounce glass bottle, you should be thinking of the disordered material that&#39;s formed by impacts. Some of the impacts on the Moon will come from water-containing materials, and that water will be vaporized by the impact. As will some of the rock and other materials, although they&#39;ll condense back to liquid quickly. As that rocky liquid cools off to form a disordered, glassy solid, it&#39;ll trap some of the water vapor.\n Once trapped inside some glassy rock, the water will be impervious to the heating and cooling cycles that would normally drive the water back off the Moon&#39;s surface, which is why it&#39;s persisting at a sunny site on the lunar surface.\n It also means that getting at the water will be a lot harder. Plenty of ideas about future lunar activities involve gathering water on the surface. But, if getting the water involves grinding down tiny pellets of glass, it may be significantly more trouble.\n  But again, the focus on lunar water hasn&#39;t been in the sunny regions. Instead, the focus has been on the sites where shade might allow water to condense and form ice. And that&#39;s where the second paper comes in; it basically makes a catalog of all the potential sites on the Moon that are cold enough for ice to remain stable. And we mean  all, even going down to considering rough surfaces that may create shady regions as small as one centimeter.", "posttime": "2020-10-27 05:59:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "位置,locations,月球", "title": "在月球上的新位置发现的水可能被困在玻璃中", "title_en": "Water found in new locations on the Moon, may be trapped in glass", "transed": 1, "url": "https://arstechnica.com/science/2020/10/water-found-in-new-locations-on-the-moon-may-be-trapped-in-glass/", "via": "", "real_tags": ["位置", "locations", "月球"]}, {"category": "", "categoryclass": "", "imagename": "e6cdf65a0b7a4ae61a7a978da5ba8e7e.jpg", "infoid": 1031325, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据菲利普·普尔曼(Philip Pullman)的经典奇幻三部曲改编的BBC/HBO版“黑暗材料”(His Dark Material)在第一季收到了褒贬不一的评价，尽管在我们2019年的年终电视综述中，它仍然值得一提。第二季将于下个月首播。HBO在7月份的虚拟圣地亚哥动漫展(San Diego Comic-Con@Home)期间丢掉了第一个S2预告片，并在8月份推出了第二个更长的预告片。现在BBC发布了另一款预告片，其中包括一段简短的特写，演员们的采访和一些幕后的酷炫一瞥。\n正如我们之前写过的，普尔曼系列中的三本书分别是“黄金指南针”(在英国以北极光出版)、“微妙的刀”和“琥珀望远镜”。他们讲述了一个名叫莱拉的12岁女孩的冒险故事，她生活在大约维多利亚时代的英国牛津的虚构版本中。每个人都有一个动物形式的守护神--他们精神的一部分驻留在身体之外--天琴座的名字叫潘塔莱蒙(Pantalaimon)。莱拉发现了一个险恶的阴谋，这让她踏上了寻找父亲的旅程，希望能挫败这一阴谋。这段旅程把她带到了不同的维度(虚构的世界是一个多元宇宙)，并最终走向了她自己的成熟。\n第一季主要报道了黄金罗盘的事件，尽管它也包括了微妙的刀子中的人物和事件。最值得注意的是，S1介绍了威尔·帕里(阿米尔·威尔逊饰)这个角色，他和一个在逃的天琴座(达芙妮·基恩饰)交了朋友，并拥有一把名义上的刀，可以切断宇宙之间的窗帘。\n在S1大结局中，莱拉终于找到了她的父亲，阿斯利尔勋爵(詹姆斯·麦卡沃伊饰)，但当他牺牲了她最好的朋友罗杰时，她感到恐惧。在这个过程中，他切断了这个男孩与他的守护神的联系，并杀死了他-所有这些都是为了引导足够的能量来在多元宇宙的世界之间打开一座桥梁，从而进一步推进他的研究。莱拉跟随阿斯瑞尔勋爵穿过多元宇宙之桥前往另一个世界，就像威尔自己找到进入那个世界的方式一样。", "note_en": "His Dark Materials, the BBC/HBO adaptation of Philip Pullman&#39;s classic fantasy trilogy, received mixed reviews for its first season, although it still warranted an  honorable mention in our 2019 year-end TV roundup. The second season debuts next month. HBO  dropped the first S2 trailer in July during the virtual San Diego Comic-Con@Home and a  second longer one in August. Now BBC has released yet another trailer that includes a short featurette, with cast interviews and some cool glimpses behind the scenes.\n  As  we&#39;ve written previously, the  three books in Pullman&#39;s series are  The Golden Compass (published as  Northern Lights in the UK),  The Subtle Knife, and  The Amber Spyglass. They follow the adventures of a 12-year-old girl named Lyra, who lives in a fictional version of Oxford, England, circa the Victorian era. Everyone has a companion daemon in the form of an animal—part of their spirit that resides outside the body—and Lyra&#39;s is named Pantalaimon. Lyra uncovers a sinister plot that sends her on a journey to find her father in hopes of foiling said plot. That journey takes her to different dimensions (the fictional world is a multiverse) and ultimately to her own coming of age.\n The first season mostly covered the events of  The Golden Compass, although it also included characters and events from  The Subtle Knife. Most notably, S1 introduced the character of Will Parry (Amir Wilson), who befriends an on-the-run Lyra (Dafne Keen) and has possession of the titular knife, which can cut the curtain between universes.\n In the S1 finale, Lyra finally finds her father, Lord Asriel (James McAvoy), but she is horrified when he sacrifices her best friend, Roger. In the process, he severs the boy from his daemon and kills him—all to channel enough energy to open a bridge between the worlds of the multiverse, thereby furthering his research. Lyra follows Lord Asriel across the multiverse bridge to another world, just as Will finds his own way into that same world.", "posttime": "2020-10-27 05:58:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "s2,drops,bbc", "title": "BBC为即将上映的HIS黑暗材料S2删除了新的预告片和特写", "title_en": "BBC drops new trailer and featurette for the upcoming His Dark Materials S2", "transed": 1, "url": "https://arstechnica.com/gaming/2020/10/bbc-drops-new-trailer-and-featurette-for-the-upcoming-his-dark-materials-s2/", "via": "", "real_tags": ["s2", "drops", "bbc"]}, {"category": "", "categoryclass": "", "imagename": "ea8426382fb09a61c2b2a4e97e7bcc70.jpg", "infoid": 1031324, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "链接预览是几乎每个聊天和消息应用程序中无处不在的功能，而且有很好的理由。它们通过提供与正在链接的文件相关联的图像和文本，使在线对话变得更容易。\n不幸的是，他们还可能泄露我们的敏感数据，消耗我们有限的带宽，耗尽我们的电池，在一种情况下，还会在聊天中暴露本应是端到端加密的链接。根据周一公布的一项研究，最严重的违规者包括Facebook、Instagram、LinkedIn和Line的信使。稍后会有更多关于这方面的信息。首先，简要讨论预告。\n当发送者在消息中包含链接时，应用程序将显示对话以及链接附带的文本(通常是标题)和图像。它通常看起来像这样：\n要做到这一点，应用程序本身-或应用程序指定的代理-必须访问链接，打开那里的文件，并调查其中有什么。这会使用户遭受攻击。最严重的是那些可以下载恶意软件的人。其他形式的恶意可能会迫使应用程序下载太大的文件，以至于导致应用程序崩溃、耗尽电池或消耗有限的带宽。如果链接指向私人材料-比如，发布到私人OneDrive或Dropbox账户的纳税申报单-应用程序服务器就有机会无限期地查看和存储它。\n周一报告背后的研究人员塔拉尔·哈吉·巴克里(Talal Haj Bakry)和汤米·迈斯克(Tommy Mysk)发现，Facebook Messenger和Instagram是最严重的违规者。如下图所示，这两个应用程序都会下载并复制完整的链接文件--即使它的大小是千兆字节。同样，如果文件是用户想要保密的内容，这可能是一个问题。\n这也是有问题的，因为这些应用程序可能会消耗大量的带宽和电池储备。这两个应用程序还运行链接中包含的任何JavaScript。这是一个问题，因为用户无法检查JavaScript的安全性，也不能期望信使具有现代浏览器所具有的相同的利用漏洞保护。\nLinkedIn的表现仅略好一些。唯一的区别是，它不复制任何大小的文件，只复制前50兆字节。Haj Bakry和Mysk向Facebook报告了他们的发现，该公司表示，这两款应用程序都按预期工作。\n与此同时，当Line应用程序打开加密消息并找到链接时，它似乎会将链接发送到Line服务器以生成预览。Haj Bakry和Mysk写道：“我们认为这违背了端到端加密的目的，因为LINE服务器知道所有通过这款应用发送的链接，以及谁在分享哪些链接给谁。”\nDiscorde、Google Hangout、Slake、Twitter和Zoom也会复制文件，但它们将数据量限制在15MB到50MB之间。下面的图表对研究中的每款应用程序进行了比较。\n总而言之，这项研究是个好消息，因为它表明大多数即时通讯应用程序都在做正确的事情。例如，Signal、Threema、TikTok和微信都给用户提供了不接收链接预览的选项。对于真正敏感的邮件和想要尽可能多隐私的用户，这是最佳设置。即使提供了预览，这些应用程序也使用相对安全的方式来渲染它们。", "note_en": "Link previews are a ubiquitous feature found in just about every chat and messaging app, and with good reason. They make online conversations easier by providing images and text associated with the file that’s being linked.\n Unfortunately, they can also leak our sensitive data, consume our limited bandwidth, drain our batteries, and, in one case, expose links in chats that are supposed to be end-to-end encrypted. Among the worst offenders, according to  research published on Monday, were messengers from Facebook, Instagram, LinkedIn, and Line. More about that shortly. First a brief discussion of previews.\n When a sender includes a link in a message, the app will display the conversation along with text (usually a headline) and images that accompany the link. It usually looks something like this:\n  For this to happen, the app itself—or a proxy designated by the app—has to visit the link, open the file there, and survey what’s in it. This can open users to attacks. The most severe are those that can download malware. Other forms of malice might be forcing an app to download files so big they cause the app to crash, drain batteries, or consume limited amounts of bandwidth. And in the event the link leads to private materials—say, a tax return posted to a private OneDrive or DropBox account—the app server has an opportunity to view and store it indefinitely.\n The researchers behind Monday’s report, Talal Haj Bakry and Tommy Mysk, found that Facebook Messenger and Instagram were the worst offenders. As the chart below shows, both apps download and copy a linked file in its entirety—even if it’s gigabytes in size. Again, this may be a concern if the file is something the users want to keep private.\n  It’s also problematic because the apps can consume vast amounts of bandwidth and battery reserves. Both apps also run any JavaScript contained in the link. That’s a problem because users have no way of vetting the security of JavaScript and can’t expect messengers to have the same exploit protections modern browsers have.\n  LinkedIn performed only slightly better. Its only difference was that, rather than copying files of any size, it copied only the first 50 megabytes. Haj Bakry and Mysk reported their findings to Facebook, and the company said that both apps work as intended.\n Meanwhile, when the Line app opens an encrypted message and finds a link, it appears to send the link to the Line server to generate a preview. “We believe that this defeats the purpose of end-to-end encryption, since LINE servers know all about the links that are being sent through the app, and who’s sharing which links to whom,” Haj Bakry and Mysk wrote.\n Discord, Google Hangouts, Slack, Twitter, and Zoom also copy files, but they cap the amount of data at anywhere from 15MB to 50MB. The chart below provides a comparison of each app in the study.\n  All in all, the study is good news because it shows that most messaging apps are doing things right. For instance, Signal, Threema, TikTok, and WeChat all give the users the option of receiving no link preview. For truly sensitive messages and users who want as much privacy as possible, this is the best setting. Even when previews are provided, these apps are using relatively safe means to render them.", "posttime": "2020-10-27 05:57:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "显示,shows,链接", "title": "研究显示哪些信使会泄露您的数据、耗尽您的电池，等等", "title_en": "Study shows which messengers leak your data, drain your battery, and more", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/10/study-shows-which-messengers-leak-your-data-drain-your-battery-and-more/", "via": "", "real_tags": ["显示", "shows", "链接"]}, {"category": "", "categoryclass": "", "imagename": "4b12a88fec8ee37804d0a68f14a28204.png", "infoid": 1031322, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "要使用数据，您需要对其具有访问权限。如果你是银行，那就意味着交易和账户；如果你是零售商，那就意味着库存和供应链等等。在所有这些数据中隐藏着大量的洞察力和可操作的模式，这是数据科学家和他们的同类的工作，把它们提取出来。\n但是，如果您无法访问数据怎么办？毕竟，有许多行业这样做是不被建议的，甚至是非法的，比如医疗保健行业。你不能把整个医院的医疗记录交给一家数据分析公司，然后说“筛选一下，然后告诉我有没有什么好的。”与许多其他数据集一样，这些数据集过于私密或敏感，不允许任何人不受限制地访问。最轻微的错误-更不用说滥用-都可能产生严重的后果。\n然而，近年来出现了一些技术，它们允许做一些更好的事情：分析数据，而不实际暴露数据。这听起来是不可能的，但有一些计算技术可以允许用户在没有实际访问任何数据的情况下对数据进行操作。最广泛使用的是同态加密，不幸的是，它会导致效率大幅下降，降幅达数量级-而大数据都与效率有关。\n这就是DataFleets介入的地方。它并没有重新发明同态加密，而是在某种程度上回避了它。它使用一种称为联合学习的方法，在这种方法中，他们不是将数据带到模型中，而是将模型带到数据中。\nDataFleets集成了私有数据库和想要访问该数据的人之间的安全鸿沟的两端，充当了一个信任代理，在他们之间传输信息，而永远不会泄露一个字节的实际原始数据。\n这里有一个例子。比方说，一家制药公司想要开发一种机器学习模型，该模型可以查看患者的病史，并预测他们使用新药是否会有副作用。医学研究机构的病人数据私人数据库是训练它的最佳选择。但访问受到高度限制。\n这家制药公司的分析师创建了一个机器学习培训计划，并将其放入DataFleets，后者与他们和设施都签订了合同。DataFleets将模型转换为它自己的专有运行时，并将其分发到医疗数据所在的服务器；在这个沙箱环境中，它会成长为一个健壮的年轻ML代理，完成后会将其转换回分析师首选的格式或平台。分析师从来没有看到过实际数据，但却拥有这些数据的所有好处。\n这很简单，对吧？DataFleet充当平台之间的一种受信任的信使，代表其他人进行分析，从不保留或传输任何敏感数据。\n很多人都在考虑联合学习；困难的部分是为范围广泛的企业级服务构建基础设施。您需要涵盖大量的用例，接受大量的语言、平台和技术，当然，所有这些都要完全安全地完成。\nDataFleets首席运营官兼联合创始人尼克·埃利奇说：“我们为拥有政策管理、身份访问管理和我们即将通过的SOC 2认证的企业准备情况感到自豪。“你可以在DataFleet的基础上构建任何东西，然后插入你自己的工具，银行和医院会告诉你以前的隐私软件不是这样的。”\n但是，一旦联合学习建立起来，突然之间，好处是巨大的。例如，当今抗击新冠肺炎的一大问题是，世界各地的医院、卫生部门和其他组织尽管愿意，但在安全共享与病毒有关的数据方面存在困难。\n每个人都想分享，但是谁送谁什么，放在哪里，谁的权力和责任？用旧的方法，这是一团混乱的东西。对于同态加密，它很有用，但速度很慢。有了联合学习，理论上，它就像切换某人的访问权限一样简单。\n因为数据永远不会离开它的“家”，这种方法本质上是匿名的，因此高度符合HIPAA和GDPR等法规，这是另一个重大优势。Elledge指出：“我们正在被领先的医疗机构使用，他们认识到HIPAA在向第三方提供数据集时没有给予他们足够的保护。”\n当然，在其他行业也有不那么高尚但同样可行的例子：无线运营商可以在不出卖个人的情况下提供订户元数据；银行可以出售消费者数据，而不会特别侵犯任何人的隐私；像视频这样的海量数据集可以原地踏步，而不是以高昂的费用复制和维护。\n该公司450万美元的种子期融资似乎证明了来自各种投资者的信心(埃利奇总结道)：AME Cloud Ventures(雅虎的杨致远)和Morado Ventures、LightSpeed Venture Partners、彼得森风险投资公司(Peterson Ventures)、马克·库班、LG、马蒂·查韦斯(哈佛大学监事会主席)、斯坦福-StartX基金(Stanford-StartX Fund)，以及三位独角兽创始人(Rppi、Quora和Lucid)。\nDataFleets只有11名全职员工，似乎用很少的钱做了很多事情，而种子轮应该会使其旗舰产品迅速扩大和成熟。“我们不得不拒绝或推迟新的客户需求，以专注于我们与灯塔客户的工作，”埃莱奇说。他们将在美国和欧洲招聘工程师，帮助他们在明年推出计划中的自助服务产品。\n埃利奇说：“我们正在从数据所有权转向数据访问经济，在这种经济中，信息可以在不转移所有权的情况下发挥作用。”如果他的公司的赌注是对的，联合学习很可能是未来的一大部分。", "note_en": "To work with data, you need to have access to it. If you’re a bank, that means transactions and accounts; if you’re a retailer, that means inventories and supply chains, and so on. There are lots of insights and actionable patterns buried in all that data, and it’s the job of data scientists and their ilk to draw them out.\n But what if you  can’t access the data? After all, there are many industries where it is not advised or even illegal to do so, such as in healthcare. You can’t exactly take a whole hospital’s medical records, give them to a data analysis firm, and say “sift through that and tell me if there’s anything good.” These, like many other data sets, are too private or sensitive to allow  anyone unfettered access. The slightest mistake — let alone abuse — could have serious repercussions.\n   In recent years a few technologies have emerged that allow for something better, though: analyzing data without ever actually exposing it. It sounds impossible, but there are computational techniques for allowing data to be manipulated without the user ever actually having access to any of it. The most widely used one is called homomorphic encryption, which unfortunately produces an enormous, orders-of-magnitude reduction in efficiency — and big data is all about efficiency.\n This is where  DataFleets   steps in. It hasn’t reinvented homomorphic encryption, but has sort of sidestepped it. It uses an approach called federated learning, where instead of bringing the data to the model, they bring the model to the data.\n DataFleets integrates with both sides of a secure gap between a private database and people who want to access that data, acting as a trusted agent to shuttle information between them without ever disclosing a single byte of actual raw data.\n  Here’s an example. Say a pharmaceutical company wants to develop a machine-learning model that looks at a patient’s history and predicts whether they’ll have side effects with a new drug. A medical research facility’s private database of patient data is the perfect thing to train it. But access is highly restricted.\n The pharma company’s analyst creates a machine-learning training program and drops it into DataFleets, which contracts with both them and the facility. DataFleets translates the model to its own proprietary runtime and distributes it to the servers where the medical data resides; within that sandboxed environment, it grows into a strapping young ML agent, which when finished is translated back into the analyst’s preferred format or platform. The analyst never sees the actual data, but has all the benefits of it.\n  It’s simple enough, right? DataFleets acts as a sort of trusted messenger between the platforms, undertaking the analysis on behalf of others and never retaining or transferring any sensitive data.\n Plenty of folks are looking into federated learning; the hard part is building out the infrastructure for a wide-ranging enterprise-level service. You need to cover a huge amount of use cases and accept an enormous variety of languages, platforms and techniques, and of course do it all totally securely.\n “We pride ourselves on enterprise readiness, with policy management, identity-access management, and our pending SOC 2 certification,” said DataFleets COO and co-founder Nick Elledge. “You can build anything on top of DataFleets and plug in your own tools, which banks and hospitals will tell you was not true of prior privacy software.”\n But once federated learning is set up, all of a sudden the benefits are enormous. For instance, one of the big issues today in combating COVID-19 is that hospitals, health authorities, and other organizations around the world are having difficulty, despite their willingness, in securely sharing data relating to the virus.\n Everyone wants to share, but who sends whom what, where is it kept, and under whose authority and liability? With old methods, it’s a confusing mess. With homomorphic encryption it’s useful but slow. With federated learning, theoretically, it’s as easy as toggling someone’s access.\n  Because the data never leaves its “home,” this approach is essentially anonymous and thus highly compliant with regulations like HIPAA and GDPR, another big advantage. Elledge notes: “We’re being used by leading healthcare institutions who recognize that HIPAA doesn’t give them enough protection when they are making a data set available for third parties.”\n Of course there are less noble, but no less viable, examples in other industries: Wireless carriers could make subscriber metadata available without selling out individuals; banks could sell consumer data without violating anyone in particular’s privacy; bulky datasets like video can sit where they are instead of being duplicated and maintained at great expense.\n The company’s $4.5 million seed round is seemingly evidence of confidence from a variety of investors (as summarized by Elledge): AME Cloud Ventures (Jerry Yang of Yahoo) and Morado Ventures, Lightspeed Venture Partners, Peterson Ventures, Mark Cuban, LG, Marty Chavez (president of the board of overseers of Harvard), Stanford-StartX fund, and three unicorn founders (Rappi, Quora and Lucid).\n With only 11 full-time employees DataFleets appears to be doing a lot with very little, and the seed round should enable rapid scaling and maturation of its flagship product. “We’ve had to turn away or postpone new customer demand to focus on our work with our lighthouse customers,” Elledge said. They’ll be hiring engineers in the U.S. and Europe to help launch the planned self-service product next year.\n “We’re moving from a data ownership to a data access economy, where information can be useful without transferring ownership,” said Elledge. If his company’s bet is on target, federated learning is likely to be a big part of that going forward.", "posttime": "2020-10-27 05:50:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "联合,private,数据", "title": "\nDataFleets通过联合学习和450万美元的种子使私人数据保持有用和有用的数据私有", "title_en": "\n\t\t\t\tDataFleets keeps private data useful and useful data private with federated learning and $4.5M seed\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/26/datafleets-keeps-private-data-useful-and-useful-data-private-with-federated-learning-and-4-5m-seed/", "via": "", "real_tags": ["联合", "private", "数据"]}, {"category": "", "categoryclass": "", "imagename": "8e5633bbbc72edbb057876e46ec838fb.jpg", "infoid": 1031321, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "FreshWorks CRM本质上是该公司FreshSales服务的重新命名，结合了该公司Freshmarketer营销自动化工具的能力。\nFreshWorks的一位发言人告诉我：“FreshWorks CRM将FreshSales和Freshmarketer的能力统一到一个解决方案中，它利用一个嵌入式客户数据平台，在客户整个旅程中提供前所未有的360度视角。”\n这里的承诺是，得益于该公司的Neo平台提供的统一视图和聚合数据，这一改进的CRM解决方案能够为团队提供对其(潜在)客户的更全面的了解，这要归功于该公司的Neo平台提供的统一视图和聚合数据。\n该公司辩称，大多数CRM用户很快就会对他们选择的CRM服务感到幻灭-原因是数据很差。这就是FreshWorks认为它可以发挥作用的地方。\nFreshWorks CRM公司首席产品官普拉卡什·拉马穆尔蒂(Prakash Ramamurthy)说：“FreshWorks CRM兑现了CRM最初的承诺：一个单一的解决方案，它结合了人工智能驱动的数据、洞察力和智能，并将客户放在业务目标的前沿和中心。”我们建立FreshWorks CRM是为了利用数据的力量，创造立竿见影的价值，挑战传统的CRM解决方案，这些解决方案让销售团队无法使用笨重的界面和不完整的数据。“。\n这里的想法是在单个仪表板中为团队提供所有营销和销售数据，并向他们提供人工智能辅助的洞察力，以帮助推动他们的决策，这反过来应该会带来更好的客户体验-以及更多的销售。该服务提供预测性潜在客户评分和资格，基于用户可根据其需求定制的大量信号，以及Slake和团队集成、带有呼叫录音的内置电话功能以联系潜在客户等。其中很多功能也已经在FreshSales中提供了。\n“在线教育面临的挑战是‘完成率’。为了增加这一点，我们需要了解学生参加课程的‘为什么’方面，并设计‘什么’和‘如何’来满足我们学生的个性化需求，以便他们能够实现他们的个人目标，“邵氏商学院首席分析官马姆努恩·哈迪·汗(Mamnoon Hadi Khan)说。有了FreshWorks CRM，邵氏学院可以跟踪整个学生客户之旅，通过我们专门的学生成功经理更好地与他们打交道，并利用人工智能来个性化他们的学习体验-实现他们的目标。“。\nFreshWorks CRM的起步价为每用户29美元/月，具有更高级功能的完整企业计划的价格最高可达每用户/月125美元。", "note_en": "Freshworks    CRM   is essentially a rebrand of the company’s Freshsales service, combined with the company’s capabilities of its Freshmarketer marketing automation tool.\n “Freshworks CRM unites Freshsales and Freshmarketer capabilities into one solution, which leverages an embedded customer data platform for an unprecedented and 360-degree view of the customer throughout their entire journey,” a company spokesperson told me.\n   The promise here is that this improved CRM solution is able to provide teams with a more complete view of their (potential) customers thanks to the unified view — and aggregated data — that the company’s Neo platform provides.\n The company argues that the majority of CRM users quickly become disillusioned with their CRM service of choice — and the reason for that is because the data is poor. That’s where Freshworks thinks it can make a difference.\n “ Freshworks CRM delivers upon the original promise of CRM: a single solution that combines AI-driven data, insights and intelligence and puts the customer front and center of business goals,” said Prakash Ramamurthy, the company’s chief product officer. “We built  Freshworks CRM to harness the power of data and create immediate value, challenging legacy CRM solutions that have failed sales teams with clunky interfaces and incomplete data.”\n The idea here is to provide teams with all of their marketing and sales data in a single dashboard and provide AI-assisted insights to them to help drive their decision making, which in turn should lead to a better customer experience — and more sales. The service offers predictive lead scoring and qualification, based on a host of signals users can customize to their needs, as well as Slack and Teams integrations, built-in telephony with call recording to reach out to prospects  and more. A lot of these features were already available in Freshsales, too.\n “The challenge for online education is the ‘completion rate’. To increase this, we need to understand the ‘Why’ aspect for a student to attend a course and design ‘What’ &amp; ‘How’ to meet the personalized needs of our students so they can achieve their individual goals,” said Mamnoon Hadi Khan, the chief analytics officer at Shaw Academy. “With Freshworks CRM, Shaw Academy can track the entire student customer journey to better engage with them through our dedicated Student Success Managers and leverage AI to personalize their learning experience — meeting their objectives.”\n Pricing for Freshworks CRM starts at $29 per user/month and goes up to $125 per user/month for the full enterprise plan with more advanced features.", "posttime": "2020-10-27 05:50:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "crm,launches", "title": "\nFreshWorks(重新)推出CRM服务", "title_en": "\n\t\t\t\tFreshworks (re-)launches its CRM service\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/26/freshworks-re-launches-its-crm-service/", "via": "", "real_tags": ["crm", "launches"]}, {"category": "", "categoryclass": "", "imagename": "5870bfd5b6f6d821dcd1e79d6982613a.jpg", "infoid": 1031320, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "考德贝克说，他是在CircleUp收购了投资者的公司之后写这封信的，因为他想提供建设性的反馈，因为他向这位身份保密的人解释说，这个人的参与“对CircleUp的所有人和我们的董事会来说都非常困难”。\n这一传奇故事提出了一些问题，比如初创企业的幕后情况，以及具体的董事会组成。但考德贝克的情况可能更反常，一些业内资深人士表示，他们对如何避免有问题的董事会成员，以及如果他们无法避免如何处理他们有常识的建议。\n斯坦福大学商学院(Stanford‘s Business School)教授、捷蓝航空(JetBlue Airways)前董事长、盐湖城彼得森合伙公司(Peterson Partners)创始合伙人乔尔·彼得森(Joel Peterson)表示，首先，也是最明显的是，尽可能多地了解潜在的董事会成员，因为谁最终成为公司的董事，可能是一个“改变人生的决定”，无论是好的还是坏的。彼得森合伙公司是一家总部位于盐湖城的公司，直接投资于初创公司，并持有许多风险基金的股份。\n彼得森的建议是，“就像投资者在面试你一样采访他们”，不仅要了解某人是否知识渊博，是否与你有相同的价值观，还要了解他们在你的公司里有多少时间。在他看来，风险投资家“往往是最糟糕的董事会成员，而天使投资者往往真的很棒，因为他们真的很关心创业者，而且在发展业务的过程中，他们与创业者的联系更亲力亲为。”", "note_en": "According to Caldbeck, he wrote the letter after  CircleUp   had bought out the investor’s firm because he wanted to provide constructive feedback, given that this individual’s “involvement was incredibly difficult for all of CircleUp and our board,” as he explained to this person, whose identity was shielded.\n The saga begged questions about what happens behind the scenes at startups and about board composition specifically. But Caldbeck’s situation may be more anomalous than not, suggest some veterans of the industry who have common sense advice around how to avoid problematic board members and how to deal with them if they can’t be avoided.\n First, and most obviously, get to know a potential board member as well as possible because who winds up as a director with your company can be a “life-changing decision” in both good and terrible ways, says  Joel Peterson,   a professor at Stanford’s business school, a former chairman of JetBlue Airways and the founding partner of Peterson Partners, a Salt Lake City-based firm that invests directly in startups and has stakes in many venture funds.\n Peterson’s advice is to “interview investors just as they’re interviewing you,” including not only to get a sense for whether someone is knowledgeable and shares your same values but also to get a sense for how much time they have for your company. In his view, venture capitalists are “often the worst board members while angel investors are often really good because they really care about the entrepreneur and have a more hands-on connection with them while they’re developing the business.”", "posttime": "2020-10-27 05:50:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "成员,bad", "title": "\n好的董事会成员和坏的董事会成员(以及如何处理他们)", "title_en": "\n\t\t\t\tGood and bad board members (and what to do about them)\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/26/good-and-bad-board-members-and-what-to-do-about-them/", "via": "", "real_tags": ["成员", "bad"]}, {"category": "", "categoryclass": "", "imagename": "9e1195344d7cb95f8c65afa89f0bcbd7.jpg", "infoid": 1031319, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的一周里，我们首次公布了TC会议的议程：太空。这是我们的首届活动，重点是太空初创企业和相关技术，将于12月16日和17日举行。当然，这完全是虚拟的，好消息是，这意味着你可以从世界任何地方轻松参加。\n我们有一个令人惊叹的阵容，包括我们经常在这里报道的新闻人物。NASA局长吉姆·布里登斯廷(Jim Bridenstine)以及美国太空部队指挥办公室杰伊·雷蒙德(Jay Raymond)和火箭实验室首席执行官彼得·贝克(Peter Beck)将出席，仅举几例。门票现已售出，请尽快报名以获得最优惠的价格。\nSpaceX上周为其宽带互联网服务发射了不是一枚，而是两枚独立的猎鹰9号火箭，火箭上装载着Starlink卫星。第一枚于10月19日发射升空，仅仅五天后，另一批满员进入轨道。SpaceX现在已经推出了近1000个这样的服务，它肯定非常接近启动面向消费者的互联网服务的公开测试版。\n美国国家航空航天局(NASA)成功地从一颗小行星表面采集了样本，这对该机构来说是第一次。样本收集来自NASA的OSIRIS-REX机器人探测探测器，该探测器是由合作伙伴洛克希德·马丁公司制造的。奥西里斯-霸王龙在收集样本的小行星本努仍有一些工作要做，但明年它将开始带着它的珍贵货物返回，供地球上的科学家研究。\n美国国家航空航天局(NASA)本周有很多特别的发现--从事索非亚成像项目的科学家证实，月球表面存在暴露在阳光下的水。他们曾怀疑它就在那里，但这是第一个被证实的证据，虽然它不是很大的水，但它仍然可能改变人类深空探索的未来。\n微软似乎已经准备好通过Azure Space在太空业务上进行大规模投资，Azure Space是微软成立的一个新业务部门，负责处理与其云数据努力相关的所有空间相关业务。这包括一种新型的可部署移动数据中心，该数据中心将部分通过SpaceX的Starlink全球宽带网络连接，以可扩展的方式将计算能力放在接近所需的位置。\n英特尔已经在一颗小卫星上安装了一款高能效的EDGE AI处理器，即其Myriad 2视觉处理单元。这将帮助卫星对它获取的地球图像进行自己的星载分类，为它传回给地面研究人员的图像节省关键带宽。本地人工智能可以帮助卫星网络总体上更有效地运行，但作为一个领域，它仍处于初级阶段。\n相对论空间在3D打印火箭方面前景看好，但它实际上还没有达到发射阶段。然而，它确实获得了一份关键的政府合同，洛克希德·马丁公司为即将到来的为NASA测试流体管理系统的任务选择了火箭。", "note_en": "This past week, we unveiled the agenda for  TC Sessions: Space for the first time. It’s our inaugural event focused on space startups and related technologies, and it’s happening December 16 and 17. It’s entirely virtual, of course, and the good news is that means you can attend easily from anywhere in the world.\n We’ve got an amazing lineup, including newsmakers we regularly cover here.  NASA   Administrator Jim Bridenstine will be there, as well as U.S. Space Force commanding office Jay Raymond, and Rocket Lab CEO Peter Beck, to name just a few.  Tickets are available now, so sign up ASAP to get the best price possible.\n   SpaceX launched not one, but two separate Falcon 9 rockets loaded with Starlink satellites for its broadband internet service last week. The first took off on October 19, then just five days later, another full complement reached orbit.  SpaceX   has now launched nearly 1,000 of these, and it must be getting awfully close to kicking off its public beta of the consumer-facing internet service.\n   NASA has managed to collect a sample from the surface of an asteroid in a first for the agency. The sample collection came courtesy of NASA’s OSIRIS-REx robotic exploration probe, which was built by partner Lockheed Martin. OSIRIS-REx still has some work to do at Bennu, the asteroid from which it collected the sample, but next year it’ll begin heading back with its precious cargo intended for study by scientists here on Earth.\n  NASA is full of special discoveries this week — scientists working on its SOFIA imaging project confirmed the presence of water on the surface of the moon that’s exposed to sunlight. They’d suspected it was there, but this is the first confirmed proof, and while it isn’t a whole lot of water, it could still change the future of human deep space exploration.\n    Microsoft looks primed to invest in space-based business in a big way with Azure Space, a new business unit it formed to handle all space-related businesses attached to its cloud data efforts. That includes a new type of deployable mobile data center that will be connected in part via SpaceX’s Starlink global broadband network, putting computing power near where it’s needed in a scalable way.\n  Intel has loaded up a small satellite with a power-efficient edge AI processor, its Myriad 2 Vision Processing Unit. That’ll help the satellite do its own on-board classification of images of Earth that it takes, saving key bandwidth for what it transfers back to researchers on the ground. Local AI could help satellite networks in general operate much more efficiently, but it’s still in its infancy as a field.\n    Relativity Space has tons of promise in terms of its 3D-printed rockets, but it still hasn’t actually reached the launch stage. It did however secure a key government contract, with Lockheed Martin selecting its rocket for a forthcoming mission to test fluid management systems for NASA.", "posttime": "2020-10-27 05:50:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nasa,太空", "title": "\nMax Q：NASA为未来的深空探测做出关键发现", "title_en": "\n\t\t\t\tMax Q: NASA makes key discovery for future of deep space exploration\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/26/max-q-nasa-makes-key-discovery-for-future-of-deep-space-exploration/", "via": "", "real_tags": ["nasa", "太空"]}, {"category": "", "categoryclass": "", "imagename": "4cfa0e698d4f0a1b7c20a7b7ae88a35d.png", "infoid": 1031318, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "其中一个通知警告用户，他们可能会遇到关于邮寄投票的误导性信息，而另一个通知则试图通过警告美国选举结果可能会推迟来阻止与在线选举相关的混乱。\n在一场选举中，推迟结果是非常有可能的结果，因为选举中的选票将比以往任何时候通过邮件投出的选票都多。各州对邮寄选票何时开始计票有不同的规定，这使得官方结果可能确实需要时间才能陆续公布-这种情况提前正常化是明智的。\n这些提示会将用户引导到Twitter朋友圈，这些朋友圈收集了这两个话题的权威信息。这些通知还会在相关术语和标签的搜索中弹出。\n社交媒体公司争先恐后地为自己的平台做好准备，以应对在日益恶化的国家健康危机中，一场极具争议的美国大选带来的独特挑战。虽然这些努力好坏参半--有些是薄弱的，有些是更有力的--向每个人提供主动的、吸引眼球的通知，这与Twitter和Facebook上贴在虚假声明上的容易被遗漏的错误信息“标签”相比，是迈出了坚实的一步。", "note_en": "One notice warns users that they “might encounter misleading information” about mail-in voting while the other attempts to head off online election-related chaos by cautioning that the results of the U.S. election may be delayed.\n Delayed results are a very possible outcome in an election that will see more ballots than ever cast through the mail. States have differing rules about when mailed ballots can begin to be tallied, making it possible that official results may indeed take time to trickle in — a situation that it’s wise to normalize in advance.\n   The prompts will point users to Twitter Moments that collect authoritative information on both topics. The notices will also pop up in searches of relevant terms and hashtags.\n Social media companies have scrambled to ready their platforms for the unique challenges of a deeply contentious U.S. election in the midst of a worsening national health crisis. While those efforts have been mixed — some weak, some  more robust — serving proactive, attention-grabbing notices to everyone is a solid step up from the  easy-to-miss misinformation “labels” that get tacked onto false claims across Twitter and Facebook.", "posttime": "2020-10-27 05:50:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推特,美国,starts,标签", "title": "\n推特开始向所有美国用户显示选举错误信息警告", "title_en": "\n\t\t\t\tTwitter starts showing all US users election misinformation warnings\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/26/twitter-notification-voting-by-mail-delayed-election-results/", "via": "", "real_tags": ["推特", "美国", "starts", "标签"]}, {"category": "", "categoryclass": "", "imagename": "df3a809853b924ec3cd7be20e48311ed.jpg", "infoid": 1031317, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自成立以来，这两位联合创始人一直致力于自己创业的卑微忙碌-包括每周往返于旧金山和达拉斯之间，参加第19届500创业公司(第19 500 Startups)，或者参加Y Combinator的团契计划。\n现在，有了230万美元的种子期融资和谷歌为Startups Black Founders Fund提供的另一笔非稀释现金赠款，这家处于早期阶段的公司已经准备好扩张。\n这两位联合创始人当然有美容行业的血统。泰·考德威尔一直是业界的佼佼者，也是职业美容协会顾问委员会的当选成员。他和考特尼一起在达拉斯经营着一家获奖沙龙。\n与此同时，考特尼·考德威尔(Courtney Caldwell)在甲骨文的技术营销部门工作了20多年。但这两个人并没有真正接触过风险投资行业。因此，当他们提出在沙龙和造型师之间提供在线撮合服务的想法时-基于他们自己在沙龙填满椅子的需要-他们真的无处可去。\n输入TD Lowe。作为一名长期独立的投资者，洛威与StartupGrind这样的组织合作，将这对夫妇介绍给了风险投资和初创公司的世界，两人开始了比赛。\n“我们开创了按需理发店和空间租赁的先河，”考特尼说。“如果一家沙龙或理发店有一个开放的车站，发型师就可以像预订酒店房间一样预订它。”\n根据卡尔德威尔夫妇的说法，美容业是自由职业者和独立承包商的第二大行业。与其他公司不同的是，SearShare试图通过向造型师提供独立于沙龙的预订和预约等功能-或者只为沙龙提供服务-不同的是，SearShare试图为市场双方提供所需的工具。\n“我们不是StyleSeat。我们不是乡绅，“考特尼说。他们正在迅速扩张。该公司在600多个城市上市，从佐治亚州租金15美元的椅子到纽约市曼哈顿市中心租金569美元的椅子。\n该公司通过与当地一家名为First American Payments的本地支付解决方案合作，直接为造型师处理付款。德克萨斯州沃思市。\n考特尼说：“每个人都把目光投向了直接面向消费者的产品。”“这是我们帮助人们保住工作岗位，并为个人经济复苏注入动力的一种方式。”\n该公司的下一步是开始为造型师推出更多的辅助服务。他们正在为造型师首创一项保险政策，该政策将为他们提供在职诉讼的保险。\n泰伊说：“这对造型师来说是一个巨大的机会，而这些机会本来就不存在。”他们说，这一切都始于卡尔德威尔夫妇在搜索与理发店租赁空间有关的任何术语时找不到任何选择。“我们联系了一位朋友，告诉她我们得到的机会，她说，‘Guys…’这是一个数十亿美元的想法。‘“。\n这位朋友就是洛-他来为这对夫妇提供建议，并向他们展示创业投资的诀窍。\n这至少是一个价值数千万的想法。这是创业公司梅文(Mayvenn)为发型师提供头发加长和其他化妆品业务筹集的资金。\nSearShare的支持者包括：前体风险投资公司、革命的剩余种子基金崛起、结构资本、后台资本和500Startups，以及新的参与者面包和黄油风险投资公司、ArlanWasHere投资公司(阿兰·汉密尔顿的基金，马克·库班是唯一的有限合伙人)、光速风险合作伙伴童子军计划(由维罗妮卡·华雷斯和杰森·麦克布莱德领导)、达拉斯牛仔队的杰伦·史密斯(通过少数族裔创业研究所)、“芝加哥公牛”的塔迪乌斯·杨和改革风险投资公司、滚石基金、诺特利风险投资公司、萨克斯家庭基金和其他全球投资者。\n这些投资者是新一代投资者中的一员，他们正在推动风险投资进入以前被认为是典型公司无法涉足的领域。\n作为一家美容和生活方式初创公司的首席执行官，朱莉·弗雷德里克森(Julie Fredrickson)三年前告诉TechCrunch，“与类似职位的科技公司相比，这些品牌中的大多数都资金不足。有机会出现一位全新的主导者，但没有人真的在争先恐后地追逐这一机会。“。\n对于服务于美容行业方方面面的企业、企业家和投资者来说，这是一个蓬勃发展的巨大机会。\n弗雷德里克森表示：“随着私募股权和家族理财室越来越多地向下游发展，风险投资正在淘汰自己，因为它们愿意在风险资本没有准备好或教育程度较低的垂直领域寻求风险式的回报。”", "note_en": "Since their launch the two co-founders have been committed to the humble hustle of starting their own business — including flying between San Francisco and Dallas weekly to participate in the 19th 500 Startups cohort or participating in Y Combinator’s Fellowship program.\n Now, with a seed round of $2.3 million and  another non-dilutive cash grant from Google for Startups Black Founders Fund, the early-stage company is ready to expand.\n  The two co-founders certainly have a pedigree in the beauty industry. Tye Caldwell has been a luminary in the industry and is a member-elect of the Professional Beauty Association’s advisory board. Together with Courtney he runs an award-winning salon in Dallas.\n  Meanwhile, Courtney Caldwell spent more than 20 years working for Oracle in technology marketing. But the two hadn’t really been exposed to the venture capital industry. So when they came up with the idea to start a service providing online matchmaking between salons and stylists — based on their own need to fill a chair at their salon — they didn’t really no where to turn.\n Enter  TD Lowe. A longtime investor on her own and with organizations like StartupGrind, Lowe introduced the couple to the world of venture capital and startups, and the two were off to the races.\n “We pioneered on-demand barbershop and space rentals,” Courtney said. “If a salon or barbershop has an open station a stylist can book it like they would a hotel room.”\n According to the Caldwells, the beauty industry is the second largest industry for freelancers and independent contractors. Unlike other companies that are trying to serve stylists by offering them features like booking and appointments independent of salons — or services for salons alone — ShearShare is trying to serve both sides of the marketplace with the tools they need.\n “We’re not a StyleSeat. We’re not a Squire,” said Courtney. What they are is expanding rapidly. The company has listings in more than 600 cities ranging from a chair that rents for $15 in Georgia to one that rents for $569 in the heart of Manhattan in New York City.\n  The company processes payments for the stylists directly through a partnership with a local payment solution called First American Payments based in Ft. Worth, Texas.\n “Everyone is setting their sights on direct-to-consumer,” said Courtney. “This is a way we’re helping to keep people at work and refuel the individual economic recovery.”\n The next step for the company is to begin launching more ancillary services for stylists. They’re pioneering an insurance policy for stylists that would cover them from on-the-job lawsuits.\n “It’s becoming a huge opportunity for the stylist that just didn’t exist,” said Tye. And it all began when the two Caldwells couldn’t find any options when they searched for any terms related to renting space at a barbershop, they said. “We reached out to a friend and told her about the opportunity that we’d been presented with and she said, ‘Guys… that’s a billion-dollar idea.’ ”\n That friend was Lowe — who came in to advise the couple and show them the ropes of startup investing.\n It’s at least an idea that’s worth tens of millions. That’s how  much the startup Mayvenn has raised for its business providing hair extensions and other cosmetics to stylists.\n   ShearShare’s backers include: Precursor Ventures, Revolution’s Rise of the Rest Seed Fund, Structure Capital, Backstage Capital and 500 Startups, alongside new participants Bread and Butter Ventures, ArlanWasHere Investments (Arlan Hamilton’s fund, in which Mark Cuban is the sole LP), Lightspeed Venture Partners Scouts Program (with Veronica Juarez and Jason McBride leading), Jaylon Smith of the Dallas Cowboys through the Minority Entrepreneurship Institute, Thaddeus Young of the Chicago Bulls with Reform Venture, the Bumble Fund, Notley Ventures, Sachse Family Fund and other global investors.\n These investors are part of a new breed of investor that’s pushing venture investment into areas that were previously considered beyond the reach of typical firms.\n As the chief executive of a beauty and lifestyle startup, Julie Fredrickson  told TechCrunch three years ago, “Most of these brands are commensurately underfunded compared to tech companies in similar positions. There’s a chance for a totally new dominant player and no one’s really gunning for it.”\n  There’s a huge opportunity for businesses serving all aspects of the beauty industry to flourish, entrepreneurs and investors.\n “Venture is obsoleting itself as private equity and family offices increasingly go downstream because they’re willing to seek venture-style returns in verticals that venture capital is not prepared or is less educated about,” according to Frederickson.", "posttime": "2020-10-27 05:49:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "联系,shearshare", "title": "\n达拉斯的SearShare有一个市场，将造型师与沙龙的可用座位和230万美元的资金联系起来", "title_en": "\n\t\t\t\tDallas’ ShearShare has a marketplace connecting stylists with available seats at salons and $2.3 million in funding\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/26/dallas-shearshare-has-a-marketplace-connecting-stylists-with-available-seats-at-salons-and-2-3-million-in-funding/", "via": "", "real_tags": ["联系"]}, {"category": "", "categoryclass": "", "imagename": "3d2cb5db5a63a13ecd413f73c3a04617.jpg", "infoid": 1031316, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "世界上可能没有一个机器人教师学院积极从事机器人学习。毕竟，这个领域掌握着释放该行业巨大潜力的关键。让它如此引人注目的一件事是，如此多的研究人员正在采取无数不同的方法来解开帮助机器人从根本上从头开始学习的秘密。\n约翰·霍普金斯大学的一篇新论文探讨了通过正面强化学习的潜力，这篇论文的名字确实令人愉快，名为“好机器人”(Good Robot)。这个名字源于作家安德鲁·亨特(Andrew Hundt)关于教他的狗不要追赶松鼠的轶事。我不会在这里详述这一点-你可以只看这段视频：\n但这个想法的核心是在机器人做正确的事情时给它提供某种形式的激励，而不是在它做错了事情时给它一种抑制。对于机器人来说，激励以评分系统的形式出现-本质上是一种游戏化，在正确执行任务的基础上奖励一些分数。\n这位博士生说，这种方法能够显著减少任务的培训时间。“机器人想要更高的分数，”亨特在一份与研究相关的新闻稿中说。“它很快就学会了正确的行为，以获得最好的回报。事实上，过去机器人需要一个月的练习才能达到100%的准确率。我们在两天内就能做到这一点。“。\n这些任务仍然相当初级，包括堆砌砖块和在视频游戏中导航，但未来的机器人将有希望能够完成更复杂、更有用的现实世界任务。", "note_en": "There likely isn’t a robotics teacher institute in the world actively pursuing robotic learning. The field, after all, holds the key to unlocking a lot of potential for the industry. One of the things that makes it so remarkable is the myriad different approaches so many researchers are taking to unlock the secrets of helping robots essentially learn from scratch.\n A new paper from Johns Hopkins University sporting the admittedly  delightful name “Good Robot” explores the potential of learning through positive reinforcement. The title derives from an anecdote from author Andrew Hundt about teaching his dog to not chase after squirrels. I won’t go into that here — you can just watch this video instead:\n   But the core of the idea is to offer the robot some manner of incentive when it gets something correct, rather than a disincentive when it does something wrong. For robots, incentives come in the form of a scoring system — essentially a kind of gamification that rewards a number of points based on correctly executing a task.\n The PhD candidate says the method was able to reduce the training time of a task significantly. “The robot wants the higher score,” Hundt said in a release tied to the research. “It quickly learns the right behavior to get the best reward. In fact, it used to take a month of practice for the robot to achieve 100% accuracy. We were able to do it in two days.”\n The tasks are still quite elementary, including stacking bricks and navigating through a video game, but there’s hope that future robots will be able to work up to more complex and useful real-world tasks.", "posttime": "2020-10-27 05:49:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "机器人,教学,robots", "title": "\n通过正强化教学机器人", "title_en": "\n\t\t\t\tTeaching robots through positive reinforcement\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/26/teaching-robots-through-positive-reinforcement/", "via": "", "real_tags": ["机器人", "教学", "robots"]}, {"category": "", "categoryclass": "", "imagename": "3bbb102217e65c8d15e92504bf8d8de4.jpg", "infoid": 1031315, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家总部位于纽约的律师事务所为公司提供就业核实筛选服务，以确定员工是否有资格和授权在美国工作。\n在美国运营的每一家公司都被要求保留每一名员工的I-9表格档案，以确保他们在法律上被允许工作，而不受更严格的移民规则的约束。但I-9表格文件可能包含大量敏感信息，包括护照、身份证和驾照等政府文件，以及其他个人身份数据，使它们成为黑客和身份窃贼的目标。\n但该律师事务所表示，上个月发现一个未经授权的第三方访问了一个文件，其中包含“有限数量”谷歌现任和前任员工的个人信息。\n在提交给加州总检察长办公室的一份通知中，弗拉格曼没有说明哪些数据被访问，也没有说明有多少谷歌员工受到了影响。加州居民超过500人受到违规影响的公司必须向州总检察长办公室提交通知。\nFragomen的发言人迈克尔·麦克纳马拉(Michael McNamara)拒绝透露有多少谷歌员工受到了此次入侵的影响。", "note_en": "The New York-based law firm provides companies with employment verification screening services to determine if employees are eligible and authorized to work in the United States.\n Every company operating in the United States is required to maintain a Form I-9 file on every employee to ensure that they are legally allowed to work and not subject to more restrictive immigration rules. But Form I-9 files can contain a ton of sensitive information, including government documents like passports, ID cards and driver’s licenses, and other personally identifiable data, making them a target for hackers and identity thieves.\n But the law firm said it discovered last month that an unauthorized third-party accessed a file containing personal information on a “limited number” of current and former Google employees.\n In  a notice with the California attorney general’s office, Fragomen did not say what kind of data was accessed or how many Google employees were affected. Companies with more than 500 California residents affected by a breach are required to submit a notice with the state’s attorney general’s office.\n Michael McNamara, a spokesperson for Fragomen, declined to say how many Google employees were affected by the breach.", "posttime": "2020-10-27 05:49:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,law,员工", "title": "\n谷歌使用的Fragomen律师事务所确认数据泄露", "title_en": "\n\t\t\t\tFragomen, a law firm used by Google, confirms data breach\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/26/fragomen-data-breach-google-employees/", "via": "", "real_tags": ["google", "谷歌", "law", "员工"]}]