[{"category": "", "categoryclass": "", "imagename": "7c2c2dfab947cefd955a4c4763db5807.jpeg", "infoid": 1028811, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多伦多将通过与Local Motors达成协议，开始试运行自动驾驶班车，该公司的Olli 2.0全电动自动驾驶班车乘客将从2021年春季开始。这项试验是与运输运营公司太平洋西部运输公司(Pacific Western Transportation)合作进行的，试验过程中的每一次乘车都将包括两名全职工作人员，来自该合作伙伴的一名船上操作员，以及来自TTC或Metrolinx的一名客服代表，该公司与多伦多签订了大部分通勤运输服务的合同。\nOlli 2.0车辆一次最多可容纳8人，并包括轮椅坡道和安全点等无障碍功能。它还包括一个AV系统，用于向乘客提供信息和最新消息。如果出于安全考虑或任何其他原因需要，车辆上的安全操作员有能力随时接管手动控制。\n这条试点路线将提供西红山和红山GO站之间的服务，红山GO站是多伦多市区以西的一个社区，位于大多伦多地区的斯卡伯勒社区。它的设计目的是将通勤者连接到该地区主要的轻轨网络之一，用于长途运输。该市表示，根据COVID，目标还是确保自主洗牌保持到当时的任何清洁和卫生标准。\n像这样的最后一英里使用案例一直是城市自动交通的目标，部分原因是它们涉及到旅行一条可预测的重复路线，并以相对较低的速度进行。这最终可能导致使用Olli班车部署更多的服务路线，增加基础设施，将城市的轻轨和地铁系统连接到目前没有被这些主要干线覆盖的城市部分地区。", "note_en": "The city of Toronto is going to start operating autonomous shuttles on a trial basis, through an agreement with Local Motors that will see that company’s Olli 2.0 all-electric self-driving shuttle ferry passengers beginning in Spring 2021. The trial is being conducted with Pacific Western Transportation, a transportation operations company, and each ride over the course of the trial will include two full-time staffers, an operator on board from that partner, as well as a customer service rep from either TTC or Metrolinx, the company Toronto contracts for much of its commuter transportation services.\n The Olli 2.0 vehicle has a passenger capacity of up to eight people at a time, and includes accessibility features like a wheelchair ramp and securing points. It also includes an AV system for providing information and updates to passengers. The safety operator onboard the vehicle has the ability to take over manual control at any time, should the need arise due to safety concerns or for any other reason.\n This pilot route will provide service between West Rouge and Rouge Hill GO station, which is a neighborhood west of the city of Toronto proper in the Greater Toronto Area community of Scarborough. It’s designed to connect commuters to one of the area’s primary light rail networks for longer-distance transportation. The city says that the goal is to also ensure that the autonomous shuffle is maintained up to whatever cleanliness and sanitization standards are in place at the time in light of COVID.\n  Last mile use cases like this have been a target for autonomous transportation in cities, in part because they involve traveling a predictable, repeated route and doing so at relatively low speeds. This could eventually lead to the deployment of more service routes using Olli shuttles, adding infrastructure connecting the city’s light rail and subway systems to parts of the city not covered by those primary arteries right now.", "posttime": "2020-10-15 00:00:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "local,trial", "title": "\n多伦多将在新的试点计划中试验Local Motors的自动穿梭车", "title_en": "\n\t\t\t\tToronto will trial automated shuttles from Local Motors in new pilot program\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/14/toronto-will-trial-automated-shuttles-from-local-motors-in-new-pilot-program/", "via": "", "real_tags": ["local", "trial"]}, {"category": "", "categoryclass": "", "imagename": "161330d566fd6db65f833a674221d623.png", "infoid": 1028810, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "OpenView总部设在波士顿，但在全球投资。由于美国证券交易委员会(SEC)提交给美国证券交易委员会(SEC)的文件，这只4.5亿美元基金的未来存在至少从去年11月就已经知道了。\n该公司的两名合伙人在分别接受TechCrunch采访时告诉TechCrunch，该公司的投资重点不会随着新资本的增加而改变。相反，根据合伙人约翰·麦卡洛的说法，OpenView将继续专注于它所说的“扩展阶段的商业软件”。\n这是一种以商业为重点的软件初创公司的说法，这些公司的年经常性收入在100万美元到1000万美元之间，或ARR。更具体地说，OpenView的麦基·克雷文告诉TechCrunch，大约80%的主要交易是ARR在100万至500万美元之间的公司，其中60%是ARR在100万至300万美元之间的公司。\n鉴于扩张阶段的初创公司收入规模不大，如果OpenView采取同样的战略，为什么它在新基金中筹集的资本比之前的分期付款多得多？\n根据McCullough的说法，该公司计算了它想要进行的投资数量-希望进行15到17次，比之前基金中的13次更多-后续投资所需的资金数量，以及当它必须在全新投资和向现有赢家增加更多资本之间做出选择时，在之前的基金中遇到的一些限制。所有这些加起来就是一个更大的数字。\n这位投资者告诉TechCrunch，OpenView的目标下限为3.5亿美元，该基金的硬上限为4.5亿美元。\n新资本很有趣，但我想更多地了解基金如何看待我一直在关注的科技领域的一些趋势，即API交付的初创公司、无代码/低代码和保险技术。在API方面，克雷文似乎总体上持乐观态度，他表示，近年来“软件企业围绕API作为产品建立起来的机会更大了”，并补充说，由于许多API交付的初创公司倾向于基于使用量的定价，它们也可以推出有吸引力的净留存指标。\n我们还研究了无代码和低代码世界，强调了允许非开发人员进行更大定制的服务和允许创建全新的无编码应用程序的产品之间的区别。尽管两者截然不同，但最终都落在了无代码和低代码的存储桶中。无论如何，销售软件的初创公司是否在构建更多的定制化和灵活性？是的，克雷文说。随着时间的推移，什么被视为无代码功能，什么仅仅是整洁的定制的界限将变得模糊。\n最后，在保险技术的问题上，克雷文表示，由于大多数保险技术世界更多的是金融服务，而不是商业软件，这在很大程度上超出了他们的范围。也许Noyo既可以算作保险技术，也可以算作扩张阶段的商业软件？\nOpenView有大量的新资本来继续运营它的剧本。它并不是市场上唯一一家专注于业务的软件风投。沙斯塔是另一个。还有更多。但是，由于拥有比以往任何时候都多的资本，OpenView已经招致了对其自身、其业绩和新投资的更多审查。让我们看看它把钱用到哪里去了。", "note_en": "OpenView is based in Boston, but invests globally. The $450 million fund’s future existence  has been known since at least November of last year,  thanks to an SEC filing.\n The firm’s investment focus, two of its partners told TechCrunch during separate interviews, is not changing with its new capital. Instead, OpenView will continue to focus on what it calls “expansion stage business software,” according to  partner John McCullough.\n  That’s a way of saying business-focused software startups that have between $1 million and $10 million in annual recurring revenue, or ARR. To be more specific, OpenView’s  Mackey Craven told TechCrunch that around 80% of its lead deals are into companies with $1 million to $5 million in ARR, with 60% going into companies with between $1 million and $3 million in ARR.\n Given that expansion-stage startups are modest in terms of revenue scale, why did OpenView raise so much more capital in its new fund than its prior installments, if it is pursuing the same strategy?\n According to McCullough, the firm ran the math on the number of investments it wanted to make — hoping to make 15 to 17, more than the 13 it did out of its preceding fund — the amount of money it needed for follow-on investing, and some constraints it ran into in prior funds when it had to decide between a net-new investment and adding more capital to an existing winner. All that added up to a larger number.\n The investor told TechCrunch that OpenView had a lower bound target of $350 million, and a hard max of $450 million for the fund.\n  New capital is fun and all, but I wanted to know a bit more concerning how the fund views some trends in the tech space that I’ve tried to keep an eye on, namely  API-delivered startups,  no-code/low-code  and insurtech. On the API front, Craven seemed generally bullish, saying that there has been “greater opportunity for software businesses to be built around an API as a product” in recent years, adding that as many API-delivered startups tend toward usage-based pricing, they can also sport attractive net retention metrics.\n We riffed on the no-code and low-code worlds as well, noodling on the distinctions between services that allow for greater customizations by non-developers and products that allow for the creation of net new applications sans coding. Both wind up landing inside the no-code and low-code buckets despite being rather different. Regardless, are startups that sell software building in more customization and flexibility? Yes, says Craven. Expect the line of what counts as no-code capability and what is merely neat customizations to blur as time passes.\n And, finally, on the insurtech point, Craven indicated that because most of the insurtech world is more financial services than business software, it largely falls outside of their purview. Perhaps  Noyo would count as both insurtech and expansion-stage business software?\n OpenView has lots of new capital to keep running its playbook. It’s not the only business-focused software VC out there.  Shasta’s another. There are more. But with more capital than ever, OpenView has invited more scrutiny onto itself, its results and its new investments. Let’s see where it puts the money to work.", "posttime": "2020-10-14 23:59:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "venture", "title": "\nOpenView Venture Partners为第六只基金募集4.5亿美元，这是迄今为止规模最大的一只基金", "title_en": "\n\t\t\t\tOpenView Venture Partners raises $450M for sixth fund, its largest to date\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/14/openview-venture-partners-raises-450m-for-sixth-fund-its-largest-to-date/", "via": "", "real_tags": ["venture"]}, {"category": "", "categoryclass": "", "imagename": "c7b65e851e5e24db55cdf998c2369cc7.jpg", "infoid": 1028809, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软开发了一种新的图像字幕算法，在某些有限的测试中超过了人类的精确度。AI系统已经被用来更新该公司为视障人士提供的助手应用程序，Seing AI，并将很快被整合到其他微软产品中，如Word，Outlook和PowerPoint。在那里，它将用于创建图像的Alt-Text之类的任务-这一功能对于提高可访问性特别重要。\n微软人工智能团队的软件工程经理萨奇布·谢赫(Saqib Shaikh)在一份新闻声明中表示：“理想情况下，每个人都会在文档、网络和社交媒体上为所有图像添加Alt文本-因为这使得盲人能够访问内容并参与对话。”“但是，遗憾的是，人们不这样做。所以，有几个应用程序使用图像字幕作为替代文本缺失时的填充方式。”\n这些应用程序包括微软自己的Seing AI，该公司于2017年首次发布了这款应用。Seing AI使用计算机视觉为视障人士描述通过智能手机摄像头看到的世界。它可以识别家居用品、阅读和扫描文本、描述场景，甚至可以识别朋友。它还可以用来描述其他应用程序中的图像，包括电子邮件客户端、社交媒体应用程序和WhatsApp等即时通讯应用程序。\n微软没有透露看到人工智能的用户数量，但Azure AI公司副总裁埃里克·博伊德(Eric Boyd)告诉The Verge，这款软件是“针对盲人或视力低下的人的领先应用程序之一。”看见人工智能连续三年被AppleVis评为最佳应用或最佳辅助应用，AppleVis是一个由盲人和低视力iOS用户组成的社区。\n微软新的图像字幕算法将显著提高观看人工智能的性能，因为它不仅能够识别对象，还能够更准确地描述它们之间的关系。因此，算法可以查看图片，不仅可以说它包含什么项目和对象(例如，“一个人、一个椅子、一个手风琴”)，而且可以说它们是如何交互的(例如，“一个人正坐在椅子上演奏手风琴”)。微软表示，该算法是其自2015年开始使用的之前图像字幕系统的两倍。\n该算法在9月份出版的一篇印刷前论文中进行了描述，在被称为“nocaps”的图像字幕基准测试中获得了有史以来最高的分数。这是业界领先的图像字幕记分牌，尽管它有自己的限制。\nNocaps基准由166,000多个人工生成的字幕组成，描述了从Open Images数据集中拍摄的大约15,100张图像。这些图像跨越了一系列场景，从体育到假日快照，再到食物摄影等等。(您可以通过浏览此处的nocaps数据集或查看下面的图库来了解图片和字幕的混合情况。)。算法在为这些图片创建与人类图片相匹配的字幕的能力上进行了测试。\n但是，需要注意的是，nocaps基准测试作为一般任务只捕获了图像字幕复杂性的一小部分。尽管微软在一份新闻稿中声称它的新算法“描述图像和人一样好”，但只有当它适用于nocaps中包含的一小部分图像时才是正确的。\n“在nocaps上超过人的表现并不能说明图像字幕是一个解决问题的指标。”\n正如该基准的创建者之一Harsh Agrawal通过电子邮件告诉The Verge：“在nocaps上超过人类的表现并不能说明图片字幕就是一个解决的问题。”阿加瓦尔指出，用于评估nocaps性能的指标“仅与人的喜好大致相关”，基准本身“只覆盖了所有可能的视觉概念中的一小部分”。\n阿加瓦尔说：“与大多数基准一样，nocaps基准只是模型在这项任务上表现的一个粗略指标。”“在nocaps上超越人类的表现并不意味着人工智能系统在图像理解方面超越人类。”\n这个问题-假设特定基准的性能可以推断为更一般的底层任务性能-在夸大人工智能的能力时是一个常见的问题。事实上，微软过去曾因对其算法理解书面文字的能力做出类似的断言而受到研究人员的批评。\n然而，由于人工智能，图像字幕是一项近年来有了巨大改进的任务，微软的算法肯定是最先进的。除了集成到Word、Outlook和PowerPoint中，图像字幕AI还将通过微软的云和AI平台Azure作为独立模型提供。", "note_en": "Microsoft has developed a new image-captioning algorithm that exceeds human accuracy in certain limited tests. The AI system has been used to update the company’s assistant app for the visually impaired,  Seeing AI, and will soon be incorporated into other Microsoft products like Word, Outlook, and PowerPoint. There, it will be used for tasks like creating alt-text for images — a function that’s particularly important for increasing accessibility.\n “Ideally, everyone would include alt text for all images in documents, on the web, in social media — as this enables people who are blind to access the content and participate in the conversation,” said Saqib Shaikh, a software engineering manager with Microsoft’s AI team in a press statement. “But, alas, people don’t. So, there are several apps that use image captioning as way to fill in alt text when it’s missing.”\n  These apps include Microsoft’s own Seeing AI, which the company  first released in 2017. Seeing AI uses computer vision to describe the world as seen through a smartphone camera for the visually impaired. It can identify household items, read and scan text, describe scenes, and even identify friends. It can also be used to describe images in other apps, including email clients, social media apps, and messaging apps like WhatsApp.\n Microsoft does not disclose user numbers for Seeing AI, but Eric Boyd, corporate vice president of Azure AI, told  The Verge the software is “one of the leading apps for people who are blind or have low vision.” Seeing AI has been voted best app or best assistive app  three years in a row by AppleVis, a community of blind and low-vision iOS users.\n Microsoft’s new image-captioning algorithm will improve the performance of Seeing AI significantly, as it’s able to not only identify objects but also more precisely describe the relationship between them. So, the algorithm can look at a picture and not just say what items and objects it contains (e.g., “a person, a chair, an accordion”) but how they are interacting (e.g., “a person is sitting on a chair and playing an accordion”). Microsoft says the algorithm is twice as good as its previous image-captioning system, in use since 2015.\n The algorithm, which was described in a  pre-print paper published in September, achieved the  highest ever scores on an image-captioning benchmark known as “nocaps.” This is an industry-leading scoreboard for image captioning, though it has its own constraints.\n The nocaps benchmark consists of more than 166,000 human-generated captions describing some 15,100 images taken from the  Open Images Dataset. These images span a range of scenarios, from sports to holiday snaps to food photography and more. (You can get an idea of the mixture of images and captions by exploring the nocaps dataset  here or looking at the gallery below.) Algorithms are tested on their ability to create captions for these pictures that match those from humans.\n  It’s important to note, though, that the nocaps benchmarks capture only a tiny sliver of the complexity of image captioning as a general task. Although Microsoft claims in a  press release that its new algorithm “describes images as well as people do,” this is only true insomuch as it applies to a very small subset of images contained within nocaps.\n “Surpassing human performance on nocaps is not an indicator that image captioning is a solved problem”\n As Harsh Agrawal, one of the creators of the benchmark, told  The Verge over email: “Surpassing human performance on nocaps is not an indicator that image captioning is a solved problem.” Argawal noted that the metrics used to evaluate performance on nocaps “only roughly correlate with human preferences” and that the benchmark itself “only covers a small percentage of all the possible visual concepts.”\n “As with most benchmarks, [the] nocaps benchmark is only a rough indicator of the models’ performance on the task,” said Argawal. “Surpassing human performance on nocaps by no means indicates that AI systems surpass humans on image comprehension.”\n This problem — assuming that performance on a specific benchmark can be extrapolated as performance on the underlying task more generally — is a common one when it comes to exaggerating the ability of AI. Indeed, Microsoft has been  criticized by researchers in the past for making similar claims about its algorithms’ ability to comprehend the written word.\n Nevertheless, image captioning is a task that has seen huge improvements in recent years thanks to artificial intelligence, and Microsoft’s algorithms are certainly state-of-the-art. In addition to being integrated into Word, Outlook, and PowerPoint, the image-captioning AI will also be available as a standalone model via Microsoft’s cloud and AI platform Azure.", "posttime": "2020-10-14 23:58:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,微软,microsoft,ai,details", "title": "微软详细介绍了其新的图片字幕AI，这是Azure的一部分，将改善Word、Outlook和其他应用程序的可访问性", "title_en": "Microsoft details its new image captioning AI, part of Azure, that will improve accessibility for Word, Outlook, and other apps", "transed": 1, "url": "https://www.theverge.com/2020/10/14/21514405/image-captioning-seeing-ai-microsoft-algorithm-word-powerpoint-outlook?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["程序", "微软", "microsoft", "ai", "details"]}, {"category": "", "categoryclass": "", "imagename": "a15c83e7e8abc15a76ac2b5c4fb126b3.png", "infoid": 1028808, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "圣保罗(路透社)-根据周三的一份声明，美国私募股权公司Warburg Pincus LLC已在巴西初创公司Take Bip的首轮融资中投资1亿美元。\nTake Bip是一个沟通平台，帮助公司通过WhatsApp和Facebook Messenger等即时通讯应用与客户互动。\n除了投资于目前的业务外，该公司还计划利用所得资金将业务扩大到美国、欧洲和墨西哥。并购也在这家初创公司的雷达上。\n“归根结底，这是一个巨大的市场。华平(Warburg Pincus)拉丁美洲负责人皮耶罗·米纳尔迪(Piero Minardi)表示：“在不久的将来，每一家公司都必须成为对话互联网的一部分，就像它们在不久的过去不得不推出一个网站一样。”", "note_en": "SAO PAULO (Reuters) - U.S. private equity firm Warburg Pincus LLC has invested $100 million in a series A round in the Brazilian startup Take Blip, according to a statement on Wednesday.\n Take Blip is a communication platform that helps companies engage with clients via messaging apps such as WhatsApp and Facebook Messenger.\n The company plans to use the proceeds to expand its operations to the United States, Europe and Mexico, besides investing in its current business. Mergers and acquisitions are also on the startup’s radar.\n  “Ultimately this is a huge market. In the near future, every single company will have to be part of the conversational internet just as they had to launch a website in the near past,” said Piero Minardi, head of Warburg Pincus in Latin America.", "posttime": "2020-10-14 23:58:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "led", "title": "巴西初创公司Take Bip帮助公司在WhatsApp等即时通讯应用上与客户打交道，以华平(Warburg Pincus)为首的首轮融资1亿美元", "title_en": "Brazilian startup Take Blip, which helps companies engage with customers on messaging apps like WhatsApp, raises $100M Series A led by Warburg Pincus", "transed": 1, "url": "https://www.reuters.com/article/us-warburg-pincs-brazil-take-blip-idUSKBN26S3E9", "via": "", "real_tags": ["led"]}, {"category": "", "categoryclass": "", "imagename": "7d7b73016f19e03b98af08c179bd54bd.png", "infoid": 1028807, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Peter Zaitsev我对数据库的可观测性非常感兴趣，我相信查询性能可观测性是您可以从您的数据库中获得的最重要的洞察力。因为如果您从应用程序开发人员的角度来看，一旦提供了数据库并可以连接到它，那么您基本上只需要从数据库中快速、正确地响应您的查询。这既适用于您在本地部署的数据库，也适用于基于云的DBaaS产品。\nPostgreSQL有一个非常棒的用于捕获查询性能的扩展，名为PG_STAT_STATEMENTS，它捕获了大量查询执行细节；但是，它没有捕获我们想要捕获的所有细节，以便在Percona Monitoring and Management中提供深入的查询性能洞察力。因此，我们开发了一个新的pg_stat_monitor插件，它的设计目标和使用模式略有不同，同时提供了您从pg_stat_Statements中习惯的所有内容，等等。\n此时，pg_stat_monitor作为一个独立于Percona的项目发布，因此我们更容易尝试新的方法和想法。同时，我们非常期待与PostgreSQL社区合作，看看是否有足够的共识将其合并到pg_stat_Statements中。\n时间分组：pg_stat_monitor不是提供一组不断增加的计数，而是计算配置数量的时间间隔的统计数据。这允许更好的数据准确性，特别是在高分辨率或不可靠网络的情况下。\n多维分组：当pg_stat_Statements按(userid，dbid，queryId)对计数器分组时，pg_stat_monitor使用(userid，clientip，dbid，queryId)。这使您可以深入了解来自特定客户端地址的查询的性能，我们Percona在许多情况下都发现这一点非常有价值。\n捕获查询中的实际参数：PG_STAT_MONITOR允许您选择是要查看带有占位符的参数查询还是实际查询示例。我们发现拥有完整的查询示例非常有帮助，因为您可以对其运行解释或轻松地修改查询以使其运行得更好，以及在与其他DBA和应用程序开发人员讨论时使有关查询的沟通更清晰。\n存储按语句访问的表的信息：这使我们可以轻松地识别访问给定表的所有查询。这样的方法比解析查询来提取此类信息更可靠。\n响应时间分布直方图：虽然min/max/avg查询执行统计数据很棒，特别是在短时间段内计算时，但在长时间尝试查看它们时，很难理解这些统计数据。为此，我们添加了一个查询响应时间直方图，它可以提供更好的洞察力。\n重要的是要注意，我们能够实现这些附加功能，同时具有与原始pg_stat_Statements扩展相当的性能开销。\n有许多我们想要实现的特性，但是还没有想好如何使用PostgreSQL扩展来实现它们(以及是否可以在不打PostgreSQL代码补丁的情况下实现这些特性)。如果您对如何实现这些目标有什么想法，请让我们知道。\n捕获所有查询：捕获所有查询(不仅仅是成功的查询)，这样就不会错过因错误而终止的查询(或者需要另一个数据源来捕获)。一旦有了这些，我们就可以分别测量成功和失败查询的性能，这样就可以将提高的失败率视为不同于不同查询性能的信号。\n错误和警告直方图：并非所有查询都成功，当它们失败时，您确实想知道原因。我们不仅希望看到给定查询失败的次数，而且希望看到失败的原因是什么。相同的查询可能会因为权限错误或外键冲突而失败，这需要完全不同的操作才能补救。知道哪个查询触发了特定的警告也很有帮助。\n准确的等待事件对查询的属性：对于给定的查询类型，最好能看到它的响应时间来自哪里。等待事件是捕捉这一点的一种方式，目前，查询属性可以通过对pg_stat_active表进行高频采样来完成。但是，对于大量的活动后端，它并不准确，也不具有可伸缩性。\nPg_stat_monitor现在以技术预览版的形式提供，在我们将pg_stat_monitor作为未来几年支持的通用版本发布之前，我们将其发布，以便从社区获得反馈，告诉我们哪些做得对，哪些应该做得不同。请查看，或给我们留言，提交问题，或提出拉请求！\n我们的白皮书“为什么选择PostgreSQL？”介绍了PostgreSQL的特性和优点，并提供了一些实际使用示例。我们还将研究PostgreSQL对于希望从Oracle迁移的公司有何用处。", "note_en": "Peter Zaitsev   I am very passionate about database observability, and I believe query performance observability is the most important insight you can get in your database.  Why? Because if you look from an application developer’s point of view, once a database is provisioned and you can connect to it, responding to your queries promptly and correctly is essentially all that you need from the database. This applies both to the databases which you deploy on-prem or in cloud-based DBaaS offerings.\n PostgreSQL has a fantastic extension for capturing query performance called  pg_stat_statements which captures a lot of query execution details; however, it did not capture all the details we wanted to capture in order to provide deep query performance insights in  Percona Monitoring and Management. So, we developed a new  pg_stat_monitor plugin which has slightly different design goals and usage patterns, while providing everything you’re used to from pg_stat_statements, and more.\n At this point, pg_stat_monitor is released as a separate project from Percona, so it is easier for us to experiment with new approaches and ideas. At the same time, we’re very much looking forward to working with the PostgreSQL community to see if there are any features that have enough consensus to be incorporated into pg_stat_statements, too.\n  Time Bucketing: Instead of supplying one set of ever-increasing counts, pg_stat_monitor computes stats for a configured number of time intervals. This allows for much better data accuracy, especially in the case of high resolution or unreliable network.\n Multi-Dimensional grouping:  While pg_stat_statements groups counters by (userid, dbid, queryid),  pg_stat_monitor uses (userid, clientip, dbid, queryid). This allows you to drill down into the performance of queries coming from particular client addresses, which we at Percona have found to be very valuable in a number of cases.\n Capture Actual Parameters in the Queries:  pg_stat_monitor allows you to choose if you want to see queries with placeholders for parameters or actual query examples.  We found having the full query example is very helpful, as you can run EXPLAIN on it or easily play with modifying the query to make it run better, as well as making communication about the query clearer when discussing with other DBAs and application developers.\n Store Information about tables accessed by statement: This allows us to identify all queries which accessed a given table easily.  Such an approach is more reliable than parsing queries to extract such information.\n Response time distribution histogram:  While min/max/avg query execution statistics are great, especially when computed over a short time bucket, they are hard to understand when trying to look at them for a long period of time. For this reason, we have added a query response time histogram which can offer better insights.\n It is important to note that we are able to achieve these additional features while having performance overhead comparable to the original pg_stat_statements extension.\n  There are a number of features we want to implement but have not yet figured out how to achieve them with the PostgreSQL extension (and if it is possible at all without patching PostgreSQL code). If you have ideas on how to achieve any of these, let us know.\n Capturing All the Queries:  Capture all queries (not only successful queries) so the queries which terminated with errors are not missed (or require another data source to capture). Once we have this, we can measure performance for successful and failed queries separately, so that an elevated failure rate can be seen as a different signal than different query performance.\n Errors and Warnings Histogram:  Not all queries succeed and when they fail you really want to know why. We would like to see not only the number of times a given query failed but what the cause of failure was. The same query may fail due to a permission error or foreign key violation which requires an entirely different action to remediate.  It is also very helpful to know which query triggers particular warnings.\n Accurate Wait Event Attribution to Queries:  For a given query type it would be great to see where its response time comes from.  Wait Events is one way to capture this and currently, query attribution can be done through a high-frequency sampling of the pg_stat_activity table. However, it is not accurate and not scalable with a large number of active backends.\n pg_stat_monitor  is now available as a Technical Preview and we’re releasing it to get feedback from the community on what we’re doing right and what we should do differently before we release pg_stat_monitor as a generally available version to be supported for years to come. Please check it out,   drop us a note,  file an issue, or make a  pull request!\n  Our white paper “ Why Choose PostgreSQL?” looks at the features and benefits of PostgreSQL and presents some practical usage examples. We also examine how PostgreSQL can be useful for companies looking to migrate from Oracle.", "posttime": "2020-10-14 23:55:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "postgresql,性能,stat,查询", "title": "Pg_stat_monitor-更好地了解PostgreSQL中的查询性能", "title_en": "Pg_stat_monitor – better insights into query performance in PostgreSQL", "transed": 1, "url": "https://www.percona.com/blog/2020/10/14/announcing-pg_stat_monitor-tech-preview-get-better-insights-into-query-performance-in-postgresql/", "via": "", "real_tags": ["性能", "stat", "查询"]}, {"category": "", "categoryclass": "", "imagename": "74f6c008b51d3b7846894fae45c9a6df.jpg", "infoid": 1028805, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "纽约的一组物理学家发现了一种在室温下以完美效率导电的材料-这是人们长期寻求的科学里程碑。该研究小组今天在“自然”杂志上报道，这种氢、碳和硫化合物在华氏59度的温度下作为超导体工作。这比去年创下的之前的高温超导纪录高出50多度。\n西班牙巴斯克国家大学的凝聚态理论家Ion Errea没有参与这项工作，他说：“这是我们第一次可以真正宣称发现了室温超导电性。”\n“这显然是一个里程碑，”剑桥大学材料科学家克里斯·皮卡德(Chris Pickard)说。“那是个寒冷的房间，可能是英国维多利亚式的小屋，”他在谈到59华氏度的温度时说。\n然而，在研究人员庆祝这一成就的同时，他们强调，这种新发现的化合物-由罗切斯特大学(University Of Rochester)的兰加·迪亚斯(Ranga Dias)领导的一个团队发明-永远不会进入无损输电线、无摩擦高速列车，或者任何可能变得无处不在的革命性技术，如果超导背后的脆弱量子效应能够在真正的环境条件下保持下去的话。这是因为这种物质只有在室温下超导时，才会在一对钻石之间被挤压到与地核中发现的压力大约75%的极限。\n皮卡德说：“人们一直在谈论室温超导。”“他们可能没有意识到，当我们这么做的时候，我们会在如此高的压力下这么做。”\n材料科学家现在面临的挑战是发现一种超导体，它不仅可以在常温下工作，而且还可以在日常压力下工作。这种新化合物的某些特性带来了希望，即有朝一日可以找到合适的原子混合物。\n当自由流动的电子撞上构成金属的原子时，正常导线就会产生电阻。但研究人员在1911年发现，在低温下，电子可以在金属的原子晶格中诱发振动，这些振动反过来将电子吸引到一起，形成被称为库珀对的对。不同的量子规则支配着这些对，它们以连贯的群体流动在一起，畅通无阻地穿过金属的晶格，没有经历任何阻力。超导流体还会排出磁场-这种效应可以让磁悬浮车辆无摩擦地漂浮在超导轨道上。\n然而，随着超导体温度的升高，粒子会随机晃动，打破电子微妙的舞蹈。\n研究人员花了几十年的时间寻找一种超导体，这种超导体的库珀探戈配对足够紧密，足以承受日常环境的高温。1968年，康奈尔大学(Cornell University)的固态物理学家尼尔·阿什克罗夫特(Neil Ashcroft)提出，氢原子晶格可以做到这一点。氢的微小尺寸让电子更接近晶格的节点，增强了它们与振动的相互作用。氢的轻盈还允许引导涟漪的振动更快，进一步加强了将库珀对粘合在一起的胶水。\n需要不切实际的高压才能将氢压入金属晶格。尽管如此，阿什克罗夫特的工作提高了人们的希望，即某种“氢化物”--氢和第二种元素的混合物--可能会在更容易接触到的压力下提供金属氢的超导电性。\n进展在本世纪头十年开始取得，当时超级计算机模拟让理论家能够预测各种氢化物的性质，而紧凑的钻石砧板的广泛使用让实验者挤走了最有希望的候选者来测试他们的勇气。\n突然，氢化物开始创造纪录。德国的一个研究小组在2015年发现，一种金属形式的硫化氢-在腐烂的鸡蛋中发现的一种刺激性化合物-在−94华氏度的温度下超导，压力是大气压的1.5倍。四年后，同一实验室使用氢化镧在180万大气压下达到−10度，尽管另一个小组发现了同一化合物在8度时具有超导电性的证据。\n迪亚斯在罗切斯特的实验室现在已经打破了这些记录。在直觉和粗略计算的指导下，研究小组测试了一系列氢化合物，以寻找氢的金发女郎比例。加入太少的氢，化合物的超导性就不会像金属氢那样强劲。加入太多，样品的行为会太像金属氢，只有在会使钻石砧座破裂的压力下才会金属化。在他们的研究过程中，研究小组破获了数十对价值3000美元的钻石。“这是我们研究的最大问题，钻石预算，”迪亚斯说。\n获胜的配方被证明是2015年配方的即兴表演。研究人员从硫化氢开始，加入甲烷(一种碳和氢的化合物)，然后用激光烘焙这种混合物。\n迪亚斯的合作者、内华达大学(University Of Nevada)凝聚态物理学家阿什坎·萨拉马特(Ashkan Salamat)说，“我们能够丰富这个系统，引入恰到好处的临界量的氢，这是在非常高的温度下维持这些库珀对所需的。”\n但是，他们所炮制的氢-碳-硫药水的细微细节却让他们望而却步。氢太小了，无法在传统的晶格结构探针中显示出来，所以这个小组不知道原子是如何排列的，甚至不知道物质的确切化学式。\n伊娃·祖雷克(Eva Zurek)是布法罗大学(University At Buffalo)的一名计算化学家，她属于与迪亚斯实验室关系松散的一群理论家。今年早些时候，他们预测了在钻石砧板之间可能形成的一种金属应该超导的条件，并发现了不同的行为。她怀疑是高压把迪亚斯的物质变成了一种未知的形式，其超导电性特别强。\n一旦迪亚斯的团队能够弄清楚他们手上到底有什么(他和萨拉马特说细节很快就会出来)，理论家们将建立模型，探索赋予这种氢-碳-硫混合物超导能力的特征，希望进一步修改配方。\n物理学家已经证明，大多数两元素氢混合是死胡同，但新的三元素混合标志着进入复杂嵌合体材料领域的潜在重大进展。对一些人来说，其中一个因素似乎特别有希望。\n德国马克斯·普朗克化学研究所(Max Planck Institute For Chemical)的实验学家米哈伊尔·埃雷米茨(Mikhail Eremts)说，“我喜欢这项工作的地方是：它们将碳带入系统。”他的实验室创造了2015年和2019年的氢化物纪录。\n他解释说，氢的轻量并不是增强将电子引导成库珀对的振动的唯一方式。晶格中相邻原子之间更强的连接也起到了帮助作用，他说，“碳具有非常强的共价键。”带有碳框的材料可以带来额外的好处，防止整个组装在人类感到舒适的低压下倒下。\n祖雷克对此表示同意。她说：“我认为房间压力会非常具有挑战性。”“但如果我们能将碳化合物纳入其中，我认为这就代表了一条前进的道路。”", "note_en": "A team of physicists in New York has discovered a material that conducts electricity with perfect efficiency at room temperature — a long-sought scientific milestone. The hydrogen, carbon and sulfur compound operates as a superconductor at up to 59 degrees Fahrenheit, the team  reported today in  Nature. That’s more than 50 degrees hotter than the previous high-temperature superconductivity record set last year.\n “This is the first time we can really claim that room-temperature superconductivity has been found,” said  Ion Errea, a condensed matter theorist at the University of the Basque Country in Spain who was not involved in the work.\n “It’s clearly a landmark,” said  Chris Pickard, a materials scientist at the University of Cambridge. “That’s a chilly room, maybe a British Victorian cottage,” he said of the 59-degree temperature.\n Yet while researchers celebrate the achievement, they stress that the newfound compound — created by a team led by  Ranga Dias of the University of Rochester — will never find its way into lossless power lines, frictionless high-speed trains, or any of the revolutionary technologies that could become ubiquitous if the fragile quantum effect underlying superconductivity could be maintained in truly ambient conditions. That’s because the substance superconducts at room temperature only while being crushed between a pair of diamonds to pressures roughly 75% as extreme as those found in the Earth’s core.\n “People have talked about room-temperature superconductivity forever,” Pickard said. “They may not have quite appreciated that when we did it, we were going to do it at such high pressures.”\n Materials scientists now face the challenge of discovering a superconductor that operates not only at normal temperatures but under everyday pressures, too. Certain features of the new compound raise hopes that the right blend of atoms could someday be found.\n Electrical resistance occurs in normal wires when freely flowing electrons bump into the atoms that make up the metal. But researchers discovered in 1911 that at low temperatures, electrons can induce vibrations in a metal’s atomic lattice, and those vibrations in turn draw electrons together into couples known as Cooper pairs. Different quantum rules govern these couples, which stream together in a coherent swarm that passes through the metal’s lattice unimpeded, experiencing no resistance whatsoever. The superconducting fluid also expels magnetic fields — an effect that could allow magnetically levitating vehicles to float frictionlessly above superconducting rails.\n As the temperature of a superconductor rises, however, particles jiggle around randomly, breaking up the electrons’ delicate dance.\n Researchers have spent decades searching for a superconductor whose Cooper pairs tango tightly enough to withstand the heat of everyday environments. In 1968, Neil Ashcroft, a solid-state physicist at Cornell University,  proposed that a lattice of hydrogen atoms would do the trick. Hydrogen’s diminutive size lets electrons get closer to the nodes of the lattice, augmenting their interactions with the vibrations. Hydrogen’s lightness also allows those guiding ripples to vibrate faster, further strengthening the glue that binds the Cooper pairs.\n  Impractically high pressures are needed to squash hydrogen into a metallic lattice. Still, Ashcroft’s work raised hopes that some “hydride”— a mixture of hydrogen and a second element — might deliver metallic hydrogen’s superconductivity at more accessible pressures.\n Progress  took off in the 2000s, when supercomputer simulations let theorists predict the properties of various hydrides, and the widespread use of compact diamond anvils let experimentalists squeeze the most promising candidates to test their mettle.\n Suddenly, hydrides started setting records. A team in Germany showed in 2015 that a metallic form of hydrogen sulfide — a pungent compound found in rotten eggs — superconducts at  −94 degrees Fahrenheit under 1.5 million times the pressure of the atmosphere. Four years later, the same lab used lanthanum hydride to hit  −10 degrees under 1.8 million atmospheres, even as another group  found evidence for superconductivity in the same compound at 8 degrees.\n Dias’ lab in Rochester has now shattered those records. Guided by intuition and rough calculations, the team tested a range of hydrogen compounds searching for the goldilocks ratio of hydrogen. Add too little hydrogen, and a compound won’t superconduct as robustly as metallic hydrogen does. Add too much, and the sample will act too much like metallic hydrogen, metalizing only at pressures that will crack your diamond anvil. Over the course of their research, the team busted many dozens of $3,000 diamond pairs. “That’s the biggest problem with our research, the diamond budget,” Dias said.\n The winning recipe proved to be a riff on the 2015 formula. The researchers started with hydrogen sulfide, added methane (a compound of carbon and hydrogen), and baked the concoction with a laser.\n “We were able to enrich the system and introduce just the right critical amount of hydrogen necessary to maintain these Cooper pairs at very high temperatures,” said  Ashkan Salamat, Dias’ collaborator and a condensed matter physicist at the University of Nevada.\n But the fine details of the hydrogen-carbon-sulfur potion they’ve cooked up elude them. Hydrogen is too small to show up in traditional probes of lattice structure, so the group doesn’t know how the atoms are arranged, or even the substance’s exact chemical formula.\n Eva Zurek, a computational chemist at the University at Buffalo, belongs to a group of theorists loosely affiliated with Dias’ lab. Earlier this year they  predicted the conditions under which one metal that might have formed between the diamond anvils should superconduct, and they found different behavior. She suspects that high pressures instead transformed Dias’ substance into an unknown form whose superconductivity is especially robust.\n Once Dias’ group can figure out exactly what they’ve got on their hands (details he and Salamat say are coming soon), theorists will build models exploring the features that give this hydrogen-carbon-sulfur mixture its superconducting power, in hopes of further modifying the recipe.\n Physicists have proved most two-element hydrogen hybrids to be dead ends, but the new three-element blend marks a potentially significant advance into the world of complex chimera materials. One of the elements involved seems particularly promising to some.\n “What I like about this work: They bring carbon into the system,” said  Mikhail Eremets, an experimentalist at the Max Planck Institute for Chemistry in Germany whose lab set the hydride records of 2015 and 2019.\n  He explained that the lightness of hydrogen is not the only way to beef up the vibrations that steer electrons into Cooper pairs. Stronger links between neighboring atoms in the lattice also help, and, he said, “carbon has very strong covalent bonds.” Materials with carbon frames could bring the added benefit of preventing the whole assembly from tumbling down at the low pressures humans find comfortable.\n Zurek agrees. “Room pressure I thought would be very challenging,” she said. “But if we can bring carbon compounds into the mix, I think that presents a way forward.”", "posttime": "2020-10-14 23:53:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "室温,temperature,超导", "title": "首次实现室温超导", "title_en": "Room-Temperature Superconductivity Achieved for the First Time", "transed": 1, "url": "https://www.quantamagazine.org/physicists-discover-first-room-temperature-superconductor-20201014/", "via": "", "real_tags": ["室温", "超导"]}, {"category": "", "categoryclass": "", "imagename": "a1910039511b643cb7515a2b910e893a.jpeg", "infoid": 1028804, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据发给Insider Intelligence的一份新闻稿，此前曾推出人工智能购物车的自主结账技术公司Caper推出了一款使用人工智能的台面，试图创建无缝的自助结账体验。\n要使用锥形柜台(见下图)，购物者将他们选择的物品放在指定的区域，这样这项技术就可以使用计算机视觉识别产品，并自动确定购买成本。然后，消费者可以使用信用卡和借记卡或NFC支付选项完成支付。\nCaper Counter目前部署在一家未披露的全国便利店连锁店的多家门店，并计划增加更多门店。该解决方案适用于面积小于10,000平方英尺和独特产品少于10,000种的商店。Caper的首席执行官Lindon Gao告诉Insider Intelligence，考虑到Caper正在与美容和自助餐厅行业的公司就实施这一解决方案进行谈判，Caper柜台可能会超越便利店。\n大多数自主结账技术提供商都在试图用摄像头网络和其他技术来改造现有的商店，这可能会很复杂。像亚马逊、Grabango和标准银行这样的公司都在为现有的商店配备他们的技术，这样消费者就可以抓起他们想要的产品，而不是停下来结账。这创造了几乎无摩擦的购物体验，但也需要每个商店都有一个独特的计划，这在某些情况下可能会使实施过程变得困难和漫长。\nCaper之所以能取得成功，是因为它的自动结账解决方案可以更容易地添加到商店。与其他自动结账技术一样，Caper柜台和Caper的自动购物车确实需要学习商店的库存才能启动和运行。但除此之外，它们可以直接添加到商店，因为它们的运营不需要根据商店的独特布局进行调整。与竞争对手相比，Caper潜在的简单而快速的实施过程可能会让它获得优势，这些竞争对手已经取得了进展，并开始在现有门店首次亮相他们的新技术。\n由于消费者在疫情期间对非接触式结账体验的兴趣与日俱增，这家自主结账技术提供商可能会迅速赢得商家的欢迎。消费者已经转向非接触式支付方式，以限制他们接触冠状病毒的风险，这可能会让他们对自动结账感兴趣，因为它可以消除与收银员和共享界面互动的需要。\n但自动结账技术仍处于早期阶段，商家还不能迅速将该技术推广到他们的商店，以满足人们对新颖购物体验的兴趣。Caper的即插即用特性可能使其解决方案最容易引入，使该公司能够在疫情持续时建立合作伙伴关系。\n加入其他Insider Intelligence客户的行列，他们每天都会收到这份简报，以及其他支付和商务预测、简报、图表和研究报告。&gt；&gt；将成为客户\n点击“注册”，即表示您同意与Insider Inc.联系。并接受我们的使用条款、隐私和Cookie政策。您可能会偶尔收到有关eMarketer产品和服务的更新；免费提供下载赞助商支持的内容；以及参加独家网络研讨会和活动的邀请。你可以随时选择退出。\n形成一条X的两条交叉线。它指示一种关闭交互或取消通知的方式。", "note_en": "Caper, an autonomous checkout technology firm that previously  launched an AI-powered shopping cart, introduced a countertop that uses AI to try to create a seamless self-checkout experience, per a press release sent to Insider Intelligence.\n  To use the &#34;Caper Counter&#34; (see image below) shoppers place their selected items on the designated area so the technology can identify the products using computer vision and automatically determine the cost of the purchase. Consumers then complete their payments with credit and debit cards or NFC payment options.\n Caper Counter is currently deployed at multiple stores belonging to an undisclosed national convenience store chain, with plans to add more locations. The solution is meant for stores smaller than 10,000 square feet and fewer than 10,000 unique products. And Caper Counter may move beyond convenience stores, considering Caper is in talks with firms in the beauty and cafeteria industries about implementing the solution, CEO Lindon Gao told Insider Intelligence.\n  Most autonomous checkout technology providers are trying to retrofit existing stores with networks of cameras and other technology, which can be complicated. Companies like  Amazon,  Grabango, and  Standard are outfitting existing stores with their technologies so consumers can grab the products they want and not stop to check out. This creates a nearly frictionless shopping experience but also requires a unique plan for each store, which could make implementation a difficult and lengthy process in some cases.\n Caper could find success because its autonomous checkout solutions can be more easily added to stores. The Caper Counter and Caper&#39;s  shopping cart do need to learn a store&#39;s inventory to get up and running, as do other autonomous checkout technologies. But beyond that, they can just be added to a store since their operations don&#39;t need to adjust to a store&#39;s unique layout. Caper&#39;s potentially simple and fast implementation process could give it an edge on competitors that have made progress and  started  debuting  their technologies at preexisting stores.\n The autonomous checkout technology provider could be positioned to quickly gain popularity with merchants thanks to consumers&#39; rising interest in contactless checkout experiences during the pandemic. Consumers have  turned to contactless payment options to limit their risk of being exposed to the coronavirus, which may make them interested in autonomous checkout since it can remove the need to interact with cashiers and shared surfaces.\n But autonomous checkout technology is still in its early days, and merchants can&#39;t quickly roll out the technologies to their stores yet to meet interest in the novel shopping experience. Caper&#39;s plug-and-play nature may make its solutions the easiest to introduce, allowing the company to rack up partnerships as the pandemic continues.\n  Join other Insider Intelligence clients who receive this Briefing, along with other Payments &amp; Commerce forecasts, briefings, charts, and research reports to their inboxes each day.  &gt;&gt;  Become a Client\n  By clicking ‘Sign up’, you agree to be contacted by Insider Inc. and its affiliates and accept our  Terms of Use and  Privacy and Cookies Policy. You may receive occasional updates about eMarketer products and services; complimentary offers to download sponsor-supported content; as well as invitations to exclusive webinars and events. You can opt-out at any time.\n        Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2020-10-14 23:52:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,debuts,caper", "title": "Caper首次推出人工智能驱动的自助结账解决方案", "title_en": "Caper debuts AI-driven self-checkout solution", "transed": 1, "url": "https://www.businessinsider.com/caper-launches-streamlined-self-checkout-technology-2020-10", "via": "", "real_tags": ["人工智能", "debuts", "caper"]}, {"category": "", "categoryclass": "", "imagename": "3ba3c81e676c198dc47cb4d4a0e3e02d.jpg", "infoid": 1028803, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我乘坐了Waymo的SAE4级全自动驾驶汽车车队。章节：00：00顺风车#1 25：15顺风车#2 43：23顺风车#3 01：02：31顺风车#4亮点：...", "note_en": "I take a few rides in Waymo's fleet of SAE Level 4 fully self-driving cars. Chapters: 00:00 Ride #1 25:15 Ride #2 43:23 Ride #3 01:02:31 Ride #4 Highlights: ...", "posttime": "2020-10-14 23:52:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "后座,backseat,waymo", "title": "自动驾驶Waymo内一个半小时的后座镜头", "title_en": "An hour and a half of backseat footage inside self-driving Waymo", "transed": 1, "url": "https://www.youtube.com/watch?v=tBJ0GvsQeak", "via": "", "real_tags": ["后座", "backseat", "waymo"]}, {"category": "", "categoryclass": "", "imagename": "4df4ed82558efcd362cbd58e25da0633.jpg", "infoid": 1028802, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一系列工具，使记者能够更高效、更有创意、更安全地开展工作", "note_en": "A collection of tools to empower journalists to do their work more efficiently, creatively, and securely", "posttime": "2020-10-14 23:52:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,记者,journalist,开展", "title": "谷歌记者工作室", "title_en": "Google Journalist Studio", "transed": 1, "url": "https://journaliststudio.google.com/", "via": "", "real_tags": ["谷歌", "google", "记者", "开展"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1028801, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几年里，有很多媒体报道谷歌取消了国防合同Maven项目。这导致了硅谷不再从事国防技术的说法，尽管它的技术根源是与国防部和其他政府机构合作。互联网、各种半导体公司和GPS/定位服务等都是国防相关工作的产物。\n事实证明，尽管有这种流行的说法，但大大小小的公司都在继续与政府合作。事实上，亚马逊和微软正在公开争夺与国防部的一份名为绝地的重要合同。其他公司，如英特尔、IBM和甲骨文，都有长期的防御关系。Salesforce长期以来一直拥有政府云和国防部ATO的批准。\n几年前，我认为新的DefenseTech将主要由Anduril这样的专业公司组成，Anduril的主要重点是国防(Anduril最近与国土安全部签订了一份价值2.5亿美元的5年合同，以及一份价值1350万美元的海军陆战队合同)。长期以来，我一直认为只有以AI/ML为中心的软件国防承包商才有空间。\n现实情况是，除了像Anduril或Shiel.AI这样的国防优先公司外，最近获得大型政府合同的许多公司都是没有将国防作为主要垂直市场的科技公司。当代新一代国防科技公司看起来与上一代国防科技公司相似-他们只是各自更广泛领域的领先公司，向包括国防在内的多个市场销售技术。尽管所有的权威人士都声称相反，但主流硅谷在为国防世界服务方面仍然相当活跃。\n像Anduril这样的专业公司将继续蓬勃发展。然而，事实证明，标准技术公司有很大的空间来增加国防作为一个重要的垂直市场。一些私营非国防科技公司与国防合作的例子：\n应用直觉。应用直觉的核心业务是自动驾驶汽车公司。然而，其先进的模拟基础设施软件正被用于多个国防机动性应用。\n帕兰提尔。Palantir还赢得了与国防部8.76亿美元的交易。他们的业务包括金融科技、医疗保健(美国国立卫生研究院和疾病预防控制中心)和其他应用程序。[注：Palantir在我写这篇文章的时候公开了]。\nScale为多个垂直领域的机器学习应用程序提供带标签的数据集，由Airbnb、SAP、Pinterest、DoorDash和其他公司使用。他们最近签署了一份价值9100万美元的陆军合同。\nSkydio。Skydio最初是一家消费类无人机公司，但很快就找到了公共安全和检查方面的企业应用。最近，它还增加了防御。\n太空探索技术公司(SpaceX)。埃隆·马斯克(Elon Musk)旗下的SpaceX公司与五角大楼签署了一份价值1.45亿美元的合同，用于制造导弹跟踪卫星。SpaceX还与美国国防部签署了合同，开发具有不同国防货物有效载荷的火箭。现有的现有解决方案(C-17火箭)每枚花费2亿美元。\n大量的SaaS公司。大多数SaaS公司最终都以政府为客户。然而，在这些情况下，这是一个标准的几十万到几百万的SaaS购买，所以不够引人注目，不值一提。\n新兴国防工作的共同主题包括太空、无人机和人工智能。也有许多SaaS公司将其标准软件销售给各个军事分支机构。在谷歌之外，大型科技公司(亚马逊、思科、IBM、微软、甲骨文等)也在继续与国防世界合作。", "note_en": "Over the last few years there has been a lot of press coverage of  Google canceling project Maven, a defense contract. This has led to claims Silicon Valley is no longer engaging in defense tech, despite  tech&#39;s roots working with the Department of Defense and other government agencies. Things like the  Internet, various semiconductor companies, and GPS/location services are all outgrowths of defense-related work.\n It turns out that despite the popular narrative, companies both large and small have continued to work with the government. Indeed,  Amazon and Microsoft are publicly fighting over a major contract with the DoD called JEDI. Other companies such as  Intel, IBM, and Oracle have long standing defense relationships.  Salesforce has long had a &#34;Government Cloud&#34; and  DoD ATO approvals.\n A few years ago, I thought new DefenseTech would largely consist of specialist companies like  Anduril, whose primary focus is defense ( Anduril recently landed a $250 million, 5 year contract with DHS as well as a  $13.5 million Marine Corps contract). I have long thought there is room for an AI/ML-centric software only defense contractor.\n The reality is that, in addition to defense-first companies like Anduril or Shield.AI, many of the companies recently landing large government contracts are tech companies that do not have defense as their primary vertical. The current generation of new defense tech companies look similar to the prior generation of defense tech companies - they are simply the leading companies of their broader respective areas selling technology to multiple markets including defense. Despite all the punditry claiming the opposite,  mainstream Silicon Valley remains quite active in serving the defense world.\n Specialist firms like Anduril will continue to thrive. However there turns out to be a lot of room for standard tech companies to add defense as an important vertical market. Some examples of private non-defense tech companies working with national defense:\n Applied Intuition. Applied Intuition&#39;s core business is with autonomous vehicle companies. However its  simulation infrastructure software is being used in multiple defense mobility applications.\n Palantir. Palantir has  won an $876 million deal with the DoD. Their business includes fintech, healthcare (NIH and CDC), and other applications. [Note: Palantir went public while I was writing this post].\n Scale.AI. Scale provides labelled data sets for machine learning applications across multiple verticals and is used by Airbnb, SAP, Pinterest, DoorDash and others.  They recently signed a $91 million Army contract.\n Skydio. Skydio started off as a consumer drone company only to quickly find enterprise applications in public safety and inspection. More recently it has also added  defense.\n SpaceX. Elon Musk&#39;s SpaceX has signed a  $145 million contract with the Pentagon to build missile tracking satellites. SpaceX has also signed contract with the DoD  to develop rockets with different defense cargo payloads. Existing incumbent solutions (the C-17 rockets) cost $200M each.\n Tons of SaaS companies. Most SaaS companies eventually end up with the government as customers. However, in these cases it is a standard few hundred thousand to few million SaaS purchase so not notable enough to mention.\n The common themes for emerging defense work include space, drones and AI. There are also many SaaS companies that sell their standard software to the various military branches. Outside of Google, the large tech companies (Amazon, Cisco, IBM, Microsoft, Oracle, etc) continue to work with the defense world as well.", "posttime": "2020-10-14 23:52:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "硅谷,valley", "title": "硅谷与国防科技", "title_en": "Silicon Valley and Defense Tech", "transed": 1, "url": "http://blog.eladgil.com/2020/10/silicon-valley-defense-tech.html", "via": "", "real_tags": ["硅谷", "valley"]}, {"category": "", "categoryclass": "", "imagename": "aaede1af9a4664ea79e085981e238efc.jpg", "infoid": 1028800, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为一名自力更生的创始人，我面临的挑战并不是人们通常谈论的那些。\n互联网上充斥着详细描述创业的诸多挑战的恐怖故事。我们都读过这样的故事：创始人多年来苦苦挣扎寻找产品市场的契合度，联合创始人为股权问题争吵不休，首席执行官为维持自己的初创企业再维持一个月的运营而焦急万分，耗尽了年幼女儿的大学基金。\n警示故事？好的。但是，尽管这些情况可能相对常见，但最终它们在科技媒体上声名狼藉，仅仅是因为它们是危言耸听和点击诱饵。\n当我作为一家自助式SaaS初创公司的创始人接近第四年时，我忍不住反思自己遇到的困难。正如我所经历的那样，我有一种压倒性的感觉--我所面临的大多数挑战并不是我独有的，但没有人谈论它们。这篇文章是关于解决那些令人喘不过气来的常见创业挑战的。\n关于建立公司时自力更生还是走风险投资路线的优点的辩论一直在激烈进行-我就是其中之一，因为我煽动了这些火上浇油。但让我震惊的是，“自助者”和“超增长”描述的路径和决定不应该被视为我们身份的一部分，甚至不应该被视为我们个人偏好的一部分。\n“我认为我们谈论得太多了，关于我们是否更喜欢自力更生而不是筹集风险资本，而关于哪条道路与我们的商业理念和生活环境相适应的讨论太少了。”“。\n我甚至可以说，我们听到的大多数创业挑战都是你选择的道路与你的商业理念或生活环境不相容的直接结果。当这些项目协调一致时，创业就变得容易得多。\n如果你正在创建SpaceX，你的想法决定你走风投路线--它太大了，太雄心勃勃，太资本密集，不可能让这样的公司自力更生。这是一个极端的例子，但这是我们在决定如何为初创企业融资时应该评估我们的初创企业想法的镜头。\n一般来说，“较小”的产品更适合自举。构建闲置通知工具？太棒了！你也许可以在不到一个月的时间里推出这样的项目，让项目有机会获得一些吸引力，然后决定从那里继续还是不继续。你要是不给这样一家公司创业，那你就疯了。\n但是，如果您正在构建一个更大、更雄心勃勃的软件，您需要密切关注这样一个现实，即可能需要数年时间才能实现一些有价值的东西。你能承受一年没有薪水的生活吗？三年或五年怎么样？\n值得注意的是，这不仅仅是一个财务决定或产品范围的决定，而且还会在未来几年潜在地影响你的日常生活。你最近签过抵押贷款吗？你打算要孩子吗？创业带来的压力，以及你选择如何为你的企业融资，都会对你生活的方方面面产生涓涓效应。\n问题不是你更喜欢自力更生还是风险投资。问题是哪条路径与您正在构建的…产品最兼容。还有你的生命。\n把这个完整的循环带到Outseta，在很多方面，Outseta不是一个与自举的想法兼容的想法。Outseta是一个非常大且雄心勃勃的项目，我们用一个小团队来执行--它实际上是三四个不同的软件产品，而不是一个。我们知道这一点，并公开谈论我们需要数年时间才能真正实现我们的价值主张，并开始以有意义的方式增长收入。我们花了两年时间才推出一款畅销产品，四年过去了，现在我们才刚刚开始扩大规模。\n但是我们有一个主要的优势-我们选择构建的想法不需要“验证”-我们提供的软件类别(CRM、账单、电子邮件营销等)具有持久性，并且在很久以前就已经得到了验证。这给了我们信心，让我们相信我们可以进行长期的游戏，并允许我们设计我们业务和生活的方方面面，这样我们就可以生存足够长的时间，看到Outseta蓬勃发展到今天的样子。\n我们没有选择一条简单的路线，但我们现在发现Outseta是非常容易防御的，因为很少有团队会花4年以上的时间仅仅为了把一个想法变成现实。当然，你可以用风险投资更快地做到这一点，但你永远不可能像我们这样以我们的价位为观众提供服务。\n对于SaaS初创企业来说，最常见也是最少被人提及的困难之一就是我开始形容的“SaaS的低迷”。当你的初创公司在注册过程中遇到转折点，支持请求急剧扩大，以至于它们几乎完全接管了你专注于业务的其他方面(从营销到构建新功能)的能力时，就会发生这种情况。\n具有讽刺意味的是，由于我们的一个竞争对手，一家初创企业成长的这一阶段最初对我来说是显而易见的。我们开始收到数十名创始人的注册，他们都唱着同样的曲调。\n“我使用的是CompostorX--一开始我很喜欢他们的产品，但他们反应迟钝，已经几个月没有发布任何新功能了。”\n今年春天早些时候，我们也经历了类似的阶段。在与Webflow的新合作伙伴关系的支持下，Outseta的注册人数突然大幅增加-伴随着这种增长，来自学习该平台的新用户的支持票也大量涌入。\n我的夏天几乎完全集中在技术支持上，而我花在营销Outseta上的时间却掉到了悬崖上。同样，我的联合创始人正在推动修复，并帮助实现新的Outseta，这降低了他们推出新功能的能力。\n归根结底，这是一个自力更生的初创公司成长的阶段，不会得到太多口头上的支持，因为谈论增加支持水平和减少构建新功能的能力几乎没有什么好处。但这是不幸的，因为这是几乎每家规模公司都会遇到的“好问题”--然而，关于如何最好地处理创业之旅的这一阶段，几乎没有什么建议。\n如果你是一家由风险投资支持的公司，解决这个问题很容易--花点钱雇佣额外的支持能力，因为你有能力亏损经营你的公司。但是对于一个穿靴子的人来说，这个阶段可能会让你的腿感觉被困在流沙里。\n我在这里没有一个解决方案，除了认为花在帮助客户上的时间是你建立业务所能做的最重要的事情这一想法上得到一定程度的安慰之外，我没有任何解决方案。而且，使用您的工程资源来解决导致支持请求增加的潜在问题，而不是雇佣支持能力，从长远来看总是有回报的。\n众所周知，许多创业者感到极度的压力、焦虑、担忧，甚至是抑郁--这通常与金融不稳定和建立公司的定期起伏有关。“。但对我个人--我怀疑其他许多人--来说，我感受到的最强烈的心理痛苦之一就是压力，这种压力来自于我觉得自己还不能在我的初创企业中“全力以赴”。\n毫无疑问，自从我们创办Outseta的那一天起，我无疑就“全力以赴”了。四年来，我几乎重新安排了我生活的方方面面，以支持这家公司的成立。但作为我们启动业务战略的一部分，我们的整个团队开始以兼职的身份开发Outseta，同时咨询或从事其他项目以支付账单。正如大多数自助者所做的那样，在我们的增长允许的情况下，我们已经逐渐增加了每个人在业务上的投资时间。\n对我个人来说，这意味着多年来，从字面上讲，我总是有一种挥之不去的感觉，认为我可以做得更多。我可以为Outseta做得更多或做得更好，我也可以在我正在做的其他项目方面做得更多。对我来说，这种感觉很艰难。能够毫不含糊地、毫无疑问地说，你正在全力以赴地付出一些东西，这感觉真的很好。但是，大多数穿靴子的人不得不等待相当长的一段时间，才能让他们的企业真正支持他们在工作中的每一丝注意力。要等很长一段时间才能摆脱那种烦人的感觉！\nSaaS作为一种商业模式的奇迹是众所周知的-经常性收入的稳定性和可预测性，可以扩展到数千用户的产品，高估值-全部9码。但事实是，对于自力更生的创始人来说，SaaS是一个拷问室，是一个延迟满足的游戏。\n不要误解我的意思，马上就会认为这句话背后有某种自我造成的痛苦--我是工作/生活平衡的最大支持者，一般来说，杰森·弗里德(Jason Fry)和DHH的“工作不一定要疯狂”(It Not Are Are Crazy At Work)中概述的原则是你能找到的。这完全是商业模式的问题。\n当你自力更生的时候，你会在没有薪水的情况下开始工作。我们中的大多数人都在朝着这样一个点工作，即企业的收入最终可以开始支付给我们一些东西，然后我们会增加自己的薪酬，直到达到某种表面上的正常工资。SaaS和Bootstrapping的问题是，你会受到极大的激励，不给自己付钱--你付给自己的每一美元都是没有再投资于业务增长的钱，所以你故意放慢了自己的增长速度。\n当然，需要考虑的是人类现实世界的情况，你自己的财务和情感需求与你成功经营业务的能力直接相关。但残酷的现实是，你延迟自己满足的时间越长，你的优势就越大。\n我请我的联合创始人迪米特里斯(Dimitris)谈谈他在SaaS中非常普遍的漫长而缓慢的死亡坡道的经历。迪米特里斯早在2004年就与人共同创立了Buildium。\n迪米特里斯说：“我们花了两年半的时间才吸引到50名客户。”“然后，我们又花了一年的时间才达到400名客户，一年后，我们又达到了1000名客户。当我们有400名客户时，我们有意识地决定推迟支付象征性的每月1000美元以上的工资，而是聘用了最初的两名全职员工。直到六年前，我们辞去了全职工作，才开始生产现在的产品。“\nBuildium在成立15年后以5.8亿美元的价格被收购，因此从长远来看，一切都解决了。但它仍然回避了一个问题，…。\n“你准备好等上几年才能回到”正常“工资水平了吗？”\n与SaaS成为刑讯室的概念有很大关系的可能是其中最棘手的话题-你如何认识到并做出认清并决定放弃的决定？\n这是几乎所有自力更生的创始人都在努力解决的问题，而这个问题几乎找不到立竿见影的吸引力和成长性。但是你怎么知道你是否应该继续推进呢？你怎么知道什么时候该“坚守”，而不是叫停呢？\n如果你过早地握手言和，你已经投入了大量的时间来构建一些东西，而不是仅仅为了学到几个教训。更糟糕的是，你可能总是想知道会发生什么。但是，如果你一直盲目地建立在诚信的基础上，你最终可能只会把额外的几个月、几年和大量的现金浪费掉，更不用说你的情感健康了。这是一个无论你做出什么决定都会产生严重后果的话题！\n进入Outseta一年后，我们没有取得我们希望的进展。四年过去了，这仍然是真的！那么为什么我们还没有放弃呢？\n对每个人来说，这个问题的答案以及你如何做出退出的决定都是不同的。在我读过的关于这个话题的所有文章中，我同意的最普遍的建议是跟随你的直觉。Wistia的克里斯·萨维奇(Chris Savage)和Wildbit的娜塔莉·纳格勒(Natalie Nagele)在最近的一集播客中就这个话题进行了有趣的讨论，娜塔莉讲述了她的团队是如何决定关闭他们投入多年和数百万美元建造的Wildbit的一款产品的故事。他们的理由是什么？再也没有人在这个产品上工作得很开心了。\nSoftwareideas.io创始人凯文·康蒂(Kevin Conti)表示，他的个人经验让他偏向于提前辞职。Transistor.fm的创始人贾斯汀·杰克逊(Justin Jackson)最近写了很多关于找到一个你感觉到立竿见影的市场的重要性的文章。\n在这两种情况下，我认为这通常都是一个好建议-没有什么比实际牵引发生得更快更能表明你在做什么了。但我也认为，这个建议在很多情况下都是短视的--成功初创企业最常见的杀手之一就是过早辞职的创始人。迪米特里斯在Buildium的经历只是一个例证。\n我认为影响这个决定的关键因素之一是你的想法需要“验证”的程度。如果你带来了一些全新的东西，我认为非常重要的是，你在相当早的时候就看到了一些愿意支付的牵引力。但是，如果你的建筑产品在成熟的、耐用的市场上销售，我认为这不一定是真的。您知道您正在构建的产品有市场需求；您只需要给自己足够的时间来构建一个引人注目的产品。\n把它带到Outseta，我们提供CRM、订阅计费和帮助台产品。这些类别的软件已经存在很久了，而且它们肯定不会去任何地方。这让我们有信心，在最初的几个月里，我们可以在不需要看到牵引力的情况下进行长期的比赛-见鬼，我们花了几年的时间才真正提供了一款可以销售的产品，实现了我们的价值主张！这将是对时间的巨大浪费，如果我们在一两年后退出，我们永远不会走到这一步。\n与Buildium类似，迪米特里斯花了两年半的时间才吸引到50名客户-但迪米特里斯知道租赁市场不会有任何发展前景，并坚信在线支付租金的租户比房东每月在银行兑现支票更好的体验。这给了他继续前进的信心，给了Buildium开花结果所需的时间。\n如果说这其中有什么教训的话，我认为应该归结为几个因素，那就是决定退出的决定应该归结为以下几个因素：\n不管你怎么说，这都是几乎每个自力更生的创始人都会在某种程度上与之搏斗的最艰难的决定之一。\n我肯定开始看到这个话题被更频繁地讨论，但我认为初创企业的上瘾性质值得进一步探索。退后一步，客观地看待我自己的行为，毫无疑问，我已经有点沉迷于拍摄Outseta了。\n这以既健康又不健康的方式表现出来。我真的很喜欢我正在做的工作，所以Outseta从来没有远离过我的脑海-我在跑步、洗澡和看电视的时候都会想到它。这并不困扰我；在很多方面，我都很高兴有一些我觉得如此投入的东西。但另一方面，不可否认的是，有些时候我可以更多地陪伴我的妻子、我的孩子、我的朋友，诸如此类。见鬼，有很多时候我应该更多地与自己在一起-但我在那里，醒着，独自一人在周六午夜回复一条关于Outseta的推文。我知道我养成了一些不健康的习惯。\n当我考虑到这一点时，我认为这与其说是一种疾病本身，不如说是一种症状。我感觉到了这篇文章中概述的心理、经济和其他方面的压力，它们助长了我的上瘾。我对我的初创企业上瘾是一种应对机制--我全身心地投入到我的问题中，试图通过让Outseta更成功、更快地“修复”它们。\n显然，创业对我来说最困难的部分是-我的主要动机是有机会建立一个真正的以人为本的公司，但客户通常不会以人道的态度对待企业。你与企业的互动往往是交易性的，而不是个人的，这让我觉得成长为一家自力更生的初创公司在情感上非常繁重。\n例如，当我们开始构建Outseta时，我们都是兼职专注于业务，但客户根本不关心这一点-他们要求全天候的响应能力，特别是考虑到我们正在构建一个任务关键型业务应用程序。作为消费者，我完全理解和欣赏这一点。\n当你自我引导时，不可避免地会有一段时间，你无法提供你想要的响应性支持，或者你的风投支持的竞争对手可以提供的响应性支持。\n“残酷的事实是，没有人愿意口惠而实不至，在早期，让你的公司创业对你来说可能是最好的决定，但对你的客户来说却不是最好的决定。”“。\n对于你的早期客户来说，这是有机会成本的，但值得注意的是，随着业务的成熟，他们将在稍后获得好处，并有能力提供更低的价格。对你的客户来说，自举也是一场延迟满足的游戏。\n我试图主要通过与客户设定适当的期望来应对这一挑战-我们可能不总是立即可用，但我们会在24小时内回复每一封客户服务电子邮件、支持票证或聊天。我很自豪我们坚持了这一标准。但毫无疑问，这导致了一些客户抱怨，即使很大程度上是毫无根据或荒谬的，也很难动摇。\n例如，我收到了下面的一封电子邮件，这位女士在注册Outseta后不久就看起来非常友好和专业。她在周四早上7点通过聊天联系了我-我还没有工作，因为我正忙着喂我的儿子们吃早餐。那天早上9点我看到了她的消息，但当时我正在接另一个客户电话，所以直到上午10点56分我才回复她，告诉她她问题的解决方案\n虽然我知道没有人愿意等待几个小时来回答他们的问题，但如果你是在一个小团队中自学的话，你可能不会一天24小时都有空。\n我希望我能早点回复她，但当我主动提出要跳过与她的视频通话时，她阻止了我在没有任何解释的情况下发送她的电子邮件。我和用户有过几次这样的互动，每一次都感觉就像是一把刀刺进了肚子里。\n今年夏末有一周，我的一位联合创始人正在度假，另一位创始人的母亲刚刚去世，剩下我一个人照看我们的客户群。我努力争取在24小时内回复每一位客户，我做到了，但我的响应时间仍然比平时慢了一点。\n尽管我很想说，“嘿，我是一个人，家里有人去世了，我们正在处理一些不可预见的情况，让我们有点捉襟见肘。”但像上面例子中的那个女人这样的用户显然不在乎。我的脸皮很厚，我能看出来人们什么时候不讲理，但我也同情需要帮助而又不能立即获得帮助的情况。对我来说，这一直是自举过程中最具挑战性的方面之一，因为我希望每一位客户离开时都会感到惊叹。\n你们有共同创始人并不意味着你们有相同的创业经历。\n拥有联合创始人的一个最常被引用的原因是有人与你分享创业之旅的好处-高潮和低谷，成功和失败。毫无疑问，这是拥有联合创始人的主要好处。\n“但是，仅仅因为你们有联合创始人并不意味着你们分享了与创建公司相同的经验--远非如此。“。\n在任何一组联合创始人中，你都可能有财务状况不同的人，\n.", "note_en": "The challenges that I’ve faced as a bootstrapped founder simply aren’t the ones that are commonly talked about\n  The internet is littered with horror stories detailing the many challenges of entrepreneurship. We’ve all read the tales of founders wrestling for years to find  product market fit, of co-founders squabbling over equity, of the CEO riddled by anxiety as he drains his infant daughter’s college fund to keep his start-up afloat for another month.\n Cautionary tales? Sure. But while these circumstances may be relatively common, ultimately they gain notoriety in the tech media simply because they are alarmist and clickbait.\n As I approach year four as a founder of a bootstrapped SaaS start-up, I can’t help but reflect on the hardships that I’ve encountered myself. As I have, I’ve had an overwhelming feeling—the majority of challenges that I’ve faced are by no means unique to me, but  nobody is talking about them. This article is about surfacing those common entrepreneurial challenges that are gasping for some air.\n  The debate over the  merits of bootstrapping versus going the venture capital route when building your company rages on—I for one am guilty of fanning these flames. But it strikes me that “bootstrapper” and “hypergrowth” describe paths and decisions that shouldn’t be seen as a part of our identity, or even as something to which we ascribe a personal preference.\n “I think we talk way too much about whether we prefer bootstrapping to raising venture capital, and way too little about which path is compatible with our business idea and life circumstances. ”\n I’d go so far as to say most entrepreneurial challenges that we hear being bemoaned are a direct result of your chosen path being incompatible with your business idea or life circumstances. When these items are in harmony, entrepreneurship becomes vastly easier.\n If you’re building SpaceX, your idea dictates that you go the VC route—it’s too big, too ambitious, and too capital intensive to bootstrap such a company into existence. This is an extreme example, but this is the lens through which we should be assessing our start-up ideas as we decide how to fund them.\n Generally speaking, “smaller” products are better suited to bootstrapping. Building a slack notification tool? Great! You can probably launch something like this in less than a month, give the project the opportunity to gain some traction, then make the decision to proceed or not from there. You’d be crazy  not to bootstrap such a company.\n But if you’re building a bigger and more ambitious piece of software you need to look closely at the reality that it could take years to bring something of value to fruition. Can you afford a year without a paycheck? How about three years, or five?\n It’s worth noting that this isn’t solely a financial decision or one of product scope, but also one that will impact your day-to-day life potentially for years to come. Did you recently sign a mortgage? Do you plan on having kids? The stresses that come with entrepreneurship and how you choose to fund your business will have trickle down effects on all aspects of your life.\n The question is not do you prefer bootstrapping or venture capital. The question is which path is most compatible with the product you’re building… and your life.\n Bringing this full circle to Outseta, in many ways Outseta is not an idea compatible with the idea of bootstrapping. Outseta is a very large and ambitious project that we’re executing on with a small team—it’s really three or four different software products rather than one. We knew this going in and openly talked about how it would take years for us to truly be able to deliver on our value proposition and start to grow revenue in a meaningful way. It took us two years to deliver a sellable product, and four years in now we’re just starting to scale.\n But we had one major advantage—the idea that we chose to build was not one that needed “validating”—the categories of software that we offer (CRM, billing, email marketing, etc) have staying power and have been validated long ago. This gave us confidence that we could play the long game and allowed us to design all aspects of our business and lives so that we could survive long enough to see Outseta blossom into what it’s become today.\n We didn’t choose an easy route, but we’re now finding that Outseta is massively defensible because very few teams would commit 4+ years just to bring an idea to life. You could do it much more quickly with venture capital, sure, but you’d never be able to serve the audience that we do at our price point.\n  One of the most common and least talked about hardships of bootstrapping a SaaS start-up is what I’ve started describing as “the doldrums of SaaS.” This occurs when your start-up hits an inflection point in sign-ups and support requests scale up dramatically to the extent that they all but take over your ability to focus on other aspects of your business, from marketing to building new features.\n Ironically enough, this stage in a bootstrapped start-up’s growth initially became apparent to me because of one of our competitors. We started getting dozens of sign-ups from founders all singing the same tune.\n “I was using CompetitorX—I loved their product initially, but they’re unresponsive and haven’t released any new features in months.”\n Then earlier this spring, we went through a similar stage. On the back of a new partnership with  Webflow, all of a sudden the number of sign-ups for Outseta scaled up dramatically—and in tandem with that growth came an influx of support tickets from new users learning the platform.\n My summer was spent focused almost entirely on technical support, while my time spent marketing Outseta fell off a cliff. Likewise, my Co-founders were pushing fixes and helping out with new Outseta implementations cutting into their ability to roll out new features.\n Ultimately this is a stage in a bootstrapped start-up’s growth that doesn’t get much lip service because there’s little benefit to speaking about increased support levels and decreased capacity for building new features. But that’s unfortunate because this is a “good problem” that nearly every scaling company will encounter—yet there’s very little advice out there on how to best handle this stage of the entrepreneurial journey.\n If you’re a VC backed company, it’s an easy problem to fix—throw some money at hiring additional support capacity, because you have the ability to run your company at a loss. But for a bootstrapper this stage can feel like your legs are stuck in quicksand.\n I don’t have a solution here, aside from taking some degree of solace in the thought that time spent helping customers is the most single important thing that you can do to build your business. And rather than hiring support capacity, using your engineering resources to solve underlying issues that result in increased support requests will always pay off in the long run.\n  It’s well documented that many entrepreneurs feel extreme levels of stress, anxiety, worry, and even depression—which most often is tied to financial instability and the regular peaks and valleys of building a company. But for me personally—and I suspect many others—one of the strongest psychological tolls I’ve felt is stress that comes from feeling like I’m not yet able to be “all-in” on my start-up.\n Make no mistake about it—since the day we started Outseta, I’ve undoubtedly been “all-in.” I’ve rearranged almost all aspects of my life over four years in support of bringing this company into existence. But as part of our strategy to  bootstrap the business, our entire team began working on Outseta in a part-time capacity while consulting or working on other projects to pay the bills. We’ve gradually ramped up the time we’ve each invested in the business as our growth has permitted, as most bootstrappers do.\n For me personally, this meant that for years, literally, there was always this nagging feeling that I could be doing more. I could be doing more or doing better for Outseta, and I could be doing more in terms of the other projects I was working on as well. For me, that feeling has been tough. It feels really good to be able to say that you unequivocally, without question, are giving something your all. But most bootstrappers have to wait quite a long period of time until their business can truly support every last scrap of their attention at work. That’s a long period of time to wait to shed that nagging feeling!\n  The wonders of SaaS as a business model are well known—the stability and predictability of recurring revenue, products that can scale to thousands of users, high valuations—the whole nine yards. But the fact of the matter is that for bootstrapped founders, SaaS  is a torture chamber and a game of delayed gratification.\n Don’t misunderstand me and immediately suppose that there’s some sort of self-inflicted pain behind this comment—I’m the biggest proponent of work/life balance and generally the principles outlined in Jason Fried and DHH’s   It Doesn’t Have To Be Crazy At Work that you’ll ever find. This is solely a matter of the business model.\n When you’re bootstrapping, you’re going to start off without a paycheck. Most of us work towards a point where the revenue of the business can eventually start to pay us something, then we scale up our own compensation until it reaches some semblance of a normal salary. The problem with SaaS and bootstrapping is you are hugely incentivized not to pay yourself—every dollar that you pay yourself is money that isn’t being reinvested in the growth of your business, so you’re intentionally slowing down your own growth.\n Of course there are human, real world circumstances to consider and your own financial and emotional needs directly correlate to your ability to work on your business successfully. But the hard reality is the longer you can delay your own gratification, the greater your advantage.\n I asked my Co-founder, Dimitris, to speak to his experience of the long, slow ramp of death that’s so prevalent in SaaS. Dimitris Co-founded  Buildium back in 2004.\n “It took us 2.5 years to get to 50 customers,” says Dimitris. “Then it took us another year to get to 400 customers, and a year after that we reached 1,000 customers. When we had 400 customers we made a conscious decision to defer paying ourselves more than a token $1,000 per month salary and instead hired our first two full-time employees. We didn’t start making what we were making when we quit our full-time jobs until six years in.”\n Buildium was acquired 15 years after it was founded for $580M, so everything worked out in the long run. But it stills begs the question…\n “Are you ready to wait years to return to a “normal” salary?”\n  Very much related to the notion of SaaS being a torture chamber is perhaps the toughest topic of them all—how do you recognize and make the decision to fold your hand and call it quits?\n It’s a question that almost all bootstrapped founders wrestle with that don’t find near immediate traction and growth. But how do you know if you should keep pushing? How do you know when it’s time to “dig in” versus calling it quits?\n If you fold your hand too soon, you’ve invested a lot of time into building something for little more than a few lessons learned. Worse yet, you may always wonder what could have been. But if you keep building blindly on good faith, you may only end up flushing additional months, years, and lots of cash down the drain, not to mention your emotional well being. It’s a topic with serious ramifications no matter what you decide!\n One year into Outseta, we hadn’t made the progress we hoped to. Four years in, that remains true! So why haven’t we given up?\n  The answer to this question and how you come to the decision to call it quits is different for everybody. In all that I’ve read about this topic, the most common advice that I agree with is to follow your intuition. Chris Savage of Wistia and Natalie Nagele of Wildbit have a fascinating discussion on this topic in a  recent podcast episode, where Natalie tells the story of how her team decided to shut down one of Wildbit’s products that they’d invested years and millions of dollars into building. Their reason? Nobody was having fun working on the product anymore.\n Kevin Conti, Founder of  Softwareideas.io, says that his personal experience makes him biased towards quitting early. Justin Jackson, Founder of Transistor.fm,  has written a lot recently about the importance of finding a market where you feel some immediate pull.\n  In both cases, I think this is generally good advice—nothing is a better indicator that you’re on to something than actual traction occurring quickly. But I also think that this advice can in many instances be shortsighted—one of the most common killers of successful start-ups is simply founders that quit too soon. Dimitris’ experience at Buildium is just one proof point.\n One of the key factors that I think should influence this decision is the extent to which your idea needs to be “validated.” If you’re bringing something totally new into existence, I think it is critically important that you see some traction in terms of willingness to pay fairly early on. But if your building products in well established, durable markets I don’t think that’s necessarily true. You know that there’s market demand for what you’re building; you just need to give yourself enough time to build a compelling product.\n Bringing it full circle to Outseta, we offer CRM, subscription billing, and help desk products. These categories of software have been around forever, and they’re certainly not going anywhere. That gave us the confidence that we could play the long game without needing to see traction in the first few months—hell, it took us a couple of  years to really offer a sellable product that delivered on our value proposition! It would have been a massive waste of time and we would never have made it to this point if we’d quit after a year or two.\n Likewise with Buildium, it took 2.5 years to get to 50 customers—but Dimitris knew the rental market wasn’t going anywhere, and had conviction that tenants paying rent online was a better experience than landlords cashing checks at the bank each month. This gave him the confidence to continue on, and Buildium the time it needed to blossom.\n If there’s a lesson here, I think it’s that the decision to call it quits should boil down to a few factors:\n  Any way you cut it, this is one of the hardest decisions that almost every bootstrapped founder wrestles with at some point or another.\n  I’ve definitely started to see this topic discussed more often, but I think the addictive nature of start-ups is worthy of further exploration. Taking a step back and an objective look at my own behavior, there’s no question that I’ve become a bit addicted to working on Outseta.\n This manifests itself in ways that are both healthy and unhealthy. I genuinely enjoy the work that I’m doing so Outseta is never far from my mind—I think about it when I’m running, in the shower, and when I’m watching TV. This doesn’t bother me; in many ways I’m happy to have something I feel so invested in. But on the other hand, there are undeniably moments where I could be more present with my wife, my kids, my friends, you name it. Heck, there’s plenty of moments where I should be more present with  myself—yet there I am, awake and alone replying to a tweet about Outseta at midnight on a Saturday. I know that I’ve developed some unhealthy habits.\n As I consider this, I think this is more of a symptom than a disease itself. I feel the psychological, financial, and other stresses outlined in this article and they fuel my addiction. My addiction to my start-up is a coping mechanism—I’m throwing myself at my problems in an attempt to “fix” them by making Outseta that much more successful, that much faster.\n   Far and away the hardest part of entrepreneurship for me has been this—I’m primarily motivated by the opportunity to build a  truly people-first company, but customers generally don’t treat businesses with humanity. Your interactions with businesses are too often transactional instead of personal, which for me has made growing a bootstrapped start-up very emotionally taxing.\n For example, when we started building Outseta we were all focused on the business part-time, but customers simply don’t care about that—they expect full-time responsiveness, especially considering we’re building a mission critical business application. As a consumer myself I can absolutely understand and appreciate that.\n As you bootstrap, there’s inevitably going to be a period where you can’t provide the level of responsive support that you want to—or that your VC-backed competitors can.\n “The hard truth that no one wants to give lip service is that early on, bootstrapping your company may be the best decision for you but it’s not the best decision for your customers. ”\n There’s an opportunity cost here for your early customers, but it’s worth noting that they’ll reap the benefits later on as the business matures and can afford to offer lower prices. Bootstrapping is a game of delayed gratification for your customers, too.\n I’ve tried to navigate this challenge primarily by setting appropriate expectations with our customers—we may not always be immediately available, but we respond to every customer service email, support ticket, or chat within 24 hours. I’m proud that we’ve upheld that standard. But without question this has led to some customer complaints that even if largely unfounded or ridiculous are hard to shake.\n For example, I received the email below from a woman who otherwise seemed very nice and professional shortly after she signed up for Outseta. She reached out via chat at 7:00am on a Thursday—I wasn’t working yet, because I was busy feeding my sons breakfast. I saw her message at 9:00am that morning, but was jumping on another customer call so I didn’t get back to her with the resolution to her question until 10:56am.\n  While I understand that no one wants to wait a few hours for a response to their question, if you’re bootstrapping with a small team you’re likely not going to be available 24 hours per day.\n I wish I had been able to respond to her sooner, but when I reached out offering to jump on a video call with her she had blocked my ability to send her email messages with no explanation. I’ve had a few interactions like this with users, and every one feels like a knife to the gut.\n There was a week late this summer where one of my Co-founders was on vacation, another’s mother had just passed away, and I was left to tend to our customer base solo. I fought hard to get back to each and every customer within 24 hours and I did, but still my response times were a bit slower than normal.\n As much as I wanted to say, “Hey, I’m a human being, there’s been a death in the family, and we’re dealing with some unforeseen circumstances that have left us stretched a bit thin,” users like the woman from the example above clearly don’t care. I have a pretty thick skin and I can see when people are being unreasonable, but I also empathize with needing help and not having immediate access to it. For me, this has been one of the most challenging aspects of bootstrapping because I want every customer to leave feeling wowed.\n Just because you have Co-founders doesn’t mean you share the same entrepreneurial experience\n One of the most commonly cited reasons for having Co-founders is the benefit of having someone to share the entrepreneurial journey with you—the highs and lows, the wins and the losses. Without question this is a major benefit to having Co-founders.\n “But just because you have Co-founders doesn’t mean you’re sharing the same experience as you build your company—far from it. ”\n In any group of Co-founders you’re likely to have people with different financial situations, \n......", "posttime": "2020-10-14 23:50:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "产品,hard,outseta", "title": "将SaaS产品引导到生活中的潜台词", "title_en": "The Unspoken Hard Bits of Bootstrapping a SaaS Product to Life", "transed": 1, "url": "https://www.outseta.com/posts/the-unspoken-hard-bits-of-bootstrapping", "via": "", "real_tags": ["产品", "hard", "outseta"]}, {"category": "", "categoryclass": "", "imagename": "ab64937a7450f0c400f02e6a4d00cbfb.jpeg", "infoid": 1028798, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在发现高温超导体之后的一段时间里，人们对这些化合物的工作原理没有很好的概念性理解。虽然在更高温度方面取得了突飞猛进的进展，但它很快就陷入了停顿，这在很大程度上是因为它受到了反复试验的推动。近年来，人们更好地了解了使超导成为可能的机制，我们看到了第二次气温迅速上升的爆发。\n这一进展的关键是对富氢化合物的新关注，它建立在这样一种知识的基础上，即氢在固体中的振动有助于鼓励超导电子对的形成。通过使用超高压，研究人员已经能够迫使氢进入固体，这些固体最终在不求助于液氮的情况下可以达到的温度下超导。\n现在，研究人员通过展示第一种在室温下超导的化学物质，清除了一个主要的心理障碍。只有两个问题：我们不能完全确定这种化学物质是什么，它只能在250万大气压下起作用。\n在正常的材料中，电子作为个体运动，撞上原子和缺陷，并在这个过程中产生电阻。为了在这些材料中超导，电子必须找到一个伙伴来形成所谓的库珀对。一旦配对，这些电子就可以作为量子流体在材料中传播，基本上可以选择它们可以使用的任何路径。这使得他们可以避免所有的不完美，否则可能会减慢他们的速度。你有超导性。\n为了鼓励超导性，你必须鼓励库珀对的形成，这涉及到克服电子的自然排斥力。克服这种排斥力的物理原理涉及到电子与它们所在材料中的振动(称为声子)之间的相互作用。\n高频声子在鼓励库珀对形成方面是最有效的。这就把我们带到了氢的问题上。氢原子的低质量使得高频振动更容易实现，这意味着富氢材料是很好的高温超导体候选材料。\n回顾一下，氢原子产生高频声子，这鼓励了电子对，从而使超导成为可能。所以我们只需要弄清楚如何制造高氢含量的材料。\n到目前为止，这两个最突出的例子都是使用超高压来创造这些材料的。在一个实验中，压力作用于硫化氢，使其分解并挤压出纯硫和某些化学物质的混合物，氢与硫的比例不寻常且不清楚。在另一种实验中，氢和镧的混合物被挤压在一起形成氢化镧，它的晶体结构中含有大量的氢。两者都达到了当时创纪录的温度。", "note_en": "In the period after the discovery of high-temperature superconductors, there wasn&#39;t a good conceptual understanding of why those compounds worked. While there was a burst of progress towards higher temperatures, it quickly ground to a halt, largely because it was fueled by trial and error. Recent years brought a better understanding of the mechanisms that enable superconductivity, and we&#39;re seeing a second burst of rapidly rising temperatures.\n The key to the progress has been a new focus on hydrogen-rich compounds, built on the knowledge that hydrogen&#39;s vibrations within a solid help encourage the formation of superconducting electron pairs. By using ultra-high pressures, researchers have been able to force hydrogen into solids that  turned out to superconduct at temperatures that could be reached without resorting to liquid nitrogen.\n  Now, researchers have cleared a major psychological barrier by demonstrating the first chemical that superconducts at room temperature. There are just two catches: we&#39;re not entirely sure what the chemical is, and it only works at 2.5 million atmospheres of pressure.\n  In a normal material, electrons travel as individuals, bumping into atoms and defects and creating electrical resistance in the process. To superconduct in these materials, the electrons have to find a partner to form what&#39;s called  a Cooper pair. Once paired up, these electrons can travel through the material as a quantum fluid, essentially taking any path available to them. This allows them to avoid all the imperfections that might otherwise slow them down. You&#39;ve got superconductivity.\n To encourage superconductivity, you have to encourage the formation of Cooper pairs, which involves overcoming electrons&#39; natural repulsion. The physics that allows this repulsion to be overcome involves interactions between electrons and the vibrations—called phonons—in the material they reside within.\n High-frequency phonons are the most effective at encouraging Cooper pair formation. And that brings us to hydrogen. The low mass of a hydrogen atom makes high frequency vibrations easier to achieve, which means hydrogen-rich materials are good candidates for high-temperature superconductors.\n To review, hydrogen atoms yield high-frequency phonons, which encourage electron pairs, which enable superconductivity. So we just need to figure out how to make materials with a high hydrogen content.\n So far, the two most prominent examples of this have both used ultra-high pressures to create these materials. In one, the pressures were applied to hydrogen sulfide, causing it to break down and squeeze out a mixture of pure sulfur and some chemical with an unusual and unclear ratio of hydrogen to sulfur. In another, a mix of hydrogen and lanthanum were squeezed together to form a lanthanum hydride, which contained lots of hydrogen within its crystal structure. Both reached record temperatures for the time.", "posttime": "2020-10-14 23:36:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "超导体,pressure,超导", "title": "高压超导体达到室温", "title_en": "High pressure superconductors reach room temperature", "transed": 1, "url": "https://arstechnica.com/science/2020/10/high-pressure-superconductors-reach-room-temperature/", "via": "", "real_tags": ["超导体", "pressure", "超导"]}, {"category": "", "categoryclass": "", "imagename": "e112532777f86df1867019af3e732846.jpg", "infoid": 1028797, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Exec指责移动LTE，他在一次Cableco活动上接受有线电视机构采访时，明确使用了LTE作为康卡斯特的技术总裁。\n在一个具有甜蜜讽刺意味的时刻，康卡斯特的技术总裁在本周的采访中消失了，因为他的互联网连接被切断了-就在他吹嘘有线Wi-Fi连接是多么优越于蜂窝数据之后不久。\n周一，在有线电视技术博览会(Cable-Tec EXPO)的开幕式上，托尼·沃纳(Tony Werner)采访了有线电视行业组织NCTA的总裁迈克尔·鲍威尔(Michael Powell)-和大多数会议一样，今年的博览会已经虚拟化-康卡斯特的高管突然从人们的屏幕上消失了。\n沃纳正在欢呼像他自己的康卡斯特(Comcast)这样的有线电视公司在大流行期间做得如此出色。沃纳嘲笑说：“LTE和无线公司对5G大做文章。”在COVID期间，Wi-Fi承载的通信量是LTE的15倍。我向你保证，无论5G承载什么，10G承载的都会超过这个倍数。这些电视网做得非常好，…“。\n幸运的是，猛烈电信正在观察，并捕捉到了这一时刻和后果。鲍威尔被留下来采访了自己几分钟，直到沃纳重新上线，并发表了一句只有被抓住的有线电视高管才会本能地伸手去说的话：他指责别人。\n“我碰巧在这里使用LTE，”他声称，“所以我停了一两分钟。”\n当然，在为一个非常受欢迎的有线电视行业会议的开幕式采访他所在的有线电视行业最高游说机构的负责人时，无法独立核实康卡斯特的技术总裁是否使用了蜂窝LTE连接。\n常识表明，这一说法的可信度与康卡斯特的一名代表向新订户承诺的那样多，即根据合同，他们的账单将真正保持在每月60美元的水平。\n然而，如果你注册了世博会，并导航到会议的完整档案再次观看这一时刻，你会发现，康卡斯特并没有把自己太当回事，这证明了康卡斯特并没有把自己太当回事，如果你注册了世博会，你会发现…。UM…。这是唯一一次无法观看的会议。\n不过，你不能说沃纳不以身作则。®。\nThe Register-独立于科技界的新闻和观点。情况发布的一部分", "note_en": "Exec blames mobile LTE, which he was definitely using as Comcast’s president of technology while being interviewed by cable body at a cableco event\n  In a moment of sweet irony, Comcast’s president of technology disappeared mid-interview this week after his internet connection cut out – just moments after he boasted about how superior cable Wi-Fi connections were to cellular data.\n  Tony Werner was interviewing Michael Powell, the president of cable industry body NCTA, at the Cable-Tec Expo’s opening session on Monday – which, like most conferences, has gone virtual this year – when the Comcast exec suddenly disappeared from people’s screens.\n  Werner was right in the middle of crowing about how cable companies like his own Comcast were doing such a great job during the pandemic. “The LTE and the wireless guys are making such a big deal out of 5G,” Werner mocked. “During COVID, Wi-Fi is carrying 15 times the amount of traffic than LTE is. I guarantee you that 10G will be carrying more than that times whatever 5G carries. The networks have done really well…”\n    Fortunately, Fierce Telecom was watching and  caught the moment and the aftermath. Powell was left to interview himself for several minutes until Werner popped back online and delivered a line that only a cable exec caught with his pants down would instinctively reach for: he blamed someone else.\n  “I happened to be on LTE here,” he claimed, “and so I dropped for a minute or two.”\n    There is, of course, no way to independently verify that the president of technology for Comcast was using a cellular LTE connection while interviewing the head of his cable industry’s top lobbying body for the opening session of a very popular cable industry conference.\n  Commonsense would suggest the claim be given as much credence as a Comcast rep&#39;s promise to a new subscriber that their bill really will stay at $60 a month as per their contract.\n  Proving that Comcast doesn’t take itself too seriously, however, if you register for the expo and navigate to the conference’s full archive of sessions to watch the moment again, you’ll find that… um… it is the only session that isn’t available to watch.\n  Still, you can’t argue that Werner doesn’t lead by example. ®\n         The Register - Independent news and views for the tech community. Part of Situation Publishing", "posttime": "2020-10-14 23:36:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "移动,cable,有线电视", "title": "康卡斯特的技术总裁下线，同时吹嘘电缆在连接方面有多么棒-Exec指责移动LTE，他在一次Cableco活动上接受有线电视机构采访时，肯定是在使用移动LTE作为康卡斯特的技术总裁", "title_en": "Comcast’s president of tech falls offline while boasting about how great cable is for connectivity - Exec blames mobile LTE, which he was definitely using as Comcast’s president of technology while being interviewed by cable body at a cableco event", "transed": 1, "url": "https://www.theregister.com/2020/10/14/comcast_internet_interview_fail/", "via": "", "real_tags": ["移动", "cable", "有线电视"]}, {"category": "", "categoryclass": "", "imagename": "8cbe44262eb2993b2058e885835c5902.jpg", "infoid": 1028796, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Youtube宣布正在扩大其虚假信息政策，以消除有关新冠肺炎可能接种疫苗的虚假说法。\n与英国NHS或世界卫生组织(World Health Organization)等地方卫生当局相矛盾的说法将被删除。\n这包括声称疫苗会致人死亡或导致不孕不育，以及将微芯片植入接种疫苗的人体内的阴谋论。\n这两种阴谋论最近都在传播。民调显示，福克斯新闻有一半的观众认为，比尔·盖茨希望使用冠状病毒疫苗将微芯片植入美国人体内进行全球监控。\n在伦敦，反封锁和反疫苗接种的抗议者聚集在特拉法加广场，声称冠状病毒是一个骗局，或者，如果存在的话，政府应该结束封锁。\n世界卫生组织表示，针对新冠肺炎的疫苗可能会在2020年底准备就绪。\nCovax全球疫苗设施正在开发9种实验性疫苗，打算在2021年底之前分发20亿剂。\nYouTube已经删除了关于冠状病毒的某些错误信息。这包括声称病毒不存在，不鼓励人们就医的内容，或者质疑当地健康建议的内容。\n自2月份以来，该视频托管网站已经“删除了20多万条与新冠肺炎危险或误导性信息有关的视频”。\n“接近”违反公司社区准则的内容显然不到在美国观看的内容的百分之一。然而，该公司表示，自2019年1月以来，该公司一直在减少对这一边缘内容的推荐。\nYouTube并不是唯一一个努力遏制冠状病毒错误信息的科技巨头。研究显示，社交媒体公司只删除了2%报告的散布疫苗错误信息的帖子。\nFacebook表示，将禁止其平台上不鼓励接种疫苗的广告，但有关政府疫苗政策的广告除外。\nTwitter还增加了新的标签和警告信息，以便为有关冠状病毒的“有争议或误导性信息”的推文“提供额外的上下文和信息”。\n了解更多独立高级评论可由我们会员计划的成员发布，独立高级。它允许我们参与度最高的读者辩论重大问题，分享他们自己的经验，讨论现实世界的解决方案，等等。我们的记者将尝试回应，在他们可能的情况下加入这些帖子，以创造一次真正的独立溢价会议。关于所有主题的最有洞察力的评论将每天发表在专门的文章中。您也可以选择在有人回复您的评论时通过电子邮件发送。\n对于那些没有订阅独立高级的人，现有的开放评论线程将继续存在。由于这个评论社区的巨大规模，我们不能对每个帖子给予同等程度的关注，但出于公开辩论的利益，我们保留了这一区域。请继续尊重所有评论者，并进行建设性的辩论。\n您可能不同意我们的观点，也可能不同意其他用户的观点，但请恭敬地回应\n咒骂、人身辱骂、种族主义、性别歧视、仇视同性恋和其他歧视性或煽动性的语言是不能接受的。\n目前还没有独立的高级评论-请第一个添加您的想法。\n您可能不同意我们的观点，也可能不同意其他用户的观点，但请恭敬地回应。\n咒骂、人身辱骂、种族主义、性别歧视、仇视同性恋和其他歧视性或煽动性的语言是不能接受的。\n想要将您最喜欢的文章和故事加入书签以便以后阅读或参考吗？立即开始您的独立高级订阅。", "note_en": "YouTube has announced that it is expanding its misinformation policy to remove false claims about a potential  Covid-19  vaccination.\n Claims that contradict local health authorities such as the  NHS in the UK, or the World Health Organisation, will be removed.\n  This includes claims that the  vaccine will kill people or cause infertility, as well as  conspiracy theories that  microchips will be implanted in people who receive the vaccine.\n  Both conspiracy theories have been propagated recently. According to polls, half of Fox News viewers believe that  Bill Gates wants to use a coronavirus vaccine to implant microchips into Americans for global surveillance.\n   In London, anti-lockdown and anti-vaccination protestors  gathered in Trafalgar Square, claiming that the coronavirus is a hoax or, should it exist, government lockdowns should end.\n  The World Health Organisation says a vaccine against Covid-19 may be ready  by the end of 2020.\n Nine experimental vaccines are being developed by the Covax global vaccine facility, with the intention to distribute two billion doses by the end of 2021.\n  YouTube already removes certain misinformation about the coronavirus. This includes claims that the virus does not exist, content which discourages people from seeking medical treatment, or content which disputes local health advice.\n The video hosting site has “removed over 200K videos related to dangerous or misleading COVID-19 information” since February.\n  Content that “comes close to” violating the company’s Community Guidelines is apparently less than one percent of content watched in the United States. Nevertheless, the company has been reducing recommendations of this borderline content since January 2019, it says.\n YouTube is not the only technology giant struggling to contain coronavirus misinformation.  Social media companies are only taking down two per cent of reported posts spreading misinformation about vaccines, according to studies.\n  Facebook has said it will  ban ads on its platform that discourage vaccinations, with the exception of adverts about government vaccine policies.\n Twitter also added  new labels and warning messages to “provide additional context and information” to tweets with “disputed or misleading information” about the coronavirus.\n        Learn more  Independent Premium Comments can be posted by members of our membership scheme, Independent Premium. It allows our most engaged readers to debate the big issues, share their own experiences, discuss real-world solutions, and more. Our journalists will try to respond by joining the threads when they can to create a true meeting of independent Premium. The most insightful comments on all subjects will be published daily in dedicated articles. You can also choose to be emailed when someone replies to your comment.\n The existing Open Comments threads will continue to exist for those who do not subscribe to Independent Premium. Due to the sheer scale of this comment community, we are not able to give each post the same level of attention, but we have preserved this area in the interests of open debate. Please continue to respect all commenters and create constructive debates.\n    You may not agree with our views, or other users’, but please respond to them respectfully\n Swearing, personal abuse, racism, sexism, homophobia and other discriminatory or inciteful language is not acceptable\n There are no Independent Premium comments yet - be the first to add your thoughts\n You may not agree with our views, or other users’, but please respond to them respectfully\n Swearing, personal abuse, racism, sexism, homophobia and other discriminatory or inciteful language is not acceptable\n  Want to bookmark your favourite articles and stories to read or reference later? Start your Independent Premium subscription today.", "posttime": "2020-10-14 23:35:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "coronavirus,病毒,youtube,芯片,冠状病毒", "title": "YouTube禁止冠状病毒疫苗将杀死或用于植入监测芯片的错误信息", "title_en": "YouTube bans misinformation that coronavirus vaccine will kill or be used to implant surveillance microchips", "transed": 1, "url": "https://www.independent.co.uk/life-style/gadgets-and-tech/youtube-ban-coronavirus-vaccine-misinformation-kill-microchip-covid-b1037100.html", "via": "", "real_tags": ["病毒", "youtube", "芯片", "冠状病毒"]}, {"category": "", "categoryclass": "", "imagename": "3f8b764dbb0d98caf6e52f769d91c3f3.jpg", "infoid": 1028795, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天我们要挖掘的是一家规模稍大一点的公司。即Databricks，一家数据分析公司，最近在2019年10月的F系列融资4亿美元时估值约为62亿美元。\n该交易所探索初创企业、市场和资金。每天早上在Extra Crunch上阅读它，或者每周六获得Exchange时事通讯。\n截至2020年第三季度末，这家前初创公司的运行率约为3.5亿美元，高于2019年第三季度的2亿美元，对于像它这样规模的前初创公司来说，它的增长速度很快。\n为了更好地挖掘公司的业绩，我与其首席执行官阿里·戈德西通了电话，希望更好地了解Databricks是如何设法实现近几年来如此大的增长的。Ghodsi在担任公司工程副总裁后，于2016年接任首席执行官。他也是联合创始人之一。\nDatabricks显然是IPO候选公司，但考虑到其收入扩张和诱人的经济效益，它也是一家拥有广泛私募市场选择的公司。今天，让我们来谈谈Databricks的成长历史，它是如何改变其销售流程的，以及这家独角兽公司的未来会是什么样子。\nDatabricks实际上是做什么的？通常情况下，我会满足于在数据分析领域挥手，然后就到此为止。然而，与Ghodsi的聊天澄清了这件事，所以让我来帮助你。\n假设一家公司在其机器上有大量数据，并希望知道不同部件何时会发生故障。或者，也许一家公司想要在一些经济数据中找到模式。他们是如何找到这些信息的？\nGhodsi认为你需要三样东西：第一，数据工程，或将客户数据“转换成正确的形式，这样你就可以真正开始使用它”。第二，数据科学，Ghodsi将其描述为“机器学习算法，你需要的预测算法。”第三，他补充说，最重要的是，“越来越多”的公司也想要数据仓库和一些“基本的分析”。", "note_en": "Today we’re digging into a company that is a little bit bigger than that. Namely  Databricks, a data analytics company that was most recently  valued at around $6.2 billion in its October, 2019 Series F when it raised $400 million.\n  The Exchange explores startups, markets and money. Read it  every morning on Extra Crunch, or get  The Exchange newsletter every Saturday.\n  The former startup reached a run rate of around $350 million at the end of Q3 2020, up from $200 million in revenue in Q3 2019, putting it on a rapid growth pace for a former startup of its size.\n To better dig into the company’s performance, I got on the phone with its CEO,  Ali Ghodsi, hoping to better understand how Databricks has managed to grow as much as it has in recent years. Ghodsi took over as CEO in 2016 after serving as the company’s VP of engineering. He’s also a co-founder.\n Databricks is an obvious IPO candidate, but it’s also a company with broad private-market options, given its revenue expansion and attractive economics. Today, let’s talk about Databricks’ growth history, how it changed its sales process, and what’s ahead for the unicorn more than six times over.\n  What does Databricks actually do? Normally I’d be content to wave my hands at data analytics and call it a day. Chatting with Ghodsi, however, clarified the matter, so let me help.\n Let’s say that a company has a lot of data on its machinery and wants to know when different pieces are going to fail. Or, perhaps a company wants find patterns in some economic data. How do they find that information?\n Ghodsi reckons you need three things: First, data engineering, or getting customer data “massaged into the right forms so that you can actually start using it.” Second, data science, which Ghodsi describes as “the machine learning algorithms, the predictive algorithms that you need to have.” And third, on top, companies “more and more” also want data warehousing and some “basic analytics,” he added.", "posttime": "2020-10-14 23:32:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "运行,rate", "title": "\nDatabricks在第三季度突破了3.5亿美元的运行率，高于一年前的2亿美元", "title_en": "\n\t\t\t\tDatabricks crossed $350M run rate in Q3, up from $200M one year ago\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/14/databricks-crossed-350m-run-rate-in-q3-up-from-200m-one-year-ago/", "via": "", "real_tags": ["运行", "rate"]}]