[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1003100, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创建帐户", "note_en": "Create\r\t\t\t\t\t\t\t\t\t\t\tAccount", "posttime": "2020-05-21 17:34:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "唾液,saliva,创建", "title": "6英尺还不够：唾液滴如何在空气中传播", "title_en": "6ft Is Not Always Enough: How Saliva Droplets Spread Through the Air", "transed": 1, "url": "https://spectrum.ieee.org/the-human-os/biomedical/imaging/six-feet-is-not-always-enough-how-saliva-droplets-spread-through-the-air", "via": "", "real_tags": ["唾液", "saliva", "创建"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003099, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "目的：意大利北部的米兰大都市区是受SARS-CoV-2爆发影响最严重的地区之一。然而，轻度冠状病毒的流行趋势仍不清楚。本研究的目的是检查健康无症状成人中SARS-CoV-2感染的血清阳性率、危险因素和实验室相关性。设计：我们在疫情爆发期间进行了一项横断面研究。采用横向流动免疫分析法检测抗SARS-CoV-2 IgM/IgG抗体的存在。地点：一家领先的学术医院的血液中心，作为冠状病毒转诊中心。参与者：我们随机抽取了自疫情爆发以来的献血者样本(2020年2月24日至4月8日，n=789)。主要观察指标：主要结果是IgG/IgM抗SARS-CoV-2抗体的流行率。结果：本试验从疫情开始以来(2020年2月24日至4月8日，n=789)随机抽取献血者。主要观察指标：主要结果是IgG/IgM抗SARS-CoV-2抗体的流行率。结果：0.001)。在疫情爆发之初，SARS-CoV-2的总体血清阳性率为4.6%(2.3vs.7.9%；P&lt；0.0001 vs.120历史对照)。在逐步实施社会疏远措施的研究期间，由于IgG+上升至5%(2.8~8.2；趋势P=0.004，调整后每周增加2.7，SE 1.3%)，血清阳性率逐渐上升至7.1%(4.4~10.8)，但IgM+无明显变化(P=NS)。在多因素Logistic回归分析中，年轻人血清转换为免疫球蛋白的频率较高(P=0.043)，而新近感染(IgM+)的年龄较大(P=0.002)。IgM+与较高的甘油三酯、嗜酸性粒细胞和淋巴细胞独立相关(P&lt；0.05)。结论：SARS-CoV-2感染在疫情开始时已经在米兰流行。社交距离在年轻人中可能更有效，到4月底，4.4%-10.8%的健康成年人有血清转换的证据。无症状感染可能会影响血脂和血细胞计数。\n这项研究由Ricerca Corente IRCCS Ca Granda Ospedale Maggiore Policlinico(机构对DP的资助)资助；冠状病毒网络注册表生物库，Fondazione IRCCS Ca Granda Ospedale Magiclinico(LV)资助；Ricerca Finalizzata Minesero della Salut(意大利卫生部)RF-2016-02364358(LV)，FondaziaFondazione IRCCS Ca Granda Ospedale Maggiore Policlinico(意大利卫生部)RF-2016-02364358(LV)。\n所有相关的道德准则都得到了遵守；任何必要的IRB和/或伦理委员会的批准都已经获得，IRB/监督机构的详细信息也包括在手稿中。\n已获得所有必要的患者/参与者同意，并已将适当的机构表格存档。\n我理解所有临床试验和任何其他预期干预研究必须在ICMJE批准的注册机构注册，如ClinicalTrials.gov。我确认手稿中报告的任何此类研究都已注册，并提供了试验注册ID(注意：如果张贴追溯注册的前瞻性研究，请在试验ID字段中提供一份声明，说明为什么没有提前注册该研究)。\n我已遵循所有适当的研究报告指南，并上传了相关的赤道网络研究报告核对表和其他相关材料作为补充文件(如果适用)。", "note_en": "Objectives: The Milan metropolitan area in Northern Italy was among the most severely hit by the SARS-CoV-2 outbreak. The epidemiological trends of mild COVID-19 are however still unknown. The aim of this study was to examine the seroprevalence of SARS-CoV-2 infection in healthy asymptomatic adults, the risk factors, and laboratory correlates.Design: We conducted a cross-sectional study during the outbreak. Presence of anti-SARS-CoV-2 IgM/IgG antibodies against the Nucleocapsid protein was assessed by a lateral flow immunoassay.Setting: Blood center at a leading academic hospital serving as COVID-19 referral center.Participants: We considered a random sample of blood donors since the start of the outbreak (February 24th to April 8th 2020, n=789).Main outcome measures: The main outcome was the prevalence of IgG/IgM anti-SARS-CoV-2 antibodies .Results: The test had a 98.3% specificity and 100% sensitivity, and for IgG was validated in a subset by an independent ELISA against the Spike protein (N=34, P&lt;0.001). At the start of the outbreak, the overall seroprevalence of SARS-CoV-2 was 4.6% (2.3 to 7.9; P&lt;0.0001 vs. 120 historical controls). During the study period characterized by a gradual implementation of social distancing measures, there was a progressive increase in seroprevalence to 7.1% (4.4 to 10.8), due to a rise in IgG+ to 5% (2.8 to 8.2; P=0.004 for trend, adjusted weekly increase 2.7, SE 1.3%), but not of IgM+ (P=NS). At multivariate logistic regression analysis, seroconversion to IgG was more frequent in younger (P=0.043), while recent infections (IgM+) in older individuals (P=0.002). IgM+ was independently associated with higher triglycerides, eosinophils, and lymphocytes (P&lt;0.05).Conclusions: SARS-CoV-2 infection was already circulating in Milan at the outbreak start. Social distancing may have been more effective in younger individuals, and by the end of April 4.4-10.8% of healthy adults had evidence of seroconversion. Asymptomatic infection may affect lipid profile and blood count.\n      The study was funded by Ricerca Corrente Fondazione IRCCS Ca\u0092 Granda Ospedale Maggiore Policlinico (Institutional funding to DP); COVID-19 Network Registry Biobanking, Fondazione IRCCS Ca\u0092 Granda Ospedale Maggiore Policlinico (LV); Ricerca Finalizzata Ministero della Salute (Italian Ministry of Health) RF-2016-02364358 (LV), Fondazione Sviluppo Ca\u0092 Granda for the project Liver-Bible - PR-0361 (LV); the EU Programme Horizon 2020 (under grant agreement No. 777377) for the project LITMUS (LV).\n  All relevant ethical guidelines have been followed; any necessary IRB and/or ethics committee approvals have been obtained and details of the IRB/oversight body are included in the manuscript.\n  All necessary patient/participant consent has been obtained and the appropriate institutional forms have been archived.\n  I understand that all clinical trials and any other prospective interventional studies must be registered with an ICMJE-approved registry, such as ClinicalTrials.gov. I confirm that any such study reported in the manuscript has been registered and the trial registration ID is provided (note: if posting a prospective study registered retrospectively, please provide a statement in the trial ID field explaining why the study was not registered in advance).\n  I have followed all appropriate research reporting guidelines and uploaded the relevant EQUATOR Network research reporting checklist(s) and other pertinent material as supplementary files, if applicable.", "posttime": "2020-05-21 17:12:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "covid,研究", "title": "研究发现，在大流行开始时，伦巴第已存在Covid抗体", "title_en": "Study found Covid antibodies already present in Lombardy at start of pandemics", "transed": 1, "url": "https://www.medrxiv.org/content/10.1101/2020.05.11.20098442v1", "via": "", "real_tags": ["covid", "研究"]}, {"category": "", "categoryclass": "", "imagename": "e392e113ed3890a8318aca00e259a02e.jpg", "infoid": 1003098, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Automattic的这笔投资的估值高于New Vector上一次收购的估值，延长了去年850万美元的首轮融资，这笔资金来自企业技术专业公司Concept Capital和曙光资本(Dawn Capital)，外加欧洲种子基金FirstMinint Capital-使迄今筹集的资金总额达到1810万美元。(其中包括早些时候来自一款基于以太网的安全聊天和加密钱包应用Status的500万美元战略投资)。\nNew Vector的去中心化技术为许多政府用户提供即时通讯功能，包括法国(法国去年分叉Riot推出了一款通讯应用程序(TCHAP))和德国(刚刚宣布其武装部队将采用Matrix作为所有内部通信的主干)，以及KDR、Mozilla、RedHat和维基媒体(Wikimedia)等公司。\n让Automattic加入显然是Matrix的一个重大战略推动-这让New Vector有了远大的梦想。\nNew Vector首席执行官兼首席技术官兼Matrix联合创始人马修·霍奇森告诉TechCrunch：“这是向前迈出的一大步。”“我们希望得到Automattic的支持，真正扩展生态系统，将Matrix功能引入WordPress--以及Automattic所做的各种WordPress插件。同样，Matrix也向所有这些用户开放。“。\n一篇宣布战略投资的博客文章提出了一个耐人寻味的可能性，即去中心化的Tumblr-或者所有WordPress网站自动获得自己的Matrix聊天室。\nNew Vector在博客中写道：“这是一个巨大的消息，尤其是因为WordPress实际上运营着当今网络上超过36%的网站--将Matrix带给所有这些用户的潜力是令人难以置信的。”“想象一下，如果每个可湿性粉剂网站自动附带自己的矩阵室或社区？想象一下，如果可湿性粉剂中的所有内容都自动发布到矩阵和网络上？…。想象一下，有一个出色的Matrix客户端可以作为WordPress插件将实时聊天嵌入到您的站点中？“。\n就目前而言，这些可能性仍然是耐人寻味的想法。但是，除了向New Vector Automattic投入大量资金之外，它还为Matrix.org/WordPress集成工程师打开了一个职位--因此Matrix团队有另一个明确的理由对未来的集成感到兴奋。\nHodgson补充道：“其中一位最优秀和最大的开源人员非常相信我们正在做的事情，并对尝试将WordPress的世界打开到Matrix分散的世界感兴趣。”在某些方面，像Automattic这样相对成熟的公司正着眼于地平线，把他们的芯片放在分散的未来，这是令人欣慰的。而他们可以‘做个Facebook’，无所事事，把所有事情都集中起来，尽可能地锁定。“\nMatrix联合创始人兼New Vector运营和产品负责人阿曼丁·勒·佩普(Amandine Le Pape)表示：“这有点像是一种验证。”“同样，从风投公司获得资金也证明了这是一项可行的业务。这是一种验证，它实际上是一个可以真正成长的主流开源项目。“。\n虽然Automattic的战略投资提议显然只是New Vector抓住的一个绝佳机会，但考虑到意识形态的一致性和整合潜力，根据Le Pape的说法，这也是一个很有帮助的时机，因为他们一直在发展SaaS业务。\n霍奇森补充说：“我们正在考虑与New Vector to Go和Drive合作的商业模式--既为Matrix提供资金，又保持项目和公司的发展，与Automattic与WordPress.com的成功合作非常非常相似。”“因此，能够直接与他们的董事会和我们的董事会比较笔记，告诉他们如何在WordPress.org和WordPress.com的拆分之间实现这一点，对我们来说应该是一个真正有用的工具。”\n虽然Matrix用户可以选择托管他们自己的服务器，但这样做显然会带来很高的复杂性(以及潜在的开销)。因此，New Vector的商业模式是提供一种名为Modular的付费Matrix托管服务，它负责付费托管的复杂性。(Modular网站上的营销手册敦促潜在客户：“注册并在几秒钟内部署您自己的安全聊天服务！”)。\n“显然，我们的一些最知名的客户，如Mozilla，可以自己去运营它。莫兹拉懂技术。但实际上，对他们来说，直接让我们来运营要容易得多，总体上也便宜得多。“霍奇森补充道。“好的是，他们对自己的数据拥有完全的自我主权。这是他们的DNS。我们给他们访问数据库的权限。他们可以在任何时候离开…。切换主机提供程序或自己运行它。(用户)通常从我们开始，以此作为启动和运行的一种方式。“。\n在谈到搬家时，霍奇森表示，他预计Automattic在这笔投资之后将从Slake转移到Riot。\nAutomattic创始人马特·穆伦韦格在一份支持声明中补充说：“我对New Vector与Matrix所做的事情感到非常兴奋--创建一种强大、安全、开放的协议，可以像网络或电子邮件具有其基础层那样，将各种类型的即时消息和协作结合在一起。”我赞同New Vector对开放源码的热情和开放标准的力量。我很高兴看到Automattic公司和New Vector公司在未来如何就我们共同的愿景进行合作。“。\nMullenweg已经是Matrix的支持者，早在2017年就通过Patreon加入了它的种子。当时，该团队正从孵化和完全由Amdocs(一家电信供应商，New Vectors的联合创始人曾在那里工作(管理其统一的通信部门)提供资金)过渡到分拆并四处寻找新的资金来源，以继续开发他们分散的标准。\n大约三年过去了-现在银行里又有了数百万美元的资金-霍奇森表示，New Vector能够考虑未来的盈利前景，目前拥有约1680万用户和4.5万部署(高于10月份的1100万和4万)。\n他告诉我们：“我认为也有很高的机会--摸着石头过河--如果需要的话，这笔注资会给我们提供一条直接实现盈利的途径。”“鉴于(冠状病毒)大流行带来的宏观经济不确定性，有机会说我们银行里有这么多现金，假设我们的客户大致遵循我们到目前为止看到的轨迹，…。这将是一种在不依赖任何进一步资金的情况下走出另一边的方法。\n“如果事情进展顺利，我们明年可能会增加资金，以便加倍取得成功。但现在，这至少给了我们一个相当厚实的安全网。“。\n根据霍奇森的说法，冠状病毒危机一直在“显著”加速人们对Matrix的兴趣，因为那些可能一直在考虑转向分散通信的实体感到，控制他们的数据的必要性要大得多--因为现在有这么多用户在家里登录。\n“随着封锁的开始，我们看到注册人数增加了大约10倍，”他说。“它是逐渐减少了一点，但一夜之间就成了一场真正的规模戏剧性事件。”我们不得不在Jitsi的产品上推出一套全新的视频会议部署，并将我们运行的服务的硬件规模扩大几倍。\n“我们也看到留存率上升，这很好。我们假设会有一大批用户拼命地想要找个家，然后他们就不一定会留下来了。实际上，他们比现有的用户群留在了更多的地方，这是令人放心的。\n在某些情况下，New Vector发现客户从根本上缩短了计划部署时间-从几个月缩短到几天。\n霍奇森表示：“我们在德国确实有一家(教育)机构在9月份进行了招标-我们希望你在周一上线。”他指出，在这种情况下，客户跳过了整个招标过程，因为他们觉得他们需要一个安全的系统，可以让学校的孩子使用。(出于隐私考虑，排除了使用Zoom或Microsoft Teams等集中化选项的可能性。)\n他补充说：“至少从新矢量的角度来看，最大的影响是，我们许多移动较慢、较大的机会-特别是在与政府合作的公共部门-突然大幅加速。”“因为以前拥有优质服务是件好事-‘如果我们有自己的加密信使，如果每个人都不使用Telegram或WhatsApp来管理我们的国家，那不是很好吗？’然后突然之间，随着任何一个国家的所有人口突然不得不远程工作，拥有高质量的通信成为事关生死存亡的要求，拥有这种加密和自我主权是一件巨大的事情。”\n根据Hodgson的说法，就与Slake(等人)竞争而言，最大的考虑是可用性和UX。\n因此，在过去的一年里，New Vector聘请了一个专门的内部设计团队来专注于平滑任何过于极客的边缘-尽管这项工作的大部分工作还没有推向用户。\n他说：“实际上，我们已经将Riot的整个开发转变为以设计为主导。”“现在不再是像我这样的一大群开发人员去研究它了--取而代之的是产品所有者和产品方向由设计团队制定。”就焦点和可用性而言，这是一个无法辨认的差异。\n“在未来的一年里，我们预计Riot将基本上得到重建，至少是在外观上，以摆脱我们今天所拥有的复杂性、极客气质和IRC的后遗症，转而支持某种能够真正打击松弛和不和谐的东西。”\n在最近的另一个重大发展中，New Vector在Riot中开启了端到端加密，使其成为所有新的非公开对话(DM和私人聊天)的默认加密。\n“这相当于电子邮件突然授权PGP，并设法不破坏一切，”霍奇森在谈到这一壮举时说。\n一个关键的挑战是在Matrix的非加密版本可以在任何地方启用之前与用户“平价”-以及相关的问题需要解决，比如搜索。\n“通常情况下，我们在服务器上进行搜索，如果邮件是加密的，服务器显然无法对它们进行索引-所以我们不得不将所有搜索功能转移到客户端运行。我们编写了一整套REST，允许您在客户端(包括桌面版本)将搜索引擎嵌入到Riot中，这样人们就可以在那里实际访问他们的加密消息历史记录，并在设备之间共享它，“他解释说。\ne2e的另一个关注点是验证过程-这也是现在默认情况下内置的。\n“当您现在登录Riot时，如果您已经登录到某个地方，它会强制您扫描现有登录的二维码。这有点像你在WhatsApp网站上所做的，但它不只是用它来验证你的身份，它还会用来证明你在这个账户上是合法的，“他说。“所以其他每个人都知道要完全信任那个登录--这样，如果发生了某种攻击，如果你的管理员试图向你的账户添加恶意设备来监视你，或者如果有中间人攻击，或者诸如此类的事情，每个人都可以看到不受信任的设备没有经过你的验证。”\n“它基本上是在你的设备和即时联系人之间建立一个简单的信任网络，这样你就可以完全保护自己免受幽灵设备或其他更肮脏的尝试的攻击，从而危及账户的安全。在创建非常非常强大的端到端加密方面，我认为使用二维码和使用表情符号比较而不是相互读出数字的组合现在几乎是独一无二的。“。\ne2e加密矩阵使用的是基于信号协议推广的算法。NCC集团在2016年对其进行了审计，但新资金的计划包括全栈审计-一旦他们解决了新的默认e2e的任何初期问题。\n“(我们希望)至少选择一条路径，一组特定的客户端和服务器，因为我们不能做所有的事情，显然，因为Matrix现在有60-70个不同的应用程序，或者说不同的客户端。至少有四个可行的服务器实现，但我们将选择长期支持的官方路径，至少找到一套我们可以审计并推荐给政府的方案，“霍奇森在谈到审计计划时说。\n他们还在与Jitsi合作一个项目，使后者的WebRTC兼容的视频会议平台e2e也进行加密-另一个关键部分是Jitsi的技术是New Vector通过Matrix提供的视频通话。\n我们在视频会议方面与JITSI合作，我们正在与他们合作开发e2e加密视频会议…。他们(最近)推出了世界上第一个基于WebRTC的e2e加密会议。他们计划使用Matrix作为交换密钥的方式-也使用所有的验证过程[New Vector已经为Riot开发]。因为端到端加密很棒，显然在保护数据方面--但是如果你不知道你在和谁交谈，在验证他们的身份方面，这完全是浪费时间，“Hodgson补充道。\n因此，当JITSI的e2e加密发布时，New Vector将能够将e2e加密的视频会议也作为其分散捆绑包的一部分。\n在接下来的12个月里，New Vector对Matrix的增长预期是多少？他在谈到这一点时表示：“去年，我们几乎将网络的所有规模指标增加了两倍，我认为前一年我们增加了两倍，所以我希望我们能继续沿着这条轨道前进。”\nNew Vector自去年年底以来一直致力于的另一个“有趣的事情”是Matrix的对等版本-开发了一个“足够轻量级的服务器实现”，允许Matrix用户通过网络浏览器(或移动设备上的应用程序)在分散的P2P空间中运行“Riot”。\n“大约一个月前，我们开启了点对点网络，他们现在正处于让它持久的阶段-以前，如果网络上的所有客户端都消失了，那么整个网络就会消失，而现在，即使人们开始重新启动浏览器和应用，它也有能力持续下去。”这在很大程度上是一个疯狂的科学项目，但据我所知，没有其他人能在这个范围内做到这一点，“他说。\n“令人高兴的是，它的外观和感觉都与今天的Matrix一模一样。您可以使用所有的客户端、人们已经编写的…的所有网桥。只是碰巧暴动正在连接一个嵌入自身的服务器，而不是与坐在服务器…上的服务器对话。所以这是一个彻底的范式转变。“。\n他补充说：“我们根本不确定它会不会奏效，但实际上，它的效果比我们预期的要好。”“在未来一年左右的时间里，我们预计会看到越来越多的人强调点对点--甚至可能是在默认情况下。因此，如果您安装了Riot，您就不必选择一台服务器，并经历一件相当繁琐的事情，即找出值得信任的服务提供商，您是想以New Vector的身份从我们这里购买一台，还是想去瑞士的ISP那里买一台。取而代之的是，你可以开始在一个纯粹的点对点的陆地上漂洋过海，然后如果你想把你的数据保存在某个地方，那么你可以去找一个服务器，把你自己固定在互联网上的一个家里。但这将是一种完全不同的思考方式。“。\n那些对P2P去中心化IM感兴趣的人可以通过p2p.riot.im在Web浏览器中体验这种风格的Riot", "note_en": "The investment by Automattic, which is at a higher valuation than the last tranche  New Vector   took in, extends an  $8.5M Series A last year, from enterprise tech specialists  Notion Capital and  Dawn Capital plus European seed fund  Firstminute Capital — and brings the total raised to date to $18.1M. (Which includes an earlier  $5M in strategic investment from an Ethereum-based secure chat and crypto wallet app,  Status).\n New Vector’s decentralized tech powers instant messaging for a number of government users, including France — which forked  Riot   to launch a messaging app last year ( Tchap) — and Germany, which  just announced its armed forces will be adopting Matrix as the backbone for all internal comms; as well as for the likes of KDR, Mozilla, RedHat and Wikimedia, to name a few.\n  Getting Automattic on board is clearly a major strategic boost for  Matrix   — one that’s allowing New Vector to dream big.\n “It’s very much a step forwards,” New Vector CEO and CTO and Matrix co-founder, Matthew Hodgson, tells TechCrunch. “We’re hopefully going to get the support from Automattic for really expanding the ecosystem, bringing Matrix functionality into WordPress — and all the various WordPress plugins that Automattic does. And likewise open up Matrix to all of those users too.”\n A blog post announcing the strategic investment dangles the intriguing possibility of a decentralized Tumblr — or all WordPress sites automatically getting their own Matrix chatroom.\n “This is huge news, not least because WordPress literally runs over 36% of the websites on today’s web – and the potential of bringing Matrix to all those users is incredible,” New Vector writes in the blog post . “Imagine if every WP site automatically came with its own Matrix room or community?  Imagine if all content in WP automatically was published into Matrix as well as the Web?…  Imagine there was an excellent Matrix client available as a WordPress plugin for embedding realtime chat into your site?”\n Those possibilities remain intriguing ideas for now. But as well as ploughing funding into New vector Automattic is opening up a job for a Matrix.org/WordPress integrations engineer — so the Matrix team has another tangible reason to be excited about future integrations.\n “One of the best and the biggest open source guys really believes in what we’re doing and is interested in trying to open up the worlds of WordPress into the decentralized world of Matrix,” adds Hodgson. “In some ways it’s reassuring that a relatively established company like Automattic is keeping its eye on the horizon and putting their chips on the decentralized future. Whereas they could be ‘doing a Facebook’ and just sitting around and keeping everything centralized and as locked down as possible.”\n “It’s a bit of a validation,” says Matrix co-founder and New Vector head of ops and products, Amandine le Pape. “The same way getting funding from VCs was validation of the fact it’s a viable business. Here it’s a validation it’s actually a mainstream open source project which can really grow.”\n  While the strategic investment offer from Automattic was obviously just a great opportunity to be seized by New vector, given ideological alignment and integration potential, it also comes at helpful time, per le Pape, given they’ve been growing their SaaS business.\n “The business model that we’re looking at with New Vector to go and drive — both to fund Matrix and also to keep the lights on and grow the projects and the company — is very, very similar to what Automattic have successfully done with WordPress.com,” adds Hodgson. “So being able to compare notes directly with their board and our board to go and say to them how do you make this work between the WordPress.org and the WordPress.com split should be a really useful tool for us.”\n While Matrix users can choose to host their own servers there’s obviously a high degree of complexity (and potential expense) involved in doing so. Hence New Vector’s business model is to offer a paid Matrix hosting service, called  Modular, where it takes care of the complexity of hosting for a fee. (Marketing copy on the  Modular website urges potential customers to: “Sign up and deploy your own secure chat service in seconds!”)\n “Some of our highest profile customers like Mozilla could go and run it themselves, obviously. Mozilla know tech. But in practice it’s a lot easier and a lot cheaper overall for them to just go and get us to run it,” adds Hodgson. “The nice thing is that they have complete self sovereignty over their data. It’s their DNS. We give them access to the database. They could move off at any time… switch hosting provider or run it themselves. [Users] typically start off with us as a way to get up and running.”\n Talking of moving, Hodgson says he expects Automattic to move over from Slack to Riot following this investment.\n “I am very excited about what New Vector is doing with Matrix — creating a robust, secure, open protocol that can bring all flavors of instant messaging and collaboration together, in the way that the web or email has its foundation layer,” added Automattic founder, Matt Mullenweg, in a supporting statement.  “I share New Vector’s passion for open source and the power of open standards. I’m excited to see how Automattic and New Vector can collaborate on our shared vision in the future.”\n Mullenweg was already a supporter of Matrix, chipping into its seed via  Patreon back in 2017. At the time the team was transitioning from being incubated and wholly financed by Amdocs, a telco supplier where New Vectors’ co-founders used to work (running its unified comms division), to spinning out and casting around for new sources of funding to continue development of their decentralized standard.\n Some three years on — now with another multi-million dollar tranche of funding in the bank — Hodgson says New Vector is able to contemplate the prospect of profitability ahead, with ~16.8 million users and 45,000 deployments at this point (up from 11M and 40k back in October).\n “I think there’s also a high chance — touch wood — that this injection gives us a path straight through to profitability if needed,” he tells us. “Given the macroeconomic uncertainty thanks to the [COVID-19] pandemic, the opportunity to say we have this amount of cash in the bank, assuming our customers follow roughly the trajectory that we’d seen so far… this would be a way to get out the other side without having to depend on any further funding.\n “If things are on track we probably would do additional funding next year in order to double down on the success. But right now this at least gives us a pretty chunky safety net.”\n The coronavirus crisis has been accelerating interest in Matrix “significantly”, per Hodgson, as entities that might have been contemplating a switch to decentralized comms down the line feel far greater imperative to take control of their data — now that so many users are logging on from home.\n “As lockdowns began we saw sign ups increase by a factor of about 10,” he says. “It’s tapered off a little bit but it was a real scaling drama overnight. We had to launch an entirely new set of videoconferencing deployments on  Jitsi’s   offering, as well as scaling up the hardware for the service which we run by several times over.\n “We’re also seeing retention go up, which was nice. We assumed there would be a huge spike of users desperately trying to find a home and then they wouldn’t necessarily stick around. In practice they’ve stuck around more than the existing user base which is reassuring.”\n In some cases, New Vector has seen customers radically shrink planned deployment timescales — from months to a matter of days.\n “We literally had one [educational] outfit in German reach out and say that tender in September — we want you to go live on Monday,” says Hodgson, noting that in this instance the customer skipped the entire tendering process because of they felt they needed a secure system school kids could use. (And privacy concerns ruling out use of centralized options  such as Zoom or Microsoft Teams.)\n “The biggest impact from a New Vector perspective at least has been that a lot of our slower moving, bigger opportunities — particularly in the public sector with governments — have suddenly sped up massively,” he adds. “Because it was previously a nice to have premium thing — ‘wouldn’t it be good if we had our own encrypted messenger and if everybody wasn’t using Telegram or WhatsApp to run our country’ — and then suddenly, with the entire population of whichever country it might be suddenly having to work remotely it’s become an existential requirement to have high quality communication, and having that encrypted and self sovereign is a massive deal.”\n In terms of competing with Slack (et al), the biggest consideration is usability and UX, according to Hodgson.\n So, over the last year, New Vector has hired a dedicated in-house design team to focus on smoothing any overly geeky edges — though most of this work is yet to be pushed out to users.\n “We’ve actually pivoted the entire development of Riot to be design led,” he says. “It’s no longer a whole bunch of developers, like myself, going and hacking away on it — instead the product owner and the product direction’s being laid by the design team. And it is an unrecognizable difference — in terms of focus and usability.\n “Over the coming year we are expecting Riot to basically be rebuilt at least cosmetically to get rid of the complexity and the geekiness and the IRC hangovers which we have today in favor of something that can genuinely punch its weight against Slack and Discord.”\n In another major recent development New Vector  switched on end-to-end encryption across the piece in Riot, making it the default for all new non-public conversations (DMs and private chats).\n “It’s the equivalent of email suddenly mandating PGP and managing not to break everything,” says Hodgson of that feat.\n A key challenge was to “get parity” with users of the non-encrypted version of Matrix before it could be enabled everywhere — with associated problems to tackle, such as search.\n “Typically we were doing search on the server and if the messages are encrypted the server obviously can’t index them — so we had to shift all of our search capabilities to run client side. We went and wrote a whole bunch of REST that allows you to basically embed a search engine into Riot on the client, including on the desktop version, so that people can actually reach their encrypted message history there and share it between devices,” he explains.\n Another focus for the e2e was the verification process — which is also now built in by default.\n “When you now log into Riot it forces you to scan a QR code on an existing login if you’ve already logged in somewhere. A bit like you do on WhatsApp web but rather than just using it to authenticate you it also goes and proves that you are a legitimate person on that account,” he says. “So everyone else then knows to trust that login completely — so that if there is an attack of some kind, if you admin tries to add a malicious device into your account to spy on you or if there’s a man-in-the-middle attack, or something like that, everybody can see that the untrusted device hasn’t been verified by you.\n “It’s basically building out a simple web of trust of your devices and immediate contacts so that you have complete protection against ghost devices or other nastier attempts to go and compromise the account. The combination of using QR codes and also using emoji comparison rather than having to read out numbers to one another is I think almost unique now, in terms of creating really, really super robust end-to-end encryption.”\n The e2e encryption Matrix uses is based on algorithms popularized by the Signal protocol. It was audited by NCC Group in 2016 but plans for the new funding include a full stack audit — once they’ve ironed out any teething issues with the new default e2e.\n “[We want to] at least pick a path, a particular set of clients and servers — because we can’t do the whole thing, obviously, because Matrix has got 60-70 different apps on it now, or different clients. And there are at least four viable server implementations but we will pick the long term supported official path and at least find a set which we can then audit and recommend to governments,” says Hodgson of the audit plans.\n They’re also working with  Jitsi on  a project to make the latter’s WebRTC-compatible videoconferencing platform e2e encrypted too — another key piece as Jitsi’s tech is what New Vector offers for video calling via Matrix.\n “We partner with Jitsi for the videoconferencing side of things and we’re working with them on their e2e encrypted videoconferencing… They [recently] got the world’s first  WebRTC  -based e2e encrypted conferencing going. And they plan to use Matrix as the way to exchange the keys for that — using also all of the verification process [New Vector has developed for Riot]. Because end-to-end encryption’s great, obviously in terms of securing the data — but if you don’t know who you’re talking to, in terms of verifying their identity, it’s a complete waste of time,” adds Hodgson.\n So when Jitsi’s e2e encryption launches New Vector will be able to include e2e encrypted videoconferencing as part of its decentralized bundle too.\n How much growth is New Vector expecting for Matrix over the next 12 months? “We’ve tripled almost all of the sizing metrics for the network in the last year, and I think we tripled the year before that so I’m hoping that we can continue on that trajectory,” he says on that.\n Another “fun thing” New Vector has been working on, since the end of last year, is a peer-to-peer version of Matrix — having developed a “sufficiently lightweight server implementation” that allows Matrix users to run ‘riot’ in a decentralized p2p space via a web browser (or via the app on a mobile device).\n “We turned on the peer-to-peer network about a month ago now and they’re at the point right now of making it persistent — previously if all of the clients on the network went away then the entire network disappeared, whereas now it has the ability to persist even if people start restarting their browsers and apps. And it’s very much a mad science project but as far as I know nobody else is remotely in that ballpark,” he says.\n “The nice thing is it looks and feels identical to Matrix today. You can use all of the clients, all of the bridges that people have already written… It just happens to be that the Riot is connecting to a server wedged into itself rather than talking to one sitting on the server… So it’s a total paradigm shift.”\n “We weren’t sure it was going to work at all but in practice it’s working better than we could have hoped,” he adds. “Over the next year or so we’re going to expect to see more and more emphasis on peer-to-peer — possibly even by default. So that if you install Riot you don’t have to pick a server and go through this fairly clunky thing of figuring out what service provider to trust and do you want to buy one from us as New Vector or do you want to a Swiss ISP. Instead you can start off bobbing around the ocean in a pure peer-to-peer land, and then if you want to persist your data somewhere then you go and find a server to pin yourself to a home on the Internet. But it would be a completely different way of thinking about things.”\n Those interested in dipping a toe in p2p decentralized IM can check out this flavor of Riot in a web browser via  p2p.riot.im", "posttime": "2020-05-21 17:11:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "增长,grow,matrix", "title": "Automattic向新矢量注资460万美元帮助增长Matrix", "title_en": "Automattic pumps $4.6M into New Vector to help grow Matrix", "transed": 1, "url": "https://techcrunch.com/2020/05/21/automattic-pumps-4-6m-into-new-vector-to-help-grow-matrix-an-open-decentralized-comms-ecosystem/", "via": "", "real_tags": ["增长", "grow", "matrix"]}, {"category": "", "categoryclass": "", "imagename": "8138d6e74e2bedb52ea6a57c65ebd7a3.png", "infoid": 1003097, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们非常兴奋地宣布，WordPress.com的创建者Automattic将首先进入Matrix生态系统，向New Vector(制作Riot和Modular.im的公司，由核心Matrix团队于2017年创立)投资近500万美元。更重要的是，Matt Mullenweg(WordPress的联合创始人和Automattic的创始人)和Automattic团队承诺在未来的工作中最大限度地利用Matrix！\n这是一个巨大的消息，尤其是因为WordPress确实运行着当今网络上超过36%的网站-将Matrix带给所有这些用户的潜力是令人难以置信的。想象一下，如果每个可湿性粉剂网站都自动附带自己的Matrix房间或社区？想象一下，如果WP中的所有内容都自动发布到Matrix和Web上，会是什么样子？(到目前为止，这还不是个好主意--原来Automattic已经在im.wordpress.com上为WordPress.com运行了一个XMPP桥！)。想象一下，有一个很棒的Matrix客户端可以作为WordPress插件嵌入到您的站点中进行实时聊天？想象一下，如果Tumblr(现在是Automattic的一部分)变得分散了！？\n事实上，如果您是Matrix或WordPress社区的开发人员，现在可能是考虑如何跨越这些流的好时机……。尤其是因为Automattic刚刚为Matrix.org/WordPress集成工程师提供了一个职位！撇开投资不谈，这表明Automattic对Matrix是认真的-我们要感谢他们在这个充满挑战的时代为Matrix提供了更多的工作机会，进一步加速了Matrix的发展。也许有一天，矩阵工程师会像Web开发人员一样成为常见的职业选择。)。\n这就是说，现在整合工作还为时过早，除了对New Vector的投资(这实际上是NV在10月份筹集的资金的延伸)和Automattic的职位空缺之外，还没有什么具体的项目要宣布-但这些都是我们一直在考虑的想法。至少，在接下来的几个月里，我们应该会看到Automattic的社区迁移到Matrix上。\n与Matt和团队在这方面合作非常有趣：我们看到在对开放网络、开放源码和开放标准的真正热爱方面存在巨大的重叠。马特(独立于Automattic)在2017年我们最需要的时候通过Patreon向Matrix捐赠了大量资金，这也不是巧合。我们也期待着从Automattic在可持续和负责任地资助和发展开源项目方面的经验中获益-WordPress.com是一个很好的例子，说明了如何在不影响开源性质的情况下支持像WordPress这样的项目的开发。\n因此，我们想正式欢迎WordPress和Automattic家族的其他成员加入Matrix。这是令人难以置信的激动人心的时刻，我们迫不及待地想看看合作会有什么结果！同时，如果任何其他大型开源组织想要加入Automattic和Mozilla的行列，跳进Matrix，您知道在哪里可以找到我们的…。：D。\n非常感谢马特相信“黑客帝国”--关注这个空间的更新。", "note_en": "We’re very excited indeed to announce that  Automattic, the creators of  WordPress.com, are jumping head first into the Matrix ecosystem with a strategic investment of almost $5M into  New Vector (the company which makes  Riot and  Modular.im, founded by the core Matrix team in 2017). More importantly, Matt Mullenweg (co-founder of WordPress and founder of Automattic) and the Automattic gang are committing to make the most of Matrix in their work going forwards!\n This is huge news, not least because WordPress literally runs over 36% of the websites on today’s web - and the potential of bringing Matrix to all those users is incredible. Imagine if every WP site automatically came with its own Matrix room or community? Imagine if all content in WP automatically was published into Matrix as well as the Web? (This isn’t so far fetched an idea - turns out that Automattic already runs a XMPP bridge for wordpress.com over at  im.wordpress.com!). Imagine there was an excellent Matrix client available as a WordPress plugin for embedding realtime chat into your site? Imagine if  Tumblr (which is part of Automattic these days) became decentralised!?\n In fact, if you’re a developer in either the Matrix or WordPress communities, now might be a good time to think about how to cross the streams.... not least because Automattic just opened up a role for a  Matrix.org/WordPress Integrations Engineer! Quite aside from the investment, this shows Automattic is serious about Matrix - and we’d like to thank them for opening up jobs in these challenging times to further accelerate Matrix. Perhaps some day Matrix Engineer will be as common a career choice as Web Developer ;)\n That said, it’s super early days for integration work, and there isn’t a concrete project to announce yet beyond the investment in New Vector (which is effectively an extension of the funding NV raised in October) and Automattic’s Job opening - but these are the sort of ideas we’ve been kicking around. And at the very least, we should expect to see Automattic’s communities migrating over to Matrix in the coming months.\n It’s been loads of fun working with Matt and the team on this: we see a huge overlap in terms of a genuine love for the open web, open source and open standards. It’s also no coincidence that Matt (independently of Automattic) donated substantially to Matrix via Patreon back in 2017 when we needed it the most. We’re also looking forward to benefiting from Automattic’s experience in sustainably and responsibly funding and growing open source projects in general - WordPress.com is an excellent example of how one can support development of a project like WordPress without compromising its open source nature.\n So, we’d like to formally welcome WordPress and the rest of the Automattic family into Matrix. It’s incredibly exciting times, and we can’t wait to see what will come of the partnership! And meanwhile, if any other massive open source organisations want to join Automattic and  Mozilla in leaping into Matrix, you know where to find us… :D\n Huge thanks go to Matt for believing in Matrix - watch this space for updates.", "posttime": "2020-05-21 16:49:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "automattic,matrix", "title": "欢迎Automattic来到Matrix", "title_en": "Welcoming Automattic to Matrix", "transed": 1, "url": "https://matrix.org/blog/2020/05/21/welcoming-automattic-to-matrix", "via": "", "real_tags": ["matrix"]}, {"category": "", "categoryclass": "", "imagename": "e2de6a48ceafd23e895b108594f32928.jpg", "infoid": 1003096, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "以色列安全研究人员在全球域名系统(DNS)的一个基本原理中发现了一个无法修复的漏洞，该漏洞可被滥用来发起潜在的压倒性拒绝服务攻击。\n特拉维夫大学的Lior Shafir和Herzliya跨学科中心的Anat Bremler-Barr都发表了关于DNS漏洞的发现，他们称之为NXNSAttack，此前他们向供应商披露了这个漏洞，让他们有时间开发补丁。\nNXNSAttack利用了DNS中所谓的无缝委派的弱点，在DNS中，查询返回对域具有权威性的服务器的名称，但不返回它们的互联网协议地址。\n使用恶意DNS服务器的攻击者可以使用包含假的、随机的权威服务器名称的委派进行响应。\n这些服务器名称被设置为指向受害者域，从而强制解析程序生成进一步的查询，这些查询将被发送到无法解析它们的目标DNS服务器。\n这是符合标准的DNS服务器的运行方式，但NXNSAttack的后果可能是拒绝服务泛滥，数据包放大倍数高达1621倍。\n目前服务于全球互联网基础设施的开源和专有DNS服务器受到影响，需要打补丁。\n这包括互联网软件联盟(Internet Software Consortium)的BIND等DNS解析器，也包括谷歌(Google)、微软(Microsoft)、亚马逊网络服务(Amazon Web Services)和Cloudflare等云和网络服务提供商使用的专有DNS解析器，它们现在已经收到了补丁。\n但是，补丁程序无法修复该漏洞，仅通过添加对名称服务解析重试次数的限制来缓解NXNSAttack。\n不幸的是，NXNSATTACK滥用了DNS协议的最基本原则，这实际上意味着没有修复，只有缓解，与以色列研究人员合作的捷克共和国域名管理员PetrŠpaček写道。\nŠpaček指出，虽然从表面上看，在处理单个委托时限制解析的名称数量等缓解技术似乎很容易实施，但它们可能会破坏某些域的解析。\n对解析重试添加任意限制可能会给估计4%的二级域带来问题，这些二级域的顶级域(TLD)(如.com和.net)的委派存在问题。\nŠpaček表示：在接下来的几天里，我们将看到供应商在确定他们的魔术数字方面取得了多大的成功，以及他们是否在没有打破任何主要领域的情况下脱颖而出。", "note_en": "Israeli security researchers have discovered an unfixable vulnerability in one of the fundamentals of the worldwide domain name system (DNS) that can be abused to launch potentially overwhelming denial of service attacks.\n Lior Shafir and Yehuda Afek, both of Tel Aviv University and Anat Bremler-Barr of the Herzliya Interdisciplinary Centre published their findings on the DNS vulnerabilty, which they called  NXNSAttack after disclosing it to vendors to give them time to develop patches.\n The NXNSAttack takes advantage of a weakness in the so-called glueless delegation in the DNS, in which queries return names of servers that are authoritative for a domain, but not their internet protocol addresses.\n An attacker with a malicious DNS server can respond with a delegation that contains fake, random authoritative server names.\n These server names are set to point to a victim domain, which forces the resolver to generate further queries that are sent to the target DNS server which is unable to resolve them.\n This is how standards-compliant DNS servers should operate, but the consequences of NXNSAttack can be denial of service floods with a very high packet amplification factor of up to 1621 times.\n Open source and proprietary DNS servers that currently serve the global internet infrastructure are affected and need patching.\n This includes DNS resolvers such as the Internet Software Consortium&#39;s BIND, and also proprietary ones used by cloud and web services providers such as Google, Microsoft, Amazon Web Services, and Cloudflare which have now received patches.\n However, the patches do not fix the vulnerability, and only provide mitigation against NXNSAttack by adding limits on the amount of retries for name service resolution.\n &#34;Unfortunately NXNSAttack abuses the very basic principle of DNS protocol, which practically means there is no fix, only mitigation,&#34; Petr Špaček of the Czech Republic domain name administrator who collaborated with the Israeli researchers  wrote.\n Špaček noted that while on the surface mitigation techniques such as limiting the number of names resolved while processing single delegations appear simple to implement, they could break resolution for some domains.\n Adding arbitrary limits on resolution retries could cause problems for the esitimated four per cent of second-level domains that have issues with their delegation from top-level domains (TLDs) such as .com and .net.\n &#34;In [the] upcoming days we will see how successful vendors were in determining their magic numbers and if they get away without breaking any major domains,&#34; Špaček said.", "posttime": "2020-05-21 16:48:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人员,warn,dns", "title": "研究人员警告无法修复的DNS DoS NXNS攻击", "title_en": "Researchers Warn of Unfixable DNS DoS NXNS Attack", "transed": 1, "url": "https://www.itnews.com.au/news/researchers-warn-of-unfixable-dns-denial-of-service-nxnsattack-548345", "via": "", "real_tags": ["人员", "warn", "dns"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003095, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "+--+|KISS|*一个独立的LINUX(R)发行版，关注||简单性和“少即是多”的概念。|*分发只针对x86-64**||架构和英语。||+--++--+|概述|*。使用纯文本软件包系统，该系统||与语言无关，可使用基本UNIX||实用程序进行解析。|*使用小于1000的包管理器||POSIX sh行(不包括空行和||注释)。|*基于MUSL libc、busybox和Linux内核。|*每次安装的发行版都包含||完整的(发行版)源代码和git历史||附带。|*简单小巧，||全部只需一个人就能轻松维护。|*没有&#34；后端&#34；。这个发行版只是||几个git存储库。|*具有&#34；总线因子&#34；N/A(0？)。感谢以上||点。给予用户和社区充分的权力。|*所有shell代码都经过shellcheck||(包括每个仓库包)。|*所有软件包都由||软件包管理器从源代码编译，该管理器会自动处理||依赖项、补丁等。|*明确排除以下软件：|dbus、systemd、polkit、gettext、intltool、||PulseAudio、pam、Wayland、logind、ConsoleKit2|和所有桌面环境。|*选择！可以替换coreutils、init、设备管理器、||编译器、shell和*。没有||锁定到特定软件(当然不包括MUSL和|内核)。|*无根Xorg环境，无需任何附加||软件。|*通过git和GnuPG进行仓库签名，||基于已签名的提交，内置于git本身。||+--++--+|进一步阅读|。*请参阅：|https://k1ss.org/guidestones||https://k1ss.org/install||https://k1ss.org/package-system||https://k1ss.org/community|+--+", "note_en": "+-------------------------------------------------------+| || KISS || || * An independent Linux(R) distribution with a focus || on simplicity and the concept of less is more. || || * The distribution targets only the x86-64 ** || architecture and the English language. || || |+-------------------------------------------------------++-------------------------------------------------------+| || OVERVIEW || || * Uses a plain-text package system which is || language agnostic and parseable with basic UNIX || utilities. || || * Uses a package manager written in less than 1000 || lines of POSIX sh (excluding blank lines and || comments). || || * Based on musl libc, busybox and the Linux kernel. || || * Every installation of the distribution contains the || full sources (of the distribution) with git history || attached. || || * Is simple and small enough to be maintainable in || its entirety by a single person with little effort. || || * There is no &#34;backend&#34;. This distribution is merely || a few git repositories. || || * Has a &#34;Bus factor&#34; of N/A (0?) thanks to the above || points. Full power to the users and the community. || || * All shell code is linted by and passes shellcheck || (including each and every repository package). || || * All packages are compiled from source by the || package manager which automatically handles || dependencies, patches, etc. || || * Explicitly excludes the following software: || || dbus, systemd, polkit, gettext, intltool, || pulseaudio, pam, wayland, logind, ConsoleKit2 || and all Desktop Environments. || || || * Choice! The coreutils, init, device manager, || compiler, shell and * can be replaced. There&#39;s no || lock-in to specific software (excluding musl and || the kernel of course). || || * Rootless Xorg environment without any additional || software. || || * Repository signing through git and gnupg, || based on signed commits and built into git itself. || || |+-------------------------------------------------------++-------------------------------------------------------+| || FURTHER READING || || * See: || ||  https://k1ss.org/guidestones ||  https://k1ss.org/install ||  https://k1ss.org/package-system ||  https://k1ss.org/community || || |+-------------------------------------------------------+", "posttime": "2020-05-21 16:26:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,管理器", "title": "KISS Linux-专注于少即是多的发行版", "title_en": "Kiss Linux – A distribution with a focus on less is more", "transed": 1, "url": "http://k1ss.org", "via": "", "real_tags": ["linux", "管理器"]}, {"category": "", "categoryclass": "", "imagename": "a2b67d9c78187a32ba966e3e540c8f22.png", "infoid": 1003094, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年5月19日：微软宣布了许多与Linux相关的东西，还有毛伊岛(Maui)。问题是：MAUI已经是Linux发行版的名称，也是Linux应用程序的图形用户界面框架的名称。\n微软的MAUI也是图形用户界面的框架。因此，我在GitHub上开了一期。微软将作何反应？\n“预期行为：Microsoft选择Linux社区中尚未使用的名称。实际行为：微软选择Linux社区中已经使用过的名称。\n我假设微软会认出名称冲突，道歉，并重新命名他们的项目。别小题大作。随时都可能发生。\n(注：MVP代表“最有价值的专业人士”，这不是微软员工。)。\n“这是经过法律审查的。我不相信这是这个讨论的论坛。“。\n美国东部时间晚上8：14：微软员工发布了他的工作邮箱地址(任何人都很容易在网上找到)，因此希望停止GitHub上关于这一问题的公开讨论。这一举动可能是为了缓解公司的沙尘暴升级。\n我们只能猜测，进一步的讨论是否会在公关部引发一些“垃圾雷达”。\nUTC下午8：52：Microsoft锁定该问题，无法添加进一步的反应(如竖起和向下大拇指，甚至编辑现有评论)：\n今晚晚些时候：一些评论被标记为离题，可能是因为担心微软“最有价值的专业人士”的答案可能会被视为…。不够专业：\n大约在同一时间，毛伊UI框架背后的团队在https://nxos.org/news/official-statement-regarding-xamarin-forms-rebanding-as-maui/，上发布了一份官方声明，称。\n“我们愿意相信，这是一个不幸的事件，是由于集思广益会议期间的疏忽，没有为他们的产品选择一个新的、有吸引力的名称，而不是试图使用品牌和营销手段，这可能是一个大公司，如微软和他们的子公司Xamarin，超越了一个竞争对手的框架，这个UI框架直到今天仍然是谷歌搜索”Maui UI Framework“时的第一个结果，但由于GitHub(微软的另一家子公司)和微软自己的网站(特别是他们的博客)的强大，SESEG(微软的另一家子公司)和微软自己的网站(具体地说，就是他们的博客)SESEHub(微软的另一家子公司)和微软自己的网站(特别是他们的博客)。\n我们恳请负责此软件开发的微软团队重新考虑更改为其他名称。如果他们如此倾向于使用太平洋岛屿，他们有很多选择，其中许多岛屿也是以自由和开放源码项目命名的可能性很小。\n甚至在今晚晚些时候：几乎所有的评论现在都被标记为离题，无法看到大拇指向上/向下的回应，需要登录才能查看。\nMAUI项目是一个免费的模块化前端框架，用于开发快速且引人注目的用户体验：https://mauikit.org/", "note_en": "May 19, 2020: Microsoft announces a lot of Linux related stuff, and  Maui. Trouble is: Maui is already the name of  a Linux distribution and the name of a   framework for graphical user interfaces for Linux applications.\n  The Maui from Microsoft is  also a  framework for graphical user interfaces. Hence I open an issue on GitHub. How will Microsoft react?\n  “Expected Behavior: Microsoft chooses names not already used in the Linux community. Actual Behavior: Microsoft chooses names already used in the Linux community.”\n I assume that Microsoft will recognize the name clash, apologize, and rename their project. No big deal. Can happen any time.\n    (Note: MVP stands for “Most Valuable Professional”, this is  not a Microsoft employee.)\n   “This has been through legal review. I don’t believe this is the forum for this discussion.”\n     8:14 PM UTC: In a move that could be out of a corporate playbook for shitstorm de-escalation, the Microsoft employee posts his work mail address (which anyone could find on the net easily anyhow) and hence hopes to stop the public discussion about the issue on GitHub.\n We can only speculate whether further discussion triggers some “shitstorm radar” at the PR department.\n 8:52 PM UTC: Microsoft locks the issue, making it impossible to add further reactions (such as thumbs up and down or even editing existing comments):\n  Later this evening:  Some comments get marked as off-topic, possibly in fear that the Microsoft “Most Valuable Professional” answers might be seen as… less than  professional:\n  Around the same time, the team behind the Maui UI framework publishes an official statement at  https://nxos.org/news/official-statement-regarding-xamarin-forms-rebanding-as-maui/, saying\n “We would like to believe that this an unfortunate event caused by an oversight during the brainstorming session to select a new and appealing name for their product and not an attempt at using the branding and marketing might consist of a large corporation such as Microsoft and their subsidiary Xamarin to step over a competing framework, a UI framework that as of today is still the first result in Google when searching for the term “Maui UI framework” but that due to the might of GitHub (another Microsoft subsidiary) and Microsoft own website (specifically, their blog) SEO that will change over time.\n We would like to kindly ask the Microsoft team that is in charge of the development of this software to reconsider changing to a different name. If they were so inclined to use Pacific Islands, there are plenty to choose from, many of which the probability that another island is also named after a free and open-source project is substantially minimal.”\n Even later this evening: Almost all comments are now marked as off-topic, making it impossible to see the thumbs up/thumbs down response, and requiring to sign in to view.\n  The Maui project is a free and modular front-end framework  for developing fast and compelling user experiences:  https://mauikit.org/", "posttime": "2020-05-21 16:26:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,linux,微软,是不是,loves", "title": "微软热爱Linux--是不是有点太过了？", "title_en": "Microsoft loves Linux – a little too much?", "transed": 1, "url": "https://medium.com/@probonopd/microsoft-loves-linux-a-little-too-much-cff91023e4b8", "via": "", "real_tags": ["microsoft", "linux", "微软", "是不是", "loves"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003093, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，2020年5月20日，GNOME基金会、罗斯柴尔德专利成像公司和Leigh M.Rothschild高兴地宣布，罗斯柴尔德专利成像公司和GNOME之间的专利纠纷已经解决。\n在这项不了了之的和解协议中，GNOME获得了一份释放协议，并承诺不会因罗斯柴尔德专利成像公司持有的任何专利而被起诉。此外，Rothschild Patent Image和Leigh Rothschild都向根据现有开源计划批准的许可证(及其后续版本)发布的任何软件(包括整个Rothschild专利组合)授予发布和约定，只要这些软件构成侵权指控的重要部分。\nGNOME基金会执行董事尼尔·麦戈文说：“我非常高兴我们已经结案。这将使我们能够将注意力重新集中在创建一个自由软件桌面上，并将确保未来所有自由和开放源码软件的确定性。“。\n利·罗斯柴尔德说：“我很高兴我们设法友好地解决了这个问题。我一直支持开放源码软件及其开发者的创新，并鼓励其创新和采用。“。\n来自Searman&amp；Sterling LLP的马特·伯科维茨(Matt Berkowitz)、基兰·基赫费尔(Kieran Kieckhefer)、乔伊·王(Joy Wang)和拉里·克劳奇(Larry Crouch)为侏儒无偿代理。GNOME和更广泛的自由开放源码社区感谢他们在过去10个月中的不懈工作。", "note_en": "Today, on the 20th of May 2020, the GNOME Foundation, Rothschild Patent Imaging, and Leigh M. Rothschild are pleased to announce that the patent dispute between Rothschild Patent Imaging and GNOME has been settled.\n In this walk-away settlement, GNOME receives a release and covenant not to be sued for any patent held by Rothschild Patent Imaging. Further, both Rothschild Patent Imaging and Leigh Rothschild are granting a release and covenant to any software that is released under an existing Open Source Initiative approved license (and subsequent versions thereof), including for the entire Rothschild portfolio of patents, to the extent such software forms a material part of the infringement allegation.\n Neil McGovern, Executive Director for the GNOME Foundation said “I’m exceptionally pleased that we have concluded this case. This will allow us to refocus our attention on creating a free software desktop, and will ensure certainty for all free and open source software in future.”\n Leigh Rothschild said “I’m pleased that we have managed to settle this issue amicably. I have always supported the innovation of open source software and its developers and encourage its innovation and adoption.”\n GNOME was represented pro-bono by Matt Berkowitz, Kieran Kieckhefer, Joy Wang and Larry Crouch from Shearman &amp; Sterling LLP. GNOME and the wider free and open source community owes its thanks and gratitude to their tireless work over the past 10 months.", "posttime": "2020-05-21 16:25:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "专利,case,软件", "title": "针对GNOME的专利案件解决", "title_en": "Patent case against GNOME resolved", "transed": 1, "url": "https://www.gnome.org/news/2020/05/patent-case-against-gnome-resolved/", "via": "", "real_tags": ["专利", "case", "软件"]}, {"category": "", "categoryclass": "", "imagename": "342a95b3397cd1f6910fff42ab7c3fc5.png", "infoid": 1003092, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1哥本哈根大学营养、锻炼与体育系，丹麦哥本哈根2200；kd.uk.sxen@bim(M.M.B.)；kd.uk.sxen@ekceneiw(J.W.)；kd.uk.sxen@TSA(A.A.)；kd.uk.sxen@eybdnulj(J.L.-J.)。\n1哥本哈根大学营养、锻炼与体育系，丹麦哥本哈根2200；kd.uk.sxen@bim(M.M.B.)；kd.uk.sxen@ekceneiw(J.W.)；kd.uk.sxen@TSA(A.A.)；kd.uk.sxen@eybdnulj(J.L.-J.)。\n2丹麦南部精神卫生服务区神经发育障碍研究中心(焦点)，儿童和青少年精神卫生欧登塞，5000欧登塞，丹麦；kd.dyr@grebneliB.sleiN。\n1哥本哈根大学营养、锻炼与体育系，丹麦哥本哈根2200；kd.uk.sxen@bim(M.M.B.)；kd.uk.sxen@ekceneiw(J.W.)；kd.uk.sxen@TSA(A.A.)；kd.uk.sxen@eybdnulj(J.L.-J.)。\n1哥本哈根大学营养、锻炼与体育系，丹麦哥本哈根2200；kd.uk.sxen@bim(M.M.B.)；kd.uk.sxen@ekceneiw(J.W.)；kd.uk.sxen@TSA(A.A.)；kd.uk.sxen@eybdnulj(J.L.-J.)。\n1哥本哈根大学营养、锻炼与体育系，丹麦哥本哈根2200；kd.uk.sxen@bim(M.M.B.)；kd.uk.sxen@ekceneiw(J.W.)；kd.uk.sxen@TSA(A.A.)；kd.uk.sxen@eybdnulj(J.L.-J.)。\n被许可人MDPI，巴塞尔，瑞士。本文是根据知识共享署名(CC By)许可证(http://creativecommons.org/licenses/by/4.0/).)的条款和条件分发的开放获取文章。\n注意缺陷多动障碍(ADHD)是一种具有复杂症状的神经发育障碍，核心症状和功能障碍通常持续到成年。最近的调查估计，全世界儿童和青少年中ADHD的患病率约为7%，与十年前相比大幅增加。常规治疗通常包括用中枢神经刺激剂进行药物治疗，但无反应者的数量和不良反应要求替代治疗方案。运动已经被认为是治疗ADHD的一种安全和低成本的辅助疗法，据报道，在一般儿童群体中，运动对认知功能的几个方面都有积极的影响。在这里，我们回顾了运动影响ADHD儿童和非ADHD儿童认知功能的现有证据，并提出了可能的神经生理作用机制。我们发现体力活动和ADHD之间有很好的联系，并且在急性有氧运动对ADHD儿童的执行功能产生小到中度有益影响的形式下，也有因果证据。尽管有很大的异质性，荟萃分析发现锻炼对基于人群的控制(PBC)儿童的积极影响很小，我们从长期干预中提取的影响大小表明，运动对患有ADHD的儿童和青少年具有一致的积极影响。缺乏探讨不同运动参数影响的研究阻碍了这方面的有限结论。需要进行大规模的临床试验，并适时进行锻炼。总而言之，现有的初步证据表明，运动可以改善与ADHD表现密切相关的认知表现，无论是否诊断为ADHD的儿童。基于PBC和ADHD儿童的研究结果，我们谨慎地提供了锻炼参数的建议。\nADHD是一种神经发育障碍，其特征是在12岁前诊断为注意力不集中和/或多动和冲动[1]。据估计，全世界儿童和青少年中ADHD的流行率在5%到10%之间[，，]，最近的调查估计57%的确诊病例会持续到成年[]，这对社会和学术技能的有害影响是有据可查的[]。这一诊断的严重性突出表现为预期寿命[]下降、与其他精神疾病诊断[]和药物滥用[]共病，以及受影响儿童及其家人的生活质量下降[]。目前的治疗方法大多包括刺激性和非刺激性药物治疗以及认知治疗。哌醋甲酯(MPH)等兴奋剂对ADHD的症状有最大的积极影响，但20-25%的确诊患者对治疗没有反应，药物治疗可能伴随着身体和心理的不良反应[，]。因此，ADHD的严重性和流行率迫切要求治疗方法能够补充或加强药物和认知治疗的效果，并改善对这些治疗有弹性的儿童的生活。体力活动可以构成这样一种方法。\n对于被诊断为ADHD的儿童，她或他必须在注意力不集中和/或多动和冲动类别中至少出现九种症状中的六种。根据美国精神病学协会的精神疾病诊断和统计手册(DSM-5)[1]，儿童可以被诊断为三种ADHD表现中的任何一种：注意力不集中、多动和冲动，或者这些症状的某种组合[1]。因此，ADHD是一种伞形诊断。虽然分类诊断具有临床和实用价值，但反过来，它们可能会过度简化复杂的认知特征混合。这似乎是ADHD的情况，目前的证据表明，ADHD应该被认为是在普通人群中持续变化的特征的损害尾巴，而不是一个离散的类别[，]。这表明，总体上有益于儿童的干预或活动也与患有ADHD的儿童和青少年相关，并可能缓解ADHD的症状。众所周知，急性和有规律的体力活动(PA)可以触发广泛的生理事件，这些事件可以导致身体和心理健康以及包括记忆域在内的身体和认知功能的改善(参见例如，[]或[]以进行回顾)。相比之下，PA对认知功能的影响，与基于人群的对照(PBC)相比，已知在ADHD儿童中受到影响的研究较少。在这篇综述中，我们描述了与ADHD相关的认知表现缺陷，并回顾了运动对ADHD儿童认知表现(特别是执行功能，包括选择性注意和持续注意)的影响的实证证据。为了证实这一讨论，我们对与ADHD相关的神经生理和神经认知异常进行了表征，并为抵消或改善儿童和青少年的锻炼效果提供了一个机制框架，同时强调了近几十年来的关键研究结果。此外，我们从现有的干预研究中提取和展示了效应大小，并根据提出的神经生理学框架对这些结果进行了讨论。最后，我们将谨慎地为被诊断为ADHD的人提供急性和长期运动干预的持续时间、强度和类型的建议。\n注意力不集中的ADHD的主要症状包括注意力不集中、健忘、组织能力差和缺乏毅力，而多动和冲动与对延迟奖励的不耐烦、难以抑制不及时和不适当的运动反应以及无法将运动活动抑制到特定情况下的适当水平[1]有关。这些症状和执行功能之间的联系是毋庸置疑的[]，因此，现有的研究已经记录了认知测试中的表现缺陷(包括。执行)ADHD儿童的功能[，，]。传统上认为执行功能(EF)的三个主要方面：工作记忆、抑制控制和认知灵活性或集合转移[，]。患有ADHD的儿童在某些方面(但不是所有方面)表现不佳，很少有相同的EFS测试(例如，参见[]以进行回顾)。因此，每个孩子都有他或她自己的概况，即在EFS测试中的表现和注意力控制的结合，这反映了他或她的特殊病因。重要的是，这种跨多个NCF测试的单独性能组合可能需要关键信息\n关于急性运动对PBC儿童的影响的几个发现对本综述特别感兴趣，值得进一步讨论。根据前面的侧翼任务测试抑制性控制将PBC儿童分为高成绩组和低成绩组，Drollette等人发现，在成绩较差的儿童中，锻炼对抑制控制产生了更大的有利影响[]。根据前面提到的ADHD代表了普通人群中存在的极端特征的概念，结果表明ADHD儿童因此可能从剧烈运动中受益最多。支持这一点的几项研究报告称，在ADHD儿童的几项认知功能测试中，急性运动对表现有积极影响。Silva等人。在要求注意力的第一人称计算机模拟[]中发现了性能的提高，但据报道，部署了GO/NO-GO[，75]，FLANKER[，，]和Stroop[79，80，]测试，对抑制控制也有积极的影响。此外，通过改进的侧翼测试[]、任务转换测试[]、威斯康星州卡片分类任务[]和交替使用任务[]来探索运动诱导的认知灵活性提高的结果也被报道过。重要的是，也存在几个截然不同的发现[，87]。不同的结果可能反映了方法的异质性。例如，Craft报告说，在一轮持续1到10米的运动后，数字广度或一般智力没有变化[]。很可能~10m的持续时间不足以影响NCF随后的测试性能。\n总而言之，一些调查急性运动影响的研究发现，急性运动对认知功能的各个方面的表现都有积极的影响-ADHD儿童也是如此。除非观察到的积极影响只是暂时的，从表面上看，急性运动的有益影响可能会在几周或几个月的过程中积累成认知功能水平的差异。这种影响将反映在认知和体力活动水平之间的正相关以及长期干预后认知表现的变化上。这将在接下来的几节中讨论。\n儿童的活动水平通常直接作为在一个或多个典型日期收集的加速度计数据[]、通过体力活动问卷[]间接测量或通过评估健康水平(例如，[，])来测量。通过将健康和活动水平与NCF测试中的表现相关联，可以估计“慢性体育活动”和认知功能之间的关联。来自荟萃分析的证据支持在PBC儿童中存在正相关[，96，97]。患有ADHD的儿童比他们的PBC同龄人更不可能达到推荐的体力活动水平，根据前述研究，这可能不仅与身体能力等方面的缺陷有关，而且与认知功能的衡量标准也有关[]。在代表普通人群的大样本中(n=45,897)，Cook等人。据报道，患有ADHD的年轻人没有服用药物，或者很可能久坐不动[]。这支持了早期发现的久坐不动的生活方式的风险增加和患有ADHD的未经药物治疗的青少年肥胖的风险[]。\n布拉塞尔等人在患有多动症高危青少年(即父母和教师评定量表上≥第90个百分位数)的儿童中，发现有氧适能与修改侧翼任务中不一致试验的准确性以及较低的干扰分数呈正相关，这共同表明高适应儿童具有更好的抑制能力[]。与此相一致，侧翼任务中一致和不一致试验的响应时间更长。\n..", "note_en": "1Department of Nutrition, Exercise &amp; Sports, University of Copenhagen, 2200 Copenhagen, Denmark;  kd.uk.sxen@bim (M.M.B.);  kd.uk.sxen@ekceneiw (J.W.);  kd.uk.sxen@tsa (A.A.);  kd.uk.sxen@eybdnulj (J.L.-J.)\n 1Department of Nutrition, Exercise &amp; Sports, University of Copenhagen, 2200 Copenhagen, Denmark;  kd.uk.sxen@bim (M.M.B.);  kd.uk.sxen@ekceneiw (J.W.);  kd.uk.sxen@tsa (A.A.);  kd.uk.sxen@eybdnulj (J.L.-J.)\n 2Research Center in Neurodevelopmental Disorder (FOCUS), Child and Adolescent Mental Health Odense, Mental Health Services Region of Southern Denmark, 5000 Odense, Denmark;  kd.dysr@grebneliB.sleiN\n 1Department of Nutrition, Exercise &amp; Sports, University of Copenhagen, 2200 Copenhagen, Denmark;  kd.uk.sxen@bim (M.M.B.);  kd.uk.sxen@ekceneiw (J.W.);  kd.uk.sxen@tsa (A.A.);  kd.uk.sxen@eybdnulj (J.L.-J.)\n 1Department of Nutrition, Exercise &amp; Sports, University of Copenhagen, 2200 Copenhagen, Denmark;  kd.uk.sxen@bim (M.M.B.);  kd.uk.sxen@ekceneiw (J.W.);  kd.uk.sxen@tsa (A.A.);  kd.uk.sxen@eybdnulj (J.L.-J.)\n 1Department of Nutrition, Exercise &amp; Sports, University of Copenhagen, 2200 Copenhagen, Denmark;  kd.uk.sxen@bim (M.M.B.);  kd.uk.sxen@ekceneiw (J.W.);  kd.uk.sxen@tsa (A.A.);  kd.uk.sxen@eybdnulj (J.L.-J.)\n Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( http://creativecommons.org/licenses/by/4.0/).\n  Attention Deficit Hyperactivity Disorder (ADHD) is a neurodevelopmental disorder with a complex symptomatology, and core symptoms as well as functional impairment often persist into adulthood. Recent investigations estimate the worldwide prevalence of ADHD in children and adolescents to be ~7%, which is a substantial increase compared to a decade ago. Conventional treatment most often includes pharmacotherapy with central nervous stimulants, but the number of non-responders and adverse effects call for treatment alternatives. Exercise has been suggested as a safe and low-cost adjunctive therapy for ADHD and is reported to be accompanied by positive effects on several aspects of cognitive functions in the general child population. Here we review existing evidence that exercise affects cognitive functions in children with and without ADHD and present likely neurophysiological mechanisms of action. We find well-described associations between physical activity and ADHD, as well as causal evidence in the form of small to moderate beneficial effects following acute aerobic exercise on executive functions in children with ADHD. Despite large heterogeneity, meta-analyses find small positive effects of exercise in population-based control (PBC) children, and our extracted effect sizes from long-term interventions suggest consistent positive effects in children and adolescents with ADHD. Paucity of studies probing the effect of different exercise parameters impedes finite conclusions in this regard. Large-scale clinical trials with appropriately timed exercise are needed. In summary, the existing preliminary evidence suggests that exercise can improve cognitive performance intimately linked to ADHD presentations in children with and without an ADHD diagnosis. Based on the findings from both PBC and ADHD children, we cautiously provide recommendations for parameters of exercise.\n ADHD is a neurodevelopmental disorder characterized by inattention and/or hyperactivity and impulsivity diagnosed in children before the age of 12 [ 1]. Worldwide prevalence of ADHD in children and adolescents is estimated to be between 5% and 10% [ , , ] and recent surveys estimate that 57% of diagnosed cases persist into adulthood [ ], with well-documented detrimental impact on social and academic skills [ ]. The gravity of this diagnosis is underlined by the decreased life expectancy [ ], comorbidity with other psychiatric diagnoses [ ] and substance abuse [ ], along with reduced quality of life for the affected children and their families [ ]. Present treatment approaches most often include stimulant and non-stimulant pharmacotherapy along with cognitive therapy. Stimulants such as methylphenidate (MPH) show the largest positive effects on the symptomatology in ADHD, but 20–25% of the diagnosed individuals do not respond to the treatment, and pharmacotherapy can be accompanied by physical and psychological adverse effects [ , , , , , , , ]. The gravity and prevalence of ADHD thus urgently calls for therapeutic approaches which can supplement or potentiate the effect of pharmacological and cognitive treatment as well as improve the life for children resilient to these. Physical activity may constitute such an approach.\n For a child to be diagnosed with ADHD, she or he must present at least six of the nine symptoms within either the inattentive and/or the hyperactivity and impulsivity category. According to the American Psychiatric Association’s Diagnostic and Statistical Manual for Mental disorders (DSM-5) [ 1], a child can be diagnosed with either of the three ADHD presentations: inattentive, hyperactive and impulsive or some combination of these [ 1]. ADHD is thus an umbrella diagnosis. Whereas categorical diagnoses are of clinical and practical value, they may conversely oversimplify a complex mixture of cognitive traits. This appears to be the case for ADHD, where the current evidence demonstrates that ADHD should be considered as the impairing tail of traits that vary continuously throughout the general population rather than a discrete category [ , , , , ]. This suggests that interventions or activities, which benefit children, in general, are also relevant for children and adolescents with ADHD and may alleviate the ADHD symptomatology. Acute and regular physical activity (PA) are known to trigger a wide array of physiological events that can lead to improvements in physical and psychological well-being as well as physical and cognitive functions including the memory domain (see e.g., [ ] or [ ] for review). In contrast, the effects of PA on cognitive functions, which are known to be affected in children with ADHD compared to population-based controls (PBC) are sparsely studied. In this review, we describe deficits in cognitive performance associated with ADHD and review the empirical evidence suggesting effects of exercise on cognitive performance (specifically Executive Functions (EFs) including selective attention as well as sustained attention) in children with and without ADHD. To substantiate the discussion, we characterize neurophysiological and neurocognitive abnormalities associated with ADHD and provide a mechanistic framework for the counteracting or ameliorating effects of exercise in children and adolescents while highlighting key findings from the recent decades of research. Furthermore, we extract and present effect sizes from existing intervention studies and discuss these results in light of the neurophysiological framework presented. Finally, we will cautiously provide recommendation of duration, intensity, and type of acute and long-term exercise interventions for persons diagnosed with ADHD.\n The cardinal symptoms of inattentive ADHD encompass distractibility, forgetfulness, poor organization skills and low perseverance, whereas hyperactivity and impulsivity are associated with impatience for delayed rewards, difficulties in inhibition of untimely and inappropriate motor responses along with inability to dampen motor activities to appropriate levels for a given situation [ 1]. The link between these symptoms and executive functions is unmistakable [ ], and accordingly, existing research has documented performance deficits in tests of cognitive (incl. executive) functions in children with ADHD [ , , ]. Three primary aspects of executive functions (EF) are traditionally identified; working memory, inhibitory control and cognitive flexibility or set shifting [ , ]. Children with ADHD display subpar performance in some, but not all aspects, and rarely the same tests of EFs (see e.g., [ ] for review). Every child thus has his or her own profile, i.e., a combination of performance in tests of EFs and attentional control, which reflects his or her idiosyncratic etiology. Importantly, this individual combination of performances across several tests of NCFs may entail pivotal information about his or her individual path to remission. The framework for this review is thus that of assessing the effects of exercise on performance in tests of EFs and attention in children and adolescents with (and without) ADHD. The objective is to answer the question: To what extent can exercise improve cognitive deficits associated with pediatric ADHD and which modality, intensity and duration of exercise might benefit cognitive performance based on studies of acute and long-term exercise in children and adolescents with and without ADHD?\n Although ADHD is in general associated with lower performance, neuropsychological tests are in isolation unlikely to have sufficient selectivity necessary to entail clinical value [ ]. As an example, if pediatric ADHD was diagnosed based on impaired performance (&gt;90 percentile) in at least five commonly used tests for executive functions, ~10% would be identified, whereas ~50% would be identified using only the most sensitive of these (see [ ] for a discussion). Additionally, several of the tests commonly deployed to assess EF in ADHD have low construct validity (see e.g., [ ] for a discussion). At first sight, the tenet that deficits in EF may lead to the complex array of ADHD symptoms appears to be scarcely supported in the literature. As an example, meta-evidence suggests that impaired inhibitory control [ ], which is thought to be a fundamental deficit in ADHD, does not differ between individuals with ADHD and age-matched population-based controls when evaluated with the Stroop test [ ]. On the other hand, meta-analyses results for both go/no-go [ ] and stop-signal [ ] tasks reveals impaired inhibition in ADHD. As a result, meta-analyses including all three tests find small differences between PBC and ADHD populations across different tasks and test paradigms [ ]. Improving task validity may thus increase sensitivity, and recent results demonstrate that slight protocol alterations can improve validity of tasks probing working memory in ADHD [ ]. Furthermore, deploying a comprehensive test-battery including several tests within each EF domain can increase sensitivity and specificity to 89 and 80% respectively [ ]. Another important point of criticism is the practice of comparing pooled average performance scores with little attention to intra-individual variability. This may impede detection of subpar performance. Exemplified; The lower selective and sustained attention ability associated with ADHD results in lower average performance (e.g., higher mean reaction times (RT) in a flanker test), which originates in part from large intra-individual variability [ , , ]. This variability does not stem from large systematic fluctuation in trial-to-trial performance, but rather from few very high RTs, signifying lapses in attention [ ].\n Assessing internal phenomena such as cognitive processes is not straightforward and crude categorization into ‘presentations’ or ‘core symptoms’ may not be of sufficient fidelity to fully describe the idiosyncratic etiology of ADHD. Each core symptom of ADHD assessed through conventional scales (e.g., Connor’s rating scales) is influenced by several neurocognitive functions typically operationalized as performance on neurocognitive tests. Although, each cognitive construct (i.e., ‘working memory’, ‘cognitive flexibility’, ‘inhibitory control’ ‘attentional control’) involves multiple and overlapping neurophysiological processes and testing these independently is accordingly troublesome (e.g., testing WM independent of attentional control), they do provide cut out a middleman and provide a more detailed picture of the pathology. Elucidating the effect of exercise on tests of executive functions and attention (combined termed neurocognitive functions, NCF) provides vital information on how to target exercise interventions for children with ADHD.\n Meta-analyses suggest that pediatric ADHD is associated with consistently lower performance in tests of response inhibition, behavioral inhibition, reaction time variability, cognitive flexibility, choice impulsivity (delayed gratification and delay discounting tasks) and WM [ , , , , ]. As argued below, exercise might constitute an avenue to symptom amelioration by improving these NCFs. A raison d’être for this narrative review is therefore that changes in NCFs reflect changes in the clinical severity for children with ADHD. However, correlated improvements in NCFs and ADHD symptomatology suggest that this is not the case for exercise (e.g., [ ]). Furthermore, as cognitive functions develop in parallel with CNS maturation during the first two decades of our life [ ], it can be argued that e.g., subpar NCFs in pediatric ADHD is solely a matter of tardy cognitive maturation and targeting e.g., EF specifically in children makes little sense [ , , ]. However, as measures of EF influence learning behaviors more than estimates of core symptomatology [ ] and ADHD-related EF deficits are evident in adolescents [ ] and persist into adulthood [ ], it appears that deficits in NCFs (incl. EF) are of clinical importance and do not wane with central nervous maturation [ ]. In the following section, we provide a comprehensive overview of the effect of exercise on tests of NCFs where children with ADHD generally display subpar performance.\n Physical activity (PA) and exercise exerts a plethora of beneficial physiological, psychological and neurocognitive effects. These include reductions in stress [ ], anxiety [ ], depression [ ] and negative affect [ 61] along with positive influences on cognition including improved executive and memory functions (see [ ] for review). A discussion of the effects of exercise on cognition warrants a few semantic clarifications. Firstly, physical activity can be defined as any  bodily movement that results in energy expenditure [ ]. This broad definition includes both planned and deliberately executed  exercise along with everyday activities such as commuting on foot. The distinction between PA and exercise feeds into the perspectives dominating the research field; exercise may act as a neuro-enhancer and improve cognitive performance through acute and long-term effect on monoaminergic transmission, neurotrophic signaling and mechanisms of neuroplasticity (see e.g., [ ] for review). Additionally, it is also a prevalent perspective in the literature, that the cognitive load associated with engaging in physical activities and exercise (e.g., decision making processes, adherence to the rules of a game or the demands for flexible behavior as a team member [ ]) could entail training of impaired cognitive functions. The possibility of the latter is discussed below.\n During the recent years, there has been an increasing focus on acute effects of a single bout of exercise. Acute exercise increases arousal, which is accompanied by potentiated performance in a wide array of cognitive tasks. Although a single bout of exercise is unlikely to cause long-lasting changes in the cognitive functioning, the immediate effect can be harvested for relevant purposes (e.g., improved class-room behavior and learning outcome). Across cognitive domains, meta-analyses point to positive effect of acute exercise in PBC children. For combined EFs, effect sizes (ESs, either Cohen’s  d og Hedges’  g) vary from 0.19 to 0.54 [ , , , ], whereas two meta analyses score effects of exercise on measures of attention to ESs of 0.43 and 0.42 [ , ]. To the best of our knowledge, only four meta-analyses investigating the effect of exercise on cognition including children with ADHD exist [ , , 70, ]. None of these calculate the effect of acute and long-term exercise separately and we accordingly present these at the end of this section.\n A few findings on the effects of acute exercise on PBC children are of particular interest for the present review and warrant further discussion. Dividing PBC children into high and low performance groups based on a preceding Flanker’s Task testing inhibitory control, Drollette et al., found that exercise elicits larger beneficial effects on inhibitory control in the lower performing children [ ]. Based on the aforementioned notion that ADHD represents the extremes of traits present throughout the general population, the results suggest that children with ADHD are thus likely to benefit the most from acute exercise. Supporting this, several studies report positive effects of acute exercise on performance on several tests of cognitive functions in children with ADHD. Silva et al. found increased performance in an attention-demanding first person computer simulation [ ], but also positive effect on  inhibitory control has been reported deploying go/no-go [ , 75], Flanker [ , , ] and Stroop [ 79, 80, ] tests. In addition, findings of exercise-induced performance increases for cognitive flexibility probed with modified Flanker tests [ ], task-switch tests [ ], the Wisconsin card sorting task [ ] and the alternate use task [ ] have also been reported. Importantly, several contrasting findings also exist [ , , , 87]. The divergent results likely reflect methodological heterogeneity. For example Craft reported no change in digit span or general intelligence following a bout of exercise lasting 1 to 10 m [ ]. It is likely that durations of ~10 m are not sufficient to impact subsequent performance on tests of NCFs.\n In summary, some studies investigating effects of acute exercise have found positive effects on performance in various aspects of cognitive functions – also in children with ADHD. Unless the observed positive effects are merely transient, taken at face value the beneficial effects of acute exercise could in term over the course of weeks or months accumulate into differences in levels of cognitive functioning. Such effects would be reflected in both positive associations between cognition and physical activity levels and changes in cognitive performance after long-term interventions. This is discussed in the subsequent sections.\n Activity levels of children are typically measured directly as accelerometer data collected over one or more typical days [ ], indirectly through physical activity questionnaires [ ] or by assessment of the fitness level (e.g., [ , , , , ]). By correlating fitness and activity levels with performance on tests of NCFs, associations between ‘chronic physical activity’ and cognitive functions can be estimated. Evidence from meta-analyses supports a positive relation in PBC children [ , 96, 97]. Children with ADHD are less likely than their PBC peers to meet recommended levels of physical activity, and based on the aforementioned studies, this may be linked to deficits not only in physical capacity etc., but also in measures of cognitive functions [ ]. In a large sample representing the general population ( n = 45,897), Cook et al. reported that young individuals with ADHD who are unmedicated, are—or are likely to be—sedentary [ ]. This supports earlier finding of an increased risk of a sedentary lifestyle and risk of obesity in un-medicated youth with ADHD [ ].\n In preadolescent children with a high risk of ADHD (i.e., ≥90th percentile on the hyperactive/impulsive parents’ and teachers’ rating scales), Brassell et al., found a positive correlation between aerobic fitness and accuracy for the incongruent trials in a modified Flanker task as well as lower interference scores, altogether signifying better inhibitory capacity for high fit children [ ]. In line with this, longer response times across congruent and incongruent trials in the Flanker task has been rep\n......", "posttime": "2020-05-21 15:41:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "认知,adhd,exercise", "title": "运动对ADHD患者认知能力的影响", "title_en": "Effects of Exercise on Cognitive Performance with ADHD", "transed": 1, "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6617109/", "via": "", "real_tags": ["认知", "adhd", "exercise"]}, {"category": "", "categoryclass": "", "imagename": "854dee68eed21cffd5a040064cc1d53f.jpg", "infoid": 1003091, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当苏联在1957年将人造卫星送入轨道时，美国用自己的间谍卫星进行了回应。这个名为科罗娜(Corona)的间谍项目试图定位苏联的导弹地点，但其类似谷歌地球(Google Earth)的照片捕捉到了一些意想不到的东西：动物及其栖息地的快照。现在，通过将这些图像与现代数据进行比较，科学家们找到了一种方法，可以追踪缺乏历史记录的地区的生物多样性下降情况。\n研究人员在哈萨克斯坦北部草原地区的Bobak旱獭(旱獭Bobak)种群上测试了这种方法。在那里，苏联人在20世纪60年代将数百万公顷的自然栖息地变成了农田。科学家们在美国地质调查局的数据库中搜索了卫星的黑白胶片图像，以寻找这种类似松鼠的动物洞穴的迹象。他们识别了5000多个历史悠久的土拨鼠住所，并将它们与该地区的当代数字图像进行了比较，总共绘制了12000多个土拨鼠洞穴的地图。\n研究小组今天在“皇家学会学报B”上报道，在超过50年的时间里，大约有8代土拨鼠在研究区域的同一个洞穴里居住，即使它们的栖息地发生了重大变化。总体而言，研究人员估计，自20世纪60年代以来，土拨鼠洞穴的数量减少了14%。但一些最古老的田地-那些经常受到人类犁地种植小麦的干扰-的洞穴数量暴跌得更多，约为60%。\n当土拨鼠的洞穴被犁地破坏时，土拨鼠往往会回来重建。但研究小组说，持续的人类活动可能会削弱旱獭的家庭，因为这些精力旺盛的动物花在重建上的钱对它们的健康造成了损害。作者说，随着时间的推移，长期的干扰可能显著减少了这些地区旱獭的数量。\n加州大学洛杉矶分校的生态学家和土拨鼠专家丹尼尔·布卢姆斯坦(Daniel Blumstein)没有参与这项研究，他说，研究人员几十年来一直知道土拨鼠使用相同的洞穴。但他说，多年前开垦地区洞穴的长期减少令人惊讶。\n这项研究的作者、柏林洪堡大学地理学家Catalina Munteanu说，这项工作可能是有记录以来哺乳动物对其为农业开发的栖息地做出的最长的现代反应。她说，这种方法提供了一个“非常令人兴奋”的机会，可以观察从太空中可以看到的物种数量的变化，比如白蚁土丘、河狸水坝、放牧小径，在这种情况下，还有洞穴。\n布卢姆斯坦对此表示同意。他说，像这样的工具可能会通过更好地管理我们的活动来帮助我们减少对动物栖息地的影响。", "note_en": "When the Soviet Union launched Sputnik into orbit in 1957, the United States responded with its own spy satellites. The espionage program, known as Corona, sought to locate Soviet missile sites, but its Google Earth–like photography captured something unintended: snapshots of animals and their habitats frozen in time. Now, by comparing these images with modern data, scientists have found a way to track the decline of biodiversity in regions that lack historic records.\n The researchers tested the approach on bobak marmot ( Marmota bobak) populations in the grassland region of northern Kazakhstan. There, Soviets converted millions of hectares of natural habitat into cropland in the 1960s. The scientists searched the satellites’ black and white film images on a  U.S. Geological Survey database for signs of the squirrellike animal’s burrows. They identified more than 5000 historic marmot homes and compared them with contemporary digital images of the region, mapping more than 12,000 marmot burrows in all.\n About  eight generations of marmots occupied the same burrows in the study area over more than 50 years, even when their habitats underwent major changes, the team reports today in the  Proceedings of the Royal Society B. Overall, the researchers estimate the number of marmot burrows dropped by 14% since the ’60s. But the number of burrows in some of the oldest fields—those persistently disturbed by humans plowing grassland to plant wheat—plunged by much more—about 60%.\n    When their burrows were damaged by plowed fields, marmots would often return and rebuild. But the consistent human activity likely weakened marmot families, as the energy animals spent rebuilding took its toll on their health, the team says. The prolonged disturbance may have significantly reduced marmots’ population size in those areas over time, the authors say.\n Researchers have long known that marmots use the same burrows over decades, says Daniel Blumstein, an ecologist and marmot expert at University of California, Los Angeles, who was not involved in the study. But the long-term decline of burrows in areas farmed years ago is surprising, he says.\n The work may be the longest recorded modern response of a mammal to its habitat being developed for agriculture, says study author Catalina Munteanu, a geographer at Humboldt University of Berlin. The approach, she says, offers a “really exciting” chance to look at changes in species populations that are visible from space, such as termite mounds, beaver dams, grazing trails, and, in this case, burrows.\n Blumstein agrees. Tools like this, he says, might help us reduce our impact on animal habitats by better managing our activities.", "posttime": "2020-05-21 15:19:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "卫星,war,土拨鼠", "title": "冷战卫星无意中追踪到了物种的减少", "title_en": "Cold War Satellites Inadvertently Tracked Species Declines", "transed": 1, "url": "https://www.sciencemag.org/news/2020/05/cold-war-satellites-inadvertently-tracked-species-declines", "via": "", "real_tags": ["卫星", "war", "土拨鼠"]}, {"category": "", "categoryclass": "", "imagename": "6f327457c187833544c1e879c92ce58f.png", "infoid": 1003090, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无论何时快速创建事件、更新事件、解决事件或更改组件状态，都可以获取WebHook通知。", "note_en": "Get webhook notifications whenever Fastly  creates an incident,  updates an incident,  resolves an incident or  changes a component status.", "posttime": "2020-05-21 15:18:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "导致,cdn,事件", "title": "CDN快速中断导致澳大利亚无法访问主要站点", "title_en": "Fastly CDN outage was causing major sites to be inaccessible from Australia", "transed": 1, "url": "https://status.fastly.com/incidents/pv9wjdx0scvp", "via": "", "real_tags": ["导致", "cdn", "事件"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003087, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "剧透提醒：当涉及到你的在线隐私时，不是你的问题，而是股东的问题。\n在这篇文章中，我将讨论Twitter最近决定从他们的服务中删除隐私功能，包括他们做了什么，为什么这么做，以及这起事件能教会我们什么关于当今的在线隐私和广告。\n2020年4月7日左右，Twitter用户在访问twitter.com或打开Twitter应用程序时，开始收到一条奇怪的通知(见截图)。通知通知人们，推特上与广告测量相关的隐私设置已被删除，人们别无选择，只能点击“确定”按钮并表示同意。Twitter决定在没有事先通知、解释或反对的情况下，立即删除一个隐私功能，这在人们(包括我)的嘴里留下了不好的品味。\nEFF的Bennet Cyphers发布了一个详细的技术背景，介绍了Twitter过去允许的隐私设置，以及新的变化如何影响数据共享。总而言之：Twitter过去曾提供一个设置(默认情况下启用)，允许他们与第三方共享两种数据。在此之前，Twitter用户可以自由取消选中此框并禁用数据共享(据推测，下面会有更多信息)。这两种类型的数据是：\n转换追踪：该数据与推特的“移动应用推广”(MAP)广告产品有关。该产品允许应用程序开发人员在Twitter上宣传他们的应用程序，然后Twitter将转化情况报告给开发人员，即查看广告、点击广告并最终安装应用程序的Twitter用户。这种广告风格有时被贬义地称为“按安装付费”。\n第三方分析：此数据与Twitter在其网站和应用程序(特别是由Google和Facebook开发的)上使用第三方分析库有关。在这种情况下，Twitter使用第三方图书馆来衡量他们自己的广告在第三方平台上的效果(例如，在Google搜索和Facebook新闻馈送中)。\n对于世界上大多数人来说，最初的隐私设置已经消失，人们不能再选择退出Twitter分享转换数据。取而代之的是一个新的设置(如上面的截图所示)，它允许人们选择不与业务合作伙伴共享某些数据。这指的是第二种类型的数据，即用于Twitter自身广告目的的分析，但考虑到这种模糊的语言，并不完全清楚这一设置在实践中实际起到了什么作用。\n在欧洲，原始设置保持不变，默认情况下未选中。由于GDPR，人们必须选择加入转换共享。\n鉴于这不是一个用户友好的改变，并煽动了媒体对Twitter的不利报道和评论，问题立即变成：他们为什么要做出这样的改变？这一变化是由两个相关的问题推动的。\n故事始于2019年8月5日，当时Twitter发布了一项隐晦的披露，称有问题的隐私设置实际上并不起作用。即使一个人取消选中选择退出的复选框，Twitter仍然与第三方共享转换数据(2018年5月至2019年8月)，并与第三方共享分析cookie(2018年9月至2019年8月)。推特的帖子是道歉的，但也有些挑衅-他们承认自己的错误，但向所有人保证，无论如何，数据只会与“可信的”第三方共享。无论如何，Twitter修复了这个错误，使隐私设置按预期运行。\n在Twitter修复了这个漏洞并开始尊重人们的隐私选择后，他们遇到了第二个问题：他们的广告收入急剧下降，导致他们未能实现2019年第三季度的收入目标。Twitter透露，修复这个漏洞是导致广告收入下降的原因，即移动应用程序开发商在投放地图广告上花费的钱减少了，因为他们不再能够有效地定向广告或跟踪转换。\n最终，Twitter决定他们不能再失去地图广告的广告收入，所以他们取消了大多数人选择退出转换跟踪的能力。\n在试图保护自己的隐私做法不受监管机构侵犯时，科技公司经常打出“控制”的比喻。在这种说法中，科技公司正在竭尽全力进行负责任的自我监管，并让人们控制他们的数据。科技公司指出，他们的隐私设置、选择退出和数据仪表盘是没有必要进行实际隐私监管的原因-显然，人们已经拥有了他们需要的所有工具。\n这起推特事件揭示了这种说法的一个根本缺陷：当“控制”是一种随时可以被剥夺的自由裁量能力时，它就没有意义。在(A)不断增长的收入和安抚股东与(B)用户控制和隐私之间的竞争中，Twitter选择了前者。换句话说，Twitter愿意为人们提供隐私控制，只要它不影响首要指令：利润。在美国，就像在世界上大多数地方一样，收集、分享数据并从中获利，以及决定向用户提供(有限的)隐私负担的权力，完全掌握在行业手中。\n然而，正如我上面提到的，对于Twitter在转换数据上立场的转变，欧洲人是个例外。在欧洲，GDPR迫使公司在与第三方共享大多数类型的数据之前，必须获得肯定的、选择加入的同意。这阻止了Twitter删除转换数据设置，并迫使Twitter选择加入而不是选择退出。GDPR并不完美，但它无疑已经将规定在线隐私规范的权力从行业转移到民主政府。\n正如EFF指出的那样，这起Twitter事件再次提醒我们，为什么我们需要在美国实施全面的联邦隐私监管。\n另一点涉及Twitter在2019年修复的原始隐私漏洞。在漏洞修复之前，人们认为他们可以控制通过Twitter与第三方共享的数据，但事实并非如此。\n我们都依赖于我们使用的软件和服务中的隐私设置。然而，正如这一事件所表明的那样，我们往往不知道这些设置是否真的像预期的那样起作用，我们的选择是否得到尊重。无论是恶意还是疏忽，即使我们花时间接触服务并浏览他们(通常是拜占庭式的)隐私设置，我们的隐私也有可能受到损害。\n在一个“控制”是我们影响在线隐私的主要工具的世界里，隐私设置需要由独立审计师进行严格的审查。Twitter在15个月的时间里没有注意到他们的服务泄露了转换数据--我们不能依赖科技公司进行自我监管，更不用说实现强大的软件了。就像良好的网络安全需要独立的“红色团队”审查一样，我们应该要求科技公司进行隐私合规审计，并让首席信息安全官对发现的失误负责。\n旁白：到目前为止，我没有意识到Twitter因在隐私设置方面的虚假陈述而受到任何影响，尽管这看起来肯定像是联邦贸易委员会可以(也应该)调查Twitter潜在的欺骗性交易行为的一个例子。\n最后一点：这一事件提醒我们，人们的隐私选择很重要。在这种情况下，推特少数用户选择退出的决定似乎足以大幅减少推特的广告收入，以至于推特被迫完全取消了选择退出的选择。这是否表明，选择退出的有隐私意识的人是广告的特别有利可图的受众，还是仅仅意味着人数上的力量足以对抗监视资本主义？\n对于有科学头脑的人来说，整个事件可能是一次自然的实验。我们知道Twitter在他们的地图广告产品中不正当地共享转换数据的大致时间范围，以及数据流被削减的日期。此外，这对Twitter收入的影响是众所周知的。这是否提供了衡量此用户数据的实际价值的机会？鉴于只有Twitter知道有多少人实际选择不分享转换数据，我们可能永远不会知道这些问题的答案。\n无论如何，整件事使我希望，如果动员更多人选择不参与侵入性的数据收集和共享，可能会给业界带来足够的痛苦，迫使他们对这些做法进行清算。\n2020年4月19日更新：向Arvind Narayanan致敬，因为他为这篇文章建议了一个更有分寸的标题。", "note_en": "Spoiler Alert: when it comes to your online privacy, it’s not you, it’s shareholders.\n In this post, I’m going to discuss Twitter’s recent decision to remove a privacy feature from their service, including what they did, why they did it, and what this incident can teach us about online privacy and advertising in the present day.\n  Around April 7, 2020, Twitter users began receiving a strange notification (see screenshot) when they visited  twitter.com or opened the Twitter app. The notice informed people that a privacy setting related to advertising measurements had been removed from Twitter, leaving people with no choice but to click the “OK” button and agree. Twitter’s decision to summarily remove a privacy feature with no prior notice, explanation, or ability to object  left a bad taste  in peoples’ mouths (including mine).\n Bennet Cyphers from the EFF posted a  detailed technical background of what Twitter’s privacy settings used to allow, and how the new change impacts data sharing. To summarize: Twitter used to offer a setting (enabled by default) that allowed them to share two kinds of data with third-parties. Previously, Twitter users were free to uncheck this box and disable the data sharing ( supposedly, more on this below). The two types of data are:\n Conversion Tracking: This data is related to Twitter’s  “Mobile Application Promotion” (MAP) advertising product. This product allows app developers to advertise their apps on Twitter, and in turn Twitter reports  conversions back to the developer, i.e., Twitter users who viewed the ads, clicked them, and ultimately installed the apps. This style of advertisement is sometimes derogatorily referred to as “pay-per-install”.\n Third-party Analytics: This data is related to Twitter’s use of third-party analytics libraries on its website and app (notably developed by Google and Facebook). In this case, Twitter uses the third-party libraries to gauge the effectiveness of their own ads on third-party platforms (e.g., in Google Search and the Facebook news feed).\n    For people in most of the world, the original privacy setting is gone and people can no longer opt-out of Twitter sharing conversion data. In it’s place is a new setting (shown in the screenshot above) that allows people to opt-out of some data sharing with business partners. This refers to the second type of data, i.e., analytics for Twitter’s own advertising purposes, but given the vague language it’s not entirely clear what this setting actually does in practice.\n In Europe, the  original setting remains and is  unchecked by default. People must opt-in to conversion sharing because of GDPR.\n  Given that this was not a user-friendly change and instigated unfavorable press coverage and commentary towards Twitter, the question immediately becomes: why did they make this change? The change was motivated by two related problems.\n The story starts on August 5, 2019, when Twitter posted an  obscure disclosure that the privacy setting in question didn’t actually work. Even if a person unchecked the box to opt-out, Twitter still shared conversion data with third-parties (between May 2018 and August 2019) and analytics cookies with third-parties (between September 2018 and August 2019). Twitter’s post is apologetic but also somewhat defiant – they acknowledge their mistake but reassure everyone that data was only being shared with “trusted” third-parties anyway. Regardless, Twitter fixed the bug so that the privacy setting functioned as intended.\n After Twitter fixed the bug and started honoring peoples’ privacy choices, they ran into a second problem: their advertising revenue declined precipitously, causing them to  miss their Q3 2019 revenue targets. Twitter revealed that fixing the bug is what caused advertising revenue to drop, i.e., mobile app developers were spending less money placing MAP ads because they could no longer target their ads or track conversions as effectively.\n Ultimately, Twitter decided that they could no longer lose the advertising revenue from MAP ads, so they eliminated most peoples’ ability to opt-out of conversion tracking.\n   When trying to defend their privacy practices against encroaching regulators, tech companies often draw on the metaphor of “control”. In this narrative, tech companies are bending over backward to responsibly self-regulate and give people control over their data. The tech companies point to their privacy settings, opt-outs, and data dashboards as reasons why actual privacy regulation is unnecessary – people already have all the tools they need, apparently.\n This Twitter incident reveals a fundamental flaw in this narrative: “control” is meaningless when it’s a discretionary capability that can be taken away at any time. In a contest between (A) growing revenue and appeasing shareholders versus (B) user control and privacy, Twitter chose the former. In other words, Twitter is willing to offer people privacy control so long as it doesn’t impact the prime directive: profit. In the US as in most of the world, the power to collect, share, and profit from data, as well as decide the (limited) privacy affordances offered to users, rests squarely with industry.\n Yet, as I noted above, people in Europe were the exception to Twitter’s shifting stance on conversion data. In Europe the GDPR forces companies to obtain affirmative, opt-in consent before sharing most types of data with third-parties. This prevented Twitter from removing the conversion data setting and forced Twitter to make the setting opt-in rather than opt-out. The GDPR is not perfect, but it has undoubtedly shifted the power to dictate online privacy norms away from industry and into democratic government.\n As the  EFF notes, this Twitter incident is one more reminder of why we need comprehensive federal privacy regulation in the US.\n  Another point concerns the original privacy bug that Twitter fixed in 2019. Prior to the bug fix, people thought they had control over data shared with third-parties by Twitter, but they didn’t.\n We all rely on privacy settings in software and services that we use. Yet, as this incident demonstrates, we often have no idea whether these settings actually work as intended, and whether our choices are being honored. Whether through malice or neglect, it’s possible for our privacy to be compromised even when we have taken the time to engage with services and navigate their (often byzantine) privacy settings.\n In a world where “control” is our primary tool for affecting online privacy, privacy settings need to be critically examined by independent auditors. Twitter didn’t notice that their service was leaking conversion data for 15 months – we can’t rely on tech companies to self-regulate, let alone implement robust software. In much the same way that good cybersecurity requires independent “red team” reviews, we should demand that tech companies engage in privacy compliance audits, and hold Chief Information Security Officers accountable for failings that are uncovered.\n Aside: thus far, I am not aware of any repercussions against Twitter for their misrepresentations regarding their privacy settings, although this certainly seems like a instance where the FTC could (and should) investigate Twitter’s potentially deceptive trade practices.\n  One final point: this incident reminds us that people’s privacy choices matter. In this case, it appears that the decision to opt-out by a minority of Twitter’s users was sufficient to significantly reduce Twitter’s advertising revenue, so much so that Twitter was forced to eradicate the opt-out choice altogether. Does this suggest that the privacy conscious people who opted-out were a particularly lucrative audience for ads, or does it simply imply that strength in numbers is sufficient to push back against surveillance capitalism?\n For the scientifically minded, this whole incident is potentially a natural experiment. We know the rough range of time during which Twitter was improperly sharing conversion data within their MAP advertising product, as well as the date on which that flow of data was curtailed. Further, the impact on Twitter’s revenue is known. Does this offer an opportunity to measure the actual value of this user data? Given that only Twitter knows how many people actually opted-out of sharing conversion data, we may never know the answers to these questions.\n Regardless, the whole incident makes me hopeful that if more people were mobilized to opt-out of invasive data collection and sharing, it might cause sufficient pain to the industry to force a reckoning with these practices.\n  Update 04/19/2020: Hat tip to  Arvind Narayanan for  suggesting a more measured title for this post.", "posttime": "2020-05-21 14:32:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "选择,outs,twitter", "title": "选择退出突显了Twitter隐私和收入之间的紧张关系", "title_en": "Opt-outs highlight the tension between privacy and revenue at Twitter", "transed": 1, "url": "https://internetofthieves.org/posts/twitter-map-optout/", "via": "", "real_tags": ["选择", "outs", "twitter"]}, {"category": "", "categoryclass": "", "imagename": "74de239c280b8683fa2baa68d0e2d22a.jpeg", "infoid": 1003086, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天早些时候，我把下面的通知发给了员工。我在这里公开分享，以防其他人觉得有帮助。\n在我们所处的这场经济危机中，人们越来越多地交易和使用加密货币，对健全的货币和加密经济所能提供的东西感兴趣。Coinbase在这段时间内继续招聘和增长。如果您有兴趣与我们一起帮助创建这种新的文化，请查看我们的开放角色(不久将更新更多远程职位)。\n在隔离限制结束后，Coinbase将接受“远程优先”，这意味着我们将为绝大多数角色提供在办公室或远程工作的选择。\n无论是在办公室还是在远程，“远程优先”意味着我们都需要改变我们的工作方式。\n我们知道你有很多问题。我们还没有得到所有的答案，但我们正在努力。\n我相信，在冠状病毒的普遍的、强迫的在家工作实验之后，未来的工作将看起来非常不同。在过去的两个月里，我开始相信，远程工作不仅会留在这里，而且对我们来说是一个巨大的机遇和战略优势。今天，我很兴奋地与大家分享Coinbase的未来是远程优先的。\n这就是说以后，任何人只要愿意，都可以继续在办公室里工作。这一点不会改变。正在发生变化的是，(几乎)任何喜欢在办公室外工作的员工都可以。对于许多员工来说，这可能是两者兼而有之。但对我们所有人来说，远程优先需要思维方式和行为方式的转变。这意味着员工的体验应该是一样的，无论你是每周在办公室呆一天，还是一周呆五天，还是从不在办公室。\n这一变化是由社交距离要求引发的，但我们发现了一线希望：一些员工发现在家工作是一个受欢迎的变化，总体来说，过渡没有我们预期的那么复杂。\n我想承认，我们中没有人签约在远程优先的公司工作。但是，无论这一前景是令人兴奋的还是令人恐惧的，请慢慢来阅读这张便条。我希望你们能像我一样，把这一刻看作是一个参与创造工作未来的机会。\n在实践层面上，随着世界各国从隔离中脱颖而出，我们已经看到了采取像办公室人员之间六英尺间隔这样的措施的广泛方向。这很可能很快就会成为我们的现实。具体地说，一间办公室里所有员工之间的距离为6英尺，即使我们搬进SF总部的每一层楼，我们也没有足够的空间把所有现有的SF员工带回来，更不用说雇佣更多的员工了。\n因此，至少在中短期内，我们必须至少保持部分距离。如果这是我们必须做的事情，我希望Coinbase倾向于这种新的工作方式，而不是背离这种方式。我希望我们选择创新，让我们的公司成为密码价值的延伸。\n这就是战略考虑的用武之地：如果你在Coinbase工作了一段时间，你就知道我们在过去几年里在远程工作上来回奔波。现在的不同之处在于，这是一个远程优先的实验。虽然过渡不是无缝的，但运营复杂性比我们预期的要低，我们相信未来远程和办公室工作的组合将具有实质性的战略优势，具体地说：\nCoinbase的部分愿景是创造一个拥有更多经济自由的世界，而不局限于一个地点是这一愿景的关键部分。办公室内工作和远程工作的混合使我们可以“降低”将过多工作集中在一个位置的风险。\n在WFH工作了一段时间后，我们认为远程工作(或部分在办公室，部分在远程)是许多人，包括我们专注于招聘的顶尖人才，会从雇主那里期待的选择。这也意味着我们可以从世界各地吸引顶尖人才。\n我在我的博客文章中写到了这一点，但这将是关于你如何工作的，而不是关于你在哪里工作的。\n再说一次，这种转变是关于选择权的。我们打算为所有想要远程工作的员工提供远程工作，同时为那些不需要的员工保持在办公室工作的能力。在远程优先Coinbase：\n在任何地点工作都没有明显或隐含的缺点：所有员工无论身在何处都拥有相同的体验。\n有些人不能或不想远程办公，因此我们计划继续在主要中心城市设立实体办公室。\n随着时间的推移，我们的愿景是在十个城市拥有一层办公空间，而不是在一个城市拥有十层办公空间。\n我们将向远程应聘者开放大多数新角色，并对沟通等重要技能保持较高的门槛。\n实际上，远程优先意味着新的工作方式，比如减少分配的座位，办公室里的人单独拨入会议，而不是面对面的会议，记录所有的事情(这样人们就不需要同时提问)，等等。\n我们估计，公司20-60%的员工将远程启动(一旦解除冠状病毒的限制)。如果这是成功的，我们预计我们的偏远人口将有机增长。\n这将需要我们在做事方式上进行巨大的转变。我们怎么去那里？\n进行此过渡存在风险，仍有许多问题需要回答：协作是什么样子？我们怎样才能确保偏远地区的人们能得到适当的家庭设置呢？远程优先学习和开发将如何工作？为了解决所有这些问题，我们将组建一个跨职能团队来监督这一过渡。该小组将确定我们要成为远程优先公司必须做出哪些改变(例如，围绕人员管理、招聘/人才、文化和人脉以及文档和异步工作…)。，与所有人一起主持公开设计会议，阐述想法、考虑事项、依赖关系和关注事项，并与内部专家合作，重新设计远程优先Coinbase的所有这些工作方式。\n我想提醒您，您现在正在体验的远程工作版本是不正常的，或者是我们在这里提议的版本(有一天，我们可以选择在办公室工作，当我们喜欢的时候，可以再次举行团队务虚会和假日派对，我们的孩子将回到学校，我们可以看到我们的朋友)。这是旅程的开始，这是我们在逆境中寻找优势的方式。\n我相信，我们通过这一过程所做的工作，基本上将为其他公司向远程优先转型提供一份剧本，而我们此时此刻所做的事情可能会影响许多公司的前进道路。\n有很多未知数，我相信你有很多问题。本着默认开放的精神，我们希望尽早分享这一决定，即使我们还没有这些问题的答案。我们的第一步是将您所有的问题、担忧和反应公之于众，这样我们就可以在接下来的几个月里解决它们。我们已经创建了一个新的频道来收集这些信息，#Ask-Remote-First，并在Coinbase的这一新章节中采取后续步骤。", "note_en": "I sent the note below to employees earlier today. I’m sharing it publicly here in case others find it helpful.\n People are trading and using cryptocurrency more and more during this economic crisis we’re in, getting interested in sound money and what the cryptoeconomy can offer. Coinbase is continuing to hire and grow during this time period. If you’re interested in helping create this new culture with us, please check out our  open roles (soon to be updated with more remote positions).\n  After the restrictions of quarantine are over, Coinbase will embrace being “remote-first,” meaning we will offer the option to work in an office or remotely for the vast majority of roles.\n Whether in an office or remote, being “remote-first” means we will all need to shift how we work.\n We know you have lots of questions. We don’t have all the answers yet, but we’re working on it.\n I believe that the future of work  will look very different after the universal, forced work from home experiment of COVID-19. Over the last two months, I have come to believe that not only is remote work here to stay, but that it represents a huge opportunity and strategic advantage for us. Today, I’m excited to share that the future of Coinbase is remote-first.\n This means that in the future, anyone who wants to, can continue to work from an office. That won’t change. What  is changing is that (almost) any employee who prefers to work outside of an office, can. For many employees, it will probably be a mix of both. But for all of us, being remote-first requires a mindset and behavioral shift. It means that the employee experience should be the same, whether you’re in an office one day a week, five days a week, or never.\n This change was initiated by social distancing requirements, but we’ve found silver linings: some employees are finding work from home to be a welcome change, and overall it’s been less complicated to transition than we would have expected.\n I want to acknowledge that none of us signed up to work at a remote-first company. But whether this prospect is exciting or scary, please take your time in reading this note. I hope you can come to see this moment, like I do, as an opportunity to have a hand in inventing the future of work.\n   On a practical level, as countries around the world have emerged from quarantines, we’ve seen broad direction to adopt measures like six feet of separation between people in offices. This is likely to be our reality soon. To be concrete: with six feet between all employees in an office, even if we moved into  every floor of our SF HQ, we wouldn’t have enough space to bring all current SF employees back, let alone hire more.\n So at least in the short- to medium-term, we  must remain at least partially remote. If this is something we must do, I want Coinbase to lean toward, not away from, this new way of working. I want us to choose innovation, and make our company an extension of the values of crypto.\n This is where the strategic consideration comes in: If you’ve been at Coinbase for some time, you know we’ve gone back and forth on remote work in the last few years. The difference now is that this has been an experiment in being  remote- first. While the transition hasn’t been seamless, there has been less operational complexity than we expected, and we believe there will be substantial strategic advantages in a mix of remote and in-office work going forward, specifically:\n Part of the vision for Coinbase is to create a world with more economic freedom, and not being tied to one location is a key part of this. A mix of in-office and remote work allows us to “de-risk” centralizing too much in a single location.\n After a period of WFH, we think remote work (or part in-office and part remote) are options that many people, including the top talent we’re focused on hiring, will come to expect from employers. It also means we can capture top talent from all over the world.\n  I wrote about this  in my blog post, but this will be about  how you work, not  where you work.\n Again, this shift is about  optionality.  We intend to offer remote work to all of our employees who want it, while maintaining the ability to work from an office for those who don’t. At a remote-first Coinbase:\n There are no explicit or implicit disadvantages to working from any location: all employees have the same experience regardless of where they are.\n Some people can’t or won’t want to work remotely, so we plan to continue having physical offices in major hub cities.\n Over time, the vision is to have one floor of office space in ten cities, rather than ten floors of office space in one city.\n We’ll open up most new roles to remote candidates, and maintain a high bar for important skills like communication.\n In practice, being remote-first means new ways of working, like less assigned seating, in-office folks dial into meetings separately vs. meeting in person, documenting everything (so people don’t rely on synchronously asking questions), etc.\n We’re estimating that between 20–60% of the company will work remotely to start (once the restrictions of COVID-19 are lifted). If this is a success, we expect our remote population to grow organically.\n This will require a huge shift in how we do things. How will we get there?\n There are risks to making this transition, and there are still many questions to answer: What does collaboration look like? How can we make sure remote folks can get proper home set-ups? How will remote-first Learning and Development work? To address all of these,  we will form a cross-functional team to oversee this transition. This group will identify the changes we must make to become a remote-first company (e.g., around people management, recruiting/talent, culture and connection, and documentation and async work…), host open design sessions with all of you to surface ideas, considerations, dependencies, and concerns, and partner with internal experts to redesign how all of this works for a remote-first Coinbase.\n  I want to remind you that the version of remote work you’re experiencing now is NOT normal, or what we’re proposing here (someday we’ll have the option of working from an office when we feel like it, can have team retreats and holiday parties again, our kids will be back in school, and we can see our friends). This is the beginning of a journey, this is how we’re finding advantage in adversity.\n I believe that the work we do through this process will essentially generate a playbook for other companies in their transition to become remote-first, and that what we do in this moment could influence many companies’ paths forward.\n There are a lot of unknowns, and I’m sure you have a lot of questions. In the spirit of defaulting to open, we wanted to share this decision early, even if we don’t have the answers to those questions yet. Our very first step is to surface all of your questions, concerns, and reactions, so we can address them over the following months. We’ve created a new channel to collect these, #ask-remote-first, and take the next steps in this new chapter for Coinbase.", "posttime": "2020-05-21 14:32:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,病毒,coinbase,remote", "title": "在冠状病毒之后，Coinbase将成为一家远程第一公司", "title_en": "Post Covid-19, Coinbase will be a remote-first company", "transed": 1, "url": "https://blog.coinbase.com/post-covid-19-coinbase-will-be-a-remote-first-company-cdac6e621df7?gi=97cf312cab0b", "via": "", "real_tags": ["冠状病毒", "病毒", "coinbase", "remote"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003084, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "单击菜单栏中的AltStore图标，然后单击Install Mail Plug-in选项。\n打开邮件首选项中的General选项卡，单击Manage Pluins，选中AltPlugin，然后应用并重新启动Mail。\n在您的iOS设备上，打开设置-&gt；常规-&gt；设备管理，然后点击您的Apple ID。\n找到您的设备，单击加号，然后选择由iOS App Siger创建的文件。\n输入您的Apple ID和密码(需要开发人员帐户)。(注意：如果您使用双因素身份验证，请生成特定于应用程序的密码，并在此处使用该密码。)。\n在您的iOS设备上，打开设置-&gt；常规-&gt；设备管理，然后点击您的Apple ID。\n右键单击您刚刚下载的zip，然后单击“全部解压”。等这件事结束吧。\n单击任务栏中网络图标旁边的箭头图标。这将调出一个带有多个图标的菜单。当鼠标悬停在上面时，寻找一个菱形徽标，上面写着AltServer。点击它。\n在您的iOS设备上，打开设置-&gt；常规-&gt；设备管理，然后点击您的Apple ID。\n输入您的Apple ID和密码(需要开发人员帐户)。(注意：如果您使用双因素身份验证，请生成特定于应用程序的密码，并在此处使用该密码。)。\n在您的iOS设备上，打开设置-&gt；常规-&gt；设备管理，然后点击您的Apple ID。", "note_en": "Click on the AltStore icon in the Menu Bar, and then click on the Install Mail Plug-in option.\n    Open the General tab in mail preferences, click Manage Plug-ins, check AltPlugin, and apply and restart Mail.\n        On your iOS device, open Settings -&gt; General -&gt; Device Management and tap on your Apple ID.\n    Find your device, click the plus, and select the file created by iOS App Signer.\n    Enter your Apple ID and password (requires developer account). (Note: If you are using two factor authentication, generate an app specific password, and use that here.)\n  On your iOS device, open Settings -&gt; General -&gt; Device Management and tap on your Apple ID.\n  Right click the zip you just downloaded and click “Extract All.” Wait until this finishes.\n      Click the arrow icon near the network icon in the taskbar. This will bring up an menu with multiple icons. Look for a diamond shaped logo that says AltServer when mousing over it. Click on it.\n      On your iOS device, open Settings -&gt; General -&gt; Device Management and tap on your Apple ID.\n    Enter your Apple ID and password (requires developer account). (Note: If you are using two factor authentication, generate an app specific password, and use that here.)\n  On your iOS device, open Settings -&gt; General -&gt; Device Management and tap on your Apple ID.", "posttime": "2020-05-21 13:47:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ios,越狱,devices,图标", "title": "最先进的越狱工具。即将用于iOS 13.5上的所有设备", "title_en": "The most advanced jail-break tool. Coming soon to all devices on iOS 13.5", "transed": 1, "url": "https://unc0ver.dev/", "via": "", "real_tags": ["ios", "越狱", "devices", "图标"]}, {"category": "", "categoryclass": "", "imagename": "bac945c1989007c0de59eadab216b437.jpg", "infoid": 1003083, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "©2020财富传媒IP有限公司。版权所有。使用本网站即表示接受我们的使用条款和隐私政策(您的加州隐私权)|CCPA请勿出售我的信息财富是Fortune Media IP Limited的商标，在美国和其他国家/地区注册。“财富”杂志可能会因本网站上的一些产品和服务链接而获得补偿。报盘如有更改，恕不另行通知。引文至少延迟了15分钟。由Interactive Data提供的市场数据。晨星公司提供的ETF和共同基金数据。道琼斯条款和条件：http://www.djindexes.com/mdsidx/html/tandc/indexestandcs.html.。标准普尔指数数据是芝加哥商品交易所公司的财产。以及它的许可人。版权所有。条款和条件。由交互式数据托管解决方案提供支持和实施。|欧盟数据主题请求", "note_en": "© 2020 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our  Terms of Use and  Privacy Policy ( Your California Privacy Rights) |  CCPA Do Not Sell My Information FORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. Quotes delayed at least 15 minutes. Market data provided by  Interactive Data. ETF and Mutual Fund data provided by  Morningstar, Inc. Dow Jones Terms &amp; Conditions:  http://www.djindexes.com/mdsidx/html/tandc/indexestandcs.html. S&amp;P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved.  Terms &amp; Conditions. Powered and implemented by  Interactive Data Managed Solutions. |  EU Data Subject Requests", "posttime": "2020-05-21 13:46:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "股市,赢家,losers,数据", "title": "股市赢家和输家之间的估值差距是20年来最高的。", "title_en": "The valuation gap between stock market winners and losers is highest in 20 years", "transed": 1, "url": "https://fortune.com/2020/05/18/stock-market-valuation-gap-coronavirus-goldman-sachs/", "via": "", "real_tags": ["股市", "赢家", "losers", "数据"]}]