[{"category": "", "categoryclass": "", "imagename": "7583c582a09ba5fcac7604ae2baefec2.png", "infoid": 1007138, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在C++20中，std：：Sort与其他标准算法一起变成了constexpr。这使得以下代码成为可能。\n第14行的sorted_arr在编译时被初始化为{1，2，3，4，5}，并且main返回1。如您所见，机器代码中没有排序算法和逻辑的痕迹。此外，如果您打开优化(-O3)，整个代码就会变成一条指令，从而证明所有排序都发生在编译时。\n让我们看看如何使用C++17来实现这一点。在开始实现之前，我们将列出合并排序所需的内容。如果您不知道合并排序是如何工作的，那么您可能不想看到即将到来的代码。\n该数组非常简单。它是具有任意数量的整数模板参数的类型。它附带GET功能以启用索引访问。GET以递归方式实现。第7-8行是签名的定义，即GET接受两个参数，一个数组(Type)和一个索引(整数)。第10-14行是递归关系：数组的第i个值是该数组的第(index-1)个值，没有第一个元素。第16-20行是递归的基本情况：第0个值是第一个元素。如果它看起来仍然是胡言乱语，可以将结构行视为函数签名，将尖括号(&lt；&gt；)中的内容视为参数，并将“static const int value”行视为返回语句。示例：\n第22-23行定义的get_v只是语法糖，以避免总是写入：：value。\n准备好之后，让我们开始使用自上而下的方法实现排序。我们要做到以下几点：\n在第4-5行，我们定义了原型：它接受单个数组作为输入。第7-11行是递归的基本情况之一：对空数组进行排序会产生空数组。第13-17行是另一种基本情况：对具有单个元素的数组进行排序会得到相同的数组。最后是肉和土豆，在第19-29行，一般情况。在这里，我们需要将任意大小的输入数组一分为二，对每个数组进行排序，最后将它们合并。在第23行，我们“预先计算”数组的长度，以使整个代码更具可读性。在第26行，我们获取数组的前半部分并对其进行排序，在第27行，我们获取后半部分，并再次对其进行排序。在第25行，我们将这两个合并。所以现在，我们必须实现merge_t、take_t和drop_t。同样，第31-32行只是语法糖，以便能够编写sort&lt；arr&gt；而不是typeName sort&lt；arr&gt；：：type。\n让我们从Drop开始，因为它是最简单的(不是吗？)\n它接受一个数组和一个数字N，并返回删除该数组的前N个元素后剩下的内容。例如：\n实现相当简单。第7-11行是递归关系，其中我们删除第一个元素并递减N，第13-17行是基本情况，即删除0个元素的情况。\n这非常类似于Get Up There，所以应该可以很好地工作，对吧？不对!。不是的。问题是模板专门化中的模棱两可。在GET的例子中，一切都很好，因为我们有以下两个专门化。\n第一个专门化(第5行)接受两个参数。第一个数组&lt；I0是.&gt；，它是一个由1个或多个元素组成的数组，因为I0正好是“1个或多个”。第二个参数是整数。在第二个模板专门化中(第11行)，第一个参数完全相同，但是第二个参数是0，因此第二个专门化更加专门化。总之，第一个参数必须是一个包含1个或多个元素的数组，第二个参数必须是一个数字。如果为0，将实例化第二个专用化(第10-14行)，否则实例化第一个专用化(第4-8行)。\n在DROP的实现中，我们对这两个参数都进行了更改。第一个专门化(第5行)用于具有1个或多个元素且任意数字为N的数组。第二个专门化(第11行)用于具有0个或更多元素且数字为0的数组。0比N更加专门化，但是，数组&lt；is.&gt；不如数组&lt；I0，is.&gt；专门化(因为后者排除了空数组的情况)。因此，这种模棱两可。例如，当编译器看到DROP_t&lt；array&lt；1、2、3&gt；、0&gt；时，它无法在这些专门化之间进行选择。以下是我们如何解决这种模棱两可的问题：\n这里我们有3个模板专业化认证。第一个与以前相同，第二个(第11行)是第一个的更特殊版本，第三个(第17行)涵盖空数组的情况(前两个没有)。我们没有使用非零值专门化空数组的情况，因为这是一个错误的情况，我们确实希望它编译失败。\n我们实现Take的方式非常相似。同样，出于同样的原因，我们有3个模板专业化认证。N=0的基本情况相当微不足道。在一般情况下(第10行)，只有一个新的东西，前缀_t，它接受一个整数、一个数组，并且显然将一个前缀到另一个前缀。\n最后，拼图的最后一块是merge_t，它应该接受两个排序的数组，并将它们合并成一个排序的数组。\n如第4-5行的签名所示，Merge接受两个数组作为输入参数。有三种基本情况是专门的。第19-23行和第25-29行是合并空数组和非空数组的基本情况。31-35上的基本情况的定义只是出于团结，只是为了涵盖合并两个空数组的情况。另外两个专门化没有涵盖它，因为它们同样适用于这种情况，因此造成了歧义。然而，我们的排序实现永远不会要求它。一般的案例逻辑再次递归(第7-17行)。我们基本上找到这两个数组的前两个元素中最小的一个，将其从数组中分离出来，合并其余的元素，最后将这个分离的元素添加到结果前面。下面是一个循序渐进的演示。\n正如我们看到的(第4行)，在一般情况下(两个非空数组的情况)，合并解析为预端。此预端的两个参数取决于两个数组的前几个元素(I0和J0)。第一个参数是其中最小的一个(第5行)。如果绿色条件为真，则第二个参数(第6-8行)是与红色数组合并的结果，否则是与蓝色数组合并的结果。Conditional_t的工作方式与三元运算符(？：)非常相似。", "note_en": "In C++20  std::sort, along with other standard algorithms, becomes  constexpr. That makes the following code possible.\n  The  sorted_arr on line 14 is initialized to  { 1, 2, 3, 4, 5} at compile-time, and the  main returns  1. Here’s the  Godbolt of this code to play around with. As you can see, there are no traces of the sorting algorithm and logic in the machine code. Moreover, if you turn the optimizations on (-O3), this whole code becomes a single instruction, proving that all the sorting happens at compile-time.\n Let’s see how to accomplish this with C++17. Before starting with the implementation, we’ll list down what we need for the merge sort. If you don’t know how merge sort works, you probably don’t want to see the code that’s coming.\n  The  array is as simple as it gets. It’s a type with an arbitrary number of integer template arguments. It comes with  get functionality to enable indexed access.  get is implemented recursively. On lines 7–8 is the definition of the signature, that is,  get takes two parameters, an array (type) and an index (integer). On lines 10–14 is the recurrence relation: the  INDEX-th value of an array is the  (INDEX - 1)-th value of that array without the first element. On lines 16–20 is the base case of the recursion: the  0-th value is the first element. If it still looks gibberish, think of the  struct line as a function signature, the things inside the angle brackets (&lt;&gt;) as the parameters, and the “ static const int value” line as the return statement. Example:\n  get_v defined on lines 22–23 is just syntactic sugar to avoid writing  ::value all the time.\n With this ready let’s start implementing the  sort with a top-down approach. We want to achieve the following:\n    On lines 4–5 we define the prototype: it takes a single array as an input. Lines 7–11 is one of the base cases of the recursion: sorting an empty array results in an empty array. Lines 13–17 is the other base case: sorting an array with a single element results in the same array. And finally, the meat and potatoes, on lines 19–29, the general case. Here we need to split the input array of arbitrary size into two, sort each and finally merge them. On line 23 we “precalculate” the length of the array to make the whole code more readable. On line 26 we take the first half of the array and sort it, on line 27 we take the second half and, again, sort it. On line 25 we merge those two. So now, we have to implement the  merge_t,  take_t and  drop_t. And again, lines 31–32 is just syntactic sugar to enable writing  sort_t&lt;arr&gt; instead of  typename sort&lt;arr&gt;::type.\n Let’s start with the  drop as it’s the simplest (or is it?).\n  It takes an array and a number  N and returns what’s left after removing the first  N elements of that array. E.g.\n  The implementation is quite trivial. Lines 7–11 is the recurrence relation, where we drop the first element and decrement the  N, and lines 13–17 is the base case, the case of dropping 0 elements.\n  This is very similar to the  get up there, so it should work fine, right? WRONG! It doesn’t. The problem is the ambiguity in the template specialization. In  get’s case everything was fine because we had the following two specializations.\n  The first specialization (line 5) takes two parameters. The first one,  array&lt;I0, Is...&gt;, is an  array of  1 or more elements, exactly  “1 or more” because of the  I0. The second parameter is an integer. In the second template specialization (line 11) the first parameter is exactly the same, but the second parameter is  0, thus this second specialization  is more specialized. In summary, the first parameter must be  an array of 1 or more elements, and the second one must be a number. If it’s  0, the second specialization (lines 10–14) will be instantiated, otherwise the first specialization (lines 4–8).\n  In the implementation of  drop we had both parameters change. The first specialization (line 5) is for  arrays with 1 or more elements and  any number N. The second one (line 11) is for  arrays with 0 or more elements and  the number 0.  0 is more specialized than  N, however,  array&lt;Is...&gt; is less specialized than  array&lt;I0, Is...&gt; (because the latter excludes the case of the empty array). Therefore the ambiguity. The compiler is unable to choose between these specializations when it sees, for example,  drop_t&lt;array&lt;1, 2, 3&gt;, 0&gt;. Here’s how we fix this ambiguity:\n  Here we have 3 template specializations. The first one is the same as it was, the second one (line 11) is a more specialized version of the first one, and the third one (line 17) covers the case of the empty array (which the first two don’t). We don’t specialize the case of the empty array with a non-zero value, as it’s an erroneous case and we do want it to fail compilation.\n  We implement the  take quite similarly. Again, we have 3 template specializations for the same reason. The base case of  N=0 is quite trivial. There’s only one new thing in the general case (line 10), the  prepend_t. It takes an integer, an array, and obviously prepends one to the other.\n  And finally, the last piece of the puzzle, the  merge_t. It’s supposed to take two sorted arrays and merge them into a single sorted array.\n  As the signature suggests on lines 4–5,  merge takes two arrays as input parameters. There are three base cases specialized. Lines 19–23 and 25–29 are the base cases merging an empty array with a non-empty one. The base case on 31–35 is defined only out of solidarity, just to cover the case of merging two empty arrays. The other two specializations don’t cover it as they&#39;re equally appropriate for that case, thus causing ambiguity. Nevertheless, our  sort implementation will never ask for it. The general case logic is recursive again (lines 7–17). We basically find the smallest of the two first elements of those two arrays, separate it from its array, merge the rest, and finally prepend this separated element to that result. Here’s a step by step demonstration.\n    As we can see (line 4), in the general case (the case of two non-empty arrays)  merge resolves to a  prepend. The two parameters of this  prepend depend on the first elements of the two arrays ( I0 and  J0). The first parameter is the least of them (line 5). The second parameter (lines 6–8) is the result of a  merge with the red arrays if the green condition is true, and with the blue arrays otherwise.  std::conditional_t works a lot like the ternary operator (?:).", "posttime": "2020-06-19 02:38:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编译,c++,排序,数组", "title": "编译时合并排序[C++]", "title_en": "Compile-time Merge Sort [C++]", "transed": 1, "url": "https://medium.com/@vgasparyan1995/compile-time-merge-sort-c-bb0ace62cc23", "via": "", "real_tags": ["编译", "c++", "排序", "数组"]}, {"category": "", "categoryclass": "", "imagename": "c6bfcb7a2b5c7aa1497db12267dcb328.jpg", "infoid": 1007137, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "埃里克·法科夫斯基(Eric Falkowski)说，他每周工作几个小时制造假冒处方阿片类药物，过着轻松的生活，后来有20多人过量服药，当局抓住了他。\n他说，他将芬太尼与来自Xanax和Tylenol的活性成分混合，并将化合物压制成看起来像Perdicet的药丸，直到颜色和标记完全相同。\n他从哪里弄到这些设备的？根据联邦法庭记录和Falkowski本人：Amazon.com。\n“我在那里买了两台压药机。我还购买了药丸冲压模具，这是塑造药丸并在它们上印上所需数字的模具，“Falkowski在监狱接受电话采访时说。他因与假药业务有关的罪行在监狱服刑22年。\n“你在药片…上的代码下搜索。然后它就会出现，“他补充说。“这真的没有那么复杂。”\n根据官员、执法文件和尸检报告，有两人在服用法尔科夫斯基的药片后死亡，另一名妇女被发现死于他存放临时实验室的房产上的服药过量。另有20多人因服用这些药片而患病，但幸存下来。\n田纳西州卢瑟福德县的前警长德里克·赫尔顿(Derrick Helton)说，“有人可以用这些”毒丸“消灭整个城镇。”田纳西州的卢瑟福德县就是大规模服药过量的地方。其中一名遇难者是他的妹妹蒂芬妮·斯科特(Tiffanie Scott)，33岁，是一个年幼女儿的母亲。\n亚马逊禁止用来制造处方药的压药机。它们包括在其美国市场长达38页的第三方卖家规则和禁令中。\n然而，该标记的一项调查发现，亚马逊未能正确执行这份名单，允许第三方卖家张贴和销售违禁商品。\n除了第三方市场，亚马逊还直接向消费者销售产品，加价发现它自己也在销售违禁品，暴露出为其庞大的产品目录提供信息的基本上自动化的采购系统存在漏洞。\n我们发现，该公司在毒品、盗窃、间谍、武器和其他危险物品类别下禁止的产品有近100个清单，这是一个虚拟的后巷，大多数第三方卖家在那里兜售违禁商品，其中一些被用于非法和潜在的犯罪活动。\n这个标记把一辆购物车装满了一大堆违禁物品：大麻烟枪，用于吸入浓缩大麻的“轻拍工具包”，可以用来提高一氧化二氮含量的“饼干”，以及审查显示被用作注射毒品的化合物。\n我们发现了两个压药机和一个模具，用来将药片塑造成变形金刚的标志，这是在摇头丸等俱乐部毒品上发现的印记字符之一。我们发现了被禁止的撬锁和撬开车门的工具清单。我们发现了亚马逊特别禁止的AR-15枪支零部件。\n近30多个违禁品清单由第三方出售，但可以从亚马逊自己的仓库发货。至少有四家公司被列为“亚马逊的选择”。\n我们发现的五种违禁商品的购买按钮下方都出现了“亚马逊发货和由亚马逊销售”的字样，两名前员工证实，这意味着这些产品实际上是亚马逊销售的。此外，我们联系到的一家卖家也证实，它向亚马逊出售了这些商品。\n我们发现的许多商品已经挂牌销售了几个月，有些商品的好评显示它们已经售出，包括亚马逊直接销售的一些商品。\n亚马逊直接把我们带到了被禁止的名单上。当我们在网站的搜索栏中输入“bong”时，自动补全的建议包括“吸食大麻的bong”。当我们输入“Pill Press”时，自动完成提示是“Pill Press for make pill Xanax”。\n亚马逊发言人帕特里克·格雷厄姆(Patrick Graham)在一份针对加价的书面声明中表示，该公司“已经采取了积极措施，防止可疑或被禁止的产品被列入名单”，并表示该公司去年阻止了60多亿份“疑似不良名单”发布，重复了该公司今年早些时候向国会发表的言论。\n他说：“如果在我们的网站上发现违反我们政策的产品，我们会立即删除名单，对不良行为者采取行动，并进一步完善我们的系统。”\n格雷厄姆没有直接回答我们的许多具体问题，包括标记发现的违禁品中有多少已经售出，为什么公司几个月来没有注意到其中一些，为什么有一些被列为亚马逊的选择，以及为什么有很多被储存在亚马逊的仓库中等待发货。\n他完全没有回应为什么亚马逊自己会提供违禁商品出售的问题。\n我们向亚马逊报告的大多数被禁名单已经被删除，尽管至少有三个已经重新出现。\n据格雷厄姆说，该公司从AutoComplete中删除了我们提到的六个具体术语，他说，这一功能是由“其他客户进行的类似搜索”提供的。他不愿透露该公司是否也从AutoComplete中删除了所有其他禁用项目。\n格雷厄姆还拒绝解释为什么公司选择允许我们报告给公司的13个违禁物品继续出售。这些产品在亚马逊的规定中被明确列为违禁产品，符合美国司法部对毒品用具的定义，或者被两名武器专家确认为枪支部件或工具。其中两个是亚马逊自己销售的商品。\n除了我们在美国市场上发现的近100种违禁商品清单外，我们还发现了几种在亚马逊加拿大市场上出售的可以运往美国的压丸机。亚马逊在我们向该公司报告后将其撤下，其中包括Falkowski使用的型号之一、售价4100美元的TDP 5桌面平板电脑出版社(Desktop Tablet Press)。\n39岁的迈克尔·“谢恩”·希普利是田纳西州卢瑟福德县人，他是服用法科夫斯基的假药后死亡的人之一。他成年后一直在当地一家工厂操作机器。\n他的女儿布列塔尼·康韦(Brittany Conway)在接受采访时说：“我甚至无法告诉你我父亲的去世对我的家人造成了什么影响。”\n康威说，在她父亲去世的一天内，她自己也在医院的病床上醒来。她没有意识到她的父亲在家里把假药塞进了他的处方药瓶子里，悲痛欲绝的她服用了她认为是安全的药物来帮助她放松。\n格雷厄姆说，2016年Falkowski制造假药时，亚马逊的政策允许药片压榨销售。他拒绝对服药过量发表评论，并表示，总的来说，该公司对第三方产品销售造成的伤害不负责任。\n他说：“我们对这些产品不负责任，因为我们不制造、分销或销售这些产品。”他说，这也适用于亚马逊履行的第三方产品，亚马逊向卖家收取储存和运输商品的费用。\n该公司通过援引联邦通信体面法案(Communications Decency Act)第230条，成功地免除了其网站上销售的第三方产品造成的伤害的法律责任。该条款规定，网站对出现在其网站上的第三方内容不承担任何责任。\n去年，一家联邦上诉法院裁定，亚马逊可能会为其网站上出售的缺陷产品对客户造成的伤害承担责任，部分原因是该公司“允许第三方供应商向客户隐瞒自己，让客户因缺陷产品而受到伤害，而无法直接求助于第三方供应商。”\n根据电子商务情报公司Marketplace Pulse的数据，来自全球各地的300万第三方现在亚马逊的平台上销售产品。根据2019年提交给股东的一份报告，多年来，第三方卖家推动了公司的爆炸性增长。据报道，去年亚马逊第三方销售额超过2000亿美元-这一数字与新西兰的年GDP不相上下。\n多名现任和前任员工表示，公司难以监管这支独立卖家大军。由于担心遭到报复，这些员工大多要求不具名。\n2018年离开该公司的一名前产品安全团队成员表示：“因为卖家有能力自己将商品上传到网站上，所以很难在不阻碍做生意的情况下对所有这些进行监管。”“亚马逊知道有许许多多不应该出现在网站上的东西。\n“我们基本上会根据风险的严重程度对其进行分类，”这位前员工补充道。“这个产品会不会伤人或致死？这是不是有很高的法律风险？“。\n亚马逊的一名高管在今年早些时候向国会提交的声明中承认，“不良清单”得以通过，但他表示，该公司正在努力通过要求某些商品的卖家事先获得批准、与品牌合作拉出假货，以及增强“主动”工具来发现问题，以支持“假货、不安全产品和其他类型的滥用”的下滑。\n然而，加价发现，亚马逊的卖家工具有时有助于而不是阻碍违禁品的列出。\n当我们开了一个新的卖家账户，开始挂牌出售一个烟斗时，亚马逊建议我们把它列为家居装饰的花瓶。我们从来没有把它寄出去。\n上个月，我们成功地列出了两个违禁品出售：一个AR-15 10发子弹弹夹和一个AR-15装甲扳手。我们在确认他们发布了帖子后几分钟内就把它们删除了。我们为杂志购买了一个通用的产品代码，同时避开了特定的关键字，并对商品进行了错误分类，从而躲过了亚马逊自动过滤器的检测。\n尽管我们没有卖家历史，而且已经两次被禁止使用更准确的描述列出相同的商品，但挂牌数量还是上升了。\n格雷厄姆拒绝评论我们为什么能够发布这些商品，但表示亚马逊的卖家工具“建议列出类别，以帮助卖家轻松地对其产品进行分类，但卖家有责任选择正确的类别，因为他们最了解自己的产品。”他还拒绝就为什么这些工具建议上市bong的产品类别不正确发表评论。\n其他媒体曝光了亚马逊松懈的产品控制，其中包括去年的三篇报道：CNN的一项调查记录了危险的儿童汽车座椅，CNBC的一篇报道揭露了亚马逊正在运输过期食品和婴儿配方奶粉，以及华尔街日报的一项调查发现，该网站上有数千种不安全、违禁和带有欺骗性标签的产品。\n格雷厄姆说，亚马逊“紧急”地调查了这些问题，并寻求在需要时改进系统，但没有给出具体细节。\n消费者权益倡导者说，该公司在保护公众方面做得不够，监管机构需要介入。\n非营利组织公众公民(Public Citizen)的董事洛里·沃拉赫(Lori Wallach)说，“很明显，在监管服务条款或确保违禁产品不被销售方面，没有重大的优先事项或资源投入。”“销售的‘狂野西部’可能更有利可图，但对消费者来说也危险得多。”\n雷切尔·约翰逊·格里尔(Rachel Johnson Greer)在2010年加入亚马逊担任产品安全项目经理时表示，她发现许多待售的问题产品，从未经批准的勃起功能障碍治疗到非法的警方雷达干扰器。\n格里尔说：“他们在亚马逊上挂牌出售，开心地卖出去了。”\n她说，一些令人不安的产品是亚马逊自己直接销售的，她和其他人表示，亚马逊依赖于基本上自动化的购买过程。\n“亚马逊发货和销售的就是亚马逊。这一切就是这样开始的。“格里尔说，他在公司工作到2017年。“他们建立了算法来计算出他们需要买哪些书，然后再买多少。”\n她说，格里尔的工作是结束粗略的销售。她的团队编写了程序来标记不受欢迎的产品，并积累了一系列术语来满足自动警务系统的需求。她说，该工具最终可以在大约5分钟内扫描目录中的数十亿行项目。\n但事实证明它是有缺陷的，她说。该系统本质上仅限于已知的威胁-它以前见过的东西。格里尔说，新的问题一直在出现，并直接通过了最初的保障措施，但在出现问题后却被客户标记出来。\n“亚马逊系统最大的问题是，几乎所有东西都是被动的，”她说。“现实情况是，当你有一个依赖于每百万个缺陷中找出缺陷的系统时，这意味着总会有缺陷。”\n她说，一些第三方卖家设计了“聪明、狡猾的方式来列出产品”。而这些规则不能理解，因为它们不是由一个以聪明、狡猾的方式思考的人写的。“。\n限制品团队的一名现职员工疲倦地这样说：“不管我们移走多少，总会有更多。”\n格雷厄姆没有直接回应这些关于该公司在将限制项目保留在网站之外的困难的描述。相反，他更笼统地说，亚马逊努力“确保我们商店里的所有产品都是安全的”，“我们持续监控我们商店里出售的产品。”\n然而，我们发现一种未经证实的用电磁频率抗击癌症的疗法，亚马逊的政策禁止这种疗法-一种流行的机器-已经在网站上出现了五年。在我们联系亚马逊后，该列表被删除。\n虽然我们提请亚马逊注意的大多数具体被禁清单都被删除了，但我们没有向该公司报告的类似商品仍然存在，包括一些来自相同第三方卖家的清单。\n我们发现的违禁品的许多卖家继续销售违禁产品，包括销售枪支配件的铅钢公司，以及另一家公司，销售一种化合物，审查员说他们把这种化合物用作注射药物。当我们在后续问题中向亚马逊询问这一问题时，这些店面从亚马逊网站上消失了。\n格雷厄姆否认在其平台上销售可注射药物，称这些药物不是为此目的销售的，而是为了在上市时进行“研究”而销售的。在我们发现的两种化合物中，世界反兴奋剂机构将其中一种TB-500指定为“违禁物质”，美国反兴奋剂机构警告运动员第二种化合物BPC-157未被批准用于人类使用的风险。列表上的客户评论显示，人们正在注射这种产品。\n格雷厄姆表示，该公司删除了这些清单，并将把它们添加到其违禁产品清单中，“出于充分的谨慎”。但截至发表时，这两种化合物都可以在亚马逊上找到其他卖家出售。\n亚马逊并不是唯一一家不得不努力监管无法无天的第三方电子商务世界的在线零售商，在这个世界里，几乎任何人都可以销售几乎任何东西。Falkowski说，他在另一个网站购买了一些制毒用品。\n例如，苹果公司提供来自第三方的移动应用程序，在任何应用程序或更新出现在应用程序商店之前都会检查代码。根据苹果网站的信息，苹果使用自动化系统和数百名人类专家的组合，总共使用81种语言在发布之前对它们进行审查。\n“我们有责任确保应用程序在隐私、安全和内容方面达到高标准，”苹果公司的网站声明，“因为没有什么比维护我们用户的信任更重要了。”\n亚马逊的用户似乎清楚地知道他们在买什么，即使违禁产品被轻轻地伪装了一下。\n铅与钢铁公司将AR-15的一种枪械列为“镇纸办公桌管理器”，并发布了一张虎钳夹和橡皮的照片。\n顾客们在评论中加入了这个诡计。一位网友写道：“当你需要对桌面进行免提清理时，它会提供帮助。”“将物品牢固地锁在适当的位置，会装入大量的回形针或大头针。”\n另一位顾客反驳说：“对不起。我不会跟你玩的。我可以在亚马逊上全天买到AR-15部件。“。\n为了配合老虎钳，亚马逊的“经常一起购买”工具建议使用其他枪械工具，显示至少有一个亚马逊的自动化系统收到信号，表明它不是办公产品。\n亚马逊发言人格雷厄姆(Graham)拒绝解释为什么这些物品还在出售，尽管这个“经常一起购买”的工具似乎承认它们与枪支有关。\n铅与钢铁公司拒绝就本文接受采访，据评论称，自去年12月发布以来，铅与钢铁公司已经售出了至少40多块虎钳，直到我们向亚马逊(Amazon)报告了这一消息，亚马逊取消了上市。\n维克·马森科夫(Vic Massenkoff)是加利福尼亚州康特拉科斯塔县的一名退休火灾调查员。他说，几年前他曾试图让亚马逊拆除危险的设备，但他说，他对公司的不作为感到沮丧。\n他说，他见过太多使用丁烷从大麻中提取高效哈希油(或称“蜂蜜油”)的过程引发的火灾，并在2013年决定调查哪里可以找到出售的设备。他说他是在亚马逊网站上找到的。\n马森科夫说：“从拔牙管，到克电子秤，到硅胶垫，硅胶容器，再到数字温度计，所有的东西都排成了一排。”“开店所需的一切。”\n当他点击玻璃管的列表时，亚马逊的推荐引擎建议他购买制造和使用哈希油所需的其他物品。他保留了这些建议的截图。\n“制造丁烷蜂蜜油没有安全的方法，”他在接受采访时说。\n他说，他用工作电子邮件给亚马逊发了电子邮件，提醒公司注意危险。他仍然记得他的回答：“谢谢你让我们注意到这一点。我们已将其指派给我们员工中的某个人进行研究。“。\n亚马逊发言人格雷厄姆拒绝透露公司如何处理马森科夫的投诉，他说加价没有提供任何“证据”。\n亚马逊目前的规定禁止销售生产大麻油的设备；我们可以在网站上找到。\n您的贡献帮助我们调查了强大的机构对技术的使用如何影响我们的社会。请今天就捐款吧！\n捐出", "note_en": "Eric Falkowski said he made an easy living working a few hours a week making counterfeit prescription opioids before some two-dozen people overdosed and the authorities caught up with him.\n He mixed fentanyl with active ingredients from Xanax and Tylenol and pressed the compound into pills that looked like Percocet, he said, down to the exact color and markings.\n Where did he get the equipment? According to federal court records and Falkowski himself: Amazon.com.\n “I purchased two pill presses on there. I also purchased the pill press dies, which are the molds to shape the pills and imprint them with whatever number they need be,” Falkowski said in a phone interview from prison, where he is serving a 22-year sentence for crimes connected to his counterfeit drug business.\n “You search under the code on the pill … and it’ll just come up,” he added. “It really wasn’t that complex.”\n Two people died after taking Falkowski’s pills, and another woman was found dead from an overdose on the property where he kept his makeshift lab, according to officials, law enforcement documents, and autopsy reports. More than 20 others were sickened by the pills but survived.\n  “Someone could wipe out a whole town” with these “poisonous pills,” said Derrick Helton, a former sheriff’s deputy for Rutherford County, Tenn., where the mass overdose took place. One of the fatalities was his sister Tiffanie Scott, a 33-year-old mother of a young daughter.\n Amazon bans pill presses used to make prescription drugs. They’re included among 38 pages of third-party seller rules and prohibitions for its U.S. marketplace.\n Yet an investigation by The Markup found that Amazon fails to properly enforce that list, allowing third-party sellers to put up and sell banned items.\n Alongside its third-party marketplace, Amazon sells products to consumers directly, and The Markup found it was also selling banned items itself, revealing cracks in the largely automated purchasing system that feeds its massive product catalog.\n We found nearly 100 listings for products that the company bans under its categories of drugs, theft, spying, weapons and other dangerous items, a virtual back alley where mostly third-party sellers peddle prohibited goods, some of which are used for illicit and potentially criminal activities.\n  The Markup filled a shopping cart with a bounty of banned items: marijuana bongs, “ dab kits” used to inhale cannabis concentrates, “crackers” that can be used to get high on nitrous oxide, and compounds that reviews showed were used as injectable drugs.\n We found two pill presses and a die used to shape tablets into a Transformers logo, which is among the characters that have been found  imprinted on club drugs such as ecstasy. We found listings for prohibited tools for picking locks and jimmying open car doors. And we found AR-15 gun parts and accessories that Amazon specifically bans.\n Almost three dozen listings for banned items were sold by third parties but available to ship from Amazon’s own warehouses. At least four were listed as “Amazon’s Choice.”\n The phrase “ships from and sold by Amazon.com” appeared beneath the buy button of five of the banned items we found, which two former employees confirmed means those products are, in fact, sold by Amazon. In addition, one of the sellers we were able to reach also confirmed it sold the items to Amazon.\n Many of the items we found had been up for sale for months, some with positive reviews showing they had been sold, including some of the items sold directly by Amazon.\n  And Amazon led us right to the prohibited listings. When we typed “bong” into the website’s search bar, autocomplete suggestions included “bongs for smoking weed.” When we typed “pill press,” autocomplete suggested “pill press for making pills xanax.”\n In a written statement to The Markup, Amazon spokesperson Patrick Graham said the company has “proactive measures in place to prevent suspicious or prohibited products from being listed,” and that the company stopped more than six billion “suspected bad listings” from posting last year, repeating the company’s  remarks to Congress earlier this year.\n “If products that are against our policies are found on our site, we immediately remove the listing, take action on the bad actor, and further improve our systems,” he said.\n Graham did not respond directly to many of our specific questions, including how many of the banned items that The Markup found had been sold, why the company had not noticed some of them for months, why some were listed as Amazon’s Choice, and why many were stored in Amazon’s warehouses for shipment.\n He did not respond at all to questions about why Amazon itself had offered banned items for sale.\n Most of the banned listings we reported to Amazon have been removed, although at least three have popped back up.\n The company removed the six specific terms that we mentioned from autocomplete, according to Graham, who said that feature is informed by “similar searches by other customers.” He wouldn’t say whether the company also removed all other banned items from autocomplete.\n Graham also declined to explain why the company chose to allow 13 listings for banned items that we reported to the company to remain for sale. These products were specifically named as banned in Amazon’s rules, met the U.S. Department of Justice’s definition of drug paraphernalia, or were confirmed by two weapons experts to be a gun part or tool. Two of them were items that Amazon sells itself.\n In addition to the nearly 100 listings for banned items we found for sale in the U.S. marketplace, we found several pill presses for sale on Amazon’s Canadian marketplace that were available for shipment to the United States. Amazon took them down after we reported them to the company, including a $4,100 TDP 5 Desktop Tablet Press, one of the models Falkowski used.\n   Michael “Shane” Shipley, 39, a native of Rutherford County, Tenn., was one of the people who died after taking Falkowski’s fake pills. He’d worked his entire adult life operating machinery at a local factory.\n “I couldn’t even tell you what my dad’s death has done to my family,” his daughter Brittany Conway said in an interview.\n Within a day of her father’s death, Conway said, she woke up in a hospital bed herself. She didn’t realize her father had slipped the counterfeit pills into his prescription bottle of Percocet at home and, distraught with grief, she had taken what she thought was a safe medication to help her relax.\n  Graham said Amazon’s policies allowed pill press sales when Falkowski was making counterfeit drugs in 2016. He declined comment on the overdoses and said, speaking in general, that the company is not responsible for harm from third-party product sales.\n “We are not liable for those products because we do not make, distribute, or sell those products,” he said. He said that also applies to third-party products that are fulfilled by Amazon, which charges sellers to store and ship their items.\n The company has successfully shielded itself from legal liability for harm caused by third-party products sold on its website by invoking Section 230 of the federal Communications Decency Act, which states websites are not responsible for third-party content that appears on their sites.\n Last year, one federal appeals court  ruled that Amazon may shoulder liability for a customer’s injuries from a defective product sold on its site, in part because the company “enables third-party vendors to conceal themselves from the customer, leaving customers injured by defective products with no direct recourse to the third-party vendor.”\n  Three million third parties from across the globe are now selling on Amazon’s platforms, according to e-commerce intelligence firm Marketplace Pulse. And third-party sellers have fueled the company’s explosive growth for years, according to a  2019 report to shareholders. Last year, Amazon third-party sales reportedly  topped $200 billion—a sum that rivals the annual GDP of New Zealand.\n  Multiple current and former employees, most of whom asked not to be named for fear of retaliation, said the company struggles to oversee that army of independent sellers.\n “Because sellers have the ability to upload items themselves to the website, it makes it very difficult to police all of that without hindering the ability to do business,” said a former member of the product safety team who left the company in 2018. “Amazon knows there’s tons and tons and tons of stuff that shouldn’t be on the website.\n “We basically would categorize risks based on their severity,” the former employee added. “Will this product injure or kill someone? Is it high legal risk?”\n An Amazon executive acknowledged in the statement to Congress earlier this year that “bad listings” get through but said the company is working to shore up the slippage of “counterfeits, unsafe products, and other types of abuse” by requiring sellers of certain items to be preapproved, partnering with brands to pull counterfeits, and enhancing “proactive” tools to spot problems.\n Yet Amazon’s sellers’ tools sometimes help, rather than hinder, the listing of banned items, The Markup found.\n When we opened a new seller account and started listing a bong for sale, Amazon suggested we list it as a vase in home decor. We never posted it.\n Last month, we successfully listed two banned items for sale: an AR-15 10-round magazine and an AR-15 armorer’s wrench. We removed them within minutes of confirming they had posted. We were able to evade detection by Amazon’s automated filters by purchasing a universal product code for the magazine and by both avoiding specific keywords and miscategorizing the items.\n The listings went up even though we had no seller history and had already twice been prohibited from listing the same items using more precise descriptions.\n Graham declined to comment on why we were able to post these items but said Amazon’s sellers’ tools “suggest listing categories to help sellers easily categorize their products, but sellers are responsible for choosing the correct category, as they know their products best.” He also declined to comment on why the tools suggested an incorrect product category for listing bongs.\n Other media have exposed Amazon’s lax product controls, including three reports just last year: a  CNN investigation that documented dangerous child car seats, a  CNBC report that revealed Amazon was shipping expired food and baby formula, and a  Wall Street Journal investigation that found thousands of unsafe, banned, and deceptively labeled products on the site.\n Graham said Amazon investigated these “with urgency” and sought to improve systems when needed but gave no specifics.\n  Consumer advocates say the company isn’t doing enough to protect the public, and regulators need to step in.\n “It’s clear there’s not a major prioritization or investment in resources in policing the terms of service or ensuring that prohibited products are not sold,” said Lori Wallach, a director at the nonprofit organization Public Citizen. “It may be more profitable to have the ‘wild, wild west’ of sales, but it’s also much more dangerous for consumers.”\n   When Rachel Johnson Greer joined Amazon in 2010 as a product safety program manager, she said she found many problematic products for sale, from unapproved treatments of erectile dysfunction to illegal police radar jammers.\n “They were up for sale and selling happily away on Amazon,” Greer said.\n She said some troubling products were sold directly by Amazon itself, which she and others said relies on a mostly automated purchasing process.\n “Ships and sold by Amazon is Amazon. This is how it all started,” said Greer, who worked for the company until 2017. “They built algorithms to figure out which books they needed to buy and then how much.”\n It was Greer’s job to put an end to sketchy sales, she said. Her team wrote programs to flag undesirable products and amassed a universe of terms to feed an automated policing system. She said the tool eventually could scan billions of line items in the catalog in about five minutes.\n But it proved flawed, she said. The system by its nature was confined to known threats—things it had seen before. Greer said new problems emerged all the time and slipped right through initial safeguards, only to be flagged by customers after something went wrong.\n “The biggest problem with Amazon’s system to begin with is that nearly everything is reactive,” she said. “The reality is when you have a system that relies on finding defects per million, that means that there will always be defects.”\n She said some third-party sellers devised “clever, tricky ways to list products. And these rules couldn’t catch it because they hadn’t been written by a human who was thinking in clever, tricky ways.”\n  One current employee of the restricted products team wearily put it like this: “No matter how much we remove, there’s always more.”\n Graham did not directly respond to these descriptions of the company’s difficulties in keeping restricted items off the site. Instead, he said more generally that Amazon strives “to make sure that all products in our store are safe” and “we continuously monitor the products sold in our stores.”\n Yet we found an  unproven treatment to fight cancer with electromagnetic frequencies that is banned by Amazon’s policies—a rife machine—had been on the site for five years. The listing was removed after we contacted Amazon.\n While most of the specific banned listings we brought to Amazon’s attention were removed, similar items that we did not report to the company remained live, including some listings by the same third-party sellers.\n Many of the sellers of the banned items that we found continued to sell banned products, including Lead and Steel, which sold gun accessories, and another company, which sold a compound that reviewers said they used as injectable drugs. When we asked Amazon about this in follow-up questions, those storefronts disappeared from Amazon.com.\n Graham denied that injectable drugs were sold on its platform, saying they were not sold for that purpose but rather marketed for “research” in the listing. Of the two compounds we found, the World Anti-Doping Agency designates one, TB-500, as a “ prohibited substance,” and the U.S. Anti-Doping Agency  warned athletes about the risks of the second one, BPC-157, as not approved for human use. Customer reviews on the listing showed people were injecting the product.\n Graham said the company removed the listings and would add them to its banned product list “out of an abundance of caution.” But as of publication, both compounds could be found for sale by other sellers on Amazon.com.\n Amazon isn’t the only online retailer that has had to grapple with policing the unruly world of third-party e-commerce, where just about anybody can sell just about anything. Falkowski said he bought some of his drug-making supplies on another site.\n  Apple, which offers mobile apps from third-parties,  checks the code before any app or update appears in the App Store, for instance. According to its site, Apple uses a combination of automated systems and hundreds of human experts speaking a total of 81 languages to review them before posting.\n “We take responsibility for ensuring that apps are held to a high standard for privacy, security, and content,”  Apple’s website states, “because nothing is more important than maintaining the trust of our users.”\n Amazon’s users appear to know exactly what they’re buying, even when banned products are lightly disguised.\n Lead and Steel listed a gunsmithing tool for an AR-15 as a “paperweight desk organizer,” posting a photo of the vise block holding paper clips and erasers.\n  Customers joined in on the ruse in reviews. “Helps when you need to do a hands free clean up of your desktop,” wrote one. “Locks items solidly into place, will Load plenty of paper clips or tacks.”\n Another customer retorted, “Sorry. I’m not playing along. I can buy AR-15 parts all day on Amazon.”\n To go along with the vise block, Amazon’s “frequently bought together” tool suggested other gunsmithing tools, showing at least one of Amazon’s automated systems received signals that it was not an office product.\n Graham, the Amazon spokesperson, declined to explain why the items were still for sale, even though the “frequently bought together” tool seemed to recognize they were related to firearms.\n Lead and Steel, which declined to be interviewed for this story, had sold at least four dozen vise blocks from that posting since it went up in December, according to reviews, until we reported it to Amazon, which pulled the listing.\n  Vic Massenkoff, a retired fire investigator from Contra Costa County, Calif. said he tried years ago to get Amazon to take down dangerous equipment—but said he was frustrated by what he sees as the company’s inaction.\n He said he’d seen too many fires caused by the process of extracting highly potent hash oil, or “honey oil,” from marijuana using butane and in 2013 decided to investigate where the equipment could be found for sale. He said he found it on Amazon.com.\n  “There it was lined up, everything from the extraction tubes, to the grams digital scales, to the silicone pads, the silicone containers, to the digital thermometers,” Massenkoff said. “Everything you would need to set up shop.”\n When he clicked on a listing for the glass tubes, Amazon’s recommendation engine suggested he buy the other items needed to make and use hash oil. He kept screenshots of the suggestions.\n “There is no safe way to make butane honey oil,” he said in an interview.\n He said he emailed Amazon from his work email to alert the company to the danger. He still remembers the reply: “Thanks for bringing this to our attention. We have assigned it to someone on our staff to research this.”\n  Graham, the Amazon spokesperson, declined to say how the company handled Massenkoff’s complaint, for which he said The Markup had provided no “evidence.”\n Amazon’s current rules ban the sale of equipment to make hash oil; we were able to find it on the site.\n  Your contributions help us investigate how powerful institutions’ use of technology affects our society. Please donate today!\n     Donate", "posttime": "2020-06-19 02:22:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚马逊,amazon,失败", "title": "亚马逊的执法失败为违禁商品打开了一扇后门-一些商品是亚马逊自己销售和运输的", "title_en": "Amazon's Enforcement Failures Leave Open a Back Door to Banned Goods -- Some Sold and Shipped by Amazon Itself", "transed": 1, "url": "https://themarkup.org/banned-bounty/2020/06/18/amazons-enforcement-failures-leave-open-a-back-door", "via": "", "real_tags": ["亚马逊", "amazon", "失败"]}, {"category": "", "categoryclass": "", "imagename": "ea658795ef79805c7dd91becbc656502.png", "infoid": 1007136, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "应用程序被拆分成较小的应用程序&34；部分&#34；。这些可以是前端组件，如&#34；Header&34；或&#34；Sidebar&34；组件，也可以是逻辑组件，如&#34；Data Fetching Logic&#34；或其他业务逻辑。\n使用模块联合，每个部分都将是单独的构建。这些内部版本编译为&#34；Containers&#34；。\n在这种关系中，容器是&#34；远程&34；，容器的消费者是&#34；主机&#34；。&#34；远程&#34；可以向&#34；主机&#34；公开模块。&#34；主机&#34；可以使用这些模块。它们被称为&#34；远程模块&#34；。\n容器以异步方式公开模块。您可以要求容器加载/下载您想要使用的模块，然后再从容器中使用它们。异步公开允许构建将每个公开的模块及其依赖项放在单独的文件中。这种方式只需要加载使用过的模块，但容器仍然可以将模块捆绑在一起。此外，webpack的通常分块技术也适用于此(如供应商拆分或为公开的模块之间的公共依赖关系创建文件)。这允许保持较低的请求和总下载，从而带来良好的Web性能。\n容器的使用者需要能够处理公开模块的异步加载。这里webpack将做一些戏法，我们稍后再来看。\n另一个方面，共享模块，也在这里展示。每一方、容器和应用程序都可以将共享模块与版本信息一起放入共享范围。并且他们还能够使用共享范围中的共享模块以及版本要求检查。共享范围将以向各方提供符合版本要求的共享模块的最高可用版本的方式对共享模块进行重复数据消除。\n还以异步方式提供和使用共享模块。因此，提供共享模块不需要下载成本。仅下载使用/使用的共享模块。\nA&#34；主页(来自团队A)使用下拉列表组件(来自团队B)。主页&#34；上的A&#34；登录链接按需加载(来自团队A)的登录模式(&#34；LoginModal&#34；)，该链接使用(来自团队B的)按钮组件。\n团队B想要构建一个容器，因此标记了他们的一些模块。&#34；Button&#34；和&#34；DropDown&#34；标记为&#34；Exposed&#34；，因为它们应该被其他团队使用。\n&#34；Reaction&#34；标记为&#34；Shared&#34；，以便可能与其他团队共享。\nwebpack将自动为该容器生成容器条目。这个生成的模块将包含对所有公开和共享模块以及如何加载它们的引用。\n当从容器加载Button&#34；时，它只加载按钮块和反应块。当加载DropDown&#34；时，它将只加载下拉块和Reaction块。\n加载下拉列表时，如果另一方提供了另一个Reaction版本(可能更高)，它将加载下拉块和提供的另一方Reaction版本的块(实际上，它会将加载操作委托给另一方，如果块尚未加载，他们将加载该块)。\n团队B中的模块不直接包括在内。相反，仅使用&#34；远程模块&#34；存根。它们在运行时引用容器，并将(在运行时)从容器加载模块。\n棘手的部分是异步加载。正常导入是同步的，不能等到模块下载后才能导入。一些webpack魔术将提升所有异步远程模块加载到下一个异步边界(如import())。此时，容器将在下载此块中的普通模块的同时加载远程模块。\n一个例子是&#34；Login&#34；链接，它打开&#34；LoginModal&#34；。单击该链接时，将并行下载&#34；LoginModal&34；的代码和&#34；Button&#34；的代码。\n存在使用模块联合的ModuleFederationPlugin。不同的属性用于设置不同的方面。\n要创建容器，exposes属性是重要的属性。这里指定了容器使用者应该可以访问的所有模块。可以给它们一个公共名称，这是使用者必须使用的名称，并将其指向自己代码库(内部请求)中的一个模块。支持任何模块，可以是javascript、typecript、css、webAssembly、Assets，所有webpack可以在您的代码库中处理的东西。\n“使用其他容器”属性是“远程”属性，它是“转到”属性。它是一个对象，也将包含应该在当前版本中使用的容器。关键是一个模块作用域，在该作用域上，容器公开的模块应该可以在自己的代码库中访问。任何以该键开头的请求都将创建一个远程模块，该模块将在运行时加载。该值是容器的位置。默认情况下，外部脚本用作容器位置。在这里，用户将指定脚本文件的URL和全局。此脚本将在运行时加载，并从全局访问容器。\n要在任何一侧共享模块，应使用Shared属性。对于简单的情况，可以提供模块说明符列表，将这些模块(在代码库中使用时)标记为共享模块。它们将在当前安装的版本中提供，并在消费软件包的Package.json中指定的版本范围内使用。\n所有属性还支持高级配置选项。一个值得注意的高级选项是共享模块的singleton：true选项。它确保在运行时只创建模块的单个实例。这对于某些库是必需的，例如，Reaction不喜欢在同一应用程序中被多次实例化。在这种情况下，无效的版本范围只会在运行时导致警告。\n更高级的选项允许覆盖或禁用自动推断的值，如版本、Required dVersion或FileName，允许使用库和外部的不同方式，例如用于Node.js或选择更严格的版本检查(当版本范围无效时，这会导致错误而不是警告)。\n现在我们已经建造了所有这些独立的容器。现在是把它们放在一起的时候了。这就是有趣的开始。\n在客户端使用托管方法的一种方法是巧妙地结合使用服务器相对URL和基于锁定版本重定向请求的简单API。\n每个应用程序都放在不同的(子)域上。示例：app.example.com和admin.examples。可以为应用程序的多个阶段添加额外的嵌套。示例：myapp.example.com用于生产版本，staging.myapp.example.com用于临时版本。\n所有容器都由指向所有域上可用的API的服务器相对URL引用：/_remotes/&lt；name&gt；。取决于将解析为绝对URL(如https://staging.myapp.example.com/_remotes/analytics.)的应用程序。API现在可以从该请求中提取引用应用程序和目标容器。它将在应用程序的锁文件中查找容器，并将请求重定向到容器的最终url，例如302location：https://static.example.com/analytics/3fe867c.js.。\n重定向有点不完美，因为它需要往返到服务器2次才能加载容器。在第二次访问时，容器本身可能被缓存，但是由于重定向不能被缓存(以允许随时更改锁文件)，它仍然需要一次往返。\n/_remotes/API可以直接使用容器javascript进行响应。这会将初始加载减少到1个往返，但第二个访问案例仍将使用1个往返，因为我们无法正确缓存API。\n因此，在保留API解决方案作为备用方案的同时，我们添加了一个附加层。我们使用一些服务器逻辑生成HTML，并将脚本标记直接注入到最终的容器URL。当脚本标签上设置了数据-webpack=&lt；名称&gt；时，webpack中的模块联盟就可以获取它们。(它也可以直接拾取暴露的全局变量，但是当所有脚本标签都是异步的，并且应用程序脚本可能在容器脚本之前执行时，需要Data-webpack。在本例中，加载逻辑将找到Data-webpack脚本标记并将事件处理程序附加到它。)。\n这将导致初始页面加载的一次往返，第二次访问的0次往返。\n从技术上讲，也可以将容器脚本直接内联到HTML中，因为它们非常小(只有几kB)。这将导致初始页面加载的圆角也为0。但是这种解决方案在扩展许多容器时有点问题，因为它会增大HTML的大小并阻止容器的缓存。\n要使用Everygreen方法，请始终重定向到容器的最新版本。\n在服务器端使用托管方法的一种方法是，对编译后的dist文件也使用npm/yer Package.json。\n对于这种方法，您需要一个私有的包注册表，您可以将编译后的dist文件推送到该注册表。\n要部署容器，请使用webpack输出文件和Package.json创建一个包。在本例中，我们使用@Containers/a作为编译后的容器包的前缀。分析容器包可能如下所示：\n要创建使用容器的应用程序，您可以执行相同的操作(可能使用不同的前缀，如@apps/)，并将容器包指定为依赖项：\n现在，您可以在服务器引导过程中运行NPM安装/纱线。这会将容器从您的私有注册表下载到node_module中。模块联合运行时将通过REQUIRED(&#34；@CONTAINER/analytics&#34；)加载它们。所有代码都将集中在同一个node.js进程中。\n要使用托管方法，请将Package-lock.json/ya n.lock文件与dist Package.json一起保存。您可以将此文件作为应用程序报告的一部分提交。您可以使用多个锁定文件，例如，用于试运行和生产环境。\n要更新到容器的最新版本，通常可以使用NPM/YORAN实用程序，或者可以删除并重新生成锁定文件。\n要使用Everygreen方法，只需保留一个Package.json，而不保留锁定文件。混合方法可能需要一些额外的工具。\n你看，这里没有明确的取胜途径。模块联盟并不是在所有类别中都是完美的，它在所有类别中都是一个很好的权衡。\n每个属性都委托给一个较低级别的插件，从技术上讲，该插件也可以单独使用。值得一提的是SharePlugin，它也可以用来共享不同系统中的模块。", "note_en": "Applications are splitted into smaller application &#34;parts&#34;. These could be frontend components like a &#34;Header&#34; or &#34;Sidebar&#34; component, but also logical components like &#34;Data Fetching Logic&#34; or other business logic.\n                        With Module Federation each part would be a separate build. These builds are compiled as &#34;Containers&#34;.\n  In such a relationship the container is the &#34;remote&#34; and the consumer of the container is the &#34;host&#34;. The &#34;remote&#34; can expose modules to the &#34;host&#34;. The &#34;host&#34; can use such modules. They are called &#34;remote modules&#34;.\n      The container exposes modules in an async way. You would ask the container to load/download the modules you want to use before using them from the container. Async exposing allows the build to put each exposed module in a separate file, together with its dependencies. This way only used modules have to be loaded, but the container can still bundle modules together. Additionally usualy chunking techniques from webpack apply here (like vendor splitting or creating a file for common dependencies between exposed modules). This allows to keep requests and total download low, which leads to a good web performance.\n The consumer of the container need to be able to handle async loading of exposed modules. Here webpack will do some trickery, which we will see later.\n The other aspect, shared modules, is also show here. Every party, containers and applications, is able to put shared modules into the share scope together with version information. And they are also able to consume shared modules from the share scope together with a version requirement check. The share scope will deduplication shared modules in a way that provides each party with the highest available version of a shared modules that within the version requirement.\n Shared modules are also provided and consumed in an async way. So providing shared modules has no download cost. Only used/consumed shared modules are downloaded.\n       A &#34;HomePage&#34; (from team A) uses a &#34;Dropdown&#34; component (from team B). A &#34;Login&#34; link on the &#34;HomePage&#34; loads the &#34;LoginModal&#34; (from team A) on demand, which uses a &#34;Button&#34; component (from team B).\n        Team B want to build a &#34;Container&#34; and therefore flags some of their modules. &#34;Button&#34; and &#34;Dropdown&#34; are flagged as &#34;Exposed&#34; as their should be usable by other teams.\n &#34;react&#34; is flagged as &#34;Shared&#34;, so that it can potentially be shared with other teams.\n    webpack will automatically generate a &#34;Container entry&#34; for the container. This generated module will contain references to all exposes and shared modules and how to load them.\n   When loading &#34;Button&#34; from the container it would only load the button chunk and the react chunk. When loading &#34;Dropdown&#34; it would only load the dropdown chunk and the react chunk.\n When loading &#34;Dropdown&#34;, but another party have provided another react version (potentically higher) it would load the dropdown chunk and the chunk for the provided react version of the other party (Acutally it delegates the loading operation to the other party and they will load the chunk, if it hasn&#39;t already been loaded yet).\n    Module from team B are not included directly. Instead only &#34;Remote module&#34; stubs are used. They reference the container at runtime and will load the module from the container instead (at runtime).\n The tricky part is the async loading. A normal  import is sync and can&#39;t wait until the module is downloaded. Some webpack magic will hoist all async remote module loading up to the next async boundary (like an  import()). At this point remote modules will be loaded by the container in parallel to the download of the normal modules in this chunk.\n An example is the &#34;Login&#34; link, which opens the &#34;LoginModal&#34;. When clicking on the link the code for &#34;LoginModal&#34; and the code for &#34;Button&#34; will download in parallel.\n    There is a  ModuleFederationPlugin to use Module Federation. Different properties are used to setup the different aspects.\n To create a container the  exposes property is the important one. Here all modules are specified that should be accessible for a consumer of the container. One can give them a public name, which is the name that the consumer has to use, and point it the a module in the own code base (internal request). Any module is supported, it might be javascript, typescript, CSS, WebAssembly, assets, anything webpack can process in your code base.\n The consume other containers the  remotes property is the goto property. It&#39;s a object will also containers that should be usable in the current build. The key is a module scope at which the containers exposed modules should be accessible in the own code base. Any request starting with this key will create a remote module that will be loaded at runtime. The value is the location of the container. By default  script externals are used as container locations. Here one would specify an URL of a script file and a global. This script will be loaded at runtime and the container is accessed from the global.\n To share modules on any side the  shared property should be used. For simple cases a list of module specifiers can be provided which flag these modules (when used in the code base) as shared module. They will be provided in the current installed version and consumed in a version range specified in the package.json of the consuming package.\n All properties also support advanced configuration options. One notable advanced option is the  singleton: true option for shared modules. It makes sure that only a single instance of the module is created at runtime. This is needed for some libraries like e. g.  react which dislike being instantiated multiple times in the same application. An invalid version range will only lead to a warning at runtime in this case.\n More advanced options allow to override or disable automatically inferred values like  version,  requiredVersion or  filename, allow to use different ways of libraries and externals e. g. for usage in Node.js or opt-into stricter version checking (which lead to errors instead of warnings when version range is invalid).\n     Now we have build all these separate container. It&#39;s time to put them together. This is were the fun starts...\n          One way to use the Managed approach on client-side is a clever way to use server-relative URLs together with a simple API which redirects requests based on the locked version.\n Each application is placed on a different (sub)domain. Examples:  app.example.com and  admin.examples. Additional nesting could be added for multiple stages for an application. Examples:  myapp.example.com for the production version,  staging.myapp.example.com for the staging version.\n All containers are referenced by a server-relative URL pointing to an API available on all domains:  /_remotes/&lt;name&gt;. Depending on the application that will resolve to an absolute URL like  https://staging.myapp.example.com/_remotes/analytics. The API is now able to extract referencing application and target container from this request. It will lookup the container in the lockfile of the application and redirect request to the final URL of the container, e. g.  302 Location: https://static.example.com/analytics/3fe867c.js.\n The redirect is a little bit in-perfect as it requires 2 roundtrips to the server to load the container. On second visit the container itself is probably cached, but as the redirect can&#39;t be cached (to allow changing the lockfile anytime), it will still take 1 roundtrip.\n The  /_remotes/ API could directly respond with the container javascript. This would reduce the initial loading to 1 roundtrip, but the second visit case will still use 1 roundtrip as we can&#39;t cache the API correctly.\n So while keeping the API solution as fallback we add an additional layer. We generate the HTML with some server logic and inject script tags to the final container URLs directly. Module Federation in webpack is able to pick them up when  data-webpack=&#34;&lt;name&gt;&#34; is set on the script tags. (It&#39;s also able to pick up the exposed globals directly, but  data-webpack is needed when all script tags are async and application script may execute before the container script. In this case the loading logic will find the  data-webpack script tag and attach event handlers to it.)\n This results in a single roundtrip on the initial pageload and 0 roundtrips for the second visit.\n Technically it&#39;s also possible to inline the container script directly into HTML as they are pretty small (a few kB). This would lead to 0 roundtips for the initial pageload too. But this solution is a bit problematic to scale with many containers as it will blow up the size of the HTML and prevent caching of the containers.\n To use the everygreen approach instead always redirect to the latest version of a container.\n  One way to use the Managed approach on server-side it the use npm/yarn package.json for the compiled dist files as well.\n For this approach you need a private package registry where you can push your compiled dist files to.\n To deploy a container, create a package out of your webpack output files and a package.json. In this example we use  @containers/ a prefix for compiled container packages. The analytics container package could look like this:\n    To create an application that uses the container you would do the same (maybe with a different prefix like  @apps/) and also specify the container package as dependency:\n    Now you can run  npm install/ yarn as part of your server bootstrap.This will download the containers into  node_modules from your private registry.The Module Federation runtime will load them via  require(&#34;@container/analytics&#34;).All code will come together in the same node.js process.\n To use the Managed approach keep a  package-lock.json/ yarn.lock file together with your dist package.json.You could commit this file as part of your application repo.You could use multiple lockfiles e. g. for staging and production environments.\n To update to the latest version of the container usually npm/yarn utilities can be used, or the lockfile could be deleted and regenerated.\n To use the everygreen approach instead only keep a package.json and no lockfile. Mixed approach might require some additional tooling.\n                   You see that there is no clear winning approach here. Module Federation is not perfect at all categories, it&#39;s more a good trade-off in all categories.\n    Each property delegated to an lower level plugin, which technically can also be used on their own. One notable mention is the  SharePlugin which could also be used to share modules in a different system.", "posttime": "2020-06-19 02:20:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "webpack,front,容器", "title": "《webpack 5》中的微前端", "title_en": "Micro-front ends in Webpack 5", "transed": 1, "url": "https://github.com/sokra/slides/blob/master/content/ModuleFederationWebpack5.md", "via": "", "real_tags": ["webpack", "front", "容器"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007134, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "查尔斯达尔文在他生命的最后阶段，全神贯注于蠕虫是否会思考的问题。每晚，他都会拿着铲子、灯具和口哨，走进唐斯庄园的花园，希望证明这些虫子比它们看起来更聪明。这当然是一种奇怪的消遣。至少可以说，任何碰巧看到当时70多岁的达尔文在敲打泥土、把树叶粘在一起或对着洞穴大喊大叫的人都会感到困惑。但这并不是古怪的异想天开。正如达尔文所知，蠕虫智力的问题直指人类与动物关系的核心--并威胁到他毕生工作的稳定性。\n两千多年来，哲学家们一直在争论动物认知问题。最先解决这个问题的是希腊人。在希腊化和罗马时期，大多数人倾向于相信动物是有智慧的存在，这与人类不同的不是“本质”，而是它们拥有理性的程度。在“动物禁欲”一书中，提尔的斑岩认为，理性可以从“所有动物”的行为中观察到。他们能感知和记忆；他们能感觉到痛苦和快乐；他们能表达情感(希望、恐惧、悲伤等)。而且，在许多情况下，他们甚至发出类似演讲的声音，所有这些都表明了理性思维。其他思想家走得更远。塞克斯图斯·恩皮里库斯认为，动物对技能的了解、对美德的欣赏和做出选择的能力也暗示了理性；而普卢塔克则从它们对幼崽的照顾和好奇心强的天性中发现了这一点。\n亚里士多德则更持怀疑态度。他毫不怀疑动物表现出看起来很聪明的行为。他也没有否认他们至少有一些处理信息的能力。但由于动物没有真理的概念(他认为真理是理性的决定性特征)，他得出结论说，它们没有理性思维的能力-因此与人类有根本的不同。\n随着时间的推移，亚里士多德的观点是获胜。被他强调真理是理性的决定因素所吸引，罗马作家进一步扩展了他区分人和动物的含义。西塞罗在“德官论”中认为，虽然所有生物都有一些共同的心理过程，但只有人类拥有理解因果、类比并将过去与未来联系起来所必需的理由。由于人类在智力上超过了所有的动物，塞涅卡相信他可以随心所欲地对待动物。\n然而，正是在基督教神学家的著作中，亚里士多德的观点得到了最充分的阐述。看到他对动物和人类的区分类似于圣经对创世的描述，教父们开始将“创世纪”1：26解释为关于人类理性的陈述。奥古斯丁认为，当我们读到上帝按照他的“形象和形象”创造人类时，我们应该理解这意味着人类被赋予了理性和自由意志的“神圣”品质。相比之下，动物是非理性的。因此，它们属于较低级别的存在，理应被置于人类的统治之下。正如托马斯·阿奎那强调的那样，这意味着他们可能会被不分青红皂白地杀害。因此，由于信仰的认可，亚里士多德对动物和人类的区分几乎毫发无损地度过了随后的几个世纪。\n随着科学革命的到来，一切都开始改变。尽管大多数哲学家仍然相信人类的优越性，但他们对亚里士多德对理性的定义的承诺有所动摇-迫使他们寻找其他方式来证明动物缺乏智力。勒内·笛卡尔(RenéDescartes)在他的“世界与卢米埃的特征”(Characterédu Monde et de la Lumière，约1629-33年)中辩称，由于动物不会说话，没有证据表明它们可以独立于外界刺激进行思考。通过将理性重新定义为将一套一般原则应用于不同情况的能力，他还辩称，尽管动物有时看起来行为理性，但它们无法将自己的知识转移到不熟悉的场景中，这表明它们的行为更多是出于习惯，而不是直觉或演绎。\n然而，到了18世纪初，对人类独特性的信念开始瓦解。现在亚里士多德已经被拒绝了，其他人试图用更广泛的术语来定义思想和理性，这削弱了动物和人类之间的区别。带头冲锋的是大卫·休谟。在“人性论”(1739-1740年)中，他认为思想包含在从感官数据中产生的“图像”中，理性应该被理解为“仅仅是一种根据过去的经验在这些[图像]之间形成联系的性格或本能”。考虑到狗和马，他坚持认为“野兽和人一样，都有思想和理性”。伏尔泰在他的字典哲学(1764)中也提出了类似的论点。然而，当它享受一份证书的时候\n在“物种起源”(1859年)一书中，达尔文证明，所有种类的动植物并不是由万能的神在单一的行为中创造出来的，而是经过许多代人的自然选择而逐渐进化出来的。在“人类的起源”(1871年)中，他进一步探讨了这一论点的含义，他接着争辩说，人类也是“从某种预先存在的形式进化而来的”，并且是在类似的过程中进化出来的。正如批评者和支持者都意识到的那样，这混淆了任何区分人和野兽的企图-并引发了对它们认知能力的质疑。\n与亚里士多德一样，达尔文也认识到，所有物种似乎都拥有处理信息所需的物质“工具”。但与亚里士多德不同的是，他认为这些生理连续性也应该产生认知相似性。如果不同的物种具有类似的思维能力，那么他们的思维也有可能达到类似的程度。如果他们能思考，为什么他们不能推理呢？达尔文更看重笛卡尔，而不是休谟，他认为，如果一个行为表现出一定程度的预见性，并超越了本能反应，那么它就是理性的。通过对行为模式的观察，可以相对容易地确定是否存在自己的理由。\n在此基础上，达尔文和波菲里一样，得出结论，“人与狗等高等动物在心理上的区别是程度上的，而不是种类上的”。但当谈到“较低”的动物时，他就不那么确定了--特别是在蚯蚓方面。他们是一种独一无二的简单生命形式；事实上，即使是波菲里人也很难将他们视为有智慧的生物。他们没有明显的感知手段；看起来没有任何技能；没有发出任何噪音；当然也没有表现出任何情感。找到与人类认知相似之处的前景看起来确实很渺茫。\n然而，达尔文怀疑蠕虫可能比它们看起来更令人印象深刻。他乘坐HMS Beagle号航程回来后不久，收到了他叔叔(也是岳父)约西亚·韦奇伍德的一封信，信中解释说，几年后，散布在田野上的一层石灰和煤渣沉入了地表以下几英寸的地方，原因是蠕虫蚕食了下面的土壤，并将其喷到了上面。这给达尔文留下了如此深刻的印象，以至于他在那年晚些时候向地质学会阅读了一篇关于这个主题的论文，并相信，尽管蠕虫很大，但它可以像风或潮汐一样戏剧性地重塑地形。\n但是，无论有多少泥土通过蠕虫的肠道，这都不是思想的证据。达尔文因此开始对它们的能力进行精心的测试。正如他在他的上一本书《通过蠕虫的行动形成蔬菜霉菌》(1881年)中所解释的那样，他从它们的感官开始。他们是聋子，这一点很容易确定。他对着地面吹口哨，对着他们的洞穴大喊大叫，给他们吹巴松管，把他们放在钢琴旁边的桌子上-所有这些都没有引起丝毫反应。然而，通过将它们放在钢琴上，他发现它们对振动极其敏感。然后，他求助于它们“微弱”的嗅觉。虽然他们热衷于寻找卷心菜和洋葱，但他们似乎对洒上烟汁和香水的棉花无动于衷。然而，最能说明问题的是他们的视觉。达尔文发现，用强光照射它们的前部，虽然它们是盲人，但它们仍然可以感知发光。然而，他们的反应并不总是一样的；如果他们的注意力集中在其他事情上，他们往往会完全忽略光线。这让达尔文想起了“高等”动物。作为一名热衷于运动的人，他知道当鹿在吃草或以其他方式被占用时，爬到它身上是最容易的；在他看来，蠕虫的行为似乎也差不多。这清楚地表明“某种头脑的存在”，但他需要更多的证据才能确定。\n达尔文在虫子的洞穴里找到了他要找的东西。为了防止空气进入，他们倾向于用手头的任何东西堵住家里的入口。然而，他们更喜欢树叶。然而，如果他们缺乏理性，他们可能会被期望抓住任何旧的方式，达尔文观察到，他们的行为方式几乎与一个人一样，用尖端而不是茎把树叶拖到洞里。令他惊讶的是，即使给了非英国本土的树木的叶子，当他们拿到几片粘在一起的叶子时，他们也做了同样的事情。这不可能仅仅是本能。这一定是理性智商的标志。\n不用说，达尔文将是第一个承认蠕虫的思想可能相当谦虚的人。但他们认为这足以证实他的理论", "note_en": "Towards the end of his life, Charles Darwin was preoccupied with the question of whether worms think. Night after night, he would go out into the garden of Down House, armed with shovels, lamps and whistles, hoping to prove that these worms were cleverer than they looked. It was certainly an odd pastime. Anyone who happened to see Darwin, then in his seventies, beating the soil, gluing leaves together, or shouting at burrows at the top of his voice would have been puzzled, to say the least. But this was no eccentric whimsy. As Darwin knew, the problem of vermicular intelligence went to the heart of man’s relationship with animals – and threatened to destabilise his life’s work.\n  Philosophers had been arguing about animal cognition for more than 2,000 years. The first to tackle it were the Greeks. During the Hellenistic and Roman periods, most were inclined to believe that animals were intelligent beings, which differed from humans not in ‘essence’ but only in the extent to which they possessed reason. In  De abstinentia ab esu animalium, Porphyry of Tyre argued that reason could be observed in the behaviour of ‘all animals’. They could perceive and remember; they felt pain and pleasure; they could express emotions (hope, fear, grief, etc.) and, in many cases, they even made speech-like noises, all of which was indicative of rational thought. Other thinkers went further. Sextus Empiricus believed that reason was also implied by animals’ knowledge of skills, appreciation of virtue and ability to make choices; while Plutarch found it in the care they take of their young and in their enquiring nature.\n Aristotle was more sceptical. He did not doubt that animals exhibited behaviour which  appeared intelligent. Nor did he deny that they had at least  some capacity for processing information. But since animals do not have a concept of truth (which he thought the defining characteristic of reason), he concluded that they were incapable of rational thought – and hence fundamentally  different from human beings.\n Over time, Aristotle’s opinion was to win out. Attracted by his emphasis on truth as the determinant of reason, Roman authors extended the implications of his distinction between humans and animals even further. In the  De officiis, Cicero argued that, while all creatures share some mental processes, man alone possesses the reason necessary to understand cause and effect, draw analogies and connect the past with the future. And since man surpassed all animals in intellect, Seneca believed that he could treat animals as he liked.\n Yet it was in the works of Christian theologians that Aristotle’s views received their fullest elaboration. Seeing in his distinction between animals and humans a parallel to Biblical accounts of the Creation, the Church Fathers came to interpret Genesis  1:26 as a statement about human rationality. When we read that God created mankind in His ‘image and likeness’, Augustine argued, we should understand it to mean that human beings were endowed with the ‘divine’ qualities of reason and free will. Animals, by contrast, were irrational. Thus belonging to a lesser order of being, they deserved to be placed under man’s dominion. As Thomas Aquinas stressed, this meant that they could be killed indiscriminately. Thus sanctioned by faith, Aristotle’s distinction between animals and humans survived the centuries which followed virtually unscathed.\n  As the Scientific Revolution dawned, all that began to change. Although most philosophers were still convinced of man’s superiority, their commitment to Aristotle’s definition of reason wavered – forcing them to cast about for some other means of demonstrating animals’ lack of intelligence. René Descartes, in his  Traité du monde et de la lumière (c.1629-33), argued that, since animals could not speak, there was no proof they could think independently of external stimuli. By redefining reason as the capacity to apply a set of general principles to different situations, he also contended that, while animals sometimes appear to be acting rationally, their inability to transfer their knowledge to unfamiliar scenarios showed that they act more out of habit than intuition or deduction.\n  By the beginning of the 18th century, however, faith in man’s uniqueness had begun to crumble. Now that Aristotle had been rejected, others sought to define thought and reason in broader terms, which eroded the distinction between animals and humans. Leading the charge was David Hume. In  A Treatise of Human Nature (1739-40), he argued that thought consisted in ‘images’ arising from sensory data and that reason should be understood as a ‘mere disposition or instinct to form associations among such [images] on the basis of past experience’. Mindful of dogs and horses, he maintained that ‘beasts are endowed with thought and reason as well as men’. A similar argument was put forward by Voltaire in his  Dictionnaire philosophique (1764). Yet while it was to enjoy a certain vogue in the early 19th century, some naturalists, such as William Whewell, remained unconvinced. Clinging to the theological wreckage, they refused to grant animals the same status as men; and, in the absence of any decisive proof, showed no signs of changing their minds. An impasse was reached.\n  Into the fray stepped Darwin. Born slightly over 40 years after Hume’s death, he was immersed in the new thinking. His grandfather, the zoologist Erasmus Darwin, had been a keen reader of Hume’s  Treatise and such progressive ideas were a common subject of discussion in the family home. It was almost inevitable that he should take an interest in the question of animal cognition. But when he did, he approached it from a completely different perspective.\n In  On the Origin of Species (1859), Darwin demonstrated that, rather than having been created in a singular act by an omnipotent deity, all varieties of animal and plant life had evolved gradually, over many generations, as a result of natural selection. Pursuing the implications of this argument further in  The Descent of Man (1871), he went on to contend that man, too, was ‘descended from some pre-existing form’ and had evolved in response to similar processes. As both critics and supporters realised, this confounded any attempt to distinguish between men and beasts – and raised questions about their cognitive abilities.\n Like Aristotle, Darwin recognised that all species seemed to possess the physical ‘tools’ needed to process information. But unlike Aristotle he believed that these physiological continuities should be productive of cognitive similarities as well. If different species had a comparable capacity for thinking, the chances were that they  thought to a similar extent, too. And if they could think, why should they not also reason? With an eye more to Descartes than Hume, Darwin held that an action was rational if it displayed some measure of forethought and went beyond instinctive responses. Whether or not a being possessed reason should be relatively easy to determine through observation of behaviour patterns.\n On this basis, Darwin, like Porphyry, concluded that ‘the difference in mind between man and the higher animals’ such as dogs ‘is one of degree and not of kind’. But when it came to the ‘lower’ animals, he was less sure – especially insofar as earthworms were concerned. They were a uniquely simple form of life; indeed even Porphyry would have struggled to see them as intelligent beings. They had no obvious means of perception; did not appear to have any skills; made no noises; and certainly didn’t show any emotion. The prospect of finding any cognitive similarities with human beings seemed dim indeed.\n  Darwin, however, suspected that worms might be more impressive than they appeared. Shortly after he returned from his journey on HMS  Beagle, he received a letter from his uncle (and father-in-law) Josiah Wedgwood explaining that a layer of lime and cinders which had been spread over a field had, a few years later, sunk several inches below the surface as a result of worms chewing away at the soil below and ejecting it above. So greatly did this impress Darwin that he went on to read a paper on the subject to the Geological Society later that year and became convinced that, despite their size, worms could reshape the landscape as dramatically as the wind or the tides.\n  But no matter how much earth passed through a worm’s intestines, it wasn’t proof of thought. Darwin therefore began conducting elaborate tests on their capabilities. As he explained in his last book,  The Formation of Vegetable Mould through the Action of Worms (1881), he began with their senses. That they were deaf was easy enough to establish. He blew whistles at the ground, shouted into their burrows, played them the bassoon and placed them on a table next to a piano – all without provoking the slightest reaction. By placing them  on the piano, however, he discovered that they are extremely sensitive to vibrations. He then turned to their ‘feeble’ sense of smell. Though they avidly sought out bits of cabbage and onion, they seemed indifferent to bits of cotton wool doused in tobacco juice and perfume. Most revealing, however, was their sense of sight. By shining a bright light onto their anterior part, Darwin discovered that, although they are blind, they can still perceive luminosity. Their reaction, however, was not always the same; if their attention was engaged with something else, they often ignored the light completely. This reminded Darwin of ‘higher’ animals. A keen sportsman, he knew that it was easiest to creep up on a deer when it was grazing, or otherwise occupied; and it seemed to him as if worms behaved in much the same way. This clearly pointed to ‘the presence of a mind of some kind’, but he needed more proof before he could be sure.\n  Darwin found what he was looking for in worms’ burrows. To prevent air getting in, they have a tendency to block up the entrance to their homes using whatever is at hand. Their preference is, however, for leaves. Whereas, if they lacked reason, they might have been expected to seize them any old how, Darwin observed that they ‘acted in nearly the same manner as would a man’, dragging the leaves down into their burrows by the pointed tip, rather than by the stalk. To his amazement, they did the same thing even when given leaves from trees which are not indigenous to Britain and when presented with several leaves glued together. This could not be mere instinct. It had to be a sign of rational intelligence.\n Needless to say, Darwin would have been the first to admit that worms’ thoughts are probably quite modest. But that they think at all was enough to validate his theory of evolution – and to demonstrate beyond a doubt that all living things share similar cognitive processes. This is more than just a scientific fact, though. It is also a reminder that even the most humble of creatures demand our respect. For if even the worm can think like us, what earthly reason is there not to show them the same consideration as we show one another?\n Alexander Lee is a fellow in the Centre for the Study of the Renaissance at the University of Warwick. His latest book is  Machiavelli: His Life and Times (Picador, 2020).", "posttime": "2020-06-19 02:00:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "蚯蚓,intelligence,动物", "title": "蚯蚓的智慧", "title_en": "The Intelligence of Earthworms", "transed": 1, "url": "https://www.historytoday.com/archive/natural-histories/intelligence-earthworms", "via": "", "real_tags": ["蚯蚓", "动物"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007133, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "摘要：vlc media player中修复了多个漏洞日期：2020年6月受影响的版本：vlc media player 3.0.10和更早版本ID：VideoLAN-sb-vlc-3011CVE参考：cve-2020-13428。\n远程用户可以创建巧尽心思构建的文件，该文件可能会在VLC的H26X打包器中触发缓冲区溢出。\n如果成功，恶意第三方可能会触发VLC崩溃或使用目标用户的权限执行任意代码。\n虽然这些问题本身最有可能导致播放器崩溃，但我们不能排除它们可能组合在一起泄露用户信息或远程执行代码。ASLR和DEP有助于降低代码执行的可能性，但可能会被绕过。\n攻击这些问题需要用户显式打开巧尽心思构建的文件或流。\n在应用补丁程序之前，用户应避免打开来自不受信任的第三方的文件或访问不受信任的远程站点(或禁用VLC浏览器插件)。\n在CVE-20209308和CVE-2019-19221发布之后，VLC3.0.11还增加了一些依赖项，特别是libarchive", "note_en": "Summary : Multiple vulnerabilities fixed in VLC media playerDate : June 2020Affected versions : VLC media player 3.0.10 and earlierID : VideoLAN-SB-VLC-3011CVE references : CVE-2020-13428\n  A remote user could create a specifically crafted file that could trigger a buffer overflow in VLC&#39;s H26X packetizer\n  If successful, a malicious third party could trigger either a crash of VLC or an arbitratry code execution with the privileges of the target user.\n While these issues in themselves are most likely to just crash the player, we can&#39;t exclude that they could be combined to leak user informations or remotely execute code. ASLR and DEP help reduce the likelyness of code execution, but may be bypassed.\n    Exploitation of those issues requires the user to explicitly open a specially crafted file or stream.\n  The user should refrain from opening files from untrusted third partiesor accessing untrusted remote sites (or disable the VLC browser plugins),until the patch is applied.\n      VLC 3.0.11 also bumps some dependencies, notably libarchive, following the publication of CVE-2020-9308 and CVE-2019-19221", "posttime": "2020-06-19 02:00:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "公告,bulletin,vlc", "title": "安全公告VLC 3.0.11", "title_en": "Security Bulletin VLC 3.0.11", "transed": 1, "url": "https://www.videolan.org/security/sb-vlc3011.html", "via": "", "real_tags": ["公告", "bulletin", "vlc"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007132, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一项研究报道，一种微型、无线和磁力的神经刺激器可能是帕金森氏病以及癫痫和慢性疼痛等疾病的大脑深度刺激的未来。\n通过手术放置的电池供电的植入物进行神经刺激通常被用来帮助帕金森氏症患者减少震颤。然而，这些设备通常很大，电池可能需要通过手术充电或更换。它们的电线也能促进感染。\n莱斯大学的神经工程师已经开发出一种微小的(大约一粒米大小)无线外科植入物，它使用“磁电”技术来电刺激大脑和神经系统。\n植入物由两层截然不同的材料组成，连接成一层膜，将磁能直接转化为电压。\n第一层是由铁、硼、硅和碳组成的磁致伸缩薄膜，当置于磁场中时，它在分子水平上振动并产生声波。(磁致伸缩是磁性材料的一种特性，它会使它们在磁场的作用下改变其形状或尺寸。)。\n“磁场在磁致伸缩材料中产生应力，”该研究的主要作者阿曼达·辛格(Amanda Singer)在一份新闻稿中说。\n辛格补充说：“它不会让材料变得明显的大小，但它会产生声波，其中一些声波的共振频率会产生一种特殊的模式，我们使用这种模式叫做声学共振模式。”\n磁致伸缩材料中的声共振是引起大型电力变压器发出嗡嗡声的原因。\n植入物的第二层是压电晶体，它将第一层产生的声波直接转化为电压。\n使用这种方法，据报道，植入物可以收集大量的电力，但工作频率太高，不会影响脑细胞。这与临床批准的电池供电植入物使用的高频信号相同。\n“工程…的一个主要部分。莱斯大学电气和计算机工程及生物工程副教授雅各布·罗宾逊(Jacob Robinson)说：“我们正在创造电路，以更低的频率调节这种活动，细胞将对此做出反应。\n“这类似于调幅广播的工作方式。你有这些非常高频的波，但它们是以你能听到的低频调制的，“罗宾逊补充说。\n在确定这项技术有效后，研究小组花了大约一年的时间创造了一个微型版本的植入物。\n最终的结果是一种无电池的无线设备，体积足够小，无需进行大手术就可以植入-这对于使神经刺激疗法更广泛地获得很重要。\n罗宾逊说，这种装置可以通过微创程序植入身体几乎任何地方，类似于在阻塞的动脉中放置支架的程序。\n为了证明这项技术的可行性，研究小组将该装置植入了帕金森氏病大鼠的头骨皮肤下。\n“当你必须开发一些可以植入小动物头骨皮下的东西时，你的设计约束就会发生很大的变化。让它在没有约束的环境中在啮齿动物身上工作，确实迫使阿曼达将其大小和体积降低到可能的最小规模，“莱斯大学电气和计算机工程以及生物工程副教授Caleb Kemere说。\n科学家们观察到，这些动物更喜欢呆在它们的围栏里，在那里磁场激活了刺激器，并为它们大脑的奖励中心提供了一个小电压。\n他说：“我们的研究结果表明，使用磁电材料进行无线供电不仅仅是一个新的想法。罗宾逊说：“这些材料是临床级无线生物电子学的极佳候选材料。", "note_en": "A miniature, wireless, and magnetically powered neural stimulator may be the future of deep brain stimulation for   Parkinson’s disease , and disorders like epilepsy and chronic pain, a study reported.\n   Neurostimulation through surgically placed, battery-powered implants is often used to help reduce tremors in people with Parkinson’s disease. However, the devices are often large and batteries may need to be charged or replaced through surgery.  Their wires can also facilitate infections.\n Neuroengineers at   Rice University  have developed a tiny (about the size of a grain of rice) wireless surgical implant that uses “magnetoelectric” technology to electrically stimulate the brain and nervous system.\n The implant is made up of two layers of two very different materials, joined in a single film, that converts magnetic energy directly into an electrical voltage.\n The first layer is a   magnetostrictive  foil of iron, boron, silicon, and carbon that vibrates at a molecular level and  generates acoustic waves when placed in a magnetic field. (Magnetostrictive is a property of magnetic materials that causes them to change their shape or dimensions in response to a magnetic field.)\n  “The magnetic field generates stress in the magnetostrictive material,” Amanda Singer, the study’s lead author, said in a   press release .\n “It doesn’t make the material get visibly bigger and smaller, but it generates acoustic waves and some of those are at a resonant frequency that creates a particular mode we use called an acoustic resonant mode,” Singer added.\n Acoustic resonance in magnetostrictive materials is what causes an audible hum in large electrical transformers.\n The implant’s second layer is a piezoelectric crystal, which converts the acoustic waves created by the first layer directly into an electric voltage.\n  Using this method, the implant is reported to harvest plenty of power but operates at a frequency too high to affect brain cells. This is the same kind of high-frequency signals as used by clinically approved, battery-powered implants.\n “A major piece of engineering … was creating the circuitry to modulate that activity at a lower frequency that the cells would respond to,” said Jacob Robinson, associate professor of electrical and computer engineering and of bioengineering at Rice.\n “It’s similar to the way AM radio works. You have these very high-frequency waves, but they’re modulated at a low frequency that you can hear,” Robinson added.\n Having established that the technology worked, the team spent about a year creating a miniature version of the implant.\n  The end result was a battery-free, wireless device, small enough to be implanted without major surgery — important for making neural stimulation therapy more widely available.\n This device could be implanted almost anywhere in the body with a minimally invasive procedure, similar to the one used to place stents in blocked arteries, Robinson said.\n To demonstrate the viability of the technology, the team implanted the device beneath the skin of the skull in a rat model of Parkinson’s disease.\n “When you have to develop something that can be implanted subcutaneously on the skull of small animals, your design constraints change significantly. Getting this to work on a rodent in a constraint-free environment really forced Amanda to push down the size and volume to the minimum possible scale,” said Caleb Kemere, an associate professor of electrical and computer engineering and of bioengineering at Rice.\n Scientists observed that the animals preferred to be in areas of their enclosures where a magnetic field activated the stimulator, and provided a small voltage to the reward center of their brains.\n “Our results suggest that using magnetoelectric materials for wireless power delivery is more than a novel idea. These materials are excellent candidates for clinical-grade, wireless bioelectronics,” Robinson said.", "posttime": "2020-06-19 01:59:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "植入物,magnetically,材料", "title": "微小的磁力植入物可能是深部脑刺激的未来", "title_en": "Tiny magnetically powered implant may be future of deep brain stimulation", "transed": 1, "url": "https://parkinsonsnewstoday.com/2020/06/17/tiny-magnetically-powered-implant-may-be-future-of-deep-brain-stimulation/", "via": "", "real_tags": ["植入物", "材料"]}, {"category": "", "categoryclass": "", "imagename": "e06a27f4f1b62af72574d5d61b5cea37.png", "infoid": 1007131, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "莫斯科(美联社)-俄罗斯通信监管机构周四表示，在两年来试图屏蔽广受欢迎的即时通讯应用Telegram未获成功后，它将解除禁令。\n“根据与总检察长办公室达成的协议，Roskomnadzor撤回了限制访问Telegram信使的要求，”该机构在一份声明中说。\n2018年，一家法院下令在俄罗斯屏蔽Telegram，站在当局一边，当局要求该应用程序禁止进入俄罗斯，直到它交出数据加密的密钥。官员们声称，由俄罗斯企业家帕维尔·杜罗夫(Pavel Durov)开发的Telegram被暴力极端分子使用。\n该公司拒绝交出加密密钥，辩称这会侵犯用户隐私权，无助于清除恐怖分子。\n在2018年4月电信提供商接到屏蔽这款应用的指示后，它一度不可用，但在几个小时内就恢复了在线，并从那以后一直被广泛使用。俄罗斯政府官员是这款应用的活跃用户之一，一些政府机构继续在Telegram上运行他们的官方账户。\n今年，俄罗斯许多地区的冠状病毒工作组选择了Telegram作为他们的日常更新。\n今年4月，克里姆林宫发言人德米特里·佩斯科夫(Dmitry Peskov)承认，尽管有禁令，这款应用程序仍在广泛使用。“有一项法院裁决，屏蔽(这款应用程序)的行动就是基于这一裁决。但你说得对，这是真的，事实上的情况是不同的。“佩斯科夫告诉记者。\n本月早些时候，Telegram的创始人杜罗夫敦促当局解除禁令，允许其3000万俄罗斯用户“更舒适地使用这项服务”。杜罗夫说，近年来，Telergram团队在不侵犯用户隐私的情况下，显着改进了搜索和删除极端主义内容的工具。\n通讯监督机构星期四在一份声明中说，它赞赏杜罗夫“随时准备打击恐怖主义和极端主义”。", "note_en": "MOSCOW (AP) — Russia’s communications watchdog said Thursday it would lift a ban on the popular messaging app Telegram after two years of unsuccessful attempts to block it.\n  “As agreed with the Prosecutor General’s office, Roskomnadzor withdraws the demand to restrict access to the Telegram messenger,” the agency said in a statement.\n  In 2018, a court ordered the blocking of Telegram in Russia, siding with authorities who demanded that the app be kept out of the country until it hands over the keys to its data encryption. Officials alleged that Telegram, which was developed by Russian entrepreneur Pavel Durov, has been used by violent extremists.\n   The company refused to hand over encryption keys, arguing that it would violate users’ rights to privacy and would not help weed out terrorists.\n  After telecommunication providers were instructed to block the app in April 2018, it became briefly unavailable, but was back online within a few hours and has remained widely used ever since. Russian government officials were among the app’s active users, and some government agencies kept running their official accounts in Telegram.\n  This year, coronavirus task forces in many Russian regions have chosen Telegram for their daily updates.\n  In April, Kremlin spokesman Dmitry Peskov admitted that the app is being widely used despite the ban. “There is a court ruling, and actions to block (the app) were based on it. But you’re right, it’s true, the situation de facto is different,” Peskov told reporters.\n  Durov, Telegram’s founder, earlier this month urged the authorities to lift the ban and allow its 30 million Russian users “to use the service with more comfort.” Durov said that in recent years the Telergram team has significantly improved its tools for searching for and deleting extremist content without impinging on users’ privacy.\n  The communications watchdog said in a statement Thursday that it appreciated Durov’s “readiness to counter terrorism and extremism.”", "posttime": "2020-06-19 01:59:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "解除,lifts,telegram", "title": "俄罗斯解除电报禁令", "title_en": "Russia lifts ban on Telegram", "transed": 1, "url": "https://apnews.com/1da061ce00eb531291b143ace0eed1c9", "via": "", "real_tags": ["解除", "lifts", "telegram"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007130, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2018年11月，AWS发布了名为Firecracker的开源工具，主要是依赖于KVM的虚拟机监视器、小型Linux内核和QEMU的精简版本。让我困惑的是虚拟机启动和运行服务的速度。整个过程被比作一个容器，但更安全，因为它不共享内核或任何资源，它是一个独立的专用虚拟机。如果你想了解更多关于“鞭炮”的内部结构，这里有一篇写得很好的文章。\n我喜欢这个想法，我认为NetBSD将是这类目标的完美匹配，因为内核和整个操作系统可以很容易地剥离。我之所以知道这一点，是因为我在2016年编写了一个名为Sailor的想要成为集装箱的项目，目标是创建运行服务“Ala”docker的容器类型的chroot。我使用这个项目来满足我自己的需要，而你现在看到的这个网站实际上是在一艘水手船上运行的。\n这很有趣，但是我们不能真的只用chroot来谈论安全性，而Fireracker解决方案似乎正好适合这一问题，但是整个NetBSD引导过程对我来说有点太长了。\n那么，我们究竟如何才能显著提高NetBSD的引导速度呢？嗯，有两个主要的胜利：\n第一点非常容易实现，下面是最小的内核配置：\n包括&#34；arch/i386/conf/std.i386&#34；makeoptions Copts=&#34；-os&#34；makeoptions use_ssp=&#34；no&#34；maxuser 8#预计用户数选项CONSDEVNAME=&#34；\\&#34；com\\&#34；&#34；options cons_override options MULTIBOOT options RTC_Offset=0#硬件时钟是这么多分钟。GMT选项PIPE_SOCKETPAIR#较小，但速度较慢的管道(2)包括&#34；conf/compat_netbsd60.config&#34；文件系统FFS#UFS文件系统KERNFS#/kern选项FFS_NO_SNAPSHOT#无FF快照支持选项INET#IP+ICMP+TCP+UDP config netbsd root？类型？选项WSEMUL_VT100#VT100/VT220仿真选项WS_KERNEL_FG=WSCOL_GREEN选项WSDISPLAY_COMPAT_SYSCONS#在Mainbus上仿真一些ioctls选项PCDISPLAY_SOFTCURSOR PCI*？公交车？主总线上的isa0吗？pcdisplay 0 at isa？#CGA，MDA，EGA，HGA wsdisplay*at pcdisplay？控制台？在伊萨来吗？端口0x3f8 irq 4#标准PC串行端口cinclude&#34；arch/i386/conf/GENERIC.local&#34；伪设备fss#文件系统快照设备伪设备vnd#文件的类似磁盘的接口伪设备bpfilter#Berkeley包过滤器伪设备循环#网络环回伪设备tun#tty伪设备上的网络隧道pty#伪终端伪设备时钟clocktl#时钟子系统伪设备的用户控制。戴夫？Function？#virtio PCI device ld*at virtio？#virtio disk device vioif*at virtio？#Virtio network device。\n请注意，我们绝对需要virtio驱动程序，因为VirtIO是在虚拟化环境中处理设备的最快方式。\n关于第二点，这并不像看起来那么简单。内核必须能够突如其来地加载，即不需要引导加载程序。在NetBSD中，多亏了MULTIBOOT内核选项，这在i386端口上是可能的，不幸的是，到目前为止(2020年6月18日)，AMD64端口不支持此选项(但仍在测试中)。因此，本文的其余部分将假设我们使用的是i386，这有点令人沮丧，但并不是真正的问题，因为几乎所有的软件包也都可用于此平台。\n我不会讨论如何为交叉编译工具和内核准备环境，相反，这里有一个关于这个主题的非常好的教程。请注意，您可以在64位Linux系统上交叉编译i386NetBSD内核，这实际上就是我要做的。不过，您将需要一台i386NetBSD(可能是虚拟机)来创建用于我们要运行的服务的根磁盘。\ntl；dr下面是我用来构建内核的命令(别忘了您必须首先构建工具！)：\n内核将询问根文件系统的位置，我们还不知道。按Ctrl+a x退出-nograph模式。\n现在，关于要启动的真正服务，我们将设置一个nginx web服务器，该服务器将在没有rc.d框架的情况下启动，再次获得宝贵的毫秒时间。要创建根文件系统，我们将使用sailor。再说一次，我不会介绍水手的用法，因为文档已经说明了一切。\n$cat示例/test.confship name=fakecrackershippath=&#34；${home}/src/sailor/${ship name}&#34；/bin/sh/sbin/init/usr/bin/printf/sbin/mount/sbin/mount_ff/bin/ls/sbin/mnowd/sbin/ifconfig/usr/bin/nc/usr/bin/ail&#34。run_at_build=&#34；cd/dev&amp；&amp；sh MAKEDEV ALL_Md&#34；\n然后，我们创建一个自定义RC文件，该文件将在MicroVM调用init后进行解释：\n$cat Ships/fakecracker/etc/rc#！/bin/shexport home=/export path=/sbin：/bin：/usr/sbin：/usr/binumask 022mount-aifconfig vioif0 192.168.2.101/24 upifconfig lo0 127.0.0.1 upprintf&#34；\\n启动nginx.。&#34；/usr/pkg/sbin/nginxecho&#34；Done&#34；printf&#34；\\n测试Web服务器：\\n&#34；printf&#34；head/HTTP/1.0\\r\\n\\r\\n&#34；|nc-n 127.0.0.1 80echo ail-f/var/log/nginx/access.log。\n更新我听说了makefs(8)实用程序，它使以下步骤变得更容易，而不是vndconfig/newfs/mount/rsync，只需使文件系统&lt；image-file&gt；&lt；directory&gt；(感谢mlelstv)。\n卸载它，从块设备上解绑映像，然后将其复制到KVM主机：", "note_en": "In November 2018  AWS published an Open Source tool called Firecracker, mostly a virtual machine monitor relying on  KVM, a small sized Linux kernel, and a stripped down version of  Qemu. What baffled me was the speed at which the virtual machine would fire up and run the service. The whole process is to be compared to a  container, but safer, as it does not share the kernel nor any resource, it is a separate and dedicated virtual machine. If you want to learn more on  Firecracker‘s internals,  here’s a very well put article.\n I liked this idea, and I thought  NetBSD would be a perfect match for this kind of target, as the kernel and the entire OS can be stripped down easily. I know this because in 2016 I wrote a wannabe-container project called  sailor, which goal is to create container-type  chroots that will run services “ala”  docker. I use this project for my own needs, and the very website you are seeing right now is actually running on a  sailor ship.\n This is fun and all, but we can’t really talk about  security only with chroot, and the  Firecracker solution seemed about right for this matter, yet the overall  NetBSD boot process was a bit too long for my taste.\n So how exactly can we significantly improve  NetBSD‘s boot speed? Well there are two major wins:\n  The first point is pretty easy to accomplish, here’s a minimal kernel  config:\n include &#34;arch/i386/conf/std.i386&#34; makeoptions\tCOPTS = &#34;-Os&#34; makeoptions\tUSE_SSP = &#34;no&#34; maxusers\t8\t\t# estimated number of users options \tCONSDEVNAME = &#34;\\&#34;com\\&#34;&#34; options\t\tCONS_OVERRIDE options\t\tMULTIBOOT options \tRTC_OFFSET = 0\t# hardware clock is this many mins. west of GMT options \tPIPE_SOCKETPAIR\t# smaller, but slower pipe(2) include \t&#34;conf/compat_netbsd60.config&#34; file-system\tFFS\t\t# UFS file-system\tKERNFS\t\t# /kern options \tFFS_NO_SNAPSHOT\t# No FF snapshot support options \tINET\t\t# IP + ICMP + TCP + UDP config\t\tnetbsd\troot on ? type ? options \tWSEMUL_VT100\t\t# VT100 / VT220 emulation options \tWS_KERNEL_FG = WSCOL_GREEN options \tWSDISPLAY_COMPAT_SYSCONS\t# emulate some ioctls options \tPCDISPLAY_SOFTCURSOR pci*\tat mainbus? bus ? isa0\tat mainbus? pcdisplay0\tat isa?\t\t\t# CGA, MDA, EGA, HGA wsdisplay*\tat pcdisplay? console ? com0\tat isa? port 0x3f8 irq 4\t# Standard PC serial ports cinclude &#34;arch/i386/conf/GENERIC.local&#34; pseudo-device\tfss\t\t\t# file system snapshot device pseudo-device\tvnd\t\t\t# disk-like interface to files pseudo-device\tbpfilter\t\t# Berkeley packet filter pseudo-device\tloop\t\t\t# network loopback pseudo-device\ttun\t\t\t# network tunneling over tty pseudo-device\tpty\t\t\t# pseudo-terminals pseudo-device\tclockctl\t\t# user control of clock subsystem pseudo-device\twsmux\t\t\t# mouse &amp; keyboard multiplexor pseudo-device\tksyms virtio* at pci? dev ? function ? # Virtio PCI device ld* at virtio? # Virtio disk device vioif* at virtio? # Virtio network device\n Note that we absolutely need the  virtio drivers, as  VirtIO is the fastest way of handling devices in a virtualized environment.\n Now about the second point, this is not as simple as it seems. The kernel must be able to be loaded out of the blue, i.e. without the need of a  boot loader. In  NetBSD, this is possible on the  i386 port thanks to the  MULTIBOOT kernel option, and unfortunately, as of today (18/06/2020), this option is  not supported by the  amd64 port ( but on the bench nevertheless). So the rest of this article will assume we’re working with  i386, which is a bit frustrating yet not really a problem as mostly all packages are available for this platform as well.\n I won’t be covering how to prepare the environment for cross compiling tools and kernel, instead here’s a  very good tutorial on this subject. Note that you  can cross compile the  i386  NetBSD kernel on a 64 bits  Linux system, that’s actually what I do. Nevertheless, you will need an  i386 NetBSD (possibly virtual) machine in order to create the root disk used for the service we want to run.\n TL;DR here’s the command I use to build my kernel (don’t forget you’ll have to build the tools first!):\n    The kernel will ask for root filesystem’s location, which we don’t have yet. Exit the  -nographic mode by pressing  Ctrl+a x.\n Now about the real service to be started, we’ll setup an  nginx web server which will start without the  rc.d framework, again to gain precious milliseconds. To create our root filesystem, we will use  sailor. Again, I will not cover  sailor‘s usage as the documentation says it all.\n   $ cat examples/test.confshipname =fakecrackershippath = &#34; ${HOME } /src/sailor/ ${shipname } &#34;shipbins = &#34;/bin/sh /sbin/init /usr/bin/printf /sbin/mount /sbin/mount_ffs /bin/ls /sbin/mknod /sbin/ifconfig /usr/bin/nc /usr/bin/tail&#34;packages = &#34;nginx&#34;run_at_build = &#34;printf &#39;creating devices\\\\n&#39;&#34;run_at_build = &#34;cd /dev &amp;&amp; sh MAKEDEV all_md&#34;\n Then we create a custom  rc file which will be interpreted after the  MicroVM calls  init:\n $ cat ships/fakecracker/etc/rc #!/bin/shexport HOME =/export PATH =/sbin:/bin:/usr/sbin:/usr/binumask  022mount -aifconfig vioif0 192.168.2.101/24 upifconfig lo0 127.0.0.1 upprintf  &#34;\\nstarting nginx.. &#34;/usr/pkg/sbin/nginxecho  &#34;done&#34;printf  &#34;\\nTesting web server:\\n&#34;printf  &#34;HEAD / HTTP/1.0\\r\\n\\r\\n&#34;|nc -n 127.0.0.1  80echotail -f /var/log/nginx/access.log\n     update I’ve been told about the  makefs(8) utility which makes the following steps much easier, instead of  vndconfig / newfs / mount / rsync, simply  makefs &lt;image-file&gt; &lt;directory&gt; (thanks  mlelstv).\n        umount it, unbind the image from the block device, and copy it to the  kvm host:", "posttime": "2020-06-19 01:58:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "虚拟机,fakecracker,netbsd,选项", "title": "Fakecracker：NetBSD作为基于函数的微虚拟机", "title_en": "Fakecracker: NetBSD as a Function Based MicroVM", "transed": 1, "url": "https://imil.net/blog/posts/2020/fakecracker-netbsd-as-a-function-based-microvm/", "via": "", "real_tags": ["虚拟机", "netbsd", "选项"]}, {"category": "", "categoryclass": "", "imagename": "e9f286b6100889dc2348ecada07d4564.jpg", "infoid": 1007129, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们现在上网的时间比以往任何时候都多。在Mozilla，我们正在努力开发产品来帮助您控制您的隐私并保持在线安全。为了帮助我们更好地了解您的需求和挑战，我们联系了Firefox专用网络的用户和支持者。\n我们从您和我们的同龄人那里了解到，你们中的许多人都希望在网上感觉更安全，而不是跳槽，并决定从提供设备级保护的目标开始。这就是我们构建Firefox专用网络VPN的原因，帮助您控制与网络共享数据的方式。虽然市面上有很多VPN，但我们觉得您应该拥有一个后面带有Mozilla名称的VPN。\n为了构建最好的VPN，我们再次求助于您。毕竟，谁比你更了解你，对吧？我们从2019年开始招聘Beta测试员。令人惊讶的是，这次招聘吸引了来自世界各地200多个国家的潜在测试员。\n我们开始和你们中的一小部分人合作，学到了很多。有了您手中的VPN，我们确认了一些最初的假设，并确定了未来的重要优先事项。例如，超过70%的早期Beta测试者表示，VPN帮助他们在线时感觉到授权、安全和独立。此外，83%的早期测试者发现VPN易于使用。\n我们知道，我们正走在构建VPN的正确道路上，使您的在线体验更安全、更易于管理。我们有信心在我们的数据隐私原则的指导下继续做出正确的决定。这意味着我们正在积极放弃额外的利润，承诺永远不会跟踪您的浏览活动，并避免任何第三方应用内数据分析平台。\n您的反馈还帮助我们确定了使VPN更具影响力和以隐私为中心的方法，其中包括构建拆分隧道等功能，并使其在Mac客户端上可用。VPN将在接下来的几周内退出Beta阶段，退出Firefox Private Network品牌，成为一个独立的产品Mozilla VPN，以服务于更多的受众。\n对于我们的Beta测试人员，我们要感谢您与我们合作。您的反馈和支持使我们能够启动Mozilla VPN。\n我们正在努力使官方产品Mozilla VPN今年在选定的地区可用。我们将继续以当前定价模式限时提供Mozilla VPN，允许您以4.99美元/月的价格保护Windows、Android和iOS上的最多五台设备。\n随着我们实现提供下一代隐私和安全解决方案的愿景，我们邀请您继续与我们分享您的想法，通过本博客跟踪我们的旅程，并通过此处的等待名单保持联系*。如果您有兴趣了解有关该产品的更多信息，现在可以在美国下载Beta VPN。\n*对于美国以外的用户，只有当Mozilla VPN在您的地区和设备上可用时，我们才会与您联系产品更新。", "note_en": "We are now spending more time online than ever. At Mozilla, we are working hard to build products to help you control of your privacy and stay safe online. To help us better understand your needs and challenges, we reached out to you, the users and supporters of Firefox Private Network.\n We learned from you and our peers that many of you want to feel safer online without jumping through hoops and decided to start with the goal to provide device-level protection. This is why we built the Firefox Private Network VPN, helping you control how your data is shared with  your network. Although there are a lot of VPNs out there, we felt like you deserve a VPN with the Mozilla name behind it.\n To build the best VPN, we turned to you again. Afterall, who knows you better than you, right? We started recruiting Beta testers in 2019. It was amazing to see the recruitment attracted potential testers from over 200 countries around the world.\n We started working with a small group of you and learned a lot. With the VPN in your hands, we confirmed some of our initial hypotheses and identified important priorities for the future. For example, over 70% of early Beta-testers say that the VPN helps them feel empowered, safe, and independent while being online. In addition, 83% of early Beta-testers found the VPN easy to use.\n We know that we are on the right path to building a VPN that makes your online experience safer and easier to manage. We are confident to keep making the right decisions guided by our  Data Privacy Principles. This means that we are actively forgoing additional profits by committing to never track your browsing activities and avoiding any third party in-app data analytics platform.\n Your feedback also helped us identify ways to make the VPN more impactful and privacy-centric, which includes building features like split tunneling and making it available on Mac clients. The VPN will exit Beta phase in the next few weeks, move out of the Firefox Private Network brand, and become a stand-alone product, Mozilla VPN, to serve a larger audience.\n To our Beta-testers, we would like to thank you for working with us. Your feedback and support made it possible for us to launch Mozilla VPN.\n We are working hard to make the official product, the Mozilla VPN, available in selected regions this year. We will continue to offer the Mozilla VPN at the current pricing model for a limited time, which allows you to protect up to five devices on Windows, Android, and iOS at $4.99/month.\n As we realize our vision to provide next-generation privacy and security solutions, we would like to invite you to continue to share your thoughts with us, follow our journey through this blog, and stay connected via the waitlist  here*. If you are interested to learn more about the product, the Beta VPN is available for download in the US  now.\n *For users outside of the US, We will only contact you with product updates when Mozilla VPN becomes available for your region and device.", "posttime": "2020-06-19 01:58:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "mozilla,vpn", "title": "Mozilla VPN", "title_en": "Mozilla VPN", "transed": 1, "url": "https://blog.mozilla.org/futurereleases/2020/06/18/introducing-firefox-private-network-vpns-official-product-the-mozilla-vpn/", "via": "", "real_tags": ["mozilla", "vpn"]}, {"category": "", "categoryclass": "", "imagename": "0eb9a4e24464fb8fa084bc575de4cadf.png", "infoid": 1007128, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下面是几个我一起关注了多年的YouTube频道，它们在编程和Web开发的各个方面都对我有帮助。\n“网络忍者”发布各种网络开发技术的教程视频。一位伟大的导师，许多人的最爱。\nFireship.io以他的短而有价值的视频而闻名，比如100秒内的X。他还发布了关于开发人员使用的工具的提示。他的视频中的视觉效果很棒。\nTraversy Media制作流行的网络开发人员教程速成课程，谈论他的观点，提供提示，制作励志视频(从开发人员的角度来看，不是Gary Vee类型的视频)。\nEdureka包含许多关于许多技术的速成课程，除了web开发之外，还涵盖了广泛的领域。\nHitesh Choudhary制作了很多编程视频课程，个人观点视频，什么是视频和常规的直播流，非常活跃。\nDev Ed他制作了很多面对面的Vlog视频，幽默，博学和娱乐性。教授网络开发，在网站上发表他的观点。\n免费代码营各个领域的一个完整课程的宝藏，没有广告，有大量的直播流，在不影响数量的同时提供优质的内容。各种内容创作者的协作。\nAcademy emind积极发布教程视频，X和Y视频，分享他对Web开发技术的看法，知道自己说了什么，知识渊博，是一个伟大的导师。\nStefan Mischook分享了他的个人经历，他对主题和技术的看法。他的视频有很好的视频和音频质量。\nLearnCode.academy制作了一系列教程视频，分享了关于Web开发的提示和他对主题的个人观点。\n与Mosh一起编程制作了编程课程和速成课程，还分享了他对web开发和其他领域的看法。\nTelusko最初我观察到他制作了很多Java视频，但是现在我们可以观察到很多Web开发视频和JavaScript视频。他还分享了他对新兴技术的看法。\nJoma Tech来自硅谷的幽默、优质、有趣的内容创作者。制作自己谈论或采访他人的视频。优质内容。\nTechLead谈论了他的个人经历，他的个人故事，X和Y的视频，为什么你应该或不应该选择X和更多的Vlog。\n宣布：我计划上线并在Instagram上与你互动。它将是关于网络开发、编程、实习和学生生活的。请在https://instagram.com/developer_tharun上加入我的行列。\n顺便说一句，开发者Tharun是我的YouTube频道，与这些频道相去甚远，仍然在努力提供Web开发内容。如果你觉得它有价值，可以考虑订阅它。\n1.嘿，你关注的YouTube频道有哪些？2.我在这里错过的类似频道还有哪些？你们有YouTube频道吗？在评论中提到它，我们一定会查看的😊", "note_en": "Here are a few helpful programming Youtube channels that I have been following for years together, and has helped me in all aspects of Programming and Web Development.\n  The Net Ninja  Posts tutorial videos on various web development technologies. A great instructor, favourite of many\n   Fireship.io  Known for his short and valuable videos, like X in 100seconds. He also posts tips about the tools that developers use. Great visuals in his video\n  Traversy Media  Makes popular web dev tutorial crash courses, talks about his perspective, gives tips, makes motivational videos (from a developer point of view, not Gary Vee kind of videos)\n Edureka  Contains many crash courses on a lot of technologies, covering a wide domain apart from web development\n Hitesh Choudhary  Makes a lot of Programming videos courses, personal opinion videos, &#34;What is&#34; videos and regular live streams and is very active.\n Dev Ed  He makes a lot in person vlog videos, humourous, knowledgeable and entertaining. Teaches web development, delivers his opinion on websites\n Free Code Camp  A Treasure of a complete courses of various domains, with No Ads, a lot of live streams, quality content while not compromising quantity. A collaboration of various content creators\n Academind  Actively posts tutorial videos, X vs Y videos, shares his own opinion on web dev technologies, knows what he speaks and is knowledgeable, a great instructor\n Stefan Mischook  Shares his personal experience, his opinion on topics and technologies. He has a great video and audio quality in his videos.\n LearnCode.academy  Makes tutorial series of videos, shares tips on web development and his personal opinion on topics\n Programming with Mosh  Makes programming courses and crash courses, shares his opinion on web development and other domains too\n Telusko  Initially I observed Him make a lot of Java videos, but now we can observe a lot of web development videos and JavaScript videos. He also shares his opinion on new emerging technologies\n  Joma Tech  Humourous, quality, entertaining content creator from the Silicon Valley. Makes videos of himself talking about or interviewing people. Good quality content\n TechLead  Talks about his personal experience, his personal stories, X vs Y videos, why you should or shouldn&#39;t choose X and a lot more VLOGs\n     Announcement:  I am planning to Go Live and interact with you on Instagram. It will be about Web Development, Programming, Internships and Student Life. Join me at  https://instagram.com/developer_tharun\n  By the way,  Developer Tharun is my YouTube Channel no where close to these, still trying to deliver web development content. Consider subscribing to it if you find it valuable.\n  1. Hey, what programming YouTube Channels do you follow?  2. What are the other similar channels that I have missed here?  Do you have a Youtube channel? Mention it in the comments, we&#39;ll definitely check it out😊", "posttime": "2020-06-19 01:58:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "programming,youtube,错过,channels,视频", "title": "在YouTube上编排你不应该错过的频道", "title_en": "Programming channels on YouTube that you shouldn't miss", "transed": 1, "url": "https://dev.to/tharunshiv/18-programming-youtube-channels-that-you-shouldn-t-miss-2hk", "via": "", "real_tags": ["youtube", "错过", "channels", "视频"]}, {"category": "", "categoryclass": "", "imagename": "35201e5aa6c804626479a710c8bd06be.png", "infoid": 1007125, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "了解更多关于古代世界最致命的士兵-军团的装备、训练、工资和编队的有趣事实。\n被认为是人类历史上产生的最致命的重型步兵，罗马军团是一位传奇的士兵，他创造了世界上有史以来最伟大的帝国之一-罗马帝国。罗马军团成员训练有素，装备精良，领导效率高。很少有人提及的优势之一是罗马军团吃得很饱。空着肚子很难打赢仗！\n盔甲或Lorica secmentata是由金属条组成的，固定在内部的皮带上。罗马人能够批量生产这种盔甲。它非常适合偏转箭和剑。\n盾牌或盾牌是由胶合板和皮革制成的。它呈椭圆形和长方形，高1米多。主要用于保护，但也可以用作武器。\n头盔或棺材是用青铜制成的，用来保护整个头部。它是用马毛或羽毛装饰的。\n短剑或角斗士是首选的主要武器。非常适合刺伤和砍伤，在近距离战斗中特别有效。\n标枪或标枪大约2米长，有金属尖端和有重量的末端。标枪被掷向敌人，对对手造成了毁灭性的影响。经验丰富的军团可以打击20米外的敌人。\n凉鞋或印花鞋是用皮革做的，鞋底很硬。它们的设计是为了让空气在脚周围循环，并降低行军过程中起泡的风险。军团每天可以行军25英里(40公里)。\n公元前13年，八月皇帝将标准期限从10年提高到16年，并增加了4年的储备期。公元5年，标准年限增加到20年，储备年限增加到5年。\n罗马军人是一名职业军人。他的月薪是20便士，如果他运气好，当上了比勒陀利亚卫兵，他就能挣60便士。百夫长每月可以挣300银币。\n一旦他退休，他就会得贫血。这意味着3000便士和一块好农田。此外，士兵们还被允许保留一部分战利品，例如，并将俘虏的敌人作为奴隶出售。每次新皇帝上台，士兵们都会得到大笔捐款。\n在朱利叶斯·凯撒时代，一条面包卖0.25银币，奶牛卖200银币，男奴卖500银币，小农场卖100.000银币。\n罗马军团是训练有素的战斗机器。他的一生献给了战争。在战斗间隙，罗马军团修建道路，担任当地警察，并接受培训。\n年轻的军团士兵从行军开始他们的训练。罗马军团每天可以行军40公里，而军团则携带着多达45公斤的装备。行军会给他们耐力和纪律。\n在Doctore(负责训练的军官)的监督下，年轻的军团士兵会使用木剑或鲁迪和柳条盾牌来学习如何刺伤对手。这把木剑比真正的角斗士重得多。\n基础训练历时4个月。但是罗马军团训练了他们一生。他们在战斗编队和肉搏战中进行训练。\n虽然他的肉搏战技术娴熟，但他最大的长处是他的整体作战能力。一个军团。领导良好、纪律严明的军团经常用更多的士兵击败敌人。\n“杀戮”一词的由来来自罗马军团。杀戮是对整个部队的一种惩罚。士兵们将被召集到队形中，每十名士兵就会被挑出来。剩下的9名士兵被迫将战友殴打致死。\nContubernium是由8名军团成员和2名奴隶组成的最小单位。他们共用一个帐篷。他们一起战斗，一起吃饭，万一死了，那些活着的人照顾被杀同志的家人。每个人都知道其他技能，比如做饭、打猎、当工程师或当铁匠。这位领袖被称为迪卡努斯(Decanus)。\n世纪由10个Contubernium组成，这意味着80名士兵和20名奴隶。它是由一个百夫长领导的。只有最勇敢和最有经验的军团成员才会成为百夫长。\n队列由6个世纪组成。每个队列都有独特的小号叫声，可以在战场上单独操纵。六百夫长中最有经验的也是队列的领头人。因此，这个队列由480名退伍军人和120名奴隶组成。\n军团有10个军团，意味着4800名军团成员和1200名奴隶。有趣的是，它由一名使节(参议院代表)、贡品(人民代表)和州长(从退伍军人中选出)领导。\n在战斗中，第一排军团进行战斗后，他们会用巨大的盾牌和体重作为杠杆，形成一堵盾牌墙。会在第二条线后面形成。一旦百夫长吹响哨子，第一线就会慢慢向后撤退，以恢复能量。新鲜的，休息好的二线将继续战斗。\n围攻时使用的是龟阵或龟阵。Testudo是拉丁语中“乌龟”的意思。退伍军人会排列他们的盾牌，形成一个拥挤的编队，前面和顶部都覆盖着盾牌。\n蝎子或蝎子，是早期的弩，一种用作野战大炮和围攻武器的闪电武器。每个军团都有60只这样的野兽。经验丰富的士兵每分钟可以发射4枚闪电，轻松击中100米外的目标。闪电可以轻松地刺穿对手的盾牌。\n围城塔高达20米，是一种非常有效的围城武器。罗马人增加了攻击锤，一座登机桥和多个战斗平台。工程师们用轮子建造它们。\n有时，围城塔看起来非常可怕，以至于防御者立即投降。如果不是，他们会试着烧掉它。罗马人用黏土或浸泡在醋中的兽皮把木头部分覆盖起来，以防着火。\n弹射器在靠墙使用时效果最好。他们的有效射程约为500米，可以扔出重达150公斤的石头。罗马人采用希腊人的弹弓。\n罗马军团统治古代战争达几个世纪之久。偶尔，对手能够击败军团，比如游击队击败克拉苏，汉尼拔·巴萨在戛纳获胜，或者日耳曼部落在特乌托堡森林歼灭军团。\n然而，军团成员总是从错误中吸取教训，调整战术，重新集结，然后回来-成为胜利者。", "note_en": "Learn more fascinating facts about equipment, training, salary, and formations of the deadliest soldiers of the Ancient world — the legionaries.\n   Considered the deadliest heavy infantry ever produced in the history of humankind, Roman Legionary is a legendary soldier who created one of the greatest empires world has ever seen — the  Roman empire. Roman legionary was well-trained, well-equipped, and efficiently led. One of the rarely mentioned advantages was that Roman legionaries were well-fed. It is difficult to win battles on an empty stomach!\n  Armor or  lorica segmentata was  consisting of metal strips, fastened to internal leather straps. Romans were able to mass-produce such armor. It was perfect for deflecting arrows and swords.\n Shield or  scutum was made out of plywood and leather. It was oval-shaped and rectangular, more than 1 meter high. Used primarily for protection, but it could serve also as a weapon.\n Helmet or  cassis was made out of bronze and protected the whole head. It was decorated by horsehair or feathers.\n A short sword or  gladius was the primary weapon of choice. Ideal for stabbing and slashing was especially effective in close combat.\n Javelin or  pilum was around 2 meters long, with a metal tip and with a weighted end. Javelin was hurled into the enemy and it had a devastating effect on the opponent. Experienced legionaries could hit the enemy which was 20 meters away.\n  Sandals or  caligae were made out of leather and had hardened soles. They were designed for air to circulate around the feet and reduce the risk of blisters during marching. Legion could march 25 miles (40 km) a day.\n  In 13 BC emperor August increased standard term from 10 to 16 years and 4 years in reserves. In 5 AD standard term was increased to 20 years and 5 years in reserves.\n Roman legionary was a professional soldier. He was paid 20 denarii a month, if he was lucky and he made it to Pretorian guard (=personal guard of the emperor), he would earn 60 denarii. Centurions would earn 300 denarii per month.\n Once he retired he would receive praemia. This meant 3000 denarii and a plot of good farmland. Additionally soldiers were allowed to keep part of war booty such and sell captured enemies as slaves. Each time a new emperor took power, soldiers would get substantial donations.\n In the time of Julius Ceaser a loaf of bread cost 0.25 of denarii, cow 200 denarii, male slave 500 denarii, and small farm 100.000 denarii.\n  Roman Legionary was well trained fighting machine. His life was dedicated to war. In between the battles roman legionary built roads, served as local police, and trained.\n Young legionary started their training with marching. Roman legion could march for 40 km a day while legionary was carrying up to 45 kg of equipment. Marching would give them endurance and discipline.\n Under the supervision of  doctore (military officer in charge of training) young legionary would use a wooden sword or rudis and a wicker shield to learn how to stab and slash at the opponent. The wooden sword was much heavier than real gladius.\n Basic training took 4 months. But Roman legionary trained their whole life. They trained in battle formations and hand-to-hand combat.\n   Although skilled man-to-man combat, his greatest strength was his ability to fight as a unit. A legion. Well-led and disciplined legions regularly beaten enemies with a higher number of soldiers.\n    The origin of the word “decimated” comes from the Roman legions. Decimation was a form of punishment for a whole unit. Soldiers would be called to the formation and every tenth soldier was singled out. Remaining nine soldiers were forced to beat their comrades to death.\n  Contubernium  was the smallest unit of 8 legionnaires and 2 slaves. They shared the same tent. They fought together, they ate together and in case of death, those alive took care of the family of a killed comrade. Each man knew additional skills like cooking, hunting, being engineer, or a blacksmith. The leader was called  Decanus.\n Century consisted of 10 Contuberniums which means 80 soldiers and 20 slaves. It was lead by a Centurion. Only the bravest and the most experienced legionnaires would become centurions.\n Cohort was made of 6 centuries. Each cohort had a distinctive trumpet calls and could be maneuvered individually around the battlefield. The most experienced of 6 centurions was also the leader of the cohort. Cohort thus consisted of 480 legionnaires and 120 slaves.\n Legion had 10 cohorts, meaning 4800 legionnaires and 1200 slaves. Interestingly, it was lead by a  Legate (a representative from Senate), by  Tribute (representative of People) and by  Prefect (selected from Legionnaires)\n  During the battle after the first row of legionaries did some fighting they would form a shield wall using their big shields and body weight as leverage. Behind the second line would form. Once centurion blew his whistle, the first-line would slowly retreat backward to regain energy. Fresh, rested the second line would continue with fighting.\n Testudo or  tortoise formation was used during sieges. Testudo is the Latin word for “tortoise”. Legionnaires would align their shields to form a packed formation covered with shields on the front and top.\n  Scorpion or  Scorpio, was an early crossbow, a bolting weapon used as field artillery and as a siege weapon. Each legion had 60 of those beasts. Experienced soldiers could shoot 4 bolts per minute and easily hit a target 100 meters away. Bolts would pierce opponents&#39; shields with ease.\n  Siege towers were up to 20 meters high and were incredibly effective as a siege weapon. Romans added battering rams, a boarding bridge, and multiple fighting platforms. Engineers constructed them with wheels.\n Sometimes siege tower looked so formidable that defenders surrendered right away. If not, they would try to burn it. Romans covered wooden parts in clay or hide soaked in vinegar to prevent fire.\n  Catapults were best when used against the walls. Their effective range was around 500 meters and could throw a rock weighing up to 150 kilograms. Romans adopted catapults from Greeks.\n  Roman Legionary dominated ancient warfare for centuries. Occasionally, opponents were able to defeat legions like Partians defeated Crassus, Hannibal Barca won at Cannae, or Germanic tribes annihilating legions in the Teutoburg forest.\n However, legionnaires always learned from mistakes, adapted tactics and regrouped, and came back — as winners.", "posttime": "2020-06-19 01:04:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "军团,roman", "title": "罗马军团-罗马帝国的职业重步兵", "title_en": "Roman Legionary – professional heavy infantry of Roman Empire", "transed": 1, "url": "https://medium.com/history-of-yesterday/roman-legionary-a439d8493c5f", "via": "", "real_tags": ["军团", "roman"]}, {"category": "", "categoryclass": "", "imagename": "df21071bc5ec2258d821f0a3fe300bea.png", "infoid": 1007124, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，我很兴奋地与乔尔·斯波尔斯基和裘德·奥尔雷德一起介绍哈希公司，这是我们一年多前创立的公司。我们认为，世界上大多数坏事都是某种形式的信息失灵的产物。从经济崩溃、战争和疾病的爆发，到选择正确的人生伴侣或大学学位，我们的使命是帮助每个人做出正确的决定，克服信息失灵。\n才华横溢的创新者寻求组织世界上的信息并使其为所有人所访问，而这一旅程的下一步是使这些信息为每个人所理解和使用。\n虽然像对冲基金这样的高科技、资金雄厚的组织能够高效地处理世界上大量的信息，在经济交易中获得微小的收益和毫秒的优势，但绝大多数企业和个人没有系统的方法来分析他们周围世界包含的丰富信号。\n模拟有能力打开一个更美好的世界：促进我们对周围世界的理解和欣赏。模拟不仅是人类有用的认知工具，而且有可能成为丰富的、机器可读的真实世界问题的表现形式。因此，它们是人类和人工智能的通用接口-在我们看来，这是我们生长连接人类和机器学习的结缔组织的最好机会。\n我们希望能够实现更好的人性化和自动化决策：合理解决冲突，减少和消除市场失灵，并支持人们实现更幸福、更健康的生活。我们不想等这个。\n我曾在伦敦经营一家数字咨询公司，为范围广泛的客户开发网站、软件和开展数据驱动的活动：从私募股权公司和初创公司到规模最大的政府客户。\n我们时不时会遇到一些非常有趣的问题，比如如何跟踪行为驱动的疾病(如性传播感染)的传播，评估针对它的干预措施的有效性(例如，信息性广告宣传)，以及优化广告支出(即，瞄准最有可能阻止疾病传播的网络中的有影响力的节点)。\n事实证明，在流行病学和行为广告中，回答这些类型的问题都存在一个黄金标准，那就是“基于代理的建模”(ABM)。作业成本管理系统的工作方式如下…\n代理人代表行为者：无论他们是个人、公司、家庭、工厂里的机器，还是其他任何东西。不同的模型以不同的粒度级别查看系统。从理论上讲，“代理人”可能是一个分子。\n代理具有属性：这些属性是附加到代理的值，不同的代理之间会有所不同。就个人而言，财产可能是布尔型的，如“是已登记选民”(Y/N)、“政党关系”(多项选择)或“年收入”(某个数值)。\n代理存在于环境中(通常是同时存在多个)，例如地理空间上和网络图上。\n代理是由行为驱动的：行为本质上是解释代理应该如何与周围世界交互并对其做出反应的代码。\nABM可以从基本的第一原则开始构建，并且对于反事实的“假设”假设测试非常有用，从而能够安全地探索现实世界系统的数字孪生兄弟。这使得多智能体模拟比通过网络预测疾病和信息的传播更有用。\n一系列复杂的系统问题都无法进行可预测的建模。这些都是典型的问题，根据非线性、涌现、适应、相互依赖和代理之间的反馈循环进行分类。根据定义，由此产生的“黑天鹅事件”没有反映在现有的模式和历史数据中，因此完全被遗漏了。\n没有系统是真正孤立存在的-所有系统都是我们复杂的现实世界的一部分-因此，所有的业务、政策和人的问题最终都是理解复杂系统的问题。智能抽象使我们能够在大多数情况下忽略大多数无关的世界，但是很难知道在什么时候、在什么情况下，什么可能是有趣的。\n在一些制度中，这并不重要，但在回答其他问题时，比如我们如何才能为更稳定的经济或良好的外交关系做出贡献，它们可能是生死攸关的问题。为了充分理解这些高影响、高风险的问题，我们需要基于这些系统的可观测动力学来生成性地搜索它们周围的空间。仅对历史输出进行模式识别和分析对于廉价的基础套管来说是有好处的，但对问题的尾部了解甚少。\n因为代表世界所有可能形态的问题周围的空间比观察到问题的历史空间大得多，所以有时会有一种诱惑，认为适当的科学模拟是不可行的。但是，正确使用模拟并不是试图模拟世界上可能发生的每一个可能的版本(当然是无限的)，而是帮助它的用户理解哪些版本可能会发生，并将注意力吸引到可能的新颖场景上，而这些场景可能是人类分析家以前可能没有发生过的，因为它们的出现性质。\n像07/08年金融危机这样的危机之所以成为灾难，恰恰是因为决策者没有理解或解释复杂系统的潜在动态-在这种情况下是经济。巴塞尔协议II(Basel II)等善意的监管措施实施了资本储备要求，当与按市值计价的会计做法相结合时，这导致了资产大甩卖，市场参与者被迫在下跌的市场抛售，加深了低谷。\n虽然历史和现值数据可以用于预先填充和回测基于代理的模型；但不需要构建ABM，这为在当今机器学习不容易应用的各种领域中的显式形式化建模打开了大门。\n此外，仿真结合了形式建模的优点和定性描述的丰富性，使得它们具有高度的可解释性，并且易于被人类理解。与通常的黑盒模型不同，基于代理的模拟本质上是可检查的，用户可以逐步通过时间来确切地查看结果是如何得出的，以及哪些因素起作用。\n模拟既耗时又昂贵，而且维护、运行和支持也很昂贵。它们需要专业工具、框架，甚至奇怪的专有编程语言的知识。由此产生的模拟通常不是特别便携或可重用的，并且在模拟逻辑是猜想的产物或缺乏校准的情况下，这可能导致错误的信任感或安全感，这可能会加剧现有的不良决策。\n尽管仿真声称供应链、制造、金融、国防等领域的杰出用户，但目前市场领先的基于代理的建模软件包的价格超过10K美元/用户/年，并且基于过时的技术和范例，不能很好地应用于实际规模的分布式计算。他们的用户界面自20世纪90年代以来就没有人碰过，他们提供的开发体验也同样过时，他们根本不在浏览器中运行，不能在移动设备上使用，用户经常需要部署特殊的软件才能访问它们。\n在大多数情况下，这些模拟都是玩具模型，旨在展示特定的动态，并且缺乏互操作性。一旦建成，模型就是孤立的，很少共享或建立在他人工作的基础上。大多数建立的模型的范围都很小，以确保它们以及时的方式运行，以至于它们只捕捉到了它们所代表的系统中的一小部分动态。不是在每个实验的基础上构建丰富的虚拟世界并有选择地包括相关部件，而是创建廉价的玩具抽象概念，这些抽象概念无法激发用户的信心，而且更不容易探索。对于玩具模型是否真的是“科学的”，存在着深刻的、合理的怀疑，另一方面，更复杂的模型是否可以进行适当的校准和参数化，也存在着深刻的、合理的怀疑。\n再加上寻找适当粒度的代理级数据的问题，将领域专业知识转换为代码的困难，以及创建ABM的一系列结构性障碍，不难理解为什么通用模拟仍然不受欢迎，在今天的业务中很少使用。\n当面临很多系统性问题时，我们想要构建系统级的解决方案。Hash旨在通过垂直集成整个堆栈来“解决仿真”，为构建、运行和学习仿真提供统一的平台。\n所有散列模拟都由代理(由描述性架构表示)和行为(通常是纯函数)组成。行为驱动代理，数据集可用于在基于真实世界观察的模拟中实例化或更新代理，或用于回测和校准模型。行为和数据集被映射到适当的主题和模式，使得建模者可以使用H-Index很容易地发现它们，并且将来可以在H-Core中交叉链接。\n仿真、数据集和行为都可以在H-Index上访问。今天，H指数中的一切都是免费的。被设想为GitHub和包管理器之间的交叉，在未来，H-Index将被扩展为另外一个市场，促进付费行为、数据集和模拟的购买和销售。我们设想咨询公司免费发布组件以建立信誉和专业知识，然后销售更完整的模拟和咨询服务。\n我们对H-Index的未来计划包括对分叉、分支、报告问题和发出Pull请求的显式Git支持-这些功能，就像使用包管理器一样，现在是大多数软件开发人员的第二天性。\n这些变化对开发人员工作流程的影响是巨大的：随着H-Index的发展，具有有限编程知识的领域专家将能够分叉和调整，或者将现有行为大规模合并到模拟中，使他们能够对复杂的动态进行建模，而无需从头开始编写大量自定义代码。\n然而，我们目前的阵容并不完整。虽然我们惊人的快速散列引擎能够以无与伦比的速度进行模拟，但它目前只能通过基于Web的H-Core IDE提供，这必然会将其限制在浏览器选项卡可用的内存和CPU上，而在许多情况下，浏览器选项卡的可用内存和CPU是非常有限的。这意味着，虽然H-Engine旨在处理真正世界大小的模拟，但我们的早期测试版用户仅限于在我们的平台上构建相对较小的模型。这使得H-Core在目前的迭代中可以与NetLogo之类的基于代理的学术建模工具相媲美：有助于说明复杂系统中不同代理的影响，并有助于向用户解释这些系统的动态，但其对高保真或大规模建模现实世界环境的能力有限。由于目前的这些限制，用于运行优化实验(参数扫描、蒙特卡罗模拟和更奇特的强化学习)的工具暂时被隐藏起来-但对我们来说是非常优先的。\n为此，今天我们将发布我们的路线图，以解锁这些功能，并将模拟用于日常的“现实世界”决策：\nHash Core和Hash Index现在都是正式的测试版。在接下来的几周里，我们将在这两个平台上大量迭代，并欢迎您的意见\n我们很自豪地宣布，我们将在今年晚些时候成为开源散列引擎，这是散列核心的模拟引擎。H-Engine是用Rust编写的，目前已有JavaScript和Python的绑定，它是支撑所有散列计算的超快参与者系统。\n我们的目标是让每个人都能访问这个平台，使人们能够在本地和封闭的系统中运行H-Engine是这一目标的重要组成部分。\n我们目前的目标是在2020年底之前在开源许可下发布H-Engine的公共版本。\n今年，我们还将开始推出hash Cloud，以选择测试版用户。H-Cloud是我们平台的一部分，用户只需在Hash现有的H-Core创作和查看界面中点击一下，即可在云中运行模拟(也可以通过命令行在H-Engine开源启动时运行)。\n除此之外，我们还将在H-Core中展示一个“实验”界面，它可以打开从大规模模拟中获得商业洞察力的大门。\n通过H-Cloud，用户将能够以编程方式访问模拟和实验结果，以驱动散列之外的算法和应用程序。\n一年多前，我们刚开始只有两个人，现在是一个大约10人的团队。我为我们建立的团队以及我们在这段时间取得的成就感到难以置信的自豪。\n我们很高兴能与hash的用户见面，并推出了一个Slake社区，您可以通过hash.ai任何页面右下角的图标访问该社区。我们将随时帮助您构建模型，回答您的问题，并获取您的功能建议和错误报告。\n我们正在努力使hash更容易访问，并将支持扩展到尽可能广泛的开发人员。Rust引擎具有针对Python和JavaScript的绑定，但到目前为止，在H-Core中的创作行为仅限于后者。今天，我们很自豪地宣布，通过H-Core在浏览器中本地支持Python行为创作和模拟运行。多亏了Mozilla令人惊叹的Pyodide项目，我们能够将对Python的试验性支持带到我们基于浏览器的H-Core IDE中，虽然目前它带来了很大的性能冲击，但我们希望在H-Cloud和H-Engine完全推出之前，我们能够在许多方面改进这一点(这两种技术都将允许用户避免任何性能损失)。开发人员现在可以使用Python以散列形式构建模型，并导入任意数量的流行科学Python包(更多信息请参阅我们的文档)。\n为了消除信息故障，我们需要构建以前从未创建过的工具来解决今天无法解决的问题。我们需要赋予人们超能力，这就是我们肩负的使命。\n如果您想使用hash构建模型，您可以在hash.ai/signup上注册。\n如果您想加入我们帮助每个人做出正确决策的使命，您可以帮助将模拟、行为和数据发布到H-Index，或者申请我们在hash.ai/areers上的任何一个公开职位。\n最后，如果您是一位对了解如何应用HASH来帮助您感兴趣的商业决策者，请访问hash.ai/Contact我们感谢Hash的早期投资者的支持：令人惊叹的社区创建者，如Stack Overflow创始人Joel Spolsky、Kaggle创始人Anthony Goldbloom，以及来自Zetta Venture Partners和Root Ventures的Ash Fontana和Lee Edwards。我们很高兴能开始我们的公共使命。", "note_en": "Today, along with Joel Spolsky and Jude Allred, I’m excited to introduce HASH, the company we founded a little over a year ago. We believe that most bad things in the world are the product of some form of information failure. From economic collapse and the outbreak of war and disease, to choosing the right life partner or university degree, we’re on a mission to help everybody make the right decisions and overcome information failure.\n Brilliant innovators have sought to organize the world’s information and make it accessible to all, and the next step on this journey is to make that information understandable and usable to everybody.\n While high-tech, highly-funded organizations like hedge-funds are able to process vast swathes of the world’s information efficiently for minute gains and millisecond edges in economic trades, the vast majority of businesses and individuals have no systematic way of parsing the wealth of signals contained in the world around them.\n Simulation has the power to unlock a better world: advancing our understanding and appreciation of the world around us. Not only are simulations useful cognitive tools for humans, but they have the potential to be rich, machine-readable representations of real world problems as well. As such, they are universal interfaces for both humans and AI — and in our view the best bet we have for growing connective tissue that bridges both human and machine learning.\n We hope to enable better human and automated decision-making: bringing about the rational resolution of conflict, the reduction and elimination of market failures, and supporting people to achieve happier, healthier lives. We don’t want to wait for this.\n   I used to run a digital consultancy in London that developed sites, software, and ran data-driven campaigns for a wide range of clients: from private equity firms and startups through to government clients of the largest size.\n From time to time we’d encounter really interesting problems, such as how to track the spread of a behaviorally-driven disease (such as a sexually transmitted infection), assess the effectiveness of interventions against it (e.g. informational advertising campaigns), and optimize ad-spend (i.e. target influencing nodes in networks most likely to stymie disease spread.)\n It turns out that a single gold standard exists in both epidemiology and behavioral advertising for answering these types of questions, which is ‘agent-based modeling’ (ABM). ABMs work as follows…\n Agents represent actors: be they individuals, companies, households, machinery in a factory, or any other thing. Different models look at systems in differing levels of granularity. In theory an ‘agent’ could be a molecule.\n Agents have properties: these are values attached to agents which vary between them. In the case of a person, a property might be a boolean like ‘is registered voter’ (Y/N), ‘party affiliation’ (multi-choice), or ‘annual income’ (some numeric value).\n Agents exist in environments — and often multiple at once — e.g. geospatially and on a network graph.\n Agents are driven by behaviors: behaviors are essentially code that explain how agents should interact with and react to the world around them.\n ABMs can be constructed from ground-up first principles, and are useful for counterfactual “what if” hypothesis testing, enabling safe exploration of the digital twins of real-world systems. That makes multi-agent simulations useful for a whole lot more than predicting the spread of disease and information through networks.\n  A whole range of complex systems problems defy attempts to be predictably modeled. These are typically problems categorized by nonlinearity, emergence, adaptation, interdependence and feedback loops between agents. The resulting “black swan events” are by definition not reflected in existing patterns and historical data, and are therefore missed entirely.\n No systems exist in true isolation — all are part of our complex real world — and as such all business, policy, and human problems are ultimately problems of understanding complex systems. Smart abstraction enables us to discount most of the extraneous world, most of the time, but it’s hard to know what might be interesting when, and under which circumstances.\n In some systems this doesn’t matter, but in answering other questions like how we can contribute to a more stable economy or good foreign relations, they can be matters of life and death. In order to fully understand these high-impact, critical-risk problems, we need to generatively search the space around them based on the observable dynamics of those systems. Pattern recognition and analysis of historical outputs alone are good for cheap base-casing, but provide little understanding of problems’ tails.\n Because the space around problems representing all possible configurations of the world is so much greater than the historical space in which problems have been observed, there is a temptation to sometimes write off proper scientific simulation as infeasible. But simulation properly used doesn’t seek to simulate  every possible version of the world that might ever occur (infinite, of course) — but rather help its users understand which versions are likely to occur, and bring attention to possible novel scenarios which might not previously have occurred to human analysts alone due to their emergent nature.\n Crises like the 07/08 financial crash became disasters precisely because decision-makers didn’t understand or account for the underlying dynamics of complex systems — in this case the economy. Well-intentioned pieces of regulation such as Basel II put in place capital reserve requirements, which when combined with mark-to-market accounting practices led to asset fire sales, with market participants forced to sell into declining markets, deepening the trough.\n While historical and present value data can be used to pre-populate and backtest agent-based models; it’s not required to construct ABMs, which opens the door to explicit formal modeling in a wide variety of domains where machine learning cannot be readily applied today.\n Moreover, simulations combine the benefits of formal modelling with the richness of qualitative description, making them highly explainable and easy to understand by humans. In contrast to often black-box models, agent-based simulations are inherently inspectable and users can step through time to see exactly how outcomes are arrived at, and what factors contribute.\n   Simulations are time-consuming and costly to build, as well as expensive to maintain, run and support. They require knowledge of specialist tools, frameworks, and even weird proprietary programming languages. The resulting simulations are often not particularly portable or repurposeable, and where simulation logic is the product of conjecture or lacks calibration, this can lead to a false sense of confidence or security which may compound existing poor decision-making.\n Although simulations claim prominent users across the worlds of supply chain, manufacturing, finance, defense, and more, market-leading agent-based modeling software packages today run north of $10k+/user/year, and are based on dated technologies and paradigms which don’t lend themselves well to distributed computation at real scale. Their user interfaces haven’t been touched since the 1990s, the developer experience they offer are equally dated, they don’t run in the browser at all, they can’t be used on mobile devices, and users often need to deploy special software just to access them.\n For the most part these simulations are toy models, built to showcase specific dynamics, and lack interoperability. Once built, models are siloed, and there’s little sharing or building on the work of others. Most models built are so scoped down to ensure they run in a timely fashion that they capture only a fraction of the dynamics within the systems they represent. Rather than build rich virtual worlds and selectively include relevant parts on a per-experiment basis, cheap toy abstractions are created which fail to inspire confidence amongst users and are much less easily explored. There’s deep, justifiable skepticism as to whether toy models are truly ‘scientific’, and on the flip side that more complex models can be appropriately calibrated and parameterized.\n Throw into the mix problems finding appropriately granular agent-level data, difficulties translating domain expertise into code, and a wide range of structural barriers to creating ABMs and it’s not hard to see why general purpose simulation remains out of favor and rarely used in business today.\n  When faced with a lot of systemic problems, we want to build system level solutions. HASH aims to ‘solve simulation’ by vertically-integrating the entire stack, providing a unified platform for building, running, and learning from simulations.\n   All HASH simulations consist of agents (represented by descriptive schemas), and behaviors (which are generally pure functions). Behaviors drive agents, datasets can be used to instantiate or update agents within simulations based on real-world observations, or used to backtest and calibrate models. Behaviors and datasets are mapped to appropriate subjects and schema, making them easily discoverable by model-builders using  H-Index, and in future cross-linkable within  H-Core.\n Simulations, datasets and behaviors are all accessible on the  H-Index. Today, everything within the  H-Index is available free of charge. Envisaged to be something of a cross between GitHub and a package manager, in the future,  H-Index will be extended to become a marketplace in addition, facilitating the purchase and sale of paid behaviors, datasets and simulations. We imagine consultancies publishing components for free to establish credibility and expertise, then selling more complete simulations and consultancy services atop.\n Our future plans for  H-Index involve explicit Git-like support for forking, branching, reporting issues and making pull requests — functionality that, like the use of package managers, are now second nature to most software developers today.\n The impact of these changes to developer workflow are significant: as  H-Index grows, domain experts with limited programming knowledge will be able to fork and adapt, or wholesale incorporate existing behaviors into simulations, enabling them to model complex dynamics without the need to write vast swathes of custom code from scratch.\n Our current lineup is not, however, complete. Although our blazing fast  HASH Engine enables simulation at unparalleled speed, it is currently only available through our  H-Core web-based IDE, which necessarily constrains it to the memory and CPU available to the browser tab, which is in many cases is severely limited. This has meant that while  H-Engine is designed to handle truly world-sized simulations, our early beta users have been limited to building relatively small-scale models in our platform. This makes  H-Core in its current iteration comparable to something like NetLogo, the academic agent-based modeling tool: useful for illustrating the impact of heterogeneous agents within complex systems, and helpful in explaining to users the dynamics of these systems, but limited in its capacity to model real-world environments with a high degree of fidelity or at scale. Because of these current constraints, tools for running optimization experiments (parameter sweeps, Monte Carlo simulations, and more exotic reinforcement learning) have been hidden away for now — but are very much priorities for us.\n To this end, today we’re releasing our roadmap for unlocking these features and the use of simulation for everyday ‘real world’ decision-making:\n HASH Core and HASH Index are both now officially live in beta. We’ll be iterating on both platforms heavily in the coming weeks ahead and welcome your input\n We’re proud to announce that we’ll be open-sourcing HASH Engine, the simulation engine at the heart of HASH, later this year. Written in Rust, with bindings today in existence for JavaScript and Python,  H-Engine is the ultra-fast actor system that underpins all computation in HASH.\n Our goal is to make the platform accessible to everybody, and enabling folks to run  H-Engine locally and within closed systems is a significant part of this.\n We’re currently aiming to release a public version of  H-Engine under an open-source license by the end of 2020.\n We’ll also be beginning the rollout of HASH Cloud to select beta users this year. H-Cloud is the part of our platform that enables users to run simulations in the cloud with just one click, from within HASH’s existing  H-Core authoring and viewing interface (and upon  H-Engine’s open-source launch via the command line as well).\n Alongside this we’ll be exposing an ‘experiments’ interface in  H-Core that unlocks the door to deriving commercial insight from simulations at scale.\n Through  H-Cloud users will be able access simulation and experiment results programmatically to drive algorithms and applications outside of HASH.\n  We started as just two people a little over a year ago, and are now a team of ~10. I’m incredibly proud of the team we’ve built, and what we’ve achieved in this time.\n We’re excited to meet users of HASH and have launched a Slack community which can be accessed via the icon in the bottom-right of any page at  hash.ai — we’ll be around to help you build your models, answer your questions, and take your feature suggestions and bug reports.\n We’re working to make HASH more accessible and extend support to as wide an audience of developers as possible. The Rust engine has bindings for Python as well as JavaScript, but until now authoring behaviors in  H-Core was limited to the latter. As of today, we’re proud to announce that Python behavior authoring and simulation running is supported locally in-browser via  H-Core. Thanks to Mozilla’s amazing Pyodide project we’ve been able to bring experimental support for Python to our browser-based  H-Core IDE, and although it currently comes with a large performance hit, we’re hopeful that we’ll be able to improve this in a number of ways before the full rollout of  H-Cloud and  H-Engine (both of which will allow users to avoid any performance penalty). Developers can now build models in HASH using Python, and import any number of popular scientific Python packages (more in our  docs).\n To eliminate information failure, we need to build tools that have never been created before to solve problems that can’t be solved today. We need to give people superpowers, and that’s what we’re on a mission to do.\n If you’d like to build a model with HASH, you can sign up at  hash.ai/signup\n If you want to join us on our mission of helping everybody make the right decisions, you can help publish simulations, behaviors and data to  H-Index, or apply for any one of our open roles at  hash.ai/careers\n And finally, if you’re a business decision-maker interested in learning how HASH can be applied to help you, get in touch at  hash.ai/contact We’re grateful to HASH’s early investors for their support: amazing community creators such as  Stack Overflow founder Joel Spolsky, and  Kaggle founder Anthony Goldbloom, as well as Ash Fontana and Lee Edwards from  Zetta Venture Partners and  Root Ventures. We’re excited to kick off our public mission.", "posttime": "2020-06-19 01:03:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "announcing,模拟", "title": "正在宣布哈希", "title_en": "Announcing HASH", "transed": 1, "url": "https://hash.ai/about/mission", "via": "", "real_tags": ["模拟"]}, {"category": "", "categoryclass": "", "imagename": "c21f92ca397ad23451af6d548e72891f.gif", "infoid": 1007123, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有时候，当你试图弄清楚世界是如何运转的时候，基本的数学就足以让你开始行动了。如果我们把热水流量增加x，混合物的温度就会增加y。\n有时，您正在做的事情太复杂了，您甚至无法开始猜测输入对输出的影响。在仓库，当你的员工不到四人时，一切似乎都很顺利，但当你击中五名员工时，他们会互相阻碍，以至于第五名员工实际上不会做额外的工作。\n你可能不了解员工数量和仓库吞吐量之间的关系，但你绝对知道每个人都在做什么。如果您可以想象一下编写一点JavaScript代码来模拟每个员工的行为，那么您可以运行一个模拟，看看实际发生了什么。你可以调整员工遵循的参数和规则，看看这会有什么帮助，你真的可以获得一些牵引力，理解，然后解决非常复杂的问题。\n这就是hash.ai的全部意义所在。阅读David发布的博客文章，然后尝试构建您自己的模拟！", "note_en": "Sometimes when you’re trying to figure out the way the world works, basic math is enough to get you going. If we increase the hot water flow by  x, the temperature of the mixture goes up by  y.\n Sometimes you’re working on something that’s just too complicated for that, and you can’t even begin to guess how the inputs affect the outputs. At the warehouse, everything seems to go fine when you have less than four employees, but when you hit five employees, they get in each others’ way so much that the fifth employee effectively does no additional work.\n  You may not understand the relationship between the number of employees and the throughput of the warehouse, but you definitely know what everybody is doing. If you can imagine writing a little bit of JavaScript code to simulate the behavior of each of your workers, you can run a simulation and see what actually happens. You can tweak the parameters and the rules the employees follow to see how it would help, and you can really gain some traction understanding, and then solving, very complex problems.\n That’s what  hash.ai is all about. Read David’s  launch blog post, then try building your own simulations!", "posttime": "2020-06-19 01:03:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,建模,free,员工", "title": "Hash：一个免费的在线世界建模平台", "title_en": "Hash: A free, online platform for modeling the world", "transed": 1, "url": "https://www.joelonsoftware.com/2020/06/18/hash-a-free-online-platform-for-modeling-the-world/", "via": "", "real_tags": ["免费", "建模", "free", "员工"]}, {"category": "", "categoryclass": "", "imagename": "a0d6004ac9153cec2d7111204c0fb8d1.jpg", "infoid": 1007122, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "TechCrunch获悉并确认，Stockwell将关闭，此前该公司无法为其内置应用程序控制的储存有便利店商品的“智能”自动售货机找到可行的业务。\n联合创始人兼首席执行官保罗·麦克唐纳在写给TechCrunch的电子邮件中写道：“令人遗憾的是，目前的形势已经造成了我们无法继续运营的局面，我们将在7月1日结束公司的运营，”该公司联合创始人兼首席执行官保罗·麦克唐纳在给TechCrunch的电子邮件中写道。我们非常感谢我们才华横溢的团队、令人难以置信的合作伙伴和投资者，以及使这一切成为可能的我们令人惊叹的购物者。虽然这不是我们想要结束这段旅程的方式，但我们相信，我们把商店带到人们居住、工作和娱乐的地方的愿景将通过其他令人惊叹的公司、产品和服务得以延续。“。\n我们最初是在收到一封关于关闭的电子邮件后联系到的。斯托克韦尔的自动售货箱主要分布在公寓楼和写字楼里，过去一周它一直在联系这些客户，以宣布这一消息。\n无论如何，使用斯托克韦尔自动售货机的建筑运营商表示，他们正在积极寻找替代供应商，因此似乎确实得到了一些使用，但更有针对性的是，自动售货机行业非常艰难，一些分销商的业务损失高达90%。\n斯托克韦尔的关闭值得注意，因为它突显了在当前的环境下，拥有强大的支持者名单和非常可观的资金并不总是能保证每个人的绝缘。\n截至去年9月，斯托克韦尔已经从投资者那里筹集了至少4500万美元的资金，其中包括NEA、GV、DCM Ventures、Forerunner、First圆形和Homebrew。它的网络已经发展到1000家“商店”，智能自动售货机的工作原理有点像先进的酒店迷你吧：传感器会检测你带出去的东西并向你收费，你可以使用智能手机应用程序来跟踪你购买的商品并支付费用。\n截至去年秋天，该公司似乎正在为扩大其商业模式做准备，允许其客户(建筑、办公室和公寓经理)在斯托克韦尔自己放入机器中的物品之外的物品上拥有更大的话语权，包括水和其他饮料、美味和甜食，以及洗衣粉和止痛药等几种家庭必需品。\n到了12月，麦当劳的联合创始人阿什瓦思·拉詹似乎已经悄悄离开了这家初创公司，然后随着2020年的启动，新冠肺炎付出了代价。\n首先，消费者发现自己花了更多的时间在工作上，只是呆在家里，更少外出和批量购物，以最大限度地减少购物努力。反过来，这又对基于随意、小额购买的商业模式的可持续性产生了重大影响，比如人们通常会从斯托克韦尔(Stockwell)这样的自动售货机上获得这种商业模式。\n其次，当许多人试图通过戴口罩、洗手和最大限度地减少接触随机物体来尽量减少感染传播的时候，无人值守自动售货机的整个概念以及它们是否能得到适当的消毒都笼罩着一个很大的问号。这不仅影响了购买商品的人，也影响了帮助储存和维护这些售货亭的劳动力。\n自动售货业对待新冠肺炎的方式出现了一些有趣的曲折。一些人正在更换椒盐卷饼和士力架，取而代之的是个人防护设备，另一些人正在寻找机会，为它们储备专门为一线工人准备的健康食品，这些一线工人别无选择，在关键时期需要快速但有营养的修复。\n据估计，正常年份更广泛的市场每年价值约300亿美元-这是Stockwell nee Bodesa可能吸引投资者眼球的原因之一-但对于许多关键运营商来说，业务已经跌落悬崖。\n欧洲销售商协会主席在4月份呼吁政府领导人提供财政援助时表示，生意已经下降了90%，并形容新冠肺炎对该行业造成了“毁灭性的影响”。对于世界上的百事可乐(Pepsis)和Mondeleze(Nee Kraft)来说，这是一个艰难的数字，但对于一家年轻的、有前途的基于人工智能的自动售货机初创公司来说，无疑是一颗棺材上的钉子，尽管如此，一些人从一开始就对此表示怀疑。", "note_en": "TechCrunch has learned and confirmed that  Stockwell   will be shutting down, after it was unable to find a viable business for its in-building app-controlled “smart” vending machines stocked with convenience store items.\n “Regretfully, the current landscape has created a situation in which we can no longer continue our operations and will be winding down the company on July 1st,” co-founder and CEO Paul McDonald wrote in an email to TechCrunch. “We are deeply grateful to our talented team, incredible partners and investors, and our amazing shoppers that made this possible. While this wasn’t the way we wanted to end this journey, we are confident that our vision of bringing the store to where people live, work and play will live on through other amazing companies, products and services.”\n  We originally reached out after we were tipped off by someone who had received an email about the closure. Stockwell’s vending boxes were distributed primarily in apartment and office buildings, and it has been contacting those customers for the past week to break the news.\n For what it’s worth, the building operator that was using Stockwell vending machines said it is actively in search of a replacement provider, so it seems it did get some use, but more pointedly it’s been very hard for the vending machine industry, where some distributors have seen business losses of up to 90%.\n Stockwell’s closure is notable because it underscores how in the current climate, having a strong list of backers and a very decent amount of funding cannot always guarantee insulation for everyone.\n As of last September, Stockwell had raised at least $45 million in funding from investors that included NEA, GV, DCM Ventures, Forerunner, First Round and Homebrew. Its network had grown to 1,000 “stores,” smart vending machines that work a little like advanced hotel minibars: sensors detect and charge you for what you take out, and you use a smartphone app both to track what you buy and to pay for it.\n As of last autumn, the company appeared to be gearing up for a widening of its business model, allowing its customers (building, office and apartment managers) to have a bigger say in what got stocked beyond the items Stockwell itself put into its machines, which included water and other beverages, savoury and sweet snacks, and a few home basics like laundry detergent and pain killers.\n By December, it seems that McDonald’s co-founder, Ashwath Rajan, had quietly left the startup, and then as 2020 kicked into gear, COVID-19 took its toll.\n First, consumers found themselves spending much more time working and simply being at home, going out less and bulk buying to minimise shopping efforts. That, in turn, had a big impact on the sustainability of business models based on casual, small purchases, such as the kind that one would typically make from vending machines like Stockwell’s.\n Second, at a time when many are trying to minimise the spread of infection by wearing face masks, washing hands and minimising touching random objects, a big question mark hangs over the whole concept of unattended vending machines, and whether they can ever be properly sanitised. That’s impacted not only people buying items, but the workforce that’s meant to help stock and maintain these kiosks.\n There have been some interesting twists in how the vending industry has handled COVID-19. Some are swapping out pretzels and Snickers and  replacing them with PPE equipment, and others are  finding opportunity in stocking them with healthy food specifically for front-line workers who have no other options and need quick but nutritious fixes during critical times.\n  The wider market in a normal year is estimated to be worth  some $30 billion annually — one reason why Stockwell nee Bodega likely caught the eye of investors — but business has fallen off a cliff for many key operators.\n The president of the European Vending Association, in an appeal in April to government leaders for financial assistance,  said that business had dropped off by 90% and described COVID-19 as having a “devastating effect” on the sector. Difficult numbers for the Pepsis and Mondelezes (nee Kraft) of the world, but surely the nail in the coffin for a young, promising AI-based vending machine startup that nonetheless some doubted from the word go.", "posttime": "2020-06-19 00:46:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,ai,自动售货机", "title": "斯托克韦尔，前身为Bodes a的人工智能自动售货机初创公司，将于7月1日关闭", "title_en": " Stockwell, the AI-Vending Machine Startup Formerly Known as Bodega, is Shutting Down July 1", "transed": 1, "url": "https://techcrunch.com/2020/06/15/stockwell-the-ai-vending-machine-startup-formerly-known-as-bodega-is-shutting-down-july-1/", "via": "", "real_tags": ["人工智能", "ai", "自动售货机"]}, {"category": "", "categoryclass": "", "imagename": "0e9a7da98f266e9734fac99565a61a03.png", "infoid": 1007121, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "验证码是网站用来过滤机器人的带有模糊声音或模糊或弯曲字母的拼图(通常不成功)，十多年来一直困扰着最终用户。现在，挑战和响应测试可能会让恶意软件攻击中的目标感到恼火。\n微软最近发现一个攻击组织在一个网站上分发恶意Excel文档，要求用户完成验证码，很可能是为了阻止好人的自动检测。Excel文件包含的宏会在启用时安装GraceWire，这是一种会窃取密码等敏感信息的特洛伊木马程序。这些攻击是微软一个名为Chimborazo的组织所为，该公司的研究人员至少从1月份就开始追踪该组织。\n以前，Microsoft观察到Chimborazo在网络钓鱼邮件中包含的附件中分发Excel文件，然后通过嵌入的Web链接传播。最近几周，该组织开始发送钓鱼电子邮件，再次改变了局面。在某些情况下，网络钓鱼包含指向重定向站点的链接(通常是已被攻破的合法站点)。在其他情况下，电子邮件具有包含恶意IFRAME标记的HTML附件。\n无论哪种方式，点击链接或附件都会进入一个网站，目标在那里下载恶意文件，但前提是完成了验证码(CAPTCHA)(这是完全自动化的公共图灵测试的缩写，以区分计算机和人类)。目的：阻止防御者用来检测和阻止攻击并关闭攻击活动的自动分析。通常情况下，分析是由下载恶意软件样本并在虚拟机中运行和分析它们的机器人执行的。\n要求成功完成验证码意味着只有当活人下载样本时才会进行分析。如果没有自动化，恶意文件在雷达下飞行的可能性要大得多。微软称Chimborazo正在进行的攻击活动为Dudear。\n微软安全情报组周三在一条推文中写道：“部署窃取信息的特洛伊木马GraceWire的组织Chimborazo，在不断追求检测规避的过程中，再次演变了他们的方法，”Dudear活动背后的组织Chimborazo部署了窃取信息的特洛伊木马GraceWire。“该组织现在使用带有验证码的网站，以避免自动分析。”\n部署窃取信息的特洛伊木马GraceWire的Dudear活动背后的组织Chimborazo，在不断追求检测规避的过程中，再次发展了他们的方法。该组织现在使用带有验证码的网站，以避免自动分析。pic.twitter.com/Kz3cdwYDd7。\n在安全情报组(Security Intelligence Group)1月份报道的一次活动中，Chimborazo使用IP回溯服务来跟踪下载恶意Excel文件的机器的IP地址，想必也是为了逃避自动检测。当时，这是微软第一次看到Chimborazo使用重定向网站。\n安全提供商Malwarebytes的威胁情报主管杰罗姆·塞古拉(Jérôme Segura)表示，在恶意软件攻击中使用验证码的情况很少见，但并非史无前例。他指出，12月下旬的这条推文也在做同样的事情。在这种情况下，攻击者要求目标完成验证码，该验证码是谷歌reCAPTCHA服务的翻版。虽然是假的，但它的目的与真正的一样-通过要求真人下载文件来阻止自动分析。\n微软发现的验证码也可能是假冒的验证码。证据：正如这篇帖子顶部的图片所示，它说reCAPTCHA和下面的图片声称提供Cloudflare提供的DDoS保护。这是两项独立的服务。(不过，正如一位评论者指出的那样，攻击者很可能分别使用了这两项服务。)。谷歌代表没有立即回复寻求对本文置评的电子邮件。\n定期改变攻击常规是攻击者保持领先于防御者的一种方式，创造了一个永无止境的来回过程，需要防御者保持持续的警惕才能保持领先。在接下来的几个月里，袭击组织很可能会再次改变路线。\n所以现在我也需要填写验证码才能感染？这笔交易一直在变得更糟..。\n现在是2020年了，人们还在打开意想不到的附件，比如启用了宏的Excel文件？要拥有一台计算机，应该有一个基本的能力测试。\n有人不在IT行业工作.", "note_en": "CAPTCHAs, those puzzles with muffled sounds or blurred or squiggly letters that websites use to filter out bots ( often  unsuccessfully), have been annoying end users for more than a decade. Now, the challenge-and-response tests are likely to vex targets in malware attacks.\n Microsoft recently spotted an attack group distributing a malicious Excel document on a site requiring users to complete a CAPTCHA, most likely in an attempt to thwart automated detection by good guys. The Excel file contains macros that, when enabled, install GraceWire, a trojan that steals sensitive information such as passwords. The attacks are the work of a group Microsoft calls Chimborazo, which company researchers have been tracking since at least January.\n Previously, Microsoft observed Chimborazo distributing the Excel file in attachments included in phishing messages and later spreading through embedded Web links. In recent weeks, the group has begun sending phishing emails that change things up again. In some cases, the phishes include links that lead to redirector sites (usually legitimate sites that have been compromised). In other cases, the emails have an HTML attachment that contains a malicious  iframe tag.\n Either way, clicking on the link or attachment leads to a site where targets download the malicious file, but only after completing the CAPTCHA (which is short for completely automated public Turing test to tell computers and humans apart). The purpose: to thwart automated analysis defenders use to detect and block attacks and get attack campaigns shut down. Typically the analysis is performed by what are essentially bots that download malware samples and run and analyze them in virtual machines.\n Requiring the successful completion of a CAPTCHA means analysis will only happen when a live human being downloads the sample. Without the automation, the chances of the malicious file flying under the radar are much better. Microsoft has dubbed Chimborazo’s ongoing attack campaign Dudear.\n “CHIMBORAZO, the group behind Dudear campaigns that deploy the info-stealing Trojan GraceWire, evolved their methods once again in constant pursuit of detection evasion,” Microsoft’s Security Intelligence group wrote in a  Tweet on Wednesday. “The group is now using websites with CAPTCHA to avoid automated analysis.”\n CHIMBORAZO, the group behind Dudear campaigns that deploy the info-stealing Trojan GraceWire, evolved their methods once again in constant pursuit of detection evasion. The group is now using websites with CAPTCHA to avoid automated analysis.  pic.twitter.com/Kz3cdwYDd7\n   In a campaign the Security Intelligence group  covered in January, Chimborazo used an IP traceback service to track the IP addresses of machines that download the malicious Excel file, presumably to also evade automated detection. Back then, it was the first time Microsoft had seen Chimborazo use redirector sites.\n Jérôme Segura, head of threat intelligence at security provider Malwarebytes, said using CAPTCHAs in malware attacks is rare but not unprecedented. He pointed to  this tweet from late December that was doing the same thing. In that case attackers required targets to complete a CAPTCHA that was a knock off of Google’s reCAPTCHA service. While fake, it served the same purpose as a real one—to thwart automated analysis by requiring a real person to download the file.\n The CAPTCHA spotted by Microsoft may also be a fake reCAPTCHA. The evidence: as seen in the image at the top of this post, it says reCAPTCHA and below that claims to provide &#34;DDoS protection by Cloudflare.&#34; Those are two separate services. (Then again, as one commenter points out, it&#39;s possible the attackers used both services separately.) Google representatives didn’t immediately respond to an email seeking comment for this post.\n Periodically changing up attack routines is one way attackers stay ahead of defenders, creating a never-ending back-and-forth process that requires constant vigilance for defenders to stay on top of. It’s likely the attack group will change course again in the coming months.\n  So now I also need to fill in CAPTCHA to get infected? This deal is getting worse all the time...\n  It&#39;s 2020 and people are still opening unexpected attachments like Macro enabled Excel files? There should be a basic aptitude test to own a computer.\n Someone doesn&#39;t work in IT...", "posttime": "2020-06-19 00:43:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,requiring,验证码", "title": "黑客要求目标完成验证码", "title_en": "Hackers are requiring targets to complete CAPTCHAs", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/06/to-evade-detection-hackers-are-requiring-targets-to-complete-captchas/", "via": "", "real_tags": ["黑客", "requiring", "验证码"]}]