[{"category": "", "categoryclass": "", "imagename": "675efc4648b372659a3dac6b76b06ebc.jpg", "infoid": 1070059, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在今天的公告发布之前，该公司最近在社交媒体上向创作者展示了一些实时更新。介绍 3️⃣ 种新方式，让您与社区建立联系和创造——现场活动、一起现场直播和现场问答 ft. matt_and_omar！据 TikTok 称，部分市场已经可以访问 LIVE Events，这是一种新工具，可以让创作者更好地计划他们即将举行的 LIVE 会议。创作者可以提前安排和宣传他们的活动，以建立整个社区的预期，而粉丝可以发现、注册，然后在 LIVE 活动即将开始时收到通知和提醒。调度工具是直播平台提供的一个相当常见的基线功能，因此 TikTok 现在添加这个功能是有道理的。要使用此功能，创建者可以从其个人资料页面的右上角选择 LIVE Events 图标，然后为事件命名，列出开始时间并编写简要说明。一旦他们点击创建，LIVE 活动将经过一个简短的审查过程，然后才会被 TikTok 的其他人看到。活动安排后，创作者可以通过应用内消息进行分享，使用实时倒计时贴纸通过 TikTok 视频进行宣传，或在 TikTok 之外进行宣传。如果需要，他们还可以随时更改甚至删除事件。在他们计划活动时，TikTok 将显示已经注册参加的人数，以更好地告知创作者的宣传工作。该公司告诉我们，该功能已经在美国、加拿大、澳大利亚和新西兰推出，但现在正在其他全球市场进行测试。\n创作者现在还可以与其他人一起直播，以便从合并的观众中受益，从而获得彼此社区的曝光率。目前，与另一位共同主持人一起上线的功能在全球范围内可用，但 TikTok 正在测试与选定地区的多位主持人一起上线。相比之下，Instagram 今年推出了让创作者在直播室中与最多四位其他人一起直播的功能。同时，TikTok 的 LIVE Q&amp;A 允许观众在创作者的直播过程中提问。创作者可以从单独的面板在他们的流聊天中查看这些问题，并且可以选择向所有观众展示问题并通过现有的问答工具正式回答这些问题。另一个新工具允许创作者在直播开始之前分配受信任的主持人来管理他们的流。这些版主将能够根据需要将用户静音和阻止聊天。关键字过滤工具可阻止创作者不想出现在其聊天中的词，也已扩展至最多支持 200 个词。在接下来的几周内，TikTok 还将推出一种让主持人和版主暂时静音观众和删除评论的方法。同时，对于观众来说，TikTok 将更容易找到要观看的直播视频。很快，用户将能够通过点击新的 LIVE 按钮（有些人可能已经拥有），然后点击启动侧面板的“探索”按钮，直接从 For You Feed 和 Follow 页面收听直播视频浏览现在可用的各种现场视频。 TikTok 表示，迄今为止最热门的 LIVE 类别包括聊天/问答、游戏、才艺、时尚和日常生活。如果系统检测到观众即将发布可能有害或辱骂的内容，系统还会提示观众在直播期间重新考虑他们的评论。 TikTok 之前曾使用提示来标记其事实核查人员无法验证的视频中未经证实的声明，并使用类似的提示来解决潜在的欺凌评论。\n直播观众现在还可以在 iOS 和 Android 上使用画中画模式在继续使用手机的同时观看直播视频。 TikTok LIVE 体验在大流行期间特别受欢迎。虽然该公司拒绝分享其直播的确切观众指标，但它会说去年参加直播的人数和观看直播视频的人数翻了一番。这些直播视频也可能有助于推动对该应用程序的需求，正如 Sensor Tower 最近的一份报告指出，尽管在印度被禁止，TikTok 成为第一个在全球下载量达到 30 亿次的非 Facebook 应用程序。该报告还指出，在 2021 年第二季度，该应用的消费者支出环比增长达到一年来最大，从上一季度的 3.847 亿美元增长 39% 至 5.346 亿美元。这可能表明人们对直播的兴趣增加，因为创作者往往通过虚拟礼物产生收入。 TikTok 的 LIVE 平台仅对 16 岁以上的用户开放，并定期删除系统检测到的可能未成年人。 （当被问及最近的清洗时，TikTok 表示它只是在执行现有的指导方针。）。它还禁止冒充或误导社区有关其身份的帐户，它说。截至目前，所有新功能都以某种形式向全球观众开放。", "note_en": "The company recently  teased some of the LIVE updates to creators across social media ahead of today’s announcement.\n  Introducing 3️⃣ new ways for you to connect and create with your community—LIVE Events, go LIVE together &amp; LIVE Q&amp;A ft. matt_and_omar!\n According to TikTok, select markets have already had access to LIVE Events, which is a new tool that lets creators better plan their upcoming LIVE sessions.\n Creators can schedule and promote their event in advance to build anticipation across their community, while fans can discover, register and then get notifications and reminders when the LIVE Event is about to begin. Scheduling tools are a fairly common baseline feature for livestreaming platforms to offer, so it makes sense that TikTok would now add this.\n  To use this feature, creators can select the LIVE Events icon from the top-right corner of their profile page, then name the event, list the start time and write a brief description. Once they hit create, the LIVE event will go through a brief review process before being visible to the rest of TikTok.\n After the event is scheduled, creators can share it through in-app messages, promote with a TikTok video using a LIVE countdown sticker, or promote it outside of TikTok. They can also make changes or even delete event at any time, if need be. As they plan for their event, TikTok will show how many people have already registered to attend to better inform creators’ promotional efforts.\n This feature had already become available in the U.S., Canada, Australia, and New Zealand, but is now testing in other global markets, the company tells us.\n Creators can also now go live with others in order to benefit from the combined audience to gain exposure with each other’s community. Currently, the ability to go live with one other co-host is available worldwide, but TikTok is testing going live with multiple hosts in select regions. For comparison, Instagram this year launched the ability for creators to  go live with up to four others in Live Rooms.\n Meanwhile, TikTok’s LIVE Q&amp;As allow audience members to ask questions during the creator’s livestreams. Creators can view these questions in their stream chat from a separate panel, and have the option to show the questions to all viewers and answer them formally through the  existing Q&amp;A tools.\n  Another new tool allows creators to assign trusted moderators to manage their streams before a livestream starts. These moderators will have the ability to mute and block users from the chat, as needed. The keyword filtering tool, which blocks words the creators doesn’t want to appear in their chats, has also been expanded to support up to 200 terms.\n Over the next few weeks, TikTok will also introduce a way for hosts and moderators to temporarily mute viewers and remove comments.\n  For viewers, meanwhile, TikTok will make it easier to find LIVE videos to watch. Soon, users will be able to tune into LIVE videos directly from the For You Feed and Following pages, by tapping on the new LIVE button (which some may already have), then the “Explore” button which launches a side panel where they can browse through the various LIVE videos available now.\n TikTok says top LIVE categories to date have included Chat/Q&amp;A, gaming, talents, fashion, and daily life.\n Viewers will also be prompted to reconsider their comments during livestream if the system detects they’re about to post something potentially harmful or abusive. TikTok has  used prompts before to flag unsubstantiated claims in videos its fact-checkers couldn’t verify and it has used a  similar prompt to address potentially bullying comments.\n  Livestream viewers can also now use picture-in-picture mode on iOS and Android to watch LIVE videos while continuing to use their phone.\n The TikTok LIVE experience became particularly popular during the pandemic. And while the company declined to share exact viewer metrics for its livestreams, it would say that the number of people going LIVE and the number of people watching LIVE videos had doubled over the last year. These LIVE videos may be helping to fuel demand for the app as well, as a recent report from Sensor Tower noted  TikTok became the first non-Facebook app to reach 3 billion downloads worldwide, despite being banned in India.\n The report also noted that in Q2 2021 the app saw its greatest quarter-over-quarter growth in consumer spending in a year’s time, climbing 39% to $534.6 million up from $384.7 million in the previous quarter. This could signal an increased interest in livestreams, as that’s where creators tend generate revenue through the virtual gifts.\n TikTok’s LIVE platform is only open to users over the age of 16, and it regularly removes those who the system detects may be underage. (Asked about a recent purge, TikTok said it’s just enforcing its existing guidelines.). It also bans accounts that impersonate or mislead the community about their identity, it says.\n All of the new features are available, in some form, to global audiences as of now.", "posttime": "2021-07-27 23:06:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "扩展,expands,live", "title": "TikTok 通过新功能扩展 LIVE 平台，包括活动、联合主持人、问答等", "title_en": "\n\t\t\t\tTikTok expands LIVE platform with new features, including events, co-hosts, Q&A’s and more\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/27/tiktok-expands-live-platform-with-new-features-for-creators-and-fans/", "via": "", "real_tags": ["扩展", "expands", "live"]}, {"category": "", "categoryclass": "", "imagename": "0d09bf59a770a45c9ee670319134b225.jpg", "infoid": 1070058, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "ZV-E10 相对于 ZV-1 的两个最大优势是更大的 24 兆像素 APS-C 传感器和可互换的无反光镜安装座。后一个功能为视频博主打开了索尼 60 多个 E 卡口镜头的范围，使 ZV-E10 比固定镜头 ZV-1 更通用。同时，更大的传感器将提供更高的光灵敏度和更浅的景深。 ZV-E10 使用 A6100 和其他最近的索尼型号中的老化 24 兆像素 APS-C 传感器。虽然这可以以高达 30 fps（或 120 fps 1080p）的速度提供锐利的、降采样的 4K 视频，但它可能会产生大量的滚动快门，这对于其预期用途而言并不理想。更积极的一面是，它提供了光学和主动电子图像稳定功能，就像 ZV-1 一样。这应该可以很好地平滑手持拍摄，尽管不要指望步行和谈话类型的视频博客会出现奇迹——尤其是如果滚动传感器摆动被证明是一个问题。在尺寸方面，ZV-E10 比任何 A6000 系列相机都小，重 343 克，但并不比 ZV-1 大多少也重。它没有电子取景器，但它是索尼第一款具有完全铰接翻转屏幕的 APS-C 无反光镜相机——这是当今任何视频博客相机的基本要求。 ZV-E10 配备了索尼最新的相位检测自动对焦系统，适用于视频和静态拍摄。这意味着您应该获得令人难以置信的快速对象跟踪，以及可靠的眼睛、面部和头部检测自动对焦。它还具有 S&amp;Q（慢速和快速）功能，可让您在相机内录制延时和慢动作镜头，而无需任何后期处理工作。它直接从 ZV-1 借用了几个视频博客功能。第一个被称为“产品展示”，该设置允许它立即将焦点从您的脸部转移到放置在相机前面的物体上。这对于审查产品、设备等的视频博主来说特别方便。另一个是散景开关，可立即设置可用于照明条件的最低光圈值。这样，您可以使背景尽可能散焦，让您的拍摄对象清晰突出。\nZV-E10 有一个内置的高品质三路麦克风（左、右和中央声道），专为挑选您的声音而设计。这意味着您无需购买麦克风即可进行视频博客，尽管它仍然无法与专用霰弹枪或翻领麦克风的质量和语音隔离相媲美。它还配备了一个附有热靴的耳罩，以帮助阻挡风噪声，如果这还不够，还有风噪声降低设置。它还带有麦克风输入，但不是耳机输出。最后，如果您喜欢实时流媒体，您可以将 ZV-E10 直接连接到智能手机并直接流媒体到 YouTube 或其他服务——就像使用松下最新的 GH5-II 一样。它还可以直接用作网络摄像头，同时传输视频和音频（不像其他相机那样只是视频），因此您可以利用其高品质麦克风。 ZV-E10 将于 8 月底推出黑色或白色，机身售价 700 美元，包括索尼 16-50mm F/3.5-5.6 电动变焦镜头在内的套装售价为 800 美元。", "note_en": "The two biggest advantages of the ZV-E10 over the ZV-1 are the larger 24-megapixel APS-C sensor and interchangeable mirrorless mount. The latter feature opens Sony’s range of 60-plus E-mount lenses to vloggers, making the ZV-E10 much more versatile than the fixed-lens ZV-1. The larger sensor, meanwhile, will deliver improved light sensitivity and a shallower depth of field.\n    The ZV-E10 uses the aging 24-megapixel APS-C sensor found in the  A6100 and other recent Sony models. While that delivers sharp, downsampled 4K video at up to 30 fps (or 120 fps 1080p), it’s likely to have a serious amount of rolling shutter that’s not ideal for its intended purpose.\n On the more positive side, it offers optical and active electronic image stabilization, just like the ZV-1. That should smooth out handheld shooting pretty well, though don’t expect miracles for walk-and-talk type vlogging — especially if rolling sensor wobble proves to be an issue.\n Size-wise, the ZV-E10 is smaller than any of the A6000-series cameras at 343 grams and isn’t much larger and heavier than the ZV-1. It lacks an electronic viewfinder, but it’s Sony’s first APS-C mirrorless camera with a fully-articulating flip-out screen — a basic requirement on any vlogging camera these days.\n  The ZV-E10 comes with Sony’s latest phase-detect autofocus system, both for video and still shooting. That means you should get incredibly quick subject tracking, along with reliable eye, face and head detect autofocus. It also has an S&amp;Q (slow &amp; quick) feature that lets you record time-lapse and slow motion footage in-camera without the need for any post processing work.\n It borrows several vlogging features directly from the ZV-1. The first is called “product showcase,” a setting that allows it to instantly focus away from your face and onto an object placed in front of the camera. That’s particularly handy for vloggers reviewing products, devices, etc.\n The other is a bokeh switch that instantly sets the lowest f-stop available for lighting conditions. That way, you can have the background as defocused as possible, allowing your subject to stand out clearly.\n The ZV-E10 has a built-in, high-quality three-way microphone (left, right and central channels) that’s designed to pick out your voice. That means you can vlog without the need to buy a microphone, though it still won’t match the quality and voice isolation of a dedicated shotgun or lapel mic. It also comes with a hotshoe-attached muff to help block wind noise, and if that’s not enough, a wind noise reduction setting. It also comes with a microphone input, though not a headphone output.\n Finally, if you’re into live streaming, you can connect the ZV-E10 directly to a smartphone and stream directly to YouTube or other services — much as you can with Panasonic’s latest GH5-II. It will also work directly as a webcam, streaming both video and audio (not just video like other cameras) so you can take advantage of its high-quality microphone.\n The ZV-E10 will be available in either black or white by the end of August and will cost $700 for the body, or $800 in a bundle including Sony’s 16-50mm F/3.5-5.6 power zoom lens.", "posttime": "2021-07-27 23:06:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "博客,相机,更换,zv,视频", "title": "索尼的 ZV-E10 为其视频博客相机系列带来了可更换镜头", "title_en": "\n\t\t\t\tSony’s ZV-E10 brings interchangeable lenses to its vlogging camera series\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/27/sonys-zv-e10-brings-interchangeable-lenses-to-its-vlogging-camera-series/", "via": "", "real_tags": ["博客", "相机", "更换", "zv", "视频"]}, {"category": "", "categoryclass": "", "imagename": "8b20407f35a9350e9c70ffa658a53d32.jpeg", "infoid": 1070057, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从今天开始，任何启用了“社区”功能的服务器都能够将消息转换为跨移动和桌面的线程对话。话题由它们自己的主题名称指定，从而可以轻松地将偏离主题的想法划分到自己的小型对话中。频道成员可以通过选择现在出现在上下文菜单中的新主题标签符号来创建线程，当鼠标悬停在消息上或按聊天栏中的加号并选择“创建线程”时。该功能将在 8 月 17 日之前在所有服务器中自动启用。“......我们希望帮助社区保持参与，同时避免关闭对话以维持组织，”该公司在宣布该功能的博客文章中写道，并指出跳入繁忙的新频道可以“感觉就像走进三部不同电影的中间”。 Discord 去年引入了回复以帮助对话和线程的流动，这是同一想法的扩展。从频道的流向来看，Discord 的新线程打开了一个分屏窗格，而不是占据整个屏幕，自然而然地充当辅助对话的功能。线程主题也将显示在频道列表中，如果从频道列表中选择，则将全屏打开。线程将在 24 小时不活动后自动存档——这是一种防止频道被离题或时间敏感的聊天阻塞的好方法。提升的服务器可以将一个线程保留一周而不是一天，让频道的成员有更多时间跳入相关的附带对话。通过 Discord 的高级功能增强的服务器也将能够创建未显示在频道列表中的私人线程。私人线程仅向手动添加到其中或在线程中按名称提及的用户显示。 Discord 设计了私人线程，以便用户可以进行群组对话，而无需将对话中的每个人都添加为朋友，这一功能对于希望更轻松地进行一对一或小组聊天的主持人来说可能是一个福音。\n版主还可以指定谁可以在频道内创建线程。频道成员可以被授予使用私人线程、管理线程或只允许使用公共线程的权限（必须打开“发送消息”以允许他们创建新线程）。线程的工作方式与常规频道对审核机器人的工作方式相同。", "note_en": "Starting today, any server with “community” features enabled will be able to transform messages into threaded conversations, across mobile and desktop. Threads are designated by their own subject name, making it easy to compartmentalize an off-topic idea into its own mini-conversation.\n     Channel members can create a thread by selecting a new hashtag symbol that now appears in the contextual menu when hovering over messages or pressing the plus sign in the chat bar and and choosing “create thread.” The feature will be enabled in all servers automatically by August 17.\n “… We wanted to help communities stay engaged while avoiding having to shut down conversation to maintain organization,” the company wrote in a  blog post announcing the feature, noting that hopping into a busy new channel can “feel like walking into the middle of three different movies.” Discord introduced replies last year to help the flow of conversations and threads is an expansion of that same idea.\n From the flow of a channel, Discord’s new threads open up into a split-view pane instead of taking over the full screen, serving their function as side conversations naturally. Threaded topics will also show up in the list of channels and will open to the full screen if selected from the channel list.\n  Threads will auto-archive after 24 hours of inactivity — a nice way to keep channels from being clogged up with off-topic or time-sensitive chat. Boosted servers can keep a thread around for a week instead of a single day, giving a channel’s members more time to hop into relevant side conversations.\n  Servers that are boosted through Discord’s premium features will also be able to create private threads that don’t show up in the channel list. Private threads only appear to users who are manually added into them or mentioned by name within a thread.\n Discord designed private threads so that users could hold group conversations without adding each person in the conversation as a friend, a feature that may be a boon to moderators looking to have one-on-one or small group chats more easily.\n  Moderators will also be able to designate who can create threads within a channel. Channel members can be given permissions to use private threads, manage threads or just be allowed to use public threads (“send messages” must be toggled on to allow them to create new threads). Threads will work the same way regular channels do for moderation bots.", "posttime": "2021-07-27 23:05:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推出,rolls,线程", "title": "Discord 推出了自动存档的主题和旁白", "title_en": "\n\t\t\t\tDiscord rolls out threads, side conversations that auto-archive\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/27/discord-threads/", "via": "", "real_tags": ["推出", "rolls", "线程"]}, {"category": "", "categoryclass": "", "imagename": "12193679f045d3217e161feb88a54f3d.jpg", "infoid": 1070056, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在RapidSOS 上EC-1 的过去三个部分中，我认为这种普遍性和简单性是理所当然的，因为我们已经研究了这家初创公司的起源故事、业务和产品，以及它的合作伙伴关系和业务开发引擎。该公司与 911 深陷其中，这意味着 911 作为一个系统的前景将在很大程度上决定 RapidSOS 在未来几年的发展轨迹，或者至少在其国际扩张达到规模并且不再那么依赖美国之前市场。现在，您可能会想，“911，他们怎么能搞砸呢？”但这是美国，你会感到惊讶。尽管数以万计的 911 人员每天英勇地工作，使这个脆弱的系统保持运转，但今天的现实是美国的紧急呼叫基础设施处于危险状态。经过十多年的大力倡导，向“下一代”911（称为NG911）的过渡一直在缓慢推进，911 将用围绕数据流设计的基于互联网的模型取代以语音为中心的模型。早期牵引，但很少有普遍性。正如几年前国会研究服务处的一份报告所描述的那样，“资金一直是一个挑战，而且进展相对缓慢。”三年后，这句话和当时一样真实。鉴于 RapidSOS 的未来最终取决于能够提供核心基础设施的主管政府，EC-1 的第四部分也是最后一部分将着眼于 911 服务的当前状态及其前景，最后，人们应该如何最终判断RapidSOS 鉴于我们所看到的一切。 911 是在 1960 年代后期发明的，目的是将美国统一在一个紧急号码周围。建立紧急热线的早期尝试已经在各个城市和州兴起，但每个城市和州都使用自己的系统和电话号码，这给旅行者和居住在管辖范围内的人们带来了巨大的麻烦。林登约翰逊总统的 1967 年犯罪工作组建议为紧急呼叫创建一个单一号码作为预防犯罪的工具，1968 年 2 月 16 日，第一个 911 电话在阿拉巴马州的黑利维尔拨打。", "note_en": "I’ve taken that ubiquity and simplicity for granted over the past three parts of this EC-1 on RapidSOS as we’ve looked at the  startup’s origin story,  business and products, as well as  its partnerships and business development engine. The company is deeply enmeshed with 911, which means that the prospects of 911 as a system will heavily determine the trajectory of RapidSOS in the coming years, or at least, until its international expansion hits scale and it isn’t so dependent on the U.S. market.\n  Now, you might think, “911, how could they screw that up?” But this is America, and you’d be surprised.\n Despite the daily heroic work of tens of thousands of 911 personnel who keep this brittle system afloat, the reality today is that America’s emergency call infrastructure is in a perilous state. After more than a decade of heavy advocacy, the transition to the “next generation” of 911 (dubbed NG911), which would replace a voice-centric model with an internet-based one designed around data streams, has been trundling along, with some early traction but little universality.\n As  a Congressional Research Service report described it just a few years ago, “funding has been a challenge, and progress has been relatively slow.” Three years later, the words are just as true as they were then.\n Given that RapidSOS’ future ultimately relies on a competent government capable of providing core infrastructure, this fourth and final part of the EC-1 will look at the current state of 911 services and what their prospects are, and finally, how one should ultimately judge RapidSOS given all that we have seen.\n  911 was invented in the late 1960s to unify America around one emergency number. Early forays to create emergency lines had sprouted up across cities and states, but each used their own system and telephone number, creating massive complications for travelers and people living on jurisdictional boundaries.  President Lyndon Johnson’s 1967 crime task force recommended creating a single number for emergency calls as a crime-prevention tool, and on February 16, 1968, the first 911 call was dialed in Haleyville, Alabama.", "posttime": "2021-07-27 23:05:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "互联网,congress,美国", "title": "十年后，国会可能最终将 911 带入互联网时代", "title_en": "\n\t\t\t\tAfter a decade, Congress might finally bring 911 into the internet age\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/27/rapidsos-ec1-future/", "via": "", "real_tags": ["互联网", "congress", "美国"]}, {"category": "", "categoryclass": "", "imagename": "cafb644ae401c84ef104e6e6b4d6763b.jpg", "infoid": 1070055, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "然后是 RapidSOS。由于双边业务建立在与硬币两侧的数十家甚至数百家公司的关系之上，因此它需要在扩展其数据平台以改善紧急 911 呼叫时真正尽早并真正快速地获得建立合作伙伴关系的能力。我们已经在 EC-1 的第一部分和第二部分介绍了公司的起源故事和业务，现在我想转向秘诀：一群好斗的创业人员如何能够打破危及合作伙伴关系的墙在世界上一些最大的科技公司。正如我们将要了解的，关键是公司用来将尽可能多的利益相关者绑定到其业务中的一组创造性策略。我们将了解这些合作伙伴关系是什么以及它们是如何形成的，然后探讨 RapidSOS 如何与 911 领域的软件供应商集成。我们还将探讨它如何在公共安全应答点 (PSAP) 上教育接听电话、与客户合作伙伴合作，以及最后，它如何建立咨询委员会和围绕健康状况的全行业倡议，成为市场上的关键思想领袖. “合作伙伴关系”是一个明显且故意模糊的术语，经常在创业圈中出现。简而言之，它描述了一种业务关系，通常通过合同或工作说明书来完成，它将两家公司通过共同的计划联系在一起。与单纯的销售（一家公司提供产品和客户支持以换取报酬）不同，合作伙伴关系往往更广泛、更具战略性，可以包括从交叉推广和渠道营销到工程协助、风险投资、独家承诺的方方面面。和更多。", "note_en": "And then there is RapidSOS. With a two-sided business built around relationships with dozens if not hundreds of companies on both sides of the coin, it needed to gain competency in building partnerships really early and really quickly as it scaled its data platform to improve emergency 911 calls. We’ve already  covered the company’s origin story and  business in parts one and two of this EC-1, and now I want to turn to the secret sauce: How a scrappy cadre of startup folks were able to break down the walls that imperil partnerships at some of the largest tech companies in the world.\n  The key, as we will learn, is a set of creative tactics that the company used to bind as many stakeholders into its business as possible. We’ll look at what these partnerships are and how they are formed, and then explore how RapidSOS integrated with software vendors in the 911 space. We’ll also explore how it educated call takers at public safety answering points (PSAPs), worked with its customer partners, and finally, how it built its advisory board and an industrywide initiative around health profiles to become a key thought leader in the market.\n  “Partnership” is a notably and intentionally vague term often thrown around startup circles. Simply put, it describes a business relationship, generally consummated with a contract or statement of work, that brings two companies together over a common initiative. Unlike a mere sale, where one company supplies a product and perhaps customer support in exchange for compensation, partnerships tend to be much broader and more strategic, and can include everything from cross-promotion and channel marketing to engineering assistance, venture investment, exclusivity commitments and more.", "posttime": "2021-07-27 23:05:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "创造性,creative", "title": "RapidSOS 如何使用创造性策略大规模建立合作伙伴关系和 BD 引擎", "title_en": "\n\t\t\t\tHow RapidSOS used creative tactics to build partnerships and a BD engine at scale\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/27/rapidsos-ec1-partnerships/", "via": "", "real_tags": ["创造性", "creative"]}, {"category": "", "categoryclass": "", "imagename": "a8fbf1ee7e0be2d3d795036b443bc2f6.jpg", "infoid": 1070054, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Extra Crunch Live 让您有机会聆听成功筹集大量风险投资的企业家以及相信他们的投资者的现场直播。我们详细介绍了交易是如何完成的，你会听到关于向风险投资公司推销需要什么，以及行业领先的风险投资公司在未来的投资组合公司中寻找什么的信息。我们很高兴 Nwankwo 和 Bell 加入我们的这一集。 Nwankwo 创立并领导了 1910 Genetics，该公司利用人工智能来加速新药疗法的发现和开发，涵盖范围广泛的不同疾病和病症类别。她拥有博士学位。在塔夫茨大学医学院获得药理学和实验治疗学博士学位，并在她的研究生院工作之前参与了药物发现开发，这导致了 2 型糖尿病药物 Trulicit 的创建。贝尔辉煌的职业生涯包括设计和制造用于深海探索的自主机器人，以及在苹果公司为消费技术领导者设计笔记本电脑的六年时间。贝尔的风险投资生涯于 2015 年在 Playground Global 开始，他专注于深度技术投资，包括航空航天、基因组学、合成生物学和人工智能辅助药物发现，例如 1910 Genetics。 Extra Crunch Live 还设有 ECL Pitch-off，观众中的初创公司几乎可以“举手”在我们的直播中直播他们的初创公司。我们的专家客人将就每个球场提供反馈。如果你想把你的帽子扔进戒指，你必须出现。 Extra Crunch Live 对所有人开放，但只有 Extra Crunch 会员才能按需访问内容。我们每周都做这些，所以 ECL 库中有很多关于各种创业领域的剧集。这只是成为 Extra Crunch 会员的众多原因之一。加入这里。", "note_en": "Extra Crunch Live gives you the chance to hear live from entrepreneurs who have successfully raised significant rounds of venture capital, and also from the investors who believed in them. We go into detail about how the deal got done, and you’ll hear from both about what it takes to pitch VCs, and about what industry-leading VCs look for in prospective portfolio companies.\n We’re thrilled to have Nwankwo and Bell joining us for this episode. Nwankwo founded and leads 1910 Genetics, which takes advantage of AI to accelerate the discovery and development of new drug therapies, across a wide range of different disease and condition categories. She has a Ph.D. in Pharmacology &amp; Experimental Therapeutics from Tufts University School of Medicine, and participated in drug discovery development that led to the creation of type 2 diabetes drug Trulicit prior to her graduate school work.\n  Bell’s illustrious career includes designing and building autonomous robots for deep sea exploration, as well as a six-year stint at Apple designing notebooks for the consumer technology leader. Bell’s venture investment career began at Playground Global in 2015, and he focuses on deep tech investments, including in aerospace, genomics, synthetic biology — and AI-assisted drug discovery, as in the case of 1910 Genetics.\n Extra Crunch Live also features the ECL Pitch-off, where startups in the audience can virtually “raise their hand” to pitch their startup live on our stream. Our expert guests will give their feedback on each pitch. If you want to throw your hat in the ring, you have to show up.\n Extra Crunch Live is accessible to everyone, but only Extra Crunch members can access the content on demand. We do these every week, so there are scores of episodes across a wide variety of startup sectors in the  ECL Library. It’s but one of many reasons to become an Extra Crunch member.  Join here.", "posttime": "2021-07-27 23:05:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "crunch,风险投资", "title": "1910 Genetics 的 Jen Nwankwo 和 Playground Global 的 Jory Bell 将加入我们的 Extra Crunch Live", "title_en": "\n\t\t\t\t1910 Genetics’ Jen Nwankwo and Playground Global’s Jory Bell are joining us for Extra Crunch Live\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/27/1910-genetics-jen-nwankwo-and-playground-globals-jory-bell-are-joining-us-for-extra-crunch-live/", "via": "", "real_tags": ["crunch", "风险投资"]}, {"category": "", "categoryclass": "", "imagename": "0f358e50a71a458f44f8430b1f3adaef.jpg", "infoid": 1070053, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于 RapidSOS 的创始人来说，通过向 911 呼叫添加有用数据（例如位置）来提高应急响应的质量是一个鼓舞人心的目标，并且获得了广泛的支持。只有一个问题：他们将如何创建可行的业务？美国大约 5,700 个公共安全回答点 (PSAP) 并不是很好的竞争者。由于资金紧张且高度分散，911 中心已经将微薄的预算用于人员配备和维护已有数十年历史的设备，而且他们几乎没有资源来改进系统。此外，国会关于中心现代化的拨款法案已经搁置了十多年，我们将在本 EC-1 的第四部分中进一步探讨这个主题。人们显然希望得到更好的紧急服务——毕竟，他们终有一天会拨打 911 并寻求帮助。然而，在紧急情况真正发生之前，他们从不考虑紧急情况，因为 RapidSOS 从我们在第一部分讨论的其 Haven 应用程序的采用率低中学到了。人们还没有准备好提前为这些服务支付月费。那么，谁来支付？谁对美国陈旧的 911 系统感到恼火，愿意花钱修理它？最终，该公司将自己迭代成一个 API 层，一方面是数千个 PSAP，另一方面是应用程序和消费者设备的开发人员。这些开发人员希望在他们的产品中包含安全功能，但不想在数千个不同的机构之间设计数百个软件集成。因此，RapidSOS 的商业模式变成了向 911 呼叫中心提供免费软件，同时向通过其平台连接的科技公司收费。这是一条艰难的道路，也是一个典型的先有鸡还是先有蛋的问题。如果没有呼叫中心集成，科技公司就不会使用 API——在那种情况下它基本上是无用的。就呼叫中心而言，他们不想使用没有任何直接价值的软件，即使它是免费赠送的。这是一个故事，讲述了 RapidSOS 如何从 2017 年起克服这些逆风，最终为自己筹集了数亿美元的风险投资、数千名呼叫代理客户、与 Apple、Google 和 Uber 等公司达成的数十项收入交易，以及与比任何初创公司都有权保护的软件集成商更多。明智的产品决策、精心校准的商业模式和坚韧最终将使公司获得逃逸速度，不仅在美国扩张，而且在全球范围内也越来越多。\n在 EC-1 的第二部分，我将分析 RapidSOS 当前的产品供应和业务战略，探索该公司从消费者应用程序到嵌入式技术的支点，并了解其新兴但不断增长的国际扩张努力。它提供了关于迭代的重要性、如何确保正确的客户反馈以及确定最佳产品策略的关键课程。从 RapidSOS 旅程的最初阶段就很清楚，将数据输入 911 中心将是其第一个关键挑战。整个 911 系统——即使在今天在大多数州——都是为语音而不是数据而构建的。我们在介绍中认识的 RapidSOS 公共安全高级主管 Karin Marquez 在丹佛附近的 PSAP 工作了数十年，从接听电话到高级主管。 “当我开始时，它是一个单人调度中心。所以，我一个人工作，接听 911 电话、非紧急电话、派遣警察、消防和紧急医疗服务，”她说。作为 911 接听员，她对每个电话的第一个要求是弄清楚紧急情况发生的位置——甚至在描述正在发生的事情之前。 “一切都从位置开始，”她说。 “如果我不知道你在哪里，我就不能派你帮忙。我们可以开始建造房屋的其他一切。每一个额外的数据 [点] 将有助于让我们更好地了解紧急情况是什么，可能涉及谁，他们涉及哪种车辆——但如果我没有地址，我就无法发送你帮忙。”", "note_en": "For the founders of RapidSOS, improving the quality of emergency response by adding useful data, like location, to 911 calls was an inspiring objective, and one that garnered widespread support. There was just one problem: How would they create a viable business?\n The roughly 5,700 public safety answering points (PSAPs) in America weren’t great contenders. Cash-strapped and highly decentralized, 911 centers already spent their meager budgets on staffing and maintaining decades-old equipment, and they had few resources to improve their systems. Plus, appropriations bills in Congress to modernize centers have languished for more than a decade,  a topic we’ll explore more in part four of this EC-1.\n  People obviously desire better emergency services — after all, they are the ones who will dial 911 and demand help someday. Yet, they never think about emergencies until they actually happen, as RapidSOS learned from the poor adoption of its Haven app  we discussed in part one. People weren’t ready to pay a monthly subscription for these services in advance.\n So, who would pay? Who was annoyed enough with America’s antiquated 911 system to be willing to shell out dollars to fix it?\n Ultimately, the company iterated itself into essentially an API layer between the thousands of PSAPs on one side and developers of apps and consumer devices on the other. These developers wanted to include safety features in their products, but didn’t want to engineer hundreds of software integrations across thousands of disparate agencies. RapidSOS’ business model thus became offering free software to 911 call centers while charging tech companies to connect through its platform.\n It was a tough road and a classic chicken-and-egg problem. Without call center integrations, tech companies wouldn’t use the API — it was essentially useless in that case. Call centers, for their part, didn’t want to use software that didn’t offer any immediate value, even if it was being given away for free.\n This is the story of how RapidSOS just plowed ahead against those headwinds from 2017 onward, ultimately netting itself hundreds of millions in venture funding, thousands of call agency clients, dozens of revenue deals with the likes of Apple, Google and Uber, and partnerships with more software integrators than any startup has any right to secure. Smart product decisions, a carefully calibrated business model and tenacity would eventually lend the company the escape velocity to not just expand across America, but increasingly across the world as well.\n In this second part of the EC-1, I’ll analyze RapidSOS’ current product offerings and business strategy, explore the company’s pivot from consumer app to embedded technology and take a look at its nascent but growing international expansion efforts. It offers key lessons on the importance of iterating, how to secure the right customer feedback and determining the best product strategy.\n  It became clear from the earliest stages of RapidSOS’ journey that getting data into the 911 center would be its first key challenge. The entire 911 system — even today in most states — is built for voice and not data.\n Karin Marquez, senior director of public safety at RapidSOS, who we met in the introduction, worked for decades at a PSAP near Denver, working her way up from call taker to a senior supervisor. “When I started, it was a one-man dispatch center. So, I was working alone, I was answering 911 calls, non-emergency calls, dispatching police, fire and EMS,” she said.\n  As a 911 call taker, her very first requirement for every call was figuring out where an emergency is taking place — even before characterizing what is happening. “Everything starts with location,” she said. “If I don’t know where you are, I can’t send you help. Everything else we can kind of start to build our house on. Every additional data [point] will help to give us a better understanding of what that emergency is, who may be involved, what kind of vehicle they’re involved in — but if I don’t have an address, I can’t send you help.”", "posttime": "2021-07-27 23:04:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "设计,rapidsos,learned", "title": "RapidSOS 了解到最好的产品设计有时是没有产品设计", "title_en": "\n\t\t\t\tRapidSOS learned that the best product design is sometimes no product design\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/27/rapidsos-ec1-business/", "via": "", "real_tags": ["设计", "rapidsos", "learned"]}, {"category": "", "categoryclass": "", "imagename": "5a274d39e40d10c279f94d3a621d31a5.jpg", "infoid": 1070052, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "他与 Nick Horelik 和 Matt Bozik 很早就一起被该行业的复杂性和缺乏创新所吸引。 “优步刚刚出来。我可以按一个按钮就可以得到一辆车。为什么我不能按一个按钮就叫救护车？然后它激发了这种好奇心，”马丁说。他寻求知识，但对于这样一个关键系统，信息很少。 “维基百科关于乔治克鲁尼的文章比关于 911 的文章要长得多，”他指出。于是开始了与 RapidSOS 近十年的旅程，马丁和他的团队首先尝试构建一个名为 Haven 的消费者安全应用程序，然后专门帮助数十家科技公司，包括苹果和谷歌以及像 SiriusXM 这样的设备公司，连接到无数的 911 软件供应商。一路上，他们经历了创业生活的变幻莫测，疯狂地从产品转向产品，试图让消费者甚至关心紧急情况。这并不容易，公司花了数年时间才最终迈出大步。但是 RapidSOS 的故事是一个使命、一个社区、一个团队和一个梦想，即每个紧急情况都应该有最好的机会尽可能积极地得到解决。马丁在印第安纳州罗克波特的乡村小镇外长大，今天的人口约为 2,500 人。他的母亲是当地的医生，他和他的兄弟习惯了农村农耕生活的开放和厌倦。 “我们在 35 英亩的土地上长大；我们有一个巨大的花园和一个小果园之类的东西，”他说。 “我们举办了‘驾驶拖拉机上学日’。”", "note_en": "He, along with Nick Horelik and Matt Bozik very early on, became fascinated by the complexity and lack of innovation in the sector. “Uber had just come out. I could press a button and get a car. Why can’t I just press a button and get an ambulance? And then it sparks this curiosity,” Martin said. He sought knowledge, but for such a critical system, information was sparse. “The Wikipedia article on George Clooney is way longer than the one on 911,” he noted.\n So began a nearly decade-long journey with RapidSOS that would see Martin and his team first attempt to build a consumer-safety app called Haven before pivoting exclusively to helping dozens of tech companies, including Apple and Google and device companies like SiriusXM, connect to a myriad of 911 software vendors. Along the way, they experienced the full vagaries of startup life, frenetically pivoting from product to product as they tried to get consumers to even  care about emergencies.\n It wasn’t easy, and it took years before the company finally hit its stride. But RapidSOS’s story is one of a mission, a community, a team and a dream that every emergency should have the best chance to be resolved as positively as possible.\n  Martin grew up outside the rural town of Rockport, Indiana, population about 2,500 today. His mother was the local doctor, and he and his brother habituated to the openness and ennui of rural farming life. “We grew up on 35 acres of land; we had an enormous garden and a little hobby orchard and stuff like that,” he said. “We had ‘Drive-Your-Tractor-To-School Day.&#39;”", "posttime": "2021-07-27 23:04:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "披萨,pizza", "title": "吸烟披萨烤箱和偷来的美元钞票，或 RapidSOS 的早期故事", "title_en": "\n\t\t\t\tSmoking pizza ovens and pilfered dollar bills, or the early story of RapidSOS\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/27/rapidsos-ec1-origin/", "via": "", "real_tags": ["披萨", "pizza"]}, {"category": "", "categoryclass": "", "imagename": "a522497f380cb7847173d8357e143e92.jpg", "infoid": 1070051, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "数字可以具有深刻的文化意义，但很少有数字能像美国的紧急电话号码 911 那样引起共鸣。很少有人想拨打它，但当他们必须拨打时，它就可以——每次都有效。一个行业协会估计，每年有 2.4 亿个 911 电话拨打，从日常响亮的狗到特殊的恐怖袭击。虽然它可能是一个单一的数字，但 911 电话被定向到全国大约 5,700 个公共安全应答点 (PSAP)，所有这些都具有独立运营、多样化的设备、不同的软件、多种多样的组织结构以及人员和资源的巨大不平等。 “每个 911 中心都非常不同，它们与它们所服务的社区一样多样化和独特，”我们稍后会见的 Karin Marquez 说。您拥有拥有数十名员工和最好设备的大型城市中心，并且“您在美国农村设有代理机构，其中有一个人 24/7 全天候工作，他们每天接听三个电话。”这些组织面临着严峻的挑战：转换他们的系统以将来自数十亿新消费设备的信息纳入 911 响应的核心。来自移动 GPS 的位置、来自健康档案的医疗信息、来自相机的视频片段——当警察、消防员和护理人员到达现场时，所有这些都可能有用。但是，您如何将数百家科技公司与无数 911 技术提供商联系起来呢？在过去八年中，RapidSOS 已成为解决此问题的首选解决方案。 RapidSOS 筹集了超过 1.9 亿美元，其中包括今年 2 月的 8500 万美元融资，现在涵盖近 5,000 个 PSAP，每年处理超过 1.5 亿个紧急情况，而且它的技术几乎可以肯定集成到您携带的智能手机和许多您身边的设备（该公司通过其软件统计了大约 3.5 亿台连接设备）。然而，与许多紧急情况一样，该公司的故事是一种逆转、误导和紧急情况，因为其创始人努力寻找启动 911 响应的模型。 RapidSOS 很可能是唯一一家从消费者应用转向政府技术/企业混合的初创公司，它拥有我所见过的任何初创公司中最广泛的合作伙伴和集成关系目录。现在，随着它扩展到墨西哥、英国和其他地方，这家起源于印第安纳州农村农场的初创公司正在重新定义 21 世纪的全球应急响应。此 EC-1 的主要作者是 Danny Crichton。除了担任 EC-1 系列编辑、TechCrunch 执行编辑并经常以第三人称谈论自己之外，Danny 还撰写了有关灾难技术的文章，并在 2015 年公开发布之前首次报道了 RapidSOS。这个故事的主编是 Ram Iyer，文案编辑是 Richard Dal Porto，插图由 Nigel Sussman 绘制。\nRapidSOS 对该分析的内容没有发言权，也没有提前访问它。 Crichton 与 RapidSOS 没有财务关系，他的道德披露声明可在此处获得。 RapidSOS EC-1 包含四篇文章，共 12,400 字，阅读时间为 50 分钟。以下是我们将要讨论的主题： 第 1 部分：起源故事“吸烟披萨烤箱和偷来的美元钞票，或 RapidSOS 的早期故事”（2,700 字/11 分钟）——探讨 RapidSOS 的早期和公司的支点从消费者应用程序到政府科技以及为技术和设备公司提供的综合服务。第 2 部分：产品和业务 “RapidSOS 了解到最好的产品设计有时是没有产品设计”（3,700 字/15 分钟）—分析 RapidSOS 如何实现其支点以及为什么其当前的商业模式表现如此出色。第 3 部分：合作伙伴关系“RapidSOS 如何使用创造性的策略来建立大规模的合作伙伴关系和 BD 引擎”（4,000 字/16 分钟）——调查 RapidSOS 如何在寻求转变 911 的过程中建立如此多的企业和个人合作伙伴关系。 4：下一代 911 “十年后，国会可能最终将 911 带入互联网时代”（2,000 字/8 分钟）——展望 911 在十年停滞和来自国会山的有限资金后的未来RapidSOS 的未来前景。我们一直在迭代 EC-1 格式。如果您有任何问题、意见或想法，请通过 danny@techcrunch.com 向 TechCrunch 总编辑 Danny Crichton 发送电子邮件。", "note_en": "Numbers can take on profound cultural significance, but few numbers have quite the resonance as 911, the emergency number for the United States. Few want to dial it, but when they must, it works — every single time.  One industry trade association estimates that 240 million 911 phone calls are made every year, ranging from the quotidian loud dog to the exceptional terrorist attack.\n While it may be a singular number, 911 calls are directed to roughly 5,700 public safety answering points (PSAPs) across the country, all with independent operations, variegated equipment, disparate software, multifarious organizational structures, and vast inequalities of staffing and resources.\n “Every 911 center is very different and they are as diverse and unique as the communities that they serve,” Karin Marquez, who we will meet later, put it. You have massive urban centers with dozens of staffers and the best equipment, and “you have agencies in rural America that have one person working 24/7 and they’re there to answer three calls a day.”\n These organizations face a tough challenge: Transitioning their systems to incorporate information from billions of new consumer devices into the heart of 911 response. Location from mobile GPS, medical information from health profiles, video footage from cameras — all of this could be useful when police, firefighters and paramedics arrive on a scene. But how do you connect hundreds of tech companies to a myriad of 911 technology providers?\n Over the last eight years,  RapidSOS has become the go-to solution for addressing this problem. With more than $190 million raised,  including an $85 million round this past February,  RapidSOS now covers nearly 5,000 PSAPs and processes more than 150 million emergencies every year, and it’s technology is almost certainly integrated into the smartphone you’re carrying and many of the devices you have lying around (the company counts about 350 million connected devices with its software).\n Yet, like many emergencies, the company’s story is one of reverses, misdirections and urgency as its founders worked to find a model to jump-start 911 response. RapidSOS may well be the only startup to pivot from a consumer app to a govtech/enterprise hybrid, and it has the most extensive directory of partnerships and integration relationships of any startup I have ever seen. Now, as it expands to Mexico, the United Kingdom and elsewhere, this startup with its roots in a rural farm in Indiana, is redefining emergency response globally for the 21st Century.\n The lead writer of this EC-1 is  Danny Crichton. In addition to being the EC-1 series editor, managing editor at TechCrunch, and regularly talking about himself in the third person, Danny has been  writing about disaster tech and  first covered RapidSOS back in 2015 prior to its public launch. The lead editor for this story was  Ram Iyer, the copy editor was  Richard Dal Porto, and illustrations were drawn by  Nigel Sussman.\n RapidSOS had no say in the content of this analysis and did not get advance access to it. Crichton has no financial ties to RapidSOS, and  his ethics disclosure statement is available here.\n The RapidSOS EC-1 comprises four articles numbering 12,400 words and a reading time of 50 minutes. Here are the topics we’ll be dialing into:\n Part 1: Origin story “ Smoking pizza ovens and pilfered dollar bills, or the early story of RapidSOS” (2,700 words/11 minutes) — explores the early years of RapidSOS and the company’s pivot from consumer app to govtech and integrated services for technology and device companies.\n Part 2: Product and business “ RapidSOS learned that the best product design is sometimes no product design” (3,700 words/15 minutes) —analyzes how RapidSOS made its pivot and why its current business model has performed so well.\n Part 3: Partnerships “ How RapidSOS used creative tactics to build partnerships and a BD engine at scale” (4,000 words/16 minutes) —investigates how RapidSOS has built up so many dozens of corporate and individual partnerships in its quest to transform 911.\n Part 4: Next-generation 911 “ After a decade, Congress might finally bring 911 into the internet age” (2,000 words/8 minutes) —looks at the future of 911 after a decade of stagnation and limited funding from Capitol Hill as well as the future prospects of RapidSOS.\n We’re always iterating on the EC-1 format. If you have questions, comments or ideas, please send an email to TechCrunch Managing Editor Danny Crichton at  danny@techcrunch.com.", "posttime": "2021-07-27 23:04:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "rapidsos", "title": "RapidSOS EC-1", "title_en": "\n\t\t\t\tThe RapidSOS EC-1\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/27/rapidsos-ec1/", "via": "", "real_tags": ["rapidsos"]}, {"category": "", "categoryclass": "", "imagename": "59f1c4ceb5021523dbbee42927244237.jpg", "infoid": 1070050, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英特尔周二公布了一系列新技术，旨在帮助其在四年内重新夺回处理器制造的领先地位。这些计划带有新上任的首席执行官 Pat Gelsinger 的印记，他已承诺恢复公司的工程领导地位和信誉。这些发展包括提高英特尔芯片功耗的新举措，这是电池寿命的关键因素，同时提高芯片性能。这些技术涉及对处理器构造方式的深度重新设计。 RibbonFET 是一项技术，从根本上重新设计了所有处理器核心的晶体管电路。另一个，PowerVia，重新构想了如何将电力输送到这些晶体管。最后，英特尔正在更新其 Foveros 技术，用于将来自不同来源的芯片元件封装到计算能力的密集堆栈中。英特尔在在线新闻发布会上公布的承诺如果实现，将意味着更快的笔记本电脑和更长的电池寿命。这些进步可以促进云计算公司的人工智能等技术，并加快移动电话网络上的服务。 “在 2025 年，我们认为我们将重新夺回性能桂冠，”今年重新加入英特尔领导公司处理器技术开发的 Sanjay Natarajan 在接受采访时表示。两家公司深信不疑：亚马逊和高通，它们成为首批利用英特尔新代工业务为其他公司制造芯片的客户。英特尔没有详细说明他们的计划，但值得注意的是，这两款设计芯片都是 Arm 处理器家族的成员，可与英特尔的 x86 设计相媲美。英特尔在 7 月初表示，它正在与 100 家潜在客户讨论使用其制造技术，但 Gelsinger 复苏计划的另一部分是让英特尔利用竞争对手的芯片制造能力。近年来，英特尔一直在努力转向更先进的制造技术，推迟推出新的个人电脑和服务器芯片。公司的困境为台积电带头创造了空间。苹果选择该公司来制造 M1 处理器，以取代其 Mac 计算机中的英特尔芯片。台积电还为英伟达、高通和 AMD 等其他英特尔竞争对手生产芯片。\n三星也从英特尔的麻烦中受益。第三大芯片制造商三星为其自己的电子产品以及其他公司生产处理器。尽管陷入困境，英特尔仍然赚了很多钱。 7 月 22 日，它公布了今年第二季度的利润 84 亿美元，收入 196 亿美元。在 Gelsinger 的领导下，英特尔正在投入更多资金用于研发，以支持其长期未来。 VLSI Research 分析师丹·哈奇森 (Dan Hutcheson) 表示：“这是英特尔第一次真正将所有内容整合在一起。我认为这是 Pat 带来的直接结果。” “他让技术人员重新回到驾驶座上。”同样在周一，英特尔表示已重新命名其制造工艺进展多年计划中的每个节点。该公司不再强调与以纳米或十亿分之一米为单位测量的晶体管特征的实际物理尺寸之间日益脆弱的关系。 Hutcheson 说，新的标签方法与其他芯片代工厂使用的术语一致，应该可以阐明英特尔的计划。对于今天的 10 纳米工艺，英特尔的工艺节点名称没有改变。但是以前称为增强型 SuperFin 的改进现在称为 Intel 7。这意味着每瓦性能提高 10% 到 15%。英特尔的 7nm 工艺现在被称为英特尔 4 应该在 2023 年为芯片带来 20% 的每瓦性能增益。英特尔 3 将在 2023 年末出现，并带来另外 18% 的增益； RibbonFET 和 PowerVia 于 2024 年到达 Intel 20A；另一个性能提升应该会在 2025 年通过英特尔 18A 工艺实现。 Real World Technologies 分析师大卫·坎特 (David Kanter) 表示：“很明显，英特尔将提供比代工厂高得多的性能”。这与英特尔多年来难以转向公司最先进的工艺形成鲜明对比。 “四年内有五个工艺节点——这太棒了，”Gelsinger 在活动中说。 “我们处于有利地位，可以为我们的客户实现无可置疑的领导地位。”\nRibbonFET 描述了英特尔技术，称为 Gate all around，或 GAA，旨在使下一代芯片成为可能。台积电和三星已宣布 GAA 技术，但尚未投入生产。英特尔希望它的使用将使公司在 2024 年具有竞争力。在晶体管中，栅极控制电流何时流过组件。这些微小的电流由软件传递给芯片的指令精心编排，决定了数十亿个互连的晶体管如何处理信息。 GAA 技术有助于确保随着芯片变小，门仍然可以控制晶体管。英特尔正在将 RibbonFET 与 PowerVia 配对，这是一种将电力分配给晶体管的新方法。在今天的芯片中，单独的细铜线连接到芯片顶部以提供电源、输入数据和检索输出数据。通过 PowerVia，英特尔将配电线连接到晶体管的底部。 Natarajan 说，与 RibbonFET 一样，结果是“在相同的功率下性能更好”，或者如果你以不同的方式摆弄旋钮，同样的性能和更低的功耗。鉴于英特尔最近的失误，分析师并不相信收益是肯定的。一方面，很难将研发技术转化为高质量、规模化的加工。但英特尔正在努力表达信心。它基于当今对缺陷、性能和可靠性的测量制定计划。它将在 Intel 3 工艺上测试 PowerVia，以确保它也可以在 20A 上进行生产。 “我们一致关注时间表的可预测性，”Natarajan 说。英特尔的 Foveros 技术也有新的改进，可以将较小的芯片堆叠成一个较大的处理元件。 Foveros 推出了一款名为 Lakefield 的芯片，用于超轻型笔记本电脑。下一代技术将出现在英特尔将于 2023 年推出的面向主流 PC 的芯片 Meteor Lake。\n英特尔还详细介绍了 Foveros 的新发展。 Foveros Omni 和 Foveros Direct 都将于 2023 年推出，它们提供了堆叠芯片元件以及通过堆叠发送数据信号和电源的新方法。英特尔工艺和封装工作负责人 Ann Kelleher 表示，Foveros 不仅对英特尔来说意味着更好的灵活性，英特尔将能够将其他公司的芯片纳入 Foveros 设计中，而且对希望组装自己的处理器封装的未来英特尔代工厂客户来说也是如此。 Tirias Research 分析师 Kevin Krewell 表示，Foveros 灵活性优势的一个例子是，英特尔可以使用尖端的生产线制造一些关键的芯片元件，然后使用更旧、更便宜但足够的其他元件设计，例如控制芯片与计算机内存的通信。 . Kelleher 还表示，英特尔计划使用光连接将数据作为光发送的 Foveros 继任者。尽管经过多年的研究，这种硅光子技术尚未成为短数据传输距离的主流，但它仍然是一个活跃的研究领域，因为它可以带来高速和低功耗的好处。在 Gelsinger 回到英特尔之前，所有这些项目都在进行中。但现在不同的是，英特尔在工程方面的重点和资金更加集中，Kelleher 说。 “Pat 非常专注于重返领导层并真正支持工程团队，”Kelleher 说。 “没有人员和资金，项目就不会发生。”", "note_en": "Intel unveiled on Tuesday a smorgasbord of new technologies designed to help it reclaim processor manufacturing leadership within four years. The plans bear the fingerprints of newly installed CEO  Pat Gelsinger, who has pledged to  restore the company&#39;s engineering leadership and credibility.\n The developments include a new push to improve the power usage of Intel chips, a key element of battery life, while simultaneously raising chip performance. The technologies involve deep redesigns to how processors are constructed.\n   One technology, RibbonFET, fundamentally redesigns the transistor circuitry at the heart of all processors. Another, PowerVia, reimagines how electrical power is delivered to those transistors. Lastly, Intel is updating its Foveros technology for packaging chip elements from different sources into dense stacks of computing horsepower.\n Intel&#39;s commitments, unveiled at an online press event, will mean faster laptops with longer battery life, if realized. And the advancements could boost technologies like artificial intelligence at cloud computing companies and speed up the services on mobile phone networks.\n &#34;In 2025, we think we will regain that performance crown,&#34; Sanjay Natarajan, who rejoined Intel this year to lead the company&#39;s processor technology development, said in an interview.\n Two companies that are convinced: Amazon and Qualcomm, which became the first customers to tap into  Intel&#39;s new foundry business to build chips for other companies. Intel didn&#39;t detail their plans, but it&#39;s notable that both design chips that are members of the Arm processor family that rivals Intel&#39;s x86 designs. Intel said earlier in July it&#39;s in discussions with 100 potential customers to use its manufacturing, but another part of Gelsinger&#39;s recovery plan is for Intel to use rivals&#39; chipmaking abilities.\n Intel has struggled in recent years to move to more advanced manufacturing technology, delaying new PC and server chips. The company&#39;s difficulties created room for Taiwan Semiconductor Manufacturing Co. to take the lead. Apple picked the company to build the M1 processors that are replacing Intel chips in its Mac computers. TSMC also makes chips for other Intel rivals like Nvidia, Qualcomm and AMD.\n Samsung too has benefited from Intel&#39;s trouble. The third major chipmaker, Samsung makes processors for its own electronics products, as well as for other companies.\n Despite its struggles, Intel is still making lots of money. On July 22, it reported an  $8.4 billion profit for the second quarter of the year on revenue of $19.6 billion. Under Gelsinger, Intel is investing more money in research and development to support its long-term future.\n &#34;This is the first time Intel really put it all together. I think that&#39;s a direct result of what Pat&#39;s bringing to the party,&#34; said  VLSI Research analyst Dan Hutcheson. &#34;He&#39;s putting the tech people back in the driver&#39;s seat.&#34;\n   Also on Monday, Intel said it has renamed each node on its multiyear plan for manufacturing process progress. The company has deemphasized the increasingly tenuous relationship to the actual physical size of transistor features measured in nanometers, or billionths of a meter. The new labeling approach is in line with the terms in use at other chip foundries and should clarify Intel&#39;s plans, Hutcheson said.\n Intel&#39;s process node name isn&#39;t changing for today&#39;s 10-nanometer process. But an improvement previously called Enhanced SuperFin is now called Intel 7. It&#39;ll mean a 10% to 15% improvement in performance per watt. Intel&#39;s 7nm process is now called Intel 4 should bring a 20% performance per watt gain with chips in 2023. Intel 3 will show up in late 2023 with another 18% gain; RibbonFET and PowerVia arrive in Intel 20A in 2024; and another performance boost should arrive in 2025 with the Intel 18A process.\n &#34;It becomes very clear Intel is going to be delivering a lot higher performance than the foundries&#34; when the gains are combined, said  Real World Technologies analyst David Kanter.\n And it contrasts sharply with Intel&#39;s years of difficulty moving to the company&#39;s most advanced process. &#34;Five process nodes in four years -- that&#39;s tremendous,&#34; Gelsinger said at the event. &#34;We&#39;re in a great position to achieve unquestioned leadership for our customers.&#34;\n   RibbonFET describes Intel technology called gate all around, or GAA, that&#39;s designed to make next-generation chips possible. TSMC and Samsung have announced GAA technology, though it isn&#39;t in production. Intel hopes its use will make the company competitive in 2024.\n In a transistor, a gate controls when electrical current flows through the component. These tiny current flows, orchestrated by the instructions that software delivers to a chip, determine how billions of interconnected transistors can process information. GAA technology helps ensure gates can still control transistors as chips get smaller.\n Intel is pairing RibbonFET with PowerVia, a new way to distribute electrical power to transistors. In today&#39;s chips, separate tiny copper wires attach to the top of the chip to deliver power, as well as input data and to retrieve output data. With PowerVia, Intel connects power distribution wires to the bottom of the transistor instead.\n The upshot, as with RibbonFET, is &#34;better performance at the same power,&#34; or if you fiddle the knobs differently, the same performance with lower power consumption, Natarajan said.\n Given Intel&#39;s recent missteps, analysts aren&#39;t convinced the gains are a sure bet. For one thing, it&#39;s hard to convert research and development technology into high-quality, large-scale processing.\n But Intel is working hard to telegraph confidence. It&#39;s basing plans on today&#39;s measurements for defects, performance and reliability. It&#39;ll test PowerVia on the Intel 3 process to make sure it&#39;s ready for production on 20A, too. &#34;We have put a concerted focus on schedule predictability,&#34; Natarajan said.\n  Also new are improvements to Intel&#39;s Foveros technology for stacking smaller chips into one larger processing element. Foveros debuted with a chip code named Lakefield for ultralight laptops. The next generation of the technology will appear in Meteor Lake, Intel&#39;s chip for mainstream PCs due in 2023.\n Intel also detailed new Foveros developments. Foveros Omni and Foveros Direct, both due in 2023, provide new ways to stack chip elements and to send data signals and power through the stack.\n Foveros means better flexibility not just for Intel, which will be able to incorporate chips from other companies into Foveros designs, but for future Intel foundry customers wanting to assemble their own processor packages, said Ann Kelleher, who leads Intel&#39;s process and packaging work.\n One example of Foveros&#39; flexibility advantage is that Intel could make some key chip elements with cutting-edge manufacturing lines but then use older and cheaper but adequate designs for other elements, like controlling chips&#39; communications with computer memory, said  Tirias Research analyst Kevin Krewell.\n Kelleher also said Intel plans a Foveros successor using optical connections that send data as light. Such silicon photonics technology hasn&#39;t yet become mainstream for short data transfer distances, despite years of work, but it remains an active area of research for the benefits it could bring in high speed and low power.\n All these projects were underway well before Gelsinger returned to Intel. But what&#39;s different now is Intel&#39;s more focused and funded approach to engineering, Kelleher said.\n &#34;Pat is very focused on getting back to leadership and really supportive of engineering teams,&#34; Kelleher said. &#34;Projects don&#39;t happen without people and dollars.&#34;", "posttime": "2021-07-27 22:53:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "芯片,英特尔,复出,details", "title": "英特尔详细说明了到 2025 年超越芯片制造竞争对手的复出计划", "title_en": "Intel Details Comeback Plan To Leapfrog Chipmaking Rivals by 2025", "transed": 1, "url": "https://www.cnet.com/tech/computing/intel-details-comeback-plan-to-leapfrog-chipmaking-rivals-by-2025/", "via": "", "real_tags": ["芯片", "英特尔", "复出", "details"]}, {"category": "", "categoryclass": "", "imagename": "0bd979803c83d0231d911a9a28ae5589.png", "infoid": 1070049, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "路透社 7 月 27 日 - 一家位于纽约的初创公司 Bubble 周二表示，它在由私募股权公司 Insight Partners 牵头的一轮融资中筹集了 1 亿美元，该公司允许非编码人员设计和创建网络应用程序。针对几乎没有编程经验的人的技术应用——在硅谷被称为“无代码”或“低代码”——在大流行期间吸引了新的资金，以帮助克服电子商务激增和在编码员短缺的情况下实现企业数字化。 Bubble 的联合创始人 Emmanuel Straschnov 表示，他和他的合作伙伴于 2012 年在纽约创办了这家公司，当时该市的科技初创公司数量激增，但在不同行业拥有专业知识并拥有好想法的企业家正在努力寻找程序员来帮助他们启动他们的公司。他说，Bubble 的平台允许企业家在不依赖工程师的情况下构建 Airbnb 或 Twitter 等网络应用程序。该公司表示，如今它在全球拥有超过 100 万用户，并且过去一年的收入增长了两倍。 Straschnov 拒绝透露该公司的最新估值。他表示，这笔资金将用于雇用更多工程师并启动“新兵训练营”来教学生和其他人如何使用 Bubble。", "note_en": "July 27 (Reuters) - Bubble, a New York based startup that allows non-coders to design and create web applications, said on Tuesday it raised $100 million in a funding round led by private equity firm Insight Partners.\n Technology applications for people with little programming experience -- known as &#34;no-code&#34; or &#34;low-code&#34; in Silicon Valley -- have attracted fresh funding during the pandemic to help overcome a bottleneck created by a surge in e-commerce and the digitization of businesses amid a shortage of coders.\n Emmanuel Straschnov, Bubble co-founder, said he and his partner started the company in New York in 2012 as the city was seeing a jump in tech startups but entrepreneurs with expertise in different industries with good ideas were struggling to find programmers to help them launch their companies.\n Bubble&#39;s platform allows entrepreneurs to build web applications like Airbnb or Twitter without relying on engineers, he said.\n Today it has more than 1 million users worldwide and has tripled its revenue in the past year, the company said.\n Straschnov declined to disclose the company&#39;s latest valuation. He said the funding would be used to hire more engineers and launch &#34;boot camps&#34; to teach students and others how to use Bubble.", "posttime": "2021-07-27 22:52:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,代码,全球,insight", "title": "总部位于纽约的 Bubble 提供无代码工具来构建网络应用程序，在 Insight Partners 的领导下筹集了 1 亿美元，并表示其在全球拥有超过 100 万用户", "title_en": "New York-based Bubble, which offers no-code tools to build web apps, raises $100M led by Insight Partners and says it has over 1M users globally", "transed": 1, "url": "https://www.reuters.com/technology/no-code-startup-bubble-raises-100-mln-in-round-led-by-insight-partners-2021-07-27/", "via": "", "real_tags": ["程序", "代码", "全球", "insight"]}, {"category": "", "categoryclass": "", "imagename": "a7ac5268a1276d7454a91ad4c3fef55b.jpg", "infoid": 1070047, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Blaize 是一家为汽车、企业和计算机视觉市场开发人工智能边缘计算平台的公司，今天宣布它在由富兰克林邓普顿和淡马锡领投的 D 轮融资中筹集了 7100 万美元，电装和其他新老支持者也参与其中。该公司表示，这笔资金将用于支持其上市和研发工作。大流行加速了边缘计算或靠近所需位置的计算和数据存储的采用。根据 Linux 基金会的边缘状态报告，到 2028 年，数字医疗保健、制造和零售企业特别有可能扩大边缘计算的使用。这主要是因为该技术能够缩短响应时间并节省带宽，同时启用较少约束的数据分析。 Blaize 最初专注于“视觉处理器”以加速传感器融合任务，然后扩展到数据中心、边缘基础设施和企业客户端设备。该公司的 16 核芯片——可提供 16 TOPS 的 AI 推理能力——支持 AI 模型的并发执行，同时支持异构计算密集型工作负载。 Blaize 的芯片利用图形计算和动态流来最大限度地减少非计算数据移动。可以构建模型来集成图像信号处理等功能，以图形表示。开发人员可以在单个架构上构建多个模型直到运行时。 Blaize 的联合创始人 Dinakar Munagala、Ke Yin、Satyaki Koneru 和 Val Cook 在创办公司之前曾在英特尔工作，开发了几代 GPU。 2010年，他们在一间空余的卧室里工作，最终获得了风险投资、天使投资和包括达多·巴纳陶在内的战略投资者的支持和资金。 “客户选择 Blaize ......因为我们解决了他们对专为边缘 AI 要求而设计的产品的未满足需求，”穆纳加拉通过电子邮件告诉 VentureBeat。 “我们通过在性能、功耗、延迟和成本的平衡下更好地满足客户需求而获胜……可编程性——以及它为客户提供的灵活性——也是许多客户的关键，就像我们先进的软件一样，它改变了提高生产力，以加快边缘 AI 部署的投资回报。” “边缘人工智能”描述了在网络边缘的设备上本地处理人工智能模型的架构。根据 Markets and Markets 的数据，全球边缘 AI 软件市场预计将从 2020 年的 5.9 亿美元增长到 2026 年的 18.3 亿美元。德勤估计，迄今为止，已售出超过 7.5 亿个在设备上执行任务的边缘 AI 芯片，价值 2.6 美元亿元的收入。\n初创公司 AIStorm、Hailo、Esperanto Technologies、Quadric、Graphcore、Xnor 和 Flex Logix 等正在开发定制芯片以加速边缘 AI 工作负载。但 Blaize 声称它的与众不同之处在于其无代码软件，该软件实现了“边缘感知”转移学习和优化，以实现高精度的模型后压缩。 “在供应方面，[我们的软件] 帮助硬件供应商增加他们的价值。在需求方面，它允许硬件消费者在没有大量数据科学家的情况下构建应用程序，”穆纳加拉说。 “这对于边缘 AI 的扩散至关重要，就像我们的......硬件产品一样，客户可以使用它来构建满足其特定需求的解决方案。对于边缘 AI 部署，用户需要高效的硬件和使业务技术人员能够开发和部署应用程序的能力，而不是需要聘请昂贵的 AI 数据科学团队。” Blaize 声称它自 2017 年开始创造收入，两年前它才从隐身状态中脱颖而出。该公司的第一个商业产品于第四季度开始发货，Blaize 与汽车原始设备制造商和一级供应商、工业系统集成商、独立软件供应商和最终用户有“多个”客户合作。 “在电动汽车汽车市场，实现续航里程扩展的关键产品特性的低功耗是关键。 [并且] 在 [the] 零售入店行窃用例中，Blaize [一直] 因以五分之一的功率实现必要的性能和准确性而受到青睐，同时利用可编程性运行多个应用程序，”穆纳加拉说。 “总体而言，我们已经能够成功应对因大流行而对正常业务造成的干扰。与大多数公司一样，我们的供应链也受到影响。为了缓解这一挑战，我们提前 18 个月主动下订单。我们的一些客户项目暂时受到大流行的影响，但现在我们看到了反弹。” Blaize 总部位于加利福尼亚州埃尔多拉多山，拥有 300 多名员工。迄今为止，它已筹集了 1.55 亿美元。 VentureBeat 的使命是成为技术决策者的数字城镇广场，以获取有关变革性技术和交易的知识。我们的网站提供有关数据技术和策略的重要信息，以指导您领导您的组织。我们邀请您成为我们社区的一员，以访问：封闭的思想领袖内容和我们珍贵活动的折扣访问权限，例如 Transform 2021：了解更多 成为会员", "note_en": "Blaize, a company developing AI edge computing platforms for automotive, enterprise, and computer vision markets, today announced that it raised $71 million in series D funding led by Franklin Templeton and Temasek, with participation from Denso and other new and existing backers. The company says that the funds will be used to support its go-to-market and R&amp;D efforts.\n The pandemic has accelerated the adoption of edge computing, or computation and data storage that’s located close to where it’s needed. According to the Linux Foundation’s State of the Edge  report, digital health care, manufacturing, and retail businesses are particularly likely to expand their use of edge computing by 2028. This is largely because of the technology’s ability to improve response times and save bandwidth while enabling less constrained data analysis.\n  Blaize initially focused on “vision processors” to speed up  sensor fusion tasks before expanding to datacenters, edge infrastructure, and enterprise client devices. The company’s 16-core chips — which deliver 16 TOPS of AI inference horsepower — enable concurrent execution of AI models while supporting heterogeneous compute-intensive workloads.\n  Blaize’s chips leverage graph computing and dynamic streaming to minimize non-computational data movement. Models can be built to integrate functions such as image signal processing, represented as graphs. And developers can build multiple models on a single architecture through to runtime.\n Blaize’s cofounders — Dinakar Munagala, Ke Yin, Satyaki Koneru, and Val Cook — were at Intel prior to starting the company, developing several generations of GPUs. In 2010, working out of a spare bedroom, they eventually gained support and funding from venture, angel, and strategic investors including  Dado Banatao.\n “Customers are choosing Blaize … because we address their unmet need for products purpose-built for the requirements of edge AI,” Munagala told VentureBeat via email. “We win by achieving a better match for customer requirements with a balance of performance, power, latency, and cost … Programmability — and the flexibility that it gives customers — is key in many accounts as well, as is our advanced software, which transforms productivity for faster return on investment from edge AI deployments.”\n  “ Edge AI” describes architectures in which AI models are processed locally, on devices at the edge of the network.  According to Markets and Markets, the global edge AI software market is anticipated to grow from $590 million in 2020 to $1.83 billion by 2026. Deloitte  estimates more than 750 million edge AI chips that perform tasks on-device have been sold to date, representing $2.6 billion in revenue.\n Startups  AIStorm,  Hailo,  Esperanto Technologies,  Quadric,  Graphcore,  Xnor, and  Flex Logix, among others, are developing chips customized to accelerate edge AI workloads. But Blaize claims it’s differentiated by its no-code software, which implements “edge-aware” transfer learning and optimizations to achieve high accuracy post-model-compression.\n “On the supply side, [our software] helps hardware vendors to multiply their value. On the demand side, it allows consumers of the hardware to construct apps without a legion of data scientists,” Munagala said. “This is critical on the path to proliferation of AI at the edge, as is our … hardware offering that customers can use to build solutions for their specific needs. For edge AI deployments, users need both efficient hardware and the ability to enable business technologists to develop and deploy applications, rather than requiring the hiring of costly AI data science teams.”\n  Blaize claims that it’s generated revenue since 2017, two years before it emerged from stealth. The company’s first commercial product began shipping in Q4, and Blaize has “multiple” customer engagements with automotive OEMs and Tier 1 suppliers, industrial systems integrators, independent software vendors, and end users.\n “In the electric vehicle automotive market, low power to enable the key product feature of range extension is key. [And] in [the] retail shoplifting use case, Blaize [has been] favored for achieving the necessary performance and accuracy at one-fifth the power, while running multiple apps utilizing programmability,” Munagala said. “Overall, we have been able to successfully cope with the disruptions to business as usual that occurred due to the pandemic. As with most companies, our supply chain is affected. To mitigate the challenge, we proactively placed orders for products more than 18 months ahead. Some of our customer projects were temporarily affected by the pandemic, but now we are seeing a rebound.”\n Blaize, which is headquartered in El Dorado Hills, California, has over 300 employees. It’s raised $155 million to date.\n VentureBeat&#39;s mission is to be a digital town square for technical decision-makers to gain knowledge about transformative technology and transact.Our site delivers essential information on data technologies and strategies to guide you as you lead your organizations. We invite you to become a member of our community, to access: gated thought-leader content and discounted access to our prized events, such as   Transform 2021: Learn More\n Become a member", "posttime": "2021-07-27 22:51:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "芯片,设计,bringing,边缘", "title": "定制设计具有新图形流架构的 AI 边缘芯片的 Blaize 筹集了 7100 万美元 D 系列，使其总融资额达到 1.55 亿美元", "title_en": "Blaize, which custom-designs AI edge chips with a new graph streaming architecture, raises $71M Series D, bringing its total raised to $155M", "transed": 1, "url": "https://venturebeat.com/2021/07/27/blaize-raises-71m-for-ai-edge-hardware/", "via": "", "real_tags": ["芯片", "设计", "bringing", "边缘"]}, {"category": "", "categoryclass": "", "imagename": "4da0b0d27e8615414f5127a36145f8ae.jpg", "infoid": 1070046, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "DataRobot 是一家创建企业 AI 开发平台的初创公司，今天完成了由 Altimeter Capital 和 Tiger Global 领投的 3 亿美元 G 轮融资，摩根士丹利的 Counterpoint Global、富兰克林邓普顿、ServiceNow Ventures 和 Sutter Hill Ventures 跟投。这轮融资使 DataRobot 的估值从 2020 年 11 月的 27 亿美元升至 63 亿美元，同时该公司完成了对总部位于华盛顿州西雅图的 MLOps 初创公司 Algorithmia 的收购。首席执行官 Dan Wright 表示，新资金将用于“推动平台创新”和“使 DataRobot 能够为世界各地的客户带来……增强智能”。具体而言，DataRobot 计划建立其上市团队，Sutter Hill 支持公司的招聘计划。赖特在一份声明中说：“这项……投资进一步验证了我们的愿景，即结合人类和机器必须提供的最好的东西，以便为我们的客户提供预测洞察力、增强的数据驱动决策和前所未有的商业价值。” “DataRobot 看到全球越来越多的客户选择我们的平台来大规模解决他们最大的挑战。”人工智能和机器学习的好处有时可能是无形的，但研究表明，这并没有阻止组织大规模采用这些技术。根据Zoho IT部门ManageEngine最近的一项调查，AI的业务部署正在上升。 Gartner 还分别发现，从 2015 年到 2019 年，人工智能的商业使用增长了 270%，IBM 声称，在其 2021 年 5 月的公司报告中，近三分之一的受访者正在使用某种形式的人工智能。然而，人工智能的采用并不总是成功。这就是前 Travelers 研究和建模主管 Jeremy Achin 和 Achin 的前同事 Tom de Godoy 于 2012 年在马萨诸塞州波士顿创立 DataRobot 的原因。联合创始人寻求构建工具来帮助客户准备数据并创建和验证机器学习模型，包括分类、高级回归、时间序列和深度学习算法。 DataRobot 的平台在云平台、本地数据中心或作为完全托管的服务运行。部署后，客户可以使用它从仪表板监控模型并测试、运行和维护模型以优化结果。根据客户的需求，DataRobot 可以通过测试数百甚至数千个问题的解决方案并提供模型来提供预测来自动运行“竞争”。该平台还允许数据科学家探索、组合和塑造一系列数据类型和内容——从传统的行和列表格数据到自由格式的文本、图像和地理空间数据——转化为可用于 AI 模型的资产。 DataRobot 声称自 2015 年以来已经实现了三位数的经常性收入增长，迄今为止在该平台上构建了超过 20 亿个模型。该公司的客户遍及财富 50 强的三分之一以上，包括 Kroger、Nationwide、联想、PNC​​ 以及银行、医疗保健、保险、金融、制造、零售、政府、体育和游戏垂直领域的其他公司。\n新一轮融资使 DataRobot 的融资总额超过 10 亿美元。这使该公司成为世界上资金最多的 AI 初创公司之一——像确定的 AI、Explorium、Ople、Domino Data Lab 和 Kaskada 等竞争对手落后于数亿美元。 DataRobot 表示，其收购 Algorithmia 将“进一步巩固”其作为 MLOps 领域解决方案提供商的地位，该收购是在今天早上 G 系列关闭的同时宣布的。 Wright 表示，DataRobot 将把 Algorithmia 的模型服务工具与其现有的监控和管理功能相结合，为客户提供“最可靠、最具成本效益的运行任何机器学习模型的操作骨干”，包括用于自然语言处理的深度学习工作负载在 CPU 和 GPU 上进行图像处理。 “Algorithmia 的人员和技术显着增强了我们的使命，即通过帮助客户将每个模型投入生产并快速实现价值，快速从实验性 AI 转变为应用型 AI，”Wright 继续说道。 “我们很高兴欢迎 Algorithmia 团队加入，并通过世界一流的企业级 MLOps 基础设施向全球各地的组织推进我们领先的 MLOps 产品。” Algorithmia 由 Diego Oppenheimer 和 Kenny Daniel 于 2014 年创立，提供了一个平台，旨在将具有“企业级”安全和治理的模型投入生产。 Algorithmia 结合了 AI 和 MLOps 以及 DevOps 的实践，建立了用于组织来自 IT、数据科学家和各个部门的客户机器学习工作的流程，以协调将模型迁移到生产中。据首席执行官奥本海默 (Oppenheimer) 称，迄今为止，已有超过 130,000 名 IT 运营人员、数据科学家和工程师使用了 Algorithmia，其中包括默克、安永和德勤等财富 500 强公司。在收购之前，Algorithmia 从 Norwest Venture Partners、Gradient Ventures 和其他投资者那里筹集了 3810 万美元的资金。奥本海默在一份新闻稿中说：“我们明白，除非企业有能力快速、可靠和大规模地交付这些模型，否则他们无法获得机器学习模型的价值。” “多年来，我们很清楚 DataRobot 也认同这一理念，我们很高兴能够结合我们的奉献精神，通过在生产中更快地交付更多模型，同时保护他们的业务，使客户能够在当今市场中蓬勃发展。” DataRobot 的其他收购包括 Nutonian，该公司开发了一项名为 Eureqa 的服务，专注于分类、数字、多序列和时间序列功能。最近，DataRobot 收购了 Nexosis 和 Paxata，这两家公司致力于简化开发人员构建 AI 应用程序和准备数据的方式，以及 Cursor 和 ParallelM。\nVentureBeat 的使命是成为技术决策者的数字城镇广场，以获取有关变革性技术和交易的知识。我们的网站提供有关数据技术和策略的重要信息，以指导您领导您的组织。我们邀请您成为我们社区的一员，以访问：封闭的思想领袖内容和我们珍贵活动的折扣访问权限，例如 Transform 2021：了解更多 成为会员", "note_en": "DataRobot, a startup creating an enterprise AI development platform, today closed a $300 million series G funding round led by Altimeter Capital and Tiger Global, with participation from Morgan Stanley’s Counterpoint Global, Franklin Templeton, ServiceNow Ventures, and Sutter Hill Ventures. The round brings DataRobot’s valuation to $6.3 billion post-money, up from $2.7 billion in  November 2020, and comes as the company finalizes the acquisition of Seattle, Washington-based  MLOps startup Algorithmia.\n CEO Dan Wright says that the new funds will be used to “fuel platform innovation” and “enable DataRobot to bring … augmented intelligence” to clients around the world. Specifically, DataRobot plans to build out its go-to-market teams, with Sutter Hill supporting the company’s hiring initiatives.\n  “This … investment further validates our vision for combining the best that humans and machines have to offer in order to power predictive insights, enhanced data-driven decisions, and unprecedented business value for our customers,” Wright said in a statement. “DataRobot is seeing more customers across the globe choose our platform to solve their biggest challenges at scale.”\n The benefits of AI and machine learning can feel intangible at times, but research shows this hasn’t deterred organizations from adopting the technologies at scale. According to a recent  survey from ManageEngine, the IT division of Zoho, business deployment of AI is on the rise. And Gartner  separately found that business use of AI grew 270% from 2015 to 2019, with IBM claiming that almost one-third of respondents to its corporate May 2021  report are employing some form of  AI.\n AI adoption doesn’t always meet with success, however. That’s why Jeremy Achin, previously director of research and modeling at Travelers, and Tom de Godoy, Achin’s former colleague, founded Boston, Massachusetts-based DataRobot in 2012. The cofounders sought to build tools to help customers prepare data and create and validate machine learning models, including classification, advanced regression, time series, and deep learning algorithms.\n DataRobot’s platform runs on cloud platforms, on-premise datacenters, or as a fully managed service. Once deployed, customers can use it to monitor models from a dashboard and test, run, and maintain the models to optimize outcomes. Depending on a customer’s needs, DataRobot can automatically run a “competition” by testing hundreds or even thousands of solutions to a problem and delivering models to provide predictions. The platform also allows data scientists to explore, combine, and shape a range of data types and content — from traditional tabular data in rows and columns to free-form text, images, and geospatial data — into assets ready for AI models.\n DataRobot claims to have had triple-digit recurring revenue growth dating back to 2015, as well as more than 2 billion models built on the platform to date. The company’s customers span more than a third of the Fortune 50 including Kroger, Nationwide, Lenovo, PNC, and others across banking, health care, insurance, finance, manufacturing, retail, government, sports, and gaming verticals.\n The new round brings DataRobot’s total raised to over $1 billion million. This makes the company one of the  top-funded AI startups in the world — competitors like  Determined AI,  Explorium,  Ople,  Domino Data Lab, and  Kaskada trail hundreds of millions of dollars behind.\n  DataRobot says that its purchase of Algorithmia, which was announced alongside the series G close this morning, will “further cement” its place as the provider of solutions in the MLOps space. According to Wright, DataRobot will integrate Algorithmia’s model-serving tools with its existing monitoring and management capabilities to offer customers access to “the most reliable and cost-effective operational backbone for running any machine learning model,” including deep learning workloads for natural language processing and image processing on CPUs and GPUs.\n “Algorithmia’s people and technology significantly enhance our mission to rapidly move from experimental to applied AI by helping customers bring every model into production with rapid time to value,” Wright continued. “We are thrilled to welcome the Algorithmia team and advance our leading MLOps offering with world-class, enterprise-grade MLOps infrastructure to organizations across the globe.”\n Algorithmia, which was founded in 2014 by Diego Oppenheimer and Kenny Daniel, provides a platform that aims to bring models into production with “enterprise-grade” security and governance. Algorithmia’s combines practices from AI and MLOps and DevOps, establishing processes for organizing customers’ machine learning work from IT, data scientists, and various divisions to orchestrate moving models into production.\n Over 130,000 IT operations, data scientists, and engineers have used Algorithmia to date, including Fortune 500 companies like Merck, Ernst &amp; Young, and Deloitte, according to CEO Oppenheimer. Prior to the acquisition, Algorithmia had raised $38.1 million in capital from Norwest Venture Partners, Gradient Ventures, and other investors.\n “We understand that businesses cannot get the value of their machine learning models unless they have the ability to deliver those models quickly, reliably, and at scale,” Oppenheimer said in a press release. “It’s been clear to us for many years that DataRobot shares this philosophy, and we’re thrilled to combine our dedication of enabling customers to thrive in today’s market by delivering more models in production, faster, while protecting their business.”\n DataRobot’s other acquisitions include Nutonian, which developed a service called Eureqa focused on classification, numeric, multi-series, and time series capabilities. More recently, DataRobot nabbed Nexosis and Paxata, companies working to simplify the way developers build AI apps and prep data, as well as  Cursor and ParallelM.\n VentureBeat&#39;s mission is to be a digital town square for technical decision-makers to gain knowledge about transformative technology and transact.Our site delivers essential information on data technologies and strategies to guide you as you lead your organizations. We invite you to become a member of our community, to access: gated thought-leader content and discounted access to our prized events, such as   Transform 2021: Learn More\n Become a member", "posttime": "2021-07-27 22:51:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,估值,money,模型", "title": "帮助公司训练和部署 ML 模型的 DataRobot 以 6.3B 美元的投后估值筹集了 3 亿美元的 G 系列，高于 2020 年 11 月的 2.7B 美元", "title_en": "DataRobot, which helps companies train and deploy ML models, raises $300M Series G at a $6.3B post-money valuation, up from $2.7B in November 2020", "transed": 1, "url": "https://venturebeat.com/2021/07/27/enterprise-ai-development-platform-datarobot-raises-270m-acquires-algorithmia/", "via": "", "real_tags": ["2020", "估值", "money", "模型"]}, {"category": "", "categoryclass": "", "imagename": "8188b653d3b31cc2110f23711e7dc07a.jpeg", "infoid": 1070045, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于投资者对下一代计算技术的兴趣增加，量子计算初创公司 PsiQuantum Corp. 获得了由贝莱德管理的基金和账户领投的 4.5 亿美元投资。总部位于加利福尼亚州帕洛阿尔托的联合创始人兼首席执行官 Jeremy O&#39;Brien 表示，这笔资金将用于扩大其目前约有 150 人的团队，并建造一台 100 万量子位的机器。公司。 “在这十年内，我们将看到该技术改变世界的应用，”他说。这种商用级量子计算机尚不存在，但最终它们解决问题的速度比传统计算机快数百万倍，并有可能解决普通超级计算机永远无法解决的问题。 O&#39;Brien 博士说，自 2016 年成立以来，PsiQuantum 已经筹集了 6.65 亿美元，其 D 轮融资使其估值达到 31.5 亿美元。他说，这项投资是对公司构建量子计算机方法的验证，该计算机将使用光粒子来存储信息。 O&#39;Brien 博士说，该公司正在 GlobalFoundries Inc. 的帮助下制造这台机器，GlobalFoundries Inc. 是最大的专业芯片生产公司之一。据管理咨询公司波士顿咨询集团称，过去三年来，投资者和企业一直在大力押注量子计算。据咨询集团称，该技术预计到 2040 年将产生高达 8500 亿美元的年度商业价值，用于从欺诈预防到药物发现和产品组合优化的用例。术语业务价值包括增加收入和节省成本。根据研究公司 PitchBook Data Inc. 的数据，在全球范围内，量子计算公司在 2020 年的 77 笔交易中获得了 7.793 亿美元的风险融资，高于 2019 年 69 笔交易的 2.883 亿美元。今年，截至 7 月 23 日，量子计算公司筹集了 2.628 亿美元。根据 PitchBook 的说法，这意味着 PsiQuantum 的交易使 2021 年迄今为止的总资金增加到超过 7 亿美元。通过利用量子物理学，量子计算有可能几乎实时地对大量可能性进行分类，并提出可能的解决方案。传统计算机将信息存储为 0 或 1。量子计算机使用量子位或量子位，它以零和一的复杂混合量子态来表示和存储信息。\nPsiQuantum 计划使用光子或光粒子作为量子位来构建它的机器。联合创始人兼首席战略官 Peter Shadbolt 说，这种方法的优点之一是它可以帮助机器执行可靠的计算而不会出错。该公司的另外两位联合创始人是首席技术专家 Mark Thompson 和首席架构师 Terry Rudolph。所有创始人都拥有物理学和电气工程研究或教学的博士学位和背景。 PsiQuantum 需要克服的挑战之一是它需要在其现有的制造过程中引入新的、更高性能的组件。这种组件的一个例子是更高效的波导，用于在芯片内路由光子。 “我们正在将我们今天没有的新设备放入芯片中，”Shadbolt 博士说。 PsiQuantum 于 5 月宣布与 GlobalFoundries 达成协议，在 GlobalFoundries 的制造工厂制造其量子芯片。 GlobalFoundries 向全球 250 多家客户销售芯片，其中包括美国国防部以及高通、博通、博世和英特尔等公司。华尔街日报最近报道称，英特尔正在洽谈以约 300 亿美元的价格收购 GlobalFoundries。其他公司，如国际商业机器公司、Alphabet Google 和 IonQ Inc. 正在使用不同的技术方法构建量子计算机。技术研究公司 Gartner Inc. 副总裁分析师 Chirag Dekate 表示，与同行相比，PsiQuantum 具有独特的优势，因为它正在与一家芯片代工厂合作，使用最新的半导体设备制造其量子处理器。其他一些公司需要建立自己的量子处理器。芯片制造设施。 PsiQuantum 还没有可供客户测试的早期量子计算原型。然而，这家初创公司表示，它在医疗保健、电子产品和交通运输等领域都有客户，这些客户正在向公司付费以识别量子计算的用例和算法。 PsiQuantum 拒绝透露客户身份。\n贝莱德董事总经理托尼金在一份声明中表示，PsiQuantum 的技术方法是该公司迄今为止“最有前途的”。该公司拒绝让高管接受采访。 D 轮融资的其他投资者包括资产管理公司 Baillie Gifford 和微软风险基金 M12。 M12 董事总经理 Samir Kumar 表示，PsiQuantum 是风险公司的第一笔量子计算投资。 Kumar 先生说，PsiQuantum 的半导体工程人才是投资这家初创公司的主要动机之一。 “他们已经发展成为一家工程驱动的公司。这不是一个科学项目，”库马尔先生说。 Deloitte 更多来自德勤的 CIO 见解 华尔街日报新闻部门未参与此内容的创建。", "note_en": "Quantum computing startup PsiQuantum Corp. has landed a $450 million investment led by funds and accounts managed by  BlackRock  amid increased investor interest in the next-generation computing technique.\n  The funds will be used to expand its team, which currently has about 150 people, and to build a 1 million-quantum-bit machine, said Jeremy O’Brien, co-founder and chief executive of the Palo Alto, Calif.-based company. “Within this decade, we’ll be seeing the world-changing applications of that technology,” he said. Such commercial-grade quantum computers don’t yet exist, but eventually they could solve problems many millions of times faster than a conventional computer and potentially solve problems a regular supercomputer could never solve.\n  PsiQuantum has raised $665 million since its founding in 2016 and its Series D funding brings its valuation to $3.15 billion, Dr. O’Brien said. The investment is validation of the company’s approach to building its quantum computer, which will use particles of light to store information, he said. The company is building the machine with help from GlobalFoundries Inc., one of the largest specialist chip-production companies, Dr. O’Brien said.\n    Investors and corporations have been betting heavily on quantum computing over the past three years, according to Boston Consulting Group, a management consulting firm. The technology is expected to generate up to $850 billion in annual business value by 2040, for use cases ranging from fraud prevention to drug discovery and portfolio optimization, according to the consulting group. The term business value includes both increased revenue and cost savings.\n    Globally, quantum-computing companies landed $779.3 million in venture financing across 77 deals in 2020, surging from $288.3 million in 69 deals in 2019, according to research firm PitchBook Data Inc.\n  This year, quantum-computing companies raised $262.8 million through July 23, according to PitchBook, which means PsiQuantum’s deal increases total funding so far in 2021 to more than $700 million.\n  By harnessing quantum physics, quantum computing has the potential to sort through vast numbers of possibilities in nearly real time and come up with a probable solution. Traditional computers store information as either zeros or ones. Quantum computers use quantum bits, or qubits, which represent and store information in a quantum state that is a complex mix of zero and one.\n  PsiQuantum plans to build its machine using photons, or particles of light, as qubits. One of the advantages of this method is that it could help the machine perform reliable calculations without errors, said Peter Shadbolt, co-founder and chief strategy officer. The company’s other two co-founders are Mark Thompson, who is chief technologist, and Terry Rudolph, chief architect. All of the founders have doctorates and backgrounds in either researching or teaching physics and electrical engineering.\n  One of the challenges that PsiQuantum will need to overcome is that it will need to introduce new, higher-performance components into its existing manufacturing process. One example of such a component is a more efficient waveguide, which is used to route photons inside the chip. “We’re putting new devices into the chip that we don’t have today,” Dr. Shadbolt said.\n  PsiQuantum struck a deal with GlobalFoundries, announced in May, to build its quantum chips at GlobalFoundries’ manufacturing facilities. GlobalFoundries sells chips to more than 250 customers globally, including the U.S. Defense Department and companies such as  Qualcomm   Broadcom  Bosch and  Intel  The Wall Street Journal recently  reported that Intel is in talks to buy GlobalFoundries for about $30 billion.\n  Other companies, such as  International Business Machines  ,  Alphabet  Google and IonQ Inc. are building quantum computers using different technological approaches.\n    PsiQuantum has a unique advantage compared with its peers because it is partnering with a chip foundry to manufacture its quantum processors using the latest semiconductor equipment, said Chirag Dekate, vice president analyst at technology research firm Gartner Inc. Some other companies need to build their own chip-fabrication facilities.\n  PsiQuantum doesn’t have an early-stage quantum computing prototype yet that customers can test.\n  However, the startup says it has customers in sectors ranging from healthcare to electronics and transportation that are paying the company to identify use cases and algorithms for quantum computing. PsiQuantum declined to identify the customers.\n  Tony Kim, managing director at BlackRock, said in a statement that PsiQuantum’s technological approach is the “most promising” the firm has seen to date. The firm declined to make executives available for an interview.\n  Other investors in the Series D round include asset manager Baillie Gifford and  Microsoft  venture fund M12. Samir Kumar, managing director at M12, said PsiQuantum is the venture firm’s first quantum computing investment.\n  PsiQuantum’s semiconductor engineering talent was one of the main motivations for investing in the startup, Mr. Kumar said. “They have advanced to the state of being an engineering-driven company. This is not a science project,” Mr. Kumar said.\n    Deloitte  More CIO Insights from  Deloitte The Wall Street Journal news department was not involved in the creation of this content.", "posttime": "2021-07-27 22:51:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "量子,bringing", "title": "PsiQuantum 旨在构建具有 100 万个量子比特的商用量子计算机，以 3.15 美元的估值筹集了 4.5 亿美元的 D 系列，使总融资额达到 6.65 亿美元", "title_en": "PsiQuantum, which aims to build a commercial quantum computing machine with 1M qubits, raises $450M Series D at $3.15B valuation, bringing total raised to $665M", "transed": 1, "url": "https://www.wsj.com/articles/psiquantum-raises-450-million-to-build-its-quantum-computer-11627387321?mod=djemalertNEWS", "via": "", "real_tags": ["量子", "bringing"]}, {"category": "", "categoryclass": "", "imagename": "7d12d9877722701ca0216928682b9d9d.jpg", "infoid": 1070044, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由 OnePlus 联合创始人 Carl Pei 领导的消费科技初创公司没有正式宣布其 Ear (1) 真正的无线耳塞。经过数月的挑逗、概念图片，甚至是预售，Nothing 在正式发布之前拍卖了 100 对耳塞后，降噪耳机才推出。 Ear (1) 耳塞将于 8 月 17 日在包括美国和英国在内的 45 个国家/地区发售，售价为 99 美元/99 英镑/99 欧元。在一份声明中，贝聿铭称 Ear (1) 是“在杂乱无章的市场中呼吸新鲜空气”，并表示耳塞将“为我们即将到来的互联数字世界定下基调。”贝聿铭此前曾表示，他的Nothing计划是在日益复杂的产品类别中建立一个设备生态系统。耳塞 (1) 的设计基于透明塑料，外观独特，可显露部分内部电路，每个耳塞都有一个颜色编码的圆圈（红色或白色），以指示相应的耳朵。它们配备了 11.6 毫米驱动器，Nothing 的硬件和软件都经过瑞典电子公司 Teenage Engineering 的调校。当耳塞与充电盒一起使用时，电池寿命最长为 34 小时，而在 ANC 关闭的情况下，耳塞本身的电池寿命为 5.7 小时（分别下降到 24 小时和 4 小时，而 ANC 开启）。它们可以使用兼容 Qi 的充电器进行无线充电，也可以通过 USB-C 有线连接。 Ear (1) 在每个耳塞上使用三个麦克风来提供降噪功能，可以在嘈杂的环境中将其设置为最大，如果环境较安静，则可以将其设置为最大，并且在您需要听到正在发生的事情时有一种透明模式你身边。使用麦克风拨打电话时，耳塞还可以消除背景噪音。 Ear (1) 具有点击和手势控制，可以通过配套应用程序进行自定义，该应用程序还可以处理 EQ 和“查找我的耳塞”功能。它们具有蓝牙 5.2 和 IPX4 防水功能，可以让它们经受住汗水和光线飞溅。兼容的 Android 设备将支持快速配对。虽然耳塞将于下个月全面发售，但从 7 月 31 日开始，Nothing 将在自己的网站上销售限量的耳塞。我们将很快对 Ear (1) 耳塞进行全面审查。", "note_en": "Nothing, the consumer tech startup led by OnePlus co-founder Carl Pei, has officially announced its Ear (1) true wireless earbuds. The noise-canceling buds launch after months of  teases,  concept images, and even a presale in which Nothing  auctioned off 100 pairs of the earbuds prior to their official reveal. The Ear (1) earbuds will go on sale on August 17th across 45 countries including the US and UK, priced at $99 / £99 / €99.\n In a statement, Pei calls the Ear (1) “a breath of fresh air in a cluttered and indifferent market,” and said the earbuds will “[set] the tone for our connected digital world to come.” Pei has  previously said his plan for Nothing is to build up an ecosystem of devices across increasingly complex product categories.\n  With a design based around transparent plastic, the Ear (1)’s have a distinctive look that reveals some of their internal circuitry, and each earbud has a color-coded circle (red or white) to indicate the corresponding ear. They’re equipped with 11.6mm drivers, and Nothing’s hardware and software have both been  tuned by Swedish electronics house Teenage Engineering.\n Battery life is rated at up to 34 hours when the earbuds are used with their charging case, and 5.7 hours from the earbuds themselves with ANC off (dropping to 24 hours and four hours with ANC on, respectively). They can be charged wirelessly using Qi-compatible chargers or wired over USB-C. The Ear (1)’s use a trio of microphones on each earbud to offer noise-cancelation, which can be set to maximum for loud environments, light if it’s quieter, and there’s a transparency mode for when you need to hear what’s going on around you. The earbuds also cancel out background noise when using their microphones to make calls.\n   The Ear (1)s have tap and gesture controls, and these can be customized via a companion app which also handles EQ and Find my Earbud functionality. They feature Bluetooth 5.2 and they’re IPX4 water resistant, which should allow them to survive sweat and light splashes. Fast pairing will be supported with compatible Android devices.\n While the earbuds will go on general sale next month, Nothing is selling a limited batch of the earbuds from its own website starting on July 31st. We’ll have a full review of the Ear (1) earbuds coming soon.", "posttime": "2021-07-27 22:50:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "无线,controls,耳塞", "title": "由 OnePlus 联合创始人 Carl Pei 推出的 Nothing 宣布售价 99 美元的 Ear (1) 无线耳塞，将于 8 月 17 日上市，提供手势控制、ANC 等功能", "title_en": "Nothing, launched by OnePlus co-founder Carl Pei, announces $99 Ear (1) wireless earbuds, available August 17 with gesture controls, ANC, and more", "transed": 1, "url": "https://www.theverge.com/2021/7/27/22594353/nothing-ear-1-true-wireless-earbuds-price-release-date-specs-features?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["无线", "controls", "耳塞"]}]